{
    "title": "Decongestion by Representation: Learning to Improve Economic Welfare in Marketplaces",
    "abstract": "arXiv:2306.10606v2 Announce Type: replace  Abstract: Congestion is a common failure mode of markets, where consumers compete inefficiently on the same subset of goods (e.g., chasing the same small set of properties on a vacation rental platform). The typical economic story is that prices decongest by balancing supply and demand. But in modern online marketplaces, prices are typically set in a decentralized way by sellers, and the information about items is inevitably partial. The power of a platform is limited to controlling representations -- the subset of information about items presented by default to users. This motivates the present study of decongestion by representation, where a platform seeks to learn representations that reduce congestion and thus improve social welfare. The technical challenge is twofold: relying only on revealed preferences from the choices of consumers, rather than true preferences; and the combinatorial problem associated with representations that determin",
    "link": "https://arxiv.org/abs/2306.10606",
    "context": "Title: Decongestion by Representation: Learning to Improve Economic Welfare in Marketplaces\nAbstract: arXiv:2306.10606v2 Announce Type: replace  Abstract: Congestion is a common failure mode of markets, where consumers compete inefficiently on the same subset of goods (e.g., chasing the same small set of properties on a vacation rental platform). The typical economic story is that prices decongest by balancing supply and demand. But in modern online marketplaces, prices are typically set in a decentralized way by sellers, and the information about items is inevitably partial. The power of a platform is limited to controlling representations -- the subset of information about items presented by default to users. This motivates the present study of decongestion by representation, where a platform seeks to learn representations that reduce congestion and thus improve social welfare. The technical challenge is twofold: relying only on revealed preferences from the choices of consumers, rather than true preferences; and the combinatorial problem associated with representations that determin",
    "path": "papers/23/06/2306.10606.json",
    "total_tokens": 824,
    "translated_title": "通过表征减缓拥挤: 学习如何提高市场中的经济福利",
    "translated_abstract": "拥挤是市场的一种常见失效模式，在这种情况下，消费者在同一子商品集上进行低效率竞争（例如，在度假租赁平台上追逐同一小部分属性）。传统的经济故事是，价格通过平衡供求来减缓拥挤。但在现代在线市场中，价格通常由卖家以分散的方式设定，并且有关商品的信息不可避免地是部分的。平台的能力仅限于控制表征——默认向用户呈现的有关商品信息的子集。这促使了对通过表征减缓拥挤的研究，即平台试图学习减少拥挤从而提高社会福利的表征。技术挑战是双重的：仅依赖于消费者的选择所揭示的偏好而不是真实偏好；以及与确定表征相关的组合问题。",
    "tldr": "研究了通过表征减缓拥挤的方法，从消费者的选择中学习表征以减少拥挤，提高社会福利。",
    "en_tdlr": "Studied the method of decongestion by representation, learning representations from consumer choices to reduce congestion and improve social welfare."
}