{
    "title": "Unsupervised Anomaly Detection via Nonlinear Manifold Learning. (arXiv:2306.09441v1 [stat.ML])",
    "abstract": "Anomalies are samples that significantly deviate from the rest of the data and their detection plays a major role in building machine learning models that can be reliably used in applications such as data-driven design and novelty detection. The majority of existing anomaly detection methods either are exclusively developed for (semi) supervised settings, or provide poor performance in unsupervised applications where there is no training data with labeled anomalous samples. To bridge this research gap, we introduce a robust, efficient, and interpretable methodology based on nonlinear manifold learning to detect anomalies in unsupervised settings. The essence of our approach is to learn a low-dimensional and interpretable latent representation (aka manifold) for all the data points such that normal samples are automatically clustered together and hence can be easily and robustly identified. We learn this low-dimensional manifold by designing a learning algorithm that leverages either a ",
    "link": "http://arxiv.org/abs/2306.09441",
    "context": "Title: Unsupervised Anomaly Detection via Nonlinear Manifold Learning. (arXiv:2306.09441v1 [stat.ML])\nAbstract: Anomalies are samples that significantly deviate from the rest of the data and their detection plays a major role in building machine learning models that can be reliably used in applications such as data-driven design and novelty detection. The majority of existing anomaly detection methods either are exclusively developed for (semi) supervised settings, or provide poor performance in unsupervised applications where there is no training data with labeled anomalous samples. To bridge this research gap, we introduce a robust, efficient, and interpretable methodology based on nonlinear manifold learning to detect anomalies in unsupervised settings. The essence of our approach is to learn a low-dimensional and interpretable latent representation (aka manifold) for all the data points such that normal samples are automatically clustered together and hence can be easily and robustly identified. We learn this low-dimensional manifold by designing a learning algorithm that leverages either a ",
    "path": "papers/23/06/2306.09441.json",
    "total_tokens": 715,
    "translated_title": "无监督非线性流形学习进行异常检测",
    "translated_abstract": "异常样本指的是与其他数据显著偏离的样本，其检测在构建可靠的机器学习模型中起着重要作用。现有的大多数异常检测方法要么仅适用于（半）监督设置，要么在没有带标记异常样本的无监督应用中表现很差。为了填补这一研究空白，我们介绍了一种基于非线性流形学习的鲁棒、高效且可解释的方法，用于在无监督设置下检测异常。",
    "tldr": "该篇论文提出了一种基于非线性流形学习的无监督异常检测方法，可以鲁棒、高效、可解释地检测数据中的异常样本。",
    "en_tdlr": "This paper proposes a robust, efficient, and interpretable methodology based on nonlinear manifold learning for unsupervised anomaly detection, which can effectively and interpretably identify anomalous samples."
}