{
    "title": "A Rapid Review of Responsible AI frameworks: How to guide the development of ethical AI. (arXiv:2306.05003v1 [cs.AI])",
    "abstract": "In the last years, the raise of Artificial Intelligence (AI), and its pervasiveness in our lives, has sparked a flourishing debate about the ethical principles that should lead its implementation and use in society. Driven by these concerns, we conduct a rapid review of several frameworks providing principles, guidelines, and/or tools to help practitioners in the development and deployment of Responsible AI (RAI) applications. We map each framework w.r.t. the different Software Development Life Cycle (SDLC) phases discovering that most of these frameworks fall just in the Requirements Elicitation phase, leaving the other phases uncovered. Very few of these frameworks offer supporting tools for practitioners, and they are mainly provided by private companies. Our results reveal that there is not a \"catching-all\" framework supporting both technical and non-technical stakeholders in the implementation of real-world projects. Our findings highlight the lack of a comprehensive framework enc",
    "link": "http://arxiv.org/abs/2306.05003",
    "context": "Title: A Rapid Review of Responsible AI frameworks: How to guide the development of ethical AI. (arXiv:2306.05003v1 [cs.AI])\nAbstract: In the last years, the raise of Artificial Intelligence (AI), and its pervasiveness in our lives, has sparked a flourishing debate about the ethical principles that should lead its implementation and use in society. Driven by these concerns, we conduct a rapid review of several frameworks providing principles, guidelines, and/or tools to help practitioners in the development and deployment of Responsible AI (RAI) applications. We map each framework w.r.t. the different Software Development Life Cycle (SDLC) phases discovering that most of these frameworks fall just in the Requirements Elicitation phase, leaving the other phases uncovered. Very few of these frameworks offer supporting tools for practitioners, and they are mainly provided by private companies. Our results reveal that there is not a \"catching-all\" framework supporting both technical and non-technical stakeholders in the implementation of real-world projects. Our findings highlight the lack of a comprehensive framework enc",
    "path": "papers/23/06/2306.05003.json",
    "total_tokens": 922,
    "translated_title": "负责任AI框架的快速评估：如何引导道德AI的开发",
    "translated_abstract": "近年来，人工智能（AI）的崛起及其在我们生活中的普及引发了有关应该在社会中引领其实施和使用的道德原则的繁荣辩论。由这些关切所驱动，我们对几个框架进行了快速回顾，这些框架提供了为开发和部署负责任AI（RAI）应用程序提供指导原则，指南和/或工具。我们将每个框架与不同软件开发生命周期（SDLC）阶段进行映射，发现其中大多数框架仅涵盖需求获取阶段，剩余阶段则无涉及。其中很少数的框架为从业者提供支持工具，主要是由私人公司提供的。我们的结果揭示了当前不存在可以同时支持技术和非技术利益相关方实现现实项目的“笼统”框架。我们的研究强调了缺乏全面框架的问题。",
    "tldr": "该论文快速评估了数个提供指导原则，指南和/或工具的负责任AI框架，并发现其中极少数框架提供支持工具，且没有可同时支持技术和非技术利益相关方实现现实项目的“笼统”框架。",
    "en_tdlr": "This paper conducts a rapid review of several Responsible AI frameworks providing principles, guidelines, and/or tools for practitioners and finds that very few offer supporting tools, revealing a lack of a comprehensive framework supporting both technical and non-technical stakeholders in the implementation of real-world projects."
}