{
    "title": "Clustering-based Identification of Precursors of Extreme Events in Chaotic Systems. (arXiv:2306.16291v1 [physics.flu-dyn])",
    "abstract": "Abrupt and rapid high-amplitude changes in a dynamical system's states known as extreme event appear in many processes occurring in nature, such as drastic climate patterns, rogue waves, or avalanches. These events often entail catastrophic effects, therefore their description and prediction is of great importance. However, because of their chaotic nature, their modelling represents a great challenge up to this day. The applicability of a data-driven modularity-based clustering technique to identify precursors of rare and extreme events in chaotic systems is here explored. The proposed identification framework based on clustering of system states, probability transition matrices and state space tessellation was developed and tested on two different chaotic systems that exhibit extreme events: the Moehliss-Faisst-Eckhardt model of self-sustained turbulence and the 2D Kolmogorov flow. Both exhibit extreme events in the form of bursts in kinetic energy and dissipation. It is shown that th",
    "link": "http://arxiv.org/abs/2306.16291",
    "context": "Title: Clustering-based Identification of Precursors of Extreme Events in Chaotic Systems. (arXiv:2306.16291v1 [physics.flu-dyn])\nAbstract: Abrupt and rapid high-amplitude changes in a dynamical system's states known as extreme event appear in many processes occurring in nature, such as drastic climate patterns, rogue waves, or avalanches. These events often entail catastrophic effects, therefore their description and prediction is of great importance. However, because of their chaotic nature, their modelling represents a great challenge up to this day. The applicability of a data-driven modularity-based clustering technique to identify precursors of rare and extreme events in chaotic systems is here explored. The proposed identification framework based on clustering of system states, probability transition matrices and state space tessellation was developed and tested on two different chaotic systems that exhibit extreme events: the Moehliss-Faisst-Eckhardt model of self-sustained turbulence and the 2D Kolmogorov flow. Both exhibit extreme events in the form of bursts in kinetic energy and dissipation. It is shown that th",
    "path": "papers/23/06/2306.16291.json",
    "total_tokens": 942,
    "translated_title": "基于聚类的混沌系统极端事件前兆的识别",
    "translated_abstract": "在自然界中，如剧烈的气候模式、罕见巨浪或雪崩等过程中，动力系统状态的突然而迅速的高振幅变化被称为极端事件。这些事件往往具有灾难性的影响，因此它们的描述和预测具有重要意义。然而，由于其混沌特性，它们的建模至今仍面临巨大挑战。本文探索了基于数据驱动的基于模块化的聚类技术在混沌系统中识别罕见和极端事件前兆的应用性。提出了一种基于聚类系统状态、概率转移矩阵和状态空间划分的识别框架，并在两个展示极端事件的不同混沌系统上进行了测试：Moehliss-Faisst-Eckhardt自持湍流模型和二维科尔莫戈洛夫流动模型。两者都展示了能量和耗散中的突发极端事件。结果表明，该方法能够有效识别极端事件的前兆。",
    "tldr": "本文研究了基于聚类的方法在混沌系统中识别极端事件前兆的应用，通过聚类系统状态、概率转移矩阵和状态空间划分识别了两个不同混沌系统中的极端事件前兆。",
    "en_tdlr": "This paper explores the application of clustering-based methods to identify precursors of extreme events in chaotic systems, showcasing the effectiveness of clustering system states, probability transition matrices, and state space tessellation in recognizing precursors in two different chaotic systems."
}