{
    "title": "Learnability and Algorithm for Continual Learning. (arXiv:2306.12646v1 [cs.LG])",
    "abstract": "This paper studies the challenging continual learning (CL) setting of Class Incremental Learning (CIL). CIL learns a sequence of tasks consisting of disjoint sets of concepts or classes. At any time, a single model is built that can be applied to predict/classify test instances of any classes learned thus far without providing any task related information for each test instance. Although many techniques have been proposed for CIL, they are mostly empirical. It has been shown recently that a strong CIL system needs a strong within-task prediction (WP) and a strong out-of-distribution (OOD) detection for each task. However, it is still not known whether CIL is actually learnable. This paper shows that CIL is learnable. Based on the theory, a new CIL algorithm is also proposed. Experimental results demonstrate its effectiveness.",
    "link": "http://arxiv.org/abs/2306.12646",
    "context": "Title: Learnability and Algorithm for Continual Learning. (arXiv:2306.12646v1 [cs.LG])\nAbstract: This paper studies the challenging continual learning (CL) setting of Class Incremental Learning (CIL). CIL learns a sequence of tasks consisting of disjoint sets of concepts or classes. At any time, a single model is built that can be applied to predict/classify test instances of any classes learned thus far without providing any task related information for each test instance. Although many techniques have been proposed for CIL, they are mostly empirical. It has been shown recently that a strong CIL system needs a strong within-task prediction (WP) and a strong out-of-distribution (OOD) detection for each task. However, it is still not known whether CIL is actually learnable. This paper shows that CIL is learnable. Based on the theory, a new CIL algorithm is also proposed. Experimental results demonstrate its effectiveness.",
    "path": "papers/23/06/2306.12646.json",
    "total_tokens": 766,
    "translated_title": "学习能力和持续学习算法",
    "translated_abstract": "本文研究了类增量学习（CIL）这一具有挑战性的持续学习（CL）设置。CIL 学习了一系列由不同概念或类别组成的任务序列。任何时候，都将构建一个单一的模型，可以用于预测或分类到目前为止学习的任何类的测试实例，而不需要提供每个测试实例的任务相关信息。虽然许多技术已提出用于 CIL，但它们大多是经验性的。最近显示了，强的 CIL 系统需要强的任务内预测 (WP) 和对每个任务的强的分布外 (OOD) 检测。然而，CIL 是否真正可学习仍未知。本文表明了 CIL 是可学习的，基于此，也提出了一种新的 CIL 算法。实验结果表明了其有效性。",
    "tldr": "本文证明了类增量学习是可学习的，并提出了一种新的算法，实验结果表明其有效性。",
    "en_tdlr": "This paper proves that Class Incremental Learning is learnable and proposes a new algorithm, which is demonstrated to be effective through experimental results."
}