{
    "title": "Adaptive Bernstein Change Detector for High-Dimensional Data Streams. (arXiv:2306.12974v1 [cs.LG])",
    "abstract": "Change detection is of fundamental importance when analyzing data streams. Detecting changes both quickly and accurately enables monitoring and prediction systems to react, e.g., by issuing an alarm or by updating a learning algorithm. However, detecting changes is challenging when observations are high-dimensional. In high-dimensional data, change detectors should not only be able to identify when changes happen, but also in which subspace they occur. Ideally, one should also quantify how severe they are. Our approach, ABCD, has these properties. ABCD learns an encoder-decoder model and monitors its accuracy over a window of adaptive size. ABCD derives a change score based on Bernstein's inequality to detect deviations in terms of accuracy, which indicate changes. Our experiments demonstrate that ABCD outperforms its best competitor by at least 8% and up to 23% in F1-score on average. It can also accurately estimate changes' subspace, together with a severity measure that correlates w",
    "link": "http://arxiv.org/abs/2306.12974",
    "context": "Title: Adaptive Bernstein Change Detector for High-Dimensional Data Streams. (arXiv:2306.12974v1 [cs.LG])\nAbstract: Change detection is of fundamental importance when analyzing data streams. Detecting changes both quickly and accurately enables monitoring and prediction systems to react, e.g., by issuing an alarm or by updating a learning algorithm. However, detecting changes is challenging when observations are high-dimensional. In high-dimensional data, change detectors should not only be able to identify when changes happen, but also in which subspace they occur. Ideally, one should also quantify how severe they are. Our approach, ABCD, has these properties. ABCD learns an encoder-decoder model and monitors its accuracy over a window of adaptive size. ABCD derives a change score based on Bernstein's inequality to detect deviations in terms of accuracy, which indicate changes. Our experiments demonstrate that ABCD outperforms its best competitor by at least 8% and up to 23% in F1-score on average. It can also accurately estimate changes' subspace, together with a severity measure that correlates w",
    "path": "papers/23/06/2306.12974.json",
    "total_tokens": 947,
    "translated_title": "高维数据流自适应伯恩斯坦变化检测器",
    "translated_abstract": "当分析数据流时，变化检测至关重要。快速和准确地检测到变化可以使监测和预测系统做出反应，例如发出警报或更新学习算法。然而，在高维数据中检测变化是具有挑战性的。在高维数据中，变化检测器不仅应能够识别变化发生的时间，还应能够识别发生在哪个子空间中，并且最好还应能量化它们的严重程度。我们提出的ABCd方法具备这些特性。ABCD学习一个编码器-解码器模型，并监测其在自适应大小的窗口内的准确性。ABCD根据伯恩斯坦不等式计算变化得分，以检测准确性方面的偏差，指示变化。我们的实验表明，ABCD在平均F1-score中至少比其最佳竞争对手表现优越了8％，最多可提高23％。它还可以准确地估计变化的子空间，以及与变化大小相关的严重程度指标。",
    "tldr": "本文提出了一个适用于高维数据流的自适应伯恩斯坦变化检测器，具有准确地识别变化发生的时间与子空间，并能够量化严重程度的特性。",
    "en_tdlr": "This paper proposes an adaptive Bernstein change detector (ABCD) for high-dimensional data streams which can accurately detect the timing and subspace of changes, and quantify their severity using Bernstein's inequality. ABCD outperforms its competitors in F1-score on average by at least 8% and up to 23%."
}