{
    "title": "A Survey on Blockchain-Based Federated Learning and Data Privacy. (arXiv:2306.17338v1 [cs.LG])",
    "abstract": "Federated learning is a decentralized machine learning paradigm that allows multiple clients to collaborate by leveraging local computational power and the models transmission. This method reduces the costs and privacy concerns associated with centralized machine learning methods while ensuring data privacy by distributing training data across heterogeneous devices. On the other hand, federated learning has the drawback of data leakage due to the lack of privacy-preserving mechanisms employed during storage, transfer, and sharing, thus posing significant risks to data owners and suppliers. Blockchain technology has emerged as a promising technology for offering secure data-sharing platforms in federated learning, especially in Industrial Internet of Things (IIoT) settings. This survey aims to compare the performance and security of various data privacy mechanisms adopted in blockchain-based federated learning architectures. We conduct a systematic review of existing literature on secur",
    "link": "http://arxiv.org/abs/2306.17338",
    "context": "Title: A Survey on Blockchain-Based Federated Learning and Data Privacy. (arXiv:2306.17338v1 [cs.LG])\nAbstract: Federated learning is a decentralized machine learning paradigm that allows multiple clients to collaborate by leveraging local computational power and the models transmission. This method reduces the costs and privacy concerns associated with centralized machine learning methods while ensuring data privacy by distributing training data across heterogeneous devices. On the other hand, federated learning has the drawback of data leakage due to the lack of privacy-preserving mechanisms employed during storage, transfer, and sharing, thus posing significant risks to data owners and suppliers. Blockchain technology has emerged as a promising technology for offering secure data-sharing platforms in federated learning, especially in Industrial Internet of Things (IIoT) settings. This survey aims to compare the performance and security of various data privacy mechanisms adopted in blockchain-based federated learning architectures. We conduct a systematic review of existing literature on secur",
    "path": "papers/23/06/2306.17338.json",
    "total_tokens": 794,
    "translated_title": "基于区块链的联邦学习和数据隐私调查",
    "translated_abstract": "联邦学习是一种分散式机器学习范式，允许多个客户端通过利用本地计算能力和模型传输进行协作。这种方法通过在异构设备上分布训练数据来减少集中式机器学习方法所带来的成本和隐私问题。然而，联邦学习的缺点是在存储、传输和共享过程中缺乏隐私保护机制，可能导致数据泄露，对数据所有者和供应商带来重大风险。区块链技术已经成为在联邦学习中提供安全数据共享平台的有希望的技术，尤其是在工业物联网（IIoT）环境中。本调查旨在比较在基于区块链的联邦学习架构中采用的各种数据隐私机制的性能和安全性。我们对现有文献进行了系统综述",
    "tldr": "本调查比较了基于区块链的联邦学习架构中采用的各种数据隐私机制的性能和安全性。",
    "en_tdlr": "This survey compares the performance and security of various data privacy mechanisms adopted in blockchain-based federated learning architectures."
}