{
    "title": "Covert Communication Based on the Poisoning Attack in Federated Learning. (arXiv:2306.01342v1 [cs.LG])",
    "abstract": "Covert communication has become an important area of research in computer security. It involves hiding specific information on a carrier for message transmission and is often used to transmit private data, military secrets, and even malware. In deep learning, many methods have been developed for hiding information in models to achieve covert communication. However, these methods are not applicable to federated learning, where model aggregation invalidates the exact information embedded in the model by the client. To address this problem, we propose a novel method for covert communication in federated learning based on the poisoning attack. Our approach achieves 100% accuracy in covert message transmission between two clients and is shown to be both stealthy and robust through extensive experiments. However, existing defense methods are limited in their effectiveness against our attack scheme, highlighting the urgent need for new protection methods to be developed. Our study emphasizes ",
    "link": "http://arxiv.org/abs/2306.01342",
    "context": "Title: Covert Communication Based on the Poisoning Attack in Federated Learning. (arXiv:2306.01342v1 [cs.LG])\nAbstract: Covert communication has become an important area of research in computer security. It involves hiding specific information on a carrier for message transmission and is often used to transmit private data, military secrets, and even malware. In deep learning, many methods have been developed for hiding information in models to achieve covert communication. However, these methods are not applicable to federated learning, where model aggregation invalidates the exact information embedded in the model by the client. To address this problem, we propose a novel method for covert communication in federated learning based on the poisoning attack. Our approach achieves 100% accuracy in covert message transmission between two clients and is shown to be both stealthy and robust through extensive experiments. However, existing defense methods are limited in their effectiveness against our attack scheme, highlighting the urgent need for new protection methods to be developed. Our study emphasizes ",
    "path": "papers/23/06/2306.01342.json",
    "total_tokens": 1028,
    "translated_title": "基于污染攻击的联邦学习隐蔽通信研究",
    "translated_abstract": "隐蔽通信已成为计算机安全领域的重要研究方向。它涉及将特定信息隐藏在载体中进行传输，通常用于传输私人数据、军事机密甚至恶意软件。在深度学习中，已经开发出许多方法来隐藏模型中的信息以实现隐蔽通信。然而，这些方法不适用于联邦学习，因为模型聚合会使客户端嵌入的确切信息失效。为了解决这个问题，我们提出了一种基于污染攻击的联邦学习隐蔽通信方法。我们的方法在两个客户端之间实现了100％的隐蔽消息传输准确性，并经过了大量实验的验证，表现出隐蔽性和稳健性。然而，现有的防御方法对我们的攻击方案的有效性受到限制，凸显了需要开发新的防护方法的紧迫性。我们的研究强调了在联邦学习中隐蔽通信的潜在威胁和相关的安全挑战。",
    "tldr": "本论文提出了一种基于污染攻击的联邦学习隐蔽通信方法，能够在保证隐蔽性和稳健性的同时，在两个客户端之间实现100%的隐蔽消息传输准确性，这在现有防御方法存在限制的情况下强调了联邦学习中隐蔽通信的潜在威胁和对应的安全挑战。"
}