{
    "title": "Feature Representation Learning for NL2SQL Generation Based on Coupling and Decoupling. (arXiv:2306.17646v1 [cs.CL])",
    "abstract": "The NL2SQL task involves parsing natural language statements into SQL queries. While most state-of-the-art methods treat NL2SQL as a slot-filling task and use feature representation learning techniques, they overlook explicit correlation features between the SELECT and WHERE clauses and implicit correlation features between sub-tasks within a single clause. To address this issue, we propose the Clause Feature Correlation Decoupling and Coupling (CFCDC) model, which uses a feature representation decoupling method to separate the SELECT and WHERE clauses at the parameter level. Next, we introduce a multi-task learning architecture to decouple implicit correlation feature representation between different SQL tasks in a specific clause. Moreover, we present an improved feature representation coupling module to integrate the decoupled tasks in the SELECT and WHERE clauses and predict the final SQL query. Our proposed CFCDC model demonstrates excellent performance on the WikiSQL dataset, wit",
    "link": "http://arxiv.org/abs/2306.17646",
    "context": "Title: Feature Representation Learning for NL2SQL Generation Based on Coupling and Decoupling. (arXiv:2306.17646v1 [cs.CL])\nAbstract: The NL2SQL task involves parsing natural language statements into SQL queries. While most state-of-the-art methods treat NL2SQL as a slot-filling task and use feature representation learning techniques, they overlook explicit correlation features between the SELECT and WHERE clauses and implicit correlation features between sub-tasks within a single clause. To address this issue, we propose the Clause Feature Correlation Decoupling and Coupling (CFCDC) model, which uses a feature representation decoupling method to separate the SELECT and WHERE clauses at the parameter level. Next, we introduce a multi-task learning architecture to decouple implicit correlation feature representation between different SQL tasks in a specific clause. Moreover, we present an improved feature representation coupling module to integrate the decoupled tasks in the SELECT and WHERE clauses and predict the final SQL query. Our proposed CFCDC model demonstrates excellent performance on the WikiSQL dataset, wit",
    "path": "papers/23/06/2306.17646.json",
    "total_tokens": 844,
    "translated_title": "基于耦合和解耦的NL2SQL生成的特征表示学习方法",
    "translated_abstract": "NL2SQL任务涉及将自然语言语句解析为SQL查询。目前大多数先进的方法将NL2SQL视为填槽任务，并使用特征表示学习技术，但忽视了SELECT和WHERE子句之间的显式相关特征以及单个子句内部的隐式相关特征。为了解决这个问题，我们提出了一种称为Clause Feature Correlation Decoupling and Coupling (CFCDC)模型的方法，该模型使用特征表示解耦方法在参数级别上将SELECT和WHERE子句分离开。接下来，我们引入了一种多任务学习架构，以解耦特定子句中不同SQL任务之间的隐式相关特征表示。此外，我们提出了一种改进的特征表示耦合模块，将解耦的任务集成到SELECT和WHERE子句中，并预测最终的SQL查询。我们提出的CFCDC模型在WikiSQL数据集上展现出优秀的性能。",
    "tldr": "提出了一种基于耦合和解耦的NL2SQL生成任务的特征表示学习方法，通过显式和隐式相关特征表示的解耦和耦合，实现了更好的性能。"
}