{
    "title": "Developing and Building Ontologies in Cyber Security. (arXiv:2306.00377v1 [cs.CR])",
    "abstract": "Cyber Security is one of the most arising disciplines in our modern society. We work on Cybersecurity domain and in this the topic we chose is Cyber Security Ontologies. In this we gather all latest and previous ontologies and compare them on the basis of different analyzing factors to get best of them. Reason to select this topic is to assemble different ontologies from different era of time. Because, researches that included in this SLR is mostly studied single ontology. If any researcher wants to study ontologies, he has to study every single ontology and select which one is best for his research. So, we assemble different types of ontology and compare them against each other to get best of them. A total 24 papers between years 2010-2020 are carefully selected through systematic process and classified accordingly. Lastly, this SLR have been presented to provide the researchers promising future directions in the domain of cybersecurity ontologies.",
    "link": "http://arxiv.org/abs/2306.00377",
    "context": "Title: Developing and Building Ontologies in Cyber Security. (arXiv:2306.00377v1 [cs.CR])\nAbstract: Cyber Security is one of the most arising disciplines in our modern society. We work on Cybersecurity domain and in this the topic we chose is Cyber Security Ontologies. In this we gather all latest and previous ontologies and compare them on the basis of different analyzing factors to get best of them. Reason to select this topic is to assemble different ontologies from different era of time. Because, researches that included in this SLR is mostly studied single ontology. If any researcher wants to study ontologies, he has to study every single ontology and select which one is best for his research. So, we assemble different types of ontology and compare them against each other to get best of them. A total 24 papers between years 2010-2020 are carefully selected through systematic process and classified accordingly. Lastly, this SLR have been presented to provide the researchers promising future directions in the domain of cybersecurity ontologies.",
    "path": "papers/23/06/2306.00377.json",
    "total_tokens": 810,
    "translated_title": "在网络安全中开发和构建本体论",
    "translated_abstract": "网络安全是我们现代社会中最受关注的学科之一。我们在网络安全领域工作，选择了网络安全本体论作为研究主题。我们汇集了最新和以前的本体论，并根据不同的分析因素进行比较，以找到最佳方案。选择此主题的原因是汇集来自不同时代的不同本体论。因为研究中包括的SLR大多研究单个本体论。如果任何研究人员想要研究本体论，他必须研究每个单独的本体论并选择最适合他研究的。因此，我们汇集了不同类型的本体论，并相互比较以得到最佳方案。通过系统性过程认真选择了2010年至2020年间的24篇论文，并进行了分类。最后，本SLR呈现给研究人员有关网络安全本体论领域的有前途的未来方向。",
    "tldr": "通过比较不同本体论，该论文提供了有关网络安全本体论领域的未来方向。",
    "en_tdlr": "This paper provides promising future directions in the field of cybersecurity ontologies by comparing and analyzing different ontologies."
}