{
    "title": "Benchmarking Robustness of AI-enabled Multi-sensor Fusion Systems: Challenges and Opportunities. (arXiv:2306.03454v1 [cs.SE])",
    "abstract": "Multi-Sensor Fusion (MSF) based perception systems have been the foundation in supporting many industrial applications and domains, such as self-driving cars, robotic arms, and unmanned aerial vehicles. Over the past few years, the fast progress in data-driven artificial intelligence (AI) has brought a fast-increasing trend to empower MSF systems by deep learning techniques to further improve performance, especially on intelligent systems and their perception systems. Although quite a few AI-enabled MSF perception systems and techniques have been proposed, up to the present, limited benchmarks that focus on MSF perception are publicly available. Given that many intelligent systems such as self-driving cars are operated in safety-critical contexts where perception systems play an important role, there comes an urgent need for a more in-depth understanding of the performance and reliability of these MSF systems. To bridge this gap, we initiate an early step in this direction and construc",
    "link": "http://arxiv.org/abs/2306.03454",
    "context": "Title: Benchmarking Robustness of AI-enabled Multi-sensor Fusion Systems: Challenges and Opportunities. (arXiv:2306.03454v1 [cs.SE])\nAbstract: Multi-Sensor Fusion (MSF) based perception systems have been the foundation in supporting many industrial applications and domains, such as self-driving cars, robotic arms, and unmanned aerial vehicles. Over the past few years, the fast progress in data-driven artificial intelligence (AI) has brought a fast-increasing trend to empower MSF systems by deep learning techniques to further improve performance, especially on intelligent systems and their perception systems. Although quite a few AI-enabled MSF perception systems and techniques have been proposed, up to the present, limited benchmarks that focus on MSF perception are publicly available. Given that many intelligent systems such as self-driving cars are operated in safety-critical contexts where perception systems play an important role, there comes an urgent need for a more in-depth understanding of the performance and reliability of these MSF systems. To bridge this gap, we initiate an early step in this direction and construc",
    "path": "papers/23/06/2306.03454.json",
    "total_tokens": 964,
    "translated_title": "AI多传感器融合系统鲁棒性基准测试：挑战和机遇",
    "translated_abstract": "基于多传感器融合（MSF）的感知系统是支撑许多工业应用和领域的基础，例如自动驾驶汽车、机器人臂和无人机。近年来，数据驱动的人工智能（AI）在深度学习技术方面的快速进步为MSF系统的性能提高提供了快速增长的趋势，特别是在智能系统及其感知系统方面。尽管提出了许多基于AI的MSF感知系统和技术，但到目前为止，公开的专注于MSF感知的基准测试有限。鉴于许多智能系统（如自动驾驶汽车）在感知系统在安全关键的环境中运行，这就急需更深入地了解这些MSF系统的性能和可靠性。为了弥补这一差距，我们朝着这个方向迈出了早期的一步，并构建了一个基于AI的MSF感知系统基准测试套件，专注于对抗性攻击的鲁棒性和不同环境下的泛化性能。",
    "tldr": "本篇论文研究了AI多传感器融合系统的鲁棒性问题，特别关注在安全关键的环境中的表现和可靠性，并提出了基于AI的MSF感知系统基准测试套件。",
    "en_tdlr": "This paper studies the robustness of AI-enabled multi-sensor fusion systems, focusing on their performance and reliability in safety-critical environments. A benchmark suite for AI-enabled MSF perception systems is proposed to address this issue."
}