{
    "title": "Enhancing Dynamic Image Advertising with Vision-Language Pre-training. (arXiv:2306.14112v1 [cs.IR])",
    "abstract": "In the multimedia era, image is an effective medium in search advertising. Dynamic Image Advertising (DIA), a system that matches queries with ad images and generates multimodal ads, is introduced to improve user experience and ad revenue. The core of DIA is a query-image matching module performing ad image retrieval and relevance modeling. Current query-image matching suffers from limited and inconsistent data, and insufficient cross-modal interaction. Also, the separate optimization of retrieval and relevance models affects overall performance. To address this issue, we propose a vision-language framework consisting of two parts. First, we train a base model on large-scale image-text pairs to learn general multimodal representation. Then, we fine-tune the base model on advertising business data, unifying relevance modeling and retrieval through multi-objective learning. Our framework has been implemented in Baidu search advertising system \"Phoneix Nest\". Online evaluation shows that ",
    "link": "http://arxiv.org/abs/2306.14112",
    "context": "Title: Enhancing Dynamic Image Advertising with Vision-Language Pre-training. (arXiv:2306.14112v1 [cs.IR])\nAbstract: In the multimedia era, image is an effective medium in search advertising. Dynamic Image Advertising (DIA), a system that matches queries with ad images and generates multimodal ads, is introduced to improve user experience and ad revenue. The core of DIA is a query-image matching module performing ad image retrieval and relevance modeling. Current query-image matching suffers from limited and inconsistent data, and insufficient cross-modal interaction. Also, the separate optimization of retrieval and relevance models affects overall performance. To address this issue, we propose a vision-language framework consisting of two parts. First, we train a base model on large-scale image-text pairs to learn general multimodal representation. Then, we fine-tune the base model on advertising business data, unifying relevance modeling and retrieval through multi-objective learning. Our framework has been implemented in Baidu search advertising system \"Phoneix Nest\". Online evaluation shows that ",
    "path": "papers/23/06/2306.14112.json",
    "total_tokens": 935,
    "translated_title": "通过视觉-语言预训练增强动态图像广告",
    "translated_abstract": "在多媒体时代，图像是搜索广告中一种有效的媒介。动态图像广告(DIA)是一种系统，它将查询与广告图像匹配并生成多模式广告，从而提高用户体验和广告收益。DIA的核心是查询-图像匹配模块，执行广告图像检索和相关性建模。当前的查询-图像匹配存在数据有限和不一致以及跨模态交互不足的问题。而且，检索和相关性模型的分别优化影响了整体性能。为了解决这个问题，我们提出了一个视觉-语言框架，由两部分组成。首先，我们在大规模图像文本对上训练一个基础模型，学习通用的多模态表示。然后，我们在广告商业数据上对基础模型进行微调，通过多目标学习统一相关性建模和检索。我们的框架已经在百度搜索广告系统\"Phoneix Nest\"上实现。在线评估表明，我们的框架相较于传统方法取得了显著的提升。",
    "tldr": "该论文提出了一种视觉-语言框架，在大规模图像文本对上训练基础模型，并在广告商业数据上进行微调，通过多目标学习统一相关性建模和检索。该框架可以显著提高动态图像广告(DIA)的性能。",
    "en_tdlr": "This paper proposes a vision-language framework, which pre-trains a base model on large-scale image-text pairs and fine-tunes on advertising business data with multi-objective learning to unify relevance modeling and retrieval. The framework significantly improves the performance of Dynamic Image Advertising (DIA)."
}