{
    "title": "G-TRACER: Expected Sharpness Optimization. (arXiv:2306.13914v1 [stat.ML])",
    "abstract": "We propose a new regularization scheme for the optimization of deep learning architectures, G-TRACER (\"Geometric TRACE Ratio\"), which promotes generalization by seeking flat minima, and has a sound theoretical basis as an approximation to a natural-gradient descent based optimization of a generalized Bayes objective. By augmenting the loss function with a TRACER, curvature-regularized optimizers (eg SGD-TRACER and Adam-TRACER) are simple to implement as modifications to existing optimizers and don't require extensive tuning. We show that the method converges to a neighborhood (depending on the regularization strength) of a local minimum of the unregularized objective, and demonstrate competitive performance on a number of benchmark computer vision and NLP datasets, with a particular focus on challenging low signal-to-noise ratio problems.",
    "link": "http://arxiv.org/abs/2306.13914",
    "context": "Title: G-TRACER: Expected Sharpness Optimization. (arXiv:2306.13914v1 [stat.ML])\nAbstract: We propose a new regularization scheme for the optimization of deep learning architectures, G-TRACER (\"Geometric TRACE Ratio\"), which promotes generalization by seeking flat minima, and has a sound theoretical basis as an approximation to a natural-gradient descent based optimization of a generalized Bayes objective. By augmenting the loss function with a TRACER, curvature-regularized optimizers (eg SGD-TRACER and Adam-TRACER) are simple to implement as modifications to existing optimizers and don't require extensive tuning. We show that the method converges to a neighborhood (depending on the regularization strength) of a local minimum of the unregularized objective, and demonstrate competitive performance on a number of benchmark computer vision and NLP datasets, with a particular focus on challenging low signal-to-noise ratio problems.",
    "path": "papers/23/06/2306.13914.json",
    "total_tokens": 782,
    "translated_title": "G-TRACER: 预期清晰度优化",
    "translated_abstract": "我们提出了一种新的深度学习结构优化正则化方案，G-TRACER（\"Geometric TRACE Ratio\"），通过寻求平坦最小值促进泛化，并具有以广义Bayes目标的自然梯度下降为基础的理论基础。通过使用TRACER增加损失函数，曲率正则化优化器（例如SGD-TRACER和Adam-TRACER）可以作为现有优化器的修改简单地实现，不需要进行广泛的调整。我们展示了该方法收敛于未正则化目标的局部最小值附近（取决于正则化强度的邻域范围），并在许多基准计算机视觉和NLP数据集上展示了竞争性能，特别关注挑战性的低信噪比问题。",
    "tldr": "G-TRACER是一种正则化深度学习结构优化方案，重点解决低信噪比问题，能有效促进泛化并获得了竞争性能。",
    "en_tdlr": "G-TRACER is a regularization scheme for optimizing deep learning architectures, which focuses on low signal-to-noise ratio problems, promotes generalization, and achieves competitive performance on benchmark datasets."
}