{
    "title": "BitE : Accelerating Learned Query Optimization in a Mixed-Workload Environment. (arXiv:2306.00845v2 [cs.DB] UPDATED)",
    "abstract": "Although the many efforts to apply deep reinforcement learning to query optimization in recent years, there remains room for improvement as query optimizers are complex entities that require hand-designed tuning of workloads and datasets. Recent research present learned query optimizations results mostly in bulks of single workloads which focus on picking up the unique traits of the specific workload. This proves to be problematic in scenarios where the different characteristics of multiple workloads and datasets are to be mixed and learned together. Henceforth, in this paper, we propose BitE, a novel ensemble learning model using database statistics and metadata to tune a learned query optimizer for enhancing performance. On the way, we introduce multiple revisions to solve several challenges: we extend the search space for the optimal Abstract SQL Plan(represented as a JSON object called ASP) by expanding hintsets, we steer the model away from the default plans that may be biased by ",
    "link": "http://arxiv.org/abs/2306.00845",
    "context": "Title: BitE : Accelerating Learned Query Optimization in a Mixed-Workload Environment. (arXiv:2306.00845v2 [cs.DB] UPDATED)\nAbstract: Although the many efforts to apply deep reinforcement learning to query optimization in recent years, there remains room for improvement as query optimizers are complex entities that require hand-designed tuning of workloads and datasets. Recent research present learned query optimizations results mostly in bulks of single workloads which focus on picking up the unique traits of the specific workload. This proves to be problematic in scenarios where the different characteristics of multiple workloads and datasets are to be mixed and learned together. Henceforth, in this paper, we propose BitE, a novel ensemble learning model using database statistics and metadata to tune a learned query optimizer for enhancing performance. On the way, we introduce multiple revisions to solve several challenges: we extend the search space for the optimal Abstract SQL Plan(represented as a JSON object called ASP) by expanding hintsets, we steer the model away from the default plans that may be biased by ",
    "path": "papers/23/06/2306.00845.json",
    "total_tokens": 837,
    "translated_title": "BitE：在混合工作负载环境中加速学习的查询优化",
    "translated_abstract": "近年来，尽管有许多将深度强化学习应用于查询优化的努力，但查询优化器是复杂的实体，需要手动调整工作负载和数据集以进行优化。 最近的研究主要集中于单一工作负载的学习查询优化结果，这些结果侧重于捕捉特定工作负载的独特特性。 然而，在多个工作负载和数据集具有不同特征且需要混合和学习的情况下，这种方法面临问题。 因此，在本文中，我们提出了 BitE，一种新颖的集成学习模型，利用数据库统计和元数据来调整学习查询优化器以提高性能。 在此过程中，我们引入了多个修订版来解决几个挑战：通过扩展提示集扩展最优Abstract SQL Plan（表示为名为ASP的JSON对象）的搜索空间，将模型引向可能偏袒的默认计划之外。",
    "tldr": "本文提出了BitE，一种新颖的集成学习模型，利用数据库统计和元数据来调整学习查询优化器以提高性能。"
}