{
    "title": "MATNet: Multi-Level Fusion Transformer-Based Model for Day-Ahead PV Generation Forecasting",
    "abstract": "arXiv:2306.10356v2 Announce Type: replace-cross  Abstract: Accurate forecasting of renewable generation is crucial to facilitate the integration of RES into the power system. Focusing on PV units, forecasting methods can be divided into two main categories: physics-based and data-based strategies, with AI-based models providing state-of-the-art performance. However, while these AI-based models can capture complex patterns and relationships in the data, they ignore the underlying physical prior knowledge of the phenomenon. Therefore, in this paper we propose MATNet, a novel self-attention transformer-based architecture for multivariate multi-step day-ahead PV power generation forecasting. It consists of a hybrid approach that combines the AI paradigm with the prior physical knowledge of PV power generation of physics-based methods. The model is fed with historical PV data and historical and forecast weather data through a multi-level joint fusion approach. The effectiveness of the propo",
    "link": "https://arxiv.org/abs/2306.10356",
    "context": "Title: MATNet: Multi-Level Fusion Transformer-Based Model for Day-Ahead PV Generation Forecasting\nAbstract: arXiv:2306.10356v2 Announce Type: replace-cross  Abstract: Accurate forecasting of renewable generation is crucial to facilitate the integration of RES into the power system. Focusing on PV units, forecasting methods can be divided into two main categories: physics-based and data-based strategies, with AI-based models providing state-of-the-art performance. However, while these AI-based models can capture complex patterns and relationships in the data, they ignore the underlying physical prior knowledge of the phenomenon. Therefore, in this paper we propose MATNet, a novel self-attention transformer-based architecture for multivariate multi-step day-ahead PV power generation forecasting. It consists of a hybrid approach that combines the AI paradigm with the prior physical knowledge of PV power generation of physics-based methods. The model is fed with historical PV data and historical and forecast weather data through a multi-level joint fusion approach. The effectiveness of the propo",
    "path": "papers/23/06/2306.10356.json",
    "total_tokens": 820,
    "translated_title": "MATNet: 多级融合变压器模型用于日前光伏发电预测",
    "translated_abstract": "准确预测可再生能源发电对促进可再生能源整合到电力系统中至关重要。针对光伏单元，预测方法主要可分为基于物理和基于数据的策略两类，基于人工智能的模型提供了最先进的性能。然而，虽然这些基于人工智能的模型可以捕捉数据中的复杂模式和关系，但它们忽略了现象的潜在物理先验知识。因此，在本文中，我们提出了MATNet，一种新颖的基于自注意力变压器架构，用于多元多步日前光伏发电预测。它采用一种混合方法，将人工智能范式与基于物理的光伏发电的先验知识相结合。该模型通过多级联合融合方法输入历史光伏数据以及历史和预测天气数据。",
    "tldr": "提出了MATNet，结合了人工智能范式与光伏发电的物理先验知识，通过多级联合融合方法进行日前光伏发电预测"
}