{
    "title": "Towards a robust and reliable deep learning approach for detection of compact binary mergers in gravitational wave data. (arXiv:2306.11797v1 [gr-qc])",
    "abstract": "The ability of deep learning (DL) approaches to learn generalised signal and noise models, coupled with their fast inference on GPUs, holds great promise for enhancing gravitational-wave (GW) searches in terms of speed, parameter space coverage, and search sensitivity. However, the opaque nature of DL models severely harms their reliability. In this work, we meticulously develop a DL model stage-wise and work towards improving its robustness and reliability. First, we address the problems in maintaining the purity of training data by deriving a new metric that better reflects the visual strength of the \"chirp\" signal features in the data. Using a reduced, smooth representation obtained through a variational auto-encoder (VAE), we build a classifier to search for compact binary coalescence (CBC) signals. Our tests on real LIGO data show an impressive performance of the model. However, upon probing the robustness of the model through adversarial attacks, its simple failure modes were ide",
    "link": "http://arxiv.org/abs/2306.11797",
    "context": "Title: Towards a robust and reliable deep learning approach for detection of compact binary mergers in gravitational wave data. (arXiv:2306.11797v1 [gr-qc])\nAbstract: The ability of deep learning (DL) approaches to learn generalised signal and noise models, coupled with their fast inference on GPUs, holds great promise for enhancing gravitational-wave (GW) searches in terms of speed, parameter space coverage, and search sensitivity. However, the opaque nature of DL models severely harms their reliability. In this work, we meticulously develop a DL model stage-wise and work towards improving its robustness and reliability. First, we address the problems in maintaining the purity of training data by deriving a new metric that better reflects the visual strength of the \"chirp\" signal features in the data. Using a reduced, smooth representation obtained through a variational auto-encoder (VAE), we build a classifier to search for compact binary coalescence (CBC) signals. Our tests on real LIGO data show an impressive performance of the model. However, upon probing the robustness of the model through adversarial attacks, its simple failure modes were ide",
    "path": "papers/23/06/2306.11797.json",
    "total_tokens": 987,
    "translated_title": "针对引力波数据中的紧凑二进制合并事件检测，实现深度学习方法的稳健可靠",
    "translated_abstract": "深度学习（DL）方法通过学习泛化的信号和噪声模型以及在GPU上快速推断，为增强引力波（GW）搜索的速度、参数空间覆盖和搜索灵敏度提供了巨大的希望，但是DL模型的不透明性严重损害了其可靠性。在本研究中，我们逐步开发一个DL模型，并努力改进其稳健性和可靠性。首先，我们解决了保持训练数据纯度的问题，通过导出一种更好地反映数据中“啁啾”信号特征视觉强度的新度量标准。利用通过变分自编码器（VAE）获得的减少、平滑的表示，我们构建了一个分类器来搜索紧凑二进制合并（CBC）信号。我们在真实的LIGO数据上的测试表明了该模型的出色性能。然而，在通过对抗性攻击来探究模型的稳健性时，其简单故障模式则成为了一个痛点。",
    "tldr": "本篇论文通过开发一个能在保持数据纯度的前提下实现稳健性和可靠性的深度学习模型，提高了搜索速度、参数空间覆盖和搜索灵敏度，而该模型在LIGO数据上测试的表现表明其具有出色的性能。"
}