{
    "title": "On Pitfalls of Test-Time Adaptation. (arXiv:2306.03536v1 [cs.LG])",
    "abstract": "Test-Time Adaptation (TTA) has recently emerged as a promising approach for tackling the robustness challenge under distribution shifts. However, the lack of consistent settings and systematic studies in prior literature hinders thorough assessments of existing methods. To address this issue, we present TTAB, a test-time adaptation benchmark that encompasses ten state-of-the-art algorithms, a diverse array of distribution shifts, and two evaluation protocols. Through extensive experiments, our benchmark reveals three common pitfalls in prior efforts. First, selecting appropriate hyper-parameters, especially for model selection, is exceedingly difficult due to online batch dependency. Second, the effectiveness of TTA varies greatly depending on the quality and properties of the model being adapted. Third, even under optimal algorithmic conditions, none of the existing methods are capable of addressing all common types of distribution shifts. Our findings underscore the need for future r",
    "link": "http://arxiv.org/abs/2306.03536",
    "context": "Title: On Pitfalls of Test-Time Adaptation. (arXiv:2306.03536v1 [cs.LG])\nAbstract: Test-Time Adaptation (TTA) has recently emerged as a promising approach for tackling the robustness challenge under distribution shifts. However, the lack of consistent settings and systematic studies in prior literature hinders thorough assessments of existing methods. To address this issue, we present TTAB, a test-time adaptation benchmark that encompasses ten state-of-the-art algorithms, a diverse array of distribution shifts, and two evaluation protocols. Through extensive experiments, our benchmark reveals three common pitfalls in prior efforts. First, selecting appropriate hyper-parameters, especially for model selection, is exceedingly difficult due to online batch dependency. Second, the effectiveness of TTA varies greatly depending on the quality and properties of the model being adapted. Third, even under optimal algorithmic conditions, none of the existing methods are capable of addressing all common types of distribution shifts. Our findings underscore the need for future r",
    "path": "papers/23/06/2306.03536.json",
    "total_tokens": 973,
    "translated_title": "浅谈测试时间适应的陷阱",
    "translated_abstract": "测试时间适应（TTA）最近被认为是解决在分布转移情况下鲁棒性挑战的一种很有前途的方法。然而，之前文献中缺乏一致的设置和系统性研究，这妨碍了现有方法的彻底评估。为了解决这个问题，我们提出了TTAB，一个测试时间适应基准，包括十种最先进的算法，多种不同的分布转移情况和两种评估协议。通过大量实验，我们的基准揭示了之前工作中的三个常见缺陷。首先，由于在线批次依赖性，选择适当的超参数，特别是模型选择，非常困难。其次，TTA的有效性因被适应的模型的质量和属性而有很大差异。第三，即使在最佳算法条件下，现有方法也不能解决所有常见类型的分布转移情况。我们的发现强调了未来研究测试时间适应技术及其一致和全面的评估协议的重要性。",
    "tldr": "这篇论文介绍了测试时间适应（TTA）最近被认为是解决在分布转移情况下鲁棒性挑战的一种很有前途的方法，提出了测试时间适应基准TTAB，并发现了之前方法中的三个常见缺陷。",
    "en_tdlr": "This paper discusses the pitfalls of test-time adaptation (TTA), which is considered a promising approach for addressing the robustness challenge under distribution shifts. The authors propose a TTA benchmark called TTAB and reveal three common pitfalls in prior efforts, including the difficulty of selecting appropriate hyperparameters, the varying effectiveness of TTA depending on the adapted model, and the inability of existing methods to address all common types of distribution shifts."
}