{
    "title": "A clustering and graph deep learning-based framework for COVID-19 drug repurposing. (arXiv:2306.13995v1 [cs.AI])",
    "abstract": "Drug repurposing (or repositioning) is the process of finding new therapeutic uses for drugs already approved by drug regulatory authorities (e.g., the Food and Drug Administration (FDA) and Therapeutic Goods Administration (TGA)) for other diseases. This involves analyzing the interactions between different biological entities, such as drug targets (genes/proteins and biological pathways) and drug properties, to discover novel drug-target or drug-disease relations. Artificial intelligence methods such as machine learning and deep learning have successfully analyzed complex heterogeneous data in the biomedical domain and have also been used for drug repurposing. This study presents a novel unsupervised machine learning framework that utilizes a graph-based autoencoder for multi-feature type clustering on heterogeneous drug data. The dataset consists of 438 drugs, of which 224 are under clinical trials for COVID-19 (category A). The rest are systematically filtered to ensure the safety ",
    "link": "http://arxiv.org/abs/2306.13995",
    "context": "Title: A clustering and graph deep learning-based framework for COVID-19 drug repurposing. (arXiv:2306.13995v1 [cs.AI])\nAbstract: Drug repurposing (or repositioning) is the process of finding new therapeutic uses for drugs already approved by drug regulatory authorities (e.g., the Food and Drug Administration (FDA) and Therapeutic Goods Administration (TGA)) for other diseases. This involves analyzing the interactions between different biological entities, such as drug targets (genes/proteins and biological pathways) and drug properties, to discover novel drug-target or drug-disease relations. Artificial intelligence methods such as machine learning and deep learning have successfully analyzed complex heterogeneous data in the biomedical domain and have also been used for drug repurposing. This study presents a novel unsupervised machine learning framework that utilizes a graph-based autoencoder for multi-feature type clustering on heterogeneous drug data. The dataset consists of 438 drugs, of which 224 are under clinical trials for COVID-19 (category A). The rest are systematically filtered to ensure the safety ",
    "path": "papers/23/06/2306.13995.json",
    "total_tokens": 1059,
    "translated_title": "基于聚类和图深度学习的 COVID-19 药物再利用框架",
    "translated_abstract": "药物再利用 (或重新定位) 是寻找已经获得药物监管机构 (例如美国食品药品监督管理局和治疗商品管理局) 批准用于其他疾病的药物的新治疗用途的过程。这包括分析不同生物实体之间的相互作用，例如药物靶点 (基因/蛋白质和生物通路) 和药物属性，以发现新的药物靶点或药物-疾病关系。机器学习和深度学习等人工智能方法已经成功地分析了生物医学领域中复杂的异质数据，并且已被用于药物再利用。本研究提出了一种新的无监督机器学习框架，其利用基于图的自编码器在异质药物数据上进行多特征类型聚类。数据集包括 438 种药物，其中 224 种正在接受 COVID-19 临床试验 (类别 A)。其余药物经过系统过滤以确保再利用潜在药物候选物的安全性 (类别 B)。所提出的框架在 COVID-19 特定药物再利用任务上进行评估，结果表明它能够揭示有见地的药物相互作用并确定潜在有效的药物再利用候选物。",
    "tldr": "本文提出了一种基于聚类和图深度学习的方法，在 COVID-19 药物再利用中发现了具有见地的药物相互作用，并确定了潜在有效的药物再利用候选物。",
    "en_tdlr": "This paper presents a clustering and graph deep learning-based approach for COVID-19 drug repurposing, which uncovers insightful drug interactions and identifies potentially effective drug candidates for repurposing."
}