{
    "title": "A Modular Test Bed for Reinforcement Learning Incorporation into Industrial Applications. (arXiv:2306.01440v1 [cs.AI])",
    "abstract": "This application paper explores the potential of using reinforcement learning (RL) to address the demands of Industry 4.0, including shorter time-to-market, mass customization, and batch size one production. Specifically, we present a use case in which the task is to transport and assemble goods through a model factory following predefined rules. Each simulation run involves placing a specific number of goods of random color at the entry point. The objective is to transport the goods to the assembly station, where two rivets are installed in each product, connecting the upper part to the lower part. Following the installation of rivets, blue products must be transported to the exit, while green products are to be transported to storage. The study focuses on the application of reinforcement learning techniques to address this problem and improve the efficiency of the production process.",
    "link": "http://arxiv.org/abs/2306.01440",
    "context": "Title: A Modular Test Bed for Reinforcement Learning Incorporation into Industrial Applications. (arXiv:2306.01440v1 [cs.AI])\nAbstract: This application paper explores the potential of using reinforcement learning (RL) to address the demands of Industry 4.0, including shorter time-to-market, mass customization, and batch size one production. Specifically, we present a use case in which the task is to transport and assemble goods through a model factory following predefined rules. Each simulation run involves placing a specific number of goods of random color at the entry point. The objective is to transport the goods to the assembly station, where two rivets are installed in each product, connecting the upper part to the lower part. Following the installation of rivets, blue products must be transported to the exit, while green products are to be transported to storage. The study focuses on the application of reinforcement learning techniques to address this problem and improve the efficiency of the production process.",
    "path": "papers/23/06/2306.01440.json",
    "total_tokens": 808,
    "translated_title": "用于工业应用中强化学习集成的模块化测试平台",
    "translated_abstract": "本应用论文探讨了使用强化学习（RL）来应对工业4.0的需求，包括缩短上市时间、大规模定制和批量级别的生产的潜力。具体而言，我们提出了一个使用案例，任务是按照预定义的规则通过模型工厂传输和组装货物。每次模拟运行涉及将特定数量的随机颜色的货物放置在入口处。目标是将商品运输到装配站，在其中安装两个铆钉，将上部连接到下部。在铆钉安装后，蓝色产品必须被运输到出口，而绿色产品则必须被运输到存储区。本研究重点关注强化学习技术在解决问题和提高生产效率方面的应用。",
    "tldr": "本论文探究了如何运用强化学习技术提高工业应用的效率，以传输和组装货物为例，实现缩短上市时间、大规模定制和批量级别的生产。"
}