{
    "title": "Doubly Stochastic Graph-based Non-autoregressive Reaction Prediction. (arXiv:2306.06119v1 [physics.chem-ph])",
    "abstract": "Organic reaction prediction is a critical task in drug discovery. Recently, researchers have achieved non-autoregressive reaction prediction by modeling the redistribution of electrons, resulting in state-of-the-art top-1 accuracy, and enabling parallel sampling. However, the current non-autoregressive decoder does not satisfy two essential rules of electron redistribution modeling simultaneously: the electron-counting rule and the symmetry rule. This violation of the physical constraints of chemical reactions impairs model performance. In this work, we propose a new framework called that combines two doubly stochastic self-attention mappings to obtain electron redistribution predictions that follow both constraints. We further extend our solution to a general multi-head attention mechanism with augmented constraints. To achieve this, we apply Sinkhorn's algorithm to iteratively update self-attention mappings, which imposes doubly conservative constraints as additional informative prio",
    "link": "http://arxiv.org/abs/2306.06119",
    "context": "Title: Doubly Stochastic Graph-based Non-autoregressive Reaction Prediction. (arXiv:2306.06119v1 [physics.chem-ph])\nAbstract: Organic reaction prediction is a critical task in drug discovery. Recently, researchers have achieved non-autoregressive reaction prediction by modeling the redistribution of electrons, resulting in state-of-the-art top-1 accuracy, and enabling parallel sampling. However, the current non-autoregressive decoder does not satisfy two essential rules of electron redistribution modeling simultaneously: the electron-counting rule and the symmetry rule. This violation of the physical constraints of chemical reactions impairs model performance. In this work, we propose a new framework called that combines two doubly stochastic self-attention mappings to obtain electron redistribution predictions that follow both constraints. We further extend our solution to a general multi-head attention mechanism with augmented constraints. To achieve this, we apply Sinkhorn's algorithm to iteratively update self-attention mappings, which imposes doubly conservative constraints as additional informative prio",
    "path": "papers/23/06/2306.06119.json",
    "total_tokens": 839,
    "translated_title": "双重随机图网络非自回归反应预测",
    "translated_abstract": "有机反应预测是药物研发中的重要任务。最近，研究人员通过建模电子再分配实现了非自回归反应预测，取得了最先进的top-1精度并实现了并行抽样。然而，当前的非自回归解码器不能同时满足电子分配规则和对称规则这两个基本规则。这种化学反应物理约束的违反会损害模型的性能。本研究提出了一种新的框架，将两个双重随机自注意映射结合起来，得到遵循这两个约束的电子再分配预测。我们还将这种解决方案扩展到一个具有增强约束的通用多头注意机制。为了实现这一目标，我们采用Sinkhorn算法来迭代更新自我关注映射，进而引入了双重保守约束作为额外的信息优先考虑。",
    "tldr": "本文提出了一种新的框架，该框架将两个双重随机自注意映射结合起来，实现遵循化学反应物理约束的电子再分配预测。",
    "en_tdlr": "This paper proposes a new framework that combines two doubly stochastic self-attention mappings to obtain electron redistribution predictions that follow physical constraints of chemical reactions, achieving state-of-the-art non-autoregressive reaction prediction in drug discovery."
}