{
    "title": "Detecting Consumers' Financial Vulnerability using Open Banking Data: Evidence from UK Payday Loans. (arXiv:2306.01749v1 [stat.AP])",
    "abstract": "Behind the debt trap concept is the rationale that payday loans exacerbate consumers' financial vulnerability. To investigate this relationship, we propose a Mixed Poisson Hidden Markov approach to model the number of payday loans a borrower obtains in each period. Given the lack of agreement in the literature on financial vulnerability, we introduce financial distress as an unobserved binary variable using a hidden Markov process (vulnerable and non-vulnerable). Using data from 90,523 anonymised transactions for 1,817 UK consumers, we find that the effect of certain time-varying covariates depends greatly on the borrower's hidden state. For instance, luxury expenses and non-recurring income increase the need for payday loans when financially vulnerable, but the opposite is true when not vulnerable. Additionally, we demonstrate that almost 60\\% of payday loan borrowers remain vulnerable for 12 or more consecutive weeks, with two-thirds experiencing consistent financial difficulties. Fi",
    "link": "http://arxiv.org/abs/2306.01749",
    "context": "Title: Detecting Consumers' Financial Vulnerability using Open Banking Data: Evidence from UK Payday Loans. (arXiv:2306.01749v1 [stat.AP])\nAbstract: Behind the debt trap concept is the rationale that payday loans exacerbate consumers' financial vulnerability. To investigate this relationship, we propose a Mixed Poisson Hidden Markov approach to model the number of payday loans a borrower obtains in each period. Given the lack of agreement in the literature on financial vulnerability, we introduce financial distress as an unobserved binary variable using a hidden Markov process (vulnerable and non-vulnerable). Using data from 90,523 anonymised transactions for 1,817 UK consumers, we find that the effect of certain time-varying covariates depends greatly on the borrower's hidden state. For instance, luxury expenses and non-recurring income increase the need for payday loans when financially vulnerable, but the opposite is true when not vulnerable. Additionally, we demonstrate that almost 60\\% of payday loan borrowers remain vulnerable for 12 or more consecutive weeks, with two-thirds experiencing consistent financial difficulties. Fi",
    "path": "papers/23/06/2306.01749.json",
    "total_tokens": 1022,
    "translated_title": "利用开放银行数据检测消费者的财务脆弱性：以英国的发薪日贷款为例",
    "translated_abstract": "债务陷阱背后的理念是，发薪日贷款加剧了消费者的财务脆弱性。 为了调查这种关系，我们提出了一种混合Poisson隐Markov方法来模拟借款人每期获得发薪日贷款的数量。 鉴于文献中对于财务脆弱性缺乏一致性，我们利用一个隐Markov过程（脆弱和非脆弱）引入金融困境作为一个未观测到的二元变量。利用来自1,817名英国消费者的90,523个匿名交易数据，我们发现某些时变协变量的影响在很大程度上取决于借款人的隐状态。例如，在财务脆弱时，奢侈开支和非经常性收入增加了发薪日贷款的需求，但在非脆弱时则相反。此外，我们证明了近60％的发薪日贷款借款人在连续12周或更长时间保持脆弱状态，其中三分之二的人面临着持续的财务困难。",
    "tldr": "本文利用混合Poisson隐Markov方法，以英国发薪日贷款为例，探究了债务陷阱背后的理念，即发薪日贷款加剧了消费者的财务脆弱性，发现某些时变协变量的影响在很大程度上取决于借款人的隐状态。",
    "en_tdlr": "This article explores the concept behind the debt trap, which holds that payday loans exacerbate consumers' financial vulnerability, using a Mixed Poisson Hidden Markov approach on data from UK payday loans and finds that the effect of certain time-varying covariates greatly depends on the borrower's hidden state."
}