{
    "title": "Social AI and the Challenges of the Human-AI Ecosystem. (arXiv:2306.13723v1 [cs.AI])",
    "abstract": "The rise of large-scale socio-technical systems in which humans interact with artificial intelligence (AI) systems (including assistants and recommenders, in short AIs) multiplies the opportunity for the emergence of collective phenomena and tipping points, with unexpected, possibly unintended, consequences. For example, navigation systems' suggestions may create chaos if too many drivers are directed on the same route, and personalised recommendations on social media may amplify polarisation, filter bubbles, and radicalisation. On the other hand, we may learn how to foster the \"wisdom of crowds\" and collective action effects to face social and environmental challenges. In order to understand the impact of AI on socio-technical systems and design next-generation AIs that team with humans to help overcome societal problems rather than exacerbate them, we propose to build the foundations of Social AI at the intersection of Complex Systems, Network Science and AI. In this perspective pape",
    "link": "http://arxiv.org/abs/2306.13723",
    "context": "Title: Social AI and the Challenges of the Human-AI Ecosystem. (arXiv:2306.13723v1 [cs.AI])\nAbstract: The rise of large-scale socio-technical systems in which humans interact with artificial intelligence (AI) systems (including assistants and recommenders, in short AIs) multiplies the opportunity for the emergence of collective phenomena and tipping points, with unexpected, possibly unintended, consequences. For example, navigation systems' suggestions may create chaos if too many drivers are directed on the same route, and personalised recommendations on social media may amplify polarisation, filter bubbles, and radicalisation. On the other hand, we may learn how to foster the \"wisdom of crowds\" and collective action effects to face social and environmental challenges. In order to understand the impact of AI on socio-technical systems and design next-generation AIs that team with humans to help overcome societal problems rather than exacerbate them, we propose to build the foundations of Social AI at the intersection of Complex Systems, Network Science and AI. In this perspective pape",
    "path": "papers/23/06/2306.13723.json",
    "total_tokens": 1036,
    "translated_title": "社交AI与人工智能生态系统的挑战。",
    "translated_abstract": "大规模的社会技术系统中，人与人工智能（AI）系统相互作用的崛起（包括助手和推荐系统）增加了出现集体现象和临界点的机会，并可能带来意想不到的、可能是意外的后果。例如，导航系统的建议可能会在太多的司机被引导到同一路线时造成混乱，社交媒体上的个性化推荐可能会放大极化、过滤气泡和激进化。另一方面，我们可以学习如何培育“群体智慧”和集体行动效应，以应对社会和环境挑战。为了理解人工智能对社会技术系统的影响并设计与人类合作以帮助克服社会问题的下一代人工智能，我们建议在复杂系统、网络科学和人工智能的交叉点上建立社交AI的基础。在这个角度上，我们提出了从研究人工智能生态系统中出现的挑战开始讨论社交AI提高集体问题解决能力的潜力。我们认为，社交AI可以为社会带来显著的利益，但也引发了需要解决的新的技术和伦理挑战。",
    "tldr": "本文介绍了人工智能生态系统研究中出现的挑战，并探讨了社交AI提高集体问题解决能力方面的潜力，同时也需要解决新的技术和伦理问题。",
    "en_tdlr": "This article presents the challenges arising from the study of the Human-AI Ecosystem and discusses the potential of Social AI to enhance collective problem-solving. Social AI can bring significant benefits for society, but also gives rise to new technical and ethical challenges that need to be addressed."
}