{
    "title": "Local Message Passing on Frustrated Systems. (arXiv:2306.01494v1 [cs.LG])",
    "abstract": "Message passing on factor graphs is a powerful framework for probabilistic inference, which finds important applications in various scientific domains. The most wide-spread message passing scheme is the sum-product algorithm (SPA) which gives exact results on trees but often fails on graphs with many small cycles. We search for an alternative message passing algorithm that works particularly well on such cyclic graphs. Therefore, we challenge the extrinsic principle of the SPA, which loses its objective on graphs with cycles. We further replace the local SPA message update rule at the factor nodes of the underlying graph with a generic mapping, which is optimized in a data-driven fashion. These modifications lead to a considerable improvement in performance while preserving the simplicity of the SPA. We evaluate our method for two classes of cyclic graphs: the 2x2 fully connected Ising grid and factor graphs for symbol detection on linear communication channels with inter-symbol interf",
    "link": "http://arxiv.org/abs/2306.01494",
    "context": "Title: Local Message Passing on Frustrated Systems. (arXiv:2306.01494v1 [cs.LG])\nAbstract: Message passing on factor graphs is a powerful framework for probabilistic inference, which finds important applications in various scientific domains. The most wide-spread message passing scheme is the sum-product algorithm (SPA) which gives exact results on trees but often fails on graphs with many small cycles. We search for an alternative message passing algorithm that works particularly well on such cyclic graphs. Therefore, we challenge the extrinsic principle of the SPA, which loses its objective on graphs with cycles. We further replace the local SPA message update rule at the factor nodes of the underlying graph with a generic mapping, which is optimized in a data-driven fashion. These modifications lead to a considerable improvement in performance while preserving the simplicity of the SPA. We evaluate our method for two classes of cyclic graphs: the 2x2 fully connected Ising grid and factor graphs for symbol detection on linear communication channels with inter-symbol interf",
    "path": "papers/23/06/2306.01494.json",
    "total_tokens": 785,
    "translated_title": "基于困难系统的局部消息传递",
    "translated_abstract": "因子图上的消息传递是概率推理的强大框架，在各种科学领域中具有重要应用。最广泛使用的消息传递方案是求和-积算法（SPA），它在树上可得到精确结果，但在具有许多小循环的图上往往失败。我们寻求一种替代的消息传递算法，特别适用于这种循环图。为此，我们挑战了SPA的外部原则，这失去了在循环图上的客观性。我们进一步用数据驱动的方式将底层图的因子节点处的本地SPA消息更新规则替换为通用映射。这些修改提高了性能，同时保持了SPA的简单性。我们对两类循环图进行了评估：2x2完全连接的Ising网格和线性通信通道上的符号检测因子图。",
    "tldr": "本文提出了一种优化的基于困难系统的局部消息传递算法，能够在循环图上获得良好的表现。",
    "en_tdlr": "This paper proposes an optimized local message passing algorithm based on frustrated systems, which performs well on cyclic graphs."
}