{
    "title": "High-Resolution Convolutional Neural Networks on Homomorphically Encrypted Data via Sharding Ciphertexts. (arXiv:2306.09189v2 [cs.CR] UPDATED)",
    "abstract": "Recently, Deep Convolutional Neural Networks (DCNNs) including the ResNet-20 architecture have been privately evaluated on encrypted, low-resolution data with the Residue-Number-System Cheon-Kim-Kim-Song (RNS-CKKS) homomorphic encryption scheme. We extend methods for evaluating DCNNs on images with larger dimensions and many channels, beyond what can be stored in single ciphertexts. Additionally, we simplify and improve the efficiency of the recently introduced multiplexed image format, demonstrating that homomorphic evaluation can work with standard, row-major matrix packing and results in encrypted inference time speedups by $4.6-6.5\\times$. We also show how existing DCNN models can be regularized during the training process to further improve efficiency and accuracy. These techniques are applied to homomorphically evaluate a DCNN with high accuracy on the high-resolution ImageNet dataset, achieving $80.2\\%$ top-1 accuracy. We also achieve an accuracy of homomorphically evaluated CNN",
    "link": "http://arxiv.org/abs/2306.09189",
    "context": "Title: High-Resolution Convolutional Neural Networks on Homomorphically Encrypted Data via Sharding Ciphertexts. (arXiv:2306.09189v2 [cs.CR] UPDATED)\nAbstract: Recently, Deep Convolutional Neural Networks (DCNNs) including the ResNet-20 architecture have been privately evaluated on encrypted, low-resolution data with the Residue-Number-System Cheon-Kim-Kim-Song (RNS-CKKS) homomorphic encryption scheme. We extend methods for evaluating DCNNs on images with larger dimensions and many channels, beyond what can be stored in single ciphertexts. Additionally, we simplify and improve the efficiency of the recently introduced multiplexed image format, demonstrating that homomorphic evaluation can work with standard, row-major matrix packing and results in encrypted inference time speedups by $4.6-6.5\\times$. We also show how existing DCNN models can be regularized during the training process to further improve efficiency and accuracy. These techniques are applied to homomorphically evaluate a DCNN with high accuracy on the high-resolution ImageNet dataset, achieving $80.2\\%$ top-1 accuracy. We also achieve an accuracy of homomorphically evaluated CNN",
    "path": "papers/23/06/2306.09189.json",
    "total_tokens": 964,
    "translated_title": "在通过分片密文上的同态加密数据上进行高分辨率卷积神经网络的研究",
    "translated_abstract": "最近，在使用基于剩余数系统Cheon-Kim-Kim-Song (RNS-CKKS) 同态加密方案的低分辨率数据上，对包括ResNet-20在内的深度卷积神经网络(DCNNs)进行了私密评估。我们扩展了在图像上评估DCNNs的方法，使其适用于更大尺寸和更多通道的图像，超出了单个密文所能存储的范围。此外，我们简化和改进了最近引入的多路复用图像格式的效率，证明了同态评估可以使用标准的行主序矩阵打包，并导致加密推理时间加速$4.6-6.5\\times$。我们还展示了如何在训练过程中对现有DCNN模型进行正则化，以进一步提高效率和准确性。应用这些技术对高分辨率的ImageNet数据集上进行同态评估，实现了$80.2\\%$的top-1准确率。同时，我们还实现了对CNN进行同态评估的准确率",
    "tldr": "通过分片密文上的同态加密数据，我们扩展了在大尺寸和多通道图像上评估深度卷积神经网络的方法，并简化了多路复用图像格式的效率。我们还展示了如何正则化现有模型以提高效率和准确性。",
    "en_tdlr": "We extend the evaluation of deep convolutional neural networks on large and multi-channel images using sharding ciphertexts with homomorphic encryption. We simplify the multiplexed image format for efficiency and demonstrate regularization techniques to improve efficiency and accuracy."
}