{
    "title": "Graphtester: Exploring Theoretical Boundaries of GNNs on Graph Datasets. (arXiv:2306.17482v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) have emerged as a powerful tool for learning from graph-structured data. However, even state-of-the-art architectures have limitations on what structures they can distinguish, imposing theoretical limits on what the networks can achieve on different datasets. In this paper, we provide a new tool called Graphtester for a comprehensive analysis of the theoretical capabilities of GNNs for various datasets, tasks, and scores. We use Graphtester to analyze over 40 different graph datasets, determining upper bounds on the performance of various GNNs based on the number of layers. Further, we show that the tool can also be used for Graph Transformers using positional node encodings, thereby expanding its scope. Finally, we demonstrate that features generated by Graphtester can be used for practical applications such as Graph Transformers, and provide a synthetic dataset to benchmark node and edge features, such as positional encodings. The package is freely availa",
    "link": "http://arxiv.org/abs/2306.17482",
    "context": "Title: Graphtester: Exploring Theoretical Boundaries of GNNs on Graph Datasets. (arXiv:2306.17482v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) have emerged as a powerful tool for learning from graph-structured data. However, even state-of-the-art architectures have limitations on what structures they can distinguish, imposing theoretical limits on what the networks can achieve on different datasets. In this paper, we provide a new tool called Graphtester for a comprehensive analysis of the theoretical capabilities of GNNs for various datasets, tasks, and scores. We use Graphtester to analyze over 40 different graph datasets, determining upper bounds on the performance of various GNNs based on the number of layers. Further, we show that the tool can also be used for Graph Transformers using positional node encodings, thereby expanding its scope. Finally, we demonstrate that features generated by Graphtester can be used for practical applications such as Graph Transformers, and provide a synthetic dataset to benchmark node and edge features, such as positional encodings. The package is freely availa",
    "path": "papers/23/06/2306.17482.json",
    "total_tokens": 931,
    "translated_title": "Graphtester： 在图数据集上探索GNNs的理论边界",
    "translated_abstract": "图神经网络（GNNs）已经成为学习图结构数据的强大工具。然而，即使是最先进的架构在可以区分的结构方面也有限制，限制了网络在不同数据集上的实现能力。在本文中，我们提供了一个名为Graphtester的新工具，用于对不同数据集、任务和得分的GNNs的理论能力进行全面分析。我们使用Graphtester分析了40多个不同的图数据集，根据层数确定了各种GNNs性能的上限。此外，我们还展示了该工具对使用位置节点编码的图变换器的适用性，从而扩大了其范围。最后，我们证明了Graphtester生成的特征可以用于实际应用，例如图变换器，并提供了一个用于基准测试节点和边特征（如位置编码）的合成数据集。该软件包可以免费获取。",
    "tldr": "本文提出了一个名为Graphtester的新工具，用于探索图数据集上GNNs的理论边界。通过分析40多个不同的图数据集，我们确定了各种GNNs性能的上限，并展示了该工具对图变换器的适用性。最后，我们证明了Graphtester生成的特征可以用于实际应用。"
}