{
    "title": "Physics-Informed Machine Learning for Modeling and Control of Dynamical Systems. (arXiv:2306.13867v1 [eess.SY])",
    "abstract": "Physics-informed machine learning (PIML) is a set of methods and tools that systematically integrate machine learning (ML) algorithms with physical constraints and abstract mathematical models developed in scientific and engineering domains. As opposed to purely data-driven methods, PIML models can be trained from additional information obtained by enforcing physical laws such as energy and mass conservation. More broadly, PIML models can include abstract properties and conditions such as stability, convexity, or invariance. The basic premise of PIML is that the integration of ML and physics can yield more effective, physically consistent, and data-efficient models. This paper aims to provide a tutorial-like overview of the recent advances in PIML for dynamical system modeling and control. Specifically, the paper covers an overview of the theory, fundamental concepts and methods, tools, and applications on topics of: 1) physics-informed learning for system identification; 2) physics-in",
    "link": "http://arxiv.org/abs/2306.13867",
    "context": "Title: Physics-Informed Machine Learning for Modeling and Control of Dynamical Systems. (arXiv:2306.13867v1 [eess.SY])\nAbstract: Physics-informed machine learning (PIML) is a set of methods and tools that systematically integrate machine learning (ML) algorithms with physical constraints and abstract mathematical models developed in scientific and engineering domains. As opposed to purely data-driven methods, PIML models can be trained from additional information obtained by enforcing physical laws such as energy and mass conservation. More broadly, PIML models can include abstract properties and conditions such as stability, convexity, or invariance. The basic premise of PIML is that the integration of ML and physics can yield more effective, physically consistent, and data-efficient models. This paper aims to provide a tutorial-like overview of the recent advances in PIML for dynamical system modeling and control. Specifically, the paper covers an overview of the theory, fundamental concepts and methods, tools, and applications on topics of: 1) physics-informed learning for system identification; 2) physics-in",
    "path": "papers/23/06/2306.13867.json",
    "total_tokens": 1031,
    "translated_title": "物理信息机器学习用于动态系统建模与控制",
    "translated_abstract": "物理信息机器学习(PIML)是一组方法和工具，系统地将机器学习(ML)算法与物理约束和科学工程领域中开发的抽象数学模型相结合。与纯数据驱动方法相反，PIML模型可以通过强制执行能量和质量守恒等物理定律获得额外的信息进行训练。广义上讲，PIML模型可以包括稳定性、凸性或不变性等抽象属性和条件。PIML的基本前提是将ML与物理相结合可以产生更有效、物理上一致且数据效率更高的模型。本文旨在为动态系统建模和控制中最新的PIML进展提供类似于教程式的概述。具体而言，本文涵盖以下主题的理论、基本概念和方法、工具和应用的概述：1）用于系统识别的物理信息学习；2）用于预测和控制任务的物理信息学习；3）ML算法的物理引导设计。本文还讨论了PIML领域的重要挑战和未来方向。",
    "tldr": "物理信息机器学习是将机器学习算法与物理约束和抽象数学模型相结合，通过额外信息进行训练以获取更有效、物理上一致、数据效率更高的模型的方法。本文概述了物理信息机器学习在动态系统建模和控制中的最新进展，并讨论了领域面临的重要挑战和未来方向。",
    "en_tdlr": "Physics-informed machine learning systematically integrates machine learning algorithms with physical constraints and abstract mathematical models, leading to more effective, physically consistent, and data-efficient models. This paper provides an overview of recent advances in PIML for dynamical system modeling and control, and discusses important challenges and future directions."
}