{
    "title": "Differentially Private Synthetic Data Using KD-Trees. (arXiv:2306.13211v1 [cs.CR])",
    "abstract": "Creation of a synthetic dataset that faithfully represents the data distribution and simultaneously preserves privacy is a major research challenge. Many space partitioning based approaches have emerged in recent years for answering statistical queries in a differentially private manner. However, for synthetic data generation problem, recent research has been mainly focused on deep generative models. In contrast, we exploit space partitioning techniques together with noise perturbation and thus achieve intuitive and transparent algorithms. We propose both data independent and data dependent algorithms for $\\epsilon$-differentially private synthetic data generation whose kernel density resembles that of the real dataset. Additionally, we provide theoretical results on the utility-privacy trade-offs and show how our data dependent approach overcomes the curse of dimensionality and leads to a scalable algorithm. We show empirical utility improvements over the prior work, and discuss perfo",
    "link": "http://arxiv.org/abs/2306.13211",
    "context": "Title: Differentially Private Synthetic Data Using KD-Trees. (arXiv:2306.13211v1 [cs.CR])\nAbstract: Creation of a synthetic dataset that faithfully represents the data distribution and simultaneously preserves privacy is a major research challenge. Many space partitioning based approaches have emerged in recent years for answering statistical queries in a differentially private manner. However, for synthetic data generation problem, recent research has been mainly focused on deep generative models. In contrast, we exploit space partitioning techniques together with noise perturbation and thus achieve intuitive and transparent algorithms. We propose both data independent and data dependent algorithms for $\\epsilon$-differentially private synthetic data generation whose kernel density resembles that of the real dataset. Additionally, we provide theoretical results on the utility-privacy trade-offs and show how our data dependent approach overcomes the curse of dimensionality and leads to a scalable algorithm. We show empirical utility improvements over the prior work, and discuss perfo",
    "path": "papers/23/06/2306.13211.json",
    "total_tokens": 847,
    "translated_title": "使用KD-树的差分隐私合成数据",
    "translated_abstract": "创建一个忠实地代表数据分布并同时保护隐私的合成数据集是一项重要的研究挑战。近年来出现了许多基于空间分割的方法，用于以差分隐私的方式回答统计查询问题。然而，对于合成数据生成问题，最近的研究主要集中在深度生成模型上。相比之下，我们利用了空间分割技术和噪声扰动，从而实现了直观透明的算法。我们提出了数据独立和数据相关的算法，用于生成 $\\epsilon $-差分隐私的合成数据，其核密度类似于真实数据集的核密度。此外，我们还提供了有关实用性和隐私权利的理论结果，并展示了我们的数据相关方法如何克服维度灾难并导致可扩展的算法。我们展示了相对于之前的工作的实用改进，并讨论了性能",
    "tldr": "本文提出了一种使用KD-树的算法，用于生成 $\\epsilon $-差分隐私的合成数据，其核密度类似于真实数据集的核密度。该方法克服了维度灾难，是一种可扩展的算法。",
    "en_tdlr": "This paper proposes an algorithm using KD-trees for generating synthetic data with $\\epsilon$-differential privacy, whose kernel density resembles that of the real dataset. The method overcomes the curse of dimensionality, providing a scalable algorithm."
}