{
    "title": "Individualized Dosing Dynamics via Neural Eigen Decomposition. (arXiv:2306.14020v1 [cs.LG])",
    "abstract": "Dosing models often use differential equations to model biological dynamics. Neural differential equations in particular can learn to predict the derivative of a process, which permits predictions at irregular points of time. However, this temporal flexibility often comes with a high sensitivity to noise, whereas medical problems often present high noise and limited data. Moreover, medical dosing models must generalize reliably over individual patients and changing treatment policies. To address these challenges, we introduce the Neural Eigen Stochastic Differential Equation algorithm (NESDE). NESDE provides individualized modeling (using a hypernetwork over patient-level parameters); generalization to new treatment policies (using decoupled control); tunable expressiveness according to the noise level (using piecewise linearity); and fast, continuous, closed-form prediction (using spectral representation). We demonstrate the robustness of NESDE in both synthetic and real medical probl",
    "link": "http://arxiv.org/abs/2306.14020",
    "context": "Title: Individualized Dosing Dynamics via Neural Eigen Decomposition. (arXiv:2306.14020v1 [cs.LG])\nAbstract: Dosing models often use differential equations to model biological dynamics. Neural differential equations in particular can learn to predict the derivative of a process, which permits predictions at irregular points of time. However, this temporal flexibility often comes with a high sensitivity to noise, whereas medical problems often present high noise and limited data. Moreover, medical dosing models must generalize reliably over individual patients and changing treatment policies. To address these challenges, we introduce the Neural Eigen Stochastic Differential Equation algorithm (NESDE). NESDE provides individualized modeling (using a hypernetwork over patient-level parameters); generalization to new treatment policies (using decoupled control); tunable expressiveness according to the noise level (using piecewise linearity); and fast, continuous, closed-form prediction (using spectral representation). We demonstrate the robustness of NESDE in both synthetic and real medical probl",
    "path": "papers/23/06/2306.14020.json",
    "total_tokens": 976,
    "translated_title": "基于神经特征值分解的个性化给药动力学模型",
    "translated_abstract": "给药模型通常使用微分方程来建模生物动力学。特别是神经微分方程可以学习预测过程的导数，从而在不规则的时间点进行预测。然而，这种时间上的灵活性常常伴随着对噪声的高敏感性，而医疗问题往往存在高噪声和有限数据。此外，医疗给药模型必须可靠地泛化到个体患者和不断变化的治疗政策上。为了解决这些挑战，本文引入了基于神经特征值分解的随机微分方程算法（NESDE）。NESDE提供个性化建模（使用超网络对患者水平参数）；对新治疗政策的泛化（使用解耦控制）；根据噪声水平可调的表现（使用分段线性）；以及快速、连续、闭合的预测（使用谱表示）。本文在合成和真实医疗问题中展示了NESDE的鲁棒性，表明它在预测准确性和稳健性方面优于现有方法。",
    "tldr": "本文提出了一个基于神经特征值分解的随机微分方程算法，可以用于个性化医疗给药模型，具有噪声水平可调、快速、连续、闭合的预测等特点，并在合成和真实医疗问题中展示了其鲁棒性和优越性能。"
}