{
    "title": "A Unified Generative Approach to Product Attribute-Value Identification. (arXiv:2306.05605v1 [cs.CL])",
    "abstract": "Product attribute-value identification (PAVI) has been studied to link products on e-commerce sites with their attribute values (e.g., <Material, Cotton>) using product text as clues. Technical demands from real-world e-commerce platforms require PAVI methods to handle unseen values, multi-attribute values, and canonicalized values, which are only partly addressed in existing extraction- and classification-based approaches. Motivated by this, we explore a generative approach to the PAVI task. We finetune a pre-trained generative model, T5, to decode a set of attribute-value pairs as a target sequence from the given product text. Since the attribute value pairs are unordered set elements, how to linearize them will matter; we, thus, explore methods of composing an attribute-value pair and ordering the pairs for the task. Experimental results confirm that our generation-based approach outperforms the existing extraction and classification-based methods on large-scale real-world datasets ",
    "link": "http://arxiv.org/abs/2306.05605",
    "context": "Title: A Unified Generative Approach to Product Attribute-Value Identification. (arXiv:2306.05605v1 [cs.CL])\nAbstract: Product attribute-value identification (PAVI) has been studied to link products on e-commerce sites with their attribute values (e.g., <Material, Cotton>) using product text as clues. Technical demands from real-world e-commerce platforms require PAVI methods to handle unseen values, multi-attribute values, and canonicalized values, which are only partly addressed in existing extraction- and classification-based approaches. Motivated by this, we explore a generative approach to the PAVI task. We finetune a pre-trained generative model, T5, to decode a set of attribute-value pairs as a target sequence from the given product text. Since the attribute value pairs are unordered set elements, how to linearize them will matter; we, thus, explore methods of composing an attribute-value pair and ordering the pairs for the task. Experimental results confirm that our generation-based approach outperforms the existing extraction and classification-based methods on large-scale real-world datasets ",
    "path": "papers/23/06/2306.05605.json",
    "total_tokens": 715,
    "translated_title": "产品属性值识别的统一生成方法",
    "translated_abstract": "产品属性值识别（PAVI）旨在使用产品文本作为线索将电子商务网站上的产品与其属性值（例如<Material，Cotton>）链接起来。现实世界电子商务平台的技术需求要求PAVI方法处理未见过的值、多属性值和规范化的值，而这些仅在现有的基于提取和分类的方法中部分得到解决。因此，我们提出了一种生成式方法来处理PAVI任务。",
    "tldr": "本文探索了一种生成式方法来统一处理电子商务平台上产品属性值识别任务，实验结果表明该方法在大规模真实世界数据集上的表现优于现有的基于提取和分类的方法。",
    "en_tdlr": "This paper proposes a generative approach to unify the product attribute-value identification (PAVI) task for e-commerce platforms, and the experimental results demonstrate that this approach outperforms the existing extraction and classification-based methods on large-scale real-world datasets."
}