{
    "title": "Uncertainty Estimation for Molecules: Desiderata and Methods. (arXiv:2306.14916v1 [physics.chem-ph])",
    "abstract": "Graph Neural Networks (GNNs) are promising surrogates for quantum mechanical calculations as they establish unprecedented low errors on collections of molecular dynamics (MD) trajectories. Thanks to their fast inference times they promise to accelerate computational chemistry applications. Unfortunately, despite low in-distribution (ID) errors, such GNNs might be horribly wrong for out-of-distribution (OOD) samples. Uncertainty estimation (UE) may aid in such situations by communicating the model's certainty about its prediction. Here, we take a closer look at the problem and identify six key desiderata for UE in molecular force fields, three 'physics-informed' and three 'application-focused' ones. To overview the field, we survey existing methods from the field of UE and analyze how they fit to the set desiderata. By our analysis, we conclude that none of the previous works satisfies all criteria. To fill this gap, we propose Localized Neural Kernel (LNK) a Gaussian Process (GP)-based",
    "link": "http://arxiv.org/abs/2306.14916",
    "context": "Title: Uncertainty Estimation for Molecules: Desiderata and Methods. (arXiv:2306.14916v1 [physics.chem-ph])\nAbstract: Graph Neural Networks (GNNs) are promising surrogates for quantum mechanical calculations as they establish unprecedented low errors on collections of molecular dynamics (MD) trajectories. Thanks to their fast inference times they promise to accelerate computational chemistry applications. Unfortunately, despite low in-distribution (ID) errors, such GNNs might be horribly wrong for out-of-distribution (OOD) samples. Uncertainty estimation (UE) may aid in such situations by communicating the model's certainty about its prediction. Here, we take a closer look at the problem and identify six key desiderata for UE in molecular force fields, three 'physics-informed' and three 'application-focused' ones. To overview the field, we survey existing methods from the field of UE and analyze how they fit to the set desiderata. By our analysis, we conclude that none of the previous works satisfies all criteria. To fill this gap, we propose Localized Neural Kernel (LNK) a Gaussian Process (GP)-based",
    "path": "papers/23/06/2306.14916.json",
    "total_tokens": 889,
    "translated_title": "分子的不确定性估计: 期望和方法",
    "translated_abstract": "图神经网络（GNNs）作为量子力学计算的有希望替代方法，在分子动力学（MD）轨迹集合上建立了前所未有的低误差。由于它们快速的推理时间，它们承诺加速计算化学应用。然而，尽管在分布（ID）误差上可低，但这些GNNs在分布外（OOD）样本上可能完全错误。不确定性估计（UE）可以在这种情况下帮助通过传达模型对其预测的确定性。在这里，我们着眼于这个问题，并确定了分子力场不确定性估计中的六个关键要求，三个是“物理信息”方面的，三个是“应用焦点”方面的。为了概述该领域，我们调查了现有的UE方法，并分析它们如何符合这些要求。通过我们的分析，我们得出结论，先前的研究都无法满足所有标准。为了填补这个空白，我们提出了基于局部神经核（LNK）的高斯过程（GP）模型。",
    "tldr": "该论文研究了分子力场中不确定性估计的要求和方法，并发现先前的研究方法无法满足所有标准。为了解决这个问题，提出了一种基于局部神经核的高斯过程模型（LNK）。"
}