{
    "title": "Evaluating the Impact of Regulatory Policies on Social Welfare in Difference-in-Difference Settings. (arXiv:2306.04494v1 [econ.EM])",
    "abstract": "Quantifying the impact of regulatory policies on social welfare generally requires the identification of counterfactual distributions. Many of these policies (e.g. minimum wages or minimum working time) generate mass points and/or discontinuities in the outcome distribution. Existing approaches in the difference-in-difference literature cannot accommodate these discontinuities while accounting for selection on unobservables and non-stationary outcome distributions. We provide a unifying partial identification result that can account for these features. Our main identifying assumption is the stability of the dependence (copula) between the distribution of the untreated potential outcome and group membership (treatment assignment) across time. Exploiting this copula stability assumption allows us to provide an identification result that is invariant to monotonic transformations. We provide sharp bounds on the counterfactual distribution of the treatment group suitable for any outcome, wh",
    "link": "http://arxiv.org/abs/2306.04494",
    "context": "Title: Evaluating the Impact of Regulatory Policies on Social Welfare in Difference-in-Difference Settings. (arXiv:2306.04494v1 [econ.EM])\nAbstract: Quantifying the impact of regulatory policies on social welfare generally requires the identification of counterfactual distributions. Many of these policies (e.g. minimum wages or minimum working time) generate mass points and/or discontinuities in the outcome distribution. Existing approaches in the difference-in-difference literature cannot accommodate these discontinuities while accounting for selection on unobservables and non-stationary outcome distributions. We provide a unifying partial identification result that can account for these features. Our main identifying assumption is the stability of the dependence (copula) between the distribution of the untreated potential outcome and group membership (treatment assignment) across time. Exploiting this copula stability assumption allows us to provide an identification result that is invariant to monotonic transformations. We provide sharp bounds on the counterfactual distribution of the treatment group suitable for any outcome, wh",
    "path": "papers/23/06/2306.04494.json",
    "total_tokens": 870,
    "translated_title": "在差异性-in-Difference设置中评估监管政策对社会福利的影响",
    "translated_abstract": "量化监管政策对社会福利的影响通常需要确定反事实分布。许多这种政策（如最低工资或最低工作时间）会在结果分布中生成质量点和/或不连续性。差异-in-difference文献中现有的方法无法容纳这些不连续性，同时考虑到不可观察的选择和非稳态的结果分布。我们提供了一个统一的部分识别结果，可以解释这些特征。我们的主要识别假设是未经处理的潜在结果分布和组成员资格（治疗分配）之间的依赖关系（copula）在时间上的稳定性。利用这个copula稳定性假设，我们可以提供一个与单调变换无关的识别结果。我们提供了适用于任何结果的治疗组反事实分布的锐利边界。",
    "tldr": "该论文提供了一个统一的偏差鉴别结果，以评估监管政策对社会福利的影响，利用了copula稳定假设，可以容纳质量点和不连续，同时考虑不可观察的选择和非稳态的结果分布。",
    "en_tdlr": "This paper provides a unified partial identification result to evaluate the impact of regulatory policies on social welfare, utilizing copula stability assumption to accommodate mass points and discontinuities while accounting for selection on unobservables and non-stationary outcome distributions."
}