{
    "title": "Addressing Discontinuous Root-Finding for Subsequent Differentiability in Machine Learning, Inverse Problems, and Control. (arXiv:2306.12413v1 [cs.LG])",
    "abstract": "There are many physical processes that have inherent discontinuities in their mathematical formulations. This paper is motivated by the specific case of collisions between two rigid or deformable bodies and the intrinsic nature of that discontinuity. The impulse response to a collision is discontinuous with the lack of any response when no collision occurs, which causes difficulties for numerical approaches that require differentiability which are typical in machine learning, inverse problems, and control. We theoretically and numerically demonstrate that the derivative of the collision time with respect to the parameters becomes infinite as one approaches the barrier separating colliding from not colliding, and use lifting to complexify the solution space so that solutions on the other side of the barrier are directly attainable as precise values. Subsequently, we mollify the barrier posed by the unbounded derivatives, so that one can tunnel back and forth in a smooth and reliable fas",
    "link": "http://arxiv.org/abs/2306.12413",
    "context": "Title: Addressing Discontinuous Root-Finding for Subsequent Differentiability in Machine Learning, Inverse Problems, and Control. (arXiv:2306.12413v1 [cs.LG])\nAbstract: There are many physical processes that have inherent discontinuities in their mathematical formulations. This paper is motivated by the specific case of collisions between two rigid or deformable bodies and the intrinsic nature of that discontinuity. The impulse response to a collision is discontinuous with the lack of any response when no collision occurs, which causes difficulties for numerical approaches that require differentiability which are typical in machine learning, inverse problems, and control. We theoretically and numerically demonstrate that the derivative of the collision time with respect to the parameters becomes infinite as one approaches the barrier separating colliding from not colliding, and use lifting to complexify the solution space so that solutions on the other side of the barrier are directly attainable as precise values. Subsequently, we mollify the barrier posed by the unbounded derivatives, so that one can tunnel back and forth in a smooth and reliable fas",
    "path": "papers/23/06/2306.12413.json",
    "total_tokens": 795,
    "translated_title": "处理机器学习、逆问题和控制中不连续的根查找问题",
    "translated_abstract": "许多物理过程的数学公式具有固有的不连续性，例如刚体或可变形体之间的碰撞。因为碰撞的阶跃响应在计算时需要对参数求导数，这导致了在机器学习、逆问题和控制领域的数值计算中存在困难。本文理论上和数值上证明了碰撞时间对参数求导数在趋近于分离碰撞状态和未碰撞状态的界面时会变得无穷大，并使用复化技术来处理分界面上的极限值。我们同时修正了导数的不连续性，从而使得计算更加平滑可靠。",
    "tldr": "本文解决了机器学习、逆问题和控制中碰撞响应函数阶跃形成的不连续根查找问题，并提供了平滑的解决方案。",
    "en_tdlr": "The paper addresses the problem of discontinuous root-finding caused by the step-form impulse response of collision functions in machine learning, inverse problems, and control. It proposes a solution of complexification and mollification to obtain precise values on both sides of the barrier while smoothing out the unbounded derivatives."
}