{
    "title": "Medical Data Augmentation via ChatGPT: A Case Study on Medication Identification and Medication Event Classification. (arXiv:2306.07297v1 [cs.CL])",
    "abstract": "The identification of key factors such as medications, diseases, and relationships within electronic health records and clinical notes has a wide range of applications in the clinical field. In the N2C2 2022 competitions, various tasks were presented to promote the identification of key factors in electronic health records (EHRs) using the Contextualized Medication Event Dataset (CMED). Pretrained large language models (LLMs) demonstrated exceptional performance in these tasks. This study aims to explore the utilization of LLMs, specifically ChatGPT, for data augmentation to overcome the limited availability of annotated data for identifying the key factors in EHRs. Additionally, different pre-trained BERT models, initially trained on extensive datasets like Wikipedia and MIMIC, were employed to develop models for identifying these key variables in EHRs through fine-tuning on augmented datasets. The experimental results of two EHR analysis tasks, namely medication identification and me",
    "link": "http://arxiv.org/abs/2306.07297",
    "context": "Title: Medical Data Augmentation via ChatGPT: A Case Study on Medication Identification and Medication Event Classification. (arXiv:2306.07297v1 [cs.CL])\nAbstract: The identification of key factors such as medications, diseases, and relationships within electronic health records and clinical notes has a wide range of applications in the clinical field. In the N2C2 2022 competitions, various tasks were presented to promote the identification of key factors in electronic health records (EHRs) using the Contextualized Medication Event Dataset (CMED). Pretrained large language models (LLMs) demonstrated exceptional performance in these tasks. This study aims to explore the utilization of LLMs, specifically ChatGPT, for data augmentation to overcome the limited availability of annotated data for identifying the key factors in EHRs. Additionally, different pre-trained BERT models, initially trained on extensive datasets like Wikipedia and MIMIC, were employed to develop models for identifying these key variables in EHRs through fine-tuning on augmented datasets. The experimental results of two EHR analysis tasks, namely medication identification and me",
    "path": "papers/23/06/2306.07297.json",
    "total_tokens": 776,
    "translated_title": "基于ChatGPT的医疗数据增广：基于药物识别和药物事件分类的案例研究",
    "translated_abstract": "在电子病历和临床记录中识别药物、疾病和关联性等关键因素具有广泛的临床应用。本研究旨在探索使用预训练的大型语言模型ChatGPT进行数据增广，以克服电子病历中关键因素标注数据的有限可用性。研究结果表明，提出的数据增广技术显著提高了BERT模型在药物识别和药物事件分类等两个电子病历分析任务中的性能。",
    "tldr": "本研究利用ChatGPT进行数据增广，显著提高了BERT模型在电子病历药物识别和药物事件分类任务中的表现。",
    "en_tdlr": "This study proposes a data augmentation technique using ChatGPT to improve the performance of BERT models in identifying key factors in electronic health records, specifically medication identification and medication event classification."
}