{
    "title": "Semi-supervised Cell Recognition under Point Supervision. (arXiv:2306.08240v1 [cs.CV])",
    "abstract": "Cell recognition is a fundamental task in digital histopathology image analysis. Point-based cell recognition (PCR) methods normally require a vast number of annotations, which is extremely costly, time-consuming and labor-intensive. Semi-supervised learning (SSL) can provide a shortcut to make full use of cell information in gigapixel whole slide images without exhaustive labeling. However, research into semi-supervised point-based cell recognition (SSPCR) remains largely overlooked. Previous SSPCR works are all built on density map-based PCR models, which suffer from unsatisfactory accuracy, slow inference speed and high sensitivity to hyper-parameters. To address these issues, end-to-end PCR models are proposed recently. In this paper, we develop a SSPCR framework suitable for the end-to-end PCR models for the first time. Overall, we use the current models to generate pseudo labels for unlabeled images, which are in turn utilized to supervise the models training. Besides, we introdu",
    "link": "http://arxiv.org/abs/2306.08240",
    "context": "Title: Semi-supervised Cell Recognition under Point Supervision. (arXiv:2306.08240v1 [cs.CV])\nAbstract: Cell recognition is a fundamental task in digital histopathology image analysis. Point-based cell recognition (PCR) methods normally require a vast number of annotations, which is extremely costly, time-consuming and labor-intensive. Semi-supervised learning (SSL) can provide a shortcut to make full use of cell information in gigapixel whole slide images without exhaustive labeling. However, research into semi-supervised point-based cell recognition (SSPCR) remains largely overlooked. Previous SSPCR works are all built on density map-based PCR models, which suffer from unsatisfactory accuracy, slow inference speed and high sensitivity to hyper-parameters. To address these issues, end-to-end PCR models are proposed recently. In this paper, we develop a SSPCR framework suitable for the end-to-end PCR models for the first time. Overall, we use the current models to generate pseudo labels for unlabeled images, which are in turn utilized to supervise the models training. Besides, we introdu",
    "path": "papers/23/06/2306.08240.json",
    "total_tokens": 1047,
    "translated_title": "点级监督下的半监督细胞识别方法",
    "translated_abstract": "细胞识别是数字组织病理学图像分析中的基本任务。基于点的细胞识别方法通常需要大量的注释，耗时费力。半监督学习可以提供一种捷径，充分利用千亿像素的整张切片图像中的细胞信息而无需详尽标记。然而，关于半监督点级细胞识别（SSPCR）的研究仍未得到充分重视。先前的SSPCR工作都是基于密度图的PCR模型，其精度不尽如人意，推理速度缓慢，对超参数的敏感度高。为了解决这些问题，最近提出了端到端PCR模型。本文首次为端到端PCR模型开发了适用的SSPCR框架。总体而言，我们使用当前模型为未标记的图像生成伪标签，并将其用于监督模型的训练。此外，我们引入了两种新的损失函数，可以协调标记和未标记样本。为了验证我们方法的有效性，我们在两个公开数据集上进行了实验。实验结果表明，我们的方法以显著更少的注释成本和时间获得了最先进的性能。",
    "tldr": "本文提出了一种半监督的细胞识别方法，使用端到端PCR模型和生成的伪标签来更好地利用未标注的图像，开发了适用于SSPCR的框架，并引入了两种新的损失函数来协调标记和未标记样本。",
    "en_tdlr": "This paper proposes a semi-supervised cell recognition method that utilizes end-to-end PCR models and generated pseudo labels to better utilize unlabeled images. Additionally, a suitable framework for SSPCR is established and two novel loss functions are introduced to coordinate labeled and unlabeled samples. Experimental results demonstrate state-of-the-art performance with significantly less annotation cost and time."
}