{
    "title": "Model-aided Federated Reinforcement Learning for Multi-UAV Trajectory Planning in IoT Networks. (arXiv:2306.02029v2 [cs.LG] UPDATED)",
    "abstract": "Deploying teams of unmanned aerial vehicles (UAVs) to harvest data from distributed Internet of Things (IoT) devices requires efficient trajectory planning and coordination algorithms. Multi-agent reinforcement learning (MARL) has emerged as a solution, but requires extensive and costly real-world training data. To tackle this challenge, we propose a novel model-aided federated MARL algorithm to coordinate multiple UAVs on a data harvesting mission with only limited knowledge about the environment. The proposed algorithm alternates between building an environment simulation model from real-world measurements, specifically learning the radio channel characteristics and estimating unknown IoT device positions, and federated QMIX training in the simulated environment. Each UAV agent trains a local QMIX model in its simulated environment and continuously consolidates it through federated learning with other agents, accelerating the learning process. A performance comparison with standard M",
    "link": "http://arxiv.org/abs/2306.02029",
    "context": "Title: Model-aided Federated Reinforcement Learning for Multi-UAV Trajectory Planning in IoT Networks. (arXiv:2306.02029v2 [cs.LG] UPDATED)\nAbstract: Deploying teams of unmanned aerial vehicles (UAVs) to harvest data from distributed Internet of Things (IoT) devices requires efficient trajectory planning and coordination algorithms. Multi-agent reinforcement learning (MARL) has emerged as a solution, but requires extensive and costly real-world training data. To tackle this challenge, we propose a novel model-aided federated MARL algorithm to coordinate multiple UAVs on a data harvesting mission with only limited knowledge about the environment. The proposed algorithm alternates between building an environment simulation model from real-world measurements, specifically learning the radio channel characteristics and estimating unknown IoT device positions, and federated QMIX training in the simulated environment. Each UAV agent trains a local QMIX model in its simulated environment and continuously consolidates it through federated learning with other agents, accelerating the learning process. A performance comparison with standard M",
    "path": "papers/23/06/2306.02029.json",
    "total_tokens": 948,
    "translated_title": "基于模型辅助的联邦增强学习，用于物联网网络中多个无人机轨迹规划",
    "translated_abstract": "部署无人机团队从分布式物联网设备收集数据需要高效的轨迹规划和协调算法。多智能体增强学习已经成为一个解决方案，但需要大量昂贵的实际训练数据。为了解决这个挑战，我们提出了一种新颖的模型辅助联邦增强学习算法，在只有对环境的有限知识的情况下，协调多个无人机进行数据采集任务。该算法交替建立一个从实际测量中得到的环境模拟模型，特别是学习无线电通道特性和估计未知物联网设备的位置，以及在模拟环境中进行联邦QMIX训练。每个无人机代理在其模拟环境中训练一个本地的QMIX模型，并通过与其他代理的联邦学习不断巩固，加速学习过程。与标准的M算法进行了性能比较。",
    "tldr": "该论文提出了一种基于模型辅助的联邦增强学习算法，用于多个无人机在物联网网络中的轨迹规划和协调。该算法通过建立环境模拟模型和联邦学习来快速训练无人机代理，以收集分布式物联网设备的数据。",
    "en_tdlr": "This paper proposes a model-aided federated reinforcement learning algorithm for multi-UAV trajectory planning and coordination in IoT networks. The algorithm accelerates the learning process by building an environment simulation model and using federated learning to train the UAV agents, enabling data harvesting from distributed IoT devices."
}