{
    "title": "ovla: Neural Network Ownership Verification using Latent Watermarks. (arXiv:2306.13215v1 [cs.CR])",
    "abstract": "Ownership verification for neural networks is important for protecting these models from illegal copying, free-riding, re-distribution and other intellectual property misuse. We present a novel methodology for neural network ownership verification based on the notion of latent watermarks. Existing ownership verification methods either modify or introduce constraints to the neural network parameters, which are accessible to an attacker in a white-box attack and can be harmful to the network's normal operation, or train the network to respond to specific watermarks in the inputs similar to data poisoning-based backdoor attacks, which are susceptible to backdoor removal techniques. In this paper, we address these problems by decoupling a network's normal operation from its responses to watermarked inputs during ownership verification. The key idea is to train the network such that the watermarks remain dormant unless the owner's secret key is applied to activate it. The secret key is real",
    "link": "http://arxiv.org/abs/2306.13215",
    "context": "Title: ovla: Neural Network Ownership Verification using Latent Watermarks. (arXiv:2306.13215v1 [cs.CR])\nAbstract: Ownership verification for neural networks is important for protecting these models from illegal copying, free-riding, re-distribution and other intellectual property misuse. We present a novel methodology for neural network ownership verification based on the notion of latent watermarks. Existing ownership verification methods either modify or introduce constraints to the neural network parameters, which are accessible to an attacker in a white-box attack and can be harmful to the network's normal operation, or train the network to respond to specific watermarks in the inputs similar to data poisoning-based backdoor attacks, which are susceptible to backdoor removal techniques. In this paper, we address these problems by decoupling a network's normal operation from its responses to watermarked inputs during ownership verification. The key idea is to train the network such that the watermarks remain dormant unless the owner's secret key is applied to activate it. The secret key is real",
    "path": "papers/23/06/2306.13215.json",
    "total_tokens": 916,
    "translated_title": "ovla：使用隐式水印进行神经网络所有权验证",
    "translated_abstract": "神经网络的所有权验证对于保护这些模型免受非法复制、免费骑车、重新分配和其他知识产权的滥用非常重要。我们提出了一种基于隐式水印的神经网络所有权验证新方法。该方法通过解耦网络的正常操作和对带水印输入的响应来进行验证。其关键思想是训练网络，使得水印保持休眠状态，除非应用所有者的秘密密钥来激活它。我们展示了该方法在所有权验证准确率、误报率和抵抗对抗攻击方面优于现有的最先进方法。",
    "tldr": "ovla是一种使用隐式水印进行神经网络所有权验证的新方法，通过训练网络使水印保持休眠状态，只有在所有者的秘密密钥被应用时才会被激活，该方法在神经网络所有权验证准确率、误报率和抵抗对抗攻击方面优于现有的最先进方法。",
    "en_tdlr": "Ovla is a new method for neural network ownership verification using latent watermarks. The key idea is to train the network to keep the watermarks dormant unless the owner's secret key is applied to activate it. Ovla outperforms existing state-of-the-art methods in terms of ownership verification accuracy, false positive rate, and robustness against adversarial attacks."
}