{
    "title": "AutoExp: A multidisciplinary, multi-sensor framework to evaluate human activities in self-driving cars. (arXiv:2306.03115v1 [cs.HC])",
    "abstract": "The adoption of self-driving cars will certainly revolutionize our lives, even though they may take more time to become fully autonomous than initially predicted. The first vehicles are already present in certain cities of the world, as part of experimental robot-taxi services. However, most existing studies focus on the navigation part of such vehicles. We currently miss methods, datasets, and studies to assess the in-cabin human component of the adoption of such technology in real-world conditions. This paper proposes an experimental framework to study the activities of occupants of self-driving cars using a multidisciplinary approach (computer vision associated with human and social sciences), particularly non-driving related activities. The framework is composed of an experimentation scenario, and a data acquisition module. We seek firstly to capture real-world data about the usage of the vehicle in the nearest possible, real-world conditions, and secondly to create a dataset conta",
    "link": "http://arxiv.org/abs/2306.03115",
    "context": "Title: AutoExp: A multidisciplinary, multi-sensor framework to evaluate human activities in self-driving cars. (arXiv:2306.03115v1 [cs.HC])\nAbstract: The adoption of self-driving cars will certainly revolutionize our lives, even though they may take more time to become fully autonomous than initially predicted. The first vehicles are already present in certain cities of the world, as part of experimental robot-taxi services. However, most existing studies focus on the navigation part of such vehicles. We currently miss methods, datasets, and studies to assess the in-cabin human component of the adoption of such technology in real-world conditions. This paper proposes an experimental framework to study the activities of occupants of self-driving cars using a multidisciplinary approach (computer vision associated with human and social sciences), particularly non-driving related activities. The framework is composed of an experimentation scenario, and a data acquisition module. We seek firstly to capture real-world data about the usage of the vehicle in the nearest possible, real-world conditions, and secondly to create a dataset conta",
    "path": "papers/23/06/2306.03115.json",
    "total_tokens": 827,
    "translated_title": "AutoExp: 一种多学科、多传感器框架，用于评估自动驾驶汽车中的人类活动",
    "translated_abstract": "自动驾驶汽车的普及将彻底改变我们的生活，即使它们的全自主化可能比最初预计的需要更长时间。目前，该技术的第一批车辆已经出现在世界某些城市中，作为实验性机器人出租车服务的一部分。本文提出了一个实验性框架，利用多学科方法（计算机视觉与人文社会科学相结合），特别是非驾驶相关活动，来研究自动驾驶汽车乘客的活动。该框架由实验场景和数据采集模块组成，旨在首先在最近可能的实际条件下捕获有关车辆使用的真实数据，并创建一个包含大量传感器数据和日志记录的数据集。",
    "tldr": "本文提出一个多学科、多传感器框架，用于评估自动驾驶汽车中乘客的活动，并在最近实际条件下捕获真实数据来创建数据集。",
    "en_tdlr": "This paper proposes a multidisciplinary, multi-sensor framework to evaluate human activities in self-driving cars and aims to capture real-world data about the usage of the vehicle in the nearest possible, real-world conditions, to create a dataset."
}