{
    "title": "Black holes and the loss landscape in machine learning. (arXiv:2306.14817v1 [hep-th])",
    "abstract": "Understanding the loss landscape is an important problem in machine learning. One key feature of the loss function, common to many neural network architectures, is the presence of exponentially many low lying local minima. Physical systems with similar energy landscapes may provide useful insights. In this work, we point out that black holes naturally give rise to such landscapes, owing to the existence of black hole entropy. For definiteness, we consider 1/8 BPS black holes in $\\mathcal{N} = 8$ string theory. These provide an infinite family of potential landscapes arising in the microscopic descriptions of corresponding black holes. The counting of minima amounts to black hole microstate counting. Moreover, the exact numbers of the minima for these landscapes are a priori known from dualities in string theory. Some of the minima are connected by paths of low loss values, resembling mode connectivity. We estimate the number of runs needed to find all the solutions. Initial exploration",
    "link": "http://arxiv.org/abs/2306.14817",
    "context": "Title: Black holes and the loss landscape in machine learning. (arXiv:2306.14817v1 [hep-th])\nAbstract: Understanding the loss landscape is an important problem in machine learning. One key feature of the loss function, common to many neural network architectures, is the presence of exponentially many low lying local minima. Physical systems with similar energy landscapes may provide useful insights. In this work, we point out that black holes naturally give rise to such landscapes, owing to the existence of black hole entropy. For definiteness, we consider 1/8 BPS black holes in $\\mathcal{N} = 8$ string theory. These provide an infinite family of potential landscapes arising in the microscopic descriptions of corresponding black holes. The counting of minima amounts to black hole microstate counting. Moreover, the exact numbers of the minima for these landscapes are a priori known from dualities in string theory. Some of the minima are connected by paths of low loss values, resembling mode connectivity. We estimate the number of runs needed to find all the solutions. Initial exploration",
    "path": "papers/23/06/2306.14817.json",
    "total_tokens": 849,
    "translated_title": "机器学习中的黑洞和损失景观",
    "translated_abstract": "理解损失景观是机器学习中的一个重要问题。许多神经网络结构共同具有的一个关键特征是存在指数级别的许多局部极小值。具有类似能量景观的物理系统可以提供有用的见解。在这项工作中，我们指出，由于存在黑洞熵，黑洞自然产生这样的景观。为了明确起见，我们考虑$\\mathcal{N}=8$ 弦理论中的1/8 BPS黑洞。这些提供了一系列潜在的景观，这些景观在相应的黑洞微观描述中出现。极小值的计数相当于黑洞微观态计数。此外，这些景观的最小值的确切数量是先验已知的，来自于弦理论的对偶性。其中一些最小值通过低损失值的路径相连，类似于模式连接。我们估计需要多少次运行才能找到所有的解。",
    "tldr": "本论文指出，黑洞自然产生指数级别的许多局部极小值的损失景观，为机器学习领域提供了重要的见解。",
    "en_tdlr": "This paper points out that black holes naturally give rise to loss landscapes with exponentially many low lying local minima, which provides insights for the field of machine learning."
}