{
    "title": "Professional Basketball Player Behavior Synthesis via Planning with Diffusion. (arXiv:2306.04090v1 [cs.AI])",
    "abstract": "Dynamically planning in multi-agent systems has been explored to improve decision-making in various domains. Professional basketball serves as a compelling example of a dynamic spatio-temporal game, encompassing both concealed strategic policies and decision-making. However, processing the diverse on-court signals and navigating the vast space of potential actions and outcomes makes it difficult for existing approaches to swiftly identify optimal strategies in response to evolving circumstances. In this study, we first formulate the sequential decision-making process as a conditional trajectory generation process. We further introduce PLAYBEST (PLAYer BEhavior SynThesis), a method for enhancing player decision-making. We extend the state-of-the-art generative model, diffusion probabilistic model, to learn challenging multi-agent environmental dynamics from historical National Basketball Association (NBA) player motion tracking data. To incorporate data-driven strategies, an auxiliary v",
    "link": "http://arxiv.org/abs/2306.04090",
    "context": "Title: Professional Basketball Player Behavior Synthesis via Planning with Diffusion. (arXiv:2306.04090v1 [cs.AI])\nAbstract: Dynamically planning in multi-agent systems has been explored to improve decision-making in various domains. Professional basketball serves as a compelling example of a dynamic spatio-temporal game, encompassing both concealed strategic policies and decision-making. However, processing the diverse on-court signals and navigating the vast space of potential actions and outcomes makes it difficult for existing approaches to swiftly identify optimal strategies in response to evolving circumstances. In this study, we first formulate the sequential decision-making process as a conditional trajectory generation process. We further introduce PLAYBEST (PLAYer BEhavior SynThesis), a method for enhancing player decision-making. We extend the state-of-the-art generative model, diffusion probabilistic model, to learn challenging multi-agent environmental dynamics from historical National Basketball Association (NBA) player motion tracking data. To incorporate data-driven strategies, an auxiliary v",
    "path": "papers/23/06/2306.04090.json",
    "total_tokens": 1011,
    "translated_title": "通过扩散规划进行职业篮球运动员行为合成",
    "translated_abstract": "在多智能体系统中动态规划已经被应用于改善各种领域的决策制定。职业篮球作为一个包含隐蔽性战略策略和决策制定的动态时空博弈的引人注目的例子。然而，处理多样的场上信号和导航潜在动作和结果的广阔空间使得现有方法很难迅速识别响应不断变化的情况下的最佳策略。在本研究中，我们首先将序列决策制定过程定义为条件轨迹生成过程。我们进一步引入PLAYBEST（PLAYER BEhavior SynThesis），这是一种提高球员决策制定的方法。我们扩展了最先进的生成模型——扩散概率模型，以从历史的美国职业篮球联赛(NBA)球员运动跟踪数据中学习具有挑战性的多智能体环境动态。为了融合数据驱动的策略，我们引入了一个辅助变量到PLAYBEST中，以适应外部输入并生成真实和多样化的球员轨迹。实验结果表明，PLAYBEST可以生成高质量的球员行为，并在各种评估场景中优于基线模型。",
    "tldr": "本文中提出了一个名为PLAYBEST的方法，通过使用扩散概率模型从篮球比赛历史数据中学习策略，生成更加真实和多样化的球员行为，从而提高球员的决策制定效果，并在实验中得到了验证。",
    "en_tdlr": "This paper proposes a method called PLAYBEST, which learns strategies from historical basketball data using diffusion probabilistic models to generate realistic and diverse player behaviors, and improves player decision-making. The experimental results demonstrate its effectiveness."
}