{
    "title": "Rank-heterogeneous Preference Models for School Choice. (arXiv:2306.01801v1 [stat.AP])",
    "abstract": "School choice mechanism designers use discrete choice models to understand and predict families' preferences. The most widely-used choice model, the multinomial logit (MNL), is linear in school and/or household attributes. While the model is simple and interpretable, it assumes the ranked preference lists arise from a choice process that is uniform throughout the ranking, from top to bottom. In this work, we introduce two strategies for rank-heterogeneous choice modeling tailored for school choice. First, we adapt a context-dependent random utility model (CDM), considering down-rank choices as occurring in the context of earlier up-rank choices. Second, we consider stratifying the choice modeling by rank, regularizing rank-adjacent models towards one another when appropriate. Using data on household preferences from the San Francisco Unified School District (SFUSD) across multiple years, we show that the contextual models considerably improve our out-of-sample evaluation metrics across",
    "link": "http://arxiv.org/abs/2306.01801",
    "context": "Title: Rank-heterogeneous Preference Models for School Choice. (arXiv:2306.01801v1 [stat.AP])\nAbstract: School choice mechanism designers use discrete choice models to understand and predict families' preferences. The most widely-used choice model, the multinomial logit (MNL), is linear in school and/or household attributes. While the model is simple and interpretable, it assumes the ranked preference lists arise from a choice process that is uniform throughout the ranking, from top to bottom. In this work, we introduce two strategies for rank-heterogeneous choice modeling tailored for school choice. First, we adapt a context-dependent random utility model (CDM), considering down-rank choices as occurring in the context of earlier up-rank choices. Second, we consider stratifying the choice modeling by rank, regularizing rank-adjacent models towards one another when appropriate. Using data on household preferences from the San Francisco Unified School District (SFUSD) across multiple years, we show that the contextual models considerably improve our out-of-sample evaluation metrics across",
    "path": "papers/23/06/2306.01801.json",
    "total_tokens": 871,
    "translated_title": "学校选择的排位不同偏好模型",
    "translated_abstract": "学校选择机制设计师使用离散选择模型来理解和预测家庭的偏好。最广泛使用的选择模型，多项式逻辑（MNL），在学校和/或家庭属性方面是线性的。尽管该模型简单易懂，但它假设排名偏好列表是由一个在排名范围内统一的选择过程产生的，从顶部到底部。在这项工作中，我们介绍了两种面向学校选择的排位不同选择建模策略。首先，我们采用了一种上下文相关的随机效用模型（CDM），考虑在早期的上位选择的背景下，进行下位选择。其次，我们考虑通过排名来分层选择建模，在适当时将排名相邻的模型调整为相互接近。利用旧金山统一学区（SFUSD）多年家庭偏好数据，我们展示了上下文模型能够显著提高我们的样本外评估指标。",
    "tldr": "本文提出了两种排位不同选择建模策略，一种是采用上下文相关的随机效用模型（CDM），一种是通过排名分层选择建模，提高了在学校选择中的应用效果。"
}