{
    "title": "Optimal sensor placement for reconstructing wind pressure field around buildings using compressed sensing. (arXiv:2306.04518v1 [physics.flu-dyn])",
    "abstract": "Deciding how to optimally deploy sensors in a large, complex, and spatially extended structure is critical to ensure that the surface pressure field is accurately captured for subsequent analysis and design. In some cases, reconstruction of missing data is required in downstream tasks such as the development of digital twins. This paper presents a data-driven sparse sensor selection algorithm, aiming to provide the most information contents for reconstructing aerodynamic characteristics of wind pressures over tall building structures parsimoniously. The algorithm first fits a set of basis functions to the training data, then applies a computationally efficient QR algorithm that ranks existing pressure sensors in order of importance based on the state reconstruction to this tailored basis. The findings of this study show that the proposed algorithm successfully reconstructs the aerodynamic characteristics of tall buildings from sparse measurement locations, generating stable and optimal",
    "link": "http://arxiv.org/abs/2306.04518",
    "context": "Title: Optimal sensor placement for reconstructing wind pressure field around buildings using compressed sensing. (arXiv:2306.04518v1 [physics.flu-dyn])\nAbstract: Deciding how to optimally deploy sensors in a large, complex, and spatially extended structure is critical to ensure that the surface pressure field is accurately captured for subsequent analysis and design. In some cases, reconstruction of missing data is required in downstream tasks such as the development of digital twins. This paper presents a data-driven sparse sensor selection algorithm, aiming to provide the most information contents for reconstructing aerodynamic characteristics of wind pressures over tall building structures parsimoniously. The algorithm first fits a set of basis functions to the training data, then applies a computationally efficient QR algorithm that ranks existing pressure sensors in order of importance based on the state reconstruction to this tailored basis. The findings of this study show that the proposed algorithm successfully reconstructs the aerodynamic characteristics of tall buildings from sparse measurement locations, generating stable and optimal",
    "path": "papers/23/06/2306.04518.json",
    "total_tokens": 731,
    "translated_title": "通过压缩感知确定建筑周围风压力场的最佳传感器布置",
    "translated_abstract": "对于大型、复杂、空间扩展的结构物，如何确定最佳传感器部署位置以确保准确捕捉表面压力场，是保证下游任务（如数字孪生的发展）的重要问题。本文提出了一种数据驱动的稀疏传感器选择算法，旨在提供最多信息内容，通过有限的测量位置简洁地重建风压的空气动力特性，成功地降低了传感器数量。",
    "tldr": "本文提出了一种数据驱动的稀疏传感器选择算法，能够通过有限的测量位置简洁地重建风压力场，显著减少传感器数量并提供了稳定和最佳的传感器布置结果。",
    "en_tdlr": "This paper proposes a data-driven sparse sensor selection algorithm that can reconstruct wind pressure field using limited measurement locations, significantly reducing the number of sensors required and providing stable and optimal sensor placement results."
}