{
    "title": "A Comparison of Sequential Ranked-Choice Voting and Single Transferable Vote. (arXiv:2306.17341v1 [econ.GN])",
    "abstract": "The methods of single transferable vote (STV) and sequential ranked-choice voting (RCV) are different methods for electing a set of winners in multiwinner elections. STV is a classical voting method that has been widely used internationally for many years. By contrast, sequential RCV has rarely been used, and only recently has seen an increase in usage as several cities in Utah have adopted the method to elect city council members. We use Monte Carlo simulations and a large database of real-world ranked-choice elections to investigate the behavior of sequential RCV by comparing it to STV. Our general finding is that sequential RCV often produces different winner sets than STV. Furthermore, sequential RCV is best understood as an excellence-based method which will not produce proportional results, often at the expense of minority interests.",
    "link": "http://arxiv.org/abs/2306.17341",
    "context": "Title: A Comparison of Sequential Ranked-Choice Voting and Single Transferable Vote. (arXiv:2306.17341v1 [econ.GN])\nAbstract: The methods of single transferable vote (STV) and sequential ranked-choice voting (RCV) are different methods for electing a set of winners in multiwinner elections. STV is a classical voting method that has been widely used internationally for many years. By contrast, sequential RCV has rarely been used, and only recently has seen an increase in usage as several cities in Utah have adopted the method to elect city council members. We use Monte Carlo simulations and a large database of real-world ranked-choice elections to investigate the behavior of sequential RCV by comparing it to STV. Our general finding is that sequential RCV often produces different winner sets than STV. Furthermore, sequential RCV is best understood as an excellence-based method which will not produce proportional results, often at the expense of minority interests.",
    "path": "papers/23/06/2306.17341.json",
    "total_tokens": 858,
    "translated_title": "顺序排名选择投票和单转移票数的比较",
    "translated_abstract": "单转移票数（STV）和顺序排名选择投票（RCV）是用于在多赢家选举中选出一组获胜者的不同方法。STV是一种经典的投票方法，在国际上已被广泛使用多年。相比之下，顺序RCV很少被使用，并且只有最近几年，随着犹他州几个城市采用这种方法选举市议会成员，使用率有所增加。通过蒙特卡洛模拟和大量真实选举数据，我们比较了顺序RCV和STV的行为。我们的总体发现是，顺序RCV通常产生不同的获胜者集合。此外，顺序RCV最好理解为一种基于卓越性的方法，不会产生比例结果，这往往以少数利益为代价。",
    "tldr": "顺序排名选择投票与单转移票数是两种用于多赢家选举的不同方法。通过研究发现，顺序排名选择投票常常产生与单转移票数不同的获胜者集合，且更关注卓越性而非实现比例性，可能会牺牲少数群体的利益。"
}