{
    "title": "Blockchain-based Federated Learning for Decentralized Energy Management Systems. (arXiv:2306.17186v1 [cs.DC])",
    "abstract": "The Internet of Energy (IoE) is a distributed paradigm that leverages smart networks and distributed system technologies to enable decentralized energy systems. In contrast to the traditional centralized energy systems, distributed Energy Internet systems comprise multiple components and communication requirements that demand innovative technologies for decentralization, reliability, efficiency, and security. Recent advances in blockchain architectures, smart contracts, and distributed federated learning technologies have opened up new opportunities for realizing decentralized Energy Internet services. In this paper, we present a comprehensive analysis and classification of state-of-the-art solutions that employ blockchain, smart contracts, and federated learning for the IoE domains. Specifically, we identify four representative system models and discuss their key aspects. These models demonstrate the diverse ways in which blockchain, smart contracts, and federated learning can be inte",
    "link": "http://arxiv.org/abs/2306.17186",
    "context": "Title: Blockchain-based Federated Learning for Decentralized Energy Management Systems. (arXiv:2306.17186v1 [cs.DC])\nAbstract: The Internet of Energy (IoE) is a distributed paradigm that leverages smart networks and distributed system technologies to enable decentralized energy systems. In contrast to the traditional centralized energy systems, distributed Energy Internet systems comprise multiple components and communication requirements that demand innovative technologies for decentralization, reliability, efficiency, and security. Recent advances in blockchain architectures, smart contracts, and distributed federated learning technologies have opened up new opportunities for realizing decentralized Energy Internet services. In this paper, we present a comprehensive analysis and classification of state-of-the-art solutions that employ blockchain, smart contracts, and federated learning for the IoE domains. Specifically, we identify four representative system models and discuss their key aspects. These models demonstrate the diverse ways in which blockchain, smart contracts, and federated learning can be inte",
    "path": "papers/23/06/2306.17186.json",
    "total_tokens": 831,
    "translated_title": "基于区块链的联邦学习用于分布式能源管理系统",
    "translated_abstract": "能源互联网是一种利用智能网络和分布式系统技术实现分散能源系统的分布式模式。相对于传统的集中式能源系统，分布式能源互联网系统涵盖了多个组件和通信要求，需要创新技术实现去中心化、可靠性、高效性和安全性。区块链架构、智能合约和分布式联邦学习技术的最新进展为实现分布式能源互联网服务提供了新的机遇。本文对当前最先进的应用区块链、智能合约和联邦学习于能源互联网领域的解决方案进行了全面分析和分类。具体来说，我们确定了四种典型的系统模型并讨论了它们的关键方面。这些模型展示了区块链、智能合约和联邦学习在能源互联网中的多样化应用方式。",
    "tldr": "本论文对区块链、智能合约和联邦学习在能源互联网中的应用进行了全面分析和分类，提出了四种典型的系统模型，并讨论了它们的关键方面。",
    "en_tdlr": "This paper provides a comprehensive analysis and classification of the applications of blockchain, smart contracts, and federated learning in the field of Energy Internet. It presents four representative system models and discusses their key aspects."
}