{
    "title": "Analyzing Credit Risk Model Problems through NLP-Based Clustering and Machine Learning: Insights from Validation Reports. (arXiv:2306.01618v1 [cs.LG])",
    "abstract": "This paper explores the use of clustering methods and machine learning algorithms, including Natural Language Processing (NLP), to identify and classify problems identified in credit risk models through textual information contained in validation reports. Using a unique dataset of 657 findings raised by validation teams in a large international banking group between January 2019 and December 2022. The findings are classified into nine validation dimensions and assigned a severity level by validators using their expert knowledge. The authors use embedding generation for the findings' titles and observations using four different pre-trained models, including \"module\\_url\" from TensorFlow Hub and three models from the SentenceTransformer library, namely \"all-mpnet-base-v2\", \"all-MiniLM-L6-v2\", and \"paraphrase-mpnet-base-v2\". The paper uses and compares various clustering methods in grouping findings with similar characteristics, enabling the identification of common problems within each v",
    "link": "http://arxiv.org/abs/2306.01618",
    "context": "Title: Analyzing Credit Risk Model Problems through NLP-Based Clustering and Machine Learning: Insights from Validation Reports. (arXiv:2306.01618v1 [cs.LG])\nAbstract: This paper explores the use of clustering methods and machine learning algorithms, including Natural Language Processing (NLP), to identify and classify problems identified in credit risk models through textual information contained in validation reports. Using a unique dataset of 657 findings raised by validation teams in a large international banking group between January 2019 and December 2022. The findings are classified into nine validation dimensions and assigned a severity level by validators using their expert knowledge. The authors use embedding generation for the findings' titles and observations using four different pre-trained models, including \"module\\_url\" from TensorFlow Hub and three models from the SentenceTransformer library, namely \"all-mpnet-base-v2\", \"all-MiniLM-L6-v2\", and \"paraphrase-mpnet-base-v2\". The paper uses and compares various clustering methods in grouping findings with similar characteristics, enabling the identification of common problems within each v",
    "path": "papers/23/06/2306.01618.json",
    "total_tokens": 888,
    "translated_title": "基于自然语言处理聚类和机器学习的信贷风险模型问题分析：来自验证报告的见解",
    "translated_abstract": "本文探讨了使用聚类方法和机器学习算法（包括自然语言处理）通过验证报告中的文本信息识别和分类信贷风险模型中的问题。使用一份独特的数据集，包含了一个大型国际银行集团在2019年1月至2022年12月期间验证团队提出的657个发现。将这些发现分为九个验证维度，并由验证人员使用其专业知识分配了一个严重程度级别。作者使用四个不同的预训练模型生成的发现标题和观察结果的嵌入向量，包括TensorFlow Hub中的“module_url”和SentenceTransformer库中的三个模型，即“all-mpnet-base-v2”、“all-MiniLM-L6-v2”和“paraphrase-mpnet-base-v2”。本文使用和比较了各种聚类方法来对具有相似特征的发现进行分组，从而实现了在每个验证维度内识别常见问题的目标。",
    "tldr": "本文利用聚类和机器学习算法对信贷风险模型中的问题进行了研究，通过分析验证报告中的文本信息，可以识别和分类信贷风险模型中的常见问题。",
    "en_tdlr": "This paper explores the use of clustering methods and machine learning algorithms, including NLP, to identify and classify common problems in credit risk models using textual information from validation reports."
}