{
    "title": "Unveiling Global Narratives: A Multilingual Twitter Dataset of News Media on the Russo-Ukrainian Conflict. (arXiv:2306.12886v1 [cs.CL])",
    "abstract": "The ongoing Russo-Ukrainian conflict has been a subject of intense media coverage worldwide. Understanding the global narrative surrounding this topic is crucial for researchers that aim to gain insights into its multifaceted dimensions. In this paper, we present a novel dataset that focuses on this topic by collecting and processing tweets posted by news or media companies on social media across the globe. We collected tweets from February 2022 to May 2023 to acquire approximately 1.5 million tweets in 60 different languages. Each tweet in the dataset is accompanied by processed tags, allowing for the identification of entities, stances, concepts, and sentiments expressed. The availability of the dataset serves as a valuable resource for researchers aiming to investigate the global narrative surrounding the ongoing conflict from various aspects such as who are the prominent entities involved, what stances are taken, where do these stances originate, and how are the different concepts ",
    "link": "http://arxiv.org/abs/2306.12886",
    "context": "Title: Unveiling Global Narratives: A Multilingual Twitter Dataset of News Media on the Russo-Ukrainian Conflict. (arXiv:2306.12886v1 [cs.CL])\nAbstract: The ongoing Russo-Ukrainian conflict has been a subject of intense media coverage worldwide. Understanding the global narrative surrounding this topic is crucial for researchers that aim to gain insights into its multifaceted dimensions. In this paper, we present a novel dataset that focuses on this topic by collecting and processing tweets posted by news or media companies on social media across the globe. We collected tweets from February 2022 to May 2023 to acquire approximately 1.5 million tweets in 60 different languages. Each tweet in the dataset is accompanied by processed tags, allowing for the identification of entities, stances, concepts, and sentiments expressed. The availability of the dataset serves as a valuable resource for researchers aiming to investigate the global narrative surrounding the ongoing conflict from various aspects such as who are the prominent entities involved, what stances are taken, where do these stances originate, and how are the different concepts ",
    "path": "papers/23/06/2306.12886.json",
    "total_tokens": 955,
    "translated_title": "全球叙事的揭示：一份多语种推特数据集，探讨俄乌冲突的新闻媒体报道",
    "translated_abstract": "俄乌冲突一直都是全球媒体密集报道的主题。了解这个话题背后的全球叙事对于旨在从多个层面获取洞见的研究人员来说至关重要。在本文中，我们提出了一份独特的数据集，通过收集并处理世界各地新闻或媒体公司发布在社交媒体上的推文，重点关注这个话题。我们收集了2022年2月至2023年5月的推文，以收集约1.5百万条使用60种不同语言的推文。数据集中的每个推文都附带有处理过的标签，允许对提到的主体、立场、概念和表达的情感进行识别。数据集的可用性为希望从不同方面调查俄乌冲突的全球叙事，例如谁是主要的相关方、持什么态度、这些态度的来源在哪里以及不同的概念如何，提供了有价值的资源。",
    "tldr": "研究人员收集了约1.5百万条涵盖60种不同语言的推文，创建了一个多语种推特数据集，重点探讨了俄乌冲突的新闻媒体报道。数据集中的标签可以识别与该话题相关的主体、立场、概念和情感表达。",
    "en_tdlr": "Researchers created a multilingual Twitter dataset with approximately 1.5 million tweets in 60 different languages, focusing on news media coverage of the Russo-Ukrainian conflict. Tags in the dataset allow for identification of entities, stances, concepts, and sentiments expressed."
}