{
    "title": "Stratification of uncertainties recalibrated by isotonic regression and its impact on calibration error statistics. (arXiv:2306.05180v1 [stat.ME])",
    "abstract": "Abstract Post hoc recalibration of prediction uncertainties of machine learning regression problems by isotonic regression might present a problem for bin-based calibration error statistics (e.g. ENCE). Isotonic regression often produces stratified uncertainties, i.e. subsets of uncertainties with identical numerical values. Partitioning of the resulting data into equal-sized bins introduces an aleatoric component to the estimation of bin-based calibration statistics. The partitioning of stratified data into bins depends on the order of the data, which is typically an uncontrolled property of calibration test/validation sets. The tie-braking method of the ordering algorithm used for binning might also introduce an aleatoric component. I show on an example how this might significantly affect the calibration diagnostics.",
    "link": "http://arxiv.org/abs/2306.05180",
    "context": "Title: Stratification of uncertainties recalibrated by isotonic regression and its impact on calibration error statistics. (arXiv:2306.05180v1 [stat.ME])\nAbstract: Abstract Post hoc recalibration of prediction uncertainties of machine learning regression problems by isotonic regression might present a problem for bin-based calibration error statistics (e.g. ENCE). Isotonic regression often produces stratified uncertainties, i.e. subsets of uncertainties with identical numerical values. Partitioning of the resulting data into equal-sized bins introduces an aleatoric component to the estimation of bin-based calibration statistics. The partitioning of stratified data into bins depends on the order of the data, which is typically an uncontrolled property of calibration test/validation sets. The tie-braking method of the ordering algorithm used for binning might also introduce an aleatoric component. I show on an example how this might significantly affect the calibration diagnostics.",
    "path": "papers/23/06/2306.05180.json",
    "total_tokens": 771,
    "translated_title": "通过保序回归重新校准的不确定性分层及其对校准误差统计的影响",
    "translated_abstract": "按照保序回归的方式对机器学习回归问题的预测不确定性进行事后重校准，可能会对基于箱式分布的校准误差统计（例如ENCE）造成问题。保序回归经常产生分层不确定性，即具有相同数值的不确定性子集。将分层数据分成相等大小的箱时，将引入一个随机组分来估计基于箱式分布的校准统计量。分层数据的箱分区取决于数据的顺序，这通常是校准测试/验证集的一个不受控制的属性。用于分段的排序算法的插值方法也可能引入随机组分。我在一个示例中展示了这可能如何显着影响校准诊断。",
    "tldr": "本论文探讨了通过保序回归进行重新校准会引起分层不确定性问题，这可能会对基于箱式分布的校准误差统计造成重大影响。",
    "en_tdlr": "This paper discusses the problem of stratified uncertainties caused by post hoc recalibration using isotonic regression, which may have significant impact on bin-based calibration error statistics."
}