{
    "title": "SAPI: Surroundings-Aware Vehicle Trajectory Prediction at Intersections. (arXiv:2306.01812v1 [cs.LG])",
    "abstract": "In this work we propose a deep learning model, i.e., SAPI, to predict vehicle trajectories at intersections. SAPI uses an abstract way to represent and encode surrounding environment by utilizing information from real-time map, right-of-way, and surrounding traffic. The proposed model consists of two convolutional network (CNN) and recurrent neural network (RNN)-based encoders and one decoder. A refiner is proposed to conduct a look-back operation inside the model, in order to make full use of raw history trajectory information. We evaluate SAPI on a proprietary dataset collected in real-world intersections through autonomous vehicles. It is demonstrated that SAPI shows promising performance when predicting vehicle trajectories at intersection, and outperforms benchmark methods. The average displacement error(ADE) and final displacement error(FDE) for 6-second prediction are 1.84m and 4.32m respectively. We also show that the proposed model can accurately predict vehicle trajectories i",
    "link": "http://arxiv.org/abs/2306.01812",
    "context": "Title: SAPI: Surroundings-Aware Vehicle Trajectory Prediction at Intersections. (arXiv:2306.01812v1 [cs.LG])\nAbstract: In this work we propose a deep learning model, i.e., SAPI, to predict vehicle trajectories at intersections. SAPI uses an abstract way to represent and encode surrounding environment by utilizing information from real-time map, right-of-way, and surrounding traffic. The proposed model consists of two convolutional network (CNN) and recurrent neural network (RNN)-based encoders and one decoder. A refiner is proposed to conduct a look-back operation inside the model, in order to make full use of raw history trajectory information. We evaluate SAPI on a proprietary dataset collected in real-world intersections through autonomous vehicles. It is demonstrated that SAPI shows promising performance when predicting vehicle trajectories at intersection, and outperforms benchmark methods. The average displacement error(ADE) and final displacement error(FDE) for 6-second prediction are 1.84m and 4.32m respectively. We also show that the proposed model can accurately predict vehicle trajectories i",
    "path": "papers/23/06/2306.01812.json",
    "total_tokens": 935,
    "translated_title": "SAPI:环境感知车辆在路口的轨迹预测",
    "translated_abstract": "本文提出了一种深度学习模型，即SAPI，用于在路口预测车辆轨迹。SAPI使用抽象的方式来表示和编码周围环境，通过利用实时地图、优先权和周围交通信息。提出的模型包括两个卷积网络(CNN)和一个基于循环神经网络(RNN)的编码器以及一个解码器。为了充分利用原始历史轨迹信息，在模型中提出了一个细化器来进行回溯操作。我们使用自主车辆在实际路口采集的专有数据集评估了SAPI。结果表明，在预测路口车辆轨迹时，SAPI表现出有希望的性能，并且优于基准方法。6秒预测的平均位移误差(ADE)和最终位移误差(FDE)分别为1.84米和4.32米。我们还展示了该模型能够准确预测车辆轨迹。",
    "tldr": "本文提出了一种称为SAPI的深度学习模型，用于在路口预测车辆轨迹，通过实时地图、优先权和周围交通信息来表示和编码周围环境。SAPI能够在预测车辆轨迹时表现出有希望的性能，且优于基准方法。",
    "en_tdlr": "This paper proposes a deep learning model called SAPI for predicting vehicle trajectories at intersections, which uses an abstract way to represent and encode surrounding environment by utilizing real-time map, right-of-way, and surrounding traffic information. SAPI shows promising performance when predicting vehicle trajectories at intersections and outperforms benchmark methods."
}