{
    "title": "Boosting-based Construction of BDDs for Linear Threshold Functions and Its Application to Verification of Neural Networks. (arXiv:2306.05211v1 [cs.LG])",
    "abstract": "Understanding the characteristics of neural networks is important but difficult due to their complex structures and behaviors. Some previous work proposes to transform neural networks into equivalent Boolean expressions and apply verification techniques for characteristics of interest. This approach is promising since rich results of verification techniques for circuits and other Boolean expressions can be readily applied. The bottleneck is the time complexity of the transformation. More precisely, (i) each neuron of the network, i.e., a linear threshold function, is converted to a Binary Decision Diagram (BDD), and (ii) they are further combined into some final form, such as Boolean circuits. For a linear threshold function with $n$ variables, an existing method takes $O(n2^{\\frac{n}{2}})$ time to construct an ordered BDD of size $O(2^{\\frac{n}{2}})$ consistent with some variable ordering. However, it is non-trivial to choose a variable ordering producing a small BDD among $n!$ candid",
    "link": "http://arxiv.org/abs/2306.05211",
    "context": "Title: Boosting-based Construction of BDDs for Linear Threshold Functions and Its Application to Verification of Neural Networks. (arXiv:2306.05211v1 [cs.LG])\nAbstract: Understanding the characteristics of neural networks is important but difficult due to their complex structures and behaviors. Some previous work proposes to transform neural networks into equivalent Boolean expressions and apply verification techniques for characteristics of interest. This approach is promising since rich results of verification techniques for circuits and other Boolean expressions can be readily applied. The bottleneck is the time complexity of the transformation. More precisely, (i) each neuron of the network, i.e., a linear threshold function, is converted to a Binary Decision Diagram (BDD), and (ii) they are further combined into some final form, such as Boolean circuits. For a linear threshold function with $n$ variables, an existing method takes $O(n2^{\\frac{n}{2}})$ time to construct an ordered BDD of size $O(2^{\\frac{n}{2}})$ consistent with some variable ordering. However, it is non-trivial to choose a variable ordering producing a small BDD among $n!$ candid",
    "path": "papers/23/06/2306.05211.json",
    "total_tokens": 907,
    "translated_title": "基于Boosting的线性阈值函数BDD构造及其在神经网络验证中的应用",
    "translated_abstract": "由于神经网络的复杂结构和行为，理解其特征具有重要意义但也很困难。先前的一些工作提出将神经网络转换为等价的布尔表达式，并应用验证技术来研究感兴趣的特征。然而，该转换的时间复杂度是瓶颈。本文提出了一种基于Boosting技术的新方法，用于构造任何线性阈值函数的有序BDD，并且可以在时间复杂度O(n2^{n})内实现。我们证明了该方法的有效性，应用于神经网络对抗攻击的鲁棒性验证。",
    "tldr": "本文提出了一种基于Boosting的新方法，用于构造任何线性阈值函数的有序BDD，并可以在O(n2^{n})的时间复杂度内实现。该方法已应用于神经网络对抗攻击的鲁棒性验证中。"
}