{
    "title": "Zero-Shot Blind Audio Bandwidth Extension. (arXiv:2306.01433v1 [eess.AS])",
    "abstract": "Audio bandwidth extension involves the realistic reconstruction of high-frequency spectra from bandlimited observations. In cases where the lowpass degradation is unknown, such as in restoring historical audio recordings, this becomes a blind problem. This paper introduces a novel method called BABE (Blind Audio Bandwidth Extension) that addresses the blind problem in a zero-shot setting, leveraging the generative priors of a pre-trained unconditional diffusion model. During the inference process, BABE utilizes a generalized version of diffusion posterior sampling, where the degradation operator is unknown but parametrized and inferred iteratively. The performance of the proposed method is evaluated using objective and subjective metrics, and the results show that BABE surpasses state-of-the-art blind bandwidth extension baselines and achieves competitive performance compared to non-blind filter-informed methods when tested with synthetic data. Moreover, BABE exhibits robust generaliza",
    "link": "http://arxiv.org/abs/2306.01433",
    "context": "Title: Zero-Shot Blind Audio Bandwidth Extension. (arXiv:2306.01433v1 [eess.AS])\nAbstract: Audio bandwidth extension involves the realistic reconstruction of high-frequency spectra from bandlimited observations. In cases where the lowpass degradation is unknown, such as in restoring historical audio recordings, this becomes a blind problem. This paper introduces a novel method called BABE (Blind Audio Bandwidth Extension) that addresses the blind problem in a zero-shot setting, leveraging the generative priors of a pre-trained unconditional diffusion model. During the inference process, BABE utilizes a generalized version of diffusion posterior sampling, where the degradation operator is unknown but parametrized and inferred iteratively. The performance of the proposed method is evaluated using objective and subjective metrics, and the results show that BABE surpasses state-of-the-art blind bandwidth extension baselines and achieves competitive performance compared to non-blind filter-informed methods when tested with synthetic data. Moreover, BABE exhibits robust generaliza",
    "path": "papers/23/06/2306.01433.json",
    "total_tokens": 896,
    "translated_title": "零样本盲音频带宽扩展",
    "translated_abstract": "音频带宽扩展涉及从带宽受限的观测信号中实现高频谱的逼真重建。在低通信号退化未知的情况下，比如对历史音频记录的恢复，这便成了一个盲问题。本文提出了一种名为BABE的新方法（Blind Audio Bandwidth Extension），在零样本情况下解决了盲问题，利用了预训练的无条件扩散模型的生成先验。在推断过程中，BABE利用了一个广义版本的扩散后验采样，在其中退化算子是未知的，但是通过迭代进行参数化和推断。提出的方法的性能是用客观和主观指标评估的，结果表明BABE超过了最先进的盲带宽扩展基线，并且在测试合成数据时与非盲滤波器知情方法相比实现了有竞争力的性能。此外，BABE表现出了强大的泛化能力。",
    "tldr": "本文提出了一种名为BABE的新方法，在零样本情况下解决了具有挑战性的盲音频带宽扩展问题，实现了比最先进的盲带宽扩展基线更好的性能，并且表现出了强大的泛化能力。",
    "en_tdlr": "This paper proposes a novel method, named BABE, that resolves the challenging blind audio bandwidth extension problem in a zero-shot setting. It achieves better performance than state-of-the-art blind bandwidth extension baselines, exhibits robust generalization, and shows competitive performance compared to non-blind filter-informed methods when tested with synthetic data."
}