{
    "title": "OpenSTL: A Comprehensive Benchmark of Spatio-Temporal Predictive Learning. (arXiv:2306.11249v2 [cs.CV] UPDATED)",
    "abstract": "Spatio-temporal predictive learning is a learning paradigm that enables models to learn spatial and temporal patterns by predicting future frames from given past frames in an unsupervised manner. Despite remarkable progress in recent years, a lack of systematic understanding persists due to the diverse settings, complex implementation, and difficult reproducibility. Without standardization, comparisons can be unfair and insights inconclusive. To address this dilemma, we propose OpenSTL, a comprehensive benchmark for spatio-temporal predictive learning that categorizes prevalent approaches into recurrent-based and recurrent-free models. OpenSTL provides a modular and extensible framework implementing various state-of-the-art methods. We conduct standard evaluations on datasets across various domains, including synthetic moving object trajectory, human motion, driving scenes, traffic flow and weather forecasting. Based on our observations, we provide a detailed analysis of how model arch",
    "link": "http://arxiv.org/abs/2306.11249",
    "context": "Title: OpenSTL: A Comprehensive Benchmark of Spatio-Temporal Predictive Learning. (arXiv:2306.11249v2 [cs.CV] UPDATED)\nAbstract: Spatio-temporal predictive learning is a learning paradigm that enables models to learn spatial and temporal patterns by predicting future frames from given past frames in an unsupervised manner. Despite remarkable progress in recent years, a lack of systematic understanding persists due to the diverse settings, complex implementation, and difficult reproducibility. Without standardization, comparisons can be unfair and insights inconclusive. To address this dilemma, we propose OpenSTL, a comprehensive benchmark for spatio-temporal predictive learning that categorizes prevalent approaches into recurrent-based and recurrent-free models. OpenSTL provides a modular and extensible framework implementing various state-of-the-art methods. We conduct standard evaluations on datasets across various domains, including synthetic moving object trajectory, human motion, driving scenes, traffic flow and weather forecasting. Based on our observations, we provide a detailed analysis of how model arch",
    "path": "papers/23/06/2306.11249.json",
    "total_tokens": 907,
    "translated_title": "OpenSTL: 一个全面的时空预测学习基准",
    "translated_abstract": "时空预测学习是一种学习范式，通过在无监督的情况下预测未来帧来学习空间和时间模式。尽管近年来取得了显著进展，但由于各种环境、复杂的实现和难以复现性，仍然存在着缺乏系统性理解的问题。没有标准化，比较可能不公平，洞见不确定。为了解决这个困境，我们提出了OpenSTL，一个全面的时空预测学习基准，将流行的方法分为基于循环和不基于循环的模型。OpenSTL提供了一个模块化和可扩展的框架，实现了各种最先进的方法。我们对包括合成移动物体轨迹、人体运动、驾驶场景、交通流量和天气预报在内的各种领域的数据集进行了标准评估。基于我们的观察，我们详细分析了模型架构的表现。",
    "tldr": "OpenSTL是一个全面的时空预测学习基准，通过将流行的方法分为基于循环和不基于循环的模型，并提供一个模块化和可扩展的框架，对各种领域的数据集进行了标准评估，并对模型架构进行了详细分析。",
    "en_tdlr": "OpenSTL is a comprehensive benchmark for spatio-temporal predictive learning that categorizes prevalent approaches into recurrent-based and recurrent-free models, providing a modular and extensible framework for standard evaluations on datasets across various domains, with a detailed analysis of model architectures."
}