{
    "title": "Robustness and Generalization Performance of Deep Learning Models on Cyber-Physical Systems: A Comparative Study. (arXiv:2306.07737v1 [cs.LG])",
    "abstract": "Deep learning (DL) models have seen increased attention for time series forecasting, yet the application on cyber-physical systems (CPS) is hindered by the lacking robustness of these methods. Thus, this study evaluates the robustness and generalization performance of DL architectures on multivariate time series data from CPS. Our investigation focuses on the models' ability to handle a range of perturbations, such as sensor faults and noise, and assesses their impact on overall performance. Furthermore, we test the generalization and transfer learning capabilities of these models by exposing them to out-of-distribution (OOD) samples. These include deviations from standard system operations, while the core dynamics of the underlying physical system are preserved. Additionally, we test how well the models respond to several data augmentation techniques, including added noise and time warping. Our experimental framework utilizes a simulated three-tank system, proposed as a novel benchmar",
    "link": "http://arxiv.org/abs/2306.07737",
    "context": "Title: Robustness and Generalization Performance of Deep Learning Models on Cyber-Physical Systems: A Comparative Study. (arXiv:2306.07737v1 [cs.LG])\nAbstract: Deep learning (DL) models have seen increased attention for time series forecasting, yet the application on cyber-physical systems (CPS) is hindered by the lacking robustness of these methods. Thus, this study evaluates the robustness and generalization performance of DL architectures on multivariate time series data from CPS. Our investigation focuses on the models' ability to handle a range of perturbations, such as sensor faults and noise, and assesses their impact on overall performance. Furthermore, we test the generalization and transfer learning capabilities of these models by exposing them to out-of-distribution (OOD) samples. These include deviations from standard system operations, while the core dynamics of the underlying physical system are preserved. Additionally, we test how well the models respond to several data augmentation techniques, including added noise and time warping. Our experimental framework utilizes a simulated three-tank system, proposed as a novel benchmar",
    "path": "papers/23/06/2306.07737.json",
    "total_tokens": 1120,
    "translated_title": "深度学习模型在物理-计算系统中的鲁棒性和泛化性能的比较研究",
    "translated_abstract": "深度学习模型在时间序列预测方面越来越受到关注，但在物理-计算系统中应用受到这些方法鲁棒性的限制。因此，本研究评估了深度学习架构在来自物理-计算系统的多元时间序列数据上的鲁棒性和泛化性能。我们的研究重点是模型处理一系列扰动的能力，如传感器故障和噪声，并评估它们对整体性能的影响。此外，我们通过将它们暴露于分布之外（OOD）的样本来测试这些模型的泛化和迁移学习能力。这些样本包括偏离标准系统操作，同时保留了基础物理系统的核心动态。此外，我们测试了模型对几种数据增强技术的响应能力，包括添加噪声和时间扭曲。我们的实验框架利用了一个模拟的三罐系统，作为研究物理-计算系统中深度学习模型鲁棒性的新型基准。结果表明，尽管深度学习模型能够达到高精度，但它们的鲁棒性和泛化能力不足以用于现实世界中的物理-计算系统应用。",
    "tldr": "本文研究了深度学习模型在物理-计算系统中的鲁棒性和泛化性能，并通过暴露模型于分布之外的样本来测试其迁移学习能力和响应数据增强技术的能力。结果表明，深度学习模型虽能达高精度，但其鲁棒性和泛化能力还不足以应用于实际物理-计算系统中。"
}