{
    "title": "SolarEV City Concept for Paris: A promising idea?. (arXiv:2306.00132v1 [econ.GN])",
    "abstract": "Urban decarbonization is one of the pillars for strategies to achieve carbon neutrality around the world. However, the current speed of urban decarbonization is insufficient to keep pace with efforts to achieve this goal. Rooftop PVs integrated with electric vehicles (EVs) as battery is a promising technology capable to supply CO2-free, affordable, and dispatchable electricity in urban environments (SolarEV City Concept). Here, we evaluated Paris, France for the decarbonization potentials of rooftop PV + EV in comparison to the surrounding suburban area Ile-de-France and Kyoto, Japan. We assessed various scenarios by calculating the energy sufficiency, self-consumption, self-sufficiency, cost savings, and CO2 emission reduction of the PV + EV system or PV only system. The combination of EVs with PVs by V2H or V2B systems at the city or region level was found to be more effective in Ile-de-France than in Paris suggesting that SolarEV City is more effective for geographically larger area",
    "link": "http://arxiv.org/abs/2306.00132",
    "context": "Title: SolarEV City Concept for Paris: A promising idea?. (arXiv:2306.00132v1 [econ.GN])\nAbstract: Urban decarbonization is one of the pillars for strategies to achieve carbon neutrality around the world. However, the current speed of urban decarbonization is insufficient to keep pace with efforts to achieve this goal. Rooftop PVs integrated with electric vehicles (EVs) as battery is a promising technology capable to supply CO2-free, affordable, and dispatchable electricity in urban environments (SolarEV City Concept). Here, we evaluated Paris, France for the decarbonization potentials of rooftop PV + EV in comparison to the surrounding suburban area Ile-de-France and Kyoto, Japan. We assessed various scenarios by calculating the energy sufficiency, self-consumption, self-sufficiency, cost savings, and CO2 emission reduction of the PV + EV system or PV only system. The combination of EVs with PVs by V2H or V2B systems at the city or region level was found to be more effective in Ile-de-France than in Paris suggesting that SolarEV City is more effective for geographically larger area",
    "path": "papers/23/06/2306.00132.json",
    "total_tokens": 960,
    "translated_title": "巴黎SolarEV城市概念：一个有前途的想法吗？",
    "translated_abstract": "城市脱碳是实现全球碳中和战略的支柱之一。然而，当前的城市脱碳速度不足以跟上实现这一目标的努力。屋顶光伏与电动汽车（EV）集成为电池的SolarEV城市概念是一种有前途的技术，能够在城市环境中提供无CO2、实惠、可调度的电力。在这里，我们评估了巴黎，法国的屋顶光伏+EV与周边郊区Ile-de-France和日本的京都的脱碳潜力。我们通过计算PV + EV系统或仅PV系统的能源充足性、自用率、自给自足率、成本节约和CO2排放减少等指标，对各种场景进行了评估。将EV与PV通过V2H或V2B系统在城市或地区层面上结合使用，在Ile-de-France比巴黎更有效，这表明SolarEV城市概念在地理范围更大的地区更有效。",
    "tldr": "在城市脱碳方面，SolarEV City（即屋顶光伏与电动汽车的结合）的效果取决于地理范围大小，将EV与PV通过V2H或V2B系统在地理范围更大的地区结合使用更有效。",
    "en_tdlr": "SolarEV City, the combination of rooftop PVs with electric vehicles, can provide CO2-free, affordable, and dispatchable electricity in urban environments. However, its effectiveness in urban decarbonization depends on the geographical scope of implementation. Combining EVs with PVs through V2H or V2B systems in larger areas has greater potential for success."
}