{
    "title": "Leveraging Natural Language Processing For Public Health Screening On YouTube: A COVID-19 Case Study. (arXiv:2306.01164v1 [cs.CL])",
    "abstract": "Background: Social media platforms have become a viable source of medical information, with patients and healthcare professionals using them to share health-related information and track diseases. Similarly, YouTube, the largest video-sharing platform in the world contains vlogs where individuals talk about their illnesses. The aim of our study was to investigate the use of Natural Language Processing (NLP) to identify the spoken content of YouTube vlogs related to the diagnosis of Coronavirus disease of 2019 (COVID-19) for public health screening. Methods: COVID-19 videos on YouTube were searched using relevant keywords. A total of 1000 videos being spoken in English were downloaded out of which 791 were classified as vlogs, 192 were non-vlogs, and 17 were deleted by the channel. The videos were converted into a textual format using Microsoft Streams. The textual data was preprocessed using basic and advanced preprocessing methods. A lexicon of 200 words was created which contained wo",
    "link": "http://arxiv.org/abs/2306.01164",
    "context": "Title: Leveraging Natural Language Processing For Public Health Screening On YouTube: A COVID-19 Case Study. (arXiv:2306.01164v1 [cs.CL])\nAbstract: Background: Social media platforms have become a viable source of medical information, with patients and healthcare professionals using them to share health-related information and track diseases. Similarly, YouTube, the largest video-sharing platform in the world contains vlogs where individuals talk about their illnesses. The aim of our study was to investigate the use of Natural Language Processing (NLP) to identify the spoken content of YouTube vlogs related to the diagnosis of Coronavirus disease of 2019 (COVID-19) for public health screening. Methods: COVID-19 videos on YouTube were searched using relevant keywords. A total of 1000 videos being spoken in English were downloaded out of which 791 were classified as vlogs, 192 were non-vlogs, and 17 were deleted by the channel. The videos were converted into a textual format using Microsoft Streams. The textual data was preprocessed using basic and advanced preprocessing methods. A lexicon of 200 words was created which contained wo",
    "path": "papers/23/06/2306.01164.json",
    "total_tokens": 721,
    "translated_title": "利用自然语言处理进行YouTube公共卫生筛查：COVID-19案例研究",
    "translated_abstract": "背景：社交媒体平台已成为医疗信息的可靠来源，患者和医疗专业人员使用它们分享与跟踪疾病相关的信息。同样，全球最大的视频分享平台YouTube包含个人讲述疾病的视频日志。我们研究的目的是利用自然语言处理（NLP）来识别与Coronavirus disease of 2019 (COVID-19)的诊断相关的YouTube视频日志内容，以进行公共卫生筛查。",
    "tldr": "本研究探索利用自然语言处理技术识别COVID-19相关的YouTube视频日志内容，用于公共卫生筛查。"
}