{
    "title": "AbODE: Ab Initio Antibody Design using Conjoined ODEs. (arXiv:2306.01005v1 [cs.LG])",
    "abstract": "Antibodies are Y-shaped proteins that neutralize pathogens and constitute the core of our adaptive immune system. De novo generation of new antibodies that target specific antigens holds the key to accelerating vaccine discovery. However, this co-design of the amino acid sequence and the 3D structure subsumes and accentuates some central challenges from multiple tasks, including protein folding (sequence to structure), inverse folding (structure to sequence), and docking (binding). We strive to surmount these challenges with a new generative model AbODE that extends graph PDEs to accommodate both contextual information and external interactions. Unlike existing approaches, AbODE uses a single round of full-shot decoding and elicits continuous differential attention that encapsulates and evolves with latent interactions within the antibody as well as those involving the antigen. We unravel fundamental connections between AbODE and temporal networks as well as graph-matching networks. Th",
    "link": "http://arxiv.org/abs/2306.01005",
    "context": "Title: AbODE: Ab Initio Antibody Design using Conjoined ODEs. (arXiv:2306.01005v1 [cs.LG])\nAbstract: Antibodies are Y-shaped proteins that neutralize pathogens and constitute the core of our adaptive immune system. De novo generation of new antibodies that target specific antigens holds the key to accelerating vaccine discovery. However, this co-design of the amino acid sequence and the 3D structure subsumes and accentuates some central challenges from multiple tasks, including protein folding (sequence to structure), inverse folding (structure to sequence), and docking (binding). We strive to surmount these challenges with a new generative model AbODE that extends graph PDEs to accommodate both contextual information and external interactions. Unlike existing approaches, AbODE uses a single round of full-shot decoding and elicits continuous differential attention that encapsulates and evolves with latent interactions within the antibody as well as those involving the antigen. We unravel fundamental connections between AbODE and temporal networks as well as graph-matching networks. Th",
    "path": "papers/23/06/2306.01005.json",
    "total_tokens": 868,
    "translated_title": "AbODE：使用联合ODE的从头设计抗体",
    "translated_abstract": "抗体是一种Y形蛋白，可以中和病原体，并构成我们适应性免疫系统的核心。新的抗体的从头设计，以特定抗原为靶标，是加速疫苗发现的关键。然而，这种氨基酸序列和三维结构的联合设计涵盖并强调了来自多个任务的一些核心挑战，包括蛋白折叠（序列到结构），逆向折叠（结构到序列）和对接（结合）。我们通过一个新的生成模型AbODE来克服这些挑战，该模型扩展了图形PDE以适应上下文信息和外部相互作用。与现有方法不同，AbODE使用一轮完整的解码，并引出连续微分注意力，其中包括抗体内部和抗原相关的潜在相互作用。我们揭示了AbODE与时间网络以及图匹配网络之间的基本联系。",
    "tldr": "该论文提出了一种新的从头设计抗体的方法AbODE，该方法使用连续微分注意力来应对蛋白折叠、逆向折叠和对接等挑战，并与时间网络和图匹配网络具有基本联系。",
    "en_tdlr": "This paper proposes a new method for de novo antibody design called AbODE, which uses continuous differential attention to address challenges such as protein folding, inverse folding and docking, and has fundamental connections with temporal networks and graph-matching networks."
}