{
    "title": "Fixed-Budget Best-Arm Identification with Heterogeneous Reward Variances. (arXiv:2306.07549v1 [cs.LG])",
    "abstract": "We study the problem of best-arm identification (BAI) in the fixed-budget setting with heterogeneous reward variances. We propose two variance-adaptive BAI algorithms for this setting: SHVar for known reward variances and SHAdaVar for unknown reward variances. Our algorithms rely on non-uniform budget allocations among the arms where the arms with higher reward variances are pulled more often than those with lower variances. The main algorithmic novelty is in the design of SHAdaVar, which allocates budget greedily based on overestimating the unknown reward variances. We bound probabilities of misidentifying the best arms in both SHVar and SHAdaVar. Our analyses rely on novel lower bounds on the number of pulls of an arm that do not require closed-form solutions to the budget allocation problem. Since one of our budget allocation problems is analogous to the optimal experiment design with unknown variances, we believe that our results are of a broad interest. Our experiments validate ou",
    "link": "http://arxiv.org/abs/2306.07549",
    "context": "Title: Fixed-Budget Best-Arm Identification with Heterogeneous Reward Variances. (arXiv:2306.07549v1 [cs.LG])\nAbstract: We study the problem of best-arm identification (BAI) in the fixed-budget setting with heterogeneous reward variances. We propose two variance-adaptive BAI algorithms for this setting: SHVar for known reward variances and SHAdaVar for unknown reward variances. Our algorithms rely on non-uniform budget allocations among the arms where the arms with higher reward variances are pulled more often than those with lower variances. The main algorithmic novelty is in the design of SHAdaVar, which allocates budget greedily based on overestimating the unknown reward variances. We bound probabilities of misidentifying the best arms in both SHVar and SHAdaVar. Our analyses rely on novel lower bounds on the number of pulls of an arm that do not require closed-form solutions to the budget allocation problem. Since one of our budget allocation problems is analogous to the optimal experiment design with unknown variances, we believe that our results are of a broad interest. Our experiments validate ou",
    "path": "papers/23/06/2306.07549.json",
    "total_tokens": 1022,
    "translated_title": "异构奖励方差下的定长最优臂识别问题研究",
    "translated_abstract": "本文研究了在异构奖励方差下的定长最优臂识别问题。我们提出了两种应用于不同奖励方差情况下的改进BAI算法：SHVar适用于已知奖励方差情况，SHAdaVar适用于未知奖励方差情况。我们的算法通过在不同臂之间分配不同比例的预算，更多地选择方差更高的臂。我们的算法创新在于SHAdaVar的设计，其通过过度估计未知奖励方差以贪心地分配预算。我们分别对SHVar和SHAdaVar中误识别最优臂的概率进行限制。我们的分析依赖于新颖的无需关闭预算分配问题的解决方案的臂拉动次数下界。由于我们的一个预算分配问题类似于未知方差的最优实验设计，因此我们认为我们的结果具有广泛的兴趣。我们的实验验证了我们算法的有效性。",
    "tldr": "本文提出了两种改进BAI算法，SHVar适用于已知奖励方差情况，SHAdaVar适用于未知奖励方差情况，算法通过在不同臂之间分配不同比例的预算，更多地选择方差更高的臂，SHAdaVar通过过度估计未知奖励方差以贪心地分配预算。创新之处在于无需关闭预算分配问题的解决方案的臂拉动次数下界。",
    "en_tdlr": "This paper proposes two improved BAI algorithms, SHVar for known reward variances and SHAdaVar for unknown reward variances, which allocate different proportions of budgets among arms and pull arms with higher variances more often. SHAdaVar allocates budget greedily based on overestimating the unknown reward variances. The novelty lies in the lower bounds on the number of arm pulls without requiring closed-form solutions to the budget allocation problem."
}