{
    "title": "ST-PINN: A Self-Training Physics-Informed Neural Network for Partial Differential Equations. (arXiv:2306.09389v1 [cs.LG])",
    "abstract": "Partial differential equations (PDEs) are an essential computational kernel in physics and engineering. With the advance of deep learning, physics-informed neural networks (PINNs), as a mesh-free method, have shown great potential for fast PDE solving in various applications. To address the issue of low accuracy and convergence problems of existing PINNs, we propose a self-training physics-informed neural network, ST-PINN. Specifically, ST-PINN introduces a pseudo label based self-learning algorithm during training. It employs governing equation as the pseudo-labeled evaluation index and selects the highest confidence examples from the sample points to attach the pseudo labels. To our best knowledge, we are the first to incorporate a self-training mechanism into physics-informed learning. We conduct experiments on five PDE problems in different fields and scenarios. The results demonstrate that the proposed method allows the network to learn more physical information and benefit conver",
    "link": "http://arxiv.org/abs/2306.09389",
    "context": "Title: ST-PINN: A Self-Training Physics-Informed Neural Network for Partial Differential Equations. (arXiv:2306.09389v1 [cs.LG])\nAbstract: Partial differential equations (PDEs) are an essential computational kernel in physics and engineering. With the advance of deep learning, physics-informed neural networks (PINNs), as a mesh-free method, have shown great potential for fast PDE solving in various applications. To address the issue of low accuracy and convergence problems of existing PINNs, we propose a self-training physics-informed neural network, ST-PINN. Specifically, ST-PINN introduces a pseudo label based self-learning algorithm during training. It employs governing equation as the pseudo-labeled evaluation index and selects the highest confidence examples from the sample points to attach the pseudo labels. To our best knowledge, we are the first to incorporate a self-training mechanism into physics-informed learning. We conduct experiments on five PDE problems in different fields and scenarios. The results demonstrate that the proposed method allows the network to learn more physical information and benefit conver",
    "path": "papers/23/06/2306.09389.json",
    "total_tokens": 920,
    "translated_title": "ST-PINN: 一种用于偏微分方程的自训练物理知识神经网络",
    "translated_abstract": "偏微分方程是物理和工程计算核心。随着深度学习的发展，无网格方法的物理知识神经网络（PINN）在各种应用中展示出了快速求解PDE的巨大潜力。我们提出了一种自训练物理知识神经网络ST-PINN，来解决现有PINN的低精度和收敛问题。具体而言，ST-PINN在训练期间引入了基于伪标签的自学习算法。它将控制方程作为伪标记评估指标，并从样本点中选择最高置信度的示例来附加伪标签。我们相信我们是首先将自我训练机制引入物理信息学习的人。我们在不同领域和场景中对五个PDE进行了实验。结果表明，所提出的方法使网络可以学习更多物理信息并受益于收敛。",
    "tldr": "提出了一种自训练物理知识神经网络ST-PINN。在训练期间引入基于伪标签的自学习算法，以提高现有PINN的精度和收敛性。实验结果表明， ST-PINN 可以学习更多的物理知识并受益于更好的收敛性。",
    "en_tdlr": "We propose ST-PINN, a self-training physics-informed neural network, which introduces a pseudo label based self-learning algorithm during training to address low accuracy and convergence problems of existing PINNs. Our experiments demonstrate that ST-PINN can learn more physical knowledge and benefit from better convergence."
}