{
    "title": "Task-Driven Graph Attention for Hierarchical Relational Object Navigation. (arXiv:2306.13760v1 [cs.AI])",
    "abstract": "Embodied AI agents in large scenes often need to navigate to find objects. In this work, we study a naturally emerging variant of the object navigation task, hierarchical relational object navigation (HRON), where the goal is to find objects specified by logical predicates organized in a hierarchical structure objects related to furniture and then to rooms - such as finding an apple on top of a table in the kitchen. Solving such a task requires an efficient representation to reason about object relations and correlate the relations in the environment and in the task goal. HRON in large scenes (e.g. homes) is particularly challenging due to its partial observability and long horizon, which invites solutions that can compactly store the past information while effectively exploring the scene. We demonstrate experimentally that scene graphs are the best-suited representation compared to conventional representations such as images or 2D maps. We propose a solution that uses scene graphs a",
    "link": "http://arxiv.org/abs/2306.13760",
    "context": "Title: Task-Driven Graph Attention for Hierarchical Relational Object Navigation. (arXiv:2306.13760v1 [cs.AI])\nAbstract: Embodied AI agents in large scenes often need to navigate to find objects. In this work, we study a naturally emerging variant of the object navigation task, hierarchical relational object navigation (HRON), where the goal is to find objects specified by logical predicates organized in a hierarchical structure objects related to furniture and then to rooms - such as finding an apple on top of a table in the kitchen. Solving such a task requires an efficient representation to reason about object relations and correlate the relations in the environment and in the task goal. HRON in large scenes (e.g. homes) is particularly challenging due to its partial observability and long horizon, which invites solutions that can compactly store the past information while effectively exploring the scene. We demonstrate experimentally that scene graphs are the best-suited representation compared to conventional representations such as images or 2D maps. We propose a solution that uses scene graphs a",
    "path": "papers/23/06/2306.13760.json",
    "total_tokens": 907,
    "translated_title": "基于任务驱动的图注意力在分层关系物体导航中的应用",
    "translated_abstract": "大场景中的Embodied AI agents经常需要导航以寻找物体。本文研究了一种自然出现的物体导航任务变体，即分层关系物体导航（HRON），其目标是寻找由逻辑谓词指定的物体，这些谓词以分层结构组织，其中关于家具和房间的对象相关，例如在厨房的桌子上找到一个苹果。解决这样的任务需要一种有效的表示方法来推理对象关系并将环境和任务目标中的关系相关联。HRON在大场景（例如家庭）中特别具有挑战性，因为它具有部分可观察性和长时间跨度，这需要可以紧凑地存储过去的信息并有效地探索场景的解决方案。我们实验证明，与图像或2D地图等传统表示方法相比，场景图是最适合的表示形式。我们提出了一种解决方案，它使用场景图作为表示并使用任务驱动图注意力模型来进行有效的探索。",
    "tldr": "本文研究了分层关系物体导航任务，使用场景图作为环境表示，提出了基于任务驱动图注意力模型的解决方案，可有效地探索具有长时间跨度和部分可观察性的大场景。"
}