{
    "title": "MetaXLR -- Mixed Language Meta Representation Transformation for Low-resource Cross-lingual Learning based on Multi-Armed Bandit. (arXiv:2306.00100v1 [cs.CL])",
    "abstract": "Transfer learning for extremely low resource languages is a challenging task as there is no large scale monolingual corpora for pre training or sufficient annotated data for fine tuning. We follow the work of MetaXL which suggests using meta learning for transfer learning from a single source language to an extremely low resource one. We propose an enhanced approach which uses multiple source languages chosen in a data driven manner. In addition, we introduce a sample selection strategy for utilizing the languages in training by using a multi armed bandit algorithm. Using both of these improvements we managed to achieve state of the art results on the NER task for the extremely low resource languages while using the same amount of data, making the representations better generalized. Also, due to the method ability to use multiple languages it allows the framework to use much larger amounts of data, while still having superior results over the former MetaXL method even with the same amo",
    "link": "http://arxiv.org/abs/2306.00100",
    "context": "Title: MetaXLR -- Mixed Language Meta Representation Transformation for Low-resource Cross-lingual Learning based on Multi-Armed Bandit. (arXiv:2306.00100v1 [cs.CL])\nAbstract: Transfer learning for extremely low resource languages is a challenging task as there is no large scale monolingual corpora for pre training or sufficient annotated data for fine tuning. We follow the work of MetaXL which suggests using meta learning for transfer learning from a single source language to an extremely low resource one. We propose an enhanced approach which uses multiple source languages chosen in a data driven manner. In addition, we introduce a sample selection strategy for utilizing the languages in training by using a multi armed bandit algorithm. Using both of these improvements we managed to achieve state of the art results on the NER task for the extremely low resource languages while using the same amount of data, making the representations better generalized. Also, due to the method ability to use multiple languages it allows the framework to use much larger amounts of data, while still having superior results over the former MetaXL method even with the same amo",
    "path": "papers/23/06/2306.00100.json",
    "total_tokens": 942,
    "translated_title": "MetaXLR——基于多臂赌博机的低资源跨语言学习的混合语言元表示转换(arXiv:2306.00100v1 [cs.CL])",
    "translated_abstract": "对于极度低资源的语言而言，迁移学习是一项具有挑战性的任务，因为没有大规模的单语语料库进行预训练，也没有足够的标注数据进行微调。我们继承了MetaXL的方法，该方法建议使用元学习从单个源语言转移到极度低资源语言。我们提出了一个增强的方法，该方法使用数据驱动的方式选择多个源语言。此外，我们引入了一种样本选择策略，使用多臂赌博机算法来利用训练中的语言。通过这两种改进，我们设法在使用相同数量的数据的情况下，在极度低资源语言的命名实体识别任务上取得了最先进的结果，并使表示更好地泛化。此外，由于该方法能够使用多种语言，因此允许框架使用更大量的数据，即使使用相同数量的数据，仍然优于前MetaXL方法的结果",
    "tldr": "该论文提出了一种增强的混合语言元表示转换方法，通过使用多个数据驱动的源语言和多臂赌博机算法实现了对于极度低资源语言的最先进结果，同时在相同数量的数据下，表示更好地泛化。",
    "en_tdlr": "This paper proposes an enhanced mixed language meta representation transformation method, which achieves state-of-the-art results on extremely low resource languages by using multiple data-driven source languages and a multi-armed bandit algorithm. Moreover, the method allows for using much larger amounts of data and better generalization even with the same amount of data compared to the former MetaXL method."
}