{
    "title": "Herb-Drug Interactions: A Holistic Decision Support System in Healthcare. (arXiv:2306.15365v1 [cs.AI])",
    "abstract": "Complementary and alternative medicine are commonly used concomitantly with conventional medications leading to adverse drug reactions and even fatality in some cases. Furthermore, the vast possibility of herb-drug interactions prevents health professionals from remembering or manually searching them in a database. Decision support systems are a powerful tool that can be used to assist clinicians in making diagnostic and therapeutic decisions in patient care. Therefore, an original and hybrid decision support system was designed to identify herb-drug interactions, applying artificial intelligence techniques to identify new possible interactions. Different machine learning models will be used to strengthen the typical rules engine used in these cases. Thus, using the proposed system, the pharmacy community, people's first line of contact within the Healthcare System, will be able to make better and more accurate therapeutic decisions and mitigate possible adverse events.",
    "link": "http://arxiv.org/abs/2306.15365",
    "context": "Title: Herb-Drug Interactions: A Holistic Decision Support System in Healthcare. (arXiv:2306.15365v1 [cs.AI])\nAbstract: Complementary and alternative medicine are commonly used concomitantly with conventional medications leading to adverse drug reactions and even fatality in some cases. Furthermore, the vast possibility of herb-drug interactions prevents health professionals from remembering or manually searching them in a database. Decision support systems are a powerful tool that can be used to assist clinicians in making diagnostic and therapeutic decisions in patient care. Therefore, an original and hybrid decision support system was designed to identify herb-drug interactions, applying artificial intelligence techniques to identify new possible interactions. Different machine learning models will be used to strengthen the typical rules engine used in these cases. Thus, using the proposed system, the pharmacy community, people's first line of contact within the Healthcare System, will be able to make better and more accurate therapeutic decisions and mitigate possible adverse events.",
    "path": "papers/23/06/2306.15365.json",
    "total_tokens": 942,
    "translated_title": "草药与药物相互作用：综合决策支持系统在医疗保健中的应用",
    "translated_abstract": "备受广泛应用的补充与替代医学常与传统药物同时使用，从而导致药物不良反应甚至有时致命。此外，草药与药物相互作用的巨大可能性使得健康专业人员难以记住或手动搜索数据库中的相互作用信息。决策支持系统是一种强大的工具，可用于协助临床医生在患者护理中做出诊断和治疗决策。因此，设计了一种原创的混合决策支持系统，用于识别草药与药物的相互作用，应用人工智能技术来识别新的可能相互作用。将使用不同的机器学习模型来加强在这些情况下使用的典型规则引擎。因此，使用提出的系统，药房社区、人们在医疗保健系统中的第一线接触点，将能够做出更好、更准确的治疗决策，并减轻可能出现的不良事件。",
    "tldr": "设计了一种新颖的混合决策支持系统，利用人工智能技术识别草药与药物的相互作用，使药房社区在医疗保健系统中能够做出更好、更准确的治疗决策，并减轻可能出现的不良事件。",
    "en_tdlr": "An original and hybrid decision support system has been designed to identify herb-drug interactions using artificial intelligence techniques, allowing the pharmacy community to make better and more accurate therapeutic decisions and mitigate possible adverse events in the healthcare system."
}