{
    "title": "DisasterResponseGPT: Large Language Models for Accelerated Plan of Action Development in Disaster Response Scenarios. (arXiv:2306.17271v1 [cs.LG])",
    "abstract": "The development of plans of action in disaster response scenarios is a time-consuming process. Large Language Models (LLMs) offer a powerful solution to expedite this process through in-context learning. This study presents DisasterResponseGPT, an algorithm that leverages LLMs to generate valid plans of action quickly by incorporating disaster response and planning guidelines in the initial prompt. In DisasterResponseGPT, users input the scenario description and receive a plan of action as output. The proposed method generates multiple plans within seconds, which can be further refined following the user's feedback. Preliminary results indicate that the plans of action developed by DisasterResponseGPT are comparable to human-generated ones while offering greater ease of modification in real-time. This approach has the potential to revolutionize disaster response operations by enabling rapid updates and adjustments during the plan's execution.",
    "link": "http://arxiv.org/abs/2306.17271",
    "context": "Title: DisasterResponseGPT: Large Language Models for Accelerated Plan of Action Development in Disaster Response Scenarios. (arXiv:2306.17271v1 [cs.LG])\nAbstract: The development of plans of action in disaster response scenarios is a time-consuming process. Large Language Models (LLMs) offer a powerful solution to expedite this process through in-context learning. This study presents DisasterResponseGPT, an algorithm that leverages LLMs to generate valid plans of action quickly by incorporating disaster response and planning guidelines in the initial prompt. In DisasterResponseGPT, users input the scenario description and receive a plan of action as output. The proposed method generates multiple plans within seconds, which can be further refined following the user's feedback. Preliminary results indicate that the plans of action developed by DisasterResponseGPT are comparable to human-generated ones while offering greater ease of modification in real-time. This approach has the potential to revolutionize disaster response operations by enabling rapid updates and adjustments during the plan's execution.",
    "path": "papers/23/06/2306.17271.json",
    "total_tokens": 899,
    "translated_title": "大规模语言模型用于加速灾害响应场景中的行动方案开发",
    "translated_abstract": "在灾害响应场景中，制定行动方案是一个耗时的过程。大规模语言模型（LLMs）通过上下文学习提供了一种快速加速该过程的强大解决方案。本研究介绍了DisasterResponseGPT，一种利用LLMs快速生成有效行动方案的算法，该算法将灾害响应和规划指南纳入初始提示中。在DisasterResponseGPT中，用户输入情景描述，输出一个行动方案。该方法在几秒钟内生成多个方案，根据用户的反馈可以进一步完善。初步结果表明，DisasterResponseGPT生成的行动方案与人工生成的方案相当，同时在实时修改方面更加便利。该方法有可能通过在执行计划过程中实现快速更新和调整，从而彻底改变灾害响应行动的方式。",
    "tldr": "DisasterResponseGPT是一种利用大规模语言模型（LLMs）的算法，旨在通过上下文学习快速生成有效行动方案，可在灾害响应场景中加快规划过程。DisasterResponseGPT生成的行动方案与人工生成的方案相当，并提供了实时修改的便利，有可能在执行过程中实现快速更新和调整，从而革新灾害响应行动方式。"
}