{
    "title": "Using Sequences of Life-events to Predict Human Lives. (arXiv:2306.03009v1 [stat.ML])",
    "abstract": "Over the past decade, machine learning has revolutionized computers' ability to analyze text through flexible computational models. Due to their structural similarity to written language, transformer-based architectures have also shown promise as tools to make sense of a range of multi-variate sequences from protein-structures, music, electronic health records to weather-forecasts. We can also represent human lives in a way that shares this structural similarity to language. From one perspective, lives are simply sequences of events: People are born, visit the pediatrician, start school, move to a new location, get married, and so on. Here, we exploit this similarity to adapt innovations from natural language processing to examine the evolution and predictability of human lives based on detailed event sequences. We do this by drawing on arguably the most comprehensive registry data in existence, available for an entire nation of more than six million individuals across decades. Our dat",
    "link": "http://arxiv.org/abs/2306.03009",
    "context": "Title: Using Sequences of Life-events to Predict Human Lives. (arXiv:2306.03009v1 [stat.ML])\nAbstract: Over the past decade, machine learning has revolutionized computers' ability to analyze text through flexible computational models. Due to their structural similarity to written language, transformer-based architectures have also shown promise as tools to make sense of a range of multi-variate sequences from protein-structures, music, electronic health records to weather-forecasts. We can also represent human lives in a way that shares this structural similarity to language. From one perspective, lives are simply sequences of events: People are born, visit the pediatrician, start school, move to a new location, get married, and so on. Here, we exploit this similarity to adapt innovations from natural language processing to examine the evolution and predictability of human lives based on detailed event sequences. We do this by drawing on arguably the most comprehensive registry data in existence, available for an entire nation of more than six million individuals across decades. Our dat",
    "path": "papers/23/06/2306.03009.json",
    "total_tokens": 856,
    "translated_title": "利用生活事件序列预测人类生命",
    "translated_abstract": "在过去的十年中，机器学习通过灵活的计算模型，彻底改变了计算机分析文本的能力。由于其与书面语言的结构相似性，基于转换器的体系结构也显示出成为范围从蛋白质结构、音乐、电子医疗记录到天气预报等多变量序列的工具的前景。我们还可以以一种与语言具有结构相似性的方式来表示人类生命。从一个角度来看，生命只是一系列事件的序列：人们出生，去看小儿科医生，开始上学，搬到新地方，结婚等等。在这里，我们利用这种相似性，采用自然语言处理的创新来研究和预测人类生命的演变和可预测性，基于整个国家的六百多万人数十年间可用的可能是最全面的注册数据。",
    "tldr": "本研究通过将人类生命表示成事件序列，利用自然语言处理的创新方法，分析了整个国家的超过六百万人的多年注册数据，旨在从中预测人类生命的演变和可预测性。",
    "en_tdlr": "This study represents human lives as sequences of events similar to language, and utilizes natural language processing innovations to analyze registry data of over six million individuals over decades, aiming to predict the evolution and predictability of human lives."
}