{
    "title": "A brief review of contrastive learning applied to astrophysics. (arXiv:2306.05528v1 [astro-ph.IM])",
    "abstract": "Reliable tools to extract patterns from high-dimensionality spaces are becoming more necessary as astronomical datasets increase both in volume and complexity. Contrastive Learning is a self-supervised machine learning algorithm that extracts informative measurements from multi-dimensional datasets, which has become increasingly popular in the computer vision and Machine Learning communities in recent years. To do so, it maximizes the agreement between the information extracted from augmented versions of the same input data, making the final representation invariant to the applied transformations. Contrastive Learning is particularly useful in astronomy for removing known instrumental effects and for performing supervised classifications and regressions with a limited amount of available labels, showing a promising avenue towards \\emph{Foundation Models}. This short review paper briefly summarizes the main concepts behind contrastive learning and reviews the first promising application",
    "link": "http://arxiv.org/abs/2306.05528",
    "context": "Title: A brief review of contrastive learning applied to astrophysics. (arXiv:2306.05528v1 [astro-ph.IM])\nAbstract: Reliable tools to extract patterns from high-dimensionality spaces are becoming more necessary as astronomical datasets increase both in volume and complexity. Contrastive Learning is a self-supervised machine learning algorithm that extracts informative measurements from multi-dimensional datasets, which has become increasingly popular in the computer vision and Machine Learning communities in recent years. To do so, it maximizes the agreement between the information extracted from augmented versions of the same input data, making the final representation invariant to the applied transformations. Contrastive Learning is particularly useful in astronomy for removing known instrumental effects and for performing supervised classifications and regressions with a limited amount of available labels, showing a promising avenue towards \\emph{Foundation Models}. This short review paper briefly summarizes the main concepts behind contrastive learning and reviews the first promising application",
    "path": "papers/23/06/2306.05528.json",
    "total_tokens": 823,
    "translated_title": "应用于天体物理学的对比学习的简要评论",
    "translated_abstract": "随着天文数据集的增加，从高维度空间中提取模式的可靠工具变得更加必要。对比学习是一种自监督机器学习算法，从多维数据集中提取信息度量，近年来在计算机视觉和机器学习社区越来越受欢迎。它最大化了同一输入数据的增强版本中提取的信息之间的一致性，使最终表示对应用的变换不变。对比学习在天文学中特别有用，可以消除已知的仪器效应，并使用有限的标签执行监督分类和回归，展示了面向“基础模型”的良好发展前景。这篇简短的评论论文简要总结了对比学习背后的主要概念，并评估了第一个有前途的应用。",
    "tldr": "对比学习是一种自监督机器学习算法，用于从多维数据集中提取信息度量。它可以消除已知的仪器效应，并使用有限的标签执行监督分类和回归，展示了面向“基础模型”的良好发展前景。",
    "en_tdlr": "Contrastive Learning is a self-supervised machine learning algorithm that extracts informative measurements from multi-dimensional datasets. It can remove known instrumental effects and perform supervised classifications and regressions with a limited amount of available labels, showing promising avenue towards “Foundation Models”."
}