{
    "title": "Key predictors for climate policy support and political mobilization: The role of beliefs and preferences. (arXiv:2306.10144v1 [econ.GN])",
    "abstract": "Public support and political mobilization are two crucial factors for the adoption of ambitious climate policies in line with the international greenhouse gas reduction targets of the Paris Agreement. Despite their compound importance, they are mainly studied separately. Using a random forest machine-learning model, this article investigates the relative predictive power of key established explanations for public support and mobilization for climate policies. Predictive models may shape future research priorities and contribute to theoretical advancement by showing which predictors are the most and least important. The analysis is based on a pre-election conjoint survey experiment on the Swiss CO2 Act in 2021. Results indicate that beliefs (such as the perceived effectiveness of policies) and policy design preferences (such as for subsidies or tax-related policies) are the most important predictors while other established explanations, such as socio-demographics, issue salience (the re",
    "link": "http://arxiv.org/abs/2306.10144",
    "context": "Title: Key predictors for climate policy support and political mobilization: The role of beliefs and preferences. (arXiv:2306.10144v1 [econ.GN])\nAbstract: Public support and political mobilization are two crucial factors for the adoption of ambitious climate policies in line with the international greenhouse gas reduction targets of the Paris Agreement. Despite their compound importance, they are mainly studied separately. Using a random forest machine-learning model, this article investigates the relative predictive power of key established explanations for public support and mobilization for climate policies. Predictive models may shape future research priorities and contribute to theoretical advancement by showing which predictors are the most and least important. The analysis is based on a pre-election conjoint survey experiment on the Swiss CO2 Act in 2021. Results indicate that beliefs (such as the perceived effectiveness of policies) and policy design preferences (such as for subsidies or tax-related policies) are the most important predictors while other established explanations, such as socio-demographics, issue salience (the re",
    "path": "papers/23/06/2306.10144.json",
    "total_tokens": 892,
    "translated_title": "气候政策支持和政治动员的关键预测因素：信念和偏好的作用",
    "translated_abstract": "公众支持和政治动员是推动采取符合《巴黎协定》温室气体减排目标的具有雄心壮志的气候政策的两个关键因素。尽管它们的复合重要性，但它们主要是分别研究的。本文采用随机森林机器学习模型，调查了公众支持和动员气候政策的关键解释因素的相对预测能力。预测模型可以塑造未来研究的重点，并通过显示哪些预测因子最重要和最不重要来促进理论进展。分析基于2021年瑞士CO2法案的选前共同调查实验。结果表明，信念（例如政策的 perceived effectiveness）和政策设计偏好（例如对补贴或与税收相关的政策的偏好）是最重要的预测因子，而其他已确定的解释因素，如社会人口统计信息，问题关注度（重要性）等",
    "tldr": "瑞士CO2法案的选前共同调查实验发现，气候政策的支持和动员主要受到信念和政策设计偏好的影响，而非社会人口统计信息等其他因素。",
    "en_tdlr": "A pre-election conjoint survey experiment on the Swiss CO2 Act found that beliefs and policy design preferences are the most important predictors for public support and mobilization on climate policies, rather than socio-demographics and issue salience."
}