{
    "title": "The Future of AI-Assisted Writing. (arXiv:2306.16641v1 [cs.HC])",
    "abstract": "The development of Natural Language Generation models has led to the creation of powerful Artificial Intelligence-assisted writing tools. These tools are capable of predicting users' needs and actively providing suggestions as they write. In this work, we conduct a comparative user-study between such tools from an information retrieval lens: pull and push. Specifically, we investigate the user demand of AI-assisted writing, the impact of the two paradigms on quality, ownership of the writing product, and efficiency and enjoyment of the writing process. We also seek to understand the impact of bias of AI-assisted writing. Our findings show that users welcome seamless assistance of AI in their writing. Furthermore, AI helped users to diversify the ideas in their writing while keeping it clear and concise more quickly. Users also enjoyed the collaboration with AI-assisted writing tools and did not feel a lack of ownership. Finally, although participants did not experience bias in our expe",
    "link": "http://arxiv.org/abs/2306.16641",
    "context": "Title: The Future of AI-Assisted Writing. (arXiv:2306.16641v1 [cs.HC])\nAbstract: The development of Natural Language Generation models has led to the creation of powerful Artificial Intelligence-assisted writing tools. These tools are capable of predicting users' needs and actively providing suggestions as they write. In this work, we conduct a comparative user-study between such tools from an information retrieval lens: pull and push. Specifically, we investigate the user demand of AI-assisted writing, the impact of the two paradigms on quality, ownership of the writing product, and efficiency and enjoyment of the writing process. We also seek to understand the impact of bias of AI-assisted writing. Our findings show that users welcome seamless assistance of AI in their writing. Furthermore, AI helped users to diversify the ideas in their writing while keeping it clear and concise more quickly. Users also enjoyed the collaboration with AI-assisted writing tools and did not feel a lack of ownership. Finally, although participants did not experience bias in our expe",
    "path": "papers/23/06/2306.16641.json",
    "total_tokens": 901,
    "translated_title": "AI辅助写作的未来",
    "translated_abstract": "自然语言生成模型的发展导致了强大的人工智能辅助写作工具的出现。这些工具能够预测用户的需求，并在用户写作时主动提供建议。本研究从信息检索的角度进行了一项比较性用户研究，研究了两种范式（拉取和推送）对AI辅助写作的用户需求、质量、写作产品的所有权以及写作过程的效率和享受度的影响。我们还试图了解AI辅助写作的偏见影响。我们的研究结果表明，用户对人工智能在写作中的无缝辅助表示欢迎。此外，AI帮助用户更快地使写作中的想法多样化，同时保持清晰和简洁。用户还喜欢与AI辅助写作工具的协作，并没有感到缺乏所有权。最后，尽管参与者在我们的实验中没有体验到偏见。",
    "tldr": "本研究比较了拉取和推送两种AI辅助写作模式对用户需求、质量、所有权、效率和享受度的影响，并发现用户欢迎AI在写作中的无缝辅助，AI能够帮助用户更快地使写作中的想法多样化，同时保持清晰和简洁，并且用户喜欢与AI辅助写作工具的协作，没有感到缺乏所有权。尽管在实验中没有体验到偏见影响。"
}