{
    "title": "QuestEnvSim: Environment-Aware Simulated Motion Tracking from Sparse Sensors. (arXiv:2306.05666v1 [cs.GR])",
    "abstract": "Replicating a user's pose from only wearable sensors is important for many AR/VR applications. Most existing methods for motion tracking avoid environment interaction apart from foot-floor contact due to their complex dynamics and hard constraints. However, in daily life people regularly interact with their environment, e.g. by sitting on a couch or leaning on a desk. Using Reinforcement Learning, we show that headset and controller pose, if combined with physics simulation and environment observations can generate realistic full-body poses even in highly constrained environments. The physics simulation automatically enforces the various constraints necessary for realistic poses, instead of manually specifying them as in many kinematic approaches. These hard constraints allow us to achieve high-quality interaction motions without typical artifacts such as penetration or contact sliding. We discuss three features, the environment representation, the contact reward and scene randomizatio",
    "link": "http://arxiv.org/abs/2306.05666",
    "context": "Title: QuestEnvSim: Environment-Aware Simulated Motion Tracking from Sparse Sensors. (arXiv:2306.05666v1 [cs.GR])\nAbstract: Replicating a user's pose from only wearable sensors is important for many AR/VR applications. Most existing methods for motion tracking avoid environment interaction apart from foot-floor contact due to their complex dynamics and hard constraints. However, in daily life people regularly interact with their environment, e.g. by sitting on a couch or leaning on a desk. Using Reinforcement Learning, we show that headset and controller pose, if combined with physics simulation and environment observations can generate realistic full-body poses even in highly constrained environments. The physics simulation automatically enforces the various constraints necessary for realistic poses, instead of manually specifying them as in many kinematic approaches. These hard constraints allow us to achieve high-quality interaction motions without typical artifacts such as penetration or contact sliding. We discuss three features, the environment representation, the contact reward and scene randomizatio",
    "path": "papers/23/06/2306.05666.json",
    "total_tokens": 948,
    "translated_title": "QuestEnvSim：基于环境感知的稀疏传感器模拟运动追踪",
    "translated_abstract": "仅使用可穿戴传感器复制用户的姿势对于许多AR/VR应用程序非常重要。大多数现有的运动跟踪方法在环境交互方面都避免了除脚-地面接触外的其他因素，因为它们具有复杂的动态和硬约束。但是，在日常生活中，人们经常与环境进行交互，例如坐在沙发上或倚靠在桌子上。使用强化学习，我们展示了即使在高度约束的环境中，只要将头戴式显示器和控制器姿势与物理模拟和环境观察相结合，即可生成逼真的全身姿势。物理模拟自动实施逼真姿势所需的各种约束条件，而不像许多运动学方法中那样手动指定它们。这些硬约束条件使我们能够实现高质量的交互动作，而不会出现典型的穿透或接触滑动等问题。我们讨论了三个特性，环境表征，接触奖励和场景随机化，这些特性有助于我们的方法的成功，并展示了各种定性和定量结果。",
    "tldr": "本研究利用物理模拟和环境感知相结合的方法，在高度约束的环境中，能够生成逼真的全身姿势，实现了高质量的交互动作。",
    "en_tdlr": "This study proposes a method of combining physics simulation and environment awareness to generate realistic full-body poses and achieve high-quality interaction motions even in highly constrained environments."
}