{
    "title": "Phrase Retrieval for Open-Domain Conversational Question Answering with Conversational Dependency Modeling via Contrastive Learning. (arXiv:2306.04293v1 [cs.CL])",
    "abstract": "Open-Domain Conversational Question Answering (ODConvQA) aims at answering questions through a multi-turn conversation based on a retriever-reader pipeline, which retrieves passages and then predicts answers with them. However, such a pipeline approach not only makes the reader vulnerable to the errors propagated from the retriever, but also demands additional effort to develop both the retriever and the reader, which further makes it slower since they are not runnable in parallel. In this work, we propose a method to directly predict answers with a phrase retrieval scheme for a sequence of words, reducing the conventional two distinct subtasks into a single one. Also, for the first time, we study its capability for ODConvQA tasks. However, simply adopting it is largely problematic, due to the dependencies between previous and current turns in a conversation. To address this problem, we further introduce a novel contrastive learning strategy, making sure to reflect previous turns when ",
    "link": "http://arxiv.org/abs/2306.04293",
    "context": "Title: Phrase Retrieval for Open-Domain Conversational Question Answering with Conversational Dependency Modeling via Contrastive Learning. (arXiv:2306.04293v1 [cs.CL])\nAbstract: Open-Domain Conversational Question Answering (ODConvQA) aims at answering questions through a multi-turn conversation based on a retriever-reader pipeline, which retrieves passages and then predicts answers with them. However, such a pipeline approach not only makes the reader vulnerable to the errors propagated from the retriever, but also demands additional effort to develop both the retriever and the reader, which further makes it slower since they are not runnable in parallel. In this work, we propose a method to directly predict answers with a phrase retrieval scheme for a sequence of words, reducing the conventional two distinct subtasks into a single one. Also, for the first time, we study its capability for ODConvQA tasks. However, simply adopting it is largely problematic, due to the dependencies between previous and current turns in a conversation. To address this problem, we further introduce a novel contrastive learning strategy, making sure to reflect previous turns when ",
    "path": "papers/23/06/2306.04293.json",
    "total_tokens": 804,
    "tldr": "本文提出了一种使用短语检索的方法直接预测答案，以解决多轮对话问答中传统方法的漏洞和效率问题，同时引入了对话依赖建模和对比学习策略，提高了模型的鲁棒性和效果。",
    "translated_title": "通过对比学习进行会话依赖建模的开放领域会话问答的短语检索",
    "translated_abstract": "开放领域会话问答(ODConvQA)的目标是通过一个追溯-阅读器模型来回答问题，在准确性和效率上存在问题。本文提出了一种使用短语检索的方法直接预测答案，以解决这一问题并提高模型性能。同时，我们首次研究了其在ODConvQA任务中的适用性，并引入了对话依赖建模和对比学习策略，提高了模型的鲁棒性和效果。"
}