{
    "title": "ProtoGate: Prototype-based Neural Networks with Local Feature Selection for Tabular Biomedical Data. (arXiv:2306.12330v1 [cs.LG])",
    "abstract": "Tabular biomedical data poses challenges in machine learning because it is often high-dimensional and typically low-sample-size. Previous research has attempted to address these challenges via feature selection approaches, which can lead to unstable performance on real-world data. This suggests that current methods lack appropriate inductive biases that capture patterns common to different samples. In this paper, we propose ProtoGate, a prototype-based neural model that introduces an inductive bias by attending to both homogeneity and heterogeneity across samples. ProtoGate selects features in a global-to-local manner and leverages them to produce explainable predictions via an interpretable prototype-based model. We conduct comprehensive experiments to evaluate the performance of ProtoGate on synthetic and real-world datasets. Our results show that exploiting the homogeneous and heterogeneous patterns in the data can improve prediction accuracy while prototypes imbue interpretability.",
    "link": "http://arxiv.org/abs/2306.12330",
    "context": "Title: ProtoGate: Prototype-based Neural Networks with Local Feature Selection for Tabular Biomedical Data. (arXiv:2306.12330v1 [cs.LG])\nAbstract: Tabular biomedical data poses challenges in machine learning because it is often high-dimensional and typically low-sample-size. Previous research has attempted to address these challenges via feature selection approaches, which can lead to unstable performance on real-world data. This suggests that current methods lack appropriate inductive biases that capture patterns common to different samples. In this paper, we propose ProtoGate, a prototype-based neural model that introduces an inductive bias by attending to both homogeneity and heterogeneity across samples. ProtoGate selects features in a global-to-local manner and leverages them to produce explainable predictions via an interpretable prototype-based model. We conduct comprehensive experiments to evaluate the performance of ProtoGate on synthetic and real-world datasets. Our results show that exploiting the homogeneous and heterogeneous patterns in the data can improve prediction accuracy while prototypes imbue interpretability.",
    "path": "papers/23/06/2306.12330.json",
    "total_tokens": 950,
    "translated_title": "ProtoGate：面向表格型生物医学数据的原型神经网络与本地特征选择",
    "translated_abstract": "表格型生物医学数据在机器学习中面临挑战，因为它往往是高维的，但样本量又相对较小。先前的研究试图通过特征选择方法来应对这些挑战，但这种方法可能在真实数据上表现不稳定。这表明当前方法缺乏适当的归纳偏差，不能捕捉不同样本之间的共同模式。在本文中，我们提出ProtoGate，这是一种基于原型的神经模型，通过考虑样本内和样本间的同质性和异质性来引入归纳偏差。ProtoGate以全局到本地的方式选择特征，并利用它们来生产可解释的预测，而原型模型使预测具有可解释性。我们进行了全面的实验来评估ProtoGate在合成和真实世界数据集上的性能。我们的结果表明，利用数据中的同质性和异质性模式可以提高预测精度，同时原型赋予了预测可解释性。",
    "tldr": "本文提出了ProtoGate，一种基于原型的神经模型，该模型通过考虑样本内和样本间的同质性和异质性来引入归纳偏差，并以全局到本地的方式选择特征，从而提高预测精度并使预测具有可解释性。"
}