{
    "title": "Multi-Task Learning with Loop Specific Attention for CDR Structure Prediction. (arXiv:2306.13045v1 [cs.LG])",
    "abstract": "The Complementarity Determining Region (CDR) structure prediction of loops in antibody engineering has gained a lot of attraction by researchers. When designing antibodies, a main challenge is to predict the CDR structure of the H3 loop. Compared with the other CDR loops, that is the H1 and H2 loops, the CDR structure of the H3 loop is more challenging due to its varying length and flexible structure. In this paper, we propose a Multi-task learning model with Loop Specific Attention, namely MLSA. In particular, to the best of our knowledge we are the first to jointly learn the three CDR loops, via a novel multi-task learning strategy. In addition, to account for the structural and functional similarities and differences of the three CDR loops, we propose a loop specific attention mechanism to control the influence of each CDR loop on the training of MLSA. Our experimental evaluation on widely used benchmark data shows that the proposed MLSA method significantly reduces the prediction e",
    "link": "http://arxiv.org/abs/2306.13045",
    "context": "Title: Multi-Task Learning with Loop Specific Attention for CDR Structure Prediction. (arXiv:2306.13045v1 [cs.LG])\nAbstract: The Complementarity Determining Region (CDR) structure prediction of loops in antibody engineering has gained a lot of attraction by researchers. When designing antibodies, a main challenge is to predict the CDR structure of the H3 loop. Compared with the other CDR loops, that is the H1 and H2 loops, the CDR structure of the H3 loop is more challenging due to its varying length and flexible structure. In this paper, we propose a Multi-task learning model with Loop Specific Attention, namely MLSA. In particular, to the best of our knowledge we are the first to jointly learn the three CDR loops, via a novel multi-task learning strategy. In addition, to account for the structural and functional similarities and differences of the three CDR loops, we propose a loop specific attention mechanism to control the influence of each CDR loop on the training of MLSA. Our experimental evaluation on widely used benchmark data shows that the proposed MLSA method significantly reduces the prediction e",
    "path": "papers/23/06/2306.13045.json",
    "total_tokens": 946,
    "translated_title": "带有圈特定注意机制的多任务学习用于CDR结构预测",
    "translated_abstract": "抗体工程中的互补决定区（CDR）结构预测已经引起了研究者的极大关注。在设计抗体时，主要的挑战是预测H3环的CDR结构，与其他CDR环（H1和H2 环）相比，H3环的CDR结构由于长度和灵活的结构而更具挑战性。本文提出了一种带有圈特定注意力的多任务学习模型，即MLSA。我们是首位通过新颖的多任务学习策略共同学习三个CDR环。此外，为了考虑三个CDR环的结构和功能上的相似性和差异性，我们提出了一个圈特定的注意机制来控制MLSA模型训练中每个CDR环的影响。我们在广泛使用的基准数据集上进行了实验评估，结果显示，所提出的MLSA方法显著降低了预测误差。",
    "tldr": "本文提出了带有圈特定注意机制的多任务学习模型（MLSA），用于共同学习三个CDR环的结构预测，其中H3环的CDR结构由于长度和灵活的结构具有更大挑战性。在实验评估中，该方法显著降低了预测误差。",
    "en_tdlr": "This paper proposes a multi-task learning model with loop specific attention (MLSA) for jointly learning the structure prediction of the three CDR loops, with a particular focus on the more challenging H3 loop due to its varying length and flexible structure. The MLSA method significantly reduces prediction error according to experimental evaluation on widely used benchmark data."
}