{
    "title": "On Computational Mechanisms for Shared Intentionality, and Speculation on Rationality and Consciousness. (arXiv:2306.13657v1 [cs.AI])",
    "abstract": "A singular attribute of humankind is our ability to undertake novel, cooperative behavior, or teamwork. This requires that we can communicate goals, plans, and ideas between the brains of individuals to create shared intentionality. Using the information processing model of David Marr, I derive necessary characteristics of basic mechanisms to enable shared intentionality between computational agents and indicate how these could be implemented in present-day AI-based robots.  More speculatively, I suggest the mechanisms derived by this thought experiment apply to humans and extend to provide explanations for human rationality and aspects of intentional and phenomenal consciousness that accord with observation. This yields what I call the Shared Intentionality First Theory (SIFT) for rationality and consciousness.",
    "link": "http://arxiv.org/abs/2306.13657",
    "context": "Title: On Computational Mechanisms for Shared Intentionality, and Speculation on Rationality and Consciousness. (arXiv:2306.13657v1 [cs.AI])\nAbstract: A singular attribute of humankind is our ability to undertake novel, cooperative behavior, or teamwork. This requires that we can communicate goals, plans, and ideas between the brains of individuals to create shared intentionality. Using the information processing model of David Marr, I derive necessary characteristics of basic mechanisms to enable shared intentionality between computational agents and indicate how these could be implemented in present-day AI-based robots.  More speculatively, I suggest the mechanisms derived by this thought experiment apply to humans and extend to provide explanations for human rationality and aspects of intentional and phenomenal consciousness that accord with observation. This yields what I call the Shared Intentionality First Theory (SIFT) for rationality and consciousness.",
    "path": "papers/23/06/2306.13657.json",
    "total_tokens": 812,
    "translated_title": "论共享意图的计算机制以及有关理性和意识的推测",
    "translated_abstract": "人类独特的特征之一是我们能够进行新颖的、合作的行为或团队合作。这需要我们能够在个体之间传达目标、计划和思想，以创建共享意图。本文利用David Marr的信息处理模型，推导出支持计算机代理人之间共享意图的基本机制所必须具备的特征，并指出这些特征如何在现有的基于人工智能的机器人中实现。此外，本文提出这个思维实验所得到的机制也适用于人类，并进一步提供了与观察相符的关于人类理性、意向和感知意识的解释。这样就形成了作者所称的共享意图优先理论（SIFT）。",
    "tldr": "本文提出了一种共享意图优先的理论，探讨了支持计算机代理人之间共享意图的基本机制所必须具备的特征，并探索了这些机制如何适用于人类以提供对人类理性和意识的解释。",
    "en_tdlr": "This paper proposes a Shared Intentionality First Theory (SIFT) for rationality and consciousness, which explores the necessary characteristics of basic mechanisms to enable shared intentionality between computational agents, and speculates how these mechanisms can be applied to humans to provide explanations for human rationality and aspects of intentional and phenomenal consciousness that accord with observation."
}