{
    "title": "Audio Embeddings as Teachers for Music Classification. (arXiv:2306.17424v1 [cs.SD])",
    "abstract": "Music classification has been one of the most popular tasks in the field of music information retrieval. With the development of deep learning models, the last decade has seen impressive improvements in a wide range of classification tasks. However, the increasing model complexity makes both training and inference computationally expensive. In this paper, we integrate the ideas of transfer learning and feature-based knowledge distillation and systematically investigate using pre-trained audio embeddings as teachers to guide the training of low-complexity student networks. By regularizing the feature space of the student networks with the pre-trained embeddings, the knowledge in the teacher embeddings can be transferred to the students. We use various pre-trained audio embeddings and test the effectiveness of the method on the tasks of musical instrument classification and music auto-tagging. Results show that our method significantly improves the results in comparison to the identical ",
    "link": "http://arxiv.org/abs/2306.17424",
    "context": "Title: Audio Embeddings as Teachers for Music Classification. (arXiv:2306.17424v1 [cs.SD])\nAbstract: Music classification has been one of the most popular tasks in the field of music information retrieval. With the development of deep learning models, the last decade has seen impressive improvements in a wide range of classification tasks. However, the increasing model complexity makes both training and inference computationally expensive. In this paper, we integrate the ideas of transfer learning and feature-based knowledge distillation and systematically investigate using pre-trained audio embeddings as teachers to guide the training of low-complexity student networks. By regularizing the feature space of the student networks with the pre-trained embeddings, the knowledge in the teacher embeddings can be transferred to the students. We use various pre-trained audio embeddings and test the effectiveness of the method on the tasks of musical instrument classification and music auto-tagging. Results show that our method significantly improves the results in comparison to the identical ",
    "path": "papers/23/06/2306.17424.json",
    "total_tokens": 855,
    "translated_title": "音频嵌入作为音乐分类的教师",
    "translated_abstract": "音乐分类一直是音乐信息检索领域中最受欢迎的任务之一。随着深度学习模型的发展，过去十年在各种分类任务中取得了令人瞩目的进展。然而，不断增加的模型复杂性使得训练和推断的计算成本变得昂贵。在本文中，我们将迁移学习和基于特征的知识蒸馏的思想相结合，并系统地研究使用预训练的音频嵌入作为教师来指导低复杂度的学生网络的训练。通过用预训练的嵌入方式规范化学生网络的特征空间，教师嵌入中的知识可以传递给学生。我们使用各种预训练的音频嵌入，并在音乐乐器分类和音乐自动标记任务上测试了该方法的有效性。结果表明，与同一方法相比，我们的方法显著提高了结果.",
    "tldr": "本文提出了一种使用预训练的音频嵌入作为教师来引导低复杂度学生网络的方法，并在音乐乐器分类和音乐自动标记任务上取得了显著的改进.",
    "en_tdlr": "This paper proposes a method of using pre-trained audio embeddings as teachers to guide low-complexity student networks, and achieves significant improvements in musical instrument classification and music auto-tagging tasks."
}