{
    "title": "An efficient and straightforward online quantization method for a data stream through remove-birth updating. (arXiv:2306.12574v1 [cs.LG])",
    "abstract": "The growth of network-connected devices is creating an explosion of data, known as big data, and posing significant challenges to efficient data analysis. This data is generated continuously, creating a dynamic flow known as a data stream. The characteristics of a data stream may change dynamically, and this change is known as concept drift. Consequently, a method for handling data streams must efficiently reduce their volume while dynamically adapting to these changing characteristics. This paper proposes a simple online vector quantization method for concept drift. The proposed method identifies and replaces units with low win probability through remove-birth updating, thus achieving a rapid adaptation to concept drift. Furthermore, the results of this study show that the proposed method can generate minimal dead units even in the presence of concept drift. This study also suggests that some metrics calculated from the proposed method will be helpful for drift detection.",
    "link": "http://arxiv.org/abs/2306.12574",
    "context": "Title: An efficient and straightforward online quantization method for a data stream through remove-birth updating. (arXiv:2306.12574v1 [cs.LG])\nAbstract: The growth of network-connected devices is creating an explosion of data, known as big data, and posing significant challenges to efficient data analysis. This data is generated continuously, creating a dynamic flow known as a data stream. The characteristics of a data stream may change dynamically, and this change is known as concept drift. Consequently, a method for handling data streams must efficiently reduce their volume while dynamically adapting to these changing characteristics. This paper proposes a simple online vector quantization method for concept drift. The proposed method identifies and replaces units with low win probability through remove-birth updating, thus achieving a rapid adaptation to concept drift. Furthermore, the results of this study show that the proposed method can generate minimal dead units even in the presence of concept drift. This study also suggests that some metrics calculated from the proposed method will be helpful for drift detection.",
    "path": "papers/23/06/2306.12574.json",
    "total_tokens": 851,
    "translated_title": "一种通过移除生胎更新流数据在线量化的高效简单方法",
    "translated_abstract": "网络设备的增长正在创造出大量数据，即所谓的大数据，并对有效数据分析提出了重要挑战。这些数据不断地产生，形成了动态流数据。流数据的特征可能会动态变化，这种变化被称为概念漂移。因此，处理流数据的方法必须在动态适应这些变化的同时，高效地缩减它们的体积。本文提出了一种简单的概念漂移在线向量量化方法。该方法通过移除生胎更新识别并替换概率低的单元，从而快速适应概念漂移。此外，研究结果表明，即使在概念漂移的情况下，该方法也可以产生最小化的死单元。本研究还表明一些通过所提出方法计算出来的度量指标对于漂移检测将是有益的。",
    "tldr": "本文提出了一种在线量化数据流的方法，通过移除生胎更新快速适应概念漂移，可以产生最小化的死单元，并为漂移检测提供了一些有用的度量指标。",
    "en_tdlr": "This paper proposes a simple online vector quantization method for data streams that efficiently reduces their volume and adapts to changing characteristics through remove-birth updating, generating minimal dead units even in the presence of concept drift, and provides some useful metrics for drift detection."
}