{
    "title": "Proximal Symmetric Non-negative Latent Factor Analysis: A Novel Approach to Highly-Accurate Representation of Undirected Weighted Networks. (arXiv:2306.03647v1 [cs.LG])",
    "abstract": "An Undirected Weighted Network (UWN) is commonly found in big data-related applications. Note that such a network's information connected with its nodes, and edges can be expressed as a Symmetric, High-Dimensional and Incomplete (SHDI) matrix. However, existing models fail in either modeling its intrinsic symmetry or low-data density, resulting in low model scalability or representation learning ability. For addressing this issue, a Proximal Symmetric Nonnegative Latent-factor-analysis (PSNL) model is proposed. It incorporates a proximal term into symmetry-aware and data density-oriented objective function for high representation accuracy. Then an adaptive Alternating Direction Method of Multipliers (ADMM)-based learning scheme is implemented through a Tree-structured of Parzen Estimators (TPE) method for high computational efficiency. Empirical studies on four UWNs demonstrate that PSNL achieves higher accuracy gain than state-of-the-art models, as well as highly competitive computati",
    "link": "http://arxiv.org/abs/2306.03647",
    "context": "Title: Proximal Symmetric Non-negative Latent Factor Analysis: A Novel Approach to Highly-Accurate Representation of Undirected Weighted Networks. (arXiv:2306.03647v1 [cs.LG])\nAbstract: An Undirected Weighted Network (UWN) is commonly found in big data-related applications. Note that such a network's information connected with its nodes, and edges can be expressed as a Symmetric, High-Dimensional and Incomplete (SHDI) matrix. However, existing models fail in either modeling its intrinsic symmetry or low-data density, resulting in low model scalability or representation learning ability. For addressing this issue, a Proximal Symmetric Nonnegative Latent-factor-analysis (PSNL) model is proposed. It incorporates a proximal term into symmetry-aware and data density-oriented objective function for high representation accuracy. Then an adaptive Alternating Direction Method of Multipliers (ADMM)-based learning scheme is implemented through a Tree-structured of Parzen Estimators (TPE) method for high computational efficiency. Empirical studies on four UWNs demonstrate that PSNL achieves higher accuracy gain than state-of-the-art models, as well as highly competitive computati",
    "path": "papers/23/06/2306.03647.json",
    "total_tokens": 1017,
    "translated_title": "近端对称非负潜在因子分析:一种高精度表征无定向加权网络的新方法",
    "translated_abstract": "无定向加权网络 (UWN) 在大数据相关应用中很常见。注意到这样一个网络与其节点和边连接的信息可以表示为一个对称的、高维的且不完整的( SHDI)矩阵。然而，现有模型在建模其固有对称性或低数据密度方面均存在问题，导致低模型可扩展性或表征学习能力。为了解决这个问题，提出了一种近端对称的非负潜在因子分析 (PSNL)模型。它将一个接近项纳入考虑对称性和数据密度的目标函数中，以提高表征精度。然后，通过树状的 Parzen 估计器 (TPE)方法实现了自适应交替方向乘子算法 (ADMM)的学习方案，以获得高计算效率。对四个 UWNs 进行的实证研究表明，PSNL 模型实现了比现有最先进模型更高的精度收益，以及高度竞争力的计算复杂性。",
    "tldr": "本文提出了一种Proximal Symmetric Non-negative Latent Factor Analysis (PSNL)模型，用于处理无定向加权网络的信息表征问题，该模型在考虑到对称性和数据密度的同时，还具有高计算效率和表征精度。"
}