{
    "title": "DynamoRep: Trajectory-Based Population Dynamics for Classification of Black-box Optimization Problems. (arXiv:2306.05438v1 [cs.LG])",
    "abstract": "The application of machine learning (ML) models to the analysis of optimization algorithms requires the representation of optimization problems using numerical features. These features can be used as input for ML models that are trained to select or to configure a suitable algorithm for the problem at hand. Since in pure black-box optimization information about the problem instance can only be obtained through function evaluation, a common approach is to dedicate some function evaluations for feature extraction, e.g., using random sampling. This approach has two key downsides: (1) It reduces the budget left for the actual optimization phase, and (2) it neglects valuable information that could be obtained from a problem-solver interaction.  In this paper, we propose a feature extraction method that describes the trajectories of optimization algorithms using simple descriptive statistics. We evaluate the generated features for the task of classifying problem classes from the Black Box Op",
    "link": "http://arxiv.org/abs/2306.05438",
    "context": "Title: DynamoRep: Trajectory-Based Population Dynamics for Classification of Black-box Optimization Problems. (arXiv:2306.05438v1 [cs.LG])\nAbstract: The application of machine learning (ML) models to the analysis of optimization algorithms requires the representation of optimization problems using numerical features. These features can be used as input for ML models that are trained to select or to configure a suitable algorithm for the problem at hand. Since in pure black-box optimization information about the problem instance can only be obtained through function evaluation, a common approach is to dedicate some function evaluations for feature extraction, e.g., using random sampling. This approach has two key downsides: (1) It reduces the budget left for the actual optimization phase, and (2) it neglects valuable information that could be obtained from a problem-solver interaction.  In this paper, we propose a feature extraction method that describes the trajectories of optimization algorithms using simple descriptive statistics. We evaluate the generated features for the task of classifying problem classes from the Black Box Op",
    "path": "papers/23/06/2306.05438.json",
    "total_tokens": 926,
    "translated_title": "DynamoRep: 基于轨迹的人群学习动力学用于黑盒优化问题的分类",
    "translated_abstract": "将机器学习模型应用于优化算法的分析需要使用数值特征来表示优化问题，这些特征可用作机器学习模型的输入，该模型被训练用于选择或配置适合的算法来解决特定问题。在纯黑盒优化中，有关问题实例的信息只能通过函数评估获取，一种常见的方法是专门用于特征提取的功能评估，例如使用随机抽样。这种方法有两个关键缺点：（1）它减少了实际优化阶段的预算，（2）它忽略了可以从问题求解器交互中获得的有价值的信息。本文提出了一种使用简单描述统计描述优化算法轨迹的特征提取方法。我们评估了生成的特征用于从Black Box Optimization Benchmarking（BBOB）套件中分类问题类的任务。我们的结果表明，所提出的方法在需要明显较少的功能评估进行特征提取的同时，具有与最先进方法相竞争的水平。",
    "tldr": "本文提出了一种基于轨迹的人群学习动力学的特征提取方法，用于分类黑盒优化问题，能够在少量函数评估下实现与最先进方法相竞争的效果。",
    "en_tdlr": "The paper proposes a trajectory-based population dynamics feature extraction method using simple descriptive statistics for optimization problems. The method is competitive with state-of-the-art methods while requiring significantly fewer function evaluations for feature extraction."
}