{
    "title": "Big-data-driven and AI-based framework to enable personalization in wireless networks. (arXiv:2306.04887v1 [cs.AI])",
    "abstract": "Current communication networks use design methodologies that prevent the realization of maximum network efficiency. In the first place, while users' perception of satisfactory service diverges widely, current networks are designed to be a \"universal fit,\" where they are generally over-engineered to deliver services appealing to all types of users. Also, current networks lack user-level data cognitive intelligence that would enable fast personalized network decisions and actions through automation. Thus, in this article, we propose the utilization of AI, big data analytics, and real-time non-intrusive user feedback in order to enable the personalization of wireless networks. Based on each user's actual QoS requirements and context, a multi-objective formulation enables the network to micro-manage and optimize the provided QoS and user satisfaction levels simultaneously. Moreover, in order to enable user feedback tracking and measurement, we propose a user satisfaction model based on the",
    "link": "http://arxiv.org/abs/2306.04887",
    "context": "Title: Big-data-driven and AI-based framework to enable personalization in wireless networks. (arXiv:2306.04887v1 [cs.AI])\nAbstract: Current communication networks use design methodologies that prevent the realization of maximum network efficiency. In the first place, while users' perception of satisfactory service diverges widely, current networks are designed to be a \"universal fit,\" where they are generally over-engineered to deliver services appealing to all types of users. Also, current networks lack user-level data cognitive intelligence that would enable fast personalized network decisions and actions through automation. Thus, in this article, we propose the utilization of AI, big data analytics, and real-time non-intrusive user feedback in order to enable the personalization of wireless networks. Based on each user's actual QoS requirements and context, a multi-objective formulation enables the network to micro-manage and optimize the provided QoS and user satisfaction levels simultaneously. Moreover, in order to enable user feedback tracking and measurement, we propose a user satisfaction model based on the",
    "path": "papers/23/06/2306.04887.json",
    "total_tokens": 818,
    "translated_title": "基于大数据和人工智能的框架实现无线网络个性化服务",
    "translated_abstract": "当前的通信网络使用的设计方法导致网络效率无法最大化。现有网络普遍被设计成“通用套装”，无法满足不同用户对网络服务的不同需求。同时，当前的网络缺乏用户级别的数据认知智能，无法通过自动化实现快速的个性化网络决策和操作。因此，在本文中，我们提出利用人工智能、大数据分析和实时非侵入式用户反馈来实现无线网络的个性化服务。基于每个用户的实际服务质量要求和环境，我们提出了一种多目标优化模型，同时优化提供的服务质量和用户满意度水平。此外，为了实现用户反馈的跟踪和衡量，我们提出了一种基于用户满意度模型的方法。",
    "tldr": "本论文提出了一种基于大数据和人工智能的框架，通过利用实时用户反馈和多目标优化模型来实现无线网络的个性化服务，优化服务质量和用户满意度。"
}