{
    "title": "Mind the Cap! -- Constrained Portfolio Optimisation in Heston's Stochastic Volatility Model. (arXiv:2306.11158v1 [q-fin.PM])",
    "abstract": "We consider a portfolio optimisation problem for a utility-maximising investor who faces convex constraints on his portfolio allocation in Heston's stochastic volatility model. We apply the duality methods developed in previous work to obtain a closed-form expression for the optimal portfolio allocation. In doing so, we observe that allocation constraints impact the optimal constrained portfolio allocation in a fundamentally different way in Heston's stochastic volatility model than in the Black Scholes model. In particular, the optimal constrained portfolio may be different from the naive capped portfolio, which caps off the optimal unconstrained portfolio at the boundaries of the constraints. Despite this difference, we illustrate by way of a numerical analysis that in most realistic scenarios the capped portfolio leads to slim annual wealth equivalent losses compared to the optimal constrained portfolio. During a financial crisis, however, a capped solution might lead to compelling ",
    "link": "http://arxiv.org/abs/2306.11158",
    "context": "Title: Mind the Cap! -- Constrained Portfolio Optimisation in Heston's Stochastic Volatility Model. (arXiv:2306.11158v1 [q-fin.PM])\nAbstract: We consider a portfolio optimisation problem for a utility-maximising investor who faces convex constraints on his portfolio allocation in Heston's stochastic volatility model. We apply the duality methods developed in previous work to obtain a closed-form expression for the optimal portfolio allocation. In doing so, we observe that allocation constraints impact the optimal constrained portfolio allocation in a fundamentally different way in Heston's stochastic volatility model than in the Black Scholes model. In particular, the optimal constrained portfolio may be different from the naive capped portfolio, which caps off the optimal unconstrained portfolio at the boundaries of the constraints. Despite this difference, we illustrate by way of a numerical analysis that in most realistic scenarios the capped portfolio leads to slim annual wealth equivalent losses compared to the optimal constrained portfolio. During a financial crisis, however, a capped solution might lead to compelling ",
    "path": "papers/23/06/2306.11158.json",
    "total_tokens": 954,
    "translated_title": "“Mind the Cap!”——Heston随机波动率模型下的约束组合优化问题",
    "translated_abstract": "本研究考虑一个效用最大化的投资者在Heston随机波动率模型下面对投资组合分配的凸约束的优化问题。我们运用先前开发的对偶性方法求得最优投资组合的闭式表达式，并观察到在Heston随机波动率模型中，分配约束对最优约束投资组合的影响与在Black-Scholes模型下的影响根本不同。尽管存在这种差异，但我们通过数值分析表明，在大多数现实情况下，与最优约束投资组合相比，带限制的组合方案会导致相对较小的年度财富损失。然而，在金融危机期间，限制方案可能会导致令人信服的结论。",
    "tldr": "本研究考虑了Heston随机波动率模型中的约束组合优化问题，应用对偶性方法求得最优投资组合的闭式表达式，并发现在这种模型中，分配约束与在Black-Scholes模型下的影响根本不同。在大多数现实情况下，带限制的组合方案会导致相对较小的年度财富损失，但在金融危机期间，限制方案可能会导致令人信服的结论。",
    "en_tdlr": "This paper investigates the constrained portfolio optimization problem in Heston's stochastic volatility model and obtains closed-form expression for the optimal portfolio allocation using duality methods. The study finds that allocation constraints impact the optimal constrained portfolio differently in Heston's model than in Black-Scholes model, and that the capped portfolio leads to relatively smaller annual wealth equivalent losses compared to the optimal constrained portfolio in most realistic scenarios, but may not be optimal during financial crises."
}