{
    "title": "Graph Sparsification for GCN Towards Optimal Crop Yield Predictions. (arXiv:2306.01725v1 [cs.LG])",
    "abstract": "In agronomics, predicting crop yield at a per field/county granularity is important for farmers to minimize uncertainty and plan seeding for the next crop cycle. While state-of-the-art prediction techniques employ graph convolutional nets (GCN) to predict future crop yields given relevant features and crop yields of previous years, a dense underlying graph kernel requires long training and execution time. In this paper, we propose a graph sparsification method based on the Fiedler number to remove edges from a complete graph kernel, in order to lower the complexity of GCN training/execution. Specifically, we first show that greedily removing an edge at a time that induces the minimal change in the second eigenvalue leads to a sparse graph with good GCN performance. We then propose a fast method to choose an edge for removal per iteration based on an eigenvalue perturbation theorem. Experiments show that our Fiedler-based method produces a sparse graph with good GCN performance compared",
    "link": "http://arxiv.org/abs/2306.01725",
    "context": "Title: Graph Sparsification for GCN Towards Optimal Crop Yield Predictions. (arXiv:2306.01725v1 [cs.LG])\nAbstract: In agronomics, predicting crop yield at a per field/county granularity is important for farmers to minimize uncertainty and plan seeding for the next crop cycle. While state-of-the-art prediction techniques employ graph convolutional nets (GCN) to predict future crop yields given relevant features and crop yields of previous years, a dense underlying graph kernel requires long training and execution time. In this paper, we propose a graph sparsification method based on the Fiedler number to remove edges from a complete graph kernel, in order to lower the complexity of GCN training/execution. Specifically, we first show that greedily removing an edge at a time that induces the minimal change in the second eigenvalue leads to a sparse graph with good GCN performance. We then propose a fast method to choose an edge for removal per iteration based on an eigenvalue perturbation theorem. Experiments show that our Fiedler-based method produces a sparse graph with good GCN performance compared",
    "path": "papers/23/06/2306.01725.json",
    "total_tokens": 768,
    "translated_title": "基于图稀疏化的GCN算法用于最优农作物收成预测",
    "translated_abstract": "在农学领域，预测每个田地/县的作物产量对于农民来说非常重要，以减少不确定性并为下一轮作物种植计划作出安排。本文提出了一种基于Fiedler数的图稀疏化方法，旨在从完整的图核中删除边缘，以降低GCN训练和执行的复杂度。实验表明，我们的基于Fiedler的方法能产生具有良好GCN性能的稀疏图。",
    "tldr": "本文提出了一种基于Fiedler数的图稀疏化方法，可以从完整的图核中删除边缘，以降低GCN训练和执行的复杂度，并显著提高农业产量预测的可行性。",
    "en_tdlr": "This paper proposes a graph sparsification method based on the Fiedler number to remove edges from a complete graph kernel, in order to lower the complexity of GCN training/execution and improve the feasibility of crop yield predictions for agriculture."
}