{
    "title": "Exact solution to a generalised Lillo-Mike-Farmer model with heterogeneous order-splitting strategies. (arXiv:2306.13378v1 [q-fin.TR])",
    "abstract": "The Lillo-Mike-Farmer (LMF) model is an established econophysics model describing the order-splitting behaviour of institutional investors in financial markets. In the original article (LMF, Physical Review E 71, 066122 (2005)), LMF assumed the homogeneity of the traders' order-splitting strategy and derived a power-law asymptotic solution to the order-sign autocorrelation function (ACF) based on several heuristic reasonings. This report proposes a generalised LMF model by incorporating the heterogeneity of traders' order-splitting behaviour that is exactly solved without heuristics. We find that the power-law exponent in the order-sign ACF is robust for arbitrary heterogeneous intensity distributions. On the other hand, the prefactor in the ACF is very sensitive to heterogeneity in trading strategies and is shown to be systematically underestimated in the original homogeneous LMF model. Our work highlights that the ACF prefactor should be more carefully interpreted than the ACF power-",
    "link": "http://arxiv.org/abs/2306.13378",
    "context": "Title: Exact solution to a generalised Lillo-Mike-Farmer model with heterogeneous order-splitting strategies. (arXiv:2306.13378v1 [q-fin.TR])\nAbstract: The Lillo-Mike-Farmer (LMF) model is an established econophysics model describing the order-splitting behaviour of institutional investors in financial markets. In the original article (LMF, Physical Review E 71, 066122 (2005)), LMF assumed the homogeneity of the traders' order-splitting strategy and derived a power-law asymptotic solution to the order-sign autocorrelation function (ACF) based on several heuristic reasonings. This report proposes a generalised LMF model by incorporating the heterogeneity of traders' order-splitting behaviour that is exactly solved without heuristics. We find that the power-law exponent in the order-sign ACF is robust for arbitrary heterogeneous intensity distributions. On the other hand, the prefactor in the ACF is very sensitive to heterogeneity in trading strategies and is shown to be systematically underestimated in the original homogeneous LMF model. Our work highlights that the ACF prefactor should be more carefully interpreted than the ACF power-",
    "path": "papers/23/06/2306.13378.json",
    "total_tokens": 974,
    "translated_title": "具有异质性订单拆分策略的一般化 Lillo-Mike-Farmer 模型的精确解",
    "translated_abstract": "Lillo-Mike-Farmer（LMF）模型是一个与经济物理学相关的模型，描述机构投资者在金融市场中的订单拆分行为。LMF 假设交易者的订单拆分策略是同质的，并基于几种启发式推理导出了订单符号自相关函数（ACF）的幂律渐近解。本文提出了一种广义 LMF 模型，通过将交易者的订单拆分行为异质化，对该模型进行了精确求解且无需引入启发式方法。我们发现，订单符号ACF中的幂律指数对于任意异质的强度分布是稳健的。另一方面，ACF中的前置因子对交易策略的异质性非常敏感，并且在原始同质 LMF 模型中被系统地低估。我们的工作强调，在解释ACF前置因子方面需要更加小心谨慎。",
    "tldr": "本研究提出了一种广义 LMF 模型，考虑到了交易者的订单拆分行为的异质性，对该模型进行了精确求解，发现订单符号 ACF 中幂律指数稳健，但前置因子对交易策略异质性极为敏感并在同质 LMF 模型中被低估。",
    "en_tdlr": "This study proposes a generalized LMF model by considering the heterogeneity of traders' order-splitting behavior, and precisely solves it without heuristic methods. The power-law exponent in the order-sign ACF is robust for arbitrary heterogeneous intensity distributions, while the prefactor is very sensitive to heterogeneity in trading strategies and is systematically underestimated in the original homogeneous LMF model."
}