{
    "title": "Candidate Incentive Distributions: How voting methods shape electoral incentives. (arXiv:2306.07147v1 [econ.GN])",
    "abstract": "We evaluate the tendency for different voting methods to promote political compromise and reduce tensions in a society by using computer simulations to determine which voters candidates are incentivized to appeal to. We find that Instant Runoff Voting incentivizes candidates to appeal to a wider range of voters than single-winner Plurality Voting, but that it still leaves candidates far more strongly incentivized to appeal to their base than to voters in opposing factions. In contrast, we find that other voting methods, including STAR (Score Then Automatic Runoff) Voting and Condorcet methods, incentivize candidates to appeal to currently-opposed voters as much to their base, and that these differences between voting methods become more pronounced the more candidates are in the race.",
    "link": "http://arxiv.org/abs/2306.07147",
    "context": "Title: Candidate Incentive Distributions: How voting methods shape electoral incentives. (arXiv:2306.07147v1 [econ.GN])\nAbstract: We evaluate the tendency for different voting methods to promote political compromise and reduce tensions in a society by using computer simulations to determine which voters candidates are incentivized to appeal to. We find that Instant Runoff Voting incentivizes candidates to appeal to a wider range of voters than single-winner Plurality Voting, but that it still leaves candidates far more strongly incentivized to appeal to their base than to voters in opposing factions. In contrast, we find that other voting methods, including STAR (Score Then Automatic Runoff) Voting and Condorcet methods, incentivize candidates to appeal to currently-opposed voters as much to their base, and that these differences between voting methods become more pronounced the more candidates are in the race.",
    "path": "papers/23/06/2306.07147.json",
    "total_tokens": 815,
    "translated_title": "候选人激励分配：选举方式如何塑造选举激励",
    "translated_abstract": "本文使用计算机模拟来确定各种投票方式促进政治妥协和减少社会紧张的倾向，发现即时选举投票（Instant Runoff Voting）激励候选人吸引更广泛的选民支持，但仍远不如单赢家多数投票（single-winner Plurality Voting）鼓励候选人吸引其基本选民而不是来自反对阵营的选民。相反，我们发现包括STAR（评分自动进入次轮投票）投票和孔多塞投票在内的其他投票方法，激励候选人向对立的选民和自己的基础选民一样吸引支持，而这些投票方法之间的差异随着竞选人数的增加而变得更加明显。",
    "tldr": "本文使用计算机模拟来比较各种投票方式促进政治妥协和减少社会紧张的效果，发现STAR投票和孔多塞投票激励候选人向对立的选民和自己的基础选民一样吸引支持。",
    "en_tdlr": "This paper evaluates the effects of different voting methods on promoting political compromise and reducing tension in society, and finds that STAR Voting and Condorcet methods incentivize candidates to appeal to opposing voters as much as to their base."
}