{
    "title": "A Model-free Closeness-of-influence Test for Features in Supervised Learning. (arXiv:2306.11855v1 [cs.LG])",
    "abstract": "Understanding the effect of a feature vector $x \\in \\mathbb{R}^d$ on the response value (label) $y \\in \\mathbb{R}$ is the cornerstone of many statistical learning problems. Ideally, it is desired to understand how a set of collected features combine together and influence the response value, but this problem is notoriously difficult, due to the high-dimensionality of data and limited number of labeled data points, among many others. In this work, we take a new perspective on this problem, and we study the question of assessing the difference of influence that the two given features have on the response value. We first propose a notion of closeness for the influence of features, and show that our definition recovers the familiar notion of the magnitude of coefficients in the parametric model. We then propose a novel method to test for the closeness of influence in general model-free supervised learning problems. Our proposed test can be used with finite number of samples with control on",
    "link": "http://arxiv.org/abs/2306.11855",
    "context": "Title: A Model-free Closeness-of-influence Test for Features in Supervised Learning. (arXiv:2306.11855v1 [cs.LG])\nAbstract: Understanding the effect of a feature vector $x \\in \\mathbb{R}^d$ on the response value (label) $y \\in \\mathbb{R}$ is the cornerstone of many statistical learning problems. Ideally, it is desired to understand how a set of collected features combine together and influence the response value, but this problem is notoriously difficult, due to the high-dimensionality of data and limited number of labeled data points, among many others. In this work, we take a new perspective on this problem, and we study the question of assessing the difference of influence that the two given features have on the response value. We first propose a notion of closeness for the influence of features, and show that our definition recovers the familiar notion of the magnitude of coefficients in the parametric model. We then propose a novel method to test for the closeness of influence in general model-free supervised learning problems. Our proposed test can be used with finite number of samples with control on",
    "path": "papers/23/06/2306.11855.json",
    "total_tokens": 793,
    "translated_title": "一种无模型检验监督学习中特征影响的方法",
    "translated_abstract": "理解特征向量$x \\in \\mathbb{R}^d$对响应值（标签）$y \\in \\mathbb{R}$的影响是许多统计学习问题的基石。本文提出了一种新的视角来研究如何评估两个给定特征在响应值上具有不同影响力的问题。首先提出了特征影响力的紧密度概念，并证明了它能够恢复参数模型中系数的幅度的熟悉概念。然后，提出了一种新的方法来测试监督学习中的特征影响紧密度。我们的测试方法可以用于有限数量的样本，并且可以控制假阳性率。",
    "tldr": "本文提出了一种无模型方法，评估响应值上两个特征的影响力，并提供一种新的测试方法。",
    "en_tdlr": "This paper proposes a model-free method to evaluate the impact of two given features on the response value, and introduces a novel testing approach for feature influence in general supervised learning problems with a finite number of samples."
}