{
    "title": "Decomposition and Interleaving for Variance Reduction of Post-click Metrics. (arXiv:2306.10024v1 [cs.IR])",
    "abstract": "In this study, we propose an efficient method for comparing the post-click metric (e.g., dwell time and conversion rate) of multiple rankings in online experiments. The proposed method involves (1) the decomposition of the post-click metric measurement of a ranking into a click model estimation and a post-click metric measurement of each item in the ranking, and (2) interleaving of multiple rankings to produce a single ranking that preferentially exposes items possessing a high population variance. The decomposition of the post-click metric measurement enables the free layout of items in a ranking and focuses on the measurement of the post-click metric of each item in the multiple rankings. The interleaving of multiple rankings reduces the sample variance of the items possessing a high population variance by optimizing a ranking to be presented to the users so that those items received more samples of the post-click metric. In addition, we provide a proof that the proposed method leads",
    "link": "http://arxiv.org/abs/2306.10024",
    "context": "Title: Decomposition and Interleaving for Variance Reduction of Post-click Metrics. (arXiv:2306.10024v1 [cs.IR])\nAbstract: In this study, we propose an efficient method for comparing the post-click metric (e.g., dwell time and conversion rate) of multiple rankings in online experiments. The proposed method involves (1) the decomposition of the post-click metric measurement of a ranking into a click model estimation and a post-click metric measurement of each item in the ranking, and (2) interleaving of multiple rankings to produce a single ranking that preferentially exposes items possessing a high population variance. The decomposition of the post-click metric measurement enables the free layout of items in a ranking and focuses on the measurement of the post-click metric of each item in the multiple rankings. The interleaving of multiple rankings reduces the sample variance of the items possessing a high population variance by optimizing a ranking to be presented to the users so that those items received more samples of the post-click metric. In addition, we provide a proof that the proposed method leads",
    "path": "papers/23/06/2306.10024.json",
    "total_tokens": 867,
    "translated_title": "分解和交错用于减少后点击度量的方差",
    "translated_abstract": "本研究提出了一种比较多个排名后点击度量（例如停留时间和转化率）的有效方法。所提出的方法涉及（1）将排名的后点击度量测量分解为点击模型估计和排名中每个项的后点击度量测量，以及（2）交错多个排名以生成一个偏好暴露具有高群体方差的项目的单个排名。后点击度量测量的分解使得可以在排名中自由布局项目，并专注于多个排名中每个项目的后点击度量的测量。多个排名的交错通过优化展示给用户的排名，以便那些项目接收更多的后点击度量样本，从而减少具有高群体方差的项目的样本方差。此外，我们还提供了一个证明，证明所提出的方法可以显著地降低后点击度量的样本方差。",
    "tldr": "本研究提出了一种有效的方法，通过分解和交错多个排名的后点击度量以减少样本方差。该方法专注于测量多个排名中每个项目的后点击度量，并优化排名以暴露具有高群体方差的项目。",
    "en_tdlr": "This study proposes an effective method to reduce sample variance of post-click metrics by decomposing and interleaving multiple rankings. The method focuses on measuring the post-click metric of each item in the rankings and optimizing the rankings to expose items with high population variance."
}