{
    "title": "Harnessing LLMs in Curricular Design: Using GPT-4 to Support Authoring of Learning Objectives. (arXiv:2306.17459v1 [cs.AI])",
    "abstract": "We evaluated the capability of a generative pre-trained transformer (GPT-4) to automatically generate high-quality learning objectives (LOs) in the context of a practically oriented university course on Artificial Intelligence. Discussions of opportunities (e.g., content generation, explanation) and risks (e.g., cheating) of this emerging technology in education have intensified, but to date there has not been a study of the models' capabilities in supporting the course design and authoring of LOs. LOs articulate the knowledge and skills learners are intended to acquire by engaging with a course. To be effective, LOs must focus on what students are intended to achieve, focus on specific cognitive processes, and be measurable. Thus, authoring high-quality LOs is a challenging and time consuming (i.e., expensive) effort. We evaluated 127 LOs that were automatically generated based on a carefully crafted prompt (detailed guidelines on high-quality LOs authoring) submitted to GPT-4 for con",
    "link": "http://arxiv.org/abs/2306.17459",
    "context": "Title: Harnessing LLMs in Curricular Design: Using GPT-4 to Support Authoring of Learning Objectives. (arXiv:2306.17459v1 [cs.AI])\nAbstract: We evaluated the capability of a generative pre-trained transformer (GPT-4) to automatically generate high-quality learning objectives (LOs) in the context of a practically oriented university course on Artificial Intelligence. Discussions of opportunities (e.g., content generation, explanation) and risks (e.g., cheating) of this emerging technology in education have intensified, but to date there has not been a study of the models' capabilities in supporting the course design and authoring of LOs. LOs articulate the knowledge and skills learners are intended to acquire by engaging with a course. To be effective, LOs must focus on what students are intended to achieve, focus on specific cognitive processes, and be measurable. Thus, authoring high-quality LOs is a challenging and time consuming (i.e., expensive) effort. We evaluated 127 LOs that were automatically generated based on a carefully crafted prompt (detailed guidelines on high-quality LOs authoring) submitted to GPT-4 for con",
    "path": "papers/23/06/2306.17459.json",
    "total_tokens": 908,
    "translated_title": "在课程设计中利用LLMs: 使用GPT-4支持学习目标的创作",
    "translated_abstract": "我们评估了生成式预训练转换器（GPT-4）在实践导向的人工智能大学课程中自动生成高质量学习目标（LOs）的能力。对于教育中这一新兴技术的机会（例如内容生成，解释）和风险（例如作弊）的讨论日益加强，但到目前为止还没有一项研究评估模型在课程设计和LOs撰写方面的能力。LOs清晰表达了学习者通过参与课程所期望获得的知识和技能。为了有效，LOs必须专注于学生的预期成就，专注于特定的认知过程，并且可以衡量。因此，撰写高质量LOs是一项具有挑战性且耗时（即昂贵）的工作。我们对127个LOs进行了评估，这些LOs是基于精心设计的提示（关于高质量LOs撰写的详细指南）自动生成的。",
    "tldr": "本论文评估了使用GPT-4在人工智能课程中自动生成高质量学习目标的能力，强调了学习目标的重要性和撰写高质量目标的挑战性。",
    "en_tdlr": "This paper evaluates the capability of using GPT-4 to automatically generate high-quality learning objectives in an Artificial Intelligence course, highlighting the importance of learning objectives and the challenges in authoring high-quality objectives."
}