{
    "title": "Comparing deep learning models for volatility prediction using multivariate data. (arXiv:2306.12446v1 [q-fin.ST])",
    "abstract": "This study aims at comparing several deep learning-based forecasters in the task of volatility prediction using multivariate data, proceeding from simpler or shallower to deeper and more complex models and compare them to the naive prediction and variations of classical GARCH models. Specifically, the volatility of five assets (i.e., S\\&P500, NASDAQ100, gold, silver, and oil) was predicted with the GARCH models, Multi-Layer Perceptrons, recurrent neural networks, Temporal Convolutional Networks, and the Temporal Fusion Transformer. In most cases the Temporal Fusion Transformer followed by variants of Temporal Convolutional Network outperformed classical approaches and shallow networks. These experiments were repeated, and the difference between competing models was shown to be statistically significant, therefore encouraging their use in practice.",
    "link": "http://arxiv.org/abs/2306.12446",
    "context": "Title: Comparing deep learning models for volatility prediction using multivariate data. (arXiv:2306.12446v1 [q-fin.ST])\nAbstract: This study aims at comparing several deep learning-based forecasters in the task of volatility prediction using multivariate data, proceeding from simpler or shallower to deeper and more complex models and compare them to the naive prediction and variations of classical GARCH models. Specifically, the volatility of five assets (i.e., S\\&P500, NASDAQ100, gold, silver, and oil) was predicted with the GARCH models, Multi-Layer Perceptrons, recurrent neural networks, Temporal Convolutional Networks, and the Temporal Fusion Transformer. In most cases the Temporal Fusion Transformer followed by variants of Temporal Convolutional Network outperformed classical approaches and shallow networks. These experiments were repeated, and the difference between competing models was shown to be statistically significant, therefore encouraging their use in practice.",
    "path": "papers/23/06/2306.12446.json",
    "total_tokens": 862,
    "translated_title": "比较多元数据下使用深度学习模型进行波动率预测的效果",
    "translated_abstract": "本研究旨在比较使用多种深度学习模型预测波动率的效果，从简单浅层的模型到更深层、更复杂的模型，并将它们与天真预测和经典GARCH模型的变化相比较。具体而言，基于GARCH模型、多层感知器、循环神经网络、时间卷积神经网络和时间融合变压器预测了五种资产（即S\\&P500、纳斯达克100、黄金、白银和石油）的波动率。在大多数情况下，时间融合变压器以及时间卷积神经网络的变体胜过了经典的方法和浅层网络。这些实验被重复进行，并且竞争模型之间的差异被证明是具有统计显著性的，因此鼓励在实践中使用它们。",
    "tldr": "本研究比较了使用不同深度学习模型预测多项资产波动率的效果，发现时间融合变压器及时间卷积神经网络的变体最优，可以用于实践。",
    "en_tdlr": "This study compares the effectiveness of using different deep learning models to predict the volatility of multiple assets based on multivariate data, and finds that the Temporal Fusion Transformer and variants of the Temporal Convolutional Network perform best, and can be used in practice."
}