{
    "title": "Differentially private sliced inverse regression in the federated paradigm. (arXiv:2306.06324v1 [stat.ME])",
    "abstract": "We extend the celebrated sliced inverse regression to address the challenges of decentralized data, prioritizing privacy and communication efficiency. Our approach, federated sliced inverse regression (FSIR), facilitates collaborative estimation of the sufficient dimension reduction subspace among multiple clients, solely sharing local estimates to protect sensitive datasets from exposure. To guard against potential adversary attacks, FSIR further employs diverse perturbation strategies, including a novel multivariate Gaussian mechanism that guarantees differential privacy at a low cost of statistical accuracy. Additionally, FSIR naturally incorporates a collaborative variable screening step, enabling effective handling of high-dimensional client data. Theoretical properties of FSIR are established for both low-dimensional and high-dimensional settings, supported by extensive numerical experiments and real data analysis.",
    "link": "http://arxiv.org/abs/2306.06324",
    "context": "Title: Differentially private sliced inverse regression in the federated paradigm. (arXiv:2306.06324v1 [stat.ME])\nAbstract: We extend the celebrated sliced inverse regression to address the challenges of decentralized data, prioritizing privacy and communication efficiency. Our approach, federated sliced inverse regression (FSIR), facilitates collaborative estimation of the sufficient dimension reduction subspace among multiple clients, solely sharing local estimates to protect sensitive datasets from exposure. To guard against potential adversary attacks, FSIR further employs diverse perturbation strategies, including a novel multivariate Gaussian mechanism that guarantees differential privacy at a low cost of statistical accuracy. Additionally, FSIR naturally incorporates a collaborative variable screening step, enabling effective handling of high-dimensional client data. Theoretical properties of FSIR are established for both low-dimensional and high-dimensional settings, supported by extensive numerical experiments and real data analysis.",
    "path": "papers/23/06/2306.06324.json",
    "total_tokens": 911,
    "translated_title": "以联邦学习范式为基础的差分隐私切片逆回归",
    "translated_abstract": "我们将广受欢迎的切片逆回归扩展到去解决分散式数据、优先保护隐私和通信效率等挑战。我们的方法，被称为联邦切片逆回归（FSIR），便于多个客户端之间协作估计足够维数的降维子空间，只共享本地估计，以保护敏感数据不被暴露。为了防范潜在的攻击，FSIR还采用了多种扰动策略，包括一种新颖的多元高斯机制，以低成本的统计精度保证差分隐私。此外，FSIR自然地结合了协作变量筛选步骤，能够有效地处理高维客户端数据。FSIR的理论性质在低维和高维设置中得到了证实，并得到了广泛的数字实验和实际数据分析的支持。",
    "tldr": "本文提出了以联邦学习为基础的差分隐私切片逆回归方法，通过协作估计足够维数的降维子空间以保护敏感数据不被暴露，同时采用多种扰动策略保障差分隐私，还能自然地结合协作变量筛选步骤以有效处理高维数据。",
    "en_tdlr": "This paper proposes a differentially private sliced inverse regression method based on the federated learning paradigm. The method collaboratively estimates the sufficient dimension reduction subspace among multiple clients, protects sensitive data through local estimation sharing, employs various perturbation strategies to ensure differential privacy, and naturally incorporates a collaborative variable screening step to handle high-dimensional data effectively."
}