{
    "title": "SwinRDM: Integrate SwinRNN with Diffusion Model towards High-Resolution and High-Quality Weather Forecasting. (arXiv:2306.03110v1 [cs.AI])",
    "abstract": "Data-driven medium-range weather forecasting has attracted much attention in recent years. However, the forecasting accuracy at high resolution is unsatisfactory currently. Pursuing high-resolution and high-quality weather forecasting, we develop a data-driven model SwinRDM which integrates an improved version of SwinRNN with a diffusion model. SwinRDM performs predictions at 0.25-degree resolution and achieves superior forecasting accuracy to IFS (Integrated Forecast System), the state-of-the-art operational NWP model, on representative atmospheric variables including 500 hPa geopotential (Z500), 850 hPa temperature (T850), 2-m temperature (T2M), and total precipitation (TP), at lead times of up to 5 days. We propose to leverage a two-step strategy to achieve high-resolution predictions at 0.25-degree considering the trade-off between computation memory and forecasting accuracy. Recurrent predictions for future atmospheric fields are firstly performed at 1.40625-degree resolution, and",
    "link": "http://arxiv.org/abs/2306.03110",
    "context": "Title: SwinRDM: Integrate SwinRNN with Diffusion Model towards High-Resolution and High-Quality Weather Forecasting. (arXiv:2306.03110v1 [cs.AI])\nAbstract: Data-driven medium-range weather forecasting has attracted much attention in recent years. However, the forecasting accuracy at high resolution is unsatisfactory currently. Pursuing high-resolution and high-quality weather forecasting, we develop a data-driven model SwinRDM which integrates an improved version of SwinRNN with a diffusion model. SwinRDM performs predictions at 0.25-degree resolution and achieves superior forecasting accuracy to IFS (Integrated Forecast System), the state-of-the-art operational NWP model, on representative atmospheric variables including 500 hPa geopotential (Z500), 850 hPa temperature (T850), 2-m temperature (T2M), and total precipitation (TP), at lead times of up to 5 days. We propose to leverage a two-step strategy to achieve high-resolution predictions at 0.25-degree considering the trade-off between computation memory and forecasting accuracy. Recurrent predictions for future atmospheric fields are firstly performed at 1.40625-degree resolution, and",
    "path": "papers/23/06/2306.03110.json",
    "total_tokens": 1084,
    "translated_title": "SwinRDM: 将SwinRNN与扩散模型结合以实现高分辨率且高质量的天气预报",
    "translated_abstract": "数据驱动的中期天气预报近年来受到了广泛关注。然而，目前在高分辨率下的预测准确性仍然不尽如人意。为了追求高分辨率和高质量的天气预报，我们开发了一个数据驱动模型SwinRDM，它将改进后的SwinRNN与扩散模型结合在一起。SwinRDM在0.25度分辨率上进行预测，并在500 hPa位势高度（Z500），850 hPa温度（T850），2米温度（T2M）和总降水（TP）等代表性大气变量上，以最多5天的先导时间，比IFS（集成预报系统）这种最先进的运营数值预报模型具有更优越的预报准确性。我们提出了一种双阶段策略，通过权衡计算内存和预测准确性之间的平衡来实现0.25度分辨率的高分辨率预测。首先在1.40625度分辨率下完成对未来大气场的循环预测，然后应用扩散模型将输出精细化到0.25度分辨率。结果表明，SwinRDM不仅极大地提高了高分辨率中期天气预报的准确性，而且展示了在预测极端天气事件方面的巨大潜力。",
    "tldr": "SwinRDM是一种将SwinRNN与扩散模型结合的数据驱动模型，它具有更优越的预报准确性以及在预测极端天气事件方面的巨大潜力。",
    "en_tdlr": "SwinRDM is a data-driven model that integrates SwinRNN with a diffusion model, achieving superior forecasting accuracy and demonstrating great potential in forecasting extreme weather events."
}