{
    "title": "Co-Certificate Learning with SAT Modulo Symmetries. (arXiv:2306.10427v2 [quant-ph] UPDATED)",
    "abstract": "We present a new SAT-based method for generating all graphs up to isomorphism that satisfy a given co-NP property. Our method extends the SAT Modulo Symmetry (SMS) framework with a technique that we call co-certificate learning. If SMS generates a candidate graph that violates the given co-NP property, we obtain a certificate for this violation, i.e., `co-certificate' for the co-NP property. The co-certificate gives rise to a clause that the SAT solver, serving as SMS's backend, learns as part of its CDCL procedure. We demonstrate that SMS plus co-certificate learning is a powerful method that allows us to improve the best-known lower bound on the size of Kochen-Specker vector systems, a problem that is central to the foundations of quantum mechanics and has been studied for over half a century. Our approach is orders of magnitude faster and scales significantly better than a recently proposed SAT-based method.",
    "link": "http://arxiv.org/abs/2306.10427",
    "context": "Title: Co-Certificate Learning with SAT Modulo Symmetries. (arXiv:2306.10427v2 [quant-ph] UPDATED)\nAbstract: We present a new SAT-based method for generating all graphs up to isomorphism that satisfy a given co-NP property. Our method extends the SAT Modulo Symmetry (SMS) framework with a technique that we call co-certificate learning. If SMS generates a candidate graph that violates the given co-NP property, we obtain a certificate for this violation, i.e., `co-certificate' for the co-NP property. The co-certificate gives rise to a clause that the SAT solver, serving as SMS's backend, learns as part of its CDCL procedure. We demonstrate that SMS plus co-certificate learning is a powerful method that allows us to improve the best-known lower bound on the size of Kochen-Specker vector systems, a problem that is central to the foundations of quantum mechanics and has been studied for over half a century. Our approach is orders of magnitude faster and scales significantly better than a recently proposed SAT-based method.",
    "path": "papers/23/06/2306.10427.json",
    "total_tokens": 877,
    "translated_title": "基于 SAT 模质的合证书学习",
    "translated_abstract": "我们提出了一种新的 SAT-based 方法，用于生成满足给定 co-NP 属性的所有同构图。我们的方法扩展了 SAT Modulo Symmetry (SMS) 框架，并使用一种称为 co-certificate learning 的技术。如果 SMS 生成违反给定 co-NP 属性的候选图形，则我们获得这种违反的证书，即 co-NP 属性的“合证书”。 合证书导致 SAT 求解器作为 SMS 的后端学习其 CDCL 程序的子句。我们证明了 SMS 加上 co-certificate learning 是一种强大的方法，可以改善 Kochen-Specker 矢量系统大小下限的最佳已知界限，这是量子力学基础的中心问题，已经研究了半个多世纪。我们的方法比最近提出的基于 SAT 的方法快几个数量级，并具有更好的可扩展性。",
    "tldr": "该论文提出了一种基于SAT模质组合的新方法，称为合证书学习(co-certificate learning)，用于解决满足给定co-NP属性的同构图问题。这种方法比最近提出的基于SAT的方法快几个数量级，并具有更好的可扩展性。",
    "en_tdlr": "This paper presents a new method called co-certificate learning based on SAT Modulo Symmetry (SMS) framework for generating all graphs up to isomorphism that satisfy a given co-NP property. This approach is orders of magnitude faster and scales significantly better than a recently proposed SAT-based method."
}