{
    "title": "Higher-order Motif-based Time Series Classification for Forced Oscillation Source Location in Power Grids. (arXiv:2306.13397v1 [cs.LG])",
    "abstract": "Time series motifs are used for discovering higher-order structures of time series data. Based on time series motifs, the motif embedding correlation field (MECF) is proposed to characterize higher-order temporal structures of dynamical system time series. A MECF-based unsupervised learning approach is applied in locating the source of the forced oscillation (FO), a periodic disturbance that detrimentally impacts power grids. Locating the FO source is imperative for system stability. Compared with the Fourier analysis, the MECF-based unsupervised learning is applicable under various FO situations, including the single FO, FO with resonance, and multiple sources FOs. The MECF-based unsupervised learning is a data-driven approach without any prior knowledge requirement of system models or typologies. Tests on the UK high-voltage transmission grid illustrate the effectiveness of MECF-based unsupervised learning. In addition, the impacts of coupling strength and measurement noise on locati",
    "link": "http://arxiv.org/abs/2306.13397",
    "context": "Title: Higher-order Motif-based Time Series Classification for Forced Oscillation Source Location in Power Grids. (arXiv:2306.13397v1 [cs.LG])\nAbstract: Time series motifs are used for discovering higher-order structures of time series data. Based on time series motifs, the motif embedding correlation field (MECF) is proposed to characterize higher-order temporal structures of dynamical system time series. A MECF-based unsupervised learning approach is applied in locating the source of the forced oscillation (FO), a periodic disturbance that detrimentally impacts power grids. Locating the FO source is imperative for system stability. Compared with the Fourier analysis, the MECF-based unsupervised learning is applicable under various FO situations, including the single FO, FO with resonance, and multiple sources FOs. The MECF-based unsupervised learning is a data-driven approach without any prior knowledge requirement of system models or typologies. Tests on the UK high-voltage transmission grid illustrate the effectiveness of MECF-based unsupervised learning. In addition, the impacts of coupling strength and measurement noise on locati",
    "path": "papers/23/06/2306.13397.json",
    "total_tokens": 966,
    "translated_title": "基于高阶模式的电网强制振荡源位置识别的时间序列分类",
    "translated_abstract": "时间序列模式用于发现时序数据的高阶结构。基于时间序列模式，提出了模式嵌入相关场（MECF）来刻画动力系统时间序列的高阶时间结构。应用基于MECF的无监督学习方法来确定强制振荡（FO）源的位置，该周期性干扰对电网的稳定性产生不良影响。确定FO源位置对电网稳定性至关重要。与傅里叶分析相比，基于MECF的无监督学习适用于各种FO情况，包括单个FO，共振FO和多源FO。 基于MECF的无监督学习是一种数据驱动方法，不需要任何关于系统模型或拓扑结构的先验知识。在英国高压输电网上的测试表明了基于MECF的无监督学习的有效性。此外，本研究还分析了耦合强度和测量噪声对位置判断的影响。",
    "tldr": "本研究通过基于高阶模式的时间序列分类确定强制振荡源的位置。相比传统方法，该数据驱动的无监督学习方法适用于多种FO情况，且不需要先验知识。单个和多源FO情况均可适用。在英国高压输电网上的测试表明了其有效性。",
    "en_tdlr": "This study proposes a higher-order motif-based time series classification approach to locate forced oscillation (FO) sources, which is imperative for system stability. Compared with traditional methods, the data-driven unsupervised learning approach is applicable under various FO situations without any prior knowledge requirement. Tests on the UK high-voltage transmission grid show its effectiveness for both single and multiple FO sources."
}