{
    "title": "Motion-DVAE: Unsupervised learning for fast human motion denoising. (arXiv:2306.05846v1 [cs.CV])",
    "abstract": "Pose and motion priors are crucial for recovering realistic and accurate human motion from noisy observations. Substantial progress has been made on pose and shape estimation from images, and recent works showed impressive results using priors to refine frame-wise predictions. However, a lot of motion priors only model transitions between consecutive poses and are used in time-consuming optimization procedures, which is problematic for many applications requiring real-time motion capture. We introduce Motion-DVAE, a motion prior to capture the short-term dependencies of human motion. As part of the dynamical variational autoencoder (DVAE) models family, Motion-DVAE combines the generative capability of VAE models and the temporal modeling of recurrent architectures. Together with Motion-DVAE, we introduce an unsupervised learned denoising method unifying regression- and optimization-based approaches in a single framework for real-time 3D human pose estimation. Experiments show that the",
    "link": "http://arxiv.org/abs/2306.05846",
    "context": "Title: Motion-DVAE: Unsupervised learning for fast human motion denoising. (arXiv:2306.05846v1 [cs.CV])\nAbstract: Pose and motion priors are crucial for recovering realistic and accurate human motion from noisy observations. Substantial progress has been made on pose and shape estimation from images, and recent works showed impressive results using priors to refine frame-wise predictions. However, a lot of motion priors only model transitions between consecutive poses and are used in time-consuming optimization procedures, which is problematic for many applications requiring real-time motion capture. We introduce Motion-DVAE, a motion prior to capture the short-term dependencies of human motion. As part of the dynamical variational autoencoder (DVAE) models family, Motion-DVAE combines the generative capability of VAE models and the temporal modeling of recurrent architectures. Together with Motion-DVAE, we introduce an unsupervised learned denoising method unifying regression- and optimization-based approaches in a single framework for real-time 3D human pose estimation. Experiments show that the",
    "path": "papers/23/06/2306.05846.json",
    "total_tokens": 950,
    "translated_title": "Motion-DVAE: 面向快速人体运动去噪的无监督学习",
    "translated_abstract": "在从嘈杂的观测中恢复真实准确的人体运动中，姿态和运动先验至关重要。 在图像中进行姿态和形状估计已经取得了实质性进展，并且最近的研究表明，使用先验来提炼逐帧预测的结果取得了令人印象深刻的成果。 然而，许多运动先验仅模拟相邻姿态之间的过渡，并在耗时的优化过程中使用，这对许多需要实时运动捕捉的应用程序是有问题的。我们引入Motion-DVAE，这是一种运动先验，用于捕获人类运动的短期依赖关系。 作为动态变分自编码器（DVAE）模型系列的一部分，Motion-DVAE结合了VAE模型的生成能力和循环结构的时间建模。除此之外，我们提出了一种无监督学习的去噪方法，结合回归和基于优化的方法于一个框架中，用于实时的3D人体姿态估计。实验证明",
    "tldr": "该文章介绍Motion-DVAE，一种用于人体运动依赖关系的运动先验，以实现快速的人体运动去噪。其无监督学习的去噪方法结合了回归和基于优化的方法。"
}