{
    "title": "Driving Context into Text-to-Text Privatization. (arXiv:2306.01457v1 [cs.CL])",
    "abstract": "\\textit{Metric Differential Privacy} enables text-to-text privatization by adding calibrated noise to the vector of a word derived from an embedding space and projecting this noisy vector back to a discrete vocabulary using a nearest neighbor search. Since words are substituted without context, this mechanism is expected to fall short at finding substitutes for words with ambiguous meanings, such as \\textit{'bank'}. To account for these ambiguous words, we leverage a sense embedding and incorporate a sense disambiguation step prior to noise injection. We encompass our modification to the privatization mechanism with an estimation of privacy and utility. For word sense disambiguation on the \\textit{Words in Context} dataset, we demonstrate a substantial increase in classification accuracy by $6.05\\%$.",
    "link": "http://arxiv.org/abs/2306.01457",
    "context": "Title: Driving Context into Text-to-Text Privatization. (arXiv:2306.01457v1 [cs.CL])\nAbstract: \\textit{Metric Differential Privacy} enables text-to-text privatization by adding calibrated noise to the vector of a word derived from an embedding space and projecting this noisy vector back to a discrete vocabulary using a nearest neighbor search. Since words are substituted without context, this mechanism is expected to fall short at finding substitutes for words with ambiguous meanings, such as \\textit{'bank'}. To account for these ambiguous words, we leverage a sense embedding and incorporate a sense disambiguation step prior to noise injection. We encompass our modification to the privatization mechanism with an estimation of privacy and utility. For word sense disambiguation on the \\textit{Words in Context} dataset, we demonstrate a substantial increase in classification accuracy by $6.05\\%$.",
    "path": "papers/23/06/2306.01457.json",
    "total_tokens": 825,
    "translated_title": "将上下文纳入文本-文本隐私保护中",
    "translated_abstract": "“度量差分隐私”通过向从嵌入空间中导出的单词向量添加经过校准的噪声，并使用最近邻搜索将这些有噪声的向量投影回离散词汇，从而实现了文本到文本的隐私保护功能。由于单词是没有上下文的替代，因此该机制可能无法找到具有歧义含义的单词的替代词，例如“bank”。为了解决这些模棱两可的单词，我们利用了一种语义嵌入并在注入噪声之前加入了一个语义消歧步骤。我们还估计了隐私和实用性对隐私保护机制的修改。在“上下文中的单词”数据集上进行的单词义消歧试验中，我们证明了分类准确度的显著增加，达到了$6.05％$。",
    "tldr": "本文介绍了一种度量差分隐私机制，该机制在注入噪声之前加入了一个语义消歧步骤以提高歧义单词替代的有效性，并展示了在“上下文中的单词”数据集上的有效性。",
    "en_tdlr": "This paper introduces a metric differential privacy mechanism that incorporates a sense disambiguation step to improve the efficacy of substituting ambiguous words and demonstrates its effectiveness on the Words in Context dataset."
}