{
    "title": "Interpretable Medical Diagnostics with Structured Data Extraction by Large Language Models. (arXiv:2306.05052v1 [cs.LG])",
    "abstract": "Tabular data is often hidden in text, particularly in medical diagnostic reports. Traditional machine learning (ML) models designed to work with tabular data, cannot effectively process information in such form. On the other hand, large language models (LLMs) which excel at textual tasks, are probably not the best tool for modeling tabular data. Therefore, we propose a novel, simple, and effective methodology for extracting structured tabular data from textual medical reports, called TEMED-LLM. Drawing upon the reasoning capabilities of LLMs, TEMED-LLM goes beyond traditional extraction techniques, accurately inferring tabular features, even when their names are not explicitly mentioned in the text. This is achieved by combining domain-specific reasoning guidelines with a proposed data validation and reasoning correction feedback loop. By applying interpretable ML models such as decision trees and logistic regression over the extracted and validated data, we obtain end-to-end interpret",
    "link": "http://arxiv.org/abs/2306.05052",
    "context": "Title: Interpretable Medical Diagnostics with Structured Data Extraction by Large Language Models. (arXiv:2306.05052v1 [cs.LG])\nAbstract: Tabular data is often hidden in text, particularly in medical diagnostic reports. Traditional machine learning (ML) models designed to work with tabular data, cannot effectively process information in such form. On the other hand, large language models (LLMs) which excel at textual tasks, are probably not the best tool for modeling tabular data. Therefore, we propose a novel, simple, and effective methodology for extracting structured tabular data from textual medical reports, called TEMED-LLM. Drawing upon the reasoning capabilities of LLMs, TEMED-LLM goes beyond traditional extraction techniques, accurately inferring tabular features, even when their names are not explicitly mentioned in the text. This is achieved by combining domain-specific reasoning guidelines with a proposed data validation and reasoning correction feedback loop. By applying interpretable ML models such as decision trees and logistic regression over the extracted and validated data, we obtain end-to-end interpret",
    "path": "papers/23/06/2306.05052.json",
    "total_tokens": 1009,
    "tldr": "本文提出了一种名为TEMED-LLM的新方法，用于从医学报告中提取结构化表格数据，它利用大型语言模型的推理能力，结合领域特定的推理指南和数据验证技术，实现了准确推断表格特征的目的。通过将解释性的机器学习模型应用于提取和验证的数据上，使该方法具有更好的可解释性和实用性。"
}