{
    "title": "Ownership Protection of Generative Adversarial Networks. (arXiv:2306.05233v1 [cs.CR])",
    "abstract": "Generative adversarial networks (GANs) have shown remarkable success in image synthesis, making GAN models themselves commercially valuable to legitimate model owners. Therefore, it is critical to technically protect the intellectual property of GANs. Prior works need to tamper with the training set or training process, and they are not robust to emerging model extraction attacks. In this paper, we propose a new ownership protection method based on the common characteristics of a target model and its stolen models. Our method can be directly applicable to all well-trained GANs as it does not require retraining target models. Extensive experimental results show that our new method can achieve the best protection performance, compared to the state-of-the-art methods. Finally, we demonstrate the effectiveness of our method with respect to the number of generations of model extraction attacks, the number of generated samples, different datasets, as well as adaptive attacks.",
    "link": "http://arxiv.org/abs/2306.05233",
    "context": "Title: Ownership Protection of Generative Adversarial Networks. (arXiv:2306.05233v1 [cs.CR])\nAbstract: Generative adversarial networks (GANs) have shown remarkable success in image synthesis, making GAN models themselves commercially valuable to legitimate model owners. Therefore, it is critical to technically protect the intellectual property of GANs. Prior works need to tamper with the training set or training process, and they are not robust to emerging model extraction attacks. In this paper, we propose a new ownership protection method based on the common characteristics of a target model and its stolen models. Our method can be directly applicable to all well-trained GANs as it does not require retraining target models. Extensive experimental results show that our new method can achieve the best protection performance, compared to the state-of-the-art methods. Finally, we demonstrate the effectiveness of our method with respect to the number of generations of model extraction attacks, the number of generated samples, different datasets, as well as adaptive attacks.",
    "path": "papers/23/06/2306.05233.json",
    "total_tokens": 877,
    "translated_title": "生成对抗网络的拥有权保护",
    "translated_abstract": "生成对抗网络（GAN）在图像合成方面取得了显著的成功，使得GAN模型本身对于合法的模型所有者具有商业价值。因此，技术保护GAN的知识产权至关重要。先前的研究需要篡改训练集或训练过程，并且它们对新兴的模型提取攻击不具有鲁棒性。本文提出一种基于目标模型及其盗版模型共同特征的新型拥有权保护方法。我们的方法可以直接适用于所有训练良好的GAN，因为它不需要重新训练目标模型。大量实验结果表明，与最先进的方法相比，我们的新方法可以实现最佳的保护性能。最后，我们证明了我们的方法对于模型提取攻击的生成次数、生成样本的数量、不同数据集以及自适应攻击的有效性。",
    "tldr": "本文提出一种新型的GAN拥有权保护方法，它基于目标模型及其盗版模型共同特征，能够直接适用于所有训练良好的GAN，最终实验结果表明其具有最佳的保护性能。",
    "en_tdlr": "This paper proposes a novel ownership protection method for GANs, which is based on the common characteristics of a target model and its stolen models, and can be directly applicable to all well-trained GANs without retraining. Extensive experimental results show that it has the best protection performance compared to state-of-the-art methods."
}