{
    "title": "Handling Label Uncertainty on the Example of Automatic Detection of Shepherd's Crook RCA in Coronary CT Angiography. (arXiv:2306.01752v1 [eess.IV])",
    "abstract": "Coronary artery disease (CAD) is often treated minimally invasively with a catheter being inserted into the diseased coronary vessel. If a patient exhibits a Shepherd's Crook (SC) Right Coronary Artery (RCA) - an anatomical norm variant of the coronary vasculature - the complexity of this procedure is increased. Automated reporting of this variant from coronary CT angiography screening would ease prior risk assessment. We propose a 1D convolutional neural network which leverages a sequence of residual dilated convolutions to automatically determine this norm variant from a prior extracted vessel centerline. As the SC RCA is not clearly defined with respect to concrete measurements, labeling also includes qualitative aspects. Therefore, 4.23% samples in our dataset of 519 RCA centerlines were labeled as unsure SC RCAs, with 5.97% being labeled as sure SC RCAs. We explore measures to handle this label uncertainty, namely global/model-wise random assignment, exclusion, and soft label assi",
    "link": "http://arxiv.org/abs/2306.01752",
    "context": "Title: Handling Label Uncertainty on the Example of Automatic Detection of Shepherd's Crook RCA in Coronary CT Angiography. (arXiv:2306.01752v1 [eess.IV])\nAbstract: Coronary artery disease (CAD) is often treated minimally invasively with a catheter being inserted into the diseased coronary vessel. If a patient exhibits a Shepherd's Crook (SC) Right Coronary Artery (RCA) - an anatomical norm variant of the coronary vasculature - the complexity of this procedure is increased. Automated reporting of this variant from coronary CT angiography screening would ease prior risk assessment. We propose a 1D convolutional neural network which leverages a sequence of residual dilated convolutions to automatically determine this norm variant from a prior extracted vessel centerline. As the SC RCA is not clearly defined with respect to concrete measurements, labeling also includes qualitative aspects. Therefore, 4.23% samples in our dataset of 519 RCA centerlines were labeled as unsure SC RCAs, with 5.97% being labeled as sure SC RCAs. We explore measures to handle this label uncertainty, namely global/model-wise random assignment, exclusion, and soft label assi",
    "path": "papers/23/06/2306.01752.json",
    "total_tokens": 978,
    "translated_title": "在冠状动脉 CT 血管造影中处理标签不确定性的方法研究——以牧羊人钩形右冠状动脉为例",
    "translated_abstract": "冠状动脉疾病（CAD）通常通过向患病冠状动脉插入导管进行微创治疗。如果患者出现牧羊人钩形（SC）右冠状动脉（RCA）——这是冠状血管的一种解剖正常变异——则会增加这种手术的复杂性。从冠状动脉 CT 血管造影筛查中自动报告此变异有助于风险评估。我们提出了一种一维卷积神经网络，利用一系列残差扩张卷积来自动确定这种正常变异，并从先前提取的血管中心线中提取信息。由于 SC RCA 相对于具体测量并不清晰，标签还包括定性方面。因此，我们的数据集中有 4.23% 的样本标记为不确定的 SC RCA，5.97% 的样本标记为确定的 SC RCA。我们探讨了处理这种标签不确定性的措施，包括全局/模型随机分配、排除和软标签分配。",
    "tldr": "本论文提出了一种利用一维卷积神经网络在冠状动脉 CT 血管造影中自动检测牧羊人钩形右冠状动脉的方法，并探讨了如何处理标签不确定性的问题。",
    "en_tdlr": "This paper proposes a method for automatically detecting Shepherd's Crook Right Coronary Artery in coronary CT angiography using a 1D convolutional neural network and explores measures to handle label uncertainty."
}