{
    "title": "Application of spin glass ideas in social sciences, economics and finance. (arXiv:2306.16165v1 [physics.soc-ph])",
    "abstract": "Classical economics has developed an arsenal of methods, based on the idea of representative agents, to come up with precise numbers for next year's GDP, inflation and exchange rates, among (many) other things. Few, however, will disagree with the fact that the economy is a complex system, with a large number of strongly heterogeneous, interacting units of different types (firms, banks, households, public institutions) and different sizes.  Now, the main issue in economics is precisely the emergent organization, cooperation and coordination of such a motley crowd of micro-units. Treating them as a unique ``representative'' firm or household clearly risks throwing the baby with the bathwater. As we have learnt from statistical physics, understanding and characterizing such emergent properties can be difficult. Because of feedback loops of different signs, heterogeneities and non-linearities, the macro-properties are often hard to anticipate. In particular, these situations generically l",
    "link": "http://arxiv.org/abs/2306.16165",
    "context": "Title: Application of spin glass ideas in social sciences, economics and finance. (arXiv:2306.16165v1 [physics.soc-ph])\nAbstract: Classical economics has developed an arsenal of methods, based on the idea of representative agents, to come up with precise numbers for next year's GDP, inflation and exchange rates, among (many) other things. Few, however, will disagree with the fact that the economy is a complex system, with a large number of strongly heterogeneous, interacting units of different types (firms, banks, households, public institutions) and different sizes.  Now, the main issue in economics is precisely the emergent organization, cooperation and coordination of such a motley crowd of micro-units. Treating them as a unique ``representative'' firm or household clearly risks throwing the baby with the bathwater. As we have learnt from statistical physics, understanding and characterizing such emergent properties can be difficult. Because of feedback loops of different signs, heterogeneities and non-linearities, the macro-properties are often hard to anticipate. In particular, these situations generically l",
    "path": "papers/23/06/2306.16165.json",
    "total_tokens": 914,
    "translated_title": "自旋玻璃思想在社会科学、经济学和金融领域的应用",
    "translated_abstract": "经典经济学建立了一套基于代表性代理人思想的方法来预测明年的国内生产总值、通货膨胀和汇率等精确数字。然而，很少有人会不同意经济是一个复杂的系统，有着大量强烈异质性的不同类型单位（企业、银行、家庭、公共机构）和不同规模的交互作用单元。现在，经济学的主要问题正是这种大杂烩微观单位的新兴组织、合作和协调。把它们视为一个“代表性”企业或家庭显然会冒着舍弃精华的风险。如同我们从统计物理学中学到的那样，理解和描述这种新兴性质可能很困难。由于具有不同符号、异质性和非线性的反馈环路，宏观性质往往很难预料。特别是在这些情况下，这些情况一般都是无法预测的。",
    "tldr": "这篇论文探讨了自旋玻璃思想在社会科学、经济学和金融领域的应用，强调了经济系统的复杂性以及在理解和描述这种系统时的困难。",
    "en_tdlr": "This paper explores the application of spin glass ideas in social sciences, economics, and finance, emphasizing the complexity of economic systems and the challenges in understanding and characterizing them."
}