{
    "title": "BrainNet: Epileptic Wave Detection from SEEG with Hierarchical Graph Diffusion Learning. (arXiv:2306.13101v1 [eess.SP])",
    "abstract": "Epilepsy is one of the most serious neurological diseases, affecting 1-2% of the world's population. The diagnosis of epilepsy depends heavily on the recognition of epileptic waves, i.e., disordered electrical brainwave activity in the patient's brain. Existing works have begun to employ machine learning models to detect epileptic waves via cortical electroencephalogram (EEG). However, the recently developed stereoelectrocorticography (SEEG) method provides information in stereo that is more precise than conventional EEG, and has been broadly applied in clinical practice. Therefore, we propose the first data-driven study to detect epileptic waves in a real-world SEEG dataset. While offering new opportunities, SEEG also poses several challenges. In clinical practice, epileptic wave activities are considered to propagate between different regions in the brain. These propagation paths, also known as the epileptogenic network, are deemed to be a key factor in the context of epilepsy surger",
    "link": "http://arxiv.org/abs/2306.13101",
    "context": "Title: BrainNet: Epileptic Wave Detection from SEEG with Hierarchical Graph Diffusion Learning. (arXiv:2306.13101v1 [eess.SP])\nAbstract: Epilepsy is one of the most serious neurological diseases, affecting 1-2% of the world's population. The diagnosis of epilepsy depends heavily on the recognition of epileptic waves, i.e., disordered electrical brainwave activity in the patient's brain. Existing works have begun to employ machine learning models to detect epileptic waves via cortical electroencephalogram (EEG). However, the recently developed stereoelectrocorticography (SEEG) method provides information in stereo that is more precise than conventional EEG, and has been broadly applied in clinical practice. Therefore, we propose the first data-driven study to detect epileptic waves in a real-world SEEG dataset. While offering new opportunities, SEEG also poses several challenges. In clinical practice, epileptic wave activities are considered to propagate between different regions in the brain. These propagation paths, also known as the epileptogenic network, are deemed to be a key factor in the context of epilepsy surger",
    "path": "papers/23/06/2306.13101.json",
    "total_tokens": 971,
    "translated_title": "BrainNet：基于分层图卷积网络的SEEG癫痫波检测",
    "translated_abstract": "癫痫是一种严重的神经系统疾病，影响着全球1-2％的人口。癫痫的诊断在很大程度上取决于对癫痫波的识别，即患者大脑中的无序电脑活动。现有研究已经开始使用机器学习模型通过电极链记录皮层脑电图(EEG)检测癫痫波。然而，最近开发的立体电极脑电图(SEEG)方法提供的立体信息比传统的EEG更精确，并已广泛应用于临床实践。因此，本研究提出了第一个使用真实世界SEEG数据集来检测癫痫波的数据驱动研究。在提供新机会的同时，SEEG也带来了一些挑战。在临床实践中，癫痫波活动被认为在大脑的不同区域间传播。这些传播路径，也称为癫痫发生网络，在癫痫手术的背景下被认为是关键因素。",
    "tldr": "本研究提出了第一个使用真实世界SEEG数据集进行癫痫波检测的数据驱动研究，通过使用分层图卷积网络技术，可以检测并分析扩散路径，从而有助于临床实践。"
}