{
    "title": "CSREU: A Novel Dataset about Corporate Social Responsibility and Performance Indicators. (arXiv:2306.09798v1 [econ.GN])",
    "abstract": "Corporate Social Responsibility (CSR) has become an important topic that is gaining academic interest. This research paper presents CSREU, a new dataset with attributes of 115 European companies, which includes several performance indicators and the respective CSR disclosure scores computed using the Global Reporting Initiative (GRI) framework. We also examine the correlations between some of the financial indicators and the CSR disclosure scores of the companies. According to our results, these correlations are weak and deeper analysis is required to draw convincing conclusions about the potential impact of CSR disclosure on financial performance. We hope that the newly created data and our preliminary results will help and foster research in this field.",
    "link": "http://arxiv.org/abs/2306.09798",
    "context": "Title: CSREU: A Novel Dataset about Corporate Social Responsibility and Performance Indicators. (arXiv:2306.09798v1 [econ.GN])\nAbstract: Corporate Social Responsibility (CSR) has become an important topic that is gaining academic interest. This research paper presents CSREU, a new dataset with attributes of 115 European companies, which includes several performance indicators and the respective CSR disclosure scores computed using the Global Reporting Initiative (GRI) framework. We also examine the correlations between some of the financial indicators and the CSR disclosure scores of the companies. According to our results, these correlations are weak and deeper analysis is required to draw convincing conclusions about the potential impact of CSR disclosure on financial performance. We hope that the newly created data and our preliminary results will help and foster research in this field.",
    "path": "papers/23/06/2306.09798.json",
    "total_tokens": 759,
    "translated_title": "CSREU：一份关于公司社会责任和绩效指标的新数据集",
    "translated_abstract": "企业社会责任（CSR）已成为一个重要话题，受到学术界的广泛关注。本研究介绍了CSREU，一个包含115个欧洲公司属性的新数据集，其中包括数个绩效指标和按照全球报告倡议（GRI）框架计算的相应CSR披露评分。我们还研究了一些公司财务指标与CSR披露评分之间的相关性。根据我们的结果，这些相关性较弱，需要进行更深入的分析才能得出关于CSR披露对财务绩效的潜在影响的令人信服的结论。我们希望新创建的数据和我们的初步结果能够帮助和促进这一领域的研究。",
    "tldr": "CSREU是一份欧洲公司绩效指标和CSR披露评分的数据集，初步结果表明CSR披露对财务绩效影响较弱，需要更深入的研究。",
    "en_tdlr": "CSREU is a novel dataset about the performance indicators and CSR disclosure scores of 115 European companies. Preliminary results indicate weak correlation between CSR disclosure and financial performance, requiring further research."
}