{
    "title": "Examining Bias in Opinion Summarisation Through the Perspective of Opinion Diversity. (arXiv:2306.04424v1 [cs.CL])",
    "abstract": "Opinion summarisation is a task that aims to condense the information presented in the source documents while retaining the core message and opinions. A summary that only represents the majority opinions will leave the minority opinions unrepresented in the summary. In this paper, we use the stance towards a certain target as an opinion. We study bias in opinion summarisation from the perspective of opinion diversity, which measures whether the model generated summary can cover a diverse set of opinions. In addition, we examine opinion similarity, a measure of how closely related two opinions are in terms of their stance on a given topic, and its relationship with opinion diversity. Through the lens of stances towards a topic, we examine opinion diversity and similarity using three debatable topics under COVID-19. Experimental results on these topics revealed that a higher degree of similarity of opinions did not indicate good diversity or fairly cover the various opinions originally p",
    "link": "http://arxiv.org/abs/2306.04424",
    "context": "Title: Examining Bias in Opinion Summarisation Through the Perspective of Opinion Diversity. (arXiv:2306.04424v1 [cs.CL])\nAbstract: Opinion summarisation is a task that aims to condense the information presented in the source documents while retaining the core message and opinions. A summary that only represents the majority opinions will leave the minority opinions unrepresented in the summary. In this paper, we use the stance towards a certain target as an opinion. We study bias in opinion summarisation from the perspective of opinion diversity, which measures whether the model generated summary can cover a diverse set of opinions. In addition, we examine opinion similarity, a measure of how closely related two opinions are in terms of their stance on a given topic, and its relationship with opinion diversity. Through the lens of stances towards a topic, we examine opinion diversity and similarity using three debatable topics under COVID-19. Experimental results on these topics revealed that a higher degree of similarity of opinions did not indicate good diversity or fairly cover the various opinions originally p",
    "path": "papers/23/06/2306.04424.json",
    "total_tokens": 923,
    "translated_title": "通过观点多样性的角度检验意见总结的偏见",
    "translated_abstract": "意见总结是一项旨在概括源文档中呈现的信息，同时保留核心信息和观点的任务。仅代表大多数观点的摘要将使少数观点未被摘要包含。在本文中，我们将对一个特定目标的立场作为一种观点。我们从观点多样性的角度研究意见总结中的偏见，该多样性测量模型生成的总结是否能涵盖多样的观点。此外，我们研究了观点相似性，即两种观点在对某个主题的立场方面有多密切相关，以及其与观点多样性的关系。通过对COVID-19下三个有争议的议题进行分析，我们可以从立场的角度来考察观点多样性和相似性。这些话题的实验结果表明，意见相似度的高度并不意味着很好的多样性或公平地涵盖原始文档中呈现的各种观点。",
    "tldr": "本文从观点多样性的角度探究意见总结中的偏见，通过对COVID-19下三个有争议的议题进行分析，发现意见相似度的高度并不意味着很好的多样性或公平地涵盖原始文档中呈现的各种观点。"
}