{
    "title": "Identifying and Disentangling Spurious Features in Pretrained Image Representations. (arXiv:2306.12673v1 [cs.LG])",
    "abstract": "Neural networks employ spurious correlations in their predictions, resulting in decreased performance when these correlations do not hold. Recent works suggest fixing pretrained representations and training a classification head that does not use spurious features. We investigate how spurious features are represented in pretrained representations and explore strategies for removing information about spurious features. Considering the Waterbirds dataset and a few pretrained representations, we find that even with full knowledge of spurious features, their removal is not straightforward due to entangled representation. To address this, we propose a linear autoencoder training method to separate the representation into core, spurious, and other features. We propose two effective spurious feature removal approaches that are applied to the encoding and significantly improve classification performance measured by worst group accuracy.",
    "link": "http://arxiv.org/abs/2306.12673",
    "context": "Title: Identifying and Disentangling Spurious Features in Pretrained Image Representations. (arXiv:2306.12673v1 [cs.LG])\nAbstract: Neural networks employ spurious correlations in their predictions, resulting in decreased performance when these correlations do not hold. Recent works suggest fixing pretrained representations and training a classification head that does not use spurious features. We investigate how spurious features are represented in pretrained representations and explore strategies for removing information about spurious features. Considering the Waterbirds dataset and a few pretrained representations, we find that even with full knowledge of spurious features, their removal is not straightforward due to entangled representation. To address this, we propose a linear autoencoder training method to separate the representation into core, spurious, and other features. We propose two effective spurious feature removal approaches that are applied to the encoding and significantly improve classification performance measured by worst group accuracy.",
    "path": "papers/23/06/2306.12673.json",
    "total_tokens": 862,
    "translated_title": "预训练图像表示中虚假特征的识别和分离",
    "translated_abstract": "神经网络在预测中使用虚假的相关性，当这些相关性不成立时，导致性能下降。最近的研究表明，固定预训练表示并训练一个不使用虚假特征的分类头。我们研究预训练表示中如何表示虚假特征，并探索去除虚假特征信息的策略。考虑水鸟数据集和一些预训练表示，我们发现即使知道虚假特征的全部信息，由于表示纠缠，其去除也不是一件容易的事情。为了解决这个问题，我们提出了一种线性自编码器训练方法，将表示分为核心，虚假和其他特征。我们提出了两种有效的虚假特征去除方法，应用于编码并显着提高了最差组准确度衡量的分类性能。",
    "tldr": "本文探究了如何从预训练图像表示中识别虚假特征，并提出了一个有效的线性自编码器训练方法来分离核心特征、虚假特征和其他特征。进一步，本文提出的两种虚假特征去除方法显著提高了分类性能。",
    "en_tdlr": "This paper investigates how to identify spurious features in pretrained image representations and proposes an effective linear autoencoder training method to separate core, spurious, and other features. Furthermore, two spurious feature removal approaches significantly improve classification performance."
}