{
    "title": "Quantum computer based Feature Selection in Machine Learning. (arXiv:2306.10591v1 [quant-ph])",
    "abstract": "The problem of selecting an appropriate number of features in supervised learning problems is investigated in this paper. Starting with common methods in machine learning, we treat the feature selection task as a quadratic unconstrained optimization problem (QUBO), which can be tackled with classical numerical methods as well as within a quantum computing framework. We compare the different results in small-sized problem setups. According to the results of our study, whether the QUBO method outperforms other feature selection methods depends on the data set. In an extension to a larger data set with 27 features, we compare the convergence behavior of the QUBO methods via quantum computing with classical stochastic optimization methods. Due to persisting error rates, the classical stochastic optimization methods are still superior.",
    "link": "http://arxiv.org/abs/2306.10591",
    "context": "Title: Quantum computer based Feature Selection in Machine Learning. (arXiv:2306.10591v1 [quant-ph])\nAbstract: The problem of selecting an appropriate number of features in supervised learning problems is investigated in this paper. Starting with common methods in machine learning, we treat the feature selection task as a quadratic unconstrained optimization problem (QUBO), which can be tackled with classical numerical methods as well as within a quantum computing framework. We compare the different results in small-sized problem setups. According to the results of our study, whether the QUBO method outperforms other feature selection methods depends on the data set. In an extension to a larger data set with 27 features, we compare the convergence behavior of the QUBO methods via quantum computing with classical stochastic optimization methods. Due to persisting error rates, the classical stochastic optimization methods are still superior.",
    "path": "papers/23/06/2306.10591.json",
    "total_tokens": 884,
    "translated_title": "量子计算在机器学习特征选择中的应用",
    "translated_abstract": "本文研究了在有监督学习问题中选择适当数量特征的问题。从机器学习的常用方法入手，我们将特征选择任务视为二次无约束优化问题(QUBO)，可以用经典数值方法以及量子计算框架来解决。我们比较了小型问题设置中的不同结果。根据研究结果，QUBO方法是否优于其他特征选择方法取决于数据集。在扩展到包含27个特征的大型数据集时，我们比较了基于量子计算的QUBO方法与基于经典随机优化方法的收敛性能。由于错误率问题，经典随机优化方法仍然优于QUBO方法。",
    "tldr": "本文探究在机器学习中如何使用量子计算来解决选择适当数量的特征的问题。研究将特征选择任务视为二次无约束优化问题(QUBO)，并进行了经典数值方法与量子计算框架的比较和探讨。研究结果表明QUBO方法的效果取决于数据集的大小，在27个特征的大型数据集的实验中，经典随机优化方法表现仍然优于QUBO方法。"
}