{
    "title": "FIRE: An Optimization Approach for Fast Interpretable Rule Extraction. (arXiv:2306.07432v1 [cs.LG])",
    "abstract": "We present FIRE, Fast Interpretable Rule Extraction, an optimization-based framework to extract a small but useful collection of decision rules from tree ensembles. FIRE selects sparse representative subsets of rules from tree ensembles, that are easy for a practitioner to examine. To further enhance the interpretability of the extracted model, FIRE encourages fusing rules during selection, so that many of the selected decision rules share common antecedents. The optimization framework utilizes a fusion regularization penalty to accomplish this, along with a non-convex sparsity-inducing penalty to aggressively select rules. Optimization problems in FIRE pose a challenge to off-the-shelf solvers due to problem scale and the non-convexity of the penalties. To address this, making use of problem-structure, we develop a specialized solver based on block coordinate descent principles; our solver performs up to 40x faster than existing solvers. We show in our experiments that FIRE outperform",
    "link": "http://arxiv.org/abs/2306.07432",
    "context": "Title: FIRE: An Optimization Approach for Fast Interpretable Rule Extraction. (arXiv:2306.07432v1 [cs.LG])\nAbstract: We present FIRE, Fast Interpretable Rule Extraction, an optimization-based framework to extract a small but useful collection of decision rules from tree ensembles. FIRE selects sparse representative subsets of rules from tree ensembles, that are easy for a practitioner to examine. To further enhance the interpretability of the extracted model, FIRE encourages fusing rules during selection, so that many of the selected decision rules share common antecedents. The optimization framework utilizes a fusion regularization penalty to accomplish this, along with a non-convex sparsity-inducing penalty to aggressively select rules. Optimization problems in FIRE pose a challenge to off-the-shelf solvers due to problem scale and the non-convexity of the penalties. To address this, making use of problem-structure, we develop a specialized solver based on block coordinate descent principles; our solver performs up to 40x faster than existing solvers. We show in our experiments that FIRE outperform",
    "path": "papers/23/06/2306.07432.json",
    "total_tokens": 982,
    "translated_title": "FIRE：一种用于快速可解释规则提取的优化方法",
    "translated_abstract": "我们提出了FIRE，即Fast Interpretable Rule Extraction，这是一个基于优化的框架，用于从树集合中提取少量但有用的决策规则。 FIRE从树集合中选择稀疏的代表性规则子集，这些子集易于由实践者检查。为了进一步增强所提取模型的可解释性，FIRE鼓励在选择时融合规则，以便许多所选决策规则共享相同的前提条件。该优化框架利用融合正则化惩罚来实现这一点，同时采用非凸稀疏引入惩罚以积极选取规则。FIRE中的优化问题由于问题规模和惩罚的非凸性而对现成求解器构成挑战。为了解决这个问题，利用问题结构，我们开发了一个基于块坐标下降原理的专门求解器； 我们的求解器比现有求解器运行速度快40倍。实验证明，与现有的规则提取方法相比，FIRE能够产生更准确且可解释的模型。",
    "tldr": "FIRE是一种用于从树集合中提取易于审查的稀疏规则子集的优化方法，可以鼓励在选择时融合规则，从而增强模型的可解释性，并且在实验中表现出更高的准确性和可解释性。",
    "en_tdlr": "FIRE is an optimization-based framework for extracting sparse representative subsets of decision rules from tree ensembles. It encourages fusing rules during selection to enhance interpretability and poses a challenge to off-the-shelf solvers due to problem scale and the non-convexity of the penalties. FIRE outperforms existing rule extraction methods by producing more accurate and interpretable models."
}