{
    "title": "Automated Labeling of German Chest X-Ray Radiology Reports using Deep Learning. (arXiv:2306.05997v1 [cs.CL])",
    "abstract": "Radiologists are in short supply globally, and deep learning models offer a promising solution to address this shortage as part of clinical decision-support systems. However, training such models often requires expensive and time-consuming manual labeling of large datasets. Automatic label extraction from radiology reports can reduce the time required to obtain labeled datasets, but this task is challenging due to semantically similar words and missing annotated data. In this work, we explore the potential of weak supervision of a deep learning-based label prediction model, using a rule-based labeler. We propose a deep learning-based CheXpert label prediction model, pre-trained on reports labeled by a rule-based German CheXpert model and fine-tuned on a small dataset of manually labeled reports. Our results demonstrate the effectiveness of our approach, which significantly outperformed the rule-based model on all three tasks. Our findings highlight the benefits of employing deep learni",
    "link": "http://arxiv.org/abs/2306.05997",
    "context": "Title: Automated Labeling of German Chest X-Ray Radiology Reports using Deep Learning. (arXiv:2306.05997v1 [cs.CL])\nAbstract: Radiologists are in short supply globally, and deep learning models offer a promising solution to address this shortage as part of clinical decision-support systems. However, training such models often requires expensive and time-consuming manual labeling of large datasets. Automatic label extraction from radiology reports can reduce the time required to obtain labeled datasets, but this task is challenging due to semantically similar words and missing annotated data. In this work, we explore the potential of weak supervision of a deep learning-based label prediction model, using a rule-based labeler. We propose a deep learning-based CheXpert label prediction model, pre-trained on reports labeled by a rule-based German CheXpert model and fine-tuned on a small dataset of manually labeled reports. Our results demonstrate the effectiveness of our approach, which significantly outperformed the rule-based model on all three tasks. Our findings highlight the benefits of employing deep learni",
    "path": "papers/23/06/2306.05997.json",
    "total_tokens": 948,
    "translated_title": "基于深度学习的德语胸部X射线医学报告自动标注",
    "translated_abstract": "世界范围内放射科医生短缺，深度学习模型作为临床决策支持系统的一部分，提供了解决这一问题的有希望的解决方案。然而，培训这样的模型往往需要耗费昂贵和耗时的手动标记大型数据集。从放射学报告中自动提取标签可以减少获得标记数据集所需的时间，但由于语义上相似的词和缺少注释数据而任务具有挑战性。在这项工作中，我们探讨了基于规则的标签器的弱监督深度学习标签预测模型的潜力。我们提出了一种基于深度学习的CheXpert标签预测模型，该模型在由基于规则的德语CheXpert模型标记的报告上进行了预训练，并在少量手动标记的报告数据集上进行了微调。我们的结果证明了我们的方法的有效性，在所有三个任务上显着优于基于规则的模型。我们的发现突出了使用深度学习技术的优点。",
    "tldr": "本研究使用基于深度学习的CheXpert标签预测模型进行弱监督，显着优于基于规则的模型，在自动标注德语胸部X射线医学报告方面具有潜在价值。",
    "en_tdlr": "This study explores the potential of weakly supervised deep learning-based label prediction model using rule-based labeler for automated labeling of German chest X-ray radiology reports, and demonstrates its effectiveness over rule-based model, highlighting the potential benefits of employing deep learning techniques in this field."
}