{
    "title": "A Unified View of Deep Learning for Reaction and Retrosynthesis Prediction: Current Status and Future Challenges. (arXiv:2306.15890v1 [cs.LG])",
    "abstract": "Reaction and retrosynthesis prediction are fundamental tasks in computational chemistry that have recently garnered attention from both the machine learning and drug discovery communities. Various deep learning approaches have been proposed to tackle these problems, and some have achieved initial success. In this survey, we conduct a comprehensive investigation of advanced deep learning-based models for reaction and retrosynthesis prediction. We summarize the design mechanisms, strengths, and weaknesses of state-of-the-art approaches. Then, we discuss the limitations of current solutions and open challenges in the problem itself. Finally, we present promising directions to facilitate future research. To our knowledge, this paper is the first comprehensive and systematic survey that seeks to provide a unified understanding of reaction and retrosynthesis prediction.",
    "link": "http://arxiv.org/abs/2306.15890",
    "context": "Title: A Unified View of Deep Learning for Reaction and Retrosynthesis Prediction: Current Status and Future Challenges. (arXiv:2306.15890v1 [cs.LG])\nAbstract: Reaction and retrosynthesis prediction are fundamental tasks in computational chemistry that have recently garnered attention from both the machine learning and drug discovery communities. Various deep learning approaches have been proposed to tackle these problems, and some have achieved initial success. In this survey, we conduct a comprehensive investigation of advanced deep learning-based models for reaction and retrosynthesis prediction. We summarize the design mechanisms, strengths, and weaknesses of state-of-the-art approaches. Then, we discuss the limitations of current solutions and open challenges in the problem itself. Finally, we present promising directions to facilitate future research. To our knowledge, this paper is the first comprehensive and systematic survey that seeks to provide a unified understanding of reaction and retrosynthesis prediction.",
    "path": "papers/23/06/2306.15890.json",
    "total_tokens": 858,
    "translated_title": "深度学习在反应和逆合成预测中的统一视角：现状与未来挑战",
    "translated_abstract": "反应和逆合成预测是计算化学中的基本任务，最近引起了机器学习和药物发现领域的关注。各种深度学习方法已被提出来解决这些问题，并且一些方法已经取得了初步的成功。在本综述中，我们对基于先进深度学习模型的反应和逆合成预测进行了全面的调查。我们总结了现有方法的设计机制、优势和不足之处。然后，我们讨论了当前解决方案的局限性以及问题本身的挑战。最后，我们提出了有利于未来研究的方向。据我们所知，这是第一份全面和系统的综述，旨在提供反应和逆合成预测的统一理解。",
    "tldr": "本论文提供了深度学习在反应和逆合成预测中的统一视角。通过调查现有的深度学习方法和模型，总结了它们的设计机制、优势和不足之处。同时，探讨了当前解决方案的局限性和问题本身的挑战，并提出了未来研究的有希望的方向。",
    "en_tdlr": "This paper provides a unified view of deep learning for reaction and retrosynthesis prediction. It conducts a comprehensive investigation of advanced deep learning-based models, summarizing their design mechanisms, strengths, and weaknesses. It also discusses the limitations of current solutions and the challenges in the problem itself, and presents promising directions for future research."
}