{
    "title": "Approximate Message Passing for the Matrix Tensor Product Model. (arXiv:2306.15580v1 [stat.ML])",
    "abstract": "We propose and analyze an approximate message passing (AMP) algorithm for the matrix tensor product model, which is a generalization of the standard spiked matrix models that allows for multiple types of pairwise observations over a collection of latent variables. A key innovation for this algorithm is a method for optimally weighing and combining multiple estimates in each iteration. Building upon an AMP convergence theorem for non-separable functions, we prove a state evolution for non-separable functions that provides an asymptotically exact description of its performance in the high-dimensional limit. We leverage this state evolution result to provide necessary and sufficient conditions for recovery of the signal of interest. Such conditions depend on the singular values of a linear operator derived from an appropriate generalization of a signal-to-noise ratio for our model. Our results recover as special cases a number of recently proposed methods for contextual models (e.g., cova",
    "link": "http://arxiv.org/abs/2306.15580",
    "context": "Title: Approximate Message Passing for the Matrix Tensor Product Model. (arXiv:2306.15580v1 [stat.ML])\nAbstract: We propose and analyze an approximate message passing (AMP) algorithm for the matrix tensor product model, which is a generalization of the standard spiked matrix models that allows for multiple types of pairwise observations over a collection of latent variables. A key innovation for this algorithm is a method for optimally weighing and combining multiple estimates in each iteration. Building upon an AMP convergence theorem for non-separable functions, we prove a state evolution for non-separable functions that provides an asymptotically exact description of its performance in the high-dimensional limit. We leverage this state evolution result to provide necessary and sufficient conditions for recovery of the signal of interest. Such conditions depend on the singular values of a linear operator derived from an appropriate generalization of a signal-to-noise ratio for our model. Our results recover as special cases a number of recently proposed methods for contextual models (e.g., cova",
    "path": "papers/23/06/2306.15580.json",
    "total_tokens": 900,
    "translated_title": "近似传递消息在矩阵张量乘积模型中的应用",
    "translated_abstract": "我们提出了一种针对矩阵张量乘积模型的近似传递消息（AMP）算法，并进行了分析。该模型是标准尖峰矩阵模型的推广，允许对一组潜在变量进行多种类型的两两观测。该算法的一个关键创新是在每次迭代中通过一种方法对多个估计进行最优权重和组合。借助非可分函数的AMP收敛定理，我们证明了非可分函数的状态演化，从而在高维极限下提供了其性能的渐近精确描述。我们利用这个状态演化结果给出了恢复目标信号所需的必要和充分条件。这些条件取决于从我们模型的适当推广中导出的线性算子的奇异值，这个线性算子是一个适当推广的信噪比的一个重要组成部分。我们的结果作为特殊情况涵盖了一些最近提出的背景模型方法（例如，covariance-）",
    "tldr": "本文提出了一种针对矩阵张量乘积模型的近似传递消息（AMP）算法，并分析了其性能。该算法通过权衡和组合多个估计来优化算法迭代过程。通过对非可分函数的AMP收敛定理和状态演化的研究，我们给出了恢复目标信号所需的必要和充分条件。该算法适用于多种类型的两两观测。"
}