{
    "title": "Physion++: Evaluating Physical Scene Understanding that Requires Online Inference of Different Physical Properties. (arXiv:2306.15668v1 [cs.CV])",
    "abstract": "General physical scene understanding requires more than simply localizing and recognizing objects -- it requires knowledge that objects can have different latent properties (e.g., mass or elasticity), and that those properties affect the outcome of physical events. While there has been great progress in physical and video prediction models in recent years, benchmarks to test their performance typically do not require an understanding that objects have individual physical properties, or at best test only those properties that are directly observable (e.g., size or color). This work proposes a novel dataset and benchmark, termed Physion++, that rigorously evaluates visual physical prediction in artificial systems under circumstances where those predictions rely on accurate estimates of the latent physical properties of objects in the scene. Specifically, we test scenarios where accurate prediction relies on estimates of properties such as mass, friction, elasticity, and deformability, an",
    "link": "http://arxiv.org/abs/2306.15668",
    "context": "Title: Physion++: Evaluating Physical Scene Understanding that Requires Online Inference of Different Physical Properties. (arXiv:2306.15668v1 [cs.CV])\nAbstract: General physical scene understanding requires more than simply localizing and recognizing objects -- it requires knowledge that objects can have different latent properties (e.g., mass or elasticity), and that those properties affect the outcome of physical events. While there has been great progress in physical and video prediction models in recent years, benchmarks to test their performance typically do not require an understanding that objects have individual physical properties, or at best test only those properties that are directly observable (e.g., size or color). This work proposes a novel dataset and benchmark, termed Physion++, that rigorously evaluates visual physical prediction in artificial systems under circumstances where those predictions rely on accurate estimates of the latent physical properties of objects in the scene. Specifically, we test scenarios where accurate prediction relies on estimates of properties such as mass, friction, elasticity, and deformability, an",
    "path": "papers/23/06/2306.15668.json",
    "total_tokens": 783,
    "translated_title": "Physion++：对需要在线推理不同物理属性的物理场景理解进行评估",
    "translated_abstract": "一般的物理场景理解需要的不仅仅是定位和识别物体，还需要了解物体可以具有不同的潜在属性（例如质量或弹性），并且这些属性会影响物理事件的结果。尽管近年来在物理和视频预测模型方面取得了很大进展，但评估它们性能的基准测试通常不要求理解物体具有个体的物理属性，或者最多只测试可以直接观察到的属性（例如大小或颜色）。本文提出了一个新的数据集和基准测试——Physion++，在这个人工系统下严格评估了视觉物理预测，其中预测依赖于场景中物体潜在物理属性的准确估计。具体而言，我们测试了准确预测依赖于质量、摩擦力、弹性和可变性等属性的场景。",
    "tldr": "该论文提出了一个新的数据集和基准测试——Physion++，用于评估在需要准确估计场景中物体潜在物理属性的情况下的视觉物理预测。"
}