{
    "title": "Blockchain-based Decentralized Co-governance: Innovations and Solutions for Sustainable Crowdfunding. (arXiv:2306.00869v1 [cs.CY])",
    "abstract": "This thesis provides an in-depth exploration of the Decentralized Co-governance Crowdfunding (DCC) Ecosystem, a novel solution addressing prevailing challenges in conventional crowdfunding methods faced by MSMEs and innovative projects. Among the problems it seeks to mitigate are high transaction costs, lack of transparency, fraud, and inefficient resource allocation. Leveraging a comprehensive review of the existing literature on crowdfunding economic activities and blockchain's impact on organizational governance, we propose a transformative socio-economic model based on digital tokens and decentralized co-governance. This ecosystem is marked by a tripartite community structure - the Labor, Capital, and Governance communities - each contributing uniquely to the ecosystem's operation. Our research unfolds the evolution of the DCC ecosystem through distinct phases, offering a novel understanding of socioeconomic dynamics in a decentralized digital world. It also delves into the intrica",
    "link": "http://arxiv.org/abs/2306.00869",
    "context": "Title: Blockchain-based Decentralized Co-governance: Innovations and Solutions for Sustainable Crowdfunding. (arXiv:2306.00869v1 [cs.CY])\nAbstract: This thesis provides an in-depth exploration of the Decentralized Co-governance Crowdfunding (DCC) Ecosystem, a novel solution addressing prevailing challenges in conventional crowdfunding methods faced by MSMEs and innovative projects. Among the problems it seeks to mitigate are high transaction costs, lack of transparency, fraud, and inefficient resource allocation. Leveraging a comprehensive review of the existing literature on crowdfunding economic activities and blockchain's impact on organizational governance, we propose a transformative socio-economic model based on digital tokens and decentralized co-governance. This ecosystem is marked by a tripartite community structure - the Labor, Capital, and Governance communities - each contributing uniquely to the ecosystem's operation. Our research unfolds the evolution of the DCC ecosystem through distinct phases, offering a novel understanding of socioeconomic dynamics in a decentralized digital world. It also delves into the intrica",
    "path": "papers/23/06/2306.00869.json",
    "total_tokens": 1001,
    "translated_title": "基于区块链的去中心化联合治理：可持续众筹的创新和解决方案。",
    "translated_abstract": "本论文深入探讨了去中心化联合治理众筹（DCC）生态系统，这是一种新的解决方案，旨在解决中小微企业和创新项目所面临的传统众筹方法中存在的问题。它试图缓解的问题包括高交易成本、缺乏透明度、欺诈和低效的资源分配。通过全面评估现有文献对众筹经济活动以及区块链对组织治理影响的研究，我们提出了一种基于数字代币和去中心化联合治理的转型社会经济模型。这个生态系统具有三方共治结构——劳动、资本和治理社区——每个社区在生态系统的运营中都有其独特的贡献。我们的研究展示了DCC生态系统的演变，提供了一种新的理解去中心化数字世界的社会经济动态。我们的研究还深入探讨了DCC生态系统不同阶段的内在复杂性和治理机制。",
    "tldr": "本论文提出了一种基于区块链的去中心化联合治理模型，旨在解决传统众筹方法中存在的问题，包括高交易成本、缺乏透明度、欺诈和低效的资源分配。这个模型通过三方共治结构实现，具有劳动、资本和治理社区，为中小微企业和创新项目提供可持续众筹的解决方案。",
    "en_tdlr": "This paper proposes a blockchain-based decentralized co-governance model to address issues in traditional crowdfunding methods, including high transaction costs, lack of transparency, fraud, and inefficient resource allocation. The model utilizes a tripartite community structure and digital tokens to provide sustainable crowdfunding solutions for MSMEs and innovative projects."
}