{
    "title": "A New Dataset and Empirical Study for Sentence Simplification in Chinese. (arXiv:2306.04188v1 [cs.CL])",
    "abstract": "Sentence Simplification is a valuable technique that can benefit language learners and children a lot. However, current research focuses more on English sentence simplification. The development of Chinese sentence simplification is relatively slow due to the lack of data. To alleviate this limitation, this paper introduces CSS, a new dataset for assessing sentence simplification in Chinese. We collect manual simplifications from human annotators and perform data analysis to show the difference between English and Chinese sentence simplifications. Furthermore, we test several unsupervised and zero/few-shot learning methods on CSS and analyze the automatic evaluation and human evaluation results. In the end, we explore whether Large Language Models can serve as high-quality Chinese sentence simplification systems by evaluating them on CSS.",
    "link": "http://arxiv.org/abs/2306.04188",
    "context": "Title: A New Dataset and Empirical Study for Sentence Simplification in Chinese. (arXiv:2306.04188v1 [cs.CL])\nAbstract: Sentence Simplification is a valuable technique that can benefit language learners and children a lot. However, current research focuses more on English sentence simplification. The development of Chinese sentence simplification is relatively slow due to the lack of data. To alleviate this limitation, this paper introduces CSS, a new dataset for assessing sentence simplification in Chinese. We collect manual simplifications from human annotators and perform data analysis to show the difference between English and Chinese sentence simplifications. Furthermore, we test several unsupervised and zero/few-shot learning methods on CSS and analyze the automatic evaluation and human evaluation results. In the end, we explore whether Large Language Models can serve as high-quality Chinese sentence simplification systems by evaluating them on CSS.",
    "path": "papers/23/06/2306.04188.json",
    "total_tokens": 778,
    "translated_title": "一种新的数据集和实证研究——中文句子简化",
    "translated_abstract": "句子简化是一项有益于语言学习者和儿童的重要技术。然而，当前的研究更多地关注英文句子的简化。由于缺乏数据，中文句子简化的发展相对较慢。为了缓解这一问题，本文介绍了CSS，一个评估中文句子简化的新数据集。我们收集了人类标注的手动简化，并进行了数据分析以展示中英文句子简化之间的差异。此外，我们在CSS上测试了几种无监督和零/少样本学习方法，并分析了自动评估和人类评估结果。最后，我们探讨了大语言模型是否能够作为高质量的中文句子简化系统，并在CSS上进行了评估。",
    "tldr": "本文介绍了新的中文句子简化数据集CSS，并测试了几种的自动评估方法和人工评估结果。同时，探讨了大型语言模型在中文句子简化方面的应用。",
    "en_tdlr": "This paper introduces a new dataset CSS for Chinese sentence simplification and evaluates various automatic evaluation methods and human evaluation results. In addition, it explores the applications of large language models in Chinese sentence simplification."
}