{
    "title": "DiPlomat: A Dialogue Dataset for Situated Pragmatic Reasoning. (arXiv:2306.09030v2 [cs.CL] UPDATED)",
    "abstract": "Pragmatic reasoning plays a pivotal role in deciphering implicit meanings that frequently arise in real-life conversations and is essential for the development of communicative social agents. In this paper, we introduce a novel challenge, DiPlomat, aiming at benchmarking machines' capabilities on pragmatic reasoning and situated conversational understanding. Compared with previous works that treat different figurative expressions (e.g. metaphor, sarcasm) as individual tasks, DiPlomat provides a cohesive framework towards general pragmatic understanding. Our dataset is created through the utilization of Amazon Mechanical Turk ( AMT ), resulting in a total of 4, 177 multi-turn dialogues. In conjunction with the dataset, we propose two tasks, Pragmatic Identification and Reasoning (PIR) and Conversational Question Answering (CQA). Experimental results with state-of-the-art (SOTA) neural architectures reveal several significant findings: 1) large language models ( LLMs) exhibit poor perfor",
    "link": "http://arxiv.org/abs/2306.09030",
    "context": "Title: DiPlomat: A Dialogue Dataset for Situated Pragmatic Reasoning. (arXiv:2306.09030v2 [cs.CL] UPDATED)\nAbstract: Pragmatic reasoning plays a pivotal role in deciphering implicit meanings that frequently arise in real-life conversations and is essential for the development of communicative social agents. In this paper, we introduce a novel challenge, DiPlomat, aiming at benchmarking machines' capabilities on pragmatic reasoning and situated conversational understanding. Compared with previous works that treat different figurative expressions (e.g. metaphor, sarcasm) as individual tasks, DiPlomat provides a cohesive framework towards general pragmatic understanding. Our dataset is created through the utilization of Amazon Mechanical Turk ( AMT ), resulting in a total of 4, 177 multi-turn dialogues. In conjunction with the dataset, we propose two tasks, Pragmatic Identification and Reasoning (PIR) and Conversational Question Answering (CQA). Experimental results with state-of-the-art (SOTA) neural architectures reveal several significant findings: 1) large language models ( LLMs) exhibit poor perfor",
    "path": "papers/23/06/2306.09030.json",
    "total_tokens": 1010,
    "translated_title": "DiPlomat: 用于情境语用推理的对话数据集",
    "translated_abstract": "语用推理在破解实际对话中经常出现的隐含含义方面起着关键作用，并且对于发展交际社会代理人至关重要。本文介绍了一个新的挑战——DiPlomat，旨在对机器的情境推理和对话理解能力进行基准测试。与将不同的比喻表达（例如比喻、讽刺）视为单独任务的先前工作相比，DiPlomat提供了一个统一的框架来实现一般的语用理解。我们的数据集通过利用亚马逊机械土耳其语（AMT）来创建，共有4,177个多轮对话。与数据集一起，我们提出了两个任务：语用识别和推理（PIR）和会话问答（CQA）。与最先进的（SOTA）神经架构进行的实验结果揭示了几个重要发现：1）大型语言模型（LLMs）表现不佳。",
    "tldr": "本文提出一个新的对话数据集DiPlomat，用于评测机器的情境推理和对话理解能力。与先前工作相比，DiPlomat提供了一个统一的框架来实现一般的语用理解。我们的数据集通过利用亚马逊机械土耳其语（AMT）来创建，共有4,177个多轮对话。与数据集一起，我们提出了两个任务：语用识别和推理（PIR）和会话问答（CQA）。",
    "en_tdlr": "This paper proposes a new dialogue dataset, DiPlomat, to evaluate machines' capabilities in pragmatic reasoning and situated conversational understanding. compared with previous works, DiPlomat provides a cohesive framework towards general pragmatic understanding. The dataset is created using Amazon Mechanical Turk (AMT), resulting in a total of 4,177 multi-turn dialogues. Two tasks, Pragmatic Identification and Reasoning (PIR) and Conversational Question Answering (CQA), are proposed."
}