{
    "title": "Transforming a Quadruped into a Guide Robot for the Visually Impaired: Formalizing Wayfinding, Interaction Modeling, and Safety Mechanism. (arXiv:2306.14055v1 [cs.RO])",
    "abstract": "This paper explores the principles for transforming a quadrupedal robot into a guide robot for individuals with visual impairments. A guide robot has great potential to resolve the limited availability of guide animals that are accessible to only two to three percent of the potential blind or visually impaired (BVI) users. To build a successful guide robot, our paper explores three key topics: (1) formalizing the navigation mechanism of a guide dog and a human, (2) developing a data-driven model of their interaction, and (3) improving user safety. First, we formalize the wayfinding task of the human-guide robot team using Markov Decision Processes based on the literature and interviews. Then we collect real human-robot interaction data from three visually impaired and six sighted people and develop an interaction model called the ``Delayed Harness'' to effectively simulate the navigation behaviors of the team. Additionally, we introduce an action shielding mechanism to enhance user saf",
    "link": "http://arxiv.org/abs/2306.14055",
    "context": "Title: Transforming a Quadruped into a Guide Robot for the Visually Impaired: Formalizing Wayfinding, Interaction Modeling, and Safety Mechanism. (arXiv:2306.14055v1 [cs.RO])\nAbstract: This paper explores the principles for transforming a quadrupedal robot into a guide robot for individuals with visual impairments. A guide robot has great potential to resolve the limited availability of guide animals that are accessible to only two to three percent of the potential blind or visually impaired (BVI) users. To build a successful guide robot, our paper explores three key topics: (1) formalizing the navigation mechanism of a guide dog and a human, (2) developing a data-driven model of their interaction, and (3) improving user safety. First, we formalize the wayfinding task of the human-guide robot team using Markov Decision Processes based on the literature and interviews. Then we collect real human-robot interaction data from three visually impaired and six sighted people and develop an interaction model called the ``Delayed Harness'' to effectively simulate the navigation behaviors of the team. Additionally, we introduce an action shielding mechanism to enhance user saf",
    "path": "papers/23/06/2306.14055.json",
    "total_tokens": 849,
    "translated_title": "将四足机器人转化为视障人士导航机器人：形式化导航、交互建模和安全机制",
    "translated_abstract": "本论文探讨了将四足机器人转化为服务于视障人士的导航机器人的原则。导航机器人有很大的潜力解决仅有 2% 到 3% 的潜在盲或视力障碍用户可以使用的导盲动物的有限状况。为了建造一台成功的导航机器人，我们探讨了三个关键主题：(1) 形式化导盲犬和人的导航机制，(2) 开发一种基于数据的模型来描述他们的交互，(3) 提高用户的安全性。",
    "tldr": "本论文探讨了将四足机器人转化为导航机器人的三个关键主题，并介绍了一种名为“延迟挽具”的交互模型以及一种行动屏蔽机制来提高用户的安全性。",
    "en_tdlr": "This paper explores the principles for transforming a quadrupedal robot into a guide robot for individuals with visual impairments, with a major focus on formalizing wayfinding, developing a data-driven model of human-robot interaction, and improving user safety through an action shielding mechanism. The paper introduces the \"Delayed Harness\" interaction model for simulating navigation behaviors and provides key insights to build a successful guide robot."
}