{
    "title": "A Circuit Complexity Formulation of Algorithmic Information Theory. (arXiv:2306.14087v1 [cs.LG])",
    "abstract": "Inspired by Solomonoffs theory of inductive inference, we propose a prior based on circuit complexity. There are several advantages to this approach. First, it relies on a complexity measure that does not depend on the choice of UTM. There is one universal definition for Boolean circuits involving an universal operation such as nand with simple conversions to alternative definitions such as and, or, and not. Second, there is no analogue of the halting problem. The output value of a circuit can be calculated recursively by computer in time proportional to the number of gates, while a short program may run for a very long time. Our prior assumes that a Boolean function, or equivalently, Boolean string of fixed length, is generated by some Bayesian mixture of circuits. This model is appropriate for learning Boolean functions from partial information, a problem often encountered within machine learning as \"binary classification.\" We argue that an inductive bias towards simple explanations ",
    "link": "http://arxiv.org/abs/2306.14087",
    "context": "Title: A Circuit Complexity Formulation of Algorithmic Information Theory. (arXiv:2306.14087v1 [cs.LG])\nAbstract: Inspired by Solomonoffs theory of inductive inference, we propose a prior based on circuit complexity. There are several advantages to this approach. First, it relies on a complexity measure that does not depend on the choice of UTM. There is one universal definition for Boolean circuits involving an universal operation such as nand with simple conversions to alternative definitions such as and, or, and not. Second, there is no analogue of the halting problem. The output value of a circuit can be calculated recursively by computer in time proportional to the number of gates, while a short program may run for a very long time. Our prior assumes that a Boolean function, or equivalently, Boolean string of fixed length, is generated by some Bayesian mixture of circuits. This model is appropriate for learning Boolean functions from partial information, a problem often encountered within machine learning as \"binary classification.\" We argue that an inductive bias towards simple explanations ",
    "path": "papers/23/06/2306.14087.json",
    "total_tokens": 791,
    "translated_title": "一种基于电路复杂度的算法信息论复杂性表述",
    "translated_abstract": "在Solomonoffs归纳推理理论的启发下，我们提出了一种基于电路复杂度的先验知识。该方法有几个优点。首先，它依赖于一个复杂度衡量方式，不依赖于UTM的选择。真值表现为元件之间的运算而不是程序。其次，不存在停机问题。电路的输出值可以通过递归计算机来计算，时间与电路内门数成正比。我们的先验假设一个布尔函数，或者等效的编码为固定长度的布尔串，是由某个混合模型生成的。这个模型适用于从部分信息中学习布尔函数，通常在机器学习中遇到的“二元分类”问题。主张对简单解释具有归纳偏见。",
    "tldr": "该论文提出了一种基于电路复杂度的先验知识，旨在解决学习布尔函数的问题，重点是对简单解释具有归纳偏见。",
    "en_tdlr": "This paper proposes a prior based on circuit complexity for learning Boolean functions, which is appropriate for binary classification problems in machine learning, and emphasizes an inductive bias towards simple explanations."
}