{
    "title": "Federated Deep Learning for Intrusion Detection in IoT Networks. (arXiv:2306.02715v2 [cs.CR] UPDATED)",
    "abstract": "The vast increase of IoT technologies and the ever-evolving attack vectors and threat actors have increased cyber-security risks dramatically. Novel attacks can compromise IoT devices to gain access to sensitive data or control them to deploy further malicious activities. The detection of novel attacks often relies upon AI solutions. A common approach to implementing AI-based IDS in distributed IoT systems is in a centralised manner. However, this approach may violate data privacy and secrecy. In addition, centralised data collection prohibits the scale-up of IDSs. Therefore, intrusion detection solutions in IoT ecosystems need to move towards a decentralised direction. FL has attracted significant interest in recent years due to its ability to perform collaborative learning while preserving data confidentiality and locality. Nevertheless, most FL-based IDS for IoT systems are designed under unrealistic data distribution conditions. To that end, we design an experiment representative o",
    "link": "http://arxiv.org/abs/2306.02715",
    "context": "Title: Federated Deep Learning for Intrusion Detection in IoT Networks. (arXiv:2306.02715v2 [cs.CR] UPDATED)\nAbstract: The vast increase of IoT technologies and the ever-evolving attack vectors and threat actors have increased cyber-security risks dramatically. Novel attacks can compromise IoT devices to gain access to sensitive data or control them to deploy further malicious activities. The detection of novel attacks often relies upon AI solutions. A common approach to implementing AI-based IDS in distributed IoT systems is in a centralised manner. However, this approach may violate data privacy and secrecy. In addition, centralised data collection prohibits the scale-up of IDSs. Therefore, intrusion detection solutions in IoT ecosystems need to move towards a decentralised direction. FL has attracted significant interest in recent years due to its ability to perform collaborative learning while preserving data confidentiality and locality. Nevertheless, most FL-based IDS for IoT systems are designed under unrealistic data distribution conditions. To that end, we design an experiment representative o",
    "path": "papers/23/06/2306.02715.json",
    "total_tokens": 1151,
    "translated_title": "基于联邦深度学习的物联网入侵检测",
    "translated_abstract": "物联网技术的大幅增长和攻击向量和威胁行为的不断演化，显著增加了网络安全风险。新型攻击可能会危及物联网设备，以获取对敏感数据的访问或控制它们以部署进一步的恶意活动。检测新型攻击通常依赖于人工智能解决方案。在分布式物联网系统中实现基于AI的入侵检测的常见方法是以集中方式实现。然而，此方法可能会侵犯数据隐私和保密性。此外，集中式数据采集禁止IDS的扩展。因此，物联网生态系统中的入侵检测解决方案需要朝分散化方向发展。联邦学习由于能够在保留数据机密性和局部性的同时进行协作学习而受到了广泛的关注。尽管如此，大多数基于联邦学习的物联网系统IDS都是在不切实际的数据分布条件下设计的。为此，我们设计了一个代表物联网生态系统中实际数据分布的实验，并提出了一种基于联邦深度学习（FDL）框架的物联网入侵检测方法。我们的方法整合了CNN模型和门控机制，以实现有效的模型收敛，同时保护数据隐私和局部性。实验结果表明，我们的FDL框架显著优于其他最先进的方法，表明其在实际物联网入侵检测应用中具有潜力。",
    "tldr": "本研究提出了一种基于联邦深度学习的入侵检测框架，可在保护数据隐私和局部性的同时实现高效的模型收敛，该框架在物联网入侵检测应用中具有潜力。",
    "en_tdlr": "This paper proposes a Federated Deep Learning (FDL) framework for intrusion detection in IoT networks, which preserves data privacy and locality and achieves efficient model convergence, and outperforms other state-of-the-art approaches, showing great potential in real-world IoT intrusion detection applications."
}