{
    "title": "Stable Vectorization of Multiparameter Persistent Homology using Signed Barcodes as Measures. (arXiv:2306.03801v1 [cs.LG])",
    "abstract": "Persistent homology (PH) provides topological descriptors for geometric data, such as weighted graphs, which are interpretable, stable to perturbations, and invariant under, e.g., relabeling. Most applications of PH focus on the one-parameter case -- where the descriptors summarize the changes in topology of data as it is filtered by a single quantity of interest -- and there is now a wide array of methods enabling the use of one-parameter PH descriptors in data science, which rely on the stable vectorization of these descriptors as elements of a Hilbert space. Although the multiparameter PH (MPH) of data that is filtered by several quantities of interest encodes much richer information than its one-parameter counterpart, the scarceness of stability results for MPH descriptors has so far limited the available options for the stable vectorization of MPH. In this paper, we aim to bring together the best of both worlds by showing how the interpretation of signed barcodes -- a recent famil",
    "link": "http://arxiv.org/abs/2306.03801",
    "context": "Title: Stable Vectorization of Multiparameter Persistent Homology using Signed Barcodes as Measures. (arXiv:2306.03801v1 [cs.LG])\nAbstract: Persistent homology (PH) provides topological descriptors for geometric data, such as weighted graphs, which are interpretable, stable to perturbations, and invariant under, e.g., relabeling. Most applications of PH focus on the one-parameter case -- where the descriptors summarize the changes in topology of data as it is filtered by a single quantity of interest -- and there is now a wide array of methods enabling the use of one-parameter PH descriptors in data science, which rely on the stable vectorization of these descriptors as elements of a Hilbert space. Although the multiparameter PH (MPH) of data that is filtered by several quantities of interest encodes much richer information than its one-parameter counterpart, the scarceness of stability results for MPH descriptors has so far limited the available options for the stable vectorization of MPH. In this paper, we aim to bring together the best of both worlds by showing how the interpretation of signed barcodes -- a recent famil",
    "path": "papers/23/06/2306.03801.json",
    "total_tokens": 867,
    "translated_title": "签名条码作为度量的多参数持久同调的稳定向量化",
    "translated_abstract": "持久同调（PH）提供了几何数据（例如加权图）的拓扑描述符，它们是可解释的，对扰动稳定，并具有诸如重标记等不变性。大多数PH应用关注一参数情况——描述符总结数据的拓扑随着单个感兴趣因素的滤波而发生变化；现在，有各种方法使得一参数PH描述符在数据科学中得到应用，并且依赖于将这些描述符稳定向量化为希尔伯特空间的元素。虽然由几个感兴趣因素过滤的数据的多参数PH（MPH）编码比其一参数同型的信息更丰富，但迄今为止，MPH描述符的稳定性结果的稀缺性已经限制了MPH的稳定向量化的可用选项。在本文中，我们旨在通过展示如何解释签名条码来集结两方面的优点。",
    "tldr": "本研究提出了使用签名条码来稳定向量化多参数持久同调，将多参数持久同调的丰富信息和稳定向量化的优势相结合。"
}