{
    "title": "Can We Trust AI-Generated Educational Content? Comparative Analysis of Human and AI-Generated Learning Resources. (arXiv:2306.10509v2 [cs.HC] UPDATED)",
    "abstract": "As an increasing number of students move to online learning platforms that deliver personalized learning experiences, there is a great need for the production of high-quality educational content. Large language models (LLMs) appear to offer a promising solution to the rapid creation of learning materials at scale, reducing the burden on instructors. In this study, we investigated the potential for LLMs to produce learning resources in an introductory programming context, by comparing the quality of the resources generated by an LLM with those created by students as part of a learnersourcing activity. Using a blind evaluation, students rated the correctness and helpfulness of resources generated by AI and their peers, after both were initially provided with identical exemplars. Our results show that the quality of AI-generated resources, as perceived by students, is equivalent to the quality of resources generated by their peers. This suggests that AI-generated resources may serve as vi",
    "link": "http://arxiv.org/abs/2306.10509",
    "context": "Title: Can We Trust AI-Generated Educational Content? Comparative Analysis of Human and AI-Generated Learning Resources. (arXiv:2306.10509v2 [cs.HC] UPDATED)\nAbstract: As an increasing number of students move to online learning platforms that deliver personalized learning experiences, there is a great need for the production of high-quality educational content. Large language models (LLMs) appear to offer a promising solution to the rapid creation of learning materials at scale, reducing the burden on instructors. In this study, we investigated the potential for LLMs to produce learning resources in an introductory programming context, by comparing the quality of the resources generated by an LLM with those created by students as part of a learnersourcing activity. Using a blind evaluation, students rated the correctness and helpfulness of resources generated by AI and their peers, after both were initially provided with identical exemplars. Our results show that the quality of AI-generated resources, as perceived by students, is equivalent to the quality of resources generated by their peers. This suggests that AI-generated resources may serve as vi",
    "path": "papers/23/06/2306.10509.json",
    "total_tokens": 823,
    "translated_title": "我们能相信AI生成的教育内容吗？人工智能和人类生成的学习资源的比较分析",
    "translated_abstract": "随着越来越多的学生转向提供个性化学习体验的在线学习平台，对高质量教育内容的需求日益增长。大型语言模型（LLMs）似乎为快速创建大规模学习材料提供了有希望的解决方案，减轻了教师的负担。在本研究中，我们通过比较LLMs生成的资源与学生作为学习来源的一部分创建的资源的质量，在入门编程语境下研究了LLMs生成学习资源的潜力。在受试者报告评估中，学生在初步提供相同示例后评估了AI和同学生成的资源的正确性和帮助程度。我们的结果表明，学生感知到的AI生成资源的质量与同学生成的资源的质量相当。这表明AI生成的资源可能作为辅助学习资料。",
    "tldr": "AI-generated educational content has been found to be perceived as equivalent in quality to content created by students, suggesting that AI-generated resources may serve as viable learning materials."
}