{
    "title": "Building the Bridge of Schr\\\"odinger: A Continuous Entropic Optimal Transport Benchmark. (arXiv:2306.10161v2 [cs.LG] UPDATED)",
    "abstract": "Over the last several years, there has been significant progress in developing neural solvers for the Schr\\\"odinger Bridge (SB) problem and applying them to generative modelling. This new research field is justifiably fruitful as it is interconnected with the practically well-performing diffusion models and theoretically grounded entropic optimal transport (EOT). Still, the area lacks non-trivial tests allowing a researcher to understand how well the methods solve SB or its equivalent continuous EOT problem. We fill this gap and propose a novel way to create pairs of probability distributions for which the ground truth OT solution is known by the construction. Our methodology is generic and works for a wide range of OT formulations, in particular, it covers the EOT which is equivalent to SB (the main interest of our study). This development allows us to create continuous benchmark distributions with the known EOT and SB solutions on high-dimensional spaces such as spaces of images. As ",
    "link": "http://arxiv.org/abs/2306.10161",
    "context": "Title: Building the Bridge of Schr\\\"odinger: A Continuous Entropic Optimal Transport Benchmark. (arXiv:2306.10161v2 [cs.LG] UPDATED)\nAbstract: Over the last several years, there has been significant progress in developing neural solvers for the Schr\\\"odinger Bridge (SB) problem and applying them to generative modelling. This new research field is justifiably fruitful as it is interconnected with the practically well-performing diffusion models and theoretically grounded entropic optimal transport (EOT). Still, the area lacks non-trivial tests allowing a researcher to understand how well the methods solve SB or its equivalent continuous EOT problem. We fill this gap and propose a novel way to create pairs of probability distributions for which the ground truth OT solution is known by the construction. Our methodology is generic and works for a wide range of OT formulations, in particular, it covers the EOT which is equivalent to SB (the main interest of our study). This development allows us to create continuous benchmark distributions with the known EOT and SB solutions on high-dimensional spaces such as spaces of images. As ",
    "path": "papers/23/06/2306.10161.json",
    "total_tokens": 924,
    "translated_title": "构建Schrödinger的桥梁：一种连续熵最优传输的基准测试",
    "translated_abstract": "在过去几年中，人们在开发用于Schrödinger桥问题的神经求解器方面取得了重大进展，并将其应用于生成模型。这一新的研究领域与在实践上表现良好的扩散模型和在理论上有基础的熵最优传输相互关联。尽管如此，该领域缺乏非平凡测试，无法让研究人员了解这些方法在解决SB或其等效连续EOT问题上的表现如何。我们填补了这一空白，并提出了一种新的方法来创建一对已知地面真值OT解的概率分布。我们的方法是通用的，适用于广泛的OT公式，尤其是涵盖了与SB等效的EOT（我们研究的主要兴趣）。这一发展使我们能够在高维空间（如图像空间）上创建具有已知EOT和SB解的连续基准分布。",
    "tldr": "本文提出了一种用于构建连续基准分布的方法，该分布具有已知的熵最优传输和Schrödinger桥解。这填补了在这一研究领域参数选择方面的空白，并为研究人员提供了测试传输模型性能的一种方法。",
    "en_tdlr": "This paper proposes a method for constructing continuous benchmark distributions with known optimal transport and Schrödinger bridge solutions. This fills a gap in the field of research and provides researchers with a way to test the performance of transport models."
}