{
    "title": "Functional Causal Bayesian Optimization. (arXiv:2306.06409v1 [stat.ML])",
    "abstract": "We propose functional causal Bayesian optimization (fCBO), a method for finding interventions that optimize a target variable in a known causal graph. fCBO extends the CBO family of methods to enable functional interventions, which set a variable to be a deterministic function of other variables in the graph. fCBO models the unknown objectives with Gaussian processes whose inputs are defined in a reproducing kernel Hilbert space, thus allowing to compute distances among vector-valued functions. In turn, this enables to sequentially select functions to explore by maximizing an expected improvement acquisition functional while keeping the typical computational tractability of standard BO settings. We introduce graphical criteria that establish when considering functional interventions allows attaining better target effects, and conditions under which selected interventions are also optimal for conditional target effects. We demonstrate the benefits of the method in a synthetic and in a r",
    "link": "http://arxiv.org/abs/2306.06409",
    "context": "Title: Functional Causal Bayesian Optimization. (arXiv:2306.06409v1 [stat.ML])\nAbstract: We propose functional causal Bayesian optimization (fCBO), a method for finding interventions that optimize a target variable in a known causal graph. fCBO extends the CBO family of methods to enable functional interventions, which set a variable to be a deterministic function of other variables in the graph. fCBO models the unknown objectives with Gaussian processes whose inputs are defined in a reproducing kernel Hilbert space, thus allowing to compute distances among vector-valued functions. In turn, this enables to sequentially select functions to explore by maximizing an expected improvement acquisition functional while keeping the typical computational tractability of standard BO settings. We introduce graphical criteria that establish when considering functional interventions allows attaining better target effects, and conditions under which selected interventions are also optimal for conditional target effects. We demonstrate the benefits of the method in a synthetic and in a r",
    "path": "papers/23/06/2306.06409.json",
    "total_tokens": 932,
    "translated_title": "功能因果贝叶斯优化",
    "translated_abstract": "本文提出了一种名为“功能因果贝叶斯优化”（fCBO）的方法，用于寻找在已知因果图中优化目标变量的干预方法。fCBO扩展了CBO方法族，以实现功能性干预，即将变量设置为其他变量的确定性函数。fCBO使用高斯过程对未知目标进行建模，其输入在再生核希尔伯特空间中定义，从而可以计算向量值函数之间的距离。反过来，这使得可以通过最大化预期改进获取收购收益，同时保持标准BO设置的典型计算可行性，以便顺序选择要探索的函数。我们介绍了图形标准，以确定考虑功能干预是否允许实现更好的目标效果，并确定选择的干预是否也适用于条件目标效果的最优解。我们在社交网络中的在线广告活动和合成应用中展示了该方法的优势。",
    "tldr": "提出功能因果贝叶斯优化（fCBO）方法用于已知因果图中优化目标变量的干预方法。该方法扩展了CBO方法族，使用高斯过程对未知目标进行建模，在再生核希尔伯特空间中定义输入并计算向量值函数之间的距离。演示了在社交网络中的在线广告活动和合成应用中该方法的优点。",
    "en_tdlr": "The functional causal Bayesian optimization (fCBO) method is proposed for finding interventions that optimize a target variable in a known causal graph. It extends the CBO family of methods to enable functional interventions, and uses Gaussian processes to model unknown objectives while keeping computational tractability. The method is demonstrated in real-world applications, such as optimizing an online advertisement campaign in a social network."
}