{
    "title": "EmoUS: Simulating User Emotions in Task-Oriented Dialogues. (arXiv:2306.01579v1 [cs.CL])",
    "abstract": "Existing user simulators (USs) for task-oriented dialogue systems only model user behaviour on semantic and natural language levels without considering the user persona and emotions. Optimising dialogue systems with generic user policies, which cannot model diverse user behaviour driven by different emotional states, may result in a high drop-off rate when deployed in the real world. Thus, we present EmoUS, a user simulator that learns to simulate user emotions alongside user behaviour. EmoUS generates user emotions, semantic actions, and natural language responses based on the user goal, the dialogue history, and the user persona. By analysing what kind of system behaviour elicits what kind of user emotions, we show that EmoUS can be used as a probe to evaluate a variety of dialogue systems and in particular their effect on the user's emotional state. Developing such methods is important in the age of large language model chat-bots and rising ethical concerns.",
    "link": "http://arxiv.org/abs/2306.01579",
    "context": "Title: EmoUS: Simulating User Emotions in Task-Oriented Dialogues. (arXiv:2306.01579v1 [cs.CL])\nAbstract: Existing user simulators (USs) for task-oriented dialogue systems only model user behaviour on semantic and natural language levels without considering the user persona and emotions. Optimising dialogue systems with generic user policies, which cannot model diverse user behaviour driven by different emotional states, may result in a high drop-off rate when deployed in the real world. Thus, we present EmoUS, a user simulator that learns to simulate user emotions alongside user behaviour. EmoUS generates user emotions, semantic actions, and natural language responses based on the user goal, the dialogue history, and the user persona. By analysing what kind of system behaviour elicits what kind of user emotions, we show that EmoUS can be used as a probe to evaluate a variety of dialogue systems and in particular their effect on the user's emotional state. Developing such methods is important in the age of large language model chat-bots and rising ethical concerns.",
    "path": "papers/23/06/2306.01579.json",
    "total_tokens": 874,
    "translated_title": "EmoUS: 在任务导向对话中模拟用户情感",
    "translated_abstract": "现有的任务导向对话系统用户模拟器 (USs) 仅在语义和自然语言层面上模拟用户行为，而不考虑用户角色和情感。通过优化与各种情感状态驱动的多样化用户行为有关的通用用户策略，可能会导致在实际部署时高失效率。因此，我们提出了 EmoUS，这是一种可以学习在用户行为中模拟用户情感的用户模拟器。EmoUS 基于用户目标、对话历史和用户角色生成用户情感、语义动作和自然语言回复。通过分析什么样的系统行为引起什么样的用户情感，我们展示了 EmoUS 能够被用作探测器来评估各种对话系统，尤其是它们对用户情感状态的影响。在大型语言模型聊天机器人和不断增长的伦理关切的时代，开发这种方法非常重要。",
    "tldr": "EmoUS是一种用户模拟器，可以模拟用户在任务导向对话中的行为和情感反应，通过分析用户情感与系统行为的关系来评价不同对话系统的效果。",
    "en_tdlr": "EmoUS is a user simulator that simulates user behavior and emotional reactions in task-oriented dialogues, and can be used to evaluate the effectiveness of different dialogue systems by analyzing the relationship between user emotions and system behavior. It is important in the era of large language model chat-bots and rising ethical concerns."
}