{
    "title": "Corrector Operator to Enhance Accuracy and Reliability of Neural Operator Surrogates of Nonlinear Variational Boundary-Value Problems. (arXiv:2306.12047v1 [math.NA])",
    "abstract": "This work focuses on developing methods for approximating the solution operators of a class of parametric partial differential equations via neural operators. Neural operators have several challenges, including the issue of generating appropriate training data, cost-accuracy trade-offs, and nontrivial hyperparameter tuning. The unpredictability of the accuracy of neural operators impacts their applications in downstream problems of inference, optimization, and control. A framework is proposed based on the linear variational problem that gives the correction to the prediction furnished by neural operators. The operator associated with the corrector problem is referred to as the corrector operator. Numerical results involving a nonlinear diffusion model in two dimensions with PCANet-type neural operators show almost two orders of increase in the accuracy of approximations when neural operators are corrected using the proposed scheme. Further, topology optimization involving a nonlinear d",
    "link": "http://arxiv.org/abs/2306.12047",
    "context": "Title: Corrector Operator to Enhance Accuracy and Reliability of Neural Operator Surrogates of Nonlinear Variational Boundary-Value Problems. (arXiv:2306.12047v1 [math.NA])\nAbstract: This work focuses on developing methods for approximating the solution operators of a class of parametric partial differential equations via neural operators. Neural operators have several challenges, including the issue of generating appropriate training data, cost-accuracy trade-offs, and nontrivial hyperparameter tuning. The unpredictability of the accuracy of neural operators impacts their applications in downstream problems of inference, optimization, and control. A framework is proposed based on the linear variational problem that gives the correction to the prediction furnished by neural operators. The operator associated with the corrector problem is referred to as the corrector operator. Numerical results involving a nonlinear diffusion model in two dimensions with PCANet-type neural operators show almost two orders of increase in the accuracy of approximations when neural operators are corrected using the proposed scheme. Further, topology optimization involving a nonlinear d",
    "path": "papers/23/06/2306.12047.json",
    "total_tokens": 1324,
    "translated_title": "使用Corrector操作符增强神经算子代理非线性变分边界值问题的准确度和可靠性",
    "translated_abstract": "本文旨在开发一类参数偏微分方程解算符的逼近方法，即通过神经算子的方式。神经算子有几个挑战，包括生成适当的训练数据、成本-准确度权衡和非平凡的超参数调整问题。神经算子准确度的不可预测性影响了它们在推理、优化和控制等后续问题中的应用。本文提出了一个基于线性变分问题的框架，给出了神经算子预测结果的校正值。与校正问题相关的算子称为校正算子。通过使用提出的方案对采用PCANet型神经算子的二维非线性扩散模型进行的数值实验结果显示，当使用校正方法对神经算子进行校正时，逼近的准确度近乎提高了两个数量级。此外，涉及非线性d之上的拓扑优化问题也得到了探讨。",
    "tldr": "本文提供了一种基于Corrector操作符的框架，以增强神经算子代理非线性变分边界值问题的准确度和可靠性。使用该方案对于PCANet型神经算子的二维非线性扩散模型的数值实验结果显示，逼近的准确度近乎提高了两个数量级，并且还在涉及非线性d之上的拓扑优化问题中得到了探讨。",
    "en_tdlr": "This paper proposes a framework based on the Corrector operator to enhance the accuracy and reliability of neural operators in approximating the solution operators of a class of parametric partial differential equations. The proposed method shows a significant improvement in accuracy with almost two orders of increase in approximation when correcting neural operators for a nonlinear diffusion model using PCANet-type neural operators. The method is also discussed in the context of a nonlinear d-dimensional topology optimization problem."
}