{
    "title": "Exploring the Compositional Generalization in Context Dependent Text-to-SQL Parsing. (arXiv:2306.04480v1 [cs.CL])",
    "abstract": "In the context-dependent Text-to-SQL task, the generated SQL statements are refined iteratively based on the user input utterance from each interaction. The input text from each interaction can be viewed as component modifications to the previous SQL statements, which could be further extracted as the modification patterns. Since these modification patterns could also be combined with other SQL statements, the models are supposed to have the compositional generalization to these novel combinations. This work is the first exploration of compositional generalization in context-dependent Text-to-SQL scenarios. To facilitate related studies, we constructed two challenging benchmarks named \\textsc{CoSQL-CG} and \\textsc{SParC-CG} by recombining the modification patterns and existing SQL statements. The following experiments show that all current models struggle on our proposed benchmarks. Furthermore, we found that better aligning the previous SQL statements with the input utterance could gi",
    "link": "http://arxiv.org/abs/2306.04480",
    "context": "Title: Exploring the Compositional Generalization in Context Dependent Text-to-SQL Parsing. (arXiv:2306.04480v1 [cs.CL])\nAbstract: In the context-dependent Text-to-SQL task, the generated SQL statements are refined iteratively based on the user input utterance from each interaction. The input text from each interaction can be viewed as component modifications to the previous SQL statements, which could be further extracted as the modification patterns. Since these modification patterns could also be combined with other SQL statements, the models are supposed to have the compositional generalization to these novel combinations. This work is the first exploration of compositional generalization in context-dependent Text-to-SQL scenarios. To facilitate related studies, we constructed two challenging benchmarks named \\textsc{CoSQL-CG} and \\textsc{SParC-CG} by recombining the modification patterns and existing SQL statements. The following experiments show that all current models struggle on our proposed benchmarks. Furthermore, we found that better aligning the previous SQL statements with the input utterance could gi",
    "path": "papers/23/06/2306.04480.json",
    "total_tokens": 913,
    "tldr": "本篇论文首次探索了上下文相关文本到SQL解析中的组合泛化问题，并提出了两个具有挑战性的基准测试，结果表明所有模型都在这些测试中表现不佳。此外，对齐前面的SQL语句与输入话语可以提高模型性能。"
}