{
    "title": "Revealing the impact of social circumstances on the selection of cancer therapy through natural language processing of social work notes. (arXiv:2306.09877v1 [cs.CL])",
    "abstract": "We aimed to investigate the impact of social circumstances on cancer therapy selection using natural language processing to derive insights from social worker documentation. We developed and employed a Bidirectional Encoder Representations from Transformers (BERT) based approach, using a hierarchical multi-step BERT model (BERT-MS) to predict the prescription of targeted cancer therapy to patients based solely on documentation by clinical social workers. Our corpus included free-text clinical social work notes, combined with medication prescription information, for all patients treated for breast cancer. We conducted a feature importance analysis to pinpoint the specific social circumstances that impact cancer therapy selection. Using only social work notes, we consistently predicted the administration of targeted therapies, suggesting systematic differences in treatment selection exist due to non-clinical factors. The UCSF-BERT model, pretrained on clinical text at UCSF, outperformed ",
    "link": "http://arxiv.org/abs/2306.09877",
    "context": "Title: Revealing the impact of social circumstances on the selection of cancer therapy through natural language processing of social work notes. (arXiv:2306.09877v1 [cs.CL])\nAbstract: We aimed to investigate the impact of social circumstances on cancer therapy selection using natural language processing to derive insights from social worker documentation. We developed and employed a Bidirectional Encoder Representations from Transformers (BERT) based approach, using a hierarchical multi-step BERT model (BERT-MS) to predict the prescription of targeted cancer therapy to patients based solely on documentation by clinical social workers. Our corpus included free-text clinical social work notes, combined with medication prescription information, for all patients treated for breast cancer. We conducted a feature importance analysis to pinpoint the specific social circumstances that impact cancer therapy selection. Using only social work notes, we consistently predicted the administration of targeted therapies, suggesting systematic differences in treatment selection exist due to non-clinical factors. The UCSF-BERT model, pretrained on clinical text at UCSF, outperformed ",
    "path": "papers/23/06/2306.09877.json",
    "total_tokens": 811,
    "translated_title": "通过对社会工作记录的自然语言处理揭示社会情境对癌症治疗选择的影响",
    "translated_abstract": "本文旨在调查社会情境对癌症治疗选择的影响，并通过对社工文档的自然语言处理来获得洞见。我们开发并采用了基于双向编码器表示转换器（BERT）的方法，使用分层多步BERT模型（BERT-MS）仅基于临床社会工作者的文档预测了治疗靶向癌症的处方。我们的语料库包括治疗乳腺癌的所有患者的自由文本临床社会工作记录，并结合药物处方信息。我们进行了特征重要性分析，以确定影响癌症治疗选择的具体社会情境。仅使用社工记录，我们一直预测靶向治疗的使用，表明由于非临床因素而存在治疗选择的系统差异。",
    "tldr": "通过自然语言处理社工记录，揭示了社会情境对选择癌症治疗的影响。",
    "en_tdlr": "This paper investigates the impact of social circumstances on cancer therapy selection and uses natural language processing of social worker documentation to gain insights. The findings suggest systematic differences in treatment selection exist due to non-clinical factors."
}