{
    "title": "Coordinated Dynamic Bidding in Repeated Second-Price Auctions with Budgets. (arXiv:2306.07709v1 [cs.GT])",
    "abstract": "In online ad markets, a rising number of advertisers are employing bidding agencies to participate in ad auctions. These agencies are specialized in designing online algorithms and bidding on behalf of their clients. Typically, an agency usually has information on multiple advertisers, so she can potentially coordinate bids to help her clients achieve higher utilities than those under independent bidding.  In this paper, we study coordinated online bidding algorithms in repeated second-price auctions with budgets. We propose algorithms that guarantee every client a higher utility than the best she can get under independent bidding. We show that these algorithms achieve maximal coalition welfare and discuss bidders' incentives to misreport their budgets, in symmetric cases. Our proofs combine the techniques of online learning and equilibrium analysis, overcoming the difficulty of competing with a multi-dimensional benchmark. The performance of our algorithms is further evaluated by expe",
    "link": "http://arxiv.org/abs/2306.07709",
    "context": "Title: Coordinated Dynamic Bidding in Repeated Second-Price Auctions with Budgets. (arXiv:2306.07709v1 [cs.GT])\nAbstract: In online ad markets, a rising number of advertisers are employing bidding agencies to participate in ad auctions. These agencies are specialized in designing online algorithms and bidding on behalf of their clients. Typically, an agency usually has information on multiple advertisers, so she can potentially coordinate bids to help her clients achieve higher utilities than those under independent bidding.  In this paper, we study coordinated online bidding algorithms in repeated second-price auctions with budgets. We propose algorithms that guarantee every client a higher utility than the best she can get under independent bidding. We show that these algorithms achieve maximal coalition welfare and discuss bidders' incentives to misreport their budgets, in symmetric cases. Our proofs combine the techniques of online learning and equilibrium analysis, overcoming the difficulty of competing with a multi-dimensional benchmark. The performance of our algorithms is further evaluated by expe",
    "path": "papers/23/06/2306.07709.json",
    "total_tokens": 853,
    "translated_title": "带预算的重复二价拍卖中的协调动态出价",
    "translated_abstract": "在在线广告市场中，越来越多的广告主雇用竞价代理来参与广告拍卖。这些代理专门设计在线算法并代表其客户出价。通常情况下，代理通常拥有多个广告主的信息，因此她有可能协调出价，帮助她的客户获得比独立出价更高的效用。本文研究了带预算的重复二价拍卖中的协调在线竞价算法。我们提出了算法，保证每个客户的效用都比独立竞价获得的最优效用高。我们证明这些算法实现了最大的联盟福利，并讨论了投标者在对称情况下误报预算的激励机制。我们的证明结合了在线学习和平衡分析技术，克服了与多维基准竞争的困难。我们进一步通过实验评估了我们算法的性能。",
    "tldr": "本文研究了带预算的重复二价拍卖中的协调在线竞价算法，提出了能够保证每个客户效用最大化的算法，并证明实现了最大的联盟福利。"
}