{
    "title": "Leveraging Large Language Models for Topic Classification in the Domain of Public Affairs. (arXiv:2306.02864v2 [cs.AI] UPDATED)",
    "abstract": "The analysis of public affairs documents is crucial for citizens as it promotes transparency, accountability, and informed decision-making. It allows citizens to understand government policies, participate in public discourse, and hold representatives accountable. This is crucial, and sometimes a matter of life or death, for companies whose operation depend on certain regulations. Large Language Models (LLMs) have the potential to greatly enhance the analysis of public affairs documents by effectively processing and understanding the complex language used in such documents. In this work, we analyze the performance of LLMs in classifying public affairs documents. As a natural multi-label task, the classification of these documents presents important challenges. In this work, we use a regex-powered tool to collect a database of public affairs documents with more than 33K samples and 22.5M tokens. Our experiments assess the performance of 4 different Spanish LLMs to classify up to 30 diff",
    "link": "http://arxiv.org/abs/2306.02864",
    "context": "Title: Leveraging Large Language Models for Topic Classification in the Domain of Public Affairs. (arXiv:2306.02864v2 [cs.AI] UPDATED)\nAbstract: The analysis of public affairs documents is crucial for citizens as it promotes transparency, accountability, and informed decision-making. It allows citizens to understand government policies, participate in public discourse, and hold representatives accountable. This is crucial, and sometimes a matter of life or death, for companies whose operation depend on certain regulations. Large Language Models (LLMs) have the potential to greatly enhance the analysis of public affairs documents by effectively processing and understanding the complex language used in such documents. In this work, we analyze the performance of LLMs in classifying public affairs documents. As a natural multi-label task, the classification of these documents presents important challenges. In this work, we use a regex-powered tool to collect a database of public affairs documents with more than 33K samples and 22.5M tokens. Our experiments assess the performance of 4 different Spanish LLMs to classify up to 30 diff",
    "path": "papers/23/06/2306.02864.json",
    "total_tokens": 935,
    "translated_title": "利用大型语言模型在公共事务领域进行主题分类",
    "translated_abstract": "分析公共事务文件对公民至关重要，它促进透明度、问责制和决策。它使公民能够了解政府政策，参与公共话语，并追究代表的责任。对于依靠某些规定运营的公司来说，这是至关重要的，有时甚至关乎生死。大型语言模型（LLM）有潜力通过有效处理和理解这类文件中使用的复杂语言，大大增强公共事务文件的分析能力。在这项工作中，我们分析了LLM在分类公共事务文件中的性能。作为一项自然的多标签任务，这些文件的分类具有重要挑战。在这项工作中，我们使用了一个基于正则表达式的工具来收集了一个包含超过33K个样本和22.5M个标记的公共事务文件数据库。我们的实验评估了4个不同的西班牙语LLM在最多30个不同类别的文件分类中的性能。",
    "tldr": "LLMs在公共事务文件分类中的表现进行了分析。通过使用正则表达式工具收集了一个包含超过33K个样本和22.5M个标记的公共事务文件数据库。实验结果表明，LLMs可以有效处理和理解这类文件中使用的复杂语言，从而提高了公共事务文件的分析能力。",
    "en_tdlr": "The performance of LLMs in classifying public affairs documents is analyzed. A database of public affairs documents with over 33K samples and 22.5M tokens was collected using a regex-powered tool. The experiments show that LLMs can effectively process and understand the complex language used in such documents, enhancing the analysis of public affairs documents."
}