{
    "title": "Practice with Graph-based ANN Algorithms on Sparse Data: Chi-square Two-tower model, HNSW, Sign Cauchy Projections. (arXiv:2306.07607v1 [cs.IR])",
    "abstract": "Sparse data are common. The traditional ``handcrafted'' features are often sparse. Embedding vectors from trained models can also be very sparse, for example, embeddings trained via the ``ReLu'' activation function. In this paper, we report our exploration of efficient search in sparse data with graph-based ANN algorithms (e.g., HNSW, or SONG which is the GPU version of HNSW), which are popular in industrial practice, e.g., search and ads (advertising).  We experiment with the proprietary ads targeting application, as well as benchmark public datasets. For ads targeting, we train embeddings with the standard ``cosine two-tower'' model and we also develop the ``chi-square two-tower'' model. Both models produce (highly) sparse embeddings when they are integrated with the ``ReLu'' activation function. In EBR (embedding-based retrieval) applications, after we the embeddings are trained, the next crucial task is the approximate near neighbor (ANN) search for serving. While there are many AN",
    "link": "http://arxiv.org/abs/2306.07607",
    "context": "Title: Practice with Graph-based ANN Algorithms on Sparse Data: Chi-square Two-tower model, HNSW, Sign Cauchy Projections. (arXiv:2306.07607v1 [cs.IR])\nAbstract: Sparse data are common. The traditional ``handcrafted'' features are often sparse. Embedding vectors from trained models can also be very sparse, for example, embeddings trained via the ``ReLu'' activation function. In this paper, we report our exploration of efficient search in sparse data with graph-based ANN algorithms (e.g., HNSW, or SONG which is the GPU version of HNSW), which are popular in industrial practice, e.g., search and ads (advertising).  We experiment with the proprietary ads targeting application, as well as benchmark public datasets. For ads targeting, we train embeddings with the standard ``cosine two-tower'' model and we also develop the ``chi-square two-tower'' model. Both models produce (highly) sparse embeddings when they are integrated with the ``ReLu'' activation function. In EBR (embedding-based retrieval) applications, after we the embeddings are trained, the next crucial task is the approximate near neighbor (ANN) search for serving. While there are many AN",
    "path": "papers/23/06/2306.07607.json",
    "total_tokens": 1296,
    "translated_title": "基于图的ANN算法在稀疏数据上的应用：卡方双塔模型、HNSW、符号柯西投影",
    "translated_abstract": "在实际应用中，稀疏数据很常见。传统的“手工制作”的特征通常是稀疏的。通过训练得到的嵌入向量也可能非常稀疏，例如使用“ReLu”激活函数训练的嵌入。本文探讨了使用基于图的ANN算法（例如，HNSW或其GPU版本SONG）进行稀疏数据中的高效搜索，这些算法在工业实践中非常流行，例如搜索和广告（广告投放）。我们进行了专利广告定向应用的实验，并测试了基准公共数据集。对于广告定向，我们使用标准的“余弦双塔”模型和开发的“卡方双塔”模型训练嵌入，这两种模型都能够产生（非常）稀疏的嵌入，当它们与“ReLu”激活函数集成时。在嵌入式检索（EBR）应用中，在训练完嵌入向量后，下一个至关重要的任务是用于服务的近似最近邻（ANN）搜索。虽然有许多ANN算法可用，但基于图的算法已知是高效且可扩展的。我们经验证明，基于图的算法，特别是HNSW在搜索稀疏嵌入（高达97％的稀疏度）方面特别有效。我们还提出了适用于实际中常见的稀疏嵌入的SGN变体（符号柯西投影）。我们将所提出的算法在公共数据集以及来自广告应用的实际数据上进行了测试。实验结果表明，我们提出的算法可以达到最先进的性能水平。",
    "tldr": "本文探索了在稀疏数据中使用基于图的ANN算法进行高效搜索，特别是HNSW算法在搜索稀疏嵌入方面特别有效。提出了适用于实际中常见的稀疏嵌入的SGN变体，实验结果表明我们提出的算法可以达到最先进的性能水平。",
    "en_tdlr": "This paper explores the efficient search in sparse data through graph-based ANN algorithms, particularly HNSW. It proposes a variant of SGN tailored for common sparse embeddings and achieves state-of-the-art performance on both public datasets and real-world data from an ads application."
}