{
    "title": "Responsibility Perspective Transfer for Italian Femicide News. (arXiv:2306.00437v1 [cs.CL])",
    "abstract": "Different ways of linguistically expressing the same real-world event can lead to different perceptions of what happened. Previous work has shown that different descriptions of gender-based violence (GBV) influence the reader's perception of who is to blame for the violence, possibly reinforcing stereotypes which see the victim as partly responsible, too. As a contribution to raise awareness on perspective-based writing, and to facilitate access to alternative perspectives, we introduce the novel task of automatically rewriting GBV descriptions as a means to alter the perceived level of responsibility on the perpetrator. We present a quasi-parallel dataset of sentences with low and high perceived responsibility levels for the perpetrator, and experiment with unsupervised (mBART-based), zero-shot and few-shot (GPT3-based) methods for rewriting sentences. We evaluate our models using a questionnaire study and a suite of automatic metrics.",
    "link": "http://arxiv.org/abs/2306.00437",
    "context": "Title: Responsibility Perspective Transfer for Italian Femicide News. (arXiv:2306.00437v1 [cs.CL])\nAbstract: Different ways of linguistically expressing the same real-world event can lead to different perceptions of what happened. Previous work has shown that different descriptions of gender-based violence (GBV) influence the reader's perception of who is to blame for the violence, possibly reinforcing stereotypes which see the victim as partly responsible, too. As a contribution to raise awareness on perspective-based writing, and to facilitate access to alternative perspectives, we introduce the novel task of automatically rewriting GBV descriptions as a means to alter the perceived level of responsibility on the perpetrator. We present a quasi-parallel dataset of sentences with low and high perceived responsibility levels for the perpetrator, and experiment with unsupervised (mBART-based), zero-shot and few-shot (GPT3-based) methods for rewriting sentences. We evaluate our models using a questionnaire study and a suite of automatic metrics.",
    "path": "papers/23/06/2306.00437.json",
    "total_tokens": 857,
    "translated_title": "意大利女性被害新闻的责任视角转移",
    "translated_abstract": "不同的语言表述可以导致对真实世界事件的不同理解。以往研究表明，不同的性别暴力描述会影响读者对于暴力行为谁应承担责任的理解，进而强化将受害人视为部分有责任的刻板印象。为了提高人们对于写作视角的意识，促进对于不同视角的理解，我们引入一项新任务，即自动修改性别暴力描述，以改变对于施暴者责任程度的理解。我们提供了一个准平行的数据集，其中包含对于施暴者责任感低和高的句子，并采用无监督（基于mBART）、零样本和少样本（基于GPT3）方法进行句子重写。我们使用问卷研究和自动评价指标来评估我们的模型。",
    "tldr": "本文介绍了一项新任务，旨在通过自动修改性别暴力描述来改变读者对于施暴者责任程度的理解。我们使用了多种方法进行句子重写，并采用问卷研究和自动评价指标对模型进行评估。",
    "en_tdlr": "This paper introduces a novel task of automatically rewriting gender-based violence (GBV) descriptions to alter the perceived level of responsibility on the perpetrator. The authors experimented with unsupervised, zero-shot, and few-shot methods for sentence rewriting, and evaluated the models using a questionnaire study and a suite of automatic metrics."
}