{
    "title": "Deep Unfolded Simulated Bifurcation for Massive MIMO Signal Detection. (arXiv:2306.16264v1 [cs.IT])",
    "abstract": "Multiple-input multiple-output (MIMO) is a key ingredient of next-generation wireless communications. Recently, various MIMO signal detectors based on deep learning techniques and quantum(-inspired) algorithms have been proposed to improve the detection performance compared with conventional detectors. This paper focuses on the simulated bifurcation (SB) algorithm, a quantum-inspired algorithm. This paper proposes two techniques to improve its detection performance. The first is modifying the algorithm inspired by the Levenberg-Marquardt algorithm to eliminate local minima of maximum likelihood detection. The second is the use of deep unfolding, a deep learning technique to train the internal parameters of an iterative algorithm. We propose a deep-unfolded SB by making the update rule of SB differentiable. The numerical results show that these proposed detectors significantly improve the signal detection performance in massive MIMO systems.",
    "link": "http://arxiv.org/abs/2306.16264",
    "context": "Title: Deep Unfolded Simulated Bifurcation for Massive MIMO Signal Detection. (arXiv:2306.16264v1 [cs.IT])\nAbstract: Multiple-input multiple-output (MIMO) is a key ingredient of next-generation wireless communications. Recently, various MIMO signal detectors based on deep learning techniques and quantum(-inspired) algorithms have been proposed to improve the detection performance compared with conventional detectors. This paper focuses on the simulated bifurcation (SB) algorithm, a quantum-inspired algorithm. This paper proposes two techniques to improve its detection performance. The first is modifying the algorithm inspired by the Levenberg-Marquardt algorithm to eliminate local minima of maximum likelihood detection. The second is the use of deep unfolding, a deep learning technique to train the internal parameters of an iterative algorithm. We propose a deep-unfolded SB by making the update rule of SB differentiable. The numerical results show that these proposed detectors significantly improve the signal detection performance in massive MIMO systems.",
    "path": "papers/23/06/2306.16264.json",
    "total_tokens": 846,
    "translated_title": "深度展开模拟的双分岔用于大规模MIMO信号检测",
    "translated_abstract": "多输入多输出（MIMO）是下一代无线通信的关键组成部分。最近，基于深度学习技术和量子（启发式）算法的各种MIMO信号检测器已被提出，以改善与传统检测器相比的检测性能。本文关注量子启发式算法中的模拟双分岔（SB）算法，并提出了两种技术来改善其检测性能。第一种是修改受Levenberg-Marquardt算法启发的算法，以消除最大似然检测的局部最小值。第二种是使用深度展开，一种深度学习技术，来训练迭代算法的内部参数。我们提出了一种深度展开的SB，通过使SB的更新规则可微分。数值结果表明，这些提出的检测器显著改善了大规模MIMO系统的信号检测性能。",
    "tldr": "本文提出了一种基于量子启发式算法的模拟双分岔用于大规模MIMO信号检测的方法，并通过修改算法和使用深度展开技术，显著改善了检测性能。",
    "en_tdlr": "This paper proposes a simulated bifurcation (SB) algorithm based on quantum-inspired techniques for massive MIMO signal detection, and significantly improves the detection performance by modifying the algorithm and using deep unfolding technique."
}