{
    "title": "Challenges and Remedies to Privacy and Security in AIGC: Exploring the Potential of Privacy Computing, Blockchain, and Beyond. (arXiv:2306.00419v1 [cs.CR])",
    "abstract": "Artificial Intelligence Generated Content (AIGC) is one of the latest achievements in AI development. The content generated by related applications, such as text, images and audio, has sparked a heated discussion. Various derived AIGC applications are also gradually entering all walks of life, bringing unimaginable impact to people's daily lives. However, the rapid development of such generative tools has also raised concerns about privacy and security issues, and even copyright issues in AIGC. We note that advanced technologies such as blockchain and privacy computing can be combined with AIGC tools, but no work has yet been done to investigate their relevance and prospect in a systematic and detailed way. Therefore it is necessary to investigate how they can be used to protect the privacy and security of data in AIGC by fully exploring the aforementioned technologies. In this paper, we first systematically review the concept, classification and underlying technologies of AIGC. Then, ",
    "link": "http://arxiv.org/abs/2306.00419",
    "context": "Title: Challenges and Remedies to Privacy and Security in AIGC: Exploring the Potential of Privacy Computing, Blockchain, and Beyond. (arXiv:2306.00419v1 [cs.CR])\nAbstract: Artificial Intelligence Generated Content (AIGC) is one of the latest achievements in AI development. The content generated by related applications, such as text, images and audio, has sparked a heated discussion. Various derived AIGC applications are also gradually entering all walks of life, bringing unimaginable impact to people's daily lives. However, the rapid development of such generative tools has also raised concerns about privacy and security issues, and even copyright issues in AIGC. We note that advanced technologies such as blockchain and privacy computing can be combined with AIGC tools, but no work has yet been done to investigate their relevance and prospect in a systematic and detailed way. Therefore it is necessary to investigate how they can be used to protect the privacy and security of data in AIGC by fully exploring the aforementioned technologies. In this paper, we first systematically review the concept, classification and underlying technologies of AIGC. Then, ",
    "path": "papers/23/06/2306.00419.json",
    "total_tokens": 1094,
    "translated_title": "AIGC的隐私和安全问题及其解决方案：探索隐私计算、区块链等技术的潜力",
    "translated_abstract": "人工智能生成内容（AIGC）是人工智能发展的最新成果之一。相关应用生成的文本、图像和音频等内容引发了激烈的讨论。各种衍生的AIGC应用也逐渐进入各行各业，给人们的日常生活带来了难以想象的影响。然而，这些生成性工具的快速发展也引发了关于AIGC隐私、安全甚至版权问题的担忧。我们注意到，区块链和隐私计算等先进技术可以与AIGC工具相结合，但尚未有研究对其相关性和前景进行系统和详细的调查。因此，有必要通过充分探索上述技术，研究如何利用它们来保护AIGC中数据的隐私和安全问题。本文首先系统地回顾了AIGC的概念、分类和基础技术。然后，我们详细阐述了AIGC中的潜在隐私和安全挑战，并提供相应的解决方案。我们特别讨论了隐私计算和区块链在解决这些挑战方面的适用性和局限性。最后，我们确定了本领域未来的研究方向。",
    "tldr": "本文系统地回顾了AIGC的概念、分类以及基础技术，详细阐述了在AIGC中可能存在的隐私和安全挑战，提供了隐私计算和区块链等技术相应的解决方案，并在此基础上确定了未来的研究方向。",
    "en_tdlr": "This paper systematically reviews the concept, classification, and underlying technologies of AIGC, discusses the potential privacy and security challenges in AIGC and provides corresponding remedies, specifically examining the applicability and limitations of privacy computing and blockchain. The authors identify future research directions in this area."
}