{
    "title": "Reinforcement Learning-based Virtual Fixtures for Teleoperation of Hydraulic Construction Machine. (arXiv:2306.11897v1 [cs.RO])",
    "abstract": "The utilization of teleoperation is a crucial aspect of the construction industry, as it enables operators to control machines safely from a distance. However, remote operation of these machines at a joint level using individual joysticks necessitates extensive training for operators to achieve proficiency due to their multiple degrees of freedom. Additionally, verifying the machine resulting motion is only possible after execution, making optimal control challenging. In addressing this issue, this study proposes a reinforcement learning-based approach to optimize task performance. The control policy acquired through learning is used to provide instructions on efficiently controlling and coordinating multiple joints. To evaluate the effectiveness of the proposed framework, a user study is conducted with a Brokk 170 construction machine by assessing its performance in a typical construction task involving inserting a chisel into a borehole. The effectiveness of the proposed framework is",
    "link": "http://arxiv.org/abs/2306.11897",
    "context": "Title: Reinforcement Learning-based Virtual Fixtures for Teleoperation of Hydraulic Construction Machine. (arXiv:2306.11897v1 [cs.RO])\nAbstract: The utilization of teleoperation is a crucial aspect of the construction industry, as it enables operators to control machines safely from a distance. However, remote operation of these machines at a joint level using individual joysticks necessitates extensive training for operators to achieve proficiency due to their multiple degrees of freedom. Additionally, verifying the machine resulting motion is only possible after execution, making optimal control challenging. In addressing this issue, this study proposes a reinforcement learning-based approach to optimize task performance. The control policy acquired through learning is used to provide instructions on efficiently controlling and coordinating multiple joints. To evaluate the effectiveness of the proposed framework, a user study is conducted with a Brokk 170 construction machine by assessing its performance in a typical construction task involving inserting a chisel into a borehole. The effectiveness of the proposed framework is",
    "path": "papers/23/06/2306.11897.json",
    "total_tokens": 828,
    "translated_title": "基于强化学习的液压建筑机器人远程操作虚拟装置",
    "translated_abstract": "远程操纵施工设备是建筑行业的重要方面，能够实现远距离安全操纵机器人。然而，使用手柄进行关节级别的远程操作需要经过长时间的培训才能熟练掌握，同时，由于机器的多自由度特性，机器的运动只能在执行后进行验证，使得优化控制具有挑战性。针对这个问题，本研究提出了一种基于强化学习的方法来优化任务性能。通过学习获得的控制策略用于提供关节的高效控制和协调的任务指令。为了评估所提出框架的有效性，使用Brokk 170施工机进行用户研究，评估其在典型施工任务（将凿子插入钻孔中）中的表现。实验结果表明，所提出的框架具有实用性。",
    "tldr": "本文提出了一种基于强化学习的方法来优化施工机器人任务性能。实验表明该方法在典型施工任务中的表现良好。",
    "en_tdlr": "This paper proposes a reinforcement learning-based approach to optimize task performance in teleoperation of construction machines. Experimental results show that the proposed framework performs well in typical construction tasks."
}