{
    "title": "The Skill-Task Matching Model: Mechanism, Model Form and implications. (arXiv:2306.12176v1 [econ.TH])",
    "abstract": "We propose the iteration mechanism as a supplement to the price mechanism in microeconomics. We hold that firms set expected profits in the beginning of each producing period, then try to achieve them. The ability to achieve target number is not born. Firms continuously trial and error, let their actual profits increasingly approach expected profits. We propose the Skill-Task Matching Model to describe this iteration process. The model vectorizes occupations into a task vector space, vectorizes employees into a skill vector space, regards production technology as the matching level of skills and tasks, and regards corporate strategy as the value vector of tasks. Firms turn these producing parameters by iteration, to make actual profit get closer to expected profit. We build a neural network algorithm to simulated how the Skill-Task Matching Model works. Being a new model to illustrate firm's decision making, the Skill-Task Matching Model offers another perspective to discuss firm's sho",
    "link": "http://arxiv.org/abs/2306.12176",
    "context": "Title: The Skill-Task Matching Model: Mechanism, Model Form and implications. (arXiv:2306.12176v1 [econ.TH])\nAbstract: We propose the iteration mechanism as a supplement to the price mechanism in microeconomics. We hold that firms set expected profits in the beginning of each producing period, then try to achieve them. The ability to achieve target number is not born. Firms continuously trial and error, let their actual profits increasingly approach expected profits. We propose the Skill-Task Matching Model to describe this iteration process. The model vectorizes occupations into a task vector space, vectorizes employees into a skill vector space, regards production technology as the matching level of skills and tasks, and regards corporate strategy as the value vector of tasks. Firms turn these producing parameters by iteration, to make actual profit get closer to expected profit. We build a neural network algorithm to simulated how the Skill-Task Matching Model works. Being a new model to illustrate firm's decision making, the Skill-Task Matching Model offers another perspective to discuss firm's sho",
    "path": "papers/23/06/2306.12176.json",
    "total_tokens": 928,
    "tldr": "该论文提出了技能-任务匹配模型，这是一个新的模型，可以解释企业的决策制定过程。通过迭代，企业不断试错，将实际利润逐渐接近预期利润，这为我们提供了另一个角度来讨论企业的短期和长期决策。"
}