{
    "title": "TASRA: a Taxonomy and Analysis of Societal-Scale Risks from AI. (arXiv:2306.06924v2 [cs.AI] UPDATED)",
    "abstract": "While several recent works have identified societal-scale and extinction-level risks to humanity arising from artificial intelligence, few have attempted an {\\em exhaustive taxonomy} of such risks. Many exhaustive taxonomies are possible, and some are useful -- particularly if they reveal new risks or practical approaches to safety. This paper explores a taxonomy based on accountability: whose actions lead to the risk, are the actors unified, and are they deliberate? We also provide stories to illustrate how the various risk types could each play out, including risks arising from unanticipated interactions of many AI systems, as well as risks from deliberate misuse, for which combined technical and policy solutions are indicated.",
    "link": "http://arxiv.org/abs/2306.06924",
    "context": "Title: TASRA: a Taxonomy and Analysis of Societal-Scale Risks from AI. (arXiv:2306.06924v2 [cs.AI] UPDATED)\nAbstract: While several recent works have identified societal-scale and extinction-level risks to humanity arising from artificial intelligence, few have attempted an {\\em exhaustive taxonomy} of such risks. Many exhaustive taxonomies are possible, and some are useful -- particularly if they reveal new risks or practical approaches to safety. This paper explores a taxonomy based on accountability: whose actions lead to the risk, are the actors unified, and are they deliberate? We also provide stories to illustrate how the various risk types could each play out, including risks arising from unanticipated interactions of many AI systems, as well as risks from deliberate misuse, for which combined technical and policy solutions are indicated.",
    "path": "papers/23/06/2306.06924.json",
    "total_tokens": 813,
    "translated_title": "TASRA: 一份关于人工智能可能带来的社会规模风险的分类与分析",
    "translated_abstract": "虽然最近一些作品已经确认了人工智能可能给人类带来的社会规模和灭绝级的风险，但几乎没有人尝试过进行全面归纳这些风险。许多全面性的分类法都是可能的，并且有些是有用的——尤其是如果它们揭示了新的风险或安全的实际方法。本文探讨了一种基于问责制的分类法：哪些行为导致了风险，行动者是否统一，他们是否是蓄意的。我们还提供了故事来说明各种风险类型如何发挥作用，包括来自许多人工智能系统意外相互作用的风险，以及来自蓄意滥用的风险，需要联合技术和政策解决方案。",
    "tldr": "本文探讨了人工智能可能带来的社会规模风险的分类和分析，其中提出了一种基于问责制的分类法。针对可能出现的风险类型提供了实际的证明，并指出需要联合技术和政策解决方案。",
    "en_tdlr": "This paper explores the taxonomy and analysis of societal-scale risks from AI and proposes an accountability-based classification. It provides concrete illustrations of potential risks and suggests combined technical and policy solutions for deliberate misuse and unexpected interactions of AI systems."
}