{
    "title": "Causal Mediation Analysis with Multi-dimensional and Indirectly Observed Mediators. (arXiv:2306.07918v1 [cs.LG])",
    "abstract": "Causal mediation analysis (CMA) is a powerful method to dissect the total effect of a treatment into direct and mediated effects within the potential outcome framework. This is important in many scientific applications to identify the underlying mechanisms of a treatment effect. However, in many scientific applications the mediator is unobserved, but there may exist related measurements. For example, we may want to identify how changes in brain activity or structure mediate an antidepressant's effect on behavior, but we may only have access to electrophysiological or imaging brain measurements. To date, most CMA methods assume that the mediator is one-dimensional and observable, which oversimplifies such real-world scenarios. To overcome this limitation, we introduce a CMA framework that can handle complex and indirectly observed mediators based on the identifiable variational autoencoder (iVAE) architecture. We prove that the true joint distribution over observed and latent variables ",
    "link": "http://arxiv.org/abs/2306.07918",
    "context": "Title: Causal Mediation Analysis with Multi-dimensional and Indirectly Observed Mediators. (arXiv:2306.07918v1 [cs.LG])\nAbstract: Causal mediation analysis (CMA) is a powerful method to dissect the total effect of a treatment into direct and mediated effects within the potential outcome framework. This is important in many scientific applications to identify the underlying mechanisms of a treatment effect. However, in many scientific applications the mediator is unobserved, but there may exist related measurements. For example, we may want to identify how changes in brain activity or structure mediate an antidepressant's effect on behavior, but we may only have access to electrophysiological or imaging brain measurements. To date, most CMA methods assume that the mediator is one-dimensional and observable, which oversimplifies such real-world scenarios. To overcome this limitation, we introduce a CMA framework that can handle complex and indirectly observed mediators based on the identifiable variational autoencoder (iVAE) architecture. We prove that the true joint distribution over observed and latent variables ",
    "path": "papers/23/06/2306.07918.json",
    "total_tokens": 729,
    "translated_title": "多维和间接观测中介因素的因果中介分析",
    "translated_abstract": "因果中介分析是一种强大的方法，可以在潜在结果框架内将处理的总效应分解为直接和介导效应。这在许多科学应用中很重要，可以识别出处理效应的潜在机制。然而，在许多科学应用中，中介因素未被观察到，但可能存在相关测量。为了解决这个限制，我们介绍了一种CMA框架，它可以处理基于可辨识变分自编码器（iVAE）体系结构的复杂和间接观测的中介因素。",
    "tldr": "该论文介绍了一种能够处理复杂和间接观测的中介因素的因果中介分析框架。",
    "en_tdlr": "The paper proposes a causal mediation analysis framework that can handle complex and indirectly observed mediators."
}