{
    "title": "Are ChatGPT and Other Similar Systems the Modern Lernaean Hydras of AI?. (arXiv:2306.09267v3 [cs.CY] UPDATED)",
    "abstract": "The rise of Generative Artificial Intelligence systems (\"AI systems\") has created unprecedented social engagement. AI code generation systems provide responses (output) to questions or requests by accessing the vast library of open-source code created by developers over the past few decades. However, they do so by allegedly stealing the open-source code stored in virtual libraries, known as repositories. This Article focuses on how this happens and whether there is a solution that protects innovation and avoids years of litigation. We also touch upon the array of issues raised by the relationship between AI and copyright. Looking ahead, we propose the following: (a) immediate changes to the licenses for open-source code created by developers that will limit access and/or use of any open-source code to humans only; (b) we suggest revisions to the Massachusetts Institute of Technology (\"MIT\") license so that AI systems are required to procure appropriate licenses from open-source code de",
    "link": "http://arxiv.org/abs/2306.09267",
    "context": "Title: Are ChatGPT and Other Similar Systems the Modern Lernaean Hydras of AI?. (arXiv:2306.09267v3 [cs.CY] UPDATED)\nAbstract: The rise of Generative Artificial Intelligence systems (\"AI systems\") has created unprecedented social engagement. AI code generation systems provide responses (output) to questions or requests by accessing the vast library of open-source code created by developers over the past few decades. However, they do so by allegedly stealing the open-source code stored in virtual libraries, known as repositories. This Article focuses on how this happens and whether there is a solution that protects innovation and avoids years of litigation. We also touch upon the array of issues raised by the relationship between AI and copyright. Looking ahead, we propose the following: (a) immediate changes to the licenses for open-source code created by developers that will limit access and/or use of any open-source code to humans only; (b) we suggest revisions to the Massachusetts Institute of Technology (\"MIT\") license so that AI systems are required to procure appropriate licenses from open-source code de",
    "path": "papers/23/06/2306.09267.json",
    "total_tokens": 868,
    "translated_title": "ChatGPT和其他类似系统是AI的现代勒纳恩九头蛇吗？",
    "translated_abstract": "生成式人工智能系统的崛起引发了前所未有的社交参与。AI代码生成系统通过访问过去几十年开发人员创建的大量开源代码来提供回答或响应问题或请求。然而，它们被指控窃取存储在虚拟库中的开源代码。本文着重讨论此类问题，并探讨是否有解决方案来保护创新并避免多年的诉讼。对AI和版权之间的关系引发的一系列问题也进行了讨论。展望未来，我们提出以下建议：(a)对开发人员创建的开源代码的许可证进行即时更改，限制对任何开源代码的访问和/或使用仅限于人类；(b)建议对麻省理工学院（MIT）许可证进行修订，要求AI系统从开源代码部分获取适当的许可证。",
    "tldr": "生成式人工智能系统的崛起引发了版权和创新保护的问题。建议对开源代码许可证进行更改，限制AI系统对代码的访问和使用，并探讨与AI和版权之间的关系引发的问题。",
    "en_tdlr": "The rise of generative AI systems has raised concerns about copyright and innovation protection. Proposed solutions include changes to open-source licenses to restrict AI systems' access and use of code, and exploring the issues raised by the relationship between AI and copyright."
}