{
    "title": "Navigating Fairness in Radiology AI: Concepts, Consequences,and Crucial Considerations. (arXiv:2306.01333v1 [cs.LG])",
    "abstract": "Artificial Intelligence (AI) has significantly revolutionized radiology, promising improved patient outcomes and streamlined processes. However, it's critical to ensure the fairness of AI models to prevent stealthy bias and disparities from leading to unequal outcomes. This review discusses the concept of fairness in AI, focusing on bias auditing using the Aequitas toolkit, and its real-world implications in radiology, particularly in disease screening scenarios. Aequitas, an open-source bias audit toolkit, scrutinizes AI models' decisions, identifying hidden biases that may result in disparities across different demographic groups and imaging equipment brands. This toolkit operates on statistical theories, analyzing a large dataset to reveal a model's fairness. It excels in its versatility to handle various variables simultaneously, especially in a field as diverse as radiology. The review explicates essential fairness metrics: Equal and Proportional Parity, False Positive Rate Parity",
    "link": "http://arxiv.org/abs/2306.01333",
    "context": "Title: Navigating Fairness in Radiology AI: Concepts, Consequences,and Crucial Considerations. (arXiv:2306.01333v1 [cs.LG])\nAbstract: Artificial Intelligence (AI) has significantly revolutionized radiology, promising improved patient outcomes and streamlined processes. However, it's critical to ensure the fairness of AI models to prevent stealthy bias and disparities from leading to unequal outcomes. This review discusses the concept of fairness in AI, focusing on bias auditing using the Aequitas toolkit, and its real-world implications in radiology, particularly in disease screening scenarios. Aequitas, an open-source bias audit toolkit, scrutinizes AI models' decisions, identifying hidden biases that may result in disparities across different demographic groups and imaging equipment brands. This toolkit operates on statistical theories, analyzing a large dataset to reveal a model's fairness. It excels in its versatility to handle various variables simultaneously, especially in a field as diverse as radiology. The review explicates essential fairness metrics: Equal and Proportional Parity, False Positive Rate Parity",
    "path": "papers/23/06/2306.01333.json",
    "total_tokens": 1050,
    "translated_title": "放射学AI中的公平性导航：概念、后果和关键考虑",
    "translated_abstract": "人工智能（AI）已经在放射学领域取得了重大革命性进展，承诺改善患者结果和简化流程。然而，确保AI模型的公平性至关重要，以防止隐蔽的偏见和不平等现象导致不平等结果。本综述讨论了AI中的公平概念，重点讨论使用Aequitas工具包进行偏差审计及其在放射学中的实际影响，特别是在疾病筛查场景中的影响。Aequitas是一个开源的偏差审计工具包，审查AI模型的决策，识别可能导致不同人口群体和成像设备品牌之间差异的隐藏偏见。该工具包基于统计理论，分析大型数据集以揭示模型的公平性。它在同时处理多种变量方面表现出色，特别是在放射学这样的多元化领域中。本综述阐明了公平性评估的基本指标：平等和比例平等、假阳性率平等、假阴性率平等和预测平等。作者还强调了在放射学AI中考虑伦理影响的重要性，包括对患者造成伤害的风险以及在AI决策过程中需要透明度的必要性。",
    "tldr": "本文讨论了放射学AI中的公平性问题，介绍了Aequitas偏差审计工具包并阐明了公平性评估的基本指标，强调了考虑AI伦理影响的重要性。",
    "en_tdlr": "This paper discusses fairness issues in radiology AI, introduces the Aequitas bias audit toolkit and clarifies the basic fairness indicators for evaluation. It emphasizes the importance of considering the ethical implications of AI in radiology."
}