{
    "title": "Structured Dialogue Discourse Parsing. (arXiv:2306.15103v1 [cs.CL])",
    "abstract": "Dialogue discourse parsing aims to uncover the internal structure of a multi-participant conversation by finding all the discourse~\\emph{links} and corresponding~\\emph{relations}. Previous work either treats this task as a series of independent multiple-choice problems, in which the link existence and relations are decoded separately, or the encoding is restricted to only local interaction, ignoring the holistic structural information. In contrast, we propose a principled method that improves upon previous work from two perspectives: encoding and decoding. From the encoding side, we perform structured encoding on the adjacency matrix followed by the matrix-tree learning algorithm, where all discourse links and relations in the dialogue are jointly optimized based on latent tree-level distribution. From the decoding side, we perform structured inference using the modified Chiu-Liu-Edmonds algorithm, which explicitly generates the labeled multi-root non-projective spanning tree that best",
    "link": "http://arxiv.org/abs/2306.15103",
    "context": "Title: Structured Dialogue Discourse Parsing. (arXiv:2306.15103v1 [cs.CL])\nAbstract: Dialogue discourse parsing aims to uncover the internal structure of a multi-participant conversation by finding all the discourse~\\emph{links} and corresponding~\\emph{relations}. Previous work either treats this task as a series of independent multiple-choice problems, in which the link existence and relations are decoded separately, or the encoding is restricted to only local interaction, ignoring the holistic structural information. In contrast, we propose a principled method that improves upon previous work from two perspectives: encoding and decoding. From the encoding side, we perform structured encoding on the adjacency matrix followed by the matrix-tree learning algorithm, where all discourse links and relations in the dialogue are jointly optimized based on latent tree-level distribution. From the decoding side, we perform structured inference using the modified Chiu-Liu-Edmonds algorithm, which explicitly generates the labeled multi-root non-projective spanning tree that best",
    "path": "papers/23/06/2306.15103.json",
    "total_tokens": 837,
    "translated_title": "结构化对话话语分析",
    "translated_abstract": "对话话语分析旨在通过找到所有话语链接和对应关系，揭示多参与者对话的内部结构。先前的工作要么将此任务视为一系列独立的多项选择问题，其中链接存在和关系被分别解码，要么将编码限制在仅局部交互中，忽略了整体的结构信息。相反，我们提出了一种从编码和解码两个角度改进先前工作的原理方法。从编码方面来看，我们对邻接矩阵执行结构化编码，然后采用矩阵树学习算法，根据潜在的树级分布共同优化对话中的所有链接和关系。从解码方面来看，我们使用修改后的Chiu-Liu-Edmonds算法执行结构化推理，明确生成最佳的带标签多根非投射生成树。",
    "tldr": "本文提出了一种结构化对话话语分析的方法，从编码和解码两个角度改进了先前的工作，并通过对邻接矩阵进行结构化编码，以及使用修改后的Chiu-Liu-Edmonds算法进行结构化推理来优化对话中的链接和关系。"
}