{
    "title": "Towards Arabic Multimodal Dataset for Sentiment Analysis. (arXiv:2306.06322v1 [cs.CL])",
    "abstract": "Multimodal Sentiment Analysis (MSA) has recently become a centric research direction for many real-world applications. This proliferation is due to the fact that opinions are central to almost all human activities and are key influencers of our behaviors. In addition, the recent deployment of Deep Learning-based (DL) models has proven their high efficiency for a wide range of Western languages. In contrast, Arabic DL-based multimodal sentiment analysis (MSA) is still in its infantile stage due, mainly, to the lack of standard datasets. In this paper, our investigation is twofold. First, we design a pipeline that helps building our Arabic Multimodal dataset leveraging both state-of-the-art transformers and feature extraction tools within word alignment techniques. Thereafter, we validate our dataset using state-of-the-art transformer-based model dealing with multimodality. Despite the small size of the outcome dataset, experiments show that Arabic multimodality is very promising",
    "link": "http://arxiv.org/abs/2306.06322",
    "context": "Title: Towards Arabic Multimodal Dataset for Sentiment Analysis. (arXiv:2306.06322v1 [cs.CL])\nAbstract: Multimodal Sentiment Analysis (MSA) has recently become a centric research direction for many real-world applications. This proliferation is due to the fact that opinions are central to almost all human activities and are key influencers of our behaviors. In addition, the recent deployment of Deep Learning-based (DL) models has proven their high efficiency for a wide range of Western languages. In contrast, Arabic DL-based multimodal sentiment analysis (MSA) is still in its infantile stage due, mainly, to the lack of standard datasets. In this paper, our investigation is twofold. First, we design a pipeline that helps building our Arabic Multimodal dataset leveraging both state-of-the-art transformers and feature extraction tools within word alignment techniques. Thereafter, we validate our dataset using state-of-the-art transformer-based model dealing with multimodality. Despite the small size of the outcome dataset, experiments show that Arabic multimodality is very promising",
    "path": "papers/23/06/2306.06322.json",
    "total_tokens": 919,
    "translated_title": "面向阿拉伯语情感分析的多模态数据集构建",
    "translated_abstract": "多模态情感分析(MSA)已成为许多实际应用的中心研究方向。这种普及得益于意见对几乎所有人类活动的重要性，以及成为我们行为的关键因素。近年来，基于深度学习(DL)模型的高效性也已在多种西方语言中得到证明。然而，由于缺乏标准数据集，阿拉伯语DL-based MSA仍处于初始阶段。本文的探究目标有两个方面，首先，我们设计了一种管道流程，利用最先进的转换器以及单词对齐技术中的特征提取工具，帮助构建我们的阿拉伯语多模态数据集。然后，我们使用最先进的基于转换器的模型验证了我们的数据集。尽管输出数据集的规模较小，实验结果表明，阿拉伯语多模态仍然具有非常大的潜力。",
    "tldr": "本文针对阿拉伯语DL-based MSA领域缺乏标准数据集的问题，通过使用最先进的转换器和单词对齐技术中的特征提取工具来设计管道流程，构建了阿拉伯语多模态数据集，实验表明其具有很大的潜力。",
    "en_tdlr": "This paper designs a pipeline using state-of-the-art transformers and feature extraction tools within word alignment techniques to construct an Arabic Multimodal dataset for sentiment analysis, validating it using a transformer-based model, despite the lack of standard datasets in the Arabic DL-based MSA field. The results show promising potential."
}