{
    "title": "FLGo: A Fully Customizable Federated Learning Platform. (arXiv:2306.12079v1 [cs.LG])",
    "abstract": "Federated learning (FL) has found numerous applications in healthcare, finance, and IoT scenarios. Many existing FL frameworks offer a range of benchmarks to evaluate the performance of FL under realistic conditions. However, the process of customizing simulations to accommodate application-specific settings, data heterogeneity, and system heterogeneity typically remains unnecessarily complicated. This creates significant hurdles for traditional ML researchers in exploring the usage of FL, while also compromising the shareability of codes across FL frameworks. To address this issue, we propose a novel lightweight FL platform called FLGo, to facilitate cross-application FL studies with a high degree of shareability. Our platform offers 40+ benchmarks, 20+ algorithms, and 2 system simulators as out-of-the-box plugins. We also provide user-friendly APIs for quickly customizing new plugins that can be readily shared and reused for improved reproducibility. Finally, we develop a range of ex",
    "link": "http://arxiv.org/abs/2306.12079",
    "context": "Title: FLGo: A Fully Customizable Federated Learning Platform. (arXiv:2306.12079v1 [cs.LG])\nAbstract: Federated learning (FL) has found numerous applications in healthcare, finance, and IoT scenarios. Many existing FL frameworks offer a range of benchmarks to evaluate the performance of FL under realistic conditions. However, the process of customizing simulations to accommodate application-specific settings, data heterogeneity, and system heterogeneity typically remains unnecessarily complicated. This creates significant hurdles for traditional ML researchers in exploring the usage of FL, while also compromising the shareability of codes across FL frameworks. To address this issue, we propose a novel lightweight FL platform called FLGo, to facilitate cross-application FL studies with a high degree of shareability. Our platform offers 40+ benchmarks, 20+ algorithms, and 2 system simulators as out-of-the-box plugins. We also provide user-friendly APIs for quickly customizing new plugins that can be readily shared and reused for improved reproducibility. Finally, we develop a range of ex",
    "path": "papers/23/06/2306.12079.json",
    "total_tokens": 1039,
    "translated_title": "FLGo：一个全可定制的联邦学习平台",
    "translated_abstract": "联邦学习在医疗保健、金融和物联网等领域有着广泛的应用。许多现有的联邦学习框架提供了一系列基准来评估联邦学习在真实情况下的性能。然而，定制模拟以适应特定应用环境、数据异构性和系统异构性的过程通常仍然过于复杂。这给传统的机器学习研究人员在探索联邦学习的使用时带来了重重的困难，同时也削弱了代码在联邦学习框架间的共享性。为了解决这个问题，我们提出了一个称之为FLGo的新型轻量联邦学习平台，以促进高度可共享的跨应用联邦学习研究。我们的平台提供了超过40种基准、20种算法和2种系统模拟器作为开箱即用的插件。我们还提供了用户友好的API，用于快速定制新的插件，使其可以轻松共享和重复使用，以提高可再现性。最后，我们开展了一系列实验，以展示我们平台的灵活性和适用性，包括医疗保健领域基于电子病历的诊断案例研究。",
    "tldr": "提出了一个名为FLGo的联邦学习平台，用于定制模拟以满足特定应用环境的需求。平台包含40+基准、20+算法和2个系统模拟器，并提供用户友好的API以用于快速开发新的插件，以提高共享性和可重复性。",
    "en_tdlr": "FLGo is a customized federated learning platform with 40+ benchmarks, 20+ algorithms, and 2 system simulators as out-of-the-box plugins, and offers user-friendly APIs for developing new plugins with improved shareability and reproducibility."
}