{
    "title": "A Gradient-based Approach for Online Robust Deep Neural Network Training with Noisy Labels. (arXiv:2306.05046v1 [cs.LG])",
    "abstract": "Learning with noisy labels is an important topic for scalable training in many real-world scenarios. However, few previous research considers this problem in the online setting, where the arrival of data is streaming. In this paper, we propose a novel gradient-based approach to enable the detection of noisy labels for the online learning of model parameters, named Online Gradient-based Robust Selection (OGRS). In contrast to the previous sample selection approach for the offline training that requires the estimation of a clean ratio of the dataset before each epoch of training, OGRS can automatically select clean samples by steps of gradient update from datasets with varying clean ratios without changing the parameter setting. During the training process, the OGRS method selects clean samples at each iteration and feeds the selected sample to incrementally update the model parameters. We provide a detailed theoretical analysis to demonstrate data selection process is converging to the ",
    "link": "http://arxiv.org/abs/2306.05046",
    "context": "Title: A Gradient-based Approach for Online Robust Deep Neural Network Training with Noisy Labels. (arXiv:2306.05046v1 [cs.LG])\nAbstract: Learning with noisy labels is an important topic for scalable training in many real-world scenarios. However, few previous research considers this problem in the online setting, where the arrival of data is streaming. In this paper, we propose a novel gradient-based approach to enable the detection of noisy labels for the online learning of model parameters, named Online Gradient-based Robust Selection (OGRS). In contrast to the previous sample selection approach for the offline training that requires the estimation of a clean ratio of the dataset before each epoch of training, OGRS can automatically select clean samples by steps of gradient update from datasets with varying clean ratios without changing the parameter setting. During the training process, the OGRS method selects clean samples at each iteration and feeds the selected sample to incrementally update the model parameters. We provide a detailed theoretical analysis to demonstrate data selection process is converging to the ",
    "path": "papers/23/06/2306.05046.json",
    "total_tokens": 878,
    "translated_title": "一种基于梯度的在线鲁棒深度神经网络训练方法：考虑噪声标签下的数据选择",
    "translated_abstract": "带有噪声标签的学习是许多实际应用中可扩展的训练问题，但是很少有之前的研究考虑在数据流场景下进行在线学习。本文提出了一种新颖的梯度方法，用于检测在线模型学习参数的噪声标签问题，称为Online Gradient-based Robust Selection（OGRS）。与使用离线训练样本选择所需的在每次训练之前估计数据集的干净比率的方法相比，OGRS可以在渐变更新步骤中自动选择不同干净比率的数据样本，而不需要改变参数设置。在训练过程中，OGRS方法在每次迭代中选择干净样本，并将所选样本馈送到增量更新模型参数。我们提供了详细的理论分析，证明了数据选择过程正在收敛。",
    "tldr": "本文提出了一种基于梯度的OGRS方法，用于在数据流场景下在线学习深度神经网络并处理噪声标签问题，能够自动选择不同干净比率的数据样本，无需改变参数设置。",
    "en_tdlr": "This paper proposes a gradient-based OGRS method for online learning of deep neural networks under noisy label problem, which can automatically select different clean ratio data samples without changing parameter settings in streaming scenarios."
}