{
    "title": "Coaching a Teachable Student. (arXiv:2306.10014v1 [cs.CV])",
    "abstract": "We propose a novel knowledge distillation framework for effectively teaching a sensorimotor student agent to drive from the supervision of a privileged teacher agent. Current distillation for sensorimotor agents methods tend to result in suboptimal learned driving behavior by the student, which we hypothesize is due to inherent differences between the input, modeling capacity, and optimization processes of the two agents. We develop a novel distillation scheme that can address these limitations and close the gap between the sensorimotor agent and its privileged teacher. Our key insight is to design a student which learns to align their input features with the teacher's privileged Bird's Eye View (BEV) space. The student then can benefit from direct supervision by the teacher over the internal representation learning. To scaffold the difficult sensorimotor learning task, the student model is optimized via a student-paced coaching mechanism with various auxiliary supervision. We further ",
    "link": "http://arxiv.org/abs/2306.10014",
    "context": "Title: Coaching a Teachable Student. (arXiv:2306.10014v1 [cs.CV])\nAbstract: We propose a novel knowledge distillation framework for effectively teaching a sensorimotor student agent to drive from the supervision of a privileged teacher agent. Current distillation for sensorimotor agents methods tend to result in suboptimal learned driving behavior by the student, which we hypothesize is due to inherent differences between the input, modeling capacity, and optimization processes of the two agents. We develop a novel distillation scheme that can address these limitations and close the gap between the sensorimotor agent and its privileged teacher. Our key insight is to design a student which learns to align their input features with the teacher's privileged Bird's Eye View (BEV) space. The student then can benefit from direct supervision by the teacher over the internal representation learning. To scaffold the difficult sensorimotor learning task, the student model is optimized via a student-paced coaching mechanism with various auxiliary supervision. We further ",
    "path": "papers/23/06/2306.10014.json",
    "total_tokens": 992,
    "translated_title": "指导可教导学生：一种基于知识蒸馏的传感器运动代理驾驶框架",
    "translated_abstract": "本论文提出了一种新颖的知识蒸馏框架，有效地教导传感器运动代理在特权教师代理的监督下驾驶。目前针对传感器运动代理的蒸馏方法往往导致学生的驾驶行为学习不佳，我们猜测这是由于两个代理之间输入、建模能力和优化过程方面固有的差异所致。我们设计了一种新颖的蒸馏方案，以解决这些限制并缩小传感器运动代理与其特权教师之间的差距。我们的关键洞察是设计一个学生模型，学生可以学习将其输入特征与教师的特权鸟瞰空间对齐。然后学生可以从教师对内部表示学习的直接监督中受益。为了支持困难的传感器运动学习任务，学生模型通过学生节奏的辅助指导机制进行优化。我们进一步提出了一种改进的无监督辅助学习机制和一种学生选择监督的自适应蒸馏框架。",
    "tldr": "本研究提出了一种新颖的知识蒸馏框架，通过设计一个学生模型并支持其传感器运动学习任务，实现了学生与教师之间的优化差距尽量小，进而提高了学生驾驶行为的学习质量。",
    "en_tdlr": "This paper proposes a novel knowledge distillation framework that effectively teaches a sensorimotor student agent to drive under the supervision of a privileged teacher agent. The framework achieves minimal optimization gap between the student and teacher by aligning the student's input features with the teacher's privileged perspective, resulting in improved driving behavior learning quality."
}