{
    "title": "Comparative Study of Predicting Stock Index Using Deep Learning Models. (arXiv:2306.13931v1 [cs.LG])",
    "abstract": "Time series forecasting has seen many methods attempted over the past few decades, including traditional technical analysis, algorithmic statistical models, and more recent machine learning and artificial intelligence approaches. Recently, neural networks have been incorporated into the forecasting scenario, such as the LSTM and conventional RNN approaches, which utilize short-term and long-term dependencies. This study evaluates traditional forecasting methods, such as ARIMA, SARIMA, and SARIMAX, and newer neural network approaches, such as DF-RNN, DSSM, and Deep AR, built using RNNs. The standard NIFTY-50 dataset from Kaggle is used to assess these models using metrics such as MSE, RMSE, MAPE, POCID, and Theil's U. Results show that Deep AR outperformed all other conventional deep learning and traditional approaches, with the lowest MAPE of 0.01 and RMSE of 189. Additionally, the performance of Deep AR and GRU did not degrade when the amount of training data was reduced, suggesting t",
    "link": "http://arxiv.org/abs/2306.13931",
    "context": "Title: Comparative Study of Predicting Stock Index Using Deep Learning Models. (arXiv:2306.13931v1 [cs.LG])\nAbstract: Time series forecasting has seen many methods attempted over the past few decades, including traditional technical analysis, algorithmic statistical models, and more recent machine learning and artificial intelligence approaches. Recently, neural networks have been incorporated into the forecasting scenario, such as the LSTM and conventional RNN approaches, which utilize short-term and long-term dependencies. This study evaluates traditional forecasting methods, such as ARIMA, SARIMA, and SARIMAX, and newer neural network approaches, such as DF-RNN, DSSM, and Deep AR, built using RNNs. The standard NIFTY-50 dataset from Kaggle is used to assess these models using metrics such as MSE, RMSE, MAPE, POCID, and Theil's U. Results show that Deep AR outperformed all other conventional deep learning and traditional approaches, with the lowest MAPE of 0.01 and RMSE of 189. Additionally, the performance of Deep AR and GRU did not degrade when the amount of training data was reduced, suggesting t",
    "path": "papers/23/06/2306.13931.json",
    "total_tokens": 892,
    "translated_title": "深度学习模型预测股票指数的比较研究",
    "translated_abstract": "过去几十年中现已尝试了许多时间序列预测方法，包括传统的技术分析、算法统计模型和最近的机器学习和人工智能方法。近年来，神经网络已经被纳入到预测场景中，如LSTM和常规RNN方法，利用了短期和长期的依赖关系。本研究评估了传统的预测方法，如ARIMA、SARIMA和SARIMAX，以及使用RNN构建的新型神经网络方法，如DF-RNN、DSSM和Deep AR。使用来自Kaggle的标准NIFTY-50数据集使用MSE、RMSE、MAPE、POCID和Theil's U等指标来评估这些模型。结果表明，Deep AR在所有其他常规深度学习和传统方法中表现最佳，其MAPE为0.01，RMSE为189。此外，当减少训练数据量时，Deep AR和GRU的性能不会降低，这表明它们的鲁棒性很高。",
    "tldr": "本文通过对传统预测方法和深度学习模型进行比较研究，证明Deep AR在股票指数预测方面表现最佳，具有较高的鲁棒性。",
    "en_tdlr": "This paper compares traditional forecasting methods and deep learning models for predicting stock indices, demonstrating that Deep AR performs the best with high robustness."
}