{
    "title": "Multi-Target Multiplicity: Flexibility and Fairness in Target Specification under Resource Constraints. (arXiv:2306.13738v1 [cs.LG])",
    "abstract": "Prediction models have been widely adopted as the basis for decision-making in domains as diverse as employment, education, lending, and health. Yet, few real world problems readily present themselves as precisely formulated prediction tasks. In particular, there are often many reasonable target variable options. Prior work has argued that this is an important and sometimes underappreciated choice, and has also shown that target choice can have a significant impact on the fairness of the resulting model. However, the existing literature does not offer a formal framework for characterizing the extent to which target choice matters in a particular task. Our work fills this gap by drawing connections between the problem of target choice and recent work on predictive multiplicity. Specifically, we introduce a conceptual and computational framework for assessing how the choice of target affects individuals' outcomes and selection rate disparities across groups. We call this multi-target mul",
    "link": "http://arxiv.org/abs/2306.13738",
    "context": "Title: Multi-Target Multiplicity: Flexibility and Fairness in Target Specification under Resource Constraints. (arXiv:2306.13738v1 [cs.LG])\nAbstract: Prediction models have been widely adopted as the basis for decision-making in domains as diverse as employment, education, lending, and health. Yet, few real world problems readily present themselves as precisely formulated prediction tasks. In particular, there are often many reasonable target variable options. Prior work has argued that this is an important and sometimes underappreciated choice, and has also shown that target choice can have a significant impact on the fairness of the resulting model. However, the existing literature does not offer a formal framework for characterizing the extent to which target choice matters in a particular task. Our work fills this gap by drawing connections between the problem of target choice and recent work on predictive multiplicity. Specifically, we introduce a conceptual and computational framework for assessing how the choice of target affects individuals' outcomes and selection rate disparities across groups. We call this multi-target mul",
    "path": "papers/23/06/2306.13738.json",
    "total_tokens": 1108,
    "translated_title": "多目标多样性：在资源约束下灵活性和公平性的目标规定",
    "translated_abstract": "预测模型已被广泛地应用于决策制定的各个领域，如就业、教育、贷款和健康。然而，少有真正的实际问题可以被精确定义为预测任务。特别是，通常有许多合理的目标变量选项。以前的工作认为，这是一个重要的而且有时被低估的选择，也表明了目标选择对结果模型的公正性有重大影响。然而，现有的文献并没有提供一个形式化的框架来描述目标选择在特定任务中的重要程度。我们的工作通过在目标选择问题和最近关于预测多样性的工作之间建立联系来填补这一空白。具体来说，我们介绍了一个概念性和计算框架，评估了目标选择在多样性和群体选择率不平等方面影响个人结果的程度。我们称之为多目标多样性。我们还开发了一种算法，用于在资源约束下识别平衡灵活性和公正性的最优目标集。我们通过将其应用于两个真实世界的数据集来展示我们方法的实际实用性。我们的工作凸显出在建模过程中明确考虑目标变量选择的重要性，并提供了一种原则性的方法去做到这一点。",
    "tldr": "该研究提出了一个新的概念和计算框架，称之为多目标多样性，用于评估目标选择对过程中灵活性和公平性的影响。研究还开发了一种算法，旨在在资源约束下平衡灵活性和公正性，并将其应用于两个真实世界的数据集中。",
    "en_tdlr": "This study proposes a new conceptual and computational framework, called multi-target multiplicity, for evaluating the impact of target selection on flexibility and fairness during the process. The study also develops an algorithm that aims to balance flexibility and fairness under resource constraints and applies it to two real world datasets."
}