{
    "title": "What if We Enrich day-ahead Solar Irradiance Time Series Forecasting with Spatio-Temporal Context?. (arXiv:2306.01112v1 [cs.LG])",
    "abstract": "Solar power harbors immense potential in mitigating climate change by substantially reducing CO$_{2}$ emissions. Nonetheless, the inherent variability of solar irradiance poses a significant challenge for seamlessly integrating solar power into the electrical grid. While the majority of prior research has centered on employing purely time series-based methodologies for solar forecasting, only a limited number of studies have taken into account factors such as cloud cover or the surrounding physical context. In this paper, we put forth a deep learning architecture designed to harness spatio-temporal context using satellite data, to attain highly accurate \\textit{day-ahead} time-series forecasting for any given station, with a particular emphasis on forecasting Global Horizontal Irradiance (GHI). We also suggest a methodology to extract a distribution for each time step prediction, which can serve as a very valuable measure of uncertainty attached to the forecast. When evaluating models,",
    "link": "http://arxiv.org/abs/2306.01112",
    "context": "Title: What if We Enrich day-ahead Solar Irradiance Time Series Forecasting with Spatio-Temporal Context?. (arXiv:2306.01112v1 [cs.LG])\nAbstract: Solar power harbors immense potential in mitigating climate change by substantially reducing CO$_{2}$ emissions. Nonetheless, the inherent variability of solar irradiance poses a significant challenge for seamlessly integrating solar power into the electrical grid. While the majority of prior research has centered on employing purely time series-based methodologies for solar forecasting, only a limited number of studies have taken into account factors such as cloud cover or the surrounding physical context. In this paper, we put forth a deep learning architecture designed to harness spatio-temporal context using satellite data, to attain highly accurate \\textit{day-ahead} time-series forecasting for any given station, with a particular emphasis on forecasting Global Horizontal Irradiance (GHI). We also suggest a methodology to extract a distribution for each time step prediction, which can serve as a very valuable measure of uncertainty attached to the forecast. When evaluating models,",
    "path": "papers/23/06/2306.01112.json",
    "total_tokens": 974,
    "translated_title": "如何用时空上下文丰富日前太阳辐射时序预测？",
    "translated_abstract": "太阳能潜力巨大，可有效减少CO2排放以缓解气候变化。然而，太阳辐射的固有变异性给无缝融入电网带来了重大挑战。本文提出了一种深度学习框架，利用卫星数据来捕捉时空上下文信息，以实现对当地任何给定站点高精度的日前时序预测，特别强调了对全球水平辐射（GHI）的预测。此外，我们还提出了一种提取每个时间步预测分布的方法，可作为预测不确定度的有价值度量。我们在美国的三个站点上使用数据评估模型，并展示了引入时空上下文所带来的显著性能提升，表明这种方法胜过不采用卫星数据的时序和机器学习模型。",
    "tldr": "本文提出了一种深度学习框架，使用卫星数据捕捉时空上下文信息，实现了对太阳辐射时序的高精度日前预测，表现优于不采用卫星数据的时序和机器学习模型，可帮助更有效地将太阳能融入电网。",
    "en_tdlr": "This paper proposes a deep learning framework that utilizes spatio-temporal context using satellite data to achieve highly accurate day-ahead time-series forecasting for solar irradiance. The methodology is evaluated with data from three stations in the United States, demonstrating significant improvement over models that do not incorporate satellite data. The framework can facilitate the integration of solar power into the electrical grid more effectively."
}