{
    "title": "Unsupervised Extractive Summarization of Emotion Triggers. (arXiv:2306.01444v1 [cs.CL])",
    "abstract": "Understanding what leads to emotions during large-scale crises is important as it can provide groundings for expressed emotions and subsequently improve the understanding of ongoing disasters. Recent approaches trained supervised models to both detect emotions and explain emotion triggers (events and appraisals) via abstractive summarization. However, obtaining timely and qualitative abstractive summaries is expensive and extremely time-consuming, requiring highly-trained expert annotators. In time-sensitive, high-stake contexts, this can block necessary responses. We instead pursue unsupervised systems that extract triggers from text. First, we introduce CovidET-EXT, augmenting (Zhan et al. 2022)'s abstractive dataset (in the context of the COVID-19 crisis) with extractive triggers. Second, we develop new unsupervised learning models that can jointly detect emotions and summarize their triggers. Our best approach, entitled Emotion-Aware Pagerank, incorporates emotion information from ",
    "link": "http://arxiv.org/abs/2306.01444",
    "context": "Title: Unsupervised Extractive Summarization of Emotion Triggers. (arXiv:2306.01444v1 [cs.CL])\nAbstract: Understanding what leads to emotions during large-scale crises is important as it can provide groundings for expressed emotions and subsequently improve the understanding of ongoing disasters. Recent approaches trained supervised models to both detect emotions and explain emotion triggers (events and appraisals) via abstractive summarization. However, obtaining timely and qualitative abstractive summaries is expensive and extremely time-consuming, requiring highly-trained expert annotators. In time-sensitive, high-stake contexts, this can block necessary responses. We instead pursue unsupervised systems that extract triggers from text. First, we introduce CovidET-EXT, augmenting (Zhan et al. 2022)'s abstractive dataset (in the context of the COVID-19 crisis) with extractive triggers. Second, we develop new unsupervised learning models that can jointly detect emotions and summarize their triggers. Our best approach, entitled Emotion-Aware Pagerank, incorporates emotion information from ",
    "path": "papers/23/06/2306.01444.json",
    "total_tokens": 896,
    "translated_title": "无监督情感触发词抽取式摘要",
    "translated_abstract": "在大型危机事件中理解导致情绪产生的因素很重要，因为这可以为表达的情感提供基础，并随后改善对正在发生的灾害的理解。最近的方法训练了监督模型，通过摘要提取来检测情感和解释情感触发器（事件和评估）。然而，在时间敏感、高风险的情境下，获取及时和优质的摘要非常昂贵且耗时，需要经过高度训练的专家注释者。在这种情况下，这可能会阻碍必要的响应。我们转而追求从文本中提取触发器的无监督系统。首先，我们引入 CovidET-EXT 数据集，扩充了（Zhan 等人，2022）在 COVID-19 危机背景下的摘要数据集。其次，我们开发了新的无监督学习模型，可以共同检测情感并总结它们的触发器。我们最好的方法是 Emotion-Aware Pagerank，它从文本中提取情感信息。",
    "tldr": "本文介绍了一个无监督的系统，能够从文本中提取情感触发器并总结它们，以取代耗时昂贵的摘要生成过程，为灾难响应提供必要信息。",
    "en_tdlr": "This paper introduces an unsupervised system that extracts emotional triggers from text and summarizes them, replacing the costly and time-consuming process of generating abstractive summaries, providing necessary information for disaster response."
}