{
    "title": "Model Families for Multi-Criteria Decision Support: A COVID-19 Case Study. (arXiv:2306.13683v1 [cs.AI])",
    "abstract": "Continued model-based decision support is associated with particular challenges, especially in long-term projects. Due to the regularly changing questions and the often changing understanding of the underlying system, the models used must be regularly re-evaluated, -modelled and -implemented with respect to changing modelling purpose, system boundaries and mapped causalities. Usually, this leads to models with continuously growing complexity and volume. In this work we aim to reevaluate the idea of the model family, dating back to the 1990s, and use it to promote this as a mindset in the creation of decision support frameworks in large research projects. The idea is to generally not develop and enhance a single standalone model, but to divide the research tasks into interacting smaller models which specifically correspond to the research question. This strategy comes with many advantages, which we explain using the example of a family of models for decision support in the COVID-19 cris",
    "link": "http://arxiv.org/abs/2306.13683",
    "context": "Title: Model Families for Multi-Criteria Decision Support: A COVID-19 Case Study. (arXiv:2306.13683v1 [cs.AI])\nAbstract: Continued model-based decision support is associated with particular challenges, especially in long-term projects. Due to the regularly changing questions and the often changing understanding of the underlying system, the models used must be regularly re-evaluated, -modelled and -implemented with respect to changing modelling purpose, system boundaries and mapped causalities. Usually, this leads to models with continuously growing complexity and volume. In this work we aim to reevaluate the idea of the model family, dating back to the 1990s, and use it to promote this as a mindset in the creation of decision support frameworks in large research projects. The idea is to generally not develop and enhance a single standalone model, but to divide the research tasks into interacting smaller models which specifically correspond to the research question. This strategy comes with many advantages, which we explain using the example of a family of models for decision support in the COVID-19 cris",
    "path": "papers/23/06/2306.13683.json",
    "total_tokens": 856,
    "translated_title": "多准则决策支持的模型家族：以COVID-19为例的研究",
    "translated_abstract": "基于模型的决策支持在长期项目中存在诸多挑战，需要定期重新评估、建模和实现模型，以适应不断变化的建模目的、系统范围和映射因果关系。本文重新评估了20世纪90年代提出的模型家族概念，并将其作为一种创造大型研究项目决策支持框架的思维方式。我们的策略是将研究任务分解为相互作用的较小模型，这些模型专门对应于研究问题。我们通过COVID-19决策支持模型家族的示例来说明这种策略带来的许多优势。",
    "tldr": "本文提出了一种模型家族的思维方式，将研究任务分解为相互作用的较小模型以适应不断变化的建模目的、系统范围和映射因果关系。以COVID-19为例，这种策略带来许多优势。",
    "en_tdlr": "This work proposes a mindset of using a family of models for developing decision support frameworks in large research projects. The strategy is to decompose the research tasks into smaller models that correspond to specific research questions and adapt to changing modeling purposes, system boundaries, and mapped causalities. Using the example of a family of models for COVID-19 decision support, the approach has many advantages."
}