{
    "title": "Physics-informed neural networks modeling for systems with moving immersed boundaries: application to an unsteady flow past a plunging foil. (arXiv:2306.13395v1 [physics.flu-dyn])",
    "abstract": "Recently, physics informed neural networks (PINNs) have been explored extensively for solving various forward and inverse problems and facilitating querying applications in fluid mechanics applications. However, work on PINNs for unsteady flows past moving bodies, such as flapping wings is scarce. Earlier studies mostly relied on transferring to a body attached frame of reference which is restrictive towards handling multiple moving bodies or deforming structures. Hence, in the present work, an immersed boundary aware framework has been explored for developing surrogate models for unsteady flows past moving bodies. Specifically, simultaneous pressure recovery and velocity reconstruction from Immersed boundary method (IBM) simulation data has been investigated. While, efficacy of velocity reconstruction has been tested against the fine resolution IBM data, as a step further, the pressure recovered was compared with that of an arbitrary Lagrange Eulerian (ALE) based solver. Under this fr",
    "link": "http://arxiv.org/abs/2306.13395",
    "context": "Title: Physics-informed neural networks modeling for systems with moving immersed boundaries: application to an unsteady flow past a plunging foil. (arXiv:2306.13395v1 [physics.flu-dyn])\nAbstract: Recently, physics informed neural networks (PINNs) have been explored extensively for solving various forward and inverse problems and facilitating querying applications in fluid mechanics applications. However, work on PINNs for unsteady flows past moving bodies, such as flapping wings is scarce. Earlier studies mostly relied on transferring to a body attached frame of reference which is restrictive towards handling multiple moving bodies or deforming structures. Hence, in the present work, an immersed boundary aware framework has been explored for developing surrogate models for unsteady flows past moving bodies. Specifically, simultaneous pressure recovery and velocity reconstruction from Immersed boundary method (IBM) simulation data has been investigated. While, efficacy of velocity reconstruction has been tested against the fine resolution IBM data, as a step further, the pressure recovered was compared with that of an arbitrary Lagrange Eulerian (ALE) based solver. Under this fr",
    "path": "papers/23/06/2306.13395.json",
    "total_tokens": 1134,
    "translated_title": "物理信息神经网络在移动浸入边界系统建模中的应用：以波浪式翼过渡流为例",
    "translated_abstract": "最近，物理信息神经网络（PINNs）在解决各种正向和反向问题以及在流体力学应用中促进查询应用方面得到了广泛探索。然而，仅有极少数关于PINNs用于过渡流通过动态体，例如振动翼的工作。早期的研究大部分依赖于转换为附在体上的参考系，这对于处理多个移动体或变形结构是有限制的。因此，在本研究中，探索了一种浸入式边界感知框架，用于开发过渡流通过移动物体的代理模型。具体而言，研究了从浸入边界方法（IBM）模拟数据中同时恢复压力和速度的效果。虽然，速度重建的有效性已针对精细分辨率IBM数据进行了测试，但作为进一步的步骤，恢复的压力与任意拉格朗日-欧拉（ALE）求解器的压力进行了比较。在这个框架下，所提出的PINN模型能够捕捉与精细分辨率IBM模拟相当的瞬态特征。这样的模型可用于实时流控和优化，并且本研究可扩展到涉及多个移动体和流-结构相互作用的更复杂系统中。",
    "tldr": "本研究探索了一种用于移动浸入边界系统的物理信息神经网络模型，该模型能够捕捉与精细IBM模拟相当的瞬态特征，并可用于实时流控和优化。此外，该研究可扩展到涉及多个移动体和流-结构相互作用的更复杂系统中。",
    "en_tdlr": "This study proposes a physics-informed neural network model for systems with moving immersed boundaries, which can capture transient features on par with fine resolution simulations, and can be used for real-time flow control and optimization. The study can be extended to more complex systems involving multiple moving bodies and fluid-structure interactions."
}