{
    "title": "Laxity-Aware Scalable Reinforcement Learning for HVAC Control. (arXiv:2306.16619v1 [eess.SY])",
    "abstract": "Demand flexibility plays a vital role in maintaining grid balance, reducing peak demand, and saving customers' energy bills. Given their highly shiftable load and significant contribution to a building's energy consumption, Heating, Ventilation, and Air Conditioning (HVAC) systems can provide valuable demand flexibility to the power systems by adjusting their energy consumption in response to electricity price and power system needs. To exploit this flexibility in both operation time and power, it is imperative to accurately model and aggregate the load flexibility of a large population of HVAC systems as well as designing effective control algorithms. In this paper, we tackle the curse of dimensionality issue in modeling and control by utilizing the concept of laxity to quantify the emergency level of each HVAC operation request. We further propose a two-level approach to address energy optimization for a large population of HVAC systems. The lower level involves an aggregator to aggr",
    "link": "http://arxiv.org/abs/2306.16619",
    "context": "Title: Laxity-Aware Scalable Reinforcement Learning for HVAC Control. (arXiv:2306.16619v1 [eess.SY])\nAbstract: Demand flexibility plays a vital role in maintaining grid balance, reducing peak demand, and saving customers' energy bills. Given their highly shiftable load and significant contribution to a building's energy consumption, Heating, Ventilation, and Air Conditioning (HVAC) systems can provide valuable demand flexibility to the power systems by adjusting their energy consumption in response to electricity price and power system needs. To exploit this flexibility in both operation time and power, it is imperative to accurately model and aggregate the load flexibility of a large population of HVAC systems as well as designing effective control algorithms. In this paper, we tackle the curse of dimensionality issue in modeling and control by utilizing the concept of laxity to quantify the emergency level of each HVAC operation request. We further propose a two-level approach to address energy optimization for a large population of HVAC systems. The lower level involves an aggregator to aggr",
    "path": "papers/23/06/2306.16619.json",
    "total_tokens": 890,
    "translated_title": "Laxity-Aware可扩展强化学习用于HVAC控制",
    "translated_abstract": "需求灵活性在维持电网平衡、降低峰值需求和节约客户能源费用方面起着重要作用。由于其可调整负荷和对建筑能源消耗的显著影响，采暖、通风和空调（HVAC）系统可以通过根据电价和电力系统需求调整能源消耗来提供有价值的需求灵活性给电力系统。为了利用这种在操作时间和功率上的灵活性，准确建模和合并大量HVAC系统的负荷灵活性以及设计有效的控制算法至关重要。在本文中，我们利用松弛度的概念来量化每个HVAC操作请求的紧急程度，以解决建模和控制中的维度灾难问题。我们进一步提出了一种两级方法来解决大量HVAC系统的能源优化问题。下层涉及一个聚合器以合并和控制大量HVAC系统的能源灵活性，上层涉及一个强化学习智能体来优化聚合器的决策。",
    "tldr": "本文介绍了一种利用松弛度概念来量化HVAC操作请求紧急程度的方法，并提出了一个两级方法来优化大量HVAC系统的能源消耗。"
}