{
    "title": "Assisting Language Learners: Automated Trans-Lingual Definition Generation via Contrastive Prompt Learning. (arXiv:2306.06058v1 [cs.CL])",
    "abstract": "The standard definition generation task requires to automatically produce mono-lingual definitions (e.g., English definitions for English words), but ignores that the generated definitions may also consist of unfamiliar words for language learners. In this work, we propose a novel task of Trans-Lingual Definition Generation (TLDG), which aims to generate definitions in another language, i.e., the native speaker's language. Initially, we explore the unsupervised manner of this task and build up a simple implementation of fine-tuning the multi-lingual machine translation model. Then, we develop two novel methods, Prompt Combination and Contrastive Prompt Learning, for further enhancing the quality of the generation. Our methods are evaluated against the baseline Pipeline method in both rich- and low-resource settings, and we empirically establish its superiority in generating higher-quality trans-lingual definitions.",
    "link": "http://arxiv.org/abs/2306.06058",
    "context": "Title: Assisting Language Learners: Automated Trans-Lingual Definition Generation via Contrastive Prompt Learning. (arXiv:2306.06058v1 [cs.CL])\nAbstract: The standard definition generation task requires to automatically produce mono-lingual definitions (e.g., English definitions for English words), but ignores that the generated definitions may also consist of unfamiliar words for language learners. In this work, we propose a novel task of Trans-Lingual Definition Generation (TLDG), which aims to generate definitions in another language, i.e., the native speaker's language. Initially, we explore the unsupervised manner of this task and build up a simple implementation of fine-tuning the multi-lingual machine translation model. Then, we develop two novel methods, Prompt Combination and Contrastive Prompt Learning, for further enhancing the quality of the generation. Our methods are evaluated against the baseline Pipeline method in both rich- and low-resource settings, and we empirically establish its superiority in generating higher-quality trans-lingual definitions.",
    "path": "papers/23/06/2306.06058.json",
    "total_tokens": 886,
    "translated_title": "协助语言学习者：通过对比提示学习实现的自动跨语言定义生成",
    "translated_abstract": "标准的定义生成任务要求自动生成单语言定义（例如，英文单词的英文定义），但忽略了生成的定义对于语言学习者同样存在生僻词汇。本研究提出了一项新的跨语言定义生成（TLDG）任务，旨在生成另一种语言的定义，即母语使用者的语言。我们首先探索了这项任务的非监督方式，并建立了一个简单的实现方法，即微调多语言机器翻译模型。然后，我们开发了两种新方法，Prompt Combination和Contrastive Prompt Learning，以进一步提高生成的质量。我们将我们的方法与基线管道方法在丰富和低资源环境下进行了评估，并在实践中证明了它在生成更高质量的跨语言定义方面的优越性。",
    "tldr": "本研究提出了一个Trans-Lingual Definition Generation (TLDG)任务，通过对比提示学习实现的自动跨语言定义生成。该方法通过生成母语使用者的语言的定义，协助语言学习者理解生僻词汇，实验证明对于生成更高质量的跨语言定义方面有显著的优越性。",
    "en_tdlr": "This study proposes a Trans-Lingual Definition Generation (TLDG) task, which is achieved through automated cross-lingual definition generation via contrastive prompt learning. The method helps language learners understand unfamiliar words by generating definitions in the native speaker's language and shows significant superiority in generating higher-quality trans-lingual definitions."
}