{
    "title": "CHORUS: Foundation Models for Unified Data Discovery and Exploration. (arXiv:2306.09610v1 [cs.DB])",
    "abstract": "We explore the application of foundation models to data discovery and exploration tasks. Foundation models are large language models (LLMs) that show promising performance on a range of diverse tasks unrelated to their training. We show that these models are highly applicable to the data discovery and data exploration domain. When carefully used, they have superior capability on three representative tasks: table-class detection, column-type annotation and join-column prediction. On all three tasks, we show that a foundation-model-based approach outperforms the task-specific models and so the state of the art. Further, our approach often surpasses human-expert task performance. This suggests a future direction in which disparate data management tasks can be unified under foundation models.",
    "link": "http://arxiv.org/abs/2306.09610",
    "context": "Title: CHORUS: Foundation Models for Unified Data Discovery and Exploration. (arXiv:2306.09610v1 [cs.DB])\nAbstract: We explore the application of foundation models to data discovery and exploration tasks. Foundation models are large language models (LLMs) that show promising performance on a range of diverse tasks unrelated to their training. We show that these models are highly applicable to the data discovery and data exploration domain. When carefully used, they have superior capability on three representative tasks: table-class detection, column-type annotation and join-column prediction. On all three tasks, we show that a foundation-model-based approach outperforms the task-specific models and so the state of the art. Further, our approach often surpasses human-expert task performance. This suggests a future direction in which disparate data management tasks can be unified under foundation models.",
    "path": "papers/23/06/2306.09610.json",
    "total_tokens": 789,
    "translated_title": "CHORUS: 统一数据发现和探索的基础模型。",
    "translated_abstract": "我们探索了将基础模型应用于数据发现和探索任务中。基础模型是一种大型语言模型 (LLMs)，在各种与其训练无关的不同任务上表现出了良好的性能。我们表明这些模型在数据发现和数据探索领域非常适用。在谨慎使用的情况下，它们具有优越的能力，可以优化表格类检测、列类型注释和联接列预测这三种代表性任务。在这三个任务上，我们展示了基于基础模型的方法优于任务特定的模型和最先进的技术。此外，我们的方法通常超过人类专家的任务表现。这表明了将不同的数据管理任务统一在基础模型下的未来方向。",
    "tldr": "研究者探索将大型语言模型应用于数据发现和探索任务中，证明这些模型在表格类检测、列类型注释和联接列预测中具有优越性能，并有望将不同的数据管理任务统一在基础模型下。",
    "en_tdlr": "The researchers explore the application of foundation models to data discovery and exploration tasks, demonstrating their superior performance in table-class detection, column-type annotation, and join-column prediction, and suggesting a future direction of unifying diverse data management tasks under foundation models."
}