{
    "title": "Structure-free Graph Condensation: From Large-scale Graphs to Condensed Graph-free Data. (arXiv:2306.02664v2 [cs.LG] UPDATED)",
    "abstract": "Graph condensation, which reduces the size of a large-scale graph by synthesizing a small-scale condensed graph as its substitution, has immediate benefits for various graph learning tasks. However, existing graph condensation methods rely on the joint optimization of nodes and structures in the condensed graph, and overlook critical issues in effectiveness and generalization ability. In this paper, we advocate a new Structure-Free Graph Condensation paradigm, named SFGC, to distill a large-scale graph into a small-scale graph node set without explicit graph structures, i.e., graph-free data. Our idea is to implicitly encode topology structure information into the node attributes in the synthesized graph-free data, whose topology is reduced to an identity matrix. Specifically, SFGC contains two collaborative components: (1) a training trajectory meta-matching scheme for effectively synthesizing small-scale graph-free data; (2) a graph neural feature score metric for dynamically evaluat",
    "link": "http://arxiv.org/abs/2306.02664",
    "context": "Title: Structure-free Graph Condensation: From Large-scale Graphs to Condensed Graph-free Data. (arXiv:2306.02664v2 [cs.LG] UPDATED)\nAbstract: Graph condensation, which reduces the size of a large-scale graph by synthesizing a small-scale condensed graph as its substitution, has immediate benefits for various graph learning tasks. However, existing graph condensation methods rely on the joint optimization of nodes and structures in the condensed graph, and overlook critical issues in effectiveness and generalization ability. In this paper, we advocate a new Structure-Free Graph Condensation paradigm, named SFGC, to distill a large-scale graph into a small-scale graph node set without explicit graph structures, i.e., graph-free data. Our idea is to implicitly encode topology structure information into the node attributes in the synthesized graph-free data, whose topology is reduced to an identity matrix. Specifically, SFGC contains two collaborative components: (1) a training trajectory meta-matching scheme for effectively synthesizing small-scale graph-free data; (2) a graph neural feature score metric for dynamically evaluat",
    "path": "papers/23/06/2306.02664.json",
    "total_tokens": 895,
    "translated_title": "无结构图压缩：从大规模图到压缩的无结构图数据",
    "translated_abstract": "图压缩通过合成一个小规模的压缩图来减小大规模图的大小，对各种图学习任务有直接的益处。然而，现有的图压缩方法依赖于对压缩图中节点和结构的联合优化，忽视了效果和泛化能力方面的关键问题。本文提出一种新的无结构图压缩范式，称为SFGC，将大规模图精炼为一个小规模图节点集，不包含显式的图结构，即图无数据。我们的思路是将拓扑结构信息隐式编码到合成的无结构图数据的节点属性中，其拓扑结构被简化为一个单位矩阵。具体而言，SFGC包含两个协同组件：（1）用于有效合成小规模无结构图数据的训练轨迹元匹配方案；（2）用于动态评估图神经特征分数的图属性评价度量。",
    "tldr": "本文提出了一种新的无结构图压缩范式，通过将拓扑结构信息隐式编码到合成的无结构图数据的节点属性中，将大规模图压缩为一个小规模图节点集，不包含显式的图结构。",
    "en_tdlr": "This paper proposes a new paradigm of structure-free graph condensation, which compresses a large-scale graph into a small-scale graph node set without explicit graph structures by implicitly encoding topology structure information into the node attributes in the synthesized graph-free data."
}