{
    "title": "Domain-Aware Few-Shot Learning for Optical Coherence Tomography Noise Reduction. (arXiv:2306.08102v1 [eess.IV])",
    "abstract": "Speckle noise has long been an extensively studied problem in medical imaging. In recent years, there have been significant advances in leveraging deep learning methods for noise reduction. Nevertheless, adaptation of supervised learning models to unseen domains remains a challenging problem. Specifically, deep neural networks (DNNs) trained for computational imaging tasks are vulnerable to changes in the acquisition system's physical parameters, such as: sampling space, resolution, and contrast. Even within the same acquisition system, performance degrades across datasets of different biological tissues. In this work, we propose a few-shot supervised learning framework for optical coherence tomography (OCT) noise reduction, that offers a dramatic increase in training speed and requires only a single image, or part of an image, and a corresponding speckle suppressed ground truth, for training. Furthermore, we formulate the domain shift problem for OCT diverse imaging systems, and prove",
    "link": "http://arxiv.org/abs/2306.08102",
    "context": "Title: Domain-Aware Few-Shot Learning for Optical Coherence Tomography Noise Reduction. (arXiv:2306.08102v1 [eess.IV])\nAbstract: Speckle noise has long been an extensively studied problem in medical imaging. In recent years, there have been significant advances in leveraging deep learning methods for noise reduction. Nevertheless, adaptation of supervised learning models to unseen domains remains a challenging problem. Specifically, deep neural networks (DNNs) trained for computational imaging tasks are vulnerable to changes in the acquisition system's physical parameters, such as: sampling space, resolution, and contrast. Even within the same acquisition system, performance degrades across datasets of different biological tissues. In this work, we propose a few-shot supervised learning framework for optical coherence tomography (OCT) noise reduction, that offers a dramatic increase in training speed and requires only a single image, or part of an image, and a corresponding speckle suppressed ground truth, for training. Furthermore, we formulate the domain shift problem for OCT diverse imaging systems, and prove",
    "path": "papers/23/06/2306.08102.json",
    "total_tokens": 929,
    "translated_title": "面向域感知的光学相干断层扫描噪音降低的少样本学习",
    "translated_abstract": "散斑噪声一直是医学成像中一个被广泛研究的问题。近年来，利用深度学习方法进行降噪方面取得了重大进展。然而，将有监督的学习模型适应到新领域仍然是一个具有挑战性的问题。本文提出了一种少样本监督学习框架，用于光学相干断层扫描噪音降低，大大提高了训练速度，只需要单张图像或部分图像以及相应的去斑地面实况进行训练。此外，我们对光学相干断层扫描不同成像系统的域转移问题进行了制定，并证明了我们提出的方法适应不同成像领域的有效性。我们的方法在合成和真实的光学相干断层扫描数据集上均优于现有方法，展示了它很好地推广到新领域的能力。",
    "tldr": "本文提出了一种少样本监督学习框架，用于光学相干断层扫描噪音降低，并成功推广到不同成像领域。",
    "en_tdlr": "This paper proposes a few-shot supervised learning framework for optical coherence tomography (OCT) noise reduction, which is capable of adapting to different imaging domains and outperforms state-of-the-art methods on synthetic and real OCT datasets."
}