{
    "title": "Mitigating Communication Costs in Neural Networks: The Role of Dendritic Nonlinearity. (arXiv:2306.11950v1 [cs.NE])",
    "abstract": "Our comprehension of biological neuronal networks has profoundly influenced the evolution of artificial neural networks (ANNs). However, the neurons employed in ANNs exhibit remarkable deviations from their biological analogs, mainly due to the absence of complex dendritic trees encompassing local nonlinearity. Despite such disparities, previous investigations have demonstrated that point neurons can functionally substitute dendritic neurons in executing computational tasks. In this study, we scrutinized the importance of nonlinear dendrites within neural networks. By employing machine-learning methodologies, we assessed the impact of dendritic structure nonlinearity on neural network performance. Our findings reveal that integrating dendritic structures can substantially enhance model capacity and performance while keeping signal communication costs effectively restrained. This investigation offers pivotal insights that hold considerable implications for the development of future neur",
    "link": "http://arxiv.org/abs/2306.11950",
    "context": "Title: Mitigating Communication Costs in Neural Networks: The Role of Dendritic Nonlinearity. (arXiv:2306.11950v1 [cs.NE])\nAbstract: Our comprehension of biological neuronal networks has profoundly influenced the evolution of artificial neural networks (ANNs). However, the neurons employed in ANNs exhibit remarkable deviations from their biological analogs, mainly due to the absence of complex dendritic trees encompassing local nonlinearity. Despite such disparities, previous investigations have demonstrated that point neurons can functionally substitute dendritic neurons in executing computational tasks. In this study, we scrutinized the importance of nonlinear dendrites within neural networks. By employing machine-learning methodologies, we assessed the impact of dendritic structure nonlinearity on neural network performance. Our findings reveal that integrating dendritic structures can substantially enhance model capacity and performance while keeping signal communication costs effectively restrained. This investigation offers pivotal insights that hold considerable implications for the development of future neur",
    "path": "papers/23/06/2306.11950.json",
    "total_tokens": 835,
    "translated_title": "缓解神经网络中的通信成本：树突非线性的作用",
    "translated_abstract": "生物神经网络的理解深刻地影响了人工神经网络（ANNs）的发展。然而，ANN中使用的神经元与其生物模型存在明显偏差，主要是由于缺少包含局部非线性的复杂树突。尽管存在这样的差异，先前的研究表明点神经元可以在执行计算任务方面在功能上替代树突神经元。在本研究中，我们审查了神经网络中非线性树突的重要性。通过使用机器学习方法，我们评估了树突结构非线性对神经网络性能的影响。我们的发现表明，整合树突结构可以在保持信号通信成本有效抑制的同时，显著增强模型容量和性能。这项研究提供了重要的见解，对未来神经网络的发展具有重要的意义。",
    "tldr": "本研究发现，在神经网络中整合非线性树突结构可以显著提高模型的容量和性能，同时控制信号通信成本，这对于未来神经网络的发展具有重要的意义。",
    "en_tdlr": "This study found that integrating nonlinear dendritic structures in neural networks can significantly enhance model capacity and performance while controlling signal communication costs, which has important implications for future development of neural networks."
}