{
    "title": "Counting Crowds in Bad Weather. (arXiv:2306.01209v1 [cs.CV])",
    "abstract": "Crowd counting has recently attracted significant attention in the field of computer vision due to its wide applications to image understanding. Numerous methods have been proposed and achieved state-of-the-art performance for real-world tasks. However, existing approaches do not perform well under adverse weather such as haze, rain, and snow since the visual appearances of crowds in such scenes are drastically different from those images in clear weather of typical datasets. In this paper, we propose a method for robust crowd counting in adverse weather scenarios. Instead of using a two-stage approach that involves image restoration and crowd counting modules, our model learns effective features and adaptive queries to account for large appearance variations. With these weather queries, the proposed model can learn the weather information according to the degradation of the input image and optimize with the crowd counting module simultaneously. Experimental results show that the propo",
    "link": "http://arxiv.org/abs/2306.01209",
    "context": "Title: Counting Crowds in Bad Weather. (arXiv:2306.01209v1 [cs.CV])\nAbstract: Crowd counting has recently attracted significant attention in the field of computer vision due to its wide applications to image understanding. Numerous methods have been proposed and achieved state-of-the-art performance for real-world tasks. However, existing approaches do not perform well under adverse weather such as haze, rain, and snow since the visual appearances of crowds in such scenes are drastically different from those images in clear weather of typical datasets. In this paper, we propose a method for robust crowd counting in adverse weather scenarios. Instead of using a two-stage approach that involves image restoration and crowd counting modules, our model learns effective features and adaptive queries to account for large appearance variations. With these weather queries, the proposed model can learn the weather information according to the degradation of the input image and optimize with the crowd counting module simultaneously. Experimental results show that the propo",
    "path": "papers/23/06/2306.01209.json",
    "total_tokens": 870,
    "translated_title": "恶劣天气下的人群计数",
    "translated_abstract": "由于其广泛应用于图像理解，人群计数最近在计算机视觉领域引起了相当大的关注。已经提出了许多方法，并实现了实际任务的最新性能。然而，现有方法在恶劣天气（例如雾，雨和雪）下表现不佳，因为这种情境下的人群视觉外观与典型数据集中清晰天气下的图像差异巨大。在本文中，我们提出了一种在恶劣天气场景下强健的人群计数方法。我们的模型不是使用涉及图像恢复和人群计数模块的两阶段方法，而是学习有效的特征和自适应查询来考虑大的外观变化。使用这些天气查询，该模型可以根据输入图像的降级来学习天气信息，并同时优化人群计数模块。实验结果表明，所提出的方法可以在恶劣天气下获得更准确的人群计数性能。",
    "tldr": "本文提出了一种在恶劣天气条件下进行人群计数的方法，通过学习天气信息和优化人群计数模块来实现，实验结果表明该方法具有更好的准确性和效率。",
    "en_tdlr": "In this paper, the authors propose a method for robust crowd counting in adverse weather scenarios. Experimental results show that the proposed method achieves better accuracy and efficiency by learning weather information and optimizing the crowd counting module."
}