{
    "title": "Ensemble Framework for Cardiovascular Disease Prediction. (arXiv:2306.09989v1 [cs.LG])",
    "abstract": "Heart disease is the major cause of non-communicable and silent death worldwide. Heart diseases or cardiovascular diseases are classified into four types: coronary heart disease, heart failure, congenital heart disease, and cardiomyopathy. It is vital to diagnose heart disease early and accurately in order to avoid further injury and save patients' lives. As a result, we need a system that can predict cardiovascular disease before it becomes a critical situation. Machine learning has piqued the interest of researchers in the field of medical sciences. For heart disease prediction, researchers implement a variety of machine learning methods and approaches. In this work, to the best of our knowledge, we have used the dataset from IEEE Data Port which is one of the online available largest datasets for cardiovascular diseases individuals. The dataset isa combination of Hungarian, Cleveland, Long Beach VA, Switzerland & Statlog datasets with important features such as Maximum Heart Rate Ac",
    "link": "http://arxiv.org/abs/2306.09989",
    "context": "Title: Ensemble Framework for Cardiovascular Disease Prediction. (arXiv:2306.09989v1 [cs.LG])\nAbstract: Heart disease is the major cause of non-communicable and silent death worldwide. Heart diseases or cardiovascular diseases are classified into four types: coronary heart disease, heart failure, congenital heart disease, and cardiomyopathy. It is vital to diagnose heart disease early and accurately in order to avoid further injury and save patients' lives. As a result, we need a system that can predict cardiovascular disease before it becomes a critical situation. Machine learning has piqued the interest of researchers in the field of medical sciences. For heart disease prediction, researchers implement a variety of machine learning methods and approaches. In this work, to the best of our knowledge, we have used the dataset from IEEE Data Port which is one of the online available largest datasets for cardiovascular diseases individuals. The dataset isa combination of Hungarian, Cleveland, Long Beach VA, Switzerland & Statlog datasets with important features such as Maximum Heart Rate Ac",
    "path": "papers/23/06/2306.09989.json",
    "total_tokens": 915,
    "translated_title": "心血管疾病预测的集成框架",
    "translated_abstract": "心脏病是全球非传染性和缄默死亡的主要原因。心脏疾病或心血管疾病分为四种类型：冠状动脉心脏病、心力衰竭、先天性心脏病和心肌病。早期准确诊断心脏疾病对于避免进一步损伤并挽救患者的生命至关重要。因此，我们需要一个能够在心血管疾病变成危机之前预测其发生的系统。机器学习引起了医学科学研究人员的兴趣。针对心脏疾病预测，研究人员实施了各种机器学习方法和方法。在此工作中，我们采用了IEEE Data Port数据集，这是一种在线可用于心血管疾病个体的最大数据集之一。该数据集是由匈牙利，克里夫兰，长滩VA，瑞士和Statlog数据集组成，具有重要特征，如最大心率",
    "tldr": "本文介绍了一个使用机器学习方法预测心血管疾病的集成框架，采用了IEEE Data Port 数据集，旨在早期准确诊断心脏问题，提高生命几率。"
}