{
    "title": "ShaDDR: Real-Time Example-Based Geometry and Texture Generation via 3D Shape Detailization and Differentiable Rendering. (arXiv:2306.04889v1 [cs.CV])",
    "abstract": "We present ShaDDR, an example-based deep generative neural network which produces a high-resolution textured 3D shape through geometry detailization and conditional texture generation applied to an input coarse voxel shape. Trained on a small set of detailed and textured exemplar shapes, our method learns to detailize the geometry via multi-resolution voxel upsampling and generate textures on voxel surfaces via differentiable rendering against exemplar texture images from a few views. The generation is real-time, taking less than 1 second to produce a 3D model with voxel resolutions up to 512^3. The generated shape preserves the overall structure of the input coarse voxel model, while the style of the generated geometric details and textures can be manipulated through learned latent codes. In the experiments, we show that our method can generate higher-resolution shapes with plausible and improved geometric details and clean textures compared to prior works. Furthermore, we showcase th",
    "link": "http://arxiv.org/abs/2306.04889",
    "context": "Title: ShaDDR: Real-Time Example-Based Geometry and Texture Generation via 3D Shape Detailization and Differentiable Rendering. (arXiv:2306.04889v1 [cs.CV])\nAbstract: We present ShaDDR, an example-based deep generative neural network which produces a high-resolution textured 3D shape through geometry detailization and conditional texture generation applied to an input coarse voxel shape. Trained on a small set of detailed and textured exemplar shapes, our method learns to detailize the geometry via multi-resolution voxel upsampling and generate textures on voxel surfaces via differentiable rendering against exemplar texture images from a few views. The generation is real-time, taking less than 1 second to produce a 3D model with voxel resolutions up to 512^3. The generated shape preserves the overall structure of the input coarse voxel model, while the style of the generated geometric details and textures can be manipulated through learned latent codes. In the experiments, we show that our method can generate higher-resolution shapes with plausible and improved geometric details and clean textures compared to prior works. Furthermore, we showcase th",
    "path": "papers/23/06/2306.04889.json",
    "total_tokens": 941,
    "translated_title": "ShaDDR: 基于示例的实时几何和纹理生成",
    "translated_abstract": "本文介绍了 ShaDDR，一种基于示例的深度生成神经网络，通过几何细节化和条件纹理生成应用于输入的粗略体素形状，生成高分辨率贴图的 3D 形状。在少量详细和纹理的范例形状上训练，我们的方法通过多分辨率体素上采样学习几何细节化，并且通过与几个视图的范例纹理图像进行可微渲染，在体素表面生成纹理。生成是实时的，仅需不到 1 秒即可生成分辨率高达 512^3 的 3D 模型。生成的形状保留了输入粗略体素模型的整体结构，而生成的几何细节和纹理的风格可以通过学习的潜在代码进行操纵。在实验中，我们展示了我们的方法可以生成比以前的作品更真实且几何细节和纹理更干净的高分辨率形状。",
    "tldr": "本文介绍了一种基于示例的深度生成神经网络 ShaDDR，可以通过几何细节化和条件纹理生成应用于输入的粗略体素形状，生成高分辨率贴图的 3D 形状。生成实时且精度高，风格可以通过学习的潜在代码进行控制。",
    "en_tdlr": "ShaDDR is an example-based deep generative neural network for generating high-resolution textured 3D shapes in real-time by geometry detailization and conditional texture generation applied to an input coarse voxel shape. It can produce shapes with plausible and improved geometric details and clean textures, while the style can be controlled through learned latent codes."
}