{
    "title": "I^3 Retriever: Incorporating Implicit Interaction in Pre-trained Language Models for Passage Retrieval. (arXiv:2306.02371v2 [cs.IR] UPDATED)",
    "abstract": "Passage retrieval is a fundamental task in many information systems, such as web search and question answering, where both efficiency and effectiveness are critical concerns. In recent years, neural retrievers based on pre-trained language models (PLM), such as dual-encoders, have achieved huge success. Yet, studies have found that the performance of dual-encoders are often limited due to the neglecting of the interaction information between queries and candidate passages. Therefore, various interaction paradigms have been proposed to improve the performance of vanilla dual-encoders. Particularly, recent state-of-the-art methods often introduce late-interaction during the model inference process. However, such late-interaction based methods usually bring extensive computation and storage cost on large corpus. Despite their effectiveness, the concern of efficiency and space footprint is still an important factor that limits the application of interaction-based neural retrieval models. T",
    "link": "http://arxiv.org/abs/2306.02371",
    "context": "Title: I^3 Retriever: Incorporating Implicit Interaction in Pre-trained Language Models for Passage Retrieval. (arXiv:2306.02371v2 [cs.IR] UPDATED)\nAbstract: Passage retrieval is a fundamental task in many information systems, such as web search and question answering, where both efficiency and effectiveness are critical concerns. In recent years, neural retrievers based on pre-trained language models (PLM), such as dual-encoders, have achieved huge success. Yet, studies have found that the performance of dual-encoders are often limited due to the neglecting of the interaction information between queries and candidate passages. Therefore, various interaction paradigms have been proposed to improve the performance of vanilla dual-encoders. Particularly, recent state-of-the-art methods often introduce late-interaction during the model inference process. However, such late-interaction based methods usually bring extensive computation and storage cost on large corpus. Despite their effectiveness, the concern of efficiency and space footprint is still an important factor that limits the application of interaction-based neural retrieval models. T",
    "path": "papers/23/06/2306.02371.json",
    "total_tokens": 813,
    "translated_title": "I^3 Retriever: 将隐式交互纳入预训练语言模型以用于段落检索",
    "translated_abstract": "段落检索是许多信息系统中的基本任务，例如网络搜索和问答系统，其中效率和效果都是关键问题。近年来，基于预训练语言模型（PLM）的神经检索器，如双编码器，取得了巨大成功。然而，研究发现，双编码器的性能通常受限于忽略查询和候选段落之间的交互信息。因此，提出了各种交互范式来改善纯双编码器的性能。特别是，最近的最先进方法通常在模型推理过程中引入后期交互。然而，这种基于后期交互的方法通常会对大语料库产生大量的计算和存储成本。尽管它们有效，但效率和空间占用的问题仍然是限制交互式神经检索模型应用的重要因素。",
    "tldr": "I^3 Retriever将隐式交互纳入预训练语言模型，提高了段落检索的效果和效率。",
    "en_tdlr": "I^3 Retriever incorporates implicit interaction into pre-trained language models to improve the effectiveness and efficiency of passage retrieval."
}