{
    "title": "Concurrent ischemic lesion age estimation and segmentation of CT brain using a Transformer-based network. (arXiv:2306.12242v1 [eess.IV])",
    "abstract": "The cornerstone of stroke care is expedient management that varies depending on the time since stroke onset. Consequently, clinical decision making is centered on accurate knowledge of timing and often requires a radiologist to interpret Computed Tomography (CT) of the brain to confirm the occurrence and age of an event. These tasks are particularly challenging due to the subtle expression of acute ischemic lesions and the dynamic nature of their appearance. Automation efforts have not yet applied deep learning to estimate lesion age and treated these two tasks independently, so, have overlooked their inherent complementary relationship. To leverage this, we propose a novel end-to-end multi-task transformer-based network optimized for concurrent segmentation and age estimation of cerebral ischemic lesions. By utilizing gated positional self-attention and CT-specific data augmentation, the proposed method can capture long-range spatial dependencies while maintaining its ability to be tr",
    "link": "http://arxiv.org/abs/2306.12242",
    "context": "Title: Concurrent ischemic lesion age estimation and segmentation of CT brain using a Transformer-based network. (arXiv:2306.12242v1 [eess.IV])\nAbstract: The cornerstone of stroke care is expedient management that varies depending on the time since stroke onset. Consequently, clinical decision making is centered on accurate knowledge of timing and often requires a radiologist to interpret Computed Tomography (CT) of the brain to confirm the occurrence and age of an event. These tasks are particularly challenging due to the subtle expression of acute ischemic lesions and the dynamic nature of their appearance. Automation efforts have not yet applied deep learning to estimate lesion age and treated these two tasks independently, so, have overlooked their inherent complementary relationship. To leverage this, we propose a novel end-to-end multi-task transformer-based network optimized for concurrent segmentation and age estimation of cerebral ischemic lesions. By utilizing gated positional self-attention and CT-specific data augmentation, the proposed method can capture long-range spatial dependencies while maintaining its ability to be tr",
    "path": "papers/23/06/2306.12242.json",
    "total_tokens": 1052,
    "translated_title": "基于Transformer网络的脑部CT图像缺血损伤同时标记和估算成像时长的研究",
    "translated_abstract": "脑卒中护理的核心是迅速处理，这取决于中风发作的时间。因此，临床决策需要准确知道时间，通常需要放射医师解读脑部CT扫描以确认事件的发生和年龄。由于急性缺血性病变表现微妙且外观动态，因此这些任务特别具有挑战性。自动化的努力还没有将深度学习应用于估算病灶年龄，并将这两个任务独立处理，因此忽略了它们固有的互补关系。为了利用这一点，我们提出了一种新颖的端到端多任务Transformer网络，优化了同时标记和估计脑部缺血性病变的年龄。通过利用门控位置自我关注和CT特定数据增强，所提出的方法可以捕获长距离的空间依赖关系，同时保持其可传输到其他脑部CT成像数据集的能力。结果表明，我们的方法在病灶分割和准确估计病灶年龄方面实现了最先进的性能，成为支持中风护理决策的有前途的工具。",
    "tldr": "提出了一种基于Transformer网络的新方法，能够同时标记和估算脑部CT图像中的缺血性病变的成像时长，该方法在病灶分割和病灶年龄估计方面实现了最先进的性能，有望成为支持中风护理决策的重要工具。",
    "en_tdlr": "A novel end-to-end multi-task transformer-based network is proposed to simultaneously segment and estimate the age of ischemic lesions in brain CT images, achieving state-of-the-art performance in lesion segmentation and age estimation to become a promising tool for supporting stroke care decision making."
}