{
    "title": "Improved flood mapping for efficient policy design by fusion of Sentinel-1, Sentinel-2, and Landsat-9 imagery to identify population and infrastructure exposed to floods. (arXiv:2306.06074v1 [cs.CV])",
    "abstract": "A reliable yet inexpensive tool for the estimation of flood water spread is conducive for efficient disaster management. The application of optical and SAR imagery in tandem provides a means of extended availability and enhanced reliability of flood mapping. We propose a methodology to merge these two types of imagery into a common data space and demonstrate its use in the identification of affected populations and infrastructure for the 2022 floods in Pakistan. The merging of optical and SAR data provides us with improved observations in cloud-prone regions; that is then used to gain additional insights into flood mapping applications. The use of open source datasets from WorldPop and OSM for population and roads respectively makes the exercise globally replicable. The integration of flood maps with spatial data on population and infrastructure facilitates informed policy design. We have shown that within the top five flood-affected districts in Sindh province, Pakistan, the affected ",
    "link": "http://arxiv.org/abs/2306.06074",
    "context": "Title: Improved flood mapping for efficient policy design by fusion of Sentinel-1, Sentinel-2, and Landsat-9 imagery to identify population and infrastructure exposed to floods. (arXiv:2306.06074v1 [cs.CV])\nAbstract: A reliable yet inexpensive tool for the estimation of flood water spread is conducive for efficient disaster management. The application of optical and SAR imagery in tandem provides a means of extended availability and enhanced reliability of flood mapping. We propose a methodology to merge these two types of imagery into a common data space and demonstrate its use in the identification of affected populations and infrastructure for the 2022 floods in Pakistan. The merging of optical and SAR data provides us with improved observations in cloud-prone regions; that is then used to gain additional insights into flood mapping applications. The use of open source datasets from WorldPop and OSM for population and roads respectively makes the exercise globally replicable. The integration of flood maps with spatial data on population and infrastructure facilitates informed policy design. We have shown that within the top five flood-affected districts in Sindh province, Pakistan, the affected ",
    "path": "papers/23/06/2306.06074.json",
    "total_tokens": 963,
    "translated_title": "使用Sentinel-1, Sentinel-2和Landsat-9图像融合改进洪水图制作以识别受灾人口和基础设施",
    "translated_abstract": "可靠且廉价的洪水水位估计工具有助于有效的灾害管理。光学和SAR图像的应用提供了一种扩展可用性和增强洪水图制作可靠性的手段。我们提出了一种将这两种图像合并到一个共同数据空间中的方法，并展示了其在巴基斯坦2022年洪水中识别受灾人口和基础设施方面的应用。光学和SAR数据的合并为我们在云层密集区域提供了改进的观测，然后用于获得更多的洪水图制作应用见解。使用WorldPop和OSM的开放源数据集，分别用于人口和道路，使该练习具有全球复制的能力。洪水图与人口和基础设施的空间数据的整合有助于制定明智的政策。我们已经表明，在巴基斯坦信德省五个受洪水影响最严重的地区中，受影响的人口和基础设施涵盖率的前五名区域有很大的顺序差异。",
    "tldr": "通过融合光学和SAR数据，提出了一种新方法进行洪水图制作，并在巴基斯坦2022年的洪水中应用，可准确识别受灾人口和基础设施，以帮助制定理智的政策。",
    "en_tdlr": "A new method for flood mapping is proposed by merging optical and SAR data, which accurately identifies affected populations and infrastructure during the floods in Pakistan in 2022, facilitating informed policy design."
}