{
    "title": "A Hybrid Approach for Smart Alert Generation. (arXiv:2306.07983v1 [cs.NI])",
    "abstract": "Anomaly detection is an important task in network management. However, deploying intelligent alert systems in real-world large-scale networking systems is challenging when we take into account (i) scalability, (ii) data heterogeneity, and (iii) generalizability and maintainability. In this paper, we propose a hybrid model for an alert system that combines statistical models with a whitelist mechanism to tackle these challenges and reduce false positive alerts. The statistical models take advantage of a large database to detect anomalies in time-series data, while the whitelist filters out persistently alerted nodes to further reduce false positives. Our model is validated using qualitative data from customer support cases. Future work includes more feature engineering and input data, as well as including human feedback in the model development process.",
    "link": "http://arxiv.org/abs/2306.07983",
    "context": "Title: A Hybrid Approach for Smart Alert Generation. (arXiv:2306.07983v1 [cs.NI])\nAbstract: Anomaly detection is an important task in network management. However, deploying intelligent alert systems in real-world large-scale networking systems is challenging when we take into account (i) scalability, (ii) data heterogeneity, and (iii) generalizability and maintainability. In this paper, we propose a hybrid model for an alert system that combines statistical models with a whitelist mechanism to tackle these challenges and reduce false positive alerts. The statistical models take advantage of a large database to detect anomalies in time-series data, while the whitelist filters out persistently alerted nodes to further reduce false positives. Our model is validated using qualitative data from customer support cases. Future work includes more feature engineering and input data, as well as including human feedback in the model development process.",
    "path": "papers/23/06/2306.07983.json",
    "total_tokens": 832,
    "translated_title": "智能警报生成的混合方法",
    "translated_abstract": "异常检测是网络管理中的重要任务，但当考虑可扩展性、数据异构性以及可泛化性和可维护性时，在现实世界的大规模网络系统中部署智能警报系统是具有挑战性的。本文提出了一种混合模型的警报系统，将统计模型与白名单机制结合起来，以应对这些挑战并减少误报警报。 统计模型利用大型数据库检测时间序列数据中的异常，而白名单则过滤出持续警报的节点以减少误报。我们使用客户支持案例的定性数据验证了我们的模型。未来的工作包括更多的特征工程和输入数据，以及在模型开发过程中包括人类反馈。",
    "tldr": "本文提出了一个混合模型的警报系统，在解决可扩展性、数据异构性、可泛化性和可维护性方面表现良好。白名单机制有效减少了误报警报，未来的工作将包括更多的特征工程和输入数据，以及包括人类反馈在内的模型开发过程。",
    "en_tdlr": "This paper proposes a hybrid model for an alert system, which performs well in addressing scalability, data heterogeneity, generalizability, and maintainability. The whitelist mechanism effectively reduces false positive alerts, and future work will include more feature engineering and input data, as well as incorporating human feedback in the model development process."
}