{
    "title": "On Manipulating Signals of User-Item Graph: A Jacobi Polynomial-based Graph Collaborative Filtering. (arXiv:2306.03624v1 [cs.IR])",
    "abstract": "Collaborative filtering (CF) is an important research direction in recommender systems that aims to make recommendations given the information on user-item interactions. Graph CF has attracted more and more attention in recent years due to its effectiveness in leveraging high-order information in the user-item bipartite graph for better recommendations. Specifically, recent studies show the success of graph neural networks (GNN) for CF is attributed to its low-pass filtering effects. However, current researches lack a study of how different signal components contributes to recommendations, and how to design strategies to properly use them well. To this end, from the view of spectral transformation, we analyze the important factors that a graph filter should consider to achieve better performance. Based on the discoveries, we design JGCF, an efficient and effective method for CF based on Jacobi polynomial bases and frequency decomposition strategies. Extensive experiments on four widely",
    "link": "http://arxiv.org/abs/2306.03624",
    "context": "Title: On Manipulating Signals of User-Item Graph: A Jacobi Polynomial-based Graph Collaborative Filtering. (arXiv:2306.03624v1 [cs.IR])\nAbstract: Collaborative filtering (CF) is an important research direction in recommender systems that aims to make recommendations given the information on user-item interactions. Graph CF has attracted more and more attention in recent years due to its effectiveness in leveraging high-order information in the user-item bipartite graph for better recommendations. Specifically, recent studies show the success of graph neural networks (GNN) for CF is attributed to its low-pass filtering effects. However, current researches lack a study of how different signal components contributes to recommendations, and how to design strategies to properly use them well. To this end, from the view of spectral transformation, we analyze the important factors that a graph filter should consider to achieve better performance. Based on the discoveries, we design JGCF, an efficient and effective method for CF based on Jacobi polynomial bases and frequency decomposition strategies. Extensive experiments on four widely",
    "path": "papers/23/06/2306.03624.json",
    "total_tokens": 931,
    "translated_title": "关于用户-物品图信号处理的研究：基于Jacobi多项式的图协同过滤",
    "translated_abstract": "协同过滤是推荐系统中的重要研究方向，旨在利用用户-物品交互信息进行推荐。图协同过滤由于其在利用用户-物品二分图中的高阶信息进行更好的推荐方面的有效性而引起越来越多的关注。最近的研究表明，图神经网络对于协同过滤的成功归因于其低通滤波效应。然而，当前的研究缺乏对不同信号分量如何影响推荐以及如何设计策略以正确使用它们的研究。为此，从谱变换的角度出发，我们分析了一个图滤波器应考虑的重要因素以实现更好的性能。基于这些发现，我们设计了JGCF，一种基于Jacobi多项式和频率分解策略的协同过滤方法，该方法高效且有效。在四个广泛使用的真实世界数据集上进行的大量实验表明，所提出的方法优于现有的图协同过滤方法。",
    "tldr": "本文提出了一种基于Jacobi多项式和频率分解策略的协同过滤方法JGCF，在四个真实世界数据集上进行了大量实验，并表现出优异的性能。",
    "en_tdlr": "This paper proposes an efficient and effective collaborative filtering method, JGCF, based on Jacobi polynomial bases and frequency decomposition strategies. Extensive experiments on four widely used real-world datasets demonstrate its superior performance over state-of-the-art graph CF methods."
}