{
    "title": "Analysis of Indian foreign exchange markets: A Multifractal Detrended Fluctuation Analysis (MFDFA) approach. (arXiv:2306.16162v1 [q-fin.ST])",
    "abstract": "The multifractal spectra of daily foreign exchange rates for US dollar (USD), the British Pound (GBP), the Euro (Euro) and the Japanese Yen (Yen) with respect to the Indian Rupee are analysed for the period 6th January 1999 to 24th July 2018. We observe that the time series of logarithmic returns of all the four exchange rates exhibit features of multifractality. Next, we research the source of the observed multifractality. For this, we transform the return series in two ways: a) We randomly shuffle the original time series of logarithmic returns and b) We apply the process of phase randomisation on the unchanged series. Our results indicate in the case of the US dollar the source of multifractality is mainly the fat tail. For the British Pound and the Euro, we see the long-range correlations between the observations and the thick tails of the probability distribution give rise to the observed multifractal features, while in the case of the Japanese Yen, the origin of the multifractal ",
    "link": "http://arxiv.org/abs/2306.16162",
    "context": "Title: Analysis of Indian foreign exchange markets: A Multifractal Detrended Fluctuation Analysis (MFDFA) approach. (arXiv:2306.16162v1 [q-fin.ST])\nAbstract: The multifractal spectra of daily foreign exchange rates for US dollar (USD), the British Pound (GBP), the Euro (Euro) and the Japanese Yen (Yen) with respect to the Indian Rupee are analysed for the period 6th January 1999 to 24th July 2018. We observe that the time series of logarithmic returns of all the four exchange rates exhibit features of multifractality. Next, we research the source of the observed multifractality. For this, we transform the return series in two ways: a) We randomly shuffle the original time series of logarithmic returns and b) We apply the process of phase randomisation on the unchanged series. Our results indicate in the case of the US dollar the source of multifractality is mainly the fat tail. For the British Pound and the Euro, we see the long-range correlations between the observations and the thick tails of the probability distribution give rise to the observed multifractal features, while in the case of the Japanese Yen, the origin of the multifractal ",
    "path": "papers/23/06/2306.16162.json",
    "total_tokens": 925,
    "translated_title": "印度外汇市场的分析：基于多重分形去趋势波动分析（MFDFA）方法",
    "translated_abstract": "本研究分析了印度卢比兑美元（USD）、英镑（GBP）、欧元（Euro）和日元（Yen）的日常外汇汇率在1999年1月6日至2018年7月24日期间的多重分形谱。我们观察到所有四种汇率的对数收益率时间序列都呈现出多重分形特征。接下来，我们研究了观察到的多重分形的来源。为此，我们通过两种方式对回报序列进行转换：a）随机洗牌原始对数回报时间序列；b）对未改变的序列应用相位随机化过程。我们的结果表明，在美元的情况下，多重分形主要来源于尾部较厚。对于英镑和欧元，我们发现观测值与概率分布的厚尾之间存在长程相关性，从而产生了观测到的多重分形特征；而在日元的情况下，多重分形的来源则是尾部较厚。",
    "tldr": "本研究通过多重分形分析了印度外汇市场的汇率数据，并发现尾部的厚尾和长程相关性是导致多重分形特征的主要来源。",
    "en_tdlr": "This paper analyzes the multifractal spectra of foreign exchange rates in the Indian market and identifies the thick tails and long-range correlations as the main sources of multifractality."
}