{
    "title": "Employing Multimodal Machine Learning for Stress Detection. (arXiv:2306.09385v1 [cs.LG])",
    "abstract": "In the current age, human lifestyle has become more knowledge oriented leading to generation of sedentary employment. This has given rise to a number of health and mental disorders. Mental wellness is one of the most neglected but crucial aspects of today's world. Mental health issues can, both directly and indirectly, affect other sections of human physiology and impede an individual's day-to-day activities and performance. However, identifying the stress and finding the stress trend for an individual leading to serious mental ailments is challenging and involves multiple factors. Such identification can be achieved accurately by fusing these multiple modalities (due to various factors) arising from behavioral patterns. Certain techniques are identified in the literature for this purpose; however, very few machine learning-based methods are proposed for such multimodal fusion tasks. In this work, a multimodal AI-based framework is proposed to monitor a person's working behavior and st",
    "link": "http://arxiv.org/abs/2306.09385",
    "context": "Title: Employing Multimodal Machine Learning for Stress Detection. (arXiv:2306.09385v1 [cs.LG])\nAbstract: In the current age, human lifestyle has become more knowledge oriented leading to generation of sedentary employment. This has given rise to a number of health and mental disorders. Mental wellness is one of the most neglected but crucial aspects of today's world. Mental health issues can, both directly and indirectly, affect other sections of human physiology and impede an individual's day-to-day activities and performance. However, identifying the stress and finding the stress trend for an individual leading to serious mental ailments is challenging and involves multiple factors. Such identification can be achieved accurately by fusing these multiple modalities (due to various factors) arising from behavioral patterns. Certain techniques are identified in the literature for this purpose; however, very few machine learning-based methods are proposed for such multimodal fusion tasks. In this work, a multimodal AI-based framework is proposed to monitor a person's working behavior and st",
    "path": "papers/23/06/2306.09385.json",
    "total_tokens": 1255,
    "translated_title": "应用多模态机器学习进行压力检测",
    "translated_abstract": "在当前时代，人类的生活方式越来越注重知识，导致久坐的工作方式变得更加普遍。这导致许多健康和心理障碍。心理健康是当今世界上最被忽视但也是最关键的方面之一。心理健康问题会直接或间接地影响到人体其他部分，并妨碍个人的日常活动和表现。然而，确定压力并找出导致严重心理疾病的压力趋势对于个人来说是具有挑战性的，并涉及多个因素。通过融合由行为模式产生的多个模态（由于各种因素）可以准确地实现这种识别。文献中已经确定了一些技术来实现这个目的。然而，为此目的提出的基于机器学习的多模态融合方法非常少。本文提出了一个基于多模态AI的框架，通过融合面部表情、语音模式、生理信号和自报数据，准确监测人的工作行为和压力水平。所提出的框架采用了卷积神经网络(Convolutional Neural Networks, CNNs)、时延神经网络(Time-delay Neural Networks, TDNNs)和多层感知器(Multi-Layer Perceptron, MLP)等先进的深度学习技术，能够高精度地分类高压力和低压力状态。在公共压力数据集和从医疗保健专业人员那里收集的数据集上获得的结果展示了所提出的框架在准确检测压力方面的有效性。",
    "tldr": "本文提出了一个基于多模态AI的框架，旨在通过融合多种信息来精确监测人的工作行为和压力水平。该框架使用卷积神经网络、时延神经网络和多层感知器等深度学习技术，能够高精度地检测高压力和低压力状态。",
    "en_tdlr": "This paper proposes a multimodal AI-based framework to monitor a person's working behavior and stress levels accurately by fusing facial expressions, speech patterns, physiological signals, and self-reported data. The framework employs deep learning techniques like CNNs, TDNNs, and MLP to classify high- and low-stress states with high accuracy. Results on public stress and healthcare professional datasets show the effectiveness of the proposed framework in detecting stress."
}