{
    "title": "Automatic Assessment of Oral Reading Accuracy for Reading Diagnostics. (arXiv:2306.03444v1 [cs.CL])",
    "abstract": "Automatic assessment of reading fluency using automatic speech recognition (ASR) holds great potential for early detection of reading difficulties and subsequent timely intervention. Precise assessment tools are required, especially for languages other than English. In this study, we evaluate six state-of-the-art ASR-based systems for automatically assessing Dutch oral reading accuracy using Kaldi and Whisper. Results show our most successful system reached substantial agreement with human evaluations (MCC = .63). The same system reached the highest correlation between forced decoding confidence scores and word correctness (r = .45). This system's language model (LM) consisted of manual orthographic transcriptions and reading prompts of the test data, which shows that including reading errors in the LM improves assessment performance. We discuss the implications for developing automatic assessment systems and identify possible avenues of future research.",
    "link": "http://arxiv.org/abs/2306.03444",
    "context": "Title: Automatic Assessment of Oral Reading Accuracy for Reading Diagnostics. (arXiv:2306.03444v1 [cs.CL])\nAbstract: Automatic assessment of reading fluency using automatic speech recognition (ASR) holds great potential for early detection of reading difficulties and subsequent timely intervention. Precise assessment tools are required, especially for languages other than English. In this study, we evaluate six state-of-the-art ASR-based systems for automatically assessing Dutch oral reading accuracy using Kaldi and Whisper. Results show our most successful system reached substantial agreement with human evaluations (MCC = .63). The same system reached the highest correlation between forced decoding confidence scores and word correctness (r = .45). This system's language model (LM) consisted of manual orthographic transcriptions and reading prompts of the test data, which shows that including reading errors in the LM improves assessment performance. We discuss the implications for developing automatic assessment systems and identify possible avenues of future research.",
    "path": "papers/23/06/2306.03444.json",
    "total_tokens": 873,
    "translated_title": "用于阅读诊断的口语阅读准确度自动评估",
    "translated_abstract": "利用自动语音识别（ASR）自动评估阅读流畅度对早期检测阅读困难以及随后及时干预具有巨大潜力，特别是对于英语以外的语言更是如此。本研究使用Kaldi和Whisper评估了六种最先进的基于ASR的系统，以自动评估荷兰语口头阅读准确性。结果表明，我们最成功的系统与人类评估达到了相当的一致性（MCC = 0.63）。相同的系统在强制解码置信度得分和单词正确性之间获得了最高的相关性（r = 0.45）。该系统的语言模型（LM）由测试数据的手动正字法转录和阅读提示组成，这表明在LM中包括阅读错误可以提高评估性能。我们详细讨论了开发自动评估系统的意义，并确定了未来研究的可能途径。",
    "tldr": "本研究使用ASR技术开发了一种自动评估荷兰语口头阅读准确性的系统，该系统可以与人类评估达到相当的一致性（MCC = 0.63），其语言模型中包括阅读错误可以提高评估性能。",
    "en_tdlr": "This study developed an automatic assessment system for Dutch oral reading accuracy using ASR technology and found that including reading errors in the language model can improve assessment performance. The system reached substantial agreement with human evaluations (MCC = 0.63)."
}