{
    "title": "NERFBK: A High-Quality Benchmark for NERF-Based 3D Reconstruction. (arXiv:2306.06300v1 [cs.CV])",
    "abstract": "This paper introduces a new real and synthetic dataset called NeRFBK specifically designed for testing and comparing NeRF-based 3D reconstruction algorithms. High-quality 3D reconstruction has significant potential in various fields, and advancements in image-based algorithms make it essential to evaluate new advanced techniques. However, gathering diverse data with precise ground truth is challenging and may not encompass all relevant applications. The NeRFBK dataset addresses this issue by providing multi-scale, indoor and outdoor datasets with high-resolution images and videos and camera parameters for testing and comparing NeRF-based algorithms. This paper presents the design and creation of the NeRFBK benchmark, various examples and application scenarios, and highlights its potential for advancing the field of 3D reconstruction.",
    "link": "http://arxiv.org/abs/2306.06300",
    "context": "Title: NERFBK: A High-Quality Benchmark for NERF-Based 3D Reconstruction. (arXiv:2306.06300v1 [cs.CV])\nAbstract: This paper introduces a new real and synthetic dataset called NeRFBK specifically designed for testing and comparing NeRF-based 3D reconstruction algorithms. High-quality 3D reconstruction has significant potential in various fields, and advancements in image-based algorithms make it essential to evaluate new advanced techniques. However, gathering diverse data with precise ground truth is challenging and may not encompass all relevant applications. The NeRFBK dataset addresses this issue by providing multi-scale, indoor and outdoor datasets with high-resolution images and videos and camera parameters for testing and comparing NeRF-based algorithms. This paper presents the design and creation of the NeRFBK benchmark, various examples and application scenarios, and highlights its potential for advancing the field of 3D reconstruction.",
    "path": "papers/23/06/2306.06300.json",
    "total_tokens": 856,
    "translated_title": "NERFBK:针对基于NeRF的3D重建的高质量基准数据集",
    "translated_abstract": "本文介绍一个名为NeRFBK的新的真实和合成数据集，专门用于测试和比较基于NeRF的3D重建算法。高质量的3D重建在各个领域都有重要的潜力，基于图像的算法的改进使得评估新的先进技术变得必不可少。然而，收集具有精确地面实况的多样化数据是具有挑战性的且可能无法涵盖所有相关的应用。NeRFBK数据集通过提供多尺度、室内、室外数据集及高分辨率图像、视频和相机参数等来解决这个问题，以测试和比较基于NeRF的算法。本文介绍了NeRFBK基准的设计和创建、各种例子和应用场景，并强调了它在推动3D重建领域发展方面的潜力。",
    "tldr": "该论文介绍了一个名为NeRFBK的新的真实和合成数据集，专门用于测试和比较基于NeRF的3D重建算法，旨在解决收集具有精确地面实况的多样化数据的挑战问题。该数据集有望推动3D重建领域的发展。",
    "en_tdlr": "This paper introduces a new dataset called NeRFBK for testing and comparing NeRF-based 3D reconstruction algorithms, which aims to solve the challenge of collecting diverse data with precise ground truth. This dataset has significant potential for advancing the field of 3D reconstruction."
}