{
    "title": "Graph Extraction for Assisting Crash Simulation Data Analysis. (arXiv:2306.09538v1 [cs.AI])",
    "abstract": "In this work, we establish a method for abstracting information from Computer Aided Engineering (CAE) into graphs. Such graph representations of CAE data can improve design guidelines and support recommendation systems by enabling the comparison of simulations, highlighting unexplored experimental designs, and correlating different designs. We focus on the load-path in crashworthiness analysis, a complex sub-discipline in vehicle design. The load-path is the sequence of parts that absorb most of the energy caused by the impact. To detect the load-path, we generate a directed weighted graph from the CAE data. The vertices represent the vehicle's parts, and the edges are an abstraction of the connectivity of the parts. The edge direction follows the temporal occurrence of the collision, where the edge weights reflect aspects of the energy absorption. We introduce and assess three methods for graph extraction and an additional method for further updating each graph with the sequences of a",
    "link": "http://arxiv.org/abs/2306.09538",
    "context": "Title: Graph Extraction for Assisting Crash Simulation Data Analysis. (arXiv:2306.09538v1 [cs.AI])\nAbstract: In this work, we establish a method for abstracting information from Computer Aided Engineering (CAE) into graphs. Such graph representations of CAE data can improve design guidelines and support recommendation systems by enabling the comparison of simulations, highlighting unexplored experimental designs, and correlating different designs. We focus on the load-path in crashworthiness analysis, a complex sub-discipline in vehicle design. The load-path is the sequence of parts that absorb most of the energy caused by the impact. To detect the load-path, we generate a directed weighted graph from the CAE data. The vertices represent the vehicle's parts, and the edges are an abstraction of the connectivity of the parts. The edge direction follows the temporal occurrence of the collision, where the edge weights reflect aspects of the energy absorption. We introduce and assess three methods for graph extraction and an additional method for further updating each graph with the sequences of a",
    "path": "papers/23/06/2306.09538.json",
    "total_tokens": 889,
    "translated_title": "用于协助车辆碰撞模拟数据分析的图形提取",
    "translated_abstract": "本文提出了一种从计算机辅助工程（CAE）数据中提取信息并转换成图形的方法。这种图形化呈现CAE数据可以优化设计指南、支持推荐系统，通过比较模拟数据来突出未探索的实验设计，并对不同设计进行相关性分析。我们的重点是车辆设计中一个复杂的子学科——碰撞安全性分析中的负荷路径。负荷路径是吸收碰撞能量的大部分零部件的顺序。为了检测负荷路径，我们从CAE数据生成了一个有向带权图。节点代表车辆零部件，边代表零部件之间的连通性抽象。边的方向遵循碰撞的时间顺序，其中边的权重反映了能量吸收的方面。我们引入并评估了三种图形提取方法和一种进一步更新每个图形的方法，该方法可以使用序列数据来提高CAE数据的精度。",
    "tldr": "本文提出了一种将CAE数据转为图形的方法，可以比较模拟数据并突出未探索的实验设计，并对不同设计进行相关性分析。特别关注了车辆碰撞安全性分析中的负荷路径检测。"
}