{
    "title": "Sum-Rate Maximization of RSMA-based Aerial Communications with Energy Harvesting: A Reinforcement Learning Approach. (arXiv:2306.12977v1 [cs.IT])",
    "abstract": "In this letter, we investigate a joint power and beamforming design problem for rate-splitting multiple access (RSMA)-based aerial communications with energy harvesting, where a self-sustainable aerial base station serves multiple users by utilizing the harvested energy. Considering maximizing the sum-rate from the long-term perspective, we utilize a deep reinforcement learning (DRL) approach, namely the soft actor-critic algorithm, to restrict the maximum transmission power at each time based on the stochastic property of the channel environment, harvested energy, and battery power information. Moreover, for designing precoders and power allocation among all the private/common streams of the RSMA, we employ sequential least squares programming (SLSQP) using the Han-Powell quasi-Newton method to maximize the sum-rate for the given transmission power via DRL. Numerical results show the superiority of the proposed scheme over several baseline methods in terms of the average sum-rate perf",
    "link": "http://arxiv.org/abs/2306.12977",
    "context": "Title: Sum-Rate Maximization of RSMA-based Aerial Communications with Energy Harvesting: A Reinforcement Learning Approach. (arXiv:2306.12977v1 [cs.IT])\nAbstract: In this letter, we investigate a joint power and beamforming design problem for rate-splitting multiple access (RSMA)-based aerial communications with energy harvesting, where a self-sustainable aerial base station serves multiple users by utilizing the harvested energy. Considering maximizing the sum-rate from the long-term perspective, we utilize a deep reinforcement learning (DRL) approach, namely the soft actor-critic algorithm, to restrict the maximum transmission power at each time based on the stochastic property of the channel environment, harvested energy, and battery power information. Moreover, for designing precoders and power allocation among all the private/common streams of the RSMA, we employ sequential least squares programming (SLSQP) using the Han-Powell quasi-Newton method to maximize the sum-rate for the given transmission power via DRL. Numerical results show the superiority of the proposed scheme over several baseline methods in terms of the average sum-rate perf",
    "path": "papers/23/06/2306.12977.json",
    "total_tokens": 880,
    "translated_title": "一种基于强化学习的能量收集的 RSMA 空中通信的和速率最大化方法",
    "translated_abstract": "本文研究了一种基于能量收集的自持空中基站为多个用户提供服务的速率分裂多址 (RSMA) 空中通信的联合功率和波束赋形设计问题。为了从长期角度最大化总速率，我们使用深度强化学习算法（软演员-评论家算法），基于信道环境、收集能量和电池电量信息的随机属性，限制每个时间的最大传输功率。此外，为了设计 RSMA 的所有私有/公共流的预编码器和功率分配，我们采用序列最小二乘规划 (SLSQP)，使用 Han-Powell 拟牛顿方法通过 DRL 最大化给定传输功率下的总速率。数值结果显示了所提出方案在平均总速率性能方面优于几种基线方法。",
    "tldr": "本文提出了一种基于强化学习的能量收集的 RSMA 空中通信的和速率最大化方法，通过限制每个时间的最大传输功率和使用序列最小二乘规划等方法，实现了对机器人和其他设备提供高效的服务。"
}