{
    "title": "Mixed Integer Programming for Time-Optimal Multi-Robot Coverage Path Planning with Efficient Heuristics. (arXiv:2306.17609v1 [cs.RO])",
    "abstract": "We investigate time-optimal Multi-Robot Coverage Path Planning (MCPP) for both unweighted and weighted terrains, which aims to minimize the coverage time, defined as the maximum travel time of all robots. Specifically, we focus on a reduction from MCPP to Rooted Min-Max Tree Cover (RMMTC). For the first time, we propose a Mixed Integer Programming (MIP) model to optimally solve RMMTC, resulting in an MCPP solution with a coverage time that is provably at most four times the optimal. Moreover, we propose two suboptimal yet effective heuristics that reduce the number of variables in the MIP model, thus improving its efficiency for large-scale MCPP instances. We show that both heuristics result in reduced-size MIP models that remain complete (i.e., guarantee to find a solution if one exists) for all RMMTC instances. Additionally, we explore the use of model optimization warm-startup to further improve the efficiency of both the original MIP model and the reduced-size MIP models. We valida",
    "link": "http://arxiv.org/abs/2306.17609",
    "context": "Title: Mixed Integer Programming for Time-Optimal Multi-Robot Coverage Path Planning with Efficient Heuristics. (arXiv:2306.17609v1 [cs.RO])\nAbstract: We investigate time-optimal Multi-Robot Coverage Path Planning (MCPP) for both unweighted and weighted terrains, which aims to minimize the coverage time, defined as the maximum travel time of all robots. Specifically, we focus on a reduction from MCPP to Rooted Min-Max Tree Cover (RMMTC). For the first time, we propose a Mixed Integer Programming (MIP) model to optimally solve RMMTC, resulting in an MCPP solution with a coverage time that is provably at most four times the optimal. Moreover, we propose two suboptimal yet effective heuristics that reduce the number of variables in the MIP model, thus improving its efficiency for large-scale MCPP instances. We show that both heuristics result in reduced-size MIP models that remain complete (i.e., guarantee to find a solution if one exists) for all RMMTC instances. Additionally, we explore the use of model optimization warm-startup to further improve the efficiency of both the original MIP model and the reduced-size MIP models. We valida",
    "path": "papers/23/06/2306.17609.json",
    "total_tokens": 1000,
    "translated_title": "混合整数规划用于高效启发式算法的时间优化多机器人覆盖路径规划",
    "translated_abstract": "我们研究了旨在最小化覆盖时间（定义为所有机器人的最大行程时间）的未加权和加权地形的时间优化多机器人覆盖路径规划（MCPP）。具体而言，我们将MCPP减少到了根最小最大树覆盖（RMMTC）。首次，我们提出了一个混合整数规划（MIP）模型来最优解决RMMTC问题，从而得到一个MCPP解决方案，其覆盖时间最多为最优解的四倍。此外，我们提出了两个次优但有效的启发式算法，用于减少MIP模型中的变量数量，从而提高其在大规模MCPP实例上的效率。我们展示了这两种启发式算法导致了缩小后的MIP模型，对于所有RMMTC实例来说仍然是完整的（即保证找到解决方案）。此外，我们还探索了模型优化的热启动方法，进一步提高了原始MIP模型和缩小后的MIP模型的效率。",
    "tldr": "本文研究了时间优化多机器人覆盖路径规划问题，并通过混合整数规划模型提出了一个最优解决方案，该方案的覆盖时间最多为最优解的四倍。此外，我们还提出了两个有效的启发式算法来减少问题的规模，并通过模型优化方法进一步提高了效率。",
    "en_tdlr": "This paper addresses time-optimal multi-robot coverage path planning and proposes a MIP model that provides an optimal solution with a coverage time at most four times the optimal. Additionally, two efficient heuristics are introduced to reduce the problem size, and model optimization techniques are explored to further improve efficiency."
}