{
    "title": "Process Knowledge-infused Learning for Clinician-friendly Explanations. (arXiv:2306.09824v1 [cs.CL])",
    "abstract": "Language models have the potential to assess mental health using social media data. By analyzing online posts and conversations, these models can detect patterns indicating mental health conditions like depression, anxiety, or suicidal thoughts. They examine keywords, language markers, and sentiment to gain insights into an individual's mental well-being. This information is crucial for early detection, intervention, and support, improving mental health care and prevention strategies. However, using language models for mental health assessments from social media has two limitations: (1) They do not compare posts against clinicians' diagnostic processes, and (2) It's challenging to explain language model outputs using concepts that the clinician can understand, i.e., clinician-friendly explanations. In this study, we introduce Process Knowledge-infused Learning (PK-iL), a new learning paradigm that layers clinical process knowledge structures on language model outputs, enabling clinicia",
    "link": "http://arxiv.org/abs/2306.09824",
    "context": "Title: Process Knowledge-infused Learning for Clinician-friendly Explanations. (arXiv:2306.09824v1 [cs.CL])\nAbstract: Language models have the potential to assess mental health using social media data. By analyzing online posts and conversations, these models can detect patterns indicating mental health conditions like depression, anxiety, or suicidal thoughts. They examine keywords, language markers, and sentiment to gain insights into an individual's mental well-being. This information is crucial for early detection, intervention, and support, improving mental health care and prevention strategies. However, using language models for mental health assessments from social media has two limitations: (1) They do not compare posts against clinicians' diagnostic processes, and (2) It's challenging to explain language model outputs using concepts that the clinician can understand, i.e., clinician-friendly explanations. In this study, we introduce Process Knowledge-infused Learning (PK-iL), a new learning paradigm that layers clinical process knowledge structures on language model outputs, enabling clinicia",
    "path": "papers/23/06/2306.09824.json",
    "total_tokens": 960,
    "translated_title": "基于流程知识注入的医生友好型解释学习",
    "translated_abstract": "语言模型有潜力利用社交媒体数据评估心理健康。通过分析在线帖子和交流，这些模型可以检测表明抑郁症、焦虑症或自杀倾向等心理健康情况的模式。它们通过关键词、语言标记和情感来洞察个体的心理健康状况。这些信息对于早期检测、干预和支持至关重要，可以改善心理卫生护理和预防策略。然而，利用语言模型从社交媒体对心理健康进行评估有两个局限性：(1)它们不会将帖子与临床医生的诊断过程进行比较，(2)使用临床医生能够理解的概念（即医生友好型解释）解释语言模型的输出是具有挑战性的。在本研究中，我们介绍了基于流程知识注入的学习（PK-iL），这是一种新的学习范式，可以在语言模型输出上添加临床流程知识结构，使医生能够理解和解释模型的输出。",
    "tldr": "本论文介绍了一种名为PK-iL的新学习范式，可以在语言模型输出上添加临床流程知识结构，从而使医生能够理解和解释模型的输出，从而为心理卫生护理和预防策略提供支持和帮助。"
}