{
    "title": "Graph Denoising Diffusion for Inverse Protein Folding. (arXiv:2306.16819v1 [q-bio.QM])",
    "abstract": "Inverse protein folding is challenging due to its inherent one-to-many mapping characteristic, where numerous possible amino acid sequences can fold into a single, identical protein backbone. This task involves not only identifying viable sequences but also representing the sheer diversity of potential solutions. However, existing discriminative models, such as transformer-based auto-regressive models, struggle to encapsulate the diverse range of plausible solutions. In contrast, diffusion probabilistic models, as an emerging genre of generative approaches, offer the potential to generate a diverse set of sequence candidates for determined protein backbones. We propose a novel graph denoising diffusion model for inverse protein folding, where a given protein backbone guides the diffusion process on the corresponding amino acid residue types. The model infers the joint distribution of amino acids conditioned on the nodes' physiochemical properties and local environment. Moreover, we uti",
    "link": "http://arxiv.org/abs/2306.16819",
    "context": "Title: Graph Denoising Diffusion for Inverse Protein Folding. (arXiv:2306.16819v1 [q-bio.QM])\nAbstract: Inverse protein folding is challenging due to its inherent one-to-many mapping characteristic, where numerous possible amino acid sequences can fold into a single, identical protein backbone. This task involves not only identifying viable sequences but also representing the sheer diversity of potential solutions. However, existing discriminative models, such as transformer-based auto-regressive models, struggle to encapsulate the diverse range of plausible solutions. In contrast, diffusion probabilistic models, as an emerging genre of generative approaches, offer the potential to generate a diverse set of sequence candidates for determined protein backbones. We propose a novel graph denoising diffusion model for inverse protein folding, where a given protein backbone guides the diffusion process on the corresponding amino acid residue types. The model infers the joint distribution of amino acids conditioned on the nodes' physiochemical properties and local environment. Moreover, we uti",
    "path": "papers/23/06/2306.16819.json",
    "total_tokens": 906,
    "translated_title": "逆向蛋白质折叠的图去噪扩散",
    "translated_abstract": "逆向蛋白质折叠具有一对多的映射特性，这使得它具有挑战性，因为许多可能的氨基酸序列可以折叠成一个相同的蛋白质骨架。这个任务不仅涉及到识别可行的序列，还要表示潜在解决方案的多样性。然而，现有的鉴别模型，如基于Transformer的自回归模型，很难概括各种可行解的多样性。相反，作为一种新兴的生成方法，扩散概率模型提供了生成一组多样序列候选的潜力，用于确定蛋白质骨架。我们提出了一种新颖的逆向蛋白质折叠的图去噪扩散模型，其中给定的蛋白质骨架指导对应氨基酸残基类型的扩散过程。该模型推断了以节点的物理化学属性和局部环境为条件的氨基酸的联合分布。",
    "tldr": "我们提出了一种逆向蛋白质折叠的图去噪扩散模型，通过扩散过程生成了一组多样的候选序列，该模型能够很好地概括多样的可行解决方案。"
}