{
    "title": "SSL4EO-L: Datasets and Foundation Models for Landsat Imagery. (arXiv:2306.09424v1 [cs.LG])",
    "abstract": "The Landsat program is the longest-running Earth observation program in history, with 50+ years of data acquisition by 8 satellites. The multispectral imagery captured by sensors onboard these satellites is critical for a wide range of scientific fields. Despite the increasing popularity of deep learning and remote sensing, the majority of researchers still use decision trees and random forests for Landsat image analysis due to the prevalence of small labeled datasets and lack of foundation models. In this paper, we introduce SSL4EO-L, the first ever dataset designed for Self-Supervised Learning for Earth Observation for the Landsat family of satellites (including 3 sensors and 2 product levels) and the largest Landsat dataset in history (5M image patches). Additionally, we modernize and re-release the L7 Irish and L8 Biome cloud detection datasets, and introduce the first ML benchmark datasets for Landsats 4-5 TM and Landsat 7 ETM+ SR. Finally, we pre-train the first foundation models",
    "link": "http://arxiv.org/abs/2306.09424",
    "context": "Title: SSL4EO-L: Datasets and Foundation Models for Landsat Imagery. (arXiv:2306.09424v1 [cs.LG])\nAbstract: The Landsat program is the longest-running Earth observation program in history, with 50+ years of data acquisition by 8 satellites. The multispectral imagery captured by sensors onboard these satellites is critical for a wide range of scientific fields. Despite the increasing popularity of deep learning and remote sensing, the majority of researchers still use decision trees and random forests for Landsat image analysis due to the prevalence of small labeled datasets and lack of foundation models. In this paper, we introduce SSL4EO-L, the first ever dataset designed for Self-Supervised Learning for Earth Observation for the Landsat family of satellites (including 3 sensors and 2 product levels) and the largest Landsat dataset in history (5M image patches). Additionally, we modernize and re-release the L7 Irish and L8 Biome cloud detection datasets, and introduce the first ML benchmark datasets for Landsats 4-5 TM and Landsat 7 ETM+ SR. Finally, we pre-train the first foundation models",
    "path": "papers/23/06/2306.09424.json",
    "total_tokens": 1030,
    "translated_title": "Landsat影像数据集和基础模型的SSL4EO-L：深度自学习的首个卫星数据集",
    "translated_abstract": "Landsat计划是有史以来运行时间最长的地球观测计划，通过8个卫星的数据获取，已经有50多年的历史。这些卫星传感器捕获的多光谱图像对多个科学领域至关重要。尽管深度学习和遥感技术越来越受欢迎，但由于小型标记数据集的流行和缺乏基础模型，大多数研究人员仍使用决策树和随机森林进行Landsat图像分析。本文介绍了SSL4EO-L，这是第一个专为Landsat系列卫星（包括3个传感器和2个产品级别）进行自监督学习设计的数据集，也是历史上最大的Landsat数据集（500万图像块）。此外，我们还更新了L7 Irish和L8 Biome云检测数据集，介绍了Landsats 4-5 TM和Landsat 7 ETM + SR的第一个机器学习基准数据集。最后，我们使用SSL4EO-L预训练了第一个Landsat数据分析基础模型，在多个下游任务上实现了最先进的性能。",
    "tldr": "本文介绍了第一个专为Landsat系列卫星设计的自监督学习数据集SSL4EO-L，这也是历史上最大的Landsat数据集，用于预训练基础模型，并在多个下游任务上实现了最先进的性能。",
    "en_tdlr": "This paper presents the first ever dataset designed for Self-Supervised Learning for Earth Observation for the Landsat family of satellites (including 3 sensors and 2 product levels) and the largest Landsat dataset in history (5M image patches) - SSL4EO-L, which was used to pre-train the first foundation models achieving state-of-the-art performance on several downstream tasks."
}