{
    "title": "Finite-Time Analysis of Minimax Q-Learning for Two-Player Zero-Sum Markov Games: Switching System Approach. (arXiv:2306.05700v1 [eess.SY])",
    "abstract": "The objective of this paper is to investigate the finite-time analysis of a Q-learning algorithm applied to two-player zero-sum Markov games. Specifically, we establish a finite-time analysis of both the minimax Q-learning algorithm and the corresponding value iteration method. To enhance the analysis of both value iteration and Q-learning, we employ the switching system model of minimax Q-learning and the associated value iteration. This approach provides further insights into minimax Q-learning and facilitates a more straightforward and insightful convergence analysis. We anticipate that the introduction of these additional insights has the potential to uncover novel connections and foster collaboration between concepts in the fields of control theory and reinforcement learning communities.",
    "link": "http://arxiv.org/abs/2306.05700",
    "context": "Title: Finite-Time Analysis of Minimax Q-Learning for Two-Player Zero-Sum Markov Games: Switching System Approach. (arXiv:2306.05700v1 [eess.SY])\nAbstract: The objective of this paper is to investigate the finite-time analysis of a Q-learning algorithm applied to two-player zero-sum Markov games. Specifically, we establish a finite-time analysis of both the minimax Q-learning algorithm and the corresponding value iteration method. To enhance the analysis of both value iteration and Q-learning, we employ the switching system model of minimax Q-learning and the associated value iteration. This approach provides further insights into minimax Q-learning and facilitates a more straightforward and insightful convergence analysis. We anticipate that the introduction of these additional insights has the potential to uncover novel connections and foster collaboration between concepts in the fields of control theory and reinforcement learning communities.",
    "path": "papers/23/06/2306.05700.json",
    "total_tokens": 751,
    "translated_title": "两人零和Markov博弈的极小极大Q-learning的有限时间分析：切换系统方法",
    "translated_abstract": "本文旨在研究Q-learning算法应用于两人零和Markov博弈的有限时间分析。我们针对极小极大Q-learning算法以及相应的价值迭代方法进行了有限时间分析。为了增强对价值迭代和Q-learning的分析，我们采用了极小极大Q-learning的切换系统模型和相应的价值迭代法。这种方法提供了对极小极大Q-learning的进一步洞察，并有助于更简单和深入的收敛分析。我们预计这些额外的洞察力有潜力揭示控制理论和强化学习社区概念之间的新联系，并促进它们之间的合作。",
    "tldr": "本文研究了Q-learning算法应用于两人零和Markov博弈的有限时间分析，并通过切换系统方法提供了更简单和深入的收敛分析。",
    "en_tdlr": "This paper investigates the finite-time analysis of the Q-learning algorithm applied to two-player zero-sum Markov games, and provides a simpler and deeper convergence analysis through the switching system approach."
}