{
    "title": "Energy-efficient Wearable-to-Mobile Offload of ML Inference for PPG-based Heart-Rate Estimation. (arXiv:2306.06129v1 [eess.SP])",
    "abstract": "Modern smartwatches often include photoplethysmographic (PPG) sensors to measure heartbeats or blood pressure through complex algorithms that fuse PPG data with other signals. In this work, we propose a collaborative inference approach that uses both a smartwatch and a connected smartphone to maximize the performance of heart rate (HR) tracking while also maximizing the smartwatch's battery life. In particular, we first analyze the trade-offs between running on-device HR tracking or offloading the work to the mobile. Then, thanks to an additional step to evaluate the difficulty of the upcoming HR prediction, we demonstrate that we can smartly manage the workload between smartwatch and smartphone, maintaining a low mean absolute error (MAE) while reducing energy consumption. We benchmark our approach on a custom smartwatch prototype, including the STM32WB55 MCU and Bluetooth Low-Energy (BLE) communication, and a Raspberry Pi3 as a proxy for the smartphone. With our Collaborative Heart R",
    "link": "http://arxiv.org/abs/2306.06129",
    "context": "Title: Energy-efficient Wearable-to-Mobile Offload of ML Inference for PPG-based Heart-Rate Estimation. (arXiv:2306.06129v1 [eess.SP])\nAbstract: Modern smartwatches often include photoplethysmographic (PPG) sensors to measure heartbeats or blood pressure through complex algorithms that fuse PPG data with other signals. In this work, we propose a collaborative inference approach that uses both a smartwatch and a connected smartphone to maximize the performance of heart rate (HR) tracking while also maximizing the smartwatch's battery life. In particular, we first analyze the trade-offs between running on-device HR tracking or offloading the work to the mobile. Then, thanks to an additional step to evaluate the difficulty of the upcoming HR prediction, we demonstrate that we can smartly manage the workload between smartwatch and smartphone, maintaining a low mean absolute error (MAE) while reducing energy consumption. We benchmark our approach on a custom smartwatch prototype, including the STM32WB55 MCU and Bluetooth Low-Energy (BLE) communication, and a Raspberry Pi3 as a proxy for the smartphone. With our Collaborative Heart R",
    "path": "papers/23/06/2306.06129.json",
    "total_tokens": 1112,
    "translated_title": "基于PPG的心率估计的能量高效可穿戴式到移动设备的机器学习推断卸载",
    "translated_abstract": "现代智能手表通常包括光脉搏图（PPG）传感器，通过将PPG数据与其他信号融合的复杂算法来测量心跳或血压。在本文中，我们提出了一种协作推理方法，使用智能手表和连接的智能手机来最大化心率（HR）跟踪的性能，同时最大程度地延长智能手表的电池寿命。具体而言，我们首先分析在设备上运行HR跟踪或将工作卸载到移动设备之间的权衡。然后，通过额外的步骤评估即将到来的HR预测的难度，我们演示了我们可以聪明地管理智能手表和智能手机之间的工作负载，保持低平均绝对误差（MAE）同时降低能量消耗。我们在自定义的智能手表原型上对我们的方法进行了基准测试，包括STM32WB55 MCU和低功耗蓝牙（BLE）通信，以及树莓派Pi3作为智能手机的代理。我们的协作心率估计（CHRE）框架将HR跟踪精度提高了8.5％，同时将智能手表的能量消耗降低了37％。",
    "tldr": "本文提出了一种协作推理方法，使用智能手表和连接的智能手机来最大化心率跟踪的性能并最大程度地延长电池寿命，并在自定义的智能手表原型上对方法进行了基准测试。实验证明此方法可以提高8.5\\%的HR跟踪精度和降低37\\%的能量消耗。",
    "en_tdlr": "The paper proposes a collaborative inference approach that uses a smartwatch and a connected smartphone to maximize heart rate tracking performance while prolonging battery life of the smartwatch. Experimental results show an 8.5% improvement in heart rate tracking accuracy and a 37% reduction in energy consumption."
}