{
    "title": "A Mask Free Neural Network for Monaural Speech Enhancement. (arXiv:2306.04286v1 [cs.SD])",
    "abstract": "In speech enhancement, the lack of clear structural characteristics in the target speech phase requires the use of conservative and cumbersome network frameworks. It seems difficult to achieve competitive performance using direct methods and simple network architectures. However, we propose the MFNet, a direct and simple network that can not only map speech but also map reverse noise. This network is constructed by stacking global local former blocks (GLFBs), which combine the advantages of Mobileblock for global processing and Metaformer architecture for local interaction. Our experimental results demonstrate that our network using mapping method outperforms masking methods, and direct mapping of reverse noise is the optimal solution in strong noise environments. In a horizontal comparison on the 2020 Deep Noise Suppression (DNS) challenge test set without reverberation, to the best of our knowledge, MFNet is the current state-of-the-art (SOTA) mapping model.",
    "link": "http://arxiv.org/abs/2306.04286",
    "context": "Title: A Mask Free Neural Network for Monaural Speech Enhancement. (arXiv:2306.04286v1 [cs.SD])\nAbstract: In speech enhancement, the lack of clear structural characteristics in the target speech phase requires the use of conservative and cumbersome network frameworks. It seems difficult to achieve competitive performance using direct methods and simple network architectures. However, we propose the MFNet, a direct and simple network that can not only map speech but also map reverse noise. This network is constructed by stacking global local former blocks (GLFBs), which combine the advantages of Mobileblock for global processing and Metaformer architecture for local interaction. Our experimental results demonstrate that our network using mapping method outperforms masking methods, and direct mapping of reverse noise is the optimal solution in strong noise environments. In a horizontal comparison on the 2020 Deep Noise Suppression (DNS) challenge test set without reverberation, to the best of our knowledge, MFNet is the current state-of-the-art (SOTA) mapping model.",
    "path": "papers/23/06/2306.04286.json",
    "total_tokens": 908,
    "translated_title": "一种无需掩模的单声道语音增强神经网络",
    "translated_abstract": "在语音增强中，目标语音相位缺乏明显的结构特征，需要使用保守而繁琐的网络框架。使用直接方法和简单的网络架构似乎很难取得竞争性能。然而，我们提出了MFNet，一种直接而简单的网络，不仅可以映射语音，还可以映射反噪声。这个网络是通过堆叠全局本地前端块（GLFBs）构建的，它结合了Mobileblock的全局处理优势和Metaformer架构的本地交互优势。我们的实验结果表明，我们使用映射方法的网络优于掩模方法，并且直接映射反噪声是强噪声环境下的最佳解决方案。在2020年Deep Noise Suppression（DNS）挑战测试集上的横向比较中，据我们所知，MFNet是当前状态-of-the-art（SOTA）的映射模型。",
    "tldr": "本文提出了一种无需掩模的单声道语音增强神经网络MFNet，该网络不仅可以映射语音，还可以映射反噪声，在强噪声环境下表现出色，并取得了2020年DNS挑战测试集的最佳结果。",
    "en_tdlr": "This paper proposes a mask-free neural network called MFNet for monaural speech enhancement, which not only maps speech but also maps reverse noise and outperforms masking methods in strong noise environments. The experimental results show that MFNet is the current state-of-the-art (SOTA) mapping model on the 2020 Deep Noise Suppression (DNS) challenge test set."
}