{
    "title": "From Data to Action: Exploring AI and IoT-driven Solutions for Smarter Cities. (arXiv:2306.04653v1 [cs.LG])",
    "abstract": "The emergence of smart cities demands harnessing advanced technologies like the Internet of Things (IoT) and Artificial Intelligence (AI) and promises to unlock cities' potential to become more sustainable, efficient, and ultimately livable for their inhabitants. This work introduces an intelligent city management system that provides a data-driven approach to three use cases: (i) analyze traffic information to reduce the risk of traffic collisions and improve driver and pedestrian safety, (ii) identify when and where energy consumption can be reduced to improve cost savings, and (iii) detect maintenance issues like potholes in the city's roads and sidewalks, as well as the beginning of hazards like floods and fires. A case study in Aveiro City demonstrates the system's effectiveness in generating actionable insights that enhance security, energy efficiency, and sustainability, while highlighting the potential of AI and IoT-driven solutions for smart city development.",
    "link": "http://arxiv.org/abs/2306.04653",
    "context": "Title: From Data to Action: Exploring AI and IoT-driven Solutions for Smarter Cities. (arXiv:2306.04653v1 [cs.LG])\nAbstract: The emergence of smart cities demands harnessing advanced technologies like the Internet of Things (IoT) and Artificial Intelligence (AI) and promises to unlock cities' potential to become more sustainable, efficient, and ultimately livable for their inhabitants. This work introduces an intelligent city management system that provides a data-driven approach to three use cases: (i) analyze traffic information to reduce the risk of traffic collisions and improve driver and pedestrian safety, (ii) identify when and where energy consumption can be reduced to improve cost savings, and (iii) detect maintenance issues like potholes in the city's roads and sidewalks, as well as the beginning of hazards like floods and fires. A case study in Aveiro City demonstrates the system's effectiveness in generating actionable insights that enhance security, energy efficiency, and sustainability, while highlighting the potential of AI and IoT-driven solutions for smart city development.",
    "path": "papers/23/06/2306.04653.json",
    "total_tokens": 896,
    "translated_title": "从数据到行动：探索智能城市的人工智能和物联网驱动解决方案",
    "translated_abstract": "智能城市的出现需要利用先进技术，如物联网（IoT）和人工智能（AI），并承诺释放城市潜力，使其更具可持续性、效率和居民友好性。本文介绍了一种智能城市管理系统，提供基于数据的方法来处理三个用例：（i）分析交通信息，以减少交通事故风险并改善驾驶员和行人的安全性，（ii）确定何时何地可以减少能源消耗以提高成本节省，以及（iii）检测城市道路和人行道上的维护问题，以及洪水和火灾等灾害的开始。在阿维罗市的案例研究中，展示了该系统在生成可操作的见解方面的有效性，增强了安全性、能源效率和可持续性，并突出了AI和IoT驱动的智能城市发展解决方案的潜力。",
    "tldr": "本文介绍了一种智能城市管理系统，利用人工智能和物联网技术来分析交通、能源消耗和城市设施维护等数据，提供可行的解决方案，以增强城市的安全性、能源效率和可持续性。",
    "en_tdlr": "This paper introduces an intelligent city management system that uses AI and IoT to analyze data related to traffic, energy consumption, and city infrastructure maintenance to provide feasible solutions for enhancing city's safety, energy efficiency, and sustainability."
}