{
    "title": "A Computational Analysis of Oral Argument in the Supreme Court. (arXiv:2306.05373v1 [cs.CY])",
    "abstract": "As the most public component of the Supreme Court's decision-making process, oral argument receives an out-sized share of attention in the popular media. Despite its prominence, however, the basic function and operation of oral argument as an institution remains poorly understood, as political scientists and legal scholars continue to debate even the most fundamental questions about its role.  Past study of oral argument has tended to focus on discrete, quantifiable attributes of oral argument, such as the number of questions asked to each advocate, the party of the Justices' appointing president, or the ideological implications of the case on appeal. Such studies allow broad generalizations about oral argument and judicial decision making: Justices tend to vote in accordance with their ideological preferences, and they tend to ask more questions when they are skeptical of a party's position. But they tell us little about the actual goings on at oral argument -- the running dialog betw",
    "link": "http://arxiv.org/abs/2306.05373",
    "context": "Title: A Computational Analysis of Oral Argument in the Supreme Court. (arXiv:2306.05373v1 [cs.CY])\nAbstract: As the most public component of the Supreme Court's decision-making process, oral argument receives an out-sized share of attention in the popular media. Despite its prominence, however, the basic function and operation of oral argument as an institution remains poorly understood, as political scientists and legal scholars continue to debate even the most fundamental questions about its role.  Past study of oral argument has tended to focus on discrete, quantifiable attributes of oral argument, such as the number of questions asked to each advocate, the party of the Justices' appointing president, or the ideological implications of the case on appeal. Such studies allow broad generalizations about oral argument and judicial decision making: Justices tend to vote in accordance with their ideological preferences, and they tend to ask more questions when they are skeptical of a party's position. But they tell us little about the actual goings on at oral argument -- the running dialog betw",
    "path": "papers/23/06/2306.05373.json",
    "total_tokens": 1199,
    "translated_title": "最高法院口头辩论的计算分析",
    "translated_abstract": "作为最高法院决策过程中最为公开的部分，口头辩论在大众媒体中受到了非常多的关注。然而，作为一个机构，口头辩论的基本功能和作用仍然不为人们所熟知。过去的研究往往集中在口头辩论的离散量化属性上，如对每位辩护律师提问的次数、法官任命总统的党派和上诉案件的意识形态影响等，但这些研究很少涉及到口头辩论的具体过程和更广泛的制度和规范作用。本文提出了一个基于1955年至2018年语料库的最高法院口头辩论的计算分析方法，强调口头辩论的质性和交互方面，旨在揭示在辩论中律师和法官所采用的修辞策略的模式和倾向性。我们的研究表明，口头辩论是一个高度结构化和战略性的仪式，律师使用各种修辞策略来推进他们的案件，而法官则通过提问和评论不仅塑造他们面前的案件，而且塑造了法院更广泛的法律原则。",
    "tldr": "本文提出了一个计算分析的方法来研究最高法院的口头辩论。结果发现，口头辩论是一个高度结构化和战略性的仪式，律师使用各种修辞策略来推进他们的案件，而法官则通过提问和评论不仅塑造他们面前的案件，而且塑造了法院更广泛的法律原则。",
    "en_tdlr": "This paper presents a computational analysis of oral argument in the US Supreme Court, emphasizing the qualitative and interactional aspects and uncovering patterns in rhetorical strategies used by lawyers and justices during argument. Results suggest that oral argument is a highly structured and strategic ritual, with advocates using various rhetorical strategies and justices shaping not only the case before them, but also the Court's broader jurisprudence."
}