{
    "title": "Fuzzy Feature Selection with Key-based Cryptographic Transformations. (arXiv:2306.09583v1 [cs.CR])",
    "abstract": "In the field of cryptography, the selection of relevant features plays a crucial role in enhancing the security and efficiency of cryptographic algorithms. This paper presents a novel approach of applying fuzzy feature selection to key-based cryptographic transformations. The proposed fuzzy feature selection leverages the power of fuzzy logic to identify and select optimal subsets of features that contribute most effectively to the cryptographic transformation process. By incorporating fuzzy feature selection into key-based cryptographic transformations, this research aims to improve the resistance against attacks and enhance the overall performance of cryptographic systems. Experimental evaluations may demonstrate the effectiveness of the proposed approach in selecting secure key features with minimal computational overhead. This paper highlights the potential of fuzzy feature selection as a valuable tool in the design and optimization of key-based cryptographic algorithms, contributi",
    "link": "http://arxiv.org/abs/2306.09583",
    "context": "Title: Fuzzy Feature Selection with Key-based Cryptographic Transformations. (arXiv:2306.09583v1 [cs.CR])\nAbstract: In the field of cryptography, the selection of relevant features plays a crucial role in enhancing the security and efficiency of cryptographic algorithms. This paper presents a novel approach of applying fuzzy feature selection to key-based cryptographic transformations. The proposed fuzzy feature selection leverages the power of fuzzy logic to identify and select optimal subsets of features that contribute most effectively to the cryptographic transformation process. By incorporating fuzzy feature selection into key-based cryptographic transformations, this research aims to improve the resistance against attacks and enhance the overall performance of cryptographic systems. Experimental evaluations may demonstrate the effectiveness of the proposed approach in selecting secure key features with minimal computational overhead. This paper highlights the potential of fuzzy feature selection as a valuable tool in the design and optimization of key-based cryptographic algorithms, contributi",
    "path": "papers/23/06/2306.09583.json",
    "total_tokens": 809,
    "translated_title": "基于模糊逻辑的密钥密码学变换模糊特征选择",
    "translated_abstract": "在密码学领域中，选择相关特征在增强密码算法安全性和效率方面扮演着至关重要的角色。本文提出了一种新颖的方法，将模糊特征选择应用于基于密钥的密码学变换。提出的模糊特征选择利用模糊逻辑的优势来识别和选择最有效地contributi完成密码学变换过程的特征子集。通过将模糊特征选择纳入基于密钥的密码学变换中，该研究旨在提高抵抗攻击的能力并增强密码系统的整体性能。实验评估可以证明所提出的方法在选择安全密钥特征时具有最小的计算开销。本文强调了模糊特征选择作为设计和优化基于密钥的密码算法的有价值工具的潜力。",
    "tldr": "本文提出了一种基于模糊逻辑的模糊特征选择方法，可用于选择最有效地完成密码学变换过程的特征子集，旨在提高密码系统的安全性和效率。"
}