{
    "title": "Tuning Legged Locomotion Controllers via Safe Bayesian Optimization. (arXiv:2306.07092v2 [cs.RO] UPDATED)",
    "abstract": "This paper presents a data-driven strategy to streamline the deployment of model-based controllers in legged robotic hardware platforms. Our approach leverages a model-free safe learning algorithm to automate the tuning of control gains, addressing the mismatch between the simplified model used in the control formulation and the real system. This method substantially mitigates the risk of hazardous interactions with the robot by sample-efficiently optimizing parameters within a probably safe region. Additionally, we extend the applicability of our approach to incorporate the different gait parameters as contexts, leading to a safe, sample-efficient exploration algorithm capable of tuning a motion controller for diverse gait patterns. We validate our method through simulation and hardware experiments, where we demonstrate that the algorithm obtains superior performance on tuning a model-based motion controller for multiple gaits safely.",
    "link": "http://arxiv.org/abs/2306.07092",
    "context": "Title: Tuning Legged Locomotion Controllers via Safe Bayesian Optimization. (arXiv:2306.07092v2 [cs.RO] UPDATED)\nAbstract: This paper presents a data-driven strategy to streamline the deployment of model-based controllers in legged robotic hardware platforms. Our approach leverages a model-free safe learning algorithm to automate the tuning of control gains, addressing the mismatch between the simplified model used in the control formulation and the real system. This method substantially mitigates the risk of hazardous interactions with the robot by sample-efficiently optimizing parameters within a probably safe region. Additionally, we extend the applicability of our approach to incorporate the different gait parameters as contexts, leading to a safe, sample-efficient exploration algorithm capable of tuning a motion controller for diverse gait patterns. We validate our method through simulation and hardware experiments, where we demonstrate that the algorithm obtains superior performance on tuning a model-based motion controller for multiple gaits safely.",
    "path": "papers/23/06/2306.07092.json",
    "total_tokens": 802,
    "translated_title": "通过安全贝叶斯优化调整四足行走控制器",
    "translated_abstract": "本文提出了一种数据驱动的策略，以简化在四足机器人硬件平台中部署基于模型的控制器的过程。我们的方法利用一种无模型安全学习算法自动调整控制增益，解决了在控制制定中使用的简化模型与实际系统之间的不匹配问题。该方法通过在可能安全区域内高效优化参数，大大减小了与机器人的危险交互的风险。此外，我们扩展了我们的方法的适用范围，以将不同的步态参数作为背景，从而得到一种安全、高效的探索算法，能够安全地调整多样化步态模式的运动控制器。我们通过模拟和硬件实验验证了我们的方法，在多个步态中调整基于模型的运动控制器方面，该算法获得了更好的性能。",
    "tldr": "本文提出了一种通过安全贝叶斯优化来调整四足行走控制器的策略，并通过模拟和硬件实验验证了该方法的有效性。",
    "en_tdlr": "This paper proposes a strategy to adjust quadruped locomotion controllers using safe Bayesian optimization and demonstrates its effectiveness through simulations and hardware experiments."
}