{
    "title": "Feature Selection using Sparse Adaptive Bottleneck Centroid-Encoder. (arXiv:2306.04795v1 [cs.LG])",
    "abstract": "We introduce a novel nonlinear model, Sparse Adaptive Bottleneck Centroid-Encoder (SABCE), for determining the features that discriminate between two or more classes. The algorithm aims to extract discriminatory features in groups while reconstructing the class centroids in the ambient space and simultaneously use additional penalty terms in the bottleneck layer to decrease within-class scatter and increase the separation of different class centroids. The model has a sparsity-promoting layer (SPL) with a one-to-one connection to the input layer. Along with the primary objective, we minimize the $l_{2,1}$-norm of the sparse layer, which filters out unnecessary features from input data. During training, we update class centroids by taking the Hadamard product of the centroids and weights of the sparse layer, thus ignoring the irrelevant features from the target. Therefore the proposed method learns to reconstruct the critical components of class centroids rather than the whole centroids.",
    "link": "http://arxiv.org/abs/2306.04795",
    "context": "Title: Feature Selection using Sparse Adaptive Bottleneck Centroid-Encoder. (arXiv:2306.04795v1 [cs.LG])\nAbstract: We introduce a novel nonlinear model, Sparse Adaptive Bottleneck Centroid-Encoder (SABCE), for determining the features that discriminate between two or more classes. The algorithm aims to extract discriminatory features in groups while reconstructing the class centroids in the ambient space and simultaneously use additional penalty terms in the bottleneck layer to decrease within-class scatter and increase the separation of different class centroids. The model has a sparsity-promoting layer (SPL) with a one-to-one connection to the input layer. Along with the primary objective, we minimize the $l_{2,1}$-norm of the sparse layer, which filters out unnecessary features from input data. During training, we update class centroids by taking the Hadamard product of the centroids and weights of the sparse layer, thus ignoring the irrelevant features from the target. Therefore the proposed method learns to reconstruct the critical components of class centroids rather than the whole centroids.",
    "path": "papers/23/06/2306.04795.json",
    "total_tokens": 953,
    "translated_title": "使用稀疏自适应瓶颈质心编码器进行特征选择",
    "translated_abstract": "我们引入了一种新的非线性模型，即稀疏自适应瓶颈质心编码器（SABCE），用于确定能够区分两个或多个类别的特征。该算法旨在提取有区别的特征组，并在环境空间中重构类别质心，同时在瓶颈层使用附加惩罚项来减少同类分散度并增加不同类别质心的分离性。模型具有促进稀疏性的层（SPL），与输入层具有一对一的连接。除了主要目标，我们还最小化稀疏层的$l_{2,1}$-范数，从而过滤掉输入数据中的不必要的特征。在训练期间，我们通过将质心和稀疏层的权重的Hadamard积来更新类别质心，从而忽略目标中的无关特征。因此，该方法学习重建类别质心的关键组件，而不是整个质心。",
    "tldr": "该论文提出一种基于稀疏自适应瓶颈质心编码器的特征选择模型，该模型通过提取有区别的特征组以及在重构类别质心的同时减少同类分散度、增加不同类别质心的分离性，从而实现过滤输入数据中不必要特征的功能。",
    "en_tdlr": "This paper proposes a novel feature selection model based on Sparse Adaptive Bottleneck Centroid-Encoder (SABCE), which aims to extract discriminatory feature groups and decrease within-class scatter and increase the separation of different class centroids in the process of reconstructing class centroids in the ambient space, thus achieving the function of filtering unnecessary features in input data."
}