{
    "title": "Real-time whole-heart electromechanical simulations using Latent Neural Ordinary Differential Equations. (arXiv:2306.05321v1 [math.NA])",
    "abstract": "Cardiac digital twins provide a physics and physiology informed framework to deliver predictive and personalized medicine. However, high-fidelity multi-scale cardiac models remain a barrier to adoption due to their extensive computational costs and the high number of model evaluations needed for patient-specific personalization. Artificial Intelligence-based methods can make the creation of fast and accurate whole-heart digital twins feasible. In this work, we use Latent Neural Ordinary Differential Equations (LNODEs) to learn the temporal pressure-volume dynamics of a heart failure patient. Our surrogate model based on LNODEs is trained from 400 3D-0D whole-heart closed-loop electromechanical simulations while accounting for 43 model parameters, describing single cell through to whole organ and cardiovascular hemodynamics. The trained LNODEs provides a compact and efficient representation of the 3D-0D model in a latent space by means of a feedforward fully-connected Artificial Neural ",
    "link": "http://arxiv.org/abs/2306.05321",
    "context": "Title: Real-time whole-heart electromechanical simulations using Latent Neural Ordinary Differential Equations. (arXiv:2306.05321v1 [math.NA])\nAbstract: Cardiac digital twins provide a physics and physiology informed framework to deliver predictive and personalized medicine. However, high-fidelity multi-scale cardiac models remain a barrier to adoption due to their extensive computational costs and the high number of model evaluations needed for patient-specific personalization. Artificial Intelligence-based methods can make the creation of fast and accurate whole-heart digital twins feasible. In this work, we use Latent Neural Ordinary Differential Equations (LNODEs) to learn the temporal pressure-volume dynamics of a heart failure patient. Our surrogate model based on LNODEs is trained from 400 3D-0D whole-heart closed-loop electromechanical simulations while accounting for 43 model parameters, describing single cell through to whole organ and cardiovascular hemodynamics. The trained LNODEs provides a compact and efficient representation of the 3D-0D model in a latent space by means of a feedforward fully-connected Artificial Neural ",
    "path": "papers/23/06/2306.05321.json",
    "total_tokens": 1065,
    "translated_title": "使用潜变量神经常微分方程的实时全心脏电机仿真",
    "translated_abstract": "心脏数字孪生提供了一种基于物理和生理学的框架，以提供预测性和个性化医学。然而，高保真度的多尺度心脏模型仍然是采用的障碍，因为它们的广泛计算成本以及需要大量的模型评估进行特定于患者的个性化。基于人工智能的方法可以使创建快速准确的全心数字孪生成为可能。在这项工作中，我们使用潜变量神经常微分方程(LNODEs)来学习心力衰竭患者的时间压力-容积动力学。我们基于LNODEs的代理模型是从400个三维零维全心闭环电机仿真中进行训练的，同时考虑43个模型参数，描述单个细胞到整个器官和心血管血液动力学。经过训练的LNODE提供了3D-0D模型在潜空间中的紧凑且高效的表示，通过前馈全连接的人工神经网络。我们展示了LNODE的代理可以对不同的肌力介入做出实时预测，提供了一种可能的快速工具，用于特定于患者的诊断和治疗优化。",
    "tldr": "该论文使用潜变量神经常微分方程(LNODEs)实现了实时全心脏电机仿真，并开发出了一个代理模型，可快速预测对不同肌力干预的压力-容积曲线，为患者特异性诊断和治疗优化提供了潜在快速工具。",
    "en_tdlr": "This paper develops real-time whole-heart electromechanical simulations using Latent Neural Ordinary Differential Equations (LNODEs) and proposes a surrogate model which can predict the pressure-volume loops in response to different inotropic interventions, offering a potentially rapid tool for patient-specific diagnosis and treatment optimization."
}