{
    "title": "A New Probabilistic Distance Metric With Application In Gaussian Mixture Reduction. (arXiv:2306.07309v1 [cs.LG])",
    "abstract": "This paper presents a new distance metric to compare two continuous probability density functions. The main advantage of this metric is that, unlike other statistical measurements, it can provide an analytic, closed-form expression for a mixture of Gaussian distributions while satisfying all metric properties. These characteristics enable fast, stable, and efficient calculations, which are highly desirable in real-world signal processing applications. The application in mind is Gaussian Mixture Reduction (GMR), which is widely used in density estimation, recursive tracking, and belief propagation. To address this problem, we developed a novel algorithm dubbed the Optimization-based Greedy GMR (OGGMR), which employs our metric as a criterion to approximate a high-order Gaussian mixture with a lower order. Experimental results show that the OGGMR algorithm is significantly faster and more efficient than state-of-the-art GMR algorithms while retaining the geometric shape of the original m",
    "link": "http://arxiv.org/abs/2306.07309",
    "context": "Title: A New Probabilistic Distance Metric With Application In Gaussian Mixture Reduction. (arXiv:2306.07309v1 [cs.LG])\nAbstract: This paper presents a new distance metric to compare two continuous probability density functions. The main advantage of this metric is that, unlike other statistical measurements, it can provide an analytic, closed-form expression for a mixture of Gaussian distributions while satisfying all metric properties. These characteristics enable fast, stable, and efficient calculations, which are highly desirable in real-world signal processing applications. The application in mind is Gaussian Mixture Reduction (GMR), which is widely used in density estimation, recursive tracking, and belief propagation. To address this problem, we developed a novel algorithm dubbed the Optimization-based Greedy GMR (OGGMR), which employs our metric as a criterion to approximate a high-order Gaussian mixture with a lower order. Experimental results show that the OGGMR algorithm is significantly faster and more efficient than state-of-the-art GMR algorithms while retaining the geometric shape of the original m",
    "path": "papers/23/06/2306.07309.json",
    "total_tokens": 959,
    "translated_title": "一种新的概率距离度量及其在高斯混合模型中的应用",
    "translated_abstract": "本文提出了一种新的距离度量方法，用于比较两个连续概率密度函数。该距离度量方法具有许多优点，其中最重要的是广义高斯混合模型可以用它的解析式表示，并且它满足所有的距离公式性质，具有计算速度快、稳定和高效的特点，十分适用于实际信号处理应用。本文应用该方法于高斯混合模型简化（Gaussian Mixture Reduction，GMR）问题，提出了基于优化的贪心 GMR（OGGMR）算法，该算法使用我们的距离度量作为准则，将高次高斯混合模型近似为低阶模型。实验证明，OGGMR算法比现有的GMR算法更快、更高效，并能保留原始模型的几何形状。",
    "tldr": "本文提出了一种新的距离度量方法，用于计算高斯混合模型，从而提高信号处理应用的效率和稳定性。同时，提出了一种新的基于优化的贪心 GMR（OGGMR）算法，用于将高次高斯混合模型近似为低阶模型，实验表明它比现有的GMR算法更快、更高效，并能保留原始模型的几何形状。",
    "en_tdlr": "This paper proposes a new distance metric for computing Gaussian Mixture Models, with the aim of improving the efficiency and stability of signal processing applications. The authors introduce a novel Optimization-based Greedy GMR (OGGMR) algorithm, which approximates a higher order GMM to a lower one, while retaining the geometric shape of the original model. Experimental results demonstrate that OGGMR outperforms existing GMR algorithms in terms of speed and efficiency."
}