{
    "title": "AI Driven Near Real-time Locational Marginal Pricing Method: A Feasibility and Robustness Study. (arXiv:2306.10080v2 [cs.CE] UPDATED)",
    "abstract": "Accurate price predictions are essential for market participants in order to optimize their operational schedules and bidding strategies, especially in the current context where electricity prices become more volatile and less predictable using classical approaches. The Locational Marginal Pricing (LMP) pricing mechanism is used in many modern power markets, where the traditional approach utilizes optimal power flow (OPF) solvers. However, for large electricity grids this process becomes prohibitively time-consuming and computationally intensive. Machine learning (ML) based predictions could provide an efficient tool for LMP prediction, especially in energy markets with intermittent sources like renewable energy. This study evaluates the performance of popular machine learning and deep learning models in predicting LMP on multiple electricity grids. The accuracy and robustness of these models in predicting LMP is assessed considering multiple scenarios. The results show that ML models ",
    "link": "http://arxiv.org/abs/2306.10080",
    "context": "Title: AI Driven Near Real-time Locational Marginal Pricing Method: A Feasibility and Robustness Study. (arXiv:2306.10080v2 [cs.CE] UPDATED)\nAbstract: Accurate price predictions are essential for market participants in order to optimize their operational schedules and bidding strategies, especially in the current context where electricity prices become more volatile and less predictable using classical approaches. The Locational Marginal Pricing (LMP) pricing mechanism is used in many modern power markets, where the traditional approach utilizes optimal power flow (OPF) solvers. However, for large electricity grids this process becomes prohibitively time-consuming and computationally intensive. Machine learning (ML) based predictions could provide an efficient tool for LMP prediction, especially in energy markets with intermittent sources like renewable energy. This study evaluates the performance of popular machine learning and deep learning models in predicting LMP on multiple electricity grids. The accuracy and robustness of these models in predicting LMP is assessed considering multiple scenarios. The results show that ML models ",
    "path": "papers/23/06/2306.10080.json",
    "total_tokens": 905,
    "translated_title": "基于人工智能的准实时定位边际定价方法：可行性和稳健性研究",
    "translated_abstract": "准确的价格预测对于市场参与者来说至关重要，以优化他们的操作计划和竞标策略，特别是在当前情况下，使用经典方法预测电力价格变得更加波动和不可预测。定位边际定价（LMP）定价机制在许多现代电力市场中使用，其中传统方法利用最优潮流（OPF）求解器。然而，对于大型电力网络，这个过程变得耗时且计算密集。基于机器学习（ML）的预测可以为LMP预测提供高效工具，特别是在具有可再生能源等间歇性来源的能源市场中。本研究评估了流行的机器学习和深度学习模型在多个电力网络上预测LMP的性能。考虑多种情景评估了这些模型在预测LMP方面的准确性和稳健性。结果表明，ML模型可以提供准确且稳健的LMP预测。",
    "tldr": "本研究评估了基于机器学习和深度学习的模型在预测定位边际定价（LMP）时的性能，并发现这些模型在多个电力网络上具有准确且稳健的预测能力。",
    "en_tdlr": "This study evaluates the performance of machine learning and deep learning models in predicting Locational Marginal Pricing (LMP) and finds that these models have accurate and robust prediction capabilities on multiple electricity grids."
}