{
    "title": "DHBE: Data-free Holistic Backdoor Erasing in Deep Neural Networks via Restricted Adversarial Distillation. (arXiv:2306.08009v1 [cs.LG])",
    "abstract": "Backdoor attacks have emerged as an urgent threat to Deep Neural Networks (DNNs), where victim DNNs are furtively implanted with malicious neurons that could be triggered by the adversary. To defend against backdoor attacks, many works establish a staged pipeline to remove backdoors from victim DNNs: inspecting, locating, and erasing. However, in a scenario where a few clean data can be accessible, such pipeline is fragile and cannot erase backdoors completely without sacrificing model accuracy. To address this issue, in this paper, we propose a novel data-free holistic backdoor erasing (DHBE) framework. Instead of the staged pipeline, the DHBE treats the backdoor erasing task as a unified adversarial procedure, which seeks equilibrium between two different competing processes: distillation and backdoor regularization. In distillation, the backdoored DNN is distilled into a proxy model, transferring its knowledge about clean data, yet backdoors are simultaneously transferred. In backdo",
    "link": "http://arxiv.org/abs/2306.08009",
    "context": "Title: DHBE: Data-free Holistic Backdoor Erasing in Deep Neural Networks via Restricted Adversarial Distillation. (arXiv:2306.08009v1 [cs.LG])\nAbstract: Backdoor attacks have emerged as an urgent threat to Deep Neural Networks (DNNs), where victim DNNs are furtively implanted with malicious neurons that could be triggered by the adversary. To defend against backdoor attacks, many works establish a staged pipeline to remove backdoors from victim DNNs: inspecting, locating, and erasing. However, in a scenario where a few clean data can be accessible, such pipeline is fragile and cannot erase backdoors completely without sacrificing model accuracy. To address this issue, in this paper, we propose a novel data-free holistic backdoor erasing (DHBE) framework. Instead of the staged pipeline, the DHBE treats the backdoor erasing task as a unified adversarial procedure, which seeks equilibrium between two different competing processes: distillation and backdoor regularization. In distillation, the backdoored DNN is distilled into a proxy model, transferring its knowledge about clean data, yet backdoors are simultaneously transferred. In backdo",
    "path": "papers/23/06/2306.08009.json",
    "total_tokens": 1130,
    "translated_title": "DHBE: 通过受限对抗蒸馏的数据无关全面后门擦除来保护深度神经网络",
    "translated_abstract": "后门攻击已成为深度神经网络（DNN）的紧急威胁。为防御后门攻击，许多工作都建立了一个分阶段的流程来从受害DNN中移除后门：检查、定位和擦除。然而，在只有少量干净数据可用的情况下，这种流程是脆弱的，而且不能在不牺牲模型准确性的情况下完全擦除后门。因此，本文提出了一种全新的数据无关全面后门擦除（DHBE）框架。该框架将后门擦除任务视为一个统一的对抗过程，在转移干净数据的知识的同时保证擦除后门。通过对抗蒸馏和后门正则化两个不同的竞争过程，DHBE实现了一种统一的、无需数据，并且有效的后门擦除框架。大量的实验证明，DHBE可以高成功率地擦除后门，同时保持模型准确性，胜过现有技术。",
    "tldr": "本文提出了一种数据无关的全面后门擦除（DHBE）框架，该框架将后门擦除任务视为一个统一的对抗过程，在转移干净数据的知识的同时保证擦除后门。通过对抗蒸馏和后门正则化两个不同的竞争过程，DHBE实现了一种统一的、无需数据，并且有效的后门擦除框架。",
    "en_tdlr": "This paper proposes a data-free holistic backdoor erasing (DHBE) framework, which treats the backdoor erasing task as a unified adversarial procedure, ensuring the transfer of clean data knowledge while erasing backdoors. DHBE achieves a unified, data-free, and effective backdoor erasing framework through the competing processes of adversarial distillation and backdoor regularization. DHBE outperforms existing techniques by removing backdoors with high success rates while preserving model accuracy."
}