{
    "title": "DEPAC: a Corpus for Depression and Anxiety Detection from Speech. (arXiv:2306.12443v1 [eess.AS])",
    "abstract": "Mental distress like depression and anxiety contribute to the largest proportion of the global burden of diseases. Automated diagnosis systems of such disorders, empowered by recent innovations in Artificial Intelligence, can pave the way to reduce the sufferings of the affected individuals. Development of such systems requires information-rich and balanced corpora. In this work, we introduce a novel mental distress analysis audio dataset DEPAC, labeled based on established thresholds on depression and anxiety standard screening tools. This large dataset comprises multiple speech tasks per individual, as well as relevant demographic information. Alongside, we present a feature set consisting of hand-curated acoustic and linguistic features, which were found effective in identifying signs of mental illnesses in human speech. Finally, we justify the quality and effectiveness of our proposed audio corpus and feature set in predicting depression severity by comparing the performance of bas",
    "link": "http://arxiv.org/abs/2306.12443",
    "context": "Title: DEPAC: a Corpus for Depression and Anxiety Detection from Speech. (arXiv:2306.12443v1 [eess.AS])\nAbstract: Mental distress like depression and anxiety contribute to the largest proportion of the global burden of diseases. Automated diagnosis systems of such disorders, empowered by recent innovations in Artificial Intelligence, can pave the way to reduce the sufferings of the affected individuals. Development of such systems requires information-rich and balanced corpora. In this work, we introduce a novel mental distress analysis audio dataset DEPAC, labeled based on established thresholds on depression and anxiety standard screening tools. This large dataset comprises multiple speech tasks per individual, as well as relevant demographic information. Alongside, we present a feature set consisting of hand-curated acoustic and linguistic features, which were found effective in identifying signs of mental illnesses in human speech. Finally, we justify the quality and effectiveness of our proposed audio corpus and feature set in predicting depression severity by comparing the performance of bas",
    "path": "papers/23/06/2306.12443.json",
    "total_tokens": 1010,
    "translated_title": "DEPAC：一份针对抑郁症和焦虑症检测的语音语料库",
    "translated_abstract": "心理困扰，比如抑郁症和焦虑症，对全球疾病负担的贡献最大。受到人工智能领域最新技术的影响，这些障碍的自动诊断系统可以为受影响的人们减少痛苦。这种系统的开发需要信息丰富且平衡的语料库。在这项工作中，我们介绍了一份新颖的心理困扰分析音频数据集DEPAC，基于抑郁症和焦虑症标准筛查工具上的已建立门槛进行标记。这个大型数据集包括每个个体的多个语音任务以及相关的人口统计信息。同时，我们提出了一个特征集，包括手工筛选的声学和语言特征，在人类语音中识别精神疾病迹象方面发挥了效果。最后，我们通过比较基线的性能来证明我们提出的音频语料库和特征集在预测抑郁症严重程度方面的质量和有效性。",
    "tldr": "本文介绍了一份新颖的语音数据集DEPAC，该数据集标记了抑郁症和焦虑症标准筛查工具上的门槛。此外，作者还提出了一组手工筛选的声学和语言特征，可以有效地识别人类语音中的精神疾病迹象。该研究为自动诊断系统的开发提供了信息丰富且平衡的语料库。"
}