{
    "title": "Toward Textual Internet Immunity. (arXiv:2306.02875v1 [econ.GN])",
    "abstract": "Internet immunity doctrine is broken. Under Section 230 of the Communications Decency Act of 1996, online entities are absolutely immune from lawsuits related to content authored by third parties. The law has been essential to the internet's development over the last twenty years, but it has not kept pace with the times and is now deeply flawed. Democrats demand accountability for online misinformation. Republicans decry politically motivated censorship. And Congress, President Biden, the Department of Justice, and the Federal Communications Commission all have their own plans for reform. Absent from the fray, however -- until now -- has been the Supreme Court, which has never issued a decision interpreting Section 230. That appears poised to change, however, following Justice Thomas's statement in Malwarebytes v. Enigma in which he urges the Court to prune back decades of lower-court precedent to craft a more limited immunity doctrine. This Essay discusses how courts' zealous enforcem",
    "link": "http://arxiv.org/abs/2306.02875",
    "context": "Title: Toward Textual Internet Immunity. (arXiv:2306.02875v1 [econ.GN])\nAbstract: Internet immunity doctrine is broken. Under Section 230 of the Communications Decency Act of 1996, online entities are absolutely immune from lawsuits related to content authored by third parties. The law has been essential to the internet's development over the last twenty years, but it has not kept pace with the times and is now deeply flawed. Democrats demand accountability for online misinformation. Republicans decry politically motivated censorship. And Congress, President Biden, the Department of Justice, and the Federal Communications Commission all have their own plans for reform. Absent from the fray, however -- until now -- has been the Supreme Court, which has never issued a decision interpreting Section 230. That appears poised to change, however, following Justice Thomas's statement in Malwarebytes v. Enigma in which he urges the Court to prune back decades of lower-court precedent to craft a more limited immunity doctrine. This Essay discusses how courts' zealous enforcem",
    "path": "papers/23/06/2306.02875.json",
    "total_tokens": 953,
    "translated_title": "走向文本互联网免疫",
    "translated_abstract": "互联网免疫原则已经破产。根据1996年通信廉洁法案第230节，在线实体在涉及第三方创作内容的诉讼中享有绝对豁免权。这项法律在过去20年中对互联网的发展至关重要，但现在已经远远落后于时代，并且存在严重缺陷。民主党要求对在线虚假信息负责。共和党谴责政治动机的审查。国会，拜登总统，司法部和联邦通信委员会都有自己的改革计划。然而，直到现在，最高法院都没有参与争论，从未发表解释第230节的判决。然而，在马尔韦尔比特斯诉恩伽马案中，托马斯法官敦促法院裁剪几十年来的下级法院先例，制定更为限制的豁免原则，这一情况似乎即将发生变化。本篇论文讨论了法院如何热切地推动第230节的执行",
    "tldr": "本文讨论了互联网免疫原则的破产以及法院对第230节的执行，民主党要求对在线虚假信息负责，共和党谴责政治动机的审查，而最高法院可能会发布解释第230节的裁决，限制豁免原则的范围。",
    "en_tdlr": "This article discusses the breakdown of the internet immunity doctrine and the courts' enforcement of Section 230, with Democrats demanding accountability for online misinformation and Republicans decrying politically motivated censorship, while the Supreme Court may issue a ruling on interpreting Section 230, limiting the scope of the immunity doctrine."
}