{
    "title": "Hyper-parameter Adaptation of Conformer ASR Systems for Elderly and Dysarthric Speech Recognition. (arXiv:2306.15265v1 [eess.AS])",
    "abstract": "Automatic recognition of disordered and elderly speech remains highly challenging tasks to date due to data scarcity. Parameter fine-tuning is often used to exploit the large quantities of non-aged and healthy speech pre-trained models, while neural architecture hyper-parameters are set using expert knowledge and remain unchanged. This paper investigates hyper-parameter adaptation for Conformer ASR systems that are pre-trained on the Librispeech corpus before being domain adapted to the DementiaBank elderly and UASpeech dysarthric speech datasets. Experimental results suggest that hyper-parameter adaptation produced word error rate (WER) reductions of 0.45% and 0.67% over parameter-only fine-tuning on DBank and UASpeech tasks respectively. An intuitive correlation is found between the performance improvements by hyper-parameter domain adaptation and the relative utterance length ratio between the source and target domain data.",
    "link": "http://arxiv.org/abs/2306.15265",
    "context": "Title: Hyper-parameter Adaptation of Conformer ASR Systems for Elderly and Dysarthric Speech Recognition. (arXiv:2306.15265v1 [eess.AS])\nAbstract: Automatic recognition of disordered and elderly speech remains highly challenging tasks to date due to data scarcity. Parameter fine-tuning is often used to exploit the large quantities of non-aged and healthy speech pre-trained models, while neural architecture hyper-parameters are set using expert knowledge and remain unchanged. This paper investigates hyper-parameter adaptation for Conformer ASR systems that are pre-trained on the Librispeech corpus before being domain adapted to the DementiaBank elderly and UASpeech dysarthric speech datasets. Experimental results suggest that hyper-parameter adaptation produced word error rate (WER) reductions of 0.45% and 0.67% over parameter-only fine-tuning on DBank and UASpeech tasks respectively. An intuitive correlation is found between the performance improvements by hyper-parameter domain adaptation and the relative utterance length ratio between the source and target domain data.",
    "path": "papers/23/06/2306.15265.json",
    "total_tokens": 940,
    "translated_title": "适应老年和发音障碍者语音识别的Conformer ASR系统的超参数调整",
    "translated_abstract": "自动识别混乱和老年人的语音仍然是一项具有挑战性的任务，因为数据稀缺。通常使用参数微调来利用大量的非老年和健康语音预训练模型，而神经网络架构的超参数则使用专家知识设置并保持不变。本文研究了在Librispeech语料库上预训练的Conformer ASR系统的超参数适应性，然后将其领域适应到DementiaBank老年人和UASpeech发音障碍者语音数据集。实验结果表明，与仅参数微调相比，超参数适应在DBank和UASpeech任务中分别减少了0.45%和0.67%的词错误率（WER）。在超参数领域适应的性能改进和源域数据与目标域数据的相对话语长度比之间存在直观的相关性。",
    "tldr": "本文研究了在Librispeech语料库上预训练的Conformer ASR系统的超参数适应性，并将其应用于DementiaBank老年人和UASpeech发音障碍者语音数据集。实验结果表明，超参数适应可以显著降低词错误率，并发现了超参数适应性能改进与源域和目标域数据的话语长度比之间的相关性。",
    "en_tdlr": "This paper investigates hyper-parameter adaptation for Conformer ASR systems that are pre-trained on the Librispeech corpus before being domain adapted to the DementiaBank elderly and UASpeech dysarthric speech datasets. The experimental results suggest that hyper-parameter adaptation can significantly reduce word error rate (WER), and an intuitive correlation is found between the performance improvements by hyper-parameter domain adaptation and the relative utterance length ratio between the source and target domain data."
}