{
    "title": "KuaiSAR: A Unified Search And Recommendation Dataset. (arXiv:2306.07705v1 [cs.IR])",
    "abstract": "The confluence of Search and Recommendation services is a vital aspect of online content platforms like Kuaishou and TikTok. The integration of S&R modeling is a highly intuitive approach adopted by industry practitioners. However, there is a noticeable lack of research conducted in this area within the academia, primarily due to the absence of publicly available datasets. Consequently, a substantial gap has emerged between academia and industry regarding research endeavors in this field. To bridge this gap, we introduce the first large-scale, real-world dataset KuaiSAR of integrated Search And Recommendation behaviors collected from Kuaishou, a leading short-video app in China with over 300 million daily active users. Previous research in this field has predominantly employed publicly available datasets that are semi-synthetic and simulated, with artificially fabricated search behaviors. Distinct from previous datasets, KuaiSAR records genuine user behaviors, the occurrence of each in",
    "link": "http://arxiv.org/abs/2306.07705",
    "context": "Title: KuaiSAR: A Unified Search And Recommendation Dataset. (arXiv:2306.07705v1 [cs.IR])\nAbstract: The confluence of Search and Recommendation services is a vital aspect of online content platforms like Kuaishou and TikTok. The integration of S&R modeling is a highly intuitive approach adopted by industry practitioners. However, there is a noticeable lack of research conducted in this area within the academia, primarily due to the absence of publicly available datasets. Consequently, a substantial gap has emerged between academia and industry regarding research endeavors in this field. To bridge this gap, we introduce the first large-scale, real-world dataset KuaiSAR of integrated Search And Recommendation behaviors collected from Kuaishou, a leading short-video app in China with over 300 million daily active users. Previous research in this field has predominantly employed publicly available datasets that are semi-synthetic and simulated, with artificially fabricated search behaviors. Distinct from previous datasets, KuaiSAR records genuine user behaviors, the occurrence of each in",
    "path": "papers/23/06/2306.07705.json",
    "total_tokens": 813,
    "translated_title": "KuaiSAR: 一份统一的搜索与推荐数据集",
    "translated_abstract": "搜索和推荐服务的融合是像快手和抖音这样的在线内容平台的重要方面。S&R建模的整合是业界实践者采用的高度直观的方法。然而，由于缺乏公开可用的数据集，学术界在这个领域中进行的研究明显不足。因此，在学术界和产业界之间在这个领域进行研究的实践之间出现了实质性的差距。为了弥合这个差距，我们介绍了快手的一个领先短视频应用程序收集的集成搜索与推荐行为的大规模真实世界数据集KuaiSAR。与以前的数据集不同，KuaiSAR记录了真实用户的行为，每个行为的发生时间都被精确记录了。",
    "tldr": "这篇论文介绍了一份大规模、真实的数据集KuaiSAR，该数据集记录了快手短视频应用程序中真实的集成搜索和推荐行为。",
    "en_tdlr": "This paper introduces KuaiSAR, a large-scale and real-world dataset of integrated search and recommendation behaviors collected from Kuaishou, a leading short-video app in China, aiming to bridge the gap between academia and industry research in this field."
}