{
    "title": "Unsupervised clustering of disturbances in power systems via deep convolutional autoencoders. (arXiv:2306.06124v1 [eess.SP])",
    "abstract": "Power quality (PQ) events are recorded by PQ meters whenever anomalous events are detected on the power grid. Using neural networks with machine learning can aid in accurately classifying the recorded waveforms and help power system engineers diagnose and rectify the root causes of problems. However, many of the waveforms captured during a disturbance in the power system need to be labeled for supervised learning, leaving a large number of data recordings for engineers to process manually or go unseen. This paper presents an autoencoder and K-means clustering-based unsupervised technique that can be used to cluster PQ events into categories like sag, interruption, transients, normal, and harmonic distortion to enable filtering of anomalous waveforms from recurring or normal waveforms. The method is demonstrated using three-phase, field-obtained voltage waveforms recorded in a distribution grid. First, a convolutional autoencoder compresses the input signals into a set of lower feature ",
    "link": "http://arxiv.org/abs/2306.06124",
    "context": "Title: Unsupervised clustering of disturbances in power systems via deep convolutional autoencoders. (arXiv:2306.06124v1 [eess.SP])\nAbstract: Power quality (PQ) events are recorded by PQ meters whenever anomalous events are detected on the power grid. Using neural networks with machine learning can aid in accurately classifying the recorded waveforms and help power system engineers diagnose and rectify the root causes of problems. However, many of the waveforms captured during a disturbance in the power system need to be labeled for supervised learning, leaving a large number of data recordings for engineers to process manually or go unseen. This paper presents an autoencoder and K-means clustering-based unsupervised technique that can be used to cluster PQ events into categories like sag, interruption, transients, normal, and harmonic distortion to enable filtering of anomalous waveforms from recurring or normal waveforms. The method is demonstrated using three-phase, field-obtained voltage waveforms recorded in a distribution grid. First, a convolutional autoencoder compresses the input signals into a set of lower feature ",
    "path": "papers/23/06/2306.06124.json",
    "total_tokens": 926,
    "translated_title": "基于深度卷积自编码器的电力系统干扰无监督聚类方法",
    "translated_abstract": "当电网检测到异常事件时，电力质量(PQ)仪器会记录PQ事件。使用机器学习的神经网络可以帮助准确分类记录的波形并帮助电力系统工程师诊断和纠正问题的根本原因。然而，在电力系统干扰期间捕获的许多波形需要进行标记以进行监督学习，使工程师需要手动处理或未看到大量数据记录。本文提出了一种基于自编码器和K-means聚类的无监督技术，可将PQ事件聚类为涉及电压下降、中断、瞬态、正常和谐波畸变等类别，从而实现过滤异常波形和常规波形。该方法利用在分布网格中记录的三相场获得的电压波形进行演示。首先，卷积自编码器将输入信号压缩为一组较低特征。",
    "tldr": "本文提出了一种基于卷积自编码器和K-means聚类的无监督分类方法，可将电力系统中的干扰波形聚类为涉及电压下降、中断、瞬态、正常和谐波畸变等类别，从而实现过滤异常波形和常规波形。"
}