{
    "title": "Multi-objective Molecular Optimization for Opioid Use Disorder Treatment Using Generative Network Complex. (arXiv:2306.07484v1 [cs.LG])",
    "abstract": "Opioid Use Disorder (OUD) has emerged as a significant global public health issue, with complex multifaceted conditions. Due to the lack of effective treatment options for various conditions, there is a pressing need for the discovery of new medications. In this study, we propose a deep generative model that combines a stochastic differential equation (SDE)-based diffusion modeling with the latent space of a pretrained autoencoder model. The molecular generator enables efficient generation of molecules that are effective on multiple targets, specifically the mu, kappa, and delta opioid receptors. Furthermore, we assess the ADMET (absorption, distribution, metabolism, excretion, and toxicity) properties of the generated molecules to identify drug-like compounds. To enhance the pharmacokinetic properties of some lead compounds, we employ a molecular optimization approach. We obtain a diverse set of drug-like molecules. We construct binding affinity predictors by integrating molecular fin",
    "link": "http://arxiv.org/abs/2306.07484",
    "context": "Title: Multi-objective Molecular Optimization for Opioid Use Disorder Treatment Using Generative Network Complex. (arXiv:2306.07484v1 [cs.LG])\nAbstract: Opioid Use Disorder (OUD) has emerged as a significant global public health issue, with complex multifaceted conditions. Due to the lack of effective treatment options for various conditions, there is a pressing need for the discovery of new medications. In this study, we propose a deep generative model that combines a stochastic differential equation (SDE)-based diffusion modeling with the latent space of a pretrained autoencoder model. The molecular generator enables efficient generation of molecules that are effective on multiple targets, specifically the mu, kappa, and delta opioid receptors. Furthermore, we assess the ADMET (absorption, distribution, metabolism, excretion, and toxicity) properties of the generated molecules to identify drug-like compounds. To enhance the pharmacokinetic properties of some lead compounds, we employ a molecular optimization approach. We obtain a diverse set of drug-like molecules. We construct binding affinity predictors by integrating molecular fin",
    "path": "papers/23/06/2306.07484.json",
    "total_tokens": 889,
    "translated_title": "使用生成网络复杂体进行多目标分子优化的阿片类药物滥用障碍治疗",
    "translated_abstract": "阿片类药物滥用障碍（OUD）已成为一个复杂多面的全球公共卫生问题。由于缺乏对各种情况有效的治疗选择，因此迫切需要发现新的药物。本研究提出了一种深度生成模型，将基于随机微分方程（SDE）的扩散建模与预先训练的自动编码器模型的潜在空间相结合。分子生成器能够高效地生成对多个靶点有效的分子，具体包括μ、κ和δ阿片受体。此外，我们评估了生成分子的吸收、分布、代谢、排泄和毒性（ADMET）属性，以确定药物样化合物。为增强某些前导化合物的药代动力学特性，我们采用分子优化方法。我们获得了一组多样的药物样化合物。我们通过将分子细化和拟合，构建了结合亲和力预测器。",
    "tldr": "本研究提出了一种深度生成模型，能够高效地生成对多个靶点有效的分子（包括μ、κ和δ阿片受体），并且已经构建了结合亲和力预测器。",
    "en_tdlr": "This study proposes a deep generative model that efficiently generates molecules effective on multiple targets (including mu, kappa, and delta opioid receptors) and constructs binding affinity predictors."
}