{
    "title": "Network-based Representations and Dynamic Discrete Choice Models for Multiple Discrete Choice Analysis. (arXiv:2306.04606v1 [econ.EM])",
    "abstract": "In many choice modeling applications, people demand is frequently characterized as multiple discrete, which means that people choose multiple items simultaneously. The analysis and prediction of people behavior in multiple discrete choice situations pose several challenges. In this paper, to address this, we propose a random utility maximization (RUM) based model that considers each subset of choice alternatives as a composite alternative, where individuals choose a subset according to the RUM framework. While this approach offers a natural and intuitive modeling approach for multiple-choice analysis, the large number of subsets of choices in the formulation makes its estimation and application intractable. To overcome this challenge, we introduce directed acyclic graph (DAG) based representations of choices where each node of the DAG is associated with an elemental alternative and additional information such that the number of selected elemental alternatives. Our innovation is to show",
    "link": "http://arxiv.org/abs/2306.04606",
    "context": "Title: Network-based Representations and Dynamic Discrete Choice Models for Multiple Discrete Choice Analysis. (arXiv:2306.04606v1 [econ.EM])\nAbstract: In many choice modeling applications, people demand is frequently characterized as multiple discrete, which means that people choose multiple items simultaneously. The analysis and prediction of people behavior in multiple discrete choice situations pose several challenges. In this paper, to address this, we propose a random utility maximization (RUM) based model that considers each subset of choice alternatives as a composite alternative, where individuals choose a subset according to the RUM framework. While this approach offers a natural and intuitive modeling approach for multiple-choice analysis, the large number of subsets of choices in the formulation makes its estimation and application intractable. To overcome this challenge, we introduce directed acyclic graph (DAG) based representations of choices where each node of the DAG is associated with an elemental alternative and additional information such that the number of selected elemental alternatives. Our innovation is to show",
    "path": "papers/23/06/2306.04606.json",
    "total_tokens": 968,
    "translated_title": "基于网络表示的动态离散选择模型用于多重离散选择分析",
    "translated_abstract": "在许多选择建模应用中，人们的需求通常被描述为多重离散，这意味着人们同时选择多个项目。在多重离散选择情况下，对人们行为进行分析和预测面临着几个挑战。为了解决这个问题，本文提出了一种基于随机效用最大化（RUM）的模型，将每个选择替代集合视为复合替代集合，其中个体根据RUM框架选择一个子集。虽然这种方法为多重选择分析提供了一种自然和直观的建模方法，但是制定中选择替代集合的数量众多，使得其估计和应用难以处理。为了克服这个挑战，我们引入了基于有向无环图（DAG）的选择表示，使得DAG的每个节点都与一个基本备选方案以及额外信息相关联，比如所选择的基本备选方案数量。我们的创新在于展示了这些基于DAG表示的方法如何用于减少估计模型所需的参数数量，以及如何与动态离散选择模型相结合，以捕捉人们选择中的时间依赖性。",
    "tldr": "本文提出了通过基于网络表示的动态离散选择模型进行多重离散选择分析的方法，通过引入基于DAG的选择表示来减少模型参数数量，并捕捉人们在选择中的时间依赖性。",
    "en_tdlr": "This paper proposes a network-based dynamic discrete choice model for multiple discrete choice analysis, which reduces the number of parameters needed to estimate the model by introducing DAG-based representations of choices, and captures the temporal dependencies in people's choices."
}