{
    "title": "From structure mining to unsupervised exploration of atomic octahedral networks. (arXiv:2306.12272v1 [cond-mat.mtrl-sci])",
    "abstract": "Networks of atom-centered coordination octahedra commonly occur in inorganic and hybrid solid-state materials. Characterizing their spatial arrangements and characteristics is crucial for relating structures to properties for many materials families. The traditional method using case-by-case inspection becomes prohibitive for discovering trends and similarities in large datasets. Here, we operationalize chemical intuition to automate the geometric parsing, quantification, and classification of coordination octahedral networks. We find axis-resolved tilting trends in ABO$_{3}$ perovskite polymorphs, which assist in detecting oxidation state changes. Moreover, we develop a scale-invariant encoding scheme to represent these networks, which, combined with human-assisted unsupervised machine learning, allows us to taxonomize the inorganic framework polytypes in hybrid iodoplumbates (A$_x$Pb$_y$I$_z$). Consequently, we uncover a violation of Pauling's third rule and the design principles und",
    "link": "http://arxiv.org/abs/2306.12272",
    "context": "Title: From structure mining to unsupervised exploration of atomic octahedral networks. (arXiv:2306.12272v1 [cond-mat.mtrl-sci])\nAbstract: Networks of atom-centered coordination octahedra commonly occur in inorganic and hybrid solid-state materials. Characterizing their spatial arrangements and characteristics is crucial for relating structures to properties for many materials families. The traditional method using case-by-case inspection becomes prohibitive for discovering trends and similarities in large datasets. Here, we operationalize chemical intuition to automate the geometric parsing, quantification, and classification of coordination octahedral networks. We find axis-resolved tilting trends in ABO$_{3}$ perovskite polymorphs, which assist in detecting oxidation state changes. Moreover, we develop a scale-invariant encoding scheme to represent these networks, which, combined with human-assisted unsupervised machine learning, allows us to taxonomize the inorganic framework polytypes in hybrid iodoplumbates (A$_x$Pb$_y$I$_z$). Consequently, we uncover a violation of Pauling's third rule and the design principles und",
    "path": "papers/23/06/2306.12272.json",
    "total_tokens": 1009,
    "translated_title": "从结构挖掘到无监督探索八面体原子网络",
    "translated_abstract": "原子中心的配位八面体网络通常出现在无机和混合固态材料中。表征它们的空间排列和特性对于许多材料系列将结构与性质联系起来至关重要。传统的逐案例检查方法在发现大型数据集中的趋势和相似之处方面变得不可行。在这里，我们运用化学直觉自动化地进行几何解析、量化和分类配位八面体网络。我们在ABO$_{3}$钙钛矿多形体系中发现了轴向倾斜趋势，有助于检测氧化态变化。此外，我们开发了一个尺度不变的编码方案来表示这些网络，并与人类辅助的无监督机器学习相结合，可以对混合碘铅酸盐(A$_x$Pb$_y$I$_z$)中的无机框架聚型进行分类。因此，我们揭示了Pauling的第三条规则违反和设计原则ereotype0的更新。",
    "tldr": "该论文提出了一种自动化的化学直觉算法，可以对配位八面体网络进行几何解析、量化和分类，并利用无监督机器学习对无机框架聚型进行分类。作者发现了ABO$_{3}$钙钛矿多形体系中的轴向倾斜趋势，并揭示了Pauling的第三条规则违反和设计原则的更新。",
    "en_tdlr": "The paper proposes an automated chemical intuition algorithm for geometric parsing, quantification, and classification of coordination octahedral networks. The findings include axis-resolved tilting trends in ABO$_{3}$ perovskite polymorphs, and a violation of Pauling's third rule and an updated design principle stereotype0 for framework classification in hybrid iodoplumbates (A$_x$Pb$_y$I$_z$) using unsupervised machine learning."
}