{
    "title": "Multi-Fidelity Multi-Armed Bandits Revisited. (arXiv:2306.07761v1 [cs.LG])",
    "abstract": "We study the multi-fidelity multi-armed bandit (MF-MAB), an extension of the canonical multi-armed bandit (MAB) problem. MF-MAB allows each arm to be pulled with different costs (fidelities) and observation accuracy. We study both the best arm identification with fixed confidence (BAI) and the regret minimization objectives. For BAI, we present (a) a cost complexity lower bound, (b) an algorithmic framework with two alternative fidelity selection procedures, and (c) both procedures' cost complexity upper bounds. From both cost complexity bounds of MF-MAB, one can recover the standard sample complexity bounds of the classic (single-fidelity) MAB. For regret minimization of MF-MAB, we propose a new regret definition, prove its problem-independent regret lower bound $\\Omega(K^{1/3}\\Lambda^{2/3})$ and problem-dependent lower bound $\\Omega(K\\log \\Lambda)$, where $K$ is the number of arms and $\\Lambda$ is the decision budget in terms of cost, and devise an elimination-based algorithm whose w",
    "link": "http://arxiv.org/abs/2306.07761",
    "context": "Title: Multi-Fidelity Multi-Armed Bandits Revisited. (arXiv:2306.07761v1 [cs.LG])\nAbstract: We study the multi-fidelity multi-armed bandit (MF-MAB), an extension of the canonical multi-armed bandit (MAB) problem. MF-MAB allows each arm to be pulled with different costs (fidelities) and observation accuracy. We study both the best arm identification with fixed confidence (BAI) and the regret minimization objectives. For BAI, we present (a) a cost complexity lower bound, (b) an algorithmic framework with two alternative fidelity selection procedures, and (c) both procedures' cost complexity upper bounds. From both cost complexity bounds of MF-MAB, one can recover the standard sample complexity bounds of the classic (single-fidelity) MAB. For regret minimization of MF-MAB, we propose a new regret definition, prove its problem-independent regret lower bound $\\Omega(K^{1/3}\\Lambda^{2/3})$ and problem-dependent lower bound $\\Omega(K\\log \\Lambda)$, where $K$ is the number of arms and $\\Lambda$ is the decision budget in terms of cost, and devise an elimination-based algorithm whose w",
    "path": "papers/23/06/2306.07761.json",
    "total_tokens": 1020,
    "translated_title": "多保真度多臂赌博机的再探讨",
    "translated_abstract": "我们研究了经典多臂赌博机问题的扩展——多保真度多臂赌博机(MF-MAB)。MF-MAB允许每个臂根据不同的代价(保真度)和观测精度来进行拉动。我们研究了最佳臂识别以及遗憾最小化两个目标。对于最佳臂识别，我们提出了以下内容：(a)代价复杂度下界，(b)两种不同保真度选择方法的算法框架，(c)两种方法的代价复杂度上界。由MF-MAB的这两个代价复杂度下界可以恢复经典（单保真度）MAB的标准样本复杂度下界。对于MF-MAB的遗憾最小化问题，我们提出了一种新的遗憾定义，证明了它的问题无关的遗憾下界为$\\Omega(K^{1/3}\\Lambda^{2/3})​$和问题相关的下界$\\Omega(K\\log \\Lambda)​$，其中$K$是臂数，$\\Lambda$是以代价为单位的决策预算，还提出了一种基于淘汰的算法，其权衡了不同的代价组合。",
    "tldr": "该论文研究了多保真度多臂赌博机问题，提出了算法框架，并进一步研究了保真度选择的代价复杂度上下界，还提出了一种新的遗憾定义并证明了相应的问题无关和问题相关下界。",
    "en_tdlr": "This paper studies the multi-fidelity multi-armed bandit (MF-MAB) problem, presents an algorithmic framework and studies the cost complexity upper and lower bounds of fidelity selection. A new regret definition is proposed and corresponding problem-independent and problem-dependent lower bounds are proved. An elimination-based algorithm is devised to balance different fidelity combinations."
}