{
    "title": "A generative artificial intelligence framework based on a molecular diffusion model for the design of metal-organic frameworks for carbon capture",
    "abstract": "arXiv:2306.08695v2 Announce Type: replace-cross  Abstract: Metal-organic frameworks (MOFs) exhibit great promise for CO2 capture. However, finding the best performing materials poses computational and experimental grand challenges in view of the vast chemical space of potential building blocks. Here, we introduce GHP-MOFassemble, a generative artificial intelligence (AI), high performance framework for the rational and accelerated design of MOFs with high CO2 adsorption capacity and synthesizable linkers. GHP-MOFassemble generates novel linkers, assembled with one of three pre-selected metal nodes (Cu paddlewheel, Zn paddlewheel, Zn tetramer) into MOFs in a primitive cubic topology. GHP-MOFassemble screens and validates AI-generated MOFs for uniqueness, synthesizability, structural validity, uses molecular dynamics simulations to study their stability and chemical consistency, and crystal graph neural networks and Grand Canonical Monte Carlo simulations to quantify their CO2 adsorption",
    "link": "https://arxiv.org/abs/2306.08695",
    "context": "Title: A generative artificial intelligence framework based on a molecular diffusion model for the design of metal-organic frameworks for carbon capture\nAbstract: arXiv:2306.08695v2 Announce Type: replace-cross  Abstract: Metal-organic frameworks (MOFs) exhibit great promise for CO2 capture. However, finding the best performing materials poses computational and experimental grand challenges in view of the vast chemical space of potential building blocks. Here, we introduce GHP-MOFassemble, a generative artificial intelligence (AI), high performance framework for the rational and accelerated design of MOFs with high CO2 adsorption capacity and synthesizable linkers. GHP-MOFassemble generates novel linkers, assembled with one of three pre-selected metal nodes (Cu paddlewheel, Zn paddlewheel, Zn tetramer) into MOFs in a primitive cubic topology. GHP-MOFassemble screens and validates AI-generated MOFs for uniqueness, synthesizability, structural validity, uses molecular dynamics simulations to study their stability and chemical consistency, and crystal graph neural networks and Grand Canonical Monte Carlo simulations to quantify their CO2 adsorption",
    "path": "papers/23/06/2306.08695.json",
    "total_tokens": 988,
    "translated_title": "基于分子扩散模型的用于碳捕获的金属有机框架设计的生成人工智能框架",
    "translated_abstract": "金属有机框架（MOFs）对CO2捕获具有巨大潜力。然而，在广阔的潜在构建块的化学空间中找到性能最佳的材料在计算和实验上存在巨大挑战。在这里，我们引入了GHP-MOFassemble，这是一个用于合理和加速设计具有高CO2吸附能力和可合成连接剂的MOFs的生成人工智能（AI），高性能框架。GHP-MOFassemble生成新颖的连接剂，并与三种预选金属节点（铜桨轮，锌桨轮，锌四聚体）中的一个组装成具有原始立方拓扑结构的MOFs。GHP-MOFassemble通过分子动力学模拟研究其稳定性和化学一致性，晶体图神经网络和大规模巧合蒙特卡洛模拟来量化其CO2吸附，并对AI生成的MOFs进行筛选和验证，以确保其独特性、可合成性和结构有效性。",
    "tldr": "GHP-MOFassemble是一个生成人工智能框架，用于合理和加速设计具有高CO2吸附能力和可合成连接剂的MOFs，通过生成新颖连接剂并与预选金属节点组装成MOFs，在研究其稳定性、化学一致性和CO2吸附量方面展现出独特性和前景。",
    "en_tdlr": "GHP-MOFassemble is a generative artificial intelligence framework for the rational and accelerated design of MOFs with high CO2 adsorption capacity and synthesizable linkers, demonstrating uniqueness and potential by generating novel linkers and assembling them with pre-selected metal nodes into MOFs, and studying their stability, chemical consistency, and CO2 adsorption."
}