{
    "title": "Data driven localized wave solution of the Fokas-Lenells equation using modified PINN. (arXiv:2306.03105v1 [nlin.PS])",
    "abstract": "We investigate data driven localized wave solutions of the Fokas-Lenells equation by using physics informed neural network(PINN). We improve basic PINN by incorporating control parameters into the residual loss function. We also add conserve quantity as another loss term to modify the PINN. Using modified PINN we obtain the data driven bright soliton and dark soliton solutions of Fokas-Lenells equation. Conserved quantities informed loss function achieve more accuracy in terms of relative L2 error between predicted and exact soliton solutions. We hope that the present investigation would be useful to study the applications of deep learning in nonlinear optics and other branches of nonlinear physics. Source codes are available at https://github.com/gautamksaharia/Fokas-Lenells",
    "link": "http://arxiv.org/abs/2306.03105",
    "context": "Title: Data driven localized wave solution of the Fokas-Lenells equation using modified PINN. (arXiv:2306.03105v1 [nlin.PS])\nAbstract: We investigate data driven localized wave solutions of the Fokas-Lenells equation by using physics informed neural network(PINN). We improve basic PINN by incorporating control parameters into the residual loss function. We also add conserve quantity as another loss term to modify the PINN. Using modified PINN we obtain the data driven bright soliton and dark soliton solutions of Fokas-Lenells equation. Conserved quantities informed loss function achieve more accuracy in terms of relative L2 error between predicted and exact soliton solutions. We hope that the present investigation would be useful to study the applications of deep learning in nonlinear optics and other branches of nonlinear physics. Source codes are available at https://github.com/gautamksaharia/Fokas-Lenells",
    "path": "papers/23/06/2306.03105.json",
    "total_tokens": 825,
    "translated_title": "使用改进的PINN方法基于数据驱动的局域波解决Fokas-Lenells方程",
    "translated_abstract": "本文利用物理信息神经网络(PINN)研究了Fokas-Lenells方程的数据驱动局域波解。我们通过在残差损失函数中引入控制参数来改进基本的PINN，并添加守恒量作为另一个损失项以修改PINN。使用改进的PINN，我们获得了Fokas-Lenells方程的数据驱动的明暗孤子解。守恒量信息的损失函数在预测和精确孤子解之间的相对L2误差方面实现更高的准确性。我们希望本研究对于研究在非线性光学和其他非线性物理学领域中深度学习的应用有用。源代码可在https://github.com/gautamksaharia/Fokas-Lenells获得。",
    "tldr": "本研究利用改进的PINN方法基于数据，成功获得了Fokas-Lenells方程中的明暗孤子解，并提出使用守恒量信息的损失函数可以提高预测和精确解的准确性。",
    "en_tdlr": "This study successfully obtained bright and dark soliton solutions in the Fokas-Lenells equation using an improved physics informed neural network (PINN) based on data, and proposes that using a loss function with conserved quantities information can improve the accuracy between predicted and exact solutions."
}