{
    "title": "U-TOE: Universal TinyML On-board Evaluation Toolkit for Low-Power IoT. (arXiv:2306.14574v2 [cs.LG] UPDATED)",
    "abstract": "Results from the TinyML community demonstrate that, it is possible to execute machine learning models directly on the terminals themselves, even if these are small microcontroller-based devices. However, to date, practitioners in the domain lack convenient all-in-one toolkits to help them evaluate the feasibility of executing arbitrary models on arbitrary low-power IoT hardware. To this effect, we present in this paper U-TOE, a universal toolkit we designed to facilitate the task of IoT designers and researchers, by combining functionalities from a low-power embedded OS, a generic model transpiler and compiler, an integrated performance measurement module, and an open-access remote IoT testbed. We provide an open source implementation of U-TOE and we demonstrate its use to experimentally evaluate the performance of various models, on a wide variety of low-power IoT boards, based on popular microcontroller architectures. U-TOE allows easily reproducible and customizable comparative eval",
    "link": "http://arxiv.org/abs/2306.14574",
    "context": "Title: U-TOE: Universal TinyML On-board Evaluation Toolkit for Low-Power IoT. (arXiv:2306.14574v2 [cs.LG] UPDATED)\nAbstract: Results from the TinyML community demonstrate that, it is possible to execute machine learning models directly on the terminals themselves, even if these are small microcontroller-based devices. However, to date, practitioners in the domain lack convenient all-in-one toolkits to help them evaluate the feasibility of executing arbitrary models on arbitrary low-power IoT hardware. To this effect, we present in this paper U-TOE, a universal toolkit we designed to facilitate the task of IoT designers and researchers, by combining functionalities from a low-power embedded OS, a generic model transpiler and compiler, an integrated performance measurement module, and an open-access remote IoT testbed. We provide an open source implementation of U-TOE and we demonstrate its use to experimentally evaluate the performance of various models, on a wide variety of low-power IoT boards, based on popular microcontroller architectures. U-TOE allows easily reproducible and customizable comparative eval",
    "path": "papers/23/06/2306.14574.json",
    "total_tokens": 901,
    "translated_title": "U-TOE: 低功耗物联网通用TinyML局部评估工具包",
    "translated_abstract": "TinyML社区的结果表明，即使是小型基于微控制器的设备，也可以直接在终端上执行机器学习模型。然而，到目前为止，该领域的从业者缺乏便捷的一体化工具包，帮助他们评估在任意低功耗物联网硬件上执行任意模型的可行性。为此，我们在本文中提出了U-TOE，这是一个通用工具包，我们设计它来简化物联网设计师和研究人员的工作，它结合了低功耗嵌入式操作系统、通用模型转换器和编译器、集成性能测量模块和开放式远程物联网测试平台的功能。我们提供了U-TOE的开源实现，并演示了其在各种基于流行微控制器架构的低功耗物联网板上实验评估各种模型性能的用途。U-TOE可实现易于复现和可定制的比较评估。",
    "tldr": "U-TOE是一个通用的低功耗物联网TinyML局部评估工具包，结合了低功耗嵌入式操作系统、模型转换器和编译器、性能测量模块和远程物联网测试平台的功能。能够帮助物联网设计师和研究人员评估在低功耗物联网硬件上执行各种模型的可行性。"
}