{
    "title": "Robust Time-inconsistent Linear-Quadratic Stochastic Controls: A Stochastic Differential Game Approach. (arXiv:2306.16982v1 [math.OC])",
    "abstract": "This paper studies robust time-inconsistent (TIC) linear-quadratic stochastic control problems, formulated by stochastic differential games. By a spike variation approach, we derive sufficient conditions for achieving the Nash equilibrium, which corresponds to a time-consistent (TC) robust policy, under mild technical assumptions. To illustrate our framework, we consider two scenarios of robust mean-variance analysis, namely with state- and control-dependent ambiguity aversion. We find numerically that with time inconsistency haunting the dynamic optimal controls, the ambiguity aversion enhances the effective risk aversion faster than the linear, implying that the ambiguity in the TIC cases is more impactful than that under the TC counterparts, e.g., expected utility maximization problems.",
    "link": "http://arxiv.org/abs/2306.16982",
    "context": "Title: Robust Time-inconsistent Linear-Quadratic Stochastic Controls: A Stochastic Differential Game Approach. (arXiv:2306.16982v1 [math.OC])\nAbstract: This paper studies robust time-inconsistent (TIC) linear-quadratic stochastic control problems, formulated by stochastic differential games. By a spike variation approach, we derive sufficient conditions for achieving the Nash equilibrium, which corresponds to a time-consistent (TC) robust policy, under mild technical assumptions. To illustrate our framework, we consider two scenarios of robust mean-variance analysis, namely with state- and control-dependent ambiguity aversion. We find numerically that with time inconsistency haunting the dynamic optimal controls, the ambiguity aversion enhances the effective risk aversion faster than the linear, implying that the ambiguity in the TIC cases is more impactful than that under the TC counterparts, e.g., expected utility maximization problems.",
    "path": "papers/23/06/2306.16982.json",
    "total_tokens": 884,
    "translated_title": "鲁棒的时间不一致性线性二次随机控制：一种随机微分博弈方法",
    "translated_abstract": "本文研究了通过随机微分博弈建立的鲁棒时间不一致性（TIC）线性二次随机控制问题。通过尖峰变异方法，我们得出实现纳什平衡的充分条件，该平衡对应于一种时间一致（TC）的鲁棒策略，在温和的技术假设下成立。为了说明我们的框架，我们考虑了两种鲁棒均值–方差分析的情景，即状态和控制依赖的模糊厌恶。我们通过数值实验发现，在时间不一致性困扰下的动态最优控制中，模糊厌恶比线性更快增强有效风险厌恶，这意味着在TIC情况下的模糊性比在TC情况下的影响更大，例如预期效用最大化问题。",
    "tldr": "本论文通过随机微分博弈方法研究了鲁棒的时间不一致性线性二次随机控制问题，并提出了实现纳什平衡的充分条件。研究结果表明，在时间不一致性情况下，模糊厌恶比线性厌恶更快增强风险厌恶。",
    "en_tdlr": "This paper investigates robust time-inconsistent linear-quadratic stochastic control problems using a stochastic differential game approach and derives sufficient conditions for achieving the Nash equilibrium. The study finds that in time-inconsistent cases, ambiguity aversion enhances risk aversion faster than linear aversion."
}