{
    "title": "Optimizing Investment Strategies with Lazy Factor and Probability Weighting: A Price Portfolio Forecasting and Mean-Variance Model with Transaction Costs Approach. (arXiv:2306.07928v1 [q-fin.PM])",
    "abstract": "Market traders often engage in the frequent transaction of volatile assets to optimize their total return. In this study, we introduce a novel investment strategy model, anchored on the 'lazy factor.' Our approach bifurcates into a Price Portfolio Forecasting Model and a Mean-Variance Model with Transaction Costs, utilizing probability weights as the coefficients of laziness factors. The Price Portfolio Forecasting Model, leveraging the EXPMA Mean Method, plots the long-term price trend line and forecasts future price movements, incorporating the tangent slope and rate of change. For short-term investments, we apply the ARIMA Model to predict ensuing prices. The Mean-Variance Model with Transaction Costs employs the Monte Carlo Method to formulate the feasible region. To strike an optimal balance between risk and return, equal probability weights are incorporated as coefficients of the laziness factor. To assess the efficacy of this combined strategy, we executed extensive experiments ",
    "link": "http://arxiv.org/abs/2306.07928",
    "context": "Title: Optimizing Investment Strategies with Lazy Factor and Probability Weighting: A Price Portfolio Forecasting and Mean-Variance Model with Transaction Costs Approach. (arXiv:2306.07928v1 [q-fin.PM])\nAbstract: Market traders often engage in the frequent transaction of volatile assets to optimize their total return. In this study, we introduce a novel investment strategy model, anchored on the 'lazy factor.' Our approach bifurcates into a Price Portfolio Forecasting Model and a Mean-Variance Model with Transaction Costs, utilizing probability weights as the coefficients of laziness factors. The Price Portfolio Forecasting Model, leveraging the EXPMA Mean Method, plots the long-term price trend line and forecasts future price movements, incorporating the tangent slope and rate of change. For short-term investments, we apply the ARIMA Model to predict ensuing prices. The Mean-Variance Model with Transaction Costs employs the Monte Carlo Method to formulate the feasible region. To strike an optimal balance between risk and return, equal probability weights are incorporated as coefficients of the laziness factor. To assess the efficacy of this combined strategy, we executed extensive experiments ",
    "path": "papers/23/06/2306.07928.json",
    "total_tokens": 763,
    "translated_title": "带有概率加权的“懒惰因子”的优化投资策略：结合交易成本的价格组合预测和均值方差模型方法",
    "translated_abstract": "市场交易员常常通过频繁交易波动性资产来优化他们的总回报。本研究提出了一种新的投资策略模型，基于“懒惰因子”。我们的方法分为价格组合预测模型和结合交易成本的均值方差模型。通过概率加权作为懒惰因子的系数，实现了在风险和回报之间达到最优平衡。",
    "tldr": "本论文提出了一种使用“懒惰因子”和概率加权来优化投资策略的模型。通过价格组合预测和均值方差模型方法，实现投资风险与回报之间的最优平衡。"
}