{
    "title": "Assessing the Performance of 1D-Convolution Neural Networks to Predict Concentration of Mixture Components from Raman Spectra. (arXiv:2306.16621v1 [eess.SP])",
    "abstract": "An emerging application of Raman spectroscopy is monitoring the state of chemical reactors during biologic drug production. Raman shift intensities scale linearly with the concentrations of chemical species and thus can be used to analytically determine real-time concentrations using non-destructive light irradiation in a label-free manner. Chemometric algorithms are used to interpret Raman spectra produced from complex mixtures of bioreactor contents as a reaction evolves. Finding the optimal algorithm for a specific bioreactor environment is challenging due to the lack of freely available Raman mixture datasets. The RaMix Python package addresses this challenge by enabling the generation of synthetic Raman mixture datasets with controllable noise levels to assess the utility of different chemometric algorithm types for real-time monitoring applications. To demonstrate the capabilities of this package and compare the performance of different chemometric algorithms, 48 datasets of simu",
    "link": "http://arxiv.org/abs/2306.16621",
    "context": "Title: Assessing the Performance of 1D-Convolution Neural Networks to Predict Concentration of Mixture Components from Raman Spectra. (arXiv:2306.16621v1 [eess.SP])\nAbstract: An emerging application of Raman spectroscopy is monitoring the state of chemical reactors during biologic drug production. Raman shift intensities scale linearly with the concentrations of chemical species and thus can be used to analytically determine real-time concentrations using non-destructive light irradiation in a label-free manner. Chemometric algorithms are used to interpret Raman spectra produced from complex mixtures of bioreactor contents as a reaction evolves. Finding the optimal algorithm for a specific bioreactor environment is challenging due to the lack of freely available Raman mixture datasets. The RaMix Python package addresses this challenge by enabling the generation of synthetic Raman mixture datasets with controllable noise levels to assess the utility of different chemometric algorithm types for real-time monitoring applications. To demonstrate the capabilities of this package and compare the performance of different chemometric algorithms, 48 datasets of simu",
    "path": "papers/23/06/2306.16621.json",
    "total_tokens": 957,
    "translated_title": "评估一维卷积神经网络在从拉曼光谱预测混合组分浓度上的性能",
    "translated_abstract": "拉曼光谱是监测生物药物生产过程中化学反应器状态的新兴应用。拉曼频移强度与化学物种的浓度呈线性关系，因此可以利用非破坏性的光照射以无标记的方式分析实时浓度。化学计量学算法用于解释随着反应的进展而产生的复杂混合物中的拉曼光谱。由于缺乏公开可用的拉曼混合数据集，为特定的生物反应器环境找到最佳算法是具有挑战性的。RaMix Python软件包通过生成具有可控噪声水平的合成拉曼混合数据集来评估不同化学计量学算法类型在实时监测应用中的有效性。为了展示该软件包的功能并比较不同化学计量学算法的性能，作者使用48个合成的拉曼混合数据集。",
    "tldr": "该论文介绍了一种评估1D-卷积神经网络在从拉曼光谱预测混合组分浓度方面的性能的方法，并提出了一个Python软件包RaMix，该软件包可以生成具有可控噪声水平的合成拉曼混合数据集，用于评估不同化学计量学算法在实时监测应用中的效果。",
    "en_tdlr": "This paper presents a method to assess the performance of 1D-Convolution Neural Networks in predicting the concentration of mixture components from Raman spectra. It also introduces a Python package called RaMix, which generates synthetic Raman mixture datasets with controllable noise levels for evaluating the effectiveness of different chemometric algorithms in real-time monitoring applications."
}