{
    "title": "Graph Structure and Feature Extrapolation for Out-of-Distribution Generalization. (arXiv:2306.08076v1 [cs.LG])",
    "abstract": "Out-of-distribution (OOD) generalization deals with the prevalent learning scenario where test distribution shifts from training distribution. With rising application demands and inherent complexity, graph OOD problems call for specialized solutions. While data-centric methods exhibit performance enhancements on many generic machine learning tasks, there is a notable absence of data augmentation methods tailored for graph OOD generalization. In this work, we propose to achieve graph OOD generalization with the novel design of non-Euclidean-space linear extrapolation. The proposed augmentation strategy extrapolates both structure and feature spaces to generate OOD graph data. Our design tailors OOD samples for specific shifts without corrupting underlying causal mechanisms. Theoretical analysis and empirical results evidence the effectiveness of our method in solving target shifts, showing substantial and constant improvements across various graph OOD tasks.",
    "link": "http://arxiv.org/abs/2306.08076",
    "context": "Title: Graph Structure and Feature Extrapolation for Out-of-Distribution Generalization. (arXiv:2306.08076v1 [cs.LG])\nAbstract: Out-of-distribution (OOD) generalization deals with the prevalent learning scenario where test distribution shifts from training distribution. With rising application demands and inherent complexity, graph OOD problems call for specialized solutions. While data-centric methods exhibit performance enhancements on many generic machine learning tasks, there is a notable absence of data augmentation methods tailored for graph OOD generalization. In this work, we propose to achieve graph OOD generalization with the novel design of non-Euclidean-space linear extrapolation. The proposed augmentation strategy extrapolates both structure and feature spaces to generate OOD graph data. Our design tailors OOD samples for specific shifts without corrupting underlying causal mechanisms. Theoretical analysis and empirical results evidence the effectiveness of our method in solving target shifts, showing substantial and constant improvements across various graph OOD tasks.",
    "path": "papers/23/06/2306.08076.json",
    "total_tokens": 714,
    "translated_title": "图结构和特征外推在超出分布泛化中的应用",
    "translated_abstract": "超出分布泛化涉及测试数据分布不同于训练数据分布的学习场景。本文提出一种新颖的非欧几里得空间线性外推设计，通过外推结构和特征空间来生成超出分布的图数据，从而实现图超出分布泛化。理论分析和实证结果证明了我们的方法在解决目标转移过程中的有效性，在各种图超出分布任务中都显示出了显著且持续的改进。",
    "tldr": "本文提出一种非欧几里得空间线性外推设计，通过外推结构和特征空间来生成超出分布的图数据， 然后实现图的超出分布泛化。",
    "en_tdlr": "The paper proposes a novel design of non-Euclidean-space linear extrapolation to achieve graph out-of-distribution (OOD) generalization by extrapolating both structure and feature spaces to generate OOD graph data. The proposed method shows significant and constant improvements across various graph OOD tasks."
}