{
    "title": "Surrogate Modeling of Car Drag Coefficient with Depth and Normal Renderings. (arXiv:2306.06110v1 [cs.LG])",
    "abstract": "Generative AI models have made significant progress in automating the creation of 3D shapes, which has the potential to transform car design. In engineering design and optimization, evaluating engineering metrics is crucial. To make generative models performance-aware and enable them to create high-performing designs, surrogate modeling of these metrics is necessary. However, the currently used representations of three-dimensional (3D) shapes either require extensive computational resources to learn or suffer from significant information loss, which impairs their effectiveness in surrogate modeling. To address this issue, we propose a new two-dimensional (2D) representation of 3D shapes. We develop a surrogate drag model based on this representation to verify its effectiveness in predicting 3D car drag. We construct a diverse dataset of 9,070 high-quality 3D car meshes labeled by drag coefficients computed from computational fluid dynamics (CFD) simulations to train our model. Our expe",
    "link": "http://arxiv.org/abs/2306.06110",
    "context": "Title: Surrogate Modeling of Car Drag Coefficient with Depth and Normal Renderings. (arXiv:2306.06110v1 [cs.LG])\nAbstract: Generative AI models have made significant progress in automating the creation of 3D shapes, which has the potential to transform car design. In engineering design and optimization, evaluating engineering metrics is crucial. To make generative models performance-aware and enable them to create high-performing designs, surrogate modeling of these metrics is necessary. However, the currently used representations of three-dimensional (3D) shapes either require extensive computational resources to learn or suffer from significant information loss, which impairs their effectiveness in surrogate modeling. To address this issue, we propose a new two-dimensional (2D) representation of 3D shapes. We develop a surrogate drag model based on this representation to verify its effectiveness in predicting 3D car drag. We construct a diverse dataset of 9,070 high-quality 3D car meshes labeled by drag coefficients computed from computational fluid dynamics (CFD) simulations to train our model. Our expe",
    "path": "papers/23/06/2306.06110.json",
    "total_tokens": 968,
    "translated_title": "基于深度和法向渲染的汽车阻力系数代理建模",
    "translated_abstract": "生成式人工智能模型在自动化创建三维形状方面取得了显著进展，这有可能改变汽车设计。在工程设计和优化中，评估工程指标至关重要。为了使生成模型具有性能意识并使其能够创建高性能设计，这些指标的代理建模是必要的。然而，目前使用的三维形状表示要么需要大量的计算资源来学习，要么会出现显著的信息损失，影响了它们在代理建模中的有效性。为了解决这个问题，我们提出了一种新的二维三维形状表示方法。我们基于这种表示方法开发了一个代理阻力模型，以验证它在预测三维汽车阻力方面的有效性。我们构建了一个包含9,070个高质量三维汽车网格的多样化数据集，并用计算流体力学（CFD）模拟计算的阻力系数来训练我们的模型。我们的实验结果表明，我们提出的二维表示方法比现有的三维表示更具表现力，在使用更小的模型时可以实现更好的阻力预测性能。",
    "tldr": "本论文提出了一种新的二维三维形状表示方法，用于代理建模汽车阻力系数。实验结果表明，该表示方法在阻力预测方面的性能更好，需要使用更小的模型。",
    "en_tdlr": "This paper proposes a new 2D representation of 3D shapes for surrogate modeling of car drag coefficient. Experimental results show that the proposed representation achieves better drag prediction performance with a smaller model."
}