{
    "title": "Efficient Learning of Minimax Risk Classifiers in High Dimensions. (arXiv:2306.06649v1 [stat.ML])",
    "abstract": "High-dimensional data is common in multiple areas, such as health care and genomics, where the number of features can be tens of thousands. In such scenarios, the large number of features often leads to inefficient learning. Constraint generation methods have recently enabled efficient learning of L1-regularized support vector machines (SVMs). In this paper, we leverage such methods to obtain an efficient learning algorithm for the recently proposed minimax risk classifiers (MRCs). The proposed iterative algorithm also provides a sequence of worst-case error probabilities and performs feature selection. Experiments on multiple high-dimensional datasets show that the proposed algorithm is efficient in high-dimensional scenarios. In addition, the worst-case error probability provides useful information about the classifier performance, and the features selected by the algorithm are competitive with the state-of-the-art.",
    "link": "http://arxiv.org/abs/2306.06649",
    "context": "Title: Efficient Learning of Minimax Risk Classifiers in High Dimensions. (arXiv:2306.06649v1 [stat.ML])\nAbstract: High-dimensional data is common in multiple areas, such as health care and genomics, where the number of features can be tens of thousands. In such scenarios, the large number of features often leads to inefficient learning. Constraint generation methods have recently enabled efficient learning of L1-regularized support vector machines (SVMs). In this paper, we leverage such methods to obtain an efficient learning algorithm for the recently proposed minimax risk classifiers (MRCs). The proposed iterative algorithm also provides a sequence of worst-case error probabilities and performs feature selection. Experiments on multiple high-dimensional datasets show that the proposed algorithm is efficient in high-dimensional scenarios. In addition, the worst-case error probability provides useful information about the classifier performance, and the features selected by the algorithm are competitive with the state-of-the-art.",
    "path": "papers/23/06/2306.06649.json",
    "total_tokens": 826,
    "translated_title": "高维数据上的极小化极大风险分类器的有效学习",
    "translated_abstract": "高维数据在许多领域非常普遍，比如医疗保健和基因组学，在这种情况下，特征的数量往往会导致学习效率低下。最近，约束生成方法已经使得支持向量机（SVM）的L1正则化的有效学习成为可能。本文利用这些方法获取了一种有效学习算法，用于最近提出的极小化极大风险分类器（MRC）。所提出的迭代算法还提供了一系列最坏情况下的错误概率并执行特征选择。对多个高维度数据集的实验表明，所提出的算法在高维度场景下是有效的。此外，最坏情况下的错误概率提供了关于分类器性能的有用信息，算法选择的特征也与最先进的方法相竞争。",
    "tldr": "提出了一种针对高维数据中的极小化极大风险分类器的有效学习算法，具有特征选择和提供有关分类器性能的最坏情况下的错误概率的优点。"
}