{
    "title": "Inference in Predictive Quantile Regressions. (arXiv:2306.00296v1 [econ.EM])",
    "abstract": "This paper studies inference in predictive quantile regressions when the predictive regressor has a near-unit root. We derive asymptotic distributions for the quantile regression estimator and its heteroskedasticity and autocorrelation consistent (HAC) t-statistic in terms of functionals of Ornstein-Uhlenbeck processes. We then propose a switching-fully modified (FM) predictive test for quantile predictability with persistent regressors. The proposed test employs an FM style correction with a Bonferroni bound for the local-to-unity parameter when the predictor has a near unit root. It switches to a standard predictive quantile regression test with a slightly conservative critical value when the largest root of the predictor lies in the stationary range. Simulations indicate that the test has reliable size in small samples and particularly good power when the predictor is persistent and endogenous, i.e., when the predictive regression problem is most acute. We employ this new methodolog",
    "link": "http://arxiv.org/abs/2306.00296",
    "context": "Title: Inference in Predictive Quantile Regressions. (arXiv:2306.00296v1 [econ.EM])\nAbstract: This paper studies inference in predictive quantile regressions when the predictive regressor has a near-unit root. We derive asymptotic distributions for the quantile regression estimator and its heteroskedasticity and autocorrelation consistent (HAC) t-statistic in terms of functionals of Ornstein-Uhlenbeck processes. We then propose a switching-fully modified (FM) predictive test for quantile predictability with persistent regressors. The proposed test employs an FM style correction with a Bonferroni bound for the local-to-unity parameter when the predictor has a near unit root. It switches to a standard predictive quantile regression test with a slightly conservative critical value when the largest root of the predictor lies in the stationary range. Simulations indicate that the test has reliable size in small samples and particularly good power when the predictor is persistent and endogenous, i.e., when the predictive regression problem is most acute. We employ this new methodolog",
    "path": "papers/23/06/2306.00296.json",
    "total_tokens": 949,
    "translated_title": "预测分位数回归中的推断",
    "translated_abstract": "本文研究了当预测回归变量具有近似单位根时，预测分位数回归的推断问题。我们通过奥恩斯坦-乌伦贝克过程的函数推导出了分位数回归估计量及其异方差性和自相关一致（HAC）t统计量的渐近分布。然后，我们提出了一种完全修正的预测测试方法，用于具有持续回归变量的分位预测性。当预测变量具有近似单位根时，所提出的测试采用了FM风格修正，并在局部到单位性参数上使用Bonferroni边界。当预测变量的最大根在平稳范围内时，它会切换到具有稍微保守临界值的标准预测分位数回归测试。模拟结果表明，该测试在小样本下有可靠的大小，并在预测回归问题最为严重时，即预测变量是持久性和内生性时具有很好的功效。我们采用这种新的方法论来分析一个实际的数据集。",
    "tldr": "研究当预测回归变量具有近似单位根时，预测分位数回归的推断问题, 并提出一种完全修正的预测测试方法, 在小样本下有可靠的大小，并在预测回归问题最为严重时具有很好的功效。",
    "en_tdlr": "This paper studies the inference problem of predictive quantile regressions when the predictive regressor has a near-unit root and proposes a switching-fully modified predictive test for quantile predictability. The test has reliable size in small samples and particularly good power when the predictor is persistent and endogenous."
}