{
    "title": "Diagnosis Uncertain Models For Medical Risk Prediction. (arXiv:2306.17337v1 [cs.AI])",
    "abstract": "We consider a patient risk models which has access to patient features such as vital signs, lab values, and prior history but does not have access to a patient's diagnosis. For example, this occurs in a model deployed at intake time for triage purposes. We show that such `all-cause' risk models have good generalization across diagnoses but have a predictable failure mode. When the same lab/vital/history profiles can result from diagnoses with different risk profiles (e.g. E.coli vs. MRSA) the risk estimate is a probability weighted average of these two profiles. This leads to an under-estimation of risk for rare but highly risky diagnoses. We propose a fix for this problem by explicitly modeling the uncertainty in risk prediction coming from uncertainty in patient diagnoses. This gives practitioners an interpretable way to understand patient risk beyond a single risk number.",
    "link": "http://arxiv.org/abs/2306.17337",
    "context": "Title: Diagnosis Uncertain Models For Medical Risk Prediction. (arXiv:2306.17337v1 [cs.AI])\nAbstract: We consider a patient risk models which has access to patient features such as vital signs, lab values, and prior history but does not have access to a patient's diagnosis. For example, this occurs in a model deployed at intake time for triage purposes. We show that such `all-cause' risk models have good generalization across diagnoses but have a predictable failure mode. When the same lab/vital/history profiles can result from diagnoses with different risk profiles (e.g. E.coli vs. MRSA) the risk estimate is a probability weighted average of these two profiles. This leads to an under-estimation of risk for rare but highly risky diagnoses. We propose a fix for this problem by explicitly modeling the uncertainty in risk prediction coming from uncertainty in patient diagnoses. This gives practitioners an interpretable way to understand patient risk beyond a single risk number.",
    "path": "papers/23/06/2306.17337.json",
    "total_tokens": 899,
    "translated_title": "诊断不确定模型用于医疗风险预测",
    "translated_abstract": "我们考虑了一个患者风险模型，该模型可以获得患者的生命体征、实验室指标和先前病史等特征，但无法获得患者的诊断结果。例如，在入院时用于分诊的模型中就会遇到这种情况。我们展示了这种\"全因素\"风险模型在各种诊断中具有良好的泛化能力，但存在可预测的失败模式。当相同的实验室/生命体征/病史配置可以导致具有不同风险轮廓的诊断时（例如，E.coli与MRSA），风险估计是这两个轮廓的概率加权平均值。这导致对于罕见但高风险的诊断风险的低估。我们提出了解决此问题的方法，即通过明确地模拟由患者诊断不确定性引起的风险预测的不确定性。这为临床医生提供了一种可解释的方式来理解患者的风险，而不仅仅是一个风险数值。",
    "tldr": "研究提出了一种具有诊断不确定性的医疗风险预测模型，解决了当相同的特征可以对应不同风险的诊断时风险低估的问题。",
    "en_tdlr": "The paper proposes a medical risk prediction model with diagnosis uncertainty, addressing the issue of risk underestimation when the same features can correspond to different risk profiles for diagnoses."
}