{
    "title": "Constructing Time-Series Momentum Portfolios with Deep Multi-Task Learning. (arXiv:2306.13661v1 [q-fin.CP])",
    "abstract": "A diversified risk-adjusted time-series momentum (TSMOM) portfolio can deliver substantial abnormal returns and offer some degree of tail risk protection during extreme market events. The performance of existing TSMOM strategies, however, relies not only on the quality of the momentum signal but also on the efficacy of the volatility estimator. Yet many of the existing studies have always considered these two factors to be independent. Inspired by recent progress in Multi-Task Learning (MTL), we present a new approach using MTL in a deep neural network architecture that jointly learns portfolio construction and various auxiliary tasks related to volatility, such as forecasting realized volatility as measured by different volatility estimators. Through backtesting from January 2000 to December 2020 on a diversified portfolio of continuous futures contracts, we demonstrate that even after accounting for transaction costs of up to 3 basis points, our approach outperforms existing TSMOM st",
    "link": "http://arxiv.org/abs/2306.13661",
    "context": "Title: Constructing Time-Series Momentum Portfolios with Deep Multi-Task Learning. (arXiv:2306.13661v1 [q-fin.CP])\nAbstract: A diversified risk-adjusted time-series momentum (TSMOM) portfolio can deliver substantial abnormal returns and offer some degree of tail risk protection during extreme market events. The performance of existing TSMOM strategies, however, relies not only on the quality of the momentum signal but also on the efficacy of the volatility estimator. Yet many of the existing studies have always considered these two factors to be independent. Inspired by recent progress in Multi-Task Learning (MTL), we present a new approach using MTL in a deep neural network architecture that jointly learns portfolio construction and various auxiliary tasks related to volatility, such as forecasting realized volatility as measured by different volatility estimators. Through backtesting from January 2000 to December 2020 on a diversified portfolio of continuous futures contracts, we demonstrate that even after accounting for transaction costs of up to 3 basis points, our approach outperforms existing TSMOM st",
    "path": "papers/23/06/2306.13661.json",
    "total_tokens": 909,
    "translated_abstract": "一个多样化的风险调整时间序列动量 （TSMOM）投资组合可以提供实质性的超额回报，并在极端市场事件期间提供一定程度的保护。现有TSMOM策略的表现，不仅依赖于动量信号的质量，还取决于波动率估计的效力。然而现有的研究中许多都将这两个因素视为独立的。受多任务学习（MTL）近期进展的启发，我们提出了一种新的方法，使用深度神经网络架构中的MTL，共同学习投资组合构建和与波动性有关的各种辅助任务，如根据不同波动率估计器预测实现波动率。通过对连续期货合约的多样化组合进行了2000年1月至2020年12月的回测，我们证明即使考虑到多达3个基点的交易成本，我们的方法仍然优于现有的TSMOM策略。",
    "tldr": "本文使用深层多任务学习的方式，共同学习投资组合构建和与波动性有关的各种辅助任务，如预测实现波动率，对比传统TSMOM方法，在考虑交易成本的情况下，能够达到更好的效果。",
    "en_tdlr": "This paper presents a new approach using deep multi-task learning, which jointly learns portfolio construction and various auxiliary tasks related to volatility, such as forecasting realized volatility, outperforming existing TSMOM strategies even when considering transaction costs."
}