{
    "title": "EEG Decoding for Datasets with Heterogenous Electrode Configurations using Transfer Learning Graph Neural Networks. (arXiv:2306.13109v1 [eess.SP])",
    "abstract": "Brain-Machine Interfacing (BMI) has greatly benefited from adopting machine learning methods for feature learning that require extensive data for training, which are often unavailable from a single dataset. Yet, it is difficult to combine data across labs or even data within the same lab collected over the years due to the variation in recording equipment and electrode layouts resulting in shifts in data distribution, changes in data dimensionality, and altered identity of data dimensions. Our objective is to overcome this limitation and learn from many different and diverse datasets across labs with different experimental protocols. To tackle the domain adaptation problem, we developed a novel machine learning framework combining graph neural networks (GNNs) and transfer learning methodologies for non-invasive Motor Imagery (MI) EEG decoding, as an example of BMI. Empirically, we focus on the challenges of learning from EEG data with different electrode layouts and varying numbers of ",
    "link": "http://arxiv.org/abs/2306.13109",
    "context": "Title: EEG Decoding for Datasets with Heterogenous Electrode Configurations using Transfer Learning Graph Neural Networks. (arXiv:2306.13109v1 [eess.SP])\nAbstract: Brain-Machine Interfacing (BMI) has greatly benefited from adopting machine learning methods for feature learning that require extensive data for training, which are often unavailable from a single dataset. Yet, it is difficult to combine data across labs or even data within the same lab collected over the years due to the variation in recording equipment and electrode layouts resulting in shifts in data distribution, changes in data dimensionality, and altered identity of data dimensions. Our objective is to overcome this limitation and learn from many different and diverse datasets across labs with different experimental protocols. To tackle the domain adaptation problem, we developed a novel machine learning framework combining graph neural networks (GNNs) and transfer learning methodologies for non-invasive Motor Imagery (MI) EEG decoding, as an example of BMI. Empirically, we focus on the challenges of learning from EEG data with different electrode layouts and varying numbers of ",
    "path": "papers/23/06/2306.13109.json",
    "total_tokens": 930,
    "translated_title": "使用Transfer Learning图神经网络对具有异构电极配置的数据集进行EEG Decoding",
    "translated_abstract": "脑机接口（BMI）采用机器学习方法进行特征学习受益匪浅，但这些方法需要大量的训练数据，而这些数据通常无法从单个数据集中获得。在一个实验室内甚至跨实验室合并数据变得困难，因为记录设备和电极布局的变化会导致数据分布的偏移，数据维度的变化和数据维度标识的变化。本文旨在克服这种限制，并通过不同实验室的多种不同和多样的数据集进行学习。为了解决领域适应问题，我们开发了一种结合图神经网络（GNNs）和迁移学习方法的新型机器学习框架，以非侵入性动作想象（MI）EEG解码为例。实验证明，我们重点关注从具有不同电极布局和不同数量电极的EEG数据中学习的挑战。",
    "tldr": "本文提出了一种用于克服记录设备和电极布局变化带来的限制，学习不同实验室的多样化EEG数据的方法。文中研发了一种新型机器学习框架，该框架结合了图神经网络和迁移学习方法，以实现非侵入性动作想象（MI）EEG解码。"
}