{
    "title": "BotArtist: Twitter bot detection Machine Learning model based on Twitter suspension. (arXiv:2306.00037v1 [cs.SI])",
    "abstract": "Twitter as one of the most popular social networks, offers a means for communication and online discourse, which unfortunately has been the target of bots and fake accounts, leading to the manipulation and spreading of false information. Towards this end, we gather a challenging, multilingual dataset of social discourse on Twitter, originating from 9M users regarding the recent Russo-Ukrainian war, in order to detect the bot accounts and the conversation involving them. We collect the ground truth for our dataset through the Twitter API suspended accounts collection, containing approximately 343K of bot accounts and 8M of normal users. Additionally, we use a dataset provided by Botometer-V3 with 1,777 Varol, 483 German accounts, and 1,321 US accounts. Besides the publicly available datasets, we also manage to collect 2 independent datasets around popular discussion topics of the 2022 energy crisis and the 2022 conspiracy discussions. Both of the datasets were labeled according to the T",
    "link": "http://arxiv.org/abs/2306.00037",
    "context": "Title: BotArtist: Twitter bot detection Machine Learning model based on Twitter suspension. (arXiv:2306.00037v1 [cs.SI])\nAbstract: Twitter as one of the most popular social networks, offers a means for communication and online discourse, which unfortunately has been the target of bots and fake accounts, leading to the manipulation and spreading of false information. Towards this end, we gather a challenging, multilingual dataset of social discourse on Twitter, originating from 9M users regarding the recent Russo-Ukrainian war, in order to detect the bot accounts and the conversation involving them. We collect the ground truth for our dataset through the Twitter API suspended accounts collection, containing approximately 343K of bot accounts and 8M of normal users. Additionally, we use a dataset provided by Botometer-V3 with 1,777 Varol, 483 German accounts, and 1,321 US accounts. Besides the publicly available datasets, we also manage to collect 2 independent datasets around popular discussion topics of the 2022 energy crisis and the 2022 conspiracy discussions. Both of the datasets were labeled according to the T",
    "path": "papers/23/06/2306.00037.json",
    "total_tokens": 870,
    "translated_abstract": "作为最受欢迎的社交网络之一，Twitter 提供了一种沟通和交流的方式。然而，Twitter 也成为了机器人和假账号的目标，导致了虚假消息的传播和操控。为此，我们收集了一个包含来自乌俄战争的9百万用户的具有挑战性的多语言社交话语数据集，以便检测机器人账户及其相关对话。我们使用Twitter API封禁的账户收集来确定数据集中的真实数据，其中包括大约343K个机器人账户和8M个正常账户。此外，我们还使用Botometer-V3提供的包含1,777个Varol、483个德国账户和1,321个美国账户数据集。除了公开可用的数据集，我们还收集了两个独立的数据集，在2022年流行的讨论话题——能源危机和阴谋论讨论中进行标注。",
    "tldr": "BotArtist是一种基于Twitter账号封禁情况的机器学习模型，旨在检测并区分Twitter上的机器人账号和正常账号，以防止虚假消息的传播和操纵。"
}