{
    "title": "Conceptual Design Generation Using Large Language Models. (arXiv:2306.01779v1 [cs.CL])",
    "abstract": "Concept generation is a creative step in the conceptual design phase, where designers often turn to brainstorming, mindmapping, or crowdsourcing design ideas to complement their own knowledge of the domain. Recent advances in natural language processing (NLP) and machine learning (ML) have led to the rise of Large Language Models (LLMs) capable of generating seemingly creative outputs from textual prompts. The success of these models has led to their integration and application across a variety of domains, including art, entertainment, and other creative work. In this paper, we leverage LLMs to generate solutions for a set of 12 design problems and compare them to a baseline of crowdsourced solutions. We evaluate the differences between generated and crowdsourced design solutions through multiple perspectives, including human expert evaluations and computational metrics. Expert evaluations indicate that the LLM-generated solutions have higher average feasibility and usefulness while th",
    "link": "http://arxiv.org/abs/2306.01779",
    "context": "Title: Conceptual Design Generation Using Large Language Models. (arXiv:2306.01779v1 [cs.CL])\nAbstract: Concept generation is a creative step in the conceptual design phase, where designers often turn to brainstorming, mindmapping, or crowdsourcing design ideas to complement their own knowledge of the domain. Recent advances in natural language processing (NLP) and machine learning (ML) have led to the rise of Large Language Models (LLMs) capable of generating seemingly creative outputs from textual prompts. The success of these models has led to their integration and application across a variety of domains, including art, entertainment, and other creative work. In this paper, we leverage LLMs to generate solutions for a set of 12 design problems and compare them to a baseline of crowdsourced solutions. We evaluate the differences between generated and crowdsourced design solutions through multiple perspectives, including human expert evaluations and computational metrics. Expert evaluations indicate that the LLM-generated solutions have higher average feasibility and usefulness while th",
    "path": "papers/23/06/2306.01779.json",
    "total_tokens": 897,
    "translated_title": "基于大型语言模型的概念设计生成",
    "translated_abstract": "概念生成是概念设计阶段的创造性步骤，在这个阶段中，设计师经常尝试通过头脑风暴、思维导图或众包设计思路来补充他们自己对领域的知识。自然语言处理（NLP）和机器学习（ML）的最新进展已经导致了大型语言模型（LLM）的兴起，这些模型能够从文本提示中生成看似创造性的输出。这些模型的成功应用跨足了艺术、娱乐和其他创作工作等各个领域。本文利用LLMs为一组12个设计问题生成解决方案，并将其与众包解决方案基准进行比较。我们通过多个角度评估生成和众包设计解决方案之间的差异，包括人工专家评估和计算指标。专家评估表明，LLM生成的解决方案平均可行性和有用性更高，而众包的解决方案更加具有创意性。",
    "tldr": "本文利用大型语言模型生成解决方案，并将其与众包解决方案进行比较。专家评估表明，LLM生成的解决方案具有更高的可行性和有用性，众包的解决方案更加具有创意性。",
    "en_tdlr": "This paper utilizes Large Language Models to generate solutions for a set of design problems and compares them to crowdsourced solutions. Expert evaluations indicate that the LLM-generated solutions have higher feasibility and usefulness while the crowdsourced solutions are more creative."
}