{
    "title": "Prediction of Citrus Diseases Using Machine Learning And Deep Learning: Classifier, Models SLR. (arXiv:2306.01816v1 [cs.LG])",
    "abstract": "Citrus diseases have been major issues for citrus growing worldwide for many years they can lead significantly reduce fruit quality. the most harmful citrus diseases are citrus canker, citrus greening, citrus black spot, citrus leaf miner which can have significant economic losses of citrus industry in worldwide prevention and management strategies like chemical treatments. Citrus diseases existing in all over the world where citrus is growing its effects the citrus tree root, citrus tree leaf, citrus tree orange etc. Existing of citrus diseases is highly impact on economic factor that can also produce low quality fruits and increased the rate for diseases management. Sanitation and routine monitoring can be effective in managing certain citrus diseases, but others may require more intensive treatments like chemical or biological control methods.",
    "link": "http://arxiv.org/abs/2306.01816",
    "context": "Title: Prediction of Citrus Diseases Using Machine Learning And Deep Learning: Classifier, Models SLR. (arXiv:2306.01816v1 [cs.LG])\nAbstract: Citrus diseases have been major issues for citrus growing worldwide for many years they can lead significantly reduce fruit quality. the most harmful citrus diseases are citrus canker, citrus greening, citrus black spot, citrus leaf miner which can have significant economic losses of citrus industry in worldwide prevention and management strategies like chemical treatments. Citrus diseases existing in all over the world where citrus is growing its effects the citrus tree root, citrus tree leaf, citrus tree orange etc. Existing of citrus diseases is highly impact on economic factor that can also produce low quality fruits and increased the rate for diseases management. Sanitation and routine monitoring can be effective in managing certain citrus diseases, but others may require more intensive treatments like chemical or biological control methods.",
    "path": "papers/23/06/2306.01816.json",
    "total_tokens": 880,
    "translated_title": "使用机器学习和深度学习预测柑橘病害：分类器、模型和SLR",
    "translated_abstract": "多年以来，柑橘病害一直是全球柑橘种植业的主要问题，它们会显著降低水果的质量。最危险的柑橘病害包括柑橘溃疡病、柑橘黄龙病、柑橘黑斑病、柑橘叶蛾，这些病害可导致全球柑橘产业出现显著经济损失，防治策略包括化学治疗等。柑橘病害分布在全球所有柑橘种植地区，影响柑橘树根、柑橘树叶、柑橘等水果。柑橘病害的存在对经济因素产生高度影响，同时也会产生低品质水果，增加病害管理费用。卫生和定期监测可以有效管理某些柑橘病害，但其他病害可能需要更加密集的治疗，例如化学或生物控制方法。",
    "tldr": "本文讨论了预测柑橘病害的方法，介绍了使用机器学习和深度学习的分类器和模型，并探讨了相关防治策略。",
    "en_tdlr": "This article discusses methods for predicting citrus diseases, introduces classifiers and models using machine learning and deep learning, and explores related prevention and control strategies."
}