{
    "title": "ProMIL: Probabilistic Multiple Instance Learning for Medical Imaging",
    "abstract": "arXiv:2306.10535v2 Announce Type: replace-cross  Abstract: Multiple Instance Learning (MIL) is a weakly-supervised problem in which one label is assigned to the whole bag of instances. An important class of MIL models is instance-based, where we first classify instances and then aggregate those predictions to obtain a bag label. The most common MIL model is when we consider a bag as positive if at least one of its instances has a positive label. However, this reasoning does not hold in many real-life scenarios, where the positive bag label is often a consequence of a certain percentage of positive instances. To address this issue, we introduce a dedicated instance-based method called ProMIL, based on deep neural networks and Bernstein polynomial estimation. An important advantage of ProMIL is that it can automatically detect the optimal percentage level for decision-making. We show that ProMIL outperforms standard instance-based MIL in real-world medical applications. We make the code ",
    "link": "https://arxiv.org/abs/2306.10535",
    "context": "Title: ProMIL: Probabilistic Multiple Instance Learning for Medical Imaging\nAbstract: arXiv:2306.10535v2 Announce Type: replace-cross  Abstract: Multiple Instance Learning (MIL) is a weakly-supervised problem in which one label is assigned to the whole bag of instances. An important class of MIL models is instance-based, where we first classify instances and then aggregate those predictions to obtain a bag label. The most common MIL model is when we consider a bag as positive if at least one of its instances has a positive label. However, this reasoning does not hold in many real-life scenarios, where the positive bag label is often a consequence of a certain percentage of positive instances. To address this issue, we introduce a dedicated instance-based method called ProMIL, based on deep neural networks and Bernstein polynomial estimation. An important advantage of ProMIL is that it can automatically detect the optimal percentage level for decision-making. We show that ProMIL outperforms standard instance-based MIL in real-world medical applications. We make the code ",
    "path": "papers/23/06/2306.10535.json",
    "total_tokens": 825,
    "translated_title": "ProMIL：面向医学成像的概率多实例学习",
    "translated_abstract": "多实例学习（MIL）是一个弱监督问题，其中一个标签被分配给整个实例包。其中一种重要的MIL模型是基于实例的，我们首先对实例进行分类，然后聚合这些预测结果以获得包标签。最常见的MIL模型是将包视为正类，如果其实例中至少有一个实例具有正标签。然而，在许多现实场景中，这种推理并不成立，其中正包标签通常是部分正实例的结果。为了解决这个问题，我们引入了一种专门的基于实例的方法，称为ProMIL，基于深度神经网络和Bernstein多项式估计。ProMIL的一个重要优势是它可以自动检测用于决策的最佳百分比水平。我们展示了ProMIL在真实世界医学应用中优于标准基于实例的MIL。我们提供代码。",
    "tldr": "ProMIL是一种基于实例的方法，在医学应用中能够自动检测最佳决策百分比水平，并在真实场景中表现优异.",
    "en_tdlr": "ProMIL is an instance-based method that automatically detects the optimal decision-making percentage level in medical applications and outperforms standard instance-based MIL in real-world scenarios."
}