{
    "title": "NoRefER: a Referenceless Quality Metric for Automatic Speech Recognition via Semi-Supervised Language Model Fine-Tuning with Contrastive Learning. (arXiv:2306.12577v1 [cs.CL])",
    "abstract": "This paper introduces NoRefER, a novel referenceless quality metric for automatic speech recognition (ASR) systems. Traditional reference-based metrics for evaluating ASR systems require costly ground-truth transcripts. NoRefER overcomes this limitation by fine-tuning a multilingual language model for pair-wise ranking ASR hypotheses using contrastive learning with Siamese network architecture. The self-supervised NoRefER exploits the known quality relationships between hypotheses from multiple compression levels of an ASR for learning to rank intra-sample hypotheses by quality, which is essential for model comparisons. The semi-supervised version also uses a referenced dataset to improve its inter-sample quality ranking, which is crucial for selecting potentially erroneous samples. The results indicate that NoRefER correlates highly with reference-based metrics and their intra-sample ranks, indicating a high potential for referenceless ASR evaluation or a/b testing.",
    "link": "http://arxiv.org/abs/2306.12577",
    "context": "Title: NoRefER: a Referenceless Quality Metric for Automatic Speech Recognition via Semi-Supervised Language Model Fine-Tuning with Contrastive Learning. (arXiv:2306.12577v1 [cs.CL])\nAbstract: This paper introduces NoRefER, a novel referenceless quality metric for automatic speech recognition (ASR) systems. Traditional reference-based metrics for evaluating ASR systems require costly ground-truth transcripts. NoRefER overcomes this limitation by fine-tuning a multilingual language model for pair-wise ranking ASR hypotheses using contrastive learning with Siamese network architecture. The self-supervised NoRefER exploits the known quality relationships between hypotheses from multiple compression levels of an ASR for learning to rank intra-sample hypotheses by quality, which is essential for model comparisons. The semi-supervised version also uses a referenced dataset to improve its inter-sample quality ranking, which is crucial for selecting potentially erroneous samples. The results indicate that NoRefER correlates highly with reference-based metrics and their intra-sample ranks, indicating a high potential for referenceless ASR evaluation or a/b testing.",
    "path": "papers/23/06/2306.12577.json",
    "total_tokens": 906,
    "translated_title": "NoRefER: 一种基于半监督语言模型微调和对比学习的无参考自动语音识别质量度量方法",
    "translated_abstract": "本文介绍了NoRefER，一种新颖的无参考自动语音识别（ASR）系统质量度量方法。传统的基于参考的ASR评估指标需要昂贵的真实文本成绩单。NoRefER通过使用具有孪生网络架构的对比学习调整多语言语言模型来对ASR假设进行两两排名，从而克服了这个限制。自监督的NoRefER利用对来自ASR的多个压缩级别的假设之间的已知质量关系进行的学习，以按质量排序单个样本内的假设，这对于模型比较至关重要。半监督版本还使用引用数据集来提高其样本间质量排名，对于选择潜在错误的样本至关重要。结果表明，NoRefER与基于参考的指标及其样本内排序高度相关，表明具有无参考ASR评估或A/B测试的巨大潜力。",
    "tldr": "本文提出了一种无参考的ASR质量度量方法，使用半监督语言模型微调和对比学习，可以对ASR假设进行排名，并在选择潜在错误的样本方面具有潜在的潜力。",
    "en_tdlr": "This paper proposes a referenceless quality metric for automatic speech recognition (ASR) systems, called NoRefER, which uses semi-supervised language model fine-tuning and contrastive learning to rank ASR hypotheses and has potential for selecting potentially erroneous samples."
}