{
    "title": "Towards social generative AI for education: theory, practices and ethics. (arXiv:2306.10063v1 [cs.CY])",
    "abstract": "This paper explores educational interactions involving humans and artificial intelligences not as sequences of prompts and responses, but as a social process of conversation and exploration. In this conception, learners continually converse with AI language models within a dynamic computational medium of internet tools and resources. Learning happens when this distributed system sets goals, builds meaning from data, consolidates understanding, reconciles differences, and transfers knowledge to new domains. Building social generative AI for education will require development of powerful AI systems that can converse with each other as well as humans, construct external representations such as knowledge maps, access and contribute to internet resources, and act as teachers, learners, guides and mentors. This raises fundamental problems of ethics. Such systems should be aware of their limitations, their responsibility to learners and the integrity of the internet, and their respect for hum",
    "link": "http://arxiv.org/abs/2306.10063",
    "context": "Title: Towards social generative AI for education: theory, practices and ethics. (arXiv:2306.10063v1 [cs.CY])\nAbstract: This paper explores educational interactions involving humans and artificial intelligences not as sequences of prompts and responses, but as a social process of conversation and exploration. In this conception, learners continually converse with AI language models within a dynamic computational medium of internet tools and resources. Learning happens when this distributed system sets goals, builds meaning from data, consolidates understanding, reconciles differences, and transfers knowledge to new domains. Building social generative AI for education will require development of powerful AI systems that can converse with each other as well as humans, construct external representations such as knowledge maps, access and contribute to internet resources, and act as teachers, learners, guides and mentors. This raises fundamental problems of ethics. Such systems should be aware of their limitations, their responsibility to learners and the integrity of the internet, and their respect for hum",
    "path": "papers/23/06/2306.10063.json",
    "total_tokens": 893,
    "translated_title": "面向教育的社交生成人工智能：理论，实践和伦理学",
    "translated_abstract": "本文探讨人与人工智能之间的教育交互，不是作为提示和响应的序列，而是作为对话和探索的社交过程。在这种构思下，学习者在互联网工具和资源的动态计算环境中不断与AI语言模型交流。当这个分布式系统设定目标、从数据中建立意义、巩固理解、调和差异并将知识传递到新的领域时，学习就会发生。构建面向教育的社交生成人工智能需要开发强大的人工智能系统，这些系统可以彼此交谈，构建外部表示（如知识地图），访问和贡献互联网资源，并担任教师、学习者、导师和指导。这引出了基本的伦理问题。这些系统应该认识到他们的局限性，对学习者和互联网的完整性负责，并尊重人类价值观。",
    "tldr": "本文探讨如何构建面向教育的社交生成人工智能系统，该系统需要强大的人工智能，并具备对互联网资源的访问和贡献能力，但同时还需要认识到自己的局限性，对学生负责并尊重人类价值观。",
    "en_tdlr": "This paper discusses how to build social generative AI for education, which requires powerful AI systems with access and contribution to internet resources and awareness of limitations, responsibility to learners, and respect for human values."
}