{
    "title": "One-sided Matrix Completion from Two Observations Per Row. (arXiv:2306.04049v1 [cs.LG])",
    "abstract": "Given only a few observed entries from a low-rank matrix $X$, matrix completion is the problem of imputing the missing entries, and it formalizes a wide range of real-world settings that involve estimating missing data. However, when there are too few observed entries to complete the matrix, what other aspects of the underlying matrix can be reliably recovered? We study one such problem setting, that of \"one-sided\" matrix completion, where our goal is to recover the right singular vectors of $X$, even in the regime where recovering the left singular vectors is impossible, which arises when there are more rows than columns and very few observations. We propose a natural algorithm that involves imputing the missing values of the matrix $X^TX$ and show that even with only two observations per row in $X$, we can provably recover $X^TX$ as long as we have at least $\\Omega(r^2 d \\log d)$ rows, where $r$ is the rank and $d$ is the number of columns. We evaluate our algorithm on one-sided reco",
    "link": "http://arxiv.org/abs/2306.04049",
    "context": "Title: One-sided Matrix Completion from Two Observations Per Row. (arXiv:2306.04049v1 [cs.LG])\nAbstract: Given only a few observed entries from a low-rank matrix $X$, matrix completion is the problem of imputing the missing entries, and it formalizes a wide range of real-world settings that involve estimating missing data. However, when there are too few observed entries to complete the matrix, what other aspects of the underlying matrix can be reliably recovered? We study one such problem setting, that of \"one-sided\" matrix completion, where our goal is to recover the right singular vectors of $X$, even in the regime where recovering the left singular vectors is impossible, which arises when there are more rows than columns and very few observations. We propose a natural algorithm that involves imputing the missing values of the matrix $X^TX$ and show that even with only two observations per row in $X$, we can provably recover $X^TX$ as long as we have at least $\\Omega(r^2 d \\log d)$ rows, where $r$ is the rank and $d$ is the number of columns. We evaluate our algorithm on one-sided reco",
    "path": "papers/23/06/2306.04049.json",
    "total_tokens": 1050,
    "translated_title": "从每行两个观测来看的单边矩阵完成问题",
    "translated_abstract": "给定一个低秩矩阵$X$的一些观测值，矩阵完成问题是推测缺失值的问题，它是形式化描述一系列需要估计缺失数据的现实世界设置。然而，当观测到的条目太少而无法完成矩阵时，可以可靠恢复基础矩阵的哪些其他方面？我们研究了一个这样的问题设置，即“单边”矩阵完成，我们的目标是恢复$X$的右奇异向量，即使在无法恢复左奇异向量的情况下，即当行数大于列数且观测的很少时。我们提出了一个自然算法，涉及到矩阵$X^TX$中缺失值的插值，并证明即使在每行只有两个观测值的情况下，只要我们有至少$\\Omega(r^2 d \\log d)$行，其中$r$为秩，$d$为列数，我们就可以可靠地恢复$X^TX$。我们评估了我们的算法在单边矩阵完成问题以及推荐任务上的表现，并发现它在所考虑的设置下优于现有的方法。",
    "tldr": "本文研究了单边矩阵完成问题，在每行只有两个观测值的情况下，使用插值算法可以可靠恢复$X^TX$，进而恢复$X$的右奇异向量。",
    "en_tdlr": "This paper studies the problem of one-sided matrix completion, where the goal is to recover the right singular vectors of a low-rank matrix with only two observations per row, and proposes a natural algorithm based on imputing the missing values of $X^TX$ which can provably recover $X^TX$ as long as there are at least $\\Omega(r^2d\\log d)$ rows, leading to the recovery of the right singular vectors."
}