{
    "title": "A Belief Model for Conflicting and Uncertain Evidence -- Connecting Dempster-Shafer Theory and the Topology of Evidence. (arXiv:2306.03532v1 [cs.AI])",
    "abstract": "One problem to solve in the context of information fusion, decision-making, and other artificial intelligence challenges is to compute justified beliefs based on evidence. In real-life examples, this evidence may be inconsistent, incomplete, or uncertain, making the problem of evidence fusion highly non-trivial. In this paper, we propose a new model for measuring degrees of beliefs based on possibly inconsistent, incomplete, and uncertain evidence, by combining tools from Dempster-Shafer Theory and Topological Models of Evidence. Our belief model is more general than the aforementioned approaches in two important ways: (1) it can reproduce them when appropriate constraints are imposed, and, more notably, (2) it is flexible enough to compute beliefs according to various standards that represent agents' evidential demands. The latter novelty allows the users of our model to employ it to compute an agent's (possibly) distinct degrees of belief, based on the same evidence, in situations wh",
    "link": "http://arxiv.org/abs/2306.03532",
    "context": "Title: A Belief Model for Conflicting and Uncertain Evidence -- Connecting Dempster-Shafer Theory and the Topology of Evidence. (arXiv:2306.03532v1 [cs.AI])\nAbstract: One problem to solve in the context of information fusion, decision-making, and other artificial intelligence challenges is to compute justified beliefs based on evidence. In real-life examples, this evidence may be inconsistent, incomplete, or uncertain, making the problem of evidence fusion highly non-trivial. In this paper, we propose a new model for measuring degrees of beliefs based on possibly inconsistent, incomplete, and uncertain evidence, by combining tools from Dempster-Shafer Theory and Topological Models of Evidence. Our belief model is more general than the aforementioned approaches in two important ways: (1) it can reproduce them when appropriate constraints are imposed, and, more notably, (2) it is flexible enough to compute beliefs according to various standards that represent agents' evidential demands. The latter novelty allows the users of our model to employ it to compute an agent's (possibly) distinct degrees of belief, based on the same evidence, in situations wh",
    "path": "papers/23/06/2306.03532.json",
    "total_tokens": 921,
    "translated_title": "冲突和不确定证据的信念模型——连接Dempster-Shafer理论和证据拓扑学",
    "translated_abstract": "在信息融合、决策和其他人工智能挑战的背景下，需要根据证据计算合理的信念。在现实生活中，这些证据可能不一致、不完整或不确定，使证据融合的问题非常复杂。在本文中，我们提出了一种基于可能不一致、不完整和不确定证据的测量信念程度的新模型，通过结合Dempster-Shafer理论和证据拓扑模型的工具。我们的信念模型比前述方法更为普适，它在两个重要方面比前述方法更优：（1）当适当的约束被施加时，它可以重现它们；（2）它足够灵活，可以根据代理人的证据要求计算信念的不同标准。后者的创新使得使用我们的模型的用户能够在代理人具有不同的正当化标准的情况下，基于同样的证据计算代理人的（可能）不同的信念程度。",
    "tldr": "本文提出了一种基于Dempster-Shafer理论和证据拓扑模型的信念模型，可以更为普适地计算代理人的不同标准下的信念程度。",
    "en_tdlr": "This paper proposes a belief model based on Dempster-Shafer theory and topological models of evidence, which is more general and flexible than existing approaches, and can compute an agent's distinct degrees of belief based on different standards of justification."
}