{
    "title": "Provably Efficient Representation Learning with Tractable Planning in Low-Rank POMDP. (arXiv:2306.12356v1 [cs.LG])",
    "abstract": "In this paper, we study representation learning in partially observable Markov Decision Processes (POMDPs), where the agent learns a decoder function that maps a series of high-dimensional raw observations to a compact representation and uses it for more efficient exploration and planning.  We focus our attention on the sub-classes of \\textit{$\\gamma$-observable} and \\textit{decodable POMDPs}, for which it has been shown that statistically tractable learning is possible, but there has not been any computationally efficient algorithm. We first present an algorithm for decodable POMDPs that combines maximum likelihood estimation (MLE) and optimism in the face of uncertainty (OFU) to perform representation learning and achieve efficient sample complexity, while only calling supervised learning computational oracles. We then show how to adapt this algorithm to also work in the broader class of $\\gamma$-observable POMDPs.",
    "link": "http://arxiv.org/abs/2306.12356",
    "context": "Title: Provably Efficient Representation Learning with Tractable Planning in Low-Rank POMDP. (arXiv:2306.12356v1 [cs.LG])\nAbstract: In this paper, we study representation learning in partially observable Markov Decision Processes (POMDPs), where the agent learns a decoder function that maps a series of high-dimensional raw observations to a compact representation and uses it for more efficient exploration and planning.  We focus our attention on the sub-classes of \\textit{$\\gamma$-observable} and \\textit{decodable POMDPs}, for which it has been shown that statistically tractable learning is possible, but there has not been any computationally efficient algorithm. We first present an algorithm for decodable POMDPs that combines maximum likelihood estimation (MLE) and optimism in the face of uncertainty (OFU) to perform representation learning and achieve efficient sample complexity, while only calling supervised learning computational oracles. We then show how to adapt this algorithm to also work in the broader class of $\\gamma$-observable POMDPs.",
    "path": "papers/23/06/2306.12356.json",
    "total_tokens": 881,
    "translated_title": "可证明高效的低秩POMDP规划中表示学习",
    "translated_abstract": "本文研究在部分可观察马尔可夫决策过程（POMDP）中的表示学习，其中代理学习一个解码器函数，将一系列高维原始观察映射到一个紧凑的表示中，并用于更高效的探索和规划。我们关注\\textit{ $\\gamma$-可观察}和 \\textit{可解码POMDP}子类，已经证明了在这些子类中，统计上可处理的学习是可能的，但尚未有计算上高效的算法。我们首先提出了一种可解码POMDP的算法，该算法结合最大似然估计（MLE）和不确定性乐观性（OFU）进行表示学习，实现了高效的样本复杂度，同时只调用了监督学习计算神经元。然后，我们展示了如何将此算法调整为在更广泛的$\\gamma$-可观察POMDP类中运行。",
    "tldr": "本文研究了在部分可观察马尔可夫决策过程中的可证明高效表示学习，提出了可解码和$\\gamma$-可观察两种算法，达到高效样本复杂度。",
    "en_tdlr": "The paper proposes provably efficient representation learning algorithms, namely for decodable and $\\gamma$-observable POMDPs, achieving high sample complexity by combining MLE and OFU, and using only supervised learning computational oracles."
}