{
    "title": "Conditionally Strongly Log-Concave Generative Models. (arXiv:2306.00181v1 [stat.ML])",
    "abstract": "There is a growing gap between the impressive results of deep image generative models and classical algorithms that offer theoretical guarantees. The former suffer from mode collapse or memorization issues, limiting their application to scientific data. The latter require restrictive assumptions such as log-concavity to escape the curse of dimensionality. We partially bridge this gap by introducing conditionally strongly log-concave (CSLC) models, which factorize the data distribution into a product of conditional probability distributions that are strongly log-concave. This factorization is obtained with orthogonal projectors adapted to the data distribution. It leads to efficient parameter estimation and sampling algorithms, with theoretical guarantees, although the data distribution is not globally log-concave. We show that several challenging multiscale processes are conditionally log-concave using wavelet packet orthogonal projectors. Numerical results are shown for physical field",
    "link": "http://arxiv.org/abs/2306.00181",
    "context": "Title: Conditionally Strongly Log-Concave Generative Models. (arXiv:2306.00181v1 [stat.ML])\nAbstract: There is a growing gap between the impressive results of deep image generative models and classical algorithms that offer theoretical guarantees. The former suffer from mode collapse or memorization issues, limiting their application to scientific data. The latter require restrictive assumptions such as log-concavity to escape the curse of dimensionality. We partially bridge this gap by introducing conditionally strongly log-concave (CSLC) models, which factorize the data distribution into a product of conditional probability distributions that are strongly log-concave. This factorization is obtained with orthogonal projectors adapted to the data distribution. It leads to efficient parameter estimation and sampling algorithms, with theoretical guarantees, although the data distribution is not globally log-concave. We show that several challenging multiscale processes are conditionally log-concave using wavelet packet orthogonal projectors. Numerical results are shown for physical field",
    "path": "papers/23/06/2306.00181.json",
    "total_tokens": 899,
    "translated_title": "条件强对数凹的生成模型",
    "translated_abstract": "深度生成模型在生成图像方面已经具有很好的效果，但由于存在模式崩溃和记忆问题，其应用受到限制。经典算法在理论上提供严格的保证，但对于高纬度数据需要满足诸如对数凹性等限制条件来避免维度灾难。本文通过介绍条件强对数凹模型(CSLC)，将数据分布分解成一组满足强对数凹条件的条件概率分布的乘积形式，该分解通过适应于数据分布的正交投影器得到。与数据分布不全局对数凹的情况不同，该分解提供了有效的参数估计和采样算法，同时提供了理论保证。我们使用小波包正交投影器证明了一些具有挑战性的多尺度过程满足条件对数凹性。 最后，我们在物理场领域展示了数值结果。",
    "tldr": "本论文介绍了条件强对数凹模型(CSLC)。我们将数据分布分解成一组满足强对数凹条件的条件概率分布的乘积形式。通过适应于数据分布的正交投影器得到分解，提供了有效的参数估计和采样算法，同时提供了理论保证。",
    "en_tdlr": "This paper introduces conditionally strongly log-concave (CSLC) models, which factorize the data distribution into a product of conditional probability distributions that are strongly log-concave, obtained with orthogonal projectors adapted to the data distribution. Effcient parameter estimation and sampling algorithms, with theoretical guarantees are provided."
}