{
    "title": "Brain Tumor Recurrence vs. Radiation Necrosis Classification and Patient Survivability Prediction. (arXiv:2306.03270v1 [eess.IV])",
    "abstract": "GBM (Glioblastoma multiforme) is the most aggressive type of brain tumor in adults that has a short survival rate even after aggressive treatment with surgery and radiation therapy. The changes on magnetic resonance imaging (MRI) for patients with GBM after radiotherapy are indicative of either radiation-induced necrosis (RN) or recurrent brain tumor (rBT). Screening for rBT and RN at an early stage is crucial for facilitating faster treatment and better outcomes for the patients. Differentiating rBT from RN is challenging as both may present with similar radiological and clinical characteristics on MRI. Moreover, learning-based rBT versus RN classification using MRI may suffer from class imbalance due to lack of patient data. While synthetic data generation using generative models has shown promise to address class imbalance, the underlying data representation may be different in synthetic or augmented data. This study proposes computational modeling with statistically rigorous repeat",
    "link": "http://arxiv.org/abs/2306.03270",
    "context": "Title: Brain Tumor Recurrence vs. Radiation Necrosis Classification and Patient Survivability Prediction. (arXiv:2306.03270v1 [eess.IV])\nAbstract: GBM (Glioblastoma multiforme) is the most aggressive type of brain tumor in adults that has a short survival rate even after aggressive treatment with surgery and radiation therapy. The changes on magnetic resonance imaging (MRI) for patients with GBM after radiotherapy are indicative of either radiation-induced necrosis (RN) or recurrent brain tumor (rBT). Screening for rBT and RN at an early stage is crucial for facilitating faster treatment and better outcomes for the patients. Differentiating rBT from RN is challenging as both may present with similar radiological and clinical characteristics on MRI. Moreover, learning-based rBT versus RN classification using MRI may suffer from class imbalance due to lack of patient data. While synthetic data generation using generative models has shown promise to address class imbalance, the underlying data representation may be different in synthetic or augmented data. This study proposes computational modeling with statistically rigorous repeat",
    "path": "papers/23/06/2306.03270.json",
    "total_tokens": 969,
    "translated_title": "大脑肿瘤复发与放射性坏死鉴别以及患者生存率预测",
    "translated_abstract": "成人最凶险的脑肿瘤是胶质母细胞瘤（GBM），即使经过手术和放疗治疗后且积极治疗，其短期生存率也很低。GBM患者接受放疗后，磁共振成像（MRI）的变化表明出现放射性坏死（RN）或脑肿瘤复发（rBT）。在早期筛选rBT和RN对于促进患者更快地接受治疗和获得更好的治疗结果至关重要。区分rBT和RN是有挑战性的，因为两者在MRI上可能呈现出类似的放射性和临床特征。此外，使用MRI进行机器学习的rBT与RN分类可能会因缺乏患者数据而导致类别不平衡。虚拟模型产生的合成数据可以通过生成模型来解决类别不平衡，但会导致合成或增广数据中的基础数据表示不同。本研究提出了具有统计学严谨性的计算模型。",
    "tldr": "该研究提出了具有统计学严谨性的计算模型，旨在区分磁共振成像（MRI）中rBT和RN，并以此来预测GBM患者的生存率。这对促进患者早期接受治疗和获得更好的治疗结果至关重要。"
}