{
    "title": "Bayesian Optimisation Against Climate Change: Applications and Benchmarks. (arXiv:2306.04343v1 [cs.LG])",
    "abstract": "Bayesian optimisation is a powerful method for optimising black-box functions, popular in settings where the true function is expensive to evaluate and no gradient information is available. Bayesian optimisation can improve responses to many optimisation problems within climate change for which simulator models are unavailable or expensive to sample from. While there have been several feasibility demonstrations of Bayesian optimisation in climate-related applications, there has been no unifying review of applications and benchmarks. We provide such a review here, to encourage the use of Bayesian optimisation in important and well-suited application domains. We identify four main application domains: material discovery, wind farm layout, optimal renewable control and environmental monitoring. For each domain we identify a public benchmark or data set that is easy to use and evaluate systems against, while being representative of real-world problems. Due to the lack of a suitable benchma",
    "link": "http://arxiv.org/abs/2306.04343",
    "context": "Title: Bayesian Optimisation Against Climate Change: Applications and Benchmarks. (arXiv:2306.04343v1 [cs.LG])\nAbstract: Bayesian optimisation is a powerful method for optimising black-box functions, popular in settings where the true function is expensive to evaluate and no gradient information is available. Bayesian optimisation can improve responses to many optimisation problems within climate change for which simulator models are unavailable or expensive to sample from. While there have been several feasibility demonstrations of Bayesian optimisation in climate-related applications, there has been no unifying review of applications and benchmarks. We provide such a review here, to encourage the use of Bayesian optimisation in important and well-suited application domains. We identify four main application domains: material discovery, wind farm layout, optimal renewable control and environmental monitoring. For each domain we identify a public benchmark or data set that is easy to use and evaluate systems against, while being representative of real-world problems. Due to the lack of a suitable benchma",
    "path": "papers/23/06/2306.04343.json",
    "total_tokens": 906,
    "translated_title": "基于贝叶斯优化的气候变化对抗：应用和基准研究",
    "translated_abstract": "贝叶斯优化是一种优化黑盒函数的强有力方法，在真实函数难以评估且没有渐进信息的设置中广受欢迎。贝叶斯优化可以优化许多气候变化中的优化问题，其中的模拟器模型不可用或难以从中抽取样本。虽然在气候相关应用中已经有了几个可行性演示贝叶斯优化的案例，但还没有统一的应用和基准研究。我们在这里提供这样的综述，以鼓励在重要和适宜的应用领域使用贝叶斯优化。我们确定了四个主要应用领域：材料发现、风电场布局、最优可再生能源控制和环境监测。对于每个领域，我们确定了易于使用和评估系统的公共基准或数据集，同时代表着真实世界问题。由于缺乏适当的基准，我们建议未来开发更全面的基准数据集。",
    "tldr": "本论文综述了在气候变化应用中使用贝叶斯优化的可行性和应用案例，提出了四个主要应用领域和相应的公共基准或数据集，并鼓励开发更全面的基准数据集。",
    "en_tdlr": "This paper provides a review of the feasibility and application cases of using Bayesian optimization in climate change applications, identifies four main application domains and corresponding public benchmarks or datasets, and encourages the development of more comprehensive benchmark datasets."
}