{
    "title": "MBrain: A Multi-channel Self-Supervised Learning Framework for Brain Signals. (arXiv:2306.13102v1 [eess.SP])",
    "abstract": "Brain signals are important quantitative data for understanding physiological activities and diseases of human brain. Most existing studies pay attention to supervised learning methods, which, however, require high-cost clinical labels. In addition, the huge difference in the clinical patterns of brain signals measured by invasive (e.g., SEEG) and non-invasive (e.g., EEG) methods leads to the lack of a unified method. To handle the above issues, we propose to study the self-supervised learning (SSL) framework for brain signals that can be applied to pre-train either SEEG or EEG data. Intuitively, brain signals, generated by the firing of neurons, are transmitted among different connecting structures in human brain. Inspired by this, we propose MBrain to learn implicit spatial and temporal correlations between different channels (i.e., contacts of the electrode, corresponding to different brain areas) as the cornerstone for uniformly modeling different types of brain signals. Specifical",
    "link": "http://arxiv.org/abs/2306.13102",
    "context": "Title: MBrain: A Multi-channel Self-Supervised Learning Framework for Brain Signals. (arXiv:2306.13102v1 [eess.SP])\nAbstract: Brain signals are important quantitative data for understanding physiological activities and diseases of human brain. Most existing studies pay attention to supervised learning methods, which, however, require high-cost clinical labels. In addition, the huge difference in the clinical patterns of brain signals measured by invasive (e.g., SEEG) and non-invasive (e.g., EEG) methods leads to the lack of a unified method. To handle the above issues, we propose to study the self-supervised learning (SSL) framework for brain signals that can be applied to pre-train either SEEG or EEG data. Intuitively, brain signals, generated by the firing of neurons, are transmitted among different connecting structures in human brain. Inspired by this, we propose MBrain to learn implicit spatial and temporal correlations between different channels (i.e., contacts of the electrode, corresponding to different brain areas) as the cornerstone for uniformly modeling different types of brain signals. Specifical",
    "path": "papers/23/06/2306.13102.json",
    "total_tokens": 893,
    "translated_title": "MBrain：一种用于脑信号的多通道自监督学习框架",
    "translated_abstract": "脑信号是了解人类大脑的生理活动和疾病的重要定量数据。大多数现有研究都关注监督学习方法，然而，这些方法需要高成本的临床标签。此外，侵入式（例如SEEG）和非侵入式（例如EEG）方法测量的脑信号的临床模式之间巨大的差异导致缺乏一种统一的方法。为了处理以上问题，我们提出了研究自监督学习（SSL）框架，该框架可用于预先训练SEEG或EEG数据。直观地，由神经元的发射产生的脑信号在人类大脑中传输到不同的连接结构之间。受此启发，我们提出了MBrain，以学习不同通道（即电极的接触点，对应于不同的脑区）之间的隐式空间和时间相关性，作为统一建模不同类型脑信号的基石。",
    "tldr": "MBrain是一种针对脑信号的多通道自监督学习框架，可解决监督学习方法需要高成本临床标签和不同测量方法之间临床模式差异的问题。"
}