{
    "title": "Learning for Edge-Weighted Online Bipartite Matching with Robustness Guarantees. (arXiv:2306.00172v1 [cs.LG])",
    "abstract": "Many problems, such as online ad display, can be formulated as online bipartite matching. The crucial challenge lies in the nature of sequentially-revealed online item information, based on which we make irreversible matching decisions at each step. While numerous expert online algorithms have been proposed with bounded worst-case competitive ratios, they may not offer satisfactory performance in average cases. On the other hand, reinforcement learning (RL) has been applied to improve the average performance, but it lacks robustness and can perform arbitrarily poorly. In this paper, we propose a novel RL-based approach to edge-weighted online bipartite matching with robustness guarantees (LOMAR), achieving both good average-case and worst-case performance. The key novelty of LOMAR is a new online switching operation which, based on a judicious condition to hedge against future uncertainties, decides whether to follow the expert's decision or the RL decision for each online item. We pro",
    "link": "http://arxiv.org/abs/2306.00172",
    "context": "Title: Learning for Edge-Weighted Online Bipartite Matching with Robustness Guarantees. (arXiv:2306.00172v1 [cs.LG])\nAbstract: Many problems, such as online ad display, can be formulated as online bipartite matching. The crucial challenge lies in the nature of sequentially-revealed online item information, based on which we make irreversible matching decisions at each step. While numerous expert online algorithms have been proposed with bounded worst-case competitive ratios, they may not offer satisfactory performance in average cases. On the other hand, reinforcement learning (RL) has been applied to improve the average performance, but it lacks robustness and can perform arbitrarily poorly. In this paper, we propose a novel RL-based approach to edge-weighted online bipartite matching with robustness guarantees (LOMAR), achieving both good average-case and worst-case performance. The key novelty of LOMAR is a new online switching operation which, based on a judicious condition to hedge against future uncertainties, decides whether to follow the expert's decision or the RL decision for each online item. We pro",
    "path": "papers/23/06/2306.00172.json",
    "total_tokens": 973,
    "translated_title": "具有鲁棒性保证的带权在线二分图匹配学习",
    "translated_abstract": "许多问题，如在线广告显示可以被公式化为在线二分图匹配。关键的挑战在于基于序列化公布的在线条目信息，我们在每个步骤上做出不可逆转的匹配决策。虽然已经提出了许多具有有界最坏情况竞争比的专家在线算法，但它们在平均情况下可能无法提供令人满意的性能。另一方面，强化学习（RL）已被应用于提高平均性能，但缺乏鲁棒性，可能表现得任意差。本文提出了一种新颖的基于RL的具有鲁棒性保证的边缘加权在线二分图匹配方法（LOMAR），实现了好的平均情况和最坏情况的性能。 LOMAR的关键新颖之处在于一种新的在线切换操作，该操作基于谨慎的条件来对抗未来不确定性，决定是否根据每个在线项目遵循专家决策还是RL决策。",
    "tldr": "本论文提出了一个新的基于RL的边缘加权在线二分图匹配方法（LOMAR），实现了好的平均情况和最坏情况的性能，其关键新颖之处在于决策是基于一个新的在线切换操作，该操作可以对抗未来的不确定性。",
    "en_tdlr": "This paper proposes a novel RL-based approach to edge-weighted online bipartite matching with robustness guarantees (LOMAR), achieving both good average-case and worst-case performance. LOMAR's key novelty is a new online switching operation, which decides whether to follow the expert's decision or the RL decision for each online item based on a judicious condition to hedge against future uncertainties."
}