{
    "title": "Interactive Fashion Content Generation Using LLMs and Latent Diffusion Models. (arXiv:2306.05182v1 [cs.CV])",
    "abstract": "Fashionable image generation aims to synthesize images of diverse fashion prevalent around the globe, helping fashion designers in real-time visualization by giving them a basic customized structure of how a specific design preference would look in real life and what further improvements can be made for enhanced customer satisfaction. Moreover, users can alone interact and generate fashionable images by just giving a few simple prompts. Recently, diffusion models have gained popularity as generative models owing to their flexibility and generation of realistic images from Gaussian noise. Latent diffusion models are a type of generative model that use diffusion processes to model the generation of complex data, such as images, audio, or text. They are called \"latent\" because they learn a hidden representation, or latent variable, of the data that captures its underlying structure. We propose a method exploiting the equivalence between diffusion models and energy-based models (EBMs) and ",
    "link": "http://arxiv.org/abs/2306.05182",
    "context": "Title: Interactive Fashion Content Generation Using LLMs and Latent Diffusion Models. (arXiv:2306.05182v1 [cs.CV])\nAbstract: Fashionable image generation aims to synthesize images of diverse fashion prevalent around the globe, helping fashion designers in real-time visualization by giving them a basic customized structure of how a specific design preference would look in real life and what further improvements can be made for enhanced customer satisfaction. Moreover, users can alone interact and generate fashionable images by just giving a few simple prompts. Recently, diffusion models have gained popularity as generative models owing to their flexibility and generation of realistic images from Gaussian noise. Latent diffusion models are a type of generative model that use diffusion processes to model the generation of complex data, such as images, audio, or text. They are called \"latent\" because they learn a hidden representation, or latent variable, of the data that captures its underlying structure. We propose a method exploiting the equivalence between diffusion models and energy-based models (EBMs) and ",
    "path": "papers/23/06/2306.05182.json",
    "total_tokens": 835,
    "translated_title": "利用LLMs和潜在扩散模型的互动时尚内容生成",
    "translated_abstract": "时尚图像生成旨在合成世界各地流行的不同时尚图片，通过为时尚设计师提供特定设计偏好在真实生活中的基本定制结构以及进一步改进的看法，帮助设计师进行实时可视化。此外，用户可以通过简单的提示进行互动并生成时尚图像。最近，扩散模型由于其灵活性和从高斯噪声生成逼真图像而被视为生成模型。潜在扩散模型是一种生成模型，使用扩散过程来模拟复杂数据（如图像、音频或文本）的生成。它们被称为“潜在”，因为它们学习数据的隐藏表示或潜在变量，捕捉其基本结构。",
    "tldr": "该论文提出了一种利用LLMs和潜在扩散模型生成时尚内容的方法，通过简单的提示进行互动并生成时尚图像，从而帮助时尚设计师进行实时可视化和进一步改进，这种方法能够捕捉数据的基本结构。",
    "en_tdlr": "This paper proposes a method for generating interactive fashion content using LLMs and latent diffusion models, which can help fashion designers in real-time visualization and improvement by generating fashionable images from simple prompts, and capture the underlying structure of the data."
}