{
    "title": "Allophant: Cross-lingual Phoneme Recognition with Articulatory Attributes. (arXiv:2306.04306v1 [cs.CL])",
    "abstract": "This paper proposes Allophant, a multilingual phoneme recognizer. It requires only a phoneme inventory for cross-lingual transfer to a target language, allowing for low-resource recognition. The architecture combines a compositional phone embedding approach with individually supervised phonetic attribute classifiers in a multi-task architecture. We also introduce Allophoible, an extension of the PHOIBLE database. When combined with a distance based mapping approach for grapheme-to-phoneme outputs, it allows us to train on PHOIBLE inventories directly. By training and evaluating on 34 languages, we found that the addition of multi-task learning improves the model's capability of being applied to unseen phonemes and phoneme inventories. On supervised languages we achieve phoneme error rate improvements of 11 percentage points (pp.) compared to a baseline without multi-task learning. Evaluation of zero-shot transfer on 84 languages yielded a decrease in PER of 2.63 pp. over the baseline.",
    "link": "http://arxiv.org/abs/2306.04306",
    "context": "Title: Allophant: Cross-lingual Phoneme Recognition with Articulatory Attributes. (arXiv:2306.04306v1 [cs.CL])\nAbstract: This paper proposes Allophant, a multilingual phoneme recognizer. It requires only a phoneme inventory for cross-lingual transfer to a target language, allowing for low-resource recognition. The architecture combines a compositional phone embedding approach with individually supervised phonetic attribute classifiers in a multi-task architecture. We also introduce Allophoible, an extension of the PHOIBLE database. When combined with a distance based mapping approach for grapheme-to-phoneme outputs, it allows us to train on PHOIBLE inventories directly. By training and evaluating on 34 languages, we found that the addition of multi-task learning improves the model's capability of being applied to unseen phonemes and phoneme inventories. On supervised languages we achieve phoneme error rate improvements of 11 percentage points (pp.) compared to a baseline without multi-task learning. Evaluation of zero-shot transfer on 84 languages yielded a decrease in PER of 2.63 pp. over the baseline.",
    "path": "papers/23/06/2306.04306.json",
    "total_tokens": 926,
    "translated_title": "Allophant: 带有发音属性的跨语言音素识别系统",
    "translated_abstract": "本文提出了一种多语言音素识别系统Allophant。它只需要跨语言目标语种的音素清单即可进行低资源语音识别。该系统采用了组成性音素嵌入方法以及个别监督的语音属性分类器，并采用多任务结构进行建模。我们还介绍了Allophoible数据库的扩展。通过将该数据库与基于距离的图音转换方法相结合，我们可以直接在PHOIBLE清单上进行训练。在对34种语言进行训练和评估时，我们发现多任务学习的加入提高了该模型处理陌生音素和音素库的能力。在受监督语言上，与没有多任务学习的基线相比，我们实现了11个百分点的音素误差率改进。在84种零-shot迁移语言的评估中，与基线相比，PER下降了2.63个百分点。",
    "tldr": "本文提出了一种跨语言音素识别系统Allophant，结合组成性音素嵌入方法和个别监督的语音属性分类器，并采用多任务结构，使得该系统能够低资源进行语音识别，可以有效提高处理陌生音素和音素库的能力。",
    "en_tdlr": "Allophant is a cross-lingual phoneme recognition system that combines compositional phone embedding with individually supervised phonetic attribute classifiers using a multi-task architecture, enabling low-resource speech recognition and improving capability of handling unseen phonemes and inventories by 11pp. Evaluation on 84 transfer languages resulted in a 2.63pp decrease in phoneme error rate compared to baseline."
}