{
    "title": "Approximate inference of marginals using the IBIA framework. (arXiv:2306.00335v1 [cs.AI])",
    "abstract": "Exact inference of marginals in probabilistic graphical models (PGM) is known to be intractable, necessitating the use of approximate methods. Most of the existing variational techniques perform iterative message passing in loopy graphs which is slow to converge for many benchmarks. In this paper, we propose a new algorithm for marginal inference that is based on the incremental build-infer-approximate (IBIA) paradigm. Our algorithm converts the PGM into a sequence of linked clique tree forests (SLCTF) with bounded clique sizes, and then uses a heuristic belief update algorithm to infer the marginals. For the special case of Bayesian networks, we show that if the incremental build step in IBIA uses the topological order of variables then (a) the prior marginals are consistent in all CTFs in the SLCTF and (b) the posterior marginals are consistent once all evidence variables are added to the SLCTF. In our approach, the belief propagation step is non-iterative and the accuracy-complexity",
    "link": "http://arxiv.org/abs/2306.00335",
    "context": "Title: Approximate inference of marginals using the IBIA framework. (arXiv:2306.00335v1 [cs.AI])\nAbstract: Exact inference of marginals in probabilistic graphical models (PGM) is known to be intractable, necessitating the use of approximate methods. Most of the existing variational techniques perform iterative message passing in loopy graphs which is slow to converge for many benchmarks. In this paper, we propose a new algorithm for marginal inference that is based on the incremental build-infer-approximate (IBIA) paradigm. Our algorithm converts the PGM into a sequence of linked clique tree forests (SLCTF) with bounded clique sizes, and then uses a heuristic belief update algorithm to infer the marginals. For the special case of Bayesian networks, we show that if the incremental build step in IBIA uses the topological order of variables then (a) the prior marginals are consistent in all CTFs in the SLCTF and (b) the posterior marginals are consistent once all evidence variables are added to the SLCTF. In our approach, the belief propagation step is non-iterative and the accuracy-complexity",
    "path": "papers/23/06/2306.00335.json",
    "total_tokens": 1043,
    "translated_title": "使用IBIA框架的边缘近似推断",
    "translated_abstract": "概率图模型（PGM）中边缘的精确推断被认为是不可计算的，因此需要使用近似方法。大多数现有的变分技术在环路图中执行迭代信息传递，这对于许多基准测试来说收敛速度慢。本文提出了一种基于增量构建-推理-近似（IBIA）范例的新型边缘推断算法。我们的算法将PGM转化为具有有界团大小的一系列链接的团树森林（SLCTF），然后使用启发式置信度更新算法来推导边缘。对于贝叶斯网络的特殊情况，我们显示如果IBIA中增量构建步骤使用变量的拓扑顺序，则（a）所有SLCTF中的CTF的先验边缘一致，（b）一旦将所有证据变量添加到SLCTF中，后验边缘就是一致的。在我们的方法中，置信传递步骤是非迭代的，准确度和复杂度之间的权衡可以通过调整团的大小来控制。基准数据集上的实验结果证明了与现有技术相比我们算法的有效性和效率。",
    "tldr": "提出了一种新的基于IBIA框架的算法，通过将PGM转化为有界团大小的SLCTF序列，并使用启发式置信度更新算法来推导边缘。实验结果表明，该算法比当前最先进的技术更加有效和高效。",
    "en_tdlr": "This paper proposes a new algorithm for marginal inference using the incremental build-infer-approximate (IBIA) framework, which converts probabilistic graphical models into a sequence of linked clique tree forests (SLCTF) with bounded clique sizes and uses a heuristic belief update algorithm to infer the marginals. Experimental results demonstrate the effectiveness and efficiency of the algorithm compared to state-of-the-art techniques on benchmark datasets."
}