{
    "title": "Self-Supervised Hyperspectral Inpainting with the Optimisation inspired Deep Neural Network Prior. (arXiv:2306.07308v1 [eess.IV])",
    "abstract": "Hyperspectral Image (HSI)s cover hundreds or thousands of narrow spectral bands, conveying a wealth of spatial and spectral information. However, due to the instrumental errors and the atmospheric changes, the HSI obtained in practice are often contaminated by noise and dead pixels(lines), resulting in missing information that may severely compromise the subsequent applications. We introduce here a novel HSI missing pixel prediction algorithm, called Low Rank and Sparsity Constraint Plug-and-Play (LRS-PnP). It is shown that LRS-PnP is able to predict missing pixels and bands even when all spectral bands of the image are missing. The proposed LRS-PnP algorithm is further extended to a self-supervised model by combining the LRS-PnP with the Deep Image Prior (DIP), called LRS-PnP-DIP. In a series of experiments with real data, It is shown that the LRS-PnP-DIP either achieves state-of-the-art inpainting performance compared to other learning-based methods, or outperforms them.",
    "link": "http://arxiv.org/abs/2306.07308",
    "context": "Title: Self-Supervised Hyperspectral Inpainting with the Optimisation inspired Deep Neural Network Prior. (arXiv:2306.07308v1 [eess.IV])\nAbstract: Hyperspectral Image (HSI)s cover hundreds or thousands of narrow spectral bands, conveying a wealth of spatial and spectral information. However, due to the instrumental errors and the atmospheric changes, the HSI obtained in practice are often contaminated by noise and dead pixels(lines), resulting in missing information that may severely compromise the subsequent applications. We introduce here a novel HSI missing pixel prediction algorithm, called Low Rank and Sparsity Constraint Plug-and-Play (LRS-PnP). It is shown that LRS-PnP is able to predict missing pixels and bands even when all spectral bands of the image are missing. The proposed LRS-PnP algorithm is further extended to a self-supervised model by combining the LRS-PnP with the Deep Image Prior (DIP), called LRS-PnP-DIP. In a series of experiments with real data, It is shown that the LRS-PnP-DIP either achieves state-of-the-art inpainting performance compared to other learning-based methods, or outperforms them.",
    "path": "papers/23/06/2306.07308.json",
    "total_tokens": 933,
    "translated_title": "基于优化启发式深度神经网络的自监督高光谱图像修复",
    "translated_abstract": "高光谱图像具有成百上千个窄带谱段，传递了大量的空间和谱信息。然而，由于仪器误差和大气变化，实践中得到的高光谱图像常常被噪声和坏点污染，导致缺失信息可能严重破坏后续应用。本文提出了一种新的高光谱图像取样点修复算法，称为低秩稀疏约束插入播放算法（LRS-PnP）。结果表明，即使图像的所有光谱带都丢失，LRS-PnP也能够预测缺失的像素和带。将LRS-PnP与Deep Image Prior（DIP）相结合，进一步扩展了一种自监督模型，称为LRS-PnP-DIP。在一系列真实数据实验中，结果表明，与其他基于学习的方法相比，LRS-PnP-DIP具有最先进的修复性能或胜过它们。",
    "tldr": "本文提出了一种自监督的高光谱图像修复算法LRS-PnP-DIP，该算法能够在高光谱图像中精确预测缺失像素和带，其在实验中表现优异，达到或超过了其他学习方法。"
}