{
    "title": "Prediction Algorithms Achieving Bayesian Decision Theoretical Optimality Based on Decision Trees as Data Observation Processes. (arXiv:2306.07060v1 [cs.LG])",
    "abstract": "In the field of decision trees, most previous studies have difficulty ensuring the statistical optimality of a prediction of new data and suffer from overfitting because trees are usually used only to represent prediction functions to be constructed from given data. In contrast, some studies, including this paper, used the trees to represent stochastic data observation processes behind given data. Moreover, they derived the statistically optimal prediction, which is robust against overfitting, based on the Bayesian decision theory by assuming a prior distribution for the trees. However, these studies still have a problem in computing this Bayes optimal prediction because it involves an infeasible summation for all division patterns of a feature space, which is represented by the trees and some parameters. In particular, an open problem is a summation with respect to combinations of division axes, i.e., the assignment of features to inner nodes of the tree. We solve this by a Markov cha",
    "link": "http://arxiv.org/abs/2306.07060",
    "context": "Title: Prediction Algorithms Achieving Bayesian Decision Theoretical Optimality Based on Decision Trees as Data Observation Processes. (arXiv:2306.07060v1 [cs.LG])\nAbstract: In the field of decision trees, most previous studies have difficulty ensuring the statistical optimality of a prediction of new data and suffer from overfitting because trees are usually used only to represent prediction functions to be constructed from given data. In contrast, some studies, including this paper, used the trees to represent stochastic data observation processes behind given data. Moreover, they derived the statistically optimal prediction, which is robust against overfitting, based on the Bayesian decision theory by assuming a prior distribution for the trees. However, these studies still have a problem in computing this Bayes optimal prediction because it involves an infeasible summation for all division patterns of a feature space, which is represented by the trees and some parameters. In particular, an open problem is a summation with respect to combinations of division axes, i.e., the assignment of features to inner nodes of the tree. We solve this by a Markov cha",
    "path": "papers/23/06/2306.07060.json",
    "total_tokens": 1007,
    "translated_title": "基于决策树作为数据观察过程的贝叶斯决策理论最优预测算法",
    "translated_abstract": "在决策树领域，大多数先前的研究难以确保预测新数据的统计最优性并且容易出现过拟合，因为决策树通常仅用于表示要从给定数据构建的预测功能。相比之下，包括本文在内的其他一些研究使用树来表示给定数据背后的随机数据观察过程。此外，他们根据贝叶斯决策理论假设树的先验分布，得出了一种具有鲁棒性的统计最优预测方法，可以抵御过拟合。然而，这些研究仍存在一些问题，因为计算这种贝叶斯最优预测需要对特征空间的所有划分模式（由树和一些参数表示）进行总和，这是不可行的。特别是，还存在一种相对于分割轴的组合进行求和的问题，即将特征分配给树的内部节点。我们通过一个马尔可夫链模型来解决这个问题，并基于特征空间的树形分割模式推导出计算贝叶斯最优预测的递归公式。",
    "tldr": "本文提出了一种基于决策树作为数据观察过程的贝叶斯决策理论最优预测算法，并通过马尔可夫链模型解决了求解分割轴组合的问题。",
    "en_tdlr": "This paper proposes a Bayesian decision theoretical optimal prediction algorithm based on decision trees as data observation processes, and solves the problem of summation with respect to combinations of division axes by using a Markov chain model to derive a recursive formula for computing the Bayes optimal prediction."
}