{
    "title": "Learning Models of Adversarial Agent Behavior under Partial Observability. (arXiv:2306.11168v2 [cs.LG] UPDATED)",
    "abstract": "The need for opponent modeling and tracking arises in several real-world scenarios, such as professional sports, video game design, and drug-trafficking interdiction. In this work, we present Graph based Adversarial Modeling with Mutal Information (GrAMMI) for modeling the behavior of an adversarial opponent agent. GrAMMI is a novel graph neural network (GNN) based approach that uses mutual information maximization as an auxiliary objective to predict the current and future states of an adversarial opponent with partial observability. To evaluate GrAMMI, we design two large-scale, pursuit-evasion domains inspired by real-world scenarios, where a team of heterogeneous agents is tasked with tracking and interdicting a single adversarial agent, and the adversarial agent must evade detection while achieving its own objectives. With the mutual information formulation, GrAMMI outperforms all baselines in both domains and achieves 31.68% higher log-likelihood on average for future adversarial",
    "link": "http://arxiv.org/abs/2306.11168",
    "context": "Title: Learning Models of Adversarial Agent Behavior under Partial Observability. (arXiv:2306.11168v2 [cs.LG] UPDATED)\nAbstract: The need for opponent modeling and tracking arises in several real-world scenarios, such as professional sports, video game design, and drug-trafficking interdiction. In this work, we present Graph based Adversarial Modeling with Mutal Information (GrAMMI) for modeling the behavior of an adversarial opponent agent. GrAMMI is a novel graph neural network (GNN) based approach that uses mutual information maximization as an auxiliary objective to predict the current and future states of an adversarial opponent with partial observability. To evaluate GrAMMI, we design two large-scale, pursuit-evasion domains inspired by real-world scenarios, where a team of heterogeneous agents is tasked with tracking and interdicting a single adversarial agent, and the adversarial agent must evade detection while achieving its own objectives. With the mutual information formulation, GrAMMI outperforms all baselines in both domains and achieves 31.68% higher log-likelihood on average for future adversarial",
    "path": "papers/23/06/2306.11168.json",
    "total_tokens": 984,
    "translated_title": "在部分可观测性下学习对抗代理行为模型",
    "translated_abstract": "在许多现实场景中，比如职业体育、视频游戏设计和毒品截获中，对手建模和跟踪的需求越来越多。本文提出了一种基于图的对抗建模方法，名为GrAMMI，用于建模对抗对手代理的行为。GrAMMI是一种新颖的基于图神经网络(GNN)的方法，使用互信息最大化作为辅助目标来预测部分可观测的对抗对手的当前和未来状态。为了评估GrAMMI，我们设计了两个大规模的追逐-逃避领域，灵感来自于真实世界的场景，在这些领域中，一个异构代理团队的任务是追踪和截获一个对抗对手代理，而对抗对手代理必须在同时达到自己目标的情况下逃避被发现。通过互信息的形式化，GrAMMI在两个领域中均优于所有基线，并实现了未来对抗的平均对数似然值提高了31.68%。",
    "tldr": "本论文提出了一种名为GrAMMI的方法，用于在部分可观测性下建模对抗对手代理的行为。通过最大化互信息作为辅助目标来预测对抗对手的当前和未来状态，GrAMMI在两个大规模追逐-逃避领域中表现出了显著优越性能。"
}