{
    "title": "A survey on deep learning approaches for data integration in autonomous driving system. (arXiv:2306.11740v1 [cs.RO])",
    "abstract": "The perception module of self-driving vehicles relies on a multi-sensor system to understand its environment. Recent advancements in deep learning have led to the rapid development of approaches that integrate multi-sensory measurements to enhance perception capabilities. This paper surveys the latest deep learning integration techniques applied to the perception module in autonomous driving systems, categorizing integration approaches based on \"what, how, and when to integrate.\" A new taxonomy of integration is proposed, based on three dimensions: multi-view, multi-modality, and multi-frame. The integration operations and their pros and cons are summarized, providing new insights into the properties of an \"ideal\" data integration approach that can alleviate the limitations of existing methods. After reviewing hundreds of relevant papers, this survey concludes with a discussion of the key features of an optimal data integration approach.",
    "link": "http://arxiv.org/abs/2306.11740",
    "context": "Title: A survey on deep learning approaches for data integration in autonomous driving system. (arXiv:2306.11740v1 [cs.RO])\nAbstract: The perception module of self-driving vehicles relies on a multi-sensor system to understand its environment. Recent advancements in deep learning have led to the rapid development of approaches that integrate multi-sensory measurements to enhance perception capabilities. This paper surveys the latest deep learning integration techniques applied to the perception module in autonomous driving systems, categorizing integration approaches based on \"what, how, and when to integrate.\" A new taxonomy of integration is proposed, based on three dimensions: multi-view, multi-modality, and multi-frame. The integration operations and their pros and cons are summarized, providing new insights into the properties of an \"ideal\" data integration approach that can alleviate the limitations of existing methods. After reviewing hundreds of relevant papers, this survey concludes with a discussion of the key features of an optimal data integration approach.",
    "path": "papers/23/06/2306.11740.json",
    "total_tokens": 872,
    "translated_title": "自主驾驶系统中数据集成的深度学习方法综述",
    "translated_abstract": "自主驾驶汽车的感知模块依赖于多传感器系统来理解其环境。深度学习的最新进展促进了多感知测量的集成方法的迅速发展，以增强感知能力。本文对应用于自主驾驶系统感知模块的最新深度学习集成技术进行了调查，将集成方法分为“何时集成”，“如何集成”和“何时集成”三类。提出了一个新的集成分类系统，基于三个维度：多视角，多模态和多帧。总结了集成操作及其优缺点，提供了新的见解，阐明了“理想”数据集成方法的特性，可减轻现有方法的局限性。经过对上百篇相关论文的审查，本综述总结了优化数据集成方法的关键特点。",
    "tldr": "本文综述了自主驾驶系统感知模块的最新深度学习集成技术。其提出了一个新的集成分类系统，总结了集成操作及其优缺点，提供了新的见解，阐明了“理想”数据集成方法的特性，可减轻现有方法的局限性。本文总结了优化数据集成方法的关键特点。",
    "en_tdlr": "This paper surveys the latest deep learning integration techniques applied to the perception module in autonomous driving systems, categorizing integration approaches based on \"what, how, and when to integrate.\" A new taxonomy of integration is proposed, and the key features of an optimal data integration approach are discussed."
}