{
    "title": "Learning thermodynamically constrained equations of state with uncertainty. (arXiv:2306.17004v1 [physics.data-an])",
    "abstract": "Numerical simulations of high energy-density experiments require equation of state (EOS) models that relate a material's thermodynamic state variables -specifically pressure, volume/density, energy, and temperature. EOS models are typically constructed using a semi-empirical parametric methodology, which assumes a physics-informed functional form with many tunable parameters calibrated using experimental/simulation data. Since there are inherent uncertainties in the calibration data (parametric uncertainty) and the assumed functional EOS form (model uncertainty), it is essential to perform uncertainty quantification (UQ) to improve confidence in the EOS predictions. Model uncertainty is challenging for UQ studies since it requires exploring the space of all possible physically consistent functional forms. Thus, it is often neglected in favor of parametric uncertainty, which is easier to quantify without violating thermodynamic laws. This work presents a data-driven machine learning a",
    "link": "http://arxiv.org/abs/2306.17004",
    "context": "Title: Learning thermodynamically constrained equations of state with uncertainty. (arXiv:2306.17004v1 [physics.data-an])\nAbstract: Numerical simulations of high energy-density experiments require equation of state (EOS) models that relate a material's thermodynamic state variables -specifically pressure, volume/density, energy, and temperature. EOS models are typically constructed using a semi-empirical parametric methodology, which assumes a physics-informed functional form with many tunable parameters calibrated using experimental/simulation data. Since there are inherent uncertainties in the calibration data (parametric uncertainty) and the assumed functional EOS form (model uncertainty), it is essential to perform uncertainty quantification (UQ) to improve confidence in the EOS predictions. Model uncertainty is challenging for UQ studies since it requires exploring the space of all possible physically consistent functional forms. Thus, it is often neglected in favor of parametric uncertainty, which is easier to quantify without violating thermodynamic laws. This work presents a data-driven machine learning a",
    "path": "papers/23/06/2306.17004.json",
    "total_tokens": 860,
    "translated_title": "学习具有不确定性的热力学约束状态方程",
    "translated_abstract": "高能量密度实验的数值模拟需要方程状态模型（EOS），用于关联材料的热力学状态变量 - 即压力、体积/密度、能量和温度。EOS模型通常采用半经验性参数化方法构建，假定具有与物理相关的函数形式，并使用实验/模拟数据进行校准。由于校准数据（参数不确定性）和假定的EOS函数形式（模型不确定性）中存在固有的不确定性，执行不确定性量化（UQ）以提高EOS预测的可信度是至关重要的。模型不确定性对于UQ研究来说是具有挑战性的，因为它需要探索所有可能的物理一致的函数形式空间。因此，通常在不违反热力学定律的情况下忽略模型不确定性而偏向于参数不确定性。本研究提出了一种数据驱动的机器学习方法来学习EOS模型的热力学约束方程。",
    "tldr": "本研究提出了一种数据驱动的机器学习方法，用于学习具有不确定性的热力学约束状态方程，并进行不确定性量化，以提高方程预测的可信度。",
    "en_tdlr": "This work presents a data-driven machine learning approach to learn thermodynamically constrained equations of state with uncertainty and perform uncertainty quantification to improve the confidence in the predictions of the equations."
}