{
    "title": "Can current NLI systems handle German word order? Investigating language model performance on a new German challenge set of minimal pairs. (arXiv:2306.04523v1 [cs.CL])",
    "abstract": "Compared to English, German word order is freer and therefore poses additional challenges for natural language inference (NLI). We create WOGLI (Word Order in German Language Inference), the first adversarial NLI dataset for German word order that has the following properties: (i) each premise has an entailed and a non-entailed hypothesis; (ii) premise and hypotheses differ only in word order and necessary morphological changes to mark case and number. In particular, each premise andits two hypotheses contain exactly the same lemmata. Our adversarial examples require the model to use morphological markers in order to recognise or reject entailment. We show that current German autoencoding models fine-tuned on translated NLI data can struggle on this challenge set, reflecting the fact that translated NLI datasets will not mirror all necessary language phenomena in the target language. We also examine performance after data augmentation as well as on related word order phenomena derived ",
    "link": "http://arxiv.org/abs/2306.04523",
    "context": "Title: Can current NLI systems handle German word order? Investigating language model performance on a new German challenge set of minimal pairs. (arXiv:2306.04523v1 [cs.CL])\nAbstract: Compared to English, German word order is freer and therefore poses additional challenges for natural language inference (NLI). We create WOGLI (Word Order in German Language Inference), the first adversarial NLI dataset for German word order that has the following properties: (i) each premise has an entailed and a non-entailed hypothesis; (ii) premise and hypotheses differ only in word order and necessary morphological changes to mark case and number. In particular, each premise andits two hypotheses contain exactly the same lemmata. Our adversarial examples require the model to use morphological markers in order to recognise or reject entailment. We show that current German autoencoding models fine-tuned on translated NLI data can struggle on this challenge set, reflecting the fact that translated NLI datasets will not mirror all necessary language phenomena in the target language. We also examine performance after data augmentation as well as on related word order phenomena derived ",
    "path": "papers/23/06/2306.04523.json",
    "total_tokens": 1001,
    "translated_title": "当前的NLI系统能够处理德语语序吗？研究语言模型在一个新的德语挑战数据集上的表现（arXiv:2306.04523v1 [cs.CL]）",
    "translated_abstract": "与英语相比，德语的语序更为自由，因此给自然语言推理(NLI)带来了额外的挑战。我们创建了WOGLI(德语语序自然语言推理的对抗性数据集)，是第一个拥有以下特性的德语对抗性NLI数据集：(i)每个前提都有一个蕴含和一个非蕴含的假设；(ii)前提和假设仅在语序和必要的形态变化以标记格和数方面有所不同。特别地，每个前提和其两个假设包含完全相同的词根。我们的对抗性例子要求模型使用形态标记来识别或拒绝蕴含关系。我们展示了目前在翻译后的NLI数据上微调的德语自编码模型在这个挑战数据集上会遇到困难，反映了翻译后的NLI数据集不能反映目标语言中所有必要的语言现象。我们还在数据增强后和相关的语序现象上检查了模型的表现。",
    "tldr": "本研究创建了第一个德语语序自然语言推理的对抗性数据集WOGLI，证明了在当前翻译后的NLI数据上微调的德语自编码模型在这个数据集上表现差，需要使用形态标记进行推理。",
    "en_tdlr": "This study created the first adversarial NLI dataset for German word order, WOGLI, and demonstrated that current German autoencoding models fine-tuned on translated NLI data struggle on this dataset, highlighting the inadequacy of translated NLI datasets in reflecting necessary language phenomena. The study also showed the importance of using morphological markers in NLI for German word order."
}