{
    "title": "Detection and classification of faults aimed at preventive maintenance of PV systems. (arXiv:2306.08004v1 [cs.LG])",
    "abstract": "Diagnosis in PV systems aims to detect, locate and identify faults. Diagnosing these faults is vital to guarantee energy production and extend the useful life of PV power plants. In the literature, multiple machine learning approaches have been proposed for this purpose. However, few of these works have paid special attention to the detection of fine faults and the specialized process of extraction and selection of features for their classification. A fine fault is one whose characteristic signature is difficult to distinguish to that of a healthy panel. As a contribution to the detection of fine faults (especially of the snail trail type), this article proposes an innovative approach based on the Random Forest (RF) algorithm. This approach uses a complex feature extraction and selection method that improves the computational time of fault classification while maintaining high accuracy.",
    "link": "http://arxiv.org/abs/2306.08004",
    "context": "Title: Detection and classification of faults aimed at preventive maintenance of PV systems. (arXiv:2306.08004v1 [cs.LG])\nAbstract: Diagnosis in PV systems aims to detect, locate and identify faults. Diagnosing these faults is vital to guarantee energy production and extend the useful life of PV power plants. In the literature, multiple machine learning approaches have been proposed for this purpose. However, few of these works have paid special attention to the detection of fine faults and the specialized process of extraction and selection of features for their classification. A fine fault is one whose characteristic signature is difficult to distinguish to that of a healthy panel. As a contribution to the detection of fine faults (especially of the snail trail type), this article proposes an innovative approach based on the Random Forest (RF) algorithm. This approach uses a complex feature extraction and selection method that improves the computational time of fault classification while maintaining high accuracy.",
    "path": "papers/23/06/2306.08004.json",
    "total_tokens": 808,
    "translated_title": "检测与分类旨在预防光伏系统故障的论文。",
    "translated_abstract": "光伏系统的诊断旨在检测、定位和识别故障。诊断这些故障对于保证能源生产和延长光伏发电厂的使用寿命至关重要。在文献中，已经为此提出了多种机器学习方法。然而，这些研究中很少有关注细微故障的检测和专门的特征提取和分类选择过程。细微故障是一种其特征签名与健康面板的特征签名难以区别的故障。作为检测细微故障的贡献，本研究提出了一种基于随机森林（RF）算法的创新方法。这种方法使用复杂的特征提取和选择方法，提高了故障分类的计算时间，同时保持了高精度。",
    "tldr": "本论文提出了一种随机森林算法的创新方法，用于检测细微的光伏故障并进行分类，提高了故障分类的计算时间，同时保持了高精度。",
    "en_tdlr": "This paper proposes an innovative approach based on the Random Forest algorithm for detecting and classifying fine faults in PV systems, improving the computational time of fault classification while maintaining high accuracy."
}