{
    "title": "Von Mises Mixture Distributions for Molecular Conformation Generation. (arXiv:2306.07472v1 [physics.chem-ph])",
    "abstract": "Molecules are frequently represented as graphs, but the underlying 3D molecular geometry (the locations of the atoms) ultimately determines most molecular properties. However, most molecules are not static and at room temperature adopt a wide variety of geometries or $\\textit{conformations}$. The resulting distribution on geometries $p(x)$ is known as the Boltzmann distribution, and many molecular properties are expectations computed under this distribution. Generating accurate samples from the Boltzmann distribution is therefore essential for computing these expectations accurately. Traditional sampling-based methods are computationally expensive, and most recent machine learning-based methods have focused on identifying $\\textit{modes}$ in this distribution rather than generating true $\\textit{samples}$. Generating such samples requires capturing conformational variability, and it has been widely recognized that the majority of conformational variability in molecules arises from rota",
    "link": "http://arxiv.org/abs/2306.07472",
    "context": "Title: Von Mises Mixture Distributions for Molecular Conformation Generation. (arXiv:2306.07472v1 [physics.chem-ph])\nAbstract: Molecules are frequently represented as graphs, but the underlying 3D molecular geometry (the locations of the atoms) ultimately determines most molecular properties. However, most molecules are not static and at room temperature adopt a wide variety of geometries or $\\textit{conformations}$. The resulting distribution on geometries $p(x)$ is known as the Boltzmann distribution, and many molecular properties are expectations computed under this distribution. Generating accurate samples from the Boltzmann distribution is therefore essential for computing these expectations accurately. Traditional sampling-based methods are computationally expensive, and most recent machine learning-based methods have focused on identifying $\\textit{modes}$ in this distribution rather than generating true $\\textit{samples}$. Generating such samples requires capturing conformational variability, and it has been widely recognized that the majority of conformational variability in molecules arises from rota",
    "path": "papers/23/06/2306.07472.json",
    "total_tokens": 869,
    "translated_title": "Von Mises混合分布用于分子构象生成",
    "translated_abstract": "分子经常被表示为图形，但是基础的三维分子几何结构（原子的位置）最终决定了大多数分子性质。然而，大多数分子在常温下都不是静态的，并采取各种各样的几何结构或$\\textit{构象}$。由此产生的几何结构分布$p(x)$称为玻尔兹曼分布，许多分子性质都是在该分布下计算的期望。因此，准确地从玻尔兹曼分布中生成样本对于准确计算这些期望至关重要。传统的基于采样的方法计算成本很高，大部分最近的基于机器学习的方法专注于识别该分布中的$\\textit{模式}$，而不是生成真正的$\\textit{样本}$。生成这样的样本需要捕捉构象变异性，人们广泛认为分子的大多数构象变异性来自于化学键的旋转。",
    "tldr": "传统的分子几何结构采样方法计算成本很高，而机器学习方法多数专注于分布中的模式识别。本文提出的Von Mises混合分布用于生成更准确的样本。",
    "en_tdlr": "Traditional methods for molecular conformation generation are computationally expensive, and most recent machine learning-based methods focus on identifying modes in the distribution rather than generating true samples. This paper proposes the use of Von Mises mixture distributions for generating more accurate conformations."
}