{
    "title": "Robust Data-driven Prescriptiveness Optimization. (arXiv:2306.05937v1 [math.OC])",
    "abstract": "The abundance of data has led to the emergence of a variety of optimization techniques that attempt to leverage available side information to provide more anticipative decisions. The wide range of methods and contexts of application have motivated the design of a universal unitless measure of performance known as the coefficient of prescriptiveness. This coefficient was designed to quantify both the quality of contextual decisions compared to a reference one and the prescriptive power of side information. To identify policies that maximize the former in a data-driven context, this paper introduces a distributionally robust contextual optimization model where the coefficient of prescriptiveness substitutes for the classical empirical risk minimization objective. We present a bisection algorithm to solve this model, which relies on solving a series of linear programs when the distributional ambiguity set has an appropriate nested form and polyhedral structure. Studying a contextual short",
    "link": "http://arxiv.org/abs/2306.05937",
    "context": "Title: Robust Data-driven Prescriptiveness Optimization. (arXiv:2306.05937v1 [math.OC])\nAbstract: The abundance of data has led to the emergence of a variety of optimization techniques that attempt to leverage available side information to provide more anticipative decisions. The wide range of methods and contexts of application have motivated the design of a universal unitless measure of performance known as the coefficient of prescriptiveness. This coefficient was designed to quantify both the quality of contextual decisions compared to a reference one and the prescriptive power of side information. To identify policies that maximize the former in a data-driven context, this paper introduces a distributionally robust contextual optimization model where the coefficient of prescriptiveness substitutes for the classical empirical risk minimization objective. We present a bisection algorithm to solve this model, which relies on solving a series of linear programs when the distributional ambiguity set has an appropriate nested form and polyhedral structure. Studying a contextual short",
    "path": "papers/23/06/2306.05937.json",
    "total_tokens": 871,
    "translated_title": "鲁棒的数据驱动处方优化",
    "translated_abstract": "巨量的数据促进了各种优化技术的出现，旨在利用现有的侧面信息提供更具预判性的决策。广泛的方法和应用背景促进了设计一种称为处方性系数的通用无单位性能指标的产生。该系数旨在量化上下文决策的质量与参考决策以及侧面信息的处方能力。为了在数据驱动的情况下确定最大化前者的策略，本文引入了一种分布式鲁棒的上下文优化模型，其中处方性系数代替了经典的经验风险最小化目标。我们提出了一个双分法算法来解决这个模型，当分布不确定性集合具有适当的嵌套形式和多面体结构时，该算法依赖于解决一系列线性规划问题。本文研究了上下文短语的应用。",
    "tldr": "本文提出了一种鲁棒的数据驱动优化模型，其中处方性系数代替了经验风险最小化目标，可用于确定最大化上下文决策质量和参考决策以及侧面信息处方能力的最佳策略。",
    "en_tdlr": "This paper proposes a robust data-driven optimization model, in which the coefficient of prescriptiveness substitutes for the classical empirical risk minimization objective, to determine the optimal strategy that maximizes the quality of contextual decisions compared to a reference one and the prescriptive power of side information."
}