{
    "title": "BoardgameQA: A Dataset for Natural Language Reasoning with Contradictory Information. (arXiv:2306.07934v1 [cs.CL])",
    "abstract": "Automated reasoning with unstructured natural text is a key requirement for many potential applications of NLP and for developing robust AI systems. Recently, Language Models (LMs) have demonstrated complex reasoning capacities even without any finetuning. However, existing evaluation for automated reasoning assumes access to a consistent and coherent set of information over which models reason. When reasoning in the real-world, the available information is frequently inconsistent or contradictory, and therefore models need to be equipped with a strategy to resolve such conflicts when they arise. One widely-applicable way of resolving conflicts is to impose preferences over information sources (e.g., based on source credibility or information recency) and adopt the source with higher preference. In this paper, we formulate the problem of reasoning with contradictory information guided by preferences over sources as the classical problem of defeasible reasoning, and develop a dataset ca",
    "link": "http://arxiv.org/abs/2306.07934",
    "context": "Title: BoardgameQA: A Dataset for Natural Language Reasoning with Contradictory Information. (arXiv:2306.07934v1 [cs.CL])\nAbstract: Automated reasoning with unstructured natural text is a key requirement for many potential applications of NLP and for developing robust AI systems. Recently, Language Models (LMs) have demonstrated complex reasoning capacities even without any finetuning. However, existing evaluation for automated reasoning assumes access to a consistent and coherent set of information over which models reason. When reasoning in the real-world, the available information is frequently inconsistent or contradictory, and therefore models need to be equipped with a strategy to resolve such conflicts when they arise. One widely-applicable way of resolving conflicts is to impose preferences over information sources (e.g., based on source credibility or information recency) and adopt the source with higher preference. In this paper, we formulate the problem of reasoning with contradictory information guided by preferences over sources as the classical problem of defeasible reasoning, and develop a dataset ca",
    "path": "papers/23/06/2306.07934.json",
    "total_tokens": 671,
    "translated_title": "BoardgameQA: 一种用于带有矛盾信息的自然语言推理数据集",
    "translated_abstract": "自然语言文本的自动推理是许多潜在NLP应用和开发强大AI系统的关键要求。本文针对存在不一致和矛盾信息的推理问题提出一种解决策略，将问题形式化为经典的可推翻推理问题，并开发了一种数据集。",
    "tldr": "本文提出了一个用于带有矛盾信息的自然语言推理的数据集，以解决推理中不一致和矛盾信息的问题，同时提供了一种可推翻推理策略。"
}