{
    "title": "Energy-Efficient Downlink Semantic Generative Communication with Text-to-Image Generators. (arXiv:2306.05041v1 [cs.LG])",
    "abstract": "In this paper, we introduce a novel semantic generative communication (SGC) framework, where generative users leverage text-to-image (T2I) generators to create images locally from downloaded text prompts, while non-generative users directly download images from a base station (BS). Although generative users help reduce downlink transmission energy at the BS, they consume additional energy for image generation and for uploading their generator state information (GSI). We formulate the problem of minimizing the total energy consumption of the BS and the users, and devise a generative user selection algorithm. Simulation results corroborate that our proposed algorithm reduces total energy by up to 54% compared to a baseline with all non-generative users.",
    "link": "http://arxiv.org/abs/2306.05041",
    "context": "Title: Energy-Efficient Downlink Semantic Generative Communication with Text-to-Image Generators. (arXiv:2306.05041v1 [cs.LG])\nAbstract: In this paper, we introduce a novel semantic generative communication (SGC) framework, where generative users leverage text-to-image (T2I) generators to create images locally from downloaded text prompts, while non-generative users directly download images from a base station (BS). Although generative users help reduce downlink transmission energy at the BS, they consume additional energy for image generation and for uploading their generator state information (GSI). We formulate the problem of minimizing the total energy consumption of the BS and the users, and devise a generative user selection algorithm. Simulation results corroborate that our proposed algorithm reduces total energy by up to 54% compared to a baseline with all non-generative users.",
    "path": "papers/23/06/2306.05041.json",
    "total_tokens": 812,
    "translated_title": "能源高效的下行语义生成通信与文本到图像生成器",
    "translated_abstract": "本文引入了一种新颖的语义生成通信 (SGC) 框架，在该框架中，生成型用户利用文本到图像 (T2I) 生成器从下载的文本提示本地创建图像，而非生成型用户直接从基站 (BS) 下载图像。虽然生成型用户帮助减少了基站下行传输能量，但它们消耗了额外的能源用于图像生成和上传它们的生成器状态信息 (GSI)。我们制定了一个生成用户选择算法，来解决最小化基站和用户总能量消耗的问题。仿真结果证实，与所有非生成型用户的基线相比，我们提出的算法将总能量消耗降低了高达 54%。",
    "tldr": "本论文提出了一种语义生成通信框架，在该框架中，生成型用户利用文本到图像生成器来创建本地图像，从而减少基站下行传输能量消耗，但会增加用户能源消耗。通过生成用户选择算法，总能耗可以降低高达54%。",
    "en_tdlr": "This paper proposes a semantic generative communication framework where generative users use text-to-image generators to create local images and reduce downlink energy consumption at the base station, but may increase their own energy consumption. A generative user selection algorithm is devised to minimize total energy consumption, leading to up to 54% reduction compared to a baseline with all non-generative users."
}