{
    "title": "Unsupervised Polychromatic Neural Representation for CT Metal Artifact Reduction. (arXiv:2306.15203v1 [eess.IV])",
    "abstract": "Emerging neural reconstruction techniques based on tomography (e.g., NeRF, NeAT, and NeRP) have started showing unique capabilities in medical imaging. In this work, we present a novel Polychromatic neural representation (Polyner) to tackle the challenging problem of CT imaging when metallic implants exist within the human body. The artifacts arise from the drastic variation of metal's attenuation coefficients at various energy levels of the X-ray spectrum, leading to a nonlinear metal effect in CT measurements. Reconstructing CT images from metal-affected measurements hence poses a complicated nonlinear inverse problem where empirical models adopted in previous metal artifact reduction (MAR) approaches lead to signal loss and strongly aliased reconstructions. Polyner instead models the MAR problem from a nonlinear inverse problem perspective. Specifically, we first derive a polychromatic forward model to accurately simulate the nonlinear CT acquisition process. Then, we incorporate ou",
    "link": "http://arxiv.org/abs/2306.15203",
    "context": "Title: Unsupervised Polychromatic Neural Representation for CT Metal Artifact Reduction. (arXiv:2306.15203v1 [eess.IV])\nAbstract: Emerging neural reconstruction techniques based on tomography (e.g., NeRF, NeAT, and NeRP) have started showing unique capabilities in medical imaging. In this work, we present a novel Polychromatic neural representation (Polyner) to tackle the challenging problem of CT imaging when metallic implants exist within the human body. The artifacts arise from the drastic variation of metal's attenuation coefficients at various energy levels of the X-ray spectrum, leading to a nonlinear metal effect in CT measurements. Reconstructing CT images from metal-affected measurements hence poses a complicated nonlinear inverse problem where empirical models adopted in previous metal artifact reduction (MAR) approaches lead to signal loss and strongly aliased reconstructions. Polyner instead models the MAR problem from a nonlinear inverse problem perspective. Specifically, we first derive a polychromatic forward model to accurately simulate the nonlinear CT acquisition process. Then, we incorporate ou",
    "path": "papers/23/06/2306.15203.json",
    "total_tokens": 1036,
    "translated_title": "无监督的多色彩神经表示法用于CT金属伪影减少",
    "translated_abstract": "新兴的基于层析术的神经重建技术（如NeRF，NeAT和NeRP）在医学成像方面已经展示出独特的能力。在本文中，我们提出了一种新颖的多色彩神经表示法（Polyner）来解决CT成像中存在人体金属植入物时的挑战性问题。金属伪影是由于X射线能谱不同能量级金属的衰减系数剧烈变化而产生的，导致CT测量中的非线性金属效应。因此，从受金属影响的测量中重建CT图像是一个复杂的非线性反问题，先前的金属伪影减少（MAR）方法中采用的经验模型导致信号损失和强烈的混叠重建。Polyner从非线性反问题的角度对MAR问题进行建模。具体而言，我们首先推导出多色彩正演模型，以准确模拟非线性CT采集过程。然后，我们将据此设计一个无监督训练的神经网络架构，用于从金属伪影的CT投影图中恢复出原始的物体信息。我们通过对实际CT数据集进行了广泛实验证明了Polyner的有效性。",
    "tldr": "本文提出了一种新颖的多色彩神经表示法（Polyner），用于解决CT成像中存在金属伪影的挑战性问题。Polyner通过建模非线性反问题，准确模拟CT采集过程，并利用无监督训练的神经网络架构恢复原始物体信息。实验证明Polyner在金属伪影减少方面的有效性。",
    "en_tdlr": "This paper proposes a novel Polychromatic neural representation (Polyner) to address the challenging problem of CT imaging with metal artifacts. Polyner accurately models the nonlinear CT acquisition process and utilizes an unsupervised trained neural network architecture to recover the original object information. Experimental results demonstrate the effectiveness of Polyner in metal artifact reduction."
}