{
    "title": "Neural Astrophysical Wind Models. (arXiv:2306.11666v2 [astro-ph.GA] UPDATED)",
    "abstract": "The bulk kinematics and thermodynamics of hot supernovae-driven galactic winds is critically dependent on both the amount of swept up cool clouds and non-spherical collimated flow geometry. However, accurately parameterizing these physics is difficult because their functional forms are often unknown, and because the coupled non-linear flow equations contain singularities. We show that deep neural networks embedded as individual terms in the governing coupled ordinary differential equations (ODEs) can robustly discover both of these physics, without any prior knowledge of the true function structure, as a supervised learning task. We optimize a loss function based on the Mach number, rather than the explicitly solved-for 3 conserved variables, and apply a penalty term towards near-diverging solutions. The same neural network architecture is used for learning both the hidden mass-loading and surface area expansion rates. This work further highlights the feasibility of neural ODEs as a pr",
    "link": "http://arxiv.org/abs/2306.11666",
    "context": "Title: Neural Astrophysical Wind Models. (arXiv:2306.11666v2 [astro-ph.GA] UPDATED)\nAbstract: The bulk kinematics and thermodynamics of hot supernovae-driven galactic winds is critically dependent on both the amount of swept up cool clouds and non-spherical collimated flow geometry. However, accurately parameterizing these physics is difficult because their functional forms are often unknown, and because the coupled non-linear flow equations contain singularities. We show that deep neural networks embedded as individual terms in the governing coupled ordinary differential equations (ODEs) can robustly discover both of these physics, without any prior knowledge of the true function structure, as a supervised learning task. We optimize a loss function based on the Mach number, rather than the explicitly solved-for 3 conserved variables, and apply a penalty term towards near-diverging solutions. The same neural network architecture is used for learning both the hidden mass-loading and surface area expansion rates. This work further highlights the feasibility of neural ODEs as a pr",
    "path": "papers/23/06/2306.11666.json",
    "total_tokens": 864,
    "tldr": "本文使用神经网络作为常微分方程中的项，无需先验知识发现了天体物理中的重要物理量，并表明了神经常微分方程作为研究物理现象的可行工具。"
}