{
    "title": "Emotion Flip Reasoning in Multiparty Conversations. (arXiv:2306.13959v1 [cs.CL])",
    "abstract": "In a conversational dialogue, speakers may have different emotional states and their dynamics play an important role in understanding dialogue's emotional discourse. However, simply detecting emotions is not sufficient to entirely comprehend the speaker-specific changes in emotion that occur during a conversation. To understand the emotional dynamics of speakers in an efficient manner, it is imperative to identify the rationale or instigator behind any changes or flips in emotion expressed by the speaker. In this paper, we explore the task called Instigator based Emotion Flip Reasoning (EFR), which aims to identify the instigator behind a speaker's emotion flip within a conversation. For example, an emotion flip from joy to anger could be caused by an instigator like threat. To facilitate this task, we present MELD-I, a dataset that includes ground-truth EFR instigator labels, which are in line with emotional psychology. To evaluate the dataset, we propose a novel neural architecture c",
    "link": "http://arxiv.org/abs/2306.13959",
    "context": "Title: Emotion Flip Reasoning in Multiparty Conversations. (arXiv:2306.13959v1 [cs.CL])\nAbstract: In a conversational dialogue, speakers may have different emotional states and their dynamics play an important role in understanding dialogue's emotional discourse. However, simply detecting emotions is not sufficient to entirely comprehend the speaker-specific changes in emotion that occur during a conversation. To understand the emotional dynamics of speakers in an efficient manner, it is imperative to identify the rationale or instigator behind any changes or flips in emotion expressed by the speaker. In this paper, we explore the task called Instigator based Emotion Flip Reasoning (EFR), which aims to identify the instigator behind a speaker's emotion flip within a conversation. For example, an emotion flip from joy to anger could be caused by an instigator like threat. To facilitate this task, we present MELD-I, a dataset that includes ground-truth EFR instigator labels, which are in line with emotional psychology. To evaluate the dataset, we propose a novel neural architecture c",
    "path": "papers/23/06/2306.13959.json",
    "total_tokens": 817,
    "translated_title": "多方会话中的情感反转推理",
    "translated_abstract": "在对话中，说话者可能有不同的情感状态，它们的动态在理解情感话语中起着重要作用。然而，仅仅检测情感并不足以完全理解会话过程中发生的说话者特定情感变化。为了高效地理解说话者的情感动态，有必要确定导致说话者情感翻转的原因或推动者。在本文中，我们探讨了名为Instigator based Emotion Flip Reasoning (EFR) 的任务，旨在识别会话中说话者情感翻转背后的推动者。例如，从快乐到愤怒的情感翻转可能是由威胁这样的推动者引起的。为了实现这个任务，我们提出了一个包括符合情感心理学标准的EFR推动者标签的数据集MELD-I。为了评估数据集，我们提出了一个新颖的神经架构c。",
    "tldr": "本文旨在识别说话者情感翻转背后的推动者，提出了一个数据集和神经架构c进行支持。"
}