{
    "title": "Underwater Acoustic Target Recognition based on Smoothness-inducing Regularization and Spectrogram-based Data Augmentation",
    "abstract": "arXiv:2306.06945v2 Announce Type: replace-cross  Abstract: Underwater acoustic target recognition is a challenging task owing to the intricate underwater environments and limited data availability. Insufficient data can hinder the ability of recognition systems to support complex modeling, thus impeding their advancement. To improve the generalization capacity of recognition models, techniques such as data augmentation have been employed to simulate underwater signals and diversify data distribution. However, the complexity of underwater environments can cause the simulated signals to deviate from real scenarios, resulting in biased models that are misguided by non-true data. In this study, we propose two strategies to enhance the generalization ability of models in the case of limited data while avoiding the risk of performance degradation. First, as an alternative to traditional data augmentation, we utilize smoothness-inducing regularization, which only incorporates simulated signal",
    "link": "https://arxiv.org/abs/2306.06945",
    "context": "Title: Underwater Acoustic Target Recognition based on Smoothness-inducing Regularization and Spectrogram-based Data Augmentation\nAbstract: arXiv:2306.06945v2 Announce Type: replace-cross  Abstract: Underwater acoustic target recognition is a challenging task owing to the intricate underwater environments and limited data availability. Insufficient data can hinder the ability of recognition systems to support complex modeling, thus impeding their advancement. To improve the generalization capacity of recognition models, techniques such as data augmentation have been employed to simulate underwater signals and diversify data distribution. However, the complexity of underwater environments can cause the simulated signals to deviate from real scenarios, resulting in biased models that are misguided by non-true data. In this study, we propose two strategies to enhance the generalization ability of models in the case of limited data while avoiding the risk of performance degradation. First, as an alternative to traditional data augmentation, we utilize smoothness-inducing regularization, which only incorporates simulated signal",
    "path": "papers/23/06/2306.06945.json",
    "total_tokens": 841,
    "translated_title": "基于平滑度诱导正则化和基于频谱图的数据增强的水下声学目标识别",
    "translated_abstract": "水下声学目标识别是一项具有挑战性的任务，这归因于复杂的水下环境和有限的数据可用性。数据不足可能会阻碍识别系统支持复杂建模的能力，从而阻碍其发展。为了提高识别模型的泛化能力，已经采用了诸如数据增强之类的技术来模拟水下信号并丰富数据分布。然而，水下环境的复杂性可能导致模拟信号偏离真实场景，导致受到非真实数据误导的偏见模型。在本研究中，我们提出了两种策略，可以在数据有限的情况下增强模型的泛化能力，同时避免性能降级的风险。首先，作为替代传统数据增强的方法，我们利用平滑度诱导正则化，该方法仅纳入模拟信号",
    "tldr": "通过平滑度诱导正则化和基于频谱图的数据增强，提高水下声学目标识别模型的泛化能力和避免性能降级的风险"
}