{
    "title": "Deploying a Robust Active Preference Elicitation Algorithm: Experiment Design, Interface, and Evaluation for COVID-19 Patient Prioritization. (arXiv:2306.04061v1 [cs.HC])",
    "abstract": "Preference elicitation leverages AI or optimization to learn stakeholder preferences in settings ranging from marketing to public policy. The online robust preference elicitation procedure of arXiv:2003.01899 has been shown in simulation to outperform various other elicitation procedures in terms of effectively learning individuals' true utilities. However, as with any simulation, the method makes a series of assumptions that cannot easily be verified to hold true beyond simulation. Thus, we propose to validate the robust method's performance in deployment, focused on the particular challenge of selecting policies for prioritizing COVID-19 patients for scarce hospital resources during the pandemic. To this end, we develop an online platform for preference elicitation where users report their preferences between alternatives over a moderate number of pairwise comparisons chosen by a particular elicitation procedure. We recruit Amazon Mechanical Turk workers ($n$ = 193) to report their p",
    "link": "http://arxiv.org/abs/2306.04061",
    "context": "Title: Deploying a Robust Active Preference Elicitation Algorithm: Experiment Design, Interface, and Evaluation for COVID-19 Patient Prioritization. (arXiv:2306.04061v1 [cs.HC])\nAbstract: Preference elicitation leverages AI or optimization to learn stakeholder preferences in settings ranging from marketing to public policy. The online robust preference elicitation procedure of arXiv:2003.01899 has been shown in simulation to outperform various other elicitation procedures in terms of effectively learning individuals' true utilities. However, as with any simulation, the method makes a series of assumptions that cannot easily be verified to hold true beyond simulation. Thus, we propose to validate the robust method's performance in deployment, focused on the particular challenge of selecting policies for prioritizing COVID-19 patients for scarce hospital resources during the pandemic. To this end, we develop an online platform for preference elicitation where users report their preferences between alternatives over a moderate number of pairwise comparisons chosen by a particular elicitation procedure. We recruit Amazon Mechanical Turk workers ($n$ = 193) to report their p",
    "path": "papers/23/06/2306.04061.json",
    "total_tokens": 876,
    "translated_title": "部署一个强健的积极偏好调查算法：COVID-19患者优先排序的实验设计、界面和评估",
    "translated_abstract": "偏好调查利用AI或优化来学习从市场到公共政策等各种情况下的利益相关者的偏好。arXiv:2003.01899的在线健壮偏好调查流程在模拟中表现出优于其他偏好调查流程的效果，可以有效地学习个体的真实效用。然而，与任何模拟一样，该方法做出了一系列无法轻易验证是否在模拟以外成立的假设。因此，我们建议验证这种健壮方法在部署中的表现，重点关注选择COVID-19患者的政策，以优先为疫情期间的医院资源提供服务。为此，我们开发了一个在线偏好调查平台，用户通过特定的偏好调查过程报告他们在少量成对比较中的偏好。我们招募了193位Amazon Mechanical Turk工作者来报告他们的偏好。",
    "tldr": "本论文介绍了一种强健的偏好调查算法，旨在优先为COVID-19患者提供医院资源，通过招募亚马逊机械土耳其工作者对该算法进行评估。",
    "en_tdlr": "This paper introduces a robust preference elicitation algorithm aimed at prioritizing hospital resources for COVID-19 patients. The algorithm is evaluated by recruiting Amazon Mechanical Turk workers."
}