{
    "title": "Towards Blockchain-Assisted Privacy-Aware Data Sharing For Edge Intelligence: A Smart Healthcare Perspective. (arXiv:2306.16630v1 [cs.CR])",
    "abstract": "The popularization of intelligent healthcare devices and big data analytics significantly boosts the development of smart healthcare networks (SHNs). To enhance the precision of diagnosis, different participants in SHNs share health data that contains sensitive information. Therefore, the data exchange process raises privacy concerns, especially when the integration of health data from multiple sources (linkage attack) results in further leakage. Linkage attack is a type of dominant attack in the privacy domain, which can leverage various data sources for private data mining. Furthermore, adversaries launch poisoning attacks to falsify the health data, which leads to misdiagnosing or even physical damage. To protect private health data, we propose a personalized differential privacy model based on the trust levels among users. The trust is evaluated by a defined community density, while the corresponding privacy protection level is mapped to controllable randomized noise constrained by",
    "link": "http://arxiv.org/abs/2306.16630",
    "context": "Title: Towards Blockchain-Assisted Privacy-Aware Data Sharing For Edge Intelligence: A Smart Healthcare Perspective. (arXiv:2306.16630v1 [cs.CR])\nAbstract: The popularization of intelligent healthcare devices and big data analytics significantly boosts the development of smart healthcare networks (SHNs). To enhance the precision of diagnosis, different participants in SHNs share health data that contains sensitive information. Therefore, the data exchange process raises privacy concerns, especially when the integration of health data from multiple sources (linkage attack) results in further leakage. Linkage attack is a type of dominant attack in the privacy domain, which can leverage various data sources for private data mining. Furthermore, adversaries launch poisoning attacks to falsify the health data, which leads to misdiagnosing or even physical damage. To protect private health data, we propose a personalized differential privacy model based on the trust levels among users. The trust is evaluated by a defined community density, while the corresponding privacy protection level is mapped to controllable randomized noise constrained by",
    "path": "papers/23/06/2306.16630.json",
    "total_tokens": 982,
    "translated_title": "面向边缘智能的区块链辅助隐私感知数据共享：智慧医疗视角",
    "translated_abstract": "智能医疗设备和大数据分析的普及显著推动了智慧医疗网络（SHNs）的发展。为了提高诊断的准确性，SHNs中的不同参与者共享包含敏感信息的健康数据。因此，数据交换过程引发了隐私问题，特别是当来自多个来源的健康数据（链结攻击）的整合导致进一步泄露时。链结攻击是隐私领域中一种主要攻击类型，可以利用各种数据源进行隐私数据挖掘。此外，对手发动污染攻击以篡改健康数据，导致误诊甚至身体损害。为了保护私人健康数据，我们提出了基于用户之间信任水平的个性化差分隐私模型。信任是通过定义的社区密度来评估的，而相应的隐私保护级别则映射到可控随机噪声，并受到约束。",
    "tldr": "这篇论文提出了一个基于区块链的隐私感知数据共享模型，用于保护智慧医疗网络中的个人健康数据。通过评估用户之间的信任水平，使用者可以选择不同的隐私保护级别，并使用差分隐私技术和可控随机噪声保护数据的隐私性，以应对链结攻击和污染攻击的威胁。"
}