{
    "title": "Massively Multilingual Corpus of Sentiment Datasets and Multi-faceted Sentiment Classification Benchmark. (arXiv:2306.07902v1 [cs.CL])",
    "abstract": "Despite impressive advancements in multilingual corpora collection and model training, developing large-scale deployments of multilingual models still presents a significant challenge. This is particularly true for language tasks that are culture-dependent. One such example is the area of multilingual sentiment analysis, where affective markers can be subtle and deeply ensconced in culture. This work presents the most extensive open massively multilingual corpus of datasets for training sentiment models. The corpus consists of 79 manually selected datasets from over 350 datasets reported in the scientific literature based on strict quality criteria. The corpus covers 27 languages representing 6 language families. Datasets can be queried using several linguistic and functional features. In addition, we present a multi-faceted sentiment classification benchmark summarizing hundreds of experiments conducted on different base models, training objectives, dataset collections, and fine-tunin",
    "link": "http://arxiv.org/abs/2306.07902",
    "context": "Title: Massively Multilingual Corpus of Sentiment Datasets and Multi-faceted Sentiment Classification Benchmark. (arXiv:2306.07902v1 [cs.CL])\nAbstract: Despite impressive advancements in multilingual corpora collection and model training, developing large-scale deployments of multilingual models still presents a significant challenge. This is particularly true for language tasks that are culture-dependent. One such example is the area of multilingual sentiment analysis, where affective markers can be subtle and deeply ensconced in culture. This work presents the most extensive open massively multilingual corpus of datasets for training sentiment models. The corpus consists of 79 manually selected datasets from over 350 datasets reported in the scientific literature based on strict quality criteria. The corpus covers 27 languages representing 6 language families. Datasets can be queried using several linguistic and functional features. In addition, we present a multi-faceted sentiment classification benchmark summarizing hundreds of experiments conducted on different base models, training objectives, dataset collections, and fine-tunin",
    "path": "papers/23/06/2306.07902.json",
    "total_tokens": 933,
    "translated_title": "大规模多语言情感数据集和多方面情感分类基准的语料库。",
    "translated_abstract": "尽管多语言语料库和模型训练取得了令人瞩目的进展，但开发大规模的多语言模型仍然是一个重大挑战。这在文化相关的语言任务中尤其如此。多语言情感分析就是一个例子，其中情感标记可能非常微妙且深深植根于文化中。本文介绍了可用于训练情感模型的最全面的开放式大规模多语言数据集的语料库。该语料库由79个手动选择的数据集组成，它们是基于严格的质量标准从科学文献中报告的超过350个数据集中选出的。该语料库涵盖了27种语言，代表了6种语言家族。数据集可以使用几个语言和功能特征进行查询。此外，我们提供了一个多方面的情感分类基准，总结了对不同的基本模型、训练目标、数据集集合和微调进行的数百个实验。",
    "tldr": "本研究介绍了一种可以用于训练情感模型的最全面的开放式大规模多语言数据集，该数据集由79个手动选定的数据集组成，覆盖了27种语言，代表了6种语言家族。而且，我们还提供了一个多方面的情感分类基准。",
    "en_tdlr": "This paper presents a comprehensive open massively multilingual corpus of datasets for training sentiment models, consisting of 79 manually selected datasets from over 350 reported in scientific literature, covering 27 languages representing 6 language families, and a multi-faceted sentiment classification benchmark summarizing hundreds of experiments on different base models, training objectives, dataset collections, and fine-tuning."
}