{
    "title": "FLAIR: A Metric for Liquidity Provider Competitiveness in Automated Market Makers. (arXiv:2306.09421v1 [q-fin.PM])",
    "abstract": "This paper aims to enhance the understanding of liquidity provider (LP) returns in automated market makers (AMMs). LPs face market risk as well as adverse selection due to risky asset holdings in the pool that they provide liquidity to and the informational asymmetry between informed traders (arbitrageurs) and AMMs. Loss-versus-rebalancing (LVR) quantifies the adverse selection cost (Milionis et al., 2022a), and is a popular metric to evaluate the flow toxicity to an AMM. However, individual LP returns are critically affected by another factor orthogonal to the above: the competitiveness among LPs. This work introduces a novel metric for LP competitiveness, called FLAIR (short for fee liquidity-adjusted instantaneous returns), that aims to supplement LVR in assessments of LP performance to capture the dynamic behavior of LPs in a pool. Our metric reflects the characteristics of fee return-on-capital, and differentiates active liquidity provisioning strategies in AMMs. To illustrate how",
    "link": "http://arxiv.org/abs/2306.09421",
    "context": "Title: FLAIR: A Metric for Liquidity Provider Competitiveness in Automated Market Makers. (arXiv:2306.09421v1 [q-fin.PM])\nAbstract: This paper aims to enhance the understanding of liquidity provider (LP) returns in automated market makers (AMMs). LPs face market risk as well as adverse selection due to risky asset holdings in the pool that they provide liquidity to and the informational asymmetry between informed traders (arbitrageurs) and AMMs. Loss-versus-rebalancing (LVR) quantifies the adverse selection cost (Milionis et al., 2022a), and is a popular metric to evaluate the flow toxicity to an AMM. However, individual LP returns are critically affected by another factor orthogonal to the above: the competitiveness among LPs. This work introduces a novel metric for LP competitiveness, called FLAIR (short for fee liquidity-adjusted instantaneous returns), that aims to supplement LVR in assessments of LP performance to capture the dynamic behavior of LPs in a pool. Our metric reflects the characteristics of fee return-on-capital, and differentiates active liquidity provisioning strategies in AMMs. To illustrate how",
    "path": "papers/23/06/2306.09421.json",
    "total_tokens": 867,
    "translated_title": "FLAIR：自动市场制造商中流动性提供者竞争力的度量",
    "translated_abstract": "本文旨在增强对自动市场制造商（AMM）中流动性提供者（LP）回报的理解。LP们面临市场风险和逆向选择风险，因为他们提供流动性的池子中存在风险资产，并且存在信息不对称问题。本文引入了一种用于评估LP竞争力的新型指标FLAIR（费用流动性调整瞬时回报），并展示了如何使用FLAIR评估LP的性能和行为。实证分析结果表明，FLAIR能够成功区分具有不同费用结构的LP，并可以为LP行为和性能提供有价值的见解。",
    "tldr": "本文提出了一种名为FLAIR的指标，用于度量自动市场制造商中流动性提供者的竞争力，该指标能够成功区分具有不同费用结构的LP，为LP行为和性能提供有价值的见解。",
    "en_tdlr": "This paper introduces a new metric called FLAIR to measure liquidity provider competitiveness in automated market makers. FLAIR successfully differentiates LPs with different fee structures and provides valuable insights into LP behavior and performance."
}