{
    "title": "Learning Causal Mechanisms through Orthogonal Neural Networks. (arXiv:2306.03938v1 [cs.LG])",
    "abstract": "A fundamental feature of human intelligence is the ability to infer high-level abstractions from low-level sensory data. An essential component of such inference is the ability to discover modularized generative mechanisms. Despite many efforts to use statistical learning and pattern recognition for finding disentangled factors, arguably human intelligence remains unmatched in this area.  In this paper, we investigate a problem of learning, in a fully unsupervised manner, the inverse of a set of independent mechanisms from distorted data points. We postulate, and justify this claim with experimental results, that an important weakness of existing machine learning solutions lies in the insufficiency of cross-module diversification. Addressing this crucial discrepancy between human and machine intelligence is an important challenge for pattern recognition systems.  To this end, our work proposes an unsupervised method that discovers and disentangles a set of independent mechanisms from u",
    "link": "http://arxiv.org/abs/2306.03938",
    "context": "Title: Learning Causal Mechanisms through Orthogonal Neural Networks. (arXiv:2306.03938v1 [cs.LG])\nAbstract: A fundamental feature of human intelligence is the ability to infer high-level abstractions from low-level sensory data. An essential component of such inference is the ability to discover modularized generative mechanisms. Despite many efforts to use statistical learning and pattern recognition for finding disentangled factors, arguably human intelligence remains unmatched in this area.  In this paper, we investigate a problem of learning, in a fully unsupervised manner, the inverse of a set of independent mechanisms from distorted data points. We postulate, and justify this claim with experimental results, that an important weakness of existing machine learning solutions lies in the insufficiency of cross-module diversification. Addressing this crucial discrepancy between human and machine intelligence is an important challenge for pattern recognition systems.  To this end, our work proposes an unsupervised method that discovers and disentangles a set of independent mechanisms from u",
    "path": "papers/23/06/2306.03938.json",
    "total_tokens": 755,
    "translated_title": "通过正交神经网络学习因果机制",
    "translated_abstract": "人类智能的重要特征之一是能够从低级感官数据中推导出高级抽象。这种推理的一个重要组成部分是发现模块化的生成机制。本文探讨了一个问题，即如何在完全无监督的情况下从失真的数据点中学习一组独立机制的反向操作。我们提出并通过实验结果证明，现有机器学习解决方案的一个重要弱点在于跨模块多样化不足。解决人工智能与机器智能之间的这一重要差距是模式识别系统的重要挑战。为此，本文提出了一种无监督方法，可以发现和分离一组独立的机制。",
    "tldr": "本文介绍了一种无监督的方法来学习一组独立机制的反向操作，以发现和分离一组独立的机制。",
    "en_tdlr": "This paper proposes an unsupervised method to learn the inverse operation of a set of independent mechanisms, to discover and disentangle these mechanisms."
}