{
    "title": "Sustainability criterion implied externality pricing for resource extraction. (arXiv:2306.04065v1 [econ.GN])",
    "abstract": "A dynamic model is constructed that generalises the Hartwick and Van Long (2020) endogenous discounting setup by introducing externalities and asks what implications this has for optimal natural resource extraction with constant consumption. It is shown that a modified form of the Hotelling and Hartwick rule holds in which the externality component of price is a specific function of the instantaneous user costs and cross price elasticities. It is demonstrated that the externality adjusted marginal user cost of remaining natural reserves is equal to the marginal user cost of extracted resources invested in human-made reproducible capital. This lends itself to a discrete form with a readily intuitive economic interpretation that illuminates the stepwise impact of externality pricing on optimal extraction schedules.",
    "link": "http://arxiv.org/abs/2306.04065",
    "context": "Title: Sustainability criterion implied externality pricing for resource extraction. (arXiv:2306.04065v1 [econ.GN])\nAbstract: A dynamic model is constructed that generalises the Hartwick and Van Long (2020) endogenous discounting setup by introducing externalities and asks what implications this has for optimal natural resource extraction with constant consumption. It is shown that a modified form of the Hotelling and Hartwick rule holds in which the externality component of price is a specific function of the instantaneous user costs and cross price elasticities. It is demonstrated that the externality adjusted marginal user cost of remaining natural reserves is equal to the marginal user cost of extracted resources invested in human-made reproducible capital. This lends itself to a discrete form with a readily intuitive economic interpretation that illuminates the stepwise impact of externality pricing on optimal extraction schedules.",
    "path": "papers/23/06/2306.04065.json",
    "total_tokens": 739,
    "translated_title": "资源采集的可持续性标准隐含外部性定价",
    "translated_abstract": "该文构建了一个动态模型，将外部性引入到Hartwick和Van Long（2020）的内生贴现设置中，并询问这对具有恒定消费的自然资源最优采取的影响。结果表明，Hotelling和Hartwick规则的修改形式仍然适用，其中价格的外部性部分是瞬时用户成本和交叉价格弹性的特定函数。它证明了剩余自然储备的外部性调整边际用户成本等于投资于人造再生资本的已开采资源的边际用户成本。这导致了具有直观经济解释的离散形式，解释了外部性定价对最优采伐进度的逐步影响。",
    "tldr": "该文构建了动态模型，应用可持续性标准隐含外部性定价，得出最优采伐进度，并揭示外部性定价对采伐进度的影响。",
    "en_tdlr": "This paper constructs a dynamic model, applies sustainability criteria to imply externality pricing, derives optimal extraction schedules, and illuminates the impact of externality pricing on extraction schedules."
}