{
    "title": "Sufficient Identification Conditions and Semiparametric Estimation under Missing Not at Random Mechanisms. (arXiv:2306.06443v1 [stat.ME])",
    "abstract": "Conducting valid statistical analyses is challenging in the presence of missing-not-at-random (MNAR) data, where the missingness mechanism is dependent on the missing values themselves even conditioned on the observed data. Here, we consider a MNAR model that generalizes several prior popular MNAR models in two ways: first, it is less restrictive in terms of statistical independence assumptions imposed on the underlying joint data distribution, and second, it allows for all variables in the observed sample to have missing values. This MNAR model corresponds to a so-called criss-cross structure considered in the literature on graphical models of missing data that prevents nonparametric identification of the entire missing data model. Nonetheless, part of the complete-data distribution remains nonparametrically identifiable. By exploiting this fact and considering a rich class of exponential family distributions, we establish sufficient conditions for identification of the complete-data ",
    "link": "http://arxiv.org/abs/2306.06443",
    "context": "Title: Sufficient Identification Conditions and Semiparametric Estimation under Missing Not at Random Mechanisms. (arXiv:2306.06443v1 [stat.ME])\nAbstract: Conducting valid statistical analyses is challenging in the presence of missing-not-at-random (MNAR) data, where the missingness mechanism is dependent on the missing values themselves even conditioned on the observed data. Here, we consider a MNAR model that generalizes several prior popular MNAR models in two ways: first, it is less restrictive in terms of statistical independence assumptions imposed on the underlying joint data distribution, and second, it allows for all variables in the observed sample to have missing values. This MNAR model corresponds to a so-called criss-cross structure considered in the literature on graphical models of missing data that prevents nonparametric identification of the entire missing data model. Nonetheless, part of the complete-data distribution remains nonparametrically identifiable. By exploiting this fact and considering a rich class of exponential family distributions, we establish sufficient conditions for identification of the complete-data ",
    "path": "papers/23/06/2306.06443.json",
    "total_tokens": 849,
    "translated_title": "缺失非随机机制下的充分识别条件和半参数估计",
    "translated_abstract": "在存在缺失非随机（MNAR）数据的情况下进行有效的统计分析是具有挑战性的，在这种情况下，缺失机制依赖于缺失值本身，即使已知观测数据。在这里，我们考虑一个MNAR模型，它通过两种方式推广了几个先前流行的MNAR模型：首先，在随机独立性假设方面更加灵活，其次，它允许观察样本中的所有变量都具有缺失值。这个MNAR模型对应于在缺失数据的图形模型中考虑的所谓criss-cross结构，它阻止了整个缺失数据模型的非参数识别。尽管如此，完整数据分布的一部分仍然可以被非参数识别。通过利用这个事实，并考虑一个丰富的指数家族分布，我们建立了完整数据的充分识别条件和半参数估计。",
    "tldr": "本论文针对缺失非随机数据的问题进行研究，在更加灵活的假设条件下，建立了对完整数据的充分识别条件和半参数估计方法。",
    "en_tdlr": "This paper addresses the challenge of conducting statistical analyses with missing-not-at-random data and establishes sufficient identification conditions and semi-parametric estimation method for the complete-data under more flexible assumptions."
}