{
    "title": "An Augmented Lagrangian Approach to Conically Constrained Non-monotone Variational Inequality Problems. (arXiv:2306.01214v1 [math.OC])",
    "abstract": "In this paper we consider a non-monotone (mixed) variational inequality model with (nonlinear) convex conic constraints. Through developing an equivalent Lagrangian function-like primal-dual saddle-point system for the VI model in question, we introduce an augmented Lagrangian primal-dual method, to be called ALAVI in the current paper, for solving a general constrained VI model. Under an assumption, to be called the primal-dual variational coherence condition in the paper, we prove the convergence of ALAVI. Next, we show that many existing generalized monotonicity properties are sufficient -- though by no means necessary -- to imply the above mentioned coherence condition, thus are sufficient to ensure convergence of ALAVI. Under that assumption, we further show that ALAVI has in fact an $o(1/\\sqrt{k})$ global rate of convergence where $k$ is the iteration count. By introducing a new gap function, this rate further improves to be $O(1/k)$ if the mapping is monotone. Finally, we show t",
    "link": "http://arxiv.org/abs/2306.01214",
    "context": "Title: An Augmented Lagrangian Approach to Conically Constrained Non-monotone Variational Inequality Problems. (arXiv:2306.01214v1 [math.OC])\nAbstract: In this paper we consider a non-monotone (mixed) variational inequality model with (nonlinear) convex conic constraints. Through developing an equivalent Lagrangian function-like primal-dual saddle-point system for the VI model in question, we introduce an augmented Lagrangian primal-dual method, to be called ALAVI in the current paper, for solving a general constrained VI model. Under an assumption, to be called the primal-dual variational coherence condition in the paper, we prove the convergence of ALAVI. Next, we show that many existing generalized monotonicity properties are sufficient -- though by no means necessary -- to imply the above mentioned coherence condition, thus are sufficient to ensure convergence of ALAVI. Under that assumption, we further show that ALAVI has in fact an $o(1/\\sqrt{k})$ global rate of convergence where $k$ is the iteration count. By introducing a new gap function, this rate further improves to be $O(1/k)$ if the mapping is monotone. Finally, we show t",
    "path": "papers/23/06/2306.01214.json",
    "total_tokens": 955,
    "translated_title": "带圆锥约束的非单调变分不等式问题的增广Lagrangian方法",
    "translated_abstract": "本文考虑了带有凸圆锥约束的混合变分不等式模型。通过为所讨论的VI模型开发类似拉格朗日函数的原始-对偶鞍点系统，我们引入了一种增广拉格朗日原始-对偶方法（称为ALAVI），用于求解一般约束VI模型。在一个被称为原始-对偶变分相干性条件的假设下，我们证明了ALAVI的收敛性。接下来，我们展示了许多现有的广义单调性质是足够的，虽然不是必要的，以此来暗示上述相干条件，并且足以确保ALAVI的收敛性。在此假设下，我们进一步展示，ALAVI实际上具有$O(1/\\sqrt{k})$的全局收敛速度，其中$k$是迭代计数。通过引入一种新的“间隙函数”，如果映射是单调的，这个速度可以进一步提高到$O(1/k)$。最后，我们展示了...",
    "tldr": "本文提出了一种被称为ALAVI的增广拉格朗日原始-对偶方法，用于解决一般约束VI模型，具有收敛性和全局收敛速度，对于存在某些广义单调性质的问题，收敛更快。",
    "en_tdlr": "This paper proposes an augmented Lagrangian primal-dual method called ALAVI for solving general constrained VI models, which has convergence and global convergence rate. The method has a faster convergence rate for problems with certain generalized monotonicity properties."
}