{
    "title": "RE-Matching: A Fine-Grained Semantic Matching Method for Zero-Shot Relation Extraction. (arXiv:2306.04954v1 [cs.CL])",
    "abstract": "Semantic matching is a mainstream paradigm of zero-shot relation extraction, which matches a given input with a corresponding label description. The entities in the input should exactly match their hypernyms in the description, while the irrelevant contexts should be ignored when matching. However, general matching methods lack explicit modeling of the above matching pattern. In this work, we propose a fine-grained semantic matching method tailored for zero-shot relation extraction. Following the above matching pattern, we decompose the sentence-level similarity score into entity and context matching scores. Due to the lack of explicit annotations of the redundant components, we design a feature distillation module to adaptively identify the relation-irrelevant features and reduce their negative impact on context matching. Experimental results show that our method achieves higher matching $F_1$ score and has an inference speed 10 times faster, when compared with the state-of-the-art me",
    "link": "http://arxiv.org/abs/2306.04954",
    "context": "Title: RE-Matching: A Fine-Grained Semantic Matching Method for Zero-Shot Relation Extraction. (arXiv:2306.04954v1 [cs.CL])\nAbstract: Semantic matching is a mainstream paradigm of zero-shot relation extraction, which matches a given input with a corresponding label description. The entities in the input should exactly match their hypernyms in the description, while the irrelevant contexts should be ignored when matching. However, general matching methods lack explicit modeling of the above matching pattern. In this work, we propose a fine-grained semantic matching method tailored for zero-shot relation extraction. Following the above matching pattern, we decompose the sentence-level similarity score into entity and context matching scores. Due to the lack of explicit annotations of the redundant components, we design a feature distillation module to adaptively identify the relation-irrelevant features and reduce their negative impact on context matching. Experimental results show that our method achieves higher matching $F_1$ score and has an inference speed 10 times faster, when compared with the state-of-the-art me",
    "path": "papers/23/06/2306.04954.json",
    "total_tokens": 981,
    "tldr": "本文提出了一种针对零样本关系抽取的细粒度语义匹配方法，其中通过实体匹配和上下文匹配分数来建模匹配模式，并设计了特征蒸馏模块以减少冗余特征的负面影响。实验结果表明，该方法在匹配F1得分和推理速度方面均超过了最先进技术。"
}