{
    "title": "Recent Advances in Graph-based Machine Learning for Applications in Smart Urban Transportation Systems. (arXiv:2306.01282v1 [cs.LG])",
    "abstract": "The Intelligent Transportation System (ITS) is an important part of modern transportation infrastructure, employing a combination of communication technology, information processing and control systems to manage transportation networks. This integration of various components such as roads, vehicles, and communication systems, is expected to improve efficiency and safety by providing better information, services, and coordination of transportation modes. In recent years, graph-based machine learning has become an increasingly important research focus in the field of ITS aiming at the development of complex, data-driven solutions to address various ITS-related challenges. This chapter presents background information on the key technical challenges for ITS design, along with a review of research methods ranging from classic statistical approaches to modern machine learning and deep learning-based approaches. Specifically, we provide an in-depth review of graph-based machine learning metho",
    "link": "http://arxiv.org/abs/2306.01282",
    "context": "Title: Recent Advances in Graph-based Machine Learning for Applications in Smart Urban Transportation Systems. (arXiv:2306.01282v1 [cs.LG])\nAbstract: The Intelligent Transportation System (ITS) is an important part of modern transportation infrastructure, employing a combination of communication technology, information processing and control systems to manage transportation networks. This integration of various components such as roads, vehicles, and communication systems, is expected to improve efficiency and safety by providing better information, services, and coordination of transportation modes. In recent years, graph-based machine learning has become an increasingly important research focus in the field of ITS aiming at the development of complex, data-driven solutions to address various ITS-related challenges. This chapter presents background information on the key technical challenges for ITS design, along with a review of research methods ranging from classic statistical approaches to modern machine learning and deep learning-based approaches. Specifically, we provide an in-depth review of graph-based machine learning metho",
    "path": "papers/23/06/2306.01282.json",
    "total_tokens": 887,
    "translated_title": "智能城市交通系统中基于图的机器学习的最新进展。",
    "translated_abstract": "智能交通系统（ITS）是现代交通基础设施的重要组成部分，采用通信技术，信息处理和控制系统来管理交通网络。这种集成各种组件（如道路，车辆和通信系统）的方法，预计通过提供更好的信息，服务和交通模式的协调来提高效率和安全性。近年来，基于图的机器学习已成为智能交通系统领域日益重要的研究重点，旨在开发基于复杂数据的数据驱动解决方案，以解决各种与ITS相关的挑战。本章节提供ITS设计的关键技术挑战的背景信息，以及涵盖从经典统计方法到现代机器学习和基于深度学习的方法的研究方法的综述。具体而言，我们提供了基于图的机器学习方法的深入审查。",
    "tldr": "智能交通系统（ITS）是现代交通基础设施的重要组成部分。已出现基于复杂数据的数据驱动解决方案以解决各种与ITS相关的挑战。图形机器学习方法成为了智能交通系统领域的日益重要的研究重点。",
    "en_tdlr": "Intelligent Transportation System (ITS) is an important part of modern transportation infrastructure. Complex, data-driven solutions based on graph-based machine learning have emerged to tackle various challenges related to ITS. Graph-based machine learning methods have become an increasingly important research focus in the field of ITS."
}