{
    "title": "Magnetic Resonance Spectroscopy Quantification Aided by Deep Estimations of Imperfection Factors and Overall Macromolecular Signal. (arXiv:2306.09681v1 [physics.med-ph])",
    "abstract": "Magnetic Resonance Spectroscopy (MRS) is an important non-invasive technique for in vivo biomedical detection. However, it is still challenging to accurately quantify metabolites with proton MRS due to three problems: Serious overlaps of metabolite signals, signal distortions due to non-ideal acquisition conditions and interference with strong background signals including macromolecule signals. The most popular software, LCModel, adopts the non-linear least square to quantify metabolites and addresses these problems by introducing regularization terms, imperfection factors of non-ideal acquisition conditions, and designing several empirical priors such as basissets of both metabolites and macromolecules. However, solving such a large non-linear quantitative problem is complicated. Moreover, when the signal-to-noise ratio of an input MRS signal is low, the solution may have a large deviation. In this work, deep learning is introduced to reduce the complexity of solving this overall quan",
    "link": "http://arxiv.org/abs/2306.09681",
    "context": "Title: Magnetic Resonance Spectroscopy Quantification Aided by Deep Estimations of Imperfection Factors and Overall Macromolecular Signal. (arXiv:2306.09681v1 [physics.med-ph])\nAbstract: Magnetic Resonance Spectroscopy (MRS) is an important non-invasive technique for in vivo biomedical detection. However, it is still challenging to accurately quantify metabolites with proton MRS due to three problems: Serious overlaps of metabolite signals, signal distortions due to non-ideal acquisition conditions and interference with strong background signals including macromolecule signals. The most popular software, LCModel, adopts the non-linear least square to quantify metabolites and addresses these problems by introducing regularization terms, imperfection factors of non-ideal acquisition conditions, and designing several empirical priors such as basissets of both metabolites and macromolecules. However, solving such a large non-linear quantitative problem is complicated. Moreover, when the signal-to-noise ratio of an input MRS signal is low, the solution may have a large deviation. In this work, deep learning is introduced to reduce the complexity of solving this overall quan",
    "path": "papers/23/06/2306.09681.json",
    "total_tokens": 777,
    "translated_title": "基于深度误差因素与总体高分子信号估计的磁共振波谱定量技术",
    "translated_abstract": "磁共振波谱（MRS）是一种非侵入性的生物医学检测技术，由于代谢物信号的严重重叠、非理想采集条件引起的信号失真以及与强背景信号包括高分子信号的干扰，使用质子MRS精确量化代谢物仍然存在挑战。在本研究中，将深度学习引入到MRS量化中，通过引入正则化项、非理想采集条件的误差因素以及设计几种经验先验如诸如代谢物和高分子的基集，进一步提高了方法的精度和稳定性。",
    "tldr": "本论文通过深度学习方法提高了磁共振波谱技术中代谢物信号定量精度和稳定性。",
    "en_tdlr": "This paper introduces deep learning to improve the accuracy and stability of metabolite signal quantification in magnetic resonance spectroscopy technology."
}