{
    "title": "Progressive Class-Wise Attention (PCA) Approach for Diagnosing Skin Lesions. (arXiv:2306.07300v1 [cs.LG])",
    "abstract": "Skin cancer holds the highest incidence rate among all cancers globally. The importance of early detection cannot be overstated, as late-stage cases can be lethal. Classifying skin lesions, however, presents several challenges due to the many variations they can exhibit, such as differences in colour, shape, and size, significant variation within the same class, and notable similarities between different classes. This paper introduces a novel class-wise attention technique that equally regards each class while unearthing more specific details about skin lesions. This attention mechanism is progressively used to amalgamate discriminative feature details from multiple scales. The introduced technique demonstrated impressive performance, surpassing more than 15 cutting-edge methods including the winners of HAM1000 and ISIC 2019 leaderboards. It achieved an impressive accuracy rate of 97.40% on the HAM10000 dataset and 94.9% on the ISIC 2019 dataset.",
    "link": "http://arxiv.org/abs/2306.07300",
    "context": "Title: Progressive Class-Wise Attention (PCA) Approach for Diagnosing Skin Lesions. (arXiv:2306.07300v1 [cs.LG])\nAbstract: Skin cancer holds the highest incidence rate among all cancers globally. The importance of early detection cannot be overstated, as late-stage cases can be lethal. Classifying skin lesions, however, presents several challenges due to the many variations they can exhibit, such as differences in colour, shape, and size, significant variation within the same class, and notable similarities between different classes. This paper introduces a novel class-wise attention technique that equally regards each class while unearthing more specific details about skin lesions. This attention mechanism is progressively used to amalgamate discriminative feature details from multiple scales. The introduced technique demonstrated impressive performance, surpassing more than 15 cutting-edge methods including the winners of HAM1000 and ISIC 2019 leaderboards. It achieved an impressive accuracy rate of 97.40% on the HAM10000 dataset and 94.9% on the ISIC 2019 dataset.",
    "path": "papers/23/06/2306.07300.json",
    "total_tokens": 1000,
    "translated_title": "诊断皮肤病变的渐进式分类关注（PCA）方法",
    "translated_abstract": "全球癌症发病率中，皮肤癌的发生率最高。早期发现的重要性不言而喻，晚期病例可能会危及生命。然而，由于色彩、形状和大小等多种变化，皮肤病变的分类存在多个挑战，同一类别内存在显著变异，不同类别之间也存在显著相似性。本文介绍了一种新型的分类关注技术，该技术在挖掘皮肤病变的更具体细节的同时，平等地考虑每个类别。这种关注机制逐步用于结合多个尺度的判别特征细节。本文介绍的技术表现出色，不仅超过了15种尖端方法，还包括HAM1000和ISIC 2019排行榜的优胜者。在HAM10000数据集上，其准确率达到了97.40％，而在ISIC 2019数据集上则为94.9％。",
    "tldr": "本研究提出一种新的分类关注技术，能够平等关注每个皮肤病变类别，并逐步结合多个尺度的判别特征细节，从而获得显著的诊断表现，准确率分别为97.40％和94.9％，超过了15种尖端方法，包括HAM1000和ISIC2019排行榜的优胜者。",
    "en_tdlr": "This study proposes a novel class-wise attention technique that equally regards each skin lesion class while unearthing discriminative feature details from multiple scales. The introduced technique achieved remarkable diagnostic performance with accuracy rates of 97.40% on the HAM10000 dataset and 94.9% on the ISIC 2019 dataset, surpassing more than 15 cutting-edge methods including the winners of HAM1000 and ISIC 2019 leaderboards."
}