{
    "title": "Centrality in Production Networks and International Technology Diffusion. (arXiv:2306.06680v1 [econ.GN])",
    "abstract": "This study examines whether the structure of global value chains (GVCs) affects international spillovers of research and development (R&D). Although the presence of ``hub'' countries in GVCs has been confirmed by previous studies, the role of these hub countries in the diffusion of the technology has not been analyzed. Using a sample of 21 countries and 14 manufacturing industries during the period 1995-2007, I explore the role of hubs as the mediator of knowledge by classifying countries and industries based on a ``centrality'' measure. I find that R&D spillovers from exporters with High centrality are the largest, suggesting that hub countries play an important role in both gathering and diffusing knowledge. I also find that countries with Middle centrality are getting important in the diffusion of knowledge. Finally, positive spillover effects from own are observed only in the G5 countries.",
    "link": "http://arxiv.org/abs/2306.06680",
    "context": "Title: Centrality in Production Networks and International Technology Diffusion. (arXiv:2306.06680v1 [econ.GN])\nAbstract: This study examines whether the structure of global value chains (GVCs) affects international spillovers of research and development (R&D). Although the presence of ``hub'' countries in GVCs has been confirmed by previous studies, the role of these hub countries in the diffusion of the technology has not been analyzed. Using a sample of 21 countries and 14 manufacturing industries during the period 1995-2007, I explore the role of hubs as the mediator of knowledge by classifying countries and industries based on a ``centrality'' measure. I find that R&D spillovers from exporters with High centrality are the largest, suggesting that hub countries play an important role in both gathering and diffusing knowledge. I also find that countries with Middle centrality are getting important in the diffusion of knowledge. Finally, positive spillover effects from own are observed only in the G5 countries.",
    "path": "papers/23/06/2306.06680.json",
    "total_tokens": 822,
    "translated_title": "《生产网络中的中心性与国际技术扩散》",
    "translated_abstract": "本研究探讨全球价值链（GVCs）的结构是否影响研发（R&D）的国际溢出。通过对1995-2007年21个国家和14个制造业的样本进行分类，研究了“中心性”度量的角色。结果表明，具有高中心性的出口国的R&D溢出最大，这表明中心国在收集和扩散知识方面发挥了重要作用。同时发现，具有中等中心性的国家在知识扩散方面越来越重要，最后，只有在G5国家中才能观察到自身的正向溢出效应。",
    "tldr": "本文研究了全球价值链（GVCs）的中心性对研发（R&D）国际溢出的影响，结果表明，具有高中心性的出口国的R&D溢出最大，中心国在收集和扩散知识方面发挥了重要作用。",
    "en_tdlr": "This paper studies the impact of centrality in global value chains (GVCs) on international spillovers of research and development (R&D), and finds that R&D spillovers from exporters with high centrality are the largest, indicating that hub countries play an important role in both gathering and diffusing knowledge."
}