{
    "title": "Better Generalization with Semantic IDs: A case study in Ranking for Recommendations. (arXiv:2306.08121v1 [cs.IR])",
    "abstract": "Training good representations for items is critical in recommender models. Typically, an item is assigned a unique randomly generated ID, and is commonly represented by learning an embedding corresponding to the value of the random ID. Although widely used, this approach have limitations when the number of items are large and items are power-law distributed -- typical characteristics of real-world recommendation systems. This leads to the item cold-start problem, where the model is unable to make reliable inferences for tail and previously unseen items. Removing these ID features and their learned embeddings altogether to combat cold-start issue severely degrades the recommendation quality. Content-based item embeddings are more reliable, but they are expensive to store and use, particularly for users' past item interaction sequence. In this paper, we use Semantic IDs, a compact discrete item representations learned from content embeddings using RQ-VAE that captures hierarchy of concep",
    "link": "http://arxiv.org/abs/2306.08121",
    "context": "Title: Better Generalization with Semantic IDs: A case study in Ranking for Recommendations. (arXiv:2306.08121v1 [cs.IR])\nAbstract: Training good representations for items is critical in recommender models. Typically, an item is assigned a unique randomly generated ID, and is commonly represented by learning an embedding corresponding to the value of the random ID. Although widely used, this approach have limitations when the number of items are large and items are power-law distributed -- typical characteristics of real-world recommendation systems. This leads to the item cold-start problem, where the model is unable to make reliable inferences for tail and previously unseen items. Removing these ID features and their learned embeddings altogether to combat cold-start issue severely degrades the recommendation quality. Content-based item embeddings are more reliable, but they are expensive to store and use, particularly for users' past item interaction sequence. In this paper, we use Semantic IDs, a compact discrete item representations learned from content embeddings using RQ-VAE that captures hierarchy of concep",
    "path": "papers/23/06/2306.08121.json",
    "total_tokens": 931,
    "translated_title": "使用语义ID进行更好的泛化：推荐排名的案例研究",
    "translated_abstract": "在推荐模型中，训练好的物品表示是至关重要的。通常，一项商品会被分配一个唯一的随机生成的ID，并且通常会通过学习与随机ID值相对应的嵌入来表示。虽然这种方法被广泛使用，但在物品数量大且物品服从幂律分布的情况下——这是真实世界推荐系统的典型特征——会有一定局限性。这会导致物品冷启动问题，模型无法对尾部和以前未见过的物品进行可靠的推荐。完全消除这些ID特征及其学习的嵌入以解决冷启动问题会严重降低推荐质量。基于内容的物品嵌入更为可靠，但对于用户过去的物品交互序列来说，它们成本高且使用困难。本文中，我们使用语义ID来表示离散的物品，这些ID是通过使用RQ-VAE从内容嵌入中学习的，可以捕捉概念的层次关系。",
    "tldr": "本文提出使用语义ID解决推荐系统中的物品冷启动问题，这些ID是从内容嵌入中学习的，可以捕捉概念的层次关系，相较于完全消除ID特征的方法，语义ID能更好地提高推荐质量。",
    "en_tdlr": "This paper proposes the use of Semantic IDs, learned from content embeddings using RQ-VAE, to address the item cold-start problem in recommendation systems. These IDs capture the hierarchy of concepts and result in better recommendation quality compared to complete removal of ID features."
}