{
    "title": "A Vitual-Force Based Swarm Algorithm for Balanced Circular Bin Packing Problems. (arXiv:2306.01021v1 [cs.AI])",
    "abstract": "Balanced circular bin packing problems consist in positioning a given number of weighted circles in order to minimize the radius of a circular container while satisfying equilibrium constraints. These problems are NP-hard, highly constrained and dimensional. This paper describes a swarm algorithm based on a virtual-force system in order to solve balanced circular bin packing problems. In the proposed approach, a system of forces is applied to each component allowing to take into account the constraints and minimizing the objective function using the fundamental principle of dynamics. The proposed algorithm is experimented and validated on benchmarks of various balanced circular bin packing problems with up to 300 circles. The reported results allow to assess the effectiveness of the proposed approach compared to existing results from the literature.",
    "link": "http://arxiv.org/abs/2306.01021",
    "context": "Title: A Vitual-Force Based Swarm Algorithm for Balanced Circular Bin Packing Problems. (arXiv:2306.01021v1 [cs.AI])\nAbstract: Balanced circular bin packing problems consist in positioning a given number of weighted circles in order to minimize the radius of a circular container while satisfying equilibrium constraints. These problems are NP-hard, highly constrained and dimensional. This paper describes a swarm algorithm based on a virtual-force system in order to solve balanced circular bin packing problems. In the proposed approach, a system of forces is applied to each component allowing to take into account the constraints and minimizing the objective function using the fundamental principle of dynamics. The proposed algorithm is experimented and validated on benchmarks of various balanced circular bin packing problems with up to 300 circles. The reported results allow to assess the effectiveness of the proposed approach compared to existing results from the literature.",
    "path": "papers/23/06/2306.01021.json",
    "total_tokens": 747,
    "translated_title": "基于虚拟力的平衡圆形装箱问题的群智能算法",
    "translated_abstract": "平衡圆形装箱问题涉及将给定数量的加权圆放置在圆形容器中，以最小化半径并满足平衡约束条件。本文描述了一种基于虚拟力系统的群智能算法，以解决平衡圆形装箱问题。在提出的方法中，对每个组件施加一组力，以考虑约束条件并使用动力学的基本原理最小化目标函数。提出的算法在各种平衡圆形装箱问题的基准测试中得到验证，并验证了具有高达300个圆的问题。报告的结果允许评估所提出的方法与文献中现有结果之间的有效性。",
    "tldr": "本文描述了一种基于虚拟力系统的群智能算法，用以解决平衡圆形装箱问题，并在各种基准测试中得到验证，具有很好的解决效果。",
    "en_tdlr": "This paper proposes a swarm algorithm based on a virtual-force system to solve balanced circular bin packing problems, which has been experimentally validated on benchmarks of various problem sizes up to 300 circles and shown to be effective compared to existing results from the literature."
}