{
    "title": "Multi-level Cross-modal Feature Alignment via Contrastive Learning towards Zero-shot Classification of Remote Sensing Image Scenes. (arXiv:2306.06066v1 [cs.CV])",
    "abstract": "Zero-shot classification of image scenes which can recognize the image scenes that are not seen in the training stage holds great promise of lowering the dependence on large numbers of labeled samples. To address the zero-shot image scene classification, the cross-modal feature alignment methods have been proposed in recent years. These methods mainly focus on matching the visual features of each image scene with their corresponding semantic descriptors in the latent space. Less attention has been paid to the contrastive relationships between different image scenes and different semantic descriptors. In light of the challenge of large intra-class difference and inter-class similarity among image scenes and the potential noisy samples, these methods are susceptible to the influence of the instances which are far from these of the same classes and close to these of other classes. In this work, we propose a multi-level cross-modal feature alignment method via contrastive learning for zero",
    "link": "http://arxiv.org/abs/2306.06066",
    "context": "Title: Multi-level Cross-modal Feature Alignment via Contrastive Learning towards Zero-shot Classification of Remote Sensing Image Scenes. (arXiv:2306.06066v1 [cs.CV])\nAbstract: Zero-shot classification of image scenes which can recognize the image scenes that are not seen in the training stage holds great promise of lowering the dependence on large numbers of labeled samples. To address the zero-shot image scene classification, the cross-modal feature alignment methods have been proposed in recent years. These methods mainly focus on matching the visual features of each image scene with their corresponding semantic descriptors in the latent space. Less attention has been paid to the contrastive relationships between different image scenes and different semantic descriptors. In light of the challenge of large intra-class difference and inter-class similarity among image scenes and the potential noisy samples, these methods are susceptible to the influence of the instances which are far from these of the same classes and close to these of other classes. In this work, we propose a multi-level cross-modal feature alignment method via contrastive learning for zero",
    "path": "papers/23/06/2306.06066.json",
    "total_tokens": 728,
    "translated_title": "基于对比学习的交叉模态特征对齐方法用于遥感图像场景的零样本分类",
    "translated_abstract": "零样本图像场景分类可以识别在训练阶段未见过的图像场景，以此降低对大量标记样本的依赖性。近年来，交叉模态特征对齐方法已被提出来解决这个问题。这些方法主要关注将每个图像场景的视觉特征与其对应的语义描述符在潜在空间中匹配。较少关注不同图像场景和不同语义描述符之间的对比关系。",
    "tldr": "提出了一种基于对比学习的多级交叉模态特征对齐方法，用于零样本分类，能够有效应对大类内差异和小类间相似性的挑战。",
    "en_tdlr": "Proposed a multi-level cross-modal feature alignment method via contrastive learning for zero-shot classification of remote sensing image scenes, which can effectively address the challenges of large intra-class difference and inter-class similarity."
}