{
    "title": "Combining multi-spectral data with statistical and deep-learning models for improved exoplanet detection in direct imaging at high contrast. (arXiv:2306.12266v1 [astro-ph.IM])",
    "abstract": "Exoplanet detection by direct imaging is a difficult task: the faint signals from the objects of interest are buried under a spatially structured nuisance component induced by the host star. The exoplanet signals can only be identified when combining several observations with dedicated detection algorithms. In contrast to most of existing methods, we propose to learn a model of the spatial, temporal and spectral characteristics of the nuisance, directly from the observations. In a pre-processing step, a statistical model of their correlations is built locally, and the data are centered and whitened to improve both their stationarity and signal-to-noise ratio (SNR). A convolutional neural network (CNN) is then trained in a supervised fashion to detect the residual signature of synthetic sources in the pre-processed images. Our method leads to a better trade-off between precision and recall than standard approaches in the field. It also outperforms a state-of-the-art algorithm based sole",
    "link": "http://arxiv.org/abs/2306.12266",
    "context": "Title: Combining multi-spectral data with statistical and deep-learning models for improved exoplanet detection in direct imaging at high contrast. (arXiv:2306.12266v1 [astro-ph.IM])\nAbstract: Exoplanet detection by direct imaging is a difficult task: the faint signals from the objects of interest are buried under a spatially structured nuisance component induced by the host star. The exoplanet signals can only be identified when combining several observations with dedicated detection algorithms. In contrast to most of existing methods, we propose to learn a model of the spatial, temporal and spectral characteristics of the nuisance, directly from the observations. In a pre-processing step, a statistical model of their correlations is built locally, and the data are centered and whitened to improve both their stationarity and signal-to-noise ratio (SNR). A convolutional neural network (CNN) is then trained in a supervised fashion to detect the residual signature of synthetic sources in the pre-processed images. Our method leads to a better trade-off between precision and recall than standard approaches in the field. It also outperforms a state-of-the-art algorithm based sole",
    "path": "papers/23/06/2306.12266.json",
    "total_tokens": 968,
    "translated_title": "利用统计和深度学习模型与多光谱数据相结合，以改善直接成像高对比度外行星探测",
    "translated_abstract": "直接成像的外行星探测是一项艰巨的任务：有兴趣的物体的微弱信号被主星引起的空间结构繁殖的干扰成分所掩盖。只有将几次观测和专用探测算法相结合才能识别外行星信号。与大多数现有方法不同，我们建议从观测数据中直接学习干扰信号的空间、时间和光谱特征的模型。在预处理步骤中，本地建立它们之间相关性的统计模型，并对数据进行中心化和白化，以改善它们的平稳性和信噪比（SNR）。然后，在监督模式下对卷积神经网络（CNN）进行训练，以检测预处理图像中合成源的残余特征。我们的方法在精度和召回之间实现了更好的权衡，比领域内标准方法表现更好。它也优于基于单纯的吸收特征的最新算法。",
    "tldr": "本论文提出了一种利用统计和深度学习模型与多光谱数据相结合的方法，对直接成像的外行星探测进行改进，通过建立统计模型并进行卷积神经网络训练，在精度和召回之间实现更好的权衡。",
    "en_tdlr": "This paper proposes a method combining statistical and deep-learning models with multi-spectral data to improve direct imaging exoplanet detection. By establishing a statistical model and training a convolutional neural network, it achieves a better trade-off between precision and recall than standard approaches in the field."
}