{
    "title": "Understanding the Benefits of Image Augmentations. (arXiv:2306.06254v1 [cs.CV])",
    "abstract": "Image Augmentations are widely used to reduce overfitting in neural networks. However, the explainability of their benefits largely remains a mystery. We study which layers of residual neural networks (ResNets) are most affected by augmentations using Centered Kernel Alignment (CKA). We do so by analyzing models of varying widths and depths, as well as whether their weights are initialized randomly or through transfer learning. We find that the pattern of how the layers are affected depends on the model's depth, and that networks trained with augmentation that use information from two images affect the learned weights significantly more than augmentations that operate on a single image. Deeper layers of ResNets initialized with ImageNet-1K weights and fine-tuned receive more impact from the augmentations than early layers. Understanding the effects of image augmentations on CNNs will have a variety of applications, such as determining how far back one needs to fine-tune a network and w",
    "link": "http://arxiv.org/abs/2306.06254",
    "context": "Title: Understanding the Benefits of Image Augmentations. (arXiv:2306.06254v1 [cs.CV])\nAbstract: Image Augmentations are widely used to reduce overfitting in neural networks. However, the explainability of their benefits largely remains a mystery. We study which layers of residual neural networks (ResNets) are most affected by augmentations using Centered Kernel Alignment (CKA). We do so by analyzing models of varying widths and depths, as well as whether their weights are initialized randomly or through transfer learning. We find that the pattern of how the layers are affected depends on the model's depth, and that networks trained with augmentation that use information from two images affect the learned weights significantly more than augmentations that operate on a single image. Deeper layers of ResNets initialized with ImageNet-1K weights and fine-tuned receive more impact from the augmentations than early layers. Understanding the effects of image augmentations on CNNs will have a variety of applications, such as determining how far back one needs to fine-tune a network and w",
    "path": "papers/23/06/2306.06254.json",
    "total_tokens": 939,
    "translated_title": "理解图像增强的好处",
    "translated_abstract": "图像增强被广泛用于神经网络中的过拟合问题。然而，它们好处的可解释性仍然是一个谜。使用居中核对齐（CKA），我们研究了残差神经网络（ResNets）的哪些层受到增强的影响最大。我们通过分析各种宽度和深度的模型以及它们的权重是随机初始化还是通过迁移学习来进行。我们发现，层受影响的模式取决于模型的深度，并且使用来自两个图像的信息的增强对学习的权重产生的影响显著大于对单个图像进行操作的增强。使用ImageNet-1K权重初始化和微调的ResNets的深层比早期层受到的增强影响更大。了解图像增强对卷积神经网络的影响将有各种应用，例如确定需要多长时间才能对网络进行微调以及微调强度。",
    "tldr": "本论文通过分析各种宽度和深度的ResNets模型并对其进行增广，发现使用两个图像信息的增广对所学权重的影响显着大于单个图像的影响，使用ImageNet-1K权重和微调的ResNets深层比早期层受到更大的影响。"
}