{
    "title": "Analysis of the Fed's communication by using textual entailment model of Zero-Shot classification. (arXiv:2306.04277v1 [cs.CL])",
    "abstract": "In this study, we analyze documents published by central banks using text mining techniques and propose a method to evaluate the policy tone of central banks. Since the monetary policies of major central banks have a broad impact on financial market trends, the pricing of risky assets, and the real economy, market participants are attempting to more accurately capture changes in the outlook for central banks' future monetary policies. Since the published documents are also an important tool for the central bank to communicate with the market, they are meticulously elaborated on grammatical syntax and wording, and investors are urged to read more accurately about the central bank's policy stance. Sentiment analysis on central bank documents has long been carried out, but it has been difficult to interpret the meaning of the documents accurately and to explicitly capture even the intentional change in nuance. This study attempts to evaluate the implication of the zero-shot text classific",
    "link": "http://arxiv.org/abs/2306.04277",
    "context": "Title: Analysis of the Fed's communication by using textual entailment model of Zero-Shot classification. (arXiv:2306.04277v1 [cs.CL])\nAbstract: In this study, we analyze documents published by central banks using text mining techniques and propose a method to evaluate the policy tone of central banks. Since the monetary policies of major central banks have a broad impact on financial market trends, the pricing of risky assets, and the real economy, market participants are attempting to more accurately capture changes in the outlook for central banks' future monetary policies. Since the published documents are also an important tool for the central bank to communicate with the market, they are meticulously elaborated on grammatical syntax and wording, and investors are urged to read more accurately about the central bank's policy stance. Sentiment analysis on central bank documents has long been carried out, but it has been difficult to interpret the meaning of the documents accurately and to explicitly capture even the intentional change in nuance. This study attempts to evaluate the implication of the zero-shot text classific",
    "path": "papers/23/06/2306.04277.json",
    "total_tokens": 854,
    "translated_title": "零样本分类文本蕴含模型分析Fed的沟通",
    "translated_abstract": "本研究使用文本挖掘技术分析中央银行发布的文件，并提出一种评估中央银行政策态度的方法。由于各大中央银行的货币政策对金融市场趋势、高风险资产的定价和实体经济产生广泛影响，市场参与者试图更准确地捕捉中央银行未来货币政策的变化。鉴于发布的文件也是中央银行与市场沟通的重要工具，因此它们在语法句法和措辞上都要精心制作，鼓励投资者更准确地阅读中央银行的政策立场。长期以来，对中央银行文件进行情感分析已经被开展，但很难准确解释文件的含义，甚至无意中改变的微妙差异也难以明确捕捉。本研究尝试评估零样本文本分类所涵盖的含义。",
    "tldr": "本研究使用文本挖掘技术分析中央银行发布的文件，并提出一种评估中央银行政策态度的方法。",
    "en_tdlr": "This study analyzes documents published by central banks using text mining techniques and proposes a method to evaluate the policy tone of central banks."
}