{
    "title": "World Models for Math Story Problems. (arXiv:2306.04347v1 [cs.CL])",
    "abstract": "Solving math story problems is a complex task for students and NLP models alike, requiring them to understand the world as described in the story and reason over it to compute an answer. Recent years have seen impressive performance on automatically solving these problems with large pre-trained language models and innovative techniques to prompt them. However, it remains unclear if these models possess accurate representations of mathematical concepts. This leads to lack of interpretability and trustworthiness which impedes their usefulness in various applications. In this paper, we consolidate previous work on categorizing and representing math story problems and develop MathWorld, which is a graph-based semantic formalism specific for the domain of math story problems. With MathWorld, we can assign world models to math story problems which represent the situations and actions introduced in the text and their mathematical relationships. We combine math story problems from several exis",
    "link": "http://arxiv.org/abs/2306.04347",
    "context": "Title: World Models for Math Story Problems. (arXiv:2306.04347v1 [cs.CL])\nAbstract: Solving math story problems is a complex task for students and NLP models alike, requiring them to understand the world as described in the story and reason over it to compute an answer. Recent years have seen impressive performance on automatically solving these problems with large pre-trained language models and innovative techniques to prompt them. However, it remains unclear if these models possess accurate representations of mathematical concepts. This leads to lack of interpretability and trustworthiness which impedes their usefulness in various applications. In this paper, we consolidate previous work on categorizing and representing math story problems and develop MathWorld, which is a graph-based semantic formalism specific for the domain of math story problems. With MathWorld, we can assign world models to math story problems which represent the situations and actions introduced in the text and their mathematical relationships. We combine math story problems from several exis",
    "path": "papers/23/06/2306.04347.json",
    "total_tokens": 975,
    "translated_title": "数学解题的世界模型研究",
    "translated_abstract": "对于学生和自然语言处理模型而言，解决数学故事问题是一项复杂的任务，需要他们理解故事中所描述的世界并对其进行推理，以计算出答案。近年来，大型预训练语言模型和创新技术已经取得了惊人的表现，可以自动解决这些问题。但是，这些模型是否具有数学概念的准确表示仍不清楚。这导致缺乏可解释性和可信度，从而影响它们在各种应用中的有用性。本文将之前的工作整合到分类和表达数学故事问题上，并开发出针对数学故事问题领域的基于图形的语义规范MathWorld。利用MathWorld，我们可以为数学故事问题分配世界模型，它们表示在文本中介绍的情况和行动以及它们的数学关系。我们将来自几个现有数据集的数学故事问题组合在一起，并在我们收集的新数据集Story-Gen Math上评估我们的方法，该数据集包含具有不同难度的具有挑战性的问题。我们的实验表明，MathWorld可以提高自然语言处理模型的性能，并提供比现有方法更好的可解释性。",
    "tldr": "本文介绍了一个基于图形的语义规范MathWorld，可以将世界模型分配给数学故事问题，从而提供比现有方法更好的可解释性和对NLP模型的性能提升。",
    "en_tdlr": "This paper presents a graph-based semantic formalism, MathWorld, which assigns world models to math story problems for better interpretability and improved performance of NLP models compared to existing methods."
}