{
    "title": "Inference and Sampling of Point Processes from Diffusion Excursions. (arXiv:2306.00762v1 [stat.CO])",
    "abstract": "Point processes often have a natural interpretation with respect to a continuous process. We propose a point process construction that describes arrival time observations in terms of the state of a latent diffusion process. In this framework, we relate the return times of a diffusion in a continuous path space to new arrivals of the point process. This leads to a continuous sample path that is used to describe the underlying mechanism generating the arrival distribution. These models arise in many disciplines, such as financial settings where actions in a market are determined by a hidden continuous price or in neuroscience where a latent stimulus generates spike trains. Based on the developments in It\\^o's excursion theory, we propose methods for inferring and sampling from the point process derived from the latent diffusion process. We illustrate the approach with numerical examples using both simulated and real data. The proposed methods and framework provide a basis for interpretin",
    "link": "http://arxiv.org/abs/2306.00762",
    "context": "Title: Inference and Sampling of Point Processes from Diffusion Excursions. (arXiv:2306.00762v1 [stat.CO])\nAbstract: Point processes often have a natural interpretation with respect to a continuous process. We propose a point process construction that describes arrival time observations in terms of the state of a latent diffusion process. In this framework, we relate the return times of a diffusion in a continuous path space to new arrivals of the point process. This leads to a continuous sample path that is used to describe the underlying mechanism generating the arrival distribution. These models arise in many disciplines, such as financial settings where actions in a market are determined by a hidden continuous price or in neuroscience where a latent stimulus generates spike trains. Based on the developments in It\\^o's excursion theory, we propose methods for inferring and sampling from the point process derived from the latent diffusion process. We illustrate the approach with numerical examples using both simulated and real data. The proposed methods and framework provide a basis for interpretin",
    "path": "papers/23/06/2306.00762.json",
    "total_tokens": 876,
    "translated_title": "从扩散过程中的漂移推断和采样点过程",
    "translated_abstract": "点过程通常可以通过与连续过程的关系进行自然解释。我们提出了一种描述到达时间观测的点过程构建方法，该方法使用潜在扩散过程的状态来描述。在此框架中，我们将扩散的返回时间与点过程的新到达相关联。这导致了一个连续样本路径，用于描述生成到达分布的基础机制。这些模型在许多学科中出现，例如金融领域，在该领域中，市场上的行动由隐藏的连续价格决定，或者在神经科学中，潜在的刺激生成尖峰列。基于伊藤漂移理论的发展，我们提出了从潜在扩散过程派生的点过程的推断和采样方法。我们使用模拟和实际数据的数字示例说明了该方法的应用。所提出的方法和框架为解释许多点过程提供了基础。",
    "tldr": "该论文提出了一种从潜在扩散过程中推断和采样点过程的方法，该方法通过将连续路径空间中的扩散返回时间与点过程的新到达相关联，为许多学科中的点过程提供了基础。",
    "en_tdlr": "The paper proposes a method for inferring and sampling point processes from latent diffusion processes by relating the return times of diffusion in a continuous path space to new arrivals of the point process. The approach provides a basis for interpreting point processes in many disciplines."
}