{
    "title": "Sequential Attention Source Identification Based on Feature Representation. (arXiv:2306.15886v1 [cs.SI])",
    "abstract": "Snapshot observation based source localization has been widely studied due to its accessibility and low cost. However, the interaction of users in existing methods does not be addressed in time-varying infection scenarios. So these methods have a decreased accuracy in heterogeneous interaction scenarios. To solve this critical issue, this paper proposes a sequence-to-sequence based localization framework called Temporal-sequence based Graph Attention Source Identification (TGASI) based on an inductive learning idea. More specifically, the encoder focuses on generating multiple features by estimating the influence probability between two users, and the decoder distinguishes the importance of prediction sources in different timestamps by a designed temporal attention mechanism. It's worth mentioning that the inductive learning idea ensures that TGASI can detect the sources in new scenarios without knowing other prior knowledge, which proves the scalability of TGASI. Comprehensive experim",
    "link": "http://arxiv.org/abs/2306.15886",
    "context": "Title: Sequential Attention Source Identification Based on Feature Representation. (arXiv:2306.15886v1 [cs.SI])\nAbstract: Snapshot observation based source localization has been widely studied due to its accessibility and low cost. However, the interaction of users in existing methods does not be addressed in time-varying infection scenarios. So these methods have a decreased accuracy in heterogeneous interaction scenarios. To solve this critical issue, this paper proposes a sequence-to-sequence based localization framework called Temporal-sequence based Graph Attention Source Identification (TGASI) based on an inductive learning idea. More specifically, the encoder focuses on generating multiple features by estimating the influence probability between two users, and the decoder distinguishes the importance of prediction sources in different timestamps by a designed temporal attention mechanism. It's worth mentioning that the inductive learning idea ensures that TGASI can detect the sources in new scenarios without knowing other prior knowledge, which proves the scalability of TGASI. Comprehensive experim",
    "path": "papers/23/06/2306.15886.json",
    "total_tokens": 931,
    "translated_title": "基于特征表示的时序关注源识别",
    "translated_abstract": "基于快照观察的源定位已被广泛研究，因其易得和低成本的特点。然而，现有方法未能及时解决时变感染情景下用户之间的交互问题。因此，这些方法在异质交互情景中的准确性下降。为解决这一关键问题，本文提出了一种基于序列到序列的本地化框架，称为基于时序图注意力的源识别（TGASI），基于归纳学习思想。具体来说，编码器通过估计两个用户之间的影响概率，集中生成多个特征，解码器通过设计的时序注意机制，在不同时刻区分预测源的重要性。值得一提的是，归纳学习思想确保了TGASI在不知道其他先验知识的情况下能在新场景中检测源，证明了TGASI的可扩展性。综合实验结果表明，TGASI在多个数据集上的表现优于其他方法。",
    "tldr": "本文提出了一种基于序列到序列的本地化框架，通过估计用户之间的影响概率生成多个特征，并通过时序注意机制区分不同时刻预测源的重要性。该方法在解决时变感染情景下用户交互问题方面具有较高的准确性，对新场景的检测也具有良好的可扩展性。"
}