{
    "title": "Curvature-enhanced Graph Convolutional Network for Biomolecular Interaction Prediction. (arXiv:2306.13699v1 [q-bio.QM])",
    "abstract": "Geometric deep learning has demonstrated a great potential in non-Euclidean data analysis. The incorporation of geometric insights into learning architecture is vital to its success. Here we propose a curvature-enhanced graph convolutional network (CGCN) for biomolecular interaction prediction, for the first time. Our CGCN employs Ollivier-Ricci curvature (ORC) to characterize network local structures and to enhance the learning capability of GCNs. More specifically, ORCs are evaluated based on the local topology from node neighborhoods, and further used as weights for the feature aggregation in message-passing procedure. Our CGCN model is extensively validated on fourteen real-world bimolecular interaction networks and a series of simulated data. It has been found that our CGCN can achieve the state-of-the-art results. It outperforms all existing models, as far as we know, in thirteen out of the fourteen real-world datasets and ranks as the second in the rest one. The results from the",
    "link": "http://arxiv.org/abs/2306.13699",
    "context": "Title: Curvature-enhanced Graph Convolutional Network for Biomolecular Interaction Prediction. (arXiv:2306.13699v1 [q-bio.QM])\nAbstract: Geometric deep learning has demonstrated a great potential in non-Euclidean data analysis. The incorporation of geometric insights into learning architecture is vital to its success. Here we propose a curvature-enhanced graph convolutional network (CGCN) for biomolecular interaction prediction, for the first time. Our CGCN employs Ollivier-Ricci curvature (ORC) to characterize network local structures and to enhance the learning capability of GCNs. More specifically, ORCs are evaluated based on the local topology from node neighborhoods, and further used as weights for the feature aggregation in message-passing procedure. Our CGCN model is extensively validated on fourteen real-world bimolecular interaction networks and a series of simulated data. It has been found that our CGCN can achieve the state-of-the-art results. It outperforms all existing models, as far as we know, in thirteen out of the fourteen real-world datasets and ranks as the second in the rest one. The results from the",
    "path": "papers/23/06/2306.13699.json",
    "total_tokens": 1041,
    "translated_title": "基于曲率增强的图卷积神经网络在生物分子相互作用预测中的应用",
    "translated_abstract": "几何深度学习已经证明在不规则数据分析中具有巨大的潜力。将几何信息纳入学习架构对其成功至关重要。本文首次提出了一种基于曲率增强的图卷积神经网络（CGCN）用于生物分子相互作用的预测。我们的CGCN采用了Ollivier-Ricci曲率（ORC）来表征网络局部结构并增强GCN的学习能力。更具体地，ORCs是根据节点邻域的局部拓扑进行评估的，并且在消息传递过程中用作特征聚合的权重。我们的CGCN模型在14个实际的生物分子相互作用网络和一系列模拟数据上进行了广泛的验证。结果表明，我们的CGCN可以达到最先进的结果。据我们所知，在14个真实数据集中，它比所有现有的模型表现都要好，在其中13个数据集中排名第一。该论文是一篇arXiv预印本。",
    "tldr": "本文提出了一种基于曲率增强的图卷积神经网络，用于生物分子相互作用的预测，并在14个真实的生物相互作用网络上进行了广泛的验证。通过对局部结构引入几何信息，并在消息传递过程中使用Ollivier-Ricci曲率（ORC）作为权重，该模型在13个真实数据集中取得了最好的结果。"
}