{
    "title": "CLANet: A Comprehensive Framework for Cross-Batch Cell Line Identification Using Brightfield Images. (arXiv:2306.16538v1 [cs.CV])",
    "abstract": "Cell line authentication plays a crucial role in the biomedical field, ensuring researchers work with accurately identified cells. Supervised deep learning has made remarkable strides in cell line identification by studying cell morphological features through cell imaging. However, batch effects, a significant issue stemming from the different times at which data is generated, lead to substantial shifts in the underlying data distribution, thus complicating reliable differentiation between cell lines from distinct batch cultures. To address this challenge, we introduce CLANet, a pioneering framework for cross-batch cell line identification using brightfield images, specifically designed to tackle three distinct batch effects. We propose a cell cluster-level selection method to efficiently capture cell density variations, and a self-supervised learning strategy to manage image quality variations, thus producing reliable patch representations. Additionally, we adopt multiple instance lea",
    "link": "http://arxiv.org/abs/2306.16538",
    "context": "Title: CLANet: A Comprehensive Framework for Cross-Batch Cell Line Identification Using Brightfield Images. (arXiv:2306.16538v1 [cs.CV])\nAbstract: Cell line authentication plays a crucial role in the biomedical field, ensuring researchers work with accurately identified cells. Supervised deep learning has made remarkable strides in cell line identification by studying cell morphological features through cell imaging. However, batch effects, a significant issue stemming from the different times at which data is generated, lead to substantial shifts in the underlying data distribution, thus complicating reliable differentiation between cell lines from distinct batch cultures. To address this challenge, we introduce CLANet, a pioneering framework for cross-batch cell line identification using brightfield images, specifically designed to tackle three distinct batch effects. We propose a cell cluster-level selection method to efficiently capture cell density variations, and a self-supervised learning strategy to manage image quality variations, thus producing reliable patch representations. Additionally, we adopt multiple instance lea",
    "path": "papers/23/06/2306.16538.json",
    "total_tokens": 994,
    "translated_title": "CLANet: 一种全面的基于亮场图像的批间细胞系鉴定框架",
    "translated_abstract": "细胞系鉴定在生物医学领域中起着关键作用，确保研究人员使用准确鉴定的细胞。通过研究细胞形态特征，监督深度学习在细胞系鉴定方面取得了显著进展。然而，批次效应是一个重要的问题，由于数据生成的不同时间导致了潜在数据分布的巨大偏移，从而使从不同批次培养的细胞系之间的可靠区分变得复杂。为了解决这个挑战，我们引入了CLANet，一种用于基于亮场图像的跨批细胞系鉴定的创新框架，专门设计来解决三种不同的批次效应。我们提出了一种细胞聚类级别的选择方法，以有效捕捉细胞密度变化，并采取自监督学习策略来处理图像质量变化，从而产生可靠的补丁表示。此外，我们采用多实例学习方法来建立模型，通过学习不同批次的实例之间的相关性，从而进一步提高鉴定的准确性。",
    "tldr": "CLANet是一个全面的基于亮场图像的跨批细胞系鉴定框架，通过引入细胞聚类级别的选择方法和自监督学习策略，解决了批次效应导致的数据分布偏移问题，从而提高了细胞系鉴定的准确性和可靠性。"
}