{
    "title": "Discriminatory or Samaritan -- which AI is needed for humanity? An Evolutionary Game Theory Analysis of Hybrid Human-AI populations. (arXiv:2306.17747v1 [cs.MA])",
    "abstract": "As artificial intelligence (AI) systems are increasingly embedded in our lives, their presence leads to interactions that shape our behaviour, decision-making, and social interactions. Existing theoretical research has primarily focused on human-to-human interactions, overlooking the unique dynamics triggered by the presence of AI. In this paper, resorting to methods from evolutionary game theory, we study how different forms of AI influence the evolution of cooperation in a human population playing the one-shot Prisoner's Dilemma game in both well-mixed and structured populations. We found that Samaritan AI agents that help everyone unconditionally, including defectors, can promote higher levels of cooperation in humans than Discriminatory AI that only help those considered worthy/cooperative, especially in slow-moving societies where change is viewed with caution or resistance (small intensities of selection). Intuitively, in fast-moving societies (high intensities of selection), Dis",
    "link": "http://arxiv.org/abs/2306.17747",
    "context": "Title: Discriminatory or Samaritan -- which AI is needed for humanity? An Evolutionary Game Theory Analysis of Hybrid Human-AI populations. (arXiv:2306.17747v1 [cs.MA])\nAbstract: As artificial intelligence (AI) systems are increasingly embedded in our lives, their presence leads to interactions that shape our behaviour, decision-making, and social interactions. Existing theoretical research has primarily focused on human-to-human interactions, overlooking the unique dynamics triggered by the presence of AI. In this paper, resorting to methods from evolutionary game theory, we study how different forms of AI influence the evolution of cooperation in a human population playing the one-shot Prisoner's Dilemma game in both well-mixed and structured populations. We found that Samaritan AI agents that help everyone unconditionally, including defectors, can promote higher levels of cooperation in humans than Discriminatory AI that only help those considered worthy/cooperative, especially in slow-moving societies where change is viewed with caution or resistance (small intensities of selection). Intuitively, in fast-moving societies (high intensities of selection), Dis",
    "path": "papers/23/06/2306.17747.json",
    "total_tokens": 1052,
    "translated_title": "歧视性或撒马利亚式 -- 人类需要哪种人工智能？混合人工智能人口的进化博弈论分析",
    "translated_abstract": "随着人工智能系统越来越嵌入我们的生活，它们的存在导致了塑造我们的行为、决策和社会互动的相互作用。现有的理论研究主要集中在人与人之间的互动上，忽视了人工智能存在导致的独特动态。在本文中，我们采用进化博弈理论的方法，研究了不同形式的人工智能对在混合人工智能人口中进行一次性囚徒困境游戏的合作演化的影响，包括完全混合人口和结构化人口。我们发现，无论是向每个人都无条件提供帮助，包括叛徒，还是只帮助被认为值得或合作的人的撒马利亚人工智能代理人，对于推动人类合作的水平来说，后者要比前者更有利，特别是在变化被谨慎或抵抗视为的缓慢发展的社会中（选择的强度较小）。直观上，在变化快速的社会中（选择的强度较高），歧视性人工智能可以更好地推动合作。",
    "tldr": "这项研究通过进化博弈理论的分析发现，相比于只帮助符合条件的人的歧视性人工智能，撒马利亚式人工智能可以更好地促进人类间的合作。这对于缓慢发展的社会尤为重要，因为在这种社会中，变化被视为谨慎和抵抗。",
    "en_tdlr": "This study, using evolutionary game theory analysis, found that Samaritan AI agents, which help everyone unconditionally, can promote higher levels of human cooperation compared to Discriminatory AI agents that only help those considered worthy/cooperative. This is especially important for slow-moving societies where change is viewed with caution or resistance."
}