{
    "title": "In Search of netUnicorn: A Data-Collection Platform to Develop Generalizable ML Models for Network Security Problems. (arXiv:2306.08853v2 [cs.NI] UPDATED)",
    "abstract": "The remarkable success of the use of machine learning-based solutions for network security problems has been impeded by the developed ML models' inability to maintain efficacy when used in different network environments exhibiting different network behaviors. This issue is commonly referred to as the generalizability problem of ML models. The community has recognized the critical role that training datasets play in this context and has developed various techniques to improve dataset curation to overcome this problem. Unfortunately, these methods are generally ill-suited or even counterproductive in the network security domain, where they often result in unrealistic or poor-quality datasets.  To address this issue, we propose an augmented ML pipeline that leverages explainable ML tools to guide the network data collection in an iterative fashion. To ensure the data's realism and quality, we require that the new datasets should be endogenously collected in this iterative process, thus ad",
    "link": "http://arxiv.org/abs/2306.08853",
    "context": "Title: In Search of netUnicorn: A Data-Collection Platform to Develop Generalizable ML Models for Network Security Problems. (arXiv:2306.08853v2 [cs.NI] UPDATED)\nAbstract: The remarkable success of the use of machine learning-based solutions for network security problems has been impeded by the developed ML models' inability to maintain efficacy when used in different network environments exhibiting different network behaviors. This issue is commonly referred to as the generalizability problem of ML models. The community has recognized the critical role that training datasets play in this context and has developed various techniques to improve dataset curation to overcome this problem. Unfortunately, these methods are generally ill-suited or even counterproductive in the network security domain, where they often result in unrealistic or poor-quality datasets.  To address this issue, we propose an augmented ML pipeline that leverages explainable ML tools to guide the network data collection in an iterative fashion. To ensure the data's realism and quality, we require that the new datasets should be endogenously collected in this iterative process, thus ad",
    "path": "papers/23/06/2306.08853.json",
    "total_tokens": 925,
    "translated_title": "追寻网络独角兽：一个用于开发网络安全问题通用机器学习模型的数据收集平台",
    "translated_abstract": "使用基于机器学习的解决方案解决网络安全问题的显著成功受到了ML模型在不同网络环境中使用时无法保持有效性的影响，因为不同网络环境展现出不同的网络行为。这个问题通常被称为ML模型的一般化问题。社区认识到训练数据集在这个上下文中扮演的关键角色，并开发了各种技术来改善数据集的策划，以克服这个问题。不幸的是，在网络安全领域，这些方法通常不适用，甚至可能产生不现实或质量低下的数据集。为了解决这个问题，我们提出了一个增强的机器学习流程，利用可解释的机器学习工具以迭代的方式指导网络数据的收集。为了确保数据的真实性和质量，我们要求新的数据集在这个迭代过程中应该被内生地收集，从而调整了现有的数据集不足之处。",
    "tldr": "该论文提出了一个用于网络安全问题的通用机器学习模型开发的数据收集平台，解决了ML模型在不同网络环境中的一般化问题，并提出了一个利用可解释的机器学习工具来指导网络数据收集的增强ML流程。"
}