{
    "title": "Lightweight wood panel defect detection method incorporating attention mechanism and feature fusion network. (arXiv:2306.12113v1 [cs.CV])",
    "abstract": "In recent years, deep learning has made significant progress in wood panel defect detection. However, there are still challenges such as low detection , slow detection speed, and difficulties in deploying embedded devices on wood panel surfaces. To overcome these issues, we propose a lightweight wood panel defect detection method called YOLOv5-LW, which incorporates attention mechanisms and a feature fusion network.Firstly, to enhance the detection capability of acceptable defects, we introduce the Multi-scale Bi-directional Feature Pyramid Network (MBiFPN) as a feature fusion network. The MBiFPN reduces feature loss, enriches local and detailed features, and improves the model's detection capability for acceptable defects.Secondly, to achieve a lightweight design, we reconstruct the ShuffleNetv2 network model as the backbone network. This reconstruction reduces the number of parameters and computational requirements while maintaining performance. We also introduce the Stem Block and S",
    "link": "http://arxiv.org/abs/2306.12113",
    "context": "Title: Lightweight wood panel defect detection method incorporating attention mechanism and feature fusion network. (arXiv:2306.12113v1 [cs.CV])\nAbstract: In recent years, deep learning has made significant progress in wood panel defect detection. However, there are still challenges such as low detection , slow detection speed, and difficulties in deploying embedded devices on wood panel surfaces. To overcome these issues, we propose a lightweight wood panel defect detection method called YOLOv5-LW, which incorporates attention mechanisms and a feature fusion network.Firstly, to enhance the detection capability of acceptable defects, we introduce the Multi-scale Bi-directional Feature Pyramid Network (MBiFPN) as a feature fusion network. The MBiFPN reduces feature loss, enriches local and detailed features, and improves the model's detection capability for acceptable defects.Secondly, to achieve a lightweight design, we reconstruct the ShuffleNetv2 network model as the backbone network. This reconstruction reduces the number of parameters and computational requirements while maintaining performance. We also introduce the Stem Block and S",
    "path": "papers/23/06/2306.12113.json",
    "total_tokens": 972,
    "translated_title": "融合关注机制和特征融合网络的轻量级木板缺陷检测方法",
    "translated_abstract": "近年来，深度学习在木板缺陷检测方面取得了重大进展，但是仍存在检测率不高、检测速度慢以及难以在木板表面部署嵌入式设备等挑战。为了克服这些问题，我们提出了一种称为YOLOv5-LW的轻量级木板缺陷检测方法，它集成了注意力机制和特征融合网络。该方法通过引入多尺度双向特征金字塔网络（MBiFPN）作为特征融合网络来增强可接受缺陷的检测能力，同时采用ShuffleNetv2网络模型作为主干网络来实现轻量化设计，引入干扰块和位移块来优化模型，最后引入注意力机制来提高敏感度并减少错误检测。与其他最先进的方法相比，我们的方法在木板缺陷检测任务上实现了更快的检测和更好的性能。",
    "tldr": "提出了一种轻量级木板缺陷检测方法，包括特征融合网络、ShuffleNetv2主干网络、干扰块和位移块的优化以及关注机制，相比其他方法具有更快的检测速度和更好的性能。",
    "en_tdlr": "A lightweight wood panel defect detection method called YOLOv5-LW is proposed, which incorporates attention mechanisms and a feature fusion network. The proposed method achieves faster detection and better performance on wood panel defect detection tasks, compared to other state-of-the-art methods."
}