{
    "title": "Generative Flow Network for Listwise Recommendation. (arXiv:2306.02239v2 [cs.IR] UPDATED)",
    "abstract": "Personalized recommender systems fulfill the daily demands of customers and boost online businesses. The goal is to learn a policy that can generate a list of items that matches the user's demand or interest. While most existing methods learn a pointwise scoring model that predicts the ranking score of each individual item, recent research shows that the listwise approach can further improve the recommendation quality by modeling the intra-list correlations of items that are exposed together. This has motivated the recent list reranking and generative recommendation approaches that optimize the overall utility of the entire list. However, it is challenging to explore the combinatorial space of list actions and existing methods that use cross-entropy loss may suffer from low diversity issues. In this work, we aim to learn a policy that can generate sufficiently diverse item lists for users while maintaining high recommendation quality. The proposed solution, GFN4Rec, is a generative met",
    "link": "http://arxiv.org/abs/2306.02239",
    "context": "Title: Generative Flow Network for Listwise Recommendation. (arXiv:2306.02239v2 [cs.IR] UPDATED)\nAbstract: Personalized recommender systems fulfill the daily demands of customers and boost online businesses. The goal is to learn a policy that can generate a list of items that matches the user's demand or interest. While most existing methods learn a pointwise scoring model that predicts the ranking score of each individual item, recent research shows that the listwise approach can further improve the recommendation quality by modeling the intra-list correlations of items that are exposed together. This has motivated the recent list reranking and generative recommendation approaches that optimize the overall utility of the entire list. However, it is challenging to explore the combinatorial space of list actions and existing methods that use cross-entropy loss may suffer from low diversity issues. In this work, we aim to learn a policy that can generate sufficiently diverse item lists for users while maintaining high recommendation quality. The proposed solution, GFN4Rec, is a generative met",
    "path": "papers/23/06/2306.02239.json",
    "total_tokens": 1073,
    "translated_title": "生成流网络用于列表化推荐",
    "translated_abstract": "个性化推荐系统能够满足用户的日常需求并促进在线业务的发展。本研究的目标是学习一种策略，能够生成符合用户需求或兴趣的项目列表。虽然大多数现有方法学习了一种预测每个单独项目排名得分的点积评分模型，但最近的研究表明，列表式方法通过建模同时展示的项目的内部列表相关性，可以进一步提高推荐质量。这激发了最近的列表重排和生成式推荐方法，它们优化整个列表的总体效用。然而，探索列表操作的组合空间是具有挑战性的，现有使用交叉熵损失的方法可能会遭受低多样性问题。本研究旨在学习一种策略，能够生成用户的足够多样性的项目列表，同时保持高推荐质量。提出的解决方案GFN4Rec是一个生成元学习模型，由生成流网络和列表变换器组成，通过利用生成流网络和处理项目的内部列表相互关联性的列表变换器的强大建模能力，生成具有高质量和多样性的项目列表。在真实世界数据集上的综合实验证明，GFN4Rec在推荐质量和多样性方面优于现有的最先进方法。",
    "tldr": "本文提出了生成流网络用于列表化推荐的解决方案GFN4Rec，通过生成流网络和列表变换器的强大建模能力，生成具有高质量和多样性的项目列表，实验证明其在推荐质量和多样性方面优于现有方法。"
}