{
    "title": "Mastering Nordschleife -- A comprehensive race simulation for AI strategy decision-making in motorsports. (arXiv:2306.16088v1 [cs.AI])",
    "abstract": "In the realm of circuit motorsports, race strategy plays a pivotal role in determining race outcomes. This strategy focuses on the timing of pit stops, which are necessary due to fuel consumption and tire performance degradation. The objective of race strategy is to balance the advantages of pit stops, such as tire replacement and refueling, with the time loss incurred in the pit lane. Current race simulations, used to estimate the best possible race strategy, vary in granularity, modeling of probabilistic events, and require manual input for in-laps. This paper addresses these limitations by developing a novel simulation model tailored to GT racing and leveraging artificial intelligence to automate strategic decisions. By integrating the simulation with OpenAI's Gym framework, a reinforcement learning environment is created and an agent is trained. The study evaluates various hyperparameter configurations, observation spaces, and reward functions, drawing upon historical timing data f",
    "link": "http://arxiv.org/abs/2306.16088",
    "context": "Title: Mastering Nordschleife -- A comprehensive race simulation for AI strategy decision-making in motorsports. (arXiv:2306.16088v1 [cs.AI])\nAbstract: In the realm of circuit motorsports, race strategy plays a pivotal role in determining race outcomes. This strategy focuses on the timing of pit stops, which are necessary due to fuel consumption and tire performance degradation. The objective of race strategy is to balance the advantages of pit stops, such as tire replacement and refueling, with the time loss incurred in the pit lane. Current race simulations, used to estimate the best possible race strategy, vary in granularity, modeling of probabilistic events, and require manual input for in-laps. This paper addresses these limitations by developing a novel simulation model tailored to GT racing and leveraging artificial intelligence to automate strategic decisions. By integrating the simulation with OpenAI's Gym framework, a reinforcement learning environment is created and an agent is trained. The study evaluates various hyperparameter configurations, observation spaces, and reward functions, drawing upon historical timing data f",
    "path": "papers/23/06/2306.16088.json",
    "total_tokens": 932,
    "translated_title": "掌握北环—全面的AI策略决策赛车模拟",
    "translated_abstract": "在赛车运动领域，比赛策略在决定比赛结果中起着关键作用。这一策略集中在停车时间的选择上，这是由于燃油消耗和轮胎性能退化而必要的。比赛策略的目标是在轮胎更换和加油等停车优势与在停车区域所产生的时间损失之间取得平衡。目前的比赛模拟在粒度、概率事件建模和需要手动输入进站时间等方面存在差异。本文通过开发一种专为GT赛车量身定制的新颖仿真模型，并利用人工智能来自动化战略决策来解决这些限制。通过将仿真与OpenAI的Gym框架相结合，创建了一个强化学习环境并训练了一个智能体。本研究评估了不同的超参数配置、观测空间和奖励函数，利用历史时间数据进行了绘制。",
    "tldr": "本文针对当前赛车模拟存在的粒度、建模和手动输入问题，开发了一种新型仿真模型，并应用人工智能自动化了策略决策。该研究通过将仿真与强化学习环境相结合，使用历史数据进行评估，以优化赛车比赛策略决策。",
    "en_tdlr": "This paper addresses the limitations of current race simulations by developing a novel simulation model and using artificial intelligence to automate strategic decisions. By integrating the simulation with reinforcement learning, the study evaluates different configurations to optimize race strategy decision-making using historical data."
}