{
    "title": "Multi-view 3D Object Reconstruction and Uncertainty Modelling with Neural Shape Prior. (arXiv:2306.11739v1 [cs.CV])",
    "abstract": "3D object reconstruction is important for semantic scene understanding. It is challenging to reconstruct detailed 3D shapes from monocular images directly due to a lack of depth information, occlusion and noise. Most current methods generate deterministic object models without any awareness of the uncertainty of the reconstruction. We tackle this problem by leveraging a neural object representation which learns an object shape distribution from large dataset of 3d object models and maps it into a latent space. We propose a method to model uncertainty as part of the representation and define an uncertainty-aware encoder which generates latent codes with uncertainty directly from individual input images. Further, we propose a method to propagate the uncertainty in the latent code to SDF values and generate a 3d object mesh with local uncertainty for each mesh component. Finally, we propose an incremental fusion method under a Bayesian framework to fuse the latent codes from multi-view ob",
    "link": "http://arxiv.org/abs/2306.11739",
    "context": "Title: Multi-view 3D Object Reconstruction and Uncertainty Modelling with Neural Shape Prior. (arXiv:2306.11739v1 [cs.CV])\nAbstract: 3D object reconstruction is important for semantic scene understanding. It is challenging to reconstruct detailed 3D shapes from monocular images directly due to a lack of depth information, occlusion and noise. Most current methods generate deterministic object models without any awareness of the uncertainty of the reconstruction. We tackle this problem by leveraging a neural object representation which learns an object shape distribution from large dataset of 3d object models and maps it into a latent space. We propose a method to model uncertainty as part of the representation and define an uncertainty-aware encoder which generates latent codes with uncertainty directly from individual input images. Further, we propose a method to propagate the uncertainty in the latent code to SDF values and generate a 3d object mesh with local uncertainty for each mesh component. Finally, we propose an incremental fusion method under a Bayesian framework to fuse the latent codes from multi-view ob",
    "path": "papers/23/06/2306.11739.json",
    "total_tokens": 1041,
    "translated_title": "基于神经形状先验的多视角三维物体重建与不确定性建模",
    "translated_abstract": "三维物体重建在语义场景理解中起着重要作用。由于缺乏深度信息、遮挡和噪声等问题，从单ocular图像直接重建详细的三维形状是具有挑战性的。当前大多数方法都是生成确定性的物体模型，并没有意识到重建的不确定性。我们通过利用神经对象表示解决了这个问题，该表示从大型3D对象模型数据集中学习物体形状分布并将其映射到潜在空间中。我们提出了一种方法在表示中建模不确定性，并定义了一种感知不确定性的编码器，直接从单个输入图像生成具有不确定性的潜在代码。此外，我们提出了一种方法将潜在代码中的不确定性传播到SDF值中，并为每个网格组件生成带有局部不确定性的三维对象网格。最后，我们提出了一种基于贝叶斯框架的渐进融合方法，将多角度对象的潜在代码融合成具有不确定性建模的完整3D模型。实验结果表明，我们的方法在单视角和多视角3D重建基准测试上均取得了最先进的性能，同时提供了可靠且定量的不确定性估计。",
    "tldr": "本文提出了一种基于神经形状先验的三维物体重建方法，通过在表示中模拟不确定性，并提供可靠的不确定性估计，这种方法在单视角和多视角3D重建基准测试上均取得了最先进的性能。",
    "en_tdlr": "This paper proposes a multi-view 3D object reconstruction method using a neural object representation that learns shape distribution and models uncertainty as part of the representation. The method achieved state-of-the-art performance on both single and multi-view 3D reconstruction benchmarks while providing reliable and quantitative uncertainty estimates."
}