{
    "title": "Online Resource Allocation with Convex-set Machine-Learned Advice. (arXiv:2306.12282v1 [cs.DS])",
    "abstract": "Decision-makers often have access to a machine-learned prediction about demand, referred to as advice, which can potentially be utilized in online decision-making processes for resource allocation. However, exploiting such advice poses challenges due to its potential inaccuracy. To address this issue, we propose a framework that enhances online resource allocation decisions with potentially unreliable machine-learned (ML) advice. We assume here that this advice is represented by a general convex uncertainty set for the demand vector.  We introduce a parameterized class of Pareto optimal online resource allocation algorithms that strike a balance between consistent and robust ratios. The consistent ratio measures the algorithm's performance (compared to the optimal hindsight solution) when the ML advice is accurate, while the robust ratio captures performance under an adversarial demand process when the advice is inaccurate. Specifically, in a C-Pareto optimal setting, we maximize the r",
    "link": "http://arxiv.org/abs/2306.12282",
    "context": "Title: Online Resource Allocation with Convex-set Machine-Learned Advice. (arXiv:2306.12282v1 [cs.DS])\nAbstract: Decision-makers often have access to a machine-learned prediction about demand, referred to as advice, which can potentially be utilized in online decision-making processes for resource allocation. However, exploiting such advice poses challenges due to its potential inaccuracy. To address this issue, we propose a framework that enhances online resource allocation decisions with potentially unreliable machine-learned (ML) advice. We assume here that this advice is represented by a general convex uncertainty set for the demand vector.  We introduce a parameterized class of Pareto optimal online resource allocation algorithms that strike a balance between consistent and robust ratios. The consistent ratio measures the algorithm's performance (compared to the optimal hindsight solution) when the ML advice is accurate, while the robust ratio captures performance under an adversarial demand process when the advice is inaccurate. Specifically, in a C-Pareto optimal setting, we maximize the r",
    "path": "papers/23/06/2306.12282.json",
    "total_tokens": 962,
    "translated_title": "凸集机器学习建议下的在线资源分配",
    "translated_abstract": "在线决策者通常会使用机器学习预测需求，称为建议，该建议可以在资源分配的在线决策过程中潜在地被利用。但是，由于其潜在的不准确性，利用这样的建议会带来挑战。为了解决这个问题，我们提出了一个框架，通过潜在不可靠的机器学习建议增强在线资源分配决策。我们假设该建议由需求向量的一般凸不确定性集表示。我们介绍了一种参数化的 Pareto 最优在线资源分配算法类，该算法在一致比率和鲁棒比率之间平衡。一致比率是指当机器学习建议准确时，算法相对于最优的后见之明解的表现，而鲁棒比率则捕获了建议不准确时对抗性需求过程下的表现。具体而言，我们在 C-Pareto 最优情况下，最大化资源利用，同时在一致比率和鲁棒比率之间实现平衡。我们的实验表明，我们提出的框架在合成和真实数据集上均优于基线。",
    "tldr": "该论文提出了一个框架，使用凸集机器学习建议来增强在线资源分配决策。该算法类在一致比率和鲁棒比率之间平衡，并在实验中表现出优异的性能。"
}