{
    "title": "Analysis of ChatGPT on Source Code. (arXiv:2306.00597v2 [cs.SE] UPDATED)",
    "abstract": "This paper explores the use of Large Language Models (LLMs) and in particular ChatGPT in programming, source code analysis, and code generation. LLMs and ChatGPT are built using machine learning and artificial intelligence techniques, and they offer several benefits to developers and programmers. While these models can save time and provide highly accurate results, they are not yet advanced enough to replace human programmers entirely. The paper investigates the potential applications of LLMs and ChatGPT in various areas, such as code creation, code documentation, bug detection, refactoring, and more. The paper also suggests that the usage of LLMs and ChatGPT is expected to increase in the future as they offer unparalleled benefits to the programming community.",
    "link": "http://arxiv.org/abs/2306.00597",
    "context": "Title: Analysis of ChatGPT on Source Code. (arXiv:2306.00597v2 [cs.SE] UPDATED)\nAbstract: This paper explores the use of Large Language Models (LLMs) and in particular ChatGPT in programming, source code analysis, and code generation. LLMs and ChatGPT are built using machine learning and artificial intelligence techniques, and they offer several benefits to developers and programmers. While these models can save time and provide highly accurate results, they are not yet advanced enough to replace human programmers entirely. The paper investigates the potential applications of LLMs and ChatGPT in various areas, such as code creation, code documentation, bug detection, refactoring, and more. The paper also suggests that the usage of LLMs and ChatGPT is expected to increase in the future as they offer unparalleled benefits to the programming community.",
    "path": "papers/23/06/2306.00597.json",
    "total_tokens": 767,
    "translated_title": "ChatGPT在源代码分析中的应用分析",
    "translated_abstract": "本文探索了使用大型语言模型（LLMs）特别是 ChatGPT 在编程、源代码分析和代码生成中的应用。LLMs 和 ChatGPT 使用机器学习和人工智能技术构建，并为开发人员和程序员提供多种好处。尽管这些模型可以节省时间并提供高度准确的结果，但它们还不足以完全取代人类程序员。该论文研究了 LLMS 和 ChatGPT 在代码创建、代码文档、缺陷检测、重构等各个领域的潜在应用。该论文还建议，随着 LLM 和 ChatGPT 为编程社区提供无与伦比的好处，它们的使用预计将在未来增加。",
    "tldr": "本论文探讨了大型语言模型 ChatGPT 在源代码分析中的应用，其将为程序员提供准确和高效的帮助，并在代码创建、文档编写、缺陷检测和代码重构等方面具有潜在的应用前景。",
    "en_tdlr": "This paper discusses the application of the Large Language Model ChatGPT in source code analysis, which provides accurate and efficient help for programmers and has potential applications in code creation, documentation, bug detection, and code refactoring."
}