{
    "title": "Generalizable Lightweight Proxy for Robust NAS against Diverse Perturbations. (arXiv:2306.05031v1 [cs.LG])",
    "abstract": "Recent neural architecture search (NAS) frameworks have been successful in finding optimal architectures for given conditions (e.g., performance or latency). However, they search for optimal architectures in terms of their performance on clean images only, while robustness against various types of perturbations or corruptions is crucial in practice. Although there exist several robust NAS frameworks that tackle this issue by integrating adversarial training into one-shot NAS, however, they are limited in that they only consider robustness against adversarial attacks and require significant computational resources to discover optimal architectures for a single task, which makes them impractical in real-world scenarios. To address these challenges, we propose a novel lightweight robust zero-cost proxy that considers the consistency across features, parameters, and gradients of both clean and perturbed images at the initialization state. Our approach facilitates an efficient and rapid sea",
    "link": "http://arxiv.org/abs/2306.05031",
    "context": "Title: Generalizable Lightweight Proxy for Robust NAS against Diverse Perturbations. (arXiv:2306.05031v1 [cs.LG])\nAbstract: Recent neural architecture search (NAS) frameworks have been successful in finding optimal architectures for given conditions (e.g., performance or latency). However, they search for optimal architectures in terms of their performance on clean images only, while robustness against various types of perturbations or corruptions is crucial in practice. Although there exist several robust NAS frameworks that tackle this issue by integrating adversarial training into one-shot NAS, however, they are limited in that they only consider robustness against adversarial attacks and require significant computational resources to discover optimal architectures for a single task, which makes them impractical in real-world scenarios. To address these challenges, we propose a novel lightweight robust zero-cost proxy that considers the consistency across features, parameters, and gradients of both clean and perturbed images at the initialization state. Our approach facilitates an efficient and rapid sea",
    "path": "papers/23/06/2306.05031.json",
    "total_tokens": 903,
    "translated_title": "鲁棒性神经架构搜索中的可推广轻量级代理",
    "translated_abstract": "最近的神经架构搜索（NAS）框架已成功在给定条件下（例如性能或延迟）找到最佳架构。然而，它们只针对干净图像的性能寻找最佳架构，而在实践中，对于各种类型的扰动或损坏的鲁棒性非常重要。尽管存在几个通过将对抗性训练集成到单次NAS中来解决这个问题的鲁棒性NAS框架，但它们的局限性在于它们只考虑对抗攻击的鲁棒性，并需要大量计算资源才能为单个任务发现最佳架构，这使它们在实际应用中不切实际。为了解决这些挑战，我们提出了一种新颖的轻量级鲁棒零成本代理，该代理在初始化状态下考虑干净图像和受扰动图像的特征、参数和梯度的一致性。我们的方法有助于快速、高效地搜索鲁棒NAS架构。",
    "tldr": "本研究提出了一种轻量级的、零成本代理，通过考虑干净图像和受扰动图像的特征、参数和梯度的一致性，实现了高效、快速地搜索鲁棒NAS架构。",
    "en_tdlr": "This paper proposes a lightweight and zero-cost proxy that efficiently searches for robust neural architecture by considering consistency across features, parameters, and gradients of both clean and perturbed images at the initialization state."
}