{
    "title": "Performance Analysis of DNN Inference/Training with Convolution and non-Convolution Operations. (arXiv:2306.16767v1 [cs.AR])",
    "abstract": "Today's performance analysis frameworks for deep learning accelerators suffer from two significant limitations. First, although modern convolutional neural network (CNNs) consist of many types of layers other than convolution, especially during training, these frameworks largely focus on convolution layers only. Second, these frameworks are generally targeted towards inference, and lack support for training operations. This work proposes a novel performance analysis framework, SimDIT, for general ASIC-based systolic hardware accelerator platforms. The modeling effort of SimDIT comprehensively covers convolution and non-convolution operations of both CNN inference and training on a highly parameterizable hardware substrate. SimDIT is integrated with a backend silicon implementation flow and provides detailed end-to-end performance statistics (i.e., data access cost, cycle counts, energy, and power) for executing CNN inference and training workloads. SimDIT-enabled performance analysis r",
    "link": "http://arxiv.org/abs/2306.16767",
    "context": "Title: Performance Analysis of DNN Inference/Training with Convolution and non-Convolution Operations. (arXiv:2306.16767v1 [cs.AR])\nAbstract: Today's performance analysis frameworks for deep learning accelerators suffer from two significant limitations. First, although modern convolutional neural network (CNNs) consist of many types of layers other than convolution, especially during training, these frameworks largely focus on convolution layers only. Second, these frameworks are generally targeted towards inference, and lack support for training operations. This work proposes a novel performance analysis framework, SimDIT, for general ASIC-based systolic hardware accelerator platforms. The modeling effort of SimDIT comprehensively covers convolution and non-convolution operations of both CNN inference and training on a highly parameterizable hardware substrate. SimDIT is integrated with a backend silicon implementation flow and provides detailed end-to-end performance statistics (i.e., data access cost, cycle counts, energy, and power) for executing CNN inference and training workloads. SimDIT-enabled performance analysis r",
    "path": "papers/23/06/2306.16767.json",
    "total_tokens": 915,
    "translated_title": "DNN推理/训练中卷积和非卷积操作的性能分析",
    "translated_abstract": "当前用于深度学习加速器的性能分析框架存在两个主要限制。首先，尽管现代卷积神经网络（CNN）除了卷积层之外还包括许多其他类型的层，在训练过程中尤其如此，但这些框架主要集中在卷积层上。其次，这些框架通常针对推理，缺乏对训练操作的支持。本文提出了一种新颖的性能分析框架SimDIT，用于通用ASIC系统级硬件加速器平台。SimDIT的建模工作全面覆盖了CNN推理和训练中的卷积和非卷积操作，并在高度可参数化的硬件底层上。SimDIT与后端硅实现流程集成，为执行CNN推理和训练工作负载提供了详细的端到端性能统计（如数据访问成本、循环计数、能量和功率）。SimDIT的性能分析功能为性能分析提供了一种全面而有效的方法。",
    "tldr": "本文提出了SimDIT，一种新颖的性能分析框架，用于通用ASIC系统级硬件加速器平台上的CNN推理和训练。SimDIT综合考虑了卷积和非卷积操作，并提供了详细的性能统计数据。",
    "en_tdlr": "This paper proposes SimDIT, a novel performance analysis framework for CNN inference and training on general ASIC hardware accelerators. SimDIT comprehensively considers convolution and non-convolution operations, and provides detailed performance statistics."
}