{
    "title": "Towards Building Voice-based Conversational Recommender Systems: Datasets, Potential Solutions, and Prospects. (arXiv:2306.08219v1 [cs.IR])",
    "abstract": "Conversational recommender systems (CRSs) have become crucial emerging research topics in the field of RSs, thanks to their natural advantages of explicitly acquiring user preferences via interactive conversations and revealing the reasons behind recommendations. However, the majority of current CRSs are text-based, which is less user-friendly and may pose challenges for certain users, such as those with visual impairments or limited writing and reading abilities. Therefore, for the first time, this paper investigates the potential of voice-based CRS (VCRSs) to revolutionize the way users interact with RSs in a natural, intuitive, convenient, and accessible fashion. To support such studies, we create two VCRSs benchmark datasets in the e-commerce and movie domains, after realizing the lack of such datasets through an exhaustive literature review. Specifically, we first empirically verify the benefits and necessity of creating such datasets. Thereafter, we convert the user-item interact",
    "link": "http://arxiv.org/abs/2306.08219",
    "context": "Title: Towards Building Voice-based Conversational Recommender Systems: Datasets, Potential Solutions, and Prospects. (arXiv:2306.08219v1 [cs.IR])\nAbstract: Conversational recommender systems (CRSs) have become crucial emerging research topics in the field of RSs, thanks to their natural advantages of explicitly acquiring user preferences via interactive conversations and revealing the reasons behind recommendations. However, the majority of current CRSs are text-based, which is less user-friendly and may pose challenges for certain users, such as those with visual impairments or limited writing and reading abilities. Therefore, for the first time, this paper investigates the potential of voice-based CRS (VCRSs) to revolutionize the way users interact with RSs in a natural, intuitive, convenient, and accessible fashion. To support such studies, we create two VCRSs benchmark datasets in the e-commerce and movie domains, after realizing the lack of such datasets through an exhaustive literature review. Specifically, we first empirically verify the benefits and necessity of creating such datasets. Thereafter, we convert the user-item interact",
    "path": "papers/23/06/2306.08219.json",
    "total_tokens": 944,
    "translated_title": "构建基于语音的对话式推荐系统：数据集、潜在解决方案和前景探讨",
    "translated_abstract": "对话式推荐系统(CRSs)由于其通过交互式对话明确获取用户偏好和揭示推荐原因等自然优势而成为推荐系统领域的重要研究主题。然而，当前大多数CRSs都是基于文本的，这不太用户友好，并可能对某些用户造成挑战，例如那些视力受损或读写能力有限的用户。因此，本文首次研究了基于语音的CRS(VCRSs)的潜力，以在自然、直观、便利和易于访问的方式下改革用户与RSs互动的方式。为支持这样的研究，我们在电子商务和电影领域创建了两个VCRSs基准数据集，经过详尽的文献综述后发现了这种数据集的缺乏。具体而言，我们首先在实践中验证了创建这些数据集的好处和必要性。之后，我们将用户-物品交互数据转换为自然语言，形成了基于语音的数据集。",
    "tldr": "本文调查了基于语音的对话式推荐系统的潜力，并为电子商务和电影领域创建了两个VCRSs基准数据集，以帮助实现自然、直观、便利和易于访问的用户与RSs互动方式。",
    "en_tdlr": "This paper investigates the potential of voice-based conversational recommender systems (VCRSs) and creates two VCRS benchmark datasets in e-commerce and movie domains to help achieve a natural, intuitive, convenient, and accessible way for users to interact with RSs."
}