{
    "title": "Biomedical Entity Recognition by Detection and Matching. (arXiv:2306.15736v1 [cs.CL])",
    "abstract": "Biomedical named entity recognition (BNER) serves as the foundation for numerous biomedical text mining tasks. Unlike general NER, BNER require a comprehensive grasp of the domain, and incorporating external knowledge beyond training data poses a significant challenge. In this study, we propose a novel BNER framework called DMNER. By leveraging existing entity representation models SAPBERT, we tackle BNER as a two-step process: entity boundary detection and biomedical entity matching. DMNER exhibits applicability across multiple NER scenarios: 1) In supervised NER, we observe that DMNER effectively rectifies the output of baseline NER models, thereby further enhancing performance. 2) In distantly supervised NER, combining MRC and AutoNER as span boundary detectors enables DMNER to achieve satisfactory results. 3) For training NER by merging multiple datasets, we adopt a framework similar to DS-NER but additionally leverage ChatGPT to obtain high-quality phrases in the training. Through",
    "link": "http://arxiv.org/abs/2306.15736",
    "context": "Title: Biomedical Entity Recognition by Detection and Matching. (arXiv:2306.15736v1 [cs.CL])\nAbstract: Biomedical named entity recognition (BNER) serves as the foundation for numerous biomedical text mining tasks. Unlike general NER, BNER require a comprehensive grasp of the domain, and incorporating external knowledge beyond training data poses a significant challenge. In this study, we propose a novel BNER framework called DMNER. By leveraging existing entity representation models SAPBERT, we tackle BNER as a two-step process: entity boundary detection and biomedical entity matching. DMNER exhibits applicability across multiple NER scenarios: 1) In supervised NER, we observe that DMNER effectively rectifies the output of baseline NER models, thereby further enhancing performance. 2) In distantly supervised NER, combining MRC and AutoNER as span boundary detectors enables DMNER to achieve satisfactory results. 3) For training NER by merging multiple datasets, we adopt a framework similar to DS-NER but additionally leverage ChatGPT to obtain high-quality phrases in the training. Through",
    "path": "papers/23/06/2306.15736.json",
    "total_tokens": 970,
    "translated_title": "通过检测和匹配进行生物医学实体识别",
    "translated_abstract": "生物医学命名实体识别（BNER）是许多生物医学文本挖掘任务的基础。与一般的NER不同，BNER需要全面掌握领域知识，而且在训练数据之外融入外部知识是一个重大挑战。本研究提出了一个新的BNER框架，称为DMNER。通过利用已有的实体表示模型SAPBERT，我们将BNER作为一个两步骤的过程来处理：实体边界检测和生物医学实体匹配。DMNER在多种NER场景中具有适用性：1）在有监督NER中，我们观察到DMNER有效纠正了基线NER模型的输出，从而进一步提高了性能。2）在远程监督NER中，将MRC和AutoNER作为跨度边界检测器相结合，使DMNER能够实现令人满意的结果。3）对于通过合并多个数据集进行NER训练，我们采用了与DS-NER类似的框架，但还额外利用ChatGPT来获得高质量的训练短语。",
    "tldr": "本研究提出了一种名为DMNER的新型生物医学实体识别框架，通过检测实体边界和匹配生物医学实体来提高NER的性能。在有监督NER、远程监督NER和多数据集合并训练NER等场景中，DMNER都展示了良好的适用性。"
}