{
    "title": "Phase Space Analysis of Cardiac Spectra. (arXiv:2306.15425v1 [physics.med-ph])",
    "abstract": "Cardiac diseases are one of the main reasons of mortality in modern, industrialized societies, and they cause high expenses in public health systems. Therefore, it is important to develop analytical methods to improve cardiac diagnostics. Electric activity of heart was first modeled by using a set of nonlinear differential equations. Latter, variations of cardiac spectra originated from deterministic dynamics are investigated. Analyzing the power spectra of a normal human heart presents His-Purkinje network, possessing a fractal like structure. Phase space trajectories are extracted from the time series graph of ECG. Lower values of fractal dimension, D indicate dynamics that are more coherent. If D has non-integer values greater than two when the system becomes chaotic or strange attractor. Recently, the development of a fast and robust method, which can be applied to multichannel physiologic signals, was reported. This manuscript investigates two different ECG systems produced from n",
    "link": "http://arxiv.org/abs/2306.15425",
    "context": "Title: Phase Space Analysis of Cardiac Spectra. (arXiv:2306.15425v1 [physics.med-ph])\nAbstract: Cardiac diseases are one of the main reasons of mortality in modern, industrialized societies, and they cause high expenses in public health systems. Therefore, it is important to develop analytical methods to improve cardiac diagnostics. Electric activity of heart was first modeled by using a set of nonlinear differential equations. Latter, variations of cardiac spectra originated from deterministic dynamics are investigated. Analyzing the power spectra of a normal human heart presents His-Purkinje network, possessing a fractal like structure. Phase space trajectories are extracted from the time series graph of ECG. Lower values of fractal dimension, D indicate dynamics that are more coherent. If D has non-integer values greater than two when the system becomes chaotic or strange attractor. Recently, the development of a fast and robust method, which can be applied to multichannel physiologic signals, was reported. This manuscript investigates two different ECG systems produced from n",
    "path": "papers/23/06/2306.15425.json",
    "total_tokens": 856,
    "translated_title": "心脏频谱的相空间分析",
    "translated_abstract": "心脏疾病是现代工业化社会死亡的主要原因之一，并导致公共卫生系统的高额开支。因此，开发分析方法以改善心脏诊断非常重要。通过使用一组非线性微分方程对心脏的电活动进行了首次建模。随后，研究了起源于确定性动力学的心脏频谱的变化。通过分析正常人心脏的功率谱，可以发现具有类似分形结构的希斯-普尔金杰网络。从心电图的时间序列图中提取相空间轨迹。分形维数D的较低值表示更加一致的动力学。当D具有大于2的非整数值时，系统变得混沌或具有奇特吸引子。最近，报道了一种可以应用于多通道生理信号的快速而稳健的方法的开发。本文研究了两种不同的从n产生的心电图系统。",
    "tldr": "本研究通过相空间分析心脏频谱，找到了心脏疾病的改善方法，并提出了一种适用于多通道生理信号的快速和稳健的诊断方法。"
}