{
    "title": "Constructing Multilingual Code Search Dataset Using Neural Machine Translation. (arXiv:2306.15604v1 [cs.CL])",
    "abstract": "Code search is a task to find programming codes that semantically match the given natural language queries. Even though some of the existing datasets for this task are multilingual on the programming language side, their query data are only in English. In this research, we create a multilingual code search dataset in four natural and four programming languages using a neural machine translation model. Using our dataset, we pre-train and fine-tune the Transformer-based models and then evaluate them on multiple code search test sets. Our results show that the model pre-trained with all natural and programming language data has performed best in most cases. By applying back-translation data filtering to our dataset, we demonstrate that the translation quality affects the model's performance to a certain extent, but the data size matters more.",
    "link": "http://arxiv.org/abs/2306.15604",
    "context": "Title: Constructing Multilingual Code Search Dataset Using Neural Machine Translation. (arXiv:2306.15604v1 [cs.CL])\nAbstract: Code search is a task to find programming codes that semantically match the given natural language queries. Even though some of the existing datasets for this task are multilingual on the programming language side, their query data are only in English. In this research, we create a multilingual code search dataset in four natural and four programming languages using a neural machine translation model. Using our dataset, we pre-train and fine-tune the Transformer-based models and then evaluate them on multiple code search test sets. Our results show that the model pre-trained with all natural and programming language data has performed best in most cases. By applying back-translation data filtering to our dataset, we demonstrate that the translation quality affects the model's performance to a certain extent, but the data size matters more.",
    "path": "papers/23/06/2306.15604.json",
    "total_tokens": 846,
    "translated_title": "使用神经机器翻译构建多语言代码检索数据集",
    "translated_abstract": "代码检索是一项寻找与给定自然语言查询语义匹配的编程代码的任务。尽管某些现有数据集在编程语言一侧是多语言的，但它们的查询数据仅限于英语。在这项研究中，我们利用神经机器翻译模型创建了一个包含四种自然语言和四种编程语言的多语言代码检索数据集。使用我们的数据集，我们对基于Transformer的模型进行预训练和微调，然后在多个代码检索测试集上进行评估。我们的结果表明，在大多数情况下，使用所有自然语言和编程语言数据进行预训练的模型表现最好。通过对我们的数据集应用反向翻译数据过滤，我们证明翻译质量在一定程度上影响模型的性能，但数据规模更为重要。",
    "tldr": "该论文利用神经机器翻译模型创建了一个多语言代码检索数据集，并通过预训练和微调Transformer模型，在多个代码检索测试集上取得了最佳效果。研究结果表明，翻译质量对模型性能有一定影响，但数据规模更为重要。",
    "en_tdlr": "This paper constructs a multilingual code search dataset using a neural machine translation model and achieves the best performance by pre-training and fine-tuning Transformer models on multiple code search test sets. The results show that translation quality has a certain impact on model performance, but data size matters more."
}