{
    "title": "BISCUIT: Causal Representation Learning from Binary Interactions. (arXiv:2306.09643v1 [cs.LG])",
    "abstract": "Identifying the causal variables of an environment and how to intervene on them is of core value in applications such as robotics and embodied AI. While an agent can commonly interact with the environment and may implicitly perturb the behavior of some of these causal variables, often the targets it affects remain unknown. In this paper, we show that causal variables can still be identified for many common setups, e.g., additive Gaussian noise models, if the agent's interactions with a causal variable can be described by an unknown binary variable. This happens when each causal variable has two different mechanisms, e.g., an observational and an interventional one. Using this identifiability result, we propose BISCUIT, a method for simultaneously learning causal variables and their corresponding binary interaction variables. On three robotic-inspired datasets, BISCUIT accurately identifies causal variables and can even be scaled to complex, realistic environments for embodied AI.",
    "link": "http://arxiv.org/abs/2306.09643",
    "context": "Title: BISCUIT: Causal Representation Learning from Binary Interactions. (arXiv:2306.09643v1 [cs.LG])\nAbstract: Identifying the causal variables of an environment and how to intervene on them is of core value in applications such as robotics and embodied AI. While an agent can commonly interact with the environment and may implicitly perturb the behavior of some of these causal variables, often the targets it affects remain unknown. In this paper, we show that causal variables can still be identified for many common setups, e.g., additive Gaussian noise models, if the agent's interactions with a causal variable can be described by an unknown binary variable. This happens when each causal variable has two different mechanisms, e.g., an observational and an interventional one. Using this identifiability result, we propose BISCUIT, a method for simultaneously learning causal variables and their corresponding binary interaction variables. On three robotic-inspired datasets, BISCUIT accurately identifies causal variables and can even be scaled to complex, realistic environments for embodied AI.",
    "path": "papers/23/06/2306.09643.json",
    "total_tokens": 759,
    "translated_title": "BISCUIT: 从二进制交互中学习因果关系表征",
    "translated_abstract": "在机器人和实体AI等应用中，识别环境中的因果变量以及如何对它们进行干预具有核心价值。本文提出了一种方法，即在许多常见的设置中，例如加性高斯噪声模型中仍然可以确定因果变量，如果智能体与因果变量的交互可以用未知的二进制变量描述。我们通过这一可识别性结果提出BISCUIT，一种同时学习因果变量及其对应二进制交互变量的方法。在三个机器人启发的数据集上，BISCUIT准确地识别出因果变量，甚至可以扩展到复杂的、逼真的实体AI环境中。",
    "tldr": "本文提出了一种名为BISCUIT的方法，可以在许多常见的设置中确定因果变量，并在机器人启发的数据集上进行了测试，表现良好。",
    "en_tdlr": "This paper proposes a method called BISCUIT that can identify causal variables in many common settings and performs well on robotic-inspired datasets."
}