{
    "title": "Automatic Assessment of Divergent Thinking in Chinese Language with TransDis: A Transformer-Based Language Model Approach. (arXiv:2306.14790v2 [cs.CL] UPDATED)",
    "abstract": "Language models have been increasingly popular for automatic creativity assessment, generating semantic distances to objectively measure the quality of creative ideas. However, there is currently a lack of an automatic assessment system for evaluating creative ideas in the Chinese language. To address this gap, we developed TransDis, a scoring system using transformer-based language models, capable of providing valid originality (quality) and flexibility (variety) scores for Alternative Uses Task (AUT) responses in Chinese. Study 1 demonstrated that the latent model-rated originality factor, comprised of three transformer-based models, strongly predicted human originality ratings, and the model-rated flexibility strongly correlated with human flexibility ratings as well. Criterion validity analyses indicated that model-rated originality and flexibility positively correlated to other creativity measures, demonstrating similar validity to human ratings. Study 2 & 3 showed that TransDis e",
    "link": "http://arxiv.org/abs/2306.14790",
    "context": "Title: Automatic Assessment of Divergent Thinking in Chinese Language with TransDis: A Transformer-Based Language Model Approach. (arXiv:2306.14790v2 [cs.CL] UPDATED)\nAbstract: Language models have been increasingly popular for automatic creativity assessment, generating semantic distances to objectively measure the quality of creative ideas. However, there is currently a lack of an automatic assessment system for evaluating creative ideas in the Chinese language. To address this gap, we developed TransDis, a scoring system using transformer-based language models, capable of providing valid originality (quality) and flexibility (variety) scores for Alternative Uses Task (AUT) responses in Chinese. Study 1 demonstrated that the latent model-rated originality factor, comprised of three transformer-based models, strongly predicted human originality ratings, and the model-rated flexibility strongly correlated with human flexibility ratings as well. Criterion validity analyses indicated that model-rated originality and flexibility positively correlated to other creativity measures, demonstrating similar validity to human ratings. Study 2 & 3 showed that TransDis e",
    "path": "papers/23/06/2306.14790.json",
    "total_tokens": 932,
    "translated_title": "基于Transformer的语言模型方法在中文发散性思维的自动评估中的应用——TransDis",
    "translated_abstract": "语言模型在自动创造力评估中越来越受欢迎，通过生成语义距离来客观地衡量创造性思维的质量。然而，目前缺乏一个针对中文创造性思维评估的自动化系统。为了填补这个空白，我们开发了TransDis，一个采用基于Transformer的语言模型的评分系统，能够为中文中的Alternate Uses Task（AUT）回答提供有效的独创性（质量）和灵活性（多样性）评分。研究1表明，由三个基于Transformer的模型组成的潜在模型评分的原创性因素强烈预测人工原创性评分，而模型评分的灵活性与人工灵活性评分也强相关。准则效度分析表明，模型评分的原创性和灵活性与其他创造力测量正相关，证明与人工评分具有相似的效度。研究2和3表明，TransDis能够快速、准确地评估中文发散性思维的特征。",
    "tldr": "TransDis是一个基于Transformer的语言模型评分系统，用于评估中文发散性思维的质量和多样性。经过实验证明，TransDis的评分能够有效地预测人工评分，具有与人工评分相似的效度。"
}