{
    "title": "Matrix Diagonalization as a Board Game: Teaching an Eigensolver the Fastest Path to Solution. (arXiv:2306.10075v2 [math.NA] UPDATED)",
    "abstract": "Matrix diagonalization is at the cornerstone of numerous fields of scientific computing. Diagonalizing a matrix to solve an eigenvalue problem requires a sequential path of iterations that eventually reaches a sufficiently converged and accurate solution for all the eigenvalues and eigenvectors. This typically translates into a high computational cost. Here we demonstrate how reinforcement learning, using the AlphaZero framework, can accelerate Jacobi matrix diagonalizations by viewing the selection of the fastest path to solution as a board game. To demonstrate the viability of our approach we apply the Jacobi diagonalization algorithm to symmetric Hamiltonian matrices that appear in quantum chemistry calculations. We find that a significant acceleration can often be achieved. Our findings highlight the opportunity to use machine learning as a promising tool to improve the performance of numerical linear algebra.",
    "link": "http://arxiv.org/abs/2306.10075",
    "context": "Title: Matrix Diagonalization as a Board Game: Teaching an Eigensolver the Fastest Path to Solution. (arXiv:2306.10075v2 [math.NA] UPDATED)\nAbstract: Matrix diagonalization is at the cornerstone of numerous fields of scientific computing. Diagonalizing a matrix to solve an eigenvalue problem requires a sequential path of iterations that eventually reaches a sufficiently converged and accurate solution for all the eigenvalues and eigenvectors. This typically translates into a high computational cost. Here we demonstrate how reinforcement learning, using the AlphaZero framework, can accelerate Jacobi matrix diagonalizations by viewing the selection of the fastest path to solution as a board game. To demonstrate the viability of our approach we apply the Jacobi diagonalization algorithm to symmetric Hamiltonian matrices that appear in quantum chemistry calculations. We find that a significant acceleration can often be achieved. Our findings highlight the opportunity to use machine learning as a promising tool to improve the performance of numerical linear algebra.",
    "path": "papers/23/06/2306.10075.json",
    "total_tokens": 836,
    "translated_title": "将矩阵对角化作为一种棋盘游戏: 教授本征值求解器最快的解决路径",
    "translated_abstract": "矩阵对角化是科学计算中许多领域的基础。对角化矩阵以解决特征值问题需要一系列迭代，最终达到所有特征值和特征向量的充分收敛和精确解决。这通常会导致高计算成本。在这里，我们展示了如何使用 AlphaZero 框架的强化学习，将选择最快的解决方案的过程视为棋盘游戏，以加速 Jacobi 对角化。为了证明我们方法的可行性，我们将 Jacobi 对角化算法应用于出现在量子化学计算中的对称哈密顿矩阵。我们发现通常可以实现显着加速。我们的发现突显了使用机器学习作为改进数值线性代数性能的一种有前途的工具。",
    "tldr": "本文展示了如何使用强化学习加速矩阵对角化，将选择最快的解决方案的过程视为棋盘游戏，为数值线性代数的性能提供了一种有前途的工具。",
    "en_tdlr": "This paper demonstrates how to use reinforcement learning to accelerate matrix diagonalization by viewing the selection of the fastest path to solution as a board game, providing a promising tool for improving the performance of numerical linear algebra."
}