{
    "title": "Perceptions and Realities of Text-to-Image Generation. (arXiv:2306.08363v2 [cs.HC] UPDATED)",
    "abstract": "Generative artificial intelligence (AI) is a widely popular technology that will have a profound impact on society and individuals. Less than a decade ago, it was thought that creative work would be among the last to be automated - yet today, we see AI encroaching on many creative domains. In this paper, we present the findings of a survey study on people's perceptions of text-to-image generation. We touch on participants' technical understanding of the emerging technology, their fears and concerns, and thoughts about risks and dangers of text-to-image generation to the individual and society. We find that while participants were aware of the risks and dangers associated with the technology, only few participants considered the technology to be a personal risk. The risks for others were more easy to recognize for participants. Artists were particularly seen at risk. Interestingly, participants who had tried the technology rated its future importance lower than those who had not tried i",
    "link": "http://arxiv.org/abs/2306.08363",
    "context": "Title: Perceptions and Realities of Text-to-Image Generation. (arXiv:2306.08363v2 [cs.HC] UPDATED)\nAbstract: Generative artificial intelligence (AI) is a widely popular technology that will have a profound impact on society and individuals. Less than a decade ago, it was thought that creative work would be among the last to be automated - yet today, we see AI encroaching on many creative domains. In this paper, we present the findings of a survey study on people's perceptions of text-to-image generation. We touch on participants' technical understanding of the emerging technology, their fears and concerns, and thoughts about risks and dangers of text-to-image generation to the individual and society. We find that while participants were aware of the risks and dangers associated with the technology, only few participants considered the technology to be a personal risk. The risks for others were more easy to recognize for participants. Artists were particularly seen at risk. Interestingly, participants who had tried the technology rated its future importance lower than those who had not tried i",
    "path": "papers/23/06/2306.08363.json",
    "total_tokens": 945,
    "translated_title": "文本到图像生成的认知与现实",
    "translated_abstract": "生成式人工智能是一种广泛流行的技术，将深刻影响社会和个人。不到十年前，人们认为创造性工作将是最后自动化的领域之一，然而如今，我们看到人工智能正在侵占许多创造性领域。本文通过一项调查研究，提出了人们对于文本到图像生成的认知。我们涉及参与者对这一新兴技术的技术理解，他们的担忧和顾虑，以及对文本到图像生成对个人和社会的风险和危险的看法。我们发现，尽管参与者意识到与这项技术相关的风险和危险，但只有少数参与者认为这项技术对个人构成了风险。对其他人的风险更容易被参与者认识到。艺术家尤其被视为风险群体。有趣的是，那些尝试过这项技术的参与者对其未来重要性的评价较低。",
    "tldr": "本研究通过调查了解人们对文本到图像生成的认知，发现参与者意识到该技术的风险和危险，但只有少数人认为这项技术对个人构成风险，而对他人的风险较易被认识到，特别是艺术家被视为风险群体。",
    "en_tdlr": "This study investigates people's perceptions of text-to-image generation, finding that while participants were aware of the risks and dangers associated with the technology, only few considered it to be a personal risk. The risks for others, especially artists, were more recognized."
}