{
    "title": "Machine Learning and Hamilton-Jacobi-Bellman Equation for Optimal Decumulation: a Comparison Study. (arXiv:2306.10582v1 [math.OC])",
    "abstract": "We propose a novel data-driven neural network (NN) optimization framework for solving an optimal stochastic control problem under stochastic constraints. Customized activation functions for the output layers of the NN are applied, which permits training via standard unconstrained optimization. The optimal solution yields a multi-period asset allocation and decumulation strategy for a holder of a defined contribution (DC) pension plan. The objective function of the optimal control problem is based on expected wealth withdrawn (EW) and expected shortfall (ES) that directly targets left-tail risk. The stochastic bound constraints enforce a guaranteed minimum withdrawal each year. We demonstrate that the data-driven approach is capable of learning a near-optimal solution by benchmarking it against the numerical results from a Hamilton-Jacobi-Bellman (HJB) Partial Differential Equation (PDE) computational framework.",
    "link": "http://arxiv.org/abs/2306.10582",
    "context": "Title: Machine Learning and Hamilton-Jacobi-Bellman Equation for Optimal Decumulation: a Comparison Study. (arXiv:2306.10582v1 [math.OC])\nAbstract: We propose a novel data-driven neural network (NN) optimization framework for solving an optimal stochastic control problem under stochastic constraints. Customized activation functions for the output layers of the NN are applied, which permits training via standard unconstrained optimization. The optimal solution yields a multi-period asset allocation and decumulation strategy for a holder of a defined contribution (DC) pension plan. The objective function of the optimal control problem is based on expected wealth withdrawn (EW) and expected shortfall (ES) that directly targets left-tail risk. The stochastic bound constraints enforce a guaranteed minimum withdrawal each year. We demonstrate that the data-driven approach is capable of learning a near-optimal solution by benchmarking it against the numerical results from a Hamilton-Jacobi-Bellman (HJB) Partial Differential Equation (PDE) computational framework.",
    "path": "papers/23/06/2306.10582.json",
    "total_tokens": 888,
    "translated_title": "机器学习与Hamilton-Jacobi-Bellman方程在最优领取方案中的比较研究",
    "translated_abstract": "我们提出了一个新颖的数据驱动神经网络(NN)优化框架，用于解决随机约束下的最优随机控制问题。应用了定制的输出层激活函数，允许通过标准无约束优化进行训练。最优解决方案可为定义利益计划（DC）养老金持有者提供多期资产配置和领取策略。最优控制问题的目标函数基于预期的提款财富和预期的短缺（ES），直接针对左尾风险。随机约束条件强制实施每年的最低提款额。我们证明了数据驱动方法能够通过与Hamilton-Jacobi-Bellman(HJB)偏微分方程(PDE)计算框架的数值结果进行基准测试而学习出近似最优解。",
    "tldr": "该论文提出了一个基于数据驱动神经网络的优化框架，用于解决随机约束下的最优控制问题，将其应用于养老金的资产配置和领取策略，并通过与传统的HJB计算框架进行比较，证明了其能够学习出近似最优解。",
    "en_tdlr": "This paper proposes a data-driven neural network optimization framework for solving stochastic control problems under stochastic constraints, which is applied to the asset allocation and decumulation strategy of a defined contribution pension plan. The approach is compared with the traditional HJB computational framework and shown to learn a near-optimal solution."
}