{
    "title": "Last Switch Dependent Bandits with Monotone Payoff Functions. (arXiv:2306.00338v1 [cs.LG])",
    "abstract": "In a recent work, Laforgue et al. introduce the model of last switch dependent (LSD) bandits, in an attempt to capture nonstationary phenomena induced by the interaction between the player and the environment. Examples include satiation, where consecutive plays of the same action lead to decreased performance, or deprivation, where the payoff of an action increases after an interval of inactivity. In this work, we take a step towards understanding the approximability of planning LSD bandits, namely, the (NP-hard) problem of computing an optimal arm-pulling strategy under complete knowledge of the model. In particular, we design the first efficient constant approximation algorithm for the problem and show that, under a natural monotonicity assumption on the payoffs, its approximation guarantee (almost) matches the state-of-the-art for the special and well-studied class of recharging bandits (also known as delay-dependent). In this attempt, we develop new tools and insights for this clas",
    "link": "http://arxiv.org/abs/2306.00338",
    "context": "Title: Last Switch Dependent Bandits with Monotone Payoff Functions. (arXiv:2306.00338v1 [cs.LG])\nAbstract: In a recent work, Laforgue et al. introduce the model of last switch dependent (LSD) bandits, in an attempt to capture nonstationary phenomena induced by the interaction between the player and the environment. Examples include satiation, where consecutive plays of the same action lead to decreased performance, or deprivation, where the payoff of an action increases after an interval of inactivity. In this work, we take a step towards understanding the approximability of planning LSD bandits, namely, the (NP-hard) problem of computing an optimal arm-pulling strategy under complete knowledge of the model. In particular, we design the first efficient constant approximation algorithm for the problem and show that, under a natural monotonicity assumption on the payoffs, its approximation guarantee (almost) matches the state-of-the-art for the special and well-studied class of recharging bandits (also known as delay-dependent). In this attempt, we develop new tools and insights for this clas",
    "path": "papers/23/06/2306.00338.json",
    "total_tokens": 881,
    "translated_title": "具有单调收益函数的最后一次切换依赖赌博机的规划问题的近似算法",
    "translated_abstract": "最近，Laforgue等人引入了最后一次切换依赖赌博机模型，以捕捉由玩家和环境之间的交互引起的非静态现象。本文针对计算最优拉臂策略（该问题是NP-hard）这一规划问题，研究了LSD（Last Switch Dependent）赌博机的近似性质。特别地，我们设计了第一个有效的常数近似算法，并证明，在收益自然单调递增的情况下，与特殊的充能赌博机（也称为延迟依赖赌博机）的最优性保证（几乎）相匹配。在此尝试中，我们为这类赌博机开发了新的工具和见解，这可能是独立感兴趣的。",
    "tldr": "本文研究了最后一次切换依赖赌博机的规划问题，设计了第一个有效的常数近似算法，并在自然单调递增的情况下实现了近乎最优的性能保证。",
    "en_tdlr": "This paper studies the planning problem of last switch dependent (LSD) bandits and designs the first efficient constant approximation algorithm under a natural monotonicity assumption on the payoffs, which achieves (almost) optimal performance for the special class of recharging bandits."
}