{
    "title": "Improving Quantum Circuit Synthesis with Machine Learning. (arXiv:2306.05622v1 [quant-ph])",
    "abstract": "In the Noisy Intermediate Scale Quantum (NISQ) era, finding implementations of quantum algorithms that minimize the number of expensive and error prone multi-qubit gates is vital to ensure computations produce meaningful outputs. Unitary synthesis, the process of finding a quantum circuit that implements some target unitary matrix, is able to solve this problem optimally in many cases. However, current bottom-up unitary synthesis algorithms are limited by their exponentially growing run times. We show how applying machine learning to unitary datasets permits drastic speedups for synthesis algorithms. This paper presents QSeed, a seeded synthesis algorithm that employs a learned model to quickly propose resource efficient circuit implementations of unitaries. QSeed maintains low gate counts and offers a speedup of $3.7\\times$ in synthesis time over the state of the art for a 64 qubit modular exponentiation circuit, a core component in Shor's factoring algorithm. QSeed's performance impr",
    "link": "http://arxiv.org/abs/2306.05622",
    "context": "Title: Improving Quantum Circuit Synthesis with Machine Learning. (arXiv:2306.05622v1 [quant-ph])\nAbstract: In the Noisy Intermediate Scale Quantum (NISQ) era, finding implementations of quantum algorithms that minimize the number of expensive and error prone multi-qubit gates is vital to ensure computations produce meaningful outputs. Unitary synthesis, the process of finding a quantum circuit that implements some target unitary matrix, is able to solve this problem optimally in many cases. However, current bottom-up unitary synthesis algorithms are limited by their exponentially growing run times. We show how applying machine learning to unitary datasets permits drastic speedups for synthesis algorithms. This paper presents QSeed, a seeded synthesis algorithm that employs a learned model to quickly propose resource efficient circuit implementations of unitaries. QSeed maintains low gate counts and offers a speedup of $3.7\\times$ in synthesis time over the state of the art for a 64 qubit modular exponentiation circuit, a core component in Shor's factoring algorithm. QSeed's performance impr",
    "path": "papers/23/06/2306.05622.json",
    "total_tokens": 994,
    "translated_title": "用机器学习提高量子电路合成的效率",
    "translated_abstract": "在嘈杂中等规模量子 (NISQ) 时代，找到最小化昂贵和容易出错的多比特门数量的量子算法实现对于确保计算产生有意义的输出是至关重要的。赋范合成是找到实现目标酉矩阵的量子电路的过程，在很多情况下能够最优地解决这个问题。然而，目前自底向上的赋范合成算法的运行时间受指数增长的限制。我们展示了如何将机器学习应用于赋范数据集，使合成算法得到显著的加速。本文介绍了 QSeed，一种种子合成算法，它使用学习的模型快速提出资源有效的电路实现。QSeed 保持低门计数，并针对 Shor 因式分解算法中的 64 比特模幂电路核心组件，比现有技术在合成时间方面提供了 $3.7\\times$ 的加速。QSeed 的性能优于当前公认的合成算法，并提供了可扩展性和泛化性能。",
    "tldr": "本论文提出了一种名为 QSeed 的种子合成算法，应用机器学习显著加速合成算法，针对核心量子算法组件，如 Shor 因式分解算法中的 64 比特模幂电路，QSeed 能在保持低门计数的同时将合成时间加速 $3.7\\times$。",
    "en_tdlr": "This paper presents QSeed, a seeded synthesis algorithm that employs a learned model to quickly propose resource efficient circuit implementations of unitaries. QSeed maintains low gate counts and offers a speedup of $3.7\\times$ in synthesis time over the state of the art for a 64 qubit modular exponentiation circuit, a core component in Shor's factoring algorithm. QSeed's performance is superior to current recognized synthesis algorithms and offers scalability and generalization performance."
}