{
    "title": "DEKGCI: A double-sided recommendation model for integrating knowledge graph and user-item interaction graph. (arXiv:2306.13837v1 [cs.IR])",
    "abstract": "Both knowledge graphs and user-item interaction graphs are frequently used in recommender systems due to their ability to provide rich information for modeling users and items. However, existing studies often focused on one of these sources (either the knowledge graph or the user-item interaction graph), resulting in underutilization of the benefits that can be obtained by integrating both sources of information. In this paper, we propose DEKGCI, a novel double-sided recommendation model. In DEKGCI, we use the high-order collaborative signals from the user-item interaction graph to enrich the user representations on the user side. Additionally, we utilize the high-order structural and semantic information from the knowledge graph to enrich the item representations on the item side. DEKGCI simultaneously learns the user and item representations to effectively capture the joint interactions between users and items. Three real-world datasets are adopted in the experiments to evaluate DEKG",
    "link": "http://arxiv.org/abs/2306.13837",
    "context": "Title: DEKGCI: A double-sided recommendation model for integrating knowledge graph and user-item interaction graph. (arXiv:2306.13837v1 [cs.IR])\nAbstract: Both knowledge graphs and user-item interaction graphs are frequently used in recommender systems due to their ability to provide rich information for modeling users and items. However, existing studies often focused on one of these sources (either the knowledge graph or the user-item interaction graph), resulting in underutilization of the benefits that can be obtained by integrating both sources of information. In this paper, we propose DEKGCI, a novel double-sided recommendation model. In DEKGCI, we use the high-order collaborative signals from the user-item interaction graph to enrich the user representations on the user side. Additionally, we utilize the high-order structural and semantic information from the knowledge graph to enrich the item representations on the item side. DEKGCI simultaneously learns the user and item representations to effectively capture the joint interactions between users and items. Three real-world datasets are adopted in the experiments to evaluate DEKG",
    "path": "papers/23/06/2306.13837.json",
    "total_tokens": 843,
    "translated_title": "DEKGCI：一种用于整合知识图谱与用户-物品交互图的双面推荐模型",
    "translated_abstract": "由于能够提供丰富的信息，知识图谱和用户-物品交互图在推荐系统中被频繁使用来建模用户和物品。然而，现有的研究通常只关注其中一种信息源（即知识图谱或用户-物品交互图），导致未充分利用整合两种信息源所带来的好处。本文提出了一种新颖的双面推荐模型DEKGCI。在DEKGCI中，我们使用来自用户-物品交互图的高阶协作信号来丰富用户表示，同时利用来自知识图谱的高阶结构和语义信息来丰富物品表示。DEKGCI同时学习用户和物品表示，以有效捕捉用户和物品之间的联合交互。实验采用了三个真实世界的数据集来评估DEKGCI。",
    "tldr": "本文提出了DEKGCI，一种双面推荐模型，在用户-物品交互图和知识图谱中同时丰富用户和物品表示，以有效捕捉用户和物品之间的联合交互。",
    "en_tdlr": "This paper proposes DEKGCI, a double-sided recommendation model that enriches user and item representations simultaneously in both user-item interaction graphs and knowledge graphs to effectively capture the joint interactions between users and items."
}