{
    "title": "Examination of Supernets to Facilitate International Trade for Indian Exports to Brazil. (arXiv:2306.00439v1 [econ.GN])",
    "abstract": "The objective of this paper is to investigate a more efficient cross-border payment and document handling process for the export of Indian goods to Brazil. The paper is structured into two sections: first, to explain the problems unique to the India-Brazil international trade corridor by highlighting the obstacles of compliance, speed, and payments; and second, to propose a digital solution for India-brazil trade utilizing Supernets, focusing on the use case of Indian exports. The solution assumes that stakeholders will be onboarded as permissioned actors (i.e. nodes) on a Polygon Supernet. By engaging trade and banking stakeholders, we ensure that the digital solution results in export benefits for Indian exporters, and a lawful channel to receive hard currency payments. The involvement of Brazilian and Indian banks ensures that Letter of Credit (LC) processing time and document handling occur at the speed of blockchain technology. The ultimate goal is to achieve faster settlement and",
    "link": "http://arxiv.org/abs/2306.00439",
    "context": "Title: Examination of Supernets to Facilitate International Trade for Indian Exports to Brazil. (arXiv:2306.00439v1 [econ.GN])\nAbstract: The objective of this paper is to investigate a more efficient cross-border payment and document handling process for the export of Indian goods to Brazil. The paper is structured into two sections: first, to explain the problems unique to the India-Brazil international trade corridor by highlighting the obstacles of compliance, speed, and payments; and second, to propose a digital solution for India-brazil trade utilizing Supernets, focusing on the use case of Indian exports. The solution assumes that stakeholders will be onboarded as permissioned actors (i.e. nodes) on a Polygon Supernet. By engaging trade and banking stakeholders, we ensure that the digital solution results in export benefits for Indian exporters, and a lawful channel to receive hard currency payments. The involvement of Brazilian and Indian banks ensures that Letter of Credit (LC) processing time and document handling occur at the speed of blockchain technology. The ultimate goal is to achieve faster settlement and",
    "path": "papers/23/06/2306.00439.json",
    "total_tokens": 955,
    "translated_abstract": "本文旨在调查一种更高效的跨境支付和文件处理方式，以促进印度商品对巴西的出口。文章分为两个部分：第一部分解释了印度-巴西国际贸易走廊所面临的独特问题，重点关注合规、速度和支付障碍；第二部分提出了一个数字解决方案，利用超级网络促进印度对巴西的贸易，重点考虑印度出口的应用场景。该解决方案假定利益相关方将作为被授权的参与方（即节点）加入Polygon超级网络。通过与贸易和银行利益相关方的接触，我们确保数字解决方案能够为印度出口商带来出口利益，并获得合法的外币支付渠道。巴西和印度银行的参与确保了信用证处理时间和文件处理速度与区块链技术同步。最终目标是实现更快的结算和减少贸易成本。",
    "tldr": "探索超级网络促进印度对巴西出口国际贸易，提出了一个数字解决方案，利用超级网络促进印度对巴西的贸易，帮助印度出口商获得出口利益，并获得合法的外币支付渠道，以及更快的结算和减少贸易成本。"
}