{
    "title": "AmicroN: A Framework for Generating Annotations for Human Activity Recognition with Granular Micro-Activities. (arXiv:2306.13149v1 [cs.HC])",
    "abstract": "Efficient human activity recognition (HAR) using sensor data needs a significant volume of annotated data. The growing volume of unlabelled sensor data has challenged conventional practices for gathering HAR annotations with human-in-the-loop approaches, often leading to the collection of shallower annotations. These shallower annotations ignore the fine-grained micro-activities that constitute any complex activities of daily living (ADL). Understanding this, we, in this paper, first analyze this lack of granular annotations from available pre-annotated datasets to understand the practical inconsistencies and also perform a detailed survey to look into the human perception surrounding annotations. Drawing motivations from these, we next develop the framework AmicroN that can automatically generate micro-activity annotations using locomotive signatures and the available coarse-grain macro-activity labels. In the backend, AmicroN applies change-point detection followed by zero-shot learn",
    "link": "http://arxiv.org/abs/2306.13149",
    "context": "Title: AmicroN: A Framework for Generating Annotations for Human Activity Recognition with Granular Micro-Activities. (arXiv:2306.13149v1 [cs.HC])\nAbstract: Efficient human activity recognition (HAR) using sensor data needs a significant volume of annotated data. The growing volume of unlabelled sensor data has challenged conventional practices for gathering HAR annotations with human-in-the-loop approaches, often leading to the collection of shallower annotations. These shallower annotations ignore the fine-grained micro-activities that constitute any complex activities of daily living (ADL). Understanding this, we, in this paper, first analyze this lack of granular annotations from available pre-annotated datasets to understand the practical inconsistencies and also perform a detailed survey to look into the human perception surrounding annotations. Drawing motivations from these, we next develop the framework AmicroN that can automatically generate micro-activity annotations using locomotive signatures and the available coarse-grain macro-activity labels. In the backend, AmicroN applies change-point detection followed by zero-shot learn",
    "path": "papers/23/06/2306.13149.json",
    "total_tokens": 812,
    "translated_title": "AmicroN：一种用于生成细粒度微动作的人体活动识别注释的框架",
    "translated_abstract": "利用传感器数据实现高效的人体活动识别需要大量的注释数据。未标记传感器数据的增长挑战了传统的基于人的数据收集方法，通常导致收集更浅的注释。这些浅层注释忽略了组成日常生活中任何复杂活动的细粒度微动作。本文分析了可用的预注释数据集中缺乏细粒度注释的原因和缺陷，并进行了详细的调查以了解与注释相关的人类感知。在此基础上，我们开发了AmicroN框架，该框架可以使用运动特征和可用的粗粒度宏操作标签自动生成微动作注释。在后台，AmicroN应用变点检测，然后进行零样本学习。",
    "tldr": "本文提出了一种名为AmicroN的框架，可以利用传感器数据自动生成微动作注释，弥补现有数据集缺乏细粒度注释的不足。",
    "en_tdlr": "This paper proposes a framework called AmicroN that can automatically generate micro-activity annotations using locomotive signatures and macro-activity labels, addressing the lack of granular annotations in existing datasets."
}