{
    "title": "ALO-VC: Any-to-any Low-latency One-shot Voice Conversion. (arXiv:2306.01100v1 [eess.AS])",
    "abstract": "This paper presents ALO-VC, a non-parallel low-latency one-shot phonetic posteriorgrams (PPGs) based voice conversion method. ALO-VC enables any-to-any voice conversion using only one utterance from the target speaker, with only 47.5 ms future look-ahead. The proposed hybrid signal processing and machine learning pipeline combines a pre-trained speaker encoder, a pitch predictor to predict the converted speech's prosody, and positional encoding to convey the phoneme's location information. We introduce two system versions: ALO-VC-R, which uses a pre-trained d-vector speaker encoder, and ALO-VC-E, which improves performance using the ECAPA-TDNN speaker encoder. The experimental results demonstrate both ALO-VC-R and ALO-VC-E can achieve comparable performance to non-causal baseline systems on the VCTK dataset and two out-of-domain datasets. Furthermore, both proposed systems can be deployed on a single CPU core with 55 ms latency and 0.78 real-time factor. Our demo is available online.",
    "link": "http://arxiv.org/abs/2306.01100",
    "context": "Title: ALO-VC: Any-to-any Low-latency One-shot Voice Conversion. (arXiv:2306.01100v1 [eess.AS])\nAbstract: This paper presents ALO-VC, a non-parallel low-latency one-shot phonetic posteriorgrams (PPGs) based voice conversion method. ALO-VC enables any-to-any voice conversion using only one utterance from the target speaker, with only 47.5 ms future look-ahead. The proposed hybrid signal processing and machine learning pipeline combines a pre-trained speaker encoder, a pitch predictor to predict the converted speech's prosody, and positional encoding to convey the phoneme's location information. We introduce two system versions: ALO-VC-R, which uses a pre-trained d-vector speaker encoder, and ALO-VC-E, which improves performance using the ECAPA-TDNN speaker encoder. The experimental results demonstrate both ALO-VC-R and ALO-VC-E can achieve comparable performance to non-causal baseline systems on the VCTK dataset and two out-of-domain datasets. Furthermore, both proposed systems can be deployed on a single CPU core with 55 ms latency and 0.78 real-time factor. Our demo is available online.",
    "path": "papers/23/06/2306.01100.json",
    "total_tokens": 1005,
    "translated_title": "ALO-VC: 任意对任意低延迟一次性语音转换",
    "translated_abstract": "本文介绍了一种基于非平行音素后验图（PPG）的任意对任意低延迟一次性语音转换方法——ALO-VC。使用只有47.5毫秒未来预测的目标说话人单个话语即可实现任意对任意语音转换。所提出的混合信号处理和机器学习流程结合了预训练的说话人编码器，预测所转换语音的韵律的音高预测器以及位置编码来传达音素的位置信息。我们介绍了两个系统版本：ALO-VC-R使用预训练的d-vector说话人编码器，ALO-VC-E使用ECAPA-TDNN说话人编码器提高性能。实验结果表明，ALO-VC-R和ALO-VC-E在VCTK数据集和两个领域外数据集上均可实现与非因果基线系统相当的性能。此外，两个所提出的系统可以在单个CPU核上部署，具有55毫秒的延迟和0.78的实时因素。我们的演示可在网上访问。",
    "tldr": "本文提出了ALO-VC，一种任意对任意低延迟一次性语音转换方法，它使用仅为目标说话人提供的一个话语，包括预训练说话人编码器、音高预测器和位置编码器，实现了与非因果基线系统相当的性能。",
    "en_tdlr": "This paper presents ALO-VC, a low-latency one-shot voice conversion method that enables any-to-any voice conversion using only one utterance from the target speaker. The proposed system includes a pre-trained speaker encoder, a pitch predictor, and positional encoding to achieve comparable performance to non-causal baseline systems. ALO-VC can be deployed on a single CPU core with 55ms latency and 0.78 real-time factor."
}