{
    "title": "Automatic Speech Disentanglement for Voice Conversion using Rank Module and Speech Augmentation. (arXiv:2306.12259v1 [cs.SD])",
    "abstract": "Voice Conversion (VC) converts the voice of a source speech to that of a target while maintaining the source's content. Speech can be mainly decomposed into four components: content, timbre, rhythm and pitch. Unfortunately, most related works only take into account content and timbre, which results in less natural speech. Some recent works are able to disentangle speech into several components, but they require laborious bottleneck tuning or various hand-crafted features, each assumed to contain disentangled speech information. In this paper, we propose a VC model that can automatically disentangle speech into four components using only two augmentation functions, without the requirement of multiple hand-crafted features or laborious bottleneck tuning. The proposed model is straightforward yet efficient, and the empirical results demonstrate that our model can achieve a better performance than the baseline, regarding disentanglement effectiveness and speech naturalness.",
    "link": "http://arxiv.org/abs/2306.12259",
    "context": "Title: Automatic Speech Disentanglement for Voice Conversion using Rank Module and Speech Augmentation. (arXiv:2306.12259v1 [cs.SD])\nAbstract: Voice Conversion (VC) converts the voice of a source speech to that of a target while maintaining the source's content. Speech can be mainly decomposed into four components: content, timbre, rhythm and pitch. Unfortunately, most related works only take into account content and timbre, which results in less natural speech. Some recent works are able to disentangle speech into several components, but they require laborious bottleneck tuning or various hand-crafted features, each assumed to contain disentangled speech information. In this paper, we propose a VC model that can automatically disentangle speech into four components using only two augmentation functions, without the requirement of multiple hand-crafted features or laborious bottleneck tuning. The proposed model is straightforward yet efficient, and the empirical results demonstrate that our model can achieve a better performance than the baseline, regarding disentanglement effectiveness and speech naturalness.",
    "path": "papers/23/06/2306.12259.json",
    "total_tokens": 911,
    "translated_title": "使用排名模块和语音增强的语音转换自动语音解缠",
    "translated_abstract": "语音转换（VC）可以将源语音的声音转换为目标语音，同时保持源语音的内容。语音主要可分解为四个部分：内容、音色、节奏和音高。不幸的是，大多数相关工作只考虑了内容和音色，结果导致语音不够自然。最近一些研究可以将语音解脱成几个组成部分，但它们需要费力的瓶颈调整或各种手工制作的特征，每个特征都假定包含解脱的语音信息。在本文中，我们提出了一种VC模型，可使用仅两个增强函数自动将语音分解为四个部分，而无需多个手工制作的特征或费力的瓶颈调整。所提出的模型简单而高效，并且实证结果表明，相对于基线，我们的模型在解脱有效性和语音自然度方面表现更好。",
    "tldr": "该论文提出了一种VC模型，可使用仅两个增强函数自动将语音分解为四个部分，而无需多个手工制作的特征或费力的瓶颈调整，并且实证结果表明，相对于基线，模型在解脱有效性和语音自然度方面表现更好。",
    "en_tdlr": "This paper proposes a VC model that can automatically disentangle speech into four components using only two augmentation functions, without the requirement of multiple hand-crafted features or laborious bottleneck tuning, and the empirical results demonstrate that our model can achieve a better performance than the baseline, regarding disentanglement effectiveness and speech naturalness."
}