{
    "title": "DreamDecompiler: Improved Bayesian Program Learning by Decompiling Amortised Knowledge. (arXiv:2306.07856v1 [cs.AI])",
    "abstract": "Solving program induction problems requires searching through an enormous space of possibilities. DreamCoder is an inductive program synthesis system that, whilst solving problems, learns to simplify search in an iterative wake-sleep procedure. The cost of search is amortised by training a neural search policy, reducing search breadth and effectively \"compiling\" useful information to compose program solutions across tasks. Additionally, a library of program components is learnt to express discovered solutions in fewer components, reducing search depth. In DreamCoder, the neural search policy has only an indirect effect on the library learnt through the program solutions it helps discover. We present an approach for library learning that directly leverages the neural search policy, effectively \"decompiling\" its amortised knowledge to extract relevant program components. This provides stronger amortised inference: the amortised knowledge learnt to reduce search breadth is now also used t",
    "link": "http://arxiv.org/abs/2306.07856",
    "context": "Title: DreamDecompiler: Improved Bayesian Program Learning by Decompiling Amortised Knowledge. (arXiv:2306.07856v1 [cs.AI])\nAbstract: Solving program induction problems requires searching through an enormous space of possibilities. DreamCoder is an inductive program synthesis system that, whilst solving problems, learns to simplify search in an iterative wake-sleep procedure. The cost of search is amortised by training a neural search policy, reducing search breadth and effectively \"compiling\" useful information to compose program solutions across tasks. Additionally, a library of program components is learnt to express discovered solutions in fewer components, reducing search depth. In DreamCoder, the neural search policy has only an indirect effect on the library learnt through the program solutions it helps discover. We present an approach for library learning that directly leverages the neural search policy, effectively \"decompiling\" its amortised knowledge to extract relevant program components. This provides stronger amortised inference: the amortised knowledge learnt to reduce search breadth is now also used t",
    "path": "papers/23/06/2306.07856.json",
    "total_tokens": 825,
    "translated_abstract": "解决程序归纳问题需要在巨大的可能性空间中进行搜索。DreamCoder是一种归纳性程序综合系统，通过迭代的清醒-睡眠过程，学习简化搜索。通过训练神经搜索策略，搜索成本得以分摊，减少搜索广度，有效地“编译”有用信息，以便在任务中组合程序解决方案。此外，通过学习程序组件库来表达发现的解决方案，以减少搜索深度。在DreamCoder中，神经搜索策略仅对已掌握的程序解决方案库产生间接影响。我们提出了一种库学习方法，直接利用神经搜索策略，从中提取相关的程序组件，有效地“反编译”其分摊的知识。这提供了更强的分摊推理：学习减少搜索广度的分摊知识现在也用于减少搜索深度。",
    "tldr": "DreamDecompiler通过神经搜索策略直接影响程序组件库的学习，提高了程序归纳学习的效率，减少搜索广度和深度。",
    "en_tdlr": "DreamDecompiler improves program induction by directly leveraging neural search policy to affect program component library learning, reducing search breadth and depth."
}