{
    "title": "Learning Dynamical Systems from Noisy Data with Inverse-Explicit Integrators. (arXiv:2306.03548v1 [cs.LG])",
    "abstract": "We introduce the mean inverse integrator (MII), a novel approach to increase the accuracy when training neural networks to approximate vector fields of dynamical systems from noisy data. This method can be used to average multiple trajectories obtained by numerical integrators such as Runge-Kutta methods. We show that the class of mono-implicit Runge-Kutta methods (MIRK) has particular advantages when used in connection with MII. When training vector field approximations, explicit expressions for the loss functions are obtained when inserting the training data in the MIRK formulae, unlocking symmetric and high-order integrators that would otherwise be implicit for initial value problems. The combined approach of applying MIRK within MII yields a significantly lower error compared to the plain use of the numerical integrator without averaging the trajectories. This is demonstrated with experiments using data from several (chaotic) Hamiltonian systems. Additionally, we perform a sensitiv",
    "link": "http://arxiv.org/abs/2306.03548",
    "context": "Title: Learning Dynamical Systems from Noisy Data with Inverse-Explicit Integrators. (arXiv:2306.03548v1 [cs.LG])\nAbstract: We introduce the mean inverse integrator (MII), a novel approach to increase the accuracy when training neural networks to approximate vector fields of dynamical systems from noisy data. This method can be used to average multiple trajectories obtained by numerical integrators such as Runge-Kutta methods. We show that the class of mono-implicit Runge-Kutta methods (MIRK) has particular advantages when used in connection with MII. When training vector field approximations, explicit expressions for the loss functions are obtained when inserting the training data in the MIRK formulae, unlocking symmetric and high-order integrators that would otherwise be implicit for initial value problems. The combined approach of applying MIRK within MII yields a significantly lower error compared to the plain use of the numerical integrator without averaging the trajectories. This is demonstrated with experiments using data from several (chaotic) Hamiltonian systems. Additionally, we perform a sensitiv",
    "path": "papers/23/06/2306.03548.json",
    "total_tokens": 1068,
    "translated_title": "用反显式积分器从嘈杂数据中学习动态系统",
    "translated_abstract": "我们引入了均值反向积分器（MII），这是一种新方法，用于在训练神经网络从嘈杂的数据中近似动态系统的向量场时增加准确性。该方法可用于平均通过数值积分器（如龙格-库塔方法）获得的多条轨迹。我们表明，当与MII连接时，类别为单隐式龙格-库塔方法（MIRK）具有特殊优势。当将训练数据插入MIRK公式中时，可获得用于向量场近似的显式损失函数表达式，解锁在初值问题发生时，否则为隐式的对称和高阶积分器。将MIRK应用于MII中的组合方法与仅使用数值积分器而不平均轨迹相比，误差显着降低 。这是通过使用来自几个（混沌）Hamiltonian系统的数据进行实验来证明的。此外，我们进行了敏感性分析，以确定MII和MIRK的参数值对于近似结果的影响。",
    "tldr": "本文提出了一种新方法——均值反向积分器（MII），它可用于从嘈杂的数据中近似动态系统的向量场，通过与单隐式龙格-库塔方法（MIRK）的连接，显式地获得损失函数表达式，实现解锁被初值问题描述的对称和高阶积分器，与仅使用数值积分器的方式相比，通过将MIRK应用于MII的组合方法可以显着降低误差。",
    "en_tdlr": "This paper introduces a new method, the Mean Inverse Integrator (MII), which can increase the accuracy of training neural networks to approximate vector fields of dynamical systems from noisy data. By connecting MII with Mono-Implicit Runge-Kutta (MIRK) methods, explicit expressions for the loss functions can be obtained, which unlock symmetric and high-order integrators that would otherwise be implicit for initial value problems. The combined approach of applying MIRK within MII yields a significantly lower error compared to the plain use of the numerical integrator without averaging the trajectories."
}