{
    "title": "LibAUC: A Deep Learning Library for X-Risk Optimization. (arXiv:2306.03065v1 [cs.LG])",
    "abstract": "This paper introduces the award-winning deep learning (DL) library called LibAUC for implementing state-of-the-art algorithms towards optimizing a family of risk functions named X-risks. X-risks refer to a family of compositional functions in which the loss function of each data point is defined in a way that contrasts the data point with a large number of others. They have broad applications in AI for solving classical and emerging problems, including but not limited to classification for imbalanced data (CID), learning to rank (LTR), and contrastive learning of representations (CLR). The motivation of developing LibAUC is to address the convergence issues of existing libraries for solving these problems. In particular, existing libraries may not converge or require very large mini-batch sizes in order to attain good performance for these problems, due to the usage of the standard mini-batch technique in the empirical risk minimization (ERM) framework. Our library is for deep X-risk o",
    "link": "http://arxiv.org/abs/2306.03065",
    "context": "Title: LibAUC: A Deep Learning Library for X-Risk Optimization. (arXiv:2306.03065v1 [cs.LG])\nAbstract: This paper introduces the award-winning deep learning (DL) library called LibAUC for implementing state-of-the-art algorithms towards optimizing a family of risk functions named X-risks. X-risks refer to a family of compositional functions in which the loss function of each data point is defined in a way that contrasts the data point with a large number of others. They have broad applications in AI for solving classical and emerging problems, including but not limited to classification for imbalanced data (CID), learning to rank (LTR), and contrastive learning of representations (CLR). The motivation of developing LibAUC is to address the convergence issues of existing libraries for solving these problems. In particular, existing libraries may not converge or require very large mini-batch sizes in order to attain good performance for these problems, due to the usage of the standard mini-batch technique in the empirical risk minimization (ERM) framework. Our library is for deep X-risk o",
    "path": "papers/23/06/2306.03065.json",
    "total_tokens": 869,
    "translated_title": "LibAUC: 用于X-Risk优化的深度学习库",
    "translated_abstract": "本文介绍了一个名为LibAUC的深度学习库，可以实现最先进的算法以优化一类风险函数，称为X-risk。 X-risk是一类组合函数，其中每个数据点的损失函数以与大量其他数据点进行对比的方式定义。它们在AI中具有广泛应用，可解决经典和新兴问题，包括但不限于不均衡数据的分类（CID），排名学习（LTR）和表示的对比学习（CLR）。 LibAUC的开发动机是解决现有库在解决这些问题时的收敛问题。特别地，现有库可能不会收敛或需要非常大的mini-batch大小才能获得良好的性能，因为在经验风险最小化（ERM）框架中使用了标准的mini-batch技术。我们的库是用于深度X-risk优化的，实验结果显示，它在测试准确性和收敛速度方面显着优于现有库。",
    "tldr": "本文介绍了一个名为LibAUC的深度学习库，用于解决X-risk的优化问题，并在实验中表现出优异的性能。",
    "en_tdlr": "This paper introduces LibAUC, a deep learning library for optimizing X-risks, which significantly outperforms existing libraries in terms of both test accuracy and convergence speed."
}