{
    "title": "LCT-1 at SemEval-2023 Task 10: Pre-training and Multi-task Learning for Sexism Detection and Classification. (arXiv:2306.05075v1 [cs.CL])",
    "abstract": "Misogyny and sexism are growing problems in social media. Advances have been made in online sexism detection but the systems are often uninterpretable. SemEval-2023 Task 10 on Explainable Detection of Online Sexism aims at increasing explainability of the sexism detection, and our team participated in all the proposed subtasks. Our system is based on further domain-adaptive pre-training (Gururangan et al., 2020). Building on the Transformer-based models with the domain adaptation, we compare fine-tuning with multi-task learning and show that each subtask requires a different system configuration. In our experiments, multi-task learning performs on par with standard fine-tuning for sexism detection and noticeably better for coarse-grained sexism classification, while fine-tuning is preferable for fine-grained classification.",
    "link": "http://arxiv.org/abs/2306.05075",
    "context": "Title: LCT-1 at SemEval-2023 Task 10: Pre-training and Multi-task Learning for Sexism Detection and Classification. (arXiv:2306.05075v1 [cs.CL])\nAbstract: Misogyny and sexism are growing problems in social media. Advances have been made in online sexism detection but the systems are often uninterpretable. SemEval-2023 Task 10 on Explainable Detection of Online Sexism aims at increasing explainability of the sexism detection, and our team participated in all the proposed subtasks. Our system is based on further domain-adaptive pre-training (Gururangan et al., 2020). Building on the Transformer-based models with the domain adaptation, we compare fine-tuning with multi-task learning and show that each subtask requires a different system configuration. In our experiments, multi-task learning performs on par with standard fine-tuning for sexism detection and noticeably better for coarse-grained sexism classification, while fine-tuning is preferable for fine-grained classification.",
    "path": "papers/23/06/2306.05075.json",
    "total_tokens": 880,
    "translated_title": "LCT-1在SemEval-2023任务10中的应用：预训练和多任务学习用于性别歧视检测和分类",
    "translated_abstract": "性别歧视和性别主义在社交媒体上越来越成为一个问题。虽然在线性别歧视检测方面取得了一些进展，但系统通常是不可解释的。SemEval-2023任务10旨在增加关于性别歧视检测的可解释性，我们的团队参加了所有建议的子任务。我们的系统基于进一步的领域自适应预训练（Gururangan等人，2020）。在具有领域自适应性的基于Transformer的模型的基础上，我们比较了微调和多任务学习，并表明每个子任务需要不同的系统配置。在我们的实验中，多任务学习在性别歧视检测方面表现极佳，并在粗粒度的性别分类方面优于标准微调，而微调则更适用于细粒度分类。",
    "tldr": "本文介绍了一个基于预训练和多任务学习的检测和分类系统，用于解决社交媒体上的性别歧视问题。多任务学习对性别歧视检测和粗粒度性别分类表现出色，而微调则更适用于细粒度分类。",
    "en_tdlr": "This paper presents a detection and classification system based on pre-training and multi-task learning for addressing the issue of sexism in social media. Multi-task learning performs well for sexism detection and coarse-grained gender classification, while fine-tuning is preferable for fine-grained classification."
}