{
    "title": "AI Enhanced Control Engineering Methods. (arXiv:2306.05545v1 [math.OC])",
    "abstract": "AI and machine learning based approaches are becoming ubiquitous in almost all engineering fields. Control engineering cannot escape this trend. In this paper, we explore how AI tools can be useful in control applications. The core tool we focus on is automatic differentiation. Two immediate applications are linearization of system dynamics for local stability analysis or for state estimation using Kalman filters. We also explore other usages such as conversion of differential algebraic equations to ordinary differential equations for control design. In addition, we explore the use of machine learning models for global parameterizations of state vectors and control inputs in model predictive control applications. For each considered use case, we give examples and results.",
    "link": "http://arxiv.org/abs/2306.05545",
    "context": "Title: AI Enhanced Control Engineering Methods. (arXiv:2306.05545v1 [math.OC])\nAbstract: AI and machine learning based approaches are becoming ubiquitous in almost all engineering fields. Control engineering cannot escape this trend. In this paper, we explore how AI tools can be useful in control applications. The core tool we focus on is automatic differentiation. Two immediate applications are linearization of system dynamics for local stability analysis or for state estimation using Kalman filters. We also explore other usages such as conversion of differential algebraic equations to ordinary differential equations for control design. In addition, we explore the use of machine learning models for global parameterizations of state vectors and control inputs in model predictive control applications. For each considered use case, we give examples and results.",
    "path": "papers/23/06/2306.05545.json",
    "total_tokens": 800,
    "translated_title": "AI增强的控制工程方法",
    "translated_abstract": "基于人工智能和机器学习的方法正在几乎所有工程领域中变得普遍。控制工程也不能逃避这一趋势。本文探讨了如何在控制应用中使用AI工具。我们所关注的核心工具是自动微分。其两个直接应用包括利用Kalman滤波器将系统动力学线性化以进行局部稳定性分析或状态估计。此外，我们还探讨了其他用途，例如将微分代数方程转换为常微分方程进行控制设计。此外，我们还探讨了在模型预测控制应用中，利用机器学习模型为状态向量和控制输入进行全局参数化的用途。对于每个考虑的用例，我们都给出了例子和结果。",
    "tldr": "本文讨论了利用AI工具进行控制工程的方法。其中，自动微分是核心工具之一，可用于局部稳定性分析和状态估计等方面。此外，还探讨了将微分代数方程转换为常微分方程进行控制设计以及利用机器学习模型进行全局参数化等应用。",
    "en_tdlr": "This paper discusses the use of AI tools for control engineering, focusing on the core tool of automatic differentiation for local stability analysis and state estimation. Other applications explored include converting differential algebraic equations to ordinary differential equations for control design and using machine learning models for global parameterization."
}