{
    "title": "A Multi-dimensional Deep Structured State Space Approach to Speech Enhancement Using Small-footprint Models. (arXiv:2306.00331v1 [eess.AS])",
    "abstract": "We propose a multi-dimensional structured state space (S4) approach to speech enhancement. To better capture the spectral dependencies across the frequency axis, we focus on modifying the multi-dimensional S4 layer with whitening transformation to build new small-footprint models that also achieve good performance. We explore several S4-based deep architectures in time (T) and time-frequency (TF) domains. The 2-D S4 layer can be considered a particular convolutional layer with an infinite receptive field although it utilizes fewer parameters than a conventional convolutional layer. Evaluated on the VoiceBank-DEMAND data set, when compared with the conventional U-net model based on convolutional layers, the proposed TF-domain S4-based model is 78.6% smaller in size, yet it still achieves competitive results with a PESQ score of 3.15 with data augmentation. By increasing the model size, we can even reach a PESQ score of 3.18.",
    "link": "http://arxiv.org/abs/2306.00331",
    "context": "Title: A Multi-dimensional Deep Structured State Space Approach to Speech Enhancement Using Small-footprint Models. (arXiv:2306.00331v1 [eess.AS])\nAbstract: We propose a multi-dimensional structured state space (S4) approach to speech enhancement. To better capture the spectral dependencies across the frequency axis, we focus on modifying the multi-dimensional S4 layer with whitening transformation to build new small-footprint models that also achieve good performance. We explore several S4-based deep architectures in time (T) and time-frequency (TF) domains. The 2-D S4 layer can be considered a particular convolutional layer with an infinite receptive field although it utilizes fewer parameters than a conventional convolutional layer. Evaluated on the VoiceBank-DEMAND data set, when compared with the conventional U-net model based on convolutional layers, the proposed TF-domain S4-based model is 78.6% smaller in size, yet it still achieves competitive results with a PESQ score of 3.15 with data augmentation. By increasing the model size, we can even reach a PESQ score of 3.18.",
    "path": "papers/23/06/2306.00331.json",
    "total_tokens": 959,
    "translated_title": "多维深度结构化状态空间方法在语音增强中的应用：基于小型模型",
    "translated_abstract": "我们提出了一种多维结构化状态空间（S4）方法来进行语音增强。为了更好地捕捉频率轴上的谱依赖性，我们着重于使用白化变换修改多维S4层，以构建具有良好性能的新小型模型。我们在时间（T）和时频（TF）域探索了几个基于S4的深度架构。尽管使用的参数比常规卷积层少，但2D S4层可以被视为具有无限接收域的特殊卷积层。在VoiceBank-DEMAND数据集上评估时，与基于卷积层的常规U-net模型相比，所提出的TF域S4模型大小减少了78.6％，但仍在数据增广后获得了具有竞争力的结果，PESQ得分为3.15。通过增加模型大小，我们甚至可以达到3.18的PESQ得分。",
    "tldr": "该论文提出了一种基于小型模型的多维深度结构化状态空间方法，在语音增强中表现出竞争力，由于使用的参数比常规卷积层少，提出的TF域S4模型大小减少了78.6％，同时在数据增广后获得3.15的PESQ得分。",
    "en_tdlr": "This paper proposes a multi-dimensional deep structured state space approach to speech enhancement using small-footprint models, achieving competitive results with a reduced model size of 78.6% compared to conventional convolutional layers. The proposed TF-domain S4-based model achieved a PESQ score of 3.15 with data augmentation and can reach a PESQ score of 3.18 with increased model size."
}