{
    "title": "arXiVeri: Automatic table verification with GPT. (arXiv:2306.07968v1 [cs.CL])",
    "abstract": "Without accurate transcription of numerical data in scientific documents, a scientist cannot draw accurate conclusions. Unfortunately, the process of copying numerical data from one paper to another is prone to human error. In this paper, we propose to meet this challenge through the novel task of automatic table verification (AutoTV), in which the objective is to verify the accuracy of numerical data in tables by cross-referencing cited sources. To support this task, we propose a new benchmark, arXiVeri, which comprises tabular data drawn from open-access academic papers on arXiv. We introduce metrics to evaluate the performance of a table verifier in two key areas: (i) table matching, which aims to identify the source table in a cited document that corresponds to a target table, and (ii) cell matching, which aims to locate shared cells between a target and source table and identify their row and column indices accurately. By leveraging the flexible capabilities of modern large langua",
    "link": "http://arxiv.org/abs/2306.07968",
    "context": "Title: arXiVeri: Automatic table verification with GPT. (arXiv:2306.07968v1 [cs.CL])\nAbstract: Without accurate transcription of numerical data in scientific documents, a scientist cannot draw accurate conclusions. Unfortunately, the process of copying numerical data from one paper to another is prone to human error. In this paper, we propose to meet this challenge through the novel task of automatic table verification (AutoTV), in which the objective is to verify the accuracy of numerical data in tables by cross-referencing cited sources. To support this task, we propose a new benchmark, arXiVeri, which comprises tabular data drawn from open-access academic papers on arXiv. We introduce metrics to evaluate the performance of a table verifier in two key areas: (i) table matching, which aims to identify the source table in a cited document that corresponds to a target table, and (ii) cell matching, which aims to locate shared cells between a target and source table and identify their row and column indices accurately. By leveraging the flexible capabilities of modern large langua",
    "path": "papers/23/06/2306.07968.json",
    "total_tokens": 1054,
    "translated_title": "arXiVeri：基于 GPT 的自动表格验证",
    "translated_abstract": "没有对科学文献中数字数据的准确转录，科学家就不能得出准确结论。不幸的是，将数字数据从一篇论文复制到另一篇论文的过程容易出现人为错误。本文提出通过新颖的自动表格验证任务（AutoTV）来应对这一挑战，其目标是通过交叉引用引用的来源来验证表格中数字数据的准确性。为了支持该任务，我们提出了一个新的基准测试，arXiVeri，它包括从 arXiv 上的开放获取学术论文中提取的表格数据。我们引入了评估表格验证器在两个关键领域性能的指标：（i）表格匹配，旨在识别引用文献中的来源表格与目标表格对应的表格，和（ii）单元格匹配，旨在准确定位目标表格和来源表格之间的共享单元格，并识别它们的行和列索引。通过利用现代大型语言模型的灵活性能力，我们提出了一种基于 GPT 的 AutoTV 方法，并在 arXiVeri 基准测试上将其性能与几种基线算法进行了比较。实验结果表明，我们提出的方法在表格匹配和单元格匹配任务中均达到了最先进的性能。",
    "tldr": "本文提出了自动表格验证任务（AutoTV），提供了一个新的基准测试 arXiVeri 来验证其准确性，通过基于 GPT 的方法实现了自动表格验证，在表格匹配和单元格匹配任务中均达到了最先进的性能。"
}