{
    "title": "Expanding Versatility of Agile Locomotion through Policy Transitions Using Latent State Representation. (arXiv:2306.08224v1 [cs.RO])",
    "abstract": "This paper proposes the transition-net, a robust transition strategy that expands the versatility of robot locomotion in the real-world setting. To this end, we start by distributing the complexity of different gaits into dedicated locomotion policies applicable to real-world robots. Next, we expand the versatility of the robot by unifying the policies with robust transitions into a single coherent meta-controller by examining the latent state representations. Our approach enables the robot to iteratively expand its skill repertoire and robustly transition between any policy pair in a library. In our framework, adding new skills does not introduce any process that alters the previously learned skills. Moreover, training of a locomotion policy takes less than an hour with a single consumer GPU. Our approach is effective in the real-world and achieves a 19% higher average success rate for the most challenging transition pairs in our experiments compared to existing approaches.",
    "link": "http://arxiv.org/abs/2306.08224",
    "context": "Title: Expanding Versatility of Agile Locomotion through Policy Transitions Using Latent State Representation. (arXiv:2306.08224v1 [cs.RO])\nAbstract: This paper proposes the transition-net, a robust transition strategy that expands the versatility of robot locomotion in the real-world setting. To this end, we start by distributing the complexity of different gaits into dedicated locomotion policies applicable to real-world robots. Next, we expand the versatility of the robot by unifying the policies with robust transitions into a single coherent meta-controller by examining the latent state representations. Our approach enables the robot to iteratively expand its skill repertoire and robustly transition between any policy pair in a library. In our framework, adding new skills does not introduce any process that alters the previously learned skills. Moreover, training of a locomotion policy takes less than an hour with a single consumer GPU. Our approach is effective in the real-world and achieves a 19% higher average success rate for the most challenging transition pairs in our experiments compared to existing approaches.",
    "path": "papers/23/06/2306.08224.json",
    "total_tokens": 930,
    "translated_title": "利用潜在状态表征通过策略过渡拓展敏捷机器人的多样性",
    "translated_abstract": "本文提出了一种稳健的过渡策略——过渡网络，通过将不同步态的复杂性分为适用于真实世界机器人的专用运动策略，然后将这些策略与稳健的过渡方式统一为单个连贯的元控制器，并检查潜在状态表征，拓展机器人的多样性。我们的方法使机器人能够迭代地扩展其技能库和在库中任意策略对之间稳健地过渡。在我们的框架中，添加新技能不会引入任何改变之前学习技能的过程。此外，使用单个消费级GPU不到一小时即可完成单个运动策略的培训。我们的方法在真实世界中很有效，相比现有方法，在我们的实验中最具挑战性的转换对中，平均成功率比现有方法高19%。",
    "tldr": "本文提出了一种稳健的过渡策略——过渡网络，将不同步态的复杂性分为适用于真实世界机器人的专用策略，并通过潜在状态表征拓展机器人的多样性，实现了在技能库中任意策略对之间稳健过渡。",
    "en_tdlr": "This paper proposes a robust transition strategy called the transition-net, which distributes the complexity of different gaits into dedicated locomotion policies applicable to real-world robots. By unifying these policies with robust transitions into a single coherent meta-controller and examining the latent state representations, the approach enables the robot to iteratively expand its skill repertoire and robustly transition between any policy pair in a library."
}