{
    "title": "Computationally Assisted Quality Control for Public Health Data Streams. (arXiv:2306.16914v1 [cs.AI])",
    "abstract": "Irregularities in public health data streams (like COVID-19 Cases) hamper data-driven decision-making for public health stakeholders. A real-time, computer-generated list of the most important, outlying data points from thousands of daily-updated public health data streams could assist an expert reviewer in identifying these irregularities. However, existing outlier detection frameworks perform poorly on this task because they do not account for the data volume or for the statistical properties of public health streams. Accordingly, we developed FlaSH (Flagging Streams in public Health), a practical outlier detection framework for public health data users that uses simple, scalable models to capture these statistical properties explicitly. In an experiment where human experts evaluate FlaSH and existing methods (including deep learning approaches), FlaSH scales to the data volume of this task, matches or exceeds these other methods in mean accuracy, and identifies the outlier points th",
    "link": "http://arxiv.org/abs/2306.16914",
    "context": "Title: Computationally Assisted Quality Control for Public Health Data Streams. (arXiv:2306.16914v1 [cs.AI])\nAbstract: Irregularities in public health data streams (like COVID-19 Cases) hamper data-driven decision-making for public health stakeholders. A real-time, computer-generated list of the most important, outlying data points from thousands of daily-updated public health data streams could assist an expert reviewer in identifying these irregularities. However, existing outlier detection frameworks perform poorly on this task because they do not account for the data volume or for the statistical properties of public health streams. Accordingly, we developed FlaSH (Flagging Streams in public Health), a practical outlier detection framework for public health data users that uses simple, scalable models to capture these statistical properties explicitly. In an experiment where human experts evaluate FlaSH and existing methods (including deep learning approaches), FlaSH scales to the data volume of this task, matches or exceeds these other methods in mean accuracy, and identifies the outlier points th",
    "path": "papers/23/06/2306.16914.json",
    "total_tokens": 847,
    "translated_title": "计算辅助公共卫生数据流的质量控制",
    "translated_abstract": "公共卫生数据流中的异常情况（如COVID-19病例）阻碍了公共卫生利益相关者基于数据的决策。实时生成的计算机列表可以帮助专家评审员识别成千上万个每日更新的公共卫生数据流中最重要的异常数据点。然而，现有的异常点检测框架在该任务上表现不佳，因为它们没有考虑数据量或公共卫生数据流的统计特性。因此，我们开发了FlaSH（旗标公共卫生数据流），它是一个实用的公共卫生数据用户用的异常点检测框架，使用简单可扩展的模型来明确捕捉这些统计特性。在一个实验中，人类专家评估了FlaSH和现有方法（包括深度学习方法），FlaSH适应了该任务的数据量，与其他方法在平均准确度上达到或超过，并且可以识别出异常数据点。",
    "tldr": "开发了一个实用的异常点检测框架FlaSH，用于公共卫生数据流。该框架考虑了数据量和统计特性，并在实验中展现了良好的性能。",
    "en_tdlr": "A practical outlier detection framework, FlaSH, has been developed for public health data streams. It takes into account the data volume and statistical properties, and demonstrates good performance in an experiment."
}