{
    "title": "Leveraging Brain Modularity Prior for Interpretable Representation Learning of fMRI. (arXiv:2306.14080v1 [q-bio.QM])",
    "abstract": "Resting-state functional magnetic resonance imaging (rs-fMRI) can reflect spontaneous neural activities in brain and is widely used for brain disorder analysis.Previous studies propose to extract fMRI representations through diverse machine/deep learning methods for subsequent analysis. But the learned features typically lack biological interpretability, which limits their clinical utility. From the view of graph theory, the brain exhibits a remarkable modular structure in spontaneous brain functional networks, with each module comprised of functionally interconnected brain regions-of-interest (ROIs). However, most existing learning-based methods for fMRI analysis fail to adequately utilize such brain modularity prior. In this paper, we propose a Brain Modularity-constrained dynamic Representation learning (BMR) framework for interpretable fMRI analysis, consisting of three major components: (1) dynamic graph construction, (2) dynamic graph learning via a novel modularity-constrained g",
    "link": "http://arxiv.org/abs/2306.14080",
    "context": "Title: Leveraging Brain Modularity Prior for Interpretable Representation Learning of fMRI. (arXiv:2306.14080v1 [q-bio.QM])\nAbstract: Resting-state functional magnetic resonance imaging (rs-fMRI) can reflect spontaneous neural activities in brain and is widely used for brain disorder analysis.Previous studies propose to extract fMRI representations through diverse machine/deep learning methods for subsequent analysis. But the learned features typically lack biological interpretability, which limits their clinical utility. From the view of graph theory, the brain exhibits a remarkable modular structure in spontaneous brain functional networks, with each module comprised of functionally interconnected brain regions-of-interest (ROIs). However, most existing learning-based methods for fMRI analysis fail to adequately utilize such brain modularity prior. In this paper, we propose a Brain Modularity-constrained dynamic Representation learning (BMR) framework for interpretable fMRI analysis, consisting of three major components: (1) dynamic graph construction, (2) dynamic graph learning via a novel modularity-constrained g",
    "path": "papers/23/06/2306.14080.json",
    "total_tokens": 1001,
    "translated_title": "利用大脑模块化先验进行fMRI可解释表示学习",
    "translated_abstract": "静息状态下的功能性核磁共振成像(rs-fMRI)可以反映大脑的自发神经活动，并被广泛用于大脑疾病分析。以图论为视角，大脑在自发脑功能网络中表现出显著的模块化结构，每个模块由功能相关的感兴趣脑区域(ROIs)组成。然而，大多数现有的fMRI分析方法未能充分利用这种大脑模块化先验。我们提出了一种基于大脑模块化约束的动态表示学习(BMR)框架，其中包括三个主要组成部分：(1)动态图构建，(2)通过新颖的模块化约束图自编码器进行动态图学习和(3)可解释的特征识别。公开的 rs-fMRI 数据集上的实验结果表明，我们的 BMR 框架可以同时实现优秀的预测性能和可解释特征表示，展示了其作为 rs-fMRI 分析的有用工具的潜力。",
    "tldr": "该论文提出了一种基于大脑模块化先验的动态表示学习框架，具有优秀的预测性能和可解释特征表示，为静息状态下的功能性核磁共振成像(rs-fMRI)的临床应用提供了一种新的工具和思路。",
    "en_tdlr": "This paper proposes a Brain Modularity-constrained dynamic Representation learning (BMR) framework for interpretable fMRI analysis, which utilizes the modular structure of the brain and achieves both excellent predictive performance and interpretable feature representations, providing a new tool and approach for the clinical application of resting-state functional magnetic resonance imaging (rs-fMRI)."
}