{
    "title": "A Neural Separation Algorithm for the Rounded Capacity Inequalities. (arXiv:2306.17283v1 [cs.AI])",
    "abstract": "The cutting plane method is a key technique for successful branch-and-cut and branch-price-and-cut algorithms that find the exact optimal solutions for various vehicle routing problems (VRPs). Among various cuts, the rounded capacity inequalities (RCIs) are the most fundamental. To generate RCIs, we need to solve the separation problem, whose exact solution takes a long time to obtain; therefore, heuristic methods are widely used. We design a learning-based separation heuristic algorithm with graph coarsening that learns the solutions of the exact separation problem with a graph neural network (GNN), which is trained with small instances of 50 to 100 customers. We embed our separation algorithm within the cutting plane method to find a lower bound for the capacitated VRP (CVRP) with up to 1,000 customers. We compare the performance of our approach with CVRPSEP, a popular separation software package for various cuts used in solving VRPs. Our computational results show that our approach ",
    "link": "http://arxiv.org/abs/2306.17283",
    "context": "Title: A Neural Separation Algorithm for the Rounded Capacity Inequalities. (arXiv:2306.17283v1 [cs.AI])\nAbstract: The cutting plane method is a key technique for successful branch-and-cut and branch-price-and-cut algorithms that find the exact optimal solutions for various vehicle routing problems (VRPs). Among various cuts, the rounded capacity inequalities (RCIs) are the most fundamental. To generate RCIs, we need to solve the separation problem, whose exact solution takes a long time to obtain; therefore, heuristic methods are widely used. We design a learning-based separation heuristic algorithm with graph coarsening that learns the solutions of the exact separation problem with a graph neural network (GNN), which is trained with small instances of 50 to 100 customers. We embed our separation algorithm within the cutting plane method to find a lower bound for the capacitated VRP (CVRP) with up to 1,000 customers. We compare the performance of our approach with CVRPSEP, a popular separation software package for various cuts used in solving VRPs. Our computational results show that our approach ",
    "path": "papers/23/06/2306.17283.json",
    "total_tokens": 894,
    "translated_title": "一种用于Rounded Capacity Inequalities的神经分割算法",
    "translated_abstract": "切平面法是成功的分支定价法和分支切割法算法的关键技术，适用于各种车辆路径问题（VRPs）的确切最优解。在各种切割中，圆角容量不等式（RCIs）是最基本的。生成RCIs需要解决分割问题，其精确解需要较长的时间获取，因此广泛使用启发式方法。我们设计了一种基于学习的带有图粗化的分割启发式算法，该算法使用图神经网络（GNN）学习精确分割问题的解，经过50到100个客户的小实例训练。我们将分割算法嵌入切平面法中，以找到容量VRP（CVRP）的下限，其中包括高达1,000个客户。我们将我们的方法与CVRPSEP进行了性能比较，CVRPSEP是用于解决VRP中各种切割问题的流行分割软件包。我们的计算结果表明，我们的方法的性能优于CVRPSEP。",
    "tldr": "本论文提出了一种基于学习的分割启发式算法，使用图神经网络学习精确分割问题的解，通过嵌入切平面法找到了容量VRP的下限。"
}