{
    "title": "Score-based Enhanced Sampling for Protein Molecular Dynamics. (arXiv:2306.03117v1 [q-bio.QM])",
    "abstract": "The dynamic nature of proteins is crucial for determining their biological functions and properties, and molecular dynamics (MD) simulations stand as a predominant tool to study such phenomena. By utilizing empirically derived force fields, MD simulations explore the conformational space through numerically evolving the system along MD trajectories. However, the high-energy barrier of the force fields can hamper the exploration of MD, resulting in inadequately sampled ensemble. In this paper, we propose leveraging score-based generative models (SGMs) trained on general protein structures to perform protein conformational sampling to complement traditional MD simulations. We argue that SGMs can provide a novel framework as an alternative to traditional enhanced sampling methods by learning multi-level score functions, which directly sample a diversity-controllable ensemble of conformations. We demonstrate the effectiveness of our approach on several benchmark systems by comparing the re",
    "link": "http://arxiv.org/abs/2306.03117",
    "context": "Title: Score-based Enhanced Sampling for Protein Molecular Dynamics. (arXiv:2306.03117v1 [q-bio.QM])\nAbstract: The dynamic nature of proteins is crucial for determining their biological functions and properties, and molecular dynamics (MD) simulations stand as a predominant tool to study such phenomena. By utilizing empirically derived force fields, MD simulations explore the conformational space through numerically evolving the system along MD trajectories. However, the high-energy barrier of the force fields can hamper the exploration of MD, resulting in inadequately sampled ensemble. In this paper, we propose leveraging score-based generative models (SGMs) trained on general protein structures to perform protein conformational sampling to complement traditional MD simulations. We argue that SGMs can provide a novel framework as an alternative to traditional enhanced sampling methods by learning multi-level score functions, which directly sample a diversity-controllable ensemble of conformations. We demonstrate the effectiveness of our approach on several benchmark systems by comparing the re",
    "path": "papers/23/06/2306.03117.json",
    "total_tokens": 900,
    "tldr": "提出了一种利用基于评分的生成模型（SGM）来执行蛋白质构象采样的方法，以补充传统MD模拟，可以通过学习多级评分函数提供具有多样性可控的构象集合，已在基准系统上证明了有效性。"
}