{
    "title": "A VAE Approach to Sample Multivariate Extremes. (arXiv:2306.10987v1 [stat.ML])",
    "abstract": "Generating accurate extremes from an observational data set is crucial when seeking to estimate risks associated with the occurrence of future extremes which could be larger than those already observed. Applications range from the occurrence of natural disasters to financial crashes. Generative approaches from the machine learning community do not apply to extreme samples without careful adaptation. Besides, asymptotic results from extreme value theory (EVT) give a theoretical framework to model multivariate extreme events, especially through the notion of multivariate regular variation. Bridging these two fields, this paper details a variational autoencoder (VAE) approach for sampling multivariate heavy-tailed distributions, i.e., distributions likely to have extremes of particularly large intensities. We illustrate the relevance of our approach on a synthetic data set and on a real data set of discharge measurements along the Danube river network. The latter shows the potential of ou",
    "link": "http://arxiv.org/abs/2306.10987",
    "context": "Title: A VAE Approach to Sample Multivariate Extremes. (arXiv:2306.10987v1 [stat.ML])\nAbstract: Generating accurate extremes from an observational data set is crucial when seeking to estimate risks associated with the occurrence of future extremes which could be larger than those already observed. Applications range from the occurrence of natural disasters to financial crashes. Generative approaches from the machine learning community do not apply to extreme samples without careful adaptation. Besides, asymptotic results from extreme value theory (EVT) give a theoretical framework to model multivariate extreme events, especially through the notion of multivariate regular variation. Bridging these two fields, this paper details a variational autoencoder (VAE) approach for sampling multivariate heavy-tailed distributions, i.e., distributions likely to have extremes of particularly large intensities. We illustrate the relevance of our approach on a synthetic data set and on a real data set of discharge measurements along the Danube river network. The latter shows the potential of ou",
    "path": "papers/23/06/2306.10987.json",
    "total_tokens": 891,
    "translated_title": "一种用于生成多元极值的VAE方法",
    "translated_abstract": "当我们需要评估未来可能会出现的比已观察到的极值更大的极端情况的风险时，从观测数据集中准确地生成极值至关重要。 应用范围包括自然灾害和金融崩溃。 机器学习社区的生成方法不适用于极端样本，需要仔细适应。此外，极值理论的渐进结果提供了一个理论框架，尤其是通过多元正则变化的概念来模拟多元极端事件。 连接这两个领域，本文详细介绍了一种用于抽样多元重尾分布的变分自动编码器（VAE）方法，即可能具有特别大强度的极端分布。 我们在合成数据集和沿多瑙河网络的实际数据集上说明了我们方法的相关性。 后者显示了我们的方法通过从已观察到的极值分布中抽样来模拟河流水位的潜力。",
    "tldr": "本论文提出了一种用于抽样多元重尾分布的VAE方法，该方法可以模拟真实世界的多元极值情况，如河流水位，从而有助于评估未来可能出现的风险。",
    "en_tdlr": "This paper presents a VAE approach for sampling multivariate heavy-tailed distributions, which can simulate real-world multivariate extreme events such as river water levels, helping to assess future potential risks."
}