{
    "title": "Scalable tensor methods for nonuniform hypergraphs. (arXiv:2306.17825v1 [math.NA])",
    "abstract": "While multilinear algebra appears natural for studying the multiway interactions modeled by hypergraphs, tensor methods for general hypergraphs have been stymied by theoretical and practical barriers. A recently proposed adjacency tensor is applicable to nonuniform hypergraphs, but is prohibitively costly to form and analyze in practice. We develop tensor times same vector (TTSV) algorithms for this tensor which improve complexity from $O(n^r)$ to a low-degree polynomial in $r$, where $n$ is the number of vertices and $r$ is the maximum hyperedge size. Our algorithms are implicit, avoiding formation of the order $r$ adjacency tensor. We demonstrate the flexibility and utility of our approach in practice by developing tensor-based hypergraph centrality and clustering algorithms. We also show these tensor measures offer complementary information to analogous graph-reduction approaches on data, and are also able to detect higher-order structure that many existing matrix-based approaches p",
    "link": "http://arxiv.org/abs/2306.17825",
    "context": "Title: Scalable tensor methods for nonuniform hypergraphs. (arXiv:2306.17825v1 [math.NA])\nAbstract: While multilinear algebra appears natural for studying the multiway interactions modeled by hypergraphs, tensor methods for general hypergraphs have been stymied by theoretical and practical barriers. A recently proposed adjacency tensor is applicable to nonuniform hypergraphs, but is prohibitively costly to form and analyze in practice. We develop tensor times same vector (TTSV) algorithms for this tensor which improve complexity from $O(n^r)$ to a low-degree polynomial in $r$, where $n$ is the number of vertices and $r$ is the maximum hyperedge size. Our algorithms are implicit, avoiding formation of the order $r$ adjacency tensor. We demonstrate the flexibility and utility of our approach in practice by developing tensor-based hypergraph centrality and clustering algorithms. We also show these tensor measures offer complementary information to analogous graph-reduction approaches on data, and are also able to detect higher-order structure that many existing matrix-based approaches p",
    "path": "papers/23/06/2306.17825.json",
    "total_tokens": 957,
    "translated_title": "可扩展的非均匀超图的张量方法",
    "translated_abstract": "尽管多线性代数在研究由超图模拟的多方交互方面似乎很自然，但通用超图的张量方法受到理论和实际限制的阻碍。最近提出的邻接张量适用于非均匀超图，但在实践中形成和分析它是代价高昂的。我们开发了这个张量的张量乘相同向量（TTSV）算法，将复杂度从$O(n^r)$降低到$r$的低次多项式，其中$n$是顶点的数量，$r$是最大超边大小。我们的算法是隐式的，避免了形成$r$阶邻接张量。通过开发基于张量的超图中心性和聚类算法，我们展示了我们方法的灵活性和实用性。我们还展示了这些张量度量在数据上与类似的图缩减方法提供互补信息，并且还能够检测到许多现有基于矩阵的方法无法检测到的高阶结构。",
    "tldr": "本论文提出了一种可扩展的张量方法，用于处理非均匀超图。通过开发新的TTSV算法，我们能够在低于指数复杂度的情况下处理邻接张量，并应用于超图中心性和聚类等问题。这些方法不仅能提供与图缩减方法互补的信息，还能够探测到高阶结构。",
    "en_tdlr": "This paper presents a scalable tensor method for nonuniform hypergraphs. By developing a new TTSV algorithm, the complexity of handling the adjacency tensor is reduced to a low-degree polynomial. The proposed method is applicable to hypergraph centrality and clustering, providing complementary information to graph-reduction approaches and detecting higher-order structures."
}