{
    "title": "Neural networks can detect model-free static arbitrage strategies. (arXiv:2306.16422v1 [q-fin.CP])",
    "abstract": "In this paper we demonstrate both theoretically as well as numerically that neural networks can detect model-free static arbitrage opportunities whenever the market admits some. Due to the use of neural networks, our method can be applied to financial markets with a high number of traded securities and ensures almost immediate execution of the corresponding trading strategies. To demonstrate its tractability, effectiveness, and robustness we provide examples using real financial data. From a technical point of view, we prove that a single neural network can approximately solve a class of convex semi-infinite programs, which is the key result in order to derive our theoretical results that neural networks can detect model-free static arbitrage strategies whenever the financial market admits such opportunities.",
    "link": "http://arxiv.org/abs/2306.16422",
    "context": "Title: Neural networks can detect model-free static arbitrage strategies. (arXiv:2306.16422v1 [q-fin.CP])\nAbstract: In this paper we demonstrate both theoretically as well as numerically that neural networks can detect model-free static arbitrage opportunities whenever the market admits some. Due to the use of neural networks, our method can be applied to financial markets with a high number of traded securities and ensures almost immediate execution of the corresponding trading strategies. To demonstrate its tractability, effectiveness, and robustness we provide examples using real financial data. From a technical point of view, we prove that a single neural network can approximately solve a class of convex semi-infinite programs, which is the key result in order to derive our theoretical results that neural networks can detect model-free static arbitrage strategies whenever the financial market admits such opportunities.",
    "path": "papers/23/06/2306.16422.json",
    "total_tokens": 746,
    "translated_title": "神经网络可以检测无模型静态套利策略",
    "translated_abstract": "本文利用理论和数值方法证明了神经网络可以在市场存在套利机会时检测出无模型静态套利机会。由于使用了神经网络，我们的方法可以应用于交易证券数量较多的金融市场，并确保相应交易策略的几乎即时执行。为了证明其易处理性、有效性和稳健性，我们提供了使用真实金融数据的示例。从技术角度来看，我们证明了单个神经网络可以近似解决一类凸半无限规划问题，这是推导出我们的理论结果的关键。",
    "tldr": "本文证明了神经网络可以检测金融市场中的无模型静态套利机会，并可应用于交易证券数量较多的金融市场。我们的方法具有易处理性、有效性和稳健性，并使用真实金融数据进行了示例验证。",
    "en_tdlr": "This paper demonstrates that neural networks can detect model-free static arbitrage opportunities in financial markets, especially in markets with a high number of traded securities. The method is proven to be tractable, effective, and robust, and is supported by examples using real financial data."
}