{
    "title": "Interbank Decisions and Margins of Stability: an Agent-Based Stock-Flow Consistent Approach. (arXiv:2306.05860v1 [econ.GN])",
    "abstract": "This study investigates the functioning of modern payment systems through the lens of banks' maturity mismatch practices, and it examines the effects of banks' refusal to roll over short-term interbank liabilities on financial stability. Within an agent-based stock-flow consistent framework, banks can engage in two segments of the interbank market that differ in maturity, overnight and term. We compare two interbank matching scenarios to assess how bank-specific maturity targets, dependent on the dictates of the Net Stable Funding Ratio, impact the dynamics of the interbank market and the effectiveness of conventional monetary policies. The findings reveal that maturity misalignment between deficit and surplus banks compromises the interbank market's efficiency and increases reliance on the central bank's standing facilities. Monetary policy interest-rate steering practices also become less effective. The study also uncovers a dual stability-based configuration in the banking sector, r",
    "link": "http://arxiv.org/abs/2306.05860",
    "context": "Title: Interbank Decisions and Margins of Stability: an Agent-Based Stock-Flow Consistent Approach. (arXiv:2306.05860v1 [econ.GN])\nAbstract: This study investigates the functioning of modern payment systems through the lens of banks' maturity mismatch practices, and it examines the effects of banks' refusal to roll over short-term interbank liabilities on financial stability. Within an agent-based stock-flow consistent framework, banks can engage in two segments of the interbank market that differ in maturity, overnight and term. We compare two interbank matching scenarios to assess how bank-specific maturity targets, dependent on the dictates of the Net Stable Funding Ratio, impact the dynamics of the interbank market and the effectiveness of conventional monetary policies. The findings reveal that maturity misalignment between deficit and surplus banks compromises the interbank market's efficiency and increases reliance on the central bank's standing facilities. Monetary policy interest-rate steering practices also become less effective. The study also uncovers a dual stability-based configuration in the banking sector, r",
    "path": "papers/23/06/2306.05860.json",
    "total_tokens": 968,
    "translated_title": "银行间决策和稳定边界: 一种基于代理人的股-流一致性方法的研究(arXiv:2306.05860v1 [econ.GN])",
    "translated_abstract": "本研究通过银行成熟度错配行为的视角，研究现代支付系统的运作，并探讨银行拒绝滚动短期银行间负债对金融稳定的影响。在基于代理人的股-流一致性框架下，银行在两个不同成熟期的银行间市场中进行交易，即隔夜市场和期限市场。我们比较了两种银行间匹配情景，以评估依赖于净稳定资金比率规定的银行特定成熟度目标，对银行间市场动态和传统货币政策有效性的影响。研究结果表明，赤字和盈余银行之间的成熟度错配损害了银行间市场的效率，并增加了对中央银行的常备措施的依赖。货币政策利率调控也变得不那么有效。该研究还揭示了银行业中的双重稳定性配置。",
    "tldr": "本篇论文以代理人模型为基础，研究了现代支付系统的运作，发现赤字银行和盈余银行之间的成熟度错配威胁了银行间市场的有效性和金融稳定，同时传统货币政策的有效性也受到了影响。"
}