{
    "title": "Long-Term Hourly Scenario Generation for Correlated Wind and Solar Power combining Variational Autoencoders with Radial Basis Function Kernels. (arXiv:2306.16427v1 [cs.LG])",
    "abstract": "Accurate generation of realistic future scenarios of renewable energy generation is crucial for long-term planning and operation of electrical systems, especially considering the increasing focus on sustainable energy and the growing penetration of renewable generation in energy matrices. These predictions enable power system operators and energy planners to effectively manage the variability and intermittency associated with renewable generation, allowing for better grid stability, improved energy management, and enhanced decision-making processes. In this paper, we propose an innovative method for generating long-term hourly scenarios for wind and solar power generation, taking into consideration the correlation between these two energy sources. To achieve this, we combine the capabilities of a Variational Autoencoder (VAE) with the additional benefits of incorporating the Radial Basis Function (RBF) kernel in our artificial neural network architecture. By incorporating them, we aim ",
    "link": "http://arxiv.org/abs/2306.16427",
    "context": "Title: Long-Term Hourly Scenario Generation for Correlated Wind and Solar Power combining Variational Autoencoders with Radial Basis Function Kernels. (arXiv:2306.16427v1 [cs.LG])\nAbstract: Accurate generation of realistic future scenarios of renewable energy generation is crucial for long-term planning and operation of electrical systems, especially considering the increasing focus on sustainable energy and the growing penetration of renewable generation in energy matrices. These predictions enable power system operators and energy planners to effectively manage the variability and intermittency associated with renewable generation, allowing for better grid stability, improved energy management, and enhanced decision-making processes. In this paper, we propose an innovative method for generating long-term hourly scenarios for wind and solar power generation, taking into consideration the correlation between these two energy sources. To achieve this, we combine the capabilities of a Variational Autoencoder (VAE) with the additional benefits of incorporating the Radial Basis Function (RBF) kernel in our artificial neural network architecture. By incorporating them, we aim ",
    "path": "papers/23/06/2306.16427.json",
    "total_tokens": 864,
    "translated_title": "长期关联风力和太阳能发电的逐时场景生成：结合变分自动编码器和径向基函数核的方法",
    "translated_abstract": "准确生成可持续能源发电的未来场景对于电力系统的长期规划和运营至关重要，尤其是考虑到可持续能源的日益关注和在能源矩阵中的不断增加的渗透。这些预测能够帮助电力系统运营商和能源规划师有效地管理可再生能源发电所带来的变异性和间歇性，从而实现更好的电网稳定性、改善能源管理和加强决策过程。在本文中，我们提出了一种创新的方法，用于生成风力和太阳能发电的长期逐时场景，同时考虑这两种能源来源之间的相关性。为了实现这一目标，我们将变分自动编码器（VAE）的能力与在我们的人工神经网络结构中纳入径向基函数（RBF）核的额外优势相结合。",
    "tldr": "本文提出了一种创新的方法，结合变分自动编码器和径向基函数核，用于生成长期逐时的风力和太阳能发电场景，并考虑了这两种能源来源之间的相关性。"
}