{
    "title": "No Bidding, No Regret: Pairwise-Feedback Mechanisms for Digital Goods and Data Auctions. (arXiv:2306.01860v1 [cs.GT])",
    "abstract": "The growing demand for data and AI-generated digital goods, such as personalized written content and artwork, necessitates effective pricing and feedback mechanisms that account for uncertain utility and costly production. Motivated by these developments, this study presents a novel mechanism design addressing a general repeated-auction setting where the utility derived from a sold good is revealed post-sale. The mechanism's novelty lies in using pairwise comparisons for eliciting information from the bidder, arguably easier for humans than assigning a numerical value. Our mechanism chooses allocations using an epsilon-greedy strategy and relies on pairwise comparisons between realized utility from allocated goods and an arbitrary value, avoiding the learning-to-bid problem explored in previous work. We prove this mechanism to be asymptotically truthful, individually rational, and welfare and revenue maximizing. The mechanism's relevance is broad, applying to any setting with made-to-o",
    "link": "http://arxiv.org/abs/2306.01860",
    "context": "Title: No Bidding, No Regret: Pairwise-Feedback Mechanisms for Digital Goods and Data Auctions. (arXiv:2306.01860v1 [cs.GT])\nAbstract: The growing demand for data and AI-generated digital goods, such as personalized written content and artwork, necessitates effective pricing and feedback mechanisms that account for uncertain utility and costly production. Motivated by these developments, this study presents a novel mechanism design addressing a general repeated-auction setting where the utility derived from a sold good is revealed post-sale. The mechanism's novelty lies in using pairwise comparisons for eliciting information from the bidder, arguably easier for humans than assigning a numerical value. Our mechanism chooses allocations using an epsilon-greedy strategy and relies on pairwise comparisons between realized utility from allocated goods and an arbitrary value, avoiding the learning-to-bid problem explored in previous work. We prove this mechanism to be asymptotically truthful, individually rational, and welfare and revenue maximizing. The mechanism's relevance is broad, applying to any setting with made-to-o",
    "path": "papers/23/06/2306.01860.json",
    "total_tokens": 951,
    "translated_title": "无竞标，无遗憾：针对数字商品和数据拍卖的对偶反馈机制。",
    "translated_abstract": "随着数据和 AI 生成数字商品（如个性化书面内容和艺术品）的需求增长，需要有效定价和反馈机制来考虑不确定的效用和昂贵的生产成本。为了解决这些问题，本研究提出了一种新颖的机制设计，适用于一个通用的重复拍卖设置，其中售出商品的效用在销售后揭示。该机制的新颖之处在于使用成对比较来从竞标者那里获取信息，相对于指定数量值来说对人类更容易理解。我们的机制使用 epsilon-greedy 策略选择分配，并且依赖于已分配商品的实现效用和任意值之间的成对比较，避免了以前的学习出价问题。我们证明了该机制是渐近诚实、个体理性、福利和收益最大化的。该机制适用范围广泛，适用于任何需要定制生产、没有固定价格的商品或服务的场景。",
    "tldr": "本文提出了针对重复拍卖设置的对偶反馈机制，使用成对比较来从竞标者那里获取信息，避免了之前的学习出价问题，该机制被证明为渐近诚实、个体理性、福利和收益最大化的且适用于任何需要定制生产的商品拍卖场景。",
    "en_tdlr": "The study presents a novel mechanism design using pairwise comparisons to elicit information from bidders in a repeated auction setting with utility revealed post-sale. The mechanism is proven to be asymptotically truthful, individually rational, welfare and revenue maximizing, and applicable to any setting with made-to-order goods or services."
}