{
    "title": "Approximate Causal Effect Identification under Weak Confounding. (arXiv:2306.13242v1 [stat.ML])",
    "abstract": "Causal effect estimation has been studied by many researchers when only observational data is available. Sound and complete algorithms have been developed for pointwise estimation of identifiable causal queries. For non-identifiable causal queries, researchers developed polynomial programs to estimate tight bounds on causal effect. However, these are computationally difficult to optimize for variables with large support sizes. In this paper, we analyze the effect of \"weak confounding\" on causal estimands. More specifically, under the assumption that the unobserved confounders that render a query non-identifiable have small entropy, we propose an efficient linear program to derive the upper and lower bounds of the causal effect. We show that our bounds are consistent in the sense that as the entropy of unobserved confounders goes to zero, the gap between the upper and lower bound vanishes. Finally, we conduct synthetic and real data simulations to compare our bounds with the bounds obta",
    "link": "http://arxiv.org/abs/2306.13242",
    "context": "Title: Approximate Causal Effect Identification under Weak Confounding. (arXiv:2306.13242v1 [stat.ML])\nAbstract: Causal effect estimation has been studied by many researchers when only observational data is available. Sound and complete algorithms have been developed for pointwise estimation of identifiable causal queries. For non-identifiable causal queries, researchers developed polynomial programs to estimate tight bounds on causal effect. However, these are computationally difficult to optimize for variables with large support sizes. In this paper, we analyze the effect of \"weak confounding\" on causal estimands. More specifically, under the assumption that the unobserved confounders that render a query non-identifiable have small entropy, we propose an efficient linear program to derive the upper and lower bounds of the causal effect. We show that our bounds are consistent in the sense that as the entropy of unobserved confounders goes to zero, the gap between the upper and lower bound vanishes. Finally, we conduct synthetic and real data simulations to compare our bounds with the bounds obta",
    "path": "papers/23/06/2306.13242.json",
    "total_tokens": 937,
    "translated_title": "弱混淆下的近似因果效应识别",
    "translated_abstract": "在只有观测数据可用时，许多研究人员研究了因果效应估计问题。针对可识别因果查询的点估计，已经开发出了正确完备的算法。对于不可识别的因果查询，研究人员开发了多项式程序，以估计因果效应的紧密界限。但对于支持大小较大的变量，优化这些多项式程序在计算上很困难。在本文中，我们分析了“弱混淆”对因果估计的影响。更具体地说，在未观测到的混淆变量的熵很小的假设下，我们提出了一种有效的线性规划方法来导出因果效应的上限和下限。我们证明了我们的界限是一致的，也就是说，当未观测混淆变量的熵趋近于零时，上限和下限之间的差异会消失。最后，我们进行了合成和真实数据模拟，以比较我们的方法与最先进的多项式程序得到的界限，并证明我们的方法在计算上更加高效，性能也可以达到类似的水平。",
    "tldr": "本文提出了一种有效的方法来在弱混淆下识别因果效应的上限和下限，并证明了这种方法的计算效率优于最先进的多项式程序。"
}