{
    "title": "Topic-Guided Sampling For Data-Efficient Multi-Domain Stance Detection. (arXiv:2306.00765v1 [cs.CL])",
    "abstract": "Stance Detection is concerned with identifying the attitudes expressed by an author towards a target of interest. This task spans a variety of domains ranging from social media opinion identification to detecting the stance for a legal claim. However, the framing of the task varies within these domains, in terms of the data collection protocol, the label dictionary and the number of available annotations. Furthermore, these stance annotations are significantly imbalanced on a per-topic and inter-topic basis. These make multi-domain stance detection a challenging task, requiring standardization and domain adaptation. To overcome this challenge, we propose $\\textbf{T}$opic $\\textbf{E}$fficient $\\textbf{St}$anc$\\textbf{E}$ $\\textbf{D}$etection (TESTED), consisting of a topic-guided diversity sampling technique and a contrastive objective that is used for fine-tuning a stance classifier. We evaluate the method on an existing benchmark of $16$ datasets with in-domain, i.e. all topics seen a",
    "link": "http://arxiv.org/abs/2306.00765",
    "context": "Title: Topic-Guided Sampling For Data-Efficient Multi-Domain Stance Detection. (arXiv:2306.00765v1 [cs.CL])\nAbstract: Stance Detection is concerned with identifying the attitudes expressed by an author towards a target of interest. This task spans a variety of domains ranging from social media opinion identification to detecting the stance for a legal claim. However, the framing of the task varies within these domains, in terms of the data collection protocol, the label dictionary and the number of available annotations. Furthermore, these stance annotations are significantly imbalanced on a per-topic and inter-topic basis. These make multi-domain stance detection a challenging task, requiring standardization and domain adaptation. To overcome this challenge, we propose $\\textbf{T}$opic $\\textbf{E}$fficient $\\textbf{St}$anc$\\textbf{E}$ $\\textbf{D}$etection (TESTED), consisting of a topic-guided diversity sampling technique and a contrastive objective that is used for fine-tuning a stance classifier. We evaluate the method on an existing benchmark of $16$ datasets with in-domain, i.e. all topics seen a",
    "path": "papers/23/06/2306.00765.json",
    "total_tokens": 840,
    "tldr": "本文提出了一个名为TESTED的主题引导的多领域立场检测方法。该方法采用了一种基于主题的多样性采样技术和对比目标，用于微调立场分类器。结果表明，该方法在现有的16个数据集上取得了良好的效果。"
}