{
    "title": "Sparsity exploitation via discovering graphical models in multi-variate time-series forecasting. (arXiv:2306.17090v1 [cs.LG])",
    "abstract": "Graph neural networks (GNNs) have been widely applied in multi-variate time-series forecasting (MTSF) tasks because of their capability in capturing the correlations among different time-series. These graph-based learning approaches improve the forecasting performance by discovering and understanding the underlying graph structures, which represent the data correlation. When the explicit prior graph structures are not available, most existing works cannot guarantee the sparsity of the generated graphs that make the overall model computational expensive and less interpretable. In this work, we propose a decoupled training method, which includes a graph generating module and a GNNs forecasting module. First, we use Graphical Lasso (or GraphLASSO) to directly exploit the sparsity pattern from data to build graph structures in both static and time-varying cases. Second, we fit these graph structures and the input data into a Graph Convolutional Recurrent Network (GCRN) to train a forecasti",
    "link": "http://arxiv.org/abs/2306.17090",
    "context": "Title: Sparsity exploitation via discovering graphical models in multi-variate time-series forecasting. (arXiv:2306.17090v1 [cs.LG])\nAbstract: Graph neural networks (GNNs) have been widely applied in multi-variate time-series forecasting (MTSF) tasks because of their capability in capturing the correlations among different time-series. These graph-based learning approaches improve the forecasting performance by discovering and understanding the underlying graph structures, which represent the data correlation. When the explicit prior graph structures are not available, most existing works cannot guarantee the sparsity of the generated graphs that make the overall model computational expensive and less interpretable. In this work, we propose a decoupled training method, which includes a graph generating module and a GNNs forecasting module. First, we use Graphical Lasso (or GraphLASSO) to directly exploit the sparsity pattern from data to build graph structures in both static and time-varying cases. Second, we fit these graph structures and the input data into a Graph Convolutional Recurrent Network (GCRN) to train a forecasti",
    "path": "papers/23/06/2306.17090.json",
    "total_tokens": 953,
    "translated_title": "通过发现多元时间序列预测中的图模型利用稀疏性",
    "translated_abstract": "图神经网络（GNN）广泛应用于多元时间序列预测（MTSF）任务中，因为它们能够捕捉不同时间序列之间的相关性。这些基于图的学习方法通过发现和理解表示数据相关性的底层图结构来提高预测性能。当显式的先验图结构不可用时，大多数现有工作无法保证生成的图的稀疏性，使得整体模型计算复杂且难以解释。在这项工作中，我们提出了一种解耦训练方法，其中包括一个图生成模块和一个GNN预测模块。首先，我们使用图形Lasso（或GraphLASSO）直接从数据中利用稀疏模式构建静态和时变情况下的图结构。其次，我们将这些图结构和输入数据拟合到一个图卷积循环网络（GCRN）中，以训练一个预测模型。",
    "tldr": "这项工作提出了一种使用图模型进行多元时间序列预测的方法，通过发现和理解底层图结构的相关性来提高预测性能。通过直接利用数据中的稀疏模式构建图结构，从而解决了在没有显式先验图结构的情况下生成的图不稀疏的问题，提高了模型的计算效率和可解释性。",
    "en_tdlr": "This work proposes a method for multi-variate time-series forecasting using graphical models, which improves the prediction performance by discovering and understanding the underlying graph structures. By directly exploiting the sparse pattern from data to build graph structures, it addresses the issue of non-sparse graphs generated without explicit prior graph structures, thus enhancing the computational efficiency and interpretability of the model."
}