{
    "title": "HDDL 2.1: Towards Defining a Formalism and a Semantics for Temporal HTN Planning. (arXiv:2306.07353v1 [cs.AI])",
    "abstract": "Real world applications as in industry and robotics need modelling rich and diverse automated planning problems. Their resolution usually requires coordinated and concurrent action execution. In several cases, these problems are naturally decomposed in a hierarchical way and expressed by a Hierarchical Task Network (HTN) formalism.  HDDL, a hierarchical extension of the Planning Domain Definition Language (PDDL), unlike PDDL 2.1 does not allow to represent planning problems with numerical and temporal constraints, which are essential for real world applications. We propose to fill the gap between HDDL and these operational needs and to extend HDDL by taking inspiration from PDDL 2.1 in order to express numerical and temporal expressions. This paper opens discussions on the semantics and the syntax needed for a future HDDL 2.1 extension.",
    "link": "http://arxiv.org/abs/2306.07353",
    "context": "Title: HDDL 2.1: Towards Defining a Formalism and a Semantics for Temporal HTN Planning. (arXiv:2306.07353v1 [cs.AI])\nAbstract: Real world applications as in industry and robotics need modelling rich and diverse automated planning problems. Their resolution usually requires coordinated and concurrent action execution. In several cases, these problems are naturally decomposed in a hierarchical way and expressed by a Hierarchical Task Network (HTN) formalism.  HDDL, a hierarchical extension of the Planning Domain Definition Language (PDDL), unlike PDDL 2.1 does not allow to represent planning problems with numerical and temporal constraints, which are essential for real world applications. We propose to fill the gap between HDDL and these operational needs and to extend HDDL by taking inspiration from PDDL 2.1 in order to express numerical and temporal expressions. This paper opens discussions on the semantics and the syntax needed for a future HDDL 2.1 extension.",
    "path": "papers/23/06/2306.07353.json",
    "total_tokens": 794,
    "translated_title": "HDDL 2.1：面向时间HTN规划的形式化和语义定义",
    "translated_abstract": "工业和机器人等现实世界应用需要建模丰富多样的自动化规划问题。它们的解决通常需要协调和并行执行。在多个情况下，这些问题自然地以分层任务网络（HTN）形式进行分解和表达。 HDDL是规划域定义语言（PDDL）的分层扩展，与PDDL 2.1不同，它不允许表示带有数值和时间约束的计划问题，这对于现实世界应用至关重要。我们建议弥补HDDL与这些操作需求之间的差距，并从PDDL 2.1中汲取灵感，扩展HDDL以表示数字和时间表达式。本文开展了关于未来HDDL 2.1扩展所需的语义和语法的讨论。",
    "tldr": "本文介绍了HDDL 2.1的形式化和语义定义，旨在通过从PDDL 2.1中汲取灵感，弥补HDDL不能表示数字和时间约束的不足。",
    "en_tdlr": "This paper proposes the formalism and semantics of HDDL 2.1, with the aim of extending HDDL to express numerical and temporal expressions by taking inspiration from PDDL 2.1."
}