{
    "title": "Optimal execution and speculation with trade signals. (arXiv:2306.00621v1 [q-fin.TR])",
    "abstract": "We propose a price impact model where changes in prices are purely driven by the order flow in the market. The stochastic price impact of market orders and the arrival rates of limit and market orders are functions of the market liquidity process which reflects the balance of the demand and supply of liquidity. Limit and market orders mutually excite each other so that liquidity is mean reverting. We use the theory of Meyer-$\\sigma$-fields to introduce a short-term signal process from which a trader learns about imminent changes in order flow. In this setting, we examine an optimal execution problem and derive the Hamilton--Jacobi--Bellman (HJB) equation for the value function. The HJB equation is solved numerically and we illustrate how the trader uses the signal to enhance the performance of execution problems and to execute speculative strategies.",
    "link": "http://arxiv.org/abs/2306.00621",
    "context": "Title: Optimal execution and speculation with trade signals. (arXiv:2306.00621v1 [q-fin.TR])\nAbstract: We propose a price impact model where changes in prices are purely driven by the order flow in the market. The stochastic price impact of market orders and the arrival rates of limit and market orders are functions of the market liquidity process which reflects the balance of the demand and supply of liquidity. Limit and market orders mutually excite each other so that liquidity is mean reverting. We use the theory of Meyer-$\\sigma$-fields to introduce a short-term signal process from which a trader learns about imminent changes in order flow. In this setting, we examine an optimal execution problem and derive the Hamilton--Jacobi--Bellman (HJB) equation for the value function. The HJB equation is solved numerically and we illustrate how the trader uses the signal to enhance the performance of execution problems and to execute speculative strategies.",
    "path": "papers/23/06/2306.00621.json",
    "total_tokens": 834,
    "translated_title": "带有交易信号的最优执行和投机",
    "translated_abstract": "我们提出了一个价格冲击模型，在这个模型中，价格的变化纯粹由市场的订单流动驱动。 市场订单的随机价格冲击和限价订单和市场订单的到达率是市场流动性过程的函数，该流动性过程反映了市场流动性的供需平衡。 限价订单和市场订单相互激发，使得流动性具有均值回归性质。我们使用 Meyers-$\\sigma$-场的理论引入一个短期信号过程，从中交易员可以了解订单流的即将发生的变化。在这种情况下，我们研究了最优执行问题，并推导了其价值函数的Hamilton-Jacobi-Bellman（HJB）方程。 HJB方程经过数值求解后，我们演示了交易员如何使用信号来增强执行问题的性能并执行投机策略。",
    "tldr": "本文提出了一个价格冲击模型，基于市场的订单流动来推导市场的随机价格变化，提出了一个短期信号过程来帮助交易员了解订单流的变化，为最优执行问题提供了解决方案。",
    "en_tdlr": "The paper proposes a price impact model which derives stochastic price changes solely from the market order flow, and introduces a short-term signal process to allow traders to anticipate changes in order flow. The optimal execution problem is examined and solved numerically, demonstrating how the signal can enhance performance and facilitate speculative strategies."
}