{
    "title": "Fractal properties, information theory, and market efficiency. (arXiv:2306.13371v1 [q-fin.ST])",
    "abstract": "Considering that both the entropy-based market information and the Hurst exponent are useful tools for determining whether the efficient market hypothesis holds for a given asset, we study the link between the two approaches. We thus provide a theoretical expression for the market information when log-prices follow either a fractional Brownian motion or its stationary extension using the Lamperti transform. In the latter model, we show that a Hurst exponent close to 1/2 can lead to a very high informativeness of the time series, because of the stationarity mechanism. In addition, we introduce a multiscale method to get a deeper interpretation of the entropy and of the market information, depending on the size of the information set. Applications to Bitcoin, CAC 40 index, Nikkei 225 index, and EUR/USD FX rate, using daily or intraday data, illustrate the methodological content.",
    "link": "http://arxiv.org/abs/2306.13371",
    "context": "Title: Fractal properties, information theory, and market efficiency. (arXiv:2306.13371v1 [q-fin.ST])\nAbstract: Considering that both the entropy-based market information and the Hurst exponent are useful tools for determining whether the efficient market hypothesis holds for a given asset, we study the link between the two approaches. We thus provide a theoretical expression for the market information when log-prices follow either a fractional Brownian motion or its stationary extension using the Lamperti transform. In the latter model, we show that a Hurst exponent close to 1/2 can lead to a very high informativeness of the time series, because of the stationarity mechanism. In addition, we introduce a multiscale method to get a deeper interpretation of the entropy and of the market information, depending on the size of the information set. Applications to Bitcoin, CAC 40 index, Nikkei 225 index, and EUR/USD FX rate, using daily or intraday data, illustrate the methodological content.",
    "path": "papers/23/06/2306.13371.json",
    "total_tokens": 873,
    "translated_title": "分形性质、信息理论和市场效率",
    "translated_abstract": "考虑到基于信息熵和赫斯特指数都是用于确定给定资产有效市场假说是否成立的有用工具，我们研究了这两种方法之间的联系。因此，我们使用Lamperti变换为市场信息提供了一个理论表达，当对数价格遵循分数布朗运动或其平稳扩展时，我们对这两种模型进行了研究。在后一种模型中，我们展示了Hurst指数接近1/2可以导致时间序列的信息性非常高，因为具有平稳机制。此外，我们引入了一种多尺度方法，根据信息集的大小获取对信息熵和市场信息的更深层次解释。使用日内或日常数据对比特币、法国CAC 40指数、日经225指数和EUR/USD外汇率进行了应用，以阐明方法的内容。",
    "tldr": "研究基于信息熵和赫斯特指数的市场信息获取方法及其联系，证明当Hurst指数接近1/2时，时间序列的信息性很高，提出多尺度方法深入解释信息熵和市场信息。",
    "en_tdlr": "This paper studies the methods of obtaining market information based on information entropy and Hurst exponent, and proves that when the Hurst exponent is close to 1/2, the time series has a very high level of informativeness. A multiscale method is proposed to provide deeper interpretations of information entropy and market information. Applications to Bitcoin, CAC 40 index, Nikkei 225 index, and EUR/USD FX rate are provided to illustrate the proposed methods."
}