{
    "title": "Deep learning techniques for blind image super-resolution: A high-scale multi-domain perspective evaluation. (arXiv:2306.09426v1 [eess.IV])",
    "abstract": "Despite several solutions and experiments have been conducted recently addressing image super-resolution (SR), boosted by deep learning (DL) techniques, they do not usually design evaluations with high scaling factors, capping it at 2x or 4x. Moreover, the datasets are generally benchmarks which do not truly encompass significant diversity of domains to proper evaluate the techniques. It is also interesting to remark that blind SR is attractive for real-world scenarios since it is based on the idea that the degradation process is unknown, and hence techniques in this context rely basically on low-resolution (LR) images. In this article, we present a high-scale (8x) controlled experiment which evaluates five recent DL techniques tailored for blind image SR: Adaptive Pseudo Augmentation (APA), Blind Image SR with Spatially Variant Degradations (BlindSR), Deep Alternating Network (DAN), FastGAN, and Mixture of Experts Super-Resolution (MoESR). We consider 14 small datasets from five diffe",
    "link": "http://arxiv.org/abs/2306.09426",
    "context": "Title: Deep learning techniques for blind image super-resolution: A high-scale multi-domain perspective evaluation. (arXiv:2306.09426v1 [eess.IV])\nAbstract: Despite several solutions and experiments have been conducted recently addressing image super-resolution (SR), boosted by deep learning (DL) techniques, they do not usually design evaluations with high scaling factors, capping it at 2x or 4x. Moreover, the datasets are generally benchmarks which do not truly encompass significant diversity of domains to proper evaluate the techniques. It is also interesting to remark that blind SR is attractive for real-world scenarios since it is based on the idea that the degradation process is unknown, and hence techniques in this context rely basically on low-resolution (LR) images. In this article, we present a high-scale (8x) controlled experiment which evaluates five recent DL techniques tailored for blind image SR: Adaptive Pseudo Augmentation (APA), Blind Image SR with Spatially Variant Degradations (BlindSR), Deep Alternating Network (DAN), FastGAN, and Mixture of Experts Super-Resolution (MoESR). We consider 14 small datasets from five diffe",
    "path": "papers/23/06/2306.09426.json",
    "total_tokens": 1183,
    "translated_title": "盲目图像超分辨率的深度学习技术：高规模多领域视角评估",
    "translated_abstract": "尽管最近已经进行了几项解决图像超分辨率的解决方案和实验，这些方案和实验通常不会设计出高比例尺度，仅限于2倍或4倍。此外，数据集通常是基准测试集，不能真正涵盖多种领域的显著多样性以正确评估技术。还值得注意的是，盲目的SR对于真实世界的情景很有吸引力，因为它是基于降级过程是未知的想法，因此在这种情况下的技术基本上依赖于低分辨率（LR）图像。本文介绍了一个高比例尺度（8x）的受控实验，评估了五种最近专为盲目图像SR量身定制的DL技术：自适应伪增强（APA）、具有空间变化劣化的盲SR（BlindSR）、深度交替网络（DAN）、FastGAN和专家超分辨率混合（MoESR）。我们考虑了来自五个不同领域的14个小型数据集，包括医学、自然、城市和艺术图像。我们的结果表明，BlindSR在性能和计算成本之间取得了最好的平衡，而APA在最少的复杂性下获得了显著的性能，是在不需要实时计算的应用程序的良好选择。",
    "tldr": "本文介绍了五种深度学习技术，通过对14个来自不同领域的小型数据集进行高比例尺度（8x）的控制实验，评估了这些技术在盲目图像超分辨率方面的效果，其中BlindSR取得了最佳的性能和计算成本之间的平衡，而APA在性能和复杂性之间取得了显著的性能，是在不需要实时计算的应用程序的良好选择。"
}