{
    "title": "Towards quantum enhanced adversarial robustness in machine learning. (arXiv:2306.12688v1 [quant-ph])",
    "abstract": "Machine learning algorithms are powerful tools for data driven tasks such as image classification and feature detection, however their vulnerability to adversarial examples - input samples manipulated to fool the algorithm remains a serious challenge. The integration of machine learning with quantum computing has the potential to yield tools offering not only better accuracy and computational efficiency, but also superior robustness against adversarial attacks. Indeed, recent work has employed quantum mechanical phenomena to defend against adversarial attacks, spurring the rapid development of the field of quantum adversarial machine learning (QAML) and potentially yielding a new source of quantum advantage. Despite promising early results, there remain challenges towards building robust real-world QAML tools. In this review we discuss recent progress in QAML and identify key challenges. We also suggest future research directions which could determine the route to practicality for QA",
    "link": "http://arxiv.org/abs/2306.12688",
    "context": "Title: Towards quantum enhanced adversarial robustness in machine learning. (arXiv:2306.12688v1 [quant-ph])\nAbstract: Machine learning algorithms are powerful tools for data driven tasks such as image classification and feature detection, however their vulnerability to adversarial examples - input samples manipulated to fool the algorithm remains a serious challenge. The integration of machine learning with quantum computing has the potential to yield tools offering not only better accuracy and computational efficiency, but also superior robustness against adversarial attacks. Indeed, recent work has employed quantum mechanical phenomena to defend against adversarial attacks, spurring the rapid development of the field of quantum adversarial machine learning (QAML) and potentially yielding a new source of quantum advantage. Despite promising early results, there remain challenges towards building robust real-world QAML tools. In this review we discuss recent progress in QAML and identify key challenges. We also suggest future research directions which could determine the route to practicality for QA",
    "path": "papers/23/06/2306.12688.json",
    "total_tokens": 946,
    "translated_title": "量子增强机器学习中的对抗鲁棒性研究",
    "translated_abstract": "机器学习算法是进行图像分类和特征检测等数据驱动任务的强大工具，然而它们对于对抗性样本的脆弱性——即对于被篡改以欺骗算法的输入样本——仍然是一个严峻的挑战。将机器学习与量子计算相结合，有可能提供不仅更好的准确性和计算效率，而且还能够在对抗性攻击方面具有优越的鲁棒性的工具。确实，最近的工作利用了量子机械现象来防御对抗性攻击，推动了量子对抗机器学习（QAML）领域的快速发展，并可能产生新的量子优势来源。尽管有着有希望的初步结果，但在构建稳健的实际QAML工具方面仍然存在挑战。在本综述中，我们讨论了QAML的最新进展，并确定了关键挑战。同时，我们还提出了可能确定实现QA ML路线的未来研究方向。",
    "tldr": "本文讨论了将量子计算与机器学习相结合的新领域，即量子对抗机器学习，它有望提供更好的准确性，更高的计算效率和更强的对抗攻击鲁棒性。但在实现稳健的实际QAML工具方面仍存在挑战。",
    "en_tdlr": "This paper discusses a new field that combines quantum computing with machine learning, namely quantum adversarial machine learning. It has the potential to provide better accuracy, higher computational efficiency, and stronger adversarial attack robustness. However, there are still challenges to be overcome in building robust practical QAML tools."
}