{
    "title": "Recent applications of machine learning, remote sensing, and iot approaches in yield prediction: a critical review. (arXiv:2306.04566v1 [cs.LG])",
    "abstract": "The integration of remote sensing and machine learning in agriculture is transforming the industry by providing insights and predictions through data analysis. This combination leads to improved yield prediction and water management, resulting in increased efficiency, better yields, and more sustainable agricultural practices. Achieving the United Nations' Sustainable Development Goals, especially \"zero hunger,\" requires the investigation of crop yield and precipitation gaps, which can be accomplished through, the usage of artificial intelligence (AI), machine learning (ML), remote sensing (RS), and the internet of things (IoT). By integrating these technologies, a robust agricultural mobile or web application can be developed, providing farmers and decision-makers with valuable information and tools for improving crop management and increasing efficiency. Several studies have investigated these new technologies and their potential for diverse tasks such as crop monitoring, yield predi",
    "link": "http://arxiv.org/abs/2306.04566",
    "context": "Title: Recent applications of machine learning, remote sensing, and iot approaches in yield prediction: a critical review. (arXiv:2306.04566v1 [cs.LG])\nAbstract: The integration of remote sensing and machine learning in agriculture is transforming the industry by providing insights and predictions through data analysis. This combination leads to improved yield prediction and water management, resulting in increased efficiency, better yields, and more sustainable agricultural practices. Achieving the United Nations' Sustainable Development Goals, especially \"zero hunger,\" requires the investigation of crop yield and precipitation gaps, which can be accomplished through, the usage of artificial intelligence (AI), machine learning (ML), remote sensing (RS), and the internet of things (IoT). By integrating these technologies, a robust agricultural mobile or web application can be developed, providing farmers and decision-makers with valuable information and tools for improving crop management and increasing efficiency. Several studies have investigated these new technologies and their potential for diverse tasks such as crop monitoring, yield predi",
    "path": "papers/23/06/2306.04566.json",
    "total_tokens": 805,
    "translated_title": "农业中机器学习、遥感和物联网方法在产量预测方面的应用：一次重要的回顾",
    "translated_abstract": "遥感和机器学习在农业中的整合通过数据分析提供了洞察和预测，正在改变行业。这种结合导致了改善产量预测和水管理，从而实现了提高效率、获得更好的产量和更可持续的农业实践。通过整合这些技术，可以开发一个强大的农业移动或Web应用程序，为农民和决策者提供有价值的信息和工具，以改善作物管理和提高效率。本文对机器学习、遥感和物联网方法在产量预测方面的最新应用进行了重要的回顾。",
    "tldr": "综述了机器学习、遥感和物联网方法在农业中的应用，这些技术的整合为农业提供了洞察和预测，提高了农业生产效率和可持续性。",
    "en_tdlr": "A critical review of recent applications of machine learning, remote sensing, and IoT approaches in yield prediction in agriculture, highlighting the importance of integrating these technologies for improved insights and predictions, increased efficiency, and more sustainable practices."
}