{
    "title": "Counterfactual Explanations and Predictive Models to Enhance Clinical Decision-Making in Schizophrenia using Digital Phenotyping. (arXiv:2306.03980v1 [cs.AI])",
    "abstract": "Clinical practice in psychiatry is burdened with the increased demand for healthcare services and the scarce resources available. New paradigms of health data powered with machine learning techniques could open the possibility to improve clinical workflow in critical stages of clinical assessment and treatment in psychiatry. In this work, we propose a machine learning system capable of predicting, detecting, and explaining individual changes in symptoms of patients with Schizophrenia by using behavioral digital phenotyping data. We forecast symptoms of patients with an error rate below 10%. The system detects decreases in symptoms using changepoint algorithms and uses counterfactual explanations as a recourse in a simulated continuous monitoring scenario in healthcare. Overall, this study offers valuable insights into the performance and potential of counterfactual explanations, predictive models, and change-point detection within a simulated clinical workflow. These findings lay the f",
    "link": "http://arxiv.org/abs/2306.03980",
    "context": "Title: Counterfactual Explanations and Predictive Models to Enhance Clinical Decision-Making in Schizophrenia using Digital Phenotyping. (arXiv:2306.03980v1 [cs.AI])\nAbstract: Clinical practice in psychiatry is burdened with the increased demand for healthcare services and the scarce resources available. New paradigms of health data powered with machine learning techniques could open the possibility to improve clinical workflow in critical stages of clinical assessment and treatment in psychiatry. In this work, we propose a machine learning system capable of predicting, detecting, and explaining individual changes in symptoms of patients with Schizophrenia by using behavioral digital phenotyping data. We forecast symptoms of patients with an error rate below 10%. The system detects decreases in symptoms using changepoint algorithms and uses counterfactual explanations as a recourse in a simulated continuous monitoring scenario in healthcare. Overall, this study offers valuable insights into the performance and potential of counterfactual explanations, predictive models, and change-point detection within a simulated clinical workflow. These findings lay the f",
    "path": "papers/23/06/2306.03980.json",
    "total_tokens": 1120,
    "translated_title": "数字表型在精神病学临床决策中的应用——基于对病例的预测和解释",
    "translated_abstract": "精神病学的临床实践常面临卫生服务需求的增加和医疗资源的稀缺。基于机器学习技术的新型健康数据范例可能会打开精神病学临床评估和治疗关键阶段的工作流改进的可能性。本研究提出了一个机器学习系统，利用行为数字表型数据预测、检测和解释患有精神分裂症症状变化的个体情况。我们的系统误差率低于10%。系统利用变点检测算法检测症状下降，并在模拟的连续监控场景中使用因果解释功能作为一种补救措施。这项研究从模拟临床流程的角度提供了有关因果解释、预测模型和变点检测性能和潜力的有价值的见解。本研究得出以下结论：数字表型与机器学习相结合可以帮助改进精神病学临床决策；所提出的机器学习系统可以高精度地预测和检测病例个体症状变化；因果解释在模拟的连续监控场景中是一种有价值的工具。",
    "tldr": "本研究提出了一个数字表型和机器学习相结合的机器学习系统，通过预测、检测和因果解释患有精神分裂症症状变化的个体情况，可能帮助改进精神病学临床决策，系统误差率低于10%。",
    "en_tdlr": "This study proposes a machine learning system that combines digital phenotyping and machine learning to predict, detect, and provide counterfactual explanations for individual changes in symptoms of patients with Schizophrenia, which may help improve clinical decision-making in psychiatry with an error rate below 10%."
}