{
    "title": "Augmenting Control over Exploration Space in Molecular Dynamics Simulators to Streamline De Novo Analysis through Generative Control Policies. (arXiv:2306.14705v2 [cs.LG] UPDATED)",
    "abstract": "This study introduces the P5 model - a foundational method that utilizes reinforcement learning (RL) to augment control, effectiveness, and scalability in molecular dynamics simulations (MD). Our innovative strategy optimizes the sampling of target polymer chain conformations, marking an efficiency improvement of over 37.1%. The RL-induced control policies function as an inductive bias, modulating Brownian forces to steer the system towards the preferred state, thereby expanding the exploration of the configuration space beyond what traditional MD allows. This broadened exploration generates a more varied set of conformations and targets specific properties, a feature pivotal for progress in polymer development, drug discovery, and material design. Our technique offers significant advantages when investigating new systems with limited prior knowledge, opening up new methodologies for tackling complex simulation problems with generative techniques.",
    "link": "http://arxiv.org/abs/2306.14705",
    "context": "Title: Augmenting Control over Exploration Space in Molecular Dynamics Simulators to Streamline De Novo Analysis through Generative Control Policies. (arXiv:2306.14705v2 [cs.LG] UPDATED)\nAbstract: This study introduces the P5 model - a foundational method that utilizes reinforcement learning (RL) to augment control, effectiveness, and scalability in molecular dynamics simulations (MD). Our innovative strategy optimizes the sampling of target polymer chain conformations, marking an efficiency improvement of over 37.1%. The RL-induced control policies function as an inductive bias, modulating Brownian forces to steer the system towards the preferred state, thereby expanding the exploration of the configuration space beyond what traditional MD allows. This broadened exploration generates a more varied set of conformations and targets specific properties, a feature pivotal for progress in polymer development, drug discovery, and material design. Our technique offers significant advantages when investigating new systems with limited prior knowledge, opening up new methodologies for tackling complex simulation problems with generative techniques.",
    "path": "papers/23/06/2306.14705.json",
    "total_tokens": 1032,
    "translated_title": "扩大分子动力学模拟器探索空间的控制以通过生成控制策略简化De Novo分析",
    "translated_abstract": "本研究引入了P5模型，该模型利用强化学习来增强分子动力学模拟中的控制、效率和可扩展性。我们的创新策略优化了目标聚合物链构象的采样，使效率提高了37.1%以上。强化学习引导的控制策略作为归纳偏好，调节布朗力以将系统引导到优选状态，从而扩展了传统分子动力学所允许的配置空间的探索范围。这种扩大的探索生成了更多样化的构象集合，并针对特定特性进行目标化，这对于聚合物开发、药物发现和材料设计的进展至关重要。我们的技术在研究具有有限先验知识的新系统时具有显著优势，为利用生成技术解决复杂的模拟问题开辟了新的方法学。",
    "tldr": "本研究引入了P5模型，利用强化学习增强了分子动力学模拟的控制能力。通过优化目标聚合物链构象的采样，我们实现了超过37.1%的效率提升。强化学习产生的控制策略扩展了传统分子动力学模拟的配置空间的探索范围，生成了更多样化的构象集合，并针对特定特性进行目标化。这一技术在研究新系统时具有显著优势，并为复杂模拟问题的解决提供了新的方法学。"
}