{
    "title": "Dance Generation by Sound Symbolic Words. (arXiv:2306.03646v1 [cs.LG])",
    "abstract": "This study introduces a novel approach to generate dance motions using onomatopoeia as input, with the aim of enhancing creativity and diversity in dance generation. Unlike text and music, onomatopoeia conveys rhythm and meaning through abstract word expressions without constraints on expression and without need for specialized knowledge. We adapt the AI Choreographer framework and employ the Sakamoto system, a feature extraction method for onomatopoeia focusing on phonemes and syllables. Additionally, we present a new dataset of 40 onomatopoeia-dance motion pairs collected through a user survey. Our results demonstrate that the proposed method enables more intuitive dance generation and can create dance motions using sound-symbolic words from a variety of languages, including those without onomatopoeia. This highlights the potential for diverse dance creation across different languages and cultures, accessible to a wider audience. Qualitative samples from our model can be found at: ht",
    "link": "http://arxiv.org/abs/2306.03646",
    "context": "Title: Dance Generation by Sound Symbolic Words. (arXiv:2306.03646v1 [cs.LG])\nAbstract: This study introduces a novel approach to generate dance motions using onomatopoeia as input, with the aim of enhancing creativity and diversity in dance generation. Unlike text and music, onomatopoeia conveys rhythm and meaning through abstract word expressions without constraints on expression and without need for specialized knowledge. We adapt the AI Choreographer framework and employ the Sakamoto system, a feature extraction method for onomatopoeia focusing on phonemes and syllables. Additionally, we present a new dataset of 40 onomatopoeia-dance motion pairs collected through a user survey. Our results demonstrate that the proposed method enables more intuitive dance generation and can create dance motions using sound-symbolic words from a variety of languages, including those without onomatopoeia. This highlights the potential for diverse dance creation across different languages and cultures, accessible to a wider audience. Qualitative samples from our model can be found at: ht",
    "path": "papers/23/06/2306.03646.json",
    "total_tokens": 894,
    "translated_title": "通过声音象征性词语生成舞蹈",
    "translated_abstract": "本研究引入了一种新颖的方法，使用拟声词作为输入来生成舞蹈动作，旨在增强舞蹈生成的创造力和多样性。与文本和音乐不同，拟声词通过抽象的词语表达传达节奏和含义，没有表达的限制，也不需要专业知识。我们改进了AI编舞师框架并使用Sakamoto系统，一种针对音素和音节的拟声词特征提取方法。此外，我们还通过用户调查收集了一个由40个拟声词-舞蹈动作对组成的新数据集。我们的结果表明，所提出的方法能够实现更直观的舞蹈生成，并能够使用来自多种语言的声音象征性词语创建舞蹈动作，包括那些没有拟声词的语言。这突显了跨语言和文化的多样化舞蹈创作的潜力，让更广泛的受众能够接触到。我们模型的定性样本可在以下网址找到：ht",
    "tldr": "本研究提出了一种使用拟声词生成舞蹈的新方法，能够打破语言和文化的限制，使更多人能够接触多样化的舞蹈创作。"
}