{
    "title": "On the Usefulness of Synthetic Tabular Data Generation. (arXiv:2306.15636v1 [cs.LG])",
    "abstract": "Despite recent advances in synthetic data generation, the scientific community still lacks a unified consensus on its usefulness. It is commonly believed that synthetic data can be used for both data exchange and boosting machine learning (ML) training. Privacy-preserving synthetic data generation can accelerate data exchange for downstream tasks, but there is not enough evidence to show how or why synthetic data can boost ML training. In this study, we benchmarked ML performance using synthetic tabular data for four use cases: data sharing, data augmentation, class balancing, and data summarization. We observed marginal improvements for the balancing use case on some datasets. However, we conclude that there is not enough evidence to claim that synthetic tabular data is useful for ML training.",
    "link": "http://arxiv.org/abs/2306.15636",
    "context": "Title: On the Usefulness of Synthetic Tabular Data Generation. (arXiv:2306.15636v1 [cs.LG])\nAbstract: Despite recent advances in synthetic data generation, the scientific community still lacks a unified consensus on its usefulness. It is commonly believed that synthetic data can be used for both data exchange and boosting machine learning (ML) training. Privacy-preserving synthetic data generation can accelerate data exchange for downstream tasks, but there is not enough evidence to show how or why synthetic data can boost ML training. In this study, we benchmarked ML performance using synthetic tabular data for four use cases: data sharing, data augmentation, class balancing, and data summarization. We observed marginal improvements for the balancing use case on some datasets. However, we conclude that there is not enough evidence to claim that synthetic tabular data is useful for ML training.",
    "path": "papers/23/06/2306.15636.json",
    "total_tokens": 778,
    "translated_title": "关于合成表格数据生成的实用性研究",
    "translated_abstract": "尽管合成数据生成方面取得了一些进展，但科学界对其实用性仍缺乏一致的共识。普遍认为，合成数据可以用于数据交换和加强机器学习（ML）训练。隐私保护的合成数据生成可以加速下游任务的数据交换，但目前尚缺乏足够的证据来说明合成数据如何或为何能够提升ML训练。本研究对四种用例使用合成表格数据对ML性能进行了基准测试：数据共享、数据增强、类别平衡和数据汇总。我们观察到在某些数据集上平衡用例有轻微改进。然而，我们得出结论，目前并没有足够的证据来声称合成表格数据对ML训练有用。",
    "tldr": "本研究对合成表格数据在数据共享、数据增强、类别平衡和数据汇总等用例中进行了基准测试，发现合成表格数据对于ML训练的实用性目前尚缺乏足够的证据。",
    "en_tdlr": "This study benchmarked ML performance using synthetic tabular data for four use cases and found that there is not enough evidence to claim the usefulness of synthetic tabular data for ML training."
}