{
    "title": "Controllable Multi-Objective Re-ranking with Policy Hypernetworks. (arXiv:2306.05118v1 [cs.IR])",
    "abstract": "Multi-stage ranking pipelines have become widely used strategies in modern recommender systems, where the final stage aims to return a ranked list of items that balances a number of requirements such as user preference, diversity, novelty etc. Linear scalarization is arguably the most widely used technique to merge multiple requirements into one optimization objective, by summing up the requirements with certain preference weights. Existing final-stage ranking methods often adopt a static model where the preference weights are determined during offline training and kept unchanged during online serving. Whenever a modification of the preference weights is needed, the model has to be re-trained, which is time and resources inefficient. Meanwhile, the most appropriate weights may vary greatly for different groups of targeting users or at different time periods (e.g., during holiday promotions). In this paper, we propose a framework called controllable multi-objective re-ranking (CMR) whic",
    "link": "http://arxiv.org/abs/2306.05118",
    "context": "Title: Controllable Multi-Objective Re-ranking with Policy Hypernetworks. (arXiv:2306.05118v1 [cs.IR])\nAbstract: Multi-stage ranking pipelines have become widely used strategies in modern recommender systems, where the final stage aims to return a ranked list of items that balances a number of requirements such as user preference, diversity, novelty etc. Linear scalarization is arguably the most widely used technique to merge multiple requirements into one optimization objective, by summing up the requirements with certain preference weights. Existing final-stage ranking methods often adopt a static model where the preference weights are determined during offline training and kept unchanged during online serving. Whenever a modification of the preference weights is needed, the model has to be re-trained, which is time and resources inefficient. Meanwhile, the most appropriate weights may vary greatly for different groups of targeting users or at different time periods (e.g., during holiday promotions). In this paper, we propose a framework called controllable multi-objective re-ranking (CMR) whic",
    "path": "papers/23/06/2306.05118.json",
    "total_tokens": 963,
    "translated_title": "用策略超网络的可控多目标再排序",
    "translated_abstract": "多阶段排名管道已成为现代推荐系统中广泛使用的策略，其中最终阶段旨在返回一个排名列表，以平衡用户偏好、多样性、新颖性等多个要求。线性标量化是将多个要求合并为一个优化目标最广泛使用的技术，通过使用一定的偏好权重来总结这些要求。现有的最终阶段排名方法通常采用静态模型，其中偏好权重在离线训练期间确定，并在在线服务期间保持不变。每当需要修改偏好权重时，模型必须重新训练，这是时间和资源上的浪费。同时，不同用户群体或不同时间段（例如，在节日促销期间）的最合适权重可能会有很大的差异。本文提出了一种称为可控多目标再排序（CMR）的框架，该框架使用策略超网络，以使偏好权重在线优化，而不必重新训练模型。所提出的框架具有灵活性和可控性，为推荐系统中的多目标再排序问题提供了有效的解决方案。",
    "tldr": "本文提出一种名为CMR的新框架，用于解决在推荐系统中的多目标再排序问题。该框架使用策略超网络，使得偏好权重可以在线优化，而不用重新训练模型。"
}