{
    "title": "Self-supervised Deep Hyperspectral Inpainting with the Sparsity and Low-Rank Considerations. (arXiv:2306.08128v1 [eess.IV])",
    "abstract": "Hyperspectral images are typically composed of hundreds of narrow and contiguous spectral bands, each containing information about the material composition of the imaged scene. However, these images can be affected by various sources of noise, distortions, or data losses, which can significantly degrade their quality and usefulness. To address these problems, we introduce two novel self-supervised Hyperspectral Images (HSI) inpainting algorithms: Low Rank and Sparsity Constraint Plug-and-Play (LRS-PnP), and its extension LRS-PnP-DIP, which features the strong learning capability, but is still free of external training data. We conduct the stability analysis under some mild assumptions which guarantees the algorithm to converge. It is specifically very helpful for the practical applications. Extensive experiments demonstrate that the proposed solution is able to produce visually and qualitatively superior inpainting results, achieving state-of-the-art performance. The code for reproduci",
    "link": "http://arxiv.org/abs/2306.08128",
    "context": "Title: Self-supervised Deep Hyperspectral Inpainting with the Sparsity and Low-Rank Considerations. (arXiv:2306.08128v1 [eess.IV])\nAbstract: Hyperspectral images are typically composed of hundreds of narrow and contiguous spectral bands, each containing information about the material composition of the imaged scene. However, these images can be affected by various sources of noise, distortions, or data losses, which can significantly degrade their quality and usefulness. To address these problems, we introduce two novel self-supervised Hyperspectral Images (HSI) inpainting algorithms: Low Rank and Sparsity Constraint Plug-and-Play (LRS-PnP), and its extension LRS-PnP-DIP, which features the strong learning capability, but is still free of external training data. We conduct the stability analysis under some mild assumptions which guarantees the algorithm to converge. It is specifically very helpful for the practical applications. Extensive experiments demonstrate that the proposed solution is able to produce visually and qualitatively superior inpainting results, achieving state-of-the-art performance. The code for reproduci",
    "path": "papers/23/06/2306.08128.json",
    "total_tokens": 928,
    "translated_title": "自监督深度高光谱修复算法考虑稀疏性和低秩性",
    "translated_abstract": "高光谱图像通常由数百个窄且连续的光谱波段组成，每个波段包含了被成像场景的物质组成信息。然而，这些图像容易受到多种噪声、失真或数据丢失的影响，导致其质量和实际应用价值显著下降。为了解决这些问题，我们提出了两种新的自监督高光谱图像修复算法：低秩和稀疏约束“插入-播放” (LRS-PnP) 以及其扩展算法 LRS-PnP-DIP。该算法具有强大的学习能力，但仍无需外部训练数据。我们在某些温和假设下进行稳定性分析，保证了算法的收敛性，有助于实际应用。大量实验表明，所提出的解决方案能够产生外观和质量上优于现有方法的修复结果，并达到最先进水平。",
    "tldr": "本论文提出了两种新的自监督高光谱图像修复算法，具有强大的学习能力，且在不需要外部训练数据的情况下有效地解决高光谱图像修复的问题，实验结果也显示其效果优于现有算法。",
    "en_tdlr": "This paper proposes two novel self-supervised hyperspectral image inpainting algorithms with strong learning capability, which are able to effectively solve the problem of hyperspectral image inpainting without requiring external training data, and achieve better results than existing algorithms according to extensive experiments."
}