{
    "title": "The News Delivery Channel Recommendation Based on Granular Neural Network. (arXiv:2306.10022v1 [cs.IR])",
    "abstract": "With the continuous maturation and expansion of neural network technology, deep neural networks have been widely utilized as the fundamental building blocks of deep learning in a variety of applications, including speech recognition, machine translation, image processing, and the creation of recommendation systems. Therefore, many real-world complex problems can be solved by the deep learning techniques. As is known, traditional news recommendation systems mostly employ techniques based on collaborative filtering and deep learning, but the performance of these algorithms is constrained by the sparsity of the data and the scalability of the approaches. In this paper, we propose a recommendation model using granular neural network model to recommend news to appropriate channels by analyzing the properties of news. Specifically, a specified neural network serves as the foundation for the granular neural network that the model is considered to be build. Different information granularities ",
    "link": "http://arxiv.org/abs/2306.10022",
    "context": "Title: The News Delivery Channel Recommendation Based on Granular Neural Network. (arXiv:2306.10022v1 [cs.IR])\nAbstract: With the continuous maturation and expansion of neural network technology, deep neural networks have been widely utilized as the fundamental building blocks of deep learning in a variety of applications, including speech recognition, machine translation, image processing, and the creation of recommendation systems. Therefore, many real-world complex problems can be solved by the deep learning techniques. As is known, traditional news recommendation systems mostly employ techniques based on collaborative filtering and deep learning, but the performance of these algorithms is constrained by the sparsity of the data and the scalability of the approaches. In this paper, we propose a recommendation model using granular neural network model to recommend news to appropriate channels by analyzing the properties of news. Specifically, a specified neural network serves as the foundation for the granular neural network that the model is considered to be build. Different information granularities ",
    "path": "papers/23/06/2306.10022.json",
    "total_tokens": 715,
    "translated_title": "基于粒神经网络的新闻推荐渠道研究",
    "translated_abstract": "随着神经网络技术的不断成熟和扩展，深度神经网络已经被广泛应用于各种应用程序中，包括语音识别、机器翻译、图像处理以及推荐系统的创建。因此，许多复杂的实际问题都可以通过深度学习技术得到解决。本文提出了一种使用粒神经网络模型推荐新闻到适当的渠道的推荐模型，通过分析新闻的特性。具体来说，一种特定的神经网络被认为是粒神经网络建模的基础。",
    "tldr": "本文提出了一种基于粒神经网络的新闻推荐模型，通过分析新闻的特性来推荐适当的渠道。"
}