{
    "title": "Deep Attentive Survival Analysis in Limit Order Books: Estimating Fill Probabilities with Convolutional-Transformers. (arXiv:2306.05479v1 [q-fin.ST])",
    "abstract": "One of the key decisions in execution strategies is the choice between a passive (liquidity providing) or an aggressive (liquidity taking) order to execute a trade in a limit order book (LOB). Essential to this choice is the fill probability of a passive limit order placed in the LOB. This paper proposes a deep learning method to estimate the filltimes of limit orders posted in different levels of the LOB. We develop a novel model for survival analysis that maps time-varying features of the LOB to the distribution of filltimes of limit orders. Our method is based on a convolutional-Transformer encoder and a monotonic neural network decoder. We use proper scoring rules to compare our method with other approaches in survival analysis, and perform an interpretability analysis to understand the informativeness of features used to compute fill probabilities. Our method significantly outperforms those typically used in survival analysis literature. Finally, we carry out a statistical analysi",
    "link": "http://arxiv.org/abs/2306.05479",
    "context": "Title: Deep Attentive Survival Analysis in Limit Order Books: Estimating Fill Probabilities with Convolutional-Transformers. (arXiv:2306.05479v1 [q-fin.ST])\nAbstract: One of the key decisions in execution strategies is the choice between a passive (liquidity providing) or an aggressive (liquidity taking) order to execute a trade in a limit order book (LOB). Essential to this choice is the fill probability of a passive limit order placed in the LOB. This paper proposes a deep learning method to estimate the filltimes of limit orders posted in different levels of the LOB. We develop a novel model for survival analysis that maps time-varying features of the LOB to the distribution of filltimes of limit orders. Our method is based on a convolutional-Transformer encoder and a monotonic neural network decoder. We use proper scoring rules to compare our method with other approaches in survival analysis, and perform an interpretability analysis to understand the informativeness of features used to compute fill probabilities. Our method significantly outperforms those typically used in survival analysis literature. Finally, we carry out a statistical analysi",
    "path": "papers/23/06/2306.05479.json",
    "total_tokens": 920,
    "translated_title": "深度关注生存分析在限价订单上的应用：利用卷积-Transformer估计成交概率(arXiv:2306.05479v1[q-fin.ST])",
    "translated_abstract": "执行策略中的关键决定之一是选择被动（提供流动性）或积极（吸纳流动性）订单以在限价订单簿中执行交易。这取决于放置于限价订单簿中的被动限价订单成交概率。本文提出了深度学习方法来估计放置于限价订单簿中不同层级的限价订单的成交时间。我们开发了一种新的生存分析模型，将限价订单的时变特征映射为其成交时间的分布。我们的方法基于卷积-Transformer编码器和单调神经网络解码器。我们使用适当的评分规则来比较我们的方法与生存分析中的其他方法，并进行可解释性分析以了解用于计算成交概率的特征的信息量。我们的方法在生存分析文献中显著优于通常使用的方法。最后，我们进行了统计分析……（未完整翻译）",
    "tldr": "本文提出了一种基于深度学习的生存分析方法，使用卷积-Transformer估计限价订单簿中放置于不同层级的限价订单的成交时间分布，相比其他方法表现显著优越。"
}