{
    "title": "Leveraging dendritic properties to advance machine learning and neuro-inspired computing. (arXiv:2306.08007v1 [cs.NE])",
    "abstract": "The brain is a remarkably capable and efficient system. It can process and store huge amounts of noisy and unstructured information using minimal energy. In contrast, current artificial intelligence (AI) systems require vast resources for training while still struggling to compete in tasks that are trivial for biological agents. Thus, brain-inspired engineering has emerged as a promising new avenue for designing sustainable, next-generation AI systems. Here, we describe how dendritic mechanisms of biological neurons have inspired innovative solutions for significant AI problems, including credit assignment in multilayer networks, catastrophic forgetting, and high energy consumption. These findings provide exciting alternatives to existing architectures, showing how dendritic research can pave the way for building more powerful and energy-efficient artificial learning systems.",
    "link": "http://arxiv.org/abs/2306.08007",
    "context": "Title: Leveraging dendritic properties to advance machine learning and neuro-inspired computing. (arXiv:2306.08007v1 [cs.NE])\nAbstract: The brain is a remarkably capable and efficient system. It can process and store huge amounts of noisy and unstructured information using minimal energy. In contrast, current artificial intelligence (AI) systems require vast resources for training while still struggling to compete in tasks that are trivial for biological agents. Thus, brain-inspired engineering has emerged as a promising new avenue for designing sustainable, next-generation AI systems. Here, we describe how dendritic mechanisms of biological neurons have inspired innovative solutions for significant AI problems, including credit assignment in multilayer networks, catastrophic forgetting, and high energy consumption. These findings provide exciting alternatives to existing architectures, showing how dendritic research can pave the way for building more powerful and energy-efficient artificial learning systems.",
    "path": "papers/23/06/2306.08007.json",
    "total_tokens": 851,
    "translated_title": "利用树突的特性推进机器学习和神经启发式计算",
    "translated_abstract": "大脑是一个非常能干和高效的系统。它可以使用极少的能量处理和存储大量嘈杂、非结构化的信息。相比之下，当前的人工智能系统需要巨大的资源进行训练，而仍然很难在生物代理器件轻松完成的任务中竞争。因此，脑启发式工程已经成为设计可持续的，新一代人工智能系统的有前途的新途径。在本文中，我们介绍了生物神经元的树突机制如何激发创新的解决方案来解决重要的人工智能问题，包括多层网络中的信用分配、灾难性遗忘和高能耗。这些发现为现有体系结构提供了令人兴奋的替代方案，展示了树突研究如何为构建更强大、更节能的人工学习系统铺平道路。",
    "tldr": "树突机制为AI领域提供了启发性的创新解决方案，包括信用分配、灾难性遗忘和高能耗等问题，为构建更强大、更节能的人工学习系统提供了有前途的新途径。",
    "en_tdlr": "Dendritic mechanisms provide innovative solutions for significant AI problems, including credit assignment in multilayer networks, catastrophic forgetting, and high energy consumption, paving the way for building more powerful and energy-efficient artificial learning systems."
}