{
    "title": "Perspectives in closed-loop supply chains network design considering risk and uncertainty factors. (arXiv:2306.04819v1 [econ.GN])",
    "abstract": "Risk and uncertainty in each stage of CLSC have greatly increased the complexity and reduced process efficiency of the closed-loop networks, impeding the sustainable and resilient development of industries and the circular economy. Recently, increasing interest in academia have been raised on the risk and uncertainty analysis of closed-loop supply chain, yet there is no comprehensive review paper focusing on closed-loop network design considering risk and uncertainty. This paper examines previous research on the domain of closed-loop network design under risk and uncertainties to provide constructive prospects for future study. We selected 106 papers published in the Scopus database from the year 2004 to 2022. We analyse the source of risk and uncertainties of the CLSC network and identified appropriate methods for handling uncertainties in addition to algorithms for solving uncertain CLSCND problems. We also illustrate the evolution of objectives for designing a closed-loop supply cha",
    "link": "http://arxiv.org/abs/2306.04819",
    "context": "Title: Perspectives in closed-loop supply chains network design considering risk and uncertainty factors. (arXiv:2306.04819v1 [econ.GN])\nAbstract: Risk and uncertainty in each stage of CLSC have greatly increased the complexity and reduced process efficiency of the closed-loop networks, impeding the sustainable and resilient development of industries and the circular economy. Recently, increasing interest in academia have been raised on the risk and uncertainty analysis of closed-loop supply chain, yet there is no comprehensive review paper focusing on closed-loop network design considering risk and uncertainty. This paper examines previous research on the domain of closed-loop network design under risk and uncertainties to provide constructive prospects for future study. We selected 106 papers published in the Scopus database from the year 2004 to 2022. We analyse the source of risk and uncertainties of the CLSC network and identified appropriate methods for handling uncertainties in addition to algorithms for solving uncertain CLSCND problems. We also illustrate the evolution of objectives for designing a closed-loop supply cha",
    "path": "papers/23/06/2306.04819.json",
    "total_tokens": 863,
    "translated_title": "考虑风险和不确定性因素的闭环供应链网络设计视角",
    "translated_abstract": "闭环供应链各个阶段的风险和不确定性大大增加了闭环网络的复杂性，并降低了过程效率，阻碍了产业和循环经济的可持续和弹性发展。近年来，学术界对闭环供应链风险和不确定性分析越来越感兴趣，但还没有全面的综述文章，重点关注考虑风险和不确定性的闭环网络设计。本文考察了以前的研究，以风险和不确定性为背景，提供未来研究的建设性前景。我们选择了2004年至2022年在Scopus数据库中发表的106篇论文。我们分析了CLSC网络的风险和不确定性来源，并确定了处理不确定性的适当方法，以及解决不确定性CLSCND问题的算法。我们还阐述了闭环供应链设计目标的演变。",
    "tldr": "本文考察了以前的研究，以风险和不确定性为背景，提供未来研究的建设性前景。通过分析106篇文献，确定了处理不确定性的适当方法，以及解决不确定性CLSCND问题的算法。",
    "en_tdlr": "This paper examines previous research on closed-loop network design under risk and uncertainty, providing constructive prospects for future studies. Through analyzing 106 papers, appropriate methods for handling uncertainties and algorithms for solving uncertain CLSCND problems are identified."
}