{
    "title": "Assigning AI: Seven Approaches for Students, with Prompts. (arXiv:2306.10052v1 [cs.CY])",
    "abstract": "This paper examines the transformative role of Large Language Models (LLMs) in education and their potential as learning tools, despite their inherent risks and limitations. The authors propose seven approaches for utilizing AI in classrooms: AI-tutor, AI-coach, AI-mentor, AI-teammate, AI-tool, AI-simulator, and AI-student, each with distinct pedagogical benefits and risks. The aim is to help students learn with and about AI, with practical strategies designed to mitigate risks such as complacency about the AI's output, errors, and biases. These strategies promote active oversight, critical assessment of AI outputs, and complementarity of AI's capabilities with the students' unique insights. By challenging students to remain the \"human in the loop,\" the authors aim to enhance learning outcomes while ensuring that AI serves as a supportive tool rather than a replacement. The proposed framework offers a guide for educators navigating the integration of AI-assisted learning in classrooms",
    "link": "http://arxiv.org/abs/2306.10052",
    "context": "Title: Assigning AI: Seven Approaches for Students, with Prompts. (arXiv:2306.10052v1 [cs.CY])\nAbstract: This paper examines the transformative role of Large Language Models (LLMs) in education and their potential as learning tools, despite their inherent risks and limitations. The authors propose seven approaches for utilizing AI in classrooms: AI-tutor, AI-coach, AI-mentor, AI-teammate, AI-tool, AI-simulator, and AI-student, each with distinct pedagogical benefits and risks. The aim is to help students learn with and about AI, with practical strategies designed to mitigate risks such as complacency about the AI's output, errors, and biases. These strategies promote active oversight, critical assessment of AI outputs, and complementarity of AI's capabilities with the students' unique insights. By challenging students to remain the \"human in the loop,\" the authors aim to enhance learning outcomes while ensuring that AI serves as a supportive tool rather than a replacement. The proposed framework offers a guide for educators navigating the integration of AI-assisted learning in classrooms",
    "path": "papers/23/06/2306.10052.json",
    "total_tokens": 1016,
    "translated_title": "分配 AI：为学生提供的七种方法和提示。",
    "translated_abstract": "本文探讨了大型语言模型（LLMs）在教育中的变革作用及其作为学习工具的潜力，尽管存在固有的风险和限制。作者提出了七种利用 AI 在课堂上的方法：AI-导师、AI-辅导员、AI-指导员、AI-队友、AI-工具、AI-模拟器和AI-学生，每种方法都有独特的教学益处和风险。旨在帮助学生学习与了解 AI，提供实用的策略来缓解风险，如对 AI 输出的满足感、错误和偏见。这些策略促进主动监督、对 AI 输出的批判性评估，以及利用 AI 的能力与学生独特见解的互补性。通过挑战学生保持“人在环节”，作者旨在提高学习结果，同时确保 AI 作为支持性工具，而非替代品。提出的框架为教育工作者提供了指导，引导其在课堂中整合 AI 辅助学习。",
    "tldr": "提出了七种利用 AI 在课堂上的方法：AI-导师、AI-辅导员、AI-指导员、AI-队友、AI-工具、AI-模拟器和AI-学生。这些策略促进对 AI 输出的批判性评估，以及利用 AI 的能力和学生独特见解的互补性，增强学习结果。此框架为整合 AI 辅助学习提供了指导。",
    "en_tdlr": "Seven approaches for utilizing AI in classrooms: AI-tutor, AI-coach, AI-mentor, AI-teammate, AI-tool, AI-simulator, and AI-student. These strategies promote critical assessment of AI outputs and complementarity of AI's capabilities with students' unique insights, enhancing learning outcomes. This framework offers guidance for integrating AI-assisted learning in classrooms."
}