{
    "title": "SafeDiffuser: Safe Planning with Diffusion Probabilistic Models. (arXiv:2306.00148v1 [cs.LG])",
    "abstract": "Diffusion model-based approaches have shown promise in data-driven planning, but there are no safety guarantees, thus making it hard to be applied for safety-critical applications. To address these challenges, we propose a new method, called SafeDiffuser, to ensure diffusion probabilistic models satisfy specifications by using a class of control barrier functions. The key idea of our approach is to embed the proposed finite-time diffusion invariance into the denoising diffusion procedure, which enables trustworthy diffusion data generation. Moreover, we demonstrate that our finite-time diffusion invariance method through generative models not only maintains generalization performance but also creates robustness in safe data generation. We test our method on a series of safe planning tasks, including maze path generation, legged robot locomotion, and 3D space manipulation, with results showing the advantages of robustness and guarantees over vanilla diffusion models.",
    "link": "http://arxiv.org/abs/2306.00148",
    "context": "Title: SafeDiffuser: Safe Planning with Diffusion Probabilistic Models. (arXiv:2306.00148v1 [cs.LG])\nAbstract: Diffusion model-based approaches have shown promise in data-driven planning, but there are no safety guarantees, thus making it hard to be applied for safety-critical applications. To address these challenges, we propose a new method, called SafeDiffuser, to ensure diffusion probabilistic models satisfy specifications by using a class of control barrier functions. The key idea of our approach is to embed the proposed finite-time diffusion invariance into the denoising diffusion procedure, which enables trustworthy diffusion data generation. Moreover, we demonstrate that our finite-time diffusion invariance method through generative models not only maintains generalization performance but also creates robustness in safe data generation. We test our method on a series of safe planning tasks, including maze path generation, legged robot locomotion, and 3D space manipulation, with results showing the advantages of robustness and guarantees over vanilla diffusion models.",
    "path": "papers/23/06/2306.00148.json",
    "total_tokens": 977,
    "translated_title": "SafeDiffuser：基于扩散概率模型的安全规划",
    "translated_abstract": "基于扩散模型的方法已经在数据驱动的规划中显示出了很好的效果，但是由于缺乏安全保障，因此很难应用于安全关键应用。为了解决这些挑战，我们提出了一种新方法，称为SafeDiffuser，通过使用一类控制障碍函数来确保扩散概率模型满足规格说明。我们方法的关键思想是将所提出的有限时间扩散不变性嵌入到去噪扩散过程中，从而实现可信扩散数据生成。此外，我们证明了我们的有限时间扩散不变性方法通过生成模型不仅维持了通用性能，而且在安全数据生成中也产生出了鲁棒性。我们将我们的方法测试在一系列的安全规划任务中，包括迷宫路径生成、多足机器人动力学和三维空间操作，结果显示了相对于基本的扩散模型，我们方法的优势和保证。",
    "tldr": "SafeDiffuser提出了一种新方法解决扩散概率模型在安全性上的挑战。通过使用一类控制障碍函数，将有限时间扩散不变性嵌入到去噪扩散过程中，实现了可靠的扩散数据生成，并在多个安全规划任务上展示了鲁棒性和保证。",
    "en_tdlr": "SafeDiffuser proposes a new method to solve the safety challenges of diffusion probabilistic models in data-driven planning. The method, called SafeDiffuser, uses a class of control barrier functions and embeds the proposed finite-time diffusion invariance into the denoising diffusion procedure, enabling trustworthy diffusion data generation. The method demonstrates robustness and guarantees compared to vanilla diffusion models in various safe planning tasks, including maze path generation, legged robot locomotion, and 3D space manipulation."
}