{
    "title": "A Metaheuristic-based Machine Learning Approach for Energy Prediction in Mobile App Development. (arXiv:2306.09931v1 [cs.NE])",
    "abstract": "Energy consumption plays a vital role in mobile App development for developers and end-users, and it is considered one of the most crucial factors for purchasing a smartphone. In addition, in terms of sustainability, it is essential to find methods to reduce the energy consumption of mobile devices since the extensive use of billions of smartphones worldwide significantly impacts the environment. Despite the existence of several energy-efficient programming practices in Android, the leading mobile ecosystem, machine learning-based energy prediction algorithms for mobile App development have yet to be reported. Therefore, this paper proposes a histogram-based gradient boosting classification machine (HGBC), boosted by a metaheuristic approach, for energy prediction in mobile App development. Our metaheuristic approach is responsible for two issues. First, it finds redundant and irrelevant features without any noticeable change in performance. Second, it performs a hyper-parameter tuning",
    "link": "http://arxiv.org/abs/2306.09931",
    "context": "Title: A Metaheuristic-based Machine Learning Approach for Energy Prediction in Mobile App Development. (arXiv:2306.09931v1 [cs.NE])\nAbstract: Energy consumption plays a vital role in mobile App development for developers and end-users, and it is considered one of the most crucial factors for purchasing a smartphone. In addition, in terms of sustainability, it is essential to find methods to reduce the energy consumption of mobile devices since the extensive use of billions of smartphones worldwide significantly impacts the environment. Despite the existence of several energy-efficient programming practices in Android, the leading mobile ecosystem, machine learning-based energy prediction algorithms for mobile App development have yet to be reported. Therefore, this paper proposes a histogram-based gradient boosting classification machine (HGBC), boosted by a metaheuristic approach, for energy prediction in mobile App development. Our metaheuristic approach is responsible for two issues. First, it finds redundant and irrelevant features without any noticeable change in performance. Second, it performs a hyper-parameter tuning",
    "path": "papers/23/06/2306.09931.json",
    "total_tokens": 788,
    "translated_title": "基于元启发式机器学习的移动应用开发中能耗预测方法",
    "translated_abstract": "能耗在移动应用开发和使用中扮演着重要的角色，是用户购买智能手机时考虑的最重要因素之一。考虑到可持续发展，必须找到能够降低移动设备能耗的方法，因为全球数十亿部智能手机的广泛使用对环境有着重要影响。本文提出了一种基于元启发式的直方图梯度提升分类机器（HGBC）方法，用于移动应用中能耗的预测。我们的元启发式方法解决了两个问题。首先，它在性能未有显著变化的情况下发现了多余和无关特征；其次，它执行了超参数调优。",
    "tldr": "本文提出了一种基于元启发式机器学习的直方图梯度提升分类机器（HGBC），用于移动应用中能耗的预测，并解决了特征选择和超参数调优两个问题。",
    "en_tdlr": "This paper proposes a histogram-based gradient boosting classification machine (HGBC) boosted by a metaheuristic approach for energy prediction in mobile app development, while addressing feature selection and hyper-parameter tuning."
}