{
    "title": "Trading-off price for data quality to achieve fair online allocation. (arXiv:2306.13440v1 [cs.LG])",
    "abstract": "We consider the problem of online allocation subject to a long-term fairness penalty. Contrary to existing works, however, we do not assume that the decision-maker observes the protected attributes -- which is often unrealistic in practice. Instead they can purchase data that help estimate them from sources of different quality; and hence reduce the fairness penalty at some cost. We model this problem as a multi-armed bandit problem where each arm corresponds to the choice of a data source, coupled with the online allocation problem. We propose an algorithm that jointly solves both problems and show that it has a regret bounded by $\\mathcal{O}(\\sqrt{T})$. A key difficulty is that the rewards received by selecting a source are correlated by the fairness penalty, which leads to a need for randomization (despite a stochastic setting). Our algorithm takes into account contextual information available before the source selection, and can adapt to many different fairness notions. We also sho",
    "link": "http://arxiv.org/abs/2306.13440",
    "context": "Title: Trading-off price for data quality to achieve fair online allocation. (arXiv:2306.13440v1 [cs.LG])\nAbstract: We consider the problem of online allocation subject to a long-term fairness penalty. Contrary to existing works, however, we do not assume that the decision-maker observes the protected attributes -- which is often unrealistic in practice. Instead they can purchase data that help estimate them from sources of different quality; and hence reduce the fairness penalty at some cost. We model this problem as a multi-armed bandit problem where each arm corresponds to the choice of a data source, coupled with the online allocation problem. We propose an algorithm that jointly solves both problems and show that it has a regret bounded by $\\mathcal{O}(\\sqrt{T})$. A key difficulty is that the rewards received by selecting a source are correlated by the fairness penalty, which leads to a need for randomization (despite a stochastic setting). Our algorithm takes into account contextual information available before the source selection, and can adapt to many different fairness notions. We also sho",
    "path": "papers/23/06/2306.13440.json",
    "total_tokens": 955,
    "translated_title": "在数据质量和公平之间权衡价格，实现在线分配公平性",
    "translated_abstract": "本论文探讨了在线分配问题，其中包含了长期的公平惩罚。但与现有的研究不同的是，我们不假设决策者可以观察到受保护的属性——这在实践中经常是不现实的。相反，他们可以购买来自不同质量来源的数据以帮助估计它们，从而以一定的代价减少公平惩罚。我们将这个问题建模为多臂老虎机问题，其中每个臂对应于数据源的选择，同时包含在线分配问题。我们提出了一种算法，同时解决了两个问题，并证明它具有 $\\mathcal{O}(\\sqrt{T})$ 的遗憾界。一个关键困难是选择源所获得的回报由公平惩罚相关，这导致尽管是随机设置，但需要进行随机化。我们的算法考虑到源选择之前可用的上下文信息，并可以适应许多不同的公平概念。我们还展示了我们的算法在实验中的有效性。",
    "tldr": "本文提出了一种多臂老虎机算法，该算法权衡了价格和数据质量，以解决在线分配问题中的公平性，使得对于源的选择，算法可以适应各种公平概念，具有一定的代价可以减少公平惩罚，并且证明了算法具有较小的遗憾界。",
    "en_tdlr": "This paper proposes a multi-armed bandit algorithm that balances price and data quality to achieve fairness in online allocation problems. The algorithm can adapt to various fairness notions and reduce fairness penalty at a cost, with proven low regret bound. Randomization is needed due to correlated rewards and contextual information is taken into account."
}