{
    "title": "Fine-grained Expressivity of Graph Neural Networks. (arXiv:2306.03698v2 [cs.LG] UPDATED)",
    "abstract": "Numerous recent works have analyzed the expressive power of message-passing graph neural networks (MPNNs), primarily utilizing combinatorial techniques such as the $1$-dimensional Weisfeiler-Leman test ($1$-WL) for the graph isomorphism problem. However, the graph isomorphism objective is inherently binary, not giving insights into the degree of similarity between two given graphs. This work resolves this issue by considering continuous extensions of both $1$-WL and MPNNs to graphons. Concretely, we show that the continuous variant of $1$-WL delivers an accurate topological characterization of the expressive power of MPNNs on graphons, revealing which graphs these networks can distinguish and the level of difficulty in separating them. We identify the finest topology where MPNNs separate points and prove a universal approximation theorem. Consequently, we provide a theoretical framework for graph and graphon similarity combining various topological variants of classical characterizatio",
    "link": "http://arxiv.org/abs/2306.03698",
    "context": "Title: Fine-grained Expressivity of Graph Neural Networks. (arXiv:2306.03698v2 [cs.LG] UPDATED)\nAbstract: Numerous recent works have analyzed the expressive power of message-passing graph neural networks (MPNNs), primarily utilizing combinatorial techniques such as the $1$-dimensional Weisfeiler-Leman test ($1$-WL) for the graph isomorphism problem. However, the graph isomorphism objective is inherently binary, not giving insights into the degree of similarity between two given graphs. This work resolves this issue by considering continuous extensions of both $1$-WL and MPNNs to graphons. Concretely, we show that the continuous variant of $1$-WL delivers an accurate topological characterization of the expressive power of MPNNs on graphons, revealing which graphs these networks can distinguish and the level of difficulty in separating them. We identify the finest topology where MPNNs separate points and prove a universal approximation theorem. Consequently, we provide a theoretical framework for graph and graphon similarity combining various topological variants of classical characterizatio",
    "path": "papers/23/06/2306.03698.json",
    "total_tokens": 879,
    "translated_title": "图神经网络的细粒度表达能力",
    "translated_abstract": "最近的许多研究分析了消息传递图神经网络（MPNN）的表达能力，主要使用了如图同构问题的1维Weisfeiler-Leman测试（1-WL）等组合技术。然而，图同构目标在本质上是二进制的，不能揭示两个给定图之间的相似程度。本工作通过考虑将1-WL和MPNN连续扩展为graphon来解决这个问题。具体而言，我们展示了连续变量的1-WL对于MPNN在graphon上的表达能力进行了准确的拓扑表征，揭示了这些网络可以区分哪些图以及在区分它们时的难度级别。我们确定了MPNN分离点的最细拓扑，并证明了一个普遍逼近定理。因此，我们提供了一个将各种拓扑变体的经典特征结合起来的图和graphon相似度的理论框架。",
    "tldr": "本研究通过考虑将1-WL和MPNN连续扩展为graphon，并通过准确的拓扑表征揭示了MPNN在图上的表达能力，为图和graphon相似度提供了理论框架。",
    "en_tdlr": "This paper considers the continuous extensions of 1-WL and MPNNs to graphons, and through accurate topological characterization reveals the expressive power of MPNNs on graphs, providing a theoretical framework for graph and graphon similarity."
}