{
    "title": "Integrating Tick-level Data and Periodical Signal for High-frequency Market Making. (arXiv:2306.17179v1 [q-fin.TR])",
    "abstract": "We focus on the problem of market making in high-frequency trading. Market making is a critical function in financial markets that involves providing liquidity by buying and selling assets. However, the increasing complexity of financial markets and the high volume of data generated by tick-level trading makes it challenging to develop effective market making strategies. To address this challenge, we propose a deep reinforcement learning approach that fuses tick-level data with periodic prediction signals to develop a more accurate and robust market making strategy. Our results of market making strategies based on different deep reinforcement learning algorithms under the simulation scenarios and real data experiments in the cryptocurrency markets show that the proposed framework outperforms existing methods in terms of profitability and risk management.",
    "link": "http://arxiv.org/abs/2306.17179",
    "context": "Title: Integrating Tick-level Data and Periodical Signal for High-frequency Market Making. (arXiv:2306.17179v1 [q-fin.TR])\nAbstract: We focus on the problem of market making in high-frequency trading. Market making is a critical function in financial markets that involves providing liquidity by buying and selling assets. However, the increasing complexity of financial markets and the high volume of data generated by tick-level trading makes it challenging to develop effective market making strategies. To address this challenge, we propose a deep reinforcement learning approach that fuses tick-level data with periodic prediction signals to develop a more accurate and robust market making strategy. Our results of market making strategies based on different deep reinforcement learning algorithms under the simulation scenarios and real data experiments in the cryptocurrency markets show that the proposed framework outperforms existing methods in terms of profitability and risk management.",
    "path": "papers/23/06/2306.17179.json",
    "total_tokens": 823,
    "translated_title": "高频市场做市的整合滴策略和周期信号",
    "translated_abstract": "我们关注高频交易中的市场做市问题。市场做市是金融市场中提供流动性的关键功能，涉及通过买卖资产提供流动性。然而，金融市场的日益复杂化和滴级交易所产生的大量数据使得开发有效的市场做市策略具有挑战性。为了应对这一挑战，我们提出了一种深度强化学习方法，将滴级数据与周期预测信号融合，以开发更准确、更稳健的市场做市策略。我们基于不同的深度强化学习算法在模拟场景和加密货币市场的真实数据实验中得到的市场做市策略的结果表明，所提出的框架在盈利能力和风险管理方面优于现有方法。",
    "tldr": "该论文提出了一种融合滴级数据和周期预测信号的深度强化学习方法，用于开发更准确、更稳健的高频市场做市策略。实验证明，该方法在盈利能力和风险管理方面优于现有方法。",
    "en_tdlr": "This paper proposes a deep reinforcement learning approach that combines tick-level data with periodic prediction signals to develop more accurate and robust market making strategies for high-frequency trading. Experimental results show that this approach outperforms existing methods in terms of profitability and risk management."
}