{
    "title": "A novel structured argumentation framework for improved explainability of classification tasks. (arXiv:2306.15500v1 [cs.AI])",
    "abstract": "This paper presents a novel framework for structured argumentation, named extend argumentative decision graph ($xADG$). It is an extension of argumentative decision graphs built upon Dung's abstract argumentation graphs. The $xADG$ framework allows for arguments to use boolean logic operators and multiple premises (supports) within their internal structure, resulting in more concise argumentation graphs that may be easier for users to understand. The study presents a methodology for construction of $xADGs$ and evaluates their size and predictive capacity for classification tasks of varying magnitudes. Resulting $xADGs$ achieved strong (balanced) accuracy, which was accomplished through an input decision tree, while also reducing the average number of supports needed to reach a conclusion. The results further indicated that it is possible to construct plausibly understandable $xADGs$ that outperform other techniques for building $ADGs$ in terms of predictive capacity and overall size. I",
    "link": "http://arxiv.org/abs/2306.15500",
    "context": "Title: A novel structured argumentation framework for improved explainability of classification tasks. (arXiv:2306.15500v1 [cs.AI])\nAbstract: This paper presents a novel framework for structured argumentation, named extend argumentative decision graph ($xADG$). It is an extension of argumentative decision graphs built upon Dung's abstract argumentation graphs. The $xADG$ framework allows for arguments to use boolean logic operators and multiple premises (supports) within their internal structure, resulting in more concise argumentation graphs that may be easier for users to understand. The study presents a methodology for construction of $xADGs$ and evaluates their size and predictive capacity for classification tasks of varying magnitudes. Resulting $xADGs$ achieved strong (balanced) accuracy, which was accomplished through an input decision tree, while also reducing the average number of supports needed to reach a conclusion. The results further indicated that it is possible to construct plausibly understandable $xADGs$ that outperform other techniques for building $ADGs$ in terms of predictive capacity and overall size. I",
    "path": "papers/23/06/2306.15500.json",
    "total_tokens": 865,
    "translated_title": "一种用于改进分类任务可解释性的新型结构化论证框架",
    "translated_abstract": "本文提出了一种名为扩展论证决策图（$xADG$）的新型结构化论证框架。它是基于Dung的抽象论证图构建的论证决策图的拓展。$xADG$框架允许论证使用布尔逻辑运算符和多个前提（支持）在内部结构中，从而得到更简洁的论证图，使用户更容易理解。该研究提出了一种构建$xADG$的方法，并评估了它们在不同规模分类任务中的大小和预测能力。结果显示，得到的$xADG$具有强（平衡的）准确性，这是通过输入决策树实现的，同时还减少了达到结论所需的平均支持数。结果进一步表明，可以构建出在预测能力和总体大小方面优于其他构建$ADG$技术的可理解的$xADG$。",
    "tldr": "本文提出了一种新的结构化论证框架$xADG$，通过使用布尔逻辑运算符和多个支持来构建简洁且可理解的论证图，从而改进了分类任务的可解释性和预测能力。"
}