{
    "title": "Interpretable Anomaly Detection in Cellular Networks by Learning Concepts in Variational Autoencoders. (arXiv:2306.15938v1 [cs.LG])",
    "abstract": "This paper addresses the challenges of detecting anomalies in cellular networks in an interpretable way and proposes a new approach using variational autoencoders (VAEs) that learn interpretable representations of the latent space for each Key Performance Indicator (KPI) in the dataset. This enables the detection of anomalies based on reconstruction loss and Z-scores. We ensure the interpretability of the anomalies via additional information centroids (c) using the K-means algorithm to enhance representation learning. We evaluate the performance of the model by analyzing patterns in the latent dimension for specific KPIs and thereby demonstrate the interpretability and anomalies. The proposed framework offers a faster and autonomous solution for detecting anomalies in cellular networks and showcases the potential of deep learning-based algorithms in handling big data.",
    "link": "http://arxiv.org/abs/2306.15938",
    "context": "Title: Interpretable Anomaly Detection in Cellular Networks by Learning Concepts in Variational Autoencoders. (arXiv:2306.15938v1 [cs.LG])\nAbstract: This paper addresses the challenges of detecting anomalies in cellular networks in an interpretable way and proposes a new approach using variational autoencoders (VAEs) that learn interpretable representations of the latent space for each Key Performance Indicator (KPI) in the dataset. This enables the detection of anomalies based on reconstruction loss and Z-scores. We ensure the interpretability of the anomalies via additional information centroids (c) using the K-means algorithm to enhance representation learning. We evaluate the performance of the model by analyzing patterns in the latent dimension for specific KPIs and thereby demonstrate the interpretability and anomalies. The proposed framework offers a faster and autonomous solution for detecting anomalies in cellular networks and showcases the potential of deep learning-based algorithms in handling big data.",
    "path": "papers/23/06/2306.15938.json",
    "total_tokens": 862,
    "translated_title": "可解释的变分自编码器学习概念在手机网络中的异常检测",
    "translated_abstract": "本文以可解释的方式解决了手机网络中的异常检测挑战，并提出了一种利用变分自编码器(VAEs)学习每个关键性能指标(KPI)的潜在空间的可解释表示的新方法。这使得可以基于重构损失和Z分数来检测异常。我们通过使用K-means算法增强表示学习，通过附加信息中心点(c)确保异常的可解释性。通过分析特定KPI的潜在维度中的模式，我们评估了模型的性能，并展示了其可解释性和异常。该提议的框架为在手机网络中检测异常提供了更快且自主的解决方案，并展示了基于深度学习的算法处理大数据的潜力。",
    "tldr": "本文提出了一种利用变分自编码器学习概念在手机网络中解释异常检测的方法，通过重构损失和Z分数来检测异常，并通过K-means算法增强表示学习，实现了异常的可解释性。该框架为手机网络中的异常检测提供了更快且自主的解决方案，并展示了深度学习算法处理大数据的潜力。",
    "en_tdlr": "This paper proposes an interpretable approach for anomaly detection in cellular networks using variational autoencoders, enabling the detection of anomalies based on reconstruction loss and Z-scores. The framework offers a faster and autonomous solution for detecting anomalies in cellular networks and showcases the potential of deep learning algorithms in handling big data."
}