{
    "title": "RestGPT: Connecting Large Language Models with Real-World RESTful APIs. (arXiv:2306.06624v2 [cs.CL] UPDATED)",
    "abstract": "Tool-augmented large language models (LLMs) have achieved remarkable progress in tackling a broad range of tasks. However, existing methods are mainly restricted to specifically designed tools and fail to fulfill complex instructions, having great limitations when confronted with real-world scenarios. In this paper, we explore a more realistic scenario by connecting LLMs with RESTful APIs, which adhere to the widely adopted REST software architectural style for web service development. To address the practical challenges of tackling complex instructions, we propose RestGPT, which exploits the power of LLMs and conducts a coarse-to-fine online planning mechanism to enhance the abilities of task decomposition and API selection. RestGPT also contains an API executor tailored for calling RESTful APIs, which can meticulously formulate parameters and parse API responses. To fully evaluate the performance of RestGPT, we propose RestBench, a high-quality benchmark which consists of two real-wo",
    "link": "http://arxiv.org/abs/2306.06624",
    "context": "Title: RestGPT: Connecting Large Language Models with Real-World RESTful APIs. (arXiv:2306.06624v2 [cs.CL] UPDATED)\nAbstract: Tool-augmented large language models (LLMs) have achieved remarkable progress in tackling a broad range of tasks. However, existing methods are mainly restricted to specifically designed tools and fail to fulfill complex instructions, having great limitations when confronted with real-world scenarios. In this paper, we explore a more realistic scenario by connecting LLMs with RESTful APIs, which adhere to the widely adopted REST software architectural style for web service development. To address the practical challenges of tackling complex instructions, we propose RestGPT, which exploits the power of LLMs and conducts a coarse-to-fine online planning mechanism to enhance the abilities of task decomposition and API selection. RestGPT also contains an API executor tailored for calling RESTful APIs, which can meticulously formulate parameters and parse API responses. To fully evaluate the performance of RestGPT, we propose RestBench, a high-quality benchmark which consists of two real-wo",
    "path": "papers/23/06/2306.06624.json",
    "total_tokens": 810,
    "translated_title": "RestGPT：将大型语言模型与现实世界的RESTful API连接起来",
    "translated_abstract": "工具增强的大型语言模型在解决广泛任务方面取得了显著进展。然而，现有方法主要局限于特定设计的工具，无法满足复杂指令，在面对现实世界场景时存在很大的限制。本文通过将大型语言模型与符合广泛采用的REST软件架构风格的RESTful API连接起来，探索了更加真实的场景。为了解决处理复杂指令的实际挑战，我们提出了RestGPT，利用大型语言模型的能力并采用粗到精的在线规划机制，以增强任务分解和API选择的能力。RestGPT还包括一个专门用于调用RESTful API的API执行器，可以精确地制定参数和解析API响应。为了全面评估RestGPT的性能，我们提出了RestBench，这是一个由两个现实世界场景组成的高质量基准测试集。",
    "tldr": "RestGPT通过连接大型语言模型与RESTful API，提出了RestGPT以解决现实世界场景中的复杂指令问题，并提供了相应的API执行器。"
}