{
    "title": "Radio Generation Using Generative Adversarial Networks with An Unrolled Design. (arXiv:2306.13893v1 [eess.SP])",
    "abstract": "As a revolutionary generative paradigm of deep learning, generative adversarial networks (GANs) have been widely applied in various fields to synthesize realistic data. However, it is challenging for conventional GANs to synthesize raw signal data, especially in some complex cases. In this paper, we develop a novel GAN framework for radio generation called \"Radio GAN\". Compared to conventional methods, it benefits from three key improvements. The first is learning based on sampling points, which aims to model an underlying sampling distribution of radio signals. The second is an unrolled generator design, combined with an estimated pure signal distribution as a prior, which can greatly reduce learning difficulty and effectively improve learning precision. Finally, we present an energy-constrained optimization algorithm to achieve better training stability and convergence. Experimental results with extensive simulations demonstrate that our proposed GAN framework can effectively learn t",
    "link": "http://arxiv.org/abs/2306.13893",
    "context": "Title: Radio Generation Using Generative Adversarial Networks with An Unrolled Design. (arXiv:2306.13893v1 [eess.SP])\nAbstract: As a revolutionary generative paradigm of deep learning, generative adversarial networks (GANs) have been widely applied in various fields to synthesize realistic data. However, it is challenging for conventional GANs to synthesize raw signal data, especially in some complex cases. In this paper, we develop a novel GAN framework for radio generation called \"Radio GAN\". Compared to conventional methods, it benefits from three key improvements. The first is learning based on sampling points, which aims to model an underlying sampling distribution of radio signals. The second is an unrolled generator design, combined with an estimated pure signal distribution as a prior, which can greatly reduce learning difficulty and effectively improve learning precision. Finally, we present an energy-constrained optimization algorithm to achieve better training stability and convergence. Experimental results with extensive simulations demonstrate that our proposed GAN framework can effectively learn t",
    "path": "papers/23/06/2306.13893.json",
    "total_tokens": 924,
    "translated_abstract": "生成对抗网络（GAN）作为一种革命性的深度学习生成范式，已广泛应用于各种领域以合成逼真的数据。然而，对于传统的GAN，尤其是在一些复杂情况下，合成原始信号数据是具有挑战性的。本文提出一种名为“Radio GAN”的新型GAN框架用于生成无线电信号。与传统方法相比，它有三个关键改进：一是基于采样点的学习，旨在对无线电信号的潜在采样分布进行建模；二是未展开的生成器设计，结合先验的纯信号分布，可以大大降低学习难度并有效提高学习精度；最后，我们提出了一种能量约束的优化算法以实现更好的训练稳定性和收敛性。通过广泛的模拟实验，我们证明了提出的GAN框架可以有效地学习信号分布并生成逼真的无线电信号。",
    "tldr": "本文提出一种名为“Radio GAN”的新型GAN框架，针对无线电信号的生成进行优化。与传统方法相比，它有三个关键改进：一是基于采样点的学习，二是未展开的生成器设计，三是能量约束的优化算法。"
}