{
    "title": "Using Natural Language Processing and Networks to Automate Structured Literature Reviews: An Application to Farmers Climate Change Adaptation. (arXiv:2306.09737v1 [cs.CL])",
    "abstract": "The fast-growing number of research articles makes it problematic for scholars to keep track of the new findings related to their areas of expertise. Furthermore, linking knowledge across disciplines in rapidly developing fields becomes challenging for complex topics like climate change that demand interdisciplinary solutions. At the same time, the rise of Black Box types of text summarization makes it difficult to understand how text relationships are built, let alone relate to existing theories conceptualizing cause-effect relationships and permitting hypothesizing. This work aims to sensibly use Natural Language Processing by extracting variables relations and synthesizing their findings using networks while relating to key concepts dominant in relevant disciplines. As an example, we apply our methodology to the analysis of farmers' adaptation to climate change. For this, we perform a Natural Language Processing analysis of publications returned by Scopus in August 2022. Results sho",
    "link": "http://arxiv.org/abs/2306.09737",
    "context": "Title: Using Natural Language Processing and Networks to Automate Structured Literature Reviews: An Application to Farmers Climate Change Adaptation. (arXiv:2306.09737v1 [cs.CL])\nAbstract: The fast-growing number of research articles makes it problematic for scholars to keep track of the new findings related to their areas of expertise. Furthermore, linking knowledge across disciplines in rapidly developing fields becomes challenging for complex topics like climate change that demand interdisciplinary solutions. At the same time, the rise of Black Box types of text summarization makes it difficult to understand how text relationships are built, let alone relate to existing theories conceptualizing cause-effect relationships and permitting hypothesizing. This work aims to sensibly use Natural Language Processing by extracting variables relations and synthesizing their findings using networks while relating to key concepts dominant in relevant disciplines. As an example, we apply our methodology to the analysis of farmers' adaptation to climate change. For this, we perform a Natural Language Processing analysis of publications returned by Scopus in August 2022. Results sho",
    "path": "papers/23/06/2306.09737.json",
    "total_tokens": 840,
    "translated_title": "使用自然语言处理和网络自动化结构化文献综述：以农民应对气候变化为例",
    "translated_abstract": "随着研究文章数量的增加，学者们很难跟上与自己专业领域相关的新发现。此外，对于需要跨学科解决方案的复杂主题，如气候变化，跨学科研究之间的知识链接也变得具有挑战性。同时，黑匣子类型的文本摘要的兴起使得理解文本关系的建立变得困难，更不用说与已有理论概念化因果关系并进行假设的相关性了。本文旨在合理地利用自然语言处理，通过提取变量关系并使用网络综合其发现，同时与相关学科中占主导地位的关键概念相关联。我们以农民应对气候变化的分析为例。为此，我们对Scopus于2022年8月返回的出版物进行自然语言处理分析。结果展示...",
    "tldr": "本文利用自然语言处理和网络，自动化结构化文献综述，以农民应对气候变化的分析为例，提取变量关系并使用网络综合其发现。",
    "en_tdlr": "This paper uses natural language processing and networks to automate structured literature reviews and applies it to analyze farmers' adaptation to climate change, by extracting variable relations and synthesizing their findings through networks."
}