{
    "title": "Influence Maximization with Fairness at Scale (Extended Version). (arXiv:2306.01587v1 [cs.SI])",
    "abstract": "In this paper, we revisit the problem of influence maximization with fairness, which aims to select k influential nodes to maximise the spread of information in a network, while ensuring that selected sensitive user attributes are fairly affected, i.e., are proportionally similar between the original network and the affected users. Recent studies on this problem focused only on extremely small networks, hence the challenge remains on how to achieve a scalable solution, applicable to networks with millions or billions of nodes. We propose an approach that is based on learning node representations for fair spread from diffusion cascades, instead of the social connectivity s.t. we can deal with very large graphs. We propose two data-driven approaches: (a) fairness-based participant sampling (FPS), and (b) fairness as context (FAC). Spread related user features, such as the probability of diffusing information to others, are derived from the historical information cascades, using a deep ne",
    "link": "http://arxiv.org/abs/2306.01587",
    "context": "Title: Influence Maximization with Fairness at Scale (Extended Version). (arXiv:2306.01587v1 [cs.SI])\nAbstract: In this paper, we revisit the problem of influence maximization with fairness, which aims to select k influential nodes to maximise the spread of information in a network, while ensuring that selected sensitive user attributes are fairly affected, i.e., are proportionally similar between the original network and the affected users. Recent studies on this problem focused only on extremely small networks, hence the challenge remains on how to achieve a scalable solution, applicable to networks with millions or billions of nodes. We propose an approach that is based on learning node representations for fair spread from diffusion cascades, instead of the social connectivity s.t. we can deal with very large graphs. We propose two data-driven approaches: (a) fairness-based participant sampling (FPS), and (b) fairness as context (FAC). Spread related user features, such as the probability of diffusing information to others, are derived from the historical information cascades, using a deep ne",
    "path": "papers/23/06/2306.01587.json",
    "total_tokens": 834,
    "translated_title": "在规模上考虑公平的影响最大化问题（扩展版）",
    "translated_abstract": "本文研究关于影响最大化问题中公平的问题，即在选择k个具有影响力的节点来最大化信息传播的同时，确保所选择节点对敏感用户属性的影响是公平的。最近的研究仅关注于极小的网络，因此关键问题在于如何实现可扩展的解决方案，适用于具有数百万或数十亿节点的网络。我们提出了一种基于学习节点表示的方法来实现公平传播，而不是依赖于社交连接，以便我们可以处理非常大的图形。我们提出了两种数据驱动方法：（a）基于公平的参与者抽样（FPS）和（b）公平作为上下文（FAC）。",
    "tldr": "本文针对影响最大化问题中的公平问题，提出了一种基于学习节点表示的方法来实现公平传播，从而实现可扩展的解决方案，适用于具有数百万或数十亿节点的网络。"
}