{
    "title": "Active-Learning-Driven Surrogate Modeling for Efficient Simulation of Parametric Nonlinear Systems. (arXiv:2306.06174v1 [cs.LG])",
    "abstract": "When repeated evaluations for varying parameter configurations of a high-fidelity physical model are required, surrogate modeling techniques based on model order reduction are desired. In absence of the governing equations describing the dynamics, we need to construct the parametric reduced-order surrogate model in a non-intrusive fashion. In this setting, the usual residual-based error estimate for optimal parameter sampling associated with the reduced basis method is not directly available. Our work provides a non-intrusive optimality criterion to efficiently populate the parameter snapshots, thereby, enabling us to effectively construct a parametric surrogate model. We consider separate parameter-specific proper orthogonal decomposition (POD) subspaces and propose an active-learning-driven surrogate model using kernel-based shallow neural networks, abbreviated as ActLearn-POD-KSNN surrogate model. To demonstrate the validity of our proposed ideas, we present numerical experiments us",
    "link": "http://arxiv.org/abs/2306.06174",
    "context": "Title: Active-Learning-Driven Surrogate Modeling for Efficient Simulation of Parametric Nonlinear Systems. (arXiv:2306.06174v1 [cs.LG])\nAbstract: When repeated evaluations for varying parameter configurations of a high-fidelity physical model are required, surrogate modeling techniques based on model order reduction are desired. In absence of the governing equations describing the dynamics, we need to construct the parametric reduced-order surrogate model in a non-intrusive fashion. In this setting, the usual residual-based error estimate for optimal parameter sampling associated with the reduced basis method is not directly available. Our work provides a non-intrusive optimality criterion to efficiently populate the parameter snapshots, thereby, enabling us to effectively construct a parametric surrogate model. We consider separate parameter-specific proper orthogonal decomposition (POD) subspaces and propose an active-learning-driven surrogate model using kernel-based shallow neural networks, abbreviated as ActLearn-POD-KSNN surrogate model. To demonstrate the validity of our proposed ideas, we present numerical experiments us",
    "path": "papers/23/06/2306.06174.json",
    "total_tokens": 819,
    "translated_title": "基于主动学习的代理建模技术优化参数非线性系统的模拟效率",
    "translated_abstract": "当需要对高保真物理模型的不同参数配置进行重复评估时，基于模型阶段降低的代理建模技术是理想的选择。在缺乏描述动态的控制方程的情况下，我们需要以非侵入式的方式构建参数化降阶代理模型。在这种情况下，传统的基于残差的误差估计与参数采样方法不再适用。本文提出了一种基于主动学习的优化准则来有效地构建代理模型。我们考虑分离参数特定的适当正交分解子空间，并提出了一种使用基于核的浅层神经网络的主动学习驱动代理模型，简称ActLearn-POD-KSNN代理模型。为了证明我们所提出的方法的有效性，我们进行了数值实验。",
    "tldr": "本论文提出了一种基于主动学习的优化准则来有效构建参数化降阶代理模型，称为ActLearn-POD-KSNN代理模型，并通过数值实验验证了其有效性。"
}