{
    "title": "LargeST: A Benchmark Dataset for Large-Scale Traffic Forecasting. (arXiv:2306.08259v1 [cs.LG])",
    "abstract": "Traffic forecasting plays a critical role in smart city initiatives and has experienced significant advancements thanks to the power of deep learning in capturing non-linear patterns of traffic data. However, the promising results achieved on current public datasets may not be applicable to practical scenarios due to limitations within these datasets. First, the limited sizes of them may not reflect the real-world scale of traffic networks. Second, the temporal coverage of these datasets is typically short, posing hurdles in studying long-term patterns and acquiring sufficient samples for training deep models. Third, these datasets often lack adequate metadata for sensors, which compromises the reliability and interpretability of the data. To mitigate these limitations, we introduce the LargeST benchmark dataset. It encompasses a total number of 8,600 sensors with a 5-year time coverage and includes comprehensive metadata. Using LargeST, we perform in-depth data analysis to extract dat",
    "link": "http://arxiv.org/abs/2306.08259",
    "context": "Title: LargeST: A Benchmark Dataset for Large-Scale Traffic Forecasting. (arXiv:2306.08259v1 [cs.LG])\nAbstract: Traffic forecasting plays a critical role in smart city initiatives and has experienced significant advancements thanks to the power of deep learning in capturing non-linear patterns of traffic data. However, the promising results achieved on current public datasets may not be applicable to practical scenarios due to limitations within these datasets. First, the limited sizes of them may not reflect the real-world scale of traffic networks. Second, the temporal coverage of these datasets is typically short, posing hurdles in studying long-term patterns and acquiring sufficient samples for training deep models. Third, these datasets often lack adequate metadata for sensors, which compromises the reliability and interpretability of the data. To mitigate these limitations, we introduce the LargeST benchmark dataset. It encompasses a total number of 8,600 sensors with a 5-year time coverage and includes comprehensive metadata. Using LargeST, we perform in-depth data analysis to extract dat",
    "path": "papers/23/06/2306.08259.json",
    "total_tokens": 776,
    "translated_title": "LargeST: 一个面向大规模交通预测的基准数据集",
    "translated_abstract": "交通预测在智慧城市项目中扮演着至关重要的角色，并通过深度学习捕捉交通数据的非线性模式取得了显著的进展。然而，目前公共数据集上取得的有前途的结果可能不适用于实际场景，因为这些数据集存在局限性。为了解决这些问题，我们引入了一个名为LargeST的基准数据集，包括8600个传感器、覆盖5年时间和包括细致元数据。我们使用LargeST进行深入数据分析并演示了它相对于现有数据集而言是一个更为现实和具有挑战性的交通预测基准。",
    "tldr": "LargeST数据集是一个更为现实和具有挑战性的交通预测基准，包括8600个传感器、覆盖5年时间和包括细致元数据。"
}