{
    "title": "G-invariant diffusion maps. (arXiv:2306.07350v1 [cs.LG])",
    "abstract": "The diffusion maps embedding of data lying on a manifold have shown success in tasks ranging from dimensionality reduction and clustering, to data visualization. In this work, we consider embedding data sets which were sampled from a manifold which is closed under the action of a continuous matrix group. An example of such a data set are images who's planar rotations are arbitrary. The G-invariant graph Laplacian, introduced in a previous work of the authors, admits eigenfunctions in the form of tensor products between the elements of the irreducible unitary representations of the group and eigenvectors of certain matrices. We employ these eigenfunctions to derive diffusion maps that intrinsically account for the group action on the data. In particular, we construct both equivariant and invariant embeddings which can be used naturally to cluster and align the data points. We demonstrate the effectiveness of our construction with simulated data.",
    "link": "http://arxiv.org/abs/2306.07350",
    "context": "Title: G-invariant diffusion maps. (arXiv:2306.07350v1 [cs.LG])\nAbstract: The diffusion maps embedding of data lying on a manifold have shown success in tasks ranging from dimensionality reduction and clustering, to data visualization. In this work, we consider embedding data sets which were sampled from a manifold which is closed under the action of a continuous matrix group. An example of such a data set are images who's planar rotations are arbitrary. The G-invariant graph Laplacian, introduced in a previous work of the authors, admits eigenfunctions in the form of tensor products between the elements of the irreducible unitary representations of the group and eigenvectors of certain matrices. We employ these eigenfunctions to derive diffusion maps that intrinsically account for the group action on the data. In particular, we construct both equivariant and invariant embeddings which can be used naturally to cluster and align the data points. We demonstrate the effectiveness of our construction with simulated data.",
    "path": "papers/23/06/2306.07350.json",
    "total_tokens": 705,
    "translated_title": "G-不变扩散地图",
    "translated_abstract": "数据扩散地图在从降维和聚类到数据可视化等任务中均取得了成功。本研究考虑到从一个连续矩阵群封闭下的流形中采样的数据集，我们构造了既等变又不变的嵌入，这些嵌入可以自然地用于对数据点进行聚类和对齐。我们使用模拟数据证明了我们的构造的有效性。",
    "tldr": "研究构造了针对连续矩阵群封闭下的流形中采样的数据集的G-不变扩散地图，能够实现等变且不变的嵌入，适用于对数据点进行聚类和对齐。",
    "en_tdlr": "This paper proposes G-invariant diffusion maps for data sets sampled from a manifold closed under the action of a continuous matrix group, which intrinsically account for the group action and demonstrate effectiveness in clustering and aligning data points with both equivariant and invariant embeddings."
}