{
    "title": "Bridging the Gap Between Multi-Step and One-Shot Trajectory Prediction via Self-Supervision. (arXiv:2306.03367v1 [cs.RO])",
    "abstract": "Accurate vehicle trajectory prediction is an unsolved problem in autonomous driving with various open research questions. State-of-the-art approaches regress trajectories either in a one-shot or step-wise manner. Although one-shot approaches are usually preferred for their simplicity, they relinquish powerful self-supervision schemes that can be constructed by chaining multiple time-steps. We address this issue by proposing a middle-ground where multiple trajectory segments are chained together. Our proposed Multi-Branch Self-Supervised Predictor receives additional training on new predictions starting at intermediate future segments. In addition, the model 'imagines' the latent context and 'predicts the past' while combining multi-modal trajectories in a tree-like manner. We deliberately keep aspects such as interaction and environment modeling simplistic and nevertheless achieve competitive results on the INTERACTION dataset. Furthermore, we investigate the sparsely explored uncertai",
    "link": "http://arxiv.org/abs/2306.03367",
    "context": "Title: Bridging the Gap Between Multi-Step and One-Shot Trajectory Prediction via Self-Supervision. (arXiv:2306.03367v1 [cs.RO])\nAbstract: Accurate vehicle trajectory prediction is an unsolved problem in autonomous driving with various open research questions. State-of-the-art approaches regress trajectories either in a one-shot or step-wise manner. Although one-shot approaches are usually preferred for their simplicity, they relinquish powerful self-supervision schemes that can be constructed by chaining multiple time-steps. We address this issue by proposing a middle-ground where multiple trajectory segments are chained together. Our proposed Multi-Branch Self-Supervised Predictor receives additional training on new predictions starting at intermediate future segments. In addition, the model 'imagines' the latent context and 'predicts the past' while combining multi-modal trajectories in a tree-like manner. We deliberately keep aspects such as interaction and environment modeling simplistic and nevertheless achieve competitive results on the INTERACTION dataset. Furthermore, we investigate the sparsely explored uncertai",
    "path": "papers/23/06/2306.03367.json",
    "total_tokens": 930,
    "translated_title": "通过自监督方法弥合多步和单步轨迹预测之间的差距",
    "translated_abstract": "准确的车辆轨迹预测是自动驾驶中一个未解决的问题，存在许多开放性的研究问题。现有的方法要么采用一次性预测，要么采用逐步预测的方式进行轨迹回归。虽然一次性方法通常因其简单性而受欢迎，但它们放弃了强大的自监督机制，这种机制可以通过链接多个时间步骤来构建。我们通过提出中间阶段来解决这个问题，其中多个轨迹片段连接在一起。我们提出的多分支自监督预测器在开始新预测的中间未来时间段接收额外的训练。此外，模型通过树状方式组合多模态轨迹，同时“想象”潜在环境，通过“预测过去”进行预测。我们故意保持交互和环境建模等方面的简单性，仍然在INTERACTION数据集上获得了有竞争力的结果。此外，我们对未经充分探索的不确定性进行了研究。",
    "tldr": "本论文通过中间阶段方法，结合多模态轨迹以及自监督机制，解决了多步和单步预测之间的差距，并在INTERACTION数据集上获得有竞争力的结果。",
    "en_tdlr": "This paper proposes a middle-ground approach by chaining multiple trajectory segments and using self-supervision to bridge the gap between one-shot and step-wise trajectory prediction methods. The proposed Multi-Branch Self-Supervised Predictor achieves competitive results on the INTERACTION dataset by combining multi-modal trajectories and incorporating a tree-like structure."
}