{
    "title": "SMC-UDA: Structure-Modal Constraint for Unsupervised Cross-Domain Renal Segmentation. (arXiv:2306.08213v1 [cs.CV])",
    "abstract": "Medical image segmentation based on deep learning often fails when deployed on images from a different domain. The domain adaptation methods aim to solve domain-shift challenges, but still face some problems. The transfer learning methods require annotation on the target domain, and the generative unsupervised domain adaptation (UDA) models ignore domain-specific representations, whose generated quality highly restricts segmentation performance. In this study, we propose a novel Structure-Modal Constrained (SMC) UDA framework based on a discriminative paradigm and introduce edge structure as a bridge between domains. The proposed multi-modal learning backbone distills structure information from image texture to distinguish domain-invariant edge structure. With the structure-constrained self-learning and progressive ROI, our methods segment the kidney by locating the 3D spatial structure of the edge. We evaluated SMC-UDA on public renal segmentation datasets, adapting from the labeled s",
    "link": "http://arxiv.org/abs/2306.08213",
    "context": "Title: SMC-UDA: Structure-Modal Constraint for Unsupervised Cross-Domain Renal Segmentation. (arXiv:2306.08213v1 [cs.CV])\nAbstract: Medical image segmentation based on deep learning often fails when deployed on images from a different domain. The domain adaptation methods aim to solve domain-shift challenges, but still face some problems. The transfer learning methods require annotation on the target domain, and the generative unsupervised domain adaptation (UDA) models ignore domain-specific representations, whose generated quality highly restricts segmentation performance. In this study, we propose a novel Structure-Modal Constrained (SMC) UDA framework based on a discriminative paradigm and introduce edge structure as a bridge between domains. The proposed multi-modal learning backbone distills structure information from image texture to distinguish domain-invariant edge structure. With the structure-constrained self-learning and progressive ROI, our methods segment the kidney by locating the 3D spatial structure of the edge. We evaluated SMC-UDA on public renal segmentation datasets, adapting from the labeled s",
    "path": "papers/23/06/2306.08213.json",
    "total_tokens": 1000,
    "translated_title": "SMC-UDA：结构模态约束的无监督跨领域肾脏分割方法",
    "translated_abstract": "基于深度学习的医学影像分割经常在部署到不同领域的图像时失败。领域适应方法旨在解决领域转移挑战，但仍面临一些问题。迁移学习方法需要在目标领域上进行注释，生成式无监督领域适应（UDA）模型忽略了特定于域的表示，其生成的质量严重限制了分割性能。在本研究中，我们提出了一种新颖的基于判别范式的结构模态约束（SMC）UDA框架，并引入了边缘结构作为跨域的桥梁。所提出的多模态学习骨干从图像纹理中提取结构信息以区分域不变的边缘结构。通过结构约束的自我学习和渐进式ROI，我们的方法通过定位边缘的三维空间结构来分割肾脏。我们在公共肾脏分割数据集上评估了SMC-UDA，从有标签的S数据组适应到不同领域。",
    "tldr": "本文提出了一种基于判别范式的结构模态约束的无监督跨领域肾脏分割方法，通过引入边缘结构来区分域不变的结构信息，并通过结构约束的自我学习和渐进式ROI完成肾脏分割，无需在目标领域上进行注释。",
    "en_tdlr": "This paper proposes a novel discriminative paradigm-based Structure-Modal Constrained Unsupervised Domain Adaptation (SMC-UDA) framework for cross-domain renal segmentation, which distinguishes domain-invariant edge structure through the introduction of edge structure and completes kidney segmentation by locating the 3D spatial structure of the edge through structure-constrained self-learning and progressive ROI without annotation on the target domain."
}