{
    "title": "THiFLY Research at SemEval-2023 Task 7: A Multi-granularity System for CTR-based Textual Entailment and Evidence Retrieval. (arXiv:2306.01245v1 [cs.CL])",
    "abstract": "The NLI4CT task aims to entail hypotheses based on Clinical Trial Reports (CTRs) and retrieve the corresponding evidence supporting the justification. This task poses a significant challenge, as verifying hypotheses in the NLI4CT task requires the integration of multiple pieces of evidence from one or two CTR(s) and the application of diverse levels of reasoning, including textual and numerical. To address these problems, we present a multi-granularity system for CTR-based textual entailment and evidence retrieval in this paper. Specifically, we construct a Multi-granularity Inference Network (MGNet) that exploits sentence-level and token-level encoding to handle both textual entailment and evidence retrieval tasks. Moreover, we enhance the numerical inference capability of the system by leveraging a T5-based model, SciFive, which is pre-trained on the medical corpus. Model ensembling and a joint inference method are further utilized in the system to increase the stability and consiste",
    "link": "http://arxiv.org/abs/2306.01245",
    "context": "Title: THiFLY Research at SemEval-2023 Task 7: A Multi-granularity System for CTR-based Textual Entailment and Evidence Retrieval. (arXiv:2306.01245v1 [cs.CL])\nAbstract: The NLI4CT task aims to entail hypotheses based on Clinical Trial Reports (CTRs) and retrieve the corresponding evidence supporting the justification. This task poses a significant challenge, as verifying hypotheses in the NLI4CT task requires the integration of multiple pieces of evidence from one or two CTR(s) and the application of diverse levels of reasoning, including textual and numerical. To address these problems, we present a multi-granularity system for CTR-based textual entailment and evidence retrieval in this paper. Specifically, we construct a Multi-granularity Inference Network (MGNet) that exploits sentence-level and token-level encoding to handle both textual entailment and evidence retrieval tasks. Moreover, we enhance the numerical inference capability of the system by leveraging a T5-based model, SciFive, which is pre-trained on the medical corpus. Model ensembling and a joint inference method are further utilized in the system to increase the stability and consiste",
    "path": "papers/23/06/2306.01245.json",
    "total_tokens": 1011,
    "translated_title": "SemEval-2023任务7上的THiFLY研究：面向CTR的文本蕴涵和证据检索的多粒度系统",
    "translated_abstract": "NLI4CT任务旨在基于临床试验报告 (CTR) 推断假设，并检索支持证明。该任务具有显著挑战，因为在 NLI4CT 任务中验证假设需要整合来自一个或两个 CTR 的多个证据，并应用不同层次的推理，包括文本和数字。为解决这些问题，本文提出了一个面向CTR的文本蕴涵和证据检索的多粒度系统。具体来说，我们构建了一个多粒度推断网络 (MGNet)，利用句子级和令牌级编码来处理文本蕴涵和证据检索任务。此外，我们利用基于T5的模型SciFive，它在医学语料库上进行了预训练，以增强系统的数值推断能力。模型集成和联合推断方法进一步增加了系统的稳定性和一致性性能。对NLI4CT数据集的实验结果表明，我们的系统与最先进的方法相比实现了竞争性能。",
    "tldr": "本文针对NLI4CT任务，提出了一个面向CTR的文本蕴涵和证据检索的多粒度系统，使用多粒度推断网络(MGNet)和T5模型SciFive，并进行模型集成和联合推断方法以增加系统的稳定性和一致性性能。在NLI4CT数据集上实验结果表现优异。",
    "en_tdlr": "This paper proposes a multi-granularity system for CTR-based textual entailment and evidence retrieval, utilizing MGNet and T5-based model SciFive, along with model ensembling and joint inference method to increase system stability and consistency. Experimental results on NLI4CT dataset show competitive performance compared to state-of-the-art approaches."
}