{
    "title": "Why Deep Models Often cannot Beat Non-deep Counterparts on Molecular Property Prediction?. (arXiv:2306.17702v1 [cs.LG])",
    "abstract": "Molecular property prediction (MPP) is a crucial task in the drug discovery pipeline, which has recently gained considerable attention thanks to advances in deep neural networks. However, recent research has revealed that deep models struggle to beat traditional non-deep ones on MPP. In this study, we benchmark 12 representative models (3 non-deep models and 9 deep models) on 14 molecule datasets. Through the most comprehensive study to date, we make the following key observations: \\textbf{(\\romannumeral 1)} Deep models are generally unable to outperform non-deep ones; \\textbf{(\\romannumeral 2)} The failure of deep models on MPP cannot be solely attributed to the small size of molecular datasets. What matters is the irregular molecule data pattern; \\textbf{(\\romannumeral 3)} In particular, tree models using molecular fingerprints as inputs tend to perform better than other competitors. Furthermore, we conduct extensive empirical investigations into the unique patterns of molecule data ",
    "link": "http://arxiv.org/abs/2306.17702",
    "context": "Title: Why Deep Models Often cannot Beat Non-deep Counterparts on Molecular Property Prediction?. (arXiv:2306.17702v1 [cs.LG])\nAbstract: Molecular property prediction (MPP) is a crucial task in the drug discovery pipeline, which has recently gained considerable attention thanks to advances in deep neural networks. However, recent research has revealed that deep models struggle to beat traditional non-deep ones on MPP. In this study, we benchmark 12 representative models (3 non-deep models and 9 deep models) on 14 molecule datasets. Through the most comprehensive study to date, we make the following key observations: \\textbf{(\\romannumeral 1)} Deep models are generally unable to outperform non-deep ones; \\textbf{(\\romannumeral 2)} The failure of deep models on MPP cannot be solely attributed to the small size of molecular datasets. What matters is the irregular molecule data pattern; \\textbf{(\\romannumeral 3)} In particular, tree models using molecular fingerprints as inputs tend to perform better than other competitors. Furthermore, we conduct extensive empirical investigations into the unique patterns of molecule data ",
    "path": "papers/23/06/2306.17702.json",
    "total_tokens": 998,
    "translated_title": "为什么深度模型在分子属性预测上经常无法打败非深度对手？",
    "translated_abstract": "分子属性预测（MPP）是药物发现流程中的关键任务，最近由于深度神经网络的进展而受到了相当的关注。然而，最新研究表明，在MPP上，深度模型往往难以超过传统的非深度模型。在本研究中，我们对14种分子数据集上的12个代表性模型进行了基准测试（3个非深度模型和9个深度模型）。通过迄今为止最全面的研究，我们得出以下关键观察结果: \\textbf{（罗马数字 1）} 深度模型通常无法超越非深度模型; \\textbf{（罗马数字 2）} 深度模型在MPP上的失败不能仅归因于分子数据集的规模小。重要的是分子数据的不规则模式; \\textbf{（罗马数字 3）} 特别是使用分子指纹作为输入的树模型往往比其他竞争对手表现更好。此外，我们对分子数据的独特模式进行了广泛的实证研究。",
    "tldr": "本研究表明，尽管深度神经网络在分子属性预测任务上已取得进展，但在大多数情况下，它们仍无法击败传统的非深度模型。关键原因在于分子数据的不规则模式，而使用分子指纹作为输入的树模型在这方面表现更好。"
}