{
    "title": "Empowering Counterfactual Reasoning over Graph Neural Networks through Inductivity. (arXiv:2306.04835v1 [cs.LG])",
    "abstract": "Graph neural networks (GNNs) have various practical applications, such as drug discovery, recommendation engines, and chip design. However, GNNs lack transparency as they cannot provide understandable explanations for their predictions. To address this issue, counterfactual reasoning is used. The main goal is to make minimal changes to the input graph of a GNN in order to alter its prediction. While several algorithms have been proposed for counterfactual explanations of GNNs, most of them have two main drawbacks. Firstly, they only consider edge deletions as perturbations. Secondly, the counterfactual explanation models are transductive, meaning they do not generalize to unseen data. In this study, we introduce an inductive algorithm called INDUCE, which overcomes these limitations. By conducting extensive experiments on several datasets, we demonstrate that incorporating edge additions leads to better counterfactual results compared to the existing methods. Moreover, the inductive mo",
    "link": "http://arxiv.org/abs/2306.04835",
    "context": "Title: Empowering Counterfactual Reasoning over Graph Neural Networks through Inductivity. (arXiv:2306.04835v1 [cs.LG])\nAbstract: Graph neural networks (GNNs) have various practical applications, such as drug discovery, recommendation engines, and chip design. However, GNNs lack transparency as they cannot provide understandable explanations for their predictions. To address this issue, counterfactual reasoning is used. The main goal is to make minimal changes to the input graph of a GNN in order to alter its prediction. While several algorithms have been proposed for counterfactual explanations of GNNs, most of them have two main drawbacks. Firstly, they only consider edge deletions as perturbations. Secondly, the counterfactual explanation models are transductive, meaning they do not generalize to unseen data. In this study, we introduce an inductive algorithm called INDUCE, which overcomes these limitations. By conducting extensive experiments on several datasets, we demonstrate that incorporating edge additions leads to better counterfactual results compared to the existing methods. Moreover, the inductive mo",
    "path": "papers/23/06/2306.04835.json",
    "total_tokens": 937,
    "translated_title": "增强图神经网络的反事实推理能力通过归纳性",
    "translated_abstract": "图神经网络（GNN）有多种实际应用，例如药物发现、推荐引擎和芯片设计。但是，GNN缺乏透明度，因为它们无法提供可理解的解释来支持其预测。为了解决这个问题，使用了反事实推理。其主要目标是对GNN的输入图进行最小更改，以改变其预测结果。虽然已经提出了几种算法来解释GNN的反事实结果，但它们大多存在两个主要缺点。首先，它们只考虑边删除作为扰动。其次，反事实解释模型是传导性的，意味着它们不能推广到未见过的数据。在本研究中，我们引入了一种称为INDUCE的归纳算法来克服这些限制。通过在多个数据集上进行广泛的实验，我们证明了包括边添加在内的改进可获得比现有方法更好的反事实结果。此外，归纳模型在未见过的数据上也展现了良好的泛化性。",
    "tldr": "本研究引入了一种归纳算法INDUCE来增强图神经网络的反事实推理能力，改进了现有算法中存在的限制，通过在多个数据集上进行广泛的实验证明了其可行性。",
    "en_tdlr": "This study introduces an inductive algorithm, INDUCE, to enhance the counterfactual reasoning ability of graph neural networks (GNNs) and overcome limitations of existing algorithms. Incorporating edge additions leads to better results and the inductive model shows good generalization on unseen data, as demonstrated through experiments on multiple datasets."
}