{
    "title": "2DeteCT -- A large 2D expandable, trainable, experimental Computed Tomography dataset for machine learning. (arXiv:2306.05907v1 [eess.IV])",
    "abstract": "Recent research in computational imaging largely focuses on developing machine learning (ML) techniques for image reconstruction, which requires large-scale training datasets consisting of measurement data and ground-truth images. However, suitable experimental datasets for X-ray Computed Tomography (CT) are scarce, and methods are often developed and evaluated only on simulated data. We fill this gap by providing the community with a versatile, open 2D fan-beam CT dataset suitable for developing ML techniques for a range of image reconstruction tasks. To acquire it, we designed a sophisticated, semi-automatic scan procedure that utilizes a highly-flexible laboratory X-ray CT setup. A diverse mix of samples with high natural variability in shape and density was scanned slice-by-slice (5000 slices in total) with high angular and spatial resolution and three different beam characteristics: A high-fidelity, a low-dose and a beam-hardening-inflicted mode. In addition, 750 out-of-distributi",
    "link": "http://arxiv.org/abs/2306.05907",
    "context": "Title: 2DeteCT -- A large 2D expandable, trainable, experimental Computed Tomography dataset for machine learning. (arXiv:2306.05907v1 [eess.IV])\nAbstract: Recent research in computational imaging largely focuses on developing machine learning (ML) techniques for image reconstruction, which requires large-scale training datasets consisting of measurement data and ground-truth images. However, suitable experimental datasets for X-ray Computed Tomography (CT) are scarce, and methods are often developed and evaluated only on simulated data. We fill this gap by providing the community with a versatile, open 2D fan-beam CT dataset suitable for developing ML techniques for a range of image reconstruction tasks. To acquire it, we designed a sophisticated, semi-automatic scan procedure that utilizes a highly-flexible laboratory X-ray CT setup. A diverse mix of samples with high natural variability in shape and density was scanned slice-by-slice (5000 slices in total) with high angular and spatial resolution and three different beam characteristics: A high-fidelity, a low-dose and a beam-hardening-inflicted mode. In addition, 750 out-of-distributi",
    "path": "papers/23/06/2306.05907.json",
    "total_tokens": 987,
    "translated_title": "2DeteCT -- 一个大型的可扩展、可训练的二维计算机断层扫描数据集，用于机器学习。",
    "translated_abstract": "最近的计算成像研究主要集中在开发用于图像重建的机器学习技术上，这需要包含测量数据和地面真实图像的大规模训练数据集。然而，用于X射线计算机断层扫描（CT）的适当实验数据集很少，方法通常在模拟数据上开发和评估。我们通过提供一个多功能的、开放的二维扇形束CT数据集来填补这一空白，适用于开发各种图像重建任务的机器学习技术。为了获取此数据集，我们设计了一个复杂的、半自动的扫描程序，利用高度灵活的实验室X射线CT装置。扫描了一个具有高自然变异性的样本混合物，其形状和密度在每个切片上都有所不同（总共5000个切片），具有高角分辨率和空间分辨率，并具有三种不同的光束特征：高逼真度、低剂量和光束硬化。此外，还提供了750个分布外的样本，这些样本可用于测试新的数据增强技术。",
    "tldr": "该论文提供了一个大型、可扩展的二维计算机断层扫描数据集，用于开发各种图像重建任务的机器学习技术，填补了当前X射线计算机断层扫描数据集匮乏的现状。",
    "en_tdlr": "This paper provides a large and expandable 2D computed tomography dataset for developing machine learning techniques for various image reconstruction tasks, filling the current scarcity of suitable experimental datasets for X-ray computed tomography."
}