{
    "title": "Active Ranking of Experts Based on their Performances in Many Tasks. (arXiv:2306.02628v1 [stat.ML])",
    "abstract": "We consider the problem of ranking n experts based on their performances on d tasks. We make a monotonicity assumption stating that for each pair of experts, one outperforms the other on all tasks. We consider the sequential setting where in each round, the learner has access to noisy evaluations of actively chosen pair of expert-task, given the information available up to the actual round. Given a confidence parameter $\\delta$ $\\in$ (0, 1), we provide strategies allowing to recover the correct ranking of experts and develop a bound on the total number of queries made by our algorithm that hold with probability at least 1 -- $\\delta$. We show that our strategy is adaptive to the complexity of the problem (our bounds are instance dependent), and develop matching lower bounds up to a poly-logarithmic factor. Finally, we adapt our strategy to the relaxed problem of best expert identification and provide numerical simulation consistent with our theoretical results.",
    "link": "http://arxiv.org/abs/2306.02628",
    "context": "Title: Active Ranking of Experts Based on their Performances in Many Tasks. (arXiv:2306.02628v1 [stat.ML])\nAbstract: We consider the problem of ranking n experts based on their performances on d tasks. We make a monotonicity assumption stating that for each pair of experts, one outperforms the other on all tasks. We consider the sequential setting where in each round, the learner has access to noisy evaluations of actively chosen pair of expert-task, given the information available up to the actual round. Given a confidence parameter $\\delta$ $\\in$ (0, 1), we provide strategies allowing to recover the correct ranking of experts and develop a bound on the total number of queries made by our algorithm that hold with probability at least 1 -- $\\delta$. We show that our strategy is adaptive to the complexity of the problem (our bounds are instance dependent), and develop matching lower bounds up to a poly-logarithmic factor. Finally, we adapt our strategy to the relaxed problem of best expert identification and provide numerical simulation consistent with our theoretical results.",
    "path": "papers/23/06/2306.02628.json",
    "total_tokens": 925,
    "translated_title": "基于多个任务表现的专家积极排名问题",
    "translated_abstract": "我们考虑基于d个任务的n个专家的表现来排名专家的问题。我们提出了一个单调性假设，即对于每对专家，其中一个在所有任务上表现优于另一个。我们考虑按顺序进行的情况，在每一轮中，学习者都可以访问有噪声的评估，并选择一对专家任务，给出到实际轮次为止可用的信息。给定置信度参数$\\delta$ $\\in$ (0,1)，我们提供策略，允许恢复专家的正确排名，并开发出一个算法在概率至少为1-$\\delta$下保持的查询总数上的界限。我们表明我们的策略对问题的复杂性是自适应的(我们的限制是实例相关的)，并开发出与理论下限相匹配的结果(多对数的因子)。最后，我们将策略适应到最佳专家识别的问题上，并提供与我们的理论结果一致的数值模拟。",
    "tldr": "本文提出了基于多个任务表现的专家积极排名问题及处理方法，通过单调性假设及文章提供的策略在保证置信度的情况下，实现了专家正确排名，且该策略具有自适应性。",
    "en_tdlr": "This paper proposes the problem of ranking experts based on their performances in multiple tasks and provides a strategy that relies on a monotonicity assumption, which ensures the correct ranking of experts. The proposed strategy is adaptive to the complexity of the problem and provides a bound on the number of queries, while also being extended to the problem of identifying the best expert. Numerical simulations are consistent with the theoretical results presented in the paper."
}