{
    "title": "Ambulance Demand Prediction via Convolutional Neural Networks. (arXiv:2306.04994v1 [cs.LG])",
    "abstract": "Minimizing response times is crucial for emergency medical services to reduce patients' waiting times and to increase their survival rates. Many models exist to optimize operational tasks such as ambulance allocation and dispatching. Including accurate demand forecasts in such models can improve operational decision-making. Against this background, we present a novel convolutional neural network (CNN) architecture that transforms time series data into heatmaps to predict ambulance demand. Applying such predictions requires incorporating external features that influence ambulance demands. We contribute to the existing literature by providing a flexible, generic CNN architecture, allowing for the inclusion of external features with varying dimensions. Additionally, we provide a feature selection and hyperparameter optimization framework utilizing Bayesian optimization. We integrate historical ambulance demand and external information such as weather, events, holidays, and time. To show t",
    "link": "http://arxiv.org/abs/2306.04994",
    "context": "Title: Ambulance Demand Prediction via Convolutional Neural Networks. (arXiv:2306.04994v1 [cs.LG])\nAbstract: Minimizing response times is crucial for emergency medical services to reduce patients' waiting times and to increase their survival rates. Many models exist to optimize operational tasks such as ambulance allocation and dispatching. Including accurate demand forecasts in such models can improve operational decision-making. Against this background, we present a novel convolutional neural network (CNN) architecture that transforms time series data into heatmaps to predict ambulance demand. Applying such predictions requires incorporating external features that influence ambulance demands. We contribute to the existing literature by providing a flexible, generic CNN architecture, allowing for the inclusion of external features with varying dimensions. Additionally, we provide a feature selection and hyperparameter optimization framework utilizing Bayesian optimization. We integrate historical ambulance demand and external information such as weather, events, holidays, and time. To show t",
    "path": "papers/23/06/2306.04994.json",
    "total_tokens": 908,
    "translated_title": "通过卷积神经网络预测救护车需求",
    "translated_abstract": "减少响应时间对于紧急医疗服务来说非常重要，可降低患者的等待时间，提高他们的生存率。许多模型可用于优化诸如救护车分配和调度等运营任务。将精确的需求预测包含在此类模型中可提高运营决策制定。在此背景下，我们提出了一种新的卷积神经网络(CNN)体系结构，它将时间序列数据转化为热力图以预测救护车需求。应用这种预测需要纳入影响救护车需求的外部特征。我们通过提供一个灵活的、通用的CNN体系结构，允许包含具有不同尺寸的外部特征，为现有文献做出了贡献。此外，我们提供了一个特征选择和超参数优化框架，利用贝叶斯优化。我们整合历史救护车需求和外部信息，如天气，事件，节日和时间。",
    "tldr": "本研究提出一种新的卷积神经网络(CNN)体系结构，通过将时间序列数据转化为热力图，预测救护车需求。同时采用特征选择和超参数优化框架，结合历史救护车需求和外部信息，如天气、事件、节日和时间。",
    "en_tdlr": "This study proposes a novel CNN architecture that predicts ambulance demand by transforming time series data into heatmaps, and provides a feature selection and hyperparameter optimization framework, integrating historical ambulance demand and external information such as weather, events, holidays, and time."
}