{
    "title": "Information aggregation with delegation of votes. (arXiv:2306.03960v1 [econ.TH])",
    "abstract": "Liquid democracy is a system that combines aspects of direct democracy and representative democracy by allowing voters to either vote directly themselves, or delegate their votes to others. In this paper we study the information aggregation properties of liquid democracy in a setting with heterogeneously informed truth-seeking voters -- who want the election outcome to match an underlying state of the world -- and partisan voters. We establish that liquid democracy admits equilibria which improve welfare and information aggregation over direct and representative democracy when voters' preferences and information precisions are publicly or privately known. Liquid democracy also admits equilibria which do worse than the other two systems. We discuss features of efficient and inefficient equilibria and provide conditions under which voters can more easily coordinate on the efficient equilibria in liquid democracy than the other two systems.",
    "link": "http://arxiv.org/abs/2306.03960",
    "context": "Title: Information aggregation with delegation of votes. (arXiv:2306.03960v1 [econ.TH])\nAbstract: Liquid democracy is a system that combines aspects of direct democracy and representative democracy by allowing voters to either vote directly themselves, or delegate their votes to others. In this paper we study the information aggregation properties of liquid democracy in a setting with heterogeneously informed truth-seeking voters -- who want the election outcome to match an underlying state of the world -- and partisan voters. We establish that liquid democracy admits equilibria which improve welfare and information aggregation over direct and representative democracy when voters' preferences and information precisions are publicly or privately known. Liquid democracy also admits equilibria which do worse than the other two systems. We discuss features of efficient and inefficient equilibria and provide conditions under which voters can more easily coordinate on the efficient equilibria in liquid democracy than the other two systems.",
    "path": "papers/23/06/2306.03960.json",
    "total_tokens": 773,
    "translated_title": "带有投票授权的信息汇总",
    "translated_abstract": "液态民主是一种结合了直接民主和代议制的制度，允许选民直接投票或将其选票委托给他人。本文研究了液态民主在异质信息的情况下的信息聚合特性，即希望选举结果与世界真实状态相匹配的寻求真相的选民和党派选民。我们证明液态民主可提高福利和信息聚合效果，并得到了平衡点，当选民的偏好和信息精度是公开或私人已知的时候。液态民主还存在比其他两种制度更差的平衡点。我们讨论了有效和无效平衡点的特点，并提供了选民更容易在液态民主中协调有效平衡点的条件。",
    "tldr": "研究表明，液态民主可提高福利和信息聚合效果，更易于选民协调有效平衡点，适用于异质信息的情况。",
    "en_tdlr": "This paper studies the information aggregation properties of liquid democracy in a setting with heterogeneously informed truth-seeking voters and partisan voters, and establishes that liquid democracy can improve welfare and information aggregation over other systems, and is easier for voters to coordinate on efficient equilibria in such settings."
}