{
    "title": "Towards Accurate Translation via Semantically Appropriate Application of Lexical Constraints. (arXiv:2306.12089v1 [cs.CL])",
    "abstract": "Lexically-constrained NMT (LNMT) aims to incorporate user-provided terminology into translations. Despite its practical advantages, existing work has not evaluated LNMT models under challenging real-world conditions. In this paper, we focus on two important but under-studied issues that lie in the current evaluation process of LNMT studies. The model needs to cope with challenging lexical constraints that are \"homographs\" or \"unseen\" during training. To this end, we first design a homograph disambiguation module to differentiate the meanings of homographs. Moreover, we propose PLUMCOT, which integrates contextually rich information about unseen lexical constraints from pre-trained language models and strengthens a copy mechanism of the pointer network via direct supervision of a copying score. We also release HOLLY, an evaluation benchmark for assessing the ability of a model to cope with \"homographic\" and \"unseen\" lexical constraints. Experiments on HOLLY and the previous test setup s",
    "link": "http://arxiv.org/abs/2306.12089",
    "context": "Title: Towards Accurate Translation via Semantically Appropriate Application of Lexical Constraints. (arXiv:2306.12089v1 [cs.CL])\nAbstract: Lexically-constrained NMT (LNMT) aims to incorporate user-provided terminology into translations. Despite its practical advantages, existing work has not evaluated LNMT models under challenging real-world conditions. In this paper, we focus on two important but under-studied issues that lie in the current evaluation process of LNMT studies. The model needs to cope with challenging lexical constraints that are \"homographs\" or \"unseen\" during training. To this end, we first design a homograph disambiguation module to differentiate the meanings of homographs. Moreover, we propose PLUMCOT, which integrates contextually rich information about unseen lexical constraints from pre-trained language models and strengthens a copy mechanism of the pointer network via direct supervision of a copying score. We also release HOLLY, an evaluation benchmark for assessing the ability of a model to cope with \"homographic\" and \"unseen\" lexical constraints. Experiments on HOLLY and the previous test setup s",
    "path": "papers/23/06/2306.12089.json",
    "total_tokens": 944,
    "translated_title": "基于语义相关的词法约束在精确翻译中的应用研究",
    "translated_abstract": "词法约束神经机器翻译(LNMT)旨在将用户提供的术语纳入翻译中。尽管具有实用优势，但现有研究并未在具有挑战性的现实条件下评估LNMT模型。本文重点关注当前LNMT研究评估过程中存在的两个重要但鲜有研究的问题。模型需要应对训练过程中未见过的挑战性词汇约束，例如同形异义词。为此，我们首先设计了一个同形异义词消歧模块来区分同形异义词的含义。此外，我们提出了PLUMCOT，它通过使用预训练的语言模型与强化指针网络的复制机制来直接监督复制评分，从而整合了上下文丰富信息。我们还发布了HOLLY，一种评估基准，用于评估模型应对同形异义词及训练中未见词汇限制的能力。实验在HOLLY和之前的测试环境中进行",
    "tldr": "本研究关注基于语义相关的词法约束在翻译中的应用，提出解决同形异义词问题的同形异义词消歧模块和PLUMCOT方法，并提供了评估基准HOLLY。",
    "en_tdlr": "This study focuses on the application of semantically appropriate lexical constraints in translation, proposing a homograph disambiguation module and the PLUMCOT method for tackling the challenge of homographs and unseen lexical constraints. The study also provides the HOLLY benchmark for evaluation."
}