{
    "title": "Neural FIM for learning Fisher Information Metrics from point cloud data. (arXiv:2306.06062v1 [cs.CV])",
    "abstract": "Although data diffusion embeddings are ubiquitous in unsupervised learning and have proven to be a viable technique for uncovering the underlying intrinsic geometry of data, diffusion embeddings are inherently limited due to their discrete nature. To this end, we propose neural FIM, a method for computing the Fisher information metric (FIM) from point cloud data - allowing for a continuous manifold model for the data. Neural FIM creates an extensible metric space from discrete point cloud data such that information from the metric can inform us of manifold characteristics such as volume and geodesics. We demonstrate Neural FIM's utility in selecting parameters for the PHATE visualization method as well as its ability to obtain information pertaining to local volume illuminating branching points and cluster centers embeddings of a toy dataset and two single-cell datasets of IPSC reprogramming and PBMCs (immune cells).",
    "link": "http://arxiv.org/abs/2306.06062",
    "context": "Title: Neural FIM for learning Fisher Information Metrics from point cloud data. (arXiv:2306.06062v1 [cs.CV])\nAbstract: Although data diffusion embeddings are ubiquitous in unsupervised learning and have proven to be a viable technique for uncovering the underlying intrinsic geometry of data, diffusion embeddings are inherently limited due to their discrete nature. To this end, we propose neural FIM, a method for computing the Fisher information metric (FIM) from point cloud data - allowing for a continuous manifold model for the data. Neural FIM creates an extensible metric space from discrete point cloud data such that information from the metric can inform us of manifold characteristics such as volume and geodesics. We demonstrate Neural FIM's utility in selecting parameters for the PHATE visualization method as well as its ability to obtain information pertaining to local volume illuminating branching points and cluster centers embeddings of a toy dataset and two single-cell datasets of IPSC reprogramming and PBMCs (immune cells).",
    "path": "papers/23/06/2306.06062.json",
    "total_tokens": 806,
    "translated_title": "从点云数据中学习Fisher信息矩阵的神经FIM",
    "translated_abstract": "虽然数据扩散嵌入在无监督学习中随处可见，并且已经被证明是揭示数据潜在内在几何的可行技术，但由于其离散性，扩散嵌入固有的局限性。因此，我们提出了神经FIM，一种从点云数据中计算Fisher信息度量（FIM）的方法，允许对数据进行连续流形建模。神经FIM从离散的点云数据中创建可扩展的度量空间，因此从度量中获取的信息可以告诉我们流形的特征，如体积和测地线。我们证明了神经FIM在选择PHATE可视化方法的参数以及在玩具数据集和两个IPSC重编程和PBMCs单细胞数据集的分支点和聚类中心嵌入中获取信息方面的效用。",
    "tldr": "本文提出了神经FIM，一种从点云数据中计算Fisher信息度量（FIM）的方法，可以连续地对数据进行流形建模，从而提高流形特征的描述能力。",
    "en_tdlr": "This paper proposes neural FIM for computing Fisher information metric from point cloud data, which allows for continuous manifold modeling and better description of manifold characteristics."
}