{
    "title": "Unfair Utilities and First Steps Towards Improving Them. (arXiv:2306.00636v1 [stat.ML])",
    "abstract": "Many fairness criteria constrain the policy or choice of predictors. In this work, we propose a different framework for thinking about fairness: Instead of constraining the policy or choice of predictors, we consider which utility a policy is optimizing for. We define value of information fairness and propose to not use utilities that do not satisfy this criterion. We describe how to modify a utility to satisfy this fairness criterion and discuss the consequences this might have on the corresponding optimal policies.",
    "link": "http://arxiv.org/abs/2306.00636",
    "context": "Title: Unfair Utilities and First Steps Towards Improving Them. (arXiv:2306.00636v1 [stat.ML])\nAbstract: Many fairness criteria constrain the policy or choice of predictors. In this work, we propose a different framework for thinking about fairness: Instead of constraining the policy or choice of predictors, we consider which utility a policy is optimizing for. We define value of information fairness and propose to not use utilities that do not satisfy this criterion. We describe how to modify a utility to satisfy this fairness criterion and discuss the consequences this might have on the corresponding optimal policies.",
    "path": "papers/23/06/2306.00636.json",
    "total_tokens": 661,
    "translated_title": "不公平的实用程序及其改进的第一步",
    "translated_abstract": "许多公平标准对政策或预测器的选择进行限制。在这项工作中，我们提出了一个不同的思考公平的框架：我们考虑政策正在优化哪个效用，而不是限制政策或预测器的选择。我们定义了信息价值公平，并建议不使用不满足此标准的实用程序。我们描述了如何修改实用程序以满足这种公平标准，并讨论了这可能对相应的最优政策产生的影响。",
    "tldr": "该论文提出了一个新的公平框架——考虑政策优化哪个效用，定义了信息价值公平，提出不应使用不满足这一标准的实用程序，并探讨了修改实用程序以满足此公平标准可能对最优政策产生的影响。",
    "en_tdlr": "This paper proposes a new framework of fairness by considering the utility which a policy is optimizing for, defines the value of information fairness, proposes to not use utilities that do not satisfy this criterion and discusses the consequences this might have on the corresponding optimal policies."
}