{
    "title": "Variational Positive-incentive Noise: How Noise Benefits Models. (arXiv:2306.07651v1 [cs.LG])",
    "abstract": "A large number of works aim to alleviate the impact of noise due to an underlying conventional assumption of the negative role of noise. However, some existing works show that the assumption does not always hold. In this paper, we investigate how to benefit the classical models by random noise under the framework of Positive-incentive Noise (Pi-Noise). Since the ideal objective of Pi-Noise is intractable, we propose to optimize its variational bound instead, namely variational Pi-Noise (VPN). With the variational inference, a VPN generator implemented by neural networks is designed for enhancing base models and simplifying the inference of base models, without changing the architecture of base models. Benefiting from the independent design of base models and VPN generators, the VPN generator can work with most existing models. From the experiments, it is shown that the proposed VPN generator can improve the base models. It is appealing that the trained variational VPN generator prefers",
    "link": "http://arxiv.org/abs/2306.07651",
    "context": "Title: Variational Positive-incentive Noise: How Noise Benefits Models. (arXiv:2306.07651v1 [cs.LG])\nAbstract: A large number of works aim to alleviate the impact of noise due to an underlying conventional assumption of the negative role of noise. However, some existing works show that the assumption does not always hold. In this paper, we investigate how to benefit the classical models by random noise under the framework of Positive-incentive Noise (Pi-Noise). Since the ideal objective of Pi-Noise is intractable, we propose to optimize its variational bound instead, namely variational Pi-Noise (VPN). With the variational inference, a VPN generator implemented by neural networks is designed for enhancing base models and simplifying the inference of base models, without changing the architecture of base models. Benefiting from the independent design of base models and VPN generators, the VPN generator can work with most existing models. From the experiments, it is shown that the proposed VPN generator can improve the base models. It is appealing that the trained variational VPN generator prefers",
    "path": "papers/23/06/2306.07651.json",
    "total_tokens": 949,
    "translated_title": "变分激励噪声：噪声如何改进模型",
    "translated_abstract": "大量研究旨在减轻由于负面噪声的基本假设而导致的噪声影响。但是，一些现有的研究表明，这种假设并不总是成立的。本文研究了如何在正激励噪声（Pi-Noise）框架下通过随机噪声使经典模型受益。由于Pi-Noise的理想目标是难以实现的，我们提出了对其变分下界进行优化的变分Pi-Noise（VPN），通过变分推断，设计了一个VPN生成器来增强基础模型并简化基础模型的推断，而不改变基础模型的架构。由于基础模型和VPN生成器的独立设计， VPN生成器可以与大多数现有模型一起使用。从实验结果来看，所提出的VPN生成器可以改进基本模型。值得称赞的是，训练有素的变分VPN生成器更喜欢独立密集型噪声。（翻译有删减）",
    "tldr": "本文研究了如何通过正激励噪声框架下的随机噪声使经典模型受益，并提出了变分Pi-Noise，它可以在不改变原始模型结构的情况下增强和简化模型。",
    "en_tdlr": "This paper explores how classical models can benefit from random noise under the framework of Positive-incentive Noise (Pi-Noise) and proposes Variational Pi-Noise (VPN) to optimize its intractable ideal objective. The VPN generator designed via variational inference enhances and simplifies base models without altering their architecture. The proposed VPN generator shows improvement in base models and prefers independent dense noise."
}