{
    "title": "Distributed Online Convex Optimization with Adversarial Constraints: Reduced Cumulative Constraint Violation Bounds under Slater's Condition. (arXiv:2306.00149v1 [math.OC])",
    "abstract": "This paper considers distributed online convex optimization with adversarial constraints. In this setting, a network of agents makes decisions at each round, and then only a portion of the loss function and a coordinate block of the constraint function are privately revealed to each agent. The loss and constraint functions are convex and can vary arbitrarily across rounds. The agents collaborate to minimize network regret and cumulative constraint violation. A novel distributed online algorithm is proposed and it achieves an $\\mathcal{O}(T^{\\max\\{c,1-c\\}})$ network regret bound and an $\\mathcal{O}(T^{1-c/2})$ network cumulative constraint violation bound, where $T$ is the number of rounds and $c\\in(0,1)$ is a user-defined trade-off parameter. When Slater's condition holds (i.e, there is a point that strictly satisfies the inequality constraints), the network cumulative constraint violation bound is reduced to $\\mathcal{O}(T^{1-c})$. Moreover, if the loss functions are strongly convex, ",
    "link": "http://arxiv.org/abs/2306.00149",
    "context": "Title: Distributed Online Convex Optimization with Adversarial Constraints: Reduced Cumulative Constraint Violation Bounds under Slater's Condition. (arXiv:2306.00149v1 [math.OC])\nAbstract: This paper considers distributed online convex optimization with adversarial constraints. In this setting, a network of agents makes decisions at each round, and then only a portion of the loss function and a coordinate block of the constraint function are privately revealed to each agent. The loss and constraint functions are convex and can vary arbitrarily across rounds. The agents collaborate to minimize network regret and cumulative constraint violation. A novel distributed online algorithm is proposed and it achieves an $\\mathcal{O}(T^{\\max\\{c,1-c\\}})$ network regret bound and an $\\mathcal{O}(T^{1-c/2})$ network cumulative constraint violation bound, where $T$ is the number of rounds and $c\\in(0,1)$ is a user-defined trade-off parameter. When Slater's condition holds (i.e, there is a point that strictly satisfies the inequality constraints), the network cumulative constraint violation bound is reduced to $\\mathcal{O}(T^{1-c})$. Moreover, if the loss functions are strongly convex, ",
    "path": "papers/23/06/2306.00149.json",
    "total_tokens": 908,
    "tldr": "本文提出一种具有对抗约束的分布式在线凸优化解算法，达到了累计约束违规较小的结果，在Slater条件下的约束违规进一步降低。"
}