{
    "title": "Transformer-based Multi-Modal Learning for Multi Label Remote Sensing Image Classification. (arXiv:2306.01523v1 [cs.CV])",
    "abstract": "In this paper, we introduce a novel Synchronized Class Token Fusion (SCT Fusion) architecture in the framework of multi-modal multi-label classification (MLC) of remote sensing (RS) images. The proposed architecture leverages modality-specific attention-based transformer encoders to process varying input modalities, while exchanging information across modalities by synchronizing the special class tokens after each transformer encoder block. The synchronization involves fusing the class tokens with a trainable fusion transformation, resulting in a synchronized class token that contains information from all modalities. As the fusion transformation is trainable, it allows to reach an accurate representation of the shared features among different modalities. Experimental results show the effectiveness of the proposed architecture over single-modality architectures and an early fusion multi-modal architecture when evaluated on a multi-modal MLC dataset.  The code of the proposed architectur",
    "link": "http://arxiv.org/abs/2306.01523",
    "context": "Title: Transformer-based Multi-Modal Learning for Multi Label Remote Sensing Image Classification. (arXiv:2306.01523v1 [cs.CV])\nAbstract: In this paper, we introduce a novel Synchronized Class Token Fusion (SCT Fusion) architecture in the framework of multi-modal multi-label classification (MLC) of remote sensing (RS) images. The proposed architecture leverages modality-specific attention-based transformer encoders to process varying input modalities, while exchanging information across modalities by synchronizing the special class tokens after each transformer encoder block. The synchronization involves fusing the class tokens with a trainable fusion transformation, resulting in a synchronized class token that contains information from all modalities. As the fusion transformation is trainable, it allows to reach an accurate representation of the shared features among different modalities. Experimental results show the effectiveness of the proposed architecture over single-modality architectures and an early fusion multi-modal architecture when evaluated on a multi-modal MLC dataset.  The code of the proposed architectur",
    "path": "papers/23/06/2306.01523.json",
    "total_tokens": 822,
    "translated_title": "基于Transformer的多模态学习用于多标签遥感图像分类",
    "translated_abstract": "本文在远程感知图像的多模态多标签分类（MLC）框架下，引入了一种新颖的同步类令牌融合（SCT Fusion）架构。所提出的架构利用模态特定的基于注意力的Transformer编码器来处理不同的输入模态，并在每个Transformer编码器块后通过同步特殊类令牌来跨模态交换信息。同步包括通过可训练的融合变换将类令牌融合，从而产生一个包含所有模态信息的同步类令牌。由于融合变换是可训练的，因此它允许准确表示不同模态之间共享的特征。实验结果表明，在多模态MLC数据集上评估时，所提出的架构比单模态架构和早期融合多模态架构更有效。所提出的架构代码已公开。",
    "tldr": "本文提出了一种基于Transformer的多模态学习架构，能够在远程感知图像的多模态多标签分类中进行有效的信息交换，提高了分类效果。"
}