{
    "title": "Bidirectional GaitNet: A Bidirectional Prediction Model of Human Gait and Anatomical Conditions. (arXiv:2306.04161v1 [cs.GR])",
    "abstract": "We present a novel generative model, called Bidirectional GaitNet, that learns the relationship between human anatomy and its gait. The simulation model of human anatomy is a comprehensive, full-body, simulation-ready, musculoskeletal model with 304 Hill-type musculotendon units. The Bidirectional GaitNet consists of forward and backward models. The forward model predicts a gait pattern of a person with specific physical conditions, while the backward model estimates the physical conditions of a person when his/her gait pattern is provided. Our simulation-based approach first learns the forward model by distilling the simulation data generated by a state-of-the-art predictive gait simulator and then constructs a Variational Autoencoder (VAE) with the learned forward model as its decoder. Once it is learned its encoder serves as the backward model. We demonstrate our model on a variety of healthy/impaired gaits and validate it in comparison with physical examination data of real patient",
    "link": "http://arxiv.org/abs/2306.04161",
    "context": "Title: Bidirectional GaitNet: A Bidirectional Prediction Model of Human Gait and Anatomical Conditions. (arXiv:2306.04161v1 [cs.GR])\nAbstract: We present a novel generative model, called Bidirectional GaitNet, that learns the relationship between human anatomy and its gait. The simulation model of human anatomy is a comprehensive, full-body, simulation-ready, musculoskeletal model with 304 Hill-type musculotendon units. The Bidirectional GaitNet consists of forward and backward models. The forward model predicts a gait pattern of a person with specific physical conditions, while the backward model estimates the physical conditions of a person when his/her gait pattern is provided. Our simulation-based approach first learns the forward model by distilling the simulation data generated by a state-of-the-art predictive gait simulator and then constructs a Variational Autoencoder (VAE) with the learned forward model as its decoder. Once it is learned its encoder serves as the backward model. We demonstrate our model on a variety of healthy/impaired gaits and validate it in comparison with physical examination data of real patient",
    "path": "papers/23/06/2306.04161.json",
    "total_tokens": 892,
    "translated_title": "双向 GaitNet：一种人类步态和解剖情况的双向预测模型",
    "translated_abstract": "我们提出了一种新颖的生成模型，称为双向 GaitNet，它学习了人类解剖结构和步态之间的关系。人体解剖的模拟模型是一个全身的、包含304个Hill类型肌腱单位的肌肉骨骼模型。双向 GaitNet由前向和后向模型组成。前向模型预测具有特定身体状况的人的步态模式，而后向模型估算人的身体状况当其步态模式被提供。我们基于模拟方法首先通过提取由最先进的预测步态模拟器生成的模拟数据来学习前向模型，然后使用学习的前向模型构建变分自动编码器（VAE）。一旦它被学习，它的编码器就作为后向模型。我们展示了我们的模型在多种健康/受损步态上的表现，并与真实患者的体检数据进行验证。",
    "tldr": "双向 GaitNet是一种生成模型，它通过模拟数据和变分自动编码器来预测人类的步态和身体状况，能应用于健康和受损步态的预测和估算。",
    "en_tdlr": "Bidirectional GaitNet is a generative model that predicts human gait and physical conditions using simulation data and a VAE, and can be applied for predicting and estimating healthy and impaired gaits."
}