{
    "title": "I run as fast as a rabbit, can you? A Multilingual Simile Dialogue Dataset. (arXiv:2306.05672v1 [cs.CL])",
    "abstract": "A simile is a figure of speech that compares two different things (called the tenor and the vehicle) via shared properties. The tenor and the vehicle are usually connected with comparator words such as \"like\" or \"as\". The simile phenomena are unique and complex in a real-life dialogue scene where the tenor and the vehicle can be verbal phrases or sentences, mentioned by different speakers, exist in different sentences, or occur in reversed order. However, the current simile research usually focuses on similes in a triplet tuple (tenor, property, vehicle) or a single sentence where the tenor and vehicle are usually entities or noun phrases, which could not reflect complex simile phenomena in real scenarios. In this paper, we propose a novel and high-quality multilingual simile dialogue (MSD) dataset to facilitate the study of complex simile phenomena. The MSD is the largest manually annotated simile data ($\\sim$20K) and it contains both English and Chinese data. Meanwhile, the MSD data ",
    "link": "http://arxiv.org/abs/2306.05672",
    "context": "Title: I run as fast as a rabbit, can you? A Multilingual Simile Dialogue Dataset. (arXiv:2306.05672v1 [cs.CL])\nAbstract: A simile is a figure of speech that compares two different things (called the tenor and the vehicle) via shared properties. The tenor and the vehicle are usually connected with comparator words such as \"like\" or \"as\". The simile phenomena are unique and complex in a real-life dialogue scene where the tenor and the vehicle can be verbal phrases or sentences, mentioned by different speakers, exist in different sentences, or occur in reversed order. However, the current simile research usually focuses on similes in a triplet tuple (tenor, property, vehicle) or a single sentence where the tenor and vehicle are usually entities or noun phrases, which could not reflect complex simile phenomena in real scenarios. In this paper, we propose a novel and high-quality multilingual simile dialogue (MSD) dataset to facilitate the study of complex simile phenomena. The MSD is the largest manually annotated simile data ($\\sim$20K) and it contains both English and Chinese data. Meanwhile, the MSD data ",
    "path": "papers/23/06/2306.05672.json",
    "total_tokens": 927,
    "tldr": "本文提出了一个多语言明喻对话（MSD）数据集，该数据集是最大的手动注释的明喻数据集，包含英语和中文数据，在真实场景中模拟了复杂的明喻现象。"
}