{
    "title": "Enhancing Dialogue Generation via Dynamic Graph Knowledge Aggregation. (arXiv:2306.16195v1 [cs.CL])",
    "abstract": "Incorporating external graph knowledge into neural chatbot models has been proven effective for enhancing dialogue generation. However, in conventional graph neural networks (GNNs), message passing on a graph is independent from text, resulting in the graph representation hidden space differing from that of the text. This training regime of existing models therefore leads to a semantic gap between graph knowledge and text. In this study, we propose a novel framework for knowledge graph enhanced dialogue generation. We dynamically construct a multi-hop knowledge graph with pseudo nodes to involve the language model in feature aggregation within the graph at all steps. To avoid the semantic biases caused by learning on vanilla subgraphs, the proposed framework applies hierarchical graph attention to aggregate graph features on pseudo nodes and then attains a global feature. Therefore, the framework can better utilise the heterogeneous features from both the post and external graph knowle",
    "link": "http://arxiv.org/abs/2306.16195",
    "context": "Title: Enhancing Dialogue Generation via Dynamic Graph Knowledge Aggregation. (arXiv:2306.16195v1 [cs.CL])\nAbstract: Incorporating external graph knowledge into neural chatbot models has been proven effective for enhancing dialogue generation. However, in conventional graph neural networks (GNNs), message passing on a graph is independent from text, resulting in the graph representation hidden space differing from that of the text. This training regime of existing models therefore leads to a semantic gap between graph knowledge and text. In this study, we propose a novel framework for knowledge graph enhanced dialogue generation. We dynamically construct a multi-hop knowledge graph with pseudo nodes to involve the language model in feature aggregation within the graph at all steps. To avoid the semantic biases caused by learning on vanilla subgraphs, the proposed framework applies hierarchical graph attention to aggregate graph features on pseudo nodes and then attains a global feature. Therefore, the framework can better utilise the heterogeneous features from both the post and external graph knowle",
    "path": "papers/23/06/2306.16195.json",
    "total_tokens": 870,
    "translated_title": "通过动态图知识聚合提升对话生成",
    "translated_abstract": "将外部图知识融入神经对话机器人模型已被证明有效提升对话生成。然而，在传统的图神经网络（GNN）中，图上的信息传递与文本无关，导致图表征和文本之间存在语义差异。现有模型的训练方式导致了图知识和文本之间的语义鸿沟。本研究提出了一种新的知识图增强对话生成的框架。我们动态构建一个带有伪节点的多跳知识图，在图中的每一步中都将语言模型纳入特征聚合。为了避免学习在普通子图上引起的语义偏差，所提出的框架应用了分层图注意力，以聚合伪节点上的图特征，最终获得全局特征。因此，该框架能够更好地利用来自帖子和外部图知识的异质特征。",
    "tldr": "本研究提出了一个通过动态图知识聚合来提升对话生成的新框架，它能够更好地利用来自帖子和外部图知识的异质特征，从而解决图知识和文本之间的语义差异问题。",
    "en_tdlr": "This study proposes a novel framework for enhancing dialogue generation through dynamic graph knowledge aggregation. It effectively addresses the semantic gap issue between graph knowledge and text by better utilizing the heterogeneous features from both the post and external graph knowledge."
}