{
    "title": "Speaker Embeddings as Individuality Proxy for Voice Stress Detection. (arXiv:2306.05915v1 [eess.AS])",
    "abstract": "Since the mental states of the speaker modulate speech, stress introduced by cognitive or physical loads could be detected in the voice. The existing voice stress detection benchmark has shown that the audio embeddings extracted from the Hybrid BYOL-S self-supervised model perform well. However, the benchmark only evaluates performance separately on each dataset, but does not evaluate performance across the different types of stress and different languages. Moreover, previous studies found strong individual differences in stress susceptibility. This paper presents the design and development of voice stress detection, trained on more than 100 speakers from 9 language groups and five different types of stress. We address individual variabilities in voice stress analysis by adding speaker embeddings to the hybrid BYOL-S features. The proposed method significantly improves voice stress detection performance with an input audio length of only 3-5 seconds.",
    "link": "http://arxiv.org/abs/2306.05915",
    "context": "Title: Speaker Embeddings as Individuality Proxy for Voice Stress Detection. (arXiv:2306.05915v1 [eess.AS])\nAbstract: Since the mental states of the speaker modulate speech, stress introduced by cognitive or physical loads could be detected in the voice. The existing voice stress detection benchmark has shown that the audio embeddings extracted from the Hybrid BYOL-S self-supervised model perform well. However, the benchmark only evaluates performance separately on each dataset, but does not evaluate performance across the different types of stress and different languages. Moreover, previous studies found strong individual differences in stress susceptibility. This paper presents the design and development of voice stress detection, trained on more than 100 speakers from 9 language groups and five different types of stress. We address individual variabilities in voice stress analysis by adding speaker embeddings to the hybrid BYOL-S features. The proposed method significantly improves voice stress detection performance with an input audio length of only 3-5 seconds.",
    "path": "papers/23/06/2306.05915.json",
    "total_tokens": 770,
    "translated_title": "以说话人嵌入作为语音应激检测的个性代理",
    "translated_abstract": "由于说话人的心理状态调节语音，因此认知或身体负荷引起的应激可以在语音中检测到。该论文提出了一种使用超过100名来自9个语言组和5种不同类型应激的说话人进行训练的语音应激检测的设计和开发。我们通过添加说话人嵌入到混合BYOL-S特征中来解决语音应激分析中的个体差异。该方法显著提高了声音应激检测性能，只需3-5秒的输入音频长度。",
    "tldr": "该论文使用来自不同语言组、背景各异的一百多名说话者训练了一种语音应激检测的方法，并在混合特征中添加个体差异性识别技术，成功地提高了检测性能。",
    "en_tdlr": "This paper presents a voice stress detection method trained on more than 100 speakers from 9 language groups and 5 different types of stress. The proposed method addresses individual variabilities in voice stress analysis by adding speaker embeddings to hybrid features, leading to significant performance improvements with only 3-5 seconds of input audio length."
}