{
    "title": "Characterizing the Emotion Carriers of COVID-19 Misinformation and Their Impact on Vaccination Outcomes in India and the United States. (arXiv:2306.13954v1 [cs.CL])",
    "abstract": "The COVID-19 Infodemic had an unprecedented impact on health behaviors and outcomes at a global scale. While many studies have focused on a qualitative and quantitative understanding of misinformation, including sentiment analysis, there is a gap in understanding the emotion-carriers of misinformation and their differences across geographies. In this study, we characterized emotion carriers and their impact on vaccination rates in India and the United States. A manually labelled dataset was created from 2.3 million tweets and collated with three publicly available datasets (CoAID, AntiVax, CMU) to train deep learning models for misinformation classification. Misinformation labelled tweets were further analyzed for behavioral aspects by leveraging Plutchik Transformers to determine the emotion for each tweet. Time series analysis was conducted to study the impact of misinformation on spatial and temporal characteristics. Further, categorical classification was performed using transforme",
    "link": "http://arxiv.org/abs/2306.13954",
    "context": "Title: Characterizing the Emotion Carriers of COVID-19 Misinformation and Their Impact on Vaccination Outcomes in India and the United States. (arXiv:2306.13954v1 [cs.CL])\nAbstract: The COVID-19 Infodemic had an unprecedented impact on health behaviors and outcomes at a global scale. While many studies have focused on a qualitative and quantitative understanding of misinformation, including sentiment analysis, there is a gap in understanding the emotion-carriers of misinformation and their differences across geographies. In this study, we characterized emotion carriers and their impact on vaccination rates in India and the United States. A manually labelled dataset was created from 2.3 million tweets and collated with three publicly available datasets (CoAID, AntiVax, CMU) to train deep learning models for misinformation classification. Misinformation labelled tweets were further analyzed for behavioral aspects by leveraging Plutchik Transformers to determine the emotion for each tweet. Time series analysis was conducted to study the impact of misinformation on spatial and temporal characteristics. Further, categorical classification was performed using transforme",
    "path": "papers/23/06/2306.13954.json",
    "total_tokens": 1057,
    "translated_title": "揭示COVID-19谣言的情感载体以及它们对印度和美国疫苗接种的影响",
    "translated_abstract": "COVID-19 Infodemic对全球的健康行为和结果产生了前所未有的影响。尽管许多研究侧重于理解谣言的定性和定量方面，包括情感分析，但对谣言的情感载体及其在地理上的差异的理解存在差距。在本研究中，我们对情感载体及其对印度和美国的疫苗接种率的影响进行了表征。从230万条推文中创建了手动标记的数据集，并与三个公开可用的数据集（CoAID，AntiVax，CMU）进行整合，以训练深度学习模型以进行谣言分类。利用Plutchik Transformers分析了谣言标记推文的行为方面，以确定每个推文的情感。进行了时间序列分析以研究谣言对空间和时间特征的影响。此外，使用transformed features进行分类以了解与谣言相关的情感。我们的结果表明，带有愤怒和恐惧等情感的谣言载体对美国和印度的疫苗接种结果产生了显著影响。本研究提供了有关COVID-19谣言情感方面及其对健康行为的影响的见解。",
    "tldr": "本研究对 COVID-19 谣言的情感载体及其对疫苗接种产生的影响在印度和美国进行了探讨，结果表明带有愤怒和恐惧等情感的谣言载体对疫苗接种结果有重要影响。",
    "en_tdlr": "This study explores the emotion carriers of COVID-19 misinformation and their impact on vaccination outcomes in India and the United States, and the results indicate that carriers with emotions such as anger and fear have significant impact on vaccination outcomes."
}