{
    "title": "Adaptive Hierarchical SpatioTemporal Network for Traffic Forecasting. (arXiv:2306.09386v1 [cs.LG])",
    "abstract": "Accurate traffic forecasting is vital to intelligent transportation systems, which are widely adopted to solve urban traffic issues. Existing traffic forecasting studies focus on modeling spatial-temporal dynamics in traffic data, among which the graph convolution network (GCN) is at the center for exploiting the spatial dependency embedded in the road network graphs. However, these GCN-based methods operate intrinsically on the node level (e.g., road and intersection) only whereas overlooking the spatial hierarchy of the whole city. Nodes such as intersections and road segments can form clusters (e.g., regions), which could also have interactions with each other and share similarities at a higher level. In this work, we propose an Adaptive Hierarchical SpatioTemporal Network (AHSTN) to promote traffic forecasting by exploiting the spatial hierarchy and modeling multi-scale spatial correlations. Apart from the node-level spatiotemporal blocks, AHSTN introduces the adaptive spatiotempor",
    "link": "http://arxiv.org/abs/2306.09386",
    "context": "Title: Adaptive Hierarchical SpatioTemporal Network for Traffic Forecasting. (arXiv:2306.09386v1 [cs.LG])\nAbstract: Accurate traffic forecasting is vital to intelligent transportation systems, which are widely adopted to solve urban traffic issues. Existing traffic forecasting studies focus on modeling spatial-temporal dynamics in traffic data, among which the graph convolution network (GCN) is at the center for exploiting the spatial dependency embedded in the road network graphs. However, these GCN-based methods operate intrinsically on the node level (e.g., road and intersection) only whereas overlooking the spatial hierarchy of the whole city. Nodes such as intersections and road segments can form clusters (e.g., regions), which could also have interactions with each other and share similarities at a higher level. In this work, we propose an Adaptive Hierarchical SpatioTemporal Network (AHSTN) to promote traffic forecasting by exploiting the spatial hierarchy and modeling multi-scale spatial correlations. Apart from the node-level spatiotemporal blocks, AHSTN introduces the adaptive spatiotempor",
    "path": "papers/23/06/2306.09386.json",
    "total_tokens": 1139,
    "translated_title": "自适应分层时空网络用于交通预测。",
    "translated_abstract": "精确的交通预测对于智能交通系统至关重要，该系统被广泛采用以解决城市交通问题。现有的交通预测研究着重于建模交通数据中的空间 - 时间动态，其中，图卷积网络（GCN）是利用路网格中嵌入的空间依赖性的核心。然而，这些基于GCN的方法仅在节点级别（例如道路和交叉口）上运行，而忽略了整个城市的空间层次结构。诸如交叉口和道路段之类的节点可以形成簇（例如区域），这些节点在更高的层次上还可以相互作用并共享相似之处。在这项工作中，我们提出了一种自适应分层空间时间网络（AHSTN），通过利用空间层次结构和建模多尺度空间相关性促进交通预测。除了节点级别的时空块，AHSTN引入了自适应时空块，分别捕捉本地、区域和全球的依赖关系，以自适应地建模不同层次的相关性。此外，我们提出了一种分层注意机制，以选择性地聚合来自不同尺度的信息。对真实世界数据集的广泛实验表明，与最先进的方法相比，提出的AHSTN具有优越性。",
    "tldr": "本文提出了一种自适应分层时空网络（AHSTN），通过利用空间层次结构和建模多尺度空间相关性促进交通预测，AHSTN在节点级别的基础上引入了自适应的时空块，来自适应地处理不同层次之间的相关性，同时使用分层注意机制来选择性地聚合不同尺度的信息，具有优越性。",
    "en_tdlr": "This paper proposes an Adaptive Hierarchical SpatioTemporal Network (AHSTN) for traffic forecasting, which exploits spatial hierarchy and models multi-scale spatial correlations. AHSTN introduces adaptive spatiotemporal blocks to model different levels of correlations and uses hierarchical attention mechanism to selectively aggregate information from different scales. The experiments show that AHSTN outperforms state-of-the-art methods."
}