{
    "title": "Price elasticity of electricity demand: Using instrumental variable regressions to address endogeneity and autocorrelation of high-frequency time series. (arXiv:2306.12863v1 [econ.EM])",
    "abstract": "This paper examines empirical methods for estimating the response of aggregated electricity demand to high-frequency price signals, the short-term elasticity of electricity demand. We investigate how the endogeneity of prices and the autocorrelation of the time series, which are particularly pronounced at hourly granularity, affect and distort common estimators. After developing a controlled test environment with synthetic data that replicate key statistical properties of electricity demand, we show that not only the ordinary least square (OLS) estimator is inconsistent (due to simultaneity), but so is a regular instrumental variable (IV) regression (due to autocorrelation). Using wind as an instrument, as it is commonly done, may result in an estimate of the demand elasticity that is inflated by an order of magnitude. We visualize the reason for the Thams bias using causal graphs and show that its magnitude depends on the autocorrelation of both the instrument, and the dependent varia",
    "link": "http://arxiv.org/abs/2306.12863",
    "context": "Title: Price elasticity of electricity demand: Using instrumental variable regressions to address endogeneity and autocorrelation of high-frequency time series. (arXiv:2306.12863v1 [econ.EM])\nAbstract: This paper examines empirical methods for estimating the response of aggregated electricity demand to high-frequency price signals, the short-term elasticity of electricity demand. We investigate how the endogeneity of prices and the autocorrelation of the time series, which are particularly pronounced at hourly granularity, affect and distort common estimators. After developing a controlled test environment with synthetic data that replicate key statistical properties of electricity demand, we show that not only the ordinary least square (OLS) estimator is inconsistent (due to simultaneity), but so is a regular instrumental variable (IV) regression (due to autocorrelation). Using wind as an instrument, as it is commonly done, may result in an estimate of the demand elasticity that is inflated by an order of magnitude. We visualize the reason for the Thams bias using causal graphs and show that its magnitude depends on the autocorrelation of both the instrument, and the dependent varia",
    "path": "papers/23/06/2306.12863.json",
    "total_tokens": 901,
    "translated_title": "电力需求的价格弹性：使用工具变量回归来解决高频时间序列的内生性和自相关性问题。",
    "translated_abstract": "本文探讨了估计聚合电力需求对高频价格信号响应的实证方法，即短期电力需求弹性。我们研究了价格内生性和时间序列自相关性，特别是在小时级别上，如何影响和扭曲常见的估计器。通过使用复制电力需求关键统计特性的合成数据来开发受控测试环境，我们证明了普通最小二乘估计器(OLS)不一致(由于同时性)，常规工具变量(IV)回归也不一致(由于自相关性)。使用风力作为工具变量，正如通常所做的那样，可能会造成需求弹性估计膨胀一个数量级。我们使用因果图可视化了该偏差的原因，并展示其大小取决于工具和因变量的自相关性。",
    "tldr": "本文研究了估计聚合电力需求对高频价格信号响应的实证方法，发现常见的估计器由于价格内生性和时间序列自相关性而不一致。使用风力作为工具变量可能会导致需求弹性估计膨胀一个数量级。",
    "en_tdlr": "This paper examines empirical methods for estimating the response of aggregated electricity demand to high-frequency price signals, finding that common estimators are inconsistent due to endogeneity and autocorrelation. The use of wind as an instrumental variable may cause the demand elasticity estimate to inflate by an order of magnitude."
}