{
    "title": "RETA-LLM: A Retrieval-Augmented Large Language Model Toolkit. (arXiv:2306.05212v1 [cs.IR])",
    "abstract": "Although Large Language Models (LLMs) have demonstrated extraordinary capabilities in many domains, they still have a tendency to hallucinate and generate fictitious responses to user requests. This problem can be alleviated by augmenting LLMs with information retrieval (IR) systems (also known as retrieval-augmented LLMs). Applying this strategy, LLMs can generate more factual texts in response to user input according to the relevant content retrieved by IR systems from external corpora as references. In addition, by incorporating external knowledge, retrieval-augmented LLMs can answer in-domain questions that cannot be answered by solely relying on the world knowledge stored in parameters. To support research in this area and facilitate the development of retrieval-augmented LLM systems, we develop RETA-LLM, a {RET}reival-{A}ugmented LLM toolkit. In RETA-LLM, we create a complete pipeline to help researchers and users build their customized in-domain LLM-based systems. Compared with ",
    "link": "http://arxiv.org/abs/2306.05212",
    "context": "Title: RETA-LLM: A Retrieval-Augmented Large Language Model Toolkit. (arXiv:2306.05212v1 [cs.IR])\nAbstract: Although Large Language Models (LLMs) have demonstrated extraordinary capabilities in many domains, they still have a tendency to hallucinate and generate fictitious responses to user requests. This problem can be alleviated by augmenting LLMs with information retrieval (IR) systems (also known as retrieval-augmented LLMs). Applying this strategy, LLMs can generate more factual texts in response to user input according to the relevant content retrieved by IR systems from external corpora as references. In addition, by incorporating external knowledge, retrieval-augmented LLMs can answer in-domain questions that cannot be answered by solely relying on the world knowledge stored in parameters. To support research in this area and facilitate the development of retrieval-augmented LLM systems, we develop RETA-LLM, a {RET}reival-{A}ugmented LLM toolkit. In RETA-LLM, we create a complete pipeline to help researchers and users build their customized in-domain LLM-based systems. Compared with ",
    "path": "papers/23/06/2306.05212.json",
    "total_tokens": 986,
    "tldr": "RETA-LLM是一个检索增强的大型语言模型工具包，可以缓解LLM产生幻觉和虚假响应的问题，通过整合外部知识，能回答领域内无法仅依靠存储在参数中的世界知识回答的问题。",
    "en_tdlr": "RETA-LLM is a retrieval-augmented large language model toolkit that can alleviate the problem of LLMs generating hallucinations and fictitious responses. By incorporating external knowledge, retrieval-augmented LLMs can answer in-domain questions that cannot be answered by solely relying on the world knowledge stored in parameters."
}