{
    "title": "Conditional Independence Testing with Heteroskedastic Data and Applications to Causal Discovery. (arXiv:2306.11498v1 [stat.ME])",
    "abstract": "Conditional independence (CI) testing is frequently used in data analysis and machine learning for various scientific fields and it forms the basis of constraint-based causal discovery. Oftentimes, CI testing relies on strong, rather unrealistic assumptions. One of these assumptions is homoskedasticity, in other words, a constant conditional variance is assumed. We frame heteroskedasticity in a structural causal model framework and present an adaptation of the partial correlation CI test that works well in the presence of heteroskedastic noise, given that expert knowledge about the heteroskedastic relationships is available. Further, we provide theoretical consistency results for the proposed CI test which carry over to causal discovery under certain assumptions. Numerical causal discovery experiments demonstrate that the adapted partial correlation CI test outperforms the standard test in the presence of heteroskedasticity and is on par for the homoskedastic case. Finally, we discuss ",
    "link": "http://arxiv.org/abs/2306.11498",
    "context": "Title: Conditional Independence Testing with Heteroskedastic Data and Applications to Causal Discovery. (arXiv:2306.11498v1 [stat.ME])\nAbstract: Conditional independence (CI) testing is frequently used in data analysis and machine learning for various scientific fields and it forms the basis of constraint-based causal discovery. Oftentimes, CI testing relies on strong, rather unrealistic assumptions. One of these assumptions is homoskedasticity, in other words, a constant conditional variance is assumed. We frame heteroskedasticity in a structural causal model framework and present an adaptation of the partial correlation CI test that works well in the presence of heteroskedastic noise, given that expert knowledge about the heteroskedastic relationships is available. Further, we provide theoretical consistency results for the proposed CI test which carry over to causal discovery under certain assumptions. Numerical causal discovery experiments demonstrate that the adapted partial correlation CI test outperforms the standard test in the presence of heteroskedasticity and is on par for the homoskedastic case. Finally, we discuss ",
    "path": "papers/23/06/2306.11498.json",
    "total_tokens": 891,
    "translated_title": "有关异方差数据的条件独立性检验及其在因果发现中的应用",
    "translated_abstract": "条件独立性(CI)检验是数据分析和机器学习中各学科的频繁使用方法，也是基于约束条件的因果发现的基础。但是，CI测试经常依赖于强烈而不切实际的假设之一：同方差性，也就是假定存在常数条件方差。我们将异方差性放在结构因果模型框架中，并提出了适用于异方差噪声下的偏相关CI测试方法，前提是已经掌握关于异方差关系的专家知识。此外，我们为所提出的CI测试方法提供了理论一致性结果，并在某些假设下将其推广到因果发现领域。数字因果发现实验证明，适应了的偏相关CI测试方法在存在异方差性的情况下优于标准测试方法，并在同方差情况下保持一致。最后，我们讨论了该方法在实际应用中的相关问题。",
    "tldr": "本文提出了一种适用于异方差数据的CI测试方法，能够在专家知识的帮助下高效进行因果发现，且实验结果表明其效果优于标准测试方法。",
    "en_tdlr": "This paper proposes a CI testing method which works well in the presence of heteroskedastic noise and is useful for efficient causal discovery with expert knowledge. The numerical experiments demonstrate that the adapted method outperforms the standard test and is consistent for the homoskedastic case."
}