{
    "title": "Decision-Dependent Distributionally Robust Markov Decision Process Method in Dynamic Epidemic Control. (arXiv:2306.14051v1 [math.OC])",
    "abstract": "In this paper, we present a Distributionally Robust Markov Decision Process (DRMDP) approach for addressing the dynamic epidemic control problem. The Susceptible-Exposed-Infectious-Recovered (SEIR) model is widely used to represent the stochastic spread of infectious diseases, such as COVID-19. While Markov Decision Processes (MDP) offers a mathematical framework for identifying optimal actions, such as vaccination and transmission-reducing intervention, to combat disease spreading according to the SEIR model. However, uncertainties in these scenarios demand a more robust approach that is less reliant on error-prone assumptions. The primary objective of our study is to introduce a new DRMDP framework that allows for an ambiguous distribution of transition dynamics. Specifically, we consider the worst-case distribution of these transition probabilities within a decision-dependent ambiguity set. To overcome the computational complexities associated with policy determination, we propose a",
    "link": "http://arxiv.org/abs/2306.14051",
    "context": "Title: Decision-Dependent Distributionally Robust Markov Decision Process Method in Dynamic Epidemic Control. (arXiv:2306.14051v1 [math.OC])\nAbstract: In this paper, we present a Distributionally Robust Markov Decision Process (DRMDP) approach for addressing the dynamic epidemic control problem. The Susceptible-Exposed-Infectious-Recovered (SEIR) model is widely used to represent the stochastic spread of infectious diseases, such as COVID-19. While Markov Decision Processes (MDP) offers a mathematical framework for identifying optimal actions, such as vaccination and transmission-reducing intervention, to combat disease spreading according to the SEIR model. However, uncertainties in these scenarios demand a more robust approach that is less reliant on error-prone assumptions. The primary objective of our study is to introduce a new DRMDP framework that allows for an ambiguous distribution of transition dynamics. Specifically, we consider the worst-case distribution of these transition probabilities within a decision-dependent ambiguity set. To overcome the computational complexities associated with policy determination, we propose a",
    "path": "papers/23/06/2306.14051.json",
    "total_tokens": 955,
    "translated_title": "决策依赖分布鲁棒的马尔可夫决策过程在动态流行病控制中的应用",
    "translated_abstract": "本文提出了一种分布鲁棒的马尔可夫决策过程（DRMDP）方法，用于解决动态流行病控制问题。 Susceptible-Exposed-Infectious-Recovered（SEIR）模型广泛用于表示传染性疾病（如COVID-19）的随机传播。而马尔可夫决策过程为识别根据SEIR模型对抗疾病传播的最优措施（如疫苗接种和降低传播干预）提供了数学框架。 然而，这些情况中的不确定性需要一种更强大、不那么依赖于错误假设的方法。我们研究的主要目标是引入一种新的DRMDP框架，允许在一个与决策相关的模糊集合中考虑转移动态的不确定分布。具体而言，我们考虑在决策相关的模糊集合内的转移概率的最坏情况分布。为了克服与策略确定相关的计算复杂性，我们提出了一种可行的解决方案",
    "tldr": "本文提出了一种新的分布鲁棒的马尔可夫决策过程框架，该框架允许考虑与决策相关的动态转移的不确定分布，从而更好地解决了动态流行病控制问题。"
}