{
    "title": "Regularizing Towards Soft Equivariance Under Mixed Symmetries. (arXiv:2306.00356v1 [cs.LG])",
    "abstract": "Datasets often have their intrinsic symmetries, and particular deep-learning models called equivariant or invariant models have been developed to exploit these symmetries. However, if some or all of these symmetries are only approximate, which frequently happens in practice, these models may be suboptimal due to the architectural restrictions imposed on them. We tackle this issue of approximate symmetries in a setup where symmetries are mixed, i.e., they are symmetries of not single but multiple different types and the degree of approximation varies across these types. Instead of proposing a new architectural restriction as in most of the previous approaches, we present a regularizer-based method for building a model for a dataset with mixed approximate symmetries. The key component of our method is what we call equivariance regularizer for a given type of symmetries, which measures how much a model is equivariant with respect to the symmetries of the type. Our method is trained with t",
    "link": "http://arxiv.org/abs/2306.00356",
    "context": "Title: Regularizing Towards Soft Equivariance Under Mixed Symmetries. (arXiv:2306.00356v1 [cs.LG])\nAbstract: Datasets often have their intrinsic symmetries, and particular deep-learning models called equivariant or invariant models have been developed to exploit these symmetries. However, if some or all of these symmetries are only approximate, which frequently happens in practice, these models may be suboptimal due to the architectural restrictions imposed on them. We tackle this issue of approximate symmetries in a setup where symmetries are mixed, i.e., they are symmetries of not single but multiple different types and the degree of approximation varies across these types. Instead of proposing a new architectural restriction as in most of the previous approaches, we present a regularizer-based method for building a model for a dataset with mixed approximate symmetries. The key component of our method is what we call equivariance regularizer for a given type of symmetries, which measures how much a model is equivariant with respect to the symmetries of the type. Our method is trained with t",
    "path": "papers/23/06/2306.00356.json",
    "total_tokens": 905,
    "tldr": "我们提出了一种基于正则化的方法来构建一个具有混合近似对称性的数据集模型。我们称其为等变正则化器，可以衡量模型相对于不同类型对称性的等变性程度。",
    "en_tdlr": "We propose a regularizer-based method for building a model for a dataset with mixed approximate symmetries, called equivariance regularizer, which measures how much a model is equivariant with respect to different types of symmetries."
}