{
    "title": "LM4HPC: Towards Effective Language Model Application in High-Performance Computing. (arXiv:2306.14979v1 [cs.LG])",
    "abstract": "In recent years, language models (LMs), such as GPT-4, have been widely used in multiple domains, including natural language processing, visualization, and so on. However, applying them for analyzing and optimizing high-performance computing (HPC) software is still challenging due to the lack of HPC-specific support. In this paper, we design the LM4HPC framework to facilitate the research and development of HPC software analyses and optimizations using LMs. Tailored for supporting HPC datasets, AI models, and pipelines, our framework is built on top of a range of components from different levels of the machine learning software stack, with Hugging Face-compatible APIs. Using three representative tasks, we evaluated the prototype of our framework. The results show that LM4HPC can help users quickly evaluate a set of state-of-the-art models and generate insightful leaderboards.",
    "link": "http://arxiv.org/abs/2306.14979",
    "context": "Title: LM4HPC: Towards Effective Language Model Application in High-Performance Computing. (arXiv:2306.14979v1 [cs.LG])\nAbstract: In recent years, language models (LMs), such as GPT-4, have been widely used in multiple domains, including natural language processing, visualization, and so on. However, applying them for analyzing and optimizing high-performance computing (HPC) software is still challenging due to the lack of HPC-specific support. In this paper, we design the LM4HPC framework to facilitate the research and development of HPC software analyses and optimizations using LMs. Tailored for supporting HPC datasets, AI models, and pipelines, our framework is built on top of a range of components from different levels of the machine learning software stack, with Hugging Face-compatible APIs. Using three representative tasks, we evaluated the prototype of our framework. The results show that LM4HPC can help users quickly evaluate a set of state-of-the-art models and generate insightful leaderboards.",
    "path": "papers/23/06/2306.14979.json",
    "total_tokens": 885,
    "translated_title": "LM4HPC：面向高性能计算的有效语言模型应用",
    "translated_abstract": "最近几年，诸如GPT-4之类的语言模型（LMs）已经广泛应用于多个领域，包括自然语言处理、可视化等。然而，由于缺乏高性能计算（HPC）特定的支持，将它们应用于分析和优化HPC软件仍然具有挑战性。在本文中，我们设计了LM4HPC框架，以便利用LMs进行HPC软件分析和优化的研究和开发。我们的框架专为支持HPC数据集、AI模型和流水线而设计，构建在机器学习软件栈的不同层级组件之上，并具有Hugging Face兼容的API。通过三个代表性任务，我们评估了我们的框架的原型。结果表明，LM4HPC可以帮助用户快速评估一组最先进的模型并生成有见地的排行榜。",
    "tldr": "本文设计了LM4HPC框架，旨在通过使用语言模型LMs来分析和优化高性能计算（HPC）软件。通过支持HPC数据集、AI模型和流水线，LM4HPC可以帮助用户快速评估最先进的模型并生成有见地的排行榜。",
    "en_tdlr": "This paper presents the LM4HPC framework, aiming to analyze and optimize high-performance computing (HPC) software using language models (LMs). By supporting HPC datasets, AI models, and pipelines, LM4HPC helps users evaluate state-of-the-art models and generate insightful leaderboards quickly."
}