{
    "title": "Potential Benefits of Employing Large Language Models in Research in Moral Education and Development. (arXiv:2306.13805v1 [cs.CY])",
    "abstract": "Recently, computer scientists have developed large language models (LLMs) by training prediction models with large-scale language corpora and human reinforcements. The LLMs have become one promising way to implement artificial intelligence with accuracy in various fields. Interestingly, recent LLMs possess emergent functional features that emulate sophisticated human cognition, especially in-context learning and the chain of thought, which were unavailable in previous prediction models. In this paper, I will examine how LLMs might contribute to moral education and development research. To achieve this goal, I will review the most recently published conference papers and ArXiv preprints to overview the novel functional features implemented in LLMs. I also intend to conduct brief experiments with ChatGPT to investigate how LLMs behave while addressing ethical dilemmas and external feedback. The results suggest that LLMs might be capable of solving dilemmas based on reasoning and revising",
    "link": "http://arxiv.org/abs/2306.13805",
    "context": "Title: Potential Benefits of Employing Large Language Models in Research in Moral Education and Development. (arXiv:2306.13805v1 [cs.CY])\nAbstract: Recently, computer scientists have developed large language models (LLMs) by training prediction models with large-scale language corpora and human reinforcements. The LLMs have become one promising way to implement artificial intelligence with accuracy in various fields. Interestingly, recent LLMs possess emergent functional features that emulate sophisticated human cognition, especially in-context learning and the chain of thought, which were unavailable in previous prediction models. In this paper, I will examine how LLMs might contribute to moral education and development research. To achieve this goal, I will review the most recently published conference papers and ArXiv preprints to overview the novel functional features implemented in LLMs. I also intend to conduct brief experiments with ChatGPT to investigate how LLMs behave while addressing ethical dilemmas and external feedback. The results suggest that LLMs might be capable of solving dilemmas based on reasoning and revising",
    "path": "papers/23/06/2306.13805.json",
    "total_tokens": 928,
    "translated_title": "使用大型语言模型在道德教育和发展研究中的潜在优势",
    "translated_abstract": "最近，计算机科学家通过使用大规模语料库和人工强化训练预测模型，开发了大型语言模型（LLM）。 LLM已成为实现人工智能在各个领域精确性的一种有前途的方式。有趣的是，最近的LLM具有模拟复杂人类认知的新兴功能特性，特别是上下文学习和思维链，这些特性在以前的预测模型中不可用。本文将探讨LLM如何可能为道德教育和发展研究做出贡献。为了实现这个目标，我将回顾最近发表的会议论文和ArXiv预印本，概述LLM中实现的新颖功能特性。我还打算使用ChatGPT进行简短实验，以研究LLM处理道德困境和外部反馈时的行为。结果表明，LLM可能能够基于推理和修订来解决困境。",
    "tldr": "本文探讨如何使用大型语言模型（LLM）在道德教育和发展研究领域做出贡献。最近的LLM具有新兴的上下文学习和思维链功能，可以通过推理和修订来解决困境。",
    "en_tdlr": "This paper examines how large language models (LLMs) can contribute to moral education and development research, as recent LLMs possess emergent functional features such as contextual learning and chain of thought. The results suggest that LLMs may be capable of solving ethical dilemmas based on reasoning and revision."
}