{
    "title": "EaSyGuide : ESG Issue Identification Framework leveraging Abilities of Generative Large Language Models. (arXiv:2306.06662v2 [cs.CL] UPDATED)",
    "abstract": "This paper presents our participation in the FinNLP-2023 shared task on multi-lingual environmental, social, and corporate governance issue identification (ML-ESG). The task's objective is to classify news articles based on the 35 ESG key issues defined by the MSCI ESG rating guidelines. Our approach focuses on the English and French subtasks, employing the CerebrasGPT, OPT, and Pythia models, along with the zero-shot and GPT3Mix Augmentation techniques. We utilize various encoder models, such as RoBERTa, DeBERTa, and FinBERT, subjecting them to knowledge distillation and additional training.  Our approach yielded exceptional results, securing the first position in the English text subtask with F1-score 0.69 and the second position in the French text subtask with F1-score 0.78. These outcomes underscore the effectiveness of our methodology in identifying ESG issues in news articles across different languages. Our findings contribute to the exploration of ESG topics and highlight the po",
    "link": "http://arxiv.org/abs/2306.06662",
    "context": "Title: EaSyGuide : ESG Issue Identification Framework leveraging Abilities of Generative Large Language Models. (arXiv:2306.06662v2 [cs.CL] UPDATED)\nAbstract: This paper presents our participation in the FinNLP-2023 shared task on multi-lingual environmental, social, and corporate governance issue identification (ML-ESG). The task's objective is to classify news articles based on the 35 ESG key issues defined by the MSCI ESG rating guidelines. Our approach focuses on the English and French subtasks, employing the CerebrasGPT, OPT, and Pythia models, along with the zero-shot and GPT3Mix Augmentation techniques. We utilize various encoder models, such as RoBERTa, DeBERTa, and FinBERT, subjecting them to knowledge distillation and additional training.  Our approach yielded exceptional results, securing the first position in the English text subtask with F1-score 0.69 and the second position in the French text subtask with F1-score 0.78. These outcomes underscore the effectiveness of our methodology in identifying ESG issues in news articles across different languages. Our findings contribute to the exploration of ESG topics and highlight the po",
    "path": "papers/23/06/2306.06662.json",
    "total_tokens": 977,
    "translated_title": "EaSyGuide：利用生成大语言模型能力的ESG问题识别框架",
    "translated_abstract": "本文介绍了我们参加FinNLP-2023多语言环境、社会和企业治理问题识别（ML-ESG）共享任务的方法。该任务的目标是根据MSCI ESG评级指南定义的35个ESG关键问题对新闻文章进行分类。我们的方法集中在英语和法语子任务上，采用CerebrasGPT、OPT和Pythia模型，以及零-shot和GPT3Mix增强技术。我们利用各种编码器模型，如RoBERTa、DeBERTa和FinBERT，在知识蒸馏和额外训练的基础上进行了试验。我们的方法取得了卓越的成果，在英语文本子任务中获得F1-score 0.69的第一名，在法语文本子任务中获得F1-score 0.78的第二名。这些结果强调了我们的方法在不同语言的新闻文章中识别ESG问题的有效性。我们的研究结果对ESG主题的探索做出了贡献，并强调了技术创新在解决复杂问题上的重要性。",
    "tldr": "本文介绍了一种利用生成大语言模型能力的ESG问题识别框架，该框架在多语言环境下对MSCI ESG评级指南定义的35个ESG关键问题实现了卓越的识别成果，为ESG主题的探索做出了贡献。",
    "en_tdlr": "This paper presents a framework for ESG issue identification which leverages abilities of generative large language models. The framework achieved exceptional results in identifying 35 ESG key issues defined by the MSCI ESG rating guidelines across different languages, contributing to the exploration of ESG topics."
}