{
    "title": "Multi-task Learning for Radar Signal Characterisation. (arXiv:2306.13105v1 [eess.SP])",
    "abstract": "Radio signal recognition is a crucial task in both civilian and military applications, as accurate and timely identification of unknown signals is an essential part of spectrum management and electronic warfare. The majority of research in this field has focused on applying deep learning for modulation classification, leaving the task of signal characterisation as an understudied area. This paper addresses this gap by presenting an approach for tackling radar signal classification and characterisation as a multi-task learning (MTL) problem. We propose the IQ Signal Transformer (IQST) among several reference architectures that allow for simultaneous optimisation of multiple regression and classification tasks. We demonstrate the performance of our proposed MTL model on a synthetic radar dataset, while also providing a first-of-its-kind benchmark for radar signal characterisation.",
    "link": "http://arxiv.org/abs/2306.13105",
    "context": "Title: Multi-task Learning for Radar Signal Characterisation. (arXiv:2306.13105v1 [eess.SP])\nAbstract: Radio signal recognition is a crucial task in both civilian and military applications, as accurate and timely identification of unknown signals is an essential part of spectrum management and electronic warfare. The majority of research in this field has focused on applying deep learning for modulation classification, leaving the task of signal characterisation as an understudied area. This paper addresses this gap by presenting an approach for tackling radar signal classification and characterisation as a multi-task learning (MTL) problem. We propose the IQ Signal Transformer (IQST) among several reference architectures that allow for simultaneous optimisation of multiple regression and classification tasks. We demonstrate the performance of our proposed MTL model on a synthetic radar dataset, while also providing a first-of-its-kind benchmark for radar signal characterisation.",
    "path": "papers/23/06/2306.13105.json",
    "total_tokens": 816,
    "translated_title": "多任务学习用于雷达信号特征化",
    "translated_abstract": "无论是民用还是军事应用，无线电信号识别都是至关重要的任务，对于未知信号的准确和及时的识别是频谱管理和电子战的重要组成部分。然而，在这个领域里，大部分的研究都专注于使用深度学习来进行调制分类，而没能充分研究信号特征化的任务。本文提出了一种多任务学习（MTL）的方法来应对雷达信号分类和特征化的问题，提出了 IQ Signal Transformer (IQST) 和其他参考架构，使得能够同时优化多重回归和分类任务。我们在一个合成雷达数据集上展示了我们提出的 MTL 模型的性能，同时提供了一个首次的雷达信号特征化基准测试样例。",
    "tldr": "本文提出一种多任务学习的方法来解决雷达信号分类和特征化的问题，引入IQST等参考架构，通过回归和分类的多重任务优化提高性能，在合成雷达数据集上展示了良好的表现，并提供了首个雷达信号特征化基准测试样例。",
    "en_tdlr": "This paper proposes a multi-task learning approach for radar signal characterization, introducing reference architectures including IQ Signal Transformer for simultaneous optimization of multiple regression and classification tasks. The proposed MTL model performs well on a synthetic radar dataset and provides the first benchmark for radar signal characterization."
}