{
    "title": "Turning large language models into cognitive models. (arXiv:2306.03917v1 [cs.CL])",
    "abstract": "Large language models are powerful systems that excel at many tasks, ranging from translation to mathematical reasoning. Yet, at the same time, these models often show unhuman-like characteristics. In the present paper, we address this gap and ask whether large language models can be turned into cognitive models. We find that -- after finetuning them on data from psychological experiments -these models offer accurate representations of human behavior, even outperforming traditional cognitive models in two decision-making domains. In addition, we show that their representations contain the information necessary to model behavior on the level of individual subjects. Finally, we demonstrate that finetuning on multiple tasks enables large language models to predict human behavior in a previously unseen task. Taken together, these results suggest that large, pre-trained models can be adapted to become generalist cognitive models, thereby opening up new research directions that could trans",
    "link": "http://arxiv.org/abs/2306.03917",
    "context": "Title: Turning large language models into cognitive models. (arXiv:2306.03917v1 [cs.CL])\nAbstract: Large language models are powerful systems that excel at many tasks, ranging from translation to mathematical reasoning. Yet, at the same time, these models often show unhuman-like characteristics. In the present paper, we address this gap and ask whether large language models can be turned into cognitive models. We find that -- after finetuning them on data from psychological experiments -these models offer accurate representations of human behavior, even outperforming traditional cognitive models in two decision-making domains. In addition, we show that their representations contain the information necessary to model behavior on the level of individual subjects. Finally, we demonstrate that finetuning on multiple tasks enables large language models to predict human behavior in a previously unseen task. Taken together, these results suggest that large, pre-trained models can be adapted to become generalist cognitive models, thereby opening up new research directions that could trans",
    "path": "papers/23/06/2306.03917.json",
    "total_tokens": 921,
    "translated_abstract": "大型语言模型是功能强大的系统，擅长许多任务，从翻译到数学推理。然而，与此同时，这些模型通常表现出不像人类的特征。在本文中，我们解决了这一差距，并询问是否可以将大型语言模型转变为认知模型。我们发现，在精细调整它们的数据从心理实验后，这些模型提供准确的人类行为表示，甚至在两个决策领域中胜过传统的认知模型。此外，我们展示他们的表现包含了对个体主体行为的建模所必需的信息。最后，我们展示了在多种任务上进行精细调整使大型语言模型能够预测以前未见的任务中的人类行为。总的来说，这些结果表明，大型的预训练模型可以被适应成为通用认知模型，从而开启了新的研究方向，可能会转变我们对心理学的理解。",
    "tldr": "本研究通过对大型语言模型进行精细调整，研究发现它们可以成为认知模型，并在两个决策领域中胜过传统认知模型，对个体行为的建模也有着必需的信息，为进一步研究心理学开辟了新的方向。",
    "en_tdlr": "This study finds that large language models can be turned into cognitive models through fine-tuning on data from psychological experiments, and outperform traditional cognitive models in two decision-making domains. The representations of these models also contain necessary information for modeling individual behavior. By fine-tuning on multiple tasks, they can predict human behavior in a new task, opening up new research directions in psychology."
}