{
    "title": "Challenges and Opportunities for the Design of Smart Speakers. (arXiv:2306.05741v1 [cs.HC])",
    "abstract": "Advances in voice technology and voice user interfaces (VUIs) -- such as Alexa, Siri, and Google Home -- have opened up the potential for many new types of interaction. However, despite the potential of these devices reflected by the growing market and body of VUI research, there is a lingering sense that the technology is still underused. In this paper, we conducted a systematic literature review of 35 papers to identify and synthesize 127 VUI design guidelines into five themes. Additionally, we conducted semi-structured interviews with 15 smart speaker users to understand their use and non-use of the technology. From the interviews, we distill four design challenges that contribute the most to non-use. Based on their (non-)use, we identify four opportunity spaces for designers to explore such as focusing on information support while multitasking (cooking, driving, childcare, etc), incorporating users' mental models for smart speakers, and integrating calm design principles.",
    "link": "http://arxiv.org/abs/2306.05741",
    "context": "Title: Challenges and Opportunities for the Design of Smart Speakers. (arXiv:2306.05741v1 [cs.HC])\nAbstract: Advances in voice technology and voice user interfaces (VUIs) -- such as Alexa, Siri, and Google Home -- have opened up the potential for many new types of interaction. However, despite the potential of these devices reflected by the growing market and body of VUI research, there is a lingering sense that the technology is still underused. In this paper, we conducted a systematic literature review of 35 papers to identify and synthesize 127 VUI design guidelines into five themes. Additionally, we conducted semi-structured interviews with 15 smart speaker users to understand their use and non-use of the technology. From the interviews, we distill four design challenges that contribute the most to non-use. Based on their (non-)use, we identify four opportunity spaces for designers to explore such as focusing on information support while multitasking (cooking, driving, childcare, etc), incorporating users' mental models for smart speakers, and integrating calm design principles.",
    "path": "papers/23/06/2306.05741.json",
    "total_tokens": 940,
    "translated_title": "智能音箱设计的挑战与机遇",
    "translated_abstract": "语音技术和语音用户界面（VUI），如Alexa、Siri和Google Home等的进步，为许多新类型的交互提供了潜力。然而，尽管市场越来越大，VUI研究越来越多，但人们仍然感到这项技术被低估了。在本文中，我们对35篇论文进行了系统性的文献综述，将127个VUI设计指南综合成了五个主题。此外，我们还对15名智能音箱用户进行了半结构化访谈，以了解他们对技术的使用和不使用情况。通过访谈，我们总结出了四个对不使用技术做出最大贡献的设计挑战。基于他们的使用情况，我们确定了四个设计机遇空间，例如专注于在多任务（烹饪、驾驶、育儿等）中提供信息支持，将用户的智能音箱心理模型融入设计当中，以及整合平静的设计原则。",
    "tldr": "本文通过对35篇论文的文献综述以及15名智能音箱用户的访谈，总结出了智能音箱设计中的五个主题和四个设计挑战，同时提出了四个设计机遇空间，如提供信息支持，在设计中融入用户的心理模型以及整合平静的设计原则等。",
    "en_tdlr": "Through a systematic literature review of 35 papers and semi-structured interviews with 15 smart speaker users, this paper identifies five themes and four design challenges for smart speaker design, and proposes four opportunity spaces such as providing information support, incorporating users' mental models, and integrating calm design principles."
}