{
    "title": "A multi-agent targeted trading equilibrium with transaction costs. (arXiv:2306.08519v1 [q-fin.MF])",
    "abstract": "We prove the existence of a continuous-time Radner equilibrium with multiple agents and transaction costs. The agents are incentivized to trade towards a targeted number of shares throughout the trading period and seek to maximize their expected wealth minus a penalty for deviating from their targets. Their wealth is further reduced by transaction costs that are proportional to the number of stock shares traded. The agents' targeted number of shares is publicly known, making the resulting equilibrium fully revealing. In equilibrium, each agent optimally chooses to trade for an initial time interval before stopping trade. Our equilibrium construction and analysis involves identifying the order in which the agents stop trade. The transaction cost level impacts the equilibrium stock price drift. We analyze the equilibrium outcomes and provide numerical examples.",
    "link": "http://arxiv.org/abs/2306.08519",
    "context": "Title: A multi-agent targeted trading equilibrium with transaction costs. (arXiv:2306.08519v1 [q-fin.MF])\nAbstract: We prove the existence of a continuous-time Radner equilibrium with multiple agents and transaction costs. The agents are incentivized to trade towards a targeted number of shares throughout the trading period and seek to maximize their expected wealth minus a penalty for deviating from their targets. Their wealth is further reduced by transaction costs that are proportional to the number of stock shares traded. The agents' targeted number of shares is publicly known, making the resulting equilibrium fully revealing. In equilibrium, each agent optimally chooses to trade for an initial time interval before stopping trade. Our equilibrium construction and analysis involves identifying the order in which the agents stop trade. The transaction cost level impacts the equilibrium stock price drift. We analyze the equilibrium outcomes and provide numerical examples.",
    "path": "papers/23/06/2306.08519.json",
    "total_tokens": 797,
    "translated_title": "具有交易成本的多智能体目标交易均衡",
    "translated_abstract": "我们证明了具有多个代理和交易成本的连续时间Radner均衡的存在性。代理被激励在交易期间朝着目标股票数量交易，并试图最大化其预期财富减去偏离目标的惩罚。他们的财富还受到与交易的股票数量成比例的交易成本的影响。代理的目标股票数量是公开已知的，因此结果均衡是完全揭示的。在均衡中，每个代理在停止交易之前会选择适当的交易时间间隔。我们的均衡构建和分析涉及确定代理停止交易的顺序。交易成本水平影响均衡股价漂移。我们分析了均衡结果并提供了数值示例。",
    "tldr": "本文证明了具有多个代理和交易成本的连续时间Radner均衡的存在性，并且在此基础上提出了公开透明的目标交易均衡模型，同时分析了交易成本水平对股价漂移的影响。",
    "en_tdlr": "This paper proves the existence of a continuous-time Radner equilibrium with multiple agents and transaction costs, and proposes a transparent targeted trading equilibrium model based on this, while analyzing the impact of transaction costs on stock price drift."
}