{
    "title": "Accounting For Informative Sampling When Learning to Forecast Treatment Outcomes Over Time. (arXiv:2306.04255v1 [stat.ML])",
    "abstract": "Machine learning (ML) holds great potential for accurately forecasting treatment outcomes over time, which could ultimately enable the adoption of more individualized treatment strategies in many practical applications. However, a significant challenge that has been largely overlooked by the ML literature on this topic is the presence of informative sampling in observational data. When instances are observed irregularly over time, sampling times are typically not random, but rather informative -- depending on the instance's characteristics, past outcomes, and administered treatments. In this work, we formalize informative sampling as a covariate shift problem and show that it can prohibit accurate estimation of treatment outcomes if not properly accounted for. To overcome this challenge, we present a general framework for learning treatment outcomes in the presence of informative sampling using inverse intensity-weighting, and propose a novel method, TESAR-CDE, that instantiates this f",
    "link": "http://arxiv.org/abs/2306.04255",
    "context": "Title: Accounting For Informative Sampling When Learning to Forecast Treatment Outcomes Over Time. (arXiv:2306.04255v1 [stat.ML])\nAbstract: Machine learning (ML) holds great potential for accurately forecasting treatment outcomes over time, which could ultimately enable the adoption of more individualized treatment strategies in many practical applications. However, a significant challenge that has been largely overlooked by the ML literature on this topic is the presence of informative sampling in observational data. When instances are observed irregularly over time, sampling times are typically not random, but rather informative -- depending on the instance's characteristics, past outcomes, and administered treatments. In this work, we formalize informative sampling as a covariate shift problem and show that it can prohibit accurate estimation of treatment outcomes if not properly accounted for. To overcome this challenge, we present a general framework for learning treatment outcomes in the presence of informative sampling using inverse intensity-weighting, and propose a novel method, TESAR-CDE, that instantiates this f",
    "path": "papers/23/06/2306.04255.json",
    "total_tokens": 866,
    "translated_title": "当学习随时间预测治疗效果时考虑信息抽样",
    "translated_abstract": "机器学习在准确预测治疗效果随时间变化方面具有巨大潜力，这最终可以使更多实际应用中采用个性化治疗策略成为可能。然而，机器学习领域在这个主题上被大量忽视的一个重要挑战是观测数据中存在信息抽样。当实例在时间上不规则观测时，抽样时间通常不是随机的，而是具有信息性的 - 取决于实例的特征、过去的结果和施用的治疗方案。在本文中，我们将信息抽样形式化为一个协变换移问题，并证明如果不适当地考虑它会限制治疗效果的准确估计。为了克服这个挑战，我们提出了一个通用框架，用于在存在信息抽样的情况下学习治疗效果，并提出了一种新的方法，TESAR-CDE，来实现这个框架。",
    "tldr": "本文针对存在信息抽样的观测数据，提出一种通过逆强度加权来学习治疗效果的通用框架，并提出了一种新方法TESAR-CDE。",
    "en_tdlr": "This paper proposes a general framework for learning treatment outcomes using inverse intensity-weighting, and presents a novel method, TESAR-CDE, to overcome the challenge of informative sampling in observational data when predicting treatment outcomes over time."
}