{
    "title": "SummQA at MEDIQA-Chat 2023:In-Context Learning with GPT-4 for Medical Summarization. (arXiv:2306.17384v1 [cs.CL])",
    "abstract": "Medical dialogue summarization is challenging due to the unstructured nature of medical conversations, the use of medical terminology in gold summaries, and the need to identify key information across multiple symptom sets. We present a novel system for the Dialogue2Note Medical Summarization tasks in the MEDIQA 2023 Shared Task. Our approach for section-wise summarization (Task A) is a two-stage process of selecting semantically similar dialogues and using the top-k similar dialogues as in-context examples for GPT-4. For full-note summarization (Task B), we use a similar solution with k=1. We achieved 3rd place in Task A (2nd among all teams), 4th place in Task B Division Wise Summarization (2nd among all teams), 15th place in Task A Section Header Classification (9th among all teams), and 8th place among all teams in Task B. Our results highlight the effectiveness of few-shot prompting for this task, though we also identify several weaknesses of prompting-based approaches. We compare",
    "link": "http://arxiv.org/abs/2306.17384",
    "context": "Title: SummQA at MEDIQA-Chat 2023:In-Context Learning with GPT-4 for Medical Summarization. (arXiv:2306.17384v1 [cs.CL])\nAbstract: Medical dialogue summarization is challenging due to the unstructured nature of medical conversations, the use of medical terminology in gold summaries, and the need to identify key information across multiple symptom sets. We present a novel system for the Dialogue2Note Medical Summarization tasks in the MEDIQA 2023 Shared Task. Our approach for section-wise summarization (Task A) is a two-stage process of selecting semantically similar dialogues and using the top-k similar dialogues as in-context examples for GPT-4. For full-note summarization (Task B), we use a similar solution with k=1. We achieved 3rd place in Task A (2nd among all teams), 4th place in Task B Division Wise Summarization (2nd among all teams), 15th place in Task A Section Header Classification (9th among all teams), and 8th place among all teams in Task B. Our results highlight the effectiveness of few-shot prompting for this task, though we also identify several weaknesses of prompting-based approaches. We compare",
    "path": "papers/23/06/2306.17384.json",
    "total_tokens": 995,
    "translated_title": "MEDIQA-Chat 2023上的SummQA: 使用GPT-4进行医学摘要的上下文学习",
    "translated_abstract": "由于医学对话的非结构化性质、黄金摘要中的医学术语使用以及在多个症状集合中识别关键信息的需要，医学对话摘要是具有挑战性的。我们在MEDIQA 2023共享任务的Dialogue2Note医学摘要任务中提出了一种新颖的系统。我们针对按部分摘要（任务A）的方法是一个两阶段的过程，首先选择语义相似的对话，然后使用前k个相似的对话作为GPT-4的上下文示例。对于完整摘要（任务B），我们使用类似的解决方案，但k=1。在任务A中，我们取得了第三名（在所有团队中排名第二），在任务B的分类摘要中取得了第四名（在所有团队中排名第二），在任务A的部分标题分类中取得了第15名（在所有团队中排名第九），以及在任务B中在所有团队中排名第八。我们的结果突出了对于这个任务来说few-shot prompting的有效性，同时我们也发现了几个基于prompting的方法的不足之处。",
    "tldr": "SummQA在MEDIQA-Chat 2023上通过使用GPT-4进行上下文学习，针对医学摘要任务取得了显著效果，尤其是对于few-shot prompting的有效应用，虽然也发现了基于prompting方法的几个不足之处。",
    "en_tdlr": "SummQA achieved significant results in the medical summarization task at MEDIQA-Chat 2023 by utilizing GPT-4 for in-context learning. The effective use of few-shot prompting was highlighted, although several weaknesses of prompting-based approaches were identified."
}