{
    "title": "PromptAttack: Probing Dialogue State Trackers with Adversarial Prompts. (arXiv:2306.04535v1 [cs.CL])",
    "abstract": "A key component of modern conversational systems is the Dialogue State Tracker (or DST), which models a user's goals and needs. Toward building more robust and reliable DSTs, we introduce a prompt-based learning approach to automatically generate effective adversarial examples to probe DST models. Two key characteristics of this approach are: (i) it only needs the output of the DST with no need for model parameters, and (ii) it can learn to generate natural language utterances that can target any DST. Through experiments over state-of-the-art DSTs, the proposed framework leads to the greatest reduction in accuracy and the best attack success rate while maintaining good fluency and a low perturbation ratio. We also show how much the generated adversarial examples can bolster a DST through adversarial training. These results indicate the strength of prompt-based attacks on DSTs and leave open avenues for continued refinement.",
    "link": "http://arxiv.org/abs/2306.04535",
    "context": "Title: PromptAttack: Probing Dialogue State Trackers with Adversarial Prompts. (arXiv:2306.04535v1 [cs.CL])\nAbstract: A key component of modern conversational systems is the Dialogue State Tracker (or DST), which models a user's goals and needs. Toward building more robust and reliable DSTs, we introduce a prompt-based learning approach to automatically generate effective adversarial examples to probe DST models. Two key characteristics of this approach are: (i) it only needs the output of the DST with no need for model parameters, and (ii) it can learn to generate natural language utterances that can target any DST. Through experiments over state-of-the-art DSTs, the proposed framework leads to the greatest reduction in accuracy and the best attack success rate while maintaining good fluency and a low perturbation ratio. We also show how much the generated adversarial examples can bolster a DST through adversarial training. These results indicate the strength of prompt-based attacks on DSTs and leave open avenues for continued refinement.",
    "path": "papers/23/06/2306.04535.json",
    "total_tokens": 845,
    "translated_title": "PromptAttack: 使用对抗性提示探测对话状态追踪器",
    "translated_abstract": "现代对话系统的关键组成部分是对话状态跟踪器 (DST)，它可以建模用户的目标和需求。为了建立更加强健和可靠的 DST，本文提出了一种基于提示的学习方法，通过自动生成有效的对抗样本来探测 DST 模型。该方法有两个关键特点： (i) 只需要 DST 的输出，无需模型参数， (ii) 它可以学会生成可以针对任何 DST 的自然语言表达。通过与最先进的 DST 进行实验，所提出的框架在保持良好流畅性和低扰动比的同时，实现了最大的准确度下降和最高的攻击成功率。我们还展示了自动生成的对抗样本如何通过对抗训练增强 DST。这些结果表明，基于提示的 DST 攻击的有效性，同时也为持续改进留下了开放的机会。",
    "tldr": "本文提出了一种基于提示的学习方法，通过自动生成有效的对抗样本来探测对话状态跟踪器 (DST) 模型，并展示了如何通过对抗训练增强 DST 的有效性。",
    "en_tdlr": "This paper proposes a prompt-based learning approach to automatically generate effective adversarial examples to probe Dialogue State Tracker (DST) models, and demonstrates the effectiveness of adversarial training to enhance DST."
}