{
    "title": "Understanding Contrastive Learning Through the Lens of Margins. (arXiv:2306.11526v2 [cs.LG] UPDATED)",
    "abstract": "Contrastive learning, along with its variations, has been a highly effective self-supervised learning method across diverse domains. Contrastive learning measures the distance between representations using cosine similarity and uses cross-entropy for representation learning. Within the same framework of cosine-similarity-based representation learning, margins have played a significant role in enhancing face and speaker recognition tasks. Interestingly, despite the shared reliance on the same similarity metrics and objective functions, contrastive learning has not actively adopted margins. Furthermore, decision-boundary-based explanations are the only ones that have been used to explain the effect of margins in contrastive learning. In this work, we propose a new perspective to understand the role of margins based on gradient analysis. Based on the new perspective, we analyze how margins affect gradients of contrastive learning and separate the effect into more elemental levels. We sepa",
    "link": "http://arxiv.org/abs/2306.11526",
    "context": "Title: Understanding Contrastive Learning Through the Lens of Margins. (arXiv:2306.11526v2 [cs.LG] UPDATED)\nAbstract: Contrastive learning, along with its variations, has been a highly effective self-supervised learning method across diverse domains. Contrastive learning measures the distance between representations using cosine similarity and uses cross-entropy for representation learning. Within the same framework of cosine-similarity-based representation learning, margins have played a significant role in enhancing face and speaker recognition tasks. Interestingly, despite the shared reliance on the same similarity metrics and objective functions, contrastive learning has not actively adopted margins. Furthermore, decision-boundary-based explanations are the only ones that have been used to explain the effect of margins in contrastive learning. In this work, we propose a new perspective to understand the role of margins based on gradient analysis. Based on the new perspective, we analyze how margins affect gradients of contrastive learning and separate the effect into more elemental levels. We sepa",
    "path": "papers/23/06/2306.11526.json",
    "total_tokens": 839,
    "translated_title": "通过边界的角度理解对比学习",
    "translated_abstract": "对比学习及其变体是一种在不同领域中高效的自监督学习方法。对比学习使用余弦相似度来度量表示之间的距离，并利用交叉熵进行表示学习。在基于余弦相似度的表示学习框架中，边界在增强人脸和说话人识别任务方面起着重要作用。有趣的是，尽管对比学习和边界依赖于相同的相似度度量和目标函数，但对比学习并没有积极采用边界。此外，只有基于决策边界的解释才被用来解释边界在对比学习中的作用。在这项工作中，我们提出了一个新的角度来理解边界在梯度分析上的作用。基于这个新的角度，我们分析了边界如何影响对比学习的梯度，并将其效果分解成更基本的层次。",
    "tldr": "这项研究提出了一种新的视角来理解边界在对比学习中的作用，并从梯度分析的角度分析了边界如何影响对比学习的效果。",
    "en_tdlr": "This study proposes a new perspective to understand the role of margins in contrastive learning and analyzes how margins affect the effectiveness of contrastive learning from the angle of gradient analysis."
}