{
    "title": "Assessing the Effectiveness of GPT-3 in Detecting False Political Statements: A Case Study on the LIAR Dataset. (arXiv:2306.08190v1 [cs.CL])",
    "abstract": "The detection of political fake statements is crucial for maintaining information integrity and preventing the spread of misinformation in society. Historically, state-of-the-art machine learning models employed various methods for detecting deceptive statements. These methods include the use of metadata (W. Wang et al., 2018), n-grams analysis (Singh et al., 2021), and linguistic (Wu et al., 2022) and stylometric (Islam et al., 2020) features. Recent advancements in large language models, such as GPT-3 (Brown et al., 2020) have achieved state-of-the-art performance on a wide range of tasks. In this study, we conducted experiments with GPT-3 on the LIAR dataset (W. Wang et al., 2018) and achieved higher accuracy than state-of-the-art models without using any additional meta or linguistic features. Additionally, we experimented with zero-shot learning using a carefully designed prompt and achieved near state-of-the-art performance. An advantage of this approach is that the model provide",
    "link": "http://arxiv.org/abs/2306.08190",
    "context": "Title: Assessing the Effectiveness of GPT-3 in Detecting False Political Statements: A Case Study on the LIAR Dataset. (arXiv:2306.08190v1 [cs.CL])\nAbstract: The detection of political fake statements is crucial for maintaining information integrity and preventing the spread of misinformation in society. Historically, state-of-the-art machine learning models employed various methods for detecting deceptive statements. These methods include the use of metadata (W. Wang et al., 2018), n-grams analysis (Singh et al., 2021), and linguistic (Wu et al., 2022) and stylometric (Islam et al., 2020) features. Recent advancements in large language models, such as GPT-3 (Brown et al., 2020) have achieved state-of-the-art performance on a wide range of tasks. In this study, we conducted experiments with GPT-3 on the LIAR dataset (W. Wang et al., 2018) and achieved higher accuracy than state-of-the-art models without using any additional meta or linguistic features. Additionally, we experimented with zero-shot learning using a carefully designed prompt and achieved near state-of-the-art performance. An advantage of this approach is that the model provide",
    "path": "papers/23/06/2306.08190.json",
    "total_tokens": 946,
    "translated_title": "GPT-3在LIAR数据集中检测虚假政治陈述的效果评估：一项案例研究",
    "translated_abstract": "检测政治虚假陈述对于维护信息完整性和防止信息误传在社会中至关重要。历史上，最先进的机器学习模型采用了各种方法来检测欺骗性陈述，包括使用元数据、n-gram分析以及语言学和风格学特征。最近，基于大型语言模型的最新进展，比如GPT-3，已经在广泛的任务上实现了最先进的性能。在本研究中，我们在LIAR数据集上使用GPT-3进行了实验，并获得了比最先进模型更高的准确率，而不使用任何附加的元数据或语言学特征。此外，我们使用一个精心设计的提示进行了零样本学习，并实现了接近最先进的性能。这种方法的一个优点是模型提供了一个解释报告，说明它是如何得出预测的。",
    "tldr": "本文评估了GPT-3模型在LIAR数据集上检测虚假政治陈述的效果，并证明其准确性高于其他最先进的模型，且使用零样本学习可接近最先进的性能。"
}