{
    "title": "Diffusion Posterior Sampling for Informed Single-Channel Dereverberation. (arXiv:2306.12286v1 [eess.AS])",
    "abstract": "We present in this paper an informed single-channel dereverberation method based on conditional generation with diffusion models. With knowledge of the room impulse response, the anechoic utterance is generated via reverse diffusion using a measurement consistency criterion coupled with a neural network that represents the clean speech prior. The proposed approach is largely more robust to measurement noise compared to a state-of-the-art informed single-channel dereverberation method, especially for non-stationary noise. Furthermore, we compare to other blind dereverberation methods using diffusion models and show superiority of the proposed approach for large reverberation times. We motivate the presented algorithm by introducing an extension for blind dereverberation allowing joint estimation of the room impulse response and anechoic speech. Audio samples and code can be found online (https://uhh.de/inf-sp-derev-dps).",
    "link": "http://arxiv.org/abs/2306.12286",
    "context": "Title: Diffusion Posterior Sampling for Informed Single-Channel Dereverberation. (arXiv:2306.12286v1 [eess.AS])\nAbstract: We present in this paper an informed single-channel dereverberation method based on conditional generation with diffusion models. With knowledge of the room impulse response, the anechoic utterance is generated via reverse diffusion using a measurement consistency criterion coupled with a neural network that represents the clean speech prior. The proposed approach is largely more robust to measurement noise compared to a state-of-the-art informed single-channel dereverberation method, especially for non-stationary noise. Furthermore, we compare to other blind dereverberation methods using diffusion models and show superiority of the proposed approach for large reverberation times. We motivate the presented algorithm by introducing an extension for blind dereverberation allowing joint estimation of the room impulse response and anechoic speech. Audio samples and code can be found online (https://uhh.de/inf-sp-derev-dps).",
    "path": "papers/23/06/2306.12286.json",
    "total_tokens": 901,
    "translated_title": "基于扩散模型的强化单通道去混响方法",
    "translated_abstract": "本文提出了一种基于条件生成的扩散模型的强化单通道去混响方法。通过对房间冲激响应的了解，利用测量一致性准则和代表清晰语音先验的神经网络，反向扩散产生消混响语音。与最先进的强化单通道去混响方法相比，该方法对测量噪声更加鲁棒，特别是对于非平稳噪声。此外，我们使用扩散模型与其他盲去混响方法进行比较，并展示了该方法在大混响时间下的优越性。我们通过引入盲去混响的扩展来提出所呈现的算法，允许同时估计房间冲激响应和消混响语音。可在网上找到音频样本和代码（https://uhh.de/inf-sp-derev-dps）。",
    "tldr": "本文提出了一种基于扩散模型的强化单通道去混响方法，鲁棒性更强，能有效地处理非平稳噪声，并在大混响时间下表现出优越性。",
    "en_tdlr": "This paper proposes an informed single-channel dereverberation method based on diffusion models, which generates anechoic speech robustly and efficiently using a conditional generation algorithm with knowledge of the room impulse response. The proposed method outperforms state-of-the-art approaches in terms of robustness to non-stationary noise and large reverberation times, and provides an extension for joint estimation of the room impulse response and anechoic speech. Audio samples and code are available online."
}