{
    "title": "Adversarial Sample Detection Through Neural Network Transport Dynamics. (arXiv:2306.04252v1 [cs.LG])",
    "abstract": "We propose a detector of adversarial samples that is based on the view of neural networks as discrete dynamic systems. The detector tells clean inputs from abnormal ones by comparing the discrete vector fields they follow through the layers. We also show that regularizing this vector field during training makes the network more regular on the data distribution's support, thus making the activations of clean inputs more distinguishable from those of abnormal ones. Experimentally, we compare our detector favorably to other detectors on seen and unseen attacks, and show that the regularization of the network's dynamics improves the performance of adversarial detectors that use the internal embeddings as inputs, while also improving test accuracy.",
    "link": "http://arxiv.org/abs/2306.04252",
    "context": "Title: Adversarial Sample Detection Through Neural Network Transport Dynamics. (arXiv:2306.04252v1 [cs.LG])\nAbstract: We propose a detector of adversarial samples that is based on the view of neural networks as discrete dynamic systems. The detector tells clean inputs from abnormal ones by comparing the discrete vector fields they follow through the layers. We also show that regularizing this vector field during training makes the network more regular on the data distribution's support, thus making the activations of clean inputs more distinguishable from those of abnormal ones. Experimentally, we compare our detector favorably to other detectors on seen and unseen attacks, and show that the regularization of the network's dynamics improves the performance of adversarial detectors that use the internal embeddings as inputs, while also improving test accuracy.",
    "path": "papers/23/06/2306.04252.json",
    "total_tokens": 779,
    "translated_title": "基于神经网络动力学的对抗样本检测方法",
    "translated_abstract": "本文提出了一种基于神经网络离散动态系统的对抗样本检测器。通过比较输入通过层遵循的离散向量场，该检测器可以将干净输入从异常输入中区分出来。我们还展示了在训练过程中对该向量场进行规范化可以使网络在数据分布的支持上更加规则化，从而使干净输入的激活更容易与异常输入的激活区分开来。在实验中，我们将我们的检测器与其他检测器进行了比较，并展示了规范化网络动态可以提高将内部嵌入用作输入的对抗检测器的性能，同时也可以提高测试准确率。",
    "tldr": "本文提出基于神经网络动力学的对抗样本检测器，并通过规范化向量场的训练方法来提高其干净输入和异常输入的区分度。实验结果表明，该方法在不同攻击下的表现优于其他检测器，同时也提高了对抗检测器的测试准确率。",
    "en_tdlr": "This paper proposes an adversarial sample detector based on neural network dynamics and improves its performance by regularizing the vector field during training. Experimental results show that this method outperforms other detectors under different attacks and also improves the test accuracy of adversarial detectors."
}