{
    "title": "RDumb: A simple approach that questions our progress in continual test-time adaptation",
    "abstract": "arXiv:2306.05401v3 Announce Type: replace  Abstract: Test-Time Adaptation (TTA) allows to update pre-trained models to changing data distributions at deployment time. While early work tested these algorithms for individual fixed distribution shifts, recent work proposed and applied methods for continual adaptation over long timescales. To examine the reported progress in the field, we propose the Continually Changing Corruptions (CCC) benchmark to measure asymptotic performance of TTA techniques. We find that eventually all but one state-of-the-art methods collapse and perform worse than a non-adapting model, including models specifically proposed to be robust to performance collapse. In addition, we introduce a simple baseline, \"RDumb\", that periodically resets the model to its pretrained state. RDumb performs better or on par with the previously proposed state-of-the-art in all considered benchmarks. Our results show that previous TTA approaches are neither effective at regularizing ",
    "link": "https://arxiv.org/abs/2306.05401",
    "context": "Title: RDumb: A simple approach that questions our progress in continual test-time adaptation\nAbstract: arXiv:2306.05401v3 Announce Type: replace  Abstract: Test-Time Adaptation (TTA) allows to update pre-trained models to changing data distributions at deployment time. While early work tested these algorithms for individual fixed distribution shifts, recent work proposed and applied methods for continual adaptation over long timescales. To examine the reported progress in the field, we propose the Continually Changing Corruptions (CCC) benchmark to measure asymptotic performance of TTA techniques. We find that eventually all but one state-of-the-art methods collapse and perform worse than a non-adapting model, including models specifically proposed to be robust to performance collapse. In addition, we introduce a simple baseline, \"RDumb\", that periodically resets the model to its pretrained state. RDumb performs better or on par with the previously proposed state-of-the-art in all considered benchmarks. Our results show that previous TTA approaches are neither effective at regularizing ",
    "path": "papers/23/06/2306.05401.json",
    "total_tokens": 771,
    "translated_title": "RDumb：一种质疑我们在持续测试时间适应中取得进展的简单方法",
    "translated_abstract": "测试时间适应（TTA）允许在部署时根据不断变化的数据分布更新预训练模型。为了检验该领域的进展，我们提出了不断变化腐坏（CCC）基准来衡量TTA技术的渐近表现。我们发现除一种最先进方法外，所有其他方法最终都会崩溃并表现比不适应的模型更糟，包括专门设计用于抗性崩溃的模型。此外，我们引入了一个简单的基线“RDumb”，定期将模型重置为预训练状态。在所有考虑的基准测试中，“RDumb”在表现上要么更好，要么与先前提出的最先进方法持平。我们的结果表明先前的TTA方法既不有效",
    "tldr": "RDumb是一个简单的基线方法，能在持续测试时间适应中表现得更好，甚至超过先前提出的最先进方法。",
    "en_tdlr": "RDumb is a simple baseline method that outperforms the previously proposed state-of-the-art methods in continual test-time adaptation."
}