{
    "title": "Malafide: a novel adversarial convolutive noise attack against deepfake and spoofing detection systems. (arXiv:2306.07655v1 [eess.AS])",
    "abstract": "We present Malafide, a universal adversarial attack against automatic speaker verification (ASV) spoofing countermeasures (CMs). By introducing convolutional noise using an optimised linear time-invariant filter, Malafide attacks can be used to compromise CM reliability while preserving other speech attributes such as quality and the speaker's voice. In contrast to other adversarial attacks proposed recently, Malafide filters are optimised independently of the input utterance and duration, are tuned instead to the underlying spoofing attack, and require the optimisation of only a small number of filter coefficients. Even so, they degrade CM performance estimates by an order of magnitude, even in black-box settings, and can also be configured to overcome integrated CM and ASV subsystems. Integrated solutions that use self-supervised learning CMs, however, are more robust, under both black-box and white-box settings.",
    "link": "http://arxiv.org/abs/2306.07655",
    "context": "Title: Malafide: a novel adversarial convolutive noise attack against deepfake and spoofing detection systems. (arXiv:2306.07655v1 [eess.AS])\nAbstract: We present Malafide, a universal adversarial attack against automatic speaker verification (ASV) spoofing countermeasures (CMs). By introducing convolutional noise using an optimised linear time-invariant filter, Malafide attacks can be used to compromise CM reliability while preserving other speech attributes such as quality and the speaker's voice. In contrast to other adversarial attacks proposed recently, Malafide filters are optimised independently of the input utterance and duration, are tuned instead to the underlying spoofing attack, and require the optimisation of only a small number of filter coefficients. Even so, they degrade CM performance estimates by an order of magnitude, even in black-box settings, and can also be configured to overcome integrated CM and ASV subsystems. Integrated solutions that use self-supervised learning CMs, however, are more robust, under both black-box and white-box settings.",
    "path": "papers/23/06/2306.07655.json",
    "total_tokens": 1045,
    "translated_title": "Malafide: 一种新型对抗性卷积噪声攻击，用于深度伪造和欺骗检测系统",
    "translated_abstract": "我们提出了一个通用的对抗性攻击Malafide，用于攻击自动语音识别（ASV）欺诈对策（CMs）。通过引入经过优化的线性时不变滤波器，引入卷积噪声，Malafide攻击可以用于ompromise CM的可靠性，同时保留语音的其他属性，例如质量和说话人的声音。与最近提出的其他对抗性攻击不同，Malafide滤波器独立于输入话语和持续时间进行优化，并调整到基础欺骗攻击，只需要优化少量滤波器系数。即使如此，它们在黑盒设置中降低了CM性能估计一个数量级，还可以配置为克服集成的CM和ASV子系统。然而，使用自监督学习CM的集成解决方案在黑盒和白盒设置下更加稳健。",
    "tldr": "本文提出一个新型通用的对抗性攻击Malafide，可以攻击自动语音识别（ASV）欺诈对策（CMs）。该攻击可以用于ompromise CM的可靠性，同时保留语音的其他属性，例如质量和说话人的声音。 Malafide滤波器独立于输入话语和持续时间进行优化，并调整到基础欺骗攻击，只需要优化少量滤波器系数。集成自监督学习CM的解决方案在黑盒和白盒设置下更加稳健。",
    "en_tdlr": "This paper proposes a new universal adversarial attack Malafide, which can compromise the reliability of automatic speaker verification (ASV) spoofing countermeasures (CMs) while preserving other speech attributes. The Malafide filters are optimized independently of the input utterance and tuned to the underlying spoofing attack, and degrade CM performance estimates by an order of magnitude, even in black-box settings. Integrated solutions that use self-supervised learning CMs are more robust in both black-box and white-box settings."
}