{
    "title": "EM-Network: Oracle Guided Self-distillation for Sequence Learning. (arXiv:2306.10058v1 [cs.LG])",
    "abstract": "We introduce EM-Network, a novel self-distillation approach that effectively leverages target information for supervised sequence-to-sequence (seq2seq) learning. In contrast to conventional methods, it is trained with oracle guidance, which is derived from the target sequence. Since the oracle guidance compactly represents the target-side context that can assist the sequence model in solving the task, the EM-Network achieves a better prediction compared to using only the source input. To allow the sequence model to inherit the promising capability of the EM-Network, we propose a new self-distillation strategy, where the original sequence model can benefit from the knowledge of the EM-Network in a one-stage manner. We conduct comprehensive experiments on two types of seq2seq models: connectionist temporal classification (CTC) for speech recognition and attention-based encoder-decoder (AED) for machine translation. Experimental results demonstrate that the EM-Network significantly advanc",
    "link": "http://arxiv.org/abs/2306.10058",
    "context": "Title: EM-Network: Oracle Guided Self-distillation for Sequence Learning. (arXiv:2306.10058v1 [cs.LG])\nAbstract: We introduce EM-Network, a novel self-distillation approach that effectively leverages target information for supervised sequence-to-sequence (seq2seq) learning. In contrast to conventional methods, it is trained with oracle guidance, which is derived from the target sequence. Since the oracle guidance compactly represents the target-side context that can assist the sequence model in solving the task, the EM-Network achieves a better prediction compared to using only the source input. To allow the sequence model to inherit the promising capability of the EM-Network, we propose a new self-distillation strategy, where the original sequence model can benefit from the knowledge of the EM-Network in a one-stage manner. We conduct comprehensive experiments on two types of seq2seq models: connectionist temporal classification (CTC) for speech recognition and attention-based encoder-decoder (AED) for machine translation. Experimental results demonstrate that the EM-Network significantly advanc",
    "path": "papers/23/06/2306.10058.json",
    "total_tokens": 921,
    "translated_title": "EM-Network: 用于序列学习的自身蒸馏方法",
    "translated_abstract": "我们引入了EM-Network，一种新颖的自我蒸馏方法，可有效利用目标信息进行监督序列到序列（seq2seq）学习，与传统方法不同的是，它是在来自目标序列的“神谕指导”下训练的。由于神谕指导紧凑地表示了目标方面的上下文，可以帮助序列模型解决任务，因此与仅使用源输入相比，EM-Network实现了更好的预测。为了使序列模型继承EM-Network的有前途的能力，我们提出了一种新的自我蒸馏策略，原始序列模型可以在一个阶段中从EM-Network的知识中获益。我们在两种seq2seq模型上进行了综合实验：用于语音识别的连接主义时间分类（CTC）和用于机器翻译的基于注意力的编码器-解码器（AED）。实验结果表明，EM-Network极大地提高了模型性能，并在各种基准数据集上取得了最先进的成果。",
    "tldr": "EM-Network是一种自我蒸馏方法，通过神谕指导能够有效利用目标信息进行监督序列到序列学习，并在语音识别和机器翻译等任务上取得了最先进的成果。",
    "en_tdlr": "EM-Network is a self-distillation approach that effectively leverages target information for supervised sequence-to-sequence learning through oracle guidance, and achieves state-of-the-art results on various tasks such as speech recognition and machine translation."
}