{
    "title": "Case Study-Based Approach of Quantum Machine Learning in Cybersecurity: Quantum Support Vector Machine for Malware Classification and Protection. (arXiv:2306.00284v1 [cs.CR])",
    "abstract": "Quantum machine learning (QML) is an emerging field of research that leverages quantum computing to improve the classical machine learning approach to solve complex real world problems. QML has the potential to address cybersecurity related challenges. Considering the novelty and complex architecture of QML, resources are not yet explicitly available that can pave cybersecurity learners to instill efficient knowledge of this emerging technology. In this research, we design and develop QML-based ten learning modules covering various cybersecurity topics by adopting student centering case-study based learning approach. We apply one subtopic of QML on a cybersecurity topic comprised of pre-lab, lab, and post-lab activities towards providing learners with hands-on QML experiences in solving real-world security problems. In order to engage and motivate students in a learning environment that encourages all students to learn, pre-lab offers a brief introduction to both the QML subtopic and c",
    "link": "http://arxiv.org/abs/2306.00284",
    "context": "Title: Case Study-Based Approach of Quantum Machine Learning in Cybersecurity: Quantum Support Vector Machine for Malware Classification and Protection. (arXiv:2306.00284v1 [cs.CR])\nAbstract: Quantum machine learning (QML) is an emerging field of research that leverages quantum computing to improve the classical machine learning approach to solve complex real world problems. QML has the potential to address cybersecurity related challenges. Considering the novelty and complex architecture of QML, resources are not yet explicitly available that can pave cybersecurity learners to instill efficient knowledge of this emerging technology. In this research, we design and develop QML-based ten learning modules covering various cybersecurity topics by adopting student centering case-study based learning approach. We apply one subtopic of QML on a cybersecurity topic comprised of pre-lab, lab, and post-lab activities towards providing learners with hands-on QML experiences in solving real-world security problems. In order to engage and motivate students in a learning environment that encourages all students to learn, pre-lab offers a brief introduction to both the QML subtopic and c",
    "path": "papers/23/06/2306.00284.json",
    "total_tokens": 981,
    "translated_title": "基于案例研究的量子机器学习在网络安全中的应用：利用量子支持向量机进行恶意软件分类和保护",
    "translated_abstract": "量子机器学习（QML）是利用量子计算改进经典机器学习方法以解决复杂实际问题的新兴研究领域。QML有潜力应对网络安全相关的挑战。由于QML的新颖性和复杂性架构，目前尚未明确提供资源以使网络安全学习者具备关于这一新兴技术的有效知识。本研究采用以学生为中心的案例研究学习方法，设计和开发了基于QML的包含10个学习模块，涵盖各种网络安全主题的课程。我们将QML的一个子主题应用于网络安全主题，并通过实验室前、实验室和实验室后的活动，为学习者提供在解决现实安全问题方面实践QML的机会。为了在鼓励所有学生学习的学习环境中吸引和激励学生，实验室前还提供了关于QML子主题和网络安全主题的简短介绍。",
    "tldr": "本文介绍了基于案例研究的方法，将量子机器学习应用于网络安全领域，通过10个学习模块覆盖各种网络安全主题。该研究旨在提供实践机会以解决实际安全问题，激发和鼓励学生学习。",
    "en_tdlr": "This paper introduces a case study-based approach to apply quantum machine learning to cybersecurity, covering various cybersecurity topics with 10 learning modules. The research aims to provide practical opportunities to solve real-world security problems and motivate students to learn."
}