{
    "title": "A Distribution Optimization Framework for Confidence Bounds of Risk Measures. (arXiv:2306.07059v1 [cs.LG])",
    "abstract": "We present a distribution optimization framework that significantly improves confidence bounds for various risk measures compared to previous methods. Our framework encompasses popular risk measures such as the entropic risk measure, conditional value at risk (CVaR), spectral risk measure, distortion risk measure, equivalent certainty, and rank-dependent expected utility, which are well established in risk-sensitive decision-making literature. To achieve this, we introduce two estimation schemes based on concentration bounds derived from the empirical distribution, specifically using either the Wasserstein distance or the supremum distance. Unlike traditional approaches that add or subtract a confidence radius from the empirical risk measures, our proposed schemes evaluate a specific transformation of the empirical distribution based on the distance. Consequently, our confidence bounds consistently yield tighter results compared to previous methods. We further verify the efficacy of th",
    "link": "http://arxiv.org/abs/2306.07059",
    "context": "Title: A Distribution Optimization Framework for Confidence Bounds of Risk Measures. (arXiv:2306.07059v1 [cs.LG])\nAbstract: We present a distribution optimization framework that significantly improves confidence bounds for various risk measures compared to previous methods. Our framework encompasses popular risk measures such as the entropic risk measure, conditional value at risk (CVaR), spectral risk measure, distortion risk measure, equivalent certainty, and rank-dependent expected utility, which are well established in risk-sensitive decision-making literature. To achieve this, we introduce two estimation schemes based on concentration bounds derived from the empirical distribution, specifically using either the Wasserstein distance or the supremum distance. Unlike traditional approaches that add or subtract a confidence radius from the empirical risk measures, our proposed schemes evaluate a specific transformation of the empirical distribution based on the distance. Consequently, our confidence bounds consistently yield tighter results compared to previous methods. We further verify the efficacy of th",
    "path": "papers/23/06/2306.07059.json",
    "total_tokens": 825,
    "translated_title": "风险度量的置信区间优化框架",
    "translated_abstract": "我们提出了一个分布优化框架，相比之前的方法，显著提高了各种风险度量的置信区间。我们的框架包括流行的风险度量，例如熵风险度量、条件风险价值（CVaR）、光谱风险度量、失真风险度量、等价确定性和分位数期望效用，这些风险度量在风险敏感决策方面的文献中已经得到了很好的确认。为了实现这一目标，我们引入了两种基于经验分布的集中界限的估计方案，具体使用Wasserstein距离或最高距离。与传统方法从经验风险度量中添加或减去置信半径不同，我们提出的方案评估基于距离的经验分布的特定转换。因此，我们的置信区间相比之前的方法始终产生更紧的结果。我们进一步验证了我们方法的有效性。",
    "tldr": "本文提出了一个分布优化框架，使用两种基于经验分布的估计方案，可以显著提高各种风险度量的置信区间。",
    "en_tdlr": "This paper proposes a distribution optimization framework using two estimation schemes based on the empirical distribution, which consistently yields tighter confidence bounds for various risk measures compared to previous methods."
}