{
    "title": "Key Frame Extraction with Attention Based Deep Neural Networks. (arXiv:2306.13176v1 [cs.CV])",
    "abstract": "Automatic keyframe detection from videos is an exercise in selecting scenes that can best summarize the content for long videos. Providing a summary of the video is an important task to facilitate quick browsing and content summarization. The resulting photos are used for automated works (e.g. summarizing security footage, detecting different scenes used in music clips) in different industries. In addition, processing high-volume videos in advanced machine learning methods also creates resource costs. Keyframes obtained; It can be used as an input feature to the methods and models to be used. In this study; We propose a deep learning-based approach for keyframe detection using a deep auto-encoder model with an attention layer. The proposed method first extracts the features from the video frames using the encoder part of the autoencoder and applies segmentation using the k-means clustering algorithm to group these features and similar frames together. Then, keyframes are selected from ",
    "link": "http://arxiv.org/abs/2306.13176",
    "context": "Title: Key Frame Extraction with Attention Based Deep Neural Networks. (arXiv:2306.13176v1 [cs.CV])\nAbstract: Automatic keyframe detection from videos is an exercise in selecting scenes that can best summarize the content for long videos. Providing a summary of the video is an important task to facilitate quick browsing and content summarization. The resulting photos are used for automated works (e.g. summarizing security footage, detecting different scenes used in music clips) in different industries. In addition, processing high-volume videos in advanced machine learning methods also creates resource costs. Keyframes obtained; It can be used as an input feature to the methods and models to be used. In this study; We propose a deep learning-based approach for keyframe detection using a deep auto-encoder model with an attention layer. The proposed method first extracts the features from the video frames using the encoder part of the autoencoder and applies segmentation using the k-means clustering algorithm to group these features and similar frames together. Then, keyframes are selected from ",
    "path": "papers/23/06/2306.13176.json",
    "total_tokens": 821,
    "translated_title": "基于注意力深度神经网络的关键帧提取",
    "translated_abstract": "自动从视频中提取关键帧是选择能够最好地概括长视频内容的场景的练习。提供视频摘要是促进快速浏览和内容总结的重要任务。获得的关键帧可以用作要使用的方法和模型的输入特征。在这项研究中，我们提出了一种基于深度自编码器模型和注意力层的深度学习方法，用于关键帧检测，该方法首先使用自编码器的编码器部分从视频帧中提取特征，并使用k-means聚类算法进行分段，将类似的特征和帧组合在一起。然后，从这些帧中选择关键帧。",
    "tldr": "本研究提出了一种基于深度自编码器模型和注意力层的深度学习方法，用于自动从视频中提取关键帧，提取的关键帧可以用作要使用的方法和模型的输入特征，可用于摘要和安防等行业中的自动化工作。",
    "en_tdlr": "This study proposes a deep learning-based approach for automatic keyframe detection from videos using a deep auto-encoder model with an attention layer. The extracted keyframes can be used as input features for methods and models, and can be applied to automation tasks in industries such as summarization and security."
}