{
    "title": "Why Using Either Aggregated Features or Adjacency Lists in Directed or Undirected Graph? Empirical Study and Simple Classification Method. (arXiv:2306.08274v1 [cs.LG])",
    "abstract": "Node classification is one of the hottest tasks in graph analysis. In this paper, we focus on the choices of node representations (aggregated features vs. adjacency lists) and the edge direction of an input graph (directed vs. undirected), which have a large influence on classification results. We address the first empirical study to benchmark the performance of various GNNs that use either combination of node representations and edge directions. Our experiments demonstrate that no single combination stably achieves state-of-the-art results across datasets, which indicates that we need to select appropriate combinations depending on the characteristics of datasets. In response, we propose a simple yet holistic classification method A2DUG which leverages all combinations of node representation variants in directed and undirected graphs. We demonstrate that A2DUG stably performs well on various datasets. Surprisingly, it largely outperforms the current state-of-the-art methods in several",
    "link": "http://arxiv.org/abs/2306.08274",
    "context": "Title: Why Using Either Aggregated Features or Adjacency Lists in Directed or Undirected Graph? Empirical Study and Simple Classification Method. (arXiv:2306.08274v1 [cs.LG])\nAbstract: Node classification is one of the hottest tasks in graph analysis. In this paper, we focus on the choices of node representations (aggregated features vs. adjacency lists) and the edge direction of an input graph (directed vs. undirected), which have a large influence on classification results. We address the first empirical study to benchmark the performance of various GNNs that use either combination of node representations and edge directions. Our experiments demonstrate that no single combination stably achieves state-of-the-art results across datasets, which indicates that we need to select appropriate combinations depending on the characteristics of datasets. In response, we propose a simple yet holistic classification method A2DUG which leverages all combinations of node representation variants in directed and undirected graphs. We demonstrate that A2DUG stably performs well on various datasets. Surprisingly, it largely outperforms the current state-of-the-art methods in several",
    "path": "papers/23/06/2306.08274.json",
    "total_tokens": 942,
    "translated_title": "使用聚合特征或邻接表在有向或无向图中，为什么要选择哪个？实证研究和简单分类方法。",
    "translated_abstract": "节点分类是图分析中最热门的任务之一。本文关注节点表示（聚合特征 vs. 邻接表）和输入图的边方向（有向 vs. 无向）选择对分类结果的影响。我们进行了第一项实证研究，以基准测试使用不同节点表示和边方向的各种GNNs的性能。我们的实验表明，在数据集中没有单一的组合稳定地实现了最先进的结果，这表明我们需要根据数据集的特征选择合适的组合。为此，我们提出了一个简单但全面的分类方法A2DUG，该方法利用有向和无向图中节点表示变量的所有组合。我们表明，A2DUG在各种数据集上稳定表现良好。令人惊讶的是，在几个数据集上，它在很大程度上优于当前的最先进方法。",
    "tldr": "本文实证研究了在节点分类任务中使用聚合特征或邻接表以及边方向对分类效果的影响，并提出了一个简单全面的分类方法A2DUG，该方法利用了有向和无向图中节点表示变量的所有组合，其在各种数据集上稳定表现良好，并在几个数据集上优于当前的最先进方法。"
}