{
    "title": "Upscaling Global Hourly GPP with Temporal Fusion Transformer (TFT). (arXiv:2306.13815v1 [cs.LG])",
    "abstract": "Reliable estimates of Gross Primary Productivity (GPP), crucial for evaluating climate change initiatives, are currently only available from sparsely distributed eddy covariance tower sites. This limitation hampers access to reliable GPP quantification at regional to global scales. Prior machine learning studies on upscaling \\textit{in situ} GPP to global wall-to-wall maps at sub-daily time steps faced limitations such as lack of input features at higher temporal resolutions and significant missing values. This research explored a novel upscaling solution using Temporal Fusion Transformer (TFT) without relying on past GPP time series. Model development was supplemented by Random Forest Regressor (RFR) and XGBoost, followed by the hybrid model of TFT and tree algorithms. The best preforming model yielded to model performance of 0.704 NSE and 3.54 RMSE. Another contribution of the study was the breakdown analysis of encoder feature importance based on time and flux tower sites. Such anal",
    "link": "http://arxiv.org/abs/2306.13815",
    "context": "Title: Upscaling Global Hourly GPP with Temporal Fusion Transformer (TFT). (arXiv:2306.13815v1 [cs.LG])\nAbstract: Reliable estimates of Gross Primary Productivity (GPP), crucial for evaluating climate change initiatives, are currently only available from sparsely distributed eddy covariance tower sites. This limitation hampers access to reliable GPP quantification at regional to global scales. Prior machine learning studies on upscaling \\textit{in situ} GPP to global wall-to-wall maps at sub-daily time steps faced limitations such as lack of input features at higher temporal resolutions and significant missing values. This research explored a novel upscaling solution using Temporal Fusion Transformer (TFT) without relying on past GPP time series. Model development was supplemented by Random Forest Regressor (RFR) and XGBoost, followed by the hybrid model of TFT and tree algorithms. The best preforming model yielded to model performance of 0.704 NSE and 3.54 RMSE. Another contribution of the study was the breakdown analysis of encoder feature importance based on time and flux tower sites. Such anal",
    "path": "papers/23/06/2306.13815.json",
    "total_tokens": 986,
    "translated_title": "使用时间融合变换器（TFT）升尺度全球小时级GPP估计",
    "translated_abstract": "可靠的总初级生产力（GPP）估计对于评估气候变化倡议至关重要，但目前仅来自分布稀疏的涡度协方差塔站点。这种限制阻碍了在区域和全球尺度上获得可靠的GPP量化。本研究通过Temporal Fusion Transformer（TFT）探索了一种新颖的升尺度解决方案，不依赖于过去的GPP时间序列。模型开发辅助使用了Random Forest Regressor （RFR）和XGBoost，随后是TFT和树算法的混合模型。最佳表现模型产生了0.704 NSE和3.54 RMSE的模型性能。该研究的另一个贡献是根据时间和通量塔站点对编码器特征重要性进行的分解分析。这种分析揭示了非植被相关特征（包括气象变量）在升尺度GPP估计中的重要性。",
    "tldr": "本研究使用时间融合变换器（TFT）解决了过去 GPP 时间序列不足的缺陷，实现了非植被特征在升尺度 GPP 估计中的应用，并取得了良好的模型性能。",
    "en_tdlr": "This study proposes a novel solution using Temporal Fusion Transformer (TFT) to upscale hourly Gross Primary Productivity (GPP) estimation without relying on past GPP time series, and highlights the importance of non-vegetation-related features, such as meteorological variables, in the upscaling process. The best-performing model achieved a performance of 0.704 NSE and 3.54 RMSE."
}