{
    "title": "Closing the loop: Autonomous experiments enabled by machine-learning-based online data analysis in synchrotron beamline environments. (arXiv:2306.11899v1 [physics.data-an])",
    "abstract": "Recently, there has been significant interest in applying machine learning (ML) techniques to X-ray scattering experiments, which proves to be a valuable tool for enhancing research that involves large or rapidly generated datasets. ML allows for the automated interpretation of experimental results, particularly those obtained from synchrotron or neutron facilities. The speed at which ML models can process data presents an important opportunity to establish a closed-loop feedback system, enabling real-time decision-making based on online data analysis. In this study, we describe the incorporation of ML into a closed-loop workflow for X-ray reflectometry (XRR), using the growth of organic thin films as an example. Our focus lies on the beamline integration of ML-based online data analysis and closed-loop feedback. We present solutions that provide an elementary data analysis in real time during the experiment without introducing the additional software dependencies in the beamline contr",
    "link": "http://arxiv.org/abs/2306.11899",
    "context": "Title: Closing the loop: Autonomous experiments enabled by machine-learning-based online data analysis in synchrotron beamline environments. (arXiv:2306.11899v1 [physics.data-an])\nAbstract: Recently, there has been significant interest in applying machine learning (ML) techniques to X-ray scattering experiments, which proves to be a valuable tool for enhancing research that involves large or rapidly generated datasets. ML allows for the automated interpretation of experimental results, particularly those obtained from synchrotron or neutron facilities. The speed at which ML models can process data presents an important opportunity to establish a closed-loop feedback system, enabling real-time decision-making based on online data analysis. In this study, we describe the incorporation of ML into a closed-loop workflow for X-ray reflectometry (XRR), using the growth of organic thin films as an example. Our focus lies on the beamline integration of ML-based online data analysis and closed-loop feedback. We present solutions that provide an elementary data analysis in real time during the experiment without introducing the additional software dependencies in the beamline contr",
    "path": "papers/23/06/2306.11899.json",
    "total_tokens": 880,
    "translated_title": "闭环反馈：基于机器学习的同步辐射实验自主化在线数据分析。",
    "translated_abstract": "近年来，将机器学习技术应用于X射线散射实验已受到重视，这证明了它在研究涉及大量数据或快速产生数据集的价值。机器学习允许自动解释实验结果，特别是那些从同步辐射或中子设施获得的结果。机器学习模型处理数据的速度提供了一个重要的机会，建立闭环反馈系统，实现基于在线数据分析的实时决策。在这项研究中，我们描述了如何将机器学习融入X射线反射测量（XRR）的闭环工作流程中，以有机薄膜的生长为例。我们的重点在于机器学习基于在线数据分析和闭环反馈在光束线中的集成。我们提出了在实验过程中提供基本数据分析的解决方案，而不会在光束线控制中引入其他软件依赖。",
    "tldr": "本研究将机器学习技术应用于同步辐射实验中的X射线反射测量，形成闭环反馈系统，并实现了基于在线数据分析的实时决策。"
}