{
    "title": "Neighborhood-based Hard Negative Mining for Sequential Recommendation. (arXiv:2306.10047v1 [cs.IR])",
    "abstract": "Negative sampling plays a crucial role in training successful sequential recommendation models. Instead of merely employing random negative sample selection, numerous strategies have been proposed to mine informative negative samples to enhance training and performance. However, few of these approaches utilize structural information. In this work, we observe that as training progresses, the distributions of node-pair similarities in different groups with varying degrees of neighborhood overlap change significantly, suggesting that item pairs in distinct groups may possess different negative relationships. Motivated by this observation, we propose a Graph-based Negative sampling approach based on Neighborhood Overlap (GNNO) to exploit structural information hidden in user behaviors for negative mining. GNNO first constructs a global weighted item transition graph using training sequences. Subsequently, it mines hard negative samples based on the degree of overlap with the target item on",
    "link": "http://arxiv.org/abs/2306.10047",
    "context": "Title: Neighborhood-based Hard Negative Mining for Sequential Recommendation. (arXiv:2306.10047v1 [cs.IR])\nAbstract: Negative sampling plays a crucial role in training successful sequential recommendation models. Instead of merely employing random negative sample selection, numerous strategies have been proposed to mine informative negative samples to enhance training and performance. However, few of these approaches utilize structural information. In this work, we observe that as training progresses, the distributions of node-pair similarities in different groups with varying degrees of neighborhood overlap change significantly, suggesting that item pairs in distinct groups may possess different negative relationships. Motivated by this observation, we propose a Graph-based Negative sampling approach based on Neighborhood Overlap (GNNO) to exploit structural information hidden in user behaviors for negative mining. GNNO first constructs a global weighted item transition graph using training sequences. Subsequently, it mines hard negative samples based on the degree of overlap with the target item on",
    "path": "papers/23/06/2306.10047.json",
    "total_tokens": 826,
    "translated_title": "基于邻域的难例挖掘用于序列推荐",
    "translated_abstract": "在训练序列推荐模型时，负采样在其中起着关键作用。目前已经提出了许多策略来挖掘信息丰富的负样本，以强化训练和性能。但是，很少有这些方法利用结构信息。本文观察到在训练过程中，不同程度邻域重叠的不同组节点对相似度的分布发生显着变化，这表明不同组中的项目对可能具有不同的负关系。受此观察的启发，我们提出了一种基于邻域重叠的基于图的负采样方法（GNNO）来利用隐藏在用户行为中的结构信息进行负采样。GNNO首先使用训练序列构建全局加权项目转换图。随后，它根据与目标项的重叠程度来挖掘难例负样本。",
    "tldr": "本文提出了一种基于邻域重叠的基于图形的负采样方法（GNNO），利用隐藏在用户行为中的结构信息进行负采样，用于增进序列推荐模型的训练和性能。"
}