{
    "title": "G\\\"odel-Dummett linear temporal logic. (arXiv:2306.15805v1 [cs.LO])",
    "abstract": "We investigate a version of linear temporal logic whose propositional fragment is G\\\"odel-Dummett logic (which is well known both as a superintuitionistic logic and a t-norm fuzzy logic). We define the logic using two natural semantics: first a real-valued semantics, where statements have a degree of truth in the real unit interval and second a `bi-relational' semantics. We then show that these two semantics indeed define one and the same logic: the statements that are valid for the real-valued semantics are the same as those that are valid for the bi-relational semantics. This G\\\"odel temporal logic does not have any form of the finite model property for these two semantics: there are non-valid statements that can only be falsified on an infinite model. However, by using the technical notion of a quasimodel, we show that every falsifiable statement is falsifiable on a finite quasimodel, yielding an algorithm for deciding if a statement is valid or not. Later, we strengthen this decida",
    "link": "http://arxiv.org/abs/2306.15805",
    "context": "Title: G\\\"odel-Dummett linear temporal logic. (arXiv:2306.15805v1 [cs.LO])\nAbstract: We investigate a version of linear temporal logic whose propositional fragment is G\\\"odel-Dummett logic (which is well known both as a superintuitionistic logic and a t-norm fuzzy logic). We define the logic using two natural semantics: first a real-valued semantics, where statements have a degree of truth in the real unit interval and second a `bi-relational' semantics. We then show that these two semantics indeed define one and the same logic: the statements that are valid for the real-valued semantics are the same as those that are valid for the bi-relational semantics. This G\\\"odel temporal logic does not have any form of the finite model property for these two semantics: there are non-valid statements that can only be falsified on an infinite model. However, by using the technical notion of a quasimodel, we show that every falsifiable statement is falsifiable on a finite quasimodel, yielding an algorithm for deciding if a statement is valid or not. Later, we strengthen this decida",
    "path": "papers/23/06/2306.15805.json",
    "total_tokens": 854,
    "translated_title": "G\\\"odel-Dummett线性时间逻辑",
    "translated_abstract": "我们研究了一个版本的线性时间逻辑，其中命题片段是G\\\"odel-Dummett逻辑（它既是一个超直觉逻辑又是一个t-范数模糊逻辑）。我们使用两种自然语义定义了该逻辑：第一种是实值语义，其中语句在实数单位区间中具有真实度；第二种是\"双关系\"语义。然后我们证明了这两种语义确实定义了同一种逻辑：在实值语义中成立的语句与在\"双关系\"语义中成立的语句相同。这个G\\\"odel时间逻辑在这两种语义中都没有任何形式的有限模型特性：有一些非成立的语句只能在无限模型上被证伪。然而，通过使用拟模型的技术概念，我们证明了每个可以证伪的语句在有限拟模型上都可以证伪，从而给出了判断语句是否成立的算法。",
    "tldr": "G\\\"odel-Dummett线性时间逻辑使用实值和双关系语义定义，并通过拟模型算法解决了证伪的问题。"
}