{
    "title": "Private Covariance Approximation and Eigenvalue-Gap Bounds for Complex Gaussian Perturbations. (arXiv:2306.16648v1 [cs.DS])",
    "abstract": "We consider the problem of approximating a $d \\times d$ covariance matrix $M$ with a rank-$k$ matrix under $(\\varepsilon,\\delta)$-differential privacy. We present and analyze a complex variant of the Gaussian mechanism and show that the Frobenius norm of the difference between the matrix output by this mechanism and the best rank-$k$ approximation to $M$ is bounded by roughly $\\tilde{O}(\\sqrt{kd})$, whenever there is an appropriately large gap between the $k$'th and the $k+1$'th eigenvalues of $M$. This improves on previous work that requires that the gap between every pair of top-$k$ eigenvalues of $M$ is at least $\\sqrt{d}$ for a similar bound. Our analysis leverages the fact that the eigenvalues of complex matrix Brownian motion repel more than in the real case, and uses Dyson's stochastic differential equations governing the evolution of its eigenvalues to show that the eigenvalues of the matrix $M$ perturbed by complex Gaussian noise have large gaps with high probability. Our resu",
    "link": "http://arxiv.org/abs/2306.16648",
    "context": "Title: Private Covariance Approximation and Eigenvalue-Gap Bounds for Complex Gaussian Perturbations. (arXiv:2306.16648v1 [cs.DS])\nAbstract: We consider the problem of approximating a $d \\times d$ covariance matrix $M$ with a rank-$k$ matrix under $(\\varepsilon,\\delta)$-differential privacy. We present and analyze a complex variant of the Gaussian mechanism and show that the Frobenius norm of the difference between the matrix output by this mechanism and the best rank-$k$ approximation to $M$ is bounded by roughly $\\tilde{O}(\\sqrt{kd})$, whenever there is an appropriately large gap between the $k$'th and the $k+1$'th eigenvalues of $M$. This improves on previous work that requires that the gap between every pair of top-$k$ eigenvalues of $M$ is at least $\\sqrt{d}$ for a similar bound. Our analysis leverages the fact that the eigenvalues of complex matrix Brownian motion repel more than in the real case, and uses Dyson's stochastic differential equations governing the evolution of its eigenvalues to show that the eigenvalues of the matrix $M$ perturbed by complex Gaussian noise have large gaps with high probability. Our resu",
    "path": "papers/23/06/2306.16648.json",
    "total_tokens": 1156,
    "translated_title": "复高斯扰动下的私有协方差近似和特征值间隙边界",
    "translated_abstract": "本文考虑在（ε，δ）-差分隐私保护下，近似一个d×d协方差矩阵M为秩为k的矩阵的问题。我们提出并分析了复高斯机制的变体，并证明了此机制产生的矩阵与M的最佳秩k近似之间的弗罗贝尼乌斯范数差的界限约为O(√kd)，只要M的第k个特征值和第k+1个特征值之间有一个足够大的间隔。这改进了以前的工作，以类似的界限需要M的所有前k个特征值之间的间隔至少为√d。我们的分析利用了复矩阵布朗运动的特征值比实数情况下更容易远离，利用戴森的随机微分方程来描述特征值的演化，从而证明了复高斯噪声扰动下的矩阵M的特征值具有很大的间隔的概率较高。",
    "tldr": "本文研究了在差分隐私下，利用复高斯机制近似一个协方差矩阵为秩k矩阵的问题。通过分析复高斯噪声扰动下矩阵的特征值，我们证明了当M的第k个特征值和第k+1个特征值之间有足够大的间隔时，复高斯机制产生的矩阵与M的最佳秩k近似之间的差距的界限为O(√kd)。",
    "en_tdlr": "This paper investigates approximating a covariance matrix to a rank-k matrix using a complex variant of the Gaussian mechanism under differential privacy. The main result shows that the Frobenius norm difference between the approximate matrix and the best rank-k approximation to the original matrix is bounded by roughly O(√kd) when there is a sufficiently large gap between the k-th and (k+1)-th eigenvalues of the covariance matrix. This improves upon previous work that required a similar bound for the gap between all the top-k eigenvalues of the covariance matrix. The analysis leverages the repulsion of eigenvalues in complex matrix Brownian motion and utilizes Dyson's stochastic differential equations to prove that the eigenvalues of the perturbed matrix have large gaps with high probability."
}