{
    "title": "A Domain-Independent Agent Architecture for Adaptive Operation in Evolving Open Worlds. (arXiv:2306.06272v1 [cs.AI])",
    "abstract": "Model-based reasoning agents are ill-equipped to act in novel situations in which their model of the environment no longer sufficiently represents the world. We propose HYDRA - a framework for designing model-based agents operating in mixed discrete-continuous worlds, that can autonomously detect when the environment has evolved from its canonical setup, understand how it has evolved, and adapt the agents' models to perform effectively. HYDRA is based upon PDDL+, a rich modeling language for planning in mixed, discrete-continuous environments. It augments the planning module with visual reasoning, task selection, and action execution modules for closed-loop interaction with complex environments. HYDRA implements a novel meta-reasoning process that enables the agent to monitor its own behavior from a variety of aspects. The process employs a diverse set of computational methods to maintain expectations about the agent's own behavior in an environment. Divergences from those expectations",
    "link": "http://arxiv.org/abs/2306.06272",
    "context": "Title: A Domain-Independent Agent Architecture for Adaptive Operation in Evolving Open Worlds. (arXiv:2306.06272v1 [cs.AI])\nAbstract: Model-based reasoning agents are ill-equipped to act in novel situations in which their model of the environment no longer sufficiently represents the world. We propose HYDRA - a framework for designing model-based agents operating in mixed discrete-continuous worlds, that can autonomously detect when the environment has evolved from its canonical setup, understand how it has evolved, and adapt the agents' models to perform effectively. HYDRA is based upon PDDL+, a rich modeling language for planning in mixed, discrete-continuous environments. It augments the planning module with visual reasoning, task selection, and action execution modules for closed-loop interaction with complex environments. HYDRA implements a novel meta-reasoning process that enables the agent to monitor its own behavior from a variety of aspects. The process employs a diverse set of computational methods to maintain expectations about the agent's own behavior in an environment. Divergences from those expectations",
    "path": "papers/23/06/2306.06272.json",
    "total_tokens": 1000,
    "tldr": "提出了一个名为HYDRA的框架，用于设计运行在混合离散连续世界中的基于模型的代理，通过视觉推理，任务选择和行动执行模块的增强规划模块，使代理能够自主检测和适应环境的演变。同时实现了监视自身行为的元推理过程并维护代理在环境中行为期望的多种计算方法。",
    "en_tdlr": "This paper proposes a framework named HYDRA for designing model-based agents operating in mixed discrete-continuous worlds. It enhances the planning module with visual reasoning, task selection, and action execution modules to enable agents to detect and adapt to environmental changes. The framework also implements a novel meta-reasoning process to monitor the agent's behavior and maintain expectations about its actions in the environment."
}