{
    "title": "Machine Unlearning: A Survey. (arXiv:2306.03558v1 [cs.CR])",
    "abstract": "Machine learning has attracted widespread attention and evolved into an enabling technology for a wide range of highly successful applications, such as intelligent computer vision, speech recognition, medical diagnosis, and more. Yet a special need has arisen where, due to privacy, usability, and/or the right to be forgotten, information about some specific samples needs to be removed from a model, called machine unlearning. This emerging technology has drawn significant interest from both academics and industry due to its innovation and practicality. At the same time, this ambitious problem has led to numerous research efforts aimed at confronting its challenges. To the best of our knowledge, no study has analyzed this complex topic or compared the feasibility of existing unlearning solutions in different kinds of scenarios. Accordingly, with this survey, we aim to capture the key concepts of unlearning techniques. The existing solutions are classified and summarized based on their ch",
    "link": "http://arxiv.org/abs/2306.03558",
    "context": "Title: Machine Unlearning: A Survey. (arXiv:2306.03558v1 [cs.CR])\nAbstract: Machine learning has attracted widespread attention and evolved into an enabling technology for a wide range of highly successful applications, such as intelligent computer vision, speech recognition, medical diagnosis, and more. Yet a special need has arisen where, due to privacy, usability, and/or the right to be forgotten, information about some specific samples needs to be removed from a model, called machine unlearning. This emerging technology has drawn significant interest from both academics and industry due to its innovation and practicality. At the same time, this ambitious problem has led to numerous research efforts aimed at confronting its challenges. To the best of our knowledge, no study has analyzed this complex topic or compared the feasibility of existing unlearning solutions in different kinds of scenarios. Accordingly, with this survey, we aim to capture the key concepts of unlearning techniques. The existing solutions are classified and summarized based on their ch",
    "path": "papers/23/06/2306.03558.json",
    "total_tokens": 833,
    "translated_title": "机器取消学习：一项综述（arXiv:2306.03558v1 [cs.CR]）",
    "translated_abstract": "机器学习已经吸引了广泛的关注，并发展成为广泛成功应用的促成技术，例如智能计算机视觉、语音识别、医学诊断等等。然而，由于隐私、可用性和/或遗忘权，有一个特殊的需求需要从模型中删除有关某些特定样本的信息，称为机器取消学习。这种新兴技术因其创新和实用性而引起了学术界和工业界的广泛兴趣。同时，这个雄心勃勃的问题已经导致了众多的研究努力，旨在应对它的挑战。据我们所知，没有一项研究分析这个复杂的主题或在不同种类的情景中比较现有的取消学习解决方案的可行性。因此，通过这个综述，我们旨在把握取消学习技术的关键概念。现有的解决方案根据它们的特征进行分类和总结。",
    "tldr": "本文综述了机器取消学习技术的关键概念，分类和总结了现有的解决方案。",
    "en_tdlr": "This paper provides a survey of the key concepts of the machine unlearning technique and classifies and summarizes existing solutions."
}