{
    "title": "Introduction and Assessment of the Addition of Links and Containers to the Blackboard Architecture. (arXiv:2306.04289v1 [cs.AI])",
    "abstract": "The Blackboard Architecture provides a mechanism for storing data and logic and using it to make decisions that impact the application environment that the Blackboard Architecture network models. While rule-fact-action networks can represent numerous types of data, the relationships that can be easily modeled are limited by the propositional logic nature of the rule-fact network structure. This paper proposes and evaluates the inclusion of containers and links in the Blackboard Architecture. These objects are designed to allow them to model organizational, physical, spatial and other relationships that cannot be readily or efficiently implemented as Boolean logic rules. Containers group related facts together and can be nested to implement complex relationships. Links interconnect containers that have a relationship that is relevant to their organizational purpose. Both objects, together, facilitate new ways of using the Blackboard Architecture and enable or simply its use for complex ",
    "link": "http://arxiv.org/abs/2306.04289",
    "context": "Title: Introduction and Assessment of the Addition of Links and Containers to the Blackboard Architecture. (arXiv:2306.04289v1 [cs.AI])\nAbstract: The Blackboard Architecture provides a mechanism for storing data and logic and using it to make decisions that impact the application environment that the Blackboard Architecture network models. While rule-fact-action networks can represent numerous types of data, the relationships that can be easily modeled are limited by the propositional logic nature of the rule-fact network structure. This paper proposes and evaluates the inclusion of containers and links in the Blackboard Architecture. These objects are designed to allow them to model organizational, physical, spatial and other relationships that cannot be readily or efficiently implemented as Boolean logic rules. Containers group related facts together and can be nested to implement complex relationships. Links interconnect containers that have a relationship that is relevant to their organizational purpose. Both objects, together, facilitate new ways of using the Blackboard Architecture and enable or simply its use for complex ",
    "path": "papers/23/06/2306.04289.json",
    "total_tokens": 832,
    "translated_title": "黑板架构中添加链接和容器的介绍与评估",
    "translated_abstract": "黑板架构提供了一种机制，用于存储数据和逻辑，并将其用于做出影响黑板架构网络建模的应用环境的决策。虽然规则事实动作网络可以表示多种类型的数据，但可以轻松建模的关系受到规则事实网络结构命题逻辑性质的限制。本文提出并评估了在黑板架构中增加容器和链接。这些对象旨在允许它们建模组织、物理、空间和其他关系，这些关系不能作为布尔逻辑规则轻松或有效地实现。容器将相关数据组合在一起，并可嵌套以实现复杂关系。链接相互连接具有相关组织目的的容器。这两种对象共同促进了使用黑板架构的新方式，并使其能够简化应用于复杂问题中的应用。",
    "tldr": "本文研究在黑板架构中增加容器和链接的作用，这些对象可以更好地建模组织、物理、空间等关系，使黑板架构能够更好地应用于复杂问题中。",
    "en_tdlr": "This paper proposes and evaluates the added benefits of containers and links in the Blackboard Architecture, which allow for better modeling of organizational, physical, spatial, and other relationships, enabling the Blackboard Architecture to be more efficiently applied to complex problems."
}