{
    "title": "DreamTime: An Improved Optimization Strategy for Text-to-3D Content Creation. (arXiv:2306.12422v1 [cs.CV])",
    "abstract": "Text-to-image diffusion models pre-trained on billions of image-text pairs have recently enabled text-to-3D content creation by optimizing a randomly initialized Neural Radiance Fields (NeRF) with score distillation. However, the resultant 3D models exhibit two limitations: (a) quality concerns such as saturated color and the Janus problem; (b) extremely low diversity comparing to text-guided image synthesis. In this paper, we show that the conflict between NeRF optimization process and uniform timestep sampling in score distillation is the main reason for these limitations. To resolve this conflict, we propose to prioritize timestep sampling with monotonically non-increasing functions, which aligns NeRF optimization with the sampling process of diffusion model. Extensive experiments show that our simple redesign significantly improves text-to-3D content creation with higher quality and diversity.",
    "link": "http://arxiv.org/abs/2306.12422",
    "context": "Title: DreamTime: An Improved Optimization Strategy for Text-to-3D Content Creation. (arXiv:2306.12422v1 [cs.CV])\nAbstract: Text-to-image diffusion models pre-trained on billions of image-text pairs have recently enabled text-to-3D content creation by optimizing a randomly initialized Neural Radiance Fields (NeRF) with score distillation. However, the resultant 3D models exhibit two limitations: (a) quality concerns such as saturated color and the Janus problem; (b) extremely low diversity comparing to text-guided image synthesis. In this paper, we show that the conflict between NeRF optimization process and uniform timestep sampling in score distillation is the main reason for these limitations. To resolve this conflict, we propose to prioritize timestep sampling with monotonically non-increasing functions, which aligns NeRF optimization with the sampling process of diffusion model. Extensive experiments show that our simple redesign significantly improves text-to-3D content creation with higher quality and diversity.",
    "path": "papers/23/06/2306.12422.json",
    "total_tokens": 898,
    "translated_title": "DreamTime: 一种改进的文本到3D内容创作优化策略",
    "translated_abstract": "近期，预先训练了数十亿个图像-文本对的文本到图像扩散模型通过使用得分蒸馏来优化随机初始化的神经辐射场（NeRF），从而实现了文本到3D内容的创建。 然而，所得到的3D模型存在两个局限性：（a）质量问题，例如饱和的颜色和Janus问题；（b）与文本引导的图像合成相比，极低的多样性。本文表明，NeRF优化过程和得分蒸馏中均匀时间步采样之间的冲突是这些局限性的主要原因。为了解决这种冲突，我们建议优先使用单调非增函数进行时间步采样，这使得NeRF优化与扩散模型的采样过程相一致。大量实验表明，我们的简单重设计能够显著提高文本到3D内容的质量和多样性。",
    "tldr": "本文提出了一种优先使用单调非增函数进行时间步采样的NeRF优化方法，以解决NeRF优化过程和得分蒸馏中均匀时间步采样之间的冲突。实验表明这种方法能够显著提高文本到3D内容的质量和多样性。",
    "en_tdlr": "This paper proposes a NeRF optimization method that prioritizes timestep sampling with monotonically non-increasing functions to resolve the conflict between NeRF optimization process and uniform timestep sampling in score distillation, which significantly improves the quality and diversity of text-to-3D content creation according to experiments."
}