{
    "title": "Structured Cooperative Learning with Graphical Model Priors. (arXiv:2306.09595v1 [cs.LG])",
    "abstract": "We study how to train personalized models for different tasks on decentralized devices with limited local data. We propose \"Structured Cooperative Learning (SCooL)\", in which a cooperation graph across devices is generated by a graphical model prior to automatically coordinate mutual learning between devices. By choosing graphical models enforcing different structures, we can derive a rich class of existing and novel decentralized learning algorithms via variational inference. In particular, we show three instantiations of SCooL that adopt Dirac distribution, stochastic block model (SBM), and attention as the prior generating cooperation graphs. These EM-type algorithms alternate between updating the cooperation graph and cooperative learning of local models. They can automatically capture the cross-task correlations among devices by only monitoring their model updating in order to optimize the cooperation graph. We evaluate SCooL and compare it with existing decentralized learning met",
    "link": "http://arxiv.org/abs/2306.09595",
    "context": "Title: Structured Cooperative Learning with Graphical Model Priors. (arXiv:2306.09595v1 [cs.LG])\nAbstract: We study how to train personalized models for different tasks on decentralized devices with limited local data. We propose \"Structured Cooperative Learning (SCooL)\", in which a cooperation graph across devices is generated by a graphical model prior to automatically coordinate mutual learning between devices. By choosing graphical models enforcing different structures, we can derive a rich class of existing and novel decentralized learning algorithms via variational inference. In particular, we show three instantiations of SCooL that adopt Dirac distribution, stochastic block model (SBM), and attention as the prior generating cooperation graphs. These EM-type algorithms alternate between updating the cooperation graph and cooperative learning of local models. They can automatically capture the cross-task correlations among devices by only monitoring their model updating in order to optimize the cooperation graph. We evaluate SCooL and compare it with existing decentralized learning met",
    "path": "papers/23/06/2306.09595.json",
    "total_tokens": 810,
    "translated_title": "结构化图模型先验下的协作学习",
    "translated_abstract": "我们研究了如何在分散设备上对不同任务进行个性化建模，这些设备的局部数据受限。我们提出了“结构化协作学习（SCooL）”，其中一个跨设备的协作图由图模型先验生成，以自动协调设备之间的相互学习。通过选择施加不同结构的图模型，我们可以通过变分推断推导出一类丰富的现有和新型去中心化学习算法。特别地，我们展示了三种 SCooL 的示例，在其中以 Dirac 分布、随机块模型（SBM）和注意力作为生成协作图的先验。这些 EM 类型的算法通过更新协作图和协同本地模型学习之间进行交替，仅通过监视模型更新来优化协作图，从而可以自动捕捉设备之间的跨任务相关性。",
    "tldr": "本文提出了结构化协作学习算法，在不同设备之间通过协作完成分散任务。通过图模型先验生成的协作图，算法可以自动捕捉设备之间的跨任务相关性。",
    "en_tdlr": "This paper proposes a structured cooperative learning algorithm, SCooL, to complete decentralized tasks across different devices. The cooperation graph generated by a graphical model prior can automatically capture cross-task correlations among devices."
}