{
    "title": "Adaptive Ensemble Q-learning: Minimizing Estimation Bias via Error Feedback. (arXiv:2306.11918v1 [cs.LG])",
    "abstract": "The ensemble method is a promising way to mitigate the overestimation issue in Q-learning, where multiple function approximators are used to estimate the action values. It is known that the estimation bias hinges heavily on the ensemble size (i.e., the number of Q-function approximators used in the target), and that determining the `right' ensemble size is highly nontrivial, because of the time-varying nature of the function approximation errors during the learning process. To tackle this challenge, we first derive an upper bound and a lower bound on the estimation bias, based on which the ensemble size is adapted to drive the bias to be nearly zero, thereby coping with the impact of the time-varying approximation errors accordingly. Motivated by the theoretic findings, we advocate that the ensemble method can be combined with Model Identification Adaptive Control (MIAC) for effective ensemble size adaptation. Specifically, we devise Adaptive Ensemble Q-learning (AdaEQ), a generalized ",
    "link": "http://arxiv.org/abs/2306.11918",
    "context": "Title: Adaptive Ensemble Q-learning: Minimizing Estimation Bias via Error Feedback. (arXiv:2306.11918v1 [cs.LG])\nAbstract: The ensemble method is a promising way to mitigate the overestimation issue in Q-learning, where multiple function approximators are used to estimate the action values. It is known that the estimation bias hinges heavily on the ensemble size (i.e., the number of Q-function approximators used in the target), and that determining the `right' ensemble size is highly nontrivial, because of the time-varying nature of the function approximation errors during the learning process. To tackle this challenge, we first derive an upper bound and a lower bound on the estimation bias, based on which the ensemble size is adapted to drive the bias to be nearly zero, thereby coping with the impact of the time-varying approximation errors accordingly. Motivated by the theoretic findings, we advocate that the ensemble method can be combined with Model Identification Adaptive Control (MIAC) for effective ensemble size adaptation. Specifically, we devise Adaptive Ensemble Q-learning (AdaEQ), a generalized ",
    "path": "papers/23/06/2306.11918.json",
    "total_tokens": 881,
    "translated_title": "自适应集成 Q 学习：通过误差反馈来减小估计偏差",
    "translated_abstract": "集成方法是缓解 Q-learning 中过度估计问题的一种有效方法，其中使用多个函数逼近器来估计动作值。估计偏误严重依赖于集成大小（即目标中使用的 Q 函数逼近器数量），因此决定“正确”的集成大小非常困难，因为在学习过程中函数逼近误差会发生变化。针对这一挑战，我们首先根据估计偏差导出了上限和下限，并根据这些界对集成大小进行自适应，从而将偏差驱动到接近零，因此可以相应地处理时间变化逼近误差的影响。我们将集成方法与模型识别自适应控制（MIAC）相结合，提出了自适应集成 Q 学习（AdaEQ），是一种广义的 Q 学习算法，它可以有效地自适应集成大小。",
    "tldr": "本研究提出了自适应集成 Q 学习算法，通过误差反馈来减小集成方法中估计偏差的影响，并结合模型识别自适应控制（MIAC）来实现集成大小自适应。"
}