{
    "title": "Social World Knowledge: Modeling and Applications. (arXiv:2306.16299v1 [cs.AI])",
    "abstract": "Social world knowledge is a key ingredient in effective communication and information processing by humans and machines alike. As of today, there exist many knowledge bases that represent factual world knowledge. Yet, there is no resource that is designed to capture social aspects of world knowledge. We believe that this work makes an important step towards the formulation and construction of such a resource. We introduce SocialVec, a general framework for eliciting low-dimensional entity embeddings from the social contexts in which they occur in social networks. In this framework, entities correspond to highly popular accounts which invoke general interest. We assume that entities that individual users tend to co-follow are socially related, and use this definition of social context to learn the entity embeddings. Similar to word embeddings which facilitate tasks that involve text semantics, we expect the learned social entity embeddings to benefit multiple tasks of social flavor. In ",
    "link": "http://arxiv.org/abs/2306.16299",
    "context": "Title: Social World Knowledge: Modeling and Applications. (arXiv:2306.16299v1 [cs.AI])\nAbstract: Social world knowledge is a key ingredient in effective communication and information processing by humans and machines alike. As of today, there exist many knowledge bases that represent factual world knowledge. Yet, there is no resource that is designed to capture social aspects of world knowledge. We believe that this work makes an important step towards the formulation and construction of such a resource. We introduce SocialVec, a general framework for eliciting low-dimensional entity embeddings from the social contexts in which they occur in social networks. In this framework, entities correspond to highly popular accounts which invoke general interest. We assume that entities that individual users tend to co-follow are socially related, and use this definition of social context to learn the entity embeddings. Similar to word embeddings which facilitate tasks that involve text semantics, we expect the learned social entity embeddings to benefit multiple tasks of social flavor. In ",
    "path": "papers/23/06/2306.16299.json",
    "total_tokens": 808,
    "translated_title": "社交世界知识：建模与应用",
    "translated_abstract": "社交世界知识是人类和机器有效沟通和信息处理的关键因素。目前存在许多表示事实世界知识的知识库，但没有一个资源专门设计用于捕捉社交方面的世界知识。本研究向构建此类资源迈出了重要一步。我们引入了SocialVec，这是一个通用的框架，用于从社交网络中发生的社交环境中提取低维实体嵌入。在这个框架中，实体对应于引起普遍兴趣的高度受欢迎的帐户。我们假设个体用户倾向于共同关注的实体是社交相关的，并使用这个社交环境的定义来学习实体嵌入。类似于有助于涉及文本语义的任务的词嵌入，我们期望学到的社交实体嵌入将有益于多个具有社交特色的任务。",
    "tldr": "这项工作引入了SocialVec框架，用于从社交网络中提取低维实体嵌入，旨在构建一个专门捕捉社交世界知识的资源。",
    "en_tdlr": "This work introduces the SocialVec framework for extracting low-dimensional entity embeddings from social networks, aiming to construct a dedicated resource for capturing social world knowledge."
}