{
    "title": "Extension of the Blackboard Architecture with Common Properties and Generic Rules. (arXiv:2306.04287v1 [cs.AI])",
    "abstract": "The Blackboard Architecture provides a mechanism for embodying data, decision making and actuation. Its versatility has been demonstrated across a wide number of application areas. However, it lacks the capability to directly model organizational, spatial and other relationships which may be useful in decision-making, in addition to the propositional logic embodied in the rule-fact-action network. Previous work has proposed the use of container objects and links as a mechanism to simultaneously model these organizational and other relationships, while leaving the operational logic modeled in the rules, facts and actions. While containers facilitate this modeling, their utility is limited by the need to manually define them. For systems which may have multiple instances of a particular type of object and which may build their network autonomously, based on sensing, the reuse of logical structures facilitates operations and reduces storage and processing needs. This paper, thus, presents",
    "link": "http://arxiv.org/abs/2306.04287",
    "context": "Title: Extension of the Blackboard Architecture with Common Properties and Generic Rules. (arXiv:2306.04287v1 [cs.AI])\nAbstract: The Blackboard Architecture provides a mechanism for embodying data, decision making and actuation. Its versatility has been demonstrated across a wide number of application areas. However, it lacks the capability to directly model organizational, spatial and other relationships which may be useful in decision-making, in addition to the propositional logic embodied in the rule-fact-action network. Previous work has proposed the use of container objects and links as a mechanism to simultaneously model these organizational and other relationships, while leaving the operational logic modeled in the rules, facts and actions. While containers facilitate this modeling, their utility is limited by the need to manually define them. For systems which may have multiple instances of a particular type of object and which may build their network autonomously, based on sensing, the reuse of logical structures facilitates operations and reduces storage and processing needs. This paper, thus, presents",
    "path": "papers/23/06/2306.04287.json",
    "total_tokens": 1017,
    "translated_title": "扩展黑板架构的方法：共同属性和通用规则的支持",
    "translated_abstract": "黑板架构提供了一种将数据、决策和执行体现在一起的机制。现有的工作提出了使用容器对象和链接的机制来建模组织和其他关系，但受到手动定义的限制。本文提出了一种扩展黑板架构的方法，增加了对共同属性和通用规则的支持，以实现对组织、空间和其他关系的建模，并促进对逻辑结构的重用。",
    "tldr": "本文介绍了一种扩展黑板架构的方法，增加了对共同属性和通用规则的支持，以实现对组织、空间和其他关系的建模，并促进对逻辑结构的重用。",
    "en_tdlr": "This paper presents a method to extend the Blackboard Architecture with support for common properties and generic rules, which allows modeling of organizational, spatial and other relationships and facilitates reuse of logical structures."
}