{
    "title": "Towards the Exploitation of LLM-based Chatbot for Providing Legal Support to Palestinian Cooperatives. (arXiv:2306.05827v1 [cs.CL])",
    "abstract": "With the ever-increasing utilization of natural language processing (NLP), we started to witness over the past few years a significant transformation in our interaction with legal texts. This technology has advanced the analysis and enhanced the understanding of complex legal terminology and contexts. The development of recent large language models (LLMs), particularly ChatGPT, has also introduced a revolutionary contribution to the way that legal texts can be processed and comprehended. In this paper, we present our work on a cooperative-legal question-answering LLM-based chatbot, where we developed a set of legal questions about Palestinian cooperatives, associated with their regulations and compared the auto-generated answers by the chatbot to their correspondences that are designed by a legal expert. To evaluate the proposed chatbot, we have used 50 queries generated by the legal expert and compared the answers produced by the chart to their relevance judgments. Finding demonstrate",
    "link": "http://arxiv.org/abs/2306.05827",
    "context": "Title: Towards the Exploitation of LLM-based Chatbot for Providing Legal Support to Palestinian Cooperatives. (arXiv:2306.05827v1 [cs.CL])\nAbstract: With the ever-increasing utilization of natural language processing (NLP), we started to witness over the past few years a significant transformation in our interaction with legal texts. This technology has advanced the analysis and enhanced the understanding of complex legal terminology and contexts. The development of recent large language models (LLMs), particularly ChatGPT, has also introduced a revolutionary contribution to the way that legal texts can be processed and comprehended. In this paper, we present our work on a cooperative-legal question-answering LLM-based chatbot, where we developed a set of legal questions about Palestinian cooperatives, associated with their regulations and compared the auto-generated answers by the chatbot to their correspondences that are designed by a legal expert. To evaluate the proposed chatbot, we have used 50 queries generated by the legal expert and compared the answers produced by the chart to their relevance judgments. Finding demonstrate",
    "path": "papers/23/06/2306.05827.json",
    "total_tokens": 877,
    "translated_title": "面向基于LLM技术的聊天机器人以为巴勒斯坦合作社提供法律支持",
    "translated_abstract": "随着自然语言处理（NLP）的不断应用，我们近年来开始目睹对于法律文件交互方式的重大变革。该技术推动了对复杂法律术语和场景的分析和理解。最新的大型语言模型（LLM）的开发，特别是ChatGPT的出现，也对处理和理解法律文件的方式提出了革命性的贡献。在本文中，我们提出了一个合作社法律问答LLM聊天机器人的工作，其中我们开发了一组关于巴勒斯坦合作社及其规定的法律问题，并将聊天机器人自动生成的答案与由法律专家设计的相应答案进行了比较。为了评估所提出的聊天机器人，我们使用了由法律专家生成的50个查询，并将图表产生的答案与它们的相关性判断进行了比较。结果表明",
    "tldr": "本论文针对巴勒斯坦合作社提出了一个法律问答聊天机器人，基于LLM技术开发，在评估中表现出良好的答案匹配性，可为用户提供法律支持。",
    "en_tdlr": "This paper proposes a legal question-answering LLM-based chatbot for Palestinian cooperatives, which shows good answer matching in evaluation and can provide legal support for users."
}