{
    "title": "Machine learning feature discovery of spinon Fermi surface. (arXiv:2306.03143v1 [cond-mat.str-el])",
    "abstract": "With rapid progress in simulation of strongly interacting quantum Hamiltonians, the challenge in characterizing unknown phases becomes a bottleneck for scientific progress. We demonstrate that a Quantum-Classical hybrid approach (QuCl) of mining the projective snapshots with interpretable classical machine learning, can unveil new signatures of seemingly featureless quantum states. The Kitaev-Heisenberg model on a honeycomb lattice with bond-dependent frustrated interactions presents an ideal system to test QuCl. The model hosts a wealth of quantum spin liquid states: gapped and gapless $\\mathbb{Z}_2$ spin liquids, and a chiral spin liquid (CSL) phase in a small external magnetic field. Recently, various simulations have found a new intermediate gapless phase (IGP), sandwiched between the CSL and a partially polarized phase, launching a debate over its elusive nature. We reveal signatures of phases in the model by contrasting two phases pairwise using an interpretable neural network, t",
    "link": "http://arxiv.org/abs/2306.03143",
    "context": "Title: Machine learning feature discovery of spinon Fermi surface. (arXiv:2306.03143v1 [cond-mat.str-el])\nAbstract: With rapid progress in simulation of strongly interacting quantum Hamiltonians, the challenge in characterizing unknown phases becomes a bottleneck for scientific progress. We demonstrate that a Quantum-Classical hybrid approach (QuCl) of mining the projective snapshots with interpretable classical machine learning, can unveil new signatures of seemingly featureless quantum states. The Kitaev-Heisenberg model on a honeycomb lattice with bond-dependent frustrated interactions presents an ideal system to test QuCl. The model hosts a wealth of quantum spin liquid states: gapped and gapless $\\mathbb{Z}_2$ spin liquids, and a chiral spin liquid (CSL) phase in a small external magnetic field. Recently, various simulations have found a new intermediate gapless phase (IGP), sandwiched between the CSL and a partially polarized phase, launching a debate over its elusive nature. We reveal signatures of phases in the model by contrasting two phases pairwise using an interpretable neural network, t",
    "path": "papers/23/06/2306.03143.json",
    "total_tokens": 928,
    "translated_abstract": "随着强相互作用量子哈密顿量模拟的快速发展，表征未知相的挑战已成为科学进步的瓶颈。我们展示了一种量子-经典混合方法（QuCl），该方法利用可解释的经典机器学习挖掘投影快照，可以揭示看似缺乏特征的量子态的新迹象。在具有键相关的受挫相互作用的蜂窝格子上的Kitaev-Heisenberg模型是测试QuCl的理想系统。该模型拥有丰富的量子自旋液体态：有能隙和无能隙的 $\\mathbb{Z}_2$ 自旋液体，以及一个在小外磁场下的手征自旋液体（CSL）相。最近，各种模拟发现了一个新的中间无能隙相（IGP），夹在CSL和部分极化相之间，引发了对其难解性质的争论。我们通过比较利用可解释神经网络成对对比两个相的方式，展示了模型中各相的特征。",
    "tldr": "本文利用可解释的经典机器学习方法揭示了Kitaev-Heisenberg模型中的各自旋液体态以及一个新的中间无能隙相，为表征未知相提供了新的思路。",
    "en_tdlr": "This paper uses an interpretable classical machine learning approach to reveal various quantum spin liquid states in the Kitaev-Heisenberg model, including a new intermediate gapless phase, providing a new way to characterize unknown phases."
}