{
    "title": "A Crystal-Specific Pre-Training Framework for Crystal Material Property Prediction. (arXiv:2306.05344v1 [cs.LG])",
    "abstract": "Crystal property prediction is a crucial aspect of developing novel materials. However, there are two technical challenges to be addressed for speeding up the investigation of crystals. First, labeling crystal properties is intrinsically difficult due to the high cost and time involved in physical simulations or lab experiments. Second, crystals adhere to a specific quantum chemical principle known as periodic invariance, which is often not captured by existing machine learning methods. To overcome these challenges, we propose the crystal-specific pre-training framework for learning crystal representations with self-supervision. The framework designs a mutex mask strategy for enhancing representation learning so as to alleviate the limited labels available for crystal property prediction. Moreover, we take into account the specific periodic invariance in crystal structures by developing a periodic invariance multi-graph module and periodic attribute learning within our framework. This ",
    "link": "http://arxiv.org/abs/2306.05344",
    "context": "Title: A Crystal-Specific Pre-Training Framework for Crystal Material Property Prediction. (arXiv:2306.05344v1 [cs.LG])\nAbstract: Crystal property prediction is a crucial aspect of developing novel materials. However, there are two technical challenges to be addressed for speeding up the investigation of crystals. First, labeling crystal properties is intrinsically difficult due to the high cost and time involved in physical simulations or lab experiments. Second, crystals adhere to a specific quantum chemical principle known as periodic invariance, which is often not captured by existing machine learning methods. To overcome these challenges, we propose the crystal-specific pre-training framework for learning crystal representations with self-supervision. The framework designs a mutex mask strategy for enhancing representation learning so as to alleviate the limited labels available for crystal property prediction. Moreover, we take into account the specific periodic invariance in crystal structures by developing a periodic invariance multi-graph module and periodic attribute learning within our framework. This ",
    "path": "papers/23/06/2306.05344.json",
    "total_tokens": 948,
    "translated_title": "水晶材料性能预测的晶体特异性预训练框架",
    "translated_abstract": "水晶物性预测是开发新材料的重要方面。然而，为了加速晶体的研究，需要解决两个技术难题：其一，标记晶体物性本质上是困难的，因为需要进行昂贵耗时的物理模拟或实验；其二，晶体遵循特定的量子化学原理，即周期性不变性，往往无法被现有的机器学习方法捕捉到。为了克服这些挑战，我们提出了一种基于自监督学习的晶体特异性预训练框架，用于学习晶体表示。框架设计了一种互斥掩码策略，增强了表示学习，缓解了晶体物性预测中存在的标记受限问题。此外，我们还考虑了晶体结构中的周期性不变性，开发了周期性不变的多图模块和周期特性学习。",
    "tldr": "本论文提出了一种基于自监督学习的晶体特异性预训练框架，该框架设计了一种互斥掩码策略，缓解了晶体物性预测中存在的标记受限问题，并增强了表示学习。同时，该框架还考虑了晶体结构中的周期性不变性，开发了周期性不变的多图模块和周期特性学习。",
    "en_tdlr": "This paper proposes a crystal-specific pre-training framework based on self-supervised learning to address the difficulties of labeling crystal properties and the specific periodic invariance in crystal structures, which enhances representation learning while alleviating the limited labeled data problem for crystal property prediction. A mutex mask strategy is designed for further improving the framework."
}