{
    "title": "Temporal Gradient Inversion Attacks with Robust Optimization. (arXiv:2306.07883v1 [cs.LG])",
    "abstract": "Federated Learning (FL) has emerged as a promising approach for collaborative model training without sharing private data. However, privacy concerns regarding information exchanged during FL have received significant research attention. Gradient Inversion Attacks (GIAs) have been proposed to reconstruct the private data retained by local clients from the exchanged gradients. While recovering private data, the data dimensions and the model complexity increase, which thwart data reconstruction by GIAs. Existing methods adopt prior knowledge about private data to overcome those challenges. In this paper, we first observe that GIAs with gradients from a single iteration fail to reconstruct private data due to insufficient dimensions of leaked gradients, complex model architectures, and invalid gradient information. We investigate a Temporal Gradient Inversion Attack with a Robust Optimization framework, called TGIAs-RO, which recovers private data without any prior knowledge by leveraging ",
    "link": "http://arxiv.org/abs/2306.07883",
    "context": "Title: Temporal Gradient Inversion Attacks with Robust Optimization. (arXiv:2306.07883v1 [cs.LG])\nAbstract: Federated Learning (FL) has emerged as a promising approach for collaborative model training without sharing private data. However, privacy concerns regarding information exchanged during FL have received significant research attention. Gradient Inversion Attacks (GIAs) have been proposed to reconstruct the private data retained by local clients from the exchanged gradients. While recovering private data, the data dimensions and the model complexity increase, which thwart data reconstruction by GIAs. Existing methods adopt prior knowledge about private data to overcome those challenges. In this paper, we first observe that GIAs with gradients from a single iteration fail to reconstruct private data due to insufficient dimensions of leaked gradients, complex model architectures, and invalid gradient information. We investigate a Temporal Gradient Inversion Attack with a Robust Optimization framework, called TGIAs-RO, which recovers private data without any prior knowledge by leveraging ",
    "path": "papers/23/06/2306.07883.json",
    "total_tokens": 879,
    "tldr": "本文提出了一种名为TGIAs-RO的方法，用于在联邦学习中恢复私人数据，该方法通过时间维度进行反演攻击，并利用鲁棒优化框架，不需要任何先验知识。",
    "en_tdlr": "This paper proposes a method called TGIAs-RO for recovering private data in Federated Learning through temporal gradient inversion attack, leveraging a robust optimization framework without any prior knowledge needed."
}