{
    "title": "GMM: Delving into Gradient Aware and Model Perceive Depth Mining for Monocular 3D Detection. (arXiv:2306.17450v1 [cs.CV])",
    "abstract": "Depth perception is a crucial component of monoc-ular 3D detection tasks that typically involve ill-posed problems. In light of the success of sample mining techniques in 2D object detection, we propose a simple yet effective mining strategy for improving depth perception in 3D object detection. Concretely, we introduce a plain metric to evaluate the quality of depth predictions, which chooses the mined sample for the model. Moreover, we propose a Gradient-aware and Model-perceive Mining strategy (GMM) for depth learning, which exploits the predicted depth quality for better depth learning through easy mining. GMM is a general strategy that can be readily applied to several state-of-the-art monocular 3D detectors, improving the accuracy of depth prediction. Extensive experiments on the nuScenes dataset demonstrate that the proposed methods significantly improve the performance of 3D object detection while outperforming other state-of-the-art sample mining techniques by a considerable m",
    "link": "http://arxiv.org/abs/2306.17450",
    "context": "Title: GMM: Delving into Gradient Aware and Model Perceive Depth Mining for Monocular 3D Detection. (arXiv:2306.17450v1 [cs.CV])\nAbstract: Depth perception is a crucial component of monoc-ular 3D detection tasks that typically involve ill-posed problems. In light of the success of sample mining techniques in 2D object detection, we propose a simple yet effective mining strategy for improving depth perception in 3D object detection. Concretely, we introduce a plain metric to evaluate the quality of depth predictions, which chooses the mined sample for the model. Moreover, we propose a Gradient-aware and Model-perceive Mining strategy (GMM) for depth learning, which exploits the predicted depth quality for better depth learning through easy mining. GMM is a general strategy that can be readily applied to several state-of-the-art monocular 3D detectors, improving the accuracy of depth prediction. Extensive experiments on the nuScenes dataset demonstrate that the proposed methods significantly improve the performance of 3D object detection while outperforming other state-of-the-art sample mining techniques by a considerable m",
    "path": "papers/23/06/2306.17450.json",
    "total_tokens": 969,
    "translated_title": "GMM：深入研究梯度感知和模型感知深度挖掘用于单目3D检测",
    "translated_abstract": "深度感知是单目3D检测任务中至关重要的组成部分，通常涉及到不适定问题。鉴于在2D物体检测中取样挖掘技术的成功，我们提出了一种简单而有效的挖掘策略，用于改进3D物体检测中的深度感知。具体来说，我们引入了一个简单的度量来评估深度预测的质量，选择挖掘样本用于模型。此外，我们提出了一种梯度感知和模型感知挖掘策略（GMM）用于深度学习，通过简单挖掘利用预测的深度质量来实现更好的深度学习。GMM是一种通用策略，可以方便地应用于多个最先进的单目3D检测器，从而提高深度预测的准确性。在nuScenes数据集上的大量实验表明，所提出的方法显著提高了3D物体检测的性能，同时在相当大程度上优于其他最先进的取样挖掘技术。",
    "tldr": "本论文提出了一种基于取样挖掘技术的简单而有效的深度感知挖掘策略，通过对深度预测质量的评估和挖掘，改进了单目3D检测中的深度感知，提高了深度预测的准确性。",
    "en_tdlr": "This paper proposes a simple and effective depth perception mining strategy based on sample mining techniques, improving depth perception in monocular 3D detection by evaluating and mining the quality of depth predictions, leading to improved accuracy in depth prediction."
}