{
    "title": "PyTrial: A Comprehensive Platform for Artificial Intelligence for Drug Development. (arXiv:2306.04018v1 [cs.AI])",
    "abstract": "Drug development is a complex process that aims to test the efficacy and safety of candidate drugs in the human body for regulatory approval via clinical trials. Recently, machine learning has emerged as a vital tool for drug development, offering new opportunities to improve the efficiency and success rates of the process. To facilitate the research and development of artificial intelligence (AI) for drug development, we developed a Python package, namely PyTrial, that implements various clinical trial tasks supported by AI algorithms.  To be specific, PyTrial implements 6 essential drug development tasks, including patient outcome prediction, trial site selection, trial outcome prediction, patient-trial matching, trial similarity search, and synthetic data generation. In PyTrial, all tasks are defined by four steps: load data, model definition, model training, and model evaluation, which can be done with a couple of lines of code. In addition, the modular API design allows practition",
    "link": "http://arxiv.org/abs/2306.04018",
    "context": "Title: PyTrial: A Comprehensive Platform for Artificial Intelligence for Drug Development. (arXiv:2306.04018v1 [cs.AI])\nAbstract: Drug development is a complex process that aims to test the efficacy and safety of candidate drugs in the human body for regulatory approval via clinical trials. Recently, machine learning has emerged as a vital tool for drug development, offering new opportunities to improve the efficiency and success rates of the process. To facilitate the research and development of artificial intelligence (AI) for drug development, we developed a Python package, namely PyTrial, that implements various clinical trial tasks supported by AI algorithms.  To be specific, PyTrial implements 6 essential drug development tasks, including patient outcome prediction, trial site selection, trial outcome prediction, patient-trial matching, trial similarity search, and synthetic data generation. In PyTrial, all tasks are defined by four steps: load data, model definition, model training, and model evaluation, which can be done with a couple of lines of code. In addition, the modular API design allows practition",
    "path": "papers/23/06/2306.04018.json",
    "total_tokens": 970,
    "translated_title": "PyTrial：药物研发人工智能的全面平台",
    "translated_abstract": "药物研发是一个复杂的过程，旨在通过临床试验测试候选药物在人体内的疗效和安全性以获得监管批准。最近，机器学习作为药物研发的重要工具出现了，为提高该过程的效率和成功率提供了新机会。为了促进药物研发人工智能的研究和开发，我们开发了一个Python软件包，名为PyTrial，该软件包实现了多种被AI算法支持的临床试验任务。具体而言，PyTrial实现了6个关键的药物研发任务，包括患者结果预测、试验地点选择、试验结果预测、患者-试验匹配、试验相似性搜索和合成数据生成。在PyTrial中，所有任务都由四个步骤定义：加载数据、模型定义、模型训练和模型评估，这可以用几行代码完成。此外，模块化的API设计允许从业者集成自己的AI模型和数据集。PyTrial已在现实临床试验数据上进行了广泛测试，实验结果证明了其在各种受AI支持的临床试验任务中的有效性和效率。",
    "tldr": "PyTrial是一个实现多种AI算法支持的临床试验任务、可集成自己AI模型和数据集的Python软件包，并在现实临床试验数据上进行了广泛测试。",
    "en_tdlr": "PyTrial is a Python package that implements various AI-supported clinical trial tasks, allows integration of custom AI models and datasets, and has been extensively tested on real-world clinical trial data."
}