{
    "title": "Online Self-Supervised Learning in Machine Learning Intrusion Detection for the Internet of Things. (arXiv:2306.13030v1 [cs.CR])",
    "abstract": "This paper proposes a novel Self-Supervised Intrusion Detection (SSID) framework, which enables a fully online Machine Learning (ML) based Intrusion Detection System (IDS) that requires no human intervention or prior off-line learning. The proposed framework analyzes and labels incoming traffic packets based only on the decisions of the IDS itself using an Auto-Associative Deep Random Neural Network, and on an online estimate of its statistically measured trustworthiness. The SSID framework enables IDS to adapt rapidly to time-varying characteristics of the network traffic, and eliminates the need for offline data collection. This approach avoids human errors in data labeling, and human labor and computational costs of model training and data collection. The approach is experimentally evaluated on public datasets and compared with well-known ML models, showing that this SSID framework is very useful and advantageous as an accurate and online learning ML-based IDS for IoT systems.",
    "link": "http://arxiv.org/abs/2306.13030",
    "context": "Title: Online Self-Supervised Learning in Machine Learning Intrusion Detection for the Internet of Things. (arXiv:2306.13030v1 [cs.CR])\nAbstract: This paper proposes a novel Self-Supervised Intrusion Detection (SSID) framework, which enables a fully online Machine Learning (ML) based Intrusion Detection System (IDS) that requires no human intervention or prior off-line learning. The proposed framework analyzes and labels incoming traffic packets based only on the decisions of the IDS itself using an Auto-Associative Deep Random Neural Network, and on an online estimate of its statistically measured trustworthiness. The SSID framework enables IDS to adapt rapidly to time-varying characteristics of the network traffic, and eliminates the need for offline data collection. This approach avoids human errors in data labeling, and human labor and computational costs of model training and data collection. The approach is experimentally evaluated on public datasets and compared with well-known ML models, showing that this SSID framework is very useful and advantageous as an accurate and online learning ML-based IDS for IoT systems.",
    "path": "papers/23/06/2306.13030.json",
    "total_tokens": 985,
    "translated_title": "互联网物联网中基于在线自监督学习的机器学习入侵检测",
    "translated_abstract": "本文提出了一种新颖的自我监督入侵检测（SSID）框架，它使得完全在线的基于机器学习的入侵检测系统成为可能，而无需人工干预或离线学习。该框架仅基于IDS本身的决策和在线估计的统计可信度，使用自联想深度随机神经网络分析和标记传入的流量数据包。SSID框架使IDS能够快速适应网络流量的时变特性，并消除了离线数据收集的需求。这种方法避免了数据标记中的人为误差，以及模型训练和数据收集的人力和计算成本。该方法在公共数据集上进行了实验评估，并与知名机器学习模型进行了比较，结果表明，作为准确和在线学习的基于机器学习的IDS，该SSID框架非常有用且具有优势，可以应用于物联网系统中。",
    "tldr": "提出了一种在线自监督学习的机器学习入侵检测框架，能够实现完全在线的IDS，无需离线学习或人工干预，该框架能够快速适应流量的时变特性，消除了离线数据收集的需要，并避免了数据标记中的人为误差，具有准确率高、成本低等优势。",
    "en_tdlr": "This paper proposes an online self-supervised learning-based intrusion detection framework for IoT systems. The proposed framework enables a fully online ML-based IDS that requires no human intervention or prior offline learning. The framework adapts rapidly to time-varying characteristics of network traffic and eliminates the need for offline data collection, avoiding human errors, and reducing labor and computational costs. This approach has been evaluated on public datasets and shows advantages in accuracy and cost-effectiveness."
}