{
    "title": "An Empirical Study of Obstacle Preemption in the Supreme Court. (arXiv:2306.04462v1 [econ.GN])",
    "abstract": "The Supreme Court's federal preemption decisions are notoriously unpredictable. Traditional left-right voting alignments break down in the face of competing ideological pulls. The breakdown of predictable voting blocs leaves the business interests most affected by federal preemption uncertain of the scope of potential liability to injured third parties and unsure even of whether state or federal law will be applied to future claims.  This empirical analysis of the Court's decisions over the last fifteen years sheds light on the Court's unique voting alignments in obstacle preemption cases. A surprising anti-obstacle preemption coalition is forming as Justice Thomas gradually positions himself alongside the Court's liberals to form a five-justice voting bloc opposing obstacle preemption.",
    "link": "http://arxiv.org/abs/2306.04462",
    "context": "Title: An Empirical Study of Obstacle Preemption in the Supreme Court. (arXiv:2306.04462v1 [econ.GN])\nAbstract: The Supreme Court's federal preemption decisions are notoriously unpredictable. Traditional left-right voting alignments break down in the face of competing ideological pulls. The breakdown of predictable voting blocs leaves the business interests most affected by federal preemption uncertain of the scope of potential liability to injured third parties and unsure even of whether state or federal law will be applied to future claims.  This empirical analysis of the Court's decisions over the last fifteen years sheds light on the Court's unique voting alignments in obstacle preemption cases. A surprising anti-obstacle preemption coalition is forming as Justice Thomas gradually positions himself alongside the Court's liberals to form a five-justice voting bloc opposing obstacle preemption.",
    "path": "papers/23/06/2306.04462.json",
    "total_tokens": 839,
    "translated_title": "最高法院障碍物抢先权的实证研究",
    "translated_abstract": "最高法院联邦抢先权决定是出了名的不可预测。传统的左右阵营投票在竞争性意识形态的拉动下瓦解了。可预测投票集团的瓦解使得最受联邦抢先权影响的商业利益方无法确定潜在第三方受害责任的范围，甚至不确定未来的索赔会适用州法还是联邦法。本文对最近十五年法院判决的实证分析揭示了法院在障碍物抢先权案件中独特的投票联盟。一个令人惊讶的反障碍物抢先权联盟正在形成，随着托马斯大法官逐渐与法院自由党派站在一起，形成一个反对障碍物抢先权的五个法官投票集团。",
    "tldr": "本文实证分析了最高法院障碍物抢先权的决定，并揭示了令人惊讶的反障碍物抢先权联盟的形成，该联盟由托马斯大法官逐渐与法院自由党派组成的五个法官投票集团。",
    "en_tdlr": "This empirical analysis of the Supreme Court's obstacle preemption decisions reveals the surprising formation of an anti-obstacle preemption coalition, as Justice Thomas gradually positions himself alongside the Court's liberals to form a five-justice voting bloc opposing obstacle preemption."
}