{
    "title": "An Empirical Analysis of the Effect of Ballot Truncation on Ranked-Choice Electoral Outcomes. (arXiv:2306.05966v1 [econ.GN])",
    "abstract": "In ranked-choice elections voters cast preference ballots which provide a voter's ranking of the candidates. The method of ranked-choice voting (RCV) chooses a winner by using voter preferences to simulate a series of runoff elections. Some jurisdictions which use RCV limit the number of candidates that voters can rank on the ballot, imposing what we term a truncation level, which is the number of candidates that voters are allowed to rank. Given fixed voter preferences, the winner of the election can change if we impose different truncation levels. We use a database of 1171 real-world ranked-choice elections to empirically analyze the potential effects of imposing different truncation levels in ranked-choice elections. Our general finding is that if the truncation level is at least three then restricting the number of candidates which can be ranked on the ballot rarely affects the election winner.",
    "link": "http://arxiv.org/abs/2306.05966",
    "context": "Title: An Empirical Analysis of the Effect of Ballot Truncation on Ranked-Choice Electoral Outcomes. (arXiv:2306.05966v1 [econ.GN])\nAbstract: In ranked-choice elections voters cast preference ballots which provide a voter's ranking of the candidates. The method of ranked-choice voting (RCV) chooses a winner by using voter preferences to simulate a series of runoff elections. Some jurisdictions which use RCV limit the number of candidates that voters can rank on the ballot, imposing what we term a truncation level, which is the number of candidates that voters are allowed to rank. Given fixed voter preferences, the winner of the election can change if we impose different truncation levels. We use a database of 1171 real-world ranked-choice elections to empirically analyze the potential effects of imposing different truncation levels in ranked-choice elections. Our general finding is that if the truncation level is at least three then restricting the number of candidates which can be ranked on the ballot rarely affects the election winner.",
    "path": "papers/23/06/2306.05966.json",
    "total_tokens": 836,
    "translated_title": "一项关于截选票对排名选举结果影响的实证分析",
    "translated_abstract": "在排名选举中，选民投出偏好选票，提供候选人的排名。排名选举方法通过使用选民偏好来模拟一系列的决胜选举来选择获胜者。某些使用排名选举的司法管辖区限制选民在选票上排名的候选人数量，实施我们所称的截选级别，即选民被允许排名的候选人数。在固定的选民偏好下，如果我们实施不同的截选级别，选举的获胜者可能会改变。我们使用1171个真实世界的排名选举数据库，实证分析了在排名选举中实施不同的截选级别可能产生的影响。我们的普遍发现是，如果截选级别至少为三，则限制投票上的候选人数量很少影响选举获胜者。",
    "tldr": "本研究分析了1171个真实世界的排名选举数据，发现如果截选级别至少为三，则限制投票上的候选人数量很少影响选举获胜者。",
    "en_tdlr": "This study analyzes 1171 real-world ranked-choice election data and finds that limiting the number of candidates that voters can rank on the ballot rarely affects the election winner if the truncation level is at least three."
}