{
    "title": "Multi-task multi-station earthquake monitoring: An all-in-one seismic Phase picking, Location, and Association Network (PLAN). (arXiv:2306.13918v1 [physics.geo-ph])",
    "abstract": "Earthquake monitoring is vital for understanding the physics of earthquakes and assessing seismic hazards. A standard monitoring workflow includes the interrelated and interdependent tasks of phase picking, association, and location. Although deep learning methods have been successfully applied to earthquake monitoring, they mostly address the tasks separately and ignore the geographic relationships among stations. Here, we propose a graph neural network that operates directly on multi-station seismic data and achieves simultaneous phase picking, association, and location. Particularly, the inter-station and inter-task physical relationships are informed in the network architecture to promote accuracy, interpretability, and physical consistency among cross-station and cross-task predictions. When applied to data from the Ridgecrest region and Japan regions, this method showed superior performance over previous deep learning-based phase-picking and localization methods. Overall, our stu",
    "link": "http://arxiv.org/abs/2306.13918",
    "context": "Title: Multi-task multi-station earthquake monitoring: An all-in-one seismic Phase picking, Location, and Association Network (PLAN). (arXiv:2306.13918v1 [physics.geo-ph])\nAbstract: Earthquake monitoring is vital for understanding the physics of earthquakes and assessing seismic hazards. A standard monitoring workflow includes the interrelated and interdependent tasks of phase picking, association, and location. Although deep learning methods have been successfully applied to earthquake monitoring, they mostly address the tasks separately and ignore the geographic relationships among stations. Here, we propose a graph neural network that operates directly on multi-station seismic data and achieves simultaneous phase picking, association, and location. Particularly, the inter-station and inter-task physical relationships are informed in the network architecture to promote accuracy, interpretability, and physical consistency among cross-station and cross-task predictions. When applied to data from the Ridgecrest region and Japan regions, this method showed superior performance over previous deep learning-based phase-picking and localization methods. Overall, our stu",
    "path": "papers/23/06/2306.13918.json",
    "total_tokens": 929,
    "translated_title": "多任务多站地震监测：一种全能的地震相位拾取、定位和关联网络（PLAN）",
    "translated_abstract": "地震监测对于理解地震物理和评估地震危害至关重要。标准的监测工作流包括相位拾取、关联和定位这些相互关联、相互依赖的任务。虽然深度学习方法已成功应用于地震监测，但它们大多分别解决不同的任务，并忽略了站之间的地理关系。在这里，我们提出了一种直接在多站地震数据上操作的图神经网络，实现了同时进行相位拾取、关联和定位。特别地，这个网络结构中考虑了站点之间和任务之间的物理关系，以促进交叉站点和交叉任务预测的准确性、可解释性和物理一致性。在对Ridgecrest区域和日本地区的数据应用时，该方法表现出比先前基于深度学习的相位拾取和定位方法更优秀的性能。总的来说，我们的研究提供了一种通用的地震监测解决方案。",
    "tldr": "这项研究提出了一种使用图神经网络直接处理多站地震数据，实现同时进行相位拾取、关联和定位的方法，结合了站之间和任务之间的物理关系，在对比数据后证明具有较高的性能表现。",
    "en_tdlr": "This study proposes an all-in-one graph neural network for multi-station seismic data that achieves simultaneous phase picking, association, and location while considering both the inter-station and inter-task physical relationships, and shows superior performance compared to previous deep learning-based methods in Ridgecrest and Japan regions."
}