{
    "title": "DeepScribe: Localization and Classification of Elamite Cuneiform Signs Via Deep Learning. (arXiv:2306.01268v1 [cs.CV])",
    "abstract": "Twenty-five hundred years ago, the paperwork of the Achaemenid Empire was recorded on clay tablets. In 1933, archaeologists from the University of Chicago's Oriental Institute (OI) found tens of thousands of these tablets and fragments during the excavation of Persepolis. Many of these tablets have been painstakingly photographed and annotated by expert cuneiformists, and now provide a rich dataset consisting of over 5,000 annotated tablet images and 100,000 cuneiform sign bounding boxes. We leverage this dataset to develop DeepScribe, a modular computer vision pipeline capable of localizing cuneiform signs and providing suggestions for the identity of each sign. We investigate the difficulty of learning subtasks relevant to cuneiform tablet transcription on ground-truth data, finding that a RetinaNet object detector can achieve a localization mAP of 0.78 and a ResNet classifier can achieve a top-5 sign classification accuracy of 0.89. The end-to-end pipeline achieves a top-5 classific",
    "link": "http://arxiv.org/abs/2306.01268",
    "context": "Title: DeepScribe: Localization and Classification of Elamite Cuneiform Signs Via Deep Learning. (arXiv:2306.01268v1 [cs.CV])\nAbstract: Twenty-five hundred years ago, the paperwork of the Achaemenid Empire was recorded on clay tablets. In 1933, archaeologists from the University of Chicago's Oriental Institute (OI) found tens of thousands of these tablets and fragments during the excavation of Persepolis. Many of these tablets have been painstakingly photographed and annotated by expert cuneiformists, and now provide a rich dataset consisting of over 5,000 annotated tablet images and 100,000 cuneiform sign bounding boxes. We leverage this dataset to develop DeepScribe, a modular computer vision pipeline capable of localizing cuneiform signs and providing suggestions for the identity of each sign. We investigate the difficulty of learning subtasks relevant to cuneiform tablet transcription on ground-truth data, finding that a RetinaNet object detector can achieve a localization mAP of 0.78 and a ResNet classifier can achieve a top-5 sign classification accuracy of 0.89. The end-to-end pipeline achieves a top-5 classific",
    "path": "papers/23/06/2306.01268.json",
    "total_tokens": 919,
    "translated_abstract": "2500年前，波斯帝国的 paperwork 被记录在粘土板上。1933年，芝加哥大学东方研究所（OI）的考古学家在波斯波利斯的挖掘中发现了成千上万的这些牌和碎片。其中许多牌已被熟练的楔形文字专家精心拍摄和注释，现在提供了一个包含超过5000个注释牌和100,000个楔形文字标志边界框的丰富数据集。我们利用这个数据集开发了 DeepScribe，一个模块化的计算机视觉流水线，能够定位楔形文字标志并为每个标志提供身份建议。我们研究了学习与楔形文字板的转录相关的子任务的困难程度，并发现 RetinaNet 对象检测器可以实现 0.78 的位置标准平均精确度（mAP）和 ResNet 分类器可以实现 0.89 的 top-5 标志分类准确性。端到端流水线实现了一个 top-5 分类准确度为 0.75 的分类器。",
    "tldr": "DeepScribe是一个计算机视觉项目，可以定位楔形文字标志并提供标志的身份建议，该项目在楔形文字转录中具有重要作用。",
    "en_tdlr": "DeepScribe is a computer vision project that can localize cuneiform signs and provide identity suggestions for each sign, playing an important role in cuneiform transcription."
}