{
    "title": "Precision Anti-Cancer Drug Selection via Neural Ranking. (arXiv:2306.17771v1 [cs.LG])",
    "abstract": "Personalized cancer treatment requires a thorough understanding of complex interactions between drugs and cancer cell lines in varying genetic and molecular contexts. To address this, high-throughput screening has been used to generate large-scale drug response data, facilitating data-driven computational models. Such models can capture complex drug-cell line interactions across various contexts in a fully data-driven manner. However, accurately prioritizing the most sensitive drugs for each cell line still remains a significant challenge. To address this, we developed neural ranking approaches that leverage large-scale drug response data across multiple cell lines from diverse cancer types. Unlike existing approaches that primarily utilize regression and classification techniques for drug response prediction, we formulated the objective of drug selection and prioritization as a drug ranking problem. In this work, we proposed two neural listwise ranking methods that learn latent repres",
    "link": "http://arxiv.org/abs/2306.17771",
    "context": "Title: Precision Anti-Cancer Drug Selection via Neural Ranking. (arXiv:2306.17771v1 [cs.LG])\nAbstract: Personalized cancer treatment requires a thorough understanding of complex interactions between drugs and cancer cell lines in varying genetic and molecular contexts. To address this, high-throughput screening has been used to generate large-scale drug response data, facilitating data-driven computational models. Such models can capture complex drug-cell line interactions across various contexts in a fully data-driven manner. However, accurately prioritizing the most sensitive drugs for each cell line still remains a significant challenge. To address this, we developed neural ranking approaches that leverage large-scale drug response data across multiple cell lines from diverse cancer types. Unlike existing approaches that primarily utilize regression and classification techniques for drug response prediction, we formulated the objective of drug selection and prioritization as a drug ranking problem. In this work, we proposed two neural listwise ranking methods that learn latent repres",
    "path": "papers/23/06/2306.17771.json",
    "total_tokens": 825,
    "translated_title": "通过神经排序实现精确的抗癌药物选择",
    "translated_abstract": "个性化癌症治疗需要对药物与癌细胞系在不同的遗传和分子环境中的复杂相互作用有深入的理解。为了解决这个问题，高通量筛选已被用来生成大规模的药物反应数据，促进数据驱动的计算模型。这些模型可以完全以数据驱动的方式捕捉到不同环境下复杂的药物-细胞系相互作用。然而，准确地为每个细胞系优先选择最敏感的药物仍然是一个重大挑战。为了解决这个问题，我们开发了神经排序方法，利用来自不同癌症类型的多个细胞系的大规模药物反应数据。与现有方法主要使用回归和分类技术进行药物反应预测不同，我们将药物选择和优先级确定的目标形式化为一个药物排序问题。在这项工作中，我们提出了两种神经排序方法，可以学习潜在的表示来解决这个问题。",
    "tldr": "通过神经排序方法，准确选择和优先排序敏感药物来进行个性化抗癌治疗。",
    "en_tdlr": "Precision anti-cancer drug selection is achieved by neural ranking methods, allowing accurate selection and prioritization of sensitive drugs for personalized cancer treatment."
}