{
    "title": "Habits of Mind: Reusing Action Sequences for Efficient Planning. (arXiv:2306.05298v1 [cs.AI])",
    "abstract": "When we exercise sequences of actions, their execution becomes more fluent and precise. Here, we consider the possibility that exercised action sequences can also be used to make planning faster and more accurate by focusing expansion of the search tree on paths that have been frequently used in the past, and by reducing deep planning problems to shallow ones via multi-step jumps in the tree. To capture such sequences, we use a flexible Bayesian action chunking mechanism which finds and exploits statistically reliable structure at different scales. This gives rise to shorter or longer routines that can be embedded into a Monte-Carlo tree search planner. We show the benefits of this scheme using a physical construction task patterned after tangrams.",
    "link": "http://arxiv.org/abs/2306.05298",
    "context": "Title: Habits of Mind: Reusing Action Sequences for Efficient Planning. (arXiv:2306.05298v1 [cs.AI])\nAbstract: When we exercise sequences of actions, their execution becomes more fluent and precise. Here, we consider the possibility that exercised action sequences can also be used to make planning faster and more accurate by focusing expansion of the search tree on paths that have been frequently used in the past, and by reducing deep planning problems to shallow ones via multi-step jumps in the tree. To capture such sequences, we use a flexible Bayesian action chunking mechanism which finds and exploits statistically reliable structure at different scales. This gives rise to shorter or longer routines that can be embedded into a Monte-Carlo tree search planner. We show the benefits of this scheme using a physical construction task patterned after tangrams.",
    "path": "papers/23/06/2306.05298.json",
    "total_tokens": 812,
    "translated_title": "思维习惯：重复利用行动序列进行高效规划",
    "translated_abstract": "当我们执行一系列动作时，它们的执行变得更加流畅和精确。在这里，我们考虑了已经练习过的行动序列也可以通过聚焦于过去经常使用的路径来加速和提高规划的准确性，通过树中的多步跳跃将深层规划问题缩小为浅层问题。为了捕捉这样的序列，我们使用了一个灵活的贝叶斯行动分块机制，该机制在不同的尺度上找到和利用了统计上可靠的结构。这产生了可以嵌入到蒙特卡罗树搜索规划器中的更短或更长的常规程序。我们使用类似七巧板的物理构造任务展示了这种方案的优点。",
    "tldr": "该论文提出了一种灵活的贝叶斯行动分块机制，通过充分利用经过练习的行动序列来加速和提高规划的准确性，可嵌入蒙特卡罗树搜索规划器中。在物理构造任务上的实验结果表明了该方案的优点。",
    "en_tdlr": "The paper proposes a flexible Bayesian action chunking mechanism to capture exercised action sequences for faster and more accurate planning, which can be embedded in a Monte-Carlo tree search planner. The benefits of this scheme are demonstrated in a physical construction task patterned after tangrams."
}