{
    "title": "Origin-Destination Network Generation via Gravity-Guided GAN. (arXiv:2306.03390v1 [cs.LG])",
    "abstract": "Origin-destination (OD) flow, which contains valuable population mobility information including direction and volume, is critical in many urban applications, such as urban planning, transportation management, etc. However, OD data is not always easy to access due to high costs or privacy concerns. Therefore, we must consider generating OD through mathematical models. Existing works utilize physics laws or machine learning (ML) models to build the association between urban structures and OD flows while these two kinds of methods suffer from the limitation of over-simplicity and poor generalization ability, respectively. In this paper, we propose to adopt physics-informed ML paradigm, which couple the physics scientific knowledge and data-driven ML methods, to construct a model named Origin-Destination Generation Networks (ODGN) for better population mobility modeling by leveraging the complementary strengths of combining physics and ML methods. Specifically, we first build a Multi-view ",
    "link": "http://arxiv.org/abs/2306.03390",
    "context": "Title: Origin-Destination Network Generation via Gravity-Guided GAN. (arXiv:2306.03390v1 [cs.LG])\nAbstract: Origin-destination (OD) flow, which contains valuable population mobility information including direction and volume, is critical in many urban applications, such as urban planning, transportation management, etc. However, OD data is not always easy to access due to high costs or privacy concerns. Therefore, we must consider generating OD through mathematical models. Existing works utilize physics laws or machine learning (ML) models to build the association between urban structures and OD flows while these two kinds of methods suffer from the limitation of over-simplicity and poor generalization ability, respectively. In this paper, we propose to adopt physics-informed ML paradigm, which couple the physics scientific knowledge and data-driven ML methods, to construct a model named Origin-Destination Generation Networks (ODGN) for better population mobility modeling by leveraging the complementary strengths of combining physics and ML methods. Specifically, we first build a Multi-view ",
    "path": "papers/23/06/2306.03390.json",
    "total_tokens": 815,
    "translated_title": "通过引力导向的GAN生成起始-目的地网络",
    "translated_abstract": "起始-目的地（OD）流包含有价值的人口迁移信息，包括方向和体积，在许多城市应用中至关重要，例如城市规划，交通管理等。然而，由于高成本或隐私问题，OD数据并不总是易于获得。因此，我们必须考虑通过数学模型生成OD。现有的方法利用物理定律或机器学习（ML）模型来构建城市结构和OD流之间的关联性，这两种方法分别受到过度简化和较差的泛化能力的限制。本文提出采用物理知识和数据驱动的ML方法相结合的物理知识驱动ML范式，构建了一种名为Origin-Destination Generation Networks（ODGN）的模型，通过利用物理和ML方法的互补优势来实现更好地人口流动建模。具体而言，我们首先建立一个多视图模型",
    "tldr": "本文结合物理科学知识和数据驱动的ML方法，提出了一种名为ODGN的模型来生成起始-目的地网络，以更好地进行人口流动建模。",
    "en_tdlr": "This paper proposes a model named ODGN to generate origin-destination networks for better population mobility modeling by combining physics scientific knowledge and data-driven ML methods."
}