{
    "title": "Fast Diffusion Model. (arXiv:2306.06991v2 [cs.CV] UPDATED)",
    "abstract": "Diffusion models (DMs) have been adopted across diverse fields with its remarkable abilities in capturing intricate data distributions. In this paper, we propose a Fast Diffusion Model (FDM) to significantly speed up DMs from a stochastic optimization perspective for both faster training and sampling. We first find that the diffusion process of DMs accords with the stochastic optimization process of stochastic gradient descent (SGD) on a stochastic time-variant problem. Then, inspired by momentum SGD that uses both gradient and an extra momentum to achieve faster and more stable convergence than SGD, we integrate momentum into the diffusion process of DMs. This comes with a unique challenge of deriving the noise perturbation kernel from the momentum-based diffusion process. To this end, we frame the process as a Damped Oscillation system whose critically damped state -- the kernel solution -avoids oscillation and yields a faster convergence speed of the diffusion process. Empirical r",
    "link": "http://arxiv.org/abs/2306.06991",
    "context": "Title: Fast Diffusion Model. (arXiv:2306.06991v2 [cs.CV] UPDATED)\nAbstract: Diffusion models (DMs) have been adopted across diverse fields with its remarkable abilities in capturing intricate data distributions. In this paper, we propose a Fast Diffusion Model (FDM) to significantly speed up DMs from a stochastic optimization perspective for both faster training and sampling. We first find that the diffusion process of DMs accords with the stochastic optimization process of stochastic gradient descent (SGD) on a stochastic time-variant problem. Then, inspired by momentum SGD that uses both gradient and an extra momentum to achieve faster and more stable convergence than SGD, we integrate momentum into the diffusion process of DMs. This comes with a unique challenge of deriving the noise perturbation kernel from the momentum-based diffusion process. To this end, we frame the process as a Damped Oscillation system whose critically damped state -- the kernel solution -avoids oscillation and yields a faster convergence speed of the diffusion process. Empirical r",
    "path": "papers/23/06/2306.06991.json",
    "total_tokens": 909,
    "translated_title": "快速扩散模型",
    "translated_abstract": "扩散模型（DMs）以其在捕捉复杂数据分布方面的显著能力，被广泛应用于各个领域。在本文中，我们提出了一种快速扩散模型（FDM），从随机优化的角度显著加速DMs的训练和采样过程。我们首先发现DMs的扩散过程与随机梯度下降（SGD）的随机时变问题的随机优化过程相符合。然后，受到动量SGD的启发，该方法使用梯度和额外的动量，以实现比SGD更快和更稳定的收敛，我们将动量集成到DMs的扩散过程中。这带来了一个独特的挑战，即从基于动量的扩散过程中导出噪声扰动核。为此，我们将这个过程构建为一个阻尼振荡系统，临界阻尼状态-核解决方案-避免振荡，使扩散过程的收敛速度更快。实验证明，FDM在加速训练和采样过程方面取得了显著效果。",
    "tldr": "本文提出了一种快速扩散模型（FDM），通过将动量集成到扩散过程中，显著加速了扩散模型（DMs）的训练和采样过程。",
    "en_tdlr": "This paper proposes a Fast Diffusion Model (FDM) that significantly speeds up the training and sampling process of Diffusion Models (DMs) by integrating momentum into the diffusion process."
}