{
    "title": "iPDP: On Partial Dependence Plots in Dynamic Modeling Scenarios. (arXiv:2306.07775v1 [cs.LG])",
    "abstract": "Post-hoc explanation techniques such as the well-established partial dependence plot (PDP), which investigates feature dependencies, are used in explainable artificial intelligence (XAI) to understand black-box machine learning models. While many real-world applications require dynamic models that constantly adapt over time and react to changes in the underlying distribution, XAI, so far, has primarily considered static learning environments, where models are trained in a batch mode and remain unchanged. We thus propose a novel model-agnostic XAI framework called incremental PDP (iPDP) that extends on the PDP to extract time-dependent feature effects in non-stationary learning environments. We formally analyze iPDP and show that it approximates a time-dependent variant of the PDP that properly reacts to real and virtual concept drift. The time-sensitivity of iPDP is controlled by a single smoothing parameter, which directly corresponds to the variance and the approximation error of iPD",
    "link": "http://arxiv.org/abs/2306.07775",
    "context": "Title: iPDP: On Partial Dependence Plots in Dynamic Modeling Scenarios. (arXiv:2306.07775v1 [cs.LG])\nAbstract: Post-hoc explanation techniques such as the well-established partial dependence plot (PDP), which investigates feature dependencies, are used in explainable artificial intelligence (XAI) to understand black-box machine learning models. While many real-world applications require dynamic models that constantly adapt over time and react to changes in the underlying distribution, XAI, so far, has primarily considered static learning environments, where models are trained in a batch mode and remain unchanged. We thus propose a novel model-agnostic XAI framework called incremental PDP (iPDP) that extends on the PDP to extract time-dependent feature effects in non-stationary learning environments. We formally analyze iPDP and show that it approximates a time-dependent variant of the PDP that properly reacts to real and virtual concept drift. The time-sensitivity of iPDP is controlled by a single smoothing parameter, which directly corresponds to the variance and the approximation error of iPD",
    "path": "papers/23/06/2306.07775.json",
    "total_tokens": 884,
    "tldr": "提出了一种新型的模型无关XAI框架——增量PDP(iPDP)，它可以在非平稳学习环境中提取时变特征影响，并且通过单一平滑参数控制时间敏感性。"
}