{
    "title": "Beyond Chemical Language: A Multimodal Approach to Enhance Molecular Property Prediction. (arXiv:2306.14919v1 [physics.chem-ph])",
    "abstract": "We present a novel multimodal language model approach for predicting molecular properties by combining chemical language representation with physicochemical features. Our approach, MULTIMODAL-MOLFORMER, utilizes a causal multistage feature selection method that identifies physicochemical features based on their direct causal effect on a specific target property. These causal features are then integrated with the vector space generated by molecular embeddings from MOLFORMER. In particular, we employ Mordred descriptors as physicochemical features and identify the Markov blanket of the target property, which theoretically contains the most relevant features for accurate prediction. Our results demonstrate a superior performance of our proposed approach compared to existing state-of-the-art algorithms, including the chemical language-based MOLFORMER and graph neural networks, in predicting complex tasks such as biodegradability and PFAS toxicity estimation. Moreover, we demonstrate the ef",
    "link": "http://arxiv.org/abs/2306.14919",
    "context": "Title: Beyond Chemical Language: A Multimodal Approach to Enhance Molecular Property Prediction. (arXiv:2306.14919v1 [physics.chem-ph])\nAbstract: We present a novel multimodal language model approach for predicting molecular properties by combining chemical language representation with physicochemical features. Our approach, MULTIMODAL-MOLFORMER, utilizes a causal multistage feature selection method that identifies physicochemical features based on their direct causal effect on a specific target property. These causal features are then integrated with the vector space generated by molecular embeddings from MOLFORMER. In particular, we employ Mordred descriptors as physicochemical features and identify the Markov blanket of the target property, which theoretically contains the most relevant features for accurate prediction. Our results demonstrate a superior performance of our proposed approach compared to existing state-of-the-art algorithms, including the chemical language-based MOLFORMER and graph neural networks, in predicting complex tasks such as biodegradability and PFAS toxicity estimation. Moreover, we demonstrate the ef",
    "path": "papers/23/06/2306.14919.json",
    "total_tokens": 919,
    "translated_title": "超越化学语言: 一种增强分子性质预测的多模态方法",
    "translated_abstract": "我们提出了一种新颖的多模态语言模型方法，通过将化学语言表示与物理化学特征相结合，用于预测分子性质。我们的方法MULTIMODAL-MOLFORMER采用因果多阶段特征选择方法，根据其对特定目标性质的直接因果效应来识别物理化学特征。然后，这些因果特征与由MOLFORMER生成的分子嵌入向量空间相结合。特别是，我们使用Mordred描述符作为物理化学特征，并识别目标性质的马尔可夫毯，理论上包含最相关的特征以实现准确预测。我们的结果表明，与现有的业界领先算法（包括基于化学语言的MOLFORMER和图神经网络）相比，我们提出的方法在预测生物降解性和PFAS毒性评估等复杂任务中表现出卓越的性能。",
    "tldr": "一种多模态方法用于预测分子性质，结合了化学语言表示和物理化学特征，通过因果特征选择和分子嵌入向量空间的集成来实现准确预测。相比现有算法，该方法在生物降解性和PFAS毒性评估等复杂任务中表现出卓越性能。"
}