{
    "title": "Learning CO$_2$ plume migration in faulted reservoirs with Graph Neural Networks. (arXiv:2306.09648v1 [cs.LG])",
    "abstract": "Deep-learning-based surrogate models provide an efficient complement to numerical simulations for subsurface flow problems such as CO$_2$ geological storage. Accurately capturing the impact of faults on CO$_2$ plume migration remains a challenge for many existing deep learning surrogate models based on Convolutional Neural Networks (CNNs) or Neural Operators. We address this challenge with a graph-based neural model leveraging recent developments in the field of Graph Neural Networks (GNNs). Our model combines graph-based convolution Long-Short-Term-Memory (GConvLSTM) with a one-step GNN model, MeshGraphNet (MGN), to operate on complex unstructured meshes and limit temporal error accumulation. We demonstrate that our approach can accurately predict the temporal evolution of gas saturation and pore pressure in a synthetic reservoir with impermeable faults. Our results exhibit a better accuracy and a reduced temporal error accumulation compared to the standard MGN model. We also show the",
    "link": "http://arxiv.org/abs/2306.09648",
    "context": "Title: Learning CO$_2$ plume migration in faulted reservoirs with Graph Neural Networks. (arXiv:2306.09648v1 [cs.LG])\nAbstract: Deep-learning-based surrogate models provide an efficient complement to numerical simulations for subsurface flow problems such as CO$_2$ geological storage. Accurately capturing the impact of faults on CO$_2$ plume migration remains a challenge for many existing deep learning surrogate models based on Convolutional Neural Networks (CNNs) or Neural Operators. We address this challenge with a graph-based neural model leveraging recent developments in the field of Graph Neural Networks (GNNs). Our model combines graph-based convolution Long-Short-Term-Memory (GConvLSTM) with a one-step GNN model, MeshGraphNet (MGN), to operate on complex unstructured meshes and limit temporal error accumulation. We demonstrate that our approach can accurately predict the temporal evolution of gas saturation and pore pressure in a synthetic reservoir with impermeable faults. Our results exhibit a better accuracy and a reduced temporal error accumulation compared to the standard MGN model. We also show the",
    "path": "papers/23/06/2306.09648.json",
    "total_tokens": 942,
    "translated_title": "基于图神经网络学习断层储层中CO$_2$气云迁移",
    "translated_abstract": "基于深度学习的代理模型是地下流动问题（如CO$_2$地质储存）的数值模拟的有效补充。然而，如何准确地捕捉断层对CO$_2$气云迁移的影响，仍是许多现有基于卷积神经网络（CNN）或神经算子(Neural Operators)深度学习代理模型的挑战。我们提出了一种基于图神经网络（GNN）领域最新发展的图卷积长时记忆（GConvLSTM）和一个单步GNN模型（MeshGraphNet(MGN)）相结合的图神经模型，以对复杂的非结构化网格进行操作，限制时间误差累计。在一个具有不透水断层的合成储层中，我们证明了我们的方法可以准确预测气体饱和度和孔隙压力的时间演化。与标准MGN模型相比，我们的结果表现出更好的准确性和减少的时间误差积累。",
    "tldr": "提出一种基于图神经网络的模型，准确预测了非结构化合成储层中CO$_2$气云的时间演化，相比标准模型具有更好的准确性和减少的时间误差积累。",
    "en_tdlr": "A graph-based neural model leveraging recent developments in the field of Graph Neural Networks (GNNs) accurately predicts the temporal evolution of gas saturation and pore pressure in a synthetic reservoir with impermeable faults, exhibiting a better accuracy and a reduced temporal error accumulation compared to the standard MGN model."
}