{
    "title": "CEIL: Generalized Contextual Imitation Learning. (arXiv:2306.14534v2 [cs.LG] UPDATED)",
    "abstract": "In this paper, we present \\textbf{C}ont\\textbf{E}xtual \\textbf{I}mitation \\textbf{L}earning~(CEIL), a general and broadly applicable algorithm for imitation learning (IL). Inspired by the formulation of hindsight information matching, we derive CEIL by explicitly learning a hindsight embedding function together with a contextual policy using the hindsight embeddings. To achieve the expert matching objective for IL, we advocate for optimizing a contextual variable such that it biases the contextual policy towards mimicking expert behaviors. Beyond the typical learning from demonstrations (LfD) setting, CEIL is a generalist that can be effectively applied to multiple settings including: 1)~learning from observations (LfO), 2)~offline IL, 3)~cross-domain IL (mismatched experts), and 4) one-shot IL settings. Empirically, we evaluate CEIL on the popular MuJoCo tasks (online) and the D4RL dataset (offline). Compared to prior state-of-the-art baselines, we show that CEIL is more sample-effici",
    "link": "http://arxiv.org/abs/2306.14534",
    "context": "Title: CEIL: Generalized Contextual Imitation Learning. (arXiv:2306.14534v2 [cs.LG] UPDATED)\nAbstract: In this paper, we present \\textbf{C}ont\\textbf{E}xtual \\textbf{I}mitation \\textbf{L}earning~(CEIL), a general and broadly applicable algorithm for imitation learning (IL). Inspired by the formulation of hindsight information matching, we derive CEIL by explicitly learning a hindsight embedding function together with a contextual policy using the hindsight embeddings. To achieve the expert matching objective for IL, we advocate for optimizing a contextual variable such that it biases the contextual policy towards mimicking expert behaviors. Beyond the typical learning from demonstrations (LfD) setting, CEIL is a generalist that can be effectively applied to multiple settings including: 1)~learning from observations (LfO), 2)~offline IL, 3)~cross-domain IL (mismatched experts), and 4) one-shot IL settings. Empirically, we evaluate CEIL on the popular MuJoCo tasks (online) and the D4RL dataset (offline). Compared to prior state-of-the-art baselines, we show that CEIL is more sample-effici",
    "path": "papers/23/06/2306.14534.json",
    "total_tokens": 1055,
    "translated_title": "CEIL: 广义上下文模仿学习",
    "translated_abstract": "在本文中，我们提出了CEIL（广义上下文模仿学习），这是一种通用且广泛适用的模仿学习算法。受到后见信息匹配的形式化启发，我们通过显式学习一种后见嵌入函数以及使用后见嵌入的上下文策略，得到了CEIL。为了实现模仿学习的专家匹配目标，我们提倡优化一种上下文变量，使其偏向于模仿专家行为的上下文策略。除了典型的示范学习（LfD）设置外，CEIL还是一个通用的算法，可有效应用于多种设置，包括：1）从观测中学习（LfO），2）离线模仿学习，3）跨领域模仿学习（不匹配的专家）和4）一次模仿学习设置。在实证方面，我们在流行的MuJoCo任务（在线）和D4RL数据集（离线）上评估CEIL。与先前的最先进基准相比，我们展示了CEIL的更高样本效率。",
    "tldr": "CEIL是一种通用的广义模仿学习算法，通过学习后见嵌入函数和上下文策略来实现模仿学习的专家匹配目标。它能够适用于多种学习设置，包括从观测中学习、离线模仿学习、跨领域模仿学习和一次模仿学习设置。实验表明，CEIL相比之前的基准算法具有更高的样本效率。",
    "en_tdlr": "CEIL is a general and versatile algorithm for imitation learning that achieves expert matching objective by learning a hindsight embedding function and a contextual policy. It can be applied to multiple learning settings, including learning from observations, offline imitation learning, cross-domain imitation learning, and one-shot imitation learning. Experimental results demonstrate that CEIL is more sample-efficient compared to prior state-of-the-art baselines."
}