{
    "title": "Provably Efficient Offline Reinforcement Learning with Perturbed Data Sources. (arXiv:2306.08364v1 [stat.ML])",
    "abstract": "Existing theoretical studies on offline reinforcement learning (RL) mostly consider a dataset sampled directly from the target task. In practice, however, data often come from several heterogeneous but related sources. Motivated by this gap, this work aims at rigorously understanding offline RL with multiple datasets that are collected from randomly perturbed versions of the target task instead of from itself. An information-theoretic lower bound is derived, which reveals a necessary requirement on the number of involved sources in addition to that on the number of data samples. Then, a novel HetPEVI algorithm is proposed, which simultaneously considers the sample uncertainties from a finite number of data samples per data source and the source uncertainties due to a finite number of available data sources. Theoretical analyses demonstrate that HetPEVI can solve the target task as long as the data sources collectively provide a good data coverage. Moreover, HetPEVI is demonstrated to b",
    "link": "http://arxiv.org/abs/2306.08364",
    "context": "Title: Provably Efficient Offline Reinforcement Learning with Perturbed Data Sources. (arXiv:2306.08364v1 [stat.ML])\nAbstract: Existing theoretical studies on offline reinforcement learning (RL) mostly consider a dataset sampled directly from the target task. In practice, however, data often come from several heterogeneous but related sources. Motivated by this gap, this work aims at rigorously understanding offline RL with multiple datasets that are collected from randomly perturbed versions of the target task instead of from itself. An information-theoretic lower bound is derived, which reveals a necessary requirement on the number of involved sources in addition to that on the number of data samples. Then, a novel HetPEVI algorithm is proposed, which simultaneously considers the sample uncertainties from a finite number of data samples per data source and the source uncertainties due to a finite number of available data sources. Theoretical analyses demonstrate that HetPEVI can solve the target task as long as the data sources collectively provide a good data coverage. Moreover, HetPEVI is demonstrated to b",
    "path": "papers/23/06/2306.08364.json",
    "total_tokens": 847,
    "translated_title": "通过扰动数据源可证明高效的离线强化学习",
    "translated_abstract": "现有关于离线强化学习的理论研究大多考虑的是从目标任务直接采样得到的数据集。然而，在实践中，数据经常来自于几个异构但相关的源。鉴于这一差距，本文旨在通过从被随机扰动版本的目标任务中收集多个数据集，从而更严格地理解离线强化学习。我们推导出了一个信息论下界，揭示了一个除了数据样本数量之外对所涉及的源数量的必要要求。然后，我们提出了一种新的算法——HetPEVI，它同时考虑来自每个数据源的有限数量的数据样本的样本不确定性以及由于有限数量的可用数据源而产生的源不确定性。理论分析表明，只要数据源共同提供了良好的数据覆盖率，HetPEVI就能解决目标任务。此外，HetPEVI被证明是可行的且效率高的。",
    "tldr": "本文讨论了用于离线强化学习中的多数据源问题，提出了HetPEVI算法，并证明了其在数据覆盖率高的情况下可行且有效。",
    "en_tdlr": "This paper discusses the problem of multiple data sources in offline reinforcement learning, proposes the HetPEVI algorithm, and proves its feasibility and effectiveness in the case of high data coverage."
}