{
    "title": "Message-passing selection: Towards interpretable GNNs for graph classification. (arXiv:2306.02081v2 [cs.LG] UPDATED)",
    "abstract": "In this paper, we strive to develop an interpretable GNNs' inference paradigm, termed MSInterpreter, which can serve as a plug-and-play scheme readily applicable to various GNNs' baselines. Unlike the most existing explanation methods, MSInterpreter provides a Message-passing Selection scheme(MSScheme) to select the critical paths for GNNs' message aggregations, which aims at reaching the self-explaination instead of post-hoc explanations. In detail, the elaborate MSScheme is designed to calculate weight factors of message aggregation paths by considering the vanilla structure and node embedding components, where the structure base aims at weight factors among node-induced substructures; on the other hand, the node embedding base focuses on weight factors via node embeddings obtained by one-layer GNN.Finally, we demonstrate the effectiveness of our approach on graph classification benchmarks.",
    "link": "http://arxiv.org/abs/2306.02081",
    "context": "Title: Message-passing selection: Towards interpretable GNNs for graph classification. (arXiv:2306.02081v2 [cs.LG] UPDATED)\nAbstract: In this paper, we strive to develop an interpretable GNNs' inference paradigm, termed MSInterpreter, which can serve as a plug-and-play scheme readily applicable to various GNNs' baselines. Unlike the most existing explanation methods, MSInterpreter provides a Message-passing Selection scheme(MSScheme) to select the critical paths for GNNs' message aggregations, which aims at reaching the self-explaination instead of post-hoc explanations. In detail, the elaborate MSScheme is designed to calculate weight factors of message aggregation paths by considering the vanilla structure and node embedding components, where the structure base aims at weight factors among node-induced substructures; on the other hand, the node embedding base focuses on weight factors via node embeddings obtained by one-layer GNN.Finally, we demonstrate the effectiveness of our approach on graph classification benchmarks.",
    "path": "papers/23/06/2306.02081.json",
    "total_tokens": 879,
    "translated_title": "信息传递选择：面向图分类的可解释GNN的研究",
    "translated_abstract": "本文致力于开发一个可解释的GNN推理范式，称为MSInterpreter，它可以作为即插即用的方案轻松应用于各种GNN基线。与大多数现有的解释方法不同，MSInterpreter提供了一种消息传递选择方案(MSScheme)，以选择GNN的关键路径进行消息聚合，旨在实现自我解释而不是事后解释。具体而言，精心设计的MSScheme的目的是通过考虑香草结构和节点嵌入组件来计算消息聚合路径的权重因子，其中结构基旨在权衡节点引起的子结构之间的权重因子；另一方面，节点嵌入基着眼于通过单层GNN获得的节点嵌入来计算权重因子。最后，我们在图分类基准测试中展示了这种方法的有效性。",
    "tldr": "本文提出了一种可解释的GNN推理范式MSInterpreter，其中包括消息传递选择方案(MSScheme)，通过计算由结构和节点嵌入组成的消息聚合路径的权重因子，实现对GNN自我解释。在图分类基准测试中表明其有效性。",
    "en_tdlr": "This paper proposes an interpretable GNNs' inference paradigm, MSInterpreter, with a Message-passing Selection scheme (MSScheme) for GNNs' message aggregations, which aims at self-explanation instead of post-hoc explanations. The approach calculates weight factors of message aggregation paths by considering the vanilla structure and node embedding components, and demonstrates its effectiveness on graph classification benchmarks."
}