{
    "title": "Dual Node and Edge Fairness-Aware Graph Partition. (arXiv:2306.10123v2 [cs.SI] UPDATED)",
    "abstract": "Fair graph partition of social networks is a crucial step toward ensuring fair and non-discriminatory treatments in unsupervised user analysis. Current fair partition methods typically consider node balance, a notion pursuing a proportionally balanced number of nodes from all demographic groups, but ignore the bias induced by imbalanced edges in each cluster. To address this gap, we propose a notion edge balance to measure the proportion of edges connecting different demographic groups in clusters. We analyze the relations between node balance and edge balance, then with line graph transformations, we propose a co-embedding framework to learn dual node and edge fairness-aware representations for graph partition. We validate our framework through several social network datasets and observe balanced partition in terms of both nodes and edges along with good utility. Moreover, we demonstrate our fair partition can be used as pseudo labels to facilitate graph neural networks to behave fair",
    "link": "http://arxiv.org/abs/2306.10123",
    "context": "Title: Dual Node and Edge Fairness-Aware Graph Partition. (arXiv:2306.10123v2 [cs.SI] UPDATED)\nAbstract: Fair graph partition of social networks is a crucial step toward ensuring fair and non-discriminatory treatments in unsupervised user analysis. Current fair partition methods typically consider node balance, a notion pursuing a proportionally balanced number of nodes from all demographic groups, but ignore the bias induced by imbalanced edges in each cluster. To address this gap, we propose a notion edge balance to measure the proportion of edges connecting different demographic groups in clusters. We analyze the relations between node balance and edge balance, then with line graph transformations, we propose a co-embedding framework to learn dual node and edge fairness-aware representations for graph partition. We validate our framework through several social network datasets and observe balanced partition in terms of both nodes and edges along with good utility. Moreover, we demonstrate our fair partition can be used as pseudo labels to facilitate graph neural networks to behave fair",
    "path": "papers/23/06/2306.10123.json",
    "total_tokens": 941,
    "translated_title": "双节点和边公平感知图分割",
    "translated_abstract": "对社交网络进行公平的图分割是确保无监督用户分析中的公正和非歧视待遇的关键步骤。当前的公平分割方法通常考虑节点平衡，即追求各个人口群体之间节点数量的比例平衡，但忽视了每个聚类中不平衡边所引起的偏差。为了解决这一问题，我们提出了边平衡的概念，用于衡量连接不同人口群体之间边的比例。我们分析了节点平衡和边平衡之间的关系，然后通过线图转换，提出了一个协嵌入框架，用于学习对图分割具有双重节点和边公平感知性的表示。我们通过多个社交网络数据集验证了我们的框架，并观察到在节点和边方面都具有平衡分割和良好效用。此外，我们证明了我们的公平分割可以用作伪标签，以促进图神经网络的公平行为。",
    "tldr": "这项论文提出了一种双节点和边公平感知的图分割方法，通过考虑节点平衡和边平衡来实现公平分割，并使用协嵌入框架学习表示。实验证明该方法在节点和边方面均具有平衡分割和良好效用，并可用作伪标签来促进图神经网络的公平行为。",
    "en_tdlr": "This paper proposes a method for dual node and edge fairness-aware graph partition, which achieves fair partition by considering node balance and edge balance and uses a co-embedding framework to learn representations. Experimental results demonstrate that the method achieves balanced partition in terms of both nodes and edges, and can be used as pseudo labels to facilitate fair behavior of graph neural networks."
}