{
    "title": "Sequential Graph Neural Networks for Source Code Vulnerability Identification. (arXiv:2306.05375v1 [cs.CR])",
    "abstract": "Vulnerability identification constitutes a task of high importance for cyber security. It is quite helpful for locating and fixing vulnerable functions in large applications. However, this task is rather challenging owing to the absence of reliable and adequately managed datasets and learning models. Existing solutions typically rely on human expertise to annotate datasets or specify features, which is prone to error. In addition, the learning models have a high rate of false positives. To bridge this gap, in this paper, we present a properly curated C/C++ source code vulnerability dataset, denoted as CVEFunctionGraphEmbeddings (CVEFGE), to aid in developing models. CVEFGE is automatically crawled from the CVE database, which contains authentic and publicly disclosed source code vulnerabilities. We also propose a learning framework based on graph neural networks, denoted SEquential Graph Neural Network (SEGNN) for learning a large number of code semantic representations. SEGNN consists",
    "link": "http://arxiv.org/abs/2306.05375",
    "context": "Title: Sequential Graph Neural Networks for Source Code Vulnerability Identification. (arXiv:2306.05375v1 [cs.CR])\nAbstract: Vulnerability identification constitutes a task of high importance for cyber security. It is quite helpful for locating and fixing vulnerable functions in large applications. However, this task is rather challenging owing to the absence of reliable and adequately managed datasets and learning models. Existing solutions typically rely on human expertise to annotate datasets or specify features, which is prone to error. In addition, the learning models have a high rate of false positives. To bridge this gap, in this paper, we present a properly curated C/C++ source code vulnerability dataset, denoted as CVEFunctionGraphEmbeddings (CVEFGE), to aid in developing models. CVEFGE is automatically crawled from the CVE database, which contains authentic and publicly disclosed source code vulnerabilities. We also propose a learning framework based on graph neural networks, denoted SEquential Graph Neural Network (SEGNN) for learning a large number of code semantic representations. SEGNN consists",
    "path": "papers/23/06/2306.05375.json",
    "total_tokens": 1089,
    "translated_title": "面向源代码漏洞识别的顺序图神经网络",
    "translated_abstract": "漏洞识别对于网络安全至关重要。在大型应用中查找和修复易受攻击的函数非常有帮助。然而，由于缺乏可靠和充分管理的数据集和学习模型，这项任务相当具有挑战性。现有的解决方案通常依赖于人类专业知识来注释数据集或指定特征，这容易出现错误。此外，学习模型具有较高的误报率。为了弥补这个差距，本文提出了一个经过适当策划的C/C++源代码漏洞数据集CVEFunctionGraphEmbeddings（CVEFGE），以帮助开发模型。CVEFGE自动从CVE数据库中爬取，其中包含真实和公开披露的源代码漏洞。我们还提出了一种基于图神经网络的学习框架，称为SEquential Graph Neural Network（SEGNN），用于学习大量代码语义表示。SEGNN由两个堆叠的图神经网络（GNN）解码器层组成，用于模拟源代码中函数的结构和语义信息。我们在公开数据集上评估了我们的模型，结果表明，我们的方法在准确性和F1得分方面优于现有最先进的方法。",
    "tldr": "本文提出了一个经过适当策划的 C/C++ 源代码漏洞数据集，以帮助开发模型，同时还提出了一种基于图神经网络的学习框架，称为 SEquential Graph Neural Network（SEGNN），用于学习大量代码语义表示。在公开数据集上的实验结果表明，SEGNN 方法在准确性和 F1得分方面优于现有最先进的方法。",
    "en_tdlr": "This paper proposes a properly curated C/C++ source code vulnerability dataset (CVEFGE) and a learning framework based on sequential graph neural networks (SEGNN) to aid in developing models for source code vulnerability identification. The SEGNN outperforms existing state-of-the-art methods in terms of accuracy and F1 score on a publicly available dataset."
}