{
    "title": "Novel Regression and Least Square Support Vector Machine Learning Technique for Air Pollution Forecasting. (arXiv:2306.07301v1 [cs.LG])",
    "abstract": "Air pollution is the origination of particulate matter, chemicals, or biological substances that brings pain to either humans or other living creatures or instigates discomfort to the natural habitat and the airspace. Hence, air pollution remains one of the paramount environmental issues as far as metropolitan cities are concerned. Several air pollution benchmarks are even said to have a negative influence on human health. Also, improper detection of air pollution benchmarks results in severe complications for humans and living creatures. To address this aspect, a novel technique called, Discretized Regression and Least Square Support Vector (DR-LSSV) based air pollution forecasting is proposed. The results indicate that the proposed DR-LSSV Technique can efficiently enhance air pollution forecasting performance and outperforms the conventional machine learning methods in terms of air pollution forecasting accuracy, air pollution forecasting time, and false positive rate.",
    "link": "http://arxiv.org/abs/2306.07301",
    "context": "Title: Novel Regression and Least Square Support Vector Machine Learning Technique for Air Pollution Forecasting. (arXiv:2306.07301v1 [cs.LG])\nAbstract: Air pollution is the origination of particulate matter, chemicals, or biological substances that brings pain to either humans or other living creatures or instigates discomfort to the natural habitat and the airspace. Hence, air pollution remains one of the paramount environmental issues as far as metropolitan cities are concerned. Several air pollution benchmarks are even said to have a negative influence on human health. Also, improper detection of air pollution benchmarks results in severe complications for humans and living creatures. To address this aspect, a novel technique called, Discretized Regression and Least Square Support Vector (DR-LSSV) based air pollution forecasting is proposed. The results indicate that the proposed DR-LSSV Technique can efficiently enhance air pollution forecasting performance and outperforms the conventional machine learning methods in terms of air pollution forecasting accuracy, air pollution forecasting time, and false positive rate.",
    "path": "papers/23/06/2306.07301.json",
    "total_tokens": 889,
    "translated_title": "基于回归和最小二乘支持向量机的空气污染预测的新技术",
    "translated_abstract": "空气污染是来源于微粒、化学物质或生物物质的问题，它会对人类或其他生物带来痛苦，对自然栖息地和空气空间也会造成不适。因此，空气污染在大都市中仍然是一项重要的环境问题。若不正确地检测空气污染标准，则会对人类和生物造成严重的后果。为了解决这个问题，提出了一种新技术——离散化回归和最小二乘支持向量（DR-LSSV）来预测空气污染。结果表明，所提出的DR-LSSV技术可以有效提高空气污染预测性能，并在空气污染预测准确性、空气污染预测时间和假阳性率方面超越了传统的机器学习方法。",
    "tldr": "提出了一种新技术，称为DR-LSSV，基于回归和最小二乘支持向量机，可有效提高空气污染预测性能，并在空气污染预测准确性、空气污染预测时间和假阳性率方面超越了传统的机器学习方法。"
}