{
    "title": "Accurate Measures of Vaccination and Concerns of Vaccine Holdouts from Web Search Logs. (arXiv:2306.07457v1 [cs.CY])",
    "abstract": "To design effective vaccine policies, policymakers need detailed data about who has been vaccinated, who is holding out, and why. However, existing data in the US are insufficient: reported vaccination rates are often delayed or missing, and surveys of vaccine hesitancy are limited by high-level questions and self-report biases. Here, we show how large-scale search engine logs and machine learning can be leveraged to fill these gaps and provide novel insights about vaccine intentions and behaviors. First, we develop a vaccine intent classifier that can accurately detect when a user is seeking the COVID-19 vaccine on search. Our classifier demonstrates strong agreement with CDC vaccination rates, with correlations above 0.86, and estimates vaccine intent rates to the level of ZIP codes in real time, allowing us to pinpoint more granular trends in vaccine seeking across regions, demographics, and time. To investigate vaccine hesitancy, we use our classifier to identify two groups, vaccin",
    "link": "http://arxiv.org/abs/2306.07457",
    "context": "Title: Accurate Measures of Vaccination and Concerns of Vaccine Holdouts from Web Search Logs. (arXiv:2306.07457v1 [cs.CY])\nAbstract: To design effective vaccine policies, policymakers need detailed data about who has been vaccinated, who is holding out, and why. However, existing data in the US are insufficient: reported vaccination rates are often delayed or missing, and surveys of vaccine hesitancy are limited by high-level questions and self-report biases. Here, we show how large-scale search engine logs and machine learning can be leveraged to fill these gaps and provide novel insights about vaccine intentions and behaviors. First, we develop a vaccine intent classifier that can accurately detect when a user is seeking the COVID-19 vaccine on search. Our classifier demonstrates strong agreement with CDC vaccination rates, with correlations above 0.86, and estimates vaccine intent rates to the level of ZIP codes in real time, allowing us to pinpoint more granular trends in vaccine seeking across regions, demographics, and time. To investigate vaccine hesitancy, we use our classifier to identify two groups, vaccin",
    "path": "papers/23/06/2306.07457.json",
    "total_tokens": 1290,
    "translated_title": "基于网络搜索记录的疫苗接种和疫苗持有者关注问题的准确测量",
    "translated_abstract": "为了设计有效的疫苗政策，决策者需要详细的数据，了解谁接种了疫苗，谁没有接种，以及为什么。然而，美国现有的数据不足：报道的接种率常常延迟或缺失，接种犹豫调查受到高层次问题和自我报告偏见的限制。在这里，我们展示了大规模搜索引擎日志和机器学习如何利用这些数据来填补这些空白并提供有关疫苗意向和行为的新见解。首先，我们开发了一个疫苗意向分类器，可以准确地检测用户是否在搜索COVID-19疫苗。我们的分类器与CDC疫苗接种率具有很强的一致性，相关性超过0.86，并实时估算疫苗意向率到邮政编码级别，使我们能够精确定位不同地区、人口统计学和时间的疫苗需求趋势。为了调查疫苗犹豫，我们使用我们的分类器识别了两个群体，接种者和持观望态度者，并比较了它们的搜索行为。我们发现，疫苗观望者往往搜索有关副作用和替代药物的信息，并表达对疫苗安全性和政府信誉的担忧。相反，接种的个体倾向于搜索有关疫苗的新闻和疫苗可用性。我们的结果表明，利用搜索引擎日志可以提供及时准确的疫苗意向和关注问题的数据，这可以为有针对性的疫苗宣传教育活动的设计提供信息。",
    "tldr": "研究发现，基于大规模搜索引擎日志和机器学习可以提供及时准确的疫苗意向和关注问题的数据，可以帮助设计有针对性的疫苗宣传教育活动，同时发现疫苗观望者搜索有关副作用和替代药物的信息，并表达对疫苗安全性和政府信誉的担忧。",
    "en_tdlr": "This paper shows how large-scale search engine logs and machine learning can provide accurate and timely data on vaccination intentions and concerns, which can inform the design of targeted vaccine education campaigns. The study also found that vaccine holdouts tend to search for information about side effects and alternative medicine, and express concerns about vaccine safety and government trustworthiness."
}