{
    "title": "The Creative Frontier of Generative AI: Managing the Novelty-Usefulness Tradeoff. (arXiv:2306.03601v1 [cs.AI])",
    "abstract": "In this paper, drawing inspiration from the human creativity literature, we explore the optimal balance between novelty and usefulness in generative Artificial Intelligence (AI) systems. We posit that overemphasizing either aspect can lead to limitations such as hallucinations and memorization. Hallucinations, characterized by AI responses containing random inaccuracies or falsehoods, emerge when models prioritize novelty over usefulness. Memorization, where AI models reproduce content from their training data, results from an excessive focus on usefulness, potentially limiting creativity. To address these challenges, we propose a framework that includes domain-specific analysis, data and transfer learning, user preferences and customization, custom evaluation metrics, and collaboration mechanisms. Our approach aims to generate content that is both novel and useful within specific domains, while considering the unique requirements of various contexts.",
    "link": "http://arxiv.org/abs/2306.03601",
    "context": "Title: The Creative Frontier of Generative AI: Managing the Novelty-Usefulness Tradeoff. (arXiv:2306.03601v1 [cs.AI])\nAbstract: In this paper, drawing inspiration from the human creativity literature, we explore the optimal balance between novelty and usefulness in generative Artificial Intelligence (AI) systems. We posit that overemphasizing either aspect can lead to limitations such as hallucinations and memorization. Hallucinations, characterized by AI responses containing random inaccuracies or falsehoods, emerge when models prioritize novelty over usefulness. Memorization, where AI models reproduce content from their training data, results from an excessive focus on usefulness, potentially limiting creativity. To address these challenges, we propose a framework that includes domain-specific analysis, data and transfer learning, user preferences and customization, custom evaluation metrics, and collaboration mechanisms. Our approach aims to generate content that is both novel and useful within specific domains, while considering the unique requirements of various contexts.",
    "path": "papers/23/06/2306.03601.json",
    "total_tokens": 912,
    "translated_title": "生成AI的创造性新领域：平衡创新和实用性的权衡",
    "translated_abstract": "本文从人类创造力文献中获得灵感，探讨了生成人工智能（AI）系统中创新和实用性的最佳平衡。我们认为过分强调任一方面都会导致一些限制，如幻觉和记忆化。当模型将创新性置于实用性之上时，会出现包含随机不准确或错误信息的AI响应，称为幻觉。过度关注实用性则可能导致AI模型复制其训练数据的内容，即记忆化，可能会限制创造力。为了应对这些挑战，我们提出了一个框架，包括特定领域的分析、数据和转移学习、用户偏好和定制、自定义评价指标以及协作机制。我们的方法旨在在特定领域内生成既新颖又实用的内容，同时考虑各种上下文的独特要求。",
    "tldr": "本文探讨了生成AI系统中创新和实用性的平衡问题。过分注重创新性可能导致幻觉，而过度关注实用性可能导致记忆化。作者提出一个包含多种要素的框架来解决这些挑战，以旨在在特定领域内生成创新且实用的内容。",
    "en_tdlr": "This paper explores the optimal balance between novelty and usefulness in generative AI systems, and proposes a framework to address challenges such as hallucinations and memorization. The framework includes domain-specific analysis, data and transfer learning, user preferences and customization, custom evaluation metrics, and collaboration mechanisms to generate content that is both novel and useful within specific domains."
}