{
    "title": "Recurring Auctions with Costly Entry: Theory and Evidence. (arXiv:2306.17355v1 [econ.TH])",
    "abstract": "Recurring auctions are ubiquitous for selling durable assets, such as land, home, or artwork: When the seller cannot sell the item in the initial auction, she often holds a subsequent auction in the near future. This paper characterizes the design of recurring auctions, both theoretically and empirically. On the theoretical side, we show that recurring auctions outperform single-round auctions in efficiency and revenue when potential buyers face costly entry. This occurs because recurring auctions allow potential buyers with different values to enter at different times, which generates savings in entry costs and increases the overall probability of sale. We further derive the optimal sequence of reserve prices in recurring auctions, depending on whether the seller aims to maximize efficiency or revenue. On the empirical side, we apply the theory to home foreclosure auctions in China, where a foreclosed home is auctioned up to three times in a row. After estimating structural parameters",
    "link": "http://arxiv.org/abs/2306.17355",
    "context": "Title: Recurring Auctions with Costly Entry: Theory and Evidence. (arXiv:2306.17355v1 [econ.TH])\nAbstract: Recurring auctions are ubiquitous for selling durable assets, such as land, home, or artwork: When the seller cannot sell the item in the initial auction, she often holds a subsequent auction in the near future. This paper characterizes the design of recurring auctions, both theoretically and empirically. On the theoretical side, we show that recurring auctions outperform single-round auctions in efficiency and revenue when potential buyers face costly entry. This occurs because recurring auctions allow potential buyers with different values to enter at different times, which generates savings in entry costs and increases the overall probability of sale. We further derive the optimal sequence of reserve prices in recurring auctions, depending on whether the seller aims to maximize efficiency or revenue. On the empirical side, we apply the theory to home foreclosure auctions in China, where a foreclosed home is auctioned up to three times in a row. After estimating structural parameters",
    "path": "papers/23/06/2306.17355.json",
    "total_tokens": 924,
    "translated_title": "高成本参与的重复拍卖：理论与证据",
    "translated_abstract": "重复拍卖在出售耐用资产，如土地、房屋或艺术品方面普遍存在：当卖方在初始拍卖中无法出售物品时，她通常会在不久的将来举行下一个拍卖。本文在理论和实证两方面对重复拍卖的设计进行了表征。在理论方面，我们表明当潜在买家面临高成本参与时，重复拍卖在效率和收入方面优于单轮拍卖。这是因为重复拍卖允许具有不同价值的潜在买家在不同时间进入，从而降低了进入成本并增加了整体售卖概率。我们进一步推导了在重复拍卖中保留价格的最佳序列，这取决于卖方的目标是最大化效率还是收入。在实证方面，我们将理论应用于中国的房屋被收购拍卖中，一套被收购的房屋最多连续拍卖三次。在估计结构参数之后",
    "tldr": "重复拍卖在买方面临高成本参与时，在效率和收入方面优于单轮拍卖。原因是重复拍卖允许不同价值的买家在不同时间进入，从而节省了进入成本并增加了整体售卖概率。"
}