{
    "title": "Generative Semantic Communication: Diffusion Models Beyond Bit Recovery. (arXiv:2306.04321v1 [cs.AI])",
    "abstract": "Semantic communication is expected to be one of the cores of next-generation AI-based communications. One of the possibilities offered by semantic communication is the capability to regenerate, at the destination side, images or videos semantically equivalent to the transmitted ones, without necessarily recovering the transmitted sequence of bits. The current solutions still lack the ability to build complex scenes from the received partial information. Clearly, there is an unmet need to balance the effectiveness of generation methods and the complexity of the transmitted information, possibly taking into account the goal of communication. In this paper, we aim to bridge this gap by proposing a novel generative diffusion-guided framework for semantic communication that leverages the strong abilities of diffusion models in synthesizing multimedia content while preserving semantic features. We reduce bandwidth usage by sending highly-compressed semantic information only. Then, the diffus",
    "link": "http://arxiv.org/abs/2306.04321",
    "context": "Title: Generative Semantic Communication: Diffusion Models Beyond Bit Recovery. (arXiv:2306.04321v1 [cs.AI])\nAbstract: Semantic communication is expected to be one of the cores of next-generation AI-based communications. One of the possibilities offered by semantic communication is the capability to regenerate, at the destination side, images or videos semantically equivalent to the transmitted ones, without necessarily recovering the transmitted sequence of bits. The current solutions still lack the ability to build complex scenes from the received partial information. Clearly, there is an unmet need to balance the effectiveness of generation methods and the complexity of the transmitted information, possibly taking into account the goal of communication. In this paper, we aim to bridge this gap by proposing a novel generative diffusion-guided framework for semantic communication that leverages the strong abilities of diffusion models in synthesizing multimedia content while preserving semantic features. We reduce bandwidth usage by sending highly-compressed semantic information only. Then, the diffus",
    "path": "papers/23/06/2306.04321.json",
    "total_tokens": 914,
    "translated_title": "生成语义通讯：超越比特恢复的扩散模型",
    "translated_abstract": "语义通讯被认为是下一代基于人工智能的通讯中的核心之一。语义通讯的一个可能性是，在不必恢复传输比特序列的情况下，在目标端重建与传输的图像或视频语义等效的副本。当前的解决方案仍然缺乏从接收到的部分信息中构建复杂场景的能力。本文旨在通过提出一种新的生成扩散引导框架来弥补这一差距，该框架利用了扩散模型在合成多媒体内容同时保留语义特征方面的优势。我们通过仅发送高度压缩的语义信息来降低带宽使用。然后接收端的扩散模型生成高质量的多媒体内容。实验结果表明，我们提出的框架在重建质量和语义保留方面优于现有方法。",
    "tldr": "本文提出了一个新的生成扩散引导框架，通过利用扩散模型在合成多媒体内容同时保留语义特征方面的优势，以发送高度压缩的语义信息来降低带宽使用，从而超越现有方法在重建质量和语义保留方面的限制。",
    "en_tdlr": "This paper proposes a novel generative diffusion-guided framework for semantic communication that utilizes the strong abilities of diffusion models in synthesizing multimedia content while preserving semantic features, achieving better reconstruction quality and semantic preservation than existing methods by reducing bandwidth usage with highly-compressed semantic information."
}