{
    "title": "Unified Information Dynamic Analysis of Quantum Decision-Making and Search Algorithms: Computational Intelligence Measure. (arXiv:2306.03233v1 [quant-ph])",
    "abstract": "There are important algorithms built upon a mixture of basic techniques described; for example, the Fast Fourier Transform (FFT) employs both Divide-and-Conquer and Transform-and-Conquer techniques. In this article, the evolution of a quantum algorithm (QA) is examined from an information theory viewpoint. The complex vector entering the quantum algorithmic gate - QAG is considered as an information source both from the classical and the quantum level. The analysis of the classical and quantum information flow in Deutsch-Jozsa, Shor and Grover algorithms is used. It is shown that QAG, based on superposition of states, quantum entanglement and interference, when acting on the input vector, stores information into the system state, minimizing the gap between classical Shannon entropy and quantum von Neumann entropy. Minimizing of the gap between Shannon and von Neumann entropies is considered as a termination criterion of QA computational intelligence measure.",
    "link": "http://arxiv.org/abs/2306.03233",
    "context": "Title: Unified Information Dynamic Analysis of Quantum Decision-Making and Search Algorithms: Computational Intelligence Measure. (arXiv:2306.03233v1 [quant-ph])\nAbstract: There are important algorithms built upon a mixture of basic techniques described; for example, the Fast Fourier Transform (FFT) employs both Divide-and-Conquer and Transform-and-Conquer techniques. In this article, the evolution of a quantum algorithm (QA) is examined from an information theory viewpoint. The complex vector entering the quantum algorithmic gate - QAG is considered as an information source both from the classical and the quantum level. The analysis of the classical and quantum information flow in Deutsch-Jozsa, Shor and Grover algorithms is used. It is shown that QAG, based on superposition of states, quantum entanglement and interference, when acting on the input vector, stores information into the system state, minimizing the gap between classical Shannon entropy and quantum von Neumann entropy. Minimizing of the gap between Shannon and von Neumann entropies is considered as a termination criterion of QA computational intelligence measure.",
    "path": "papers/23/06/2306.03233.json",
    "total_tokens": 899,
    "translated_title": "量子决策和搜索算法的统一信息动态分析：计算智能测量",
    "translated_abstract": "一些重要的算法是基于混合使用的基本技巧构建的；例如，快速傅里叶变换（FFT）使用分治和变换技巧。本文从信息理论的角度考虑了量子算法（QA）的演变。将进入量子算法门(QAG)的复向量作为一个信息源，同时从经典和量子层面进行考虑。使用德沃斯-乔扎，肖尔和格罗弗算法的经典和量子信息流分析。通过基于状态叠加、量子纠缠和干涉的QAG在作用于输入向量时，将信息存储到系统状态中，并最小化经典香农熵和量子冯·诺伊曼熵之间的差距。将最小化香农和冯·诺伊曼熵之间的差距视为QA计算智能测量的终止准则。",
    "tldr": "本文从信息理论的角度考虑了量子算法的演变，通过基于状态叠加、量子纠缠和干涉的QAG存储信息，最小化经典和量子信息之间的差距，并将此作为QA计算智能测量的终止准则。",
    "en_tdlr": "This paper examines the evolution of quantum algorithm from an information theory perspective, showing how the QAG stores information through superposition of states, quantum entanglement and interference to minimize the gap between classical and quantum information flows. The minimization of this gap serves as the termination criterion of QA computational intelligence measure."
}