{
    "title": "Meta-Learning Framework for End-to-End Imposter Identification in Unseen Speaker Recognition. (arXiv:2306.00952v2 [eess.AS] UPDATED)",
    "abstract": "Speaker identification systems are deployed in diverse environments, often different from the lab conditions on which they are trained and tested. In this paper, first, we show the problem of generalization using fixed thresholds (computed using EER metric) for imposter identification in unseen speaker recognition and then introduce a robust speaker-specific thresholding technique for better performance. Secondly, inspired by the recent use of meta-learning techniques in speaker verification, we propose an end-to-end meta-learning framework for imposter detection which decouples the problem of imposter detection from unseen speaker identification. Thus, unlike most prior works that use some heuristics to detect imposters, the proposed network learns to detect imposters by leveraging the utterances of the enrolled speakers. Furthermore, we show the efficacy of the proposed techniques on VoxCeleb1, VCTK and the FFSVC 2022 datasets, beating the baselines by up to 10%.",
    "link": "http://arxiv.org/abs/2306.00952",
    "context": "Title: Meta-Learning Framework for End-to-End Imposter Identification in Unseen Speaker Recognition. (arXiv:2306.00952v2 [eess.AS] UPDATED)\nAbstract: Speaker identification systems are deployed in diverse environments, often different from the lab conditions on which they are trained and tested. In this paper, first, we show the problem of generalization using fixed thresholds (computed using EER metric) for imposter identification in unseen speaker recognition and then introduce a robust speaker-specific thresholding technique for better performance. Secondly, inspired by the recent use of meta-learning techniques in speaker verification, we propose an end-to-end meta-learning framework for imposter detection which decouples the problem of imposter detection from unseen speaker identification. Thus, unlike most prior works that use some heuristics to detect imposters, the proposed network learns to detect imposters by leveraging the utterances of the enrolled speakers. Furthermore, we show the efficacy of the proposed techniques on VoxCeleb1, VCTK and the FFSVC 2022 datasets, beating the baselines by up to 10%.",
    "path": "papers/23/06/2306.00952.json",
    "total_tokens": 906,
    "translated_title": "元学习框架用于未知说话人识别中的端到端冒名者识别",
    "translated_abstract": "说话人识别系统被部署在多样的环境中，往往与它们所训练和测试的实验室条件不同。本文首先展示了使用固定阈值（使用EER度量计算）进行未知说话人识别中的冒名者识别时的泛化问题，并引入了一种强健的说话人特定阈值技术以提高性能。其次，受最近在说话人验证中使用元学习技术的启发，我们提出了一种用于冒名者检测的端到端元学习框架，将冒名者检测问题从未知说话人识别中分离出来。因此，与大多数先前的研究使用一些启发式方法来检测冒名者不同，所提出的网络通过利用注册说话人的话语来学习检测冒名者。此外，我们在VoxCeleb1、VCTK和FFSVC 2022数据集上展示了所提出技术的有效性，相比基线提高了10%。",
    "tldr": "本文提出了一个元学习框架，用于未知说话人识别中的冒名者识别。通过引入强健的说话人特定阈值技术和端到端元学习，将冒名者检测从未知说话人识别中分离出来，并通过利用注册说话人的话语来学习检测冒名者，相比基线提高了10%。"
}