{
    "title": "Hybrid Long Document Summarization using C2F-FAR and ChatGPT: A Practical Study. (arXiv:2306.01169v1 [cs.CL])",
    "abstract": "Text summarization is a downstream natural language processing (NLP) task that challenges the understanding and generation capabilities of language models. Considerable progress has been made in automatically summarizing short texts, such as news articles, often leading to satisfactory results. However, summarizing long documents remains a major challenge. This is due to the complex contextual information in the text and the lack of open-source benchmarking datasets and evaluation frameworks that can be used to develop and test model performance. In this work, we use ChatGPT, the latest breakthrough in the field of large language models (LLMs), together with the extractive summarization model C2F-FAR (Coarse-to-Fine Facet-Aware Ranking) to propose a hybrid extraction and summarization pipeline for long documents such as business articles and books. We work with the world-renowned company getAbstract AG and leverage their expertise and experience in professional book summarization. A pr",
    "link": "http://arxiv.org/abs/2306.01169",
    "context": "Title: Hybrid Long Document Summarization using C2F-FAR and ChatGPT: A Practical Study. (arXiv:2306.01169v1 [cs.CL])\nAbstract: Text summarization is a downstream natural language processing (NLP) task that challenges the understanding and generation capabilities of language models. Considerable progress has been made in automatically summarizing short texts, such as news articles, often leading to satisfactory results. However, summarizing long documents remains a major challenge. This is due to the complex contextual information in the text and the lack of open-source benchmarking datasets and evaluation frameworks that can be used to develop and test model performance. In this work, we use ChatGPT, the latest breakthrough in the field of large language models (LLMs), together with the extractive summarization model C2F-FAR (Coarse-to-Fine Facet-Aware Ranking) to propose a hybrid extraction and summarization pipeline for long documents such as business articles and books. We work with the world-renowned company getAbstract AG and leverage their expertise and experience in professional book summarization. A pr",
    "path": "papers/23/06/2306.01169.json",
    "total_tokens": 1017,
    "translated_title": "使用C2F-FAR和ChatGPT的混合式长文本摘要：一项实用研究",
    "translated_abstract": "文本摘要是一个要挑战语言模型理解和生成能力的下游自然语言处理（NLP）任务。自动摘要短文本（如新闻文章）取得了可圈可点的进展，但是长文本的摘要仍然是一个重大挑战。这是因为文本中复杂的上下文信息以及缺乏可用于开发和测试模型性能的开源基准数据集和评估框架。本文结合大语言模型（LLMs）领域的最新突破ChatGPT和抽取式摘要模型C2F-FAR（Coarse-to-Fine Facet-Aware Ranking），提出了一种针对商业文章和书籍等长文本的混合式抽取和摘要流水线。我们与世界知名公司getAbstract AG合作，利用其在专业书籍摘要方面的专业知识和经验。通过各种指标和人工评估进行了实际研究，结果表明，该混合方法在内容覆盖率、连贯性和可读性方面均优于抽取式和生成式方法。",
    "tldr": "本文结合最新的ChatGPT和抽取式摘要模型C2F-FAR，提出了一种混合式抽取和摘要流水线以解决长文本摘要的挑战，与getAbstract AG合作，该方法在内容覆盖率、连贯性和可读性方面表现优异。",
    "en_tdlr": "This paper proposes a hybrid extraction and summarization pipeline using ChatGPT and C2F-FAR for long documents, and collaborates with getAbstract AG to conduct a practical study, showing that the proposed method outperforms both extractive and abstractive methods in content coverage, coherence, and readability."
}