{
    "title": "Improving Vietnamese Legal Question--Answering System based on Automatic Data Enrichment. (arXiv:2306.04841v1 [cs.CL])",
    "abstract": "Question answering (QA) in law is a challenging problem because legal documents are much more complicated than normal texts in terms of terminology, structure, and temporal and logical relationships. It is even more difficult to perform legal QA for low-resource languages like Vietnamese where labeled data are rare and pre-trained language models are still limited. In this paper, we try to overcome these limitations by implementing a Vietnamese article-level retrieval-based legal QA system and introduce a novel method to improve the performance of language models by improving data quality through weak labeling. Our hypothesis is that in contexts where labeled data are limited, efficient data enrichment can help increase overall performance. Our experiments are designed to test multiple aspects, which demonstrate the effectiveness of the proposed technique.",
    "link": "http://arxiv.org/abs/2306.04841",
    "context": "Title: Improving Vietnamese Legal Question--Answering System based on Automatic Data Enrichment. (arXiv:2306.04841v1 [cs.CL])\nAbstract: Question answering (QA) in law is a challenging problem because legal documents are much more complicated than normal texts in terms of terminology, structure, and temporal and logical relationships. It is even more difficult to perform legal QA for low-resource languages like Vietnamese where labeled data are rare and pre-trained language models are still limited. In this paper, we try to overcome these limitations by implementing a Vietnamese article-level retrieval-based legal QA system and introduce a novel method to improve the performance of language models by improving data quality through weak labeling. Our hypothesis is that in contexts where labeled data are limited, efficient data enrichment can help increase overall performance. Our experiments are designed to test multiple aspects, which demonstrate the effectiveness of the proposed technique.",
    "path": "papers/23/06/2306.04841.json",
    "total_tokens": 811,
    "translated_title": "基于自动数据增强的越南法律问答系统的改进",
    "translated_abstract": "在法律中进行问题回答是一个具有挑战性的问题，因为法律文件在术语、结构以及时间和逻辑关系方面比普通文本要复杂得多。尤其对于越南这样资源稀少的语言来说，进行法律问答更加困难，因为标记数据稀缺且预训练语言模型仍然有限。本文试图通过实现越南基于检索的文章级法律问答系统，并介绍一种新的方法来提高语言模型的性能，通过弱标注提高数据质量来克服这些限制。我们的假设是，在标记数据有限的情况下，有效的数据增强可以帮助提高整体性能。我们的实验旨在测试多个方面，证明所提出技术的有效性。",
    "tldr": "本文针对越南法律问答系统中标记数据稀缺和预训练语言模型有限的问题，实现了一种基于检索的法律问答系统，并提出了一种通过弱标注提高数据质量从而提高语言模型性能的方法。",
    "en_tdlr": "This paper addresses the issues of limited labeled data and pre-trained language models in Vietnamese legal question-answering system by implementing a retrieval-based system and proposing a novel method for improving language model performance through weak labeling to enhance data quality."
}