{
    "title": "Obvious Manipulations in Matching with and without Contracts. (arXiv:2306.17773v1 [econ.TH])",
    "abstract": "In a many-to-one matching model, with or without contracts, where doctors' preferences are private information and hospitals' preferences are substitutable and public information, any stable matching rule could be manipulated for doctors. Since manipulations can not be completely avoided, we consider the concept of \\textit{obvious manipulations} and look for stable matching rules that prevent at least such manipulations (for doctors). For the model with contracts, we prove that: \\textit{(i)} the doctor-optimal matching rule is non-obviously manipulable and \\textit{(ii)} the hospital-optimal matching rule is obviously manipulable, even in the one-to-one model. In contrast to \\textit{(ii)}, for a many-to-one model without contracts, we prove that the hospital-optimal matching rule is not obviously manipulable.% when hospitals' preferences are substitutable. Furthermore, if we focus on quantile stable rules, then we prove that the doctor-optimal matching rule is the only non-obviously man",
    "link": "http://arxiv.org/abs/2306.17773",
    "context": "Title: Obvious Manipulations in Matching with and without Contracts. (arXiv:2306.17773v1 [econ.TH])\nAbstract: In a many-to-one matching model, with or without contracts, where doctors' preferences are private information and hospitals' preferences are substitutable and public information, any stable matching rule could be manipulated for doctors. Since manipulations can not be completely avoided, we consider the concept of \\textit{obvious manipulations} and look for stable matching rules that prevent at least such manipulations (for doctors). For the model with contracts, we prove that: \\textit{(i)} the doctor-optimal matching rule is non-obviously manipulable and \\textit{(ii)} the hospital-optimal matching rule is obviously manipulable, even in the one-to-one model. In contrast to \\textit{(ii)}, for a many-to-one model without contracts, we prove that the hospital-optimal matching rule is not obviously manipulable.% when hospitals' preferences are substitutable. Furthermore, if we focus on quantile stable rules, then we prove that the doctor-optimal matching rule is the only non-obviously man",
    "path": "papers/23/06/2306.17773.json",
    "total_tokens": 1022,
    "translated_title": "匹配中的明显操纵问题：有合同和无合同的情况。",
    "translated_abstract": "在一个医生多对一匹配模型中，无论是否有合同，医生的偏好是私有信息，医院的偏好是可替代的和公开的信息，任何稳定的匹配规则都可以被医生操纵。由于操纵无法完全避免，我们考虑了“明显操纵”的概念，并寻找至少可以防止这些操纵的稳定匹配规则（对医生而言）。对于有合同的模型，我们证明了：（i）医生最优匹配规则不容易被明显操纵；（ii）医院最优匹配规则即使在一对一模型中也容易被明显操纵。与（ii）相反，对于没有合同的多对一模型，我们证明了医院最优匹配规则不容易被明显操纵（当医院的偏好是可替代的）。此外，如果我们关注分位数稳定规则，则证明了医生最优匹配规则是唯一的不容易被明显操纵的规则。",
    "tldr": "在医生多对一匹配模型中，任何稳定的匹配规则都可以被医生操纵。但在有合同的模型中，医生最优匹配规则不容易被明显操纵，而医院最优匹配规则则容易被明显操纵。对于没有合同的多对一模型，医院最优匹配规则不容易被明显操纵。"
}