{
    "title": "Robust and Generalisable Segmentation of Subtle Epilepsy-causing Lesions: a Graph Convolutional Approach. (arXiv:2306.01375v1 [eess.IV])",
    "abstract": "Focal cortical dysplasia (FCD) is a leading cause of drug-resistant focal epilepsy, which can be cured by surgery. These lesions are extremely subtle and often missed even by expert neuroradiologists. \"Ground truth\" manual lesion masks are therefore expensive, limited and have large inter-rater variability. Existing FCD detection methods are limited by high numbers of false positive predictions, primarily due to vertex- or patch-based approaches that lack whole-brain context. Here, we propose to approach the problem as semantic segmentation using graph convolutional networks (GCN), which allows our model to learn spatial relationships between brain regions. To address the specific challenges of FCD identification, our proposed model includes an auxiliary loss to predict distance from the lesion to reduce false positives and a weak supervision classification loss to facilitate learning from uncertain lesion masks. On a multi-centre dataset of 1015 participants with surface-based feature",
    "link": "http://arxiv.org/abs/2306.01375",
    "context": "Title: Robust and Generalisable Segmentation of Subtle Epilepsy-causing Lesions: a Graph Convolutional Approach. (arXiv:2306.01375v1 [eess.IV])\nAbstract: Focal cortical dysplasia (FCD) is a leading cause of drug-resistant focal epilepsy, which can be cured by surgery. These lesions are extremely subtle and often missed even by expert neuroradiologists. \"Ground truth\" manual lesion masks are therefore expensive, limited and have large inter-rater variability. Existing FCD detection methods are limited by high numbers of false positive predictions, primarily due to vertex- or patch-based approaches that lack whole-brain context. Here, we propose to approach the problem as semantic segmentation using graph convolutional networks (GCN), which allows our model to learn spatial relationships between brain regions. To address the specific challenges of FCD identification, our proposed model includes an auxiliary loss to predict distance from the lesion to reduce false positives and a weak supervision classification loss to facilitate learning from uncertain lesion masks. On a multi-centre dataset of 1015 participants with surface-based feature",
    "path": "papers/23/06/2306.01375.json",
    "total_tokens": 732,
    "translated_title": "一种强鲁棒性和可推广性的图卷积方法用于细微癫痫病灶的分割",
    "translated_abstract": "该论文提出了使用图卷积网络（GCN）进行语义分割的方法，以解决细微的局限性皮质发育不良（FCD）病变的识别问题。研究人员通过添加辅助损失和弱监督分类损失的方式，使模型能够学习到更多的空间关系，从而降低误报率。该方法在多个中心的数据集上进行了测试。",
    "tldr": "该论文提出了一种通过图卷积网络进行语义分割的方法，能够对细微的癫痫病灶进行识别，降低误报率。",
    "en_tdlr": "The paper proposes a graph convolutional approach for semantic segmentation to identify subtle focal cortical dysplasia (FCD) lesions, which includes auxiliary and weak supervision losses to reduce false positives and improve spatial relationships."
}