{
    "title": "Evaluation of Environmental Conditions on Object Detection using Oriented Bounding Boxes for AR Applications. (arXiv:2306.16798v1 [cs.CV])",
    "abstract": "The objective of augmented reality (AR) is to add digital content to natural images and videos to create an interactive experience between the user and the environment. Scene analysis and object recognition play a crucial role in AR, as they must be performed quickly and accurately. In this study, a new approach is proposed that involves using oriented bounding boxes with a detection and recognition deep network to improve performance and processing time. The approach is evaluated using two datasets: a real image dataset (DOTA dataset) commonly used for computer vision tasks, and a synthetic dataset that simulates different environmental, lighting, and acquisition conditions. The focus of the evaluation is on small objects, which are difficult to detect and recognise. The results indicate that the proposed approach tends to produce better Average Precision and greater accuracy for small objects in most of the tested conditions.",
    "link": "http://arxiv.org/abs/2306.16798",
    "context": "Title: Evaluation of Environmental Conditions on Object Detection using Oriented Bounding Boxes for AR Applications. (arXiv:2306.16798v1 [cs.CV])\nAbstract: The objective of augmented reality (AR) is to add digital content to natural images and videos to create an interactive experience between the user and the environment. Scene analysis and object recognition play a crucial role in AR, as they must be performed quickly and accurately. In this study, a new approach is proposed that involves using oriented bounding boxes with a detection and recognition deep network to improve performance and processing time. The approach is evaluated using two datasets: a real image dataset (DOTA dataset) commonly used for computer vision tasks, and a synthetic dataset that simulates different environmental, lighting, and acquisition conditions. The focus of the evaluation is on small objects, which are difficult to detect and recognise. The results indicate that the proposed approach tends to produce better Average Precision and greater accuracy for small objects in most of the tested conditions.",
    "path": "papers/23/06/2306.16798.json",
    "total_tokens": 849,
    "translated_title": "评估环境条件对使用定向边界框进行AR应用的物体检测的影响",
    "translated_abstract": "增强现实（AR）的目标是将数字内容添加到自然图像和视频中，以创建用户与环境之间的交互体验。场景分析和物体识别在AR中起着至关重要的作用，因为它们必须快速且准确地执行。本研究提出了一种新的方法，利用定向边界框与检测和识别深度网络相结合，以提高性能和处理时间。该方法使用两个数据集进行评估：一个常用于计算机视觉任务的真实图像数据集（DOTA数据集）和一个模拟不同环境、照明和采集条件的合成数据集。评估的重点是小物体，这些物体往往难以检测和识别。结果表明，所提出的方法在大多数测试条件下，对于小物体往往能产生更好的平均精度和更高的准确性。",
    "tldr": "本研究提出了一种使用定向边界框和深度网络进行物体检测的新方法，通过在不同环境条件下对两个数据集的评估发现，该方法在处理小物体时能够提高性能和准确性。",
    "en_tdlr": "This study presents a new approach for object detection using oriented bounding boxes and deep networks. Evaluations on two datasets with varying environmental conditions show that the proposed method improves performance and accuracy for small objects."
}