{
    "title": "Curatr: A Platform for Semantic Analysis and Curation of Historical Literary Texts. (arXiv:2306.08020v1 [cs.CL])",
    "abstract": "The increasing availability of digital collections of historical and contemporary literature presents a wealth of possibilities for new research in the humanities. The scale and diversity of such collections however, presents particular challenges in identifying and extracting relevant content. This paper presents Curatr, an online platform for the exploration and curation of literature with machine learning-supported semantic search, designed within the context of digital humanities scholarship. The platform provides a text mining workflow that combines neural word embeddings with expert domain knowledge to enable the generation of thematic lexicons, allowing researches to curate relevant sub-corpora from a large corpus of 18th and 19th century digitised texts.",
    "link": "http://arxiv.org/abs/2306.08020",
    "context": "Title: Curatr: A Platform for Semantic Analysis and Curation of Historical Literary Texts. (arXiv:2306.08020v1 [cs.CL])\nAbstract: The increasing availability of digital collections of historical and contemporary literature presents a wealth of possibilities for new research in the humanities. The scale and diversity of such collections however, presents particular challenges in identifying and extracting relevant content. This paper presents Curatr, an online platform for the exploration and curation of literature with machine learning-supported semantic search, designed within the context of digital humanities scholarship. The platform provides a text mining workflow that combines neural word embeddings with expert domain knowledge to enable the generation of thematic lexicons, allowing researches to curate relevant sub-corpora from a large corpus of 18th and 19th century digitised texts.",
    "path": "papers/23/06/2306.08020.json",
    "total_tokens": 783,
    "translated_title": "Curatr：历史文学文本语义分析与筛选平台。",
    "translated_abstract": "数字化历史和现代文学文本的持续增加提供了人文学科新研究的丰富可能性，然而这些集合的规模和多样性，也面临着特殊的挑战。本文介绍了Curatr，一个基于机器学习支持的语义搜索在线平台，旨在为数字人文学科学者提供文学文本的探索和筛选。该平台提供了一个文本挖掘工作流，通过将神经词嵌入与专业领域知识相结合，实现了主题词典的生成，可以让研究人员从大量的18世纪和19世纪数字化文本中筛选相关子语料库。",
    "tldr": "Curatr是一个在线平台，可以基于机器学习支持的语义搜索来进行历史文学文本的筛选，提供主题词典的生成，帮助研究人员快速从大量的数字化文本中挑选出相关的子语料库。",
    "en_tdlr": "Curatr is an online platform for the exploration and curation of literature with machine learning-supported semantic search. It provides a text mining workflow that combines neural word embeddings with expert domain knowledge to enable the generation of thematic lexicons, allowing researchers to curate relevant sub-corpora from a large corpus of 18th and 19th century digitised texts."
}