{
    "title": "ColdNAS: Search to Modulate for User Cold-Start Recommendation. (arXiv:2306.03387v1 [cs.AI])",
    "abstract": "Making personalized recommendation for cold-start users, who only have a few interaction histories, is a challenging problem in recommendation systems. Recent works leverage hypernetworks to directly map user interaction histories to user-specific parameters, which are then used to modulate predictor by feature-wise linear modulation function. These works obtain the state-of-the-art performance. However, the physical meaning of scaling and shifting in recommendation data is unclear. Instead of using a fixed modulation function and deciding modulation position by expertise, we propose a modulation framework called ColdNAS for user cold-start problem, where we look for proper modulation structure, including function and position, via neural architecture search. We design a search space which covers broad models and theoretically prove that this search space can be transformed to a much smaller space, enabling an efficient and robust one-shot search algorithm. Extensive experimental resul",
    "link": "http://arxiv.org/abs/2306.03387",
    "context": "Title: ColdNAS: Search to Modulate for User Cold-Start Recommendation. (arXiv:2306.03387v1 [cs.AI])\nAbstract: Making personalized recommendation for cold-start users, who only have a few interaction histories, is a challenging problem in recommendation systems. Recent works leverage hypernetworks to directly map user interaction histories to user-specific parameters, which are then used to modulate predictor by feature-wise linear modulation function. These works obtain the state-of-the-art performance. However, the physical meaning of scaling and shifting in recommendation data is unclear. Instead of using a fixed modulation function and deciding modulation position by expertise, we propose a modulation framework called ColdNAS for user cold-start problem, where we look for proper modulation structure, including function and position, via neural architecture search. We design a search space which covers broad models and theoretically prove that this search space can be transformed to a much smaller space, enabling an efficient and robust one-shot search algorithm. Extensive experimental resul",
    "path": "papers/23/06/2306.03387.json",
    "total_tokens": 801,
    "translated_title": "ColdNAS: 搜索以调节为用户冷启动推荐",
    "translated_abstract": "在推荐系统中，为冷启动用户(只有一些交互历史)进行个性化推荐是一个具有挑战性的问题。 最近的研究利用超网络将用户交互历史直接映射到用户特定参数，然后使用特性线性调制函数来调制预测器。 这些研究取得了最先进的性能。 然而，缩放和移位在推荐数据中的物理含义是不清楚的。 我们提出了一个调节框架ColdNAS来解决用户冷启动问题，该框架通过神经架构搜索寻找适当的调节结构，包括函数和位置。 我们设计了一个搜索空间，涵盖广泛的模型，并从理论上证明，该搜索空间可以转换为一个更小的空间，从而实现高效且鲁棒的一次搜索算法。",
    "tldr": "本研究提出了一个调节框架ColdNAS来解决用户冷启动问题，通过神经架构搜索寻找适当的调节结构，包括函数和位置。",
    "en_tdlr": "ColdNAS is proposed to tackle the challenging problem of personalized recommendation for cold-start users, by searching for proper modulation structure, including function and position, via neural architecture search."
}