{
    "title": "High-Fidelity Audio Compression with Improved RVQGAN. (arXiv:2306.06546v2 [cs.SD] UPDATED)",
    "abstract": "Language models have been successfully used to model natural signals, such as images, speech, and music. A key component of these models is a high quality neural compression model that can compress high-dimensional natural signals into lower dimensional discrete tokens. To that end, we introduce a high-fidelity universal neural audio compression algorithm that achieves ~90x compression of 44.1 KHz audio into tokens at just 8kbps bandwidth. We achieve this by combining advances in high-fidelity audio generation with better vector quantization techniques from the image domain, along with improved adversarial and reconstruction losses. We compress all domains (speech, environment, music, etc.) with a single universal model, making it widely applicable to generative modeling of all audio. We compare with competing audio compression algorithms, and find our method outperforms them significantly. We provide thorough ablations for every design choice, as well as open-source code and trained m",
    "link": "http://arxiv.org/abs/2306.06546",
    "context": "Title: High-Fidelity Audio Compression with Improved RVQGAN. (arXiv:2306.06546v2 [cs.SD] UPDATED)\nAbstract: Language models have been successfully used to model natural signals, such as images, speech, and music. A key component of these models is a high quality neural compression model that can compress high-dimensional natural signals into lower dimensional discrete tokens. To that end, we introduce a high-fidelity universal neural audio compression algorithm that achieves ~90x compression of 44.1 KHz audio into tokens at just 8kbps bandwidth. We achieve this by combining advances in high-fidelity audio generation with better vector quantization techniques from the image domain, along with improved adversarial and reconstruction losses. We compress all domains (speech, environment, music, etc.) with a single universal model, making it widely applicable to generative modeling of all audio. We compare with competing audio compression algorithms, and find our method outperforms them significantly. We provide thorough ablations for every design choice, as well as open-source code and trained m",
    "path": "papers/23/06/2306.06546.json",
    "total_tokens": 917,
    "translated_title": "使用改进的RVQGAN进行高保真音频压缩",
    "translated_abstract": "语言模型已成功地用于建模自然信号，如图像、语音和音乐。其中关键组件是一个能将高维自然信号压缩为较低维度离散令牌的高质量神经压缩模型。为此，我们介绍了一种高保真全能神经音频压缩算法，将44.1 KHz音频以8kbps的带宽压缩约90倍。我们将高保真音频生成的进展与图像领域的更好向量量化技术相结合，同时改进对抗性和重建损失。我们使用单一通用模型对所有领域（语音、环境、音乐等）进行压缩，使其广泛适用于音频的生成建模。我们与竞争的音频压缩算法进行比较，发现我们的方法明显优于它们。我们提供了对每个设计选择进行彻底分析的实验，以及开源代码和经过训练的模型。",
    "tldr": "本论文介绍了一种使用改进的RVQGAN进行高保真音频压缩的算法，在保持音频质量的情况下实现了90倍的压缩。这种算法结合了高质量的音频生成和图像领域的向量量化技术，同时改进了对抗性和重建损失。通过使用单一通用模型对所有领域进行压缩，该算法在音频生成建模中具有广泛的应用价值。与竞争算法相比，该方法表现出更好的性能。"
}