{
    "title": "Synthesizing realistic sand assemblies with denoising diffusion in latent space. (arXiv:2306.04411v1 [cs.AI])",
    "abstract": "The shapes and morphological features of grains in sand assemblies have far-reaching implications in many engineering applications, such as geotechnical engineering, computer animations, petroleum engineering, and concentrated solar power. Yet, our understanding of the influence of grain geometries on macroscopic response is often only qualitative, due to the limited availability of high-quality 3D grain geometry data. In this paper, we introduce a denoising diffusion algorithm that uses a set of point clouds collected from the surface of individual sand grains to generate grains in the latent space. By employing a point cloud autoencoder, the three-dimensional point cloud structures of sand grains are first encoded into a lower-dimensional latent space. A generative denoising diffusion probabilistic model is trained to produce synthetic sand that maximizes the log-likelihood of the generated samples belonging to the original data distribution measured by a Kullback-Leibler divergence.",
    "link": "http://arxiv.org/abs/2306.04411",
    "context": "Title: Synthesizing realistic sand assemblies with denoising diffusion in latent space. (arXiv:2306.04411v1 [cs.AI])\nAbstract: The shapes and morphological features of grains in sand assemblies have far-reaching implications in many engineering applications, such as geotechnical engineering, computer animations, petroleum engineering, and concentrated solar power. Yet, our understanding of the influence of grain geometries on macroscopic response is often only qualitative, due to the limited availability of high-quality 3D grain geometry data. In this paper, we introduce a denoising diffusion algorithm that uses a set of point clouds collected from the surface of individual sand grains to generate grains in the latent space. By employing a point cloud autoencoder, the three-dimensional point cloud structures of sand grains are first encoded into a lower-dimensional latent space. A generative denoising diffusion probabilistic model is trained to produce synthetic sand that maximizes the log-likelihood of the generated samples belonging to the original data distribution measured by a Kullback-Leibler divergence.",
    "path": "papers/23/06/2306.04411.json",
    "total_tokens": 910,
    "translated_title": "在潜在空间中使用去噪扩散技术合成逼真的沙粒组装",
    "translated_abstract": "沙粒组装中的形态和形态特征在许多工程应用中，如地质工程、计算机动画、石油工程和浓缩太阳能方面具有深远的影响。本文介绍了一种去噪扩散算法，利用从单个沙粒表面收集的一组点云生成潜在空间中的沙粒。通过使用点云自编码器，把沙粒的三维点云结构首先编码到较低维度的潜在空间中。训练了一种生成去噪扩散概率模型，用来生成最大化生成样本属于原始数据分布的对数似然的合成沙粒，这通过Kullback-Leibler散度来测量。",
    "tldr": "本文介绍了一种使用去噪扩散算法在潜在空间中生成沙粒组装的方法，通过点云自编码器把沙粒的三维点云结构编码到较低维度的潜在空间中，生成的沙粒样本符合原始数据分布，并可用于地质工程、计算机动画、石油工程等应用。",
    "en_tdlr": "This paper presents a method of synthesizing sand assemblies using denoising diffusion algorithm in the latent space, and generating sand samples that conform to the original data distribution by encoding 3D point cloud structures of sand grains into a lower-dimensional latent space using a point cloud autoencoder. This method is useful for various engineering applications such as geotechnical engineering, computer animations, and petroleum engineering."
}