{
    "title": "Comprehensive evaluation of deep and graph learning on drug-drug interactions prediction. (arXiv:2306.05257v1 [cs.LG])",
    "abstract": "Recent advances and achievements of artificial intelligence (AI) as well as deep and graph learning models have established their usefulness in biomedical applications, especially in drug-drug interactions (DDIs). DDIs refer to a change in the effect of one drug to the presence of another drug in the human body, which plays an essential role in drug discovery and clinical research. DDIs prediction through traditional clinical trials and experiments is an expensive and time-consuming process. To correctly apply the advanced AI and deep learning, the developer and user meet various challenges such as the availability and encoding of data resources, and the design of computational methods. This review summarizes chemical structure based, network based, NLP based and hybrid methods, providing an updated and accessible guide to the broad researchers and development community with different domain knowledge. We introduce widely-used molecular representation and describe the theoretical frame",
    "link": "http://arxiv.org/abs/2306.05257",
    "context": "Title: Comprehensive evaluation of deep and graph learning on drug-drug interactions prediction. (arXiv:2306.05257v1 [cs.LG])\nAbstract: Recent advances and achievements of artificial intelligence (AI) as well as deep and graph learning models have established their usefulness in biomedical applications, especially in drug-drug interactions (DDIs). DDIs refer to a change in the effect of one drug to the presence of another drug in the human body, which plays an essential role in drug discovery and clinical research. DDIs prediction through traditional clinical trials and experiments is an expensive and time-consuming process. To correctly apply the advanced AI and deep learning, the developer and user meet various challenges such as the availability and encoding of data resources, and the design of computational methods. This review summarizes chemical structure based, network based, NLP based and hybrid methods, providing an updated and accessible guide to the broad researchers and development community with different domain knowledge. We introduce widely-used molecular representation and describe the theoretical frame",
    "path": "papers/23/06/2306.05257.json",
    "total_tokens": 908,
    "translated_title": "深度学习和图学习在药物相互作用预测中的综合评估",
    "translated_abstract": "人工智能及深度学习和图学习模型的最新进展和成就在生物医学应用中已经被证明是有用的，特别是在药物相互作用(DDIs)相关的应用。DDIs是指在人体中存在另一个药物时，对一种药物作用的改变，它在药物发现和临床研究中起着重要的作用。通过传统的临床试验和实验来预测DDIs是一项昂贵且耗时的过程。为了正确应用先进的AI和深度学习，开发者和用户面临着各种挑战，如数据资源的可用性和编码以及计算方法的设计。本文总结了基于化学结构、基于网络、基于自然语言处理(NLP)和混合方法，为具有不同领域知识的广泛研究和发展社区提供了最新和易于访问的指南。我们介绍了广泛使用的分子表示方法，并描述了理论框架。",
    "tldr": "本论文综合评估了使用深度学习和图学习在药物相互作用预测方面的可行性，并总结了基于化学结构、基于网络、基于自然语言处理和混合方法，提供了一个易于访问的指南。",
    "en_tdlr": "This paper comprehensively evaluates the feasibility of using deep learning and graph learning for drug-drug interaction prediction, and summarizes chemical structure based, network based, NLP based and hybrid methods, providing an accessible guide for researchers and developers with different domain knowledge."
}