{
    "title": "Sampling and Ranking for Digital Ink Generation on a tight computational budget. (arXiv:2306.03103v1 [cs.HC])",
    "abstract": "Digital ink (online handwriting) generation has a number of potential applications for creating user-visible content, such as handwriting autocompletion, spelling correction, and beautification. Writing is personal and usually the processing is done on-device. Ink generative models thus need to produce high quality content quickly, in a resource constrained environment.  In this work, we study ways to maximize the quality of the output of a trained digital ink generative model, while staying within an inference time budget. We use and compare the effect of multiple sampling and ranking techniques, in the first ablation study of its kind in the digital ink domain.  We confirm our findings on multiple datasets - writing in English and Vietnamese, as well as mathematical formulas - using two model types and two common ink data representations. In all combinations, we report a meaningful improvement in the recognizability of the synthetic inks, in some cases more than halving the character",
    "link": "http://arxiv.org/abs/2306.03103",
    "context": "Title: Sampling and Ranking for Digital Ink Generation on a tight computational budget. (arXiv:2306.03103v1 [cs.HC])\nAbstract: Digital ink (online handwriting) generation has a number of potential applications for creating user-visible content, such as handwriting autocompletion, spelling correction, and beautification. Writing is personal and usually the processing is done on-device. Ink generative models thus need to produce high quality content quickly, in a resource constrained environment.  In this work, we study ways to maximize the quality of the output of a trained digital ink generative model, while staying within an inference time budget. We use and compare the effect of multiple sampling and ranking techniques, in the first ablation study of its kind in the digital ink domain.  We confirm our findings on multiple datasets - writing in English and Vietnamese, as well as mathematical formulas - using two model types and two common ink data representations. In all combinations, we report a meaningful improvement in the recognizability of the synthetic inks, in some cases more than halving the character",
    "path": "papers/23/06/2306.03103.json",
    "total_tokens": 923,
    "translated_title": "在计算资源有限的条件下进行数字笔迹生成的抽样和排序",
    "translated_abstract": "数字墨水（在线手写）生成有许多潜在的应用，例如书写自动完成功能、拼写纠正和美化等。因为写作是个人的，所以处理通常在设备上完成。因此，墨水生成模型需要在资源受限的环境下快速生成高质量的内容。在本研究中，我们研究了如何在推理时间预算内最大化训练的数字墨水生成模型的输出质量。我们使用和比较多种抽样和排序技术的效果，这是数字墨水领域第一次这样的消融研究。我们在多个数据集上验证我们的发现——英语和越南语书写以及数学公式——使用两种模型类型和两种常见的墨水数据表示。在所有组合中，我们报告了合成墨水的可识别性的显着提高，在某些情况下，字符数量减少了一半以上。",
    "tldr": "该论文研究了如何在资源受限的环境下，通过使用多种抽样和排序技术，最大化数字墨水生成模型的输出质量，这项研究在数字墨水领域中首次进行，其结果证明了这些技术能显着提高合成墨水的识别性。",
    "en_tdlr": "This paper explores how to maximize the output quality of a trained digital ink generative model while staying within an inference time budget, using and comparing the effect of multiple sampling and ranking techniques, which leads to a meaningful improvement in the recognizability of the synthetic inks. This is the first ablation study of its kind in the digital ink domain."
}