{
    "title": "Random matrix theory and nested clustered portfolios on Mexican markets. (arXiv:2306.05667v1 [q-fin.ST])",
    "abstract": "This work aims to deal with the optimal allocation instability problem of Markowitz's modern portfolio theory in high dimensionality. We propose a combined strategy that considers covariance matrix estimators from Random Matrix Theory~(RMT) and the machine learning allocation methodology known as Nested Clustered Optimization~(NCO). The latter methodology is modified and reformulated in terms of the spectral clustering algorithm and Minimum Spanning Tree~(MST) to solve internal problems inherent to the original proposal. Markowitz's classical mean-variance allocation and the modified NCO machine learning approach are tested on financial instruments listed on the Mexican Stock Exchange~(BMV) in a moving window analysis from 2018 to 2022. The modified NCO algorithm achieves stable allocations by incorporating RMT covariance estimators. In particular, the allocation weights are positive, and their absolute value adds up to the total capital without considering explicit restrictions in the",
    "link": "http://arxiv.org/abs/2306.05667",
    "context": "Title: Random matrix theory and nested clustered portfolios on Mexican markets. (arXiv:2306.05667v1 [q-fin.ST])\nAbstract: This work aims to deal with the optimal allocation instability problem of Markowitz's modern portfolio theory in high dimensionality. We propose a combined strategy that considers covariance matrix estimators from Random Matrix Theory~(RMT) and the machine learning allocation methodology known as Nested Clustered Optimization~(NCO). The latter methodology is modified and reformulated in terms of the spectral clustering algorithm and Minimum Spanning Tree~(MST) to solve internal problems inherent to the original proposal. Markowitz's classical mean-variance allocation and the modified NCO machine learning approach are tested on financial instruments listed on the Mexican Stock Exchange~(BMV) in a moving window analysis from 2018 to 2022. The modified NCO algorithm achieves stable allocations by incorporating RMT covariance estimators. In particular, the allocation weights are positive, and their absolute value adds up to the total capital without considering explicit restrictions in the",
    "path": "papers/23/06/2306.05667.json",
    "total_tokens": 933,
    "translated_abstract": "本文旨在解决马科威茨现代投资组合理论在高维度下最优分配不稳定的问题。我们提出了一种组合策略，该策略考虑了随机矩阵理论(RMT)的协方差矩阵估计器以及称为Nested Clustered Optimization(NCO)的机器学习分配方法。后一种方法采用了光谱聚类算法和最小生成树(MST)来解决与原始提议固有的内部问题。我们通过2018年到2022年的移动窗口分析，在墨西哥股票交易所(BMV)上测试了马科威茨经典的均值-方差分配和修改后的NCO机器学习方法。修改后的NCO算法通过整合RMT协方差估计器来实现稳定的分配。特别地，该分配权重为正值，并且它们的绝对值加起来等于总资产，而不考虑显式限制。",
    "tldr": "本文应用随机矩阵理论和Nested Clustered Portfolio方法解决了马科威茨现代投资组合理论在高维度下最优分配不稳定的问题。在墨西哥股票交易所上，修改后的NCO机器学习方法通过整合RMT协方差估计器实现了稳定的分配。"
}