{
    "title": "Simulation-Based Frequentist Inference with Tractable and Intractable Likelihoods. (arXiv:2306.07769v1 [stat.ME])",
    "abstract": "High-fidelity simulators that connect theoretical models with observations are indispensable tools in many sciences. When coupled with machine learning, a simulator makes it possible to infer the parameters of a theoretical model directly from real and simulated observations without explicit use of the likelihood function. This is of particular interest when the latter is intractable. We introduce a simple modification of the recently proposed likelihood-free frequentist inference (LF2I) approach that has some computational advantages. The utility of our algorithm is illustrated by applying it to three pedagogically interesting examples: the first is from cosmology, the second from high-energy physics and astronomy, both with tractable likelihoods, while the third, with an intractable likelihood, is from epidemiology.",
    "link": "http://arxiv.org/abs/2306.07769",
    "context": "Title: Simulation-Based Frequentist Inference with Tractable and Intractable Likelihoods. (arXiv:2306.07769v1 [stat.ME])\nAbstract: High-fidelity simulators that connect theoretical models with observations are indispensable tools in many sciences. When coupled with machine learning, a simulator makes it possible to infer the parameters of a theoretical model directly from real and simulated observations without explicit use of the likelihood function. This is of particular interest when the latter is intractable. We introduce a simple modification of the recently proposed likelihood-free frequentist inference (LF2I) approach that has some computational advantages. The utility of our algorithm is illustrated by applying it to three pedagogically interesting examples: the first is from cosmology, the second from high-energy physics and astronomy, both with tractable likelihoods, while the third, with an intractable likelihood, is from epidemiology.",
    "path": "papers/23/06/2306.07769.json",
    "total_tokens": 799,
    "translated_title": "基于模拟的可处理和不可处理似然函数的频率派推断",
    "translated_abstract": "在许多科学领域中，连接理论模型和观察结果的高保真度模拟器是不可或缺的工具。当与机器学习相结合时，模拟器使得直接从真实和模拟观察结果中推断理论模型的参数成为可能，而不需要明确使用似然函数，特别是在似然函数不可处理的情况下。我们引入了最近提出的无似然频率学推断（LF2I）方法的一个简单修改，这个修改具有一些计算上的优势。我们通过将该算法应用于三个教学上有趣的例子来说明其实用性：第一个例子来自宇宙学，第二个例子来自高能物理和天文学，两者都具有可处理的似然函数，而第三个具有不可处理的似然函数，来自于流行病学。",
    "tldr": "本文介绍了一种基于模拟的可处理和不可处理似然函数的频率派推断方法，并在宇宙学、高能物理、天文学和流行病学领域进行了演示。",
    "en_tdlr": "This paper introduces a simulation-based frequentist inference method with tractable and intractable likelihoods, and demonstrates its utility in cosmology, high energy physics, astronomy, and epidemiology."
}