{
    "title": "Precision psychiatry: predicting predictability. (arXiv:2306.12462v1 [q-bio.QM])",
    "abstract": "Precision psychiatry is an ermerging field that aims to provide individualized approaches to mental health care. Multivariate analysis and machine learning are used to create outcome prediction models based on clinical data such as demographics, symptom assessments, genetic information, and brain imaging. While much emphasis has been placed on technical innovation, the complex and varied nature of mental health presents significant challenges to the successful implementation of these models. From this perspective, I review ten challenges in the field of precision psychiatry, including the need for studies on real-world populations and realistic clinical outcome definitions, consideration of treatment-related factors such as placebo effects and non-adherence to prescriptions. Fairness, prospective validation in comparison to current practice and implementation studies of prediction models are other key issues that are currently understudied. A shift is proposed from retrospective studie",
    "link": "http://arxiv.org/abs/2306.12462",
    "context": "Title: Precision psychiatry: predicting predictability. (arXiv:2306.12462v1 [q-bio.QM])\nAbstract: Precision psychiatry is an ermerging field that aims to provide individualized approaches to mental health care. Multivariate analysis and machine learning are used to create outcome prediction models based on clinical data such as demographics, symptom assessments, genetic information, and brain imaging. While much emphasis has been placed on technical innovation, the complex and varied nature of mental health presents significant challenges to the successful implementation of these models. From this perspective, I review ten challenges in the field of precision psychiatry, including the need for studies on real-world populations and realistic clinical outcome definitions, consideration of treatment-related factors such as placebo effects and non-adherence to prescriptions. Fairness, prospective validation in comparison to current practice and implementation studies of prediction models are other key issues that are currently understudied. A shift is proposed from retrospective studie",
    "path": "papers/23/06/2306.12462.json",
    "total_tokens": 957,
    "translated_title": "精准精神医学：预测的预测(arXiv:2306.12462v1 [q-bio.QM])",
    "translated_abstract": "精准精神医学是一个新兴领域，旨在为精神健康护理提供个性化方法。多元分析和机器学习用于创建基于临床数据(如人口统计学、症状评估、基因信息和脑成像)的结果预测模型。虽然技术创新受到了很大的重视，但由于精神健康的复杂和多样性，这些模型的成功实施面临着重大挑战。从这个角度来看，本文回顾了精准精神医学领域中的十个挑战，包括需对真实世界人群进行研究以及对临床结果定义进行现实考虑，需考虑治疗相关因素，如安慰剂效应和不遵从处方。公平性、与现行实践的前瞻性验证和预测模型的实施研究等其他关键问题目前被低估了。提出了将重点从回顾研究转移到远景性实施的观点。",
    "tldr": "本文讨论了精准精神医学领域的十个挑战，包括对真实世界人群进行研究、对临床结果定义的现实考虑、考虑治疗相关因素以及公平性等，提出了将重点从回顾研究转移到远景性实施的观点。",
    "en_tdlr": "This article discusses ten challenges in the field of precision psychiatry, including the need for studies on real-world populations, realistic clinical outcome definitions, consideration of treatment-related factors, and fairness. The article proposes a shift from retrospective studies to prospective implementation."
}