{
    "title": "DOS: Diverse Outlier Sampling for Out-of-Distribution Detection",
    "abstract": "arXiv:2306.02031v2 Announce Type: replace  Abstract: Modern neural networks are known to give overconfident prediction for out-of-distribution inputs when deployed in the open world. It is common practice to leverage a surrogate outlier dataset to regularize the model during training, and recent studies emphasize the role of uncertainty in designing the sampling strategy for outlier dataset. However, the OOD samples selected solely based on predictive uncertainty can be biased towards certain types, which may fail to capture the full outlier distribution. In this work, we empirically show that diversity is critical in sampling outliers for OOD detection performance. Motivated by the observation, we propose a straightforward and novel sampling strategy named DOS (Diverse Outlier Sampling) to select diverse and informative outliers. Specifically, we cluster the normalized features at each iteration, and the most informative outlier from each cluster is selected for model training with ab",
    "link": "https://arxiv.org/abs/2306.02031",
    "context": "Title: DOS: Diverse Outlier Sampling for Out-of-Distribution Detection\nAbstract: arXiv:2306.02031v2 Announce Type: replace  Abstract: Modern neural networks are known to give overconfident prediction for out-of-distribution inputs when deployed in the open world. It is common practice to leverage a surrogate outlier dataset to regularize the model during training, and recent studies emphasize the role of uncertainty in designing the sampling strategy for outlier dataset. However, the OOD samples selected solely based on predictive uncertainty can be biased towards certain types, which may fail to capture the full outlier distribution. In this work, we empirically show that diversity is critical in sampling outliers for OOD detection performance. Motivated by the observation, we propose a straightforward and novel sampling strategy named DOS (Diverse Outlier Sampling) to select diverse and informative outliers. Specifically, we cluster the normalized features at each iteration, and the most informative outlier from each cluster is selected for model training with ab",
    "path": "papers/23/06/2306.02031.json",
    "total_tokens": 822,
    "translated_title": "DOS：多样化异常样本采样用于外域检测",
    "translated_abstract": "现代神经网络在部署在开放世界时，对外域输入给出过于自信的预测，通常会利用替代异常数据集在训练期间对模型进行规范化，最近的研究强调了在设计异常数据集采样策略时的不确定性的作用。然而，仅基于预测不确定性选择的外域样本可能偏向于某些类型，无法完全捕捉整个异常分布。在这项工作中，我们经验证明多样性对于采样外域样本以提升性能至关重要。受到这一观察的启发，我们提出了一种名为DOS（多样化异常样本采样）的简单而新颖的采样策略，以选择多样化和信息丰富的异常样本。具体来说，我们在每次迭代中对标准化特征进行聚类，然后从每个簇中选择最具信息量的异常样本用于模型训练。",
    "tldr": "在外域检测性能中，多样性对于异常样本的采样至关重要，因此提出了一种名为DOS的多样化异常样本采样策略。"
}