{
    "title": "Arabic Dysarthric Speech Recognition Using Adversarial and Signal-Based Augmentation. (arXiv:2306.04368v1 [cs.SD])",
    "abstract": "Despite major advancements in Automatic Speech Recognition (ASR), the state-of-the-art ASR systems struggle to deal with impaired speech even with high-resource languages. In Arabic, this challenge gets amplified, with added complexities in collecting data from dysarthric speakers. In this paper, we aim to improve the performance of Arabic dysarthric automatic speech recognition through a multi-stage augmentation approach. To this effect, we first propose a signal-based approach to generate dysarthric Arabic speech from healthy Arabic speech by modifying its speed and tempo. We also propose a second stage Parallel Wave Generative (PWG) adversarial model that is trained on an English dysarthric dataset to capture language-independant dysarthric speech patterns and further augment the signal-adjusted speech samples. Furthermore, we propose a fine-tuning and text-correction strategies for Arabic Conformer at different dysarthric speech severity levels. Our fine-tuned Conformer achieved 18",
    "link": "http://arxiv.org/abs/2306.04368",
    "context": "Title: Arabic Dysarthric Speech Recognition Using Adversarial and Signal-Based Augmentation. (arXiv:2306.04368v1 [cs.SD])\nAbstract: Despite major advancements in Automatic Speech Recognition (ASR), the state-of-the-art ASR systems struggle to deal with impaired speech even with high-resource languages. In Arabic, this challenge gets amplified, with added complexities in collecting data from dysarthric speakers. In this paper, we aim to improve the performance of Arabic dysarthric automatic speech recognition through a multi-stage augmentation approach. To this effect, we first propose a signal-based approach to generate dysarthric Arabic speech from healthy Arabic speech by modifying its speed and tempo. We also propose a second stage Parallel Wave Generative (PWG) adversarial model that is trained on an English dysarthric dataset to capture language-independant dysarthric speech patterns and further augment the signal-adjusted speech samples. Furthermore, we propose a fine-tuning and text-correction strategies for Arabic Conformer at different dysarthric speech severity levels. Our fine-tuned Conformer achieved 18",
    "path": "papers/23/06/2306.04368.json",
    "total_tokens": 1013,
    "translated_title": "使用对抗网络和信号增强技术的阿拉伯语发音障碍者语音识别",
    "translated_abstract": "尽管自动语音识别（ASR）已取得了重大进展，但现有最先进的ASR系统在处理受损语音时仍然很困难，甚至对于高资源语言也是如此。在阿拉伯语中，由于从发音障碍患者那里收集数据的复杂性，这一挑战更加严峻。本文旨在通过多阶段增强方法改善阿拉伯语发音障碍自动语音识别的表现。为此，我们首先提出了一种基于信号的方法，通过修改速度和节奏从健康的阿拉伯语音中生成发音障碍阿拉伯语音。我们还提出了一个第二阶段并行生成对抗模型（PWG），在训练英文发音障碍数据集的基础上，捕捉语言无关的发音障碍语音模式，并进一步增强信号调整的语音样本。此外，我们还提出了一些阿拉伯语Conformer的微调和文本更正策略，以适应不同程度的发音障碍。我们微调的Conformer在一项经过标记的发音障碍阿拉伯语数据集上取得了18%的字词错误率优于先前的方法。",
    "tldr": "本文通过多阶段增强方法改善阿拉伯语发音障碍自动语音识别的表现，并提出了一些阿拉伯语Conformer的微调和更正策略，取得了较优异的结果。"
}