{
    "title": "Dynamic Causal Graph Convolutional Network for Traffic Prediction. (arXiv:2306.07019v2 [cs.LG] UPDATED)",
    "abstract": "Modeling complex spatiotemporal dependencies in correlated traffic series is essential for traffic prediction. While recent works have shown improved prediction performance by using neural networks to extract spatiotemporal correlations, their effectiveness depends on the quality of the graph structures used to represent the spatial topology of the traffic network. In this work, we propose a novel approach for traffic prediction that embeds time-varying dynamic Bayesian network to capture the fine spatiotemporal topology of traffic data. We then use graph convolutional networks to generate traffic forecasts. To enable our method to efficiently model nonlinear traffic propagation patterns, we develop a deep learning-based module as a hyper-network to generate stepwise dynamic causal graphs. Our experimental results on a real traffic dataset demonstrate the superior prediction performance of the proposed method. The code is available at https://github.com/MonBG/DCGCN.",
    "link": "http://arxiv.org/abs/2306.07019",
    "context": "Title: Dynamic Causal Graph Convolutional Network for Traffic Prediction. (arXiv:2306.07019v2 [cs.LG] UPDATED)\nAbstract: Modeling complex spatiotemporal dependencies in correlated traffic series is essential for traffic prediction. While recent works have shown improved prediction performance by using neural networks to extract spatiotemporal correlations, their effectiveness depends on the quality of the graph structures used to represent the spatial topology of the traffic network. In this work, we propose a novel approach for traffic prediction that embeds time-varying dynamic Bayesian network to capture the fine spatiotemporal topology of traffic data. We then use graph convolutional networks to generate traffic forecasts. To enable our method to efficiently model nonlinear traffic propagation patterns, we develop a deep learning-based module as a hyper-network to generate stepwise dynamic causal graphs. Our experimental results on a real traffic dataset demonstrate the superior prediction performance of the proposed method. The code is available at https://github.com/MonBG/DCGCN.",
    "path": "papers/23/06/2306.07019.json",
    "total_tokens": 865,
    "translated_title": "动态因果图卷积网络用于交通预测",
    "translated_abstract": "对相关交通序列中的复杂时空依赖关系进行建模对于交通预测至关重要。尽管最近的研究通过使用神经网络来提取时空相关性，已经展示了预测性能的提升，但其有效性取决于用于表示交通网络的空间拓扑的图结构的质量。在这项工作中，我们提出了一种新的交通预测方法，将时间变化的动态贝叶斯网络嵌入到交通数据的细粒度时空拓扑中。然后，我们使用图卷积网络生成交通预测。为了使我们的方法能够有效地模拟非线性交通传播模式，我们开发了一个基于深度学习的模块作为超网络来生成逐步动态因果图。我们在真实的交通数据集上的实验结果展示了所提方法的优越预测性能。代码可在 https://github.com/MonBG/DCGCN 找到。",
    "tldr": "本文提出了一种动态因果图卷积网络的交通预测方法，通过嵌入时间变化的动态贝叶斯网络和使用图卷积网络来生成交通预测，能够有效地预测交通数据的非线性传播模式。",
    "en_tdlr": "This paper proposes a dynamic causal graph convolutional network for traffic prediction, which embeds a time-varying dynamic Bayesian network and uses graph convolutional networks to generate traffic forecasts, effectively predicting the nonlinear propagation patterns of traffic data."
}