{
    "title": "Recognition of Handwritten Japanese Characters Using Ensemble of Convolutional Neural Networks. (arXiv:2306.03954v1 [cs.CV])",
    "abstract": "The Japanese writing system is complex, with three character types of Hiragana, Katakana, and Kanji. Kanji consists of thousands of unique characters, further adding to the complexity of character identification and literature understanding. Being able to translate handwritten Japanese characters into digital text is useful for data analysis, translation, learning and cultural preservation. In this study, a machine learning approach to analyzing and recognizing handwritten Japanese characters (Kanji) is proposed. The study used an ensemble of three convolutional neural networks (CNNs) for recognizing handwritten Kanji characters and utilized four datasets of MNIST, K-MNIST, Kuzushiji-49 (K49) and the top 150 represented classes in the Kuzushiji-Kanji (K-Kanji) dataset for its performance evaluation. The results indicate feasibility of using proposed CNN-ensemble architecture for recognizing handwritten characters, achieving 99.4%, 96.4%, 95.0% and 96.4% classification accuracy on MNIST",
    "link": "http://arxiv.org/abs/2306.03954",
    "context": "Title: Recognition of Handwritten Japanese Characters Using Ensemble of Convolutional Neural Networks. (arXiv:2306.03954v1 [cs.CV])\nAbstract: The Japanese writing system is complex, with three character types of Hiragana, Katakana, and Kanji. Kanji consists of thousands of unique characters, further adding to the complexity of character identification and literature understanding. Being able to translate handwritten Japanese characters into digital text is useful for data analysis, translation, learning and cultural preservation. In this study, a machine learning approach to analyzing and recognizing handwritten Japanese characters (Kanji) is proposed. The study used an ensemble of three convolutional neural networks (CNNs) for recognizing handwritten Kanji characters and utilized four datasets of MNIST, K-MNIST, Kuzushiji-49 (K49) and the top 150 represented classes in the Kuzushiji-Kanji (K-Kanji) dataset for its performance evaluation. The results indicate feasibility of using proposed CNN-ensemble architecture for recognizing handwritten characters, achieving 99.4%, 96.4%, 95.0% and 96.4% classification accuracy on MNIST",
    "path": "papers/23/06/2306.03954.json",
    "total_tokens": 876,
    "translated_title": "使用卷积神经网络集合识别手写日语字符",
    "translated_abstract": "日本书写系统复杂，包括平假名、片假名和汉字三种字符类型。汉字包括数千个不同的字符，进一步增加了对字符的识别和理解难度。将手写日语字符转换为数字文本对于数据分析、翻译、学习和文化保护都很有用。本研究提出了一种机器学习方法来分析和识别手写日语字符（汉字）。研究使用了三个卷积神经网络（CNN）集合来识别手写日语汉字，并利用 MNIST、K-MNIST、Kuzushiji-49（K49）以及 Kuzushiji-Kanji（K-Kanji）中前150个重要类别的四个数据集进行性能评估。结果表明，使用提出的CNN-ensemble架构识别手写字符具有可行性，在MNIST上实现了99.4％、96.4％、95.0％和96.4％的分类准确率。",
    "tldr": "该研究提出了一种机器学习方法，即使用卷积神经网络集合来高效地识别手写汉字，能够实现高达99.4%的分类准确率。",
    "en_tdlr": "This study proposes a machine learning approach using an ensemble of convolutional neural networks to efficiently recognize handwritten Kanji characters with a classification accuracy as high as 99.4%."
}