{
    "title": "Explainable AI using expressive Boolean formulas. (arXiv:2306.03976v1 [cs.AI])",
    "abstract": "We propose and implement an interpretable machine learning classification model for Explainable AI (XAI) based on expressive Boolean formulas. Potential applications include credit scoring and diagnosis of medical conditions. The Boolean formula defines a rule with tunable complexity (or interpretability), according to which input data are classified. Such a formula can include any operator that can be applied to one or more Boolean variables, thus providing higher expressivity compared to more rigid rule-based and tree-based approaches. The classifier is trained using native local optimization techniques, efficiently searching the space of feasible formulas. Shallow rules can be determined by fast Integer Linear Programming (ILP) or Quadratic Unconstrained Binary Optimization (QUBO) solvers, potentially powered by special purpose hardware or quantum devices. We combine the expressivity and efficiency of the native local optimizer with the fast operation of these devices by executing n",
    "link": "http://arxiv.org/abs/2306.03976",
    "context": "Title: Explainable AI using expressive Boolean formulas. (arXiv:2306.03976v1 [cs.AI])\nAbstract: We propose and implement an interpretable machine learning classification model for Explainable AI (XAI) based on expressive Boolean formulas. Potential applications include credit scoring and diagnosis of medical conditions. The Boolean formula defines a rule with tunable complexity (or interpretability), according to which input data are classified. Such a formula can include any operator that can be applied to one or more Boolean variables, thus providing higher expressivity compared to more rigid rule-based and tree-based approaches. The classifier is trained using native local optimization techniques, efficiently searching the space of feasible formulas. Shallow rules can be determined by fast Integer Linear Programming (ILP) or Quadratic Unconstrained Binary Optimization (QUBO) solvers, potentially powered by special purpose hardware or quantum devices. We combine the expressivity and efficiency of the native local optimizer with the fast operation of these devices by executing n",
    "path": "papers/23/06/2306.03976.json",
    "total_tokens": 945,
    "translated_title": "使用表达式布尔公式的可解释人工智能",
    "translated_abstract": "我们提出并实现了一个可解释的机器学习分类模型，基于表达式布尔公式的可解释人工智能（XAI）。潜在的应用包括信用评分和医疗病况的诊断。布尔公式定义了一个规则，根据该规则将输入数据分类为可调整复杂度（或可解释性）。这样的公式可以包含应用于一个或多个布尔变量的任何运算符，因此具有比更严格的基于规则和基于树的方法更高的表达性。分类器使用本地优化技术进行训练，有效地搜索可行公式的空间。浅的规则可以通过快速整数线性规划（ILP）或二次无约束二进制优化（QUBO）求解器确定，可能由专用硬件或量子设备提供动力。我们通过执行本地优化器的表达能力和效率与这些设备的快速操作相结合，为未来的AI研究提供了新思路。",
    "tldr": "提出了一种表达式布尔公式的可解释人工智能，利用本地优化技术训练分类模型，可以应用于信用评分和医疗病况的诊断，并具有未来应用的潜力。",
    "en_tdlr": "The paper proposes an interpretable machine learning model for Explainable AI (XAI) using expressive Boolean formulas, which can be applied in credit scoring and medical diagnosis. The model defines a rule with tunable complexity using any operator that can be applied to one or more Boolean variables, providing higher expressivity compared to other rule-based and tree-based approaches. The classifier is trained using local optimization techniques and shallow rules can be determined using Integer Linear Programming (ILP) or Quadratic Unconstrained Binary Optimization (QUBO) solvers. The model has the potential to be powered by special purpose hardware or quantum devices."
}