{
    "title": "Balancing Exploration and Exploitation: Disentangled $\\beta$-CVAE in De Novo Drug Design. (arXiv:2306.01683v1 [cs.LG])",
    "abstract": "Deep generative models have recently emerged as a promising de novo drug design method. In this respect, deep generative conditional variational autoencoder (CVAE) models are a powerful approach for generating novel molecules with desired drug-like properties. However, molecular graph-based models with disentanglement and multivariate explicit latent conditioning have not been fully elucidated. To address this, we proposed a molecular-graph $\\beta$-CVAE model for de novo drug design. Here, we empirically tuned the value of disentanglement and assessed its ability to generate molecules with optimised univariate- or-multivariate properties. In particular, we optimised the octanol-water partition coefficient (ClogP), molar refractivity (CMR), quantitative estimate of drug-likeness (QED), and synthetic accessibility score (SAS). Results suggest that a lower $\\beta$ value increases the uniqueness of generated molecules (exploration). Univariate optimisation results showed our model generate",
    "link": "http://arxiv.org/abs/2306.01683",
    "context": "Title: Balancing Exploration and Exploitation: Disentangled $\\beta$-CVAE in De Novo Drug Design. (arXiv:2306.01683v1 [cs.LG])\nAbstract: Deep generative models have recently emerged as a promising de novo drug design method. In this respect, deep generative conditional variational autoencoder (CVAE) models are a powerful approach for generating novel molecules with desired drug-like properties. However, molecular graph-based models with disentanglement and multivariate explicit latent conditioning have not been fully elucidated. To address this, we proposed a molecular-graph $\\beta$-CVAE model for de novo drug design. Here, we empirically tuned the value of disentanglement and assessed its ability to generate molecules with optimised univariate- or-multivariate properties. In particular, we optimised the octanol-water partition coefficient (ClogP), molar refractivity (CMR), quantitative estimate of drug-likeness (QED), and synthetic accessibility score (SAS). Results suggest that a lower $\\beta$ value increases the uniqueness of generated molecules (exploration). Univariate optimisation results showed our model generate",
    "path": "papers/23/06/2306.01683.json",
    "total_tokens": 886,
    "tldr": "本文提出了一个分子图$\\beta$-CVAE模型，通过调节分离值优化不同分子性质，结果表明较低的$\\beta$值可以增加生成的分子的独特性（探索），单变量优化显示出模型生成了一些具有良好性能的分子。",
    "en_tdlr": "This paper proposes a molecular-graph $\\beta$-CVAE model for de novo drug design, optimizing different molecular properties by adjusting the separation value, and the lower $\\beta$ value increases the uniqueness of generated molecules (exploration), showing some good performance molecules in univariate optimization."
}