{
    "title": "Low Latency Edge Classification GNN for Particle Trajectory Tracking on FPGAs. (arXiv:2306.11330v1 [cs.AR] CROSS LISTED)",
    "abstract": "In-time particle trajectory reconstruction in the Large Hadron Collider is challenging due to the high collision rate and numerous particle hits. Using GNN (Graph Neural Network) on FPGA has enabled superior accuracy with flexible trajectory classification. However, existing GNN architectures have inefficient resource usage and insufficient parallelism for edge classification. This paper introduces a resource-efficient GNN architecture on FPGAs for low latency particle tracking. The modular architecture facilitates design scalability to support large graphs. Leveraging the geometric properties of hit detectors further reduces graph complexity and resource usage. Our results on Xilinx UltraScale+ VU9P demonstrate 1625x and 1574x performance improvement over CPU and GPU respectively.",
    "link": "http://arxiv.org/abs/2306.11330",
    "context": "Title: Low Latency Edge Classification GNN for Particle Trajectory Tracking on FPGAs. (arXiv:2306.11330v1 [cs.AR] CROSS LISTED)\nAbstract: In-time particle trajectory reconstruction in the Large Hadron Collider is challenging due to the high collision rate and numerous particle hits. Using GNN (Graph Neural Network) on FPGA has enabled superior accuracy with flexible trajectory classification. However, existing GNN architectures have inefficient resource usage and insufficient parallelism for edge classification. This paper introduces a resource-efficient GNN architecture on FPGAs for low latency particle tracking. The modular architecture facilitates design scalability to support large graphs. Leveraging the geometric properties of hit detectors further reduces graph complexity and resource usage. Our results on Xilinx UltraScale+ VU9P demonstrate 1625x and 1574x performance improvement over CPU and GPU respectively.",
    "path": "papers/23/06/2306.11330.json",
    "total_tokens": 790,
    "translated_title": "基于FPGA的粒子轨迹跟踪的低延迟边缘分类GNN",
    "translated_abstract": "大型强子对撞机中实时粒子轨迹重建面临高碰撞率和众多粒子撞击的挑战。使用FPGA上的GNN（图神经网络）可以实现更高的准确率和灵活的轨迹分类。然而，现有的GNN架构在边缘分类方面资源利用效率低且并行性不足。本文在FPGA上引入了一种资源高效的GNN架构，用于低延迟粒子跟踪。模块化的架构便于设计扩展以支持大型图形。利用击中探测器的几何特性进一步减少了图形的复杂性和资源利用率。我们在Xilinx UltraScale+ VU9P上的实验结果表明，相对于CPU和GPU，性能提高了1625倍和1574倍。",
    "tldr": "本论文介绍了一种基于FPGA的GNN架构，在粒子跟踪中实现了低延迟和资源高效性，并实现了对现有CPU和GPU的数千倍上的性能提升。",
    "en_tdlr": "This paper introduces a resource-efficient GNN architecture on FPGA for low latency particle tracking, achieving thousands of times performance improvement over existing CPU and GPU methods."
}