{
    "title": "On the Behavior of the Payoff Amounts in Simple Interest Loans in Arbitrage-Free Markets. (arXiv:2306.17467v1 [q-fin.MF])",
    "abstract": "The Consumer Financial Protection Bureau defines the notion of payoff amount as the amount that has to be payed at a particular time in order to completely pay off the debt, in case the lender intends to pay off the loan early, way before the last installment is due (CFPB 2020). This amount is well-understood for loans at compound interest, but much less so when simple interest is used.  Recently, Aretusi and Mari (2018) have proposed a formula for the payoff amount for loans at simple interest. We assume that the payoff amounts are established contractually at time zero, whence the requirement that no arbitrage may arise this way  The first goal of this paper is to study this new formula and derive it within a model of a loan market in which loans are bought and sold at simple interest, interest rates change over time, and no arbitrage opportunities exist.  The second goal is to show that this formula exhibits a behaviour rather different from the one which occurs when compound intere",
    "link": "http://arxiv.org/abs/2306.17467",
    "context": "Title: On the Behavior of the Payoff Amounts in Simple Interest Loans in Arbitrage-Free Markets. (arXiv:2306.17467v1 [q-fin.MF])\nAbstract: The Consumer Financial Protection Bureau defines the notion of payoff amount as the amount that has to be payed at a particular time in order to completely pay off the debt, in case the lender intends to pay off the loan early, way before the last installment is due (CFPB 2020). This amount is well-understood for loans at compound interest, but much less so when simple interest is used.  Recently, Aretusi and Mari (2018) have proposed a formula for the payoff amount for loans at simple interest. We assume that the payoff amounts are established contractually at time zero, whence the requirement that no arbitrage may arise this way  The first goal of this paper is to study this new formula and derive it within a model of a loan market in which loans are bought and sold at simple interest, interest rates change over time, and no arbitrage opportunities exist.  The second goal is to show that this formula exhibits a behaviour rather different from the one which occurs when compound intere",
    "path": "papers/23/06/2306.17467.json",
    "total_tokens": 796,
    "translated_title": "在无套利市场中的简单利息贷款的回报金额行为研究",
    "translated_abstract": "消费者金融保护局定义了回报金额的概念，即在贷款提前偿还时，需要在特定时间支付的完全偿还债务的金额。在复利贷款中，这个金额被广泛理解，但在使用简单利息时不太清楚。最近，Aretusi和Mari（2018）提出了一种适用于简单利息贷款的回报金额公式。本文的第一个目标是研究这个新公式，并在一个贷款市场模型中推导出它，其中贷款以简单利息购买和出售，利率随时间变化，且不存在套利机会。第二个目标是展示这个公式表现出与复利贷款不同的行为。",
    "tldr": "本文研究了在无套利市场中的简单利息贷款的回报金额行为，并提出了适用于这种贷款的新的回报金额公式。",
    "en_tdlr": "This paper examines the behavior of payoff amounts in simple interest loans in arbitrage-free markets and proposes a new formula for these loans."
}