{
    "title": "Real-Time Online Unsupervised Domain Adaptation for Real-World Person Re-identification. (arXiv:2306.03993v1 [cs.CV])",
    "abstract": "Following the popularity of Unsupervised Domain Adaptation (UDA) in person re-identification, the recently proposed setting of Online Unsupervised Domain Adaptation (OUDA) attempts to bridge the gap towards practical applications by introducing a consideration of streaming data. However, this still falls short of truly representing real-world applications. This paper defines the setting of Real-world Real-time Online Unsupervised Domain Adaptation (R$^2$OUDA) for Person Re-identification. The R$^2$OUDA setting sets the stage for true real-world real-time OUDA, bringing to light four major limitations found in real-world applications that are often neglected in current research: system generated person images, subset distribution selection, time-based data stream segmentation, and a segment-based time constraint. To address all aspects of this new R$^2$OUDA setting, this paper further proposes Real-World Real-Time Online Streaming Mutual Mean-Teaching (R$^2$MMT), a novel multi-camera sy",
    "link": "http://arxiv.org/abs/2306.03993",
    "context": "Title: Real-Time Online Unsupervised Domain Adaptation for Real-World Person Re-identification. (arXiv:2306.03993v1 [cs.CV])\nAbstract: Following the popularity of Unsupervised Domain Adaptation (UDA) in person re-identification, the recently proposed setting of Online Unsupervised Domain Adaptation (OUDA) attempts to bridge the gap towards practical applications by introducing a consideration of streaming data. However, this still falls short of truly representing real-world applications. This paper defines the setting of Real-world Real-time Online Unsupervised Domain Adaptation (R$^2$OUDA) for Person Re-identification. The R$^2$OUDA setting sets the stage for true real-world real-time OUDA, bringing to light four major limitations found in real-world applications that are often neglected in current research: system generated person images, subset distribution selection, time-based data stream segmentation, and a segment-based time constraint. To address all aspects of this new R$^2$OUDA setting, this paper further proposes Real-World Real-Time Online Streaming Mutual Mean-Teaching (R$^2$MMT), a novel multi-camera sy",
    "path": "papers/23/06/2306.03993.json",
    "total_tokens": 979,
    "translated_title": "实时在线无监督领域自适应用于现实世界人员再识别",
    "translated_abstract": "随着无监督领域自适应（UDA）在人员再识别中的流行，最近提出的在线无监督领域自适应（OUDA）尝试通过引入数据流的考虑来弥合实际应用的差距。然而，这仍然无法真正代表真实的现实应用。本文定义了现实世界实时在线无监督领域自适应（R$^2$OUDA）。R$^2$OUDA设置了真正的现实世界实时OUDA的舞台，揭示了当前研究中经常被忽略的四个主要限制：系统生成的人员图像、子集分布选择、基于时间的数据流分割和基于分段的时间约束。为了解决这个新的R$^2$OUDA设置的所有方面，本文进一步提出了现实世界实时在线流式互相平均教学（R$^2$MMT），这是一种新颖的多摄像头系统。",
    "tldr": "本文提出了一个新的实时在线无监督领域自适应设置（R$^2$OUDA），并引入了一个新颖的多摄像头系统R$^2$MMT。通过R$^2$OUDA，本文解决了现实应用中被忽略的四个主要限制，以实现真正的实时在线无监督领域自适应。",
    "en_tdlr": "This paper introduces a new Real-world Real-time Online Unsupervised Domain Adaptation (R$^2$OUDA) setting and proposes a novel multi-camera system R$^2$MMT. R$^2$OUDA addresses four major limitations ignored in current research to achieve true real-time online unsupervised domain adaptation in real-world applications."
}