{
    "title": "Buying Information for Stochastic Optimization. (arXiv:2306.03607v1 [cs.DS])",
    "abstract": "Stochastic optimization is one of the central problems in Machine Learning and Theoretical Computer Science. In the standard model, the algorithm is given a fixed distribution known in advance. In practice though, one may acquire at a cost extra information to make better decisions. In this paper, we study how to buy information for stochastic optimization and formulate this question as an online learning problem. Assuming the learner has an oracle for the original optimization problem, we design a $2$-competitive deterministic algorithm and a $e/(e-1)$-competitive randomized algorithm for buying information. We show that this ratio is tight as the problem is equivalent to a robust generalization of the ski-rental problem, which we call super-martingale stopping.  We also consider an adaptive setting where the learner can choose to buy information after taking some actions for the underlying optimization problem. We focus on the classic optimization problem, Min-Sum Set Cover, where th",
    "link": "http://arxiv.org/abs/2306.03607",
    "context": "Title: Buying Information for Stochastic Optimization. (arXiv:2306.03607v1 [cs.DS])\nAbstract: Stochastic optimization is one of the central problems in Machine Learning and Theoretical Computer Science. In the standard model, the algorithm is given a fixed distribution known in advance. In practice though, one may acquire at a cost extra information to make better decisions. In this paper, we study how to buy information for stochastic optimization and formulate this question as an online learning problem. Assuming the learner has an oracle for the original optimization problem, we design a $2$-competitive deterministic algorithm and a $e/(e-1)$-competitive randomized algorithm for buying information. We show that this ratio is tight as the problem is equivalent to a robust generalization of the ski-rental problem, which we call super-martingale stopping.  We also consider an adaptive setting where the learner can choose to buy information after taking some actions for the underlying optimization problem. We focus on the classic optimization problem, Min-Sum Set Cover, where th",
    "path": "papers/23/06/2306.03607.json",
    "total_tokens": 898,
    "translated_title": "购买信息用于随机优化",
    "translated_abstract": "随机优化是机器学习和理论计算机科学中的核心问题之一。在标准模型中，算法会提前给出一个固定的分布。但在实践中，可能需要花费额外的代价来获取更好的决策所需的信息。本文研究了如何购买信息以进行随机优化，并将这个问题形式化为一个在线学习问题。假设学习者有原始优化问题的预言机，我们设计了一个 $2$- 竞争性确定性算法和一个 $e/(e-1)$- 竞争性随机算法来购买信息。我们证明了这个比率是最紧的，因为这个问题等价于一个称为超级鞅停止的滑雪租用问题的鲁棒泛化。我们还考虑了一个自适应设置，在这种设置下，学习者可以在对底层优化问题采取一些行动后选择购买信息。我们专注于经典的优化问题，最小化总集覆盖，其中th",
    "tldr": "本论文研究了如何购买信息用于随机优化，设计了一个2竞争性的确定性算法和一个e/(e-1)竞争性的随机算法来购买信息，证明了这个比率是最紧的，还考虑了一个自适应设置。",
    "en_tdlr": "This paper studies how to buy information for stochastic optimization, designs a 2-competitive deterministic algorithm and a e/(e-1)-competitive randomized algorithm for buying information, proves the ratio is tight, and considers an adaptive setting."
}