{
    "title": "Evaluating ChatGPT's Decimal Skills and Feedback Generation in a Digital Learning Game. (arXiv:2306.16639v1 [cs.HC])",
    "abstract": "While open-ended self-explanations have been shown to promote robust learning in multiple studies, they pose significant challenges to automated grading and feedback in technology-enhanced learning, due to the unconstrained nature of the students' input. Our work investigates whether recent advances in Large Language Models, and in particular ChatGPT, can address this issue. Using decimal exercises and student data from a prior study of the learning game Decimal Point, with more than 5,000 open-ended self-explanation responses, we investigate ChatGPT's capability in (1) solving the in-game exercises, (2) determining the correctness of students' answers, and (3) providing meaningful feedback to incorrect answers. Our results showed that ChatGPT can respond well to conceptual questions, but struggled with decimal place values and number line problems. In addition, it was able to accurately assess the correctness of 75% of the students' answers and generated generally high-quality feedbac",
    "link": "http://arxiv.org/abs/2306.16639",
    "context": "Title: Evaluating ChatGPT's Decimal Skills and Feedback Generation in a Digital Learning Game. (arXiv:2306.16639v1 [cs.HC])\nAbstract: While open-ended self-explanations have been shown to promote robust learning in multiple studies, they pose significant challenges to automated grading and feedback in technology-enhanced learning, due to the unconstrained nature of the students' input. Our work investigates whether recent advances in Large Language Models, and in particular ChatGPT, can address this issue. Using decimal exercises and student data from a prior study of the learning game Decimal Point, with more than 5,000 open-ended self-explanation responses, we investigate ChatGPT's capability in (1) solving the in-game exercises, (2) determining the correctness of students' answers, and (3) providing meaningful feedback to incorrect answers. Our results showed that ChatGPT can respond well to conceptual questions, but struggled with decimal place values and number line problems. In addition, it was able to accurately assess the correctness of 75% of the students' answers and generated generally high-quality feedbac",
    "path": "papers/23/06/2306.16639.json",
    "total_tokens": 880,
    "translated_title": "评估ChatGPT在数字学习游戏中的十进制技能和反馈生成能力",
    "translated_abstract": "尽管多项研究表明自由解释能够促进健全学习，但由于学生输入的无限制性质，这在技术增强学习的自动评分和反馈中产生了重大挑战。我们的工作研究了最新的大型语言模型（特别是ChatGPT）能否解决这个问题。我们使用了从前一项十进制游戏学习研究中获得的数字练习和学生数据，包括5000多个自由解释回答，研究了ChatGPT在以下方面的能力：(1)解决游戏中的练习，(2)确定学生答案的正确性，以及(3)为错误答案提供有意义的反馈。我们的结果显示，ChatGPT能够很好地回答概念问题，但在十进制位和数线问题上存在困难。此外，它能够正确评估75%的学生答案的正确性，并生成通常具有较高质量的反馈。",
    "tldr": "本研究评估了ChatGPT在数字学习游戏中解决十进制问题、判断学生答案正确性和提供有意义反馈的能力。结果显示，ChatGPT能够在概念问题上表现良好，但在十进制位和数线问题上存在困难。"
}