{
    "title": "Artificial Intelligence can facilitate selfish decisions by altering the appearance of interaction partners. (arXiv:2306.04484v1 [cs.AI])",
    "abstract": "The increasing prevalence of image-altering filters on social media and video conferencing technologies has raised concerns about the ethical and psychological implications of using Artificial Intelligence (AI) to manipulate our perception of others. In this study, we specifically investigate the potential impact of blur filters, a type of appearance-altering technology, on individuals' behavior towards others. Our findings consistently demonstrate a significant increase in selfish behavior directed towards individuals whose appearance is blurred, suggesting that blur filters can facilitate moral disengagement through depersonalization. These results emphasize the need for broader ethical discussions surrounding AI technologies that modify our perception of others, including issues of transparency, consent, and the awareness of being subject to appearance manipulation by others. We also emphasize the importance of anticipatory experiments in informing the development of responsible gui",
    "link": "http://arxiv.org/abs/2306.04484",
    "context": "Title: Artificial Intelligence can facilitate selfish decisions by altering the appearance of interaction partners. (arXiv:2306.04484v1 [cs.AI])\nAbstract: The increasing prevalence of image-altering filters on social media and video conferencing technologies has raised concerns about the ethical and psychological implications of using Artificial Intelligence (AI) to manipulate our perception of others. In this study, we specifically investigate the potential impact of blur filters, a type of appearance-altering technology, on individuals' behavior towards others. Our findings consistently demonstrate a significant increase in selfish behavior directed towards individuals whose appearance is blurred, suggesting that blur filters can facilitate moral disengagement through depersonalization. These results emphasize the need for broader ethical discussions surrounding AI technologies that modify our perception of others, including issues of transparency, consent, and the awareness of being subject to appearance manipulation by others. We also emphasize the importance of anticipatory experiments in informing the development of responsible gui",
    "path": "papers/23/06/2306.04484.json",
    "total_tokens": 866,
    "translated_title": "人工智能可以通过修改互动伙伴的外貌来促进自私决策",
    "translated_abstract": "社交媒体和视频会议技术中越来越普遍的图像改变滤镜引起了关于使用人工智能（AI）操纵我们对他人的认知的伦理和心理影响的担忧。本研究重点研究了模糊滤镜——一种外观改变技术——对个体对待他人行为的潜在影响。我们的发现一致表明，对那些外貌被模糊的人显示出更多的自私行为，这表明模糊滤镜可以通过非个性化促进道德缩减。这些结果强调有关修改我们对他人的认知的AI技术的更广泛的伦理讨论的必要性，包括透明度、同意和意识到被他人的外貌操作所影响的问题。我们还强调先发性的实验在引导负责任的Gui开发方面的重要性。",
    "tldr": "本研究发现，通过模糊滤镜等外观改变技术，人工智能可以导致个体对模糊他人的自私行为增加，这表明其可以通过非个性化促进道德缩减，需要更广泛的伦理讨论。",
    "en_tdlr": "This study found that artificial intelligence can increase individuals' selfish behavior towards others with blur filters and other appearance-altering technologies through depersonalization, emphasizing the need for ethical discussions and anticipatory experiments."
}