{
    "title": "Zero-Shot Dialogue Relation Extraction by Relating Explainable Triggers and Relation Names. (arXiv:2306.06141v1 [cs.CL])",
    "abstract": "Developing dialogue relation extraction (DRE) systems often requires a large amount of labeled data, which can be costly and time-consuming to annotate. In order to improve scalability and support diverse, unseen relation extraction, this paper proposes a method for leveraging the ability to capture triggers and relate them to previously unseen relation names. Specifically, we introduce a model that enables zero-shot dialogue relation extraction by utilizing trigger-capturing capabilities. Our experiments on a benchmark DialogRE dataset demonstrate that the proposed model achieves significant improvements for both seen and unseen relations. Notably, this is the first attempt at zero-shot dialogue relation extraction using trigger-capturing capabilities, and our results suggest that this approach is effective for inferring previously unseen relation types. Overall, our findings highlight the potential for this method to enhance the scalability and practicality of DRE systems.",
    "link": "http://arxiv.org/abs/2306.06141",
    "context": "Title: Zero-Shot Dialogue Relation Extraction by Relating Explainable Triggers and Relation Names. (arXiv:2306.06141v1 [cs.CL])\nAbstract: Developing dialogue relation extraction (DRE) systems often requires a large amount of labeled data, which can be costly and time-consuming to annotate. In order to improve scalability and support diverse, unseen relation extraction, this paper proposes a method for leveraging the ability to capture triggers and relate them to previously unseen relation names. Specifically, we introduce a model that enables zero-shot dialogue relation extraction by utilizing trigger-capturing capabilities. Our experiments on a benchmark DialogRE dataset demonstrate that the proposed model achieves significant improvements for both seen and unseen relations. Notably, this is the first attempt at zero-shot dialogue relation extraction using trigger-capturing capabilities, and our results suggest that this approach is effective for inferring previously unseen relation types. Overall, our findings highlight the potential for this method to enhance the scalability and practicality of DRE systems.",
    "path": "papers/23/06/2306.06141.json",
    "total_tokens": 875,
    "translated_title": "基于可解释触发器和关系名称相关联的无监督对话关系抽取",
    "translated_abstract": "开发对话关系抽取（DRE）系统通常需要大量标记的数据，而这些数据的标注可能会很昂贵且耗时。为了提高可扩展性并支持多样化的、未见过的关系抽取，本文提出了一种利用捕捉触发器并将它们与以前未见过的关系名称相关联的方法。具体地，我们介绍了一种模型，通过利用捕捉触发器的能力实现无监督对话关系抽取。我们在DialogRE基准数据集上的实验表明，所提出的模型在已知和未知的关系方面都取得了显著的改进。值得注意的是，这是首次尝试使用捕捉触发器实现无监督对话关系抽取，我们的结果表明，这种方法对于推断先前未见过的关系类型非常有效。总的来说，我们的研究结果突显了这种方法提高DRE系统的可扩展性和实用性的潜力。",
    "tldr": "本文提出了一种无监督对话关系抽取方法，它能够捕捉触发器并将其与以前未见过的关系名称相关联，能够对推断先前未见过的关系类型极具帮助。",
    "en_tdlr": "This paper proposes an unsupervised method for dialogue relation extraction that captures triggers and relates them to previously unseen relation names, which shows potential to enhance the scalability and practicality of DRE systems."
}