{
    "title": "Learning Conditional Instrumental Variable Representation for Causal Effect Estimation. (arXiv:2306.12453v1 [cs.LG])",
    "abstract": "One of the fundamental challenges in causal inference is to estimate the causal effect of a treatment on its outcome of interest from observational data. However, causal effect estimation often suffers from the impacts of confounding bias caused by unmeasured confounders that affect both the treatment and the outcome. The instrumental variable (IV) approach is a powerful way to eliminate the confounding bias from latent confounders. However, the existing IV-based estimators require a nominated IV, and for a conditional IV (CIV) the corresponding conditioning set too, for causal effect estimation. This limits the application of IV-based estimators. In this paper, by leveraging the advantage of disentangled representation learning, we propose a novel method, named DVAE.CIV, for learning and disentangling the representations of CIV and the representations of its conditioning set for causal effect estimations from data with latent confounders. Extensive experimental results on both synthet",
    "link": "http://arxiv.org/abs/2306.12453",
    "context": "Title: Learning Conditional Instrumental Variable Representation for Causal Effect Estimation. (arXiv:2306.12453v1 [cs.LG])\nAbstract: One of the fundamental challenges in causal inference is to estimate the causal effect of a treatment on its outcome of interest from observational data. However, causal effect estimation often suffers from the impacts of confounding bias caused by unmeasured confounders that affect both the treatment and the outcome. The instrumental variable (IV) approach is a powerful way to eliminate the confounding bias from latent confounders. However, the existing IV-based estimators require a nominated IV, and for a conditional IV (CIV) the corresponding conditioning set too, for causal effect estimation. This limits the application of IV-based estimators. In this paper, by leveraging the advantage of disentangled representation learning, we propose a novel method, named DVAE.CIV, for learning and disentangling the representations of CIV and the representations of its conditioning set for causal effect estimations from data with latent confounders. Extensive experimental results on both synthet",
    "path": "papers/23/06/2306.12453.json",
    "total_tokens": 938,
    "translated_title": "学习条件工具变量表示用于因果效应估计",
    "translated_abstract": "因果推断中的一个基本挑战是从观察数据中估计治疗对感兴趣结果的因果效应。然而，因果效应估计经常受到混淆偏差的影响，这是由于未测量的混淆因素影响了治疗和结果。 工具变量 (IV) 方法是消除潜在混淆因素的混淆偏差的有效方法。然而，现有的基于 IV 的估计器需要有一个被提名的 IV，而对于条件 IV (CIV) 进行因果效应估计需要其相应的条件集。 基于这种限制，我们提出了一种名为 DVAE.CIV 的新方法，通过利用分离表示学习的优势，从具有混淆因素的数据中学习并分解 CIV 的表示和其条件集的表示，用于因果效应估计。在合成和实际数据集上的大量实验结果证明了所提出方法的有效性，包括准确性和对混淆偏差的鲁棒性。",
    "tldr": "本文提出了一种名为 DVAE.CIV 的方法，通过分离表示学习，从带有潜在混淆因素的数据中学习和分解条件 IV 和其条件集的表示，用于因果效应估计。",
    "en_tdlr": "This paper proposes a novel method named DVAE.CIV, which leverages disentangled representation learning to estimate the causal effect of a treatment on its outcome of interest from data with latent confounders by learning and disentangling the representations of conditional IV and its conditioning set."
}