{
    "title": "Covariance Adaptive Best Arm Identification. (arXiv:2306.02630v1 [stat.ML])",
    "abstract": "We consider the problem of best arm identification in the multi-armed bandit model, under fixed confidence. Given a confidence input $\\delta$, the goal is to identify the arm with the highest mean reward with a probability of at least 1 -- $\\delta$, while minimizing the number of arm pulls. While the literature provides solutions to this problem under the assumption of independent arms distributions, we propose a more flexible scenario where arms can be dependent and rewards can be sampled simultaneously. This framework allows the learner to estimate the covariance among the arms distributions, enabling a more efficient identification of the best arm. The relaxed setting we propose is relevant in various applications, such as clinical trials, where similarities between patients or drugs suggest underlying correlations in the outcomes. We introduce new algorithms that adapt to the unknown covariance of the arms and demonstrate through theoretical guarantees that substantial improvement ",
    "link": "http://arxiv.org/abs/2306.02630",
    "context": "Title: Covariance Adaptive Best Arm Identification. (arXiv:2306.02630v1 [stat.ML])\nAbstract: We consider the problem of best arm identification in the multi-armed bandit model, under fixed confidence. Given a confidence input $\\delta$, the goal is to identify the arm with the highest mean reward with a probability of at least 1 -- $\\delta$, while minimizing the number of arm pulls. While the literature provides solutions to this problem under the assumption of independent arms distributions, we propose a more flexible scenario where arms can be dependent and rewards can be sampled simultaneously. This framework allows the learner to estimate the covariance among the arms distributions, enabling a more efficient identification of the best arm. The relaxed setting we propose is relevant in various applications, such as clinical trials, where similarities between patients or drugs suggest underlying correlations in the outcomes. We introduce new algorithms that adapt to the unknown covariance of the arms and demonstrate through theoretical guarantees that substantial improvement ",
    "path": "papers/23/06/2306.02630.json",
    "total_tokens": 823,
    "translated_title": "协方差自适应最佳臂识别问题",
    "translated_abstract": "本文研究了在多臂老虎机模型下，基于固定置信度的最佳臂识别问题。在给定置信度 $\\delta$ 的情况下，旨在以至少 1 - $\\delta$ 的概率识别出具有最高平均奖励的臂，同时最小化臂的拉动次数。虽然文献提供了针对独立臂分布假设下该问题的解决方案，但我们提出了一个更加灵活的情形，其中臂可以是相关的，并且收益可以同时进行采样。该框架允许学习者估计臂之间分布的协方差，从而更有效地识别最佳臂。我们提出了适应臂协方差的新算法，并通过理论保证证明其具有实质性改进。",
    "tldr": "本文提出了一个协方差自适应的最佳臂识别问题，相较于独立臂分布假设下的解决方案，能更有效地识别出高平均奖励的臂，适用于临床试验等场景。",
    "en_tdlr": "This paper proposes a covariance adaptive best arm identification problem, which can more efficiently identify the arm with the highest mean reward compared to solutions under the assumption of independent arm distributions, and is applicable to scenarios such as clinical trials."
}