{
    "title": "Permutation invariant Gaussian matrix models for financial correlation matrices. (arXiv:2306.04569v1 [q-fin.ST])",
    "abstract": "We construct an ensemble of correlation matrices from high-frequency foreign exchange market data, with one matrix for every day for 446 days. The matrices are symmetric and have vanishing diagonal elements after subtracting the identity matrix. For this case, we construct the general permutation invariant Gaussian matrix model, which has 4 parameters characterised using the representation theory of symmetric groups. The permutation invariant polynomial functions of the symmetric, diagonally vanishing matrices have a basis labelled by undirected loop-less graphs. Using the expectation values of the general linear and quadratic permutation invariant functions of the matrices in the dataset, the 4 parameters of the matrix model are determined. The model then predicts the expectation values of the cubic and quartic polynomials. These predictions are compared to the data to give strong evidence for a good overall fit of the permutation invariant Gaussian matrix model. The linear, quadratic",
    "link": "http://arxiv.org/abs/2306.04569",
    "context": "Title: Permutation invariant Gaussian matrix models for financial correlation matrices. (arXiv:2306.04569v1 [q-fin.ST])\nAbstract: We construct an ensemble of correlation matrices from high-frequency foreign exchange market data, with one matrix for every day for 446 days. The matrices are symmetric and have vanishing diagonal elements after subtracting the identity matrix. For this case, we construct the general permutation invariant Gaussian matrix model, which has 4 parameters characterised using the representation theory of symmetric groups. The permutation invariant polynomial functions of the symmetric, diagonally vanishing matrices have a basis labelled by undirected loop-less graphs. Using the expectation values of the general linear and quadratic permutation invariant functions of the matrices in the dataset, the 4 parameters of the matrix model are determined. The model then predicts the expectation values of the cubic and quartic polynomials. These predictions are compared to the data to give strong evidence for a good overall fit of the permutation invariant Gaussian matrix model. The linear, quadratic",
    "path": "papers/23/06/2306.04569.json",
    "total_tokens": 965,
    "translated_title": "金融相关矩阵的置换不变高斯矩阵模型",
    "translated_abstract": "我们使用高频外汇市场数据构建了一个包含446天每天一个矩阵的相关矩阵集合。这些矩阵是对称的，减去单位矩阵后对角元素为零。针对该情况，我们构建了一般的置换不变高斯矩阵模型，其中的4个参数是由对称群的表示理论所刻画的。对称的、对角线为零的矩阵的置换不变多项式函数有一个基，由无向无环图标记。使用数据集中矩阵的一般线性和二次置换不变函数的期望值，我们确定了矩阵模型的4个参数。然后，该模型可以预测三次和四次多项式的期望值。通过将这些预测与数据进行比较，我们可以得到强有力的证据，证明置换不变高斯矩阵模型具有良好的整体拟合效果。线性、二次和三次的预测结果都与Chen模型一致，Chen模型是一个标准的金融相关矩阵模型。",
    "tldr": "使用高频外汇市场数据构建了一个包含446天每天一个矩阵的相关矩阵集合，构建了一个可预测三次和四次多项式期望值的置换不变高斯矩阵模型，并表明该模型预测结果与传统金融相关矩阵模型一致。",
    "en_tdlr": "A permutation invariant Gaussian matrix model is constructed for a collection of symmetric matrices with vanishing diagonal elements, based on high-frequency foreign exchange market data, which predicts the expectation values of cubic and quartic polynomials and shows good overall fit and consistency with a standard financial correlation matrix model."
}