{
    "title": "Internal Contrastive Learning for Generalized Out-of-distribution Fault Diagnosis (GOOFD) Framework. (arXiv:2306.15266v1 [cs.AI])",
    "abstract": "Fault diagnosis is essential in industrial processes for monitoring the conditions of important machines. With the ever-increasing complexity of working conditions and demand for safety during production and operation, different diagnosis methods are required, and more importantly, an integrated fault diagnosis system that can cope with multiple tasks is highly desired. However, the diagnosis subtasks are often studied separately, and the currently available methods still need improvement for such a generalized system. To address this issue, we propose the Generalized Out-of-distribution Fault Diagnosis (GOOFD) framework to integrate diagnosis subtasks, such as fault detection, fault classification, and novel fault diagnosis. Additionally, a unified fault diagnosis method based on internal contrastive learning is put forward to underpin the proposed generalized framework. The method extracts features utilizing the internal contrastive learning technique and then recognizes the outliers",
    "link": "http://arxiv.org/abs/2306.15266",
    "context": "Title: Internal Contrastive Learning for Generalized Out-of-distribution Fault Diagnosis (GOOFD) Framework. (arXiv:2306.15266v1 [cs.AI])\nAbstract: Fault diagnosis is essential in industrial processes for monitoring the conditions of important machines. With the ever-increasing complexity of working conditions and demand for safety during production and operation, different diagnosis methods are required, and more importantly, an integrated fault diagnosis system that can cope with multiple tasks is highly desired. However, the diagnosis subtasks are often studied separately, and the currently available methods still need improvement for such a generalized system. To address this issue, we propose the Generalized Out-of-distribution Fault Diagnosis (GOOFD) framework to integrate diagnosis subtasks, such as fault detection, fault classification, and novel fault diagnosis. Additionally, a unified fault diagnosis method based on internal contrastive learning is put forward to underpin the proposed generalized framework. The method extracts features utilizing the internal contrastive learning technique and then recognizes the outliers",
    "path": "papers/23/06/2306.15266.json",
    "total_tokens": 902,
    "translated_title": "内部对比学习用于广义离群故障诊断（GOOFD）框架",
    "translated_abstract": "故障诊断对于工业过程中监测重要机器的状态至关重要。随着工作条件的复杂化和生产运营过程中对安全的要求不断增加，需要不同的诊断方法，更重要的是需要一个可以应对多个任务的集成故障诊断系统。然而，诊断子任务通常被分开研究，而当前可用的方法在这样一个广义系统上仍需要改进。为了解决这个问题，我们提出了广义离群故障诊断（GOOFD）框架，以整合故障检测、故障分类和新颖故障诊断等诊断子任务。此外，我们提出了一种基于内部对比学习的统一故障诊断方法作为该广义框架的基础。该方法利用内部对比学习技术提取特征，然后识别异常值。",
    "tldr": "我们提出了一个称为广义离群故障诊断（GOOFD）框架的集成故障诊断系统，可以同时处理故障检测、故障分类和新颖故障诊断等任务。该框架基于内部对比学习方法，利用该方法提取特征并识别异常值。"
}