{
    "title": "Collaborative Robotic Biopsy with Trajectory Guidance and Needle Tip Force Feedback. (arXiv:2306.07129v2 [cs.RO] UPDATED)",
    "abstract": "The diagnostic value of biopsies is highly dependent on the placement of needles. Robotic trajectory guidance has been shown to improve needle positioning, but feedback for real-time navigation is limited. Haptic display of needle tip forces can provide rich feedback for needle navigation by enabling localization of tissue structures along the insertion path. We present a collaborative robotic biopsy system that combines trajectory guidance with kinesthetic feedback to assist the physician in needle placement. The robot aligns the needle while the insertion is performed in collaboration with a medical expert who controls the needle position on site. We present a needle design that senses forces at the needle tip based on optical coherence tomography and machine learning for real-time data processing. Our robotic setup allows operators to sense deep tissue interfaces independent of frictional forces to improve needle placement relative to a desired target structure. We first evaluate ne",
    "link": "http://arxiv.org/abs/2306.07129",
    "context": "Title: Collaborative Robotic Biopsy with Trajectory Guidance and Needle Tip Force Feedback. (arXiv:2306.07129v2 [cs.RO] UPDATED)\nAbstract: The diagnostic value of biopsies is highly dependent on the placement of needles. Robotic trajectory guidance has been shown to improve needle positioning, but feedback for real-time navigation is limited. Haptic display of needle tip forces can provide rich feedback for needle navigation by enabling localization of tissue structures along the insertion path. We present a collaborative robotic biopsy system that combines trajectory guidance with kinesthetic feedback to assist the physician in needle placement. The robot aligns the needle while the insertion is performed in collaboration with a medical expert who controls the needle position on site. We present a needle design that senses forces at the needle tip based on optical coherence tomography and machine learning for real-time data processing. Our robotic setup allows operators to sense deep tissue interfaces independent of frictional forces to improve needle placement relative to a desired target structure. We first evaluate ne",
    "path": "papers/23/06/2306.07129.json",
    "total_tokens": 964,
    "translated_title": "具有轨迹引导和针尖力反馈的协作机器人活检",
    "translated_abstract": "活检的诊断价值高度依赖于针头的放置。机器人轨迹引导已被证明能改善针头定位，但实时导航的反馈有限。针尖力的触觉显示可以通过使组织结构在插入路径上定位，为针头导航提供丰富的反馈。我们提出了一个协作的机器人活检系统，将轨迹引导与动觉反馈相结合，辅助医生进行针头放置。机器人在插入过程中调整针头的位置，与现场控制针头位置的医疗专家协作进行。我们提出了一种能够实时感知针尖力的针头设计，基于光学相干断层扫描和机器学习进行实时数据处理。我们的机器人设置允许操作人员独立于摩擦力感知深层组织界面，以改善相对于期望目标结构的针头放置。我们首先评估了...",
    "tldr": "这项研究介绍了一个具有轨迹引导和针尖力反馈的协作机器人活检系统，通过结合机器人的导航和医生的实时控制，提供了针头放置的辅助。研究中提出了一种能够实时感知针尖力的针头设计，通过此系统可以改善针头的定位，提高活检的准确性。",
    "en_tdlr": "This research presents a collaborative robotic biopsy system with trajectory guidance and needle tip force feedback, providing assistance for needle placement by combining robot navigation and real-time control by a medical expert. A needle design that can sense needle tip forces in real-time is proposed to improve needle positioning and increase the accuracy of biopsies."
}