{
    "title": "Factors Impacting the Quality of User Answers on Smartphones. (arXiv:2306.00627v2 [cs.HC] UPDATED)",
    "abstract": "So far, most research investigating the predictability of human behavior, such as mobility and social interactions, has focused mainly on the exploitation of sensor data. However, sensor data can be difficult to capture the subjective motivations behind the individuals' behavior. Understanding personal context (e.g., where one is and what they are doing) can greatly increase predictability. The main limitation is that human input is often missing or inaccurate. The goal of this paper is to identify factors that influence the quality of responses when users are asked about their current context. We find that two key factors influence the quality of responses: user reaction time and completion time. These factors correlate with various exogenous causes (e.g., situational context, time of day) and endogenous causes (e.g., procrastination attitude, mood). In turn, we study how these two factors impact the quality of responses.",
    "link": "http://arxiv.org/abs/2306.00627",
    "context": "Title: Factors Impacting the Quality of User Answers on Smartphones. (arXiv:2306.00627v2 [cs.HC] UPDATED)\nAbstract: So far, most research investigating the predictability of human behavior, such as mobility and social interactions, has focused mainly on the exploitation of sensor data. However, sensor data can be difficult to capture the subjective motivations behind the individuals' behavior. Understanding personal context (e.g., where one is and what they are doing) can greatly increase predictability. The main limitation is that human input is often missing or inaccurate. The goal of this paper is to identify factors that influence the quality of responses when users are asked about their current context. We find that two key factors influence the quality of responses: user reaction time and completion time. These factors correlate with various exogenous causes (e.g., situational context, time of day) and endogenous causes (e.g., procrastination attitude, mood). In turn, we study how these two factors impact the quality of responses.",
    "path": "papers/23/06/2306.00627.json",
    "total_tokens": 813,
    "translated_title": "影响智能手机用户答案质量的因素",
    "translated_abstract": "目前，大多数研究探究人类行为的可预测性，如移动和社交互动，主要集中在传感器数据的利用上。然而，传感器数据很难捕捉到个人行为背后的主观动机。理解个人的上下文（例如，他们所处的地方和正在做什么）可以大大提高可预测性。主要限制是人类输入经常缺失或不准确。本文的目标是确定影响用户被问及其当前上下文时响应质量的因素。我们发现，两个关键因素影响着响应质量：用户的反应时间和完成时间。这些因素与各种外部原因（例如，情境背景，时间）和内部原因（例如，拖延态度，心情）相关。然后，我们研究这两个因素如何影响响应的质量。",
    "tldr": "本论文研究影响用户答案质量的两个关键因素是反应时间和完成时间，并探究这些因素与外部和内部原因的相关性。",
    "en_tdlr": "This paper investigates the two key factors that influence the quality of user responses, reaction time and completion time, and explores their correlations with external and internal factors."
}