{
    "title": "Applying language models to algebraic topology: generating simplicial cycles using multi-labeling in Wu's formula. (arXiv:2306.16951v1 [math.AT])",
    "abstract": "Computing homotopy groups of spheres has long been a fundamental objective in algebraic topology. Various theoretical and algorithmic approaches have been developed to tackle this problem. In this paper we take a step towards the goal of comprehending the group-theoretic structure of the generators of these homotopy groups by leveraging the power of machine learning. Specifically, in the simplicial group setting of Wu's formula, we reformulate the problem of generating simplicial cycles as a problem of sampling from the intersection of algorithmic datasets related to Dyck languages. We present and evaluate language modelling approaches that employ multi-label information for input sequences, along with the necessary group-theoretic toolkit and non-neural baselines.",
    "link": "http://arxiv.org/abs/2306.16951",
    "context": "Title: Applying language models to algebraic topology: generating simplicial cycles using multi-labeling in Wu's formula. (arXiv:2306.16951v1 [math.AT])\nAbstract: Computing homotopy groups of spheres has long been a fundamental objective in algebraic topology. Various theoretical and algorithmic approaches have been developed to tackle this problem. In this paper we take a step towards the goal of comprehending the group-theoretic structure of the generators of these homotopy groups by leveraging the power of machine learning. Specifically, in the simplicial group setting of Wu's formula, we reformulate the problem of generating simplicial cycles as a problem of sampling from the intersection of algorithmic datasets related to Dyck languages. We present and evaluate language modelling approaches that employ multi-label information for input sequences, along with the necessary group-theoretic toolkit and non-neural baselines.",
    "path": "papers/23/06/2306.16951.json",
    "total_tokens": 766,
    "translated_title": "应用语言模型到代数拓扑学：利用Wu公式中多标签的方法生成单纯循环",
    "translated_abstract": "计算球的同伦群一直是代数拓扑学中的一个基本目标。为了解决这个问题，已经发展了各种理论和算法方法。在本文中，我们通过利用机器学习的力量，向理解这些同伦群生成元的群论结构的目标迈进了一步。具体地，在Wu公式的单纯群设置中，我们将生成单纯循环的问题重新表述为从与Dyck语言相关的算法数据集的交集中采样的问题。我们介绍并评估了采用多标签信息作为输入序列的语言建模方法，以及必要的群论工具和非神经网络基准方法。",
    "tldr": "本论文利用语言模型和机器学习方法，将生成单纯循环的问题转化为从相关数据集中采样的问题，进一步理解了球的同伦群的生成元的群论结构。"
}