{
    "title": "Tackling Cooperative Incompatibility for Zero-Shot Human-AI Coordination. (arXiv:2306.03034v2 [cs.AI] UPDATED)",
    "abstract": "Securing coordination between AI agent and teammates (human players or AI agents) in contexts involving unfamiliar humans continues to pose a significant challenge in Zero-Shot Coordination. The issue of cooperative incompatibility becomes particularly prominent when an AI agent is unsuccessful in synchronizing with certain previously unknown partners. Traditional algorithms have aimed to collaborate with partners by optimizing fixed objectives within a population, fostering diversity in strategies and behaviors. However, these techniques may lead to learning loss and an inability to cooperate with specific strategies within the population, a phenomenon named cooperative incompatibility in learning. In order to solve cooperative incompatibility in learning and effectively address the problem in the context of ZSC, we introduce the Cooperative Open-ended LEarning (COLE) framework, which formulates open-ended objectives in cooperative games with two players using perspectives of graph th",
    "link": "http://arxiv.org/abs/2306.03034",
    "context": "Title: Tackling Cooperative Incompatibility for Zero-Shot Human-AI Coordination. (arXiv:2306.03034v2 [cs.AI] UPDATED)\nAbstract: Securing coordination between AI agent and teammates (human players or AI agents) in contexts involving unfamiliar humans continues to pose a significant challenge in Zero-Shot Coordination. The issue of cooperative incompatibility becomes particularly prominent when an AI agent is unsuccessful in synchronizing with certain previously unknown partners. Traditional algorithms have aimed to collaborate with partners by optimizing fixed objectives within a population, fostering diversity in strategies and behaviors. However, these techniques may lead to learning loss and an inability to cooperate with specific strategies within the population, a phenomenon named cooperative incompatibility in learning. In order to solve cooperative incompatibility in learning and effectively address the problem in the context of ZSC, we introduce the Cooperative Open-ended LEarning (COLE) framework, which formulates open-ended objectives in cooperative games with two players using perspectives of graph th",
    "path": "papers/23/06/2306.03034.json",
    "total_tokens": 907,
    "translated_title": "解决零样本人工智能协同中的协作不兼容性",
    "translated_abstract": "在涉及不熟悉的人类的情境中，确保人工智能代理和队友（人类玩家或者人工智能代理）之间的协调仍然是零样本协同中的重大挑战。当人工智能代理无法与某些先前未知的合作伙伴进行同步时，协作不兼容性问题特别突出。传统算法通过优化固定的目标在人口中合作，促进策略和行为的多样性来与合作伙伴合作。然而，这些技术可能导致学习损失，并且无法与人口中的特定策略合作，这种现象被称为学习中的协作不兼容性。为了解决学习中的协作不兼容性并有效地解决ZSC中的问题，我们引入了 Cooperative Open-ended LEarning（COLE）框架，该框架利用图形理论的视角，对两个玩家的合作游戏制定开放式目标。",
    "tldr": "本文提出了解决零样本人工智能协同中协作不兼容性的COLE框架，利用图形理论的视角，通过制定开放式目标，在涉及不熟悉的人类情境中确保人工智能代理和队友之间的协调。"
}