{
    "title": "Automatic Speech Recognition of Non-Native Child Speech for Language Learning Applications. (arXiv:2306.16710v1 [cs.CL])",
    "abstract": "Voicebots have provided a new avenue for supporting the development of language skills, particularly within the context of second language learning. Voicebots, though, have largely been geared towards native adult speakers. We sought to assess the performance of two state-of-the-art ASR systems, Wav2Vec2.0 and Whisper AI, with a view to developing a voicebot that can support children acquiring a foreign language. We evaluated their performance on read and extemporaneous speech of native and non-native Dutch children. We also investigated the utility of using ASR technology to provide insight into the children's pronunciation and fluency. The results show that recent, pre-trained ASR transformer-based models achieve acceptable performance from which detailed feedback on phoneme pronunciation quality can be extracted, despite the challenging nature of child and non-native speech.",
    "link": "http://arxiv.org/abs/2306.16710",
    "context": "Title: Automatic Speech Recognition of Non-Native Child Speech for Language Learning Applications. (arXiv:2306.16710v1 [cs.CL])\nAbstract: Voicebots have provided a new avenue for supporting the development of language skills, particularly within the context of second language learning. Voicebots, though, have largely been geared towards native adult speakers. We sought to assess the performance of two state-of-the-art ASR systems, Wav2Vec2.0 and Whisper AI, with a view to developing a voicebot that can support children acquiring a foreign language. We evaluated their performance on read and extemporaneous speech of native and non-native Dutch children. We also investigated the utility of using ASR technology to provide insight into the children's pronunciation and fluency. The results show that recent, pre-trained ASR transformer-based models achieve acceptable performance from which detailed feedback on phoneme pronunciation quality can be extracted, despite the challenging nature of child and non-native speech.",
    "path": "papers/23/06/2306.16710.json",
    "total_tokens": 849,
    "translated_title": "面向语言学习应用的非母语儿童语音识别",
    "translated_abstract": "语音机器人在支持语言技能发展方面提供了一种新途径，尤其是在第二语言学习的背景下。然而，语音机器人主要面向母语成年人。我们旨在评估两种最先进的ASR系统（Wav2Vec2.0和Whisper AI）的性能，以开发一种能够支持儿童习得外语的语音机器人。我们评估了它们对母语和非母语荷兰儿童的朗读和即兴演讲的表现。我们还研究了使用ASR技术提供对儿童发音和流利性的洞察的实用性。结果表明，最新的预训练ASR基于Transformer的模型能够实现可接受的性能，可以提取有关音素发音质量的详细反馈，尽管儿童和非母语的语音具有挑战性。",
    "tldr": "该论文评估了两种最新的语音识别系统在非母语儿童语音学习中的表现，并研究了使用语音识别技术提供对儿童发音和流利性的反馈的实用性。",
    "en_tdlr": "The paper evaluates the performance of two state-of-the-art ASR systems in non-native child speech learning and investigates the utility of using ASR technology to provide feedback on children's pronunciation and fluency."
}