{
    "title": "Collaborative and Distributed Bayesian Optimization via Consensus: Showcasing the Power of Collaboration for Optimal Design",
    "abstract": "arXiv:2306.14348v2 Announce Type: replace  Abstract: Optimal design is a critical yet challenging task within many applications. This challenge arises from the need for extensive trial and error, often done through simulations or running field experiments. Fortunately, sequential optimal design, also referred to as Bayesian optimization when using surrogates with a Bayesian flavor, has played a key role in accelerating the design process through efficient sequential sampling strategies. However, a key opportunity exists nowadays. The increased connectivity of edge devices sets forth a new collaborative paradigm for Bayesian optimization. A paradigm whereby different clients collaboratively borrow strength from each other by effectively distributing their experimentation efforts to improve and fast-track their optimal design process. To this end, we bring the notion of consensus to Bayesian optimization, where clients agree (i.e., reach a consensus) on their next-to-sample designs. Our ",
    "link": "https://arxiv.org/abs/2306.14348",
    "context": "Title: Collaborative and Distributed Bayesian Optimization via Consensus: Showcasing the Power of Collaboration for Optimal Design\nAbstract: arXiv:2306.14348v2 Announce Type: replace  Abstract: Optimal design is a critical yet challenging task within many applications. This challenge arises from the need for extensive trial and error, often done through simulations or running field experiments. Fortunately, sequential optimal design, also referred to as Bayesian optimization when using surrogates with a Bayesian flavor, has played a key role in accelerating the design process through efficient sequential sampling strategies. However, a key opportunity exists nowadays. The increased connectivity of edge devices sets forth a new collaborative paradigm for Bayesian optimization. A paradigm whereby different clients collaboratively borrow strength from each other by effectively distributing their experimentation efforts to improve and fast-track their optimal design process. To this end, we bring the notion of consensus to Bayesian optimization, where clients agree (i.e., reach a consensus) on their next-to-sample designs. Our ",
    "path": "papers/23/06/2306.14348.json",
    "total_tokens": 818,
    "translated_title": "合作和分布式贝叶斯优化 via 共识: 展示合作的力量用于最优设计",
    "translated_abstract": "最优设计在许多应用中是一个关键但具有挑战性的任务。这种挑战来自于需要进行大量的试验和错误，通常通过模拟或进行现场实验来完成。幸运的是，当使用带有贝叶斯风格的代理和高效的顺序抽样策略时，顺序最优设计，在贝叶斯优化下也扮演着加速设计过程的关键角色。然而，当今存在一个重要机遇。边缘设备的增加连接性为贝叶斯优化提供了一种新的合作范式。一种范式，通过有效地分配其实验努力，让不同客户端共同借鉴彼此的力量，以改善和快速推进其最优设计过程。为此，我们将共识的概念引入到贝叶斯优化中，客户端同意（即达成共识）其下一个采样设计。",
    "tldr": "通过引入共识概念实现了合作和分布式贝叶斯优化，充分展示了合作对于最优设计的重要作用",
    "en_tdlr": "The paper showcases the importance of collaboration for optimal design by introducing the concept of consensus to achieve collaborative and distributed Bayesian optimization."
}