{
    "title": "Traceable Group-Wise Self-Optimizing Feature Transformation Learning: A Dual Optimization Perspective. (arXiv:2306.16893v1 [cs.LG])",
    "abstract": "Feature transformation aims to reconstruct an effective representation space by mathematically refining the existing features. It serves as a pivotal approach to combat the curse of dimensionality, enhance model generalization, mitigate data sparsity, and extend the applicability of classical models. Existing research predominantly focuses on domain knowledge-based feature engineering or learning latent representations. However, these methods, while insightful, lack full automation and fail to yield a traceable and optimal representation space. An indispensable question arises: Can we concurrently address these limitations when reconstructing a feature space for a machine-learning task? Our initial work took a pioneering step towards this challenge by introducing a novel self-optimizing framework. This framework leverages the power of three cascading reinforced agents to automatically select candidate features and operations for generating improved feature transformation combinations. ",
    "link": "http://arxiv.org/abs/2306.16893",
    "context": "Title: Traceable Group-Wise Self-Optimizing Feature Transformation Learning: A Dual Optimization Perspective. (arXiv:2306.16893v1 [cs.LG])\nAbstract: Feature transformation aims to reconstruct an effective representation space by mathematically refining the existing features. It serves as a pivotal approach to combat the curse of dimensionality, enhance model generalization, mitigate data sparsity, and extend the applicability of classical models. Existing research predominantly focuses on domain knowledge-based feature engineering or learning latent representations. However, these methods, while insightful, lack full automation and fail to yield a traceable and optimal representation space. An indispensable question arises: Can we concurrently address these limitations when reconstructing a feature space for a machine-learning task? Our initial work took a pioneering step towards this challenge by introducing a novel self-optimizing framework. This framework leverages the power of three cascading reinforced agents to automatically select candidate features and operations for generating improved feature transformation combinations. ",
    "path": "papers/23/06/2306.16893.json",
    "total_tokens": 881,
    "translated_title": "可追溯的群体化自优化特征转换学习：双重优化视角",
    "translated_abstract": "特征转换旨在通过数学上的改进现有特征来重构一个有效的表示空间。它是应对维度灾难、增强模型泛化能力、减少数据稀疏性和扩展经典模型适用性的关键方法。现有研究主要集中在基于领域知识的特征工程或学习潜在表示方面。然而，这些方法虽然有见地，但缺乏完全自动化，并且无法产生可追溯且最优的表示空间。一个不可或缺的问题是：在为机器学习任务重构特征空间时，我们能否同时解决这些限制？我们的初步工作通过引入一种新颖的自优化框架朝着这个挑战迈出了开创性的一步。这个框架利用了三个级联强化代理的力量，自动选择候选特征和操作，生成改进的特征转换组合。",
    "tldr": "本论文提出了一种可追溯的群体化自优化特征转换学习方法，并引入了一个新颖的自优化框架，利用三个级联强化代理自动选择候选特征和操作，生成改进的特征转换组合。"
}