{
    "title": "Designing Explainable Predictive Machine Learning Artifacts: Methodology and Practical Demonstration. (arXiv:2306.11771v1 [cs.SE])",
    "abstract": "Prediction-oriented machine learning is becoming increasingly valuable to organizations, as it may drive applications in crucial business areas. However, decision-makers from companies across various industries are still largely reluctant to employ applications based on modern machine learning algorithms. We ascribe this issue to the widely held view on advanced machine learning algorithms as \"black boxes\" whose complexity does not allow for uncovering the factors that drive the output of a corresponding system. To contribute to overcome this adoption barrier, we argue that research in information systems should devote more attention to the design of prototypical prediction-oriented machine learning applications (i.e., artifacts) whose predictions can be explained to human decision-makers. However, despite the recent emergence of a variety of tools that facilitate the development of such artifacts, there has so far been little research on their development. We attribute this research g",
    "link": "http://arxiv.org/abs/2306.11771",
    "context": "Title: Designing Explainable Predictive Machine Learning Artifacts: Methodology and Practical Demonstration. (arXiv:2306.11771v1 [cs.SE])\nAbstract: Prediction-oriented machine learning is becoming increasingly valuable to organizations, as it may drive applications in crucial business areas. However, decision-makers from companies across various industries are still largely reluctant to employ applications based on modern machine learning algorithms. We ascribe this issue to the widely held view on advanced machine learning algorithms as \"black boxes\" whose complexity does not allow for uncovering the factors that drive the output of a corresponding system. To contribute to overcome this adoption barrier, we argue that research in information systems should devote more attention to the design of prototypical prediction-oriented machine learning applications (i.e., artifacts) whose predictions can be explained to human decision-makers. However, despite the recent emergence of a variety of tools that facilitate the development of such artifacts, there has so far been little research on their development. We attribute this research g",
    "path": "papers/23/06/2306.11771.json",
    "total_tokens": 1145,
    "translated_title": "解释性预测机器学习工件的设计：方法和实用演示",
    "translated_abstract": "面向预测的机器学习在组织中越来越有价值，因为它可以在重要的业务领域推动应用。然而，来自各行各业公司的决策者仍然极为不愿意雇用基于现代机器学习算法的应用程序。我们把这个问题归因于对于先进的机器学习算法普遍持有的观点，即它们是“黑盒子”，其复杂性不允许揭示驱动相应系统输出的因素。为了有助于克服这种采用障碍，我们认为信息系统研究应更多地关注设计能向人类决策者解释其预测的原型预测导向机器学习应用程序（即工件）。然而，尽管最近出现了许多工具来促进这种工件的开发，但迄今为止对其开发的研究还很少。我们认为这种研究空白是由于缺乏已建立的设计方法学，因此在本文中提出这样的方法学。我们的方法学包括五个阶段，引导工程师完成工件的调查、规范、设计、验证和实施。我们通过设计并实施一个工件来证明其适用性，该工件预测诊断为新冠肺炎的患者是否将来会出现花粉热症状。",
    "tldr": "本文提出了一个解释性预测机器学习工件的设计方法学，以解决决策者不愿使用现代机器学习算法应用程序的问题，该方法学包括五个阶段。通过设计并实施一个工件，预测诊断为新冠肺炎的患者是否将来会出现花粉热症状来证明其适用性。",
    "en_tdlr": "This paper proposes a methodology for designing explainable predictive machine learning artifacts, which includes five phases, to address the reluctance of decision-makers to use modern machine learning algorithm applications. The applicability of the methodology is demonstrated by designing and implementing an artifact that predicts whether patients diagnosed with COVID-19 will experience hay fever-like symptoms in the future."
}