{
    "title": "Investigating the Utility of Surprisal from Large Language Models for Speech Synthesis Prosody. (arXiv:2306.09814v1 [eess.AS])",
    "abstract": "This paper investigates the use of word surprisal, a measure of the predictability of a word in a given context, as a feature to aid speech synthesis prosody. We explore how word surprisal extracted from large language models (LLMs) correlates with word prominence, a signal-based measure of the salience of a word in a given discourse. We also examine how context length and LLM size affect the results, and how a speech synthesizer conditioned with surprisal values compares with a baseline system. To evaluate these factors, we conducted experiments using a large corpus of English text and LLMs of varying sizes. Our results show that word surprisal and word prominence are moderately correlated, suggesting that they capture related but distinct aspects of language use. We find that length of context and size of the LLM impact the correlations, but not in the direction anticipated, with longer contexts and larger LLMs generally underpredicting prominent words in a nearly linear manner. We d",
    "link": "http://arxiv.org/abs/2306.09814",
    "context": "Title: Investigating the Utility of Surprisal from Large Language Models for Speech Synthesis Prosody. (arXiv:2306.09814v1 [eess.AS])\nAbstract: This paper investigates the use of word surprisal, a measure of the predictability of a word in a given context, as a feature to aid speech synthesis prosody. We explore how word surprisal extracted from large language models (LLMs) correlates with word prominence, a signal-based measure of the salience of a word in a given discourse. We also examine how context length and LLM size affect the results, and how a speech synthesizer conditioned with surprisal values compares with a baseline system. To evaluate these factors, we conducted experiments using a large corpus of English text and LLMs of varying sizes. Our results show that word surprisal and word prominence are moderately correlated, suggesting that they capture related but distinct aspects of language use. We find that length of context and size of the LLM impact the correlations, but not in the direction anticipated, with longer contexts and larger LLMs generally underpredicting prominent words in a nearly linear manner. We d",
    "path": "papers/23/06/2306.09814.json",
    "total_tokens": 1116,
    "translated_title": "探究使用大型语言模型的惊讶度量用于语音合成韵律的实用性",
    "translated_abstract": "本文研究了单词惊讶度量，即在特定情境下一个单词的可预测性，作为一种辅助语音合成韵律的特征的应用。我们探讨了从大型语言模型（LLMs）中提取的单词惊讶度量与单词突出性的相关性，单词突出性是一个对于给定话语中单词显著性的基于信号的度量。我们还研究了上下文长度和LLM大小对结果的影响，以及使用惊讶度值作为条件的语音合成器与基准系统相比的效果。为了评估这些因素，我们使用了大型英语文本语料库和大小不同的LLM进行了实验。结果表明，单词惊讶度量和单词突出性有着适度的相关性，表明它们捕捉到了相关但不同的语言使用方面。我们发现上下文长度和LLM大小会影响相关性，但不是预期方向，长上下文和大的LLMs通常以几乎线性的方式低估突出的单词。我们没有发现使用惊讶度量作为条件特征可以比基准系统提高语音合成质量，但这项研究提供了有用的洞察力和惊讶度量作为语言特征用于语音合成韵律的局限性。",
    "tldr": "本文研究了单词惊讶度量作为一种语音合成韵律特征的应用，发现它与单词突出性有着适度的相关性，但使用惊讶度量作为条件特征无法提高语音合成质量。",
    "en_tdlr": "This paper investigates the utility of word surprisal, a measure of predictability, as a feature for speech synthesis prosody. Results suggest a moderate correlation between word surprisal and word prominence, but surprisal as a conditioning feature did not improve speech synthesis quality over a baseline system."
}