{
    "title": "Perceived university support and environment as a factor of entrepreneurial intention: Evidence from Western Transdanubia Region. (arXiv:2306.09678v1 [econ.GN])",
    "abstract": "The exploration of entrepreneurship has become a priority for scientific research in recent years. Understanding this phenomenon is particularly important for the transformation of entrepreneurship into action, which is a key factor in early-stage entrepreneurial activity. This gains particular relevance in the university environment, where, in addition to the conventional teaching and research functions, the entrepreneurial university operation based on open innovation, as well as the enhancement of entrepreneurial attitudes of researchers and students, are receiving increased attention. This study is based on a survey conducted among students attending a Hungarian university of applied science in Western Transdanubia Region who have demonstrated their existing entrepreneurial commitment by joining a national startup training and incubation programme. The main research question of the study is to what extent student entrepreneurship intention is influenced by the environment of the en",
    "link": "http://arxiv.org/abs/2306.09678",
    "context": "Title: Perceived university support and environment as a factor of entrepreneurial intention: Evidence from Western Transdanubia Region. (arXiv:2306.09678v1 [econ.GN])\nAbstract: The exploration of entrepreneurship has become a priority for scientific research in recent years. Understanding this phenomenon is particularly important for the transformation of entrepreneurship into action, which is a key factor in early-stage entrepreneurial activity. This gains particular relevance in the university environment, where, in addition to the conventional teaching and research functions, the entrepreneurial university operation based on open innovation, as well as the enhancement of entrepreneurial attitudes of researchers and students, are receiving increased attention. This study is based on a survey conducted among students attending a Hungarian university of applied science in Western Transdanubia Region who have demonstrated their existing entrepreneurial commitment by joining a national startup training and incubation programme. The main research question of the study is to what extent student entrepreneurship intention is influenced by the environment of the en",
    "path": "papers/23/06/2306.09678.json",
    "total_tokens": 846,
    "translated_title": "感知大学支持与环境作为创业意向因素：以西特兰斯达努比亚地区为例",
    "translated_abstract": "近年来，探索创业已成为科学研究的重点。了解这一现象对于将创业转化为行动尤其重要，这是早期创业活动的关键因素。这在大学环境中具有特殊的重要性，除了传统的教学和研究功能外，基于开放创新的创业大学运营以及增强研究人员和学生的创业态度正在得到越来越多的关注。本研究基于在西特兰斯达努比亚地区的一所匈牙利应用科学大学的学生之间进行的调查。这些学生通过加入国家创业培训和孵化计划来表现出他们现有的创业承诺。本研究的主要研究问题是，学生的创业意向在多大程度上受到创业环境的影响。",
    "tldr": "本研究调查了西特兰斯达努比亚地区匈牙利应用科学大学学生，旨在研究创业意向受到大学支持和环境的影响。",
    "en_tdlr": "This study surveyed students at a Hungarian university of applied science in the Western Transdanubia region to explore the influence of university support and environment on entrepreneurial intention."
}