{
    "title": "FedBone: Towards Large-Scale Federated Multi-Task Learning. (arXiv:2306.17465v1 [cs.LG])",
    "abstract": "Heterogeneous federated multi-task learning (HFMTL) is a federated learning technique that combines heterogeneous tasks of different clients to achieve more accurate, comprehensive predictions. In real-world applications, visual and natural language tasks typically require large-scale models to extract high-level abstract features. However, large-scale models cannot be directly applied to existing federated multi-task learning methods. Existing HFML methods also disregard the impact of gradient conflicts on multi-task optimization during the federated aggregation process. In this work, we propose an innovative framework called FedBone, which enables the construction of large-scale models with better generalization from the perspective of server-client split learning and gradient projection. We split the entire model into two components: a large-scale general model (referred to as the general model) on the cloud server and multiple task-specific models (referred to as the client model) ",
    "link": "http://arxiv.org/abs/2306.17465",
    "context": "Title: FedBone: Towards Large-Scale Federated Multi-Task Learning. (arXiv:2306.17465v1 [cs.LG])\nAbstract: Heterogeneous federated multi-task learning (HFMTL) is a federated learning technique that combines heterogeneous tasks of different clients to achieve more accurate, comprehensive predictions. In real-world applications, visual and natural language tasks typically require large-scale models to extract high-level abstract features. However, large-scale models cannot be directly applied to existing federated multi-task learning methods. Existing HFML methods also disregard the impact of gradient conflicts on multi-task optimization during the federated aggregation process. In this work, we propose an innovative framework called FedBone, which enables the construction of large-scale models with better generalization from the perspective of server-client split learning and gradient projection. We split the entire model into two components: a large-scale general model (referred to as the general model) on the cloud server and multiple task-specific models (referred to as the client model) ",
    "path": "papers/23/06/2306.17465.json",
    "total_tokens": 849,
    "translated_title": "FedBone: 迈向大规模联邦多任务学习",
    "translated_abstract": "异构联邦多任务学习（HFMTL）是一种联邦学习技术，它将不同客户端的异构任务结合起来，以实现更准确、全面的预测。在现实世界应用中，视觉和自然语言任务通常需要大规模模型来提取高层次的抽象特征。然而，大规模模型不能直接应用于现有的联邦多任务学习方法。现有的HFML方法也忽略了在联邦聚合过程中梯度冲突对多任务优化的影响。在这项工作中，我们提出了一种创新的框架，称为FedBone，它通过从服务器-客户端分离学习和梯度投影的角度实现了更好的泛化能力，并构建了大规模模型。我们将整个模型分为两个组件：云服务器上的大规模通用模型（称为通用模型）和多个任务特定模型（称为客户模型）。",
    "tldr": "FedBone是一个创新的框架，通过服务器-客户端分离学习和梯度投影的角度，实现了构建大规模模型和更好的泛化能力。它解决了现有联邦多任务学习方法无法直接应用大规模模型以及忽略梯度冲突对多任务优化的问题。"
}