{
    "title": "Towards Language Models That Can See: Computer Vision Through the LENS of Natural Language. (arXiv:2306.16410v1 [cs.CL])",
    "abstract": "We propose LENS, a modular approach for tackling computer vision problems by leveraging the power of large language models (LLMs). Our system uses a language model to reason over outputs from a set of independent and highly descriptive vision modules that provide exhaustive information about an image. We evaluate the approach on pure computer vision settings such as zero- and few-shot object recognition, as well as on vision and language problems. LENS can be applied to any off-the-shelf LLM and we find that the LLMs with LENS perform highly competitively with much bigger and much more sophisticated systems, without any multimodal training whatsoever. We open-source our code at https://github.com/ContextualAI/lens and provide an interactive demo.",
    "link": "http://arxiv.org/abs/2306.16410",
    "context": "Title: Towards Language Models That Can See: Computer Vision Through the LENS of Natural Language. (arXiv:2306.16410v1 [cs.CL])\nAbstract: We propose LENS, a modular approach for tackling computer vision problems by leveraging the power of large language models (LLMs). Our system uses a language model to reason over outputs from a set of independent and highly descriptive vision modules that provide exhaustive information about an image. We evaluate the approach on pure computer vision settings such as zero- and few-shot object recognition, as well as on vision and language problems. LENS can be applied to any off-the-shelf LLM and we find that the LLMs with LENS perform highly competitively with much bigger and much more sophisticated systems, without any multimodal training whatsoever. We open-source our code at https://github.com/ContextualAI/lens and provide an interactive demo.",
    "path": "papers/23/06/2306.16410.json",
    "total_tokens": 772,
    "translated_title": "以自然语言为镜，实现能看见的语言模型：计算机视觉的LENS方法",
    "translated_abstract": "我们提出了LENS，一种利用大型语言模型（LLMs）解决计算机视觉问题的模块化方法。我们的系统使用语言模型推理图像的一组独立且高度描述性的视觉模块的输出，提供关于图像的详尽信息。我们在纯计算机视觉环境中评估了该方法，如零和少样本目标识别，同时也在视觉和语言问题上进行了测试。LENS可以应用于任何现成的LLM，并且我们发现有LENS的LLMs的性能高度竞争，而无需进行任何多模态训练。我们在https://github.com/ContextualAI/lens开源我们的代码，并提供一个交互式演示。",
    "tldr": "LENS是一种利用大型语言模型的模块化方法，通过推理图像的视觉模块输出进行计算机视觉问题的处理。它不需要多模态训练即可与更大更复杂的系统具有竞争力。",
    "en_tdlr": "LENS is a modular approach that leverages large language models to tackle computer vision problems by reasoning over outputs from vision modules. It performs competitively without multimodal training compared to larger and more sophisticated systems."
}