{
    "title": "Recovery Guarantees for Quadratic Tensors with Sparse Observations. (arXiv:1811.00148v2 [cs.LG] UPDATED)",
    "abstract": "We consider the tensor completion problem of predicting the missing entries of a tensor. The commonly used CP model has a triple product form, but an alternate family of quadratic models, which are the sum of pairwise products instead of a triple product, have emerged from applications such as recommendation systems. Non-convex methods are the method of choice for learning quadratic models, and this work examines their sample complexity and error guarantee. Our main result is that with the number of samples being only linear in the dimension, all local minima of the mean squared error objective are global minima and recover the original tensor. We substantiate our theoretical results with experiments on synthetic and real-world data, showing that quadratic models have better performance than CP models where there are a limited amount of observations available.",
    "link": "http://arxiv.org/abs/1811.00148",
    "context": "Title: Recovery Guarantees for Quadratic Tensors with Sparse Observations. (arXiv:1811.00148v2 [cs.LG] UPDATED)\nAbstract: We consider the tensor completion problem of predicting the missing entries of a tensor. The commonly used CP model has a triple product form, but an alternate family of quadratic models, which are the sum of pairwise products instead of a triple product, have emerged from applications such as recommendation systems. Non-convex methods are the method of choice for learning quadratic models, and this work examines their sample complexity and error guarantee. Our main result is that with the number of samples being only linear in the dimension, all local minima of the mean squared error objective are global minima and recover the original tensor. We substantiate our theoretical results with experiments on synthetic and real-world data, showing that quadratic models have better performance than CP models where there are a limited amount of observations available.",
    "path": "papers/18/11/1811.00148.json",
    "total_tokens": 817,
    "translated_title": "对稀疏观测下的二次张量进行恢复的保证",
    "translated_abstract": "我们考虑张量完整问题，即预测张量中缺失的条目。常用的CP模型具有三次乘积形式，但一种替代的二次模型家族已经从推荐系统等应用中出现，其是对成对乘积求和而不是三次乘积。非凸方法是学习二次模型的首选方法，本研究考察了它们的样本复杂度和误差保证。我们的主要结果是，只需线性数量的样本，平均均方误差目标函数的所有局部极小值都是全局极小值，并可以恢复原始张量。我们通过对合成和真实世界数据的实验证实了我们的理论结果，表明在观测数量有限的情况下，二次模型比CP模型具有更好的性能。",
    "tldr": "本研究考察了稀疏观测下的二次张量恢复问题，发现非凸方法能够在线性样本数量下保证误差最小化问题的全局极小值，并改进了观测有限情况下的CP模型性能。",
    "en_tdlr": "This study investigates the recovery problem of quadratic tensors with sparse observations, finding that non-convex methods can guarantee global minimum of error minimization with linear sample complexity, and improve the performance of CP models in the case of limited observations."
}