{
    "title": "Marshall-Olkin Power-Law Distributions in Length-Frequency of Entities. (arXiv:1811.03325v4 [cs.CL] UPDATED)",
    "abstract": "Entities involve important concepts with concrete meanings and play important roles in numerous linguistic tasks. Entities have different forms in different tasks and researchers treat those forms as different concepts. In this paper, we are curious to know whether there are some common characteristics connecting those different forms of entities. Specifically, we investigate the underlying distributions of entities from different types and different languages, trying to figure out some common properties behind those diverse entities. We find from twelve datasets about different types of entities and eighteen datasets about different languages of entities that although these entities are dramatically diverse from each in many aspects, their length-frequencies can be well characterized by Marshall-Olkin power-law (MOPL) distributions, and these distributions possess defined means and finite variances. Our experiments show that while not all the entities are drawn from the same underlyin",
    "link": "http://arxiv.org/abs/1811.03325",
    "context": "Title: Marshall-Olkin Power-Law Distributions in Length-Frequency of Entities. (arXiv:1811.03325v4 [cs.CL] UPDATED)\nAbstract: Entities involve important concepts with concrete meanings and play important roles in numerous linguistic tasks. Entities have different forms in different tasks and researchers treat those forms as different concepts. In this paper, we are curious to know whether there are some common characteristics connecting those different forms of entities. Specifically, we investigate the underlying distributions of entities from different types and different languages, trying to figure out some common properties behind those diverse entities. We find from twelve datasets about different types of entities and eighteen datasets about different languages of entities that although these entities are dramatically diverse from each in many aspects, their length-frequencies can be well characterized by Marshall-Olkin power-law (MOPL) distributions, and these distributions possess defined means and finite variances. Our experiments show that while not all the entities are drawn from the same underlyin",
    "path": "papers/18/11/1811.03325.json",
    "total_tokens": 624,
    "tldr": "本文研究了不同类型和语言的实体数据集并发现其长度和频率可以用Marshall-Olkin力度定律分布来描述，揭示了实体之间的一些普遍规律和共性。",
    "en_tdlr": "This paper investigates the underlying distributions of entities from different types and languages, and finds that the length-frequency of entities can be well characterized by Marshall-Olkin power-law distributions, revealing some common properties behind diverse entities."
}