{
    "title": "Distribution Regression with Sample Selection, with an Application to Wage Decompositions in the UK. (arXiv:1811.11603v5 [econ.EM] UPDATED)",
    "abstract": "We develop a distribution regression model under endogenous sample selection. This model is a semi-parametric generalization of the Heckman selection model. It accommodates much richer effects of the covariates on outcome distribution and patterns of heterogeneity in the selection process, and allows for drastic departures from the Gaussian error structure, while maintaining the same level tractability as the classical model. The model applies to continuous, discrete and mixed outcomes. We provide identification, estimation, and inference methods, and apply them to obtain wage decomposition for the UK. Here we decompose the difference between the male and female wage distributions into composition, wage structure, selection structure, and selection sorting effects. After controlling for endogenous employment selection, we still find substantial gender wage gap -- ranging from 21\\% to 40\\% throughout the (latent) offered wage distribution that is not explained by composition. We also un",
    "link": "http://arxiv.org/abs/1811.11603",
    "context": "Title: Distribution Regression with Sample Selection, with an Application to Wage Decompositions in the UK. (arXiv:1811.11603v5 [econ.EM] UPDATED)\nAbstract: We develop a distribution regression model under endogenous sample selection. This model is a semi-parametric generalization of the Heckman selection model. It accommodates much richer effects of the covariates on outcome distribution and patterns of heterogeneity in the selection process, and allows for drastic departures from the Gaussian error structure, while maintaining the same level tractability as the classical model. The model applies to continuous, discrete and mixed outcomes. We provide identification, estimation, and inference methods, and apply them to obtain wage decomposition for the UK. Here we decompose the difference between the male and female wage distributions into composition, wage structure, selection structure, and selection sorting effects. After controlling for endogenous employment selection, we still find substantial gender wage gap -- ranging from 21\\% to 40\\% throughout the (latent) offered wage distribution that is not explained by composition. We also un",
    "path": "papers/18/11/1811.11603.json",
    "total_tokens": 880,
    "translated_title": "带有样本选择的分布回归：应用于英国工资分解的研究",
    "translated_abstract": "我们在内生样本选择的情况下开发了一个分布回归模型。该模型是Heckman选择模型的半参数推广，可以适应更丰富的协变量对结果分布和选择过程异质性模式的影响，同时允许与高斯误差结构有显著偏差的情况，而仍然保持与经典模型同样的可处理性。该模型适用于连续、离散和混合结果。我们提供了识别、估计和推断方法，并将其应用于获得英国工资分解。我们将男女工资分布差异分解为成分、工资结构、选择结构和选择排序效应。在控制内生就业选择后，我们仍然发现显著的性别工资差距-在未解释组成成分的情况下，从21％到40％在（潜在的）提供工资分布中。",
    "tldr": "该论文提出了一种带有样本选择的分布回归模型，旨在研究男女工资差距。研究结果表明，即使在控制就业选择后，仍存在大量无法解释的性别工资差距。",
    "en_tdlr": "This paper proposes a distribution regression model with endogenous sample selection to investigate the gender wage gap. After controlling for endogenous employment selection, the study finds a substantial gender wage gap that cannot be explained by composition alone."
}