{
    "title": "MetaCOG: Learning a Metacognition to Recover What Objects Are Actually There. (arXiv:2110.03105v3 [cs.AI] UPDATED)",
    "abstract": "Humans not only form representations about the world based on what we see, but also learn meta-cognitive representations about how our own vision works. This enables us to recognize when our vision is unreliable (e.g., when we realize that we are experiencing a visual illusion) and enables us to question what we see. Inspired by this human capacity, we present MetaCOG: a model that increases the robustness of object detectors by learning representations of their reliability, and does so without feedback. Specifically, MetaCOG is a hierarchical probabilistic model that expresses a joint distribution over the objects in a 3D scene and the outputs produced by a detector. When paired with an off-the-shelf object detector, MetaCOG takes detections as input and infers the detector's tendencies to miss objects of certain categories and to hallucinate objects that are not actually present, all without access to ground-truth object labels. When paired with three modern neural object detectors, ",
    "link": "http://arxiv.org/abs/2110.03105",
    "context": "Title: MetaCOG: Learning a Metacognition to Recover What Objects Are Actually There. (arXiv:2110.03105v3 [cs.AI] UPDATED)\nAbstract: Humans not only form representations about the world based on what we see, but also learn meta-cognitive representations about how our own vision works. This enables us to recognize when our vision is unreliable (e.g., when we realize that we are experiencing a visual illusion) and enables us to question what we see. Inspired by this human capacity, we present MetaCOG: a model that increases the robustness of object detectors by learning representations of their reliability, and does so without feedback. Specifically, MetaCOG is a hierarchical probabilistic model that expresses a joint distribution over the objects in a 3D scene and the outputs produced by a detector. When paired with an off-the-shelf object detector, MetaCOG takes detections as input and infers the detector's tendencies to miss objects of certain categories and to hallucinate objects that are not actually present, all without access to ground-truth object labels. When paired with three modern neural object detectors, ",
    "path": "papers/21/10/2110.03105.json",
    "total_tokens": 899,
    "translated_title": "MetaCOG: 学习元认知以恢复实际存在的物体",
    "translated_abstract": "人类不仅根据我们所看到的内容形成关于世界的表征，还学习关于我们自己视觉如何工作的元认知表征。这使我们能够识别出我们的视觉不可靠（例如，当我们意识到我们正在经历视觉错觉时），并使我们能够对我们所看到的内容提出质疑。受到这种人类能力的启发，我们提出了MetaCOG：一种通过学习其可靠性表示来增加目标检测器的鲁棒性的模型，并且在没有反馈的情况下实现。具体而言，MetaCOG是一个层次概率模型，对一个三维场景中的物体和检测器产生的输出表达了一个联合分布。当与现成的目标检测器配对使用时，MetaCOG将检测结果作为输入，并推断出检测器错漏检某些类别的物体和虚构不存在的物体的倾向，而无需访问地面真实的物体标签。",
    "tldr": "MetaCOG是一个学习元认知的模型，通过学习目标检测器的可靠性表示，增加了目标检测器的鲁棒性，而无需反馈和地面真实的物体标签。",
    "en_tdlr": "MetaCOG is a model that learns metacognitive representations to enhance the robustness of object detectors without the need for feedback or ground-truth object labels, by learning the detector's reliability and tendencies to miss or hallucinate objects."
}