{
    "title": "EvadeDroid: A Practical Evasion Attack on Machine Learning for Black-box Android Malware Detection. (arXiv:2110.03301v3 [cs.LG] UPDATED)",
    "abstract": "Over the last decade, researchers have extensively explored the vulnerabilities of Android malware detectors to adversarial examples through the development of evasion attacks; however, the practicality of these attacks in real-world scenarios remains arguable. The majority of studies have assumed attackers know the details of the target classifiers used for malware detection, while in reality, malicious actors have limited access to the target classifiers. This paper introduces EvadeDroid, a practical decision-based adversarial attack designed to effectively evade black-box Android malware detectors in real-world scenarios. In addition to generating real-world adversarial malware, the proposed evasion attack can also preserve the functionality of the original malware applications (apps). EvadeDroid constructs a collection of functionality-preserving transformations derived from benign donors that share opcode-level similarity with malware apps by leveraging an n-gram-based approach. T",
    "link": "http://arxiv.org/abs/2110.03301",
    "context": "Title: EvadeDroid: A Practical Evasion Attack on Machine Learning for Black-box Android Malware Detection. (arXiv:2110.03301v3 [cs.LG] UPDATED)\nAbstract: Over the last decade, researchers have extensively explored the vulnerabilities of Android malware detectors to adversarial examples through the development of evasion attacks; however, the practicality of these attacks in real-world scenarios remains arguable. The majority of studies have assumed attackers know the details of the target classifiers used for malware detection, while in reality, malicious actors have limited access to the target classifiers. This paper introduces EvadeDroid, a practical decision-based adversarial attack designed to effectively evade black-box Android malware detectors in real-world scenarios. In addition to generating real-world adversarial malware, the proposed evasion attack can also preserve the functionality of the original malware applications (apps). EvadeDroid constructs a collection of functionality-preserving transformations derived from benign donors that share opcode-level similarity with malware apps by leveraging an n-gram-based approach. T",
    "path": "papers/21/10/2110.03301.json",
    "total_tokens": 877,
    "translated_title": "EvadeDroid：一种对黑盒Android恶意软件检测的实用逃逸攻击",
    "translated_abstract": "在过去的十年里，研究人员通过开发逃避攻击来广泛探索Android恶意软件检测器对对抗性样本的漏洞；然而，在现实世界中，这些攻击的实用性仍然有争议。大多数研究假定攻击者知道用于恶意软件检测的目标分类器的详细信息，而在现实中，恶意行为者只能获得有限的目标分类器访问权限。本文介绍了EvadeDroid，一种实用的基于决策的对抗攻击，旨在有效逃避黑盒Android恶意软件检测器的检测。除了生成实际的对抗性恶意软件外，所提出的逃避攻击还可以保留原始恶意软件应用程序的功能。通过利用基于n-gram的方法构建来自良性样本的功能保持转换，这些转换与恶意软件应用程序具有操作码级别的相似性。",
    "tldr": "本论文提出了一种可实际使用并可以有效逃避黑盒Android恶意软件检测器的对抗攻击——EvadeDroid，并且可以保留原始恶意软件应用程序的功能。",
    "en_tdlr": "This paper proposes a practical decision-based adversarial attack, EvadeDroid, that can effectively evade black-box Android malware detectors in real-world scenarios and preserve the functionality of the original malware applications."
}