{
    "title": "Denoising and change point localisation in piecewise-constant high-dimensional regression coefficients. (arXiv:2110.14298v2 [math.ST] CROSS LISTED)",
    "abstract": "We study the theoretical properties of the fused lasso procedure originally proposed by \\cite{tibshirani2005sparsity} in the context of a linear regression model in which the regression coefficient are totally ordered and assumed to be sparse and piecewise constant. Despite its popularity, to the best of our knowledge, estimation error bounds in high-dimensional settings have only been obtained for the simple case in which the design matrix is the identity matrix. We formulate a novel restricted isometry condition on the design matrix that is tailored to the fused lasso estimator and derive estimation bounds for both the constrained version of the fused lasso assuming dense coefficients and for its penalised version. We observe that the estimation error can be dominated by either the lasso or the fused lasso rate, depending on whether the number of non-zero coefficient is larger than the number of piece-wise constant segments. Finally, we devise a post-processing procedure to recover t",
    "link": "http://arxiv.org/abs/2110.14298",
    "context": "Title: Denoising and change point localisation in piecewise-constant high-dimensional regression coefficients. (arXiv:2110.14298v2 [math.ST] CROSS LISTED)\nAbstract: We study the theoretical properties of the fused lasso procedure originally proposed by \\cite{tibshirani2005sparsity} in the context of a linear regression model in which the regression coefficient are totally ordered and assumed to be sparse and piecewise constant. Despite its popularity, to the best of our knowledge, estimation error bounds in high-dimensional settings have only been obtained for the simple case in which the design matrix is the identity matrix. We formulate a novel restricted isometry condition on the design matrix that is tailored to the fused lasso estimator and derive estimation bounds for both the constrained version of the fused lasso assuming dense coefficients and for its penalised version. We observe that the estimation error can be dominated by either the lasso or the fused lasso rate, depending on whether the number of non-zero coefficient is larger than the number of piece-wise constant segments. Finally, we devise a post-processing procedure to recover t",
    "path": "papers/21/10/2110.14298.json",
    "total_tokens": 912,
    "translated_title": "在分段常数高维回归系数中进行去噪和变点定位",
    "translated_abstract": "我们研究了在线性回归模型中融合套索程序的理论特性。该模型假设回归系数是有序且稀疏的分段常数。尽管该方法很受欢迎，但据我们所知，目前仅在设计矩阵为单位矩阵的简单情况下才能得到高维情况下的估计误差界限。我们提出了一种新颖的设计矩阵受限等距条件，针对融合套索估计器，并得出了融合套索的约束版本和惩罚版本的估计界限。我们观察到，估计误差可能由套索或融合套索的速率主导，这取决于非零系数的数量是否大于分段常数段的数量。最后，我们设计了一个后处理程序来恢复...",
    "tldr": "该论文研究了在线性回归模型中融合套索程序的理论性质，并提出了新的设计矩阵受限等距条件，得出了融合套索的估计界限。研究发现，估计误差的主导因素取决于非零系数和分段常数段的数量。"
}