{
    "title": "Sign and Relevance learning. (arXiv:2110.07292v3 [cs.LG] UPDATED)",
    "abstract": "Standard models of biologically realistic or biologically inspired reinforcement learning employ a global error signal, which implies the use of shallow networks. On the other hand, error backpropagation allows the use of networks with multiple layers. However, precise error backpropagation is difficult to justify in biologically realistic networks because it requires precise weighted error backpropagation from layer to layer. In this study, we introduce a novel network that solves this problem by propagating only the sign of the plasticity change (i.e., LTP/LTD) throughout the whole network, while neuromodulation controls the learning rate. Neuromodulation can be understood as a rectified error or relevance signal, while the top-down sign of the error signal determines whether long-term potentiation or long-term depression will occur. To demonstrate the effectiveness of this approach, we conducted a real robotic task as proof of concept. Our results show that this paradigm can success",
    "link": "http://arxiv.org/abs/2110.07292",
    "context": "Title: Sign and Relevance learning. (arXiv:2110.07292v3 [cs.LG] UPDATED)\nAbstract: Standard models of biologically realistic or biologically inspired reinforcement learning employ a global error signal, which implies the use of shallow networks. On the other hand, error backpropagation allows the use of networks with multiple layers. However, precise error backpropagation is difficult to justify in biologically realistic networks because it requires precise weighted error backpropagation from layer to layer. In this study, we introduce a novel network that solves this problem by propagating only the sign of the plasticity change (i.e., LTP/LTD) throughout the whole network, while neuromodulation controls the learning rate. Neuromodulation can be understood as a rectified error or relevance signal, while the top-down sign of the error signal determines whether long-term potentiation or long-term depression will occur. To demonstrate the effectiveness of this approach, we conducted a real robotic task as proof of concept. Our results show that this paradigm can success",
    "path": "papers/21/10/2110.07292.json",
    "total_tokens": 897,
    "translated_title": "签名和相关性学习",
    "translated_abstract": "传统的生物仿真和生物启发式强化学习模型应用全局误差信号，这意味着使用浅层网络。然而，误差反向传播允许使用多层网络。本研究引入了一种新型网络，通过在整个网络中仅传播可塑性变化的符号（即LTP / LTD），同时使用神经调制来控制学习速率来解决这个问题。神经调制可以被理解为一个修正的误差或相关信号，而错误信号的自上而下符号决定长期增强还是长期抑制将发生。为了证明这种方法的有效性，我们进行了一个真实的机器人任务作为概念验证。我们的结果表明，该范例可以成功学习具有多层表示的复杂任务，并在学习速度和稳定性方面优于标准模型。",
    "tldr": "本文提出了一种新型网络，在整个网络中仅传播可塑性变化的符号，同时使用神经调制控制学习速率。研究结果表明该范例可以成功学习具有多层表示的复杂任务，学习速度和稳定性优于标准模型。"
}