{
    "title": "Adaptive Weighted Multi-View Clustering. (arXiv:2110.13240v2 [stat.ML] UPDATED)",
    "abstract": "Learning multi-view data is an emerging problem in machine learning research, and nonnegative matrix factorization (NMF) is a popular dimensionality-reduction method for integrating information from multiple views. These views often provide not only consensus but also complementary information. However, most multi-view NMF algorithms assign equal weight to each view or tune the weight via line search empirically, which can be infeasible without any prior knowledge of the views or computationally expensive. In this paper, we propose a weighted multi-view NMF (WM-NMF) algorithm. In particular, we aim to address the critical technical gap, which is to learn both view-specific weight and observation-specific reconstruction weight to quantify each view's information content. The introduced weighting scheme can alleviate unnecessary views' adverse effects and enlarge the positive effects of the important views by assigning smaller and larger weights, respectively. Experimental results confir",
    "link": "http://arxiv.org/abs/2110.13240",
    "context": "Title: Adaptive Weighted Multi-View Clustering. (arXiv:2110.13240v2 [stat.ML] UPDATED)\nAbstract: Learning multi-view data is an emerging problem in machine learning research, and nonnegative matrix factorization (NMF) is a popular dimensionality-reduction method for integrating information from multiple views. These views often provide not only consensus but also complementary information. However, most multi-view NMF algorithms assign equal weight to each view or tune the weight via line search empirically, which can be infeasible without any prior knowledge of the views or computationally expensive. In this paper, we propose a weighted multi-view NMF (WM-NMF) algorithm. In particular, we aim to address the critical technical gap, which is to learn both view-specific weight and observation-specific reconstruction weight to quantify each view's information content. The introduced weighting scheme can alleviate unnecessary views' adverse effects and enlarge the positive effects of the important views by assigning smaller and larger weights, respectively. Experimental results confir",
    "path": "papers/21/10/2110.13240.json",
    "total_tokens": 891,
    "translated_title": "自适应加权多视图聚类",
    "translated_abstract": "学习多视图数据是机器学习研究中一个新兴的问题，非负矩阵分解（NMF）是一种流行的降维方法，用于整合来自多个视图的信息。这些视图通常不仅提供一致性信息，还提供互补信息。然而，大多数多视图NMF算法将每个视图赋予相同的权重，或者通过经验性的线性搜索调整权重，这在没有视图的任何先验知识或计算上是不可行的。在本文中，我们提出了一种加权多视图NMF（WM-NMF）算法。特别地，我们旨在解决关键技术差距，即学习视图特定权重和观测特定重构权重，以量化每个视图的信息内容。引入的加权方案可以通过分配较小和较大的权重来减轻不必要视图的负面影响并扩大重要视图的正面影响。",
    "tldr": "本文提出了一种加权多视图 NMF算法，旨在学习视图特定权重和观测特定重构权重，以量化每个视图的信息内容，通过分配较小和较大的权重来扩大重要视图的正面影响。",
    "en_tdlr": "This paper proposes a weighted multi-view NMF algorithm that aims to learn view-specific weight and observation-specific reconstruction weight to quantify each view's information content. By assigning smaller and larger weights, respectively, the introduced weighting scheme can enlarge the positive effects of the important views and alleviate unnecessary views' adverse effects."
}