{
    "title": "Attention-based Estimation and Prediction of Human Intent to augment Haptic Glove aided Control of Robotic Hand",
    "abstract": "arXiv:2110.07953v2 Announce Type: replace-cross  Abstract: The letter focuses on Haptic Glove (HG) based control of a Robotic Hand (RH) executing in-hand manipulation of certain objects of interest. The high dimensional motion signals in HG and RH possess intrinsic variability of kinematics resulting in difficulty to establish a direct mapping of the motion signals from HG onto the RH. An estimation mechanism is proposed to quantify the motion signal acquired from the human controller in relation to the intended goal pose of the object being held by the robotic hand. A control algorithm is presented to transform the synthesized intent at the RH and allow relocation of the object to the expected goal pose. The lag in synthesis of the intent in the presence of communication delay leads to a requirement of predicting the estimated intent. We leverage an attention-based convolutional neural network encoder to predict the trajectory of intent for a certain lookahead to compensate for the de",
    "link": "https://arxiv.org/abs/2110.07953",
    "context": "Title: Attention-based Estimation and Prediction of Human Intent to augment Haptic Glove aided Control of Robotic Hand\nAbstract: arXiv:2110.07953v2 Announce Type: replace-cross  Abstract: The letter focuses on Haptic Glove (HG) based control of a Robotic Hand (RH) executing in-hand manipulation of certain objects of interest. The high dimensional motion signals in HG and RH possess intrinsic variability of kinematics resulting in difficulty to establish a direct mapping of the motion signals from HG onto the RH. An estimation mechanism is proposed to quantify the motion signal acquired from the human controller in relation to the intended goal pose of the object being held by the robotic hand. A control algorithm is presented to transform the synthesized intent at the RH and allow relocation of the object to the expected goal pose. The lag in synthesis of the intent in the presence of communication delay leads to a requirement of predicting the estimated intent. We leverage an attention-based convolutional neural network encoder to predict the trajectory of intent for a certain lookahead to compensate for the de",
    "path": "papers/21/10/2110.07953.json",
    "total_tokens": 847,
    "translated_title": "基于注意力的人类意图估计和预测，用于增强触觉手套辅助控制机器手",
    "translated_abstract": "该论文聚焦于基于触觉手套（HG）的控制机械手（RH）执行特定目标的手部操作。触觉手套和机械手中的高维运动信号具有固有的运动变化，导致难以直接建立从触觉手套运动信号到机械手的映射。提出了一种估计机制，用于量化从人类控制器获取的运动信号与机械手抓取的目标姿势之间的关系。提出了一种控制算法，用于转换RH中合成的意图，使目标物体重新定位到预期的目标姿势。在通信延迟存在的情况下合成意图的滞后，需要预测估计的意图。我们利用基于注意力的卷积神经网络编码器来预测一定前瞻的意图轨迹，以弥补延迟。",
    "tldr": "该论文提出了一种基于注意力的估计和预测机制，用于增强触觉手套辅助控制机器手中的目标定位能力。",
    "en_tdlr": "This paper presents an attention-based estimation and prediction mechanism to enhance the object positioning ability in controlling robotic hands aided by haptic gloves."
}