{
    "title": "Regime-Switching Density Forecasts Using Economists' Scenarios",
    "abstract": "arXiv:2110.13761v2 Announce Type: replace  Abstract: We propose an approach for generating macroeconomic density forecasts that incorporate information on multiple scenarios defined by experts. We adopt a regime-switching framework in which sets of scenarios (\"views\") are used as Bayesian priors on economic regimes. Predictive densities coming from different views are then combined by optimizing objective functions of density forecasting. We illustrate the approach with an empirical application to quarterly real-time forecasts of U.S. GDP growth, in which we exploit the Fed's macroeconomic scenarios used for bank stress tests. We show that the approach achieves good accuracy in terms of average predictive scores and good calibration of forecast distributions. Moreover, it can be used to evaluate the contribution of economists' scenarios to density forecast performance.",
    "link": "https://arxiv.org/abs/2110.13761",
    "context": "Title: Regime-Switching Density Forecasts Using Economists' Scenarios\nAbstract: arXiv:2110.13761v2 Announce Type: replace  Abstract: We propose an approach for generating macroeconomic density forecasts that incorporate information on multiple scenarios defined by experts. We adopt a regime-switching framework in which sets of scenarios (\"views\") are used as Bayesian priors on economic regimes. Predictive densities coming from different views are then combined by optimizing objective functions of density forecasting. We illustrate the approach with an empirical application to quarterly real-time forecasts of U.S. GDP growth, in which we exploit the Fed's macroeconomic scenarios used for bank stress tests. We show that the approach achieves good accuracy in terms of average predictive scores and good calibration of forecast distributions. Moreover, it can be used to evaluate the contribution of economists' scenarios to density forecast performance.",
    "path": "papers/21/10/2110.13761.json",
    "total_tokens": 858,
    "translated_title": "利用经济学家的情景进行转变密度预测",
    "translated_abstract": "我们提出了一种方法，用于生成结合了专家定义的多种情景信息的宏观经济密度预测。我们采用了一个制度转换框架，其中一组情景（“观点”）被用作贝叶斯先验，用于经济制度。然后通过优化密度预测的客观函数来将来自不同观点的预测密度组合起来。我们通过对美国实时季度GDP增长预测的经验应用展示了这种方法，并利用了联邦储备系统用于银行压力测试的宏观经济情景。我们展示了这种方法在平均预测分数和预测分布校准方面实现了良好的准确性。此外，它可以用于评估经济学家情景对密度预测性能的贡献。",
    "tldr": "利用专家定义的多种情景信息，采用制度转换框架生成宏观经济密度预测，并通过优化客观函数组合不同情景的预测密度，展示了本文的方法。该方法在平均预测分数和预测分布校准方面表现良好，并可用于评估经济学家情景对密度预测性能的贡献。",
    "en_tdlr": "This paper proposes an approach that generates macroeconomic density forecasts by incorporating information from various scenarios defined by experts using a regime-switching framework, and combines predictive densities from different scenarios through optimizing objective functions, showing good accuracy and calibration while evaluating the contribution of economists' scenarios to density forecast performance."
}