{
    "title": "DeLag: Using Multi-Objective Optimization to Enhance the Detection of Latency Degradation Patterns in Service-based Systems. (arXiv:2110.11155v4 [cs.SE] UPDATED)",
    "abstract": "Performance debugging in production is a fundamental activity in modern service-based systems. The diagnosis of performance issues is often time-consuming, since it requires thorough inspection of large volumes of traces and performance indices. In this paper we present DeLag, a novel automated search-based approach for diagnosing performance issues in service-based systems. DeLag identifies subsets of requests that show, in the combination of their Remote Procedure Call execution times, symptoms of potentially relevant performance issues. We call such symptoms Latency Degradation Patterns. DeLag simultaneously searches for multiple latency degradation patterns while optimizing precision, recall and latency dissimilarity. Experimentation on 700 datasets of requests generated from two microservice-based systems shows that our approach provides better and more stable effectiveness than three state-of-the-art approaches and general purpose machine learning clustering algorithms. DeLag is ",
    "link": "http://arxiv.org/abs/2110.11155",
    "context": "Title: DeLag: Using Multi-Objective Optimization to Enhance the Detection of Latency Degradation Patterns in Service-based Systems. (arXiv:2110.11155v4 [cs.SE] UPDATED)\nAbstract: Performance debugging in production is a fundamental activity in modern service-based systems. The diagnosis of performance issues is often time-consuming, since it requires thorough inspection of large volumes of traces and performance indices. In this paper we present DeLag, a novel automated search-based approach for diagnosing performance issues in service-based systems. DeLag identifies subsets of requests that show, in the combination of their Remote Procedure Call execution times, symptoms of potentially relevant performance issues. We call such symptoms Latency Degradation Patterns. DeLag simultaneously searches for multiple latency degradation patterns while optimizing precision, recall and latency dissimilarity. Experimentation on 700 datasets of requests generated from two microservice-based systems shows that our approach provides better and more stable effectiveness than three state-of-the-art approaches and general purpose machine learning clustering algorithms. DeLag is ",
    "path": "papers/21/10/2110.11155.json",
    "total_tokens": 813,
    "translated_title": "DeLag：使用多目标优化增强服务系统中延迟降级模式检测",
    "translated_abstract": "在现代服务系统中，性能调试是一项基本活动。性能问题的诊断通常耗费大量时间，因为需要详细检查大量的跟踪和性能指标。本文提出了DeLag，一种新颖的自动化搜索方法，用于诊断服务系统中的性能问题。DeLag通过识别显示出潜在相关性能问题症状的请求子集来检测潜在的性能问题。我们称这些症状为延迟降级模式。DeLag在同时优化精度、召回率和延迟相似度的基础上搜索多个延迟降级模式。实验结果表明，DeLag比三种最先进的方法和通用的机器学习聚类算法提供更好和更稳定的效果。",
    "tldr": "DeLag是一种新颖的自动化搜索方法，使用多目标优化以诊断服务系统中的延迟降级模式，其效果优于现有方法和通用的机器学习聚类算法。",
    "en_tdlr": "DeLag is a novel automated search-based approach for diagnosing latency degradation patterns in service-based systems using multi-objective optimization, which outperforms existing methods and general purpose machine learning clustering algorithms."
}