{
    "title": "A scalable and fast artificial neural network syndrome decoder for surface codes. (arXiv:2110.05854v4 [quant-ph] UPDATED)",
    "abstract": "Surface code error correction offers a highly promising pathway to achieve scalable fault-tolerant quantum computing. When operated as stabilizer codes, surface code computations consist of a syndrome decoding step where measured stabilizer operators are used to determine appropriate corrections for errors in physical qubits. Decoding algorithms have undergone substantial development, with recent work incorporating machine learning (ML) techniques. Despite promising initial results, the ML-based syndrome decoders are still limited to small scale demonstrations with low latency and are incapable of handling surface codes with boundary conditions and various shapes needed for lattice surgery and braiding. Here, we report the development of an artificial neural network (ANN) based scalable and fast syndrome decoder capable of decoding surface codes of arbitrary shape and size with data qubits suffering from the depolarizing error model. Based on rigorous training over 50 million random qu",
    "link": "http://arxiv.org/abs/2110.05854",
    "context": "Title: A scalable and fast artificial neural network syndrome decoder for surface codes. (arXiv:2110.05854v4 [quant-ph] UPDATED)\nAbstract: Surface code error correction offers a highly promising pathway to achieve scalable fault-tolerant quantum computing. When operated as stabilizer codes, surface code computations consist of a syndrome decoding step where measured stabilizer operators are used to determine appropriate corrections for errors in physical qubits. Decoding algorithms have undergone substantial development, with recent work incorporating machine learning (ML) techniques. Despite promising initial results, the ML-based syndrome decoders are still limited to small scale demonstrations with low latency and are incapable of handling surface codes with boundary conditions and various shapes needed for lattice surgery and braiding. Here, we report the development of an artificial neural network (ANN) based scalable and fast syndrome decoder capable of decoding surface codes of arbitrary shape and size with data qubits suffering from the depolarizing error model. Based on rigorous training over 50 million random qu",
    "path": "papers/21/10/2110.05854.json",
    "total_tokens": 1085,
    "translated_title": "一种可扩展、快速的基于人工神经网络的表面码综合征解码器",
    "translated_abstract": "表面码纠错提供了实现可扩展容错量子计算的高度有前途的途径。当作为稳定码进行操作时，表面码计算包括一个综合征解码步骤，其中使用测量的稳定码算符来确定物理量子比特中的错误的适当纠正。译码算法经历了实质性的发展，最近的工作纳入了机器学习（ML）技术。尽管初步结果令人鼓舞，但基于ML的综合征译码器仍然局限于具有低延迟的小规模演示，并且无法处理需要进行晶格手术和编织的边界条件和各种形状的表面码。在这里，我们报道了一种基于人工神经网络（ANN）的可扩展快速综合征解码器，能够解码任意形状和大小的表面码，并且可以处理数据量子比特受到极化误差模型的影响。基于对5000万个随机量子错误实例的严格训练，ANN解码器实现了与最先进的译码算法相比的竞争性或优越性能，同时保持高解码准确性，呈现出了显著的加速效果。我们的工作展示了使用基于机器学习的译码方法实现大规模量子纠错的重大进展。",
    "tldr": "本研究报道了一种基于人工神经网络的表面码综合征解码器，能够解码任意形状和大小的表面码，并取得了具有竞争性或优越的性能，显示出惊人的加速作用，这是实现大规模量子纠错的重要进展。",
    "en_tdlr": "This study presents a scalable and fast artificial neural network syndrome decoder capable of decoding surface codes of arbitrary shape and size, achieving competitive or superior performance compared to state-of-the-art decoding algorithms, showing remarkable speed-up and significant progress towards large-scale quantum error correction using machine learning-based decoding methods."
}