{
    "title": "ML4C: Seeing Causality Through Latent Vicinity. (arXiv:2110.00637v4 [cs.LG] UPDATED)",
    "abstract": "Supervised Causal Learning (SCL) aims to learn causal relations from observational data by accessing previously seen datasets associated with ground truth causal relations. This paper presents a first attempt at addressing a fundamental question: What are the benefits from supervision and how does it benefit? Starting from seeing that SCL is not better than random guessing if the learning target is non-identifiable a priori, we propose a two-phase paradigm for SCL by explicitly considering structure identifiability. Following this paradigm, we tackle the problem of SCL on discrete data and propose ML4C. The core of ML4C is a binary classifier with a novel learning target: it classifies whether an Unshielded Triple (UT) is a v-structure or not. Specifically, starting from an input dataset with the corresponding skeleton provided, ML4C orients each UT once it is classified as a v-structure. These v-structures are together used to construct the final output. To address the fundamental que",
    "link": "http://arxiv.org/abs/2110.00637",
    "context": "Title: ML4C: Seeing Causality Through Latent Vicinity. (arXiv:2110.00637v4 [cs.LG] UPDATED)\nAbstract: Supervised Causal Learning (SCL) aims to learn causal relations from observational data by accessing previously seen datasets associated with ground truth causal relations. This paper presents a first attempt at addressing a fundamental question: What are the benefits from supervision and how does it benefit? Starting from seeing that SCL is not better than random guessing if the learning target is non-identifiable a priori, we propose a two-phase paradigm for SCL by explicitly considering structure identifiability. Following this paradigm, we tackle the problem of SCL on discrete data and propose ML4C. The core of ML4C is a binary classifier with a novel learning target: it classifies whether an Unshielded Triple (UT) is a v-structure or not. Specifically, starting from an input dataset with the corresponding skeleton provided, ML4C orients each UT once it is classified as a v-structure. These v-structures are together used to construct the final output. To address the fundamental que",
    "path": "papers/21/10/2110.00637.json",
    "total_tokens": 910,
    "translated_title": "ML4C: 通过潜在邻域观察因果关系",
    "translated_abstract": "监督式因果学习（SCL）旨在通过访问与地面真实因果关系相关的先前看到的数据集，从观察数据中学习因果关系。本文提出了首次尝试解决一个基本问题：监督的好处是什么，以及如何受益？我们提出了一个面向因果学习的双阶段范例，通过显式考虑结构可识别性来解决SCL问题。按照这个范例，我们针对离散数据的SCL问题提出了ML4C。ML4C的核心是一个二元分类器，其新颖的学习目标是分类未屏蔽三元组（UT）是否是v-结构。具体而言，从提供了相应骨架的输入数据集开始，ML4C在将UT分类为v-结构后对其进行取向。这些v-结构一起用于构建最终输出。为解决基本问题，我们提出了一种学习目标，称为潜在邻域识别，通过对UT进行分类，最终获得因果关系。",
    "tldr": "本文提出了一种监督式因果学习方法ML4C，采用了新颖的学习目标，用于分类未屏蔽三元组是否是v-结构，并构建因果关系。",
    "en_tdlr": "This paper proposes a supervised causal learning method called ML4C, which uses a novel learning target to classify whether an Unshielded Triple (UT) is a v-structure and construct causal relations."
}