{
    "title": "CaloFlow II: Even Faster and Still Accurate Generation of Calorimeter Showers with Normalizing Flows. (arXiv:2110.11377v2 [physics.ins-det] UPDATED)",
    "abstract": "Recently, we introduced CaloFlow, a high-fidelity generative model for GEANT4 calorimeter shower emulation based on normalizing flows. Here, we present CaloFlow v2, an improvement on our original framework that speeds up shower generation by a further factor of 500 relative to the original. The improvement is based on a technique called Probability Density Distillation, originally developed for speech synthesis in the ML literature, and which we develop further by introducing a set of powerful new loss terms. We demonstrate that CaloFlow v2 preserves the same high fidelity of the original using qualitative (average images, histograms of high level features) and quantitative (classifier metric between GEANT4 and generated samples) measures. The result is a generative model for calorimeter showers that matches the state-of-the-art in speed (a factor of $10^4$ faster than GEANT4) and greatly surpasses the previous state-of-the-art in fidelity.",
    "link": "http://arxiv.org/abs/2110.11377",
    "context": "Title: CaloFlow II: Even Faster and Still Accurate Generation of Calorimeter Showers with Normalizing Flows. (arXiv:2110.11377v2 [physics.ins-det] UPDATED)\nAbstract: Recently, we introduced CaloFlow, a high-fidelity generative model for GEANT4 calorimeter shower emulation based on normalizing flows. Here, we present CaloFlow v2, an improvement on our original framework that speeds up shower generation by a further factor of 500 relative to the original. The improvement is based on a technique called Probability Density Distillation, originally developed for speech synthesis in the ML literature, and which we develop further by introducing a set of powerful new loss terms. We demonstrate that CaloFlow v2 preserves the same high fidelity of the original using qualitative (average images, histograms of high level features) and quantitative (classifier metric between GEANT4 and generated samples) measures. The result is a generative model for calorimeter showers that matches the state-of-the-art in speed (a factor of $10^4$ faster than GEANT4) and greatly surpasses the previous state-of-the-art in fidelity.",
    "path": "papers/21/10/2110.11377.json",
    "total_tokens": 924,
    "translated_title": "CaloFlow II: 采用归一化流进一步提高速度并保持准确性的量能器淋浴生成器",
    "translated_abstract": "最近，我们介绍了一种基于归一化流的高保真量能器淋浴仿真生成模型CaloFlow。现在，我们介绍了CaloFlow v2，它是我们原来框架的改进版，相对于原版将淋浴生成速度进一步提高了500倍。这种改进基于一种称为概率密度蒸馏的技术，这种技术最初用于ML领域的语音合成，我们通过引入一组强大的新损失项进一步开发了这种技术。我们通过定性（平均图像、高级特征的直方图）和定量（GEANT4和生成样本之间的分类器指标）度量证明CaloFlow v2保持了与原版相同的高保真度。结果是一种量能器淋浴的生成模型，其速度达到了最先进水平（比GEANT4快$10^4$倍），并且在保真度方面大大超过了以前的最先进水平。",
    "tldr": "CaloFlow v2是一种基于归一化流的高保真量能器淋浴仿真生成模型，相对于原版将淋浴生成速度进一步提高了500倍，并且在保真度方面大大超过了以前的最先进水平。",
    "en_tdlr": "CaloFlow v2 is a high-fidelity generative model for calorimeter shower emulation based on normalizing flows, which speeds up shower generation by a further factor of 500 relative to the original and greatly surpasses the previous state-of-the-art in fidelity."
}