{
    "title": "Instrumental Variable-Driven Domain Generalization with Unobserved Confounders. (arXiv:2110.01438v2 [cs.LG] UPDATED)",
    "abstract": "Domain generalization (DG) aims to learn from multiple source domains a model that can generalize well on unseen target domains. Existing DG methods mainly learn the representations with invariant marginal distribution of the input features, however, the invariance of the conditional distribution of the labels given the input features is more essential for unknown domain prediction. Meanwhile, the existing of unobserved confounders which affect the input features and labels simultaneously cause spurious correlation and hinder the learning of the invariant relationship contained in the conditional distribution. Interestingly, with a causal view on the data generating process, we find that the input features of one domain are valid instrumental variables for other domains. Inspired by this finding, we propose an instrumental variable-driven DG method (IV-DG) by removing the bias of the unobserved confounders with two-stage learning. In the first stage, it learns the conditional distribut",
    "link": "http://arxiv.org/abs/2110.01438",
    "context": "Title: Instrumental Variable-Driven Domain Generalization with Unobserved Confounders. (arXiv:2110.01438v2 [cs.LG] UPDATED)\nAbstract: Domain generalization (DG) aims to learn from multiple source domains a model that can generalize well on unseen target domains. Existing DG methods mainly learn the representations with invariant marginal distribution of the input features, however, the invariance of the conditional distribution of the labels given the input features is more essential for unknown domain prediction. Meanwhile, the existing of unobserved confounders which affect the input features and labels simultaneously cause spurious correlation and hinder the learning of the invariant relationship contained in the conditional distribution. Interestingly, with a causal view on the data generating process, we find that the input features of one domain are valid instrumental variables for other domains. Inspired by this finding, we propose an instrumental variable-driven DG method (IV-DG) by removing the bias of the unobserved confounders with two-stage learning. In the first stage, it learns the conditional distribut",
    "path": "papers/21/10/2110.01438.json",
    "total_tokens": 825,
    "translated_title": "基于工具变量的未观测混淆因素驱动域泛化",
    "translated_abstract": "域泛化旨在从多个源领域中学习模型，以在未知目标领域中获得良好的泛化性能。现有方法主要学习具有不变边际分布的表示，然而标签给定输入特征的条件分布的不变性对于未知领域的预测更为基本。同时，影响输入特征和标签的未观测混淆因素存在会导致伪相关性，并阻碍包含条件分布中包含不变关系的学习。有趣的是，通过对数据生成过程进行因果性观察，我们发现一个领域的输入特征是其他领域的有效工具变量。受此发现启发，我们提出了一种基于工具变量驱动的域泛化方法 (IV-DG)，通过两阶段学习去除未观测混淆因素的偏差。",
    "tldr": "本文提出了一种基于工具变量去除未观测混淆因素偏差的域泛化方法。"
}