{
    "title": "Combining Transformers with Natural Language Explanations",
    "abstract": "arXiv:2110.00125v3 Announce Type: replace-cross  Abstract: Many NLP applications require models to be interpretable. However, many successful neural architectures, including transformers, still lack effective interpretation methods. A possible solution could rely on building explanations from domain knowledge, which is often available as plain, natural language text. We thus propose an extension to transformer models that makes use of external memories to store natural language explanations and use them to explain classification outputs. We conduct an experimental evaluation on two domains, legal text analysis and argument mining, to show that our approach can produce relevant explanations while retaining or even improving classification performance.",
    "link": "https://arxiv.org/abs/2110.00125",
    "context": "Title: Combining Transformers with Natural Language Explanations\nAbstract: arXiv:2110.00125v3 Announce Type: replace-cross  Abstract: Many NLP applications require models to be interpretable. However, many successful neural architectures, including transformers, still lack effective interpretation methods. A possible solution could rely on building explanations from domain knowledge, which is often available as plain, natural language text. We thus propose an extension to transformer models that makes use of external memories to store natural language explanations and use them to explain classification outputs. We conduct an experimental evaluation on two domains, legal text analysis and argument mining, to show that our approach can produce relevant explanations while retaining or even improving classification performance.",
    "path": "papers/21/10/2110.00125.json",
    "total_tokens": 727,
    "translated_title": "将变压器与自然语言解释相结合",
    "translated_abstract": "许多自然语言处理应用需要模型具有解释性。然而，许多成功的神经架构，包括变压器，仍然缺乏有效的解释方法。建立解释可能的一个解决方案是依赖建立来自领域知识的解释，这些知识通常以简单的自然语言文本形式存在。因此，我们提出了一个扩展到变压器模型的方法，利用外部记忆来存储自然语言解释，并使用它们来解释分类输出。我们在两个领域，法律文本分析和论据挖掘，进行了实验评估，以表明我们的方法可以产生相关的解释，同时保持或甚至提高分类性能。",
    "tldr": "通过结合自然语言解释和变压器模型，我们提出了一种方法来利用外部记忆存储自然语言解释，并用于解释分类输出，实验证明这种方法能够产生相关解释且保持或提高分类性能。",
    "en_tdlr": "By combining natural language explanations with transformer models, we propose a method that utilizes external memory to store natural language explanations and use them to explain classification outputs. Experimental results demonstrate that this approach can generate relevant explanations while maintaining or even improving classification performance."
}