{
    "title": "Pharmacoprint -- a combination of pharmacophore fingerprint and artificial intelligence as a tool for computer-aided drug design. (arXiv:2110.01339v2 [q-bio.QM] UPDATED)",
    "abstract": "Structural fingerprints and pharmacophore modeling are methodologies that have been used for at least two decades in various fields of cheminformatics: from similarity searching to machine learning (ML). Advances in silico techniques consequently led to combining both these methodologies into a new approach known as pharmacophore fingerprint. Herein, we propose a high-resolution, pharmacophore fingerprint called Pharmacoprint that encodes the presence, types, and relationships between pharmacophore features of a molecule. Pharmacoprint was evaluated in classification experiments by using ML algorithms (logistic regression, support vector machines, linear support vector machines, and neural networks) and outperformed other popular molecular fingerprints (i.e., Estate, MACCS, PubChem, Substructure, Klekotha-Roth, CDK, Extended, and GraphOnly) and ChemAxon Pharmacophoric Features fingerprint. Pharmacoprint consisted of 39973 bits; several methods were applied for dimensionality reduction,",
    "link": "http://arxiv.org/abs/2110.01339",
    "context": "Title: Pharmacoprint -- a combination of pharmacophore fingerprint and artificial intelligence as a tool for computer-aided drug design. (arXiv:2110.01339v2 [q-bio.QM] UPDATED)\nAbstract: Structural fingerprints and pharmacophore modeling are methodologies that have been used for at least two decades in various fields of cheminformatics: from similarity searching to machine learning (ML). Advances in silico techniques consequently led to combining both these methodologies into a new approach known as pharmacophore fingerprint. Herein, we propose a high-resolution, pharmacophore fingerprint called Pharmacoprint that encodes the presence, types, and relationships between pharmacophore features of a molecule. Pharmacoprint was evaluated in classification experiments by using ML algorithms (logistic regression, support vector machines, linear support vector machines, and neural networks) and outperformed other popular molecular fingerprints (i.e., Estate, MACCS, PubChem, Substructure, Klekotha-Roth, CDK, Extended, and GraphOnly) and ChemAxon Pharmacophoric Features fingerprint. Pharmacoprint consisted of 39973 bits; several methods were applied for dimensionality reduction,",
    "path": "papers/21/10/2110.01339.json",
    "total_tokens": 904,
    "translated_title": "Pharmacoprint -- 一种将药效固指纹和人工智能结合为计算辅助药物设计工具的方法",
    "translated_abstract": "结构指纹和药效固建模是在化学信息学的各个领域中使用了至少二十年的方法学：从相似性搜索到机器学习。随着体外技术的进步，将这两种方法结合成一种称为药效固指纹的新方法。本文提出了一个高分辨率的药效固指纹 Pharmacoprint，它编码了分子的药效固特征的存在、类型和关系。通过使用机器学习算法（逻辑回归、支持向量机、线性支持向量机和神经网络）对 Pharmacoprint 进行了分类实验，并优于其他流行的分子指纹（即 Estate、MACCS、PubChem、亚结构、Klekotha-Roth、CDK、扩展和 GraphOnly）和 ChemAxon 药效固特征指纹。Pharmacoprint 包含了 39973 个位；使用了多种方法进行了降维处理，",
    "tldr": "提出了一种将药效固指纹和人工智能结合的新方法 Pharmacoprint，通过编码分子的药效固特征，提供了高分辨率的药物设计工具，优于其他常用的分子指纹方法。",
    "en_tdlr": "A new approach called Pharmacoprint, which combines pharmacophore fingerprint and artificial intelligence, is proposed. It encodes the pharmacophore features of molecules and provides a high-resolution tool for drug design, outperforming other popular molecular fingerprint methods."
}