{
    "title": "Bilevel Imaging Learning Problems as Mathematical Programs with Complementarity Constraints: Reformulation and Theory. (arXiv:2110.02273v2 [math.OC] UPDATED)",
    "abstract": "We investigate a family of bilevel imaging learning problems where the lower-level instance corresponds to a convex variational model involving firstand second-order nonsmooth sparsity-based regularizers. By using geometric properties of the primal-dual reformulation of the lower-level problem and introducing suitable auxiliar variables, we are able to reformulate the original bilevel problems as Mathematical Programs with Complementarity Constraints (MPCC). For the latter, we prove tight constraint qualification conditions (MPCC-RCPLD and partial MPCC-LICQ) and derive Mordukhovich (M-) and Strong (S-) stationarity conditions. The stationarity systems for the MPCC turn also into stationarity conditions for the original formulation. Second-order sufficient optimality conditions are derived as well, together with a local uniqueness result for stationary points. The proposed reformulation may be extended to problems in function spaces, leading to MPCC's with constraints on the gradient ",
    "link": "http://arxiv.org/abs/2110.02273",
    "context": "Title: Bilevel Imaging Learning Problems as Mathematical Programs with Complementarity Constraints: Reformulation and Theory. (arXiv:2110.02273v2 [math.OC] UPDATED)\nAbstract: We investigate a family of bilevel imaging learning problems where the lower-level instance corresponds to a convex variational model involving firstand second-order nonsmooth sparsity-based regularizers. By using geometric properties of the primal-dual reformulation of the lower-level problem and introducing suitable auxiliar variables, we are able to reformulate the original bilevel problems as Mathematical Programs with Complementarity Constraints (MPCC). For the latter, we prove tight constraint qualification conditions (MPCC-RCPLD and partial MPCC-LICQ) and derive Mordukhovich (M-) and Strong (S-) stationarity conditions. The stationarity systems for the MPCC turn also into stationarity conditions for the original formulation. Second-order sufficient optimality conditions are derived as well, together with a local uniqueness result for stationary points. The proposed reformulation may be extended to problems in function spaces, leading to MPCC's with constraints on the gradient ",
    "path": "papers/21/10/2110.02273.json",
    "total_tokens": 959,
    "translated_title": "具有互补约束的数学规划问题作为双层成像学习问题的改进和理论研究",
    "translated_abstract": "我们研究了一类双层成像学习问题，其中较低层次的实例对应于涉及一阶和二阶非平滑稀疏正则化器的凸变分模型。通过使用较低级问题的原始对偶重构的几何性质和引入适当的辅助变量，我们能够将原始的双层问题重新表述为具有互补约束的数学规划问题（MPCC）。对于后者，我们证明了紧的约束条件合规性条件（MPCC-RCPLD和部分MPCC-LICQ）并导出Mordukhovich（M-）和Strong（S-）稳定条件。MPCC的静止系统也可以成为原始公式的静止条件。此外，导出了二阶充分最优性条件，还得出了静止点的局部唯一性结果。所提出的改进可以扩展到函数空间中的问题，导致对梯度的约束的具有互补约束的数学规划问题。",
    "tldr": "本论文提出了一种新的数学规划问题（MPCC）的方法用于解决双层成像学习问题。该方法在满足一定条件下，可以得出稳定条件、最优性条件和局部唯一性结果，可用于函数空间中的问题，并且可以加入对梯度的约束。",
    "en_tdlr": "This paper proposes a novel approach using Mathematical Programs with Complementarity Constraints (MPCC) to solve bilevel imaging learning problems. The approach provides stability conditions, optimality conditions, and local uniqueness results under certain qualifications. It can also be extended to problems in function spaces and can include constraints on the gradient."
}