{
    "title": "Networked Time Series Prediction with Incomplete Data. (arXiv:2110.02271v2 [cs.LG] UPDATED)",
    "abstract": "A networked time series (NETS) is a family of time series on a given graph, one for each node. It has found a wide range of applications from intelligent transportation, environment monitoring to mobile network management. An important task in such applications is to predict the future values of a NETS based on its historical values and the underlying graph. Most existing methods require complete data for training. However, in real-world scenarios, it is not uncommon to have missing data due to sensor malfunction, incomplete sensing coverage, etc. In this paper, we study the problem of NETS prediction with incomplete data. We propose NETS-ImpGAN, a novel deep learning framework that can be trained on incomplete data with missing values in both history and future. Furthermore, we propose novel Graph Temporal Attention Networks by incorporating the attention mechanism to capture both inter-time series correlations and temporal correlations. We conduct extensive experiments on three real-",
    "link": "http://arxiv.org/abs/2110.02271",
    "context": "Title: Networked Time Series Prediction with Incomplete Data. (arXiv:2110.02271v2 [cs.LG] UPDATED)\nAbstract: A networked time series (NETS) is a family of time series on a given graph, one for each node. It has found a wide range of applications from intelligent transportation, environment monitoring to mobile network management. An important task in such applications is to predict the future values of a NETS based on its historical values and the underlying graph. Most existing methods require complete data for training. However, in real-world scenarios, it is not uncommon to have missing data due to sensor malfunction, incomplete sensing coverage, etc. In this paper, we study the problem of NETS prediction with incomplete data. We propose NETS-ImpGAN, a novel deep learning framework that can be trained on incomplete data with missing values in both history and future. Furthermore, we propose novel Graph Temporal Attention Networks by incorporating the attention mechanism to capture both inter-time series correlations and temporal correlations. We conduct extensive experiments on three real-",
    "path": "papers/21/10/2110.02271.json",
    "total_tokens": 889,
    "translated_title": "具有不完整数据的网络时间序列预测",
    "translated_abstract": "网络时间序列（NETS）是给定图上的一组时间序列，每个节点对应一个时间序列。它在智能交通、环境监测和移动网络管理等领域都有广泛应用。在这些应用中，一个重要的任务是基于历史值和底层图来预测NETS的未来值。大多数现有的方法需要完整的数据进行训练。然而，在现实世界的情况下，由于传感器故障、不完全感知覆盖等原因，数据缺失是常见的。本文研究了具有不完整数据的NETS预测问题。我们提出了NETS-ImpGAN，一种可以在历史和未来的缺失值上训练的新型深度学习框架。此外，我们提出了新颖的图时序注意力网络，通过引入注意力机制来捕捉时间序列之间的相关性和时间相关性。我们在三个真实数据集上进行了大量实验。",
    "tldr": "本文研究了具有不完整数据的网络时间序列（NETS）预测问题。提出了NETS-ImpGAN深度学习框架，可以训练不完整数据，并引入了图时序注意力网络来捕捉时间序列之间的相关性和时间相关性。",
    "en_tdlr": "This paper investigates the problem of networked time series (NETS) prediction with incomplete data. It proposes the NETS-ImpGAN deep learning framework that can be trained on incomplete data and introduces graph temporal attention networks to capture inter-time series correlations and temporal correlations."
}