{
    "title": "Divide-and-Conquer Fusion. (arXiv:2110.07265v2 [stat.ME] UPDATED)",
    "abstract": "Combining several (sample approximations of) distributions, which we term sub-posteriors, into a single distribution proportional to their product, is a common challenge. Occurring, for instance, in distributed 'big data' problems, or when working under multi-party privacy constraints. Many existing approaches resort to approximating the individual sub-posteriors for practical necessity, then find either an analytical approximation or sample approximation of the resulting (product-pooled) posterior. The quality of the posterior approximation for these approaches is poor when the sub-posteriors fall out-with a narrow range of distributional form, such as being approximately Gaussian. Recently, a Fusion approach has been proposed which finds an exact Monte Carlo approximation of the posterior, circumventing the drawbacks of approximate approaches. Unfortunately, existing Fusion approaches have a number of computational limitations, particularly when unifying a large number of sub-posteri",
    "link": "http://arxiv.org/abs/2110.07265",
    "context": "Title: Divide-and-Conquer Fusion. (arXiv:2110.07265v2 [stat.ME] UPDATED)\nAbstract: Combining several (sample approximations of) distributions, which we term sub-posteriors, into a single distribution proportional to their product, is a common challenge. Occurring, for instance, in distributed 'big data' problems, or when working under multi-party privacy constraints. Many existing approaches resort to approximating the individual sub-posteriors for practical necessity, then find either an analytical approximation or sample approximation of the resulting (product-pooled) posterior. The quality of the posterior approximation for these approaches is poor when the sub-posteriors fall out-with a narrow range of distributional form, such as being approximately Gaussian. Recently, a Fusion approach has been proposed which finds an exact Monte Carlo approximation of the posterior, circumventing the drawbacks of approximate approaches. Unfortunately, existing Fusion approaches have a number of computational limitations, particularly when unifying a large number of sub-posteri",
    "path": "papers/21/10/2110.07265.json",
    "total_tokens": 818,
    "translated_title": "分而治之融合",
    "translated_abstract": "将几个（样本逼近的）分布，我们称为子后验分布，结合成一个比例为它们乘积的单一分布是一个常见的挑战。这在分布式“大数据”问题中经常发生，或者在多方隐私约束下工作时会遇到。许多现有方法都采用近似子后验的方式，然后找到结果（产品汇总）后验的解析近似或样本近似。对于这些方法，当子后验分布超出一定范围（比如近似为高斯分布）时，后验近似的质量较差。最近，提出了一种融合方法，该方法找到了后验的精确蒙特卡罗近似，避免了近似方法的缺点。不幸的是，现有融合方法存在一些计算限制，特别是当整合大量子后验时。",
    "tldr": "这篇论文提出了一种分而治之的融合方法，在解决分布式“大数据”问题或多方隐私约束时，通过精确蒙特卡罗近似来改善后验分布的质量。",
    "en_tdlr": "This paper presents a divide-and-conquer fusion approach to improve the quality of posterior distributions in solving distributed \"big data\" problems or working under multi-party privacy constraints using exact Monte Carlo approximation."
}