{
    "title": "The Rich Get Richer: Disparate Impact of Semi-Supervised Learning. (arXiv:2110.06282v4 [cs.LG] UPDATED)",
    "abstract": "Semi-supervised learning (SSL) has demonstrated its potential to improve the model accuracy for a variety of learning tasks when the high-quality supervised data is severely limited. Although it is often established that the average accuracy for the entire population of data is improved, it is unclear how SSL fares with different sub-populations. Understanding the above question has substantial fairness implications when different sub-populations are defined by the demographic groups that we aim to treat fairly. In this paper, we reveal the disparate impacts of deploying SSL: the sub-population who has a higher baseline accuracy without using SSL (the \"rich\" one) tends to benefit more from SSL; while the sub-population who suffers from a low baseline accuracy (the \"poor\" one) might even observe a performance drop after adding the SSL module. We theoretically and empirically establish the above observation for a broad family of SSL algorithms, which either explicitly or implicitly use a",
    "link": "http://arxiv.org/abs/2110.06282",
    "context": "Title: The Rich Get Richer: Disparate Impact of Semi-Supervised Learning. (arXiv:2110.06282v4 [cs.LG] UPDATED)\nAbstract: Semi-supervised learning (SSL) has demonstrated its potential to improve the model accuracy for a variety of learning tasks when the high-quality supervised data is severely limited. Although it is often established that the average accuracy for the entire population of data is improved, it is unclear how SSL fares with different sub-populations. Understanding the above question has substantial fairness implications when different sub-populations are defined by the demographic groups that we aim to treat fairly. In this paper, we reveal the disparate impacts of deploying SSL: the sub-population who has a higher baseline accuracy without using SSL (the \"rich\" one) tends to benefit more from SSL; while the sub-population who suffers from a low baseline accuracy (the \"poor\" one) might even observe a performance drop after adding the SSL module. We theoretically and empirically establish the above observation for a broad family of SSL algorithms, which either explicitly or implicitly use a",
    "path": "papers/21/10/2110.06282.json",
    "total_tokens": 938,
    "translated_title": "富者愈富: 半监督学习的不平等影响",
    "translated_abstract": "半监督学习（SSL）在高质量监督数据严重有限的情况下，已经展示了提高模型准确性的潜力。尽管往往可以确立整个数据族群的平均准确性得到改善，但SSL在不同子族群中的表现尚不清楚。当我们希望公平对待的人口群体由人口统计学分组定义时，理解上述问题具有重要的公平性影响。在本文中，我们揭示了部署SSL的不平等影响：那些在不使用SSL时具有更高基准准确性的子族群（\"富裕\"子族群）往往从SSL中获益更多；而那些在基准准确性较低（\"贫穷\"）的子族群在添加SSL模块后甚至可能观察到性能下降。我们在一类广泛的SSL算法上在理论上和实证上证实了上述观察，这些算法明确或隐含地使用了一个...",
    "tldr": "本文研究了半监督学习的不平等影响，发现那些在不使用SSL时具有更高基准准确性的子族群更容易从SSL中获益，而那些基准准确性较低的子族群在添加SSL模块后可能会观察到性能下降。",
    "en_tdlr": "This paper investigates the disparate impact of semi-supervised learning, revealing that sub-populations with higher baseline accuracy without using SSL tend to benefit more from SSL, while sub-populations with lower baseline accuracy may observe a performance drop after adding the SSL module."
}