{
    "title": "Labeled sample compression schemes for complexes of oriented matroids. (arXiv:2110.15168v3 [math.CO] UPDATED)",
    "abstract": "We show that the topes of a complex of oriented matroids (abbreviated COM) of VC-dimension $d$ admit a proper labeled sample compression scheme of size $d$. This considerably extends results of Moran and Warmuth on ample classes, of Ben-David and Litman on affine arrangements of hyperplanes, and of the authors on complexes of uniform oriented matroids, and is a step towards the sample compression conjecture -- one of the oldest open problems in computational learning theory. On the one hand, our approach exploits the rich combinatorial cell structure of COMs via oriented matroid theory. On the other hand, viewing tope graphs of COMs as partial cubes creates a fruitful link to metric graph theory.",
    "link": "http://arxiv.org/abs/2110.15168",
    "context": "Title: Labeled sample compression schemes for complexes of oriented matroids. (arXiv:2110.15168v3 [math.CO] UPDATED)\nAbstract: We show that the topes of a complex of oriented matroids (abbreviated COM) of VC-dimension $d$ admit a proper labeled sample compression scheme of size $d$. This considerably extends results of Moran and Warmuth on ample classes, of Ben-David and Litman on affine arrangements of hyperplanes, and of the authors on complexes of uniform oriented matroids, and is a step towards the sample compression conjecture -- one of the oldest open problems in computational learning theory. On the one hand, our approach exploits the rich combinatorial cell structure of COMs via oriented matroid theory. On the other hand, viewing tope graphs of COMs as partial cubes creates a fruitful link to metric graph theory.",
    "path": "papers/21/10/2110.15168.json",
    "total_tokens": 837,
    "translated_title": "有向拟阵的复合体的标记样本压缩方案",
    "translated_abstract": "我们展示了一个大小为$d$的适当的标记样本压缩方案，用于VC维为$d$的有向拟阵的复合体（简称COM）的拓扑。这极大地扩展了关于充分类（ample classes）的Moran和Warmuth的结果、关于超平面仿射排列的Ben-David和Litman的结果以及关于均匀有向拟阵的复合体的作者的结果，并为样本压缩猜想迈出了一步，这是计算学习理论中最古老的开放性问题之一。一方面，我们的方法通过有向拟阵理论利用了COM的丰富的组合细胞结构。另一方面，将COM的顶点图形视为部分立方体创建了与度量图形理论的有益联系。",
    "tldr": "本研究提出了适用于VC维为$d$的有向拟阵的复合体的拓扑的标记样本压缩方案，为计算学习理论中的样本压缩猜想迈出了一步。",
    "en_tdlr": "This study proposes a proper labeled sample compression scheme for the topology of COMs with a VC-dimension of $d$, which extends prior results and provides progress towards the sample compression conjecture, one of the oldest open problems in computational learning theory. The approach utilizes oriented matroid theory to exploit the rich combinatorial cell structure of COMs, while viewing tope graphs of COMs as partial cubes creates a beneficial link to metric graph theory."
}