{
    "title": "Logical Assessment Formula and Its Principles for Evaluations with Inaccurate Ground-Truth Labels. (arXiv:2110.11567v4 [cs.AI] UPDATED)",
    "abstract": "Evaluations with accurate ground-truth labels (AGTLs) have been widely employed to assess predictive models for artificial intelligence applications. However, in some specific fields, such as medical histopathology whole slide image analysis, it is quite usual the situation that AGTLs are difficult to be precisely defined or even do not exist. To alleviate this situation, we propose logical assessment formula (LAF) and reveal its principles for evaluations with inaccurate ground-truth labels (IAGTLs) via logical reasoning under uncertainty. From the revealed principles of LAF, we summarize the practicability of LAF: 1) LAF can be applied for evaluations with IAGTLs on a more difficult task, able to act like usual strategies for evaluations with AGTLs reasonably; 2) LAF can be applied for evaluations with IAGTLs from the logical perspective on an easier task, unable to act like usual strategies for evaluations with AGTLs confidently.",
    "link": "http://arxiv.org/abs/2110.11567",
    "context": "Title: Logical Assessment Formula and Its Principles for Evaluations with Inaccurate Ground-Truth Labels. (arXiv:2110.11567v4 [cs.AI] UPDATED)\nAbstract: Evaluations with accurate ground-truth labels (AGTLs) have been widely employed to assess predictive models for artificial intelligence applications. However, in some specific fields, such as medical histopathology whole slide image analysis, it is quite usual the situation that AGTLs are difficult to be precisely defined or even do not exist. To alleviate this situation, we propose logical assessment formula (LAF) and reveal its principles for evaluations with inaccurate ground-truth labels (IAGTLs) via logical reasoning under uncertainty. From the revealed principles of LAF, we summarize the practicability of LAF: 1) LAF can be applied for evaluations with IAGTLs on a more difficult task, able to act like usual strategies for evaluations with AGTLs reasonably; 2) LAF can be applied for evaluations with IAGTLs from the logical perspective on an easier task, unable to act like usual strategies for evaluations with AGTLs confidently.",
    "path": "papers/21/10/2110.11567.json",
    "total_tokens": 976,
    "translated_title": "评估具有不准确地实际标签的方法的逻辑评估公式及其原则",
    "translated_abstract": "在人工智能应用的预测模型评估中，常常使用具有准确实际标签的评估来进行。然而，在某些特定领域，例如医学组织病理学全切片图像分析中，准确实际标签的定义往往困难，甚至不存在。为了缓解这种情况，我们提出了逻辑评估公式（LAF），并通过不确定状态下的逻辑推理揭示了其在具有不准确实际标签的评估中的原则。根据LAF的原则，我们总结了LAF的实用性：1）LAF可应用于更困难的、具有不准确实际标签的评估任务中，并能像常规策略一样合理地工作；2）LAF可从逻辑角度应用于更简单的、具有不准确实际标签的评估任务中，但无法像常规策略一样自信地工作。",
    "tldr": "我们提出了逻辑评估公式（LAF），通过逻辑推理揭示了其在具有不准确实际标签的评估中的原则。LAF可以在困难的任务中应用于具有不准确实际标签的评估，并合理工作；也可以从逻辑角度应用于简单的任务中，但无法像常规策略一样自信工作。",
    "en_tdlr": "We propose a logical assessment formula (LAF) and reveal its principles for evaluations with inaccurate ground-truth labels (IAGTLs). LAF can be applied for evaluations with IAGTLs on difficult tasks and work reasonably, or applied from a logical perspective on easier tasks but cannot work confidently like usual strategies for evaluations with accurate ground-truth labels (AGTLs)."
}