{
    "title": "Empowering General-purpose User Representation with Full-life Cycle Behavior Modeling. (arXiv:2110.11337v4 [cs.LG] UPDATED)",
    "abstract": "User Modeling plays an essential role in industry. In this field, task-agnostic approaches, which generate general-purpose representation applicable to diverse downstream user cognition tasks, is a promising direction being more valuable and economical than task-specific representation learning. With the rapid development of Internet service platforms, user behaviors have been accumulated continuously. However, existing general-purpose user representation researches have little ability for full-life cycle modeling on extremely long behavior sequences since user registration. In this study, we propose a novel framework called full- Life cycle User Representation Model (LURM) to tackle this challenge. Specifically, LURM consists of two cascaded sub-models: (I) Bag-of-Interests (BoI) encodes user behaviors in any time period into a sparse vector with super-high dimension (e.g., 10^5); (II) Self-supervised Multi-anchor Encoder Network (SMEN) maps sequences of BoI features to multiple low-d",
    "link": "http://arxiv.org/abs/2110.11337",
    "context": "Title: Empowering General-purpose User Representation with Full-life Cycle Behavior Modeling. (arXiv:2110.11337v4 [cs.LG] UPDATED)\nAbstract: User Modeling plays an essential role in industry. In this field, task-agnostic approaches, which generate general-purpose representation applicable to diverse downstream user cognition tasks, is a promising direction being more valuable and economical than task-specific representation learning. With the rapid development of Internet service platforms, user behaviors have been accumulated continuously. However, existing general-purpose user representation researches have little ability for full-life cycle modeling on extremely long behavior sequences since user registration. In this study, we propose a novel framework called full- Life cycle User Representation Model (LURM) to tackle this challenge. Specifically, LURM consists of two cascaded sub-models: (I) Bag-of-Interests (BoI) encodes user behaviors in any time period into a sparse vector with super-high dimension (e.g., 10^5); (II) Self-supervised Multi-anchor Encoder Network (SMEN) maps sequences of BoI features to multiple low-d",
    "path": "papers/21/10/2110.11337.json",
    "total_tokens": 943,
    "translated_title": "以全生命周期行为建模赋能通用用户表示",
    "translated_abstract": "用户建模在行业中起着重要作用。在这一领域中，相对于特定任务的表示学习，能够生成适用于各种下游用户认知任务的通用表示的任务无关方法，具有更高的价值和经济性。随着互联网服务平台的快速发展，用户行为不断积累。然而，现有的通用用户表示研究对自用户注册以来的极长行为序列的全生命周期建模能力较弱。在本研究中，我们提出了一种称为全生命周期用户表示模型（LURM）的新框架来解决这一挑战。具体而言，LURM由两个级联的子模型组成：（I）兴趣包（BoI）将任何时间段的用户行为编码为超高维度（例如10^5）的稀疏向量；（II）自监督多锚点编码网络（SMEN）将BoI特征序列映射到多个低维表示。",
    "tldr": "本研究提出了一种名为全生命周期用户表示模型（LURM）的新框架，能够对超长行为序列进行全生命周期建模。该模型由兴趣包编码和自监督多锚点编码网络组成，能够生成适用于各种下游用户认知任务的通用表示。"
}