{
    "title": "Critical Values Robust to P-hacking. (arXiv:2005.04141v6 [econ.EM] UPDATED)",
    "abstract": "P-hacking is prevalent in reality but absent from classical hypothesis testing theory. As a consequence, significant results are much more common than they are supposed to be when the null hypothesis is in fact true. In this paper, we build a model of hypothesis testing with p-hacking. From the model, we construct critical values such that, if the values are used to determine significance, and if scientists' p-hacking behavior adjusts to the new significance standards, significant results occur with the desired frequency. Such robust critical values allow for p-hacking so they are larger than classical critical values. To illustrate the amount of correction required by p-hacking, we calibrate the model using evidence from the medical sciences. In the calibrated model the robust critical value for any test statistic is the classical critical value for the same test statistic with one fifth of the significance level.",
    "link": "http://arxiv.org/abs/2005.04141",
    "context": "Title: Critical Values Robust to P-hacking. (arXiv:2005.04141v6 [econ.EM] UPDATED)\nAbstract: P-hacking is prevalent in reality but absent from classical hypothesis testing theory. As a consequence, significant results are much more common than they are supposed to be when the null hypothesis is in fact true. In this paper, we build a model of hypothesis testing with p-hacking. From the model, we construct critical values such that, if the values are used to determine significance, and if scientists' p-hacking behavior adjusts to the new significance standards, significant results occur with the desired frequency. Such robust critical values allow for p-hacking so they are larger than classical critical values. To illustrate the amount of correction required by p-hacking, we calibrate the model using evidence from the medical sciences. In the calibrated model the robust critical value for any test statistic is the classical critical value for the same test statistic with one fifth of the significance level.",
    "path": "papers/20/05/2005.04141.json",
    "total_tokens": 840,
    "translated_title": "具有抗p-hacking能力的临界值",
    "translated_abstract": "P-hacking在现实中很普遍，但在经典的假设检验理论中却没有出现。因此，在零假设实际成立的情况下，显著结果比预期要常见得多。本文建立了一个带有p-hacking的假设检验模型。通过该模型，我们构建了临界值，如果使用这些值来确定显著性，并且科学家的p-hacking行为符合新的显著性标准，那么显著结果会以期望频率出现。这样的抗干扰临界值允许p-hacking，因此它们比经典的临界值要大。为了说明p-hacking所需的修正量，我们利用医学科学的证据对模型进行了校准。在校准的模型中，任何测试统计量的抗干扰临界值都是相同测试统计量的经典临界值的五分之一。",
    "tldr": "本文建立了一个带有p-hacking的假设检验模型，通过该模型得出的具有抗干扰能力的临界值允许p-hacking，从而修正了传统假设检验理论在现实中的局限性。",
    "en_tdlr": "This paper proposes a hypothesis testing model with p-hacking and constructs critical values that allow for p-hacking and correct the limitations of the classical hypothesis testing theory in reality."
}