{
    "title": "On the Nuisance of Control Variables in Regression Analysis. (arXiv:2005.10314v5 [econ.EM] UPDATED)",
    "abstract": "Control variables are included in regression analyses to estimate the causal effect of a treatment on an outcome. In this paper, we argue that the estimated effect sizes of controls are unlikely to have a causal interpretation themselves, though. This is because even valid controls are possibly endogenous and represent a combination of several different causal mechanisms operating jointly on the outcome, which is hard to interpret theoretically. Therefore, we recommend refraining from interpreting marginal effects of controls and focusing on the main variables of interest, for which a plausible identification argument can be established. To prevent erroneous managerial or policy implications, coefficients of control variables should be clearly marked as not having a causal interpretation or omitted from regression tables altogether. Moreover, we advise against using control variable estimates for subsequent theory building and meta-analyses.",
    "link": "http://arxiv.org/abs/2005.10314",
    "context": "Title: On the Nuisance of Control Variables in Regression Analysis. (arXiv:2005.10314v5 [econ.EM] UPDATED)\nAbstract: Control variables are included in regression analyses to estimate the causal effect of a treatment on an outcome. In this paper, we argue that the estimated effect sizes of controls are unlikely to have a causal interpretation themselves, though. This is because even valid controls are possibly endogenous and represent a combination of several different causal mechanisms operating jointly on the outcome, which is hard to interpret theoretically. Therefore, we recommend refraining from interpreting marginal effects of controls and focusing on the main variables of interest, for which a plausible identification argument can be established. To prevent erroneous managerial or policy implications, coefficients of control variables should be clearly marked as not having a causal interpretation or omitted from regression tables altogether. Moreover, we advise against using control variable estimates for subsequent theory building and meta-analyses.",
    "path": "papers/20/05/2005.10314.json",
    "total_tokens": 954,
    "translated_title": "关于回归分析中控制变量的麻烦事",
    "translated_abstract": "控制变量被包含在回归分析中，是为了估计处理对结果的因果效应。然而，本文认为即使是有效的控制变量，其估计的效应大小本身也很难有因果解释。这是因为即使是有效的控制变量也可能是内生的，并且代表多个不同的因果机制共同作用于结果上，这在理论上很难解释。因此，我们建议不要解释控制变量的边际效应，而是专注于主要感兴趣的变量，其中可以建立合理的识别论证。为了防止错误的管理或政策含义，应明确标记控制变量的系数无法进行因果解释，或者完全从回归表中省略。此外，我们建议不要将控制变量的估计用于后续理论建模和元分析中。",
    "tldr": "本文认为，回归分析中的控制变量，即使是有效的，也很难有因果解释。因此，建议不要解释控制变量的效应，而是专注于可以建立合理识别论证的主要变量。此外，为了防止错误的管理或政策含义，应明确标记控制变量的系数无法进行因果解释，或者完全从回归表中省略它们。同时，不建议将控制变量的估计用于后续理论建模和元分析中。"
}