{
    "title": "Positional Games and QBF: A Polished Encoding. (arXiv:2005.05098v2 [cs.LO] UPDATED)",
    "abstract": "Positional games are a mathematical class of two-player games comprising Tic-tac-toe and its generalizations. We propose a novel encoding of these games into Quantified Boolean Formulas (QBFs) such that a game instance admits a winning strategy for the first player if and only if the corresponding formula is true. Our approach improves over previous QBF encodings of games in multiple ways. First, it is generic and lets us encode other positional games, such as Hex. Second, the structural properties of positional games, together with careful treatment of illegal moves, let us generate more compact instances that can be solved faster by state-of-the-art QBF solvers. We establish the latter fact through extensive experiments. Finally, the compactness of our new encoding makes it feasible to translate realistic game problems. We identify a few such problems of historical significance and put them forward to the QBF community as milestones of increasing difficulty.",
    "link": "http://arxiv.org/abs/2005.05098",
    "context": "Title: Positional Games and QBF: A Polished Encoding. (arXiv:2005.05098v2 [cs.LO] UPDATED)\nAbstract: Positional games are a mathematical class of two-player games comprising Tic-tac-toe and its generalizations. We propose a novel encoding of these games into Quantified Boolean Formulas (QBFs) such that a game instance admits a winning strategy for the first player if and only if the corresponding formula is true. Our approach improves over previous QBF encodings of games in multiple ways. First, it is generic and lets us encode other positional games, such as Hex. Second, the structural properties of positional games, together with careful treatment of illegal moves, let us generate more compact instances that can be solved faster by state-of-the-art QBF solvers. We establish the latter fact through extensive experiments. Finally, the compactness of our new encoding makes it feasible to translate realistic game problems. We identify a few such problems of historical significance and put them forward to the QBF community as milestones of increasing difficulty.",
    "path": "papers/20/05/2005.05098.json",
    "total_tokens": 902,
    "translated_title": "位置游戏与QBF：一个完善的编码",
    "translated_abstract": "位置游戏是一类数学上的双人游戏，包括井字棋及其推广。我们提出了一种新颖的将这些游戏编码成量化布尔公式（QBF）的方法，使得游戏实例存在第一玩家的胜利策略当且仅当相应的公式为真。我们的方法在多个方面改进了先前的QBF游戏编码。首先，它是通用的，并且允许我们编码其他位置游戏，如六角棋。其次，位置游戏的结构特性以及对非法移动的仔细处理使得我们能够生成更紧凑的实例，这些实例可以被最先进的QBF求解器更快地求解。我们通过大量实验确证了后一事实。最后，我们的新编码的紧凑性使得将现实中的游戏问题转化成QBF问题成为可能。我们确定了几个具有历史意义的实际问题，并将它们作为难度递增的里程碑向QBF社区提出。",
    "tldr": "这项研究提出了一种将位置游戏编码为QBF的方法，通过结构特性和对非法移动的处理，生成更紧凑的实例，提高了求解速度。这些编码方法还可以应用于其他位置游戏，并可用于翻译实际问题。"
}