{
    "title": "Gromov-Hausdorff Distances for Comparing Product Manifolds of Model Spaces. (arXiv:2309.05678v1 [cs.LG])",
    "abstract": "Recent studies propose enhancing machine learning models by aligning the geometric characteristics of the latent space with the underlying data structure. Instead of relying solely on Euclidean space, researchers have suggested using hyperbolic and spherical spaces with constant curvature, or their combinations (known as product manifolds), to improve model performance. However, there exists no principled technique to determine the best latent product manifold signature, which refers to the choice and dimensionality of manifold components. To address this, we introduce a novel notion of distance between candidate latent geometries using the Gromov-Hausdorff distance from metric geometry. We propose using a graph search space that uses the estimated Gromov-Hausdorff distances to search for the optimal latent geometry. In this work we focus on providing a description of an algorithm to compute the Gromov-Hausdorff distance between model spaces and its computational implementation.",
    "link": "http://arxiv.org/abs/2309.05678",
    "context": "Title: Gromov-Hausdorff Distances for Comparing Product Manifolds of Model Spaces. (arXiv:2309.05678v1 [cs.LG])\nAbstract: Recent studies propose enhancing machine learning models by aligning the geometric characteristics of the latent space with the underlying data structure. Instead of relying solely on Euclidean space, researchers have suggested using hyperbolic and spherical spaces with constant curvature, or their combinations (known as product manifolds), to improve model performance. However, there exists no principled technique to determine the best latent product manifold signature, which refers to the choice and dimensionality of manifold components. To address this, we introduce a novel notion of distance between candidate latent geometries using the Gromov-Hausdorff distance from metric geometry. We propose using a graph search space that uses the estimated Gromov-Hausdorff distances to search for the optimal latent geometry. In this work we focus on providing a description of an algorithm to compute the Gromov-Hausdorff distance between model spaces and its computational implementation.",
    "path": "papers/23/09/2309.05678.json",
    "total_tokens": 938,
    "translated_title": "用于比较模型空间的产品流形的Gromov-Hausdorff距离",
    "translated_abstract": "最近的研究提出通过将潜在空间的几何特征与底层数据结构对齐来增强机器学习模型。研究人员建议使用具有常曲率的双曲和球面空间，或它们的组合（称为产品流形），以提高模型性能，而不仅仅依赖欧几里得空间。然而，目前没有原则性的技术来确定最佳的潜在产品流形特征，即流形组件的选择和维度。为了解决这个问题，我们引入了一种新的候选潜在几何之间的距离概念，使用度量几何中的Gromov-Hausdorff距离。我们建议使用一个图搜索空间，利用估计的Gromov-Hausdorff距离来搜索最佳的潜在几何。在这项工作中，我们重点介绍了一种计算模型空间之间的Gromov-Hausdorff距离及其计算实现的算法描述。",
    "tldr": "本论文提出了一种用于比较模型空间的产品流形的Gromov-Hausdorff距离的新方法，通过估计距离来搜索最佳的潜在几何。这为提高机器学习模型的性能提供了一种原则性的技术。",
    "en_tdlr": "This paper introduces a novel method of using Gromov-Hausdorff distance to compare product manifolds in model spaces, and proposes a graph search space to find the optimal latent geometry. It provides a principled technique for enhancing machine learning models by aligning geometric characteristics with the underlying data structure."
}