{
    "title": "Astroconformer: The Prospects of Analyzing Stellar Light Curves with Transformer-Based Deep Learning Models. (arXiv:2309.16316v1 [astro-ph.SR])",
    "abstract": "Light curves of stars encapsulate a wealth of information about stellar oscillations and granulation, thereby offering key insights into the internal structure and evolutionary state of stars. Conventional asteroseismic techniques have been largely confined to power spectral analysis, neglecting the valuable phase information contained within light curves. While recent machine learning applications in asteroseismology utilizing Convolutional Neural Networks (CNNs) have successfully inferred stellar attributes from light curves, they are often limited by the local feature extraction inherent in convolutional operations. To circumvent these constraints, we present $\\textit{Astroconformer}$, a Transformer-based deep learning framework designed to capture long-range dependencies in stellar light curves. Our empirical analysis, which focuses on estimating surface gravity ($\\log g$), is grounded in a carefully curated dataset derived from $\\textit{Kepler}$ light curves. These light curves fe",
    "link": "http://arxiv.org/abs/2309.16316",
    "context": "Title: Astroconformer: The Prospects of Analyzing Stellar Light Curves with Transformer-Based Deep Learning Models. (arXiv:2309.16316v1 [astro-ph.SR])\nAbstract: Light curves of stars encapsulate a wealth of information about stellar oscillations and granulation, thereby offering key insights into the internal structure and evolutionary state of stars. Conventional asteroseismic techniques have been largely confined to power spectral analysis, neglecting the valuable phase information contained within light curves. While recent machine learning applications in asteroseismology utilizing Convolutional Neural Networks (CNNs) have successfully inferred stellar attributes from light curves, they are often limited by the local feature extraction inherent in convolutional operations. To circumvent these constraints, we present $\\textit{Astroconformer}$, a Transformer-based deep learning framework designed to capture long-range dependencies in stellar light curves. Our empirical analysis, which focuses on estimating surface gravity ($\\log g$), is grounded in a carefully curated dataset derived from $\\textit{Kepler}$ light curves. These light curves fe",
    "path": "papers/23/09/2309.16316.json",
    "total_tokens": 919,
    "translated_title": "Astroconformer：使用基于Transformer的深度学习模型分析恒星光曲线的前景",
    "translated_abstract": "恒星的光变曲线包含了丰富的关于恒星振荡和颗粒运动的信息，从而为我们提供了关于恒星内部结构和演化状态的重要洞见。传统的星震学技术主要依赖于功率谱分析，忽略了光变曲线中包含的宝贵的相位信息。虽然最近的机器学习应用在星震学中利用卷积神经网络（CNNs）从光变曲线中成功地推断出恒星属性，但往往受限于卷积操作中固有的局部特征提取。为了解决这些限制，我们提出了Astroconformer，这是一个基于Transformer的深度学习框架，旨在捕捉恒星光曲线中的长程依赖关系。我们的实证分析主要集中在估计表面重力（log g），并基于从Kepler光曲线中精心筛选得到的数据集进行。这些光曲线包含了大量恒星的观测数据。",
    "tldr": "Astroconformer是一个基于Transformer的深度学习框架，旨在从恒星光曲线中捕捉长程依赖关系。通过应用于Kepler光曲线数据集，实现了对恒星表面重力的准确估计。",
    "en_tdlr": "Astroconformer is a Transformer-based deep learning framework designed to capture long-range dependencies in stellar light curves. It accurately estimates surface gravity by applying to a carefully curated dataset derived from Kepler light curves."
}