{
    "title": "Audio-Based Classification of Respiratory Diseases using Advanced Signal Processing and Machine Learning for Assistive Diagnosis Support. (arXiv:2309.07183v1 [eess.SP])",
    "abstract": "In global healthcare, respiratory diseases are a leading cause of mortality, underscoring the need for rapid and accurate diagnostics. To advance rapid screening techniques via auscultation, our research focuses on employing one of the largest publicly available medical database of respiratory sounds to train multiple machine learning models able to classify different health conditions. Our method combines Empirical Mode Decomposition (EMD) and spectral analysis to extract physiologically relevant biosignals from acoustic data, closely tied to cardiovascular and respiratory patterns, making our approach apart in its departure from conventional audio feature extraction practices. We use Power Spectral Density analysis and filtering techniques to select Intrinsic Mode Functions (IMFs) strongly correlated with underlying physiological phenomena. These biosignals undergo a comprehensive feature extraction process for predictive modeling. Initially, we deploy a binary classification model t",
    "link": "http://arxiv.org/abs/2309.07183",
    "context": "Title: Audio-Based Classification of Respiratory Diseases using Advanced Signal Processing and Machine Learning for Assistive Diagnosis Support. (arXiv:2309.07183v1 [eess.SP])\nAbstract: In global healthcare, respiratory diseases are a leading cause of mortality, underscoring the need for rapid and accurate diagnostics. To advance rapid screening techniques via auscultation, our research focuses on employing one of the largest publicly available medical database of respiratory sounds to train multiple machine learning models able to classify different health conditions. Our method combines Empirical Mode Decomposition (EMD) and spectral analysis to extract physiologically relevant biosignals from acoustic data, closely tied to cardiovascular and respiratory patterns, making our approach apart in its departure from conventional audio feature extraction practices. We use Power Spectral Density analysis and filtering techniques to select Intrinsic Mode Functions (IMFs) strongly correlated with underlying physiological phenomena. These biosignals undergo a comprehensive feature extraction process for predictive modeling. Initially, we deploy a binary classification model t",
    "path": "papers/23/09/2309.07183.json",
    "total_tokens": 925,
    "translated_title": "基于高级信号处理和机器学习的声音相关呼吸疾病分类用于辅助诊断支持",
    "translated_abstract": "在全球医疗保健中，呼吸系统疾病是导致死亡的主要原因，这突显了迅速准确的诊断的需求。为了推进听诊的快速筛查技术，我们的研究侧重于利用其中一个最大的公开的呼吸音医学数据库来训练多种机器学习模型，能够对不同的健康状况进行分类。我们的方法结合了经验模态分解（EMD）和频谱分析，从声学数据中提取与心血管和呼吸模式密切相关的生理相关生物信号，使我们的方法与传统声学特征提取方法有所不同。我们使用功率谱密度分析和滤波技术来选择与潜在生理现象强相关的固有模态函数（IMFs）。这些生物信号经过全面的特征提取过程用于预测建模。首先，我们部署一个二分类模型",
    "tldr": "本研究利用声音数据训练多个机器学习模型来对呼吸疾病进行分类。方法采用经验模态分解和频谱分析来提取与心血管和呼吸模式相关的生理信号，并通过特征提取和预测建模实现快速筛查和诊断支持。"
}