{
    "title": "Investigating Online Financial Misinformation and Its Consequences: A Computational Perspective. (arXiv:2309.12363v1 [cs.CY])",
    "abstract": "The rapid dissemination of information through digital platforms has revolutionized the way we access and consume news and information, particularly in the realm of finance. However, this digital age has also given rise to an alarming proliferation of financial misinformation, which can have detrimental effects on individuals, markets, and the overall economy. This research paper aims to provide a comprehensive survey of online financial misinformation, including its types, sources, and impacts. We first discuss the characteristics and manifestations of financial misinformation, encompassing false claims and misleading content. We explore various case studies that illustrate the detrimental consequences of financial misinformation on the economy. Finally, we highlight the potential impact and implications of detecting financial misinformation. Early detection and mitigation strategies can help protect investors, enhance market transparency, and preserve financial stability. We emphasiz",
    "link": "http://arxiv.org/abs/2309.12363",
    "context": "Title: Investigating Online Financial Misinformation and Its Consequences: A Computational Perspective. (arXiv:2309.12363v1 [cs.CY])\nAbstract: The rapid dissemination of information through digital platforms has revolutionized the way we access and consume news and information, particularly in the realm of finance. However, this digital age has also given rise to an alarming proliferation of financial misinformation, which can have detrimental effects on individuals, markets, and the overall economy. This research paper aims to provide a comprehensive survey of online financial misinformation, including its types, sources, and impacts. We first discuss the characteristics and manifestations of financial misinformation, encompassing false claims and misleading content. We explore various case studies that illustrate the detrimental consequences of financial misinformation on the economy. Finally, we highlight the potential impact and implications of detecting financial misinformation. Early detection and mitigation strategies can help protect investors, enhance market transparency, and preserve financial stability. We emphasiz",
    "path": "papers/23/09/2309.12363.json",
    "total_tokens": 853,
    "translated_title": "调查在线财经错误信息及其后果：一种计算方法",
    "translated_abstract": "数字平台快速传播信息已经彻底改变了我们获取和消费新闻和信息的方式，尤其是在金融领域。然而，数字时代也催生了大量可怕的财经错误信息，这些信息对个人、市场和整体经济都会造成不利影响。这篇研究论文旨在全面调查在线财经错误信息，包括它们的类型、来源和影响。首先，我们讨论了财经错误信息的特征和表现，包括虚假声明和误导性内容。我们探索了一些案例研究，以说明财经错误信息对经济的有害后果。最后，我们强调了检测财经错误信息的潜在影响和意义。早期发现和缓解策略可以帮助保护投资者，增强市场透明度，维护金融稳定。",
    "tldr": "这篇论文调查了在线财经错误信息及其后果，包括错误信息的类型、来源和影响。研究强调了早期发现和缓解策略可能对保护投资者、增强市场透明度和维护金融稳定的意义。",
    "en_tdlr": "This paper investigates the online financial misinformation and its consequences, including the types, sources, and impacts of such misinformation. The research emphasizes the potential significance of early detection and mitigation strategies in protecting investors, enhancing market transparency, and preserving financial stability."
}