{
    "title": "MISFIT-V: Misaligned Image Synthesis and Fusion using Information from Thermal and Visual. (arXiv:2309.13216v1 [cs.CV])",
    "abstract": "Detecting humans from airborne visual and thermal imagery is a fundamental challenge for Wilderness Search-and-Rescue (WiSAR) teams, who must perform this function accurately in the face of immense pressure. The ability to fuse these two sensor modalities can potentially reduce the cognitive load on human operators and/or improve the effectiveness of computer vision object detection models. However, the fusion task is particularly challenging in the context of WiSAR due to hardware limitations and extreme environmental factors. This work presents Misaligned Image Synthesis and Fusion using Information from Thermal and Visual (MISFIT-V), a novel two-pronged unsupervised deep learning approach that utilizes a Generative Adversarial Network (GAN) and a cross-attention mechanism to capture the most relevant features from each modality. Experimental results show MISFIT-V offers enhanced robustness against misalignment and poor lighting/thermal environmental conditions compared to existing v",
    "link": "http://arxiv.org/abs/2309.13216",
    "context": "Title: MISFIT-V: Misaligned Image Synthesis and Fusion using Information from Thermal and Visual. (arXiv:2309.13216v1 [cs.CV])\nAbstract: Detecting humans from airborne visual and thermal imagery is a fundamental challenge for Wilderness Search-and-Rescue (WiSAR) teams, who must perform this function accurately in the face of immense pressure. The ability to fuse these two sensor modalities can potentially reduce the cognitive load on human operators and/or improve the effectiveness of computer vision object detection models. However, the fusion task is particularly challenging in the context of WiSAR due to hardware limitations and extreme environmental factors. This work presents Misaligned Image Synthesis and Fusion using Information from Thermal and Visual (MISFIT-V), a novel two-pronged unsupervised deep learning approach that utilizes a Generative Adversarial Network (GAN) and a cross-attention mechanism to capture the most relevant features from each modality. Experimental results show MISFIT-V offers enhanced robustness against misalignment and poor lighting/thermal environmental conditions compared to existing v",
    "path": "papers/23/09/2309.13216.json",
    "total_tokens": 877,
    "translated_title": "MISFIT-V: 利用来自热视觉和可见光的信息进行不匹配图像合成和融合",
    "translated_abstract": "对于野外搜救(WiSAR)团队来说，从空中可见光和热视觉图像中检测人体是一个基本挑战，他们必须在巨大压力下准确执行这个功能。融合这两种传感器模式的能力可能会减少人类操作员的认知负荷和/或提高计算机视觉目标检测模型的有效性。然而，在WiSAR环境中，由于硬件限制和极端的环境因素，融合任务尤其具有挑战性。该研究提出了Misaligned Image Synthesis and Fusion using Information from Thermal and Visual (MISFIT-V)，这是一种新颖的双通道无监督深度学习方法，利用生成对抗网络(GAN)和交叉注意力机制从每个模态中捕捉最相关的特征。实验结果显示，与现有方法相比，MISFIT-V在对不匹配和光照/热环境条件差的情况下具有更强的鲁棒性。",
    "tldr": "MISFIT-V 是一个使用来自热视觉和可见光信息的不匹配图像合成和融合的新方法，利用无监督深度学习和交叉注意力机制，提供了对不匹配和恶劣环境条件更强的鲁棒性。"
}