{
    "title": "LogGPT: Log Anomaly Detection via GPT. (arXiv:2309.14482v1 [cs.LG])",
    "abstract": "Detecting system anomalies based on log data is important for ensuring the security and reliability of computer systems. Recently, deep learning models have been widely used for log anomaly detection. The core idea is to model the log sequences as natural language and adopt deep sequential models, such as LSTM or Transformer, to encode the normal patterns in log sequences via language modeling. However, there is a gap between language modeling and anomaly detection as the objective of training a sequential model via a language modeling loss is not directly related to anomaly detection. To fill up the gap, we propose LogGPT, a novel framework that employs GPT for log anomaly detection. LogGPT is first trained to predict the next log entry based on the preceding sequence. To further enhance the performance of LogGPT, we propose a novel reinforcement learning strategy to finetune the model specifically for the log anomaly detection task. The experimental results on three datasets show tha",
    "link": "http://arxiv.org/abs/2309.14482",
    "context": "Title: LogGPT: Log Anomaly Detection via GPT. (arXiv:2309.14482v1 [cs.LG])\nAbstract: Detecting system anomalies based on log data is important for ensuring the security and reliability of computer systems. Recently, deep learning models have been widely used for log anomaly detection. The core idea is to model the log sequences as natural language and adopt deep sequential models, such as LSTM or Transformer, to encode the normal patterns in log sequences via language modeling. However, there is a gap between language modeling and anomaly detection as the objective of training a sequential model via a language modeling loss is not directly related to anomaly detection. To fill up the gap, we propose LogGPT, a novel framework that employs GPT for log anomaly detection. LogGPT is first trained to predict the next log entry based on the preceding sequence. To further enhance the performance of LogGPT, we propose a novel reinforcement learning strategy to finetune the model specifically for the log anomaly detection task. The experimental results on three datasets show tha",
    "path": "papers/23/09/2309.14482.json",
    "total_tokens": 861,
    "translated_title": "LogGPT：通过GPT进行日志异常检测",
    "translated_abstract": "基于日志数据的系统异常检测对于确保计算机系统的安全性和可靠性非常重要。近年来，深度学习模型已被广泛用于日志异常检测。核心思想是将日志序列建模为自然语言，并采用深度时序模型（如LSTM或Transformer）通过语言建模来编码日志序列中的正常模式。然而，语言建模与异常检测之间存在差距，因为通过语言建模损失训练时序模型的目标与异常检测不直接相关。为填补这一差距，我们提出了LogGPT，这是一个使用GPT进行日志异常检测的新框架。首先，我们训练LogGPT根据前序序列预测下一个日志条目。为了进一步提高LogGPT的性能，我们提出了一种新的强化学习策略，专门为日志异常检测任务微调模型。在三个数据集上的实验结果表明。",
    "tldr": "本论文提出了LogGPT，它是一个使用GPT进行日志异常检测的框架。通过语言建模和强化学习策略，LogGPT能够有效地检测系统日志中的异常情况。"
}