{
    "title": "Geometry-Informed Neural Operator for Large-Scale 3D PDEs. (arXiv:2309.00583v1 [cs.LG])",
    "abstract": "We propose the geometry-informed neural operator (GINO), a highly efficient approach to learning the solution operator of large-scale partial differential equations with varying geometries. GINO uses a signed distance function and point-cloud representations of the input shape and neural operators based on graph and Fourier architectures to learn the solution operator. The graph neural operator handles irregular grids and transforms them into and from regular latent grids on which Fourier neural operator can be efficiently applied. GINO is discretization-convergent, meaning the trained model can be applied to arbitrary discretization of the continuous domain and it converges to the continuum operator as the discretization is refined. To empirically validate the performance of our method on large-scale simulation, we generate the industry-standard aerodynamics dataset of 3D vehicle geometries with Reynolds numbers as high as five million. For this large-scale 3D fluid simulation, numeri",
    "link": "http://arxiv.org/abs/2309.00583",
    "context": "Title: Geometry-Informed Neural Operator for Large-Scale 3D PDEs. (arXiv:2309.00583v1 [cs.LG])\nAbstract: We propose the geometry-informed neural operator (GINO), a highly efficient approach to learning the solution operator of large-scale partial differential equations with varying geometries. GINO uses a signed distance function and point-cloud representations of the input shape and neural operators based on graph and Fourier architectures to learn the solution operator. The graph neural operator handles irregular grids and transforms them into and from regular latent grids on which Fourier neural operator can be efficiently applied. GINO is discretization-convergent, meaning the trained model can be applied to arbitrary discretization of the continuous domain and it converges to the continuum operator as the discretization is refined. To empirically validate the performance of our method on large-scale simulation, we generate the industry-standard aerodynamics dataset of 3D vehicle geometries with Reynolds numbers as high as five million. For this large-scale 3D fluid simulation, numeri",
    "path": "papers/23/09/2309.00583.json",
    "total_tokens": 860,
    "translated_title": "基于几何信息的神经算子用于大规模三维偏微分方程",
    "translated_abstract": "我们提出了一种基于几何信息的神经算子（GINO），它是一种高效的方法，用于学习具有不同几何形状的大规模偏微分方程的解算符。GINO使用符号距离函数和输入形状的点云表示，以及基于图和傅里叶结构的神经算子来学习解算符。图神经算子处理不规则网格，并将其转换成可以有效应用傅里叶神经算子的规则潜在网格。GINO是离散一致的，这意味着训练模型可以应用于连续域的任意离散化，并在离散化细化时收敛到连续算子。为了经验性地验证我们的方法在大规模模拟上的性能，我们生成了包含最高500万雷诺数的3D车辆几何行业标准空气动力学数据集。",
    "tldr": "我们提出了一种基于几何信息的神经算子（GINO），用于学习大规模偏微分方程的解算符。GINO使用符号距离函数和点云表示来处理不同几何形状，并通过图和傅里叶结构的神经算子实现离散一致性。在实验中，我们验证了GINO在大规模模拟中的性能。"
}