{
    "title": "VulnSense: Efficient Vulnerability Detection in Ethereum Smart Contracts by Multimodal Learning with Graph Neural Network and Language Model. (arXiv:2309.08474v1 [cs.CR])",
    "abstract": "This paper presents VulnSense framework, a comprehensive approach to efficiently detect vulnerabilities in Ethereum smart contracts using a multimodal learning approach on graph-based and natural language processing (NLP) models. Our proposed framework combines three types of features from smart contracts comprising source code, opcode sequences, and control flow graph (CFG) extracted from bytecode. We employ Bidirectional Encoder Representations from Transformers (BERT), Bidirectional Long Short-Term Memory (BiLSTM) and Graph Neural Network (GNN) models to extract and analyze these features. The final layer of our multimodal approach consists of a fully connected layer used to predict vulnerabilities in Ethereum smart contracts. Addressing limitations of existing vulnerability detection methods relying on single-feature or single-model deep learning techniques, our method surpasses accuracy and effectiveness constraints. We assess VulnSense using a collection of 1.769 smart contracts ",
    "link": "http://arxiv.org/abs/2309.08474",
    "context": "Title: VulnSense: Efficient Vulnerability Detection in Ethereum Smart Contracts by Multimodal Learning with Graph Neural Network and Language Model. (arXiv:2309.08474v1 [cs.CR])\nAbstract: This paper presents VulnSense framework, a comprehensive approach to efficiently detect vulnerabilities in Ethereum smart contracts using a multimodal learning approach on graph-based and natural language processing (NLP) models. Our proposed framework combines three types of features from smart contracts comprising source code, opcode sequences, and control flow graph (CFG) extracted from bytecode. We employ Bidirectional Encoder Representations from Transformers (BERT), Bidirectional Long Short-Term Memory (BiLSTM) and Graph Neural Network (GNN) models to extract and analyze these features. The final layer of our multimodal approach consists of a fully connected layer used to predict vulnerabilities in Ethereum smart contracts. Addressing limitations of existing vulnerability detection methods relying on single-feature or single-model deep learning techniques, our method surpasses accuracy and effectiveness constraints. We assess VulnSense using a collection of 1.769 smart contracts ",
    "path": "papers/23/09/2309.08474.json",
    "total_tokens": 914,
    "translated_title": "VulnSense: 基于图神经网络和语言模型的多模态学习在以太坊智能合约中的高效漏洞检测",
    "translated_abstract": "本文介绍了VulnSense框架，一个综合方法，通过基于图形和自然语言处理（NLP）模型的多模态学习方法，高效检测以太坊智能合约中的漏洞。我们的框架结合了智能合约中的源代码、操作码序列和从字节码中提取的控制流图（CFG）等三种类型的特征。我们采用双向编码器表示转换器（BERT）、双向长短期记忆（BiLSTM）和图神经网络（GNN）模型提取和分析这些特征。我们多模态方法的最后一层是一个全连接层，用于预测以太坊智能合约中的漏洞。我们的方法克服了现有漏洞检测方法仅依赖单一特征或单一模型深度学习技术的限制，提高了准确性和效果。我们使用1,769个智能合约集合对VulnSense进行评估。",
    "tldr": "VulnSense框架使用多模态学习方法，通过基于图形和语言模型的深度学习，高效检测以太坊智能合约中的漏洞。与现有方法相比，该框架在准确性和效果方面具有优势。",
    "en_tdlr": "VulnSense framework employs multimodal learning approach to efficiently detect vulnerabilities in Ethereum smart contracts using graph neural network and language model. It surpasses the limitations of existing methods and shows advantages in accuracy and effectiveness."
}