{
    "title": "Multi-Relational Contrastive Learning for Recommendation. (arXiv:2309.01103v2 [cs.IR] UPDATED)",
    "abstract": "Personalized recommender systems play a crucial role in capturing users' evolving preferences over time to provide accurate and effective recommendations on various online platforms. However, many recommendation models rely on a single type of behavior learning, which limits their ability to represent the complex relationships between users and items in real-life scenarios. In such situations, users interact with items in multiple ways, including clicking, tagging as favorite, reviewing, and purchasing. To address this issue, we propose the Relation-aware Contrastive Learning (RCL) framework, which effectively models dynamic interaction heterogeneity. The RCL model incorporates a multi-relational graph encoder that captures short-term preference heterogeneity while preserving the dedicated relation semantics for different types of user-item interactions. Moreover, we design a dynamic cross-relational memory network that enables the RCL model to capture users' long-term multi-behavior p",
    "link": "http://arxiv.org/abs/2309.01103",
    "context": "Title: Multi-Relational Contrastive Learning for Recommendation. (arXiv:2309.01103v2 [cs.IR] UPDATED)\nAbstract: Personalized recommender systems play a crucial role in capturing users' evolving preferences over time to provide accurate and effective recommendations on various online platforms. However, many recommendation models rely on a single type of behavior learning, which limits their ability to represent the complex relationships between users and items in real-life scenarios. In such situations, users interact with items in multiple ways, including clicking, tagging as favorite, reviewing, and purchasing. To address this issue, we propose the Relation-aware Contrastive Learning (RCL) framework, which effectively models dynamic interaction heterogeneity. The RCL model incorporates a multi-relational graph encoder that captures short-term preference heterogeneity while preserving the dedicated relation semantics for different types of user-item interactions. Moreover, we design a dynamic cross-relational memory network that enables the RCL model to capture users' long-term multi-behavior p",
    "path": "papers/23/09/2309.01103.json",
    "total_tokens": 905,
    "translated_title": "多关系对比学习用于推荐系统",
    "translated_abstract": "个性化推荐系统在捕捉用户随时间变化的偏好、提供准确有效的推荐方面起着至关重要的作用。然而，许多推荐模型只依赖于一种行为学习，这限制了它们在真实场景中表示用户和物品之间复杂关系的能力。在这种情况下，用户以多种方式与物品互动，包括点击、标记为喜爱、评论和购买。为了解决这个问题，我们提出了关系感知对比学习（RCL）框架，它有效地建模动态交互异质性。RCL模型包括一个多关系图编码器，捕捉短期偏好的异质性，同时保留不同类型用户-物品交互的专用关系语义。此外，我们设计了一个动态跨关系记忆网络，使RCL模型能够捕捉用户的长期多行为模式。",
    "tldr": "本论文介绍了一种多关系对比学习框架（RCL），用于解决个性化推荐系统中单一行为学习的限制。RCL模型通过多关系图编码器捕捉短期偏好的异质性，并使用动态跨关系记忆网络来捕捉用户的长期多行为模式。"
}