{
    "title": "Spanish Resource Grammar version 2023",
    "abstract": "arXiv:2309.13318v2 Announce Type: replace  Abstract: We present the latest version of the Spanish Resource Grammar (SRG), a grammar of Spanish implemented in the HPSG formalism. Such grammars encode a complex set of hypotheses about syntax making them a resource for empirical testing of linguistic theory. They also encode a strict notion of grammaticality which makes them a resource for natural language processing applications in computer-assisted language learning. This version of the SRG uses the recent version of the Freeling morphological analyzer and is released along with an automatically created, manually verified treebank of 2,291 sentences. We explain the treebanking process, emphasizing how it is different from treebanking with manual annotation and how it contributes to empirically-driven development of syntactic theory. The treebanks' high level of consistency and detail makes them a resource for training high-quality semantic parsers and generally systems that benefit from",
    "link": "https://arxiv.org/abs/2309.13318",
    "context": "Title: Spanish Resource Grammar version 2023\nAbstract: arXiv:2309.13318v2 Announce Type: replace  Abstract: We present the latest version of the Spanish Resource Grammar (SRG), a grammar of Spanish implemented in the HPSG formalism. Such grammars encode a complex set of hypotheses about syntax making them a resource for empirical testing of linguistic theory. They also encode a strict notion of grammaticality which makes them a resource for natural language processing applications in computer-assisted language learning. This version of the SRG uses the recent version of the Freeling morphological analyzer and is released along with an automatically created, manually verified treebank of 2,291 sentences. We explain the treebanking process, emphasizing how it is different from treebanking with manual annotation and how it contributes to empirically-driven development of syntactic theory. The treebanks' high level of consistency and detail makes them a resource for training high-quality semantic parsers and generally systems that benefit from",
    "path": "papers/23/09/2309.13318.json",
    "total_tokens": 844,
    "translated_title": "西班牙语资源语法2023版",
    "translated_abstract": "我们介绍了西班牙语资源语法（SRG）的最新版本，这是一个基于HPSG形式主义实现的西班牙语语法。这些语法编码了关于句法的复杂假设，使其成为语言学理论实证测试的资源。它们还编码了严格的语法性概念，使其成为计算辅助语言学习中自然语言处理应用的资源。这个SRG版本使用了最近的Freeling形态分析器版本，并且发布时附带了一个包含2,291个句子的自动生成的、经过手工验证的树库。我们解释了树库构建过程，强调了它与手动注释的树库构建之间的区别，以及它如何有助于基于经验证据的句法理论发展。树库高水平的一致性和细节使其成为训练高质量语义解析器以及一般受益于系统的资源。",
    "tldr": "西班牙语资源语法（SRG）的最新版本引入了Freeling形态分析器，并附带一个经过手工验证的树库，为提高语义解析器的训练质量和其他系统带来便利。",
    "en_tdlr": "The latest version of the Spanish Resource Grammar (SRG) introduces the Freeling morphological analyzer and comes with a manually verified treebank, serving as a resource for training high-quality semantic parsers and other systems."
}