{
    "title": "My Art My Choice: Adversarial Protection Against Unruly AI. (arXiv:2309.03198v1 [cs.CV])",
    "abstract": "Generative AI is on the rise, enabling everyone to produce realistic content via publicly available interfaces. Especially for guided image generation, diffusion models are changing the creator economy by producing high quality low cost content. In parallel, artists are rising against unruly AI, since their artwork are leveraged, distributed, and dissimulated by large generative models. Our approach, My Art My Choice (MAMC), aims to empower content owners by protecting their copyrighted materials from being utilized by diffusion models in an adversarial fashion. MAMC learns to generate adversarially perturbed \"protected\" versions of images which can in turn \"break\" diffusion models. The perturbation amount is decided by the artist to balance distortion vs. protection of the content. MAMC is designed with a simple UNet-based generator, attacking black box diffusion models, combining several losses to create adversarial twins of the original artwork. We experiment on three datasets for v",
    "link": "http://arxiv.org/abs/2309.03198",
    "context": "Title: My Art My Choice: Adversarial Protection Against Unruly AI. (arXiv:2309.03198v1 [cs.CV])\nAbstract: Generative AI is on the rise, enabling everyone to produce realistic content via publicly available interfaces. Especially for guided image generation, diffusion models are changing the creator economy by producing high quality low cost content. In parallel, artists are rising against unruly AI, since their artwork are leveraged, distributed, and dissimulated by large generative models. Our approach, My Art My Choice (MAMC), aims to empower content owners by protecting their copyrighted materials from being utilized by diffusion models in an adversarial fashion. MAMC learns to generate adversarially perturbed \"protected\" versions of images which can in turn \"break\" diffusion models. The perturbation amount is decided by the artist to balance distortion vs. protection of the content. MAMC is designed with a simple UNet-based generator, attacking black box diffusion models, combining several losses to create adversarial twins of the original artwork. We experiment on three datasets for v",
    "path": "papers/23/09/2309.03198.json",
    "total_tokens": 974,
    "translated_title": "我的艺术我的选择：对抗不守规矩的人工智能的保护",
    "translated_abstract": "生成式人工智能的崛起使得每个人都能通过公开可用的接口产生逼真的内容。特别是对于引导式图像生成，扩散模型通过产生高质量低成本的内容改变了创作者经济。与此同时，艺术家们正在对抗不守规矩的人工智能，因为他们的作品被大型生成模型利用、分发和伪装。我们的方法\"我是我艺术的选择\"（MAMC）旨在通过对抗手段保护版权材料，使内容所有者能够获得更多权力。MAMC学习生成对抗性扰动后的\"受保护\"版本的图像，从而\"破解\"扩散模型。扰动量由艺术家决定，以平衡内容的失真和保护。MAMC采用基于UNet的简单生成器，攻击黑盒扩散模型，结合多个损失函数创建原始艺术作品的对抗性双胞胎。我们在三个数据集上进行实验。",
    "tldr": "该论文提出了一种名为\"我是我艺术的选择\"（MAMC）的方法，旨在通过对抗手段保护艺术作品的版权，该方法通过生成对抗性扰动后的图像来\"破解\"扩散模型的功能。这种方法可以平衡内容的失真和保护，并且可以攻击黑盒扩散模型。"
}