{
    "title": "Minimal Effective Theory for Phonotactic Memory: Capturing Local Correlations due to Errors in Speech. (arXiv:2309.02466v1 [eess.AS])",
    "abstract": "Spoken language evolves constrained by the economy of speech, which depends on factors such as the structure of the human mouth. This gives rise to local phonetic correlations in spoken words. Here we demonstrate that these local correlations facilitate the learning of spoken words by reducing their information content. We do this by constructing a locally-connected tensor-network model, inspired by similar variational models used for many-body physics, which exploits these local phonetic correlations to facilitate the learning of spoken words. The model is therefore a minimal model of phonetic memory, where \"learning to pronounce\" and \"learning a word\" are one and the same. A consequence of which is the learned ability to produce new words which are phonetically reasonable for the target language; as well as providing a hierarchy of the most likely errors that could be produced during the action of speech. We test our model against Latin and Turkish words. (The code is available on Gi",
    "link": "http://arxiv.org/abs/2309.02466",
    "context": "Title: Minimal Effective Theory for Phonotactic Memory: Capturing Local Correlations due to Errors in Speech. (arXiv:2309.02466v1 [eess.AS])\nAbstract: Spoken language evolves constrained by the economy of speech, which depends on factors such as the structure of the human mouth. This gives rise to local phonetic correlations in spoken words. Here we demonstrate that these local correlations facilitate the learning of spoken words by reducing their information content. We do this by constructing a locally-connected tensor-network model, inspired by similar variational models used for many-body physics, which exploits these local phonetic correlations to facilitate the learning of spoken words. The model is therefore a minimal model of phonetic memory, where \"learning to pronounce\" and \"learning a word\" are one and the same. A consequence of which is the learned ability to produce new words which are phonetically reasonable for the target language; as well as providing a hierarchy of the most likely errors that could be produced during the action of speech. We test our model against Latin and Turkish words. (The code is available on Gi",
    "path": "papers/23/09/2309.02466.json",
    "total_tokens": 892,
    "translated_title": "语音规则记忆的最小有效理论：捕捉由语音错误引起的局部关联",
    "translated_abstract": "口语语言的演化受限于语音经济性，这取决于人类口腔的结构等因素。这导致了口语单词中的局部语音相关性。我们在这里通过构建一个局部连接的张量网络模型来证明，这些局部关联通过减少口语单词的信息内容来促进口语单词的学习。该模型受到了许多体物理学中使用的类似变分模型的启发，利用这些局部语音相关性来促进口语单词的学习。因此，该模型是语音记忆的最小模型，\"学习发音\"和\"学习一个单词\"是同一回事。其结果是，学会产生对目标语言来说在语音上合理的新单词；并且提供了在语音操作过程中可能产生的最有可能的错误的层次结构。我们对拉丁语和土耳其语单词进行了模型测试。（代码可在Gi上找到）",
    "tldr": "这是一个关于语音规则记忆的最小有效理论的研究，通过构建一个局部连接的张量网络模型，利用局部语音相关性来促进口语单词的学习，并提供了可能产生的错误的层次结构。",
    "en_tdlr": "This study presents a minimal effective theory for phonotactic memory, which utilizes local phonetic correlations to facilitate the learning of spoken words. The model also provides a hierarchy of likely errors that could occur during speech production."
}