{
    "title": "XFedHunter: An Explainable Federated Learning Framework for Advanced Persistent Threat Detection in SDN. (arXiv:2309.08485v1 [cs.CR])",
    "abstract": "Advanced Persistent Threat (APT) attacks are highly sophisticated and employ a multitude of advanced methods and techniques to target organizations and steal sensitive and confidential information. APT attacks consist of multiple stages and have a defined strategy, utilizing new and innovative techniques and technologies developed by hackers to evade security software monitoring. To effectively protect against APTs, detecting and predicting APT indicators with an explanation from Machine Learning (ML) prediction is crucial to reveal the characteristics of attackers lurking in the network system. Meanwhile, Federated Learning (FL) has emerged as a promising approach for building intelligent applications without compromising privacy. This is particularly important in cybersecurity, where sensitive data and high-quality labeling play a critical role in constructing effective machine learning models for detecting cyber threats. Therefore, this work proposes XFedHunter, an explainable feder",
    "link": "http://arxiv.org/abs/2309.08485",
    "context": "Title: XFedHunter: An Explainable Federated Learning Framework for Advanced Persistent Threat Detection in SDN. (arXiv:2309.08485v1 [cs.CR])\nAbstract: Advanced Persistent Threat (APT) attacks are highly sophisticated and employ a multitude of advanced methods and techniques to target organizations and steal sensitive and confidential information. APT attacks consist of multiple stages and have a defined strategy, utilizing new and innovative techniques and technologies developed by hackers to evade security software monitoring. To effectively protect against APTs, detecting and predicting APT indicators with an explanation from Machine Learning (ML) prediction is crucial to reveal the characteristics of attackers lurking in the network system. Meanwhile, Federated Learning (FL) has emerged as a promising approach for building intelligent applications without compromising privacy. This is particularly important in cybersecurity, where sensitive data and high-quality labeling play a critical role in constructing effective machine learning models for detecting cyber threats. Therefore, this work proposes XFedHunter, an explainable feder",
    "path": "papers/23/09/2309.08485.json",
    "total_tokens": 871,
    "translated_title": "XFedHunter: 一种用于SDN中持久性高级威胁检测的可解释联邦学习框架",
    "translated_abstract": "高级持久性威胁（APT）攻击是非常复杂的，采用了多种先进方法和技术，以针对组织并窃取敏感和机密信息。APT攻击包括多个阶段和一个明确定义的策略，利用黑客开发的新的创新技术和技术来规避安全软件监控。为了有效防护APT，通过机器学习（ML）预测的解释来检测和预测APT指标对于揭示潜伏在网络系统中的攻击者的特征至关重要。同时，联邦学习（FL）已经成为一种在不损害隐私的情况下构建智能应用的有希望的方法。在网络安全领域，敏感数据和高质量标签对于构建有效的机器学习模型来检测网络威胁起着关键作用。因此，本研究提出了一种名为XFedHunter的可解释联邦学习框架。",
    "tldr": "XFedHunter是一种用于SDN中检测持久性高级威胁的可解释联邦学习框架，能够通过ML预测的解释来揭示攻击者的特征。"
}