{
    "title": "Data-driven Preference Learning Methods for Multiple Criteria Sorting with Temporal Criteria. (arXiv:2309.12620v1 [cs.LG])",
    "abstract": "The advent of predictive methodologies has catalyzed the emergence of data-driven decision support across various domains. However, developing models capable of effectively handling input time series data presents an enduring challenge. This study presents novel preference learning approaches to multiple criteria sorting problems in the presence of temporal criteria. We first formulate a convex quadratic programming model characterized by fixed time discount factors, operating within a regularization framework. Additionally, we propose an ensemble learning algorithm designed to consolidate the outputs of multiple, potentially weaker, optimizers, a process executed efficiently through parallel computation. To enhance scalability and accommodate learnable time discount factors, we introduce a novel monotonic Recurrent Neural Network (mRNN). It is designed to capture the evolving dynamics of preferences over time while upholding critical properties inherent to MCS problems, including crit",
    "link": "http://arxiv.org/abs/2309.12620",
    "context": "Title: Data-driven Preference Learning Methods for Multiple Criteria Sorting with Temporal Criteria. (arXiv:2309.12620v1 [cs.LG])\nAbstract: The advent of predictive methodologies has catalyzed the emergence of data-driven decision support across various domains. However, developing models capable of effectively handling input time series data presents an enduring challenge. This study presents novel preference learning approaches to multiple criteria sorting problems in the presence of temporal criteria. We first formulate a convex quadratic programming model characterized by fixed time discount factors, operating within a regularization framework. Additionally, we propose an ensemble learning algorithm designed to consolidate the outputs of multiple, potentially weaker, optimizers, a process executed efficiently through parallel computation. To enhance scalability and accommodate learnable time discount factors, we introduce a novel monotonic Recurrent Neural Network (mRNN). It is designed to capture the evolving dynamics of preferences over time while upholding critical properties inherent to MCS problems, including crit",
    "path": "papers/23/09/2309.12620.json",
    "total_tokens": 1016,
    "translated_title": "基于数据驱动的多准则排序模型在时间准则下的应用研究",
    "translated_abstract": "预测方法的出现促进了数据驱动的决策支持方法在各个领域中的应用。然而，开发能够有效处理时间序列数据的模型仍然是一个长期的挑战。本研究提出了一种新颖的基于偏好学习的方法，用于解决存在时间准则的多准则排序问题。我们首先提出了一个凸二次规划模型，该模型具有固定时间折扣因子，并在正则化框架内运行。此外，我们提出了一种集成学习算法，旨在合并多个可能较弱的优化器的输出，通过并行计算高效执行此过程。为了提高可扩展性并适应可学习的时间折扣因子，我们引入了一种新颖的单调循环神经网络(mRNN)。它旨在捕捉随时间演化的偏好动态，同时保持多准则排序问题固有的关键属性，包括准则的顺序性。",
    "tldr": "本研究提出了一种新的基于偏好学习的方法，用于解决存在时间准则的多准则排序问题。首先，提出了一个凸二次规划模型，并引入正则化框架。其次，设计了一种集成学习算法，用于合并多个优化器的输出。为了提高可扩展性和适应可学习的时间折扣因子，引入了一种新颖的单调循环神经网络(mRNN)。这些方法有效地处理了时间序列数据，并保持了多准则排序问题的关键属性。",
    "en_tdlr": "This study proposes novel preference learning methods for handling multiple criteria sorting problems with temporal criteria. It introduces a convex quadratic programming model and a regularization framework, as well as an ensemble learning algorithm to consolidate outputs from multiple optimizers. A monotonic Recurrent Neural Network (mRNN) is also introduced to enhance scalability and accommodate learnable time discount factors. These methods effectively handle time series data and preserve the critical properties of multiple criteria sorting problems."
}