{
    "title": "Fast and Accurate Deep Loop Closing and Relocalization for Reliable LiDAR SLAM. (arXiv:2309.08086v1 [cs.RO])",
    "abstract": "Loop closing and relocalization are crucial techniques to establish reliable and robust long-term SLAM by addressing pose estimation drift and degeneration. This article begins by formulating loop closing and relocalization within a unified framework. Then, we propose a novel multi-head network LCR-Net to tackle both tasks effectively. It exploits novel feature extraction and pose-aware attention mechanism to precisely estimate similarities and 6-DoF poses between pairs of LiDAR scans. In the end, we integrate our LCR-Net into a SLAM system and achieve robust and accurate online LiDAR SLAM in outdoor driving environments. We thoroughly evaluate our LCR-Net through three setups derived from loop closing and relocalization, including candidate retrieval, closed-loop point cloud registration, and continuous relocalization using multiple datasets. The results demonstrate that LCR-Net excels in all three tasks, surpassing the state-of-the-art methods and exhibiting a remarkable generalizati",
    "link": "http://arxiv.org/abs/2309.08086",
    "context": "Title: Fast and Accurate Deep Loop Closing and Relocalization for Reliable LiDAR SLAM. (arXiv:2309.08086v1 [cs.RO])\nAbstract: Loop closing and relocalization are crucial techniques to establish reliable and robust long-term SLAM by addressing pose estimation drift and degeneration. This article begins by formulating loop closing and relocalization within a unified framework. Then, we propose a novel multi-head network LCR-Net to tackle both tasks effectively. It exploits novel feature extraction and pose-aware attention mechanism to precisely estimate similarities and 6-DoF poses between pairs of LiDAR scans. In the end, we integrate our LCR-Net into a SLAM system and achieve robust and accurate online LiDAR SLAM in outdoor driving environments. We thoroughly evaluate our LCR-Net through three setups derived from loop closing and relocalization, including candidate retrieval, closed-loop point cloud registration, and continuous relocalization using multiple datasets. The results demonstrate that LCR-Net excels in all three tasks, surpassing the state-of-the-art methods and exhibiting a remarkable generalizati",
    "path": "papers/23/09/2309.08086.json",
    "total_tokens": 996,
    "translated_title": "快速准确的深度循环关闭和位置再定位以实现可靠的LiDAR SLAM",
    "translated_abstract": "循环关闭和位置再定位是建立可靠和稳定的长期SLAM的关键技术，用于解决姿态估计漂移和退化问题。本文首先在一个统一的框架下表述了循环关闭和位置再定位。然后，我们提出了一种新颖的多头网络LCR-Net来有效地处理这两个任务。它利用了新颖的特征提取和姿态感知机制来精确估计LiDAR扫描对之间的相似性和6自由度姿态。最后，我们将LCR-Net整合到一个SLAM系统中，在室外驾驶环境中实现了稳健准确的在线LiDAR SLAM。我们通过三种从循环关闭和位置再定位得出的设置，包括候选检索、闭环点云配准和多数据集的连续再定位，对LCR-Net进行了全面评估。结果表明，LCR-Net在这三个任务中表现出色，超过了当前最先进的方法，并展示了出色的泛化能力。",
    "tldr": "本文提出了一个名为LCR-Net的多头网络，利用新颖的特征提取和姿态感知机制来快速准确地处理循环关闭和位置再定位任务。实验结果表明，LCR-Net在候选检索、闭环点云配准和多数据集连续再定位等任务中表现优异，超过了当前最先进的方法，并具有出色的泛化能力。",
    "en_tdlr": "This paper proposes a multi-head network called LCR-Net, which effectively handles loop closing and relocalization tasks using novel feature extraction and pose-aware mechanism. Experimental results demonstrate that LCR-Net outperforms state-of-the-art methods and exhibits remarkable generalization in tasks such as candidate retrieval, closed-loop point cloud registration, and continuous relocalization with multiple datasets."
}