{
    "title": "CARE: Large Precision Matrix Estimation for Compositional Data. (arXiv:2309.06985v1 [stat.ME])",
    "abstract": "High-dimensional compositional data are prevalent in many applications. The simplex constraint poses intrinsic challenges to inferring the conditional dependence relationships among the components forming a composition, as encoded by a large precision matrix. We introduce a precise specification of the compositional precision matrix and relate it to its basis counterpart, which is shown to be asymptotically identifiable under suitable sparsity assumptions. By exploiting this connection, we propose a composition adaptive regularized estimation (CARE) method for estimating the sparse basis precision matrix. We derive rates of convergence for the estimator and provide theoretical guarantees on support recovery and data-driven parameter tuning. Our theory reveals an intriguing trade-off between identification and estimation, thereby highlighting the blessing of dimensionality in compositional data analysis. In particular, in sufficiently high dimensions, the CARE estimator achieves minimax",
    "link": "http://arxiv.org/abs/2309.06985",
    "context": "Title: CARE: Large Precision Matrix Estimation for Compositional Data. (arXiv:2309.06985v1 [stat.ME])\nAbstract: High-dimensional compositional data are prevalent in many applications. The simplex constraint poses intrinsic challenges to inferring the conditional dependence relationships among the components forming a composition, as encoded by a large precision matrix. We introduce a precise specification of the compositional precision matrix and relate it to its basis counterpart, which is shown to be asymptotically identifiable under suitable sparsity assumptions. By exploiting this connection, we propose a composition adaptive regularized estimation (CARE) method for estimating the sparse basis precision matrix. We derive rates of convergence for the estimator and provide theoretical guarantees on support recovery and data-driven parameter tuning. Our theory reveals an intriguing trade-off between identification and estimation, thereby highlighting the blessing of dimensionality in compositional data analysis. In particular, in sufficiently high dimensions, the CARE estimator achieves minimax",
    "path": "papers/23/09/2309.06985.json",
    "total_tokens": 916,
    "translated_title": "CARE: 大规模精确矩阵估计用于组成数据",
    "translated_abstract": "高维组成数据在许多应用中很常见。简单形式的约束对于推断组成数据中的条件依赖关系，即大规模精确矩阵所编码的组分之间的关系，带来了固有的挑战。我们引入了组成精确矩阵的精确定义，并将其与其基础对应物联系起来，在适当的稀疏性假设下得到渐近可辨认性。通过利用这种联系，我们提出了一种适合估计稀疏基础精确矩阵的组成适应正则化估计（CARE）方法。我们推导了估计器的收敛速率，并提供了关于支持恢复和数据驱动参数调整的理论保证。我们的理论揭示了鉴定和估计之间的有趣权衡，从而突显了维度在组成数据分析中的优势。特别地，在足够高的维度下，CARE估计器实现了极小化风险的速率。",
    "tldr": "CARE方法通过精确指定组成数据的精确矩阵，并利用其与基础矩阵之间的联系，提出了一种估计稀疏基础矩阵的组成数据估计方法。通过理论分析，我们发现在足够高的维度下，CARE估计器实现了极小化风险的速率。",
    "en_tdlr": "The CARE method introduces a precise specification of the compositional precision matrix and proposes a composition adaptive regularized estimation method for estimating the sparse basis precision matrix. Theoretical analysis reveals that the CARE estimator achieves minimax risk rates in sufficiently high dimensions."
}