{
    "title": "Pre-trained Neural Recommenders: A Transferable Zero-Shot Framework for Recommendation Systems. (arXiv:2309.01188v2 [cs.IR] UPDATED)",
    "abstract": "Modern neural collaborative filtering techniques are critical to the success of e-commerce, social media, and content-sharing platforms. However, despite technical advances -- for every new application domain, we need to train an NCF model from scratch. In contrast, pre-trained vision and language models are routinely applied to diverse applications directly (zero-shot) or with limited fine-tuning. Inspired by the impact of pre-trained models, we explore the possibility of pre-trained recommender models that support building recommender systems in new domains, with minimal or no retraining, without the use of any auxiliary user or item information. Zero-shot recommendation without auxiliary information is challenging because we cannot form associations between users and items across datasets when there are no overlapping users or items. Our fundamental insight is that the statistical characteristics of the user-item interaction matrix are universally available across different domains ",
    "link": "http://arxiv.org/abs/2309.01188",
    "context": "Title: Pre-trained Neural Recommenders: A Transferable Zero-Shot Framework for Recommendation Systems. (arXiv:2309.01188v2 [cs.IR] UPDATED)\nAbstract: Modern neural collaborative filtering techniques are critical to the success of e-commerce, social media, and content-sharing platforms. However, despite technical advances -- for every new application domain, we need to train an NCF model from scratch. In contrast, pre-trained vision and language models are routinely applied to diverse applications directly (zero-shot) or with limited fine-tuning. Inspired by the impact of pre-trained models, we explore the possibility of pre-trained recommender models that support building recommender systems in new domains, with minimal or no retraining, without the use of any auxiliary user or item information. Zero-shot recommendation without auxiliary information is challenging because we cannot form associations between users and items across datasets when there are no overlapping users or items. Our fundamental insight is that the statistical characteristics of the user-item interaction matrix are universally available across different domains ",
    "path": "papers/23/09/2309.01188.json",
    "total_tokens": 879,
    "translated_title": "预训练的神经推荐系统：一种可迁移的零样本框架",
    "translated_abstract": "现代神经协同过滤技术对于电子商务、社交媒体和内容共享平台的成功至关重要。然而，尽管技术有所进步，但对于每个新的应用领域，我们仍需要从头开始训练一个NCF模型。相反，预训练的视觉和语言模型通常直接应用于各种应用程序，要么是零样本情况，要么是有限的微调。受到预训练模型的影响，我们探索了在新领域中支持构建推荐系统的预训练模型的可能性，只需最少或不需要重新训练，而无需使用任何辅助用户或项目信息。零样本推荐在没有辅助信息的情况下是具有挑战性的，因为当没有重叠的用户或项目时，我们无法在数据集之间建立用户和项目之间的关联。我们的基本见解是用户-项目交互矩阵的统计特征在不同领域中普遍可用。",
    "tldr": "本论文提出了一种预训练的神经推荐系统框架，可以在新领域中构建推荐系统，减少或无需重新训练，并且不需要使用任何辅助信息。通过利用用户-项目交互矩阵的统计特征，实现了零样本推荐的挑战。"
}