{
    "title": "LEAP Hand: Low-Cost, Efficient, and Anthropomorphic Hand for Robot Learning. (arXiv:2309.06440v1 [cs.RO])",
    "abstract": "Dexterous manipulation has been a long-standing challenge in robotics. While machine learning techniques have shown some promise, results have largely been currently limited to simulation. This can be mostly attributed to the lack of suitable hardware. In this paper, we present LEAP Hand, a low-cost dexterous and anthropomorphic hand for machine learning research. In contrast to previous hands, LEAP Hand has a novel kinematic structure that allows maximal dexterity regardless of finger pose. LEAP Hand is low-cost and can be assembled in 4 hours at a cost of 2000 USD from readily available parts. It is capable of consistently exerting large torques over long durations of time. We show that LEAP Hand can be used to perform several manipulation tasks in the real world -- from visual teleoperation to learning from passive video data and sim2real. LEAP Hand significantly outperforms its closest competitor Allegro Hand in all our experiments while being 1/8th of the cost. We release detailed",
    "link": "http://arxiv.org/abs/2309.06440",
    "context": "Title: LEAP Hand: Low-Cost, Efficient, and Anthropomorphic Hand for Robot Learning. (arXiv:2309.06440v1 [cs.RO])\nAbstract: Dexterous manipulation has been a long-standing challenge in robotics. While machine learning techniques have shown some promise, results have largely been currently limited to simulation. This can be mostly attributed to the lack of suitable hardware. In this paper, we present LEAP Hand, a low-cost dexterous and anthropomorphic hand for machine learning research. In contrast to previous hands, LEAP Hand has a novel kinematic structure that allows maximal dexterity regardless of finger pose. LEAP Hand is low-cost and can be assembled in 4 hours at a cost of 2000 USD from readily available parts. It is capable of consistently exerting large torques over long durations of time. We show that LEAP Hand can be used to perform several manipulation tasks in the real world -- from visual teleoperation to learning from passive video data and sim2real. LEAP Hand significantly outperforms its closest competitor Allegro Hand in all our experiments while being 1/8th of the cost. We release detailed",
    "path": "papers/23/09/2309.06440.json",
    "total_tokens": 922,
    "translated_title": "LEAP Hand: 低成本、高效和拟人化机器学习手",
    "translated_abstract": "在机器人学中，灵巧操控一直是一个长期存在的挑战。虽然机器学习技术在这方面显示出一些希望，但结果主要限于模拟。这主要归因于缺乏适当的硬件。在本文中，我们提出了LEAP Hand，这是一种低成本的灵巧和拟人化机器学习手。与以往的手相比，LEAP Hand具有一种新颖的运动结构，无论手指的姿势如何都可以实现最大的灵活性。LEAP Hand成本低廉，并且可以在4个小时内使用现有零件组装而成，成本为2000美元。它能够持续长时间地施加大扭矩。我们展示了LEAP Hand可以在真实世界中执行多个操作任务，从视觉远程操作到从被动视频数据和模拟到真实世界的学习。LEAP Hand在所有实验中都明显优于最接近的竞争对手Allegro Hand，同时成本只有其1/8。我们公开了详细的设计和组装说明，以便其他研究人员可以重复我们的工作。",
    "tldr": "LEAP Hand是一种低成本、高效且拟人化的机器学习手。其新颖的运动结构可以实现最大的灵活性，其成本为其他竞争对手的1/8。LEAP Hand在现实世界中执行多个操作任务，并在所有实验中表现出色。"
}