{
    "title": "Multi-Label Noise Transition Matrix Estimation with Label Correlations: Theory and Algorithm. (arXiv:2309.12706v1 [cs.LG])",
    "abstract": "Noisy multi-label learning has garnered increasing attention due to the challenges posed by collecting large-scale accurate labels, making noisy labels a more practical alternative. Motivated by noisy multi-class learning, the introduction of transition matrices can help model multi-label noise and enable the development of statistically consistent algorithms for noisy multi-label learning. However, estimating multi-label noise transition matrices remains a challenging task, as most existing estimators in noisy multi-class learning rely on anchor points and accurate fitting of noisy class posteriors, which is hard to satisfy in noisy multi-label learning. In this paper, we address this problem by first investigating the identifiability of class-dependent transition matrices in noisy multi-label learning. Building upon the identifiability results, we propose a novel estimator that leverages label correlations without the need for anchor points or precise fitting of noisy class posterior",
    "link": "http://arxiv.org/abs/2309.12706",
    "context": "Title: Multi-Label Noise Transition Matrix Estimation with Label Correlations: Theory and Algorithm. (arXiv:2309.12706v1 [cs.LG])\nAbstract: Noisy multi-label learning has garnered increasing attention due to the challenges posed by collecting large-scale accurate labels, making noisy labels a more practical alternative. Motivated by noisy multi-class learning, the introduction of transition matrices can help model multi-label noise and enable the development of statistically consistent algorithms for noisy multi-label learning. However, estimating multi-label noise transition matrices remains a challenging task, as most existing estimators in noisy multi-class learning rely on anchor points and accurate fitting of noisy class posteriors, which is hard to satisfy in noisy multi-label learning. In this paper, we address this problem by first investigating the identifiability of class-dependent transition matrices in noisy multi-label learning. Building upon the identifiability results, we propose a novel estimator that leverages label correlations without the need for anchor points or precise fitting of noisy class posterior",
    "path": "papers/23/09/2309.12706.json",
    "total_tokens": 934,
    "translated_title": "多标签噪声转移矩阵估计与标签相关性：理论与算法",
    "translated_abstract": "由于收集大规模准确标签的挑战，噪声多标签学习引起了越来越多的关注，使得噪声标签成为更实际的选择。受到噪声多类别学习的启发，引入转移矩阵可以帮助建模多标签噪声，并实现对噪声多标签学习的统计一致性算法的开发。然而，估计多标签噪声转移矩阵仍然是一个具有挑战性的任务，因为在噪声多类别学习中的大多数现有估计器依赖于锚点和准确拟合噪声类后验概率，而在噪声多标签学习中很难满足这些条件。在本文中，我们首先研究了在噪声多标签学习中基于类别的转移矩阵的可辨识性。在可辨识性结果的基础上，我们提出了一种新的估计器，可以利用标签相关性，而无需锚点或精确拟合噪声类后验概率。",
    "tldr": "本论文提出了一种解决多标签噪声转移矩阵估计问题的方法，通过研究可辨识性，并结合标签相关性，提出了一种新的估计器，可以在噪声多标签学习中实现统计一致性算法。",
    "en_tdlr": "This paper proposes a method to address the problem of estimating multi-label noise transition matrices. By investigating identifiability and leveraging label correlations, a novel estimator is introduced to achieve statistically consistent algorithms for noisy multi-label learning."
}