{
    "title": "Leveraging Large Language Models and Weak Supervision for Social Media data annotation: an evaluation using COVID-19 self-reported vaccination tweets. (arXiv:2309.06503v1 [cs.CL])",
    "abstract": "The COVID-19 pandemic has presented significant challenges to the healthcare industry and society as a whole. With the rapid development of COVID-19 vaccines, social media platforms have become a popular medium for discussions on vaccine-related topics. Identifying vaccine-related tweets and analyzing them can provide valuable insights for public health research-ers and policymakers. However, manual annotation of a large number of tweets is time-consuming and expensive. In this study, we evaluate the usage of Large Language Models, in this case GPT-4 (March 23 version), and weak supervision, to identify COVID-19 vaccine-related tweets, with the purpose of comparing performance against human annotators. We leveraged a manu-ally curated gold-standard dataset and used GPT-4 to provide labels without any additional fine-tuning or instructing, in a single-shot mode (no additional prompting).",
    "link": "http://arxiv.org/abs/2309.06503",
    "context": "Title: Leveraging Large Language Models and Weak Supervision for Social Media data annotation: an evaluation using COVID-19 self-reported vaccination tweets. (arXiv:2309.06503v1 [cs.CL])\nAbstract: The COVID-19 pandemic has presented significant challenges to the healthcare industry and society as a whole. With the rapid development of COVID-19 vaccines, social media platforms have become a popular medium for discussions on vaccine-related topics. Identifying vaccine-related tweets and analyzing them can provide valuable insights for public health research-ers and policymakers. However, manual annotation of a large number of tweets is time-consuming and expensive. In this study, we evaluate the usage of Large Language Models, in this case GPT-4 (March 23 version), and weak supervision, to identify COVID-19 vaccine-related tweets, with the purpose of comparing performance against human annotators. We leveraged a manu-ally curated gold-standard dataset and used GPT-4 to provide labels without any additional fine-tuning or instructing, in a single-shot mode (no additional prompting).",
    "path": "papers/23/09/2309.06503.json",
    "total_tokens": 912,
    "translated_title": "利用大型语言模型和弱监督对社交媒体数据进行注释:以COVID-19自我报告的疫苗推文为例",
    "translated_abstract": "COVID-19大流行给医疗行业和整个社会带来了重大挑战。随着COVID-19疫苗的快速发展，社交媒体平台已成为讨论疫苗相关话题的热门媒介。识别疫苗相关推文并进行分析可以为公共卫生研究人员和政策制定者提供宝贵的见解。然而，手动注释大量推文耗时且昂贵。在这项研究中，我们评估了使用大型语言模型，本例中为GPT-4（3月23日版本），和弱监督来识别COVID-19疫苗相关推文，目的是与人工注释员的性能进行比较。我们利用了一个手动策划的黄金标准数据集，并使用GPT-4在单次模式下（无需额外提示）提供标签，而无需任何额外的微调或指示。",
    "tldr": "本研究评估了使用大型语言模型和弱监督方法，通过GPT-4模型在单次模式下提供标签的方式，来识别COVID-19疫苗相关推文，并与人工注释员的性能进行比较。",
    "en_tdlr": "This study evaluates the usage of large language models and weak supervision, specifically GPT-4, in identifying COVID-19 vaccine-related tweets. The study compares the performance of GPT-4 labels against human annotators, showcasing the potential of leveraging these methods for efficient and cost-effective annotation of social media data."
}