{
    "title": "Solving Satisfiability Modulo Counting for Symbolic and Statistical AI Integration With Provable Guarantees. (arXiv:2309.08883v1 [cs.AI])",
    "abstract": "Satisfiability Modulo Counting (SMC) encompasses problems that require both symbolic decision-making and statistical reasoning. Its general formulation captures many real-world problems at the intersection of symbolic and statistical Artificial Intelligence. SMC searches for policy interventions to control probabilistic outcomes. Solving SMC is challenging because of its highly intractable nature($\\text{NP}^{\\text{PP}}$-complete), incorporating statistical inference and symbolic reasoning. Previous research on SMC solving lacks provable guarantees and/or suffers from sub-optimal empirical performance, especially when combinatorial constraints are present. We propose XOR-SMC, a polynomial algorithm with access to NP-oracles, to solve highly intractable SMC problems with constant approximation guarantees. XOR-SMC transforms the highly intractable SMC into satisfiability problems, by replacing the model counting in SMC with SAT formulae subject to randomized XOR constraints. Experiments o",
    "link": "http://arxiv.org/abs/2309.08883",
    "context": "Title: Solving Satisfiability Modulo Counting for Symbolic and Statistical AI Integration With Provable Guarantees. (arXiv:2309.08883v1 [cs.AI])\nAbstract: Satisfiability Modulo Counting (SMC) encompasses problems that require both symbolic decision-making and statistical reasoning. Its general formulation captures many real-world problems at the intersection of symbolic and statistical Artificial Intelligence. SMC searches for policy interventions to control probabilistic outcomes. Solving SMC is challenging because of its highly intractable nature($\\text{NP}^{\\text{PP}}$-complete), incorporating statistical inference and symbolic reasoning. Previous research on SMC solving lacks provable guarantees and/or suffers from sub-optimal empirical performance, especially when combinatorial constraints are present. We propose XOR-SMC, a polynomial algorithm with access to NP-oracles, to solve highly intractable SMC problems with constant approximation guarantees. XOR-SMC transforms the highly intractable SMC into satisfiability problems, by replacing the model counting in SMC with SAT formulae subject to randomized XOR constraints. Experiments o",
    "path": "papers/23/09/2309.08883.json",
    "total_tokens": 888,
    "translated_title": "解决符号和统计人工智能集成的可证明保证的可满足性模数问题",
    "translated_abstract": "可满足性模数问题涵盖了需要符号决策和统计推理的问题。它的一般形式捕捉了符号和统计人工智能交叉领域的许多实际问题。可满足性模数问题寻找策略干预以控制概率性结果。解决可满足性模数问题具有高度难解的特性（$\\text{NP}^{\\text{PP}}$-complete），融合了统计推理和符号推理。先前对可满足性模数问题的研究缺乏可证明的保证和/或在组合约束存在时表现出次优的经验性能力。我们提出了XOR-SMC，一个具有访问NP-oracles权限的多项式算法，以解决高度难解的可满足性模数问题，并具有恒定的近似保证。XOR-SMC通过用随机的XOR约束替换SMC中的模型计数，将高度难解的SMC转化为可满足性问题。实验表明...",
    "tldr": "我们提出了XOR-SMC，一个具有访问NP-oracles权限的多项式算法，以解决高度难解的可满足性模数问题，并具有恒定的近似保证。",
    "en_tdlr": "We propose XOR-SMC, a polynomial algorithm with access to NP-oracles, to solve highly intractable SMC problems with constant approximation guarantees."
}