{
    "title": "Rethinking Sensors Modeling: Hierarchical Information Enhanced Traffic Forecasting. (arXiv:2309.11284v1 [cs.AI])",
    "abstract": "With the acceleration of urbanization, traffic forecasting has become an essential role in smart city construction. In the context of spatio-temporal prediction, the key lies in how to model the dependencies of sensors. However, existing works basically only consider the micro relationships between sensors, where the sensors are treated equally, and their macroscopic dependencies are neglected. In this paper, we argue to rethink the sensor's dependency modeling from two hierarchies: regional and global perspectives. Particularly, we merge original sensors with high intra-region correlation as a region node to preserve the inter-region dependency. Then, we generate representative and common spatio-temporal patterns as global nodes to reflect a global dependency between sensors and provide auxiliary information for spatio-temporal dependency learning. In pursuit of the generality and reality of node representations, we incorporate a Meta GCN to calibrate the regional and global nodes in ",
    "link": "http://arxiv.org/abs/2309.11284",
    "context": "Title: Rethinking Sensors Modeling: Hierarchical Information Enhanced Traffic Forecasting. (arXiv:2309.11284v1 [cs.AI])\nAbstract: With the acceleration of urbanization, traffic forecasting has become an essential role in smart city construction. In the context of spatio-temporal prediction, the key lies in how to model the dependencies of sensors. However, existing works basically only consider the micro relationships between sensors, where the sensors are treated equally, and their macroscopic dependencies are neglected. In this paper, we argue to rethink the sensor's dependency modeling from two hierarchies: regional and global perspectives. Particularly, we merge original sensors with high intra-region correlation as a region node to preserve the inter-region dependency. Then, we generate representative and common spatio-temporal patterns as global nodes to reflect a global dependency between sensors and provide auxiliary information for spatio-temporal dependency learning. In pursuit of the generality and reality of node representations, we incorporate a Meta GCN to calibrate the regional and global nodes in ",
    "path": "papers/23/09/2309.11284.json",
    "total_tokens": 914,
    "translated_title": "重新思考传感器建模: 分层信息增强的交通预测",
    "translated_abstract": "随着城市化的加速，交通预测在智慧城市建设中变得至关重要。在时空预测的背景下，关键在于如何建模传感器之间的依赖关系。然而，现有的工作基本上只考虑传感器之间的微观关系，将传感器等同对待，忽视了它们的宏观依赖关系。在本文中，我们认为应该从区域和全局的角度重新思考传感器的依赖建模。特别地，我们将具有高内部区域相关性的原始传感器合并为区域节点，以保留区域间的依赖关系。然后，我们生成代表性和常见的时空模式作为全局节点，以反映传感器之间的全局依赖关系，并为时空依赖学习提供辅助信息。为了追求节点表示的普遍性和真实性，我们引入了元图卷积网络（Meta GCN）来校准区域和全局节点。",
    "tldr": "本文重新思考了传感器的依赖建模问题，从区域和全局两个层次出发，通过合并区域节点和生成全局节点来反映传感器之间的依赖关系，并且应用元图卷积网络来提高节点表示的普遍性和真实性。",
    "en_tdlr": "This paper rethinks the modeling of sensor dependencies by considering regional and global perspectives. It merges sensors with high intra-region correlation as region nodes and generates global nodes to reflect dependencies between sensors. The use of Meta GCN enhances the generality and reality of node representations."
}