{
    "title": "BenLLMEval: A Comprehensive Evaluation into the Potentials and Pitfalls of Large Language Models on Bengali NLP. (arXiv:2309.13173v1 [cs.CL])",
    "abstract": "Large Language Models (LLMs) have emerged as one of the most important breakthroughs in natural language processing (NLP) for their impressive skills in language generation and other language-specific tasks. Though LLMs have been evaluated in various tasks, mostly in English, they have not yet undergone thorough evaluation in under-resourced languages such as Bengali (Bangla). In this paper, we evaluate the performance of LLMs for the low-resourced Bangla language. We select various important and diverse Bangla NLP tasks, such as abstractive summarization, question answering, paraphrasing, natural language inference, text classification, and sentiment analysis for zero-shot evaluation with ChatGPT, LLaMA-2, and Claude-2 and compare the performance with state-of-the-art fine-tuned models. Our experimental results demonstrate an inferior performance of LLMs for different Bangla NLP tasks, calling for further effort to develop better understanding of LLMs in low-resource languages like Ba",
    "link": "http://arxiv.org/abs/2309.13173",
    "context": "Title: BenLLMEval: A Comprehensive Evaluation into the Potentials and Pitfalls of Large Language Models on Bengali NLP. (arXiv:2309.13173v1 [cs.CL])\nAbstract: Large Language Models (LLMs) have emerged as one of the most important breakthroughs in natural language processing (NLP) for their impressive skills in language generation and other language-specific tasks. Though LLMs have been evaluated in various tasks, mostly in English, they have not yet undergone thorough evaluation in under-resourced languages such as Bengali (Bangla). In this paper, we evaluate the performance of LLMs for the low-resourced Bangla language. We select various important and diverse Bangla NLP tasks, such as abstractive summarization, question answering, paraphrasing, natural language inference, text classification, and sentiment analysis for zero-shot evaluation with ChatGPT, LLaMA-2, and Claude-2 and compare the performance with state-of-the-art fine-tuned models. Our experimental results demonstrate an inferior performance of LLMs for different Bangla NLP tasks, calling for further effort to develop better understanding of LLMs in low-resource languages like Ba",
    "path": "papers/23/09/2309.13173.json",
    "total_tokens": 955,
    "translated_title": "BenLLMEval: 一项对孟加拉语自然语言处理中大型语言模型潜力和缺陷的全面评估",
    "translated_abstract": "大型语言模型（LLMs）因其在语言生成和其他具体语言任务中的出色能力而成为自然语言处理中最重要的突破之一。尽管LLMs已在各种任务中得到评估，但大部分评估集中在英语上，尚未对孟加拉语等资源匮乏的语言进行全面评估。本文评估了LLMs在资源匮乏的孟加拉语上的性能。我们选择了各种重要且多样的孟加拉语自然语言处理任务，如抽象摘要、问答、改写、自然语言推理、文本分类和情感分析，以零-shot评估ChatGPT、LLaMA-2和Claude-2，并将性能与最先进的微调模型进行对比。我们的实验结果显示，LLMs在不同的孟加拉语自然语言处理任务中表现较差，需要进一步努力开发对低资源语言（如孟加拉语）中LLMs的更好理解。",
    "tldr": "本文对大型语言模型（LLMs）在孟加拉语自然语言处理中的潜力和缺陷进行了全面评估。结果显示，LLMs在孟加拉语自然语言处理任务中表现较差，需要进一步努力开发对低资源语言中LLMs的更好理解。"
}