{
    "title": "Cross-domain Sound Recognition for Efficient Underwater Data Analysis. (arXiv:2309.03451v1 [cs.SD])",
    "abstract": "This paper presents a novel deep learning approach for analyzing massive underwater acoustic data by leveraging a model trained on a broad spectrum of non-underwater (aerial) sounds. Recognizing the challenge in labeling vast amounts of underwater data, we propose a two-fold methodology to accelerate this labor-intensive procedure.  The first part of our approach involves PCA and UMAP visualization of the underwater data using the feature vectors of an aerial sound recognition model. This enables us to cluster the data in a two dimensional space and listen to points within these clusters to understand their defining characteristics. This innovative method simplifies the process of selecting candidate labels for further training.  In the second part, we train a neural network model using both the selected underwater data and the non-underwater dataset. We conducted a quantitative analysis to measure the precision, recall, and F1 score of our model for recognizing airgun sounds, a common",
    "link": "http://arxiv.org/abs/2309.03451",
    "context": "Title: Cross-domain Sound Recognition for Efficient Underwater Data Analysis. (arXiv:2309.03451v1 [cs.SD])\nAbstract: This paper presents a novel deep learning approach for analyzing massive underwater acoustic data by leveraging a model trained on a broad spectrum of non-underwater (aerial) sounds. Recognizing the challenge in labeling vast amounts of underwater data, we propose a two-fold methodology to accelerate this labor-intensive procedure.  The first part of our approach involves PCA and UMAP visualization of the underwater data using the feature vectors of an aerial sound recognition model. This enables us to cluster the data in a two dimensional space and listen to points within these clusters to understand their defining characteristics. This innovative method simplifies the process of selecting candidate labels for further training.  In the second part, we train a neural network model using both the selected underwater data and the non-underwater dataset. We conducted a quantitative analysis to measure the precision, recall, and F1 score of our model for recognizing airgun sounds, a common",
    "path": "papers/23/09/2309.03451.json",
    "total_tokens": 879,
    "translated_title": "跨域声音识别用于高效的水下数据分析",
    "translated_abstract": "本文介绍了一种新颖的深度学习方法，通过利用在广谱非水下（空中）声音上训练的模型，分析海量水下声学数据。鉴于标记大量水下数据的挑战，我们提出了一个双重方法来加速这一劳动密集型过程。我们的方法的第一部分涉及使用空中声音识别模型的特征向量对水下数据进行PCA和UMAP可视化。这使我们能够在二维空间中对数据进行聚类，并听取这些聚类中的点以了解其定义特性。这种创新方法简化了选择候选标签进行进一步训练的过程。在第二部分中，我们使用选定的水下数据和非水下数据集训练了一个神经网络模型。我们进行了定量分析，衡量了我们模型识别空气枪声的精确度、召回率和F1得分。",
    "tldr": "本文提出了一种跨域声音识别方法，通过利用非水下声音模型训练数据来分析水下声学数据。通过聚类和可视化方法，简化了候选标签选择的过程，并通过训练神经网络模型实现了对空气枪声的高效识别。"
}