{
    "title": "Generating and Imputing Tabular Data via Diffusion and Flow-based Gradient-Boosted Trees",
    "abstract": "arXiv:2309.09968v3 Announce Type: replace  Abstract: Tabular data is hard to acquire and is subject to missing values. This paper introduces a novel approach for generating and imputing mixed-type (continuous and categorical) tabular data utilizing score-based diffusion and conditional flow matching. In contrast to prior methods that rely on neural networks to learn the score function or the vector field, we adopt XGBoost, a widely used Gradient-Boosted Tree (GBT) technique. To test our method, we build one of the most extensive benchmarks for tabular data generation and imputation, containing 27 diverse datasets and 9 metrics. Through empirical evaluation across the benchmark, we demonstrate that our approach outperforms deep-learning generation methods in data generation tasks and remains competitive in data imputation. Notably, it can be trained in parallel using CPUs without requiring a GPU. Our Python and R code is available at https://github.com/SamsungSAILMontreal/ForestDiffusio",
    "link": "https://arxiv.org/abs/2309.09968",
    "context": "Title: Generating and Imputing Tabular Data via Diffusion and Flow-based Gradient-Boosted Trees\nAbstract: arXiv:2309.09968v3 Announce Type: replace  Abstract: Tabular data is hard to acquire and is subject to missing values. This paper introduces a novel approach for generating and imputing mixed-type (continuous and categorical) tabular data utilizing score-based diffusion and conditional flow matching. In contrast to prior methods that rely on neural networks to learn the score function or the vector field, we adopt XGBoost, a widely used Gradient-Boosted Tree (GBT) technique. To test our method, we build one of the most extensive benchmarks for tabular data generation and imputation, containing 27 diverse datasets and 9 metrics. Through empirical evaluation across the benchmark, we demonstrate that our approach outperforms deep-learning generation methods in data generation tasks and remains competitive in data imputation. Notably, it can be trained in parallel using CPUs without requiring a GPU. Our Python and R code is available at https://github.com/SamsungSAILMontreal/ForestDiffusio",
    "path": "papers/23/09/2309.09968.json",
    "total_tokens": 891,
    "translated_title": "通过扩散和基于梯度提升树的流生成和填充表格数据",
    "translated_abstract": "表格数据很难获取，且容易存在缺失值。本文引入了一种新颖的方法，利用基于分数的扩散和条件流匹配来生成和填补混合类型（连续和分类）表格数据。与依赖神经网络学习分数函数或向量场的先前方法不同，我们采用了XGBoost，一种广泛使用的梯度提升树（GBT）技术。为了测试我们的方法，我们构建了一个包含27个不同数据集和9个度量标准的最广泛的表格数据生成和填充基准。通过对基准的实证评估，我们证明了我们的方法在数据生成任务中优于深度学习生成方法，并在数据填充方面保持竞争力。值得注意的是，它可以在CPU上并行训练，无需GPU。我们的Python和R代码可以在https://github.com/SamsungSAILMontreal/ForestDiffusio找到。",
    "tldr": "通过XGBoost技术，本研究提出了一种用于生成和填充混合类型表格数据的新方法，在数据生成任务中优于深度学习方法并在数据填充方面表现竞争力，且可以在CPU上并行训练。",
    "en_tdlr": "This paper introduces a novel approach for generating and imputing mixed-type tabular data utilizing XGBoost, outperforming deep-learning methods in data generation tasks and remaining competitive in data imputation, while being able to be trained in parallel on CPUs."
}