{
    "title": "Decoding Affect in Dyadic Conversations: Leveraging Semantic Similarity through Sentence Embedding. (arXiv:2309.12646v1 [cs.CL])",
    "abstract": "Recent advancements in Natural Language Processing (NLP) have highlighted the potential of sentence embeddings in measuring semantic similarity. Yet, its application in analyzing real-world dyadic interactions and predicting the affect of conversational participants remains largely uncharted. To bridge this gap, the present study utilizes verbal conversations within 50 married couples talking about conflicts and pleasant activities. Transformer-based model all-MiniLM-L6-v2 was employed to obtain the embeddings of the utterances from each speaker. The overall similarity of the conversation was then quantified by the average cosine similarity between the embeddings of adjacent utterances. Results showed that semantic similarity had a positive association with wives' affect during conflict (but not pleasant) conversations. Moreover, this association was not observed with husbands' affect regardless of conversation types. Two validation checks further provided support for the validity of t",
    "link": "http://arxiv.org/abs/2309.12646",
    "context": "Title: Decoding Affect in Dyadic Conversations: Leveraging Semantic Similarity through Sentence Embedding. (arXiv:2309.12646v1 [cs.CL])\nAbstract: Recent advancements in Natural Language Processing (NLP) have highlighted the potential of sentence embeddings in measuring semantic similarity. Yet, its application in analyzing real-world dyadic interactions and predicting the affect of conversational participants remains largely uncharted. To bridge this gap, the present study utilizes verbal conversations within 50 married couples talking about conflicts and pleasant activities. Transformer-based model all-MiniLM-L6-v2 was employed to obtain the embeddings of the utterances from each speaker. The overall similarity of the conversation was then quantified by the average cosine similarity between the embeddings of adjacent utterances. Results showed that semantic similarity had a positive association with wives' affect during conflict (but not pleasant) conversations. Moreover, this association was not observed with husbands' affect regardless of conversation types. Two validation checks further provided support for the validity of t",
    "path": "papers/23/09/2309.12646.json",
    "total_tokens": 854,
    "translated_title": "在双人对话中解码情感：通过句子嵌入利用语义相似性",
    "translated_abstract": "自然语言处理的最新进展突显了句子嵌入在测量语义相似性方面的潜力。然而，其在分析现实中的双人互动并预测对话参与者情感方面的应用仍然很少。为了弥补这一空白，本研究利用50对夫妻之间关于冲突和愉快活动的口头对话。采用基于Transformer的模型all-MiniLM-L6-v2来获得每个发言者话语的嵌入。然后，通过嵌入相邻话语之间的余弦相似性的平均值对对话的整体相似性进行量化。结果显示，语义相似性与妻子在冲突对话中的情感呈正相关（但在愉快对话中不相关）。此外，无论对话类型如何，都未观察到这种相关性与丈夫的情感之间。两个验证检验进一步支持了t",
    "tldr": "本研究通过利用句子嵌入和语义相似性，解码了双人对话中的情感，并发现在冲突对话中，妻子的情感与语义相似性呈正相关。",
    "en_tdlr": "This study decodes affect in dyadic conversations using sentence embeddings and semantic similarity, and finds a positive association between wives' affect and semantic similarity in conflict conversations."
}