{
    "title": "Knowledge Graph Embeddings for Multi-Lingual Structured Representations of Radiology Reports. (arXiv:2309.00917v2 [cs.CL] UPDATED)",
    "abstract": "The way we analyse clinical texts has undergone major changes over the last years. The introduction of language models such as BERT led to adaptations for the (bio)medical domain like PubMedBERT and ClinicalBERT. These models rely on large databases of archived medical documents. While performing well in terms of accuracy, both the lack of interpretability and limitations to transfer across languages limit their use in clinical setting. We introduce a novel light-weight graph-based embedding method specifically catering radiology reports. It takes into account the structure and composition of the report, while also connecting medical terms in the report through the multi-lingual SNOMED Clinical Terms knowledge base. The resulting graph embedding uncovers the underlying relationships among clinical terms, achieving a representation that is better understandable for clinicians and clinically more accurate, without reliance on large pre-training datasets. We show the use of this embedding",
    "link": "http://arxiv.org/abs/2309.00917",
    "context": "Title: Knowledge Graph Embeddings for Multi-Lingual Structured Representations of Radiology Reports. (arXiv:2309.00917v2 [cs.CL] UPDATED)\nAbstract: The way we analyse clinical texts has undergone major changes over the last years. The introduction of language models such as BERT led to adaptations for the (bio)medical domain like PubMedBERT and ClinicalBERT. These models rely on large databases of archived medical documents. While performing well in terms of accuracy, both the lack of interpretability and limitations to transfer across languages limit their use in clinical setting. We introduce a novel light-weight graph-based embedding method specifically catering radiology reports. It takes into account the structure and composition of the report, while also connecting medical terms in the report through the multi-lingual SNOMED Clinical Terms knowledge base. The resulting graph embedding uncovers the underlying relationships among clinical terms, achieving a representation that is better understandable for clinicians and clinically more accurate, without reliance on large pre-training datasets. We show the use of this embedding",
    "path": "papers/23/09/2309.00917.json",
    "total_tokens": 955,
    "translated_title": "知识图谱嵌入用于多语言结构化表现的放射学报告",
    "translated_abstract": "过去几年中，我们分析临床文本的方式发生了重大变化。语言模型（如BERT）的引入导致了针对（生物）医学领域的调整，如PubMedBERT和ClinicalBERT。这些模型依赖于大量存档的医学文档数据库。虽然在准确度方面表现良好，但解释能力的缺乏和跨语言转移的限制限制了它们在临床设置中的使用。我们引入了一种新颖的轻量级基于图的嵌入方法，专门针对放射学报告。它考虑了报告的结构和组成，同时通过多语言SNOMED临床术语知识库连接报告中的医学术语。生成的图嵌入揭示出临床术语之间的潜在关系，实现了对临床医生更易理解、临床更准确的表征，而不依赖于大规模的预训练数据集。我们展示了这种嵌入的使用。",
    "tldr": "本论文提出一种新颖的轻量级基于图的嵌入方法，用于对放射学报告进行多语言结构化表现。通过连接医学术语和多语言知识库，这种嵌入方法揭示了临床术语之间的关系，提供了对临床医生更易理解、临床更准确的表征。",
    "en_tdlr": "This paper introduces a novel lightweight graph-based embedding method for multi-lingual structured representations of radiology reports. By connecting medical terms and a multi-lingual knowledge base, this embedding method uncovers the relationships among clinical terms, providing a representation that is better understandable for clinicians and clinically more accurate."
}