{
    "title": "Geodesic Regression Characterizes 3D Shape Changes in the Female Brain During Menstruation. (arXiv:2309.16662v1 [cs.CV])",
    "abstract": "Women are at higher risk of Alzheimer's and other neurological diseases after menopause, and yet research connecting female brain health to sex hormone fluctuations is limited. We seek to investigate this connection by developing tools that quantify 3D shape changes that occur in the brain during sex hormone fluctuations. Geodesic regression on the space of 3D discrete surfaces offers a principled way to characterize the evolution of a brain's shape. However, in its current form, this approach is too computationally expensive for practical use. In this paper, we propose approximation schemes that accelerate geodesic regression on shape spaces of 3D discrete surfaces. We also provide rules of thumb for when each approximation can be used. We test our approach on synthetic data to quantify the speed-accuracy trade-off of these approximations and show that practitioners can expect very significant speed-up while only sacrificing little accuracy. Finally, we apply the method to real brain ",
    "link": "http://arxiv.org/abs/2309.16662",
    "context": "Title: Geodesic Regression Characterizes 3D Shape Changes in the Female Brain During Menstruation. (arXiv:2309.16662v1 [cs.CV])\nAbstract: Women are at higher risk of Alzheimer's and other neurological diseases after menopause, and yet research connecting female brain health to sex hormone fluctuations is limited. We seek to investigate this connection by developing tools that quantify 3D shape changes that occur in the brain during sex hormone fluctuations. Geodesic regression on the space of 3D discrete surfaces offers a principled way to characterize the evolution of a brain's shape. However, in its current form, this approach is too computationally expensive for practical use. In this paper, we propose approximation schemes that accelerate geodesic regression on shape spaces of 3D discrete surfaces. We also provide rules of thumb for when each approximation can be used. We test our approach on synthetic data to quantify the speed-accuracy trade-off of these approximations and show that practitioners can expect very significant speed-up while only sacrificing little accuracy. Finally, we apply the method to real brain ",
    "path": "papers/23/09/2309.16662.json",
    "total_tokens": 903,
    "translated_title": "首次研究女性大脑在月经期间的3D形状变化的地理回归",
    "translated_abstract": "女性在绝经后更容易患上阿尔茨海默病和其他神经系统疾病，然而，将女性大脑健康与性激素波动联系起来的研究还有限。通过开发工具来量化大脑在性激素波动期间发生的3D形状变化，我们试图调查这种联系。地理回归在3D离散表面空间上提供了刻画大脑形状演变的原则性方法。然而，目前的方法在实际使用中计算复杂度过高。在本文中，我们提出了加速3D离散表面形状地理回归的近似方案。我们还提供了何时使用每个近似方法的经验规则。我们通过使用合成数据对这些近似方法进行了测试，量化了速度和精确度之间的权衡，并证明从从中获得非常显著的加速，并只稍微牺牲一些精确度。最后，我们将该方法应用于真实的大脑数据中。",
    "tldr": "本研究首次探究了女性大脑在月经期间的3D形状变化，通过地理回归方法加速计算并提供精确度与速度之间的权衡。根据合成数据测试结果，可以在牺牲少部分精确度的情况下获得显著加速。"
}