{
    "title": "Generating Hierarchical Structures for Improved Time Series Classification Using Stochastic Splitting Functions. (arXiv:2309.11963v1 [cs.LG])",
    "abstract": "This study introduces a novel hierarchical divisive clustering approach with stochastic splitting functions (SSFs) to enhance classification performance in multi-class datasets through hierarchical classification (HC). The method has the unique capability of generating hierarchy without requiring explicit information, making it suitable for datasets lacking prior knowledge of hierarchy. By systematically dividing classes into two subsets based on their discriminability according to the classifier, the proposed approach constructs a binary tree representation of hierarchical classes. The approach is evaluated on 46 multi-class time series datasets using popular classifiers (svm and rocket) and SSFs (potr, srtr, and lsoo). The results reveal that the approach significantly improves classification performance in approximately half and a third of the datasets when using rocket and svm as the classifier, respectively. The study also explores the relationship between dataset features and HC ",
    "link": "http://arxiv.org/abs/2309.11963",
    "context": "Title: Generating Hierarchical Structures for Improved Time Series Classification Using Stochastic Splitting Functions. (arXiv:2309.11963v1 [cs.LG])\nAbstract: This study introduces a novel hierarchical divisive clustering approach with stochastic splitting functions (SSFs) to enhance classification performance in multi-class datasets through hierarchical classification (HC). The method has the unique capability of generating hierarchy without requiring explicit information, making it suitable for datasets lacking prior knowledge of hierarchy. By systematically dividing classes into two subsets based on their discriminability according to the classifier, the proposed approach constructs a binary tree representation of hierarchical classes. The approach is evaluated on 46 multi-class time series datasets using popular classifiers (svm and rocket) and SSFs (potr, srtr, and lsoo). The results reveal that the approach significantly improves classification performance in approximately half and a third of the datasets when using rocket and svm as the classifier, respectively. The study also explores the relationship between dataset features and HC ",
    "path": "papers/23/09/2309.11963.json",
    "total_tokens": 885,
    "translated_title": "使用随机分裂函数生成层次结构以改善时间序列分类",
    "translated_abstract": "本研究引入了一种新颖的使用随机分裂函数（SSFs）的层次分割聚类方法，通过层次分类（HC）提高多类数据集的分类性能。该方法具有在不需要显式信息的情况下生成层次的独特能力，适用于缺乏层次先验知识的数据集。通过根据分类器的可辨别性将类别系统地划分为两个子集，该方法构建了层次类别的二叉树表示。该方法在46个多类时间序列数据集上使用流行的分类器（svm和rocket）和SSFs（potr、srtr和lsoo）进行评估。结果表明，在使用rocket和svm作为分类器时，该方法在近一半和三分之一的数据集中显著提高了分类性能。本研究还探讨了数据集特征与HC之间的关系。",
    "tldr": "本研究介绍了一种新颖的层次分割聚类方法，通过使用随机分裂函数提高多类数据集的分类性能。该方法可以生成层次结构而无需显式信息，适用于缺乏层次先验知识的数据集。实验结果表明，该方法在一半以上的数据集中显著提升分类性能。",
    "en_tdlr": "This study introduces a novel hierarchical divisive clustering approach that enhances classification performance in multi-class datasets using stochastic splitting functions. The approach can generate hierarchy without requiring explicit information, making it suitable for datasets lacking prior knowledge of hierarchy. Experimental results show that the approach significantly improves classification performance in more than half of the datasets."
}