{
    "title": "Correlation between morphological evolution of splashing drop and exerted impact force revealed by interpretation of explainable artificial intelligence. (arXiv:2309.10266v1 [physics.flu-dyn])",
    "abstract": "This study reveals a possible correlation between splashing morphology and the normalized impact force exerted by an impacting drop on a solid surface. This finding is obtained from a newly proposed feature extraction method and a subsequent interpretation of the classification of splashing and non-splashing drops performed by an explainable artificial intelligence (XAI) video classifier. Notably, the values of the weight matrix elements of the XAI that correspond to the extracted features are found to change with the temporal evolution of the drop morphology. We compute the rate of change of the contributions of each frame with respect to the classification value of a video as an important index to quantify the contributions of the extracted splashing and non-splashing features at different impact times to the classification of the XAI model. Remarkably, the rate computed for the extracted splashing features is found to closely match the profile of the normalized impact force, where t",
    "link": "http://arxiv.org/abs/2309.10266",
    "context": "Title: Correlation between morphological evolution of splashing drop and exerted impact force revealed by interpretation of explainable artificial intelligence. (arXiv:2309.10266v1 [physics.flu-dyn])\nAbstract: This study reveals a possible correlation between splashing morphology and the normalized impact force exerted by an impacting drop on a solid surface. This finding is obtained from a newly proposed feature extraction method and a subsequent interpretation of the classification of splashing and non-splashing drops performed by an explainable artificial intelligence (XAI) video classifier. Notably, the values of the weight matrix elements of the XAI that correspond to the extracted features are found to change with the temporal evolution of the drop morphology. We compute the rate of change of the contributions of each frame with respect to the classification value of a video as an important index to quantify the contributions of the extracted splashing and non-splashing features at different impact times to the classification of the XAI model. Remarkably, the rate computed for the extracted splashing features is found to closely match the profile of the normalized impact force, where t",
    "path": "papers/23/09/2309.10266.json",
    "total_tokens": 879,
    "translated_title": "解释性人工智能解释揭示了飞溅液滴形态演化与施加冲击力之间的相关性",
    "translated_abstract": "本研究通过解释性人工智能（XAI）视频分类器对飞溅和非飞溅液滴分类的特征提取方法和解释方法，揭示了飞溅形态与液滴对固体表面施加的标准化冲击力之间可能存在的相关性。值得注意的是，XAI的权重矩阵元素的值与液滴形态的时间演化而变化。我们计算了每帧对视频分类值的贡献的变化率，作为量化提取的飞溅和非飞溅特征在不同冲击时间对XAI模型分类的贡献的重要指标。值得注意的是，计算得到的飞溅特征的变化率与标准化冲击力的曲线非常匹配。",
    "tldr": "本研究通过解释性人工智能分析，揭示了飞溅液滴形态演化与液滴对固体表面施加的冲击力之间的相关性，并发现权重矩阵元素的值与液滴形态的时间演化而变化。",
    "en_tdlr": "This study reveals a correlation between splashing drop morphology and the force exerted by the drop on a solid surface, using an explainable artificial intelligence (XAI) video classifier. The findings show that the weight matrix elements of the XAI change with the temporal evolution of the drop morphology."
}