{
    "title": "Is it Possible to Modify Text to a Target Readability Level? An Initial Investigation Using Zero-Shot Large Language Models. (arXiv:2309.12551v1 [cs.CL])",
    "abstract": "Text simplification is a common task where the text is adapted to make it easier to understand. Similarly, text elaboration can make a passage more sophisticated, offering a method to control the complexity of reading comprehension tests. However, text simplification and elaboration tasks are limited to only relatively alter the readability of texts. It is useful to directly modify the readability of any text to an absolute target readability level to cater to a diverse audience. Ideally, the readability of readability-controlled generated text should be independent of the source text. Therefore, we propose a novel readability-controlled text modification task. The task requires the generation of 8 versions at various target readability levels for each input text. We introduce novel readability-controlled text modification metrics. The baselines for this task use ChatGPT and Llama-2, with an extension approach introducing a two-step process (generating paraphrases by passing through th",
    "link": "http://arxiv.org/abs/2309.12551",
    "context": "Title: Is it Possible to Modify Text to a Target Readability Level? An Initial Investigation Using Zero-Shot Large Language Models. (arXiv:2309.12551v1 [cs.CL])\nAbstract: Text simplification is a common task where the text is adapted to make it easier to understand. Similarly, text elaboration can make a passage more sophisticated, offering a method to control the complexity of reading comprehension tests. However, text simplification and elaboration tasks are limited to only relatively alter the readability of texts. It is useful to directly modify the readability of any text to an absolute target readability level to cater to a diverse audience. Ideally, the readability of readability-controlled generated text should be independent of the source text. Therefore, we propose a novel readability-controlled text modification task. The task requires the generation of 8 versions at various target readability levels for each input text. We introduce novel readability-controlled text modification metrics. The baselines for this task use ChatGPT and Llama-2, with an extension approach introducing a two-step process (generating paraphrases by passing through th",
    "path": "papers/23/09/2309.12551.json",
    "total_tokens": 890,
    "translated_title": "是否可能将文本修改到目标可读性水平？使用零射大型语言模型的初步调研",
    "translated_abstract": "文本简化是一项常见任务，通过调整文本以使其更易于理解。类似地，文本拓展可以使一段更为复杂，为控制阅读理解测试的复杂度提供一种方法。然而，文本简化和拓展任务仅能相对地调整文本的可读性。直接将任意文本修改到绝对目标可读性水平对于满足多样化的受众是有用的。理想情况下，控制可读性的生成文本的可读性应独立于源文本。因此，我们提出了一项新颖的可读性控制文本修改任务。该任务要求为每个输入文本生成8个不同目标可读性水平的版本。我们引入了新颖的可读性控制文本修改度量标准。该任务的基线使用ChatGPT和Llama-2，扩展方法引入了一个两步流程（通过传递为生成释义）。",
    "tldr": "这项研究旨在探讨将文本修改到目标可读性水平的可行性。研究提出了一项新颖的可读性控制文本修改任务，要求为每个输入文本生成多个不同目标可读性水平的版本，并引入了相应的度量标准。",
    "en_tdlr": "This study investigates the possibility of modifying text to a target readability level. It proposes a novel readability-controlled text modification task that generates multiple versions of each input text at different target readability levels, and introduces corresponding metrics."
}