{
    "title": "Explainable machine learning-based prediction model for diabetic nephropathy. (arXiv:2309.16730v1 [cs.LG])",
    "abstract": "The aim of this study is to analyze the effect of serum metabolites on diabetic nephropathy (DN) and predict the prevalence of DN through a machine learning approach. The dataset consists of 548 patients from April 2018 to April 2019 in Second Affiliated Hospital of Dalian Medical University (SAHDMU). We select the optimal 38 features through a Least absolute shrinkage and selection operator (LASSO) regression model and a 10-fold cross-validation. We compare four machine learning algorithms, including eXtreme Gradient Boosting (XGB), random forest, decision tree and logistic regression, by AUC-ROC curves, decision curves, calibration curves. We quantify feature importance and interaction effects in the optimal predictive model by Shapley Additive exPlanations (SHAP) method. The XGB model has the best performance to screen for DN with the highest AUC value of 0.966. The XGB model also gains more clinical net benefits than others and the fitting degree is better. In addition, there are s",
    "link": "http://arxiv.org/abs/2309.16730",
    "context": "Title: Explainable machine learning-based prediction model for diabetic nephropathy. (arXiv:2309.16730v1 [cs.LG])\nAbstract: The aim of this study is to analyze the effect of serum metabolites on diabetic nephropathy (DN) and predict the prevalence of DN through a machine learning approach. The dataset consists of 548 patients from April 2018 to April 2019 in Second Affiliated Hospital of Dalian Medical University (SAHDMU). We select the optimal 38 features through a Least absolute shrinkage and selection operator (LASSO) regression model and a 10-fold cross-validation. We compare four machine learning algorithms, including eXtreme Gradient Boosting (XGB), random forest, decision tree and logistic regression, by AUC-ROC curves, decision curves, calibration curves. We quantify feature importance and interaction effects in the optimal predictive model by Shapley Additive exPlanations (SHAP) method. The XGB model has the best performance to screen for DN with the highest AUC value of 0.966. The XGB model also gains more clinical net benefits than others and the fitting degree is better. In addition, there are s",
    "path": "papers/23/09/2309.16730.json",
    "total_tokens": 1053,
    "translated_title": "可解释的基于机器学习的糖尿病肾病预测模型",
    "translated_abstract": "本研究旨在分析血清代谢物对糖尿病肾病（DN）的影响，并通过机器学习方法预测DN的患病率。数据集包括2018年4月至2019年4月大连医科大学附属第二医院的548名患者。我们通过最小绝对收缩和选择算子（LASSO）回归模型和10折交叉验证选择了最优的38个特征。我们比较了四种机器学习算法，包括极限梯度提升（XGB）、随机森林、决策树和逻辑回归，并通过AUC-ROC曲线、决策曲线和校准曲线进行比较。我们利用Shapley Additive exPlanations（SHAP）方法来量化最优预测模型中的特征重要性和交互效应。XGB模型在筛选DN方面具有最佳性能，最高AUC值为0.966。XGB模型的临床净效益也优于其他模型，并且拟合度更好。",
    "tldr": "本研究提出了一个可解释的基于机器学习的糖尿病肾病预测模型，通过分析血清代谢物对疾病的影响并选择最优特征来预测疾病的患病率。最优模型采用了极限梯度提升（XGB）算法，其在筛选DN方面表现最佳，同时具有更好的临床效益和拟合度。"
}