{
    "title": "Multimodal Transformers for Wireless Communications: A Case Study in Beam Prediction. (arXiv:2309.11811v1 [eess.SP])",
    "abstract": "Wireless communications at high-frequency bands with large antenna arrays face challenges in beam management, which can potentially be improved by multimodality sensing information from cameras, LiDAR, radar, and GPS. In this paper, we present a multimodal transformer deep learning framework for sensing-assisted beam prediction. We employ a convolutional neural network to extract the features from a sequence of images, point clouds, and radar raw data sampled over time. At each convolutional layer, we use transformer encoders to learn the hidden relations between feature tokens from different modalities and time instances over abstraction space and produce encoded vectors for the next-level feature extraction. We train the model on a combination of different modalities with supervised learning. We try to enhance the model over imbalanced data by utilizing focal loss and exponential moving average. We also evaluate data processing and augmentation techniques such as image enhancement, s",
    "link": "http://arxiv.org/abs/2309.11811",
    "context": "Title: Multimodal Transformers for Wireless Communications: A Case Study in Beam Prediction. (arXiv:2309.11811v1 [eess.SP])\nAbstract: Wireless communications at high-frequency bands with large antenna arrays face challenges in beam management, which can potentially be improved by multimodality sensing information from cameras, LiDAR, radar, and GPS. In this paper, we present a multimodal transformer deep learning framework for sensing-assisted beam prediction. We employ a convolutional neural network to extract the features from a sequence of images, point clouds, and radar raw data sampled over time. At each convolutional layer, we use transformer encoders to learn the hidden relations between feature tokens from different modalities and time instances over abstraction space and produce encoded vectors for the next-level feature extraction. We train the model on a combination of different modalities with supervised learning. We try to enhance the model over imbalanced data by utilizing focal loss and exponential moving average. We also evaluate data processing and augmentation techniques such as image enhancement, s",
    "path": "papers/23/09/2309.11811.json",
    "total_tokens": 918,
    "translated_title": "多模态变压器用于无线通信：一种基于波束预测的案例研究",
    "translated_abstract": "在高频段和大天线阵列的无线通信中，波束管理面临着挑战，可以通过来自相机、LiDAR、雷达和GPS的多模态感知信息进行改进。本文提出了一种多模态变压器深度学习框架用于辅助波束预测。我们采用卷积神经网络从一系列图像、点云和雷达原始数据中提取特征。在每个卷积层中，我们使用变压器编码器学习不同模态和时间实例之间特征标记的隐藏关系，以在抽象空间中生成编码向量以便进行下一级的特征提取。我们使用有监督学习训练模型，结合不同模态的组合。我们尝试通过使用焦点损失和指数移动平均来增强模型对不平衡数据的处理。我们还评估了图像增强、数据处理和增强技术。",
    "tldr": "本文提出了一种多模态变压器深度学习框架，用于无线通信中的波束预测。该框架通过利用相机、LiDAR、雷达和GPS等多种感知信息，提取并学习不同模态和时间实例之间的特征关系，从而在波束管理中具有较好的性能。"
}