{
    "title": "A Competition-based Pricing Strategy in Cloud Markets using Regret Minimization Techniques. (arXiv:2309.11312v1 [cs.GT])",
    "abstract": "Cloud computing as a fairly new commercial paradigm, widely investigated by different researchers, already has a great range of challenges. Pricing is a major problem in Cloud computing marketplace; as providers are competing to attract more customers without knowing the pricing policies of each other. To overcome this lack of knowledge, we model their competition by an incomplete-information game. Considering the issue, this work proposes a pricing policy related to the regret minimization algorithm and applies it to the considered incomplete-information game. Based on the competition based marketplace of the Cloud, providers update the distribution of their strategies using the experienced regret. The idea of iteratively applying the algorithm for updating probabilities of strategies causes the regret get minimized faster. The experimental results show much more increase in profits of the providers in comparison with other pricing policies. Besides, the efficiency of a variety of reg",
    "link": "http://arxiv.org/abs/2309.11312",
    "context": "Title: A Competition-based Pricing Strategy in Cloud Markets using Regret Minimization Techniques. (arXiv:2309.11312v1 [cs.GT])\nAbstract: Cloud computing as a fairly new commercial paradigm, widely investigated by different researchers, already has a great range of challenges. Pricing is a major problem in Cloud computing marketplace; as providers are competing to attract more customers without knowing the pricing policies of each other. To overcome this lack of knowledge, we model their competition by an incomplete-information game. Considering the issue, this work proposes a pricing policy related to the regret minimization algorithm and applies it to the considered incomplete-information game. Based on the competition based marketplace of the Cloud, providers update the distribution of their strategies using the experienced regret. The idea of iteratively applying the algorithm for updating probabilities of strategies causes the regret get minimized faster. The experimental results show much more increase in profits of the providers in comparison with other pricing policies. Besides, the efficiency of a variety of reg",
    "path": "papers/23/09/2309.11312.json",
    "total_tokens": 863,
    "translated_title": "云市场中基于竞争的定价策略：利用遗憾最小化技术",
    "translated_abstract": "云计算作为一种相对新的商业模式，已经受到不同研究者的广泛关注，但也面临着许多挑战。定价是云计算市场的一个主要问题，因为供应商需要在不了解对手定价策略的情况下吸引更多的客户。为了解决这个问题，本文提出了一个基于遗憾最小化算法的定价策略，并将其应用于考虑到不完全信息的博弈模型中。基于云计算市场的竞争环境，供应商利用经验遗憾来更新其策略的分布。通过迭代应用算法更新策略概率，可以更快地减小遗憾。实验结果显示，与其他定价策略相比，供应商的利润大幅增加。此外，多种遗憾最小化技术也得到了有效的验证。",
    "tldr": "本研究提出了一种基于遗憾最小化算法的云市场定价策略，通过模拟供应商之间的竞争环境并迭代更新策略概率，实现了供应商利润的显著增加。",
    "en_tdlr": "This study proposes a cloud market pricing strategy based on regret minimization algorithm, which achieves a significant increase in provider profits by simulating competition environment among providers and iteratively updating strategy probabilities."
}