{
    "title": "Weakly supervised learning for pattern classification in serial femtosecond crystallography. (arXiv:2309.04474v1 [cond-mat.mtrl-sci])",
    "abstract": "Serial femtosecond crystallography at X-ray free electron laser facilities opens a new era for the determination of crystal structure. However, the data processing of those experiments is facing unprecedented challenge, because the total number of diffraction patterns needed to determinate a high-resolution structure is huge. Machine learning methods are very likely to play important roles in dealing with such a large volume of data. Convolutional neural networks have made a great success in the field of pattern classification, however, training of the networks need very large datasets with labels. Th is heavy dependence on labeled datasets will seriously restrict the application of networks, because it is very costly to annotate a large number of diffraction patterns. In this article we present our job on the classification of diffraction pattern by weakly supervised algorithms, with the aim of reducing as much as possible the size of the labeled dataset required for training. Our res",
    "link": "http://arxiv.org/abs/2309.04474",
    "context": "Title: Weakly supervised learning for pattern classification in serial femtosecond crystallography. (arXiv:2309.04474v1 [cond-mat.mtrl-sci])\nAbstract: Serial femtosecond crystallography at X-ray free electron laser facilities opens a new era for the determination of crystal structure. However, the data processing of those experiments is facing unprecedented challenge, because the total number of diffraction patterns needed to determinate a high-resolution structure is huge. Machine learning methods are very likely to play important roles in dealing with such a large volume of data. Convolutional neural networks have made a great success in the field of pattern classification, however, training of the networks need very large datasets with labels. Th is heavy dependence on labeled datasets will seriously restrict the application of networks, because it is very costly to annotate a large number of diffraction patterns. In this article we present our job on the classification of diffraction pattern by weakly supervised algorithms, with the aim of reducing as much as possible the size of the labeled dataset required for training. Our res",
    "path": "papers/23/09/2309.04474.json",
    "total_tokens": 836,
    "translated_title": "弱监督学习在串行飞秒晶体学中的模式分类中的应用",
    "translated_abstract": "X射线自由电子激光设施上的串行飞秒晶体学为晶体结构的确定开辟了新的时代。然而，这些实验的数据处理面临前所未有的挑战，因为确定高分辨率结构所需的衍射图的总数巨大。机器学习方法在处理如此大量的数据方面可能起到重要作用。卷积神经网络在模式分类领域取得了巨大成功，然而，训练这些网络需要带有标签的大规模数据集。对标签数据集的强依赖严重限制了网络的应用，因为注释大量衍射图非常昂贵。本文介绍了我们在弱监督算法下对衍射图进行分类的工作，旨在尽可能减少训练所需的标签数据集的规模。",
    "tldr": "本文介绍了在串行飞秒晶体学中通过弱监督算法对衍射图进行分类的工作，旨在尽可能减少训练所需的标签数据集的规模。",
    "en_tdlr": "This article presents the work on classifying diffraction patterns in serial femtosecond crystallography using weakly supervised algorithms, aiming to minimize the size of the labeled dataset required for training."
}