{
    "title": "On the use of U-statistics for linear dyadic interaction models. (arXiv:2309.02089v1 [econ.EM])",
    "abstract": "Even though dyadic regressions are widely used in empirical applications, the (asymptotic) properties of estimation methods only began to be studied recently in the literature. This paper aims to provide in a step-by-step manner how U-statistics tools can be applied to obtain the asymptotic properties of pairwise differences estimators for a two-way fixed effects model of dyadic interactions. More specifically, we first propose an estimator for the model that relies on pairwise differencing such that the fixed effects are differenced out. As a result, the summands of the influence function will not be independent anymore, showing dependence on the individual level and translating to the fact that the usual law of large numbers and central limit theorems do not straightforwardly apply. To overcome such obstacles, we show how to generalize tools of U-statistics for single-index variables to the double-indices context of dyadic datasets. A key result is that there can be different ways of",
    "link": "http://arxiv.org/abs/2309.02089",
    "context": "Title: On the use of U-statistics for linear dyadic interaction models. (arXiv:2309.02089v1 [econ.EM])\nAbstract: Even though dyadic regressions are widely used in empirical applications, the (asymptotic) properties of estimation methods only began to be studied recently in the literature. This paper aims to provide in a step-by-step manner how U-statistics tools can be applied to obtain the asymptotic properties of pairwise differences estimators for a two-way fixed effects model of dyadic interactions. More specifically, we first propose an estimator for the model that relies on pairwise differencing such that the fixed effects are differenced out. As a result, the summands of the influence function will not be independent anymore, showing dependence on the individual level and translating to the fact that the usual law of large numbers and central limit theorems do not straightforwardly apply. To overcome such obstacles, we show how to generalize tools of U-statistics for single-index variables to the double-indices context of dyadic datasets. A key result is that there can be different ways of",
    "path": "papers/23/09/2309.02089.json",
    "total_tokens": 885,
    "translated_title": "关于使用U-统计量进行线性双叶交互模型的研究",
    "translated_abstract": "尽管双叶回归在实证应用中被广泛使用，但估计方法的（渐进）性质直到最近才开始在文献中进行研究。本文旨在以逐步方式提供如何应用U-统计工具来获得双叶交互的两向固定效应模型的成对差异估计器的渐进性质。具体而言，我们首先提出了一种依赖于成对差异的模型估计器，以消除固定效应。由此可知，影响函数的求和项不再独立，显示出个体水平的相关性，这意味着通常的大数定律和中心极限定理不直接适用。为了克服这些障碍，我们展示了如何将U-统计工具的单指数变量的应用推广到双指数的双叶数据集的背景下。一个关键结果是可能会有不同的方式。",
    "tldr": "本文针对双叶交互模型提出了一种基于U-统计量的成对差异估计器，用于消除固定效应，并探讨了如何将U-统计工具推广到双叶数据集的背景下。",
    "en_tdlr": "This paper introduces a U-statistics-based pairwise differencing estimator for the two-way fixed effects model of dyadic interactions, and explores the generalization of U-statistics tools to the context of dyadic datasets."
}