{
    "title": "From Text to Trends: A Unique Garden Analytics Perspective on the Future of Modern Agriculture. (arXiv:2309.12579v1 [cs.AI])",
    "abstract": "Data-driven insights are essential for modern agriculture. This research paper introduces a machine learning framework designed to improve how we educate and reach out to people in the field of horticulture. The framework relies on data from the Horticulture Online Help Desk (HOHD), which is like a big collection of questions from people who love gardening and are part of the Extension Master Gardener Program (EMGP). This framework has two main parts. First, it uses special computer programs (machine learning models) to sort questions into categories. This helps us quickly send each question to the right expert, so we can answer it faster. Second, it looks at when questions are asked and uses that information to guess how many questions we might get in the future and what they will be about. This helps us plan on topics that will be really important. It's like knowing what questions will be popular in the coming months. We also take into account where the questions come from by looking",
    "link": "http://arxiv.org/abs/2309.12579",
    "context": "Title: From Text to Trends: A Unique Garden Analytics Perspective on the Future of Modern Agriculture. (arXiv:2309.12579v1 [cs.AI])\nAbstract: Data-driven insights are essential for modern agriculture. This research paper introduces a machine learning framework designed to improve how we educate and reach out to people in the field of horticulture. The framework relies on data from the Horticulture Online Help Desk (HOHD), which is like a big collection of questions from people who love gardening and are part of the Extension Master Gardener Program (EMGP). This framework has two main parts. First, it uses special computer programs (machine learning models) to sort questions into categories. This helps us quickly send each question to the right expert, so we can answer it faster. Second, it looks at when questions are asked and uses that information to guess how many questions we might get in the future and what they will be about. This helps us plan on topics that will be really important. It's like knowing what questions will be popular in the coming months. We also take into account where the questions come from by looking",
    "path": "papers/23/09/2309.12579.json",
    "total_tokens": 896,
    "translated_title": "从文字到趋势：园艺分析视角对现代农业的未来的独特见解",
    "translated_abstract": "数据驱动的洞察对现代农业至关重要。本研究论文介绍了一个机器学习框架，旨在改善我们在园艺领域教育和触及人群的方式。该框架依赖于Horticulture Online Help Desk（HOHD）的数据，该数据库是园艺爱好者和大师园艺师项目（EMGP）的一系列问题。该框架有两个主要部分。首先，它使用特殊的计算机程序（机器学习模型）将问题分类。这帮助我们快速将每个问题发送给正确的专家，以更快地回答问题。其次，它根据问题的提出时间来猜测我们将来可能会收到多少问题以及它们的内容。这帮助我们计划将来真正重要的主题。就像知道未来几个月将会有哪些热门问题一样。我们还通过查看问题的来源来考虑问题的地域分布。",
    "tldr": "这项研究引入了一个基于机器学习的框架，利用园艺领域的在线问答数据来提高农业教育和管理效果，并通过分类和时间分析来预测未来的问题趋势。"
}