{
    "title": "Enhancing Graph Collaborative Filtering via Uniformly Co-Clustered Intent Modeling. (arXiv:2309.12723v1 [cs.IR])",
    "abstract": "Graph-based collaborative filtering has emerged as a powerful paradigm for delivering personalized recommendations. Despite their demonstrated effectiveness, these methods often neglect the underlying intents of users, which constitute a pivotal facet of comprehensive user interests. Consequently, a series of approaches have arisen to tackle this limitation by introducing independent intent representations. However, these approaches fail to capture the intricate relationships between intents of different users and the compatibility between user intents and item properties.  To remedy the above issues, we propose a novel method, named uniformly co-clustered intent modeling. Specifically, we devise a uniformly contrastive intent modeling module to bring together the embeddings of users with similar intents and items with similar properties. This module aims to model the nuanced relations between intents of different users and properties of different items, especially those unreachable to",
    "link": "http://arxiv.org/abs/2309.12723",
    "context": "Title: Enhancing Graph Collaborative Filtering via Uniformly Co-Clustered Intent Modeling. (arXiv:2309.12723v1 [cs.IR])\nAbstract: Graph-based collaborative filtering has emerged as a powerful paradigm for delivering personalized recommendations. Despite their demonstrated effectiveness, these methods often neglect the underlying intents of users, which constitute a pivotal facet of comprehensive user interests. Consequently, a series of approaches have arisen to tackle this limitation by introducing independent intent representations. However, these approaches fail to capture the intricate relationships between intents of different users and the compatibility between user intents and item properties.  To remedy the above issues, we propose a novel method, named uniformly co-clustered intent modeling. Specifically, we devise a uniformly contrastive intent modeling module to bring together the embeddings of users with similar intents and items with similar properties. This module aims to model the nuanced relations between intents of different users and properties of different items, especially those unreachable to",
    "path": "papers/23/09/2309.12723.json",
    "total_tokens": 831,
    "translated_title": "通过统一合并意图建模增强图协同过滤",
    "translated_abstract": "基于图的协同过滤已成为提供个性化推荐的一种强大范式。尽管这些方法已经证明了其有效性，但它们常常忽视了用户的潜在意图，这是综合用户兴趣的一个关键方面。因此，出现了一系列的方法来解决这个限制，引入了独立的意图表示。然而，这些方法没有捕捉到不同用户意图之间的复杂关系以及用户意图与项目属性之间的兼容性。为了解决以上问题，我们提出了一种新颖的方法，称为统一合并意图建模。具体而言，我们设计了一个统一对比意图建模模块，将具有相似意图的用户嵌入和具有相似属性的项目嵌入结合起来。该模块旨在建模不同用户意图和不同项目属性之间的微妙关系，特别是那些难以达到的关系。",
    "tldr": "通过统一合并意图建模的方法，我们提出了一种增强图协同过滤的方法，该方法能够捕捉到不同用户意图之间的复杂关系以及用户意图与项目属性之间的兼容性。",
    "en_tdlr": "We propose a method to enhance graph collaborative filtering by uniformly co-clustered intent modeling, which captures the intricate relationships between different user intents and the compatibility between user intents and item properties."
}