{
    "title": "Screening of Pneumonia and Urinary Tract Infection at Triage using TriNet. (arXiv:2309.02604v1 [cs.LG])",
    "abstract": "Due to the steady rise in population demographics and longevity, emergency department visits are increasing across North America. As more patients visit the emergency department, traditional clinical workflows become overloaded and inefficient, leading to prolonged wait-times and reduced healthcare quality. One of such workflows is the triage medical directive, impeded by limited human workload, inaccurate diagnoses and invasive over-testing. To address this issue, we propose TriNet: a machine learning model for medical directives that automates first-line screening at triage for conditions requiring downstream testing for diagnosis confirmation. To verify screening potential, TriNet was trained on hospital triage data and achieved high positive predictive values in detecting pneumonia (0.86) and urinary tract infection (0.93). These models outperform current clinical benchmarks, indicating that machine-learning medical directives can offer cost-free, non-invasive screening with high s",
    "link": "http://arxiv.org/abs/2309.02604",
    "context": "Title: Screening of Pneumonia and Urinary Tract Infection at Triage using TriNet. (arXiv:2309.02604v1 [cs.LG])\nAbstract: Due to the steady rise in population demographics and longevity, emergency department visits are increasing across North America. As more patients visit the emergency department, traditional clinical workflows become overloaded and inefficient, leading to prolonged wait-times and reduced healthcare quality. One of such workflows is the triage medical directive, impeded by limited human workload, inaccurate diagnoses and invasive over-testing. To address this issue, we propose TriNet: a machine learning model for medical directives that automates first-line screening at triage for conditions requiring downstream testing for diagnosis confirmation. To verify screening potential, TriNet was trained on hospital triage data and achieved high positive predictive values in detecting pneumonia (0.86) and urinary tract infection (0.93). These models outperform current clinical benchmarks, indicating that machine-learning medical directives can offer cost-free, non-invasive screening with high s",
    "path": "papers/23/09/2309.02604.json",
    "total_tokens": 944,
    "translated_title": "在门诊挂号处使用TriNet进行肺炎和尿路感染筛查",
    "translated_abstract": "由于人口结构和寿命的稳定增长，北美的急诊科就诊人数不断增加。随着更多患者就诊，传统的临床工作流程变得负荷过重和低效，导致等待时间延长和医疗质量降低。其中一种工作流程是挂号医疗指导，受限于有限的人力工作量、不准确的诊断和侵入性的过度测试。为了解决这个问题，我们提出了TriNet：一种用于医疗指导的机器学习模型，可以在挂号处自动筛查出需要下游测试进行诊断确认的病症。为了验证筛查潜力，TriNet在医院挂号数据上进行了训练，并在检测肺炎（0.86）和尿路感染（0.93）方面取得了高的阳性预测值。这些模型优于当前的临床基准，表明机器学习医疗指导可以提供无成本、非侵入性的筛查。",
    "tldr": "TriNet是一种用于医疗指导的机器学习模型，可以在挂号处自动筛查出需要下游测试进行诊断确认的病症。这些模型优于当前的临床基准，表明机器学习医疗指导可以提供无成本、非侵入性的筛查。",
    "en_tdlr": "TriNet is a machine learning model for medical directives that automates first-line screening at triage for conditions requiring downstream testing for diagnosis confirmation. These models outperform current clinical benchmarks, indicating that machine-learning medical directives can offer cost-free, non-invasive screening."
}