{
    "title": "Parallel and Limited Data Voice Conversion Using Stochastic Variational Deep Kernel Learning. (arXiv:2309.04420v1 [cs.SD])",
    "abstract": "Typically, voice conversion is regarded as an engineering problem with limited training data. The reliance on massive amounts of data hinders the practical applicability of deep learning approaches, which have been extensively researched in recent years. On the other hand, statistical methods are effective with limited data but have difficulties in modelling complex mapping functions. This paper proposes a voice conversion method that works with limited data and is based on stochastic variational deep kernel learning (SVDKL). At the same time, SVDKL enables the use of deep neural networks' expressive capability as well as the high flexibility of the Gaussian process as a Bayesian and non-parametric method. When the conventional kernel is combined with the deep neural network, it is possible to estimate non-smooth and more complex functions. Furthermore, the model's sparse variational Gaussian process solves the scalability problem and, unlike the exact Gaussian process, allows for the ",
    "link": "http://arxiv.org/abs/2309.04420",
    "context": "Title: Parallel and Limited Data Voice Conversion Using Stochastic Variational Deep Kernel Learning. (arXiv:2309.04420v1 [cs.SD])\nAbstract: Typically, voice conversion is regarded as an engineering problem with limited training data. The reliance on massive amounts of data hinders the practical applicability of deep learning approaches, which have been extensively researched in recent years. On the other hand, statistical methods are effective with limited data but have difficulties in modelling complex mapping functions. This paper proposes a voice conversion method that works with limited data and is based on stochastic variational deep kernel learning (SVDKL). At the same time, SVDKL enables the use of deep neural networks' expressive capability as well as the high flexibility of the Gaussian process as a Bayesian and non-parametric method. When the conventional kernel is combined with the deep neural network, it is possible to estimate non-smooth and more complex functions. Furthermore, the model's sparse variational Gaussian process solves the scalability problem and, unlike the exact Gaussian process, allows for the ",
    "path": "papers/23/09/2309.04420.json",
    "total_tokens": 895,
    "translated_title": "并行且有限数据的声音转换使用随机变分深度核学习",
    "translated_abstract": "通常，声音转换被视为一个拥有有限训练数据的工程问题。对于大规模数据的依赖限制了深度学习方法在实际应用上的可行性，而这些方法在最近几年得到了广泛研究。另一方面，统计方法在有限数据上是有效的，但在建模复杂映射函数时存在困难。本文提出一种基于随机变分深度核学习（SVDKL）的能够适应有限数据的声音转换方法。同时，SVDKL既能利用深度神经网络的表达能力，又能利用高灵活性的高斯过程作为贝叶斯和非参数方法。当将传统核函数与深度神经网络结合时，可以估计非光滑且更复杂的函数。此外，模型的稀疏变分高斯过程解决了可扩展性问题，并且与精确高斯过程不同，可以进行近似计算。",
    "tldr": "该论文提出了一种基于随机变分深度核学习（SVDKL）的声音转换方法，能够适应有限数据，并利用深度神经网络和高斯过程的灵活性进行模型训练和复杂函数估计。",
    "en_tdlr": "This paper proposes a voice conversion method based on stochastic variational deep kernel learning (SVDKL), which can work with limited data and utilize the flexibility of deep neural networks and Gaussian process for model training and estimating complex functions."
}