{
    "title": "ResBit: Residual Bit Vector for Categorical Values. (arXiv:2309.17196v1 [cs.LG])",
    "abstract": "The one-hot vector has long been widely used in machine learning as a simple and generic method for representing discrete data. However, this method increases the number of dimensions linearly with the categorical data to be represented, which is problematic from the viewpoint of spatial computational complexity in deep learning, which requires a large amount of data. Recently, Analog Bits, a method for representing discrete data as a sequence of bits, was proposed on the basis of the high expressiveness of diffusion models. However, since the number of category types to be represented in a generation task is not necessarily at a power of two, there is a discrepancy between the range that Analog Bits can represent and the range represented as category data. If such a value is generated, the problem is that the original category value cannot be restored. To address this issue, we propose Residual Bit Vector (ResBit), which is a hierarchical bit representation. Although it is a general-p",
    "link": "http://arxiv.org/abs/2309.17196",
    "context": "Title: ResBit: Residual Bit Vector for Categorical Values. (arXiv:2309.17196v1 [cs.LG])\nAbstract: The one-hot vector has long been widely used in machine learning as a simple and generic method for representing discrete data. However, this method increases the number of dimensions linearly with the categorical data to be represented, which is problematic from the viewpoint of spatial computational complexity in deep learning, which requires a large amount of data. Recently, Analog Bits, a method for representing discrete data as a sequence of bits, was proposed on the basis of the high expressiveness of diffusion models. However, since the number of category types to be represented in a generation task is not necessarily at a power of two, there is a discrepancy between the range that Analog Bits can represent and the range represented as category data. If such a value is generated, the problem is that the original category value cannot be restored. To address this issue, we propose Residual Bit Vector (ResBit), which is a hierarchical bit representation. Although it is a general-p",
    "path": "papers/23/09/2309.17196.json",
    "total_tokens": 837,
    "translated_title": "ResBit: 基于残差位向量的离散值表示方法",
    "translated_abstract": "长期以来，独热编码向量一直广泛应用于机器学习中，作为一种简单且通用的表示离散数据的方法。然而，这种方法会导致维度随着要表示的离散数据线性增加，这在深度学习中视为空间计算复杂性的问题，而深度学习需要大量的数据。最近，基于扩散模型的高表达能力，提出了一种用位序列表示离散数据的方法，即Analog Bits。然而，由于在生成任务中要表示的类别类型数量不一定是2的幂次，导致Analog Bits能够表示的范围与类别数据的范围存在差异。如果生成了这样的值，问题就是无法恢复原始的类别值。为了解决这个问题，我们提出了残差位向量（ResBit），它是一种分层的位表示方法。",
    "tldr": "本论文提出了一种名为ResBit的残差位向量方法，用于解决在深度学习中表示离散数据维度增加和无法恢复原始类别值的问题。"
}