{
    "title": "Leveraging Speech PTM, Text LLM, and Emotional TTS for Speech Emotion Recognition. (arXiv:2309.10294v1 [cs.CL])",
    "abstract": "In this paper, we explored how to boost speech emotion recognition (SER) with the state-of-the-art speech pre-trained model (PTM), data2vec, text generation technique, GPT-4, and speech synthesis technique, Azure TTS. First, we investigated the representation ability of different speech self-supervised pre-trained models, and we found that data2vec has a good representation ability on the SER task. Second, we employed a powerful large language model (LLM), GPT-4, and emotional text-to-speech (TTS) model, Azure TTS, to generate emotionally congruent text and speech. We carefully designed the text prompt and dataset construction, to obtain the synthetic emotional speech data with high quality. Third, we studied different ways of data augmentation to promote the SER task with synthetic speech, including random mixing, adversarial training, transfer learning, and curriculum learning. Experiments and ablation studies on the IEMOCAP dataset demonstrate the effectiveness of our method, compar",
    "link": "http://arxiv.org/abs/2309.10294",
    "context": "Title: Leveraging Speech PTM, Text LLM, and Emotional TTS for Speech Emotion Recognition. (arXiv:2309.10294v1 [cs.CL])\nAbstract: In this paper, we explored how to boost speech emotion recognition (SER) with the state-of-the-art speech pre-trained model (PTM), data2vec, text generation technique, GPT-4, and speech synthesis technique, Azure TTS. First, we investigated the representation ability of different speech self-supervised pre-trained models, and we found that data2vec has a good representation ability on the SER task. Second, we employed a powerful large language model (LLM), GPT-4, and emotional text-to-speech (TTS) model, Azure TTS, to generate emotionally congruent text and speech. We carefully designed the text prompt and dataset construction, to obtain the synthetic emotional speech data with high quality. Third, we studied different ways of data augmentation to promote the SER task with synthetic speech, including random mixing, adversarial training, transfer learning, and curriculum learning. Experiments and ablation studies on the IEMOCAP dataset demonstrate the effectiveness of our method, compar",
    "path": "papers/23/09/2309.10294.json",
    "total_tokens": 882,
    "translated_title": "利用语音PTM、文本LLM和情感TTS进行语音情感识别",
    "translated_abstract": "本文探讨如何利用最先进的语音预训练模型(PTM)、data2vec、文本生成技术GPT-4以及语音合成技术Azure TTS来提升语音情感识别(SER)。首先，我们研究了不同的语音自监督预训练模型的表示能力，发现data2vec在SER任务上具有良好的表示能力。其次，我们采用了强大的大语言模型(GPT-4)和情感文本到语音(TTS)模型(Azure TTS)来生成情感一致的文本和语音。我们精心设计了文本提示和数据集构建，以获得质量高的合成情感语音数据。第三，我们研究了不同的数据增强方法来促进使用合成语音的SER任务，包括随机混合、对抗训练、迁移学习和课程学习。在IEMOCAP数据集上的实验和消融研究表明了我们方法的有效性。",
    "tldr": "本文利用语音预训练模型、文本生成技术和语音合成技术提升了语音情感识别的效果，并通过实验证明了方法的有效性。"
}