{
    "title": "News-driven Expectations and Volatility Clustering. (arXiv:2309.04876v1 [q-fin.GN])",
    "abstract": "Financial volatility obeys two fascinating empirical regularities that apply to various assets, on various markets, and on various time scales: it is fat-tailed (more precisely power-law distributed) and it tends to be clustered in time. Many interesting models have been proposed to account for these regularities, notably agent-based models, which mimic the two empirical laws through a complex mix of nonlinear mechanisms such as traders' switching between trading strategies in highly nonlinear way. This paper explains the two regularities simply in terms of traders' attitudes towards news, an explanation that follows almost by definition of the traditional dichotomy of financial market participants, investors versus speculators, whose behaviors are reduced to their simplest forms. Long-run investors' valuations of an asset are assumed to follow a news-driven random walk, thus capturing the investors' persistent, long memory of fundamental news. Short-term speculators' anticipated retur",
    "link": "http://arxiv.org/abs/2309.04876",
    "context": "Title: News-driven Expectations and Volatility Clustering. (arXiv:2309.04876v1 [q-fin.GN])\nAbstract: Financial volatility obeys two fascinating empirical regularities that apply to various assets, on various markets, and on various time scales: it is fat-tailed (more precisely power-law distributed) and it tends to be clustered in time. Many interesting models have been proposed to account for these regularities, notably agent-based models, which mimic the two empirical laws through a complex mix of nonlinear mechanisms such as traders' switching between trading strategies in highly nonlinear way. This paper explains the two regularities simply in terms of traders' attitudes towards news, an explanation that follows almost by definition of the traditional dichotomy of financial market participants, investors versus speculators, whose behaviors are reduced to their simplest forms. Long-run investors' valuations of an asset are assumed to follow a news-driven random walk, thus capturing the investors' persistent, long memory of fundamental news. Short-term speculators' anticipated retur",
    "path": "papers/23/09/2309.04876.json",
    "total_tokens": 853,
    "translated_title": "新闻驱动的期望与波动聚类",
    "translated_abstract": "金融波动遵循两个引人注目的经验规律，适用于各种资产、各个市场和各个时间尺度：它是尾重的（更准确地说是符合幂律分布），并且在时间上倾向于聚类。许多有趣的模型已被提出来解释这些规律，特别是基于代理人的模型，通过一种复杂的非线性机制来模拟这两个经验定律，例如交易者在高度非线性的方式下在交易策略之间的切换。本文简单地解释了这两个规律，只涉及交易者对新闻的态度，这种解释几乎是根据金融市场参与者的传统二分法来定义的，投资者与投机者，他们的行为被简化为最简单的形式。假设长期投资者对资产的估值遵循基于新闻的随机漫步，因此捕捉到了投资者对基本新闻的持久、长期的记忆。",
    "tldr": "本文通过简单解释交易者对新闻的态度，解释了金融市场中的两个规律：尾重分布和波动聚类。",
    "en_tdlr": "This paper explains two empirical regularities in financial markets, fat-tailed distribution and volatility clustering, by simply considering traders' attitudes towards news."
}