{
    "title": "Neural Lithography: Close the Design-to-Manufacturing Gap in Computational Optics with a 'Real2Sim' Learned Photolithography Simulator. (arXiv:2309.17343v1 [physics.optics])",
    "abstract": "We introduce neural lithography to address the 'design-to-manufacturing' gap in computational optics. Computational optics with large design degrees of freedom enable advanced functionalities and performance beyond traditional optics. However, the existing design approaches often overlook the numerical modeling of the manufacturing process, which can result in significant performance deviation between the design and the fabricated optics. To bridge this gap, we, for the first time, propose a fully differentiable design framework that integrates a pre-trained photolithography simulator into the model-based optical design loop. Leveraging a blend of physics-informed modeling and data-driven training using experimentally collected datasets, our photolithography simulator serves as a regularizer on fabrication feasibility during design, compensating for structure discrepancies introduced in the lithography process. We demonstrate the effectiveness of our approach through two typical tasks ",
    "link": "http://arxiv.org/abs/2309.17343",
    "context": "Title: Neural Lithography: Close the Design-to-Manufacturing Gap in Computational Optics with a 'Real2Sim' Learned Photolithography Simulator. (arXiv:2309.17343v1 [physics.optics])\nAbstract: We introduce neural lithography to address the 'design-to-manufacturing' gap in computational optics. Computational optics with large design degrees of freedom enable advanced functionalities and performance beyond traditional optics. However, the existing design approaches often overlook the numerical modeling of the manufacturing process, which can result in significant performance deviation between the design and the fabricated optics. To bridge this gap, we, for the first time, propose a fully differentiable design framework that integrates a pre-trained photolithography simulator into the model-based optical design loop. Leveraging a blend of physics-informed modeling and data-driven training using experimentally collected datasets, our photolithography simulator serves as a regularizer on fabrication feasibility during design, compensating for structure discrepancies introduced in the lithography process. We demonstrate the effectiveness of our approach through two typical tasks ",
    "path": "papers/23/09/2309.17343.json",
    "total_tokens": 896,
    "translated_title": "神经光刻：用\"Real2Sim\"学习到的光刻模拟器来消除计算光学中的设计到制造间隔",
    "translated_abstract": "我们引入神经光刻来解决计算光学中的“设计到制造”间隔问题。具有大设计自由度的计算光学可以实现超越传统光学的先进功能和性能。然而，现有的设计方法往往忽视了制造过程的数值建模，这可能导致设计和制造的光学器件之间存在显著性能差异。为了弥合这一差距，我们首次提出了一个完全可微分的设计框架，将经过预训练的光刻模拟器整合到基于模型的光学设计循环中。通过融合物理模拟建模和基于实验数据的训练，我们的光刻模拟器在设计过程中充当了制造可行性的正则化器，补偿了光刻过程中引入的结构差异。我们通过两个典型任务来证明我们方法的有效性。",
    "tldr": "本文提出了神经光刻技术来解决计算光学中的设计到制造间隔问题。通过将预训练的光刻模拟器整合到光学设计循环中，我们成功实现了光学器件的设计和制造的一致性。",
    "en_tdlr": "This paper introduces neural lithography to address the design-to-manufacturing gap in computational optics. By integrating a pre-trained photolithography simulator into the optical design loop, the proposed approach ensures consistency between design and fabrication of optical devices."
}