{
    "title": "A Survey of the Impact of Self-Supervised Pretraining for Diagnostic Tasks with Radiological Images. (arXiv:2309.02555v1 [cs.LG])",
    "abstract": "Self-supervised pretraining has been observed to be effective at improving feature representations for transfer learning, leveraging large amounts of unlabelled data. This review summarizes recent research into its usage in X-ray, computed tomography, magnetic resonance, and ultrasound imaging, concentrating on studies that compare self-supervised pretraining to fully supervised learning for diagnostic tasks such as classification and segmentation. The most pertinent finding is that self-supervised pretraining generally improves downstream task performance compared to full supervision, most prominently when unlabelled examples greatly outnumber labelled examples. Based on the aggregate evidence, recommendations are provided for practitioners considering using self-supervised learning. Motivated by limitations identified in current research, directions and practices for future study are suggested, such as integrating clinical knowledge with theoretically justified self-supervised learni",
    "link": "http://arxiv.org/abs/2309.02555",
    "context": "Title: A Survey of the Impact of Self-Supervised Pretraining for Diagnostic Tasks with Radiological Images. (arXiv:2309.02555v1 [cs.LG])\nAbstract: Self-supervised pretraining has been observed to be effective at improving feature representations for transfer learning, leveraging large amounts of unlabelled data. This review summarizes recent research into its usage in X-ray, computed tomography, magnetic resonance, and ultrasound imaging, concentrating on studies that compare self-supervised pretraining to fully supervised learning for diagnostic tasks such as classification and segmentation. The most pertinent finding is that self-supervised pretraining generally improves downstream task performance compared to full supervision, most prominently when unlabelled examples greatly outnumber labelled examples. Based on the aggregate evidence, recommendations are provided for practitioners considering using self-supervised learning. Motivated by limitations identified in current research, directions and practices for future study are suggested, such as integrating clinical knowledge with theoretically justified self-supervised learni",
    "path": "papers/23/09/2309.02555.json",
    "total_tokens": 829,
    "translated_title": "自监督预训练对放射学图像诊断任务的影响调研",
    "translated_abstract": "自监督预训练已被观察到在改进特征表示以进行迁移学习时非常有效，利用大量无标记数据。本综述总结了近期关于其在X光、计算机断层扫描、磁共振和超声成像中的应用的研究，重点是比较自监督预训练和完全监督学习在分类和分割等诊断任务中的表现。最重要的发现是，相对于完全监督，自监督预训练通常能够提高下游任务的性能，尤其是在无标记样本远远多于有标记样本时。根据综合证据，为考虑使用自监督学习的从业者提供了建议。鉴于当前研究中存在的限制，提出了未来研究的方向和做法，如将临床知识与理论上有充分证据支持的自监督学习相结合。",
    "tldr": "自监督预训练在放射学图像诊断任务中提高了下游任务性能，尤其在无标记样本远远多于有标记样本时。"
}