{
    "title": "New Bounds on the Accuracy of Majority Voting for Multi-Class Classification. (arXiv:2309.09564v1 [stat.ML])",
    "abstract": "Majority voting is a simple mathematical function that returns the value that appears most often in a set. As a popular decision fusion technique, the majority voting function (MVF) finds applications in resolving conflicts, where a number of independent voters report their opinions on a classification problem. Despite its importance and its various applications in ensemble learning, data crowd-sourcing, remote sensing, and data oracles for blockchains, the accuracy of the MVF for the general multi-class classification problem has remained unknown. In this paper, we derive a new upper bound on the accuracy of the MVF for the multi-class classification problem. More specifically, we show that under certain conditions, the error rate of the MVF exponentially decays toward zero as the number of independent voters increases. Conversely, the error rate of the MVF exponentially grows with the number of independent voters if these conditions are not met.  We first explore the problem for inde",
    "link": "http://arxiv.org/abs/2309.09564",
    "context": "Title: New Bounds on the Accuracy of Majority Voting for Multi-Class Classification. (arXiv:2309.09564v1 [stat.ML])\nAbstract: Majority voting is a simple mathematical function that returns the value that appears most often in a set. As a popular decision fusion technique, the majority voting function (MVF) finds applications in resolving conflicts, where a number of independent voters report their opinions on a classification problem. Despite its importance and its various applications in ensemble learning, data crowd-sourcing, remote sensing, and data oracles for blockchains, the accuracy of the MVF for the general multi-class classification problem has remained unknown. In this paper, we derive a new upper bound on the accuracy of the MVF for the multi-class classification problem. More specifically, we show that under certain conditions, the error rate of the MVF exponentially decays toward zero as the number of independent voters increases. Conversely, the error rate of the MVF exponentially grows with the number of independent voters if these conditions are not met.  We first explore the problem for inde",
    "path": "papers/23/09/2309.09564.json",
    "total_tokens": 935,
    "translated_title": "多类别分类的多数投票准确性的新界限",
    "translated_abstract": "多数投票是一种简单的数学函数，返回集合中出现最多的值。作为一种流行的决策融合技术，多数投票函数（MVF）在解决冲突、独立投票人就分类问题报告他们的观点方面有着各种应用。尽管它在集成学习、数据众包、遥感和区块链数据神谕等领域有重要应用，但多数投票函数在一般多类别分类问题上的准确性一直未知。在本文中，我们推导出多数投票函数在多类别分类问题上的新的准确性上界。具体而言，我们展示了在某些条件下，多数投票函数的错误率在独立投票人数量增加时以指数方式趋向于零。相反，如果不满足这些条件，多数投票函数的错误率将以指数方式增长。我们首先探讨了模型无偏性和独立投票人之间的关系，并进一步分析了多数投票函数在具体问题中的应用。",
    "tldr": "本论文研究了多数投票在多类别分类问题中的准确性，并推导出了新的准确性上界。研究发现，在满足一定条件的情况下，随着独立投票人数量的增加，多数投票函数的错误率将以指数方式趋向于零，否则将以指数方式增长。",
    "en_tdlr": "This paper investigates the accuracy of majority voting for multi-class classification and derives new upper bounds. The study finds that under certain conditions, the error rate of majority voting exponentially decays towards zero as the number of independent voters increases, otherwise it exponentially grows."
}