{
    "title": "Lamarck's Revenge: Inheritance of Learned Traits Can Make Robot Evolution Better. (arXiv:2309.13099v1 [cs.RO])",
    "abstract": "Evolutionary robot systems offer two principal advantages: an advanced way of developing robots through evolutionary optimization and a special research platform to conduct what-if experiments regarding questions about evolution. Our study sits at the intersection of these. We investigate the question ``What if the 18th-century biologist Lamarck was not completely wrong and individual traits learned during a lifetime could be passed on to offspring through inheritance?'' We research this issue through simulations with an evolutionary robot framework where morphologies (bodies) and controllers (brains) of robots are evolvable and robots also can improve their controllers through learning during their lifetime. Within this framework, we compare a Lamarckian system, where learned bits of the brain are inheritable, with a Darwinian system, where they are not. Analyzing simulations based on these systems, we obtain new insights about Lamarckian evolution dynamics and the interaction between",
    "link": "http://arxiv.org/abs/2309.13099",
    "context": "Title: Lamarck's Revenge: Inheritance of Learned Traits Can Make Robot Evolution Better. (arXiv:2309.13099v1 [cs.RO])\nAbstract: Evolutionary robot systems offer two principal advantages: an advanced way of developing robots through evolutionary optimization and a special research platform to conduct what-if experiments regarding questions about evolution. Our study sits at the intersection of these. We investigate the question ``What if the 18th-century biologist Lamarck was not completely wrong and individual traits learned during a lifetime could be passed on to offspring through inheritance?'' We research this issue through simulations with an evolutionary robot framework where morphologies (bodies) and controllers (brains) of robots are evolvable and robots also can improve their controllers through learning during their lifetime. Within this framework, we compare a Lamarckian system, where learned bits of the brain are inheritable, with a Darwinian system, where they are not. Analyzing simulations based on these systems, we obtain new insights about Lamarckian evolution dynamics and the interaction between",
    "path": "papers/23/09/2309.13099.json",
    "total_tokens": 841,
    "translated_title": "Lamarck的复仇：学习特征的遗传可以使机器人进化更好",
    "translated_abstract": "进化机器人系统提供了两个主要的优势：通过进化优化来发展机器人的先进方法和用于进行关于进化问题的假设实验的特殊研究平台。我们的研究处于这两者的交叉点上。我们通过进化机器人框架的模拟研究一个问题：“如果18世纪生物学家Lamarck并非完全错误，个体在一生中学习到的特征是否可以通过遗传传递给后代？”我们比较了一个Lamarckian系统（学习到的大脑部分可以遗传）和一个Darwinian系统（学习到的大脑部分不能遗传），并通过分析基于这些系统的模拟实验，获得了关于Lamarckian进化动力学以及遗传和学习之间相互作用的新见解。",
    "tldr": "本研究使用进化机器人模拟实验探索了18世纪生物学家Lamarck的遗传理论，发现个体通过学习获得的特征可以通过遗传传递给后代，这对进化动力学和遗传学有重要的新见解。",
    "en_tdlr": "This study explores Lamarck's inheritance theory by conducting evolutionary robot simulations and finds that traits acquired through learning can be inherited by offspring, providing important new insights for evolutionary dynamics and genetics."
}