{
    "title": "Framework based on complex networks to model and mine patient pathways. (arXiv:2309.14208v2 [cs.CY] UPDATED)",
    "abstract": "The automatic discovery of a model to represent the history of encounters of a group of patients with the healthcare system -- the so-called \"pathway of patients\" -- is a new field of research that supports clinical and organisational decisions to improve the quality and efficiency of the treatment provided. The pathways of patients with chronic conditions tend to vary significantly from one person to another, have repetitive tasks, and demand the analysis of multiple perspectives (interventions, diagnoses, medical specialities, among others) influencing the results. Therefore, modelling and mining those pathways is still a challenging task. In this work, we propose a framework comprising: (i) a pathway model based on a multi-aspect graph, (ii) a novel dissimilarity measurement to compare pathways taking the elapsed time into account, and (iii) a mining method based on traditional centrality measures to discover the most relevant steps of the pathways. We evaluated the framework using ",
    "link": "http://arxiv.org/abs/2309.14208",
    "context": "Title: Framework based on complex networks to model and mine patient pathways. (arXiv:2309.14208v2 [cs.CY] UPDATED)\nAbstract: The automatic discovery of a model to represent the history of encounters of a group of patients with the healthcare system -- the so-called \"pathway of patients\" -- is a new field of research that supports clinical and organisational decisions to improve the quality and efficiency of the treatment provided. The pathways of patients with chronic conditions tend to vary significantly from one person to another, have repetitive tasks, and demand the analysis of multiple perspectives (interventions, diagnoses, medical specialities, among others) influencing the results. Therefore, modelling and mining those pathways is still a challenging task. In this work, we propose a framework comprising: (i) a pathway model based on a multi-aspect graph, (ii) a novel dissimilarity measurement to compare pathways taking the elapsed time into account, and (iii) a mining method based on traditional centrality measures to discover the most relevant steps of the pathways. We evaluated the framework using ",
    "path": "papers/23/09/2309.14208.json",
    "total_tokens": 939,
    "translated_title": "基于复杂网络的框架用于建模和挖掘患者路径",
    "translated_abstract": "自动发现用于表示一组患者与医疗系统的接触历史的模型，即所谓的“患者路径”，是一项新的研究领域，它支持临床和组织决策，以提高提供的治疗质量和效率。慢性病患者的路径往往因人而异，有重复的任务，并需要分析多个方面（干预、诊断、医疗专业等），影响结果。因此，建模和挖掘这些路径仍然是一个具有挑战性的任务。在这项工作中，我们提出了一个框架，包括：（i）基于多方面图的路径模型，（ii）一种新的相似度测量方法，考虑了耗时，用于比较路径，并且（iii）基于传统中心度测量方法的挖掘方法，用于发现路径中最相关的步骤。我们使用实际医疗数据评估了这个框架。",
    "tldr": "该论文提出了一个基于复杂网络的框架，用于建模和挖掘患者路径。该框架包括路径模型、新的相似度测量方法和基于传统中心度的挖掘方法。评估结果表明该框架可有效应用于实际医疗数据分析。"
}