{
    "title": "Toward Robust Recommendation via Real-time Vicinal Defense. (arXiv:2309.17278v1 [cs.LG])",
    "abstract": "Recommender systems have been shown to be vulnerable to poisoning attacks, where malicious data is injected into the dataset to cause the recommender system to provide biased recommendations. To defend against such attacks, various robust learning methods have been proposed. However, most methods are model-specific or attack-specific, making them lack generality, while other methods, such as adversarial training, are oriented towards evasion attacks and thus have a weak defense strength in poisoning attacks.  In this paper, we propose a general method, Real-time Vicinal Defense (RVD), which leverages neighboring training data to fine-tune the model before making a recommendation for each user. RVD works in the inference phase to ensure the robustness of the specific sample in real-time, so there is no need to change the model structure and training process, making it more practical. Extensive experimental results demonstrate that RVD effectively mitigates targeted poisoning attacks acr",
    "link": "http://arxiv.org/abs/2309.17278",
    "context": "Title: Toward Robust Recommendation via Real-time Vicinal Defense. (arXiv:2309.17278v1 [cs.LG])\nAbstract: Recommender systems have been shown to be vulnerable to poisoning attacks, where malicious data is injected into the dataset to cause the recommender system to provide biased recommendations. To defend against such attacks, various robust learning methods have been proposed. However, most methods are model-specific or attack-specific, making them lack generality, while other methods, such as adversarial training, are oriented towards evasion attacks and thus have a weak defense strength in poisoning attacks.  In this paper, we propose a general method, Real-time Vicinal Defense (RVD), which leverages neighboring training data to fine-tune the model before making a recommendation for each user. RVD works in the inference phase to ensure the robustness of the specific sample in real-time, so there is no need to change the model structure and training process, making it more practical. Extensive experimental results demonstrate that RVD effectively mitigates targeted poisoning attacks acr",
    "path": "papers/23/09/2309.17278.json",
    "total_tokens": 856,
    "translated_title": "实时邻近防御方法在健壮推荐系统中的应用",
    "translated_abstract": "推荐系统容易受到攻击，恶意数据插入可以导致系统提供有偏见的推荐。为了应对这种攻击，提出了各种健壮的学习方法。然而，大多数方法都是特定于模型或特定于攻击的，缺乏广泛性，而其他方法（如对抗训练）侧重于逃逸攻击，在毒化攻击上有很弱的防御能力。本文提出了一种通用方法——实时邻近防御（RVD），它利用邻近的训练数据在为每个用户进行推荐之前对模型进行微调。RVD在推断阶段工作，以确保实时性样本的健壮性，因此无需更改模型结构和训练过程，更加实用。广泛的实验结果表明，RVD有效地减轻了有针对性的毒化攻击。",
    "tldr": "本研究提出了一种实时邻近防御方法（RVD），通过在推荐之前利用邻近的训练数据微调模型，以提高推荐系统对毒化攻击的防御能力。"
}