{
    "title": "Digital Disruptions & Inequality. (arXiv:2309.03532v1 [cs.SI])",
    "abstract": "Rising inequality is a critical concern for contemporary societies globally, to the extent that emerging high-growth economies such as China have identified common prosperity as a central goal. Yet, the role and mechanisms of digital disruptions as a cause of inequality and the effectiveness of existing remedies such as taxation, are poorly understood. Particularly the implications of the complex process of technological adoption that requires extensive social validation beyond weak ties. Similarly, the implications of globalization in the hyperconnected landscape of the 21st century remains unexplored.  This study aims to shed light in these multifaceted issues. Our findings indicate that network connectivity and the presence of wide bridges between clusters are pivotal factors. We also show the limited utility of taxation as a countermeasure against inequality. Interestingly, the research reveals that the strategic injection of small cohorts of entrepreneurs can expedite technology a",
    "link": "http://arxiv.org/abs/2309.03532",
    "context": "Title: Digital Disruptions & Inequality. (arXiv:2309.03532v1 [cs.SI])\nAbstract: Rising inequality is a critical concern for contemporary societies globally, to the extent that emerging high-growth economies such as China have identified common prosperity as a central goal. Yet, the role and mechanisms of digital disruptions as a cause of inequality and the effectiveness of existing remedies such as taxation, are poorly understood. Particularly the implications of the complex process of technological adoption that requires extensive social validation beyond weak ties. Similarly, the implications of globalization in the hyperconnected landscape of the 21st century remains unexplored.  This study aims to shed light in these multifaceted issues. Our findings indicate that network connectivity and the presence of wide bridges between clusters are pivotal factors. We also show the limited utility of taxation as a countermeasure against inequality. Interestingly, the research reveals that the strategic injection of small cohorts of entrepreneurs can expedite technology a",
    "path": "papers/23/09/2309.03532.json",
    "total_tokens": 778,
    "translated_title": "数字颠覆与不平等",
    "translated_abstract": "过去几十年来，不平等问题已经成为全球范围内现代社会的一个重要关注点。然而，数字颠覆作为不平等的原因以及现有解决方法（例如税收）的有效性，目前尚未得到深入理解。本研究旨在揭示数字颠覆对不平等的影响以及全球化背景下的相关问题。我们的研究发现，网络互联和集群之间的广泛桥梁是关键因素。此外，我们还发现税收在对抗不平等方面的效用有限。有趣的是，研究表明，注入小批创业者团队可以加速技术的推广。",
    "tldr": "数字颠覆是导致不平等的原因，现有解决方法如税收的效果有限。研究发现网络互联和集群之间的桥梁关系是关键因素。注入小批创业者团队可以加速技术的推广。",
    "en_tdlr": "Digital disruptions are a cause of inequality and existing remedies such as taxation have limited effectiveness. The presence of wide bridges between clusters and network connectivity are crucial factors. The strategic injection of small cohorts of entrepreneurs can expedite technology adoption."
}