{
    "title": "Will Sentiment Analysis Need Subculture? A New Data Augmentation Approach. (arXiv:2309.00178v1 [cs.CL])",
    "abstract": "The renowned proverb that \"The pen is mightier than the sword\" underscores the formidable influence wielded by text expressions in shaping sentiments. Indeed, well-crafted written can deeply resonate within cultures, conveying profound sentiments. Nowadays, the omnipresence of the Internet has fostered a subculture that congregates around the contemporary milieu. The subculture artfully articulates the intricacies of human feelings by ardently pursuing the allure of novelty, a fact that cannot be disregarded in the sentiment analysis. This paper strives to enrich data through the lens of subculture, to address the insufficient training data faced by sentiment analysis. To this end, a new approach of subculture-based data augmentation (SCDA) is proposed, which engenders six enhanced texts for each training text by leveraging the creation of six diverse subculture expression generators. The extensive experiments attest to the effectiveness and potential of SCDA. The results also shed lig",
    "link": "http://arxiv.org/abs/2309.00178",
    "context": "Title: Will Sentiment Analysis Need Subculture? A New Data Augmentation Approach. (arXiv:2309.00178v1 [cs.CL])\nAbstract: The renowned proverb that \"The pen is mightier than the sword\" underscores the formidable influence wielded by text expressions in shaping sentiments. Indeed, well-crafted written can deeply resonate within cultures, conveying profound sentiments. Nowadays, the omnipresence of the Internet has fostered a subculture that congregates around the contemporary milieu. The subculture artfully articulates the intricacies of human feelings by ardently pursuing the allure of novelty, a fact that cannot be disregarded in the sentiment analysis. This paper strives to enrich data through the lens of subculture, to address the insufficient training data faced by sentiment analysis. To this end, a new approach of subculture-based data augmentation (SCDA) is proposed, which engenders six enhanced texts for each training text by leveraging the creation of six diverse subculture expression generators. The extensive experiments attest to the effectiveness and potential of SCDA. The results also shed lig",
    "path": "papers/23/09/2309.00178.json",
    "total_tokens": 913,
    "translated_title": "情感分析是否需要亚文化？一种新的数据增强方法",
    "translated_abstract": "著名谚语“笔能胜过剑”强调了文字表达在塑造情感方面所具有的强大影响力。事实上，精心打造的文字可以在文化中产生深远共鸣，传达深刻的情感。如今，互联网的普及促成了围绕当代社会环境聚集的亚文化。亚文化通过热衷追求新奇来巧妙地表达人类情感的复杂性，这在情感分析中是不可忽视的事实。本文旨在通过亚文化的视角丰富数据，以解决情感分析面临的训练数据不足问题。为此，提出了一种基于亚文化的数据增强（SCDA）新方法，通过创建六种不同亚文化表达生成器，为每个训练文本生成六个增强文本。大量实验证实了SCDA的有效性和潜力。结果还揭示了该方法对提高情感分析性能的启示。",
    "tldr": "本文提出了一种新的数据增强方法SCDA，通过利用亚文化表达生成器为每个训练文本生成六个增强文本，以解决情感分析中面临的训练数据不足问题。实验证明了SCDA的有效性和潜力。",
    "en_tdlr": "This paper proposes a new data augmentation method, SCDA, which generates six enhanced texts for each training text by leveraging subculture expression generators to address the insufficient training data in sentiment analysis. The extensive experiments confirm the effectiveness and potential of SCDA."
}