{
    "title": "Self-Sustaining Multiple Access with Continual Deep Reinforcement Learning for Dynamic Metaverse Applications. (arXiv:2309.10177v1 [cs.NI])",
    "abstract": "The Metaverse is a new paradigm that aims to create a virtual environment consisting of numerous worlds, each of which will offer a different set of services. To deal with such a dynamic and complex scenario, considering the stringent quality of service requirements aimed at the 6th generation of communication systems (6G), one potential approach is to adopt self-sustaining strategies, which can be realized by employing Adaptive Artificial Intelligence (Adaptive AI) where models are continually re-trained with new data and conditions. One aspect of self-sustainability is the management of multiple access to the frequency spectrum. Although several innovative methods have been proposed to address this challenge, mostly using Deep Reinforcement Learning (DRL), the problem of adapting agents to a non-stationary environment has not yet been precisely addressed. This paper fills in the gap in the current literature by investigating the problem of multiple access in multi-channel environment",
    "link": "http://arxiv.org/abs/2309.10177",
    "context": "Title: Self-Sustaining Multiple Access with Continual Deep Reinforcement Learning for Dynamic Metaverse Applications. (arXiv:2309.10177v1 [cs.NI])\nAbstract: The Metaverse is a new paradigm that aims to create a virtual environment consisting of numerous worlds, each of which will offer a different set of services. To deal with such a dynamic and complex scenario, considering the stringent quality of service requirements aimed at the 6th generation of communication systems (6G), one potential approach is to adopt self-sustaining strategies, which can be realized by employing Adaptive Artificial Intelligence (Adaptive AI) where models are continually re-trained with new data and conditions. One aspect of self-sustainability is the management of multiple access to the frequency spectrum. Although several innovative methods have been proposed to address this challenge, mostly using Deep Reinforcement Learning (DRL), the problem of adapting agents to a non-stationary environment has not yet been precisely addressed. This paper fills in the gap in the current literature by investigating the problem of multiple access in multi-channel environment",
    "path": "papers/23/09/2309.10177.json",
    "total_tokens": 949,
    "translated_title": "自我维持的连续深度强化学习在动态元宇宙应用中的多重接入",
    "translated_abstract": "元宇宙是一个旨在创建由众多世界组成的虚拟环境的新范 Paradigm，其中每个世界将提供不同的服务。为了应对如此动态和复杂的场景，并考虑到针对第六代通信系统（6G）的严格服务质量要求，一种潜在的方法是采用自我维持策略，通过使用自适应人工智能（自适应AI）来实现，其中模型将不断地根据新的数据和条件进行重新训练。自我维持的一个方面是对频谱的多重接入进行管理。虽然已经提出了几种创新的方法来解决这个挑战，大多数方法使用深度强化学习（DRL），但是适应非稳态环境的代理机制问题尚未得到准确解决。本文通过研究多通道环境中的多重接入问题，填补了当前文献中的空白。",
    "tldr": "本文研究了动态元宇宙应用中的多重接入问题，在采用自适应人工智能和深度强化学习的基础上，通过连续训练来实现自我维持的策略。该研究填补了当前文献中对于适应非稳态环境的代理机制问题的研究空白。",
    "en_tdlr": "This paper investigates the problem of multiple access in dynamic metaverse applications and proposes a self-sustaining strategy based on adaptive artificial intelligence and deep reinforcement learning through continual training. The study fills the research gap on adapting agents to non-stationary environments in the current literature."
}