{
    "title": "Partial Transport for Point-Cloud Registration. (arXiv:2309.15787v1 [cs.CV])",
    "abstract": "Point cloud registration plays a crucial role in various fields, including robotics, computer graphics, and medical imaging. This process involves determining spatial relationships between different sets of points, typically within a 3D space. In real-world scenarios, complexities arise from non-rigid movements and partial visibility, such as occlusions or sensor noise, making non-rigid registration a challenging problem. Classic non-rigid registration methods are often computationally demanding, suffer from unstable performance, and, importantly, have limited theoretical guarantees. The optimal transport problem and its unbalanced variations (e.g., the optimal partial transport problem) have emerged as powerful tools for point-cloud registration, establishing a strong benchmark in this field. These methods view point clouds as empirical measures and provide a mathematically rigorous way to quantify the `correspondence' between (the transformed) source and target points. In this paper,",
    "link": "http://arxiv.org/abs/2309.15787",
    "context": "Title: Partial Transport for Point-Cloud Registration. (arXiv:2309.15787v1 [cs.CV])\nAbstract: Point cloud registration plays a crucial role in various fields, including robotics, computer graphics, and medical imaging. This process involves determining spatial relationships between different sets of points, typically within a 3D space. In real-world scenarios, complexities arise from non-rigid movements and partial visibility, such as occlusions or sensor noise, making non-rigid registration a challenging problem. Classic non-rigid registration methods are often computationally demanding, suffer from unstable performance, and, importantly, have limited theoretical guarantees. The optimal transport problem and its unbalanced variations (e.g., the optimal partial transport problem) have emerged as powerful tools for point-cloud registration, establishing a strong benchmark in this field. These methods view point clouds as empirical measures and provide a mathematically rigorous way to quantify the `correspondence' between (the transformed) source and target points. In this paper,",
    "path": "papers/23/09/2309.15787.json",
    "total_tokens": 931,
    "translated_title": "点云配准的部分转运",
    "translated_abstract": "点云配准在机器人、计算机图形学和医学图像等各个领域中起着关键作用。该过程涉及确定不同点集之间的空间关系，通常在3D空间内进行。在现实世界的情景中，由于非刚性动作和部分可见性（例如遮挡或传感器噪声）的复杂性，使得非刚性配准成为一个具有挑战性的问题。经典的非刚性配准方法通常计算复杂，并且具有不稳定的性能，更重要的是，其理论保证有限。最优输运问题及其非平衡变种（例如最优部分输运问题）已成为点云配准的强大工具，在该领域建立了一个强有力的基准。这些方法将点云视为经验度量，并提供了一种数学严格的方法来量化（变换的）源点和目标点之间的`对应关系'。在这篇论文中，我们提出了一种基于最优部分输运问题的点云配准方法。",
    "tldr": "本论文提出了一种基于最优部分输运问题的点云配准方法，该方法可以应对非刚性动作和部分可见性等实际场景中的复杂性。该方法将点云视为经验度量，并提供了一种数学严格的方法来量化源点和目标点之间的`对应关系'。",
    "en_tdlr": "This paper proposes a point-cloud registration method based on the optimal partial transport problem, which can handle complexities in real-world scenarios such as non-rigid movements and partial visibility. The method treats point clouds as empirical measures and provides a mathematically rigorous way to quantify the 'correspondence' between source and target points."
}