{
    "title": "DSLOT-NN: Digit-Serial Left-to-Right Neural Network Accelerator. (arXiv:2309.06019v1 [cs.AR])",
    "abstract": "We propose a Digit-Serial Left-tO-righT (DSLOT) arithmetic based processing technique called DSLOT-NN with aim to accelerate inference of the convolution operation in the deep neural networks (DNNs). The proposed work has the ability to assess and terminate the ineffective convolutions which results in massive power and energy savings. The processing engine is comprised of low-latency most-significant-digit-first (MSDF) (also called online) multipliers and adders that processes data from left-to-right, allowing the execution of subsequent operations in digit-pipelined manner. Use of online operators eliminates the need for the development of complex mechanism of identifying the negative activation, as the output with highest weight value is generated first, and the sign of the result can be identified as soon as first non-zero digit is generated. The precision of the online operators can be tuned at run-time, making them extremely useful in situations where accuracy can be compromised ",
    "link": "http://arxiv.org/abs/2309.06019",
    "context": "Title: DSLOT-NN: Digit-Serial Left-to-Right Neural Network Accelerator. (arXiv:2309.06019v1 [cs.AR])\nAbstract: We propose a Digit-Serial Left-tO-righT (DSLOT) arithmetic based processing technique called DSLOT-NN with aim to accelerate inference of the convolution operation in the deep neural networks (DNNs). The proposed work has the ability to assess and terminate the ineffective convolutions which results in massive power and energy savings. The processing engine is comprised of low-latency most-significant-digit-first (MSDF) (also called online) multipliers and adders that processes data from left-to-right, allowing the execution of subsequent operations in digit-pipelined manner. Use of online operators eliminates the need for the development of complex mechanism of identifying the negative activation, as the output with highest weight value is generated first, and the sign of the result can be identified as soon as first non-zero digit is generated. The precision of the online operators can be tuned at run-time, making them extremely useful in situations where accuracy can be compromised ",
    "path": "papers/23/09/2309.06019.json",
    "total_tokens": 863,
    "translated_title": "DSLOT-NN: 数字串行从左到右的神经网络加速器",
    "translated_abstract": "我们提出了一种名为DSLOT-NN的基于数字串行从左到右（DSLOT）算术处理技术，旨在加速深度神经网络（DNN）中的卷积运算推理。所提出的方法能够评估和终止无效的卷积操作，从而实现大规模的功耗和能量节省。处理引擎由低延迟的最高有效数字优先（MSDF）（也称为在线）乘法器和加法器组成，从左到右处理数据，允许后续操作以数字流水线方式执行。使用在线运算器消除了复杂的负激活识别机制的开发需求，因为首先生成具有最高权重值的输出，并且一旦生成第一个非零数字，即可识别结果的符号。在线运算器的精度可以在运行时进行调整，使其在可以牺牲精度的情况下极其有用。",
    "tldr": "DSLOT-NN是一种数字串行从左到右的神经网络加速器，可以加速深度神经网络中的卷积运算，并且通过评估和终止无效的卷积操作实现功耗和能量的大规模节省。"
}