{
    "title": "Inferring effective couplings with Restricted Boltzmann Machines. (arXiv:2309.02292v2 [cond-mat.dis-nn] UPDATED)",
    "abstract": "Generative models offer a direct way to model complex data. Among them, energy-based models provide us with a neural network model that aims to accurately reproduce all statistical correlations observed in the data at the level of the Boltzmann weight of the model. However, one challenge is to understand the physical interpretation of such models. In this study, we propose a simple solution by implementing a direct mapping between the energy function of the Restricted Boltzmann Machine and an effective Ising spin Hamiltonian that includes high-order interactions between spins. This mapping includes interactions of all possible orders, going beyond the conventional pairwise interactions typically considered in the inverse Ising approach, and allowing the description of complex datasets. Earlier works attempted to achieve this goal, but the proposed mappings did not do properly treat the complexity of the problem or did not contain direct prescriptions for practical application. To valid",
    "link": "http://arxiv.org/abs/2309.02292",
    "context": "Title: Inferring effective couplings with Restricted Boltzmann Machines. (arXiv:2309.02292v2 [cond-mat.dis-nn] UPDATED)\nAbstract: Generative models offer a direct way to model complex data. Among them, energy-based models provide us with a neural network model that aims to accurately reproduce all statistical correlations observed in the data at the level of the Boltzmann weight of the model. However, one challenge is to understand the physical interpretation of such models. In this study, we propose a simple solution by implementing a direct mapping between the energy function of the Restricted Boltzmann Machine and an effective Ising spin Hamiltonian that includes high-order interactions between spins. This mapping includes interactions of all possible orders, going beyond the conventional pairwise interactions typically considered in the inverse Ising approach, and allowing the description of complex datasets. Earlier works attempted to achieve this goal, but the proposed mappings did not do properly treat the complexity of the problem or did not contain direct prescriptions for practical application. To valid",
    "path": "papers/23/09/2309.02292.json",
    "total_tokens": 865,
    "translated_title": "使用受限玻尔兹曼机推断有效耦合",
    "translated_abstract": "生成模型为我们提供了一种直接建模复杂数据的方法。在这些模型中，基于能量的模型为我们提供了一个神经网络模型，旨在以模型的玻尔兹曼权重的水平准确重现数据中观察到的所有统计相关性。然而，一个挑战是理解这些模型的物理解释。在本研究中，我们通过实现受限玻尔兹曼机的能量函数与包含自旋之间高阶相互作用的有效伊辛自旋哈密顿量之间的直接映射，提出了一个简单的解决方案。这种映射包括所有可能阶的相互作用，超越了逆伊辛方法中通常考虑的传统二次相互作用，使其能够描述复杂的数据集。早期的研究试图实现这个目标，但所提出的映射没有正确处理问题的复杂性，或者没有具体的实际应用指导。",
    "tldr": "本研究通过实现受限玻尔兹曼机的能量函数与有效伊辛自旋哈密顿量之间的直接映射，提供了一种用于推断复杂数据中高阶相互作用的方法。",
    "en_tdlr": "This study proposes a method to infer high-order interactions in complex data by directly mapping the energy function of a Restricted Boltzmann Machine to an effective Ising spin Hamiltonian."
}