{
    "title": "BHASA: A Holistic Southeast Asian Linguistic and Cultural Evaluation Suite for Large Language Models. (arXiv:2309.06085v1 [cs.CL])",
    "abstract": "The rapid development of Large Language Models (LLMs) and the emergence of novel abilities with scale have necessitated the construction of holistic, diverse and challenging benchmarks such as HELM and BIG-bench. However, at the moment, most of these benchmarks focus only on performance in English and evaluations that include Southeast Asian (SEA) languages are few in number. We therefore propose BHASA, a holistic linguistic and cultural evaluation suite for LLMs in SEA languages. It comprises three components: (1) a NLP benchmark covering eight tasks across Natural Language Understanding (NLU), Generation (NLG) and Reasoning (NLR) tasks, (2) LINDSEA, a linguistic diagnostic toolkit that spans the gamut of linguistic phenomena including syntax, semantics and pragmatics, and (3) a cultural diagnostics dataset that probes for both cultural representation and sensitivity. For this preliminary effort, we implement the NLP benchmark only for Indonesian, Vietnamese, Thai and Tamil, and we on",
    "link": "http://arxiv.org/abs/2309.06085",
    "context": "Title: BHASA: A Holistic Southeast Asian Linguistic and Cultural Evaluation Suite for Large Language Models. (arXiv:2309.06085v1 [cs.CL])\nAbstract: The rapid development of Large Language Models (LLMs) and the emergence of novel abilities with scale have necessitated the construction of holistic, diverse and challenging benchmarks such as HELM and BIG-bench. However, at the moment, most of these benchmarks focus only on performance in English and evaluations that include Southeast Asian (SEA) languages are few in number. We therefore propose BHASA, a holistic linguistic and cultural evaluation suite for LLMs in SEA languages. It comprises three components: (1) a NLP benchmark covering eight tasks across Natural Language Understanding (NLU), Generation (NLG) and Reasoning (NLR) tasks, (2) LINDSEA, a linguistic diagnostic toolkit that spans the gamut of linguistic phenomena including syntax, semantics and pragmatics, and (3) a cultural diagnostics dataset that probes for both cultural representation and sensitivity. For this preliminary effort, we implement the NLP benchmark only for Indonesian, Vietnamese, Thai and Tamil, and we on",
    "path": "papers/23/09/2309.06085.json",
    "total_tokens": 972,
    "translated_title": "BHASA：面向大语言模型的东南亚语言和文化综合评估套件",
    "translated_abstract": "大型语言模型（LLM）的快速发展和规模带来的新能力使得构建全面、多样和具有挑战性的基准成为必要，如HELM和BIG-bench。然而，目前大部分基准只关注英语的表现，包括东南亚（SEA）语言的评估很少。因此，我们提出了BHASA，一个针对SEA语言的综合语言和文化评估套件。它包括三个组成部分：（1）涵盖自然语言理解（NLU）、生成（NLG）和推理（NLR）任务的NLP基准，共涵盖八个任务；（2）LINDSEA，一个跨越句法、语义和语用等各种语言现象的语言诊断工具包；（3）一份文化诊断数据集，旨在探索文化表达和敏感性。对于这个初步工作，我们只针对印度尼西亚语、越南语、泰语和泰米尔语实现了NLP基准。",
    "tldr": "BHASA是一个综合评估套件，用于评估大语言模型在东南亚语言和文化方面的表现。它包括NLP基准、语言诊断工具包和文化诊断数据集。目前，该套件的初步版本仅针对印度尼西亚语、越南语、泰语和泰米尔语实现。",
    "en_tdlr": "BHASA is a comprehensive evaluation suite for assessing the performance of large language models in Southeast Asian languages and cultures. It includes an NLP benchmark, a linguistic diagnostic toolkit, and a cultural diagnostics dataset. The initial version of the suite is implemented for Indonesian, Vietnamese, Thai, and Tamil."
}