{
    "title": "Electron Energy Regression in the CMS High-Granularity Calorimeter Prototype. (arXiv:2309.06582v1 [hep-ex])",
    "abstract": "We present a new publicly available dataset that contains simulated data of a novel calorimeter to be installed at the CERN Large Hadron Collider. This detector will have more than six-million channels with each channel capable of position, ionisation and precision time measurement. Reconstructing these events in an efficient way poses an immense challenge which is being addressed with the latest machine learning techniques. As part of this development a large prototype with 12,000 channels was built and a beam of high-energy electrons incident on it. Using machine learning methods we have reconstructed the energy of incident electrons from the energies of three-dimensional hits, which is known to some precision. By releasing this data publicly we hope to encourage experts in the application of machine learning to develop efficient and accurate image reconstruction of these electrons.",
    "link": "http://arxiv.org/abs/2309.06582",
    "context": "Title: Electron Energy Regression in the CMS High-Granularity Calorimeter Prototype. (arXiv:2309.06582v1 [hep-ex])\nAbstract: We present a new publicly available dataset that contains simulated data of a novel calorimeter to be installed at the CERN Large Hadron Collider. This detector will have more than six-million channels with each channel capable of position, ionisation and precision time measurement. Reconstructing these events in an efficient way poses an immense challenge which is being addressed with the latest machine learning techniques. As part of this development a large prototype with 12,000 channels was built and a beam of high-energy electrons incident on it. Using machine learning methods we have reconstructed the energy of incident electrons from the energies of three-dimensional hits, which is known to some precision. By releasing this data publicly we hope to encourage experts in the application of machine learning to develop efficient and accurate image reconstruction of these electrons.",
    "path": "papers/23/09/2309.06582.json",
    "total_tokens": 866,
    "translated_title": "CMS高精度量热器原型中的电子能量回归",
    "translated_abstract": "我们提出了一个新的公开的数据集，其中包含将安装在CERN大型强子对撞机上的一种新型量热器的模拟数据。该探测器将拥有超过600万个通道，每个通道都能够进行位置、电离和精确时间测量。以高效的方式重建这些事件是一个巨大的挑战，该挑战正在应用最新的机器学习技术进行解决。作为这一发展的一部分，我们建造了一个拥有12,000个通道的大型原型，并对其进行了高能电子束入射。利用机器学习方法，我们从三维点的能量重建了入射电子的能量，这些能量已知到一定的精度。通过公开发布这些数据，我们希望鼓励机器学习应用专家开发出高效准确的这些电子图像重建方法。",
    "tldr": "这项研究介绍了CMS高精度量热器原型中的电子能量回归，利用机器学习方法从三维点的能量重建入射电子的能量，并希望通过公开数据促进机器学习应用专家对电子图像重建的研究。"
}