{
    "title": "An Ensemble Score Filter for Tracking High-Dimensional Nonlinear Dynamical Systems. (arXiv:2309.00983v1 [stat.ML])",
    "abstract": "We propose an ensemble score filter (EnSF) for solving high-dimensional nonlinear filtering problems with superior accuracy. A major drawback of existing filtering methods, e.g., particle filters or ensemble Kalman filters, is the low accuracy in handling high-dimensional and highly nonlinear problems. EnSF attacks this challenge by exploiting the score-based diffusion model, defined in a pseudo-temporal domain, to characterizing the evolution of the filtering density. EnSF stores the information of the recursively updated filtering density function in the score function, in stead of storing the information in a set of finite Monte Carlo samples (used in particle filters and ensemble Kalman filters). Unlike existing diffusion models that train neural networks to approximate the score function, we develop a training-free score estimation that uses mini-batch-based Monte Carlo estimator to directly approximate the score function at any pseudo-spatial-temporal location, which provides suf",
    "link": "http://arxiv.org/abs/2309.00983",
    "context": "Title: An Ensemble Score Filter for Tracking High-Dimensional Nonlinear Dynamical Systems. (arXiv:2309.00983v1 [stat.ML])\nAbstract: We propose an ensemble score filter (EnSF) for solving high-dimensional nonlinear filtering problems with superior accuracy. A major drawback of existing filtering methods, e.g., particle filters or ensemble Kalman filters, is the low accuracy in handling high-dimensional and highly nonlinear problems. EnSF attacks this challenge by exploiting the score-based diffusion model, defined in a pseudo-temporal domain, to characterizing the evolution of the filtering density. EnSF stores the information of the recursively updated filtering density function in the score function, in stead of storing the information in a set of finite Monte Carlo samples (used in particle filters and ensemble Kalman filters). Unlike existing diffusion models that train neural networks to approximate the score function, we develop a training-free score estimation that uses mini-batch-based Monte Carlo estimator to directly approximate the score function at any pseudo-spatial-temporal location, which provides suf",
    "path": "papers/23/09/2309.00983.json",
    "total_tokens": 1006,
    "translated_title": "用于跟踪高维非线性动力系统的集成评分滤波器",
    "translated_abstract": "我们提出了一种集成评分滤波器（EnSF）来解决高维非线性滤波问题，并具有卓越的准确性。现有的滤波方法（如粒子滤波器或集成卡尔曼滤波器）在处理高维和高度非线性问题时存在低准确性的主要缺陷。EnSF通过利用基于评分的扩散模型，在伪时域中定义，来描述滤波密度的演化，从而攻克了这一挑战。EnSF在评分函数中存储了递归更新的滤波密度函数的信息，而不是在一组有限的蒙特卡罗样本中存储信息（用于粒子滤波器和集成卡尔曼滤波器）。与训练神经网络来近似评分函数的现有扩散模型不同，我们开发了一种无需训练的评分估计方法，使用基于小批量的蒙特卡罗估计器来直接近似任何伪空间-时间位置处的评分函数，从而提供了足够准确的估计。",
    "tldr": "我们提出了一种集成评分滤波器（EnSF），在处理高维非线性滤波问题时具有卓越的准确性。EnSF利用评分模型在伪时域中描述滤波密度的演化，并通过评分函数存储信息，相比于使用蒙特卡罗样本的粒子滤波器和集成卡尔曼滤波器具有更好的效果。",
    "en_tdlr": "We propose an ensemble score filter (EnSF) with superior accuracy for solving high-dimensional nonlinear filtering problems. EnSF exploits a score-based diffusion model to characterize the evolution of the filtering density in a pseudo-temporal domain, storing information in the score function instead of finite Monte Carlo samples used by existing methods. This approach provides accurate estimation without training neural networks."
}