{
    "title": "Abdominal multi-organ segmentation in CT using Swinunter. (arXiv:2309.16210v1 [eess.IV])",
    "abstract": "Abdominal multi-organ segmentation in computed tomography (CT) is crucial for many clinical applications including disease detection and treatment planning. Deep learning methods have shown unprecedented performance in this perspective. However, it is still quite challenging to accurately segment different organs utilizing a single network due to the vague boundaries of organs, the complex background, and the substantially different organ size scales. In this work we used make transformer-based model for training. It was found through previous years' competitions that basically all of the top 5 methods used CNN-based methods, which is likely due to the lack of data volume that prevents transformer-based methods from taking full advantage. The thousands of samples in this competition may enable the transformer-based model to have more excellent results. The results on the public validation set also show that the transformer-based model can achieve an acceptable result and inference time",
    "link": "http://arxiv.org/abs/2309.16210",
    "context": "Title: Abdominal multi-organ segmentation in CT using Swinunter. (arXiv:2309.16210v1 [eess.IV])\nAbstract: Abdominal multi-organ segmentation in computed tomography (CT) is crucial for many clinical applications including disease detection and treatment planning. Deep learning methods have shown unprecedented performance in this perspective. However, it is still quite challenging to accurately segment different organs utilizing a single network due to the vague boundaries of organs, the complex background, and the substantially different organ size scales. In this work we used make transformer-based model for training. It was found through previous years' competitions that basically all of the top 5 methods used CNN-based methods, which is likely due to the lack of data volume that prevents transformer-based methods from taking full advantage. The thousands of samples in this competition may enable the transformer-based model to have more excellent results. The results on the public validation set also show that the transformer-based model can achieve an acceptable result and inference time",
    "path": "papers/23/09/2309.16210.json",
    "total_tokens": 902,
    "translated_title": "使用Swinunter在CT中进行腹部多器官分割",
    "translated_abstract": "在计算机断层扫描（CT）中，腹部多器官分割对于许多临床应用非常重要，包括疾病检测和治疗计划。深度学习方法在这方面表现出了前所未有的性能。然而，由于器官的模糊边界、复杂的背景和不同尺度的器官大小差异，利用单一网络准确地分割不同器官仍然具有挑战性。在这项工作中，我们使用了基于transformer的模型进行训练。通过前几年的比赛发现，基本上所有前五名的方法都使用了基于CNN的方法，这可能是因为数据量不足，阻碍了transformer-based方法发挥其全部优势。本次比赛中的数千个样本可能使transformer-based模型获得更好的结果。公开验证集上的结果还表明，transformer-based模型可以达到可接受的结果和推理时间。",
    "tldr": "这项研究提出了使用Swinunter模型在CT中进行腹部多器官分割的方法。通过克服器官的模糊边界、复杂的背景和不同尺度的器官大小差异，该模型能够在公开验证集上取得令人满意的结果和较快的推理时间。"
}