{
    "title": "Towards Effective Semantic OOD Detection in Unseen Domains: A Domain Generalization Perspective. (arXiv:2309.10209v1 [cs.AI])",
    "abstract": "Two prevalent types of distributional shifts in machine learning are the covariate shift (as observed across different domains) and the semantic shift (as seen across different classes). Traditional OOD detection techniques typically address only one of these shifts. However, real-world testing environments often present a combination of both covariate and semantic shifts. In this study, we introduce a novel problem, semantic OOD detection across domains, which simultaneously addresses both distributional shifts. To this end, we introduce two regularization strategies: domain generalization regularization, which ensures semantic invariance across domains to counteract the covariate shift, and OOD detection regularization, designed to enhance OOD detection capabilities against the semantic shift through energy bounding. Through rigorous testing on three standard domain generalization benchmarks, our proposed framework showcases its superiority over conventional domain generalization app",
    "link": "http://arxiv.org/abs/2309.10209",
    "context": "Title: Towards Effective Semantic OOD Detection in Unseen Domains: A Domain Generalization Perspective. (arXiv:2309.10209v1 [cs.AI])\nAbstract: Two prevalent types of distributional shifts in machine learning are the covariate shift (as observed across different domains) and the semantic shift (as seen across different classes). Traditional OOD detection techniques typically address only one of these shifts. However, real-world testing environments often present a combination of both covariate and semantic shifts. In this study, we introduce a novel problem, semantic OOD detection across domains, which simultaneously addresses both distributional shifts. To this end, we introduce two regularization strategies: domain generalization regularization, which ensures semantic invariance across domains to counteract the covariate shift, and OOD detection regularization, designed to enhance OOD detection capabilities against the semantic shift through energy bounding. Through rigorous testing on three standard domain generalization benchmarks, our proposed framework showcases its superiority over conventional domain generalization app",
    "path": "papers/23/09/2309.10209.json",
    "total_tokens": 915,
    "translated_title": "面向未知领域的有效语义OOD检测：域泛化视角",
    "translated_abstract": "机器学习中两种常见的分布偏移是协变量偏移（观察到不同领域之间的差异）和语义偏移（观察到不同类别之间的差异）。传统的OOD检测技术通常只处理其中一种偏移。然而，真实世界的测试环境通常同时存在协变量偏移和语义偏移。在本研究中，我们引入了一个新的问题，即跨领域的语义OOD检测，同时解决了这两种分布偏移。为此，我们引入了两种正则化策略：域泛化正则化，确保域间语义不变以对抗协变量偏移，以及OOD检测正则化，通过能量限制来增强对语义偏移的OOD检测能力。通过在三个标准域泛化基准上进行严格测试，我们的提出的框架展示了其优于传统域泛化应用的优越性。",
    "tldr": "本研究提出了一个新的问题，即面向未知领域的语义OOD检测，通过引入域泛化正则化和OOD检测正则化策略，同时解决了协变量偏移和语义偏移问题。实验证明，该框架在三个标准域泛化基准上表现优于传统方法。",
    "en_tdlr": "This study introduces a novel problem of semantic OOD detection across domains, addressing both covariate and semantic shifts by introducing domain generalization regularization and OOD detection regularization strategies. Experimental results demonstrate the superiority of this framework over conventional approaches on three standard domain generalization benchmarks."
}