{
    "title": "Outlier-Insensitive Kalman Filtering: Theory and Applications",
    "abstract": "arXiv:2309.09505v2 Announce Type: replace-cross  Abstract: State estimation of dynamical systems from noisy observations is a fundamental task in many applications. It is commonly addressed using the linear Kalman filter (KF), whose performance can significantly degrade in the presence of outliers in the observations, due to the sensitivity of its convex quadratic objective function. To mitigate such behavior, outlier detection algorithms can be applied. In this work, we propose a parameter-free algorithm which mitigates the harmful effect of outliers while requiring only a short iterative process of the standard update step of the KF. To that end, we model each potential outlier as a normal process with unknown variance and apply online estimation through either expectation maximization or alternating maximization algorithms. Simulations and field experiment evaluations demonstrate competitive performance of our method, showcasing its robustness to outliers in filtering scenarios comp",
    "link": "https://arxiv.org/abs/2309.09505",
    "context": "Title: Outlier-Insensitive Kalman Filtering: Theory and Applications\nAbstract: arXiv:2309.09505v2 Announce Type: replace-cross  Abstract: State estimation of dynamical systems from noisy observations is a fundamental task in many applications. It is commonly addressed using the linear Kalman filter (KF), whose performance can significantly degrade in the presence of outliers in the observations, due to the sensitivity of its convex quadratic objective function. To mitigate such behavior, outlier detection algorithms can be applied. In this work, we propose a parameter-free algorithm which mitigates the harmful effect of outliers while requiring only a short iterative process of the standard update step of the KF. To that end, we model each potential outlier as a normal process with unknown variance and apply online estimation through either expectation maximization or alternating maximization algorithms. Simulations and field experiment evaluations demonstrate competitive performance of our method, showcasing its robustness to outliers in filtering scenarios comp",
    "path": "papers/23/09/2309.09505.json",
    "total_tokens": 941,
    "translated_title": "异常不敏感的卡尔曼滤波：理论和应用",
    "translated_abstract": "动态系统从噪声观测中进行状态估计是许多应用中的基本任务。通常使用线性卡尔曼滤波器（KF）来解决这个问题，但是由于其凸二次目标函数的敏感性，当观测中存在离群值时，其性能可能会显著降低。为了缓解这种情况，可以应用异常检测算法。本文提出了一种无参数算法，可以在只对KF的标准更新步骤进行短小的迭代过程时，减轻离群值的有害影响。为此，我们将每个潜在的离群值建模为具有未知方差的正态过程，并通过期望最大化或交替最大化算法进行在线估计。仿真和实地实验评估证明了我们方法的竞争性能，展示了其在滤波场景中对离群值的鲁棒性。",
    "tldr": "本文提出了一种异常不敏感的卡尔曼滤波算法，通过对标准更新步骤的短小迭代过程，减轻了离群值对滤波性能的有害影响。通过将每个潜在的离群值建模为具有未知方差的正态过程，并应用在线估计算法，该方法在滤波场景中表现出竞争性能且对离群值具有鲁棒性。",
    "en_tdlr": "This paper proposes an outlier-insensitive Kalman filtering algorithm that mitigates the harmful effect of outliers on filtering performance through a short iterative process of the standard update step. The algorithm models each potential outlier as a normal process with unknown variance and applies online estimation algorithms. It demonstrates competitive performance and robustness to outliers in filtering scenarios."
}