{
    "title": "Enhancing Multilingual Speech Recognition through Language Prompt Tuning and Frame-Level Language Adapter. (arXiv:2309.09443v2 [eess.AS] UPDATED)",
    "abstract": "Multilingual intelligent assistants, such as ChatGPT, have recently gained popularity. To further expand the applications of multilingual artificial intelligence assistants and facilitate international communication, it is essential to enhance the performance of multilingual speech recognition, which is a crucial component of speech interaction. In this paper, we propose two simple and parameter-efficient methods: language prompt tuning and frame-level language adapter, to respectively enhance language-configurable and language-agnostic multilingual speech recognition. Additionally, we explore the feasibility of integrating these two approaches using parameter-efficient fine-tuning methods. Our experiments demonstrate significant performance improvements across seven languages using our proposed methods.",
    "link": "http://arxiv.org/abs/2309.09443",
    "context": "Title: Enhancing Multilingual Speech Recognition through Language Prompt Tuning and Frame-Level Language Adapter. (arXiv:2309.09443v2 [eess.AS] UPDATED)\nAbstract: Multilingual intelligent assistants, such as ChatGPT, have recently gained popularity. To further expand the applications of multilingual artificial intelligence assistants and facilitate international communication, it is essential to enhance the performance of multilingual speech recognition, which is a crucial component of speech interaction. In this paper, we propose two simple and parameter-efficient methods: language prompt tuning and frame-level language adapter, to respectively enhance language-configurable and language-agnostic multilingual speech recognition. Additionally, we explore the feasibility of integrating these two approaches using parameter-efficient fine-tuning methods. Our experiments demonstrate significant performance improvements across seven languages using our proposed methods.",
    "path": "papers/23/09/2309.09443.json",
    "total_tokens": 692,
    "translated_title": "通过语言提示调整和帧级语言适配器提高多语言语音识别能力",
    "translated_abstract": "最近，多语言智能助手如ChatGPT变得越来越受欢迎。为了进一步扩大多语言人工智能助手的应用，并促进国际交流，提高多语言语音识别性能至关重要。本文提出了两种简单且参数高效的方法：语言提示调整和帧级语言适配器，分别用于增强可配置语言和语言无关的多语言语音识别。此外，我们还探索了使用参数高效微调方法集成这两种方法的可行性。我们的实验结果表明，使用我们提出的方法在七种语言上显著改善了性能。",
    "tldr": "通过语言提示调整和帧级语言适配器这两种简单且参数高效的方法，我们成功提高了多语言语音识别的性能。",
    "en_tdlr": "We enhanced multilingual speech recognition performance by using two simple and parameter-efficient methods: language prompt tuning and frame-level language adapter."
}