{
    "title": "Systemic risk in financial networks: the effects of asymptotic independence. (arXiv:2309.15511v1 [q-fin.RM])",
    "abstract": "Systemic risk measurements are important for the assessment of stability of complex financial systems. Empirical evidence indicates that returns from various financial assets have a heavy-tailed behavior; moreover, such returns often exhibit asymptotic tail independence, i.e., extreme values are less likely to occur simultaneously. Surprisingly, asymptotic tail independence in dimensions larger than two has received limited attention both theoretically, and as well for financial risk modeling. In this paper, we establish the notion of mutual asymptotic tail independence for general $d$-dimensions and compare it with the traditional notion of pairwise asymptotic independence. Furthermore, we consider a financial network model using a bipartite graph of banks and assets with portfolios of possibly overlapping heavy-tailed risky assets exhibiting various asymptotic tail (in)dependence behavior. For such models we provide precise asymptotic expressions for a variety of conditional tail ris",
    "link": "http://arxiv.org/abs/2309.15511",
    "context": "Title: Systemic risk in financial networks: the effects of asymptotic independence. (arXiv:2309.15511v1 [q-fin.RM])\nAbstract: Systemic risk measurements are important for the assessment of stability of complex financial systems. Empirical evidence indicates that returns from various financial assets have a heavy-tailed behavior; moreover, such returns often exhibit asymptotic tail independence, i.e., extreme values are less likely to occur simultaneously. Surprisingly, asymptotic tail independence in dimensions larger than two has received limited attention both theoretically, and as well for financial risk modeling. In this paper, we establish the notion of mutual asymptotic tail independence for general $d$-dimensions and compare it with the traditional notion of pairwise asymptotic independence. Furthermore, we consider a financial network model using a bipartite graph of banks and assets with portfolios of possibly overlapping heavy-tailed risky assets exhibiting various asymptotic tail (in)dependence behavior. For such models we provide precise asymptotic expressions for a variety of conditional tail ris",
    "path": "papers/23/09/2309.15511.json",
    "total_tokens": 1022,
    "translated_title": "金融网络中的系统性风险: 渐近独立的影响",
    "translated_abstract": "系统性风险度量对于评估复杂金融系统的稳定性至关重要。经验证据表明，各种金融资产的回报呈重尾行为；此外，这些回报经常表现出渐近尾部独立性，即极端值不太可能同时发生。令人惊讶的是，大于两个维度的渐近尾部独立性在理论上和金融风险建模上都受到了有限的关注。在本文中，我们建立了一般 $d$ 维度的互相渐近尾部独立性概念，并将其与传统的成对渐近独立性概念进行比较。此外，我们使用银行和资产的双分图构建了一个金融网络模型，其中资产组合可能存在重尾风险资产的重叠，展示了不同的渐近尾部独立性行为。对于此类模型，我们提供了各种条件尾部风险的精确渐近表达式。",
    "tldr": "该论文研究了金融网络中的系统性风险，特别关注了渐近尾部独立性的影响。通过建立一般维度的互相渐近尾部独立性概念，并与传统的成对渐近独立性进行比较，提供了金融风险建模的新视角。此外，通过构建银行和资产的双分图展示了资产组合的多样渐近尾部独立性行为，并提供了条件尾部风险的精确渐近表达式。",
    "en_tdlr": "This paper investigates systemic risk in financial networks, with a particular focus on the effects of asymptotic tail independence. It introduces the concept of mutual asymptotic tail independence in general dimensions and compares it with traditional pairwise asymptotic independence. It also presents a financial network model using a bipartite graph and provides precise asymptotic expressions for conditional tail risk."
}