{
    "title": "Distributionally-Informed Recommender System Evaluation. (arXiv:2309.05892v1 [cs.IR])",
    "abstract": "Current practice for evaluating recommender systems typically focuses on point estimates of user-oriented effectiveness metrics or business metrics, sometimes combined with additional metrics for considerations such as diversity and novelty. In this paper, we argue for the need for researchers and practitioners to attend more closely to various distributions that arise from a recommender system (or other information access system) and the sources of uncertainty that lead to these distributions. One immediate implication of our argument is that both researchers and practitioners must report and examine more thoroughly the distribution of utility between and within different stakeholder groups. However, distributions of various forms arise in many more aspects of the recommender systems experimental process, and distributional thinking has substantial ramifications for how we design, evaluate, and present recommender systems evaluation and research results. Leveraging and emphasizing dis",
    "link": "http://arxiv.org/abs/2309.05892",
    "context": "Title: Distributionally-Informed Recommender System Evaluation. (arXiv:2309.05892v1 [cs.IR])\nAbstract: Current practice for evaluating recommender systems typically focuses on point estimates of user-oriented effectiveness metrics or business metrics, sometimes combined with additional metrics for considerations such as diversity and novelty. In this paper, we argue for the need for researchers and practitioners to attend more closely to various distributions that arise from a recommender system (or other information access system) and the sources of uncertainty that lead to these distributions. One immediate implication of our argument is that both researchers and practitioners must report and examine more thoroughly the distribution of utility between and within different stakeholder groups. However, distributions of various forms arise in many more aspects of the recommender systems experimental process, and distributional thinking has substantial ramifications for how we design, evaluate, and present recommender systems evaluation and research results. Leveraging and emphasizing dis",
    "path": "papers/23/09/2309.05892.json",
    "total_tokens": 825,
    "translated_title": "基于分布信息的推荐系统评估",
    "translated_abstract": "当前推荐系统评估常常集中在用户效果指标或商业指标的点估计上，有时结合多样性和新颖性等其他指标。本文主张研究人员和从业者更加关注推荐系统（或其他信息访问系统）中产生的各种分布及导致这些分布的不确定性来源。我们的观点之一是，研究人员和从业者必须更全面地报告和研究不同利益相关者群体之间以及群体内的效用分布。然而，在推荐系统实验过程中，各种形式的分布都会出现，分布式思维对我们设计、评估和呈现推荐系统评估和研究结果有着重大影响。",
    "tldr": "本研究提出了基于分布信息的推荐系统评估的重要性，强调了研究人员和从业者需要更加关注推荐系统中产生的各种分布以及导致这些分布的不确定性来源。这对于设计、评估和呈现推荐系统的评估和研究结果具有重要影响。",
    "en_tdlr": "This study highlights the importance of distributionally-informed evaluation for recommender systems, emphasizing the need for researchers and practitioners to consider various distributions and sources of uncertainty in system performance. It has significant implications for the design, evaluation, and presentation of recommender systems research and evaluation results."
}