{
    "title": "Incentivizing Massive Unknown Workers for Budget-Limited Crowdsensing: From Off-Line and On-Line Perspectives. (arXiv:2309.12113v1 [cs.AI])",
    "abstract": "Although the uncertainties of the workers can be addressed by the standard Combinatorial Multi-Armed Bandit (CMAB) framework in existing proposals through a trade-off between exploration and exploitation, we may not have sufficient budget to enable the trade-off among the individual workers, especially when the number of the workers is huge while the budget is limited. Moreover, the standard CMAB usually assumes the workers always stay in the system, whereas the workers may join in or depart from the system over time, such that what we have learnt for an individual worker cannot be applied after the worker leaves. To address the above challenging issues, in this paper, we first propose an off-line Context-Aware CMAB-based Incentive (CACI) mechanism. We innovate in leveraging the exploration-exploitation trade-off in a elaborately partitioned context space instead of the individual workers, to effectively incentivize the massive unknown workers with very limited budget. We also extend t",
    "link": "http://arxiv.org/abs/2309.12113",
    "context": "Title: Incentivizing Massive Unknown Workers for Budget-Limited Crowdsensing: From Off-Line and On-Line Perspectives. (arXiv:2309.12113v1 [cs.AI])\nAbstract: Although the uncertainties of the workers can be addressed by the standard Combinatorial Multi-Armed Bandit (CMAB) framework in existing proposals through a trade-off between exploration and exploitation, we may not have sufficient budget to enable the trade-off among the individual workers, especially when the number of the workers is huge while the budget is limited. Moreover, the standard CMAB usually assumes the workers always stay in the system, whereas the workers may join in or depart from the system over time, such that what we have learnt for an individual worker cannot be applied after the worker leaves. To address the above challenging issues, in this paper, we first propose an off-line Context-Aware CMAB-based Incentive (CACI) mechanism. We innovate in leveraging the exploration-exploitation trade-off in a elaborately partitioned context space instead of the individual workers, to effectively incentivize the massive unknown workers with very limited budget. We also extend t",
    "path": "papers/23/09/2309.12113.json",
    "total_tokens": 914,
    "translated_title": "利用有限预算激励大规模未知工作者的众感知：从离线和在线视角考虑",
    "translated_abstract": "尽管现有的提案通过在探索和开发之间进行权衡来解决工作者的不确定性，标准的组合多臂赌博机（CMAB）框架可以解决工作者的不确定性，但当工作者数量巨大而预算有限时，可能无法对个体工作者进行权衡。此外，标准的CMAB通常假设工作者始终留在系统中，而工作者可能在时间上加入或离开系统，因此在工作者离开后，我们学到的对于单个工作者的知识无法应用。为了解决上述问题，本文首先提出了一种离线的基于上下文感知的CMAB激励（CACI）机制。我们创新地利用了一个精心划分的上下文空间中的探索-开发权衡，而不是针对个体工作者，以有效地激励具有非常有限预算的大规模未知工作者。",
    "tldr": "本文提出了一种离线的基于上下文感知的CMAB激励（CACI）机制，通过对一个精细划分的上下文空间中的探索-开发权衡，有效地激励具有非常有限预算的大规模未知工作者。",
    "en_tdlr": "This paper proposes an offline Context-Aware CMAB-based Incentive (CACI) mechanism to effectively incentivize the massive unknown workers with very limited budget by leveraging the exploration-exploitation trade-off in a elaborately partitioned context space instead of the individual workers."
}