{
    "title": "Characterizing Latent Perspectives of Media Houses Towards Public Figures. (arXiv:2309.06112v1 [cs.CL])",
    "abstract": "Media houses reporting on public figures, often come with their own biases stemming from their respective worldviews. A characterization of these underlying patterns helps us in better understanding and interpreting news stories. For this, we need diverse or subjective summarizations, which may not be amenable for classifying into predefined class labels. This work proposes a zero-shot approach for non-extractive or generative characterizations of person entities from a corpus using GPT-2. We use well-articulated articles from several well-known news media houses as a corpus to build a sound argument for this approach. First, we fine-tune a GPT-2 pre-trained language model with a corpus where specific person entities are characterized. Second, we further fine-tune this with demonstrations of person entity characterizations, created from a corpus of programmatically constructed characterizations. This twice fine-tuned model is primed with manual prompts consisting of entity names that w",
    "link": "http://arxiv.org/abs/2309.06112",
    "context": "Title: Characterizing Latent Perspectives of Media Houses Towards Public Figures. (arXiv:2309.06112v1 [cs.CL])\nAbstract: Media houses reporting on public figures, often come with their own biases stemming from their respective worldviews. A characterization of these underlying patterns helps us in better understanding and interpreting news stories. For this, we need diverse or subjective summarizations, which may not be amenable for classifying into predefined class labels. This work proposes a zero-shot approach for non-extractive or generative characterizations of person entities from a corpus using GPT-2. We use well-articulated articles from several well-known news media houses as a corpus to build a sound argument for this approach. First, we fine-tune a GPT-2 pre-trained language model with a corpus where specific person entities are characterized. Second, we further fine-tune this with demonstrations of person entity characterizations, created from a corpus of programmatically constructed characterizations. This twice fine-tuned model is primed with manual prompts consisting of entity names that w",
    "path": "papers/23/09/2309.06112.json",
    "total_tokens": 848,
    "translated_title": "揭示媒体对公众人物的潜在态度",
    "translated_abstract": "媒体报道公众人物往往受到各自世界观的偏见影响。对这些潜在模式的描述有助于我们更好地理解和解释新闻故事。为此，我们需要多样化或主观的总结，这可能不适合分类为预定义的类别标签。本研究提出了一种使用GPT-2从语料库中进行非摘要或生成性特征化人物实体的零-shot方法。我们使用了来自几家知名新闻媒体的明确文章作为语料库，为这种方法建立了一个有力的论证。首先，我们用特定的人物实体进行了GPT-2预训练语言模型微调，然后再用从程序构造的特征化语料库创建的人物实体特征化演示进一步微调它。最后，我们用手动提示的实体名称预热了这个经过两次微调的模型。",
    "tldr": "本研究提出了一种使用GPT-2从语料库中进行非摘要或生成性特征化人物实体的零-shot方法，用于揭示媒体对公众人物的潜在态度。",
    "en_tdlr": "This study proposes a zero-shot approach using GPT-2 to characterize person entities from a corpus non-extractively or generatively, aiming to uncover the latent perspectives of media houses towards public figures."
}