{
    "title": "A Spectral Theory of Neural Prediction and Alignment. (arXiv:2309.12821v1 [q-bio.NC])",
    "abstract": "The representations of neural networks are often compared to those of biological systems by performing regression between the neural network responses and those measured from biological systems. Many different state-of-the-art deep neural networks yield similar neural predictions, but it remains unclear how to differentiate among models that perform equally well at predicting neural responses. To gain insight into this, we use a recent theoretical framework that relates the generalization error from regression to the spectral bias of the model activations and the alignment of the neural responses onto the learnable subspace of the model. We extend this theory to the case of regression between model activations and neural responses, and define geometrical properties describing the error embedding geometry. We test a large number of deep neural networks that predict visual cortical activity and show that there are multiple types of geometries that result in low neural prediction error as",
    "link": "http://arxiv.org/abs/2309.12821",
    "context": "Title: A Spectral Theory of Neural Prediction and Alignment. (arXiv:2309.12821v1 [q-bio.NC])\nAbstract: The representations of neural networks are often compared to those of biological systems by performing regression between the neural network responses and those measured from biological systems. Many different state-of-the-art deep neural networks yield similar neural predictions, but it remains unclear how to differentiate among models that perform equally well at predicting neural responses. To gain insight into this, we use a recent theoretical framework that relates the generalization error from regression to the spectral bias of the model activations and the alignment of the neural responses onto the learnable subspace of the model. We extend this theory to the case of regression between model activations and neural responses, and define geometrical properties describing the error embedding geometry. We test a large number of deep neural networks that predict visual cortical activity and show that there are multiple types of geometries that result in low neural prediction error as",
    "path": "papers/23/09/2309.12821.json",
    "total_tokens": 911,
    "translated_title": "神经预测和对齐的光谱理论",
    "translated_abstract": "神经网络的表示经常通过将神经网络响应与生物系统测得的响应进行回归来进行比较。许多不同的先进神经网络产生了类似的神经预测，但仍然不清楚如何区分在预测神经响应方面表现相同的模型。为了深入了解这一点，我们使用了近期提出的理论框架，该框架将回归中的泛化误差与模型激活的光谱偏差和神经响应与可学习子空间之间的对齐联系起来。我们将这个理论扩展到了模型激活和神经响应之间的回归情况，并定义了描述误差嵌入几何性质的几何属性。我们测试了大量预测视觉皮层活动的深度神经网络，并展示了多种几何形状导致低神经预测误差的情况。",
    "tldr": "该论文提出了一个光谱理论，用于理解神经预测和对齐问题。通过研究模型激活的光谱偏差和神经响应与可学习子空间的对齐情况，我们可以获得深度神经网络的几何属性，并区分在神经预测方面表现相同的模型。"
}