{
    "title": "ASAP: Automated Sequence Planning for Complex Robotic Assembly with Physical Feasibility. (arXiv:2309.16909v1 [cs.RO])",
    "abstract": "The automated assembly of complex products requires a system that can automatically plan a physically feasible sequence of actions for assembling many parts together. In this paper, we present ASAP, a physics-based planning approach for automatically generating such a sequence for general-shaped assemblies. ASAP accounts for gravity to design a sequence where each sub-assembly is physically stable with a limited number of parts being held and a support surface. We apply efficient tree search algorithms to reduce the combinatorial complexity of determining such an assembly sequence. The search can be guided by either geometric heuristics or graph neural networks trained on data with simulation labels. Finally, we show the superior performance of ASAP at generating physically realistic assembly sequence plans on a large dataset of hundreds of complex product assemblies. We further demonstrate the applicability of ASAP on both simulation and real-world robotic setups. Project website: asa",
    "link": "http://arxiv.org/abs/2309.16909",
    "context": "Title: ASAP: Automated Sequence Planning for Complex Robotic Assembly with Physical Feasibility. (arXiv:2309.16909v1 [cs.RO])\nAbstract: The automated assembly of complex products requires a system that can automatically plan a physically feasible sequence of actions for assembling many parts together. In this paper, we present ASAP, a physics-based planning approach for automatically generating such a sequence for general-shaped assemblies. ASAP accounts for gravity to design a sequence where each sub-assembly is physically stable with a limited number of parts being held and a support surface. We apply efficient tree search algorithms to reduce the combinatorial complexity of determining such an assembly sequence. The search can be guided by either geometric heuristics or graph neural networks trained on data with simulation labels. Finally, we show the superior performance of ASAP at generating physically realistic assembly sequence plans on a large dataset of hundreds of complex product assemblies. We further demonstrate the applicability of ASAP on both simulation and real-world robotic setups. Project website: asa",
    "path": "papers/23/09/2309.16909.json",
    "total_tokens": 872,
    "translated_title": "ASAP: 自动化复杂机器人组装的物理可行性序列规划",
    "translated_abstract": "复杂产品的自动化组装需要一个系统能够自动规划一个物理可行的动作序列来组装多个部件。在本文中，我们提出了ASAP，一种基于物理的计划方法，用于自动生成一般形状组装的序列。ASAP考虑了重力，设计了一个序列，其中每个子组件在有限数量的零件被保持和支撑表面的情况下保持物理稳定。我们应用高效的树搜索算法来减少确定这样一个组装序列的组合复杂性。搜索可以由几何启发式或训练有模拟标签数据的图神经网络来引导。最后，我们展示了ASAP在数百个复杂产品组装的大型数据集上生成物理实际的组装序列规划的优越性能。我们进一步证明了ASAP在仿真和真实世界机器人设置上的适用性。",
    "tldr": "ASAP是一个基于物理的计划方法，用于自动生成一般形状组装的物理可行性序列。它通过考虑重力和使用高效的树搜索算法，能够在大型数据集上生成物理实际的组装序列规划，适用于仿真和真实世界机器人设置。"
}