{
    "title": "OSN-MDAD: Machine Translation Dataset for Arabic Multi-Dialectal Conversations on Online Social Media. (arXiv:2309.12137v1 [cs.CL])",
    "abstract": "While resources for English language are fairly sufficient to understand content on social media, similar resources in Arabic are still immature. The main reason that the resources in Arabic are insufficient is that Arabic has many dialects in addition to the standard version (MSA). Arabs do not use MSA in their daily communications; rather, they use dialectal versions. Unfortunately, social users transfer this phenomenon into their use of social media platforms, which in turn has raised an urgent need for building suitable AI models for language-dependent applications. Existing machine translation (MT) systems designed for MSA fail to work well with Arabic dialects. In light of this, it is necessary to adapt to the informal nature of communication on social networks by developing MT systems that can effectively handle the various dialects of Arabic. Unlike for MSA that shows advanced progress in MT systems, little effort has been exerted to utilize Arabic dialects for MT systems. Whil",
    "link": "http://arxiv.org/abs/2309.12137",
    "context": "Title: OSN-MDAD: Machine Translation Dataset for Arabic Multi-Dialectal Conversations on Online Social Media. (arXiv:2309.12137v1 [cs.CL])\nAbstract: While resources for English language are fairly sufficient to understand content on social media, similar resources in Arabic are still immature. The main reason that the resources in Arabic are insufficient is that Arabic has many dialects in addition to the standard version (MSA). Arabs do not use MSA in their daily communications; rather, they use dialectal versions. Unfortunately, social users transfer this phenomenon into their use of social media platforms, which in turn has raised an urgent need for building suitable AI models for language-dependent applications. Existing machine translation (MT) systems designed for MSA fail to work well with Arabic dialects. In light of this, it is necessary to adapt to the informal nature of communication on social networks by developing MT systems that can effectively handle the various dialects of Arabic. Unlike for MSA that shows advanced progress in MT systems, little effort has been exerted to utilize Arabic dialects for MT systems. Whil",
    "path": "papers/23/09/2309.12137.json",
    "total_tokens": 978,
    "translated_title": "OSN-MDAD：用于在线社交媒体上阿拉伯多方言对话的机器翻译数据集",
    "translated_abstract": "虽然英语资源在社交媒体上理解内容相对充足，但阿拉伯语的资源仍不足够成熟。阿拉伯语资源不足的主要原因是，阿拉伯语除了标准版本（MSA）外，还有许多方言。阿拉伯人在日常交流中不使用MSA，而是使用方言版本。不幸的是，社交媒体用户也将这种现象引入到他们对社交媒体平台的使用中，这进而引发了对于构建适用于语言相关应用的合适AI模型的迫切需求。现有为MSA设计的机器翻译（MT）系统无法很好地处理阿拉伯方言。鉴于此，有必要通过开发能够有效处理阿拉伯各种方言的MT系统来适应社交网络上的非正式交流方式。与在MT系统中对MSA显示出先进进展不同，利用阿拉伯方言进行MT系统的利用所付出的努力不多。",
    "tldr": "该论文介绍了一个用于阿拉伯多方言在线社交媒体对话的机器翻译数据集，指出了阿拉伯语资源不足的问题以及现有机器翻译系统在处理阿拉伯方言时的困难。该研究的重点在于开发能够有效处理阿拉伯各种方言的机器翻译系统。",
    "en_tdlr": "This paper presents a machine translation dataset for Arabic multi-dialectal conversations on online social media, highlighting the issue of insufficient Arabic language resources and the challenges faced by existing machine translation systems in handling Arabic dialects. The focus of the research is on developing machine translation systems that can effectively handle various Arabic dialects."
}