{
    "title": "OpportunityFinder: A Framework for Automated Causal Inference. (arXiv:2309.13103v1 [cs.LG])",
    "abstract": "We introduce OpportunityFinder, a code-less framework for performing a variety of causal inference studies with panel data for non-expert users. In its current state, OpportunityFinder only requires users to provide raw observational data and a configuration file. A pipeline is then triggered that inspects/processes data, chooses the suitable algorithm(s) to execute the causal study. It returns the causal impact of the treatment on the configured outcome, together with sensitivity and robustness results. Causal inference is widely studied and used to estimate the downstream impact of individual's interactions with products and features. It is common that these causal studies are performed by scientists and/or economists periodically. Business stakeholders are often bottle-necked on scientist or economist bandwidth to conduct causal studies. We offer OpportunityFinder as a solution for commonly performed causal studies with four key features: (1) easy to use for both Business Analysts a",
    "link": "http://arxiv.org/abs/2309.13103",
    "context": "Title: OpportunityFinder: A Framework for Automated Causal Inference. (arXiv:2309.13103v1 [cs.LG])\nAbstract: We introduce OpportunityFinder, a code-less framework for performing a variety of causal inference studies with panel data for non-expert users. In its current state, OpportunityFinder only requires users to provide raw observational data and a configuration file. A pipeline is then triggered that inspects/processes data, chooses the suitable algorithm(s) to execute the causal study. It returns the causal impact of the treatment on the configured outcome, together with sensitivity and robustness results. Causal inference is widely studied and used to estimate the downstream impact of individual's interactions with products and features. It is common that these causal studies are performed by scientists and/or economists periodically. Business stakeholders are often bottle-necked on scientist or economist bandwidth to conduct causal studies. We offer OpportunityFinder as a solution for commonly performed causal studies with four key features: (1) easy to use for both Business Analysts a",
    "path": "papers/23/09/2309.13103.json",
    "total_tokens": 988,
    "translated_title": "OpportunityFinder：一个自动因果推断的框架",
    "translated_abstract": "我们介绍了OpportunityFinder，一个无需编码的框架，用于为非专业用户进行各种面板数据的因果推断研究。在当前状态下，OpportunityFinder只需要用户提供原始观察数据和配置文件。然后触发一个流水线来检查/处理数据，选择适合的算法来执行因果研究。它返回处理的结果，包括治疗对预期结果的因果影响，以及敏感性和稳健性的结果。因果推断被广泛研究和用于估计个人与产品和特征相互作用的下游影响。通常这些因果研究是由科学家和/或经济学家定期进行的。业务利益相关者通常受限于科学家或经济学家进行因果研究的带宽。我们提供OpportunityFinder作为常见的因果研究的解决方案，具有四个关键特点：（1）易于使用，适用于业务分析师和决策者。(2)由于无编程需求，有效节省了科学家和经济学家的带宽。(3)它是一个端到端的系统，它可以负责数据处理、推断配置、推断评估等所有事情。(4)它提供了关于推断质量的统计和严格的敏感性和稳健性分析。",
    "tldr": "OpportunityFinder是一个无需编码的因果推断框架，可以帮助非专业用户进行各种面板数据的因果推断研究，节省科学家和经济学家的带宽，并提供统计和严格的敏感性和稳健性分析。",
    "en_tdlr": "OpportunityFinder is a code-less framework for causal inference studies with panel data, which allows non-expert users to easily conduct such studies. It saves the bandwidth of scientists and economists, and provides statistical and rigorous sensitivity and robustness analysis."
}