{
    "title": "A compendium of data sources for data science, machine learning, and artificial intelligence. (arXiv:2309.05682v1 [cs.LG])",
    "abstract": "Recent advances in data science, machine learning, and artificial intelligence, such as the emergence of large language models, are leading to an increasing demand for data that can be processed by such models. While data sources are application-specific, and it is impossible to produce an exhaustive list of such data sources, it seems that a comprehensive, rather than complete, list would still benefit data scientists and machine learning experts of all levels of seniority. The goal of this publication is to provide just such an (inevitably incomplete) list -- or compendium -- of data sources across multiple areas of applications, including finance and economics, legal (laws and regulations), life sciences (medicine and drug discovery), news sentiment and social media, retail and ecommerce, satellite imagery, and shipping and logistics, and sports.",
    "link": "http://arxiv.org/abs/2309.05682",
    "context": "Title: A compendium of data sources for data science, machine learning, and artificial intelligence. (arXiv:2309.05682v1 [cs.LG])\nAbstract: Recent advances in data science, machine learning, and artificial intelligence, such as the emergence of large language models, are leading to an increasing demand for data that can be processed by such models. While data sources are application-specific, and it is impossible to produce an exhaustive list of such data sources, it seems that a comprehensive, rather than complete, list would still benefit data scientists and machine learning experts of all levels of seniority. The goal of this publication is to provide just such an (inevitably incomplete) list -- or compendium -- of data sources across multiple areas of applications, including finance and economics, legal (laws and regulations), life sciences (medicine and drug discovery), news sentiment and social media, retail and ecommerce, satellite imagery, and shipping and logistics, and sports.",
    "path": "papers/23/09/2309.05682.json",
    "total_tokens": 798,
    "translated_title": "数据科学、机器学习和人工智能数据源大全",
    "translated_abstract": "数据科学、机器学习和人工智能的最新进展，如大型语言模型的出现，导致对可供这些模型处理的数据的需求不断增加。虽然数据源是应用特定的，无法列出详尽无遗的数据源列表，但一个全面而不完整的列表仍然有利于各级别的数据科学家和机器学习专家。本文的目标是提供这样一个（必然不完整的）列表，即跨多个应用领域的数据源大全或概览，包括金融和经济、法律（法律和法规）、生命科学（医学和药物发现）、新闻情绪和社交媒体、零售和电子商务、卫星图像以及航运和物流，以满足各种需求。",
    "tldr": "这篇论文提供了一个跨多个领域的数据源大全，包括金融、法律、生命科学、新闻社交等，以满足数据科学家和机器学习专家的需求。"
}