{
    "title": "On the Fine-Grained Hardness of Inverting Generative Models. (arXiv:2309.05795v1 [stat.ML])",
    "abstract": "The objective of generative model inversion is to identify a size-$n$ latent vector that produces a generative model output that closely matches a given target. This operation is a core computational primitive in numerous modern applications involving computer vision and NLP. However, the problem is known to be computationally challenging and NP-hard in the worst case. This paper aims to provide a fine-grained view of the landscape of computational hardness for this problem. We establish several new hardness lower bounds for both exact and approximate model inversion. In exact inversion, the goal is to determine whether a target is contained within the range of a given generative model. Under the strong exponential time hypothesis (SETH), we demonstrate that the computational complexity of exact inversion is lower bounded by $\\Omega(2^n)$ via a reduction from $k$-SAT; this is a strengthening of known results. For the more practically relevant problem of approximate inversion, the goal ",
    "link": "http://arxiv.org/abs/2309.05795",
    "context": "Title: On the Fine-Grained Hardness of Inverting Generative Models. (arXiv:2309.05795v1 [stat.ML])\nAbstract: The objective of generative model inversion is to identify a size-$n$ latent vector that produces a generative model output that closely matches a given target. This operation is a core computational primitive in numerous modern applications involving computer vision and NLP. However, the problem is known to be computationally challenging and NP-hard in the worst case. This paper aims to provide a fine-grained view of the landscape of computational hardness for this problem. We establish several new hardness lower bounds for both exact and approximate model inversion. In exact inversion, the goal is to determine whether a target is contained within the range of a given generative model. Under the strong exponential time hypothesis (SETH), we demonstrate that the computational complexity of exact inversion is lower bounded by $\\Omega(2^n)$ via a reduction from $k$-SAT; this is a strengthening of known results. For the more practically relevant problem of approximate inversion, the goal ",
    "path": "papers/23/09/2309.05795.json",
    "total_tokens": 945,
    "translated_title": "关于反转生成模型的细粒度难度",
    "translated_abstract": "生成模型反转的目标是识别一个大小为$n$的潜在向量，该向量能够产生与给定目标密切匹配的生成模型输出。这个问题在涉及计算机视觉和自然语言处理的许多现代应用中是核心的计算原语。然而，该问题在最坏情况下被认为是计算上具有挑战性和NP难解的。本文旨在提供对这个问题的计算难度的细粒度视图。我们针对精确和近似模型反转建立了几个新的难度下界。在精确反转中，目标是确定一个目标是否包含在给定生成模型的范围内。在强指数时间假设（SETH）下，我们通过从$k$-SAT的约简来证明，精确反转的计算复杂度下界为$\\Omega(2^n)$；这是已知结果的加强版。对于更具实际意义的近似反转问题，目标是寻找一个潜在向量，使得生成模型输出与给定目标尽可能接近。在这种情况下，我们证明了存在一个常数$\\gamma$，使得除非$\\text{NP}\\subseteq \\text{BPTIME}(2^{O(n^\\gamma)})$，否则近似反转问题的计算复杂度无法突破$\\Omega(2^{n/2})$。",
    "tldr": "本文提供了反转生成模型的计算难度的细粒度视图，建立了对精确和近似模型反转的新的难度下界。"
}