{
    "title": "Constant Approximation for Individual Preference Stable Clustering. (arXiv:2309.16840v1 [cs.DS])",
    "abstract": "Individual preference (IP) stability, introduced by Ahmadi et al. (ICML 2022), is a natural clustering objective inspired by stability and fairness constraints. A clustering is $\\alpha$-IP stable if the average distance of every data point to its own cluster is at most $\\alpha$ times the average distance to any other cluster. Unfortunately, determining if a dataset admits a $1$-IP stable clustering is NP-Hard. Moreover, before this work, it was unknown if an $o(n)$-IP stable clustering always \\emph{exists}, as the prior state of the art only guaranteed an $O(n)$-IP stable clustering. We close this gap in understanding and show that an $O(1)$-IP stable clustering always exists for general metrics, and we give an efficient algorithm which outputs such a clustering. We also introduce generalizations of IP stability beyond average distance and give efficient, near-optimal algorithms in the cases where we consider the maximum and minimum distances within and between clusters.",
    "link": "http://arxiv.org/abs/2309.16840",
    "context": "Title: Constant Approximation for Individual Preference Stable Clustering. (arXiv:2309.16840v1 [cs.DS])\nAbstract: Individual preference (IP) stability, introduced by Ahmadi et al. (ICML 2022), is a natural clustering objective inspired by stability and fairness constraints. A clustering is $\\alpha$-IP stable if the average distance of every data point to its own cluster is at most $\\alpha$ times the average distance to any other cluster. Unfortunately, determining if a dataset admits a $1$-IP stable clustering is NP-Hard. Moreover, before this work, it was unknown if an $o(n)$-IP stable clustering always \\emph{exists}, as the prior state of the art only guaranteed an $O(n)$-IP stable clustering. We close this gap in understanding and show that an $O(1)$-IP stable clustering always exists for general metrics, and we give an efficient algorithm which outputs such a clustering. We also introduce generalizations of IP stability beyond average distance and give efficient, near-optimal algorithms in the cases where we consider the maximum and minimum distances within and between clusters.",
    "path": "papers/23/09/2309.16840.json",
    "total_tokens": 1020,
    "translated_title": "个体偏好稳定聚类的常数逼近",
    "translated_abstract": "个体偏好稳定性是由Ahmadi等人（ICML 2022）引入的一种受到稳定性和公平性约束启发的自然聚类目标。如果每个数据点到其所属聚类的平均距离不超过到任何其他聚类的平均距离的$\\alpha$倍，则称聚类为$\\alpha$-个体偏好稳定。不幸的是，确定数据集是否存在$1$-个体偏好稳定的聚类是 NP-Hard 问题。此外，在本研究之前，是否总是存在$ o(n) $-个体偏好稳定的聚类是未知的，因为先前的最优结果只保证了$O(n)$-个体偏好稳定的聚类。我们填补了这个理解上的差距，并展示了对于一般的度量，总是存在$O(1)$-个体偏好稳定的聚类，并给出了一个高效的算法来输出这样的聚类。我们还引入了超过平均距离的个体偏好稳定的泛化，并在考虑聚类内部和聚类间的最大距离和最小距离的情况下给出了高效、近乎最优的算法。",
    "tldr": "本文提出了个体偏好稳定聚类的常数逼近算法，使得每个数据点到其所属聚类的平均距离不超过到任何其他聚类的平均距离的$\\alpha$倍，并且给出了泛化到超过平均距离的个体偏好稳定的算法。",
    "en_tdlr": "This paper presents a constant approximation algorithm for individual preference stable clustering, which ensures that the average distance of each data point to its own cluster is at most $\\alpha$ times the average distance to any other cluster. The paper also introduces generalizations of individual preference stability beyond average distance and provides efficient algorithms for considering maximum and minimum distances within and between clusters."
}