{
    "title": "A Health Monitoring System Based on Flexible Triboelectric Sensors for Intelligence Medical Internet of Things and its Applications in Virtual Reality. (arXiv:2309.07185v1 [eess.SP])",
    "abstract": "The Internet of Medical Things (IoMT) is a platform that combines Internet of Things (IoT) technology with medical applications, enabling the realization of precision medicine, intelligent healthcare, and telemedicine in the era of digitalization and intelligence. However, the IoMT faces various challenges, including sustainable power supply, human adaptability of sensors and the intelligence of sensors. In this study, we designed a robust and intelligent IoMT system through the synergistic integration of flexible wearable triboelectric sensors and deep learning-assisted data analytics. We embedded four triboelectric sensors into a wristband to detect and analyze limb movements in patients suffering from Parkinson's Disease (PD). By further integrating deep learning-assisted data analytics, we actualized an intelligent healthcare monitoring system for the surveillance and interaction of PD patients, which includes location/trajectory tracking, heart monitoring and identity recognition.",
    "link": "http://arxiv.org/abs/2309.07185",
    "context": "Title: A Health Monitoring System Based on Flexible Triboelectric Sensors for Intelligence Medical Internet of Things and its Applications in Virtual Reality. (arXiv:2309.07185v1 [eess.SP])\nAbstract: The Internet of Medical Things (IoMT) is a platform that combines Internet of Things (IoT) technology with medical applications, enabling the realization of precision medicine, intelligent healthcare, and telemedicine in the era of digitalization and intelligence. However, the IoMT faces various challenges, including sustainable power supply, human adaptability of sensors and the intelligence of sensors. In this study, we designed a robust and intelligent IoMT system through the synergistic integration of flexible wearable triboelectric sensors and deep learning-assisted data analytics. We embedded four triboelectric sensors into a wristband to detect and analyze limb movements in patients suffering from Parkinson's Disease (PD). By further integrating deep learning-assisted data analytics, we actualized an intelligent healthcare monitoring system for the surveillance and interaction of PD patients, which includes location/trajectory tracking, heart monitoring and identity recognition.",
    "path": "papers/23/09/2309.07185.json",
    "total_tokens": 954,
    "translated_title": "基于柔性摩擦电传感器的智能医疗物联网健康监测系统及其在虚拟现实中的应用",
    "translated_abstract": "医疗物联网（IoMT）是将物联网技术与医疗应用相结合的平台，实现了数字化和智能化时代的精准医学、智能医疗和远程医疗。然而，IoMT面临着可持续的电力供应、传感器的人体适应性和传感器的智能性等多种挑战。本研究通过柔性可穿戴摩擦电传感器和深度学习辅助数据分析的协同集成，设计了一种稳健而智能的IoMT系统。我们将四个摩擦电传感器嵌入到手环中，用于检测和分析帕金森病患者的肢体运动。通过进一步整合深度学习辅助数据分析，我们实现了一个智能医疗监测系统，包括位置/轨迹追踪、心率监测和身份识别，用于帕金森病患者的监测和互动。",
    "tldr": "本研究设计了一个基于柔性摩擦电传感器和深度学习的智能医疗物联网系统，用于帕金森病患者的监测和互动，包括位置/轨迹追踪、心率监测和身份识别。"
}