{
    "title": "Data-Driven Goal Recognition in Transhumeral Prostheses Using Process Mining Techniques. (arXiv:2309.08106v1 [cs.RO])",
    "abstract": "A transhumeral prosthesis restores missing anatomical segments below the shoulder, including the hand. Active prostheses utilize real-valued, continuous sensor data to recognize patient target poses, or goals, and proactively move the artificial limb. Previous studies have examined how well the data collected in stationary poses, without considering the time steps, can help discriminate the goals. In this case study paper, we focus on using time series data from surface electromyography electrodes and kinematic sensors to sequentially recognize patients' goals. Our approach involves transforming the data into discrete events and training an existing process mining-based goal recognition system. Results from data collected in a virtual reality setting with ten subjects demonstrate the effectiveness of our proposed goal recognition approach, which achieves significantly better precision and recall than the state-of-the-art machine learning techniques and is less confident when wrong, whi",
    "link": "http://arxiv.org/abs/2309.08106",
    "context": "Title: Data-Driven Goal Recognition in Transhumeral Prostheses Using Process Mining Techniques. (arXiv:2309.08106v1 [cs.RO])\nAbstract: A transhumeral prosthesis restores missing anatomical segments below the shoulder, including the hand. Active prostheses utilize real-valued, continuous sensor data to recognize patient target poses, or goals, and proactively move the artificial limb. Previous studies have examined how well the data collected in stationary poses, without considering the time steps, can help discriminate the goals. In this case study paper, we focus on using time series data from surface electromyography electrodes and kinematic sensors to sequentially recognize patients' goals. Our approach involves transforming the data into discrete events and training an existing process mining-based goal recognition system. Results from data collected in a virtual reality setting with ten subjects demonstrate the effectiveness of our proposed goal recognition approach, which achieves significantly better precision and recall than the state-of-the-art machine learning techniques and is less confident when wrong, whi",
    "path": "papers/23/09/2309.08106.json",
    "total_tokens": 906,
    "translated_title": "使用过程挖掘技术在肱上假肢中的数据驱动目标识别",
    "translated_abstract": "肱上假肢能够恢复手以下缺失的解剖结构。主动式假肢利用连续的传感器数据识别患者的目标姿势，并主动移动人工肢体。以往研究主要关注于如何利用静止姿势收集的数据来区分目标，而忽略了时间步长的考虑。在这个案例研究中，我们专注于使用来自肌电图电极和运动传感器的时间序列数据来顺序识别患者的目标。我们的方法是将数据转化为离散事件，并训练一个基于过程挖掘的现有目标识别系统。通过在虚拟现实环境中收集了十个受试者的数据，我们的目标识别方法证明了其有效性，相比于现有的机器学习技术，其精确度和召回率显著提高，并且在错误时不太自信。",
    "tldr": "该研究通过使用时间序列数据和过程挖掘技术，实现了在肱上假肢中的数据驱动目标识别。实验结果表明，该方法在精确度和召回率上显著优于机器学习技术，并且在错误时表现出较低的自信度。"
}