{
    "title": "BitCoin: Bidirectional Tagging and Supervised Contrastive Learning based Joint Relational Triple Extraction Framework. (arXiv:2309.11853v1 [cs.CL])",
    "abstract": "Relation triple extraction (RTE) is an essential task in information extraction and knowledge graph construction. Despite recent advancements, existing methods still exhibit certain limitations. They just employ generalized pre-trained models and do not consider the specificity of RTE tasks. Moreover, existing tagging-based approaches typically decompose the RTE task into two subtasks, initially identifying subjects and subsequently identifying objects and relations. They solely focus on extracting relational triples from subject to object, neglecting that once the extraction of a subject fails, it fails in extracting all triples associated with that subject. To address these issues, we propose BitCoin, an innovative Bidirectional tagging and supervised Contrastive learning based joint relational triple extraction framework. Specifically, we design a supervised contrastive learning method that considers multiple positives per anchor rather than restricting it to just one positive. Furt",
    "link": "http://arxiv.org/abs/2309.11853",
    "context": "Title: BitCoin: Bidirectional Tagging and Supervised Contrastive Learning based Joint Relational Triple Extraction Framework. (arXiv:2309.11853v1 [cs.CL])\nAbstract: Relation triple extraction (RTE) is an essential task in information extraction and knowledge graph construction. Despite recent advancements, existing methods still exhibit certain limitations. They just employ generalized pre-trained models and do not consider the specificity of RTE tasks. Moreover, existing tagging-based approaches typically decompose the RTE task into two subtasks, initially identifying subjects and subsequently identifying objects and relations. They solely focus on extracting relational triples from subject to object, neglecting that once the extraction of a subject fails, it fails in extracting all triples associated with that subject. To address these issues, we propose BitCoin, an innovative Bidirectional tagging and supervised Contrastive learning based joint relational triple extraction framework. Specifically, we design a supervised contrastive learning method that considers multiple positives per anchor rather than restricting it to just one positive. Furt",
    "path": "papers/23/09/2309.11853.json",
    "total_tokens": 898,
    "translated_title": "BitCoin: 基于双向标记和监督对比学习的联合关系三元组提取框架",
    "translated_abstract": "关系三元组提取是信息提取和知识图谱构建中的一项关键任务。尽管最近有了一些进展，但现有方法仍存在一定的局限性。它们仅使用泛化的预训练模型，并未考虑RTE任务的特殊性。此外，现有的基于标记的方法通常将RTE任务分解为两个子任务，首先识别主体，然后识别客体和关系。它们仅关注从主体到客体的关系三元组的提取，忽视了一旦主体提取失败，就无法提取与该主体相关的所有三元组的情况。为了解决这些问题，我们提出了BitCoin，这是一种创新的基于双向标记和监督对比学习的联合关系三元组提取框架。具体而言，我们设计了一种监督对比学习方法，该方法考虑了每个锚点的多个正例，而不仅仅限于一个正例。",
    "tldr": "BitCoin是一种创新的基于双向标记和监督对比学习的联合关系三元组提取框架，用于解决关系三元组提取中的问题和局限性。通过设计监督对比学习方法，考虑了每个锚点的多个正例，提高了提取的效果。",
    "en_tdlr": "BitCoin is an innovative framework for joint relational triple extraction based on bidirectional tagging and supervised contrastive learning. It addresses the limitations and challenges in relation triple extraction by considering multiple positives per anchor in a supervised contrastive learning method."
}