{
    "title": "Intergenerational Equity in Models of Climate Change Mitigation: Stochastic Interest Rates introduce Adverse Effects, but (Non-linear) Funding Costs can Improve Intergenerational Equity. (arXiv:2309.16186v1 [q-fin.MF])",
    "abstract": "Assessing the costs of climate change is essential to find efficient pathways for the transition to a net-zero emissions economy, which is necessary to stabilise global temperatures at any level. Evaluating benefits and costs of climate change mitigation the discount rate converting future damages and costs into net-present values influences timing of mitigation.  Here, we amend the DICE model with a stochastic interest rate model to consider uncertainty of discount rates in the future. Since the optimal abatement paths depends on interest rates, we assume a stochastic abatement model.  We show that the optimal stochastic abatement path can increase the intergenerational inequality with respect to cost and risk.  If we consider additionally that abatement costs may be funded via loans for which interest has to be paid, it is optimal to achieve net-zero earlier.  Here we show, that introducing funding of abatement cost reduces the variation of future cash-flows, which occur at different",
    "link": "http://arxiv.org/abs/2309.16186",
    "context": "Title: Intergenerational Equity in Models of Climate Change Mitigation: Stochastic Interest Rates introduce Adverse Effects, but (Non-linear) Funding Costs can Improve Intergenerational Equity. (arXiv:2309.16186v1 [q-fin.MF])\nAbstract: Assessing the costs of climate change is essential to find efficient pathways for the transition to a net-zero emissions economy, which is necessary to stabilise global temperatures at any level. Evaluating benefits and costs of climate change mitigation the discount rate converting future damages and costs into net-present values influences timing of mitigation.  Here, we amend the DICE model with a stochastic interest rate model to consider uncertainty of discount rates in the future. Since the optimal abatement paths depends on interest rates, we assume a stochastic abatement model.  We show that the optimal stochastic abatement path can increase the intergenerational inequality with respect to cost and risk.  If we consider additionally that abatement costs may be funded via loans for which interest has to be paid, it is optimal to achieve net-zero earlier.  Here we show, that introducing funding of abatement cost reduces the variation of future cash-flows, which occur at different",
    "path": "papers/23/09/2309.16186.json",
    "total_tokens": 925,
    "translated_title": "气候变化减缓模型中的代际公平：随机利率引入不利影响，但（非线性）融资成本可以改善代际公平。",
    "translated_abstract": "评估气候变化成本对于寻求向净零排放经济转型的有效路径至关重要，这对于稳定全球温度至任何水平都是必要的。考虑未来利率的不确定性，我们使用随机利率模型修正了DICE模型，来评估气候变化减缓的效益和成本。我们展示了最优的随机减排路径可能会增加与成本和风险相关的代际不平等。如果我们考虑到减排成本可能通过贷款来融资，那么更早实现净零是最优的选择。在这里，我们证明了引入减排成本融资可以降低未来现金流的变异性，这些现金流在不同的...",
    "tldr": "本论文通过引入随机利率模型和非线性融资成本来探讨气候变化减缓模型中的代际公平问题。研究结果表明，最优的随机减排路径可能会增加成本和风险相关的代际不平等，但通过融资成本的引入可以改善这种情况。"
}