{
    "title": "An Empirical Study of Attention Networks for Semantic Segmentation. (arXiv:2309.10217v1 [cs.CV])",
    "abstract": "Semantic segmentation is a vital problem in computer vision. Recently, a common solution to semantic segmentation is the end-to-end convolution neural network, which is much more accurate than traditional methods.Recently, the decoders based on attention achieve state-of-the-art (SOTA) performance on various datasets. But these networks always are compared with the mIoU of previous SOTA networks to prove their superiority and ignore their characteristics without considering the computation complexity and precision in various categories, which is essential for engineering applications. Besides, the methods to analyze the FLOPs and memory are not consistent between different networks, which makes the comparison hard to be utilized. What's more, various methods utilize attention in semantic segmentation, but the conclusion of these methods is lacking. This paper first conducts experiments to analyze their computation complexity and compare their performance. Then it summarizes suitable sc",
    "link": "http://arxiv.org/abs/2309.10217",
    "context": "Title: An Empirical Study of Attention Networks for Semantic Segmentation. (arXiv:2309.10217v1 [cs.CV])\nAbstract: Semantic segmentation is a vital problem in computer vision. Recently, a common solution to semantic segmentation is the end-to-end convolution neural network, which is much more accurate than traditional methods.Recently, the decoders based on attention achieve state-of-the-art (SOTA) performance on various datasets. But these networks always are compared with the mIoU of previous SOTA networks to prove their superiority and ignore their characteristics without considering the computation complexity and precision in various categories, which is essential for engineering applications. Besides, the methods to analyze the FLOPs and memory are not consistent between different networks, which makes the comparison hard to be utilized. What's more, various methods utilize attention in semantic segmentation, but the conclusion of these methods is lacking. This paper first conducts experiments to analyze their computation complexity and compare their performance. Then it summarizes suitable sc",
    "path": "papers/23/09/2309.10217.json",
    "total_tokens": 816,
    "translated_title": "一项关于语义分割注意力网络的实证研究",
    "translated_abstract": "语义分割是计算机视觉中一个重要的问题。最近，用于语义分割的端到端卷积神经网络成为了一种常见的解决方案，其准确性比传统方法更高。近期，基于注意力的解码器在各种数据集上取得了最先进的性能。然而，这些网络经常与以前的最先进网络的mIoU进行比较，以证明它们的优越性，而忽视了它们在各个类别中的计算复杂性和精度等特性，这对工程应用来说是至关重要的。此外，不同网络之间对FLOPs和内存进行分析的方法不一致，使得比较难以利用。此外，各种方法在语义分割中利用了注意力，但这些方法的结论却不明确。本文首先进行实验，分析它们的计算复杂性并比较它们的性能。然后总结了适合的方法。",
    "tldr": "本研究对语义分割中的注意力网络进行了实证研究，分析了它们的计算复杂性和性能，总结了适用的方法。",
    "en_tdlr": "This empirical study investigates attention networks for semantic segmentation, analyzing their computational complexity and performance, and summarizes suitable methods."
}