{
    "title": "Graph Neural Networks for Dynamic Modeling of Roller Bearing. (arXiv:2309.10418v1 [cs.LG])",
    "abstract": "In the presented work, we propose to apply the framework of graph neural networks (GNNs) to predict the dynamics of a rolling element bearing. This approach offers generalizability and interpretability, having the potential for scalable use in real-time operational digital twin systems for monitoring the health state of rotating machines. By representing the bearing's components as nodes in a graph, the GNN can effectively model the complex relationships and interactions among them. We utilize a dynamic spring-mass-damper model of a bearing to generate the training data for the GNN. In this model, discrete masses represent bearing components such as rolling elements, inner raceways, and outer raceways, while a Hertzian contact model is employed to calculate the forces between these components.  We evaluate the learning and generalization capabilities of the proposed GNN framework by testing different bearing configurations that deviate from the training configurations. Through this app",
    "link": "http://arxiv.org/abs/2309.10418",
    "context": "Title: Graph Neural Networks for Dynamic Modeling of Roller Bearing. (arXiv:2309.10418v1 [cs.LG])\nAbstract: In the presented work, we propose to apply the framework of graph neural networks (GNNs) to predict the dynamics of a rolling element bearing. This approach offers generalizability and interpretability, having the potential for scalable use in real-time operational digital twin systems for monitoring the health state of rotating machines. By representing the bearing's components as nodes in a graph, the GNN can effectively model the complex relationships and interactions among them. We utilize a dynamic spring-mass-damper model of a bearing to generate the training data for the GNN. In this model, discrete masses represent bearing components such as rolling elements, inner raceways, and outer raceways, while a Hertzian contact model is employed to calculate the forces between these components.  We evaluate the learning and generalization capabilities of the proposed GNN framework by testing different bearing configurations that deviate from the training configurations. Through this app",
    "path": "papers/23/09/2309.10418.json",
    "total_tokens": 920,
    "translated_title": "图神经网络在滚动轴承动力学建模中的应用",
    "translated_abstract": "在本文中，我们提出将图神经网络（GNN）框架应用于预测滚动轴承的动力学。这种方法具有普适性和可解释性，具有潜在的可扩展性，可用于实时运行的数字孪生系统，用于监测旋转机器的健康状态。通过将轴承的组件表示为图中的节点，GNN可以有效地模拟它们之间的复杂关系和相互作用。我们利用轴承的动态弹簧阻尼模型生成GNN的训练数据。在该模型中，离散的质量代表轴承的组件，如滚动体、内圈和外圈，而赫兹接触模型用于计算这些组件之间的力。我们通过测试不同于训练配置的轴承配置来评估所提出的GNN框架的学习和推广能力。",
    "tldr": "本文提出了将图神经网络应用于滚动轴承动力学建模的方法，通过将轴承的组件表示为图中的节点，GNN可以有效地模拟复杂的组件关系和相互作用。这种方法具有普适性和可解释性，在监测旋转机器的健康状态方面具有潜在的可扩展性。"
}