{
    "title": "Model Share AI: An Integrated Toolkit for Collaborative Machine Learning Model Development, Provenance Tracking, and Deployment in Python. (arXiv:2309.15719v1 [cs.SE])",
    "abstract": "Machine learning (ML) has the potential to revolutionize a wide range of research areas and industries, but many ML projects never progress past the proof-of-concept stage. To address this issue, we introduce Model Share AI (AIMS), an easy-to-use MLOps platform designed to streamline collaborative model development, model provenance tracking, and model deployment, as well as a host of other functions aiming to maximize the real-world impact of ML research. AIMS features collaborative project spaces and a standardized model evaluation process that ranks model submissions based on their performance on unseen evaluation data, enabling collaborative model development and crowd-sourcing. Model performance and various model metadata are automatically captured to facilitate provenance tracking and allow users to learn from and build on previous submissions. Additionally, AIMS allows users to deploy ML models built in Scikit-Learn, TensorFlow Keras, PyTorch, and ONNX into live REST APIs and au",
    "link": "http://arxiv.org/abs/2309.15719",
    "context": "Title: Model Share AI: An Integrated Toolkit for Collaborative Machine Learning Model Development, Provenance Tracking, and Deployment in Python. (arXiv:2309.15719v1 [cs.SE])\nAbstract: Machine learning (ML) has the potential to revolutionize a wide range of research areas and industries, but many ML projects never progress past the proof-of-concept stage. To address this issue, we introduce Model Share AI (AIMS), an easy-to-use MLOps platform designed to streamline collaborative model development, model provenance tracking, and model deployment, as well as a host of other functions aiming to maximize the real-world impact of ML research. AIMS features collaborative project spaces and a standardized model evaluation process that ranks model submissions based on their performance on unseen evaluation data, enabling collaborative model development and crowd-sourcing. Model performance and various model metadata are automatically captured to facilitate provenance tracking and allow users to learn from and build on previous submissions. Additionally, AIMS allows users to deploy ML models built in Scikit-Learn, TensorFlow Keras, PyTorch, and ONNX into live REST APIs and au",
    "path": "papers/23/09/2309.15719.json",
    "total_tokens": 913,
    "translated_title": "Model Share AI: 一个集成的Python工具包，用于协作式机器学习模型开发、来源追踪和部署",
    "translated_abstract": "机器学习（ML）有潜力彻底改变许多研究领域和行业，但许多ML项目从概念验证阶段就无法进一步发展。为了解决这个问题，我们引入了Model Share AI（AIMS），这是一个易于使用的MLOps平台，旨在简化协作模型开发、模型来源追踪和模型部署，以及一系列其他功能，以最大化ML研究的实际影响。AIMS具有协作项目空间和标准化的模型评估流程，根据模型在未见过的评估数据上的表现对模型提交进行排名，实现了协作模型开发和众包。自动捕获模型性能和各种模型元数据，以促进来源追踪并允许用户学习和借鉴之前的提交。此外，AIMS允许用户将在Scikit-Learn、TensorFlow Keras、PyTorch和ONNX中构建的ML模型部署到实时的REST API和au",
    "tldr": "Model Share AI是一个用于协作式机器学习模型开发、来源追踪和部署的集成工具包，提供了协作项目空间、标准化的模型评估流程和自动化的模型部署功能。"
}