{
    "title": "Compositional Sculpting of Iterative Generative Processes. (arXiv:2309.16115v1 [cs.LG])",
    "abstract": "High training costs of generative models and the need to fine-tune them for specific tasks have created a strong interest in model reuse and composition. A key challenge in composing iterative generative processes, such as GFlowNets and diffusion models, is that to realize the desired target distribution, all steps of the generative process need to be coordinated, and satisfy delicate balance conditions. In this work, we propose Compositional Sculpting: a general approach for defining compositions of iterative generative processes. We then introduce a method for sampling from these compositions built on classifier guidance. We showcase ways to accomplish compositional sculpting in both GFlowNets and diffusion models. We highlight two binary operations $\\unicode{x2014}$ the harmonic mean ($p_1 \\otimes p_2$) and the contrast ($p_1 \\unicode{x25D1}\\,p_2$) between pairs, and the generalization of these operations to multiple component distributions. We offer empirical results on image and m",
    "link": "http://arxiv.org/abs/2309.16115",
    "context": "Title: Compositional Sculpting of Iterative Generative Processes. (arXiv:2309.16115v1 [cs.LG])\nAbstract: High training costs of generative models and the need to fine-tune them for specific tasks have created a strong interest in model reuse and composition. A key challenge in composing iterative generative processes, such as GFlowNets and diffusion models, is that to realize the desired target distribution, all steps of the generative process need to be coordinated, and satisfy delicate balance conditions. In this work, we propose Compositional Sculpting: a general approach for defining compositions of iterative generative processes. We then introduce a method for sampling from these compositions built on classifier guidance. We showcase ways to accomplish compositional sculpting in both GFlowNets and diffusion models. We highlight two binary operations $\\unicode{x2014}$ the harmonic mean ($p_1 \\otimes p_2$) and the contrast ($p_1 \\unicode{x25D1}\\,p_2$) between pairs, and the generalization of these operations to multiple component distributions. We offer empirical results on image and m",
    "path": "papers/23/09/2309.16115.json",
    "total_tokens": 915,
    "translated_title": "迭代生成过程的组合塑造",
    "translated_abstract": "生成模型的高训练成本和为特定任务进行微调的需求，引发了对模型重用和组合的浓厚兴趣。组合迭代生成过程(如GFlowNets和扩散模型)的关键挑战在于，为了实现所需的目标分布，生成过程的所有步骤都需要协调，并满足微妙的平衡条件。本文提出了一种称为组合塑造的通用方法，用于定义迭代生成过程的组合。然后，我们介绍了一种基于分类器指导的从这些组合中进行采样的方法。我们展示了如何在GFlowNets和扩散模型中实现组合塑造。我们强调了两种二元运算——调和平均($p_1 \\otimes p_2$)和对比度($p_1 \\unicode{x25D1}\\,p_2$)之间的运算，以及将这些运算推广到多个组分分布的方法。我们提供了关于图像和...",
    "tldr": "本文提出了一种称为组合塑造的通用方法，用于定义迭代生成过程的组合，通过分类器指导实现对这些组合的采样。展示了在GFlowNets和扩散模型中实现组合塑造的方法，并提出了两种二元运算的推广。",
    "en_tdlr": "This paper proposes a general approach called Compositional Sculpting for defining compositions of iterative generative processes, and introduces a method for sampling from these compositions using classifier guidance. It showcases how to achieve compositional sculpting in GFlowNets and diffusion models and generalizes two binary operations."
}