{
    "title": "AIDPS:Adaptive Intrusion Detection and Prevention System for Underwater Acoustic Sensor Networks. (arXiv:2309.07730v1 [cs.CR])",
    "abstract": "Underwater Acoustic Sensor Networks (UW-ASNs) are predominantly used for underwater environments and find applications in many areas. However, a lack of security considerations, the unstable and challenging nature of the underwater environment, and the resource-constrained nature of the sensor nodes used for UW-ASNs (which makes them incapable of adopting security primitives) make the UW-ASN prone to vulnerabilities. This paper proposes an Adaptive decentralised Intrusion Detection and Prevention System called AIDPS for UW-ASNs. The proposed AIDPS can improve the security of the UW-ASNs so that they can efficiently detect underwater-related attacks (e.g., blackhole, grayhole and flooding attacks). To determine the most effective configuration of the proposed construction, we conduct a number of experiments using several state-of-the-art machine learning algorithms (e.g., Adaptive Random Forest (ARF), light gradient-boosting machine, and K-nearest neighbours) and concept drift detection",
    "link": "http://arxiv.org/abs/2309.07730",
    "context": "Title: AIDPS:Adaptive Intrusion Detection and Prevention System for Underwater Acoustic Sensor Networks. (arXiv:2309.07730v1 [cs.CR])\nAbstract: Underwater Acoustic Sensor Networks (UW-ASNs) are predominantly used for underwater environments and find applications in many areas. However, a lack of security considerations, the unstable and challenging nature of the underwater environment, and the resource-constrained nature of the sensor nodes used for UW-ASNs (which makes them incapable of adopting security primitives) make the UW-ASN prone to vulnerabilities. This paper proposes an Adaptive decentralised Intrusion Detection and Prevention System called AIDPS for UW-ASNs. The proposed AIDPS can improve the security of the UW-ASNs so that they can efficiently detect underwater-related attacks (e.g., blackhole, grayhole and flooding attacks). To determine the most effective configuration of the proposed construction, we conduct a number of experiments using several state-of-the-art machine learning algorithms (e.g., Adaptive Random Forest (ARF), light gradient-boosting machine, and K-nearest neighbours) and concept drift detection",
    "path": "papers/23/09/2309.07730.json",
    "total_tokens": 862,
    "translated_title": "AIDPS:自适应水声传感器网络入侵检测与防御系统",
    "translated_abstract": "水声传感器网络主要用于水下环境，并在许多领域中应用。然而，水下环境的不稳定和挑战性、传感器节点资源有限且缺乏安全考虑使得水声传感器网络容易受到攻击。本文提出一种自适应分布式的水声传感器网络入侵检测与防御系统（AIDPS），该系统可以提高水声传感器网络的安全性，有效地检测水下攻击。为确定所提出建筑的最有效配置，我们使用了几种先进的机器学习算法（如自适应随机森林（ARF）、轻量级梯度提升机和K近邻算法）和概念漂移检测进行了一系列实验。",
    "tldr": "本文提出了一个自适应的分布式水声传感器网络入侵检测与防御系统（AIDPS），该系统能够提高水声传感器网络的安全性，有效地检测水下相关攻击，并且通过使用多种机器学习算法进行实验证明了其有效性。",
    "en_tdlr": "The paper proposes an adaptive decentralized Intrusion Detection and Prevention System (AIDPS) for underwater acoustic sensor networks, which improves the network's security by efficiently detecting underwater-related attacks. Experimental results using various machine learning algorithms validate the effectiveness of the proposed system."
}