{
    "title": "DECORAIT -- DECentralized Opt-in/out Registry for AI Training. (arXiv:2309.14400v1 [cs.CR])",
    "abstract": "We present DECORAIT; a decentralized registry through which content creators may assert their right to opt in or out of AI training as well as receive reward for their contributions. Generative AI (GenAI) enables images to be synthesized using AI models trained on vast amounts of data scraped from public sources. Model and content creators who may wish to share their work openly without sanctioning its use for training are thus presented with a data governance challenge. Further, establishing the provenance of GenAI training data is important to creatives to ensure fair recognition and reward for their such use. We report a prototype of DECORAIT, which explores hierarchical clustering and a combination of on/off-chain storage to create a scalable decentralized registry to trace the provenance of GenAI training data in order to determine training consent and reward creatives who contribute that data. DECORAIT combines distributed ledger technology (DLT) with visual fingerprinting, lever",
    "link": "http://arxiv.org/abs/2309.14400",
    "context": "Title: DECORAIT -- DECentralized Opt-in/out Registry for AI Training. (arXiv:2309.14400v1 [cs.CR])\nAbstract: We present DECORAIT; a decentralized registry through which content creators may assert their right to opt in or out of AI training as well as receive reward for their contributions. Generative AI (GenAI) enables images to be synthesized using AI models trained on vast amounts of data scraped from public sources. Model and content creators who may wish to share their work openly without sanctioning its use for training are thus presented with a data governance challenge. Further, establishing the provenance of GenAI training data is important to creatives to ensure fair recognition and reward for their such use. We report a prototype of DECORAIT, which explores hierarchical clustering and a combination of on/off-chain storage to create a scalable decentralized registry to trace the provenance of GenAI training data in order to determine training consent and reward creatives who contribute that data. DECORAIT combines distributed ledger technology (DLT) with visual fingerprinting, lever",
    "path": "papers/23/09/2309.14400.json",
    "total_tokens": 935,
    "translated_title": "DECORAIT - 用于AI训练的去中心化选择加入/退出注册表",
    "translated_abstract": "我们介绍了DECORAIT：一个去中心化的注册表，通过该注册表，内容创作者可以表明他们选择加入或退出AI训练的权利，并为他们的贡献获得奖励。生成式AI（GenAI）使用在从公共来源中抓取的大量数据上训练的AI模型合成图像。这对于希望公开分享其作品而不认可其用于训练的模型和内容创作者来说，是一个数据治理的挑战。此外，确定GenAI训练数据的来源对于创意人来说是重要的，以确保对他们的使用得到公平的认可和奖励。我们报告了DECORAIT的原型，该原型通过探索分层聚类和on/off-chain存储的组合来创建一个可扩展的去中心化注册表，以追踪GenAI训练数据的来源，以确定训练同意并奖励贡献该数据的创意人。DECORAIT将分布式账本技术（DLT）与视觉指纹识别相结合。",
    "tldr": "DECORAIT是一个去中心化的注册表，为内容创作者提供选择加入或退出AI训练的权利，并通过组合分层聚类和on/off-chain存储的方式来追踪GenAI训练数据的来源，以确定训练同意并奖励贡献该数据的创意人。",
    "en_tdlr": "DECORAIT is a decentralized registry that provides content creators with the right to opt in or out of AI training, and tracks the provenance of GenAI training data through a combination of hierarchical clustering and on/off-chain storage to determine training consent and reward creators who contribute that data."
}