{
    "title": "BiSinger: Bilingual Singing Voice Synthesis. (arXiv:2309.14089v2 [eess.AS] UPDATED)",
    "abstract": "Although Singing Voice Synthesis (SVS) has made great strides with Text-to-Speech (TTS) techniques, multilingual singing voice modeling remains relatively unexplored. This paper presents BiSinger, a bilingual pop SVS system for English and Chinese Mandarin. Current systems require separate models per language and cannot accurately represent both Chinese and English, hindering code-switch SVS. To address this gap, we design a shared representation between Chinese and English singing voices, achieved by using the CMU dictionary with mapping rules. We fuse monolingual singing datasets with open-source singing voice conversion techniques to generate bilingual singing voices while also exploring the potential use of bilingual speech data. Experiments affirm that our language-independent representation and incorporation of related datasets enable a single model with enhanced performance in English and code-switch SVS while maintaining Chinese song performance. Audio samples are available at ",
    "link": "http://arxiv.org/abs/2309.14089",
    "context": "Title: BiSinger: Bilingual Singing Voice Synthesis. (arXiv:2309.14089v2 [eess.AS] UPDATED)\nAbstract: Although Singing Voice Synthesis (SVS) has made great strides with Text-to-Speech (TTS) techniques, multilingual singing voice modeling remains relatively unexplored. This paper presents BiSinger, a bilingual pop SVS system for English and Chinese Mandarin. Current systems require separate models per language and cannot accurately represent both Chinese and English, hindering code-switch SVS. To address this gap, we design a shared representation between Chinese and English singing voices, achieved by using the CMU dictionary with mapping rules. We fuse monolingual singing datasets with open-source singing voice conversion techniques to generate bilingual singing voices while also exploring the potential use of bilingual speech data. Experiments affirm that our language-independent representation and incorporation of related datasets enable a single model with enhanced performance in English and code-switch SVS while maintaining Chinese song performance. Audio samples are available at ",
    "path": "papers/23/09/2309.14089.json",
    "total_tokens": 894,
    "translated_title": "BiSinger: 双语合成歌声系统",
    "translated_abstract": "尽管文本到语音合成技术在歌声合成方面取得了很大的进展，但多语种合成歌声模型仍然相对较少探索。本文介绍了BiSinger，这是一个用于英语和汉语普通话的双语流行歌声合成系统。当前的系统需要分别针对每种语言进行建模，并且无法准确地表示汉语和英语，从而阻碍了混合编码歌声合成。为了解决这个问题，我们设计了一种汉语和英语歌声之间的共享表示，通过使用CMU字典和映射规则实现。我们使用开源歌声转换技术融合了单语歌声数据集，以生成双语歌声，同时还探索了双语言音数据的潜在用途。实验验证了我们的语言无关表示和相关数据集的整合使得单一模型在英语和混合编码歌声合成方面性能更好，同时保持了汉语歌曲的表现。音频样本可在某网址找到。",
    "tldr": "BiSinger是一个双语合成歌声系统，通过设计共享表示、融合数据集和使用开源技术，实现了一种可以进行英语和汉语普通话混合编码歌声合成的单一模型，并保持了汉语歌曲的表现。",
    "en_tdlr": "BiSinger is a bilingual singing voice synthesis system that utilizes a shared representation and incorporates bilingual datasets and open-source techniques to enable code-switch singing synthesis between English and Chinese Mandarin while maintaining the performance of Chinese songs."
}