{
    "title": "Exploring Large Language Models for Communication Games: An Empirical Study on Werewolf. (arXiv:2309.04658v1 [cs.CL])",
    "abstract": "Communication games, which we refer to as incomplete information games that heavily depend on natural language communication, hold significant research value in fields such as economics, social science, and artificial intelligence. In this work, we explore the problem of how to engage large language models (LLMs) in communication games, and in response, propose a tuning-free framework. Our approach keeps LLMs frozen, and relies on the retrieval and reflection on past communications and experiences for improvement. An empirical study on the representative and widely-studied communication game, ``Werewolf'', demonstrates that our framework can effectively play Werewolf game without tuning the parameters of the LLMs. More importantly, strategic behaviors begin to emerge in our experiments, suggesting that it will be a fruitful journey to engage LLMs in communication games and associated domains.",
    "link": "http://arxiv.org/abs/2309.04658",
    "context": "Title: Exploring Large Language Models for Communication Games: An Empirical Study on Werewolf. (arXiv:2309.04658v1 [cs.CL])\nAbstract: Communication games, which we refer to as incomplete information games that heavily depend on natural language communication, hold significant research value in fields such as economics, social science, and artificial intelligence. In this work, we explore the problem of how to engage large language models (LLMs) in communication games, and in response, propose a tuning-free framework. Our approach keeps LLMs frozen, and relies on the retrieval and reflection on past communications and experiences for improvement. An empirical study on the representative and widely-studied communication game, ``Werewolf'', demonstrates that our framework can effectively play Werewolf game without tuning the parameters of the LLMs. More importantly, strategic behaviors begin to emerge in our experiments, suggesting that it will be a fruitful journey to engage LLMs in communication games and associated domains.",
    "path": "papers/23/09/2309.04658.json",
    "total_tokens": 911,
    "translated_title": "探索大型语言模型在沟通游戏中的应用：对狼人杀的实证研究",
    "translated_abstract": "沟通游戏，我们把指依赖于自然语言交流的不完全信息游戏称为沟通游戏，在经济学、社会科学和人工智能等领域具有重要的研究价值。本文主要探讨如何在沟通游戏中应用大型语言模型（LLMs），并提出了一个无需调参的框架。我们的方法保持LLMs冻结状态，并利用过去的沟通和经验进行改进。对代表性且被广泛研究的沟通游戏“狼人杀”的实证研究表明，我们的框架可以在不调整LLMs参数的情况下有效地进行狼人杀游戏。更重要的是，我们的实验中出现了战略行为的迹象，这表明在沟通游戏和相关领域中使用LLMs将会是一次富有成果的旅程。",
    "tldr": "本研究探索了大型语言模型在沟通游戏中的应用，提出了一个无需调参的框架，并通过对狼人杀游戏的实证研究展示了其有效性和出现的战略行为。这表明在沟通游戏和相关领域中使用大型语言模型将具备潜在价值。",
    "en_tdlr": "This study explores the application of large language models in communication games, proposes a parameter-tuning-free framework, and demonstrates its effectiveness and emergence of strategic behaviors through empirical study on the game of Werewolf. It suggests the potential value of using large language models in communication games and related domains."
}