{
    "title": "Residual Scheduling: A New Reinforcement Learning Approach to Solving Job Shop Scheduling Problem. (arXiv:2309.15517v1 [cs.AI])",
    "abstract": "Job-shop scheduling problem (JSP) is a mathematical optimization problem widely used in industries like manufacturing, and flexible JSP (FJSP) is also a common variant. Since they are NP-hard, it is intractable to find the optimal solution for all cases within reasonable times. Thus, it becomes important to develop efficient heuristics to solve JSP/FJSP. A kind of method of solving scheduling problems is construction heuristics, which constructs scheduling solutions via heuristics. Recently, many methods for construction heuristics leverage deep reinforcement learning (DRL) with graph neural networks (GNN). In this paper, we propose a new approach, named residual scheduling, to solving JSP/FJSP. In this new approach, we remove irrelevant machines and jobs such as those finished, such that the states include the remaining (or relevant) machines and jobs only. Our experiments show that our approach reaches state-of-the-art (SOTA) among all known construction heuristics on most well-known",
    "link": "http://arxiv.org/abs/2309.15517",
    "context": "Title: Residual Scheduling: A New Reinforcement Learning Approach to Solving Job Shop Scheduling Problem. (arXiv:2309.15517v1 [cs.AI])\nAbstract: Job-shop scheduling problem (JSP) is a mathematical optimization problem widely used in industries like manufacturing, and flexible JSP (FJSP) is also a common variant. Since they are NP-hard, it is intractable to find the optimal solution for all cases within reasonable times. Thus, it becomes important to develop efficient heuristics to solve JSP/FJSP. A kind of method of solving scheduling problems is construction heuristics, which constructs scheduling solutions via heuristics. Recently, many methods for construction heuristics leverage deep reinforcement learning (DRL) with graph neural networks (GNN). In this paper, we propose a new approach, named residual scheduling, to solving JSP/FJSP. In this new approach, we remove irrelevant machines and jobs such as those finished, such that the states include the remaining (or relevant) machines and jobs only. Our experiments show that our approach reaches state-of-the-art (SOTA) among all known construction heuristics on most well-known",
    "path": "papers/23/09/2309.15517.json",
    "total_tokens": 875,
    "translated_title": "残差调度：解决工作车间调度问题的一种新的强化学习方法",
    "translated_abstract": "工作车间调度问题（JSP）是一种在制造业等行业广泛应用的数学优化问题，而灵活的JSP（FJSP）则是一种常见的变体。由于它们是NP-hard问题，很难在合理时间内找到所有情况的最优解，因此开发高效的启发式算法来解决JSP/FJSP问题变得非常重要。最近，很多构建启发式算法的方法都使用了深度强化学习（DRL）和图神经网络（GNN）。在本文中，我们提出了一种名为残差调度的新方法来解决JSP/FJSP问题。在这种新方法中，我们移除了不相关的机器和作业，例如已完成的机器和作业，以便状态仅包含剩下的（或相关的）机器和作业。我们的实验证明，我们的方法在大多数知名的构建启发式算法中达到了最先进的水平。",
    "tldr": "残差调度是一种新的强化学习方法，用于解决工作车间调度问题。通过移除不相关的机器和作业，该方法能够达到最先进的水平。",
    "en_tdlr": "Residual Scheduling is a new reinforcement learning approach to solving the job-shop scheduling problem. By removing irrelevant machines and jobs, this method achieves state-of-the-art performance in most cases."
}