{
    "title": "Non-transitivity of the Win Ratio and Area Under the Receiver Operating Characteristics Curve (AUC): a case for evaluating the strength of stochastic comparisons. (arXiv:2309.01791v1 [stat.ME])",
    "abstract": "The win ratio (WR) is a novel statistic used in randomized controlled trials that can account for hierarchies within event outcomes. In this paper we report and study the long-run non-transitive behavior of the win ratio and the closely related Area Under the Receiver Operating Characteristics Curve (AUC) and argue that their transitivity cannot be taken for granted. Crucially, traditional within-group statistics (i.e., comparison of means) are always transitive, while the WR can detect non-transitivity. Non-transitivity provides valuable information on the stochastic relationship between two treatment groups, which should be tested and reported. We specify the necessary conditions for transitivity, the sufficient conditions for non-transitivity and demonstrate non-transitivity in a real-life large randomized controlled trial for the WR of time-to-death. Our results can be used to rule out or evaluate possibility of non-transitivity and show the importance of studying the strength of s",
    "link": "http://arxiv.org/abs/2309.01791",
    "context": "Title: Non-transitivity of the Win Ratio and Area Under the Receiver Operating Characteristics Curve (AUC): a case for evaluating the strength of stochastic comparisons. (arXiv:2309.01791v1 [stat.ME])\nAbstract: The win ratio (WR) is a novel statistic used in randomized controlled trials that can account for hierarchies within event outcomes. In this paper we report and study the long-run non-transitive behavior of the win ratio and the closely related Area Under the Receiver Operating Characteristics Curve (AUC) and argue that their transitivity cannot be taken for granted. Crucially, traditional within-group statistics (i.e., comparison of means) are always transitive, while the WR can detect non-transitivity. Non-transitivity provides valuable information on the stochastic relationship between two treatment groups, which should be tested and reported. We specify the necessary conditions for transitivity, the sufficient conditions for non-transitivity and demonstrate non-transitivity in a real-life large randomized controlled trial for the WR of time-to-death. Our results can be used to rule out or evaluate possibility of non-transitivity and show the importance of studying the strength of s",
    "path": "papers/23/09/2309.01791.json",
    "total_tokens": 945,
    "translated_title": "不可转移的胜率和接收器操作特性曲线下面积 (AUC) ：评估随机比较的相关性 (arXiv:2309.01791v1 [stat.ME])",
    "translated_abstract": "胜率 (WR) 是随机对照试验中使用的一种新颖统计量，可以考虑事件结果内的层次关系。在本文中，我们报告并研究了胜率和紧密相关的接收器操作特性曲线下面积 (AUC) 的长期不可转移行为，并认为它们的可转移性不能被视为理所当然。关键是，传统的组内统计量（即平均值比较）始终是可转移的，而胜率可以检测到不可转移性。不可转移性提供了关于两个治疗组之间随机关系的有价值的信息，应该进行测试和报告。我们确定了可转移性的必要条件、不可转移性的充分条件，并在真实的大规模随机对照试验中展示了胜率对死亡时间的不可转移性。我们的结果可用于排除或评估不可转移性的可能性，并展示研究随机比较的相关性的重要性。",
    "tldr": "本文报告并研究了胜率和接收器操作特性曲线下面积的长期不可转移行为，验证了传统统计量和胜率的差异，并强调了研究随机比较的相关性的重要性。",
    "en_tdlr": "This paper reports and studies the long-run non-transitive behavior of the win ratio and the Area Under the Receiver Operating Characteristics Curve (AUC), highlighting the differences between traditional statistics and the win ratio, and emphasizing the importance of studying the strength of stochastic comparisons."
}