{
    "title": "Risk-reducing design and operations toolkit: 90 strategies for managing risk and uncertainty in decision problems. (arXiv:2309.03133v1 [q-fin.RM])",
    "abstract": "Uncertainty is a pervasive challenge in decision analysis, and decision theory recognizes two classes of solutions: probabilistic models and cognitive heuristics. However, engineers, public planners and other decision-makers instead use a third class of strategies that could be called RDOT (Risk-reducing Design and Operations Toolkit). These include incorporating robustness into designs, contingency planning, and others that do not fall into the categories of probabilistic models or cognitive heuristics. Moreover, identical strategies appear in several domains and disciplines, pointing to an important shared toolkit.  The focus of this paper is to develop a catalog of such strategies and develop a framework for them. The paper finds more than 90 examples of such strategies falling into six broad categories and argues that they provide an efficient response to decision problems that are seemingly intractable due to high uncertainty. It then proposes a framework to incorporate them into ",
    "link": "http://arxiv.org/abs/2309.03133",
    "context": "Title: Risk-reducing design and operations toolkit: 90 strategies for managing risk and uncertainty in decision problems. (arXiv:2309.03133v1 [q-fin.RM])\nAbstract: Uncertainty is a pervasive challenge in decision analysis, and decision theory recognizes two classes of solutions: probabilistic models and cognitive heuristics. However, engineers, public planners and other decision-makers instead use a third class of strategies that could be called RDOT (Risk-reducing Design and Operations Toolkit). These include incorporating robustness into designs, contingency planning, and others that do not fall into the categories of probabilistic models or cognitive heuristics. Moreover, identical strategies appear in several domains and disciplines, pointing to an important shared toolkit.  The focus of this paper is to develop a catalog of such strategies and develop a framework for them. The paper finds more than 90 examples of such strategies falling into six broad categories and argues that they provide an efficient response to decision problems that are seemingly intractable due to high uncertainty. It then proposes a framework to incorporate them into ",
    "path": "papers/23/09/2309.03133.json",
    "total_tokens": 1000,
    "translated_title": "风险降低设计和运营工具包: 管理决策问题中的风险和不确定性的90种策略",
    "translated_abstract": "不确定性是决策分析中普遍存在的挑战，决策理论承认两类解决方案: 概率模型和认知启发式。然而，工程师、公共规划者和其他决策者使用的是另一类被称为RDOT（风险降低设计和运营工具包）的策略。这些策略包括将稳健性纳入设计、事后预防措施等，并不属于概率模型或认知启发式的类别。此外，相同的策略出现在多个领域和学科中，指向了一个重要的共享工具包。本文的重点是开发这些策略的目录并为其开发一个框架。本文发现了超过90个属于六个广泛类别的这样的策略，并认为它们对于由于高度不确定性而似乎棘手的决策问题提供了高效的响应。然后，本文提出了一个将它们纳入决策模型的框架。",
    "tldr": "该论文研究了风险降低设计和运营工具包（RDOT）中的90种策略，这些策略可在高度不确定的决策问题中提供有效的响应。这些策略包括将稳健性纳入设计、事后预防措施等，能够帮助工程师、公共规划者和其他决策者应对挑战。",
    "en_tdlr": "This paper explores 90 strategies in the Risk-reducing Design and Operations Toolkit (RDOT) that provide effective response to decision problems with high uncertainty. These strategies, including incorporating robustness into designs and contingency planning, can assist engineers, public planners, and other decision-makers in addressing challenges."
}