{
    "title": "Evaluating the diversity and utility of materials proposed by generative models. (arXiv:2309.12323v1 [cond-mat.mtrl-sci])",
    "abstract": "Generative machine learning models can use data generated by scientific modeling to create large quantities of novel material structures. Here, we assess how one state-of-the-art generative model, the physics-guided crystal generation model (PGCGM), can be used as part of the inverse design process. We show that the default PGCGM's input space is not smooth with respect to parameter variation, making material optimization difficult and limited. We also demonstrate that most generated structures are predicted to be thermodynamically unstable by a separate property-prediction model, partially due to out-of-domain data challenges. Our findings suggest how generative models might be improved to enable better inverse design.",
    "link": "http://arxiv.org/abs/2309.12323",
    "context": "Title: Evaluating the diversity and utility of materials proposed by generative models. (arXiv:2309.12323v1 [cond-mat.mtrl-sci])\nAbstract: Generative machine learning models can use data generated by scientific modeling to create large quantities of novel material structures. Here, we assess how one state-of-the-art generative model, the physics-guided crystal generation model (PGCGM), can be used as part of the inverse design process. We show that the default PGCGM's input space is not smooth with respect to parameter variation, making material optimization difficult and limited. We also demonstrate that most generated structures are predicted to be thermodynamically unstable by a separate property-prediction model, partially due to out-of-domain data challenges. Our findings suggest how generative models might be improved to enable better inverse design.",
    "path": "papers/23/09/2309.12323.json",
    "total_tokens": 711,
    "translated_title": "评估生成模型提出的材料的多样性和实用性",
    "translated_abstract": "生成性机器学习模型可以利用科学建模生成的数据创建大量新颖的材料结构。在这里，我们评估了一个最先进的生成模型，物理引导的晶体生成模型（PGCGM），在逆向设计过程中的应用。我们表明，默认的PGCGM的输入空间在参数变化方面并不平滑，使得材料优化困难且受限。我们还证明，大多数生成的结构被一个单独的属性预测模型预测为热力学不稳定，部分原因是由于域外数据挑战。我们的研究结果表明，如何改进生成模型以实现更好的逆向设计。",
    "tldr": "本研究评估了物理引导的晶体生成模型（PGCGM）的多样性和实用性，并提出了改进生成模型以实现更好逆向设计的建议。"
}