{
    "title": "MotionLM: Multi-Agent Motion Forecasting as Language Modeling. (arXiv:2309.16534v1 [cs.CV])",
    "abstract": "Reliable forecasting of the future behavior of road agents is a critical component to safe planning in autonomous vehicles. Here, we represent continuous trajectories as sequences of discrete motion tokens and cast multi-agent motion prediction as a language modeling task over this domain. Our model, MotionLM, provides several advantages: First, it does not require anchors or explicit latent variable optimization to learn multimodal distributions. Instead, we leverage a single standard language modeling objective, maximizing the average log probability over sequence tokens. Second, our approach bypasses post-hoc interaction heuristics where individual agent trajectory generation is conducted prior to interactive scoring. Instead, MotionLM produces joint distributions over interactive agent futures in a single autoregressive decoding process. In addition, the model's sequential factorization enables temporally causal conditional rollouts. The proposed approach establishes new state-of-t",
    "link": "http://arxiv.org/abs/2309.16534",
    "context": "Title: MotionLM: Multi-Agent Motion Forecasting as Language Modeling. (arXiv:2309.16534v1 [cs.CV])\nAbstract: Reliable forecasting of the future behavior of road agents is a critical component to safe planning in autonomous vehicles. Here, we represent continuous trajectories as sequences of discrete motion tokens and cast multi-agent motion prediction as a language modeling task over this domain. Our model, MotionLM, provides several advantages: First, it does not require anchors or explicit latent variable optimization to learn multimodal distributions. Instead, we leverage a single standard language modeling objective, maximizing the average log probability over sequence tokens. Second, our approach bypasses post-hoc interaction heuristics where individual agent trajectory generation is conducted prior to interactive scoring. Instead, MotionLM produces joint distributions over interactive agent futures in a single autoregressive decoding process. In addition, the model's sequential factorization enables temporally causal conditional rollouts. The proposed approach establishes new state-of-t",
    "path": "papers/23/09/2309.16534.json",
    "total_tokens": 860,
    "translated_title": "MotionLM: 多智能体运动预测作为语言建模",
    "translated_abstract": "在自动驾驶车辆的安全规划中，可靠地预测道路上智能体的未来行为是至关重要的。在这里，我们将连续轨迹表示为离散运动令牌的序列，并将多智能体运动预测视为对该领域的语言建模任务。我们的模型MotionLM提供了几个优势：首先，它不需要锚点或显式潜在变量优化来学习多模态分布。相反，我们利用单个标准的语言建模目标，最大化序列令牌的平均对数概率。其次，我们的方法绕过事后交互启发式，其中在交互评分之前进行单个代理轨迹生成。相反，MotionLM在单个自回归解码过程中生成关于交互代理未来的联合分布。此外，模型的时序因子化使其能够实现时间因果条件展开。所提出的方法建立了新的最先进技术。",
    "tldr": "MotionLM模型是一个用于多智能体运动预测的语言建模方法，不需要锚点或显式潜在变量优化，能够生成关于交互智能体未来的联合分布和实现时间因果条件展开。",
    "en_tdlr": "MotionLM is a language modeling approach for multi-agent motion prediction, which does not require anchors or explicit latent variable optimization, and is able to generate joint distributions over interactive agent futures and enable temporally causal conditional rollouts."
}