{
    "title": "Modeling Multi-aspect Preferences and Intents for Multi-behavioral Sequential Recommendation. (arXiv:2309.14938v1 [cs.IR])",
    "abstract": "Multi-behavioral sequential recommendation has recently attracted increasing attention. However, existing methods suffer from two major limitations. Firstly, user preferences and intents can be described in fine-grained detail from multiple perspectives; yet, these methods fail to capture their multi-aspect nature. Secondly, user behaviors may contain noises, and most existing methods could not effectively deal with noises. In this paper, we present an attentive recurrent model with multiple projections to capture Multi-Aspect preferences and INTents (MAINT in short). To extract multi-aspect preferences from target behaviors, we propose a multi-aspect projection mechanism for generating multiple preference representations from multiple aspects. To extract multi-aspect intents from multi-typed behaviors, we propose a behavior-enhanced LSTM and a multi-aspect refinement attention mechanism. The attention mechanism can filter out noises and generate multiple intent representations from di",
    "link": "http://arxiv.org/abs/2309.14938",
    "context": "Title: Modeling Multi-aspect Preferences and Intents for Multi-behavioral Sequential Recommendation. (arXiv:2309.14938v1 [cs.IR])\nAbstract: Multi-behavioral sequential recommendation has recently attracted increasing attention. However, existing methods suffer from two major limitations. Firstly, user preferences and intents can be described in fine-grained detail from multiple perspectives; yet, these methods fail to capture their multi-aspect nature. Secondly, user behaviors may contain noises, and most existing methods could not effectively deal with noises. In this paper, we present an attentive recurrent model with multiple projections to capture Multi-Aspect preferences and INTents (MAINT in short). To extract multi-aspect preferences from target behaviors, we propose a multi-aspect projection mechanism for generating multiple preference representations from multiple aspects. To extract multi-aspect intents from multi-typed behaviors, we propose a behavior-enhanced LSTM and a multi-aspect refinement attention mechanism. The attention mechanism can filter out noises and generate multiple intent representations from di",
    "path": "papers/23/09/2309.14938.json",
    "total_tokens": 856,
    "translated_title": "对于多行为序列推荐，建模多方面的偏好和意图",
    "translated_abstract": "多行为序列推荐近年来受到越来越多的关注。然而，现有方法存在两个主要限制。首先，用户的偏好和意图可以从多个角度进行精细描述；然而，这些方法无法捕捉其多方面的特性。其次，用户行为可能包含噪声，而大多数现有方法不能有效处理噪声。本文提出了一种具有多个投影的注意力循环模型，用于捕捉多方面的偏好和意图（简称MAINT）。为了从目标行为中提取多方面的偏好，我们提出了一个多方面投影机制，用于从多个方面生成多个偏好表示。为了从多类型行为中提取多方面意图，我们提出了一个增强型LSTM和多方面精化注意力机制。注意力机制可以滤除噪声并从多个方面生成多个意图表示。",
    "tldr": "本文提出了MAINT模型，通过多重投影和多方面注意力机制捕捉多方面的偏好和意图，解决了现有方法在多行为序列推荐中无法捕捉多方面特性和处理噪声的问题。",
    "en_tdlr": "This paper presents the MAINT model, which captures multi-aspect preferences and intents in multi-behavioral sequential recommendation using multiple projections and a multi-aspect attention mechanism, addressing the limitations of existing methods in capturing multi-aspect nature and effectively dealing with noises in recommendation."
}