{
    "title": "Digital Twin-based Anomaly Detection with Curriculum Learning in Cyber-physical Systems. (arXiv:2309.15995v1 [cs.LG])",
    "abstract": "Anomaly detection is critical to ensure the security of cyber-physical systems (CPS). However, due to the increasing complexity of attacks and CPS themselves, anomaly detection in CPS is becoming more and more challenging. In our previous work, we proposed a digital twin-based anomaly detection method, called ATTAIN, which takes advantage of both historical and real-time data of CPS. However, such data vary significantly in terms of difficulty. Therefore, similar to human learning processes, deep learning models (e.g., ATTAIN) can benefit from an easy-to-difficult curriculum. To this end, in this paper, we present a novel approach, named digitaL twin-based Anomaly deTecTion wIth Curriculum lEarning (LATTICE), which extends ATTAIN by introducing curriculum learning to optimize its learning paradigm. LATTICE attributes each sample with a difficulty score, before being fed into a training scheduler. The training scheduler samples batches of training data based on these difficulty scores s",
    "link": "http://arxiv.org/abs/2309.15995",
    "context": "Title: Digital Twin-based Anomaly Detection with Curriculum Learning in Cyber-physical Systems. (arXiv:2309.15995v1 [cs.LG])\nAbstract: Anomaly detection is critical to ensure the security of cyber-physical systems (CPS). However, due to the increasing complexity of attacks and CPS themselves, anomaly detection in CPS is becoming more and more challenging. In our previous work, we proposed a digital twin-based anomaly detection method, called ATTAIN, which takes advantage of both historical and real-time data of CPS. However, such data vary significantly in terms of difficulty. Therefore, similar to human learning processes, deep learning models (e.g., ATTAIN) can benefit from an easy-to-difficult curriculum. To this end, in this paper, we present a novel approach, named digitaL twin-based Anomaly deTecTion wIth Curriculum lEarning (LATTICE), which extends ATTAIN by introducing curriculum learning to optimize its learning paradigm. LATTICE attributes each sample with a difficulty score, before being fed into a training scheduler. The training scheduler samples batches of training data based on these difficulty scores s",
    "path": "papers/23/09/2309.15995.json",
    "total_tokens": 883,
    "translated_title": "基于数字孪生的课程学习在网络物理系统中的异常检测",
    "translated_abstract": "异常检测对于保证网络物理系统（CPS）的安全至关重要。然而，由于攻击和CPS本身的复杂性不断增加，CPS中的异常检测变得越来越具有挑战性。在我们之前的工作中，我们提出了一种基于数字孪生的异常检测方法，称为ATTAIN，它利用了CPS的历史和实时数据。然而，这些数据在难度上有显著的差异。因此，类似于人类学习过程，深度学习模型（如ATTAIN）可以从简单到困难的课程中受益。为此，在本文中，我们提出了一种名为数字孪生课程学习的新方法，即LATTICE，它通过引入课程学习来优化ATTAIN的学习范式。LATTICE为每个样本赋予一个难度得分，然后将其输入到训练调度程序中进行训练数据的批处理采样。",
    "tldr": "这篇论文提出了一种基于数字孪生的网络物理系统中的异常检测方法，通过引入课程学习优化学习范式，将训练数据进行难度得分采样。"
}