{
    "title": "Harnessing Collective Intelligence Under a Lack of Cultural Consensus. (arXiv:2309.09787v2 [cs.LG] UPDATED)",
    "abstract": "Harnessing collective intelligence to drive effective decision-making and collaboration benefits from the ability to detect and characterize heterogeneity in consensus beliefs. This is particularly true in domains such as technology acceptance or leadership perception, where a consensus defines an intersubjective truth, leading to the possibility of multiple \"ground truths\" when subsets of respondents sustain mutually incompatible consensuses. Cultural Consensus Theory (CCT) provides a statistical framework for detecting and characterizing these divergent consensus beliefs. However, it is unworkable in modern applications because it lacks the ability to generalize across even highly similar beliefs, is ineffective with sparse data, and can leverage neither external knowledge bases nor learned machine representations. Here, we overcome these limitations through Infinite Deep Latent Construct Cultural Consensus Theory (iDLC-CCT), a nonparametric Bayesian model that extends CCT with a lat",
    "link": "http://arxiv.org/abs/2309.09787",
    "context": "Title: Harnessing Collective Intelligence Under a Lack of Cultural Consensus. (arXiv:2309.09787v2 [cs.LG] UPDATED)\nAbstract: Harnessing collective intelligence to drive effective decision-making and collaboration benefits from the ability to detect and characterize heterogeneity in consensus beliefs. This is particularly true in domains such as technology acceptance or leadership perception, where a consensus defines an intersubjective truth, leading to the possibility of multiple \"ground truths\" when subsets of respondents sustain mutually incompatible consensuses. Cultural Consensus Theory (CCT) provides a statistical framework for detecting and characterizing these divergent consensus beliefs. However, it is unworkable in modern applications because it lacks the ability to generalize across even highly similar beliefs, is ineffective with sparse data, and can leverage neither external knowledge bases nor learned machine representations. Here, we overcome these limitations through Infinite Deep Latent Construct Cultural Consensus Theory (iDLC-CCT), a nonparametric Bayesian model that extends CCT with a lat",
    "path": "papers/23/09/2309.09787.json",
    "total_tokens": 873,
    "translated_title": "在缺乏文化共识的情况下利用集体智慧",
    "translated_abstract": "利用集体智慧来推动有效的决策和合作受益于能够检测和描述共识信念的多样性。文化共识理论（CCT）提供了一种统计框架，用于检测和描述这些不同的共识信念。然而，它在现代应用中不可行，因为它缺乏对相似信念的概括能力，对稀疏数据无效，并且无法利用外部知识库或学习到的机器表示。在这里，我们通过无限深度潜在结构的文化共识理论（iDLC-CCT）来克服这些限制。该模型是一个非参数贝叶斯模型，通过一个潜在结构来扩展CCT。该结构允许我们将文化共识看作是一系列无限深度的概念构建块，从而提高了对信念多样性的建模能力。",
    "tldr": "在缺乏文化共识的情况下，通过无限深度潜在结构的文化共识理论（iDLC-CCT）模型，扩展了文化共识理论（CCT）的能力，提高了对共识信念多样性的建模能力。",
    "en_tdlr": "Harnessing collective intelligence under a lack of cultural consensus is achieved through the use of Infinite Deep Latent Construct Cultural Consensus Theory (iDLC-CCT), which extends Cultural Consensus Theory (CCT) by enhancing the modeling capability of diverse consensus beliefs."
}