{
    "title": "A new method of modeling the multi-stage decision-making process of CRT using machine learning with uncertainty quantification. (arXiv:2309.08415v1 [cs.LG])",
    "abstract": "Aims. The purpose of this study is to create a multi-stage machine learning model to predict cardiac resynchronization therapy (CRT) response for heart failure (HF) patients. This model exploits uncertainty quantification to recommend additional collection of single-photon emission computed tomography myocardial perfusion imaging (SPECT MPI) variables if baseline clinical variables and features from electrocardiogram (ECG) are not sufficient. Methods. 218 patients who underwent rest-gated SPECT MPI were enrolled in this study. CRT response was defined as an increase in left ventricular ejection fraction (LVEF) > 5% at a 6 month follow-up. A multi-stage ML model was created by combining two ensemble models. Results. The response rate for CRT was 55.5% (n = 121) with overall male gender 61.0% (n = 133), an average age of 62.0, and LVEF of 27.7. The multi-stage model performed similarly to Ensemble 2 (which utilized the additional SPECT data) with AUC of 0.75 vs. 0.77, accuracy of 0.71 vs",
    "link": "http://arxiv.org/abs/2309.08415",
    "context": "Title: A new method of modeling the multi-stage decision-making process of CRT using machine learning with uncertainty quantification. (arXiv:2309.08415v1 [cs.LG])\nAbstract: Aims. The purpose of this study is to create a multi-stage machine learning model to predict cardiac resynchronization therapy (CRT) response for heart failure (HF) patients. This model exploits uncertainty quantification to recommend additional collection of single-photon emission computed tomography myocardial perfusion imaging (SPECT MPI) variables if baseline clinical variables and features from electrocardiogram (ECG) are not sufficient. Methods. 218 patients who underwent rest-gated SPECT MPI were enrolled in this study. CRT response was defined as an increase in left ventricular ejection fraction (LVEF) > 5% at a 6 month follow-up. A multi-stage ML model was created by combining two ensemble models. Results. The response rate for CRT was 55.5% (n = 121) with overall male gender 61.0% (n = 133), an average age of 62.0, and LVEF of 27.7. The multi-stage model performed similarly to Ensemble 2 (which utilized the additional SPECT data) with AUC of 0.75 vs. 0.77, accuracy of 0.71 vs",
    "path": "papers/23/09/2309.08415.json",
    "total_tokens": 1041,
    "translated_title": "使用机器学习和不确定性量化对CRT的多阶段决策过程进行建模的新方法",
    "translated_abstract": "目的。本研究旨在创建一个多阶段的机器学习模型，用于预测心力衰竭（HF）患者心脏再同步治疗（CRT）的反应。该模型利用不确定性量化来推荐在基线临床变量和心电图（ECG）的特征不足时收集额外的单光子发射计算机体层摄影心肌灌注显像（SPECT MPI）变量。方法。本研究纳入了218名接受静息门控SPECT MPI的患者。CRT反应被定义为6个月随访时左室射血分数（LVEF）增加> 5%。通过组合两个集成模型创建了一个多阶段的机器学习模型。结果。CRT的反应率为55.5%（n = 121），整体男性占61.0%（n = 133），平均年龄62.0岁，LVEF为27.7。该多阶段模型的性能与集成模型2（利用了额外的SPECT数据）相似，AUC分别为0.75和0.77，准确性分别为0.71和...",
    "tldr": "本研究提出了一种使用机器学习和不确定性量化建模的多阶段决策过程方法，用于预测心力衰竭患者对心脏再同步治疗的反应。该模型能够推荐收集额外的SPECT MPI变量，以提高预测准确性。",
    "en_tdlr": "This study presents a new method that uses machine learning with uncertainty quantification to model the multi-stage decision-making process of cardiac resynchronization therapy in heart failure patients. The model can recommend collecting additional single-photon emission computed tomography myocardial perfusion imaging variables to improve prediction accuracy."
}