{
    "title": "Federated Short-Term Load Forecasting with Personalization Layers for Heterogeneous Clients. (arXiv:2309.13194v1 [cs.LG])",
    "abstract": "The advent of smart meters has enabled pervasive collection of energy consumption data for training short-term load forecasting (STLF) models. In response to privacy concerns, federated learning (FL) has been proposed as a privacy-preserving approach for training, but the quality of trained models degrades as client data becomes heterogeneous. In this paper we alleviate this drawback using personalization layers, wherein certain layers of an STLF model in an FL framework are trained exclusively on the clients' own data. To that end, we propose a personalized FL algorithm (PL-FL) enabling FL to handle personalization layers. The PL-FL algorithm is implemented by using the Argonne Privacy-Preserving Federated Learning package. We test the forecast performance of models trained on the NREL ComStock dataset, which contains heterogeneous energy consumption data of multiple commercial buildings. Superior performance of models trained with PL-FL demonstrates that personalization layers enable",
    "link": "http://arxiv.org/abs/2309.13194",
    "context": "Title: Federated Short-Term Load Forecasting with Personalization Layers for Heterogeneous Clients. (arXiv:2309.13194v1 [cs.LG])\nAbstract: The advent of smart meters has enabled pervasive collection of energy consumption data for training short-term load forecasting (STLF) models. In response to privacy concerns, federated learning (FL) has been proposed as a privacy-preserving approach for training, but the quality of trained models degrades as client data becomes heterogeneous. In this paper we alleviate this drawback using personalization layers, wherein certain layers of an STLF model in an FL framework are trained exclusively on the clients' own data. To that end, we propose a personalized FL algorithm (PL-FL) enabling FL to handle personalization layers. The PL-FL algorithm is implemented by using the Argonne Privacy-Preserving Federated Learning package. We test the forecast performance of models trained on the NREL ComStock dataset, which contains heterogeneous energy consumption data of multiple commercial buildings. Superior performance of models trained with PL-FL demonstrates that personalization layers enable",
    "path": "papers/23/09/2309.13194.json",
    "total_tokens": 1005,
    "translated_title": "基于个性化层的异质客户联邦短期负载预测",
    "translated_abstract": "智能电表的出现为训练短期负载预测(STLF)模型提供了广泛的能源消耗数据收集。为了回应隐私关切，提出了联邦学习(FL)作为一种保护隐私的训练方法，然而随着客户数据变得异质化，训练模型的质量会降低。本文通过使用个性化层来缓解这个缺点，在FL框架中训练STLF模型的特定层仅由客户自己的数据进行训练。为此，我们提出了一种个性化联邦学习算法(PL-FL)，使FL能够处理个性化层。PL-FL算法是通过使用Argonne隐私保护联邦学习软件包实现的。我们使用包含多个商业建筑异质能源消耗数据的NREL ComStock数据集测试了模型的预测性能。通过PL-FL训练的模型表现出了优越的性能，证明个性化层使得个性化联邦学习成为可能。",
    "tldr": "本文介绍了一种基于个性化层的联邦短期负载预测方法，该方法通过在联邦学习框架中训练特定层时仅使用客户的数据来缓解异质性数据带来的训练模型质量下降问题。通过实验证明，采用个性化层训练的模型具有优越的性能，在保证隐私的同时实现了良好的预测效果。",
    "en_tdlr": "This paper presents a federated short-term load forecasting approach with personalization layers, which mitigates the quality degradation of trained models caused by heterogeneous client data by training specific layers exclusively on each client's own data in a federated learning framework. Experimental results demonstrate that models trained with personalization layers achieve superior performance with good prediction accuracy while ensuring privacy."
}