{
    "title": "Identifying factors associated with fast visual field progression in patients with ocular hypertension based on unsupervised machine learning. (arXiv:2309.15867v1 [cs.LG])",
    "abstract": "Purpose: To identify ocular hypertension (OHT) subtypes with different trends of visual field (VF) progression based on unsupervised machine learning and to discover factors associated with fast VF progression. Participants: A total of 3133 eyes of 1568 ocular hypertension treatment study (OHTS) participants with at least five follow-up VF tests were included in the study. Methods: We used a latent class mixed model (LCMM) to identify OHT subtypes using standard automated perimetry (SAP) mean deviation (MD) trajectories. We characterized the subtypes based on demographic, clinical, ocular, and VF factors at the baseline. We then identified factors driving fast VF progression using generalized estimating equation (GEE) and justified findings qualitatively and quantitatively. Results: The LCMM model discovered four clusters (subtypes) of eyes with different trajectories of MD worsening. The number of eyes in clusters were 794 (25%), 1675 (54%), 531 (17%) and 133 (4%). We labelled the clu",
    "link": "http://arxiv.org/abs/2309.15867",
    "context": "Title: Identifying factors associated with fast visual field progression in patients with ocular hypertension based on unsupervised machine learning. (arXiv:2309.15867v1 [cs.LG])\nAbstract: Purpose: To identify ocular hypertension (OHT) subtypes with different trends of visual field (VF) progression based on unsupervised machine learning and to discover factors associated with fast VF progression. Participants: A total of 3133 eyes of 1568 ocular hypertension treatment study (OHTS) participants with at least five follow-up VF tests were included in the study. Methods: We used a latent class mixed model (LCMM) to identify OHT subtypes using standard automated perimetry (SAP) mean deviation (MD) trajectories. We characterized the subtypes based on demographic, clinical, ocular, and VF factors at the baseline. We then identified factors driving fast VF progression using generalized estimating equation (GEE) and justified findings qualitatively and quantitatively. Results: The LCMM model discovered four clusters (subtypes) of eyes with different trajectories of MD worsening. The number of eyes in clusters were 794 (25%), 1675 (54%), 531 (17%) and 133 (4%). We labelled the clu",
    "path": "papers/23/09/2309.15867.json",
    "total_tokens": 977,
    "translated_title": "基于无监督机器学习识别眼压增高患者快速视野退化的相关因素",
    "translated_abstract": "目的：基于无监督机器学习识别具有不同视野退化趋势的眼压增高 (OHT) 亚型，并发现与快速视野退化相关的因素。参与者：研究纳入了1568名眼压增高治疗研究 (OHTS）参与者的3133只眼，这些参与者至少有五次随访视野测试。方法：我们使用潜在类混合模型 (LCMM) 根据标准自动化视野检测 (SAP) 平均偏差 (MD) 轨迹识别眼压增高亚型。我们根据基线的人口统计学、临床、眼部和视野指标描述亚型。然后，我们使用广义估计方程 (GEE) 识别推进快速视野退化的因素，并通过定性和定量方式验证结果。结果：LCMM模型发现了四个眼睛群集（亚型），具有不同的MD恶化轨迹。其中，聚类中的眼睛数分别为794只 (25%)、1675只 (54%)、531只 (17%) 和133只 (4%)。",
    "tldr": "本研究使用无监督机器学习方法识别了眼压增高患者中具有不同视野退化趋势的亚型，并发现了快速视野退化的相关因素。"
}