{
    "title": "Detecting ChatGPT: A Survey of the State of Detecting ChatGPT-Generated Text. (arXiv:2309.07689v1 [cs.CL])",
    "abstract": "While recent advancements in the capabilities and widespread accessibility of generative language models, such as ChatGPT (OpenAI, 2022), have brought about various benefits by generating fluent human-like text, the task of distinguishing between human- and large language model (LLM) generated text has emerged as a crucial problem. These models can potentially deceive by generating artificial text that appears to be human-generated. This issue is particularly significant in domains such as law, education, and science, where ensuring the integrity of text is of the utmost importance. This survey provides an overview of the current approaches employed to differentiate between texts generated by humans and ChatGPT. We present an account of the different datasets constructed for detecting ChatGPT-generated text, the various methods utilized, what qualitative analyses into the characteristics of human versus ChatGPT-generated text have been performed, and finally, summarize our findings int",
    "link": "http://arxiv.org/abs/2309.07689",
    "context": "Title: Detecting ChatGPT: A Survey of the State of Detecting ChatGPT-Generated Text. (arXiv:2309.07689v1 [cs.CL])\nAbstract: While recent advancements in the capabilities and widespread accessibility of generative language models, such as ChatGPT (OpenAI, 2022), have brought about various benefits by generating fluent human-like text, the task of distinguishing between human- and large language model (LLM) generated text has emerged as a crucial problem. These models can potentially deceive by generating artificial text that appears to be human-generated. This issue is particularly significant in domains such as law, education, and science, where ensuring the integrity of text is of the utmost importance. This survey provides an overview of the current approaches employed to differentiate between texts generated by humans and ChatGPT. We present an account of the different datasets constructed for detecting ChatGPT-generated text, the various methods utilized, what qualitative analyses into the characteristics of human versus ChatGPT-generated text have been performed, and finally, summarize our findings int",
    "path": "papers/23/09/2309.07689.json",
    "total_tokens": 802,
    "translated_title": "检测ChatGPT：对检测ChatGPT生成文本状态的调查",
    "translated_abstract": "随着ChatGPT（OpenAI, 2022）等生成语言模型能力和广泛使用的不断进步，它们生成流利的类人文本带来了各种好处，但区分人类生成文本和大型语言模型（LLM）生成文本的任务也因此成为一个关键问题。这些模型可能通过生成看似由人类生成的人工文本而进行欺骗。在法律、教育和科学等领域，确保文本的真实性尤为重要，因此这个问题尤为显著。本调查概述了当前用于区分人工文本和ChatGPT生成文本的方法，我们介绍了构建用于检测ChatGPT生成文本的不同数据集，使用的各种方法，进行了哪些关于人类与ChatGPT生成文本特征的定性分析，并总结了我们的研究结果。",
    "tldr": "这篇调查论文概述了当前用于区分ChatGPT生成文本和人工文本的方法和数据集，并总结了研究发现。",
    "en_tdlr": "This survey provides an overview of the current methods and datasets used to differentiate between ChatGPT-generated text and human-generated text, and summarizes the research findings."
}