{
    "title": "ActiveAI: Introducing AI Literacy for Middle School Learners with Goal-based Scenario Learning. (arXiv:2309.12337v1 [cs.CY])",
    "abstract": "The ActiveAI project addresses key challenges in AI education for grades 7-9 students by providing an engaging AI literacy learning experience based on the AI4K12 knowledge framework. Utilizing learning science mechanisms such as goal-based scenarios, immediate feedback, project-based learning, and intelligent agents, the app incorporates a variety of learner inputs like sliders, steppers, and collectors to enhance understanding. In these courses, students work on real-world scenarios like analyzing sentiment in social media comments. This helps them learn to effectively engage with AI systems and develop their ability to evaluate AI-generated output. The Learning Engineering Process (LEP) guided the project's creation and data instrumentation, focusing on design and impact. The project is currently in the implementation stage, leveraging the intelligent tutor design principles for app development. The extended abstract presents the foundational design and development, with further eva",
    "link": "http://arxiv.org/abs/2309.12337",
    "context": "Title: ActiveAI: Introducing AI Literacy for Middle School Learners with Goal-based Scenario Learning. (arXiv:2309.12337v1 [cs.CY])\nAbstract: The ActiveAI project addresses key challenges in AI education for grades 7-9 students by providing an engaging AI literacy learning experience based on the AI4K12 knowledge framework. Utilizing learning science mechanisms such as goal-based scenarios, immediate feedback, project-based learning, and intelligent agents, the app incorporates a variety of learner inputs like sliders, steppers, and collectors to enhance understanding. In these courses, students work on real-world scenarios like analyzing sentiment in social media comments. This helps them learn to effectively engage with AI systems and develop their ability to evaluate AI-generated output. The Learning Engineering Process (LEP) guided the project's creation and data instrumentation, focusing on design and impact. The project is currently in the implementation stage, leveraging the intelligent tutor design principles for app development. The extended abstract presents the foundational design and development, with further eva",
    "path": "papers/23/09/2309.12337.json",
    "total_tokens": 950,
    "translated_title": "ActiveAI：引入基于目标情景学习的人工智能素养教育给初中学习者",
    "translated_abstract": "ActiveAI项目通过提供基于AI4K12知识框架的引人入胜的人工智能素养学习体验，来解决7-9年级学生在人工智能教育中面临的关键挑战。该应用利用目标情景、即时反馈、项目学习和智能代理等学习科学机制，结合滑块、步进器、收集器等多种学习者输入方式，以增强理解能力。在这些课程中，学生们处理社交媒体评论中的情感分析等现实场景，从而帮助他们学会有效地与人工智能系统互动，并培养他们评估人工智能生成结果的能力。该项目采用了学习工程过程（LEP）来指导项目的创建和数据工具化，聚焦设计和影响。目前，该项目正处于实施阶段，利用了智能导师设计原则进行应用开发。扩展摘要介绍了项目的基础设计和开发，并进一步评估了其效果。",
    "tldr": "ActiveAI项目为初中学生提供了一种基于AI4K12知识框架的人工智能素养学习体验，通过目标情景学习、即时反馈和项目学习等机制帮助学生有效地与人工智能系统互动，并培养他们评估人工智能生成结果的能力。",
    "en_tdlr": "The ActiveAI project provides an engaging AI literacy learning experience for middle school students based on the AI4K12 knowledge framework. It helps students effectively interact with AI systems and develop their ability to evaluate AI-generated output through goal-based scenario learning, immediate feedback, and project-based learning mechanisms."
}