{
    "title": "Program Repair with Minimal Edits Using CodeT5. (arXiv:2309.14760v1 [cs.CL])",
    "abstract": "Programmers often struggle to identify and fix bugs in their programs. In recent years, many language models (LMs) have been proposed to fix erroneous programs and support error recovery. However, the LMs tend to generate solutions that differ from the original input programs. This leads to potential comprehension difficulties for users. In this paper, we propose an approach to suggest a correct program with minimal repair edits using CodeT5. We fine-tune a pre-trained CodeT5 on code pairs of wrong and correct programs and evaluate its performance with several baseline models. The experimental results show that the fine-tuned CodeT5 achieves a pass@100 of 91.95% and an average edit distance of the most similar correct program of 6.84, which indicates that at least one correct program can be suggested by generating 100 candidate programs. We demonstrate the effectiveness of LMs in suggesting program repair with minimal edits for solving introductory programming problems.",
    "link": "http://arxiv.org/abs/2309.14760",
    "context": "Title: Program Repair with Minimal Edits Using CodeT5. (arXiv:2309.14760v1 [cs.CL])\nAbstract: Programmers often struggle to identify and fix bugs in their programs. In recent years, many language models (LMs) have been proposed to fix erroneous programs and support error recovery. However, the LMs tend to generate solutions that differ from the original input programs. This leads to potential comprehension difficulties for users. In this paper, we propose an approach to suggest a correct program with minimal repair edits using CodeT5. We fine-tune a pre-trained CodeT5 on code pairs of wrong and correct programs and evaluate its performance with several baseline models. The experimental results show that the fine-tuned CodeT5 achieves a pass@100 of 91.95% and an average edit distance of the most similar correct program of 6.84, which indicates that at least one correct program can be suggested by generating 100 candidate programs. We demonstrate the effectiveness of LMs in suggesting program repair with minimal edits for solving introductory programming problems.",
    "path": "papers/23/09/2309.14760.json",
    "total_tokens": 832,
    "translated_title": "使用CodeT5进行最小编辑的程序修复",
    "translated_abstract": "程序员往往难以识别和修复程序中的错误。近年来，许多语言模型（LM）已经被提出用来修复错误的程序并支持错误恢复。然而，LMs往往会生成与原始输入程序不同的解决方案。这可能导致用户的理解困难。在本文中，我们提出了一种使用CodeT5建议进行最小修复编辑的正确程序的方法。我们在错误和正确程序的代码对上对预先训练的CodeT5进行微调，并使用几个基准模型评估其性能。实验结果表明，经过微调的CodeT5的通过率为91.95%，最相似的正确程序的平均编辑距离为6.84，这表明至少可以通过生成100个候选程序来建议一个正确的程序。我们展示了语言模型在解决初级编程问题时建议使用最小编辑的程序修复的有效性。",
    "tldr": "本文提出了一种使用CodeT5进行最小编辑的程序修复的方法，该方法通过在错误和正确程序的代码对上对预训练的CodeT5进行微调，实验结果表明其效果良好。",
    "en_tdlr": "This paper proposes an approach to program repair using CodeT5 with minimal edits, where a pre-trained CodeT5 model is fine-tuned on code pairs of wrong and correct programs. Experimental results show that the approach achieves good performance."
}