{
    "title": "Unlocking the Heart Using Adaptive Locked Agnostic Networks. (arXiv:2309.11899v1 [cs.CV])",
    "abstract": "Supervised training of deep learning models for medical imaging applications requires a significant amount of labeled data. This is posing a challenge as the images are required to be annotated by medical professionals. To address this limitation, we introduce the Adaptive Locked Agnostic Network (ALAN), a concept involving self-supervised visual feature extraction using a large backbone model to produce anatomically robust semantic self-segmentation. In the ALAN methodology, this self-supervised training occurs only once on a large and diverse dataset. Due to the intuitive interpretability of the segmentation, downstream models tailored for specific tasks can be easily designed using white-box models with few parameters. This, in turn, opens up the possibility of communicating the inner workings of a model with domain experts and introducing prior knowledge into it. It also means that the downstream models become less data-hungry compared to fully supervised approaches. These characte",
    "link": "http://arxiv.org/abs/2309.11899",
    "context": "Title: Unlocking the Heart Using Adaptive Locked Agnostic Networks. (arXiv:2309.11899v1 [cs.CV])\nAbstract: Supervised training of deep learning models for medical imaging applications requires a significant amount of labeled data. This is posing a challenge as the images are required to be annotated by medical professionals. To address this limitation, we introduce the Adaptive Locked Agnostic Network (ALAN), a concept involving self-supervised visual feature extraction using a large backbone model to produce anatomically robust semantic self-segmentation. In the ALAN methodology, this self-supervised training occurs only once on a large and diverse dataset. Due to the intuitive interpretability of the segmentation, downstream models tailored for specific tasks can be easily designed using white-box models with few parameters. This, in turn, opens up the possibility of communicating the inner workings of a model with domain experts and introducing prior knowledge into it. It also means that the downstream models become less data-hungry compared to fully supervised approaches. These characte",
    "path": "papers/23/09/2309.11899.json",
    "total_tokens": 790,
    "translated_title": "使用自适应锁定无知网络解锁心脏",
    "translated_abstract": "对于医学图像应用的深度学习模型的监督训练需要大量标记数据。这对于需要医学专业人员进行注释的图像来说是一个挑战。为了解决这个限制，我们引入了自适应锁定无知网络（ALAN），这是一个涉及使用大型骨干模型进行自我监督视觉特征提取的概念，以产生解剖学上鲁棒的语义自我分割。在ALAN方法中，这种自我监督训练仅在大型和多样化的数据集上进行一次。由于分割的直观可解释性，可以使用少量参数的白盒模型轻松设计用于特定任务的下游模型。这反过来意味着与完全监督方法相比，下游模型对数据的需求较少。这些特性",
    "tldr": "使用自适应锁定无知网络（ALAN）进行自我监督训练，生成解剖学上鲁棒的语义自我分割，减少对标记数据的需求。",
    "en_tdlr": "ALAN enables self-supervised training for robust anatomical semantic segmentation, reducing the dependence on labeled data."
}