{
    "title": "A Variational Auto-Encoder Enabled Multi-Band Channel Prediction Scheme for Indoor Localization. (arXiv:2309.12200v1 [eess.SP])",
    "abstract": "Indoor localization is getting increasing demands for various cutting-edged technologies, like Virtual/Augmented reality and smart home. Traditional model-based localization suffers from significant computational overhead, so fingerprint localization is getting increasing attention, which needs lower computation cost after the fingerprint database is built. However, the accuracy of indoor localization is limited by the complicated indoor environment which brings the multipath signal refraction. In this paper, we provided a scheme to improve the accuracy of indoor fingerprint localization from the frequency domain by predicting the channel state information (CSI) values from another transmitting channel and spliced the multi-band information together to get more precise localization results. We tested our proposed scheme on COST 2100 simulation data and real time orthogonal frequency division multiplexing (OFDM) WiFi data collected from an office scenario.",
    "link": "http://arxiv.org/abs/2309.12200",
    "context": "Title: A Variational Auto-Encoder Enabled Multi-Band Channel Prediction Scheme for Indoor Localization. (arXiv:2309.12200v1 [eess.SP])\nAbstract: Indoor localization is getting increasing demands for various cutting-edged technologies, like Virtual/Augmented reality and smart home. Traditional model-based localization suffers from significant computational overhead, so fingerprint localization is getting increasing attention, which needs lower computation cost after the fingerprint database is built. However, the accuracy of indoor localization is limited by the complicated indoor environment which brings the multipath signal refraction. In this paper, we provided a scheme to improve the accuracy of indoor fingerprint localization from the frequency domain by predicting the channel state information (CSI) values from another transmitting channel and spliced the multi-band information together to get more precise localization results. We tested our proposed scheme on COST 2100 simulation data and real time orthogonal frequency division multiplexing (OFDM) WiFi data collected from an office scenario.",
    "path": "papers/23/09/2309.12200.json",
    "total_tokens": 804,
    "translated_title": "一个基于变分自编码器的室内定位的多频段信道预测方案",
    "translated_abstract": "室内定位在虚拟/增强现实和智能家居等前沿技术中的需求越来越大。传统的基于模型的定位在计算负担方面存在显著问题，所以指纹定位引起了越来越多的关注，它需要在建立指纹数据库后降低计算成本。然而，室内定位的准确性受到复杂室内环境带来的多径信号折射的限制。在本文中，我们提出了一种方案，通过从另一个发送通道预测信道状态信息（CSI）值，并将多频段信息拼接在一起，以提高室内指纹定位的准确性。我们在COST 2100模拟数据和从办公场景收集的实时正交频分复用（OFDM）WiFi数据上测试了我们的方案。",
    "tldr": "本文提出了一个基于变分自编码器的室内定位方案，通过预测信道状态信息值并将多频段信息拼接在一起，提高了室内指纹定位的准确性。",
    "en_tdlr": "This paper proposes a variational auto-encoder enabled indoor localization scheme that improves the accuracy of indoor fingerprint localization by predicting channel state information values and splicing multi-band information together."
}