{
    "title": "Life-inspired Interoceptive Artificial Intelligence for Autonomous and Adaptive Agents. (arXiv:2309.05999v1 [cs.AI])",
    "abstract": "Building autonomous --- i.e., choosing goals based on one's needs -- and adaptive -- i.e., surviving in ever-changing environments -- agents has been a holy grail of artificial intelligence (AI). A living organism is a prime example of such an agent, offering important lessons about adaptive autonomy. Here, we focus on interoception, a process of monitoring one's internal environment to keep it within certain bounds, which underwrites the survival of an organism. To develop AI with interoception, we need to factorize the state variables representing internal environments from external environments and adopt life-inspired mathematical properties of internal environment states. This paper offers a new perspective on how interoception can help build autonomous and adaptive agents by integrating the legacy of cybernetics with recent advances in theories of life, reinforcement learning, and neuroscience.",
    "link": "http://arxiv.org/abs/2309.05999",
    "context": "Title: Life-inspired Interoceptive Artificial Intelligence for Autonomous and Adaptive Agents. (arXiv:2309.05999v1 [cs.AI])\nAbstract: Building autonomous --- i.e., choosing goals based on one's needs -- and adaptive -- i.e., surviving in ever-changing environments -- agents has been a holy grail of artificial intelligence (AI). A living organism is a prime example of such an agent, offering important lessons about adaptive autonomy. Here, we focus on interoception, a process of monitoring one's internal environment to keep it within certain bounds, which underwrites the survival of an organism. To develop AI with interoception, we need to factorize the state variables representing internal environments from external environments and adopt life-inspired mathematical properties of internal environment states. This paper offers a new perspective on how interoception can help build autonomous and adaptive agents by integrating the legacy of cybernetics with recent advances in theories of life, reinforcement learning, and neuroscience.",
    "path": "papers/23/09/2309.05999.json",
    "total_tokens": 1077,
    "translated_title": "生命启发的自主和适应智能为自主和适应性代理构建具有自主能力和自适应能力的代理一直是人工智能（AI）的终极目标。生物体是这样一个代理的最好例证，它为自适应自主性提供了重要的经验教训。在这里，我们关注内感知，这是一个监控自身内部环境来保持在一定范围内的过程，它为生物体的生存提供了基础。为了开发具有内感知的AI，我们需要将表示内部环境的状态变量与外部环境相分离，并采用生命启发的内部环境状态的数学特性。本文提出了一个新的视角，即通过将控制论、强化学习和神经科学的最新进展与生命理论相结合，内感知如何帮助构建自主和适应性代理。",
    "translated_abstract": "构建具有自主能力和自适应能力的代理一直是人工智能（AI）的终极目标。生物体是这样一个代理的最好例证，它为自适应自主性提供了重要的经验教训。本文关注内感知，这是一个监控自身内部环境来保持在一定范围内的过程，它为生物体的生存提供了基础。为了开发具有内感知的AI，我们需要将表示内部环境的状态变量与外部环境相分离，并采用生命启发的内部环境状态的数学特性。本文提出了一个新的视角，即通过将控制论、强化学习和神经科学的最新进展与生命理论相结合，内感知如何帮助构建自主和适应性代理。",
    "tldr": "该论文提出了一种基于生命理论和控制论的新视角，通过将控制论、强化学习和神经科学的最新进展与生命理论相结合，将内感知应用于构建具有自主和适应性能力的人工智能代理。",
    "en_tdlr": "This paper presents a new perspective on how interoception can assist in building autonomous and adaptive AI agents by integrating the latest advances in control theory, reinforcement learning, and neuroscience with the theories of life."
}