{
    "title": "Reconstructing Existing Levels through Level Inpainting. (arXiv:2309.09472v2 [cs.CV] UPDATED)",
    "abstract": "Procedural Content Generation (PCG) and Procedural Content Generation via Machine Learning (PCGML) have been used in prior work for generating levels in various games. This paper introduces Content Augmentation and focuses on the subproblem of level inpainting, which involves reconstructing and extending video game levels. Drawing inspiration from image inpainting, we adapt two techniques from this domain to address our specific use case. We present two approaches for level inpainting: an Autoencoder and a U-net. Through a comprehensive case study, we demonstrate their superior performance compared to a baseline method and discuss their relative merits. Furthermore, we provide a practical demonstration of both approaches for the level inpainting task and offer insights into potential directions for future research.",
    "link": "http://arxiv.org/abs/2309.09472",
    "context": "Title: Reconstructing Existing Levels through Level Inpainting. (arXiv:2309.09472v2 [cs.CV] UPDATED)\nAbstract: Procedural Content Generation (PCG) and Procedural Content Generation via Machine Learning (PCGML) have been used in prior work for generating levels in various games. This paper introduces Content Augmentation and focuses on the subproblem of level inpainting, which involves reconstructing and extending video game levels. Drawing inspiration from image inpainting, we adapt two techniques from this domain to address our specific use case. We present two approaches for level inpainting: an Autoencoder and a U-net. Through a comprehensive case study, we demonstrate their superior performance compared to a baseline method and discuss their relative merits. Furthermore, we provide a practical demonstration of both approaches for the level inpainting task and offer insights into potential directions for future research.",
    "path": "papers/23/09/2309.09472.json",
    "total_tokens": 822,
    "translated_title": "通过级别修复来重构现有级别",
    "translated_abstract": "在先前的工作中，已经使用了过程化内容生成（PCG）和通过机器学习进行的过程化内容生成（PCGML）来生成各种游戏中的级别。本文介绍了内容增强，并将重点放在级别修复的子问题上，该问题涉及重建和扩展视频游戏级别。受图像修复的启发，我们从这一领域中调整了两种技术以解决我们的特定用例。我们提出了两种级别修复的方法：自编码器和U-net。通过一个全面的案例研究，我们展示了它们相对于基准方法的卓越性能，并讨论了它们的相对优势。此外，我们为级别修复任务提供了两种方法的实际演示，并提供了对未来研究方向的见解。",
    "tldr": "本论文介绍了内容增强和级别修复的方法，通过两种技术（自编码器和U-net）来重建和扩展视频游戏级别。经过综合案例研究，我们展示了这两种方法相对于基准方法的卓越性能。提供了未来研究方向的见解。",
    "en_tdlr": "This paper introduces content augmentation and focuses on the subproblem of level inpainting in video games. With two techniques, an autoencoder and a U-net, the paper demonstrates superior performance compared to a baseline method. Practical demonstrations and insights for future research directions are provided."
}