{
    "title": "What is the Best Automated Metric for Text to Motion Generation?. (arXiv:2309.10248v1 [cs.CL])",
    "abstract": "There is growing interest in generating skeleton-based human motions from natural language descriptions. While most efforts have focused on developing better neural architectures for this task, there has been no significant work on determining the proper evaluation metric. Human evaluation is the ultimate accuracy measure for this task, and automated metrics should correlate well with human quality judgments. Since descriptions are compatible with many motions, determining the right metric is critical for evaluating and designing effective generative models. This paper systematically studies which metrics best align with human evaluations and proposes new metrics that align even better. Our findings indicate that none of the metrics currently used for this task show even a moderate correlation with human judgments on a sample level. However, for assessing average model performance, commonly used metrics such as R-Precision and less-used coordinate errors show strong correlations. Addit",
    "link": "http://arxiv.org/abs/2309.10248",
    "context": "Title: What is the Best Automated Metric for Text to Motion Generation?. (arXiv:2309.10248v1 [cs.CL])\nAbstract: There is growing interest in generating skeleton-based human motions from natural language descriptions. While most efforts have focused on developing better neural architectures for this task, there has been no significant work on determining the proper evaluation metric. Human evaluation is the ultimate accuracy measure for this task, and automated metrics should correlate well with human quality judgments. Since descriptions are compatible with many motions, determining the right metric is critical for evaluating and designing effective generative models. This paper systematically studies which metrics best align with human evaluations and proposes new metrics that align even better. Our findings indicate that none of the metrics currently used for this task show even a moderate correlation with human judgments on a sample level. However, for assessing average model performance, commonly used metrics such as R-Precision and less-used coordinate errors show strong correlations. Addit",
    "path": "papers/23/09/2309.10248.json",
    "total_tokens": 876,
    "translated_title": "文本到动作生成的最佳自动度量是什么？",
    "translated_abstract": "生成基于骨骼的人体动作并解释自然语言描述的兴趣日益增长。尽管大部分工作集中在为此任务开发更好的神经网络架构上，但在确定适当的评估度量方面没有进行重要工作。人类评估是该任务的最终准确性度量标准，自动度量应与人类质量判断相关性强。由于描述与许多动作相兼容，确定正确的度量对于评估和设计有效的生成模型至关重要。本文系统地研究了哪些度量与人类评估最吻合，并提出了与之更加吻合的新度量。我们的研究结果表明，目前用于此任务的度量中没有一个在样本级别上与人类判断有中等相关性。然而，对于评估平均模型性能，常用的度量如R-Precision和较少使用的坐标误差显示出较强的相关性。",
    "tldr": "该论文研究了文本到动作生成任务中与人类评估最吻合的度量，并提出了新的更优度量。结果发现当前用于该任务的度量与人类判断相关性较低，但用于评估平均模型性能的常用度量显示出较强的相关性。",
    "en_tdlr": "This paper studies the metrics that best align with human evaluations in the task of text to motion generation, and proposes new and improved metrics. The findings indicate that the currently used metrics for this task have low correlation with human judgments, but commonly used metrics for assessing average model performance show strong correlations."
}