{
    "title": "Unleashing the Power of Depth and Pose Estimation Neural Networks by Designing Compatible Endoscopic Images. (arXiv:2309.07390v1 [cs.CV])",
    "abstract": "Deep learning models have witnessed depth and pose estimation framework on unannotated datasets as a effective pathway to succeed in endoscopic navigation. Most current techniques are dedicated to developing more advanced neural networks to improve the accuracy. However, existing methods ignore the special properties of endoscopic images, resulting in an inability to fully unleash the power of neural networks. In this study, we conduct a detail analysis of the properties of endoscopic images and improve the compatibility of images and neural networks, to unleash the power of current neural networks. First, we introcude the Mask Image Modelling (MIM) module, which inputs partial image information instead of complete image information, allowing the network to recover global information from partial pixel information. This enhances the network' s ability to perceive global information and alleviates the phenomenon of local overfitting in convolutional neural networks due to local artifact",
    "link": "http://arxiv.org/abs/2309.07390",
    "context": "Title: Unleashing the Power of Depth and Pose Estimation Neural Networks by Designing Compatible Endoscopic Images. (arXiv:2309.07390v1 [cs.CV])\nAbstract: Deep learning models have witnessed depth and pose estimation framework on unannotated datasets as a effective pathway to succeed in endoscopic navigation. Most current techniques are dedicated to developing more advanced neural networks to improve the accuracy. However, existing methods ignore the special properties of endoscopic images, resulting in an inability to fully unleash the power of neural networks. In this study, we conduct a detail analysis of the properties of endoscopic images and improve the compatibility of images and neural networks, to unleash the power of current neural networks. First, we introcude the Mask Image Modelling (MIM) module, which inputs partial image information instead of complete image information, allowing the network to recover global information from partial pixel information. This enhances the network' s ability to perceive global information and alleviates the phenomenon of local overfitting in convolutional neural networks due to local artifact",
    "path": "papers/23/09/2309.07390.json",
    "total_tokens": 860,
    "translated_title": "通过设计兼容的内窥镜图像来释放深度和姿态估计神经网络的能力",
    "translated_abstract": "深度学习模型在未标注数据集上进行深度和姿态估计已成为成功进行内窥镜导航的有效途径。大多数当前的技术致力于开发更先进的神经网络以提高准确性。然而，现有方法忽视了内窥镜图像的特殊属性，导致无法充分发挥神经网络的能力。在本研究中，我们对内窥镜图像的属性进行详细分析，并改善图像和神经网络的兼容性，以释放当前神经网络的能力。首先，我们引入了Mask Image Modelling (MIM)模块，该模块输入部分图像信息而不是完整的图像信息，允许网络从部分像素信息中恢复全局信息。这增强了网络感知全局信息的能力，并减轻了卷积神经网络由于局部伪影而产生的局部过拟合现象。",
    "tldr": "本研究通过改进图像和神经网络的兼容性，引入了Mask Image Modelling (MIM)模块，从而能够充分发挥当前神经网络在内窥镜导航中的能力。"
}