{
    "title": "Evaluating Chatbots to Promote Users' Trust -- Practices and Open Problems. (arXiv:2309.05680v1 [cs.HC])",
    "abstract": "Chatbots, the common moniker for collaborative assistants, are Artificial Intelligence (AI) software that enables people to naturally interact with them to get tasks done. Although chatbots have been studied since the dawn of AI, they have particularly caught the imagination of the public and businesses since the launch of easy-to-use and general-purpose Large Language Model-based chatbots like ChatGPT. As businesses look towards chatbots as a potential technology to engage users, who may be end customers, suppliers, or even their own employees, proper testing of chatbots is important to address and mitigate issues of trust related to service or product performance, user satisfaction and long-term unintended consequences for society. This paper reviews current practices for chatbot testing, identifies gaps as open problems in pursuit of user trust, and outlines a path forward.",
    "link": "http://arxiv.org/abs/2309.05680",
    "context": "Title: Evaluating Chatbots to Promote Users' Trust -- Practices and Open Problems. (arXiv:2309.05680v1 [cs.HC])\nAbstract: Chatbots, the common moniker for collaborative assistants, are Artificial Intelligence (AI) software that enables people to naturally interact with them to get tasks done. Although chatbots have been studied since the dawn of AI, they have particularly caught the imagination of the public and businesses since the launch of easy-to-use and general-purpose Large Language Model-based chatbots like ChatGPT. As businesses look towards chatbots as a potential technology to engage users, who may be end customers, suppliers, or even their own employees, proper testing of chatbots is important to address and mitigate issues of trust related to service or product performance, user satisfaction and long-term unintended consequences for society. This paper reviews current practices for chatbot testing, identifies gaps as open problems in pursuit of user trust, and outlines a path forward.",
    "path": "papers/23/09/2309.05680.json",
    "total_tokens": 830,
    "translated_title": "评估聊天机器人以促进用户的信任 - 实践和开放问题",
    "translated_abstract": "聊天机器人是一种人工智能（AI）软件，通过与它们自然地互动来完成任务。尽管聊天机器人从人工智能诞生之初就已经被研究，但自从易于使用且通用的基于大型语言模型的聊天机器人如ChatGPT推出以来，聊天机器人特别吸引了公众和企业的关注。企业将聊天机器人作为一种潜在技术来吸引用户，这些用户可能是最终消费者、供应商，甚至是自己的员工，对聊天机器人进行适当的测试以解决和减轻与服务或产品性能、用户满意度以及对社会的长期意外后果相关的信任问题是重要的。本文回顾了当前聊天机器人测试的实践，确定了追求用户信任的开放问题，并提出了一个前进的路径。",
    "tldr": "本文评估了当前聊天机器人测试的实践和开放问题，旨在解决和减轻与用户信任相关的服务或产品性能、用户满意度以及对社会的长期意外后果问题。"
}