{
    "title": "Common Agency with Non-Delegation or Imperfect Commitment. (arXiv:2309.11595v1 [econ.TH])",
    "abstract": "In classical contract theory, we usually impose two assumptions: delegated contracts and perfect commitment. While the second assumption is demanding, the first one suffers no loss of generality. Following this tradition, current common-agency models impose delegated contracts and perfect commitment. We first show that non-delegated contracts expand the set of equilibrium outcomes under common agency. Furthermore, the powerful menu theorem for common agency (Peters (2001) and Martimort and Stole (2002)}) fails for either non-delegated contracts or imperfect commitment. We identify canonical contracts in such environments, and re-establish generalized menu theorems. Given imperfect commitment, our results for common-agency models are analogous to those in Bester and Strausz (2001) and Doval and Skreta (2012) for the classical contract theory, which re-establish the revelation principle.",
    "link": "http://arxiv.org/abs/2309.11595",
    "context": "Title: Common Agency with Non-Delegation or Imperfect Commitment. (arXiv:2309.11595v1 [econ.TH])\nAbstract: In classical contract theory, we usually impose two assumptions: delegated contracts and perfect commitment. While the second assumption is demanding, the first one suffers no loss of generality. Following this tradition, current common-agency models impose delegated contracts and perfect commitment. We first show that non-delegated contracts expand the set of equilibrium outcomes under common agency. Furthermore, the powerful menu theorem for common agency (Peters (2001) and Martimort and Stole (2002)}) fails for either non-delegated contracts or imperfect commitment. We identify canonical contracts in such environments, and re-establish generalized menu theorems. Given imperfect commitment, our results for common-agency models are analogous to those in Bester and Strausz (2001) and Doval and Skreta (2012) for the classical contract theory, which re-establish the revelation principle.",
    "path": "papers/23/09/2309.11595.json",
    "total_tokens": 824,
    "translated_title": "具有非委派或不完全承诺的共同代理",
    "translated_abstract": "在传统契约理论中，我们通常假设两个条件：委派契约和完全承诺。虽然第二个假设要求较高，但第一个假设并不会减少广义性。遵循这一传统，当前的共同代理模型强加了委派契约和完全承诺。首先，我们证明非委派契约扩大了共同代理下的均衡结果。此外，共同代理的强大菜单定理（Peters（2001）和Martimort和Stole（2002））对于非委派契约或不完全承诺是不适用的。我们在这样的环境中确定了典型契约，并重新确立了广义菜单定理。在不完全承诺的情况下，我们对共同代理模型的结果与经典契约理论中Bester和Strausz（2001）以及Doval和Skreta（2012）的结果类似，重新确立了启示原理。",
    "tldr": "在共同代理模型中，非委派契约或不完全承诺扩展了均衡结果的集合，并重新确立了广义菜单定理。",
    "en_tdlr": "Non-delegated contracts or imperfect commitment expand the set of equilibrium outcomes and re-establish generalized menu theorems in common agency models."
}