{
    "title": "GAME: Generalized deep learning model towards multimodal data integration for early screening of adolescent mental disorders. (arXiv:2309.10077v1 [cs.LG])",
    "abstract": "The timely identification of mental disorders in adolescents is a global public health challenge.Single factor is difficult to detect the abnormality due to its complex and subtle nature. Additionally, the generalized multimodal Computer-Aided Screening (CAS) systems with interactive robots for adolescent mental disorders are not available. Here, we design an android application with mini-games and chat recording deployed in a portable robot to screen 3,783 middle school students and construct the multimodal screening dataset, including facial images, physiological signs, voice recordings, and textual transcripts.We develop a model called GAME (Generalized Model with Attention and Multimodal EmbraceNet) with novel attention mechanism that integrates cross-modal features into the model. GAME evaluates adolescent mental conditions with high accuracy (73.34%-92.77%) and F1-Score (71.32%-91.06%).We find each modality contributes dynamically to the mental disorders screening and comorbiditi",
    "link": "http://arxiv.org/abs/2309.10077",
    "context": "Title: GAME: Generalized deep learning model towards multimodal data integration for early screening of adolescent mental disorders. (arXiv:2309.10077v1 [cs.LG])\nAbstract: The timely identification of mental disorders in adolescents is a global public health challenge.Single factor is difficult to detect the abnormality due to its complex and subtle nature. Additionally, the generalized multimodal Computer-Aided Screening (CAS) systems with interactive robots for adolescent mental disorders are not available. Here, we design an android application with mini-games and chat recording deployed in a portable robot to screen 3,783 middle school students and construct the multimodal screening dataset, including facial images, physiological signs, voice recordings, and textual transcripts.We develop a model called GAME (Generalized Model with Attention and Multimodal EmbraceNet) with novel attention mechanism that integrates cross-modal features into the model. GAME evaluates adolescent mental conditions with high accuracy (73.34%-92.77%) and F1-Score (71.32%-91.06%).We find each modality contributes dynamically to the mental disorders screening and comorbiditi",
    "path": "papers/23/09/2309.10077.json",
    "total_tokens": 942,
    "translated_title": "GAME: 一种用于早期筛查青少年心理障碍的多模态数据整合的广义深度学习模型",
    "translated_abstract": "及时发现青少年心理障碍是一个全球公共卫生挑战。由于其复杂而微妙的性质，单一因素很难检测到异常。此外，目前还没有广义的多模态图像与机器人相互作用的计算机辅助筛查系统用于检测青少年心理障碍。本研究设计了一个在便携机器人上部署的安卓应用程序，采用迷你游戏和聊天记录，对3,783名中学生进行筛查，并构建了包括面部图像、生理指标、语音记录和文本转录的多模态筛查数据集。我们开发了一个名为GAME（具有关注机制和多模态EmbraceNet的广义模型）的模型，该模型通过将跨模态特征整合到模型中，对青少年的心理状况进行高准确度（73.34%-92.77%）和F1-Score（71.32%-91.06%）的评估。我们发现每种模态动态地对心理障碍筛查和共病状况作出贡献。",
    "tldr": "本研究设计了一个广义深度学习模型GAME，通过整合多模态特征并采用新颖的关注机制，能够对青少年的心理状况进行高准确度的评估。研究发现每种模态都对心理障碍的筛查和共病状况有动态的贡献。"
}