{
    "title": "Robust Internal Representations for Domain Generalization. (arXiv:2309.15522v1 [cs.LG])",
    "abstract": "This paper which is part of the New Faculty Highlights Invited Speaker Program of AAAI'23, serves as a comprehensive survey of my research in transfer learning by utilizing embedding spaces. The work reviewed in this paper specifically revolves around the inherent challenges associated with continual learning and limited availability of labeled data. By providing an overview of my past and ongoing contributions, this paper aims to present a holistic understanding of my research, paving the way for future explorations and advancements in the field. My research delves into the various settings of transfer learning, including, few-shot learning, zero-shot learning, continual learning, domain adaptation, and distributed learning. I hope this survey provides a forward-looking perspective for researchers who would like to focus on similar research directions.",
    "link": "http://arxiv.org/abs/2309.15522",
    "context": "Title: Robust Internal Representations for Domain Generalization. (arXiv:2309.15522v1 [cs.LG])\nAbstract: This paper which is part of the New Faculty Highlights Invited Speaker Program of AAAI'23, serves as a comprehensive survey of my research in transfer learning by utilizing embedding spaces. The work reviewed in this paper specifically revolves around the inherent challenges associated with continual learning and limited availability of labeled data. By providing an overview of my past and ongoing contributions, this paper aims to present a holistic understanding of my research, paving the way for future explorations and advancements in the field. My research delves into the various settings of transfer learning, including, few-shot learning, zero-shot learning, continual learning, domain adaptation, and distributed learning. I hope this survey provides a forward-looking perspective for researchers who would like to focus on similar research directions.",
    "path": "papers/23/09/2309.15522.json",
    "total_tokens": 786,
    "translated_title": "鲁棒的内部表示在领域泛化中的应用",
    "translated_abstract": "本文是我在转移学习中利用嵌入空间进行研究的综合调查。本文主要讨论了持续学习和有限标记数据可用性所带来的固有挑战。通过总结我过去和正在进行中的贡献，本文旨在呈现我研究的整体理解，为未来领域的探索和进展铺平道路。我的研究涉及了转移学习的各种设置，包括少样本学习、零样本学习、持续学习、领域自适应和分布式学习。我希望这个调查提供给那些希望专注于类似研究方向的研究者一个前瞻性的视角。",
    "tldr": "本文综合调查了作者利用嵌入空间进行转移学习研究的成果，主要讨论了持续学习和有限标记数据可用性所带来的挑战，为未来领域的进展铺平道路。"
}