{
    "title": "Self-optimizing Feature Generation via Categorical Hashing Representation and Hierarchical Reinforcement Crossing. (arXiv:2309.04612v1 [cs.LG])",
    "abstract": "Feature generation aims to generate new and meaningful features to create a discriminative representation space.A generated feature is meaningful when the generated feature is from a feature pair with inherent feature interaction. In the real world, experienced data scientists can identify potentially useful feature-feature interactions, and generate meaningful dimensions from an exponentially large search space, in an optimal crossing form over an optimal generation path. But, machines have limited human-like abilities.We generalize such learning tasks as self-optimizing feature generation. Self-optimizing feature generation imposes several under-addressed challenges on existing systems: meaningful, robust, and efficient generation. To tackle these challenges, we propose a principled and generic representation-crossing framework to solve self-optimizing feature generation.To achieve hashing representation, we propose a three-step approach: feature discretization, feature hashing, and ",
    "link": "http://arxiv.org/abs/2309.04612",
    "context": "Title: Self-optimizing Feature Generation via Categorical Hashing Representation and Hierarchical Reinforcement Crossing. (arXiv:2309.04612v1 [cs.LG])\nAbstract: Feature generation aims to generate new and meaningful features to create a discriminative representation space.A generated feature is meaningful when the generated feature is from a feature pair with inherent feature interaction. In the real world, experienced data scientists can identify potentially useful feature-feature interactions, and generate meaningful dimensions from an exponentially large search space, in an optimal crossing form over an optimal generation path. But, machines have limited human-like abilities.We generalize such learning tasks as self-optimizing feature generation. Self-optimizing feature generation imposes several under-addressed challenges on existing systems: meaningful, robust, and efficient generation. To tackle these challenges, we propose a principled and generic representation-crossing framework to solve self-optimizing feature generation.To achieve hashing representation, we propose a three-step approach: feature discretization, feature hashing, and ",
    "path": "papers/23/09/2309.04612.json",
    "total_tokens": 867,
    "translated_title": "通过分类哈希表示和分层强化交叉进行自优化特征生成",
    "translated_abstract": "特征生成旨在生成新的有意义的特征，以创建一个具有区分度的表示空间。当生成的特征来自具有固有特征交互的特征对时，生成的特征是有意义的。在现实世界中，经验丰富的数据科学家可以识别出潜在有用的特征-特征交互，并从指数级的搜索空间中生成有意义的维度，在最优的生成路径上以最优的交叉形式。但是，机器的人类化能力有限。我们将这类学习任务概括为自优化特征生成。自优化特征生成对现有系统提出了几个未解决的挑战：有意义、稳健和高效的生成。为了解决这些挑战，我们提出了一种基于原则和通用的表示交叉框架来解决自优化特征生成。为了实现哈希表示，我们提出了一个三步法：特征离散化、特征哈希和...",
    "tldr": "通过分类哈希表示和分层强化交叉，提出了一种自优化特征生成的通用框架，解决了现有系统中的一些挑战，包括有意义、稳健和高效的生成。",
    "en_tdlr": "A universal framework for self-optimizing feature generation is proposed, which tackles challenges in existing systems, including meaningful, robust, and efficient generation, through categorical hashing representation and hierarchical reinforcement crossing."
}