{
    "title": "S3-DST: Structured Open-Domain Dialogue Segmentation and State Tracking in the Era of LLMs. (arXiv:2309.08827v1 [cs.CL])",
    "abstract": "The traditional Dialogue State Tracking (DST) problem aims to track user preferences and intents in user-agent conversations. While sufficient for task-oriented dialogue systems supporting narrow domain applications, the advent of Large Language Model (LLM)-based chat systems has introduced many real-world intricacies in open-domain dialogues. These intricacies manifest in the form of increased complexity in contextual interactions, extended dialogue sessions encompassing a diverse array of topics, and more frequent contextual shifts. To handle these intricacies arising from evolving LLM-based chat systems, we propose joint dialogue segmentation and state tracking per segment in open-domain dialogue systems. Assuming a zero-shot setting appropriate to a true open-domain dialogue system, we propose S3-DST, a structured prompting technique that harnesses Pre-Analytical Recollection, a novel grounding mechanism we designed for improving long context tracking. To demonstrate the efficacy o",
    "link": "http://arxiv.org/abs/2309.08827",
    "context": "Title: S3-DST: Structured Open-Domain Dialogue Segmentation and State Tracking in the Era of LLMs. (arXiv:2309.08827v1 [cs.CL])\nAbstract: The traditional Dialogue State Tracking (DST) problem aims to track user preferences and intents in user-agent conversations. While sufficient for task-oriented dialogue systems supporting narrow domain applications, the advent of Large Language Model (LLM)-based chat systems has introduced many real-world intricacies in open-domain dialogues. These intricacies manifest in the form of increased complexity in contextual interactions, extended dialogue sessions encompassing a diverse array of topics, and more frequent contextual shifts. To handle these intricacies arising from evolving LLM-based chat systems, we propose joint dialogue segmentation and state tracking per segment in open-domain dialogue systems. Assuming a zero-shot setting appropriate to a true open-domain dialogue system, we propose S3-DST, a structured prompting technique that harnesses Pre-Analytical Recollection, a novel grounding mechanism we designed for improving long context tracking. To demonstrate the efficacy o",
    "path": "papers/23/09/2309.08827.json",
    "total_tokens": 878,
    "translated_title": "S3-DST: 基于LLM的结构化开放域对话分段和状态跟踪",
    "translated_abstract": "传统的对话状态跟踪 (DST) 问题旨在追踪用户在用户-代理对话中的偏好和意图。尽管对于支持狭义领域应用的任务导向性对话系统来说已经足够，但基于大型语言模型 (LLM) 的聊天系统的出现引入了许多开放域对话中的现实复杂性。这些复杂性体现在上下文交互的增加复杂性、涵盖各种主题的延长对话会话以及更频繁的上下文转变等形式。为了处理基于演变的LLM聊天系统引起的这些复杂性，我们提出了在开放域对话系统中对每个段进行联合对话分割和状态跟踪。在适合真正的开放域对话系统的零-shot设置下，我们提出了S3-DST，这是一种结构化提示技术，利用了我们为提高长上下文跟踪而设计的一种新的接地机制 - Pre-Analytical Recollection。",
    "tldr": "S3-DST是基于LLM的开放域对话中结构化的对话分段和状态跟踪方法，利用Pre-Analytical Recollection机制提高长上下文跟踪。"
}