{
    "title": "Behind Recommender Systems: the Geography of the ACM RecSys Community. (arXiv:2309.03512v1 [cs.IR])",
    "abstract": "The amount and dissemination rate of media content accessible online is nowadays overwhelming. Recommender Systems filter this information into manageable streams or feeds, adapted to our personal needs or preferences. It is of utter importance that algorithms employed to filter information do not distort or cut out important elements from our perspectives of the world. Under this principle, it is essential to involve diverse views and teams from the earliest stages of their design and development. This has been highlighted, for instance, in recent European Union regulations such as the Digital Services Act, via the requirement of risk monitoring, including the risk of discrimination, and the AI Act, through the requirement to involve people with diverse backgrounds in the development of AI systems. We look into the geographic diversity of the recommender systems research community, specifically by analyzing the affiliation countries of the authors who contributed to the ACM Conference",
    "link": "http://arxiv.org/abs/2309.03512",
    "context": "Title: Behind Recommender Systems: the Geography of the ACM RecSys Community. (arXiv:2309.03512v1 [cs.IR])\nAbstract: The amount and dissemination rate of media content accessible online is nowadays overwhelming. Recommender Systems filter this information into manageable streams or feeds, adapted to our personal needs or preferences. It is of utter importance that algorithms employed to filter information do not distort or cut out important elements from our perspectives of the world. Under this principle, it is essential to involve diverse views and teams from the earliest stages of their design and development. This has been highlighted, for instance, in recent European Union regulations such as the Digital Services Act, via the requirement of risk monitoring, including the risk of discrimination, and the AI Act, through the requirement to involve people with diverse backgrounds in the development of AI systems. We look into the geographic diversity of the recommender systems research community, specifically by analyzing the affiliation countries of the authors who contributed to the ACM Conference",
    "path": "papers/23/09/2309.03512.json",
    "total_tokens": 870,
    "translated_title": "推荐系统研究中的地理因素：ACM RecSys社区的地理分布",
    "translated_abstract": "现在在线可访问的媒体内容数量和传播速度是压倒性的。推荐系统可以将这些信息过滤成适应我们个人需求或偏好的可管理的流或动态。但是，很重要的一点是过滤信息的算法不能扭曲或削减我们对世界的观点中的重要元素。根据这一原则，最早期的设计和开发阶段必须涉及多元化的观点和团队的参与。例如，最近欧盟的相关法规（如数字服务法案和AI法案）强调了风险监测，包括歧视风险，并要求在AI系统的开发中吸引多背景的人参与。本研究着眼于推荐系统研究社区的地理多样性，具体通过分析在ACM会议上贡献论文的作者所属国家。",
    "tldr": "该研究通过分析参与ACM会议的作者所属国家，探讨了推荐系统研究社区的地理多样性。这强调了在推荐系统设计和开发的早期阶段，需要涉及来自不同背景的观点和团队的参与。",
    "en_tdlr": "This study investigates the geographic diversity of the recommender systems research community by analyzing the affiliation countries of authors contributing to the ACM Conference. It highlights the need to involve diverse perspectives and teams from different backgrounds in the early stages of recommender system design and development."
}