{
    "title": "Reward Function Design for Crowd Simulation via Reinforcement Learning. (arXiv:2309.12841v1 [cs.LG])",
    "abstract": "Crowd simulation is important for video-games design, since it enables to populate virtual worlds with autonomous avatars that navigate in a human-like manner. Reinforcement learning has shown great potential in simulating virtual crowds, but the design of the reward function is critical to achieving effective and efficient results. In this work, we explore the design of reward functions for reinforcement learning-based crowd simulation. We provide theoretical insights on the validity of certain reward functions according to their analytical properties, and evaluate them empirically using a range of scenarios, using the energy efficiency as the metric. Our experiments show that directly minimizing the energy usage is a viable strategy as long as it is paired with an appropriately scaled guiding potential, and enable us to study the impact of the different reward components on the behavior of the simulated crowd. Our findings can inform the development of new crowd simulation techniques",
    "link": "http://arxiv.org/abs/2309.12841",
    "context": "Title: Reward Function Design for Crowd Simulation via Reinforcement Learning. (arXiv:2309.12841v1 [cs.LG])\nAbstract: Crowd simulation is important for video-games design, since it enables to populate virtual worlds with autonomous avatars that navigate in a human-like manner. Reinforcement learning has shown great potential in simulating virtual crowds, but the design of the reward function is critical to achieving effective and efficient results. In this work, we explore the design of reward functions for reinforcement learning-based crowd simulation. We provide theoretical insights on the validity of certain reward functions according to their analytical properties, and evaluate them empirically using a range of scenarios, using the energy efficiency as the metric. Our experiments show that directly minimizing the energy usage is a viable strategy as long as it is paired with an appropriately scaled guiding potential, and enable us to study the impact of the different reward components on the behavior of the simulated crowd. Our findings can inform the development of new crowd simulation techniques",
    "path": "papers/23/09/2309.12841.json",
    "total_tokens": 928,
    "translated_title": "基于强化学习的人群模拟中的奖励函数设计",
    "translated_abstract": "人群模拟对于视频游戏设计非常重要，它可以在虚拟世界中放置具有人类般行为的自主角色。强化学习在模拟虚拟人群方面表现出巨大潜力，但奖励函数的设计对于实现有效和高效的结果至关重要。本研究探讨了基于强化学习的人群模拟中的奖励函数设计。我们提供了理论上关于某些奖励函数的有效性的洞见，并使用能源效率作为指标，在各种场景下进行了经验评估。我们的实验表明，直接最小化能源使用是一个可行的策略，只要它与适当调整的引导势相结合，并且使我们能够研究不同奖励组成对模拟人群行为的影响。我们的发现可以为新的人群模拟技术的发展提供信息。",
    "tldr": "本论文研究了基于强化学习的人群模拟中的奖励函数设计。通过理论分析和经验评估，我们发现直接最小化能源使用并配合适当的引导势是一种有效的策略，并且不同奖励组成对模拟人群行为具有影响。这些发现对于新的人群模拟技术的开发具有指导意义。",
    "en_tdlr": "This paper explores the design of reward functions for reinforcement learning-based crowd simulation. The findings indicate that minimizing energy usage with appropriately scaled guiding potential is an effective strategy, and different reward components have an impact on the behavior of simulated crowd. These insights can inform the development of new crowd simulation techniques."
}