{
    "title": "Leveraging Uncertainties to Infer Preferences: Robust Analysis of School Choice. (arXiv:2309.14297v1 [econ.GN])",
    "abstract": "Inferring applicant preferences is fundamental in many analyses of school-choice data. Application mistakes make this task challenging. We propose a novel approach to deal with the mistakes in a deferred-acceptance matching environment. The key insight is that the uncertainties faced by applicants, e.g., due to tie-breaking lotteries, render some mistakes costly, allowing us to reliably infer relevant preferences. Our approach extracts all information on preferences robustly to payoff-insignificant mistakes. We apply it to school-choice data from Staten Island, NYC. Counterfactual analysis suggests that we underestimate the effects of proposed desegregation reforms when applicants' mistakes are not accounted for in preference inference and estimation.",
    "link": "http://arxiv.org/abs/2309.14297",
    "context": "Title: Leveraging Uncertainties to Infer Preferences: Robust Analysis of School Choice. (arXiv:2309.14297v1 [econ.GN])\nAbstract: Inferring applicant preferences is fundamental in many analyses of school-choice data. Application mistakes make this task challenging. We propose a novel approach to deal with the mistakes in a deferred-acceptance matching environment. The key insight is that the uncertainties faced by applicants, e.g., due to tie-breaking lotteries, render some mistakes costly, allowing us to reliably infer relevant preferences. Our approach extracts all information on preferences robustly to payoff-insignificant mistakes. We apply it to school-choice data from Staten Island, NYC. Counterfactual analysis suggests that we underestimate the effects of proposed desegregation reforms when applicants' mistakes are not accounted for in preference inference and estimation.",
    "path": "papers/23/09/2309.14297.json",
    "total_tokens": 784,
    "translated_title": "利用不确定性推断偏好：对学校选择进行鲁棒分析",
    "translated_abstract": "推断申请人的偏好在许多学校选择数据分析中至关重要。申请错误使这项任务变得具有挑战性。我们提出了一种处理延迟接受匹配环境中的错误的新方法。关键的洞察力是，申请人面临的不确定性，例如由于抽签彩票，使一些错误变得昂贵，从而使我们能够可靠地推断出相关的偏好。我们的方法从所有关于偏好的信息中鲁棒地提取支付无关紧要的错误。我们将其应用于纽约市斯塔滕岛的学校选择数据。反事实分析表明，如果在偏好推断和估计中不考虑申请人的错误，我们会低估提出的种族融合改革的效果。",
    "tldr": "通过针对学校选择数据中的申请错误提出的新方法，我们能够可靠地推断出申请人的偏好，并发现没有考虑这些错误时会低估提出的种族融合改革的效果。",
    "en_tdlr": "By proposing a novel approach to deal with application mistakes in school-choice data, we are able to reliably infer applicant preferences and find that the proposed desegregation reforms are underestimated when these mistakes are not accounted for."
}