{
    "title": "Temporal Patience: Efficient Adaptive Deep Learning for Embedded Radar Data Processing. (arXiv:2309.05686v1 [cs.LG])",
    "abstract": "Radar sensors offer power-efficient solutions for always-on smart devices, but processing the data streams on resource-constrained embedded platforms remains challenging. This paper presents novel techniques that leverage the temporal correlation present in streaming radar data to enhance the efficiency of Early Exit Neural Networks for Deep Learning inference on embedded devices. These networks add additional classifier branches between the architecture's hidden layers that allow for an early termination of the inference if their result is deemed sufficient enough by an at-runtime decision mechanism. Our methods enable more informed decisions on when to terminate the inference, reducing computational costs while maintaining a minimal loss of accuracy.  Our results demonstrate that our techniques save up to 26% of operations per inference over a Single Exit Network and 12% over a confidence-based Early Exit version. Our proposed techniques work on commodity hardware and can be combined",
    "link": "http://arxiv.org/abs/2309.05686",
    "context": "Title: Temporal Patience: Efficient Adaptive Deep Learning for Embedded Radar Data Processing. (arXiv:2309.05686v1 [cs.LG])\nAbstract: Radar sensors offer power-efficient solutions for always-on smart devices, but processing the data streams on resource-constrained embedded platforms remains challenging. This paper presents novel techniques that leverage the temporal correlation present in streaming radar data to enhance the efficiency of Early Exit Neural Networks for Deep Learning inference on embedded devices. These networks add additional classifier branches between the architecture's hidden layers that allow for an early termination of the inference if their result is deemed sufficient enough by an at-runtime decision mechanism. Our methods enable more informed decisions on when to terminate the inference, reducing computational costs while maintaining a minimal loss of accuracy.  Our results demonstrate that our techniques save up to 26% of operations per inference over a Single Exit Network and 12% over a confidence-based Early Exit version. Our proposed techniques work on commodity hardware and can be combined",
    "path": "papers/23/09/2309.05686.json",
    "total_tokens": 1005,
    "translated_title": "时间耐心：用于嵌入式雷达数据处理的高效自适应深度学习",
    "translated_abstract": "雷达传感器为常开智能设备提供了功耗高效的解决方案，但在资源受限的嵌入式平台上处理数据流仍然具有挑战性。本文介绍了一种利用流式雷达数据中的时间相关性来增强嵌入式设备上深度学习推理的早期退出神经网络的效率的新技术。这些网络在架构的隐藏层之间添加了额外的分类器分支，允许根据运行时决策机制的结果，在推理过程中提前终止。我们的方法使得在何时终止推理有更明智的决策，从而降低计算成本同时保持最小的准确度损失。我们的结果表明，与单路退出网络相比，我们的技术每次推理节省了高达26%的操作，与基于置信度的早期退出版本相比节省了12%。我们提出的技术适用于通用硬件并可以结合使用。",
    "tldr": "该论文提出了一种利用流式雷达数据的时间相关性来增强嵌入式设备上深度学习推理效率的新技术。通过在网络中添加额外的分类器分支，实现根据运行时决策机制提前终止推理，从而降低计算成本而保持最小的准确度损失。实验结果表明，该技术能够比单路退出网络和基于置信度的早期退出版本节省高达26%和12%的推理操作。这些技术适用于通用硬件并可以结合使用。",
    "en_tdlr": "This paper presents a novel technique that leverages the temporal correlation in streaming radar data to enhance the efficiency of deep learning inference on embedded devices. By adding additional classifier branches and using a runtime decision mechanism, the technique allows for early termination of inference, reducing computational costs while maintaining minimal loss of accuracy. Experimental results show significant savings in operations compared to existing methods. These techniques are applicable to commodity hardware and can be combined for further improvement."
}