{
    "title": "NeuroCADR: Drug Repurposing to Reveal Novel Anti-Epileptic Drug Candidates Through an Integrated Computational Approach. (arXiv:2309.13047v1 [q-bio.BM])",
    "abstract": "Drug repurposing is an emerging approach for drug discovery involving the reassignment of existing drugs for novel purposes. An alternative to the traditional de novo process of drug development, repurposed drugs are faster, cheaper, and less failure prone than drugs developed from traditional methods. Recently, drug repurposing has been performed in silico, in which databases of drugs and chemical information are used to determine interactions between target proteins and drug molecules to identify potential drug candidates. A proposed algorithm is NeuroCADR, a novel system for drug repurposing via a multi-pronged approach consisting of k-nearest neighbor algorithms (KNN), random forest classification, and decision trees. Data was sourced from several databases consisting of interactions between diseases, symptoms, genes, and affiliated drug molecules, which were then compiled into datasets expressed in binary. The proposed method displayed a high level of accuracy, outperforming nearl",
    "link": "http://arxiv.org/abs/2309.13047",
    "context": "Title: NeuroCADR: Drug Repurposing to Reveal Novel Anti-Epileptic Drug Candidates Through an Integrated Computational Approach. (arXiv:2309.13047v1 [q-bio.BM])\nAbstract: Drug repurposing is an emerging approach for drug discovery involving the reassignment of existing drugs for novel purposes. An alternative to the traditional de novo process of drug development, repurposed drugs are faster, cheaper, and less failure prone than drugs developed from traditional methods. Recently, drug repurposing has been performed in silico, in which databases of drugs and chemical information are used to determine interactions between target proteins and drug molecules to identify potential drug candidates. A proposed algorithm is NeuroCADR, a novel system for drug repurposing via a multi-pronged approach consisting of k-nearest neighbor algorithms (KNN), random forest classification, and decision trees. Data was sourced from several databases consisting of interactions between diseases, symptoms, genes, and affiliated drug molecules, which were then compiled into datasets expressed in binary. The proposed method displayed a high level of accuracy, outperforming nearl",
    "path": "papers/23/09/2309.13047.json",
    "total_tokens": 967,
    "translated_title": "NeuroCADR:通过综合计算方法进行药物重用以揭示新的抗癫痫药物候选人",
    "translated_abstract": "药物重用是一种新兴的药物发现方法，涉及将现有药物重新用于新的目的。与传统的药物开发的全新过程相比，重用药物更快速、更廉价、更少失败。最近，药物重用在计算机模拟中进行，利用药物和化学信息的数据库确定靶蛋白和药物分子之间的相互作用，从而识别潜在的药物候选人。提出了一种名为NeuroCADR的算法，它是通过多重途径的方法进行药物重用的一种新颖系统，包括k最近邻算法（KNN）、随机森林分类和决策树。数据来自几个数据库，包括疾病、症状、基因和相关药物分子之间的相互作用，然后编译成二进制表示的数据集。该方法显示出较高的准确性，表现优于近似方法。",
    "tldr": "本文介绍了一种名为NeuroCADR的算法，通过综合计算方法进行药物重用以揭示新的抗癫痫药物候选人。该方法利用数据库的信息，确定靶蛋白和药物分子的相互作用，通过k最近邻算法、随机森林分类和决策树等方法提高了准确性。"
}