{
    "title": "Single Biological Neurons as Temporally Precise Spatio-Temporal Pattern Recognizers. (arXiv:2309.15090v1 [q-bio.NC])",
    "abstract": "This PhD thesis is focused on the central idea that single neurons in the brain should be regarded as temporally precise and highly complex spatio-temporal pattern recognizers. This is opposed to the prevalent view of biological neurons as simple and mainly spatial pattern recognizers by most neuroscientists today. In this thesis, I will attempt to demonstrate that this is an important distinction, predominantly because the above-mentioned computational properties of single neurons have far-reaching implications with respect to the various brain circuits that neurons compose, and on how information is encoded by neuronal activity in the brain. Namely, that these particular \"low-level\" details at the single neuron level have substantial system-wide ramifications. In the introduction we will highlight the main components that comprise a neural microcircuit that can perform useful computations and illustrate the inter-dependence of these components from a system perspective. In chapter 1 ",
    "link": "http://arxiv.org/abs/2309.15090",
    "context": "Title: Single Biological Neurons as Temporally Precise Spatio-Temporal Pattern Recognizers. (arXiv:2309.15090v1 [q-bio.NC])\nAbstract: This PhD thesis is focused on the central idea that single neurons in the brain should be regarded as temporally precise and highly complex spatio-temporal pattern recognizers. This is opposed to the prevalent view of biological neurons as simple and mainly spatial pattern recognizers by most neuroscientists today. In this thesis, I will attempt to demonstrate that this is an important distinction, predominantly because the above-mentioned computational properties of single neurons have far-reaching implications with respect to the various brain circuits that neurons compose, and on how information is encoded by neuronal activity in the brain. Namely, that these particular \"low-level\" details at the single neuron level have substantial system-wide ramifications. In the introduction we will highlight the main components that comprise a neural microcircuit that can perform useful computations and illustrate the inter-dependence of these components from a system perspective. In chapter 1 ",
    "path": "papers/23/09/2309.15090.json",
    "total_tokens": 894,
    "translated_title": "单一生物神经元作为精确的时空模式识别器",
    "translated_abstract": "这篇博士论文的重点是认为大脑中的单个神经元应被视为临时精确且高度复杂的时空模式识别器。与当今大多数神经科学家认为的生物神经元是简单且主要是空间模式识别器的观点相反。在这篇论文中，我将尝试证明这是一个重要的区别，主要是因为单个神经元的上述计算特性对神经元组成的各种脑回路以及神经活动如何编码信息都具有广泛的影响。即这些单个神经元层面的“低级”细节对整个系统有着重大的影响。在引言中，我们将强调组成神经微电路的主要组成部分，并从系统的角度阐明这些组成部分的相互依赖关系。",
    "tldr": "这篇博士论文的核心观点是，单一生物神经元具有时空模式识别的精确性和复杂性，与目前大多数神经科学家的观点不同。这一点对神经元组成的脑回路和神经活动的信息编码具有广泛的影响。",
    "en_tdlr": "The main idea of this PhD thesis is that single biological neurons should be seen as temporally precise and highly complex spatio-temporal pattern recognizers, which is different from the common view of most neuroscientists. This has significant implications for the brain circuits and information encoding by neuronal activity."
}