{
    "title": "Current Methods for Drug Property Prediction in the Real World. (arXiv:2309.17161v1 [q-bio.BM])",
    "abstract": "Predicting drug properties is key in drug discovery to enable de-risking of assets before expensive clinical trials, and to find highly active compounds faster. Interest from the Machine Learning community has led to the release of a variety of benchmark datasets and proposed methods. However, it remains unclear for practitioners which method or approach is most suitable, as different papers benchmark on different datasets and methods, leading to varying conclusions that are not easily compared. Our large-scale empirical study links together numerous earlier works on different datasets and methods; thus offering a comprehensive overview of the existing property classes, datasets, and their interactions with different methods. We emphasise the importance of uncertainty quantification and the time and therefore cost of applying these methods in the drug development decision-making cycle. We discover that the best method depends on the dataset, and that engineered features with classical ",
    "link": "http://arxiv.org/abs/2309.17161",
    "context": "Title: Current Methods for Drug Property Prediction in the Real World. (arXiv:2309.17161v1 [q-bio.BM])\nAbstract: Predicting drug properties is key in drug discovery to enable de-risking of assets before expensive clinical trials, and to find highly active compounds faster. Interest from the Machine Learning community has led to the release of a variety of benchmark datasets and proposed methods. However, it remains unclear for practitioners which method or approach is most suitable, as different papers benchmark on different datasets and methods, leading to varying conclusions that are not easily compared. Our large-scale empirical study links together numerous earlier works on different datasets and methods; thus offering a comprehensive overview of the existing property classes, datasets, and their interactions with different methods. We emphasise the importance of uncertainty quantification and the time and therefore cost of applying these methods in the drug development decision-making cycle. We discover that the best method depends on the dataset, and that engineered features with classical ",
    "path": "papers/23/09/2309.17161.json",
    "total_tokens": 882,
    "translated_title": "当前的药物属性预测方法在实际应用中的应用",
    "translated_abstract": "在药物发现中，预测药物属性对于在昂贵的临床试验之前降低风险、快速找到高活性化合物是至关重要的。机器学习社区的兴趣导致了多种基准数据集和提出的方法的发布。然而，对于从业者来说，不同文件在不同数据集和方法上进行基准测试，得出的结论也不易于比较，因此仍然不清楚哪种方法或方法最合适。我们的大规模实证研究将之前的许多不同数据集和方法的研究链接在一起，从而提供了现有属性类别、数据集及其与不同方法的相互作用的综合概述。我们强调不确定性量化的重要性，以及应用这些方法在药物开发决策周期中的时间和成本问题。我们发现最好的方法取决于数据集，而使用经过工程处理的特征与经典方法结合的效果较好。",
    "tldr": "该论文介绍了当前药物属性预测方法的实际应用情况，并强调了不同数据集和方法之间的关联。研究发现最好的预测方法取决于数据集，使用经过工程处理的特征与经典方法结合的效果较好。"
}