{
    "title": "Writer-Defined AI Personas for On-Demand Feedback Generation. (arXiv:2309.10433v1 [cs.HC])",
    "abstract": "Compelling writing is tailored to its audience. This is challenging, as writers may struggle to empathize with readers, get feedback in time, or gain access to the target group. We propose a concept that generates on-demand feedback, based on writer-defined AI personas of any target audience. We explore this concept with a prototype (using GPT-3.5) in two user studies (N=5 and N=11): Writers appreciated the concept and strategically used personas for getting different perspectives. The feedback was seen as helpful and inspired revisions of text and personas, although it was often verbose and unspecific. We discuss the impact of on-demand feedback, the limited representativity of contemporary AI systems, and further ideas for defining AI personas. This work contributes to the vision of supporting writers with AI by expanding the socio-technical perspective in AI tool design: To empower creators, we also need to keep in mind their relationship to an audience.",
    "link": "http://arxiv.org/abs/2309.10433",
    "context": "Title: Writer-Defined AI Personas for On-Demand Feedback Generation. (arXiv:2309.10433v1 [cs.HC])\nAbstract: Compelling writing is tailored to its audience. This is challenging, as writers may struggle to empathize with readers, get feedback in time, or gain access to the target group. We propose a concept that generates on-demand feedback, based on writer-defined AI personas of any target audience. We explore this concept with a prototype (using GPT-3.5) in two user studies (N=5 and N=11): Writers appreciated the concept and strategically used personas for getting different perspectives. The feedback was seen as helpful and inspired revisions of text and personas, although it was often verbose and unspecific. We discuss the impact of on-demand feedback, the limited representativity of contemporary AI systems, and further ideas for defining AI personas. This work contributes to the vision of supporting writers with AI by expanding the socio-technical perspective in AI tool design: To empower creators, we also need to keep in mind their relationship to an audience.",
    "path": "papers/23/09/2309.10433.json",
    "total_tokens": 999,
    "translated_title": "为即时反馈生成定义AI人物形象",
    "translated_abstract": "优秀的写作应该根据受众进行适应。然而，作家可能难以同读者产生共鸣，难以及时获得反馈或者难以获得目标群体的信息。本论文提出了一种概念，即基于作家定义的任何目标受众的AI人物形象生成即时反馈。我们通过一个原型（使用GPT-3.5）在两项用户研究（N=5和N=11）中探索了这一概念：作家们赞赏这一概念，并且战略性地使用人物形象来获得不同的观点。反馈被认为是有帮助的，并且激发了文本和人物形象的修订，尽管该反馈通常冗长而不具体。我们讨论了即时反馈的影响、当代AI系统的有限代表性以及进一步定义AI人物的想法。这项工作在支持作家与AI的愿景中做出了贡献，扩展了AI工具设计中的社会技术视角：为了赋予创作者权力，我们还需要考虑他们与观众的关系。",
    "tldr": "这项研究提出了基于作家定义的AI人物形象生成即时反馈的概念，通过两项用户研究表明，这个概念受到了作家的欢迎并帮助他们获得不同的观点。这项工作扩展了AI工具设计中的社会技术视角，为支持作家与AI的愿景做出了贡献。",
    "en_tdlr": "This research proposes the concept of generating on-demand feedback based on writer-defined AI personas, and two user studies show that writers appreciate the concept and find it helpful in gaining different perspectives. The work expands the socio-technical perspective in AI tool design and contributes to the vision of supporting writers with AI."
}