{
    "title": "Dynamic Spectrum Mixer for Visual Recognition. (arXiv:2309.06721v1 [cs.CV])",
    "abstract": "Recently, MLP-based vision backbones have achieved promising performance in several visual recognition tasks. However, the existing MLP-based methods directly aggregate tokens with static weights, leaving the adaptability to different images untouched. Moreover, Recent research demonstrates that MLP-Transformer is great at creating long-range dependencies but ineffective at catching high frequencies that primarily transmit local information, which prevents it from applying to the downstream dense prediction tasks, such as semantic segmentation. To address these challenges, we propose a content-adaptive yet computationally efficient structure, dubbed Dynamic Spectrum Mixer (DSM). The DSM represents token interactions in the frequency domain by employing the Discrete Cosine Transform, which can learn long-term spatial dependencies with log-linear complexity. Furthermore, a dynamic spectrum weight generation layer is proposed as the spectrum bands selector, which could emphasize the infor",
    "link": "http://arxiv.org/abs/2309.06721",
    "context": "Title: Dynamic Spectrum Mixer for Visual Recognition. (arXiv:2309.06721v1 [cs.CV])\nAbstract: Recently, MLP-based vision backbones have achieved promising performance in several visual recognition tasks. However, the existing MLP-based methods directly aggregate tokens with static weights, leaving the adaptability to different images untouched. Moreover, Recent research demonstrates that MLP-Transformer is great at creating long-range dependencies but ineffective at catching high frequencies that primarily transmit local information, which prevents it from applying to the downstream dense prediction tasks, such as semantic segmentation. To address these challenges, we propose a content-adaptive yet computationally efficient structure, dubbed Dynamic Spectrum Mixer (DSM). The DSM represents token interactions in the frequency domain by employing the Discrete Cosine Transform, which can learn long-term spatial dependencies with log-linear complexity. Furthermore, a dynamic spectrum weight generation layer is proposed as the spectrum bands selector, which could emphasize the infor",
    "path": "papers/23/09/2309.06721.json",
    "total_tokens": 910,
    "translated_title": "动态频谱混合器用于视觉识别",
    "translated_abstract": "最近，基于多层感知器（MLP）的视觉主干在几个视觉识别任务中取得了令人期待的性能。然而，现有的基于MLP的方法直接使用静态权重聚合令其无法适应不同的图像。此外，最近的研究表明，MLP-Transformer在创建远程依赖性方面表现出色，但在捕捉主要传输局部信息的高频率方面表现不佳，这使其无法应用于下游的稠密预测任务，如语义分割。为了解决这些挑战，我们提出了一种内容自适应且计算效率高的结构，称为动态频谱混合器（DSM）。DSM通过应用离散余弦变换在频域中表示令牌之间的交互，可以以对数线性复杂度学习长期的空间依赖性。此外，我们还提出了一种动态频谱权重生成层作为频谱带选择器，能够强调信息的重要程度。",
    "tldr": "动态频谱混合器（DSM）是一种内容自适应且计算效率高的结构，通过离散余弦变换表示令牌之间的交互，能够学习长期的空间依赖性。它还引入了动态频谱权重生成层作为频谱带选择器，以强调信息的重要程度。",
    "en_tdlr": "DSM is a content-adaptive and computationally efficient structure that represents token interactions using Discrete Cosine Transform, enabling learning of long-term spatial dependencies. It introduces a dynamic spectrum weight generation layer as a spectrum band selector to emphasize the importance of information."
}