{
    "title": "ViCGCN: Graph Convolutional Network with Contextualized Language Models for Social Media Mining in Vietnamese. (arXiv:2309.02902v1 [cs.CL])",
    "abstract": "Social media processing is a fundamental task in natural language processing with numerous applications. As Vietnamese social media and information science have grown rapidly, the necessity of information-based mining on Vietnamese social media has become crucial. However, state-of-the-art research faces several significant drawbacks, including imbalanced data and noisy data on social media platforms. Imbalanced and noisy are two essential issues that need to be addressed in Vietnamese social media texts. Graph Convolutional Networks can address the problems of imbalanced and noisy data in text classification on social media by taking advantage of the graph structure of the data. This study presents a novel approach based on contextualized language model (PhoBERT) and graph-based method (Graph Convolutional Networks). In particular, the proposed approach, ViCGCN, jointly trained the power of Contextualized embeddings with the ability of Graph Convolutional Networks, GCN, to capture mor",
    "link": "http://arxiv.org/abs/2309.02902",
    "context": "Title: ViCGCN: Graph Convolutional Network with Contextualized Language Models for Social Media Mining in Vietnamese. (arXiv:2309.02902v1 [cs.CL])\nAbstract: Social media processing is a fundamental task in natural language processing with numerous applications. As Vietnamese social media and information science have grown rapidly, the necessity of information-based mining on Vietnamese social media has become crucial. However, state-of-the-art research faces several significant drawbacks, including imbalanced data and noisy data on social media platforms. Imbalanced and noisy are two essential issues that need to be addressed in Vietnamese social media texts. Graph Convolutional Networks can address the problems of imbalanced and noisy data in text classification on social media by taking advantage of the graph structure of the data. This study presents a novel approach based on contextualized language model (PhoBERT) and graph-based method (Graph Convolutional Networks). In particular, the proposed approach, ViCGCN, jointly trained the power of Contextualized embeddings with the ability of Graph Convolutional Networks, GCN, to capture mor",
    "path": "papers/23/09/2309.02902.json",
    "total_tokens": 914,
    "translated_title": "ViCGCN: 基于上下文化语言模型的社交媒体挖掘中文本图卷积网络",
    "translated_abstract": "社交媒体处理是自然语言处理中的一个基本任务，具有众多的应用。随着越南社交媒体和信息科学的快速发展，对越南社交媒体进行基于信息的挖掘变得至关重要。然而，现有的研究面临着一些重要的缺点，包括社交媒体平台上的数据不平衡和噪声数据。在越南社交媒体文本中，数据不平衡和噪声是需要解决的两个重要问题。图卷积网络可以通过利用数据的图结构来解决社交媒体文本分类中的数据不平衡和噪声问题。本研究提出了一种基于上下文化语言模型（PhoBERT）和基于图的方法（图卷积网络）的创新方法。特别地，所提出的方法ViCGCN通过联合训练上下文嵌入的能力和图卷积网络（GCN）的能力，捕捉越南社交媒体文本的语义信息。",
    "tldr": "本研究提出了一种基于上下文化语言模型和图卷积网络的创新方法，能够解决越南社交媒体文本中的数据不平衡和噪声问题，并捕捉语义信息。"
}