{
    "title": "ChatGPT Assisting Diagnosis of Neuro-ophthalmology Diseases Based on Case Reports. (arXiv:2309.12361v1 [cs.CY])",
    "abstract": "Objective: To evaluate the efficiency of large language models (LLMs) such as ChatGPT to assist in diagnosing neuro-ophthalmic diseases based on detailed case descriptions. Methods: We selected 22 different case reports of neuro-ophthalmic diseases from a publicly available online database. These cases included a wide range of chronic and acute diseases that are commonly seen by neuro-ophthalmic sub-specialists. We inserted the text from each case as a new prompt into both ChatGPT v3.5 and ChatGPT Plus v4.0 and asked for the most probable diagnosis. We then presented the exact information to two neuro-ophthalmologists and recorded their diagnoses followed by comparison to responses from both versions of ChatGPT. Results: ChatGPT v3.5, ChatGPT Plus v4.0, and the two neuro-ophthalmologists were correct in 13 (59%), 18 (82%), 19 (86%), and 19 (86%) out of 22 cases, respectively. The agreement between the various diagnostic sources were as follows: ChatGPT v3.5 and ChatGPT Plus v4.0, 13 (5",
    "link": "http://arxiv.org/abs/2309.12361",
    "context": "Title: ChatGPT Assisting Diagnosis of Neuro-ophthalmology Diseases Based on Case Reports. (arXiv:2309.12361v1 [cs.CY])\nAbstract: Objective: To evaluate the efficiency of large language models (LLMs) such as ChatGPT to assist in diagnosing neuro-ophthalmic diseases based on detailed case descriptions. Methods: We selected 22 different case reports of neuro-ophthalmic diseases from a publicly available online database. These cases included a wide range of chronic and acute diseases that are commonly seen by neuro-ophthalmic sub-specialists. We inserted the text from each case as a new prompt into both ChatGPT v3.5 and ChatGPT Plus v4.0 and asked for the most probable diagnosis. We then presented the exact information to two neuro-ophthalmologists and recorded their diagnoses followed by comparison to responses from both versions of ChatGPT. Results: ChatGPT v3.5, ChatGPT Plus v4.0, and the two neuro-ophthalmologists were correct in 13 (59%), 18 (82%), 19 (86%), and 19 (86%) out of 22 cases, respectively. The agreement between the various diagnostic sources were as follows: ChatGPT v3.5 and ChatGPT Plus v4.0, 13 (5",
    "path": "papers/23/09/2309.12361.json",
    "total_tokens": 1100,
    "translated_title": "ChatGPT基于病例报告辅助神经眼科疾病的诊断",
    "translated_abstract": "目的：评估大型语言模型（LLM）如ChatGPT在基于详细病例描述辅助神经眼科疾病诊断方面的效果。方法：我们从一个公开可用的在线数据库中选择了22个不同的神经眼科疾病病例报告。这些病例包括神经眼科亚专科常见的慢性和急性疾病。我们把每个病例的文本作为新的提示插入到ChatGPT v3.5和ChatGPT Plus v4.0中，并询问最有可能的诊断。然后，我们将准确的信息提供给两名神经眼科医生，并记录他们的诊断结果，然后与ChatGPT的回答进行对比。结果：ChatGPT v3.5、ChatGPT Plus v4.0和两名神经眼科医生在22个病例中分别达到13个（59%）、18个（82%）、19个（86%）和19个（86%）的正确诊断。各种诊断来源之间的一致性如下：ChatGPT v3.5和ChatGPT Plus v4.0的一致性为13个...",
    "tldr": "本研究评估了大型语言模型ChatGPT在神经眼科疾病诊断中的辅助效果。实验结果显示，ChatGPT在13个病例中正确诊断了59%，而ChatGPT Plus和两名神经眼科医生的正确率分别达到了82%和86%。这表明ChatGPT可以作为神经眼科疾病诊断的有用工具。"
}