{
    "title": "Optimal Stopping with Multi-Dimensional Comparative Loss Aversion. (arXiv:2309.14555v1 [cs.GT])",
    "abstract": "Despite having the same basic prophet inequality setup and model of loss aversion, conclusions in our multi-dimensional model differs considerably from the one-dimensional model of Kleinberg et al. For example, Kleinberg et al. gives a tight closed-form on the competitive ratio that an online decision-maker can achieve as a function of $\\lambda$, for any $\\lambda \\geq 0$. In our multi-dimensional model, there is a sharp phase transition: if $k$ denotes the number of dimensions, then when $\\lambda \\cdot (k-1) \\geq 1$, no non-trivial competitive ratio is possible. On the other hand, when $\\lambda \\cdot (k-1) < 1$, we give a tight bound on the achievable competitive ratio (similar to Kleinberg et al.). As another example, Kleinberg et al. uncovers an exponential improvement in their competitive ratio for the random-order vs. worst-case prophet inequality problem. In our model with $k\\geq 2$ dimensions, the gap is at most a constant-factor. We uncover several additional key differences in ",
    "link": "http://arxiv.org/abs/2309.14555",
    "context": "Title: Optimal Stopping with Multi-Dimensional Comparative Loss Aversion. (arXiv:2309.14555v1 [cs.GT])\nAbstract: Despite having the same basic prophet inequality setup and model of loss aversion, conclusions in our multi-dimensional model differs considerably from the one-dimensional model of Kleinberg et al. For example, Kleinberg et al. gives a tight closed-form on the competitive ratio that an online decision-maker can achieve as a function of $\\lambda$, for any $\\lambda \\geq 0$. In our multi-dimensional model, there is a sharp phase transition: if $k$ denotes the number of dimensions, then when $\\lambda \\cdot (k-1) \\geq 1$, no non-trivial competitive ratio is possible. On the other hand, when $\\lambda \\cdot (k-1) < 1$, we give a tight bound on the achievable competitive ratio (similar to Kleinberg et al.). As another example, Kleinberg et al. uncovers an exponential improvement in their competitive ratio for the random-order vs. worst-case prophet inequality problem. In our model with $k\\geq 2$ dimensions, the gap is at most a constant-factor. We uncover several additional key differences in ",
    "path": "papers/23/09/2309.14555.json",
    "total_tokens": 923,
    "translated_title": "具有多维比较损失厌恶的最优停止",
    "translated_abstract": "尽管具有相同基本预言家不等式设置和损失厌恶模型，我们的多维模型的结论与Kleinberg等人的一维模型有很大区别。例如，Kleinberg等人给出了在线决策者可以达到的竞争比的紧密闭合形式，作为$\\lambda$的函数，对于任何$\\lambda\\geq 0$。在我们的多维模型中，存在一个明显的相变：如果$k$表示维度的数量，则当$\\lambda\\cdot (k-1)\\geq 1$时，不可能有非平凡的竞争比。另一方面，当$\\lambda\\cdot (k-1) < 1$时，我们给出了可达到的竞争比的紧密界限（类似于Kleinberg等人）。作为另一个例子，Kleinberg等人揭示了随机顺序与最坏情况预言家不等式问题的竞争比的指数改进。在我们的$k\\geq 2$维模型中，差距最多为一个常数因子。我们揭示了几个其他关键的差异。",
    "tldr": "多维模型中的最优停止问题与一维模型有明显区别，包括竞争比的相变现象和随机顺序与最坏情况问题上的改进"
}