{
    "title": "Towards Efficient and Trustworthy AI Through Hardware-Algorithm-Communication Co-Design. (arXiv:2309.15942v1 [cs.AI])",
    "abstract": "Artificial intelligence (AI) algorithms based on neural networks have been designed for decades with the goal of maximising some measure of accuracy. This has led to two undesired effects. First, model complexity has risen exponentially when measured in terms of computation and memory requirements. Second, state-of-the-art AI models are largely incapable of providing trustworthy measures of their uncertainty, possibly `hallucinating' their answers and discouraging their adoption for decision-making in sensitive applications.  With the goal of realising efficient and trustworthy AI, in this paper we highlight research directions at the intersection of hardware and software design that integrate physical insights into computational substrates, neuroscientific principles concerning efficient information processing, information-theoretic results on optimal uncertainty quantification, and communication-theoretic guidelines for distributed processing. Overall, the paper advocates for novel d",
    "link": "http://arxiv.org/abs/2309.15942",
    "context": "Title: Towards Efficient and Trustworthy AI Through Hardware-Algorithm-Communication Co-Design. (arXiv:2309.15942v1 [cs.AI])\nAbstract: Artificial intelligence (AI) algorithms based on neural networks have been designed for decades with the goal of maximising some measure of accuracy. This has led to two undesired effects. First, model complexity has risen exponentially when measured in terms of computation and memory requirements. Second, state-of-the-art AI models are largely incapable of providing trustworthy measures of their uncertainty, possibly `hallucinating' their answers and discouraging their adoption for decision-making in sensitive applications.  With the goal of realising efficient and trustworthy AI, in this paper we highlight research directions at the intersection of hardware and software design that integrate physical insights into computational substrates, neuroscientific principles concerning efficient information processing, information-theoretic results on optimal uncertainty quantification, and communication-theoretic guidelines for distributed processing. Overall, the paper advocates for novel d",
    "path": "papers/23/09/2309.15942.json",
    "total_tokens": 897,
    "translated_title": "通过硬件-算法-通信协同设计实现高效可信的人工智能",
    "translated_abstract": "基于神经网络的人工智能算法已经被设计了几十年，目标是最大化某种准确性度量。这导致了两个不希望出现的结果。首先，以计算和内存需求为衡量标准，模型复杂性呈指数增长。第二，最新的人工智能模型在提供可信度量方面很难实现，可能出现\"幻觉\"问题，从而阻碍了其在敏感应用的决策制定中的应用。为了实现高效可信的人工智能，本文强调硬件和软件设计交叉的研究方向，将物理洞见与计算基础、神经科学有关的高效信息处理原则、信息论中关于最优不确定度量的结果以及通信理论中关于分布式处理的准则相结合。总体而言，本文提倡新的硬件-算法-通信协同设计方法，以实现高效可信的人工智能。",
    "tldr": "通过硬件-算法-通信协同设计，本论文提出了一种实现高效可信的人工智能的研究方法，即通过结合物理洞见、高效信息处理原则、最优不确定度量结果和分布式处理准则，来提高神经网络算法的效率和可信度。",
    "en_tdlr": "This paper proposes a research approach to achieve efficient and trustworthy artificial intelligence through hardware-algorithm-communication co-design, by integrating physical insights, efficient information processing principles, optimal uncertainty quantification results, and guidelines for distributed processing in neural network algorithms."
}