{
    "title": "ICDARTS: Improving the Stability and Performance of Cyclic DARTS. (arXiv:2309.00664v1 [cs.LG])",
    "abstract": "This work introduces improvements to the stability and generalizability of Cyclic DARTS (CDARTS). CDARTS is a Differentiable Architecture Search (DARTS)-based approach to neural architecture search (NAS) that uses a cyclic feedback mechanism to train search and evaluation networks concurrently. This training protocol aims to optimize the search process by enforcing that the search and evaluation networks produce similar outputs. However, CDARTS introduces a loss function for the evaluation network that is dependent on the search network. The dissimilarity between the loss functions used by the evaluation networks during the search and retraining phases results in a search-phase evaluation network that is a sub-optimal proxy for the final evaluation network that is utilized during retraining. We present ICDARTS, a revised approach that eliminates the dependency of the evaluation network weights upon those of the search network, along with a modified process for discretizing the search n",
    "link": "http://arxiv.org/abs/2309.00664",
    "context": "Title: ICDARTS: Improving the Stability and Performance of Cyclic DARTS. (arXiv:2309.00664v1 [cs.LG])\nAbstract: This work introduces improvements to the stability and generalizability of Cyclic DARTS (CDARTS). CDARTS is a Differentiable Architecture Search (DARTS)-based approach to neural architecture search (NAS) that uses a cyclic feedback mechanism to train search and evaluation networks concurrently. This training protocol aims to optimize the search process by enforcing that the search and evaluation networks produce similar outputs. However, CDARTS introduces a loss function for the evaluation network that is dependent on the search network. The dissimilarity between the loss functions used by the evaluation networks during the search and retraining phases results in a search-phase evaluation network that is a sub-optimal proxy for the final evaluation network that is utilized during retraining. We present ICDARTS, a revised approach that eliminates the dependency of the evaluation network weights upon those of the search network, along with a modified process for discretizing the search n",
    "path": "papers/23/09/2309.00664.json",
    "total_tokens": 830,
    "translated_title": "ICDARTS: 改进循环DARTS的稳定性和性能",
    "translated_abstract": "本研究改进了循环DARTS（CDARTS）的稳定性和泛化能力。CDARTS是一种基于可微分架构搜索（DARTS）的神经架构搜索（NAS）方法，使用循环反馈机制同时训练搜索和评估网络。该训练协议旨在通过强制要求搜索和评估网络产生相似的输出来优化搜索过程。然而，CDARTS引入了一个依赖于搜索网络的评估网络损失函数。搜索和重新训练阶段评估网络使用的损失函数的不相似性导致搜索阶段评估网络成为重新训练期间使用的最终评估网络的次优代理。我们提出ICDARTS，一种修正的方法，消除了评估网络权重对搜索网络权重的依赖，以及一种修改的搜索离散化过程。",
    "tldr": "ICDARTS改进了循环DARTS的稳定性和性能，通过消除评估网络权重对搜索网络权重的依赖，并引入修改后的搜索离散化过程。",
    "en_tdlr": "ICDARTS improves the stability and performance of Cyclic DARTS by eliminating the dependency of evaluation network weights on search network weights, and introducing a modified process for discretizing the search."
}