{
    "title": "Using an Uncrewed Surface Vehicle to Create a Volumetric Model of Non-Navigable Rivers and Other Shallow Bodies of Water. (arXiv:2309.10269v1 [cs.RO])",
    "abstract": "Non-navigable rivers and retention ponds play important roles in buffering communities from flooding, yet emergency planners often have no data as to the volume of water that they can carry before flooding the surrounding. This paper describes a practical approach for using an uncrewed marine surface vehicle (USV) to collect and merge bathymetric maps with digital surface maps of the banks of shallow bodies of water into a unified volumetric model. The below-waterline mesh is developed by applying the Poisson surface reconstruction algorithm to the sparse sonar depth readings of the underwater surface. Dense above-waterline meshes of the banks are created using commercial structure from motion (SfM) packages. Merging is challenging for many reasons, the most significant is gaps in sensor coverage, i.e., the USV cannot collect sonar depth data or visually see sandy beaches leading to a bank thus the two meshes may not intersect. The approach is demonstrated on a Hydronalix EMILY USV wit",
    "link": "http://arxiv.org/abs/2309.10269",
    "context": "Title: Using an Uncrewed Surface Vehicle to Create a Volumetric Model of Non-Navigable Rivers and Other Shallow Bodies of Water. (arXiv:2309.10269v1 [cs.RO])\nAbstract: Non-navigable rivers and retention ponds play important roles in buffering communities from flooding, yet emergency planners often have no data as to the volume of water that they can carry before flooding the surrounding. This paper describes a practical approach for using an uncrewed marine surface vehicle (USV) to collect and merge bathymetric maps with digital surface maps of the banks of shallow bodies of water into a unified volumetric model. The below-waterline mesh is developed by applying the Poisson surface reconstruction algorithm to the sparse sonar depth readings of the underwater surface. Dense above-waterline meshes of the banks are created using commercial structure from motion (SfM) packages. Merging is challenging for many reasons, the most significant is gaps in sensor coverage, i.e., the USV cannot collect sonar depth data or visually see sandy beaches leading to a bank thus the two meshes may not intersect. The approach is demonstrated on a Hydronalix EMILY USV wit",
    "path": "papers/23/09/2309.10269.json",
    "total_tokens": 938,
    "translated_title": "使用无人表面船舶创建非可航运河流和其他浅水体的体积模型",
    "translated_abstract": "非可航运河流和持水池在预防洪水方面发挥着重要作用，但是紧急规划人员常常没有关于它们在洪水前所能承载的水体积的数据。本文描述了一种实用的方法，利用无人海洋表面船只（USV）将浅水体的水下地形图与数字地表图合并，形成统一的体积模型。水下网格是通过将稀疏声纳深度读数应用于泊松表面重建算法来开发的。使用商业化的结构运动（SfM）软件包创建了河岸的密集的水上网格。合并是具有挑战性的，最重要的原因是传感器覆盖的间隙，即USV无法收集声纳深度数据或看到沙滩，导致兩個网格可能不相交。该方法在Hydronalix EMILY USV上进行了演示。",
    "tldr": "使用无人表面船舶将浅水体的水下地形图与数字地表图合并，创建了一种统一的体积模型，以获取关于非可航运河流和其他浅水体所能承载的水体积的数据。"
}