{
    "title": "Projected Langevin dynamics and a gradient flow for entropic optimal transport. (arXiv:2309.08598v1 [math.PR] CROSS LISTED)",
    "abstract": "The classical (overdamped) Langevin dynamics provide a natural algorithm for sampling from its invariant measure, which uniquely minimizes an energy functional over the space of probability measures, and which concentrates around the minimizer(s) of the associated potential when the noise parameter is small. We introduce analogous diffusion dynamics that sample from an entropy-regularized optimal transport, which uniquely minimizes the same energy functional but constrained to the set $\\Pi(\\mu,\\nu)$ of couplings of two given marginal probability measures $\\mu$ and $\\nu$ on $\\mathbb{R}^d$, and which concentrates around the optimal transport coupling(s) for small regularization parameter. More specifically, our process satisfies two key properties: First, the law of the solution at each time stays in $\\Pi(\\mu,\\nu)$ if it is initialized there. Second, the long-time limit is the unique solution of an entropic optimal transport problem. In addition, we show by means of a new log-Sobolev-typ",
    "link": "http://arxiv.org/abs/2309.08598",
    "context": "Title: Projected Langevin dynamics and a gradient flow for entropic optimal transport. (arXiv:2309.08598v1 [math.PR] CROSS LISTED)\nAbstract: The classical (overdamped) Langevin dynamics provide a natural algorithm for sampling from its invariant measure, which uniquely minimizes an energy functional over the space of probability measures, and which concentrates around the minimizer(s) of the associated potential when the noise parameter is small. We introduce analogous diffusion dynamics that sample from an entropy-regularized optimal transport, which uniquely minimizes the same energy functional but constrained to the set $\\Pi(\\mu,\\nu)$ of couplings of two given marginal probability measures $\\mu$ and $\\nu$ on $\\mathbb{R}^d$, and which concentrates around the optimal transport coupling(s) for small regularization parameter. More specifically, our process satisfies two key properties: First, the law of the solution at each time stays in $\\Pi(\\mu,\\nu)$ if it is initialized there. Second, the long-time limit is the unique solution of an entropic optimal transport problem. In addition, we show by means of a new log-Sobolev-typ",
    "path": "papers/23/09/2309.08598.json",
    "total_tokens": 942,
    "translated_title": "投影 Langevin 动力学和梯度流的熵优化输运",
    "translated_abstract": "经典的（过阻尼的） Langevin 动力学为从其不变测度中采样提供了一种自然的算法，该测度在概率测度空间上唯一最小化一个能量泛函，并且在噪声参数很小时集中于相关势能的极小值点。我们引入了类似的扩散动力学，从经熵正则化的优化输运中进行采样，在两个给定边缘概率测度 $\\mu$ 和 $\\nu$ 上约束下唯一最小化相同的能量泛函，并在小的正则化参数下集中于最优输运耦合点。具体而言，我们的过程满足两个关键性质：首先，如果在其上初始化，解在每个时间点的分布都保持在 $\\Pi(\\mu,\\nu)$ 中。其次，长时间极限是一个熵优化输运问题的唯一解。另外，我们通过一个新的 log-Sobolev 类型的结果证明...",
    "tldr": "本文提出了投影 Langevin 动力学和梯度流算法，用于从经熵正则化的优化输运中进行采样和求解。该方法在小的正则化参数下集中于最优输运耦合点，并且保持在约束条件下的解。对应的长时间极限是熵优化输运问题的唯一解。",
    "en_tdlr": "This paper introduces projected Langevin dynamics and a gradient flow algorithm for sampling and solving entropy-regularized optimal transport problems. The method concentrates around the optimal transport coupling for small regularization parameter and maintains the solution within the given constraints. The long-time limit corresponds to the unique solution of the entropic optimal transport problem."
}