{
    "title": "Directed Scattering for Knowledge Graph-based Cellular Signaling Analysis. (arXiv:2309.07813v1 [cs.LG])",
    "abstract": "Directed graphs are a natural model for many phenomena, in particular scientific knowledge graphs such as molecular interaction or chemical reaction networks that define cellular signaling relationships. In these situations, source nodes typically have distinct biophysical properties from sinks. Due to their ordered and unidirectional relationships, many such networks also have hierarchical and multiscale structure. However, the majority of methods performing node- and edge-level tasks in machine learning do not take these properties into account, and thus have not been leveraged effectively for scientific tasks such as cellular signaling network inference. We propose a new framework called Directed Scattering Autoencoder (DSAE) which uses a directed version of a geometric scattering transform, combined with the non-linear dimensionality reduction properties of an autoencoder and the geometric properties of the hyperbolic space to learn latent hierarchies. We show this method outperfor",
    "link": "http://arxiv.org/abs/2309.07813",
    "context": "Title: Directed Scattering for Knowledge Graph-based Cellular Signaling Analysis. (arXiv:2309.07813v1 [cs.LG])\nAbstract: Directed graphs are a natural model for many phenomena, in particular scientific knowledge graphs such as molecular interaction or chemical reaction networks that define cellular signaling relationships. In these situations, source nodes typically have distinct biophysical properties from sinks. Due to their ordered and unidirectional relationships, many such networks also have hierarchical and multiscale structure. However, the majority of methods performing node- and edge-level tasks in machine learning do not take these properties into account, and thus have not been leveraged effectively for scientific tasks such as cellular signaling network inference. We propose a new framework called Directed Scattering Autoencoder (DSAE) which uses a directed version of a geometric scattering transform, combined with the non-linear dimensionality reduction properties of an autoencoder and the geometric properties of the hyperbolic space to learn latent hierarchies. We show this method outperfor",
    "path": "papers/23/09/2309.07813.json",
    "total_tokens": 965,
    "translated_title": "基于知识图谱的细胞信号分析的有向散射",
    "translated_abstract": "有向图是许多现象的自然模型，特别是科学知识图谱，如分子相互作用或化学反应网络，用于定义细胞信号关系。在这些情况下，源节点通常具有与汇节点不同的生物物理性质。由于它们的有序和单向关系，许多此类网络还具有分层和多尺度结构。然而，大多数机器学习方法在执行节点级和边级任务时并不考虑这些属性，因此对于细胞信号网络推断等科学任务的利用效果不佳。我们提出了一种新的框架，称为有向散射自编码器（DSAE），它使用有向版本的几何散射变换，结合自编码器的非线性降维特性和双曲空间的几何属性，来学习潜在的分层信息。我们证明了这种方法的性能优于当前方法。",
    "tldr": "本论文提出了一种新的框架，称为有向散射自编码器（DSAE），用于基于知识图谱的细胞信号分析。该框架结合了有向版本的几何散射变换、自编码器的非线性降维特性和双曲空间的几何属性，可以学习到细胞信号网络中的潜在分层信息，并在细胞信号网络推断等科学任务中取得了优异的性能。",
    "en_tdlr": "This paper proposes a new framework called Directed Scattering Autoencoder (DSAE) for knowledge graph-based cellular signaling analysis. The framework combines a directed version of geometric scattering transform, the non-linear dimensionality reduction properties of an autoencoder, and the geometric properties of the hyperbolic space to learn latent hierarchies in cellular signaling networks, achieving superior performance in scientific tasks such as cellular signaling network inference."
}