{
    "title": "Learning News Bias: Misspecifications and Consequences. (arXiv:2309.08740v1 [econ.TH])",
    "abstract": "We study how a decision maker (DM) learns about the bias of unfamiliar news sources. Absent any frictions, a rational DM uses known sources as a yardstick to discern the true bias of a source. If a DM has misspecified beliefs, this process fails. We derive long-run beliefs, behavior, welfare, and corresponding comparative statics, when the DM has dogmatic, incorrect beliefs about the bias of known sources. The distortion due to misspecified learning is succinctly captured by a single-dimensional metric we introduce. Our model generates the hostile media effect and false polarization, and has implications for fact-checking and misperception recalibration.",
    "link": "http://arxiv.org/abs/2309.08740",
    "context": "Title: Learning News Bias: Misspecifications and Consequences. (arXiv:2309.08740v1 [econ.TH])\nAbstract: We study how a decision maker (DM) learns about the bias of unfamiliar news sources. Absent any frictions, a rational DM uses known sources as a yardstick to discern the true bias of a source. If a DM has misspecified beliefs, this process fails. We derive long-run beliefs, behavior, welfare, and corresponding comparative statics, when the DM has dogmatic, incorrect beliefs about the bias of known sources. The distortion due to misspecified learning is succinctly captured by a single-dimensional metric we introduce. Our model generates the hostile media effect and false polarization, and has implications for fact-checking and misperception recalibration.",
    "path": "papers/23/09/2309.08740.json",
    "total_tokens": 820,
    "translated_title": "学习新闻偏见：错误规范和后果",
    "translated_abstract": "我们研究了决策者（DM）如何学习关于陌生新闻来源的偏见。在没有任何摩擦的情况下，理性的DM使用已知来源作为标准来辨别一个来源的真实偏见。如果DM有错误的信念，这个过程就会失败。我们推导出当DM对已知来源的偏见有教条、错误的信念时的长期信念、行为、福利和相应的比较静态。由于错误的学习导致的扭曲可以通过我们引入的单维度度量准确地捕捉到。我们的模型产生了敌对媒体效应和虚假极化，并对事实核查和错误观念校准产生了影响。",
    "tldr": "这篇论文研究了决策者学习关于陌生新闻来源偏见的过程。当决策者对已知来源的偏见有错误的信念时，学习过程会失败，导致扭曲。该模型产生了敌对媒体效应和虚假极化，对事实核查和错误观念校准产生了影响。",
    "en_tdlr": "This paper investigates the process of how decision makers learn about the bias of unfamiliar news sources. When decision makers have incorrect beliefs about the bias of known sources, the learning process fails and leads to distortion. The model generates the hostile media effect and false polarization, with implications for fact-checking and misperception recalibration."
}