{
    "title": "A Problem of Finite-Horizon Optimal Switching and Stochastic Control for Utility Maximization. (arXiv:2309.12588v1 [math.OC])",
    "abstract": "In this paper, we undertake an investigation into the utility maximization problem faced by an economic agent who possesses the option to switch jobs, within a scenario featuring the presence of a mandatory retirement date. The agent needs to consider not only optimal consumption and investment but also the decision regarding optimal job-switching. Therefore, the utility maximization encompasses features of both optimal switching and stochastic control within a finite horizon. To address this challenge, we employ a dual-martingale approach to derive the dual problem defined as a finite-horizon pure optimal switching problem. By applying a theory of the double obstacle problem with non-standard arguments, we examine the analytical properties of the system of parabolic variational inequalities arising from the optimal switching problem, including those of its two free boundaries. Based on these analytical properties, we establish a duality theorem and characterize the optimal job-switchi",
    "link": "http://arxiv.org/abs/2309.12588",
    "context": "Title: A Problem of Finite-Horizon Optimal Switching and Stochastic Control for Utility Maximization. (arXiv:2309.12588v1 [math.OC])\nAbstract: In this paper, we undertake an investigation into the utility maximization problem faced by an economic agent who possesses the option to switch jobs, within a scenario featuring the presence of a mandatory retirement date. The agent needs to consider not only optimal consumption and investment but also the decision regarding optimal job-switching. Therefore, the utility maximization encompasses features of both optimal switching and stochastic control within a finite horizon. To address this challenge, we employ a dual-martingale approach to derive the dual problem defined as a finite-horizon pure optimal switching problem. By applying a theory of the double obstacle problem with non-standard arguments, we examine the analytical properties of the system of parabolic variational inequalities arising from the optimal switching problem, including those of its two free boundaries. Based on these analytical properties, we establish a duality theorem and characterize the optimal job-switchi",
    "path": "papers/23/09/2309.12588.json",
    "total_tokens": 915,
    "translated_title": "有限时间内的最优切换和随机控制问题与效用最大化的研究",
    "translated_abstract": "本文研究了一个经济主体面临退休日存在的情景中的效用最大化问题，该主体可以选择切换工作。主体需要考虑最优消费、投资和最优切换工作的决策。因此，效用最大化包含了有限时间内最优切换和随机控制的特点。为了解决这个挑战，我们采用了双鞅方法推导出双重问题，它被定义为一个有限时间内的纯最优切换问题。通过应用双障碍问题理论和非标准参数，我们研究了由最优切换问题导出的抛物型变分不等式系统的解析性质，包括其两个自由边界的性质。基于这些解析性质，我们建立了一个对偶定理，并对最优切换工作进行了特征化。",
    "tldr": "本文研究了在有限时间内，经济主体面临退休日存在的情景下的效用最大化问题。主要创新是采用双鞅方法推导出双重问题，并通过研究抛物型变分不等式系统的解析性质，建立了对偶定理并特征化了最优切换工作。",
    "en_tdlr": "This paper investigates the utility maximization problem faced by an economic agent who has the option to switch jobs, within a finite horizon and a mandatory retirement date. The main contribution lies in the derivation of a dual problem using a dual-martingale approach, and the characterization of the optimal job-switching through the analysis of the system of parabolic variational inequalities."
}