{
    "title": "Pearl's and Jeffrey's Update as Modes of Learning in Probabilistic Programming. (arXiv:2309.07053v1 [cs.LO])",
    "abstract": "The concept of updating a probability distribution in the light of new evidence lies at the heart of statistics and machine learning. Pearl's and Jeffrey's rule are two natural update mechanisms which lead to different outcomes, yet the similarities and differences remain mysterious. This paper clarifies their relationship in several ways: via separate descriptions of the two update mechanisms in terms of probabilistic programs and sampling semantics, and via different notions of likelihood (for Pearl and for Jeffrey). Moreover, it is shown that Jeffrey's update rule arises via variational inference. In terms of categorical probability theory, this amounts to an analysis of the situation in terms of the behaviour of the multiset functor, extended to the Kleisli category of the distribution monad.",
    "link": "http://arxiv.org/abs/2309.07053",
    "context": "Title: Pearl's and Jeffrey's Update as Modes of Learning in Probabilistic Programming. (arXiv:2309.07053v1 [cs.LO])\nAbstract: The concept of updating a probability distribution in the light of new evidence lies at the heart of statistics and machine learning. Pearl's and Jeffrey's rule are two natural update mechanisms which lead to different outcomes, yet the similarities and differences remain mysterious. This paper clarifies their relationship in several ways: via separate descriptions of the two update mechanisms in terms of probabilistic programs and sampling semantics, and via different notions of likelihood (for Pearl and for Jeffrey). Moreover, it is shown that Jeffrey's update rule arises via variational inference. In terms of categorical probability theory, this amounts to an analysis of the situation in terms of the behaviour of the multiset functor, extended to the Kleisli category of the distribution monad.",
    "path": "papers/23/09/2309.07053.json",
    "total_tokens": 713,
    "translated_title": "随机编程中的学习模式：Pearl和Jeffrey的更新",
    "translated_abstract": "根据新证据更新概率分布的概念是统计学和机器学习的核心。Pearl和Jeffrey的规则是两种自然的更新机制，它们导致不同的结果，但相似性和差异仍然神秘。本文通过概率程序和采样语义的分别描述，以及关于Pearl和Jeffrey的不同似然度的概念，阐明了它们之间的关系。此外，还展示了Jeffrey的更新规则是通过变分推理得到的。从分类概率理论的角度来看，这相当于对多重集合函子在分布单子范畴中的行为进行分析。",
    "tldr": "本文澄清了在随机编程中使用的学习模式Pearl和Jeffrey的更新机制之间的关系，并指出Jeffrey的更新规则是通过变分推理得到的。",
    "en_tdlr": "This paper clarifies the relationship between the learning modes of Pearl and Jeffrey's updates in probabilistic programming and shows that Jeffrey's update rule arises via variational inference."
}