{
    "title": "Memory Efficient Mixed-Precision Optimizers. (arXiv:2309.12381v1 [cs.LG])",
    "abstract": "Traditional optimization methods rely on the use of single-precision floating point arithmetic, which can be costly in terms of memory size and computing power. However, mixed precision optimization techniques leverage the use of both single and half-precision floating point arithmetic to reduce memory requirements while maintaining model accuracy. We provide here an algorithm to further reduce memory usage during the training of a model by getting rid of the floating point copy of the parameters, virtually keeping only half-precision numbers. We also explore the benefits of getting rid of the gradient's value by executing the optimizer step during the back-propagation. In practice, we achieve up to 25% lower peak memory use and 15% faster training while maintaining the same level of accuracy.",
    "link": "http://arxiv.org/abs/2309.12381",
    "context": "Title: Memory Efficient Mixed-Precision Optimizers. (arXiv:2309.12381v1 [cs.LG])\nAbstract: Traditional optimization methods rely on the use of single-precision floating point arithmetic, which can be costly in terms of memory size and computing power. However, mixed precision optimization techniques leverage the use of both single and half-precision floating point arithmetic to reduce memory requirements while maintaining model accuracy. We provide here an algorithm to further reduce memory usage during the training of a model by getting rid of the floating point copy of the parameters, virtually keeping only half-precision numbers. We also explore the benefits of getting rid of the gradient's value by executing the optimizer step during the back-propagation. In practice, we achieve up to 25% lower peak memory use and 15% faster training while maintaining the same level of accuracy.",
    "path": "papers/23/09/2309.12381.json",
    "total_tokens": 768,
    "translated_title": "内存高效的混合精度优化器",
    "translated_abstract": "传统的优化方法依赖于使用单精度浮点运算，这在内存大小和计算能力方面都是昂贵的。然而，混合精度优化技术利用单精度和半精度浮点运算相结合，以减少内存需求同时保持模型准确性。我们提供了一种算法，在模型训练过程中进一步减少内存使用，通过消除参数的浮点副本，实际上只保留半精度数字。我们还探索了在后向传播期间通过执行优化器步骤来去除梯度值的好处。实践中，我们实现了高达25%的峰值内存降低和15%的更快训练速度，同时保持相同水平的准确性。",
    "tldr": "本论文提出了一种内存高效的混合精度优化算法，通过消除参数的浮点副本和去除梯度值的方法，实现了高效降低内存使用和加快训练速度，同时保持模型准确性。",
    "en_tdlr": "This paper proposes a memory-efficient mixed-precision optimization algorithm that reduces memory usage and speeds up training by eliminating floating point copies of parameters and removing gradient values, while maintaining model accuracy."
}