{
    "title": "Tidying Up the Conversational Recommender Systems' Biases. (arXiv:2309.02550v1 [cs.IR])",
    "abstract": "The growing popularity of language models has sparked interest in conversational recommender systems (CRS) within both industry and research circles. However, concerns regarding biases in these systems have emerged. While individual components of CRS have been subject to bias studies, a literature gap remains in understanding specific biases unique to CRS and how these biases may be amplified or reduced when integrated into complex CRS models. In this paper, we provide a concise review of biases in CRS by surveying recent literature. We examine the presence of biases throughout the system's pipeline and consider the challenges that arise from combining multiple models. Our study investigates biases in classic recommender systems and their relevance to CRS. Moreover, we address specific biases in CRS, considering variations with and without natural language understanding capabilities, along with biases related to dialogue systems and language models. Through our findings, we highlight t",
    "link": "http://arxiv.org/abs/2309.02550",
    "context": "Title: Tidying Up the Conversational Recommender Systems' Biases. (arXiv:2309.02550v1 [cs.IR])\nAbstract: The growing popularity of language models has sparked interest in conversational recommender systems (CRS) within both industry and research circles. However, concerns regarding biases in these systems have emerged. While individual components of CRS have been subject to bias studies, a literature gap remains in understanding specific biases unique to CRS and how these biases may be amplified or reduced when integrated into complex CRS models. In this paper, we provide a concise review of biases in CRS by surveying recent literature. We examine the presence of biases throughout the system's pipeline and consider the challenges that arise from combining multiple models. Our study investigates biases in classic recommender systems and their relevance to CRS. Moreover, we address specific biases in CRS, considering variations with and without natural language understanding capabilities, along with biases related to dialogue systems and language models. Through our findings, we highlight t",
    "path": "papers/23/09/2309.02550.json",
    "total_tokens": 888,
    "translated_title": "清理会话型推荐系统的偏见",
    "translated_abstract": "语言模型的日益流行引起了对会话型推荐系统（CRS）的兴趣，在工业界和研究界都备受关注。然而，这些系统中的偏见问题引起了人们的担忧。虽然CRS的个别组件已经接受了对偏见的研究，但目前在理解CRS中特定偏见以及当其集成到复杂的CRS模型中时这些偏见如何被放大或减弱方面存在文献空缺。在本文中，我们通过对最近的文献进行调查，提供了CRS中偏见的简明综述。我们研究了偏见在系统流程中的存在，并考虑了将多个模型结合在一起时产生的挑战。我们的研究调查了经典推荐系统中的偏见及其与CRS的相关性。此外，我们还讨论了CRS中的特定偏见，考虑了带有和不带有自然语言理解能力的变体，以及与对话系统和语言模型相关的偏见。通过我们的研究结果，我们突出了一些关键点。",
    "tldr": "该论文综述了会话型推荐系统中的偏见问题，并考虑了这些偏见在CRS中的影响以及与复杂的模型结合时的挑战。具体而言，研究调查了经典推荐系统中的偏见，并讨论了与对话系统和语言模型相关的偏见。"
}