{
    "title": "FedWOA: A Federated Learning Model that uses the Whale Optimization Algorithm for Renewable Energy Prediction. (arXiv:2309.10337v1 [cs.LG])",
    "abstract": "Privacy is important when dealing with sensitive personal information in machine learning models, which require large data sets for training. In the energy field, access to household prosumer energy data is crucial for energy predictions to support energy grid management and large-scale adoption of renewables however citizens are often hesitant to grant access to cloud-based machine learning models. Federated learning has been proposed as a solution to privacy challenges however report issues in generating the global prediction model due to data heterogeneity, variations in generation patterns, and the high number of parameters leading to even lower prediction accuracy. This paper addresses these challenges by introducing FedWOA a novel federated learning model that employs the Whale Optimization Algorithm to aggregate global prediction models from the weights of local LTSM neural network models trained on prosumer energy data. The proposed solution identifies the optimal vector of wei",
    "link": "http://arxiv.org/abs/2309.10337",
    "context": "Title: FedWOA: A Federated Learning Model that uses the Whale Optimization Algorithm for Renewable Energy Prediction. (arXiv:2309.10337v1 [cs.LG])\nAbstract: Privacy is important when dealing with sensitive personal information in machine learning models, which require large data sets for training. In the energy field, access to household prosumer energy data is crucial for energy predictions to support energy grid management and large-scale adoption of renewables however citizens are often hesitant to grant access to cloud-based machine learning models. Federated learning has been proposed as a solution to privacy challenges however report issues in generating the global prediction model due to data heterogeneity, variations in generation patterns, and the high number of parameters leading to even lower prediction accuracy. This paper addresses these challenges by introducing FedWOA a novel federated learning model that employs the Whale Optimization Algorithm to aggregate global prediction models from the weights of local LTSM neural network models trained on prosumer energy data. The proposed solution identifies the optimal vector of wei",
    "path": "papers/23/09/2309.10337.json",
    "total_tokens": 958,
    "translated_title": "FedWOA:一种利用鲸鱼优化算法进行可再生能源预测的联邦学习模型",
    "translated_abstract": "隐私在处理敏感个人信息的机器学习模型中非常重要，这些模型需要大规模的数据集进行训练。在能源领域，访问家庭生产者和消费者的能源数据对于能源预测以支持能源网格管理和可再生能源的大规模采用至关重要，然而公民通常不愿意授予基于云的机器学习模型访问权限。联邦学习被提出作为解决隐私挑战的方法，但由于数据异质性、发电模式的变化和参数数量的增加导致全局预测模型的生成存在问题，进而降低了预测精度。本文通过引入FedWOA这种新颖的联邦学习模型来解决这些挑战，该模型利用鲸鱼优化算法从基于家庭能源数据训练的局部LTSM神经网络模型的权重中聚合出全局预测模型。所提出的解决方案能够识别出最优的权重向量。",
    "tldr": "本论文提出了一种名为FedWOA的新型联邦学习模型，该模型利用鲸鱼优化算法从家庭能源数据训练的局部LTSM神经网络模型的权重中聚合出全局预测模型，解决了数据异质性和参数数量增加导致的预测精度降低的问题。"
}