{
    "title": "Data-Driven Neural Polar Codes for Unknown Channels With and Without Memory. (arXiv:2309.03148v1 [cs.IT])",
    "abstract": "In this work, a novel data-driven methodology for designing polar codes for channels with and without memory is proposed. The methodology is suitable for the case where the channel is given as a \"black-box\" and the designer has access to the channel for generating observations of its inputs and outputs, but does not have access to the explicit channel model. The proposed method leverages the structure of the successive cancellation (SC) decoder to devise a neural SC (NSC) decoder. The NSC decoder uses neural networks (NNs) to replace the core elements of the original SC decoder, the check-node, the bit-node and the soft decision. Along with the NSC, we devise additional NN that embeds the channel outputs into the input space of the SC decoder. The proposed method is supported by theoretical guarantees that include the consistency of the NSC. Also, the NSC has computational complexity that does not grow with the channel memory size. This sets its main advantage over successive cancellat",
    "link": "http://arxiv.org/abs/2309.03148",
    "context": "Title: Data-Driven Neural Polar Codes for Unknown Channels With and Without Memory. (arXiv:2309.03148v1 [cs.IT])\nAbstract: In this work, a novel data-driven methodology for designing polar codes for channels with and without memory is proposed. The methodology is suitable for the case where the channel is given as a \"black-box\" and the designer has access to the channel for generating observations of its inputs and outputs, but does not have access to the explicit channel model. The proposed method leverages the structure of the successive cancellation (SC) decoder to devise a neural SC (NSC) decoder. The NSC decoder uses neural networks (NNs) to replace the core elements of the original SC decoder, the check-node, the bit-node and the soft decision. Along with the NSC, we devise additional NN that embeds the channel outputs into the input space of the SC decoder. The proposed method is supported by theoretical guarantees that include the consistency of the NSC. Also, the NSC has computational complexity that does not grow with the channel memory size. This sets its main advantage over successive cancellat",
    "path": "papers/23/09/2309.03148.json",
    "total_tokens": 919,
    "translated_title": "基于数据驱动的神经极化码用于未知带和不带记忆的信道",
    "translated_abstract": "本文提出了一种新颖的数据驱动方法，用于设计具有和不具有记忆的信道的极化码。该方法适用于信道以“黑盒”的形式给定，设计者可以通过生成输入和输出的观测来获取信道的信息，但无法直接访问显式的信道模型。该方法利用连续取消（SC）解码器的结构，设计了神经连续取消（NSC）解码器。NSC解码器使用神经网络（NN）来替代原始SC解码器的核心元素，即检验节点、比特节点和软判决。除了NSC，我们还设计了其他嵌入信道输出到SC解码器输入空间的NN。该方法的理论保证包括NSC的一致性。此外，NSC的计算复杂度不随信道记忆大小增长，这是其与连续取消的主要优势所在。",
    "tldr": "本文提出了一种基于数据驱动的方法，用于设计具有和不具有记忆的信道的极化码。通过替代原始的连续取消解码器的核心元素，即检验节点、比特节点和软判决，设计了神经连续取消解码器。该方法具有理论保证和较低的计算复杂度。"
}