{
    "title": "Portfolio Choice In Dynamic Thin Markets: Merton Meets Cournot. (arXiv:2309.16047v1 [q-fin.MF])",
    "abstract": "We consider an augmented version of Merton's portfolio choice problem, where trading by large investors influences the price of underlying financial asset leading to strategic interaction among investors, with investors deciding their trading rates independently and simultaneously at each instant, in the spirit of dynamic Cournot competition, modelled here as a non-zero sum singular stochastic differential game. We establish an equivalence result for the value functions of an investor's best-response problem, which is a singular stochastic optimal control problem, and an auxiliary classical stochastic optimal control problem by exploiting the invariance of the value functions with respect to a diffeomorphic integral flow associated with the drift coefficient of the best-response problem. Under certain regularity conditions, we show that the optimal trajectories of the two control problems coincide, which permits analytical characterization of Markov-Nash equilibrium portfolios. For the",
    "link": "http://arxiv.org/abs/2309.16047",
    "context": "Title: Portfolio Choice In Dynamic Thin Markets: Merton Meets Cournot. (arXiv:2309.16047v1 [q-fin.MF])\nAbstract: We consider an augmented version of Merton's portfolio choice problem, where trading by large investors influences the price of underlying financial asset leading to strategic interaction among investors, with investors deciding their trading rates independently and simultaneously at each instant, in the spirit of dynamic Cournot competition, modelled here as a non-zero sum singular stochastic differential game. We establish an equivalence result for the value functions of an investor's best-response problem, which is a singular stochastic optimal control problem, and an auxiliary classical stochastic optimal control problem by exploiting the invariance of the value functions with respect to a diffeomorphic integral flow associated with the drift coefficient of the best-response problem. Under certain regularity conditions, we show that the optimal trajectories of the two control problems coincide, which permits analytical characterization of Markov-Nash equilibrium portfolios. For the",
    "path": "papers/23/09/2309.16047.json",
    "total_tokens": 879,
    "translated_title": "动态薄市场中的投资组合选择：默顿 meets Cournot",
    "tldr": "这篇论文研究了动态薄市场中的投资组合选择问题，对大型投资者间的战略互动进行了建模，通过分析最佳响应问题和经典随机最优控制问题的等价关系，得到了Markov-Nash均衡投资组合的分析刻画。",
    "en_tdlr": "This paper investigates the portfolio choice problem in dynamic thin markets, modeling the strategic interaction among large investors. By analyzing the equivalence between the best-response problem and a classical stochastic optimal control problem, the paper provides analytical characterization of Markov-Nash equilibrium portfolios."
}