{
    "title": "Large Language Model for Science: A Study on P vs. NP. (arXiv:2309.05689v1 [cs.CL])",
    "abstract": "In this work, we use large language models (LLMs) to augment and accelerate research on the P versus NP problem, one of the most important open problems in theoretical computer science and mathematics. Specifically, we propose Socratic reasoning, a general framework that promotes in-depth thinking with LLMs for complex problem-solving. Socratic reasoning encourages LLMs to recursively discover, solve, and integrate problems while facilitating self-evaluation and refinement. Our pilot study on the P vs. NP problem shows that GPT-4 successfully produces a proof schema and engages in rigorous reasoning throughout 97 dialogue turns, concluding \"P $\\neq$ NP\", which is in alignment with (Xu and Zhou, 2023). The investigation uncovers novel insights within the extensive solution space of LLMs, shedding light on LLM for Science.",
    "link": "http://arxiv.org/abs/2309.05689",
    "context": "Title: Large Language Model for Science: A Study on P vs. NP. (arXiv:2309.05689v1 [cs.CL])\nAbstract: In this work, we use large language models (LLMs) to augment and accelerate research on the P versus NP problem, one of the most important open problems in theoretical computer science and mathematics. Specifically, we propose Socratic reasoning, a general framework that promotes in-depth thinking with LLMs for complex problem-solving. Socratic reasoning encourages LLMs to recursively discover, solve, and integrate problems while facilitating self-evaluation and refinement. Our pilot study on the P vs. NP problem shows that GPT-4 successfully produces a proof schema and engages in rigorous reasoning throughout 97 dialogue turns, concluding \"P $\\neq$ NP\", which is in alignment with (Xu and Zhou, 2023). The investigation uncovers novel insights within the extensive solution space of LLMs, shedding light on LLM for Science.",
    "path": "papers/23/09/2309.05689.json",
    "total_tokens": 968,
    "translated_title": "基于大语言模型的科学研究：对P vs. NP问题的研究",
    "translated_abstract": "在这项工作中，我们使用大型语言模型（LLMs）来增强和加速对P vs. NP问题的研究，这是理论计算机科学和数学中最重要的未解决问题之一。具体而言，我们提出了苏格拉底推理（Socratic reasoning）的通用框架，该框架通过与LLMs进行深入思考来解决复杂问题。苏格拉底推理鼓励LLMs递归地发现、解决和整合问题，同时促进自我评估和改进。我们对P vs. NP问题的试点研究表明，GPT-4在97个对话回合中成功地产生了一个证明架构，并进行了严格的推理，得出了“P ≠ NP”的结论，这与（Xu and Zhou, 2023）的结论一致。该调查在LLMs的广泛解空间中揭示了新的洞察力，为LLM在科学研究中提供了启示。",
    "tldr": "本研究使用大型语言模型加强和加速对P vs. NP问题的研究，提出了基于苏格拉底推理的通用框架，通过与语言模型进行深入思考解决复杂问题。在P vs. NP问题的实证研究中，GPT-4成功产生了证明架构，并进行了严格的推理，得出了\"P ≠ NP\"的结论，揭示了语言模型在科学研究中的潜力。"
}