{
    "title": "CR-VAE: Contrastive Regularization on Variational Autoencoders for Preventing Posterior Collapse. (arXiv:2309.02968v1 [cs.LG])",
    "abstract": "The Variational Autoencoder (VAE) is known to suffer from the phenomenon of \\textit{posterior collapse}, where the latent representations generated by the model become independent of the inputs. This leads to degenerated representations of the input, which is attributed to the limitations of the VAE's objective function. In this work, we propose a novel solution to this issue, the Contrastive Regularization for Variational Autoencoders (CR-VAE). The core of our approach is to augment the original VAE with a contrastive objective that maximizes the mutual information between the representations of similar visual inputs. This strategy ensures that the information flow between the input and its latent representation is maximized, effectively avoiding posterior collapse. We evaluate our method on a series of visual datasets and demonstrate, that CR-VAE outperforms state-of-the-art approaches in preventing posterior collapse.",
    "link": "http://arxiv.org/abs/2309.02968",
    "context": "Title: CR-VAE: Contrastive Regularization on Variational Autoencoders for Preventing Posterior Collapse. (arXiv:2309.02968v1 [cs.LG])\nAbstract: The Variational Autoencoder (VAE) is known to suffer from the phenomenon of \\textit{posterior collapse}, where the latent representations generated by the model become independent of the inputs. This leads to degenerated representations of the input, which is attributed to the limitations of the VAE's objective function. In this work, we propose a novel solution to this issue, the Contrastive Regularization for Variational Autoencoders (CR-VAE). The core of our approach is to augment the original VAE with a contrastive objective that maximizes the mutual information between the representations of similar visual inputs. This strategy ensures that the information flow between the input and its latent representation is maximized, effectively avoiding posterior collapse. We evaluate our method on a series of visual datasets and demonstrate, that CR-VAE outperforms state-of-the-art approaches in preventing posterior collapse.",
    "path": "papers/23/09/2309.02968.json",
    "total_tokens": 841,
    "translated_title": "CR-VAE:对变分自动编码器进行对比正则化以防止后验坍塌",
    "translated_abstract": "变分自动编码器（VAE）已知存在后验坍塌现象，即模型生成的潜在表示与输入之间变得独立。这导致输入的表示退化，这归因于VAE目标函数的限制。在这项工作中，我们提出了一种新的解决方案，即对比正则化变分自动编码器（CR-VAE）。我们的方法的核心是在原始VAE中增加对比目标，最大化类似视觉输入的表示之间的互信息。这种策略确保了输入与其潜在表示之间的信息流最大化，有效地避免了后验坍塌。我们在一系列视觉数据集上评估了我们的方法，并证明CR-VAE在防止后验坍塌方面优于最先进的方法。",
    "tldr": "CR-VAE是一种对比正则化变分自动编码器的方法，通过增加对比目标来最大化类似视觉输入之间的互信息，从而避免后验坍塌现象，并在多个视觉数据集上表现出比最先进方法更好的性能。",
    "en_tdlr": "CR-VAE is a contrastive regularization approach for variational autoencoders that prevents posterior collapse by maximizing the mutual information between similar visual inputs, showing superior performance compared to state-of-the-art methods on multiple visual datasets."
}