{
    "title": "Dynamic Causal Disentanglement Model for Dialogue Emotion Detection. (arXiv:2309.06928v1 [cs.CL])",
    "abstract": "Emotion detection is a critical technology extensively employed in diverse fields. While the incorporation of commonsense knowledge has proven beneficial for existing emotion detection methods, dialogue-based emotion detection encounters numerous difficulties and challenges due to human agency and the variability of dialogue content.In dialogues, human emotions tend to accumulate in bursts. However, they are often implicitly expressed. This implies that many genuine emotions remain concealed within a plethora of unrelated words and dialogues.In this paper, we propose a Dynamic Causal Disentanglement Model based on hidden variable separation, which is founded on the separation of hidden variables. This model effectively decomposes the content of dialogues and investigates the temporal accumulation of emotions, thereby enabling more precise emotion recognition. First, we introduce a novel Causal Directed Acyclic Graph (DAG) to establish the correlation between hidden emotional informatio",
    "link": "http://arxiv.org/abs/2309.06928",
    "context": "Title: Dynamic Causal Disentanglement Model for Dialogue Emotion Detection. (arXiv:2309.06928v1 [cs.CL])\nAbstract: Emotion detection is a critical technology extensively employed in diverse fields. While the incorporation of commonsense knowledge has proven beneficial for existing emotion detection methods, dialogue-based emotion detection encounters numerous difficulties and challenges due to human agency and the variability of dialogue content.In dialogues, human emotions tend to accumulate in bursts. However, they are often implicitly expressed. This implies that many genuine emotions remain concealed within a plethora of unrelated words and dialogues.In this paper, we propose a Dynamic Causal Disentanglement Model based on hidden variable separation, which is founded on the separation of hidden variables. This model effectively decomposes the content of dialogues and investigates the temporal accumulation of emotions, thereby enabling more precise emotion recognition. First, we introduce a novel Causal Directed Acyclic Graph (DAG) to establish the correlation between hidden emotional informatio",
    "path": "papers/23/09/2309.06928.json",
    "total_tokens": 814,
    "translated_title": "用于对话情感检测的动态因果解缠模型",
    "translated_abstract": "情感检测是一项在不同领域广泛应用的关键技术。尽管结合常识知识对现有情感检测方法的效果有益，但基于对话的情感检测面临着许多困难和挑战，其中包括人类行为和对话内容的变异性。在对话中，人类情感往往以突发方式积累，但它们通常是隐含表达的。这意味着许多真实情感在大量不相关的词汇和对话中被隐藏起来。本文提出了一种基于隐藏变量分离的动态因果解缠模型，该模型通过有效分解对话内容并研究情感的时间积累，从而实现更精确的情感识别。首先，我们引入了一种新颖的因果定向无环图 (DAG) 来建立隐藏情感信息之间的相关性。",
    "tldr": "本文提出了一种动态因果解缠模型，通过分解对话内容和研究情感的时间积累，实现了更精确的情感识别。",
    "en_tdlr": "This paper proposes a dynamic causal disentanglement model for dialogue emotion detection, which effectively decomposes dialogues and investigates the temporal accumulation of emotions, leading to more precise emotion recognition."
}