{
    "title": "SE-PEF: a Resource for Personalized Expert Finding. (arXiv:2309.11686v1 [cs.IR])",
    "abstract": "The problem of personalization in Information Retrieval has been under study for a long time. A well-known issue related to this task is the lack of publicly available datasets that can support a comparative evaluation of personalized search systems. To contribute in this respect, this paper introduces SE-PEF (StackExchange - Personalized Expert Finding), a resource useful for designing and evaluating personalized models related to the task of Expert Finding (EF). The contributed dataset includes more than 250k queries and 565k answers from 3 306 experts, which are annotated with a rich set of features modeling the social interactions among the users of a popular cQA platform. The results of the preliminary experiments conducted show the appropriateness of SE-PEF to evaluate and to train effective EF models.",
    "link": "http://arxiv.org/abs/2309.11686",
    "context": "Title: SE-PEF: a Resource for Personalized Expert Finding. (arXiv:2309.11686v1 [cs.IR])\nAbstract: The problem of personalization in Information Retrieval has been under study for a long time. A well-known issue related to this task is the lack of publicly available datasets that can support a comparative evaluation of personalized search systems. To contribute in this respect, this paper introduces SE-PEF (StackExchange - Personalized Expert Finding), a resource useful for designing and evaluating personalized models related to the task of Expert Finding (EF). The contributed dataset includes more than 250k queries and 565k answers from 3 306 experts, which are annotated with a rich set of features modeling the social interactions among the users of a popular cQA platform. The results of the preliminary experiments conducted show the appropriateness of SE-PEF to evaluate and to train effective EF models.",
    "path": "papers/23/09/2309.11686.json",
    "total_tokens": 845,
    "translated_title": "SE-PEF:一个用于个性化专家查找的资源",
    "translated_abstract": "个性化信息检索的问题已经被研究了很长时间。与这项任务相关的一个众所周知的问题是缺乏公开可用的数据集，这些数据集可以支持个性化搜索系统的比较评估。为了在这方面做出贡献，本文介绍了SE-PEF（StackExchange-个性化专家查找），这是一个用于设计和评估与专家查找（EF）任务相关的个性化模型的资源。所贡献的数据集包括来自3306个专家的超过25万个查询和56.5万个答案，这些数据集使用了一套丰富的特征来建模热门cQA平台上用户之间的社交互动。初步实验的结果表明，SE-PEF适用于评估和训练有效的EF模型。",
    "tldr": "该论文介绍了SE-PEF，一个用于个性化专家查找的资源。该资源包括超过25万个查询和56.5万个答案，并使用一套丰富的特征来建模用户之间的社交互动。初步实验结果表明SE-PEF适用于评估和训练有效的专家查找模型。"
}