{
    "title": "Normality Learning-based Graph Anomaly Detection via Multi-Scale Contrastive Learning. (arXiv:2309.06034v1 [cs.LG])",
    "abstract": "Graph anomaly detection (GAD) has attracted increasing attention in machine learning and data mining. Recent works have mainly focused on how to capture richer information to improve the quality of node embeddings for GAD. Despite their significant advances in detection performance, there is still a relative dearth of research on the properties of the task. GAD aims to discern the anomalies that deviate from most nodes. However, the model is prone to learn the pattern of normal samples which make up the majority of samples. Meanwhile, anomalies can be easily detected when their behaviors differ from normality. Therefore, the performance can be further improved by enhancing the ability to learn the normal pattern. To this end, we propose a normality learning-based GAD framework via multi-scale contrastive learning networks (NLGAD for abbreviation). Specifically, we first initialize the model with the contrastive networks on different scales. To provide sufficient and reliable normal nod",
    "link": "http://arxiv.org/abs/2309.06034",
    "context": "Title: Normality Learning-based Graph Anomaly Detection via Multi-Scale Contrastive Learning. (arXiv:2309.06034v1 [cs.LG])\nAbstract: Graph anomaly detection (GAD) has attracted increasing attention in machine learning and data mining. Recent works have mainly focused on how to capture richer information to improve the quality of node embeddings for GAD. Despite their significant advances in detection performance, there is still a relative dearth of research on the properties of the task. GAD aims to discern the anomalies that deviate from most nodes. However, the model is prone to learn the pattern of normal samples which make up the majority of samples. Meanwhile, anomalies can be easily detected when their behaviors differ from normality. Therefore, the performance can be further improved by enhancing the ability to learn the normal pattern. To this end, we propose a normality learning-based GAD framework via multi-scale contrastive learning networks (NLGAD for abbreviation). Specifically, we first initialize the model with the contrastive networks on different scales. To provide sufficient and reliable normal nod",
    "path": "papers/23/09/2309.06034.json",
    "total_tokens": 892,
    "translated_title": "基于正态学习的多尺度对比学习的图异常检测",
    "translated_abstract": "图异常检测（GAD）在机器学习和数据挖掘领域引起了越来越多的关注。最近的研究主要集中在如何捕捉更丰富的信息，以提高GAD中节点嵌入的质量。尽管它们在检测性能方面取得了显著进展，但对于任务的特性仍然相对不足。GAD旨在识别与大多数节点有所偏离的异常。然而，模型很容易学习到组成大多数样本的正常样本的模式。与此同时，当异常行为与正常性不同的时候，异常可以很容易被检测到。因此，通过增强学习正常模式的能力，性能可以进一步提高。为此，我们提出了一种基于正态学习的GAD框架，使用多尺度对比学习网络（简称NLGAD）。具体而言，我们首先使用不同尺度的对比网络初始化模型，以提供充足可靠的正常节点样本。",
    "tldr": "本文提出了一种基于正态学习的图异常检测框架NLGAD，通过多尺度对比学习网络来增强学习正常模式的能力，以改进异常检测性能。",
    "en_tdlr": "This paper proposes a normality learning-based framework NLGAD for graph anomaly detection, which enhances the ability to learn the normal pattern through multi-scale contrastive learning networks, leading to improved anomaly detection performance."
}