{
    "title": "Beyond Accuracy: Measuring Representation Capacity of Embeddings to Preserve Structural and Contextual Information. (arXiv:2309.11294v1 [cs.LG])",
    "abstract": "Effective representation of data is crucial in various machine learning tasks, as it captures the underlying structure and context of the data. Embeddings have emerged as a powerful technique for data representation, but evaluating their quality and capacity to preserve structural and contextual information remains a challenge. In this paper, we address this need by proposing a method to measure the \\textit{representation capacity} of embeddings. The motivation behind this work stems from the importance of understanding the strengths and limitations of embeddings, enabling researchers and practitioners to make informed decisions in selecting appropriate embedding models for their specific applications. By combining extrinsic evaluation methods, such as classification and clustering, with t-SNE-based neighborhood analysis, such as neighborhood agreement and trustworthiness, we provide a comprehensive assessment of the representation capacity. Additionally, the use of optimization techni",
    "link": "http://arxiv.org/abs/2309.11294",
    "context": "Title: Beyond Accuracy: Measuring Representation Capacity of Embeddings to Preserve Structural and Contextual Information. (arXiv:2309.11294v1 [cs.LG])\nAbstract: Effective representation of data is crucial in various machine learning tasks, as it captures the underlying structure and context of the data. Embeddings have emerged as a powerful technique for data representation, but evaluating their quality and capacity to preserve structural and contextual information remains a challenge. In this paper, we address this need by proposing a method to measure the \\textit{representation capacity} of embeddings. The motivation behind this work stems from the importance of understanding the strengths and limitations of embeddings, enabling researchers and practitioners to make informed decisions in selecting appropriate embedding models for their specific applications. By combining extrinsic evaluation methods, such as classification and clustering, with t-SNE-based neighborhood analysis, such as neighborhood agreement and trustworthiness, we provide a comprehensive assessment of the representation capacity. Additionally, the use of optimization techni",
    "path": "papers/23/09/2309.11294.json",
    "total_tokens": 827,
    "translated_title": "超越准确性：衡量嵌入的表示能力以保留结构和上下文信息",
    "translated_abstract": "在各种机器学习任务中，有效地表示数据至关重要，因为它捕捉到了数据的底层结构和上下文信息。嵌入已经成为一种强大的数据表示技术，但评估其质量和保留结构和上下文信息的能力仍然是一个挑战。本文通过提出一种衡量嵌入的“表示能力”的方法来解决这个问题。这项工作的动机源于理解嵌入的优势和局限性的重要性，使研究人员和实践者能够在选择适合其特定应用的嵌入模型时做出明智的决策。通过将分类和聚类等外部评估方法与基于t-SNE的邻域分析方法（如邻域一致性和可信度）结合起来，我们对表示能力进行了全面评估。此外，使用优化技术的方法能增强表示能力。",
    "tldr": "本文提出了一种衡量嵌入的表示能力的方法，通过结合外部评估方法和基于t-SNE的邻域分析方法，对表示能力进行了全面评估。"
}