{
    "title": "OPUS: An Integrated Assessment Model for Satellites and Orbital Debris. (arXiv:2309.10252v1 [physics.space-ph])",
    "abstract": "An increasingly salient public policy challenge is how to manage the growing number of satellites in orbit, including large constellations. Many policy initiatives have been proposed that attempt to address the problem from different angles, but there is a paucity of analytical tools to help policymakers evaluate the efficacy of these different proposals and any potential counterproductive outcomes. To help address this problem, this paper summarizes work done to develop an experimental integrated assessment model -Orbital Debris Propagators Unified with Economic Systems (OPUS) -- that combines both astrodynamics of the orbital population and economic behavior of space actors. For a given set of parameters, the model first utilizes a given astrodynamic propagator to assess the state of objects in orbit. It then uses a set of user-defined economic and policy parameters -- e.g. launch prices, disposal regulations -- to model how actors will respond to the economic incentives created by",
    "link": "http://arxiv.org/abs/2309.10252",
    "context": "Title: OPUS: An Integrated Assessment Model for Satellites and Orbital Debris. (arXiv:2309.10252v1 [physics.space-ph])\nAbstract: An increasingly salient public policy challenge is how to manage the growing number of satellites in orbit, including large constellations. Many policy initiatives have been proposed that attempt to address the problem from different angles, but there is a paucity of analytical tools to help policymakers evaluate the efficacy of these different proposals and any potential counterproductive outcomes. To help address this problem, this paper summarizes work done to develop an experimental integrated assessment model -Orbital Debris Propagators Unified with Economic Systems (OPUS) -- that combines both astrodynamics of the orbital population and economic behavior of space actors. For a given set of parameters, the model first utilizes a given astrodynamic propagator to assess the state of objects in orbit. It then uses a set of user-defined economic and policy parameters -- e.g. launch prices, disposal regulations -- to model how actors will respond to the economic incentives created by",
    "path": "papers/23/09/2309.10252.json",
    "total_tokens": 874,
    "translated_title": "OPUS：用于卫星和轨道残骸的综合评估模型",
    "translated_abstract": "如何管理越来越多的卫星在轨道上成为了一个日益引人瞩目的公共政策挑战，包括大型星座。虽然提出了许多政策倡议试图从不同角度解决这个问题，但是缺乏分析工具来帮助决策者评估这些不同提议的有效性和可能的适得其反的结果。为了解决这个问题，本文总结了开发一个实验性综合评估模型-Orbital Debris Propagators Unified with Economic Systems (OPUS)的工作，该模型将轨道人口的天体力学和空间活动者的经济行为结合起来。对于给定的参数集，模型首先利用给定的天体动力学传播器评估轨道中物体的状态。然后利用一组用户定义的经济和政策参数（例如，发射价格，处置规定）模拟参与者对经济激励的反应。",
    "tldr": "OPUS是一个综合评估模型，结合了轨道人口的天体力学和空间活动者的经济行为，帮助决策者评估卫星和轨道残骸管理政策的有效性和可能的结果。"
}