{
    "title": "Reparameterized Variational Rejection Sampling. (arXiv:2309.14612v1 [stat.ML])",
    "abstract": "Traditional approaches to variational inference rely on parametric families of variational distributions, with the choice of family playing a critical role in determining the accuracy of the resulting posterior approximation. Simple mean-field families often lead to poor approximations, while rich families of distributions like normalizing flows can be difficult to optimize and usually do not incorporate the known structure of the target distribution due to their black-box nature. To expand the space of flexible variational families, we revisit Variational Rejection Sampling (VRS) [Grover et al., 2018], which combines a parametric proposal distribution with rejection sampling to define a rich non-parametric family of distributions that explicitly utilizes the known target distribution. By introducing a low-variance reparameterized gradient estimator for the parameters of the proposal distribution, we make VRS an attractive inference strategy for models with continuous latent variables.",
    "link": "http://arxiv.org/abs/2309.14612",
    "context": "Title: Reparameterized Variational Rejection Sampling. (arXiv:2309.14612v1 [stat.ML])\nAbstract: Traditional approaches to variational inference rely on parametric families of variational distributions, with the choice of family playing a critical role in determining the accuracy of the resulting posterior approximation. Simple mean-field families often lead to poor approximations, while rich families of distributions like normalizing flows can be difficult to optimize and usually do not incorporate the known structure of the target distribution due to their black-box nature. To expand the space of flexible variational families, we revisit Variational Rejection Sampling (VRS) [Grover et al., 2018], which combines a parametric proposal distribution with rejection sampling to define a rich non-parametric family of distributions that explicitly utilizes the known target distribution. By introducing a low-variance reparameterized gradient estimator for the parameters of the proposal distribution, we make VRS an attractive inference strategy for models with continuous latent variables.",
    "path": "papers/23/09/2309.14612.json",
    "total_tokens": 881,
    "translated_title": "重参数化变分拒绝采样",
    "translated_abstract": "传统的变分推断方法依赖于参数化的变分分布族，选择的分布族在确定后验近似的准确性方面起着关键作用。简单的mean-field分布族通常导致较差的近似，而像归一化流这样的丰富分布族往往难以优化，并且通常不包含已知目标分布的结构，因为其是黑箱的。为了扩展灵活的变分分布族空间，我们重新考虑变分拒绝采样（VRS）[Grover et al., 2018]，它将参数化提议分布与拒绝采样结合起来，定义了一个丰富的非参数分布族，明确利用已知的目标分布。通过引入对提议分布参数的低方差重参数化梯度估计器，我们使VRS成为具有连续潜变量的吸引人的推断策略。",
    "tldr": "本文提出了一种重参数化变分拒绝采样（VRS）方法，通过将参数化的提议分布与拒绝采样结合，定义了一个丰富的非参数分布族，明确利用已知的目标分布，为具有连续潜变量的模型提供了一种吸引人的推断策略。",
    "en_tdlr": "This paper proposes a method called Reparameterized Variational Rejection Sampling (VRS), which combines a parametric proposal distribution with rejection sampling to define a rich non-parametric family of distributions that explicitly utilizes the known target distribution. It provides an attractive inference strategy for models with continuous latent variables."
}