{
    "title": "Towards Robust and Truly Large-Scale Audio-Sheet Music Retrieval. (arXiv:2309.12158v1 [cs.SD])",
    "abstract": "A range of applications of multi-modal music information retrieval is centred around the problem of connecting large collections of sheet music (images) to corresponding audio recordings, that is, identifying pairs of audio and score excerpts that refer to the same musical content. One of the typical and most recent approaches to this task employs cross-modal deep learning architectures to learn joint embedding spaces that link the two distinct modalities - audio and sheet music images. While there has been steady improvement on this front over the past years, a number of open problems still prevent large-scale employment of this methodology. In this article we attempt to provide an insightful examination of the current developments on audio-sheet music retrieval via deep learning methods. We first identify a set of main challenges on the road towards robust and large-scale cross-modal music retrieval in real scenarios. We then highlight the steps we have taken so far to address some o",
    "link": "http://arxiv.org/abs/2309.12158",
    "context": "Title: Towards Robust and Truly Large-Scale Audio-Sheet Music Retrieval. (arXiv:2309.12158v1 [cs.SD])\nAbstract: A range of applications of multi-modal music information retrieval is centred around the problem of connecting large collections of sheet music (images) to corresponding audio recordings, that is, identifying pairs of audio and score excerpts that refer to the same musical content. One of the typical and most recent approaches to this task employs cross-modal deep learning architectures to learn joint embedding spaces that link the two distinct modalities - audio and sheet music images. While there has been steady improvement on this front over the past years, a number of open problems still prevent large-scale employment of this methodology. In this article we attempt to provide an insightful examination of the current developments on audio-sheet music retrieval via deep learning methods. We first identify a set of main challenges on the road towards robust and large-scale cross-modal music retrieval in real scenarios. We then highlight the steps we have taken so far to address some o",
    "path": "papers/23/09/2309.12158.json",
    "total_tokens": 856,
    "translated_title": "迈向鲁棒和真正大规模的音频-乐谱检索",
    "translated_abstract": "多模态音乐信息检索的一系列应用集中在解决将大量乐谱图像与相应的音频记录连接起来的问题，即识别引用相同音乐内容的音频和乐谱摘录。最近的一种典型方法是使用跨模态深度学习架构来学习将两种不同模态（音频和乐谱图像）连接起来的联合嵌入空间。尽管在过去几年中在这一领域取得了稳定的进展，但仍有一些开放问题阻碍了这种方法的大规模应用。在本文中，我们试图通过深度学习方法对当前在音频-乐谱检索方面的发展进行深入研究。我们首先确定了在实际场景中实现鲁棒和大规模跨模态音乐检索的一系列主要挑战。然后，我们强调了迄今为止我们已经采取的一些步骤来解决其中一些挑战。",
    "tldr": "本文研究了音频-乐谱检索的当前发展情况，通过深度学习方法解决了鲁棒性和大规模应用的挑战。"
}