{
    "title": "Interactively Learning Social Media Representations Improves News Source Factuality Detection. (arXiv:2309.14966v1 [cs.CL])",
    "abstract": "The rise of social media has enabled the widespread propagation of fake news, text that is published with an intent to spread misinformation and sway beliefs. Rapidly detecting fake news, especially as new events arise, is important to prevent misinformation.  While prior works have tackled this problem using supervised learning systems, automatedly modeling the complexities of the social media landscape that enables the spread of fake news is challenging. On the contrary, having humans fact check all news is not scalable. Thus, in this paper, we propose to approach this problem interactively, where humans can interact to help an automated system learn a better social media representation quality. On real world events, our experiments show performance improvements in detecting factuality of news sources, even after few human interactions.",
    "link": "http://arxiv.org/abs/2309.14966",
    "context": "Title: Interactively Learning Social Media Representations Improves News Source Factuality Detection. (arXiv:2309.14966v1 [cs.CL])\nAbstract: The rise of social media has enabled the widespread propagation of fake news, text that is published with an intent to spread misinformation and sway beliefs. Rapidly detecting fake news, especially as new events arise, is important to prevent misinformation.  While prior works have tackled this problem using supervised learning systems, automatedly modeling the complexities of the social media landscape that enables the spread of fake news is challenging. On the contrary, having humans fact check all news is not scalable. Thus, in this paper, we propose to approach this problem interactively, where humans can interact to help an automated system learn a better social media representation quality. On real world events, our experiments show performance improvements in detecting factuality of news sources, even after few human interactions.",
    "path": "papers/23/09/2309.14966.json",
    "total_tokens": 842,
    "translated_title": "通过交互学习社交媒体表示改善新闻来源真实性检测",
    "translated_abstract": "社交媒体的兴起使得虚假新闻的广泛传播成为可能，虚假新闻是指以传播错误信息和影响信仰为目的的文本。及时检测虚假新闻，特别是在新事件出现时，对于防止误导信息非常重要。尽管以前的研究利用监督学习系统解决了这个问题，但是自动建模社交媒体传播虚假新闻的复杂性仍然具有挑战性。相反，通过人工实时检查所有新闻是不可扩展的。因此，在本文中，我们提出了一种交互式的方法来解决这个问题，人们可以与自动化系统互动，帮助其学习更好的社交媒体表示质量。在真实事件中的实验证明，即使进行了少量的人类互动，也能提高检测新闻来源真实性的性能。",
    "tldr": "本文提出了一种交互式的方法来改善社交媒体表示质量，通过人类互动帮助自动化系统检测新闻来源的真实性，并在实验证明即使进行了少量的人类互动，也能提高性能。"
}