{
    "title": "LLM Guided Inductive Inference for Solving Compositional Problems. (arXiv:2309.11688v1 [cs.CL])",
    "abstract": "While large language models (LLMs) have demonstrated impressive performance in question-answering tasks, their performance is limited when the questions require knowledge that is not included in the model's training data and can only be acquired through direct observation or interaction with the real world. Existing methods decompose reasoning tasks through the use of modules invoked sequentially, limiting their ability to answer deep reasoning tasks. We introduce a method, Recursion based extensible LLM (REBEL), which handles open-world, deep reasoning tasks by employing automated reasoning techniques like dynamic planning and forward-chaining strategies. REBEL allows LLMs to reason via recursive problem decomposition and utilization of external tools. The tools that REBEL uses are specified only by natural language description. We further demonstrate REBEL capabilities on a set of problems that require a deeply nested use of external tools in a compositional and conversational settin",
    "link": "http://arxiv.org/abs/2309.11688",
    "context": "Title: LLM Guided Inductive Inference for Solving Compositional Problems. (arXiv:2309.11688v1 [cs.CL])\nAbstract: While large language models (LLMs) have demonstrated impressive performance in question-answering tasks, their performance is limited when the questions require knowledge that is not included in the model's training data and can only be acquired through direct observation or interaction with the real world. Existing methods decompose reasoning tasks through the use of modules invoked sequentially, limiting their ability to answer deep reasoning tasks. We introduce a method, Recursion based extensible LLM (REBEL), which handles open-world, deep reasoning tasks by employing automated reasoning techniques like dynamic planning and forward-chaining strategies. REBEL allows LLMs to reason via recursive problem decomposition and utilization of external tools. The tools that REBEL uses are specified only by natural language description. We further demonstrate REBEL capabilities on a set of problems that require a deeply nested use of external tools in a compositional and conversational settin",
    "path": "papers/23/09/2309.11688.json",
    "total_tokens": 824,
    "translated_title": "LLM引导的归纳推理解决组合问题",
    "translated_abstract": "虽然大型语言模型（LLMs）在问答任务中表现出令人印象深刻的性能，但当问题需要通过直接观察或与真实世界的交互来获取模型训练数据中不包括的知识时，它们的性能受到限制。现有的方法通过顺序调用模块来对推理任务进行分解，限制了它们回答深度推理任务的能力。我们引入了一种方法，基于递归的可扩展LLM（REBEL），通过使用动态规划和前向链接策略等自动推理技术处理开放世界的深度推理任务。REBEL通过递归问题分解和利用外部工具进行推理。REBEL使用的工具仅通过自然语言描述来指定。我们进一步在组合和对话环境中的一组需要深度嵌套的外部工具使用问题上展示了REBEL的能力。",
    "tldr": "LLM引导的归纳推理方法REBEL通过递归问题分解和利用外部工具进行推理，能够解决组合问题和对话环境中的深度推理任务。"
}