{
    "title": "pLMFPPred: a novel approach for accurate prediction of functional peptides integrating embedding from pre-trained protein language model and imbalanced learning. (arXiv:2309.14404v1 [q-bio.QM])",
    "abstract": "Functional peptides have the potential to treat a variety of diseases. Their good therapeutic efficacy and low toxicity make them ideal therapeutic agents. Artificial intelligence-based computational strategies can help quickly identify new functional peptides from collections of protein sequences and discover their different functions.Using protein language model-based embeddings (ESM-2), we developed a tool called pLMFPPred (Protein Language Model-based Functional Peptide Predictor) for predicting functional peptides and identifying toxic peptides. We also introduced SMOTE-TOMEK data synthesis sampling and Shapley value-based feature selection techniques to relieve data imbalance issues and reduce computational costs. On a validated independent test set, pLMFPPred achieved accuracy, Area under the curve - Receiver Operating Characteristics, and F1-Score values of 0.974, 0.99, and 0.974, respectively. Comparative experiments show that pLMFPPred outperforms current methods for predicti",
    "link": "http://arxiv.org/abs/2309.14404",
    "context": "Title: pLMFPPred: a novel approach for accurate prediction of functional peptides integrating embedding from pre-trained protein language model and imbalanced learning. (arXiv:2309.14404v1 [q-bio.QM])\nAbstract: Functional peptides have the potential to treat a variety of diseases. Their good therapeutic efficacy and low toxicity make them ideal therapeutic agents. Artificial intelligence-based computational strategies can help quickly identify new functional peptides from collections of protein sequences and discover their different functions.Using protein language model-based embeddings (ESM-2), we developed a tool called pLMFPPred (Protein Language Model-based Functional Peptide Predictor) for predicting functional peptides and identifying toxic peptides. We also introduced SMOTE-TOMEK data synthesis sampling and Shapley value-based feature selection techniques to relieve data imbalance issues and reduce computational costs. On a validated independent test set, pLMFPPred achieved accuracy, Area under the curve - Receiver Operating Characteristics, and F1-Score values of 0.974, 0.99, and 0.974, respectively. Comparative experiments show that pLMFPPred outperforms current methods for predicti",
    "path": "papers/23/09/2309.14404.json",
    "total_tokens": 998,
    "translated_title": "pLMFPPred: 一种准确预测功能肽的新方法，整合了预训练蛋白质语言模型的嵌入和不平衡学习",
    "translated_abstract": "功能肽具有治疗各种疾病的潜力。它们具有良好的治疗效果和低毒性，是理想的治疗药物。基于人工智能的计算策略可以帮助从蛋白质序列集合中快速识别新的功能肽，并发现它们的不同功能。本文使用基于蛋白质语言模型的嵌入（ESM-2）开发了一个名为pLMFPPred（基于蛋白质语言模型的功能肽预测工具），用于预测功能肽并识别有毒肽。同时，为了缓解数据不平衡问题并降低计算成本，我们引入了SMOTE-TOMEK数据合成采样和Shapley值基于特征选择技术。在经过验证的独立测试集上，pLMFPPred的准确率、接受者操作特征曲线下面积和F1得分分别达到0.974、0.99和0.974。对比实验表明，pLMFPPred在预测功能肽方面优于当前的方法。",
    "tldr": "该论文提出了一种名为pLMFPPred的新方法，通过结合预训练蛋白质语言模型的嵌入和不平衡学习技术，准确预测功能肽。实验结果表明，pLMFPPred在预测功能肽方面优于现有的方法。",
    "en_tdlr": "This paper introduces a novel approach called pLMFPPred that accurately predicts functional peptides by integrating embedding from a pre-trained protein language model and imbalanced learning techniques. Experimental results demonstrate the superiority of pLMFPPred over existing methods for predicting functional peptides."
}