{
    "title": "Inspire the Large Language Model by External Knowledge on BioMedical Named Entity Recognition. (arXiv:2309.12278v1 [cs.CL])",
    "abstract": "Large language models (LLMs) have demonstrated dominating performance in many NLP tasks, especially on generative tasks. However, they often fall short in some information extraction tasks, particularly those requiring domain-specific knowledge, such as Biomedical Named Entity Recognition (NER). In this paper, inspired by Chain-of-thought, we leverage the LLM to solve the Biomedical NER step-by-step: break down the NER task into entity span extraction and entity type determination. Additionally, for entity type determination, we inject entity knowledge to address the problem that LLM's lack of domain knowledge when predicting entity category. Experimental results show a significant improvement in our two-step BioNER approach compared to previous few-shot LLM baseline. Additionally, the incorporation of external knowledge significantly enhances entity category determination performance.",
    "link": "http://arxiv.org/abs/2309.12278",
    "context": "Title: Inspire the Large Language Model by External Knowledge on BioMedical Named Entity Recognition. (arXiv:2309.12278v1 [cs.CL])\nAbstract: Large language models (LLMs) have demonstrated dominating performance in many NLP tasks, especially on generative tasks. However, they often fall short in some information extraction tasks, particularly those requiring domain-specific knowledge, such as Biomedical Named Entity Recognition (NER). In this paper, inspired by Chain-of-thought, we leverage the LLM to solve the Biomedical NER step-by-step: break down the NER task into entity span extraction and entity type determination. Additionally, for entity type determination, we inject entity knowledge to address the problem that LLM's lack of domain knowledge when predicting entity category. Experimental results show a significant improvement in our two-step BioNER approach compared to previous few-shot LLM baseline. Additionally, the incorporation of external knowledge significantly enhances entity category determination performance.",
    "path": "papers/23/09/2309.12278.json",
    "total_tokens": 894,
    "translated_title": "通过外部知识激发大型语言模型在生物医学命名实体识别中的应用",
    "translated_abstract": "大型语言模型在许多自然语言处理任务中表现出优越的性能，尤其是在生成性任务方面。然而，在一些信息提取任务中，它们往往表现不佳，特别是那些需要领域特定知识的任务，如生物医学命名实体识别。本文受到思维链的启发，我们将大型语言模型应用于生物医学命名实体识别中，通过分解NER任务为实体跨度提取和实体类型确定两步骤来解决。此外，为了解决大型语言模型在预测实体类别时缺乏领域知识的问题，我们引入了实体知识。实验结果显示，与之前的少样本大型语言模型基准相比，我们的两步骤BioNER方法取得了显著的改进。此外，外部知识的整合显著提高了实体类型确定的性能。",
    "tldr": "本文提出了一种通过外部知识激发大型语言模型在生物医学命名实体识别中的应用方法，通过分解NER任务为实体跨度提取和实体类型确定两步骤，并引入领域知识来增强实体类别确定性能，取得了显著的改进。",
    "en_tdlr": "This paper proposes an approach to inspire large language models in biomedical named entity recognition by leveraging external knowledge, breaking down the NER task into entity span extraction and entity type determination, and incorporating domain-specific knowledge to enhance entity category determination performance, achieving significant improvement compared to previous baselines."
}