{
    "title": "Propagation and Attribution of Uncertainty in Medical Imaging Pipelines. (arXiv:2309.16831v1 [cs.CV])",
    "abstract": "Uncertainty estimation, which provides a means of building explainable neural networks for medical imaging applications, have mostly been studied for single deep learning models that focus on a specific task. In this paper, we propose a method to propagate uncertainty through cascades of deep learning models in medical imaging pipelines. This allows us to aggregate the uncertainty in later stages of the pipeline and to obtain a joint uncertainty measure for the predictions of later models. Additionally, we can separately report contributions of the aleatoric, data-based, uncertainty of every component in the pipeline. We demonstrate the utility of our method on a realistic imaging pipeline that reconstructs undersampled brain and knee magnetic resonance (MR) images and subsequently predicts quantitative information from the images, such as the brain volume, or knee side or patient's sex. We quantitatively show that the propagated uncertainty is correlated with input uncertainty and com",
    "link": "http://arxiv.org/abs/2309.16831",
    "context": "Title: Propagation and Attribution of Uncertainty in Medical Imaging Pipelines. (arXiv:2309.16831v1 [cs.CV])\nAbstract: Uncertainty estimation, which provides a means of building explainable neural networks for medical imaging applications, have mostly been studied for single deep learning models that focus on a specific task. In this paper, we propose a method to propagate uncertainty through cascades of deep learning models in medical imaging pipelines. This allows us to aggregate the uncertainty in later stages of the pipeline and to obtain a joint uncertainty measure for the predictions of later models. Additionally, we can separately report contributions of the aleatoric, data-based, uncertainty of every component in the pipeline. We demonstrate the utility of our method on a realistic imaging pipeline that reconstructs undersampled brain and knee magnetic resonance (MR) images and subsequently predicts quantitative information from the images, such as the brain volume, or knee side or patient's sex. We quantitatively show that the propagated uncertainty is correlated with input uncertainty and com",
    "path": "papers/23/09/2309.16831.json",
    "total_tokens": 866,
    "translated_title": "医学图像处理中的不确定性传播和归因",
    "translated_abstract": "不确定性估计提供了一种构建可解释的神经网络用于医学图像应用的方法，其中主要研究了针对特定任务的单个深度学习模型。在本文中，我们提出了一种在医学图像处理流程中传播不确定性的方法。这使我们能够聚合流程后期的不确定性，并获得后续模型预测的联合不确定性度量。此外，我们可以分别报告流程中每个组件的内部、数据基础不确定性的贡献。我们在一个实际的图像处理流程上演示了我们方法的有效性，该流程从下采样的脑部和膝盖磁共振（MR）图像重建，然后预测图像中的定量信息，例如脑容积、膝盖边缘或患者性别等。我们定量地显示传播的不确定性与输入不确定性相关。",
    "tldr": "本文提出了一种在医学图像处理流程中传播不确定性的方法，能够聚合流程后期的不确定性，并获得后续模型预测的联合不确定性度量。同时，还能够报告流程中每个组件的内部、数据基础不确定性的贡献。",
    "en_tdlr": "This paper proposes a method to propagate uncertainty in medical imaging pipelines, allowing for aggregation of uncertainty in later stages and obtaining a joint uncertainty measure for predictions. Additionally, it can report the contributions of uncertainty in each component of the pipeline."
}