{
    "title": "Uncertainty-driven Exploration Strategies for Online Grasp Learning. (arXiv:2309.12038v1 [cs.RO])",
    "abstract": "Existing grasp prediction approaches are mostly based on offline learning, while, ignored the exploratory grasp learning during online adaptation to new picking scenarios, i.e., unseen object portfolio, camera and bin settings etc. In this paper, we present a novel method for online learning of grasp predictions for robotic bin picking in a principled way. Existing grasp prediction approaches are mostly based on offline learning, while, ignored the exploratory grasp learning during online adaptation to new picking scenarios, i.e., unseen object portfolio, camera and bin settings etc. In this paper, we present a novel method for online learning of grasp predictions for robotic bin picking in a principled way. Specifically, the online learning algorithm with an effective exploration strategy can significantly improve its adaptation performance to unseen environment settings. To this end, we first propose to formulate online grasp learning as a RL problem that will allow to adapt both gra",
    "link": "http://arxiv.org/abs/2309.12038",
    "context": "Title: Uncertainty-driven Exploration Strategies for Online Grasp Learning. (arXiv:2309.12038v1 [cs.RO])\nAbstract: Existing grasp prediction approaches are mostly based on offline learning, while, ignored the exploratory grasp learning during online adaptation to new picking scenarios, i.e., unseen object portfolio, camera and bin settings etc. In this paper, we present a novel method for online learning of grasp predictions for robotic bin picking in a principled way. Existing grasp prediction approaches are mostly based on offline learning, while, ignored the exploratory grasp learning during online adaptation to new picking scenarios, i.e., unseen object portfolio, camera and bin settings etc. In this paper, we present a novel method for online learning of grasp predictions for robotic bin picking in a principled way. Specifically, the online learning algorithm with an effective exploration strategy can significantly improve its adaptation performance to unseen environment settings. To this end, we first propose to formulate online grasp learning as a RL problem that will allow to adapt both gra",
    "path": "papers/23/09/2309.12038.json",
    "total_tokens": 744,
    "translated_title": "在线抓取学习中基于不确定性驱动的探索策略",
    "translated_abstract": "现有的抓取预测方法主要基于离线学习，而忽略了在线适应新的拾取场景时的探索性抓取学习，例如未见目标组合、摄像机和箱子设置等。本文提出了一种新颖的用于机器人箱子拾取的在线抓取预测学习方法。具体而言，使用有效的探索策略的在线学习算法可以显著提高其对未见环境设置的适应性能力。为此，我们首先将在线抓取学习建模为强化学习问题，以实现对抓取策略的自适应学习。",
    "tldr": "本文提出了一种在线抓取学习方法，通过使用有效的探索策略，提高了机器人对未知环境的适应能力和抓取预测的准确性。"
}