{
    "title": "Probing the Moral Development of Large Language Models through Defining Issues Test. (arXiv:2309.13356v2 [cs.CL] UPDATED)",
    "abstract": "In this study, we measure the moral reasoning ability of LLMs using the Defining Issues Test - a psychometric instrument developed for measuring the moral development stage of a person according to the Kohlberg's Cognitive Moral Development Model. DIT uses moral dilemmas followed by a set of ethical considerations that the respondent has to judge for importance in resolving the dilemma, and then rank-order them by importance. A moral development stage score of the respondent is then computed based on the relevance rating and ranking.  Our study shows that early LLMs such as GPT-3 exhibit a moral reasoning ability no better than that of a random baseline, while ChatGPT, Llama2-Chat, PaLM-2 and GPT-4 show significantly better performance on this task, comparable to adult humans. GPT-4, in fact, has the highest post-conventional moral reasoning score, equivalent to that of typical graduate school students. However, we also observe that the models do not perform consistently across all dil",
    "link": "http://arxiv.org/abs/2309.13356",
    "context": "Title: Probing the Moral Development of Large Language Models through Defining Issues Test. (arXiv:2309.13356v2 [cs.CL] UPDATED)\nAbstract: In this study, we measure the moral reasoning ability of LLMs using the Defining Issues Test - a psychometric instrument developed for measuring the moral development stage of a person according to the Kohlberg's Cognitive Moral Development Model. DIT uses moral dilemmas followed by a set of ethical considerations that the respondent has to judge for importance in resolving the dilemma, and then rank-order them by importance. A moral development stage score of the respondent is then computed based on the relevance rating and ranking.  Our study shows that early LLMs such as GPT-3 exhibit a moral reasoning ability no better than that of a random baseline, while ChatGPT, Llama2-Chat, PaLM-2 and GPT-4 show significantly better performance on this task, comparable to adult humans. GPT-4, in fact, has the highest post-conventional moral reasoning score, equivalent to that of typical graduate school students. However, we also observe that the models do not perform consistently across all dil",
    "path": "papers/23/09/2309.13356.json",
    "total_tokens": 920,
    "translated_title": "通过定义问题测试探究大语言模型的道德发展",
    "translated_abstract": "本研究使用定义问题测试(DIT)来测量LLMs的道德推理能力，DIT是一种心理测量工具，用于根据科尔伯格的认知道德发展模型来衡量个人的道德发展阶段。DIT使用道德困境，并要求被调查者根据道德考虑的重要性来判断和排序。研究结果显示，早期的LLMs（如GPT-3）在道德推理能力上并不比随机基线更好，而ChatGPT、Llama2-Chat、PaLM-2和GPT-4在这项任务上表现出明显更好的性能，可与成年人相媲美。实际上，GPT-4具有最高的后常规道德推理分数，相当于典型研究生的水平。然而，我们也观察到这些模型在所有困境上的表现并不一致。",
    "tldr": "通过定义问题测试测量LLMs的道德推理能力，早期模型表现不佳，而ChatGPT、Llama2-Chat、PaLM-2和GPT-4在这方面表现出色，与成年人相当。然而，这些模型在不同困境下的表现存在差异。"
}