{
    "title": "Extracting Mathematical Concepts with Large Language Models. (arXiv:2309.00642v1 [cs.CL])",
    "abstract": "We extract mathematical concepts from mathematical text using generative large language models (LLMs) like ChatGPT, contributing to the field of automatic term extraction (ATE) and mathematical text processing, and also to the study of LLMs themselves. Our work builds on that of others in that we aim for automatic extraction of terms (keywords) in one mathematical field, category theory, using as a corpus the 755 abstracts from a snapshot of the online journal \"Theory and Applications of Categories\", circa 2020. Where our study diverges from previous work is in (1) providing a more thorough analysis of what makes mathematical term extraction a difficult problem to begin with; (2) paying close attention to inter-annotator disagreements; (3) providing a set of guidelines which both human and machine annotators could use to standardize the extraction process; (4) introducing a new annotation tool to help humans with ATE, applicable to any mathematical field and even beyond mathematics; (5",
    "link": "http://arxiv.org/abs/2309.00642",
    "context": "Title: Extracting Mathematical Concepts with Large Language Models. (arXiv:2309.00642v1 [cs.CL])\nAbstract: We extract mathematical concepts from mathematical text using generative large language models (LLMs) like ChatGPT, contributing to the field of automatic term extraction (ATE) and mathematical text processing, and also to the study of LLMs themselves. Our work builds on that of others in that we aim for automatic extraction of terms (keywords) in one mathematical field, category theory, using as a corpus the 755 abstracts from a snapshot of the online journal \"Theory and Applications of Categories\", circa 2020. Where our study diverges from previous work is in (1) providing a more thorough analysis of what makes mathematical term extraction a difficult problem to begin with; (2) paying close attention to inter-annotator disagreements; (3) providing a set of guidelines which both human and machine annotators could use to standardize the extraction process; (4) introducing a new annotation tool to help humans with ATE, applicable to any mathematical field and even beyond mathematics; (5",
    "path": "papers/23/09/2309.00642.json",
    "total_tokens": 910,
    "translated_title": "使用大型语言模型从数学文本中提取数学概念",
    "translated_abstract": "我们使用生成型大型语言模型（LLM）（如ChatGPT）从数学文本中提取数学概念，为自动术语提取（ATE）和数学文本处理领域做出了贡献，同时也为LLM研究作出了贡献。我们的工作在于，在数学领域（范畴论）中自动提取术语（关键词），使用的语料库是2020年左右的在线期刊《范畴的理论与应用》中的755个摘要。我们的研究与之前的工作不同之处在于：（1）对于什么使数学术语提取成为困难问题进行了更全面的分析；（2）对互相之间的标注者意见不一致进行了仔细的关注；（3）提供了一套供人工和机器标注者使用的指导方针，用以标准化提取过程；（4）引入了一个新的标注工具，帮助人类进行ATE，可适用于任何数学领域，甚至超越数学；（5）",
    "tldr": "使用大型语言模型从数学文本中提取数学概念，为自动术语提取和数学文本处理做出了贡献，同时提供了一套标准化的提取过程和新的标注工具。",
    "en_tdlr": "This paper contributes to the field of automatic term extraction and mathematical text processing by using large language models to extract mathematical concepts from mathematical text, and introduces a standardized extraction process and a new annotation tool."
}