{
    "title": "Dynamic Multi-Scale Context Aggregation for Conversational Aspect-Based Sentiment Quadruple Analysis. (arXiv:2309.15476v1 [cs.CL])",
    "abstract": "Conversational aspect-based sentiment quadruple analysis (DiaASQ) aims to extract the quadruple of target-aspect-opinion-sentiment within a dialogue. In DiaASQ, a quadruple's elements often cross multiple utterances. This situation complicates the extraction process, emphasizing the need for an adequate understanding of conversational context and interactions. However, existing work independently encodes each utterance, thereby struggling to capture long-range conversational context and overlooking the deep inter-utterance dependencies. In this work, we propose a novel Dynamic Multi-scale Context Aggregation network (DMCA) to address the challenges. Specifically, we first utilize dialogue structure to generate multi-scale utterance windows for capturing rich contextual information. After that, we design a Dynamic Hierarchical Aggregation module (DHA) to integrate progressive cues between them. In addition, we form a multi-stage loss strategy to improve model performance and generalizat",
    "link": "http://arxiv.org/abs/2309.15476",
    "context": "Title: Dynamic Multi-Scale Context Aggregation for Conversational Aspect-Based Sentiment Quadruple Analysis. (arXiv:2309.15476v1 [cs.CL])\nAbstract: Conversational aspect-based sentiment quadruple analysis (DiaASQ) aims to extract the quadruple of target-aspect-opinion-sentiment within a dialogue. In DiaASQ, a quadruple's elements often cross multiple utterances. This situation complicates the extraction process, emphasizing the need for an adequate understanding of conversational context and interactions. However, existing work independently encodes each utterance, thereby struggling to capture long-range conversational context and overlooking the deep inter-utterance dependencies. In this work, we propose a novel Dynamic Multi-scale Context Aggregation network (DMCA) to address the challenges. Specifically, we first utilize dialogue structure to generate multi-scale utterance windows for capturing rich contextual information. After that, we design a Dynamic Hierarchical Aggregation module (DHA) to integrate progressive cues between them. In addition, we form a multi-stage loss strategy to improve model performance and generalizat",
    "path": "papers/23/09/2309.15476.json",
    "total_tokens": 990,
    "translated_title": "动态多尺度上下文聚合用于会话级方面情感四元组分析",
    "translated_abstract": "会话级方面情感四元组分析（DiaASQ）旨在提取对话中目标-方面-意见-情感的四元组。在DiaASQ中，四元组的元素经常跨越多个言语。这种情况复杂化了提取过程，强调了对会话上下文和交互的充分理解的需要。然而，现有工作独立地编码每个言语，因此难以捕捉到长范围的会话上下文并忽视了深层的言语间依赖关系。在本文中，我们提出了一种新颖的动态多尺度上下文聚合网络(DMCA)来应对这些挑战。具体而言，我们首先利用对话结构生成多尺度的言语窗口来捕捉丰富的上下文信息。之后，我们设计了一个动态分层聚合模块(DHA)来集成它们之间的渐进线索。此外，我们采用了多阶段损失策略来提高模型的性能和泛化能力。",
    "tldr": "本研究提出了一种名为动态多尺度上下文聚合网络(DMCA)的方法，通过利用对话结构和动态分层聚合模块(DHA)，有效地解决了会话级方面情感四元组分析(DiaASQ)中提取四元组的困难。采用多阶段损失策略进一步提高了模型的性能和泛化能力。"
}