{
    "title": "Photonic Accelerators for Image Segmentation in Autonomous Driving and Defect Detection. (arXiv:2309.16783v1 [cs.CV])",
    "abstract": "Photonic computing promises faster and more energy-efficient deep neural network (DNN) inference than traditional digital hardware. Advances in photonic computing can have profound impacts on applications such as autonomous driving and defect detection that depend on fast, accurate and energy efficient execution of image segmentation models. In this paper, we investigate image segmentation on photonic accelerators to explore: a) the types of image segmentation DNN architectures that are best suited for photonic accelerators, and b) the throughput and energy efficiency of executing the different image segmentation models on photonic accelerators, along with the trade-offs involved therein. Specifically, we demonstrate that certain segmentation models exhibit negligible loss in accuracy (compared to digital float32 models) when executed on photonic accelerators, and explore the empirical reasoning for their robustness. We also discuss techniques for recovering accuracy in the case of mod",
    "link": "http://arxiv.org/abs/2309.16783",
    "context": "Title: Photonic Accelerators for Image Segmentation in Autonomous Driving and Defect Detection. (arXiv:2309.16783v1 [cs.CV])\nAbstract: Photonic computing promises faster and more energy-efficient deep neural network (DNN) inference than traditional digital hardware. Advances in photonic computing can have profound impacts on applications such as autonomous driving and defect detection that depend on fast, accurate and energy efficient execution of image segmentation models. In this paper, we investigate image segmentation on photonic accelerators to explore: a) the types of image segmentation DNN architectures that are best suited for photonic accelerators, and b) the throughput and energy efficiency of executing the different image segmentation models on photonic accelerators, along with the trade-offs involved therein. Specifically, we demonstrate that certain segmentation models exhibit negligible loss in accuracy (compared to digital float32 models) when executed on photonic accelerators, and explore the empirical reasoning for their robustness. We also discuss techniques for recovering accuracy in the case of mod",
    "path": "papers/23/09/2309.16783.json",
    "total_tokens": 928,
    "translated_title": "光子加速器用于自动驾驶中的图像分割和缺陷检测",
    "translated_abstract": "光子计算承诺比传统的数字硬件更快速和能量更高效的深度神经网络（DNN）推断。光子计算的进步可以对依赖于快速、准确和能量高效执行图像分割模型的应用，如自动驾驶和缺陷检测，产生深远影响。本文研究了在光子加速器上进行图像分割，探索了适合光子加速器的图像分割DNN架构类型以及在光子加速器上执行不同图像分割模型的吞吐量和能量效率，以及其中的权衡。具体地，我们证明了当在光子加速器上执行时，某些分割模型的准确性损失可以忽略不计（与数字float32模型相比），并探讨了它们的稳健性的经验推理。我们还讨论了在模型的修复准确性的技术（在模型被干扰时）。",
    "tldr": "该论文研究了光子加速器在自动驾驶和缺陷检测中的图像分割应用。研究发现，使用光子加速器执行特定的分割模型可以在准确性上忽略损失，并讨论了在模型被干扰时修复准确性的技术。",
    "en_tdlr": "This paper investigates the use of photonic accelerators for image segmentation in the context of autonomous driving and defect detection. The research shows that certain segmentation models can be executed on photonic accelerators with negligible loss in accuracy, and discusses techniques for recovering accuracy in the case of interference."
}