{
    "title": "AI in Software Engineering: Case Studies and Prospects. (arXiv:2309.15768v1 [cs.SE])",
    "abstract": "Artificial intelligence (AI) and software engineering (SE) are two important areas in computer science. In recent years, researchers are trying to apply AI techniques in various stages of software development to improve the overall quality of software products. Moreover, there are also some researchers focus on the intersection between SE and AI. In fact, the relationship between SE and AI is very weak; however, methods and techniques in one area have been adopted in another area. More and more software products are capable of performing intelligent behaviour like human beings. In this paper, two cases studies which are IBM Watson and Google AlphaGo that use different AI techniques in solving real world challenging problems have been analysed, evaluated and compared. Based on the analysis of both case studies, using AI techniques such as deep learning and machine learning in software systems contributes to intelligent systems. Watson adopts 'decision making support' strategy to help hu",
    "link": "http://arxiv.org/abs/2309.15768",
    "context": "Title: AI in Software Engineering: Case Studies and Prospects. (arXiv:2309.15768v1 [cs.SE])\nAbstract: Artificial intelligence (AI) and software engineering (SE) are two important areas in computer science. In recent years, researchers are trying to apply AI techniques in various stages of software development to improve the overall quality of software products. Moreover, there are also some researchers focus on the intersection between SE and AI. In fact, the relationship between SE and AI is very weak; however, methods and techniques in one area have been adopted in another area. More and more software products are capable of performing intelligent behaviour like human beings. In this paper, two cases studies which are IBM Watson and Google AlphaGo that use different AI techniques in solving real world challenging problems have been analysed, evaluated and compared. Based on the analysis of both case studies, using AI techniques such as deep learning and machine learning in software systems contributes to intelligent systems. Watson adopts 'decision making support' strategy to help hu",
    "path": "papers/23/09/2309.15768.json",
    "total_tokens": 863,
    "translated_title": "软件工程中的人工智能：案例研究与展望",
    "translated_abstract": "人工智能（AI）和软件工程（SE）是计算机科学中的重要领域。近年来，研究人员试图在软件开发的各个阶段应用AI技术，以提高软件产品的整体质量。此外，也有一些研究人员关注SE和AI的交集。事实上，SE和AI之间的关系非常微弱；然而，一种领域中的方法和技术已经在另一种领域中被采用。越来越多的软件产品能够像人类一样具有智能行为。本文分析、评估和比较了使用不同AI技术解决现实世界挑战性问题的两个案例研究，即IBM Watson和Google AlphaGo。基于对两个案例研究的分析，使用诸如深度学习和机器学习的AI技术在软件系统中有助于智能化系统。Watson采用“决策支持”策略来帮助人",
    "tldr": "本文分析了IBM Watson和Google AlphaGo两个案例研究，并得出结论：在软件系统中使用深度学习和机器学习等AI技术有助于实现智能化系统。"
}