{
    "title": "Neural-Singular-Hessian: Implicit Neural Representation of Unoriented Point Clouds by Enforcing Singular Hessian. (arXiv:2309.01793v2 [cs.CV] UPDATED)",
    "abstract": "Neural implicit representation is a promising approach for reconstructing surfaces from point clouds. Existing methods combine various regularization terms, such as the Eikonal and Laplacian energy terms, to enforce the learned neural function to possess the properties of a Signed Distance Function (SDF). However, inferring the actual topology and geometry of the underlying surface from poor-quality unoriented point clouds remains challenging. In accordance with Differential Geometry, the Hessian of the SDF is singular for points within the differential thin-shell space surrounding the surface. Our approach enforces the Hessian of the neural implicit function to have a zero determinant for points near the surface. This technique aligns the gradients for a near-surface point and its on-surface projection point, producing a rough but faithful shape within just a few iterations. By annealing the weight of the singular-Hessian term, our approach ultimately produces a high-fidelity reconstr",
    "link": "http://arxiv.org/abs/2309.01793",
    "context": "Title: Neural-Singular-Hessian: Implicit Neural Representation of Unoriented Point Clouds by Enforcing Singular Hessian. (arXiv:2309.01793v2 [cs.CV] UPDATED)\nAbstract: Neural implicit representation is a promising approach for reconstructing surfaces from point clouds. Existing methods combine various regularization terms, such as the Eikonal and Laplacian energy terms, to enforce the learned neural function to possess the properties of a Signed Distance Function (SDF). However, inferring the actual topology and geometry of the underlying surface from poor-quality unoriented point clouds remains challenging. In accordance with Differential Geometry, the Hessian of the SDF is singular for points within the differential thin-shell space surrounding the surface. Our approach enforces the Hessian of the neural implicit function to have a zero determinant for points near the surface. This technique aligns the gradients for a near-surface point and its on-surface projection point, producing a rough but faithful shape within just a few iterations. By annealing the weight of the singular-Hessian term, our approach ultimately produces a high-fidelity reconstr",
    "path": "papers/23/09/2309.01793.json",
    "total_tokens": 894,
    "translated_title": "神经奇异黑塞矩阵：通过强制奇异黑塞矩阵隐式表示无定向点云",
    "translated_abstract": "神经隐式表示是从点云重构表面的一种有希望的方法。现有的方法结合了各种正则化项，如Eikonal和Laplacian能量项，以强制学习的神经函数具有有符号距离函数(SDF)的特性。然而，从质量较差的无定向点云中推断出潜在表面的实际拓扑和几何仍然具有挑战性。根据微分几何，在围绕表面的微分薄壳空间内，SDF的黑塞矩阵是奇异的。我们的方法强制神经隐式函数的黑塞矩阵在靠近表面的点上具有零行列式。这种技术对于近表面点及其在表面上投影点对齐梯度，仅需几次迭代即可生成粗略但忠实的形状。通过逐渐降低奇异黑塞矩阵项的权重，我们的方法最终产生高保真的重建。",
    "tldr": "本研究提出了一种神经奇异黑塞矩阵的方法，通过强制神经隐式函数的黑塞矩阵在靠近表面的点上具有零行列式，从质量较差的无定向点云中重构高保真的形状。"
}