{
    "title": "Deep Model Fusion: A Survey. (arXiv:2309.15698v1 [cs.LG])",
    "abstract": "Deep model fusion/merging is an emerging technique that merges the parameters or predictions of multiple deep learning models into a single one. It combines the abilities of different models to make up for the biases and errors of a single model to achieve better performance. However, deep model fusion on large-scale deep learning models (e.g., LLMs and foundation models) faces several challenges, including high computational cost, high-dimensional parameter space, interference between different heterogeneous models, etc. Although model fusion has attracted widespread attention due to its potential to solve complex real-world tasks, there is still a lack of complete and detailed survey research on this technique. Accordingly, in order to understand the model fusion method better and promote its development, we present a comprehensive survey to summarize the recent progress. Specifically, we categorize existing deep model fusion methods as four-fold: (1) \"Mode connectivity\", which conne",
    "link": "http://arxiv.org/abs/2309.15698",
    "context": "Title: Deep Model Fusion: A Survey. (arXiv:2309.15698v1 [cs.LG])\nAbstract: Deep model fusion/merging is an emerging technique that merges the parameters or predictions of multiple deep learning models into a single one. It combines the abilities of different models to make up for the biases and errors of a single model to achieve better performance. However, deep model fusion on large-scale deep learning models (e.g., LLMs and foundation models) faces several challenges, including high computational cost, high-dimensional parameter space, interference between different heterogeneous models, etc. Although model fusion has attracted widespread attention due to its potential to solve complex real-world tasks, there is still a lack of complete and detailed survey research on this technique. Accordingly, in order to understand the model fusion method better and promote its development, we present a comprehensive survey to summarize the recent progress. Specifically, we categorize existing deep model fusion methods as four-fold: (1) \"Mode connectivity\", which conne",
    "path": "papers/23/09/2309.15698.json",
    "total_tokens": 1002,
    "translated_title": "深度模型融合：一项综述",
    "translated_abstract": "深度模型融合是一种新兴技术，将多个深度学习模型的参数或预测合并到单个模型中。它结合了不同模型的能力，弥补了单个模型的偏差和误差，从而实现更好的性能。然而，在大规模深度学习模型（如LLMs和基础模型）上进行深度模型融合面临着许多挑战，包括高计算成本、高维参数空间、不同异构模型之间的干扰等。尽管模型融合由于其解决复杂实际任务的潜力而受到广泛关注，但对该技术的完整和详细调查研究仍然不足。因此，为了更好地了解模型融合方法并推动其发展，我们提出了一项综合调查，总结了最近的进展。具体而言，我们将现有的深度模型融合方法分为四个类别：（1）\"模式连接\"，即将多个模型通过连接方式融合。",
    "tldr": "深度模型融合是一种新兴技术，将多个深度学习模型的参数或预测合并到单个模型中，以实现更好的性能。在大规模深度学习模型上面临许多挑战，如高计算成本、高维参数空间、不同异构模型之间的干扰等。本论文为了更好地了解模型融合方法并推动其发展，提出了一项综合调查，总结了最近的进展。",
    "en_tdlr": "Deep model fusion is an emerging technique that merges the parameters or predictions of multiple deep learning models into a single one to achieve better performance. It faces challenges on large-scale deep learning models, such as high computational cost, high-dimensional parameter space, and interference between different heterogeneous models. This survey presents a comprehensive analysis to better understand the model fusion method and promote its development."
}