{
    "title": "An Image Dataset for Benchmarking Recommender Systems with Raw Pixels. (arXiv:2309.06789v1 [cs.IR])",
    "abstract": "Recommender systems (RS) have achieved significant success by leveraging explicit identification (ID) features. However, the full potential of content features, especially the pure image pixel features, remains relatively unexplored. The limited availability of large, diverse, and content-driven image recommendation datasets has hindered the use of raw images as item representations. In this regard, we present PixelRec, a massive image-centric recommendation dataset that includes approximately 200 million user-image interactions, 30 million users, and 400,000 high-quality cover images. By providing direct access to raw image pixels, PixelRec enables recommendation models to learn item representation directly from them. To demonstrate its utility, we begin by presenting the results of several classical pure ID-based baseline models, termed IDNet, trained on PixelRec. Then, to show the effectiveness of the dataset's image features, we substitute the itemID embeddings (from IDNet) with a ",
    "link": "http://arxiv.org/abs/2309.06789",
    "context": "Title: An Image Dataset for Benchmarking Recommender Systems with Raw Pixels. (arXiv:2309.06789v1 [cs.IR])\nAbstract: Recommender systems (RS) have achieved significant success by leveraging explicit identification (ID) features. However, the full potential of content features, especially the pure image pixel features, remains relatively unexplored. The limited availability of large, diverse, and content-driven image recommendation datasets has hindered the use of raw images as item representations. In this regard, we present PixelRec, a massive image-centric recommendation dataset that includes approximately 200 million user-image interactions, 30 million users, and 400,000 high-quality cover images. By providing direct access to raw image pixels, PixelRec enables recommendation models to learn item representation directly from them. To demonstrate its utility, we begin by presenting the results of several classical pure ID-based baseline models, termed IDNet, trained on PixelRec. Then, to show the effectiveness of the dataset's image features, we substitute the itemID embeddings (from IDNet) with a ",
    "path": "papers/23/09/2309.06789.json",
    "total_tokens": 918,
    "translated_title": "使用原始像素为基准的推荐系统图像数据集",
    "translated_abstract": "推荐系统（RS）通过利用明确的识别（ID）特征取得了显著的成功。但是，内容特征，尤其是纯图像像素特征的全部潜力仍然相对未被开发。大规模、多样化、以内容为驱动的图像推荐数据集的有限可用性阻碍了使用原始图像作为项目表示的能力。在这方面，我们提出了PixelRec，一个大规模的以图像为中心的推荐数据集，包括约2亿个用户-图像交互、3000万个用户和40万个高质量封面图像。通过直接访问原始图像像素，PixelRec使得推荐模型能够直接从中学习项目表示。为了证明其效用，我们首先呈现了在PixelRec上训练的几个经典纯ID基线模型（称为IDNet）的结果。然后，为了展示数据集的图像特征的有效性，我们将项目ID嵌入（来自IDNet）与一个...",
    "tldr": "这个研究提出了PixelRec，一个大规模图像推荐数据集，包括2亿个用户-图像交互、30万个用户和40万个高质量封面图像。通过提供原始图像像素的直接访问，PixelRec使得推荐模型能够直接从图像学习项目表示。",
    "en_tdlr": "This research introduces PixelRec, a massive image recommendation dataset with 200 million user-image interactions, 30 million users, and 400,000 high-quality cover images. By providing direct access to raw image pixels, PixelRec enables recommendation models to learn item representation directly from the images."
}