{
    "title": "Enhancing accuracy for solving American CEV model with high-order compact scheme and adaptive time stepping. (arXiv:2309.03984v1 [q-fin.CP])",
    "abstract": "In this research work, we propose a high-order time adapted scheme for pricing a coupled system of fixed-free boundary constant elasticity of variance (CEV) model on both equidistant and locally refined space-grid. The performance of our method is substantially enhanced to improve irregularities in the model which are both inherent and induced. Furthermore, the system of coupled PDEs is strongly nonlinear and involves several time-dependent coefficients that include the first-order derivative of the early exercise boundary. These coefficients are approximated from a fourth-order analytical approximation which is derived using a regularized square-root function. The semi-discrete equation for the option value and delta sensitivity is obtained from a non-uniform fourth-order compact finite difference scheme. Fifth-order 5(4) Dormand-Prince time integration method is used to solve the coupled system of discrete equations. Enhancing the performance of our proposed method with local mesh re",
    "link": "http://arxiv.org/abs/2309.03984",
    "context": "Title: Enhancing accuracy for solving American CEV model with high-order compact scheme and adaptive time stepping. (arXiv:2309.03984v1 [q-fin.CP])\nAbstract: In this research work, we propose a high-order time adapted scheme for pricing a coupled system of fixed-free boundary constant elasticity of variance (CEV) model on both equidistant and locally refined space-grid. The performance of our method is substantially enhanced to improve irregularities in the model which are both inherent and induced. Furthermore, the system of coupled PDEs is strongly nonlinear and involves several time-dependent coefficients that include the first-order derivative of the early exercise boundary. These coefficients are approximated from a fourth-order analytical approximation which is derived using a regularized square-root function. The semi-discrete equation for the option value and delta sensitivity is obtained from a non-uniform fourth-order compact finite difference scheme. Fifth-order 5(4) Dormand-Prince time integration method is used to solve the coupled system of discrete equations. Enhancing the performance of our proposed method with local mesh re",
    "path": "papers/23/09/2309.03984.json",
    "total_tokens": 854,
    "translated_title": "使用高阶紧致方案和自适应时间步长提高解决美国CEV模型的准确性",
    "translated_abstract": "在这项研究工作中，我们提出了一种高阶时间自适应方案，用于定价固定-自由边界恒定弹性变差(CEV)模型的耦合系统，包括等距和局部细化的空间网格。我们的方法大幅提高了模型中固有的和诱导的非规则性。此外，耦合的偏微分方程组是强非线性的，涉及几个时变系数，包括提前行权边界的一阶导数。这些系数是从一个四阶解析逼近中得到的，该逼近使用了一个正则化的平方根函数。期权价值和delta敏感性的半离散方程来自于非均匀四阶紧致有限差分方案。使用五阶5(4) Dormand-Prince时间积分方法来解决离散方程的耦合系统。通过局部网格加密来提高我们提出的方法的性能。",
    "tldr": "本研究提出了一种高阶时间自适应方案，用于定价CEV模型的耦合系统，并通过局部网格加密来提高方法的性能。",
    "en_tdlr": "This research proposes a high-order time-adapted scheme for pricing the coupled system of the CEV model and improves the method's performance through local mesh refinement."
}