{
    "title": "Efficient Multi-View Graph Clustering with Local and Global Structure Preservation. (arXiv:2309.00024v1 [cs.LG])",
    "abstract": "Anchor-based multi-view graph clustering (AMVGC) has received abundant attention owing to its high efficiency and the capability to capture complementary structural information across multiple views. Intuitively, a high-quality anchor graph plays an essential role in the success of AMVGC. However, the existing AMVGC methods only consider single-structure information, i.e., local or global structure, which provides insufficient information for the learning task. To be specific, the over-scattered global structure leads to learned anchors failing to depict the cluster partition well. In contrast, the local structure with an improper similarity measure results in potentially inaccurate anchor assignment, ultimately leading to sub-optimal clustering performance. To tackle the issue, we propose a novel anchor-based multi-view graph clustering framework termed Efficient Multi-View Graph Clustering with Local and Global Structure Preservation (EMVGC-LG). Specifically, a unified framework with",
    "link": "http://arxiv.org/abs/2309.00024",
    "context": "Title: Efficient Multi-View Graph Clustering with Local and Global Structure Preservation. (arXiv:2309.00024v1 [cs.LG])\nAbstract: Anchor-based multi-view graph clustering (AMVGC) has received abundant attention owing to its high efficiency and the capability to capture complementary structural information across multiple views. Intuitively, a high-quality anchor graph plays an essential role in the success of AMVGC. However, the existing AMVGC methods only consider single-structure information, i.e., local or global structure, which provides insufficient information for the learning task. To be specific, the over-scattered global structure leads to learned anchors failing to depict the cluster partition well. In contrast, the local structure with an improper similarity measure results in potentially inaccurate anchor assignment, ultimately leading to sub-optimal clustering performance. To tackle the issue, we propose a novel anchor-based multi-view graph clustering framework termed Efficient Multi-View Graph Clustering with Local and Global Structure Preservation (EMVGC-LG). Specifically, a unified framework with",
    "path": "papers/23/09/2309.00024.json",
    "total_tokens": 919,
    "translated_title": "保持局部和全局结构的高效多视图图聚类",
    "translated_abstract": "基于锚点的多视图图聚类（AMVGC）由于其高效性和捕捉多个视图之间互补结构信息的能力而受到广泛关注。直观地说，高质量的锚图在AMVGC的成功中起着关键作用。然而，现有的AMVGC方法只考虑单一的结构信息，即局部或全局结构，这为学习任务提供了不足的信息。具体而言，过于分散的全局结构导致学习到的锚点不能很好地描述聚类划分。相反，具有不恰当相似度度量的局部结构导致潜在的不准确的锚点分配，最终导致次优的聚类性能。为了解决这个问题，我们提出了一种新的基于锚点的多视图图聚类框架，称为保持局部和全局结构的高效多视图图聚类（EMVGC-LG）。具体而言，我们将优化的全局结构和局部结构相结合，通过统一的框架进行优化，同时考虑局部相似度和全局相似度，从而提高聚类性能。",
    "tldr": "提出了一种新的基于锚点的多视图图聚类方法，通过统一的框架将优化的全局结构和局部结构相结合，同时考虑局部相似度和全局相似度，以提高聚类性能。",
    "en_tdlr": "A novel anchor-based multi-view graph clustering method is proposed, which combines optimized global and local structures through a unified framework, considering both local and global similarity to improve clustering performance."
}