{
    "title": "Cold & Warm Net: Addressing Cold-Start Users in Recommender Systems. (arXiv:2309.15646v1 [cs.IR])",
    "abstract": "Cold-start recommendation is one of the major challenges faced by recommender systems (RS). Herein, we focus on the user cold-start problem. Recently, methods utilizing side information or meta-learning have been used to model cold-start users. However, it is difficult to deploy these methods to industrial RS. There has not been much research that pays attention to the user cold-start problem in the matching stage. In this paper, we propose Cold & Warm Net based on expert models who are responsible for modeling cold-start and warm-up users respectively. A gate network is applied to incorporate the results from two experts. Furthermore, dynamic knowledge distillation acting as a teacher selector is introduced to assist experts in better learning user representation. With comprehensive mutual information, features highly relevant to user behavior are selected for the bias net which explicitly models user behavior bias. Finally, we evaluate our Cold & Warm Net on public datasets in compar",
    "link": "http://arxiv.org/abs/2309.15646",
    "context": "Title: Cold & Warm Net: Addressing Cold-Start Users in Recommender Systems. (arXiv:2309.15646v1 [cs.IR])\nAbstract: Cold-start recommendation is one of the major challenges faced by recommender systems (RS). Herein, we focus on the user cold-start problem. Recently, methods utilizing side information or meta-learning have been used to model cold-start users. However, it is difficult to deploy these methods to industrial RS. There has not been much research that pays attention to the user cold-start problem in the matching stage. In this paper, we propose Cold & Warm Net based on expert models who are responsible for modeling cold-start and warm-up users respectively. A gate network is applied to incorporate the results from two experts. Furthermore, dynamic knowledge distillation acting as a teacher selector is introduced to assist experts in better learning user representation. With comprehensive mutual information, features highly relevant to user behavior are selected for the bias net which explicitly models user behavior bias. Finally, we evaluate our Cold & Warm Net on public datasets in compar",
    "path": "papers/23/09/2309.15646.json",
    "total_tokens": 957,
    "translated_title": "冷启动和热启动网络：解决推荐系统中的冷启动用户问题",
    "translated_abstract": "冷启动推荐是推荐系统面临的重大挑战之一。本文主要关注用户冷启动问题。最近，使用侧信息或元学习的方法被用来建模冷启动用户。然而，将这些方法应用于工业级推荐系统仍然存在困难。目前对于匹配阶段中的用户冷启动问题的研究还不多。本文提出了基于专家模型的冷启动和热启动用户建模方法：Cold & Warm Net。通过引入门控网络来结合两个专家的结果。此外，还引入了动态知识蒸馏作为一个教师选择器，帮助专家更好地学习用户表示。通过全面的互信息选择与用户行为高度相关的特征，用于显式建模用户行为偏差的偏差网络。最后，在公共数据集上对Cold & Warm Net进行评估。",
    "tldr": "本文提出了一种名为冷启动和热启动网络的方法(Cold & Warm Net)，用于解决推荐系统中的冷启动用户问题。该方法利用专家模型分别建模冷启动和热启动用户，并引入门控网络和动态知识蒸馏来提高用户表示的学习效果。通过选择与用户行为高度相关的特征，并建立偏差网络来显式建模用户行为偏差。实验证实了该方法的有效性。",
    "en_tdlr": "This paper proposes a method called Cold & Warm Net to address the cold-start user problem in recommender systems. The method utilizes expert models to model cold-start and warm-up users, and incorporates a gate network and dynamic knowledge distillation for better learning of user representation. It selects highly relevant features to explicitly model user behavior bias and has been validated to be effective."
}