{
    "title": "ChatCounselor: A Large Language Models for Mental Health Support. (arXiv:2309.15461v1 [cs.CL])",
    "abstract": "This paper presents ChatCounselor, a large language model (LLM) solution designed to provide mental health support. Unlike generic chatbots, ChatCounselor is distinguished by its foundation in real conversations between consulting clients and professional psychologists, enabling it to possess specialized knowledge and counseling skills in the field of psychology. The training dataset, Psych8k, was constructed from 260 in-depth interviews, each spanning an hour. To assess the quality of counseling responses, the counseling Bench was devised. Leveraging GPT-4 and meticulously crafted prompts based on seven metrics of psychological counseling assessment, the model underwent evaluation using a set of real-world counseling questions. Impressively, ChatCounselor surpasses existing open-source models in the counseling Bench and approaches the performance level of ChatGPT, showcasing the remarkable enhancement in model capability attained through high-quality domain-specific data.",
    "link": "http://arxiv.org/abs/2309.15461",
    "context": "Title: ChatCounselor: A Large Language Models for Mental Health Support. (arXiv:2309.15461v1 [cs.CL])\nAbstract: This paper presents ChatCounselor, a large language model (LLM) solution designed to provide mental health support. Unlike generic chatbots, ChatCounselor is distinguished by its foundation in real conversations between consulting clients and professional psychologists, enabling it to possess specialized knowledge and counseling skills in the field of psychology. The training dataset, Psych8k, was constructed from 260 in-depth interviews, each spanning an hour. To assess the quality of counseling responses, the counseling Bench was devised. Leveraging GPT-4 and meticulously crafted prompts based on seven metrics of psychological counseling assessment, the model underwent evaluation using a set of real-world counseling questions. Impressively, ChatCounselor surpasses existing open-source models in the counseling Bench and approaches the performance level of ChatGPT, showcasing the remarkable enhancement in model capability attained through high-quality domain-specific data.",
    "path": "papers/23/09/2309.15461.json",
    "total_tokens": 871,
    "translated_title": "ChatCounselor: 用于心理健康支持的大型语言模型",
    "translated_abstract": "本文介绍了ChatCounselor，这是一个设计用于提供心理健康支持的大型语言模型（LLM）解决方案。与通用的聊天机器人不同，ChatCounselor以实际的心理咨询客户与专业心理学家之间的对话为基础，使其具备心理学领域的专业知识和咨询技巧。训练数据集Psych8k是由260个深度访谈构建而成，每个访谈持续一个小时。为了评估咨询回复的质量，设计了咨询Benchmark。利用GPT-4和基于七个心理咨询评估指标的精心设计的提示，对该模型进行了一系列真实咨询问题的评估。令人印象深刻的是，ChatCounselor在咨询Benchmark上超越了现有的开源模型，并接近ChatGPT的性能水平，展示了通过高质量领域特定数据获得的模型能力的显著提升。",
    "tldr": "ChatCounselor是一个用于心理健康支持的大型语言模型，通过对真实对话进行训练和评估，超越了现有模型并接近ChatGPT的性能水平。",
    "en_tdlr": "ChatCounselor is a large language model (LLM) designed for mental health support. Trained and evaluated using real conversations, it surpasses existing models and approaches the performance level of ChatGPT."
}