{
    "title": "DoRA: Domain-Based Self-Supervised Learning Framework for Low-Resource Real Estate Appraisal. (arXiv:2309.00855v2 [cs.LG] UPDATED)",
    "abstract": "The marketplace system connecting demands and supplies has been explored to develop unbiased decision-making in valuing properties. Real estate appraisal serves as one of the high-cost property valuation tasks for financial institutions since it requires domain experts to appraise the estimation based on the corresponding knowledge and the judgment of the market. Existing automated valuation models reducing the subjectivity of domain experts require a large number of transactions for effective evaluation, which is predominantly limited to not only the labeling efforts of transactions but also the generalizability of new developing and rural areas. To learn representations from unlabeled real estate sets, existing self-supervised learning (SSL) for tabular data neglects various important features, and fails to incorporate domain knowledge. In this paper, we propose DoRA, a Domain-based self-supervised learning framework for low-resource Real estate Appraisal. DoRA is pre-trained with an",
    "link": "http://arxiv.org/abs/2309.00855",
    "context": "Title: DoRA: Domain-Based Self-Supervised Learning Framework for Low-Resource Real Estate Appraisal. (arXiv:2309.00855v2 [cs.LG] UPDATED)\nAbstract: The marketplace system connecting demands and supplies has been explored to develop unbiased decision-making in valuing properties. Real estate appraisal serves as one of the high-cost property valuation tasks for financial institutions since it requires domain experts to appraise the estimation based on the corresponding knowledge and the judgment of the market. Existing automated valuation models reducing the subjectivity of domain experts require a large number of transactions for effective evaluation, which is predominantly limited to not only the labeling efforts of transactions but also the generalizability of new developing and rural areas. To learn representations from unlabeled real estate sets, existing self-supervised learning (SSL) for tabular data neglects various important features, and fails to incorporate domain knowledge. In this paper, we propose DoRA, a Domain-based self-supervised learning framework for low-resource Real estate Appraisal. DoRA is pre-trained with an",
    "path": "papers/23/09/2309.00855.json",
    "total_tokens": 855,
    "translated_title": "DoRA: 基于领域的低资源房地产评估自监督学习框架",
    "translated_abstract": "连接需求和供应的市场系统已被探索用于开发对房地产进行公正的决策。房地产评估是金融机构中一项高成本的资产估值任务，因为它需要领域专家基于相应的知识和市场的判断来评估估价。现有的自动化估值模型减少了领域专家的主观性，但需要大量的交易用于有效评估，这主要受限于交易的标记工作以及对新开发和农村地区的泛化能力。现有的自监督学习（SSL）用于表格数据学习未标记的房地产集合时，忽视了各种重要特征，并且无法融入领域知识。本文提出了DoRA，一种基于领域的低资源房地产评估自监督学习框架。",
    "tldr": "DoRA是一种基于领域的低资源房地产评估自监督学习框架，通过学习未标记的房地产数据集合来减少主观性，并且融入领域知识。",
    "en_tdlr": "DoRA is a domain-based self-supervised learning framework for low-resource real estate appraisal. It reduces subjectivity by learning from unlabeled real estate datasets and incorporates domain knowledge."
}