{
    "title": "Double machine learning and design in batch adaptive experiments. (arXiv:2309.15297v1 [stat.ME])",
    "abstract": "We consider an experiment with at least two stages or batches and $O(N)$ subjects per batch. First, we propose a semiparametric treatment effect estimator that efficiently pools information across the batches, and show it asymptotically dominates alternatives that aggregate single batch estimates. Then, we consider the design problem of learning propensity scores for assigning treatment in the later batches of the experiment to maximize the asymptotic precision of this estimator. For two common causal estimands, we estimate this precision using observations from previous batches, and then solve a finite-dimensional concave maximization problem to adaptively learn flexible propensity scores that converge to suitably defined optima in each batch at rate $O_p(N^{-1/4})$. By extending the framework of double machine learning, we show this rate suffices for our pooled estimator to attain the targeted precision after each batch, as long as nuisance function estimates converge at rate $o_p(N^",
    "link": "http://arxiv.org/abs/2309.15297",
    "context": "Title: Double machine learning and design in batch adaptive experiments. (arXiv:2309.15297v1 [stat.ME])\nAbstract: We consider an experiment with at least two stages or batches and $O(N)$ subjects per batch. First, we propose a semiparametric treatment effect estimator that efficiently pools information across the batches, and show it asymptotically dominates alternatives that aggregate single batch estimates. Then, we consider the design problem of learning propensity scores for assigning treatment in the later batches of the experiment to maximize the asymptotic precision of this estimator. For two common causal estimands, we estimate this precision using observations from previous batches, and then solve a finite-dimensional concave maximization problem to adaptively learn flexible propensity scores that converge to suitably defined optima in each batch at rate $O_p(N^{-1/4})$. By extending the framework of double machine learning, we show this rate suffices for our pooled estimator to attain the targeted precision after each batch, as long as nuisance function estimates converge at rate $o_p(N^",
    "path": "papers/23/09/2309.15297.json",
    "total_tokens": 964,
    "translated_title": "双机器学习和批自适应实验设计",
    "translated_abstract": "我们考虑了一个至少有两个阶段或批次，每个批次有$O(N)$个受试对象的实验。首先，我们提出了一种半参数治疗效应估计器，能够在批次间高效地汇总信息，并且在渐近情况下优于汇总单个批次估计的替代方法。然后，我们考虑了设计问题，即学习在实验后期批次中为了最大化该估计器的渐近精度而分配治疗的倾向得分。对于两个常见的因果估计量，我们使用之前批次的观测来估计这个精度，然后解决一个有限维的凹最大化问题，以自适应地学习灵活的倾向得分，在每个批次中以$O_p(N^{-1/4})$的速率收敛到适当定义的极值点。通过扩展双机器学习框架，我们证明了只要干扰函数的估计以$o_p(N^",
    "tldr": "本文提出了一种双机器学习和批自适应实验设计方法。通过汇总批次间的信息，我们提出了一个半参数治疗效应估计器，优于汇总单个批次估计的方法。我们还解决了在实验后期批次中学习倾向得分的设计问题，并证明了该方法能够以一定的收敛速率达到目标精度。",
    "en_tdlr": "This paper presents a double machine learning and batch adaptive experiment design method. By pooling information across batches, we propose a semi-parametric treatment effect estimator that outperforms alternative methods aggregating single batch estimates. We also address the design problem of learning propensity scores in the later batches and show that the method can achieve the desired precision at a certain convergence rate."
}