{
    "title": "Deep learning probability flows and entropy production rates in active matter. (arXiv:2309.12991v1 [cond-mat.stat-mech])",
    "abstract": "Active matter systems, from self-propelled colloids to motile bacteria, are characterized by the conversion of free energy into useful work at the microscopic scale. These systems generically involve physics beyond the reach of equilibrium statistical mechanics, and a persistent challenge has been to understand the nature of their nonequilibrium states. The entropy production rate and the magnitude of the steady-state probability current provide quantitative ways to do so by measuring the breakdown of time-reversal symmetry and the strength of nonequilibrium transport of measure. Yet, their efficient computation has remained elusive, as they depend on the system's unknown and high-dimensional probability density. Here, building upon recent advances in generative modeling, we develop a deep learning framework that estimates the score of this density. We show that the score, together with the microscopic equations of motion, gives direct access to the entropy production rate, the probabi",
    "link": "http://arxiv.org/abs/2309.12991",
    "context": "Title: Deep learning probability flows and entropy production rates in active matter. (arXiv:2309.12991v1 [cond-mat.stat-mech])\nAbstract: Active matter systems, from self-propelled colloids to motile bacteria, are characterized by the conversion of free energy into useful work at the microscopic scale. These systems generically involve physics beyond the reach of equilibrium statistical mechanics, and a persistent challenge has been to understand the nature of their nonequilibrium states. The entropy production rate and the magnitude of the steady-state probability current provide quantitative ways to do so by measuring the breakdown of time-reversal symmetry and the strength of nonequilibrium transport of measure. Yet, their efficient computation has remained elusive, as they depend on the system's unknown and high-dimensional probability density. Here, building upon recent advances in generative modeling, we develop a deep learning framework that estimates the score of this density. We show that the score, together with the microscopic equations of motion, gives direct access to the entropy production rate, the probabi",
    "path": "papers/23/09/2309.12991.json",
    "total_tokens": 865,
    "translated_title": "深度学习在活性物质中的概率流和熵产生速率研究",
    "translated_abstract": "主动物质系统，从自驱胶体到运动的细菌，其特点是将自由能转化为微观尺度的有效工作。这些系统通常涉及到超出平衡统计力学范畴的物理学，理解它们的非平衡态质性一直是一个挑战。熵产生速率和稳态概率流的大小提供了量化的方式，通过测量时间反演对称性的破缺和非平衡输运强度来理解它们。然而，它们的高效计算一直受到限制，因为它们依赖于系统的未知和高维概率密度。基于最近的生成模型进展，我们在这里开发了一个深度学习框架来估计这种密度的分数。我们展示了这种分数以及微观运动方程可以直接获取熵产生速率，其概率流大小等信息。",
    "tldr": "本论文通过深度学习方法，结合生成模型，提出了一个估计活性物质系统熵产生速率和概率流大小的框架，解决了传统计算方法中高维概率密度的问题，并给出了直接计算这些物理量的方法。",
    "en_tdlr": "This paper presents a deep learning framework that estimates the entropy production rate and probability current in active matter systems, addressing the challenge of computing these quantities in high-dimensional probability densities."
}