{
    "title": "ecoBLE: A Low-Computation Energy Consumption Prediction Framework for Bluetooth Low Energy. (arXiv:2309.16686v1 [cs.NI])",
    "abstract": "Bluetooth Low Energy (BLE) is a de-facto technology for Internet of Things (IoT) applications, promising very low energy consumption. However, this low energy consumption accounts only for the radio part, and it overlooks the energy consumption of other hardware and software components. Monitoring and predicting the energy consumption of IoT nodes after deployment can substantially aid in ensuring low energy consumption, calculating the remaining battery lifetime, predicting needed energy for energy-harvesting nodes, and detecting anomalies. In this paper, we introduce a Long Short-Term Memory Projection (LSTMP)-based BLE energy consumption prediction framework together with a dataset for a healthcare application scenario where BLE is widely adopted. Unlike radio-focused theoretical energy models, our framework provides a comprehensive energy consumption prediction, considering all components of the IoT node, including the radio, sensor as well as microcontroller unit (MCU). Our measur",
    "link": "http://arxiv.org/abs/2309.16686",
    "context": "Title: ecoBLE: A Low-Computation Energy Consumption Prediction Framework for Bluetooth Low Energy. (arXiv:2309.16686v1 [cs.NI])\nAbstract: Bluetooth Low Energy (BLE) is a de-facto technology for Internet of Things (IoT) applications, promising very low energy consumption. However, this low energy consumption accounts only for the radio part, and it overlooks the energy consumption of other hardware and software components. Monitoring and predicting the energy consumption of IoT nodes after deployment can substantially aid in ensuring low energy consumption, calculating the remaining battery lifetime, predicting needed energy for energy-harvesting nodes, and detecting anomalies. In this paper, we introduce a Long Short-Term Memory Projection (LSTMP)-based BLE energy consumption prediction framework together with a dataset for a healthcare application scenario where BLE is widely adopted. Unlike radio-focused theoretical energy models, our framework provides a comprehensive energy consumption prediction, considering all components of the IoT node, including the radio, sensor as well as microcontroller unit (MCU). Our measur",
    "path": "papers/23/09/2309.16686.json",
    "total_tokens": 878,
    "translated_title": "ecoBLE: 一种低计算能量消耗预测框架的蓝牙低功耗技术",
    "translated_abstract": "蓝牙低功耗 (BLE) 是物联网 (IoT) 应用中的一种事实标准技术，承诺极低的能量消耗。然而，这种低能量消耗只考虑了无线电部分，忽略了其他硬件和软件组件的能量消耗。监测和预测部署后的物联网节点的能量消耗可以大大帮助确保低能量消耗，计算剩余电池寿命，预测能量收集节点所需的能源，并检测异常情况。本文介绍了一种基于LSTMP的BLE能量消耗预测框架，以及在广泛采用BLE的医疗应用场景中使用的数据集。与以无线电为焦点的理论能量模型不同，我们的框架提供了全面的能量消耗预测，考虑了物联网节点的所有组件，包括无线电、传感器和微控制器单元(MCU)。",
    "tldr": "ecoBLE是一种基于LSTMP的蓝牙低功耗能量消耗预测框架，考虑了物联网节点的所有组件，并提供了一个用于医疗应用的数据集。",
    "en_tdlr": "ecoBLE is an LSTMP-based framework for predicting Bluetooth Low Energy (BLE) energy consumption, which considers all components of IoT nodes, and provides a dataset for healthcare applications."
}