{
    "title": "Doubly Robust Mean-CVaR Portfolio. (arXiv:2309.11693v1 [q-fin.PM])",
    "abstract": "In this study, we address the challenge of portfolio optimization, a critical aspect of managing investment risks and maximizing returns. The mean-CVaR portfolio is considered a promising method due to today's unstable financial market crises like the COVID-19 pandemic. It incorporates expected returns into the CVaR, which considers the expected value of losses exceeding a specified probability level. However, the instability associated with the input parameter changes and estimation errors can deteriorate portfolio performance. Therefore in this study, we propose a Doubly Robust mean-CVaR Portfolio refined approach to the mean-CVaR portfolio optimization. Our method can solve the instability problem to simultaneously optimize the multiple levels of CVaRs and define uncertainty sets for the mean parameter to perform robust optimization. Theoretically, the proposed method can be formulated as a second-order cone programming problem which is the same formulation as traditional mean-varia",
    "link": "http://arxiv.org/abs/2309.11693",
    "context": "Title: Doubly Robust Mean-CVaR Portfolio. (arXiv:2309.11693v1 [q-fin.PM])\nAbstract: In this study, we address the challenge of portfolio optimization, a critical aspect of managing investment risks and maximizing returns. The mean-CVaR portfolio is considered a promising method due to today's unstable financial market crises like the COVID-19 pandemic. It incorporates expected returns into the CVaR, which considers the expected value of losses exceeding a specified probability level. However, the instability associated with the input parameter changes and estimation errors can deteriorate portfolio performance. Therefore in this study, we propose a Doubly Robust mean-CVaR Portfolio refined approach to the mean-CVaR portfolio optimization. Our method can solve the instability problem to simultaneously optimize the multiple levels of CVaRs and define uncertainty sets for the mean parameter to perform robust optimization. Theoretically, the proposed method can be formulated as a second-order cone programming problem which is the same formulation as traditional mean-varia",
    "path": "papers/23/09/2309.11693.json",
    "total_tokens": 912,
    "translated_title": "双重稳健均值-CVaR组合投资组合",
    "translated_abstract": "在本研究中，我们解决了投资组合优化的挑战，这是管理投资风险和最大化回报的关键方面。由于像COVID-19大流行这样当今不稳定的金融市场危机，均值-CVaR投资组合被认为是一种有前景的方法。它将预期收益纳入CVaR中，CVaR考虑的是超过特定概率水平的损失的期望值。然而，与输入参数变化和估计误差相关的不稳定性可能会损害投资组合的表现。因此，在本研究中，我们提出了一种改进的双重稳健均值-CVaR投资组合方法来优化均值-CVaR投资组合。我们的方法可以解决不稳定性问题，同时优化多个CVaR水平，并为均值参数定义不确定性集合以进行稳健优化。从理论上讲，所提出的方法可以被形式化为一个二阶锥规划问题，这与传统的均值-方差组合优化具有相同的形式化。",
    "tldr": "本研究提出了一种双重稳健均值-CVaR投资组合方法，以解决投资组合优化中的不稳定性问题，并实现多个CVaR水平的同时优化，并为均值参数定义了不确定性集合，从而进行稳健优化。",
    "en_tdlr": "This study proposes a doubly robust mean-CVaR portfolio method to address the instability issue in portfolio optimization, allowing for simultaneous optimization of multiple CVaR levels and defining uncertainty sets for mean parameter robust optimization."
}