{
    "title": "NeuroCodeBench: a plain C neural network benchmark for software verification. (arXiv:2309.03617v1 [cs.SE])",
    "abstract": "Safety-critical systems with neural network components require strong guarantees. While existing neural network verification techniques have shown great progress towards this goal, they cannot prove the absence of software faults in the network implementation. This paper presents NeuroCodeBench - a verification benchmark for neural network code written in plain C. It contains 32 neural networks with 607 safety properties divided into 6 categories: maths library, activation functions, error-correcting networks, transfer function approximation, probability density estimation and reinforcement learning. Our preliminary evaluation shows that state-of-the-art software verifiers struggle to provide correct verdicts, due to their incomplete support of the standard C mathematical library and the complexity of larger neural networks.",
    "link": "http://arxiv.org/abs/2309.03617",
    "context": "Title: NeuroCodeBench: a plain C neural network benchmark for software verification. (arXiv:2309.03617v1 [cs.SE])\nAbstract: Safety-critical systems with neural network components require strong guarantees. While existing neural network verification techniques have shown great progress towards this goal, they cannot prove the absence of software faults in the network implementation. This paper presents NeuroCodeBench - a verification benchmark for neural network code written in plain C. It contains 32 neural networks with 607 safety properties divided into 6 categories: maths library, activation functions, error-correcting networks, transfer function approximation, probability density estimation and reinforcement learning. Our preliminary evaluation shows that state-of-the-art software verifiers struggle to provide correct verdicts, due to their incomplete support of the standard C mathematical library and the complexity of larger neural networks.",
    "path": "papers/23/09/2309.03617.json",
    "total_tokens": 834,
    "translated_title": "NeuroCodeBench：用于软件验证的纯 C 神经网络基准测试",
    "translated_abstract": "具有神经网络组件的安全关键系统需要强有力的保证。虽然现有的神经网络验证技术在这个目标上取得了很大的进展，但它们无法证明网络实现中不存在软件错误。本文介绍了 NeuroCodeBench - 一个用纯 C 编写的神经网络代码验证基准测试。它包含了32个神经网络，共有607个安全属性，分为6个类别：数学库、激活函数、纠错网络、传输函数逼近、概率密度估计和强化学习。我们的初步评估显示，最先进的软件验证器在提供正确的判断时遇到了困难，这是由于它们对标准 C 数学库的不完全支持和更复杂的大型神经网络的复杂性所导致的。",
    "tldr": "NeuroCodeBench是一个用纯C编写的神经网络代码验证基准测试，共包含32个神经网络和607个安全属性。研究发现，由于不完全支持标准C数学库和复杂的大型神经网络的复杂性，目前最先进的软件验证器难以提供正确的判断。",
    "en_tdlr": "NeuroCodeBench is a verification benchmark for neural network code written in plain C, consisting of 32 neural networks with 607 safety properties. The research finds that state-of-the-art software verifiers struggle to provide correct verdicts due to their incomplete support of the standard C mathematical library and the complexity of larger neural networks."
}