{
    "title": "A Stochastic Online Forecast-and-Optimize Framework for Real-Time Energy Dispatch in Virtual Power Plants under Uncertainty. (arXiv:2309.08642v1 [eess.SY])",
    "abstract": "Aggregating distributed energy resources in power systems significantly increases uncertainties, in particular caused by the fluctuation of renewable energy generation. This issue has driven the necessity of widely exploiting advanced predictive control techniques under uncertainty to ensure long-term economics and decarbonization. In this paper, we propose a real-time uncertainty-aware energy dispatch framework, which is composed of two key elements: (i) A hybrid forecast-and-optimize sequential task, integrating deep learning-based forecasting and stochastic optimization, where these two stages are connected by the uncertainty estimation at multiple temporal resolutions; (ii) An efficient online data augmentation scheme, jointly involving model pre-training and online fine-tuning stages. In this way, the proposed framework is capable to rapidly adapt to the real-time data distribution, as well as to target on uncertainties caused by data drift, model discrepancy and environment pertu",
    "link": "http://arxiv.org/abs/2309.08642",
    "context": "Title: A Stochastic Online Forecast-and-Optimize Framework for Real-Time Energy Dispatch in Virtual Power Plants under Uncertainty. (arXiv:2309.08642v1 [eess.SY])\nAbstract: Aggregating distributed energy resources in power systems significantly increases uncertainties, in particular caused by the fluctuation of renewable energy generation. This issue has driven the necessity of widely exploiting advanced predictive control techniques under uncertainty to ensure long-term economics and decarbonization. In this paper, we propose a real-time uncertainty-aware energy dispatch framework, which is composed of two key elements: (i) A hybrid forecast-and-optimize sequential task, integrating deep learning-based forecasting and stochastic optimization, where these two stages are connected by the uncertainty estimation at multiple temporal resolutions; (ii) An efficient online data augmentation scheme, jointly involving model pre-training and online fine-tuning stages. In this way, the proposed framework is capable to rapidly adapt to the real-time data distribution, as well as to target on uncertainties caused by data drift, model discrepancy and environment pertu",
    "path": "papers/23/09/2309.08642.json",
    "total_tokens": 912,
    "translated_title": "一种适用于虚拟电力厂中存在不确定性的实时能源调度的随机在线预测与优化框架",
    "translated_abstract": "在电力系统中聚合分布式能源资源显著增加了不确定性，特别是由可再生能源产生的波动所引起的不确定性。这个问题驱使了在不确定性下广泛利用先进的预测控制技术，以确保长期经济和减碳。本文提出了一个实时的不确定性感知的能源调度框架，该框架由两个关键要素组成：(i) 一个混合的预测和优化顺序任务，将基于深度学习的预测和随机优化进行整合，这两个阶段通过多个时间分辨率的不确定性估计进行连接；(ii) 一种高效的在线数据增强方案，同时涉及模型预训练和在线微调阶段。通过这种方式，所提出的框架能够迅速适应实时数据分布，并针对数据漂移、模型差异和环境扰动引起的不确定性进行处理。",
    "tldr": "本论文提出了一个适应不确定性的实时能源调度框架，该框架通过整合深度学习预测和随机优化，并通过在线数据增强和模型微调来解决数据波动、模型差异和环境扰动等不确定性问题。"
}