{
    "title": "Crypto'Graph: Leveraging Privacy-Preserving Distributed Link Prediction for Robust Graph Learning. (arXiv:2309.10890v1 [cs.CR])",
    "abstract": "Graphs are a widely used data structure for collecting and analyzing relational data. However, when the graph structure is distributed across several parties, its analysis is particularly challenging. In particular, due to the sensitivity of the data each party might want to keep their partial knowledge of the graph private, while still willing to collaborate with the other parties for tasks of mutual benefit, such as data curation or the removal of poisoned data. To address this challenge, we propose Crypto'Graph, an efficient protocol for privacy-preserving link prediction on distributed graphs. More precisely, it allows parties partially sharing a graph with distributed links to infer the likelihood of formation of new links in the future. Through the use of cryptographic primitives, Crypto'Graph is able to compute the likelihood of these new links on the joint network without revealing the structure of the private individual graph of each party, even though they know the number of ",
    "link": "http://arxiv.org/abs/2309.10890",
    "context": "Title: Crypto'Graph: Leveraging Privacy-Preserving Distributed Link Prediction for Robust Graph Learning. (arXiv:2309.10890v1 [cs.CR])\nAbstract: Graphs are a widely used data structure for collecting and analyzing relational data. However, when the graph structure is distributed across several parties, its analysis is particularly challenging. In particular, due to the sensitivity of the data each party might want to keep their partial knowledge of the graph private, while still willing to collaborate with the other parties for tasks of mutual benefit, such as data curation or the removal of poisoned data. To address this challenge, we propose Crypto'Graph, an efficient protocol for privacy-preserving link prediction on distributed graphs. More precisely, it allows parties partially sharing a graph with distributed links to infer the likelihood of formation of new links in the future. Through the use of cryptographic primitives, Crypto'Graph is able to compute the likelihood of these new links on the joint network without revealing the structure of the private individual graph of each party, even though they know the number of ",
    "path": "papers/23/09/2309.10890.json",
    "total_tokens": 874,
    "translated_title": "Crypto'Graph：利用隐私保护的分布式链路预测实现强大的图形学习",
    "translated_abstract": "图形是一种广泛使用的数据结构，用于收集和分析关系数据。然而，当图形结构分布在多个参与方之间时，其分析尤为具有挑战性。特别是由于数据的敏感性，每个参与方可能希望保持其对图形的部分知识私有，同时仍愿意与其他参与方合作进行相互利益的任务，如数据整理或毒数据删除。为了解决这一挑战，我们提出了Crypto'Graph，这是一种用于隐私保护的分布式图形链路预测的高效协议。更具体地说，它允许部分共享具有分布式链路的图形的参与方推断未来新链路的形成可能性。通过使用加密原语，Crypto'Graph能够在不透露每个参与方的私有个人图形结构的情况下，在联合网络上计算这些新链路的可能性，即使他们知道参与方的数量。",
    "tldr": "Crypto'Graph是一种用于隐私保护的分布式图形链路预测协议，在不透露各方私有图形结构的情况下，允许参与方推断未来新链路的形成可能性。",
    "en_tdlr": "Crypto'Graph is an efficient protocol for privacy-preserving distributed link prediction, allowing parties to infer the likelihood of formation of new links in the future without revealing the structure of their private individual graphs."
}