{
    "title": "Navigating the Design Space of Equivariant Diffusion-Based Generative Models for De Novo 3D Molecule Generation. (arXiv:2309.17296v1 [cs.LG])",
    "abstract": "Deep generative diffusion models are a promising avenue for de novo 3D molecular design in material science and drug discovery. However, their utility is still constrained by suboptimal performance with large molecular structures and limited training data. Addressing this gap, we explore the design space of E(3) equivariant diffusion models, focusing on previously blank spots. Our extensive comparative analysis evaluates the interplay between continuous and discrete state spaces. Out of this investigation, we introduce the EQGAT-diff model, which consistently surpasses the performance of established models on the QM9 and GEOM-Drugs datasets by a large margin. Distinctively, EQGAT-diff takes continuous atomic positions while chemical elements and bond types are categorical and employ a time-dependent loss weighting that significantly increases training convergence and the quality of generated samples. To further strengthen the applicability of diffusion models to limited training data, ",
    "link": "http://arxiv.org/abs/2309.17296",
    "context": "Title: Navigating the Design Space of Equivariant Diffusion-Based Generative Models for De Novo 3D Molecule Generation. (arXiv:2309.17296v1 [cs.LG])\nAbstract: Deep generative diffusion models are a promising avenue for de novo 3D molecular design in material science and drug discovery. However, their utility is still constrained by suboptimal performance with large molecular structures and limited training data. Addressing this gap, we explore the design space of E(3) equivariant diffusion models, focusing on previously blank spots. Our extensive comparative analysis evaluates the interplay between continuous and discrete state spaces. Out of this investigation, we introduce the EQGAT-diff model, which consistently surpasses the performance of established models on the QM9 and GEOM-Drugs datasets by a large margin. Distinctively, EQGAT-diff takes continuous atomic positions while chemical elements and bond types are categorical and employ a time-dependent loss weighting that significantly increases training convergence and the quality of generated samples. To further strengthen the applicability of diffusion models to limited training data, ",
    "path": "papers/23/09/2309.17296.json",
    "total_tokens": 936,
    "translated_title": "导航等变扩散基生成模型的设计空间，用于从头生成3D分子",
    "translated_abstract": "深度生成扩散模型是材料科学和药物发现中从头设计3D分子的一种有前途的途径。然而，它们在大分子结构和有限的训练数据方面的性能仍受到限制。为了解决这个问题，我们探索了E(3)等变扩散模型的设计空间，重点关注以前的空白点。我们进行了广泛的比较分析，评估了连续和离散状态空间之间的相互作用。在这个调查中，我们引入了EQGAT-diff模型，其在QM9和GEOM-Drugs数据集上的性能始终大大超过已建立模型。与其他模型不同的是，EQGAT-diff采用连续的原子位置，而化学元素和键类型是分类的，并采用时间相关的损失加权，这显著提高了训练收敛和生成样本的质量。为进一步增强扩散模型对有限训练数据的适用性，",
    "tldr": "本论文探索了E(3)等变扩散模型的设计空间，提出了EQGAT-diff模型，通过在连续的原子位置和分类的化学元素与键类型之间的交互中改进，其在从头设计3D分子方面的性能显著超过已有模型。"
}