{
    "title": "GDM: Dual Mixup for Graph Classification with Limited Supervision. (arXiv:2309.10134v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) require a large number of labeled graph samples to obtain good performance on the graph classification task. The performance of GNNs degrades significantly as the number of labeled graph samples decreases. To reduce the annotation cost, it is therefore important to develop graph augmentation methods that can generate new graph instances to increase the size and diversity of the limited set of available labeled graph samples. In this work, we propose a novel mixup-based graph augmentation method, Graph Dual Mixup (GDM), that leverages both functional and structural information of the graph instances to generate new labeled graph samples. GDM employs a graph structural auto-encoder to learn structural embeddings of the graph samples, and then applies mixup to the structural information of the graphs in the learned structural embedding space and generates new graph structures from the mixup structural embeddings. As for the functional information, GDM applies ",
    "link": "http://arxiv.org/abs/2309.10134",
    "context": "Title: GDM: Dual Mixup for Graph Classification with Limited Supervision. (arXiv:2309.10134v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) require a large number of labeled graph samples to obtain good performance on the graph classification task. The performance of GNNs degrades significantly as the number of labeled graph samples decreases. To reduce the annotation cost, it is therefore important to develop graph augmentation methods that can generate new graph instances to increase the size and diversity of the limited set of available labeled graph samples. In this work, we propose a novel mixup-based graph augmentation method, Graph Dual Mixup (GDM), that leverages both functional and structural information of the graph instances to generate new labeled graph samples. GDM employs a graph structural auto-encoder to learn structural embeddings of the graph samples, and then applies mixup to the structural information of the graphs in the learned structural embedding space and generates new graph structures from the mixup structural embeddings. As for the functional information, GDM applies ",
    "path": "papers/23/09/2309.10134.json",
    "total_tokens": 771,
    "translated_title": "GDM: 双重Mixup用于有限标注的图分类",
    "translated_abstract": "图神经网络(GNNs)对于图分类任务需要大量的标记图样本以获得良好的性能。随着标记图样本数量的减少，GNNs的性能显著下降。为了降低标注成本，开发能够生成新的图实例以增加可用标记图样本数量和多样性的图增强方法非常重要。在这项工作中，我们提出了一种新颖的基于mixup的图增强方法，称为Graph Dual Mixup (GDM)，它利用图实例的功能和结构信息来生成新的标记图样本。GDM使用图结构自动编码器来学习图样本的结构嵌入，然后在学到的结构嵌入空间中应用mixup到图的结构信息，并从mixup结构嵌入中生成新的图结构。至于功能信息，GDM应用...",
    "tldr": "GDM是一种双重的mixup方法，利用图实例的功能和结构信息生成新的标记图样本。"
}