{
    "title": "QAL-BP: An Augmented Lagrangian Quantum Approach for Bin Packing Problem. (arXiv:2309.12678v1 [quant-ph])",
    "abstract": "The bin packing is a well-known NP-Hard problem in the domain of artificial intelligence, posing significant challenges in finding efficient solutions. Conversely, recent advancements in quantum technologies have shown promising potential for achieving substantial computational speedup, particularly in certain problem classes, such as combinatorial optimization. In this study, we introduce QAL-BP, a novel Quadratic Unconstrained Binary Optimization (QUBO) formulation designed specifically for bin packing and suitable for quantum computation. QAL-BP utilizes the augmented Lagrangian method to incorporate the bin packing constraints into the objective function while also facilitating an analytical estimation of heuristic, but empirically robust, penalty multipliers. This approach leads to a more versatile and generalizable model that eliminates the need for empirically calculating instance-dependent Lagrangian coefficients, a requirement commonly encountered in alternative QUBO formulati",
    "link": "http://arxiv.org/abs/2309.12678",
    "context": "Title: QAL-BP: An Augmented Lagrangian Quantum Approach for Bin Packing Problem. (arXiv:2309.12678v1 [quant-ph])\nAbstract: The bin packing is a well-known NP-Hard problem in the domain of artificial intelligence, posing significant challenges in finding efficient solutions. Conversely, recent advancements in quantum technologies have shown promising potential for achieving substantial computational speedup, particularly in certain problem classes, such as combinatorial optimization. In this study, we introduce QAL-BP, a novel Quadratic Unconstrained Binary Optimization (QUBO) formulation designed specifically for bin packing and suitable for quantum computation. QAL-BP utilizes the augmented Lagrangian method to incorporate the bin packing constraints into the objective function while also facilitating an analytical estimation of heuristic, but empirically robust, penalty multipliers. This approach leads to a more versatile and generalizable model that eliminates the need for empirically calculating instance-dependent Lagrangian coefficients, a requirement commonly encountered in alternative QUBO formulati",
    "path": "papers/23/09/2309.12678.json",
    "total_tokens": 863,
    "translated_title": "QAL-BP:一种用于装箱问题的增广拉格朗日量子方法",
    "translated_abstract": "装箱问题是人工智能领域中众所周知的NP-Hard问题，寻找高效解决方案面临重大挑战。相反，量子技术的最新进展显示出在某些问题类别（如组合优化）中实现大幅计算加速的潜力。在本研究中，我们介绍了QAL-BP，一种专门针对装箱问题设计的新型二次无约束二进制优化（QUBO）公式，适用于量子计算。QAL-BP采用增广拉格朗日方法将装箱约束嵌入到目标函数中，并便于对启发式乘数进行分析估计，使得模型更加灵活和可推广，消除了在其他QUBO公式中常遇到的需要根据实例计算Lagrangian系数的需求。",
    "tldr": "QAL-BP是一种增广拉格朗日量子方法，专门用于解决装箱问题。它利用增广拉格朗日方法将装箱约束加入目标函数，并通过分析估计启发式乘数，消除了需要根据实例计算Lagrangian系数的需求。",
    "en_tdlr": "QAL-BP is an augmented Lagrangian quantum approach specifically designed for solving the bin packing problem. It incorporates the bin packing constraints into the objective function using the augmented Lagrangian method and estimates heuristic multipliers for improved flexibility and generalizability, eliminating the need for calculating instance-dependent Lagrangian coefficients commonly required in alternative QUBO formulations."
}