{
    "title": "Enhancing Prediction and Analysis of UK Road Traffic Accident Severity Using AI: Integration of Machine Learning, Econometric Techniques, and Time Series Forecasting in Public Health Research. (arXiv:2309.13483v1 [stat.ML])",
    "abstract": "This research investigates road traffic accident severity in the UK, using a combination of machine learning, econometric, and statistical methods on historical data. We employed various techniques, including correlation analysis, regression models, GMM for error term issues, and time-series forecasting with VAR and ARIMA models. Our approach outperforms naive forecasting with an MASE of 0.800 and ME of -73.80. We also built a random forest classifier with 73% precision, 78% recall, and a 73% F1-score. Optimizing with H2O AutoML led to an XGBoost model with an RMSE of 0.176 and MAE of 0.087. Factor Analysis identified key variables, and we used SHAP for Explainable AI, highlighting influential factors like Driver_Home_Area_Type and Road_Type. Our study enhances understanding of accident severity and offers insights for evidence-based road safety policies.",
    "link": "http://arxiv.org/abs/2309.13483",
    "context": "Title: Enhancing Prediction and Analysis of UK Road Traffic Accident Severity Using AI: Integration of Machine Learning, Econometric Techniques, and Time Series Forecasting in Public Health Research. (arXiv:2309.13483v1 [stat.ML])\nAbstract: This research investigates road traffic accident severity in the UK, using a combination of machine learning, econometric, and statistical methods on historical data. We employed various techniques, including correlation analysis, regression models, GMM for error term issues, and time-series forecasting with VAR and ARIMA models. Our approach outperforms naive forecasting with an MASE of 0.800 and ME of -73.80. We also built a random forest classifier with 73% precision, 78% recall, and a 73% F1-score. Optimizing with H2O AutoML led to an XGBoost model with an RMSE of 0.176 and MAE of 0.087. Factor Analysis identified key variables, and we used SHAP for Explainable AI, highlighting influential factors like Driver_Home_Area_Type and Road_Type. Our study enhances understanding of accident severity and offers insights for evidence-based road safety policies.",
    "path": "papers/23/09/2309.13483.json",
    "total_tokens": 980,
    "translated_title": "使用人工智能增强对英国道路交通事故严重程度的预测与分析：结合机器学习、计量经济学技术和时间序列预测的公共卫生研究",
    "translated_abstract": "本研究利用历史数据，使用机器学习、计量经济学和统计方法对英国道路交通事故的严重程度进行了调查。我们采用了相关性分析、回归模型、GMM处理误差项问题以及VAR和ARIMA模型进行时间序列预测等多种技术。我们的方法优于朴素预测，MASE为0.800，ME为-73.80。我们还构建了一个随机森林分类器，精确度为73%，召回率为78%，F1分数为73%。通过H2O AutoML进行优化后，我们得到了一个XGBoost模型，RMSE为0.176，MAE为0.087。因子分析确定了关键变量，我们使用SHAP进行可解释性人工智能分析，突出了Driver_Home_Area_Type和Road_Type等有影响力的因素。我们的研究提高了对事故严重程度的理解，并为基于证据的道路安全政策提供了启示。",
    "tldr": "本研究结合了机器学习、计量经济学和时间序列预测方法，对英国道路交通事故的严重程度进行了预测和分析。研究结果表明，优化后的模型在预测准确性方面优于传统方法，并识别出了影响事故严重程度的关键变量。"
}