{
    "title": "ALEX: Towards Effective Graph Transfer Learning with Noisy Labels. (arXiv:2309.14673v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) have garnered considerable interest due to their exceptional performance in a wide range of graph machine learning tasks. Nevertheless, the majority of GNN-based approaches have been examined using well-annotated benchmark datasets, leading to suboptimal performance in real-world graph learning scenarios. To bridge this gap, the present paper investigates the problem of graph transfer learning in the presence of label noise, which transfers knowledge from a noisy source graph to an unlabeled target graph. We introduce a novel technique termed Balance Alignment and Information-aware Examination (ALEX) to address this challenge. ALEX first employs singular value decomposition to generate different views with crucial structural semantics, which help provide robust node representations using graph contrastive learning. To mitigate both label shift and domain shift, we estimate a prior distribution to build subgraphs with balanced label distributions. Building o",
    "link": "http://arxiv.org/abs/2309.14673",
    "context": "Title: ALEX: Towards Effective Graph Transfer Learning with Noisy Labels. (arXiv:2309.14673v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) have garnered considerable interest due to their exceptional performance in a wide range of graph machine learning tasks. Nevertheless, the majority of GNN-based approaches have been examined using well-annotated benchmark datasets, leading to suboptimal performance in real-world graph learning scenarios. To bridge this gap, the present paper investigates the problem of graph transfer learning in the presence of label noise, which transfers knowledge from a noisy source graph to an unlabeled target graph. We introduce a novel technique termed Balance Alignment and Information-aware Examination (ALEX) to address this challenge. ALEX first employs singular value decomposition to generate different views with crucial structural semantics, which help provide robust node representations using graph contrastive learning. To mitigate both label shift and domain shift, we estimate a prior distribution to build subgraphs with balanced label distributions. Building o",
    "path": "papers/23/09/2309.14673.json",
    "total_tokens": 851,
    "translated_title": "ALEX: 朝向带有噪声标签的有效图传输学习",
    "translated_abstract": "图神经网络(GNNs)因在各种图机器学习任务中的出色表现而引起了人们的广泛关注。然而，大部分基于GNN的方法都是使用完全注释的基准数据集进行研究，导致在真实世界的图学习场景中表现不佳。为了弥补这一差距，本论文研究了在存在标签噪声的情况下的图传输学习问题，该问题将知识从带有噪声的源图传输到未标记的目标图。我们引入了一种名为Balance Alignment and Information-aware Examination (ALEX)的新技术来解决这个挑战。ALEX首先使用奇异值分解生成具有关键结构语义的不同视图，利用图对比学习来提供稳健的节点表示。为了减轻标签偏移和领域偏移，我们估计一个先验分布来构建具有平衡标签分布的子图。",
    "tldr": "ALEX是一种用于解决存在标签噪声的图传输学习问题的新技术，通过使用图对比学习和平衡标签分布的子图构建方法来提供稳健的节点表示。",
    "en_tdlr": "ALEX is a new technique for addressing the problem of graph transfer learning with noisy labels. It provides robust node representations through graph contrastive learning and the construction of subgraphs with balanced label distributions."
}