{
    "title": "It's Simplex! Disaggregating Measures to Improve Certified Robustness. (arXiv:2309.11005v1 [cs.LG])",
    "abstract": "Certified robustness circumvents the fragility of defences against adversarial attacks, by endowing model predictions with guarantees of class invariance for attacks up to a calculated size. While there is value in these certifications, the techniques through which we assess their performance do not present a proper accounting of their strengths and weaknesses, as their analysis has eschewed consideration of performance over individual samples in favour of aggregated measures. By considering the potential output space of certified models, this work presents two distinct approaches to improve the analysis of certification mechanisms, that allow for both dataset-independent and dataset-dependent measures of certification performance. Embracing such a perspective uncovers new certification approaches, which have the potential to more than double the achievable radius of certification, relative to current state-of-the-art. Empirical evaluation verifies that our new approach can certify $9\\",
    "link": "http://arxiv.org/abs/2309.11005",
    "context": "Title: It's Simplex! Disaggregating Measures to Improve Certified Robustness. (arXiv:2309.11005v1 [cs.LG])\nAbstract: Certified robustness circumvents the fragility of defences against adversarial attacks, by endowing model predictions with guarantees of class invariance for attacks up to a calculated size. While there is value in these certifications, the techniques through which we assess their performance do not present a proper accounting of their strengths and weaknesses, as their analysis has eschewed consideration of performance over individual samples in favour of aggregated measures. By considering the potential output space of certified models, this work presents two distinct approaches to improve the analysis of certification mechanisms, that allow for both dataset-independent and dataset-dependent measures of certification performance. Embracing such a perspective uncovers new certification approaches, which have the potential to more than double the achievable radius of certification, relative to current state-of-the-art. Empirical evaluation verifies that our new approach can certify $9\\",
    "path": "papers/23/09/2309.11005.json",
    "total_tokens": 854,
    "translated_title": "Simplex！通过解构度量来提高认证的鲁棒性",
    "translated_abstract": "通过给模型的预测结果提供攻击大小上不变的保证，认证的鲁棒性绕过了对抗攻击中防御的脆弱性。尽管这些认证具有价值，但我们评估它们性能的技术没有对其优点和缺点进行适当的考虑，因为它们的分析在考虑聚合度量而不是单个样本的性能方面进行了规避。通过考虑认证模型的潜在输出空间，本文提出了两种不同的方法来改进认证机制的分析，这两种方法允许进行数据集无关和数据集相关的认证性能度量。采纳这种视角揭示了新的认证方法，相对于当前的最新技术，这些方法有潜力将可实现的认证半径提高一倍以上。经验证实，我们的新方法可以认证",
    "tldr": "本文提出了通过解构度量来提高认证的鲁棒性的方法，该方法可以更准确地评估认证机制的性能，对于数据集无关和数据集相关的度量都有效。经验证实，这种方法能够将可实现的认证半径提高一倍以上。"
}