{
    "title": "Predicting Survival Time of Ball Bearings in the Presence of Censoring. (arXiv:2309.07188v1 [eess.SP])",
    "abstract": "Ball bearings find widespread use in various manufacturing and mechanical domains, and methods based on machine learning have been widely adopted in the field to monitor wear and spot defects before they lead to failures. Few studies, however, have addressed the problem of censored data, in which failure is not observed. In this paper, we propose a novel approach to predict the time to failure in ball bearings using survival analysis. First, we analyze bearing data in the frequency domain and annotate when a bearing fails by comparing the Kullback-Leibler divergence and the standard deviation between its break-in frequency bins and its break-out frequency bins. Second, we train several survival models to estimate the time to failure based on the annotated data and covariates extracted from the time domain, such as skewness, kurtosis and entropy. The models give a probabilistic prediction of risk over time and allow us to compare the survival function between groups of bearings. We demo",
    "link": "http://arxiv.org/abs/2309.07188",
    "context": "Title: Predicting Survival Time of Ball Bearings in the Presence of Censoring. (arXiv:2309.07188v1 [eess.SP])\nAbstract: Ball bearings find widespread use in various manufacturing and mechanical domains, and methods based on machine learning have been widely adopted in the field to monitor wear and spot defects before they lead to failures. Few studies, however, have addressed the problem of censored data, in which failure is not observed. In this paper, we propose a novel approach to predict the time to failure in ball bearings using survival analysis. First, we analyze bearing data in the frequency domain and annotate when a bearing fails by comparing the Kullback-Leibler divergence and the standard deviation between its break-in frequency bins and its break-out frequency bins. Second, we train several survival models to estimate the time to failure based on the annotated data and covariates extracted from the time domain, such as skewness, kurtosis and entropy. The models give a probabilistic prediction of risk over time and allow us to compare the survival function between groups of bearings. We demo",
    "path": "papers/23/09/2309.07188.json",
    "total_tokens": 975,
    "translated_title": "在存在截尾数据的情况下预测滚珠轴承的寿命",
    "translated_abstract": "滚珠轴承在各种制造和机械领域中得到广泛应用，基于机器学习的方法已经被广泛采用来监测磨损并在故障发生之前发现缺陷。然而，很少有研究涉及到截尾数据的问题，即未观察到故障的情况。本文提出了一种新的方法，使用生存分析来预测滚珠轴承的失效时间。首先，我们在频域中分析轴承数据，并通过比较库尔巴赫-莱布勒散度和其破坏频率区间与其破坏频率区间之间的标准差来标注轴承故障时刻。其次，我们训练了多个生存模型，根据标注数据和从时域提取的协变量（如偏度、峰度和熵）来估计失效时间。这些模型可以以时间为基础进行风险的概率预测，并允许我们比较不同组的轴承的生存函数。我们进行了演示。",
    "tldr": "本文提出了一种新的方法，使用生存分析来预测滚珠轴承的失效时间，并且通过分析频域数据和训练多个生存模型来实现。模型可以以时间为基础进行风险的概率预测，并允许比较不同组轴承的生存函数。",
    "en_tdlr": "This paper proposes a novel approach using survival analysis to predict the failure time of ball bearings. It analyzes frequency-domain data and trains multiple survival models to estimate failure time. The models provide probabilistic predictions of risk over time and allow for comparison of survival functions between different groups of bearings."
}