{
    "title": "Through their eyes: multi-subject Brain Decoding with simple alignment techniques. (arXiv:2309.00627v1 [q-bio.NC])",
    "abstract": "Previous brain decoding research primarily involves single-subject studies, reconstructing stimuli via fMRI activity from the same subject. Our study aims to introduce a generalization technique for cross-subject brain decoding, facilitated by exploring data alignment methods. We utilized the NSD dataset, a comprehensive 7T fMRI vision experiment involving multiple subjects exposed to 9841 images, 982 of which were viewed by all. Our approach involved training a decoding model on one subject, aligning others' data to this space, and testing the decoding on the second subject. We compared ridge regression, hyper alignment, and anatomical alignment techniques for fMRI data alignment. We established that cross-subject brain decoding is feasible, even using around 10% of the total data, or 982 common images, with comparable performance to single-subject decoding. Ridge regression was the best method for functional alignment. Through subject alignment, we achieved superior brain decoding an",
    "link": "http://arxiv.org/abs/2309.00627",
    "context": "Title: Through their eyes: multi-subject Brain Decoding with simple alignment techniques. (arXiv:2309.00627v1 [q-bio.NC])\nAbstract: Previous brain decoding research primarily involves single-subject studies, reconstructing stimuli via fMRI activity from the same subject. Our study aims to introduce a generalization technique for cross-subject brain decoding, facilitated by exploring data alignment methods. We utilized the NSD dataset, a comprehensive 7T fMRI vision experiment involving multiple subjects exposed to 9841 images, 982 of which were viewed by all. Our approach involved training a decoding model on one subject, aligning others' data to this space, and testing the decoding on the second subject. We compared ridge regression, hyper alignment, and anatomical alignment techniques for fMRI data alignment. We established that cross-subject brain decoding is feasible, even using around 10% of the total data, or 982 common images, with comparable performance to single-subject decoding. Ridge regression was the best method for functional alignment. Through subject alignment, we achieved superior brain decoding an",
    "path": "papers/23/09/2309.00627.json",
    "total_tokens": 886,
    "translated_title": "通过简单的对齐技术进行多主体脑解码",
    "translated_abstract": "以往的脑解码研究主要涉及单个主体的研究，通过对同一主体的fMRI活动重建刺激。我们的研究旨在引入一种跨主体脑解码的通用技术，通过探索数据对齐方法来实现。我们利用NSD数据集，一个涉及多个主体的综合7T fMRI视觉实验，包括9841个图像，其中982个被所有主体观看。我们的方法是在一个主体上训练解码模型，将其他主体的数据对齐到该空间，并在第二个主体上进行解码测试。我们比较了岭回归、超级对齐和解剖对齐等不同的fMRI数据对齐技术。我们证明了跨主体脑解码是可行的，即使仅使用约10%的总数据，即982个共同图像，性能与单个主体解码相媲美。岭回归是功能对齐的最佳方法。通过主体对齐，我们实现了更优越的脑解码。",
    "tldr": "通过简单的对齐技术，我们证明了跨主体脑解码是可行的，即使只使用约10%的数据，性能与单个主体解码相媲美。"
}