{
    "title": "A Review of Machine Learning-based Security in Cloud Computing. (arXiv:2309.04911v1 [cs.CR])",
    "abstract": "Cloud Computing (CC) is revolutionizing the way IT resources are delivered to users, allowing them to access and manage their systems with increased cost-effectiveness and simplified infrastructure. However, with the growth of CC comes a host of security risks, including threats to availability, integrity, and confidentiality. To address these challenges, Machine Learning (ML) is increasingly being used by Cloud Service Providers (CSPs) to reduce the need for human intervention in identifying and resolving security issues. With the ability to analyze vast amounts of data, and make high-accuracy predictions, ML can transform the way CSPs approach security. In this paper, we will explore some of the most recent research in the field of ML-based security in Cloud Computing. We will examine the features and effectiveness of a range of ML algorithms, highlighting their unique strengths and potential limitations. Our goal is to provide a comprehensive overview of the current state of ML in c",
    "link": "http://arxiv.org/abs/2309.04911",
    "context": "Title: A Review of Machine Learning-based Security in Cloud Computing. (arXiv:2309.04911v1 [cs.CR])\nAbstract: Cloud Computing (CC) is revolutionizing the way IT resources are delivered to users, allowing them to access and manage their systems with increased cost-effectiveness and simplified infrastructure. However, with the growth of CC comes a host of security risks, including threats to availability, integrity, and confidentiality. To address these challenges, Machine Learning (ML) is increasingly being used by Cloud Service Providers (CSPs) to reduce the need for human intervention in identifying and resolving security issues. With the ability to analyze vast amounts of data, and make high-accuracy predictions, ML can transform the way CSPs approach security. In this paper, we will explore some of the most recent research in the field of ML-based security in Cloud Computing. We will examine the features and effectiveness of a range of ML algorithms, highlighting their unique strengths and potential limitations. Our goal is to provide a comprehensive overview of the current state of ML in c",
    "path": "papers/23/09/2309.04911.json",
    "total_tokens": 909,
    "translated_title": "机器学习在云计算安全中的应用综述",
    "translated_abstract": "云计算（CC）正在改变向用户提供IT资源的方式，使他们能够以更高的成本效益和简化的基础设施来访问和管理系统。然而，随着CC的增长，出现了一系列安全风险，包括对可用性、完整性和机密性的威胁。为了解决这些挑战，云服务提供商（CSPs）越来越多地使用机器学习（ML）来减少在识别和解决安全问题方面的人工干预。ML能够分析大量数据并进行高准确性预测，可以改变CSPs在安全方面的方法。在本文中，我们将探讨机器学习在云计算安全领域的一些最新研究。我们将研究一系列ML算法的特性和有效性，突出它们独特的优势和潜在限制。我们的目标是提供关于ML在云计算中的当前状况的综合概述。",
    "tldr": "云计算的快速发展带来了安全风险，机器学习的应用可以在识别和解决安全问题方面减少人工干预的需求，并通过分析大量数据进行准确预测，从而改变了云服务提供商在安全方面的方法。",
    "en_tdlr": "The rapid development of cloud computing brings security risks, and the application of machine learning can reduce the need for human intervention in identifying and resolving security issues, and change the approach of cloud service providers in security by analyzing vast amounts of data for accurate predictions."
}