{
    "title": "Automatic Cadastral Boundary Detection of Very High Resolution Images Using Mask R-CNN. (arXiv:2309.16708v1 [cs.CV])",
    "abstract": "Recently, there has been a high demand for accelerating and improving the detection of automatic cadastral mapping. As this problem is in its starting point, there are many methods of computer vision and deep learning that have not been considered yet. In this paper, we focus on deep learning and provide three geometric post-processing methods that improve the quality of the work. Our framework includes two parts, each of which consists of a few phases. Our solution to this problem uses instance segmentation. In the first part, we use Mask R-CNN with the backbone of pre-trained ResNet-50 on the ImageNet dataset. In the second phase, we apply three geometric post-processing methods to the output of the first part to get better overall output. Here, we also use computational geometry to introduce a new method for simplifying lines which we call it pocket-based simplification algorithm. For evaluating the quality of our solution, we use popular formulas in this field which are recall, pre",
    "link": "http://arxiv.org/abs/2309.16708",
    "context": "Title: Automatic Cadastral Boundary Detection of Very High Resolution Images Using Mask R-CNN. (arXiv:2309.16708v1 [cs.CV])\nAbstract: Recently, there has been a high demand for accelerating and improving the detection of automatic cadastral mapping. As this problem is in its starting point, there are many methods of computer vision and deep learning that have not been considered yet. In this paper, we focus on deep learning and provide three geometric post-processing methods that improve the quality of the work. Our framework includes two parts, each of which consists of a few phases. Our solution to this problem uses instance segmentation. In the first part, we use Mask R-CNN with the backbone of pre-trained ResNet-50 on the ImageNet dataset. In the second phase, we apply three geometric post-processing methods to the output of the first part to get better overall output. Here, we also use computational geometry to introduce a new method for simplifying lines which we call it pocket-based simplification algorithm. For evaluating the quality of our solution, we use popular formulas in this field which are recall, pre",
    "path": "papers/23/09/2309.16708.json",
    "total_tokens": 894,
    "translated_title": "使用Mask R-CNN自动检测高分辨率图像的界址地籍边界",
    "translated_abstract": "最近，加速和改进自动地籍制图的检测需求很高。由于这个问题还处于起点阶段，许多计算机视觉和深度学习的方法尚未被考虑。在本文中，我们专注于深度学习，并提供了三种改善工作质量的几何后处理方法。我们的框架包括两个部分，每个部分由几个阶段组成。我们对这个问题的解决方案使用实例分割。在第一部分中，我们使用ResNet-50在ImageNet数据集上进行训练的Mask R-CNN。在第二阶段，我们将三种几何后处理方法应用于第一部分的输出，以获得更好的总体输出。在这里，我们还使用计算几何来介绍一种称为基于口袋的简化算法的新方法。为了评估我们解决方案的质量，我们使用了这一领域中常用的召回率和准确率等公式。",
    "tldr": "这篇论文使用Mask R-CNN和几何后处理方法提出了自动检测高分辨率图像界址地籍边界的解决方案，并引入了一种新的基于口袋的简化算法来改善工作质量。"
}