{
    "title": "Verifiable Learned Behaviors via Motion Primitive Composition: Applications to Scooping of Granular Media. (arXiv:2309.14894v1 [cs.RO])",
    "abstract": "A robotic behavior model that can reliably generate behaviors from natural language inputs in real time would substantially expedite the adoption of industrial robots due to enhanced system flexibility. To facilitate these efforts, we construct a framework in which learned behaviors, created by a natural language abstractor, are verifiable by construction. Leveraging recent advancements in motion primitives and probabilistic verification, we construct a natural-language behavior abstractor that generates behaviors by synthesizing a directed graph over the provided motion primitives. If these component motion primitives are constructed according to the criteria we specify, the resulting behaviors are probabilistically verifiable. We demonstrate this verifiable behavior generation capacity in both simulation on an exploration task and on hardware with a robot scooping granular media.",
    "link": "http://arxiv.org/abs/2309.14894",
    "context": "Title: Verifiable Learned Behaviors via Motion Primitive Composition: Applications to Scooping of Granular Media. (arXiv:2309.14894v1 [cs.RO])\nAbstract: A robotic behavior model that can reliably generate behaviors from natural language inputs in real time would substantially expedite the adoption of industrial robots due to enhanced system flexibility. To facilitate these efforts, we construct a framework in which learned behaviors, created by a natural language abstractor, are verifiable by construction. Leveraging recent advancements in motion primitives and probabilistic verification, we construct a natural-language behavior abstractor that generates behaviors by synthesizing a directed graph over the provided motion primitives. If these component motion primitives are constructed according to the criteria we specify, the resulting behaviors are probabilistically verifiable. We demonstrate this verifiable behavior generation capacity in both simulation on an exploration task and on hardware with a robot scooping granular media.",
    "path": "papers/23/09/2309.14894.json",
    "total_tokens": 835,
    "translated_title": "可验证的学习行为通过运动原语构成：应用于颗粒状介质的铲取",
    "translated_abstract": "一种能够实时可靠地从自然语言输入中生成行为的机器人行为模型，将在很大程度上加快工业机器人的采用，因为它增强了系统的灵活性。为了促进这些努力，我们构建了一个框架，其中通过自然语言摘要器创建的学习行为可以通过构造进行验证。利用最近在运动原语和概率验证方面的进展，我们构建了一个自然语言行为摘要器，通过合成所提供的运动原语的有向图生成行为。如果这些组成的运动原语符合我们指定的标准，所得到的行为具有概率上的可验证性。我们在探索任务的模拟和使用机器人在硬件上铲取颗粒状介质的实验中展示了这种可验证的行为生成能力。",
    "tldr": "通过运动原语构成的机器人行为模型能够从自然语言输入中实时生成可验证的行为，为工业机器人的灵活性提供了增强。实验表明这种模型在探索任务和处理颗粒状介质的实际情境下具有可验证性。",
    "en_tdlr": "A robotic behavior model that generates verifiable behaviors in real time from natural language inputs enhances the flexibility of industrial robots. The model is demonstrated to be probabilistically verifiable in both simulation and real-world tasks involving granular media."
}