{
    "title": "Polynomial-Model-Based Optimization for Blackbox Objectives. (arXiv:2309.00663v1 [cs.LG])",
    "abstract": "For a wide range of applications the structure of systems like Neural Networks or complex simulations, is unknown and approximation is costly or even impossible. Black-box optimization seeks to find optimal (hyper-) parameters for these systems such that a pre-defined objective function is minimized. Polynomial-Model-Based Optimization (PMBO) is a novel blackbox optimizer that finds the minimum by fitting a polynomial surrogate to the objective function.  Motivated by Bayesian optimization the model is iteratively updated according to the acquisition function Expected Improvement, thus balancing the exploitation and exploration rate and providing an uncertainty estimate of the model. PMBO is benchmarked against other state-of-the-art algorithms for a given set of artificial, analytical functions. PMBO competes successfully with those algorithms and even outperforms all of them in some cases. As the results suggest, we believe PMBO is the pivotal choice for solving blackbox optimization",
    "link": "http://arxiv.org/abs/2309.00663",
    "context": "Title: Polynomial-Model-Based Optimization for Blackbox Objectives. (arXiv:2309.00663v1 [cs.LG])\nAbstract: For a wide range of applications the structure of systems like Neural Networks or complex simulations, is unknown and approximation is costly or even impossible. Black-box optimization seeks to find optimal (hyper-) parameters for these systems such that a pre-defined objective function is minimized. Polynomial-Model-Based Optimization (PMBO) is a novel blackbox optimizer that finds the minimum by fitting a polynomial surrogate to the objective function.  Motivated by Bayesian optimization the model is iteratively updated according to the acquisition function Expected Improvement, thus balancing the exploitation and exploration rate and providing an uncertainty estimate of the model. PMBO is benchmarked against other state-of-the-art algorithms for a given set of artificial, analytical functions. PMBO competes successfully with those algorithms and even outperforms all of them in some cases. As the results suggest, we believe PMBO is the pivotal choice for solving blackbox optimization",
    "path": "papers/23/09/2309.00663.json",
    "total_tokens": 853,
    "translated_title": "基于多项式模型的黑盒目标优化",
    "translated_abstract": "对于像神经网络或复杂模拟这样的系统结构，在许多应用中，是未知的，近似是昂贵甚至不可能实现的。黑盒优化旨在找到这些系统的最佳（超）参数，使预定义的目标函数最小化。基于多项式模型的优化（PMBO）是一种新颖的黑盒优化器，通过拟合多项式代理来寻找最小值。受贝叶斯优化的启发，该模型根据预期改进的采集函数进行迭代更新，从而平衡了开发和探索率，并提供了模型的不确定性估计。对于给定的一组人工、分析函数，PMBO与其他最先进的算法进行了基准测试。PMBO成功地与这些算法竞争，并在某些情况下甚至超越了它们。根据结果，我们认为PMBO是解决黑盒优化问题的关键选择。",
    "tldr": "基于多项式模型的黑盒优化是一种新颖的优化方法，通过拟合多项式代理寻找未知系统的最佳参数，成功竞争并超越其他算法，在黑盒优化问题的解决中具有关键意义。",
    "en_tdlr": "Polynomial-Model-Based Optimization (PMBO) is a novel approach that fits a polynomial surrogate to unknown systems for finding optimal parameters. It competes successfully against other algorithms and is pivotal in solving blackbox optimization problems."
}