{
    "title": "CAMERA: A Multimodal Dataset and Benchmark for Ad Text Generation. (arXiv:2309.12030v1 [cs.CL])",
    "abstract": "In response to the limitations of manual online ad production, significant research has been conducted in the field of automatic ad text generation (ATG). However, comparing different methods has been challenging because of the lack of benchmarks encompassing the entire field and the absence of well-defined problem sets with clear model inputs and outputs. To address these challenges, this paper aims to advance the field of ATG by introducing a redesigned task and constructing a benchmark. Specifically, we defined ATG as a cross-application task encompassing various aspects of the Internet advertising. As part of our contribution, we propose a first benchmark dataset, CA Multimodal Evaluation for Ad Text GeneRAtion (CAMERA), carefully designed for ATG to be able to leverage multi-modal information and conduct an industry-wise evaluation. Furthermore, we demonstrate the usefulness of our proposed benchmark through evaluation experiments using multiple baseline models, which vary in term",
    "link": "http://arxiv.org/abs/2309.12030",
    "context": "Title: CAMERA: A Multimodal Dataset and Benchmark for Ad Text Generation. (arXiv:2309.12030v1 [cs.CL])\nAbstract: In response to the limitations of manual online ad production, significant research has been conducted in the field of automatic ad text generation (ATG). However, comparing different methods has been challenging because of the lack of benchmarks encompassing the entire field and the absence of well-defined problem sets with clear model inputs and outputs. To address these challenges, this paper aims to advance the field of ATG by introducing a redesigned task and constructing a benchmark. Specifically, we defined ATG as a cross-application task encompassing various aspects of the Internet advertising. As part of our contribution, we propose a first benchmark dataset, CA Multimodal Evaluation for Ad Text GeneRAtion (CAMERA), carefully designed for ATG to be able to leverage multi-modal information and conduct an industry-wise evaluation. Furthermore, we demonstrate the usefulness of our proposed benchmark through evaluation experiments using multiple baseline models, which vary in term",
    "path": "papers/23/09/2309.12030.json",
    "total_tokens": 880,
    "translated_title": "CAMERA：广告文本生成的多模态数据集和基准",
    "translated_abstract": "在响应手动在线广告制作的限制时，已经在自动广告文本生成（ATG）领域进行了大量研究。然而，由于缺乏涵盖整个领域的基准以及没有明确定义的问题集和清晰的模型输入和输出，比较不同方法一直是一项挑战。为了解决这些问题，本文旨在通过引入重新设计的任务和构建一个基准来推动ATG领域的发展。具体而言，我们将ATG定义为一个跨应用任务，涵盖互联网广告的各个方面。作为我们的贡献的一部分，我们提出了一个第一个基准数据集，名为CA Multimodal Evaluation for Ad Text GeneRAtion（CAMERA），为ATG精心设计，可以利用多模态信息并进行行业评估。此外，我们通过使用多个基线模型进行评估实验证明了我们提出的基准的有用性，这些模型在术语上有所不同。",
    "tldr": "本文介绍了一个重新设计的任务和构建了一个基准，通过引入CA Multimodal Evaluation for Ad Text GeneRAtion (CAMERA)数据集，推动了广告文本生成领域的发展并解决了现有基准中的缺陷。"
}