{
    "title": "Physics-informed State-space Neural Networks for Transport Phenomena. (arXiv:2309.12211v1 [cs.LG])",
    "abstract": "This work introduces Physics-informed State-space neural network Models (PSMs), a novel solution to achieving real-time optimization, flexibility, and fault tolerance in autonomous systems, particularly in transport-dominated systems such as chemical, biomedical, and power plants. Traditional data-driven methods fall short due to a lack of physical constraints like mass conservation; PSMs address this issue by training deep neural networks with sensor data and physics-informing using components' Partial Differential Equations (PDEs), resulting in a physics-constrained, end-to-end differentiable forward dynamics model. Through two in silico experiments - a heated channel and a cooling system loop - we demonstrate that PSMs offer a more accurate approach than purely data-driven models.  Beyond accuracy, there are several compelling use cases for PSMs. In this work, we showcase two: the creation of a nonlinear supervisory controller through a sequentially updated state-space representatio",
    "link": "http://arxiv.org/abs/2309.12211",
    "context": "Title: Physics-informed State-space Neural Networks for Transport Phenomena. (arXiv:2309.12211v1 [cs.LG])\nAbstract: This work introduces Physics-informed State-space neural network Models (PSMs), a novel solution to achieving real-time optimization, flexibility, and fault tolerance in autonomous systems, particularly in transport-dominated systems such as chemical, biomedical, and power plants. Traditional data-driven methods fall short due to a lack of physical constraints like mass conservation; PSMs address this issue by training deep neural networks with sensor data and physics-informing using components' Partial Differential Equations (PDEs), resulting in a physics-constrained, end-to-end differentiable forward dynamics model. Through two in silico experiments - a heated channel and a cooling system loop - we demonstrate that PSMs offer a more accurate approach than purely data-driven models.  Beyond accuracy, there are several compelling use cases for PSMs. In this work, we showcase two: the creation of a nonlinear supervisory controller through a sequentially updated state-space representatio",
    "path": "papers/23/09/2309.12211.json",
    "total_tokens": 953,
    "translated_title": "物理信息触发状态空间神经网络用于传输现象",
    "translated_abstract": "本研究介绍了物理信息触发状态空间神经网络模型（PSMs），这是一种在自主系统中实现实时优化、灵活性和容错性的新颖解决方案，特别适用于化学、生物医学和电厂等以传输为主导的系统。传统的数据驱动方法由于缺乏像质量守恒这样的物理约束而有所不足。PSMs通过使用传感器数据训练深度神经网络，并使用部分微分方程对物理信息进行建模，从而得到具有物理约束的可迭代前向动力学模型。通过两个仿真实验 - 加热通道和冷却系统回路，我们证明PSMs比纯数据驱动模型提供更准确的方法。除了准确性之外，PSMs还具有多种令人信服的用例。本文展示了其中的两个：通过顺序更新的状态空间表示创建非线性监控控制器",
    "tldr": "这项研究引入了物理信息触发状态空间神经网络模型（PSMs），用于解决在化学、生物医学和电厂等传输现象中实现实时优化和容错性的问题。通过使用传感器数据训练深度神经网络，并使用物理模型进行传输系统建模，PSMs提供了比传统数据驱动模型更准确的方法，并具有多种应用场景。",
    "en_tdlr": "This work introduces Physics-informed State-space neural network Models (PSMs) as a solution for real-time optimization and fault tolerance in transport phenomena such as chemical, biomedical, and power plants. By training deep neural networks with sensor data and utilizing physics models, PSMs provide a more accurate approach than traditional data-driven models, with various compelling use cases."
}