{
    "title": "SEMPART: Self-supervised Multi-resolution Partitioning of Image Semantics. (arXiv:2309.10972v1 [cs.CV])",
    "abstract": "Accurately determining salient regions of an image is challenging when labeled data is scarce. DINO-based self-supervised approaches have recently leveraged meaningful image semantics captured by patch-wise features for locating foreground objects. Recent methods have also incorporated intuitive priors and demonstrated value in unsupervised methods for object partitioning. In this paper, we propose SEMPART, which jointly infers coarse and fine bi-partitions over an image's DINO-based semantic graph. Furthermore, SEMPART preserves fine boundary details using graph-driven regularization and successfully distills the coarse mask semantics into the fine mask. Our salient object detection and single object localization findings suggest that SEMPART produces high-quality masks rapidly without additional post-processing and benefits from co-optimizing the coarse and fine branches.",
    "link": "http://arxiv.org/abs/2309.10972",
    "context": "Title: SEMPART: Self-supervised Multi-resolution Partitioning of Image Semantics. (arXiv:2309.10972v1 [cs.CV])\nAbstract: Accurately determining salient regions of an image is challenging when labeled data is scarce. DINO-based self-supervised approaches have recently leveraged meaningful image semantics captured by patch-wise features for locating foreground objects. Recent methods have also incorporated intuitive priors and demonstrated value in unsupervised methods for object partitioning. In this paper, we propose SEMPART, which jointly infers coarse and fine bi-partitions over an image's DINO-based semantic graph. Furthermore, SEMPART preserves fine boundary details using graph-driven regularization and successfully distills the coarse mask semantics into the fine mask. Our salient object detection and single object localization findings suggest that SEMPART produces high-quality masks rapidly without additional post-processing and benefits from co-optimizing the coarse and fine branches.",
    "path": "papers/23/09/2309.10972.json",
    "total_tokens": 900,
    "translated_title": "SEMPART: 自监督多分辨率图像语义分割",
    "translated_abstract": "当标记数据稀缺时，准确确定图像的显著区域是具有挑战性的。基于DINO的自监督方法最近利用了通过基于补丁的特征捕捉的有意义的图像语义来定位前景对象。最近的方法还融合了直观的先验知识，并展示了在无监督对象分割方法中具有价值。在本文中，我们提出了SEMPART，它在基于DINO的语义图中联合推断图像的粗细双分割。此外，SEMPART利用基于图形的正则化方法保留细节边界，并成功将粗糙掩码语义提取为细粒度掩码。我们的显著对象检测和单个对象定位结果表明，SEMPART能够快速产生高质量的掩码，并且通过协同优化粗分支和细分支而受益。",
    "tldr": "本文提出了一种名为SEMPART的自监督多分辨率图像语义分割方法，通过联合推断图像的粗细双分割，并利用基于图形的正则化方法进行边界细节保留，成功将粗糙掩码语义提取为细粒度掩码，在显著对象检测和单个对象定位方面表现出色。"
}