{
    "title": "Learning Decentralized Flocking Controllers with Spatio-Temporal Graph Neural Network. (arXiv:2309.17437v2 [cs.RO] UPDATED)",
    "abstract": "Recently a line of researches has delved the use of graph neural networks (GNNs) for decentralized control in swarm robotics. However, it has been observed that relying solely on the states of immediate neighbors is insufficient to imitate a centralized control policy. To address this limitation, prior studies proposed incorporating $L$-hop delayed states into the computation. While this approach shows promise, it can lead to a lack of consensus among distant flock members and the formation of small clusters, consequently resulting in the failure of cohesive flocking behaviors. Instead, our approach leverages spatiotemporal GNN, named STGNN that encompasses both spatial and temporal expansions. The spatial expansion collects delayed states from distant neighbors, while the temporal expansion incorporates previous states from immediate neighbors. The broader and more comprehensive information gathered from both expansions results in more effective and accurate predictions. We develop an",
    "link": "http://arxiv.org/abs/2309.17437",
    "context": "Title: Learning Decentralized Flocking Controllers with Spatio-Temporal Graph Neural Network. (arXiv:2309.17437v2 [cs.RO] UPDATED)\nAbstract: Recently a line of researches has delved the use of graph neural networks (GNNs) for decentralized control in swarm robotics. However, it has been observed that relying solely on the states of immediate neighbors is insufficient to imitate a centralized control policy. To address this limitation, prior studies proposed incorporating $L$-hop delayed states into the computation. While this approach shows promise, it can lead to a lack of consensus among distant flock members and the formation of small clusters, consequently resulting in the failure of cohesive flocking behaviors. Instead, our approach leverages spatiotemporal GNN, named STGNN that encompasses both spatial and temporal expansions. The spatial expansion collects delayed states from distant neighbors, while the temporal expansion incorporates previous states from immediate neighbors. The broader and more comprehensive information gathered from both expansions results in more effective and accurate predictions. We develop an",
    "path": "papers/23/09/2309.17437.json",
    "total_tokens": 901,
    "translated_title": "学习具有时空图神经网络的去中心化群集控制器",
    "translated_abstract": "最近的一系列研究探索了在群集机器人中使用图神经网络(GNN)进行去中心化控制。然而，观察到仅依靠相邻状态是不足以模仿集中式控制策略的。为了解决这个问题，之前的研究提出了将$L$-跳延迟状态纳入计算中。虽然这种方法很有前途，但它可能导致远离的群体成员之间缺乏一致性，小集群的形成，从而导致连贯的集群行为失败。相反，我们的方法利用了时空GNN，命名为STGNN，它包括了空间和时间的扩展。空间扩展收集来自远处领航者的延迟状态，而时间扩展则纳入来自相邻领航者的先前状态。通过从这两个扩展中收集更广泛、更全面的信息，可以实现更有效、更准确的预测。我们开发了一个...",
    "tldr": "本论文提出了一种名为STGNN的时空图神经网络，该网络在去中心化群集控制中通过结合空间和时间扩展来更好地模拟集中式控制策略，从而提高了预测的效果和准确性。",
    "en_tdlr": "This paper introduces a spatio-temporal graph neural network called STGNN, which improves the prediction accuracy and effectiveness in decentralized flocking control by incorporating both spatial and temporal expansions to mimic centralized control policy."
}