{
    "title": "Fully automated landmarking and facial segmentation on 3D photographs. (arXiv:2309.10472v1 [cs.CV])",
    "abstract": "Three-dimensional facial stereophotogrammetry provides a detailed representation of craniofacial soft tissue without the use of ionizing radiation. While manual annotation of landmarks serves as the current gold standard for cephalometric analysis, it is a time-consuming process and is prone to human error. The aim in this study was to develop and evaluate an automated cephalometric annotation method using a deep learning-based approach. Ten landmarks were manually annotated on 2897 3D facial photographs by a single observer. The automated landmarking workflow involved two successive DiffusionNet models and additional algorithms for facial segmentation. The dataset was randomly divided into a training and test dataset. The training dataset was used to train the deep learning networks, whereas the test dataset was used to evaluate the performance of the automated workflow. The precision of the workflow was evaluated by calculating the Euclidean distances between the automated and manual",
    "link": "http://arxiv.org/abs/2309.10472",
    "context": "Title: Fully automated landmarking and facial segmentation on 3D photographs. (arXiv:2309.10472v1 [cs.CV])\nAbstract: Three-dimensional facial stereophotogrammetry provides a detailed representation of craniofacial soft tissue without the use of ionizing radiation. While manual annotation of landmarks serves as the current gold standard for cephalometric analysis, it is a time-consuming process and is prone to human error. The aim in this study was to develop and evaluate an automated cephalometric annotation method using a deep learning-based approach. Ten landmarks were manually annotated on 2897 3D facial photographs by a single observer. The automated landmarking workflow involved two successive DiffusionNet models and additional algorithms for facial segmentation. The dataset was randomly divided into a training and test dataset. The training dataset was used to train the deep learning networks, whereas the test dataset was used to evaluate the performance of the automated workflow. The precision of the workflow was evaluated by calculating the Euclidean distances between the automated and manual",
    "path": "papers/23/09/2309.10472.json",
    "total_tokens": 868,
    "translated_title": "三维照片上完全自动的地标标记和面部分割",
    "translated_abstract": "三维面部立体摄影术提供了详细的颅面软组织表示，无需使用电离辐射。虽然手动注释标记作为头部测量分析的当前金标准，但这是一个耗时的过程，容易出错。本研究的目的是开发和评估一种基于深度学习的自动头部测量注释方法。一个观察者手动在2897张三维面部照片上注释了十个地标。自动标记工作流涉及两个连续的DiffusionNet模型和额外的面部分割算法。数据集被随机分为训练和测试数据集。训练数据集用于训练深度学习网络，测试数据集用于评估自动工作流的性能。通过计算自动和手动标记之间的欧氏距离来评估工作流的精度。",
    "tldr": "本研究开发了一种基于深度学习的自动头部测量注释方法，使用三维面部立体摄影术进行了评估。该方法能够准确地进行地标标记和面部分割，避免了手动注释的耗时和容易出错的问题。",
    "en_tdlr": "This study developed and evaluated an automated cephalometric annotation method using 3D facial stereophotogrammetry. The method accurately performs landmarking and facial segmentation, avoiding the time-consuming and error-prone process of manual annotation."
}