{
    "title": "Revisiting Cephalometric Landmark Detection from the view of Human Pose Estimation with Lightweight Super-Resolution Head. (arXiv:2309.17143v1 [cs.CV])",
    "abstract": "Accurate localization of cephalometric landmarks holds great importance in the fields of orthodontics and orthognathics due to its potential for automating key point labeling. In the context of landmark detection, particularly in cephalometrics, it has been observed that existing methods often lack standardized pipelines and well-designed bias reduction processes, which significantly impact their performance. In this paper, we revisit a related task, human pose estimation (HPE), which shares numerous similarities with cephalometric landmark detection (CLD), and emphasize the potential for transferring techniques from the former field to benefit the latter. Motivated by this insight, we have developed a robust and adaptable benchmark based on the well-established HPE codebase known as MMPose. This benchmark can serve as a dependable baseline for achieving exceptional CLD performance. Furthermore, we introduce an upscaling design within the framework to further enhance performance. This ",
    "link": "http://arxiv.org/abs/2309.17143",
    "context": "Title: Revisiting Cephalometric Landmark Detection from the view of Human Pose Estimation with Lightweight Super-Resolution Head. (arXiv:2309.17143v1 [cs.CV])\nAbstract: Accurate localization of cephalometric landmarks holds great importance in the fields of orthodontics and orthognathics due to its potential for automating key point labeling. In the context of landmark detection, particularly in cephalometrics, it has been observed that existing methods often lack standardized pipelines and well-designed bias reduction processes, which significantly impact their performance. In this paper, we revisit a related task, human pose estimation (HPE), which shares numerous similarities with cephalometric landmark detection (CLD), and emphasize the potential for transferring techniques from the former field to benefit the latter. Motivated by this insight, we have developed a robust and adaptable benchmark based on the well-established HPE codebase known as MMPose. This benchmark can serve as a dependable baseline for achieving exceptional CLD performance. Furthermore, we introduce an upscaling design within the framework to further enhance performance. This ",
    "path": "papers/23/09/2309.17143.json",
    "total_tokens": 879,
    "translated_title": "从轻量级超分辨头部的人体姿势估计角度重新审视颅侧定位的重要性",
    "translated_abstract": "颅侧定位的精确定位在正畸学和正颌学领域具有重要意义，因其有潜力自动化关键点标记。在颅侧定位尤其是颅侧测量方面，已经观察到现有方法往往缺乏标准化的流程和设计合理的偏差减少过程，这对它们的性能有显著影响。本文重新审视了相关任务——人体姿势估计（HPE），它与颅侧定位的相似之处很多，并强调从前者领域中转移技术以有益于后者的潜力。受此启发，我们开发了一个基于知名HPE代码库MMPose的稳健且可适应的基准，该基准可以作为实现出色颅侧定位性能的可靠基准线。此外，我们在框架中引入了一个提升设计，以进一步提高性能。",
    "tldr": "本文探讨了人体姿势估计与颅侧定位的关系，并开发出基于人体姿势估计的稳健基准，以提高颅侧定位的性能。",
    "en_tdlr": "This paper examines the relationship between human pose estimation and cephalometric landmark detection, and develops a robust benchmark based on human pose estimation to improve the performance of landmark detection."
}