{
    "title": "Transitions in echo index and dependence on input repetitions. (arXiv:2309.04728v1 [math.DS])",
    "abstract": "The echo index counts the number of simultaneously stable asymptotic responses of a nonautonomous (i.e. input-driven) dynamical system. It generalizes the well-known echo state property for recurrent neural networks this corresponds to the echo index being equal to one. In this paper, we investigate how the echo index depends on parameters that govern typical responses to a finite-state ergodic external input that forces the dynamics. We consider the echo index for a nonautonomous system that switches between a finite set of maps, where we assume that each map possesses a finite set of hyperbolic equilibrium attractors. We find the minimum and maximum repetitions of each map are crucial for the resulting echo index. Casting our theoretical findings in the RNN computing framework, we obtain that for small amplitude forcing the echo index corresponds to the number of attractors for the input-free system, while for large amplitude forcing, the echo index reduces to one. The intermediate",
    "link": "http://arxiv.org/abs/2309.04728",
    "context": "Title: Transitions in echo index and dependence on input repetitions. (arXiv:2309.04728v1 [math.DS])\nAbstract: The echo index counts the number of simultaneously stable asymptotic responses of a nonautonomous (i.e. input-driven) dynamical system. It generalizes the well-known echo state property for recurrent neural networks this corresponds to the echo index being equal to one. In this paper, we investigate how the echo index depends on parameters that govern typical responses to a finite-state ergodic external input that forces the dynamics. We consider the echo index for a nonautonomous system that switches between a finite set of maps, where we assume that each map possesses a finite set of hyperbolic equilibrium attractors. We find the minimum and maximum repetitions of each map are crucial for the resulting echo index. Casting our theoretical findings in the RNN computing framework, we obtain that for small amplitude forcing the echo index corresponds to the number of attractors for the input-free system, while for large amplitude forcing, the echo index reduces to one. The intermediate",
    "path": "papers/23/09/2309.04728.json",
    "total_tokens": 840,
    "translated_title": "回声指数的转变及对输入重复的依赖",
    "translated_abstract": "回声指数是一个非自治（即受输入驱动）动力系统中同时稳定渐近响应的数量。它推广了递归神经网络的回声状态性质，这对应于回声指数等于一。在本文中，我们研究了回声指数如何依赖于控制系统对强迫动力学的有限状态随机外部输入的参数。我们考虑了一个在有限一组映射之间切换的非自治系统的回声指数，其中我们假设每个映射具有有限一组双曲型平衡吸引子。我们发现每个映射的最小和最大重复对于得到的回声指数是至关重要的。将我们的理论发现用RNN计算框架表示，我们得到对于小幅强迫，回声指数对应于无输入系统的吸引子数量，而对于大幅强迫，回声指数减少到一。中间的情况",
    "tldr": "回声指数是一个非自治动力系统中同时稳定渐近响应的数量，我们研究了回声指数对依赖于参数以及输入重复的关系。",
    "en_tdlr": "The echo index counts the number of simultaneously stable asymptotic responses of a nonautonomous dynamical system. We investigate how the echo index depends on parameters and the repetition of the input."
}