{
    "title": "Cloud-Based Hierarchical Imitation Learning for Scalable Transfer of Construction Skills from Human Workers to Assisting Robots. (arXiv:2309.11619v1 [cs.RO])",
    "abstract": "Assigning repetitive and physically-demanding construction tasks to robots can alleviate human workers's exposure to occupational injuries. Transferring necessary dexterous and adaptive artisanal construction craft skills from workers to robots is crucial for the successful delegation of construction tasks and achieving high-quality robot-constructed work. Predefined motion planning scripts tend to generate rigid and collision-prone robotic behaviors in unstructured construction site environments. In contrast, Imitation Learning (IL) offers a more robust and flexible skill transfer scheme. However, the majority of IL algorithms rely on human workers to repeatedly demonstrate task performance at full scale, which can be counterproductive and infeasible in the case of construction work. To address this concern, this paper proposes an immersive, cloud robotics-based virtual demonstration framework that serves two primary purposes. First, it digitalizes the demonstration process, eliminati",
    "link": "http://arxiv.org/abs/2309.11619",
    "context": "Title: Cloud-Based Hierarchical Imitation Learning for Scalable Transfer of Construction Skills from Human Workers to Assisting Robots. (arXiv:2309.11619v1 [cs.RO])\nAbstract: Assigning repetitive and physically-demanding construction tasks to robots can alleviate human workers's exposure to occupational injuries. Transferring necessary dexterous and adaptive artisanal construction craft skills from workers to robots is crucial for the successful delegation of construction tasks and achieving high-quality robot-constructed work. Predefined motion planning scripts tend to generate rigid and collision-prone robotic behaviors in unstructured construction site environments. In contrast, Imitation Learning (IL) offers a more robust and flexible skill transfer scheme. However, the majority of IL algorithms rely on human workers to repeatedly demonstrate task performance at full scale, which can be counterproductive and infeasible in the case of construction work. To address this concern, this paper proposes an immersive, cloud robotics-based virtual demonstration framework that serves two primary purposes. First, it digitalizes the demonstration process, eliminati",
    "path": "papers/23/09/2309.11619.json",
    "total_tokens": 937,
    "translated_title": "基于云的层次化模仿学习，实现从人类工人到辅助机器人的施工技能的可扩展转移",
    "translated_abstract": "将重复和体力要求高的施工任务分配给机器人可以减轻人类工人的职业伤害。将工人的巧妙和适应性的手工艺施工技能转移到机器人对于成功委托施工任务和实现高质量机器人施工工作至关重要。预定义的运动规划脚本往往会在非结构化的施工现场环境中生成僵硬且易碰撞的机器人行为。相比之下，模仿学习（IL）提供了一种更健壮和灵活的技能转移方案。然而，大多数IL算法依赖于人类工人反复展示完整的任务性能，这对于建筑工作来说可能是适得其反且不可行的。为了解决这个问题，本文提出了一种沉浸式的基于云机器人的虚拟演示框架，具备两个主要目的。第一，它数字化了演示过程，消除了时间和地点的限制，并提供了灵活的时间表以提高工人效率。",
    "tldr": "这项研究提出了一种基于云的层次化模仿学习的方法，用于将人类工人的施工技能转移到辅助机器人，并提出了一个沉浸式虚拟演示框架，用于提高施工效率。",
    "en_tdlr": "This study proposes a cloud-based hierarchical imitation learning approach for transferring construction skills from human workers to assisting robots, and introduces an immersive virtual demonstration framework to enhance construction efficiency."
}