{
    "title": "Meta OOD Learning for Continuously Adaptive OOD Detection. (arXiv:2309.11705v1 [cs.LG])",
    "abstract": "Out-of-distribution (OOD) detection is crucial to modern deep learning applications by identifying and alerting about the OOD samples that should not be tested or used for making predictions. Current OOD detection methods have made significant progress when in-distribution (ID) and OOD samples are drawn from static distributions. However, this can be unrealistic when applied to real-world systems which often undergo continuous variations and shifts in ID and OOD distributions over time. Therefore, for an effective application in real-world systems, the development of OOD detection methods that can adapt to these dynamic and evolving distributions is essential. In this paper, we propose a novel and more realistic setting called continuously adaptive out-of-distribution (CAOOD) detection which targets on developing an OOD detection model that enables dynamic and quick adaptation to a new arriving distribution, with insufficient ID samples during deployment time. To address CAOOD, we deve",
    "link": "http://arxiv.org/abs/2309.11705",
    "context": "Title: Meta OOD Learning for Continuously Adaptive OOD Detection. (arXiv:2309.11705v1 [cs.LG])\nAbstract: Out-of-distribution (OOD) detection is crucial to modern deep learning applications by identifying and alerting about the OOD samples that should not be tested or used for making predictions. Current OOD detection methods have made significant progress when in-distribution (ID) and OOD samples are drawn from static distributions. However, this can be unrealistic when applied to real-world systems which often undergo continuous variations and shifts in ID and OOD distributions over time. Therefore, for an effective application in real-world systems, the development of OOD detection methods that can adapt to these dynamic and evolving distributions is essential. In this paper, we propose a novel and more realistic setting called continuously adaptive out-of-distribution (CAOOD) detection which targets on developing an OOD detection model that enables dynamic and quick adaptation to a new arriving distribution, with insufficient ID samples during deployment time. To address CAOOD, we deve",
    "path": "papers/23/09/2309.11705.json",
    "total_tokens": 901,
    "translated_title": "基于元学习的持续适应性OOD检测",
    "translated_abstract": "识别和警报不应被测试或用于进行预测的OOD样本是现代深度学习应用的关键。目前的OOD检测方法在从静态分布中提取的ID和OOD样本上取得了显著进展。然而，当应用于现实世界系统时，这可能是不切实际的，因为ID和OOD分布往往会随着时间的推移发生持续的变化和转移。因此，为了在现实世界系统中有效应用，需要开发能够适应这些动态和演化分布的OOD检测方法是至关重要的。本文提出了一种新颖而更逼真的设置，称为持续适应性OOD检测（CAOOD），旨在开发一种OOD检测模型，能够在部署时动态快速地适应新到达的分布，并且在部署期间ID样本不足。为了解决CAOOD，我们开发了一种基于元学习的方法。",
    "tldr": "该论文提出了一种基于元学习的持续适应性OOD检测模型，针对现实世界系统中ID和OOD分布持续变化的问题，能够在部署时动态快速地适应新到达的分布，并且在部署期间ID样本不足。",
    "en_tdlr": "This paper proposes a meta-learning-based continuously adaptive out-of-distribution (CAOOD) detection model that addresses the challenge of continuously changing ID and OOD distributions in real-world systems. It enables dynamic and quick adaptation to new arriving distributions during deployment, even with insufficient ID samples."
}