{
    "title": "Ensemble Neural Networks for Remaining Useful Life (RUL) Prediction. (arXiv:2309.12445v1 [cs.LG])",
    "abstract": "A core part of maintenance planning is a monitoring system that provides a good prognosis on health and degradation, often expressed as remaining useful life (RUL). Most of the current data-driven approaches for RUL prediction focus on single-point prediction. These point prediction approaches do not include the probabilistic nature of the failure. The few probabilistic approaches to date either include the aleatoric uncertainty (which originates from the system), or the epistemic uncertainty (which originates from the model parameters), or both simultaneously as a total uncertainty. Here, we propose ensemble neural networks for probabilistic RUL predictions which considers both uncertainties and decouples these two uncertainties. These decoupled uncertainties are vital in knowing and interpreting the confidence of the predictions. This method is tested on NASA's turbofan jet engine CMAPSS data-set. Our results show how these uncertainties can be modeled and how to disentangle the cont",
    "link": "http://arxiv.org/abs/2309.12445",
    "context": "Title: Ensemble Neural Networks for Remaining Useful Life (RUL) Prediction. (arXiv:2309.12445v1 [cs.LG])\nAbstract: A core part of maintenance planning is a monitoring system that provides a good prognosis on health and degradation, often expressed as remaining useful life (RUL). Most of the current data-driven approaches for RUL prediction focus on single-point prediction. These point prediction approaches do not include the probabilistic nature of the failure. The few probabilistic approaches to date either include the aleatoric uncertainty (which originates from the system), or the epistemic uncertainty (which originates from the model parameters), or both simultaneously as a total uncertainty. Here, we propose ensemble neural networks for probabilistic RUL predictions which considers both uncertainties and decouples these two uncertainties. These decoupled uncertainties are vital in knowing and interpreting the confidence of the predictions. This method is tested on NASA's turbofan jet engine CMAPSS data-set. Our results show how these uncertainties can be modeled and how to disentangle the cont",
    "path": "papers/23/09/2309.12445.json",
    "total_tokens": 861,
    "translated_title": "基于集成神经网络的剩余寿命预测",
    "translated_abstract": "维护计划的核心部分是一个监测系统，它提供健康和退化的良好预测，通常被表示为剩余寿命(RUL)。目前大多数的数据驱动RUL预测方法都集中在单点预测上。这些点预测方法并没有考虑到故障的概率性质。到目前为止，少数的概率性方法要么包括来自系统的aleatoric不确定性，要么包括来自模型参数的epistemic不确定性，要么同时包含两者作为总的不确定性。在这里，我们提出了集成神经网络用于概率性RUL预测，考虑了这两种不确定性并将其解耦。这些解耦的不确定性在了解和解释预测的信心方面非常重要。这个方法在NASA的涡喷式发动机CMAPSS数据集上进行了测试。我们的结果展示了如何建模这些不确定性以及如何解开不确定性。",
    "tldr": "提出了一种使用集成神经网络的方法进行概率性剩余寿命预测，该方法解耦了来自系统和模型参数的不确定性，并且可以准确地建模和解释预测的信心。",
    "en_tdlr": "A method using ensemble neural networks for probabilistic remaining useful life (RUL) prediction is proposed, which decouples the uncertainties originating from the system and model parameters, and accurately models and interprets the confidence of predictions."
}