{
    "title": "MvFS: Multi-view Feature Selection for Recommender System. (arXiv:2309.02064v2 [cs.IR] UPDATED)",
    "abstract": "Feature selection, which is a technique to select key features in recommender systems, has received increasing research attention. Recently, Adaptive Feature Selection (AdaFS) has shown remarkable performance by adaptively selecting features for each data instance, considering that the importance of a given feature field can vary significantly across data. However, this method still has limitations in that its selection process could be easily biased to major features that frequently occur. To address these problems, we propose Multi-view Feature Selection (MvFS), which selects informative features for each instance more effectively. Most importantly, MvFS employs a multi-view network consisting of multiple sub-networks, each of which learns to measure the feature importance of a part of data with different feature patterns. By doing so, MvFS mitigates the bias problem towards dominant patterns and promotes a more balanced feature selection process. Moreover, MvFS adopts an effective i",
    "link": "http://arxiv.org/abs/2309.02064",
    "context": "Title: MvFS: Multi-view Feature Selection for Recommender System. (arXiv:2309.02064v2 [cs.IR] UPDATED)\nAbstract: Feature selection, which is a technique to select key features in recommender systems, has received increasing research attention. Recently, Adaptive Feature Selection (AdaFS) has shown remarkable performance by adaptively selecting features for each data instance, considering that the importance of a given feature field can vary significantly across data. However, this method still has limitations in that its selection process could be easily biased to major features that frequently occur. To address these problems, we propose Multi-view Feature Selection (MvFS), which selects informative features for each instance more effectively. Most importantly, MvFS employs a multi-view network consisting of multiple sub-networks, each of which learns to measure the feature importance of a part of data with different feature patterns. By doing so, MvFS mitigates the bias problem towards dominant patterns and promotes a more balanced feature selection process. Moreover, MvFS adopts an effective i",
    "path": "papers/23/09/2309.02064.json",
    "total_tokens": 912,
    "translated_title": "MvFS: 多视图特征选择用于推荐系统",
    "translated_abstract": "特征选择是推荐系统中选择关键特征的技术，近年来受到越来越多的研究关注。最近，自适应特征选择（AdaFS）通过针对每个数据实例自适应地选择特征，考虑到给定特征字段的重要性在数据中可以有显著差异，显示了显著的性能。然而，这种方法在选择过程中仍然存在容易偏向频繁出现的主要特征的限制。为了解决这些问题，我们提出了多视图特征选择（MvFS），它更有效地为每个实例选择信息丰富的特征。最重要的是，MvFS采用了一个多视图网络，由多个子网络组成，每个子网络学习如何测量具有不同特征模式的数据的特征重要性。通过这样做，MvFS缓解了朝向主导模式的偏见问题，并促进了更平衡的特征选择过程。此外，MvFS采用了一种有效的i",
    "tldr": "MvFS提出了一种多视图特征选择方法，通过采用多个子网络测量具有不同特征模式的数据的特征重要性，从而更有效地选择每个实例的信息丰富的特征，并解决了当前方法对频繁出现特征的偏向问题。"
}