{
    "title": "On the Local Quadratic Stability of T-S Fuzzy Systems in the Vicinity of the Origin. (arXiv:2309.06841v1 [eess.SY])",
    "abstract": "The main goal of this paper is to introduce new local stability conditions for continuous-time Takagi-Sugeno (T-S) fuzzy systems. These stability conditions are based on linear matrix inequalities (LMIs) in combination with quadratic Lyapunov functions. Moreover, they integrate information on the membership functions at the origin and effectively leverage the linear structure of the underlying nonlinear system in the vicinity of the origin. As a result, the proposed conditions are proved to be less conservative compared to existing methods using fuzzy Lyapunov functions in the literature. Moreover, we establish that the proposed methods offer necessary and sufficient conditions for the local exponential stability of T-S fuzzy systems. The paper also includes discussions on the inherent limitations associated with fuzzy Lyapunov approaches. To demonstrate the theoretical results, we provide comprehensive examples that elucidate the core concepts and validate the efficacy of the proposed",
    "link": "http://arxiv.org/abs/2309.06841",
    "context": "Title: On the Local Quadratic Stability of T-S Fuzzy Systems in the Vicinity of the Origin. (arXiv:2309.06841v1 [eess.SY])\nAbstract: The main goal of this paper is to introduce new local stability conditions for continuous-time Takagi-Sugeno (T-S) fuzzy systems. These stability conditions are based on linear matrix inequalities (LMIs) in combination with quadratic Lyapunov functions. Moreover, they integrate information on the membership functions at the origin and effectively leverage the linear structure of the underlying nonlinear system in the vicinity of the origin. As a result, the proposed conditions are proved to be less conservative compared to existing methods using fuzzy Lyapunov functions in the literature. Moreover, we establish that the proposed methods offer necessary and sufficient conditions for the local exponential stability of T-S fuzzy systems. The paper also includes discussions on the inherent limitations associated with fuzzy Lyapunov approaches. To demonstrate the theoretical results, we provide comprehensive examples that elucidate the core concepts and validate the efficacy of the proposed",
    "path": "papers/23/09/2309.06841.json",
    "total_tokens": 936,
    "translated_title": "关于T-S模糊系统在原点附近的局部二次稳定性的研究",
    "translated_abstract": "本文的主要目标是引入新的局部稳定性条件，用于连续时间的Takagi-Sugeno（T-S）模糊系统。这些稳定性条件基于线性矩阵不等式（LMIs）和二次Lyapunov函数。此外，它们结合了原点处的隶属函数信息，并有效利用了原点附近的非线性系统的线性结构。因此，与文献中使用模糊Lyapunov函数的现有方法相比，提出的条件证明了更少的保守性。此外，我们证明了提出的方法提供了T-S模糊系统局部指数稳定性的必要和充分条件。本文还讨论了模糊Lyapunov方法的固有限制。为了演示理论结果，我们提供了详细的示例，阐明了核心概念，并验证了所提方法的有效性。",
    "tldr": "本文介绍了一种新的局部稳定性条件，该条件基于线性矩阵不等式和二次Lyapunov函数，并结合了原点附近的非线性系统的线性结构，相比于现有方法更为准确和有效。同时，本文还提出了局部指数稳定性的必要和充分条件，并讨论了模糊Lyapunov方法的局限性。",
    "en_tdlr": "This paper introduces new local stability conditions for continuous-time Takagi-Sugeno (T-S) fuzzy systems based on linear matrix inequalities and quadratic Lyapunov functions, which consider the linear structure of the system and improve accuracy compared to existing methods using fuzzy Lyapunov functions. It also provides necessary and sufficient conditions for the local exponential stability of T-S fuzzy systems and discusses the limitations of fuzzy Lyapunov approaches."
}