{
    "title": "Discovering Utility-driven Interval Rules. (arXiv:2309.16102v1 [cs.AI])",
    "abstract": "For artificial intelligence, high-utility sequential rule mining (HUSRM) is a knowledge discovery method that can reveal the associations between events in the sequences. Recently, abundant methods have been proposed to discover high-utility sequence rules. However, the existing methods are all related to point-based sequences. Interval events that persist for some time are common. Traditional interval-event sequence knowledge discovery tasks mainly focus on pattern discovery, but patterns cannot reveal the correlation between interval events well. Moreover, the existing HUSRM algorithms cannot be directly applied to interval-event sequences since the relation in interval-event sequences is much more intricate than those in point-based sequences. In this work, we propose a utility-driven interval rule mining (UIRMiner) algorithm that can extract all utility-driven interval rules (UIRs) from the interval-event sequence database to solve the problem. In UIRMiner, we first introduce a num",
    "link": "http://arxiv.org/abs/2309.16102",
    "context": "Title: Discovering Utility-driven Interval Rules. (arXiv:2309.16102v1 [cs.AI])\nAbstract: For artificial intelligence, high-utility sequential rule mining (HUSRM) is a knowledge discovery method that can reveal the associations between events in the sequences. Recently, abundant methods have been proposed to discover high-utility sequence rules. However, the existing methods are all related to point-based sequences. Interval events that persist for some time are common. Traditional interval-event sequence knowledge discovery tasks mainly focus on pattern discovery, but patterns cannot reveal the correlation between interval events well. Moreover, the existing HUSRM algorithms cannot be directly applied to interval-event sequences since the relation in interval-event sequences is much more intricate than those in point-based sequences. In this work, we propose a utility-driven interval rule mining (UIRMiner) algorithm that can extract all utility-driven interval rules (UIRs) from the interval-event sequence database to solve the problem. In UIRMiner, we first introduce a num",
    "path": "papers/23/09/2309.16102.json",
    "total_tokens": 825,
    "translated_title": "发现基于效用的区间规则",
    "translated_abstract": "对于人工智能来说，高效用序列规则挖掘（HUSRM）是一种能够揭示序列中事件之间关联的知识发现方法。最近，已经提出了丰富的方法来发现高效用序列规则。然而，现有的方法都与基于点的序列相关。存在一些持续一段时间的区间事件。传统的区间事件序列知识发现任务主要关注模式发现，但是模式无法很好地揭示区间事件之间的相关性。此外，现有的HUSRM算法无法直接应用于区间事件序列，因为区间事件序列中的关联要比基于点的序列复杂得多。在这项工作中，我们提出了一种基于效用的区间规则挖掘（UIRMiner）算法，可以从区间事件序列数据库中提取所有基于效用的区间规则（UIRs）来解决这个问题。",
    "tldr": "本研究提出了一种基于效用的区间规则挖掘算法（UIRMiner），可以从区间事件序列数据库中提取所有基于效用的区间规则（UIRs），进一步揭示事件之间的关联性。"
}