{
    "title": "Disruption Detection for a Cognitive Digital Supply Chain Twin Using Hybrid Deep Learning. (arXiv:2309.14557v1 [cs.LG])",
    "abstract": "Purpose: Recent disruptive events, such as COVID-19 and Russia-Ukraine conflict, had a significant impact of global supply chains. Digital supply chain twins have been proposed in order to provide decision makers with an effective and efficient tool to mitigate disruption impact. Methods: This paper introduces a hybrid deep learning approach for disruption detection within a cognitive digital supply chain twin framework to enhance supply chain resilience. The proposed disruption detection module utilises a deep autoencoder neural network combined with a one-class support vector machine algorithm. In addition, long-short term memory neural network models are developed to identify the disrupted echelon and predict time-to-recovery from the disruption effect. Results: The obtained information from the proposed approach will help decision-makers and supply chain practitioners make appropriate decisions aiming at minimizing negative impact of disruptive events based on real-time disruption ",
    "link": "http://arxiv.org/abs/2309.14557",
    "context": "Title: Disruption Detection for a Cognitive Digital Supply Chain Twin Using Hybrid Deep Learning. (arXiv:2309.14557v1 [cs.LG])\nAbstract: Purpose: Recent disruptive events, such as COVID-19 and Russia-Ukraine conflict, had a significant impact of global supply chains. Digital supply chain twins have been proposed in order to provide decision makers with an effective and efficient tool to mitigate disruption impact. Methods: This paper introduces a hybrid deep learning approach for disruption detection within a cognitive digital supply chain twin framework to enhance supply chain resilience. The proposed disruption detection module utilises a deep autoencoder neural network combined with a one-class support vector machine algorithm. In addition, long-short term memory neural network models are developed to identify the disrupted echelon and predict time-to-recovery from the disruption effect. Results: The obtained information from the proposed approach will help decision-makers and supply chain practitioners make appropriate decisions aiming at minimizing negative impact of disruptive events based on real-time disruption ",
    "path": "papers/23/09/2309.14557.json",
    "total_tokens": 940,
    "translated_title": "使用混合深度学习进行认知数字供应链双胞胎的打乱检测",
    "translated_abstract": "目的：近期的打乱事件，如COVID-19和俄乌冲突，对全球供应链产生了重大影响。数字供应链双胞胎被提出，以为决策者提供有效和高效的工具来减轻打乱影响。方法：本文介绍了一种混合深度学习方法，用于在认知数字供应链双胞胎框架中进行打乱检测，以增强供应链的韧性。所提出的打乱检测模块利用深度自编码器神经网络结合一类支持向量机算法。此外，开发了长短时记忆神经网络模型，用于识别受到打乱影响的阶层并预测恢复时间。结果：所提出方法获取的信息将帮助决策者和供应链实践者根据实时的打乱情况做出适当的决策，以最小化打乱事件的负面影响。",
    "tldr": "本文介绍了一种使用混合深度学习的方法，用于在认知数字供应链双胞胎框架中进行打乱检测，以增强供应链的韧性。所提出的方法在实时的打乱情况下，能够帮助决策者和供应链实践者做出适当的决策，以最小化打乱事件的负面影响。",
    "en_tdlr": "This paper introduces a hybrid deep learning approach for disruption detection within a cognitive digital supply chain twin framework to enhance supply chain resilience. The proposed method can help decision-makers and supply chain practitioners make appropriate decisions based on real-time disruptions, aiming to minimize the negative impact of disruptive events."
}