{
    "title": "Modified Lagrangian Formulation of Gear Tooth Crack Analysis using Combined Approach of Variable Mode Decomposition (VMD) and Time Synchronous Averaging (TSA). (arXiv:2309.00641v1 [eess.SY])",
    "abstract": "This paper discusses the possible observation of an integrated gear tooth crack analysis procedure that employs the combined approach of variable mode decomposition (VMD) and time synchronous averaging (TSA) based on the coupled electromechanical gearbox (CEMG) system. This paper also incorporates the modified Lagrangian formulation to model the CEMG system by considering Rayleigh's dissipative potential. An analytical improved time-varying mesh stiffness (IAM-TVMS) with different levels of gear tooth crack depts is also incorporated into the CEMG system to inspect the influence of cracks on the system's dynamic behavior. Dynamic responses of the CEMG system with different tooth crack levels have been used for further investigations. For the first time, the integrated approach of variable mode decomposition (VMD) and time-synchronous averaging (TSA) has been presented to analyze the dynamic behaviour of CEMG systems at the different gear tooth cracks have been experienced as non-statio",
    "link": "http://arxiv.org/abs/2309.00641",
    "context": "Title: Modified Lagrangian Formulation of Gear Tooth Crack Analysis using Combined Approach of Variable Mode Decomposition (VMD) and Time Synchronous Averaging (TSA). (arXiv:2309.00641v1 [eess.SY])\nAbstract: This paper discusses the possible observation of an integrated gear tooth crack analysis procedure that employs the combined approach of variable mode decomposition (VMD) and time synchronous averaging (TSA) based on the coupled electromechanical gearbox (CEMG) system. This paper also incorporates the modified Lagrangian formulation to model the CEMG system by considering Rayleigh's dissipative potential. An analytical improved time-varying mesh stiffness (IAM-TVMS) with different levels of gear tooth crack depts is also incorporated into the CEMG system to inspect the influence of cracks on the system's dynamic behavior. Dynamic responses of the CEMG system with different tooth crack levels have been used for further investigations. For the first time, the integrated approach of variable mode decomposition (VMD) and time-synchronous averaging (TSA) has been presented to analyze the dynamic behaviour of CEMG systems at the different gear tooth cracks have been experienced as non-statio",
    "path": "papers/23/09/2309.00641.json",
    "total_tokens": 987,
    "translated_title": "使用变模分解（VMD）和时同步平均（TSA）组合方法的齿轮齿裂分析的改进拉格朗日公式（Lagrangian Formulation）（arXiv:2309.00641v1 [eess.SY]）",
    "translated_abstract": "本文讨论了一个采用变模分解（VMD）和时同步平均（TSA）的组合方法的整合齿轮齿裂分析程序，该程序基于耦合电机-机械变速器（CEMG）系统。本文还结合了改进的拉格朗日公式，通过考虑Rayleigh的耗散势来模拟CEMG系统。同时，将具有不同齿轮齿裂深度的分析改进的时变啮合刚度（IAM-TVMS）也纳入到CEMG系统中，以检查裂纹对系统动态行为的影响。分析了不同齿轮齿裂水平的CEMG系统的动态响应，进一步研究了VMD和TSA的整合方法首次应用于分析CEMG系统的动态行为，纳入了不同齿轮齿裂。",
    "tldr": "本论文介绍了一个整合了变模分解（VMD）和时同步平均（TSA）的方法，用于分析耦合电机-机械变速器（CEMG）系统中的齿轮齿裂。通过改进的拉格朗日公式和时变啮合刚度模型，研究了裂纹对系统动态行为的影响。",
    "en_tdlr": "This paper presents an integrated approach using variable mode decomposition (VMD) and time synchronous averaging (TSA) for analyzing gear tooth crack in coupled electromechanical gearbox (CEMG) systems. The modified Lagrangian formulation and time-varying mesh stiffness model are applied to investigate the influence of cracks on the system's dynamic behavior."
}