{
    "title": "Complex-Valued Neural Networks for Data-Driven Signal Processing and Signal Understanding. (arXiv:2309.07948v1 [eess.SP])",
    "abstract": "Complex-valued neural networks have emerged boasting superior modeling performance for many tasks across the signal processing, sensing, and communications arenas. However, developing complex-valued models currently demands development of basic deep learning operations, such as linear or convolution layers, as modern deep learning frameworks like PyTorch and Tensor flow do not adequately support complex-valued neural networks. This paper overviews a package built on PyTorch with the intention of implementing light-weight interfaces for common complex-valued neural network operations and architectures. Similar to natural language understanding (NLU), which as recently made tremendous leaps towards text-based intelligence, RF Signal Understanding (RFSU) is a promising field extending conventional signal processing algorithms using a hybrid approach of signal mechanics-based insight with data-driven modeling power. Notably, we include efficient implementations for linear, convolution, and",
    "link": "http://arxiv.org/abs/2309.07948",
    "context": "Title: Complex-Valued Neural Networks for Data-Driven Signal Processing and Signal Understanding. (arXiv:2309.07948v1 [eess.SP])\nAbstract: Complex-valued neural networks have emerged boasting superior modeling performance for many tasks across the signal processing, sensing, and communications arenas. However, developing complex-valued models currently demands development of basic deep learning operations, such as linear or convolution layers, as modern deep learning frameworks like PyTorch and Tensor flow do not adequately support complex-valued neural networks. This paper overviews a package built on PyTorch with the intention of implementing light-weight interfaces for common complex-valued neural network operations and architectures. Similar to natural language understanding (NLU), which as recently made tremendous leaps towards text-based intelligence, RF Signal Understanding (RFSU) is a promising field extending conventional signal processing algorithms using a hybrid approach of signal mechanics-based insight with data-driven modeling power. Notably, we include efficient implementations for linear, convolution, and",
    "path": "papers/23/09/2309.07948.json",
    "total_tokens": 861,
    "translated_title": "基于复数的神经网络用于数据驱动的信号处理和信号理解",
    "translated_abstract": "复数值神经网络已经出现，对于信号处理、感知和通信领域的许多任务具有卓越的建模性能。然而，目前发展复数值模型需要开发基本的深度学习操作，例如线性或卷积层，因为现代的深度学习框架如PyTorch和TensorFlow对于复数值神经网络的支持不足。本文概述了一个建立在PyTorch上的软件包，旨在实现常见复数值神经网络操作和架构的轻量级接口。类似于自然语言理解（NLU）最近在基于文本的智能方面取得了巨大进展，射频信号理解（RFSU）是一个有前途的领域，它使用信号力学基础洞察力与数据驱动建模能力的混合方法扩展了传统信号处理算法。值得注意的是，我们包括了线性、卷积和...",
    "tldr": "该论文介绍了一个基于PyTorch构建的软件包，用于实现复数值神经网络操作和架构的轻量级接口。该软件包的目标是为信号处理、感知和通信等领域提供高效的复数值模型支持。",
    "en_tdlr": "This paper introduces a lightweight package built on PyTorch, which provides efficient support for complex-valued neural networks operations and architectures in the fields of signal processing, sensing, and communications."
}