{
    "title": "Semantic and Articulated Pedestrian Sensing Onboard a Moving Vehicle. (arXiv:2309.06313v1 [cs.CV])",
    "abstract": "It is difficult to perform 3D reconstruction from on-vehicle gathered video due to the large forward motion of the vehicle. Even object detection and human sensing models perform significantly worse on onboard videos when compared to standard benchmarks because objects often appear far away from the camera compared to the standard object detection benchmarks, image quality is often decreased by motion blur and occlusions occur often. This has led to the popularisation of traffic data-specific benchmarks. Recently Light Detection And Ranging (LiDAR) sensors have become popular to directly estimate depths without the need to perform 3D reconstructions. However, LiDAR-based methods still lack in articulated human detection at a distance when compared to image-based methods. We hypothesize that benchmarks targeted at articulated human sensing from LiDAR data could bring about increased research in human sensing and prediction in traffic and could lead to improved traffic safety for pedestr",
    "link": "http://arxiv.org/abs/2309.06313",
    "context": "Title: Semantic and Articulated Pedestrian Sensing Onboard a Moving Vehicle. (arXiv:2309.06313v1 [cs.CV])\nAbstract: It is difficult to perform 3D reconstruction from on-vehicle gathered video due to the large forward motion of the vehicle. Even object detection and human sensing models perform significantly worse on onboard videos when compared to standard benchmarks because objects often appear far away from the camera compared to the standard object detection benchmarks, image quality is often decreased by motion blur and occlusions occur often. This has led to the popularisation of traffic data-specific benchmarks. Recently Light Detection And Ranging (LiDAR) sensors have become popular to directly estimate depths without the need to perform 3D reconstructions. However, LiDAR-based methods still lack in articulated human detection at a distance when compared to image-based methods. We hypothesize that benchmarks targeted at articulated human sensing from LiDAR data could bring about increased research in human sensing and prediction in traffic and could lead to improved traffic safety for pedestr",
    "path": "papers/23/09/2309.06313.json",
    "total_tokens": 972,
    "translated_title": "在行驶车辆上的语义和关节人体感知",
    "translated_abstract": "由于车辆的大量前进运动，从车载视频中进行3D重建非常困难。即使与标准基准相比，物体检测和人体感知模型在车载视频上的表现也明显较差，因为与标准物体检测基准相比，物体往往距离摄像机较远，图像质量常常受到运动模糊的影响，且经常发生遮挡。这导致交通数据特定的基准的普及。最近，光检测与测距（LiDAR）传感器已经在直接估计深度方面变得流行，而无需进行3D重建。然而，与基于图像的方法相比，基于LiDAR的方法在远程关节人体检测方面仍然不足。我们假设针对LiDAR数据中的关节人体感知的基准可以促进人体感知和交通预测方面的增加研究，并有可能提高行人交通安全性。",
    "tldr": "该论文研究了在行驶车辆上进行语义和关节人体感知的挑战，指出车载视频的大量前进运动导致难以进行3D重建，以及物体检测和人体感知模型在车载视频上表现较差的原因。作者提出通过LiDAR数据进行关节人体感知的基准可以促进人体感知和交通预测的研究，并有可能提高行人交通安全性。"
}