{
    "title": "EarthPT: a foundation model for Earth Observation. (arXiv:2309.07207v1 [cs.LG])",
    "abstract": "We introduce EarthPT -- an Earth Observation (EO) pretrained transformer. EarthPT is a 700 million parameter decoding transformer foundation model trained in an autoregressive self-supervised manner and developed specifically with EO use-cases in mind. We demonstrate that EarthPT is an effective forecaster that can accurately predict future pixel-level surface reflectances across the 400-2300 nm range well into the future. For example, forecasts of the evolution of the Normalised Difference Vegetation Index (NDVI) have a typical error of approximately 0.05 (over a natural range of -1 -> 1) at the pixel level over a five month test set horizon, out-performing simple phase-folded models based on historical averaging. We also demonstrate that embeddings learnt by EarthPT hold semantically meaningful information and could be exploited for downstream tasks such as highly granular, dynamic land use classification. Excitingly, we note that the abundance of EO data provides us with -- in theor",
    "link": "http://arxiv.org/abs/2309.07207",
    "context": "Title: EarthPT: a foundation model for Earth Observation. (arXiv:2309.07207v1 [cs.LG])\nAbstract: We introduce EarthPT -- an Earth Observation (EO) pretrained transformer. EarthPT is a 700 million parameter decoding transformer foundation model trained in an autoregressive self-supervised manner and developed specifically with EO use-cases in mind. We demonstrate that EarthPT is an effective forecaster that can accurately predict future pixel-level surface reflectances across the 400-2300 nm range well into the future. For example, forecasts of the evolution of the Normalised Difference Vegetation Index (NDVI) have a typical error of approximately 0.05 (over a natural range of -1 -> 1) at the pixel level over a five month test set horizon, out-performing simple phase-folded models based on historical averaging. We also demonstrate that embeddings learnt by EarthPT hold semantically meaningful information and could be exploited for downstream tasks such as highly granular, dynamic land use classification. Excitingly, we note that the abundance of EO data provides us with -- in theor",
    "path": "papers/23/09/2309.07207.json",
    "total_tokens": 837,
    "translated_title": "EarthPT：地球观测的基础模型",
    "translated_abstract": "我们介绍了EarthPT - 一种地球观测(EO)预训练的transformer模型。EarthPT是一个7亿参数的解码transformer基础模型，以自监督的方式进行训练，并专门针对EO应用进行开发。我们证明EarthPT是一个有效的预测模型，可以准确地预测未来400-2300 nm范围内的像素级地表反射值。例如，在一个为期五个月的测试数据集上，地表植被指数（NDVI）的演变预测的典型误差约为0.05（在-1 -> 1的自然范围内），性能超过基于历史平均的简单相位折叠模型。我们还证明了EarthPT学到的嵌入具有语义上有意义的信息，并且可以用于下游任务，如高精度、动态的土地利用分类。令人兴奋的是，我们注意到EO数据的丰富性提供了理论上的...",
    "tldr": "EarthPT是一个地球观测的预训练transformer模型，能够准确预测未来地表反射值，并提供有意义的嵌入信息用于下游任务。"
}