{
    "title": "Streamlined Data Fusion: Unleashing the Power of Linear Combination with Minimal Relevance Judgments. (arXiv:2309.04981v1 [cs.IR])",
    "abstract": "Linear combination is a potent data fusion method in information retrieval tasks, thanks to its ability to adjust weights for diverse scenarios. However, achieving optimal weight training has traditionally required manual relevance judgments on a large percentage of documents, a labor-intensive and expensive process. In this study, we investigate the feasibility of obtaining near-optimal weights using a mere 20\\%-50\\% of relevant documents. Through experiments on four TREC datasets, we find that weights trained with multiple linear regression using this reduced set closely rival those obtained with TREC's official \"qrels.\" Our findings unlock the potential for more efficient and affordable data fusion, empowering researchers and practitioners to reap its full benefits with significantly less effort.",
    "link": "http://arxiv.org/abs/2309.04981",
    "context": "Title: Streamlined Data Fusion: Unleashing the Power of Linear Combination with Minimal Relevance Judgments. (arXiv:2309.04981v1 [cs.IR])\nAbstract: Linear combination is a potent data fusion method in information retrieval tasks, thanks to its ability to adjust weights for diverse scenarios. However, achieving optimal weight training has traditionally required manual relevance judgments on a large percentage of documents, a labor-intensive and expensive process. In this study, we investigate the feasibility of obtaining near-optimal weights using a mere 20\\%-50\\% of relevant documents. Through experiments on four TREC datasets, we find that weights trained with multiple linear regression using this reduced set closely rival those obtained with TREC's official \"qrels.\" Our findings unlock the potential for more efficient and affordable data fusion, empowering researchers and practitioners to reap its full benefits with significantly less effort.",
    "path": "papers/23/09/2309.04981.json",
    "total_tokens": 819,
    "translated_title": "精简数据融合: 以最少的相关性判断释放线性组合的力量",
    "translated_abstract": "线性组合是信息检索任务中一种强大的数据融合方法，它能够根据不同的情境调整权重。然而，传统上实现最优权重训练通常需要对大部分文档进行人工相关性判断，这是一项费时费力的过程。在本研究中，我们探讨了仅使用20％-50％的相关文档获取接近最优权重的可行性。通过对四个TREC数据集进行实验，我们发现使用这种减少的数据集进行多元线性回归训练得到的权重与使用TREC官方\"qrels\"得到的权重非常接近。我们的研究结果揭示了更高效、更经济的数据融合潜力，使研究人员和从业者能够在更少的工作量下充分享受其所带来的好处。",
    "tldr": "本研究发现，仅使用20％-50％的相关文档，通过多元线性回归训练得到的权重与使用传统方法得到的权重非常接近，从而实现了更高效和可负担的数据融合方法。",
    "en_tdlr": "This study found that using only 20%-50% of relevant documents, weights trained with multiple linear regression closely rival those obtained with traditional methods, thus enabling a more efficient and affordable data fusion approach."
}