{
    "title": "Bayesian longitudinal tensor response regression for modeling neuroplasticity. (arXiv:2309.10065v1 [q-bio.NC])",
    "abstract": "A major interest in longitudinal neuroimaging studies involves investigating voxel-level neuroplasticity due to treatment and other factors across visits. However, traditional voxel-wise methods are beset with several pitfalls, which can compromise the accuracy of these approaches. We propose a novel Bayesian tensor response regression approach for longitudinal imaging data, which pools information across spatially-distributed voxels to infer significant changes while adjusting for covariates. The proposed method, which is implemented using Markov chain Monte Carlo (MCMC) sampling, utilizes low-rank decomposition to reduce dimensionality and preserve spatial configurations of voxels when estimating coefficients. It also enables feature selection via joint credible regions which respect the shape of the posterior distributions for more accurate inference. In addition to group level inferences, the method is able to infer individual-level neuroplasticity, allowing for examination of pers",
    "link": "http://arxiv.org/abs/2309.10065",
    "context": "Title: Bayesian longitudinal tensor response regression for modeling neuroplasticity. (arXiv:2309.10065v1 [q-bio.NC])\nAbstract: A major interest in longitudinal neuroimaging studies involves investigating voxel-level neuroplasticity due to treatment and other factors across visits. However, traditional voxel-wise methods are beset with several pitfalls, which can compromise the accuracy of these approaches. We propose a novel Bayesian tensor response regression approach for longitudinal imaging data, which pools information across spatially-distributed voxels to infer significant changes while adjusting for covariates. The proposed method, which is implemented using Markov chain Monte Carlo (MCMC) sampling, utilizes low-rank decomposition to reduce dimensionality and preserve spatial configurations of voxels when estimating coefficients. It also enables feature selection via joint credible regions which respect the shape of the posterior distributions for more accurate inference. In addition to group level inferences, the method is able to infer individual-level neuroplasticity, allowing for examination of pers",
    "path": "papers/23/09/2309.10065.json",
    "total_tokens": 972,
    "translated_title": "基于贝叶斯纵向张量响应回归的神经可塑性建模",
    "translated_abstract": "纵向神经影像研究中对于由治疗和其他因素引起的体素级神经可塑性的调查是一个重要的研究兴趣。然而，传统的体素级方法存在一些缺陷，可能会影响这些方法的准确性。我们提出一种新颖的基于贝叶斯张量响应回归的纵向影像数据建模方法，通过汇集空间分布的体素信息来推断显著的变化，并对协变量进行调整。该方法采用马尔科夫链蒙特卡洛（MCMC）采样实现，利用低秩分解来减少维度并保持估计系数中体素的空间配置。它还通过满足后验分布形状的联合可信区域实现特征选择，以实现更准确的推断。除了群体水平的推断，该方法还能够推断个体水平的神经可塑性，从而可以进行个体水平的分析。",
    "tldr": "提出了一种基于贝叶斯纵向张量响应回归的新方法，利用汇集空间分布的体素信息来推断显著的变化，并对协变量进行调整。该方法使用马尔科夫链蒙特卡洛采样，利用低秩分解减少维度并保持维度的空间配置，通过满足后验分布形状的联合可信区域实现特征选择，从而实现更准确的推断。",
    "en_tdlr": "A novel Bayesian longitudinal tensor response regression approach is proposed to infer significant changes in voxel-level neuroplasticity while adjusting for covariates. The method utilizes low-rank decomposition and joint credible regions to reduce dimensionality and enable feature selection, resulting in more accurate inference."
}