{
    "title": "Real-time VaR Calculations for Crypto Derivatives in kdb+/q. (arXiv:2309.06393v1 [q-fin.ST])",
    "abstract": "Cryptocurrency market is known for exhibiting significantly higher volatility than traditional asset classes. Efficient and adequate risk calculation is vital for managing risk exposures in such market environments where extreme price fluctuations occur in short timeframes. The objective of this thesis is to build a real-time computation workflow that provides VaR estimates for non-linear portfolios of cryptocurrency derivatives. Many researchers have examined the predictive capabilities of time-series models within the context of cryptocurrencies. In this work, we applied three commonly used models EMWA, GARCH and HAR - to capture and forecast volatility dynamics, in conjunction with delta-gamma-theta approach and Cornish-Fisher expansion to crypto derivatives, examining their performance from the perspectives of calculation efficiency and accuracy. We present a calculation workflow which harnesses the information embedded in high-frequency market data and the computation simplicity",
    "link": "http://arxiv.org/abs/2309.06393",
    "context": "Title: Real-time VaR Calculations for Crypto Derivatives in kdb+/q. (arXiv:2309.06393v1 [q-fin.ST])\nAbstract: Cryptocurrency market is known for exhibiting significantly higher volatility than traditional asset classes. Efficient and adequate risk calculation is vital for managing risk exposures in such market environments where extreme price fluctuations occur in short timeframes. The objective of this thesis is to build a real-time computation workflow that provides VaR estimates for non-linear portfolios of cryptocurrency derivatives. Many researchers have examined the predictive capabilities of time-series models within the context of cryptocurrencies. In this work, we applied three commonly used models EMWA, GARCH and HAR - to capture and forecast volatility dynamics, in conjunction with delta-gamma-theta approach and Cornish-Fisher expansion to crypto derivatives, examining their performance from the perspectives of calculation efficiency and accuracy. We present a calculation workflow which harnesses the information embedded in high-frequency market data and the computation simplicity",
    "path": "papers/23/09/2309.06393.json",
    "total_tokens": 954,
    "translated_title": "在kdb+/q中进行加密衍生品的实时VaR计算",
    "translated_abstract": "加密货币市场以显著高于传统资产类别的波动性而闻名。在这种短时间内出现极端价格波动的市场环境中，高效且充分的风险计算对于管理风险暴露至关重要。本论文旨在构建一个实时计算工作流，为加密货币衍生品的非线性投资组合提供VaR估计。许多研究人员在加密货币的上下文中研究了时间序列模型的预测能力。在本研究中，我们应用了三种常用模型EMWA、GARCH和HAR来捕捉和预测波动性动态，结合了Delta-Gamma-Theta方法和Cornish-Fisher扩展对加密货币衍生品进行估值，从计算效率和准确性的角度对它们的表现进行了考察。我们提出了一个计算工作流，利用高频市场数据中Embedded的信息和计算的简易性。",
    "tldr": "本论文构建了一个实时计算工作流，用于提供加密货币衍生品非线性投资组合的VaR估计。通过应用EMWA、GARCH和HAR模型捕捉和预测波动性动态，并结合Delta-Gamma-Theta方法和Cornish-Fisher扩展对加密货币衍生品进行估值，评估了计算效率和准确性。该工作流利用高频市场数据中的信息和简易计算方式。"
}