{
    "title": "A dynamic systems approach to harness the potential of social tipping. (arXiv:2309.14964v1 [econ.GN])",
    "abstract": "Social tipping points are promising levers to achieve net-zero greenhouse gas emission targets. They describe how social, political, economic or technological systems can move rapidly into a new state if cascading positive feedback mechanisms are triggered. Analysing the potential of social tipping for rapid decarbonization requires considering the inherent complexity of social systems. Here, we identify that existing scientific literature is inclined to a narrative-based account of social tipping, lacks a broad empirical framework and a multi-systems view. We subsequently outline a dynamic systems approach that entails (i) a systems outlook involving interconnected feedback mechanisms alongside cross-system and cross-scale interactions, and including a socioeconomic and environmental injustice perspective (ii) directed data collection efforts to provide empirical evidence for and monitor social tipping dynamics, (iii) global, integrated, descriptive modelling to project future dynamic",
    "link": "http://arxiv.org/abs/2309.14964",
    "context": "Title: A dynamic systems approach to harness the potential of social tipping. (arXiv:2309.14964v1 [econ.GN])\nAbstract: Social tipping points are promising levers to achieve net-zero greenhouse gas emission targets. They describe how social, political, economic or technological systems can move rapidly into a new state if cascading positive feedback mechanisms are triggered. Analysing the potential of social tipping for rapid decarbonization requires considering the inherent complexity of social systems. Here, we identify that existing scientific literature is inclined to a narrative-based account of social tipping, lacks a broad empirical framework and a multi-systems view. We subsequently outline a dynamic systems approach that entails (i) a systems outlook involving interconnected feedback mechanisms alongside cross-system and cross-scale interactions, and including a socioeconomic and environmental injustice perspective (ii) directed data collection efforts to provide empirical evidence for and monitor social tipping dynamics, (iii) global, integrated, descriptive modelling to project future dynamic",
    "path": "papers/23/09/2309.14964.json",
    "total_tokens": 869,
    "translated_title": "动态系统方法来利用社会转折的潜力",
    "translated_abstract": "社会转折点是实现净零温室气体排放目标的有希望的手段。如果触发级联的正反馈机制，它们描述了社会、政治、经济或技术系统如何迅速转入新状态。分析社会转折对快速脱碳的潜力需要考虑社会系统固有的复杂性。在这里，我们指出现有的科学文献倾向于基于叙事的社会转折记述，缺乏广泛的实证框架和多系统视角。随后，我们概述了一个动态系统方法，包括（i）涉及相互关联的反馈机制的系统观；",
    "tldr": "这篇论文提出了一个动态系统方法来利用社会转折的潜力，以实现净零温室气体排放目标。该方法包括系统观、定向数据收集和全球综合模型等多层面考虑。",
    "en_tdlr": "This paper presents a dynamic systems approach to harness the potential of social tipping for achieving net-zero greenhouse gas emissions. It includes a systems outlook, directed data collection, and global integrated modeling, taking into account multiple factors."
}