{
    "title": "The importance of quality in austere times: University competitiveness and grant income. (arXiv:2309.15309v1 [econ.GN])",
    "abstract": "After 2009 many governments implemented austerity measures, often restricting science funding. Did such restrictions further skew grant income towards elite scientists and universities? And did increased competition for funding undermine participation? UK science funding agencies significantly reduced numbers of grants and total grant funding in response to austerity, but surprisingly restrictions of science funding were relaxed after the 2015 general election. Exploiting this natural experiment, we show that conventional measures of university competitiveness are poor proxies for competitiveness. An alternative measure of university competitiveness, drawn from complexity science, captures the highly dynamical way in which universities engage in scientific subjects. Building on a data set of 43,430 UK funded grants between 2006 and 2020, we analyse rankings of UK universities and investigate the effect of research competitiveness on grant income. When austerity was relaxed in 2015 the ",
    "link": "http://arxiv.org/abs/2309.15309",
    "context": "Title: The importance of quality in austere times: University competitiveness and grant income. (arXiv:2309.15309v1 [econ.GN])\nAbstract: After 2009 many governments implemented austerity measures, often restricting science funding. Did such restrictions further skew grant income towards elite scientists and universities? And did increased competition for funding undermine participation? UK science funding agencies significantly reduced numbers of grants and total grant funding in response to austerity, but surprisingly restrictions of science funding were relaxed after the 2015 general election. Exploiting this natural experiment, we show that conventional measures of university competitiveness are poor proxies for competitiveness. An alternative measure of university competitiveness, drawn from complexity science, captures the highly dynamical way in which universities engage in scientific subjects. Building on a data set of 43,430 UK funded grants between 2006 and 2020, we analyse rankings of UK universities and investigate the effect of research competitiveness on grant income. When austerity was relaxed in 2015 the ",
    "path": "papers/23/09/2309.15309.json",
    "total_tokens": 1029,
    "translated_title": "紧缩时期质量的重要性：大学竞争力和资助收入",
    "translated_abstract": "在2009年之后，许多政府实施了紧缩措施，常常限制科学资助。这些限制是否进一步使资助收入向精英科学家和大学倾斜？增加的资金竞争是否削弱了参与度？英国科学资助机构在紧缩期响应中显著减少了资助数目和总资金，但令人惊讶的是在2015年大选之后，科学资助限制得到了放宽。利用这个自然实验，我们显示常规的大学竞争力衡量指标是竞争力的不良代理。从复杂性科学中得出的大学竞争力替代指标捕捉了大学在科学领域中的高度动态参与方式。基于2006年至2020年间的43,430项英国资助项目数据集，我们分析了英国大学的排名，并研究了研究竞争力对资助收入的影响。当紧缩政策于2015年放宽时，英国大学的地位和资助收入发生了变化。",
    "tldr": "这项研究利用英国科学资助紧缩政策的自然实验，发现传统的大学竞争力测量指标无法准确反映竞争力。通过使用一种基于复杂性科学的替代指标，研究人员揭示了大学在科学领域的高度动态参与方式，并发现研究竞争力对资助收入具有影响。紧缩政策放宽后，英国大学的地位和资助收入发生了变化。",
    "en_tdlr": "This study utilizes a natural experiment of UK science funding austerity measures to reveal that conventional measures of university competitiveness are inadequate and a complexity science-based alternative measure captures the dynamic engagement of universities in scientific subjects. It also demonstrates the impact of research competitiveness on grant income and the changes in university status and funding after the relaxation of austerity measures."
}