{
    "title": "Predicting Financial Market Trends using Time Series Analysis and Natural Language Processing. (arXiv:2309.00136v1 [q-fin.ST])",
    "abstract": "Forecasting financial market trends through time series analysis and natural language processing poses a complex and demanding undertaking, owing to the numerous variables that can influence stock prices. These variables encompass a spectrum of economic and political occurrences, as well as prevailing public attitudes. Recent research has indicated that the expression of public sentiments on social media platforms such as Twitter may have a noteworthy impact on the determination of stock prices. The objective of this study was to assess the viability of Twitter sentiments as a tool for predicting stock prices of major corporations such as Tesla, Apple. Our study has revealed a robust association between the emotions conveyed in tweets and fluctuations in stock prices. Our findings indicate that positivity, negativity, and subjectivity are the primary determinants of fluctuations in stock prices. The data was analyzed utilizing the Long-Short Term Memory neural network (LSTM) model, whi",
    "link": "http://arxiv.org/abs/2309.00136",
    "context": "Title: Predicting Financial Market Trends using Time Series Analysis and Natural Language Processing. (arXiv:2309.00136v1 [q-fin.ST])\nAbstract: Forecasting financial market trends through time series analysis and natural language processing poses a complex and demanding undertaking, owing to the numerous variables that can influence stock prices. These variables encompass a spectrum of economic and political occurrences, as well as prevailing public attitudes. Recent research has indicated that the expression of public sentiments on social media platforms such as Twitter may have a noteworthy impact on the determination of stock prices. The objective of this study was to assess the viability of Twitter sentiments as a tool for predicting stock prices of major corporations such as Tesla, Apple. Our study has revealed a robust association between the emotions conveyed in tweets and fluctuations in stock prices. Our findings indicate that positivity, negativity, and subjectivity are the primary determinants of fluctuations in stock prices. The data was analyzed utilizing the Long-Short Term Memory neural network (LSTM) model, whi",
    "path": "papers/23/09/2309.00136.json",
    "total_tokens": 891,
    "translated_title": "使用时间序列分析和自然语言处理预测金融市场趋势",
    "translated_abstract": "通过时间序列分析和自然语言处理预测金融市场趋势是一项复杂而具有挑战性的任务，因为许多变量可以影响股票价格。这些变量涵盖了一系列经济和政治事件，以及当前的公众态度。最近的研究表明，社交媒体平台上公众情绪的表达（如Twitter）可能对股票价格的确定产生重要影响。本研究旨在评估Twitter情绪作为预测特斯拉、苹果等主要公司股票价格的工具的可行性。我们的研究发现，推文中传达的情绪与股票价格的波动之间存在强有力的关联。我们的研究结果表明，积极性、消极性和主观性是股票价格波动的主要决定因素。数据使用了长短期记忆神经网络（LSTM）模型进行分析。",
    "tldr": "本研究通过分析推文中表达的情绪，使用时间序列分析和自然语言处理预测了特斯拉、苹果等主要公司股票价格的波动。结果表明，积极性、消极性和主观性是股票价格波动的主要决定因素。"
}