{
    "title": "Private Matrix Factorization with Public Item Features. (arXiv:2309.11516v1 [cs.IR])",
    "abstract": "We consider the problem of training private recommendation models with access to public item features. Training with Differential Privacy (DP) offers strong privacy guarantees, at the expense of loss in recommendation quality. We show that incorporating public item features during training can help mitigate this loss in quality. We propose a general approach based on collective matrix factorization (CMF), that works by simultaneously factorizing two matrices: the user feedback matrix (representing sensitive data) and an item feature matrix that encodes publicly available (non-sensitive) item information.  The method is conceptually simple, easy to tune, and highly scalable. It can be applied to different types of public item data, including: (1) categorical item features; (2) item-item similarities learned from public sources; and (3) publicly available user feedback. Furthermore, these data modalities can be collectively utilized to fully leverage public data.  Evaluating our method o",
    "link": "http://arxiv.org/abs/2309.11516",
    "context": "Title: Private Matrix Factorization with Public Item Features. (arXiv:2309.11516v1 [cs.IR])\nAbstract: We consider the problem of training private recommendation models with access to public item features. Training with Differential Privacy (DP) offers strong privacy guarantees, at the expense of loss in recommendation quality. We show that incorporating public item features during training can help mitigate this loss in quality. We propose a general approach based on collective matrix factorization (CMF), that works by simultaneously factorizing two matrices: the user feedback matrix (representing sensitive data) and an item feature matrix that encodes publicly available (non-sensitive) item information.  The method is conceptually simple, easy to tune, and highly scalable. It can be applied to different types of public item data, including: (1) categorical item features; (2) item-item similarities learned from public sources; and (3) publicly available user feedback. Furthermore, these data modalities can be collectively utilized to fully leverage public data.  Evaluating our method o",
    "path": "papers/23/09/2309.11516.json",
    "total_tokens": 896,
    "translated_title": "具有公共项目特征的私有矩阵分解",
    "translated_abstract": "我们考虑在具有公共项目特征的情况下训练私有推荐模型的问题。使用差分隐私（DP）训练可以提供强大的隐私保障，但会导致推荐质量下降。我们展示出在训练过程中加入公共项目特征可以帮助缓解推荐质量下降的问题。我们提出了一种基于集体矩阵分解（CMF）的通用方法，通过同时对两个矩阵进行分解：用户反馈矩阵（代表敏感数据）和一个编码公开可用（非敏感）项目信息的项目特征矩阵。这种方法在概念上简单，易于调整，而且具有高度的可扩展性。它可以应用于不同类型的公共项目数据，包括：（1）分类项目特征；（2）从公共来源学习的项目间相似性；以及（3）公开可用的用户反馈。此外，这些数据模态可以共同利用，以充分利用公共数据。",
    "tldr": "这项研究提出了一种使用公共项目特征进行私有矩阵分解的方法，以缓解差分隐私训练对推荐质量的影响，并展示了这种方法的简单性、易调整性和可扩展性。",
    "en_tdlr": "This research proposes a method for private matrix factorization with public item features to mitigate the impact of differential privacy training on recommendation quality, and demonstrates its simplicity, adjustability, and scalability."
}