{
    "title": "Padding Aware Neurons. (arXiv:2309.08048v1 [cs.CV])",
    "abstract": "Convolutional layers are a fundamental component of most image-related models. These layers often implement by default a static padding policy (\\eg zero padding), to control the scale of the internal representations, and to allow kernel activations centered on the border regions. In this work we identify Padding Aware Neurons (PANs), a type of filter that is found in most (if not all) convolutional models trained with static padding. PANs focus on the characterization and recognition of input border location, introducing a spatial inductive bias into the model (e.g., how close to the input's border a pattern typically is). We propose a method to identify PANs through their activations, and explore their presence in several popular pre-trained models, finding PANs on all models explored, from dozens to hundreds. We discuss and illustrate different types of PANs, their kernels and behaviour. To understand their relevance, we test their impact on model performance, and find padding and PA",
    "link": "http://arxiv.org/abs/2309.08048",
    "context": "Title: Padding Aware Neurons. (arXiv:2309.08048v1 [cs.CV])\nAbstract: Convolutional layers are a fundamental component of most image-related models. These layers often implement by default a static padding policy (\\eg zero padding), to control the scale of the internal representations, and to allow kernel activations centered on the border regions. In this work we identify Padding Aware Neurons (PANs), a type of filter that is found in most (if not all) convolutional models trained with static padding. PANs focus on the characterization and recognition of input border location, introducing a spatial inductive bias into the model (e.g., how close to the input's border a pattern typically is). We propose a method to identify PANs through their activations, and explore their presence in several popular pre-trained models, finding PANs on all models explored, from dozens to hundreds. We discuss and illustrate different types of PANs, their kernels and behaviour. To understand their relevance, we test their impact on model performance, and find padding and PA",
    "path": "papers/23/09/2309.08048.json",
    "total_tokens": 916,
    "translated_title": "Padding Aware Neurons（填充感知神经元）",
    "translated_abstract": "卷积层是大多数与图像相关的模型的基本组成部分。这些层通常默认实现一种静态填充策略（如零填充），以控制内部表示的尺度，并允许以边界为中心的内核激活。在这项工作中，我们识别出填充感知神经元（PANs），这种类型的过滤器在使用静态填充训练的大多数（如果不是全部）卷积模型中都存在。PANs专注于对输入边界位置的特征化和识别，为模型引入了空间归纳偏差（例如，模式通常距离输入边界多近）。我们提出了一种通过它们的激活来识别PANs的方法，并探索了它们在几种流行的预训练模型中的存在，发现从几十个到几百个的PANs。我们讨论并说明了不同类型的PANs、它们的内核和行为。为了了解它们的相关性，我们测试了它们对模型性能的影响，并发现填充和PA对模型性能有显著影响。",
    "tldr": "填充感知神经元（PANs）是一种卷积模型中常见的过滤器，它专注于对输入边界位置的特征化和识别，并且对模型性能有显著影响。"
}