{
    "title": "Boundary Peeling: Outlier Detection Method Using One-Class Peeling. (arXiv:2309.05630v1 [stat.ML])",
    "abstract": "Unsupervised outlier detection constitutes a crucial phase within data analysis and remains a dynamic realm of research. A good outlier detection algorithm should be computationally efficient, robust to tuning parameter selection, and perform consistently well across diverse underlying data distributions. We introduce One-Class Boundary Peeling, an unsupervised outlier detection algorithm. One-class Boundary Peeling uses the average signed distance from iteratively-peeled, flexible boundaries generated by one-class support vector machines. One-class Boundary Peeling has robust hyperparameter settings and, for increased flexibility, can be cast as an ensemble method. In synthetic data simulations One-Class Boundary Peeling outperforms all state of the art methods when no outliers are present while maintaining comparable or superior performance in the presence of outliers, as compared to benchmark methods. One-Class Boundary Peeling performs competitively in terms of correct classificati",
    "link": "http://arxiv.org/abs/2309.05630",
    "context": "Title: Boundary Peeling: Outlier Detection Method Using One-Class Peeling. (arXiv:2309.05630v1 [stat.ML])\nAbstract: Unsupervised outlier detection constitutes a crucial phase within data analysis and remains a dynamic realm of research. A good outlier detection algorithm should be computationally efficient, robust to tuning parameter selection, and perform consistently well across diverse underlying data distributions. We introduce One-Class Boundary Peeling, an unsupervised outlier detection algorithm. One-class Boundary Peeling uses the average signed distance from iteratively-peeled, flexible boundaries generated by one-class support vector machines. One-class Boundary Peeling has robust hyperparameter settings and, for increased flexibility, can be cast as an ensemble method. In synthetic data simulations One-Class Boundary Peeling outperforms all state of the art methods when no outliers are present while maintaining comparable or superior performance in the presence of outliers, as compared to benchmark methods. One-Class Boundary Peeling performs competitively in terms of correct classificati",
    "path": "papers/23/09/2309.05630.json",
    "total_tokens": 851,
    "translated_title": "边界剥离：使用一类剥离的异常检测方法",
    "translated_abstract": "无监督异常检测在数据分析中是至关重要的阶段，仍然是一个充满活力的研究领域。一个好的异常检测算法应该具备计算效率高、对调参选择鲁棒、在不同的数据分布下表现稳定等特点。我们介绍了一类边界剥离，一种无监督异常检测算法。一类边界剥离使用了一类支持向量机不断剥离的、灵活的边界生成的平均有符号距离。一类边界剥离具有鲁棒的超参数设置，并且为了增加灵活性，可以被看作是一个集成方法。在合成数据模拟中，一类边界剥离在没有异常值的情况下优于所有先进方法，并且在有异常值存在的情况下，与基准方法相比，在正确分类方面表现出可比或更好的性能。",
    "tldr": "一类边界剥离是一种无监督的异常检测算法，使用了平均有符号距离和灵活的边界生成方法。在无异常值和有异常值的情况下，一类边界剥离表现出优越的性能。",
    "en_tdlr": "One-Class Boundary Peeling is an unsupervised outlier detection algorithm that uses average signed distance and flexible boundary generation. It outperforms other methods in both absence and presence of outliers."
}