{
    "title": "Decentralized Online Learning in Task Assignment Games for Mobile Crowdsensing. (arXiv:2309.10594v1 [cs.SI])",
    "abstract": "The problem of coordinated data collection is studied for a mobile crowdsensing (MCS) system. A mobile crowdsensing platform (MCSP) sequentially publishes sensing tasks to the available mobile units (MUs) that signal their willingness to participate in a task by sending sensing offers back to the MCSP. From the received offers, the MCSP decides the task assignment. A stable task assignment must address two challenges: the MCSP's and MUs' conflicting goals, and the uncertainty about the MUs' required efforts and preferences. To overcome these challenges a novel decentralized approach combining matching theory and online learning, called collision-avoidance multi-armed bandit with strategic free sensing (CA-MAB-SFS), is proposed. The task assignment problem is modeled as a matching game considering the MCSP's and MUs' individual goals while the MUs learn their efforts online. Our innovative \"free-sensing\" mechanism significantly improves the MU's learning process while reducing collision",
    "link": "http://arxiv.org/abs/2309.10594",
    "context": "Title: Decentralized Online Learning in Task Assignment Games for Mobile Crowdsensing. (arXiv:2309.10594v1 [cs.SI])\nAbstract: The problem of coordinated data collection is studied for a mobile crowdsensing (MCS) system. A mobile crowdsensing platform (MCSP) sequentially publishes sensing tasks to the available mobile units (MUs) that signal their willingness to participate in a task by sending sensing offers back to the MCSP. From the received offers, the MCSP decides the task assignment. A stable task assignment must address two challenges: the MCSP's and MUs' conflicting goals, and the uncertainty about the MUs' required efforts and preferences. To overcome these challenges a novel decentralized approach combining matching theory and online learning, called collision-avoidance multi-armed bandit with strategic free sensing (CA-MAB-SFS), is proposed. The task assignment problem is modeled as a matching game considering the MCSP's and MUs' individual goals while the MUs learn their efforts online. Our innovative \"free-sensing\" mechanism significantly improves the MU's learning process while reducing collision",
    "path": "papers/23/09/2309.10594.json",
    "total_tokens": 1004,
    "translated_title": "移动群智感知中的任务分配游戏中的去中心化在线学习",
    "translated_abstract": "本文研究了移动群智感知系统中协调数据收集的问题。移动群智感知平台逐步发布感知任务给可用移动单元，并通过回传感知报价来表示它们参与任务的意愿。根据所收到的报价，感知平台决定任务分配。稳定的任务分配需要解决两个挑战：感知平台和移动单元之间的目标冲突，以及对移动单元所需努力和偏好的不确定性。为了克服这些挑战，提出了一种结合匹配理论和在线学习的新颖去中心化方法，称为\"碰撞避免多臂老虎机-策略无感知\"（CA-MAB-SFS）。将任务分配问题建模为考虑感知平台和移动单元的个体目标的匹配游戏，而移动单元在线学习其努力。我们的创新的\"无感知\"机制显著提高了移动单元的学习过程，同时减少了冲突。",
    "tldr": "本文研究了移动群智感知系统中的任务分配问题，提出了一种新颖的结合匹配理论和在线学习的去中心化方法。该方法通过考虑移动单元的个体目标，同时在线学习移动单元的努力，解决了感知平台和移动单元之间的目标冲突和不确定性问题。创新的\"无感知\"机制提高了学习过程并减少了冲突。",
    "en_tdlr": "This paper addresses the problem of coordinated data collection in a mobile crowdsensing system by proposing a novel decentralized approach that combines matching theory and online learning. The proposed approach considers the conflicting goals and uncertainties of the mobile units and the sensing platform, and introduces an innovative \"free-sensing\" mechanism to improve the learning process and reduce collisions."
}