{
    "title": "Decentralised Finance and Automated Market Making: Predictable Loss and Optimal Liquidity Provision. (arXiv:2309.08431v1 [q-fin.MF])",
    "abstract": "Constant product markets with concentrated liquidity (CL) are the most popular type of automated market makers. In this paper, we characterise the continuous-time wealth dynamics of strategic LPs who dynamically adjust their range of liquidity provision in CL pools. Their wealth results from fee income and the value of their holdings in the pool. Next, we derive a self-financing and closed-form optimal liquidity provision strategy where the width of the LP's liquidity range is determined by the profitability of the pool (provision fees minus gas fees), the predictable losses (PL) of the LP's position, and concentration risk. Concentration risk refers to the decrease in fee revenue if the marginal exchange rate (akin to the midprice in a limit order book) in the pool exits the LP's range of liquidity. When the marginal rate is driven by a stochastic drift, we show how to optimally skew the range of liquidity to increase fee revenue and profit from the expected changes in the marginal ra",
    "link": "http://arxiv.org/abs/2309.08431",
    "context": "Title: Decentralised Finance and Automated Market Making: Predictable Loss and Optimal Liquidity Provision. (arXiv:2309.08431v1 [q-fin.MF])\nAbstract: Constant product markets with concentrated liquidity (CL) are the most popular type of automated market makers. In this paper, we characterise the continuous-time wealth dynamics of strategic LPs who dynamically adjust their range of liquidity provision in CL pools. Their wealth results from fee income and the value of their holdings in the pool. Next, we derive a self-financing and closed-form optimal liquidity provision strategy where the width of the LP's liquidity range is determined by the profitability of the pool (provision fees minus gas fees), the predictable losses (PL) of the LP's position, and concentration risk. Concentration risk refers to the decrease in fee revenue if the marginal exchange rate (akin to the midprice in a limit order book) in the pool exits the LP's range of liquidity. When the marginal rate is driven by a stochastic drift, we show how to optimally skew the range of liquidity to increase fee revenue and profit from the expected changes in the marginal ra",
    "path": "papers/23/09/2309.08431.json",
    "total_tokens": 1008,
    "translated_title": "去中心化金融与自动化市场做市：可预测的损失和最优流动性提供",
    "translated_abstract": "在这篇论文中，我们对动态调整其在集中流动性池中提供流动性范围的战略性流动性提供者的连续时间财富动态进行了表征。他们的财富来自手续费收入和他们在池中持有的资产的价值。接下来，我们推导出了一种自融资和封闭形式的最优流动性提供策略，其中流动性提供者的范围宽度由池的盈利能力（提供费用减去燃气费用）、可预测损失（持仓的损失）和集中风险决定。集中风险是指如果池中的边际兑换率（类似于限价订单簿中的中间价）超出流动性提供者的范围，费用收入会下降。当边际兑换率由随机漂移驱动时，我们展示了如何通过最优调整流动性范围来增加费用收入并从边际率的预期变化中获利。",
    "tldr": "本文研究了集中流动性的常量产品市场，对动态调整流动性的战略性流动性提供者的财富动态进行了描述。通过推导出自融资和封闭形式的最优流动性提供策略，结合盈利能力、预测损失和集中风险，可以通过调整流动性范围来增加费用收入并从边际率的预期变化中获利。",
    "en_tdlr": "This paper characterizes the wealth dynamics of strategic liquidity providers in constant product markets with concentrated liquidity. A self-financing and closed-form optimal liquidity provision strategy is derived, which allows for increasing fee revenue and profiting from expected changes in the marginal rate by adjusting liquidity range."
}