{
    "title": "Has Sentiment Returned to the Pre-pandemic Level? A Sentiment Analysis Using U.S. College Subreddit Data from 2019 to 2022. (arXiv:2309.08845v1 [cs.CL])",
    "abstract": "As impact of COVID-19 pandemic winds down, both individuals and society gradually return to pre-pandemic activities. This study aims to explore how people's emotions have changed from the pre-pandemic during the pandemic to post-emergency period and whether it has returned to pre-pandemic level. We collected Reddit data in 2019 (pre-pandemic), 2020 (peak pandemic), 2021, and 2022 (late stages of pandemic, transitioning period to post-emergency period) from subreddits in 128 universities/colleges in the U.S., and a set of school-level characteristics. We predicted two sets of sentiments from a pre-trained Robustly Optimized BERT pre-training approach (RoBERTa) and graph attention network (GAT) that leverages both rich semantic and relational information among posted messages and then applied a logistic stacking method to obtain the final sentiment classification. After obtaining sentiment label for each message, we used a generalized linear mixed-effects model to estimate temporal trend",
    "link": "http://arxiv.org/abs/2309.08845",
    "context": "Title: Has Sentiment Returned to the Pre-pandemic Level? A Sentiment Analysis Using U.S. College Subreddit Data from 2019 to 2022. (arXiv:2309.08845v1 [cs.CL])\nAbstract: As impact of COVID-19 pandemic winds down, both individuals and society gradually return to pre-pandemic activities. This study aims to explore how people's emotions have changed from the pre-pandemic during the pandemic to post-emergency period and whether it has returned to pre-pandemic level. We collected Reddit data in 2019 (pre-pandemic), 2020 (peak pandemic), 2021, and 2022 (late stages of pandemic, transitioning period to post-emergency period) from subreddits in 128 universities/colleges in the U.S., and a set of school-level characteristics. We predicted two sets of sentiments from a pre-trained Robustly Optimized BERT pre-training approach (RoBERTa) and graph attention network (GAT) that leverages both rich semantic and relational information among posted messages and then applied a logistic stacking method to obtain the final sentiment classification. After obtaining sentiment label for each message, we used a generalized linear mixed-effects model to estimate temporal trend",
    "path": "papers/23/09/2309.08845.json",
    "total_tokens": 941,
    "translated_title": "疫情前后情绪水平是否恢复到疫情前的水平？使用美国大学Subreddit数据进行情绪分析（arXiv:2309.08845v1 [cs.CL]）",
    "translated_abstract": "随着COVID-19疫情的减退，个人和社会逐渐恢复到疫情前的活动。本研究旨在探究人们的情绪从疫情前到疫情期间再到后紧急期的变化，并确定是否恢复到疫情前的水平。我们收集了2019年（疫情前）、2020年（疫情高峰期）、2021年和2022年（疫情后期，过渡期到后紧急期）来自128个美国大学Subreddits的Reddit数据以及一组学校级特征。我们采用预训练的RoBERTa（Robustly Optimized BERT pre-training approach）和图注意力网络（GAT）来预测两组情绪，并应用逻辑堆叠方法获得最终的情绪分类。在获得每条消息的情绪标签后，我们使用广义线性混合效应模型来估计时间趋势。",
    "tldr": "本研究分析了使用美国大学Subreddit数据从疫情前到疫情期间再到后紧急期的人们的情绪变化，探讨了情绪是否已恢复到疫情前的水平。"
}