{
    "title": "Quality-Agnostic Deepfake Detection with Intra-model Collaborative Learning. (arXiv:2309.05911v1 [cs.CV])",
    "abstract": "Deepfake has recently raised a plethora of societal concerns over its possible security threats and dissemination of fake information. Much research on deepfake detection has been undertaken. However, detecting low quality as well as simultaneously detecting different qualities of deepfakes still remains a grave challenge. Most SOTA approaches are limited by using a single specific model for detecting certain deepfake video quality type. When constructing multiple models with prior information about video quality, this kind of strategy incurs significant computational cost, as well as model and training data overhead. Further, it cannot be scalable and practical to deploy in real-world settings. In this work, we propose a universal intra-model collaborative learning framework to enable the effective and simultaneous detection of different quality of deepfakes. That is, our approach is the quality-agnostic deepfake detection method, dubbed QAD . In particular, by observing the upper bou",
    "link": "http://arxiv.org/abs/2309.05911",
    "context": "Title: Quality-Agnostic Deepfake Detection with Intra-model Collaborative Learning. (arXiv:2309.05911v1 [cs.CV])\nAbstract: Deepfake has recently raised a plethora of societal concerns over its possible security threats and dissemination of fake information. Much research on deepfake detection has been undertaken. However, detecting low quality as well as simultaneously detecting different qualities of deepfakes still remains a grave challenge. Most SOTA approaches are limited by using a single specific model for detecting certain deepfake video quality type. When constructing multiple models with prior information about video quality, this kind of strategy incurs significant computational cost, as well as model and training data overhead. Further, it cannot be scalable and practical to deploy in real-world settings. In this work, we propose a universal intra-model collaborative learning framework to enable the effective and simultaneous detection of different quality of deepfakes. That is, our approach is the quality-agnostic deepfake detection method, dubbed QAD . In particular, by observing the upper bou",
    "path": "papers/23/09/2309.05911.json",
    "total_tokens": 877,
    "translated_title": "与模型内协作学习无关质量的深度伪造检测",
    "translated_abstract": "近年来，深度伪造引发了诸多社会关注，可能对安全造成威胁并传播虚假信息。已经有很多关于深度伪造检测的研究，但是同时检测低质量和不同质量的深度伪造仍然是一个严峻的挑战。大多数先进方法仅使用单一特定模型来检测特定的深度伪造视频质量类型，这种策略在构建多个模型时会产生显著的计算成本、模型和训练数据开销，而且在实际应用中无法实现可扩展性和实用性。本研究提出了一种通用的模型内协作学习框架，实现了不同质量深度伪造的有效同时检测。换句话说，我们的方法是一种无关质量的深度伪造检测方法，称为QAD。通过观察上界",
    "tldr": "本论文提出了一种无关质量的深度伪造检测方法(QAD)，通过模型内协作学习方法实现了同时检测不同质量的深度伪造。是一种具有实际应用可行性和可扩展性的方法。",
    "en_tdlr": "This paper proposes a quality-agnostic deepfake detection method (QAD) that utilizes intra-model collaborative learning to simultaneously detect different qualities of deepfakes. It is a practical and scalable approach."
}