{
    "title": "Encoded Summarization: Summarizing Documents into Continuous Vector Space for Legal Case Retrieval. (arXiv:2309.08187v1 [cs.CL])",
    "abstract": "We present our method for tackling a legal case retrieval task by introducing our method of encoding documents by summarizing them into continuous vector space via our phrase scoring framework utilizing deep neural networks. On the other hand, we explore the benefits from combining lexical features and latent features generated with neural networks. Our experiments show that lexical features and latent features generated with neural networks complement each other to improve the retrieval system performance. Furthermore, our experimental results suggest the importance of case summarization in different aspects: using provided summaries and performing encoded summarization. Our approach achieved F1 of 65.6% and 57.6% on the experimental datasets of legal case retrieval tasks.",
    "link": "http://arxiv.org/abs/2309.08187",
    "context": "Title: Encoded Summarization: Summarizing Documents into Continuous Vector Space for Legal Case Retrieval. (arXiv:2309.08187v1 [cs.CL])\nAbstract: We present our method for tackling a legal case retrieval task by introducing our method of encoding documents by summarizing them into continuous vector space via our phrase scoring framework utilizing deep neural networks. On the other hand, we explore the benefits from combining lexical features and latent features generated with neural networks. Our experiments show that lexical features and latent features generated with neural networks complement each other to improve the retrieval system performance. Furthermore, our experimental results suggest the importance of case summarization in different aspects: using provided summaries and performing encoded summarization. Our approach achieved F1 of 65.6% and 57.6% on the experimental datasets of legal case retrieval tasks.",
    "path": "papers/23/09/2309.08187.json",
    "total_tokens": 738,
    "translated_title": "编码概括：将文件概括为连续向量空间，用于法律案例检索",
    "translated_abstract": "通过我们的短语评分框架和深度神经网络，我们提出了一种将文件编码为连续向量空间的方法，用于应对法律案例检索任务。另一方面，我们探索了使用词汇特征和神经网络生成的潜在特征的好处。我们的实验证明，词汇特征和神经网络生成的潜在特征相互补充，可以提高检索系统性能。此外，我们的实验结果表明，案例概括在不同方面的重要性：使用提供的概括和进行编码概括。我们的方法在法律案例检索任务的实验数据集上实现了65.6%和57.6%的F1分数。",
    "tldr": "该论文提出了一种将文件编码为连续向量空间的方法，用于法律案例检索任务。实验证明，将词汇特征和神经网络生成的潜在特征相结合可以提高检索系统性能。该方法在实验数据集上取得了较高的F1分数。"
}