{
    "title": "Visualizing Topological Importance: A Class-Driven Approach. (arXiv:2309.13185v1 [cs.LG])",
    "abstract": "This paper presents the first approach to visualize the importance of topological features that define classes of data. Topological features, with their ability to abstract the fundamental structure of complex data, are an integral component of visualization and analysis pipelines. Although not all topological features present in data are of equal importance. To date, the default definition of feature importance is often assumed and fixed. This work shows how proven explainable deep learning approaches can be adapted for use in topological classification. In doing so, it provides the first technique that illuminates what topological structures are important in each dataset in regards to their class label. In particular, the approach uses a learned metric classifier with a density estimator of the points of a persistence diagram as input. This metric learns how to reweigh this density such that classification accuracy is high. By extracting this weight, an importance field on persistent",
    "link": "http://arxiv.org/abs/2309.13185",
    "context": "Title: Visualizing Topological Importance: A Class-Driven Approach. (arXiv:2309.13185v1 [cs.LG])\nAbstract: This paper presents the first approach to visualize the importance of topological features that define classes of data. Topological features, with their ability to abstract the fundamental structure of complex data, are an integral component of visualization and analysis pipelines. Although not all topological features present in data are of equal importance. To date, the default definition of feature importance is often assumed and fixed. This work shows how proven explainable deep learning approaches can be adapted for use in topological classification. In doing so, it provides the first technique that illuminates what topological structures are important in each dataset in regards to their class label. In particular, the approach uses a learned metric classifier with a density estimator of the points of a persistence diagram as input. This metric learns how to reweigh this density such that classification accuracy is high. By extracting this weight, an importance field on persistent",
    "path": "papers/23/09/2309.13185.json",
    "total_tokens": 808,
    "translated_title": "可视化拓扑重要性：一种面向类别的方法",
    "translated_abstract": "本文提出了一种可视化定义数据类别的拓扑特征重要性的方法。拓扑特征能够抽象复杂数据的基本结构，在可视化和分析过程中是不可或缺的组成部分。然而，并非所有的拓扑特征都具有相等的重要性。迄今为止，对于特征重要性的默认定义往往是固定和假设的。本文展示了如何利用可解释的深度学习方法来适应拓扑分类，并提供了第一种方法来揭示与类别标签相关的每个数据集中重要的拓扑结构。具体而言，该方法使用一个学习的度量分类器，并以持续图的点的密度估计作为输入。这个度量学习如何重新加权密度以使分类准确率高。通过提取这个权重，得到了持续图上的一个重要性场。",
    "tldr": "本文提出了一种可视化拓扑重要性的方法，能够揭示与类别标签相关的每个数据集中重要的拓扑结构。"
}