{
    "title": "Question-Answering Approach to Evaluate Legal Summaries. (arXiv:2309.15016v1 [cs.CL])",
    "abstract": "Traditional evaluation metrics like ROUGE compare lexical overlap between the reference and generated summaries without taking argumentative structure into account, which is important for legal summaries. In this paper, we propose a novel legal summarization evaluation framework that utilizes GPT-4 to generate a set of question-answer pairs that cover main points and information in the reference summary. GPT-4 is then used to generate answers based on the generated summary for the questions from the reference summary. Finally, GPT-4 grades the answers from the reference summary and the generated summary. We examined the correlation between GPT-4 grading with human grading. The results suggest that this question-answering approach with GPT-4 can be a useful tool for gauging the quality of the summary.",
    "link": "http://arxiv.org/abs/2309.15016",
    "context": "Title: Question-Answering Approach to Evaluate Legal Summaries. (arXiv:2309.15016v1 [cs.CL])\nAbstract: Traditional evaluation metrics like ROUGE compare lexical overlap between the reference and generated summaries without taking argumentative structure into account, which is important for legal summaries. In this paper, we propose a novel legal summarization evaluation framework that utilizes GPT-4 to generate a set of question-answer pairs that cover main points and information in the reference summary. GPT-4 is then used to generate answers based on the generated summary for the questions from the reference summary. Finally, GPT-4 grades the answers from the reference summary and the generated summary. We examined the correlation between GPT-4 grading with human grading. The results suggest that this question-answering approach with GPT-4 can be a useful tool for gauging the quality of the summary.",
    "path": "papers/23/09/2309.15016.json",
    "total_tokens": 813,
    "translated_title": "用问答方法评估法律摘要",
    "translated_abstract": "传统的评估指标如ROUGE仅比较参考摘要和生成摘要之间的词汇重叠，而不考虑论点结构，而这对于法律摘要非常重要。在本文中，我们提出了一种新颖的法律摘要评估框架，利用GPT-4生成一组问题-答案对，涵盖参考摘要中的主要点和信息。然后，利用生成摘要回答参考摘要中的问题。最后，GPT-4对参考摘要和生成摘要的答案进行评分。我们检查了GPT-4评分与人工评分之间的相关性。结果表明，利用GPT-4的问答方法可以作为衡量摘要质量的有用工具。",
    "tldr": "本文提出了一种利用GPT-4进行问答的法律摘要评估方法，通过生成一组问题-答案对来覆盖参考摘要中的主要信息，并通过GPT-4对参考摘要和生成摘要的答案进行评分，证明了该方法可以作为衡量摘要质量的有效工具。"
}