{
    "title": "The Iberian Exception: An overview of its effects over its first 100 days. (arXiv:2309.02608v1 [econ.GN])",
    "abstract": "This paper offers an independent assessment of certain economic effects of the Iberian Exception (IE) which was introduced in June 2022 by the Spanish and Portuguese governments. Their stated aim was to reduce wholesale spot electricity prices (which were rising alarmingly due to tight international gas markets related to Russia s invasion of Ukraine) and thereby reduce retail electricity prices for consumers whose prices were linked to that wholesale market. Another aim was to reduce Spanish inflation, which was linked to a regulated electricity retail price indexed to the wholesale spot market. Using hourly data on the wholesale electricity market for the first 100 days of the IE, the authors question the Spanish Governments estimate of the beneficial effects of the measure for affected consumers, which included over 10 million small consumers as well as many large ones. They argue that the estimated effect of the IE on retail prices depends on the assumed counterfactual. Although co",
    "link": "http://arxiv.org/abs/2309.02608",
    "context": "Title: The Iberian Exception: An overview of its effects over its first 100 days. (arXiv:2309.02608v1 [econ.GN])\nAbstract: This paper offers an independent assessment of certain economic effects of the Iberian Exception (IE) which was introduced in June 2022 by the Spanish and Portuguese governments. Their stated aim was to reduce wholesale spot electricity prices (which were rising alarmingly due to tight international gas markets related to Russia s invasion of Ukraine) and thereby reduce retail electricity prices for consumers whose prices were linked to that wholesale market. Another aim was to reduce Spanish inflation, which was linked to a regulated electricity retail price indexed to the wholesale spot market. Using hourly data on the wholesale electricity market for the first 100 days of the IE, the authors question the Spanish Governments estimate of the beneficial effects of the measure for affected consumers, which included over 10 million small consumers as well as many large ones. They argue that the estimated effect of the IE on retail prices depends on the assumed counterfactual. Although co",
    "path": "papers/23/09/2309.02608.json",
    "total_tokens": 968,
    "translated_title": "《伊比利亚例外：前100天的影响概述》",
    "translated_abstract": "本文对于西班牙和葡萄牙政府于2022年6月引入的伊比利亚例外（IE）的某些经济效应进行了独立评估。他们所声明的目标是降低危机的计划电力价格（由于与俄罗斯入侵乌克兰有关的紧张国际天然气市场导致的价格上涨），从而降低以该计划电力市场为基准的消费者的零售电力价格。另一个目标是降低与支持以计划电力市场为基准的零售价格相关的西班牙通胀。作者使用了IE前100天的每小时电力市场数据，对政府对于对受影响的消费者（其中包括超过1000万个小消费者以及许多大消费者）的措施产生积极效果的估计进行了质疑。他们认为对零售价格的IE的估计效果取决于假设的反事实情况。",
    "tldr": "本文独立评估了西班牙和葡萄牙政府于2022年6月引入的伊比利亚例外（IE）对于消费者和通胀的经济效应。通过对前100天电力市场的数据进行分析，作者对政府对于这一措施对受影响的消费者产生积极影响的估计提出了质疑。"
}