{
    "title": "Scaling Limits of the Wasserstein information matrix on Gaussian Mixture Models. (arXiv:2309.12997v1 [math.PR])",
    "abstract": "We consider the Wasserstein metric on the Gaussian mixture models (GMMs), which is defined as the pullback of the full Wasserstein metric on the space of smooth probability distributions with finite second moment. It derives a class of Wasserstein metrics on probability simplices over one-dimensional bounded homogeneous lattices via a scaling limit of the Wasserstein metric on GMMs. Specifically, for a sequence of GMMs whose variances tend to zero, we prove that the limit of the Wasserstein metric exists after certain renormalization. Generalizations of this metric in general GMMs are established, including inhomogeneous lattice models whose lattice gaps are not the same, extended GMMs whose mean parameters of Gaussian components can also change, and the second-order metric containing high-order information of the scaling limit. We further study the Wasserstein gradient flows on GMMs for three typical functionals: potential, internal, and interaction energies. Numerical examples demons",
    "link": "http://arxiv.org/abs/2309.12997",
    "context": "Title: Scaling Limits of the Wasserstein information matrix on Gaussian Mixture Models. (arXiv:2309.12997v1 [math.PR])\nAbstract: We consider the Wasserstein metric on the Gaussian mixture models (GMMs), which is defined as the pullback of the full Wasserstein metric on the space of smooth probability distributions with finite second moment. It derives a class of Wasserstein metrics on probability simplices over one-dimensional bounded homogeneous lattices via a scaling limit of the Wasserstein metric on GMMs. Specifically, for a sequence of GMMs whose variances tend to zero, we prove that the limit of the Wasserstein metric exists after certain renormalization. Generalizations of this metric in general GMMs are established, including inhomogeneous lattice models whose lattice gaps are not the same, extended GMMs whose mean parameters of Gaussian components can also change, and the second-order metric containing high-order information of the scaling limit. We further study the Wasserstein gradient flows on GMMs for three typical functionals: potential, internal, and interaction energies. Numerical examples demons",
    "path": "papers/23/09/2309.12997.json",
    "total_tokens": 997,
    "translated_title": "高斯混合模型中Wasserstein信息矩阵的扩展极限",
    "translated_abstract": "我们考虑了高斯混合模型(GMMs)上的Wasserstein度量，它被定义为具有有限二阶矩的平滑概率分布空间上Wasserstein度量的推回。通过对GMMs上的Wasserstein度量的缩放极限，它导出了一类在一维有界齐次晶格上的概率单纯形上的Wasserstein度量。具体而言，对于一个方差趋于零的GMMs序列，我们证明了在某种归一化后Wasserstein度量的极限存在。我们还建立了一般GMMs中的这种度量的推广，包括不同的非齐次晶格模型，扩展的GMMs(高斯组件的均值参数也可以改变)，以及包含缩放极限高阶信息的二阶度量。我们进一步研究了GMMs上的Wasserstein梯度流对三个典型的泛函: 势能、内能和相互作用能的情况。数值实例证明了我们的结果。",
    "tldr": "本文研究了高斯混合模型上的Wasserstein度量，并通过缩放极限构建了一类在有界一维齐次晶格上的概率单纯形上的Wasserstein度量。此外，还推广了这种度量到一般的混合模型，并研究了Wasserstein梯度流在不同泛函下的行为。数值实例验证了结果的有效性。",
    "en_tdlr": "This paper investigates the Wasserstein metric on Gaussian mixture models (GMMs) and establishes a class of Wasserstein metrics on probability simplices over one-dimensional bounded homogeneous lattices through scaling limits. The metric is further generalized to general GMMs, and the behavior of Wasserstein gradient flows under different functionals is studied. Numerical examples demonstrate the validity of the results."
}