{
    "title": "Reproducible Domain-Specific Knowledge Graphs in the Life Sciences: a Systematic Literature Review. (arXiv:2309.08754v1 [cs.IR])",
    "abstract": "Knowledge graphs (KGs) are widely used for representing and organizing structured knowledge in diverse domains. However, the creation and upkeep of KGs pose substantial challenges. Developing a KG demands extensive expertise in data modeling, ontology design, and data curation. Furthermore, KGs are dynamic, requiring continuous updates and quality control to ensure accuracy and relevance. These intricacies contribute to the considerable effort required for their development and maintenance. One critical dimension of KGs that warrants attention is reproducibility. The ability to replicate and validate KGs is fundamental for ensuring the trustworthiness and sustainability of the knowledge they represent. Reproducible KGs not only support open science by allowing others to build upon existing knowledge but also enhance transparency and reliability in disseminating information. Despite the growing number of domain-specific KGs, a comprehensive analysis concerning their reproducibility has ",
    "link": "http://arxiv.org/abs/2309.08754",
    "context": "Title: Reproducible Domain-Specific Knowledge Graphs in the Life Sciences: a Systematic Literature Review. (arXiv:2309.08754v1 [cs.IR])\nAbstract: Knowledge graphs (KGs) are widely used for representing and organizing structured knowledge in diverse domains. However, the creation and upkeep of KGs pose substantial challenges. Developing a KG demands extensive expertise in data modeling, ontology design, and data curation. Furthermore, KGs are dynamic, requiring continuous updates and quality control to ensure accuracy and relevance. These intricacies contribute to the considerable effort required for their development and maintenance. One critical dimension of KGs that warrants attention is reproducibility. The ability to replicate and validate KGs is fundamental for ensuring the trustworthiness and sustainability of the knowledge they represent. Reproducible KGs not only support open science by allowing others to build upon existing knowledge but also enhance transparency and reliability in disseminating information. Despite the growing number of domain-specific KGs, a comprehensive analysis concerning their reproducibility has ",
    "path": "papers/23/09/2309.08754.json",
    "total_tokens": 936,
    "translated_title": "在生命科学中的可复制领域特定知识图的系统文献综述",
    "translated_abstract": "知识图（KG）被广泛用于在不同领域中表示和组织结构化知识。然而，创建和维护KG面临着重大挑战。开发KG需要对数据建模、本体设计和数据整理具有广泛的专业知识。此外，KG是动态的，需要持续更新和质量控制以确保准确性和相关性。这些复杂性导致了对其开发和维护的相当大的努力。值得关注的一项关键维度是可复制性。能够复制和验证KG对于确保所表示的知识的可信性和可持续性至关重要。可复制的KG不仅通过允许他人在现有知识的基础上进行建设来支持开放科学，而且还增强了信息传播的透明度和可靠性。尽管有越来越多的领域特定的KG，关于其可复制性的综合分析仍然缺乏。",
    "tldr": "在生命科学领域，可复制的领域特定知识图对于确保知识的可信性和可持续性至关重要。然而，创建和维护KG面临着重大挑战。尽管有越来越多的领域特定的KG，关于其可复制性的综合分析仍然缺乏。",
    "en_tdlr": "Reproducible domain-specific knowledge graphs in the life sciences are crucial for ensuring the credibility and sustainability of knowledge. However, the creation and maintenance of KGs come with significant challenges. Despite the increasing number of domain-specific KGs, there is a lack of comprehensive analysis on their reproducibility."
}