{
    "title": "A Dynamic Linear Bias Incorporation Scheme for Nonnegative Latent Factor Analysis. (arXiv:2309.10618v1 [cs.AI])",
    "abstract": "High-Dimensional and Incomplete (HDI) data is commonly encountered in big data-related applications like social network services systems, which are concerning the limited interactions among numerous nodes. Knowledge acquisition from HDI data is a vital issue in the domain of data science due to their embedded rich patterns like node behaviors, where the fundamental task is to perform HDI data representation learning. Nonnegative Latent Factor Analysis (NLFA) models have proven to possess the superiority to address this issue, where a linear bias incorporation (LBI) scheme is important in present the training overshooting and fluctuation, as well as preventing the model from premature convergence. However, existing LBI schemes are all statistic ones where the linear biases are fixed, which significantly restricts the scalability of the resultant NLFA model and results in loss of representation learning ability to HDI data. Motivated by the above discoveries, this paper innovatively pres",
    "link": "http://arxiv.org/abs/2309.10618",
    "context": "Title: A Dynamic Linear Bias Incorporation Scheme for Nonnegative Latent Factor Analysis. (arXiv:2309.10618v1 [cs.AI])\nAbstract: High-Dimensional and Incomplete (HDI) data is commonly encountered in big data-related applications like social network services systems, which are concerning the limited interactions among numerous nodes. Knowledge acquisition from HDI data is a vital issue in the domain of data science due to their embedded rich patterns like node behaviors, where the fundamental task is to perform HDI data representation learning. Nonnegative Latent Factor Analysis (NLFA) models have proven to possess the superiority to address this issue, where a linear bias incorporation (LBI) scheme is important in present the training overshooting and fluctuation, as well as preventing the model from premature convergence. However, existing LBI schemes are all statistic ones where the linear biases are fixed, which significantly restricts the scalability of the resultant NLFA model and results in loss of representation learning ability to HDI data. Motivated by the above discoveries, this paper innovatively pres",
    "path": "papers/23/09/2309.10618.json",
    "total_tokens": 852,
    "translated_title": "非负潜在因子分析的动态线性偏置引入方案",
    "translated_abstract": "高维度和不完整（HDI）数据在大数据相关应用中很常见，比如社交网络服务系统，这些系统涉及与众多节点之间的有限交互。从HDI数据中获取知识是数据科学领域的一个重要问题，因为HDI数据中嵌入了丰富的模式，如节点行为。非负潜在因子分析（NLFA）模型已被证明在解决这个问题方面具有优势，在这个模型中，线性偏置引入（LBI）方案对于处理训练过度摆动、波动以及防止模型过早收敛非常重要。然而，现有的LBI方案都是统计型的，线性偏置是固定的，这严重限制了产生的NLFA模型的可扩展性，并导致了对HDI数据的表示学习能力的损失。在以上发现的基础上，本文创新地提出了一种动态线性偏置引入方案。",
    "tldr": "本文提出了一种动态线性偏置引入方案，以提高非负潜在因子分析（NLFA）模型对高维不完整数据的表示学习能力。",
    "en_tdlr": "This paper proposes a dynamic linear bias incorporation scheme to enhance the representation learning ability of Nonnegative Latent Factor Analysis (NLFA) models for high-dimensional incomplete data."
}