{
    "title": "Efficient and robust Sensor Placement in Complex Environments. (arXiv:2309.08545v1 [cs.LG])",
    "abstract": "We address the problem of efficient and unobstructed surveillance or communication in complex environments. On one hand, one wishes to use a minimal number of sensors to cover the environment. On the other hand, it is often important to consider solutions that are robust against sensor failure or adversarial attacks. This paper addresses these challenges of designing minimal sensor sets that achieve multi-coverage constraints -- every point in the environment is covered by a prescribed number of sensors. We propose a greedy algorithm to achieve the objective. Further, we explore deep learning techniques to accelerate the evaluation of the objective function formulated in the greedy algorithm. The training of the neural network reveals that the geometric properties of the data significantly impact the network's performance, particularly at the end stage. By taking into account these properties, we discuss the differences in using greedy and $\\epsilon$-greedy algorithms to generate data ",
    "link": "http://arxiv.org/abs/2309.08545",
    "context": "Title: Efficient and robust Sensor Placement in Complex Environments. (arXiv:2309.08545v1 [cs.LG])\nAbstract: We address the problem of efficient and unobstructed surveillance or communication in complex environments. On one hand, one wishes to use a minimal number of sensors to cover the environment. On the other hand, it is often important to consider solutions that are robust against sensor failure or adversarial attacks. This paper addresses these challenges of designing minimal sensor sets that achieve multi-coverage constraints -- every point in the environment is covered by a prescribed number of sensors. We propose a greedy algorithm to achieve the objective. Further, we explore deep learning techniques to accelerate the evaluation of the objective function formulated in the greedy algorithm. The training of the neural network reveals that the geometric properties of the data significantly impact the network's performance, particularly at the end stage. By taking into account these properties, we discuss the differences in using greedy and $\\epsilon$-greedy algorithms to generate data ",
    "path": "papers/23/09/2309.08545.json",
    "total_tokens": 886,
    "translated_title": "复杂环境中高效稳健的传感器部署",
    "translated_abstract": "我们解决了在复杂环境中高效无阻的监视或通信问题。一方面，人们希望使用最少数量的传感器覆盖环境。另一方面，考虑到传感器故障或对抗攻击的情况，设计具有鲁棒性的解决方案通常很重要。本文解决了设计能够实现多覆盖约束的最小传感器集合的挑战，即环境中的每个点都被一定数量的传感器覆盖。我们提出了一种贪婪算法来实现这个目标。此外，我们探索了深度学习技术来加速贪婪算法中所制定的目标函数的评估。神经网络的训练揭示了数据的几何属性对网络性能的显著影响，特别是在最终阶段。通过考虑这些属性，我们讨论了使用贪婪算法和ε-贪婪算法生成数据的差异。",
    "tldr": "本文解决了在复杂环境中高效稳健的传感器部署问题，提出了一种贪婪算法来设计最小传感器集合以实现多覆盖约束，并探索了深度学习技术加速算法的评估。",
    "en_tdlr": "This paper addresses the problem of efficient and robust sensor placement in complex environments, proposing a greedy algorithm to design minimal sensor sets that achieve multi-coverage constraints and exploring deep learning techniques to accelerate the algorithm's evaluation."
}