{
    "title": "GlotScript: A Resource and Tool for Low Resource Writing System Identification",
    "abstract": "arXiv:2309.13320v2 Announce Type: replace  Abstract: We present GlotScript, an open resource and tool for low resource writing system identification. GlotScript-R is a resource that provides the attested writing systems for more than 7,000 languages. It is compiled by aggregating information from existing writing system resources. GlotScript-T is a writing system identification tool that covers all 161 Unicode 15.0 scripts. For an input text, it returns its script distribution where scripts are identified by ISO 15924 codes. We also present two use cases for GlotScript. First, we demonstrate that GlotScript can help cleaning multilingual corpora such as mC4 and OSCAR. Second, we analyze the tokenization of a number of language models such as GPT-4 using GlotScript and provide insights on the coverage of low resource scripts and languages by each language model. We hope that GlotScript will become a useful resource for work on low resource languages in the NLP community. GlotScript-R an",
    "link": "https://arxiv.org/abs/2309.13320",
    "context": "Title: GlotScript: A Resource and Tool for Low Resource Writing System Identification\nAbstract: arXiv:2309.13320v2 Announce Type: replace  Abstract: We present GlotScript, an open resource and tool for low resource writing system identification. GlotScript-R is a resource that provides the attested writing systems for more than 7,000 languages. It is compiled by aggregating information from existing writing system resources. GlotScript-T is a writing system identification tool that covers all 161 Unicode 15.0 scripts. For an input text, it returns its script distribution where scripts are identified by ISO 15924 codes. We also present two use cases for GlotScript. First, we demonstrate that GlotScript can help cleaning multilingual corpora such as mC4 and OSCAR. Second, we analyze the tokenization of a number of language models such as GPT-4 using GlotScript and provide insights on the coverage of low resource scripts and languages by each language model. We hope that GlotScript will become a useful resource for work on low resource languages in the NLP community. GlotScript-R an",
    "path": "papers/23/09/2309.13320.json",
    "total_tokens": 931,
    "translated_title": "GlotScript：一种用于低资源书写系统识别的资源和工具",
    "translated_abstract": "我们介绍了GlotScript，这是一个用于低资源书写系统识别的开放资源和工具。GlotScript-R是一个资源，提供了7000多种语言的经过验证的书写系统。它通过整合现有的书写系统资源中的信息进行编制。GlotScript-T是一个书写系统识别工具，涵盖了所有161种Unicode 15.0脚本。对于输入文本，它返回其脚本分布，其中脚本由ISO 15924代码标识。我们还展示了GlotScript的两个用例。首先，我们演示了GlotScript如何帮助清理多语种语料库，例如mC4和OSCAR。其次，我们使用GlotScript分析了多个语言模型的标记化，例如GPT-4，并提供了关于每个语言模型覆盖低资源脚本和语言的见解。希望GlotScript能成为自然语言处理社区中针对低资源语言工作的有用资源。",
    "tldr": "GlotScript是一种用于低资源书写系统识别的资源和工具，提供了7000多种语言的经过验证的书写系统，同时涵盖了所有161种Unicode 15.0脚本，并能帮助清理多语种语料库以及分析不同语言模型对低资源脚本和语言的覆盖。",
    "en_tdlr": "GlotScript is a resource and tool for low resource writing system identification, providing attested writing systems for over 7,000 languages, covering all 161 Unicode 15.0 scripts, and aiding in cleaning multilingual corpora and analyzing the coverage of low resource scripts and languages by various language models."
}