{
    "title": "Event Prediction using Case-Based Reasoning over Knowledge Graphs. (arXiv:2309.12423v1 [cs.AI])",
    "abstract": "Applying link prediction (LP) methods over knowledge graphs (KG) for tasks such as causal event prediction presents an exciting opportunity. However, typical LP models are ill-suited for this task as they are incapable of performing inductive link prediction for new, unseen event entities and they require retraining as knowledge is added or changed in the underlying KG. We introduce a case-based reasoning model, EvCBR, to predict properties about new consequent events based on similar cause-effect events present in the KG. EvCBR uses statistical measures to identify similar events and performs path-based predictions, requiring no training step. To generalize our methods beyond the domain of event prediction, we frame our task as a 2-hop LP task, where the first hop is a causal relation connecting a cause event to a new effect event and the second hop is a property about the new event which we wish to predict. The effectiveness of our method is demonstrated using a novel dataset of news",
    "link": "http://arxiv.org/abs/2309.12423",
    "context": "Title: Event Prediction using Case-Based Reasoning over Knowledge Graphs. (arXiv:2309.12423v1 [cs.AI])\nAbstract: Applying link prediction (LP) methods over knowledge graphs (KG) for tasks such as causal event prediction presents an exciting opportunity. However, typical LP models are ill-suited for this task as they are incapable of performing inductive link prediction for new, unseen event entities and they require retraining as knowledge is added or changed in the underlying KG. We introduce a case-based reasoning model, EvCBR, to predict properties about new consequent events based on similar cause-effect events present in the KG. EvCBR uses statistical measures to identify similar events and performs path-based predictions, requiring no training step. To generalize our methods beyond the domain of event prediction, we frame our task as a 2-hop LP task, where the first hop is a causal relation connecting a cause event to a new effect event and the second hop is a property about the new event which we wish to predict. The effectiveness of our method is demonstrated using a novel dataset of news",
    "path": "papers/23/09/2309.12423.json",
    "total_tokens": 939,
    "translated_title": "使用基于案例的推理在知识图谱中进行事件预测",
    "translated_abstract": "将链接预测（LP）方法应用于知识图谱（KG）中的任务，如因果事件预测，是一个令人兴奋的机会。然而，传统的LP模型对于此任务并不适用，因为它们无法对新的、未见的事件实体进行归纳式链接预测，并且在底层KG中添加或更改知识时需要重新训练。我们引入了一个基于案例推理模型EvCBR，根据KG中存在的类似因果事件来预测关于新的结果事件的属性。EvCBR使用统计度量来识别相似事件并进行基于路径的预测，不需要训练步骤。为了将我们的方法推广到事件预测域之外，我们将我们的任务框架化为一个2-hop LP任务，其中第一跳是将原因事件与新的效果事件连接起来的因果关系，第二跳是我们希望预测的新事件的属性。我们使用一组新颖的新闻数据集证明了我们方法的有效性。",
    "tldr": "本研究引入了一个基于案例推理模型EvCBR，在知识图谱中利用类似因果事件来预测新结果事件的属性。该模型不需要训练步骤，通过统计度量和基于路径的预测方法实现。研究结果表明，该方法在事件预测任务中取得了良好的效果。",
    "en_tdlr": "This study introduces a case-based reasoning model, EvCBR, to predict properties about new consequent events based on similar cause-effect events present in the knowledge graph. The model does not require training and uses statistical measures and path-based predictions. The results demonstrate the effectiveness of the approach in event prediction tasks."
}