{
    "title": "MiliPoint: A Point Cloud Dataset for mmWave Radar. (arXiv:2309.13425v2 [cs.LG] UPDATED)",
    "abstract": "Millimetre-wave (mmWave) radar has emerged as an attractive and cost-effective alternative for human activity sensing compared to traditional camera-based systems. mmWave radars are also non-intrusive, providing better protection for user privacy. However, as a Radio Frequency (RF) based technology, mmWave radars rely on capturing reflected signals from objects, making them more prone to noise compared to cameras. This raises an intriguing question for the deep learning community: Can we develop more effective point set-based deep learning methods for such attractive sensors?  To answer this question, our work, termed MiliPoint, delves into this idea by providing a large-scale, open dataset for the community to explore how mmWave radars can be utilised for human activity recognition. Moreover, MiliPoint stands out as it is larger in size than existing datasets, has more diverse human actions represented, and encompasses all three key tasks in human activity recognition. We have also es",
    "link": "http://arxiv.org/abs/2309.13425",
    "context": "Title: MiliPoint: A Point Cloud Dataset for mmWave Radar. (arXiv:2309.13425v2 [cs.LG] UPDATED)\nAbstract: Millimetre-wave (mmWave) radar has emerged as an attractive and cost-effective alternative for human activity sensing compared to traditional camera-based systems. mmWave radars are also non-intrusive, providing better protection for user privacy. However, as a Radio Frequency (RF) based technology, mmWave radars rely on capturing reflected signals from objects, making them more prone to noise compared to cameras. This raises an intriguing question for the deep learning community: Can we develop more effective point set-based deep learning methods for such attractive sensors?  To answer this question, our work, termed MiliPoint, delves into this idea by providing a large-scale, open dataset for the community to explore how mmWave radars can be utilised for human activity recognition. Moreover, MiliPoint stands out as it is larger in size than existing datasets, has more diverse human actions represented, and encompasses all three key tasks in human activity recognition. We have also es",
    "path": "papers/23/09/2309.13425.json",
    "total_tokens": 927,
    "translated_title": "MiliPoint: 一种毫米波雷达的点云数据集",
    "translated_abstract": "毫米波雷达作为传统基于摄像机的系统的一种有吸引力且经济实惠的替代方案，已成为人体活动感知的一种理想选择。毫米波雷达是一种非侵入式技术，提供更好的用户隐私保护。然而，作为一种基于射频的技术，毫米波雷达依赖于捕获物体反射信号，因此相对于摄像机来说更容易受到干扰。这对于深度学习社区提出了一个有趣的问题：我们能否开发更有效的基于点集的深度学习方法来处理这种可靠的传感器？为了回答这个问题，我们的工作——MiliPoint，提供了一个大规模的开放数据集供社区探索如何利用毫米波雷达进行人体活动识别。此外，MiliPoint在大小上超过现有的数据集，代表了更多样化的人类活动，并涵盖了人体活动识别的所有三个关键任务。",
    "tldr": "MiliPoint是一个大规模、开放的点云数据集，用于探索如何利用毫米波雷达进行人体活动识别。与现有数据集相比，它具有更大的规模、更多样化的人体活动表示，并涵盖了人体活动识别的所有关键任务。"
}