{
    "title": "Molecular Conformation Generation via Shifting Scores. (arXiv:2309.09985v1 [physics.comp-ph])",
    "abstract": "Molecular conformation generation, a critical aspect of computational chemistry, involves producing the three-dimensional conformer geometry for a given molecule. Generating molecular conformation via diffusion requires learning to reverse a noising process. Diffusion on inter-atomic distances instead of conformation preserves SE(3)-equivalence and shows superior performance compared to alternative techniques, whereas related generative modelings are predominantly based upon heuristical assumptions. In response to this, we propose a novel molecular conformation generation approach driven by the observation that the disintegration of a molecule can be viewed as casting increasing force fields to its composing atoms, such that the distribution of the change of inter-atomic distance shifts from Gaussian to Maxwell-Boltzmann distribution. The corresponding generative modeling ensures a feasible inter-atomic distance geometry and exhibits time reversibility. Experimental results on molecula",
    "link": "http://arxiv.org/abs/2309.09985",
    "context": "Title: Molecular Conformation Generation via Shifting Scores. (arXiv:2309.09985v1 [physics.comp-ph])\nAbstract: Molecular conformation generation, a critical aspect of computational chemistry, involves producing the three-dimensional conformer geometry for a given molecule. Generating molecular conformation via diffusion requires learning to reverse a noising process. Diffusion on inter-atomic distances instead of conformation preserves SE(3)-equivalence and shows superior performance compared to alternative techniques, whereas related generative modelings are predominantly based upon heuristical assumptions. In response to this, we propose a novel molecular conformation generation approach driven by the observation that the disintegration of a molecule can be viewed as casting increasing force fields to its composing atoms, such that the distribution of the change of inter-atomic distance shifts from Gaussian to Maxwell-Boltzmann distribution. The corresponding generative modeling ensures a feasible inter-atomic distance geometry and exhibits time reversibility. Experimental results on molecula",
    "path": "papers/23/09/2309.09985.json",
    "total_tokens": 863,
    "translated_title": "分子构象生成的位移得分法",
    "translated_abstract": "分子构象生成是计算化学中的一个关键方面，涉及为给定的分子生成三维构象几何。通过扩散生成分子构象需要学习逆向噪声过程。使用原子间距离扩散而不是构象来保持SE(3)-等价性，并且与其他技术相比表现出更好的性能，而相关的生成模型主要基于启发式假设。针对这一问题，我们提出了一种新颖的分子构象生成方法，其动机是认为分子的解离可以被视为对其组成原子施加逐渐增大的力场，从而使得原子间距离的变化分布从高斯分布转变为麦克斯韦-玻尔兹曼分布。相应的生成模型确保了可行的原子间距离几何结构，并呈现时间可逆性。实验结果表明，该方法在分子构象生成上取得了显著的改进。",
    "tldr": "该论文提出了一种新颖的分子构象生成方法，通过将分子解离视为对其组成原子施加逐渐增大的力场，从而改变原子间距离的分布，该方法在分子构象生成方面取得了显著改进。",
    "en_tdlr": "This paper proposes a novel approach for molecular conformation generation by viewing the disintegration of a molecule as applying increasing force fields to its composing atoms, resulting in a distribution shift of inter-atomic distances. This approach demonstrates significant improvement in molecular conformation generation."
}