{
    "title": "Benchmarking Autoregressive Conditional Diffusion Models for Turbulent Flow Simulation. (arXiv:2309.01745v2 [cs.LG] UPDATED)",
    "abstract": "Simulating turbulent flows is crucial for a wide range of applications, and machine learning-based solvers are gaining increasing relevance. However, achieving temporal stability when generalizing to longer rollout horizons remains a persistent challenge for learned PDE solvers. In this work, we analyze if fully data-driven fluid solvers that utilize an autoregressive rollout based on conditional diffusion models are a viable option to address this challenge. We investigate accuracy, posterior sampling, spectral behavior, and temporal stability, while requiring that methods generalize to flow parameters beyond the training regime. To quantitatively and qualitatively benchmark the performance of a range of flow prediction approaches, three challenging scenarios including incompressible and transonic flows, as well as isotropic turbulence are employed. We find that even simple diffusion-based approaches can outperform multiple established flow prediction methods in terms of accuracy and ",
    "link": "http://arxiv.org/abs/2309.01745",
    "context": "Title: Benchmarking Autoregressive Conditional Diffusion Models for Turbulent Flow Simulation. (arXiv:2309.01745v2 [cs.LG] UPDATED)\nAbstract: Simulating turbulent flows is crucial for a wide range of applications, and machine learning-based solvers are gaining increasing relevance. However, achieving temporal stability when generalizing to longer rollout horizons remains a persistent challenge for learned PDE solvers. In this work, we analyze if fully data-driven fluid solvers that utilize an autoregressive rollout based on conditional diffusion models are a viable option to address this challenge. We investigate accuracy, posterior sampling, spectral behavior, and temporal stability, while requiring that methods generalize to flow parameters beyond the training regime. To quantitatively and qualitatively benchmark the performance of a range of flow prediction approaches, three challenging scenarios including incompressible and transonic flows, as well as isotropic turbulence are employed. We find that even simple diffusion-based approaches can outperform multiple established flow prediction methods in terms of accuracy and ",
    "path": "papers/23/09/2309.01745.json",
    "total_tokens": 890,
    "translated_title": "用于湍流流场模拟的自回归条件扩散模型的基准测试",
    "translated_abstract": "模拟湍流流场对于许多应用至关重要，而基于机器学习的求解器日益受到重视。然而，对于学习的PDE求解器来说，在推广到更长的演化时间中实现时间稳定性仍然是一个持久的挑战。在这项工作中，我们分析了完全数据驱动的流体求解器是否利用基于条件扩散模型的自回归演化是解决这一问题的可行选择。我们研究了准确性、后验采样、谱特性和时间稳定性，并要求这些方法能够推广到超出训练范围的流动参数。为了定量和定性地对一系列流场预测方法的性能进行基准测试，我们采用了三个具有挑战性的场景，包括不可压缩流动、跨音速流动和各向同性湍流。我们发现，即使是简单的基于扩散的方法在准确性和...",
    "tldr": "这项工作研究了机器学习求解器在模拟湍流流场时如何实现时间稳定性，并发现基于条件扩散模型的自回归演化方法在准确性和稳定性方面可以超越其他流场预测方法。"
}