{
    "title": "An ML-assisted OTFS vs. OFDM adaptable modem. (arXiv:2309.01319v2 [eess.SP] UPDATED)",
    "abstract": "The Orthogonal-Time-Frequency-Space (OTFS) signaling is known to be resilient to doubly-dispersive channels, which impacts high mobility scenarios. On the other hand, the Orthogonal-Frequency-Division-Multiplexing (OFDM) waveforms enjoy the benefits of the reuse of legacy architectures, simplicity of receiver design, and low-complexity detection. Several studies that compare the performance of OFDM and OTFS have indicated mixed outcomes due to the plethora of system parameters at play beyond high-mobility conditions. In this work, we exemplify this observation using simulations and propose a deep neural network (DNN)-based adaptation scheme to switch between using either an OTFS or OFDM signal processing chain at the transmitter and receiver for optimal mean-squared-error (MSE) performance. The DNN classifier is trained to switch between the two schemes by observing the channel condition, received SNR, and modulation format. We compare the performance of the OTFS, OFDM, and the propose",
    "link": "http://arxiv.org/abs/2309.01319",
    "context": "Title: An ML-assisted OTFS vs. OFDM adaptable modem. (arXiv:2309.01319v2 [eess.SP] UPDATED)\nAbstract: The Orthogonal-Time-Frequency-Space (OTFS) signaling is known to be resilient to doubly-dispersive channels, which impacts high mobility scenarios. On the other hand, the Orthogonal-Frequency-Division-Multiplexing (OFDM) waveforms enjoy the benefits of the reuse of legacy architectures, simplicity of receiver design, and low-complexity detection. Several studies that compare the performance of OFDM and OTFS have indicated mixed outcomes due to the plethora of system parameters at play beyond high-mobility conditions. In this work, we exemplify this observation using simulations and propose a deep neural network (DNN)-based adaptation scheme to switch between using either an OTFS or OFDM signal processing chain at the transmitter and receiver for optimal mean-squared-error (MSE) performance. The DNN classifier is trained to switch between the two schemes by observing the channel condition, received SNR, and modulation format. We compare the performance of the OTFS, OFDM, and the propose",
    "path": "papers/23/09/2309.01319.json",
    "total_tokens": 913,
    "translated_title": "一种基于机器学习辅助的OTFS与OFDM适应性调制解调器",
    "translated_abstract": "正交时频空（OTFS）信号具有强大的抗双重展宽信道的能力，适用于高移动情景。同时，正交频分复用（OFDM）波形可重复使用传统结构，接收机设计简单，并具有低复杂度检测的优势。许多比较OTFS和OFDM性能的研究因高移动条件下涉及大量系统参数而产生了混合结果。本文通过模拟验证了这一观察结果，并提出了一种基于深度神经网络（DNN）的自适应方案，以在发送端和接收端之间切换OTFS或OFDM信号处理链以获得最优均方误差（MSE）性能。DNN分类器通过观察信道状态、接收信噪比和调制格式来进行方案切换的训练。我们比较了OTFS、OFDM和所提出的方案的性能。",
    "tldr": "本文提出了一种基于机器学习辅助的OTFS与OFDM适应性调制解调器，通过观察信道状态、接收信噪比和调制格式，在发送端和接收端之间切换OTFS或OFDM信号处理链以获得最优均方误差（MSE）性能。",
    "en_tdlr": "This paper proposes an ML-assisted OTFS vs. OFDM adaptable modem, which switches between OTFS and OFDM signal processing chains at the transmitter and receiver based on channel condition, received SNR, and modulation format to achieve optimal MSE performance."
}