{
    "title": "Automated Bioinformatics Analysis via AutoBA. (arXiv:2309.03242v1 [q-bio.GN])",
    "abstract": "With the fast-growing and evolving omics data, the demand for streamlined and adaptable tools to handle the analysis continues to grow. In response to this need, we introduce Auto Bioinformatics Analysis (AutoBA), an autonomous AI agent based on a large language model designed explicitly for conventional omics data analysis. AutoBA simplifies the analytical process by requiring minimal user input while delivering detailed step-by-step plans for various bioinformatics tasks. Through rigorous validation by expert bioinformaticians, AutoBA's robustness and adaptability are affirmed across a diverse range of omics analysis cases, including whole genome sequencing (WGS), RNA sequencing (RNA-seq), single-cell RNA-seq, ChIP-seq, and spatial transcriptomics. AutoBA's unique capacity to self-design analysis processes based on input data variations further underscores its versatility. Compared with online bioinformatic services, AutoBA deploys the analysis locally, preserving data privacy. Moreo",
    "link": "http://arxiv.org/abs/2309.03242",
    "context": "Title: Automated Bioinformatics Analysis via AutoBA. (arXiv:2309.03242v1 [q-bio.GN])\nAbstract: With the fast-growing and evolving omics data, the demand for streamlined and adaptable tools to handle the analysis continues to grow. In response to this need, we introduce Auto Bioinformatics Analysis (AutoBA), an autonomous AI agent based on a large language model designed explicitly for conventional omics data analysis. AutoBA simplifies the analytical process by requiring minimal user input while delivering detailed step-by-step plans for various bioinformatics tasks. Through rigorous validation by expert bioinformaticians, AutoBA's robustness and adaptability are affirmed across a diverse range of omics analysis cases, including whole genome sequencing (WGS), RNA sequencing (RNA-seq), single-cell RNA-seq, ChIP-seq, and spatial transcriptomics. AutoBA's unique capacity to self-design analysis processes based on input data variations further underscores its versatility. Compared with online bioinformatic services, AutoBA deploys the analysis locally, preserving data privacy. Moreo",
    "path": "papers/23/09/2309.03242.json",
    "total_tokens": 897,
    "translated_title": "通过AutoBA实现自动化生物信息学分析",
    "translated_abstract": "随着组学数据的快速增长和演变，对处理分析的简化和适应性工具的需求不断增长。为满足这一需求，我们引入了Auto Bioinformatics Analysis (AutoBA)，这是一个基于大型语言模型的自主AI代理程序，专门设计用于传统组学数据分析。AutoBA通过需要最少的用户输入来简化分析过程，并提供详细的逐步计划，用于完成各种生物信息学任务。经过专家生物信息学家的严格验证，AutoBA的健壮性和适应性在各种组学分析案例中得到证实，包括全基因组测序（WGS），RNA测序（RNA-seq），单细胞RNA测序，ChIP-seq和空间转录组学。AutoBA的独特能力是根据输入数据的变化自设计分析流程，进一步凸显了其多功能性。与在线生物信息学服务相比，AutoBA在本地部署分析，保护数据隐私。",
    "tldr": "AutoBA是一个基于大型语言模型的自主AI代理程序，通过最少的用户输入简化生物信息学分析过程，并提供详细的逐步计划。经过验证，AutoBA在各种组学分析案例中表现出健壮性和适应性，同时保护数据隐私。",
    "en_tdlr": "AutoBA is an autonomous AI agent based on a large language model that simplifies bioinformatics analysis with minimal user input and provides detailed step-by-step plans. It has been validated to be robust and adaptable in various omics analysis cases, while preserving data privacy."
}