{
    "title": "Let Quantum Neural Networks Choose Their Own Frequencies. (arXiv:2309.03279v1 [quant-ph])",
    "abstract": "Parameterized quantum circuits as machine learning models are typically well described by their representation as a partial Fourier series of the input features, with frequencies uniquely determined by the feature map's generator Hamiltonians. Ordinarily, these data-encoding generators are chosen in advance, fixing the space of functions that can be represented. In this work we consider a generalization of quantum models to include a set of trainable parameters in the generator, leading to a trainable frequency (TF) quantum model. We numerically demonstrate how TF models can learn generators with desirable properties for solving the task at hand, including non-regularly spaced frequencies in their spectra and flexible spectral richness. Finally, we showcase the real-world effectiveness of our approach, demonstrating an improved accuracy in solving the Navier-Stokes equations using a TF model with only a single parameter added to each encoding operation. Since TF models encompass conven",
    "link": "http://arxiv.org/abs/2309.03279",
    "context": "Title: Let Quantum Neural Networks Choose Their Own Frequencies. (arXiv:2309.03279v1 [quant-ph])\nAbstract: Parameterized quantum circuits as machine learning models are typically well described by their representation as a partial Fourier series of the input features, with frequencies uniquely determined by the feature map's generator Hamiltonians. Ordinarily, these data-encoding generators are chosen in advance, fixing the space of functions that can be represented. In this work we consider a generalization of quantum models to include a set of trainable parameters in the generator, leading to a trainable frequency (TF) quantum model. We numerically demonstrate how TF models can learn generators with desirable properties for solving the task at hand, including non-regularly spaced frequencies in their spectra and flexible spectral richness. Finally, we showcase the real-world effectiveness of our approach, demonstrating an improved accuracy in solving the Navier-Stokes equations using a TF model with only a single parameter added to each encoding operation. Since TF models encompass conven",
    "path": "papers/23/09/2309.03279.json",
    "total_tokens": 888,
    "translated_title": "让量子神经网络选择自己的频率",
    "translated_abstract": "参数化量子电路作为机器学习模型，通常可以通过将输入特征的部分傅立叶级数表示来描述，其中频率由特征映射的生成哈密顿量唯一确定。通常情况下，这些数据编码生成器是提前选择的，固定了可以表示的函数空间。在这项工作中，我们考虑将量子模型推广到生成器中包括一组可训练参数的情况，从而得到一个可训练频率的量子模型。我们通过数值实验证明了可训练频率模型如何学习具有所需属性的生成器，包括其频谱中的非常规间隔频率和灵活的频谱丰富性。最后，我们展示了我们方法在现实世界中的有效性，通过使用仅对每个编码操作添加一个参数的可训练频率模型，提高了求解Navier-Stokes方程的准确性。",
    "tldr": "该论文提出了一种可训练频率的量子模型，通过在生成器中引入可训练参数，使得模型能够学习具有所需属性的生成器，包括非常规间隔频率和灵活的频谱丰富性。实验证明该方法在解决Navier-Stokes方程时具有较高的准确性。",
    "en_tdlr": "This paper introduces a trainable frequency (TF) quantum model, which allows the model to learn generators with desired properties, including non-regularly spaced frequencies and flexible spectral richness, by introducing trainable parameters in the generator. Numerical experiments demonstrate the effectiveness of this approach in solving the Navier-Stokes equations."
}