{
    "title": "Bayesian uncertainty-weighted loss for improved generalisability on polyp segmentation task. (arXiv:2309.06807v1 [cs.CV])",
    "abstract": "While several previous studies have devised methods for segmentation of polyps, most of these methods are not rigorously assessed on multi-center datasets. Variability due to appearance of polyps from one center to another, difference in endoscopic instrument grades, and acquisition quality result in methods with good performance on in-distribution test data, and poor performance on out-of-distribution or underrepresented samples. Unfair models have serious implications and pose a critical challenge to clinical applications. We adapt an implicit bias mitigation method which leverages Bayesian epistemic uncertainties during training to encourage the model to focus on underrepresented sample regions. We demonstrate the potential of this approach to improve generalisability without sacrificing state-of-the-art performance on a challenging multi-center polyp segmentation dataset (PolypGen) with different centers and image modalities.",
    "link": "http://arxiv.org/abs/2309.06807",
    "context": "Title: Bayesian uncertainty-weighted loss for improved generalisability on polyp segmentation task. (arXiv:2309.06807v1 [cs.CV])\nAbstract: While several previous studies have devised methods for segmentation of polyps, most of these methods are not rigorously assessed on multi-center datasets. Variability due to appearance of polyps from one center to another, difference in endoscopic instrument grades, and acquisition quality result in methods with good performance on in-distribution test data, and poor performance on out-of-distribution or underrepresented samples. Unfair models have serious implications and pose a critical challenge to clinical applications. We adapt an implicit bias mitigation method which leverages Bayesian epistemic uncertainties during training to encourage the model to focus on underrepresented sample regions. We demonstrate the potential of this approach to improve generalisability without sacrificing state-of-the-art performance on a challenging multi-center polyp segmentation dataset (PolypGen) with different centers and image modalities.",
    "path": "papers/23/09/2309.06807.json",
    "total_tokens": 910,
    "translated_title": "贝叶斯不确定性加权损失用于改进息识别任务的泛化能力",
    "translated_abstract": "尽管先前的研究已经提出了一些息识别的方法，但大多数这些方法没有在多中心的数据集上进行严格评估。由于不同中心息的外观变异、内窥镜仪器等级的差异和采集质量的不同，导致这些方法在内部测试数据上表现良好，而在外部测试或代表性样本上表现不佳。不公平的模型对临床应用具有严重的影响，并且对临床应用构成了重大挑战。我们采用一种隐式偏差减轻方法，利用贝叶斯认识不确定性，在训练过程中鼓励模型专注于代表性样本区域。我们在具有不同中心和图像模式的具有挑战性的多中心息分割数据集（PolypGen）上展示了这种方法改善泛化能力的潜力，而不会牺牲最先进的性能。",
    "tldr": "本研究采用贝叶斯不确定性加权损失来改善多中心息分割任务的泛化能力，避免因外观、仪器级别和采集质量的变异导致的不公平模型，并展示了该方法在挑战性的多中心数据集上具有潜在的改进能力。",
    "en_tdlr": "This study improves the generalizability of multi-center polyp segmentation task by using Bayesian uncertainty-weighted loss to mitigate unfairness caused by variability in appearance, instrument grades, and acquisition quality, and demonstrates the potential of this method on a challenging dataset."
}