{
    "title": "Granularity at Scale: Estimating Neighborhood Well-Being from High-Resolution Orthographic Imagery and Hybrid Learning. (arXiv:2309.16808v1 [cs.CV])",
    "abstract": "Many areas of the world are without basic information on the well-being of the residing population due to limitations in existing data collection methods. Overhead images obtained remotely, such as from satellite or aircraft, can help serve as windows into the state of life on the ground and help \"fill in the gaps\" where community information is sparse, with estimates at smaller geographic scales requiring higher resolution sensors. Concurrent with improved sensor resolutions, recent advancements in machine learning and computer vision have made it possible to quickly extract features from and detect patterns in image data, in the process correlating these features with other information. In this work, we explore how well two approaches, a supervised convolutional neural network and semi-supervised clustering based on bag-of-visual-words, estimate population density, median household income, and educational attainment of individual neighborhoods from publicly available high-resolution ",
    "link": "http://arxiv.org/abs/2309.16808",
    "context": "Title: Granularity at Scale: Estimating Neighborhood Well-Being from High-Resolution Orthographic Imagery and Hybrid Learning. (arXiv:2309.16808v1 [cs.CV])\nAbstract: Many areas of the world are without basic information on the well-being of the residing population due to limitations in existing data collection methods. Overhead images obtained remotely, such as from satellite or aircraft, can help serve as windows into the state of life on the ground and help \"fill in the gaps\" where community information is sparse, with estimates at smaller geographic scales requiring higher resolution sensors. Concurrent with improved sensor resolutions, recent advancements in machine learning and computer vision have made it possible to quickly extract features from and detect patterns in image data, in the process correlating these features with other information. In this work, we explore how well two approaches, a supervised convolutional neural network and semi-supervised clustering based on bag-of-visual-words, estimate population density, median household income, and educational attainment of individual neighborhoods from publicly available high-resolution ",
    "path": "papers/23/09/2309.16808.json",
    "total_tokens": 875,
    "translated_title": "大规模粒度：利用高分辨率正射影像和混合学习估计居民社区的福祉",
    "translated_abstract": "由于现有数据收集方法的局限性，世界上许多地区缺乏有关居民福祉的基本信息。通过遥感获取的高空影像，如卫星或飞机，可以作为窥视地面上生活状况的窗口，并帮助填补社区信息稀缺的地方，较小地理尺度的估计需要更高分辨率的传感器。随着传感器分辨率的提高，机器学习和计算机视觉的最新进展使得能够快速从图像数据中提取特征并检测模式，从而将这些特征与其他信息相关联。在这项工作中，我们探讨了两种方法（监督卷积神经网络和基于视觉词袋的半监督聚类）如何从公开可用的高分辨率影像中估计个别社区的人口密度、家庭收入中位数和教育程度。",
    "tldr": "本研究利用高分辨率影像和混合学习方法，通过图像数据中的特征提取和模式检测，估计了个别社区的人口密度、家庭收入中位数和教育程度。",
    "en_tdlr": "This research estimates population density, median household income, and educational attainment of individual neighborhoods using high-resolution imagery and hybrid learning methods, extracting features and detecting patterns from the image data."
}