{
    "title": "Unifying over-smoothing and over-squashing in graph neural networks: A physics informed approach and beyond. (arXiv:2309.02769v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) have emerged as one of the leading approaches for machine learning on graph-structured data. Despite their great success, critical computational challenges such as over-smoothing, over-squashing, and limited expressive power continue to impact the performance of GNNs. In this study, inspired from the time-reversal principle commonly utilized in classical and quantum physics, we reverse the time direction of the graph heat equation. The resulted reversing process yields a class of high pass filtering functions that enhance the sharpness of graph node features. Leveraging this concept, we introduce the Multi-Scaled Heat Kernel based GNN (MHKG) by amalgamating diverse filtering functions' effects on node features. To explore more flexible filtering conditions, we further generalize MHKG into a model termed G-MHKG and thoroughly show the roles of each element in controlling over-smoothing, over-squashing and expressive power. Notably, we illustrate that all afo",
    "link": "http://arxiv.org/abs/2309.02769",
    "context": "Title: Unifying over-smoothing and over-squashing in graph neural networks: A physics informed approach and beyond. (arXiv:2309.02769v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) have emerged as one of the leading approaches for machine learning on graph-structured data. Despite their great success, critical computational challenges such as over-smoothing, over-squashing, and limited expressive power continue to impact the performance of GNNs. In this study, inspired from the time-reversal principle commonly utilized in classical and quantum physics, we reverse the time direction of the graph heat equation. The resulted reversing process yields a class of high pass filtering functions that enhance the sharpness of graph node features. Leveraging this concept, we introduce the Multi-Scaled Heat Kernel based GNN (MHKG) by amalgamating diverse filtering functions' effects on node features. To explore more flexible filtering conditions, we further generalize MHKG into a model termed G-MHKG and thoroughly show the roles of each element in controlling over-smoothing, over-squashing and expressive power. Notably, we illustrate that all afo",
    "path": "papers/23/09/2309.02769.json",
    "total_tokens": 1084,
    "translated_title": "统一图神经网络中的过度平滑和过度压缩：一种物理信息驱动的方法和更多扩展",
    "translated_abstract": "图神经网络（GNNs）已经成为处理图结构数据的领先方法之一。尽管取得了巨大的成功，但是GNNs仍然面临着过度平滑、过度压缩和有限的表达能力等关键计算挑战，这些问题会影响GNNs的性能。本研究从经典和量子物理中常用的时间反演原理得到启发，将图热方程的时间方向进行反转，得到了一类高通滤波函数，可以增强图节点特征的清晰度。基于这个概念，我们引入了基于多尺度热核的图神经网络（MHKG），通过合并多种滤波函数对节点特征的影响来增强其表达能力。为了探索更灵活的滤波条件，我们进一步将MHKG推广到一个称为G-MHKG的模型，并详细展示了每个元素在控制过度平滑、过度压缩和表达能力方面的作用。值得注意的是，我们说明了所有的观测可达一个目标。",
    "tldr": "本研究提出了一种基于物理信息的方法，通过反转图热方程的时间方向，提高了图神经网络的节点特征清晰度，并引入了多尺度热核滤波函数，增强了GNNs的表达能力。进一步推广为G-MHKG模型，探索了更灵活的滤波条件，以解决过度平滑和过度压缩等计算挑战。这些方法和模型在增强GNNs性能方面具有潜力。",
    "en_tdlr": "This study proposes a physics-informed approach to improve the sharpness of graph node features in Graph Neural Networks (GNNs) by reversing the time direction of the graph heat equation. It introduces the Multi-Scaled Heat Kernel based GNN (MHKG) and further generalizes it into the G-MHKG model to address computational challenges such as over-smoothing and over-squashing. The methods and models have the potential to enhance the performance of GNNs."
}