{
    "title": "A Context-Sensitive Approach to XAI in Music Performance. (arXiv:2309.04491v1 [cs.HC])",
    "abstract": "The rapidly evolving field of Explainable Artificial Intelligence (XAI) has generated significant interest in developing methods to make AI systems more transparent and understandable. However, the problem of explainability cannot be exhaustively solved in the abstract, as there is no single approach that can be universally applied to generate adequate explanations for any given AI system, and this is especially true in the arts. In this position paper, we propose an Explanatory Pragmatism (EP) framework for XAI in music performance, emphasising the importance of context and audience in the development of explainability requirements. By tailoring explanations to specific audiences and continuously refining them based on feedback, EP offers a promising direction for enhancing the transparency and interpretability of AI systems in broad artistic applications and more specifically to music performance.",
    "link": "http://arxiv.org/abs/2309.04491",
    "context": "Title: A Context-Sensitive Approach to XAI in Music Performance. (arXiv:2309.04491v1 [cs.HC])\nAbstract: The rapidly evolving field of Explainable Artificial Intelligence (XAI) has generated significant interest in developing methods to make AI systems more transparent and understandable. However, the problem of explainability cannot be exhaustively solved in the abstract, as there is no single approach that can be universally applied to generate adequate explanations for any given AI system, and this is especially true in the arts. In this position paper, we propose an Explanatory Pragmatism (EP) framework for XAI in music performance, emphasising the importance of context and audience in the development of explainability requirements. By tailoring explanations to specific audiences and continuously refining them based on feedback, EP offers a promising direction for enhancing the transparency and interpretability of AI systems in broad artistic applications and more specifically to music performance.",
    "path": "papers/23/09/2309.04491.json",
    "total_tokens": 906,
    "translated_title": "音乐演奏中的可解释人工智能(XAI)的情境敏感方法",
    "translated_abstract": "可解释人工智能（XAI）这一快速发展的领域引起了人们对于如何使人工智能系统更透明和可理解的方法的浓厚兴趣。然而，解释性的问题不能在摘要中得到详尽解决，因为没有一种单一的方法可以普遍适用于为任何给定的人工智能系统生成足够的解释，尤其是在艺术领域。在这篇立场论文中，我们提出了一个音乐演奏中XAI的解释实用主义（EP）框架，强调了上下文和受众在解释需求的发展中的重要性。通过将解释针对特定受众并根据反馈不断改进，EP为提高广泛的艺术应用和更具体地说是音乐演奏中的人工智能系统的透明度和可解释性提供了一个有希望的方向。",
    "tldr": "这篇论文提出了一个针对音乐演奏中的可解释人工智能（XAI）的情境敏感方法，强调了上下文和受众在解释需求中的重要性，并通过针对特定受众并根据反馈不断改进解释来提高人工智能系统的透明度和可解释性。",
    "en_tdlr": "This paper proposes a context-sensitive approach to explainable artificial intelligence (XAI) in music performance, emphasizing the importance of context and audience in explaining requirements. By tailoring explanations to specific audiences and continuously refining them based on feedback, it aims to enhance the transparency and interpretability of AI systems in music performance."
}