{
    "title": "AgriSORT: A Simple Online Real-time Tracking-by-Detection framework for robotics in precision agriculture. (arXiv:2309.13393v2 [cs.CV] UPDATED)",
    "abstract": "The problem of multi-object tracking (MOT) consists in detecting and tracking all the objects in a video sequence while keeping a unique identifier for each object. It is a challenging and fundamental problem for robotics. In precision agriculture the challenge of achieving a satisfactory solution is amplified by extreme camera motion, sudden illumination changes, and strong occlusions. Most modern trackers rely on the appearance of objects rather than motion for association, which can be ineffective when most targets are static objects with the same appearance, as in the agricultural case. To this end, on the trail of SORT [5], we propose AgriSORT, a simple, online, real-time tracking-by-detection pipeline for precision agriculture based only on motion information that allows for accurate and fast propagation of tracks between frames. The main focuses of AgriSORT are efficiency, flexibility, minimal dependencies, and ease of deployment on robotic platforms. We test the proposed pipeli",
    "link": "http://arxiv.org/abs/2309.13393",
    "context": "Title: AgriSORT: A Simple Online Real-time Tracking-by-Detection framework for robotics in precision agriculture. (arXiv:2309.13393v2 [cs.CV] UPDATED)\nAbstract: The problem of multi-object tracking (MOT) consists in detecting and tracking all the objects in a video sequence while keeping a unique identifier for each object. It is a challenging and fundamental problem for robotics. In precision agriculture the challenge of achieving a satisfactory solution is amplified by extreme camera motion, sudden illumination changes, and strong occlusions. Most modern trackers rely on the appearance of objects rather than motion for association, which can be ineffective when most targets are static objects with the same appearance, as in the agricultural case. To this end, on the trail of SORT [5], we propose AgriSORT, a simple, online, real-time tracking-by-detection pipeline for precision agriculture based only on motion information that allows for accurate and fast propagation of tracks between frames. The main focuses of AgriSORT are efficiency, flexibility, minimal dependencies, and ease of deployment on robotic platforms. We test the proposed pipeli",
    "path": "papers/23/09/2309.13393.json",
    "total_tokens": 943,
    "translated_title": "AgriSORT: 一种用于农业机器人精准农业的简单在线实时检测跟踪框架",
    "translated_abstract": "多目标跟踪（MOT）问题是指在视频序列中检测和跟踪所有物体，并为每个物体保持唯一的标识符。这是机器人领域中一个具有挑战性和基础性的问题。在精准农业中，要实现令人满意的解决方案面临着摄像机运动剧烈、光照突变和严重遮挡等挑战。大多数现代跟踪器依赖于物体的外观而不是运动来进行关联，在农业领域中静止物体具有相同外观时，这种方法可能不太有效。因此，在SORT的基础上，我们提出了AgriSORT，一种简单的、在线的、实时的基于运动信息的精准农业检测跟踪流水线，可以在帧间准确且快速地传播跟踪轨迹。AgriSORT的主要关注点是效率、灵活性、最小依赖性以及在机器人平台上的易部署性。",
    "tldr": "AgriSORT是一个简单的在线实时检测跟踪框架，主要解决精准农业中的多目标跟踪问题，通过仅使用运动信息进行关联，实现了准确和快速的跟踪轨迹传播。"
}