{
    "title": "Unsupervised Multi-document Summarization with Holistic Inference. (arXiv:2309.04087v1 [cs.CL])",
    "abstract": "Multi-document summarization aims to obtain core information from a collection of documents written on the same topic. This paper proposes a new holistic framework for unsupervised multi-document extractive summarization. Our method incorporates the holistic beam search inference method associated with the holistic measurements, named Subset Representative Index (SRI). SRI balances the importance and diversity of a subset of sentences from the source documents and can be calculated in unsupervised and adaptive manners. To demonstrate the effectiveness of our method, we conduct extensive experiments on both small and large-scale multi-document summarization datasets under both unsupervised and adaptive settings. The proposed method outperforms strong baselines by a significant margin, as indicated by the resulting ROUGE scores and diversity measures. Our findings also suggest that diversity is essential for improving multi-document summary performance.",
    "link": "http://arxiv.org/abs/2309.04087",
    "context": "Title: Unsupervised Multi-document Summarization with Holistic Inference. (arXiv:2309.04087v1 [cs.CL])\nAbstract: Multi-document summarization aims to obtain core information from a collection of documents written on the same topic. This paper proposes a new holistic framework for unsupervised multi-document extractive summarization. Our method incorporates the holistic beam search inference method associated with the holistic measurements, named Subset Representative Index (SRI). SRI balances the importance and diversity of a subset of sentences from the source documents and can be calculated in unsupervised and adaptive manners. To demonstrate the effectiveness of our method, we conduct extensive experiments on both small and large-scale multi-document summarization datasets under both unsupervised and adaptive settings. The proposed method outperforms strong baselines by a significant margin, as indicated by the resulting ROUGE scores and diversity measures. Our findings also suggest that diversity is essential for improving multi-document summary performance.",
    "path": "papers/23/09/2309.04087.json",
    "total_tokens": 884,
    "translated_title": "无监督多文档综述的整体推理方法",
    "translated_abstract": "多文档综述旨在从一组关于同一主题的文档中获取核心信息。本文提出了一种新的整体框架用于无监督的多文档提取式综述。我们的方法将整体波束搜索推理方法与名为子集代表指标（SRI）的整体度量相结合。SRI平衡了来自源文档的句子子集的重要性和多样性，并可在无监督和自适应的方式下计算。为了证明我们方法的有效性，我们在小规模和大规模多文档综述数据集上进行了大量实验，包括无监督和自适应设置。根据结果的ROUGE评分和多样性指标，经过显著的差距，所提出的方法优于强基准线。我们的研究结果还表明，多样性对提高多文档综述的性能至关重要。",
    "tldr": "本文提出了一种新的整体框架，用于无监督的多文档提取式综述。通过将整体波束搜索推理方法与名为SRI的整体度量相结合，平衡了同一主题的文档中子集句子的重要性和多样性，并在不同设置下通过实验证明了方法的有效性。",
    "en_tdlr": "This paper proposes a new holistic framework for unsupervised multi-document extractive summarization. By incorporating the holistic beam search inference method with the holistic measurements, named Subset Representative Index (SRI), the importance and diversity of a subset of sentences from the source documents are balanced. Extensive experiments demonstrate the effectiveness of the proposed method in improving multi-document summary performance."
}