{
    "title": "Counterfactual Explanations via Locally-guided Sequential Algorithmic Recourse. (arXiv:2309.04211v1 [cs.LG])",
    "abstract": "Counterfactuals operationalised through algorithmic recourse have become a powerful tool to make artificial intelligence systems explainable. Conceptually, given an individual classified as y -- the factual -- we seek actions such that their prediction becomes the desired class y' -- the counterfactual. This process offers algorithmic recourse that is (1) easy to customise and interpret, and (2) directly aligned with the goals of each individual. However, the properties of a \"good\" counterfactual are still largely debated; it remains an open challenge to effectively locate a counterfactual along with its corresponding recourse. Some strategies use gradient-driven methods, but these offer no guarantees on the feasibility of the recourse and are open to adversarial attacks on carefully created manifolds. This can lead to unfairness and lack of robustness. Other methods are data-driven, which mostly addresses the feasibility problem at the expense of privacy, security and secrecy as they ",
    "link": "http://arxiv.org/abs/2309.04211",
    "context": "Title: Counterfactual Explanations via Locally-guided Sequential Algorithmic Recourse. (arXiv:2309.04211v1 [cs.LG])\nAbstract: Counterfactuals operationalised through algorithmic recourse have become a powerful tool to make artificial intelligence systems explainable. Conceptually, given an individual classified as y -- the factual -- we seek actions such that their prediction becomes the desired class y' -- the counterfactual. This process offers algorithmic recourse that is (1) easy to customise and interpret, and (2) directly aligned with the goals of each individual. However, the properties of a \"good\" counterfactual are still largely debated; it remains an open challenge to effectively locate a counterfactual along with its corresponding recourse. Some strategies use gradient-driven methods, but these offer no guarantees on the feasibility of the recourse and are open to adversarial attacks on carefully created manifolds. This can lead to unfairness and lack of robustness. Other methods are data-driven, which mostly addresses the feasibility problem at the expense of privacy, security and secrecy as they ",
    "path": "papers/23/09/2309.04211.json",
    "total_tokens": 886,
    "translated_title": "通过局部引导的顺序算法回溯实现反事实解释",
    "translated_abstract": "通过算法回溯实现的反事实解释已成为使人工智能系统可解释的强大工具。在概念上，给定一个被分类为y的个体（事实），我们寻找一些行动，使其预测成为所期望的类别y'（反事实）。这个过程提供了易于定制和解释的算法回溯，并与每个个体的目标直接对齐。然而，对一个“好”的反事实的性质仍然存在广泛的争议；如何有效地定位一个反事实及其相应的回溯仍然是一个未解决的挑战。一些策略使用梯度驱动的方法，但这些方法对回溯的可行性没有任何保证，并且容易受到对精心创建的曲面的对抗性攻击。这可能导致不公平和缺乏鲁棒性。其他方法是数据驱动的，这主要解决了可行性问题，但以隐私、安全和保密为代价。",
    "tldr": "通过局部引导的顺序算法回溯，实现了使人工智能系统可解释的反事实解释方法。然而，如何有效定位一个反事实及其回溯仍然是一个未解决的挑战。",
    "en_tdlr": "Counterfactual explanations are made possible through locally-guided sequential algorithmic recourse, providing explainability to AI systems. However, the challenge of effectively locating a counterfactual and its corresponding recourse remains unresolved."
}