{
    "title": "Variations and Relaxations of Normalizing Flows. (arXiv:2309.04433v1 [cs.LG])",
    "abstract": "Normalizing Flows (NFs) describe a class of models that express a complex target distribution as the composition of a series of bijective transformations over a simpler base distribution. By limiting the space of candidate transformations to diffeomorphisms, NFs enjoy efficient, exact sampling and density evaluation, enabling NFs to flexibly behave as both discriminative and generative models. Their restriction to diffeomorphisms, however, enforces that input, output and all intermediary spaces share the same dimension, limiting their ability to effectively represent target distributions with complex topologies. Additionally, in cases where the prior and target distributions are not homeomorphic, Normalizing Flows can leak mass outside of the support of the target. This survey covers a selection of recent works that combine aspects of other generative model classes, such as VAEs and score-based diffusion, and in doing so loosen the strict bijectivity constraints of NFs to achieve a bal",
    "link": "http://arxiv.org/abs/2309.04433",
    "context": "Title: Variations and Relaxations of Normalizing Flows. (arXiv:2309.04433v1 [cs.LG])\nAbstract: Normalizing Flows (NFs) describe a class of models that express a complex target distribution as the composition of a series of bijective transformations over a simpler base distribution. By limiting the space of candidate transformations to diffeomorphisms, NFs enjoy efficient, exact sampling and density evaluation, enabling NFs to flexibly behave as both discriminative and generative models. Their restriction to diffeomorphisms, however, enforces that input, output and all intermediary spaces share the same dimension, limiting their ability to effectively represent target distributions with complex topologies. Additionally, in cases where the prior and target distributions are not homeomorphic, Normalizing Flows can leak mass outside of the support of the target. This survey covers a selection of recent works that combine aspects of other generative model classes, such as VAEs and score-based diffusion, and in doing so loosen the strict bijectivity constraints of NFs to achieve a bal",
    "path": "papers/23/09/2309.04433.json",
    "total_tokens": 1003,
    "translated_title": "正规化流的变化和放松",
    "translated_abstract": "正规化流（NFs）描述了一类将复杂目标分布表示为简单基础分布的一系列双射变换的模型。通过将候选变换空间限制为微分同胚，NFs可以高效地进行精确采样和密度评估，使其既能灵活地作为判别模型，又能作为生成模型。然而，它们对微分同胚的限制强制输入、输出和所有中间空间具有相同的维数，限制了它们有效表示具有复杂拓扑的目标分布的能力。此外，在先验分布和目标分布不同胚的情况下，正规化流可能会将质量泄漏到目标支持之外。本综述涵盖了一系列最近的工作，将其他生成模型类别（如VAEs和基于得分的扩散）的方面结合起来，从而放宽了NFs的严格双射约束，以实现平衡约束与灵活性之间的折中",
    "tldr": "正规化流是一种模型，采用一系列双射变换将复杂目标分布表示为简单基础分布。然而，由于对微分同胚的限制，其在有效表示复杂拓扑目标分布和处理先验分布与目标分布不同胚的情况方面存在局限性。相关研究通过结合其他生成模型的特点，放宽了正规化流的约束性，以平衡约束和灵活性之间的关系",
    "en_tdlr": "Normalizing Flows (NFs) are models that represent complex target distributions as a composition of bijective transformations over a simpler base distribution. However, the restriction to diffeomorphisms limits their ability to effectively represent target distributions with complex topologies and handle cases where the prior and target distributions are not homeomorphic. Recent works have combined aspects of other generative model classes to relax the strict bijectivity constraints of NFs and achieve a balance between constraints and flexibility."
}