{
    "title": "Online ML Self-adaptation in Face of Traps. (arXiv:2309.05805v1 [cs.LG])",
    "abstract": "Online machine learning (ML) is often used in self-adaptive systems to strengthen the adaptation mechanism and improve the system utility. Despite such benefits, applying online ML for self-adaptation can be challenging, and not many papers report its limitations. Recently, we experimented with applying online ML for self-adaptation of a smart farming scenario and we had faced several unexpected difficulties -- traps -- that, to our knowledge, are not discussed enough in the community. In this paper, we report our experience with these traps. Specifically, we discuss several traps that relate to the specification and online training of the ML-based estimators, their impact on self-adaptation, and the approach used to evaluate the estimators. Our overview of these traps provides a list of lessons learned, which can serve as guidance for other researchers and practitioners when applying online ML for self-adaptation.",
    "link": "http://arxiv.org/abs/2309.05805",
    "context": "Title: Online ML Self-adaptation in Face of Traps. (arXiv:2309.05805v1 [cs.LG])\nAbstract: Online machine learning (ML) is often used in self-adaptive systems to strengthen the adaptation mechanism and improve the system utility. Despite such benefits, applying online ML for self-adaptation can be challenging, and not many papers report its limitations. Recently, we experimented with applying online ML for self-adaptation of a smart farming scenario and we had faced several unexpected difficulties -- traps -- that, to our knowledge, are not discussed enough in the community. In this paper, we report our experience with these traps. Specifically, we discuss several traps that relate to the specification and online training of the ML-based estimators, their impact on self-adaptation, and the approach used to evaluate the estimators. Our overview of these traps provides a list of lessons learned, which can serve as guidance for other researchers and practitioners when applying online ML for self-adaptation.",
    "path": "papers/23/09/2309.05805.json",
    "total_tokens": 884,
    "translated_title": "在陷阱面前的在线机器学习自适应",
    "translated_abstract": "在自适应系统中，在线机器学习（ML）经常被用来加强适应机制，提高系统效用。尽管有这些好处，应用在线ML进行自适应可能具有挑战性，而且很少有论文报告其限制。最近，我们尝试将在线ML应用于智能农业场景的自适应中，并且我们面临了一些意外的困难 - 陷阱 - 这在我们的了解中在社区中没有得到足够的讨论。在本文中，我们报告了我们在这些陷阱中的经验。具体而言，我们讨论了与基于ML的估计器的规范和在线训练有关的几个陷阱，它们对自适应的影响以及用于评估估计器的方法。我们对这些陷阱的概述提供了一系列的经验教训，可以为其他研究人员和实践者在应用在线ML进行自适应时提供指导。",
    "tldr": "这篇论文报告了将在线机器学习应用于自适应中的经验，讨论了涉及规范、在线训练和评估的陷阱，并给出了一系列的经验教训，可以为其他研究人员和实践者提供指导。",
    "en_tdlr": "This paper reports the experience of applying online machine learning to self-adaptation, discussing traps related to specification, online training, and evaluation, and providing a list of lessons learned as guidance for other researchers and practitioners."
}