{
    "title": "A Digital Forensics Case Study of the DJI Mini 3 Pro and DJI RC. (arXiv:2309.10487v1 [cs.ET])",
    "abstract": "The consumer drone market is rapidly expanding with new drone models featuring unique variations of hardware and software. The rapid development of drone technology and variability in drone systems can make it difficult for digital forensic investigators and tools to keep pace and effectively extract and analyse digital evidence from drones. Furthermore, the growing popularity of drones and their increased use in illegal and harmful activities, such as smuggling, espionage, and even terrorism, has led to an increase in the number of drone forensic cases for authorities to manage. To assist forensic investigators, a static digital forensic case study was conducted on two drone devices recently released by Da-Jiang Innovations (DJI): the Mini 3 Pro drone, and its remote controller, the DJI RC. The study discovered the presence of several digital artefacts on both devices, including recorded media, flight logs, and other information that could help investigators trace the drone's usage an",
    "link": "http://arxiv.org/abs/2309.10487",
    "context": "Title: A Digital Forensics Case Study of the DJI Mini 3 Pro and DJI RC. (arXiv:2309.10487v1 [cs.ET])\nAbstract: The consumer drone market is rapidly expanding with new drone models featuring unique variations of hardware and software. The rapid development of drone technology and variability in drone systems can make it difficult for digital forensic investigators and tools to keep pace and effectively extract and analyse digital evidence from drones. Furthermore, the growing popularity of drones and their increased use in illegal and harmful activities, such as smuggling, espionage, and even terrorism, has led to an increase in the number of drone forensic cases for authorities to manage. To assist forensic investigators, a static digital forensic case study was conducted on two drone devices recently released by Da-Jiang Innovations (DJI): the Mini 3 Pro drone, and its remote controller, the DJI RC. The study discovered the presence of several digital artefacts on both devices, including recorded media, flight logs, and other information that could help investigators trace the drone's usage an",
    "path": "papers/23/09/2309.10487.json",
    "total_tokens": 912,
    "translated_title": "DJI Mini 3 Pro和DJI RC的数字取证案例研究",
    "translated_abstract": "随着新型无人机模型推出，消费级无人机市场迅速扩大，这些无人机模型具有独特的硬件和软件变化。无人机技术的快速发展和无人机系统的多样性会给数字取证调查员和工具带来困难，难以跟上步伐并有效地提取和分析无人机的数字证据。此外，由于无人机在非法和有害活动中的使用越来越普及，如走私、间谍活动甚至恐怖主义活动，导致了执法部门处理无人机取证案例的增加。为了帮助取证调查员，对大疆创新（DJI）最近发布的两款无人机设备进行了静态数字取证案例研究，分别是Mini 3 Pro无人机和其遥控器DJI RC。研究发现了这两种设备上存在着几个数字痕迹，包括记录的媒体、飞行日志和其他信息，这些信息可以帮助调查员追踪无人机的使用情况。",
    "tldr": "该论文通过对DJI Mini 3 Pro和DJI RC的数字取证案例研究，发现了这两种无人机设备上的数字痕迹，为取证调查员提供了追踪无人机使用情况的重要信息。",
    "en_tdlr": "This paper presents a digital forensic case study on the DJI Mini 3 Pro and DJI RC, uncovering important digital artifacts that can assist investigators in tracing the usage of these drones."
}