{
    "title": "A Unified Framework for Discovering Discrete Symmetries. (arXiv:2309.02898v1 [cs.LG])",
    "abstract": "We consider the problem of learning a function respecting a symmetry from among a class of symmetries. We develop a unified framework that enables symmetry discovery across a broad range of subgroups including locally symmetric, dihedral and cyclic subgroups. At the core of the framework is a novel architecture composed of linear and tensor-valued functions that expresses functions invariant to these subgroups in a principled manner. The structure of the architecture enables us to leverage multi-armed bandit algorithms and gradient descent to efficiently optimize over the linear and the tensor-valued functions, respectively, and to infer the symmetry that is ultimately learnt. We also discuss the necessity of the tensor-valued functions in the architecture. Experiments on image-digit sum and polynomial regression tasks demonstrate the effectiveness of our approach.",
    "link": "http://arxiv.org/abs/2309.02898",
    "context": "Title: A Unified Framework for Discovering Discrete Symmetries. (arXiv:2309.02898v1 [cs.LG])\nAbstract: We consider the problem of learning a function respecting a symmetry from among a class of symmetries. We develop a unified framework that enables symmetry discovery across a broad range of subgroups including locally symmetric, dihedral and cyclic subgroups. At the core of the framework is a novel architecture composed of linear and tensor-valued functions that expresses functions invariant to these subgroups in a principled manner. The structure of the architecture enables us to leverage multi-armed bandit algorithms and gradient descent to efficiently optimize over the linear and the tensor-valued functions, respectively, and to infer the symmetry that is ultimately learnt. We also discuss the necessity of the tensor-valued functions in the architecture. Experiments on image-digit sum and polynomial regression tasks demonstrate the effectiveness of our approach.",
    "path": "papers/23/09/2309.02898.json",
    "total_tokens": 840,
    "translated_title": "发现离散对称的统一框架",
    "translated_abstract": "我们考虑从一类对称性中学习一个符合对称性的函数的问题。我们开发了一个统一框架，能够发现包括局部对称、二面角和循环子群在内的广泛子群的对称性。该框架的核心是一种由线性和张量值函数组成的新颖架构，以原则性的方式表达这些子群不变的函数。架构的结构使我们能够利用多臂赌博算法和梯度下降分别高效优化线性和张量值函数，并推断出最终学习到的对称性。我们还讨论了架构中张量值函数的必要性。对图像数字求和和多项式回归任务的实验结果证明了我们方法的有效性。",
    "tldr": "本文提出了一个统一框架，能够发现各种类型的对称性，通过使用线性和张量值函数构成的新颖架构，在多臂赌博算法和梯度下降的帮助下，高效地优化并学习到对称性。在图像数字求和和多项式回归任务上的实验证明了该方法的有效性。"
}