{
    "title": "Missing-modality Enabled Multi-modal Fusion Architecture for Medical Data. (arXiv:2309.15529v1 [eess.IV])",
    "abstract": "Fusing multi-modal data can improve the performance of deep learning models. However, missing modalities are common for medical data due to patients' specificity, which is detrimental to the performance of multi-modal models in applications. Therefore, it is critical to adapt the models to missing modalities. This study aimed to develop an efficient multi-modal fusion architecture for medical data that was robust to missing modalities and further improved the performance on disease diagnosis.X-ray chest radiographs for the image modality, radiology reports for the text modality, and structured value data for the tabular data modality were fused in this study. Each modality pair was fused with a Transformer-based bi-modal fusion module, and the three bi-modal fusion modules were then combined into a tri-modal fusion framework. Additionally, multivariate loss functions were introduced into the training process to improve model's robustness to missing modalities in the inference process. ",
    "link": "http://arxiv.org/abs/2309.15529",
    "context": "Title: Missing-modality Enabled Multi-modal Fusion Architecture for Medical Data. (arXiv:2309.15529v1 [eess.IV])\nAbstract: Fusing multi-modal data can improve the performance of deep learning models. However, missing modalities are common for medical data due to patients' specificity, which is detrimental to the performance of multi-modal models in applications. Therefore, it is critical to adapt the models to missing modalities. This study aimed to develop an efficient multi-modal fusion architecture for medical data that was robust to missing modalities and further improved the performance on disease diagnosis.X-ray chest radiographs for the image modality, radiology reports for the text modality, and structured value data for the tabular data modality were fused in this study. Each modality pair was fused with a Transformer-based bi-modal fusion module, and the three bi-modal fusion modules were then combined into a tri-modal fusion framework. Additionally, multivariate loss functions were introduced into the training process to improve model's robustness to missing modalities in the inference process. ",
    "path": "papers/23/09/2309.15529.json",
    "total_tokens": 993,
    "translated_title": "医疗数据的缺失模态启用多模态融合架构",
    "translated_abstract": "融合多模态数据可以提高深度学习模型的性能。然而，由于患者具体情况，医疗数据中的缺失模态是常见的，这对应用中的多模态模型的性能有害。因此，对于缺失模态对模型进行适应是至关重要的。本研究旨在开发一种对缺失模态具有鲁棒性且能进一步改善疾病诊断性能的医疗数据的高效多模态融合架构。本研究融合了X射线胸部放射照片作为图像模态，放射学报告作为文本模态，以及结构化值数据作为表格数据模态。每个模态对都通过基于Transformer的双模态融合模块进行融合，然后将这三个双模态融合模块组合成三模态融合框架。此外，还引入了多变量损失函数到训练过程中，以提高模型在推理过程中对缺失模态的鲁棒性。",
    "tldr": "这项研究提出了一种对医疗数据具有鲁棒性且能进一步提高疾病诊断性能的多模态融合架构。通过融合X射线照片、放射学报告和结构化数据，使用Transformer模块进行融合，同时引入了多变量损失函数提高模型在缺失模态情况下的鲁棒性。"
}