{
    "title": "Topological Data Mapping of Online Hate Speech, Misinformation, and General Mental Health: A Large Language Model Based Study. (arXiv:2309.13098v1 [cs.LG])",
    "abstract": "The advent of social media has led to an increased concern over its potential to propagate hate speech and misinformation, which, in addition to contributing to prejudice and discrimination, has been suspected of playing a role in increasing social violence and crimes in the United States. While literature has shown the existence of an association between posting hate speech and misinformation online and certain personality traits of posters, the general relationship and relevance of online hate speech/misinformation in the context of overall psychological wellbeing of posters remain elusive. One difficulty lies in the lack of adequate data analytics tools capable of adequately analyzing the massive amount of social media posts to uncover the underlying hidden links. Recent progresses in machine learning and large language models such as ChatGPT have made such an analysis possible. In this study, we collected thousands of posts from carefully selected communities on the social media si",
    "link": "http://arxiv.org/abs/2309.13098",
    "context": "Title: Topological Data Mapping of Online Hate Speech, Misinformation, and General Mental Health: A Large Language Model Based Study. (arXiv:2309.13098v1 [cs.LG])\nAbstract: The advent of social media has led to an increased concern over its potential to propagate hate speech and misinformation, which, in addition to contributing to prejudice and discrimination, has been suspected of playing a role in increasing social violence and crimes in the United States. While literature has shown the existence of an association between posting hate speech and misinformation online and certain personality traits of posters, the general relationship and relevance of online hate speech/misinformation in the context of overall psychological wellbeing of posters remain elusive. One difficulty lies in the lack of adequate data analytics tools capable of adequately analyzing the massive amount of social media posts to uncover the underlying hidden links. Recent progresses in machine learning and large language models such as ChatGPT have made such an analysis possible. In this study, we collected thousands of posts from carefully selected communities on the social media si",
    "path": "papers/23/09/2309.13098.json",
    "total_tokens": 827,
    "translated_title": "在线仇恨言论、虚假信息和心理健康的拓扑数据映射：一项基于大型语言模型的研究",
    "translated_abstract": "社交媒体的出现引发了人们对其传播仇恨言论和虚假信息的潜力的担忧，除了导致偏见和歧视，还被怀疑在增加美国社会暴力和犯罪方面起到一定作用。尽管文献已经表明在线发布仇恨言论和虚假信息与发帖者的某些人格特征之间存在关联，但在线仇恨言论/虚假信息与发帖者整体心理健康的关系和相关性仍然不明确。其中一个困难在于缺乏适当的数据分析工具，能够足够分析海量的社交媒体帖子以揭示潜在的隐藏联系。近年来，机器学习和大型语言模型（如ChatGPT）的进展使得这种分析成为可能。本研究收集了精心选择的社交媒体平台上的数千条帖子。",
    "tldr": "该研究使用大型语言模型分析了社交媒体上的在线仇恨言论、虚假信息和心理健康之间的关系。"
}