{
    "title": "Towards Robust Natural-Looking Mammography Lesion Synthesis on Ipsilateral Dual-Views Breast Cancer Analysis. (arXiv:2309.03506v1 [cs.CV])",
    "abstract": "In recent years, many mammographic image analysis methods have been introduced for improving cancer classification tasks. Two major issues of mammogram classification tasks are leveraging multi-view mammographic information and class-imbalance handling. In the first problem, many multi-view methods have been released for concatenating features of two or more views for the training and inference stage. Having said that, most multi-view existing methods are not explainable in the meaning of feature fusion, and treat many views equally for diagnosing. Our work aims to propose a simple but novel method for enhancing examined view (main view) by leveraging low-level feature information from the auxiliary view (ipsilateral view) before learning the high-level feature that contains the cancerous features. For the second issue, we also propose a simple but novel malignant mammogram synthesis framework for upsampling minor class samples. Our easy-to-implement and no-training framework has elimi",
    "link": "http://arxiv.org/abs/2309.03506",
    "context": "Title: Towards Robust Natural-Looking Mammography Lesion Synthesis on Ipsilateral Dual-Views Breast Cancer Analysis. (arXiv:2309.03506v1 [cs.CV])\nAbstract: In recent years, many mammographic image analysis methods have been introduced for improving cancer classification tasks. Two major issues of mammogram classification tasks are leveraging multi-view mammographic information and class-imbalance handling. In the first problem, many multi-view methods have been released for concatenating features of two or more views for the training and inference stage. Having said that, most multi-view existing methods are not explainable in the meaning of feature fusion, and treat many views equally for diagnosing. Our work aims to propose a simple but novel method for enhancing examined view (main view) by leveraging low-level feature information from the auxiliary view (ipsilateral view) before learning the high-level feature that contains the cancerous features. For the second issue, we also propose a simple but novel malignant mammogram synthesis framework for upsampling minor class samples. Our easy-to-implement and no-training framework has elimi",
    "path": "papers/23/09/2309.03506.json",
    "total_tokens": 1031,
    "translated_title": "实现对同侧双视角乳腺癌分析中健壮的自然外观乳腺X线造影病灶合成",
    "translated_abstract": "近年来，为了改善乳腺癌分类任务，引入了许多乳腺X线造影图像分析方法。乳腺X线造影图像分类任务的两个主要问题是利用多视角的乳腺X线造影信息和处理类别不平衡。对于第一个问题，已经发布了许多多视角方法，用于将两个或多个视角的特征在训练和推理阶段进行拼接。尽管如此，大多数多视角的现有方法在特征融合的意义上并不具备解释性，并且在诊断时对许多视角平等对待。我们的工作旨在提出一种简单但新颖的方法，通过利用辅助视角（同侧视角）的低层特征信息，增强检查视角（主要视角），然后学习包含癌变特征的高层特征。对于第二个问题，我们还提出了一种简单但新颖的恶性乳腺X线造影合成框架，用于上采样少数类样本。我们易于实施且无需训练的框架已经消除了",
    "tldr": "这篇论文提出了一种简单且新颖的方法，通过利用辅助视角的低层特征信息来增强乳腺X线造影图像的主要视角，然后学习包含癌变特征的高层特征。此外，还提出了一种简单且新颖的恶性乳腺X线造影合成框架，用于上采样少数类样本。"
}