{
    "title": "Desenvolvimento de modelo para predi\\c{c}\\~ao de cota\\c{c}\\~oes de a\\c{c}\\~ao baseada em an\\'alise de sentimentos de tweets. (arXiv:2309.06538v1 [q-fin.ST])",
    "abstract": "Training machine learning models for predicting stock market share prices is an active area of research since the automatization of trading such papers was available in real time. While most of the work in this field of research is done by training Neural networks based on past prices of stock shares, in this work, we use iFeel 2.0 platform to extract 19 sentiment features from posts obtained from microblog platform Twitter that mention the company Petrobras. Then, we used those features to train XBoot models to predict future stock prices for the referred company. Later, we simulated the trading of Petrobras' shares based on the model's outputs and determined the gain of R$88,82 (net) in a 250-day period when compared to a 100 random models' average performance.",
    "link": "http://arxiv.org/abs/2309.06538",
    "context": "Title: Desenvolvimento de modelo para predi\\c{c}\\~ao de cota\\c{c}\\~oes de a\\c{c}\\~ao baseada em an\\'alise de sentimentos de tweets. (arXiv:2309.06538v1 [q-fin.ST])\nAbstract: Training machine learning models for predicting stock market share prices is an active area of research since the automatization of trading such papers was available in real time. While most of the work in this field of research is done by training Neural networks based on past prices of stock shares, in this work, we use iFeel 2.0 platform to extract 19 sentiment features from posts obtained from microblog platform Twitter that mention the company Petrobras. Then, we used those features to train XBoot models to predict future stock prices for the referred company. Later, we simulated the trading of Petrobras' shares based on the model's outputs and determined the gain of R$88,82 (net) in a 250-day period when compared to a 100 random models' average performance.",
    "path": "papers/23/09/2309.06538.json",
    "total_tokens": 859,
    "translated_title": "基于推特情感分析的股票报价预测模型的开发",
    "translated_abstract": "自动化交易这样的研究领域中，训练机器学习模型来预测股票市场的股价是一个活跃的研究领域。虽然大部分的研究工作是基于过去的股票价格训练神经网络，但在本研究中，我们使用iFeel 2.0平台从微博平台Twitter上获得的提及巴西石油公司的帖子中提取了19个情感特征。然后，我们使用这些特征来训练XBoot模型，以预测该公司未来的股票价格。随后，我们基于模型的输出模拟了巴西石油公司股票的交易，并与100个随机模型的平均表现相比，在250天的时间段内获得了88.82雷亚尔（净）的收益。",
    "tldr": "本研究开发了一个基于推特情感分析的股票报价预测模型，通过从Twitter上的帖子中提取情感特征，使用这些特征训练模型，并在实际交易中取得了88.82雷亚尔的净收益。",
    "en_tdlr": "This study develops a model for predicting stock market share prices based on sentiment analysis of tweets, achieving a net gain of R$88.82 through extracting sentiment features from Twitter posts and training the model."
}