{
    "title": "Source Camera Identification and Detection in Digital Videos through Blind Forensics. (arXiv:2309.03353v1 [cs.CV])",
    "abstract": "Source camera identification in digital videos is the problem of associating an unknown digital video with its source device, within a closed set of possible devices. The existing techniques in source detection of digital videos try to find a fingerprint of the actual source in the video in form of PRNU (Photo Response Non--Uniformity), and match it against the SPN (Sensor Pattern Noise) of each possible device. The highest correlation indicates the correct source. We investigate the problem of identifying a video source through a feature based approach using machine learning. In this paper, we present a blind forensic technique of video source authentication and identification, based on feature extraction, feature selection and subsequent source classification. The main aim is to determine whether a claimed source for a video is actually its original source. If not, we identify its original source. Our experimental results prove the efficiency of the proposed method compared to tradit",
    "link": "http://arxiv.org/abs/2309.03353",
    "context": "Title: Source Camera Identification and Detection in Digital Videos through Blind Forensics. (arXiv:2309.03353v1 [cs.CV])\nAbstract: Source camera identification in digital videos is the problem of associating an unknown digital video with its source device, within a closed set of possible devices. The existing techniques in source detection of digital videos try to find a fingerprint of the actual source in the video in form of PRNU (Photo Response Non--Uniformity), and match it against the SPN (Sensor Pattern Noise) of each possible device. The highest correlation indicates the correct source. We investigate the problem of identifying a video source through a feature based approach using machine learning. In this paper, we present a blind forensic technique of video source authentication and identification, based on feature extraction, feature selection and subsequent source classification. The main aim is to determine whether a claimed source for a video is actually its original source. If not, we identify its original source. Our experimental results prove the efficiency of the proposed method compared to tradit",
    "path": "papers/23/09/2309.03353.json",
    "total_tokens": 833,
    "translated_title": "数字视频中的源摄像机识别与检测的盲取证技术",
    "translated_abstract": "数字视频中的源摄像机识别是将未知数字视频与其源设备关联起来，在可能设备的有限集合内进行。存在的源检测技术试图在视频中找到实际源的指纹，采用PRNU（光响应非均匀性）的形式，并将其与每个可能设备的SPN（传感器模式噪声）进行匹配。最高的相关性表示正确的源。我们采用基于特征的机器学习方法来研究视频源的识别问题。通过特征提取、特征选择和后续源分类，本文提出了一种盲取证技术，用于视频源的认证和识别。主要目的是确定视频的声明源是否为其原始源，如果不是，我们将识别其原始源。我们的实验结果证明了所提方法相对于传统方法的高效性。",
    "tldr": "本文提出了一种盲取证技术，用于数字视频中源摄像机的识别与检测，通过机器学习的特征提取、特征选择和源分类，有效地确定视频的原始源。"
}