{
    "title": "CC-SGG: Corner Case Scenario Generation using Learned Scene Graphs",
    "abstract": "Corner case scenarios are an essential tool for testing and validating the safety of autonomous vehicles (AVs). As these scenarios are often insufficiently present in naturalistic driving datasets, augmenting the data with synthetic corner cases greatly enhances the safe operation of AVs in unique situations. However, the generation of synthetic, yet realistic, corner cases poses a significant challenge. In this work, we introduce a novel approach based on Heterogeneous Graph Neural Networks (HGNNs) to transform regular driving scenarios into corner cases. To achieve this, we first generate concise representations of regular driving scenes as scene graphs, minimally manipulating their structure and properties. Our model then learns to perturb those graphs to generate corner cases using attention and triple embeddings. The input and perturbed graphs are then imported back into the simulation to generate corner case scenarios. Our model successfully learned to produce corner cases from i",
    "link": "https://arxiv.org/abs/2309.09844",
    "context": "Title: CC-SGG: Corner Case Scenario Generation using Learned Scene Graphs\nAbstract: Corner case scenarios are an essential tool for testing and validating the safety of autonomous vehicles (AVs). As these scenarios are often insufficiently present in naturalistic driving datasets, augmenting the data with synthetic corner cases greatly enhances the safe operation of AVs in unique situations. However, the generation of synthetic, yet realistic, corner cases poses a significant challenge. In this work, we introduce a novel approach based on Heterogeneous Graph Neural Networks (HGNNs) to transform regular driving scenarios into corner cases. To achieve this, we first generate concise representations of regular driving scenes as scene graphs, minimally manipulating their structure and properties. Our model then learns to perturb those graphs to generate corner cases using attention and triple embeddings. The input and perturbed graphs are then imported back into the simulation to generate corner case scenarios. Our model successfully learned to produce corner cases from i",
    "path": "papers/23/09/2309.09844.json",
    "total_tokens": 908,
    "translated_title": "CC-SGG: 使用学习的场景图生成边界情况场景",
    "translated_abstract": "边界情况场景对于测试和验证自主驾驶车辆（AV）的安全性至关重要。由于这些场景在自然驾驶数据集中通常不足，因此使用合成的边界情况数据可以极大地增强AV在独特情况下的安全操作。然而，生成合成的、真实但又逼真的边界情况场景是一个重要挑战。在这项工作中，我们介绍了一种基于异构图神经网络（HGNNs）的新方法，将普通驾驶场景转换为边界情况场景。为了实现这一目标，我们首先将普通驾驶场景生成简洁的场景图形式，最小化对其结构和属性的改变。然后，我们的模型通过注意力和三元嵌入来学习扰动这些图形以生成边界情况。输入和扰动后的图形再次导入模拟器以生成边界情况场景。我们的模型成功学习到从普通场景生成边界情况的能力。",
    "tldr": "本研究介绍了一种采用异构图神经网络的新方法，将普通驾驶场景转化为边界情况场景。通过生成简洁的场景图，并利用注意力和三元嵌入扰动图形，我们的模型成功学习到生成边界情况的能力。",
    "en_tdlr": "This paper presents a novel approach using Heterogeneous Graph Neural Networks (HGNNs) to transform regular driving scenarios into corner case scenarios. By generating concise scene graphs and perturbing them using attention and triple embeddings, the model successfully learns to generate corner cases."
}