{
    "title": "Decentralized Token Economy Theory (DeTEcT). (arXiv:2309.12330v1 [q-fin.GN])",
    "abstract": "This paper presents a pioneering approach for token pricing in token economies for risk mitigation and economic stability. The paper proposes a framework for simulating interactions between economic participants that leads to the distribution of wealth within the economy. Using this framework, we define a mechanism for identifying prices that achieve optimal token distribution according to some metric and stability of economic dynamics. The motivation to study tokenomics theory is the increasing use of tokenization, specifically in financial infrastructures, where designing token economies is in the forefront. Tokenomics theory establishes a quantitative framework for token allocation amongst economic participants and implements the algorithmic regulatory controls mechanism that reacts to changes in economic conditions, much like a command economy. In our framework, we introduce a concept of tokenomic taxonomy where agents in the economy are categorized into agent types and interaction",
    "link": "http://arxiv.org/abs/2309.12330",
    "context": "Title: Decentralized Token Economy Theory (DeTEcT). (arXiv:2309.12330v1 [q-fin.GN])\nAbstract: This paper presents a pioneering approach for token pricing in token economies for risk mitigation and economic stability. The paper proposes a framework for simulating interactions between economic participants that leads to the distribution of wealth within the economy. Using this framework, we define a mechanism for identifying prices that achieve optimal token distribution according to some metric and stability of economic dynamics. The motivation to study tokenomics theory is the increasing use of tokenization, specifically in financial infrastructures, where designing token economies is in the forefront. Tokenomics theory establishes a quantitative framework for token allocation amongst economic participants and implements the algorithmic regulatory controls mechanism that reacts to changes in economic conditions, much like a command economy. In our framework, we introduce a concept of tokenomic taxonomy where agents in the economy are categorized into agent types and interaction",
    "path": "papers/23/09/2309.12330.json",
    "total_tokens": 923,
    "translated_title": "去中心化代币经济理论（DeTEcT）",
    "translated_abstract": "本文提出了一种用于风险缓解和经济稳定的代币经济定价的开创性方法。该文提出了一个模拟经济参与者之间互动的框架，以实现经济内财富的分配。利用该框架，我们定义了一种机制，用于根据某个指标实现最佳代币分布的定价，并确保经济动态的稳定性。研究代币经济理论的动机是代币化的增加使用，特别是在金融基础设施中，设计代币经济正处于前沿。代币经济理论为经济参与者之间的代币分配建立了一个定量框架，并实现了类似计划经济的算法调控机制，对经济条件的变化做出反应。在我们的框架中，我们引入了代币经济分类的概念，将经济中的代理人分为不同类型，并进行交互。",
    "tldr": "本文提出一种用于代币经济定价的开创性方法，通过模拟经济参与者之间的交互，实现经济内财富的分配。该方法为实现最佳代币分布的定价提供了机制，并确保经济动态的稳定性。该研究的动机是代币化的增加使用，特别是在金融基础设施中，设计代币经济正处于前沿。",
    "en_tdlr": "This paper presents a pioneering approach for token pricing in token economies for risk mitigation and economic stability. It proposes a mechanism to achieve optimal token distribution and stability of economic dynamics by simulating interactions between economic participants."
}