{
    "title": "KuaiSim: A Comprehensive Simulator for Recommender Systems. (arXiv:2309.12645v1 [cs.IR])",
    "abstract": "Reinforcement Learning (RL)-based recommender systems (RSs) have garnered considerable attention due to their ability to learn optimal recommendation policies and maximize long-term user rewards. However, deploying RL models directly in online environments and generating authentic data through A/B tests can pose challenges and require substantial resources. Simulators offer an alternative approach by providing training and evaluation environments for RS models, reducing reliance on real-world data. Existing simulators have shown promising results but also have limitations such as simplified user feedback, lacking consistency with real-world data, the challenge of simulator evaluation, and difficulties in migration and expansion across RSs. To address these challenges, we propose KuaiSim, a comprehensive user environment that provides user feedback with multi-behavior and cross-session responses. The resulting simulator can support three levels of recommendation problems: the request le",
    "link": "http://arxiv.org/abs/2309.12645",
    "context": "Title: KuaiSim: A Comprehensive Simulator for Recommender Systems. (arXiv:2309.12645v1 [cs.IR])\nAbstract: Reinforcement Learning (RL)-based recommender systems (RSs) have garnered considerable attention due to their ability to learn optimal recommendation policies and maximize long-term user rewards. However, deploying RL models directly in online environments and generating authentic data through A/B tests can pose challenges and require substantial resources. Simulators offer an alternative approach by providing training and evaluation environments for RS models, reducing reliance on real-world data. Existing simulators have shown promising results but also have limitations such as simplified user feedback, lacking consistency with real-world data, the challenge of simulator evaluation, and difficulties in migration and expansion across RSs. To address these challenges, we propose KuaiSim, a comprehensive user environment that provides user feedback with multi-behavior and cross-session responses. The resulting simulator can support three levels of recommendation problems: the request le",
    "path": "papers/23/09/2309.12645.json",
    "total_tokens": 901,
    "translated_title": "KuaiSim：一个用于推荐系统的综合模拟器",
    "translated_abstract": "基于强化学习的推荐系统因其能够学习最优推荐策略并最大化长期用户回报的能力而受到广泛关注。然而，直接在在线环境中部署强化学习模型并通过A/B测试生成真实数据可能会面临挑战并需要大量资源。模拟器提供了一种替代方法，为推荐系统模型提供训练和评估环境，减少对真实世界数据的依赖。现有的模拟器已经取得了有希望的结果，但也存在一些限制，如用户反馈过于简化、缺乏与真实世界数据的一致性、模拟器评估的挑战以及在不同推荐系统之间的迁移和扩展困难。为了解决这些问题，我们提出了KuaiSim，一个提供用户反馈具有多行为和跨会话响应的综合用户环境。所得到的模拟器能够支持三个层次的推荐问题：请求等级、 用户意图预测、 和序列预测。",
    "tldr": "KuaiSim是推荐系统的一个综合模拟器，提供了更真实的用户反馈和多种行为响应。它能够解决强化学习模型在线部署和生成真实数据的挑战，并支持不同层次的推荐问题。",
    "en_tdlr": "KuaiSim is a comprehensive simulator for recommender systems that provides more realistic user feedback and various behavior responses. It addresses the challenges of deploying RL models online and generating authentic data, and supports different levels of recommendation problems."
}