{
    "title": "Flows for Flows: Morphing one Dataset into another with Maximum Likelihood Estimation. (arXiv:2309.06472v1 [hep-ph])",
    "abstract": "Many components of data analysis in high energy physics and beyond require morphing one dataset into another. This is commonly solved via reweighting, but there are many advantages of preserving weights and shifting the data points instead. Normalizing flows are machine learning models with impressive precision on a variety of particle physics tasks. Naively, normalizing flows cannot be used for morphing because they require knowledge of the probability density of the starting dataset. In most cases in particle physics, we can generate more examples, but we do not know densities explicitly. We propose a protocol called flows for flows for training normalizing flows to morph one dataset into another even if the underlying probability density of neither dataset is known explicitly. This enables a morphing strategy trained with maximum likelihood estimation, a setup that has been shown to be highly effective in related tasks. We study variations on this protocol to explore how far the dat",
    "link": "http://arxiv.org/abs/2309.06472",
    "context": "Title: Flows for Flows: Morphing one Dataset into another with Maximum Likelihood Estimation. (arXiv:2309.06472v1 [hep-ph])\nAbstract: Many components of data analysis in high energy physics and beyond require morphing one dataset into another. This is commonly solved via reweighting, but there are many advantages of preserving weights and shifting the data points instead. Normalizing flows are machine learning models with impressive precision on a variety of particle physics tasks. Naively, normalizing flows cannot be used for morphing because they require knowledge of the probability density of the starting dataset. In most cases in particle physics, we can generate more examples, but we do not know densities explicitly. We propose a protocol called flows for flows for training normalizing flows to morph one dataset into another even if the underlying probability density of neither dataset is known explicitly. This enables a morphing strategy trained with maximum likelihood estimation, a setup that has been shown to be highly effective in related tasks. We study variations on this protocol to explore how far the dat",
    "path": "papers/23/09/2309.06472.json",
    "total_tokens": 891,
    "translated_title": "数据流转：用最大似然估计将一个数据集变形成另一个数据集",
    "translated_abstract": "在高能物理和其他领域的数据分析中，许多组件需要将一个数据集变形成另一个数据集。通常通过重新加权来解决，但保留权重并移动数据点有许多优势。规范化流是具有令人印象深刻的精度的机器学习模型，在各种粒子物理任务上表现出色。但规范化流不能直接用于数据流转，因为它们需要对起始数据集的概率密度有所了解。在大多数粒子物理案例中，我们可以生成更多示例，但我们并不明确知道密度。我们提出了一种称为\"flows for flows\"的协议，用于训练规范化流将一个数据集变形成另一个数据集，即使两个数据集的概率密度都不明确。这使得可以使用最大似然估计训练变形策略，而该设置已证明在相关任务中非常有效。我们研究了这个协议的多种变体，以探索数据流转的极限程度。",
    "tldr": "该论文提出了一种名为\"flows for flows\"的协议，用于通过最大似然估计训练规范化流将一个数据集变形成另一个数据集，即使两个数据集的概率密度都不明确。",
    "en_tdlr": "This paper proposes a protocol called \"flows for flows\" to train normalizing flows using maximum likelihood estimation in order to morph one dataset into another, even when the probability density of both datasets is unknown."
}