{
    "title": "Leveraging SE(3) Equivariance for Learning 3D Geometric Shape Assembly. (arXiv:2309.06810v1 [cs.CV])",
    "abstract": "Shape assembly aims to reassemble parts (or fragments) into a complete object, which is a common task in our daily life. Different from the semantic part assembly (e.g., assembling a chair's semantic parts like legs into a whole chair), geometric part assembly (e.g., assembling bowl fragments into a complete bowl) is an emerging task in computer vision and robotics. Instead of semantic information, this task focuses on geometric information of parts. As the both geometric and pose space of fractured parts are exceptionally large, shape pose disentanglement of part representations is beneficial to geometric shape assembly. In our paper, we propose to leverage SE(3) equivariance for such shape pose disentanglement. Moreover, while previous works in vision and robotics only consider SE(3) equivariance for the representations of single objects, we move a step forward and propose leveraging SE(3) equivariance for representations considering multi-part correlations, which further boosts the ",
    "link": "http://arxiv.org/abs/2309.06810",
    "context": "Title: Leveraging SE(3) Equivariance for Learning 3D Geometric Shape Assembly. (arXiv:2309.06810v1 [cs.CV])\nAbstract: Shape assembly aims to reassemble parts (or fragments) into a complete object, which is a common task in our daily life. Different from the semantic part assembly (e.g., assembling a chair's semantic parts like legs into a whole chair), geometric part assembly (e.g., assembling bowl fragments into a complete bowl) is an emerging task in computer vision and robotics. Instead of semantic information, this task focuses on geometric information of parts. As the both geometric and pose space of fractured parts are exceptionally large, shape pose disentanglement of part representations is beneficial to geometric shape assembly. In our paper, we propose to leverage SE(3) equivariance for such shape pose disentanglement. Moreover, while previous works in vision and robotics only consider SE(3) equivariance for the representations of single objects, we move a step forward and propose leveraging SE(3) equivariance for representations considering multi-part correlations, which further boosts the ",
    "path": "papers/23/09/2309.06810.json",
    "total_tokens": 863,
    "translated_title": "利用SE(3)等变性学习3D几何形状组装",
    "translated_abstract": "形状组装旨在将部件（或碎片）重新组装成完整的物体，这是我们日常生活中的常见任务。与语义部件组装（例如，将椅子的语义部件如腿组装成整个椅子）不同，几何部件组装（例如，将碗碎片组装成完整的碗）是计算机视觉和机器人技术中的一项新兴任务。这个任务不关注部件的语义信息，而是关注部件的几何信息。由于断裂部件的几何和姿态空间都异常庞大，对部件表示进行形状姿态解缠是有益的。在这篇论文中，我们提出利用SE（3）等变性来进行形状姿态解缠。此外，以往的视觉和机器人工作只考虑单个对象的SE（3）等变性表示，而我们更进一步提出利用SE（3）等变性来考虑多部件关联的表示，从而进一步提升了...",
    "tldr": "该论文提出了利用SE(3)等变性来进行3D几何形状组装，并考虑了多部件关联的表示，进一步提升了组装效果。",
    "en_tdlr": "This paper proposes leveraging SE(3) equivariance for 3D geometric shape assembly and considers representations with multi-part correlations, further improving the assembly performance."
}