{
    "title": "Dynamic relationship between XRP price and correlation tensor spectra of the transaction network. (arXiv:2309.05935v1 [q-fin.ST])",
    "abstract": "The emergence of cryptoassets has sparked a paradigm shift in the world of finance and investment, ushering in a new era of digital assets with profound implications for the future of currency and asset management. A recent study showed that during the bubble period around the year, 2018, the price of cryptoasset, XRP has a strong anti correlation with the largest singular values of the correlation tensors obtained from the weekly XRP transaction networks. In this study, we provide a detailed analysis of the method of correlation tensor spectra for XRP transaction networks. We calculate and compare the distribution of the largest singular values of the correlation tensor using the random matrix theory with the largest singular values of the empirical correlation tensor. We investigate the correlation between the XRP price and the largest singular values for a period spanning two years. We also uncover the distinct dependence between XRP price and the singular values for bubble and non-",
    "link": "http://arxiv.org/abs/2309.05935",
    "context": "Title: Dynamic relationship between XRP price and correlation tensor spectra of the transaction network. (arXiv:2309.05935v1 [q-fin.ST])\nAbstract: The emergence of cryptoassets has sparked a paradigm shift in the world of finance and investment, ushering in a new era of digital assets with profound implications for the future of currency and asset management. A recent study showed that during the bubble period around the year, 2018, the price of cryptoasset, XRP has a strong anti correlation with the largest singular values of the correlation tensors obtained from the weekly XRP transaction networks. In this study, we provide a detailed analysis of the method of correlation tensor spectra for XRP transaction networks. We calculate and compare the distribution of the largest singular values of the correlation tensor using the random matrix theory with the largest singular values of the empirical correlation tensor. We investigate the correlation between the XRP price and the largest singular values for a period spanning two years. We also uncover the distinct dependence between XRP price and the singular values for bubble and non-",
    "path": "papers/23/09/2309.05935.json",
    "total_tokens": 891,
    "translated_title": "XRP价格与交易网络的相关张量谱之间的动态关系",
    "translated_abstract": "加密资产的出现引发了金融和投资领域的范式转变，开启了数字资产的新时代，对货币和资产管理的未来产生了深远影响。最近的一项研究表明，在2018年左右的泡沫期间，加密资产XRP的价格与从每周XRP交易网络中获取的相关张量的最大奇异值具有较强的反相关。在本研究中，我们对XRP交易网络的相关张量谱的方法进行了详细分析。我们利用随机矩阵理论计算并比较了相关张量的最大奇异值的分布与实证相关张量的最大奇异值。我们研究了涵盖两年的时期中XRP价格与最大奇异值之间的相关关系。我们还发现了XRP价格与奇异值在泡沫期和非泡沫期之间的明显依赖关系。",
    "tldr": "本研究通过分析XRP交易网络的相关张量谱，发现XRP价格与相关张量的最大奇异值之间存在显著的反相关关系，特别是在2018年的泡沫期间。这一发现对于加密资产的定价与预测具有重要意义。",
    "en_tdlr": "This study examines the correlation tensor spectra of XRP transaction networks and reveals a significant inverse correlation between XRP price and the largest singular values of the correlation tensor, especially during the bubble period in 2018. This finding is of great significance for the pricing and prediction of cryptoassets."
}