{
    "title": "Quantitative Analysis of Forecasting Models:In the Aspect of Online Political Bias. (arXiv:2309.05589v2 [cs.SI] UPDATED)",
    "abstract": "Understanding and mitigating political bias in online social media platforms are crucial tasks to combat misinformation and echo chamber effects. However, characterizing political bias temporally using computational methods presents challenges due to the high frequency of noise in social media datasets. While existing research has explored various approaches to political bias characterization, the ability to forecast political bias and anticipate how political conversations might evolve in the near future has not been extensively studied. In this paper, we propose a heuristic approach to classify social media posts into five distinct political leaning categories. Since there is a lack of prior work on forecasting political bias, we conduct an in-depth analysis of existing baseline models to identify which model best fits to forecast political leaning time series. Our approach involves utilizing existing time series forecasting models on two social media datasets with different politica",
    "link": "http://arxiv.org/abs/2309.05589",
    "context": "Title: Quantitative Analysis of Forecasting Models:In the Aspect of Online Political Bias. (arXiv:2309.05589v2 [cs.SI] UPDATED)\nAbstract: Understanding and mitigating political bias in online social media platforms are crucial tasks to combat misinformation and echo chamber effects. However, characterizing political bias temporally using computational methods presents challenges due to the high frequency of noise in social media datasets. While existing research has explored various approaches to political bias characterization, the ability to forecast political bias and anticipate how political conversations might evolve in the near future has not been extensively studied. In this paper, we propose a heuristic approach to classify social media posts into five distinct political leaning categories. Since there is a lack of prior work on forecasting political bias, we conduct an in-depth analysis of existing baseline models to identify which model best fits to forecast political leaning time series. Our approach involves utilizing existing time series forecasting models on two social media datasets with different politica",
    "path": "papers/23/09/2309.05589.json",
    "total_tokens": 869,
    "translated_title": "在在线政治偏见方面对预测模型进行定量分析",
    "translated_abstract": "理解和减少在线社交媒体平台中的政治偏见是对抗错误信息和回音室效应至关重要的任务。然而，使用计算方法对政治偏见进行时间化描述会面临社交媒体数据中噪声频繁的挑战。虽然现有研究已经探索了各种方法来描述政治偏见，但对于预测政治偏见和预测政治对话在不远的将来如何发展的能力还没有得到广泛研究。在本文中，我们提出了一种启发式方法将社交媒体帖子分类为五种不同的政治倾向类别。由于缺乏关于预测政治偏见的先前工作，我们对现有基准模型进行深入分析，以确定哪种模型最适合预测政治倾向时间序列。我们的方法是在两个具有不同政治观点的社交媒体数据集上利用现有的时间序列预测模型。",
    "tldr": "本文通过定量分析在线社交媒体上的政治偏见预测模型，提出了一种启发式方法来分类政治倾向，并进行了对现有基准模型的深入分析，以确定最适合预测政治倾向的模型。",
    "en_tdlr": "This paper presents a quantitative analysis of forecasting models for online political bias, proposes a heuristic approach to classify political leaning, and conducts an in-depth analysis of existing baseline models to identify the best model for political leaning prediction."
}