{
    "title": "Introspective Deep Metric Learning. (arXiv:2309.09982v1 [cs.CV])",
    "abstract": "This paper proposes an introspective deep metric learning (IDML) framework for uncertainty-aware comparisons of images. Conventional deep metric learning methods focus on learning a discriminative embedding to describe the semantic features of images, which ignore the existence of uncertainty in each image resulting from noise or semantic ambiguity. Training without awareness of these uncertainties causes the model to overfit the annotated labels during training and produce unsatisfactory judgments during inference. Motivated by this, we argue that a good similarity model should consider the semantic discrepancies with awareness of the uncertainty to better deal with ambiguous images for more robust training. To achieve this, we propose to represent an image using not only a semantic embedding but also an accompanying uncertainty embedding, which describes the semantic characteristics and ambiguity of an image, respectively. We further propose an introspective similarity metric to make",
    "link": "http://arxiv.org/abs/2309.09982",
    "context": "Title: Introspective Deep Metric Learning. (arXiv:2309.09982v1 [cs.CV])\nAbstract: This paper proposes an introspective deep metric learning (IDML) framework for uncertainty-aware comparisons of images. Conventional deep metric learning methods focus on learning a discriminative embedding to describe the semantic features of images, which ignore the existence of uncertainty in each image resulting from noise or semantic ambiguity. Training without awareness of these uncertainties causes the model to overfit the annotated labels during training and produce unsatisfactory judgments during inference. Motivated by this, we argue that a good similarity model should consider the semantic discrepancies with awareness of the uncertainty to better deal with ambiguous images for more robust training. To achieve this, we propose to represent an image using not only a semantic embedding but also an accompanying uncertainty embedding, which describes the semantic characteristics and ambiguity of an image, respectively. We further propose an introspective similarity metric to make",
    "path": "papers/23/09/2309.09982.json",
    "total_tokens": 874,
    "translated_title": "内省式深度度量学习",
    "translated_abstract": "本文提出了一种内省式深度度量学习 (IDML) 框架，用于对图像进行不确定性感知的比较。传统的深度度量学习方法着重于学习一个具有区分度的嵌入来描述图像的语义特征，忽略了由于噪声或语义模糊性而导致的每个图像的不确定性存在。在没有意识到这些不确定性的情况下进行训练会导致模型在训练期间过度拟合注释标签，并在推理期间产生不令人满意的判断。受此启发，我们认为一个好的相似度模型应考虑到不确定性的语义差异，以更好地处理模糊图像，从而实现更鲁棒的训练。为了实现这一点，我们提出了一种表示图像的方法，不仅使用语义嵌入，还使用伴随的不确定性嵌入，分别描述图像的语义特征和模糊性。我们进一步提出了一种内省式相似度度量方法，用于进行内省式比较，以更好地处理图像的不确定性。",
    "tldr": "本文提出了一种内省式深度度量学习 (IDML) 框架，通过考虑图像中的不确定性，以更好地处理模糊图像，实现更鲁棒的训练。"
}