{
    "title": "SLHCat: Mapping Wikipedia Categories and Lists to DBpedia by Leveraging Semantic, Lexical, and Hierarchical Features. (arXiv:2309.11791v1 [cs.DL])",
    "abstract": "Wikipedia articles are hierarchically organized through categories and lists, providing one of the most comprehensive and universal taxonomy, but its open creation is causing redundancies and inconsistencies. Assigning DBPedia classes to Wikipedia categories and lists can alleviate the problem, realizing a large knowledge graph which is essential for categorizing digital contents through entity linking and typing. However, the existing approach of CaLiGraph is producing incomplete and non-fine grained mappings. In this paper, we tackle the problem as ontology alignment, where structural information of knowledge graphs and lexical and semantic features of ontology class names are utilized to discover confident mappings, which are in turn utilized for finetuing pretrained language models in a distant supervision fashion. Our method SLHCat consists of two main parts: 1) Automatically generating training data by leveraging knowledge graph structure, semantic similarities, and named entity ",
    "link": "http://arxiv.org/abs/2309.11791",
    "context": "Title: SLHCat: Mapping Wikipedia Categories and Lists to DBpedia by Leveraging Semantic, Lexical, and Hierarchical Features. (arXiv:2309.11791v1 [cs.DL])\nAbstract: Wikipedia articles are hierarchically organized through categories and lists, providing one of the most comprehensive and universal taxonomy, but its open creation is causing redundancies and inconsistencies. Assigning DBPedia classes to Wikipedia categories and lists can alleviate the problem, realizing a large knowledge graph which is essential for categorizing digital contents through entity linking and typing. However, the existing approach of CaLiGraph is producing incomplete and non-fine grained mappings. In this paper, we tackle the problem as ontology alignment, where structural information of knowledge graphs and lexical and semantic features of ontology class names are utilized to discover confident mappings, which are in turn utilized for finetuing pretrained language models in a distant supervision fashion. Our method SLHCat consists of two main parts: 1) Automatically generating training data by leveraging knowledge graph structure, semantic similarities, and named entity ",
    "path": "papers/23/09/2309.11791.json",
    "total_tokens": 876,
    "translated_title": "SLHCat: 利用语义、词汇和层次特征将Wikipedia的分类和列表映射到DBpedia",
    "translated_abstract": "Wikipedia的文章通过分类和列表进行层次化组织，提供了其中一个最全面和普遍的分类系统，但其开放性导致了重复和不一致的问题。将DBpedia的类别分配给Wikipedia的分类和列表可以缓解这个问题，实现一个对实体链接和类型分类数字内容至关重要的大型知识图谱。然而，现有的CaLiGraph方法产生了不完整和非细粒度的映射。在本文中，我们将这个问题看作本体对齐，利用知识图谱的结构信息和本体类名的词汇和语义特征，发现自信映射，然后利用这些映射以远程监督方式对预训练的语言模型进行微调。我们的方法SLHCat包括两个主要部分：1）通过利用知识图谱的结构、语义相似性和命名实体自动生成训练数据",
    "tldr": "这项研究提出了一种方法，通过结合知识图谱的结构信息和本体类名的语义和词汇特征，将Wikipedia的分类和列表映射到DBpedia，以构建一个完善和细粒度的知识图谱。",
    "en_tdlr": "This study proposes a method to map Wikipedia categories and lists to DBpedia by leveraging the semantic and lexical features of ontology class names and the structural information of knowledge graphs, aiming to create a comprehensive and fine-grained knowledge graph."
}