{
    "title": "Gap and Overlap Detection in Automated Fiber Placement. (arXiv:2309.00206v1 [cs.CV])",
    "abstract": "The identification and correction of manufacturing defects, particularly gaps and overlaps, are crucial for ensuring high-quality composite parts produced through Automated Fiber Placement (AFP). These imperfections are the most commonly observed issues that can significantly impact the overall quality of the composite parts. Manual inspection is both time-consuming and labor-intensive, making it an inefficient approach. To overcome this challenge, the implementation of an automated defect detection system serves as the optimal solution. In this paper, we introduce a novel method that uses an Optical Coherence Tomography (OCT) sensor and computer vision techniques to detect and locate gaps and overlaps in composite parts. Our approach involves generating a depth map image of the composite surface that highlights the elevation of composite tapes (or tows) on the surface. By detecting the boundaries of each tow, our algorithm can compare consecutive tows and identify gaps or overlaps tha",
    "link": "http://arxiv.org/abs/2309.00206",
    "context": "Title: Gap and Overlap Detection in Automated Fiber Placement. (arXiv:2309.00206v1 [cs.CV])\nAbstract: The identification and correction of manufacturing defects, particularly gaps and overlaps, are crucial for ensuring high-quality composite parts produced through Automated Fiber Placement (AFP). These imperfections are the most commonly observed issues that can significantly impact the overall quality of the composite parts. Manual inspection is both time-consuming and labor-intensive, making it an inefficient approach. To overcome this challenge, the implementation of an automated defect detection system serves as the optimal solution. In this paper, we introduce a novel method that uses an Optical Coherence Tomography (OCT) sensor and computer vision techniques to detect and locate gaps and overlaps in composite parts. Our approach involves generating a depth map image of the composite surface that highlights the elevation of composite tapes (or tows) on the surface. By detecting the boundaries of each tow, our algorithm can compare consecutive tows and identify gaps or overlaps tha",
    "path": "papers/23/09/2309.00206.json",
    "total_tokens": 852,
    "translated_title": "自动化纤维放置中的间隙和重叠检测",
    "translated_abstract": "识别和修正制造缺陷，特别是间隙和重叠的问题，对确保通过自动化纤维放置（AFP）生产的高质量复合零件至关重要。这些缺陷是最常见的问题，可能会严重影响复合零件的整体质量。手动检查既耗时又劳动密集，效率低下。为了克服这一挑战，实施自动缺陷检测系统是最佳解决方案。在本文中，我们介绍了一种使用光学相干断层扫描（OCT）传感器和计算机视觉技术来检测和定位复合零件中间隙和重叠的新方法。我们的方法涉及生成复合表面的深度图像，突出显示表面上复合带（或线）的高度。通过检测每个线的边界，我们的算法可以比较相邻的线，并识别出间隙或重叠。",
    "tldr": "本文介绍了一种新方法，利用光学相干断层扫描（OCT）传感器和计算机视觉技术，在自动化纤维放置（AFP）中检测和定位复合零件中的间隙和重叠。"
}