{
    "title": "GPT as a Baseline for Recommendation Explanation Texts. (arXiv:2309.08817v1 [cs.AI])",
    "abstract": "In this work, we establish a baseline potential for how modern model-generated text explanations of movie recommendations may help users, and explore what different components of these text explanations that users like or dislike, especially in contrast to existing human movie reviews. We found that participants gave no significantly different rankings between movies, nor did they give significantly different individual quality scores to reviews of movies that they had never seen before. However, participants did mark reviews as significantly better when they were movies they had seen before. We also explore specific aspects of movie review texts that participants marked as important for each quality. Overall, we establish that modern LLMs are a promising source of recommendation explanations, and we intend on further exploring personalizable text explanations in the future.",
    "link": "http://arxiv.org/abs/2309.08817",
    "context": "Title: GPT as a Baseline for Recommendation Explanation Texts. (arXiv:2309.08817v1 [cs.AI])\nAbstract: In this work, we establish a baseline potential for how modern model-generated text explanations of movie recommendations may help users, and explore what different components of these text explanations that users like or dislike, especially in contrast to existing human movie reviews. We found that participants gave no significantly different rankings between movies, nor did they give significantly different individual quality scores to reviews of movies that they had never seen before. However, participants did mark reviews as significantly better when they were movies they had seen before. We also explore specific aspects of movie review texts that participants marked as important for each quality. Overall, we establish that modern LLMs are a promising source of recommendation explanations, and we intend on further exploring personalizable text explanations in the future.",
    "path": "papers/23/09/2309.08817.json",
    "total_tokens": 824,
    "translated_title": "GPT作为推荐解释文本的基准",
    "translated_abstract": "本研究通过建立一个基准，探索了现代模型生成的电影推荐解释文本对用户的帮助，以及用户对这些文本解释的不同组成部分的喜好和不喜好，特别是与现有的人工电影评论的对比。研究发现，参与者对电影之间的排名没有明显差异，也没有对他们之前从未见过的电影评论的个体质量打出明显不同的评分。然而，当评论是他们之前看过的电影时，参与者确实标记评论为显著更好。此外，我们还探讨了参与者认为对每个质量重要的影评文本的具体方面。总体而言，我们确定现代语言模型是一个有希望的推荐解释来源，并计划在将来进一步探索个性化的文本解释。",
    "tldr": "本研究建立了以GPT为基准，探索了现代模型生成的电影推荐解释对用户的帮助。研究发现，参与者认为之前看过的电影的评论更好。总体而言，现代语言模型是一个有希望的推荐解释来源。",
    "en_tdlr": "This study establishes GPT as a baseline and explores how modern model-generated movie recommendation explanations can help users. Participants found reviews of movies they had seen before to be significantly better. Overall, modern language models are a promising source of recommendation explanations."
}