{
    "title": "FDLS: A Deep Learning Approach to Production Quality, Controllable, and Retargetable Facial Performances. (arXiv:2309.14897v1 [cs.CV])",
    "abstract": "Visual effects commonly requires both the creation of realistic synthetic humans as well as retargeting actors' performances to humanoid characters such as aliens and monsters. Achieving the expressive performances demanded in entertainment requires manipulating complex models with hundreds of parameters. Full creative control requires the freedom to make edits at any stage of the production, which prohibits the use of a fully automatic ``black box'' solution with uninterpretable parameters. On the other hand, producing realistic animation with these sophisticated models is difficult and laborious. This paper describes FDLS (Facial Deep Learning Solver), which is Weta Digital's solution to these challenges. FDLS adopts a coarse-to-fine and human-in-the-loop strategy, allowing a solved performance to be verified and edited at several stages in the solving process. To train FDLS, we first transform the raw motion-captured data into robust graph features. Secondly, based on the observatio",
    "link": "http://arxiv.org/abs/2309.14897",
    "context": "Title: FDLS: A Deep Learning Approach to Production Quality, Controllable, and Retargetable Facial Performances. (arXiv:2309.14897v1 [cs.CV])\nAbstract: Visual effects commonly requires both the creation of realistic synthetic humans as well as retargeting actors' performances to humanoid characters such as aliens and monsters. Achieving the expressive performances demanded in entertainment requires manipulating complex models with hundreds of parameters. Full creative control requires the freedom to make edits at any stage of the production, which prohibits the use of a fully automatic ``black box'' solution with uninterpretable parameters. On the other hand, producing realistic animation with these sophisticated models is difficult and laborious. This paper describes FDLS (Facial Deep Learning Solver), which is Weta Digital's solution to these challenges. FDLS adopts a coarse-to-fine and human-in-the-loop strategy, allowing a solved performance to be verified and edited at several stages in the solving process. To train FDLS, we first transform the raw motion-captured data into robust graph features. Secondly, based on the observatio",
    "path": "papers/23/09/2309.14897.json",
    "total_tokens": 937,
    "translated_title": "FDLS：一种用于制作品质、可控和可重定向的面部表演的深度学习方法。",
    "translated_abstract": "视觉效果通常需要创建逼真的合成人物，并将演员的表演重新定向到类似外星人和怪物的人形角色。实现娱乐业所需的富有表现力的表演需要操作具有数百个参数的复杂模型。完全创作控制需要在制作的任何阶段对其进行编辑，这禁止了使用完全自动且带有不可解释参数的“黑箱”解决方案。另一方面，用这些复杂模型制作逼真的动画是困难和费时的。本文介绍了FDLS（Facial Deep Learning Solver），这是Weta Digital对这些挑战的解决方案。FDLS采用从粗到细的策略，并结合人工参与，允许在求解过程的多个阶段验证和编辑求解后的表演。为了训练FDLS，我们首先将原始的动作捕捉数据转换为稳健的图形特征，然后根据观察结果进行模型训练。",
    "tldr": "这个论文介绍了FDLS，一种用于制作品质、可控和可重定向的面部表演的深度学习方法。FDLS采用从粗到细的策略，并结合人工参与，允许在求解过程中验证和编辑求解后的表演。",
    "en_tdlr": "This paper describes FDLS, a deep learning approach to production quality, controllable, and retargetable facial performances. FDLS adopts a coarse-to-fine and human-in-the-loop strategy, allowing the verified and edited performances at different stages of the solving process."
}