{
    "title": "GCL: Gradient-Guided Contrastive Learning for Medical Image Segmentation with Multi-Perspective Meta Labels. (arXiv:2309.08888v1 [cs.CV])",
    "abstract": "Since annotating medical images for segmentation tasks commonly incurs expensive costs, it is highly desirable to design an annotation-efficient method to alleviate the annotation burden. Recently, contrastive learning has exhibited a great potential in learning robust representations to boost downstream tasks with limited labels. In medical imaging scenarios, ready-made meta labels (i.e., specific attribute information of medical images) inherently reveal semantic relationships among images, which have been used to define positive pairs in previous work. However, the multi-perspective semantics revealed by various meta labels are usually incompatible and can incur intractable \"semantic contradiction\" when combining different meta labels. In this paper, we tackle the issue of \"semantic contradiction\" in a gradient-guided manner using our proposed Gradient Mitigator method, which systematically unifies multi-perspective meta labels to enable a pre-trained model to attain a better high-l",
    "link": "http://arxiv.org/abs/2309.08888",
    "context": "Title: GCL: Gradient-Guided Contrastive Learning for Medical Image Segmentation with Multi-Perspective Meta Labels. (arXiv:2309.08888v1 [cs.CV])\nAbstract: Since annotating medical images for segmentation tasks commonly incurs expensive costs, it is highly desirable to design an annotation-efficient method to alleviate the annotation burden. Recently, contrastive learning has exhibited a great potential in learning robust representations to boost downstream tasks with limited labels. In medical imaging scenarios, ready-made meta labels (i.e., specific attribute information of medical images) inherently reveal semantic relationships among images, which have been used to define positive pairs in previous work. However, the multi-perspective semantics revealed by various meta labels are usually incompatible and can incur intractable \"semantic contradiction\" when combining different meta labels. In this paper, we tackle the issue of \"semantic contradiction\" in a gradient-guided manner using our proposed Gradient Mitigator method, which systematically unifies multi-perspective meta labels to enable a pre-trained model to attain a better high-l",
    "path": "papers/23/09/2309.08888.json",
    "total_tokens": 844,
    "translated_title": "GCL: 基于梯度引导的对比学习用于医学图像分割与多视角元标签",
    "translated_abstract": "鉴于医学图像分割的标注成本普遍昂贵，设计一种节省标注负担的标注效率方法非常重要。最近，对比学习已经展示出在使用有限标签来增强下游任务的学习稳健表示方面具有巨大潜力。在医学图像场景下，预先准备好的元标签（即医学图像的特定属性信息）本质上揭示了图像之间的语义关系，这些标签已被用来定义正向对。然而，不同元标签所揭示的多视角语义通常不兼容，组合不同的元标签可能会导致“语义矛盾”的问题。为了解决这个问题，我们提出了梯度引导方法来处理“语义矛盾”，通过系统性地统一多视角的元标签，使预训练模型能够获得更好的高水平性能。",
    "tldr": "这项研究提出了一种基于梯度引导的对比学习方法，在医学图像分割中利用多视角元标签解决了\"语义矛盾\"的问题。"
}