{
    "title": "EpiDeNet: An Energy-Efficient Approach to Seizure Detection for Embedded Systems. (arXiv:2309.07135v1 [eess.SP])",
    "abstract": "Epilepsy is a prevalent neurological disorder that affects millions of individuals globally, and continuous monitoring coupled with automated seizure detection appears as a necessity for effective patient treatment. To enable long-term care in daily-life conditions, comfortable and smart wearable devices with long battery life are required, which in turn set the demand for resource-constrained and energy-efficient computing solutions. In this context, the development of machine learning algorithms for seizure detection faces the challenge of heavily imbalanced datasets. This paper introduces EpiDeNet, a new lightweight seizure detection network, and Sensitivity-Specificity Weighted Cross-Entropy (SSWCE), a new loss function that incorporates sensitivity and specificity, to address the challenge of heavily unbalanced datasets. The proposed EpiDeNet-SSWCE approach demonstrates the successful detection of 91.16% and 92.00% seizure events on two different datasets (CHB-MIT and PEDESITE, re",
    "link": "http://arxiv.org/abs/2309.07135",
    "context": "Title: EpiDeNet: An Energy-Efficient Approach to Seizure Detection for Embedded Systems. (arXiv:2309.07135v1 [eess.SP])\nAbstract: Epilepsy is a prevalent neurological disorder that affects millions of individuals globally, and continuous monitoring coupled with automated seizure detection appears as a necessity for effective patient treatment. To enable long-term care in daily-life conditions, comfortable and smart wearable devices with long battery life are required, which in turn set the demand for resource-constrained and energy-efficient computing solutions. In this context, the development of machine learning algorithms for seizure detection faces the challenge of heavily imbalanced datasets. This paper introduces EpiDeNet, a new lightweight seizure detection network, and Sensitivity-Specificity Weighted Cross-Entropy (SSWCE), a new loss function that incorporates sensitivity and specificity, to address the challenge of heavily unbalanced datasets. The proposed EpiDeNet-SSWCE approach demonstrates the successful detection of 91.16% and 92.00% seizure events on two different datasets (CHB-MIT and PEDESITE, re",
    "path": "papers/23/09/2309.07135.json",
    "total_tokens": 1009,
    "translated_title": "EpiDeNet：用于嵌入式系统的节能性癫痫检测方法",
    "translated_abstract": "癫痫是一种广泛存在的神经系统疾病，影响着数百万患者的生活，连续监测与自动化癫痫检测成为有效治疗的必要条件。为了在日常生活条件下实现长期护理，需要舒适和智能的可穿戴设备，并且要具备长电池寿命，这反过来对资源受限和节能计算解决方案提出了要求。在这种情况下，癫痫检测的机器学习算法的发展面临着严重不平衡的数据集挑战。本文介绍了一种新的轻量级癫痫检测网络EpiDeNet和一种新的损失函数Sensitivity-Specificity Weighted Cross-Entropy (SSWCE)，它结合了灵敏度和特异度，以应对严重不平衡的数据集挑战。提出的EpiDeNet-SSWCE方法在两个不同的数据集（CHB-MIT和PEDESITE）上成功检测到了91.16％和92.00％的癫痫事件。",
    "tldr": "EpiDeNet是一种节能性癫痫检测方法，通过引入新的轻量级癫痫检测网络和结合灵敏度和特异度的损失函数(SSWCE)，成功应对了严重不平衡的数据集挑战，并在两个不同的数据集上实现了高达91.16％和92.00％的癫痫事件检测准确率。",
    "en_tdlr": "EpiDeNet is an energy-efficient approach for seizure detection, which addresses the challenge of heavily imbalanced datasets by introducing a new lightweight seizure detection network and a loss function (SSWCE) that incorporates sensitivity and specificity. It achieved a seizure event detection accuracy of 91.16% and 92.00% on two different datasets (CHB-MIT and PEDESITE)."
}