{
    "title": "Insights from an OTTR-centric Ontology Engineering Methodology. (arXiv:2309.13130v1 [cs.DB])",
    "abstract": "OTTR is a language for representing ontology modeling patterns, which enables to build ontologies or knowledge bases by instantiating templates. Thereby, particularities of the ontological representation language are hidden from the domain experts, and it enables ontology engineers to, to some extent, separate the processes of deciding about what information to model from deciding about how to model the information, e.g., which design patterns to use. Certain decisions can thus be postponed for the benefit of focusing on one of these processes. To date, only few works on ontology engineering where ontology templates are applied are described in the literature.  In this paper, we outline our methodology and report findings from our ontology engineering activities in the domain of Material Science. In these activities, OTTR templates play a key role. Our ontology engineering process is bottom-up, as we begin modeling activities from existing data that is then, via templates, fed into a k",
    "link": "http://arxiv.org/abs/2309.13130",
    "context": "Title: Insights from an OTTR-centric Ontology Engineering Methodology. (arXiv:2309.13130v1 [cs.DB])\nAbstract: OTTR is a language for representing ontology modeling patterns, which enables to build ontologies or knowledge bases by instantiating templates. Thereby, particularities of the ontological representation language are hidden from the domain experts, and it enables ontology engineers to, to some extent, separate the processes of deciding about what information to model from deciding about how to model the information, e.g., which design patterns to use. Certain decisions can thus be postponed for the benefit of focusing on one of these processes. To date, only few works on ontology engineering where ontology templates are applied are described in the literature.  In this paper, we outline our methodology and report findings from our ontology engineering activities in the domain of Material Science. In these activities, OTTR templates play a key role. Our ontology engineering process is bottom-up, as we begin modeling activities from existing data that is then, via templates, fed into a k",
    "path": "papers/23/09/2309.13130.json",
    "total_tokens": 929,
    "translated_title": "从一个以OTTR为核心的本体工程方法中获得的见解",
    "translated_abstract": "OTTR是一种用于表示本体建模模式的语言，它通过实例化模板来构建本体或知识库。通过这种方式，本体表示语言的特定性被隐藏在领域专家之外，使得本体工程师在决定建模信息以及如何建模信息（例如使用哪些设计模式）时能够在一定程度上分离这两个过程。因此，某些决策可以推迟，以便更加专注于其中一个过程。到目前为止，在应用本体模板的本体工程方面的文献中只有少数几篇作品被描述。在本文中，我们概述了我们的方法论，并报告了我们在材料科学领域的本体工程活动中的发现。在这些活动中，OTTR模板起着关键作用。我们的本体工程过程是自下而上的，我们从现有数据开始建模活动，然后通过模板将数据输入到一个k",
    "tldr": "本论文介绍了一种以OTTR为核心的本体工程方法，在材料科学领域的实践中取得了重要发现。OTTR语言通过实例化模板来构建本体或知识库，通过隐藏本体表示语言的特定性，使领域专家能够分离决定建模信息和如何建模信息的过程，从而提高了工作效率。",
    "en_tdlr": "This paper presents an ontology engineering methodology centered around OTTR, which has achieved significant findings in the field of Material Science. The use of OTTR language allows for the instantiation of templates to build ontologies or knowledge bases, enabling domain experts to separate the decision-making process of what information to model from how to model it, thereby improving efficiency."
}