{
    "title": "LMBiS-Net: A Lightweight Multipath Bidirectional Skip Connection based CNN for Retinal Blood Vessel Segmentation. (arXiv:2309.04968v1 [eess.IV])",
    "abstract": "Blinding eye diseases are often correlated with altered retinal morphology, which can be clinically identified by segmenting retinal structures in fundus images. However, current methodologies often fall short in accurately segmenting delicate vessels. Although deep learning has shown promise in medical image segmentation, its reliance on repeated convolution and pooling operations can hinder the representation of edge information, ultimately limiting overall segmentation accuracy. In this paper, we propose a lightweight pixel-level CNN named LMBiS-Net for the segmentation of retinal vessels with an exceptionally low number of learnable parameters \\textbf{(only 0.172 M)}. The network used multipath feature extraction blocks and incorporates bidirectional skip connections for the information flow between the encoder and decoder. Additionally, we have optimized the efficiency of the model by carefully selecting the number of filters to avoid filter overlap. This optimization significantl",
    "link": "http://arxiv.org/abs/2309.04968",
    "context": "Title: LMBiS-Net: A Lightweight Multipath Bidirectional Skip Connection based CNN for Retinal Blood Vessel Segmentation. (arXiv:2309.04968v1 [eess.IV])\nAbstract: Blinding eye diseases are often correlated with altered retinal morphology, which can be clinically identified by segmenting retinal structures in fundus images. However, current methodologies often fall short in accurately segmenting delicate vessels. Although deep learning has shown promise in medical image segmentation, its reliance on repeated convolution and pooling operations can hinder the representation of edge information, ultimately limiting overall segmentation accuracy. In this paper, we propose a lightweight pixel-level CNN named LMBiS-Net for the segmentation of retinal vessels with an exceptionally low number of learnable parameters \\textbf{(only 0.172 M)}. The network used multipath feature extraction blocks and incorporates bidirectional skip connections for the information flow between the encoder and decoder. Additionally, we have optimized the efficiency of the model by carefully selecting the number of filters to avoid filter overlap. This optimization significantl",
    "path": "papers/23/09/2309.04968.json",
    "total_tokens": 965,
    "translated_title": "LMBiS-Net：基于轻量级多路径双向跳跃连接的视网膜血管分割的卷积神经网络",
    "translated_abstract": "失明眼疾通常与改变的视网膜形态相关，可以通过分割眼底图像中的视网膜结构在临床上进行识别。然而，当前的方法在准确分割精细血管方面常常存在不足。虽然深度学习已经在医学图像分割中显示出了潜力，但是它对重复的卷积和池化操作的依赖可能会阻碍边缘信息的表示，从而限制了整体分割的准确性。本文提出了一种名为LMBiS-Net的轻量级像素级卷积神经网络，用于以极低数量的可学习参数（仅0.172M）进行视网膜血管的分割。该网络采用了多路径特征提取块，并将双向跳跃连接用于编码器和解码器之间的信息流。此外，我们通过精心选择滤波器的数量来优化模型的效率，避免了滤波器重叠。这种优化显著改善了模型的性能。",
    "tldr": "本文提出了一种名为LMBiS-Net的轻量级卷积神经网络用于视网膜血管分割，具有极低的可学习参数数量和优化的模型效率，通过多路径特征提取和双向跳跃连接实现了较好的分割性能。",
    "en_tdlr": "This paper proposes a lightweight CNN called LMBiS-Net for retinal blood vessel segmentation, with a low number of learnable parameters and optimized model efficiency. It achieves good segmentation performance through multipath feature extraction and bidirectional skip connections."
}