{
    "title": "A framework for paired-sample hypothesis testing for high-dimensional data. (arXiv:2309.16274v1 [stat.ML])",
    "abstract": "The standard paired-sample testing approach in the multidimensional setting applies multiple univariate tests on the individual features, followed by p-value adjustments. Such an approach suffers when the data carry numerous features. A number of studies have shown that classification accuracy can be seen as a proxy for two-sample testing. However, neither theoretical foundations nor practical recipes have been proposed so far on how this strategy could be extended to multidimensional paired-sample testing. In this work, we put forward the idea that scoring functions can be produced by the decision rules defined by the perpendicular bisecting hyperplanes of the line segments connecting each pair of instances. Then, the optimal scoring function can be obtained by the pseudomedian of those rules, which we estimate by extending naturally the Hodges-Lehmann estimator. We accordingly propose a framework of a two-step testing procedure. First, we estimate the bisecting hyperplanes for each p",
    "link": "http://arxiv.org/abs/2309.16274",
    "context": "Title: A framework for paired-sample hypothesis testing for high-dimensional data. (arXiv:2309.16274v1 [stat.ML])\nAbstract: The standard paired-sample testing approach in the multidimensional setting applies multiple univariate tests on the individual features, followed by p-value adjustments. Such an approach suffers when the data carry numerous features. A number of studies have shown that classification accuracy can be seen as a proxy for two-sample testing. However, neither theoretical foundations nor practical recipes have been proposed so far on how this strategy could be extended to multidimensional paired-sample testing. In this work, we put forward the idea that scoring functions can be produced by the decision rules defined by the perpendicular bisecting hyperplanes of the line segments connecting each pair of instances. Then, the optimal scoring function can be obtained by the pseudomedian of those rules, which we estimate by extending naturally the Hodges-Lehmann estimator. We accordingly propose a framework of a two-step testing procedure. First, we estimate the bisecting hyperplanes for each p",
    "path": "papers/23/09/2309.16274.json",
    "total_tokens": 870,
    "translated_title": "高维数据配对样本假设检验的框架",
    "translated_abstract": "在多维数据的配对样本检验中，标准的方法是对每个特征应用多个单变量检验，然后进行p值调整。然而，当数据含有大量特征时，这种方法存在问题。已有一些研究表明，分类准确率可以作为双样本检验的代理。然而，迄今为止尚未提出理论基础或实际方法来将这种策略扩展到多维配对样本检验。在本研究中，我们提出了一种想法，即通过每对实例连接线段的垂直平分线定义的决策规则来生成评分函数。然后，通过这些规则的伪中位数来估计最优评分函数，我们通过自然地扩展Hodges-Lehmann估计量来进行估计。因此，我们提出了一个两步检验过程的框架。首先，我们估计每个特征的平分线。接下来，我们根据这些平分线定义评分函数，并通过伪中位数求得最优评分函数。",
    "tldr": "本文提出了一个针对高维数据配对样本的假设检验框架，通过垂直平分线生成评分函数，并利用伪中位数求得最优评分函数。"
}