{
    "title": "Segmentation-Free Streaming Machine Translation. (arXiv:2309.14823v1 [cs.CL])",
    "abstract": "Streaming Machine Translation (MT) is the task of translating an unbounded input text stream in real-time. The traditional cascade approach, which combines an Automatic Speech Recognition (ASR) and an MT system, relies on an intermediate segmentation step which splits the transcription stream into sentence-like units. However, the incorporation of a hard segmentation constrains the MT system and is a source of errors. This paper proposes a Segmentation-Free framework that enables the model to translate an unsegmented source stream by delaying the segmentation decision until the translation has been generated. Extensive experiments show how the proposed Segmentation-Free framework has better quality-latency trade-off than competing approaches that use an independent segmentation model. Software, data and models will be released upon paper acceptance.",
    "link": "http://arxiv.org/abs/2309.14823",
    "context": "Title: Segmentation-Free Streaming Machine Translation. (arXiv:2309.14823v1 [cs.CL])\nAbstract: Streaming Machine Translation (MT) is the task of translating an unbounded input text stream in real-time. The traditional cascade approach, which combines an Automatic Speech Recognition (ASR) and an MT system, relies on an intermediate segmentation step which splits the transcription stream into sentence-like units. However, the incorporation of a hard segmentation constrains the MT system and is a source of errors. This paper proposes a Segmentation-Free framework that enables the model to translate an unsegmented source stream by delaying the segmentation decision until the translation has been generated. Extensive experiments show how the proposed Segmentation-Free framework has better quality-latency trade-off than competing approaches that use an independent segmentation model. Software, data and models will be released upon paper acceptance.",
    "path": "papers/23/09/2309.14823.json",
    "total_tokens": 778,
    "translated_title": "无需分割的流式机器翻译",
    "translated_abstract": "流式机器翻译是实时将未限定输入文本流进行翻译的任务。传统级联方法将自动语音识别（ASR）和机器翻译系统结合，依赖于中间的分割步骤，将转录流分割成句子样式的单位。然而，硬分割的引入限制了机器翻译系统，并且是错误的来源。本文提出了一种无需分割的框架，使模型能够在生成翻译之前延迟分割决策，翻译未分割的源流。广泛的实验证明，所提出的无需分割的框架在质量延迟平衡方面优于使用独立分割模型的竞争方法。论文通过后将公开发布软件、数据和模型。",
    "tldr": "本研究提出了一种无需分割的流式机器翻译框架，通过延迟分割决策来提高翻译质量和延迟平衡，相比其他方法具有更好的效果。",
    "en_tdlr": "This study proposes a segmentation-free streaming machine translation framework, which improves translation quality and latency balance by delaying the segmentation decision, and has better performance compared to other approaches."
}