{
    "title": "Combining deep learning and street view imagery to map smallholder crop types. (arXiv:2309.05930v1 [cs.CV])",
    "abstract": "Accurate crop type maps are an essential source of information for monitoring yield progress at scale, projecting global crop production, and planning effective policies. To date, however, crop type maps remain challenging to create in low and middle-income countries due to a lack of ground truth labels for training machine learning models. Field surveys are the gold standard in terms of accuracy but require an often-prohibitively large amount of time, money, and statistical capacity. In recent years, street-level imagery, such as Google Street View, KartaView, and Mapillary, has become available around the world. Such imagery contains rich information about crop types grown at particular locations and times. In this work, we develop an automated system to generate crop type ground references using deep learning and Google Street View imagery. The method efficiently curates a set of street view images containing crop fields, trains a model to predict crop type by utilizing weakly-label",
    "link": "http://arxiv.org/abs/2309.05930",
    "context": "Title: Combining deep learning and street view imagery to map smallholder crop types. (arXiv:2309.05930v1 [cs.CV])\nAbstract: Accurate crop type maps are an essential source of information for monitoring yield progress at scale, projecting global crop production, and planning effective policies. To date, however, crop type maps remain challenging to create in low and middle-income countries due to a lack of ground truth labels for training machine learning models. Field surveys are the gold standard in terms of accuracy but require an often-prohibitively large amount of time, money, and statistical capacity. In recent years, street-level imagery, such as Google Street View, KartaView, and Mapillary, has become available around the world. Such imagery contains rich information about crop types grown at particular locations and times. In this work, we develop an automated system to generate crop type ground references using deep learning and Google Street View imagery. The method efficiently curates a set of street view images containing crop fields, trains a model to predict crop type by utilizing weakly-label",
    "path": "papers/23/09/2309.05930.json",
    "total_tokens": 882,
    "translated_title": "结合深度学习和街景图像来绘制小农户农作物类型的地图",
    "translated_abstract": "准确的农作物类型地图对于监测规模的产量进展、预测全球农作物生产和制定有效政策是一种必要的信息来源。然而，由于在训练机器学习模型时缺乏地面真实标签，迄今为止，低收入和中等收入国家的农作物类型地图制作仍具有挑战性。田间调查在准确性方面是黄金标准，但需要大量的时间、金钱和统计能力。近年来，全球范围内提供了街景图像（如Google Street View，KartaView和Mapillary）。这些图像包含了特定位置和时间的农作物种类的丰富信息。在这项工作中，我们开发了一个使用深度学习和Google Street View图像生成农作物类型地面参考的自动化系统。该方法有效地筛选了一组包含农田的街景图像，通过利用弱标签训练模型来预测农作物类型。",
    "tldr": "本研究利用深度学习和街景图像开发了一个自动化系统，可以生成农作物类型地面参考，解决了在低收入和中等收入国家创建农作物类型地图时的挑战。",
    "en_tdlr": "This study develops an automated system utilizing deep learning and street view imagery to generate crop type ground references, addressing the challenge of creating crop type maps in low and middle-income countries."
}