{
    "title": "Antagonising explanation and revealing bias directly through sequencing and multimodal inference. (arXiv:2309.12345v1 [cs.HC])",
    "abstract": "Deep generative models produce data according to a learned representation, e.g. diffusion models, through a process of approximation computing possible samples. Approximation can be understood as reconstruction and the large datasets used to train models as sets of records in which we represent the physical world with some data structure (photographs, audio recordings, manuscripts). During the process of reconstruction, e.g., image frames develop each timestep towards a textual input description. While moving forward in time, frame sets are shaped according to learned bias and their production, we argue here, can be considered as going back in time; not by inspiration on the backward diffusion process but acknowledging culture is specifically marked in the records. Futures of generative modelling, namely in film and audiovisual arts, can benefit by dealing with diffusion systems as a process to compute the future by inevitably being tied to the past, if acknowledging the records as to ",
    "link": "http://arxiv.org/abs/2309.12345",
    "context": "Title: Antagonising explanation and revealing bias directly through sequencing and multimodal inference. (arXiv:2309.12345v1 [cs.HC])\nAbstract: Deep generative models produce data according to a learned representation, e.g. diffusion models, through a process of approximation computing possible samples. Approximation can be understood as reconstruction and the large datasets used to train models as sets of records in which we represent the physical world with some data structure (photographs, audio recordings, manuscripts). During the process of reconstruction, e.g., image frames develop each timestep towards a textual input description. While moving forward in time, frame sets are shaped according to learned bias and their production, we argue here, can be considered as going back in time; not by inspiration on the backward diffusion process but acknowledging culture is specifically marked in the records. Futures of generative modelling, namely in film and audiovisual arts, can benefit by dealing with diffusion systems as a process to compute the future by inevitably being tied to the past, if acknowledging the records as to ",
    "path": "papers/23/09/2309.12345.json",
    "total_tokens": 908,
    "translated_title": "通过测序和多模态推理对抗解释并直接揭示偏见",
    "translated_abstract": "深度生成模型通过学习表示来生成数据，例如扩散模型，通过近似计算可能的样本。近似可以被理解为重建，用于训练模型的大型数据集可以看作是用某种数据结构（照片、音频记录、手稿）来表示物理世界的记录集。在重建过程中，例如，图像帧会根据学习的偏见逐步发展成为文本输入描述。我们在这里提出，生成过程是可以被认为是倒退的时间；不是通过对倒退扩散过程的灵感，而是承认文化在记录中特有的标记。生成模型在未来，特别是在电影和视听艺术领域，可以通过将扩散系统视为一种将未来计算与过去紧密联系的过程来获益，只要承认记录的存在。",
    "tldr": "本研究通过测序和多模态推理，对抗解释并直接揭示偏见，探讨了利用生成模型进行未来计算的潜力和应用，特别是在电影和视听艺术领域。研究发现，通过承认记录的存在，将过去与未来紧密联系起来，可以更好地实现生成模型的效果。",
    "en_tdlr": "This paper explores the potential and applications of using generative models for future computing, particularly in the fields of film and audiovisual arts, by antagonizing explanation and revealing bias directly through sequencing and multimodal inference. The study finds that by acknowledging the presence of records and connecting the past and future closely, better performance can be achieved in generative models."
}