{
    "title": "Boosting Unsupervised Contrastive Learning Using Diffusion-Based Data Augmentation From Scratch. (arXiv:2309.07909v1 [cs.LG])",
    "abstract": "Unsupervised contrastive learning methods have recently seen significant improvements, particularly through data augmentation strategies that aim to produce robust and generalizable representations. However, prevailing data augmentation methods, whether hand designed or based on foundation models, tend to rely heavily on prior knowledge or external data. This dependence often compromises their effectiveness and efficiency. Furthermore, the applicability of most existing data augmentation strategies is limited when transitioning to other research domains, especially science-related data. This limitation stems from the paucity of prior knowledge and labeled data available in these domains. To address these challenges, we introduce DiffAug-a novel and efficient Diffusion-based data Augmentation technique. DiffAug aims to ensure that the augmented and original data share a smoothed latent space, which is achieved through diffusion steps. Uniquely, unlike traditional methods, DiffAug first ",
    "link": "http://arxiv.org/abs/2309.07909",
    "context": "Title: Boosting Unsupervised Contrastive Learning Using Diffusion-Based Data Augmentation From Scratch. (arXiv:2309.07909v1 [cs.LG])\nAbstract: Unsupervised contrastive learning methods have recently seen significant improvements, particularly through data augmentation strategies that aim to produce robust and generalizable representations. However, prevailing data augmentation methods, whether hand designed or based on foundation models, tend to rely heavily on prior knowledge or external data. This dependence often compromises their effectiveness and efficiency. Furthermore, the applicability of most existing data augmentation strategies is limited when transitioning to other research domains, especially science-related data. This limitation stems from the paucity of prior knowledge and labeled data available in these domains. To address these challenges, we introduce DiffAug-a novel and efficient Diffusion-based data Augmentation technique. DiffAug aims to ensure that the augmented and original data share a smoothed latent space, which is achieved through diffusion steps. Uniquely, unlike traditional methods, DiffAug first ",
    "path": "papers/23/09/2309.07909.json",
    "total_tokens": 889,
    "translated_title": "从头开始利用基于扩散的数据增强方法来提升无监督对比学习",
    "translated_abstract": "无监督对比学习方法近年来取得了显著的改进，尤其是通过数据增强策略产生稳健且具有泛化能力的表示。然而，现有的数据增强方法往往过于依赖先验知识或外部数据，限制了它们的有效性和效率。此外，大多数现有的数据增强策略在转换到其他研究领域时应用受限，特别是在科学相关数据的情况下。这种限制来源于这些领域中先验知识和标记数据的匮乏。为了解决这些问题，我们引入了一种新颖而高效的基于扩散的数据增强技术——DiffAug。DiffAug通过扩散步骤确保增强数据和原始数据共享一个平滑的潜空间。与传统方法不同，DiffAug首先对数据进行增强，使增强数据和原始数据在潜空间上平滑。",
    "tldr": "本文介绍了一种新颖且高效的基于扩散的数据增强技术DiffAug，通过扩散步骤实现增强数据和原始数据共享平滑的潜空间，旨在提高无监督对比学习的效果和效率。",
    "en_tdlr": "This paper introduces a novel and efficient diffusion-based data augmentation technique called DiffAug, which ensures that augmented and original data share a smoothed latent space through diffusion steps, aiming to improve the effectiveness and efficiency of unsupervised contrastive learning."
}