{
    "title": "Matcha-TTS: A fast TTS architecture with conditional flow matching. (arXiv:2309.03199v1 [eess.AS])",
    "abstract": "We introduce Matcha-TTS, a new encoder-decoder architecture for speedy TTS acoustic modelling, trained using optimal-transport conditional flow matching (OT-CFM). This yields an ODE-based decoder capable of high output quality in fewer synthesis steps than models trained using score matching. Careful design choices additionally ensure each synthesis step is fast to run. The method is probabilistic, non-autoregressive, and learns to speak from scratch without external alignments. Compared to strong pre-trained baseline models, the Matcha-TTS system has the smallest memory footprint, rivals the speed of the fastest models on long utterances, and attains the highest mean opinion score in a listening test. Please see https://shivammehta25.github.io/Matcha-TTS/ for audio examples, code, and pre-trained models.",
    "link": "http://arxiv.org/abs/2309.03199",
    "context": "Title: Matcha-TTS: A fast TTS architecture with conditional flow matching. (arXiv:2309.03199v1 [eess.AS])\nAbstract: We introduce Matcha-TTS, a new encoder-decoder architecture for speedy TTS acoustic modelling, trained using optimal-transport conditional flow matching (OT-CFM). This yields an ODE-based decoder capable of high output quality in fewer synthesis steps than models trained using score matching. Careful design choices additionally ensure each synthesis step is fast to run. The method is probabilistic, non-autoregressive, and learns to speak from scratch without external alignments. Compared to strong pre-trained baseline models, the Matcha-TTS system has the smallest memory footprint, rivals the speed of the fastest models on long utterances, and attains the highest mean opinion score in a listening test. Please see https://shivammehta25.github.io/Matcha-TTS/ for audio examples, code, and pre-trained models.",
    "path": "papers/23/09/2309.03199.json",
    "total_tokens": 887,
    "translated_title": "Matcha-TTS: 一种具有条件流匹配的快速TTS架构",
    "translated_abstract": "我们介绍了Matcha-TTS，一种新的编码器-解码器架构，用于高速TTS声学建模，该模型使用最优传输条件流匹配（OT-CFM）进行训练。这使得基于ODE的解码器能够在比使用得分匹配进行训练的模型更少的合成步骤中产生高质量的输出。精心设计的选择确保每个合成步骤的运行速度快。该方法是概率的、非自回归的，并且可以自主学习说话，无需外部对齐。与强大的预训练基线模型相比，Matcha-TTS系统具有最小的内存占用，与最快模型在长语音片段上的速度相当，并在一项听觉测试中获得了最高的评分。请访问https://shivammehta25.github.io/Matcha-TTS/ 查看音频示例、代码和预训练模型。",
    "tldr": "Matcha-TTS是一种快速TTS架构，使用最优传输条件流匹配训练，具有高质量输出和快速合成步骤。它不需要外部对齐，与其他模型相比，具有最小的内存占用，速度更快，并在听觉测试中获得了最高的评分。"
}