{
    "title": "The complementary roles of non-verbal cues for Robust Pronunciation Assessment. (arXiv:2309.07739v1 [cs.CL])",
    "abstract": "Research on pronunciation assessment systems focuses on utilizing phonetic and phonological aspects of non-native (L2) speech, often neglecting the rich layer of information hidden within the non-verbal cues. In this study, we proposed a novel pronunciation assessment framework, IntraVerbalPA. % The framework innovatively incorporates both fine-grained frame- and abstract utterance-level non-verbal cues, alongside the conventional speech and phoneme representations. Additionally, we introduce ''Goodness of phonemic-duration'' metric to effectively model duration distribution within the framework. Our results validate the effectiveness of the proposed IntraVerbalPA framework and its individual components, yielding performance that either matches or outperforms existing research works.",
    "link": "http://arxiv.org/abs/2309.07739",
    "context": "Title: The complementary roles of non-verbal cues for Robust Pronunciation Assessment. (arXiv:2309.07739v1 [cs.CL])\nAbstract: Research on pronunciation assessment systems focuses on utilizing phonetic and phonological aspects of non-native (L2) speech, often neglecting the rich layer of information hidden within the non-verbal cues. In this study, we proposed a novel pronunciation assessment framework, IntraVerbalPA. % The framework innovatively incorporates both fine-grained frame- and abstract utterance-level non-verbal cues, alongside the conventional speech and phoneme representations. Additionally, we introduce ''Goodness of phonemic-duration'' metric to effectively model duration distribution within the framework. Our results validate the effectiveness of the proposed IntraVerbalPA framework and its individual components, yielding performance that either matches or outperforms existing research works.",
    "path": "papers/23/09/2309.07739.json",
    "total_tokens": 811,
    "tldr": "本研究提出了一种新颖的发音评估框架IntraVerbalPA，该框架通过同时考虑细粒度的帧级和抽象的句子级非语言线索，以及传统的语音和音素表示，实现了稳健的发音评估。",
    "en_tdlr": "This study proposes a novel pronunciation assessment framework, IntraVerbalPA, which achieves robust pronunciation assessment by simultaneously considering fine-grained frame-level and abstract utterance-level non-verbal cues, along with conventional speech and phoneme representations."
}