{
    "title": "Are Multilingual LLMs Culturally-Diverse Reasoners? An Investigation into Multicultural Proverbs and Sayings. (arXiv:2309.08591v1 [cs.CL])",
    "abstract": "Large language models (LLMs) are highly adept at question answering and reasoning tasks, but when reasoning in situational context, human expectations vary depending on the relevant cultural common ground. As human languages are associated with diverse cultures, LLMs should also be culturally-diverse reasoners. In this paper, we study the ability of a wide range of state-of-the-art multilingual LLMs (mLLMs) to reason with proverbs and sayings in a conversational context. Our experiments reveal that: (1) mLLMs 'knows' limited proverbs and memorizing proverbs does not mean understanding them within a conversational context; (2) mLLMs struggle to reason with figurative proverbs and sayings, and when asked to select the wrong answer (instead of asking it to select the correct answer); and (3) there is a \"culture gap\" in mLLMs when reasoning about proverbs and sayings translated from other languages. We construct and release our evaluation dataset MAPS (MulticultrAl Proverbs and Sayings) fo",
    "link": "http://arxiv.org/abs/2309.08591",
    "context": "Title: Are Multilingual LLMs Culturally-Diverse Reasoners? An Investigation into Multicultural Proverbs and Sayings. (arXiv:2309.08591v1 [cs.CL])\nAbstract: Large language models (LLMs) are highly adept at question answering and reasoning tasks, but when reasoning in situational context, human expectations vary depending on the relevant cultural common ground. As human languages are associated with diverse cultures, LLMs should also be culturally-diverse reasoners. In this paper, we study the ability of a wide range of state-of-the-art multilingual LLMs (mLLMs) to reason with proverbs and sayings in a conversational context. Our experiments reveal that: (1) mLLMs 'knows' limited proverbs and memorizing proverbs does not mean understanding them within a conversational context; (2) mLLMs struggle to reason with figurative proverbs and sayings, and when asked to select the wrong answer (instead of asking it to select the correct answer); and (3) there is a \"culture gap\" in mLLMs when reasoning about proverbs and sayings translated from other languages. We construct and release our evaluation dataset MAPS (MulticultrAl Proverbs and Sayings) fo",
    "path": "papers/23/09/2309.08591.json",
    "total_tokens": 908,
    "translated_title": "多语言LLMs是否具有文化多样性的推理能力？对多元文化谚语和俗语的调查研究",
    "translated_abstract": "大型语言模型（LLMs）在问答和推理任务方面非常擅长，但在情境背景下进行推理时，人类的期望因相关文化共同点而异。由于人类语言与多种文化相关联，LLMs也应该是具有文化多样性的推理者。在本文中，我们研究了一系列最先进的多语言LLMs（mLLMs）在对话环境中运用谚语和俗语进行推理的能力。我们的实验证明：（1）mLLMs只“知道”有限的谚语，并且仅仅记住谚语并不能在对话环境中理解它们；（2）mLLMs在推理比喻性的谚语和俗语时遇到困难，当被要求选择错误答案时，而不是选择正确答案；（3）在推理来自其他语言的谚语和俗语时，mLLMs存在“文化差距”。我们构建并发布了我们的评估数据集MAPS（多元文化谚语和俗语）。",
    "tldr": "本文研究了多语言LLMs在对话环境中运用谚语和俗语进行推理的能力，发现mLLMs在理解比喻性谚语、选择正确答案和推理其他语言的谚语时存在困难。"
}