{
    "title": "Overview of Human Activity Recognition Using Sensor Data. (arXiv:2309.07170v1 [eess.SP])",
    "abstract": "Human activity recognition (HAR) is an essential research field that has been used in different applications including home and workplace automation, security and surveillance as well as healthcare. Starting from conventional machine learning methods to the recently developing deep learning techniques and the Internet of things, significant contributions have been shown in the HAR area in the last decade. Even though several review and survey studies have been published, there is a lack of sensor-based HAR overview studies focusing on summarising the usage of wearable sensors and smart home sensors data as well as applications of HAR and deep learning techniques. Hence, we overview sensor-based HAR, discuss several important applications that rely on HAR, and highlight the most common machine learning methods that have been used for HAR. Finally, several challenges of HAR are explored that should be addressed to further improve the robustness of HAR.",
    "link": "http://arxiv.org/abs/2309.07170",
    "context": "Title: Overview of Human Activity Recognition Using Sensor Data. (arXiv:2309.07170v1 [eess.SP])\nAbstract: Human activity recognition (HAR) is an essential research field that has been used in different applications including home and workplace automation, security and surveillance as well as healthcare. Starting from conventional machine learning methods to the recently developing deep learning techniques and the Internet of things, significant contributions have been shown in the HAR area in the last decade. Even though several review and survey studies have been published, there is a lack of sensor-based HAR overview studies focusing on summarising the usage of wearable sensors and smart home sensors data as well as applications of HAR and deep learning techniques. Hence, we overview sensor-based HAR, discuss several important applications that rely on HAR, and highlight the most common machine learning methods that have been used for HAR. Finally, several challenges of HAR are explored that should be addressed to further improve the robustness of HAR.",
    "path": "papers/23/09/2309.07170.json",
    "total_tokens": 894,
    "translated_title": "传感器数据在人体活动识别中的综述",
    "translated_abstract": "人体活动识别（HAR）是一个重要的研究领域，在家庭自动化、工作场所自动化、安全监控以及医疗等多个应用中得到应用。在过去的十年中，从传统机器学习方法到最新发展的深度学习技术和物联网，HAR领域取得了显著的贡献。尽管已经发表了几篇综述和调研研究，但缺乏基于传感器的HAR综述研究，重点总结了可穿戴传感器和智能家居传感器数据的使用以及HAR和深度学习技术的应用。因此，我们总览了基于传感器的HAR，讨论了几个依赖于HAR的重要应用，并强调了已经用于HAR的常见机器学习方法。最后，我们探讨了几个HAR面临的挑战，这些挑战应该被解决以进一步提高HAR的鲁棒性。",
    "tldr": "本研究对传感器数据在人体活动识别中的应用进行了综述，总结了传感器数据的使用和HAR技术的应用，提出了几种常见的机器学习方法，并探讨了HAR面临的挑战。"
}