{
    "title": "A Reinforcement Learning Approach for Robotic Unloading from Visual Observations. (arXiv:2309.06621v1 [cs.RO])",
    "abstract": "In this work, we focus on a robotic unloading problem from visual observations, where robots are required to autonomously unload stacks of parcels using RGB-D images as their primary input source. While supervised and imitation learning have accomplished good results in these types of tasks, they heavily rely on labeled data, which are challenging to obtain in realistic scenarios. Our study aims to develop a sample efficient controller framework that can learn unloading tasks without the need for labeled data during the learning process. To tackle this challenge, we propose a hierarchical controller structure that combines a high-level decision-making module with classical motion control. The high-level module is trained using Deep Reinforcement Learning (DRL), wherein we incorporate a safety bias mechanism and design a reward function tailored to this task. Our experiments demonstrate that both these elements play a crucial role in achieving improved learning performance. Furthermore,",
    "link": "http://arxiv.org/abs/2309.06621",
    "context": "Title: A Reinforcement Learning Approach for Robotic Unloading from Visual Observations. (arXiv:2309.06621v1 [cs.RO])\nAbstract: In this work, we focus on a robotic unloading problem from visual observations, where robots are required to autonomously unload stacks of parcels using RGB-D images as their primary input source. While supervised and imitation learning have accomplished good results in these types of tasks, they heavily rely on labeled data, which are challenging to obtain in realistic scenarios. Our study aims to develop a sample efficient controller framework that can learn unloading tasks without the need for labeled data during the learning process. To tackle this challenge, we propose a hierarchical controller structure that combines a high-level decision-making module with classical motion control. The high-level module is trained using Deep Reinforcement Learning (DRL), wherein we incorporate a safety bias mechanism and design a reward function tailored to this task. Our experiments demonstrate that both these elements play a crucial role in achieving improved learning performance. Furthermore,",
    "path": "papers/23/09/2309.06621.json",
    "total_tokens": 959,
    "translated_title": "一种基于强化学习的机器人从视觉观察中卸货的方法",
    "translated_abstract": "本文针对机器人从视觉观察中的卸货问题进行研究，其中机器人需要使用RGB-D图像作为主要输入来自主地卸下一堆包裹。尽管监督学习和模仿学习在这类任务中取得了不错的结果，但它们严重依赖于标注数据，而在现实场景中获得这些数据是具有挑战性的。我们的研究旨在开发一个样本高效的控制器框架，该框架可以在学习过程中无需标注数据来学习卸货任务。为了解决这个挑战，我们提出了一个层次化的控制器结构，将高层决策模块与经典运动控制相结合。高层模块使用深度强化学习进行训练，我们在其中融入了安全偏见机制，并设计了一个适合这个任务的奖励函数。我们的实验证明，这两个元素在实现改进的学习性能方面起到了至关重要的作用。",
    "tldr": "本文提出了一种基于强化学习的机器人从视觉观察中卸货的方法，通过使用RGB-D图像作为输入并采用高层决策模块与经典运动控制相结合的层次化控制器结构，实现了无需标注数据的学习过程，并通过实验证明了该方法的改进学习性能。",
    "en_tdlr": "This work proposes a reinforcement learning approach for robotic unloading from visual observations, using RGB-D images as input and a hierarchical controller structure that combines a high-level decision-making module with classical motion control. It achieves a learning process without the need for labeled data and improves learning performance, as demonstrated by experiments."
}