{
    "title": "Design of Recognition and Evaluation System for Table Tennis Players' Motor Skills Based on Artificial Intelligence. (arXiv:2309.07141v1 [eess.SP])",
    "abstract": "With the rapid development of electronic science and technology, the research on wearable devices is constantly updated, but for now, it is not comprehensive for wearable devices to recognize and analyze the movement of specific sports. Based on this, this paper improves wearable devices of table tennis sport, and realizes the pattern recognition and evaluation of table tennis players' motor skills through artificial intelligence. Firstly, a device is designed to collect the movement information of table tennis players and the actual movement data is processed. Secondly, a sliding window is made to divide the collected motion data into a characteristic database of six table tennis benchmark movements. Thirdly, motion features were constructed based on feature engineering, and motor skills were identified for different models after dimensionality reduction. Finally, the hierarchical evaluation system of motor skills is established with the loss functions of different evaluation indexes.",
    "link": "http://arxiv.org/abs/2309.07141",
    "context": "Title: Design of Recognition and Evaluation System for Table Tennis Players' Motor Skills Based on Artificial Intelligence. (arXiv:2309.07141v1 [eess.SP])\nAbstract: With the rapid development of electronic science and technology, the research on wearable devices is constantly updated, but for now, it is not comprehensive for wearable devices to recognize and analyze the movement of specific sports. Based on this, this paper improves wearable devices of table tennis sport, and realizes the pattern recognition and evaluation of table tennis players' motor skills through artificial intelligence. Firstly, a device is designed to collect the movement information of table tennis players and the actual movement data is processed. Secondly, a sliding window is made to divide the collected motion data into a characteristic database of six table tennis benchmark movements. Thirdly, motion features were constructed based on feature engineering, and motor skills were identified for different models after dimensionality reduction. Finally, the hierarchical evaluation system of motor skills is established with the loss functions of different evaluation indexes.",
    "path": "papers/23/09/2309.07141.json",
    "total_tokens": 894,
    "translated_title": "基于人工智能的乒乓球运动员动作技能识别与评估系统设计",
    "translated_abstract": "随着电子科学技术的飞速发展，对可穿戴设备的研究不断更新，但目前来看，对于可穿戴设备识别和分析特定运动的能力还不够全面。基于此，本文改进了乒乓球运动的可穿戴设备，并通过人工智能实现了乒乓球运动员动作技能的模式识别和评估。首先设计了一个设备来收集乒乓球运动员的动作信息，并对实际运动数据进行处理。其次，制作了一个滑动窗口来将收集到的动作数据分割成六个乒乓球基准动作的特征数据库。然后，基于特征工程构建了动作特征，并通过降维后的不同模型来识别不同的动作技能。最后，利用不同评估指标的损失函数建立了动作技能的层次化评估系统。",
    "tldr": "本研究基于人工智能，设计了一种用于识别和评估乒乓球运动员动作技能的系统，通过改进可穿戴设备，并利用特征工程、降维和不同评估指标的损失函数实现了动作的模式识别和层次化评估。"
}