{
    "title": "Dictionary Attack on IMU-based Gait Authentication. (arXiv:2309.11766v1 [cs.CR])",
    "abstract": "We present a novel adversarial model for authentication systems that use gait patterns recorded by the inertial measurement unit (IMU) built into smartphones. The attack idea is inspired by and named after the concept of a dictionary attack on knowledge (PIN or password) based authentication systems. In particular, this work investigates whether it is possible to build a dictionary of IMUGait patterns and use it to launch an attack or find an imitator who can actively reproduce IMUGait patterns that match the target's IMUGait pattern. Nine physically and demographically diverse individuals walked at various levels of four predefined controllable and adaptable gait factors (speed, step length, step width, and thigh-lift), producing 178 unique IMUGait patterns. Each pattern attacked a wide variety of user authentication models. The deeper analysis of error rates (before and after the attack) challenges the belief that authentication systems based on IMUGait patterns are the most difficul",
    "link": "http://arxiv.org/abs/2309.11766",
    "context": "Title: Dictionary Attack on IMU-based Gait Authentication. (arXiv:2309.11766v1 [cs.CR])\nAbstract: We present a novel adversarial model for authentication systems that use gait patterns recorded by the inertial measurement unit (IMU) built into smartphones. The attack idea is inspired by and named after the concept of a dictionary attack on knowledge (PIN or password) based authentication systems. In particular, this work investigates whether it is possible to build a dictionary of IMUGait patterns and use it to launch an attack or find an imitator who can actively reproduce IMUGait patterns that match the target's IMUGait pattern. Nine physically and demographically diverse individuals walked at various levels of four predefined controllable and adaptable gait factors (speed, step length, step width, and thigh-lift), producing 178 unique IMUGait patterns. Each pattern attacked a wide variety of user authentication models. The deeper analysis of error rates (before and after the attack) challenges the belief that authentication systems based on IMUGait patterns are the most difficul",
    "path": "papers/23/09/2309.11766.json",
    "total_tokens": 977,
    "translated_title": "基于惯性测量单元(IMU)的步态认证的字典攻击",
    "translated_abstract": "我们提出了一种新的对使用智能手机内置的惯性测量单元(IMU)记录的步态模式进行认证的敌对模型。攻击思路受到字典攻击知识(PIN或密码)基础认证系统的概念启发，并以此命名。具体而言，本研究调查是否可能构建一本IMUGait模式的字典，然后使用它发动攻击，或找到一个能够主动复制与目标IMUGait模式匹配的模仿者。九个身体和人口统计学多样化的个体以不同水平的四个预定义可控和可调节的步态因素(速度、步长、步宽和大腿抬起)行走，产生了178种独特的IMUGait模式。每个模式都会攻击各种用户认证模型。对错误率的深入分析(攻击前后)挑战了基于IMUGait模式的认证系统是最困难的这种信仰。",
    "tldr": "这项研究提出了一种对使用惯性测量单元记录的步态模式进行认证的敌对模型。研究调查了是否可能构建一本IMUGait模式的字典，用于发动攻击或找到能够匹配目标IMUGait模式的模仿者。通过对错误率的进一步分析，挑战了基于IMUGait模式的认证系统是否最困难的观点。",
    "en_tdlr": "This paper presents a novel adversarial model for authentication systems using gait patterns recorded by the inertial measurement unit (IMU). The study investigates whether it is possible to build a dictionary of IMUGait patterns for launching attacks or finding imitators who can reproduce matching patterns. The analysis challenges the belief that authentication systems based on IMUGait patterns are the most difficult."
}