{
    "title": "Optimal transport distances for directed, weighted graphs: a case study with cell-cell communication networks. (arXiv:2309.07030v1 [cs.LG])",
    "abstract": "Comparing graphs of optimal transport has recently gained significant attention, as the distances induced by optimal transport provide both a principled metric between graphs as well as an interpretable description of the associated changes between graphs in terms of a transport plan. As the lack of symmetry introduces challenges in the typically considered formulations, optimal transport distances for graphs have mostly been developed for undirected graphs. Here, we propose two distance measures to compare directed graphs based on variants of optimal transport: (i) an earth movers distance (Wasserstein) and (ii) a Gromov-Wasserstein (GW) distance. We evaluate these two distances and discuss their relative performance for both simulated graph data and real-world directed cell-cell communication graphs, inferred from single-cell RNA-seq data.",
    "link": "http://arxiv.org/abs/2309.07030",
    "context": "Title: Optimal transport distances for directed, weighted graphs: a case study with cell-cell communication networks. (arXiv:2309.07030v1 [cs.LG])\nAbstract: Comparing graphs of optimal transport has recently gained significant attention, as the distances induced by optimal transport provide both a principled metric between graphs as well as an interpretable description of the associated changes between graphs in terms of a transport plan. As the lack of symmetry introduces challenges in the typically considered formulations, optimal transport distances for graphs have mostly been developed for undirected graphs. Here, we propose two distance measures to compare directed graphs based on variants of optimal transport: (i) an earth movers distance (Wasserstein) and (ii) a Gromov-Wasserstein (GW) distance. We evaluate these two distances and discuss their relative performance for both simulated graph data and real-world directed cell-cell communication graphs, inferred from single-cell RNA-seq data.",
    "path": "papers/23/09/2309.07030.json",
    "total_tokens": 800,
    "translated_title": "有向加权图的最优输运距离：以细胞间通讯网络为案例研究",
    "translated_abstract": "近年来，比较最优输运图引起了相当大的关注，因为最优输运引起的距离既提供了图之间的合理度量，又通过输运计划的可解释描述了图之间相关变化。然而，由于缺乏对称性，通常考虑的最优输运距离主要用于无向图。本文提出了两种基于最优输运变体的距离度量来比较有向图：（i）地球移动距离（Wasserstein）和（ii）Gromov-Wasserstein（GW）距离。我们评估了这两种距离，并讨论了它们在仿真图数据和基于单细胞RNA-seq数据推断的实际有向细胞间通讯图上的相对表现。",
    "tldr": "本文提出了两种基于最优输运的距离度量，用于比较有向图，并通过仿真图数据和单细胞RNA-seq数据推断的实际细胞间通讯图对其相对表现进行了评估。",
    "en_tdlr": "This paper proposes two distance measures based on optimal transport for comparing directed graphs, and evaluates their performance using simulated graph data and real-world cell-cell communication graphs inferred from single-cell RNA-seq data."
}