{
    "title": "Discrete Versus Continuous Algorithms in Dynamics of Affective Decision Making. (arXiv:2309.00357v1 [cs.AI])",
    "abstract": "The dynamics of affective decision making is considered for an intelligent network composed of agents with different types of memory: long-term and short-term memory. The consideration is based on probabilistic affective decision theory, which takes into account the rational utility of alternatives as well as the emotional alternative attractiveness. The objective of this paper is the comparison of two multistep operational algorithms of the intelligent network: one based on discrete dynamics and the other on continuous dynamics. By means of numerical analysis, it is shown that, depending on the network parameters, the characteristic probabilities for continuous and discrete operations can exhibit either close or drastically different behavior. Thus, depending on which algorithm is employed, either discrete or continuous, theoretical predictions can be rather different, which does not allow for a uniquely defined description of practical problems. This finding is important for understa",
    "link": "http://arxiv.org/abs/2309.00357",
    "context": "Title: Discrete Versus Continuous Algorithms in Dynamics of Affective Decision Making. (arXiv:2309.00357v1 [cs.AI])\nAbstract: The dynamics of affective decision making is considered for an intelligent network composed of agents with different types of memory: long-term and short-term memory. The consideration is based on probabilistic affective decision theory, which takes into account the rational utility of alternatives as well as the emotional alternative attractiveness. The objective of this paper is the comparison of two multistep operational algorithms of the intelligent network: one based on discrete dynamics and the other on continuous dynamics. By means of numerical analysis, it is shown that, depending on the network parameters, the characteristic probabilities for continuous and discrete operations can exhibit either close or drastically different behavior. Thus, depending on which algorithm is employed, either discrete or continuous, theoretical predictions can be rather different, which does not allow for a uniquely defined description of practical problems. This finding is important for understa",
    "path": "papers/23/09/2309.00357.json",
    "total_tokens": 841,
    "translated_title": "情感决策制定中的离散与连续算法的比较",
    "translated_abstract": "本文考虑了情感决策制定的动态过程，针对由具有长期和短期记忆的不同类型代理组成的智能网络。研究基于概率情感决策理论，该理论考虑了替代方案的理性效用和情感吸引力。本文的目标是比较智能网络中两种多步操作算法：基于离散动力学和基于连续动力学的算法。通过数值分析，结果显示，根据网络参数的不同，连续和离散操作的特征概率可能呈现出接近或截然不同的行为。因此，根据所采用的算法（离散或连续），理论预测可能会有相当大的差异，这不允许对实际问题进行唯一定义的描述。这一发现对于理解情感决策制定过程是重要的。",
    "tldr": "本文比较了情感决策制定中离散和连续算法的表现，并发现根据网络参数的不同，两种算法可能得到不同的理论预测，这对于实际问题的描述具有重要影响。"
}