{
    "title": "Developing A Fair Individualized Polysocial Risk Score (iPsRS) for Identifying Increased Social Risk of Hospitalizations in Patients with Type 2 Diabetes (T2D). (arXiv:2309.02467v1 [cs.LG])",
    "abstract": "Background: Racial and ethnic minority groups and individuals facing social disadvantages, which often stem from their social determinants of health (SDoH), bear a disproportionate burden of type 2 diabetes (T2D) and its complications. It is therefore crucial to implement effective social risk management strategies at the point of care. Objective: To develop an EHR-based machine learning (ML) analytical pipeline to identify the unmet social needs associated with hospitalization risk in patients with T2D. Methods: We identified 10,192 T2D patients from the EHR data (from 2012 to 2022) from the University of Florida Health Integrated Data Repository, including contextual SDoH (e.g., neighborhood deprivation) and individual-level SDoH (e.g., housing stability). We developed an electronic health records (EHR)-based machine learning (ML) analytic pipeline, namely individualized polysocial risk score (iPsRS), to identify high social risk associated with hospitalizations in T2D patients, alon",
    "link": "http://arxiv.org/abs/2309.02467",
    "context": "Title: Developing A Fair Individualized Polysocial Risk Score (iPsRS) for Identifying Increased Social Risk of Hospitalizations in Patients with Type 2 Diabetes (T2D). (arXiv:2309.02467v1 [cs.LG])\nAbstract: Background: Racial and ethnic minority groups and individuals facing social disadvantages, which often stem from their social determinants of health (SDoH), bear a disproportionate burden of type 2 diabetes (T2D) and its complications. It is therefore crucial to implement effective social risk management strategies at the point of care. Objective: To develop an EHR-based machine learning (ML) analytical pipeline to identify the unmet social needs associated with hospitalization risk in patients with T2D. Methods: We identified 10,192 T2D patients from the EHR data (from 2012 to 2022) from the University of Florida Health Integrated Data Repository, including contextual SDoH (e.g., neighborhood deprivation) and individual-level SDoH (e.g., housing stability). We developed an electronic health records (EHR)-based machine learning (ML) analytic pipeline, namely individualized polysocial risk score (iPsRS), to identify high social risk associated with hospitalizations in T2D patients, alon",
    "path": "papers/23/09/2309.02467.json",
    "total_tokens": 1045,
    "translated_title": "为识别2型糖尿病患者社交风险增加而开发公平的个性化多社交风险评分（iPsRS）",
    "translated_abstract": "背景：种族和少数民族群体以及面临社会不利因素的个体，这些因素往往源于他们的社会健康决定因素（SDoH），承担着2型糖尿病（T2D）及其并发症的不成比例负担。因此，在护理点实施有效的社会风险管理策略至关重要。目标：开发一种基于电子健康记录（EHR）的机器学习（ML）分析流程，以识别与T2D患者住院风险相关的未满足社会需求。方法：我们从佛罗里达大学健康整合数据存储库中的EHR数据（2012年至2022年）中识别出10,192名T2D患者，包括背景SDoH（如社区贫困化）和个体级SDoH（如住房稳定性）。我们开发了一种基于电子健康记录（EHR）的机器学习（ML）分析流程，即个性化多社交风险评分（iPsRS），以识别T2D患者住院风险高的社会风险。",
    "tldr": "本研究开发了一种基于电子健康记录的机器学习分析流程，名为个性化多社交风险评分（iPsRS），用于识别与2型糖尿病患者住院风险相关的未满足社会需求。",
    "en_tdlr": "A machine learning approach, called individualized polysocial risk score (iPsRS), was developed to identify the unmet social needs associated with hospitalization risk in patients with type 2 diabetes (T2D) by utilizing electronic health records (EHR) data."
}