{
    "title": "Partially-Specified Causal Simulations. (arXiv:2309.10514v1 [stat.ME])",
    "abstract": "Simulation studies play a key role in the validation of causal inference methods. The simulation results are reliable only if the study is designed according to the promised operational conditions of the method-in-test. Still, many causal inference literature tend to design over-restricted or misspecified studies. In this paper, we elaborate on the problem of improper simulation design for causal methods and compile a list of desiderata for an effective simulation framework. We then introduce partially-randomized causal simulation (PARCS), a simulation framework that meets those desiderata. PARCS synthesizes data based on graphical causal models and a wide range of adjustable parameters. There is a legible mapping from usual causal assumptions to the parameters, thus, users can identify and specify the subset of related parameters and randomize the remaining ones to generate a range of complying data-generating processes for their causal method. The result is a more comprehensive and i",
    "link": "http://arxiv.org/abs/2309.10514",
    "context": "Title: Partially-Specified Causal Simulations. (arXiv:2309.10514v1 [stat.ME])\nAbstract: Simulation studies play a key role in the validation of causal inference methods. The simulation results are reliable only if the study is designed according to the promised operational conditions of the method-in-test. Still, many causal inference literature tend to design over-restricted or misspecified studies. In this paper, we elaborate on the problem of improper simulation design for causal methods and compile a list of desiderata for an effective simulation framework. We then introduce partially-randomized causal simulation (PARCS), a simulation framework that meets those desiderata. PARCS synthesizes data based on graphical causal models and a wide range of adjustable parameters. There is a legible mapping from usual causal assumptions to the parameters, thus, users can identify and specify the subset of related parameters and randomize the remaining ones to generate a range of complying data-generating processes for their causal method. The result is a more comprehensive and i",
    "path": "papers/23/09/2309.10514.json",
    "total_tokens": 869,
    "translated_title": "部分指定的因果模拟",
    "translated_abstract": "模拟研究在验证因果推断方法中起着关键作用。只有在研究根据被测试方法所承诺的操作条件进行设计时，模拟结果才是可靠的。然而，很多因果推断文献往往设计了过于受限或错误指定的研究。本文详细介绍了因果方法不当模拟设计的问题，并编制了有效的模拟框架的一系列期望。然后，我们介绍了部分随机化的因果模拟（PARCS），这是一个满足这些期望的模拟框架。PARCS基于图形化的因果模型和一系列可调参数合成数据。通常的因果假设与参数之间有明确的映射，因此用户可以确定并指定相关参数的子集，并随机化其余参数以生成符合条件的数据生成过程，用于其因果方法。结果是更全面和准确地评估因果推断方法的数据。",
    "tldr": "本文介绍了因果推断方法不当模拟设计的问题，并提出了一个满足期望的模拟框架PARCS，该框架合成了基于因果模型和可调参数的数据，使用户能够生成符合条件的数据来评估因果推断方法。",
    "en_tdlr": "This paper discusses the issue of improper simulation design for causal inference methods and proposes PARCS, a simulation framework that synthesizes data based on causal models and adjustable parameters, allowing users to generate compliant data for evaluating causal inference methods."
}