{
    "title": "Free Discontinuity Design: With an Application to the Economic Effects of Internet Shutdowns. (arXiv:2309.14630v1 [econ.EM])",
    "abstract": "Thresholds in treatment assignments can produce discontinuities in outcomes, revealing causal insights. In many contexts, like geographic settings, these thresholds are unknown and multivariate. We propose a non-parametric method to estimate the resulting discontinuities by segmenting the regression surface into smooth and discontinuous parts. This estimator uses a convex relaxation of the Mumford-Shah functional, for which we establish identification and convergence. Using our method, we estimate that an internet shutdown in India resulted in a reduction of economic activity by over 50%, greatly surpassing previous estimates and shedding new light on the true cost of such shutdowns for digital economies globally.",
    "link": "http://arxiv.org/abs/2309.14630",
    "context": "Title: Free Discontinuity Design: With an Application to the Economic Effects of Internet Shutdowns. (arXiv:2309.14630v1 [econ.EM])\nAbstract: Thresholds in treatment assignments can produce discontinuities in outcomes, revealing causal insights. In many contexts, like geographic settings, these thresholds are unknown and multivariate. We propose a non-parametric method to estimate the resulting discontinuities by segmenting the regression surface into smooth and discontinuous parts. This estimator uses a convex relaxation of the Mumford-Shah functional, for which we establish identification and convergence. Using our method, we estimate that an internet shutdown in India resulted in a reduction of economic activity by over 50%, greatly surpassing previous estimates and shedding new light on the true cost of such shutdowns for digital economies globally.",
    "path": "papers/23/09/2309.14630.json",
    "total_tokens": 784,
    "translated_title": "自由不连续设计：应用于互联网封锁的经济影响",
    "translated_abstract": "在治疗分配中的阈值可以产生结果的不连续性，从而揭示因果洞察力。在许多情境中，如地理环境，这些阈值是未知和多变量的。我们提出了一种非参数方法来估计由此产生的不连续性，通过将回归曲面分割成平滑和不连续部分。该估计器使用了Mumford-Shah函数的凸松弛，我们建立了其识别和收敛性。使用我们的方法，我们估计印度的Internet封锁导致经济活动减少超过50％，远远超过以前的估计，并对全球数字经济的此类封锁的真实成本产生了新的见解。",
    "tldr": "本文提出了一种非参数方法来估计互联网封锁对经济活动的影响，并发现印度的Internet封锁导致经济活动减少超过50％，对全球数字经济的封锁真实成本产生了新的见解。",
    "en_tdlr": "This paper proposes a non-parametric method to estimate the economic effects of internet shutdowns and finds that an internet shutdown in India resulted in a reduction of economic activity by over 50%, shedding new light on the true cost of such shutdowns for digital economies globally."
}