{
    "title": "Comparing effects of price limit and circuit breaker in stock exchanges by an agent-based model. (arXiv:2309.10220v1 [q-fin.CP])",
    "abstract": "The prevention of rapidly and steeply falling market prices is vital to avoid financial crisis. To this end, some stock exchanges implement a price limit or a circuit breaker, and there has been intensive investigation into which regulation best prevents rapid and large variations in price. In this study, we examine this question using an artificial market model that is an agent-based model for a financial market. Our findings show that the price limit and the circuit breaker basically have the same effect when the parameters, limit price range and limit time range, are the same. However, the price limit is less effective when limit the time range is smaller than the cancel time range. With the price limit, many sell orders are accumulated around the lower limit price, and when the lower limit price is changed before the accumulated sell orders are cancelled, it leads to the accumulation of sell orders of various prices. These accumulated sell orders essentially act as a wall against b",
    "link": "http://arxiv.org/abs/2309.10220",
    "context": "Title: Comparing effects of price limit and circuit breaker in stock exchanges by an agent-based model. (arXiv:2309.10220v1 [q-fin.CP])\nAbstract: The prevention of rapidly and steeply falling market prices is vital to avoid financial crisis. To this end, some stock exchanges implement a price limit or a circuit breaker, and there has been intensive investigation into which regulation best prevents rapid and large variations in price. In this study, we examine this question using an artificial market model that is an agent-based model for a financial market. Our findings show that the price limit and the circuit breaker basically have the same effect when the parameters, limit price range and limit time range, are the same. However, the price limit is less effective when limit the time range is smaller than the cancel time range. With the price limit, many sell orders are accumulated around the lower limit price, and when the lower limit price is changed before the accumulated sell orders are cancelled, it leads to the accumulation of sell orders of various prices. These accumulated sell orders essentially act as a wall against b",
    "path": "papers/23/09/2309.10220.json",
    "total_tokens": 935,
    "translated_title": "通过基于智能体的模型比较股票交易所中的价格限制与熔断机制的效果",
    "translated_abstract": "防止市场价格迅速下跌对于避免金融危机至关重要。为此，一些股票交易所实施了价格限制或熔断机制，并对哪种规定最有效地防止价格的快速和大幅波动进行了密集调查。本研究使用一个金融市场的基于智能体的人工市场模型来探讨这个问题。研究结果显示，在参数相同的情况下，价格限制和熔断机制基本上具有相同的效果。然而，当限制时间范围小于取消时间范围时，价格限制的效果较差。价格限制会导致许多卖单在较低限价处积累，当低限价在已积累的卖单被取消之前被改变时，会导致不同价格的卖单积累。这些积累的卖单实际上会形成一个阻碍市场下跌的壁垒。",
    "tldr": "本研究通过基于智能体的模型比较了股票交易所中的价格限制和熔断机制，发现在参数相同的情况下，它们基本上具有相同的效果。然而，当限制时间范围小于取消时间范围时，价格限制的效果较差。",
    "en_tdlr": "This study compares the effects of price limit and circuit breaker in stock exchanges using an agent-based model and finds that they have similar effects when the parameters are the same. However, the price limit is less effective when the limit time range is smaller than the cancel time range."
}