{
    "title": "Accurate and Scalable Estimation of Epistemic Uncertainty for Graph Neural Networks. (arXiv:2309.10976v1 [cs.LG])",
    "abstract": "Safe deployment of graph neural networks (GNNs) under distribution shift requires models to provide accurate confidence indicators (CI). However, while it is well-known in computer vision that CI quality diminishes under distribution shift, this behavior remains understudied for GNNs. Hence, we begin with a case study on CI calibration under controlled structural and feature distribution shifts and demonstrate that increased expressivity or model size do not always lead to improved CI performance. Consequently, we instead advocate for the use of epistemic uncertainty quantification (UQ) methods to modulate CIs. To this end, we propose G-$\\Delta$UQ, a new single model UQ method that extends the recently proposed stochastic centering framework to support structured data and partial stochasticity. Evaluated across covariate, concept, and graph size shifts, G-$\\Delta$UQ not only outperforms several popular UQ methods in obtaining calibrated CIs, but also outperforms alternatives when CIs a",
    "link": "http://arxiv.org/abs/2309.10976",
    "context": "Title: Accurate and Scalable Estimation of Epistemic Uncertainty for Graph Neural Networks. (arXiv:2309.10976v1 [cs.LG])\nAbstract: Safe deployment of graph neural networks (GNNs) under distribution shift requires models to provide accurate confidence indicators (CI). However, while it is well-known in computer vision that CI quality diminishes under distribution shift, this behavior remains understudied for GNNs. Hence, we begin with a case study on CI calibration under controlled structural and feature distribution shifts and demonstrate that increased expressivity or model size do not always lead to improved CI performance. Consequently, we instead advocate for the use of epistemic uncertainty quantification (UQ) methods to modulate CIs. To this end, we propose G-$\\Delta$UQ, a new single model UQ method that extends the recently proposed stochastic centering framework to support structured data and partial stochasticity. Evaluated across covariate, concept, and graph size shifts, G-$\\Delta$UQ not only outperforms several popular UQ methods in obtaining calibrated CIs, but also outperforms alternatives when CIs a",
    "path": "papers/23/09/2309.10976.json",
    "total_tokens": 971,
    "translated_title": "准确且可扩展的图神经网络的认知不确定性估计",
    "translated_abstract": "在分布转移下安全部署图神经网络（GNNs）需要模型提供准确的信心指标（CI）。然而，尽管在计算机视觉领域已经知道在分布转移下CI的质量会降低，但对于GNNs来说这个行为仍未得到充分研究。因此，我们通过对受控的结构和特征分布转移下的CI校准进行案例研究，证明了表达能力或模型大小的增加不总是能提高CI的性能。因此，我们提倡使用认知不确定性量化（UQ）方法来调节CI。为此，我们提出了G-$\\Delta$UQ，一种新的单模型UQ方法，它扩展了最近提出的随机居中框架，以支持结构化数据和部分随机性。在协变量、概念和图大小转移方面的评估中，G-$\\Delta$UQ不仅在获得校准的CI方面表现优于几种流行的UQ方法，而且在CI需要设计为稀缺资源时表现优于其他替代方法。",
    "tldr": "本文针对图神经网络（GNNs）提出了一种准确且可扩展的认知不确定性估计方法，该方法通过扩展随机居中框架，并支持结构化数据和部分随机性，能够获得更好的校准的信心指标（CI）性能。",
    "en_tdlr": "This paper proposes an accurate and scalable method for estimating epistemic uncertainty in graph neural networks (GNNs), which extends the stochastic centering framework and supports structured data and partial stochasticity, leading to improved calibration of confidence indicators (CI)."
}