{
    "title": "Speech Audio Synthesis from Tagged MRI and Non-Negative Matrix Factorization via Plastic Transformer. (arXiv:2309.14586v1 [cs.SD])",
    "abstract": "The tongue's intricate 3D structure, comprising localized functional units, plays a crucial role in the production of speech. When measured using tagged MRI, these functional units exhibit cohesive displacements and derived quantities that facilitate the complex process of speech production. Non-negative matrix factorization-based approaches have been shown to estimate the functional units through motion features, yielding a set of building blocks and a corresponding weighting map. Investigating the link between weighting maps and speech acoustics can offer significant insights into the intricate process of speech production. To this end, in this work, we utilize two-dimensional spectrograms as a proxy representation, and develop an end-to-end deep learning framework for translating weighting maps to their corresponding audio waveforms. Our proposed plastic light transformer (PLT) framework is based on directional product relative position bias and single-level spatial pyramid pooling,",
    "link": "http://arxiv.org/abs/2309.14586",
    "context": "Title: Speech Audio Synthesis from Tagged MRI and Non-Negative Matrix Factorization via Plastic Transformer. (arXiv:2309.14586v1 [cs.SD])\nAbstract: The tongue's intricate 3D structure, comprising localized functional units, plays a crucial role in the production of speech. When measured using tagged MRI, these functional units exhibit cohesive displacements and derived quantities that facilitate the complex process of speech production. Non-negative matrix factorization-based approaches have been shown to estimate the functional units through motion features, yielding a set of building blocks and a corresponding weighting map. Investigating the link between weighting maps and speech acoustics can offer significant insights into the intricate process of speech production. To this end, in this work, we utilize two-dimensional spectrograms as a proxy representation, and develop an end-to-end deep learning framework for translating weighting maps to their corresponding audio waveforms. Our proposed plastic light transformer (PLT) framework is based on directional product relative position bias and single-level spatial pyramid pooling,",
    "path": "papers/23/09/2309.14586.json",
    "total_tokens": 867,
    "translated_title": "从标记的MRI和非负矩阵分解通过可塑性变换器合成语音音频",
    "translated_abstract": "舌头的复杂3D结构是语音产生过程中起关键作用的局部功能单元的组成部分。使用标记的MRI测量时，这些功能单元表现出具有内聚位移的和派生数量，从而促进了复杂的语音产生过程。基于非负矩阵分解的方法已经被证明可以通过运动特征估计功能单元，从而产生一组构建块和相应的加权图。研究加权图与语音声学之间的联系可以对复杂的语音产生过程提供重要洞察。为此，我们在这项工作中利用二维频谱图作为代理表示，开发了一个端到端的深度学习框架，将加权图转化为相应的音频波形。我们提出的可塑性轻型变换器（PLT）框架基于方向性产品相对位置偏差和单层空间金字塔池化。",
    "tldr": "这项研究利用标记的MRI测量舌头的功能单元，并开发了一个深度学习框架，将权重图转化为对应的音频波形，为研究语音产生过程提供了重要洞察。"
}