{
    "title": "Compromise in Multilateral Negotiations and the Global Regulation of Artificial Intelligence. (arXiv:2309.17158v1 [cs.CY])",
    "abstract": "As artificial intelligence (AI) technologies spread worldwide, international discussions have increasingly focused on their consequences for democracy, human rights, fundamental freedoms, security, and economic and social development. In this context, UNESCO's Recommendation on the Ethics of Artificial Intelligence, adopted in November 2021, has emerged as the first global normative framework for AI development and deployment. The intense negotiations of every detail of the document brought forth numerous controversies among UNESCO member states. Drawing on a unique set of primary sources, including written positions and recorded deliberations, this paper explains the achievement of global compromise on AI regulation despite the multiplicity of UNESCO member-state positions representing a variety of liberal and sovereignist preferences. Building upon Boltanski's pragmatic sociology, it conceptualises the practice of multilateral negotiations and attributes the multilateral compromise t",
    "link": "http://arxiv.org/abs/2309.17158",
    "context": "Title: Compromise in Multilateral Negotiations and the Global Regulation of Artificial Intelligence. (arXiv:2309.17158v1 [cs.CY])\nAbstract: As artificial intelligence (AI) technologies spread worldwide, international discussions have increasingly focused on their consequences for democracy, human rights, fundamental freedoms, security, and economic and social development. In this context, UNESCO's Recommendation on the Ethics of Artificial Intelligence, adopted in November 2021, has emerged as the first global normative framework for AI development and deployment. The intense negotiations of every detail of the document brought forth numerous controversies among UNESCO member states. Drawing on a unique set of primary sources, including written positions and recorded deliberations, this paper explains the achievement of global compromise on AI regulation despite the multiplicity of UNESCO member-state positions representing a variety of liberal and sovereignist preferences. Building upon Boltanski's pragmatic sociology, it conceptualises the practice of multilateral negotiations and attributes the multilateral compromise t",
    "path": "papers/23/09/2309.17158.json",
    "total_tokens": 895,
    "translated_title": "多边谈判中的折衷与全球人工智能规范",
    "translated_abstract": "随着人工智能（AI）技术在全球范围内的传播，国际讨论越来越集中于AI对民主、人权、基本自由、安全以及经济和社会发展的影响。在这个背景下，联合国教科文组织于2021年11月通过的《人工智能伦理建议》已成为人工智能发展和部署的首个全球规范框架。本文通过独特的一组主要来源，包括书面立场和记录的讨论，解释了尽管联合国教科文组织成员国代表了多种自由主义和主权主义偏好的立场，但在人工智能规范方面如何实现全球妥协。借鉴博尔唐斯基的实用社会学，本文对多边谈判实践进行了概念化，并将多边妥协归因于各方的实际做法。",
    "tldr": "本文研究了多边谈判中的全球妥协，解释了尽管联合国教科文组织成员国代表了多种偏好，但在人工智能规范方面如何实现全球妥协。通过独特的主要来源，本文揭示了实现折衷的实践。",
    "en_tdlr": "This paper investigates global compromise in multilateral negotiations regarding AI regulation. It explains how despite representing various preferences, UNESCO member states achieved a global compromise on AI norms. Drawing on unique primary sources, the paper reveals the practice of compromise."
}