{
    "title": "Identifying Simulation Model Through Alternative Techniques for a Medical Device Assembly Process. (arXiv:2309.15094v1 [cs.LG])",
    "abstract": "This scientific paper explores two distinct approaches for identifying and approximating the simulation model, particularly in the context of the snap process crucial to medical device assembly. Simulation models play a pivotal role in providing engineers with insights into industrial processes, enabling experimentation and troubleshooting before physical assembly. However, their complexity often results in time-consuming computations.  To mitigate this complexity, we present two distinct methods for identifying simulation models: one utilizing Spline functions and the other harnessing Machine Learning (ML) models. Our goal is to create adaptable models that accurately represent the snap process and can accommodate diverse scenarios. Such models hold promise for enhancing process understanding and aiding in decision-making, especially when data availability is limited.",
    "link": "http://arxiv.org/abs/2309.15094",
    "context": "Title: Identifying Simulation Model Through Alternative Techniques for a Medical Device Assembly Process. (arXiv:2309.15094v1 [cs.LG])\nAbstract: This scientific paper explores two distinct approaches for identifying and approximating the simulation model, particularly in the context of the snap process crucial to medical device assembly. Simulation models play a pivotal role in providing engineers with insights into industrial processes, enabling experimentation and troubleshooting before physical assembly. However, their complexity often results in time-consuming computations.  To mitigate this complexity, we present two distinct methods for identifying simulation models: one utilizing Spline functions and the other harnessing Machine Learning (ML) models. Our goal is to create adaptable models that accurately represent the snap process and can accommodate diverse scenarios. Such models hold promise for enhancing process understanding and aiding in decision-making, especially when data availability is limited.",
    "path": "papers/23/09/2309.15094.json",
    "total_tokens": 803,
    "translated_title": "通过替代技术识别医疗设备组装过程的仿真模型",
    "translated_abstract": "本科学论文探讨了两种不同的方法来识别和逼近仿真模型，特别是在医疗设备组装过程中关键的快拍流程中的应用。仿真模型在提供工程师对工业过程的洞察力方面起着关键作用，使其在实际组装之前进行实验和故障排除成为可能。然而，它们的复杂性常常导致耗时的计算。为了减轻这种复杂性，我们提出了两种不同的识别仿真模型的方法：一种利用样条函数，另一种利用机器学习模型。我们的目标是创建具有适应性的模型，可以准确地代表快拍过程并适应多种情景。这样的模型有望提高流程理解和决策支持能力，特别是在数据可用性有限的情况下。",
    "tldr": "本论文通过使用Spline函数和机器学习模型来识别仿真模型，以提高对医疗设备组装过程中的快拍流程的理解和决策支持能力。",
    "en_tdlr": "This paper explores two approaches, utilizing Spline functions and machine learning models, to identify simulation models and improve understanding and decision-making in the context of the snap process crucial to medical device assembly."
}