{
    "title": "Crowdotic: Transformer-based Occupancy Estimation for Hospital Waiting Rooms with Non-speech Audio and Differential Privacy. (arXiv:2309.10280v1 [cs.SD])",
    "abstract": "Privacy-preserving crowd density analysis finds application across a wide range of scenarios, substantially enhancing smart building operation and management while upholding privacy expectations in various spaces. We propose a non-speech audio-based approach for crowd analytics, leveraging a transformer-based model. Our results demonstrate that non-speech audio alone can be used to conduct such analysis with remarkable accuracy. To the best of our knowledge, this is the first time when non-speech audio signals are proposed for predicting occupancy. As far as we know, there has been no other similar approach of its kind prior to this. To accomplish this, we deployed our sensor-based platform in the waiting room of a large hospital with IRB approval over a period of several months to capture non-speech audio and thermal images for the training and evaluation of our models. The proposed non-speech-based approach outperformed the thermal camera-based model and all other baselines. In addit",
    "link": "http://arxiv.org/abs/2309.10280",
    "context": "Title: Crowdotic: Transformer-based Occupancy Estimation for Hospital Waiting Rooms with Non-speech Audio and Differential Privacy. (arXiv:2309.10280v1 [cs.SD])\nAbstract: Privacy-preserving crowd density analysis finds application across a wide range of scenarios, substantially enhancing smart building operation and management while upholding privacy expectations in various spaces. We propose a non-speech audio-based approach for crowd analytics, leveraging a transformer-based model. Our results demonstrate that non-speech audio alone can be used to conduct such analysis with remarkable accuracy. To the best of our knowledge, this is the first time when non-speech audio signals are proposed for predicting occupancy. As far as we know, there has been no other similar approach of its kind prior to this. To accomplish this, we deployed our sensor-based platform in the waiting room of a large hospital with IRB approval over a period of several months to capture non-speech audio and thermal images for the training and evaluation of our models. The proposed non-speech-based approach outperformed the thermal camera-based model and all other baselines. In addit",
    "path": "papers/23/09/2309.10280.json",
    "total_tokens": 931,
    "translated_title": "Crowdotic：基于Transformer的医院候诊室非语音音频与差分隐私的占用预测",
    "translated_abstract": "隐私保护的人群密度分析在各种场景中应用广泛，在提高智能建筑运营管理的同时，保持了不同空间隐私的期望。我们提出了一种基于非语音音频的人群分析方法，利用了Transformer模型。我们的结果表明，仅通过非语音音频就可以实现这种分析，而且准确性十分出色。据我们所知，这是第一次提出使用非语音音频信号来预测占用情况。截至目前，我们不知道有其他类似的方法。为了实现这一目标，我们在一家大型医院的候诊室中部署了基于传感器的平台，并获得了IRB批准，在数个月的时间里捕获了非语音音频和热像图以用于模型的训练和评估。我们提出的基于非语音的方法在性能上超过了基于热像摄像头的模型和其他所有基线方法。",
    "tldr": "本研究提出了一种基于非语音音频的人群分析方法，利用Transformer模型实现医院候诊室的占用预测，并且在准确性方面表现出色。这是首次提出使用非语音音频信号进行占用预测的方法，超过了其他基线方法。"
}