{
    "title": "PC-Adapter: Topology-Aware Adapter for Efficient Domain Adaption on Point Clouds with Rectified Pseudo-label. (arXiv:2309.16936v1 [cs.CV])",
    "abstract": "Understanding point clouds captured from the real-world is challenging due to shifts in data distribution caused by varying object scales, sensor angles, and self-occlusion. Prior works have addressed this issue by combining recent learning principles such as self-supervised learning, self-training, and adversarial training, which leads to significant computational overhead.Toward succinct yet powerful domain adaptation for point clouds, we revisit the unique challenges of point cloud data under domain shift scenarios and discover the importance of the global geometry of source data and trends of target pseudo-labels biased to the source label distribution. Motivated by our observations, we propose an adapter-guided domain adaptation method, PC-Adapter, that preserves the global shape information of the source domain using an attention-based adapter, while learning the local characteristics of the target domain via another adapter equipped with graph convolution. Additionally, we propo",
    "link": "http://arxiv.org/abs/2309.16936",
    "context": "Title: PC-Adapter: Topology-Aware Adapter for Efficient Domain Adaption on Point Clouds with Rectified Pseudo-label. (arXiv:2309.16936v1 [cs.CV])\nAbstract: Understanding point clouds captured from the real-world is challenging due to shifts in data distribution caused by varying object scales, sensor angles, and self-occlusion. Prior works have addressed this issue by combining recent learning principles such as self-supervised learning, self-training, and adversarial training, which leads to significant computational overhead.Toward succinct yet powerful domain adaptation for point clouds, we revisit the unique challenges of point cloud data under domain shift scenarios and discover the importance of the global geometry of source data and trends of target pseudo-labels biased to the source label distribution. Motivated by our observations, we propose an adapter-guided domain adaptation method, PC-Adapter, that preserves the global shape information of the source domain using an attention-based adapter, while learning the local characteristics of the target domain via another adapter equipped with graph convolution. Additionally, we propo",
    "path": "papers/23/09/2309.16936.json",
    "total_tokens": 981,
    "translated_title": "PC-Adapter: 基于拟合伪标签的点云领域自适应的拓扑感知适配器",
    "translated_abstract": "由于物体尺度，传感器角度和自遮挡引起的数据分布变化，理解从真实世界中捕获的点云具有挑战性。以往的研究通过结合自监督学习，自训练和对抗训练等最新学习原则来解决这个问题，但这导致了显著的计算开销。为了简洁而强大地对点云进行领域自适应，我们重新思考了点云数据在领域偏移场景下的独特挑战，并发现保持源领域的全局几何形状信息以及目标伪标签趋势对源标签分布有偏的重要性。在我们的观察下，我们提出了一个适配器引导的领域自适应方法PC-Adapter，通过基于注意力机制的适配器保留源领域的全局形状信息，同时通过另一个配备了图卷积的适配器学习目标领域的局部特征。此外，我们提出了一种分层扩展的伪标签矫正策略，有效减少伪标签的误类问题。",
    "tldr": "PC-Adapter是一种拓扑感知适配器，通过保留全局形状信息和学习目标领域的局部特征，实现了点云领域自适应。还提出了一种分层扩展的伪标签矫正策略，以解决伪标签的误类问题。",
    "en_tdlr": "PC-Adapter is a topology-aware adapter that achieves domain adaptation for point clouds by preserving global shape information and learning local features of the target domain. It also introduces a hierarchical expansion pseudo-label correction strategy to address misclassification issues."
}