{
    "title": "Aligning Speakers: Evaluating and Visualizing Text-based Diarization Using Efficient Multiple Sequence Alignment (Extended Version). (arXiv:2309.07677v1 [cs.CL])",
    "abstract": "This paper presents a novel evaluation approach to text-based speaker diarization (SD), tackling the limitations of traditional metrics that do not account for any contextual information in text. Two new metrics are proposed, Text-based Diarization Error Rate and Diarization F1, which perform utteranceand word-level evaluations by aligning tokens in reference and hypothesis transcripts. Our metrics encompass more types of errors compared to existing ones, allowing us to make a more comprehensive analysis in SD. To align tokens, a multiple sequence alignment algorithm is introduced that supports multiple sequences in the reference while handling high-dimensional alignment to the hypothesis using dynamic programming. Our work is packaged into two tools, align4d providing an API for our alignment algorithm and TranscribeView for visualizing and evaluating SD errors, which can greatly aid in the creation of high-quality data, fostering the advancement of dialogue systems.",
    "link": "http://arxiv.org/abs/2309.07677",
    "context": "Title: Aligning Speakers: Evaluating and Visualizing Text-based Diarization Using Efficient Multiple Sequence Alignment (Extended Version). (arXiv:2309.07677v1 [cs.CL])\nAbstract: This paper presents a novel evaluation approach to text-based speaker diarization (SD), tackling the limitations of traditional metrics that do not account for any contextual information in text. Two new metrics are proposed, Text-based Diarization Error Rate and Diarization F1, which perform utteranceand word-level evaluations by aligning tokens in reference and hypothesis transcripts. Our metrics encompass more types of errors compared to existing ones, allowing us to make a more comprehensive analysis in SD. To align tokens, a multiple sequence alignment algorithm is introduced that supports multiple sequences in the reference while handling high-dimensional alignment to the hypothesis using dynamic programming. Our work is packaged into two tools, align4d providing an API for our alignment algorithm and TranscribeView for visualizing and evaluating SD errors, which can greatly aid in the creation of high-quality data, fostering the advancement of dialogue systems.",
    "path": "papers/23/09/2309.07677.json",
    "total_tokens": 935,
    "translated_title": "对利用高效的多序列对齐评估和可视化基于文本的说话人分离进行了研究（扩展版）",
    "translated_abstract": "本文提出了一种新颖的基于文本的说话人分离（SD）评估方法，解决了传统度量方法在文本中不考虑任何上下文信息的局限性。提出了两个新的度量标准，即基于文本的说话人分离错误率和分离F1，通过对齐参考文本和假设转录中的标记来进行话语和单词级别的评估。与现有方法相比，我们的度量标准包含更多类型的错误，可以在SD中进行更全面的分析。为了对齐标记，引入了支持参考序列的多序列对齐算法，同时使用动态规划处理对假设的高维对齐。我们的工作分为两个工具，align4d提供了我们的对齐算法的API，TranscribeView用于可视化和评估SD错误，可以极大地促进高质量数据的生成，推动对话系统的进展。",
    "tldr": "本文提出了一种新的基于文本的说话人分离评估方法，并引入了多序列对齐算法。提出的度量标准克服了传统方法在文本中缺乏上下文信息的问题，并能够进行更全面的分析。该研究为对话系统的发展提供了可视化和评估工具。",
    "en_tdlr": "This paper proposes a novel evaluation approach to text-based speaker diarization, introducing a multiple sequence alignment algorithm. The proposed metrics overcome the limitations of traditional methods by considering contextual information in text and allow for a more comprehensive analysis. The research provides visualization and evaluation tools that can greatly aid the development of dialogue systems."
}