{
    "title": "Improved Auto-Encoding using Deterministic Projected Belief Networks. (arXiv:2309.07481v1 [cs.LG])",
    "abstract": "In this paper, we exploit the unique properties of a deterministic projected belief network (D-PBN) to take full advantage of trainable compound activation functions (TCAs). A D-PBN is a type of auto-encoder that operates by \"backing up\" through a feed-forward neural network. TCAs are activation functions with complex monotonic-increasing shapes that change the distribution of the data so that the linear transformation that follows is more effective. Because a D-PBN operates by \"backing up\", the TCAs are inverted in the reconstruction process, restoring the original distribution of the data, thus taking advantage of a given TCA in both analysis and reconstruction. In this paper, we show that a D-PBN auto-encoder with TCAs can significantly out-perform standard auto-encoders including variational auto-encoders.",
    "link": "http://arxiv.org/abs/2309.07481",
    "context": "Title: Improved Auto-Encoding using Deterministic Projected Belief Networks. (arXiv:2309.07481v1 [cs.LG])\nAbstract: In this paper, we exploit the unique properties of a deterministic projected belief network (D-PBN) to take full advantage of trainable compound activation functions (TCAs). A D-PBN is a type of auto-encoder that operates by \"backing up\" through a feed-forward neural network. TCAs are activation functions with complex monotonic-increasing shapes that change the distribution of the data so that the linear transformation that follows is more effective. Because a D-PBN operates by \"backing up\", the TCAs are inverted in the reconstruction process, restoring the original distribution of the data, thus taking advantage of a given TCA in both analysis and reconstruction. In this paper, we show that a D-PBN auto-encoder with TCAs can significantly out-perform standard auto-encoders including variational auto-encoders.",
    "path": "papers/23/09/2309.07481.json",
    "total_tokens": 829,
    "translated_title": "使用确定性投影置信网络提升自动编码",
    "translated_abstract": "本文利用确定性投影置信网络（D-PBN）的独特性质，充分利用可训练的复合激活函数（TCAs）。D-PBN是一种通过向后传播神经网络来运行的自动编码器。TCAs是具有复杂单调递增形状的激活函数，可以改变数据的分布，使后续的线性变换更加有效。因为D-PBN是通过向后传播运行的，所以在重建过程中，TCAs被反转，恢复数据的原始分布，从而充分利用给定的TCAs进行分析和重建。本文表明，具有TCAs的D-PBN自动编码器可以显著优于标准的自动编码器，包括变分自动编码器。",
    "tldr": "本研究中，我们利用确定性投影置信网络（D-PBN）结合可训练的复合激活函数（TCAs），对自动编码器进行了改进，实验结果表明，相比于传统自动编码器，包括变分自动编码器，具有TCAs的D-PBN自动编码器表现更好。",
    "en_tdlr": "In this research, we improved auto-encoders by using deterministic projected belief networks (D-PBN) combined with trainable compound activation functions (TCAs). Experimental results show that D-PBN auto-encoders with TCAs outperform traditional auto-encoders, including variational auto-encoders."
}