{
    "title": "Seeing Beyond the Patch: Scale-Adaptive Semantic Segmentation of High-resolution Remote Sensing Imagery based on Reinforcement Learning. (arXiv:2309.15372v1 [cs.CV])",
    "abstract": "In remote sensing imagery analysis, patch-based methods have limitations in capturing information beyond the sliding window. This shortcoming poses a significant challenge in processing complex and variable geo-objects, which results in semantic inconsistency in segmentation results. To address this challenge, we propose a dynamic scale perception framework, named GeoAgent, which adaptively captures appropriate scale context information outside the image patch based on the different geo-objects. In GeoAgent, each image patch's states are represented by a global thumbnail and a location mask. The global thumbnail provides context beyond the patch, and the location mask guides the perceived spatial relationships. The scale-selection actions are performed through a Scale Control Agent (SCA). A feature indexing module is proposed to enhance the ability of the agent to distinguish the current image patch's location. The action switches the patch scale and context branch of a dual-branch seg",
    "link": "http://arxiv.org/abs/2309.15372",
    "context": "Title: Seeing Beyond the Patch: Scale-Adaptive Semantic Segmentation of High-resolution Remote Sensing Imagery based on Reinforcement Learning. (arXiv:2309.15372v1 [cs.CV])\nAbstract: In remote sensing imagery analysis, patch-based methods have limitations in capturing information beyond the sliding window. This shortcoming poses a significant challenge in processing complex and variable geo-objects, which results in semantic inconsistency in segmentation results. To address this challenge, we propose a dynamic scale perception framework, named GeoAgent, which adaptively captures appropriate scale context information outside the image patch based on the different geo-objects. In GeoAgent, each image patch's states are represented by a global thumbnail and a location mask. The global thumbnail provides context beyond the patch, and the location mask guides the perceived spatial relationships. The scale-selection actions are performed through a Scale Control Agent (SCA). A feature indexing module is proposed to enhance the ability of the agent to distinguish the current image patch's location. The action switches the patch scale and context branch of a dual-branch seg",
    "path": "papers/23/09/2309.15372.json",
    "total_tokens": 957,
    "translated_title": "超越补丁：基于强化学习的高分辨率遥感图像的自适应语义分割",
    "translated_abstract": "在遥感图像分析中，基于补丁的方法在捕捉滑动窗口之外的信息方面存在局限性。这个缺点在处理复杂和多变的地理对象时带来了显著的挑战，导致分割结果中的语义不一致。为了解决这个挑战，我们提出了一个动态尺度感知框架GeoAgent，根据不同的地理对象自适应地捕捉图像补丁之外的适当尺度上下文信息。在GeoAgent中，每个图像补丁的状态通过全局缩略图和位置掩码来表示。全局缩略图提供了补丁之外的上下文，位置掩码指导了感知到的空间关系。尺度选择动作是通过尺度控制Agent(SCA)执行的。提出了一个特征索引模块来增强Agent区分当前图像补丁位置的能力。该动作切换了双分支分割网络的补丁尺度和上下文分支。",
    "tldr": "本文提出了一个动态尺度感知框架GeoAgent，用于解决遥感图像分析中基于补丁的方法的局限性，该框架通过自适应地捕捉图像补丁之外的适当尺度上下文信息来处理复杂和多变的地理对象，从而提高了语义分割的一致性。"
}