{
    "title": "T-SaS: Toward Shift-aware Dynamic Adaptation for Streaming Data. (arXiv:2309.02610v1 [cs.LG])",
    "abstract": "In many real-world scenarios, distribution shifts exist in the streaming data across time steps. Many complex sequential data can be effectively divided into distinct regimes that exhibit persistent dynamics. Discovering the shifted behaviors and the evolving patterns underlying the streaming data are important to understand the dynamic system. Existing methods typically train one robust model to work for the evolving data of distinct distributions or sequentially adapt the model utilizing explicitly given regime boundaries. However, there are two challenges: (1) shifts in data streams could happen drastically and abruptly without precursors. Boundaries of distribution shifts are usually unavailable, and (2) training a shared model for all domains could fail to capture varying patterns. This paper aims to solve the problem of sequential data modeling in the presence of sudden distribution shifts that occur without any precursors. Specifically, we design a Bayesian framework, dubbed as ",
    "link": "http://arxiv.org/abs/2309.02610",
    "context": "Title: T-SaS: Toward Shift-aware Dynamic Adaptation for Streaming Data. (arXiv:2309.02610v1 [cs.LG])\nAbstract: In many real-world scenarios, distribution shifts exist in the streaming data across time steps. Many complex sequential data can be effectively divided into distinct regimes that exhibit persistent dynamics. Discovering the shifted behaviors and the evolving patterns underlying the streaming data are important to understand the dynamic system. Existing methods typically train one robust model to work for the evolving data of distinct distributions or sequentially adapt the model utilizing explicitly given regime boundaries. However, there are two challenges: (1) shifts in data streams could happen drastically and abruptly without precursors. Boundaries of distribution shifts are usually unavailable, and (2) training a shared model for all domains could fail to capture varying patterns. This paper aims to solve the problem of sequential data modeling in the presence of sudden distribution shifts that occur without any precursors. Specifically, we design a Bayesian framework, dubbed as ",
    "path": "papers/23/09/2309.02610.json",
    "total_tokens": 817,
    "translated_title": "T-SaS: 面向流数据的适应性动态调整",
    "translated_abstract": "在许多现实场景中，流数据在时间步骤中存在分布转变。许多复杂的序列数据可以有效地划分为展示持续动态的不同制度。发现流数据中的转变行为和演化模式对于理解动态系统非常重要。现有方法通常训练一个鲁棒的模型来处理不同分布的演化数据，或者通过明确给定的制度边界对模型进行顺序适应。然而，存在两个挑战：（1）数据流中的转变可能会突然而急剧地发生，没有前兆。分布转变的边界通常是无法得到的，以及（2）为所有领域训练一个共享模型可能无法捕捉到变化的模式。本文旨在解决在没有任何前兆的情况下出现突然分布转变的过程数据建模问题。具体而言，我们设计了一个名为的贝叶斯框架，名为T-SaS。",
    "tldr": "本文提出了一个名为T-SaS的贝叶斯框架，用于解决在流数据中出现突然分布转变的问题。这个框架能够有效地划分不同制度并捕捉到变化的模式。"
}