{
    "title": "MVD:A Novel Methodology and Dataset for Acoustic Vehicle Type Classification. (arXiv:2309.03544v1 [cs.SD])",
    "abstract": "Rising urban populations have led to a surge in vehicle use and made traffic monitoring and management indispensable. Acoustic traffic monitoring (ATM) offers a cost-effective and efficient alternative to more computationally expensive methods of monitoring traffic such as those involving computer vision technologies. In this paper, we present MVD and MVDA: two open datasets for the development of acoustic traffic monitoring and vehicle-type classification algorithms, which contain audio recordings of moving vehicles. The dataset contain four classes- Trucks, Cars, Motorbikes, and a No-vehicle class. Additionally, we propose a novel and efficient way to accurately classify these acoustic signals using cepstrum and spectrum based local and global audio features, and a multi-input neural network. Experimental results show that our methodology improves upon the established baselines of previous works and achieves an accuracy of 91.98% and 96.66% on MVD and MVDA Datasets, respectively. Fin",
    "link": "http://arxiv.org/abs/2309.03544",
    "context": "Title: MVD:A Novel Methodology and Dataset for Acoustic Vehicle Type Classification. (arXiv:2309.03544v1 [cs.SD])\nAbstract: Rising urban populations have led to a surge in vehicle use and made traffic monitoring and management indispensable. Acoustic traffic monitoring (ATM) offers a cost-effective and efficient alternative to more computationally expensive methods of monitoring traffic such as those involving computer vision technologies. In this paper, we present MVD and MVDA: two open datasets for the development of acoustic traffic monitoring and vehicle-type classification algorithms, which contain audio recordings of moving vehicles. The dataset contain four classes- Trucks, Cars, Motorbikes, and a No-vehicle class. Additionally, we propose a novel and efficient way to accurately classify these acoustic signals using cepstrum and spectrum based local and global audio features, and a multi-input neural network. Experimental results show that our methodology improves upon the established baselines of previous works and achieves an accuracy of 91.98% and 96.66% on MVD and MVDA Datasets, respectively. Fin",
    "path": "papers/23/09/2309.03544.json",
    "total_tokens": 958,
    "translated_title": "MVD：一种用于声学车辆类型分类的新方法和数据集",
    "translated_abstract": "不断增长的城市人口导致车辆使用激增，交通监测和管理变得不可或缺。声学交通监测（ATM）提供了一种成本效益高且高效的替代方案，可以替代计算机视觉技术等计算成本更高的交通监测方法。本文介绍了MVD和MVDA两个开放数据集，用于声学交通监测和车辆类型分类算法的开发，其中包含移动车辆的音频记录。数据集包含四个类别-卡车、汽车、摩托车和无车辆类别。此外，我们提出了一种新颖且高效的方法，使用基于倒谱和频谱的局部和全局音频特征以及多输入神经网络来准确分类这些声音信号。实验结果表明，我们的方法改进了以前工作的基线，并在MVD和MVDA数据集上分别达到了91.98％和96.66％的准确率。",
    "tldr": "本研究提出了MVD和MVDA两个开放数据集，用于声学交通监测和车辆类型分类算法的开发。通过使用倒谱和频谱等特征以及多输入神经网络，我们提出了一种新颖且高效的方法来准确分类移动车辆的声音信号。实验结果表明，我们的方法在准确率上优于以前的工作。",
    "en_tdlr": "This paper presents two open datasets, MVD and MVDA, for the development of acoustic traffic monitoring and vehicle-type classification algorithms. It proposes a novel and efficient method for accurately classifying the audio signals of moving vehicles using features such as cepstrum and spectrum, as well as a multi-input neural network. Experimental results show that this method outperforms previous works in terms of accuracy."
}