{
    "title": "Diffusion Methods for Generating Transition Paths. (arXiv:2309.10276v1 [physics.comp-ph])",
    "abstract": "In this work, we seek to simulate rare transitions between metastable states using score-based generative models. An efficient method for generating high-quality transition paths is valuable for the study of molecular systems since data is often difficult to obtain. We develop two novel methods for path generation in this paper: a chain-based approach and a midpoint-based approach. The first biases the original dynamics to facilitate transitions, while the second mirrors splitting techniques and breaks down the original transition into smaller transitions. Numerical results of generated transition paths for the M\\\"uller potential and for Alanine dipeptide demonstrate the effectiveness of these approaches in both the data-rich and data-scarce regimes.",
    "link": "http://arxiv.org/abs/2309.10276",
    "context": "Title: Diffusion Methods for Generating Transition Paths. (arXiv:2309.10276v1 [physics.comp-ph])\nAbstract: In this work, we seek to simulate rare transitions between metastable states using score-based generative models. An efficient method for generating high-quality transition paths is valuable for the study of molecular systems since data is often difficult to obtain. We develop two novel methods for path generation in this paper: a chain-based approach and a midpoint-based approach. The first biases the original dynamics to facilitate transitions, while the second mirrors splitting techniques and breaks down the original transition into smaller transitions. Numerical results of generated transition paths for the M\\\"uller potential and for Alanine dipeptide demonstrate the effectiveness of these approaches in both the data-rich and data-scarce regimes.",
    "path": "papers/23/09/2309.10276.json",
    "total_tokens": 768,
    "translated_title": "生成过渡路径的扩散方法",
    "translated_abstract": "在这项工作中，我们致力于使用基于评分的生成模型模拟稀有的亚稳态之间的转变。生成高质量的转变路径的高效方法对于研究分子系统非常有价值，因为数据往往难以获取。我们在本文中开发了两种新颖的路径生成方法：基于链的方法和基于中点的方法。第一种方法通过偏置原始动力学来促进转变，而第二种方法则采用分裂技术并将原始转变分解为较小的转变。在M\\\"uller势和二肽基丙氨酸的生成转变路径的数值结果中，这些方法在数据丰富和数据稀缺的情况下都展现出了有效性。",
    "tldr": "本文提出了两种新方法来生成高质量的分子系统转变路径：一种是通过偏置原始动力学来促进转变，另一种是将原始转变分解为较小的转变。这些方法在数据丰富和数据稀缺的情况下都展现出了有效性。",
    "en_tdlr": "This paper proposes two novel methods for generating high-quality transition paths in molecular systems: one by biasing the original dynamics to facilitate transitions, and the other by breaking down the original transition into smaller transitions. These methods demonstrate effectiveness in both data-rich and data-scarce regimes."
}