{
    "title": "Imbalanced Data Stream Classification using Dynamic Ensemble Selection. (arXiv:2309.09175v2 [cs.LG] UPDATED)",
    "abstract": "Modern streaming data categorization faces significant challenges from concept drift and class imbalanced data. This negatively impacts the output of the classifier, leading to improper classification. Furthermore, other factors such as the overlapping of multiple classes limit the extent of the correctness of the output. This work proposes a novel framework for integrating data pre-processing and dynamic ensemble selection, by formulating the classification framework for the nonstationary drifting imbalanced data stream, which employs the data pre-processing and dynamic ensemble selection techniques. The proposed framework was evaluated using six artificially generated data streams with differing imbalance ratios in combination with two different types of concept drifts. Each stream is composed of 200 chunks of 500 objects described by eight features and contains five concept drifts. Seven pre-processing techniques and two dynamic ensemble selection methods were considered. According ",
    "link": "http://arxiv.org/abs/2309.09175",
    "context": "Title: Imbalanced Data Stream Classification using Dynamic Ensemble Selection. (arXiv:2309.09175v2 [cs.LG] UPDATED)\nAbstract: Modern streaming data categorization faces significant challenges from concept drift and class imbalanced data. This negatively impacts the output of the classifier, leading to improper classification. Furthermore, other factors such as the overlapping of multiple classes limit the extent of the correctness of the output. This work proposes a novel framework for integrating data pre-processing and dynamic ensemble selection, by formulating the classification framework for the nonstationary drifting imbalanced data stream, which employs the data pre-processing and dynamic ensemble selection techniques. The proposed framework was evaluated using six artificially generated data streams with differing imbalance ratios in combination with two different types of concept drifts. Each stream is composed of 200 chunks of 500 objects described by eight features and contains five concept drifts. Seven pre-processing techniques and two dynamic ensemble selection methods were considered. According ",
    "path": "papers/23/09/2309.09175.json",
    "total_tokens": 845,
    "translated_title": "通过动态集成选择进行不平衡数据流分类",
    "translated_abstract": "现代流数据分类面临着概念漂移和类别不平衡数据的重大挑战。这对分类器的输出产生了负面影响，导致分类不正确。此外，多个类别的重叠等其他因素限制了输出的正确性程度。本文提出了一个新的框架，通过对非稳态漂移的不平衡数据流进行分类框架设计，采用数据预处理和动态集成选择技术。该框架使用了六个人工生成的数据流，这些数据流具有不同的不平衡比例，并且包含两种不同类型的概念漂移。每个数据流由200个500个对象的块组成，每个对象由八个特征描述，并且包含五个概念漂移。考虑了七种预处理技术和两种动态集成选择方法进行评估。",
    "tldr": "本文提出了一个新的框架，通过对非稳态漂移的不平衡数据流进行分类框架设计，采用数据预处理和动态集成选择技术。该框架使用了六个人工生成的数据流，并且通过评估了七种预处理技术和两种动态集成选择方法的效果。",
    "en_tdlr": "This paper proposes a novel framework for classifying nonstationary drifting imbalanced data streams, which integrates data pre-processing and dynamic ensemble selection techniques. The framework is evaluated using artificially generated data streams and compares the performance of seven pre-processing techniques and two dynamic ensemble selection methods."
}