{
    "title": "Structured Radial Basis Function Network: Modelling Diversity for Multiple Hypotheses Prediction. (arXiv:2309.00781v1 [cs.LG])",
    "abstract": "Multi-modal regression is important in forecasting nonstationary processes or with a complex mixture of distributions. It can be tackled with multiple hypotheses frameworks but with the difficulty of combining them efficiently in a learning model. A Structured Radial Basis Function Network is presented as an ensemble of multiple hypotheses predictors for regression problems. The predictors are regression models of any type that can form centroidal Voronoi tessellations which are a function of their losses during training. It is proved that this structured model can efficiently interpolate this tessellation and approximate the multiple hypotheses target distribution and is equivalent to interpolating the meta-loss of the predictors, the loss being a zero set of the interpolation error. This model has a fixed-point iteration algorithm between the predictors and the centers of the basis functions. Diversity in learning can be controlled parametrically by truncating the tessellation format",
    "link": "http://arxiv.org/abs/2309.00781",
    "context": "Title: Structured Radial Basis Function Network: Modelling Diversity for Multiple Hypotheses Prediction. (arXiv:2309.00781v1 [cs.LG])\nAbstract: Multi-modal regression is important in forecasting nonstationary processes or with a complex mixture of distributions. It can be tackled with multiple hypotheses frameworks but with the difficulty of combining them efficiently in a learning model. A Structured Radial Basis Function Network is presented as an ensemble of multiple hypotheses predictors for regression problems. The predictors are regression models of any type that can form centroidal Voronoi tessellations which are a function of their losses during training. It is proved that this structured model can efficiently interpolate this tessellation and approximate the multiple hypotheses target distribution and is equivalent to interpolating the meta-loss of the predictors, the loss being a zero set of the interpolation error. This model has a fixed-point iteration algorithm between the predictors and the centers of the basis functions. Diversity in learning can be controlled parametrically by truncating the tessellation format",
    "path": "papers/23/09/2309.00781.json",
    "total_tokens": 857,
    "translated_title": "结构化径向基函数网络：用于多假设预测的多样性建模",
    "translated_abstract": "多模态回归对于预测非平稳过程或具有复杂分布的问题非常重要。可以通过多假设框架来处理，但在学习模型中有效地组合它们是有困难的。本文提出了一种结构化径向基函数网络，作为多假设预测器的集合，用于回归问题。这些预测器是任何类型的回归模型，可以形成以它们在训练过程中的损失为函数的重心维诺图分割。证明了这个结构化模型能够有效地插值这个分割，并且逼近多个假设目标分布，并且等价于插值预测器的元损失，损失是插值误差的零集。该模型在预测器和基函数中心之间具有固定点迭代算法。可以通过截断分割格式来参数化地控制学习中的多样性。",
    "tldr": "这篇论文提出了一种结构化径向基函数网络，用于解决多模态回归问题。该网络能够有效地组合多个假设预测器，并通过插值逼近多个假设目标分布，具有较好的性能。",
    "en_tdlr": "This paper presents a structured radial basis function network for addressing multi-modal regression problems. The network efficiently combines multiple hypothesis predictors and approximates the target distribution of the hypotheses through interpolation, achieving good performance."
}