{
    "title": "One ACT Play: Single Demonstration Behavior Cloning with Action Chunking Transformers. (arXiv:2309.10175v1 [cs.RO])",
    "abstract": "Learning from human demonstrations (behavior cloning) is a cornerstone of robot learning. However, most behavior cloning algorithms require a large number of demonstrations to learn a task, especially for general tasks that have a large variety of initial conditions. Humans, however, can learn to complete tasks, even complex ones, after only seeing one or two demonstrations. Our work seeks to emulate this ability, using behavior cloning to learn a task given only a single human demonstration. We achieve this goal by using linear transforms to augment the single demonstration, generating a set of trajectories for a wide range of initial conditions. With these demonstrations, we are able to train a behavior cloning agent to successfully complete three block manipulation tasks. Additionally, we developed a novel addition to the temporal ensembling method used by action chunking agents during inference. By incorporating the standard deviation of the action predictions into the ensembling m",
    "link": "http://arxiv.org/abs/2309.10175",
    "context": "Title: One ACT Play: Single Demonstration Behavior Cloning with Action Chunking Transformers. (arXiv:2309.10175v1 [cs.RO])\nAbstract: Learning from human demonstrations (behavior cloning) is a cornerstone of robot learning. However, most behavior cloning algorithms require a large number of demonstrations to learn a task, especially for general tasks that have a large variety of initial conditions. Humans, however, can learn to complete tasks, even complex ones, after only seeing one or two demonstrations. Our work seeks to emulate this ability, using behavior cloning to learn a task given only a single human demonstration. We achieve this goal by using linear transforms to augment the single demonstration, generating a set of trajectories for a wide range of initial conditions. With these demonstrations, we are able to train a behavior cloning agent to successfully complete three block manipulation tasks. Additionally, we developed a novel addition to the temporal ensembling method used by action chunking agents during inference. By incorporating the standard deviation of the action predictions into the ensembling m",
    "path": "papers/23/09/2309.10175.json",
    "total_tokens": 882,
    "translated_title": "一次性演示行为克隆与动作分块转换的一人剧本",
    "translated_abstract": "从人类示范中学习（行为克隆）是机器人学习的基石。然而，大多数行为克隆算法需要大量示范来学习一个任务，尤其是对于具有多样化初始条件的一般任务。然而，人类只需看到一两个示范就能学会完成任务，即使是复杂的任务。我们的工作旨在模拟这种能力，仅凭一次人类演示就使用行为克隆学习一个任务。我们通过使用线性变换来增强单个演示，生成一系列适用于各种初始条件的轨迹，实现了这个目标。通过这些示范，我们能够训练一个行为克隆代理成功完成三个块操作任务。此外，在推理过程中，我们还开发了一种新的暂存方法，用于动作块代理的行动预测中综合标准差。",
    "tldr": "本研究提出了一种通过行为克隆学习任务的方法，只需要一次人类演示，并使用线性变换生成多样化的轨迹，成功完成了三个块操作任务。此外，还提出了一种新的暂存方法，用于动作块代理的行动预测。",
    "en_tdlr": "This research presents a method for learning tasks through behavior cloning, requiring only one human demonstration and using linear transforms to generate diverse trajectories, successfully completing three block manipulation tasks. Additionally, a novel ensembling method is proposed for action chunking agents' action predictions."
}