{
    "title": "Prototype of a robotic system to assist the learning process of English language with text-generation through DNN. (arXiv:2309.11142v1 [cs.CL])",
    "abstract": "In the last ongoing years, there has been a significant ascending on the field of Natural Language Processing (NLP) for performing multiple tasks including English Language Teaching (ELT). An effective strategy to favor the learning process uses interactive devices to engage learners in their self-learning process. In this work, we present a working prototype of a humanoid robotic system to assist English language self-learners through text generation using Long Short Term Memory (LSTM) Neural Networks. The learners interact with the system using a Graphic User Interface that generates text according to the English level of the user. The experimentation was conducted using English learners and the results were measured accordingly to International English Language Testing System (IELTS) rubric. Preliminary results show an increment in the Grammatical Range of learners who interacted with the system.",
    "link": "http://arxiv.org/abs/2309.11142",
    "context": "Title: Prototype of a robotic system to assist the learning process of English language with text-generation through DNN. (arXiv:2309.11142v1 [cs.CL])\nAbstract: In the last ongoing years, there has been a significant ascending on the field of Natural Language Processing (NLP) for performing multiple tasks including English Language Teaching (ELT). An effective strategy to favor the learning process uses interactive devices to engage learners in their self-learning process. In this work, we present a working prototype of a humanoid robotic system to assist English language self-learners through text generation using Long Short Term Memory (LSTM) Neural Networks. The learners interact with the system using a Graphic User Interface that generates text according to the English level of the user. The experimentation was conducted using English learners and the results were measured accordingly to International English Language Testing System (IELTS) rubric. Preliminary results show an increment in the Grammatical Range of learners who interacted with the system.",
    "path": "papers/23/09/2309.11142.json",
    "total_tokens": 797,
    "translated_title": "一种用DNN通过文本生成辅助英语学习过程的机器人系统的原型",
    "translated_abstract": "在过去的几年中，自然语言处理（NLP）领域取得了显著的进展，包括英语教学。一种有效的策略是使用交互式设备来吸引学习者参与自主学习过程。本文介绍了一个工作原型，即通过使用长短时记忆（LSTM）神经网络生成文本来帮助学习英语的人。学习者通过图形用户界面与系统进行交互，该界面根据用户的英语水平生成文本。实验使用英语学习者进行，并根据国际英语语言测试系统（IELTS）评分标准进行测量。初步结果显示使用该系统的学习者的语法范围有所增加。",
    "tldr": "本文介绍了一个利用长短时记忆神经网络生成文本的机器人系统原型，可用于辅助英语学习者。实验结果表明与该系统交互的学习者的语法范围有所提升。",
    "en_tdlr": "This paper presents a prototype of a robotic system that uses Long Short Term Memory (LSTM) neural networks for text generation to assist English language learners, with preliminary results showing an improvement in the learners' grammatical range."
}