{
    "title": "Circle Feature Graphormer: Can Circle Features Stimulate Graph Transformer?. (arXiv:2309.06574v1 [cs.SI])",
    "abstract": "In this paper, we introduce two local graph features for missing link prediction tasks on ogbl-citation2. We define the features as Circle Features, which are borrowed from the concept of circle of friends. We propose the detailed computing formulas for the above features. Firstly, we define the first circle feature as modified swing for common graph, which comes from bipartite graph. Secondly, we define the second circle feature as bridge, which indicates the importance of two nodes for different circle of friends. In addition, we firstly propose the above features as bias to enhance graph transformer neural network, such that graph self-attention mechanism can be improved. We implement a Circled Feature aware Graph transformer (CFG) model based on SIEG network, which utilizes a double tower structure to capture both global and local structure features. Experimental results show that CFG achieves the state-of-the-art performance on dataset ogbl-citation2.",
    "link": "http://arxiv.org/abs/2309.06574",
    "context": "Title: Circle Feature Graphormer: Can Circle Features Stimulate Graph Transformer?. (arXiv:2309.06574v1 [cs.SI])\nAbstract: In this paper, we introduce two local graph features for missing link prediction tasks on ogbl-citation2. We define the features as Circle Features, which are borrowed from the concept of circle of friends. We propose the detailed computing formulas for the above features. Firstly, we define the first circle feature as modified swing for common graph, which comes from bipartite graph. Secondly, we define the second circle feature as bridge, which indicates the importance of two nodes for different circle of friends. In addition, we firstly propose the above features as bias to enhance graph transformer neural network, such that graph self-attention mechanism can be improved. We implement a Circled Feature aware Graph transformer (CFG) model based on SIEG network, which utilizes a double tower structure to capture both global and local structure features. Experimental results show that CFG achieves the state-of-the-art performance on dataset ogbl-citation2.",
    "path": "papers/23/09/2309.06574.json",
    "total_tokens": 887,
    "translated_title": "Circle Feature Graphormer: 能够刺激图转换器的圆形特征吗？",
    "translated_abstract": "在本文中，我们介绍了两种用于ogbl-citation2中丢失链路预测任务的本地图特征。我们将这些特征定义为圆形特征，借鉴了朋友圈的概念。我们提出了上述特征的详细计算公式。首先，我们将第一个圆形特征定义为常见图中的改进振荡特征，它来自于二分图。其次，我们将第二个圆形特征定义为桥梁，它表示不同朋友圈中两个节点的重要性。此外，我们首次将上述特征作为偏置来增强图转换器神经网络，从而改进了图自注意机制。我们基于SIEG网络实现了一个基于圆形特征的图转换器（CFG）模型，它利用双塔结构来捕捉全局和局部结构特征。实验结果表明，CFG在ogbl-citation2数据集上达到了最先进的性能。",
    "tldr": "本文介绍了一种新的圆形特征图转换器（CFG），用于丢失链路预测任务，并实现了改进的图自注意机制。实验结果表明，CFG在ogbl-citation2数据集上取得了最先进的性能。",
    "en_tdlr": "This paper introduces a new Circle Feature Graphormer (CFG) for missing link prediction tasks and implements an improved graph self-attention mechanism. Experimental results show that CFG achieves state-of-the-art performance on the ogbl-citation2 dataset."
}