{
    "title": "A Semi-Supervised Approach for Power System Event Identification. (arXiv:2309.10095v1 [cs.LG])",
    "abstract": "Event identification is increasingly recognized as crucial for enhancing the reliability, security, and stability of the electric power system. With the growing deployment of Phasor Measurement Units (PMUs) and advancements in data science, there are promising opportunities to explore data-driven event identification via machine learning classification techniques. However, obtaining accurately-labeled eventful PMU data samples remains challenging due to its labor-intensive nature and uncertainty about the event type (class) in real-time. Thus, it is natural to use semi-supervised learning techniques, which make use of both labeled and unlabeled samples. %We propose a novel semi-supervised framework to assess the effectiveness of incorporating unlabeled eventful samples to enhance existing event identification methodologies. We evaluate three categories of classical semi-supervised approaches: (i) self-training, (ii) transductive support vector machines (TSVM), and (iii) graph-based lab",
    "link": "http://arxiv.org/abs/2309.10095",
    "context": "Title: A Semi-Supervised Approach for Power System Event Identification. (arXiv:2309.10095v1 [cs.LG])\nAbstract: Event identification is increasingly recognized as crucial for enhancing the reliability, security, and stability of the electric power system. With the growing deployment of Phasor Measurement Units (PMUs) and advancements in data science, there are promising opportunities to explore data-driven event identification via machine learning classification techniques. However, obtaining accurately-labeled eventful PMU data samples remains challenging due to its labor-intensive nature and uncertainty about the event type (class) in real-time. Thus, it is natural to use semi-supervised learning techniques, which make use of both labeled and unlabeled samples. %We propose a novel semi-supervised framework to assess the effectiveness of incorporating unlabeled eventful samples to enhance existing event identification methodologies. We evaluate three categories of classical semi-supervised approaches: (i) self-training, (ii) transductive support vector machines (TSVM), and (iii) graph-based lab",
    "path": "papers/23/09/2309.10095.json",
    "total_tokens": 713,
    "translated_title": "一种用于电力系统事件识别的半监督方法",
    "translated_abstract": "事件识别被越来越认识到对于提高电力系统的可靠性、安全性和稳定性至关重要。随着相量测量装置的日益普及和数据科学的进步，通过机器学习分类技术探索基于数据驱动的事件识别具有很大的潜力。然而，由于工作量大和实时事件类型（类）的不确定性，获取精确标注的事件数据样本仍然具有挑战性。因此，使用半监督学习技术（同时使用有标签和无标签样本）是很自然的选择。",
    "tldr": "提出了一种新颖的半监督框架，通过加入无标签的事件样本来评估提升现有事件识别方法的有效性。",
    "en_tdlr": "A novel semi-supervised framework is proposed to assess the effectiveness of incorporating unlabeled event samples in enhancing existing event identification methods."
}