{
    "title": "Exploring the Potential of Large Language Models to Generate Formative Programming Feedback. (arXiv:2309.00029v1 [cs.AI])",
    "abstract": "Ever since the emergence of large language models (LLMs) and related applications, such as ChatGPT, its performance and error analysis for programming tasks have been subject to research. In this work-in-progress paper, we explore the potential of such LLMs for computing educators and learners, as we analyze the feedback it generates to a given input containing program code. In particular, we aim at (1) exploring how an LLM like ChatGPT responds to students seeking help with their introductory programming tasks, and (2) identifying feedback types in its responses. To achieve these goals, we used students' programming sequences from a dataset gathered within a CS1 course as input for ChatGPT along with questions required to elicit feedback and correct solutions. The results show that ChatGPT performs reasonably well for some of the introductory programming tasks and student errors, which means that students can potentially benefit. However, educators should provide guidance on how to us",
    "link": "http://arxiv.org/abs/2309.00029",
    "context": "Title: Exploring the Potential of Large Language Models to Generate Formative Programming Feedback. (arXiv:2309.00029v1 [cs.AI])\nAbstract: Ever since the emergence of large language models (LLMs) and related applications, such as ChatGPT, its performance and error analysis for programming tasks have been subject to research. In this work-in-progress paper, we explore the potential of such LLMs for computing educators and learners, as we analyze the feedback it generates to a given input containing program code. In particular, we aim at (1) exploring how an LLM like ChatGPT responds to students seeking help with their introductory programming tasks, and (2) identifying feedback types in its responses. To achieve these goals, we used students' programming sequences from a dataset gathered within a CS1 course as input for ChatGPT along with questions required to elicit feedback and correct solutions. The results show that ChatGPT performs reasonably well for some of the introductory programming tasks and student errors, which means that students can potentially benefit. However, educators should provide guidance on how to us",
    "path": "papers/23/09/2309.00029.json",
    "total_tokens": 888,
    "translated_title": "探索大型语言模型在生成编程反馈方面的潜力",
    "translated_abstract": "自从大型语言模型（LLM）和相关应用如ChatGPT出现以来，其在编程任务中的性能和错误分析一直是研究的对象。本文中，我们研究了这样的LLM对计算机教育工作者和学习者的潜力，分析其对包含程序代码的输入所生成的反馈。特别地，我们旨在（1）探索像ChatGPT这样的LLM对寻求帮助于入门级编程任务的学生的回应，以及（2）识别其回应中的反馈类型。为了实现这些目标，我们使用了从一个CS1课程中收集的学生编程序列作为ChatGPT的输入，并提出了问题以引导反馈和正确的解决方案。结果显示，ChatGPT在某些入门级编程任务和学生错误方面表现得相当不错，这意味着学生有可能从中受益。然而，教育者应该提供如何使用这些模型的指导。",
    "tldr": "本文探索了大型语言模型（LLM）在计算机教育方面的潜力，研究了其在编程任务中生成的反馈，结果表明学生可以从中受益，但教育者应该提供使用指导。",
    "en_tdlr": "This paper explores the potential of large language models (LLMs) in computer education, analyzing their feedback for programming tasks. The results show that students can benefit from it, but educators should provide guidance on usage."
}