{
    "title": "Large language models in medicine: the potentials and pitfalls. (arXiv:2309.00087v1 [cs.CL])",
    "abstract": "Large language models (LLMs) have been applied to tasks in healthcare, ranging from medical exam questions to responding to patient questions. With increasing institutional partnerships between companies producing LLMs and healthcare systems, real world clinical application is coming closer to reality. As these models gain traction, it is essential for healthcare practitioners to understand what LLMs are, their development, their current and potential applications, and the associated pitfalls when utilized in medicine. This review and accompanying tutorial aim to give an overview of these topics to aid healthcare practitioners in understanding the rapidly changing landscape of LLMs as applied to medicine.",
    "link": "http://arxiv.org/abs/2309.00087",
    "context": "Title: Large language models in medicine: the potentials and pitfalls. (arXiv:2309.00087v1 [cs.CL])\nAbstract: Large language models (LLMs) have been applied to tasks in healthcare, ranging from medical exam questions to responding to patient questions. With increasing institutional partnerships between companies producing LLMs and healthcare systems, real world clinical application is coming closer to reality. As these models gain traction, it is essential for healthcare practitioners to understand what LLMs are, their development, their current and potential applications, and the associated pitfalls when utilized in medicine. This review and accompanying tutorial aim to give an overview of these topics to aid healthcare practitioners in understanding the rapidly changing landscape of LLMs as applied to medicine.",
    "path": "papers/23/09/2309.00087.json",
    "total_tokens": 809,
    "translated_title": "医学中的大语言模型：潜力与风险",
    "translated_abstract": "大规模语言模型（LLMs）已经被应用于医疗中的各种任务，从医学考试问题到回答患者问题。随着生产LLMs的公司与医疗系统之间的机构合作增加，真实世界的临床应用正逐渐成为现实。随着这些模型的推广，医疗从业者了解LLMs是什么，它们的发展以及在医学中的当前和潜在应用，以及在使用LLMs时可能出现的问题至关重要。本综述和配套教程旨在为医疗从业者提供关于这些主题的概述，以帮助他们理解LLMs在医学中应用的快速变化的情况。",
    "tldr": "医学中大规模语言模型（LLMs）的潜力和风险。LLMs已经被广泛应用于医疗任务，但在使用时存在潜在的问题。本文回顾了LLMs的发展、应用和可能的限制，以帮助医疗从业者理解和应对LLMs在医学中的挑战。",
    "en_tdlr": "The potential and pitfalls of large language models (LLMs) in medicine. LLMs have been widely applied in healthcare tasks, but there are potential issues associated with their use. This review provides an overview of the development, applications, and potential limitations of LLMs to help healthcare practitioners understand and address the challenges of using LLMs in medicine."
}