{
    "title": "A detection analysis for temporal memory patterns at different time-scales. (arXiv:2309.12034v1 [econ.EM])",
    "abstract": "This paper introduces a novel methodology that utilizes latency to unveil time-series dependence patterns. A customized statistical test detects memory dependence in event sequences by analyzing their inter-event time distributions. Synthetic experiments based on the renewal-aging property assess the impact of observer latency on the renewal property. Our test uncovers memory patterns across diverse time scales, emphasizing the event sequence's probability structure beyond correlations. The time series analysis produces a statistical test and graphical plots which helps to detect dependence patterns among events at different time-scales if any. Furthermore, the test evaluates the renewal assumption through aging experiments, offering valuable applications in time-series analysis within economics.",
    "link": "http://arxiv.org/abs/2309.12034",
    "context": "Title: A detection analysis for temporal memory patterns at different time-scales. (arXiv:2309.12034v1 [econ.EM])\nAbstract: This paper introduces a novel methodology that utilizes latency to unveil time-series dependence patterns. A customized statistical test detects memory dependence in event sequences by analyzing their inter-event time distributions. Synthetic experiments based on the renewal-aging property assess the impact of observer latency on the renewal property. Our test uncovers memory patterns across diverse time scales, emphasizing the event sequence's probability structure beyond correlations. The time series analysis produces a statistical test and graphical plots which helps to detect dependence patterns among events at different time-scales if any. Furthermore, the test evaluates the renewal assumption through aging experiments, offering valuable applications in time-series analysis within economics.",
    "path": "papers/23/09/2309.12034.json",
    "total_tokens": 777,
    "translated_title": "在不同时间尺度上检测时间记忆模式的检测分析",
    "translated_abstract": "本论文介绍了一种新颖的方法，利用延迟来揭示时间序列的依赖模式。通过分析事件序列的事件间隔分布，定制的统计检验可以检测到事件序列之间的记忆依赖关系。基于更新-老化性质的合成实验评估了观察者延迟对更新性质的影响。我们的检测方法可以发现跨多个时间尺度的记忆模式，强调了事件序列的概率结构超出了相关性。时间序列分析生成了统计检验和图形绘制，有助于检测不同时间尺度上事件之间的依赖模式。此外，该检验通过老化实验评估了更新假设，为经济学中的时间序列分析提供了有价值的应用。",
    "tldr": "本论文介绍了一种新颖的方法，通过分析事件序列的事件间隔分布，以揭示时间序列的依赖模式。该方法可以发现跨多个时间尺度的记忆模式，并提供了有价值的应用于经济学中的时间序列分析。"
}