{
    "title": "Beyond Traditional Teaching: The Potential of Large Language Models and Chatbots in Graduate Engineering Education. (arXiv:2309.13059v1 [cs.CY])",
    "abstract": "In the rapidly evolving landscape of education, digital technologies have repeatedly disrupted traditional pedagogical methods. This paper explores the latest of these disruptions: the potential integration of large language models (LLMs) and chatbots into graduate engineering education. We begin by tracing historical and technological disruptions to provide context and then introduce key terms such as machine learning and deep learning and the underlying mechanisms of recent advancements, namely attention/transformer models and graphics processing units. The heart of our investigation lies in the application of an LLM-based chatbot in a graduate fluid mechanics course. We developed a question bank from the course material and assessed the chatbot's ability to provide accurate, insightful responses. The results are encouraging, demonstrating not only the bot's ability to effectively answer complex questions but also the potential advantages of chatbot usage in the classroom, such as th",
    "link": "http://arxiv.org/abs/2309.13059",
    "context": "Title: Beyond Traditional Teaching: The Potential of Large Language Models and Chatbots in Graduate Engineering Education. (arXiv:2309.13059v1 [cs.CY])\nAbstract: In the rapidly evolving landscape of education, digital technologies have repeatedly disrupted traditional pedagogical methods. This paper explores the latest of these disruptions: the potential integration of large language models (LLMs) and chatbots into graduate engineering education. We begin by tracing historical and technological disruptions to provide context and then introduce key terms such as machine learning and deep learning and the underlying mechanisms of recent advancements, namely attention/transformer models and graphics processing units. The heart of our investigation lies in the application of an LLM-based chatbot in a graduate fluid mechanics course. We developed a question bank from the course material and assessed the chatbot's ability to provide accurate, insightful responses. The results are encouraging, demonstrating not only the bot's ability to effectively answer complex questions but also the potential advantages of chatbot usage in the classroom, such as th",
    "path": "papers/23/09/2309.13059.json",
    "total_tokens": 905,
    "translated_title": "超越传统教学：大型语言模型和聊天机器人在研究生工程教育中的潜力",
    "translated_abstract": "在教育领域快速发展的环境中，数字技术一再打破传统教学方法。本文探讨了最新的这些颠覆：大型语言模型（LLMs）和聊天机器人在研究生工程教育中的潜力融合。我们首先追溯历史和技术的颠覆，以提供背景，然后介绍关键术语，如机器学习和深度学习，以及最近进展的基本机制，即注意力/变压器模型和图形处理单元。我们研究的核心是将基于LLM的聊天机器人应用于研究生流体力学课程。我们从课程材料中构建了一个问题库，并评估了聊天机器人提供准确、有见地的回答的能力。结果令人鼓舞，不仅展示了机器人回答复杂问题的能力，还展示了课堂上使用聊天机器人的潜在优势，例如…",
    "tldr": "大型语言模型和聊天机器人在研究生工程教育中有着巨大的潜力，研究发现它们能够准确回答复杂问题，并在课堂上带来潜在的优势。"
}