{
    "title": "Online Active Learning For Sound Event Detection. (arXiv:2309.14460v1 [eess.AS])",
    "abstract": "Data collection and annotation is a laborious, time-consuming prerequisite for supervised machine learning tasks. Online Active Learning (OAL) is a paradigm that addresses this issue by simultaneously minimizing the amount of annotation required to train a classifier and adapting to changes in the data over the duration of the data collection process. Prior work has indicated that fluctuating class distributions and data drift are still common problems for OAL. This work presents new loss functions that address these challenges when OAL is applied to Sound Event Detection (SED). Experimental results from the SONYC dataset and two Voice-Type Discrimination (VTD) corpora indicate that OAL can reduce the time and effort required to train SED classifiers by a factor of 5 for SONYC, and that the new methods presented here successfully resolve issues present in existing OAL methods.",
    "link": "http://arxiv.org/abs/2309.14460",
    "context": "Title: Online Active Learning For Sound Event Detection. (arXiv:2309.14460v1 [eess.AS])\nAbstract: Data collection and annotation is a laborious, time-consuming prerequisite for supervised machine learning tasks. Online Active Learning (OAL) is a paradigm that addresses this issue by simultaneously minimizing the amount of annotation required to train a classifier and adapting to changes in the data over the duration of the data collection process. Prior work has indicated that fluctuating class distributions and data drift are still common problems for OAL. This work presents new loss functions that address these challenges when OAL is applied to Sound Event Detection (SED). Experimental results from the SONYC dataset and two Voice-Type Discrimination (VTD) corpora indicate that OAL can reduce the time and effort required to train SED classifiers by a factor of 5 for SONYC, and that the new methods presented here successfully resolve issues present in existing OAL methods.",
    "path": "papers/23/09/2309.14460.json",
    "total_tokens": 805,
    "translated_title": "在线主动学习声音事件检测",
    "translated_abstract": "数据收集和标注是监督机器学习任务的繁琐、耗时的前提条件。在线主动学习（OAL）是一种同时减少训练分类器所需的标注量并适应数据变化的范例。先前的研究表明，波动的类别分布和数据漂移仍然是OAL的常见问题。本文提出了新的损失函数，用于解决当OAL应用于声音事件检测时面临的挑战。SONYC数据集和两个语音类型识别（VTD）语料库的实验结果表明，OAL可以将训练声音事件检测分类器所需的时间和工作量减少5倍，并且本文介绍的新方法成功解决了现有OAL方法中存在的问题。",
    "tldr": "通过提出新的损失函数，该论文解决了在线主动学习在声音事件检测中面临的类别分布波动和数据漂移问题，并在实验中证明该方法能够将训练分类器所需的时间和工作量减少5倍。"
}