{
    "title": "Symmetric Bernoulli distributions and minimal dependence copulas. (arXiv:2309.17346v1 [math.ST])",
    "abstract": "The key result of this paper is to find all the joint distributions of random vectors whose sums $S=X_1+\\ldots+X_d$ are minimal in convex order in the class of symmetric Bernoulli distributions. The minimal convex sums distributions are known to be strongly negatively dependent. Beyond their interest per se, these results enable us to explore negative dependence within the class of copulas. In fact, there are two classes of copulas that can be built from multivariate symmetric Bernoulli distributions: the extremal mixture copulas, and the FGM copulas. We study the extremal negative dependence structure of the copulas corresponding to symmetric Bernoulli vectors with minimal convex sums and we explicitly find a class of minimal dependence copulas. Our main results stem from the geometric and algebraic representations of multivariate symmetric Bernoulli distributions, which effectively encode several of their statistical properties.",
    "link": "http://arxiv.org/abs/2309.17346",
    "context": "Title: Symmetric Bernoulli distributions and minimal dependence copulas. (arXiv:2309.17346v1 [math.ST])\nAbstract: The key result of this paper is to find all the joint distributions of random vectors whose sums $S=X_1+\\ldots+X_d$ are minimal in convex order in the class of symmetric Bernoulli distributions. The minimal convex sums distributions are known to be strongly negatively dependent. Beyond their interest per se, these results enable us to explore negative dependence within the class of copulas. In fact, there are two classes of copulas that can be built from multivariate symmetric Bernoulli distributions: the extremal mixture copulas, and the FGM copulas. We study the extremal negative dependence structure of the copulas corresponding to symmetric Bernoulli vectors with minimal convex sums and we explicitly find a class of minimal dependence copulas. Our main results stem from the geometric and algebraic representations of multivariate symmetric Bernoulli distributions, which effectively encode several of their statistical properties.",
    "path": "papers/23/09/2309.17346.json",
    "total_tokens": 843,
    "translated_title": "对称伯努利分布和最小相关性联合概率密度函数",
    "translated_abstract": "本文的主要结果是找到满足凸序最小要求的随机向量的所有联合分布。这些最小凸序和分布已知具有强负相关性。除了其本身的兴趣，这些结果还使我们能够在联合概率密度函数的类别中研究负相关性。实际上，可以从多元对称伯努利分布构建两类联合概率密度函数：极值混合联合概率密度函数和FGM联合概率密度函数。我们研究了与最小凸和伯努利向量对应的联合概率密度函数的极值负相关性结构，并明确找到了一类最小相关性联合概率密度函数。这些主要结果来自于多元对称伯努利分布的几何和代数表示，它们有效地编码了它们的多个统计特性。",
    "tldr": "本文研究了满足凸序最小要求的随机向量的联合分布，发现了它们的强负相关性；并在研究中发现了一类最小相关性联合概率密度函数。",
    "en_tdlr": "This paper investigates the joint distributions of random vectors that satisfy the minimal convex order requirement and finds their strong negative dependence. It also identifies a class of minimal dependence copulas corresponding to symmetric Bernoulli vectors with minimal convex sums."
}