{
    "title": "Asteroids co-orbital motion classification based on Machine Learning. (arXiv:2309.10603v1 [astro-ph.EP])",
    "abstract": "In this work, we explore how to classify asteroids in co-orbital motion with a given planet using Machine Learning. We consider four different kinds of motion in mean motion resonance with the planet, nominally Tadpole, Horseshoe and Quasi-satellite, building 3 datasets defined as Real (taking the ephemerides of real asteroids from the JPL Horizons system), Ideal and Perturbed (both simulated, obtained by propagating initial conditions considering two different dynamical systems) for training and testing the Machine Learning algorithms in different conditions.  The time series of the variable theta (angle related to the resonance) are studied with a data analysis pipeline defined ad hoc for the problem and composed by: data creation and annotation, time series features extraction thanks to the tsfresh package (potentially followed by selection and standardization) and the application of Machine Learning algorithms for Dimensionality Reduction and Classification. Such approach, based on",
    "link": "http://arxiv.org/abs/2309.10603",
    "context": "Title: Asteroids co-orbital motion classification based on Machine Learning. (arXiv:2309.10603v1 [astro-ph.EP])\nAbstract: In this work, we explore how to classify asteroids in co-orbital motion with a given planet using Machine Learning. We consider four different kinds of motion in mean motion resonance with the planet, nominally Tadpole, Horseshoe and Quasi-satellite, building 3 datasets defined as Real (taking the ephemerides of real asteroids from the JPL Horizons system), Ideal and Perturbed (both simulated, obtained by propagating initial conditions considering two different dynamical systems) for training and testing the Machine Learning algorithms in different conditions.  The time series of the variable theta (angle related to the resonance) are studied with a data analysis pipeline defined ad hoc for the problem and composed by: data creation and annotation, time series features extraction thanks to the tsfresh package (potentially followed by selection and standardization) and the application of Machine Learning algorithms for Dimensionality Reduction and Classification. Such approach, based on",
    "path": "papers/23/09/2309.10603.json",
    "total_tokens": 937,
    "translated_title": "基于机器学习的共轨道运动的小行星分类",
    "translated_abstract": "本研究探讨了如何使用机器学习对具有给定行星的共轨道运动的小行星进行分类。我们考虑了与行星的平均运动共振有四种不同类型的运动，分别是Tadpole（蝌蚪型），Horseshoe（马蹄型）和Quasi-satellite（准卫星型），并构建了三个数据集，分别为真实数据集（采用JPL Horizons系统中的真实小行星星历）、理想数据集和扰动数据集（均为通过传播考虑不同动力系统的初始条件得到的模拟数据），用于在不同条件下训练和测试机器学习算法。我们使用自定义的数据分析流程对与共振相关的角度变量theta的时间序列进行研究，该流程由数据创建和注释、基于tsfresh包的时间序列特征提取（可能包括选择和标准化）以及应用机器学习算法进行降维和分类组成。这种基于机器学习的方法可以有效分类小行星的共轨道运动。",
    "tldr": "本研究基于机器学习，探索了如何对具有给定行星的共轨道运动的小行星进行分类，通过研究与共振相关的角度变量的时间序列，利用自定义的数据分析流程和机器学习算法实现了对小行星共轨道运动的有效分类。",
    "en_tdlr": "This study explores the classification of asteroids in co-orbital motion with a given planet using machine learning, achieving effective classification by studying the time series of the angle variable related to resonance and applying a custom data analysis process and machine learning algorithms."
}