{
    "title": "PolicyGPT: Automated Analysis of Privacy Policies with Large Language Models. (arXiv:2309.10238v1 [cs.CL])",
    "abstract": "Privacy policies serve as the primary conduit through which online service providers inform users about their data collection and usage procedures. However, in a bid to be comprehensive and mitigate legal risks, these policy documents are often quite verbose. In practical use, users tend to click the Agree button directly rather than reading them carefully. This practice exposes users to risks of privacy leakage and legal issues. Recently, the advent of Large Language Models (LLM) such as ChatGPT and GPT-4 has opened new possibilities for text analysis, especially for lengthy documents like privacy policies. In this study, we investigate a privacy policy text analysis framework PolicyGPT based on the LLM. This framework was tested using two datasets. The first dataset comprises of privacy policies from 115 websites, which were meticulously annotated by legal experts, categorizing each segment into one of 10 classes. The second dataset consists of privacy policies from 304 popular mobil",
    "link": "http://arxiv.org/abs/2309.10238",
    "context": "Title: PolicyGPT: Automated Analysis of Privacy Policies with Large Language Models. (arXiv:2309.10238v1 [cs.CL])\nAbstract: Privacy policies serve as the primary conduit through which online service providers inform users about their data collection and usage procedures. However, in a bid to be comprehensive and mitigate legal risks, these policy documents are often quite verbose. In practical use, users tend to click the Agree button directly rather than reading them carefully. This practice exposes users to risks of privacy leakage and legal issues. Recently, the advent of Large Language Models (LLM) such as ChatGPT and GPT-4 has opened new possibilities for text analysis, especially for lengthy documents like privacy policies. In this study, we investigate a privacy policy text analysis framework PolicyGPT based on the LLM. This framework was tested using two datasets. The first dataset comprises of privacy policies from 115 websites, which were meticulously annotated by legal experts, categorizing each segment into one of 10 classes. The second dataset consists of privacy policies from 304 popular mobil",
    "path": "papers/23/09/2309.10238.json",
    "total_tokens": 887,
    "translated_title": "PolicyGPT: 自动化分析使用大语言模型的隐私政策",
    "translated_abstract": "隐私政策是在线服务提供商向用户通知其数据收集和使用程序的主要途径。然而，为了全面和减轻法律风险，这些政策文件通常很冗长。在实际使用中，用户往往直接点击同意按钮而不是仔细阅读。这种做法使用户面临隐私泄露和法律问题的风险。最近，像ChatGPT和GPT-4这样的大型语言模型（LLM）的出现为文本分析，特别是对于像隐私政策这样的长篇文档，提供了新的可能性。在本研究中，我们基于LLM研究了一个名为PolicyGPT的隐私政策文本分析框架。该框架使用了两个数据集进行测试。第一个数据集包括了115个网站的隐私政策，由法律专家精心注释，将每个段落分类为10个类别之一。第二个数据集包括了304个热门手机应用的隐私政策。",
    "tldr": "PolicyGPT是一个使用大语言模型进行自动分析隐私政策的框架，能够解决隐私政策冗长的问题，提供更好的用户隐私保护和法律风险管理。"
}