{
    "title": "Optimal Dynamic Fees for Blockchain Resources. (arXiv:2309.12735v1 [cs.GT])",
    "abstract": "We develop a general and practical framework to address the problem of the optimal design of dynamic fee mechanisms for multiple blockchain resources. Our framework allows to compute policies that optimally trade-off between adjusting resource prices to handle persistent demand shifts versus being robust to local noise in the observed block demand. In the general case with more than one resource, our optimal policies correctly handle cross-effects (complementarity and substitutability) in resource demands. We also show how these cross-effects can be used to inform resource design, i.e. combining resources into bundles that have low demand-side cross-effects can yield simpler and more efficient price-update rules. Our framework is also practical, we demonstrate how it can be used to refine or inform the design of heuristic fee update rules such as EIP-1559 or EIP-4844 with two case studies. We then estimate a uni-dimensional version of our model using real market data from the Ethereum ",
    "link": "http://arxiv.org/abs/2309.12735",
    "context": "Title: Optimal Dynamic Fees for Blockchain Resources. (arXiv:2309.12735v1 [cs.GT])\nAbstract: We develop a general and practical framework to address the problem of the optimal design of dynamic fee mechanisms for multiple blockchain resources. Our framework allows to compute policies that optimally trade-off between adjusting resource prices to handle persistent demand shifts versus being robust to local noise in the observed block demand. In the general case with more than one resource, our optimal policies correctly handle cross-effects (complementarity and substitutability) in resource demands. We also show how these cross-effects can be used to inform resource design, i.e. combining resources into bundles that have low demand-side cross-effects can yield simpler and more efficient price-update rules. Our framework is also practical, we demonstrate how it can be used to refine or inform the design of heuristic fee update rules such as EIP-1559 or EIP-4844 with two case studies. We then estimate a uni-dimensional version of our model using real market data from the Ethereum ",
    "path": "papers/23/09/2309.12735.json",
    "total_tokens": 931,
    "translated_title": "区块链资源的最优动态费用设计",
    "translated_abstract": "我们开发了一个通用且实用的框架来解决多个区块链资源的动态费用机制的最优设计问题。我们的框架可以计算出最优策略，以在处理持久需求转变和对观察到的区块需求的局部噪声鲁棒性之间进行权衡调整资源价格。在有多个资源的一般情况下，我们的最优策略能够正确处理资源需求中的交叉效应（互补性和替代性）。我们还展示了如何利用这些交叉效应来指导资源设计，即将资源组合成具有低需求端交叉效应的捆绑商品可以产生更简单和更高效的价格更新规则。我们的框架也是实用的，我们通过两个案例研究演示了如何使用它来完善或指导启发式费用更新规则，如EIP-1559或EIP-4844。然后，我们使用以太坊的真实市场数据估计了我们模型的单维度版本。",
    "tldr": "我们开发了一个通用且实用的框架来解决多个区块链资源的动态费用机制的最优设计问题，并通过最优策略正确处理了资源需求中的交叉效应。我们还展示了如何利用这些交叉效应来指导资源设计，并演示了如何使用这个框架来完善或指导启发式费用更新规则。",
    "en_tdlr": "We have developed a general and practical framework to address the problem of the optimal design of dynamic fee mechanisms for multiple blockchain resources, which includes handling cross-effects in resource demands. We also demonstrate how this framework can inform resource design and refine or guide heuristic fee update rules."
}