{
    "title": "Students Success Modeling: Most Important Factors. (arXiv:2309.13052v1 [cs.CY])",
    "abstract": "The importance of retention rate for higher education institutions has encouraged data analysts to present various methods to predict at-risk students. The present study, motivated by the same encouragement, proposes a deep learning model trained with 121 features of diverse categories extracted or engineered out of the records of 60,822 postsecondary students. The model undertakes to identify students likely to graduate, the ones likely to transfer to a different school, and the ones likely to drop out and leave their higher education unfinished. This study undertakes to adjust its predictive methods for different stages of curricular progress of students. The temporal aspects introduced for this purpose are accounted for by incorporating layers of LSTM in the model. Our experiments demonstrate that distinguishing between to-be-graduate and at-risk students is reasonably achievable in the earliest stages, and then it rapidly improves, but the resolution within the latter category (dro",
    "link": "http://arxiv.org/abs/2309.13052",
    "context": "Title: Students Success Modeling: Most Important Factors. (arXiv:2309.13052v1 [cs.CY])\nAbstract: The importance of retention rate for higher education institutions has encouraged data analysts to present various methods to predict at-risk students. The present study, motivated by the same encouragement, proposes a deep learning model trained with 121 features of diverse categories extracted or engineered out of the records of 60,822 postsecondary students. The model undertakes to identify students likely to graduate, the ones likely to transfer to a different school, and the ones likely to drop out and leave their higher education unfinished. This study undertakes to adjust its predictive methods for different stages of curricular progress of students. The temporal aspects introduced for this purpose are accounted for by incorporating layers of LSTM in the model. Our experiments demonstrate that distinguishing between to-be-graduate and at-risk students is reasonably achievable in the earliest stages, and then it rapidly improves, but the resolution within the latter category (dro",
    "path": "papers/23/09/2309.13052.json",
    "total_tokens": 940,
    "translated_title": "学生成功建模：最重要的因素",
    "translated_abstract": "对于高等教育机构来说，保留率的重要性促使数据分析师提出了各种方法来预测有风险的学生。在激励下，本研究提出了一个深度学习模型，该模型使用了60,822名学生的121个不同类别的特征，这些特征通过记录进行了提取或工程化处理。该模型旨在识别有可能毕业的学生，有可能转校的学生以及有可能辍学中途离开高等学府的学生。本研究还尝试根据学生的课程进展不同阶段进行预测。为此，引入了LSTM层来考虑时间因素。我们的实验表明，在最早的阶段就可以相当准确地区分将要毕业的学生与有风险的学生，并且后者的预测准确性会迅速提高，但在后者这个类别内部的区分度会相对较低。",
    "tldr": "本研究提出了一个深度学习模型，用于预测有风险的学生，并根据学生的课程进展不同阶段进行调整。实验结果显示，在最早的阶段就可以相当准确地区分将要毕业的学生与有风险的学生，并且后者的预测准确性会迅速提高，但在后者这个类别内部的区分度会相对较低。",
    "en_tdlr": "This study proposes a deep learning model for predicting at-risk students and adjusts the predictions according to different stages of curricular progress. Experimental results show that it is possible to accurately distinguish between students likely to graduate and those at risk at the earliest stages, with the accuracy improving rapidly, but the resolution within the at-risk category is relatively low."
}