{
    "title": "Optimal Estimation under a Semiparametric Density Ratio Model. (arXiv:2309.09103v1 [stat.ME])",
    "abstract": "In many statistical and econometric applications, we gather individual samples from various interconnected populations that undeniably exhibit common latent structures. Utilizing a model that incorporates these latent structures for such data enhances the efficiency of inferences. Recently, many researchers have been adopting the semiparametric density ratio model (DRM) to address the presence of latent structures. The DRM enables estimation of each population distribution using pooled data, resulting in statistically more efficient estimations in contrast to nonparametric methods that analyze each sample in isolation. In this article, we investigate the limit of the efficiency improvement attainable through the DRM. We focus on situations where one population's sample size significantly exceeds those of the other populations. In such scenarios, we demonstrate that the DRM-based inferences for populations with smaller sample sizes achieve the highest attainable asymptotic efficiency as",
    "link": "http://arxiv.org/abs/2309.09103",
    "context": "Title: Optimal Estimation under a Semiparametric Density Ratio Model. (arXiv:2309.09103v1 [stat.ME])\nAbstract: In many statistical and econometric applications, we gather individual samples from various interconnected populations that undeniably exhibit common latent structures. Utilizing a model that incorporates these latent structures for such data enhances the efficiency of inferences. Recently, many researchers have been adopting the semiparametric density ratio model (DRM) to address the presence of latent structures. The DRM enables estimation of each population distribution using pooled data, resulting in statistically more efficient estimations in contrast to nonparametric methods that analyze each sample in isolation. In this article, we investigate the limit of the efficiency improvement attainable through the DRM. We focus on situations where one population's sample size significantly exceeds those of the other populations. In such scenarios, we demonstrate that the DRM-based inferences for populations with smaller sample sizes achieve the highest attainable asymptotic efficiency as",
    "path": "papers/23/09/2309.09103.json",
    "total_tokens": 893,
    "translated_title": "半参数密度比模型下的最优估计",
    "translated_abstract": "在许多统计和计量应用中，我们从各种相互关联的人群中获得独立样本，这些人群无疑展现出共同的潜在结构。利用包含这些潜在结构的模型来处理这样的数据能增强推断的效率。最近，许多研究人员采用了半参数密度比模型 (DRM) 来处理潜在结构的存在。DRM 可以利用合并的数据估计每个人群的分布，与非参数方法分析每个样本独立的方法相比，这种方法能达到更高的统计效率。在本文中，我们研究了通过 DRM 可以达到的效率改善的极限。我们重点关注一个人群的样本量显著超过其他人群的情况。在这种情况下，我们证明了基于 DRM 的对于样本量较小的人群的推断可以达到最高的渐近效率。",
    "tldr": "本文研究了半参数密度比模型在处理具有共同潜在结构的数据时的效率改善极限。研究发现，在一个人群的样本量显著超过其他人群的情况下，基于半参数密度比模型的推断能达到最高的统计效率。",
    "en_tdlr": "This article investigates the limit of efficiency improvement using the semiparametric density ratio model in the presence of common latent structures. The study shows that in situations where one population has a significantly larger sample size than the others, the DRM-based inferences can achieve the highest attainable asymptotic efficiency."
}