{
    "title": "Implicit Neural Multiple Description for DNA-based data storage. (arXiv:2309.06956v1 [eess.IV])",
    "abstract": "DNA exhibits remarkable potential as a data storage solution due to its impressive storage density and long-term stability, stemming from its inherent biomolecular structure. However, developing this novel medium comes with its own set of challenges, particularly in addressing errors arising from storage and biological manipulations. These challenges are further conditioned by the structural constraints of DNA sequences and cost considerations. In response to these limitations, we have pioneered a novel compression scheme and a cutting-edge Multiple Description Coding (MDC) technique utilizing neural networks for DNA data storage. Our MDC method introduces an innovative approach to encoding data into DNA, specifically designed to withstand errors effectively. Notably, our new compression scheme overperforms classic image compression methods for DNA-data storage. Furthermore, our approach exhibits superiority over conventional MDC methods reliant on auto-encoders. Its distinctive streng",
    "link": "http://arxiv.org/abs/2309.06956",
    "context": "Title: Implicit Neural Multiple Description for DNA-based data storage. (arXiv:2309.06956v1 [eess.IV])\nAbstract: DNA exhibits remarkable potential as a data storage solution due to its impressive storage density and long-term stability, stemming from its inherent biomolecular structure. However, developing this novel medium comes with its own set of challenges, particularly in addressing errors arising from storage and biological manipulations. These challenges are further conditioned by the structural constraints of DNA sequences and cost considerations. In response to these limitations, we have pioneered a novel compression scheme and a cutting-edge Multiple Description Coding (MDC) technique utilizing neural networks for DNA data storage. Our MDC method introduces an innovative approach to encoding data into DNA, specifically designed to withstand errors effectively. Notably, our new compression scheme overperforms classic image compression methods for DNA-data storage. Furthermore, our approach exhibits superiority over conventional MDC methods reliant on auto-encoders. Its distinctive streng",
    "path": "papers/23/09/2309.06956.json",
    "total_tokens": 856,
    "translated_title": "基于DNA的数据存储的隐式神经多描述方法",
    "translated_abstract": "DNA由于其卓越的存储密度和长期稳定性，基于其固有的生物分子结构，展示出作为数据存储解决方案的巨大潜力。然而，开发这种新型介质面临着一系列挑战，特别是处理存储和生物操作引起的错误。这些挑战进一步受限于DNA序列的结构约束和成本考虑。为了应对这些限制，我们首创了一种新型的压缩方案和一种利用神经网络进行DNA数据存储的尖端多描述编码（MDC）技术。我们的MDC方法引入了一种创新的将数据编码成DNA的方法，特别设计来有效地抵抗错误。值得注意的是，我们的新压缩方案在DNA数据存储方面超过了经典图像压缩方法。此外，我们的方法表现出优于依赖自动编码器的传统MDC方法的特点。",
    "tldr": "本论文提出了一种基于DNA的数据存储方法，采用隐式神经多描述技术编码数据。通过创新的压缩方案和神经网络，有效地解决了DNA存储中的错误问题，并在性能上超过了传统的MDC方法。",
    "en_tdlr": "This paper proposes an implicit neural multiple description method for DNA-based data storage. By introducing a novel compression scheme and utilizing neural networks, it effectively addresses errors in DNA storage and outperforms traditional MDC methods."
}