{
    "title": "Parameterized Aspects of Distinct Kemeny Rank Aggregation. (arXiv:2309.03517v1 [cs.DS])",
    "abstract": "The Kemeny method is one of the popular tools for rank aggregation. However, computing an optimal Kemeny ranking is NP-hard. Consequently, the computational task of finding a Kemeny ranking has been studied under the lens of parameterized complexity with respect to many parameters. We first present a comprehensive relationship, both theoretical and empirical, among these parameters. Further, we study the problem of computing all distinct Kemeny rankings under the lens of parameterized complexity. We consider the target Kemeny score, number of candidates, average distance of input rankings, maximum range of any candidate, and unanimity width as our parameters. For all these parameters, we already have FPT algorithms. We find that any desirable number of Kemeny rankings can also be found without substantial increase in running time. We also present FPT approximation algorithms for Kemeny rank aggregation with respect to these parameters.",
    "link": "http://arxiv.org/abs/2309.03517",
    "context": "Title: Parameterized Aspects of Distinct Kemeny Rank Aggregation. (arXiv:2309.03517v1 [cs.DS])\nAbstract: The Kemeny method is one of the popular tools for rank aggregation. However, computing an optimal Kemeny ranking is NP-hard. Consequently, the computational task of finding a Kemeny ranking has been studied under the lens of parameterized complexity with respect to many parameters. We first present a comprehensive relationship, both theoretical and empirical, among these parameters. Further, we study the problem of computing all distinct Kemeny rankings under the lens of parameterized complexity. We consider the target Kemeny score, number of candidates, average distance of input rankings, maximum range of any candidate, and unanimity width as our parameters. For all these parameters, we already have FPT algorithms. We find that any desirable number of Kemeny rankings can also be found without substantial increase in running time. We also present FPT approximation algorithms for Kemeny rank aggregation with respect to these parameters.",
    "path": "papers/23/09/2309.03517.json",
    "total_tokens": 894,
    "translated_title": "参数化视角下的Distinct Kemeny排序聚合的方面",
    "translated_abstract": "Kemeny方法是一种受欢迎的排序聚合工具，但计算最优的Kemeny排序是NP-hard的。因此，将找到Kemeny排序的计算任务从多个参数的角度进行了研究。首先，我们提出了这些参数之间的全面关系，包括理论和实证。此外，我们还从参数化复杂性的角度研究了计算所有不同的Kemeny排序的问题。我们考虑了目标Kemeny分数、候选人数量、输入排序的平均距离、任何候选人的最大范围和一致性宽度作为我们的参数。对于所有这些参数，我们已经有了FPT算法。我们发现，在不显著增加运行时间的情况下，也可以找到任意数量的Kemeny排序。我们还提出了相对于这些参数的Kemeny排序聚合的FPT近似算法。",
    "tldr": "这项研究从参数化复杂性的角度出发，研究了Distinct Kemeny排序聚合的多个参数，包括目标Kemeny分数、候选人数量、输入排序的平均距离、任何候选人的最大范围和一致性宽度，并提出了相应的FPT算法和FPT近似算法。",
    "en_tdlr": "This research investigates various parameters of Distinct Kemeny rank aggregation from the perspective of parameterized complexity, including target Kemeny score, number of candidates, average distance of input rankings, maximum range of any candidate, and unanimity width. FPT algorithms and FPT approximation algorithms are proposed for these parameters."
}