{
    "title": "Training of Spiking Neural Network joint Curriculum Learning Strategy. (arXiv:2309.04737v1 [cs.LG])",
    "abstract": "Starting with small and simple concepts, and gradually introducing complex and difficult concepts is the natural process of human learning. Spiking Neural Networks (SNNs) aim to mimic the way humans process information, but current SNNs models treat all samples equally, which does not align with the principles of human learning and overlooks the biological plausibility of SNNs. To address this, we propose a CL-SNN model that introduces Curriculum Learning(CL) into SNNs, making SNNs learn more like humans and providing higher biological interpretability. CL is a training strategy that advocates presenting easier data to models before gradually introducing more challenging data, mimicking the human learning process. We use a confidence-aware loss to measure and process the samples with different difficulty levels. By learning the confidence of different samples, the model reduces the contribution of difficult samples to parameter optimization automatically. We conducted experiments on st",
    "link": "http://arxiv.org/abs/2309.04737",
    "context": "Title: Training of Spiking Neural Network joint Curriculum Learning Strategy. (arXiv:2309.04737v1 [cs.LG])\nAbstract: Starting with small and simple concepts, and gradually introducing complex and difficult concepts is the natural process of human learning. Spiking Neural Networks (SNNs) aim to mimic the way humans process information, but current SNNs models treat all samples equally, which does not align with the principles of human learning and overlooks the biological plausibility of SNNs. To address this, we propose a CL-SNN model that introduces Curriculum Learning(CL) into SNNs, making SNNs learn more like humans and providing higher biological interpretability. CL is a training strategy that advocates presenting easier data to models before gradually introducing more challenging data, mimicking the human learning process. We use a confidence-aware loss to measure and process the samples with different difficulty levels. By learning the confidence of different samples, the model reduces the contribution of difficult samples to parameter optimization automatically. We conducted experiments on st",
    "path": "papers/23/09/2309.04737.json",
    "total_tokens": 858,
    "translated_title": "Spiking Neural Network联合课程学习策略的训练",
    "translated_abstract": "从简单到复杂，逐渐引入难度的概念是人类学习的自然过程。脉冲神经网络（SNNs）旨在模拟人类信息处理的方式，但目前的SNNs模型将所有样本视为平等，这与人类学习的原则不符，并忽视了SNNs的生物合理性。为了解决这个问题，我们提出了一个将课程学习（CL）引入SNNs的CL-SNN模型，使SNNs更像人类学习，并提供更高的生物解释性。CL是一种训练策略，提倡在逐渐引入更具挑战性的数据之前向模型展示更容易的数据，模拟了人类学习的过程。我们使用具有信心感知的损失来衡量和处理不同难度水平的样本。通过学习不同样本的置信度，模型自动减少了难样本对参数优化的贡献。我们在实验中进行了研究",
    "tldr": "该论文提出了一种将课程学习引入脉冲神经网络的训练模型，使其更类似于人类学习过程，并提高了其生物解释性。"
}