{
    "title": "Skilog: A Smart Sensor System for Performance Analysis and Biofeedback in Ski Jumping. (arXiv:2309.14455v1 [eess.SP])",
    "abstract": "In ski jumping, low repetition rates of jumps limit the effectiveness of training. Thus, increasing learning rate within every single jump is key to success. A critical element of athlete training is motor learning, which has been shown to be accelerated by feedback methods. In particular, a fine-grained control of the center of gravity in the in-run is essential. This is because the actual takeoff occurs within a blink of an eye ($\\sim$300ms), thus any unbalanced body posture during the in-run will affect flight. This paper presents a smart, compact, and energy-efficient wireless sensor system for real-time performance analysis and biofeedback during ski jumping. The system operates by gauging foot pressures at three distinct points on the insoles of the ski boot at 100Hz. Foot pressure data can either be directly sent to coaches to improve their feedback, or fed into a ML model to give athletes instantaneous in-action feedback using a vibration motor in the ski boot. In the biofeedba",
    "link": "http://arxiv.org/abs/2309.14455",
    "context": "Title: Skilog: A Smart Sensor System for Performance Analysis and Biofeedback in Ski Jumping. (arXiv:2309.14455v1 [eess.SP])\nAbstract: In ski jumping, low repetition rates of jumps limit the effectiveness of training. Thus, increasing learning rate within every single jump is key to success. A critical element of athlete training is motor learning, which has been shown to be accelerated by feedback methods. In particular, a fine-grained control of the center of gravity in the in-run is essential. This is because the actual takeoff occurs within a blink of an eye ($\\sim$300ms), thus any unbalanced body posture during the in-run will affect flight. This paper presents a smart, compact, and energy-efficient wireless sensor system for real-time performance analysis and biofeedback during ski jumping. The system operates by gauging foot pressures at three distinct points on the insoles of the ski boot at 100Hz. Foot pressure data can either be directly sent to coaches to improve their feedback, or fed into a ML model to give athletes instantaneous in-action feedback using a vibration motor in the ski boot. In the biofeedba",
    "path": "papers/23/09/2309.14455.json",
    "total_tokens": 976,
    "translated_title": "Skilog：滑雪跳台运动中的智能传感器系统用于性能分析和生物反馈",
    "translated_abstract": "在滑雪跳台运动中，跳跃的重复率低限制了训练的有效性。因此，提高每次单独跳跃的学习率是成功的关键。运动员训练的关键因素之一是运动学习，研究表明反馈方法可以加速运动学习。特别是在速度上坡时，对重心的精细控制至关重要。这是因为实际起跳发生在眨眼间（约300毫秒），因此在速度上坡阶段任何不平衡的身体姿势都会影响飞行。本文提出了一种智能、紧凑、节能的无线传感器系统，用于滑雪跳台运动中的实时性能分析和生物反馈。该系统通过在滑雪靴鞋垫上的三个不同点测量脚压力，以100Hz的频率进行操作。脚压力数据可以直接发送给教练以改善反馈，或者输入到机器学习模型中，使用滑雪靴中的振动马达给运动员提供即时的行动反馈。",
    "tldr": "该论文介绍了一种用于滑雪跳台运动中的智能传感器系统，可以在实时中进行性能分析和生物反馈。通过测量滑雪靴鞋垫上的脚压力，系统可以提供给教练改善反馈和运动员即时的行动反馈。",
    "en_tdlr": "This paper presents a smart sensor system for performance analysis and biofeedback in ski jumping, which measures foot pressures to provide feedback to coaches and athletes in real time."
}