{
    "title": "Grassroots Operator Search for Model Edge Adaptation. (arXiv:2309.11246v1 [cs.LG])",
    "abstract": "Hardware-aware Neural Architecture Search (HW-NAS) is increasingly being used to design efficient deep learning architectures. An efficient and flexible search space is crucial to the success of HW-NAS. Current approaches focus on designing a macro-architecture and searching for the architecture's hyperparameters based on a set of possible values. This approach is biased by the expertise of deep learning (DL) engineers and standard modeling approaches. In this paper, we present a Grassroots Operator Search (GOS) methodology. Our HW-NAS adapts a given model for edge devices by searching for efficient operator replacement. We express each operator as a set of mathematical instructions that capture its behavior. The mathematical instructions are then used as the basis for searching and selecting efficient replacement operators that maintain the accuracy of the original model while reducing computational complexity. Our approach is grassroots since it relies on the mathematical foundations",
    "link": "http://arxiv.org/abs/2309.11246",
    "context": "Title: Grassroots Operator Search for Model Edge Adaptation. (arXiv:2309.11246v1 [cs.LG])\nAbstract: Hardware-aware Neural Architecture Search (HW-NAS) is increasingly being used to design efficient deep learning architectures. An efficient and flexible search space is crucial to the success of HW-NAS. Current approaches focus on designing a macro-architecture and searching for the architecture's hyperparameters based on a set of possible values. This approach is biased by the expertise of deep learning (DL) engineers and standard modeling approaches. In this paper, we present a Grassroots Operator Search (GOS) methodology. Our HW-NAS adapts a given model for edge devices by searching for efficient operator replacement. We express each operator as a set of mathematical instructions that capture its behavior. The mathematical instructions are then used as the basis for searching and selecting efficient replacement operators that maintain the accuracy of the original model while reducing computational complexity. Our approach is grassroots since it relies on the mathematical foundations",
    "path": "papers/23/09/2309.11246.json",
    "total_tokens": 905,
    "translated_title": "基于草根操作搜索的模型边缘适应",
    "translated_abstract": "硬件感知神经架构搜索（HW-NAS）在设计高效的深度学习架构上越来越普遍。一个高效且灵活的搜索空间对于HW-NAS的成功至关重要。当前的方法主要侧重于设计一个宏架构，并基于一组可能值来搜索架构的超参数。这种方法受深度学习工程师和标准建模方法的专业知识的影响。本文提出了一种基于草根操作搜索（GOS）的方法。我们的HW-NAS通过搜索高效的操作替换，来适应边缘设备上的给定模型。我们将每个操作表示为一组能捕捉其行为的数学指令。然后，这些数学指令被用作搜索和选择高效替换操作的基础，以保持原始模型的准确性同时降低计算复杂度。我们的方法是以草根为基础，因为它依赖数学基础。",
    "tldr": "本论文介绍了一种基于草根操作搜索的硬件感知神经架构搜索方法，旨在通过搜索高效的操作替换来适应边缘设备上的给定模型。该方法通过使用数学指令作为基础，选择高效替换操作以降低计算复杂度，同时保持原始模型的准确性。",
    "en_tdlr": "This paper presents a grassroots operator search methodology for hardware-aware neural architecture search. It aims to adapt a given model for edge devices by searching for efficient operator replacement. The approach selects efficient replacement operators based on mathematical instructions to reduce computational complexity while maintaining the accuracy of the original model."
}