{
    "title": "Multi-stage Deep Learning Artifact Reduction for Computed Tomography. (arXiv:2309.00494v1 [eess.IV])",
    "abstract": "In Computed Tomography (CT), an image of the interior structure of an object is computed from a set of acquired projection images. The quality of these reconstructed images is essential for accurate analysis, but this quality can be degraded by a variety of imaging artifacts. To improve reconstruction quality, the acquired projection images are often processed by a pipeline consisting of multiple artifact-removal steps applied in various image domains (e.g., outlier removal on projection images and denoising of reconstruction images). These artifact-removal methods exploit the fact that certain artifacts are easier to remove in a certain domain compared with other domains.  Recently, deep learning methods have shown promising results for artifact removal for CT images. However, most existing deep learning methods for CT are applied as a post-processing method after reconstruction. Therefore, artifacts that are relatively difficult to remove in the reconstruction domain may not be effec",
    "link": "http://arxiv.org/abs/2309.00494",
    "context": "Title: Multi-stage Deep Learning Artifact Reduction for Computed Tomography. (arXiv:2309.00494v1 [eess.IV])\nAbstract: In Computed Tomography (CT), an image of the interior structure of an object is computed from a set of acquired projection images. The quality of these reconstructed images is essential for accurate analysis, but this quality can be degraded by a variety of imaging artifacts. To improve reconstruction quality, the acquired projection images are often processed by a pipeline consisting of multiple artifact-removal steps applied in various image domains (e.g., outlier removal on projection images and denoising of reconstruction images). These artifact-removal methods exploit the fact that certain artifacts are easier to remove in a certain domain compared with other domains.  Recently, deep learning methods have shown promising results for artifact removal for CT images. However, most existing deep learning methods for CT are applied as a post-processing method after reconstruction. Therefore, artifacts that are relatively difficult to remove in the reconstruction domain may not be effec",
    "path": "papers/23/09/2309.00494.json",
    "total_tokens": 936,
    "translated_title": "计算机断层扫描的多阶段深度学习伪影减少",
    "translated_abstract": "在计算机断层扫描中，通过一系列获取的投影图像计算出物体内部结构的图像。这些重建图像的质量对于准确分析至关重要，但是这种质量可能会被各种成像伪影降低。为了提高重建质量，获取的投影图像通常通过由多个去伪影步骤组成的流程进行处理，这些步骤应用于不同的图像域（例如，投影图像的异常值去除和重建图像的去噪）。这些伪影去除方法利用了某些伪影在特定域相对于其他域更容易去除的事实。最近，深度学习方法在计算机断层扫描伪影去除方面取得了有希望的结果。然而，大多数现有的计算机断层扫描深度学习方法都是在重建之后作为后处理方法应用的。因此，在重建域相对困难去除的伪影可能无法有效去除。",
    "tldr": "本论文提出了一种多阶段深度学习伪影减少方法，用于提高计算机断层扫描的图像质量。传统方法通常在重建之后进行处理，而本方法能够根据不同的图像域进行多步骤去伪影，使得相对困难去除的伪影也能够有效消除。",
    "en_tdlr": "This paper proposes a multi-stage deep learning approach for artifact reduction in computed tomography, which improves image quality by applying multiple artifact-removal steps in different image domains. Unlike traditional methods that process images after reconstruction, this approach effectively eliminates even the challenging artifacts by considering different image domains."
}