{
    "title": "Visible and NIR Image Fusion Algorithm Based on Information Complementarity. (arXiv:2309.10522v1 [cs.CV])",
    "abstract": "Visible and near-infrared(NIR) band sensors provide images that capture complementary spectral radiations from a scene. And the fusion of the visible and NIR image aims at utilizing their spectrum properties to enhance image quality. However, currently visible and NIR fusion algorithms cannot well take advantage of spectrum properties, as well as lack information complementarity, which results in color distortion and artifacts. Therefore, this paper designs a complementary fusion model from the level of physical signals. First, in order to distinguish between noise and useful information, we use two layers of the weight-guided filter and guided filter to obtain texture and edge layers, respectively. Second, to generate the initial visible-NIR complementarity weight map, the difference maps of visible and NIR are filtered by the extend-DoG filter. After that, the significant region of NIR night-time compensation guides the initial complementarity weight map by the arctanI function. Fina",
    "link": "http://arxiv.org/abs/2309.10522",
    "context": "Title: Visible and NIR Image Fusion Algorithm Based on Information Complementarity. (arXiv:2309.10522v1 [cs.CV])\nAbstract: Visible and near-infrared(NIR) band sensors provide images that capture complementary spectral radiations from a scene. And the fusion of the visible and NIR image aims at utilizing their spectrum properties to enhance image quality. However, currently visible and NIR fusion algorithms cannot well take advantage of spectrum properties, as well as lack information complementarity, which results in color distortion and artifacts. Therefore, this paper designs a complementary fusion model from the level of physical signals. First, in order to distinguish between noise and useful information, we use two layers of the weight-guided filter and guided filter to obtain texture and edge layers, respectively. Second, to generate the initial visible-NIR complementarity weight map, the difference maps of visible and NIR are filtered by the extend-DoG filter. After that, the significant region of NIR night-time compensation guides the initial complementarity weight map by the arctanI function. Fina",
    "path": "papers/23/09/2309.10522.json",
    "total_tokens": 994,
    "translated_title": "基于信息互补的可见光和近红外图像融合算法",
    "translated_abstract": "可见光和近红外（NIR）频带传感器提供了从场景中捕捉到的互补光谱辐射的图像。可见光和近红外图像的融合旨在利用它们的光谱特性来提高图像质量。然而，目前的可见光和近红外融合算法无法很好地利用光谱特性，同时也缺乏信息互补，导致色彩失真和伪影。因此，本文从物理信号的层面设计了一种互补融合模型。首先，为了区分噪声和有用信息，我们使用了两层权重引导滤波器和引导滤波器来分别获得纹理和边缘图像。其次，为了生成初始的可见光-NIR互补权重图，通过扩展-DoG滤波器对可见光和近红外的差值图进行滤波。之后，NIR夜间补偿的显著区域通过arctanI函数来指导初始互补权重图。",
    "tldr": "这篇论文提出了一种基于信息互补的可见光和近红外图像融合算法，该算法通过使用权重引导滤波器和引导滤波器来获取纹理和边缘信息，并通过差值图和夜间补偿来生成互补权重图，从而解决了当前可见光和近红外融合算法中存在的色彩失真和伪影问题。",
    "en_tdlr": "This paper presents a visible and near-infrared image fusion algorithm based on information complementarity. The algorithm utilizes weight-guided and guided filters to extract texture and edge information, and generates a complementarity weight map through difference maps and night-time compensation, effectively addressing the color distortion and artifacts issues in current fusion algorithms."
}