{
    "title": "General and Practical Tuning Method for Off-the-Shelf Graph-Based Index: SISAP Indexing Challenge Report by Team UTokyo. (arXiv:2309.00472v1 [cs.IR])",
    "abstract": "Despite the efficacy of graph-based algorithms for Approximate Nearest Neighbor (ANN) searches, the optimal tuning of such systems remains unclear. This study introduces a method to tune the performance of off-the-shelf graph-based indexes, focusing on the dimension of vectors, database size, and entry points of graph traversal. We utilize a black-box optimization algorithm to perform integrated tuning to meet the required levels of recall and Queries Per Second (QPS). We applied our approach to Task A of the SISAP 2023 Indexing Challenge and got second place in the 10M and 30M tracks. It improves performance substantially compared to brute force methods. This research offers a universally applicable tuning method for graph-based indexes, extending beyond the specific conditions of the competition to broader uses.",
    "link": "http://arxiv.org/abs/2309.00472",
    "context": "Title: General and Practical Tuning Method for Off-the-Shelf Graph-Based Index: SISAP Indexing Challenge Report by Team UTokyo. (arXiv:2309.00472v1 [cs.IR])\nAbstract: Despite the efficacy of graph-based algorithms for Approximate Nearest Neighbor (ANN) searches, the optimal tuning of such systems remains unclear. This study introduces a method to tune the performance of off-the-shelf graph-based indexes, focusing on the dimension of vectors, database size, and entry points of graph traversal. We utilize a black-box optimization algorithm to perform integrated tuning to meet the required levels of recall and Queries Per Second (QPS). We applied our approach to Task A of the SISAP 2023 Indexing Challenge and got second place in the 10M and 30M tracks. It improves performance substantially compared to brute force methods. This research offers a universally applicable tuning method for graph-based indexes, extending beyond the specific conditions of the competition to broader uses.",
    "path": "papers/23/09/2309.00472.json",
    "total_tokens": 870,
    "translated_title": "通用且实用的图形索引调优方法：UTokyo团队的SISAP索引挑战报告",
    "translated_abstract": "尽管图形算法在近似最近邻搜索中表现出很好的效果，但如何对这些系统进行最优调优仍不清楚。本研究介绍了一种方法，用于调优现成的图形索引，重点考虑向量的维度、数据库大小和图遍历的入口点。我们利用黑盒优化算法进行综合调优，以满足所需的召回率和每秒查询数（QPS）水平。我们将该方法应用于SISAP 2023索引挑战的A任务，并在10M和30M轨道上获得第二名。与蛮力方法相比，它显著提高了性能。这项研究提供了一个通用的适用于图形索引的调优方法，适用于比赛之外的更广泛的应用。",
    "tldr": "本研究介绍了一种通用且实用的方法，用于调优现成的图形索引，通过黑盒优化算法综合调优，可以显著提高性能。该方法在SISAP 2023索引挑战中取得了优异的成绩，并可扩展到更广泛的应用领域。",
    "en_tdlr": "This study presents a general and practical method to tune off-the-shelf graph-based indexes, improving performance significantly. The approach, based on black-box optimization algorithm, achieves outstanding results in the SISAP 2023 Indexing Challenge and can be applied in various domains beyond the competition."
}