{
    "title": "Research on the Impact of Executive Shareholding on New Investment in Enterprises Based on Multivariable Linear Regression Model. (arXiv:2309.10986v1 [math.NA])",
    "abstract": "Based on principal-agent theory and optimal contract theory, companies use the method of increasing executives' shareholding to stimulate collaborative innovation. However, from the aspect of agency costs between management and shareholders (i.e. the first type) and between major shareholders and minority shareholders (i.e. the second type), the interests of management, shareholders and creditors will be unbalanced with the change of the marginal utility of executive equity incentives.In order to establish the correlation between the proportion of shares held by executives and investments in corporate innovation, we have chosen a range of publicly listed companies within China's A-share market as the focus of our study. Employing a multi-variable linear regression model, we aim to analyze this relationship thoroughly.The following models were developed: (1) the impact model of executive shareholding on corporate innovation investment; (2) the impact model of executive shareholding on t",
    "link": "http://arxiv.org/abs/2309.10986",
    "context": "Title: Research on the Impact of Executive Shareholding on New Investment in Enterprises Based on Multivariable Linear Regression Model. (arXiv:2309.10986v1 [math.NA])\nAbstract: Based on principal-agent theory and optimal contract theory, companies use the method of increasing executives' shareholding to stimulate collaborative innovation. However, from the aspect of agency costs between management and shareholders (i.e. the first type) and between major shareholders and minority shareholders (i.e. the second type), the interests of management, shareholders and creditors will be unbalanced with the change of the marginal utility of executive equity incentives.In order to establish the correlation between the proportion of shares held by executives and investments in corporate innovation, we have chosen a range of publicly listed companies within China's A-share market as the focus of our study. Employing a multi-variable linear regression model, we aim to analyze this relationship thoroughly.The following models were developed: (1) the impact model of executive shareholding on corporate innovation investment; (2) the impact model of executive shareholding on t",
    "path": "papers/23/09/2309.10986.json",
    "total_tokens": 931,
    "translated_title": "基于多变量线性回归模型的高管股权对企业新投资的影响研究",
    "translated_abstract": "基于委托代理理论和最优合同理论，企业利用增加高管股权的方式来激励协同创新。然而，从管理层与股东之间的代理成本（即第一类）和大股东与小股东之间的代理成本（即第二类）的角度来看，随着高管股权激励的边际效用变化，管理层、股东和债权人的利益将不平衡。为了建立高管持股比例与企业创新投资之间的关联性，我们选择了中国A股市场上一系列上市公司作为研究焦点。我们使用多变量线性回归模型对这种关系进行全面分析。我们开发了以下模型：（1）高管持股对企业创新投资的影响模型；（2）高管持股对...",
    "tldr": "该研究使用多变量线性回归模型, 基于委托代理理论和最优合同理论, 分析了高管股权对企业新投资的影响。根据研究结果，发现高管持股会通过改变高管股权激励的边际效用，导致管理层、股东和债权人的利益不平衡。",
    "en_tdlr": "This research uses a multivariable linear regression model to analyze the impact of executive shareholding on new investment in enterprises based on principal-agent theory and optimal contract theory. According to the results, it is found that executive shareholding can lead to imbalanced interests among management, shareholders, and creditors by changing the marginal utility of executive equity incentives."
}