{
    "title": "Gamma Hedging and Rough Paths. (arXiv:2309.05054v1 [q-fin.MF])",
    "abstract": "We apply rough path theory to study the discrete-time gamma-hedging strategy. We show that if a trader knows that the market price of a set of European options will be given by a diffusive pricing model, then the discrete-time gamma-hedging strategy will enable them to replicate other European options so long as the underlying price path is sufficiently regular. This is a sure result and does not require that the underlying price path has a quadratic variation corresponding to the pricing model. We show how to generalise this result to exotic derivatives when the gamma is defined to be the Gubinelli derivative of the delta by deriving rough-path versions of the Clark--Ocone formula which hold surely.",
    "link": "http://arxiv.org/abs/2309.05054",
    "context": "Title: Gamma Hedging and Rough Paths. (arXiv:2309.05054v1 [q-fin.MF])\nAbstract: We apply rough path theory to study the discrete-time gamma-hedging strategy. We show that if a trader knows that the market price of a set of European options will be given by a diffusive pricing model, then the discrete-time gamma-hedging strategy will enable them to replicate other European options so long as the underlying price path is sufficiently regular. This is a sure result and does not require that the underlying price path has a quadratic variation corresponding to the pricing model. We show how to generalise this result to exotic derivatives when the gamma is defined to be the Gubinelli derivative of the delta by deriving rough-path versions of the Clark--Ocone formula which hold surely.",
    "path": "papers/23/09/2309.05054.json",
    "total_tokens": 771,
    "translated_title": "Gamma对冲和粗路径理论研究",
    "translated_abstract": "我们运用粗路径理论研究离散时间的Gamma对冲策略。我们展示了如果交易员知道一组欧式期权的市场价格将遵循扩散定价模型，那么离散时间的Gamma对冲策略将使其能够复制其他欧式期权，只要标的资产价格路径足够规则。这是一个确凿的结果，并且不需要标的资产价格路径有与定价模型相对应的二次变化量。我们展示了如何将这个结果推广到异otic衍生品，当Gamma被定义为通过导数得到的Gubinelli导数时，通过推导确保的粗路径版本的Clark-Ocone公式。",
    "tldr": "研究使用粗路径理论来处理离散时间的Gamma对冲策略，表明只要标的资产价格路径足够规则，该策略可以复制其他欧式期权，无需满足定价模型的二次变化条件。",
    "en_tdlr": "This paper applies rough path theory to study the discrete-time gamma-hedging strategy, showing that it can replicate other European options as long as the underlying price path is sufficiently regular, regardless of the quadratic variation requirement of the pricing model. The results are also extended to exotic derivatives by defining gamma as the Gubinelli derivative of the delta and deriving rough-path versions of the Clark-Ocone formula."
}