{
    "title": "Derivatives Sensitivities Computation under Heston Model on GPU. (arXiv:2309.10477v1 [q-fin.CP])",
    "abstract": "This report investigates the computation of option Greeks for European and Asian options under the Heston stochastic volatility model on GPU. We first implemented the exact simulation method proposed by Broadie and Kaya and used it as a baseline for precision and speed. We then proposed a novel method for computing Greeks using the Milstein discretisation method on GPU. Our results show that the proposed method provides a speed-up up to 200x compared to the exact simulation implementation and that it can be used for both European and Asian options. However, the accuracy of the GPU method for estimating Rho is inferior to the CPU method. Overall, our study demonstrates the potential of GPU for computing derivatives sensitivies with numerical methods.",
    "link": "http://arxiv.org/abs/2309.10477",
    "context": "Title: Derivatives Sensitivities Computation under Heston Model on GPU. (arXiv:2309.10477v1 [q-fin.CP])\nAbstract: This report investigates the computation of option Greeks for European and Asian options under the Heston stochastic volatility model on GPU. We first implemented the exact simulation method proposed by Broadie and Kaya and used it as a baseline for precision and speed. We then proposed a novel method for computing Greeks using the Milstein discretisation method on GPU. Our results show that the proposed method provides a speed-up up to 200x compared to the exact simulation implementation and that it can be used for both European and Asian options. However, the accuracy of the GPU method for estimating Rho is inferior to the CPU method. Overall, our study demonstrates the potential of GPU for computing derivatives sensitivies with numerical methods.",
    "path": "papers/23/09/2309.10477.json",
    "total_tokens": 869,
    "translated_title": "在GPU上计算Heston模型下的衍生品敏感性",
    "translated_abstract": "本报告研究了在GPU上计算Heston随机波动模型下欧式和亚式期权的希腊字母。我们首先实现了Broadie和Kaya提出的精确模拟方法，并将其用作精度和速度的基准。然后，我们提出了一种在GPU上使用Milstein离散化方法计算希腊字母的新方法。我们的结果表明，与精确模拟实现相比，所提出的方法可以提供多达200倍的加速，并且可以用于欧式和亚式期权。然而，用GPU方法估计Rho的准确性不及CPU方法。总的来说，我们的研究证明了使用数值方法计算衍生品敏感度时GPU的潜力。",
    "tldr": "本报告研究了在GPU上使用Heston模型计算欧式和亚式期权的希腊字母。我们实现了精确模拟方法的基准和一种新的GPU方法，结果表明，新方法相对于基准可以提供多达200倍的加速。然而，用GPU方法估计Rho的准确性不如CPU方法。这项研究揭示了GPU在使用数值方法计算衍生品敏感度方面的潜力。",
    "en_tdlr": "This report investigates the computation of option Greeks for European and Asian options under the Heston stochastic volatility model on GPU. The proposed GPU method provides a speed-up up to 200x compared to the exact simulation implementation, but the accuracy for estimating Rho is inferior to the CPU method. This study demonstrates the potential of GPU for computing derivatives sensitivies with numerical methods."
}