{
    "title": "RHALE: Robust and Heterogeneity-aware Accumulated Local Effects. (arXiv:2309.11193v1 [cs.LG])",
    "abstract": "Accumulated Local Effects (ALE) is a widely-used explainability method for isolating the average effect of a feature on the output, because it handles cases with correlated features well. However, it has two limitations. First, it does not quantify the deviation of instance-level (local) effects from the average (global) effect, known as heterogeneity. Second, for estimating the average effect, it partitions the feature domain into user-defined, fixed-sized bins, where different bin sizes may lead to inconsistent ALE estimations. To address these limitations, we propose Robust and Heterogeneity-aware ALE (RHALE). RHALE quantifies the heterogeneity by considering the standard deviation of the local effects and automatically determines an optimal variable-size bin-splitting. In this paper, we prove that to achieve an unbiased approximation of the standard deviation of local effects within each bin, bin splitting must follow a set of sufficient conditions. Based on these conditions, we pr",
    "link": "http://arxiv.org/abs/2309.11193",
    "context": "Title: RHALE: Robust and Heterogeneity-aware Accumulated Local Effects. (arXiv:2309.11193v1 [cs.LG])\nAbstract: Accumulated Local Effects (ALE) is a widely-used explainability method for isolating the average effect of a feature on the output, because it handles cases with correlated features well. However, it has two limitations. First, it does not quantify the deviation of instance-level (local) effects from the average (global) effect, known as heterogeneity. Second, for estimating the average effect, it partitions the feature domain into user-defined, fixed-sized bins, where different bin sizes may lead to inconsistent ALE estimations. To address these limitations, we propose Robust and Heterogeneity-aware ALE (RHALE). RHALE quantifies the heterogeneity by considering the standard deviation of the local effects and automatically determines an optimal variable-size bin-splitting. In this paper, we prove that to achieve an unbiased approximation of the standard deviation of local effects within each bin, bin splitting must follow a set of sufficient conditions. Based on these conditions, we pr",
    "path": "papers/23/09/2309.11193.json",
    "total_tokens": 906,
    "translated_title": "Robust and Heterogeneity-aware Accumulated Local Effects (RHALE): 强健且考虑异质性的累积局部效应方法",
    "translated_abstract": "累积局部效应（ALE）是一种广泛使用的解释性方法，用于分离特征对输出的平均影响，因为它能很好地处理相关特征的情况。然而，它有两个限制。首先，它不能量化实例级（局部）效应与平均（全局）效应之间的偏差，即异质性。其次，为了估计平均效应，它将特征域划分为用户定义的固定大小的区间，不同的区间大小会导致不一致的ALE估计。为了解决这些限制，我们提出了强健且考虑异质性的ALE（RHALE）方法。RHALE通过考虑局部效应的标准差来量化异质性，并自动确定最佳的可变大小区间划分。在本文中，我们证明了为了在每个区间内获得局部效应的无偏估计的标准差，区间划分必须遵循一组充分条件。",
    "tldr": "RHALE方法是一种强健且考虑异质性的累积局部效应方法，通过量化异质性和自动确定最佳的区间划分，解决了累积局部效应方法的限制。"
}