{
    "title": "AudRandAug: Random Image Augmentations for Audio Classification. (arXiv:2309.04762v1 [cs.SD])",
    "abstract": "Data augmentation has proven to be effective in training neural networks. Recently, a method called RandAug was proposed, randomly selecting data augmentation techniques from a predefined search space. RandAug has demonstrated significant performance improvements for image-related tasks while imposing minimal computational overhead. However, no prior research has explored the application of RandAug specifically for audio data augmentation, which converts audio into an image-like pattern. To address this gap, we introduce AudRandAug, an adaptation of RandAug for audio data. AudRandAug selects data augmentation policies from a dedicated audio search space. To evaluate the effectiveness of AudRandAug, we conducted experiments using various models and datasets. Our findings indicate that AudRandAug outperforms other existing data augmentation methods regarding accuracy performance.",
    "link": "http://arxiv.org/abs/2309.04762",
    "context": "Title: AudRandAug: Random Image Augmentations for Audio Classification. (arXiv:2309.04762v1 [cs.SD])\nAbstract: Data augmentation has proven to be effective in training neural networks. Recently, a method called RandAug was proposed, randomly selecting data augmentation techniques from a predefined search space. RandAug has demonstrated significant performance improvements for image-related tasks while imposing minimal computational overhead. However, no prior research has explored the application of RandAug specifically for audio data augmentation, which converts audio into an image-like pattern. To address this gap, we introduce AudRandAug, an adaptation of RandAug for audio data. AudRandAug selects data augmentation policies from a dedicated audio search space. To evaluate the effectiveness of AudRandAug, we conducted experiments using various models and datasets. Our findings indicate that AudRandAug outperforms other existing data augmentation methods regarding accuracy performance.",
    "path": "papers/23/09/2309.04762.json",
    "total_tokens": 785,
    "translated_title": "AudRandAug：用于音频分类的随机图像增强方法",
    "translated_abstract": "数据增强已被证明在训练神经网络中非常有效。最近，提出了一种称为RandAug的方法，该方法从预定义的搜索空间中随机选择数据增强技术。RandAug在图像相关任务中展示了显著的性能提升，同时附加的计算开销很小。然而，以往的研究尚未探索将RandAug应用于将音频转化为图像模式的音频数据增强。为了填补这一空白，我们引入了AudRandAug，这是一种针对音频数据的RandAug改进方法。AudRandAug从专门的音频搜索空间中选择数据增强策略。为了评估AudRandAug的有效性，我们使用了各种模型和数据集进行了实验。我们的研究结果表明，AudRandAug在准确率表现方面优于其他现有的数据增强方法。",
    "tldr": "AudRandAug是一种应用于音频数据的随机图像增强方法，它从专门的音频搜索空间中选择数据增强策略，并在准确率表现方面优于其他方法。",
    "en_tdlr": "AudRandAug is a random image augmentation method for audio data, which selects data augmentation strategies from a dedicated audio search space. It outperforms other methods in terms of accuracy performance."
}