{
    "title": "Assessing Utility of Differential Privacy for RCTs. (arXiv:2309.14581v1 [stat.AP])",
    "abstract": "Randomized control trials, RCTs, have become a powerful tool for assessing the impact of interventions and policies in many contexts. They are considered the gold-standard for inference in the biomedical fields and in many social sciences. Researchers have published an increasing number of studies that rely on RCTs for at least part of the inference, and these studies typically include the response data collected, de-identified and sometimes protected through traditional disclosure limitation methods. In this paper, we empirically assess the impact of strong privacy-preservation methodology (with \\ac{DP} guarantees), on published analyses from RCTs, leveraging the availability of replication packages (research compendia) in economics and policy analysis. We provide simulations studies and demonstrate how we can replicate the analysis in a published economics article on privacy-protected data under various parametrizations. We find that relatively straightforward DP-based methods allow ",
    "link": "http://arxiv.org/abs/2309.14581",
    "context": "Title: Assessing Utility of Differential Privacy for RCTs. (arXiv:2309.14581v1 [stat.AP])\nAbstract: Randomized control trials, RCTs, have become a powerful tool for assessing the impact of interventions and policies in many contexts. They are considered the gold-standard for inference in the biomedical fields and in many social sciences. Researchers have published an increasing number of studies that rely on RCTs for at least part of the inference, and these studies typically include the response data collected, de-identified and sometimes protected through traditional disclosure limitation methods. In this paper, we empirically assess the impact of strong privacy-preservation methodology (with \\ac{DP} guarantees), on published analyses from RCTs, leveraging the availability of replication packages (research compendia) in economics and policy analysis. We provide simulations studies and demonstrate how we can replicate the analysis in a published economics article on privacy-protected data under various parametrizations. We find that relatively straightforward DP-based methods allow ",
    "path": "papers/23/09/2309.14581.json",
    "total_tokens": 869,
    "translated_title": "评估差分隐私在RCT中的实用性",
    "translated_abstract": "随机对照试验（RCT）已成为评估干预措施和政策在许多领域中影响的强大工具。它们被认为是生物医学领域和许多社会科学领域推断的黄金标准。研究人员已经发表了越来越多依赖RCT进行推断的研究，这些研究通常包括经过去标识化和有时通过传统的数据披露限制方法保护的响应数据。在本文中，我们通过利用经济学和政策分析中的复制包（研究综述）来实证评估强隐私保护方法（具有差分隐私保证）对已发表的RCT分析的影响。我们提供了模拟研究，并展示了如何在各种参数化条件下复制对隐私保护数据的已发布经济学文章的分析。我们发现相对简单的基于差分隐私的方法可以实现这一目标。",
    "tldr": "本文评估了差分隐私在RCT中的实用性，通过实证评估强隐私保护方法对已发表的RCT分析的影响，并发现相对简单的基于差分隐私的方法可以实现这一目标。",
    "en_tdlr": "This paper assesses the utility of differential privacy for RCTs, demonstrating that relatively straightforward differential privacy methods can effectively protect privacy in published RCT analyses."
}