{
    "title": "Generalized Attacks on Face Verification Systems. (arXiv:2309.05879v1 [cs.CR])",
    "abstract": "Face verification (FV) using deep neural network models has made tremendous progress in recent years, surpassing human accuracy and seeing deployment in various applications such as border control and smartphone unlocking. However, FV systems are vulnerable to Adversarial Attacks, which manipulate input images to deceive these systems in ways usually unnoticeable to humans. This paper provides an in-depth study of attacks on FV systems. We introduce the DodgePersonation Attack that formulates the creation of face images that impersonate a set of given identities while avoiding being identified as any of the identities in a separate, disjoint set. A taxonomy is proposed to provide a unified view of different types of Adversarial Attacks against FV systems, including Dodging Attacks, Impersonation Attacks, and Master Face Attacks. Finally, we propose the ''One Face to Rule Them All'' Attack which implements the DodgePersonation Attack with state-of-the-art performance on a well-known sce",
    "link": "http://arxiv.org/abs/2309.05879",
    "context": "Title: Generalized Attacks on Face Verification Systems. (arXiv:2309.05879v1 [cs.CR])\nAbstract: Face verification (FV) using deep neural network models has made tremendous progress in recent years, surpassing human accuracy and seeing deployment in various applications such as border control and smartphone unlocking. However, FV systems are vulnerable to Adversarial Attacks, which manipulate input images to deceive these systems in ways usually unnoticeable to humans. This paper provides an in-depth study of attacks on FV systems. We introduce the DodgePersonation Attack that formulates the creation of face images that impersonate a set of given identities while avoiding being identified as any of the identities in a separate, disjoint set. A taxonomy is proposed to provide a unified view of different types of Adversarial Attacks against FV systems, including Dodging Attacks, Impersonation Attacks, and Master Face Attacks. Finally, we propose the ''One Face to Rule Them All'' Attack which implements the DodgePersonation Attack with state-of-the-art performance on a well-known sce",
    "path": "papers/23/09/2309.05879.json",
    "total_tokens": 974,
    "translated_title": "面部验证系统的广义攻击",
    "translated_abstract": "近年来，使用深度神经网络模型的面部验证系统取得了巨大的进展，超越了人类的准确性，并在边境控制和智能手机解锁等各种应用中得到部署。然而，面部验证系统容易受到对抗攻击的影响，这些攻击会操纵输入图像以欺骗这些系统，而这种操纵对人类通常是难以察觉的。本文深入研究了对面部验证系统的攻击。我们引入了DodgePersonation攻击，并提出了一种方法来创建模仿一组给定身份的面部图像，同时避免被识别为任何一个不同的身份。我们提出了一种分类法，以提供对抗面部验证系统的不同类型攻击的统一视角，包括躲避攻击、冒名攻击和主要面部攻击。最后，我们提出了“一张面孔统治所有”的攻击，它使用DodgePersonation攻击并在众所周知的场景中具有最先进的性能。",
    "tldr": "这篇论文研究了对面部验证系统的广义攻击。通过引入DodgePersonation攻击，创造了模仿给定身份的面部图像，同时避免被识别为不同的身份。提出了一种分类法，对不同类型的对抗攻击进行统一总结。并提出了“一张面孔统治所有”的攻击，具有最先进的性能。",
    "en_tdlr": "This paper studies generalized attacks on face verification systems. By introducing the DodgePersonation attack, it creates face images that impersonate given identities while avoiding identification as different identities. A taxonomy is proposed to provide a unified view of different types of adversarial attacks. And the \"One Face to Rule Them All\" attack is proposed with state-of-the-art performance."
}