{
    "title": "Natural Language Embedded Programs for Hybrid Language Symbolic Reasoning",
    "abstract": "arXiv:2309.10814v2 Announce Type: replace  Abstract: How can we perform computations over natural language representations to solve tasks that require symbolic and numeric reasoning? We propose natural language embedded programs (NLEP) as a unifying framework for addressing math/symbolic reasoning, natural language understanding, and instruction following tasks. Our approach prompts a language model to generate full Python programs that define functions over data structures which contain natural language representations of structured knowledge. A Python interpreter then executes the generated code and prints the output. Despite using a task-general prompt, we find that this approach can improve upon strong baselines across a range of different tasks including math and symbolic reasoning, text classification, question answering, and instruction following. We found that the generated programs are interpretable since they outline the exact reasoning process followed by the program interpr",
    "link": "https://arxiv.org/abs/2309.10814",
    "context": "Title: Natural Language Embedded Programs for Hybrid Language Symbolic Reasoning\nAbstract: arXiv:2309.10814v2 Announce Type: replace  Abstract: How can we perform computations over natural language representations to solve tasks that require symbolic and numeric reasoning? We propose natural language embedded programs (NLEP) as a unifying framework for addressing math/symbolic reasoning, natural language understanding, and instruction following tasks. Our approach prompts a language model to generate full Python programs that define functions over data structures which contain natural language representations of structured knowledge. A Python interpreter then executes the generated code and prints the output. Despite using a task-general prompt, we find that this approach can improve upon strong baselines across a range of different tasks including math and symbolic reasoning, text classification, question answering, and instruction following. We found that the generated programs are interpretable since they outline the exact reasoning process followed by the program interpr",
    "path": "papers/23/09/2309.10814.json",
    "total_tokens": 830,
    "translated_title": "用于混合语言符号推理的自然语言嵌入程序",
    "translated_abstract": "arXiv:2309.10814v2 公告类型: 替换 摘要: 我们如何通过自然语言表示执行计算以解决需要符号和数值推理的任务？我们提出了自然语言嵌入程序（NLEP）作为一个统一的框架，用于解决数学/符号推理、自然语言理解和指令跟随任务。我们的方法促使语言模型生成完整的Python程序，定义在包含结构化知识自然语言表示的数据结构上的函数。然后Python解释器执行生成的代码并打印输出。尽管使用了一个任务通用的提示，我们发现这种方法可以在一系列不同任务上包括数学和符号推理、文本分类、问题回答和指令跟随中改进强基线。我们发现生成的程序是可解释的，因为它们概述了程序解释器遵循的确切推理过程。",
    "tldr": "该论文提出了一种自然语言嵌入程序的框架，以解决需要符号和数值推理的任务，不仅能够生成Python程序进行推理，还可以在数学推理、文本分类、问题回答等多个任务中优于基线方法。",
    "en_tdlr": "The paper introduces a framework of natural language embedded programs to solve tasks that require symbolic and numeric reasoning, which can generate Python programs for reasoning and outperform baseline methods in tasks including math reasoning, text classification, question answering, etc."
}