{
    "title": "AdSEE: Investigating the Impact of Image Style Editing on Advertisement Attractiveness. (arXiv:2309.08159v1 [cs.CV])",
    "abstract": "Online advertisements are important elements in e-commerce sites, social media platforms, and search engines. With the increasing popularity of mobile browsing, many online ads are displayed with visual information in the form of a cover image in addition to text descriptions to grab the attention of users. Various recent studies have focused on predicting the click rates of online advertisements aware of visual features or composing optimal advertisement elements to enhance visibility. In this paper, we propose Advertisement Style Editing and Attractiveness Enhancement (AdSEE), which explores whether semantic editing to ads images can affect or alter the popularity of online advertisements. We introduce StyleGAN-based facial semantic editing and inversion to ads images and train a click rate predictor attributing GAN-based face latent representations in addition to traditional visual and textual features to click rates. Through a large collected dataset named QQ-AD, containing 20,527 ",
    "link": "http://arxiv.org/abs/2309.08159",
    "context": "Title: AdSEE: Investigating the Impact of Image Style Editing on Advertisement Attractiveness. (arXiv:2309.08159v1 [cs.CV])\nAbstract: Online advertisements are important elements in e-commerce sites, social media platforms, and search engines. With the increasing popularity of mobile browsing, many online ads are displayed with visual information in the form of a cover image in addition to text descriptions to grab the attention of users. Various recent studies have focused on predicting the click rates of online advertisements aware of visual features or composing optimal advertisement elements to enhance visibility. In this paper, we propose Advertisement Style Editing and Attractiveness Enhancement (AdSEE), which explores whether semantic editing to ads images can affect or alter the popularity of online advertisements. We introduce StyleGAN-based facial semantic editing and inversion to ads images and train a click rate predictor attributing GAN-based face latent representations in addition to traditional visual and textual features to click rates. Through a large collected dataset named QQ-AD, containing 20,527 ",
    "path": "papers/23/09/2309.08159.json",
    "total_tokens": 903,
    "translated_title": "AdSEE: 研究图像样式编辑对广告吸引力的影响",
    "translated_abstract": "在电子商务网站、社交媒体平台和搜索引擎中，在线广告是重要的元素。随着移动浏览的日益流行，许多在线广告都通过封面图片以及文本描述来吸引用户的注意力。最近的各种研究致力于通过考虑视觉特征来预测在线广告的点击率，或者通过组合最佳的广告元素来增强可见性。本文提出了广告样式编辑和吸引力增强（AdSEE），探讨了广告图像的语义编辑是否会影响或改变在线广告的受欢迎程度。我们引入了基于StyleGAN的面部语义编辑和反转，对广告图像进行训练，并使用基于GAN的面部潜在表示以及传统的视觉和文本特征来预测点击率。通过一个名为QQ-AD的大型数据集，包含20,527个样本，我们对AdSEE进行了评估。",
    "tldr": "本文研究了图像样式编辑对广告吸引力的影响。通过引入基于StyleGAN的面部语义编辑和反转，并结合传统的视觉和文本特征，我们提出了AdSEE方法，可用于预测在线广告的点击率。通过对QQ-AD数据集的评估，验证了AdSEE的有效性。"
}