{
    "title": "Nonlinear MPC design for incrementally ISS systems with application to GRU networks. (arXiv:2309.16428v1 [eess.SY])",
    "abstract": "This brief addresses the design of a Nonlinear Model Predictive Control (NMPC) strategy for exponentially incremental Input-to-State Stable (ISS) systems. In particular, a novel formulation is devised, which does not necessitate the onerous computation of terminal ingredients, but rather relies on the explicit definition of a minimum prediction horizon ensuring closed-loop stability. The designed methodology is particularly suited for the control of systems learned by Recurrent Neural Networks (RNNs), which are known for their enhanced modeling capabilities and for which the incremental ISS properties can be studied thanks to simple algebraic conditions. The approach is applied to Gated Recurrent Unit (GRU) networks, providing also a method for the design of a tailored state observer with convergence guarantees. The resulting control architecture is tested on a benchmark system, demonstrating its good control performances and efficient applicability.",
    "link": "http://arxiv.org/abs/2309.16428",
    "context": "Title: Nonlinear MPC design for incrementally ISS systems with application to GRU networks. (arXiv:2309.16428v1 [eess.SY])\nAbstract: This brief addresses the design of a Nonlinear Model Predictive Control (NMPC) strategy for exponentially incremental Input-to-State Stable (ISS) systems. In particular, a novel formulation is devised, which does not necessitate the onerous computation of terminal ingredients, but rather relies on the explicit definition of a minimum prediction horizon ensuring closed-loop stability. The designed methodology is particularly suited for the control of systems learned by Recurrent Neural Networks (RNNs), which are known for their enhanced modeling capabilities and for which the incremental ISS properties can be studied thanks to simple algebraic conditions. The approach is applied to Gated Recurrent Unit (GRU) networks, providing also a method for the design of a tailored state observer with convergence guarantees. The resulting control architecture is tested on a benchmark system, demonstrating its good control performances and efficient applicability.",
    "path": "papers/23/09/2309.16428.json",
    "total_tokens": 914,
    "translated_title": "非线性MPC设计应用于增量ISS系统，以GRU网络为例",
    "translated_abstract": "本研究针对指数增量输入-状态稳定（ISS）系统设计了一种非线性模型预测控制（NMPC）策略。具体而言，提出了一种新的公式，无需计算终端成分，而是依赖于明确定义的最小预测范围以确保闭环稳定性。该设计方法特别适用于由循环神经网络（RNNs）学习的系统，RNNs以其增强建模能力而闻名，而增量ISS属性可以通过简单的代数条件进行研究。该方法应用于门控循环单元（GRU）网络，并提供了一种具有收敛性保证的量身定制状态观察器的设计方法。所得到的控制架构在基准系统上进行了测试，证明了其良好的控制性能和高效的实用性。",
    "tldr": "本研究提出了一种非线性模型预测控制（NMPC）策略，适用于增量ISS系统。通过简化计算终端成分，并明确定义最小预测范围，实现闭环稳定性。将该方法应用于GRU网络，并提供了一种量身定制状态观察器的设计方法。测试结果表明该控制架构具有良好的控制性能和高效的实用性。",
    "en_tdlr": "This study proposes a nonlinear model predictive control (NMPC) strategy for incrementally ISS systems. By simplifying the computation of terminal ingredients and defining a minimum prediction horizon, closed-loop stability is achieved. The method is applied to GRU networks and also provides a tailored state observer design. The results demonstrate good control performance and applicability."
}