{
    "title": "GroupEnc: encoder with group loss for global structure preservation. (arXiv:2309.02917v1 [cs.LG])",
    "abstract": "Recent advances in dimensionality reduction have achieved more accurate lower-dimensional embeddings of high-dimensional data. In addition to visualisation purposes, these embeddings can be used for downstream processing, including batch effect normalisation, clustering, community detection or trajectory inference. We use the notion of structure preservation at both local and global levels to create a deep learning model, based on a variational autoencoder (VAE) and the stochastic quartet loss from the SQuadMDS algorithm. Our encoder model, called GroupEnc, uses a 'group loss' function to create embeddings with less global structure distortion than VAEs do, while keeping the model parametric and the architecture flexible. We validate our approach using publicly available biological single-cell transcriptomic datasets, employing RNX curves for evaluation.",
    "link": "http://arxiv.org/abs/2309.02917",
    "context": "Title: GroupEnc: encoder with group loss for global structure preservation. (arXiv:2309.02917v1 [cs.LG])\nAbstract: Recent advances in dimensionality reduction have achieved more accurate lower-dimensional embeddings of high-dimensional data. In addition to visualisation purposes, these embeddings can be used for downstream processing, including batch effect normalisation, clustering, community detection or trajectory inference. We use the notion of structure preservation at both local and global levels to create a deep learning model, based on a variational autoencoder (VAE) and the stochastic quartet loss from the SQuadMDS algorithm. Our encoder model, called GroupEnc, uses a 'group loss' function to create embeddings with less global structure distortion than VAEs do, while keeping the model parametric and the architecture flexible. We validate our approach using publicly available biological single-cell transcriptomic datasets, employing RNX curves for evaluation.",
    "path": "papers/23/09/2309.02917.json",
    "total_tokens": 811,
    "translated_title": "GroupEnc: 具有群损失的编码器以实现全局结构保持",
    "translated_abstract": "最近在降维技术方面取得了较准确的高维数据的低维嵌入。除了可视化目的外，这些嵌入还可以用于下游处理，包括批次效应标准化、聚类、社区检测或轨迹推断。我们使用局部和全局层面的结构保持概念，创建了一个基于变分自动编码器（VAE）和SQuadMDS算法中的随机四分位损失的深度学习模型。我们的编码器模型名为GroupEnc，使用“群损失”函数创建嵌入，相比于VAE，能够减少全局结构畸变，同时保持模型的参数化和架构的灵活性。我们使用公开可用的生物学单细胞转录组数据集进行验证，并使用RNX曲线进行评估。",
    "tldr": "本文提出了一个名为GroupEnc的编码器模型，该模型利用了群损失函数，以实现比传统的变分自动编码器（VAE）更少的全局结构失真，并保持模型的参数化和架构的灵活性。",
    "en_tdlr": "This paper proposes an encoder model called GroupEnc, which uses a group loss function to achieve less global structure distortion compared to traditional variational autoencoders (VAEs), while keeping the model parametric and the architecture flexible."
}