{
    "title": "CPPF: A contextual and post-processing-free model for automatic speech recognition. (arXiv:2309.07413v1 [cs.CL])",
    "abstract": "ASR systems have become increasingly widespread in recent years. However, their textual outputs often require post-processing tasks before they can be practically utilized. To address this issue, we draw inspiration from the multifaceted capabilities of LLMs and Whisper, and focus on integrating multiple ASR text processing tasks related to speech recognition into the ASR model. This integration not only shortens the multi-stage pipeline, but also prevents the propagation of cascading errors, resulting in direct generation of post-processed text. In this study, we focus on ASR-related processing tasks, including Contextual ASR and multiple ASR post processing tasks. To achieve this objective, we introduce the CPPF model, which offers a versatile and highly effective alternative to ASR processing. CPPF seamlessly integrates these tasks without any significant loss in recognition performance.",
    "link": "http://arxiv.org/abs/2309.07413",
    "context": "Title: CPPF: A contextual and post-processing-free model for automatic speech recognition. (arXiv:2309.07413v1 [cs.CL])\nAbstract: ASR systems have become increasingly widespread in recent years. However, their textual outputs often require post-processing tasks before they can be practically utilized. To address this issue, we draw inspiration from the multifaceted capabilities of LLMs and Whisper, and focus on integrating multiple ASR text processing tasks related to speech recognition into the ASR model. This integration not only shortens the multi-stage pipeline, but also prevents the propagation of cascading errors, resulting in direct generation of post-processed text. In this study, we focus on ASR-related processing tasks, including Contextual ASR and multiple ASR post processing tasks. To achieve this objective, we introduce the CPPF model, which offers a versatile and highly effective alternative to ASR processing. CPPF seamlessly integrates these tasks without any significant loss in recognition performance.",
    "path": "papers/23/09/2309.07413.json",
    "total_tokens": 839,
    "translated_title": "CPPF: 一种上下文和后处理无关的自动语音识别模型",
    "translated_abstract": "近年来，ASR系统变得越来越广泛应用。然而，它们的文本输出通常需要经过后处理任务才能实际利用。为了解决这个问题，我们从LLMs和Whisper的多方面能力中获得启发，专注于将与语音识别相关的多个ASR文本处理任务整合到ASR模型中。这种整合不仅缩短了多阶段的流程，还防止了级联错误的传播，从而直接生成后处理过的文本。本研究重点关注与ASR相关的处理任务，包括上下文ASR和多个ASR后处理任务。为了实现这一目标，我们引入了CPPF模型，它提供了一种多功能和高效的ASR处理替代方案。CPPF无缝地整合了这些任务，而且识别性能几乎没有明显的损失。",
    "tldr": "CPPF是一种上下文和后处理无关的自动语音识别模型，它整合了多个与语音识别相关的ASR文本处理任务，提供了一种优化流程、避免级联错误传播且识别性能几乎没有损失的解决方案。"
}