{
    "title": "Navigating Healthcare Insights: A Birds Eye View of Explainability with Knowledge Graphs. (arXiv:2309.16593v1 [cs.AI])",
    "abstract": "Knowledge graphs (KGs) are gaining prominence in Healthcare AI, especially in drug discovery and pharmaceutical research as they provide a structured way to integrate diverse information sources, enhancing AI system interpretability. This interpretability is crucial in healthcare, where trust and transparency matter, and eXplainable AI (XAI) supports decision making for healthcare professionals. This overview summarizes recent literature on the impact of KGs in healthcare and their role in developing explainable AI models. We cover KG workflow, including construction, relationship extraction, reasoning, and their applications in areas like Drug-Drug Interactions (DDI), Drug Target Interactions (DTI), Drug Development (DD), Adverse Drug Reactions (ADR), and bioinformatics. We emphasize the importance of making KGs more interpretable through knowledge-infused learning in healthcare. Finally, we highlight research challenges and provide insights for future directions.",
    "link": "http://arxiv.org/abs/2309.16593",
    "context": "Title: Navigating Healthcare Insights: A Birds Eye View of Explainability with Knowledge Graphs. (arXiv:2309.16593v1 [cs.AI])\nAbstract: Knowledge graphs (KGs) are gaining prominence in Healthcare AI, especially in drug discovery and pharmaceutical research as they provide a structured way to integrate diverse information sources, enhancing AI system interpretability. This interpretability is crucial in healthcare, where trust and transparency matter, and eXplainable AI (XAI) supports decision making for healthcare professionals. This overview summarizes recent literature on the impact of KGs in healthcare and their role in developing explainable AI models. We cover KG workflow, including construction, relationship extraction, reasoning, and their applications in areas like Drug-Drug Interactions (DDI), Drug Target Interactions (DTI), Drug Development (DD), Adverse Drug Reactions (ADR), and bioinformatics. We emphasize the importance of making KGs more interpretable through knowledge-infused learning in healthcare. Finally, we highlight research challenges and provide insights for future directions.",
    "path": "papers/23/09/2309.16593.json",
    "total_tokens": 960,
    "translated_title": "导航医疗洞见：知识图谱中可解释性的鸟瞰视角",
    "translated_abstract": "知识图谱在医疗人工智能中日益受到重视，特别是在药物发现和制药研究中，因为它们提供了一种结构化的方式来整合多样化的信息源，增强了AI系统的可解释性。在医疗领域，这种可解释性非常重要，因为信任和透明性至关重要，可解释的AI（XAI）支持医疗专业人员的决策。本综述总结了关于知识图谱在医疗领域的影响及其在开发可解释性AI模型中的作用的最新文献。我们涵盖了知识图谱的工作流程，包括构建、关系提取、推理以及它们在药物-药物相互作用、药物靶点相互作用、药物开发、药物不良反应和生物信息学等领域的应用。我们强调通过在医疗中进行知识注入学习来提高知识图谱的可解释性的重要性。最后，我们突出研究挑战并提供未来方向的见解。",
    "tldr": "本文总结了知识图谱在医疗领域的影响以及开发可解释性AI模型中的作用。强调了通过知识注入学习提高知识图谱的可解释性的重要性，并提供了未来方向的见解。"
}