{
    "title": "EANet: Expert Attention Network for Online Trajectory Prediction. (arXiv:2309.05683v1 [cs.LG])",
    "abstract": "Trajectory prediction plays a crucial role in autonomous driving. Existing mainstream research and continuoual learning-based methods all require training on complete datasets, leading to poor prediction accuracy when sudden changes in scenarios occur and failing to promptly respond and update the model. Whether these methods can make a prediction in real-time and use data instances to update the model immediately(i.e., online learning settings) remains a question. The problem of gradient explosion or vanishing caused by data instance streams also needs to be addressed. Inspired by Hedge Propagation algorithm, we propose Expert Attention Network, a complete online learning framework for trajectory prediction. We introduce expert attention, which adjusts the weights of different depths of network layers, avoiding the model updated slowly due to gradient problem and enabling fast learning of new scenario's knowledge to restore prediction accuracy. Furthermore, we propose a short-term mot",
    "link": "http://arxiv.org/abs/2309.05683",
    "context": "Title: EANet: Expert Attention Network for Online Trajectory Prediction. (arXiv:2309.05683v1 [cs.LG])\nAbstract: Trajectory prediction plays a crucial role in autonomous driving. Existing mainstream research and continuoual learning-based methods all require training on complete datasets, leading to poor prediction accuracy when sudden changes in scenarios occur and failing to promptly respond and update the model. Whether these methods can make a prediction in real-time and use data instances to update the model immediately(i.e., online learning settings) remains a question. The problem of gradient explosion or vanishing caused by data instance streams also needs to be addressed. Inspired by Hedge Propagation algorithm, we propose Expert Attention Network, a complete online learning framework for trajectory prediction. We introduce expert attention, which adjusts the weights of different depths of network layers, avoiding the model updated slowly due to gradient problem and enabling fast learning of new scenario's knowledge to restore prediction accuracy. Furthermore, we propose a short-term mot",
    "path": "papers/23/09/2309.05683.json",
    "total_tokens": 887,
    "translated_title": "EANet: 专家注意力网络用于在线轨迹预测",
    "translated_abstract": "轨迹预测在自动驾驶中起着至关重要的作用。现有的主流研究和基于持续学习的方法都需要在完整的数据集上训练，导致在场景突然变化时预测准确度较低，无法及时响应和更新模型。这些方法是否能够实时预测并使用数据实例立即更新模型（即在线学习环境）仍然是个问题。还需要解决由数据实例流引起的梯度爆炸或消失的问题。受到Hedge Propagation算法的启发，我们提出了一个完整的在线学习框架——专家注意力网络，用于轨迹预测。我们引入专家注意力机制，调整网络层的不同深度的权重，避免由于梯度问题导致模型更新缓慢，并能够快速学习新场景的知识以恢复预测准确度。此外，我们还提出了一种短期运动模型。",
    "tldr": "本论文提出了一个专家注意力网络用于在线轨迹预测的在线学习框架。通过引入专家注意力机制，调整网络层的权重，解决了梯度问题，能够快速学习新场景的知识以提高预测准确度。",
    "en_tdlr": "This paper proposes an Expert Attention Network for online trajectory prediction, which introduces expert attention to adjust the weights of different network layers, addressing the gradient problem and enabling fast learning of new scenario's knowledge to improve prediction accuracy."
}