{
    "title": "Towards Unsupervised Graph Completion Learning on Graphs with Features and Structure Missing. (arXiv:2309.02762v1 [cs.LG])",
    "abstract": "In recent years, graph neural networks (GNN) have achieved significant developments in a variety of graph analytical tasks. Nevertheless, GNN's superior performance will suffer from serious damage when the collected node features or structure relationships are partially missing owning to numerous unpredictable factors. Recently emerged graph completion learning (GCL) has received increasing attention, which aims to reconstruct the missing node features or structure relationships under the guidance of a specifically supervised task. Although these proposed GCL methods have made great success, they still exist the following problems: the reliance on labels, the bias of the reconstructed node features and structure relationships. Besides, the generalization ability of the existing GCL still faces a huge challenge when both collected node features and structure relationships are partially missing at the same time. To solve the above issues, we propose a more general GCL framework with the ",
    "link": "http://arxiv.org/abs/2309.02762",
    "context": "Title: Towards Unsupervised Graph Completion Learning on Graphs with Features and Structure Missing. (arXiv:2309.02762v1 [cs.LG])\nAbstract: In recent years, graph neural networks (GNN) have achieved significant developments in a variety of graph analytical tasks. Nevertheless, GNN's superior performance will suffer from serious damage when the collected node features or structure relationships are partially missing owning to numerous unpredictable factors. Recently emerged graph completion learning (GCL) has received increasing attention, which aims to reconstruct the missing node features or structure relationships under the guidance of a specifically supervised task. Although these proposed GCL methods have made great success, they still exist the following problems: the reliance on labels, the bias of the reconstructed node features and structure relationships. Besides, the generalization ability of the existing GCL still faces a huge challenge when both collected node features and structure relationships are partially missing at the same time. To solve the above issues, we propose a more general GCL framework with the ",
    "path": "papers/23/09/2309.02762.json",
    "total_tokens": 819,
    "translated_title": "在具有特征和结构缺失的图上进行无监督图补全学习",
    "translated_abstract": "最近几年，图神经网络（GNN）在各种图分析任务中取得了显著的发展。然而，由于许多不可预测的因素，当收集到的节点特征或结构关系部分缺失时，GNN的优越性能将受到严重损害。最近出现的图补全学习（GCL）已经引起了越来越多的关注，其旨在在特定的监督任务引导下重建缺失的节点特征或结构关系。尽管这些提出的GCL方法取得了很大的成功，但仍然存在以下问题：对标签的依赖，重建的节点特征和结构关系的偏差。此外，现有的GCL的泛化能力在同时部分缺失收集到的节点特征和结构关系时仍面临着巨大的挑战。为了解决上述问题，我们提出了一个更通用的GCL框架，其中包括",
    "tldr": "提出了一个更通用的图补全学习（GCL）框架来解决节点特征和结构关系缺失的问题。"
}