{
    "title": "FaNS: a Facet-based Narrative Similarity Metric. (arXiv:2309.04823v1 [cs.CL])",
    "abstract": "Similar Narrative Retrieval is a crucial task since narratives are essential for explaining and understanding events, and multiple related narratives often help to create a holistic view of the event of interest. To accurately identify semantically similar narratives, this paper proposes a novel narrative similarity metric called Facet-based Narrative Similarity (FaNS), based on the classic 5W1H facets (Who, What, When, Where, Why, and How), which are extracted by leveraging the state-of-the-art Large Language Models (LLMs). Unlike existing similarity metrics that only focus on overall lexical/semantic match, FaNS provides a more granular matching along six different facets independently and then combines them. To evaluate FaNS, we created a comprehensive dataset by collecting narratives from AllSides, a third-party news portal. Experimental results demonstrate that the FaNS metric exhibits a higher correlation (37\\% higher) than traditional text similarity metrics that directly measur",
    "link": "http://arxiv.org/abs/2309.04823",
    "context": "Title: FaNS: a Facet-based Narrative Similarity Metric. (arXiv:2309.04823v1 [cs.CL])\nAbstract: Similar Narrative Retrieval is a crucial task since narratives are essential for explaining and understanding events, and multiple related narratives often help to create a holistic view of the event of interest. To accurately identify semantically similar narratives, this paper proposes a novel narrative similarity metric called Facet-based Narrative Similarity (FaNS), based on the classic 5W1H facets (Who, What, When, Where, Why, and How), which are extracted by leveraging the state-of-the-art Large Language Models (LLMs). Unlike existing similarity metrics that only focus on overall lexical/semantic match, FaNS provides a more granular matching along six different facets independently and then combines them. To evaluate FaNS, we created a comprehensive dataset by collecting narratives from AllSides, a third-party news portal. Experimental results demonstrate that the FaNS metric exhibits a higher correlation (37\\% higher) than traditional text similarity metrics that directly measur",
    "path": "papers/23/09/2309.04823.json",
    "total_tokens": 952,
    "translated_title": "FaNS：基于要素的叙事相似度度量",
    "translated_abstract": "相似的叙事检索是一项至关重要的任务，因为叙事对于解释和理解事件至关重要，而多个相关的叙事通常有助于创建对所关注事件的整体视图。为了准确识别语义上相似的叙事，本文提出了一种新颖的叙事相似度度量方法，称为基于要素的叙事相似度（FaNS），该方法基于经典的五W一H要素（Who，What，When，Where，Why和How），通过利用最先进的大型语言模型（LLMs）进行提取。与现有的仅关注整体词汇/语义匹配的相似度度量方法不同，FaNS提供了更为细致的匹配，包括六个不同的要素的独立匹配，并将它们组合。为了评估FaNS，我们从第三方新闻门户AllSides收集了一份全面的叙事数据集。实验结果表明，FaNS度量方法与直接度量的传统文本相似度度量方法相比，具有更高的相关性（高37%）。",
    "tldr": "本研究提出了一种基于要素的叙事相似度度量方法FaNS，通过提取经典的五W一H要素并借助大型语言模型，可以更准确地识别出语义上相似的叙事。实验证明，FaNS与传统文本相似度度量方法相比具有更高的相关性（高37%）。"
}