{
    "title": "C3Net: interatomic potential neural network for prediction of physicochemical properties in heterogenous systems. (arXiv:2309.15334v1 [cs.LG])",
    "abstract": "Understanding the interactions of a solute with its environment is of fundamental importance in chemistry and biology. In this work, we propose a deep neural network architecture for atom type embeddings in its molecular context and interatomic potential that follows fundamental physical laws. The architecture is applied to predict physicochemical properties in heterogeneous systems including solvation in diverse solvents, 1-octanol-water partitioning, and PAMPA with a single set of network weights. We show that our architecture is generalized well to the physicochemical properties and outperforms state-of-the-art approaches based on quantum mechanics and neural networks in the task of solvation free energy prediction. The interatomic potentials at each atom in a solute obtained from the model allow quantitative analysis of the physicochemical properties at atomic resolution consistent with chemical and physical reasoning. The software is available at https://github.com/SehanLee/C3Net.",
    "link": "http://arxiv.org/abs/2309.15334",
    "context": "Title: C3Net: interatomic potential neural network for prediction of physicochemical properties in heterogenous systems. (arXiv:2309.15334v1 [cs.LG])\nAbstract: Understanding the interactions of a solute with its environment is of fundamental importance in chemistry and biology. In this work, we propose a deep neural network architecture for atom type embeddings in its molecular context and interatomic potential that follows fundamental physical laws. The architecture is applied to predict physicochemical properties in heterogeneous systems including solvation in diverse solvents, 1-octanol-water partitioning, and PAMPA with a single set of network weights. We show that our architecture is generalized well to the physicochemical properties and outperforms state-of-the-art approaches based on quantum mechanics and neural networks in the task of solvation free energy prediction. The interatomic potentials at each atom in a solute obtained from the model allow quantitative analysis of the physicochemical properties at atomic resolution consistent with chemical and physical reasoning. The software is available at https://github.com/SehanLee/C3Net.",
    "path": "papers/23/09/2309.15334.json",
    "total_tokens": 944,
    "translated_title": "C3Net: 面向异质系统中物理化学性质预测的原子间势神经网络",
    "translated_abstract": "理解溶质与其环境的相互作用在化学和生物学中具有基本重要性。本研究提出了一种深度神经网络架构，用于原子类型在分子环境中的嵌入和遵循基本物理定律的原子间势。该架构被应用于预测异质系统中的物理化学性质，包括溶解在不同溶剂中、1-辛醇-水分配和PAMPA。我们展示了我们的架构在物理化学性质上具有良好的泛化能力，并在溶解自由能预测任务中优于基于量子力学和神经网络的最新方法。从模型中获得的溶质中每个原子的原子间势允许进行符合化学和物理推理的原子分辨率的物理化学性质定量分析。该软件可在https://github.com/SehanLee/C3Net上获取。",
    "tldr": "C3Net是一种面向异质系统中物理化学性质预测的神经网络，能嵌入原子类型在分子环境中并遵循基本物理定律的原子间势。该模型在预测物理化学性质上具有良好的泛化能力，并优于基于量子力学和神经网络的最新方法。",
    "en_tdlr": "C3Net is a neural network architecture for predicting physicochemical properties in heterogeneous systems, which embeds atom types in their molecular context and follows fundamental physical laws for interatomic potential. The model demonstrates good generalization in predicting physicochemical properties and outperforms state-of-the-art approaches based on quantum mechanics and neural networks."
}