{
    "title": "Reserve Matching with Thresholds. (arXiv:2309.13766v1 [econ.TH])",
    "abstract": "Reserve systems are used to accommodate multiple essential or underrepresented groups in allocating indivisible scarce resources by creating categories that prioritize their respective beneficiaries. Some applications include the optimal allocation of vaccines, or assignment of minority students to elite colleges in India. An allocation is called smart if it optimizes the number of units distributed. Previous literature mostly assumed baseline priorities, which impose significant interdependencies between the priority ordering of different categories. It also assumes either everybody is eligible for receiving a unit from any category, or only the beneficiaries are eligible. The comprehensive Threshold Model we propose allows independent priority orderings among categories and arbitrary beneficiary and eligibility thresholds, enabling policymakers to avoid comparing incomparables in affirmative action systems. We present a new smart reserve system that optimizes two objectives simultane",
    "link": "http://arxiv.org/abs/2309.13766",
    "context": "Title: Reserve Matching with Thresholds. (arXiv:2309.13766v1 [econ.TH])\nAbstract: Reserve systems are used to accommodate multiple essential or underrepresented groups in allocating indivisible scarce resources by creating categories that prioritize their respective beneficiaries. Some applications include the optimal allocation of vaccines, or assignment of minority students to elite colleges in India. An allocation is called smart if it optimizes the number of units distributed. Previous literature mostly assumed baseline priorities, which impose significant interdependencies between the priority ordering of different categories. It also assumes either everybody is eligible for receiving a unit from any category, or only the beneficiaries are eligible. The comprehensive Threshold Model we propose allows independent priority orderings among categories and arbitrary beneficiary and eligibility thresholds, enabling policymakers to avoid comparing incomparables in affirmative action systems. We present a new smart reserve system that optimizes two objectives simultane",
    "path": "papers/23/09/2309.13766.json",
    "total_tokens": 814,
    "translated_title": "阈值保留匹配",
    "translated_abstract": "保留系统通过创建优先考虑各自受益人的类别，以适应多个重要或代表性不足的群体来分配不可分割的稀缺资源。一些应用包括疫苗的最优分配，或将少数人分配到印度的精英学院。智能分配是指优化分配单元数的分配。先前的文献大多假定了基准优先级，这在不同类别的优先级排序之间会产生重要的相互依赖。它还假定要么每个人都有资格从任何类别接收单元，要么只有受益人有资格。我们提出的全面阈值模型允许在类别之间进行独立的优先级排序，并设置任意的受益人和资格阈值，使决策者能够避免在平权行动系统中进行无法比较的比较。我们提出了一个新的智能保留系统，可以同时优化两个目标。",
    "tldr": "本文提出了一个新的智能保留系统，使用阈值模型允许独立的优先级排序和任意的受益人和资格阈值，以实现优化分配单元数的分配。"
}