{
    "title": "Dataset Generation and Bonobo Classification from Weakly Labelled Videos. (arXiv:2309.03671v1 [cs.CV])",
    "abstract": "This paper presents a bonobo detection and classification pipeline built from the commonly used machine learning methods. Such application is motivated by the need to test bonobos in their enclosure using touch screen devices without human assistance. This work introduces a newly acquired dataset based on bonobo recordings generated semi-automatically. The recordings are weakly labelled and fed to a macaque detector in order to spatially detect the individual present in the video. Handcrafted features coupled with different classification algorithms and deep-learning methods using a ResNet architecture are investigated for bonobo identification. Performance is compared in terms of classification accuracy on the splits of the database using different data separation methods. We demonstrate the importance of data preparation and how a wrong data separation can lead to false good results. Finally, after a meaningful separation of the data, the best classification performance is obtained u",
    "link": "http://arxiv.org/abs/2309.03671",
    "context": "Title: Dataset Generation and Bonobo Classification from Weakly Labelled Videos. (arXiv:2309.03671v1 [cs.CV])\nAbstract: This paper presents a bonobo detection and classification pipeline built from the commonly used machine learning methods. Such application is motivated by the need to test bonobos in their enclosure using touch screen devices without human assistance. This work introduces a newly acquired dataset based on bonobo recordings generated semi-automatically. The recordings are weakly labelled and fed to a macaque detector in order to spatially detect the individual present in the video. Handcrafted features coupled with different classification algorithms and deep-learning methods using a ResNet architecture are investigated for bonobo identification. Performance is compared in terms of classification accuracy on the splits of the database using different data separation methods. We demonstrate the importance of data preparation and how a wrong data separation can lead to false good results. Finally, after a meaningful separation of the data, the best classification performance is obtained u",
    "path": "papers/23/09/2309.03671.json",
    "total_tokens": 910,
    "translated_title": "从弱标记视频中生成数据集并进行倭黑猩猩分类的研究",
    "translated_abstract": "本文介绍了一个基于常用机器学习方法构建的倭黑猩猩检测和分类流程。该应用的动机是为了在没有人的帮助下，使用触摸屏设备对倭黑猩猩在它们的围栏中进行测试。该研究引入了一个新获得的数据集，该数据集是基于倭黑猩猩录像的自动产生的。这些录像是弱标记的，并通过猕猴检测器进行空间检测，以检测视频中出现的个体。使用手工特征以及不同的分类算法和基于ResNet架构的深度学习方法进行倭黑猩猩识别的研究。使用不同的数据分离方法，在数据库的拆分上，以分类准确度作为性能指标进行比较。我们证明了数据准备的重要性以及错误的数据分离如何导致虚假的好结果。最后，经过有意义的数据分离后，得到了最佳的分类性能。",
    "tldr": "本研究提出了一种从弱标记视频中生成倭黑猩猩数据集并进行分类的方法，并探究了不同的特征提取和分类算法。研究结果表明，数据准备的重要性以及正确的数据分离对于分类性能的影响很大。"
}