{
    "title": "Diffusion Variational Autoencoder for Tackling Stochasticity in Multi-Step Regression Stock Price Prediction. (arXiv:2309.00073v1 [q-fin.ST])",
    "abstract": "Multi-step stock price prediction over a long-term horizon is crucial for forecasting its volatility, allowing financial institutions to price and hedge derivatives, and banks to quantify the risk in their trading books. Additionally, most financial regulators also require a liquidity horizon of several days for institutional investors to exit their risky assets, in order to not materially affect market prices. However, the task of multi-step stock price prediction is challenging, given the highly stochastic nature of stock data. Current solutions to tackle this problem are mostly designed for single-step, classification-based predictions, and are limited to low representation expressiveness. The problem also gets progressively harder with the introduction of the target price sequence, which also contains stochastic noise and reduces generalizability at test-time. To tackle these issues, we combine a deep hierarchical variational-autoencoder (VAE) and diffusion probabilistic techniques",
    "link": "http://arxiv.org/abs/2309.00073",
    "context": "Title: Diffusion Variational Autoencoder for Tackling Stochasticity in Multi-Step Regression Stock Price Prediction. (arXiv:2309.00073v1 [q-fin.ST])\nAbstract: Multi-step stock price prediction over a long-term horizon is crucial for forecasting its volatility, allowing financial institutions to price and hedge derivatives, and banks to quantify the risk in their trading books. Additionally, most financial regulators also require a liquidity horizon of several days for institutional investors to exit their risky assets, in order to not materially affect market prices. However, the task of multi-step stock price prediction is challenging, given the highly stochastic nature of stock data. Current solutions to tackle this problem are mostly designed for single-step, classification-based predictions, and are limited to low representation expressiveness. The problem also gets progressively harder with the introduction of the target price sequence, which also contains stochastic noise and reduces generalizability at test-time. To tackle these issues, we combine a deep hierarchical variational-autoencoder (VAE) and diffusion probabilistic techniques",
    "path": "papers/23/09/2309.00073.json",
    "total_tokens": 858,
    "translated_title": "利用扩散变分自编码器解决多步回归股票价格预测中的随机性问题",
    "translated_abstract": "长期内的多步股票价格预测对于预测波动性至关重要，使得金融机构能够定价和对冲衍生品，并让银行量化其交易簿中的风险。此外，大多数金融监管机构还要求机构投资者有几天的流动性期限从其风险资产中退出，以避免对市场价格产生实质性影响。然而，由于股票数据具有高度随机性，多步股票价格预测的任务很具挑战性。目前解决这个问题的方法主要针对单步基于分类的预测，并且在表征表达力方面有限。随着目标价格序列的引入，这个问题在测试时变得越来越困难，因为目标价格序列中也包含随机噪声，降低了泛化能力。为了解决这些问题，我们结合了深层分层变分自编码器(VAE)和扩散概率技术。",
    "tldr": "本论文提出了一种利用扩散变分自编码器来解决多步回归股票价格预测中的随机性问题的方法。",
    "en_tdlr": "This paper presents a method for tackling the stochasticity in multi-step regression stock price prediction using a diffusion variational autoencoder."
}