{
    "title": "Robotic Handling of Compliant Food Objects by Robust Learning from Demonstration. (arXiv:2309.12856v1 [cs.RO])",
    "abstract": "The robotic handling of compliant and deformable food raw materials, characterized by high biological variation, complex geometrical 3D shapes, and mechanical structures and texture, is currently in huge demand in the ocean space, agricultural, and food industries. Many tasks in these industries are performed manually by human operators who, due to the laborious and tedious nature of their tasks, exhibit high variability in execution, with variable outcomes. The introduction of robotic automation for most complex processing tasks has been challenging due to current robot learning policies. A more consistent learning policy involving skilled operators is desired. In this paper, we address the problem of robot learning when presented with inconsistent demonstrations. To this end, we propose a robust learning policy based on Learning from Demonstration (LfD) for robotic grasping of food compliant objects. The approach uses a merging of RGB-D images and tactile data in order to estimate th",
    "link": "http://arxiv.org/abs/2309.12856",
    "context": "Title: Robotic Handling of Compliant Food Objects by Robust Learning from Demonstration. (arXiv:2309.12856v1 [cs.RO])\nAbstract: The robotic handling of compliant and deformable food raw materials, characterized by high biological variation, complex geometrical 3D shapes, and mechanical structures and texture, is currently in huge demand in the ocean space, agricultural, and food industries. Many tasks in these industries are performed manually by human operators who, due to the laborious and tedious nature of their tasks, exhibit high variability in execution, with variable outcomes. The introduction of robotic automation for most complex processing tasks has been challenging due to current robot learning policies. A more consistent learning policy involving skilled operators is desired. In this paper, we address the problem of robot learning when presented with inconsistent demonstrations. To this end, we propose a robust learning policy based on Learning from Demonstration (LfD) for robotic grasping of food compliant objects. The approach uses a merging of RGB-D images and tactile data in order to estimate th",
    "path": "papers/23/09/2309.12856.json",
    "total_tokens": 835,
    "translated_title": "机器人从示教中学习处理软性食品对象",
    "translated_abstract": "处理软性和变形的食品原材料的机器人操作目前在海洋空间、农业和食品行业中需求巨大。这些行业中的许多任务是由人工操作员手动完成的，由于任务的繁重和乏味，执行的变化性很大，结果也会有所不同。由于当前的机器人学习策略，引入机器人自动化进行复杂处理任务一直是具有挑战性的。希望能够通过一个更一致的学习策略来解决这个问题，包括熟练的操作员。在本文中，我们解决了机器人在面对不一致示教时的学习问题。为此，我们提出了一种基于示教学习（LfD）的机器人抓取软性食品对象的稳健学习策略。该方法利用RGB-D图像和触觉数据的合并来估计...",
    "tldr": "本文介绍了一种机器人从示教中学习处理软性食品对象的稳健学习策略，通过合并RGB-D图像和触觉数据进行抓取。"
}