{
    "title": "Efficient Baselines for Motion Prediction in Autonomous Driving. (arXiv:2309.03387v1 [cs.RO])",
    "abstract": "Motion Prediction (MP) of multiple surroundings agents is a crucial task in arbitrarily complex environments, from simple robots to Autonomous Driving Stacks (ADS). Current techniques tackle this problem using end-to-end pipelines, where the input data is usually a rendered top-view of the physical information and the past trajectories of the most relevant agents; leveraging this information is a must to obtain optimal performance. In that sense, a reliable ADS must produce reasonable predictions on time. However, despite many approaches use simple ConvNets and LSTMs to obtain the social latent features, State-Of-The-Art (SOTA) models might be too complex for real-time applications when using both sources of information (map and past trajectories) as well as little interpretable, specially considering the physical information. Moreover, the performance of such models highly depends on the number of available inputs for each particular traffic scenario, which are expensive to obtain, pa",
    "link": "http://arxiv.org/abs/2309.03387",
    "context": "Title: Efficient Baselines for Motion Prediction in Autonomous Driving. (arXiv:2309.03387v1 [cs.RO])\nAbstract: Motion Prediction (MP) of multiple surroundings agents is a crucial task in arbitrarily complex environments, from simple robots to Autonomous Driving Stacks (ADS). Current techniques tackle this problem using end-to-end pipelines, where the input data is usually a rendered top-view of the physical information and the past trajectories of the most relevant agents; leveraging this information is a must to obtain optimal performance. In that sense, a reliable ADS must produce reasonable predictions on time. However, despite many approaches use simple ConvNets and LSTMs to obtain the social latent features, State-Of-The-Art (SOTA) models might be too complex for real-time applications when using both sources of information (map and past trajectories) as well as little interpretable, specially considering the physical information. Moreover, the performance of such models highly depends on the number of available inputs for each particular traffic scenario, which are expensive to obtain, pa",
    "path": "papers/23/09/2309.03387.json",
    "total_tokens": 801,
    "translated_title": "自动驾驶中运动预测的高效基线",
    "translated_abstract": "在任意复杂的环境中，从简单机器人到自动驾驶系统中，多方周围代理的运动预测是一项关键任务。当前的技术通过端到端的流程来解决这个问题，其中输入数据通常是物理信息的渲染顶视图和最相关代理的过去轨迹；利用这些信息是获得最佳性能的必需。在这个意义上，可靠的自动驾驶系统必须及时产生合理的预测。然而，当前的高端模型可能对于同时使用地图和过去轨迹这两种信息以及极少可解释性的物理信息的实时应用而言过于复杂。此外，这些模型的性能高度依赖于每个特定交通场景的可用输入数量，而这些输入难以获取，成本高昂。",
    "tldr": "这项研究提出了自动驾驶中运动预测的高效基线模型，解决了使用地图和过去轨迹信息的实时应用复杂性和可解释性的问题。",
    "en_tdlr": "This study proposes efficient baselines for motion prediction in autonomous driving, addressing the complexity and interpretability issues of real-time applications using both map and past trajectory information."
}