{
    "title": "M(otion)-mode Based Prediction of Ejection Fraction using Echocardiograms. (arXiv:2309.03759v1 [eess.IV])",
    "abstract": "Early detection of cardiac dysfunction through routine screening is vital for diagnosing cardiovascular diseases. An important metric of cardiac function is the left ventricular ejection fraction (EF), where lower EF is associated with cardiomyopathy. Echocardiography is a popular diagnostic tool in cardiology, with ultrasound being a low-cost, real-time, and non-ionizing technology. However, human assessment of echocardiograms for calculating EF is time-consuming and expertise-demanding, raising the need for an automated approach. In this work, we propose using the M(otion)-mode of echocardiograms for estimating the EF and classifying cardiomyopathy. We generate multiple artificial M-mode images from a single echocardiogram and combine them using off-the-shelf model architectures. Additionally, we extend contrastive learning (CL) to cardiac imaging to learn meaningful representations from exploiting structures in unlabeled data allowing the model to achieve high accuracy, even with li",
    "link": "http://arxiv.org/abs/2309.03759",
    "context": "Title: M(otion)-mode Based Prediction of Ejection Fraction using Echocardiograms. (arXiv:2309.03759v1 [eess.IV])\nAbstract: Early detection of cardiac dysfunction through routine screening is vital for diagnosing cardiovascular diseases. An important metric of cardiac function is the left ventricular ejection fraction (EF), where lower EF is associated with cardiomyopathy. Echocardiography is a popular diagnostic tool in cardiology, with ultrasound being a low-cost, real-time, and non-ionizing technology. However, human assessment of echocardiograms for calculating EF is time-consuming and expertise-demanding, raising the need for an automated approach. In this work, we propose using the M(otion)-mode of echocardiograms for estimating the EF and classifying cardiomyopathy. We generate multiple artificial M-mode images from a single echocardiogram and combine them using off-the-shelf model architectures. Additionally, we extend contrastive learning (CL) to cardiac imaging to learn meaningful representations from exploiting structures in unlabeled data allowing the model to achieve high accuracy, even with li",
    "path": "papers/23/09/2309.03759.json",
    "total_tokens": 939,
    "translated_title": "使用运动模式来预测超声心动图的射血分数的研究",
    "translated_abstract": "通过定期筛查尽早检测心脏功能障碍对诊断心血管疾病至关重要。射血分数（EF）是衡量心脏功能的重要指标，较低的EF与心肌病相关。超声心动图是心脏病学中常用的诊断工具，超声是一种低成本、实时、无辐射的技术。然而，人工评估超声心动图以计算EF耗时且需要专业知识，因此需要自动化的方法。在本研究中，我们提出使用超声心动图的M(otion)-mode来估计EF和分类心肌病。我们从单个超声心动图生成多个人工M模式图像，并使用现成的模型架构进行组合。此外，我们将对比学习（CL）扩展到心脏成像中，从未标记数据中利用结构来学习有意义的表示，使得模型能够实现高精度，即使只有有限的标记数据。",
    "tldr": "本研究提出了一种使用超声心动图的运动模式来估计射血分数和分类心肌病的方法。通过生成多个人工M模式图像并利用对比学习，该方法能够实现高精度的自动化评估，节省了时间和专业知识要求。"
}