{
    "title": "Towards Measuring Fairness in Grid Layout in Recommender Systems. (arXiv:2309.10271v1 [cs.IR])",
    "abstract": "There has been significant research in the last five years on ensuring the providers of items in a recommender system are treated fairly, particularly in terms of the exposure the system provides to their work through its results. However, the metrics developed to date have all been designed and tested for linear ranked lists. It is unknown whether and how existing fair ranking metrics for linear layouts can be applied to grid-based displays. Moreover, depending on the device (phone, tab, or laptop) users use to interact with systems, column size is adjusted using column reduction approaches in a grid-view. The visibility or exposure of recommended items in grid layouts varies based on column sizes and column reduction approaches as well. In this paper, we extend existing fair ranking concepts and metrics to study provider-side group fairness in grid layouts, present an analysis of the behavior of these grid adaptations of fair ranking metrics, and study how their behavior changes acro",
    "link": "http://arxiv.org/abs/2309.10271",
    "context": "Title: Towards Measuring Fairness in Grid Layout in Recommender Systems. (arXiv:2309.10271v1 [cs.IR])\nAbstract: There has been significant research in the last five years on ensuring the providers of items in a recommender system are treated fairly, particularly in terms of the exposure the system provides to their work through its results. However, the metrics developed to date have all been designed and tested for linear ranked lists. It is unknown whether and how existing fair ranking metrics for linear layouts can be applied to grid-based displays. Moreover, depending on the device (phone, tab, or laptop) users use to interact with systems, column size is adjusted using column reduction approaches in a grid-view. The visibility or exposure of recommended items in grid layouts varies based on column sizes and column reduction approaches as well. In this paper, we extend existing fair ranking concepts and metrics to study provider-side group fairness in grid layouts, present an analysis of the behavior of these grid adaptations of fair ranking metrics, and study how their behavior changes acro",
    "path": "papers/23/09/2309.10271.json",
    "total_tokens": 845,
    "translated_title": "在推荐系统中测量网格布局的公平性",
    "translated_abstract": "在过去五年中，对于确保推荐系统中的内容提供者能够公平对待，特别是通过其结果对其作品进行展示方面，进行了大量研究。然而，迄今为止开发的指标都是针对线性排名列表设计和测试的。目前尚不清楚现有的用于线性布局的公平排名指标是否可以应用于基于网格的显示。此外，根据用户使用的设备（手机、平板或笔记本电脑），使用列减少方法调整列大小以在网格视图中显示。在网格布局中，推荐项的可见性或曝光度根据列大小和列减少方法而变化。在本文中，我们将现有的公平排名概念和指标扩展到研究网格布局中提供者方面的群体公平性，提出了对这些网格调整公平排名指标行为的分析，并研究它们在不同设备上的行为变化。",
    "tldr": "本文扩展了现有的公平排名概念和指标，研究了网格布局中提供者方面的群体公平性，并分析了这些指标在不同设备上的行为变化。",
    "en_tdlr": "This paper extends existing fair ranking concepts and metrics to study provider-side group fairness in grid layouts, and analyzes the behavior of these metrics across different devices."
}