{
    "title": "MORPH: Design Co-optimization with Reinforcement Learning via a Differentiable Hardware Model Proxy. (arXiv:2309.17227v1 [cs.RO])",
    "abstract": "We introduce MORPH, a method for co-optimization of hardware design parameters and control policies in simulation using reinforcement learning. Like most co-optimization methods, MORPH relies on a model of the hardware being optimized, usually simulated based on the laws of physics. However, such a model is often difficult to integrate into an effective optimization routine. To address this, we introduce a proxy hardware model, which is always differentiable and enables efficient co-optimization alongside a long-horizon control policy using RL. MORPH is designed to ensure that the optimized hardware proxy remains as close as possible to its realistic counterpart, while still enabling task completion. We demonstrate our approach on simulated 2D reaching and 3D multi-fingered manipulation tasks.",
    "link": "http://arxiv.org/abs/2309.17227",
    "context": "Title: MORPH: Design Co-optimization with Reinforcement Learning via a Differentiable Hardware Model Proxy. (arXiv:2309.17227v1 [cs.RO])\nAbstract: We introduce MORPH, a method for co-optimization of hardware design parameters and control policies in simulation using reinforcement learning. Like most co-optimization methods, MORPH relies on a model of the hardware being optimized, usually simulated based on the laws of physics. However, such a model is often difficult to integrate into an effective optimization routine. To address this, we introduce a proxy hardware model, which is always differentiable and enables efficient co-optimization alongside a long-horizon control policy using RL. MORPH is designed to ensure that the optimized hardware proxy remains as close as possible to its realistic counterpart, while still enabling task completion. We demonstrate our approach on simulated 2D reaching and 3D multi-fingered manipulation tasks.",
    "path": "papers/23/09/2309.17227.json",
    "total_tokens": 836,
    "translated_title": "MORPH：通过可微分的硬件模型代理使用强化学习进行设计协同优化",
    "translated_abstract": "我们介绍了一种名为MORPH的方法，用于使用强化学习在仿真中进行硬件设计参数和控制策略的协同优化。与大多数协同优化方法类似，MORPH依赖于正在优化的硬件模型，通常是基于物理定律进行模拟。然而，这样的模型往往难以集成到有效的优化例程中。为了解决这个问题，我们引入了一个代理硬件模型，它始终是可微分的，并且能够使用RL和长期控制策略有效地进行协同优化。MORPH的设计目标是确保优化后的硬件代理与其真实对应物尽可能接近，同时仍然能够完成任务。我们在仿真的2D伸手和3D多指操纵任务上演示了我们的方法。",
    "tldr": "MORPH是一种使用强化学习进行硬件设计参数和控制策略的协同优化的方法。通过引入可微分的硬件模型代理，MORPH能够实现有效的优化并保持优化后的硬件代理接近其真实对应物。",
    "en_tdlr": "MORPH is a method for co-optimization of hardware design parameters and control policies using reinforcement learning. By introducing a differentiable hardware model proxy, MORPH enables efficient optimization while keeping the optimized hardware proxy close to its realistic counterpart."
}