{
    "title": "Privacy-preserving Early Detection of Epileptic Seizures in Videos. (arXiv:2309.08794v1 [cs.AI])",
    "abstract": "In this work, we contribute towards the development of video-based epileptic seizure classification by introducing a novel framework (SETR-PKD), which could achieve privacy-preserved early detection of seizures in videos. Specifically, our framework has two significant components - (1) It is built upon optical flow features extracted from the video of a seizure, which encodes the seizure motion semiotics while preserving the privacy of the patient; (2) It utilizes a transformer based progressive knowledge distillation, where the knowledge is gradually distilled from networks trained on a longer portion of video samples to the ones which will operate on shorter portions. Thus, our proposed framework addresses the limitations of the current approaches which compromise the privacy of the patients by directly operating on the RGB video of a seizure as well as impede real-time detection of a seizure by utilizing the full video sample to make a prediction. Our SETR-PKD framework could detect",
    "link": "http://arxiv.org/abs/2309.08794",
    "context": "Title: Privacy-preserving Early Detection of Epileptic Seizures in Videos. (arXiv:2309.08794v1 [cs.AI])\nAbstract: In this work, we contribute towards the development of video-based epileptic seizure classification by introducing a novel framework (SETR-PKD), which could achieve privacy-preserved early detection of seizures in videos. Specifically, our framework has two significant components - (1) It is built upon optical flow features extracted from the video of a seizure, which encodes the seizure motion semiotics while preserving the privacy of the patient; (2) It utilizes a transformer based progressive knowledge distillation, where the knowledge is gradually distilled from networks trained on a longer portion of video samples to the ones which will operate on shorter portions. Thus, our proposed framework addresses the limitations of the current approaches which compromise the privacy of the patients by directly operating on the RGB video of a seizure as well as impede real-time detection of a seizure by utilizing the full video sample to make a prediction. Our SETR-PKD framework could detect",
    "path": "papers/23/09/2309.08794.json",
    "total_tokens": 925,
    "translated_title": "视频中隐私保护的癫痫发作早期检测",
    "translated_abstract": "本文通过引入一种新颖的框架（SETR-PKD），为基于视频的癫痫发作分类的发展做出了贡献，可以实现视频中癫痫发作的隐私保护早期检测。具体而言，我们的框架具有两个重要组成部分 - (1) 它是基于从癫痫视频中提取的光流特征构建的，这些特征编码了癫痫运动符号学，同时保护了患者的隐私；(2) 它利用基于Transformer的逐步知识蒸馏，逐渐从长视频样本训练的网络中蒸馏出知识，然后传递给将在较短视频样本上操作的网络。因此，我们提出的框架解决了目前方法的局限性，这些方法通过直接对癫痫视频进行操作以及利用完整视频样本进行预测来损害患者的隐私，并阻碍了癫痫发作的实时检测。我们的SETR-PKD框架可以检测到",
    "tldr": "这项研究提出了一种视频中隐私保护的癫痫发作早期检测框架，通过提取光流特征并使用逐步知识蒸馏的方法，解决了当前方法存在的隐私泄露和实时检测问题。"
}