{
    "title": "USA: Universal Sentiment Analysis Model & Construction of Japanese Sentiment Text Classification and Part of Speech Dataset. (arXiv:2309.03787v1 [cs.CL])",
    "abstract": "Sentiment analysis is a pivotal task in the domain of natural language processing. It encompasses both text-level sentiment polarity classification and word-level Part of Speech(POS) sentiment polarity determination. Such analysis challenges models to understand text holistically while also extracting nuanced information. With the rise of Large Language Models(LLMs), new avenues for sentiment analysis have opened. This paper proposes enhancing performance by leveraging the Mutual Reinforcement Effect(MRE) between individual words and the overall text. It delves into how word polarity influences the overarching sentiment of a passage. To support our research, we annotated four novel Sentiment Text Classification and Part of Speech(SCPOS) datasets, building upon existing sentiment classification datasets. Furthermore, we developed a Universal Sentiment Analysis(USA) model, with a 7-billion parameter size. Experimental results revealed that our model surpassed the performance of gpt-3.5-t",
    "link": "http://arxiv.org/abs/2309.03787",
    "context": "Title: USA: Universal Sentiment Analysis Model & Construction of Japanese Sentiment Text Classification and Part of Speech Dataset. (arXiv:2309.03787v1 [cs.CL])\nAbstract: Sentiment analysis is a pivotal task in the domain of natural language processing. It encompasses both text-level sentiment polarity classification and word-level Part of Speech(POS) sentiment polarity determination. Such analysis challenges models to understand text holistically while also extracting nuanced information. With the rise of Large Language Models(LLMs), new avenues for sentiment analysis have opened. This paper proposes enhancing performance by leveraging the Mutual Reinforcement Effect(MRE) between individual words and the overall text. It delves into how word polarity influences the overarching sentiment of a passage. To support our research, we annotated four novel Sentiment Text Classification and Part of Speech(SCPOS) datasets, building upon existing sentiment classification datasets. Furthermore, we developed a Universal Sentiment Analysis(USA) model, with a 7-billion parameter size. Experimental results revealed that our model surpassed the performance of gpt-3.5-t",
    "path": "papers/23/09/2309.03787.json",
    "total_tokens": 891,
    "translated_title": "美国：通用情感分析模型和构建日语情感文本分类和词性数据集",
    "translated_abstract": "情感分析是自然语言处理领域的一个关键任务，它包括文本级情感极性分类和词级情感极性确定。这种分析挑战模型在全面理解文本的同时，提取细微的信息。随着大语言模型（LLM）的兴起，情感分析的新途径得以开展。本文提出通过利用单词和整个文本之间的互相增强效应（MRE）来提高性能。它深入探讨了单词极性对整个段落的情感的影响。为了支持我们的研究，我们标注了四个新颖的情感文本分类和词性（SCPOS）数据集，基于现有的情感分类数据集进行构建。此外，我们还开发了一个拥有70亿参数规模的通用情感分析（USA）模型。实验证实，我们的模型的性能超过了gpt-3.5-t。",
    "tldr": "本论文提出了一种通过利用单词和整个文本之间的互相增强效应来提高情感分析性能的通用情感分析模型，并构建了新的情感文本分类和词性数据集。该模型在实验中表现出超越gpt-3.5-t的性能。"
}