{
    "title": "LanSER: Language-Model Supported Speech Emotion Recognition. (arXiv:2309.03978v1 [cs.CL])",
    "abstract": "Speech emotion recognition (SER) models typically rely on costly human-labeled data for training, making scaling methods to large speech datasets and nuanced emotion taxonomies difficult. We present LanSER, a method that enables the use of unlabeled data by inferring weak emotion labels via pre-trained large language models through weakly-supervised learning. For inferring weak labels constrained to a taxonomy, we use a textual entailment approach that selects an emotion label with the highest entailment score for a speech transcript extracted via automatic speech recognition. Our experimental results show that models pre-trained on large datasets with this weak supervision outperform other baseline models on standard SER datasets when fine-tuned, and show improved label efficiency. Despite being pre-trained on labels derived only from text, we show that the resulting representations appear to model the prosodic content of speech.",
    "link": "http://arxiv.org/abs/2309.03978",
    "context": "Title: LanSER: Language-Model Supported Speech Emotion Recognition. (arXiv:2309.03978v1 [cs.CL])\nAbstract: Speech emotion recognition (SER) models typically rely on costly human-labeled data for training, making scaling methods to large speech datasets and nuanced emotion taxonomies difficult. We present LanSER, a method that enables the use of unlabeled data by inferring weak emotion labels via pre-trained large language models through weakly-supervised learning. For inferring weak labels constrained to a taxonomy, we use a textual entailment approach that selects an emotion label with the highest entailment score for a speech transcript extracted via automatic speech recognition. Our experimental results show that models pre-trained on large datasets with this weak supervision outperform other baseline models on standard SER datasets when fine-tuned, and show improved label efficiency. Despite being pre-trained on labels derived only from text, we show that the resulting representations appear to model the prosodic content of speech.",
    "path": "papers/23/09/2309.03978.json",
    "total_tokens": 918,
    "translated_title": "LanSER: 基于语言模型的语音情绪识别",
    "translated_abstract": "语音情绪识别（SER）模型通常依赖于昂贵的人工标注数据进行训练，使得对大型语音数据集和微妙情绪分类的扩展方法困难重重。我们提出了LanSER，一种通过预训练的大型语言模型通过弱监督学习来推测弱情绪标签，从而实现对未标记数据的使用。对于受到分类约束的弱标签推测，我们采用了一种文本蕴涵方法，通过自动语音识别提取的语音转录中选择一个具有最高蕴涵得分的情绪标签。我们的实验结果表明，使用这种弱监督训练的大型数据集预训练的模型在标准SER数据集上的性能超过其他基线模型，并显示出改进的标签效率。尽管只在文本上推测出的标签进行预训练，我们展示了所得到的表示似乎能够模拟语音的韵律内容。",
    "tldr": "LanSER是一种基于语言模型的语音情绪识别方法，通过预先训练的大型语言模型进行弱监督学习，从而使得可以利用未标记数据。实验证明，使用这种弱监督训练的模型在标准SER数据集上表现优于其他基线模型，并且能够模拟语音的韵律内容。",
    "en_tdlr": "LanSER is a language-model supported speech emotion recognition method that enables the use of unlabeled data by inferring weak emotion labels. Experimental results show that models pre-trained with weak supervision outperform other baseline models on standard SER datasets and capture the prosodic content of speech."
}