{
    "title": "Nonlinear Granger Causality using Kernel Ridge Regression. (arXiv:2309.05107v1 [stat.ML])",
    "abstract": "I introduce a novel algorithm and accompanying Python library, named mlcausality, designed for the identification of nonlinear Granger causal relationships. This novel algorithm uses a flexible plug-in architecture that enables researchers to employ any nonlinear regressor as the base prediction model. Subsequently, I conduct a comprehensive performance analysis of mlcausality when the prediction regressor is the kernel ridge regressor with the radial basis function kernel. The results demonstrate that mlcausality employing kernel ridge regression achieves competitive AUC scores across a diverse set of simulated data. Furthermore, mlcausality with kernel ridge regression yields more finely calibrated $p$-values in comparison to rival algorithms. This enhancement enables mlcausality to attain superior accuracy scores when using intuitive $p$-value-based thresholding criteria. Finally, mlcausality with the kernel ridge regression exhibits significantly reduced computation times compared ",
    "link": "http://arxiv.org/abs/2309.05107",
    "context": "Title: Nonlinear Granger Causality using Kernel Ridge Regression. (arXiv:2309.05107v1 [stat.ML])\nAbstract: I introduce a novel algorithm and accompanying Python library, named mlcausality, designed for the identification of nonlinear Granger causal relationships. This novel algorithm uses a flexible plug-in architecture that enables researchers to employ any nonlinear regressor as the base prediction model. Subsequently, I conduct a comprehensive performance analysis of mlcausality when the prediction regressor is the kernel ridge regressor with the radial basis function kernel. The results demonstrate that mlcausality employing kernel ridge regression achieves competitive AUC scores across a diverse set of simulated data. Furthermore, mlcausality with kernel ridge regression yields more finely calibrated $p$-values in comparison to rival algorithms. This enhancement enables mlcausality to attain superior accuracy scores when using intuitive $p$-value-based thresholding criteria. Finally, mlcausality with the kernel ridge regression exhibits significantly reduced computation times compared ",
    "path": "papers/23/09/2309.05107.json",
    "total_tokens": 867,
    "translated_title": "使用核岭回归的非线性 Granger 因果关系",
    "translated_abstract": "我引入了一种名为 mlcausality 的新算法和伴随的Python库，用于识别非线性 Granger 因果关系。该新算法使用了灵活的插件架构，使研究人员能够将任何非线性回归器作为基本的预测模型。随后，我对 mlcausality 进行了全面的性能分析，其中预测回归器为带有径向基函数核的核岭回归。结果表明，在多样化的模拟数据集上，mlcausality 使用核岭回归获得了竞争力的AUC得分。此外，与竞争算法相比，使用核岭回归的 mlcausality 产生更精细校准的 p 值。这种优化使得 mlcausality 在使用直观的 p 值阈值准则时获得了更高的准确度得分。最后，使用核岭回归的 mlcausality 显著降低了计算时间。",
    "tldr": "使用核岭回归的 mlcausality 是一种新的算法和Python库，用于识别非线性 Granger 因果关系，具有竞争力的性能和更精细校准的 p 值，以及显著降低的计算时间。",
    "en_tdlr": "mlcausality, a novel algorithm and Python library, employs kernel ridge regression to identify nonlinear Granger causal relationships. It achieves competitive performance with finely calibrated p-values and significantly reduced computation time."
}