{
    "title": "A Lightweight and Transferable Design for Robust LEGO Manipulation. (arXiv:2309.02354v2 [cs.RO] UPDATED)",
    "abstract": "LEGO is a well-known platform for prototyping pixelized objects. However, robotic LEGO prototyping (i.e. manipulating LEGO bricks) is challenging due to the tight connections and accuracy requirement. This paper investigates safe and efficient robotic LEGO manipulation. In particular, this paper reduces the complexity of the manipulation by hardware-software co-design. An end-of-arm tool (EOAT) is designed, which reduces the problem dimension and allows large industrial robots to easily manipulate LEGO bricks. In addition, this paper uses evolution strategy to safely optimize the robot motion for LEGO manipulation. Experiments demonstrate that the EOAT performs reliably in manipulating LEGO bricks and the learning framework can effectively and safely improve the manipulation performance to a 100% success rate. The co-design is deployed to multiple robots (i.e. FANUC LR-mate 200id/7L and Yaskawa GP4) to demonstrate its generalizability and transferability. In the end, we show that the p",
    "link": "http://arxiv.org/abs/2309.02354",
    "context": "Title: A Lightweight and Transferable Design for Robust LEGO Manipulation. (arXiv:2309.02354v2 [cs.RO] UPDATED)\nAbstract: LEGO is a well-known platform for prototyping pixelized objects. However, robotic LEGO prototyping (i.e. manipulating LEGO bricks) is challenging due to the tight connections and accuracy requirement. This paper investigates safe and efficient robotic LEGO manipulation. In particular, this paper reduces the complexity of the manipulation by hardware-software co-design. An end-of-arm tool (EOAT) is designed, which reduces the problem dimension and allows large industrial robots to easily manipulate LEGO bricks. In addition, this paper uses evolution strategy to safely optimize the robot motion for LEGO manipulation. Experiments demonstrate that the EOAT performs reliably in manipulating LEGO bricks and the learning framework can effectively and safely improve the manipulation performance to a 100% success rate. The co-design is deployed to multiple robots (i.e. FANUC LR-mate 200id/7L and Yaskawa GP4) to demonstrate its generalizability and transferability. In the end, we show that the p",
    "path": "papers/23/09/2309.02354.json",
    "total_tokens": 994,
    "translated_title": "一种轻量化且可传递的设计用于稳健的乐高操纵",
    "translated_abstract": "乐高是一个用于原型化像素化对象的众所周知的平台。然而，机器人乐高原型化（即操纵乐高积木）由于紧密的连接和精确性要求而具有挑战性。本文研究了安全高效的机器人乐高操纵。具体而言，本文通过硬件软件协同设计减少了操纵的复杂性。设计了一个末端工具（EOAT），它减少了问题维度，使大型工业机器人能够轻松操纵乐高积木。此外，本文使用进化策略安全地优化机器人运动，用于乐高操纵。实验表明，EOAT在操纵乐高积木方面表现可靠，而学习框架可以有效且安全地将操纵性能提高到100%的成功率。所设计的协同设计已经部署到多台机器人（FANUC LR-mate 200id/7L和Yaskawa GP4）上，以展示其普适性和可传递性。最后，我们展示了本研究的创新和贡献。",
    "tldr": "本文介绍了一种轻量化且可传递的设计，用于解决机器人乐高操纵中的复杂性和精确性要求。通过硬件软件协同设计和进化策略优化，实现了高效可靠的乐高操纵，并展示了该设计的普适性和可传递性。",
    "en_tdlr": "This paper presents a lightweight and transferable design for addressing the complexity and accuracy requirements in robotic LEGO manipulation. By utilizing hardware-software co-design and evolution strategy optimization, it achieves efficient and reliable LEGO manipulation, demonstrating the generalizability and transferability of the design."
}