{
    "title": "Graph-Aware Contrasting for Multivariate Time-Series Classification. (arXiv:2309.05202v2 [cs.LG] UPDATED)",
    "abstract": "Contrastive learning, as a self-supervised learning paradigm, becomes popular for Multivariate Time-Series (MTS) classification. It ensures the consistency across different views of unlabeled samples and then learns effective representations for these samples. Existing contrastive learning methods mainly focus on achieving temporal consistency with temporal augmentation and contrasting techniques, aiming to preserve temporal patterns against perturbations for MTS data. However, they overlook spatial consistency that requires the stability of individual sensors and their correlations. As MTS data typically originate from multiple sensors, ensuring spatial consistency becomes essential for the overall performance of contrastive learning on MTS data. Thus, we propose Graph-Aware Contrasting for spatial consistency across MTS data. Specifically, we propose graph augmentations including node and edge augmentations to preserve the stability of sensors and their correlations, followed by grap",
    "link": "http://arxiv.org/abs/2309.05202",
    "context": "Title: Graph-Aware Contrasting for Multivariate Time-Series Classification. (arXiv:2309.05202v2 [cs.LG] UPDATED)\nAbstract: Contrastive learning, as a self-supervised learning paradigm, becomes popular for Multivariate Time-Series (MTS) classification. It ensures the consistency across different views of unlabeled samples and then learns effective representations for these samples. Existing contrastive learning methods mainly focus on achieving temporal consistency with temporal augmentation and contrasting techniques, aiming to preserve temporal patterns against perturbations for MTS data. However, they overlook spatial consistency that requires the stability of individual sensors and their correlations. As MTS data typically originate from multiple sensors, ensuring spatial consistency becomes essential for the overall performance of contrastive learning on MTS data. Thus, we propose Graph-Aware Contrasting for spatial consistency across MTS data. Specifically, we propose graph augmentations including node and edge augmentations to preserve the stability of sensors and their correlations, followed by grap",
    "path": "papers/23/09/2309.05202.json",
    "total_tokens": 910,
    "translated_title": "多元时间序列分类中的图感知对比学习",
    "translated_abstract": "对比学习作为一种自监督学习范式，在多元时间序列（MTS）分类中变得流行起来。它确保了未标记样本的不同视图之间的一致性，然后学习这些样本的有效表示。现有的对比学习方法主要集中在通过时间扩增和对比技术实现时间一致性，旨在保护MTS数据的时间模式不受扰动。然而，它们忽视了需要确保传感器的稳定性和它们之间相关性的空间一致性。由于MTS数据通常来自多个传感器，确保空间一致性对于对比学习在MTS数据上的整体性能是至关重要的。因此，我们提出了一种图感知对比学习方法，用于实现MTS数据的空间一致性。具体而言，我们提出了包括节点和边扩增在内的图扩增，以保持传感器的稳定性和它们之间的相关性，然后应用图对比目标进行学习。",
    "tldr": "该论文提出了一种图感知对比学习方法，用于改进多元时间序列(MTS)分类任务。现有的对比学习方法忽视了MTS数据中的空间一致性，该方法通过图扩增和对比学习来保持传感器的稳定性和相关性，从而提高了对数据的表示能力。",
    "en_tdlr": "This paper proposes a graph-aware contrasting method to improve multivariate time-series (MTS) classification. Existing contrastive learning methods overlook spatial consistency in MTS data, while the proposed method preserves the stability and correlations of sensors through graph augmentation and contrasting, enhancing the representation learning capability for the data."
}