{
    "title": "Neuro-Visualizer: An Auto-encoder-based Loss Landscape Visualization Method. (arXiv:2309.14601v1 [cs.LG])",
    "abstract": "In recent years, there has been a growing interest in visualizing the loss landscape of neural networks. Linear landscape visualization methods, such as principal component analysis, have become widely used as they intuitively help researchers study neural networks and their training process. However, these linear methods suffer from limitations and drawbacks due to their lack of flexibility and low fidelity at representing the high dimensional landscape. In this paper, we present a novel auto-encoder-based non-linear landscape visualization method called Neuro-Visualizer that addresses these shortcoming and provides useful insights about neural network loss landscapes. To demonstrate its potential, we run experiments on a variety of problems in two separate applications of knowledge-guided machine learning (KGML). Our findings show that Neuro-Visualizer outperforms other linear and non-linear baselines and helps corroborate, and sometime challenge, claims proposed by machine learning ",
    "link": "http://arxiv.org/abs/2309.14601",
    "context": "Title: Neuro-Visualizer: An Auto-encoder-based Loss Landscape Visualization Method. (arXiv:2309.14601v1 [cs.LG])\nAbstract: In recent years, there has been a growing interest in visualizing the loss landscape of neural networks. Linear landscape visualization methods, such as principal component analysis, have become widely used as they intuitively help researchers study neural networks and their training process. However, these linear methods suffer from limitations and drawbacks due to their lack of flexibility and low fidelity at representing the high dimensional landscape. In this paper, we present a novel auto-encoder-based non-linear landscape visualization method called Neuro-Visualizer that addresses these shortcoming and provides useful insights about neural network loss landscapes. To demonstrate its potential, we run experiments on a variety of problems in two separate applications of knowledge-guided machine learning (KGML). Our findings show that Neuro-Visualizer outperforms other linear and non-linear baselines and helps corroborate, and sometime challenge, claims proposed by machine learning ",
    "path": "papers/23/09/2309.14601.json",
    "total_tokens": 903,
    "translated_title": "神经视觉化: 基于自动编码器的损失地形可视化方法",
    "translated_abstract": "在近年来，越来越多的研究者对神经网络的损失地形进行可视化感兴趣。线性的地形可视化方法，例如主成分分析，已经被广泛使用，因为它们直观地帮助研究者研究神经网络及其训练过程。然而，这些线性方法由于缺乏灵活性和低保真度以表示高维地形而受到限制和缺陷。在本文中，我们提出了一种新颖的基于自动编码器的非线性地形可视化方法Neuro-Visualizer，它解决了这些缺点，并提供了关于神经网络损失地形的有用见解。为了证明其潜力，我们在两个知识引导机器学习（KGML）应用的各种问题上进行了实验。我们的发现表明，Neuro-Visualizer优于其他线性和非线性基准，并有助于证实，并有时对机器学习提出的主张提出质疑。",
    "tldr": "Neuro-Visualizer是一种基于自动编码器的非线性地形可视化方法，可以更好地表示高维损失地形，通过对机器学习中的问题进行实验，证实其优于其他方法，并提供有关神经网络损失地形的有用见解。",
    "en_tdlr": "Neuro-Visualizer is a non-linear landscape visualization method based on auto-encoders that can better represent high-dimensional loss landscapes. By conducting experiments on machine learning problems, it outperforms other methods and provides useful insights about neural network loss landscapes."
}