{
    "title": "Geometry of vectorial martingale optimal transport and robust option pricing. (arXiv:2309.04947v1 [q-fin.MF])",
    "abstract": "This paper addresses robust finance, which is concerned with the development of models and approaches that account for market uncertainties. Specifically, we investigate the Vectorial Martingale Optimal Transport (VMOT) problem, the geometry of its solutions, and its application with robust option pricing problems in finance. To this end, we consider two-period market models and show that when the spatial dimension $d$ (the number of underlying assets) is 2, the extremal model for the cap option with a sub- or super-modular payout reduces to a single factor model in the first period, but not in general when $d > 2$. The result demonstrates a subtle relationship between spatial dimension, cost function supermodularity, and their effect on the geometry of solutions to the VMOT problem. We investigate applications of the model to financial problems and demonstrate how the dimensional reduction caused by monotonicity can be used to improve existing computational methods.",
    "link": "http://arxiv.org/abs/2309.04947",
    "context": "Title: Geometry of vectorial martingale optimal transport and robust option pricing. (arXiv:2309.04947v1 [q-fin.MF])\nAbstract: This paper addresses robust finance, which is concerned with the development of models and approaches that account for market uncertainties. Specifically, we investigate the Vectorial Martingale Optimal Transport (VMOT) problem, the geometry of its solutions, and its application with robust option pricing problems in finance. To this end, we consider two-period market models and show that when the spatial dimension $d$ (the number of underlying assets) is 2, the extremal model for the cap option with a sub- or super-modular payout reduces to a single factor model in the first period, but not in general when $d > 2$. The result demonstrates a subtle relationship between spatial dimension, cost function supermodularity, and their effect on the geometry of solutions to the VMOT problem. We investigate applications of the model to financial problems and demonstrate how the dimensional reduction caused by monotonicity can be used to improve existing computational methods.",
    "path": "papers/23/09/2309.04947.json",
    "total_tokens": 877,
    "translated_title": "向量鞅最优传输和鲁棒期权定价的几何学",
    "translated_abstract": "本文探讨了鲁棒金融问题，即考虑市场的不确定性的模型和方法的发展。具体地，我们研究了向量鞅最优传输（VMOT）问题的几何学及其在金融中鲁棒期权定价问题中的应用。为此，我们考虑了两期市场模型，并证明当空间维度$d$（基础资产的数量）为2时，帽式期权的极值模型可以化简为第一期的单因子模型，但是当$d>2$时并不一定成立。这个结果展示了空间维度、成本函数超模性以及它们对VMOT问题解的几何学的影响之间的复杂关系。我们还研究了模型在金融问题中的应用，并演示了通过单调性引起的降维如何用于改进现有的计算方法。",
    "tldr": "本文研究了向量鞅最优传输问题和鲁棒期权定价问题，发现空间维度和成本函数超模性对问题解的几何学有复杂的影响，并证明了通过单调性引起的降维可以改进计算方法。",
    "en_tdlr": "This paper investigates the Vectorial Martingale Optimal Transport problem and robust option pricing, discovering the complex relationship between spatial dimension and cost function supermodularity in the geometry of solutions, and demonstrating the use of dimensional reduction caused by monotonicity to improve computational methods."
}