{
    "title": "Topology-Agnostic Detection of Temporal Money Laundering Flows in Billion-Scale Transactions. (arXiv:2309.13662v1 [cs.LG])",
    "abstract": "Money launderers exploit the weaknesses in detection systems by purposefully placing their ill-gotten money into multiple accounts, at different banks. That money is then layered and moved around among mule accounts to obscure the origin and the flow of transactions. Consequently, the money is integrated into the financial system without raising suspicion. Path finding algorithms that aim at tracking suspicious flows of money usually struggle with scale and complexity. Existing community detection techniques also fail to properly capture the time-dependent relationships. This is particularly evident when performing analytics over massive transaction graphs. We propose a framework (called FaSTMAN), adapted for domain-specific constraints, to efficiently construct a temporal graph of sequential transactions. The framework includes a weighting method, using 2nd order graph representation, to quantify the significance of the edges. This method enables us to distribute complex queries on sm",
    "link": "http://arxiv.org/abs/2309.13662",
    "context": "Title: Topology-Agnostic Detection of Temporal Money Laundering Flows in Billion-Scale Transactions. (arXiv:2309.13662v1 [cs.LG])\nAbstract: Money launderers exploit the weaknesses in detection systems by purposefully placing their ill-gotten money into multiple accounts, at different banks. That money is then layered and moved around among mule accounts to obscure the origin and the flow of transactions. Consequently, the money is integrated into the financial system without raising suspicion. Path finding algorithms that aim at tracking suspicious flows of money usually struggle with scale and complexity. Existing community detection techniques also fail to properly capture the time-dependent relationships. This is particularly evident when performing analytics over massive transaction graphs. We propose a framework (called FaSTMAN), adapted for domain-specific constraints, to efficiently construct a temporal graph of sequential transactions. The framework includes a weighting method, using 2nd order graph representation, to quantify the significance of the edges. This method enables us to distribute complex queries on sm",
    "path": "papers/23/09/2309.13662.json",
    "total_tokens": 872,
    "translated_title": "十亿级交易中对时间性洗钱流的拓扑无关检测",
    "translated_abstract": "洗钱者通过将非法所得资金故意放入多个账户，并在不同的银行进行操作，来利用检测系统的弱点。这些资金随后被分层并在中间账户之间进行转移，以掩盖交易的来源和流动路径。因此，这些资金被无可疑地整合到金融系统中。追踪可疑资金流的路径查找算法通常在规模和复杂性方面存在困难。现有的社区检测技术也无法正确捕捉时间依赖关系，特别是在对大规模交易图进行分析时。我们提出了一个适用于特定领域约束的框架（称为FaSTMAN），以有效构建顺序交易的时间图。该框架包括一种权重化方法，使用二阶图表示来量化边的重要性。这种方法使我们能够在小规模机器上处理复杂的查询。",
    "tldr": "本研究提出了一个拓扑无关的方法来检测十亿级交易中的时间性洗钱流。该方法通过构建顺序交易的时间图，并使用权重化方法来量化边的重要性，实现了对复杂查询的高效处理。"
}