{
    "title": "Perception for Humanoid Robots. (arXiv:2309.15616v1 [cs.RO])",
    "abstract": "Purpose of Review: The field of humanoid robotics, perception plays a fundamental role in enabling robots to interact seamlessly with humans and their surroundings, leading to improved safety, efficiency, and user experience. This scientific study investigates various perception modalities and techniques employed in humanoid robots, including visual, auditory, and tactile sensing by exploring recent state-of-the-art approaches for perceiving and understanding the internal state, the environment, objects, and human activities.  Recent Findings: Internal state estimation makes extensive use of Bayesian filtering methods and optimization techniques based on maximum a-posteriori formulation by utilizing proprioceptive sensing. In the area of external environment understanding, with an emphasis on robustness and adaptability to dynamic, unforeseen environmental changes, the new slew of research discussed in this study have focused largely on multi-sensor fusion and machine learning in contr",
    "link": "http://arxiv.org/abs/2309.15616",
    "context": "Title: Perception for Humanoid Robots. (arXiv:2309.15616v1 [cs.RO])\nAbstract: Purpose of Review: The field of humanoid robotics, perception plays a fundamental role in enabling robots to interact seamlessly with humans and their surroundings, leading to improved safety, efficiency, and user experience. This scientific study investigates various perception modalities and techniques employed in humanoid robots, including visual, auditory, and tactile sensing by exploring recent state-of-the-art approaches for perceiving and understanding the internal state, the environment, objects, and human activities.  Recent Findings: Internal state estimation makes extensive use of Bayesian filtering methods and optimization techniques based on maximum a-posteriori formulation by utilizing proprioceptive sensing. In the area of external environment understanding, with an emphasis on robustness and adaptability to dynamic, unforeseen environmental changes, the new slew of research discussed in this study have focused largely on multi-sensor fusion and machine learning in contr",
    "path": "papers/23/09/2309.15616.json",
    "total_tokens": 935,
    "translated_title": "人形机器人的感知",
    "translated_abstract": "复审目的：在人形机器人领域，感知在使机器人与人类和环境无缝互动方面起着基础性作用，从而提高安全性、效率和用户体验。本科学研究调查了人形机器人中使用的各种感知模式和技术，包括视觉、听觉和触觉感知，通过探索最新的感知和理解内部状态、环境、物体和人类活动的最新方法。最新发现：内部状态估计广泛使用基于贝叶斯滤波方法和基于最大后验公式的优化技术，利用本体感知。在外部环境理解方面，重点是对动态、不可预见的环境变化具有鲁棒性和适应性，本研究中讨论的新一批研究主要集中在多传感器融合和机器学习上。",
    "tldr": "这项科学研究调查了人形机器人中使用的各种感知模式和技术，并研究了最新的方法来感知和理解内部状态、环境、物体和人类活动。最重要的创新是在内部状态估计中使用贝叶斯滤波方法和最大后验公式的优化技术，并在外部环境理解中利用多传感器融合和机器学习来增强鲁棒性和适应性。",
    "en_tdlr": "This scientific study investigates various perception modalities and techniques employed in humanoid robots, exploring the recent advancements in perceiving and understanding internal states, environments, objects, and human activities. The major contributions include the use of Bayesian filtering and maximum a-posteriori optimization techniques in internal state estimation, as well as the integration of multi-sensor fusion and machine learning for robust and adaptable external environment understanding."
}