{
    "title": "Data-driven Reachability using Christoffel Functions and Conformal Prediction. (arXiv:2309.08976v1 [cs.LG])",
    "abstract": "An important mathematical tool in the analysis of dynamical systems is the approximation of the reach set, i.e., the set of states reachable after a given time from a given initial state. This set is difficult to compute for complex systems even if the system dynamics are known and given by a system of ordinary differential equations with known coefficients. In practice, parameters are often unknown and mathematical models difficult to obtain. Data-based approaches are promised to avoid these difficulties by estimating the reach set based on a sample of states. If a model is available, this training set can be obtained through numerical simulation. In the absence of a model, real-life observations can be used instead. A recently proposed approach for data-based reach set approximation uses Christoffel functions to approximate the reach set. Under certain assumptions, the approximation is guaranteed to converge to the true solution. In this paper, we improve upon these results by notabl",
    "link": "http://arxiv.org/abs/2309.08976",
    "context": "Title: Data-driven Reachability using Christoffel Functions and Conformal Prediction. (arXiv:2309.08976v1 [cs.LG])\nAbstract: An important mathematical tool in the analysis of dynamical systems is the approximation of the reach set, i.e., the set of states reachable after a given time from a given initial state. This set is difficult to compute for complex systems even if the system dynamics are known and given by a system of ordinary differential equations with known coefficients. In practice, parameters are often unknown and mathematical models difficult to obtain. Data-based approaches are promised to avoid these difficulties by estimating the reach set based on a sample of states. If a model is available, this training set can be obtained through numerical simulation. In the absence of a model, real-life observations can be used instead. A recently proposed approach for data-based reach set approximation uses Christoffel functions to approximate the reach set. Under certain assumptions, the approximation is guaranteed to converge to the true solution. In this paper, we improve upon these results by notabl",
    "path": "papers/23/09/2309.08976.json",
    "total_tokens": 867,
    "translated_title": "基于克里斯托费尔函数和共形预测的数据驱动可达性分析",
    "translated_abstract": "在动力系统分析中，一种重要的数学工具是近似可达集合，即从给定初始状态经过一定时间可以到达的状态集合。即使系统动力学已知且由已知系数的常微分方程组给出，对复杂系统来说，该集合很难计算。在实践中，参数常常是未知的，数学模型难以获得。数据驱动的方法通过基于状态样本估算可达集合来避免这些困难。如果有模型可用，可以通过数值模拟获得训练集。在没有模型的情况下，可以使用实际观测结果。最近提出的一种数据驱动可达集合近似方法使用克里斯托费尔函数来近似可达集合。在一定的假设下，这种近似方法可以收敛到真实解。在本文中，我们改进了这些结果，尤其是可达集合近似的准确性。",
    "tldr": "这篇论文介绍了一种使用克里斯托费尔函数和共形预测进行数据驱动的可达性分析方法，能够有效估计复杂系统的可达集合，而不依赖于已知的数学模型。"
}