{
    "title": "On the Power of the Weisfeiler-Leman Test for Graph Motif Parameters. (arXiv:2309.17053v1 [cs.LG])",
    "abstract": "Seminal research in the field of graph neural networks (GNNs) has revealed a direct correspondence between the expressive capabilities of GNNs and the $k$-dimensional Weisfeiler-Leman ($k$WL) test, a widely-recognized method for verifying graph isomorphism. This connection has reignited interest in comprehending the specific graph properties effectively distinguishable by the $k$WL test. A central focus of research in this field revolves around determining the least dimensionality $k$, for which $k$WL can discern graphs with different number of occurrences of a pattern graph $P$. We refer to such a least $k$ as the WL-dimension of this pattern counting problem. This inquiry traditionally delves into two distinct counting problems related to patterns: subgraph counting and induced subgraph counting. Intriguingly, despite their initial appearance as separate challenges with seemingly divergent approaches, both of these problems are interconnected components of a more comprehensive proble",
    "link": "http://arxiv.org/abs/2309.17053",
    "context": "Title: On the Power of the Weisfeiler-Leman Test for Graph Motif Parameters. (arXiv:2309.17053v1 [cs.LG])\nAbstract: Seminal research in the field of graph neural networks (GNNs) has revealed a direct correspondence between the expressive capabilities of GNNs and the $k$-dimensional Weisfeiler-Leman ($k$WL) test, a widely-recognized method for verifying graph isomorphism. This connection has reignited interest in comprehending the specific graph properties effectively distinguishable by the $k$WL test. A central focus of research in this field revolves around determining the least dimensionality $k$, for which $k$WL can discern graphs with different number of occurrences of a pattern graph $P$. We refer to such a least $k$ as the WL-dimension of this pattern counting problem. This inquiry traditionally delves into two distinct counting problems related to patterns: subgraph counting and induced subgraph counting. Intriguingly, despite their initial appearance as separate challenges with seemingly divergent approaches, both of these problems are interconnected components of a more comprehensive proble",
    "path": "papers/23/09/2309.17053.json",
    "total_tokens": 869,
    "translated_title": "关于Weisfeiler-Leman测试在图形模式参数中的能力",
    "translated_abstract": "图神经网络（GNN）领域的重要研究揭示了图神经网络的表达能力与$k$维Weisfeiler-Leman（$k$WL）测试之间的直接对应关系，$k$WL测试是一种广为认可的用于验证图同构的方法。这个连接重新引发了人们对$k$WL测试能够有效区分的特定图属性的兴趣。这个领域的研究的中心是确定最小维度$k$，使得$k$WL可以区分具有不同出现次数的模式图$P$的图形。我们将这个最小$k$称为这个模式计数问题的WL维度。这个调查传统上探讨与图案相关的两个不同的计数问题：子图计数和诱导子图计数。有趣的是，尽管它们最初看起来是具有看似不同方法的独立挑战，但这两个问题都是一个更全面问题的相互关联部分。",
    "tldr": "这项研究探讨了图神经网络（GNN）表达能力和$k$维Weisfeiler-Leman ($k$WL)测试之间的关系，研究发现了$k$WL测试可以有效区分具有不同出现次数的模式图$P$的图形，并研究了模式图计数问题的最小维度$k$。"
}