{
    "title": "Improving the State of the Art for Training Human-AI Teams: Technical Report #1 -- Results of Subject-Matter Expert Knowledge Elicitation Survey. (arXiv:2309.03211v1 [cs.HC])",
    "abstract": "A consensus report produced for the Air Force Research Laboratory by the National Academies of Sciences, Engineering, and Mathematics documented a prevalent and increasing desire to support human-Artificial Intelligence (AI) teaming across military service branches. Sonalysts has begun an internal initiative to explore the training of human-AI teams. The first step in this effort is to develop a Synthetic Task Environment (STE) that is capable of facilitating research on human-AI teams. We decided to use Joint All-Domain Command and Control (JADC2) as a focus point for developing the STE because the volume of sensor inputs and decision options within the JADC2 concept likely requires the use of AI systems to enable timely decisions. Given this focus, we engaged a number of Subject-Matter Experts (SMEs) with Command and Control experience to gain insight into developing a STE that embodied the teaming challenges associated with JADC2. This report documents our initial engagement with th",
    "link": "http://arxiv.org/abs/2309.03211",
    "context": "Title: Improving the State of the Art for Training Human-AI Teams: Technical Report #1 -- Results of Subject-Matter Expert Knowledge Elicitation Survey. (arXiv:2309.03211v1 [cs.HC])\nAbstract: A consensus report produced for the Air Force Research Laboratory by the National Academies of Sciences, Engineering, and Mathematics documented a prevalent and increasing desire to support human-Artificial Intelligence (AI) teaming across military service branches. Sonalysts has begun an internal initiative to explore the training of human-AI teams. The first step in this effort is to develop a Synthetic Task Environment (STE) that is capable of facilitating research on human-AI teams. We decided to use Joint All-Domain Command and Control (JADC2) as a focus point for developing the STE because the volume of sensor inputs and decision options within the JADC2 concept likely requires the use of AI systems to enable timely decisions. Given this focus, we engaged a number of Subject-Matter Experts (SMEs) with Command and Control experience to gain insight into developing a STE that embodied the teaming challenges associated with JADC2. This report documents our initial engagement with th",
    "path": "papers/23/09/2309.03211.json",
    "total_tokens": 930,
    "translated_title": "提高针对人工智能团队培训的现状：技术报告＃1-科学家涉及调查的结果",
    "translated_abstract": "国家科学工程学院为空军研究实验室制定了一份一致性报告，记录了军事各个服务部门支持人工智能与人类团队合作的普遍愿望。Sonalysts已经开始了一个内部计划，探索人工智能团队的培训。在这一努力的第一步是开发一个能够促进人工智能团队研究的合成任务环境（STE）。我们决定以联合全领域指挥与控制（JADC2）为焦点来开发STE，因为JADC2概念内的传感器输入和决策选择体量很可能需要使用人工智能系统以实现及时决策。基于这一焦点，我们与具有指挥与控制经验的多位学科专家（SMEs）进行了接触，以了解开发一个体现与JADC2相关的团队合作挑战的STE的见解。本报告记录了我们与这些SMEs的初步接触。",
    "tldr": "这项研究旨在提高人工智能与人类团队合作的培训水平，并通过开发合成任务环境来解决联合全领域指挥与控制中的团队合作挑战。",
    "en_tdlr": "This research aims to improve the training of human-AI teams and address the challenges of teaming in Joint All-Domain Command and Control through the development of a Synthetic Task Environment."
}