{
    "title": "DFRD: Data-Free Robustness Distillation for Heterogeneous Federated Learning. (arXiv:2309.13546v2 [cs.CV] UPDATED)",
    "abstract": "Federated Learning (FL) is a privacy-constrained decentralized machine learning paradigm in which clients enable collaborative training without compromising private data. However, how to learn a robust global model in the data-heterogeneous and model-heterogeneous FL scenarios is challenging. To address it, we resort to data-free knowledge distillation to propose a new FL method (namely DFRD). DFRD equips a conditional generator on the server to approximate the training space of the local models uploaded by clients, and systematically investigates its training in terms of fidelity, transferability} and diversity. To overcome the catastrophic forgetting of the global model caused by the distribution shifts of the generator across communication rounds, we maintain an exponential moving average copy of the generator on the server. Additionally, we propose dynamic weighting and label sampling to accurately extract knowledge from local models. Finally, our extensive experiments on various i",
    "link": "http://arxiv.org/abs/2309.13546",
    "context": "Title: DFRD: Data-Free Robustness Distillation for Heterogeneous Federated Learning. (arXiv:2309.13546v2 [cs.CV] UPDATED)\nAbstract: Federated Learning (FL) is a privacy-constrained decentralized machine learning paradigm in which clients enable collaborative training without compromising private data. However, how to learn a robust global model in the data-heterogeneous and model-heterogeneous FL scenarios is challenging. To address it, we resort to data-free knowledge distillation to propose a new FL method (namely DFRD). DFRD equips a conditional generator on the server to approximate the training space of the local models uploaded by clients, and systematically investigates its training in terms of fidelity, transferability} and diversity. To overcome the catastrophic forgetting of the global model caused by the distribution shifts of the generator across communication rounds, we maintain an exponential moving average copy of the generator on the server. Additionally, we propose dynamic weighting and label sampling to accurately extract knowledge from local models. Finally, our extensive experiments on various i",
    "path": "papers/23/09/2309.13546.json",
    "total_tokens": 919,
    "translated_title": "DFRD: 无数据鲁棒性蒸馏技术用于异构联邦学习",
    "translated_abstract": "联邦学习是一种隐私受限的分散式机器学习范式，客户端可以进行协作训练而不泄露私密数据。然而，在数据异构和模型异构的联邦学习场景中学习一个鲁棒的全局模型是具有挑战性的。为了解决这个问题，我们采用无数据知识蒸馏技术，提出了一种新的联邦学习方法（DFRD）。DFRD在服务器上配备一个条件生成器，以近似客户端上传的局部模型的训练空间，并在生成器的分布转移引起的沟通轮次中保持服务器上的指数移动平均副本，以克服全局模型的灾难性遗忘。此外，我们还提出了动态加权和标签抽样，以准确地提取局部模型的知识。最后，在不同的实验中进行了广泛的实验验证。",
    "tldr": "这项研究提出了一种用于异构联邦学习的DFRD方法，通过使用无数据知识蒸馏技术，利用服务器上的条件生成器近似局部模型的训练空间，并采用动态加权和标签抽样来准确提取知识。实验证明了该方法的有效性。",
    "en_tdlr": "This study proposes DFRD, a method for heterogeneous federated learning, which utilizes data-free knowledge distillation to approximate the training space of local models using a conditional generator on the server, and employs dynamic weighting and label sampling for accurate knowledge extraction. Extensive experiments validate the effectiveness of this approach."
}