{
    "title": "A Unified View Between Tensor Hypergraph Neural Networks And Signal Denoising. (arXiv:2309.08385v1 [cs.LG])",
    "abstract": "Hypergraph Neural networks (HyperGNNs) and hypergraph signal denoising (HyperGSD) are two fundamental topics in higher-order network modeling. Understanding the connection between these two domains is particularly useful for designing novel HyperGNNs from a HyperGSD perspective, and vice versa. In particular, the tensor-hypergraph convolutional network (T-HGCN) has emerged as a powerful architecture for preserving higher-order interactions on hypergraphs, and this work shows an equivalence relation between a HyperGSD problem and the T-HGCN. Inspired by this intriguing result, we further design a tensor-hypergraph iterative network (T-HGIN) based on the HyperGSD problem, which takes advantage of a multi-step updating scheme in every single layer. Numerical experiments are conducted to show the promising applications of the proposed T-HGIN approach.",
    "link": "http://arxiv.org/abs/2309.08385",
    "context": "Title: A Unified View Between Tensor Hypergraph Neural Networks And Signal Denoising. (arXiv:2309.08385v1 [cs.LG])\nAbstract: Hypergraph Neural networks (HyperGNNs) and hypergraph signal denoising (HyperGSD) are two fundamental topics in higher-order network modeling. Understanding the connection between these two domains is particularly useful for designing novel HyperGNNs from a HyperGSD perspective, and vice versa. In particular, the tensor-hypergraph convolutional network (T-HGCN) has emerged as a powerful architecture for preserving higher-order interactions on hypergraphs, and this work shows an equivalence relation between a HyperGSD problem and the T-HGCN. Inspired by this intriguing result, we further design a tensor-hypergraph iterative network (T-HGIN) based on the HyperGSD problem, which takes advantage of a multi-step updating scheme in every single layer. Numerical experiments are conducted to show the promising applications of the proposed T-HGIN approach.",
    "path": "papers/23/09/2309.08385.json",
    "total_tokens": 863,
    "translated_title": "《张量超图神经网络与信号去噪之间的统一视角》",
    "translated_abstract": "张量超图神经网络（HyperGNNs）和超图信号去噪（HyperGSD）是高阶网络建模中的两个基本主题。了解这两个领域之间的联系对于从HyperGSD的角度设计新的HyperGNNs以及反之亦然非常有用。特别地，张量超图卷积网络（T-HGCN）已经成为在超图上保留高阶交互的强大结构，并且这项工作展示了HyperGSD问题与T-HGCN之间的等价关系。受到这一有趣结果的启发，我们进一步设计了一种基于HyperGSD问题的张量超图迭代网络（T-HGIN），它在每个单层中利用了多步更新方案的优势。数值实验被进行以展示所提出的T-HGIN方法的有希望的应用。",
    "tldr": "这篇论文提出了一种统一视角，将张量超图神经网络（HyperGNNs）和超图信号去噪（HyperGSD）联系起来，并通过设计了张量超图迭代网络（T-HGIN）来应用于信号去噪问题。实验结果显示了该方法的潜在应用价值。",
    "en_tdlr": "This paper presents a unified view connecting tensor hypergraph neural networks (HyperGNNs) and hypergraph signal denoising (HyperGSD), and proposes a tensor-hypergraph iterative network (T-HGIN) for signal denoising. Numerical experiments demonstrate the potential applications of this approach."
}