{
    "title": "Out of Distribution Detection via Domain-Informed Gaussian Process State Space Models. (arXiv:2309.06655v1 [cs.RO])",
    "abstract": "In order for robots to safely navigate in unseen scenarios using learning-based methods, it is important to accurately detect out-of-training-distribution (OoD) situations online. Recently, Gaussian process state-space models (GPSSMs) have proven useful to discriminate unexpected observations by comparing them against probabilistic predictions. However, the capability for the model to correctly distinguish between in- and out-of-training distribution observations hinges on the accuracy of these predictions, primarily affected by the class of functions the GPSSM kernel can represent. In this paper, we propose (i) a novel approach to embed existing domain knowledge in the kernel and (ii) an OoD online runtime monitor, based on receding-horizon predictions. Domain knowledge is assumed given as a dataset collected either in simulation or using a nominal model. Numerical results show that the informed kernel yields better regression quality with smaller datasets, as compared to standard ker",
    "link": "http://arxiv.org/abs/2309.06655",
    "context": "Title: Out of Distribution Detection via Domain-Informed Gaussian Process State Space Models. (arXiv:2309.06655v1 [cs.RO])\nAbstract: In order for robots to safely navigate in unseen scenarios using learning-based methods, it is important to accurately detect out-of-training-distribution (OoD) situations online. Recently, Gaussian process state-space models (GPSSMs) have proven useful to discriminate unexpected observations by comparing them against probabilistic predictions. However, the capability for the model to correctly distinguish between in- and out-of-training distribution observations hinges on the accuracy of these predictions, primarily affected by the class of functions the GPSSM kernel can represent. In this paper, we propose (i) a novel approach to embed existing domain knowledge in the kernel and (ii) an OoD online runtime monitor, based on receding-horizon predictions. Domain knowledge is assumed given as a dataset collected either in simulation or using a nominal model. Numerical results show that the informed kernel yields better regression quality with smaller datasets, as compared to standard ker",
    "path": "papers/23/09/2309.06655.json",
    "total_tokens": 927,
    "translated_title": "通过基于领域信息的高斯过程状态空间模型实现未知领域检测",
    "translated_abstract": "为了使机器人能够使用基于学习的方法在未知情景中安全导航，准确地在线检测训练集之外的情况是非常重要的。近年来，高斯过程状态空间模型（GPSSM）已被证明是一种有效的方法，通过将不确定的观测与概率预测进行比较来区分它们。然而，模型能够正确区分训练集内外的观测取决于预测的准确性，主要受到GPSSM内核所能表示的函数类的影响。本文提出了一种新颖的方法，将现有领域知识嵌入内核中，并基于递归地预测构建了一个在线运行时的未知领域监视器。领域知识假设以在模拟中收集的数据集或使用名义模型。数值结果表明，对于较小的数据集，带有领域信息的内核提供了更好的回归质量，与标准内核相比。",
    "tldr": "本文提出了一种通过嵌入领域知识的高斯过程状态空间模型，以实现未知领域的检测，并基于递归预测构建了在线的监视器。数值结果表明，带有领域信息的内核可以提供更好的回归质量。",
    "en_tdlr": "This paper proposes a novel approach to detect unknown domains using domain-informed Gaussian process state space models. It also introduces an online monitor based on recursive predictions. Experimental results demonstrate that the informed kernel leads to better regression quality compared to standard kernel."
}