{
    "title": "Balanced and Explainable Social Media Analysis for Public Health with Large Language Models. (arXiv:2309.05951v1 [cs.CL])",
    "abstract": "As social media becomes increasingly popular, more and more public health activities emerge, which is worth noting for pandemic monitoring and government decision-making. Current techniques for public health analysis involve popular models such as BERT and large language models (LLMs). Although recent progress in LLMs has shown a strong ability to comprehend knowledge by being fine-tuned on specific domain datasets, the costs of training an in-domain LLM for every specific public health task are especially expensive. Furthermore, such kinds of in-domain datasets from social media are generally highly imbalanced, which will hinder the efficiency of LLMs tuning. To tackle these challenges, the data imbalance issue can be overcome by sophisticated data augmentation methods for social media datasets. In addition, the ability of the LLMs can be effectively utilised by prompting the model properly. In light of the above discussion, in this paper, a novel ALEX framework is proposed for social",
    "link": "http://arxiv.org/abs/2309.05951",
    "context": "Title: Balanced and Explainable Social Media Analysis for Public Health with Large Language Models. (arXiv:2309.05951v1 [cs.CL])\nAbstract: As social media becomes increasingly popular, more and more public health activities emerge, which is worth noting for pandemic monitoring and government decision-making. Current techniques for public health analysis involve popular models such as BERT and large language models (LLMs). Although recent progress in LLMs has shown a strong ability to comprehend knowledge by being fine-tuned on specific domain datasets, the costs of training an in-domain LLM for every specific public health task are especially expensive. Furthermore, such kinds of in-domain datasets from social media are generally highly imbalanced, which will hinder the efficiency of LLMs tuning. To tackle these challenges, the data imbalance issue can be overcome by sophisticated data augmentation methods for social media datasets. In addition, the ability of the LLMs can be effectively utilised by prompting the model properly. In light of the above discussion, in this paper, a novel ALEX framework is proposed for social",
    "path": "papers/23/09/2309.05951.json",
    "total_tokens": 927,
    "translated_title": "利用大型语言模型进行公共卫生的平衡和可解释性社交媒体分析",
    "translated_abstract": "随着社交媒体的越来越流行，越来越多的公共卫生活动出现，这对于疫情监测和政府决策非常值得注意。当前的公共卫生分析技术涉及BERT和大型语言模型（LLM）等流行模型。尽管LLMs的最新进展表明通过在特定领域数据集上进行微调，它们具有强大的理解知识的能力，但为每个特定的公共卫生任务训练一个领域内LLM的成本尤为昂贵。此外，来自社交媒体的此类领域内数据集通常具有严重的不平衡性，这将妨碍LLMs的调优效率。为解决这些挑战，可以采用复杂的数据增强方法来克服数据不平衡问题。此外，通过适当地引导模型，可以有效利用LLMs的能力。基于以上讨论，在本文中，提出了一种新的ALEX框架，用于社交媒体的平衡和可解释性的公共卫生分析。",
    "tldr": "提出了一种用于社交媒体的平衡和可解释性的公共卫生分析框架ALEX，通过采用复杂的数据增强方法来克服数据不平衡问题，并有效利用大型语言模型的能力。"
}