{
    "title": "Latent Disentanglement in Mesh Variational Autoencoders Improves the Diagnosis of Craniofacial Syndromes and Aids Surgical Planning. (arXiv:2309.10825v1 [eess.IV])",
    "abstract": "The use of deep learning to undertake shape analysis of the complexities of the human head holds great promise. However, there have traditionally been a number of barriers to accurate modelling, especially when operating on both a global and local level. In this work, we will discuss the application of the Swap Disentangled Variational Autoencoder (SD-VAE) with relevance to Crouzon, Apert and Muenke syndromes. Although syndrome classification is performed on the entire mesh, it is also possible, for the first time, to analyse the influence of each region of the head on the syndromic phenotype. By manipulating specific parameters of the generative model, and producing procedure-specific new shapes, it is also possible to simulate the outcome of a range of craniofacial surgical procedures. This opens new avenues to advance diagnosis, aids surgical planning and allows for the objective evaluation of surgical outcomes.",
    "link": "http://arxiv.org/abs/2309.10825",
    "context": "Title: Latent Disentanglement in Mesh Variational Autoencoders Improves the Diagnosis of Craniofacial Syndromes and Aids Surgical Planning. (arXiv:2309.10825v1 [eess.IV])\nAbstract: The use of deep learning to undertake shape analysis of the complexities of the human head holds great promise. However, there have traditionally been a number of barriers to accurate modelling, especially when operating on both a global and local level. In this work, we will discuss the application of the Swap Disentangled Variational Autoencoder (SD-VAE) with relevance to Crouzon, Apert and Muenke syndromes. Although syndrome classification is performed on the entire mesh, it is also possible, for the first time, to analyse the influence of each region of the head on the syndromic phenotype. By manipulating specific parameters of the generative model, and producing procedure-specific new shapes, it is also possible to simulate the outcome of a range of craniofacial surgical procedures. This opens new avenues to advance diagnosis, aids surgical planning and allows for the objective evaluation of surgical outcomes.",
    "path": "papers/23/09/2309.10825.json",
    "total_tokens": 881,
    "translated_title": "网格变分自编码器中的潜在解缠构架在脑颅综合症的诊断和手术规划中有所改进",
    "translated_abstract": "使用深度学习对人类头部的形状进行分析具有很大的潜力。然而，在全局和局部水平上准确建模一直存在一些障碍。在本研究中，我们将讨论交换解缠变分自编码器（SD-VAE）在Crouzon、Apert和Muenke综合征方面的应用。虽然综合症分类是在整个网格上进行的，但首次可以分析头部每个区域对综合症表型的影响。通过操纵生成模型的特定参数，并产生特定手术的新形状，还可以模拟一系列颅颜面手术的结果。这打开了推动诊断进展、帮助手术规划和实施手术结果客观评估的新途径。",
    "tldr": "本研究改进了网格变分自编码器中的潜在解缠构架，可以提高脑颅综合症的诊断准确性，同时辅助手术规划，并允许客观评估手术结果。",
    "en_tdlr": "This study improves the latent disentanglement in mesh variational autoencoders, which enhances the accuracy of diagnosing craniofacial syndromes and aids in surgical planning, allowing for objective evaluation of surgical outcomes."
}