{
    "title": "Algebraic Models for Qualified Aggregation in General Rough Sets, and Reasoning Bias Discovery. (arXiv:2309.03217v1 [cs.AI])",
    "abstract": "In the context of general rough sets, the act of combining two things to form another is not straightforward. The situation is similar for other theories that concern uncertainty and vagueness. Such acts can be endowed with additional meaning that go beyond structural conjunction and disjunction as in the theory of $*$-norms and associated implications over $L$-fuzzy sets. In the present research, algebraic models of acts of combining things in generalized rough sets over lattices with approximation operators (called rough convenience lattices) is invented. The investigation is strongly motivated by the desire to model skeptical or pessimistic, and optimistic or possibilistic aggregation in human reasoning, and the choice of operations is constrained by the perspective. Fundamental results on the weak negations and implications afforded by the minimal models are proved. In addition, the model is suitable for the study of discriminatory/toxic behavior in human reasoning, and of ML algor",
    "link": "http://arxiv.org/abs/2309.03217",
    "context": "Title: Algebraic Models for Qualified Aggregation in General Rough Sets, and Reasoning Bias Discovery. (arXiv:2309.03217v1 [cs.AI])\nAbstract: In the context of general rough sets, the act of combining two things to form another is not straightforward. The situation is similar for other theories that concern uncertainty and vagueness. Such acts can be endowed with additional meaning that go beyond structural conjunction and disjunction as in the theory of $*$-norms and associated implications over $L$-fuzzy sets. In the present research, algebraic models of acts of combining things in generalized rough sets over lattices with approximation operators (called rough convenience lattices) is invented. The investigation is strongly motivated by the desire to model skeptical or pessimistic, and optimistic or possibilistic aggregation in human reasoning, and the choice of operations is constrained by the perspective. Fundamental results on the weak negations and implications afforded by the minimal models are proved. In addition, the model is suitable for the study of discriminatory/toxic behavior in human reasoning, and of ML algor",
    "path": "papers/23/09/2309.03217.json",
    "total_tokens": 888,
    "translated_title": "泛粗糙集中的合格聚合的代数模型及推理偏差发现",
    "translated_abstract": "在泛粗糙集的背景下，将两个事物组合成另一个并非直接。对于涉及不确定性和模糊性的其他理论也是如此。这种行为可以赋予额外的意义，超越了结构上的合取和析取，就像$L$模糊集上的$*$-范数理论和相关推导一样。在本研究中，我们发明了在具有近似算子（称为粗糙便利格）的格上将事物组合的代数模型。研究受到要建模怀疑论或悲观论和乐观论合并于人类推理，以及操作选择被观点所约束的动机的强烈推动。证明了最小模型提供的弱否定和推导的基本结果。此外，该模型适用于研究人类推理中的歧视/有害行为和机器学习算法。",
    "tldr": "本研究提出了一种泛粗糙集中合格聚合的代数模型，用于模拟人类推理中的悲观和乐观的合并，以及研究推理中的歧视/有害行为和机器学习算法。"
}