{
    "title": "Wordle: A Microcosm of Life. Luck, Skill, Cheating, Loyalty, and Influence!. (arXiv:2309.02110v2 [math.HO] UPDATED)",
    "abstract": "Wordle is a popular, online word game offered by the New York Times (nytimes.com). Currently there are some 2 million players of the English version worldwide. Players have 6 attempts to guess the daily word (target word) and after each attempt, the player receives color-coded information about the correctness and position of each letter in the guess. After either a successful completion of the puzzle or the final unsuccessful attempt, software can assess the player's luck and skill using Information Theory and can display data for the first, second, ..., sixth guesses of a random sample of all players. Recently, I discovered that the latter data is presented in a format that can easily be copied and pasted into a spreadsheet. I compiled data on Wordle players' first guesses from May 2023 - August 2023 and inferred some interesting information about Wordle players. A) Every day, about 0.2-0.5% of players solve the puzzle in one attempt. Because the odds of guessing the one of 2,315 pos",
    "link": "http://arxiv.org/abs/2309.02110",
    "context": "Title: Wordle: A Microcosm of Life. Luck, Skill, Cheating, Loyalty, and Influence!. (arXiv:2309.02110v2 [math.HO] UPDATED)\nAbstract: Wordle is a popular, online word game offered by the New York Times (nytimes.com). Currently there are some 2 million players of the English version worldwide. Players have 6 attempts to guess the daily word (target word) and after each attempt, the player receives color-coded information about the correctness and position of each letter in the guess. After either a successful completion of the puzzle or the final unsuccessful attempt, software can assess the player's luck and skill using Information Theory and can display data for the first, second, ..., sixth guesses of a random sample of all players. Recently, I discovered that the latter data is presented in a format that can easily be copied and pasted into a spreadsheet. I compiled data on Wordle players' first guesses from May 2023 - August 2023 and inferred some interesting information about Wordle players. A) Every day, about 0.2-0.5% of players solve the puzzle in one attempt. Because the odds of guessing the one of 2,315 pos",
    "path": "papers/23/09/2309.02110.json",
    "total_tokens": 1026,
    "translated_title": "Wordle: 生活的缩影。幸运、技巧、作弊、忠诚和影响力！",
    "translated_abstract": "Wordle是一款由纽约时报提供的流行在线单词游戏。目前全球有大约200万名英文版本的玩家。玩家有6次机会来猜测每日的目标单词，并在每次猜测后，根据每个字母的位置和正确性，玩家会得到彩色编码的信息。在成功完成谜题或最后一次未成功的尝试之后，软件可以使用信息论来评估玩家的运气和技巧，并且可以显示随机抽样的所有玩家的第一次、第二次...第六次猜测的数据。最近，我发现后面的数据以一种方便复制粘贴到电子表格中的格式呈现出来。我从2023年5月至2023年8月收集了Wordle玩家的第一次猜测数据，并推断出一些有趣的有关Wordle玩家的信息。A）每天约有0.2-0.5%的玩家在一次尝试中解决了谜题。由于猜对2315个位置上的单词的几率为1/2315，这一比例显示了玩家们在游戏中的技巧和运气。",
    "tldr": "Wordle是一款流行的在线单词游戏，玩家需要在6次猜测中猜出每日目标单词。通过收集玩家的数据，研究者发现每天约有0.2-0.5%的玩家能在一次尝试中解决谜题，展示了玩家们的技巧和运气。",
    "en_tdlr": "Wordle is a popular online word game where players have 6 attempts to guess the daily target word. By analyzing player data, it was found that about 0.2-0.5% of players solve the puzzle in one attempt, showcasing their skills and luck."
}