{
    "title": "Long-Term Mean-Variance Optimization Under Mean-Reverting Equity Returns. (arXiv:2309.07488v1 [q-fin.MF])",
    "abstract": "Being a long-term investor has become an argument by itself to sustain larger allocations to risky assets, but - although intuitively appealing - it is rarely stated exactly why capital markets would provide a better opportunity set to investors with long investment horizons than to other investors. In this paper, it is shown that if in fact the equity risk-premium is slowly mean-reverting then an investor committing to a long-term deterministic investment strategy would realize a better risk-return trade-off in a mean-variance optimization than investors with shorter investment horizons. It is well known that the problem of mean-variance optimization cannot be solved by dynamic programming. Instead, the principle of Calculus of Variations is applied to derive an Euler-Lagrange equation characterizing the optimal investment strategy. It is a main result that the optimization problem is equivalent to a spectral problem by which explicit solutions to the optimal investment strategy can b",
    "link": "http://arxiv.org/abs/2309.07488",
    "context": "Title: Long-Term Mean-Variance Optimization Under Mean-Reverting Equity Returns. (arXiv:2309.07488v1 [q-fin.MF])\nAbstract: Being a long-term investor has become an argument by itself to sustain larger allocations to risky assets, but - although intuitively appealing - it is rarely stated exactly why capital markets would provide a better opportunity set to investors with long investment horizons than to other investors. In this paper, it is shown that if in fact the equity risk-premium is slowly mean-reverting then an investor committing to a long-term deterministic investment strategy would realize a better risk-return trade-off in a mean-variance optimization than investors with shorter investment horizons. It is well known that the problem of mean-variance optimization cannot be solved by dynamic programming. Instead, the principle of Calculus of Variations is applied to derive an Euler-Lagrange equation characterizing the optimal investment strategy. It is a main result that the optimization problem is equivalent to a spectral problem by which explicit solutions to the optimal investment strategy can b",
    "path": "papers/23/09/2309.07488.json",
    "total_tokens": 978,
    "translated_title": "长期均方差优化在均值回归股票收益下的应用",
    "translated_abstract": "成为长期投资者已经成为支持投资更大风险资产的一个论据，但是尽管直观上具有吸引力，很少有人确切说明为什么资本市场会为长期投资者提供比其他投资者更好的机会。本文显示，如果实际上股票风险溢价是缓慢回归的，那么承诺长期确定性投资策略的投资者在均值方差优化中将实现更好的风险收益平衡比短期投资期限的投资者。众所周知，均值方差优化问题不能通过动态规划来求解。相反，应用变分法原理推导出了描述最优投资策略的欧拉-拉格朗日方程。主要结果是优化问题等价于谱问题，通过它可以得到最优投资策略的显式解。",
    "tldr": "本文研究了长期均方差优化在均值回归股票收益下的应用，结果发现如果股票风险溢价缓慢回归，承诺长期确定性投资策略的投资者将实现更好的风险收益平衡。为求解该问题，应用了变分法原理，推导出了描述最优投资策略的欧拉-拉格朗日方程，问题等价于谱问题，可以得到最优策略的显式解。",
    "en_tdlr": "This paper examines the application of long-term mean-variance optimization under mean-reverting equity returns and finds that if the equity risk-premium is slowly mean-reverting, investors committing to a long-term deterministic investment strategy can achieve a better risk-return trade-off. The optimization problem is solved using the principle of Calculus of Variations, and the explicit solutions to the optimal investment strategy are obtained through a spectral problem."
}