{
    "title": "MCNS: Mining Causal Natural Structures Inside Time Series via A Novel Internal Causality Scheme. (arXiv:2309.06739v1 [cs.LG])",
    "abstract": "Causal inference permits us to discover covert relationships of various variables in time series. However, in most existing works, the variables mentioned above are the dimensions. The causality between dimensions could be cursory, which hinders the comprehension of the internal relationship and the benefit of the causal graph to the neural networks (NNs). In this paper, we find that causality exists not only outside but also inside the time series because it reflects a succession of events in the real world. It inspires us to seek the relationship between internal subsequences. However, the challenges are the hardship of discovering causality from subsequences and utilizing the causal natural structures to improve NNs. To address these challenges, we propose a novel framework called Mining Causal Natural Structure (MCNS), which is automatic and domain-agnostic and helps to find the causal natural structures inside time series via the internal causality scheme. We evaluate the MCNS fra",
    "link": "http://arxiv.org/abs/2309.06739",
    "context": "Title: MCNS: Mining Causal Natural Structures Inside Time Series via A Novel Internal Causality Scheme. (arXiv:2309.06739v1 [cs.LG])\nAbstract: Causal inference permits us to discover covert relationships of various variables in time series. However, in most existing works, the variables mentioned above are the dimensions. The causality between dimensions could be cursory, which hinders the comprehension of the internal relationship and the benefit of the causal graph to the neural networks (NNs). In this paper, we find that causality exists not only outside but also inside the time series because it reflects a succession of events in the real world. It inspires us to seek the relationship between internal subsequences. However, the challenges are the hardship of discovering causality from subsequences and utilizing the causal natural structures to improve NNs. To address these challenges, we propose a novel framework called Mining Causal Natural Structure (MCNS), which is automatic and domain-agnostic and helps to find the causal natural structures inside time series via the internal causality scheme. We evaluate the MCNS fra",
    "path": "papers/23/09/2309.06739.json",
    "total_tokens": 848,
    "translated_title": "MCNS: 通过一种新的内部因果方案挖掘时间序列中的因果自然结构",
    "translated_abstract": "因果推断使我们能够发现时间序列中各个变量之间的隐藏关系。然而，在大部分现有研究中，提到的变量是维度，维度之间的因果关系可能是肤浅的，这阻碍了对内部关系的理解以及因果图对神经网络的好处。本文发现，因果关系不仅存在于时间序列之外，也存在于时间序列之内，因为这反映了现实世界中一系列事件的顺序。这启发我们寻找内部子序列之间的关系。然而，挑战在于从子序列中发现因果关系，并利用因果自然结构改进神经网络的困难。为了解决这些挑战，我们提出了一种名为MCNS的新框架，它是自动的、领域无关的，并通过内部因果方案帮助发现时间序列中的因果自然结构。",
    "tldr": "本文提出了一种名为MCNS的自动领域无关框架，通过内部因果关系方案帮助挖掘时间序列中的因果自然结构。",
    "en_tdlr": "This paper presents a novel, automatic and domain-agnostic framework called MCNS, which utilizes an internal causality scheme to mine causal natural structures inside time series."
}