{
    "title": "Let's Predict Who Will Move to a New Job. (arXiv:2309.08333v1 [cs.LG])",
    "abstract": "Any company's human resources department faces the challenge of predicting whether an applicant will search for a new job or stay with the company. In this paper, we discuss how machine learning (ML) is used to predict who will move to a new job. First, the data is pre-processed into a suitable format for ML models. To deal with categorical features, data encoding is applied and several MLA (ML Algorithms) are performed including Random Forest (RF), Logistic Regression (LR), Decision Tree (DT), and eXtreme Gradient Boosting (XGBoost). To improve the performance of ML models, the synthetic minority oversampling technique (SMOTE) is used to retain them. Models are assessed using decision support metrics such as precision, recall, F1-Score, and accuracy.",
    "link": "http://arxiv.org/abs/2309.08333",
    "context": "Title: Let's Predict Who Will Move to a New Job. (arXiv:2309.08333v1 [cs.LG])\nAbstract: Any company's human resources department faces the challenge of predicting whether an applicant will search for a new job or stay with the company. In this paper, we discuss how machine learning (ML) is used to predict who will move to a new job. First, the data is pre-processed into a suitable format for ML models. To deal with categorical features, data encoding is applied and several MLA (ML Algorithms) are performed including Random Forest (RF), Logistic Regression (LR), Decision Tree (DT), and eXtreme Gradient Boosting (XGBoost). To improve the performance of ML models, the synthetic minority oversampling technique (SMOTE) is used to retain them. Models are assessed using decision support metrics such as precision, recall, F1-Score, and accuracy.",
    "path": "papers/23/09/2309.08333.json",
    "total_tokens": 810,
    "translated_title": "让我们预测谁会换工作",
    "translated_abstract": "任何一家公司的人力资源部门都面临着预测申请人是否会寻找新工作或者留在公司的挑战。在本文中，我们讨论了如何使用机器学习（ML）来预测谁会换工作。首先，将数据预处理成适合ML模型的格式。为了处理分类特征，应用数据编码并执行几种ML算法，包括随机森林（RF）、逻辑回归（LR）、决策树（DT）和极限梯度提升（XGBoost）。为了提高ML模型的性能，使用合成少数过采样技术（SMOTE）进行保留。使用精度、召回率、F1-Score和准确率等决策支持度量来评估模型。",
    "tldr": "本文讨论了如何使用机器学习来预测谁会换工作，包括数据预处理和使用多种ML算法。为了提高性能，使用了合成少数过采样技术。评估模型时使用了精度、召回率、F1-Score和准确率等指标。",
    "en_tdlr": "This paper discusses how machine learning is used to predict who will move to a new job, including data pre-processing and the use of multiple ML algorithms. Synthetic minority oversampling technique is used to improve performance. Models are evaluated using precision, recall, F1-Score, and accuracy metrics."
}