{
    "title": "The Role of Document Embedding in Research Paper Recommender Systems: To Breakdown or to Bolster Disciplinary Borders?. (arXiv:2309.14984v1 [cs.IR])",
    "abstract": "In the extensive recommender systems literature, novelty and diversity have been identified as key properties of useful recommendations. However, these properties have received limited attention in the specific sub-field of research paper recommender systems. In this work, we argue for the importance of offering novel and diverse research paper recommendations to scientists. This approach aims to reduce siloed reading, break down filter bubbles, and promote interdisciplinary research. We propose a novel framework for evaluating the novelty and diversity of research paper recommendations that leverages methods from network analysis and natural language processing. Using this framework, we show that the choice of representational method within a larger research paper recommendation system can have a measurable impact on the nature of downstream recommendations, specifically on their novelty and diversity. We introduce a novel paper embedding method, which we demonstrate offers more innov",
    "link": "http://arxiv.org/abs/2309.14984",
    "context": "Title: The Role of Document Embedding in Research Paper Recommender Systems: To Breakdown or to Bolster Disciplinary Borders?. (arXiv:2309.14984v1 [cs.IR])\nAbstract: In the extensive recommender systems literature, novelty and diversity have been identified as key properties of useful recommendations. However, these properties have received limited attention in the specific sub-field of research paper recommender systems. In this work, we argue for the importance of offering novel and diverse research paper recommendations to scientists. This approach aims to reduce siloed reading, break down filter bubbles, and promote interdisciplinary research. We propose a novel framework for evaluating the novelty and diversity of research paper recommendations that leverages methods from network analysis and natural language processing. Using this framework, we show that the choice of representational method within a larger research paper recommendation system can have a measurable impact on the nature of downstream recommendations, specifically on their novelty and diversity. We introduce a novel paper embedding method, which we demonstrate offers more innov",
    "path": "papers/23/09/2309.14984.json",
    "total_tokens": 1002,
    "translated_title": "文献嵌入在研究论文推荐系统中的作用: 是破坏学科边界还是加强它？",
    "translated_abstract": "在广泛的推荐系统文献中，新颖性和多样性被认为是有用推荐的关键属性。然而，在研究论文推荐系统的具体子领域中，这些属性得到了有限的关注。在这项工作中，我们提出了为科学家提供新颖和多样的研究论文推荐的重要性。这种方法旨在减少隔离阅读，打破过滤泡和促进跨学科研究。我们提出了一种评估研究论文推荐的新颖性和多样性的新框架，该框架利用了网络分析和自然语言处理的方法。使用这个框架，我们展示了在更大的研究论文推荐系统中选择代表性方法可以对下游推荐的性质，特别是它们的新颖性和多样性产生可衡量的影响。我们介绍了一种新型的论文嵌入方法，我们证明它提供了更多的创新性。",
    "tldr": "本论文探讨了文献嵌入在研究论文推荐系统中的作用，并提出了一种新的评估框架，该框架通过网络分析和自然语言处理来评估推荐的新颖性和多样性。研究表明在推荐系统中选择不同的代表性方法会对推荐结果的性质产生影响，我们引入了一种新的论文嵌入方法，该方法提供了更多的创新性。"
}