{
    "title": "A Spectral Approach for Learning Spatiotemporal Neural Differential Equations. (arXiv:2309.16131v1 [cs.LG])",
    "abstract": "Rapidly developing machine learning methods has stimulated research interest in computationally reconstructing differential equations (DEs) from observational data which may provide additional insight into underlying causative mechanisms. In this paper, we propose a novel neural-ODE based method that uses spectral expansions in space to learn spatiotemporal DEs. The major advantage of our spectral neural DE learning approach is that it does not rely on spatial discretization, thus allowing the target spatiotemporal equations to contain long range, nonlocal spatial interactions that act on unbounded spatial domains. Our spectral approach is shown to be as accurate as some of the latest machine learning approaches for learning PDEs operating on bounded domains. By developing a spectral framework for learning both PDEs and integro-differential equations, we extend machine learning methods to apply to unbounded DEs and a larger class of problems.",
    "link": "http://arxiv.org/abs/2309.16131",
    "context": "Title: A Spectral Approach for Learning Spatiotemporal Neural Differential Equations. (arXiv:2309.16131v1 [cs.LG])\nAbstract: Rapidly developing machine learning methods has stimulated research interest in computationally reconstructing differential equations (DEs) from observational data which may provide additional insight into underlying causative mechanisms. In this paper, we propose a novel neural-ODE based method that uses spectral expansions in space to learn spatiotemporal DEs. The major advantage of our spectral neural DE learning approach is that it does not rely on spatial discretization, thus allowing the target spatiotemporal equations to contain long range, nonlocal spatial interactions that act on unbounded spatial domains. Our spectral approach is shown to be as accurate as some of the latest machine learning approaches for learning PDEs operating on bounded domains. By developing a spectral framework for learning both PDEs and integro-differential equations, we extend machine learning methods to apply to unbounded DEs and a larger class of problems.",
    "path": "papers/23/09/2309.16131.json",
    "total_tokens": 875,
    "translated_title": "学习时空神经微分方程的谱方法",
    "translated_abstract": "快速发展的机器学习方法对从观测数据中计算重构微分方程（DE）的研究充满了兴趣，这可以提供关于潜在因果机制的额外洞察。本文提出了一种基于神经ODE的新方法，利用空间中的谱展开来学习时空DE。我们谱神经DE学习方法的主要优势是它不依赖于空间离散化，因此允许目标时空方程包含长范围、非局部的空间相互作用，并作用于无界的空间域。我们的谱方法被证明与一些最新的机器学习方法一样准确，可以用于学习作用于有界域的PDE。通过为学习PDE和积分微分方程开发一个谱框架，我们将机器学习方法扩展到适用于无界DE和更大类别的问题。",
    "tldr": "提出了一种使用谱展开学习时空微分方程的方法，不依赖于空间离散化，可以处理无界的时空方程。这个方法被证明与最新的机器学习方法一样准确，并可应用于更大的问题类别。",
    "en_tdlr": "A spectral approach is proposed for learning spatiotemporal differential equations, which does not rely on spatial discretization and can handle unbounded spatiotemporal equations. It has been shown to be as accurate as the latest machine learning methods and can be applied to a larger class of problems."
}