{
    "title": "How to foster innovation in the social sciences? Qualitative evidence from focus group workshops at Oxford University. (arXiv:2309.06875v1 [econ.GN])",
    "abstract": "This report addresses challenges and opportunities for innovation in the social sciences at the University of Oxford. It summarises findings from two focus group workshops with innovation experts from the University ecosystem. Experts included successful social science entrepreneurs and professional service staff from the University. The workshops focused on four different dimensions related to innovative activities and commercialisation. The findings show several challenges at the institutional and individual level, together with features of the social scientific discipline that impede more innovation in the social sciences. Based on identifying these challenges, we present potential solutions and ways forward identified in the focus group discussions to foster social science innovation. The report aims to illustrate the potential of innovation and commercialisation of social scientific research for both researchers and the university.",
    "link": "http://arxiv.org/abs/2309.06875",
    "context": "Title: How to foster innovation in the social sciences? Qualitative evidence from focus group workshops at Oxford University. (arXiv:2309.06875v1 [econ.GN])\nAbstract: This report addresses challenges and opportunities for innovation in the social sciences at the University of Oxford. It summarises findings from two focus group workshops with innovation experts from the University ecosystem. Experts included successful social science entrepreneurs and professional service staff from the University. The workshops focused on four different dimensions related to innovative activities and commercialisation. The findings show several challenges at the institutional and individual level, together with features of the social scientific discipline that impede more innovation in the social sciences. Based on identifying these challenges, we present potential solutions and ways forward identified in the focus group discussions to foster social science innovation. The report aims to illustrate the potential of innovation and commercialisation of social scientific research for both researchers and the university.",
    "path": "papers/23/09/2309.06875.json",
    "total_tokens": 813,
    "translated_title": "如何促进社会科学的创新？牛津大学焦点小组研讨会的定性证据",
    "translated_abstract": "本报告探讨了牛津大学社会科学中创新的挑战和机遇。它总结了与来自大学生态系统的创新专家进行的两次焦点小组研讨会的发现。专家包括成功的社会科学企业家和来自大学的专业服务人员。研讨会关注了与创新活动和商品化有关的四个不同维度。研究结果显示了机构和个人层面上的多个挑战，以及阻碍社会科学创新的社会科学学科特点。在确定这些挑战的基础上，我们提出了在焦点小组讨论中确定的促进社会科学创新的潜在解决方案和前进方向。该报告旨在说明社会科学研究的创新和商业化对研究人员和大学的潜力。",
    "tldr": "该论文探讨了牛津大学社会科学中的创新挑战和机遇，并提出了促进社会科学创新的潜在解决方案和前进方向。",
    "en_tdlr": "This paper explores the challenges and opportunities for innovation in the social sciences at the University of Oxford, and presents potential solutions and ways forward to foster social science innovation."
}