{
    "title": "Fairness Vs. Personalization: Towards Equity in Epistemic Utility. (arXiv:2309.11503v1 [cs.IR])",
    "abstract": "The applications of personalized recommender systems are rapidly expanding: encompassing social media, online shopping, search engine results, and more. These systems offer a more efficient way to navigate the vast array of items available. However, alongside this growth, there has been increased recognition of the potential for algorithmic systems to exhibit and perpetuate biases, risking unfairness in personalized domains. In this work, we explicate the inherent tension between personalization and conventional implementations of fairness. As an alternative, we propose equity to achieve fairness in the context of epistemic utility. We provide a mapping between goals and practical implementations and detail policy recommendations across key stakeholders to forge a path towards achieving fairness in personalized systems.",
    "link": "http://arxiv.org/abs/2309.11503",
    "context": "Title: Fairness Vs. Personalization: Towards Equity in Epistemic Utility. (arXiv:2309.11503v1 [cs.IR])\nAbstract: The applications of personalized recommender systems are rapidly expanding: encompassing social media, online shopping, search engine results, and more. These systems offer a more efficient way to navigate the vast array of items available. However, alongside this growth, there has been increased recognition of the potential for algorithmic systems to exhibit and perpetuate biases, risking unfairness in personalized domains. In this work, we explicate the inherent tension between personalization and conventional implementations of fairness. As an alternative, we propose equity to achieve fairness in the context of epistemic utility. We provide a mapping between goals and practical implementations and detail policy recommendations across key stakeholders to forge a path towards achieving fairness in personalized systems.",
    "path": "papers/23/09/2309.11503.json",
    "total_tokens": 780,
    "translated_title": "公平性与个性化：迈向认知效用的公正",
    "translated_abstract": "个性化推荐系统的应用范围正在迅速扩展，涵盖社交媒体、在线购物、搜索引擎结果等领域。这些系统提供了一种更高效的方式来浏览大量可用的物品。然而，随着发展，人们对算法系统可能存在并延续偏见的潜力有了更多认识，存在个性化领域中的不公平风险。在本研究中，我们阐明了个性化与传统公平实现之间固有的紧张关系。作为一种替代方案，我们提出了在认知效用背景下实现公正的公平。我们提供了目标和实际实现之间的映射，并详细介绍了关键利益相关者的政策建议，以在个性化系统中实现公平。",
    "tldr": "该论文研究了个性化推荐系统中公平性与个性化之间的困境，并提出了在认知效用背景下实现公正的公平的解决方案。"
}