{
    "title": "Improving the State of the Art for Training Human-AI Teams: Technical Report #3 -- Analysis of Testbed Alternatives. (arXiv:2309.03213v1 [cs.HC])",
    "abstract": "Sonalysts is working on an initiative to expand our current expertise in teaming to Human-Artificial Intelligence (AI) teams by developing original research in this area. To provide a foundation for that research, Sonalysts is investigating the development of a Synthetic Task Environment (STE). In a previous report, we documented the findings of a recent outreach effort in which we asked military Subject Matter Experts (SMEs) and other researchers in the Human-AI teaming domain to identify the qualities that they most valued in a testbed. A surprising finding from that outreach was that several respondents recommended that our team look into existing human-AI teaming testbeds, rather than creating something new. Based on that recommendation, we conducted a systematic investigation of the associated landscape. In this report, we describe the results of that investigation. Building on the survey results, we developed testbed evaluation criteria, identified potential testbeds, and conduct",
    "link": "http://arxiv.org/abs/2309.03213",
    "context": "Title: Improving the State of the Art for Training Human-AI Teams: Technical Report #3 -- Analysis of Testbed Alternatives. (arXiv:2309.03213v1 [cs.HC])\nAbstract: Sonalysts is working on an initiative to expand our current expertise in teaming to Human-Artificial Intelligence (AI) teams by developing original research in this area. To provide a foundation for that research, Sonalysts is investigating the development of a Synthetic Task Environment (STE). In a previous report, we documented the findings of a recent outreach effort in which we asked military Subject Matter Experts (SMEs) and other researchers in the Human-AI teaming domain to identify the qualities that they most valued in a testbed. A surprising finding from that outreach was that several respondents recommended that our team look into existing human-AI teaming testbeds, rather than creating something new. Based on that recommendation, we conducted a systematic investigation of the associated landscape. In this report, we describe the results of that investigation. Building on the survey results, we developed testbed evaluation criteria, identified potential testbeds, and conduct",
    "path": "papers/23/09/2309.03213.json",
    "total_tokens": 912,
    "translated_title": "提高训练人工智能团队的现状：技术报告＃3-测试环境替代方案的分析",
    "translated_abstract": "Sonalysts正在通过在人工智能（AI）团队领域开展原始研究，以扩展我们当前在团队合作方面的专业知识。为了为这项研究打下基础，Sonalysts正在研究开发一种合成任务环境（STE）。在之前的报告中，我们记录了最近的外展努力的结果，在这次努力中，我们询问了军事专家和其他在人工智能团队合作领域的研究人员，他们在测试环境中最看重的特点。 令人惊讶的是，一些受访者建议我们的团队研究现有的人工智能团队合作测试环境，而不是创建新的环境。基于这一建议，我们进行了系统的调查。在本报告中，我们描述了该调查的结果。根据调查结果，我们制定了测试环境评估标准，确定了潜在的测试环境，并进行了评估。",
    "tldr": "Sonalysts正在研究开发一种合成任务环境（STE），通过调查现有的人工智能团队合作测试环境，他们总结出了测试环境评估标准和潜在的测试环境。",
    "en_tdlr": "Sonalysts is developing a Synthetic Task Environment (STE) for human-AI teaming and has conducted a systematic investigation on existing testbeds, resulting in testbed evaluation criteria and potential testbeds."
}