{
    "title": "Comparative Analysis of Deep-Fake Algorithms. (arXiv:2309.03295v1 [cs.CV])",
    "abstract": "Due to the widespread use of smartphones with high-quality digital cameras and easy access to a wide range of software apps for recording, editing, and sharing videos and images, as well as the deep learning AI platforms, a new phenomenon of 'faking' videos has emerged. Deepfake algorithms can create fake images and videos that are virtually indistinguishable from authentic ones. Therefore, technologies that can detect and assess the integrity of digital visual media are crucial. Deepfakes, also known as deep learning-based fake videos, have become a major concern in recent years due to their ability to manipulate and alter images and videos in a way that is virtually indistinguishable from the original. These deepfake videos can be used for malicious purposes such as spreading misinformation, impersonating individuals, and creating fake news. Deepfake detection technologies use various approaches such as facial recognition, motion analysis, and audio-visual synchronization to identify",
    "link": "http://arxiv.org/abs/2309.03295",
    "context": "Title: Comparative Analysis of Deep-Fake Algorithms. (arXiv:2309.03295v1 [cs.CV])\nAbstract: Due to the widespread use of smartphones with high-quality digital cameras and easy access to a wide range of software apps for recording, editing, and sharing videos and images, as well as the deep learning AI platforms, a new phenomenon of 'faking' videos has emerged. Deepfake algorithms can create fake images and videos that are virtually indistinguishable from authentic ones. Therefore, technologies that can detect and assess the integrity of digital visual media are crucial. Deepfakes, also known as deep learning-based fake videos, have become a major concern in recent years due to their ability to manipulate and alter images and videos in a way that is virtually indistinguishable from the original. These deepfake videos can be used for malicious purposes such as spreading misinformation, impersonating individuals, and creating fake news. Deepfake detection technologies use various approaches such as facial recognition, motion analysis, and audio-visual synchronization to identify",
    "path": "papers/23/09/2309.03295.json",
    "total_tokens": 846,
    "translated_title": "深度伪造算法的比较分析",
    "translated_abstract": "由于智能手机普及，并拥有高质量的数码相机以及易于使用的软件应用程序来录制，编辑和共享视频和图像，再加上深度学习的人工智能平台，出现了一种新的视频“伪造”现象。深度伪造算法可以创建几乎无法与真实图像区分的伪造图像和视频。因此，检测和评估数字视觉媒体完整性的技术非常重要。深伪造，也被称为基于深度学习的伪造视频，由于其可以以几乎无法与原始图像和视频区分的方式操控和修改图像和视频，近年来已成为一个主要关注点。这些深伪造视频可用于恶意用途，例如传播虚假信息，冒充个人身份和制造假新闻。深伪造检测技术使用各种方法，例如面部识别，动作分析和音视频同步来识别",
    "tldr": "这项研究比较了不同的深度伪造算法，探讨了其对数字视觉媒体完整性的威胁，以及深伪造检测技术的应用方法。"
}