{
    "title": "Assessing the Impact of Personality on Affective States from Video Game Communication. (arXiv:2309.13214v1 [cs.AI])",
    "abstract": "Individual differences in personality determine our preferences, traits and values, which should similarly hold for the way we express ourselves. With current advancements and transformations of technology and society, text-based communication has become ordinary and often even surpasses natural voice conversations -- with distinct challenges and opportunities. In this exploratory work, we investigate the impact of personality on the tendency how players of a team-based collaborative alternate reality game express themselves affectively. We collected chat logs from eleven players over two weeks, labeled them according to their affective state, and assessed the connection between them and the five-factor personality domains and facets. After applying multi-linear regression, we found a series of reasonable correlations between (combinations of) personality variables and expressed affect -- as increased confusion could be predicted by lower self-competence (C1), personal annoyance by vul",
    "link": "http://arxiv.org/abs/2309.13214",
    "context": "Title: Assessing the Impact of Personality on Affective States from Video Game Communication. (arXiv:2309.13214v1 [cs.AI])\nAbstract: Individual differences in personality determine our preferences, traits and values, which should similarly hold for the way we express ourselves. With current advancements and transformations of technology and society, text-based communication has become ordinary and often even surpasses natural voice conversations -- with distinct challenges and opportunities. In this exploratory work, we investigate the impact of personality on the tendency how players of a team-based collaborative alternate reality game express themselves affectively. We collected chat logs from eleven players over two weeks, labeled them according to their affective state, and assessed the connection between them and the five-factor personality domains and facets. After applying multi-linear regression, we found a series of reasonable correlations between (combinations of) personality variables and expressed affect -- as increased confusion could be predicted by lower self-competence (C1), personal annoyance by vul",
    "path": "papers/23/09/2309.13214.json",
    "total_tokens": 970,
    "translated_title": "评估个性对于视频游戏交流中情感状态的影响",
    "translated_abstract": "个性的个体差异决定了我们的喜好、特征和价值观，这同样适用于我们表达自己的方式。在当前技术和社会的进步和转变中，基于文本的沟通变得普遍，并且通常甚至超过了自然的语音交流，带来了不同的挑战和机遇。在这项探索性工作中，我们研究了个性对基于团队合作的虚拟现实游戏玩家情感表达方式的影响。我们在两周内收集了十一个玩家的聊天记录，根据他们的情感状态进行标记，并评估了它们与五个人格领域和方面之间的关联。在应用多元线性回归之后，我们发现了一系列合理的相关性，即（组合）个性变量与表达的情感之间的关系--例如，较低的自我能力（C1）可以预测增加的困惑，个人烦恼可以预测通过内在和外在形象问题的增多。",
    "tldr": "本研究探讨了个性对团队合作的虚拟现实游戏玩家的情感表达方式的影响。通过分析两周内11名玩家的聊天记录，我们发现了个性变量与情感表达之间的合理相关性，例如较低的自我能力与增加的困惑之间的关系，以及个人烦恼与内在和外在形象问题的增多之间的关系。",
    "en_tdlr": "This study explores the impact of personality on affective expression in team-based virtual reality game players. By analyzing chat logs from 11 players over a two-week period, we found reasonable correlations between personality variables and expressed affect, such as a relationship between lower self-competence and increased confusion, as well as personal annoyance and an increase in internal and external image issues."
}