{
    "title": "Physics-informed Bayesian inference of external potentials in classical density-functional theory. (arXiv:2309.07065v1 [cond-mat.stat-mech])",
    "abstract": "The swift progression of machine learning (ML) have not gone unnoticed in the realm of statistical mechanics. ML techniques have attracted attention by the classical density-functional theory (DFT) community, as they enable discovery of free-energy functionals to determine the equilibrium-density profile of a many-particle system. Within DFT, the external potential accounts for the interaction of the many-particle system with an external field, thus, affecting the density distribution. In this context, we introduce a statistical-learning framework to infer the external potential exerted on a many-particle system. We combine a Bayesian inference approach with the classical DFT apparatus to reconstruct the external potential, yielding a probabilistic description of the external potential functional form with inherent uncertainty quantification. Our framework is exemplified with a grand-canonical one-dimensional particle ensemble with excluded volume interactions in a confined geometry. T",
    "link": "http://arxiv.org/abs/2309.07065",
    "context": "Title: Physics-informed Bayesian inference of external potentials in classical density-functional theory. (arXiv:2309.07065v1 [cond-mat.stat-mech])\nAbstract: The swift progression of machine learning (ML) have not gone unnoticed in the realm of statistical mechanics. ML techniques have attracted attention by the classical density-functional theory (DFT) community, as they enable discovery of free-energy functionals to determine the equilibrium-density profile of a many-particle system. Within DFT, the external potential accounts for the interaction of the many-particle system with an external field, thus, affecting the density distribution. In this context, we introduce a statistical-learning framework to infer the external potential exerted on a many-particle system. We combine a Bayesian inference approach with the classical DFT apparatus to reconstruct the external potential, yielding a probabilistic description of the external potential functional form with inherent uncertainty quantification. Our framework is exemplified with a grand-canonical one-dimensional particle ensemble with excluded volume interactions in a confined geometry. T",
    "path": "papers/23/09/2309.07065.json",
    "total_tokens": 899,
    "translated_title": "经典密度泛函理论中基于物理信息的贝叶斯推断外部势能",
    "translated_abstract": "机器学习技术在统计力学领域中已经取得了快速发展。机器学习技术吸引了经典密度泛函理论（DFT）社区的注意，因为它们能够发现自由能泛函，以确定多粒子系统的平衡密度分布。在DFT中，外部势能考虑了多粒子系统与外部场的相互作用，从而影响密度分布。在这个背景下，我们引入了一种统计学习框架，用于推断作用于多粒子系统的外部势能。我们将贝叶斯推断方法与经典的DFT工具结合起来，重构外部势能，得到具有内在不确定性量化的外部势能的概率描述形式。我们的框架以在受限几何中具有排除体积相互作用的巨正则一维粒子集合为例进行了说明。",
    "tldr": "这项研究将物理信息与贝叶斯推断方法相结合，提出了一种统计学习框架，用于推断经典密度泛函理论中多粒子系统的外部势能。该框架在具有排除体积相互作用的受限几何中进行了实验证明。",
    "en_tdlr": "This study combines physics information with Bayesian inference to propose a statistical learning framework for inferring the external potential of a many-particle system in classical density-functional theory. The framework is exemplified in a confined geometry with excluded volume interactions."
}