{
    "title": "Scene Informer: Anchor-based Occlusion Inference and Trajectory Prediction in Partially Observable Environments",
    "abstract": "arXiv:2309.13893v2 Announce Type: replace-cross  Abstract: Navigating complex and dynamic environments requires autonomous vehicles (AVs) to reason about both visible and occluded regions. This involves predicting the future motion of observed agents, inferring occluded ones, and modeling their interactions based on vectorized scene representations of the partially observable environment. However, prior work on occlusion inference and trajectory prediction have developed in isolation, with the former based on simplified rasterized methods and the latter assuming full environment observability. We introduce the Scene Informer, a unified approach for predicting both observed agent trajectories and inferring occlusions in a partially observable setting. It uses a transformer to aggregate various input modalities and facilitate selective queries on occlusions that might intersect with the AV's planned path. The framework estimates occupancy probabilities and likely trajectories for occlusi",
    "link": "https://arxiv.org/abs/2309.13893",
    "context": "Title: Scene Informer: Anchor-based Occlusion Inference and Trajectory Prediction in Partially Observable Environments\nAbstract: arXiv:2309.13893v2 Announce Type: replace-cross  Abstract: Navigating complex and dynamic environments requires autonomous vehicles (AVs) to reason about both visible and occluded regions. This involves predicting the future motion of observed agents, inferring occluded ones, and modeling their interactions based on vectorized scene representations of the partially observable environment. However, prior work on occlusion inference and trajectory prediction have developed in isolation, with the former based on simplified rasterized methods and the latter assuming full environment observability. We introduce the Scene Informer, a unified approach for predicting both observed agent trajectories and inferring occlusions in a partially observable setting. It uses a transformer to aggregate various input modalities and facilitate selective queries on occlusions that might intersect with the AV's planned path. The framework estimates occupancy probabilities and likely trajectories for occlusi",
    "path": "papers/23/09/2309.13893.json",
    "total_tokens": 898,
    "translated_title": "场景通知者：基于锚点的遮挡推断和轨迹预测在部分可观测环境中",
    "translated_abstract": "在复杂和动态的环境中自主车辆（AVs）导航需要AVs推理可见和遮挡区域。这涉及预测观察代理的未来运动，推断被遮挡的代理，并根据部分可观测环境的矢量化场景表示建模它们的相互作用。然而，在遮挡推断和轨迹预测方面的先前工作是分别发展的，前者基于简化的光栅方法，后者假定完整的环境可观察性。我们引入了场景通知者，这是一种统一的方法，用于在部分可观察的情况下预测观察代理的轨迹和推断遮挡。它使用一个transformer来聚合各种输入模态，并促进对可能与AV计划路径相交的遮挡的选择性查询。该框架估计了遮挡概率和可能的遮挡轨迹。",
    "tldr": "场景通知者是一种统一方法，用于在部分可观察的环境中预测观察代理的轨迹和推断遮挡，其利用transformer聚合输入模态并实现对可能与自主车辆计划路径相交的遮挡的选择性查询。",
    "en_tdlr": "The Scene Informer is a unified approach for predicting both observed agent trajectories and inferring occlusions in a partially observable setting, utilizing a transformer to aggregate input modalities and enable selective queries on occlusions that might intersect with the AV's planned path."
}