{
    "title": "A Closer Look at Bearing Fault Classification Approaches. (arXiv:2309.17001v1 [cs.LG])",
    "abstract": "Rolling bearing fault diagnosis has garnered increased attention in recent years owing to its presence in rotating machinery across various industries, and an ever increasing demand for efficient operations. Prompt detection and accurate prediction of bearing failures can help reduce the likelihood of unexpected machine downtime and enhance maintenance schedules, averting lost productivity. Recent technological advances have enabled monitoring the health of these assets at scale using a variety of sensors, and predicting the failures using modern Machine Learning (ML) approaches including deep learning architectures. Vibration data has been collected using accelerated run-to-failure of overloaded bearings, or by introducing known failure in bearings, under a variety of operating conditions such as rotating speed, load on the bearing, type of bearing fault, and data acquisition frequency. However, in the development of bearing failure classification models using vibration data there is ",
    "link": "http://arxiv.org/abs/2309.17001",
    "context": "Title: A Closer Look at Bearing Fault Classification Approaches. (arXiv:2309.17001v1 [cs.LG])\nAbstract: Rolling bearing fault diagnosis has garnered increased attention in recent years owing to its presence in rotating machinery across various industries, and an ever increasing demand for efficient operations. Prompt detection and accurate prediction of bearing failures can help reduce the likelihood of unexpected machine downtime and enhance maintenance schedules, averting lost productivity. Recent technological advances have enabled monitoring the health of these assets at scale using a variety of sensors, and predicting the failures using modern Machine Learning (ML) approaches including deep learning architectures. Vibration data has been collected using accelerated run-to-failure of overloaded bearings, or by introducing known failure in bearings, under a variety of operating conditions such as rotating speed, load on the bearing, type of bearing fault, and data acquisition frequency. However, in the development of bearing failure classification models using vibration data there is ",
    "path": "papers/23/09/2309.17001.json",
    "total_tokens": 857,
    "translated_title": "对轴承故障分类方法的深入研究",
    "translated_abstract": "近年来，由于轴承存在于各个行业的旋转设备中，并且对高效运营的需求不断增加，轴承故障诊断引起了越来越多的关注。及时检测和准确预测轴承故障可以帮助减少意外机器停机的可能性，并改进维护计划，从而避免损失产能。最近的技术进步使得可以使用各种传感器对这些设备的健康状况进行规模化监测，并使用现代机器学习方法，包括深度学习架构来预测故障。通过加速运行至故障的过程中采集振动数据，或者通过引入已知故障来采集振动数据，可以在各种工作条件下（如转速、轴承负载、轴承故障类型和数据采集频率）进行数据采集。然而，在使用振动数据开发轴承故障分类模型的过程中存在以下问题。",
    "tldr": "这项研究对轴承故障分类方法进行了深入研究，关注了轴承故障诊断的重要性，以及使用机器学习和振动数据来预测故障的方法。"
}