{
    "title": "ALJP: An Arabic Legal Judgment Prediction in Personal Status Cases Using Machine Learning Models. (arXiv:2309.00238v1 [cs.AI])",
    "abstract": "Legal Judgment Prediction (LJP) aims to predict judgment outcomes based on case description. Several researchers have developed techniques to assist potential clients by predicting the outcome in the legal profession. However, none of the proposed techniques were implemented in Arabic, and only a few attempts were implemented in English, Chinese, and Hindi. In this paper, we develop a system that utilizes deep learning (DL) and natural language processing (NLP) techniques to predict the judgment outcome from Arabic case scripts, especially in cases of custody and annulment of marriage. This system will assist judges and attorneys in improving their work and time efficiency while reducing sentencing disparity. In addition, it will help litigants, lawyers, and law students analyze the probable outcomes of any given case before trial. We use a different machine and deep learning models such as Support Vector Machine (SVM), Logistic regression (LR), Long Short Term Memory (LSTM), and Bidir",
    "link": "http://arxiv.org/abs/2309.00238",
    "context": "Title: ALJP: An Arabic Legal Judgment Prediction in Personal Status Cases Using Machine Learning Models. (arXiv:2309.00238v1 [cs.AI])\nAbstract: Legal Judgment Prediction (LJP) aims to predict judgment outcomes based on case description. Several researchers have developed techniques to assist potential clients by predicting the outcome in the legal profession. However, none of the proposed techniques were implemented in Arabic, and only a few attempts were implemented in English, Chinese, and Hindi. In this paper, we develop a system that utilizes deep learning (DL) and natural language processing (NLP) techniques to predict the judgment outcome from Arabic case scripts, especially in cases of custody and annulment of marriage. This system will assist judges and attorneys in improving their work and time efficiency while reducing sentencing disparity. In addition, it will help litigants, lawyers, and law students analyze the probable outcomes of any given case before trial. We use a different machine and deep learning models such as Support Vector Machine (SVM), Logistic regression (LR), Long Short Term Memory (LSTM), and Bidir",
    "path": "papers/23/09/2309.00238.json",
    "total_tokens": 926,
    "translated_title": "ALJP: 使用机器学习模型预测阿拉伯个人身份案件的法律判决",
    "translated_abstract": "法律判决预测（LJP）旨在基于案情描述预测判决结果。一些研究人员已经开发出了一些技术，通过预测法律职业的结果来帮助潜在的客户。然而，没有一种提出的技术是用阿拉伯语实现的，只有少数尝试采用英语、汉语和印地语实现。在本文中，我们开发了一个系统，利用深度学习（DL）和自然语言处理（NLP）技术，从阿拉伯语案情脚本中预测判决结果，特别是在抚养权和婚姻无效的案件中。该系统将帮助法官和律师提高工作和时间效率，同时减少判决差异。此外，在审判之前，它将帮助诉讼当事人、律师和法学生分析任何给定案件的可能结果。我们使用了不同的机器和深度学习模型，如支持向量机（SVM）、逻辑回归（LR）、长短期记忆（LSTM）和双向。",
    "tldr": "这项研究开发了一个使用深度学习和自然语言处理技术预测阿拉伯个人身份案件法律判决的系统，有助于改进法官和律师的工作效率，减少判决差异，并帮助诉讼当事人事先分析案件的可能结果。"
}