{
    "title": "DiscoverPath: A Knowledge Refinement and Retrieval System for Interdisciplinarity on Biomedical Research. (arXiv:2309.01808v2 [cs.IR] UPDATED)",
    "abstract": "The exponential growth in scholarly publications necessitates advanced tools for efficient article retrieval, especially in interdisciplinary fields where diverse terminologies are used to describe similar research. Traditional keyword-based search engines often fall short in assisting users who may not be familiar with specific terminologies. To address this, we present a knowledge graph-based paper search engine for biomedical research to enhance the user experience in discovering relevant queries and articles. The system, dubbed DiscoverPath, employs Named Entity Recognition (NER) and part-of-speech (POS) tagging to extract terminologies and relationships from article abstracts to create a KG. To reduce information overload, DiscoverPath presents users with a focused subgraph containing the queried entity and its neighboring nodes and incorporates a query recommendation system, enabling users to iteratively refine their queries. The system is equipped with an accessible Graphical Us",
    "link": "http://arxiv.org/abs/2309.01808",
    "context": "Title: DiscoverPath: A Knowledge Refinement and Retrieval System for Interdisciplinarity on Biomedical Research. (arXiv:2309.01808v2 [cs.IR] UPDATED)\nAbstract: The exponential growth in scholarly publications necessitates advanced tools for efficient article retrieval, especially in interdisciplinary fields where diverse terminologies are used to describe similar research. Traditional keyword-based search engines often fall short in assisting users who may not be familiar with specific terminologies. To address this, we present a knowledge graph-based paper search engine for biomedical research to enhance the user experience in discovering relevant queries and articles. The system, dubbed DiscoverPath, employs Named Entity Recognition (NER) and part-of-speech (POS) tagging to extract terminologies and relationships from article abstracts to create a KG. To reduce information overload, DiscoverPath presents users with a focused subgraph containing the queried entity and its neighboring nodes and incorporates a query recommendation system, enabling users to iteratively refine their queries. The system is equipped with an accessible Graphical Us",
    "path": "papers/23/09/2309.01808.json",
    "total_tokens": 926,
    "translated_title": "DiscoverPath：用于生物医学研究的知识细化和检索系统",
    "translated_abstract": "学术出版物的指数增长需要高级工具来实现高效的文章检索，尤其在跨学科领域中，不同的术语被用来描述相似的研究。传统的基于关键词的搜索引擎往往无法帮助那些对特定术语不熟悉的用户。为了解决这个问题，我们提出了一种基于知识图的生物医学研究论文搜索引擎，以增强用户在发现相关查询和文章方面的体验。该系统被称为DiscoverPath，采用命名实体识别（NER）和词性标注（POS）来从文章摘要中提取术语和关系，创建知识图谱。为了减少信息超载，DiscoverPath给用户展示了一个关注查询实体及其邻近节点的子图，并且还结合了查询推荐系统，使用户能够循序渐进地细化查询。该系统配备了一个易于访问的图形用户界面（GUI）。",
    "tldr": "DiscoverPath是一个基于知识图的生物医学研究论文搜索引擎，通过命名实体识别和词性标注从文章摘要中提取术语和关系，并展示给用户一个关注查询实体及其邻近节点的子图，以及查询推荐系统，使用户能够循序渐进地细化查询。",
    "en_tdlr": "DiscoverPath is a knowledge graph-based paper search engine for biomedical research that uses named entity recognition and part-of-speech tagging to extract terminologies and relationships from article abstracts. It presents users with a focused subgraph of the queried entity and incorporates a query recommendation system for iterative query refinement."
}