{
    "title": "Implicit Design Choices and Their Impact on Emotion Recognition Model Development and Evaluation. (arXiv:2309.03238v1 [cs.LG])",
    "abstract": "Emotion recognition is a complex task due to the inherent subjectivity in both the perception and production of emotions. The subjectivity of emotions poses significant challenges in developing accurate and robust computational models. This thesis examines critical facets of emotion recognition, beginning with the collection of diverse datasets that account for psychological factors in emotion production.  To handle the challenge of non-representative training data, this work collects the Multimodal Stressed Emotion dataset, which introduces controlled stressors during data collection to better represent real-world influences on emotion production. To address issues with label subjectivity, this research comprehensively analyzes how data augmentation techniques and annotation schemes impact emotion perception and annotator labels. It further handles natural confounding variables and variations by employing adversarial networks to isolate key factors like stress from learned emotion rep",
    "link": "http://arxiv.org/abs/2309.03238",
    "context": "Title: Implicit Design Choices and Their Impact on Emotion Recognition Model Development and Evaluation. (arXiv:2309.03238v1 [cs.LG])\nAbstract: Emotion recognition is a complex task due to the inherent subjectivity in both the perception and production of emotions. The subjectivity of emotions poses significant challenges in developing accurate and robust computational models. This thesis examines critical facets of emotion recognition, beginning with the collection of diverse datasets that account for psychological factors in emotion production.  To handle the challenge of non-representative training data, this work collects the Multimodal Stressed Emotion dataset, which introduces controlled stressors during data collection to better represent real-world influences on emotion production. To address issues with label subjectivity, this research comprehensively analyzes how data augmentation techniques and annotation schemes impact emotion perception and annotator labels. It further handles natural confounding variables and variations by employing adversarial networks to isolate key factors like stress from learned emotion rep",
    "path": "papers/23/09/2309.03238.json",
    "total_tokens": 946,
    "translated_title": "隐含设计选择及其对情绪识别模型开发和评估的影响",
    "translated_abstract": "情绪识别是一项复杂的任务，因为情绪的感知和表达具有固有的主观性。情绪的主观性在开发准确和稳健的计算模型方面提出了重大挑战。本论文考察了情绪识别的关键要素，从收集旨在考虑情绪产生心理因素的多样化数据集开始。为了应对非典型训练数据的挑战，本研究收集了多模态应激情绪数据集，在数据收集过程中引入了受控的压力因素，以更好地反映情绪产生的真实环境影响。为了解决标签主观性问题，该研究全面分析了数据增强技术和注释方案如何影响情绪感知和注释者标签。此外，该研究通过使用对抗网络来处理自然混淆变量和变化，以隔离关键因素（如压力）与学习到的情绪表示之间的关系。",
    "tldr": "本研究探讨了情绪识别中的关键因素，包括收集多样化数据集、处理非典型训练数据、分析数据增强技术和注释方案的影响，以及使用对抗网络处理自然混淆变量和变化。研究结果对于开发准确和稳健的情绪识别模型具有重要意义。",
    "en_tdlr": "This research examines critical factors in emotion recognition, including collecting diverse datasets, handling non-representative training data, analyzing the impact of data augmentation techniques and annotation schemes, and using adversarial networks to address natural confounding variables and variations. The findings are essential for developing accurate and robust emotion recognition models."
}