{
    "title": "Learning based 2D Irregular Shape Packing. (arXiv:2309.10329v1 [cs.GR])",
    "abstract": "2D irregular shape packing is a necessary step to arrange UV patches of a 3D model within a texture atlas for memory-efficient appearance rendering in computer graphics. Being a joint, combinatorial decision-making problem involving all patch positions and orientations, this problem has well-known NP-hard complexity. Prior solutions either assume a heuristic packing order or modify the upstream mesh cut and UV mapping to simplify the problem, which either limits the packing ratio or incurs robustness or generality issues. Instead, we introduce a learning-assisted 2D irregular shape packing method that achieves a high packing quality with minimal requirements from the input. Our method iteratively selects and groups subsets of UV patches into near-rectangular super patches, essentially reducing the problem to bin-packing, based on which a joint optimization is employed to further improve the packing ratio. In order to efficiently deal with large problem instances with hundreds of patche",
    "link": "http://arxiv.org/abs/2309.10329",
    "context": "Title: Learning based 2D Irregular Shape Packing. (arXiv:2309.10329v1 [cs.GR])\nAbstract: 2D irregular shape packing is a necessary step to arrange UV patches of a 3D model within a texture atlas for memory-efficient appearance rendering in computer graphics. Being a joint, combinatorial decision-making problem involving all patch positions and orientations, this problem has well-known NP-hard complexity. Prior solutions either assume a heuristic packing order or modify the upstream mesh cut and UV mapping to simplify the problem, which either limits the packing ratio or incurs robustness or generality issues. Instead, we introduce a learning-assisted 2D irregular shape packing method that achieves a high packing quality with minimal requirements from the input. Our method iteratively selects and groups subsets of UV patches into near-rectangular super patches, essentially reducing the problem to bin-packing, based on which a joint optimization is employed to further improve the packing ratio. In order to efficiently deal with large problem instances with hundreds of patche",
    "path": "papers/23/09/2309.10329.json",
    "total_tokens": 906,
    "translated_title": "基于学习的二维不规则形状装箱",
    "translated_abstract": "二维不规则形状装箱是计算机图形学中在纹理图集内排列3D模型的UV贴图补丁以实现内存高效渲染的必要步骤。这个问题是一个联合的、组合的决策问题，涉及所有补丁的位置和方向，已知其NP难度。先前的解决方案要么假设启发式的排列顺序，要么修改上游的网格切割和UV映射以简化问题，这两种方法都限制了装箱比例或引起了鲁棒性或通用性问题。相反，我们提出了一种基于学习的二维不规则形状装箱方法，它能够在最小的输入要求下实现高质量的装箱效果。我们的方法通过迭代地将部分UV贴图补丁选择和分组成近矩形的超级补丁，从而将问题转化为装箱问题，接着使用联合优化来进一步提高装箱比例。为了有效处理包含数百个补丁的大型问题实例，我们还引入了一个特殊的启发式选择和分组算法。",
    "tldr": "这个论文提出了一种基于学习的二维不规则形状装箱方法，通过迭代选择和分组UV贴图补丁，将问题转化为装箱问题并使用联合优化来提高装箱比例。",
    "en_tdlr": "This paper introduces a learning-based method for 2D irregular shape packing, which iteratively selects and groups UV patches to convert the problem into a bin-packing one and utilizes joint optimization to improve the packing ratio."
}