{
    "title": "Enhance Multi-domain Sentiment Analysis of Review Texts through Prompting Strategies. (arXiv:2309.02045v2 [cs.CL] UPDATED)",
    "abstract": "Large Language Models (LLMs) have made significant strides in both scientific research and practical applications. Existing studies have demonstrated the state-of-the-art (SOTA) performance of LLMs in various natural language processing tasks. However, the question of how to further enhance LLMs' performance in specific task using prompting strategies remains a pivotal concern. This paper explores the enhancement of LLMs' performance in sentiment analysis through the application of prompting strategies. We formulate the process of prompting for sentiment analysis tasks and introduce two novel strategies tailored for sentiment analysis: RolePlaying (RP) prompting and Chain-of-thought (CoT) prompting. Specifically, we also propose the RP-CoT prompting strategy which is a combination of RP prompting and CoT prompting. We conduct comparative experiments on three distinct domain datasets to evaluate the effectiveness of the proposed sentiment analysis strategies. The results demonstrate tha",
    "link": "http://arxiv.org/abs/2309.02045",
    "context": "Title: Enhance Multi-domain Sentiment Analysis of Review Texts through Prompting Strategies. (arXiv:2309.02045v2 [cs.CL] UPDATED)\nAbstract: Large Language Models (LLMs) have made significant strides in both scientific research and practical applications. Existing studies have demonstrated the state-of-the-art (SOTA) performance of LLMs in various natural language processing tasks. However, the question of how to further enhance LLMs' performance in specific task using prompting strategies remains a pivotal concern. This paper explores the enhancement of LLMs' performance in sentiment analysis through the application of prompting strategies. We formulate the process of prompting for sentiment analysis tasks and introduce two novel strategies tailored for sentiment analysis: RolePlaying (RP) prompting and Chain-of-thought (CoT) prompting. Specifically, we also propose the RP-CoT prompting strategy which is a combination of RP prompting and CoT prompting. We conduct comparative experiments on three distinct domain datasets to evaluate the effectiveness of the proposed sentiment analysis strategies. The results demonstrate tha",
    "path": "papers/23/09/2309.02045.json",
    "total_tokens": 859,
    "translated_title": "通过提示策略增强评论文本的多领域情感分析",
    "translated_abstract": "大型语言模型（LLMs）在科学研究和实际应用中取得了重大进展。现有研究已证明了LLMs在各种自然语言处理任务中的最新性能。然而，如何通过提示策略进一步增强LLMs在特定任务中的性能仍然是一个重要问题。本文探讨了通过应用提示策略来提高LLMs在情感分析中的性能。我们对情感分析任务的提示过程进行了建模，并介绍了两种针对情感分析的新颖策略：角色扮演（RP）提示和思维链（CoT）提示。具体地，我们还提出了RP-CoT提示策略，它是RP提示和CoT提示的结合。我们在三个不同领域的数据集上进行了比较实验，以评估所提出的情感分析策略的有效性。结果表明...",
    "tldr": "通过提示策略，本论文探究了如何通过应用角色扮演和思维链提示策略来增强大型语言模型（LLMs）在情感分析中的性能，并在三个不同领域的数据集上进行了评估。",
    "en_tdlr": "This paper explores how to enhance the performance of Large Language Models (LLMs) in sentiment analysis through the application of RolePlaying (RP) prompting and Chain-of-thought (CoT) prompting strategies, and evaluates them on three distinct domain datasets."
}