{
    "title": "Deep smoothness WENO scheme for two-dimensional hyperbolic conservation laws: A deep learning approach for learning smoothness indicators. (arXiv:2309.10117v1 [math.NA])",
    "abstract": "In this paper, we introduce an improved version of the fifth-order weighted essentially non-oscillatory (WENO) shock-capturing scheme by incorporating deep learning techniques. The established WENO algorithm is improved by training a compact neural network to adjust the smoothness indicators within the WENO scheme. This modification enhances the accuracy of the numerical results, particularly near abrupt shocks. Unlike previous deep learning-based methods, no additional post-processing steps are necessary for maintaining consistency. We demonstrate the superiority of our new approach using several examples from the literature for the two-dimensional Euler equations of gas dynamics. Through intensive study of these test problems, which involve various shocks and rarefaction waves, the new technique is shown to outperform traditional fifth-order WENO schemes, especially in cases where the numerical solutions exhibit excessive diffusion or overshoot around shocks.",
    "link": "http://arxiv.org/abs/2309.10117",
    "context": "Title: Deep smoothness WENO scheme for two-dimensional hyperbolic conservation laws: A deep learning approach for learning smoothness indicators. (arXiv:2309.10117v1 [math.NA])\nAbstract: In this paper, we introduce an improved version of the fifth-order weighted essentially non-oscillatory (WENO) shock-capturing scheme by incorporating deep learning techniques. The established WENO algorithm is improved by training a compact neural network to adjust the smoothness indicators within the WENO scheme. This modification enhances the accuracy of the numerical results, particularly near abrupt shocks. Unlike previous deep learning-based methods, no additional post-processing steps are necessary for maintaining consistency. We demonstrate the superiority of our new approach using several examples from the literature for the two-dimensional Euler equations of gas dynamics. Through intensive study of these test problems, which involve various shocks and rarefaction waves, the new technique is shown to outperform traditional fifth-order WENO schemes, especially in cases where the numerical solutions exhibit excessive diffusion or overshoot around shocks.",
    "path": "papers/23/09/2309.10117.json",
    "total_tokens": 870,
    "translated_title": "二维双曲型守恒定律问题的深度平滑WENO格式：一种基于深度学习的平滑性指标学习方法",
    "translated_abstract": "本文介绍了一种改进的五阶加权实质非振荡（WENO）激波捕获格式，采用深度学习技术进行改进。通过训练一个紧凑的神经网络来调整WENO格式中的平滑性指标，改进了现有的WENO算法。这种改进提高了数值结果的精确性，特别是在陡峭激波附近。与以前的基于深度学习的方法不同，不需要额外的后处理步骤来保持一致性。我们使用二维欧拉气体动力学方程的几个文献例子展示了我们新方法的优越性。通过对涉及各种激波和展开波的这些测试问题进行深入研究，新技术表现出在数值解在激波附近呈现出过度扩散或超调时的优势，特别是相对于传统的五阶WENO格式。",
    "tldr": "这篇论文提出了一种改进的二维双曲型守恒定律问题的深度平滑WENO格式，通过深度学习方法调整平滑性指标，在数值结果的准确性方面取得了优势，尤其是在陡峭激波附近。"
}