{
    "title": "Deep Single Models vs. Ensembles: Insights for a Fast Deployment of Parking Monitoring Systems. (arXiv:2309.16495v1 [cs.CV])",
    "abstract": "Searching for available parking spots in high-density urban centers is a stressful task for drivers that can be mitigated by systems that know in advance the nearest parking space available.  To this end, image-based systems offer cost advantages over other sensor-based alternatives (e.g., ultrasonic sensors), requiring less physical infrastructure for installation and maintenance.  Despite recent deep learning advances, deploying intelligent parking monitoring is still a challenge since most approaches involve collecting and labeling large amounts of data, which is laborious and time-consuming. Our study aims to uncover the challenges in creating a global framework, trained using publicly available labeled parking lot images, that performs accurately across diverse scenarios, enabling the parking space monitoring as a ready-to-use system to deploy in a new environment. Through exhaustive experiments involving different datasets and deep learning architectures, including fusion strateg",
    "link": "http://arxiv.org/abs/2309.16495",
    "context": "Title: Deep Single Models vs. Ensembles: Insights for a Fast Deployment of Parking Monitoring Systems. (arXiv:2309.16495v1 [cs.CV])\nAbstract: Searching for available parking spots in high-density urban centers is a stressful task for drivers that can be mitigated by systems that know in advance the nearest parking space available.  To this end, image-based systems offer cost advantages over other sensor-based alternatives (e.g., ultrasonic sensors), requiring less physical infrastructure for installation and maintenance.  Despite recent deep learning advances, deploying intelligent parking monitoring is still a challenge since most approaches involve collecting and labeling large amounts of data, which is laborious and time-consuming. Our study aims to uncover the challenges in creating a global framework, trained using publicly available labeled parking lot images, that performs accurately across diverse scenarios, enabling the parking space monitoring as a ready-to-use system to deploy in a new environment. Through exhaustive experiments involving different datasets and deep learning architectures, including fusion strateg",
    "path": "papers/23/09/2309.16495.json",
    "total_tokens": 896,
    "translated_title": "深度单一模型与集成：加速部署停车监控系统的见解",
    "translated_abstract": "在高密度城市中寻找可用停车位对驾车者来说是一项压力巨大的任务，可以通过提前了解最近可用的停车空间的系统来缓解。为此，基于图像的系统在安装和维护上相对其他传感器的选择（如超声波传感器）具有成本优势，需要更少的物理基础设施。尽管近年来深度学习取得了进展，但部署智能停车监控仍然是一个挑战，因为大多数方法涉及收集和标记大量数据，这是费时费力的。我们的研究旨在揭示在使用公开可用的标记停车场图像进行训练的全局框架的创建中所面临的挑战，该框架在各种场景下能够准确执行，从而实现停车空间监控作为一种可以立即投入新环境使用的系统。通过涉及不同数据集和深度学习体系结构的详尽实验，包括融合策略。",
    "tldr": "该研究揭示了在使用公开可用的标记停车场图像进行训练的全局框架的创建中的挑战，该框架能够在各种场景下准确执行停车空间监控任务，加速部署停车监控系统。",
    "en_tdlr": "This study uncovers the challenges in creating a global framework trained using publicly available labeled parking lot images, which accurately performs parking space monitoring in diverse scenarios, for the fast deployment of parking monitoring systems."
}