{
    "title": "Matching Table Metadata with Business Glossaries Using Large Language Models. (arXiv:2309.11506v1 [cs.IR])",
    "abstract": "Enterprises often own large collections of structured data in the form of large databases or an enterprise data lake. Such data collections come with limited metadata and strict access policies that could limit access to the data contents and, therefore, limit the application of classic retrieval and analysis solutions. As a result, there is a need for solutions that can effectively utilize the available metadata. In this paper, we study the problem of matching table metadata to a business glossary containing data labels and descriptions. The resulting matching enables the use of an available or curated business glossary for retrieval and analysis without or before requesting access to the data contents. One solution to this problem is to use manually-defined rules or similarity measures on column names and glossary descriptions (or their vector embeddings) to find the closest match. However, such approaches need to be tuned through manual labeling and cannot handle many business gloss",
    "link": "http://arxiv.org/abs/2309.11506",
    "context": "Title: Matching Table Metadata with Business Glossaries Using Large Language Models. (arXiv:2309.11506v1 [cs.IR])\nAbstract: Enterprises often own large collections of structured data in the form of large databases or an enterprise data lake. Such data collections come with limited metadata and strict access policies that could limit access to the data contents and, therefore, limit the application of classic retrieval and analysis solutions. As a result, there is a need for solutions that can effectively utilize the available metadata. In this paper, we study the problem of matching table metadata to a business glossary containing data labels and descriptions. The resulting matching enables the use of an available or curated business glossary for retrieval and analysis without or before requesting access to the data contents. One solution to this problem is to use manually-defined rules or similarity measures on column names and glossary descriptions (or their vector embeddings) to find the closest match. However, such approaches need to be tuned through manual labeling and cannot handle many business gloss",
    "path": "papers/23/09/2309.11506.json",
    "total_tokens": 834,
    "translated_title": "使用大型语言模型将表元数据与业务词汇匹配",
    "translated_abstract": "企业通常拥有大量的结构化数据，以大型数据库或企业数据湖的形式存在。这些数据集往往具有有限的元数据和严格的访问策略，这可能限制对数据内容的访问，并因此限制了经典的检索和分析解决方案的应用。因此，需要能够有效利用可用元数据的解决方案。本文研究了将表元数据与包含数据标签和描述的业务词汇匹配的问题。通过匹配，可以在不请求访问数据内容之前或之后，利用可用或策划的业务词汇进行检索和分析。解决这个问题的一种方法是使用手动定义的规则或相似度度量在列名和词汇描述（或它们的向量嵌入）之间找到最匹配的项。然而，这种方法需要通过手动标注进行调整，并且不能处理许多业务词汇。",
    "tldr": "本研究探讨了将表元数据与业务词汇进行匹配的问题，通过匹配可以在不请求访问数据内容之前或之后，有效利用可用的业务词汇进行检索和分析。",
    "en_tdlr": "This research investigates the problem of matching table metadata with business glossaries, enabling the utilization of available glossaries for retrieval and analysis without or before accessing the data contents."
}