{
    "title": "Automatic Data Visualization Generation from Chinese Natural Language Questions. (arXiv:2309.07650v1 [cs.CL])",
    "abstract": "Data visualization has emerged as an effective tool for getting insights from massive datasets. Due to the hardness of manipulating the programming languages of data visualization, automatic data visualization generation from natural languages (Text-to-Vis) is becoming increasingly popular. Despite the plethora of research effort on the English Text-to-Vis, studies have yet to be conducted on data visualization generation from questions in Chinese. Motivated by this, we propose a Chinese Text-to-Vis dataset in the paper and demonstrate our first attempt to tackle this problem. Our model integrates multilingual BERT as the encoder, boosts the cross-lingual ability, and infuses the $n$-gram information into our word representation learning. Our experimental results show that our dataset is challenging and deserves further research.",
    "link": "http://arxiv.org/abs/2309.07650",
    "context": "Title: Automatic Data Visualization Generation from Chinese Natural Language Questions. (arXiv:2309.07650v1 [cs.CL])\nAbstract: Data visualization has emerged as an effective tool for getting insights from massive datasets. Due to the hardness of manipulating the programming languages of data visualization, automatic data visualization generation from natural languages (Text-to-Vis) is becoming increasingly popular. Despite the plethora of research effort on the English Text-to-Vis, studies have yet to be conducted on data visualization generation from questions in Chinese. Motivated by this, we propose a Chinese Text-to-Vis dataset in the paper and demonstrate our first attempt to tackle this problem. Our model integrates multilingual BERT as the encoder, boosts the cross-lingual ability, and infuses the $n$-gram information into our word representation learning. Our experimental results show that our dataset is challenging and deserves further research.",
    "path": "papers/23/09/2309.07650.json",
    "total_tokens": 754,
    "translated_title": "从中文自然语言问题中自动生成数据可视化",
    "translated_abstract": "数据可视化已经成为从大规模数据集中获取洞见的有效工具。由于操作数据可视化编程语言的困难性，从自然语言中自动生成数据可视化（文本到可视化）变得越来越受欢迎。尽管在英文文本到可视化上有大量的研究工作，但是关于从中文问题生成数据可视化的研究还没有进行。鉴于此，本论文提出了一个中文文本到可视化数据集，并展示了我们对这个问题的首次尝试。我们的模型将多语言BERT作为编码器，增强了跨语言能力，并将n-gram信息融入到我们的词表示学习中。实验证明，我们的数据集具有挑战性，值得进一步研究。",
    "tldr": "本论文提出了一个中文文本到可视化数据集，并通过使用多语言BERT作为编码器以及融入n-gram信息来解决中文文本到可视化的问题。",
    "en_tdlr": "This paper proposes a Chinese Text-to-Vis dataset and tackles the problem of generating data visualization from Chinese natural language by using multilingual BERT as the encoder and incorporating n-gram information."
}