{
    "title": "Crystal Structure Prediction by Joint Equivariant Diffusion. (arXiv:2309.04475v1 [cond-mat.mtrl-sci])",
    "abstract": "Crystal Structure Prediction (CSP) is crucial in various scientific disciplines. While CSP can be addressed by employing currently-prevailing generative models (e.g. diffusion models), this task encounters unique challenges owing to the symmetric geometry of crystal structures -- the invariance of translation, rotation, and periodicity. To incorporate the above symmetries, this paper proposes DiffCSP, a novel diffusion model to learn the structure distribution from stable crystals. To be specific, DiffCSP jointly generates the lattice and atom coordinates for each crystal by employing a periodic-E(3)-equivariant denoising model, to better model the crystal geometry. Notably, different from related equivariant generative approaches, DiffCSP leverages fractional coordinates other than Cartesian coordinates to represent crystals, remarkably promoting the diffusion and the generation process of atom positions. Extensive experiments verify that our DiffCSP significantly outperforms existing",
    "link": "http://arxiv.org/abs/2309.04475",
    "context": "Title: Crystal Structure Prediction by Joint Equivariant Diffusion. (arXiv:2309.04475v1 [cond-mat.mtrl-sci])\nAbstract: Crystal Structure Prediction (CSP) is crucial in various scientific disciplines. While CSP can be addressed by employing currently-prevailing generative models (e.g. diffusion models), this task encounters unique challenges owing to the symmetric geometry of crystal structures -- the invariance of translation, rotation, and periodicity. To incorporate the above symmetries, this paper proposes DiffCSP, a novel diffusion model to learn the structure distribution from stable crystals. To be specific, DiffCSP jointly generates the lattice and atom coordinates for each crystal by employing a periodic-E(3)-equivariant denoising model, to better model the crystal geometry. Notably, different from related equivariant generative approaches, DiffCSP leverages fractional coordinates other than Cartesian coordinates to represent crystals, remarkably promoting the diffusion and the generation process of atom positions. Extensive experiments verify that our DiffCSP significantly outperforms existing",
    "path": "papers/23/09/2309.04475.json",
    "total_tokens": 862,
    "translated_title": "通过联合等变扩散进行晶体结构预测",
    "translated_abstract": "晶体结构预测在各个科学学科中至关重要。尽管目前流行的生成模型（如扩散模型）可以用于解决晶体结构预测的任务，但由于晶体结构的对称几何特性（平移、旋转和周期性的不变性），该任务面临着独特的挑战。为了融入以上对称性，本文提出了DiffCSP，一种新颖的扩散模型，通过采用周期-E(3)-等变去噪模型，联合生成每个晶体的晶格和原子坐标，以更好地建模晶体几何。值得注意的是，与相关的等变生成方法不同，DiffCSP利用分数坐标而不是笛卡尔坐标来表示晶体，显著提升了原子位置的扩散和生成过程。大量实验证明，我们的DiffCSP明显优于现有方法。",
    "tldr": "本文提出了DiffCSP，一种利用周期-E(3)-等变去噪模型的扩散模型，用于通过联合生成晶体的晶格和原子坐标，以解决晶体结构预测中的对称性挑战。"
}