{
    "title": "End-to-end Risk Prediction of Atrial Fibrillation from the 12-Lead ECG by Deep Neural Networks. (arXiv:2309.16335v1 [cs.LG])",
    "abstract": "Background: Atrial fibrillation (AF) is one of the most common cardiac arrhythmias that affects millions of people each year worldwide and it is closely linked to increased risk of cardiovascular diseases such as stroke and heart failure. Machine learning methods have shown promising results in evaluating the risk of developing atrial fibrillation from the electrocardiogram. We aim to develop and evaluate one such algorithm on a large CODE dataset collected in Brazil.  Results: The deep neural network model identified patients without indication of AF in the presented ECG but who will develop AF in the future with an AUC score of 0.845. From our survival model, we obtain that patients in the high-risk group (i.e. with the probability of a future AF case being greater than 0.7) are 50% more likely to develop AF within 40 weeks, while patients belonging to the minimal-risk group (i.e. with the probability of a future AF case being less than or equal to 0.1) have more than 85% chance of r",
    "link": "http://arxiv.org/abs/2309.16335",
    "context": "Title: End-to-end Risk Prediction of Atrial Fibrillation from the 12-Lead ECG by Deep Neural Networks. (arXiv:2309.16335v1 [cs.LG])\nAbstract: Background: Atrial fibrillation (AF) is one of the most common cardiac arrhythmias that affects millions of people each year worldwide and it is closely linked to increased risk of cardiovascular diseases such as stroke and heart failure. Machine learning methods have shown promising results in evaluating the risk of developing atrial fibrillation from the electrocardiogram. We aim to develop and evaluate one such algorithm on a large CODE dataset collected in Brazil.  Results: The deep neural network model identified patients without indication of AF in the presented ECG but who will develop AF in the future with an AUC score of 0.845. From our survival model, we obtain that patients in the high-risk group (i.e. with the probability of a future AF case being greater than 0.7) are 50% more likely to develop AF within 40 weeks, while patients belonging to the minimal-risk group (i.e. with the probability of a future AF case being less than or equal to 0.1) have more than 85% chance of r",
    "path": "papers/23/09/2309.16335.json",
    "total_tokens": 1025,
    "translated_title": "由深度神经网络从12导联心电图中进行的房颤风险预测的端到端方法",
    "translated_abstract": "背景：房颤是最常见的心律失常之一，每年影响全球数百万人，与中风和心力衰竭等心血管疾病的风险密切相关。机器学习方法在评估从心电图中发展房颤的风险方面取得了有希望的结果。我们的目标是在巴西收集的大型CODE数据集上开发和评估这样的算法。结果：深度神经网络模型识别出在目前的心电图中没有房颤迹象，但将来会发展房颤的患者，AUC得分为0.845。从我们的生存模型中得知，高风险组（即未来房颤发病概率大于0.7）的患者在40周内发展房颤的可能性要高出50%，而属于最低风险组（即未来房颤发病概率小于或等于0.1）的患者有超过85%的机会。",
    "tldr": "该研究提出了一种由深度神经网络进行的端到端方法，可以从12导联心电图中预测房颤的风险。研究结果显示，该模型可以在目前的心电图中识别出未来会发展房颤的患者，并可以根据患者的风险等级评估他们在一定时间内发展房颤的可能性。",
    "en_tdlr": "This study proposes an end-to-end approach using deep neural networks to predict the risk of atrial fibrillation from the 12-lead ECG. The results show that the model can identify patients who will develop atrial fibrillation in the future from the current ECG, and can assess their likelihood of developing atrial fibrillation within a certain time frame based on their risk level."
}