{
    "title": "Impression-Informed Multi-Behavior Recommender System: A Hierarchical Graph Attention Approach. (arXiv:2309.03169v1 [cs.IR])",
    "abstract": "While recommender systems have significantly benefited from implicit feedback, they have often missed the nuances of multi-behavior interactions between users and items. Historically, these systems either amalgamated all behaviors, such as \\textit{impression} (formerly \\textit{view}), \\textit{add-to-cart}, and \\textit{buy}, under a singular 'interaction' label, or prioritized only the target behavior, often the \\textit{buy} action, discarding valuable auxiliary signals. Although recent advancements tried addressing this simplification, they primarily gravitated towards optimizing the target behavior alone, battling with data scarcity. Additionally, they tended to bypass the nuanced hierarchy intrinsic to behaviors. To bridge these gaps, we introduce the \\textbf{H}ierarchical \\textbf{M}ulti-behavior \\textbf{G}raph Attention \\textbf{N}etwork (HMGN). This pioneering framework leverages attention mechanisms to discern information from both inter and intra-behaviors while employing a multi-",
    "link": "http://arxiv.org/abs/2309.03169",
    "context": "Title: Impression-Informed Multi-Behavior Recommender System: A Hierarchical Graph Attention Approach. (arXiv:2309.03169v1 [cs.IR])\nAbstract: While recommender systems have significantly benefited from implicit feedback, they have often missed the nuances of multi-behavior interactions between users and items. Historically, these systems either amalgamated all behaviors, such as \\textit{impression} (formerly \\textit{view}), \\textit{add-to-cart}, and \\textit{buy}, under a singular 'interaction' label, or prioritized only the target behavior, often the \\textit{buy} action, discarding valuable auxiliary signals. Although recent advancements tried addressing this simplification, they primarily gravitated towards optimizing the target behavior alone, battling with data scarcity. Additionally, they tended to bypass the nuanced hierarchy intrinsic to behaviors. To bridge these gaps, we introduce the \\textbf{H}ierarchical \\textbf{M}ulti-behavior \\textbf{G}raph Attention \\textbf{N}etwork (HMGN). This pioneering framework leverages attention mechanisms to discern information from both inter and intra-behaviors while employing a multi-",
    "path": "papers/23/09/2309.03169.json",
    "total_tokens": 952,
    "translated_title": "基于印象感知的多行为推荐系统：一种层次图注意力方法",
    "translated_abstract": "尽管推荐系统从隐式反馈中获益良多，但往往会忽略用户与物品之间的多行为互动的细微差别。历史上，这些系统要么将所有行为，如“印象”（以前称为“浏览”）、“添加到购物车”和“购买”，归并为一个统一的“互动”标签，要么仅优先考虑目标行为，通常是“购买”行为，并丢弃有价值的辅助信号。尽管最近的进展试图解决这种简化，但它们主要集中于优化目标行为，与数据稀缺作斗争。此外，它们往往绕过了与行为内在层次结构有关的微妙差异。为了弥合这些差距，我们引入了“H”ierarchical “M”ulti-behavior “G”raph Attention “N”etwork（HMGN）。这个开创性的框架利用注意机制从行为间和行为内部获取信息，同时采用多",
    "tldr": "这个论文提出了一种基于印象感知的多行为推荐系统，通过利用注意机制从行为间和行为内部获取信息，并采用多层级图注意力方法，来解决推荐系统在处理多个行为之间互动方面的挑战。",
    "en_tdlr": "This paper proposes an impression-informed multi-behavior recommender system, which leverages attention mechanisms to extract information from both inter and intra-behaviors, and utilizes a hierarchical graph attention approach to tackle the challenges of multi-behavior interactions in recommender systems."
}