{
    "title": "Unsupervised Machine Learning Techniques for Exploring Tropical Coamoeba, Brane Tilings and Seiberg Duality. (arXiv:2309.05702v1 [hep-th])",
    "abstract": "We introduce unsupervised machine learning techniques in order to identify toric phases of 4d N=1 supersymmetric gauge theories corresponding to the same toric Calabi-Yau 3-fold. These 4d N=1 supersymmetric gauge theories are worldvolume theories of a D3-brane probing a toric Calabi-Yau 3-fold and are realized in terms of a Type IIB brane configuration known as a brane tiling. It corresponds to the skeleton graph of the coamoeba projection of the mirror curve associated to the toric Calabi-Yau 3-fold. When we vary the complex structure moduli of the mirror Calabi-Yau 3-fold, the coamoeba and the corresponding brane tilings change their shape, giving rise to different toric phases related by Seiberg duality. We illustrate that by employing techniques such as principal component analysis (PCA) and t-distributed stochastic neighbor embedding (t-SNE), we can project the space of coamoeba labelled by complex structure moduli down to a lower dimensional phase space with phase boundaries corr",
    "link": "http://arxiv.org/abs/2309.05702",
    "context": "Title: Unsupervised Machine Learning Techniques for Exploring Tropical Coamoeba, Brane Tilings and Seiberg Duality. (arXiv:2309.05702v1 [hep-th])\nAbstract: We introduce unsupervised machine learning techniques in order to identify toric phases of 4d N=1 supersymmetric gauge theories corresponding to the same toric Calabi-Yau 3-fold. These 4d N=1 supersymmetric gauge theories are worldvolume theories of a D3-brane probing a toric Calabi-Yau 3-fold and are realized in terms of a Type IIB brane configuration known as a brane tiling. It corresponds to the skeleton graph of the coamoeba projection of the mirror curve associated to the toric Calabi-Yau 3-fold. When we vary the complex structure moduli of the mirror Calabi-Yau 3-fold, the coamoeba and the corresponding brane tilings change their shape, giving rise to different toric phases related by Seiberg duality. We illustrate that by employing techniques such as principal component analysis (PCA) and t-distributed stochastic neighbor embedding (t-SNE), we can project the space of coamoeba labelled by complex structure moduli down to a lower dimensional phase space with phase boundaries corr",
    "path": "papers/23/09/2309.05702.json",
    "total_tokens": 1070,
    "translated_title": "无监督机器学习技术用于探索热带共平面，膜图和Seiberg对偶",
    "translated_abstract": "我们引入无监督机器学习技术，以识别与相同的泛型Calabi-Yau 3折对应的4维N=1超对称规范理论的泛型相。这些4维N=1超对称规范理论是探测泛型Calabi-Yau 3折的D3-膜的世界体理论，并且以称为膜图的Type IIB膜配置形式实现。它对应于与泛型Calabi-Yau 3折关联的镜面曲线的共平面投影的骨架图。当我们改变镜面Calabi-Yau 3折的复结构模量时，共平面和相应的膜图会改变其形状，产生由Seiberg对偶相联系的不同泛型相。我们证明通过使用主成分分析（PCA）和t-分布随机邻域嵌入（t-SNE）等技术，我们可以将由复结构模量标记的共平面空间投影到具有相界限的低维相空间中。",
    "tldr": "我们利用无监督机器学习技术，并采用主成分分析（PCA）和t-分布随机邻域嵌入（t-SNE）等技术，成功地将标记的共平面空间投影到具有相界限的低维相空间中，以识别与相同泛型Calabi-Yau 3折对应的4维N=1超对称规范理论的泛型相。",
    "en_tdlr": "We introduce unsupervised machine learning techniques to identify toric phases of 4d N=1 supersymmetric gauge theories corresponding to the same toric Calabi-Yau 3-fold. By employing techniques such as principal component analysis (PCA) and t-distributed stochastic neighbor embedding (t-SNE), we can project the space of coamoeba labelled by complex structure moduli down to a lower dimensional phase space with phase boundaries, successfully identifying the generic phases associated with the same toric Calabi-Yau 3-fold."
}