{
    "title": "FRACAS: A FRench Annotated Corpus of Attribution relations in newS. (arXiv:2309.10604v1 [cs.CL])",
    "abstract": "Quotation extraction is a widely useful task both from a sociological and from a Natural Language Processing perspective. However, very little data is available to study this task in languages other than English. In this paper, we present a manually annotated corpus of 1676 newswire texts in French for quotation extraction and source attribution. We first describe the composition of our corpus and the choices that were made in selecting the data. We then detail the annotation guidelines and annotation process, as well as a few statistics about the final corpus and the obtained balance between quote types (direct, indirect and mixed, which are particularly challenging). We end by detailing our inter-annotator agreement between the 8 annotators who worked on manual labelling, which is substantially high for such a difficult linguistic phenomenon.",
    "link": "http://arxiv.org/abs/2309.10604",
    "context": "Title: FRACAS: A FRench Annotated Corpus of Attribution relations in newS. (arXiv:2309.10604v1 [cs.CL])\nAbstract: Quotation extraction is a widely useful task both from a sociological and from a Natural Language Processing perspective. However, very little data is available to study this task in languages other than English. In this paper, we present a manually annotated corpus of 1676 newswire texts in French for quotation extraction and source attribution. We first describe the composition of our corpus and the choices that were made in selecting the data. We then detail the annotation guidelines and annotation process, as well as a few statistics about the final corpus and the obtained balance between quote types (direct, indirect and mixed, which are particularly challenging). We end by detailing our inter-annotator agreement between the 8 annotators who worked on manual labelling, which is substantially high for such a difficult linguistic phenomenon.",
    "path": "papers/23/09/2309.10604.json",
    "total_tokens": 826,
    "translated_title": "FRACAS: 一份用于新闻中引述关系的法语注释语料库",
    "translated_abstract": "引述提取是一项在社会学和自然语言处理方面都非常有用的任务，但是除了英语之外，很少有数据可用于研究其他语言中的这个任务。在本文中，我们介绍了一份手动注释的法语新闻语料库，包含1676篇新闻文本，用于引述提取和来源归属。我们首先描述了我们语料库的组成以及在选择数据时做出的选择。然后详细介绍了标注指南和标注过程，以及关于最终语料库和引述类型（直接引述、间接引述和混合引述）之间的一些统计数据，这些类型特别具有挑战性。最后，我们详细介绍了8位参与手动标注的标注者之间的标注者一致性，对于这样一个困难的语言现象来说，一致性相当高。",
    "tldr": "本文介绍了一份新闻语料库，用于研究法语中的引述提取和来源归属。语料库包含1676篇手动注释的新闻文本，其中包括直接引述、间接引述和混合引述。通过8位标注者的一致性验证，该语料库对于这个困难的语言现象来说具有高度的一致性。"
}