{
    "title": "The Effect of Punishment and Reward on Cooperation in a Prisoners' Dilemma Game. (arXiv:2309.00556v1 [econ.TH])",
    "abstract": "This work studies the effect of incentives (in the form of punishment and reward) on the equilibrium fraction of cooperators and defectors in an iterated n-person prisoners' dilemma game. With a finite population of players employing a strategy of nice tit-for-tat or universal defect, an equilibrium fraction of each player-type can be identified from linearized payoff functions. Incentives take the form of targeted and general punishment, and targeted and general reward. The primary contribution of this work is in clearly articulating the design and marginal effect of these incentives on cooperation. Generalizable results indicate that while targeted incentives have the potential to substantially reduce but never entirely eliminate defection, they exhibit diminishing marginal effectiveness. General incentives on the other hand have the potential to eliminate all defection from the population of players. Applications to policy are briefly considered.",
    "link": "http://arxiv.org/abs/2309.00556",
    "context": "Title: The Effect of Punishment and Reward on Cooperation in a Prisoners' Dilemma Game. (arXiv:2309.00556v1 [econ.TH])\nAbstract: This work studies the effect of incentives (in the form of punishment and reward) on the equilibrium fraction of cooperators and defectors in an iterated n-person prisoners' dilemma game. With a finite population of players employing a strategy of nice tit-for-tat or universal defect, an equilibrium fraction of each player-type can be identified from linearized payoff functions. Incentives take the form of targeted and general punishment, and targeted and general reward. The primary contribution of this work is in clearly articulating the design and marginal effect of these incentives on cooperation. Generalizable results indicate that while targeted incentives have the potential to substantially reduce but never entirely eliminate defection, they exhibit diminishing marginal effectiveness. General incentives on the other hand have the potential to eliminate all defection from the population of players. Applications to policy are briefly considered.",
    "path": "papers/23/09/2309.00556.json",
    "total_tokens": 910,
    "translated_title": "处罚与奖励对囚徒困境博弈中的合作行为的影响",
    "translated_abstract": "本研究探讨了处罚和奖励对迭代n人囚徒困境博弈中合作者和背叛者平衡比例的影响。通过有限的玩家群体采用策略的友好报复或普遍缺陷，可以从线性化的收益函数中确定每种类型的玩家的平衡比例。激励以有针对性和普遍性的惩罚以及有针对性和普遍性的奖励形式存在。本研究的主要贡献在于清晰地阐述了这些激励对合作行为的设计和边际效应。一般化的结果表明，尽管有针对性的激励有潜力大幅减少但永远不能完全消除叛变行为，但它们的边际效果递减。另一方面，一般性的激励有潜力消除玩家群体中的所有叛变行为。本研究还简要考虑了对政策的应用。",
    "tldr": "本研究研究了处罚和奖励对囚徒困境博弈中合作行为的影响，并发现一般性的激励有潜力消除玩家群体中的所有叛变行为。",
    "en_tdlr": "This study investigates the effect of punishment and reward on cooperation in a prisoners' dilemma game and finds that general incentives have the potential to eliminate all defection from the population of players."
}