{
    "title": "A Model-Based Machine Learning Approach for Assessing the Performance of Blockchain Applications. (arXiv:2309.11205v1 [cs.DC])",
    "abstract": "The recent advancement of Blockchain technology consolidates its status as a viable alternative for various domains. However, evaluating the performance of blockchain applications can be challenging due to the underlying infrastructure's complexity and distributed nature. Therefore, a reliable modelling approach is needed to boost Blockchain-based applications' development and evaluation. While simulation-based solutions have been researched, machine learning (ML) model-based techniques are rarely discussed in conjunction with evaluating blockchain application performance. Our novel research makes use of two ML model-based methods. Firstly, we train a $k$ nearest neighbour ($k$NN) and support vector machine (SVM) to predict blockchain performance using predetermined configuration parameters. Secondly, we employ the salp swarm optimization (SO) ML model which enables the investigation of optimal blockchain configurations for achieving the required performance level. We use rough set the",
    "link": "http://arxiv.org/abs/2309.11205",
    "context": "Title: A Model-Based Machine Learning Approach for Assessing the Performance of Blockchain Applications. (arXiv:2309.11205v1 [cs.DC])\nAbstract: The recent advancement of Blockchain technology consolidates its status as a viable alternative for various domains. However, evaluating the performance of blockchain applications can be challenging due to the underlying infrastructure's complexity and distributed nature. Therefore, a reliable modelling approach is needed to boost Blockchain-based applications' development and evaluation. While simulation-based solutions have been researched, machine learning (ML) model-based techniques are rarely discussed in conjunction with evaluating blockchain application performance. Our novel research makes use of two ML model-based methods. Firstly, we train a $k$ nearest neighbour ($k$NN) and support vector machine (SVM) to predict blockchain performance using predetermined configuration parameters. Secondly, we employ the salp swarm optimization (SO) ML model which enables the investigation of optimal blockchain configurations for achieving the required performance level. We use rough set the",
    "path": "papers/23/09/2309.11205.json",
    "total_tokens": 903,
    "translated_title": "基于模型的机器学习方法用于评估区块链应用性能的研究",
    "translated_abstract": "区块链技术的最新进展巩固了其作为各个领域可行替代方案的地位。然而，由于基础设施的复杂性和分布式特性，评估区块链应用的性能可能具有挑战性。因此，需要一种可靠的建模方法来提高基于区块链的应用的开发和评估。虽然已经进行了基于模拟的解决方案的研究，但很少讨论机器学习（ML）模型与评估区块链应用性能的结合。我们的研究采用了两种基于ML模型的方法。首先，我们通过训练k最近邻（kNN）和支持向量机（SVM）来预测使用预定配置参数的区块链性能。其次，我们采用了salp swarm optimization（SO）ML模型，可以探索实现所需性能水平的最佳区块链配置。我们使用粗糙集方法进行了数据分析，以评估和验证所提出方法的有效性。",
    "tldr": "本研究提出了一种基于模型的机器学习方法，用于评估区块链应用性能。通过使用预定配置参数预测性能并探索最佳配置，我们的研究为区块链应用的开发和评估提供了可靠的建模方法。"
}