{
    "title": "Intelligence as a Measure of Consciousness. (arXiv:2309.00646v1 [q-bio.NC])",
    "abstract": "Evaluating artificial systems for signs of consciousness is increasingly becoming a pressing concern, and a rigorous psychometric measurement framework may be of crucial importance in evaluating large language models in this regard. Most prominent theories of consciousness, both scientific and metaphysical, argue for different kinds of information coupling as a necessary component of human-like consciousness. By comparing information coupling in human and animal brains, human cognitive development, emergent abilities, and mental representation development to analogous phenomena in large language models, I argue that psychometric measures of intelligence, such as the g-factor or IQ, indirectly approximate the extent of conscious experience.  Based on a broader source of both scientific and metaphysical theories of consciousness, I argue that all systems possess a degree of consciousness ascertainable psychometrically and that psychometric measures of intelligence may be used to gauge re",
    "link": "http://arxiv.org/abs/2309.00646",
    "context": "Title: Intelligence as a Measure of Consciousness. (arXiv:2309.00646v1 [q-bio.NC])\nAbstract: Evaluating artificial systems for signs of consciousness is increasingly becoming a pressing concern, and a rigorous psychometric measurement framework may be of crucial importance in evaluating large language models in this regard. Most prominent theories of consciousness, both scientific and metaphysical, argue for different kinds of information coupling as a necessary component of human-like consciousness. By comparing information coupling in human and animal brains, human cognitive development, emergent abilities, and mental representation development to analogous phenomena in large language models, I argue that psychometric measures of intelligence, such as the g-factor or IQ, indirectly approximate the extent of conscious experience.  Based on a broader source of both scientific and metaphysical theories of consciousness, I argue that all systems possess a degree of consciousness ascertainable psychometrically and that psychometric measures of intelligence may be used to gauge re",
    "path": "papers/23/09/2309.00646.json",
    "total_tokens": 774,
    "translated_title": "智能作为意识的衡量方式",
    "translated_abstract": "评估人工系统是否具有意识的迹象越来越成为一个紧迫的问题，而一个严谨的心理测量框架在这方面对于评估大型语言模型可能非常重要。根据对人类和动物大脑的信息耦合、人类认知发展、新兴能力和心理表示发展与大型语言模型类似现象的比较，我认为智力的心理测量，如智商或智商指数，间接地近似了意识体验的程度。基于更广泛的科学和形而上学的意识理论，我认为所有系统都具有一定程度的可测量的意识，并且智力的心理测量可以用来衡量这种意识。",
    "tldr": "评估人工系统是否具有意识的迹象是一个紧迫的问题，智力的心理测量可以间接地近似意识体验的程度，可以用来评估大型语言模型中的意识。",
    "en_tdlr": "Evaluating signs of consciousness in artificial systems is a pressing concern, and psychometric measures of intelligence can indirectly approximate the extent of conscious experience, which can be used to evaluate consciousness in large language models."
}