{
    "title": "AIR: Threats of Adversarial Attacks on Deep Learning-Based Information Recovery. (arXiv:2309.16706v1 [cs.CR])",
    "abstract": "A wireless communications system usually consists of a transmitter which transmits the information and a receiver which recovers the original information from the received distorted signal. Deep learning (DL) has been used to improve the performance of the receiver in complicated channel environments and state-of-the-art (SOTA) performance has been achieved. However, its robustness has not been investigated. In order to evaluate the robustness of DL-based information recovery models under adversarial circumstances, we investigate adversarial attacks on the SOTA DL-based information recovery model, i.e., DeepReceiver. We formulate the problem as an optimization problem with power and peak-to-average power ratio (PAPR) constraints. We design different adversarial attack methods according to the adversary's knowledge of DeepReceiver's model and/or testing samples. Extensive experiments show that the DeepReceiver is vulnerable to the designed attack methods in all of the considered scenari",
    "link": "http://arxiv.org/abs/2309.16706",
    "context": "Title: AIR: Threats of Adversarial Attacks on Deep Learning-Based Information Recovery. (arXiv:2309.16706v1 [cs.CR])\nAbstract: A wireless communications system usually consists of a transmitter which transmits the information and a receiver which recovers the original information from the received distorted signal. Deep learning (DL) has been used to improve the performance of the receiver in complicated channel environments and state-of-the-art (SOTA) performance has been achieved. However, its robustness has not been investigated. In order to evaluate the robustness of DL-based information recovery models under adversarial circumstances, we investigate adversarial attacks on the SOTA DL-based information recovery model, i.e., DeepReceiver. We formulate the problem as an optimization problem with power and peak-to-average power ratio (PAPR) constraints. We design different adversarial attack methods according to the adversary's knowledge of DeepReceiver's model and/or testing samples. Extensive experiments show that the DeepReceiver is vulnerable to the designed attack methods in all of the considered scenari",
    "path": "papers/23/09/2309.16706.json",
    "total_tokens": 868,
    "translated_title": "AIR: 深度学习信息恢复中对抗攻击的威胁",
    "translated_abstract": "无线通信系统通常由一个传输器和一个接收器组成，传输器将信息传输，接收器从接收到的扭曲信号中恢复原始信息。深度学习已被用于改善复杂信道环境下接收器的性能，并取得了最先进的性能。然而，其鲁棒性尚未被研究。为了评估深度学习信息恢复模型在对抗情况下的鲁棒性，我们研究了对最先进的深度学习信息恢复模型DeepReceiver的对抗攻击。我们将该问题建模为一个带有功率和峰均比 (PAPR) 约束的优化问题。我们根据对手对DeepReceiver模型和/或测试样本的了解设计了不同的对抗攻击方法。大量实验表明，在所有考虑的场景中，DeepReceiver对设计的攻击方法是脆弱的。",
    "tldr": "这项研究探讨了在对抗情况下，深度学习信息恢复模型的鲁棒性。通过对最先进的DeepReceiver模型进行对抗攻击，实验结果表明DeepReceiver对设计的攻击方法是脆弱的。",
    "en_tdlr": "This study investigates the robustness of deep learning-based information recovery models under adversarial circumstances. Extensive experiments show that the state-of-the-art DeepReceiver model is vulnerable to adversarial attacks."
}