{
    "title": "Rethinking Cross-Domain Pedestrian Detection: A Background-Focused Distribution Alignment Framework for Instance-Free One-Stage Detectors. (arXiv:2309.08771v1 [cs.CV])",
    "abstract": "Cross-domain pedestrian detection aims to generalize pedestrian detectors from one label-rich domain to another label-scarce domain, which is crucial for various real-world applications. Most recent works focus on domain alignment to train domain-adaptive detectors either at the instance level or image level. From a practical point of view, one-stage detectors are faster. Therefore, we concentrate on designing a cross-domain algorithm for rapid one-stage detectors that lacks instance-level proposals and can only perform image-level feature alignment. However, pure image-level feature alignment causes the foreground-background misalignment issue to arise, i.e., the foreground features in the source domain image are falsely aligned with background features in the target domain image. To address this issue, we systematically analyze the importance of foreground and background in image-level cross-domain alignment, and learn that background plays a more critical role in image-level cross-d",
    "link": "http://arxiv.org/abs/2309.08771",
    "context": "Title: Rethinking Cross-Domain Pedestrian Detection: A Background-Focused Distribution Alignment Framework for Instance-Free One-Stage Detectors. (arXiv:2309.08771v1 [cs.CV])\nAbstract: Cross-domain pedestrian detection aims to generalize pedestrian detectors from one label-rich domain to another label-scarce domain, which is crucial for various real-world applications. Most recent works focus on domain alignment to train domain-adaptive detectors either at the instance level or image level. From a practical point of view, one-stage detectors are faster. Therefore, we concentrate on designing a cross-domain algorithm for rapid one-stage detectors that lacks instance-level proposals and can only perform image-level feature alignment. However, pure image-level feature alignment causes the foreground-background misalignment issue to arise, i.e., the foreground features in the source domain image are falsely aligned with background features in the target domain image. To address this issue, we systematically analyze the importance of foreground and background in image-level cross-domain alignment, and learn that background plays a more critical role in image-level cross-d",
    "path": "papers/23/09/2309.08771.json",
    "total_tokens": 924,
    "translated_title": "重新思考跨领域行人检测：一个以背景为重点的分布对齐框架用于无实例单阶段检测器",
    "translated_abstract": "跨领域行人检测旨在将行人检测器从一个标签丰富的领域推广到另一个标签稀缺的领域，这对各种实际应用非常重要。大多数最新的研究都专注于域对齐，以在实例级别或图像级别训练域自适应检测器。从实际角度来看，单阶段检测器更快。因此，我们专注于设计一种针对快速单阶段检测器的跨领域算法，该算法缺乏实例级别的提议，并且只能执行图像级别的特征对齐。然而，纯图像级特征对齐会导致前景和背景的不对齐问题，也就是源领域图像中的前景特征错误地与目标领域图像中的背景特征对齐。为了解决这个问题，我们系统地分析了图像级跨领域对齐中前景和背景的重要性，并发现背景在图像级跨领域对齐中起着更关键的作用。",
    "tldr": "本文提出了一个以背景为重点的分布对齐框架，用于解决无实例单阶段检测器中的前景背景对齐问题。",
    "en_tdlr": "This paper proposes a background-focused distribution alignment framework to address the foreground-background misalignment issue in instance-free one-stage detectors for cross-domain pedestrian detection."
}