{
    "title": "M3D-NCA: Robust 3D Segmentation with Built-in Quality Control. (arXiv:2309.02954v1 [cs.CV])",
    "abstract": "Medical image segmentation relies heavily on large-scale deep learning models, such as UNet-based architectures. However, the real-world utility of such models is limited by their high computational requirements, which makes them impractical for resource-constrained environments such as primary care facilities and conflict zones. Furthermore, shifts in the imaging domain can render these models ineffective and even compromise patient safety if such errors go undetected. To address these challenges, we propose M3D-NCA, a novel methodology that leverages Neural Cellular Automata (NCA) segmentation for 3D medical images using n-level patchification. Moreover, we exploit the variance in M3D-NCA to develop a novel quality metric which can automatically detect errors in the segmentation process of NCAs. M3D-NCA outperforms the two magnitudes larger UNet models in hippocampus and prostate segmentation by 2% Dice and can be run on a Raspberry Pi 4 Model B (2GB RAM). This highlights the potenti",
    "link": "http://arxiv.org/abs/2309.02954",
    "context": "Title: M3D-NCA: Robust 3D Segmentation with Built-in Quality Control. (arXiv:2309.02954v1 [cs.CV])\nAbstract: Medical image segmentation relies heavily on large-scale deep learning models, such as UNet-based architectures. However, the real-world utility of such models is limited by their high computational requirements, which makes them impractical for resource-constrained environments such as primary care facilities and conflict zones. Furthermore, shifts in the imaging domain can render these models ineffective and even compromise patient safety if such errors go undetected. To address these challenges, we propose M3D-NCA, a novel methodology that leverages Neural Cellular Automata (NCA) segmentation for 3D medical images using n-level patchification. Moreover, we exploit the variance in M3D-NCA to develop a novel quality metric which can automatically detect errors in the segmentation process of NCAs. M3D-NCA outperforms the two magnitudes larger UNet models in hippocampus and prostate segmentation by 2% Dice and can be run on a Raspberry Pi 4 Model B (2GB RAM). This highlights the potenti",
    "path": "papers/23/09/2309.02954.json",
    "total_tokens": 1008,
    "translated_title": "M3D-NCA: 具有内建质量控制的鲁棒的3D分割",
    "translated_abstract": "医学图像分割在很大程度上依赖于大规模的深度学习模型，例如基于UNet的架构。然而，这些模型的实际应用受到其高计算要求的限制，使其在资源受限环境（如初级保健设施和冲突地区）中不切实际。此外，图像领域的变化可能使这些模型失效，甚至在未发现错误的情况下危及患者安全。为了解决这些挑战，我们提出了一种新的方法，即M3D-NCA，它利用Neural Cellular Automata（NCA）分割进行3D医学图像处理，采用n级补丁化方法。此外，我们利用M3D-NCA中的差异来开发一种新的质量指标，可以自动检测NCA分割过程中的错误。M3D-NCA在海马体和前列腺分割方面的性能优于两个规模更大的UNet模型，其Dice系数提高2％，并且可以在Raspberry Pi 4 Model B（2GB RAM）上运行。这凸显了其潜力。",
    "tldr": "M3D-NCA是一种鲁棒的3D分割方法，具有内建质量控制，能够在资源受限的环境中运行。通过利用Neural Cellular Automata（NCA）分割和新的质量指标，M3D-NCA在海马体和前列腺分割中超越了大规模UNet模型。",
    "en_tdlr": "M3D-NCA is a robust 3D segmentation method with built-in quality control that can be used in resource-constrained environments. By leveraging Neural Cellular Automata (NCA) segmentation and a novel quality metric, M3D-NCA outperforms large-scale UNet models in hippocampus and prostate segmentation."
}