{
    "title": "Connecting the Dots in News Analysis: A Cross-Disciplinary Survey of Media Bias and Framing. (arXiv:2309.08069v1 [cs.CL])",
    "abstract": "The manifestation and effect of bias in news reporting have been central topics in the social sciences for decades, and have received increasing attention in the NLP community recently. While NLP can help to scale up analyses or contribute automatic procedures to investigate the impact of biased news in society, we argue that methodologies that are currently dominant fall short of addressing the complex questions and effects addressed in theoretical media studies. In this survey paper, we review social science approaches and draw a comparison with typical task formulations, methods, and evaluation metrics used in the analysis of media bias in NLP. We discuss open questions and suggest possible directions to close identified gaps between theory and predictive models, and their evaluation. These include model transparency, considering document-external information, and cross-document reasoning rather than single-label assignment.",
    "link": "http://arxiv.org/abs/2309.08069",
    "context": "Title: Connecting the Dots in News Analysis: A Cross-Disciplinary Survey of Media Bias and Framing. (arXiv:2309.08069v1 [cs.CL])\nAbstract: The manifestation and effect of bias in news reporting have been central topics in the social sciences for decades, and have received increasing attention in the NLP community recently. While NLP can help to scale up analyses or contribute automatic procedures to investigate the impact of biased news in society, we argue that methodologies that are currently dominant fall short of addressing the complex questions and effects addressed in theoretical media studies. In this survey paper, we review social science approaches and draw a comparison with typical task formulations, methods, and evaluation metrics used in the analysis of media bias in NLP. We discuss open questions and suggest possible directions to close identified gaps between theory and predictive models, and their evaluation. These include model transparency, considering document-external information, and cross-document reasoning rather than single-label assignment.",
    "path": "papers/23/09/2309.08069.json",
    "total_tokens": 896,
    "translated_title": "在新闻分析中连接各个点：关于媒体偏见和框架的跨学科调查",
    "translated_abstract": "偏见在新闻报道中的表现和影响是社会科学几十年来的核心议题，并且近年来在自然语言处理领域引起了越来越多的关注。虽然自然语言处理可以帮助扩大分析规模或提供自动化程序来调查偏见新闻对社会的影响，但我们认为目前主导地位的方法论未能解决理论媒体研究中涉及的复杂问题和影响。在这篇综述论文中，我们回顾了社会科学方法，并将其与自然语言处理领域中用于分析媒体偏见的典型任务形式、方法和评估指标进行了比较。我们讨论了开放性问题，并提出了解决理论模型和预测模型以及它们的评估之间鸿沟的可能方向。这些包括模型的透明度、考虑文档外部信息、以及跨文档推理而非单标签分配。",
    "tldr": "这篇综述论文回顾了社会科学方法和自然语言处理方法在分析媒体偏见方面的差异，并提出了解决当前方法论鸿沟的可能方向，包括模型透明度、考虑文档外部信息和跨文档推理。",
    "en_tdlr": "This survey paper reviews the differences between social science approaches and natural language processing methods in analyzing media bias, and suggests possible directions to bridge the gap between these two disciplines, including model transparency, considering external information, and cross-document reasoning."
}