{
    "title": "Heterogeneous Feature Representation for Digital Twin-Oriented Complex Networked Systems. (arXiv:2309.13229v1 [cs.AI])",
    "abstract": "Building models of Complex Networked Systems (CNS) that can accurately represent reality forms an important research area. To be able to reflect real world systems, the modelling needs to consider not only the intensity of interactions between the entities but also features of all the elements of the system. This study aims to improve the expressive power of node features in Digital Twin-Oriented Complex Networked Systems (DT-CNSs) with heterogeneous feature representation principles. This involves representing features with crisp feature values and fuzzy sets, each describing the objective and the subjective inductions of the nodes' features and feature differences. Our empirical analysis builds DT-CNSs to recreate realistic physical contact networks in different countries from real node feature distributions based on various representation principles and an optimised feature preference. We also investigate their respective disaster resilience to an epidemic outbreak starting from the",
    "link": "http://arxiv.org/abs/2309.13229",
    "context": "Title: Heterogeneous Feature Representation for Digital Twin-Oriented Complex Networked Systems. (arXiv:2309.13229v1 [cs.AI])\nAbstract: Building models of Complex Networked Systems (CNS) that can accurately represent reality forms an important research area. To be able to reflect real world systems, the modelling needs to consider not only the intensity of interactions between the entities but also features of all the elements of the system. This study aims to improve the expressive power of node features in Digital Twin-Oriented Complex Networked Systems (DT-CNSs) with heterogeneous feature representation principles. This involves representing features with crisp feature values and fuzzy sets, each describing the objective and the subjective inductions of the nodes' features and feature differences. Our empirical analysis builds DT-CNSs to recreate realistic physical contact networks in different countries from real node feature distributions based on various representation principles and an optimised feature preference. We also investigate their respective disaster resilience to an epidemic outbreak starting from the",
    "path": "papers/23/09/2309.13229.json",
    "total_tokens": 901,
    "translated_title": "面向数字孪生的复杂网络系统的异质特征表示",
    "translated_abstract": "构建能够准确表示现实的复杂网络系统(CNS)模型是一个重要的研究领域。为了能够反映现实世界的系统，建模需要考虑不仅仅是实体之间的相互作用强度，还要考虑系统中所有元素的特征。本研究旨在通过采用异质特征表示原则来提高数字孪生导向的复杂网络系统(DT-CNSs)中节点特征的表达能力。这涉及到使用清晰的特征值和模糊集合来表示特征，每个特征描述了节点特征和特征差异的客观和主观归纳。我们的实证分析基于各种表示原则和优化的特征偏好，建立DT-CNSs来重现不同国家的现实物理接触网络。我们还调查了它们对从流行病爆发开始的灾害韧性的影响。",
    "tldr": "本研究致力于提高数字孪生导向的复杂网络系统中节点特征的表达能力，通过使用异质特征表示原则，并通过实证分析建立了数字孪生导向的复杂网络系统来重现现实物理接触网络，进一步探究其对灾害韧性的影响。",
    "en_tdlr": "This study aims to improve the expressive power of node features in Digital Twin-Oriented Complex Networked Systems (DT-CNSs) by using heterogeneous feature representation principles. Through empirical analysis, realistic physical contact networks are recreated in DT-CNSs, and their respective disaster resilience is investigated."
}