{
    "title": "Measurement Models For Sailboats Price vs. Features And Regional Areas. (arXiv:2309.14994v1 [cs.LG])",
    "abstract": "In this study, we investigated the relationship between sailboat technical specifications and their prices, as well as regional pricing influences. Utilizing a dataset encompassing characteristics like length, beam, draft, displacement, sail area, and waterline, we applied multiple machine learning models to predict sailboat prices. The gradient descent model demonstrated superior performance, producing the lowest MSE and MAE. Our analysis revealed that monohulled boats are generally more affordable than catamarans, and that certain specifications such as length, beam, displacement, and sail area directly correlate with higher prices. Interestingly, lower draft was associated with higher listing prices. We also explored regional price determinants and found that the United States tops the list in average sailboat prices, followed by Europe, Hong Kong, and the Caribbean. Contrary to our initial hypothesis, a country's GDP showed no direct correlation with sailboat prices. Utilizing a 50",
    "link": "http://arxiv.org/abs/2309.14994",
    "context": "Title: Measurement Models For Sailboats Price vs. Features And Regional Areas. (arXiv:2309.14994v1 [cs.LG])\nAbstract: In this study, we investigated the relationship between sailboat technical specifications and their prices, as well as regional pricing influences. Utilizing a dataset encompassing characteristics like length, beam, draft, displacement, sail area, and waterline, we applied multiple machine learning models to predict sailboat prices. The gradient descent model demonstrated superior performance, producing the lowest MSE and MAE. Our analysis revealed that monohulled boats are generally more affordable than catamarans, and that certain specifications such as length, beam, displacement, and sail area directly correlate with higher prices. Interestingly, lower draft was associated with higher listing prices. We also explored regional price determinants and found that the United States tops the list in average sailboat prices, followed by Europe, Hong Kong, and the Caribbean. Contrary to our initial hypothesis, a country's GDP showed no direct correlation with sailboat prices. Utilizing a 50",
    "path": "papers/23/09/2309.14994.json",
    "total_tokens": 1006,
    "translated_title": "针对帆船价格和特征以及区域地区的测量模型",
    "translated_abstract": "在这项研究中，我们调查了帆船技术规格与其价格之间的关系，以及区域定价的影响。利用包括长度、宽度、吃水、排水量、帆面积和水线等特征的数据集，我们应用多个机器学习模型来预测帆船价格。梯度下降模型表现出优秀的性能，产生了最低的MSE和MAE。我们的分析发现，单体船通常比双体船更实惠，而长度、宽度、排水量和帆面积等特定规格与较高的价格直接相关。有趣的是，较低的吃水与较高的挂牌价格有关联。我们还探讨了区域定价因素，并发现美国在平均帆船价格上居首，其次是欧洲、香港和加勒比地区。与我们最初的假设相反，一个国家的GDP与帆船价格没有直接相关关系。",
    "tldr": "这项研究调查了帆船技术规格和价格之间的关系以及区域定价的影响。通过应用多个机器学习模型，我们发现单体船通常比双体船更实惠，并且长度、宽度、排水量和帆面积等特定规格与较高的价格直接相关。此外，我们还发现美国是平均帆船价格最高的国家，而国内生产总值与帆船价格没有直接相关关系。",
    "en_tdlr": "This study investigates the relationship between sailboat technical specifications and prices, as well as the influence of regional pricing. Multiple machine learning models were used to predict sailboat prices, revealing that monohulled boats are generally more affordable and certain specifications such as length and displacement directly correlate with higher prices. Additionally, the study found that the United States has the highest average sailboat prices and that a country's GDP does not directly correlate with sailboat prices."
}