{
    "title": "RecAD: Towards A Unified Library for Recommender Attack and Defense. (arXiv:2309.04884v1 [cs.IR])",
    "abstract": "In recent years, recommender systems have become a ubiquitous part of our daily lives, while they suffer from a high risk of being attacked due to the growing commercial and social values. Despite significant research progress in recommender attack and defense, there is a lack of a widely-recognized benchmarking standard in the field, leading to unfair performance comparison and limited credibility of experiments. To address this, we propose RecAD, a unified library aiming at establishing an open benchmark for recommender attack and defense. RecAD takes an initial step to set up a unified benchmarking pipeline for reproducible research by integrating diverse datasets, standard source codes, hyper-parameter settings, running logs, attack knowledge, attack budget, and evaluation results. The benchmark is designed to be comprehensive and sustainable, covering both attack, defense, and evaluation tasks, enabling more researchers to easily follow and contribute to this promising field. RecA",
    "link": "http://arxiv.org/abs/2309.04884",
    "context": "Title: RecAD: Towards A Unified Library for Recommender Attack and Defense. (arXiv:2309.04884v1 [cs.IR])\nAbstract: In recent years, recommender systems have become a ubiquitous part of our daily lives, while they suffer from a high risk of being attacked due to the growing commercial and social values. Despite significant research progress in recommender attack and defense, there is a lack of a widely-recognized benchmarking standard in the field, leading to unfair performance comparison and limited credibility of experiments. To address this, we propose RecAD, a unified library aiming at establishing an open benchmark for recommender attack and defense. RecAD takes an initial step to set up a unified benchmarking pipeline for reproducible research by integrating diverse datasets, standard source codes, hyper-parameter settings, running logs, attack knowledge, attack budget, and evaluation results. The benchmark is designed to be comprehensive and sustainable, covering both attack, defense, and evaluation tasks, enabling more researchers to easily follow and contribute to this promising field. RecA",
    "path": "papers/23/09/2309.04884.json",
    "total_tokens": 935,
    "translated_title": "RecAD: 向统一的推荐攻击和防御库迈进",
    "translated_abstract": "近年来，推荐系统已经成为我们日常生活中无处不在的一部分，然而由于不断增长的商业和社会价值，它们面临着被攻击的高风险。尽管在推荐攻击和防御方面取得了重要的研究进展，但该领域缺乏广泛认可的基准标准，导致性能比较不公平且实验可信度有限。为了解决这个问题，我们提出了RecAD，一个旨在建立推荐攻击和防御的开放基准的统一库。RecAD通过整合不同的数据集、标准源代码、超参数设置、运行日志、攻击知识、攻击预算和评估结果，初步建立了一个统一的基准测试流程，以实现可复现的研究。该基准测试旨在全面且可持续，涵盖攻击、防御和评估任务，使更多的研究人员能够轻松地追随和贡献这个有前景的领域。",
    "tldr": "RecAD是一个旨在建立推荐攻击和防御的开放基准的统一库，通过整合数据集、源代码、参数设置、运行日志、攻击知识、攻击预算和评估结果，为研究人员提供一个可复现的研究流程。",
    "en_tdlr": "RecAD is a unified library aiming to establish an open benchmark for recommender attack and defense, providing researchers with a reproducible research pipeline by integrating datasets, source codes, parameter settings, running logs, attack knowledge, attack budget, and evaluation results."
}