{
    "title": "Using AI Uncertainty Quantification to Improve Human Decision-Making. (arXiv:2309.10852v1 [cs.AI])",
    "abstract": "AI Uncertainty Quantification (UQ) has the potential to improve human decision-making beyond AI predictions alone by providing additional useful probabilistic information to users. The majority of past research on AI and human decision-making has concentrated on model explainability and interpretability. We implemented instance-based UQ for three real datasets. To achieve this, we trained different AI models for classification for each dataset, and used random samples generated around the neighborhood of the given instance to create confidence intervals for UQ. The computed UQ was calibrated using a strictly proper scoring rule as a form of quality assurance for UQ. We then conducted two preregistered online behavioral experiments that compared objective human decision-making performance under different AI information conditions, including UQ. In Experiment 1, we compared decision-making for no AI (control), AI prediction alone, and AI prediction with a visualization of UQ. We found UQ",
    "link": "http://arxiv.org/abs/2309.10852",
    "context": "Title: Using AI Uncertainty Quantification to Improve Human Decision-Making. (arXiv:2309.10852v1 [cs.AI])\nAbstract: AI Uncertainty Quantification (UQ) has the potential to improve human decision-making beyond AI predictions alone by providing additional useful probabilistic information to users. The majority of past research on AI and human decision-making has concentrated on model explainability and interpretability. We implemented instance-based UQ for three real datasets. To achieve this, we trained different AI models for classification for each dataset, and used random samples generated around the neighborhood of the given instance to create confidence intervals for UQ. The computed UQ was calibrated using a strictly proper scoring rule as a form of quality assurance for UQ. We then conducted two preregistered online behavioral experiments that compared objective human decision-making performance under different AI information conditions, including UQ. In Experiment 1, we compared decision-making for no AI (control), AI prediction alone, and AI prediction with a visualization of UQ. We found UQ",
    "path": "papers/23/09/2309.10852.json",
    "total_tokens": 853,
    "translated_title": "使用AI不确定性量化改进人类决策",
    "translated_abstract": "AI不确定性量化（UQ）有可能通过为用户提供有用的概率信息，超越单纯的AI预测，从而改进人类决策。过去的大部分关于AI和人类决策的研究都集中在模型可解释性和可解释性上。我们运用基于实例的UQ在三个真实数据集上实现了这一目标。为了实现这一目标，我们为每个数据集训练了不同的分类AI模型，并使用在给定实例附近生成的随机样本创建了UQ的置信区间。我们使用严格的适当评分规则对计算出的UQ进行了校准，作为UQ的质量保证。然后，我们进行了两个预先注册的在线行为实验，比较了不同AI信息条件下客观人类决策表现，包括UQ。在实验1中，我们比较了不使用AI（对照组）、仅使用AI预测和使用AI预测及UQ可视化的决策。我们发现UQ的使用可以提高人类决策的性能。",
    "tldr": "本论文研究了使用AI不确定性量化改进人类决策的方法，并通过基于实例的UQ和行为实验验证了其性能优势。",
    "en_tdlr": "This paper explores the method of using AI uncertainty quantification to improve human decision-making and verifies its performance advantages through instance-based UQ and behavioral experiments."
}