{
    "title": "Subsethood Measures of Spatial Granules. (arXiv:2309.02662v1 [cs.AI])",
    "abstract": "Subsethood, which is to measure the degree of set inclusion relation, is predominant in fuzzy set theory. This paper introduces some basic concepts of spatial granules, coarse-fine relation, and operations like meet, join, quotient meet and quotient join. All the atomic granules can be hierarchized by set-inclusion relation and all the granules can be hierarchized by coarse-fine relation. Viewing an information system from the micro and the macro perspectives, we can get a micro knowledge space and a micro knowledge space, from which a rough set model and a spatial rough granule model are respectively obtained. The classical rough set model is the special case of the rough set model induced from the micro knowledge space, while the spatial rough granule model will be play a pivotal role in the problem-solving of structures. We discuss twelve axioms of monotone increasing subsethood and twelve corresponding axioms of monotone decreasing supsethood, and generalize subsethood and supsetho",
    "link": "http://arxiv.org/abs/2309.02662",
    "context": "Title: Subsethood Measures of Spatial Granules. (arXiv:2309.02662v1 [cs.AI])\nAbstract: Subsethood, which is to measure the degree of set inclusion relation, is predominant in fuzzy set theory. This paper introduces some basic concepts of spatial granules, coarse-fine relation, and operations like meet, join, quotient meet and quotient join. All the atomic granules can be hierarchized by set-inclusion relation and all the granules can be hierarchized by coarse-fine relation. Viewing an information system from the micro and the macro perspectives, we can get a micro knowledge space and a micro knowledge space, from which a rough set model and a spatial rough granule model are respectively obtained. The classical rough set model is the special case of the rough set model induced from the micro knowledge space, while the spatial rough granule model will be play a pivotal role in the problem-solving of structures. We discuss twelve axioms of monotone increasing subsethood and twelve corresponding axioms of monotone decreasing supsethood, and generalize subsethood and supsetho",
    "path": "papers/23/09/2309.02662.json",
    "total_tokens": 914,
    "translated_title": "空间粒子的子集测度",
    "translated_abstract": "子集测度用于测量集合包含关系的程度，在模糊集合理论中占主导地位。本文介绍了空间粒子、粗精关系以及meet、join、quotient meet和quotient join等操作的基本概念。所有原子粒子可以通过集合包含关系进行层次化，所有粒子可以通过粗精关系进行层次化。通过从微观和宏观的视角看待信息系统，我们可以获得微观知识空间和宏观知识空间，从中分别获得一个粗糙集模型和一个空间粗糙粒子模型。经过从微观知识空间导出的粗糙集模型，是经典粗糙集模型的特殊情况，而空间粗糙粒子模型将在结构问题的解决中起到关键作用。我们讨论了十二个单调递增的子集测度公理和十二个相应的单调递减的超集测度公理，并推广了子集测度和超集测度。",
    "tldr": "本文介绍了空间粒子的子集测度以及与之相关的粗精关系和操作。通过这些概念，我们可以构建粗糙集模型和空间粗糙粒子模型，这对于解决结构问题非常重要。"
}