{
    "title": "Trustworthy and Synergistic Artificial Intelligence for Software Engineering: Vision and Roadmaps. (arXiv:2309.04142v1 [cs.SE])",
    "abstract": "For decades, much software engineering research has been dedicated to devising automated solutions aimed at enhancing developer productivity and elevating software quality. The past two decades have witnessed an unparalleled surge in the development of intelligent solutions tailored for software engineering tasks. This momentum established the Artificial Intelligence for Software Engineering (AI4SE) area, which has swiftly become one of the most active and popular areas within the software engineering field.  This Future of Software Engineering (FoSE) paper navigates through several focal points. It commences with a succinct introduction and history of AI4SE. Thereafter, it underscores the core challenges inherent to AI4SE, particularly highlighting the need to realize trustworthy and synergistic AI4SE. Progressing, the paper paints a vision for the potential leaps achievable if AI4SE's key challenges are surmounted, suggesting a transition towards Software Engineering 2.0. Two strateg",
    "link": "http://arxiv.org/abs/2309.04142",
    "context": "Title: Trustworthy and Synergistic Artificial Intelligence for Software Engineering: Vision and Roadmaps. (arXiv:2309.04142v1 [cs.SE])\nAbstract: For decades, much software engineering research has been dedicated to devising automated solutions aimed at enhancing developer productivity and elevating software quality. The past two decades have witnessed an unparalleled surge in the development of intelligent solutions tailored for software engineering tasks. This momentum established the Artificial Intelligence for Software Engineering (AI4SE) area, which has swiftly become one of the most active and popular areas within the software engineering field.  This Future of Software Engineering (FoSE) paper navigates through several focal points. It commences with a succinct introduction and history of AI4SE. Thereafter, it underscores the core challenges inherent to AI4SE, particularly highlighting the need to realize trustworthy and synergistic AI4SE. Progressing, the paper paints a vision for the potential leaps achievable if AI4SE's key challenges are surmounted, suggesting a transition towards Software Engineering 2.0. Two strateg",
    "path": "papers/23/09/2309.04142.json",
    "total_tokens": 831,
    "translated_title": "可信和协同的软件工程人工智能：愿景与路线图",
    "translated_abstract": "数十年来，软件工程研究一直致力于设计自动化解决方案，旨在提高开发人员的生产力和提升软件质量。过去的两个十年见证了专门为软件工程任务量身定制的智能解决方案的不断涌现。这个势头建立了软件工程领域中最活跃和最受欢迎的 Artificial Intelligence for Software Engineering (AI4SE) 领域。本文探讨了几个重点。它首先简要介绍和回顾了AI4SE的历史。随后，它强调了AI4SE固有的核心挑战，特别是强调了实现可信和协同的AI4SE的需求。进一步，本文描绘了一种愿景，即如果克服了AI4SE的核心挑战，将实现可达到的潜在飞跃，建议转向软件工程2.0.",
    "tldr": "本文提出了可信和协同的软件工程人工智能的愿景和路线图，旨在提高开发人员的生产力和软件质量。实现这个愿景可能导致软件工程领域的一个重要转变，即软件工程2.0."
}