{
    "title": "Learning Quasi-Static 3D Models of Markerless Deformable Linear Objects for Bimanual Robotic Manipulation. (arXiv:2309.07609v1 [cs.RO])",
    "abstract": "The robotic manipulation of Deformable Linear Objects (DLOs) is a vital and challenging task that is important in many practical applications. Classical model-based approaches to this problem require an accurate model to capture how robot motions affect the deformation of the DLO. Nowadays, data-driven models offer the best tradeoff between quality and computation time. This paper analyzes several learning-based 3D models of the DLO and proposes a new one based on the Transformer architecture that achieves superior accuracy, even on the DLOs of different lengths, thanks to the proposed scaling method. Moreover, we introduce a data augmentation technique, which improves the prediction performance of almost all considered DLO data-driven models. Thanks to this technique, even a simple Multilayer Perceptron (MLP) achieves close to state-of-the-art performance while being significantly faster to evaluate. In the experiments, we compare the performance of the learning-based 3D models of the",
    "link": "http://arxiv.org/abs/2309.07609",
    "context": "Title: Learning Quasi-Static 3D Models of Markerless Deformable Linear Objects for Bimanual Robotic Manipulation. (arXiv:2309.07609v1 [cs.RO])\nAbstract: The robotic manipulation of Deformable Linear Objects (DLOs) is a vital and challenging task that is important in many practical applications. Classical model-based approaches to this problem require an accurate model to capture how robot motions affect the deformation of the DLO. Nowadays, data-driven models offer the best tradeoff between quality and computation time. This paper analyzes several learning-based 3D models of the DLO and proposes a new one based on the Transformer architecture that achieves superior accuracy, even on the DLOs of different lengths, thanks to the proposed scaling method. Moreover, we introduce a data augmentation technique, which improves the prediction performance of almost all considered DLO data-driven models. Thanks to this technique, even a simple Multilayer Perceptron (MLP) achieves close to state-of-the-art performance while being significantly faster to evaluate. In the experiments, we compare the performance of the learning-based 3D models of the",
    "path": "papers/23/09/2309.07609.json",
    "total_tokens": 981,
    "translated_title": "学习非标记可变形一维物体的准静态3D模型，用于双手机器人操作",
    "translated_abstract": "可变形一维物体（DLOs）的机器人操作是一个重要且具有挑战性的任务，在许多实际应用中都很重要。传统的基于模型的方法需要一个准确的模型来捕捉机器人运动对DLO变形的影响。如今，基于数据驱动的模型在质量和计算时间之间提供了最好的权衡。本文分析了几种基于学习的DLO三维模型，并提出了一种基于Transformer架构的新模型，通过提出的缩放方法，在不同长度的DLO上实现了更高的精度。此外，我们引入了一种数据增强技术，提高了几乎所有考虑的DLO数据驱动模型的预测性能。借助这种技术，即使是简单的多层感知机（MLP）也能达到接近最先进性能的水平，而且计算速度更快。在实验中，我们比较了这些学习的3D模型的性能。",
    "tldr": "本文提出了一种基于Transformer架构的新的学习模型，通过缩放方法实现了不同长度的可变形一维物体的更高精度。此外，引入的数据增强技术大大提高了数据驱动模型的预测性能，甚至简单的多层感知机也能达到接近最先进性能的水平。",
    "en_tdlr": "This paper proposes a new learning model based on the Transformer architecture that achieves higher accuracy on deformable linear objects (DLOs) of different lengths. Additionally, the introduced data augmentation technique greatly improves the prediction performance of data-driven models, even enabling a simple Multilayer Perceptron (MLP) to achieve close to state-of-the-art performance."
}