{
    "title": "Multiple evolutionary pressures shape identical consonant avoidance in the world's languages. (arXiv:2309.14006v2 [cs.CL] UPDATED)",
    "abstract": "Languages disfavor word forms containing sequences of similar or identical consonants, due to the biomechanical and cognitive difficulties posed by patterns of this sort. However, the specific evolutionary processes responsible for this phenomenon are not fully understood. Words containing sequences of identical consonants may be more likely to arise than those without; processes of word form mutation may be more likely to remove than create sequences of identical consonants in word forms; finally, words containing identical consonants may die out more frequently than those without. Phylogenetic analyses of the evolution of homologous word forms indicate that words with identical consonants arise less frequently than those without, and processes which mutate word forms are more likely to remove sequences of identical consonants than introduce them. However, words with identical consonants do not die out more frequently than those without. Further analyses reveal that forms with identic",
    "link": "http://arxiv.org/abs/2309.14006",
    "context": "Title: Multiple evolutionary pressures shape identical consonant avoidance in the world's languages. (arXiv:2309.14006v2 [cs.CL] UPDATED)\nAbstract: Languages disfavor word forms containing sequences of similar or identical consonants, due to the biomechanical and cognitive difficulties posed by patterns of this sort. However, the specific evolutionary processes responsible for this phenomenon are not fully understood. Words containing sequences of identical consonants may be more likely to arise than those without; processes of word form mutation may be more likely to remove than create sequences of identical consonants in word forms; finally, words containing identical consonants may die out more frequently than those without. Phylogenetic analyses of the evolution of homologous word forms indicate that words with identical consonants arise less frequently than those without, and processes which mutate word forms are more likely to remove sequences of identical consonants than introduce them. However, words with identical consonants do not die out more frequently than those without. Further analyses reveal that forms with identic",
    "path": "papers/23/09/2309.14006.json",
    "total_tokens": 846,
    "translated_title": "多种进化压力塑造了世界语言中相同辅音的避讳现象",
    "translated_abstract": "由于生物力学和认知上的困难，语言不倾向于包含相似或相同辅音的单词形式。然而，负责这种现象的特定进化过程尚未完全理解。包含相同辅音序列的单词可能比没有这种序列的单词更容易产生；单词形式突变的过程可能更有可能移除而非引入相同辅音序列；最后，含有相同辅音的单词可能比没有的单词更容易消失。通过对同源词形的进化进行系统发育分析，结果显示含有相同辅音的单词比没有的单词更少出现，而导致单词形式发生突变的过程更有可能删除相同辅音序列而非引入它们。然而，含有相同辅音的单词并没有比没有的单词更容易消失。进一步分析发现，带有相同辅音的形态不同的单词比相同的单词更受到负面影响。",
    "tldr": "多种进化压力共同作用，塑造了世界语言中相同辅音的避忌现象，影响着单词的产生、形变和消失。"
}