{
    "title": "3D Object Positioning Using Differentiable Multimodal Learning. (arXiv:2309.03177v1 [eess.SY])",
    "abstract": "This article describes a multi-modal method using simulated Lidar data via ray tracing and image pixel loss with differentiable rendering to optimize an object's position with respect to an observer or some referential objects in a computer graphics scene. Object position optimization is completed using gradient descent with the loss function being influenced by both modalities. Typical object placement optimization is done using image pixel loss with differentiable rendering only, this work shows the use of a second modality (Lidar) leads to faster convergence. This method of fusing sensor input presents a potential usefulness for autonomous vehicles, as these methods can be used to establish the locations of multiple actors in a scene. This article also presents a method for the simulation of multiple types of data to be used in the training of autonomous vehicles.",
    "link": "http://arxiv.org/abs/2309.03177",
    "context": "Title: 3D Object Positioning Using Differentiable Multimodal Learning. (arXiv:2309.03177v1 [eess.SY])\nAbstract: This article describes a multi-modal method using simulated Lidar data via ray tracing and image pixel loss with differentiable rendering to optimize an object's position with respect to an observer or some referential objects in a computer graphics scene. Object position optimization is completed using gradient descent with the loss function being influenced by both modalities. Typical object placement optimization is done using image pixel loss with differentiable rendering only, this work shows the use of a second modality (Lidar) leads to faster convergence. This method of fusing sensor input presents a potential usefulness for autonomous vehicles, as these methods can be used to establish the locations of multiple actors in a scene. This article also presents a method for the simulation of multiple types of data to be used in the training of autonomous vehicles.",
    "path": "papers/23/09/2309.03177.json",
    "total_tokens": 878,
    "translated_title": "使用可微分多模态学习的三维物体定位",
    "translated_abstract": "本文介绍了一种使用模拟激光雷达数据和图像像素误差的多模态方法，通过可微分渲染来优化物体相对于观察者或某个参考物体在计算机图形场景中的位置。使用梯度下降完成物体位置优化，损失函数受到两种模态的影响。通常使用可微分渲染仅使用图像像素误差来进行物体放置优化，本文展示了使用第二种模态（激光雷达）能够加快收敛。融合传感器输入的这种方法为自动驾驶车辆提供了潜在的用途，因为这些方法可以用于确定场景中多个参与者的位置。本文还提出了一种用于训练自动驾驶车辆的多种数据模拟方法。",
    "tldr": "本文介绍了一种使用模拟激光雷达数据和图像像素误差的多模态方法，通过可微分渲染来优化物体在计算机图形场景中的位置。使用第二种模态（激光雷达）能够加快收敛，这为自动驾驶车辆提供了潜在的用途，并提出了多种数据模拟方法用于训练自动驾驶车辆。"
}