{
    "title": "A 3M-Hybrid Model for the Restoration of Unique Giant Murals: A Case Study on the Murals of Yongle Palace. (arXiv:2309.06194v1 [cs.CV])",
    "abstract": "The Yongle Palace murals, as valuable cultural heritage, have suffered varying degrees of damage, making their restoration of significant importance. However, the giant size and unique data of Yongle Palace murals present challenges for existing deep-learning based restoration methods: 1) The distinctive style introduces domain bias in traditional transfer learning-based restoration methods, while the scarcity of mural data further limits the applicability of these methods. 2) Additionally, the giant size of these murals results in a wider range of defect types and sizes, necessitating models with greater adaptability. Consequently, there is a lack of focus on deep learning-based restoration methods for the unique giant murals of Yongle Palace. Here, a 3M-Hybrid model is proposed to address these challenges. Firstly, based on the characteristic that the mural data frequency is prominent in the distribution of low and high frequency features, high and low frequency features are separate",
    "link": "http://arxiv.org/abs/2309.06194",
    "context": "Title: A 3M-Hybrid Model for the Restoration of Unique Giant Murals: A Case Study on the Murals of Yongle Palace. (arXiv:2309.06194v1 [cs.CV])\nAbstract: The Yongle Palace murals, as valuable cultural heritage, have suffered varying degrees of damage, making their restoration of significant importance. However, the giant size and unique data of Yongle Palace murals present challenges for existing deep-learning based restoration methods: 1) The distinctive style introduces domain bias in traditional transfer learning-based restoration methods, while the scarcity of mural data further limits the applicability of these methods. 2) Additionally, the giant size of these murals results in a wider range of defect types and sizes, necessitating models with greater adaptability. Consequently, there is a lack of focus on deep learning-based restoration methods for the unique giant murals of Yongle Palace. Here, a 3M-Hybrid model is proposed to address these challenges. Firstly, based on the characteristic that the mural data frequency is prominent in the distribution of low and high frequency features, high and low frequency features are separate",
    "path": "papers/23/09/2309.06194.json",
    "total_tokens": 1008,
    "translated_title": "一个用于恢复独特巨幅壁画的3M混合模型：以永乐宫壁画为例",
    "translated_abstract": "作为有价值的文化遗产，永乐宫壁画遭受了不同程度的损坏，因此对其进行修复具有重要意义。然而，永乐宫壁画的巨大尺寸和独特数据给现有基于深度学习的修复方法带来了挑战：1）独特的风格在传统的迁移学习修复方法中引入了领域偏差，而壁画数据的稀缺性进一步限制了这些方法的适用性。2）此外，这些壁画的巨大尺寸导致了更广泛的缺陷类型和尺寸范围，需要具有更大适应性的模型。因此，目前缺乏针对永乐宫独特巨幅壁画的基于深度学习的修复方法的研究。在这里，提出了一个3M混合模型来解决这些挑战。首先，基于壁画数据频率在低频和高频特征分布中显著，高频和低频特征被分开处理。",
    "tldr": "这项研究提出了一个3M混合模型来恢复永乐宫独特巨幅壁画，解决了传统修复方法中的领域偏差和数据稀缺性的问题，同时也能应对壁画巨大尺寸带来的更广泛缺陷类型和尺寸范围的挑战。",
    "en_tdlr": "This study proposes a 3M-Hybrid model to restore the unique giant murals of Yongle Palace, addressing the issues of domain bias and data scarcity in traditional restoration methods, as well as adapting to the wider range of defect types and sizes caused by the murals' enormous size."
}