{
    "title": "Probability of Default modelling with L\\'evy-driven Ornstein-Uhlenbeck processes and applications in credit risk under the IFRS 9. (arXiv:2309.12384v1 [q-fin.RM])",
    "abstract": "In this paper we develop a framework for estimating Probability of Default (PD) based on stochastic models governing an appropriate asset value processes. In particular, we build upon a L\\'evy-driven Ornstein-Uhlenbeck process and consider a generalized model that incorporates multiple latent variables affecting the evolution of the process. We obtain an Integral Equation (IE) formulation for the corresponding PD as a function of the initial position of the asset value process and the time until maturity, from which we then prove that the PD function satisfies an appropriate Partial Integro-Differential Equation (PIDE). These representations allow us to show that appropriate weak (viscosity) as well as strong solutions exist, and develop subsequent numerical schemes for the estimation of the PD function. Such a framework is necessary under the newly introduced International Financial Reporting Standards (IFRS) 9 regulation, which has imposed further requirements on the sophistication a",
    "link": "http://arxiv.org/abs/2309.12384",
    "context": "Title: Probability of Default modelling with L\\'evy-driven Ornstein-Uhlenbeck processes and applications in credit risk under the IFRS 9. (arXiv:2309.12384v1 [q-fin.RM])\nAbstract: In this paper we develop a framework for estimating Probability of Default (PD) based on stochastic models governing an appropriate asset value processes. In particular, we build upon a L\\'evy-driven Ornstein-Uhlenbeck process and consider a generalized model that incorporates multiple latent variables affecting the evolution of the process. We obtain an Integral Equation (IE) formulation for the corresponding PD as a function of the initial position of the asset value process and the time until maturity, from which we then prove that the PD function satisfies an appropriate Partial Integro-Differential Equation (PIDE). These representations allow us to show that appropriate weak (viscosity) as well as strong solutions exist, and develop subsequent numerical schemes for the estimation of the PD function. Such a framework is necessary under the newly introduced International Financial Reporting Standards (IFRS) 9 regulation, which has imposed further requirements on the sophistication a",
    "path": "papers/23/09/2309.12384.json",
    "total_tokens": 929,
    "translated_title": "使用L\\'evy驱动的Ornstein-Uhlenbeck过程进行违约概率建模及其在IFRS 9下的信用风险应用",
    "translated_abstract": "本文提出了一个基于随机模型的框架，用于估计基于恰当资产价值过程的违约概率（PD）。具体而言，我们基于L\\'evy驱动的Ornstein-Uhlenbeck过程，并考虑了一个包含多个潜变量影响该过程演化的广义模型。我们得到了相应PD的积分方程（IE）表达式，该方程描述了PD作为资产价值过程的初始位置和到期时间的函数。然后，我们证明了PD函数满足适当的偏积分微分方程（PIDE）。这些表示形式使我们能够显示适当的弱（粘度）解和强解存在，并开发出用于估计PD函数的数值方案。这样的框架在新引入的国际金融报告准则（IFRS）9规定下是必要的，该规定对复杂程度施加了进一步的要求。",
    "tldr": "本文通过使用L\\'evy驱动的Ornstein-Uhlenbeck过程，建立了一个估计违约概率的框架，在该框架中，考虑了多个潜变量对过程演化的影响，从而满足了国际金融报告准则（IFRS）9的要求。",
    "en_tdlr": "This paper develops a framework for estimating Probability of Default (PD) based on L\\'evy-driven Ornstein-Uhlenbeck processes, considering multiple latent variables affecting the process evolution. The framework satisfies the requirements of the International Financial Reporting Standards (IFRS) 9."
}