{
    "title": "A Physics Enhanced Residual Learning (PERL) Framework for Traffic State Prediction. (arXiv:2309.15284v1 [cs.LG])",
    "abstract": "In vehicle trajectory prediction, physics models and data-driven models are two predominant methodologies. However, each approach presents its own set of challenges: physics models fall short in predictability, while data-driven models lack interpretability. Addressing these identified shortcomings, this paper proposes a novel framework, the Physics-Enhanced Residual Learning (PERL) model. PERL integrates the strengths of physics-based and data-driven methods for traffic state prediction. PERL contains a physics model and a residual learning model. Its prediction is the sum of the physics model result and a predicted residual as a correction to it. It preserves the interpretability inherent to physics-based models and has reduced data requirements compared to data-driven methods. Experiments were conducted using a real-world vehicle trajectory dataset. We proposed a PERL model, with the Intelligent Driver Model (IDM) as its physics car-following model and Long Short-Term Memory (LSTM) ",
    "link": "http://arxiv.org/abs/2309.15284",
    "context": "Title: A Physics Enhanced Residual Learning (PERL) Framework for Traffic State Prediction. (arXiv:2309.15284v1 [cs.LG])\nAbstract: In vehicle trajectory prediction, physics models and data-driven models are two predominant methodologies. However, each approach presents its own set of challenges: physics models fall short in predictability, while data-driven models lack interpretability. Addressing these identified shortcomings, this paper proposes a novel framework, the Physics-Enhanced Residual Learning (PERL) model. PERL integrates the strengths of physics-based and data-driven methods for traffic state prediction. PERL contains a physics model and a residual learning model. Its prediction is the sum of the physics model result and a predicted residual as a correction to it. It preserves the interpretability inherent to physics-based models and has reduced data requirements compared to data-driven methods. Experiments were conducted using a real-world vehicle trajectory dataset. We proposed a PERL model, with the Intelligent Driver Model (IDM) as its physics car-following model and Long Short-Term Memory (LSTM) ",
    "path": "papers/23/09/2309.15284.json",
    "total_tokens": 1001,
    "translated_title": "一种用于交通状态预测的物理增强残差学习（PERL）框架",
    "translated_abstract": "在车辆轨迹预测中，物理模型和数据驱动模型是两种主要方法。然而，每种方法都存在自己的挑战：物理模型在可预测性方面不足，而数据驱动模型则缺乏可解释性。针对这些已确定的缺点，本文提出了一种新颖的框架，即物理增强残差学习（PERL）模型。PERL将物理模型和数据驱动方法的优势融合在一起，用于交通状态预测。PERL包括一个物理模型和一个残差学习模型。它的预测结果是物理模型结果和预测残差的和作为对其的修正。PERL保留了物理模型天然的可解释性，并且相比数据驱动方法具有较小的数据需求。我们使用实际车辆轨迹数据集进行了实验。我们提出了一个PERL模型，其中以智能驾驶模型（IDM）作为其物理车跟模型，长短期记忆（LSTM）模型用于学习残差。",
    "tldr": "这篇论文提出了一种名为物理增强残差学习（PERL）的框架，用于交通状态预测。PERL模型集成了物理模型和数据驱动模型的优势，通过将物理模型结果和预测残差作为修正相结合，具有可解释性，且比数据驱动方法要求更少的数据。"
}