{
    "title": "Optimizing delegation between human and AI collaborative agents. (arXiv:2309.14718v1 [cs.AI])",
    "abstract": "In the context of humans operating with artificial or autonomous agents in a hybrid team, it is essential to accurately identify when to authorize those team members to perform actions. Given past examples where humans and autonomous systems can either succeed or fail at tasks, we seek to train a delegating manager agent to make delegation decisions with respect to these potential performance deficiencies. Additionally, we cannot always expect the various agents to operate within the same underlying model of the environment. It is possible to encounter cases where the actions and transitions would vary between agents. Therefore, our framework provides a manager model which learns through observations of team performance without restricting agents to matching dynamics. Our results show our manager learns to perform delegation decisions with teams of agents operating under differing representations of the environment, significantly outperforming alternative methods to manage the team.",
    "link": "http://arxiv.org/abs/2309.14718",
    "context": "Title: Optimizing delegation between human and AI collaborative agents. (arXiv:2309.14718v1 [cs.AI])\nAbstract: In the context of humans operating with artificial or autonomous agents in a hybrid team, it is essential to accurately identify when to authorize those team members to perform actions. Given past examples where humans and autonomous systems can either succeed or fail at tasks, we seek to train a delegating manager agent to make delegation decisions with respect to these potential performance deficiencies. Additionally, we cannot always expect the various agents to operate within the same underlying model of the environment. It is possible to encounter cases where the actions and transitions would vary between agents. Therefore, our framework provides a manager model which learns through observations of team performance without restricting agents to matching dynamics. Our results show our manager learns to perform delegation decisions with teams of agents operating under differing representations of the environment, significantly outperforming alternative methods to manage the team.",
    "path": "papers/23/09/2309.14718.json",
    "total_tokens": 858,
    "translated_title": "优化人工智能和人类协作代理之间的委派",
    "translated_abstract": "在人类与人工智能或自主代理形成混合团队的情景中，精确地确定何时授权团队成员执行行动是至关重要的。鉴于过去的例子中，人类和自主系统在任务上可能成功也可能失败，我们试图训练一个代理管理器来根据这些潜在的绩效缺陷做出委派决策。此外，我们不能总是期望各种代理在相同的环境模型中运行。可能会遇到代理之间的行动和转换有所不同的情况。因此，我们的框架提供了一个经过观察团队绩效学习的管理模型，而不限制代理与匹配的动态。我们的结果表明，我们的管理器能够在操作环境的不同表示下进行委派决策，远远超过了其他管理团队方法。",
    "tldr": "该研究提出了一种优化人工智能和人类协作代理之间委派的方法，通过训练一个代理管理器根据任务绩效缺陷进行委派决策，并且可以处理不同环境表示下的团队操作。方法在实验中表现显著优于其他管理团队的方法。",
    "en_tdlr": "This study proposes a method to optimize delegation between AI and human collaborative agents, by training a manager agent to make delegation decisions based on performance deficiencies and accommodating different environment representations. The approach outperforms alternative methods in managing the team."
}