{
    "title": "Generalised Probabilistic Diffusion Scale-Spaces. (arXiv:2309.08511v1 [eess.IV])",
    "abstract": "Probabilistic diffusion models excel at sampling new images from learned distributions. Originally motivated by drift-diffusion concepts from physics, they apply image perturbations such as noise and blur in a forward process that results in a tractable probability distribution. A corresponding learned reverse process generates images and can be conditioned on side information, which leads to a wide variety of practical applications. Most of the research focus currently lies on practice-oriented extensions. In contrast, the theoretical background remains largely unexplored, in particular the relations to drift-diffusion. In order to shed light on these connections to classical image filtering, we propose a generalised scale-space theory for probabilistic diffusion models. Moreover, we show conceptual and empirical connections to diffusion and osmosis filters.",
    "link": "http://arxiv.org/abs/2309.08511",
    "context": "Title: Generalised Probabilistic Diffusion Scale-Spaces. (arXiv:2309.08511v1 [eess.IV])\nAbstract: Probabilistic diffusion models excel at sampling new images from learned distributions. Originally motivated by drift-diffusion concepts from physics, they apply image perturbations such as noise and blur in a forward process that results in a tractable probability distribution. A corresponding learned reverse process generates images and can be conditioned on side information, which leads to a wide variety of practical applications. Most of the research focus currently lies on practice-oriented extensions. In contrast, the theoretical background remains largely unexplored, in particular the relations to drift-diffusion. In order to shed light on these connections to classical image filtering, we propose a generalised scale-space theory for probabilistic diffusion models. Moreover, we show conceptual and empirical connections to diffusion and osmosis filters.",
    "path": "papers/23/09/2309.08511.json",
    "total_tokens": 813,
    "translated_title": "广义概率扩散尺度空间",
    "translated_abstract": "概率扩散模型在从学习的分布中采样新图像方面表现出色。最初由物理学中的漂移扩散概念推动，它们通过正向过程应用图像扰动，如噪声和模糊，从而产生可处理的概率分布。相应的学习逆过程生成图像，并可在附加信息条件下进行调整，从而导致各种实际应用。目前大部分研究重点放在实践导向的扩展上。相比之下，理论背景仍然大部分未被探索，尤其是与漂移扩散的关系。为了阐明与经典图像滤波的连接，我们提出了概率扩散模型的广义尺度空间理论。此外，我们展示了与扩散和渗透滤波的概念和经验联系。",
    "tldr": "本研究提出了概率扩散模型的广义尺度空间理论，探索了它与经典图像滤波的关系，以及与扩散和渗透滤波的概念和经验联系。",
    "en_tdlr": "This paper proposes a generalised scale-space theory for probabilistic diffusion models, with a focus on exploring their connections to classical image filtering and the concepts and empirical connections to diffusion and osmosis filters."
}