{
    "title": "Finite Element Analysis and Machine Learning Guided Design of Carbon Fiber Organosheet-based Battery Enclosures for Crashworthiness. (arXiv:2309.00637v1 [cs.LG])",
    "abstract": "Carbon fiber composite can be a potential candidate for replacing metal-based battery enclosures of current electric vehicles (E.V.s) owing to its better strength-to-weight ratio and corrosion resistance. However, the strength of carbon fiber-based structures depends on several parameters that should be carefully chosen. In this work, we implemented high throughput finite element analysis (FEA) based thermoforming simulation to virtually manufacture the battery enclosure using different design and processing parameters. Subsequently, we performed virtual crash simulations to mimic a side pole crash to evaluate the crashworthiness of the battery enclosures. This high throughput crash simulation dataset was utilized to build predictive models to understand the crashworthiness of an unknown set. Our machine learning (ML) models showed excellent performance (R2 > 0.97) in predicting the crashworthiness metrics, i.e., crush load efficiency, absorbed energy, intrusion, and maximum decelerati",
    "link": "http://arxiv.org/abs/2309.00637",
    "context": "Title: Finite Element Analysis and Machine Learning Guided Design of Carbon Fiber Organosheet-based Battery Enclosures for Crashworthiness. (arXiv:2309.00637v1 [cs.LG])\nAbstract: Carbon fiber composite can be a potential candidate for replacing metal-based battery enclosures of current electric vehicles (E.V.s) owing to its better strength-to-weight ratio and corrosion resistance. However, the strength of carbon fiber-based structures depends on several parameters that should be carefully chosen. In this work, we implemented high throughput finite element analysis (FEA) based thermoforming simulation to virtually manufacture the battery enclosure using different design and processing parameters. Subsequently, we performed virtual crash simulations to mimic a side pole crash to evaluate the crashworthiness of the battery enclosures. This high throughput crash simulation dataset was utilized to build predictive models to understand the crashworthiness of an unknown set. Our machine learning (ML) models showed excellent performance (R2 > 0.97) in predicting the crashworthiness metrics, i.e., crush load efficiency, absorbed energy, intrusion, and maximum decelerati",
    "path": "papers/23/09/2309.00637.json",
    "total_tokens": 927,
    "translated_title": "基于有限元分析和机器学习的碳纤维器片电池容器设计与碰撞性能",
    "translated_abstract": "由于具有更好的强度重量比和耐腐蚀性，碳纤维复合材料可以替代当前电动汽车的金属电池容器。然而，碳纤维结构的强度取决于几个需要仔细选择的参数。本研究中，我们实施了高通量的有限元分析（FEA）热成形模拟，以使用不同的设计和加工参数虚拟制造电池容器。随后，我们进行了虚拟碰撞模拟，模拟了侧杆碰撞，以评估电池容器的碰撞性能。这个高通量的碰撞模拟数据集被用来构建预测模型，以了解未知集的碰撞性能。我们的机器学习模型显示出优秀的性能（R2 > 0.97），可以预测碰撞性能指标，如压碎负荷效率、吸收能量、侵入和最大减速度。",
    "tldr": "本论文通过使用有限元分析和机器学习，实现了基于碳纤维器片的电池容器设计与碰撞性能的优化。模拟和预测结果表明，这种设计方法可以有效提高电池容器的碰撞强度和安全性。",
    "en_tdlr": "This paper proposes a design and optimization approach for carbon fiber organosheet-based battery enclosures using finite element analysis and machine learning. The simulation and prediction results demonstrate that this method can effectively improve the crashworthiness and safety of the battery enclosures."
}