{
    "title": "Kelvin Waves, Klein-Kramers and Kolmogorov Equations, Path-Dependent Financial Instruments: Survey and New Results. (arXiv:2309.04547v1 [q-fin.MF])",
    "abstract": "We discover several surprising relationships between large classes of seemingly unrelated foundational problems of financial engineering and fundamental problems of hydrodynamics and molecular physics. Solutions in all these domains can be reduced to solving affine differential equations commonly used in various mathematical and scientific disciplines to model dynamic systems. We have identified connections in these seemingly disparate areas as we link together small wave-like perturbations of linear flows in ideal and viscous fluids described in hydrodynamics by Kevin waves to motions of free and harmonically bound particles described in molecular physics by Klein-Kramers and Kolmogorov equations to Gaussian and non-Gaussian affine processes, e.g., Ornstein-Uhlenbeck and Feller, arising in financial engineering. To further emphasize the parallels between these diverse fields, we build a coherent mathematical framework using Kevin waves to construct transition probability density funct",
    "link": "http://arxiv.org/abs/2309.04547",
    "context": "Title: Kelvin Waves, Klein-Kramers and Kolmogorov Equations, Path-Dependent Financial Instruments: Survey and New Results. (arXiv:2309.04547v1 [q-fin.MF])\nAbstract: We discover several surprising relationships between large classes of seemingly unrelated foundational problems of financial engineering and fundamental problems of hydrodynamics and molecular physics. Solutions in all these domains can be reduced to solving affine differential equations commonly used in various mathematical and scientific disciplines to model dynamic systems. We have identified connections in these seemingly disparate areas as we link together small wave-like perturbations of linear flows in ideal and viscous fluids described in hydrodynamics by Kevin waves to motions of free and harmonically bound particles described in molecular physics by Klein-Kramers and Kolmogorov equations to Gaussian and non-Gaussian affine processes, e.g., Ornstein-Uhlenbeck and Feller, arising in financial engineering. To further emphasize the parallels between these diverse fields, we build a coherent mathematical framework using Kevin waves to construct transition probability density funct",
    "path": "papers/23/09/2309.04547.json",
    "total_tokens": 892,
    "translated_title": "Kelvin波、Klein-Kramers和Kolmogorov方程，路径依赖金融工具：调查和新结果的综述",
    "translated_abstract": "我们发现金融工程中看似无关的基础问题和流体力学以及分子物理学中的基本问题之间存在着一些令人惊讶的关系。在所有这些领域中，解决方案都可以归结为解决关于模拟动态系统常用的仿射微分方程。我们发现了这些看起来不相关的领域之间的联系，将在流体力学中描述的Kevin波中的线性流的小波状扰动与在分子物理学中描述的自由粒子和谐约束粒子的运动以及金融工程中产生的高斯和非高斯仿射过程（如Ornstein-Uhlenbeck和Feller过程）联系起来。为了进一步强调这些领域之间的类似之处，我们使用Kevin波构建了一个一致的数学框架来构建转移概率密度函数",
    "tldr": "该论文发现了金融工程、流体力学和分子物理学之间的关联，并建立了一个数学框架来描述这些关联。这些关联包括了Kevin波、Klein-Kramers和Kolmogorov方程以及仿射微分方程等内容。",
    "en_tdlr": "This paper explores the connections between financial engineering, hydrodynamics, and molecular physics, and establishes a mathematical framework to describe these connections. It focuses on the relationships between Kelvin waves, Klein-Kramers and Kolmogorov equations, and affine differential equations."
}