{
    "title": "TensorFlow Chaotic Prediction and Blow Up. (arXiv:2309.07450v1 [cs.LG])",
    "abstract": "Predicting the dynamics of chaotic systems is one of the most challenging tasks for neural networks, and machine learning in general. Here we aim to predict the spatiotemporal chaotic dynamics of a high-dimensional non-linear system. In our attempt we use the TensorFlow library, representing the state of the art for deep neural networks training and prediction. While our results are encouraging, and show that the dynamics of the considered system can be predicted for short time, we also indirectly discovered an unexpected and undesirable behavior of the TensorFlow library. More specifically, the longer term prediction of the system's chaotic behavior quickly deteriorates and blows up due to the nondeterministic behavior of the TensorFlow library. Here we provide numerical evidence of the short time prediction ability, and of the longer term predictability blow up.",
    "link": "http://arxiv.org/abs/2309.07450",
    "context": "Title: TensorFlow Chaotic Prediction and Blow Up. (arXiv:2309.07450v1 [cs.LG])\nAbstract: Predicting the dynamics of chaotic systems is one of the most challenging tasks for neural networks, and machine learning in general. Here we aim to predict the spatiotemporal chaotic dynamics of a high-dimensional non-linear system. In our attempt we use the TensorFlow library, representing the state of the art for deep neural networks training and prediction. While our results are encouraging, and show that the dynamics of the considered system can be predicted for short time, we also indirectly discovered an unexpected and undesirable behavior of the TensorFlow library. More specifically, the longer term prediction of the system's chaotic behavior quickly deteriorates and blows up due to the nondeterministic behavior of the TensorFlow library. Here we provide numerical evidence of the short time prediction ability, and of the longer term predictability blow up.",
    "path": "papers/23/09/2309.07450.json",
    "total_tokens": 747,
    "translated_title": "TensorFlow混沌预测与失控",
    "translated_abstract": "预测混沌系统的动力学是神经网络和机器学习的一项最具挑战性的任务之一。在这里，我们旨在预测一个高维非线性系统的时空混沌动态。在我们的尝试中，我们使用了代表深度神经网络训练和预测的TensorFlow库。虽然我们的结果令人鼓舞，并且显示出所考虑系统的动力学可以在短时间内被预测，但我们也间接发现了TensorFlow库的一个意外和不可取的行为。具体而言，由于TensorFlow库的非确定性行为，系统的长期预测行为迅速恶化和崩溃。在这里，我们提供了短期预测能力的数值证据，以及长期可预测性的崩溃。",
    "tldr": "该论文使用TensorFlow库来预测高维非线性系统的混沌动态，发现了TensorFlow库的长期预测行为有失控的问题。",
    "en_tdlr": "This paper predicts the chaotic dynamics of a high-dimensional non-linear system using TensorFlow library and discovers the undesirable behavior of TensorFlow library in longer-term prediction."
}