{
    "title": "KG-MDL: Mining Graph Patterns in Knowledge Graphs with the MDL Principle. (arXiv:2309.12908v1 [cs.AI])",
    "abstract": "Nowadays, increasingly more data are available as knowledge graphs (KGs). While this data model supports advanced reasoning and querying, they remain difficult to mine due to their size and complexity. Graph mining approaches can be used to extract patterns from KGs. However this presents two main issues. First, graph mining approaches tend to extract too many patterns for a human analyst to interpret (pattern explosion). Second, real-life KGs tend to differ from the graphs usually treated in graph mining: they are multigraphs, their vertex degrees tend to follow a power-law, and the way in which they model knowledge can produce spurious patterns. Recently, a graph mining approach named GraphMDL+ has been proposed to tackle the problem of pattern explosion, using the Minimum Description Length (MDL) principle. However, GraphMDL+, like other graph mining approaches, is not suited for KGs without adaptations. In this paper we propose KG-MDL, a graph pattern mining approach based on the M",
    "link": "http://arxiv.org/abs/2309.12908",
    "context": "Title: KG-MDL: Mining Graph Patterns in Knowledge Graphs with the MDL Principle. (arXiv:2309.12908v1 [cs.AI])\nAbstract: Nowadays, increasingly more data are available as knowledge graphs (KGs). While this data model supports advanced reasoning and querying, they remain difficult to mine due to their size and complexity. Graph mining approaches can be used to extract patterns from KGs. However this presents two main issues. First, graph mining approaches tend to extract too many patterns for a human analyst to interpret (pattern explosion). Second, real-life KGs tend to differ from the graphs usually treated in graph mining: they are multigraphs, their vertex degrees tend to follow a power-law, and the way in which they model knowledge can produce spurious patterns. Recently, a graph mining approach named GraphMDL+ has been proposed to tackle the problem of pattern explosion, using the Minimum Description Length (MDL) principle. However, GraphMDL+, like other graph mining approaches, is not suited for KGs without adaptations. In this paper we propose KG-MDL, a graph pattern mining approach based on the M",
    "path": "papers/23/09/2309.12908.json",
    "total_tokens": 909,
    "translated_title": "KG-MDL：使用MDL原则在知识图谱中挖掘图模式",
    "translated_abstract": "如今，越来越多的数据以知识图谱（KGs）的形式可用。虽然这种数据模型支持高级推理和查询，但由于大小和复杂性，它们仍然很难进行挖掘。图挖掘方法可以用来从KGs中提取模式。然而，这存在两个主要问题。首先，图挖掘方法往往会提取出过多的模式，以至于人类分析师难以解释（模式爆炸）。其次，现实生活中的KGs往往与常规图挖掘处理的图不同：它们是多图，其顶点度数往往遵循幂律，以及它们建模知识的方式可能会产生虚假模式。最近，一种名为GraphMDL+的图挖掘方法被提出来解决模式爆炸的问题，使用了最小描述长度（MDL）原则。然而，GraphMDL+和其他图挖掘方法不适用于未经修正的KGs。在本文中，我们提出了一种基于MDL原则的KG-MDL图模式挖掘方法。",
    "tldr": "KG-MDL是一种在知识图谱中挖掘图模式的方法，采用基于MDL原则，解决了模式爆炸问题，适应了KGs的特点。"
}