{
    "title": "DTC: Deep Tracking Control -- A Unifying Approach to Model-Based Planning and Reinforcement-Learning for Versatile and Robust Locomotion. (arXiv:2309.15462v1 [cs.RO] CROSS LISTED)",
    "abstract": "Legged locomotion is a complex control problem that requires both accuracy and robustness to cope with real-world challenges. Legged systems have traditionally been controlled using trajectory optimization with inverse dynamics. Such hierarchical model-based methods are appealing due to intuitive cost function tuning, accurate planning, and most importantly, the insightful understanding gained from more than one decade of extensive research. However, model mismatch and violation of assumptions are common sources of faulty operation and may hinder successful sim-to-real transfer. Simulation-based reinforcement learning, on the other hand, results in locomotion policies with unprecedented robustness and recovery skills. Yet, all learning algorithms struggle with sparse rewards emerging from environments where valid footholds are rare, such as gaps or stepping stones. In this work, we propose a hybrid control architecture that combines the advantages of both worlds to simultaneously achie",
    "link": "http://arxiv.org/abs/2309.15462",
    "context": "Title: DTC: Deep Tracking Control -- A Unifying Approach to Model-Based Planning and Reinforcement-Learning for Versatile and Robust Locomotion. (arXiv:2309.15462v1 [cs.RO] CROSS LISTED)\nAbstract: Legged locomotion is a complex control problem that requires both accuracy and robustness to cope with real-world challenges. Legged systems have traditionally been controlled using trajectory optimization with inverse dynamics. Such hierarchical model-based methods are appealing due to intuitive cost function tuning, accurate planning, and most importantly, the insightful understanding gained from more than one decade of extensive research. However, model mismatch and violation of assumptions are common sources of faulty operation and may hinder successful sim-to-real transfer. Simulation-based reinforcement learning, on the other hand, results in locomotion policies with unprecedented robustness and recovery skills. Yet, all learning algorithms struggle with sparse rewards emerging from environments where valid footholds are rare, such as gaps or stepping stones. In this work, we propose a hybrid control architecture that combines the advantages of both worlds to simultaneously achie",
    "path": "papers/23/09/2309.15462.json",
    "total_tokens": 979,
    "translated_title": "DTC: 深度跟踪控制--一种统一的基于模型的规划和强化学习方法，用于多功能和鲁棒的运动",
    "translated_abstract": "腿式运动是一个复杂的控制问题，需要精确性和鲁棒性来应对现实世界的挑战。传统上，腿式系统使用逆动力学的轨迹优化控制。这种层次化的基于模型的方法因其直观的成本函数调整、准确的规划以及超过十年的广泛研究所带来的深刻理解而具有吸引力。然而，模型不匹配和假设的违反是故障操作的常见原因，并可能妨碍成功的模拟到真实环境的转换。另一方面，基于仿真的强化学习产生了具有前所未有的鲁棒性和恢复能力的运动策略。然而，所有学习算法在稀疏奖励的环境中都面临着困难，这种环境中合法的落脚点很少，比如缺口或跳石。在这项工作中，我们提出了一种混合控制架构，结合了两个世界的优点，同时实现目标。",
    "tldr": "本文提出了一种混合控制架构，同时结合了基于模型的规划和基于强化学习的方法，用于解决腿式运动的复杂控制问题。这种方法具有精确性、鲁棒性以及对稀疏奖励环境的适应能力。",
    "en_tdlr": "This paper proposes a hybrid control architecture that combines model-based planning and reinforcement learning to tackle the complex control problem of legged locomotion. The approach offers accuracy, robustness, and adaptability to sparse reward environments."
}