{
    "title": "Energy-Aware Federated Learning with Distributed User Sampling and Multichannel ALOHA. (arXiv:2309.06033v1 [eess.SP])",
    "abstract": "Distributed learning on edge devices has attracted increased attention with the advent of federated learning (FL). Notably, edge devices often have limited battery and heterogeneous energy availability, while multiple rounds are required in FL for convergence, intensifying the need for energy efficiency. Energy depletion may hinder the training process and the efficient utilization of the trained model. To solve these problems, this letter considers the integration of energy harvesting (EH) devices into a FL network with multi-channel ALOHA, while proposing a method to ensure both low energy outage probability and successful execution of future tasks. Numerical results demonstrate the effectiveness of this method, particularly in critical setups where the average energy income fails to cover the iteration cost. The method outperforms a norm based solution in terms of convergence time and battery level.",
    "link": "http://arxiv.org/abs/2309.06033",
    "context": "Title: Energy-Aware Federated Learning with Distributed User Sampling and Multichannel ALOHA. (arXiv:2309.06033v1 [eess.SP])\nAbstract: Distributed learning on edge devices has attracted increased attention with the advent of federated learning (FL). Notably, edge devices often have limited battery and heterogeneous energy availability, while multiple rounds are required in FL for convergence, intensifying the need for energy efficiency. Energy depletion may hinder the training process and the efficient utilization of the trained model. To solve these problems, this letter considers the integration of energy harvesting (EH) devices into a FL network with multi-channel ALOHA, while proposing a method to ensure both low energy outage probability and successful execution of future tasks. Numerical results demonstrate the effectiveness of this method, particularly in critical setups where the average energy income fails to cover the iteration cost. The method outperforms a norm based solution in terms of convergence time and battery level.",
    "path": "papers/23/09/2309.06033.json",
    "total_tokens": 869,
    "translated_title": "具有分布式用户采样和多信道ALOHA的能源感知联邦学习",
    "translated_abstract": "随着联邦学习（FL）的出现，分布式设备上的分布式学习引起了越来越多的关注。值得注意的是，边缘设备通常具有有限的电池和异构的能源可用性，而FL需要多轮迭代才能收敛，加大了对能源效率的需求。能源耗尽可能会阻碍训练过程和训练模型的高效利用。为了解决这些问题，本文考虑将能量收集（EH）设备集成到具有多信道ALOHA的FL网络中，并提出一种方法来保证低能源中断概率和成功执行未来任务。数值结果表明这种方法的有效性，特别是在平均能量收入无法覆盖迭代成本的关键设置中。该方法在收敛时间和电池电量方面优于基于规范的解决方案。",
    "tldr": "本研究考虑了能量收集设备与多信道ALOHA相结合的联邦学习网络，提出了一种方法来解决能量耗尽问题，并确保任务的顺利执行。实验证明该方法在关键设置中的有效性和性能优于基于规范的解决方案。",
    "en_tdlr": "This study considers the integration of energy harvesting devices and multichannel ALOHA into a federated learning network, proposing a method to address energy depletion and ensure successful task execution. Experimental results demonstrate the effectiveness and performance superiority of this method in critical setups compared to norm-based solutions."
}