{
    "title": "Graph Contrastive Learning Meets Graph Meta Learning: A Unified Method for Few-shot Node Tasks. (arXiv:2309.10376v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) have become popular in Graph Representation Learning (GRL). One fundamental application is few-shot node classification. Most existing methods follow the meta learning paradigm, showing the ability of fast generalization to few-shot tasks. However, recent works indicate that graph contrastive learning combined with fine-tuning can significantly outperform meta learning methods. Despite the empirical success, there is limited understanding of the reasons behind it. In our study, we first identify two crucial advantages of contrastive learning compared to meta learning, including (1) the comprehensive utilization of graph nodes and (2) the power of graph augmentations. To integrate the strength of both contrastive learning and meta learning on the few-shot node classification tasks, we introduce a new paradigm: Contrastive Few-Shot Node Classification (COLA). Specifically, COLA employs graph augmentations to identify semantically similar nodes, which enables ",
    "link": "http://arxiv.org/abs/2309.10376",
    "context": "Title: Graph Contrastive Learning Meets Graph Meta Learning: A Unified Method for Few-shot Node Tasks. (arXiv:2309.10376v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) have become popular in Graph Representation Learning (GRL). One fundamental application is few-shot node classification. Most existing methods follow the meta learning paradigm, showing the ability of fast generalization to few-shot tasks. However, recent works indicate that graph contrastive learning combined with fine-tuning can significantly outperform meta learning methods. Despite the empirical success, there is limited understanding of the reasons behind it. In our study, we first identify two crucial advantages of contrastive learning compared to meta learning, including (1) the comprehensive utilization of graph nodes and (2) the power of graph augmentations. To integrate the strength of both contrastive learning and meta learning on the few-shot node classification tasks, we introduce a new paradigm: Contrastive Few-Shot Node Classification (COLA). Specifically, COLA employs graph augmentations to identify semantically similar nodes, which enables ",
    "path": "papers/23/09/2309.10376.json",
    "total_tokens": 894,
    "translated_title": "图对比学习与图元学习相遇：一种统一的用于少样本节点任务的方法",
    "translated_abstract": "图神经网络（GNNs）已经在图表示学习（GRL）中变得流行起来。其中一个基本应用是少样本节点分类。大多数现有的方法都遵循元学习范式，展示了对少样本任务快速泛化的能力。然而，最近的研究表明，图对比学习结合微调可以明显优于元学习方法。尽管在经验上取得了成功，但对其背后原因的理解有限。在我们的研究中，我们首先确定了图对比学习相对于元学习的两个关键优势，包括（1）全面利用图节点和（2）图扩增的能力。为了将图对比学习和元学习的优势结合到少样本节点分类任务中，我们引入了一种新的范式：对比式少样本节点分类（COLA）。具体来说，COLA利用图扩增来识别语义相似的节点，从而使得",
    "tldr": "COLA是一种统一的方法，整合了图对比学习和元学习的优势，用于少样本节点分类任务。它利用图扩增来识别语义相似的节点，从而使得能够在少样本情况下进行快速泛化。",
    "en_tdlr": "COLA is a unified method that integrates the advantages of graph contrastive learning and meta learning for few-shot node classification tasks. It uses graph augmentations to identify semantically similar nodes, enabling fast generalization in few-shot scenarios."
}