{
    "title": "Age Minimization in Massive IoT via UAV Swarm: A Multi-agent Reinforcement Learning Approach. (arXiv:2309.14757v1 [cs.LG])",
    "abstract": "In many massive IoT communication scenarios, the IoT devices require coverage from dynamic units that can move close to the IoT devices and reduce the uplink energy consumption. A robust solution is to deploy a large number of UAVs (UAV swarm) to provide coverage and a better line of sight (LoS) for the IoT network. However, the study of these massive IoT scenarios with a massive number of serving units leads to high dimensional problems with high complexity. In this paper, we apply multi-agent deep reinforcement learning to address the high-dimensional problem that results from deploying a swarm of UAVs to collect fresh information from IoT devices. The target is to minimize the overall age of information in the IoT network. The results reveal that both cooperative and partially cooperative multi-agent deep reinforcement learning approaches are able to outperform the high-complexity centralized deep reinforcement learning approach, which stands helpless in large-scale networks.",
    "link": "http://arxiv.org/abs/2309.14757",
    "context": "Title: Age Minimization in Massive IoT via UAV Swarm: A Multi-agent Reinforcement Learning Approach. (arXiv:2309.14757v1 [cs.LG])\nAbstract: In many massive IoT communication scenarios, the IoT devices require coverage from dynamic units that can move close to the IoT devices and reduce the uplink energy consumption. A robust solution is to deploy a large number of UAVs (UAV swarm) to provide coverage and a better line of sight (LoS) for the IoT network. However, the study of these massive IoT scenarios with a massive number of serving units leads to high dimensional problems with high complexity. In this paper, we apply multi-agent deep reinforcement learning to address the high-dimensional problem that results from deploying a swarm of UAVs to collect fresh information from IoT devices. The target is to minimize the overall age of information in the IoT network. The results reveal that both cooperative and partially cooperative multi-agent deep reinforcement learning approaches are able to outperform the high-complexity centralized deep reinforcement learning approach, which stands helpless in large-scale networks.",
    "path": "papers/23/09/2309.14757.json",
    "total_tokens": 966,
    "translated_title": "通过无人机群实现大规模物联网的年龄最小化：一种多智能体强化学习方法",
    "translated_abstract": "在许多大规模物联网通信场景中，物联网设备需要由能够靠近物联网设备并减少上行能量消耗的动态单元进行覆盖。一种强大的解决方案是部署大量无人机（无人机群）提供覆盖并为物联网网络提供更好的视线连通性。然而，研究这些具有大量服务单元的大规模物联网场景会引导出具有高复杂性的高维问题。在本文中，我们应用多智能体深度强化学习来解决由部署无人机群从物联网设备收集实时信息引起的高维问题。目标是将物联网网络中的信息年龄最小化。结果表明，合作和部分合作的多智能体深度强化学习方法能够胜过高复杂性的集中式深度强化学习方法，在大规模网络中表现出无能为力。",
    "tldr": "本论文通过应用多智能体深度强化学习方法，利用无人机群从物联网设备收集实时信息，以实现大规模物联网中信息的年龄最小化。研究结果表明，合作和部分合作的多智能体深度强化学习方法能够优于传统的集中式深度强化学习方法，在大规模网络中具有更好的性能表现。",
    "en_tdlr": "This paper proposes a multi-agent deep reinforcement learning approach to minimize the overall age of information in massive IoT networks by deploying a swarm of UAVs to collect fresh information from IoT devices. The results demonstrate that cooperative and partially cooperative multi-agent deep reinforcement learning approaches outperform the traditional centralized deep reinforcement learning method, especially in large-scale networks."
}