{
    "title": "Turaco: Complexity-Guided Data Sampling for Training Neural Surrogates of Programs. (arXiv:2309.11726v1 [cs.PL])",
    "abstract": "Programmers and researchers are increasingly developing surrogates of programs, models of a subset of the observable behavior of a given program, to solve a variety of software development challenges. Programmers train surrogates from measurements of the behavior of a program on a dataset of input examples. A key challenge of surrogate construction is determining what training data to use to train a surrogate of a given program.  We present a methodology for sampling datasets to train neural-network-based surrogates of programs. We first characterize the proportion of data to sample from each region of a program's input space (corresponding to different execution paths of the program) based on the complexity of learning a surrogate of the corresponding execution path. We next provide a program analysis to determine the complexity of different paths in a program. We evaluate these results on a range of real-world programs, demonstrating that complexity-guided sampling results in empiric",
    "link": "http://arxiv.org/abs/2309.11726",
    "context": "Title: Turaco: Complexity-Guided Data Sampling for Training Neural Surrogates of Programs. (arXiv:2309.11726v1 [cs.PL])\nAbstract: Programmers and researchers are increasingly developing surrogates of programs, models of a subset of the observable behavior of a given program, to solve a variety of software development challenges. Programmers train surrogates from measurements of the behavior of a program on a dataset of input examples. A key challenge of surrogate construction is determining what training data to use to train a surrogate of a given program.  We present a methodology for sampling datasets to train neural-network-based surrogates of programs. We first characterize the proportion of data to sample from each region of a program's input space (corresponding to different execution paths of the program) based on the complexity of learning a surrogate of the corresponding execution path. We next provide a program analysis to determine the complexity of different paths in a program. We evaluate these results on a range of real-world programs, demonstrating that complexity-guided sampling results in empiric",
    "path": "papers/23/09/2309.11726.json",
    "total_tokens": 922,
    "translated_title": "Turaco：用于训练程序神经替代模型的复杂度引导数据采样",
    "translated_abstract": "程序员和研究人员越来越多地开发程序的替代模型，即给定程序可观察行为的子集模型，以解决各种软件开发挑战。程序员会根据程序在输入示例数据集上的行为测量结果来训练替代模型。替代模型构建的一个关键挑战是确定用于训练给定程序替代模型的训练数据。我们提出了一种采样数据集的方法来训练基于神经网络的程序替代模型。我们首先根据学习对应执行路径替代模型的复杂度，确定从程序输入空间的每个区域中采样的数据比例。然后我们提供了一种程序分析方法，以确定程序中不同路径的复杂度。我们在一系列真实世界的程序上评估了这些结果，证明了复杂度引导采样的实证效果。",
    "tldr": "该论文提出了一种方法来训练程序的神经替代模型，通过根据执行路径的复杂度来确定采样数据的比例，以解决程序替代模型构建中的关键挑战。该方法在真实世界的程序上进行了评估，并证明了复杂度引导采样的实证效果。",
    "en_tdlr": "This paper presents a methodology for training neural surrogate models of programs by determining the proportion of data to sample from each region of a program's input space based on the complexity of learning a surrogate of the corresponding execution path. It addresses the key challenge of surrogate construction and has been evaluated on real-world programs, demonstrating the effectiveness of complexity-guided sampling."
}