{
    "title": "Class Attendance System in Education with Deep Learning Method. (arXiv:2309.13317v1 [cs.CV])",
    "abstract": "With the advancing technology, the hardware gain of computers and the increase in the processing capacity of processors have facilitated the processing of instantaneous and real-time images. Face recognition processes are also studies in the field of image processing. Facial recognition processes are frequently used in security applications and commercial applications. Especially in the last 20 years, the high performances of artificial intelligence (AI) studies have contributed to the spread of these studies in many different fields. Education is one of them. The potential and advantages of using AI in education; can be grouped under three headings: student, teacher, and institution. One of the institutional studies may be the security of educational environments and the contribution of automation to education and training processes. From this point of view, deep learning methods, one of the sub-branches of AI, were used in this study. For object detection from images, a pioneering st",
    "link": "http://arxiv.org/abs/2309.13317",
    "context": "Title: Class Attendance System in Education with Deep Learning Method. (arXiv:2309.13317v1 [cs.CV])\nAbstract: With the advancing technology, the hardware gain of computers and the increase in the processing capacity of processors have facilitated the processing of instantaneous and real-time images. Face recognition processes are also studies in the field of image processing. Facial recognition processes are frequently used in security applications and commercial applications. Especially in the last 20 years, the high performances of artificial intelligence (AI) studies have contributed to the spread of these studies in many different fields. Education is one of them. The potential and advantages of using AI in education; can be grouped under three headings: student, teacher, and institution. One of the institutional studies may be the security of educational environments and the contribution of automation to education and training processes. From this point of view, deep learning methods, one of the sub-branches of AI, were used in this study. For object detection from images, a pioneering st",
    "path": "papers/23/09/2309.13317.json",
    "total_tokens": 874,
    "translated_title": "教育中的深度学习方法实现的课堂考勤系统",
    "translated_abstract": "随着技术的进步，计算机的硬件增益和处理器的处理能力的提升，使得即时和实时图像的处理变得更加容易。面部识别过程也是图像处理领域的研究。面部识别过程经常在安全应用和商业应用中使用。特别是在过去的20年里，人工智能（AI）研究的高性能对这些研究在许多不同领域的扩散做出了贡献。教育便是其中之一。使用AI在教育中的潜力和优势可以分为三个方面：学生、教师和机构。机构研究之一可能是教育环境的安全性以及自动化对教育和培训过程的贡献。从这个角度来看，本研究采用了深度学习方法，这是AI的一个子分支。对于从图像中进行对象检测，本研究进行了开创性的工作。",
    "tldr": "该论文介绍了利用深度学习方法实现的课堂考勤系统。深度学习方法可以通过图像处理进行面部识别，从而在教育中提供安全性和自动化的贡献。",
    "en_tdlr": "This paper presents a class attendance system implemented using deep learning methods. The deep learning methods enable facial recognition through image processing, providing security and automation benefits in education."
}