{
    "title": "Exploiting the Signal-Leak Bias in Diffusion Models. (arXiv:2309.15842v1 [cs.CV])",
    "abstract": "There is a bias in the inference pipeline of most diffusion models. This bias arises from a signal leak whose distribution deviates from the noise distribution, creating a discrepancy between training and inference processes. We demonstrate that this signal-leak bias is particularly significant when models are tuned to a specific style, causing sub-optimal style matching. Recent research tries to avoid the signal leakage during training. We instead show how we can exploit this signal-leak bias in existing diffusion models to allow more control over the generated images. This enables us to generate images with more varied brightness, and images that better match a desired style or color. By modeling the distribution of the signal leak in the spatial frequency and pixel domains, and including a signal leak in the initial latent, we generate images that better match expected results without any additional training.",
    "link": "http://arxiv.org/abs/2309.15842",
    "context": "Title: Exploiting the Signal-Leak Bias in Diffusion Models. (arXiv:2309.15842v1 [cs.CV])\nAbstract: There is a bias in the inference pipeline of most diffusion models. This bias arises from a signal leak whose distribution deviates from the noise distribution, creating a discrepancy between training and inference processes. We demonstrate that this signal-leak bias is particularly significant when models are tuned to a specific style, causing sub-optimal style matching. Recent research tries to avoid the signal leakage during training. We instead show how we can exploit this signal-leak bias in existing diffusion models to allow more control over the generated images. This enables us to generate images with more varied brightness, and images that better match a desired style or color. By modeling the distribution of the signal leak in the spatial frequency and pixel domains, and including a signal leak in the initial latent, we generate images that better match expected results without any additional training.",
    "path": "papers/23/09/2309.15842.json",
    "total_tokens": 862,
    "translated_title": "利用扩散模型中的信号泄漏偏差",
    "translated_abstract": "大多数扩散模型的推理过程中存在偏差。这种偏差是由信号泄漏引起的，其分布与噪声分布不一致，导致训练和推理过程之间存在差异。我们证明了在模型针对特定风格进行调优时，这种信号泄漏偏差特别显著，导致风格匹配不够优化。最近的研究试图在训练过程中避免信号泄漏。我们相反地展示了如何利用现有的扩散模型中的信号泄漏偏差，以实现对生成图像的更好控制。这使我们能够生成亮度更多样化的图像以及更能匹配所需风格或颜色的图像。通过对空间频率和像素域中的信号泄漏进行建模，并在初始潜变量中引入信号泄漏，我们生成更符合预期结果的图像，而无需额外的训练。",
    "tldr": "本文展示了如何利用现有扩散模型中的信号泄漏偏差，以实现对生成图像的更好控制，并生成更多样化的亮度以及更满足特定风格和颜色要求的图像。"
}