{
    "title": "Fuzzy Fingerprinting Transformer Language-Models for Emotion Recognition in Conversations. (arXiv:2309.04292v1 [cs.CL])",
    "abstract": "Fuzzy Fingerprints have been successfully used as an interpretable text classification technique, but, like most other techniques, have been largely surpassed in performance by Large Pre-trained Language Models, such as BERT or RoBERTa. These models deliver state-of-the-art results in several Natural Language Processing tasks, namely Emotion Recognition in Conversations (ERC), but suffer from the lack of interpretability and explainability. In this paper, we propose to combine the two approaches to perform ERC, as a means to obtain simpler and more interpretable Large Language Models-based classifiers. We propose to feed the utterances and their previous conversational turns to a pre-trained RoBERTa, obtaining contextual embedding utterance representations, that are then supplied to an adapted Fuzzy Fingerprint classification module. We validate our approach on the widely used DailyDialog ERC benchmark dataset, in which we obtain state-of-the-art level results using a much lighter mode",
    "link": "http://arxiv.org/abs/2309.04292",
    "context": "Title: Fuzzy Fingerprinting Transformer Language-Models for Emotion Recognition in Conversations. (arXiv:2309.04292v1 [cs.CL])\nAbstract: Fuzzy Fingerprints have been successfully used as an interpretable text classification technique, but, like most other techniques, have been largely surpassed in performance by Large Pre-trained Language Models, such as BERT or RoBERTa. These models deliver state-of-the-art results in several Natural Language Processing tasks, namely Emotion Recognition in Conversations (ERC), but suffer from the lack of interpretability and explainability. In this paper, we propose to combine the two approaches to perform ERC, as a means to obtain simpler and more interpretable Large Language Models-based classifiers. We propose to feed the utterances and their previous conversational turns to a pre-trained RoBERTa, obtaining contextual embedding utterance representations, that are then supplied to an adapted Fuzzy Fingerprint classification module. We validate our approach on the widely used DailyDialog ERC benchmark dataset, in which we obtain state-of-the-art level results using a much lighter mode",
    "path": "papers/23/09/2309.04292.json",
    "total_tokens": 854,
    "translated_title": "模糊指纹转换器语言模型用于对话情感识别",
    "translated_abstract": "模糊指纹已成功用作可解释的文本分类技术，但与大多数其他技术一样，在性能上已被大型预训练语言模型（例如BERT或RoBERTa）大大超越。这些模型在几个自然语言处理任务中取得了最先进的结果，即对话情感识别（ERC），但缺乏可解释性和说明性。在本文中，我们提出将这两种方法结合起来进行ERC，以获得更简单和更可解释的基于大型语言模型的分类器。我们提出将话语及其之前的对话转化为预训练的RoBERTa，并获取上下文嵌入的话语表示，然后将其提供给适应的模糊指纹分类模块。我们在广泛使用的DailyDialog ERC基准数据集上验证了我们的方法，结果显示我们使用了更轻量级的模型获得了最先进的水平。",
    "tldr": "本文提出将模糊指纹和大型语言模型相结合，用于对话情感识别，以获得更简单和更可解释的分类器，并在DailyDialog ERC基准数据集上取得最先进的结果。",
    "en_tdlr": "This paper proposes combining fuzzy fingerprints with large language models for emotion recognition in conversations, aiming to obtain simpler and more interpretable classifiers. The approach achieves state-of-the-art results on the DailyDialog ERC benchmark dataset using a lighter model."
}