{
    "title": "A Comprehensive Survey on Rare Event Prediction. (arXiv:2309.11356v1 [cs.AI])",
    "abstract": "Rare event prediction involves identifying and forecasting events with a low probability using machine learning and data analysis. Due to the imbalanced data distributions, where the frequency of common events vastly outweighs that of rare events, it requires using specialized methods within each step of the machine learning pipeline, i.e., from data processing to algorithms to evaluation protocols. Predicting the occurrences of rare events is important for real-world applications, such as Industry 4.0, and is an active research area in statistical and machine learning. This paper comprehensively reviews the current approaches for rare event prediction along four dimensions: rare event data, data processing, algorithmic approaches, and evaluation approaches. Specifically, we consider 73 datasets from different modalities (i.e., numerical, image, text, and audio), four major categories of data processing, five major algorithmic groupings, and two broader evaluation approaches. This pape",
    "link": "http://arxiv.org/abs/2309.11356",
    "context": "Title: A Comprehensive Survey on Rare Event Prediction. (arXiv:2309.11356v1 [cs.AI])\nAbstract: Rare event prediction involves identifying and forecasting events with a low probability using machine learning and data analysis. Due to the imbalanced data distributions, where the frequency of common events vastly outweighs that of rare events, it requires using specialized methods within each step of the machine learning pipeline, i.e., from data processing to algorithms to evaluation protocols. Predicting the occurrences of rare events is important for real-world applications, such as Industry 4.0, and is an active research area in statistical and machine learning. This paper comprehensively reviews the current approaches for rare event prediction along four dimensions: rare event data, data processing, algorithmic approaches, and evaluation approaches. Specifically, we consider 73 datasets from different modalities (i.e., numerical, image, text, and audio), four major categories of data processing, five major algorithmic groupings, and two broader evaluation approaches. This pape",
    "path": "papers/23/09/2309.11356.json",
    "total_tokens": 854,
    "translated_title": "针对罕见事件预测的综合调研",
    "translated_abstract": "罕见事件预测涉及使用机器学习和数据分析识别和预测低概率事件。由于数据分布不平衡，普通事件的频率远远超过罕见事件的频率，因此需要在机器学习流程的每个步骤中使用专门的方法，从数据处理到算法到评估协议。预测罕见事件的发生对于工业4.0等实际应用非常重要，也是统计和机器学习领域的一个活跃的研究领域。本文综合评估了罕见事件预测的当前方法，从罕见事件数据、数据处理、算法方法和评估方法四个维度考虑。具体来说，我们考虑了来自不同模态的73个数据集（数值、图像、文本和音频），四个主要的数据处理分类，五个主要的算法分类和两个更广泛的评估方法。",
    "tldr": "本文综合调研了罕见事件预测领域的当前方法，通过考虑罕见事件数据、数据处理、算法方法和评估方法四个维度，总结出了在机器学习流程中解决罕见事件预测问题的关键方法。",
    "en_tdlr": "This paper provides a comprehensive survey of current approaches in rare event prediction, summarizing key methods for addressing the problem in the machine learning pipeline by considering rare event data, data processing, algorithmic approaches, and evaluation methods."
}