{
    "title": "Soft Mixture Denoising: Beyond the Expressive Bottleneck of Diffusion Models. (arXiv:2309.14068v2 [cs.LG] UPDATED)",
    "abstract": "Because diffusion models have shown impressive performances in a number of tasks, such as image synthesis, there is a trend in recent works to prove (with certain assumptions) that these models have strong approximation capabilities. In this paper, we show that current diffusion models actually have an expressive bottleneck in backward denoising and some assumption made by existing theoretical guarantees is too strong. Based on this finding, we prove that diffusion models have unbounded errors in both local and global denoising. In light of our theoretical studies, we introduce soft mixture denoising (SMD), an expressive and efficient model for backward denoising. SMD not only permits diffusion models to well approximate any Gaussian mixture distributions in theory, but also is simple and efficient for implementation. Our experiments on multiple image datasets show that SMD significantly improves different types of diffusion models (e.g., DDPM), espeically in the situation of few backw",
    "link": "http://arxiv.org/abs/2309.14068",
    "context": "Title: Soft Mixture Denoising: Beyond the Expressive Bottleneck of Diffusion Models. (arXiv:2309.14068v2 [cs.LG] UPDATED)\nAbstract: Because diffusion models have shown impressive performances in a number of tasks, such as image synthesis, there is a trend in recent works to prove (with certain assumptions) that these models have strong approximation capabilities. In this paper, we show that current diffusion models actually have an expressive bottleneck in backward denoising and some assumption made by existing theoretical guarantees is too strong. Based on this finding, we prove that diffusion models have unbounded errors in both local and global denoising. In light of our theoretical studies, we introduce soft mixture denoising (SMD), an expressive and efficient model for backward denoising. SMD not only permits diffusion models to well approximate any Gaussian mixture distributions in theory, but also is simple and efficient for implementation. Our experiments on multiple image datasets show that SMD significantly improves different types of diffusion models (e.g., DDPM), espeically in the situation of few backw",
    "path": "papers/23/09/2309.14068.json",
    "total_tokens": 963,
    "translated_title": "软混合降噪：超越扩散模型的表达瓶颈",
    "translated_abstract": "由于扩散模型在诸如图像合成等任务中表现出令人印象深刻的性能，在最近的研究中有一种趋势证明（在某些假设下）这些模型具有强大的近似能力。本文中，我们展示了当前扩散模型在反向降噪方面实际上存在一个表达瓶颈，并且一些现有理论保证所做的假设过于强大。基于这一发现，我们证明了扩散模型在本地和全局降噪中存在无界误差。根据我们的理论研究，我们引入了软混合降噪（SMD），这是一个表达力强且高效的反向降噪模型。SMD不仅在理论上允许扩散模型很好地逼近任意高斯混合分布，而且在实现上简单高效。我们在多个图像数据集上的实验证明，SMD显著改善了不同类型的扩散模型（例如DDPM），尤其在少量反向降噪的情况下。",
    "tldr": "本文发现了扩散模型在反向降噪中存在一个表达瓶颈，并且推出了一种新的软混合降噪（SMD）模型，该模型在理论上能够很好地逼近任意高斯混合分布，并且在实现上简单高效。",
    "en_tdlr": "This paper identifies an expressive bottleneck in backward denoising of diffusion models and introduces a new model called \"soft mixture denoising (SMD)\" that can effectively approximate any Gaussian mixture distributions and is simple and efficient to implement."
}