{
    "title": "An Anchor Learning Approach for Citation Field Learning. (arXiv:2309.03559v1 [cs.CL])",
    "abstract": "Citation field learning is to segment a citation string into fields of interest such as author, title, and venue. Extracting such fields from citations is crucial for citation indexing, researcher profile analysis, etc. User-generated resources like academic homepages and Curriculum Vitae, provide rich citation field information. However, extracting fields from these resources is challenging due to inconsistent citation styles, incomplete sentence syntax, and insufficient training data. To address these challenges, we propose a novel algorithm, CIFAL (citation field learning by anchor learning), to boost the citation field learning performance. CIFAL leverages the anchor learning, which is model-agnostic for any Pre-trained Language Model, to help capture citation patterns from the data of different citation styles. The experiments demonstrate that CIFAL outperforms state-of-the-art methods in citation field learning, achieving a 2.83% improvement in field-level F1-scores. Extensive an",
    "link": "http://arxiv.org/abs/2309.03559",
    "context": "Title: An Anchor Learning Approach for Citation Field Learning. (arXiv:2309.03559v1 [cs.CL])\nAbstract: Citation field learning is to segment a citation string into fields of interest such as author, title, and venue. Extracting such fields from citations is crucial for citation indexing, researcher profile analysis, etc. User-generated resources like academic homepages and Curriculum Vitae, provide rich citation field information. However, extracting fields from these resources is challenging due to inconsistent citation styles, incomplete sentence syntax, and insufficient training data. To address these challenges, we propose a novel algorithm, CIFAL (citation field learning by anchor learning), to boost the citation field learning performance. CIFAL leverages the anchor learning, which is model-agnostic for any Pre-trained Language Model, to help capture citation patterns from the data of different citation styles. The experiments demonstrate that CIFAL outperforms state-of-the-art methods in citation field learning, achieving a 2.83% improvement in field-level F1-scores. Extensive an",
    "path": "papers/23/09/2309.03559.json",
    "total_tokens": 904,
    "translated_title": "一种用于引文字段学习的锚定学习方法",
    "translated_abstract": "引文字段学习是将引文字符串分割为感兴趣的字段，如作者、标题和场所。从引文中提取这些字段对于引文索引、研究者个人资料分析等非常重要。用户生成的资源，如学术主页和个人简历，提供了丰富的引文字段信息。然而，由于引文样式不一致、句法不完整和训练数据不足，从这些资源中提取字段是具有挑战性的。为了解决这些问题，我们提出了一种新颖的算法CIFAL（通过锚定学习进行引文字段学习），以提高引文字段学习性能。CIFAL利用锚定学习，它对于任何预训练语言模型都是模型不可知的，帮助捕捉不同引文样式的引文模式。实验证明，CIFAL在引文字段学习方面优于最先进的方法，在字段级F1分数上取得了2.83%的提升。大量的",
    "tldr": "该论文介绍了一种用于引文字段学习的锚定学习方法，即CIFAL算法，通过利用锚定学习从不同引文样式的数据中捕捉引文模式，提高了引文字段学习性能，取得了2.83%的字段级F1分数提升。"
}