{
    "title": "Deep-learning-powered data analysis in plankton ecology. (arXiv:2309.08500v1 [physics.bio-ph])",
    "abstract": "The implementation of deep learning algorithms has brought new perspectives to plankton ecology. Emerging as an alternative approach to established methods, deep learning offers objective schemes to investigate plankton organisms in diverse environments. We provide an overview of deep-learning-based methods including detection and classification of phytoand zooplankton images, foraging and swimming behaviour analysis, and finally ecological modelling. Deep learning has the potential to speed up the analysis and reduce the human experimental bias, thus enabling data acquisition at relevant temporal and spatial scales with improved reproducibility. We also discuss shortcomings and show how deep learning architectures have evolved to mitigate imprecise readouts. Finally, we suggest opportunities where deep learning is particularly likely to catalyze plankton research. The examples are accompanied by detailed tutorials and code samples that allow readers to apply the methods described in",
    "link": "http://arxiv.org/abs/2309.08500",
    "context": "Title: Deep-learning-powered data analysis in plankton ecology. (arXiv:2309.08500v1 [physics.bio-ph])\nAbstract: The implementation of deep learning algorithms has brought new perspectives to plankton ecology. Emerging as an alternative approach to established methods, deep learning offers objective schemes to investigate plankton organisms in diverse environments. We provide an overview of deep-learning-based methods including detection and classification of phytoand zooplankton images, foraging and swimming behaviour analysis, and finally ecological modelling. Deep learning has the potential to speed up the analysis and reduce the human experimental bias, thus enabling data acquisition at relevant temporal and spatial scales with improved reproducibility. We also discuss shortcomings and show how deep learning architectures have evolved to mitigate imprecise readouts. Finally, we suggest opportunities where deep learning is particularly likely to catalyze plankton research. The examples are accompanied by detailed tutorials and code samples that allow readers to apply the methods described in",
    "path": "papers/23/09/2309.08500.json",
    "total_tokens": 846,
    "translated_title": "深度学习在浮游生态学数据分析中的应用",
    "translated_abstract": "深度学习算法的实施为浮游生态学带来了新的视角。作为替代传统方法的一种新途径，深度学习提供了客观的方案来研究不同环境中的浮游生物。我们提供了基于深度学习的方法概述，包括浮游植物和浮游动物图像的检测和分类、觅食和游动行为分析，以及生态建模。深度学习有望加快分析速度，减少人为实验偏差，从而实现在相关的时间和空间尺度上获取数据，并提高再现性。我们还讨论了深度学习的局限性，并展示了深度学习架构如何演变以减少不准确结果。最后，我们提出了深度学习在浮游生态研究中特别可能推动发展的机会。这些例子附带了详细的教程和代码示例，使读者能够应用所描述的方法。",
    "tldr": "深度学习在浮游生态学数据分析中的应用提供了客观的方案，能加快分析速度、减少实验偏差，并促进浮游生态相关研究的发展。",
    "en_tdlr": "Deep learning in data analysis for plankton ecology provides objective approaches to accelerate analysis, reduce experimental bias, and promote related research development."
}