{
    "title": "Widely Interpretable Semantic Representation: Frameless Meaning Representation for Broader Applicability. (arXiv:2309.06460v1 [cs.CL])",
    "abstract": "This paper presents a novel semantic representation, WISeR, that overcomes challenges for Abstract Meaning Representation (AMR). Despite its strengths, AMR is not easily applied to languages or domains without predefined semantic frames, and its use of numbered arguments results in semantic role labels, which are not directly interpretable and are semantically overloaded for parsers. We examine the numbered arguments of predicates in AMR and convert them to thematic roles that do not require reference to semantic frames. We create a new corpus of 1K English dialogue sentences annotated in both WISeR and AMR. WISeR shows stronger inter-annotator agreement for beginner and experienced annotators, with beginners becoming proficient in WISeR annotation more quickly. Finally, we train a state-of-the-art parser on the AMR 3.0 corpus and a WISeR corpus converted from AMR 3.0. The parser is evaluated on these corpora and our dialogue corpus. The WISeR model exhibits higher accuracy than its AM",
    "link": "http://arxiv.org/abs/2309.06460",
    "context": "Title: Widely Interpretable Semantic Representation: Frameless Meaning Representation for Broader Applicability. (arXiv:2309.06460v1 [cs.CL])\nAbstract: This paper presents a novel semantic representation, WISeR, that overcomes challenges for Abstract Meaning Representation (AMR). Despite its strengths, AMR is not easily applied to languages or domains without predefined semantic frames, and its use of numbered arguments results in semantic role labels, which are not directly interpretable and are semantically overloaded for parsers. We examine the numbered arguments of predicates in AMR and convert them to thematic roles that do not require reference to semantic frames. We create a new corpus of 1K English dialogue sentences annotated in both WISeR and AMR. WISeR shows stronger inter-annotator agreement for beginner and experienced annotators, with beginners becoming proficient in WISeR annotation more quickly. Finally, we train a state-of-the-art parser on the AMR 3.0 corpus and a WISeR corpus converted from AMR 3.0. The parser is evaluated on these corpora and our dialogue corpus. The WISeR model exhibits higher accuracy than its AM",
    "path": "papers/23/09/2309.06460.json",
    "total_tokens": 1046,
    "translated_title": "广泛可解释的语义表示：面向更广泛应用的无框架意义表示",
    "translated_abstract": "本文提出了一种新颖的语义表示方式，WISeR，它克服了抽象意义表示（AMR）所面临的挑战。虽然AMR具有很多优势，但它在没有预定义语义框架的语言或领域中不容易应用，并且其使用编号参数会导致语义角色标签，这些标签不直接可解释，并且对解析器来说具有语义过载。我们研究了AMR中谓词的编号参数，并将其转换为不需要引用语义框架的语义角色。我们创建了一个新的语料库，包括1K英语对话句子，标注了WISeR和AMR。WISeR在初学者和有经验的标注者之间具有更强的标注者一致性，初学者更快地掌握了WISeR的标注。最后，我们在AMR 3.0语料库和从AMR 3.0转换而来的WISeR语料库上训练了一种最先进的解析器。我们在这些语料库和对话语料库上评估了WISeR模型的准确性。",
    "tldr": "本文提出了一种名为WISeR的语义表示方法，克服了抽象意义表示（AMR）在应用于没有预定义语义框架的语言或领域时的挑战。通过将AMR中的编号参数转换为不需要引用语义框架的语义角色，WISeR提供了更易于解释和解析的语义表示。该方法在标注者一致性和解析器的准确性方面表现出色。",
    "en_tdlr": "This paper introduces a semantic representation method called WISeR, which overcomes the challenges of applying Abstract Meaning Representation (AMR) to languages or domains without predefined semantic frames. By converting the numbered arguments in AMR to thematic roles that do not require semantic frames, WISeR provides a more interpretable and parseable semantic representation. The method demonstrates strong inter-annotator agreement and higher accuracy in parsing."
}