{
    "title": "Multi-dimensional domain generalization with low-rank structures. (arXiv:2309.09555v1 [stat.ME])",
    "abstract": "In conventional statistical and machine learning methods, it is typically assumed that the test data are identically distributed with the training data. However, this assumption does not always hold, especially in applications where the target population are not well-represented in the training data. This is a notable issue in health-related studies, where specific ethnic populations may be underrepresented, posing a significant challenge for researchers aiming to make statistical inferences about these minority groups. In this work, we present a novel approach to addressing this challenge in linear regression models. We organize the model parameters for all the sub-populations into a tensor. By studying a structured tensor completion problem, we can achieve robust domain generalization, i.e., learning about sub-populations with limited or no available data. Our method novelly leverages the structure of group labels and it can produce more reliable and interpretable generalization resu",
    "link": "http://arxiv.org/abs/2309.09555",
    "context": "Title: Multi-dimensional domain generalization with low-rank structures. (arXiv:2309.09555v1 [stat.ME])\nAbstract: In conventional statistical and machine learning methods, it is typically assumed that the test data are identically distributed with the training data. However, this assumption does not always hold, especially in applications where the target population are not well-represented in the training data. This is a notable issue in health-related studies, where specific ethnic populations may be underrepresented, posing a significant challenge for researchers aiming to make statistical inferences about these minority groups. In this work, we present a novel approach to addressing this challenge in linear regression models. We organize the model parameters for all the sub-populations into a tensor. By studying a structured tensor completion problem, we can achieve robust domain generalization, i.e., learning about sub-populations with limited or no available data. Our method novelly leverages the structure of group labels and it can produce more reliable and interpretable generalization resu",
    "path": "papers/23/09/2309.09555.json",
    "total_tokens": 986,
    "translated_title": "具有低秩结构的多维度领域泛化",
    "translated_abstract": "在传统的统计和机器学习方法中，通常假设测试数据与训练数据是同分布的。然而，在一些应用中，特定的族群可能在训练数据中被较少地表示，这个假设并不总是成立。这在健康相关研究中是一个值得注意的问题，因为少数族群可能在训练数据中被忽视，这给研究人员在对这些少数族群进行统计推断时带来了显著挑战。在这项工作中，我们提出了一种新颖的方法来应对线性回归模型中的这一问题。我们将所有亚群体的模型参数组织成一个张量。通过研究结构化张量补全问题，我们可以实现鲁棒的领域泛化，即学习对具有有限或无可用数据的亚群体的推断。我们的方法新颖地利用了组标签的结构，可以产生更可靠和可解释的泛化结果。",
    "tldr": "这项工作提出了一种新颖的方法来应对在健康相关研究中少数族群在训练数据中被忽视而导致的统计推断问题。通过将模型参数组织成张量，并研究结构化张量补全问题，我们实现了对具有有限或无可用数据的亚群体的鲁棒领域泛化，该方法利用了组标签的结构，可以产生更可靠和可解释的泛化结果。",
    "en_tdlr": "This work presents a novel approach to address the statistical inference challenge in health-related studies, where minority populations may be underrepresented in the training data. By organizing model parameters into a tensor and studying structured tensor completion, the proposed method achieves robust domain generalization for sub-populations with limited or no available data, utilizing the structure of group labels and producing more reliable and interpretable generalization results."
}