{
    "title": "SAGE: Structured Attribute Value Generation for Billion-Scale Product Catalogs. (arXiv:2309.05920v1 [cs.IR])",
    "abstract": "We introduce SAGE; a Generative LLM for inferring attribute values for products across world-wide e-Commerce catalogs. We introduce a novel formulation of the attribute-value prediction problem as a Seq2Seq summarization task, across languages, product types and target attributes. Our novel modeling approach lifts the restriction of predicting attribute values within a pre-specified set of choices, as well as, the requirement that the sought attribute values need to be explicitly mentioned in the text. SAGE can infer attribute values even when such values are mentioned implicitly using periphrastic language, or not-at-all-as is the case for common-sense defaults. Additionally, SAGE is capable of predicting whether an attribute is inapplicable for the product at hand, or non-obtainable from the available information. SAGE is the first method able to tackle all aspects of the attribute-value-prediction task as they arise in practical settings in e-Commerce catalogs. A comprehensive set o",
    "link": "http://arxiv.org/abs/2309.05920",
    "context": "Title: SAGE: Structured Attribute Value Generation for Billion-Scale Product Catalogs. (arXiv:2309.05920v1 [cs.IR])\nAbstract: We introduce SAGE; a Generative LLM for inferring attribute values for products across world-wide e-Commerce catalogs. We introduce a novel formulation of the attribute-value prediction problem as a Seq2Seq summarization task, across languages, product types and target attributes. Our novel modeling approach lifts the restriction of predicting attribute values within a pre-specified set of choices, as well as, the requirement that the sought attribute values need to be explicitly mentioned in the text. SAGE can infer attribute values even when such values are mentioned implicitly using periphrastic language, or not-at-all-as is the case for common-sense defaults. Additionally, SAGE is capable of predicting whether an attribute is inapplicable for the product at hand, or non-obtainable from the available information. SAGE is the first method able to tackle all aspects of the attribute-value-prediction task as they arise in practical settings in e-Commerce catalogs. A comprehensive set o",
    "path": "papers/23/09/2309.05920.json",
    "total_tokens": 877,
    "translated_title": "SAGE: 针对十亿级产品目录的结构化属性值生成",
    "translated_abstract": "我们引入了SAGE，一个用于在全球电子商务目录中推断产品属性值的生成模型。我们将属性值预测问题以一种新颖的方式转化为跨语言、产品类型和目标属性的Seq2Seq摘要任务。我们的新模型方法不再局限于在预先指定的选项集内预测属性值，并且也不要求所寻找的属性值在文本中明确提及。SAGE可以推断隐式使用迂回语言提到的属性值，或者根本不提及的常识默认情况下的属性值。此外，SAGE能够预测一个属性对于当前产品是否不适用，或者是否无法从可用信息中获取。SAGE是第一种能够在实际电子商务目录设置中处理属性值预测任务所有方面的方法。一套综合的...",
    "tldr": "SAGE是一个用于在十亿级产品目录中生成属性值的模型，可以处理跨语言、产品类型和目标属性的问题。它采用了一种新颖的建模方法，可以推断隐式使用迂回语言提到的属性值，并且能够预测属性的不适用性和无法从可用信息中获取属性值。",
    "en_tdlr": "SAGE is a model for generating attribute values in billion-scale product catalogs, capable of handling problems across languages, product types, and target attributes. It adopts a novel modeling approach that can infer implicitly mentioned attribute values and predict the inapplicability of attributes and the unavailability of attribute values from available information."
}