{
    "title": "Fabricator: An Open Source Toolkit for Generating Labeled Training Data with Teacher LLMs",
    "abstract": "Most NLP tasks are modeled as supervised learning and thus require labeled training data to train effective models. However, manually producing such data at sufficient quality and quantity is known to be costly and time-intensive. Current research addresses this bottleneck by exploring a novel paradigm called zero-shot learning via dataset generation. Here, a powerful LLM is prompted with a task description to generate labeled data that can be used to train a downstream NLP model. For instance, an LLM might be prompted to \"generate 500 movie reviews with positive overall sentiment, and another 500 with negative sentiment.\" The generated data could then be used to train a binary sentiment classifier, effectively leveraging an LLM as a teacher to a smaller student model. With this demo, we introduce Fabricator, an open-source Python toolkit for dataset generation. Fabricator implements common dataset generation workflows, supports a wide range of downstream NLP tasks (such as text classi",
    "link": "https://arxiv.org/abs/2309.09582",
    "context": "Title: Fabricator: An Open Source Toolkit for Generating Labeled Training Data with Teacher LLMs\nAbstract: Most NLP tasks are modeled as supervised learning and thus require labeled training data to train effective models. However, manually producing such data at sufficient quality and quantity is known to be costly and time-intensive. Current research addresses this bottleneck by exploring a novel paradigm called zero-shot learning via dataset generation. Here, a powerful LLM is prompted with a task description to generate labeled data that can be used to train a downstream NLP model. For instance, an LLM might be prompted to \"generate 500 movie reviews with positive overall sentiment, and another 500 with negative sentiment.\" The generated data could then be used to train a binary sentiment classifier, effectively leveraging an LLM as a teacher to a smaller student model. With this demo, we introduce Fabricator, an open-source Python toolkit for dataset generation. Fabricator implements common dataset generation workflows, supports a wide range of downstream NLP tasks (such as text classi",
    "path": "papers/23/09/2309.09582.json",
    "total_tokens": 914,
    "translated_title": "Fabricator: 一个用于生成带有Teacher LLMs标注训练数据的开源工具集",
    "translated_abstract": "大多数自然语言处理任务是通过监督学习来建模的，因此需要标注的训练数据来训练有效的模型。然而，手动生成足够质量和数量的标注数据被认为是昂贵和耗时的。当前的研究通过探索一种称为零样本学习的新范式来解决这个瓶颈，该范式通过数据集生成模型。在这种模式下，一个强大的LLM根据给定的任务描述生成标注数据，这些数据可以用于训练下一阶段的自然语言处理模型。例如，可以让LLM生成500个积极情绪的电影评论和另外500个消极情绪的评论。然后，生成的数据可以用于训练一个情感分类器，从而有效地利用LLM作为较小规模的学生模型的教师。通过这个演示，我们介绍了Fabricator，一个用于数据集生成的开源Python工具集。Fabricator实现了常见的数据集生成工作流程，支持广泛的自然语言处理任务（例如文本分类）。",
    "tldr": "Fabricator是一个开源工具集，用于生成带有Teacher LLMs标注训练数据。它通过零样本学习的方式，利用强大的LLM根据任务描述生成标注数据，可以用于训练下一阶段的自然语言处理模型。",
    "en_tdlr": "Fabricator is an open-source toolkit for generating labeled training data with Teacher LLMs. It leverages powerful LLMs to generate labeled data based on task descriptions, allowing for training downstream NLP models effectively through zero-shot learning."
}