{
    "title": "Benefits of mirror weight symmetry for 3D mesh segmentation in biomedical applications. (arXiv:2309.17076v1 [eess.IV])",
    "abstract": "3D mesh segmentation is an important task with many biomedical applications. The human body has bilateral symmetry and some variations in organ positions. It allows us to expect a positive effect of rotation and inversion invariant layers in convolutional neural networks that perform biomedical segmentations. In this study, we show the impact of weight symmetry in neural networks that perform 3D mesh segmentation. We analyze the problem of 3D mesh segmentation for pathological vessel structures (aneurysms) and conventional anatomical structures (endocardium and epicardium of ventricles). Local geometrical features are encoded as sampling from the signed distance function, and the neural network performs prediction for each mesh node. We show that weight symmetry gains from 1 to 3% of additional accuracy and allows decreasing the number of trainable parameters up to 8 times without suffering the performance loss if neural networks have at least three convolutional layers. This also work",
    "link": "http://arxiv.org/abs/2309.17076",
    "context": "Title: Benefits of mirror weight symmetry for 3D mesh segmentation in biomedical applications. (arXiv:2309.17076v1 [eess.IV])\nAbstract: 3D mesh segmentation is an important task with many biomedical applications. The human body has bilateral symmetry and some variations in organ positions. It allows us to expect a positive effect of rotation and inversion invariant layers in convolutional neural networks that perform biomedical segmentations. In this study, we show the impact of weight symmetry in neural networks that perform 3D mesh segmentation. We analyze the problem of 3D mesh segmentation for pathological vessel structures (aneurysms) and conventional anatomical structures (endocardium and epicardium of ventricles). Local geometrical features are encoded as sampling from the signed distance function, and the neural network performs prediction for each mesh node. We show that weight symmetry gains from 1 to 3% of additional accuracy and allows decreasing the number of trainable parameters up to 8 times without suffering the performance loss if neural networks have at least three convolutional layers. This also work",
    "path": "papers/23/09/2309.17076.json",
    "total_tokens": 926,
    "translated_title": "镜像重量对生物医学应用中的3D网格分割的益处",
    "translated_abstract": "3D网格分割是具有许多生物医学应用的重要任务。人体具有对称和一些器官位置的变化。我们可以预期在执行生物医学分割的卷积神经网络中，旋转和反转不变的层会产生积极影响。在本研究中，我们展示了在执行3D网格分割的神经网络中，重量对称性的影响。我们分析了病理血管结构（动脉瘤）和传统解剖结构（心室的内膜和外膜）的3D网格分割问题。局部几何特征被编码为从有符号距离函数中采样，并且神经网络对每个网格节点进行预测。我们发现，重量对称性可以增加1至3％的额外准确度，并且可以减少可训练参数的数量高达8倍，而不会降低性能，前提是神经网络至少具有三个卷积层。",
    "tldr": "本研究展示了在生物医学应用中，3D网格分割任务中，镜像重量对称性在神经网络中的影响。我们发现，重量对称性可以提高1至3％的额外准确度，并且可以减少参数数量高达8倍，而不影响性能。"
}