{
    "title": "Naturalistic Robot Arm Trajectory Generation via Representation Learning. (arXiv:2309.07550v1 [cs.RO])",
    "abstract": "The integration of manipulator robots in household environments suggests a need for more predictable and human-like robot motion. This holds especially true for wheelchair-mounted assistive robots that can support the independence of people with paralysis. One method of generating naturalistic motion trajectories is via the imitation of human demonstrators. This paper explores a self-supervised imitation learning method using an autoregressive spatio-temporal graph neural network for an assistive drinking task. We address learning from diverse human motion trajectory data that were captured via wearable IMU sensors on a human arm as the action-free task demonstrations. Observed arm motion data from several participants is used to generate natural and functional drinking motion trajectories for a UR5e robot arm.",
    "link": "http://arxiv.org/abs/2309.07550",
    "context": "Title: Naturalistic Robot Arm Trajectory Generation via Representation Learning. (arXiv:2309.07550v1 [cs.RO])\nAbstract: The integration of manipulator robots in household environments suggests a need for more predictable and human-like robot motion. This holds especially true for wheelchair-mounted assistive robots that can support the independence of people with paralysis. One method of generating naturalistic motion trajectories is via the imitation of human demonstrators. This paper explores a self-supervised imitation learning method using an autoregressive spatio-temporal graph neural network for an assistive drinking task. We address learning from diverse human motion trajectory data that were captured via wearable IMU sensors on a human arm as the action-free task demonstrations. Observed arm motion data from several participants is used to generate natural and functional drinking motion trajectories for a UR5e robot arm.",
    "path": "papers/23/09/2309.07550.json",
    "total_tokens": 822,
    "translated_title": "通过表示学习实现自然的机器人臂运动轨迹生成",
    "translated_abstract": "在家庭环境中集成机械臂机器人需要更可预测和更类似人类的机器人运动，尤其对于能够支持瘫痪人群独立性的轮椅坐式辅助机器人而言更为重要。通过模仿人类示范者来生成自然的运动轨迹是一种方法。本文探讨了一种自监督模仿学习方法，使用自回归时空图神经网络来执行辅助饮水任务。我们通过可穿戴IMU传感器捕捉到的人臂运动数据作为无动作任务演示来学习多样的人体运动轨迹数据。利用多个参与者的观测到的臂部运动数据来为UR5e机器人臂生成自然且功能性的饮水运动轨迹。",
    "tldr": "本文通过自监督学习方法使用自回归时空图神经网络，通过模仿人类示范者的运动轨迹来生成自然的机器人臂运动轨迹，为轮椅坐式辅助机器人提供更可预测和更类似人类的运动。",
    "en_tdlr": "This paper explores a self-supervised imitation learning method using an autoregressive spatio-temporal graph neural network to generate naturalistic robot arm motion trajectories by imitating human demonstrators, providing more predictable and human-like motion for wheelchair-mounted assistive robots."
}