{
    "title": "Large-scale Weakly Supervised Learning for Road Extraction from Satellite Imagery. (arXiv:2309.07823v1 [cs.CV])",
    "abstract": "Automatic road extraction from satellite imagery using deep learning is a viable alternative to traditional manual mapping. Therefore it has received considerable attention recently. However, most of the existing methods are supervised and require pixel-level labeling, which is tedious and error-prone. To make matters worse, the earth has a diverse range of terrain, vegetation, and man-made objects. It is well known that models trained in one area generalize poorly to other areas. Various shooting conditions such as light and angel, as well as different image processing techniques further complicate the issue. It is impractical to develop training data to cover all image styles. This paper proposes to leverage OpenStreetMap road data as weak labels and large scale satellite imagery to pre-train semantic segmentation models. Our extensive experimental results show that the prediction accuracy increases with the amount of the weakly labeled data, as well as the road density in the areas ",
    "link": "http://arxiv.org/abs/2309.07823",
    "context": "Title: Large-scale Weakly Supervised Learning for Road Extraction from Satellite Imagery. (arXiv:2309.07823v1 [cs.CV])\nAbstract: Automatic road extraction from satellite imagery using deep learning is a viable alternative to traditional manual mapping. Therefore it has received considerable attention recently. However, most of the existing methods are supervised and require pixel-level labeling, which is tedious and error-prone. To make matters worse, the earth has a diverse range of terrain, vegetation, and man-made objects. It is well known that models trained in one area generalize poorly to other areas. Various shooting conditions such as light and angel, as well as different image processing techniques further complicate the issue. It is impractical to develop training data to cover all image styles. This paper proposes to leverage OpenStreetMap road data as weak labels and large scale satellite imagery to pre-train semantic segmentation models. Our extensive experimental results show that the prediction accuracy increases with the amount of the weakly labeled data, as well as the road density in the areas ",
    "path": "papers/23/09/2309.07823.json",
    "total_tokens": 930,
    "translated_title": "从卫星图像中进行道路提取的大规模弱监督学习",
    "translated_abstract": "使用深度学习从卫星图像中自动提取道路是传统手工绘制的可行替代方案。因此，它最近受到了相当大的关注。然而，大部分现有方法都是有监督的，需要像素级别的标注，这一过程繁琐且容易出错。更糟糕的是，地球上的地形、植被和人造物体有着各种各样的差异。众所周知，从一个地区训练出的模型往往很难泛化到其他地区。不同的拍摄条件，如光照和角度，以及不同的图像处理技术进一步增加了这个问题的复杂性。开发覆盖所有图像风格的训练数据是不现实的。本文提出利用OpenStreetMap道路数据作为弱标签和大规模卫星图像进行预训练语义分割模型。我们广泛的实验结果表明，预测准确度随着弱标注数据量的增加以及地区道路密度的增加而增加。",
    "tldr": "本文提出一种利用OpenStreetMap道路数据作为弱标签和大规模卫星图像预训练语义分割模型的方法，实验证明对于道路提取而言，预测准确度随着弱标注数据量和道路密度的增加而增加。"
}