{
    "title": "Focal Inferential Infusion Coupled with Tractable Density Discrimination for Implicit Hate Speech Detection. (arXiv:2309.11896v1 [cs.CL])",
    "abstract": "Although pre-trained large language models (PLMs) have achieved state-of-the-art on many NLP tasks, they lack understanding of subtle expressions of implicit hate speech. Such nuanced and implicit hate is often misclassified as non-hate. Various attempts have been made to enhance the detection of (implicit) hate content by augmenting external context or enforcing label separation via distance-based metrics. We combine these two approaches and introduce FiADD, a novel Focused Inferential Adaptive Density Discrimination framework. FiADD enhances the PLM finetuning pipeline by bringing the surface form of an implicit hate speech closer to its implied form while increasing the inter-cluster distance among various class labels. We test FiADD on three implicit hate datasets and observe significant improvement in the two-way and three-way hate classification tasks. We further experiment on the generalizability of FiADD on three other tasks, namely detecting sarcasm, irony, and stance, in whic",
    "link": "http://arxiv.org/abs/2309.11896",
    "context": "Title: Focal Inferential Infusion Coupled with Tractable Density Discrimination for Implicit Hate Speech Detection. (arXiv:2309.11896v1 [cs.CL])\nAbstract: Although pre-trained large language models (PLMs) have achieved state-of-the-art on many NLP tasks, they lack understanding of subtle expressions of implicit hate speech. Such nuanced and implicit hate is often misclassified as non-hate. Various attempts have been made to enhance the detection of (implicit) hate content by augmenting external context or enforcing label separation via distance-based metrics. We combine these two approaches and introduce FiADD, a novel Focused Inferential Adaptive Density Discrimination framework. FiADD enhances the PLM finetuning pipeline by bringing the surface form of an implicit hate speech closer to its implied form while increasing the inter-cluster distance among various class labels. We test FiADD on three implicit hate datasets and observe significant improvement in the two-way and three-way hate classification tasks. We further experiment on the generalizability of FiADD on three other tasks, namely detecting sarcasm, irony, and stance, in whic",
    "path": "papers/23/09/2309.11896.json",
    "total_tokens": 967,
    "translated_title": "针对隐性仇恨言论的焦点推理注入与易处理密度区分",
    "translated_abstract": "虽然预训练的大型语言模型（PLMs）在许多NLP任务上取得了最先进的成果，但它们缺乏对隐性仇恨言论微妙表达的理解。这样微妙而隐性的仇恨经常被错误地分类为非仇恨。通过增加外部的上下文或通过基于距离的度量强制标签分离，已经尝试过各种方法来增强（隐性）仇恨内容的检测。我们将这两种方法结合起来并引入了一种新颖的焦点推理适应密度区分框架（FiADD）。FiADD通过将隐性仇恨言论的表面形式与暗示的形式更接近，同时增加不同类别标签之间的集群间距，来增强PLM微调管道。我们在三个隐性仇恨数据集上测试了FiADD，并观察到在两类和三类仇恨分类任务中的显著改进。我们进一步对FiADD在三个其他任务上的泛化性进行了实验，即检测讽刺、讽刺和立场。",
    "tldr": "FiADD是一种新颖的焦点推理注入与易处理密度区分框架，通过将隐性仇恨言论的表面形式与暗示的形式更接近，同时增加不同类别标签之间的集群间距，显著改进了隐性仇恨分类任务的性能。",
    "en_tdlr": "FiADD is a novel framework that combines focused inferential infusion and tractable density discrimination to improve the performance of implicit hate speech classification by bringing the surface form of implicit hate speech closer to its implied form and increasing the inter-cluster distance among different class labels."
}