{
    "title": "Automated Detection of Persistent Inflammatory Biomarkers in Post-COVID-19 Patients Using Machine Learning Techniques. (arXiv:2309.15838v1 [cs.LG])",
    "abstract": "The COVID-19 pandemic has left a lasting impact on individuals, with many experiencing persistent symptoms, including inflammation, in the post-acute phase of the disease. Detecting and monitoring these inflammatory biomarkers is critical for timely intervention and improved patient outcomes. This study employs machine learning techniques to automate the identification of persistent inflammatory biomarkers in 290 post-COVID-19 patients, based on medical data collected from hospitals in Iraq. The data encompassed a wide array of clinical parameters, such as C-reactive protein and interleukin-6 levels, patient demographics, comorbidities, and treatment histories. Rigorous data preprocessing and feature selection processes were implemented to optimize the dataset for machine learning analysis. Various machine learning algorithms, including logistic regression, random forests, support vector machines, and gradient boosting, were deployed to construct predictive models. These models exhibit",
    "link": "http://arxiv.org/abs/2309.15838",
    "context": "Title: Automated Detection of Persistent Inflammatory Biomarkers in Post-COVID-19 Patients Using Machine Learning Techniques. (arXiv:2309.15838v1 [cs.LG])\nAbstract: The COVID-19 pandemic has left a lasting impact on individuals, with many experiencing persistent symptoms, including inflammation, in the post-acute phase of the disease. Detecting and monitoring these inflammatory biomarkers is critical for timely intervention and improved patient outcomes. This study employs machine learning techniques to automate the identification of persistent inflammatory biomarkers in 290 post-COVID-19 patients, based on medical data collected from hospitals in Iraq. The data encompassed a wide array of clinical parameters, such as C-reactive protein and interleukin-6 levels, patient demographics, comorbidities, and treatment histories. Rigorous data preprocessing and feature selection processes were implemented to optimize the dataset for machine learning analysis. Various machine learning algorithms, including logistic regression, random forests, support vector machines, and gradient boosting, were deployed to construct predictive models. These models exhibit",
    "path": "papers/23/09/2309.15838.json",
    "total_tokens": 927,
    "translated_title": "使用机器学习技术自动检测COVID-19后患者中的持续性炎症生物标志物",
    "translated_abstract": "COVID-19大流行对个体产生了持久影响，许多人在疾病后急性期经历持续的症状，包括炎症。检测和监测这些炎症生物标志物对及时干预和改善患者结果至关重要。本研究利用机器学习技术自动识别290名COVID-19后患者中的持久性炎症生物标志物，根据伊拉克医院收集的医疗数据。数据包括各种临床参数，如C-反应蛋白和白细胞介素-6水平、患者人口统计学、合并症和治疗历史。进行了严格的数据预处理和特征选择过程，以优化机器学习分析的数据集。部署了各种机器学习算法，包括逻辑回归、随机森林、支持向量机和梯度提升，来构建预测模型。这些模型表现出了",
    "tldr": "这项研究利用机器学习技术自动检测COVID-19后患者中的持续性炎症生物标志物，在伊拉克医院收集的医疗数据上进行研究，并构建了预测模型。",
    "en_tdlr": "This study utilizes machine learning techniques to automate the detection of persistent inflammatory biomarkers in post-COVID-19 patients, based on medical data collected from hospitals in Iraq, and constructs predictive models."
}