{
    "title": "Solving Recurrence Relations using Machine Learning, with Application to Cost Analysis. (arXiv:2309.07259v1 [cs.PL])",
    "abstract": "Automatic static cost analysis infers information about the resources used by programs without actually running them with concrete data, and presents such information as functions of input data sizes. Most of the analysis tools for logic programs (and other languages) are based on setting up recurrence relations representing (bounds on) the computational cost of predicates, and solving them to find closed-form functions that are equivalent to (or a bound on) them. Such recurrence solving is a bottleneck in current tools: many of the recurrences that arise during the analysis cannot be solved with current solvers, such as Computer Algebra Systems (CASs), so that specific methods for different classes of recurrences need to be developed. We address such a challenge by developing a novel, general approach for solving arbitrary, constrained recurrence relations, that uses machine-learning sparse regression techniques to guess a candidate closed-form function, and a combination of an SMT-so",
    "link": "http://arxiv.org/abs/2309.07259",
    "context": "Title: Solving Recurrence Relations using Machine Learning, with Application to Cost Analysis. (arXiv:2309.07259v1 [cs.PL])\nAbstract: Automatic static cost analysis infers information about the resources used by programs without actually running them with concrete data, and presents such information as functions of input data sizes. Most of the analysis tools for logic programs (and other languages) are based on setting up recurrence relations representing (bounds on) the computational cost of predicates, and solving them to find closed-form functions that are equivalent to (or a bound on) them. Such recurrence solving is a bottleneck in current tools: many of the recurrences that arise during the analysis cannot be solved with current solvers, such as Computer Algebra Systems (CASs), so that specific methods for different classes of recurrences need to be developed. We address such a challenge by developing a novel, general approach for solving arbitrary, constrained recurrence relations, that uses machine-learning sparse regression techniques to guess a candidate closed-form function, and a combination of an SMT-so",
    "path": "papers/23/09/2309.07259.json",
    "total_tokens": 894,
    "translated_title": "使用机器学习解决递归关系，以及在成本分析中的应用",
    "translated_abstract": "自动静态成本分析推断关于程序资源使用情况的信息，而不需要使用具体数据，并将这些信息作为输入数据大小的函数呈现。逻辑程序（和其他语言）的大多数分析工具基于建立表示谓词计算成本（上界）的递归关系，并解决它们以找到等价于（或上界）的闭式函数。当前工具中的递归求解是一个瓶颈：在分析过程中出现的许多递归式无法使用当前求解器（如计算机代数系统）进行求解，因此需要针对不同类别的递归式开发特定方法。我们通过开发一种新颖的通用方法来解决任意约束递归关系的挑战，该方法利用机器学习稀疏回归技术猜测候选的闭式函数，并结合SMT-so来求解。",
    "tldr": "该论文提出了一种使用机器学习解决递归关系的方法，旨在解决当前递归求解工具的瓶颈问题，并应用于成本分析中。方法基于机器学习稀疏回归技术猜测闭式函数，并结合SMT-so来求解任意约束递归关系。",
    "en_tdlr": "This paper proposes a method using machine learning to solve recurrence relations, aiming to address the bottleneck problem in current recurrence solving tools, and applies to cost analysis. The method utilizes machine learning sparse regression techniques to guess closed-form functions and combines with SMT-so to solve arbitrary constrained recurrence relations."
}