{
    "title": "Language-Conditioned Observation Models for Visual Object Search. (arXiv:2309.07276v1 [cs.RO])",
    "abstract": "Object search is a challenging task because when given complex language descriptions (e.g., \"find the white cup on the table\"), the robot must move its camera through the environment and recognize the described object. Previous works map language descriptions to a set of fixed object detectors with predetermined noise models, but these approaches are challenging to scale because new detectors need to be made for each object. In this work, we bridge the gap in realistic object search by posing the search problem as a partially observable Markov decision process (POMDP) where the object detector and visual sensor noise in the observation model is determined by a single Deep Neural Network conditioned on complex language descriptions. We incorporate the neural network's outputs into our language-conditioned observation model (LCOM) to represent dynamically changing sensor noise. With an LCOM, any language description of an object can be used to generate an appropriate object detector and ",
    "link": "http://arxiv.org/abs/2309.07276",
    "context": "Title: Language-Conditioned Observation Models for Visual Object Search. (arXiv:2309.07276v1 [cs.RO])\nAbstract: Object search is a challenging task because when given complex language descriptions (e.g., \"find the white cup on the table\"), the robot must move its camera through the environment and recognize the described object. Previous works map language descriptions to a set of fixed object detectors with predetermined noise models, but these approaches are challenging to scale because new detectors need to be made for each object. In this work, we bridge the gap in realistic object search by posing the search problem as a partially observable Markov decision process (POMDP) where the object detector and visual sensor noise in the observation model is determined by a single Deep Neural Network conditioned on complex language descriptions. We incorporate the neural network's outputs into our language-conditioned observation model (LCOM) to represent dynamically changing sensor noise. With an LCOM, any language description of an object can be used to generate an appropriate object detector and ",
    "path": "papers/23/09/2309.07276.json",
    "total_tokens": 954,
    "translated_title": "语言条件下的视觉目标搜索观测模型",
    "translated_abstract": "目标搜索是一项具有挑战性的任务，因为当给定复杂的语言描述时（例如“在桌子上找到白色的杯子”），机器人必须通过环境移动摄像头并识别描述的对象。先前的研究将语言描述映射到一组固定的物体检测器，并采用预定的噪声模型，但是这些方法很难扩展，因为每个对象都需要制作新的检测器。在这项工作中，我们将现实中的目标搜索作为部分可观察的马尔可夫决策过程（POMDP）来解决。其中，目标检测器和观测模型中的视觉传感器噪声由一个基于复杂语言描述的深度神经网络确定。我们将神经网络的输出纳入到我们的语言条件下的观测模型（LCOM）中，以表示动态变化的传感器噪声。通过LCOM，可以使用任何一个物体的语言描述来生成相应的物体检测器。",
    "tldr": "本研究提出了一种语言条件下的观测模型（LCOM），通过将目标搜索问题视为部分可观察的马尔可夫决策过程（POMDP），利用基于复杂语言描述的深度神经网络来动态生成物体检测器，从而解决了先前方法中需要为每个对象制作新检测器的问题。",
    "en_tdlr": "This paper presents a language-conditioned observation model (LCOM) that tackles the challenge of object search by formulating it as a partially observable Markov decision process (POMDP). By utilizing a deep neural network conditioned on complex language descriptions, LCOM dynamically generates object detectors, eliminating the need for creating new detectors for each object as in previous approaches."
}