{
    "title": "Circles: Inter-Model Comparison of Multi-Classification Problems with High Number of Classes. (arXiv:2309.05672v1 [cs.HC])",
    "abstract": "The recent advancements in machine learning have motivated researchers to generate classification models dealing with hundreds of classes such as in the case of image datasets. However, visualization of classification models with high number of classes and inter-model comparison in such classification problems are two areas that have not received much attention in the literature, despite the ever-increasing use of classification models to address problems with very large class categories. In this paper, we present our interactive visual analytics tool, called Circles, that allows a visual inter-model comparison of numerous classification models with 1K classes in one view. To mitigate the tricky issue of visual clutter, we chose concentric a radial line layout for our inter-model comparison task. Our prototype shows the results of 9 models with 1K classes",
    "link": "http://arxiv.org/abs/2309.05672",
    "context": "Title: Circles: Inter-Model Comparison of Multi-Classification Problems with High Number of Classes. (arXiv:2309.05672v1 [cs.HC])\nAbstract: The recent advancements in machine learning have motivated researchers to generate classification models dealing with hundreds of classes such as in the case of image datasets. However, visualization of classification models with high number of classes and inter-model comparison in such classification problems are two areas that have not received much attention in the literature, despite the ever-increasing use of classification models to address problems with very large class categories. In this paper, we present our interactive visual analytics tool, called Circles, that allows a visual inter-model comparison of numerous classification models with 1K classes in one view. To mitigate the tricky issue of visual clutter, we chose concentric a radial line layout for our inter-model comparison task. Our prototype shows the results of 9 models with 1K classes",
    "path": "papers/23/09/2309.05672.json",
    "total_tokens": 765,
    "translated_title": "圈圈：对具有大量类别的多分类问题的模型间比较",
    "translated_abstract": "机器学习的最新进展，激发了研究人员生成处理包含数百类的分类模型，比如图像数据集。然而，对高数量类别的分类模型的可视化和这些分类问题的模型间比较这两个领域在文献中并没有得到太多关注，尽管分类模型越来越多地被用来解决具有非常大类别的问题。在本文中，我们提出了我们的交互式可视分析工具，称为\"Circles\"，它允许在一个视图中对1K类别的多个分类模型进行视觉模型间比较。为了减少视觉混乱的棘手问题，我们选择了同心径向线布局作为我们的模型间比较任务。我们的原型展示了9个具有1K类别的模型的结果。",
    "tldr": "这篇论文介绍了一种名为\"Circles\"的交互式可视分析工具，允许在一个视图中进行对具有1K类别的多个分类模型进行模型间比较。使用同心径向线布局来解决视觉混乱的问题。"
}