{
    "title": "Incorporating Ensemble and Transfer Learning For An End-To-End Auto-Colorized Image Detection Model. (arXiv:2309.14478v1 [cs.CV])",
    "abstract": "Image colorization is the process of colorizing grayscale images or recoloring an already-color image. This image manipulation can be used for grayscale satellite, medical and historical images making them more expressive. With the help of the increasing computation power of deep learning techniques, the colorization algorithms results are becoming more realistic in such a way that human eyes cannot differentiate between natural and colorized images. However, this poses a potential security concern, as forged or illegally manipulated images can be used illegally. There is a growing need for effective detection methods to distinguish between natural color and computer-colorized images. This paper presents a novel approach that combines the advantages of transfer and ensemble learning approaches to help reduce training time and resource requirements while proposing a model to classify natural color and computer-colorized images. The proposed model uses pre-trained branches VGG16 and Resn",
    "link": "http://arxiv.org/abs/2309.14478",
    "context": "Title: Incorporating Ensemble and Transfer Learning For An End-To-End Auto-Colorized Image Detection Model. (arXiv:2309.14478v1 [cs.CV])\nAbstract: Image colorization is the process of colorizing grayscale images or recoloring an already-color image. This image manipulation can be used for grayscale satellite, medical and historical images making them more expressive. With the help of the increasing computation power of deep learning techniques, the colorization algorithms results are becoming more realistic in such a way that human eyes cannot differentiate between natural and colorized images. However, this poses a potential security concern, as forged or illegally manipulated images can be used illegally. There is a growing need for effective detection methods to distinguish between natural color and computer-colorized images. This paper presents a novel approach that combines the advantages of transfer and ensemble learning approaches to help reduce training time and resource requirements while proposing a model to classify natural color and computer-colorized images. The proposed model uses pre-trained branches VGG16 and Resn",
    "path": "papers/23/09/2309.14478.json",
    "total_tokens": 850,
    "translated_title": "融合集成学习和迁移学习的端到端自动上色图像检测模型",
    "translated_abstract": "图像上色是将灰度图像上色或重新上色已彩色图像的过程。它可以用于使卫星、医学和历史图像更具表现力。随着深度学习技术的不断发展，上色算法的结果变得更加逼真，以至于人眼无法区分自然图像和上色图像。然而，这也带来了潜在的安全问题，因为伪造或非法修改的图像可以被用于非法目的。因此，需要有效的检测方法来区分自然彩色图像和计算机上色图像。本文提出了一种新颖的方法，结合了迁移学习和集成学习的优点，用于减少训练时间和资源需求，并提出了一个模型来对自然彩色和计算机上色图像进行分类。本文提出的模型使用了预训练的分支VGG16和Resn",
    "tldr": "本论文介绍了一种融合了迁移学习和集成学习的端到端自动上色图像检测模型，该模型通过减少训练时间和资源需求来区分自然彩色和计算机上色图像。"
}