{
    "title": "Exploring Robot Morphology Spaces through Breadth-First Search and Random Query. (arXiv:2309.14387v1 [cs.RO])",
    "abstract": "Evolutionary robotics offers a powerful framework for designing and evolving robot morphologies, particularly in the context of modular robots. However, the role of query mechanisms during the genotype-to-phenotype mapping process has been largely overlooked. This research addresses this gap by conducting a comparative analysis of query mechanisms in the brain-body co-evolution of modular robots. Using two different query mechanisms, Breadth-First Search (BFS) and Random Query, within the context of evolving robot morphologies using CPPNs and robot controllers using tensors, and testing them in two evolutionary frameworks, Lamarckian and Darwinian systems, this study investigates their influence on evolutionary outcomes and performance. The findings demonstrate the impact of the two query mechanisms on the evolution and performance of modular robot bodies, including morphological intelligence, diversity, and morphological traits. This study suggests that BFS is both more effective and ",
    "link": "http://arxiv.org/abs/2309.14387",
    "context": "Title: Exploring Robot Morphology Spaces through Breadth-First Search and Random Query. (arXiv:2309.14387v1 [cs.RO])\nAbstract: Evolutionary robotics offers a powerful framework for designing and evolving robot morphologies, particularly in the context of modular robots. However, the role of query mechanisms during the genotype-to-phenotype mapping process has been largely overlooked. This research addresses this gap by conducting a comparative analysis of query mechanisms in the brain-body co-evolution of modular robots. Using two different query mechanisms, Breadth-First Search (BFS) and Random Query, within the context of evolving robot morphologies using CPPNs and robot controllers using tensors, and testing them in two evolutionary frameworks, Lamarckian and Darwinian systems, this study investigates their influence on evolutionary outcomes and performance. The findings demonstrate the impact of the two query mechanisms on the evolution and performance of modular robot bodies, including morphological intelligence, diversity, and morphological traits. This study suggests that BFS is both more effective and ",
    "path": "papers/23/09/2309.14387.json",
    "total_tokens": 875,
    "translated_title": "通过广度优先搜索和随机查询探索机器人形态空间",
    "translated_abstract": "进化机器人学为设计和进化机器人形态提供了一个强大的框架，尤其在模块化机器人的上下文中。然而，在基因型到表型映射过程中，查询机制的作用往往被忽视。本研究通过对模块化机器人的脑体共同进化中查询机制的比较分析，填补了这一空白。通过使用两种不同的查询机制——广度优先搜索（BFS）和随机查询，在使用CPPN进化机器人形态和使用张量进化机器人控制器的上下文中，并在两种进化框架（拉马克和达尔文系统）中进行测试，本研究调查了它们对进化结果和性能的影响。研究结果表明，这两种查询机制对模块化机器人身体的进化和性能，包括形态智能、多样性和形态特征的影响。本研究认为BFS更加有效和...",
    "tldr": "通过比较分析广度优先搜索（BFS）和随机查询在模块化机器人脑体共同进化中的影响，本研究发现这两种查询机制对机器人形态的进化和性能具有重要影响。",
    "en_tdlr": "This study explores the impact of two query mechanisms, Breadth-First Search (BFS) and Random Query, on the evolution and performance of modular robot morphologies through a comparative analysis."
}