{
    "title": "Simulation-Based Optimization of User Interfaces for Quality-Assuring Machine Learning Model Predictions. (arXiv:2104.01129v2 [cs.HC] UPDATED)",
    "abstract": "Quality-sensitive applications of machine learning (ML) require quality assurance (QA) by humans before the predictions of an ML model can be deployed. QA for ML (QA4ML) interfaces require users to view a large amount of data and perform many interactions to correct errors made by the ML model. An optimized user interface (UI) can significantly reduce interaction costs. While UI optimization can be informed by user studies evaluating design options, this approach is not scalable because there are typically numerous small variations that can affect the efficiency of a QA4ML interface. Hence, we propose using simulation to evaluate and aid the optimization of QA4ML interfaces. In particular, we focus on simulating the combined effects of human intelligence in initiating appropriate interaction commands and machine intelligence in providing algorithmic assistance for accelerating QA4ML processes. As QA4ML is usually labor-intensive, we use the simulated task completion time as the metric ",
    "link": "http://arxiv.org/abs/2104.01129",
    "context": "Title: Simulation-Based Optimization of User Interfaces for Quality-Assuring Machine Learning Model Predictions. (arXiv:2104.01129v2 [cs.HC] UPDATED)\nAbstract: Quality-sensitive applications of machine learning (ML) require quality assurance (QA) by humans before the predictions of an ML model can be deployed. QA for ML (QA4ML) interfaces require users to view a large amount of data and perform many interactions to correct errors made by the ML model. An optimized user interface (UI) can significantly reduce interaction costs. While UI optimization can be informed by user studies evaluating design options, this approach is not scalable because there are typically numerous small variations that can affect the efficiency of a QA4ML interface. Hence, we propose using simulation to evaluate and aid the optimization of QA4ML interfaces. In particular, we focus on simulating the combined effects of human intelligence in initiating appropriate interaction commands and machine intelligence in providing algorithmic assistance for accelerating QA4ML processes. As QA4ML is usually labor-intensive, we use the simulated task completion time as the metric ",
    "path": "papers/21/04/2104.01129.json",
    "total_tokens": 889,
    "translated_title": "基于模拟的用户界面优化用于保证机器学习模型预测质量",
    "translated_abstract": "机器学习质量敏感应用需要在模型预测被部署之前由人类进行质量保证。机器学习的质量保证接口需要用户查看大量数据并进行多次交互以纠正模型的错误。优化的用户界面可以显著降低交互成本。虽然可以通过用户研究评估设计选项来优化用户界面，但这种方法不可扩展，因为通常有许多微小的变化会影响QA4ML界面的效率。因此，我们提出使用模拟来评估和辅助优化QA4ML界面。特别地，我们关注在模拟中人类智能发起适当的交互命令和机器智能提供算法辅助加速QA4ML过程的综合效果。由于QA4ML通常需要大量劳动力，我们以模拟的任务完成时间作为度量标准",
    "tldr": "本论文介绍了一种基于模拟的优化方法，用于改进机器学习质量保证界面，通过模拟人类智能和机器智能的组合效应，以任务完成时间作为度量标准，来评估和优化QA4ML界面的效率",
    "en_tdlr": "This paper proposes a simulation-based optimization approach to improve the user interface for quality assurance of machine learning models. By simulating the combined effects of human intelligence and machine intelligence, the efficiency of QA4ML interfaces is evaluated and optimized using task completion time as the metric."
}