{
    "title": "RadarScenes: A Real-World Radar Point Cloud Data Set for Automotive Applications",
    "abstract": "arXiv:2104.02493v2 Announce Type: replace  Abstract: A new automotive radar data set with measurements and point-wise annotations from more than four hours of driving is presented. Data provided by four series radar sensors mounted on one test vehicle were recorded and the individual detections of dynamic objects were manually grouped to clusters and labeled afterwards. The purpose of this data set is to enable the development of novel (machine learning-based) radar perception algorithms with the focus on moving road users. Images of the recorded sequences were captured using a documentary camera. For the evaluation of future object detection and classification algorithms, proposals for score calculation are made so that researchers can evaluate their algorithms on a common basis. Additional information as well as download instructions can be found on the website of the data set: www.radar-scenes.com.",
    "link": "https://arxiv.org/abs/2104.02493",
    "context": "Title: RadarScenes: A Real-World Radar Point Cloud Data Set for Automotive Applications\nAbstract: arXiv:2104.02493v2 Announce Type: replace  Abstract: A new automotive radar data set with measurements and point-wise annotations from more than four hours of driving is presented. Data provided by four series radar sensors mounted on one test vehicle were recorded and the individual detections of dynamic objects were manually grouped to clusters and labeled afterwards. The purpose of this data set is to enable the development of novel (machine learning-based) radar perception algorithms with the focus on moving road users. Images of the recorded sequences were captured using a documentary camera. For the evaluation of future object detection and classification algorithms, proposals for score calculation are made so that researchers can evaluate their algorithms on a common basis. Additional information as well as download instructions can be found on the website of the data set: www.radar-scenes.com.",
    "path": "papers/21/04/2104.02493.json",
    "total_tokens": 741,
    "translated_title": "RadarScenes: 用于汽车应用的实际雷达点云数据集",
    "translated_abstract": "提出了一个新的汽车雷达数据集，包括超过四个小时驾驶的测量数据和点级标注。来自一辆测试车上安装的四个系列雷达传感器提供的数据被记录下来，动态目标的每个检测都被手动分组到簇中，并随后进行标记。该数据集的目的是为了促进基于机器学习的新型雷达感知算法的开发，重点放在移动道路用户上。记录序列的图像是使用记录摄像机捕获的。为了评估未来的目标检测和分类算法，提出了得分计算的建议，以便研究人员可以在一个共同的基础上评估他们的算法。额外信息以及下载说明可以在数据集的网站上找到：www.radar-scenes.com。",
    "tldr": "提出了一个新的汽车雷达数据集，用于开发基于机器学习的雷达感知算法，重点关注移动道路用户。",
    "en_tdlr": "Introducing a new automotive radar dataset for developing machine learning-based radar perception algorithms with a focus on moving road users."
}