{
    "title": "Identification and Estimation in Many-to-one Two-sided Matching without Transfers. (arXiv:2104.02009v3 [econ.EM] UPDATED)",
    "abstract": "In a setting of many-to-one two-sided matching with non-transferable utilities, e.g., college admissions, we study conditions under which preferences of both sides are identified with data on one single market. Regardless of whether the market is centralized or decentralized, assuming that the observed matching is stable, we show nonparametric identification of preferences of both sides under certain exclusion restrictions. To take our results to the data, we use Monte Carlo simulations to evaluate different estimators, including the ones that are directly constructed from the identification. We find that a parametric Bayesian approach with a Gibbs sampler works well in realistically sized problems. Finally, we illustrate our methodology in decentralized admissions to public and private schools in Chile and conduct a counterfactual analysis of an affirmative action policy.",
    "link": "http://arxiv.org/abs/2104.02009",
    "context": "Title: Identification and Estimation in Many-to-one Two-sided Matching without Transfers. (arXiv:2104.02009v3 [econ.EM] UPDATED)\nAbstract: In a setting of many-to-one two-sided matching with non-transferable utilities, e.g., college admissions, we study conditions under which preferences of both sides are identified with data on one single market. Regardless of whether the market is centralized or decentralized, assuming that the observed matching is stable, we show nonparametric identification of preferences of both sides under certain exclusion restrictions. To take our results to the data, we use Monte Carlo simulations to evaluate different estimators, including the ones that are directly constructed from the identification. We find that a parametric Bayesian approach with a Gibbs sampler works well in realistically sized problems. Finally, we illustrate our methodology in decentralized admissions to public and private schools in Chile and conduct a counterfactual analysis of an affirmative action policy.",
    "path": "papers/21/04/2104.02009.json",
    "total_tokens": 944,
    "translated_title": "没有转移的多对一双边匹配中的识别和估计",
    "translated_abstract": "在没有可转让效用的多对一双边匹配场景中，例如大学招生，我们研究了在一个单个市场数据下，双方偏好的识别条件。不论市场是集中式还是分散式，我们假设观测到的匹配是稳定的情况下，我们展示了在特定排除限制条件下，对双方偏好的非参数识别。为了将我们的结果应用于数据，我们使用了蒙特卡洛模拟来评估不同的估计量，包括直接从识别中构建的估计量。我们发现在实际规模的问题中，带有Gibbs采样器的参数贝叶斯方法效果良好。最后，我们在智利的公立和私立学校中阐述了我们的方法，并对平权政策进行了反事实分析。",
    "tldr": "本文研究了没有转移的多对一双边匹配中的识别和估计，通过单个市场的数据，我们展示了在观测到的稳定匹配条件下，双方偏好的非参数识别。在应用于实际数据时，通过Monte Carlo模拟，我们发现带有Gibbs采样器的参数贝叶斯方法在实际规模问题中表现良好。最后，我们在智利的公立和私立学校中应用了我们的方法，并对平权政策进行了反事实分析。",
    "en_tdlr": "This paper investigates identification and estimation in many-to-one two-sided matching without transfers, showing nonparametric identification of preferences of both sides under observed stable matching conditions. A parametric Bayesian approach with Gibbs sampler is found effective in realistic-sized problems. The methodology is illustrated in decentralized admissions to public and private schools in Chile, with a counterfactual analysis of an affirmative action policy."
}