{
    "title": "A Class of Dimension-free Metrics for the Convergence of Empirical Measures. (arXiv:2104.12036v4 [math.PR] UPDATED)",
    "abstract": "This paper concerns the convergence of empirical measures in high dimensions. We propose a new class of probability metrics and show that under such metrics, the convergence is free of the curse of dimensionality (CoD). Such a feature is critical for high-dimensional analysis and stands in contrast to classical metrics ({\\it e.g.}, the Wasserstein metric). The proposed metrics fall into the category of integral probability metrics, for which we specify criteria of test function spaces to guarantee the property of being free of CoD. Examples of the selected test function spaces include the reproducing kernel Hilbert spaces, Barron space, and flow-induced function spaces. Three applications of the proposed metrics are presented: 1. The convergence of empirical measure in the case of random variables; 2. The convergence of $n$-particle system to the solution to McKean-Vlasov stochastic differential equation; 3. The construction of an $\\varepsilon$-Nash equilibrium for a homogeneous $n$-pl",
    "link": "http://arxiv.org/abs/2104.12036",
    "context": "Title: A Class of Dimension-free Metrics for the Convergence of Empirical Measures. (arXiv:2104.12036v4 [math.PR] UPDATED)\nAbstract: This paper concerns the convergence of empirical measures in high dimensions. We propose a new class of probability metrics and show that under such metrics, the convergence is free of the curse of dimensionality (CoD). Such a feature is critical for high-dimensional analysis and stands in contrast to classical metrics ({\\it e.g.}, the Wasserstein metric). The proposed metrics fall into the category of integral probability metrics, for which we specify criteria of test function spaces to guarantee the property of being free of CoD. Examples of the selected test function spaces include the reproducing kernel Hilbert spaces, Barron space, and flow-induced function spaces. Three applications of the proposed metrics are presented: 1. The convergence of empirical measure in the case of random variables; 2. The convergence of $n$-particle system to the solution to McKean-Vlasov stochastic differential equation; 3. The construction of an $\\varepsilon$-Nash equilibrium for a homogeneous $n$-pl",
    "path": "papers/21/04/2104.12036.json",
    "total_tokens": 856,
    "translated_title": "一类无维度度量用于经验测度的收敛性",
    "translated_abstract": "本文研究高维情况下经验测度的收敛性。我们提出了一种新的概率度量类，证明在这种度量下，收敛性不受维度灾难的影响。这种特性对于高维分析至关重要，与经典度量（如Wasserstein度量）形成对比。所提出的度量属于积分概率度量的范畴，我们指定了测试函数空间的准则，以确保不受维度灾难影响。所选测试函数空间的例子包括再生核希尔伯特空间、Barron空间和流诱导函数空间。我们提供了所提出度量的三个应用：1. 在随机变量情况下的经验测度收敛性；2. n粒子系统收敛于McKean-Vlasov随机微分方程的解；3. 构造齐次n-player的ε-Nash均衡。",
    "tldr": "本文提出了一类无维度度量，用于高维情况下经验测度的收敛性，解决了维度灾难问题，具有重要的实际应用。",
    "en_tdlr": "This paper proposes a class of dimension-free metrics for the convergence of empirical measures in high dimensions, addressing the curse of dimensionality problem and presenting practical applications."
}