{
    "title": "OneLog: Towards End-to-End Training in Software Log Anomaly Detection",
    "abstract": "arXiv:2104.07324v2 Announce Type: replace-cross  Abstract: With the growth of online services, IoT devices, and DevOps-oriented software development, software log anomaly detection is becoming increasingly important. Prior works mainly follow a traditional four-staged architecture (Preprocessor, Parser, Vectorizer, and Classifier). This paper proposes OneLog, which utilizes a single Deep Neural Network (DNN) instead of multiple separate components. OneLog harnesses Convolutional Neural Networks (CNN) at the character level to take digits, numbers, and punctuations, which were removed in prior works, into account alongside the main natural language text. We evaluate our approach in six message- and sequence-based data sets: HDFS, Hadoop, BGL, Thunderbird, Spirit, and Liberty. We experiment with Onelog with single-, multi-, and cross-project setups. Onelog offers state-of-the-art performance in our datasets. Onelog can utilize multi-project datasets simultaneously during training, which ",
    "link": "https://arxiv.org/abs/2104.07324",
    "context": "Title: OneLog: Towards End-to-End Training in Software Log Anomaly Detection\nAbstract: arXiv:2104.07324v2 Announce Type: replace-cross  Abstract: With the growth of online services, IoT devices, and DevOps-oriented software development, software log anomaly detection is becoming increasingly important. Prior works mainly follow a traditional four-staged architecture (Preprocessor, Parser, Vectorizer, and Classifier). This paper proposes OneLog, which utilizes a single Deep Neural Network (DNN) instead of multiple separate components. OneLog harnesses Convolutional Neural Networks (CNN) at the character level to take digits, numbers, and punctuations, which were removed in prior works, into account alongside the main natural language text. We evaluate our approach in six message- and sequence-based data sets: HDFS, Hadoop, BGL, Thunderbird, Spirit, and Liberty. We experiment with Onelog with single-, multi-, and cross-project setups. Onelog offers state-of-the-art performance in our datasets. Onelog can utilize multi-project datasets simultaneously during training, which ",
    "path": "papers/21/04/2104.07324.json",
    "total_tokens": 825,
    "translated_title": "OneLog: 面向软件日志异常检测的端到端训练",
    "translated_abstract": "随着在线服务、物联网设备和面向DevOps的软件开发的增长，软件日志异常检测变得越来越重要。该论文提出了OneLog，它利用单个深度神经网络（DNN）代替多个独立组件。OneLog在字符级别利用卷积神经网络（CNN）考虑数字、数字和标点符号，并结合主要的自然语言文本，而这些在先前的工作中被移除。我们在六个基于消息和序列的数据集（HDFS、Hadoop、BGL、Thunderbird、Spirit和Liberty）中评估我们的方法。我们在单项目、多项目和跨项目设置下尝试了Onelog。Onelog在我们的数据集中提供了最先进的性能。Onelog可以在训练过程中同时利用多个项目数据集。",
    "tldr": "OneLog提出了一种利用单个深度神经网络进行端到端训练的方法，通过利用字符级别的卷积神经网络进行软件日志异常检测，在多个数据集上取得了最先进的性能。",
    "en_tdlr": "OneLog proposes a method of end-to-end training using a single deep neural network for software log anomaly detection, achieving state-of-the-art performance across multiple datasets by utilizing convolutional neural networks at the character level."
}