{
    "title": "Sparse NMF with Archetypal Regularization: Computational and Robustness Properties",
    "abstract": "We consider the problem of sparse nonnegative matrix factorization (NMF) using archetypal regularization. The goal is to represent a collection of data points as nonnegative linear combinations of a few nonnegative sparse factors with appealing geometric properties, arising from the use of archetypal regularization. We generalize the notion of robustness studied in Javadi and Montanari (2019) (without sparsity) to the notions of (a) strong robustness that implies each estimated archetype is close to the underlying archetypes and (b) weak robustness that implies there exists at least one recovered archetype that is close to the underlying archetypes. Our theoretical results on robustness guarantees hold under minimal assumptions on the underlying data, and applies to settings where the underlying archetypes need not be sparse. We present theoretical results and illustrative examples to strengthen the insights underlying the notions of robustness. We propose new algorithms for our optimi",
    "link": "https://arxiv.org/abs/2104.03527",
    "context": "Title: Sparse NMF with Archetypal Regularization: Computational and Robustness Properties\nAbstract: We consider the problem of sparse nonnegative matrix factorization (NMF) using archetypal regularization. The goal is to represent a collection of data points as nonnegative linear combinations of a few nonnegative sparse factors with appealing geometric properties, arising from the use of archetypal regularization. We generalize the notion of robustness studied in Javadi and Montanari (2019) (without sparsity) to the notions of (a) strong robustness that implies each estimated archetype is close to the underlying archetypes and (b) weak robustness that implies there exists at least one recovered archetype that is close to the underlying archetypes. Our theoretical results on robustness guarantees hold under minimal assumptions on the underlying data, and applies to settings where the underlying archetypes need not be sparse. We present theoretical results and illustrative examples to strengthen the insights underlying the notions of robustness. We propose new algorithms for our optimi",
    "path": "papers/21/04/2104.03527.json",
    "total_tokens": 864,
    "translated_title": "稀疏NMF与典型正则化：计算和鲁棒性性质",
    "translated_abstract": "我们考虑使用典型正则化的稀疏非负矩阵分解（NMF）问题。目标是将一组数据点表示为少数非负稀疏因子的非负线性组合，这些因子具有吸引人的几何特性，来自于使用典型正则化。我们将在Javadi和Montanari（2019）中研究的鲁棒性概念（无稀疏性）推广为（a）强鲁棒性，即每个估计的典型都接近真实的典型，以及（b）弱鲁棒性，即至少存在一个恢复的典型接近真实的典型。我们的理论结果对于基础数据的假设较为简化，并适用于基于不需要稀疏性的典型的情况。我们提出了新的算法来优化我们的问题。",
    "tldr": "本文研究了使用典型正则化的稀疏非负矩阵分解问题，提出了强鲁棒性和弱鲁棒性的概念，并给出了理论保证和数值实验来加强这些概念的洞察力。",
    "en_tdlr": "This paper investigates sparse nonnegative matrix factorization (NMF) using archetypal regularization, introducing the concepts of strong and weak robustness, and provides theoretical guarantees and numerical experiments to enhance the insights of these concepts."
}