{
    "title": "Learning from Censored and Dependent Data: The case of Linear Dynamics. (arXiv:2104.05087v2 [cs.LG] UPDATED)",
    "abstract": "Observations from dynamical systems often exhibit irregularities, such as censoring, where values are recorded only if they fall within a certain range. Censoring is ubiquitous in practice, due to saturating sensors, limit-of-detection effects, and image-frame effects. In light of recent developments on learning linear dynamical systems (LDSs), and on censored statistics with independent data, we revisit the decades-old problem of learning an LDS, from censored observations (Lee and Maddala (1985); Zeger and Brookmeyer (1986)). Here, the learner observes the state $x_t \\in \\mathbb{R}^d$ if and only if $x_t$ belongs to some set $S_t \\subseteq \\mathbb{R}^d$. We develop the first computationally and statistically efficient algorithm for learning the system, assuming only oracle access to the sets $S_t$. Our algorithm, Stochastic Online Newton with Switching Gradients, is a novel second-order method that builds on the Online Newton Step (ONS) of Hazan et al. (2007). Our Switching-Gradient ",
    "link": "http://arxiv.org/abs/2104.05087",
    "context": "Title: Learning from Censored and Dependent Data: The case of Linear Dynamics. (arXiv:2104.05087v2 [cs.LG] UPDATED)\nAbstract: Observations from dynamical systems often exhibit irregularities, such as censoring, where values are recorded only if they fall within a certain range. Censoring is ubiquitous in practice, due to saturating sensors, limit-of-detection effects, and image-frame effects. In light of recent developments on learning linear dynamical systems (LDSs), and on censored statistics with independent data, we revisit the decades-old problem of learning an LDS, from censored observations (Lee and Maddala (1985); Zeger and Brookmeyer (1986)). Here, the learner observes the state $x_t \\in \\mathbb{R}^d$ if and only if $x_t$ belongs to some set $S_t \\subseteq \\mathbb{R}^d$. We develop the first computationally and statistically efficient algorithm for learning the system, assuming only oracle access to the sets $S_t$. Our algorithm, Stochastic Online Newton with Switching Gradients, is a novel second-order method that builds on the Online Newton Step (ONS) of Hazan et al. (2007). Our Switching-Gradient ",
    "path": "papers/21/04/2104.05087.json",
    "total_tokens": 902,
    "translated_title": "学习来自被审查和相关数据：线性动态的情况。",
    "translated_abstract": "来自动态系统的观测结果经常出现不规则性，例如，审查，只有在值落在某个范围内时才记录。审查在实践中很普遍，由于饱和传感器、检测限制和图像帧效应。鉴于最近关于学习线性动态系统（LDS）和独立数据的被审查统计的发展，我们重新讨论了几十年来关于从被审查观测中学习LDS的问题。在这里，学习者只有在状态$x_t \\in \\mathbb{R}^d$属于某个集合$S_t \\subseteq \\mathbb{R}^d$时观察到。我们开发了第一个在只有对$S_t$的访问权限的情况下学习系统的计算和统计有效的算法。我们的算法，带有切换梯度的随机在线牛顿方法，是一个建立在Hazan等人的在线牛顿步（ONS）基础上的新颖的二阶方法。",
    "tldr": "本论文介绍了一种用于学习线性动态系统的算法，这种算法能够处理来自审查和相关数据的观测。算法建立在在线牛顿步的基础上，通过使用切换梯度的方法，能够高效地学习系统。"
}