{
    "title": "Simple Imputation Rules for Prediction with Missing Data: Contrasting Theoretical Guarantees with Empirical Performance",
    "abstract": "Missing data is a common issue in real-world datasets. This paper studies the performance of impute-then-regress pipelines by contrasting theoretical and empirical evidence. We establish the asymptotic consistency of such pipelines for a broad family of imputation methods. While common sense suggests that a `good' imputation method produces datasets that are plausible, we show, on the contrary, that, as far as prediction is concerned, crude can be good. Among others, we find that mode-impute is asymptotically sub-optimal, while mean-impute is asymptotically optimal. We then exhaustively assess the validity of these theoretical conclusions on a large corpus of synthetic, semi-real, and real datasets. While the empirical evidence we collect mostly supports our theoretical findings, it also highlights gaps between theory and practice and opportunities for future research, regarding the relevance of the MAR assumption, the complex interdependency between the imputation and regression tasks",
    "link": "https://rss.arxiv.org/abs/2104.03158",
    "context": "Title: Simple Imputation Rules for Prediction with Missing Data: Contrasting Theoretical Guarantees with Empirical Performance\nAbstract: Missing data is a common issue in real-world datasets. This paper studies the performance of impute-then-regress pipelines by contrasting theoretical and empirical evidence. We establish the asymptotic consistency of such pipelines for a broad family of imputation methods. While common sense suggests that a `good' imputation method produces datasets that are plausible, we show, on the contrary, that, as far as prediction is concerned, crude can be good. Among others, we find that mode-impute is asymptotically sub-optimal, while mean-impute is asymptotically optimal. We then exhaustively assess the validity of these theoretical conclusions on a large corpus of synthetic, semi-real, and real datasets. While the empirical evidence we collect mostly supports our theoretical findings, it also highlights gaps between theory and practice and opportunities for future research, regarding the relevance of the MAR assumption, the complex interdependency between the imputation and regression tasks",
    "path": "papers/21/04/2104.03158.json",
    "total_tokens": 967,
    "translated_title": "预测中缺失数据的简单填补规则：理论保证与实证性能的对比",
    "translated_abstract": "缺失数据是实际数据集中常见的问题。本文通过对比理论和实证证据来研究填补-回归流程的性能。我们建立了适用于广泛填补方法家族的渐进一致性。尽管常识认为“好”的填补方法生成的数据集是合理的，但是我们发现，在预测方面，粗糙数据也可能是好的。我们发现其中一些结论是，众数填补在渐进上是次优的，而均值填补在渐进上是最优的。然后我们在大量的合成、半真实和真实数据集上详尽评估了这些理论结论的有效性。尽管我们收集的实证证据大多支持我们的理论发现，但也强调了理论与实践之间的差距和未来研究的机会，以解决MAR假设的相关性，填补和回归任务之间的复杂相互依赖的问题。",
    "tldr": "本研究对缺失数据问题进行了研究，通过对比理论和实证结果，展示了一些简单填补规则在预测任务中的性能。在广泛填补方法家族中，我们发现均值填补是最优的，而众数填补是次优的。实证结果除了支持理论发现外，还强调了理论和实践之间的差距和未来研究的机会。",
    "en_tdlr": "This study investigates the issue of missing data and compares the theoretical and empirical performance of simple imputation rules for prediction. The results show that mean-impute is the optimal choice among a broad family of imputation methods, while mode-impute is sub-optimal. The empirical evidence supports the theoretical findings and highlights gaps between theory and practice, suggesting opportunities for future research."
}