{
    "title": "Rapid Exploration for Open-World Navigation with Latent Goal Models. (arXiv:2104.05859v5 [cs.RO] UPDATED)",
    "abstract": "We describe a robotic learning system for autonomous exploration and navigation in diverse, open-world environments. At the core of our method is a learned latent variable model of distances and actions, along with a non-parametric topological memory of images. We use an information bottleneck to regularize the learned policy, giving us (i) a compact visual representation of goals, (ii) improved generalization capabilities, and (iii) a mechanism for sampling feasible goals for exploration. Trained on a large offline dataset of prior experience, the model acquires a representation of visual goals that is robust to task-irrelevant distractors. We demonstrate our method on a mobile ground robot in open-world exploration scenarios. Given an image of a goal that is up to 80 meters away, our method leverages its representation to explore and discover the goal in under 20 minutes, even amidst previously-unseen obstacles and weather conditions. Please check out the project website for videos o",
    "link": "http://arxiv.org/abs/2104.05859",
    "context": "Title: Rapid Exploration for Open-World Navigation with Latent Goal Models. (arXiv:2104.05859v5 [cs.RO] UPDATED)\nAbstract: We describe a robotic learning system for autonomous exploration and navigation in diverse, open-world environments. At the core of our method is a learned latent variable model of distances and actions, along with a non-parametric topological memory of images. We use an information bottleneck to regularize the learned policy, giving us (i) a compact visual representation of goals, (ii) improved generalization capabilities, and (iii) a mechanism for sampling feasible goals for exploration. Trained on a large offline dataset of prior experience, the model acquires a representation of visual goals that is robust to task-irrelevant distractors. We demonstrate our method on a mobile ground robot in open-world exploration scenarios. Given an image of a goal that is up to 80 meters away, our method leverages its representation to explore and discover the goal in under 20 minutes, even amidst previously-unseen obstacles and weather conditions. Please check out the project website for videos o",
    "path": "papers/21/04/2104.05859.json",
    "total_tokens": 972,
    "translated_title": "使用潜在目标模型进行快速开放世界导航探索",
    "translated_abstract": "我们描述了一个用于自主探索和导航多样化开放世界环境的机器人学习系统。我们方法的核心是一个学习得到的距离和动作的潜在变量模型，以及一个非参数的图像拓扑记忆。我们使用信息瓶颈来规范学习的策略，使我们能够得到(i)紧凑的目标视觉表示，(ii)改进的泛化能力以及(iii)用于探索的可行目标采样机制。通过在大规模离线经验数据集上进行训练，该模型获得了对于任务无关干扰物具有鲁棒性的视觉目标表示。我们在开放世界探索场景中利用移动地面机器人演示了我们的方法。给定一个距离高达80米的目标图像，我们的方法利用其表示在不到20分钟内探索并发现了目标，即使在以前未见的障碍和天气条件下也能实现。请查看项目网站上的视频。",
    "tldr": "本论文描述了一个机器人学习系统，可用于自主探索和导航不同的开放世界环境。该系统通过学习得到一个潜在变量模型和图像的拓扑记忆，使用信息瓶颈约束策略，能够在不到20分钟内通过视觉目标表示在开放世界中探索并发现目标。",
    "en_tdlr": "This paper describes a robotic learning system for autonomous exploration and navigation in diverse open-world environments. The system utilizes a learned latent variable model and a topological memory of images, and uses an information bottleneck to constrain the learned policy. It is able to explore and discover goals in open-world scenarios within 20 minutes using the visual representation of goals."
}