{
    "title": "Social contagion and asset prices: Reddit's self-organised bull runs. (arXiv:2104.01847v5 [econ.GN] UPDATED)",
    "abstract": "Can unstructured text data from social media help explain the drivers of large asset price fluctuations? This paper investigates how social forces affect asset prices, by using machine learning tools to extract beliefs and positions of `hype' traders active on Reddit's WallStreetBets (WSB) forum. Our stylized model shows that peer effects help explain return predictability and reversals, as well as bubble dynamics. We empirically document that sentiments expressed by WSB users about assets' future performances (bullish or bearish) are in part due to sentiments of their peers and past asset returns. The paper directly estimates the effect of WSB activity on asset prices. We document: that retail trader demand follows WSB discussions through using Trade and Quote (TAQ) data, the predictability of prices from retail trader discourse, the amplified market impact of idiosyncratic investor sentiment from viral content online, and the greater exposure of hype investors to bubbles in the marke",
    "link": "http://arxiv.org/abs/2104.01847",
    "context": "Title: Social contagion and asset prices: Reddit's self-organised bull runs. (arXiv:2104.01847v5 [econ.GN] UPDATED)\nAbstract: Can unstructured text data from social media help explain the drivers of large asset price fluctuations? This paper investigates how social forces affect asset prices, by using machine learning tools to extract beliefs and positions of `hype' traders active on Reddit's WallStreetBets (WSB) forum. Our stylized model shows that peer effects help explain return predictability and reversals, as well as bubble dynamics. We empirically document that sentiments expressed by WSB users about assets' future performances (bullish or bearish) are in part due to sentiments of their peers and past asset returns. The paper directly estimates the effect of WSB activity on asset prices. We document: that retail trader demand follows WSB discussions through using Trade and Quote (TAQ) data, the predictability of prices from retail trader discourse, the amplified market impact of idiosyncratic investor sentiment from viral content online, and the greater exposure of hype investors to bubbles in the marke",
    "path": "papers/21/04/2104.01847.json",
    "total_tokens": 1069,
    "translated_title": "社会传染和资产价格：Reddit的自组织牛市运行",
    "translated_abstract": "社交媒体中的非结构化文本数据能否帮助解释大型资产价格波动的驱动因素？本文通过使用机器学习工具提取Reddit的WallStreetBets（WSB）论坛上活跃的“炒作”交易者的信念和持仓情况，研究社会力量如何影响资产价格。我们的简化模型显示，同伴效应有助于解释回报可预测性和逆转，以及泡沫动力学。我们经验性地记录下，WSB用户对资产未来表现（看涨或看跌）的情绪部分源于其同伴和过去的资产回报的情绪。本文直接估计了WSB活动对资产价格的影响。我们记录下：零售交易者需求通过使用交易和行情（TAQ）数据跟随WSB讨论，零售交易者言论对价格的可预测性，在线病毒内容引发的特异性投资者情绪的市场影响扩大，以及炒作投资者对市场泡沫的更高曝光度。",
    "tldr": "本文通过分析Reddit的WallStreetBets论坛上的交易者的信念和持仓情况，研究了社交力量如何影响资产价格。研究发现，社交媒体上表达的情绪和过去资产回报影响交易者对资产未来表现的看涨或看跌的情绪，零售交易者的需求受到论坛讨论的影响，特异性投资者情绪的市场影响扩大，并且炒作投资者更容易受到市场泡沫的影响。",
    "en_tdlr": "This paper investigates how social forces, specifically sentiments expressed on Reddit's WallStreetBets forum, affect asset prices. The study finds that emotions expressed on social media and past asset returns impact traders' bullish or bearish sentiments about asset performance, retail trader demand is influenced by forum discussions, the market impact of idiosyncratic investor sentiment is amplified, and hype investors are more susceptible to market bubbles."
}