{
    "title": "OpenFWI: Large-Scale Multi-Structural Benchmark Datasets for Seismic Full Waveform Inversion. (arXiv:2111.02926v6 [cs.LG] UPDATED)",
    "abstract": "Full waveform inversion (FWI) is widely used in geophysics to reconstruct high-resolution velocity maps from seismic data. The recent success of data-driven FWI methods results in a rapidly increasing demand for open datasets to serve the geophysics community. We present OpenFWI, a collection of large-scale multi-structural benchmark datasets, to facilitate diversified, rigorous, and reproducible research on FWI. In particular, OpenFWI consists of 12 datasets (2.1TB in total) synthesized from multiple sources. It encompasses diverse domains in geophysics (interface, fault, CO2 reservoir, etc.), covers different geological subsurface structures (flat, curve, etc.), and contains various amounts of data samples (2K - 67K). It also includes a dataset for 3D FWI. Moreover, we use OpenFWI to perform benchmarking over four deep learning methods, covering both supervised and unsupervised learning regimes. Along with the benchmarks, we implement additional experiments, including physics-driven ",
    "link": "http://arxiv.org/abs/2111.02926",
    "context": "Title: OpenFWI: Large-Scale Multi-Structural Benchmark Datasets for Seismic Full Waveform Inversion. (arXiv:2111.02926v6 [cs.LG] UPDATED)\nAbstract: Full waveform inversion (FWI) is widely used in geophysics to reconstruct high-resolution velocity maps from seismic data. The recent success of data-driven FWI methods results in a rapidly increasing demand for open datasets to serve the geophysics community. We present OpenFWI, a collection of large-scale multi-structural benchmark datasets, to facilitate diversified, rigorous, and reproducible research on FWI. In particular, OpenFWI consists of 12 datasets (2.1TB in total) synthesized from multiple sources. It encompasses diverse domains in geophysics (interface, fault, CO2 reservoir, etc.), covers different geological subsurface structures (flat, curve, etc.), and contains various amounts of data samples (2K - 67K). It also includes a dataset for 3D FWI. Moreover, we use OpenFWI to perform benchmarking over four deep learning methods, covering both supervised and unsupervised learning regimes. Along with the benchmarks, we implement additional experiments, including physics-driven ",
    "path": "papers/21/11/2111.02926.json",
    "total_tokens": 970,
    "translated_title": "OpenFWI：用于地震全波形反演的大规模多结构基准数据集",
    "translated_abstract": "全波形反演 （FWI）是地球物理学中广泛用于从地震数据中重建高分辨率速度图的方法。数据驱动的FWI方法的成功导致了对开放数据集在地球物理学界的需求快速增长。我们提出了OpenFWI，一个大规模多结构基准数据集的集合，以促进FWI的多样化、严格和可重现的研究。OpenFWI由12个数据集（总共2.1TB）组成，这些数据集是从多个来源合成的，涵盖地球物理学中不同的领域（界面、断层、CO2储层等），覆盖不同的地质地下结构（平坦的、曲线的等），包含各种数量的数据样本（2K-67K）。它还包括一个用于3D FWI的数据集。此外，我们使用OpenFWI对四种深度学习方法进行基准测试，涵盖有监督和无监督的学习方式。除了基准测试外，我们还进行了物理化驱动的实验。",
    "tldr": "OpenFWI是一个用于地震全波形反演的大规模多结构基准数据集，包含多个领域、不同地质地下结构和各种数据样本数量。使用OpenFWI进行了四种深度学习方法的基准测试和物理驱动的实验。",
    "en_tdlr": "OpenFWI is a large-scale multi-structural benchmark dataset for seismic full waveform inversion, containing multiple domains, different geological subsurface structures, and various amounts of data samples. Four deep learning methods were benchmarked using OpenFWI, along with additional experiments on physics-driven methods."
}