{
    "title": "Minimum Wages in Concentrated Labor Markets. (arXiv:2111.13692v6 [econ.GN] UPDATED)",
    "abstract": "Economists increasingly refer to monopsony power to reconcile the absence of negative employment effects of minimum wages with theory. However, systematic evidence for the monopsony argument is scarce. In this paper, I perform a comprehensive test of monopsony theory by using labor market concentration as a proxy for monopsony power. Labor market concentration turns out substantial in Germany. Absent wage floors, a 10 percent increase in labor market concentration makes firms reduce wages by 0.5 percent and employment by 1.6 percent, reflecting monopsonistic exploitation. In line with perfect competition, sectoral minimum wages lead to negative employment effects in slightly concentrated labor markets. This effect weakens with increasing concentration and, ultimately, becomes positive in highly concentrated or monopsonistic markets. Overall, the results lend empirical support to the monopsony argument, implying that conventional minimum wage effects on employment conceal heterogeneity ",
    "link": "http://arxiv.org/abs/2111.13692",
    "context": "Title: Minimum Wages in Concentrated Labor Markets. (arXiv:2111.13692v6 [econ.GN] UPDATED)\nAbstract: Economists increasingly refer to monopsony power to reconcile the absence of negative employment effects of minimum wages with theory. However, systematic evidence for the monopsony argument is scarce. In this paper, I perform a comprehensive test of monopsony theory by using labor market concentration as a proxy for monopsony power. Labor market concentration turns out substantial in Germany. Absent wage floors, a 10 percent increase in labor market concentration makes firms reduce wages by 0.5 percent and employment by 1.6 percent, reflecting monopsonistic exploitation. In line with perfect competition, sectoral minimum wages lead to negative employment effects in slightly concentrated labor markets. This effect weakens with increasing concentration and, ultimately, becomes positive in highly concentrated or monopsonistic markets. Overall, the results lend empirical support to the monopsony argument, implying that conventional minimum wage effects on employment conceal heterogeneity ",
    "path": "papers/21/11/2111.13692.json",
    "total_tokens": 909,
    "translated_title": "高度集中的劳动力市场中的最低工资",
    "translated_abstract": "经济学家越来越多地提到垄断力量，以协调最低工资的负面就业影响与理论。然而，垄断理论的系统证据很少。本文利用劳动力市场集中度作为垄断力量的代理，对垄断理论进行了全面测试。在德国，劳动力市场集中度相当高。在没有最低工资的情况下，劳动力市场集中度增加10％会导致企业将工资降低0.5％，就业减少1.6％，反映了垄断性剥削。符合完全竞争的行业最低工资会导致略微集中的劳动力市场出现负面就业影响。这种影响随着集中度的增加而减弱，并最终在高度集中或垄断性市场中呈正效应。总体而言，结果支持垄断理论，意味着常规的最低工资对就业的影响掩盖了异质性。",
    "tldr": "该研究用劳动力市场集中度对垄断理论进行了全面测试，并发现了垄断性剥削的证据，该证据支持最低工资对就业的影响会掩盖市场异质性。",
    "en_tdlr": "This study comprehensively tests the monopsony argument using labor market concentration as a proxy and finds empirical evidence of monopsonistic exploitation, which suggests that the conventional minimum wage effects on employment conceal market heterogeneity."
}