{
    "title": "An Empirical Evaluation of the Impact of New York's Bail Reform on Crime Using Synthetic Controls. (arXiv:2111.08664v2 [stat.AP] UPDATED)",
    "abstract": "We conduct an empirical evaluation of the impact of New York's bail reform on crime. New York State's Bail Elimination Act went into effect on January 1, 2020, eliminating money bail and pretrial detention for nearly all misdemeanor and nonviolent felony defendants. Our analysis of effects on aggregate crime rates after the reform informs the understanding of bail reform and general deterrence. We conduct a synthetic control analysis for a comparative case study of impact of bail reform. We focus on synthetic control analysis of post-intervention changes in crime for assault, theft, burglary, robbery, and drug crimes, constructing a dataset from publicly reported crime data of 27 large municipalities. Our findings, including placebo checks and other robustness checks, show that for assault, theft, and drug crimes, there is no significant impact of bail reform on crime; for burglary and robbery, we similarly have null findings but the synthetic control is also more variable so these are",
    "link": "http://arxiv.org/abs/2111.08664",
    "context": "Title: An Empirical Evaluation of the Impact of New York's Bail Reform on Crime Using Synthetic Controls. (arXiv:2111.08664v2 [stat.AP] UPDATED)\nAbstract: We conduct an empirical evaluation of the impact of New York's bail reform on crime. New York State's Bail Elimination Act went into effect on January 1, 2020, eliminating money bail and pretrial detention for nearly all misdemeanor and nonviolent felony defendants. Our analysis of effects on aggregate crime rates after the reform informs the understanding of bail reform and general deterrence. We conduct a synthetic control analysis for a comparative case study of impact of bail reform. We focus on synthetic control analysis of post-intervention changes in crime for assault, theft, burglary, robbery, and drug crimes, constructing a dataset from publicly reported crime data of 27 large municipalities. Our findings, including placebo checks and other robustness checks, show that for assault, theft, and drug crimes, there is no significant impact of bail reform on crime; for burglary and robbery, we similarly have null findings but the synthetic control is also more variable so these are",
    "path": "papers/21/11/2111.08664.json",
    "total_tokens": 940,
    "tldr": "对纽约州保释法案实施后对总体犯罪率的实证评估结果显示，该法案对袭击、盗窃和毒品犯罪没有显著影响；对于入室盗窃和抢劫，虽然也没有有效结果，但合成控制更为变化。"
}