{
    "title": "Mixed-Integer Optimization with Constraint Learning. (arXiv:2111.04469v3 [math.OC] UPDATED)",
    "abstract": "We establish a broad methodological foundation for mixed-integer optimization with learned constraints. We propose an end-to-end pipeline for data-driven decision making in which constraints and objectives are directly learned from data using machine learning, and the trained models are embedded in an optimization formulation. We exploit the mixed-integer optimization-representability of many machine learning methods, including linear models, decision trees, ensembles, and multi-layer perceptrons, which allows us to capture various underlying relationships between decisions, contextual variables, and outcomes. We also introduce two approaches for handling the inherent uncertainty of learning from data. First, we characterize a decision trust region using the convex hull of the observations, to ensure credible recommendations and avoid extrapolation. We efficiently incorporate this representation using column generation and propose a more flexible formulation to deal with low-density re",
    "link": "http://arxiv.org/abs/2111.04469",
    "context": "Title: Mixed-Integer Optimization with Constraint Learning. (arXiv:2111.04469v3 [math.OC] UPDATED)\nAbstract: We establish a broad methodological foundation for mixed-integer optimization with learned constraints. We propose an end-to-end pipeline for data-driven decision making in which constraints and objectives are directly learned from data using machine learning, and the trained models are embedded in an optimization formulation. We exploit the mixed-integer optimization-representability of many machine learning methods, including linear models, decision trees, ensembles, and multi-layer perceptrons, which allows us to capture various underlying relationships between decisions, contextual variables, and outcomes. We also introduce two approaches for handling the inherent uncertainty of learning from data. First, we characterize a decision trust region using the convex hull of the observations, to ensure credible recommendations and avoid extrapolation. We efficiently incorporate this representation using column generation and propose a more flexible formulation to deal with low-density re",
    "path": "papers/21/11/2111.04469.json",
    "total_tokens": 905,
    "translated_title": "带约束学习的混合整数优化",
    "translated_abstract": "我们建立了一个广泛的方法论基础，用于带约束学习的混合整数优化。我们提出了一个端到端的数据驱动决策制定流程，其中约束和目标直接从数据中使用机器学习进行学习，并将训练好的模型嵌入到优化公式中。我们利用了许多机器学习方法（包括线性模型、决策树、集成和多层感知器）的混合整数优化可表示性，这使得我们能够捕捉决策、上下文变量和结果之间的各种潜在关系。我们还引入了两种处理从数据中学习的固有不确定性的方法。首先，我们通过观测值的凸包来表征决策的信任区域，以确保可靠的推荐并避免外推。我们使用列生成方法有效地将这种表示加入到优化公式中，并提出了一种更灵活的公式来处理低密度的情况。",
    "tldr": "本论文建立了带约束学习的混合整数优化的方法论基础，提出了一个端到端的数据驱动决策制定流程，并利用混合整数优化可表示性捕捉决策、上下文变量和结果之间的关系。同时，引入了处理学习数据中不确定性的两种方法。"
}