{
    "title": "Transferable Time-Series Forecasting under Causal Conditional Shift. (arXiv:2111.03422v3 [cs.LG] UPDATED)",
    "abstract": "This paper focuses on the problem of semi-supervised domain adaptation for time-series forecasting, which is underexplored in literatures, despite being often encountered in practice. Existing methods on time-series domain adaptation mainly follow the paradigm designed for the static data, which cannot handle domain-specific complex conditional dependencies raised by data offset, time lags, and variant data distributions. In order to address these challenges, we analyze variational conditional dependencies in time-series data and find that the causal structures are usually stable among domains, and further raise the causal conditional shift assumption. Enlightened by this assumption, we consider the causal generation process for time-series data and propose an end-to-end model for the semi-supervised domain adaptation problem on time-series forecasting. Our method can not only discover the Granger-Causal structures among cross-domain data but also address the cross-domain time-series f",
    "link": "http://arxiv.org/abs/2111.03422",
    "context": "Title: Transferable Time-Series Forecasting under Causal Conditional Shift. (arXiv:2111.03422v3 [cs.LG] UPDATED)\nAbstract: This paper focuses on the problem of semi-supervised domain adaptation for time-series forecasting, which is underexplored in literatures, despite being often encountered in practice. Existing methods on time-series domain adaptation mainly follow the paradigm designed for the static data, which cannot handle domain-specific complex conditional dependencies raised by data offset, time lags, and variant data distributions. In order to address these challenges, we analyze variational conditional dependencies in time-series data and find that the causal structures are usually stable among domains, and further raise the causal conditional shift assumption. Enlightened by this assumption, we consider the causal generation process for time-series data and propose an end-to-end model for the semi-supervised domain adaptation problem on time-series forecasting. Our method can not only discover the Granger-Causal structures among cross-domain data but also address the cross-domain time-series f",
    "path": "papers/21/11/2111.03422.json",
    "total_tokens": 865,
    "translated_title": "可迁移的因果条件变化下的时序预测",
    "translated_abstract": "本文关注于半监督领域适应中的时序预测问题，尽管在实践中经常遇到，但在文献中仍然不够探索。现有的时序领域适应方法主要遵循为静态数据设计的范例，无法处理由数据偏移、时间滞后和变化的数据分布引发的领域特定复杂条件依赖关系。为了解决这些挑战，我们分析了时序数据中的变量条件依赖关系，并发现因果结构通常在领域之间保持稳定，进一步提出了因果条件转移的假设。在这一假设的启示下，我们考虑了时序数据的因果生成过程，并提出了一个端到端模型用于半监督领域适应中的时序预测问题。我们的方法不仅可以发现跨领域数据之间的Granger-因果结构，还可以处理跨领域时序数据的预测问题。",
    "tldr": "本文提出了一个用于半监督领域适应的时序预测模型，通过分析因果结构和引入因果条件转移的假设来处理跨领域时序数据的复杂条件依赖关系。",
    "en_tdlr": "This paper proposes an end-to-end model for semi-supervised domain adaptation in time-series forecasting, addressing complex conditional dependencies in cross-domain time-series data by analyzing causal structures and introducing the assumption of causal conditional shift."
}