{
    "title": "Clustering and Structural Robustness in Causal Diagrams. (arXiv:2111.04513v3 [stat.ML] UPDATED)",
    "abstract": "Graphs are commonly used to represent and visualize causal relations. For a small number of variables, this approach provides a succinct and clear view of the scenario at hand. As the number of variables under study increases, the graphical approach may become impractical, and the clarity of the representation is lost. Clustering of variables is a natural way to reduce the size of the causal diagram, but it may erroneously change the essential properties of the causal relations if implemented arbitrarily. We define a specific type of cluster, called transit cluster, that is guaranteed to preserve the identifiability properties of causal effects under certain conditions. We provide a sound and complete algorithm for finding all transit clusters in a given graph and demonstrate how clustering can simplify the identification of causal effects. We also study the inverse problem, where one starts with a clustered graph and looks for extended graphs where the identifiability properties of ca",
    "link": "http://arxiv.org/abs/2111.04513",
    "context": "Title: Clustering and Structural Robustness in Causal Diagrams. (arXiv:2111.04513v3 [stat.ML] UPDATED)\nAbstract: Graphs are commonly used to represent and visualize causal relations. For a small number of variables, this approach provides a succinct and clear view of the scenario at hand. As the number of variables under study increases, the graphical approach may become impractical, and the clarity of the representation is lost. Clustering of variables is a natural way to reduce the size of the causal diagram, but it may erroneously change the essential properties of the causal relations if implemented arbitrarily. We define a specific type of cluster, called transit cluster, that is guaranteed to preserve the identifiability properties of causal effects under certain conditions. We provide a sound and complete algorithm for finding all transit clusters in a given graph and demonstrate how clustering can simplify the identification of causal effects. We also study the inverse problem, where one starts with a clustered graph and looks for extended graphs where the identifiability properties of ca",
    "path": "papers/21/11/2111.04513.json",
    "total_tokens": 820,
    "translated_title": "聚类和因果图中的结构稳健性",
    "translated_abstract": "图表常用于表示和可视化因果关系。对于少量变量，这种方法提供了一个简洁清晰的场景视图。但是随着研究变量数量的增加，图表方法可能变得不可行，并且表示的清晰度丧失。变量聚类是减小因果图大小的一种自然方式，但如果随意实施，可能会错误地改变因果关系的重要属性。我们定义了一种特定类型的聚类，称为过渡聚类，在某些条件下保证保留因果效应的可辨识性属性。我们提供了一个完备的算法来寻找给定图表中的所有过渡聚类，并展示了聚类如何简化因果效应的识别。我们还研究了反向问题，即我们从一个聚类图表开始，寻找满足因果效应可辨识性属性的扩展图表。",
    "tldr": "本研究提出了一种聚类方法，通过定义过渡聚类并应用完备的算法，可以简化因果图中的变量关系，并保留因果效应的可辨识性属性。",
    "en_tdlr": "This study proposes a clustering method that simplifies variable relationships in causal graphs and preserves the identifiability properties of causal effects by defining transit clusters and applying a complete algorithm."
}