{
    "title": "Second-Order Mirror Descent: Convergence in Games Beyond Averaging and Discounting. (arXiv:2111.09982v4 [math.OC] UPDATED)",
    "abstract": "In this paper, we propose a second-order extension of the continuous-time game-theoretic mirror descent (MD) dynamics, referred to as MD2, which provably converges to mere (but not necessarily strict) variationally stable states (VSS) without using common auxiliary techniques such as time-averaging or discounting. We show that MD2 enjoys no-regret as well as an exponential rate of convergence towards strong VSS upon a slight modification. MD2 can also be used to derive many novel continuous-time primal-space dynamics. We then use stochastic approximation techniques to provide a convergence guarantee of discrete-time MD2 with noisy observations towards interior mere VSS. Selected simulations are provided to illustrate our results.",
    "link": "http://arxiv.org/abs/2111.09982",
    "context": "Title: Second-Order Mirror Descent: Convergence in Games Beyond Averaging and Discounting. (arXiv:2111.09982v4 [math.OC] UPDATED)\nAbstract: In this paper, we propose a second-order extension of the continuous-time game-theoretic mirror descent (MD) dynamics, referred to as MD2, which provably converges to mere (but not necessarily strict) variationally stable states (VSS) without using common auxiliary techniques such as time-averaging or discounting. We show that MD2 enjoys no-regret as well as an exponential rate of convergence towards strong VSS upon a slight modification. MD2 can also be used to derive many novel continuous-time primal-space dynamics. We then use stochastic approximation techniques to provide a convergence guarantee of discrete-time MD2 with noisy observations towards interior mere VSS. Selected simulations are provided to illustrate our results.",
    "path": "papers/21/11/2111.09982.json",
    "total_tokens": 915,
    "translated_title": "二阶镜像下降：超越平均和折扣的收敛性",
    "translated_abstract": "本文提出了连续时间博弈理论镜像下降（MD）动态的二阶扩展，称为MD2，其证明了在不使用常见的辅助技术如时间平均或折扣的情况下，可以收敛到仅仅（但不一定是严格的）变分稳定状态（VSS）。我们展示了MD2在稍作修改后可以享受无遗憾和指数收敛速率，朝着强VSS的方向。MD2还可以用于导出许多新颖的连续时间原始空间动力学。然后我们使用随机逼近技术提供了离散时间MD2在观测有噪声的情况下收敛到内部仅仅VSS的收敛保证。为了说明我们的结果，我们提供了选定的模拟实验。",
    "tldr": "本文提出了二阶镜像下降（MD2）动力学，在博弈中收敛到非严格变分稳定状态（VSS），不需使用常见技巧，同时具有无遗憾和指数收敛速率。该方法还可以导出许多新的连续时间原始空间动力学，并且通过随机逼近技术对观测有噪声情况下的离散时间MD2提供了收敛保证。",
    "en_tdlr": "This paper proposes a second-order extension of the mirror descent dynamics (MD), called MD2, which converges to non-strict variationally stable states (VSS) in games without using common techniques like time-averaging or discounting. MD2 has no-regret and exponential convergence rate towards strong VSS. It also derives novel continuous-time primal-space dynamics and provides convergence guarantee for MD2 with noisy observations in discrete-time."
}