{
    "title": "Superhedging duality for multi-action options under model uncertainty with information delay. (arXiv:2111.14502v2 [q-fin.MF] UPDATED)",
    "abstract": "We consider the superhedging price of an exotic option under nondominated model uncertainty in discrete time in which the option buyer chooses some action from an (uncountable) action space at each time step. By introducing an enlarged space we reformulate the superhedging problem for such an exotic option as a problem for a European option, which enables us to prove the pricing-hedging duality. Next, we present a duality result that, when the option buyers action is observed by the seller up to $l$ periods later, the superhedging price equals the model-based price where the option buyer has the power to look into the future for $l$ periods.",
    "link": "http://arxiv.org/abs/2111.14502",
    "context": "Title: Superhedging duality for multi-action options under model uncertainty with information delay. (arXiv:2111.14502v2 [q-fin.MF] UPDATED)\nAbstract: We consider the superhedging price of an exotic option under nondominated model uncertainty in discrete time in which the option buyer chooses some action from an (uncountable) action space at each time step. By introducing an enlarged space we reformulate the superhedging problem for such an exotic option as a problem for a European option, which enables us to prove the pricing-hedging duality. Next, we present a duality result that, when the option buyers action is observed by the seller up to $l$ periods later, the superhedging price equals the model-based price where the option buyer has the power to look into the future for $l$ periods.",
    "path": "papers/21/11/2111.14502.json",
    "total_tokens": 830,
    "translated_title": "在模型不确定性和信息延迟下，多操作期权的超对冲二重性",
    "translated_abstract": "本文考虑在离散时间中，非支配模型不确定性下，异国期权的超对冲价格。在该模型中，期权买方在每个时间步中从一个（不可数的）操作空间中选择某种行动。通过引入一个扩大的空间，我们将这种异国期权的超对冲问题重构为一个欧式期权问题，从而证明了定价-对冲二重性。接下来，我们提出了一个二重性结果，即当期权买方的行动在之后的$l$个周期内被卖方观察到时，超对冲价格等于基于模型的价格，其中期权买方有能力预测未来$l$个周期。",
    "tldr": "本文研究了在模型不确定性和信息延迟下，多操作期权的超对冲问题。通过引入扩大的空间将该问题重构为欧式期权问题，并证明了定价-对冲二重性。同时，给出了当期权买方的行动被卖方观察到时的超对冲价格与期权买方能够预测未来的关系。",
    "en_tdlr": "This paper investigates the superhedging problem of multi-action options under model uncertainty and information delay. By reformulating the problem as a European option and proving the pricing-hedging duality, it addresses the pricing and hedging strategies in the face of non-dominated model uncertainty. Additionally, it establishes a duality result that links the observed actions by the seller with the option buyer's ability to predict the future."
}