{
    "title": "Multi-agent Reinforcement Learning for Cooperative Lane Changing of Connected and Autonomous Vehicles in Mixed Traffic. (arXiv:2111.06318v2 [cs.LG] UPDATED)",
    "abstract": "Autonomous driving has attracted significant research interests in the past two decades as it offers many potential benefits, including releasing drivers from exhausting driving and mitigating traffic congestion, among others. Despite promising progress, lane-changing remains a great challenge for autonomous vehicles (AV), especially in mixed and dynamic traffic scenarios. Recently, reinforcement learning (RL), a powerful data-driven control method, has been widely explored for lane-changing decision makings in AVs with encouraging results demonstrated. However, the majority of those studies are focused on a single-vehicle setting, and lane-changing in the context of multiple AVs coexisting with human-driven vehicles (HDVs) have received scarce attention. In this paper, we formulate the lane-changing decision making of multiple AVs in a mixed-traffic highway environment as a multi-agent reinforcement learning (MARL) problem, where each AV makes lane-changing decisions based on the moti",
    "link": "http://arxiv.org/abs/2111.06318",
    "context": "Title: Multi-agent Reinforcement Learning for Cooperative Lane Changing of Connected and Autonomous Vehicles in Mixed Traffic. (arXiv:2111.06318v2 [cs.LG] UPDATED)\nAbstract: Autonomous driving has attracted significant research interests in the past two decades as it offers many potential benefits, including releasing drivers from exhausting driving and mitigating traffic congestion, among others. Despite promising progress, lane-changing remains a great challenge for autonomous vehicles (AV), especially in mixed and dynamic traffic scenarios. Recently, reinforcement learning (RL), a powerful data-driven control method, has been widely explored for lane-changing decision makings in AVs with encouraging results demonstrated. However, the majority of those studies are focused on a single-vehicle setting, and lane-changing in the context of multiple AVs coexisting with human-driven vehicles (HDVs) have received scarce attention. In this paper, we formulate the lane-changing decision making of multiple AVs in a mixed-traffic highway environment as a multi-agent reinforcement learning (MARL) problem, where each AV makes lane-changing decisions based on the moti",
    "path": "papers/21/11/2111.06318.json",
    "total_tokens": 936,
    "translated_title": "多智能体强化学习用于混合交通中连接和自主车道变更的合作",
    "translated_abstract": "过去20年来，自主驾驶引起了广泛的研究兴趣，因为它提供了许多潜在的好处，包括解放驾驶员的劳累驾驶和缓解交通拥堵等。尽管取得了一些进展，但车道变更仍然是自主车辆（AV）面临的一大挑战，特别是在混合和动态交通场景中。最近，强化学习（RL）作为一种强大的数据驱动控制方法，在AV的车道变更决策中得到了广泛的探索，并取得了令人鼓舞的结果。然而，这些研究中的大多数都集中在单一车辆设置下，在多个AV与人驾驶车辆（HDV）共存的情况下，车道变更的研究却鲜有涉及。在本文中，我们将多个AV在混合交通高速公路环境中的车道变更决策制定建模为多智能体强化学习（MARL）问题，每个AV根据动机制定车道变更决策。",
    "tldr": "本文研究了连接和自主车辆在混合交通中的合作车道变更问题，提出了一种多智能体强化学习（MARL）方法，每个车辆根据动机制定车道变更决策。"
}