{
    "title": "Investigating Conversion from Mild Cognitive Impairment to Alzheimer's Disease using Latent Space Manipulation. (arXiv:2111.08794v2 [cs.LG] UPDATED)",
    "abstract": "Alzheimer's disease is the most common cause of dementia that affects millions of lives worldwide. Investigating the underlying causes and risk factors of Alzheimer's disease is essential to prevent its progression. Mild Cognitive Impairment (MCI) is considered an intermediate stage before Alzheimer's disease. Early prediction of the conversion from the MCI to Alzheimer's is crucial to take necessary precautions for decelerating the progression and developing suitable treatments. In this study, we propose a deep learning framework to discover the variables which are identifiers of the conversion from MCI to Alzheimer's disease. In particular, the latent space of a variational auto-encoder network trained with the MCI and Alzheimer's patients is manipulated to obtain the significant attributes and decipher their behavior that leads to the conversion from MCI to Alzheimer's disease. By utilizing a generative decoder and the dimensions that lead to the Alzheimer's diagnosis, we generate s",
    "link": "http://arxiv.org/abs/2111.08794",
    "context": "Title: Investigating Conversion from Mild Cognitive Impairment to Alzheimer's Disease using Latent Space Manipulation. (arXiv:2111.08794v2 [cs.LG] UPDATED)\nAbstract: Alzheimer's disease is the most common cause of dementia that affects millions of lives worldwide. Investigating the underlying causes and risk factors of Alzheimer's disease is essential to prevent its progression. Mild Cognitive Impairment (MCI) is considered an intermediate stage before Alzheimer's disease. Early prediction of the conversion from the MCI to Alzheimer's is crucial to take necessary precautions for decelerating the progression and developing suitable treatments. In this study, we propose a deep learning framework to discover the variables which are identifiers of the conversion from MCI to Alzheimer's disease. In particular, the latent space of a variational auto-encoder network trained with the MCI and Alzheimer's patients is manipulated to obtain the significant attributes and decipher their behavior that leads to the conversion from MCI to Alzheimer's disease. By utilizing a generative decoder and the dimensions that lead to the Alzheimer's diagnosis, we generate s",
    "path": "papers/21/11/2111.08794.json",
    "total_tokens": 954,
    "translated_title": "使用潜空间调整研究从轻度认知障碍到阿尔茨海默病的转化",
    "translated_abstract": "阿尔茨海默病是全球影响数百万人的最常见的痴呆病原因。研究阿尔茨海默病的潜在原因和风险因素对于预防其发展至关重要。轻度认知障碍（MCI）被认为是阿尔茨海默病之前的一个中间阶段。早期预测从MCI转化为阿尔茨海默病对于采取必要的预防措施以减缓病情进展和开发合适的治疗方法至关重要。在本研究中，我们提出了一个深度学习框架，用于发现作为MCI转化为阿尔茨海默病的标志性变量。特别地，我们通过操纵MCI和阿尔茨海默病患者训练的变分自编码器网络的潜空间，获取这些重要属性并解读它们导致MCI转化为阿尔茨海默病的行为。通过利用一个生成解码器和导致阿尔茨海默病诊断的维度，我们生成...",
    "tldr": "本研究提出了一个深度学习框架，利用潜空间调整来发现轻度认知障碍（MCI）转化为阿尔茨海默病的重要属性并解析其行为。"
}