{
    "title": "Physics-Informed Neural Operator for Learning Partial Differential Equations. (arXiv:2111.03794v3 [cs.LG] UPDATED)",
    "abstract": "In this paper, we propose physics-informed neural operators (PINO) that uses available data and/or physics constraints to learn the solution operator of a family of parametric Partial Differential Equation (PDE). This hybrid approach allows PINO to overcome the limitations of purely data-driven and physics-based methods. For instance, data-driven methods fail to learn when data is of limited quantity and/or quality, and physics-based approaches fail to optimize on challenging PDE constraints. By combining both data and PDE constraints, PINO overcomes all these challenges. Additionally, a unique property that PINO enjoys over other hybrid learning methods is its ability to incorporate data and PDE constraints at different resolutions. This allows us to combine coarse-resolution data, which is inexpensive to obtain from numerical solvers, with higher resolution PDE constraints, and the resulting PINO has no degradation in accuracy even on high-resolution test instances. This discretizati",
    "link": "http://arxiv.org/abs/2111.03794",
    "context": "Title: Physics-Informed Neural Operator for Learning Partial Differential Equations. (arXiv:2111.03794v3 [cs.LG] UPDATED)\nAbstract: In this paper, we propose physics-informed neural operators (PINO) that uses available data and/or physics constraints to learn the solution operator of a family of parametric Partial Differential Equation (PDE). This hybrid approach allows PINO to overcome the limitations of purely data-driven and physics-based methods. For instance, data-driven methods fail to learn when data is of limited quantity and/or quality, and physics-based approaches fail to optimize on challenging PDE constraints. By combining both data and PDE constraints, PINO overcomes all these challenges. Additionally, a unique property that PINO enjoys over other hybrid learning methods is its ability to incorporate data and PDE constraints at different resolutions. This allows us to combine coarse-resolution data, which is inexpensive to obtain from numerical solvers, with higher resolution PDE constraints, and the resulting PINO has no degradation in accuracy even on high-resolution test instances. This discretizati",
    "path": "papers/21/11/2111.03794.json",
    "total_tokens": 891,
    "translated_title": "物理启发式神经算子用于学习偏微分方程",
    "translated_abstract": "本文提出了一种名为“物理启发式神经算子”（PINO）的方法，它使用现有数据和/或物理约束条件来学习一类参数化的偏微分方程的解算子。该混合方法允许PINO克服纯数据驱动和基于物理的方法所面临的局限性。将数据和PDE约束相结合，PINO能够同时适应数据量有限和/或质量较差的情况以及困难PDE约束的优化。此外，与其他混合学习方法相比，PINO具有一个独特的特性，即能够在不同分辨率上合并数据和PDE约束。这允许我们将来自数值求解器的低分辨率数据与高分辨率PDE约束相结合，而所得到的PINO即使在高分辨率的测试实例上也没有精度下降。",
    "tldr": "本文提出了一种名为PINO的方法，它能够通过同时利用数据和物理约束条件来学习偏微分方程的解算子，克服了纯数据驱动和基于物理的方法的局限性，并且可以在不同分辨率上合并数据和约束条件。",
    "en_tdlr": "This paper proposes a method named \"physics-informed neural operator\" (PINO), which learns the solution operator of a class of parametric partial differential equations by utilizing both data and physics constraints. By overcoming the limitations of purely data-driven and physics-based methods, PINO allows for the combination of data and PDE constraints at different resolutions."
}