{
    "title": "Optimal consumption and portfolio selection with Epstein-Zin utility under general constraints. (arXiv:2111.09032v3 [q-fin.MF] UPDATED)",
    "abstract": "The paper investigates the consumption-investment problem for an investor with Epstein-Zin utility in an incomplete market. Closed, not necessarily convex, constraints are imposed on strategies. The optimal consumption and investment strategies are characterized via a quadratic backward stochastic differential equation (BSDE). Due to the stochastic market environment, the solution to this BSDE is unbounded and thereby the BMO argument breaks down. After establishing the martingale optimality criterion, by delicately selecting Lyapunov functions, the verification theorem is ultimately obtained. Besides, several examples and numerical simulations for the optimal strategies are provided and illustrated.",
    "link": "http://arxiv.org/abs/2111.09032",
    "context": "Title: Optimal consumption and portfolio selection with Epstein-Zin utility under general constraints. (arXiv:2111.09032v3 [q-fin.MF] UPDATED)\nAbstract: The paper investigates the consumption-investment problem for an investor with Epstein-Zin utility in an incomplete market. Closed, not necessarily convex, constraints are imposed on strategies. The optimal consumption and investment strategies are characterized via a quadratic backward stochastic differential equation (BSDE). Due to the stochastic market environment, the solution to this BSDE is unbounded and thereby the BMO argument breaks down. After establishing the martingale optimality criterion, by delicately selecting Lyapunov functions, the verification theorem is ultimately obtained. Besides, several examples and numerical simulations for the optimal strategies are provided and illustrated.",
    "path": "papers/21/11/2111.09032.json",
    "total_tokens": 752,
    "translated_title": "带有一般约束条件的Epstein-Zin效用下的最优消费和投资选择。",
    "translated_abstract": "本文研究了在不完整市场中使用Epstein-Zin效用的投资者的消费投资问题。策略上强加了封闭但不一定是凸的约束条件。最优消费和投资策略通过二次反向随机微分方程（BSDE）进行了表征。由于随机市场环境，此BSDE的解无界，因此BMO论点崩溃。通过精心选择Lyapunov函数建立了鞅最优性准则，最终获得了验证定理。此外，还提供了多个示例和优化策略的数字模拟并进行了说明。",
    "tldr": "本文研究了使用Epstein-Zin效用的投资者在不完整市场上的消费投资问题。通过二次反向随机微分方程（BSDE），表征了最优的消费和投资策略；验证定理得到印证。",
    "en_tdlr": "This paper investigates the consumption-investment problem for an investor with Epstein-Zin utility in an incomplete market, and characterizes the optimal consumption and investment strategies via a quadratic BSDE. A martingale optimality criterion is established, and the verification theorem is ultimately obtained through delicately selecting Lyapunov functions. Several examples and numerical simulations are provided for the optimal strategies."
}