{
    "title": "Geometry-aware Bayesian Optimization in Robotics using Riemannian Mat\\'ern Kernels. (arXiv:2111.01460v2 [cs.RO] UPDATED)",
    "abstract": "Bayesian optimization is a data-efficient technique which can be used for control parameter tuning, parametric policy adaptation, and structure design in robotics. Many of these problems require optimization of functions defined on non-Euclidean domains like spheres, rotation groups, or spaces of positive-definite matrices. To do so, one must place a Gaussian process prior, or equivalently define a kernel, on the space of interest. Effective kernels typically reflect the geometry of the spaces they are defined on, but designing them is generally non-trivial. Recent work on the Riemannian Mat\\'ern kernels, based on stochastic partial differential equations and spectral theory of the Laplace-Beltrami operator, offers promising avenues towards constructing such geometry-aware kernels. In this paper, we study techniques for implementing these kernels on manifolds of interest in robotics, demonstrate their performance on a set of artificial benchmark functions, and illustrate geometry-aware",
    "link": "http://arxiv.org/abs/2111.01460",
    "context": "Title: Geometry-aware Bayesian Optimization in Robotics using Riemannian Mat\\'ern Kernels. (arXiv:2111.01460v2 [cs.RO] UPDATED)\nAbstract: Bayesian optimization is a data-efficient technique which can be used for control parameter tuning, parametric policy adaptation, and structure design in robotics. Many of these problems require optimization of functions defined on non-Euclidean domains like spheres, rotation groups, or spaces of positive-definite matrices. To do so, one must place a Gaussian process prior, or equivalently define a kernel, on the space of interest. Effective kernels typically reflect the geometry of the spaces they are defined on, but designing them is generally non-trivial. Recent work on the Riemannian Mat\\'ern kernels, based on stochastic partial differential equations and spectral theory of the Laplace-Beltrami operator, offers promising avenues towards constructing such geometry-aware kernels. In this paper, we study techniques for implementing these kernels on manifolds of interest in robotics, demonstrate their performance on a set of artificial benchmark functions, and illustrate geometry-aware",
    "path": "papers/21/11/2111.01460.json",
    "total_tokens": 887,
    "translated_title": "基于黎曼Matern核的几何感知贝叶斯优化在机器人学中的应用",
    "translated_abstract": "贝叶斯优化是一种数据有效的技术，可用于控制参数调整、参数策略适应和机器人结构设计。其中许多问题需要优化在非欧几里得域上定义的函数，如球、旋转群或正定矩阵空间。为此，必须在所关注的空间中放置高斯过程先验，或等价地定义一个核。有效的核通常反映了它们所定义空间的几何特性，但设计它们通常是非平凡的。基于随机偏微分方程和拉普拉斯 – 贝尔特拉米算子的谱理论的最近研究，提供了构建这种几何感知核的有前途的途径。本文研究了在机器人学中实现这些内核的技术，在一组人工基准功能上展示了它们的性能，并说明了几何感知优化在实际机器人控制问题中的应用。",
    "tldr": "本文探讨了基于Riemannian Mat\\'ern kernels技术在机器人学中的实现，并在一组基准函数上展示了其性能。该技术可以有效地处理非欧几里得域上定义的函数。",
    "en_tdlr": "This paper explores the implementation of Riemannian Mat\\'ern kernels in robotics and demonstrates their performance on a set of benchmark functions. The technique can effectively handle functions defined on non-Euclidean domains."
}