{
    "title": "A transformer-based model for default prediction in mid-cap corporate markets. (arXiv:2111.09902v4 [q-fin.GN] UPDATED)",
    "abstract": "In this paper, we study mid-cap companies, i.e. publicly traded companies with less than US $10 billion in market capitalisation. Using a large dataset of US mid-cap companies observed over 30 years, we look to predict the default probability term structure over the medium term and understand which data sources (i.e. fundamental, market or pricing data) contribute most to the default risk. Whereas existing methods typically require that data from different time periods are first aggregated and turned into cross-sectional features, we frame the problem as a multi-label time-series classification problem. We adapt transformer models, a state-of-the-art deep learning model emanating from the natural language processing domain, to the credit risk modelling setting. We also interpret the predictions of these models using attention heat maps. To optimise the model further, we present a custom loss function for multi-label classification and a novel multi-channel architecture with differentia",
    "link": "http://arxiv.org/abs/2111.09902",
    "context": "Title: A transformer-based model for default prediction in mid-cap corporate markets. (arXiv:2111.09902v4 [q-fin.GN] UPDATED)\nAbstract: In this paper, we study mid-cap companies, i.e. publicly traded companies with less than US $10 billion in market capitalisation. Using a large dataset of US mid-cap companies observed over 30 years, we look to predict the default probability term structure over the medium term and understand which data sources (i.e. fundamental, market or pricing data) contribute most to the default risk. Whereas existing methods typically require that data from different time periods are first aggregated and turned into cross-sectional features, we frame the problem as a multi-label time-series classification problem. We adapt transformer models, a state-of-the-art deep learning model emanating from the natural language processing domain, to the credit risk modelling setting. We also interpret the predictions of these models using attention heat maps. To optimise the model further, we present a custom loss function for multi-label classification and a novel multi-channel architecture with differentia",
    "path": "papers/21/11/2111.09902.json",
    "total_tokens": 759,
    "translated_title": "用基于Transformer的模型预测中等市值公司违约概率",
    "translated_abstract": "本文研究了市值低于100亿美元的上市公司，利用30年的美国中等市值公司数据集，预测其中期内的违约概率，并确定贡献违约风险的数据来源（基本面、市场或定价数据）。我们将该问题作为多标签时间序列分类问题，并使用Transformer模型进行预测和注意力热图的解释。为了进一步优化模型，我们提出了一种用于多标签分类的自定义损失函数和一个新颖的多通道架构。",
    "tldr": "本文利用Transformer模型，将违约预测问题作为多标签时间序列分类问题，并通过注意力热图解释模型预测。同时，提出了一种自定义损失函数和一个新颖的多通道架构，以优化模型。"
}