{
    "title": "A Method for Evaluating Deep Generative Models of Images via Assessing the Reproduction of High-order Spatial Context. (arXiv:2111.12577v2 [cs.CV] UPDATED)",
    "abstract": "Deep generative models (DGMs) have the potential to revolutionize diagnostic imaging. Generative adversarial networks (GANs) are one kind of DGM which are widely employed. The overarching problem with deploying GANs, and other DGMs, in any application that requires domain expertise in order to actually use the generated images is that there generally is not adequate or automatic means of assessing the domain-relevant quality of generated images. In this work, we demonstrate several objective tests of images output by two popular GAN architectures. We designed several stochastic context models (SCMs) of distinct image features that can be recovered after generation by a trained GAN. Several of these features are high-order, algorithmic pixel-arrangement rules which are not readily expressed in covariance matrices. We designed and validated statistical classifiers to detect specific effects of the known arrangement rules. We then tested the rates at which two different GANs correctly rep",
    "link": "http://arxiv.org/abs/2111.12577",
    "context": "Title: A Method for Evaluating Deep Generative Models of Images via Assessing the Reproduction of High-order Spatial Context. (arXiv:2111.12577v2 [cs.CV] UPDATED)\nAbstract: Deep generative models (DGMs) have the potential to revolutionize diagnostic imaging. Generative adversarial networks (GANs) are one kind of DGM which are widely employed. The overarching problem with deploying GANs, and other DGMs, in any application that requires domain expertise in order to actually use the generated images is that there generally is not adequate or automatic means of assessing the domain-relevant quality of generated images. In this work, we demonstrate several objective tests of images output by two popular GAN architectures. We designed several stochastic context models (SCMs) of distinct image features that can be recovered after generation by a trained GAN. Several of these features are high-order, algorithmic pixel-arrangement rules which are not readily expressed in covariance matrices. We designed and validated statistical classifiers to detect specific effects of the known arrangement rules. We then tested the rates at which two different GANs correctly rep",
    "path": "papers/21/11/2111.12577.json",
    "total_tokens": 907,
    "translated_title": "通过评估高阶空间上下文的再现性评估图像深度生成模型的方法",
    "translated_abstract": "深度生成模型（DGM）可以改变诊断成像领域。生成对抗网络（GAN）是一种广泛使用的DGM。然而，将GAN和其他DGM应用于需要领域专业知识才能使用生成图像的任何应用程序时，普遍存在缺乏评估生成图像领域相关质量的充分或自动化手段的问题。本文展示了针对两种流行GAN架构输出的图像的几个客观测试。我们设计了几个随机上下文模型（SCM）来恢复在经过训练的GAN生成后可以恢复的不同的图像特征。其中一些特征是高阶算法像素排列规则，这些规则不易表达为协方差矩阵。我们设计并验证了统计分类器，以便检测已知排列规则的特定效应。然后，我们测试了两种不同GAN正确复现高阶空间上下文的比率。",
    "tldr": "本研究提出了一种评估图像深度生成模型的方法，通过检测经过训练的GAN生成的图像中高阶空间上下文的再现能力，并验证了多个客观测试以评估不同GAN的质量。",
    "en_tdlr": "This study proposes a method to evaluate deep generative models of images by assessing the reproduction of high-order spatial context, and validates several objective tests to assess the quality of different GANs through detecting the reproducibility of high-order spatial context in generated images."
}