{
    "title": "Towards Fairness-Aware Federated Learning. (arXiv:2111.01872v3 [cs.LG] UPDATED)",
    "abstract": "Recent advances in Federated Learning (FL) have brought large-scale collaborative machine learning opportunities for massively distributed clients with performance and data privacy guarantees. However, most current works focus on the interest of the central controller in FL,and overlook the interests of the FL clients. This may result in unfair treatment of clients that discourages them from actively participating in the learning process and damages the sustainability of the FL ecosystem. Therefore, the topic of ensuring fairness in FL is attracting a great deal of research interest. In recent years, diverse Fairness-Aware FL (FAFL) approaches have been proposed in an effort to achieve fairness in FL from different perspectives. However, there is no comprehensive survey that helps readers gain insight into this interdisciplinary field. This paper aims to provide such a survey. By examining the fundamental and simplifying assumptions, as well as the notions of fairness adopted by existi",
    "link": "http://arxiv.org/abs/2111.01872",
    "context": "Title: Towards Fairness-Aware Federated Learning. (arXiv:2111.01872v3 [cs.LG] UPDATED)\nAbstract: Recent advances in Federated Learning (FL) have brought large-scale collaborative machine learning opportunities for massively distributed clients with performance and data privacy guarantees. However, most current works focus on the interest of the central controller in FL,and overlook the interests of the FL clients. This may result in unfair treatment of clients that discourages them from actively participating in the learning process and damages the sustainability of the FL ecosystem. Therefore, the topic of ensuring fairness in FL is attracting a great deal of research interest. In recent years, diverse Fairness-Aware FL (FAFL) approaches have been proposed in an effort to achieve fairness in FL from different perspectives. However, there is no comprehensive survey that helps readers gain insight into this interdisciplinary field. This paper aims to provide such a survey. By examining the fundamental and simplifying assumptions, as well as the notions of fairness adopted by existi",
    "path": "papers/21/11/2111.01872.json",
    "total_tokens": 779,
    "translated_title": "追求公平的联邦学习",
    "translated_abstract": "联邦学习的最近进展为分布式客户端提供了大规模协作机器学习的机会，并保证了性能和数据隐私。然而，大多数现有的作品集中于FL中央控制器的利益，而忽视了FL客户端的利益。这可能会导致不公平对待客户端，使其不积极参与学习过程，并损害FL生态系统的可持续性。因此，确保FL的公平性正在吸引着大量的研究兴趣。近年来，不同角度的公平性感知联邦学习（FAFL）方法已被提出。然而，目前还没有全面的调查来帮助读者深入了解这个跨学科领域。本文旨在提供这样一篇综述。",
    "tldr": "本文旨在概述近年来提出的公平性感知联邦学习（FAFL）方法，以解决在联邦学习中可能出现的不公平问题。",
    "en_tdlr": "This paper provides a survey on Fairness-Aware Federated Learning (FAFL) approaches proposed in recent years to address potential fairness issues in Federated Learning."
}