{
    "title": "Moderately Supervised Learning: Definition, Framework and Generality. (arXiv:2008.11945v4 [cs.CV] UPDATED)",
    "abstract": "Learning with supervision has achieved remarkable success in numerous artificial intelligence (AI) applications. In the current literature, by referring to the properties of the labels prepared for the training dataset, learning with supervision is categorized as supervised learning (SL) and weakly supervised learning (WSL). SL concerns the situation where the training data set is assigned with ideal (complete, exact and accurate) labels, while WSL concerns the situation where the training data set is assigned with non-ideal (incomplete, inexact or inaccurate) labels. However, various solutions for SL tasks have shown that the given labels are not always easy to learn, and the transformation from the given labels to easy-to-learn targets can significantly affect the performance of the final SL solutions. Without considering the properties of the transformation from the given labels to easy-to-learn targets, the definition of SL conceals some details that can be critical to building the",
    "link": "http://arxiv.org/abs/2008.11945",
    "context": "Title: Moderately Supervised Learning: Definition, Framework and Generality. (arXiv:2008.11945v4 [cs.CV] UPDATED)\nAbstract: Learning with supervision has achieved remarkable success in numerous artificial intelligence (AI) applications. In the current literature, by referring to the properties of the labels prepared for the training dataset, learning with supervision is categorized as supervised learning (SL) and weakly supervised learning (WSL). SL concerns the situation where the training data set is assigned with ideal (complete, exact and accurate) labels, while WSL concerns the situation where the training data set is assigned with non-ideal (incomplete, inexact or inaccurate) labels. However, various solutions for SL tasks have shown that the given labels are not always easy to learn, and the transformation from the given labels to easy-to-learn targets can significantly affect the performance of the final SL solutions. Without considering the properties of the transformation from the given labels to easy-to-learn targets, the definition of SL conceals some details that can be critical to building the",
    "path": "papers/20/08/2008.11945.json",
    "total_tokens": 1309,
    "translated_title": "适度监督学习：定义、框架和普适性。",
    "translated_abstract": "适度监督学习包括标准有监督学习和弱监督学习，前者训练数据集标签是理想的（完全、精确和准确），后者训练数据集标签不完美（不完整，不精确或不准确）。经过多次实验，已有的一些标准有监督学习任务的解决方案表明，有时候给定的标签并不容易学习，从给定的标签转换为易于学习的目标的过程会显著影响最终标准有监督学习解决方案的性能。因此，在未考虑从给定标签到易于学习的目标的转化过程属性的情况下，有监督学习的定义隐藏了一些可能对建立解决方案影响重大的细节。",
    "tldr": "适度监督学习包括标准有监督学习和弱监督学习，已有的一些标准有监督学习任务表明，给定的标签并不容易学习，从给定的标签转换为易于学习的目标的过程会显著影响最终的性能，有监督学习的定义隐藏了可能对解决方案影响重大的细节。",
    "en_tdlr": "Moderately supervised learning includes supervised learning with ideal labels and weakly supervised learning with non-ideal labels. Some solutions for supervised learning have shown that the given labels are not always easy to learn and the transformation process from given labels to easy-to-learn targets can significantly affect the final performance of supervised learning solutions. The definition of supervised learning may conceal critical details that can impact the development of solutions."
}