{
    "title": "Deep-Lock: Secure Authorization for Deep Neural Networks",
    "abstract": "arXiv:2008.05966v2 Announce Type: replace  Abstract: Trained Deep Neural Network (DNN) models are considered valuable Intellectual Properties (IP) in several business models. Prevention of IP theft and unauthorized usage of such DNN models has been raised as of significant concern by industry. In this paper, we address the problem of preventing unauthorized usage of DNN models by proposing a generic and lightweight key-based model-locking scheme, which ensures that a locked model functions correctly only upon applying the correct secret key. The proposed scheme, known as Deep-Lock, utilizes S-Boxes with good security properties to encrypt each parameter of a trained DNN model with secret keys generated from a master key via a key scheduling algorithm. The resulting dense network of encrypted weights is found robust against model fine-tuning attacks. Finally, Deep-Lock does not require any intervention in the structure and training of the DNN models, making it applicable for all existin",
    "link": "https://arxiv.org/abs/2008.05966",
    "context": "Title: Deep-Lock: Secure Authorization for Deep Neural Networks\nAbstract: arXiv:2008.05966v2 Announce Type: replace  Abstract: Trained Deep Neural Network (DNN) models are considered valuable Intellectual Properties (IP) in several business models. Prevention of IP theft and unauthorized usage of such DNN models has been raised as of significant concern by industry. In this paper, we address the problem of preventing unauthorized usage of DNN models by proposing a generic and lightweight key-based model-locking scheme, which ensures that a locked model functions correctly only upon applying the correct secret key. The proposed scheme, known as Deep-Lock, utilizes S-Boxes with good security properties to encrypt each parameter of a trained DNN model with secret keys generated from a master key via a key scheduling algorithm. The resulting dense network of encrypted weights is found robust against model fine-tuning attacks. Finally, Deep-Lock does not require any intervention in the structure and training of the DNN models, making it applicable for all existin",
    "path": "papers/20/08/2008.05966.json",
    "total_tokens": 916,
    "translated_title": "Deep-Lock: 深度神经网络的安全授权",
    "translated_abstract": "训练完毕的深度神经网络（DNN）模型被视为多种商业模式中的有价值的知识产权（IP）。防止IP盗窃和未经授权使用这些DNN模型已被业界提出作为一个重大关注点。本文通过提出一种通用且轻量的基于密钥的模型锁定方案—Deep-Lock，解决了防止DNN模型未经授权使用的问题，确保被锁定的模型只有在应用正确的秘密密钥时才能正确运行。Deep-Lock方案利用具有良好安全性质的S-盒对经过训练的DNN模型的每个参数进行加密，使用主密钥通过密钥调度算法生成秘密密钥。由此产生的加密权重的密集网络被发现能够抵抗模型微调攻击。最后，Deep-Lock不需要对DNN模型的结构和训练进行任何干预，使其适用于所有已存在的模型。",
    "tldr": "本文提出了一种名为Deep-Lock的通用和轻量级基于密钥的模型锁定方案，通过使用S-盒对训练完毕的DNN模型的每个参数进行加密，并确保只有在应用正确的秘密密钥时模型才能正确运行，从而防止了DNN模型的未经授权使用。",
    "en_tdlr": "This paper presents a generic and lightweight key-based model-locking scheme called Deep-Lock, which encrypts each parameter of a trained DNN model using S-Boxes and ensures the model functions correctly only upon applying the correct secret key, thus preventing unauthorized usage of DNN models."
}