{
    "title": "Machine Semiotics. (arXiv:2008.10522v2 [cs.CL] UPDATED)",
    "abstract": "Recognizing a basic difference between the semiotics of humans and machines presents a possibility to overcome the shortcomings of current speech assistive devices. For the machine, the meaning of a (human) utterance is defined by its own scope of actions. Machines, thus, do not need to understand the conventional meaning of an utterance. Rather, they draw conversational implicatures in the sense of (neo-)Gricean pragmatics. For speech assistive devices, the learning of machine-specific meanings of human utterances, i.e. the fossilization of conversational implicatures into conventionalized ones by trial and error through lexicalization appears to be sufficient. Using the quite trivial example of a cognitive heating device, we show that - based on dynamic semantics - this process can be formalized as the reinforcement learning of utterance-meaning pairs (UMP).",
    "link": "http://arxiv.org/abs/2008.10522",
    "context": "Title: Machine Semiotics. (arXiv:2008.10522v2 [cs.CL] UPDATED)\nAbstract: Recognizing a basic difference between the semiotics of humans and machines presents a possibility to overcome the shortcomings of current speech assistive devices. For the machine, the meaning of a (human) utterance is defined by its own scope of actions. Machines, thus, do not need to understand the conventional meaning of an utterance. Rather, they draw conversational implicatures in the sense of (neo-)Gricean pragmatics. For speech assistive devices, the learning of machine-specific meanings of human utterances, i.e. the fossilization of conversational implicatures into conventionalized ones by trial and error through lexicalization appears to be sufficient. Using the quite trivial example of a cognitive heating device, we show that - based on dynamic semantics - this process can be formalized as the reinforcement learning of utterance-meaning pairs (UMP).",
    "path": "papers/20/08/2008.10522.json",
    "total_tokens": 829,
    "translated_title": "机器符号学",
    "translated_abstract": "认识到人类和机器符号学的基本差异为克服当前语音辅助设备的缺点提供了可能。对于机器而言，（人类）话语的意义由其自身的行动范围定义。因此，机器不需要理解话语的传统意义。相反，它们以（新）格里斯语用学的意义绘制会话蕴涵说明。对于语音辅助设备而言，学习人类话语的机器特定含义，即通过词汇化的尝试和误差将会话蕴涵说明变成传统化的含义，似乎已经足够了。通过一个相当琐碎的认知加热设备的例子，我们展示了，基于动态语义学，这个过程可以形式化为话语-意义对（UMP）的强化学习。",
    "tldr": "本文提出机器符号学的思想，即机器不需要理解话语的传统意义，而是能够以格里斯语用学的方式绘制会话蕴涵说明。这个过程可以形式化为话语-意义对（UMP）的强化学习。",
    "en_tdlr": "This paper proposes the idea of machine semiotics, which suggests that machines do not need to understand the conventional meaning of human utterances, but can draw conversational implicatures in a Gricean pragmatic way. This process can be formalized as the reinforcement learning of utterance-meaning pairs (UMP)."
}