{
    "title": "Axioms for Defeat in Democratic Elections. (arXiv:2008.08451v4 [econ.TH] UPDATED)",
    "abstract": "We propose six axioms concerning when one candidate should defeat another in a democratic election involving two or more candidates. Five of the axioms are widely satisfied by known voting procedures. The sixth axiom is a weakening of Kenneth Arrow's famous condition of the Independence of Irrelevant Alternatives (IIA). We call this weakening Coherent IIA. We prove that the five axioms plus Coherent IIA single out a method of determining defeats studied in our recent work: Split Cycle. In particular, Split Cycle provides the most resolute definition of defeat among any satisfying the six axioms for democratic defeat. In addition, we analyze how Split Cycle escapes Arrow's Impossibility Theorem and related impossibility results.",
    "link": "http://arxiv.org/abs/2008.08451",
    "context": "Title: Axioms for Defeat in Democratic Elections. (arXiv:2008.08451v4 [econ.TH] UPDATED)\nAbstract: We propose six axioms concerning when one candidate should defeat another in a democratic election involving two or more candidates. Five of the axioms are widely satisfied by known voting procedures. The sixth axiom is a weakening of Kenneth Arrow's famous condition of the Independence of Irrelevant Alternatives (IIA). We call this weakening Coherent IIA. We prove that the five axioms plus Coherent IIA single out a method of determining defeats studied in our recent work: Split Cycle. In particular, Split Cycle provides the most resolute definition of defeat among any satisfying the six axioms for democratic defeat. In addition, we analyze how Split Cycle escapes Arrow's Impossibility Theorem and related impossibility results.",
    "path": "papers/20/08/2008.08451.json",
    "total_tokens": 936,
    "translated_title": "民主选举中的败选公理",
    "translated_abstract": "我们提出了六个关于在涉及两个或更多候选人的民主选举中，一个候选人何时应该击败另一个候选人的公理。其中五个公理是已知投票程序广泛满足的。第六个公理是肯尼斯·艾罗（Kenneth Arrow）著名的无关替代品独立条件（IIA）的一个弱化版本。我们称这个弱化版本为一致的IIA。我们证明了这五个公理加上一致的IIA将单独确定了我们最近研究中研究的决定败选的方法：分裂周期。特别地，分裂周期提供了在满足六个民主败选公理的任何方法中最果断的败选定义。此外，我们分析了分裂周期如何逃脱了艾罗的不可能定理和相关的不可能性结果。",
    "tldr": "在民主选举中，我们提出了六个关于败选的公理，其中五个公理被已知的投票程序广泛满足，第六个公理是肯尼斯·艾罗著名的无关替代品独立条件的一个弱化版本。我们证明了这些公理与一种叫做分裂周期的方法相结合，可以提供最果断的败选定义，并且分析了该方法如何逃脱了艾罗的不可能定理和相关的不可能性结果。",
    "en_tdlr": "We propose six axioms concerning defeat in democratic elections, where five axioms are widely satisfied by known voting procedures, and the sixth axiom is a weakening of Kenneth Arrow's famous condition of the Independence of Irrelevant Alternatives (IIA). We prove that these axioms, together with a method called Split Cycle, provide the most resolute definition of defeat among any satisfying the six axioms for democratic defeat, and analyze how the method escapes Arrow's Impossibility Theorem and related impossibility results."
}