{
    "title": "A Comparative Analysis of Deep Reinforcement Learning-enabled Freeway Decision-making for Automated Vehicles. (arXiv:2008.01302v2 [cs.AI] UPDATED)",
    "abstract": "Deep reinforcement learning (DRL) has emerged as a pervasive and potent methodology for addressing artificial intelligence challenges. Due to its substantial potential for autonomous self-learning and self-improvement, DRL finds broad applications across various research domains. This article undertakes a comprehensive comparison of several DRL approaches con-cerning the decision-making challenges encountered by autono-mous vehicles on freeways. These techniques encompass common deep Q-learning (DQL), double deep Q-learning (DDQL), dueling deep Q-learning, and prioritized replay deep Q-learning. Initially, the reinforcement learning (RL) framework is introduced, fol-lowed by a mathematical establishment of the implementations of the aforementioned DRL methods. Subsequently, a freeway driving scenario for automated vehicles is constructed, wherein the decision-making problem is reformulated as a control opti-mization challenge. Finally, a series of simulation experiments are conducted t",
    "link": "http://arxiv.org/abs/2008.01302",
    "context": "Title: A Comparative Analysis of Deep Reinforcement Learning-enabled Freeway Decision-making for Automated Vehicles. (arXiv:2008.01302v2 [cs.AI] UPDATED)\nAbstract: Deep reinforcement learning (DRL) has emerged as a pervasive and potent methodology for addressing artificial intelligence challenges. Due to its substantial potential for autonomous self-learning and self-improvement, DRL finds broad applications across various research domains. This article undertakes a comprehensive comparison of several DRL approaches con-cerning the decision-making challenges encountered by autono-mous vehicles on freeways. These techniques encompass common deep Q-learning (DQL), double deep Q-learning (DDQL), dueling deep Q-learning, and prioritized replay deep Q-learning. Initially, the reinforcement learning (RL) framework is introduced, fol-lowed by a mathematical establishment of the implementations of the aforementioned DRL methods. Subsequently, a freeway driving scenario for automated vehicles is constructed, wherein the decision-making problem is reformulated as a control opti-mization challenge. Finally, a series of simulation experiments are conducted t",
    "path": "papers/20/08/2008.01302.json",
    "total_tokens": 916,
    "translated_title": "深度强化学习在自动驾驶车辆的高速公路决策中的比较分析",
    "translated_abstract": "深度强化学习(DRL)已经成为一种广泛应用于解决人工智能挑战的有效方法。由于其在自主学习和自我改进方面的巨大潜力，DRL在各个研究领域都有广泛的应用。本文对自动驾驶车辆在高速公路上面临的决策挑战进行了几种DRL方法的综合比较。这些技术包括常见的深度Q学习(DQL)、双深度Q学习(DDQL)、对决深度Q学习和优先重放深度Q学习。首先介绍了强化学习(RL)框架，然后对上述DRL方法的实现进行了数学建模。随后，构建了一个自动驾驶车辆的高速公路驾驶场景，将决策问题重新定义为控制优化挑战。最后，进行了一系列模拟实验。",
    "tldr": "本文针对自动驾驶车辆在高速公路上的决策挑战进行了比较分析，通过应用多种深度强化学习方法，解决了控制优化问题，为自主学习和自我改进提供了广泛的应用前景。",
    "en_tdlr": "This article provides a comparative analysis of deep reinforcement learning methods for autonomous vehicles in freeway decision-making. By addressing the control optimization challenge through different DRL techniques, it explores the potential for autonomous self-learning and improvement, and highlights the broad applications in this field."
}