{
    "title": "Inference for parameters identified by conditional moment restrictions using a generalized Bierens maximum statistic. (arXiv:2008.11140v5 [econ.EM] UPDATED)",
    "abstract": "Many economic panel and dynamic models, such as rational behavior and Euler equations, imply that the parameters of interest are identified by conditional moment restrictions with high dimensional conditioning instruments. We develop a novel inference method for the parameters identified by conditional moment restrictions, where the dimension of the conditioning instruments is high and there is no prior information about which conditioning instruments are weak or irrelevant. Building on Bierens (1990), we propose penalized maximum statistics and combine bootstrap inference with model selection. Our method optimizes the asymptotic power against a set of $n^{-1/2}$-local alternatives of interest by solving a data-dependent max-min problem for tuning parameter selection. We demonstrate the efficacy of our method by two empirical examples: the elasticity of intertemporal substitution and rational unbiased reporting of ability status. Extensive Monte Carlo experiments based on the first emp",
    "link": "http://arxiv.org/abs/2008.11140",
    "context": "Title: Inference for parameters identified by conditional moment restrictions using a generalized Bierens maximum statistic. (arXiv:2008.11140v5 [econ.EM] UPDATED)\nAbstract: Many economic panel and dynamic models, such as rational behavior and Euler equations, imply that the parameters of interest are identified by conditional moment restrictions with high dimensional conditioning instruments. We develop a novel inference method for the parameters identified by conditional moment restrictions, where the dimension of the conditioning instruments is high and there is no prior information about which conditioning instruments are weak or irrelevant. Building on Bierens (1990), we propose penalized maximum statistics and combine bootstrap inference with model selection. Our method optimizes the asymptotic power against a set of $n^{-1/2}$-local alternatives of interest by solving a data-dependent max-min problem for tuning parameter selection. We demonstrate the efficacy of our method by two empirical examples: the elasticity of intertemporal substitution and rational unbiased reporting of ability status. Extensive Monte Carlo experiments based on the first emp",
    "path": "papers/20/08/2008.11140.json",
    "total_tokens": 852,
    "translated_title": "使用广义Bierens最大统计量对由条件矩限制所确定的参数进行推断",
    "translated_abstract": "许多经济面板和动态模型，如理性行为和欧拉方程，暗示了感兴趣的参数通过具有高维条件仪器的条件矩限制来确定。我们提出了一种新的参数推断方法，其中条件仪器的维度很高，并且没有关于哪些条件仪器是弱或无关的先验信息。基于Bierens（1990），我们提出了惩罚的最大统计量，并将引导推断与模型选择相结合。我们的方法通过解决一个数据相关的最大最小问题来为调节参数选择优化与感兴趣的n^{-1/2}本地备择方案的渐近功率。我们通过两个实证示例展示了我们方法的功效：跨期替代弹性和关于能力状况的理性无偏报告。基于第一个emp的广泛Monte Carlo实验",
    "tldr": "该论文提出了一种新的参数推断方法，通过结合模型选择和引导推断，对由具有高维条件仪器的条件矩限制所确定的参数进行推断。该方法通过解决一个数据相关的最大最小问题来优化渐近功率，并在两个实证例子中展示了其功效。"
}