{
    "title": "Learning Node Representations against Perturbations. (arXiv:2008.11416v3 [cs.LG] UPDATED)",
    "abstract": "Recent graph neural networks (GNN) has achieved remarkable performance in node representation learning. One key factor of GNN's success is the \\emph{smoothness} property on node representations. Despite this, most GNN models are fragile to the perturbations on graph inputs and could learn unreliable node representations. In this paper, we study how to learn node representations against perturbations in GNN. Specifically, we consider that a node representation should remain stable under slight perturbations on the input, and node representations from different structures should be identifiable, which two are termed as the \\emph{stability} and \\emph{identifiability} on node representations, respectively. To this end, we propose a novel model called Stability-Identifiability GNN Against Perturbations (SIGNNAP) that learns reliable node representations in an unsupervised manner. SIGNNAP formalizes the \\emph{stability} and \\emph{identifiability} by a contrastive objective and preserves the ",
    "link": "http://arxiv.org/abs/2008.11416",
    "context": "Title: Learning Node Representations against Perturbations. (arXiv:2008.11416v3 [cs.LG] UPDATED)\nAbstract: Recent graph neural networks (GNN) has achieved remarkable performance in node representation learning. One key factor of GNN's success is the \\emph{smoothness} property on node representations. Despite this, most GNN models are fragile to the perturbations on graph inputs and could learn unreliable node representations. In this paper, we study how to learn node representations against perturbations in GNN. Specifically, we consider that a node representation should remain stable under slight perturbations on the input, and node representations from different structures should be identifiable, which two are termed as the \\emph{stability} and \\emph{identifiability} on node representations, respectively. To this end, we propose a novel model called Stability-Identifiability GNN Against Perturbations (SIGNNAP) that learns reliable node representations in an unsupervised manner. SIGNNAP formalizes the \\emph{stability} and \\emph{identifiability} by a contrastive objective and preserves the ",
    "path": "papers/20/08/2008.11416.json",
    "total_tokens": 898,
    "translated_title": "针对扰动学习节点表示",
    "translated_abstract": "最近的图神经网络 (GNN) 在节点表示学习方面取得了显著的表现。GNN的成功关键因素之一是节点表示上的“平滑”属性。尽管如此，大多数GNN模型对图输入的扰动很脆弱，可能会学习到不可靠的节点表示。本文研究如何在GNN中针对扰动学习节点表示。具体而言，我们认为节点表示应在输入略微扰动时保持稳定，并且应能够识别不同结构的节点表示，这两者分别被称为节点表示的“稳定性”和“可识别性”。为此，我们提出了一种名为稳定-可识别GNN反对扰动 (SIGNNAP) 的新模型，该模型以无监督的方式学习可靠的节点表示。SIGNNAP通过对比目标来形式化“稳定性”和“可识别性”，并保留了...",
    "tldr": "本文讨论如何在GNN中针对扰动学习节点表示，并提出了稳定-可识别GNN反对扰动 (SIGNNAP) 模型以无监督形式学习可靠的节点表示。"
}