{
    "title": "On the representation and learning of monotone triangular transport maps",
    "abstract": "arXiv:2009.10303v3 Announce Type: replace-cross  Abstract: Transportation of measure provides a versatile approach for modeling complex probability distributions, with applications in density estimation, Bayesian inference, generative modeling, and beyond. Monotone triangular transport maps$\\unicode{x2014}$approximations of the Knothe$\\unicode{x2013}$Rosenblatt (KR) rearrangement$\\unicode{x2014}$are a canonical choice for these tasks. Yet the representation and parameterization of such maps have a significant impact on their generality and expressiveness, and on properties of the optimization problem that arises in learning a map from data (e.g., via maximum likelihood estimation). We present a general framework for representing monotone triangular maps via invertible transformations of smooth functions. We establish conditions on the transformation such that the associated infinite-dimensional minimization problem has no spurious local minima, i.e., all local minima are global minima;",
    "link": "https://arxiv.org/abs/2009.10303",
    "context": "Title: On the representation and learning of monotone triangular transport maps\nAbstract: arXiv:2009.10303v3 Announce Type: replace-cross  Abstract: Transportation of measure provides a versatile approach for modeling complex probability distributions, with applications in density estimation, Bayesian inference, generative modeling, and beyond. Monotone triangular transport maps$\\unicode{x2014}$approximations of the Knothe$\\unicode{x2013}$Rosenblatt (KR) rearrangement$\\unicode{x2014}$are a canonical choice for these tasks. Yet the representation and parameterization of such maps have a significant impact on their generality and expressiveness, and on properties of the optimization problem that arises in learning a map from data (e.g., via maximum likelihood estimation). We present a general framework for representing monotone triangular maps via invertible transformations of smooth functions. We establish conditions on the transformation such that the associated infinite-dimensional minimization problem has no spurious local minima, i.e., all local minima are global minima;",
    "path": "papers/20/09/2009.10303.json",
    "total_tokens": 794,
    "translated_title": "关于单调三角形输运映射的表示和学习",
    "translated_abstract": "测度的输运提供了对建模复杂概率分布的多功能方法，在密度估计、贝叶斯推断、生成建模等方面有应用。单调三角形输运映射——Knothe-Rosenblatt (KR)排列的近似，在这些任务中是一个经典选择。然而，这些映射的表示和参数化对其通用性、表达能力以及从数据中学习映射所引起的优化问题的性质（例如通过最大似然估计）有重要影响。我们提出了一个表示单调三角形映射的通用框架，通过光滑函数的可逆变换。我们建立了变换的条件，使得相关的无穷维最小化问题没有虚假局部极小值，即所有局部极小值都是全局极小值。",
    "tldr": "提出了通过光滑函数的可逆变换表示单调三角形映射的通用框架，使得相关的无穷维最小化问题具有全局最小值。",
    "en_tdlr": "Introduced a general framework for representing monotone triangular maps via invertible transformations of smooth functions, ensuring that the associated infinite-dimensional minimization problem has global minima without spurious local minima."
}