{
    "title": "An Intuitive Tutorial to Gaussian Process Regression. (arXiv:2009.10862v5 [stat.ML] UPDATED)",
    "abstract": "This tutorial aims to provide an intuitive introduction to Gaussian process regression (GPR). GPR models have been widely used in machine learning applications due to their representation flexibility and inherent capability to quantify uncertainty over predictions. The tutorial starts with explaining the basic concepts that a Gaussian process is built on, including multivariate normal distribution, kernels, non-parametric models, and joint and conditional probability. It then provides a concise description of GPR and an implementation of a standard GPR algorithm. In addition, the tutorial reviews packages for implementing state-of-the-art Gaussian process algorithms. This tutorial is accessible to a broad audience, including those new to machine learning, ensuring a clear understanding of GPR fundamentals.",
    "link": "http://arxiv.org/abs/2009.10862",
    "context": "Title: An Intuitive Tutorial to Gaussian Process Regression. (arXiv:2009.10862v5 [stat.ML] UPDATED)\nAbstract: This tutorial aims to provide an intuitive introduction to Gaussian process regression (GPR). GPR models have been widely used in machine learning applications due to their representation flexibility and inherent capability to quantify uncertainty over predictions. The tutorial starts with explaining the basic concepts that a Gaussian process is built on, including multivariate normal distribution, kernels, non-parametric models, and joint and conditional probability. It then provides a concise description of GPR and an implementation of a standard GPR algorithm. In addition, the tutorial reviews packages for implementing state-of-the-art Gaussian process algorithms. This tutorial is accessible to a broad audience, including those new to machine learning, ensuring a clear understanding of GPR fundamentals.",
    "path": "papers/20/09/2009.10862.json",
    "total_tokens": 822,
    "translated_title": "《高斯过程回归的直观教程》",
    "translated_abstract": "本教程旨在直观介绍高斯过程回归（GPR）。由于其灵活性和对预测不确定性的固有能力，GPR模型在机器学习应用中得到广泛应用。教程从解释高斯过程构建的基本概念开始，包括多元正态分布、核函数、非参数模型以及联合概率和条件概率。然后，它提供了对GPR的简明描述和标准GPR算法的实现。此外，教程还回顾了实现最先进的高斯过程算法的软件包。本教程适用于广泛的受众，包括对机器学习不熟悉的人，以确保对GPR的基本原理有清晰的理解。",
    "tldr": "《高斯过程回归的直观教程》是一篇介绍高斯过程回归的教程，旨在直观地解释GPR的基本概念、提供实现代码，并回顾最先进的高斯过程算法。适合机器学习初学者阅读，帮助他们清晰理解GPR的基本原理。",
    "en_tdlr": "\"An Intuitive Tutorial to Gaussian Process Regression\" is a tutorial that provides an intuitive introduction to GPR, explaining its basic concepts, providing implementation code, and reviewing state-of-the-art GPR algorithms. It is suitable for beginners in machine learning, helping them gain a clear understanding of the fundamentals of GPR."
}