{
    "title": "Upstreamness and downstreamness in input-output analysis from local and aggregate information",
    "abstract": "Ranking sectors and countries within global value chains is of paramount importance to estimate risks and forecast growth in large economies. However, this task is often non-trivial due to the lack of complete and accurate information on the flows of money and goods between sectors and countries, which are encoded in Input-Output (I-O) tables. In this work, we show that an accurate estimation of the role played by sectors and countries in supply chain networks can be achieved without full knowledge of the I-O tables, but only relying on local and aggregate information, e.g., the total intermediate demand per sector. Our method, based on a rank-$1$ approximation to the I-O table, shows consistently good performance in reconstructing rankings (i.e., upstreamness and downstreamness measures for countries and sectors) when tested on empirical data from the World Input-Output Database. Moreover, we connect the accuracy of our approximate framework with the spectral properties of the I-O tab",
    "link": "https://arxiv.org/abs/2009.06350",
    "context": "Title: Upstreamness and downstreamness in input-output analysis from local and aggregate information\nAbstract: Ranking sectors and countries within global value chains is of paramount importance to estimate risks and forecast growth in large economies. However, this task is often non-trivial due to the lack of complete and accurate information on the flows of money and goods between sectors and countries, which are encoded in Input-Output (I-O) tables. In this work, we show that an accurate estimation of the role played by sectors and countries in supply chain networks can be achieved without full knowledge of the I-O tables, but only relying on local and aggregate information, e.g., the total intermediate demand per sector. Our method, based on a rank-$1$ approximation to the I-O table, shows consistently good performance in reconstructing rankings (i.e., upstreamness and downstreamness measures for countries and sectors) when tested on empirical data from the World Input-Output Database. Moreover, we connect the accuracy of our approximate framework with the spectral properties of the I-O tab",
    "path": "papers/20/09/2009.06350.json",
    "total_tokens": 1016,
    "translated_title": "从局部和总体信息中进行的输入产出分析中的上游性和下游性",
    "translated_abstract": "在全球价值链中对部门和国家进行排名是估计风险和预测大经济体增长的至关重要的任务。然而，由于对部门和国家之间货币和商品流动的完整准确信息的缺乏，这个任务通常并不容易，这些信息被编码在输入产出表中。在这项工作中，我们展示了在不完全了解输入产出表的情况下，只依靠局部和总体信息（例如每个部门的总中间需求）就能够准确估计部门和国家在供应链网络中发挥的作用。我们的方法基于对输入产出表的秩为1的近似，通过在来自世界输入产出数据库的实证数据上进行测试，在重建排名（即对国家和部门的上游性和下游性度量）方面表现出一致良好的性能。此外，我们将我们的近似框架的准确性与输入产出表的谱特性联系起来。",
    "tldr": "该论文研究了在输入产出分析中，对部门和国家进行上游性和下游性排名的方法。通过仅依赖于局部和总体信息，而无需完全了解输入产出表，该论文展示了一种准确估计供应链网络中部门和国家作用的方法。通过在世界输入产出数据库的实证数据上进行测试，该方法在重建排名方面表现出一致良好的性能。此外，该论文还将近似框架的准确性与输入产出表的谱特性联系起来。",
    "en_tdlr": "This paper investigates a method for ranking sectors and countries in terms of their upstreamness and downstreamness in input-output analysis. By relying only on local and aggregate information, without requiring complete knowledge of the input-output tables, the paper introduces an accurate estimation approach for the role played by sectors and countries in the supply chain network. The method demonstrates consistently good performance in reconstructing rankings when tested on empirical data, and connects the accuracy of the approximation framework with the spectral properties of the input-output tables."
}