{
    "title": "Forecasting financial markets with semantic network analysis in the COVID-19 crisis. (arXiv:2009.04975v4 [q-fin.GN] UPDATED)",
    "abstract": "This paper uses a new textual data index for predicting stock market data. The index is applied to a large set of news to evaluate the importance of one or more general economic-related keywords appearing in the text. The index assesses the importance of the economic-related keywords, based on their frequency of use and semantic network position. We apply it to the Italian press and construct indices to predict Italian stock and bond market returns and volatilities in a recent sample period, including the COVID-19 crisis. The evidence shows that the index captures the different phases of financial time series well. Moreover, results indicate strong evidence of predictability for bond market data, both returns and volatilities, short and long maturities, and stock market volatility.",
    "link": "http://arxiv.org/abs/2009.04975",
    "context": "Title: Forecasting financial markets with semantic network analysis in the COVID-19 crisis. (arXiv:2009.04975v4 [q-fin.GN] UPDATED)\nAbstract: This paper uses a new textual data index for predicting stock market data. The index is applied to a large set of news to evaluate the importance of one or more general economic-related keywords appearing in the text. The index assesses the importance of the economic-related keywords, based on their frequency of use and semantic network position. We apply it to the Italian press and construct indices to predict Italian stock and bond market returns and volatilities in a recent sample period, including the COVID-19 crisis. The evidence shows that the index captures the different phases of financial time series well. Moreover, results indicate strong evidence of predictability for bond market data, both returns and volatilities, short and long maturities, and stock market volatility.",
    "path": "papers/20/09/2009.04975.json",
    "total_tokens": 872,
    "translated_title": "在COVID-19危机中使用语义网络分析预测金融市场",
    "translated_abstract": "本文使用一种新的文本数据指标来预测股票市场数据。该指标应用于大量新闻中，评估文本中出现的一个或多个与经济相关的关键词的重要性。该指标根据关键词的使用频率和语义网络位置评估其重要性。我们将其应用于意大利新闻，并构建指数来预测意大利股票和债券市场的回报率和波动性，包括COVID-19危机期间的数据。研究结果表明，该指标很好地捕捉到金融时间序列的不同阶段。此外，研究结果显示，债券市场数据，无论是回报率还是波动性，在短期和长期到期日以及股票市场波动性方面都存在明显的可预测性。",
    "tldr": "本文通过使用语义网络分析来预测金融市场，基于新的文本数据指标，评估经济相关关键词的重要性，并应用于意大利股票和债券市场。研究结果显示，该指标能够很好地捕捉到金融时间序列的不同阶段，并且对于债券市场数据和股票市场波动性都存在明显的可预测性。",
    "en_tdlr": "This paper uses semantic network analysis to forecast financial markets by evaluating the importance of economic-related keywords in text data. The results show that the index captures different phases of financial time series and demonstrates predictability for bond market data and stock market volatility."
}