{
    "title": "A Computational Approach to Identification of Treatment Effects for Policy Evaluation. (arXiv:2009.13861v3 [econ.EM] UPDATED)",
    "abstract": "For counterfactual policy evaluation, it is important to ensure that treatment parameters are relevant to policies in question. This is especially challenging under unobserved heterogeneity, as is well featured in the definition of the local average treatment effect (LATE). Being intrinsically local, the LATE is known to lack external validity in counterfactual environments. This paper investigates the possibility of extrapolating local treatment effects to different counterfactual settings when instrumental variables are only binary. We propose a novel framework to systematically calculate sharp nonparametric bounds on various policy-relevant treatment parameters that are defined as weighted averages of the marginal treatment effect (MTE). Our framework is flexible enough to fully incorporate statistical independence (rather than mean independence) of instruments and a large menu of identifying assumptions beyond the shape restrictions on the MTE that have been considered in prior stu",
    "link": "http://arxiv.org/abs/2009.13861",
    "context": "Title: A Computational Approach to Identification of Treatment Effects for Policy Evaluation. (arXiv:2009.13861v3 [econ.EM] UPDATED)\nAbstract: For counterfactual policy evaluation, it is important to ensure that treatment parameters are relevant to policies in question. This is especially challenging under unobserved heterogeneity, as is well featured in the definition of the local average treatment effect (LATE). Being intrinsically local, the LATE is known to lack external validity in counterfactual environments. This paper investigates the possibility of extrapolating local treatment effects to different counterfactual settings when instrumental variables are only binary. We propose a novel framework to systematically calculate sharp nonparametric bounds on various policy-relevant treatment parameters that are defined as weighted averages of the marginal treatment effect (MTE). Our framework is flexible enough to fully incorporate statistical independence (rather than mean independence) of instruments and a large menu of identifying assumptions beyond the shape restrictions on the MTE that have been considered in prior stu",
    "path": "papers/20/09/2009.13861.json",
    "total_tokens": 976,
    "translated_title": "一种用于政策评估的治疗效果识别的计算方法",
    "translated_abstract": "对于反事实政策评估，确保治疗参数与所讨论的政策相关非常重要。在存在未观察到的异质性的情况下，这一点尤为具有挑战性，而这在局部平均治疗效应（LATE）的定义中得到了很好的体现。作为内在的局部效应，LATE已知在反事实环境下缺乏外部效度。本文研究了当工具变量仅为二值时，将局部治疗效应推广到不同反事实情境的可能性。我们提出了一个新的框架，系统地计算各种与政策相关的治疗参数的尖锐非参数界限，这些参数被定义为边际治疗效应（MTE）的加权平均。我们的框架足够灵活，能够充分融入工具变量的统计独立性（而不仅仅是均值独立性），并且能够考虑多种形状约束之外的鉴定假设，这些形状约束在之前的研究中已经被考虑过了。",
    "tldr": "本文研究了一种计算方法，能够在存在未观察到的异质性和仅有二值工具变量的情况下，推广局部治疗效应到不同的反事实情境，并且提出了一个新的框架，可以系统地计算各种与政策相关的治疗参数的尖锐非参数界限。",
    "en_tdlr": "This paper investigates a computational approach to extrapolate local treatment effects to different counterfactual settings in the presence of unobserved heterogeneity and only binary instrumental variables. The proposed framework calculates sharp nonparametric bounds on policy-relevant treatment parameters and incorporates statistical independence of instruments and various identifying assumptions."
}