{
    "title": "End-to-end Kernel Learning via Generative Random Fourier Features. (arXiv:2009.04614v5 [cs.LG] UPDATED)",
    "abstract": "Random Fourier features (RFFs) provide a promising way for kernel learning in a spectral case. Current RFFs-based kernel learning methods usually work in a two-stage way. In the first-stage process, learning the optimal feature map is often formulated as a target alignment problem, which aims to align the learned kernel with the pre-defined target kernel (usually the ideal kernel). In the second-stage process, a linear learner is conducted with respect to the mapped random features. Nevertheless, the pre-defined kernel in target alignment is not necessarily optimal for the generalization of the linear learner. Instead, in this paper, we consider a one-stage process that incorporates the kernel learning and linear learner into a unifying framework. To be specific, a generative network via RFFs is devised to implicitly learn the kernel, followed by a linear classifier parameterized as a full-connected layer. Then the generative network and the classifier are jointly trained by solving th",
    "link": "http://arxiv.org/abs/2009.04614",
    "context": "Title: End-to-end Kernel Learning via Generative Random Fourier Features. (arXiv:2009.04614v5 [cs.LG] UPDATED)\nAbstract: Random Fourier features (RFFs) provide a promising way for kernel learning in a spectral case. Current RFFs-based kernel learning methods usually work in a two-stage way. In the first-stage process, learning the optimal feature map is often formulated as a target alignment problem, which aims to align the learned kernel with the pre-defined target kernel (usually the ideal kernel). In the second-stage process, a linear learner is conducted with respect to the mapped random features. Nevertheless, the pre-defined kernel in target alignment is not necessarily optimal for the generalization of the linear learner. Instead, in this paper, we consider a one-stage process that incorporates the kernel learning and linear learner into a unifying framework. To be specific, a generative network via RFFs is devised to implicitly learn the kernel, followed by a linear classifier parameterized as a full-connected layer. Then the generative network and the classifier are jointly trained by solving th",
    "path": "papers/20/09/2009.04614.json",
    "total_tokens": 924,
    "translated_title": "通过生成型随机傅立叶特征进行端到端内核学习",
    "translated_abstract": "随机傅立叶特征（RFFs）为谱内核学习提供了一种有前景的方法。目前基于RFFs的内核学习方法通常以两阶段方式工作。在第一阶段过程中，学习最优特征映射通常被表述为目标对齐问题，其目标是将学习到的内核与预定义的目标内核（通常是理想内核）对齐。在第二阶段过程中，线性学习器针对映射的随机特征进行训练。然而，目标对齐中的预定义内核不一定对于线性学习器的泛化是最优的。相反，在本文中，我们考虑将内核学习和线性学习器融合为一个统一框架的一阶段过程。具体而言，我们设计了一个通过RFFs隐式学习内核的生成网络，接着使用一个全连接层参数化的线性分类器。然后，通过求解优化问题，联合训练生成网络和分类器。",
    "tldr": "本文提出了一种通过生成型随机傅立叶特征进行端到端内核学习的方法，将内核学习和线性学习器融合为一个统一框架，通过生成网络和线性分类器联合训练以实现更好的泛化性能。",
    "en_tdlr": "This paper presents a method for end-to-end kernel learning using generative random Fourier features, which integrates kernel learning and linear learner into a unified framework. The generative network and linear classifier are jointly trained to achieve better generalization performance."
}