{
    "title": "Latent Causal Socioeconomic Health Index. (arXiv:2009.12217v2 [stat.ME] UPDATED)",
    "abstract": "This research develops a model-based LAtent Causal Socioeconomic Health (LACSH) index at the national level. Motivated by the need for a holistic national well-being index, we build upon the latent health factor index (LHFI) approach that has been used to assess the unobservable ecological/ecosystem health. LHFI integratively models the relationship between metrics, latent health, and covariates that drive the notion of health. In this paper, the LHFI structure is integrated with spatial modeling and statistical causal modeling. Our efforts are focused on developing the integrated framework to facilitate the understanding of how an observational continuous variable might have causally affected a latent trait that exhibits spatial correlation. A novel visualization technique to evaluate covariate balance is also introduced for the case of a continuous policy (treatment) variable. Our resulting LACSH framework and visualization tool are illustrated through two global case studies on nati",
    "link": "http://arxiv.org/abs/2009.12217",
    "context": "Title: Latent Causal Socioeconomic Health Index. (arXiv:2009.12217v2 [stat.ME] UPDATED)\nAbstract: This research develops a model-based LAtent Causal Socioeconomic Health (LACSH) index at the national level. Motivated by the need for a holistic national well-being index, we build upon the latent health factor index (LHFI) approach that has been used to assess the unobservable ecological/ecosystem health. LHFI integratively models the relationship between metrics, latent health, and covariates that drive the notion of health. In this paper, the LHFI structure is integrated with spatial modeling and statistical causal modeling. Our efforts are focused on developing the integrated framework to facilitate the understanding of how an observational continuous variable might have causally affected a latent trait that exhibits spatial correlation. A novel visualization technique to evaluate covariate balance is also introduced for the case of a continuous policy (treatment) variable. Our resulting LACSH framework and visualization tool are illustrated through two global case studies on nati",
    "path": "papers/20/09/2009.12217.json",
    "total_tokens": 1021,
    "translated_title": "潜在因果社会经济健康指数",
    "translated_abstract": "该研究在国家层面上发展了一个基于模型的潜在因果社会经济健康（LACSH）指数。受到对全面国家幸福指数的需求的驱使，我们建立在已被用于评估不可观察的生态/生态系统健康的潜在健康因子指数（LHFI）方法的基础上。LHFI综合性地建模了指标、潜在健康和驱动健康概念的协变量之间的关系。在本文中，LHFI结构与空间建模和统计因果建模相结合。我们的工作重点是开发集成框架，以便更好地理解观察连续变量如何可能对具有空间相关性的潜在特征产生因果影响。还介绍了一种用于连续政策（治疗）变量的协变量平衡评估的新型可视化技术。我们的LACSH框架和可视化工具通过两个全球案例研究进行了说明。",
    "tldr": "该研究发展了一个基于模型的潜在因果社会经济健康（LACSH）指数，通过将潜在健康因子指数与空间建模和统计因果建模相结合，以促进对观察连续变量对具有空间相关性的潜在特征产生因果影响的理解。研究还介绍了一种用于评估连续政策变量的协变量平衡的新型可视化技术。",
    "en_tdlr": "This research develops a model-based Latent Causal Socioeconomic Health (LACSH) index by integrating the latent health factor index with spatial modeling and statistical causal modeling. It aims to facilitate the understanding of how an observational continuous variable might have causally affected a latent trait that exhibits spatial correlation. Additionally, a new visualization technique for evaluating covariate balance is introduced for continuous policy variables."
}