{
    "title": "A Survey of Knowledge Representation in Service Robotics. (arXiv:1807.02192v4 [cs.RO] UPDATED)",
    "abstract": "Within the realm of service robotics, researchers have placed a great amount of effort into learning, understanding, and representing motions as manipulations for task execution by robots. The task of robot learning and problem-solving is very broad, as it integrates a variety of tasks such as object detection, activity recognition, task/motion planning, localization, knowledge representation and retrieval, and the intertwining of perception/vision and machine learning techniques. In this paper, we solely focus on knowledge representations and notably how knowledge is typically gathered, represented, and reproduced to solve problems as done by researchers in the past decades. In accordance with the definition of knowledge representations, we discuss the key distinction between such representations and useful learning models that have extensively been introduced and studied in recent years, such as machine learning, deep learning, probabilistic modelling, and semantic graphical structur",
    "link": "http://arxiv.org/abs/1807.02192",
    "context": "Title: A Survey of Knowledge Representation in Service Robotics. (arXiv:1807.02192v4 [cs.RO] UPDATED)\nAbstract: Within the realm of service robotics, researchers have placed a great amount of effort into learning, understanding, and representing motions as manipulations for task execution by robots. The task of robot learning and problem-solving is very broad, as it integrates a variety of tasks such as object detection, activity recognition, task/motion planning, localization, knowledge representation and retrieval, and the intertwining of perception/vision and machine learning techniques. In this paper, we solely focus on knowledge representations and notably how knowledge is typically gathered, represented, and reproduced to solve problems as done by researchers in the past decades. In accordance with the definition of knowledge representations, we discuss the key distinction between such representations and useful learning models that have extensively been introduced and studied in recent years, such as machine learning, deep learning, probabilistic modelling, and semantic graphical structur",
    "path": "papers/18/07/1807.02192.json",
    "total_tokens": 810,
    "translated_title": "服务机器人中知识表示的综述",
    "translated_abstract": "在服务机器人领域，研究人员致力于学习、理解和表示机器人执行任务的运动方式。机器人学习和问题解决的任务是非常广泛的，因为它集成了如物体检测、活动识别、任务/运动规划、定位、知识表示和检索以及感知/视觉和机器学习技术的各种任务。本文仅关注知识表示，并阐述了过去几十年来研究人员通常如何收集、表示和再现知识以解决问题。根据知识表示的定义，我们讨论了这种表示与近年来广泛介绍和研究的有用学习模型之间的主要区别，如机器学习、深度学习、概率建模和语义图形结构。",
    "tldr": "本文重点综述了服务机器人中知识表示的研究进展，深入探讨了知识的获取、表示和应用，与其他学习模型的差异，并探讨了其在机器人任务中的重要性。",
    "en_tdlr": "This paper provides a comprehensive survey on the research progress of knowledge representation in service robotics, focusing on the acquisition, representation, and application of knowledge, discussing the differences from other learning models, and exploring its significance in robotic tasks."
}