{
    "title": "Generative Adversarial Trainer: Defense to Adversarial Perturbations with GAN. (arXiv:1705.03387v3 [cs.LG] UPDATED)",
    "abstract": "We propose a novel technique to make neural network robust to adversarial examples using a generative adversarial network. We alternately train both classifier and generator networks. The generator network generates an adversarial perturbation that can easily fool the classifier network by using a gradient of each image. Simultaneously, the classifier network is trained to classify correctly both original and adversarial images generated by the generator. These procedures help the classifier network to become more robust to adversarial perturbations. Furthermore, our adversarial training framework efficiently reduces overfitting and outperforms other regularization methods such as Dropout. We applied our method to supervised learning for CIFAR datasets, and experimantal results show that our method significantly lowers the generalization error of the network. To the best of our knowledge, this is the first method which uses GAN to improve supervised learning.",
    "link": "http://arxiv.org/abs/1705.03387",
    "context": "Title: Generative Adversarial Trainer: Defense to Adversarial Perturbations with GAN. (arXiv:1705.03387v3 [cs.LG] UPDATED)\nAbstract: We propose a novel technique to make neural network robust to adversarial examples using a generative adversarial network. We alternately train both classifier and generator networks. The generator network generates an adversarial perturbation that can easily fool the classifier network by using a gradient of each image. Simultaneously, the classifier network is trained to classify correctly both original and adversarial images generated by the generator. These procedures help the classifier network to become more robust to adversarial perturbations. Furthermore, our adversarial training framework efficiently reduces overfitting and outperforms other regularization methods such as Dropout. We applied our method to supervised learning for CIFAR datasets, and experimantal results show that our method significantly lowers the generalization error of the network. To the best of our knowledge, this is the first method which uses GAN to improve supervised learning.",
    "path": "papers/17/05/1705.03387.json",
    "total_tokens": 944,
    "translated_title": "生成对抗性训练器：使用生成对抗网络防御对抗扰动",
    "translated_abstract": "我们提出了一种新颖的技术，使用生成对抗网络使神经网络对对抗性示例具有鲁棒性。我们交替训练分类器和生成器网络。生成器网络通过使用每个图像的梯度生成对抗扰动，从而轻松欺骗分类器网络。同时，分类器网络被训练以正确分类由生成器生成的原始和对抗图像。这些过程有助于使分类器网络对对抗扰动更加鲁棒。此外，我们的对抗训练框架有效地减少了过拟合，并且优于其他正则化方法，如Dropout。我们将我们的方法应用于CIFAR数据集的有监督学习中，实验结果表明我们的方法显著降低了网络的泛化误差。据我们所知，这是第一个使用生成对抗网络来改进监督学习的方法。",
    "tldr": "本论文提出了一种使用生成对抗网络来防御对抗扰动的新方法，通过交替训练分类器和生成器网络，生成器网络生成对抗扰动以欺骗分类器网络，同时分类器网络被训练以正确分类原始和对抗图像，这一过程使分类器网络对对抗扰动更加鲁棒，同时还能有效地降低网络的过拟合问题。"
}