{
    "title": "Nuclear Norm Regularized Estimation of Panel Regression Models. (arXiv:1810.10987v3 [econ.EM] UPDATED)",
    "abstract": "In this paper we investigate panel regression models with interactive fixed effects. We propose two new estimation methods that are based on minimizing convex objective functions. The first method minimizes the sum of squared residuals with a nuclear (trace) norm regularization. The second method minimizes the nuclear norm of the residuals. We establish the consistency of the two resulting estimators. Those estimators have a very important computational advantage compared to the existing least squares (LS) estimator, in that they are defined as minimizers of a convex objective function. In addition, the nuclear norm penalization helps to resolve a potential identification problem for interactive fixed effect models, in particular when the regressors are low-rank and the number of the factors is unknown. We also show how to construct estimators that are asymptotically equivalent to the least squares (LS) estimator in Bai (2009) and Moon and Weidner (2017) by using our nuclear norm regul",
    "link": "http://arxiv.org/abs/1810.10987",
    "context": "Title: Nuclear Norm Regularized Estimation of Panel Regression Models. (arXiv:1810.10987v3 [econ.EM] UPDATED)\nAbstract: In this paper we investigate panel regression models with interactive fixed effects. We propose two new estimation methods that are based on minimizing convex objective functions. The first method minimizes the sum of squared residuals with a nuclear (trace) norm regularization. The second method minimizes the nuclear norm of the residuals. We establish the consistency of the two resulting estimators. Those estimators have a very important computational advantage compared to the existing least squares (LS) estimator, in that they are defined as minimizers of a convex objective function. In addition, the nuclear norm penalization helps to resolve a potential identification problem for interactive fixed effect models, in particular when the regressors are low-rank and the number of the factors is unknown. We also show how to construct estimators that are asymptotically equivalent to the least squares (LS) estimator in Bai (2009) and Moon and Weidner (2017) by using our nuclear norm regul",
    "path": "papers/18/10/1810.10987.json",
    "total_tokens": 918,
    "translated_title": "面板回归模型的核范数规则化估计",
    "translated_abstract": "本文研究具有交互固定效应的面板回归模型。我们提出了两种基于最小化凸目标函数的新估计方法。第一种方法最小化残差平方和，带有核（迹）范数规则化。第二种方法最小化残差的核范数。我们建立了两个估计器的一致性。这些估计器与现有的最小二乘（LS）估计器相比具有非常重要的计算优势，因为它们被定义为凸目标函数的最小化器。此外，核范数罚项有助于解决交互固定效应模型的潜在识别问题，尤其是当回归器是低秩的且因素数量未知时。我们还展示了如何通过使用我们的核范数规则化估计器构造渐近等效于Bai（2009年）和Moon和Weidner（2017年）最小二乘（LS）估计器的估计器。",
    "tldr": "本文提出两种最小化凸目标函数的新估计方法，其中核范数罚项有助于解决低秩回归器下的交互固定效应模型的潜在识别问题，并且具有很重要的计算优势。",
    "en_tdlr": "This paper proposes two new estimation methods based on minimizing convex objective functions for panel regression models with interactive fixed effects, where the nuclear norm penalization helps to resolve a potential identification problem for interactive fixed effect models with low-rank regressors and unknown factors, and is shown to have important computational advantages compared to existing least squares estimators."
}