{
    "title": "Event Causality Is Key to Computational Story Understanding",
    "abstract": "arXiv:2311.09648v2 Announce Type: replace  Abstract: Cognitive science and symbolic AI research suggest that event causality provides vital information for story understanding. However, machine learning systems for story understanding rarely employ event causality, partially due to the lack of methods that reliably identify open-world causal event relations. Leveraging recent progress in large language models, we present the first method for event causality identification that leads to material improvements in computational story understanding. Our technique sets a new state of the art on the COPES dataset (Wang et al., 2023) for causal event relation identification. Further, in the downstream story quality evaluation task, the identified causal relations lead to 3.6-16.6% relative improvement on correlation with human ratings. In the multimodal story video-text alignment task, we attain 4.1-10.9% increase on Clip Accuracy and 4.2-13.5% increase on Sentence IoU. The findings indicate s",
    "link": "https://arxiv.org/abs/2311.09648",
    "context": "Title: Event Causality Is Key to Computational Story Understanding\nAbstract: arXiv:2311.09648v2 Announce Type: replace  Abstract: Cognitive science and symbolic AI research suggest that event causality provides vital information for story understanding. However, machine learning systems for story understanding rarely employ event causality, partially due to the lack of methods that reliably identify open-world causal event relations. Leveraging recent progress in large language models, we present the first method for event causality identification that leads to material improvements in computational story understanding. Our technique sets a new state of the art on the COPES dataset (Wang et al., 2023) for causal event relation identification. Further, in the downstream story quality evaluation task, the identified causal relations lead to 3.6-16.6% relative improvement on correlation with human ratings. In the multimodal story video-text alignment task, we attain 4.1-10.9% increase on Clip Accuracy and 4.2-13.5% increase on Sentence IoU. The findings indicate s",
    "path": "papers/23/11/2311.09648.json",
    "total_tokens": 846,
    "translated_title": "事件因果关系是计算故事理解的关键",
    "translated_abstract": "认知科学和符号人工智能研究表明，事件因果关系为故事理解提供了重要信息。然而，用于故事理解的机器学习系统很少使用事件因果关系，部分原因是缺乏可靠地识别开放世界因果事件关系的方法。借助近期在大型语言模型方面的进展，我们提出了一种事件因果关系识别方法，这种方法在计算机故事理解方面带来了实质性的改进。我们的技术在COPES数据集（Wang等，2023年）的因果事件关系识别方面达到了新的技术水平。此外，在下游故事质量评估任务中，识别的因果关系导致与人类评级的相关性提高了3.6-16.6%。在多模式故事视频-文本对齐任务中，我们实现了Clip准确性提高4.1-10.9%以及句子IoU提高4.2-13.5%。这些发现表明...",
    "tldr": "我们提出了一种利用最新语言模型进展的事件因果关系识别方法，在计算故事理解方面取得了实质性进展。",
    "en_tdlr": "We propose a method for event causality identification leveraging recent advancements in large language models, leading to significant improvements in computational story understanding."
}