{
    "title": "Beyond Still Images: Robust Multi-Stream Spatiotemporal Networks. (arXiv:2311.00800v1 [cs.CV])",
    "abstract": "A defining characteristic of natural vision is its ability to withstand a variety of input alterations, resulting in the creation of an invariant representation of the surroundings. While convolutional neural networks exhibit resilience to certain forms of spatial input variation, modifications in the spatial and temporal aspects can significantly affect the representations of video content in deep neural networks. Inspired by the resilience of natural vision to input variations, we employ a simple multi-stream model to explore its potential to address spatiotemporal changes by including temporal features. Our primary goal is to introduce a video-trained model and evaluate its robustness to diverse image and video inputs, with a particular focus on exploring the role of temporal features in invariant recognition. Results show that including videos and the temporal stream during training mitigates the decline in accuracy and mAP in image and video understanding tasks by 1.36% and 3.14%,",
    "link": "http://arxiv.org/abs/2311.00800",
    "context": "Title: Beyond Still Images: Robust Multi-Stream Spatiotemporal Networks. (arXiv:2311.00800v1 [cs.CV])\nAbstract: A defining characteristic of natural vision is its ability to withstand a variety of input alterations, resulting in the creation of an invariant representation of the surroundings. While convolutional neural networks exhibit resilience to certain forms of spatial input variation, modifications in the spatial and temporal aspects can significantly affect the representations of video content in deep neural networks. Inspired by the resilience of natural vision to input variations, we employ a simple multi-stream model to explore its potential to address spatiotemporal changes by including temporal features. Our primary goal is to introduce a video-trained model and evaluate its robustness to diverse image and video inputs, with a particular focus on exploring the role of temporal features in invariant recognition. Results show that including videos and the temporal stream during training mitigates the decline in accuracy and mAP in image and video understanding tasks by 1.36% and 3.14%,",
    "path": "papers/23/11/2311.00800.json",
    "total_tokens": 836,
    "translated_title": "超越静止图像：强大的多流时空网络",
    "translated_abstract": "自然视觉的一个定义特征是其能够承受各种输入变化，从而创建周围环境的不变表示。虽然卷积神经网络对某些形式的空间输入变化具有韧性，但空间和时间方面的修改可以显着影响深度神经网络中视频内容的表示。受自然视觉对输入变化的韧性启发，我们使用一个简单的多流模型来探索其通过包含时间特征来处理时空变化的潜力。我们的主要目标是引入一个经过视频训练的模型，并评估其对多样的图像和视频输入的鲁棒性，特别关注时间特征在不变识别中的作用。结果表明，训练时包括视频和时间流可以将图像和视频理解任务的准确性和mAP下降率减少1.36%和3.14%。",
    "tldr": "本论文通过引入包括时间特征的多流模型，提出了一个经过视频训练的鲁棒性模型，通过在训练中包括视频和时间流，减少了图像和视频理解任务的准确性下降率。",
    "en_tdlr": "This paper introduces a robust model trained on videos by incorporating temporal features, mitigating the decline in accuracy of image and video understanding tasks by including videos and the temporal stream during training."
}