{
    "title": "Supermind Ideator: Exploring generative AI to support creative problem-solving. (arXiv:2311.01937v1 [cs.AI])",
    "abstract": "Previous efforts to support creative problem-solving have included (a) techniques (such as brainstorming and design thinking) to stimulate creative ideas, and (b) software tools to record and share these ideas. Now, generative AI technologies can suggest new ideas that might never have occurred to the users, and users can then select from these ideas or use them to stimulate even more ideas. Here, we describe such a system, Supermind Ideator. The system uses a large language model (GPT 3.5) and adds prompting, fine tuning, and a user interface specifically designed to help people use creative problem-solving techniques. Some of these techniques can be applied to any problem; others are specifically intended to help generate innovative ideas about how to design groups of people and/or computers (\"superminds\"). We also describe our early experiences with using this system and suggest ways it could be extended to support additional techniques for other specific problem-solving domains.",
    "link": "http://arxiv.org/abs/2311.01937",
    "context": "Title: Supermind Ideator: Exploring generative AI to support creative problem-solving. (arXiv:2311.01937v1 [cs.AI])\nAbstract: Previous efforts to support creative problem-solving have included (a) techniques (such as brainstorming and design thinking) to stimulate creative ideas, and (b) software tools to record and share these ideas. Now, generative AI technologies can suggest new ideas that might never have occurred to the users, and users can then select from these ideas or use them to stimulate even more ideas. Here, we describe such a system, Supermind Ideator. The system uses a large language model (GPT 3.5) and adds prompting, fine tuning, and a user interface specifically designed to help people use creative problem-solving techniques. Some of these techniques can be applied to any problem; others are specifically intended to help generate innovative ideas about how to design groups of people and/or computers (\"superminds\"). We also describe our early experiences with using this system and suggest ways it could be extended to support additional techniques for other specific problem-solving domains.",
    "path": "papers/23/11/2311.01937.json",
    "total_tokens": 977,
    "translated_title": "超级心智理念者：探索生成式人工智能以支持创造性问题解决",
    "translated_abstract": "以往支持创造性问题解决的努力包括刺激创意思维的技术（如头脑风暴和设计思维）以及记录和分享这些想法的软件工具。现在，生成式人工智能技术可以提供用户从未想到的新想法，用户可以从这些想法中选择，或者用它们来刺激更多的想法。在这里，我们描述了这样一个系统，Supermind Ideator。该系统使用了一个大型语言模型（GPT 3.5），并添加了提示、微调和专门设计的用户界面，以帮助人们使用创造性问题解决技术。其中一些技术可应用于任何问题；另一些则专门用于帮助生成关于如何设计人组或人机组合（“超级心智”）的创新想法。我们还描述了我们使用这个系统的初步经验，并提出了扩展这个系统以支持其他特定问题解决领域技术的方法。",
    "tldr": "Supermind Ideator是一个使用生成式人工智能技术的系统，旨在支持创造性问题解决。该系统使用大型语言模型和专门设计的用户界面，能够提供新的创意想法，并帮助用户使用创造性问题解决技术。该系统还可以应用于各种问题，并特别适用于生成关于设计人组或人机组合的创新想法。",
    "en_tdlr": "Supermind Ideator is a system that utilizes generative AI to support creative problem-solving. It uses a large language model and a user interface specifically designed for this purpose, providing new creative ideas and helping users apply creative problem-solving techniques. It is applicable to various problems and particularly useful in generating innovative ideas about designing groups of people or humans interacting with computers."
}