{
    "title": "A Review and Roadmap of Deep Causal Model from Different Causal Structures and Representations. (arXiv:2311.00923v1 [cs.LG])",
    "abstract": "The fusion of causal models with deep learning introducing increasingly intricate data sets, such as the causal associations within images or between textual components, has surfaced as a focal research area. Nonetheless, the broadening of original causal concepts and theories to such complex, non-statistical data has been met with serious challenges. In response, our study proposes redefinitions of causal data into three distinct categories from the standpoint of causal structure and representation: definite data, semi-definite data, and indefinite data. Definite data chiefly pertains to statistical data used in conventional causal scenarios, while semi-definite data refers to a spectrum of data formats germane to deep learning, including time-series, images, text, and others. Indefinite data is an emergent research sphere inferred from the progression of data forms by us. To comprehensively present these three data paradigms, we elaborate on their formal definitions, differences mani",
    "link": "http://arxiv.org/abs/2311.00923",
    "context": "Title: A Review and Roadmap of Deep Causal Model from Different Causal Structures and Representations. (arXiv:2311.00923v1 [cs.LG])\nAbstract: The fusion of causal models with deep learning introducing increasingly intricate data sets, such as the causal associations within images or between textual components, has surfaced as a focal research area. Nonetheless, the broadening of original causal concepts and theories to such complex, non-statistical data has been met with serious challenges. In response, our study proposes redefinitions of causal data into three distinct categories from the standpoint of causal structure and representation: definite data, semi-definite data, and indefinite data. Definite data chiefly pertains to statistical data used in conventional causal scenarios, while semi-definite data refers to a spectrum of data formats germane to deep learning, including time-series, images, text, and others. Indefinite data is an emergent research sphere inferred from the progression of data forms by us. To comprehensively present these three data paradigms, we elaborate on their formal definitions, differences mani",
    "path": "papers/23/11/2311.00923.json",
    "total_tokens": 915,
    "translated_title": "深度因果模型的不同因果结构和表示的综述和路线图",
    "translated_abstract": "将因果模型与深度学习相结合，引入越来越复杂的数据集，例如图像内部的因果关联或文本组件之间的因果关联，成为一个重要的研究领域。然而，将原始的因果概念和理论拓展到这种复杂的非统计数据中遇到了严重的挑战。为此，我们的研究提出了从因果结构和表示的角度对因果数据进行重新定义，包括明确数据、半明确数据和不明确数据。明确数据主要涉及传统因果场景中使用的统计数据，而半明确数据涉及与深度学习相关的一系列数据格式，包括时间序列、图像、文本等。不明确数据是我们推断的一个新兴研究领域，其来源是数据形式的演变。为了全面介绍这三种数据范例，我们详细阐述了它们的形式定义和差异。",
    "tldr": "本研究综述了深度因果模型在不同因果结构和表示方面的应用，并提出了明确数据、半明确数据和不明确数据三种因果数据范例的定义，以应对将原始的因果概念和理论拓展到复杂非统计数据的挑战。"
}