{
    "title": "Best of Both Worlds: Stochastic and Adversarial Convex Function Chasing. (arXiv:2311.00181v1 [math.OC])",
    "abstract": "Convex function chasing (CFC) is an online optimization problem in which during each round $t$, a player plays an action $x_t$ in response to a hitting cost $f_t(x_t)$ and an additional cost of $c(x_t,x_{t-1})$ for switching actions. We study the CFC problem in stochastic and adversarial environments, giving algorithms that achieve performance guarantees simultaneously in both settings. Specifically, we consider the squared $\\ell_2$-norm switching costs and a broad class of quadratic hitting costs for which the sequence of minimizers either forms a martingale or is chosen adversarially. This is the first work that studies the CFC problem using a stochastic framework. We provide a characterization of the optimal stochastic online algorithm and, drawing a comparison between the stochastic and adversarial scenarios, we demonstrate that the adversarial-optimal algorithm exhibits suboptimal performance in the stochastic context. Motivated by this, we provide a best-of-both-worlds algorithm ",
    "link": "http://arxiv.org/abs/2311.00181",
    "context": "Title: Best of Both Worlds: Stochastic and Adversarial Convex Function Chasing. (arXiv:2311.00181v1 [math.OC])\nAbstract: Convex function chasing (CFC) is an online optimization problem in which during each round $t$, a player plays an action $x_t$ in response to a hitting cost $f_t(x_t)$ and an additional cost of $c(x_t,x_{t-1})$ for switching actions. We study the CFC problem in stochastic and adversarial environments, giving algorithms that achieve performance guarantees simultaneously in both settings. Specifically, we consider the squared $\\ell_2$-norm switching costs and a broad class of quadratic hitting costs for which the sequence of minimizers either forms a martingale or is chosen adversarially. This is the first work that studies the CFC problem using a stochastic framework. We provide a characterization of the optimal stochastic online algorithm and, drawing a comparison between the stochastic and adversarial scenarios, we demonstrate that the adversarial-optimal algorithm exhibits suboptimal performance in the stochastic context. Motivated by this, we provide a best-of-both-worlds algorithm ",
    "path": "papers/23/11/2311.00181.json",
    "total_tokens": 946,
    "translated_title": "最佳结合: 随机和对抗性凸函数追踪",
    "translated_abstract": "凸函数追踪(CFC)是一个在线优化问题，每一轮$t$，玩家根据损失函数$f_t(x_t)$和切换动作的额外成本$c(x_t,x_{t-1})$选择动作$x_t$。我们研究了随机和对抗性环境下的CFC问题，并给出了在两种情境下同时获得性能保证的算法。具体而言，我们考虑了平方$\\ell_2$范数的切换成本和一类广泛的二次损失函数，对于这类损失函数，极小化序列要么形成鞅，要么由对手选择。这是首个使用随机框架研究CFC问题的工作。我们给出了最佳随机在线算法的特征，并通过对随机和对抗性情景的比较，证明了在随机情境下，对抗性最优算法表现不佳。受此启发，我们提出了一种融合了两种情境的最佳算法。",
    "tldr": "该论文研究了随机和对抗性环境下的凸函数追踪问题，并给出了同时在两种情境下达到性能保证的算法。这是首个使用随机框架研究该问题的工作，提出了一种融合两种情境的最佳算法。",
    "en_tdlr": "This paper studies the problem of convex function chasing in both stochastic and adversarial environments and provides algorithms that achieve performance guarantees in both settings. It is the first work to study this problem using a stochastic framework and proposes a best-of-both-worlds algorithm that combines the advantages of both scenarios."
}