{
    "title": "Multi-Step Dialogue Workflow Action Prediction",
    "abstract": "In task-oriented dialogue, a system often needs to follow a sequence of actions, called a workflow, that complies with a set of guidelines in order to complete a task. In this paper, we propose the novel problem of multi-step workflow action prediction, in which the system predicts multiple future workflow actions. Accurate prediction of multiple steps allows for multi-turn automation, which can free up time to focus on more complex tasks. We propose three modeling approaches that are simple to implement yet lead to more action automation: 1) fine-tuning on a training dataset, 2) few-shot in-context learning leveraging retrieval and large language model prompting, and 3) zero-shot graph traversal, which aggregates historical action sequences into a graph for prediction. We show that multi-step action prediction produces features that improve accuracy on downstream dialogue tasks like predicting task success, and can increase automation of steps by 20% without requiring as much feedback",
    "link": "https://arxiv.org/abs/2311.09593",
    "context": "Title: Multi-Step Dialogue Workflow Action Prediction\nAbstract: In task-oriented dialogue, a system often needs to follow a sequence of actions, called a workflow, that complies with a set of guidelines in order to complete a task. In this paper, we propose the novel problem of multi-step workflow action prediction, in which the system predicts multiple future workflow actions. Accurate prediction of multiple steps allows for multi-turn automation, which can free up time to focus on more complex tasks. We propose three modeling approaches that are simple to implement yet lead to more action automation: 1) fine-tuning on a training dataset, 2) few-shot in-context learning leveraging retrieval and large language model prompting, and 3) zero-shot graph traversal, which aggregates historical action sequences into a graph for prediction. We show that multi-step action prediction produces features that improve accuracy on downstream dialogue tasks like predicting task success, and can increase automation of steps by 20% without requiring as much feedback",
    "path": "papers/23/11/2311.09593.json",
    "total_tokens": 892,
    "translated_title": "多步骤对话工作流动作预测",
    "translated_abstract": "在面向任务的对话中，系统通常需要遵循一系列动作的顺序，称为工作流，以便根据一组准则完成任务。本文提出了多步骤工作流动作预测的新问题，系统预测未来的多个工作流动作。准确预测多个步骤可以实现多轮自动化，从而能够节省时间专注于更复杂的任务。我们提出了三种简单易行且能提高动作自动化的建模方法：1）在训练数据集上进行微调，2）使用检索和大型语言模型提示进行少样本上下文学习，以及3）零样本图遍历，将历史动作序列汇总成图进行预测。我们展示了多步骤动作预测产生的特征，可以提高下游对话任务（如预测任务成功）的准确性，并可以在不需要太多反馈的情况下将步骤的自动化提高20%。",
    "tldr": "本文提出了多步骤工作流动作预测的新问题，通过准确预测多个步骤，实现对任务的多轮自动化，节省时间。提出了三种简单易行的建模方法，并展示了多步骤动作预测提高对话任务准确性和步骤自动化的特征。"
}