{
    "title": "Controllable Expensive Multi-objective Learning with Warm-starting Bayesian Optimization",
    "abstract": "Pareto Set Learning (PSL) is a promising approach for approximating the entire Pareto front in multi-objective optimization (MOO) problems. However, existing derivative-free PSL methods are often unstable and inefficient, especially for expensive black-box MOO problems where objective function evaluations are costly. In this work, we propose to address the instability and inefficiency of existing PSL methods with a novel controllable PSL method, called Co-PSL. Particularly, Co-PSL consists of two stages: (1) warm-starting Bayesian optimization to obtain quality Gaussian Processes priors and (2) controllable Pareto set learning to accurately acquire a parametric mapping from preferences to the corresponding Pareto solutions. The former is to help stabilize the PSL process and reduce the number of expensive function evaluations. The latter is to support real-time trade-off control between conflicting objectives. Performances across synthesis and real-world MOO problems showcase the effec",
    "link": "https://arxiv.org/abs/2311.15297",
    "context": "Title: Controllable Expensive Multi-objective Learning with Warm-starting Bayesian Optimization\nAbstract: Pareto Set Learning (PSL) is a promising approach for approximating the entire Pareto front in multi-objective optimization (MOO) problems. However, existing derivative-free PSL methods are often unstable and inefficient, especially for expensive black-box MOO problems where objective function evaluations are costly. In this work, we propose to address the instability and inefficiency of existing PSL methods with a novel controllable PSL method, called Co-PSL. Particularly, Co-PSL consists of two stages: (1) warm-starting Bayesian optimization to obtain quality Gaussian Processes priors and (2) controllable Pareto set learning to accurately acquire a parametric mapping from preferences to the corresponding Pareto solutions. The former is to help stabilize the PSL process and reduce the number of expensive function evaluations. The latter is to support real-time trade-off control between conflicting objectives. Performances across synthesis and real-world MOO problems showcase the effec",
    "path": "papers/23/11/2311.15297.json",
    "total_tokens": 943,
    "translated_title": "可控的高昂多目标学习与热启动贝叶斯优化",
    "translated_abstract": "Pareto Set Learning (PSL)是一种在多目标优化（MOO）问题中近似整个帕累托前沿的有希望的方法。然而，现有的无导数PSL方法通常不稳定且低效，特别是对于昂贵的黑箱MOO问题，目标函数评估成本高昂。在这项工作中，我们提出了一种新颖的可控PSL方法，称为Co-PSL，以解决现有PSL方法的不稳定性和低效性。特别地，Co-PSL包括两个阶段：(1)热启动贝叶斯优化，以获得质量高的高斯过程先验，(2)可控帕累托集学习，以准确获取从偏好到相应帕累托解的参数映射。前者有助于稳定PSL过程并减少昂贵函数评估的数量。后者支持冲突目标之间的实时权衡控制。通过合成和实际世界的MOO问题的性能展示了Co-PSL方法的有效性。",
    "tldr": "这项工作提出了一种可控的Pareto Set Learning (PSL)方法，通过热启动贝叶斯优化和可控的帕累托集学习来解决现有PSL方法不稳定和低效的问题，并在合成和实际MOO问题上展示了其有效性。",
    "en_tdlr": "This work proposes a controllable Pareto Set Learning (PSL) method, addressing the instability and inefficiency of existing PSL methods by using warm-starting Bayesian optimization and controllable Pareto set learning. The method's effectiveness is showcased through performances in synthesis and real-world multi-objective optimization problems."
}