{
    "title": "Calibration-free online test-time adaptation for electroencephalography motor imagery decoding. (arXiv:2311.18520v2 [cs.HC] UPDATED)",
    "abstract": "Providing a promising pathway to link the human brain with external devices, Brain-Computer Interfaces (BCIs) have seen notable advancements in decoding capabilities, primarily driven by increasingly sophisticated techniques, especially deep learning. However, achieving high accuracy in real-world scenarios remains a challenge due to the distribution shift between sessions and subjects. In this paper we will explore the concept of online test-time adaptation (OTTA) to continuously adapt the model in an unsupervised fashion during inference time. Our approach guarantees the preservation of privacy by eliminating the requirement to access the source data during the adaptation process. Additionally, OTTA achieves calibration-free operation by not requiring any session- or subject-specific data. We will investigate the task of electroencephalography (EEG) motor imagery decoding using a lightweight architecture together with different OTTA techniques like alignment, adaptive batch normaliza",
    "link": "http://arxiv.org/abs/2311.18520",
    "context": "Title: Calibration-free online test-time adaptation for electroencephalography motor imagery decoding. (arXiv:2311.18520v2 [cs.HC] UPDATED)\nAbstract: Providing a promising pathway to link the human brain with external devices, Brain-Computer Interfaces (BCIs) have seen notable advancements in decoding capabilities, primarily driven by increasingly sophisticated techniques, especially deep learning. However, achieving high accuracy in real-world scenarios remains a challenge due to the distribution shift between sessions and subjects. In this paper we will explore the concept of online test-time adaptation (OTTA) to continuously adapt the model in an unsupervised fashion during inference time. Our approach guarantees the preservation of privacy by eliminating the requirement to access the source data during the adaptation process. Additionally, OTTA achieves calibration-free operation by not requiring any session- or subject-specific data. We will investigate the task of electroencephalography (EEG) motor imagery decoding using a lightweight architecture together with different OTTA techniques like alignment, adaptive batch normaliza",
    "path": "papers/23/11/2311.18520.json",
    "total_tokens": 937,
    "translated_title": "无需校准的在线测试时间自适应应用于脑电运动想象解码",
    "translated_abstract": "脑-计算机接口（BCI）在解码能力方面取得了显著进展，这为将人类大脑与外部设备相连提供了一条有希望的途径，这主要得益于愈发复杂的技术，特别是深度学习。然而，在现实世界的场景中实现高准确率仍然是一个挑战，因为不同测试和受试者之间存在分布差异。在本文中，我们将探讨在线测试时间自适应（OTTA）的概念，以在推断过程中以无监督的方式持续自适应模型。我们的方法通过在自适应过程中不需要访问源数据来保证隐私的保护。此外，OTTA通过不需要任何特定于会话或受试者的数据来实现无需校准运行。我们将使用轻量级架构以及不同的OTTA技术（如对齐，自适应批量归一化）来研究脑电运动想象解码的任务。",
    "tldr": "本研究探索了在线测试时间自适应（OTTA）的概念，无需校准且保护隐私，以实现无监督的连续自适应模型运行。研究使用了脑电运动想象解码任务，并通过轻量级架构和不同的OTTA技术来提高准确率。",
    "en_tdlr": "This study explores the concept of online test-time adaptation (OTTA), which achieves unsupervised continuous model adaptation without calibration and preserves privacy. It focuses on the task of EEG motor imagery decoding and improves accuracy using a lightweight architecture and various OTTA techniques."
}