{
    "title": "Improving Lesion Segmentation in FDG-18 Whole-Body PET/CT scans using Multilabel approach: AutoPET II challenge. (arXiv:2311.01574v1 [eess.IV])",
    "abstract": "Automatic segmentation of lesions in FDG-18 Whole Body (WB) PET/CT scans using deep learning models is instrumental for determining treatment response, optimizing dosimetry, and advancing theranostic applications in oncology. However, the presence of organs with elevated radiotracer uptake, such as the liver, spleen, brain, and bladder, often leads to challenges, as these regions are often misidentified as lesions by deep learning models. To address this issue, we propose a novel approach of segmenting both organs and lesions, aiming to enhance the performance of automatic lesion segmentation methods. In this study, we assessed the effectiveness of our proposed method using the AutoPET II challenge dataset, which comprises 1014 subjects. We evaluated the impact of inclusion of additional labels and data in the segmentation performance of the model. In addition to the expert-annotated lesion labels, we introduced eight additional labels for organs, including the liver, kidneys, urinary ",
    "link": "http://arxiv.org/abs/2311.01574",
    "context": "Title: Improving Lesion Segmentation in FDG-18 Whole-Body PET/CT scans using Multilabel approach: AutoPET II challenge. (arXiv:2311.01574v1 [eess.IV])\nAbstract: Automatic segmentation of lesions in FDG-18 Whole Body (WB) PET/CT scans using deep learning models is instrumental for determining treatment response, optimizing dosimetry, and advancing theranostic applications in oncology. However, the presence of organs with elevated radiotracer uptake, such as the liver, spleen, brain, and bladder, often leads to challenges, as these regions are often misidentified as lesions by deep learning models. To address this issue, we propose a novel approach of segmenting both organs and lesions, aiming to enhance the performance of automatic lesion segmentation methods. In this study, we assessed the effectiveness of our proposed method using the AutoPET II challenge dataset, which comprises 1014 subjects. We evaluated the impact of inclusion of additional labels and data in the segmentation performance of the model. In addition to the expert-annotated lesion labels, we introduced eight additional labels for organs, including the liver, kidneys, urinary ",
    "path": "papers/23/11/2311.01574.json",
    "total_tokens": 991,
    "translated_title": "使用多标签方法改进FDG-18全身PET / CT扫描中的病变分割：AutoPET II挑战",
    "translated_abstract": "使用深度学习模型自动分割FDG-18全身PET / CT扫描中的病变对于确定治疗反应、优化剂量和推动肿瘤学中的治疗应用具有重要意义。然而，存在放射性示踪剂摄取升高的器官（如肝脏、脾脏、大脑和膀胱）常常导致挑战，因为这些区域往往被深度学习模型错误地标记为病变。为了解决这个问题，我们提出了一种新的方法，用于分割器官和病变，旨在提升自动病变分割方法的性能。在本研究中，我们使用AutoPET II挑战数据集评估了我们提出的方法的有效性，该数据集包括1014名患者。我们评估了包含额外标签和数据对模型分割性能的影响。除了专家标注的病变标签外，我们引入了八个包括肝脏、肾脏、输尿管等器官的附加标签。",
    "tldr": "本研究提出了一种新的方法来改进FDG-18全身PET / CT扫描中病变的分割效果，通过分割器官和病变，提高深度学习模型的性能。通过AutoPET II挑战数据集进行了有效性评估。"
}