{
    "title": "Structured Chemistry Reasoning with Large Language Models",
    "abstract": "Large Language Models (LLMs) excel in diverse areas, yet struggle with complex scientific reasoning, especially in the field of chemistry. Different from the simple chemistry tasks (e.g., molecule classification) addressed in previous studies, complex chemistry problems require not only vast knowledge and precise calculation, but also compositional reasoning about rich dynamic interactions of different concepts (e.g., temperature changes). Our study shows that even advanced LLMs, like GPT-4, can fail easily in different ways. Interestingly, the errors often stem not from a lack of domain knowledge within the LLMs, but rather from the absence of an effective reasoning structure that guides the LLMs to elicit the right knowledge, incorporate the knowledge in step-by-step reasoning, and iteratively refine results for further improved quality. On this basis, we introduce StructChem, a simple yet effective prompting strategy that offers the desired guidance and substantially boosts the LLMs",
    "link": "https://arxiv.org/abs/2311.09656",
    "context": "Title: Structured Chemistry Reasoning with Large Language Models\nAbstract: Large Language Models (LLMs) excel in diverse areas, yet struggle with complex scientific reasoning, especially in the field of chemistry. Different from the simple chemistry tasks (e.g., molecule classification) addressed in previous studies, complex chemistry problems require not only vast knowledge and precise calculation, but also compositional reasoning about rich dynamic interactions of different concepts (e.g., temperature changes). Our study shows that even advanced LLMs, like GPT-4, can fail easily in different ways. Interestingly, the errors often stem not from a lack of domain knowledge within the LLMs, but rather from the absence of an effective reasoning structure that guides the LLMs to elicit the right knowledge, incorporate the knowledge in step-by-step reasoning, and iteratively refine results for further improved quality. On this basis, we introduce StructChem, a simple yet effective prompting strategy that offers the desired guidance and substantially boosts the LLMs",
    "path": "papers/23/11/2311.09656.json",
    "total_tokens": 913,
    "translated_title": "大型语言模型中的结构化化学推理",
    "translated_abstract": "大型语言模型（LLMs）在各个领域表现出色，但在化学领域的复杂科学推理方面存在困难。与以往研究中涉及的简单化学任务（例如分子分类）不同，复杂的化学问题不仅需要广博的知识和精确的计算，还需要关于不同概念（例如温度变化）的丰富动态相互作用的组合推理。我们的研究表明，即使是像GPT-4这样先进的LLMs也很容易出现错误。有趣的是，这些错误通常不是由于LLMs缺乏领域知识，而是由于缺乏有效的推理结构来引导LLMs引发正确的知识，将知识融入逐步推理中，并迭代改进结果以进一步提高质量。基于此，我们引入了一种简单而有效的提示策略——结构化化学（StructChem），它提供了所需的指导，并显著提升了LLMs的性能。",
    "tldr": "该论文研究了大型语言模型在化学领域的复杂科学推理困难，发现错误通常源于缺乏有效的推理结构。基于此，引入了一种简单而有效的提示策略StructChem，大幅提升了语言模型的性能。"
}