{
    "title": "AdaCCD: Adaptive Semantic Contrasts Discovery Based Cross Lingual Adaptation for Code Clone Detection",
    "abstract": "arXiv:2311.07277v2 Announce Type: replace-cross  Abstract: Code Clone Detection, which aims to retrieve functionally similar programs from large code bases, has been attracting increasing attention. Modern software often involves a diverse range of programming languages. However, current code clone detection methods are generally limited to only a few popular programming languages due to insufficient annotated data as well as their own model design constraints. To address these issues, we present AdaCCD, a novel cross-lingual adaptation method that can detect cloned codes in a new language without annotations in that language. AdaCCD leverages language-agnostic code representations from pre-trained programming language models and propose an Adaptively Refined Contrastive Learning framework to transfer knowledge from resource-rich languages to resource-poor languages. We evaluate the cross-lingual adaptation results of AdaCCD by constructing a multilingual code clone detection benchmark",
    "link": "https://arxiv.org/abs/2311.07277",
    "context": "Title: AdaCCD: Adaptive Semantic Contrasts Discovery Based Cross Lingual Adaptation for Code Clone Detection\nAbstract: arXiv:2311.07277v2 Announce Type: replace-cross  Abstract: Code Clone Detection, which aims to retrieve functionally similar programs from large code bases, has been attracting increasing attention. Modern software often involves a diverse range of programming languages. However, current code clone detection methods are generally limited to only a few popular programming languages due to insufficient annotated data as well as their own model design constraints. To address these issues, we present AdaCCD, a novel cross-lingual adaptation method that can detect cloned codes in a new language without annotations in that language. AdaCCD leverages language-agnostic code representations from pre-trained programming language models and propose an Adaptively Refined Contrastive Learning framework to transfer knowledge from resource-rich languages to resource-poor languages. We evaluate the cross-lingual adaptation results of AdaCCD by constructing a multilingual code clone detection benchmark",
    "path": "papers/23/11/2311.07277.json",
    "total_tokens": 874,
    "translated_title": "AdaCCD:基于自适应语义对比发现的跨语言适应方法用于代码克隆检测",
    "translated_abstract": "代码克隆检测旨在从大型代码库中检索功能相似的程序，一直受到越来越多的关注。现代软件通常涉及各种编程语言。然而，由于缺乏注释数据以及自身模型设计限制，当前的代码克隆检测方法通常仅限于几种流行的编程语言。为了解决这些问题，我们提出了AdaCCD，一种新颖的跨语言适应方法，可以在不使用目标语言注释的情况下检测新语言中的克隆代码。AdaCCD利用来自预训练的编程语言模型的语言无关代码表示，并提出了一种自适应精制对比学习框架，从资源丰富的语言向资源匮乏的语言传递知识。我们通过构建多语言代码克隆检测基准来评估AdaCCD的跨语言适应结果。",
    "tldr": "AdaCCD是一种跨语言适应方法，通过自适应的对比学习框架和预训练编程语言模型提取语言无关的代码表示，实现了在没有目标语言注释的情况下检测新语言中的克隆代码。",
    "en_tdlr": "AdaCCD is a cross-lingual adaptation method that detects cloned codes in a new language without annotations by leveraging a language-agnostic code representation from pre-trained programming language models and an adaptively refined contrastive learning framework."
}