{
    "title": "Enhancing Functional Data Analysis with Sequential Neural Networks: Advantages and Comparative Study. (arXiv:2311.01875v1 [cs.LG])",
    "abstract": "Functional Data Analysis (FDA) is a statistical domain developed to handle functional data characterized by high dimensionality and complex data structures. Sequential Neural Networks (SNNs) are specialized neural networks capable of processing sequence data, a fundamental aspect of functional data. Despite their great flexibility in modeling functional data, SNNs have been inadequately employed in the FDA community. One notable advantage of SNNs is the ease of implementation, making them accessible to a broad audience beyond academia. Conversely, FDA-based methodologies present challenges, particularly for practitioners outside the field, due to their intricate complexity. In light of this, we propose utilizing SNNs in FDA applications and demonstrate their effectiveness through comparative analyses against popular FDA regression models based on numerical experiments and real-world data analysis. SNN architectures allow us to surpass the limitations of traditional FDA methods, offerin",
    "link": "http://arxiv.org/abs/2311.01875",
    "context": "Title: Enhancing Functional Data Analysis with Sequential Neural Networks: Advantages and Comparative Study. (arXiv:2311.01875v1 [cs.LG])\nAbstract: Functional Data Analysis (FDA) is a statistical domain developed to handle functional data characterized by high dimensionality and complex data structures. Sequential Neural Networks (SNNs) are specialized neural networks capable of processing sequence data, a fundamental aspect of functional data. Despite their great flexibility in modeling functional data, SNNs have been inadequately employed in the FDA community. One notable advantage of SNNs is the ease of implementation, making them accessible to a broad audience beyond academia. Conversely, FDA-based methodologies present challenges, particularly for practitioners outside the field, due to their intricate complexity. In light of this, we propose utilizing SNNs in FDA applications and demonstrate their effectiveness through comparative analyses against popular FDA regression models based on numerical experiments and real-world data analysis. SNN architectures allow us to surpass the limitations of traditional FDA methods, offerin",
    "path": "papers/23/11/2311.01875.json",
    "total_tokens": 848,
    "translated_title": "用顺序神经网络增强功能数据分析：优势和比较研究",
    "translated_abstract": "功能数据分析（FDA）是一种处理高维度和复杂数据结构特征的统计领域。顺序神经网络（SNNs）是一种特殊的神经网络，能够处理序列数据，这是功能数据的一个基本特征。尽管SNNs在建模功能数据方面非常灵活，但在FDA社区中使用不多。SNNs的一个显著优势是易于实施，可以让广大非学术界的人群能够使用。相反，基于FDA的方法在实践中存在挑战，尤其是对于非专业人士来说，因为它们过于复杂。基于这一点，我们提议在FDA应用中利用SNNs，并通过与常见FDA回归模型的比较分析和实际数据分析来证明其有效性。SNNs的架构使我们能够克服传统FDA方法的局限性，提供了更好的功能数据分析。",
    "tldr": "本论文研究了如何利用顺序神经网络（SNNs）增强功能数据分析（FDA），并通过与常见FDA回归模型的比较分析和实际数据分析证明了SNNs的有效性。",
    "en_tdlr": "This paper investigates the enhancement of Functional Data Analysis (FDA) using Sequential Neural Networks (SNNs) and demonstrates their effectiveness through comparative analyses with popular FDA regression models and real-world data analysis."
}