{
    "title": "UniRepLKNet: A Universal Perception Large-Kernel ConvNet for Audio, Video, Point Cloud, Time-Series and Image Recognition",
    "abstract": "arXiv:2311.15599v2 Announce Type: replace-cross  Abstract: Large-kernel convolutional neural networks (ConvNets) have recently received extensive research attention, but two unresolved and critical issues demand further investigation. 1) The architectures of existing large-kernel ConvNets largely follow the design principles of conventional ConvNets or transformers, while the architectural design for large-kernel ConvNets remains under-addressed. 2) As transformers have dominated multiple modalities, it remains to be investigated whether ConvNets also have a strong universal perception ability in domains beyond vision. In this paper, we contribute from two aspects. 1) We propose four architectural guidelines for designing large-kernel ConvNets, the core of which is to exploit the essential characteristics of large kernels that distinguish them from small kernels - they can see wide without going deep. Following such guidelines, our proposed large-kernel ConvNet shows leading performanc",
    "link": "https://arxiv.org/abs/2311.15599",
    "context": "Title: UniRepLKNet: A Universal Perception Large-Kernel ConvNet for Audio, Video, Point Cloud, Time-Series and Image Recognition\nAbstract: arXiv:2311.15599v2 Announce Type: replace-cross  Abstract: Large-kernel convolutional neural networks (ConvNets) have recently received extensive research attention, but two unresolved and critical issues demand further investigation. 1) The architectures of existing large-kernel ConvNets largely follow the design principles of conventional ConvNets or transformers, while the architectural design for large-kernel ConvNets remains under-addressed. 2) As transformers have dominated multiple modalities, it remains to be investigated whether ConvNets also have a strong universal perception ability in domains beyond vision. In this paper, we contribute from two aspects. 1) We propose four architectural guidelines for designing large-kernel ConvNets, the core of which is to exploit the essential characteristics of large kernels that distinguish them from small kernels - they can see wide without going deep. Following such guidelines, our proposed large-kernel ConvNet shows leading performanc",
    "path": "papers/23/11/2311.15599.json",
    "total_tokens": 867,
    "translated_title": "UniRepLKNet：一种用于音频、视频、点云、时间序列和图像识别的通用感知大卷积神经网络",
    "translated_abstract": "大卷积神经网络(ConvNets)最近受到了广泛的研究关注，但仍有两个未解决的重要问题需要进一步研究。1) 现有大卷积神经网络的架构在很大程度上遵循传统ConvNets或transformers的设计原则，而大卷积神经网络的架构设计仍未得到解决。2) 随着transformers主导了多种模态，仍需探讨ConvNets在视觉以外领域是否具有强大的通用感知能力。在本文中，我们从两个方面做出了贡献。1) 我们提出了四项用于设计大卷积神经网络的架构指南，其中的核心是利用大卷积核的基本特征，区别于小卷积核-它们可以广泛地观察而无需深入。遵循这些指南，我们提出的大卷积神经网络表现出领先的性能",
    "tldr": "提出了四项用于设计大卷积神经网络的架构指南，并展示了在多模态领域具有通用感知能力",
    "en_tdlr": "Proposed four architectural guidelines for designing large-kernel ConvNets and demonstrated strong universal perception ability in multiple modalities beyond vision."
}