{
    "title": "ChartCheck: Explainable Fact-Checking over Real-World Chart Images",
    "abstract": "arXiv:2311.07453v2 Announce Type: replace  Abstract: Whilst fact verification has attracted substantial interest in the natural language processing community, verifying misinforming statements against data visualizations such as charts has so far been overlooked. Charts are commonly used in the real-world to summarize and communicate key information, but they can also be easily misused to spread misinformation and promote certain agendas. In this paper, we introduce ChartCheck, a novel, large-scale dataset for explainable fact-checking against real-world charts, consisting of 1.7k charts and 10.5k human-written claims and explanations. We systematically evaluate ChartCheck using vision-language and chart-to-table models, and propose a baseline to the community. Finally, we study chart reasoning types and visual attributes that pose a challenge to these models",
    "link": "https://arxiv.org/abs/2311.07453",
    "context": "Title: ChartCheck: Explainable Fact-Checking over Real-World Chart Images\nAbstract: arXiv:2311.07453v2 Announce Type: replace  Abstract: Whilst fact verification has attracted substantial interest in the natural language processing community, verifying misinforming statements against data visualizations such as charts has so far been overlooked. Charts are commonly used in the real-world to summarize and communicate key information, but they can also be easily misused to spread misinformation and promote certain agendas. In this paper, we introduce ChartCheck, a novel, large-scale dataset for explainable fact-checking against real-world charts, consisting of 1.7k charts and 10.5k human-written claims and explanations. We systematically evaluate ChartCheck using vision-language and chart-to-table models, and propose a baseline to the community. Finally, we study chart reasoning types and visual attributes that pose a challenge to these models",
    "path": "papers/23/11/2311.07453.json",
    "total_tokens": 795,
    "translated_title": "ChartCheck：对真实世界图表图像进行可解释事实检查",
    "translated_abstract": "虽然事实验证在自然语言处理领域引起了广泛关注，但至今仍然疏忽了针对数据可视化（如图表）的误导性陈述进行验证。图表通常用于总结和传达关键信息，但它们也很容易被误用以传播错误信息和推广某种议程。在本文中，我们引入了ChartCheck，这是一个针对真实世界图表的可解释事实检查的新型大规模数据集，包含了1.7k张图表和10.5k人为撰写的声明和解释。我们使用视觉语言和图表到表格模型系统地评估ChartCheck，并向社区提出了一个基线。最后，我们研究了对这些模型构成挑战的图表推理类型和视觉属性。",
    "tldr": "该论文介绍了ChartCheck，这是一个用于对真实世界图表进行可解释事实检查的新型数据集，旨在解决图表被误用传播错误信息的问题，并提出了视觉语言和图表到表格模型的基线。",
    "en_tdlr": "The paper introduces ChartCheck, a novel dataset for explainable fact-checking against real-world charts, aiming to address the issue of charts being misused to spread misinformation, and proposes baseline approaches for vision-language and chart-to-table models."
}