{
    "title": "Fixed point actions from convolutional neural networks. (arXiv:2311.17816v1 [hep-lat] CROSS LISTED)",
    "abstract": "Lattice gauge-equivariant convolutional neural networks (L-CNNs) can be used to form arbitrarily shaped Wilson loops and can approximate any gauge-covariant or gauge-invariant function on the lattice. Here we use L-CNNs to describe fixed point (FP) actions which are based on renormalization group transformations. FP actions are classically perfect, i.e., they have no lattice artifacts on classical gauge-field configurations satisfying the equations of motion, and therefore possess scale invariant instanton solutions. FP actions are tree-level Symanzik-improved to all orders in the lattice spacing and can produce physical predictions with very small lattice artifacts even on coarse lattices. We find that L-CNNs are much more accurate at parametrizing the FP action compared to older approaches. They may therefore provide a way to circumvent critical slowing down and topological freezing towards the continuum limit.",
    "link": "http://arxiv.org/abs/2311.17816",
    "context": "Title: Fixed point actions from convolutional neural networks. (arXiv:2311.17816v1 [hep-lat] CROSS LISTED)\nAbstract: Lattice gauge-equivariant convolutional neural networks (L-CNNs) can be used to form arbitrarily shaped Wilson loops and can approximate any gauge-covariant or gauge-invariant function on the lattice. Here we use L-CNNs to describe fixed point (FP) actions which are based on renormalization group transformations. FP actions are classically perfect, i.e., they have no lattice artifacts on classical gauge-field configurations satisfying the equations of motion, and therefore possess scale invariant instanton solutions. FP actions are tree-level Symanzik-improved to all orders in the lattice spacing and can produce physical predictions with very small lattice artifacts even on coarse lattices. We find that L-CNNs are much more accurate at parametrizing the FP action compared to older approaches. They may therefore provide a way to circumvent critical slowing down and topological freezing towards the continuum limit.",
    "path": "papers/23/11/2311.17816.json",
    "total_tokens": 935,
    "translated_title": "从卷积神经网络中获得的固定点作用",
    "translated_abstract": "晶格规范等变卷积神经网络（L-CNN）可用于形成任意形状的Wilson环，并且可以近似晶格上的任何规范依变或规范不变函数。在这里，我们使用L-CNN来描述基于重整化群变换的固定点（FP）作用。FP作用在经典规范场满足运动方程的情况下是经典完美的，即它们没有晶格效应，并且具有尺度不变的瞬子解。FP作用在晶格间距的所有阶层中都是树级Symanzik改进的，即使在粗晶格上也能产生具有非常小晶格效应的物理预测。我们发现与较旧的方法相比，L-CNN在参数化FP作用方面更准确。因此，它们可能提供一种规避临界减速和拓扑冻结以接近连续极限的方法。",
    "tldr": "本研究使用晶格规范等变卷积神经网络（L-CNN）描述了基于重整化群变换的固定点作用（FP），这种方法更准确地参数化FP作用，可以规避临界减速和拓扑冻结问题，并在粗晶格上产生具有非常小晶格效应的物理预测。"
}