{
    "title": "Quantum Langevin Dynamics for Optimization",
    "abstract": "arXiv:2311.15587v2 Announce Type: replace-cross  Abstract: We initiate the study of utilizing Quantum Langevin Dynamics (QLD) to solve optimization problems, particularly those non-convex objective functions that present substantial obstacles for traditional gradient descent algorithms. Specifically, we examine the dynamics of a system coupled with an infinite heat bath. This interaction induces both random quantum noise and a deterministic damping effect to the system, which nudge the system towards a steady state that hovers near the global minimum of objective functions. We theoretically prove the convergence of QLD in convex landscapes, demonstrating that the average energy of the system can approach zero in the low temperature limit with an exponential decay rate correlated with the evolution time. Numerically, we first show the energy dissipation capability of QLD by retracing its origins to spontaneous emission. Furthermore, we conduct detailed discussion of the impact of each p",
    "link": "https://arxiv.org/abs/2311.15587",
    "context": "Title: Quantum Langevin Dynamics for Optimization\nAbstract: arXiv:2311.15587v2 Announce Type: replace-cross  Abstract: We initiate the study of utilizing Quantum Langevin Dynamics (QLD) to solve optimization problems, particularly those non-convex objective functions that present substantial obstacles for traditional gradient descent algorithms. Specifically, we examine the dynamics of a system coupled with an infinite heat bath. This interaction induces both random quantum noise and a deterministic damping effect to the system, which nudge the system towards a steady state that hovers near the global minimum of objective functions. We theoretically prove the convergence of QLD in convex landscapes, demonstrating that the average energy of the system can approach zero in the low temperature limit with an exponential decay rate correlated with the evolution time. Numerically, we first show the energy dissipation capability of QLD by retracing its origins to spontaneous emission. Furthermore, we conduct detailed discussion of the impact of each p",
    "path": "papers/23/11/2311.15587.json",
    "total_tokens": 841,
    "translated_title": "量子朗之万动力学用于优化",
    "translated_abstract": "我们开始研究利用量子朗之万动力学（QLD）来解决优化问题，特别是那些对传统梯度下降算法产生重大障碍的非凸目标函数。具体来说，我们研究了与无限热浴耦合的系统动力学。该相互作用既引起了随机量子噪声，又引起了对系统的确定性阻尼效应，从而将系统推向接近目标函数全局最小值的稳定状态。我们在凸景观中理论上证明了 QLD 的收敛性，证明了系统的平均能量可以在低温极限下接近零，并且具有与演化时间相关的指数衰减速率。在数值上，我们首先通过将其起源追溯到自发辐射来展示 QLD 的能量耗散能力。此外，我们对每个 p 的影响进行了详细讨论。",
    "tldr": "该研究引入了量子朗之万动力学（QLD）来解决非凸优化问题，证明了在凸景观中 QLD 的收敛性，并展示了其能量耗散能力和低温极限下指数衰减速率。",
    "en_tdlr": "This study introduces Quantum Langevin Dynamics (QLD) for solving non-convex optimization problems, proves the convergence of QLD in convex landscapes, and demonstrates its energy dissipation capability and exponential decay rate in the low temperature limit."
}