{
    "title": "Physics-Enhanced Multi-fidelity Learning for Optical Surface Imprint",
    "abstract": "arXiv:2311.10278v2 Announce Type: replace-cross  Abstract: Human fingerprints serve as one unique and powerful characteristic for each person, from which policemen can recognize the identity. Similar to humans, many natural bodies and intrinsic mechanical qualities can also be uniquely identified from surface characteristics. To measure the elasto-plastic properties of one material, one formally sharp indenter is pushed into the measured body under constant force and retracted, leaving a unique residual imprint of the minute size from several micrometers to nanometers. However, one great challenge is how to map the optical image of this residual imprint into the real wanted mechanical properties, \\ie, the tensile force curve. In this paper, we propose a novel method to use multi-fidelity neural networks (MFNN) to solve this inverse problem. We first build up the NN model via pure simulation data, and then bridge the sim-to-real gap via transfer learning. Considering the difficulty of c",
    "link": "https://arxiv.org/abs/2311.10278",
    "context": "Title: Physics-Enhanced Multi-fidelity Learning for Optical Surface Imprint\nAbstract: arXiv:2311.10278v2 Announce Type: replace-cross  Abstract: Human fingerprints serve as one unique and powerful characteristic for each person, from which policemen can recognize the identity. Similar to humans, many natural bodies and intrinsic mechanical qualities can also be uniquely identified from surface characteristics. To measure the elasto-plastic properties of one material, one formally sharp indenter is pushed into the measured body under constant force and retracted, leaving a unique residual imprint of the minute size from several micrometers to nanometers. However, one great challenge is how to map the optical image of this residual imprint into the real wanted mechanical properties, \\ie, the tensile force curve. In this paper, we propose a novel method to use multi-fidelity neural networks (MFNN) to solve this inverse problem. We first build up the NN model via pure simulation data, and then bridge the sim-to-real gap via transfer learning. Considering the difficulty of c",
    "path": "papers/23/11/2311.10278.json",
    "total_tokens": 653,
    "translated_title": "物理增强的光学表面印迹多保真学习",
    "translated_abstract": "人类指纹作为每个人的独特而强大的特征，可以帮助警察识别身份。类似地，许多自然体和内在机械特性也可以通过表面特征得到唯一识别。本文提出了一种新颖的方法，使用多保真神经网络(MFNN)解决这个反问题。",
    "tldr": "本文提出了一种利用多保真神经网络(MFNN)解决光学图像与实际机械性能之间映射的方法。",
    "en_tdlr": "This paper proposes a method to use multi-fidelity neural networks (MFNN) to map the optical image of residual imprints into the real mechanical properties."
}