{
    "title": "SmoothHess: ReLU Network Feature Interactions via Stein's Lemma. (arXiv:2311.00858v1 [cs.LG])",
    "abstract": "Several recent methods for interpretability model feature interactions by looking at the Hessian of a neural network. This poses a challenge for ReLU networks, which are piecewise-linear and thus have a zero Hessian almost everywhere. We propose SmoothHess, a method of estimating second-order interactions through Stein's Lemma. In particular, we estimate the Hessian of the network convolved with a Gaussian through an efficient sampling algorithm, requiring only network gradient calls. SmoothHess is applied post-hoc, requires no modifications to the ReLU network architecture, and the extent of smoothing can be controlled explicitly. We provide a non-asymptotic bound on the sample complexity of our estimation procedure. We validate the superior ability of SmoothHess to capture interactions on benchmark datasets and a real-world medical spirometry dataset.",
    "link": "http://arxiv.org/abs/2311.00858",
    "context": "Title: SmoothHess: ReLU Network Feature Interactions via Stein's Lemma. (arXiv:2311.00858v1 [cs.LG])\nAbstract: Several recent methods for interpretability model feature interactions by looking at the Hessian of a neural network. This poses a challenge for ReLU networks, which are piecewise-linear and thus have a zero Hessian almost everywhere. We propose SmoothHess, a method of estimating second-order interactions through Stein's Lemma. In particular, we estimate the Hessian of the network convolved with a Gaussian through an efficient sampling algorithm, requiring only network gradient calls. SmoothHess is applied post-hoc, requires no modifications to the ReLU network architecture, and the extent of smoothing can be controlled explicitly. We provide a non-asymptotic bound on the sample complexity of our estimation procedure. We validate the superior ability of SmoothHess to capture interactions on benchmark datasets and a real-world medical spirometry dataset.",
    "path": "papers/23/11/2311.00858.json",
    "total_tokens": 910,
    "translated_title": "SmoothHess: 通过Stein引理对ReLU网络的特征交互进行建模",
    "translated_abstract": "最近的一些解释性方法通过查看神经网络的Hessian矩阵来建模特征的交互作用。然而，对于ReLU网络来说，这是一个挑战，因为它们是分段线性的，在几乎所有地方都具有零的Hessian矩阵。我们提出了SmoothHess方法，通过Stein引理估计二阶交互作用。具体而言，我们通过高效的抽样算法，估计了网络和高斯卷积的Hessian矩阵，只需要网络的梯度调用。SmoothHess是后处理方法，不需要对ReLU网络架构进行修改，平滑程度可以明确控制。我们提供了对于估计过程样本复杂度的非渐进界。我们验证了SmoothHess在基准数据集和真实世界的医学肺功能数据集上捕捉交互作用的卓越能力。",
    "tldr": "SmoothHess是一种通过Stein引理对ReLU网络的特征交互进行建模的方法，它能估计网络和高斯卷积的Hessian矩阵，具有高效的抽样算法和可控的平滑程度。在基准数据集和真实世界的医学肺功能数据集上验证了SmoothHess捕捉交互作用的卓越能力。",
    "en_tdlr": "SmoothHess is a method that models feature interactions in ReLU networks using Stein's Lemma, estimating the Hessian matrix of the network convolved with a Gaussian through an efficient sampling algorithm. It requires no modifications to the ReLU network architecture and allows explicit control over the smoothing level. The superior ability of SmoothHess to capture interactions is validated on benchmark datasets and a real-world medical spirometry dataset."
}