{
    "title": "Contextualizing Internet Memes Across Social Media Platforms",
    "abstract": "arXiv:2311.11157v2 Announce Type: replace-cross  Abstract: Internet memes have emerged as a novel format for communication and expressing ideas on the web. Their fluidity and creative nature are reflected in their widespread use, often across platforms and occasionally for unethical or harmful purposes. While computational work has already analyzed their high-level virality over time and developed specialized classifiers for hate speech detection, there have been no efforts to date that aim to holistically track, identify, and map internet memes posted on social media. To bridge this gap, we investigate whether internet memes across social media platforms can be contextualized by using a semantic repository of knowledge, namely, a knowledge graph. We collect thousands of potential internet meme posts from two social media platforms, namely Reddit and Discord, and develop an extract-transform-load procedure to create a data lake with candidate meme posts. By using vision transformer-bas",
    "link": "https://arxiv.org/abs/2311.11157",
    "context": "Title: Contextualizing Internet Memes Across Social Media Platforms\nAbstract: arXiv:2311.11157v2 Announce Type: replace-cross  Abstract: Internet memes have emerged as a novel format for communication and expressing ideas on the web. Their fluidity and creative nature are reflected in their widespread use, often across platforms and occasionally for unethical or harmful purposes. While computational work has already analyzed their high-level virality over time and developed specialized classifiers for hate speech detection, there have been no efforts to date that aim to holistically track, identify, and map internet memes posted on social media. To bridge this gap, we investigate whether internet memes across social media platforms can be contextualized by using a semantic repository of knowledge, namely, a knowledge graph. We collect thousands of potential internet meme posts from two social media platforms, namely Reddit and Discord, and develop an extract-transform-load procedure to create a data lake with candidate meme posts. By using vision transformer-bas",
    "path": "papers/23/11/2311.11157.json",
    "total_tokens": 878,
    "translated_title": "在社交媒体平台中对互联网迷因进行情境化处理",
    "translated_abstract": "互联网迷因已成为网络上交流和表达观点的新颖格式。它们的流动性和创造性体现在它们被广泛使用，通常跨平台传播，偶尔也用于不道德或有害的目的。 虽然计算工作已经分析了它们随时间的高级别病毒性，并开发了专门用于检测仇恨言论的分类器，但迄今为止还没有努力旨在全面跟踪、识别和映射在社交媒体上发布的互联网迷因。 为了填补这一空白，我们调查了是否可以通过使用语义知识库，即知识图，对社交媒体平台上的互联网迷因进行情境化处理。我们从两个社交媒体平台Reddit和Discord收集了数千条潜在的互联网迷因帖子，并开发了提取-转换-加载过程，创建了一个带有候选迷因帖子的数据湖。",
    "tldr": "本研究旨在探究是否可以通过使用知识图来对社交媒体平台上的互联网迷因进行情境化处理，填补了迄今为止对互联网迷因进行全面追踪、识别和映射的空白。",
    "en_tdlr": "This study investigates the contextualization of internet memes across social media platforms using a knowledge graph, filling the gap in comprehensive tracking, identification, and mapping of internet memes to date."
}