{
    "title": "Detecting Syllable-Level Pronunciation Stress with A Self-Attention Model. (arXiv:2311.00301v1 [cs.SD])",
    "abstract": "One precondition of effective oral communication is that words should be pronounced clearly, especially for non-native speakers. Word stress is the key to clear and correct English, and misplacement of syllable stress may lead to misunderstandings. Thus, knowing the stress level is important for English speakers and learners. This paper presents a self-attention model to identify the stress level for each syllable of spoken English. Various prosodic and categorical features, including the pitch level, intensity, duration and type of the syllable and its nuclei (the vowel of the syllable), are explored. These features are input to the self-attention model, and syllable-level stresses are predicted. The simplest model yields an accuracy of over 88% and 93% on different datasets, while more advanced models provide higher accuracy. Our study suggests that the self-attention model can be promising in stress-level detection. These models could be applied to various scenarios, such as online ",
    "link": "http://arxiv.org/abs/2311.00301",
    "context": "Title: Detecting Syllable-Level Pronunciation Stress with A Self-Attention Model. (arXiv:2311.00301v1 [cs.SD])\nAbstract: One precondition of effective oral communication is that words should be pronounced clearly, especially for non-native speakers. Word stress is the key to clear and correct English, and misplacement of syllable stress may lead to misunderstandings. Thus, knowing the stress level is important for English speakers and learners. This paper presents a self-attention model to identify the stress level for each syllable of spoken English. Various prosodic and categorical features, including the pitch level, intensity, duration and type of the syllable and its nuclei (the vowel of the syllable), are explored. These features are input to the self-attention model, and syllable-level stresses are predicted. The simplest model yields an accuracy of over 88% and 93% on different datasets, while more advanced models provide higher accuracy. Our study suggests that the self-attention model can be promising in stress-level detection. These models could be applied to various scenarios, such as online ",
    "path": "papers/23/11/2311.00301.json",
    "total_tokens": 915,
    "translated_title": "使用自注意力模型检测音节级发音重音",
    "translated_abstract": "有效的口头交流的前提是单词要清晰地发音，尤其是对于非英语为母语的人来说更为重要。单词重音是清晰和正确发音的关键，音节重音的错误可能导致误解。因此，了解重音水平对于英语使用者和学习者很重要。本文提出了一个自注意力模型，用于识别英语口语每个音节的重音水平。研究探讨了各种韵律和分类特征，包括音高水平、强度、持续时间和音节及其核心元音（音节中的元音）的类型。这些特征被输入到自注意力模型中，预测音节级的重音。最简单的模型在不同数据集上的准确率超过88%和93%，而更先进的模型提供更高的准确率。我们的研究表明，自注意力模型在重音水平检测方面有着很大的潜力。这些模型可以应用于各种场景，例如在线语音教育、自动语音评估等。",
    "tldr": "本文提出了一个自注意力模型，用于检测英语音节的重音水平。通过引入各种韵律和分类特征，该模型达到了一定准确度，并展示了在不同场景下的应用潜力。"
}