{
    "title": "Mitigating Framing Bias with Polarity Minimization Loss. (arXiv:2311.01817v1 [cs.CL])",
    "abstract": "Framing bias plays a significant role in exacerbating political polarization by distorting the perception of actual events. Media outlets with divergent political stances often use polarized language in their reporting of the same event. We propose a new loss function that encourages the model to minimize the polarity difference between the polarized input articles to reduce framing bias. Specifically, our loss is designed to jointly optimize the model to map polarity ends bidirectionally. Our experimental results demonstrate that incorporating the proposed polarity minimization loss leads to a substantial reduction in framing bias when compared to a BART-based multi-document summarization model. Notably, we find that the effectiveness of this approach is most pronounced when the model is trained to minimize the polarity loss associated with informational framing bias (i.e., skewed selection of information to report).",
    "link": "http://arxiv.org/abs/2311.01817",
    "context": "Title: Mitigating Framing Bias with Polarity Minimization Loss. (arXiv:2311.01817v1 [cs.CL])\nAbstract: Framing bias plays a significant role in exacerbating political polarization by distorting the perception of actual events. Media outlets with divergent political stances often use polarized language in their reporting of the same event. We propose a new loss function that encourages the model to minimize the polarity difference between the polarized input articles to reduce framing bias. Specifically, our loss is designed to jointly optimize the model to map polarity ends bidirectionally. Our experimental results demonstrate that incorporating the proposed polarity minimization loss leads to a substantial reduction in framing bias when compared to a BART-based multi-document summarization model. Notably, we find that the effectiveness of this approach is most pronounced when the model is trained to minimize the polarity loss associated with informational framing bias (i.e., skewed selection of information to report).",
    "path": "papers/23/11/2311.01817.json",
    "total_tokens": 809,
    "translated_title": "使用极性最小化损失减轻框架偏见",
    "translated_abstract": "框架偏见通过扭曲实际事件的感知，加剧了政治极化。持有不同政治立场的媒体机构往往在报道相同事件时使用极化语言。我们提出了一种新的损失函数，鼓励模型在输入的极化文章之间减小极性差异，以减轻框架偏见。具体而言，我们的损失函数旨在同时优化模型以双向映射极性的两个极点。我们的实验结果表明，引入提出的极性最小化损失可以显著减少框架偏见，与基于BART的多文档摘要模型相比。值得注意的是，我们发现当模型被训练以最小化与信息编框偏见（即选择性报道信息）相关的极性损失时，这种方法的效果最为显著。",
    "tldr": "该论文提出了一种新的损失函数，在输入的极化文章之间减小极性差异，以减轻框架偏见。实验证明，这种方法可以显著减少框架偏见，尤其是在训练模型以最小化信息编框偏见的极性损失时。"
}