{
    "title": "Was Javert right to be suspicious? Unpacking treatment effect heterogeneity of alternative sentences on time-to-recidivism in Brazil",
    "abstract": "This paper presents new econometric tools to unpack the treatment effect heterogeneity of punishing misdemeanor offenses on time-to-recidivism. We show how one can identify, estimate, and make inferences on the distributional, quantile, and average marginal treatment effects in setups where the treatment selection is endogenous and the outcome of interest, usually a duration variable, is potentially right-censored. We explore our proposed econometric methodology to evaluate the effect of fines and community service sentences as a form of punishment on time-to-recidivism in the State of S\\~ao Paulo, Brazil, between 2010 and 2019, leveraging the as-if random assignment of judges to cases. Our results highlight substantial treatment effect heterogeneity that other tools are not meant to capture. For instance, we find that people whom most judges would punish take longer to recidivate as a consequence of the punishment, while people who would be punished only by strict judges recidivate at",
    "link": "https://arxiv.org/abs/2311.13969",
    "context": "Title: Was Javert right to be suspicious? Unpacking treatment effect heterogeneity of alternative sentences on time-to-recidivism in Brazil\nAbstract: This paper presents new econometric tools to unpack the treatment effect heterogeneity of punishing misdemeanor offenses on time-to-recidivism. We show how one can identify, estimate, and make inferences on the distributional, quantile, and average marginal treatment effects in setups where the treatment selection is endogenous and the outcome of interest, usually a duration variable, is potentially right-censored. We explore our proposed econometric methodology to evaluate the effect of fines and community service sentences as a form of punishment on time-to-recidivism in the State of S\\~ao Paulo, Brazil, between 2010 and 2019, leveraging the as-if random assignment of judges to cases. Our results highlight substantial treatment effect heterogeneity that other tools are not meant to capture. For instance, we find that people whom most judges would punish take longer to recidivate as a consequence of the punishment, while people who would be punished only by strict judges recidivate at",
    "path": "papers/23/11/2311.13969.json",
    "total_tokens": 974,
    "translated_title": "对巴西再犯时间的替代刑罚效果异质性的厘清，雅弗尔特的怀疑是否合理？",
    "translated_abstract": "本文提出了新的计量经济学工具，以解析惩罚轻罪犯对再犯时间的异质治疗效应。我们展示了如何在治疗选择是内生的情况下，对经常是在右侧截断的持续变量等感兴趣的结果进行分布、分位数和平均边际治疗效应的识别、估计和推断。利用在巴西圣保罗州2010年至2019年法官对案件的仿拟随机分配，我们探索了我们提出的计量经济学方法来评估罚款和社区服务句作为一种惩罚形式对再犯时间的影响。我们的结果突显了其他工具无法捕捉到的显著治疗效应异质性。例如，我们发现大多数法官会惩罚的人由于处罚而再犯的时间更长，而只有严厉的法官会惩罚的人再犯率较高。",
    "tldr": "本文提出了新的计量经济学工具来解析轻罪犯的刑罚对再犯时间的异质效应。研究结果发现，对于绝大多数法官会惩罚的人而言，刑罚会延长再犯时间，而只有严厉的法官才会对再犯率产生影响。"
}