{
    "title": "Video Face Re-Aging: Toward Temporally Consistent Face Re-Aging",
    "abstract": "arXiv:2311.11642v3 Announce Type: replace-cross  Abstract: Video face re-aging deals with altering the apparent age of a person to the target age in videos. This problem is challenging due to the lack of paired video datasets maintaining temporal consistency in identity and age. Most re-aging methods process each image individually without considering the temporal consistency of videos. While some existing works address the issue of temporal coherence through video facial attribute manipulation in latent space, they often fail to deliver satisfactory performance in age transformation. To tackle the issues, we propose (1) a novel synthetic video dataset that features subjects across a diverse range of age groups; (2) a baseline architecture designed to validate the effectiveness of our proposed dataset, and (3) the development of novel metrics tailored explicitly for evaluating the temporal consistency of video re-aging techniques. Our comprehensive experiments on public datasets, inclu",
    "link": "https://arxiv.org/abs/2311.11642",
    "context": "Title: Video Face Re-Aging: Toward Temporally Consistent Face Re-Aging\nAbstract: arXiv:2311.11642v3 Announce Type: replace-cross  Abstract: Video face re-aging deals with altering the apparent age of a person to the target age in videos. This problem is challenging due to the lack of paired video datasets maintaining temporal consistency in identity and age. Most re-aging methods process each image individually without considering the temporal consistency of videos. While some existing works address the issue of temporal coherence through video facial attribute manipulation in latent space, they often fail to deliver satisfactory performance in age transformation. To tackle the issues, we propose (1) a novel synthetic video dataset that features subjects across a diverse range of age groups; (2) a baseline architecture designed to validate the effectiveness of our proposed dataset, and (3) the development of novel metrics tailored explicitly for evaluating the temporal consistency of video re-aging techniques. Our comprehensive experiments on public datasets, inclu",
    "path": "papers/23/11/2311.11642.json",
    "total_tokens": 836,
    "translated_title": "视频人脸重龄化：迈向时间一致的人脸重龄化",
    "translated_abstract": "视频人脸重龄化涉及在视频中将一个人的外观年龄改变到目标年龄。这个问题很具挑战性，因为缺乏在身份和年龄上保持时间一致性的配对视频数据集。大多数重龄化方法处理每个图像时都没有考虑视频的时间一致性。虽然一些现有工作通过在潜在空间中进行视频面部属性操作来解决时间一致问题，但它们通常在年龄转换方面表现不尽人意。为了解决这些问题，我们提出了（1）一个新颖的合成视频数据集，涵盖了各种年龄组的对象；（2）一个基线架构，旨在验证我们提出的数据集的有效性；以及（3）针对评估视频重龄化技术的时间一致性而设计的新颖度量标准。我们在公共数据集上进行了全面实验，包括",
    "tldr": "该论文提出了一个新颖的合成视频数据集，设计了基线架构来验证其有效性，并开发了针对视频重龄化技术的时间一致性的新颖评估指标。",
    "en_tdlr": "This paper introduces a novel synthetic video dataset, designs a baseline architecture to validate its effectiveness, and develops novel metrics tailored for evaluating the temporal consistency of video re-aging techniques."
}