{
    "title": "Language Models (Mostly) Do Not Consider Emotion Triggers When Predicting Emotion",
    "abstract": "arXiv:2311.09602v2 Announce Type: replace  Abstract: Situations and events evoke emotions in humans, but to what extent do they inform the prediction of emotion detection models? This work investigates how well human-annotated emotion triggers correlate with features that models deemed salient in their prediction of emotions. First, we introduce a novel dataset EmoTrigger, consisting of 900 social media posts sourced from three different datasets; these were annotated by experts for emotion triggers with high agreement. Using EmoTrigger, we evaluate the ability of large language models (LLMs) to identify emotion triggers, and conduct a comparative analysis of the features considered important for these tasks between LLMs and fine-tuned models. Our analysis reveals that emotion triggers are largely not considered salient features for emotion prediction models, instead there is intricate interplay between various features and the task of emotion detection.",
    "link": "https://arxiv.org/abs/2311.09602",
    "context": "Title: Language Models (Mostly) Do Not Consider Emotion Triggers When Predicting Emotion\nAbstract: arXiv:2311.09602v2 Announce Type: replace  Abstract: Situations and events evoke emotions in humans, but to what extent do they inform the prediction of emotion detection models? This work investigates how well human-annotated emotion triggers correlate with features that models deemed salient in their prediction of emotions. First, we introduce a novel dataset EmoTrigger, consisting of 900 social media posts sourced from three different datasets; these were annotated by experts for emotion triggers with high agreement. Using EmoTrigger, we evaluate the ability of large language models (LLMs) to identify emotion triggers, and conduct a comparative analysis of the features considered important for these tasks between LLMs and fine-tuned models. Our analysis reveals that emotion triggers are largely not considered salient features for emotion prediction models, instead there is intricate interplay between various features and the task of emotion detection.",
    "path": "papers/23/11/2311.09602.json",
    "total_tokens": 856,
    "translated_title": "语言模型在预测情绪时主要不考虑情绪触发器",
    "translated_abstract": "情境和事件会引发人类的情绪，但到底它们在预测情绪检测模型时起到了多大作用？这项工作探讨了人类标注的情绪触发器与模型在预测情绪时认为重要的特征之间的相关性。首先，我们引入了一个新的数据集EmoTrigger，包括900条来源于三个不同数据集的社交媒体帖子；这些帖子由专家进行情绪触发器注释，达成高度一致。利用EmoTrigger，我们评估了大型语言模型(LLMs)识别情绪触发器的能力，并对LLMs和经过微调的模型在这些任务中认为重要的特征进行了比较分析。我们的分析揭示了情绪触发器在情绪预测模型中主要不被视为重要特征，而是各种特征之间以及情绪检测任务之间存在错综复杂的相互作用。",
    "tldr": "语言模型在预测情绪时主要不考虑情绪触发器，而是情绪触发器与各种特征和情绪检测任务之间存在错综复杂的相互作用。",
    "en_tdlr": "Language models primarily do not consider emotion triggers when predicting emotions, instead there is an intricate interplay between emotion triggers, various features, and the task of emotion detection."
}