{
    "title": "DreamSmooth: Improving Model-based Reinforcement Learning via Reward Smoothing",
    "abstract": "arXiv:2311.01450v2 Announce Type: replace-cross  Abstract: Model-based reinforcement learning (MBRL) has gained much attention for its ability to learn complex behaviors in a sample-efficient way: planning actions by generating imaginary trajectories with predicted rewards. Despite its success, we found that surprisingly, reward prediction is often a bottleneck of MBRL, especially for sparse rewards that are challenging (or even ambiguous) to predict. Motivated by the intuition that humans can learn from rough reward estimates, we propose a simple yet effective reward smoothing approach, DreamSmooth, which learns to predict a temporally-smoothed reward, instead of the exact reward at the given timestep. We empirically show that DreamSmooth achieves state-of-the-art performance on long-horizon sparse-reward tasks both in sample efficiency and final performance without losing performance on common benchmarks, such as Deepmind Control Suite and Atari benchmarks.",
    "link": "https://arxiv.org/abs/2311.01450",
    "context": "Title: DreamSmooth: Improving Model-based Reinforcement Learning via Reward Smoothing\nAbstract: arXiv:2311.01450v2 Announce Type: replace-cross  Abstract: Model-based reinforcement learning (MBRL) has gained much attention for its ability to learn complex behaviors in a sample-efficient way: planning actions by generating imaginary trajectories with predicted rewards. Despite its success, we found that surprisingly, reward prediction is often a bottleneck of MBRL, especially for sparse rewards that are challenging (or even ambiguous) to predict. Motivated by the intuition that humans can learn from rough reward estimates, we propose a simple yet effective reward smoothing approach, DreamSmooth, which learns to predict a temporally-smoothed reward, instead of the exact reward at the given timestep. We empirically show that DreamSmooth achieves state-of-the-art performance on long-horizon sparse-reward tasks both in sample efficiency and final performance without losing performance on common benchmarks, such as Deepmind Control Suite and Atari benchmarks.",
    "path": "papers/23/11/2311.01450.json",
    "total_tokens": 863,
    "translated_title": "DreamSmooth：通过奖励平滑改进基于模型的强化学习",
    "translated_abstract": "摘要: 基于模型的强化学习（MBRL）因其以节约样本的方式学习复杂行为的能力而受到广泛关注：通过生成具有预测奖励的虚拟轨迹来规划动作。尽管取得了成功，但我们发现令人惊讶的是，奖励预测通常是MBRL的瓶颈，特别是对于难以预测的稀疏奖励。受到人类从粗糙奖励估计中学习的直觉启发，我们提出了一种简单而有效的奖励平滑方法DreamSmooth，它学习预测一个在给定时间步的奖励的时间平滑版本，而不是精确奖励。我们在实证上展示DreamSmooth在长视野稀疏奖励任务上取得了最先进的性能，既在样本效率和最终性能上，又不损失在常见基准测试上的性能，如Deepmind Control Suite和Atari基准测试。",
    "tldr": "DreamSmooth通过学习预测时间平滑奖励而非精确奖励，优化了基于模型的强化学习，在稀疏奖励任务上表现出最先进的性能。"
}