{
    "title": "Scalable kernel balancing weights in a nationwide observational study of hospital profit status and heart attack outcomes. (arXiv:2311.00568v1 [stat.ME])",
    "abstract": "Weighting is a general and often-used method for statistical adjustment. Weighting has two objectives: first, to balance covariate distributions, and second, to ensure that the weights have minimal dispersion and thus produce a more stable estimator. A recent, increasingly common approach directly optimizes the weights toward these two objectives. However, this approach has not yet been feasible in large-scale datasets when investigators wish to flexibly balance general basis functions in an extended feature space. For example, many balancing approaches cannot scale to national-level health services research studies. To address this practical problem, we describe a scalable and flexible approach to weighting that integrates a basis expansion in a reproducing kernel Hilbert space with state-of-the-art convex optimization techniques. Specifically, we use the rank-restricted Nystr\\\"{o}m method to efficiently compute a kernel basis for balancing in {nearly} linear time and space, and then ",
    "link": "http://arxiv.org/abs/2311.00568",
    "context": "Title: Scalable kernel balancing weights in a nationwide observational study of hospital profit status and heart attack outcomes. (arXiv:2311.00568v1 [stat.ME])\nAbstract: Weighting is a general and often-used method for statistical adjustment. Weighting has two objectives: first, to balance covariate distributions, and second, to ensure that the weights have minimal dispersion and thus produce a more stable estimator. A recent, increasingly common approach directly optimizes the weights toward these two objectives. However, this approach has not yet been feasible in large-scale datasets when investigators wish to flexibly balance general basis functions in an extended feature space. For example, many balancing approaches cannot scale to national-level health services research studies. To address this practical problem, we describe a scalable and flexible approach to weighting that integrates a basis expansion in a reproducing kernel Hilbert space with state-of-the-art convex optimization techniques. Specifically, we use the rank-restricted Nystr\\\"{o}m method to efficiently compute a kernel basis for balancing in {nearly} linear time and space, and then ",
    "path": "papers/23/11/2311.00568.json",
    "total_tokens": 985,
    "translated_title": "可扩展的核平衡权重在全国范围内医院盈利状况和心脏病发作结果的观察性研究中的应用",
    "translated_abstract": "权重是一种常用的统计调整方法。权重具有两个目标：首先，平衡协变量分布；其次，确保权重的最小分散性，从而产生更稳定的估计结果。最近，一种越来越常见的方法直接优化权重以实现这两个目标。然而，在大规模数据集中，当研究者希望在扩展的特征空间中灵活平衡一般基函数时，这种方法尚不可行。例如，许多平衡方法无法扩展到全国级的健康服务研究。为了解决这个实际问题，我们描述了一种可扩展和灵活的权重方法，该方法将再生核希尔伯特空间中的基函数扩展与最先进的凸优化技术结合起来。具体而言，我们使用了限制秩的Nyström方法来高效地计算用于平衡的核基函数，最终实现了近线性的时间和空间复杂度。",
    "tldr": "本研究提出了一种可扩展和灵活的权重方法，在全国范围内的观察性研究中应用于医院盈利状况和心脏病发作结果。这种方法利用再生核希尔伯特空间的基函数扩展和凸优化技术，解决了在大规模数据集中平衡基函数分布的实际问题。",
    "en_tdlr": "This study proposes a scalable and flexible weighting method for a nationwide observational study on hospital profit status and heart attack outcomes. By integrating a basis expansion in a reproducing kernel Hilbert space with state-of-the-art convex optimization techniques, the approach effectively balances general basis functions in large-scale datasets."
}