{
    "title": "Impact of Investing Characteristics on Financial Performance of Individual Investors: An Exploratory Study. (arXiv:2311.00384v1 [q-fin.GN])",
    "abstract": "This exploratory study examines which investing characteristics determine success in an equity market. Based on data from 403 respondents, exploratory factor analysis results in 13 factors: middle/long time horizon, qualitative analyst, open-minded/disciplined, organized, emotional stability, na\\\"ive, growth stock, concentrated portfolio, contrarian, value stock, globalized, intrinsic value, and price-independent. Multiple linear regression of individual investors' excess return on these factors show statistically significant relationship. These results deepen our knowledge on what sort of investing characteristics are required to survive in equity markets.",
    "link": "http://arxiv.org/abs/2311.00384",
    "context": "Title: Impact of Investing Characteristics on Financial Performance of Individual Investors: An Exploratory Study. (arXiv:2311.00384v1 [q-fin.GN])\nAbstract: This exploratory study examines which investing characteristics determine success in an equity market. Based on data from 403 respondents, exploratory factor analysis results in 13 factors: middle/long time horizon, qualitative analyst, open-minded/disciplined, organized, emotional stability, na\\\"ive, growth stock, concentrated portfolio, contrarian, value stock, globalized, intrinsic value, and price-independent. Multiple linear regression of individual investors' excess return on these factors show statistically significant relationship. These results deepen our knowledge on what sort of investing characteristics are required to survive in equity markets.",
    "path": "papers/23/11/2311.00384.json",
    "total_tokens": 837,
    "translated_title": "投资特征对个体投资者财务绩效的影响：一项探索性研究",
    "translated_abstract": "本探索性研究旨在研究哪些投资特征决定了股市成功。基于403名调查对象的数据，进行探索性因子分析得出13个因子：中长期投资视角、定性分析师、思想开放/纪律性强、有组织性、情绪稳定性、天真、成长型股票、集中投资组合、逆向投资、价值型股票、全球化、内在价值和与价格无关。个体投资者的超额收益与这些因子的多元线性回归显示出显著的关系。这些结果加深了我们对在股权市场中生存所需的投资特征的理解。",
    "tldr": "本研究探讨了投资特征对个体投资者在股市中取得成功的影响。通过因子分析和回归分析，发现中长期投资视角、定性分析师、情绪稳定性等因素与个体投资者的超额收益之间存在显著关系。这些结果为我们提供了对在股权市场中取得成功所需的投资特征的更深入的了解。",
    "en_tdlr": "This study explores the impact of investing characteristics on the financial performance of individual investors in the equity market. Through factor analysis and regression analysis, it is found that factors such as the time horizon, qualitative analysis, and emotional stability have a significant relationship with the excess returns of individual investors. These findings provide deeper insights into the investing characteristics required for success in the equity market."
}