{
    "title": "Complexity of Single Loop Algorithms for Nonlinear Programming with Stochastic Objective and Constraints. (arXiv:2311.00678v1 [math.OC])",
    "abstract": "We analyze the complexity of single-loop quadratic penalty and augmented Lagrangian algorithms for solving nonconvex optimization problems with functional equality constraints. We consider three cases, in all of which the objective is stochastic and smooth, that is, an expectation over an unknown distribution that is accessed by sampling. The nature of the equality constraints differs among the three cases: deterministic and linear in the first case, deterministic, smooth and nonlinear in the second case, and stochastic, smooth and nonlinear in the third case. Variance reduction techniques are used to improve the complexity. To find a point that satisfies $\\varepsilon$-approximate first-order conditions, we require $\\widetilde{O}(\\varepsilon^{-3})$ complexity in the first case, $\\widetilde{O}(\\varepsilon^{-4})$ in the second case, and $\\widetilde{O}(\\varepsilon^{-5})$ in the third case. For the first and third cases, they are the first algorithms of \"single loop\" type (that also use $O",
    "link": "http://arxiv.org/abs/2311.00678",
    "context": "Title: Complexity of Single Loop Algorithms for Nonlinear Programming with Stochastic Objective and Constraints. (arXiv:2311.00678v1 [math.OC])\nAbstract: We analyze the complexity of single-loop quadratic penalty and augmented Lagrangian algorithms for solving nonconvex optimization problems with functional equality constraints. We consider three cases, in all of which the objective is stochastic and smooth, that is, an expectation over an unknown distribution that is accessed by sampling. The nature of the equality constraints differs among the three cases: deterministic and linear in the first case, deterministic, smooth and nonlinear in the second case, and stochastic, smooth and nonlinear in the third case. Variance reduction techniques are used to improve the complexity. To find a point that satisfies $\\varepsilon$-approximate first-order conditions, we require $\\widetilde{O}(\\varepsilon^{-3})$ complexity in the first case, $\\widetilde{O}(\\varepsilon^{-4})$ in the second case, and $\\widetilde{O}(\\varepsilon^{-5})$ in the third case. For the first and third cases, they are the first algorithms of \"single loop\" type (that also use $O",
    "path": "papers/23/11/2311.00678.json",
    "total_tokens": 1005,
    "translated_title": "非线性规划中具有随机目标和约束的单循环算法的复杂性分析",
    "translated_abstract": "我们分析了用于解决具有功能等式约束的非凸优化问题的单循环二次罚函数和增广Lagrangian算法的复杂性。我们考虑了三种情况，在所有情况下，目标函数都是随机且平滑的，即对未知分布进行采样的期望。三种情况下等式约束的性质有所不同：第一种情况下确定性和线性，第二种情况下确定性、平滑和非线性，第三种情况下随机、平滑和非线性。利用方差减小技术改善复杂性。为了找到满足ε近似一阶条件的点，我们在第一种情况下需要复杂度为$\\widetilde{O}(\\varepsilon^{-3})$，第二种情况下需要复杂度为$\\widetilde{O}(\\varepsilon^{-4})$，第三种情况下需要复杂度为$\\widetilde{O}(\\varepsilon^{-5})$。对于第一种和第三种情况，这是第一种“单循环”类型的算法（同时也使用$O$",
    "tldr": "该论文分析了解决具有随机目标和约束的非线性规划问题中单循环二次罚函数和增广Lagrangian算法的复杂性，研究了三种具有不同约束性质的情况。结果表明其中的两种情况是首个采用单循环算法并具有一定复杂度的方法。"
}