{
    "title": "Enhancing search engine precision and user experience through sentiment-based polysemy resolution. (arXiv:2311.01895v1 [cs.IR])",
    "abstract": "With the proliferation of digital content and the need for efficient information retrieval, this study's insights can be applied to various domains, including news services, e-commerce, and digital marketing, to provide users with more meaningful and tailored experiences. The study addresses the common problem of polysemy in search engines, where the same keyword may have multiple meanings. It proposes a solution to this issue by embedding a smart search function into the search engine, which can differentiate between different meanings based on sentiment. The study leverages sentiment analysis, a powerful natural language processing (NLP) technique, to classify and categorize news articles based on their emotional tone. This can provide more insightful and nuanced search results. The article reports an impressive accuracy rate of 85% for the proposed smart search function, which outperforms conventional search engines. This indicates the effectiveness of the sentiment-based approach. ",
    "link": "http://arxiv.org/abs/2311.01895",
    "context": "Title: Enhancing search engine precision and user experience through sentiment-based polysemy resolution. (arXiv:2311.01895v1 [cs.IR])\nAbstract: With the proliferation of digital content and the need for efficient information retrieval, this study's insights can be applied to various domains, including news services, e-commerce, and digital marketing, to provide users with more meaningful and tailored experiences. The study addresses the common problem of polysemy in search engines, where the same keyword may have multiple meanings. It proposes a solution to this issue by embedding a smart search function into the search engine, which can differentiate between different meanings based on sentiment. The study leverages sentiment analysis, a powerful natural language processing (NLP) technique, to classify and categorize news articles based on their emotional tone. This can provide more insightful and nuanced search results. The article reports an impressive accuracy rate of 85% for the proposed smart search function, which outperforms conventional search engines. This indicates the effectiveness of the sentiment-based approach. ",
    "path": "papers/23/11/2311.01895.json",
    "total_tokens": 845,
    "translated_title": "通过基于情感的多义词消歧提升搜索引擎的准确性和用户体验",
    "translated_abstract": "随着数字内容的激增和高效信息检索的需求，本研究的洞见可应用于包括新闻服务、电子商务和数字营销在内的各个领域，为用户提供更有意义和个性化的体验。该研究解决了搜索引擎中常见的多义性问题，即同一个关键词可能有多个意思。它通过将智能搜索功能嵌入到搜索引擎中来解决这个问题，该功能可以基于情感区分不同的含义。研究利用情感分析这一强大的自然语言处理技术，根据文章的情感倾向进行分类和归类，从而提供更有见地和细致入微的搜索结果。文章报告了85%的令人印象深刻的准确率，超越了传统的搜索引擎。这表明了基于情感的方法的有效性。",
    "tldr": "本研究提出了一个基于情感的多义词消歧解决方案，通过将智能搜索功能嵌入到搜索引擎中，利用情感分析技术对文章进行分类和归类，以提供更有意义和个性化的搜索结果。该方法的准确率达到了85%，超越了传统的搜索引擎。"
}