{
    "title": "Forecasting Volatility with Machine Learning and Rough Volatility: Example from the Crypto-Winter",
    "abstract": "arXiv:2311.04727v2 Announce Type: replace  Abstract: We extend the application and test the performance of a recently introduced volatility prediction framework encompassing LSTM and rough volatility. Our asset class of interest is cryptocurrencies, at the beginning of the \"crypto-winter\" in 2022. We first show that to forecast volatility, a universal LSTM approach trained on a pool of assets outperforms traditional models. We then consider a parsimonious parametric model based on rough volatility and Zumbach effect. We obtain similar prediction performances with only five parameters whose values are non-asset-dependent. Our findings provide further evidence on the universality of the mechanisms underlying the volatility formation process.",
    "link": "https://arxiv.org/abs/2311.04727",
    "context": "Title: Forecasting Volatility with Machine Learning and Rough Volatility: Example from the Crypto-Winter\nAbstract: arXiv:2311.04727v2 Announce Type: replace  Abstract: We extend the application and test the performance of a recently introduced volatility prediction framework encompassing LSTM and rough volatility. Our asset class of interest is cryptocurrencies, at the beginning of the \"crypto-winter\" in 2022. We first show that to forecast volatility, a universal LSTM approach trained on a pool of assets outperforms traditional models. We then consider a parsimonious parametric model based on rough volatility and Zumbach effect. We obtain similar prediction performances with only five parameters whose values are non-asset-dependent. Our findings provide further evidence on the universality of the mechanisms underlying the volatility formation process.",
    "path": "papers/23/11/2311.04727.json",
    "total_tokens": 789,
    "translated_title": "使用机器学习和粗糙波动率预测波动：来自加密寒冬的案例",
    "translated_abstract": "我们扩展了一种最近引入的波动率预测框架的应用并测试其性能，该框架包括LSTM和粗糙波动率。我们感兴趣的资产类别是加密货币，在2022年的“加密寒冬”初期。我们首先展示了，为了预测波动率，一个基于资产池训练的通用LSTM方法优于传统模型。然后，我们考虑基于粗糙波动率和Zumbach效应的简约参数模型。我们得到类似的预测表现，仅使用五个参数，其值不依赖于资产。我们的发现进一步证实了波动率形成过程背后机制的普遍性。",
    "tldr": "通过结合LSTM和粗糙波动率，我们发现波动率预测模型在加密货币领域的表现优于传统模型，同时从简约的参数模型中得到类似预测表现，进一步证明了波动率形成过程机制的普遍性。",
    "en_tdlr": "By combining LSTM and rough volatility, we found that the volatility prediction model outperforms traditional models in the cryptocurrency field, while obtaining similar prediction performance from a parsimonious parameter model, further demonstrating the universality of mechanisms behind volatility formation."
}