{
    "title": "A transductive few-shot learning approach for classification of digital histopathological slides from liver cancer",
    "abstract": "arXiv:2311.17740v2 Announce Type: replace-cross  Abstract: This paper presents a new approach for classifying 2D histopathology patches using few-shot learning. The method is designed to tackle a significant challenge in histopathology, which is the limited availability of labeled data. By applying a sliding window technique to histopathology slides, we illustrate the practical benefits of transductive learning (i.e., making joint predictions on patches) to achieve consistent and accurate classification. Our approach involves an optimization-based strategy that actively penalizes the prediction of a large number of distinct classes within each window. We conducted experiments on histopathological data to classify tissue classes in digital slides of liver cancer, specifically hepatocellular carcinoma. The initial results show the effectiveness of our method and its potential to enhance the process of automated cancer diagnosis and treatment, all while reducing the time and effort requir",
    "link": "https://arxiv.org/abs/2311.17740",
    "context": "Title: A transductive few-shot learning approach for classification of digital histopathological slides from liver cancer\nAbstract: arXiv:2311.17740v2 Announce Type: replace-cross  Abstract: This paper presents a new approach for classifying 2D histopathology patches using few-shot learning. The method is designed to tackle a significant challenge in histopathology, which is the limited availability of labeled data. By applying a sliding window technique to histopathology slides, we illustrate the practical benefits of transductive learning (i.e., making joint predictions on patches) to achieve consistent and accurate classification. Our approach involves an optimization-based strategy that actively penalizes the prediction of a large number of distinct classes within each window. We conducted experiments on histopathological data to classify tissue classes in digital slides of liver cancer, specifically hepatocellular carcinoma. The initial results show the effectiveness of our method and its potential to enhance the process of automated cancer diagnosis and treatment, all while reducing the time and effort requir",
    "path": "papers/23/11/2311.17740.json",
    "total_tokens": 883,
    "translated_title": "一种用于分类肝癌数字组织病理切片的传导式小样本学习方法",
    "translated_abstract": "本文提出了一种新的方法，使用少样本学习对2D组织病理切片进行分类。该方法旨在解决组织病理学中的一个重要挑战，即标记数据的有限可用性。通过将滑动窗口技术应用于组织病理学切片，我们展示了传导式学习（即在切片上做出联合预测）在实现一致准确分类方面的实际优势。我们的方法涉及一种基于优化的策略，积极惩罚每个窗口内预测大量不同类别。我们对组织病理学数据进行了实验，以对肝癌数字幻灯片中的组织类别进行分类，特别是肝细胞癌。初步结果显示了我们方法的有效性及其增强自动癌症诊断和治疗过程的潜力，同时减少了所需的时间和精力。",
    "tldr": "提出了一种用于肝癌数字组织病理切片分类的传导式小样本学习方法，通过滑动窗口技术和优化策略，在解决标记数据有限可用性的同时取得了一致准确分类的实际优势。",
    "en_tdlr": "Proposed a transductive few-shot learning approach for classification of digital histopathological slides from liver cancer, demonstrating practical benefits in achieving consistent and accurate classification by applying sliding window technique and optimization strategy to tackle limited availability of labeled data."
}