{
    "title": "Plot Retrieval as an Assessment of Abstract Semantic Association. (arXiv:2311.01666v1 [cs.IR])",
    "abstract": "Retrieving relevant plots from the book for a query is a critical task, which can improve the reading experience and efficiency of readers. Readers usually only give an abstract and vague description as the query based on their own understanding, summaries, or speculations of the plot, which requires the retrieval model to have a strong ability to estimate the abstract semantic associations between the query and candidate plots. However, existing information retrieval (IR) datasets cannot reflect this ability well. In this paper, we propose Plot Retrieval, a labeled dataset to train and evaluate the performance of IR models on the novel task Plot Retrieval. Text pairs in Plot Retrieval have less word overlap and more abstract semantic association, which can reflect the ability of the IR models to estimate the abstract semantic association, rather than just traditional lexical or semantic matching. Extensive experiments across various lexical retrieval, sparse retrieval, dense retrieval",
    "link": "http://arxiv.org/abs/2311.01666",
    "context": "Title: Plot Retrieval as an Assessment of Abstract Semantic Association. (arXiv:2311.01666v1 [cs.IR])\nAbstract: Retrieving relevant plots from the book for a query is a critical task, which can improve the reading experience and efficiency of readers. Readers usually only give an abstract and vague description as the query based on their own understanding, summaries, or speculations of the plot, which requires the retrieval model to have a strong ability to estimate the abstract semantic associations between the query and candidate plots. However, existing information retrieval (IR) datasets cannot reflect this ability well. In this paper, we propose Plot Retrieval, a labeled dataset to train and evaluate the performance of IR models on the novel task Plot Retrieval. Text pairs in Plot Retrieval have less word overlap and more abstract semantic association, which can reflect the ability of the IR models to estimate the abstract semantic association, rather than just traditional lexical or semantic matching. Extensive experiments across various lexical retrieval, sparse retrieval, dense retrieval",
    "path": "papers/23/11/2311.01666.json",
    "total_tokens": 904,
    "translated_title": "将情节检索作为抽象语义关联度评估的方法",
    "translated_abstract": "从书籍中检索相关情节是一项关键任务，可以提高读者的阅读体验和效率。读者通常只提供一个基于自己理解、摘要或猜测的抽象和模糊的描述作为查询，这要求检索模型具有强大的能力来估计查询和候选情节之间的抽象语义关联度。然而，现有的信息检索数据集不能很好地反映这种能力。在本文中，我们提出了一种名为情节检索的标记数据集，用于训练和评估IR模型在新任务情节检索上的性能。情节检索中的文本对具有较少的词重叠和更多的抽象语义关联度，可以反映IR模型估计抽象语义关联度的能力，而不仅仅是传统的词汇或语义匹配。通过各种词汇检索、稀疏检索和密集检索的大量实验",
    "tldr": "本研究提出了一个名为情节检索的新任务，通过生成一个标记数据集来训练和评估信息检索模型在此任务上的性能。这个任务要求模型能够准确估计查询和候选情节之间的抽象语义关联度，而不仅仅是依赖于词汇或语义匹配。",
    "en_tdlr": "This study introduces a novel task called Plot Retrieval and proposes a labeled dataset to train and evaluate information retrieval models on this task. The task requires models to accurately estimate the abstract semantic association between a query and candidate plots, beyond relying on lexical or semantic matching."
}