{
    "title": "A Quantitative Autonomy Quantification Framework for Fully Autonomous Robotic Systems. (arXiv:2311.01939v1 [cs.RO])",
    "abstract": "Although autonomous functioning facilitates deployment of robotic systems in domains that admit limited human oversight on our planet and beyond, finding correspondence between task requirements and autonomous capability is still an open challenge. Consequently, a number of methods for quantifying autonomy have been proposed over the last three decades, but to our knowledge all these have no discernment of sub-mode features of variation of autonomy and some are based on metrics that violet the Goodhart's law. This paper focuses on the full autonomous mode and proposes a task-requirements based autonomy assessment framework. The framework starts by establishing robot task characteristics from which three autonomy metrics, namely requisite capability, reliability and responsiveness, and functions for determining autonomy as a two-part measure, namely of level of autonomy and degree of autonomy are derived. These characteristics are founded on the realization that robots ultimately replac",
    "link": "http://arxiv.org/abs/2311.01939",
    "context": "Title: A Quantitative Autonomy Quantification Framework for Fully Autonomous Robotic Systems. (arXiv:2311.01939v1 [cs.RO])\nAbstract: Although autonomous functioning facilitates deployment of robotic systems in domains that admit limited human oversight on our planet and beyond, finding correspondence between task requirements and autonomous capability is still an open challenge. Consequently, a number of methods for quantifying autonomy have been proposed over the last three decades, but to our knowledge all these have no discernment of sub-mode features of variation of autonomy and some are based on metrics that violet the Goodhart's law. This paper focuses on the full autonomous mode and proposes a task-requirements based autonomy assessment framework. The framework starts by establishing robot task characteristics from which three autonomy metrics, namely requisite capability, reliability and responsiveness, and functions for determining autonomy as a two-part measure, namely of level of autonomy and degree of autonomy are derived. These characteristics are founded on the realization that robots ultimately replac",
    "path": "papers/23/11/2311.01939.json",
    "total_tokens": 834,
    "translated_title": "自主机器人系统的量化自主度评价框架",
    "translated_abstract": "尽管自主功能促进了机器人系统在有限人类监督的领域及更远处的部署，但在任务需求和自主能力之间找到对应关系仍然是一个开放的挑战。因此，在过去三十年中提出了许多量化自主度的方法，但据我们所知，所有这些方法都没有辨别自主度变化的子模式特征，并且一些方法基于违反Goodhart定律的度量标准。本文侧重于完全自主模式，并提出了一个基于任务需求的自主度评估框架。该框架通过确定机器人任务特性，推导出三个自主度度量标准，即所需能力、可靠性和响应性，并通过确定自主度水平和自主度程度的函数，将自主度作为两部分度量来衡量。这些特性基于机器人最终取代人类的观念。",
    "tldr": "本文提出了一个基于任务需求的自主度评估框架，主要关注完全自主模式，通过确定机器人任务特性，推导出自主度的三个度量标准，并将自主度分为自主度水平和自主度程度两部分。",
    "en_tdlr": "This paper proposes a task-requirements based autonomy assessment framework, focusing on the full autonomous mode. It derives three autonomy metrics and divides autonomy into levels and degrees based on robot task characteristics."
}