{
    "title": "An Interventional Perspective on Identifiability in Gaussian LTI Systems with Independent Component Analysis",
    "abstract": "arXiv:2311.18048v2 Announce Type: replace  Abstract: We investigate the relationship between system identification and intervention design in dynamical systems. While previous research demonstrated how identifiable representation learning methods, such as Independent Component Analysis (ICA), can reveal cause-effect relationships, it relied on a passive perspective without considering how to collect data. Our work shows that in Gaussian Linear Time-Invariant (LTI) systems, the system parameters can be identified by introducing diverse intervention signals in a multi-environment setting. By harnessing appropriate diversity assumptions motivated by the ICA literature, our findings connect experiment design and representational identifiability in dynamical systems. We corroborate our findings on synthetic and (simulated) physical data. Additionally, we show that Hidden Markov Models, in general, and (Gaussian) LTI systems, in particular, fulfil a generalization of the Causal de Finetti th",
    "link": "https://arxiv.org/abs/2311.18048",
    "context": "Title: An Interventional Perspective on Identifiability in Gaussian LTI Systems with Independent Component Analysis\nAbstract: arXiv:2311.18048v2 Announce Type: replace  Abstract: We investigate the relationship between system identification and intervention design in dynamical systems. While previous research demonstrated how identifiable representation learning methods, such as Independent Component Analysis (ICA), can reveal cause-effect relationships, it relied on a passive perspective without considering how to collect data. Our work shows that in Gaussian Linear Time-Invariant (LTI) systems, the system parameters can be identified by introducing diverse intervention signals in a multi-environment setting. By harnessing appropriate diversity assumptions motivated by the ICA literature, our findings connect experiment design and representational identifiability in dynamical systems. We corroborate our findings on synthetic and (simulated) physical data. Additionally, we show that Hidden Markov Models, in general, and (Gaussian) LTI systems, in particular, fulfil a generalization of the Causal de Finetti th",
    "path": "papers/23/11/2311.18048.json",
    "total_tokens": 828,
    "translated_title": "高斯LTI系统中干预视角下的可识别性与独立成分分析",
    "translated_abstract": "我们研究了动态系统中系统识别和干预设计之间的关系。以前的研究表明，诸如独立成分分析（ICA）的可识别表示学习方法可以揭示因果关系，但它们依赖于一种被动的视角，没有考虑如何收集数据。我们的工作表明，在高斯线性时不变（LTI）系统中，通过在多环境设置中引入各种干预信号，可以识别系统参数。通过利用ICA文献激发的适当多样性假设，我们的发现将实验设计与动态系统中的表示识别能力联系起来。我们在合成和（模拟）物理数据上证实了我们的发现。此外，我们还展示了隐马尔可夫模型（HMM）总体上以及（高斯）LTI系统特别满足Causal de Finetti 的一般化。",
    "tldr": "本研究通过在高斯LTI系统中引入各种干预信号，连接了实验设计和动态系统中的表示可识别性，为系统参数的识别提供了新的方法。",
    "en_tdlr": "This study connects experiment design and representational identifiability in dynamical systems by introducing diverse intervention signals in Gaussian LTI systems, providing a new method for identifying system parameters."
}