{
    "title": "SkateboardAI: The Coolest Video Action Recognition for Skateboarding. (arXiv:2311.11467v2 [cs.CV] UPDATED)",
    "abstract": "Impressed by the coolest skateboarding sports program from 2021 Tokyo Olympic Games, we are the first to curate the original real-world video datasets \"SkateboardAI\" in the wild, even self-design and implement diverse uni-modal and multi-modal video action recognition approaches to recognize different tricks accurately. For uni-modal methods, we separately apply (1) CNN and LSTM; (2) CNN and BiLSTM; (3) CNN and BiLSTM with effective attention mechanisms; (4) Transformer-based action recognition pipeline. Transferred to the multi-modal conditions, we investigated the two-stream Inflated-3D architecture on \"SkateboardAI\" datasets to compare its performance with uni-modal cases. In sum, our objective is developing an excellent AI sport referee for the coolest skateboarding competitions.",
    "link": "http://arxiv.org/abs/2311.11467",
    "context": "Title: SkateboardAI: The Coolest Video Action Recognition for Skateboarding. (arXiv:2311.11467v2 [cs.CV] UPDATED)\nAbstract: Impressed by the coolest skateboarding sports program from 2021 Tokyo Olympic Games, we are the first to curate the original real-world video datasets \"SkateboardAI\" in the wild, even self-design and implement diverse uni-modal and multi-modal video action recognition approaches to recognize different tricks accurately. For uni-modal methods, we separately apply (1) CNN and LSTM; (2) CNN and BiLSTM; (3) CNN and BiLSTM with effective attention mechanisms; (4) Transformer-based action recognition pipeline. Transferred to the multi-modal conditions, we investigated the two-stream Inflated-3D architecture on \"SkateboardAI\" datasets to compare its performance with uni-modal cases. In sum, our objective is developing an excellent AI sport referee for the coolest skateboarding competitions.",
    "path": "papers/23/11/2311.11467.json",
    "total_tokens": 823,
    "translated_title": "SkateboardAI：最酷的滑板视频动作识别",
    "translated_abstract": "受2021年东京奥运会最酷的滑板运动节目的启发，我们首次策划了原始的现实世界视频数据集“SkateboardAI”，并且自行设计和实现了不同单模态和多模态视频动作识别方法，以准确识别不同的技巧。对于单模态方法，我们分别应用了（1）CNN和LSTM；（2）CNN和BiLSTM；（3）带有效注意机制的CNN和BiLSTM；（4）基于Transformer的动作识别流程。转移到多模态条件下，我们调查了在“SkateboardAI”数据集上使用双流Inflated-3D架构，并将其与单模态情况进行了比较。总之，我们的目标是为最酷的滑板比赛开发出一款优秀的AI体育裁判。",
    "tldr": "我们提出了SkateboardAI，这是一个用于最酷的滑板视频动作识别的数据集。我们设计了多种单模态和多模态的识别方法，并比较了它们的性能。这个研究的目标是开发一个优秀的AI体育裁判。",
    "en_tdlr": "We propose SkateboardAI, a dataset for the coolest skateboard video action recognition. We design various uni-modal and multi-modal recognition approaches and compare their performance. The objective of this research is to develop an excellent AI sport referee."
}