{
    "title": "Architecture of Smart Certificates for Web3 Applications Against Cyberthreats in Financial Industry. (arXiv:2311.01956v1 [cs.CR])",
    "abstract": "This study addresses the security challenges associated with the current internet transformations, specifically focusing on emerging technologies such as blockchain and decentralized storage. It also investigates the role of Web3 applications in shaping the future of the internet. The primary objective is to propose a novel design for 'smart certificates,' which are digital certificates that can be programmatically enforced. Utilizing such certificates, an enterprise can better protect itself from cyberattacks and ensure the security of its data and systems. Web3 recent security solutions by companies and projects like Certik, Forta, Slither, and Securify are the equivalent of code scanning tool that were originally developed for Web1 and Web2 applications, and definitely not like certificates to help enterprises feel safe against cyberthreats. We aim to improve the resilience of enterprises' digital infrastructure by building on top of Web3 application and put methodologies in place f",
    "link": "http://arxiv.org/abs/2311.01956",
    "context": "Title: Architecture of Smart Certificates for Web3 Applications Against Cyberthreats in Financial Industry. (arXiv:2311.01956v1 [cs.CR])\nAbstract: This study addresses the security challenges associated with the current internet transformations, specifically focusing on emerging technologies such as blockchain and decentralized storage. It also investigates the role of Web3 applications in shaping the future of the internet. The primary objective is to propose a novel design for 'smart certificates,' which are digital certificates that can be programmatically enforced. Utilizing such certificates, an enterprise can better protect itself from cyberattacks and ensure the security of its data and systems. Web3 recent security solutions by companies and projects like Certik, Forta, Slither, and Securify are the equivalent of code scanning tool that were originally developed for Web1 and Web2 applications, and definitely not like certificates to help enterprises feel safe against cyberthreats. We aim to improve the resilience of enterprises' digital infrastructure by building on top of Web3 application and put methodologies in place f",
    "path": "papers/23/11/2311.01956.json",
    "total_tokens": 886,
    "translated_title": "针对金融行业网络威胁的智能证书Web3应用架构研究",
    "translated_abstract": "本研究探讨了与当前互联网变革相关的安全挑战，特别关注区块链和分布式存储等新兴技术。它还研究了Web3应用在塑造互联网未来方面的作用。主要目标是提出一种新颖的“智能证书”设计，这些数字证书可以以程序化的方式执行。利用这些证书，企业可以更好地保护自己免受网络攻击，并确保其数据和系统的安全。近期Web3应用的安全解决方案，如Certik、Forta、Slither和Securify企业和项目的相当于最初为Web1和Web2应用程序开发的代码扫描工具，绝非像证书一样能帮助企业抵御网络威胁。我们旨在通过在Web3应用程序的基础上建立并采用一套方法来提高企业数字基础设施的韧性。",
    "tldr": "本研究提出了一种新颖的“智能证书”设计，以应对金融行业面临的网络威胁。通过利用这些证书，企业可以以程序化的方式保护自己免受网络攻击，并确保其数据和系统的安全。",
    "en_tdlr": "This study proposes a novel design for 'smart certificates' to address cyberthreats in the financial industry. By utilizing these certificates, enterprises can programmatically protect themselves from cyberattacks and ensure the security of their data and systems."
}