{
    "title": "Bank Performance Determinants: State of the Art and Future Research Avenues. (arXiv:2311.08617v2 [q-fin.GN] UPDATED)",
    "abstract": "Banks' performance is an important topic for both professionals and researchers. Given the important literature on this subject, this paper aims to bring an up-to-date and organized review of literature on the determinants of banks performance. This paper discusses the main approaches that molded the debate on banks performance and their main determinants. An in-depth understanding of these latter may allow on the one hand, bank managers and regulators to improve the sector efficiency and to deal with the new trends shaping the future of their industry and on the other hand, academicians to enrich research and knowledge on this field. Through the analysis of 54 studies published in 42 peer-reviewed journals, we show that despite the importance of the existent literature, the subject of bank performance factors did not reveal all its secrets and still constitute a fertile field for critical debates, especially since the COVID-19 and the increasingly pressing rise in power of digital tra",
    "link": "http://arxiv.org/abs/2311.08617",
    "context": "Title: Bank Performance Determinants: State of the Art and Future Research Avenues. (arXiv:2311.08617v2 [q-fin.GN] UPDATED)\nAbstract: Banks' performance is an important topic for both professionals and researchers. Given the important literature on this subject, this paper aims to bring an up-to-date and organized review of literature on the determinants of banks performance. This paper discusses the main approaches that molded the debate on banks performance and their main determinants. An in-depth understanding of these latter may allow on the one hand, bank managers and regulators to improve the sector efficiency and to deal with the new trends shaping the future of their industry and on the other hand, academicians to enrich research and knowledge on this field. Through the analysis of 54 studies published in 42 peer-reviewed journals, we show that despite the importance of the existent literature, the subject of bank performance factors did not reveal all its secrets and still constitute a fertile field for critical debates, especially since the COVID-19 and the increasingly pressing rise in power of digital tra",
    "path": "papers/23/11/2311.08617.json",
    "total_tokens": 958,
    "translated_title": "银行绩效决定因素：现状与未来研究途径",
    "translated_abstract": "银行的绩效对于专业人士和研究人员来说是一个重要的主题。鉴于这个课题的重要文献，本文旨在提供一份最新和有组织的关于银行绩效决定因素的文献综述。本文讨论了塑造银行绩效讨论及其决定因素的主要方法。对这些决定因素的深入理解可以一方面帮助银行经理和监管机构提高行业效率，并应对塑造行业未来的新趋势；另一方面，可以帮助学者丰富研究和知识领域。通过对42个同行评审期刊上发表的54个研究进行分析，我们发现尽管现有文献的重要性，关于银行绩效因素的研究仍然没有揭示出所有的秘密，仍然是一个富有争议的研究领域，特别是考虑到COVID-19以及数字化转型力度的不断增加。",
    "tldr": "本文提供了一个关于银行绩效决定因素的最新综述，鉴于现有文献的重要性，对于银行经理、监管机构和学者来说，对这些决定因素的深入理解仍然具有重要意义，尤其是在COVID-19和数字化转型带来的新变化背景下。",
    "en_tdlr": "This paper provides an up-to-date review of the determinants of bank performance. Despite the existing literature, a thorough understanding of these factors remains important for bank managers, regulators, and scholars, especially in the context of COVID-19 and digital transformation."
}