{
    "title": "Detection of developmental language disorder in Cypriot Greek children using a neural network algorithm",
    "abstract": "Children with developmental language disorder (DLD) encounter difficulties in acquiring various language structures. Early identification and intervention are crucial to prevent negative long-term outcomes impacting the academic, social, and emotional development of children. The study aims to develop an automated method for the identification of DLD using artificial intelligence, specifically a neural network machine learning algorithm. This protocol is applied for the first time in a Cypriot Greek child population with DLD. The neural network model was trained using perceptual and production data elicited from 15 children with DLD and 15 healthy controls in the age range of 7;10 until 10;4. The k-fold technique was used to crossvalidate the algorithm. The performance of the model was evaluated using metrics such as accuracy, precision, recall, F1 score, and ROC/AUC curve to assess its ability to make accurate predictions on a set of unseen data. The results demonstrated high classifi",
    "link": "https://arxiv.org/abs/2311.15054",
    "context": "Title: Detection of developmental language disorder in Cypriot Greek children using a neural network algorithm\nAbstract: Children with developmental language disorder (DLD) encounter difficulties in acquiring various language structures. Early identification and intervention are crucial to prevent negative long-term outcomes impacting the academic, social, and emotional development of children. The study aims to develop an automated method for the identification of DLD using artificial intelligence, specifically a neural network machine learning algorithm. This protocol is applied for the first time in a Cypriot Greek child population with DLD. The neural network model was trained using perceptual and production data elicited from 15 children with DLD and 15 healthy controls in the age range of 7;10 until 10;4. The k-fold technique was used to crossvalidate the algorithm. The performance of the model was evaluated using metrics such as accuracy, precision, recall, F1 score, and ROC/AUC curve to assess its ability to make accurate predictions on a set of unseen data. The results demonstrated high classifi",
    "path": "papers/23/11/2311.15054.json",
    "total_tokens": 923,
    "translated_title": "使用神经网络算法检测塞浦路斯希腊儿童的发展性语言障碍",
    "translated_abstract": "发展性语言障碍（DLD）的儿童在吸收各种语言结构方面遇到困难。早期识别和干预对于防止对儿童的学术、社交和情感发展产生长期负面影响至关重要。该研究旨在开发一种使用人工智能、特别是神经网络机器学习算法的自动化检测DLD的方法。该方案首次在塞浦路斯希腊儿童DLD人群中应用。神经网络模型使用从15名DLD患儿和15名健康对照组中收集的感知和产出数据进行训练，年龄范围为7岁10个月至10岁4个月。采用k-fold技术对算法进行交叉验证。使用准确率、精确度、召回率、F1分数和ROC/AUC曲线等指标评估模型的性能，以评估其在一组未知数据上进行准确预测的能力。结果表明高分类效果。",
    "tldr": "该研究开发了一种使用神经网络算法进行发展性语言障碍（DLD）检测的自动化方法，并首次应用于塞浦路斯希腊儿童DLD人群。实验结果表明该方法具有高的分类效果。"
}