{
    "title": "Hybrid quantum image classification and federated learning for hepatic steatosis diagnosis",
    "abstract": "arXiv:2311.02402v2 Announce Type: replace  Abstract: In the realm of liver transplantation, accurately determining hepatic steatosis levels is crucial. Recognizing the essential need for improved diagnostic precision, particularly for optimizing diagnosis time by swiftly handling easy-to-solve cases and allowing the expert time to focus on more complex cases, this study aims to develop cutting-edge algorithms that enhance the classification of liver biopsy images. Additionally, the challenge of maintaining data privacy arises when creating automated algorithmic solutions, as sharing patient data between hospitals is restricted, further complicating the development and validation process. This research tackles diagnostic accuracy by leveraging novel techniques from the rapidly evolving field of quantum machine learning, known for their superior generalization abilities. Concurrently, it addresses privacy concerns through the implementation of privacy-conscious collaborative machine lear",
    "link": "https://arxiv.org/abs/2311.02402",
    "context": "Title: Hybrid quantum image classification and federated learning for hepatic steatosis diagnosis\nAbstract: arXiv:2311.02402v2 Announce Type: replace  Abstract: In the realm of liver transplantation, accurately determining hepatic steatosis levels is crucial. Recognizing the essential need for improved diagnostic precision, particularly for optimizing diagnosis time by swiftly handling easy-to-solve cases and allowing the expert time to focus on more complex cases, this study aims to develop cutting-edge algorithms that enhance the classification of liver biopsy images. Additionally, the challenge of maintaining data privacy arises when creating automated algorithmic solutions, as sharing patient data between hospitals is restricted, further complicating the development and validation process. This research tackles diagnostic accuracy by leveraging novel techniques from the rapidly evolving field of quantum machine learning, known for their superior generalization abilities. Concurrently, it addresses privacy concerns through the implementation of privacy-conscious collaborative machine lear",
    "path": "papers/23/11/2311.02402.json",
    "total_tokens": 825,
    "translated_title": "混合量子图像分类和联邦学习用于肝脂肪变性诊断",
    "translated_abstract": "在肝移植领域中，准确确定肝脂肪变性水平至关重要。为了提高诊断精度，特别是通过迅速处理易于解决的病例，让专家有更多时间关注复杂病例，本研究旨在开发优化肝活检图像分类的尖端算法。此外，当创建自动化算法解决方案时，保护数据隐私变成了一个挑战，因为医院之间共享患者数据受到限制，进一步复杂化了开发和验证过程。本研究借助于从快速发展的量子机器学习领域引入的新技术来提高诊断准确性，这些技术以其优越的泛化能力而闻名。同时，通过实施隐私意识协作机器学习，还解决了隐私问题。",
    "tldr": "该研究旨在开发一种混合量子图像分类和联邦学习算法，以提高肝脂肪变性的诊断准确性，同时解决因数据隐私问题带来的挑战。"
}