{
    "title": "New Online Communities: Graph Deep Learning on Anonymous Voting Networks to Identify Sybils in Polycentric Governance. (arXiv:2311.17929v4 [cs.LG] UPDATED)",
    "abstract": "This research examines the polycentric governance of digital assets in blockchain-based Decentralized Autonomous Organizations (DAOs). It offers a theoretical framework and addresses a critical challenge facing decentralized governance by developing a method to identify sybils, or spurious identities. The method uses graph deep learning techniques to identify sybil activity in a DAO governance dataset (snapshot.org). Specifically, a Graph Convolutional Neural Network (GCNN) learned voting behaviours and a fast k-means vector clustering algorithm (FAISS) used the high dimensional embeddings to identify similar nodes in a graph. The results reveal that deep learning can effectively identify sybils, reducing the voting graph by 2-5%. This research underscores the importance of sybil resistance in DAOs and offers a novel perspective on decentralized governance, informing future policy, regulation, and governance practices.",
    "link": "http://arxiv.org/abs/2311.17929",
    "context": "Title: New Online Communities: Graph Deep Learning on Anonymous Voting Networks to Identify Sybils in Polycentric Governance. (arXiv:2311.17929v4 [cs.LG] UPDATED)\nAbstract: This research examines the polycentric governance of digital assets in blockchain-based Decentralized Autonomous Organizations (DAOs). It offers a theoretical framework and addresses a critical challenge facing decentralized governance by developing a method to identify sybils, or spurious identities. The method uses graph deep learning techniques to identify sybil activity in a DAO governance dataset (snapshot.org). Specifically, a Graph Convolutional Neural Network (GCNN) learned voting behaviours and a fast k-means vector clustering algorithm (FAISS) used the high dimensional embeddings to identify similar nodes in a graph. The results reveal that deep learning can effectively identify sybils, reducing the voting graph by 2-5%. This research underscores the importance of sybil resistance in DAOs and offers a novel perspective on decentralized governance, informing future policy, regulation, and governance practices.",
    "path": "papers/23/11/2311.17929.json",
    "total_tokens": 881,
    "translated_title": "新的在线社区：在匿名投票网络上进行图深度学习以识别多中心治理中的虚假身份",
    "translated_abstract": "本研究探讨了基于区块链的去中心化自治组织（DAO）中数字资产的多中心治理。它提供了一个理论框架，并通过开发一种方法来识别虚假身份（sybils）来解决分散治理面临的一个关键挑战。该方法使用图深度学习技术在DAO治理数据集（snapshot.org）中识别虚假身份的活动。具体地，一个图卷积神经网络（GCNN）学习了投票行为，并使用高维嵌入来识别图中相似节点的快速k均值向量聚类算法（FAISS）。结果显示，深度学习能够有效识别虚假身份，在投票图中减少2-5%。本研究强调了在DAO中的sybil抗性的重要性，并为分散治理提供了新的视角，对未来的政策、监管和治理实践具有启示作用。",
    "tldr": "本研究提供了一个理论框架，通过使用图深度学习技术，可以有效识别去中心化自治组织（DAO）中的虚假身份，为分散治理提供了新的视角。",
    "en_tdlr": "This research offers a theoretical framework and presents a method using graph deep learning techniques to effectively identify false identities in Decentralized Autonomous Organizations (DAOs), providing a new perspective on decentralized governance."
}