{
    "title": "APRICOT: Acuity Prediction in Intensive Care Unit (ICU): Predicting Stability, Transitions, and Life-Sustaining Therapies. (arXiv:2311.02026v1 [cs.AI])",
    "abstract": "The acuity state of patients in the intensive care unit (ICU) can quickly change from stable to unstable, sometimes leading to life-threatening conditions. Early detection of deteriorating conditions can result in providing more timely interventions and improved survival rates. Current approaches rely on manual daily assessments. Some data-driven approaches have been developed, that use mortality as a proxy of acuity in the ICU. However, these methods do not integrate acuity states to determine the stability of a patient or the need for life-sustaining therapies. In this study, we propose APRICOT (Acuity Prediction in Intensive Care Unit), a Transformer-based neural network to predict acuity state in real-time in ICU patients. We develop and extensively validate externally, temporally, and prospectively the APRICOT model on three large datasets: University of Florida Health (UFH), eICU Collaborative Research Database (eICU), and Medical Information Mart for Intensive Care (MIMIC)-IV. T",
    "link": "http://arxiv.org/abs/2311.02026",
    "context": "Title: APRICOT: Acuity Prediction in Intensive Care Unit (ICU): Predicting Stability, Transitions, and Life-Sustaining Therapies. (arXiv:2311.02026v1 [cs.AI])\nAbstract: The acuity state of patients in the intensive care unit (ICU) can quickly change from stable to unstable, sometimes leading to life-threatening conditions. Early detection of deteriorating conditions can result in providing more timely interventions and improved survival rates. Current approaches rely on manual daily assessments. Some data-driven approaches have been developed, that use mortality as a proxy of acuity in the ICU. However, these methods do not integrate acuity states to determine the stability of a patient or the need for life-sustaining therapies. In this study, we propose APRICOT (Acuity Prediction in Intensive Care Unit), a Transformer-based neural network to predict acuity state in real-time in ICU patients. We develop and extensively validate externally, temporally, and prospectively the APRICOT model on three large datasets: University of Florida Health (UFH), eICU Collaborative Research Database (eICU), and Medical Information Mart for Intensive Care (MIMIC)-IV. T",
    "path": "papers/23/11/2311.02026.json",
    "total_tokens": 943,
    "translated_title": "APRICOT: 重症监护病房(ICU)中的敏感度预测：预测稳定性、转变和维持生命的治疗",
    "translated_abstract": "ICU中的患者严重程度状态可能会在稳定和不稳定之间迅速变化，有时会导致危及生命的情况。早期检测到恶化可能会导致更及时的干预和更好的生存率。目前的方法依赖于手动的每日评估。已经开发了一些数据驱动的方法，使用死亡率作为ICU中敏感度的代理。然而，这些方法并未整合敏感度状态以确定患者的稳定性或对维持生命治疗的需求。在本研究中，我们提出了APRICOT（重症监护病房中的敏感度预测），一种基于Transformer的神经网络，用于实时预测ICU患者的敏感度状态。我们在三个大型数据集上外部、时间上和前瞻性地开发和广泛验证了APRICOT模型：佛罗里达大学健康中心（UFH）、eICU合作研究数据库（eICU）和重症监护医疗信息市场（MIMIC）-IV。",
    "tldr": "APRICOT是一种基于Transformer的神经网络，用于在ICU患者中实时预测敏感度状态，并在多个数据集上进行了广泛验证。",
    "en_tdlr": "APRICOT is a Transformer-based neural network that predicts the acuity state in ICU patients in real-time, and has been extensively validated on multiple datasets."
}