{
    "title": "MineSegSAT: An automated system to evaluate mining disturbed area extents from Sentinel-2 imagery. (arXiv:2311.01676v1 [cs.CV])",
    "abstract": "Assessing the environmental impact of the mineral extraction industry plays a critical role in understanding and mitigating the ecological consequences of extractive activities. This paper presents MineSegSAT, a model that presents a novel approach to predicting environmentally impacted areas of mineral extraction sites using the SegFormer deep learning segmentation architecture trained on Sentinel-2 data. The data was collected from non-overlapping regions over Western Canada in 2021 containing areas of land that have been environmentally impacted by mining activities that were identified from high-resolution satellite imagery in 2021. The SegFormer architecture, a state-of-the-art semantic segmentation framework, is employed to leverage its advanced spatial understanding capabilities for accurate land cover classification. We investigate the efficacy of loss functions including Dice, Tversky, and Lovasz loss respectively. The trained model was utilized for inference over the test reg",
    "link": "http://arxiv.org/abs/2311.01676",
    "context": "Title: MineSegSAT: An automated system to evaluate mining disturbed area extents from Sentinel-2 imagery. (arXiv:2311.01676v1 [cs.CV])\nAbstract: Assessing the environmental impact of the mineral extraction industry plays a critical role in understanding and mitigating the ecological consequences of extractive activities. This paper presents MineSegSAT, a model that presents a novel approach to predicting environmentally impacted areas of mineral extraction sites using the SegFormer deep learning segmentation architecture trained on Sentinel-2 data. The data was collected from non-overlapping regions over Western Canada in 2021 containing areas of land that have been environmentally impacted by mining activities that were identified from high-resolution satellite imagery in 2021. The SegFormer architecture, a state-of-the-art semantic segmentation framework, is employed to leverage its advanced spatial understanding capabilities for accurate land cover classification. We investigate the efficacy of loss functions including Dice, Tversky, and Lovasz loss respectively. The trained model was utilized for inference over the test reg",
    "path": "papers/23/11/2311.01676.json",
    "total_tokens": 941,
    "translated_title": "MineSegSAT：一个自动化系统，用于评估Sentinel-2影像中的采矿干扰区域范围",
    "translated_abstract": "评估矿产开采行业的环境影响在理解和减轻开采活动的生态后果方面起着关键作用。本文介绍了MineSegSAT，一个利用在Sentinel-2数据上训练的SegFormer深度学习分割架构来预测矿产开采现场环境受到影响的区域的新方法。所使用的数据是从2021年加拿大西部的非重叠地区收集的，其中包含了通过2021年高分辨率卫星图像确定的受矿业活动环境影响的土地区域。采用SegFormer架构，这是一种先进的语义分割框架，利用其先进的空间理解能力进行准确的土地覆盖分类。我们研究了包括Dice、Tversky和Lovasz损失在内的损失函数的效果。训练好的模型用于对测试区域进行推断。",
    "tldr": "本文介绍了MineSegSAT，一个使用Sentinel-2数据和SegFormer深度学习分割架构的模型，用于预测矿产开采现场受到影响的区域。该模型利用先进的空间理解能力进行准确的土地覆盖分类。通过研究不同损失函数的效果，验证了该模型的可靠性和有效性。",
    "en_tdlr": "This paper introduces MineSegSAT, a model that predicts environmentally impacted areas of mineral extraction sites using Sentinel-2 data and the SegFormer deep learning segmentation architecture. The model leverages advanced spatial understanding capabilities for accurate land cover classification. The effectiveness of different loss functions is investigated, validating the reliability and effectiveness of the model."
}