{
    "title": "GAIA: Delving into Gradient-based Attribution Abnormality for Out-of-distribution Detection. (arXiv:2311.09620v2 [cs.LG] UPDATED)",
    "abstract": "Detecting out-of-distribution (OOD) examples is crucial to guarantee the reliability and safety of deep neural networks in real-world settings. In this paper, we offer an innovative perspective on quantifying the disparities between in-distribution (ID) and OOD data -- analyzing the uncertainty that arises when models attempt to explain their predictive decisions. This perspective is motivated by our observation that gradient-based attribution methods encounter challenges in assigning feature importance to OOD data, thereby yielding divergent explanation patterns. Consequently, we investigate how attribution gradients lead to uncertain explanation outcomes and introduce two forms of abnormalities for OOD detection: the zero-deflation abnormality and the channel-wise average abnormality. We then propose GAIA, a simple and effective approach that incorporates Gradient Abnormality Inspection and Aggregation. The effectiveness of GAIA is validated on both commonly utilized (CIFAR) and larg",
    "link": "http://arxiv.org/abs/2311.09620",
    "context": "Title: GAIA: Delving into Gradient-based Attribution Abnormality for Out-of-distribution Detection. (arXiv:2311.09620v2 [cs.LG] UPDATED)\nAbstract: Detecting out-of-distribution (OOD) examples is crucial to guarantee the reliability and safety of deep neural networks in real-world settings. In this paper, we offer an innovative perspective on quantifying the disparities between in-distribution (ID) and OOD data -- analyzing the uncertainty that arises when models attempt to explain their predictive decisions. This perspective is motivated by our observation that gradient-based attribution methods encounter challenges in assigning feature importance to OOD data, thereby yielding divergent explanation patterns. Consequently, we investigate how attribution gradients lead to uncertain explanation outcomes and introduce two forms of abnormalities for OOD detection: the zero-deflation abnormality and the channel-wise average abnormality. We then propose GAIA, a simple and effective approach that incorporates Gradient Abnormality Inspection and Aggregation. The effectiveness of GAIA is validated on both commonly utilized (CIFAR) and larg",
    "path": "papers/23/11/2311.09620.json",
    "total_tokens": 941,
    "translated_title": "GAIA: 探索基于梯度的归因异常性以进行越界检测",
    "translated_abstract": "在实际环境中，检测越界（OOD）样本对于保证深度神经网络的可靠性和安全性至关重要。本文针对在分析模型试图解释其预测决策时产生的不确定性，提出了一种创新的视角来量化内分布（ID）和越界数据之间的差异。我们观察到，基于梯度的归因方法在为越界数据分配特征重要性方面遇到了挑战，从而产生了不同的解释模式。因此，我们研究了归因梯度如何导致不确定的解释结果，并引入了两种形式的越界检测异常：零膨胀异常和通道平均异常。然后，我们提出了GAIA，一种简单而有效的方法，它结合了梯度异常检查和聚合。通过在常用的数据集（CIFAR）和大型数据集上验证了GAIA的有效性。",
    "tldr": "本文研究了在深度神经网络中检测越界样本的问题，提出了一种基于梯度的归因异常性方法，用于量化内分布和越界数据之间的差异。通过引入零膨胀异常和通道平均异常，我们提出了一种简单而有效的GAIA方法，可以有效检测越界样本。"
}