{
    "title": "Next-Generation Earth System Models: Towards Reliable Hybrid Models for Weather and Climate Applications. (arXiv:2311.13691v2 [physics.ao-ph] UPDATED)",
    "abstract": "We review how machine learning has transformed our ability to model the Earth system, and how we expect recent breakthroughs to benefit end-users in Switzerland in the near future. Drawing from our review, we identify three recommendations.  Recommendation 1: Develop Hybrid AI-Physical Models: Emphasize the integration of AI and physical modeling for improved reliability, especially for longer prediction horizons, acknowledging the delicate balance between knowledge-based and data-driven components required for optimal performance. Recommendation 2: Emphasize Robustness in AI Downscaling Approaches, favoring techniques that respect physical laws, preserve inter-variable dependencies and spatial structures, and accurately represent extremes at the local scale. Recommendation 3: Promote Inclusive Model Development: Ensure Earth System Model development is open and accessible to diverse stakeholders, enabling forecasters, the public, and AI/statistics experts to use, develop, and engage w",
    "link": "http://arxiv.org/abs/2311.13691",
    "context": "Title: Next-Generation Earth System Models: Towards Reliable Hybrid Models for Weather and Climate Applications. (arXiv:2311.13691v2 [physics.ao-ph] UPDATED)\nAbstract: We review how machine learning has transformed our ability to model the Earth system, and how we expect recent breakthroughs to benefit end-users in Switzerland in the near future. Drawing from our review, we identify three recommendations.  Recommendation 1: Develop Hybrid AI-Physical Models: Emphasize the integration of AI and physical modeling for improved reliability, especially for longer prediction horizons, acknowledging the delicate balance between knowledge-based and data-driven components required for optimal performance. Recommendation 2: Emphasize Robustness in AI Downscaling Approaches, favoring techniques that respect physical laws, preserve inter-variable dependencies and spatial structures, and accurately represent extremes at the local scale. Recommendation 3: Promote Inclusive Model Development: Ensure Earth System Model development is open and accessible to diverse stakeholders, enabling forecasters, the public, and AI/statistics experts to use, develop, and engage w",
    "path": "papers/23/11/2311.13691.json",
    "total_tokens": 898,
    "translated_title": "下一代地球系统模型：面向可靠的混合模型的天气和气候应用",
    "translated_abstract": "我们回顾了机器学习如何改变我们模拟地球系统的能力，并期望近期的突破将使瑞士的最终用户受益。根据我们的回顾，我们提出了三个建议。建议1: 开发混合的人工智能-物理模型：强调整合人工智能和物理建模，以提高可靠性，特别是对于较长的预测时段，同时平衡基于知识和数据驱动的组件以获得最佳性能。建议2: 强调AI降尺度方法的稳健性，优先使用尊重物理定律、保留变量间依赖关系和空间结构、准确表示局部极端情况的技术。建议3: 推动包容性模型开发：确保地球系统模型的开发对多元利益相关者是开放和可访问的，使预测员、公众和AI/统计专家能够使用、开发和参与其中。",
    "tldr": "这篇论文回顾了机器学习如何改变我们模拟地球系统的能力，并提出了开发混合的人工智能-物理模型、强调AI降尺度方法的稳健性以及推动包容性模型开发的建议。"
}