{
    "title": "Exploring the impact of social stress on the adaptive dynamics of COVID-19: Typing the behavior of na\\\"ive populations faced with epidemics",
    "abstract": "In the context of natural disasters, human responses inevitably intertwine with natural factors. The COVID-19 pandemic, as a significant stress factor, has brought to light profound variations among different countries in terms of their adaptive dynamics in addressing the spread of infection outbreaks across different regions. This emphasizes the crucial role of cultural characteristics in natural disaster analysis. The theoretical understanding of large-scale epidemics primarily relies on mean-field kinetic models. However, conventional SIR-like models failed to fully explain the observed phenomena at the onset of the COVID-19 outbreak. These phenomena included the unexpected cessation of exponential growth, the reaching of plateaus, and the occurrence of multi-wave dynamics. In situations where an outbreak of a highly virulent and unfamiliar infection arises, it becomes crucial to respond swiftly at a non-medical level to mitigate the negative socio-economic impact. Here we present a",
    "link": "https://arxiv.org/abs/2311.13917",
    "context": "Title: Exploring the impact of social stress on the adaptive dynamics of COVID-19: Typing the behavior of na\\\"ive populations faced with epidemics\nAbstract: In the context of natural disasters, human responses inevitably intertwine with natural factors. The COVID-19 pandemic, as a significant stress factor, has brought to light profound variations among different countries in terms of their adaptive dynamics in addressing the spread of infection outbreaks across different regions. This emphasizes the crucial role of cultural characteristics in natural disaster analysis. The theoretical understanding of large-scale epidemics primarily relies on mean-field kinetic models. However, conventional SIR-like models failed to fully explain the observed phenomena at the onset of the COVID-19 outbreak. These phenomena included the unexpected cessation of exponential growth, the reaching of plateaus, and the occurrence of multi-wave dynamics. In situations where an outbreak of a highly virulent and unfamiliar infection arises, it becomes crucial to respond swiftly at a non-medical level to mitigate the negative socio-economic impact. Here we present a",
    "path": "papers/23/11/2311.13917.json",
    "total_tokens": 918,
    "translated_title": "探究社会压力对COVID-19自适应动态的影响：研究面临流行病的不同人群的行为特征",
    "translated_abstract": "在自然灾害的背景下，人类的应对不可避免地与自然因素交织在一起。COVID-19大流行作为一个重大的压力因素，凸显出不同国家在应对不同地区感染爆发的情况下的自适应动态之间的深刻差异。这强调了文化特征在自然灾害分析中的关键作用。对大规模的流行病的理论理解主要依赖于均场动力学模型。然而，传统的SIR-like模型未能完全解释COVID-19爆发初期观察到的现象。这些现象包括指数增长的意外停止，达到稳定期和多波动态的发生。当出现高度致命且陌生的感染爆发时，迅速以非医学的方式做出应对以减轻负面社会经济影响变得至关重要。",
    "tldr": "该论文研究了COVID-19疫情对社会压力的影响，并探究了不同人群面对流行病的行为特征。研究发现传统模型无法完全解释COVID-19的观察现象，因此非医学层面上的迅速应对至关重要。",
    "en_tdlr": "This paper investigates the impact of social stress on COVID-19 and explores the behavioral characteristics of different populations facing epidemics. The study finds that traditional models fail to fully explain the observed phenomena of COVID-19, highlighting the importance of swift non-medical responses."
}