{
    "title": "Overview of Current Applications of Large Language Models in Various Medical Specialities",
    "abstract": "arXiv:2311.12882v2 Announce Type: replace  Abstract: We aim to provide an overview of the latest applications of Large Language Models (LLMs) in the healthcare sector, highlighting their transformative role in enhancing medical care quality. By processing vast amounts of data from diverse medical domains, LLMs have become pivotal in assisting doctors, healthcare providers, and patients. We review the application of Large Language Models (LLMs) in healthcare, focusing on diagnostics and treatment related applications. We highlight the use of LLMs in cancer care, dermatology, dental, and mental health, emphasizing the innovation they bring to medical diagnostics and patient care. The analysis addresses the challenges and opportunities of integrating LLMs in healthcare, noting their potential in various medical specialties despite current limitations. Further, we provide an overview of handling various data types in the medical field.",
    "link": "https://arxiv.org/abs/2311.12882",
    "context": "Title: Overview of Current Applications of Large Language Models in Various Medical Specialities\nAbstract: arXiv:2311.12882v2 Announce Type: replace  Abstract: We aim to provide an overview of the latest applications of Large Language Models (LLMs) in the healthcare sector, highlighting their transformative role in enhancing medical care quality. By processing vast amounts of data from diverse medical domains, LLMs have become pivotal in assisting doctors, healthcare providers, and patients. We review the application of Large Language Models (LLMs) in healthcare, focusing on diagnostics and treatment related applications. We highlight the use of LLMs in cancer care, dermatology, dental, and mental health, emphasizing the innovation they bring to medical diagnostics and patient care. The analysis addresses the challenges and opportunities of integrating LLMs in healthcare, noting their potential in various medical specialties despite current limitations. Further, we provide an overview of handling various data types in the medical field.",
    "path": "papers/23/11/2311.12882.json",
    "total_tokens": 922,
    "translated_title": "当前大型语言模型在各种医学专业中的应用概览",
    "translated_abstract": "我们旨在概述大型语言模型（LLMs）在医疗领域最新应用，突出它们在提升医疗质量方面的变革性作用。通过处理来自不同医学领域的大量数据，LLMs已成为协助医生、医疗提供者和患者的关键工具。我们重点审视了LLMs在医疗领域的应用，主要集中在诊断和治疗相关应用上。我们强调了LLMs在癌症护理、皮肤科、牙科和心理健康领域的应用，强调了它们为医学诊断和患者护理带来的创新。分析涵盖了将LLMs整合到医疗领域中所面临的挑战和机遇，指出了尽管存在当前局限，但它们在各种医学专业中的潜力。此外，我们还概述了在医学领域处理各种数据类型的情况。",
    "tldr": "大型语言模型在医疗领域的应用概述，突出了它们在医疗质量提升中的变革性作用，重点关注了诊断和治疗领域，以及在癌症护理、皮肤科、牙科和心理健康等方面的创新应用。",
    "en_tdlr": "Overview of the current applications of large language models in the healthcare sector, emphasizing their transformative role in enhancing medical care quality, focusing on diagnostics and treatment fields, including innovative applications in cancer care, dermatology, dental, and mental health."
}