{
    "title": "SCOPE-RL: A Python Library for Offline Reinforcement Learning and Off-Policy Evaluation",
    "abstract": "arXiv:2311.18206v3 Announce Type: replace-cross  Abstract: This paper introduces SCOPE-RL, a comprehensive open-source Python software designed for offline reinforcement learning (offline RL), off-policy evaluation (OPE), and selection (OPS). Unlike most existing libraries that focus solely on either policy learning or evaluation, SCOPE-RL seamlessly integrates these two key aspects, facilitating flexible and complete implementations of both offline RL and OPE processes. SCOPE-RL put particular emphasis on its OPE modules, offering a range of OPE estimators and robust evaluation-of-OPE protocols. This approach enables more in-depth and reliable OPE compared to other packages. For instance, SCOPE-RL enhances OPE by estimating the entire reward distribution under a policy rather than its mere point-wise expected value. Additionally, SCOPE-RL provides a more thorough evaluation-of-OPE by presenting the risk-return tradeoff in OPE results, extending beyond mere accuracy evaluations in exis",
    "link": "https://arxiv.org/abs/2311.18206",
    "context": "Title: SCOPE-RL: A Python Library for Offline Reinforcement Learning and Off-Policy Evaluation\nAbstract: arXiv:2311.18206v3 Announce Type: replace-cross  Abstract: This paper introduces SCOPE-RL, a comprehensive open-source Python software designed for offline reinforcement learning (offline RL), off-policy evaluation (OPE), and selection (OPS). Unlike most existing libraries that focus solely on either policy learning or evaluation, SCOPE-RL seamlessly integrates these two key aspects, facilitating flexible and complete implementations of both offline RL and OPE processes. SCOPE-RL put particular emphasis on its OPE modules, offering a range of OPE estimators and robust evaluation-of-OPE protocols. This approach enables more in-depth and reliable OPE compared to other packages. For instance, SCOPE-RL enhances OPE by estimating the entire reward distribution under a policy rather than its mere point-wise expected value. Additionally, SCOPE-RL provides a more thorough evaluation-of-OPE by presenting the risk-return tradeoff in OPE results, extending beyond mere accuracy evaluations in exis",
    "path": "papers/23/11/2311.18206.json",
    "total_tokens": 953,
    "translated_title": "SCOPE-RL: 用于离线强化学习和离策略评估的Python库",
    "translated_abstract": "本文介绍了SCOPE-RL，这是一个全面的开源Python软件，专为离线强化学习（offline RL）、离策略评估（OPE）和选择（OPS）而设计。与大多数现有的库不同，这些库仅关注策略学习或评估中的一个，SCOPE-RL无缝整合了这两个关键方面，促进了离线RL和OPE过程的灵活和完整实现。SCOPE-RL特别侧重于其OPE模块，提供一系列OPE估计器和稳健的OPE协议。这种方法使得与其他软件包相比，SCOPE-RL能够更深入和可靠地评估OPE。例如，SCOPE-RL通过估计策略下的整个奖励分布而不仅仅是其点值预期值来增强OPE。此外，SCOPE-RL通过在OPE结果中提供风险-回报权衡，超越了现有库中仅仅是准确性评估的更全面的OPE评估。",
    "tldr": "SCOPE-RL是一个Python库，兼顾离线强化学习和离策略评估，通过整合策略学习和评估实现了更灵活、完整的实现方式，并通过OPE模块提供了多种OPE估计器和稳健的OPE协议，使得OPE更深入和可靠。",
    "en_tdlr": "SCOPE-RL is a Python library that combines offline reinforcement learning and off-policy evaluation, integrating policy learning and evaluation for more flexible and complete implementations, and offering various OPE estimators and robust OPE protocols in its OPE modules, enabling more in-depth and reliable OPE processes."
}