{
    "title": "Spatially Covariant Image Registration with Text Prompts",
    "abstract": "Medical images are often characterized by their structured anatomical representations and spatially inhomogeneous contrasts. Leveraging anatomical priors in neural networks can greatly enhance their utility in resource-constrained clinical settings. Prior research has harnessed such information for image segmentation, yet progress in deformable image registration has been modest. Our work introduces textSCF, a novel method that integrates spatially covariant filters and textual anatomical prompts encoded by visual-language models, to fill this gap. This approach optimizes an implicit function that correlates text embeddings of anatomical regions to filter weights, relaxing the typical translation-invariance constraint of convolutional operations. TextSCF not only boosts computational efficiency but can also retain or improve registration accuracy. By capturing the contextual interplay between anatomical regions, it offers impressive inter-regional transferability and the ability to pre",
    "link": "https://arxiv.org/abs/2311.15607",
    "context": "Title: Spatially Covariant Image Registration with Text Prompts\nAbstract: Medical images are often characterized by their structured anatomical representations and spatially inhomogeneous contrasts. Leveraging anatomical priors in neural networks can greatly enhance their utility in resource-constrained clinical settings. Prior research has harnessed such information for image segmentation, yet progress in deformable image registration has been modest. Our work introduces textSCF, a novel method that integrates spatially covariant filters and textual anatomical prompts encoded by visual-language models, to fill this gap. This approach optimizes an implicit function that correlates text embeddings of anatomical regions to filter weights, relaxing the typical translation-invariance constraint of convolutional operations. TextSCF not only boosts computational efficiency but can also retain or improve registration accuracy. By capturing the contextual interplay between anatomical regions, it offers impressive inter-regional transferability and the ability to pre",
    "path": "papers/23/11/2311.15607.json",
    "total_tokens": 862,
    "translated_title": "基于文本提示的空间协变图像配准",
    "translated_abstract": "医学图像通常以其结构化的解剖表示和空间不均匀对比度而著称。利用神经网络中的解剖先验可以极大地增强其在资源受限的临床环境中的效用。先前的研究已经利用这些信息进行图像分割，然而在变形图像配准方面的进展却有限。我们的工作引入了textSCF，一种新颖的方法，它将空间协变滤波器和由视觉语言模型编码的解剖文本提示相结合，以填补这一空白。这种方法优化了一个隐式函数，将解剖区域的文本嵌入与滤波器权重相关联，放宽了典型的卷积运算的平移不变性约束。textSCF不仅提高了计算效率，还可以保留或提高配准的准确性。通过捕捉解剖区域之间的上下文相互作用，它提供了令人印象深刻的区域间可传递性和预备能力。",
    "tldr": "这项工作引入了一种新颖的方法textSCF，通过将空间协变滤波器和由视觉语言模型编码的解剖文本提示相结合，提升了图像配准的效率和准确性。"
}