{
    "title": "LogLead -- Fast and Integrated Log Loader, Enhancer, and Anomaly Detector. (arXiv:2311.11809v2 [cs.SE] UPDATED)",
    "abstract": "This paper introduces LogLead, a tool designed for efficient log analysis benchmarking. LogLead combines three essential steps in log processing: loading, enhancing, and anomaly detection. The tool leverages Polars, a high-speed DataFrame library. We currently have Loaders for eight systems that are publicly available (HDFS, Hadoop, BGL, Thunderbird, Spirit, Liberty, TrainTicket, and GC Webshop). We have multiple enhancers with three parsers (Drain, Spell, LenMa), Bert embedding creation and other log representation techniques like bag-of-words. LogLead integrates to five supervised and four unsupervised machine learning algorithms for anomaly detection from SKLearn. By integrating diverse datasets, log representation methods and anomaly detectors, LogLead facilitates comprehensive benchmarking in log analysis research. We show that log loading from raw file to dataframe is over 10x faster with LogLead compared to past solutions. We demonstrate roughly 2x improvement in Drain parsing s",
    "link": "http://arxiv.org/abs/2311.11809",
    "context": "Title: LogLead -- Fast and Integrated Log Loader, Enhancer, and Anomaly Detector. (arXiv:2311.11809v2 [cs.SE] UPDATED)\nAbstract: This paper introduces LogLead, a tool designed for efficient log analysis benchmarking. LogLead combines three essential steps in log processing: loading, enhancing, and anomaly detection. The tool leverages Polars, a high-speed DataFrame library. We currently have Loaders for eight systems that are publicly available (HDFS, Hadoop, BGL, Thunderbird, Spirit, Liberty, TrainTicket, and GC Webshop). We have multiple enhancers with three parsers (Drain, Spell, LenMa), Bert embedding creation and other log representation techniques like bag-of-words. LogLead integrates to five supervised and four unsupervised machine learning algorithms for anomaly detection from SKLearn. By integrating diverse datasets, log representation methods and anomaly detectors, LogLead facilitates comprehensive benchmarking in log analysis research. We show that log loading from raw file to dataframe is over 10x faster with LogLead compared to past solutions. We demonstrate roughly 2x improvement in Drain parsing s",
    "path": "papers/23/11/2311.11809.json",
    "total_tokens": 989,
    "translated_title": "LogLead -- 快速且集成的日志加载器、增强器和异常检测器。",
    "translated_abstract": "本论文介绍了一种名为LogLead的工具，旨在进行高效的日志分析基准测试。LogLead结合了日志处理的三个关键步骤：加载、增强和异常检测。该工具利用了高速DataFrame库Polars。我们目前已经公开提供了八个系统的加载器（HDFS、Hadoop、BGL、Thunderbird、Spirit、Liberty、TrainTicket和GC Webshop）。我们拥有多个增强器，包括三个解析器（Drain、Spell、LenMa）、Bert嵌入创建以及词袋等其他日志表示技术。LogLead集成了SKLearn中的五种监督学习和四种无监督学习算法，用于进行异常检测。通过集成不同的数据集、日志表示方法和异常检测器，LogLead为日志分析研究提供了全面的基准测试。我们展示了相比过去的解决方案，使用LogLead从原始文件加载到DataFrame的速度提升了超过10倍。我们演示了Drain解析速度大约提升了2倍。",
    "tldr": "LogLead是一种快速且集成的日志加载器、增强器和异常检测器，可用于高效的日志分析基准测试。通过使用不同的数据集、日志表示方法和异常检测器，LogLead方便了日志分析研究中的全面基准测试。与过去的解决方案相比，LogLead在日志加载速度和Drain解析速度上都取得了显著的提升。",
    "en_tdlr": "LogLead is a fast and integrated log loader, enhancer, and anomaly detector that is designed for efficient log analysis benchmarking. By integrating diverse datasets, log representation methods, and anomaly detectors, LogLead facilitates comprehensive benchmarking in log analysis research. It achieves significant improvements in log loading speed and Drain parsing speed compared to past solutions."
}