{
    "title": "Stable Linear Subspace Identification: A Machine Learning Approach",
    "abstract": "arXiv:2311.03197v4 Announce Type: replace-cross  Abstract: Machine Learning (ML) and linear System Identification (SI) have been historically developed independently. In this paper, we leverage well-established ML tools - especially the automatic differentiation framework - to introduce SIMBa, a family of discrete linear multi-step-ahead state-space SI methods using backpropagation. SIMBa relies on a novel Linear-Matrix-Inequality-based free parametrization of Schur matrices to ensure the stability of the identified model.   We show how SIMBa generally outperforms traditional linear state-space SI methods, and sometimes significantly, although at the price of a higher computational burden. This performance gap is particularly remarkable compared to other SI methods with stability guarantees, where the gain is frequently above 25% in our investigations, hinting at SIMBa's ability to simultaneously achieve state-of-the-art fitting performance and enforce stability. Interestingly, these o",
    "link": "https://arxiv.org/abs/2311.03197",
    "context": "Title: Stable Linear Subspace Identification: A Machine Learning Approach\nAbstract: arXiv:2311.03197v4 Announce Type: replace-cross  Abstract: Machine Learning (ML) and linear System Identification (SI) have been historically developed independently. In this paper, we leverage well-established ML tools - especially the automatic differentiation framework - to introduce SIMBa, a family of discrete linear multi-step-ahead state-space SI methods using backpropagation. SIMBa relies on a novel Linear-Matrix-Inequality-based free parametrization of Schur matrices to ensure the stability of the identified model.   We show how SIMBa generally outperforms traditional linear state-space SI methods, and sometimes significantly, although at the price of a higher computational burden. This performance gap is particularly remarkable compared to other SI methods with stability guarantees, where the gain is frequently above 25% in our investigations, hinting at SIMBa's ability to simultaneously achieve state-of-the-art fitting performance and enforce stability. Interestingly, these o",
    "path": "papers/23/11/2311.03197.json",
    "total_tokens": 817,
    "translated_title": "稳定线性子空间识别：一种基于机器学习的方法",
    "translated_abstract": "机器学习（ML）和线性系统识别（SI）在历史上是独立发展的。在本文中，我们利用成熟的ML工具 - 特别是自动微分框架 - 引入SIMBa，一种使用反向传播的离散线性多步预测状态空间SI方法的系列。SIMBa依赖于一种基于线性矩阵不等式的自由参数化史黛尔矩阵，以确保所识别模型的稳定性。我们展示了SIMBa如何普遍优于传统的线性状态空间SI方法，有时明显优于传统方法，尽管付出更高的计算负担。这种性能差距与其他具有稳定性保证的SI方法相比尤为显著，在我们的研究中增益通常大于25%，暗示着SIMBa同时实现了最先进的拟合性能并强制稳定。有趣的是，",
    "tldr": "本文提出了一种使用机器学习方法进行稳定线性子空间识别的新方法SIMBa，在稳定性和性能方面均表现优异。",
    "en_tdlr": "This paper introduces a novel approach, SIMBa, for stable linear subspace identification using machine learning methods, showing outstanding performance in stability and fitting."
}