{
    "title": "Can Knowledge Graphs Reduce Hallucinations in LLMs? : A Survey",
    "abstract": "arXiv:2311.07914v2 Announce Type: replace  Abstract: The contemporary LLMs are prone to producing hallucinations, stemming mainly from the knowledge gaps within the models. To address this critical limitation, researchers employ diverse strategies to augment the LLMs by incorporating external knowledge, aiming to reduce hallucinations and enhance reasoning accuracy. Among these strategies, leveraging knowledge graphs as a source of external information has demonstrated promising results. In this survey, we comprehensively review these knowledge-graph-based augmentation techniques in LLMs, focusing on their efficacy in mitigating hallucinations. We systematically categorize these methods into three overarching groups, offering methodological comparisons and performance evaluations. Lastly, this survey explores the current trends and challenges associated with these techniques and outlines potential avenues for future research in this emerging field.",
    "link": "https://arxiv.org/abs/2311.07914",
    "context": "Title: Can Knowledge Graphs Reduce Hallucinations in LLMs? : A Survey\nAbstract: arXiv:2311.07914v2 Announce Type: replace  Abstract: The contemporary LLMs are prone to producing hallucinations, stemming mainly from the knowledge gaps within the models. To address this critical limitation, researchers employ diverse strategies to augment the LLMs by incorporating external knowledge, aiming to reduce hallucinations and enhance reasoning accuracy. Among these strategies, leveraging knowledge graphs as a source of external information has demonstrated promising results. In this survey, we comprehensively review these knowledge-graph-based augmentation techniques in LLMs, focusing on their efficacy in mitigating hallucinations. We systematically categorize these methods into three overarching groups, offering methodological comparisons and performance evaluations. Lastly, this survey explores the current trends and challenges associated with these techniques and outlines potential avenues for future research in this emerging field.",
    "path": "papers/23/11/2311.07914.json",
    "total_tokens": 785,
    "translated_title": "知识图谱是否可以减少LLMs中的幻觉？：一项调查",
    "translated_abstract": "当代LLMs很容易产生幻觉，主要源于模型内的知识空缺。为了解决这一关键限制，研究人员采用各种策略通过整合外部知识来增强LLMs，旨在减少幻觉并提升推理准确性。在这些策略中，利用知识图谱作为外部信息源已经显示出了良好的效果。在这项调查中，我们全面审查了LLMs中基于知识图谱的增强技术，重点关注它们在减轻幻觉方面的效果。我们将这些方法系统地归类为三个总体组，提供方法比较和性能评估。最后，本调查探讨了与这些技术相关的当前趋势和挑战，并概述了这一新兴领域未来研究的潜在方向。",
    "tldr": "调查综合审查了LLMs中基于知识图谱的增强技术，重点关注其在减轻幻觉方面的效果。",
    "en_tdlr": "The survey comprehensively reviews knowledge-graph-based augmentation techniques in LLMs, focusing on their efficacy in mitigating hallucinations."
}