{
    "title": "A New Korean Text Classification Benchmark for Recognizing the Political Intents in Online Newspapers. (arXiv:2311.01712v1 [cs.CL])",
    "abstract": "Many users reading online articles in various magazines may suffer considerable difficulty in distinguishing the implicit intents in texts. In this work, we focus on automatically recognizing the political intents of a given online newspaper by understanding the context of the text. To solve this task, we present a novel Korean text classification dataset that contains various articles. We also provide deep-learning-based text classification baseline models trained on the proposed dataset. Our dataset contains 12,000 news articles that may contain political intentions, from the politics section of six of the most representative newspaper organizations in South Korea. All the text samples are labeled simultaneously in two aspects (1) the level of political orientation and (2) the level of pro-government. To the best of our knowledge, our paper is the most large-scale Korean news dataset that contains long text and addresses multi-task classification problems. We also train recent state-",
    "link": "http://arxiv.org/abs/2311.01712",
    "context": "Title: A New Korean Text Classification Benchmark for Recognizing the Political Intents in Online Newspapers. (arXiv:2311.01712v1 [cs.CL])\nAbstract: Many users reading online articles in various magazines may suffer considerable difficulty in distinguishing the implicit intents in texts. In this work, we focus on automatically recognizing the political intents of a given online newspaper by understanding the context of the text. To solve this task, we present a novel Korean text classification dataset that contains various articles. We also provide deep-learning-based text classification baseline models trained on the proposed dataset. Our dataset contains 12,000 news articles that may contain political intentions, from the politics section of six of the most representative newspaper organizations in South Korea. All the text samples are labeled simultaneously in two aspects (1) the level of political orientation and (2) the level of pro-government. To the best of our knowledge, our paper is the most large-scale Korean news dataset that contains long text and addresses multi-task classification problems. We also train recent state-",
    "path": "papers/23/11/2311.01712.json",
    "total_tokens": 943,
    "translated_title": "一种用于识别在线新闻中政治意图的新韩文文本分类基准（arXiv:2311.01712v1 [cs.CL]）",
    "translated_abstract": "许多用户在各种杂志上阅读在线文章时，可能会在区分文本中的隐含意图方面遇到困难。在这项工作中，我们通过理解文本的语境，专注于自动识别给定在线报纸的政治意图。为了解决这个任务，我们提出了一个包含各种文章的新颖的韩文文本分类数据集。我们还提供了基于深度学习的文本分类基准模型，这些模型是在所提出的数据集上训练得到的。我们的数据集包含来自韩国六家最具代表性的报纸组织政治栏目的12000篇新闻文章，这些文章可能包含有政治意图。所有的文本样本同时以两个方面进行标记（1）政治倾向的水平和（2）亲政府的水平。据我们所知，我们的论文是包含长文本并解决多任务分类问题的最大规模的韩国新闻数据集。我们还训练了最近的状态。",
    "tldr": "这项工作提出了一个用于自动识别韩国在线报纸中政治意图的新的韩文文本分类数据集，该数据集包含12000篇新闻文章，并提供了基于深度学习的分类模型。这是目前最大规模的韩国新闻数据集，可以处理长文本和多任务分类问题。"
}