{
    "title": "WatME: Towards Lossless Watermarking Through Lexical Redundancy",
    "abstract": "arXiv:2311.09832v2 Announce Type: replace  Abstract: Text watermarking has emerged as an important technique for detecting machine-generated text. However, existing methods generally use arbitrary vocabulary partitioning during decoding, which results in the absence of appropriate words during the response generation and disrupts the language model's expressiveness, thus severely degrading the quality of text response. To address these issues, we introduce a novel approach, Watermarking with Mutual Exclusion (WatME). Specifically, by leveraging linguistic prior knowledge of inherent lexical redundancy, WatME can dynamically optimize the use of available vocabulary during the decoding process of language models. It employs a mutually exclusive rule to manage this redundancy, avoiding situations where appropriate words are unavailable and maintaining the expressive power of large language models (LLMs). We present theoretical analysis and empirical evidence demonstrating that WatME subst",
    "link": "https://arxiv.org/abs/2311.09832",
    "context": "Title: WatME: Towards Lossless Watermarking Through Lexical Redundancy\nAbstract: arXiv:2311.09832v2 Announce Type: replace  Abstract: Text watermarking has emerged as an important technique for detecting machine-generated text. However, existing methods generally use arbitrary vocabulary partitioning during decoding, which results in the absence of appropriate words during the response generation and disrupts the language model's expressiveness, thus severely degrading the quality of text response. To address these issues, we introduce a novel approach, Watermarking with Mutual Exclusion (WatME). Specifically, by leveraging linguistic prior knowledge of inherent lexical redundancy, WatME can dynamically optimize the use of available vocabulary during the decoding process of language models. It employs a mutually exclusive rule to manage this redundancy, avoiding situations where appropriate words are unavailable and maintaining the expressive power of large language models (LLMs). We present theoretical analysis and empirical evidence demonstrating that WatME subst",
    "path": "papers/23/11/2311.09832.json",
    "total_tokens": 861,
    "translated_title": "WatME：通过词汇冗余实现无损水印",
    "translated_abstract": "arXiv:2311.09832v2 公告类型：替换。文本水印技术已经成为一种重要的检测机器生成文本的技术。然而，现有方法通常在解码过程中使用任意的词汇分割，导致在响应生成过程中缺乏适当的词汇，并破坏了语言模型的表现力，严重降低了文本响应的质量。为了解决这些问题，我们引入了一种新颖的方法，即互斥式水印（WatME）。具体来说，通过利用固有词汇冗余的语言先验知识，WatME 可以在语言模型的解码过程中动态优化可用词汇的使用。它采用互斥规则来管理这种冗余，避免了适当的词汇不可用的情况，同时保持了大型语言模型（LLMs）的表现力。我们提出理论分析和实证证据，证明了WatME的有效性。",
    "tldr": "WatME通过利用词汇冗余的语言先验知识，动态优化语言模型解码过程中的词汇使用，避免适当词汇不可用的情况，维持语言模型的表现力。",
    "en_tdlr": "WatME dynamically optimizes the use of vocabulary during the decoding process of language models by leveraging linguistic prior knowledge of inherent lexical redundancy, avoiding situations where appropriate words are unavailable, thus maintaining the expressiveness of the language model."
}