{
    "title": "Nonparametric consistency for maximum likelihood estimation and clustering based on mixtures of elliptically-symmetric distributions",
    "abstract": "arXiv:2311.06108v2 Announce Type: replace-cross  Abstract: The consistency of the maximum likelihood estimator for mixtures of elliptically-symmetric distributions for estimating its population version is shown, where the underlying distribution $P$ is nonparametric and does not necessarily belong to the class of mixtures on which the estimator is based. In a situation where $P$ is a mixture of well enough separated but nonparametric distributions it is shown that the components of the population version of the estimator correspond to the well separated components of $P$. This provides some theoretical justification for the use of such estimators for cluster analysis in case that $P$ has well separated subpopulations even if these subpopulations differ from what the mixture model assumes.",
    "link": "https://arxiv.org/abs/2311.06108",
    "context": "Title: Nonparametric consistency for maximum likelihood estimation and clustering based on mixtures of elliptically-symmetric distributions\nAbstract: arXiv:2311.06108v2 Announce Type: replace-cross  Abstract: The consistency of the maximum likelihood estimator for mixtures of elliptically-symmetric distributions for estimating its population version is shown, where the underlying distribution $P$ is nonparametric and does not necessarily belong to the class of mixtures on which the estimator is based. In a situation where $P$ is a mixture of well enough separated but nonparametric distributions it is shown that the components of the population version of the estimator correspond to the well separated components of $P$. This provides some theoretical justification for the use of such estimators for cluster analysis in case that $P$ has well separated subpopulations even if these subpopulations differ from what the mixture model assumes.",
    "path": "papers/23/11/2311.06108.json",
    "total_tokens": 715,
    "translated_title": "基于椭圆对称分布混合的最大似然估计和聚类的非参数一致性",
    "translated_abstract": "该论文展示了椭圆对称分布混合的最大似然估计器对其总体版本的一致性，其中潜在分布P是非参数的，并不一定属于估计器所基于的混合类别。当P是足够分离但非参数的分布混合时，表明了估计器的总体版本的组分对应于P的良好分离组分。这为在P具有良好分离子总体的情况下使用这样的估计器进行聚类分析提供了一些理论上的理据，即使这些子总体与混合模型所假设的不同。",
    "tldr": "展示了椭圆对称分布混合的最大似然估计的一致性，为基于非参数分布的聚类提供了理论依据。",
    "en_tdlr": "Demonstrates the consistency of maximum likelihood estimation for mixtures of elliptically-symmetric distributions and provides theoretical justification for clustering based on nonparametric distributions."
}