{
    "title": "Epidemic Decision-making System Based Federated Reinforcement Learning. (arXiv:2311.01749v1 [cs.LG])",
    "abstract": "Epidemic decision-making can effectively help the government to comprehensively consider public security and economic development to respond to public health and safety emergencies. Epidemic decision-making can effectively help the government to comprehensively consider public security and economic development to respond to public health and safety emergencies. Some studies have shown that intensive learning can effectively help the government to make epidemic decision, thus achieving the balance between health security and economic development. Some studies have shown that intensive learning can effectively help the government to make epidemic decision, thus achieving the balance between health security and economic development. However, epidemic data often has the characteristics of limited samples and high privacy. However, epidemic data often has the characteristics of limited samples and high privacy. This model can combine the epidemic situation data of various provinces for coop",
    "link": "http://arxiv.org/abs/2311.01749",
    "context": "Title: Epidemic Decision-making System Based Federated Reinforcement Learning. (arXiv:2311.01749v1 [cs.LG])\nAbstract: Epidemic decision-making can effectively help the government to comprehensively consider public security and economic development to respond to public health and safety emergencies. Epidemic decision-making can effectively help the government to comprehensively consider public security and economic development to respond to public health and safety emergencies. Some studies have shown that intensive learning can effectively help the government to make epidemic decision, thus achieving the balance between health security and economic development. Some studies have shown that intensive learning can effectively help the government to make epidemic decision, thus achieving the balance between health security and economic development. However, epidemic data often has the characteristics of limited samples and high privacy. However, epidemic data often has the characteristics of limited samples and high privacy. This model can combine the epidemic situation data of various provinces for coop",
    "path": "papers/23/11/2311.01749.json",
    "total_tokens": 715,
    "translated_title": "基于联邦强化学习的流行病决策系统",
    "translated_abstract": "流行病决策可以有效帮助政府综合考虑公共安全和经济发展，以应对公共卫生和安全紧急情况。一些研究表明，强化学习可以有效帮助政府做出流行病决策，从而实现卫生安全和经济发展之间的平衡。然而，流行病数据往往具有样本有限和隐私性高的特点。该模型可以将各省份的疫情数据进行合作。",
    "tldr": "基于联邦强化学习的流行病决策系统可以帮助政府在兼顾公共安全和经济发展方面做出决策，并处理流行病数据样本有限和隐私性高的问题。",
    "en_tdlr": "The epidemic decision-making system based on federated reinforcement learning can help the government make decisions that balance public security and economic development, while handling limited sample and high privacy characteristics of epidemic data."
}