{
    "title": "On the Relevance and Appropriateness of Name Concentration Risk Adjustments for Portfolios of Multilateral Development Banks",
    "abstract": "arXiv:2311.13802v2 Announce Type: replace  Abstract: Sovereign loan portfolios of Multilateral Development Banks (MDBs) typically consist of only a small number of borrowers and hence are heavily exposed to single name concentration risk. Based on realistic MDB portfolios constructed from publicly available data, this paper quantifies the magnitude of the exposure to name concentration risk using exact Monte Carlo simulations. In comparing the exact adjustment for name concentration risk to its analytic approximation as currently applied by the major rating agency Standard & Poor's, we further investigate whether current capital adequacy frameworks for MDBs are overly conservative. Finally, we discuss the choice of appropriate model parameters and their impact on measures of name concentration risk.",
    "link": "https://arxiv.org/abs/2311.13802",
    "context": "Title: On the Relevance and Appropriateness of Name Concentration Risk Adjustments for Portfolios of Multilateral Development Banks\nAbstract: arXiv:2311.13802v2 Announce Type: replace  Abstract: Sovereign loan portfolios of Multilateral Development Banks (MDBs) typically consist of only a small number of borrowers and hence are heavily exposed to single name concentration risk. Based on realistic MDB portfolios constructed from publicly available data, this paper quantifies the magnitude of the exposure to name concentration risk using exact Monte Carlo simulations. In comparing the exact adjustment for name concentration risk to its analytic approximation as currently applied by the major rating agency Standard & Poor's, we further investigate whether current capital adequacy frameworks for MDBs are overly conservative. Finally, we discuss the choice of appropriate model parameters and their impact on measures of name concentration risk.",
    "path": "papers/23/11/2311.13802.json",
    "total_tokens": 790,
    "translated_title": "关于多边开发银行组合中姓名集中风险调整的相关性和适当性",
    "translated_abstract": "多边开发银行（MDBs）的主权贷款组合通常仅包含少数借款人，因此严重面临单一姓名集中风险。本文根据公开可得数据构建的实际MDB组合，使用精确的蒙特卡洛模拟量化了对姓名集中风险的暴露程度。通过将姓名集中风险的精确调整与目前由主要评级机构标准普尔公司应用的解析近似进行比较，我们进一步调查了当前MDB资本充足性框架是否过于保守。最后，我们讨论了适当的模型参数选择及其对姓名集中风险度量的影响。",
    "tldr": "本研究通过精确蒙特卡洛模拟量化了多边开发银行贷款组合中面临的姓名集中风险，并探讨了当前资本充足性框架是否过于保守以及合适的模型参数选择对姓名集中风险度量的影响。",
    "en_tdlr": "This study quantifies the name concentration risk in the loan portfolios of Multilateral Development Banks using exact Monte Carlo simulations and discusses the conservatism of current capital adequacy frameworks, as well as the impact of appropriate model parameter choices on measuring name concentration risk."
}