{
    "title": "Semantic Representation Learning of Scientific Literature based on Adaptive Feature and Graph Neural Network. (arXiv:2311.00296v1 [cs.CL])",
    "abstract": "Because most of the scientific literature data is unmarked, it makes semantic representation learning based on unsupervised graph become crucial. At the same time, in order to enrich the features of scientific literature, a learning method of semantic representation of scientific literature based on adaptive features and graph neural network is proposed. By introducing the adaptive feature method, the features of scientific literature are considered globally and locally. The graph attention mechanism is used to sum the features of scientific literature with citation relationship, and give each scientific literature different feature weights, so as to better express the correlation between the features of different scientific literature. In addition, an unsupervised graph neural network semantic representation learning method is proposed. By comparing the mutual information between the positive and negative local semantic representation of scientific literature and the global graph sema",
    "link": "http://arxiv.org/abs/2311.00296",
    "context": "Title: Semantic Representation Learning of Scientific Literature based on Adaptive Feature and Graph Neural Network. (arXiv:2311.00296v1 [cs.CL])\nAbstract: Because most of the scientific literature data is unmarked, it makes semantic representation learning based on unsupervised graph become crucial. At the same time, in order to enrich the features of scientific literature, a learning method of semantic representation of scientific literature based on adaptive features and graph neural network is proposed. By introducing the adaptive feature method, the features of scientific literature are considered globally and locally. The graph attention mechanism is used to sum the features of scientific literature with citation relationship, and give each scientific literature different feature weights, so as to better express the correlation between the features of different scientific literature. In addition, an unsupervised graph neural network semantic representation learning method is proposed. By comparing the mutual information between the positive and negative local semantic representation of scientific literature and the global graph sema",
    "path": "papers/23/11/2311.00296.json",
    "total_tokens": 855,
    "translated_title": "基于自适应特征与图神经网络的科学文献语义表示学习",
    "translated_abstract": "由于大部分科学文献数据未标记，因此基于无监督图的语义表示学习变得至关重要。同时，为了丰富科学文献的特征，提出了一种基于自适应特征和图神经网络的科学文献语义表示学习方法。通过引入自适应特征方法，全局和局部考虑科学文献的特征。使用图注意机制对具有引用关系的科学文献特征进行求和，并给予每个科学文献不同的特征权重，以更好地表达不同科学文献特征之间的关联。此外，还提出了一种无监督图神经网络语义表示学习方法，通过比较正负局部语义表示与全局图语义表示之间的互信息来学习。",
    "tldr": "提出了一种基于自适应特征和图神经网络的科学文献语义表示学习方法，通过全局和局部考虑科学文献特征，并使用图注意机制对具有引用关系的特征进行加权求和，以更好地表达不同科学文献特征之间的关联。",
    "en_tdlr": "A method for semantic representation learning of scientific literature is proposed based on adaptive features and graph neural network. It considers the features of scientific literature globally and locally, and uses the graph attention mechanism to sum the features with citation relationship, expressing the correlation between different features of scientific literature."
}