{
    "title": "One Size Does Not Fit All: Customizing Open-Domain Procedures",
    "abstract": "arXiv:2311.09510v2 Announce Type: replace  Abstract: How-to procedures, such as how to plant a garden, are now used by millions of users, but sometimes need customizing to meet a user's specific needs, e.g., planting a garden without pesticides. Our goal is to measure and improve an LLM's ability to perform such customization. Our approach is to test several simple multi-LLM-agent architectures for customization, as well as an end-to-end LLM, using a new evaluation set, called CustomPlans, of over 200 WikiHow procedures each with a customization need. We find that a simple architecture with two LLM agents used sequentially performs best, one that edits a generic how-to procedure and one that verifies its executability, significantly outperforming (10.5% absolute) an end-to-end prompted LLM. This suggests that LLMs can be configured reasonably effectively for procedure customization. This also suggests that multi-agent editing architectures may be worth exploring further for other custo",
    "link": "https://arxiv.org/abs/2311.09510",
    "context": "Title: One Size Does Not Fit All: Customizing Open-Domain Procedures\nAbstract: arXiv:2311.09510v2 Announce Type: replace  Abstract: How-to procedures, such as how to plant a garden, are now used by millions of users, but sometimes need customizing to meet a user's specific needs, e.g., planting a garden without pesticides. Our goal is to measure and improve an LLM's ability to perform such customization. Our approach is to test several simple multi-LLM-agent architectures for customization, as well as an end-to-end LLM, using a new evaluation set, called CustomPlans, of over 200 WikiHow procedures each with a customization need. We find that a simple architecture with two LLM agents used sequentially performs best, one that edits a generic how-to procedure and one that verifies its executability, significantly outperforming (10.5% absolute) an end-to-end prompted LLM. This suggests that LLMs can be configured reasonably effectively for procedure customization. This also suggests that multi-agent editing architectures may be worth exploring further for other custo",
    "path": "papers/23/11/2311.09510.json",
    "total_tokens": 917,
    "translated_title": "一刀切并非银弹：定制开放领域的操作流程",
    "translated_abstract": "如何操作的流程，比如如何种植花园，现在被数百万用户使用，但有时需要自定义以满足用户的特定需求，例如不使用杀虫剂种植花园。我们的目标是衡量和改进一个LLM执行此类定制的能力。我们的方法是测试几种简单的多LLM代理体系结构，用新的评估集CustomPlans对其进行定制，该数据集由200多个WikiHow操作流程组成，每个流程都有特定的定制需求。我们发现简单的具有两个LLM代理的体系结构表现最佳，它们按顺序使用，一个编辑通用操作流程，另一个验证其可执行性，明显优于端到端提示的LLM（10.5％绝对）。这表明LLM可以被合理有效地配置以进行操作流程的定制。这也表明，多代理编辑体系结构可能值得进一步探讨，以用于其他类型的定制。",
    "tldr": "测试了多种简单的多LLM代理体系结构，发现两个LLM代理按顺序使用的简单结构表现最佳，一个编辑通用操作流程，另一个验证可执行性，在定制操作流程方面取得了显著效果，有望进一步探索多代理编辑体系结构的价值。",
    "en_tdlr": "Tested multiple simple multi-LLM agent architectures and found that a simple structure with two LLM agents used sequentially, one editing a generic procedure and the other verifying its executability, achieved significant improvements in customizing procedures, suggesting the potential value of exploring multi-agent editing architectures further."
}