{
    "title": "Learning to optimize by multi-gradient for multi-objective optimization. (arXiv:2311.00559v1 [cs.LG])",
    "abstract": "The development of artificial intelligence (AI) for science has led to the emergence of learning-based research paradigms, necessitating a compelling reevaluation of the design of multi-objective optimization (MOO) methods. The new generation MOO methods should be rooted in automated learning rather than manual design. In this paper, we introduce a new automatic learning paradigm for optimizing MOO problems, and propose a multi-gradient learning to optimize (ML2O) method, which automatically learns a generator (or mappings) from multiple gradients to update directions. As a learning-based method, ML2O acquires knowledge of local landscapes by leveraging information from the current step and incorporates global experience extracted from historical iteration trajectory data. By introducing a new guarding mechanism, we propose a guarded multi-gradient learning to optimize (GML2O) method, and prove that the iterative sequence generated by GML2O converges to a Pareto critical point. The exp",
    "link": "http://arxiv.org/abs/2311.00559",
    "context": "Title: Learning to optimize by multi-gradient for multi-objective optimization. (arXiv:2311.00559v1 [cs.LG])\nAbstract: The development of artificial intelligence (AI) for science has led to the emergence of learning-based research paradigms, necessitating a compelling reevaluation of the design of multi-objective optimization (MOO) methods. The new generation MOO methods should be rooted in automated learning rather than manual design. In this paper, we introduce a new automatic learning paradigm for optimizing MOO problems, and propose a multi-gradient learning to optimize (ML2O) method, which automatically learns a generator (or mappings) from multiple gradients to update directions. As a learning-based method, ML2O acquires knowledge of local landscapes by leveraging information from the current step and incorporates global experience extracted from historical iteration trajectory data. By introducing a new guarding mechanism, we propose a guarded multi-gradient learning to optimize (GML2O) method, and prove that the iterative sequence generated by GML2O converges to a Pareto critical point. The exp",
    "path": "papers/23/11/2311.00559.json",
    "total_tokens": 939,
    "translated_title": "学习通过多梯度进行多目标优化",
    "translated_abstract": "人工智能（AI）在科学领域的发展导致了学习为基础的研究范式的出现，需要对多目标优化（MOO）方法的设计进行重新评估。新一代的MOO方法应该根植于自动学习而不是手动设计。本文介绍了一种新的自动学习范式用于优化MOO问题，并提出了一种多梯度学习优化（ML2O）方法，该方法通过自动学习多个梯度到更新方向的映射来更新生成器。作为一种基于学习的方法，ML2O通过利用当前步骤的信息获取局部景观知识，并结合从历史迭代轨迹数据中提取的全局经验。通过引入一种新的守护机制，我们提出了一种守护式多梯度学习优化（GML2O）方法，并证明了由GML2O生成的迭代序列收敛到Pareto关键点。",
    "tldr": "本文介绍了一种基于自动学习的新的多目标优化方法，通过多梯度学习优化（ML2O）来实现优化过程，该方法利用当前步骤的信息和历史迭代轨迹数据来获取局部和全局知识，同时引入守护机制（GML2O）以确保生成的迭代序列收敛到Pareto关键点。",
    "en_tdlr": "This paper introduces a new learning-based approach for multi-objective optimization (MOO) and proposes a multi-gradient learning to optimize (ML2O) method. By leveraging local and global knowledge and introducing a guarding mechanism (GML2O), the method aims to converge to a Pareto critical point."
}