{
    "title": "VERVE: Template-based ReflectiVE Rewriting for MotiVational IntErviewing",
    "abstract": "arXiv:2311.08299v2 Announce Type: replace-cross  Abstract: Reflective listening is a fundamental skill that counselors must acquire to achieve proficiency in motivational interviewing (MI). It involves responding in a manner that acknowledges and explores the meaning of what the client has expressed in the conversation. In this work, we introduce the task of counseling response rewriting, which transforms non-reflective statements into reflective responses. We introduce VERVE, a template-based rewriting system with paraphrase-augmented training and adaptive template updating. VERVE first creates a template by identifying and filtering out tokens that are not relevant to reflections and constructs a reflective response using the template. Paraphrase-augmented training allows the model to learn less-strict fillings of masked spans, and adaptive template updating helps discover effective templates for rewriting without significantly removing the original content. Using both automatic and ",
    "link": "https://arxiv.org/abs/2311.08299",
    "context": "Title: VERVE: Template-based ReflectiVE Rewriting for MotiVational IntErviewing\nAbstract: arXiv:2311.08299v2 Announce Type: replace-cross  Abstract: Reflective listening is a fundamental skill that counselors must acquire to achieve proficiency in motivational interviewing (MI). It involves responding in a manner that acknowledges and explores the meaning of what the client has expressed in the conversation. In this work, we introduce the task of counseling response rewriting, which transforms non-reflective statements into reflective responses. We introduce VERVE, a template-based rewriting system with paraphrase-augmented training and adaptive template updating. VERVE first creates a template by identifying and filtering out tokens that are not relevant to reflections and constructs a reflective response using the template. Paraphrase-augmented training allows the model to learn less-strict fillings of masked spans, and adaptive template updating helps discover effective templates for rewriting without significantly removing the original content. Using both automatic and ",
    "path": "papers/23/11/2311.08299.json",
    "total_tokens": 829,
    "translated_title": "VERVE: 基于模板的反思重写用于激励性面谈",
    "translated_abstract": "反思式倾听是心理辅导师必须掌握的基本技能，以在激励性面谈中达到熟练水平。它涉及以一种承认和探索客户对话中表达的意义的方式进行回应。在这项工作中，我们引入了辅导响应重写的任务，将非反思性陈述转化为反思性回应。我们提出了VERVE，一个基于模板的重写系统，具有加入释义的训练和自适应模板更新。VERVE首先通过识别和过滤与反思无关的标记来创建模板，并使用模板构建反思式回应。释义增强训练使模型能够学习对掩码空间进行较不严格的填充，而自适应模板更新则有助于发现重写的有效模板，而不会显著移除原始内容。使用自动和",
    "tldr": "这项工作引入了 counseling response rewriting 任务，提出了基于模板的 VERVE 系统，通过加入释义的训练和自适应模板更新，将非反思性陈述转化为反思性回应。",
    "en_tdlr": "This work introduces the task of counseling response rewriting and proposes VERVE, a template-based system that transforms non-reflective statements into reflective responses through paraphrase-augmented training and adaptive template updating."
}