{
    "title": "Neural Field Dynamics Model for Granular Object Piles Manipulation. (arXiv:2311.00802v1 [cs.RO])",
    "abstract": "We present a learning-based dynamics model for granular material manipulation. Inspired by the Eulerian approach commonly used in fluid dynamics, our method adopts a fully convolutional neural network that operates on a density field-based representation of object piles and pushers, allowing it to exploit the spatial locality of inter-object interactions as well as the translation equivariance through convolution operations. Furthermore, our differentiable action rendering module makes the model fully differentiable and can be directly integrated with a gradient-based trajectory optimization algorithm. We evaluate our model with a wide array of piles manipulation tasks both in simulation and real-world experiments and demonstrate that it significantly exceeds existing latent or particle-based methods in both accuracy and computation efficiency, and exhibits zero-shot generalization capabilities across various environments and tasks.",
    "link": "http://arxiv.org/abs/2311.00802",
    "context": "Title: Neural Field Dynamics Model for Granular Object Piles Manipulation. (arXiv:2311.00802v1 [cs.RO])\nAbstract: We present a learning-based dynamics model for granular material manipulation. Inspired by the Eulerian approach commonly used in fluid dynamics, our method adopts a fully convolutional neural network that operates on a density field-based representation of object piles and pushers, allowing it to exploit the spatial locality of inter-object interactions as well as the translation equivariance through convolution operations. Furthermore, our differentiable action rendering module makes the model fully differentiable and can be directly integrated with a gradient-based trajectory optimization algorithm. We evaluate our model with a wide array of piles manipulation tasks both in simulation and real-world experiments and demonstrate that it significantly exceeds existing latent or particle-based methods in both accuracy and computation efficiency, and exhibits zero-shot generalization capabilities across various environments and tasks.",
    "path": "papers/23/11/2311.00802.json",
    "total_tokens": 930,
    "translated_title": "用于颗粒物体堆积操作的神经场动力学模型",
    "translated_abstract": "我们提出了一种基于学习的颗粒材料操作动力学模型。受流体动力学中常用的欧拉方法的启发，我们的方法采用了一个完全卷积神经网络，它可以在基于密度场的物体堆积和推动器表示上操作，使其能够利用物体之间相互作用的空间局部性以及通过卷积操作进行的平移等变性。此外，我们的可微行为渲染模块使模型完全可微分，并可以直接与基于梯度的轨迹优化算法集成。我们通过在模拟和实际世界实验证明了我们的模型在宽范围的堆积操作任务中明显超过了现有的基于潜变量或基于粒子的方法，在准确性和计算效率上都表现出色，并且在不同环境和任务之间具有零样本泛化能力。",
    "tldr": "本论文提出了一种用于颗粒材料操作的学习动力学模型。该模型采用了基于密度场的表示方法和全卷积神经网络，并具有可微分的动作渲染模块。在模拟和实际实验中的评估结果表明，该模型在准确性和计算效率上都显著超过了现有的方法，并且在不同环境和任务中具有零样本泛化能力。",
    "en_tdlr": "This paper presents a learning-based dynamics model for granular material manipulation. The model uses a density field-based representation and a fully convolutional neural network, along with a differentiable action rendering module. Evaluation results in both simulation and real-world experiments show that the model outperforms existing methods in terms of accuracy and computation efficiency, and exhibits zero-shot generalization capabilities across different environments and tasks."
}