{
    "title": "Nondestructive, quantitative viability analysis of 3D tissue cultures using machine learning image segmentation",
    "abstract": "arXiv:2311.09354v2 Announce Type: replace-cross  Abstract: Ascertaining the collective viability of cells in different cell culture conditions has typically relied on averaging colorimetric indicators and is often reported out in simple binary readouts. Recent research has combined viability assessment techniques with image-based deep-learning models to automate the characterization of cellular properties. However, further development of viability measurements to assess the continuity of possible cellular states and responses to perturbation across cell culture conditions is needed. In this work, we demonstrate an image processing algorithm for quantifying cellular viability in 3D cultures without the need for assay-based indicators. We show that our algorithm performs similarly to a pair of human experts in whole-well images over a range of days and culture matrix compositions. To demonstrate potential utility, we perform a longitudinal study investigating the impact of a known therap",
    "link": "https://arxiv.org/abs/2311.09354",
    "context": "Title: Nondestructive, quantitative viability analysis of 3D tissue cultures using machine learning image segmentation\nAbstract: arXiv:2311.09354v2 Announce Type: replace-cross  Abstract: Ascertaining the collective viability of cells in different cell culture conditions has typically relied on averaging colorimetric indicators and is often reported out in simple binary readouts. Recent research has combined viability assessment techniques with image-based deep-learning models to automate the characterization of cellular properties. However, further development of viability measurements to assess the continuity of possible cellular states and responses to perturbation across cell culture conditions is needed. In this work, we demonstrate an image processing algorithm for quantifying cellular viability in 3D cultures without the need for assay-based indicators. We show that our algorithm performs similarly to a pair of human experts in whole-well images over a range of days and culture matrix compositions. To demonstrate potential utility, we perform a longitudinal study investigating the impact of a known therap",
    "path": "papers/23/11/2311.09354.json",
    "total_tokens": 854,
    "translated_title": "使用机器学习图像分割进行三维组织培养的非破坏性定量活力分析",
    "translated_abstract": "确定不同细胞培养条件下细胞的集体活力通常依赖于平均色度指标，并且通常以简单的二进制读数报告。最近的研究将活力评估技术与基于图像的深度学习模型相结合，以自动化特征化细胞属性。然而，需要进一步发展活力测量技术，以评估可能的细胞状态连续性和对培养条件下的干扰响应。在这项工作中，我们展示了一种图像处理算法，用于在三维培养中量化细胞的活力，无需基于试剂的指示物。我们展示了我们的算法在一系列天数和培养基组成下在全孔图像中的表现与一对人类专家类似。为了展示潜在的实用性，我们进行了一项纵向研究，调查已知疗法的影响",
    "tldr": "本研究提出了一种图像处理算法，用于在三维培养中量化细胞的活力，无需基于试剂的指示物，并且展示了其与人类专家的表现类似。",
    "en_tdlr": "This study presents an image processing algorithm for quantifying cellular viability in 3D cultures without the need for assay-based indicators, showing similar performance to human experts."
}