{
    "title": "Data Diversity Matters for Robust Instruction Tuning",
    "abstract": "Recent works have shown that by curating high quality and diverse instruction tuning datasets, we can significantly improve instruction-following capabilities. However, creating such datasets is difficult and most works rely on manual curation or proprietary language models. Automatic data curation is difficult as it is still not clear how we can define diversity for instruction tuning, how diversity and quality depend on one other, and how we can optimize dataset quality and diversity. To resolve these issue, we propose a new algorithm, Quality-Diversity Instruction Tuning (QDIT). QDIT provides a simple method to simultaneously control dataset diversity and quality, allowing us to conduct an in-depth study on the effect of diversity and quality on instruction tuning performance. From this study we draw two key insights (1) there is a natural tradeoff between data diversity and quality and (2) increasing data diversity significantly improves the worst case instruction following perform",
    "link": "https://arxiv.org/abs/2311.14736",
    "context": "Title: Data Diversity Matters for Robust Instruction Tuning\nAbstract: Recent works have shown that by curating high quality and diverse instruction tuning datasets, we can significantly improve instruction-following capabilities. However, creating such datasets is difficult and most works rely on manual curation or proprietary language models. Automatic data curation is difficult as it is still not clear how we can define diversity for instruction tuning, how diversity and quality depend on one other, and how we can optimize dataset quality and diversity. To resolve these issue, we propose a new algorithm, Quality-Diversity Instruction Tuning (QDIT). QDIT provides a simple method to simultaneously control dataset diversity and quality, allowing us to conduct an in-depth study on the effect of diversity and quality on instruction tuning performance. From this study we draw two key insights (1) there is a natural tradeoff between data diversity and quality and (2) increasing data diversity significantly improves the worst case instruction following perform",
    "path": "papers/23/11/2311.14736.json",
    "total_tokens": 930,
    "translated_title": "数据多样性对鲁棒指令调整至关重要",
    "translated_abstract": "最近的研究表明，通过精选高质量且多样化的指令调整数据集，我们可以显著提高指令跟随能力。然而，创建这样的数据集非常困难，大多数研究依赖于手动精选或专有语言模型。自动数据精选很困难，因为仍不清楚如何为指令调整定义多样性，多样性和质量如何相互关联，以及如何优化数据集的质量和多样性。为解决这些问题，我们提出了一种新算法，质量-多样性指令调整(QDIT)。QDIT提供了一种简单的方法来同时控制数据集的多样性和质量，使我们能够深入研究多样性和质量对指令调整性能的影响。从这项研究中，我们得出了两个关键观点：(1)数据多样性和质量之间存在自然的权衡关系，(2)增加数据多样性显著提高最坏情况下的指令跟随性能。",
    "tldr": "数据多样性对鲁棒指令调整非常重要，我们提出了一种新算法(QDIT)，通过同时控制数据集的多样性和质量，我们深入研究了多样性和质量对指令调整性能的影响，并得出了两个关键观点。",
    "en_tdlr": "Data diversity is crucial for robust instruction tuning. We propose a new algorithm, QDIT, which simultaneously controls dataset diversity and quality, and study the impact of diversity and quality on instruction tuning performance, finding a natural tradeoff between data diversity and quality and a significant improvement in worst case instruction following performance with increased data diversity."
}