{
    "title": "Active Reasoning in an Open-World Environment. (arXiv:2311.02018v1 [cs.AI])",
    "abstract": "Recent advances in vision-language learning have achieved notable success on complete-information question-answering datasets through the integration of extensive world knowledge. Yet, most models operate passively, responding to questions based on pre-stored knowledge. In stark contrast, humans possess the ability to actively explore, accumulate, and reason using both newfound and existing information to tackle incomplete-information questions. In response to this gap, we introduce $Conan$, an interactive open-world environment devised for the assessment of active reasoning. $Conan$ facilitates active exploration and promotes multi-round abductive inference, reminiscent of rich, open-world settings like Minecraft. Diverging from previous works that lean primarily on single-round deduction via instruction following, $Conan$ compels agents to actively interact with their surroundings, amalgamating new evidence with prior knowledge to elucidate events from incomplete observations. Our an",
    "link": "http://arxiv.org/abs/2311.02018",
    "context": "Title: Active Reasoning in an Open-World Environment. (arXiv:2311.02018v1 [cs.AI])\nAbstract: Recent advances in vision-language learning have achieved notable success on complete-information question-answering datasets through the integration of extensive world knowledge. Yet, most models operate passively, responding to questions based on pre-stored knowledge. In stark contrast, humans possess the ability to actively explore, accumulate, and reason using both newfound and existing information to tackle incomplete-information questions. In response to this gap, we introduce $Conan$, an interactive open-world environment devised for the assessment of active reasoning. $Conan$ facilitates active exploration and promotes multi-round abductive inference, reminiscent of rich, open-world settings like Minecraft. Diverging from previous works that lean primarily on single-round deduction via instruction following, $Conan$ compels agents to actively interact with their surroundings, amalgamating new evidence with prior knowledge to elucidate events from incomplete observations. Our an",
    "path": "papers/23/11/2311.02018.json",
    "total_tokens": 877,
    "translated_title": "在开放世界环境中的主动推理",
    "translated_abstract": "近年来，视觉语言学习的最新进展通过整合丰富的世界知识，在完整信息的问答数据集上取得了显著的成功。然而，大部分模型是被动的，根据预存的知识回答问题。相比之下，人类具有主动探索、积累和推理的能力，利用新发现和现有信息解决不完全信息的问题。针对这一差距，我们引入了$Conan$，一个交互式的开放世界环境，用于评估主动推理。$Conan$促进主动探索，并促进多轮预测推理，类似于富有挑战性的开放世界环境如Minecraft。与主要依赖单轮推断的指令跟随的之前工作不同，$Conan$迫使代理与周围环境进行主动互动，将新的证据与先前的知识融合，从不完全的观察中阐明事件。",
    "tldr": "该论文提出了一个交互式的开放世界环境$Conan$，用于评估在不完全信息的情况下的主动推理能力。通过主动探索和多轮预测推理，代理可以利用新发现和现有信息解决问题。",
    "en_tdlr": "This paper introduces an interactive open-world environment, Conan, for evaluating the ability of active reasoning in incomplete-information scenarios. By actively exploring and using multi-round abductive inference, agents can solve problems by integrating new discoveries and existing information."
}