{
    "title": "Adaptive Image Registration: A Hybrid Approach Integrating Deep Learning and Optimization Functions for Enhanced Precision. (arXiv:2311.15497v3 [cs.CV] UPDATED)",
    "abstract": "Image registration has traditionally been done using two distinct approaches: learning based methods, relying on robust deep neural networks, and optimization-based methods, applying complex mathematical transformations to warp images accordingly. Of course, both paradigms offer advantages and disadvantages, and, in this work, we seek to combine their respective strengths into a single streamlined framework, using the outputs of the learning based method as initial parameters for optimization while prioritizing computational power for the image pairs that offer the greatest loss. Our investigations showed improvements of up to 1.6% in test data, while maintaining the same inference time, and a substantial 1.0% points performance gain in deformation field smoothness.",
    "link": "http://arxiv.org/abs/2311.15497",
    "context": "Title: Adaptive Image Registration: A Hybrid Approach Integrating Deep Learning and Optimization Functions for Enhanced Precision. (arXiv:2311.15497v3 [cs.CV] UPDATED)\nAbstract: Image registration has traditionally been done using two distinct approaches: learning based methods, relying on robust deep neural networks, and optimization-based methods, applying complex mathematical transformations to warp images accordingly. Of course, both paradigms offer advantages and disadvantages, and, in this work, we seek to combine their respective strengths into a single streamlined framework, using the outputs of the learning based method as initial parameters for optimization while prioritizing computational power for the image pairs that offer the greatest loss. Our investigations showed improvements of up to 1.6% in test data, while maintaining the same inference time, and a substantial 1.0% points performance gain in deformation field smoothness.",
    "path": "papers/23/11/2311.15497.json",
    "total_tokens": 814,
    "translated_title": "自适应图像配准：将深度学习和优化函数相结合的混合方法以提高精度",
    "translated_abstract": "图像配准传统上采用两种不同的方法：依赖于强大深度神经网络的学习方法和应用复杂数学变换来使图像变形的优化方法。当然，这两种范式都有优点和缺点，在这项工作中，我们试图将它们各自的优势结合在一个简化的框架中，使用学习方法的输出作为优化的初始参数，同时优先考虑对损失最大的图像对进行计算。我们的研究结果显示，在测试数据上提高了1.6%的性能，同时保持相同的推理时间，并且变形场平滑度方面获得了1.0%的性能提升。",
    "tldr": "本研究提出了一种自适应图像配准的混合方法，将深度学习和优化函数相结合，通过使用学习方法的输出作为优化的初始参数，并在计算上重点处理损失最大的图像对，取得了1.6%的性能提升和1.0%的变形场平滑度提升。"
}