{
    "title": "Modelling Cellular Perturbations with the Sparse Additive Mechanism Shift Variational Autoencoder. (arXiv:2311.02794v2 [stat.ML] UPDATED)",
    "abstract": "Generative models of observations under interventions have been a vibrant topic of interest across machine learning and the sciences in recent years. For example, in drug discovery, there is a need to model the effects of diverse interventions on cells in order to characterize unknown biological mechanisms of action. We propose the Sparse Additive Mechanism Shift Variational Autoencoder, SAMS-VAE, to combine compositionality, disentanglement, and interpretability for perturbation models. SAMS-VAE models the latent state of a perturbed sample as the sum of a local latent variable capturing sample-specific variation and sparse global variables of latent intervention effects. Crucially, SAMS-VAE sparsifies these global latent variables for individual perturbations to identify disentangled, perturbation-specific latent subspaces that are flexibly composable. We evaluate SAMS-VAE both quantitatively and qualitatively on a range of tasks using two popular single cell sequencing datasets. In ",
    "link": "http://arxiv.org/abs/2311.02794",
    "context": "Title: Modelling Cellular Perturbations with the Sparse Additive Mechanism Shift Variational Autoencoder. (arXiv:2311.02794v2 [stat.ML] UPDATED)\nAbstract: Generative models of observations under interventions have been a vibrant topic of interest across machine learning and the sciences in recent years. For example, in drug discovery, there is a need to model the effects of diverse interventions on cells in order to characterize unknown biological mechanisms of action. We propose the Sparse Additive Mechanism Shift Variational Autoencoder, SAMS-VAE, to combine compositionality, disentanglement, and interpretability for perturbation models. SAMS-VAE models the latent state of a perturbed sample as the sum of a local latent variable capturing sample-specific variation and sparse global variables of latent intervention effects. Crucially, SAMS-VAE sparsifies these global latent variables for individual perturbations to identify disentangled, perturbation-specific latent subspaces that are flexibly composable. We evaluate SAMS-VAE both quantitatively and qualitatively on a range of tasks using two popular single cell sequencing datasets. In ",
    "path": "papers/23/11/2311.02794.json",
    "total_tokens": 1011,
    "translated_title": "用稀疏添加机制移位变分自动编码器对细胞扰动进行建模",
    "translated_abstract": "近年来，针对干预下观测数据的生成模型在机器学习和科学领域引起了广泛关注。例如，在药物发现中，需要对细胞的多种干预效应进行建模，以揭示未知的生物作用机制。我们提出了稀疏添加机制移位变分自动编码器（SAMS-VAE），以组合复合性、解缠和可解释性进行扰动模型。SAMS-VAE将扰动样本的潜在状态建模为一个局部潜在变量和稀疏全局变量之和，用于捕捉样本特定的变化和潜在干预效应。关键是，SAMS-VAE通过对各个干预的全局潜变量进行稀疏化处理，从而识别出解缠的、干扰特定的潜在子空间，这些子空间具有灵活的组合性。我们在两个流行的单细胞测序数据集上定量和定性评估了SAMS-VAE的性能。",
    "tldr": "本研究提出了一种稀疏添加机制移位变分自动编码器（SAMS-VAE），用于建模细胞的扰动情况，并结合复合性、解缠和可解释性。通过稀疏化处理全局潜变量，SAMS-VAE能够识别出特定于干扰的潜在子空间，并在多个任务上进行了定量和定性评估。"
}