{
    "title": "Detection of keratoconus Diseases using deep Learning. (arXiv:2311.01996v1 [eess.IV])",
    "abstract": "One of the most serious corneal disorders, keratoconus is difficult to diagnose in its early stages and can result in blindness. This illness, which often appears in the second decade of life, affects people of all sexes and races. Convolutional neural networks (CNNs), one of the deep learning approaches, have recently come to light as particularly promising tools for the accurate and timely diagnosis of keratoconus. The purpose of this study was to evaluate how well different D-CNN models identified keratoconus-related diseases. To be more precise, we compared five different CNN-based deep learning architectures (DenseNet201, InceptionV3, MobileNetV2, VGG19, Xception). In our comprehensive experimental analysis, the DenseNet201-based model performed very well in keratoconus disease identification in our extensive experimental research. This model outperformed its D-CNN equivalents, with an astounding accuracy rate of 89.14% in three crucial classes: Keratoconus, Normal, and Suspect. T",
    "link": "http://arxiv.org/abs/2311.01996",
    "context": "Title: Detection of keratoconus Diseases using deep Learning. (arXiv:2311.01996v1 [eess.IV])\nAbstract: One of the most serious corneal disorders, keratoconus is difficult to diagnose in its early stages and can result in blindness. This illness, which often appears in the second decade of life, affects people of all sexes and races. Convolutional neural networks (CNNs), one of the deep learning approaches, have recently come to light as particularly promising tools for the accurate and timely diagnosis of keratoconus. The purpose of this study was to evaluate how well different D-CNN models identified keratoconus-related diseases. To be more precise, we compared five different CNN-based deep learning architectures (DenseNet201, InceptionV3, MobileNetV2, VGG19, Xception). In our comprehensive experimental analysis, the DenseNet201-based model performed very well in keratoconus disease identification in our extensive experimental research. This model outperformed its D-CNN equivalents, with an astounding accuracy rate of 89.14% in three crucial classes: Keratoconus, Normal, and Suspect. T",
    "path": "papers/23/11/2311.01996.json",
    "total_tokens": 894,
    "translated_title": "使用深度学习检测圆锥角膜病",
    "translated_abstract": "圆锥角膜是一种严重的眼角膜疾病，早期诊断困难，可能导致失明。卷积神经网络（CNN）作为深度学习方法之一，最近被认为是准确及时诊断圆锥角膜病的有希望工具。本研究的目的是评估不同D-CNN模型在识别圆锥角膜相关疾病方面的表现。具体来说，我们比较了五种不同基于CNN的深度学习架构（DenseNet201，InceptionV3，MobileNetV2，VGG19，Xception）。在全面的实验分析中，基于DenseNet201的模型在圆锥角膜病识别方面表现出色。该模型的准确率在三种关键类别：圆锥角膜，正常和疑似中的达到了令人惊讶的89.14%。",
    "tldr": "本研究通过比较不同基于CNN的深度学习架构，发现使用基于DenseNet201的模型可以准确识别圆锥角膜病，准确率达到89.14%。"
}