{
    "title": "An Integrated Framework Integrating Monte Carlo Tree Search and Supervised Learning for Train Timetabling Problem. (arXiv:2311.00971v1 [cs.LG])",
    "abstract": "The single-track railway train timetabling problem (TTP) is an important and complex problem. This article proposes an integrated Monte Carlo Tree Search (MCTS) computing framework that combines heuristic methods, unsupervised learning methods, and supervised learning methods for solving TTP in discrete action spaces. This article first describes the mathematical model and simulation system dynamics of TTP, analyzes the characteristics of the solution from the perspective of MCTS, and proposes some heuristic methods to improve MCTS. This article considers these methods as planners in the proposed framework. Secondly, this article utilizes deep convolutional neural networks to approximate the value of nodes and further applies them to the MCTS search process, referred to as learners. The experiment shows that the proposed heuristic MCTS method is beneficial for solving TTP; The algorithm framework that integrates planners and learners can improve the data efficiency of solving TTP; The ",
    "link": "http://arxiv.org/abs/2311.00971",
    "context": "Title: An Integrated Framework Integrating Monte Carlo Tree Search and Supervised Learning for Train Timetabling Problem. (arXiv:2311.00971v1 [cs.LG])\nAbstract: The single-track railway train timetabling problem (TTP) is an important and complex problem. This article proposes an integrated Monte Carlo Tree Search (MCTS) computing framework that combines heuristic methods, unsupervised learning methods, and supervised learning methods for solving TTP in discrete action spaces. This article first describes the mathematical model and simulation system dynamics of TTP, analyzes the characteristics of the solution from the perspective of MCTS, and proposes some heuristic methods to improve MCTS. This article considers these methods as planners in the proposed framework. Secondly, this article utilizes deep convolutional neural networks to approximate the value of nodes and further applies them to the MCTS search process, referred to as learners. The experiment shows that the proposed heuristic MCTS method is beneficial for solving TTP; The algorithm framework that integrates planners and learners can improve the data efficiency of solving TTP; The ",
    "path": "papers/23/11/2311.00971.json",
    "total_tokens": 897,
    "translated_title": "一个集成蒙特卡洛树搜索和监督学习的列车运行图问题综合框架",
    "translated_abstract": "单线铁路列车运行图问题(TTP)是一个重要且复杂的问题。本文提出了一个综合应用启发式方法、无监督学习方法和监督学习方法的蒙特卡洛树搜索(MCTS)计算框架，用于解决离散动作空间下的TTP。本文首先描述了TTP的数学模型和仿真系统动力学，并从MCTS的角度分析了解决方案的特点，提出了一些启发式方法以改进MCTS。本文将这些方法视为所提框架中的规划器。其次，本文利用深度卷积神经网络来近似节点的值，并进一步应用于MCTS搜索过程中，称为学习器。实验证明，所提出的启发式MCTS方法有助于解决TTP；将规划器和学习器集成到算法框架中可以提高解决TTP的数据效率；该算法框架还可以应用于其他类似的优化问题。",
    "tldr": "提出了一个综合应用蒙特卡洛树搜索和监督学习的框架，用于解决列车运行图问题(TTP)。实验证明该框架在提高TTP的解决效率方面是有效的。",
    "en_tdlr": "An integrated framework combining Monte Carlo Tree Search and supervised learning is proposed for solving the train timetabling problem (TTP). Experimental results show that this framework is effective in improving the efficiency of solving TTP."
}