{
    "title": "Multimodal Machine Learning in Image-Based and Clinical Biomedicine: Survey and Prospects. (arXiv:2311.02332v4 [cs.LG] UPDATED)",
    "abstract": "Machine learning (ML) applications in medical artificial intelligence (AI) systems have shifted from traditional and statistical methods to increasing application of deep learning models. This survey navigates the current landscape of multimodal ML, focusing on its profound impact on medical image analysis and clinical decision support systems. Emphasizing challenges and innovations in addressing multimodal representation, fusion, translation, alignment, and co-learning, the paper explores the transformative potential of multimodal models for clinical predictions. It also questions practical implementation of such models, bringing attention to the dynamics between decision support systems and healthcare providers. Despite advancements, challenges such as data biases and the scarcity of \"big data\" in many biomedical domains persist. We conclude with a discussion on effective innovation and collaborative efforts to further the miss",
    "link": "http://arxiv.org/abs/2311.02332",
    "context": "Title: Multimodal Machine Learning in Image-Based and Clinical Biomedicine: Survey and Prospects. (arXiv:2311.02332v4 [cs.LG] UPDATED)\nAbstract: Machine learning (ML) applications in medical artificial intelligence (AI) systems have shifted from traditional and statistical methods to increasing application of deep learning models. This survey navigates the current landscape of multimodal ML, focusing on its profound impact on medical image analysis and clinical decision support systems. Emphasizing challenges and innovations in addressing multimodal representation, fusion, translation, alignment, and co-learning, the paper explores the transformative potential of multimodal models for clinical predictions. It also questions practical implementation of such models, bringing attention to the dynamics between decision support systems and healthcare providers. Despite advancements, challenges such as data biases and the scarcity of \"big data\" in many biomedical domains persist. We conclude with a discussion on effective innovation and collaborative efforts to further the miss",
    "path": "papers/23/11/2311.02332.json",
    "total_tokens": 939,
    "translated_title": "图像和临床生物医学中的多模式机器学习：调查和前景",
    "translated_abstract": "医疗人工智能系统中的机器学习应用已经从传统和统计方法转向越来越多地应用深度学习模型。本调查研究了当前多模式机器学习领域的现状，重点关注其对医学图像分析和临床决策支持系统的深远影响。本文强调了在多模态表示、融合、翻译、对齐和联合学习方面面临的挑战和创新，并探讨了多模态模型对临床预测的转变潜力。同时，本文还对这些模型的实际应用提出了疑问，关注决策支持系统与医疗服务提供者之间的相互影响。尽管取得了进展，但在许多生物医学领域中，数据偏差和“大数据”的稀缺性等挑战仍然存在。最后，本文讨论了有效创新和合作努力以进一步解决这些问题的方法。",
    "tldr": "这项调查研究了多模式机器学习在医学图像分析和临床决策支持系统中的影响，强调了在多模态表示、融合、翻译、对齐和联合学习方面的挑战和创新，以及如何解决数据偏差和“大数据”稀缺性等问题。"
}