{
    "title": "Causal Question Answering with Reinforcement Learning",
    "abstract": "arXiv:2311.02760v2 Announce Type: replace  Abstract: Causal questions inquire about causal relationships between different events or phenomena. They are important for a variety of use cases, including virtual assistants and search engines. However, many current approaches to causal question answering cannot provide explanations or evidence for their answers. Hence, in this paper, we aim to answer causal questions with a causality graph, a large-scale dataset of causal relations between noun phrases along with the relations' provenance data. Inspired by recent, successful applications of reinforcement learning to knowledge graph tasks, such as link prediction and fact-checking, we explore the application of reinforcement learning on a causality graph for causal question answering. We introduce an Actor-Critic-based agent which learns to search through the graph to answer causal questions. We bootstrap the agent with a supervised learning procedure to deal with large action spaces and sp",
    "link": "https://arxiv.org/abs/2311.02760",
    "context": "Title: Causal Question Answering with Reinforcement Learning\nAbstract: arXiv:2311.02760v2 Announce Type: replace  Abstract: Causal questions inquire about causal relationships between different events or phenomena. They are important for a variety of use cases, including virtual assistants and search engines. However, many current approaches to causal question answering cannot provide explanations or evidence for their answers. Hence, in this paper, we aim to answer causal questions with a causality graph, a large-scale dataset of causal relations between noun phrases along with the relations' provenance data. Inspired by recent, successful applications of reinforcement learning to knowledge graph tasks, such as link prediction and fact-checking, we explore the application of reinforcement learning on a causality graph for causal question answering. We introduce an Actor-Critic-based agent which learns to search through the graph to answer causal questions. We bootstrap the agent with a supervised learning procedure to deal with large action spaces and sp",
    "path": "papers/23/11/2311.02760.json",
    "total_tokens": 793,
    "translated_title": "用强化学习进行因果问答",
    "translated_abstract": "因果问题探究不同事件或现象之间的因果关系。它们对各种用例都很重要，包括虚拟助手和搜索引擎。然而，许多当前的因果问答方法不能为其答案提供解释或证据。因此，在这篇论文中，我们旨在用因果图回答因果问题，这是一个关于名词短语之间因果关系的大规模数据集，同时提供关系的来源数据。受最近将强化学习成功应用于知识图任务的启发，例如链接预测和事实检查，我们探讨了将强化学习应用于因果图进行因果问答的方法。我们引入了一种基于演员评论的 agent，它学习通过图搜索来回答因果问题。我们通过监督学习程序引导 agent 处理大规模操作空间和sp",
    "tldr": "本研究通过强化学习在因果图上进行因果问答，引入了一种基于演员评论的 agent，有效解决了当前因果问答方法无法提供解释或证据的问题",
    "en_tdlr": "This paper introduces a method of causal question answering using reinforcement learning on a causality graph, which addresses the limitation of current approaches in providing explanations or evidence for answers."
}