{
    "title": "Generative Artificial Intelligence in Healthcare: Ethical Considerations and Assessment Checklist",
    "abstract": "arXiv:2311.02107v2 Announce Type: replace-cross  Abstract: The widespread use of ChatGPT and other emerging technology powered by generative artificial intelligence (GenAI) has drawn much attention to potential ethical issues, especially in high-stakes applications such as healthcare, but ethical discussions are yet to translate into operationalisable solutions. Furthermore, ongoing ethical discussions often neglect other types of GenAI that have been used to synthesise data (e.g., images) for research and practical purposes, which resolved some ethical issues and exposed others. We conduct a scoping review of ethical discussions on GenAI in healthcare to comprehensively analyse gaps in the current research, and further propose to reduce the gaps by developing a checklist for comprehensive assessment and transparent documentation of ethical discussions in GenAI research. The checklist can be readily integrated into the current peer review and publication system to enhance GenAI researc",
    "link": "https://arxiv.org/abs/2311.02107",
    "context": "Title: Generative Artificial Intelligence in Healthcare: Ethical Considerations and Assessment Checklist\nAbstract: arXiv:2311.02107v2 Announce Type: replace-cross  Abstract: The widespread use of ChatGPT and other emerging technology powered by generative artificial intelligence (GenAI) has drawn much attention to potential ethical issues, especially in high-stakes applications such as healthcare, but ethical discussions are yet to translate into operationalisable solutions. Furthermore, ongoing ethical discussions often neglect other types of GenAI that have been used to synthesise data (e.g., images) for research and practical purposes, which resolved some ethical issues and exposed others. We conduct a scoping review of ethical discussions on GenAI in healthcare to comprehensively analyse gaps in the current research, and further propose to reduce the gaps by developing a checklist for comprehensive assessment and transparent documentation of ethical discussions in GenAI research. The checklist can be readily integrated into the current peer review and publication system to enhance GenAI researc",
    "path": "papers/23/11/2311.02107.json",
    "total_tokens": 863,
    "translated_title": "卫生保健中的生成人工智能：伦理考虑与评估检查表",
    "translated_abstract": "ChatGPT等新兴技术基于生成人工智能（GenAI）的广泛应用引起了对潜在伦理问题的关注，特别是在高风险应用领域，如医疗保健，但伦理讨论尚未转化为可操作的解决方案。此外，正在进行的伦理讨论常常忽视其他类型的GenAI，这些GenAI已被用于合成数据（例如图像）进行研究和实际目的，从而解决了一些伦理问题并暴露了其他问题。我们进行了一项关于医疗保健中GenAI伦理讨论的范围审查，以全面分析当前研究中的差距，并进一步提议通过制定一份检查表来减少这些差距，以全面评估和透明记录GenAI研究中的伦理讨论。这份检查表可以轻松整合到当前的同行评审和发布系统中，以增强GenAI研究。",
    "tldr": "对医疗保健中的生成人工智能（GenAI）进行了伦理讨论的范围审查，提出了一份检查表，以推动伦理讨论的全面评估和透明记录。",
    "en_tdlr": "A scoping review of ethical discussions on generative artificial intelligence (GenAI) in healthcare was conducted, proposing a checklist to advance comprehensive assessment and transparent documentation of ethical discussions."
}