{
    "title": "Constant-time Motion Planning with Anytime Refinement for Manipulation. (arXiv:2311.00837v1 [cs.RO])",
    "abstract": "Robotic manipulators are essential for future autonomous systems, yet limited trust in their autonomy has confined them to rigid, task-specific systems. The intricate configuration space of manipulators, coupled with the challenges of obstacle avoidance and constraint satisfaction, often makes motion planning the bottleneck for achieving reliable and adaptable autonomy. Recently, a class of constant-time motion planners (CTMP) was introduced. These planners employ a preprocessing phase to compute data structures that enable online planning provably guarantee the ability to generate motion plans, potentially sub-optimal, within a user defined time bound. This framework has been demonstrated to be effective in a number of time-critical tasks. However, robotic systems often have more time allotted for planning than the online portion of CTMP requires, time that can be used to improve the solution. To this end, we propose an anytime refinement approach that works in combination with CTMP a",
    "link": "http://arxiv.org/abs/2311.00837",
    "context": "Title: Constant-time Motion Planning with Anytime Refinement for Manipulation. (arXiv:2311.00837v1 [cs.RO])\nAbstract: Robotic manipulators are essential for future autonomous systems, yet limited trust in their autonomy has confined them to rigid, task-specific systems. The intricate configuration space of manipulators, coupled with the challenges of obstacle avoidance and constraint satisfaction, often makes motion planning the bottleneck for achieving reliable and adaptable autonomy. Recently, a class of constant-time motion planners (CTMP) was introduced. These planners employ a preprocessing phase to compute data structures that enable online planning provably guarantee the ability to generate motion plans, potentially sub-optimal, within a user defined time bound. This framework has been demonstrated to be effective in a number of time-critical tasks. However, robotic systems often have more time allotted for planning than the online portion of CTMP requires, time that can be used to improve the solution. To this end, we propose an anytime refinement approach that works in combination with CTMP a",
    "path": "papers/23/11/2311.00837.json",
    "total_tokens": 854,
    "translated_title": "任意时间提炼的恒定时间运动规划和操纵",
    "translated_abstract": "机器人操作器对于未来的自主系统至关重要，但对其自主性的信任有限，将其限制为刚性、任务特定的系统。操作器的复杂配置空间，以及避障和约束满足的挑战经常使得运动规划成为实现可靠和适应性自主性的瓶颈。最近，引入了一类恒定时间运动规划器（CTMP）。这些规划器利用预处理阶段计算数据结构，能够在用户定义的时间限制内生成运动规划，虽然可能并不是最优解。这个框架在许多时间关键的任务中被证明是有效的。然而，机器人系统通常有比CTMP所需的在线部分更多的计划时间，这些时间可以用来改善解决方案。为此，我们提出了一个在CTMP中与任意时间提炼方法结合使用的方法。",
    "tldr": "我们提出了一种任意时间提炼方法，结合恒定时间动作规划器（CTMP）在机器人操作中改善解决方案。这种方法利用机器人系统拥有的多余计划时间来完善运动规划的结果。",
    "en_tdlr": "We propose an anytime refinement approach that works in combination with the constant-time motion planner (CTMP) to improve the solution in robotic manipulation. This approach utilizes the extra planning time available in robotic systems to refine the motion planning results."
}