{
    "title": "An Effective Universal Polynomial Basis for Spectral Graph Neural Networks",
    "abstract": "arXiv:2311.18177v2 Announce Type: replace  Abstract: Spectral Graph Neural Networks (GNNs), also referred to as graph filters have gained increasing prevalence for heterophily graphs. Optimal graph filters rely on Laplacian eigendecomposition for Fourier transform. In an attempt to avert the prohibitive computations, numerous polynomial filters by leveraging distinct polynomials have been proposed to approximate the desired graph filters. However, polynomials in the majority of polynomial filters are predefined and remain fixed across all graphs, failing to accommodate the diverse heterophily degrees across different graphs. To tackle this issue, we first investigate the correlation between polynomial bases of desired graph filters and the degrees of graph heterophily via a thorough theoretical analysis. Afterward, we develop an adaptive heterophily basis by incorporating graph heterophily degrees. Subsequently, we integrate this heterophily basis with the homophily basis, creating a u",
    "link": "https://arxiv.org/abs/2311.18177",
    "context": "Title: An Effective Universal Polynomial Basis for Spectral Graph Neural Networks\nAbstract: arXiv:2311.18177v2 Announce Type: replace  Abstract: Spectral Graph Neural Networks (GNNs), also referred to as graph filters have gained increasing prevalence for heterophily graphs. Optimal graph filters rely on Laplacian eigendecomposition for Fourier transform. In an attempt to avert the prohibitive computations, numerous polynomial filters by leveraging distinct polynomials have been proposed to approximate the desired graph filters. However, polynomials in the majority of polynomial filters are predefined and remain fixed across all graphs, failing to accommodate the diverse heterophily degrees across different graphs. To tackle this issue, we first investigate the correlation between polynomial bases of desired graph filters and the degrees of graph heterophily via a thorough theoretical analysis. Afterward, we develop an adaptive heterophily basis by incorporating graph heterophily degrees. Subsequently, we integrate this heterophily basis with the homophily basis, creating a u",
    "path": "papers/23/11/2311.18177.json",
    "total_tokens": 876,
    "translated_title": "一种有效的用于谱图神经网络的通用多项式基础",
    "translated_abstract": "谱图神经网络（GNNs），也称为图滤波器，在异构图上越来越普遍。最优图滤波器依赖于拉普拉斯特征分解进行傅立叶变换。为了避免繁琐的计算，许多多项式滤波器通过利用不同的多项式来近似所需的图滤波器。然而，大多数多项式滤波器中的多项式是预定义的，并且在所有图上保持不变，无法适应不同图之间的多样的异质性程度。为了解决这个问题，我们首先通过彻底的理论分析调查所需图滤波器的多项式基础与图异质性度量之间的相关性。随后，我们通过合并图异质性度量开发出一种自适应的异质性基础。随后，我们将这种异质性基础与同质性基础相结合，创建一个通用的多项式基础。",
    "tldr": "通过研究图滤波器的多项式基础与图异质性度量之间的关联，本研究提出了一种自适应的异质性基础，可以有效地适应不同图之间的异质性程度。"
}