{
    "title": "XAI-CLASS: Explanation-Enhanced Text Classification with Extremely Weak Supervision. (arXiv:2311.00189v1 [cs.CL])",
    "abstract": "Text classification aims to effectively categorize documents into pre-defined categories. Traditional methods for text classification often rely on large amounts of manually annotated training data, making the process time-consuming and labor-intensive. To address this issue, recent studies have focused on weakly-supervised and extremely weakly-supervised settings, which require minimal or no human annotation, respectively. In previous methods of weakly supervised text classification, pseudo-training data is generated by assigning pseudo-labels to documents based on their alignment (e.g., keyword matching) with specific classes. However, these methods ignore the importance of incorporating the explanations of the generated pseudo-labels, or saliency of individual words, as additional guidance during the text classification training process. To address this limitation, we propose XAI-CLASS, a novel explanation-enhanced extremely weakly-supervised text classification method that incorpor",
    "link": "http://arxiv.org/abs/2311.00189",
    "context": "Title: XAI-CLASS: Explanation-Enhanced Text Classification with Extremely Weak Supervision. (arXiv:2311.00189v1 [cs.CL])\nAbstract: Text classification aims to effectively categorize documents into pre-defined categories. Traditional methods for text classification often rely on large amounts of manually annotated training data, making the process time-consuming and labor-intensive. To address this issue, recent studies have focused on weakly-supervised and extremely weakly-supervised settings, which require minimal or no human annotation, respectively. In previous methods of weakly supervised text classification, pseudo-training data is generated by assigning pseudo-labels to documents based on their alignment (e.g., keyword matching) with specific classes. However, these methods ignore the importance of incorporating the explanations of the generated pseudo-labels, or saliency of individual words, as additional guidance during the text classification training process. To address this limitation, we propose XAI-CLASS, a novel explanation-enhanced extremely weakly-supervised text classification method that incorpor",
    "path": "papers/23/11/2311.00189.json",
    "total_tokens": 860,
    "translated_title": "XAI-CLASS：具有极弱监督的解释增强文本分类",
    "translated_abstract": "文本分类旨在将文档有效地分类到预定义的类别中。传统的文本分类方法通常依赖于大量手动注释的训练数据，使得这个过程耗时且劳动密集。为了解决这个问题，最近的研究集中在弱监督和极弱监督环境中，分别需要最少或没有人工注释。在先前的弱监督文本分类方法中，通过将伪标签分配给与特定类别对齐（例如，关键词匹配）的文档来生成伪训练数据。然而，这些方法忽略了在文本分类训练过程中将生成的伪标签的解释或个体单词的显著性作为额外指导的重要性。为了解决这个局限性，我们提出了XAI-CLASS，这是一种新颖的解释增强极弱监督文本分类方法。",
    "tldr": "XAI-CLASS是一种解释增强的极弱监督文本分类方法，通过在训练过程中结合生成的伪标签的解释和单词的显著性，实现了在最小或没有人工注释的情况下进行文本分类。"
}