{
    "title": "StableFDG: Style and Attention Based Learning for Federated Domain Generalization. (arXiv:2311.00227v1 [cs.LG])",
    "abstract": "Traditional federated learning (FL) algorithms operate under the assumption that the data distributions at training (source domains) and testing (target domain) are the same. The fact that domain shifts often occur in practice necessitates equipping FL methods with a domain generalization (DG) capability. However, existing DG algorithms face fundamental challenges in FL setups due to the lack of samples/domains in each client's local dataset. In this paper, we propose StableFDG, a style and attention based learning strategy for accomplishing federated domain generalization, introducing two key contributions. The first is style-based learning, which enables each client to explore novel styles beyond the original source domains in its local dataset, improving domain diversity based on the proposed style sharing, shifting, and exploration strategies. Our second contribution is an attention-based feature highlighter, which captures the similarities between the features of data samples in t",
    "link": "http://arxiv.org/abs/2311.00227",
    "context": "Title: StableFDG: Style and Attention Based Learning for Federated Domain Generalization. (arXiv:2311.00227v1 [cs.LG])\nAbstract: Traditional federated learning (FL) algorithms operate under the assumption that the data distributions at training (source domains) and testing (target domain) are the same. The fact that domain shifts often occur in practice necessitates equipping FL methods with a domain generalization (DG) capability. However, existing DG algorithms face fundamental challenges in FL setups due to the lack of samples/domains in each client's local dataset. In this paper, we propose StableFDG, a style and attention based learning strategy for accomplishing federated domain generalization, introducing two key contributions. The first is style-based learning, which enables each client to explore novel styles beyond the original source domains in its local dataset, improving domain diversity based on the proposed style sharing, shifting, and exploration strategies. Our second contribution is an attention-based feature highlighter, which captures the similarities between the features of data samples in t",
    "path": "papers/23/11/2311.00227.json",
    "total_tokens": 1001,
    "translated_title": "StableFDG:基于风格和注意力的联邦领域泛化学习",
    "translated_abstract": "传统的联邦学习算法在训练（源域）和测试（目标域）中假设数据分布相同。然而，实际应用中常常发生域偏移，因此需要在联邦学习方法中引入领域泛化能力。然而，由于每个客户端的本地数据集中缺乏样本/域，现有的领域泛化算法在联邦学习环境中面临基本挑战。在本文中，我们提出了基于风格和注意力的学习策略StableFDG，用于实现联邦领域泛化，并引入了两个关键贡献。第一个是基于风格的学习，它使每个客户端能够在本地数据集中超越原始源域，探索新颖的风格，基于提出的风格共享、转移和探索策略改进了领域多样性。我们的第二个贡献是基于注意力的特征突出器，它捕捉数据样本特征之间的相似性。",
    "tldr": "本文提出了StableFDG，一种基于风格和注意力的学习策略，用于实现联邦领域泛化。其中，基于风格的学习将每个客户端的本地数据集中的样式扩展到原始源域之外，并通过风格共享、转移和探索策略改进了领域多样性。基于注意力的特征突出器捕捉了数据样本特征之间的相似性。",
    "en_tdlr": "This paper proposes StableFDG, a style and attention based learning strategy for federated domain generalization. The style-based learning enables each client to explore novel styles beyond the original source domains, improving domain diversity through style sharing, shifting, and exploration strategies. The attention-based feature highlighter captures similarities between data sample features."
}