{
    "title": "Can AI Mitigate Human Perceptual Biases? A Pilot Study. (arXiv:2311.00706v1 [cs.HC])",
    "abstract": "We present results from a pilot experiment to measure if machine recommendations can debias human perceptual biases in visualization tasks. We specifically studied the ``pull-down'' effect, i.e., people underestimate the average position of lines, for the task of estimating the ensemble average of data points in line charts. These line charts can show for example temperature or precipitation in 12 months. Six participants estimated ensemble averages with or without an AI assistant. The assistant, when available, responded at three different speeds to assemble the conditions of a human collaborator who may delay his or her responses. Our pilot study showed that participants were faster with AI assistance in ensemble tasks, compared to the baseline without AI assistance. Although ``pull-down'' biases were reduced, the effect of AI assistance was not statistically significant. Also, delaying AI responses had no significant impact on human decision accuracy. We discuss the implications of ",
    "link": "http://arxiv.org/abs/2311.00706",
    "context": "Title: Can AI Mitigate Human Perceptual Biases? A Pilot Study. (arXiv:2311.00706v1 [cs.HC])\nAbstract: We present results from a pilot experiment to measure if machine recommendations can debias human perceptual biases in visualization tasks. We specifically studied the ``pull-down'' effect, i.e., people underestimate the average position of lines, for the task of estimating the ensemble average of data points in line charts. These line charts can show for example temperature or precipitation in 12 months. Six participants estimated ensemble averages with or without an AI assistant. The assistant, when available, responded at three different speeds to assemble the conditions of a human collaborator who may delay his or her responses. Our pilot study showed that participants were faster with AI assistance in ensemble tasks, compared to the baseline without AI assistance. Although ``pull-down'' biases were reduced, the effect of AI assistance was not statistically significant. Also, delaying AI responses had no significant impact on human decision accuracy. We discuss the implications of ",
    "path": "papers/23/11/2311.00706.json",
    "total_tokens": 962,
    "translated_title": "AI是否可以缓解人类感知偏差？一项实验性研究。",
    "translated_abstract": "我们展示了一项旨在衡量机器推荐是否能够纠正人类感知偏差的试点实验结果。我们特别研究了“下拉”效应，即人们低估了线的平均位置，在线图中估计数据点的集合平均值的任务中。这些线图可以显示例如12个月内的温度或降水量。六名参与者使用或不使用AI助手估计集合平均值。当有AI助手时，助手以不同速度回应，以模拟可能延迟回应的人类协作者的条件。我们的试点研究表明，在集合任务中，参与者使用AI助手比没有使用AI助手的基准组更快。尽管“下拉”偏差得到了减少，但AI助手的影响并不具有统计学意义。此外，延迟AI回应对人类决策准确性没有显著影响。我们讨论了这些结果的影响。",
    "tldr": "本研究试图调查机器推荐是否可以缓解人类感知偏差。通过一项实验，发现AI助手在集合任务中的使用可以提高参与者的工作效率，但并没有通过统计学分析证明AI助手可以显著降低“下拉”偏差。此外，延迟AI回应也没有对人类决策准确性产生显著影响。",
    "en_tdlr": "This study investigates whether machine recommendations can mitigate human perceptual biases. Through a pilot experiment, it was found that the use of an AI assistant in ensemble tasks can improve participants' efficiency, but there was no statistical evidence to support that the AI assistant significantly reduces \"pull-down\" biases. Furthermore, delaying AI responses had no significant impact on human decision accuracy."
}