{
    "title": "Discourse Relations Classification and Cross-Framework Discourse Relation Classification Through the Lens of Cognitive Dimensions: An Empirical Investigation. (arXiv:2311.00451v1 [cs.CL])",
    "abstract": "Existing discourse formalisms use different taxonomies of discourse relations, which require expert knowledge to understand, posing a challenge for annotation and automatic classification. We show that discourse relations can be effectively captured by some simple cognitively inspired dimensions proposed by Sanders et al.(2018). Our experiments on cross-framework discourse relation classification (PDTB & RST) demonstrate that it is possible to transfer knowledge of discourse relations for one framework to another framework by means of these dimensions, in spite of differences in discourse segmentation of the two frameworks. This manifests the effectiveness of these dimensions in characterizing discourse relations across frameworks. Ablation studies reveal that different dimensions influence different types of discourse relations. The patterns can be explained by the role of dimensions in characterizing and distinguishing different relations. We also report our experimental results on a",
    "link": "http://arxiv.org/abs/2311.00451",
    "context": "Title: Discourse Relations Classification and Cross-Framework Discourse Relation Classification Through the Lens of Cognitive Dimensions: An Empirical Investigation. (arXiv:2311.00451v1 [cs.CL])\nAbstract: Existing discourse formalisms use different taxonomies of discourse relations, which require expert knowledge to understand, posing a challenge for annotation and automatic classification. We show that discourse relations can be effectively captured by some simple cognitively inspired dimensions proposed by Sanders et al.(2018). Our experiments on cross-framework discourse relation classification (PDTB & RST) demonstrate that it is possible to transfer knowledge of discourse relations for one framework to another framework by means of these dimensions, in spite of differences in discourse segmentation of the two frameworks. This manifests the effectiveness of these dimensions in characterizing discourse relations across frameworks. Ablation studies reveal that different dimensions influence different types of discourse relations. The patterns can be explained by the role of dimensions in characterizing and distinguishing different relations. We also report our experimental results on a",
    "path": "papers/23/11/2311.00451.json",
    "total_tokens": 804,
    "translated_title": "论述关系分类和通过认知维度对框架间论述关系分类的跨界考察",
    "translated_abstract": "现有的论述形式使用不同的论述关系分类法，需要专家知识才能理解，给标注和自动分类带来挑战。我们表明，一些由Sanders等人（2018）提出的简单认知启发维度可以有效地捕捉论述关系。我们在PDTB和RST两个框架上进行的跨界论述关系分类实验证明，通过这些维度可以将一个框架中的论述关系知识转移到另一个框架中，尽管两个框架的论述划分存在差异。这表明了这些维度在表征不同框架中的论述关系方面的有效性。消融实验显示不同维度影响不同类型的论述关系。这些模式可以通过维度在表征和区分不同关系中的作用来解释。我们还报告了我们在一个框架中进行的实验结果。",
    "tldr": "通过认知维度，我们可以有效地捕捉和分类不同框架间的论述关系，这为标注和自动分类带来了便利。",
    "en_tdlr": "By using cognitive dimensions, we can effectively capture and classify discourse relations across different frameworks, which facilitates annotation and automatic classification."
}