{
    "title": "Entity Alignment Method of Science and Technology Patent based on Graph Convolution Network and Information Fusion. (arXiv:2311.00300v1 [cs.CL])",
    "abstract": "The entity alignment of science and technology patents aims to link the equivalent entities in the knowledge graph of different science and technology patent data sources. Most entity alignment methods only use graph neural network to obtain the embedding of graph structure or use attribute text description to obtain semantic representation, ignoring the process of multi-information fusion in science and technology patents. In order to make use of the graphic structure and auxiliary information such as the name, description and attribute of the patent entity, this paper proposes an entity alignment method based on the graph convolution network for science and technology patent information fusion. Through the graph convolution network and BERT model, the structure information and entity attribute information of the science and technology patent knowledge graph are embedded and represented to achieve multi-information fusion, thus improving the performance of entity alignment. Experiment",
    "link": "http://arxiv.org/abs/2311.00300",
    "context": "Title: Entity Alignment Method of Science and Technology Patent based on Graph Convolution Network and Information Fusion. (arXiv:2311.00300v1 [cs.CL])\nAbstract: The entity alignment of science and technology patents aims to link the equivalent entities in the knowledge graph of different science and technology patent data sources. Most entity alignment methods only use graph neural network to obtain the embedding of graph structure or use attribute text description to obtain semantic representation, ignoring the process of multi-information fusion in science and technology patents. In order to make use of the graphic structure and auxiliary information such as the name, description and attribute of the patent entity, this paper proposes an entity alignment method based on the graph convolution network for science and technology patent information fusion. Through the graph convolution network and BERT model, the structure information and entity attribute information of the science and technology patent knowledge graph are embedded and represented to achieve multi-information fusion, thus improving the performance of entity alignment. Experiment",
    "path": "papers/23/11/2311.00300.json",
    "total_tokens": 785,
    "translated_title": "基于图卷积网络和信息融合的科技专利实体对齐方法",
    "translated_abstract": "科技专利的实体对齐旨在链接不同科技专利数据源的知识图中的等价实体。大多数实体对齐方法仅使用图神经网络获取图结构的嵌入或使用属性文本描述获取语义表示，忽视了科技专利中多信息融合的过程。为了利用图结构和专利实体的名称、描述和属性等辅助信息，本文提出了一种基于图卷积网络的科技专利信息融合的实体对齐方法。通过图卷积网络和BERT模型，将科技专利知识图的结构信息和实体属性信息嵌入和表示，实现多信息融合，从而提高实体对齐的性能。",
    "tldr": "本研究提出了一种使用图卷积网络和信息融合的方法来实现科技专利的实体对齐，通过将知识图的结构信息和实体属性信息嵌入和表示，从而提高实体对齐的性能。",
    "en_tdlr": "This study proposes a method using graph convolution network and information fusion to achieve entity alignment of science and technology patents, which improves the performance of entity alignment by embedding and representing the structure information and entity attribute information of the knowledge graph."
}