{
    "title": "Causal inference with Machine Learning-Based Covariate Representation. (arXiv:2311.01709v1 [stat.ME])",
    "abstract": "Utilizing covariate information has been a powerful approach to improve the efficiency and accuracy for causal inference, which support massive amount of randomized experiments run on data-driven enterprises. However, state-of-art approaches can become practically unreliable when the dimension of covariate increases to just 50, whereas experiments on large platforms can observe even higher dimension of covariate. We propose a machine-learning-assisted covariate representation approach that can effectively make use of historical experiment or observational data that are run on the same platform to understand which lower dimensions can effectively represent the higher-dimensional covariate. We then propose design and estimation methods with the covariate representation. We prove statistically reliability and performance guarantees for the proposed methods. The empirical performance is demonstrated using numerical experiments.",
    "link": "http://arxiv.org/abs/2311.01709",
    "context": "Title: Causal inference with Machine Learning-Based Covariate Representation. (arXiv:2311.01709v1 [stat.ME])\nAbstract: Utilizing covariate information has been a powerful approach to improve the efficiency and accuracy for causal inference, which support massive amount of randomized experiments run on data-driven enterprises. However, state-of-art approaches can become practically unreliable when the dimension of covariate increases to just 50, whereas experiments on large platforms can observe even higher dimension of covariate. We propose a machine-learning-assisted covariate representation approach that can effectively make use of historical experiment or observational data that are run on the same platform to understand which lower dimensions can effectively represent the higher-dimensional covariate. We then propose design and estimation methods with the covariate representation. We prove statistically reliability and performance guarantees for the proposed methods. The empirical performance is demonstrated using numerical experiments.",
    "path": "papers/23/11/2311.01709.json",
    "total_tokens": 756,
    "translated_title": "基于机器学习的协变量表示的因果推断",
    "translated_abstract": "利用协变量信息是提高因果推断效率和准确性的强有力方法，可支持在数据驱动企业上运行的大量随机实验。然而，在协变量维度增加到50时，最先进的方法在实际应用中可能变得不可靠，而大型平台上的实验可能观察到更高维度的协变量。我们提出了一种机器学习辅助的协变量表示方法，可以有效利用在同一平台上运行的历史实验或观测数据，了解哪些低维度可以有效地表示高维协变量。然后，我们提出了设计和估计方法来处理协变量表示。我们为所提出的方法提供了统计可靠性和性能保证。数值实验验证了其实证性能。",
    "tldr": "本文提出了一种基于机器学习的协变量表示方法，可以在大维度协变量的情况下进行可靠的因果推断，并通过数值实验验证了其效果。",
    "en_tdlr": "This paper proposes a machine learning-based covariate representation approach that enables reliable causal inference even in high-dimensional covariate scenarios, and its performance is demonstrated through numerical experiments."
}