{
    "title": "Model-driven Engineering for Machine Learning Components: A Systematic Literature Review. (arXiv:2311.00284v1 [cs.SE])",
    "abstract": "Context: Machine Learning (ML) has become widely adopted as a component in many modern software applications. Due to the large volumes of data available, organizations want to increasingly leverage their data to extract meaningful insights and enhance business profitability. ML components enable predictive capabilities, anomaly detection, recommendation, accurate image and text processing, and informed decision-making. However, developing systems with ML components is not trivial; it requires time, effort, knowledge, and expertise in ML, data processing, and software engineering. There have been several studies on the use of model-driven engineering (MDE) techniques to address these challenges when developing traditional software and cyber-physical systems. Recently, there has been a growing interest in applying MDE for systems with ML components. Objective: The goal of this study is to further explore the promising intersection of MDE with ML (MDE4ML) through a systematic literature r",
    "link": "http://arxiv.org/abs/2311.00284",
    "context": "Title: Model-driven Engineering for Machine Learning Components: A Systematic Literature Review. (arXiv:2311.00284v1 [cs.SE])\nAbstract: Context: Machine Learning (ML) has become widely adopted as a component in many modern software applications. Due to the large volumes of data available, organizations want to increasingly leverage their data to extract meaningful insights and enhance business profitability. ML components enable predictive capabilities, anomaly detection, recommendation, accurate image and text processing, and informed decision-making. However, developing systems with ML components is not trivial; it requires time, effort, knowledge, and expertise in ML, data processing, and software engineering. There have been several studies on the use of model-driven engineering (MDE) techniques to address these challenges when developing traditional software and cyber-physical systems. Recently, there has been a growing interest in applying MDE for systems with ML components. Objective: The goal of this study is to further explore the promising intersection of MDE with ML (MDE4ML) through a systematic literature r",
    "path": "papers/23/11/2311.00284.json",
    "total_tokens": 870,
    "translated_title": "机器学习组件的模型驱动工程：系统文献综述",
    "translated_abstract": "背景：机器学习在许多现代软件应用中作为组件被广泛采用。由于可用的数据量庞大，组织希望越来越多地利用数据提取有意义的洞察和增强业务利润能力。机器学习组件实现了预测能力、异常检测、推荐、准确的图像和文本处理以及知情决策。然而，开发带有机器学习组件的系统并不简单；它需要时间、精力、机器学习、数据处理和软件工程方面的知识和专业知识。之前已经有几项研究针对在开发传统软件和物理系统时应用模型驱动工程（MDE）技术来解决这些挑战。最近，对于将MDE应用于带有机器学习组件的系统的兴趣越来越大。目标：本研究的目标是通过系统文献综述进一步探索MDE与机器学习（MDE4ML）的有前途的交叉领域。",
    "tldr": "这篇论文通过系统文献综述进一步探索了模型驱动工程与机器学习的有前途的交叉领域。",
    "en_tdlr": "This paper explores the promising intersection of Model-driven Engineering (MDE) with Machine Learning (ML) through a systematic literature review."
}