{
    "title": "ATHENA: Mathematical Reasoning with Thought Expansion. (arXiv:2311.01036v1 [cs.CL])",
    "abstract": "Solving math word problems depends on how to articulate the problems, the lens through which models view human linguistic expressions. Real-world settings count on such a method even more due to the diverse practices of the same mathematical operations. Earlier works constrain available thinking processes by limited prediction strategies without considering their significance in acquiring mathematical knowledge. We introduce Attention-based THought Expansion Network Architecture (ATHENA) to tackle the challenges of real-world practices by mimicking human thought expansion mechanisms in the form of neural network propagation. A thought expansion recurrently generates the candidates carrying the thoughts of possible math expressions driven from the previous step and yields reasonable thoughts by selecting the valid pathways to the goal. Our experiments show that ATHENA achieves a new state-of-the-art stage toward the ideal model that is compelling in variant questions even when the infor",
    "link": "http://arxiv.org/abs/2311.01036",
    "context": "Title: ATHENA: Mathematical Reasoning with Thought Expansion. (arXiv:2311.01036v1 [cs.CL])\nAbstract: Solving math word problems depends on how to articulate the problems, the lens through which models view human linguistic expressions. Real-world settings count on such a method even more due to the diverse practices of the same mathematical operations. Earlier works constrain available thinking processes by limited prediction strategies without considering their significance in acquiring mathematical knowledge. We introduce Attention-based THought Expansion Network Architecture (ATHENA) to tackle the challenges of real-world practices by mimicking human thought expansion mechanisms in the form of neural network propagation. A thought expansion recurrently generates the candidates carrying the thoughts of possible math expressions driven from the previous step and yields reasonable thoughts by selecting the valid pathways to the goal. Our experiments show that ATHENA achieves a new state-of-the-art stage toward the ideal model that is compelling in variant questions even when the infor",
    "path": "papers/23/11/2311.01036.json",
    "total_tokens": 845,
    "translated_title": "ATHENA: 数学推理与思维扩展",
    "translated_abstract": "解决数学问题取决于如何表达问题，以及模型如何看待人类语言表达的角度。实际世界的情境更依赖这种方法，因为同样的数学运算有多种实践方式。以往的研究通过限制预测策略来限制可用的思维过程，而忽略了这些策略在获取数学知识方面的重要性。我们引入了基于注意力的思维扩展网络架构 (ATHENA) 来应对现实世界中的挑战，模仿神经网络传播的形式来模拟人类的思维扩展机制。思维扩展通过递归生成候选数学表达式，从上一步驱动并选择通向目标的有效路径，产生合理的思维。我们的实验表明，ATHENA 在各种问题中都取得了全新的最先进水平，即使在信息有限的情况下，也能给出令人信服的答案。",
    "tldr": "ATHENA是一种基于注意力机制的思维扩展网络架构，通过模拟人类的思维扩展机制来解决数学推理中的挑战，它能够产生合理的思考路径以解决实际世界的数学问题。",
    "en_tdlr": "ATHENA is an attention-based thought expansion network architecture that mimics human thought expansion mechanisms to tackle the challenges of mathematical reasoning, generating reasonable thinking paths to solve real-world math problems."
}