{
    "title": "Confident Naturalness Explanation (CNE): A Framework to Explain and Assess Patterns Forming Naturalness",
    "abstract": "Protected natural areas are regions that have been minimally affected by human activities such as urbanization, agriculture, and other human interventions. To better understand and map the naturalness of these areas, machine learning models can be used to analyze satellite imagery. Specifically, explainable machine learning methods show promise in uncovering patterns that contribute to the concept of naturalness within these protected environments. Additionally, addressing the uncertainty inherent in machine learning models is crucial for a comprehensive understanding of this concept. However, existing approaches have limitations. They either fail to provide explanations that are both valid and objective or struggle to offer a quantitative metric that accurately measures the contribution of specific patterns to naturalness, along with the associated confidence. In this paper, we propose a novel framework called the Confident Naturalness Explanation (CNE) framework. This framework combi",
    "link": "https://arxiv.org/abs/2311.08936",
    "context": "Title: Confident Naturalness Explanation (CNE): A Framework to Explain and Assess Patterns Forming Naturalness\nAbstract: Protected natural areas are regions that have been minimally affected by human activities such as urbanization, agriculture, and other human interventions. To better understand and map the naturalness of these areas, machine learning models can be used to analyze satellite imagery. Specifically, explainable machine learning methods show promise in uncovering patterns that contribute to the concept of naturalness within these protected environments. Additionally, addressing the uncertainty inherent in machine learning models is crucial for a comprehensive understanding of this concept. However, existing approaches have limitations. They either fail to provide explanations that are both valid and objective or struggle to offer a quantitative metric that accurately measures the contribution of specific patterns to naturalness, along with the associated confidence. In this paper, we propose a novel framework called the Confident Naturalness Explanation (CNE) framework. This framework combi",
    "path": "papers/23/11/2311.08936.json",
    "total_tokens": 864,
    "translated_title": "自然度解释与评估模型（CNE）：解释和评估形成自然度的模式的框架",
    "translated_abstract": "受人类活动（如城市化、农业和其他人为干预）最小影响的自然保护区是指那些地区。为了更好地理解和绘制这些区域的自然度，可以使用机器学习模型分析卫星图像。具体而言，可解释的机器学习方法在揭示这些保护环境中有助于自然度概念的模式方面显示出了潜力。此外，解决与机器学习模型固有的不确定性相关的问题对于全面了解这个概念至关重要。然而，现有方法存在局限性。他们要么无法提供既有效又客观的解释，要么难以提供准确衡量特定模式对自然度贡献的定量指标以及相关的置信度。在本文中，我们提出了一种新颖的框架，称为自然度解释与评估模型（CNE）。",
    "tldr": "本文提出了一个新的框架，称为自然度解释与评估模型（CNE）。该框架利用可解释的机器学习方法来分析卫星图像，以解释和评估形成自然度的模式，并带有相应的置信度。",
    "en_tdlr": "This paper proposes a novel framework, called the Confident Naturalness Explanation (CNE) framework, which utilizes explainable machine learning methods to analyze satellite imagery, to explain and assess patterns forming naturalness, along with associated confidence."
}