{
    "title": "Personalized Predictions of Glioblastoma Infiltration: Mathematical Models, Physics-Informed Neural Networks and Multimodal Scans. (arXiv:2311.16536v2 [cs.LG] UPDATED)",
    "abstract": "Predicting the infiltration of Glioblastoma (GBM) from medical MRI scans is crucial for understanding tumor growth dynamics and designing personalized radiotherapy treatment plans.Mathematical models of GBM growth can complement the data in the prediction of spatial distributions of tumor cells. However, this requires estimating patient-specific parameters of the model from clinical data, which is a challenging inverse problem due to limited temporal data and the limited time between imaging and diagnosis. This work proposes a method that uses Physics-Informed Neural Networks (PINNs) to estimate patient-specific parameters of a reaction-diffusion PDE model of GBM growth from a single 3D structural MRI snapshot. PINNs embed both the data and the PDE into a loss function, thus integrating theory and data. Key innovations include the identification and estimation of characteristic non-dimensional parameters, a pre-training step that utilizes the non-dimensional parameters and a fine-tunin",
    "link": "http://arxiv.org/abs/2311.16536",
    "context": "Title: Personalized Predictions of Glioblastoma Infiltration: Mathematical Models, Physics-Informed Neural Networks and Multimodal Scans. (arXiv:2311.16536v2 [cs.LG] UPDATED)\nAbstract: Predicting the infiltration of Glioblastoma (GBM) from medical MRI scans is crucial for understanding tumor growth dynamics and designing personalized radiotherapy treatment plans.Mathematical models of GBM growth can complement the data in the prediction of spatial distributions of tumor cells. However, this requires estimating patient-specific parameters of the model from clinical data, which is a challenging inverse problem due to limited temporal data and the limited time between imaging and diagnosis. This work proposes a method that uses Physics-Informed Neural Networks (PINNs) to estimate patient-specific parameters of a reaction-diffusion PDE model of GBM growth from a single 3D structural MRI snapshot. PINNs embed both the data and the PDE into a loss function, thus integrating theory and data. Key innovations include the identification and estimation of characteristic non-dimensional parameters, a pre-training step that utilizes the non-dimensional parameters and a fine-tunin",
    "path": "papers/23/11/2311.16536.json",
    "total_tokens": 990,
    "translated_title": "个性化预测胶质母细胞瘤浸润:数学模型、物理信息神经网络和多模态扫描",
    "translated_abstract": "预测胶质母细胞瘤（GBM）从医学MRI扫描中的浸润对于理解肿瘤生长动力学和设计个体化放射治疗计划至关重要。GBM生长的数学模型可以在预测肿瘤细胞的空间分布中补充数据。然而，这需要从临床数据中估计模型的患者特异性参数，由于时间数据有限且成像和诊断之间的时间有限，这是一个具有挑战性的反问题。本研究提出了一种使用物理信息神经网络（PINNs）从单个三维结构MRI快照中估计GBM生长反应扩散偏微分方程模型的患者特异性参数的方法。PINNs将数据和PDE嵌入到损失函数中，从而整合了理论和数据。关键创新包括特征无量纲参数的识别和估计，利用无量纲参数的预训练步骤以及微调步骤。",
    "tldr": "本研究利用物理信息神经网络（PINNs）从单个三维结构MRI快照中估计胶质母细胞瘤（GBM）生长模型的患者特异性参数，并通过整合理论和数据进行个性化预测，为胶质母细胞瘤的治疗设计提供了关键创新。",
    "en_tdlr": "This study proposes a method using Physics-Informed Neural Networks (PINNs) to estimate patient-specific parameters of a GBM growth model from a single 3D MRI snapshot, integrating theory and data to provide personalized predictions for the treatment design of glioblastoma."
}