{
    "title": "COSTAR: Improved Temporal Counterfactual Estimation with Self-Supervised Learning. (arXiv:2311.00886v1 [cs.LG])",
    "abstract": "Estimation of temporal counterfactual outcomes from observed history is crucial for decision-making in many domains such as healthcare and e-commerce, particularly when randomized controlled trials (RCTs) suffer from high cost or impracticality. For real-world datasets, modeling time-dependent confounders is challenging due to complex dynamics, long-range dependencies and both past treatments and covariates affecting the future outcomes. In this paper, we introduce COunterfactual Self-supervised TrAnsformeR (COSTAR), a novel approach that integrates self-supervised learning for improved historical representations. The proposed framework combines temporal and feature-wise attention with a component-wise contrastive loss tailored for temporal treatment outcome observations, yielding superior performance in estimation accuracy and generalization to out-of-distribution data compared to existing models, as validated by empirical results on both synthetic and real-world datasets.",
    "link": "http://arxiv.org/abs/2311.00886",
    "context": "Title: COSTAR: Improved Temporal Counterfactual Estimation with Self-Supervised Learning. (arXiv:2311.00886v1 [cs.LG])\nAbstract: Estimation of temporal counterfactual outcomes from observed history is crucial for decision-making in many domains such as healthcare and e-commerce, particularly when randomized controlled trials (RCTs) suffer from high cost or impracticality. For real-world datasets, modeling time-dependent confounders is challenging due to complex dynamics, long-range dependencies and both past treatments and covariates affecting the future outcomes. In this paper, we introduce COunterfactual Self-supervised TrAnsformeR (COSTAR), a novel approach that integrates self-supervised learning for improved historical representations. The proposed framework combines temporal and feature-wise attention with a component-wise contrastive loss tailored for temporal treatment outcome observations, yielding superior performance in estimation accuracy and generalization to out-of-distribution data compared to existing models, as validated by empirical results on both synthetic and real-world datasets.",
    "path": "papers/23/11/2311.00886.json",
    "total_tokens": 946,
    "translated_title": "COSTAR: 使用自监督学习改进的时间反事实估计",
    "translated_abstract": "在许多领域，如医疗保健和电子商务，在观察到的历史数据中估计时间反事实结果对决策至关重要，特别是随机对照试验(RCTs)成本高或者不可行的情况下。对于现实世界的数据集，由于复杂的动态，长范围依赖性以及过去的治疗和协变量对未来结果的影响，建模时间相关的混淆因素是具有挑战性的。在本文中，我们引入了COunterfactual Self-supervised TrAnsformeR（COSTAR），一种整合了自监督学习来改进历史表示的新方法。所提出的框架将时间和特征关注与针对时间处理结果观察的分量对比损失相结合，与现有模型相比，在估计准确性和泛化到分布之外数据方面具有优越性能，通过对合成数据集和现实世界数据集的实证结果验证该优越性能。",
    "tldr": "这项研究提出了一种名为COSTAR的新方法，通过整合自监督学习，改进了时间反事实结果的估计。该方法在处理时间相关混淆因素时结合了时间和特征关注以及分量对比损失，相比现有模型在估计准确性和对分布之外数据的泛化能力方面表现出更优越的性能。",
    "en_tdlr": "This study introduces a novel approach called COSTAR, which improves the estimation of temporal counterfactual outcomes by integrating self-supervised learning. The proposed method combines temporal and feature-wise attention with a component-wise contrastive loss, resulting in superior performance in estimation accuracy and generalization to out-of-distribution data compared to existing models."
}