{
    "title": "$\\varepsilon$-fractional Core Stability in Hedonic Games. (arXiv:2311.11101v2 [cs.GT] UPDATED)",
    "abstract": "Hedonic Games (HGs) are a classical framework modeling coalition formation of strategic agents guided by their individual preferences. According to these preferences, it is desirable that a coalition structure (i.e. a partition of agents into coalitions) satisfies some form of stability. The most well-known and natural of such notions is arguably core-stability. Informally, a partition is core-stable if no subset of agents would like to deviate by regrouping in a so-called core-blocking coalition. Unfortunately, core-stable partitions seldom exist and even when they do, it is often computationally intractable to find one. To circumvent these problems, we propose the notion of $\\varepsilon$-fractional core-stability, where at most an $\\varepsilon$-fraction of all possible coalitions is allowed to core-block. It turns out that such a relaxation may guarantee both existence and polynomial-time computation. Specifically, we design efficient algorithms returning an $\\varepsilon$-fractional ",
    "link": "http://arxiv.org/abs/2311.11101",
    "context": "Title: $\\varepsilon$-fractional Core Stability in Hedonic Games. (arXiv:2311.11101v2 [cs.GT] UPDATED)\nAbstract: Hedonic Games (HGs) are a classical framework modeling coalition formation of strategic agents guided by their individual preferences. According to these preferences, it is desirable that a coalition structure (i.e. a partition of agents into coalitions) satisfies some form of stability. The most well-known and natural of such notions is arguably core-stability. Informally, a partition is core-stable if no subset of agents would like to deviate by regrouping in a so-called core-blocking coalition. Unfortunately, core-stable partitions seldom exist and even when they do, it is often computationally intractable to find one. To circumvent these problems, we propose the notion of $\\varepsilon$-fractional core-stability, where at most an $\\varepsilon$-fraction of all possible coalitions is allowed to core-block. It turns out that such a relaxation may guarantee both existence and polynomial-time computation. Specifically, we design efficient algorithms returning an $\\varepsilon$-fractional ",
    "path": "papers/23/11/2311.11101.json",
    "total_tokens": 989,
    "translated_title": "$\\varepsilon$-分数核稳定在快乐博弈中的应用",
    "translated_abstract": "快乐博弈是一个经典的框架，用来模拟战略代理人通过个人偏好来形成联盟。根据这些偏好，理想的联盟结构（即将代理人划分为各个联盟）应该满足某种稳定性条件。其中最为知名和自然的概念之一是核稳定性。简单来说，如果没有代理人的子集希望通过重新分组成为一个所谓的核阻塞联盟来偏离原联盟结构，那么该划分就是核稳定的。不幸的是，核稳定的划分很少存在，即使存在，寻找这样的划分通常也是计算上困难的。为了解决这些问题，我们提出了$\\varepsilon$-分数核稳定的概念，即最多允许$\\varepsilon$比例的可能联盟成为核阻塞联盟。事实证明，这样的放松条件可以同时保证存在性和多项式时间计算。具体而言，我们设计了高效的算法来返回一个$\\varepsilon$-分数的核稳定划分。",
    "tldr": "提出了$\\varepsilon$-分数核稳定的概念，通过允许最多$\\varepsilon$比例的可能联盟成为核阻塞联盟来解决快乐博弈中的核稳定性问题。这一放松条件可以保证存在性和多项式时间计算。",
    "en_tdlr": "Proposed the concept of $\\varepsilon$-fractional core-stability, which allows up to an $\\varepsilon$-fraction of all possible coalitions to be core-blocking, to address the core stability issue in hedonic games. This relaxation condition guarantees both the existence and polynomial-time computation."
}