{
    "title": "Mobile-Seed: Joint Semantic Segmentation and Boundary Detection for Mobile Robots",
    "abstract": "arXiv:2311.12651v3 Announce Type: replace-cross  Abstract: Precise and rapid delineation of sharp boundaries and robust semantics is essential for numerous downstream robotic tasks, such as robot grasping and manipulation, real-time semantic mapping, and online sensor calibration performed on edge computing units. Although boundary detection and semantic segmentation are complementary tasks, most studies focus on lightweight models for semantic segmentation but overlook the critical role of boundary detection. In this work, we introduce Mobile-Seed, a lightweight, dual-task framework tailored for simultaneous semantic segmentation and boundary detection. Our framework features a two-stream encoder, an active fusion decoder (AFD) and a dual-task regularization approach. The encoder is divided into two pathways: one captures category-aware semantic information, while the other discerns boundaries from multi-scale features. The AFD module dynamically adapts the fusion of semantic and boun",
    "link": "https://arxiv.org/abs/2311.12651",
    "context": "Title: Mobile-Seed: Joint Semantic Segmentation and Boundary Detection for Mobile Robots\nAbstract: arXiv:2311.12651v3 Announce Type: replace-cross  Abstract: Precise and rapid delineation of sharp boundaries and robust semantics is essential for numerous downstream robotic tasks, such as robot grasping and manipulation, real-time semantic mapping, and online sensor calibration performed on edge computing units. Although boundary detection and semantic segmentation are complementary tasks, most studies focus on lightweight models for semantic segmentation but overlook the critical role of boundary detection. In this work, we introduce Mobile-Seed, a lightweight, dual-task framework tailored for simultaneous semantic segmentation and boundary detection. Our framework features a two-stream encoder, an active fusion decoder (AFD) and a dual-task regularization approach. The encoder is divided into two pathways: one captures category-aware semantic information, while the other discerns boundaries from multi-scale features. The AFD module dynamically adapts the fusion of semantic and boun",
    "path": "papers/23/11/2311.12651.json",
    "total_tokens": 851,
    "translated_title": "移动机器人的联合语义分割和边界检测",
    "translated_abstract": "精确快速地勾勒出清晰边界和稳健的语义对于众多下游机器人任务至关重要，例如机器人抓取和操作、实时语义映射以及在线传感器校准等任务是在边缘计算单元上执行的。尽管边界检测和语义分割是互补的任务，但大多数研究集中在轻量级模型上进行语义分割，而忽略了边界检测的关键作用。在这项工作中，我们引入了Mobile-Seed，一个专为同时进行语义分割和边界检测而设计的轻量级双任务框架。我们的框架具有双流编码器、主动融合解码器（AFD）和双任务正则化方法。编码器分为两条路径：一条捕获具有类别感知的语义信息，另一条从多尺度特征中辨别边界。AFD模块动态调整语义和边界的融合。",
    "tldr": "Mobile-Seed是一个轻量级的双任务框架，旨在同时进行语义分割和边界检测，具有双流编码器、主动融合解码器和双任务正则化方法。",
    "en_tdlr": "Mobile-Seed is a lightweight dual-task framework designed for simultaneous semantic segmentation and boundary detection, featuring a two-stream encoder, an active fusion decoder, and a dual-task regularization approach."
}