{
    "title": "DyRA: Portable Dynamic Resolution Adjustment Network for Existing Detectors",
    "abstract": "arXiv:2311.17098v3 Announce Type: replace-cross  Abstract: Achieving constant accuracy in object detection is challenging due to the inherent variability of object sizes. One effective approach to this problem involves optimizing input resolution, referred to as a multi-resolution strategy. Previous approaches to resolution optimization have often been based on pre-defined resolutions with manual selection. However, there is a lack of study on run-time resolution optimization for existing architectures. This paper introduces DyRA, a dynamic resolution adjustment network providing an image-specific scale factor for existing detectors. This network is co-trained with detectors utilizing specially designed loss functions, namely ParetoScaleLoss and BalanceLoss. ParetoScaleLoss determines an adaptive scale factor for robustness, while BalanceLoss optimizes overall scale factors according to the localization performance of the detector. The loss function is devised to minimize the accuracy ",
    "link": "https://arxiv.org/abs/2311.17098",
    "context": "Title: DyRA: Portable Dynamic Resolution Adjustment Network for Existing Detectors\nAbstract: arXiv:2311.17098v3 Announce Type: replace-cross  Abstract: Achieving constant accuracy in object detection is challenging due to the inherent variability of object sizes. One effective approach to this problem involves optimizing input resolution, referred to as a multi-resolution strategy. Previous approaches to resolution optimization have often been based on pre-defined resolutions with manual selection. However, there is a lack of study on run-time resolution optimization for existing architectures. This paper introduces DyRA, a dynamic resolution adjustment network providing an image-specific scale factor for existing detectors. This network is co-trained with detectors utilizing specially designed loss functions, namely ParetoScaleLoss and BalanceLoss. ParetoScaleLoss determines an adaptive scale factor for robustness, while BalanceLoss optimizes overall scale factors according to the localization performance of the detector. The loss function is devised to minimize the accuracy ",
    "path": "papers/23/11/2311.17098.json",
    "total_tokens": 821,
    "translated_title": "DyRA: 用于现有检测器的便携式动态分辨率调整网络",
    "translated_abstract": "实现目标检测中的恒定精度具有挑战性，因为物体尺寸固有的变化性。解决这个问题的一个有效方法涉及优化输入分辨率，称为多分辨率策略。先前的分辨率优化方法通常基于预定义的分辨率和手动选择。然而，对于现有架构的运行时分辨率优化缺乏研究。本文介绍了DyRA，一种动态分辨率调整网络，为现有的检测器提供图像特定的缩放因子。该网络与检测器一起进行联合训练，利用专门设计的损失函数，即ParetoScaleLoss和BalanceLoss。ParetoScaleLoss确定用于鲁棒性的自适应缩放因子，而BalanceLoss根据检测器的定位性能优化整体缩放因子。损失函数的设计旨在最小化精度损失。",
    "tldr": "DyRA是一种动态分辨率调整网络，为现有的检测器提供图像特定的缩放因子，通过ParetoScaleLoss和BalanceLoss优化缩放因子以提高检测性能。",
    "en_tdlr": "DyRA is a dynamic resolution adjustment network that provides image-specific scale factors for existing detectors, optimizing the scale factors through ParetoScaleLoss and BalanceLoss to improve detection performance."
}