{
    "title": "The Open DAC 2023 Dataset and Challenges for Sorbent Discovery in Direct Air Capture. (arXiv:2311.00341v1 [cond-mat.mtrl-sci])",
    "abstract": "New methods for carbon dioxide removal are urgently needed to combat global climate change. Direct air capture (DAC) is an emerging technology to capture carbon dioxide directly from ambient air. Metal-organic frameworks (MOFs) have been widely studied as potentially customizable adsorbents for DAC. However, discovering promising MOF sorbents for DAC is challenging because of the vast chemical space to explore and the need to understand materials as functions of humidity and temperature. We explore a computational approach benefiting from recent innovations in machine learning (ML) and present a dataset named Open DAC 2023 (ODAC23) consisting of more than 38M density functional theory (DFT) calculations on more than 8,800 MOF materials containing adsorbed CO2 and/or H2O. ODAC23 is by far the largest dataset of MOF adsorption calculations at the DFT level of accuracy currently available. In addition to probing properties of adsorbed molecules, the dataset is a rich source of information",
    "link": "http://arxiv.org/abs/2311.00341",
    "context": "Title: The Open DAC 2023 Dataset and Challenges for Sorbent Discovery in Direct Air Capture. (arXiv:2311.00341v1 [cond-mat.mtrl-sci])\nAbstract: New methods for carbon dioxide removal are urgently needed to combat global climate change. Direct air capture (DAC) is an emerging technology to capture carbon dioxide directly from ambient air. Metal-organic frameworks (MOFs) have been widely studied as potentially customizable adsorbents for DAC. However, discovering promising MOF sorbents for DAC is challenging because of the vast chemical space to explore and the need to understand materials as functions of humidity and temperature. We explore a computational approach benefiting from recent innovations in machine learning (ML) and present a dataset named Open DAC 2023 (ODAC23) consisting of more than 38M density functional theory (DFT) calculations on more than 8,800 MOF materials containing adsorbed CO2 and/or H2O. ODAC23 is by far the largest dataset of MOF adsorption calculations at the DFT level of accuracy currently available. In addition to probing properties of adsorbed molecules, the dataset is a rich source of information",
    "path": "papers/23/11/2311.00341.json",
    "total_tokens": 968,
    "translated_title": "《2023年开放式DAC数据集和直接空气捕集中吸附剂发现的挑战》",
    "translated_abstract": "急需新的二氧化碳去除方法来应对全球气候变化。直接空气捕集(DAC)是一种从环境空气中直接捕集二氧化碳的新兴技术。金属有机框架(MOFs)被广泛研究作为DAC的潜在可定制吸附剂。然而，由于需要探索的巨大化学空间和需要了解材料随湿度和温度变化的特性，发现有前途的DAC MOF吸附剂是具有挑战性的。我们使用机器学习的最新创新，探索了一种计算方法，并提供了一个名为Open DAC 2023 (ODAC23)的数据集，其中包含超过8,800个含有吸附CO2和/或H2O的MOF材料的超过3800万的密度泛函理论（DFT）计算。 ODAC23是目前可用精确度的DFT级别中最大的MOF吸附计算数据集。除了探索吸附分子的性质外，这个数据集还是信息的丰富来源。",
    "tldr": "本论文介绍了一种计算方法，利用机器学习的创新，构建了一个包含超过8,800个MOF材料的超大规模数据集，该数据集对于直接空气捕集中有前途的吸附剂发现具有重要意义。",
    "en_tdlr": "This paper presents a computational approach utilizing machine learning innovations and introduces a large-scale dataset consisting of over 8,800 MOF materials, which is of great significance for the discovery of promising sorbents in direct air capture."
}