{
    "title": "Imagination-Augmented Hierarchical Reinforcement Learning for Safe and Interactive Autonomous Driving in Urban Environments. (arXiv:2311.10309v2 [cs.LG] UPDATED)",
    "abstract": "Hierarchical reinforcement learning (HRL) incorporates temporal abstraction into reinforcement learning (RL) by explicitly taking advantage of hierarchical structure. Modern HRL typically designs a hierarchical agent composed of a high-level policy and low-level policies. The high-level policy selects which low-level policy to activate at a lower frequency and the activated low-level policy selects an action at each time step. Recent HRL algorithms have achieved performance gains over standard RL algorithms in synthetic navigation tasks. However, we cannot apply these HRL algorithms to real-world navigation tasks. One of the main challenges is that real-world navigation tasks require an agent to perform safe and interactive behaviors in dynamic environments. In this paper, we propose imagination-augmented HRL (IAHRL) that efficiently integrates imagination into HRL to enable an agent to learn safe and interactive behaviors in real-world navigation tasks. Imagination is to predict the c",
    "link": "http://arxiv.org/abs/2311.10309",
    "context": "Title: Imagination-Augmented Hierarchical Reinforcement Learning for Safe and Interactive Autonomous Driving in Urban Environments. (arXiv:2311.10309v2 [cs.LG] UPDATED)\nAbstract: Hierarchical reinforcement learning (HRL) incorporates temporal abstraction into reinforcement learning (RL) by explicitly taking advantage of hierarchical structure. Modern HRL typically designs a hierarchical agent composed of a high-level policy and low-level policies. The high-level policy selects which low-level policy to activate at a lower frequency and the activated low-level policy selects an action at each time step. Recent HRL algorithms have achieved performance gains over standard RL algorithms in synthetic navigation tasks. However, we cannot apply these HRL algorithms to real-world navigation tasks. One of the main challenges is that real-world navigation tasks require an agent to perform safe and interactive behaviors in dynamic environments. In this paper, we propose imagination-augmented HRL (IAHRL) that efficiently integrates imagination into HRL to enable an agent to learn safe and interactive behaviors in real-world navigation tasks. Imagination is to predict the c",
    "path": "papers/23/11/2311.10309.json",
    "total_tokens": 961,
    "translated_title": "基于想象力增强的分层强化学习用于城市环境中安全交互自动驾驶",
    "translated_abstract": "分层强化学习通过显式地利用分层结构将时间抽象纳入强化学习中。现代的分层强化学习通常设计一个由高层策略和低层策略组成的分层代理。高层策略选择较低频率激活的低层策略，而激活的低层策略在每个时间步选择一个动作。最近的分层强化学习算法在合成导航任务中相对于标准的强化学习算法取得了性能提升。但是，我们无法将这些分层强化学习算法应用于现实世界的导航任务。主要挑战之一是现实世界的导航任务需要智能体在动态环境中执行安全和交互行为。在本文中，我们提出了一种想象力增强的分层强化学习算法(IAHRL)，它有效地将想象力整合到分层强化学习中，使智能体能够在现实世界的导航任务中学习安全和交互的行为。",
    "tldr": "本文提出了一种名为想象力增强分层强化学习 (IAHRL)的方法，通过有效地整合想象力到分层强化学习中，使智能体能够在现实世界的导航任务中学习安全和交互的行为。",
    "en_tdlr": "This paper proposes a method called Imagination-Augmented Hierarchical Reinforcement Learning (IAHRL), which effectively integrates imagination into hierarchical reinforcement learning, enabling agents to learn safe and interactive behaviors in real-world navigation tasks."
}