{
    "title": "Ultra-Efficient On-Device Object Detection on AI-Integrated Smart Glasses with TinyissimoYOLO. (arXiv:2311.01057v1 [cs.CV])",
    "abstract": "Smart glasses are rapidly gaining advanced functionality thanks to cutting-edge computing technologies, accelerated hardware architectures, and tiny AI algorithms. Integrating AI into smart glasses featuring a small form factor and limited battery capacity is still challenging when targeting full-day usage for a satisfactory user experience. This paper illustrates the design and implementation of tiny machine-learning algorithms exploiting novel low-power processors to enable prolonged continuous operation in smart glasses. We explore the energy- and latency-efficient of smart glasses in the case of real-time object detection. To this goal, we designed a smart glasses prototype as a research platform featuring two microcontrollers, including a novel milliwatt-power RISC-V parallel processor with a hardware accelerator for visual AI, and a Bluetooth low-power module for communication. The smart glasses integrate power cycling mechanisms, including image and audio sensing interfaces. Fur",
    "link": "http://arxiv.org/abs/2311.01057",
    "context": "Title: Ultra-Efficient On-Device Object Detection on AI-Integrated Smart Glasses with TinyissimoYOLO. (arXiv:2311.01057v1 [cs.CV])\nAbstract: Smart glasses are rapidly gaining advanced functionality thanks to cutting-edge computing technologies, accelerated hardware architectures, and tiny AI algorithms. Integrating AI into smart glasses featuring a small form factor and limited battery capacity is still challenging when targeting full-day usage for a satisfactory user experience. This paper illustrates the design and implementation of tiny machine-learning algorithms exploiting novel low-power processors to enable prolonged continuous operation in smart glasses. We explore the energy- and latency-efficient of smart glasses in the case of real-time object detection. To this goal, we designed a smart glasses prototype as a research platform featuring two microcontrollers, including a novel milliwatt-power RISC-V parallel processor with a hardware accelerator for visual AI, and a Bluetooth low-power module for communication. The smart glasses integrate power cycling mechanisms, including image and audio sensing interfaces. Fur",
    "path": "papers/23/11/2311.01057.json",
    "total_tokens": 917,
    "translated_title": "带有TinyissimoYOLO的AI集成智能眼镜上的超高效设备内目标检测",
    "translated_abstract": "智能眼镜借助尖端计算技术、加速硬件架构和小型AI算法，正迅速获得先进功能。在面向全天使用以实现满意用户体验时，将AI集成到具有小尺寸和有限电池容量的智能眼镜仍然具有挑战性。本文阐述了利用新型低功耗处理器实现小型机器学习算法设计和实现，以在智能眼镜中实现长时间连续运行。我们探索了智能眼镜在实时目标检测情况下的能量和时延效率。为此，我们设计了一个智能眼镜原型作为研究平台，其中包括两个微控制器，包括一个具有视觉AI硬件加速器的新型毫瓦级功率RISC-V并行处理器，以及一个用于通信的低功耗蓝牙模块。智能眼镜集成了图像和音频感应接口等电源循环机制。",
    "tldr": "本文介绍了在智能眼镜上实现超高效设备内目标检测的设计和实施，利用新型低功耗处理器实现小型机器学习算法，以便在具有小尺寸和有限电池容量的智能眼镜上实现长时间连续运行。",
    "en_tdlr": "This paper presents the design and implementation of ultra-efficient on-device object detection on smart glasses, utilizing novel low-power processors for small-scale machine learning algorithms, enabling prolonged continuous operation on smart glasses with limited battery capacity."
}