{
    "title": "RT-Trajectory: Robotic Task Generalization via Hindsight Trajectory Sketches. (arXiv:2311.01977v1 [cs.RO])",
    "abstract": "Generalization remains one of the most important desiderata for robust robot learning systems. While recently proposed approaches show promise in generalization to novel objects, semantic concepts, or visual distribution shifts, generalization to new tasks remains challenging. For example, a language-conditioned policy trained on pick-and-place tasks will not be able to generalize to a folding task, even if the arm trajectory of folding is similar to pick-and-place. Our key insight is that this kind of generalization becomes feasible if we represent the task through rough trajectory sketches. We propose a policy conditioning method using such rough trajectory sketches, which we call RT-Trajectory, that is practical, easy to specify, and allows the policy to effectively perform new tasks that would otherwise be challenging to perform. We find that trajectory sketches strike a balance between being detailed enough to express low-level motion-centric guidance while being coarse enough to ",
    "link": "http://arxiv.org/abs/2311.01977",
    "context": "Title: RT-Trajectory: Robotic Task Generalization via Hindsight Trajectory Sketches. (arXiv:2311.01977v1 [cs.RO])\nAbstract: Generalization remains one of the most important desiderata for robust robot learning systems. While recently proposed approaches show promise in generalization to novel objects, semantic concepts, or visual distribution shifts, generalization to new tasks remains challenging. For example, a language-conditioned policy trained on pick-and-place tasks will not be able to generalize to a folding task, even if the arm trajectory of folding is similar to pick-and-place. Our key insight is that this kind of generalization becomes feasible if we represent the task through rough trajectory sketches. We propose a policy conditioning method using such rough trajectory sketches, which we call RT-Trajectory, that is practical, easy to specify, and allows the policy to effectively perform new tasks that would otherwise be challenging to perform. We find that trajectory sketches strike a balance between being detailed enough to express low-level motion-centric guidance while being coarse enough to ",
    "path": "papers/23/11/2311.01977.json",
    "total_tokens": 806,
    "translated_title": "RT-Trajectory: 通过回顾轨迹草图实现机器人任务的泛化",
    "translated_abstract": "泛化仍然是强大的机器人学习系统的最重要愿景之一。虽然最近提出的方法在泛化到新的物体、语义概念或视觉分布转移方面显示出了潜力，但泛化到新任务仍然具有挑战性。例如，一个在拾取和放置任务上训练的语言条件策略将无法泛化到折叠任务，即使折叠的臂部轨迹与拾取和放置类似。我们的关键观点是，如果我们通过粗糙的轨迹草图来表示任务，这种泛化将变得可行。我们提出了一种使用粗糙轨迹草图的策略条件方法，称为RT-Trajectory，它是实用的、易于指定的，可以使策略有效地执行原本具有挑战性的新任务。",
    "tldr": "通过使用粗糙的轨迹草图，我们提出了一种名为RT-Trajectory的策略条件方法，在泛化到新任务方面取得了成功。",
    "en_tdlr": "We propose RT-Trajectory, a policy conditioning method that utilizes rough trajectory sketches, for successful generalization to new tasks."
}