{
    "title": "UMedNeRF: Uncertainty-aware Single View Volumetric Rendering for Medical Neural Radiance Fields. (arXiv:2311.05836v5 [eess.IV] UPDATED)",
    "abstract": "In the field of clinical medicine, computed tomography (CT) is an effective medical imaging modality for the diagnosis of various pathologies. Compared with X-ray images, CT images can provide more information, including multi-planar slices and three-dimensional structures for clinical diagnosis. However, CT imaging requires patients to be exposed to large doses of ionizing radiation for a long time, which may cause irreversible physical harm. In this paper, we propose an Uncertainty-aware MedNeRF (UMedNeRF) network based on generated radiation fields. The network can learn a continuous representation of CT projections from 2D X-ray images by obtaining the internal structure and depth information and using adaptive loss weights to ensure the quality of the generated images. Our model is trained on publicly available knee and chest datasets, and we show the results of CT projection rendering with a single X-ray and compare our method with other methods based on generated radiation field",
    "link": "http://arxiv.org/abs/2311.05836",
    "context": "Title: UMedNeRF: Uncertainty-aware Single View Volumetric Rendering for Medical Neural Radiance Fields. (arXiv:2311.05836v5 [eess.IV] UPDATED)\nAbstract: In the field of clinical medicine, computed tomography (CT) is an effective medical imaging modality for the diagnosis of various pathologies. Compared with X-ray images, CT images can provide more information, including multi-planar slices and three-dimensional structures for clinical diagnosis. However, CT imaging requires patients to be exposed to large doses of ionizing radiation for a long time, which may cause irreversible physical harm. In this paper, we propose an Uncertainty-aware MedNeRF (UMedNeRF) network based on generated radiation fields. The network can learn a continuous representation of CT projections from 2D X-ray images by obtaining the internal structure and depth information and using adaptive loss weights to ensure the quality of the generated images. Our model is trained on publicly available knee and chest datasets, and we show the results of CT projection rendering with a single X-ray and compare our method with other methods based on generated radiation field",
    "path": "papers/23/11/2311.05836.json",
    "total_tokens": 935,
    "translated_title": "UMedNeRF：针对医学神经辐射场的不确定性感知单视角体积渲染",
    "translated_abstract": "在临床医学领域，计算机断层扫描（CT）是一种用于诊断各种疾病的有效医学影像模态。与X射线图像相比，CT图像可以提供更多信息，包括多平面切片和三维结构，用于临床诊断。然而，CT成像需要患者长时间暴露于大剂量的电离辐射，可能会导致不可逆的身体损伤。本文提出了一种基于生成的辐射场的不确定性感知MedNeRF（UMedNeRF）网络。该网络可以通过获取内部结构和深度信息，并使用自适应损失权重来确保生成图像的质量，学习2D X射线图像的CT投影的连续表示。我们的模型在公开可用的膝盖和胸部数据集上进行训练，并展示了使用单个X射线进行CT投影渲染的结果，并将我们的方法与基于生成的辐射场的其他方法进行比较。",
    "tldr": "UMedNeRF是一种针对医学神经辐射场的不确定性感知单视角体积渲染网络，能够从2D X射线图像中学习CT投影的连续表示，并通过使用自适应损失权重确保生成图像的质量。"
}