{
    "title": "Reproducible Parameter Inference Using Bagged Posteriors. (arXiv:2311.02019v1 [stat.ME])",
    "abstract": "Under model misspecification, it is known that Bayesian posteriors often do not properly quantify uncertainty about true or pseudo-true parameters. Even more fundamentally, misspecification leads to a lack of reproducibility in the sense that the same model will yield contradictory posteriors on independent data sets from the true distribution. To define a criterion for reproducible uncertainty quantification under misspecification, we consider the probability that two confidence sets constructed from independent data sets have nonempty overlap, and we establish a lower bound on this overlap probability that holds for any valid confidence sets. We prove that credible sets from the standard posterior can strongly violate this bound, particularly in high-dimensional settings (i.e., with dimension increasing with sample size), indicating that it is not internally coherent under misspecification. To improve reproducibility in an easy-to-use and widely applicable way, we propose to apply ba",
    "link": "http://arxiv.org/abs/2311.02019",
    "context": "Title: Reproducible Parameter Inference Using Bagged Posteriors. (arXiv:2311.02019v1 [stat.ME])\nAbstract: Under model misspecification, it is known that Bayesian posteriors often do not properly quantify uncertainty about true or pseudo-true parameters. Even more fundamentally, misspecification leads to a lack of reproducibility in the sense that the same model will yield contradictory posteriors on independent data sets from the true distribution. To define a criterion for reproducible uncertainty quantification under misspecification, we consider the probability that two confidence sets constructed from independent data sets have nonempty overlap, and we establish a lower bound on this overlap probability that holds for any valid confidence sets. We prove that credible sets from the standard posterior can strongly violate this bound, particularly in high-dimensional settings (i.e., with dimension increasing with sample size), indicating that it is not internally coherent under misspecification. To improve reproducibility in an easy-to-use and widely applicable way, we propose to apply ba",
    "path": "papers/23/11/2311.02019.json",
    "total_tokens": 805,
    "translated_title": "使用袋装后验进行可重现的参数推断",
    "translated_abstract": "在模型错误规范下，已知贝叶斯后验通常不能正确量化关于真实或伪真参数的不确定性。更重要的是，错误规范会导致在独立数据集上同一模型产生相互矛盾的后验结果，从而缺乏可重现性。为了定义在错误规范下可重现不确定性量化的标准，我们考虑从独立数据集构建的两个置信区间具有非空交集的概率，并为任何有效置信区间建立了该交集概率的下界。我们证明了标准后验的可信区间在高维设置下（即样本大小增加时的维度）可以严重违反这个下界，表明在错误规范下它不是内部一致的。为了提高易于使用且广泛适用的可重现性，我们建议应用袋装方法。",
    "tldr": "通过使用袋装方法，提出了一种易于使用且广泛适用的方法来改善在模型错误规范下的可重现性。",
    "en_tdlr": "A method using bagged posteriors is proposed to improve reproducibility under model misspecification. It provides an easy-to-use and widely applicable approach to address the lack of reproducibility in Bayesian posteriors and quantify uncertainty about parameters."
}