{
    "title": "Revamping AI Models in Dermatology: Overcoming Critical Challenges for Enhanced Skin Lesion Diagnosis. (arXiv:2311.01009v1 [cs.CV])",
    "abstract": "The surge in developing deep learning models for diagnosing skin lesions through image analysis is notable, yet their clinical black faces challenges. Current dermatology AI models have limitations: limited number of possible diagnostic outputs, lack of real-world testing on uncommon skin lesions, inability to detect out-of-distribution images, and over-reliance on dermoscopic images. To address these, we present an All-In-One \\textbf{H}ierarchical-\\textbf{O}ut of Distribution-\\textbf{C}linical Triage (HOT) model. For a clinical image, our model generates three outputs: a hierarchical prediction, an alert for out-of-distribution images, and a recommendation for dermoscopy if clinical image alone is insufficient for diagnosis. When the recommendation is pursued, it integrates both clinical and dermoscopic images to deliver final diagnosis. Extensive experiments on a representative cutaneous lesion dataset demonstrate the effectiveness and synergy of each component within our framework. ",
    "link": "http://arxiv.org/abs/2311.01009",
    "context": "Title: Revamping AI Models in Dermatology: Overcoming Critical Challenges for Enhanced Skin Lesion Diagnosis. (arXiv:2311.01009v1 [cs.CV])\nAbstract: The surge in developing deep learning models for diagnosing skin lesions through image analysis is notable, yet their clinical black faces challenges. Current dermatology AI models have limitations: limited number of possible diagnostic outputs, lack of real-world testing on uncommon skin lesions, inability to detect out-of-distribution images, and over-reliance on dermoscopic images. To address these, we present an All-In-One \\textbf{H}ierarchical-\\textbf{O}ut of Distribution-\\textbf{C}linical Triage (HOT) model. For a clinical image, our model generates three outputs: a hierarchical prediction, an alert for out-of-distribution images, and a recommendation for dermoscopy if clinical image alone is insufficient for diagnosis. When the recommendation is pursued, it integrates both clinical and dermoscopic images to deliver final diagnosis. Extensive experiments on a representative cutaneous lesion dataset demonstrate the effectiveness and synergy of each component within our framework. ",
    "path": "papers/23/11/2311.01009.json",
    "total_tokens": 984,
    "translated_title": "重塑皮肤病学中的AI模型：克服关键挑战以提高皮肤病变诊断",
    "translated_abstract": "近年来，通过图像分析开发深度学习模型诊断皮肤病变的数量激增，然而它们面临临床挑战。当前皮肤病学AI模型存在一些限制：有限的诊断结果数量，对不常见病变的现实世界测试的缺乏，无法检测到分布之外的图像，并过度依赖于皮肤镜图像。为了解决这些问题，我们提出了一种名为“全能-层次-分布之外-临床分类（HOT）”模型。对于临床图像，我们的模型生成三个输出：层次预测、对分布之外图像的警示以及如果仅凭临床图像无法诊断则建议进行皮肤镜检查。当采纳这个建议时，它将整合临床和皮肤镜图像以得出最终诊断。对代表性的皮肤病变数据集进行了大量实验，证明了我们框架中每个组件的有效性和协同效应。",
    "tldr": "提出了一种名为HOT模型的全能-层次-分布之外-临床分类模型，通过生成层次预测、对分布之外图像的警示以及对临床图像不足的情况下建议进行皮肤镜检查，以提高皮肤病变诊断的效果和协同效应。",
    "en_tdlr": "An All-In-One Hierarchical-Out of Distribution-Clinical Triage (HOT) model is proposed, which generates hierarchical prediction, alerts for out-of-distribution images, and recommendations for dermoscopy to enhance skin lesion diagnosis."
}