{
    "title": "Latent Space Inference For Spatial Transcriptomics. (arXiv:2311.00330v1 [cs.LG])",
    "abstract": "In order to understand the complexities of cellular biology, researchers are interested in two important metrics: the genetic expression information of cells and their spatial coordinates within a tissue sample. However, state-of-the art methods, namely single-cell RNA sequencing and image based spatial transcriptomics can only recover a subset of this information, either full genetic expression with loss of spatial information, or spatial information with loss of resolution in sequencing data. In this project, we investigate a probabilistic machine learning method to obtain the full genetic expression information for tissues samples while also preserving their spatial coordinates. This is done through mapping both datasets to a joint latent space representation with the use of variational machine learning methods. From here, the full genetic and spatial information can be decoded and to give us greater insights on the understanding of cellular processes and pathways.",
    "link": "http://arxiv.org/abs/2311.00330",
    "context": "Title: Latent Space Inference For Spatial Transcriptomics. (arXiv:2311.00330v1 [cs.LG])\nAbstract: In order to understand the complexities of cellular biology, researchers are interested in two important metrics: the genetic expression information of cells and their spatial coordinates within a tissue sample. However, state-of-the art methods, namely single-cell RNA sequencing and image based spatial transcriptomics can only recover a subset of this information, either full genetic expression with loss of spatial information, or spatial information with loss of resolution in sequencing data. In this project, we investigate a probabilistic machine learning method to obtain the full genetic expression information for tissues samples while also preserving their spatial coordinates. This is done through mapping both datasets to a joint latent space representation with the use of variational machine learning methods. From here, the full genetic and spatial information can be decoded and to give us greater insights on the understanding of cellular processes and pathways.",
    "path": "papers/23/11/2311.00330.json",
    "total_tokens": 873,
    "translated_title": "空间转录组的潜在空间推理",
    "translated_abstract": "为了理解细胞生物学的复杂性，研究人员对细胞的遗传表达信息和其在组织样本中的空间坐标感兴趣。然而，最先进的方法，即单细胞RNA测序和基于图像的空间转录组学，只能恢复这些信息的子集，要么完整的遗传表达信息丢失了空间信息，要么空间信息丢失了测序数据的分辨率。在本项目中，我们研究了一种概率机器学习方法，以获取组织样本的完整遗传表达信息，并保留它们的空间坐标。这是通过利用变分机器学习方法将两个数据集映射到共同的潜在空间表示中来实现的。从这里，可以解码出完整的遗传和空间信息，以更深入地了解细胞过程和通路。",
    "tldr": "本研究通过概率机器学习方法，将单细胞RNA测序和基于图像的空间转录组学数据映射到共同的潜在空间表示中，以获取组织样本的完整遗传表达信息，并保留空间坐标。这为深入理解细胞过程和通路提供了更多的见解。",
    "en_tdlr": "This study proposes a probabilistic machine learning method to map single-cell RNA sequencing and image based spatial transcriptomics data to a joint latent space representation, in order to obtain the full genetic expression information of tissue samples while preserving their spatial coordinates. This provides greater insights into understanding cellular processes and pathways."
}