{
    "title": "Constructing Temporal Dynamic Knowledge Graphs from Interactive Text-based Games. (arXiv:2311.01928v1 [cs.CL])",
    "abstract": "In natural language processing, interactive text-based games serve as a test bed for interactive AI systems. Prior work has proposed to play text-based games by acting based on discrete knowledge graphs constructed by the Discrete Graph Updater (DGU) to represent the game state from the natural language description. While DGU has shown promising results with high interpretability, it suffers from lower knowledge graph accuracy due to its lack of temporality and limited generalizability to complex environments with objects with the same label. In order to address DGU's weaknesses while preserving its high interpretability, we propose the Temporal Discrete Graph Updater (TDGU), a novel neural network model that represents dynamic knowledge graphs as a sequence of timestamped graph events and models them using a temporal point based graph neural network. Through experiments on the dataset collected from a text-based game TextWorld, we show that TDGU outperforms the baseline DGU. We furthe",
    "link": "http://arxiv.org/abs/2311.01928",
    "context": "Title: Constructing Temporal Dynamic Knowledge Graphs from Interactive Text-based Games. (arXiv:2311.01928v1 [cs.CL])\nAbstract: In natural language processing, interactive text-based games serve as a test bed for interactive AI systems. Prior work has proposed to play text-based games by acting based on discrete knowledge graphs constructed by the Discrete Graph Updater (DGU) to represent the game state from the natural language description. While DGU has shown promising results with high interpretability, it suffers from lower knowledge graph accuracy due to its lack of temporality and limited generalizability to complex environments with objects with the same label. In order to address DGU's weaknesses while preserving its high interpretability, we propose the Temporal Discrete Graph Updater (TDGU), a novel neural network model that represents dynamic knowledge graphs as a sequence of timestamped graph events and models them using a temporal point based graph neural network. Through experiments on the dataset collected from a text-based game TextWorld, we show that TDGU outperforms the baseline DGU. We furthe",
    "path": "papers/23/11/2311.01928.json",
    "total_tokens": 909,
    "translated_title": "从交互式文本游戏构建时间动态知识图谱",
    "translated_abstract": "在自然语言处理中，交互式文本游戏被用作测试交互式人工智能系统的试验场。之前的研究提出了通过离散知识图谱表示游戏状态的方式来玩文本游戏，其中知识图谱由Discrete Graph Updater (DGU) 构建。虽然DGU在解释性方面表现出色，但由于缺乏时间性和对具有相同标签的复杂环境的有限泛化能力，其知识图谱的准确性较低。为了解决DGU的弱点并保持其高解释性，我们提出了时间离散图更新器 (TDGU)，这是一种新颖的神经网络模型，将动态知识图谱表示为一系列带有时间戳的图事件，并使用时态基图神经网络对其进行建模。通过对从基于文本的游戏TextWorld收集的数据集进行实验，我们证明了TDGU优于基线DGU。",
    "tldr": "本研究提出了一种新颖的神经网络模型TDGU，将动态知识图谱表示为一系列带有时间戳的图事件，并使用时态基图神经网络对其进行建模。通过实验，我们证明了TDGU在文本游戏TextWorld数据集上的性能优于基线DGU。"
}