{
    "title": "SkelVIT: Consensus of Vision Transformers for a Lightweight Skeleton-Based Action Recognition System",
    "abstract": "arXiv:2311.08094v2 Announce Type: replace-cross  Abstract: Skeleton-based action recognition receives the attention of many researchers as it is robust to viewpoint and illumination changes, and its processing is much more efficient than the processing of video frames. With the emergence of deep learning models, it has become very popular to represent the skeleton data in pseudo-image form and apply CNN for action recognition. Thereafter, studies concentrated on finding effective methods for forming pseudo-images. Recently, attention networks, more specifically transformers have provided promising results in various vision problems. In this study, the effectiveness of VIT for skeleton-based action recognition is examined and its robustness on the pseudo-image representation scheme is investigated. To this end, a three-level architecture, SkelVit is proposed, which forms a set of pseudo images, applies a classifier on each of the representations, and combines their results to find the f",
    "link": "https://arxiv.org/abs/2311.08094",
    "context": "Title: SkelVIT: Consensus of Vision Transformers for a Lightweight Skeleton-Based Action Recognition System\nAbstract: arXiv:2311.08094v2 Announce Type: replace-cross  Abstract: Skeleton-based action recognition receives the attention of many researchers as it is robust to viewpoint and illumination changes, and its processing is much more efficient than the processing of video frames. With the emergence of deep learning models, it has become very popular to represent the skeleton data in pseudo-image form and apply CNN for action recognition. Thereafter, studies concentrated on finding effective methods for forming pseudo-images. Recently, attention networks, more specifically transformers have provided promising results in various vision problems. In this study, the effectiveness of VIT for skeleton-based action recognition is examined and its robustness on the pseudo-image representation scheme is investigated. To this end, a three-level architecture, SkelVit is proposed, which forms a set of pseudo images, applies a classifier on each of the representations, and combines their results to find the f",
    "path": "papers/23/11/2311.08094.json",
    "total_tokens": 905,
    "translated_title": "SkelVIT：轻量级基于骨骼的动作识别系统的视觉变压器共识",
    "translated_abstract": "骨骼基础动作识别引起了许多研究人员的关注，因为它对视角和光照变化具有鲁棒性，并且其处理比视频帧的处理效率高得多。随着深度学习模型的出现，以伪图像形式表示骨架数据并应用CNN进行动作识别变得非常流行。因此，研究集中在寻找形成伪图像的有效方法上。最近，注意力网络，更具体地说是变压器，在各种视觉问题中提供了有希望的结果。本研究考察了VIT对基于骨架的动作识别的有效性，并研究了其在伪图像表示方案上的稳健性。为此，提出了一个三级架构，SkelVit，它形成一组伪图像，对每个表示应用分类器，并结合它们的结果以找到f",
    "tldr": "本研究考察了VIT对基于骨骼的动作识别的有效性，并提出了一种三级架构SkelVit，该架构能够形成一组伪图像，并在每个表示上应用分类器，然后结合它们的结果来找到动作识别系统中的最佳表现。",
    "en_tdlr": "This study examines the effectiveness of VIT for skeleton-based action recognition and proposes a three-level architecture SkelVit, which can form a set of pseudo images, apply classifiers on each representation, and then combine their results to find the optimal performance in action recognition systems."
}