{
    "title": "A Review of Digital Twins and their Application in Cybersecurity based on Artificial Intelligence. (arXiv:2311.01154v1 [cs.CR])",
    "abstract": "The potential of digital twin technology is yet to be fully realized due to its diversity and untapped potential. Digital twins enable systems' analysis, design, optimization, and evolution to be performed digitally or in conjunction with a cyber-physical approach to improve speed, accuracy, and efficiency over traditional engineering methods. Industry 4.0, factories of the future, and digital twins continue to benefit from the technology and provide enhanced efficiency within existing systems. Due to the lack of information and security standards associated with the transition to cyber digitization, cybercriminals have been able to take advantage of the situation. Access to a digital twin of a product or service is equivalent to threatening the entire collection. There is a robust interaction between digital twins and artificial intelligence tools, which leads to strong interaction between these technologies, so it can be used to improve the cybersecurity of these digital platforms ba",
    "link": "http://arxiv.org/abs/2311.01154",
    "context": "Title: A Review of Digital Twins and their Application in Cybersecurity based on Artificial Intelligence. (arXiv:2311.01154v1 [cs.CR])\nAbstract: The potential of digital twin technology is yet to be fully realized due to its diversity and untapped potential. Digital twins enable systems' analysis, design, optimization, and evolution to be performed digitally or in conjunction with a cyber-physical approach to improve speed, accuracy, and efficiency over traditional engineering methods. Industry 4.0, factories of the future, and digital twins continue to benefit from the technology and provide enhanced efficiency within existing systems. Due to the lack of information and security standards associated with the transition to cyber digitization, cybercriminals have been able to take advantage of the situation. Access to a digital twin of a product or service is equivalent to threatening the entire collection. There is a robust interaction between digital twins and artificial intelligence tools, which leads to strong interaction between these technologies, so it can be used to improve the cybersecurity of these digital platforms ba",
    "path": "papers/23/11/2311.01154.json",
    "total_tokens": 864,
    "translated_title": "数字孪生与基于人工智能的网络安全应用综述",
    "translated_abstract": "数字孪生技术的潜力尚未完全发挥，由于其多样性和未开发的潜力。数字孪生使得系统的分析、设计、优化和演化能够通过数字方式或与协同的网络-物理方法相结合进行，以提高传统工程方法的速度、准确性和效率。工业4.0、未来工厂和数字孪生技术继续从该技术中受益，并在现有系统中提供了增强的效率。由于缺乏与网络数字化过渡相关的信息和安全标准，网络犯罪分子能够利用这种情况。访问产品或服务的数字孪生等同于威胁整个集合。数字孪生与人工智能工具之间存在着强有力的互动，这导致这些技术之间存在着紧密的互动，因此可以用来改善这些数字平台的网络安全。",
    "tldr": "数字孪生技术与人工智能工具之间的强互动可以改善数字平台的网络安全，但由于缺乏信息和安全标准，网络犯罪分子能够利用数字孪生技术对整个集合造成威胁。",
    "en_tdlr": "The strong interaction between digital twin technology and artificial intelligence tools can improve the cybersecurity of digital platforms, but the lack of information and security standards allows cybercriminals to exploit digital twins to threaten the entire collection."
}