{
    "title": "Replicable Benchmarking of Neural Machine Translation (NMT) on Low-Resource Local Languages in Indonesia. (arXiv:2311.00998v1 [cs.CL])",
    "abstract": "Neural machine translation (NMT) for low-resource local languages in Indonesia faces significant challenges, including the need for a representative benchmark and limited data availability. This work addresses these challenges by comprehensively analyzing training NMT systems for four low-resource local languages in Indonesia: Javanese, Sundanese, Minangkabau, and Balinese. Our study encompasses various training approaches, paradigms, data sizes, and a preliminary study into using large language models for synthetic low-resource languages parallel data generation. We reveal specific trends and insights into practical strategies for low-resource language translation. Our research demonstrates that despite limited computational resources and textual data, several of our NMT systems achieve competitive performances, rivaling the translation quality of zero-shot gpt-3.5-turbo. These findings significantly advance NMT for low-resource languages, offering valuable guidance for researchers in",
    "link": "http://arxiv.org/abs/2311.00998",
    "context": "Title: Replicable Benchmarking of Neural Machine Translation (NMT) on Low-Resource Local Languages in Indonesia. (arXiv:2311.00998v1 [cs.CL])\nAbstract: Neural machine translation (NMT) for low-resource local languages in Indonesia faces significant challenges, including the need for a representative benchmark and limited data availability. This work addresses these challenges by comprehensively analyzing training NMT systems for four low-resource local languages in Indonesia: Javanese, Sundanese, Minangkabau, and Balinese. Our study encompasses various training approaches, paradigms, data sizes, and a preliminary study into using large language models for synthetic low-resource languages parallel data generation. We reveal specific trends and insights into practical strategies for low-resource language translation. Our research demonstrates that despite limited computational resources and textual data, several of our NMT systems achieve competitive performances, rivaling the translation quality of zero-shot gpt-3.5-turbo. These findings significantly advance NMT for low-resource languages, offering valuable guidance for researchers in",
    "path": "papers/23/11/2311.00998.json",
    "total_tokens": 1072,
    "translated_title": "在印度尼西亚的低资源本地语言上可复制的神经机器翻译基准",
    "translated_abstract": "面对印度尼西亚低资源本地语言的神经机器翻译(NMT)面临着重大挑战，包括需要一个代表性的基准和有限的数据可用性。本研究通过全面分析为印度尼西亚的四种低资源本地语言（爪哇语、苏丹尼斯语、米南卡博和巴厘语）训练NMT系统来解决这些挑战。我们的研究涵盖了各种训练方法、范例、数据规模以及对使用大型语言模型进行合成低资源语言平行数据生成的初步研究。我们揭示了低资源语言翻译实用策略的具体趋势和见解。我们的研究表明，尽管计算资源和文本数据有限，我们的几个NMT系统在竞争性性能方面取得了成功，与零-shot gpt-3.5-turbo的翻译质量相媲美。这些发现显著推动了低资源语言的NMT，为研究人员提供了宝贵的指导。",
    "tldr": "本研究通过在印度尼西亚的低资源本地语言上训练NMT系统的综合分析，解决了神经机器翻译面临的挑战。 尽管计算资源和文本数据有限，但我们的几个NMT系统取得了竞争性性能，与零-shot gpt-3.5-turbo的翻译质量相媲美。 这些发现显著推动了低资源语言的NMT，为研究人员提供了宝贵的指导。",
    "en_tdlr": "This study addresses the challenges of neural machine translation (NMT) for low-resource local languages in Indonesia by comprehensively analyzing training NMT systems. Despite limited computational resources and textual data, several NMT systems achieve competitive performances, rivaling the translation quality of zero-shot gpt-3.5-turbo. These findings significantly advance NMT for low-resource languages, offering valuable guidance for researchers."
}