{
    "title": "Investigating Collaborative Data Practices: a Case Study on Artificial Intelligence for Healthcare Research. (arXiv:2311.18424v2 [cs.HC] UPDATED)",
    "abstract": "Developing artificial intelligence (AI) tools for healthcare is a collaborative effort, bringing data scientists, clinicians, patients and other disciplines together. In this paper, we explore the collaborative data practices of research consortia tasked with applying AI tools to understand and manage multiple long-term conditions in the UK. Through an inductive thematic analysis of 13 semi-structured interviews with participants of these consortia, we aimed to understand how collaboration happens based on the tools used, communication processes and settings, as well as the conditions and obstacles for collaborative work. Our findings reveal the adaptation of tools that are used for sharing knowledge and the tailoring of information based on the audience, particularly those from a clinical or patient perspective. Limitations on the ability to do this were also found to be imposed by the use of electronic healthcare records and access to datasets. We identified meetings as the key setti",
    "link": "http://arxiv.org/abs/2311.18424",
    "context": "Title: Investigating Collaborative Data Practices: a Case Study on Artificial Intelligence for Healthcare Research. (arXiv:2311.18424v2 [cs.HC] UPDATED)\nAbstract: Developing artificial intelligence (AI) tools for healthcare is a collaborative effort, bringing data scientists, clinicians, patients and other disciplines together. In this paper, we explore the collaborative data practices of research consortia tasked with applying AI tools to understand and manage multiple long-term conditions in the UK. Through an inductive thematic analysis of 13 semi-structured interviews with participants of these consortia, we aimed to understand how collaboration happens based on the tools used, communication processes and settings, as well as the conditions and obstacles for collaborative work. Our findings reveal the adaptation of tools that are used for sharing knowledge and the tailoring of information based on the audience, particularly those from a clinical or patient perspective. Limitations on the ability to do this were also found to be imposed by the use of electronic healthcare records and access to datasets. We identified meetings as the key setti",
    "path": "papers/23/11/2311.18424.json",
    "total_tokens": 971,
    "translated_title": "探究协作数据实践：以医疗健康研究中的人工智能为例的案例研究",
    "translated_abstract": "开发医疗健康领域的人工智能工具是一项协作工作，将数据科学家、临床医生、患者和其他学科汇集在一起。本文通过对英国应用人工智能工具来理解和管理多种长期疾病的研究联盟中的参与者进行的13次半结构化访谈的归纳主题分析，探讨了协作数据实践的工具、沟通过程和环境，以及协作工作的条件和障碍。我们的研究结果揭示了共享知识所使用的工具的适应性以及根据受众，特别是临床医生或患者的观点进行信息定制。同时，我们还发现了电子医疗记录和数据集访问的限制限制了这种定制的能力。我们确定了会议是关键的环境设置。",
    "tldr": "本文通过研究英国多种长期疾病研究联盟中的参与者的访谈，探讨了协作数据实践的工具、沟通过程和环境，以及协作工作的条件和障碍。研究结果显示了工具的适应性和信息根据受众的个性化，以及电子医疗记录和数据集访问的限制。",
    "en_tdlr": "This paper investigates the collaborative data practices in healthcare research, particularly in understanding and managing multiple long-term conditions. The study explores the tools, communication processes, and settings involved in collaborative work, as well as the conditions and obstacles faced. Findings reveal the adaptation and tailoring of tools for sharing knowledge based on the audience, as well as limitations imposed by electronic healthcare records and dataset access."
}