{
    "title": "Enhancing Summarization Performance through Transformer-Based Prompt Engineering in Automated Medical Reporting. (arXiv:2311.13274v2 [cs.CL] UPDATED)",
    "abstract": "Customized medical prompts enable Large Language Models (LLM) to effectively address medical dialogue summarization. The process of medical reporting is often time-consuming for healthcare professionals. Implementing medical dialogue summarization techniques presents a viable solution to alleviate this time constraint by generating automated medical reports. The effectiveness of LLMs in this process is significantly influenced by the formulation of the prompt, which plays a crucial role in determining the quality and relevance of the generated reports. In this research, we used a combination of two distinct prompting strategies, known as shot prompting and pattern prompting to enhance the performance of automated medical reporting. The evaluation of the automated medical reports is carried out using the ROUGE score and a human evaluation with the help of an expert panel. The two-shot prompting approach in combination with scope and domain context outperforms other methods and achieves ",
    "link": "http://arxiv.org/abs/2311.13274",
    "context": "Title: Enhancing Summarization Performance through Transformer-Based Prompt Engineering in Automated Medical Reporting. (arXiv:2311.13274v2 [cs.CL] UPDATED)\nAbstract: Customized medical prompts enable Large Language Models (LLM) to effectively address medical dialogue summarization. The process of medical reporting is often time-consuming for healthcare professionals. Implementing medical dialogue summarization techniques presents a viable solution to alleviate this time constraint by generating automated medical reports. The effectiveness of LLMs in this process is significantly influenced by the formulation of the prompt, which plays a crucial role in determining the quality and relevance of the generated reports. In this research, we used a combination of two distinct prompting strategies, known as shot prompting and pattern prompting to enhance the performance of automated medical reporting. The evaluation of the automated medical reports is carried out using the ROUGE score and a human evaluation with the help of an expert panel. The two-shot prompting approach in combination with scope and domain context outperforms other methods and achieves ",
    "path": "papers/23/11/2311.13274.json",
    "total_tokens": 765,
    "translated_title": "通过基于Transformer的提示工程提高自动医疗报告中的摘要性能",
    "translated_abstract": "定制医疗提示使得大型语言模型（LLM）能够有效地处理医学对话摘要。医学报告的过程常常耗时长，对医疗专业人员来说是一个问题。通过生成自动化的医学报告，实施医学对话摘要技术可以有效缓解这个时间限制。在这项研究中，我们采用了两种不同的提示策略，即shot prompting和pattern prompting，以提高自动医学报告的性能。使用ROUGE分数和专家小组的人工评估来评估自动医学报告的效果。两次shot prompting方法与范围和领域上下文相结合优于其他方法，并取得了",
    "tldr": "通过使用两种不同的提示策略，shot prompting和pattern prompting，该研究提高了自动医学报告的性能，通过使用ROUGE分数和人工评估证明了其优越性。"
}