{
    "title": "Large-Scale Multi-Robot Assembly Planning for Autonomous Manufacturing. (arXiv:2311.00192v1 [cs.RO])",
    "abstract": "Mobile autonomous robots have the potential to revolutionize manufacturing processes. However, employing large robot fleets in manufacturing requires addressing challenges including collision-free movement in a shared workspace, effective multi-robot collaboration to manipulate and transport large payloads, complex task allocation due to coupled manufacturing processes, and spatial planning for parallel assembly and transportation of nested subassemblies. We propose a full algorithmic stack for large-scale multi-robot assembly planning that addresses these challenges and can synthesize construction plans for complex assemblies with thousands of parts in a matter of minutes. Our approach takes in a CAD-like product specification and automatically plans a full-stack assembly procedure for a group of robots to manufacture the product. We propose an algorithmic stack that comprises: (i) an iterative radial layout optimization procedure to define a global staging layout for the manufacturin",
    "link": "http://arxiv.org/abs/2311.00192",
    "context": "Title: Large-Scale Multi-Robot Assembly Planning for Autonomous Manufacturing. (arXiv:2311.00192v1 [cs.RO])\nAbstract: Mobile autonomous robots have the potential to revolutionize manufacturing processes. However, employing large robot fleets in manufacturing requires addressing challenges including collision-free movement in a shared workspace, effective multi-robot collaboration to manipulate and transport large payloads, complex task allocation due to coupled manufacturing processes, and spatial planning for parallel assembly and transportation of nested subassemblies. We propose a full algorithmic stack for large-scale multi-robot assembly planning that addresses these challenges and can synthesize construction plans for complex assemblies with thousands of parts in a matter of minutes. Our approach takes in a CAD-like product specification and automatically plans a full-stack assembly procedure for a group of robots to manufacture the product. We propose an algorithmic stack that comprises: (i) an iterative radial layout optimization procedure to define a global staging layout for the manufacturin",
    "path": "papers/23/11/2311.00192.json",
    "total_tokens": 840,
    "translated_title": "大规模多机器人组装规划用于自主制造",
    "translated_abstract": "移动自主机器人有潜力革新制造流程。然而，将大型机器人群体应用于制造领域需要解决一些挑战，包括在共享工作空间中实现无碰撞移动，有效的多机器人协作来操纵和运输大型负载，由于耦合的制造流程导致复杂的任务分配，以及嵌套子装配件的并行装配和运输的空间规划。我们提出了一个完整的算法堆栈，用于大规模多机器人组装规划，可以在几分钟内合成具有数千个部件的复杂装配的建造计划。我们的方法接受类似CAD的产品规范，并自动为一组机器人规划全栈装配过程来制造产品。我们提出了一个算法堆栈，包括：(i)迭代径向布局优化过程，定义制造过程的全局调度布局。",
    "tldr": "本论文提出了一个大规模多机器人组装规划的算法堆栈，可以在短时间内合成复杂装配的建造计划，并解决了移动自主机器人在制造中面临的挑战。"
}