{
    "title": "Federated Learning on Edge Sensing Devices: A Review. (arXiv:2311.01201v1 [cs.LG])",
    "abstract": "The ability to monitor ambient characteristics, interact with them, and derive information about the surroundings has been made possible by the rapid proliferation of edge sensing devices like IoT, mobile, and wearable devices and their measuring capabilities with integrated sensors. Even though these devices are small and have less capacity for data storage and processing, they produce vast amounts of data. Some example application areas where sensor data is collected and processed include healthcare, environmental (including air quality and pollution levels), automotive, industrial, aerospace, and agricultural applications. These enormous volumes of sensing data collected from the edge devices are analyzed using a variety of Machine Learning (ML) and Deep Learning (DL) approaches. However, analyzing them on the cloud or a server presents challenges related to privacy, hardware, and connectivity limitations. Federated Learning (FL) is emerging as a solution to these problems while pre",
    "link": "http://arxiv.org/abs/2311.01201",
    "context": "Title: Federated Learning on Edge Sensing Devices: A Review. (arXiv:2311.01201v1 [cs.LG])\nAbstract: The ability to monitor ambient characteristics, interact with them, and derive information about the surroundings has been made possible by the rapid proliferation of edge sensing devices like IoT, mobile, and wearable devices and their measuring capabilities with integrated sensors. Even though these devices are small and have less capacity for data storage and processing, they produce vast amounts of data. Some example application areas where sensor data is collected and processed include healthcare, environmental (including air quality and pollution levels), automotive, industrial, aerospace, and agricultural applications. These enormous volumes of sensing data collected from the edge devices are analyzed using a variety of Machine Learning (ML) and Deep Learning (DL) approaches. However, analyzing them on the cloud or a server presents challenges related to privacy, hardware, and connectivity limitations. Federated Learning (FL) is emerging as a solution to these problems while pre",
    "path": "papers/23/11/2311.01201.json",
    "total_tokens": 925,
    "translated_title": "在边缘感知设备上的联邦学习：一项综述",
    "translated_abstract": "快速增长的边缘感知设备（如物联网、移动设备和可穿戴设备）及其集成传感器的测量能力使得监控环境特征、与之交互并获取环境信息成为可能。尽管这些设备体积小、数据存储和处理能力较低，但它们产生了大量的数据。传感器数据的收集和处理应用领域包括医疗保健、环境（包括空气质量和污染水平）、汽车、工业、航空航天和农业等。从边缘设备收集的这些海量感知数据使用各种机器学习（ML）和深度学习（DL）方法进行分析。然而，在云端或服务器上进行分析会带来与隐私、硬件和连接性限制相关的挑战。联邦学习（FL）正逐渐成为解决这些问题的解决方案。",
    "tldr": "本文综述了在边缘感知设备上的联邦学习的研究现状。边缘感知设备的快速增长使得监测环境特征并获取环境信息成为可能，但云端或服务器上的分析面临隐私、硬件和连接性等挑战。联邦学习作为一种解决方案逐渐受到关注。"
}