{
    "title": "The learning effects of subsidies to bundled goods: a semiparametric approach. (arXiv:2311.01217v1 [econ.EM])",
    "abstract": "Can temporary subsidies to bundles induce long-run changes in demand due to learning about the relative quality of one of its constituent goods? This paper provides theoretical and experimental evidence on the role of this mechanism. Theoretically, we introduce a model where an agent learns about the quality of an innovation on an essential good through consumption. Our results show that the contemporaneous effect of a one-off subsidy to a bundle that contains the innovation may be decomposed into a direct price effect, and an indirect learning motive, whereby an agent leverages the discount to increase the informational bequest left to her future selves. We then assess the predictions of our theory in a randomised experiment in a ridesharing platform. The experiment provided two-week discounts for car trips integrating with a train or metro station (a bundle). Given the heavy-tailed nature of our data, we follow \\cite{Athey2023} and, motivated by our theory, propose a semiparametric m",
    "link": "http://arxiv.org/abs/2311.01217",
    "context": "Title: The learning effects of subsidies to bundled goods: a semiparametric approach. (arXiv:2311.01217v1 [econ.EM])\nAbstract: Can temporary subsidies to bundles induce long-run changes in demand due to learning about the relative quality of one of its constituent goods? This paper provides theoretical and experimental evidence on the role of this mechanism. Theoretically, we introduce a model where an agent learns about the quality of an innovation on an essential good through consumption. Our results show that the contemporaneous effect of a one-off subsidy to a bundle that contains the innovation may be decomposed into a direct price effect, and an indirect learning motive, whereby an agent leverages the discount to increase the informational bequest left to her future selves. We then assess the predictions of our theory in a randomised experiment in a ridesharing platform. The experiment provided two-week discounts for car trips integrating with a train or metro station (a bundle). Given the heavy-tailed nature of our data, we follow \\cite{Athey2023} and, motivated by our theory, propose a semiparametric m",
    "path": "papers/23/11/2311.01217.json",
    "total_tokens": 879,
    "translated_title": "捆绑商品补贴的学习效应：半参数方法",
    "translated_abstract": "临时补贴捆绑商品是否能够通过学习其中一种商品的相对质量来引起长期需求变化？本文从理论和实证角度提供了关于此机制的证据。在理论上，我们引入了一个模型，代理人通过消费来学习必需品创新的质量。我们的结果显示，对包含该创新的捆绑商品进行一次性补贴的即时效应可以分解为直接价格效应和间接学习动机，代理人利用折扣增加信息遗产留给未来的自己。然后，我们在一个随机实验中评估了我们理论的预测，该实验在一个拼车平台上为与火车或地铁站整合的汽车行程提供了两周的折扣。考虑到我们数据的重尾特性，我们遵循Athey（2023）的方法，并基于我们的理论提出了一个半参数模型。",
    "tldr": "本文研究了捆绑商品补贴的学习效应，发现一次性补贴捆绑商品既有直接价格效应，也有间接学习动机，可以通过增加信息遗产来引起长期需求变化。",
    "en_tdlr": "This paper examines the learning effects of subsidies to bundled goods and finds that a one-off subsidy not only has a direct price effect but also an indirect learning motive, which can induce long-run changes in demand by increasing the informational bequest."
}