{
    "title": "An Empirical Study of Benchmarking Chinese Aspect Sentiment Quad Prediction. (arXiv:2311.01713v1 [cs.CL])",
    "abstract": "Aspect sentiment quad prediction (ASQP) is a critical subtask of aspect-level sentiment analysis. Current ASQP datasets are characterized by their small size and low quadruple density, which hinders technical development. To expand capacity, we construct two large Chinese ASQP datasets crawled from multiple online platforms. The datasets hold several significant characteristics: larger size (each with 10,000+ samples) and rich aspect categories, more words per sentence, and higher density than existing ASQP datasets. Moreover, we are the first to evaluate the performance of Generative Pre-trained Transformer (GPT) series models on ASQP and exhibit potential issues. The experiments with state-of-the-art ASQP baselines underscore the need to explore additional techniques to address ASQP, as well as the importance of further investigation into methods to improve the performance of GPTs.",
    "link": "http://arxiv.org/abs/2311.01713",
    "context": "Title: An Empirical Study of Benchmarking Chinese Aspect Sentiment Quad Prediction. (arXiv:2311.01713v1 [cs.CL])\nAbstract: Aspect sentiment quad prediction (ASQP) is a critical subtask of aspect-level sentiment analysis. Current ASQP datasets are characterized by their small size and low quadruple density, which hinders technical development. To expand capacity, we construct two large Chinese ASQP datasets crawled from multiple online platforms. The datasets hold several significant characteristics: larger size (each with 10,000+ samples) and rich aspect categories, more words per sentence, and higher density than existing ASQP datasets. Moreover, we are the first to evaluate the performance of Generative Pre-trained Transformer (GPT) series models on ASQP and exhibit potential issues. The experiments with state-of-the-art ASQP baselines underscore the need to explore additional techniques to address ASQP, as well as the importance of further investigation into methods to improve the performance of GPTs.",
    "path": "papers/23/11/2311.01713.json",
    "total_tokens": 852,
    "translated_title": "对中国方面情感四元预测进行基准测试的实证研究",
    "translated_abstract": "方面情感四元预测（ASQP）是方面级情感分析的一个关键子任务。目前的ASQP数据集特点是规模小且四元组密度低，这阻碍了技术的发展。为了扩大容量，我们构建了两个大规模的中国ASQP数据集，从多个在线平台收集。这些数据集具有几个显著的特点：更大的规模（每个数据集都有10,000+个样本），丰富的方面类别，每个句子更多的词数以及比现有ASQP数据集更高的密度。此外，我们首次评估了生成式预训练变压器（GPT）系列模型在ASQP上的性能，并展示了潜在的问题。与最先进的ASQP基准线实验强调了需要探索额外技术来解决ASQP的需求，以及进一步研究改进GPT性能的方法的重要性。",
    "tldr": "本研究构建了两个大规模的中国ASQP数据集，对生成式预训练变压器（GPT）系列模型在ASQP上的性能进行了评估，并展示了改进ASQP技术和提高GPT性能的重要性。"
}