{
    "title": "Monitor Placement for Fault Localization in Deep Neural Network Accelerators",
    "abstract": "Systolic arrays are a prominent choice for deep neural network (DNN) accelerators because they offer parallelism and efficient data reuse. Improving the reliability of DNN accelerators is crucial as hardware faults can degrade the accuracy of DNN inferencing. Systolic arrays make use of a large number of processing elements (PEs) for parallel processing, but when one PE is faulty, the error propagates and affects the outcomes of downstream PEs. Due to the large number of PEs, the cost associated with implementing hardware-based runtime monitoring of every single PE is infeasible. We present a solution to optimize the placement of hardware monitors within systolic arrays. We first prove that $2N-1$ monitors are needed to localize a single faulty PE and we also derive the monitor placement. We show that a second placement optimization problem, which minimizes the set of candidate faulty PEs for a given number of monitors, is NP-hard. Therefore, we propose a heuristic approach to balance ",
    "link": "https://arxiv.org/abs/2311.16594",
    "context": "Title: Monitor Placement for Fault Localization in Deep Neural Network Accelerators\nAbstract: Systolic arrays are a prominent choice for deep neural network (DNN) accelerators because they offer parallelism and efficient data reuse. Improving the reliability of DNN accelerators is crucial as hardware faults can degrade the accuracy of DNN inferencing. Systolic arrays make use of a large number of processing elements (PEs) for parallel processing, but when one PE is faulty, the error propagates and affects the outcomes of downstream PEs. Due to the large number of PEs, the cost associated with implementing hardware-based runtime monitoring of every single PE is infeasible. We present a solution to optimize the placement of hardware monitors within systolic arrays. We first prove that $2N-1$ monitors are needed to localize a single faulty PE and we also derive the monitor placement. We show that a second placement optimization problem, which minimizes the set of candidate faulty PEs for a given number of monitors, is NP-hard. Therefore, we propose a heuristic approach to balance ",
    "path": "papers/23/11/2311.16594.json",
    "total_tokens": 1011,
    "translated_title": "深度神经网络加速器中的故障定位监测器部署",
    "translated_abstract": "并行性和高效数据重用使得并行阵列系统成为深度神经网络（DNN）加速器的一个重要选择。提高DNN加速器的可靠性至关重要，因为硬件故障可能会降低DNN推理的准确性。由于并行阵列利用大量处理元件（PE）进行并行处理，但当一个PE故障时，错误会传播并影响下游PE的输出。由于PE的数量较大，使用基于硬件的运行时监测的成本是不可行的。我们提出了一种优化并行阵列中硬件监测器部署的解决方案。我们首先证明了在定位单个故障的PE所需的监测器数量为$2N-1$，并导出了监测器部署方案。我们还展示了第二个优化问题的监测器部署方案，该方案通过给定数量的监测器最小化候选故障PE集合，该问题是NP困难的。因此，我们提出一种启发式方法来平衡实现硬件监测的效益与开销。",
    "tldr": "本研究提出了一种在并行阵列中优化硬件监测器部署的解决方案，以提高深度神经网络加速器的可靠性。通过证明和推导，我们确定了定位单个故障的PE所需的监测器数量，并解决了NP困难的监测器部署方案优化问题。然后，我们提出了一种启发式方法来平衡效益与开销。",
    "en_tdlr": "This research presents a solution to optimize the placement of hardware monitors in systolic arrays to improve the reliability of deep neural network (DNN) accelerators. By proving and deriving the necessary number of monitors for localizing a single faulty processing element (PE), and addressing the NP-hard optimization problem of monitor placement, a heuristic approach is proposed to balance the benefits and costs of implementing hardware monitoring."
}