{
    "title": "Modeling the Uncertainty with Maximum Discrepant Students for Semi-supervised 2D Pose Estimation. (arXiv:2311.01770v1 [cs.CV])",
    "abstract": "Semi-supervised pose estimation is a practically challenging task for computer vision. Although numerous excellent semi-supervised classification methods have emerged, these methods typically use confidence to evaluate the quality of pseudo-labels, which is difficult to achieve in pose estimation tasks. For example, in pose estimation, confidence represents only the possibility that a position of the heatmap is a keypoint, not the quality of that prediction. In this paper, we propose a simple yet efficient framework to estimate the quality of pseudo-labels in semi-supervised pose estimation tasks from the perspective of modeling the uncertainty of the pseudo-labels. Concretely, under the dual mean-teacher framework, we construct the two maximum discrepant students (MDSs) to effectively push two teachers to generate different decision boundaries for the same sample. Moreover, we create multiple uncertainties to assess the quality of the pseudo-labels. Experimental results demonstrate th",
    "link": "http://arxiv.org/abs/2311.01770",
    "context": "Title: Modeling the Uncertainty with Maximum Discrepant Students for Semi-supervised 2D Pose Estimation. (arXiv:2311.01770v1 [cs.CV])\nAbstract: Semi-supervised pose estimation is a practically challenging task for computer vision. Although numerous excellent semi-supervised classification methods have emerged, these methods typically use confidence to evaluate the quality of pseudo-labels, which is difficult to achieve in pose estimation tasks. For example, in pose estimation, confidence represents only the possibility that a position of the heatmap is a keypoint, not the quality of that prediction. In this paper, we propose a simple yet efficient framework to estimate the quality of pseudo-labels in semi-supervised pose estimation tasks from the perspective of modeling the uncertainty of the pseudo-labels. Concretely, under the dual mean-teacher framework, we construct the two maximum discrepant students (MDSs) to effectively push two teachers to generate different decision boundaries for the same sample. Moreover, we create multiple uncertainties to assess the quality of the pseudo-labels. Experimental results demonstrate th",
    "path": "papers/23/11/2311.01770.json",
    "total_tokens": 930,
    "translated_title": "用最大差异模型来建模半监督二维姿态估计中的不确定性",
    "translated_abstract": "半监督姿态估计是计算机视觉中具有实际挑战的任务。虽然出现了许多优秀的半监督分类方法，但这些方法通常使用置信度来评估伪标签的质量，在姿态估计任务中很难实现。例如，在姿态估计中，置信度仅表示热图位置是关键点的可能性，而不是预测的质量。在本文中，我们提出了一个简单而高效的框架，从伪标签的不确定性建模的角度来估计半监督姿态估计任务中的伪标签质量。具体而言，在双平均师傅框架下，我们构建了两个最大差异学生，以有效地推动两个老师为同一样本生成不同的决策边界。此外，我们创建了多个不确定性来评估伪标签的质量。实验结果证明了我们的方法的有效性。",
    "tldr": "本文提出了一个用于半监督姿态估计的简单而高效的框架，从建模伪标签的不确定性的角度来评估伪标签的质量，并通过构建两个最大差异学生来推动老师生成不同的决策边界。实验结果表明了该方法的有效性。"
}