{
    "title": "ForecastPFN: Synthetically-Trained Zero-Shot Forecasting. (arXiv:2311.01933v1 [cs.LG])",
    "abstract": "The vast majority of time-series forecasting approaches require a substantial training dataset. However, many real-life forecasting applications have very little initial observations, sometimes just 40 or fewer. Thus, the applicability of most forecasting methods is restricted in data-sparse commercial applications. While there is recent work in the setting of very limited initial data (so-called `zero-shot' forecasting), its performance is inconsistent depending on the data used for pretraining. In this work, we take a different approach and devise ForecastPFN, the first zero-shot forecasting model trained purely on a novel synthetic data distribution. ForecastPFN is a prior-data fitted network, trained to approximate Bayesian inference, which can make predictions on a new time series dataset in a single forward pass. Through extensive experiments, we show that zero-shot predictions made by ForecastPFN are more accurate and faster compared to state-of-the-art forecasting methods, even",
    "link": "http://arxiv.org/abs/2311.01933",
    "context": "Title: ForecastPFN: Synthetically-Trained Zero-Shot Forecasting. (arXiv:2311.01933v1 [cs.LG])\nAbstract: The vast majority of time-series forecasting approaches require a substantial training dataset. However, many real-life forecasting applications have very little initial observations, sometimes just 40 or fewer. Thus, the applicability of most forecasting methods is restricted in data-sparse commercial applications. While there is recent work in the setting of very limited initial data (so-called `zero-shot' forecasting), its performance is inconsistent depending on the data used for pretraining. In this work, we take a different approach and devise ForecastPFN, the first zero-shot forecasting model trained purely on a novel synthetic data distribution. ForecastPFN is a prior-data fitted network, trained to approximate Bayesian inference, which can make predictions on a new time series dataset in a single forward pass. Through extensive experiments, we show that zero-shot predictions made by ForecastPFN are more accurate and faster compared to state-of-the-art forecasting methods, even",
    "path": "papers/23/11/2311.01933.json",
    "total_tokens": 844,
    "translated_title": "ForecastPFN：合成训练的零样本预测",
    "translated_abstract": "绝大多数时间序列预测方法需要大量的训练数据集。然而，许多现实生活中的预测应用只有非常少的初始观测数据，有时只有40个或更少。因此，大多数预测方法在数据稀疏的商业应用中受到限制。虽然最近在非常有限的初始数据环境下进行了一些研究（所谓的“零样本”预测），但其性能因用于预训练的数据而异。在这项工作中，我们采取了不同的方法，设计了一个名为ForecastPFN的零样本预测模型，仅基于一种新颖的合成数据分布进行训练。ForecastPFN是一个经过数据拟合的网络，训练用于近似贝叶斯推断，可在单个前向传递中对新的时间序列数据集进行预测。通过大量实验，我们展示了ForecastPFN进行的零样本预测比现有技术水平的预测方法更准确和更快。",
    "tldr": "本文提出了一种名为ForecastPFN的零样本预测模型，通过合成数据训练，能够更准确且更快地进行零样本预测。",
    "en_tdlr": "This paper proposes a zero-shot forecasting model called ForecastPFN, trained on synthetic data, which achieves more accurate and faster predictions in zero-shot scenarios."
}