{
    "title": "Analyzing the Evolution and Maintenance of ML Models on Hugging Face",
    "abstract": "arXiv:2311.13380v2 Announce Type: cross  Abstract: Hugging Face (HF) has established itself as a crucial platform for the development and sharing of machine learning (ML) models. This repository mining study, which delves into more than 380,000 models using data gathered via the HF Hub API, aims to explore the community engagement, evolution, and maintenance around models hosted on HF, aspects that have yet to be comprehensively explored in the literature. We first examine the overall growth and popularity of HF, uncovering trends in ML domains, framework usage, authors grouping and the evolution of tags and datasets used. Through text analysis of model card descriptions, we also seek to identify prevalent themes and insights within the developer community. Our investigation further extends to the maintenance aspects of models, where we evaluate the maintenance status of ML models, classify commit messages into various categories (corrective, perfective, and adaptive), analyze the evol",
    "link": "https://arxiv.org/abs/2311.13380",
    "context": "Title: Analyzing the Evolution and Maintenance of ML Models on Hugging Face\nAbstract: arXiv:2311.13380v2 Announce Type: cross  Abstract: Hugging Face (HF) has established itself as a crucial platform for the development and sharing of machine learning (ML) models. This repository mining study, which delves into more than 380,000 models using data gathered via the HF Hub API, aims to explore the community engagement, evolution, and maintenance around models hosted on HF, aspects that have yet to be comprehensively explored in the literature. We first examine the overall growth and popularity of HF, uncovering trends in ML domains, framework usage, authors grouping and the evolution of tags and datasets used. Through text analysis of model card descriptions, we also seek to identify prevalent themes and insights within the developer community. Our investigation further extends to the maintenance aspects of models, where we evaluate the maintenance status of ML models, classify commit messages into various categories (corrective, perfective, and adaptive), analyze the evol",
    "path": "papers/23/11/2311.13380.json",
    "total_tokens": 969,
    "translated_title": "分析Hugging Face上机器学习模型的演化和维护",
    "translated_abstract": "Hugging Face（HF）已成为机器学习（ML）模型开发和分享的重要平台。本研究通过使用HF Hub API收集的数据，对超过380,000个模型进行仓库挖掘，旨在探索HF上托管的模型的社区参与、演化和维护等方面，这些方面在现有文献中尚未全面探讨。我们首先审查了HF的整体增长和受欢迎程度，揭示了ML领域、框架使用、作者分组以及标签和数据集的演化趋势。通过对模型卡片描述的文本分析，我们还试图确定开发者社区中普遍存在的主题和见解。我们的研究进一步涵盖了模型维护方面，在这方面我们评估了ML模型的维护状态，将提交消息分类为不同的类别（校正性、完善性和适应性），分析了模型的演化情况等。",
    "tldr": "本文通过仓库挖掘和文本分析的方式，对Hugging Face上的机器学习模型的演化和维护进行了研究。研究发现了Hugging Face的整体增长和受欢迎程度，揭示了ML领域、框架使用、作者分组等方面的趋势，同时也探讨了开发者社区中普遍存在的主题和见解以及模型的维护状态和演化情况。",
    "en_tdlr": "This paper investigates the evolution and maintenance of machine learning models on Hugging Face through repository mining and text analysis. The study reveals the overall growth and popularity of Hugging Face, trends in ML domains, framework usage, and author grouping. It also explores prevalent themes and insights within the developer community and examines the maintenance status and evolution of models."
}