{
    "title": "ChatTraffic: Text-to-Traffic Generation via Diffusion Model",
    "abstract": "Traffic prediction is one of the most significant foundations in Intelligent Transportation Systems (ITS). Traditional traffic prediction methods rely only on historical traffic data to predict traffic trends and face two main challenges. 1) insensitivity to unusual events. 2) limited performance in long-term prediction. In this work, we explore how generative models combined with text describing the traffic system can be applied for traffic generation, and name the task Text-to-Traffic Generation (TTG). The key challenge of the TTG task is how to associate text with the spatial structure of the road network and traffic data for generating traffic situations. To this end, we propose ChatTraffic, the first diffusion model for text-to-traffic generation. To guarantee the consistency between synthetic and real data, we augment a diffusion model with the Graph Convolutional Network (GCN) to extract spatial correlations of traffic data. In addition, we construct a large dataset containing t",
    "link": "https://arxiv.org/abs/2311.16203",
    "context": "Title: ChatTraffic: Text-to-Traffic Generation via Diffusion Model\nAbstract: Traffic prediction is one of the most significant foundations in Intelligent Transportation Systems (ITS). Traditional traffic prediction methods rely only on historical traffic data to predict traffic trends and face two main challenges. 1) insensitivity to unusual events. 2) limited performance in long-term prediction. In this work, we explore how generative models combined with text describing the traffic system can be applied for traffic generation, and name the task Text-to-Traffic Generation (TTG). The key challenge of the TTG task is how to associate text with the spatial structure of the road network and traffic data for generating traffic situations. To this end, we propose ChatTraffic, the first diffusion model for text-to-traffic generation. To guarantee the consistency between synthetic and real data, we augment a diffusion model with the Graph Convolutional Network (GCN) to extract spatial correlations of traffic data. In addition, we construct a large dataset containing t",
    "path": "papers/23/11/2311.16203.json",
    "total_tokens": 861,
    "translated_title": "ChatTraffic：通过扩散模型实现文本到交通生成",
    "translated_abstract": "交通预测是智能交通系统中最重要的基础之一。传统的交通预测方法只依赖历史交通数据来预测交通趋势，面临两个主要挑战：1）对异常事件不敏感；2）在长期预测方面性能有限。本文探讨了如何将生成模型与描述交通系统的文本结合起来用于交通生成，将此任务命名为文本到交通生成（TTG）。TTG任务的关键挑战是如何将文本与道路网络的空间结构和交通数据相关联，用于生成交通情况。为此，我们提出了ChatTraffic，这是第一个用于文本到交通生成的扩散模型。为了保证合成数据与真实数据的一致性，我们用图卷积网络（GCN）来扩展扩散模型，以提取交通数据的空间相关性。此外，我们构建了一个包含...",
    "tldr": "本研究提出了一种名为ChatTraffic的扩散模型，用于实现文本到交通生成。通过将生成模型与描述交通系统的文本结合，该方法能够解决传统交通预测方法中的两个挑战，并得到与真实交通数据一致的合成数据。",
    "en_tdlr": "This paper introduces ChatTraffic, a diffusion model that generates traffic based on text descriptions. By combining generative models with text, this method addresses the challenges faced by traditional traffic prediction methods and produces synthetic data consistent with real traffic data."
}