{
    "title": "Bank Deposits as {\\em Money Quanta}. (arXiv:2311.01542v1 [q-fin.MF])",
    "abstract": "According to the Accounting View of Money (AVM), the money issued by commercial banks in the form of demand deposits features a hybrid nature, since deposits can be shown to consist of a share of deposits bearing the characteristics of debt (debt-deposits) and a share of deposits bearing the characteristics of equity (equity-deposits), in a mix that depends on factors that relate to the issuing banks and the environment where they operate and interact, which may change over time. Following this important finding of the AVM, it is only consequential to associate the hybrid nature of bank deposits with the dual nature of the objects which is typical in quantum physics, and to investigate whether and how the application of quantum analytical methods and ideas to a form of money showing dualistic features could be used to extract valuable economic information.",
    "link": "http://arxiv.org/abs/2311.01542",
    "context": "Title: Bank Deposits as {\\em Money Quanta}. (arXiv:2311.01542v1 [q-fin.MF])\nAbstract: According to the Accounting View of Money (AVM), the money issued by commercial banks in the form of demand deposits features a hybrid nature, since deposits can be shown to consist of a share of deposits bearing the characteristics of debt (debt-deposits) and a share of deposits bearing the characteristics of equity (equity-deposits), in a mix that depends on factors that relate to the issuing banks and the environment where they operate and interact, which may change over time. Following this important finding of the AVM, it is only consequential to associate the hybrid nature of bank deposits with the dual nature of the objects which is typical in quantum physics, and to investigate whether and how the application of quantum analytical methods and ideas to a form of money showing dualistic features could be used to extract valuable economic information.",
    "path": "papers/23/11/2311.01542.json",
    "total_tokens": 788,
    "translated_title": "银行存款作为货币量子",
    "translated_abstract": "根据会计视角的货币观（AVM），由商业银行以需求存款形式发行的货币具有混合性质，因为存款可以证明由债务性质的存款和股权性质的存款所组成，这种混合取决于与发行银行及其运营和互动环境相关的因素，这些因素可能随时间而变化。根据AVM的这一重要发现，将银行存款的混合性质与在量子物理中典型的双重性质的对象相关联，并探究如何将量子分析方法和思想应用于具有双重特征的货币形式以提取有价值的经济信息。",
    "tldr": "本研究将商业银行发行的存款分为债务性质的存款和股权性质的存款，通过将银行存款的混合性质与量子物理中的双重性质相关联，研究了如何利用量子分析方法和思想来提取有价值的经济信息。",
    "en_tdlr": "This study examines the hybrid nature of bank deposits, which consist of debt-deposits and equity-deposits, and explores the application of quantum analytical methods to extract valuable economic information."
}