{
    "title": "GATSY: Graph Attention Network for Music Artist Similarity. (arXiv:2311.00635v1 [cs.IR])",
    "abstract": "The artist similarity quest has become a crucial subject in social and scientific contexts. Modern research solutions facilitate music discovery according to user tastes. However, defining similarity among artists may involve several aspects, even related to a subjective perspective, and it often affects a recommendation. This paper presents GATSY, a recommendation system built upon graph attention networks and driven by a clusterized embedding of artists. The proposed framework takes advantage of a graph topology of the input data to achieve outstanding performance results without relying heavily on hand-crafted features. This flexibility allows us to introduce fictitious artists in a music dataset, create bridges to previously unrelated artists, and get recommendations conditioned by possibly heterogeneous sources. Experimental results prove the effectiveness of the proposed method with respect to state-of-the-art solutions.",
    "link": "http://arxiv.org/abs/2311.00635",
    "context": "Title: GATSY: Graph Attention Network for Music Artist Similarity. (arXiv:2311.00635v1 [cs.IR])\nAbstract: The artist similarity quest has become a crucial subject in social and scientific contexts. Modern research solutions facilitate music discovery according to user tastes. However, defining similarity among artists may involve several aspects, even related to a subjective perspective, and it often affects a recommendation. This paper presents GATSY, a recommendation system built upon graph attention networks and driven by a clusterized embedding of artists. The proposed framework takes advantage of a graph topology of the input data to achieve outstanding performance results without relying heavily on hand-crafted features. This flexibility allows us to introduce fictitious artists in a music dataset, create bridges to previously unrelated artists, and get recommendations conditioned by possibly heterogeneous sources. Experimental results prove the effectiveness of the proposed method with respect to state-of-the-art solutions.",
    "path": "papers/23/11/2311.00635.json",
    "total_tokens": 830,
    "translated_title": "GATSY: 音乐艺术家相似性的图注意力网络",
    "translated_abstract": "艺术家相似性问题已经成为社会和科学环境中的重要课题。现代研究解决方案根据用户的喜好来促进音乐发现。然而，定义艺术家之间的相似性可能涉及多个方面，甚至与主观角度相关，并且经常影响推荐结果。本文提出了GATSY，这是一个建立在图注意力网络上的推荐系统，并由艺术家的聚类嵌入驱动。所提出的框架利用输入数据的图拓扑结构，在不过分依赖手工特征的情况下取得了卓越的性能结果。这种灵活性使我们能够在音乐数据集中引入虚构的艺术家，与以前不相关的艺术家建立联系，并根据可能的异质来源获得推荐。实验结果证明了该方法相对于现有解决方案的有效性。",
    "tldr": "GATSY是一个基于图注意力网络的音乐艺术家相似性推荐系统，可以灵活地处理多样性和关联性，并在不依赖手工特征的情况下取得卓越的性能结果。",
    "en_tdlr": "GATSY is a recommendation system based on graph attention network for music artist similarity, which achieves outstanding performance results without relying heavily on hand-crafted features and can handle diversity and relevance flexibly."
}