{
    "title": "Investigating Relative Performance of Transfer and Meta Learning. (arXiv:2311.00727v1 [cs.LG])",
    "abstract": "Over the past decade, the field of machine learning has experienced remarkable advancements. While image recognition systems have achieved impressive levels of accuracy, they continue to rely on extensive training datasets. Additionally, a significant challenge has emerged in the form of poor out-of-distribution performance, which necessitates retraining neural networks when they encounter conditions that deviate from their training data. This limitation has notably contributed to the slow progress in self-driving car technology. These pressing issues have sparked considerable interest in methods that enable neural networks to learn effectively from limited data. This paper presents the outcomes of an extensive investigation designed to compare two distinct approaches, transfer learning and meta learning, as potential solutions to this problem. The overarching objective was to establish a robust criterion for selecting the most suitable method in diverse machine learning scenarios. Bui",
    "link": "http://arxiv.org/abs/2311.00727",
    "context": "Title: Investigating Relative Performance of Transfer and Meta Learning. (arXiv:2311.00727v1 [cs.LG])\nAbstract: Over the past decade, the field of machine learning has experienced remarkable advancements. While image recognition systems have achieved impressive levels of accuracy, they continue to rely on extensive training datasets. Additionally, a significant challenge has emerged in the form of poor out-of-distribution performance, which necessitates retraining neural networks when they encounter conditions that deviate from their training data. This limitation has notably contributed to the slow progress in self-driving car technology. These pressing issues have sparked considerable interest in methods that enable neural networks to learn effectively from limited data. This paper presents the outcomes of an extensive investigation designed to compare two distinct approaches, transfer learning and meta learning, as potential solutions to this problem. The overarching objective was to establish a robust criterion for selecting the most suitable method in diverse machine learning scenarios. Bui",
    "path": "papers/23/11/2311.00727.json",
    "total_tokens": 803,
    "translated_title": "研究迁移学习和元学习的相对性能",
    "translated_abstract": "过去十年来，机器学习领域取得了显著的进展。尽管图像识别系统在准确度方面取得了令人印象深刻的成就，但它们仍然依赖于大量的训练数据集。此外，一个重要挑战是在分布外性能方面表现不佳，这要求当神经网络遇到与其训练数据不一致的条件时重新训练。这个限制显著影响了自动驾驶技术的进展。这些紧迫问题引发了对使神经网络能够有效地从有限数据中学习的方法的广泛关注。本文介绍了一项旨在比较两种不同方法——迁移学习和元学习的研究成果，作为解决这个问题的潜在方案。总体目标是建立一个在不同的机器学习场景中选择最适合的方法的稳健标准。",
    "tldr": "本文研究了迁移学习和元学习作为解决有限数据学习问题的两种方法的相对性能，以建立一个在不同的机器学习场景中选择最适合的方法的稳健标准。"
}