{
    "title": "CDGraph: Dual Conditional Social Graph Synthesizing via Diffusion Model. (arXiv:2311.01729v1 [cs.SI])",
    "abstract": "The social graphs synthesized by the generative models are increasingly in demand due to data scarcity and concerns over user privacy. One of the key performance criteria for generating social networks is the fidelity to specified conditionals, such as users with certain membership and financial status. While recent diffusion models have shown remarkable performance in generating images, their effectiveness in synthesizing graphs has not yet been explored in the context of conditional social graphs. In this paper, we propose the first kind of conditional diffusion model for social networks, CDGraph, which trains and synthesizes graphs based on two specified conditions. We propose the co-evolution dependency in the denoising process of CDGraph to capture the mutual dependencies between the dual conditions and further incorporate social homophily and social contagion to preserve the connectivity between nodes while satisfying the specified conditions. Moreover, we introduce a novel class",
    "link": "http://arxiv.org/abs/2311.01729",
    "context": "Title: CDGraph: Dual Conditional Social Graph Synthesizing via Diffusion Model. (arXiv:2311.01729v1 [cs.SI])\nAbstract: The social graphs synthesized by the generative models are increasingly in demand due to data scarcity and concerns over user privacy. One of the key performance criteria for generating social networks is the fidelity to specified conditionals, such as users with certain membership and financial status. While recent diffusion models have shown remarkable performance in generating images, their effectiveness in synthesizing graphs has not yet been explored in the context of conditional social graphs. In this paper, we propose the first kind of conditional diffusion model for social networks, CDGraph, which trains and synthesizes graphs based on two specified conditions. We propose the co-evolution dependency in the denoising process of CDGraph to capture the mutual dependencies between the dual conditions and further incorporate social homophily and social contagion to preserve the connectivity between nodes while satisfying the specified conditions. Moreover, we introduce a novel class",
    "path": "papers/23/11/2311.01729.json",
    "total_tokens": 846,
    "translated_title": "CDGraph：基于扩散模型的双条件社交图合成",
    "translated_abstract": "由生成模型合成的社交图因数据稀缺和用户隐私的担忧而越来越受到需求。生成社交网络的关键性能标准之一是对特定条件的忠实度，例如具有特定会员资格和财务状况的用户。虽然最近的扩散模型在生成图像方面表现出了显着的性能，但它们在条件社交图的合成方面的效果尚未得到研究。在本文中，我们提出了第一种用于社交网络的条件扩散模型CDGraph，它基于两个指定条件来训练和合成图。我们提出了CDGraph的去噪过程中的共同演化依赖性，以捕捉双条件之间的相互依赖关系，并进一步结合社会同质性和社会传染力以保持节点之间的连接性，同时满足指定条件。此外，我们引入了一种新颖的分类",
    "tldr": "本文提出了一种新的条件扩散模型CDGraph用于合成社交图，通过捕捉双条件之间的相互依赖关系和保持节点连通性来实现生成高质量的社交网络。"
}