{
    "title": "Dual input stream transformer for vertical drift correction in eye-tracking reading data",
    "abstract": "arXiv:2311.06095v2 Announce Type: replace-cross  Abstract: We introduce a novel Dual Input Stream Transformer (DIST) for the challenging problem of assigning fixation points from eye-tracking data collected during passage reading to the line of text that the reader was actually focused on. This post-processing step is crucial for analysis of the reading data due to the presence of noise in the form of vertical drift. We evaluate DIST against eleven classical approaches on a comprehensive suite of nine diverse datasets. We demonstrate that combining multiple instances of the DIST model in an ensemble achieves high accuracy across all datasets. Further combining the DIST ensemble with the best classical approach yields an average accuracy of 98.17 %. Our approach presents a significant step towards addressing the bottleneck of manual line assignment in reading research. Through extensive analysis and ablation studies, we identify key factors that contribute to DIST's success, including t",
    "link": "https://arxiv.org/abs/2311.06095",
    "context": "Title: Dual input stream transformer for vertical drift correction in eye-tracking reading data\nAbstract: arXiv:2311.06095v2 Announce Type: replace-cross  Abstract: We introduce a novel Dual Input Stream Transformer (DIST) for the challenging problem of assigning fixation points from eye-tracking data collected during passage reading to the line of text that the reader was actually focused on. This post-processing step is crucial for analysis of the reading data due to the presence of noise in the form of vertical drift. We evaluate DIST against eleven classical approaches on a comprehensive suite of nine diverse datasets. We demonstrate that combining multiple instances of the DIST model in an ensemble achieves high accuracy across all datasets. Further combining the DIST ensemble with the best classical approach yields an average accuracy of 98.17 %. Our approach presents a significant step towards addressing the bottleneck of manual line assignment in reading research. Through extensive analysis and ablation studies, we identify key factors that contribute to DIST's success, including t",
    "path": "papers/23/11/2311.06095.json",
    "total_tokens": 963,
    "translated_title": "用于纠正眼动阅读数据中的垂直漂移的双输入流转换器",
    "translated_abstract": "我们引入了一种新颖的双输入流转换器（DIST），用于解决眼动数据中将注视点分配到实际所关注的文本行的挑战性问题。这一后处理步骤对于阅读数据的分析至关重要，因为存在垂直漂移的噪声。我们在九个不同的数据集上评估DIST与十一种经典方法进行比较。我们证明了将多个DIST模型实例组合成一个集成模型可以在所有数据集上实现高准确性。将DIST集成模型与最佳的经典方法进一步组合，平均准确率达到98.17％。我们的方法在解决阅读研究中手动分配文本行的瓶颈方面迈出了重要一步。通过广泛的分析和消融研究，我们确定了促成DIST成功的关键因素，包括t",
    "tldr": "这篇论文介绍了一种名为Dual Input Stream Transformer（DIST）的转换器，用于解决眼动阅读数据中由于垂直漂移而产生的注视点分配问题。通过与经典方法进行比较，我们展示了DIST在不同数据集上的高准确性，并通过将多个DIST模型实例组合成一个集成模型进一步提高了准确率。这项研究对于解决阅读研究中手动分配文本行的瓶颈具有重要意义。",
    "en_tdlr": "This paper introduces a transformer called Dual Input Stream Transformer (DIST) to address the problem of assigning fixation points in eye-tracking reading data due to vertical drift. By comparing with classical approaches, DIST is demonstrated to achieve high accuracy on different datasets, and further improving the accuracy by combining multiple instances of DIST into an ensemble model. This research is significant for addressing the bottleneck of manual line assignment in reading research."
}