{
    "title": "Evaluation Measures of Individual Item Fairness for Recommender Systems: A Critical Study. (arXiv:2311.01013v1 [cs.IR])",
    "abstract": "Fairness is an emerging and challenging topic in recommender systems. In recent years, various ways of evaluating and therefore improving fairness have emerged. In this study, we examine existing evaluation measures of fairness in recommender systems. Specifically, we focus solely on exposure-based fairness measures of individual items that aim to quantify the disparity in how individual items are recommended to users, separate from item relevance to users. We gather all such measures and we critically analyse their theoretical properties. We identify a series of limitations in each of them, which collectively may render the affected measures hard or impossible to interpret, to compute, or to use for comparing recommendations. We resolve these limitations by redefining or correcting the affected measures, or we argue why certain limitations cannot be resolved. We further perform a comprehensive empirical analysis of both the original and our corrected versions of these fairness measure",
    "link": "http://arxiv.org/abs/2311.01013",
    "context": "Title: Evaluation Measures of Individual Item Fairness for Recommender Systems: A Critical Study. (arXiv:2311.01013v1 [cs.IR])\nAbstract: Fairness is an emerging and challenging topic in recommender systems. In recent years, various ways of evaluating and therefore improving fairness have emerged. In this study, we examine existing evaluation measures of fairness in recommender systems. Specifically, we focus solely on exposure-based fairness measures of individual items that aim to quantify the disparity in how individual items are recommended to users, separate from item relevance to users. We gather all such measures and we critically analyse their theoretical properties. We identify a series of limitations in each of them, which collectively may render the affected measures hard or impossible to interpret, to compute, or to use for comparing recommendations. We resolve these limitations by redefining or correcting the affected measures, or we argue why certain limitations cannot be resolved. We further perform a comprehensive empirical analysis of both the original and our corrected versions of these fairness measure",
    "path": "papers/23/11/2311.01013.json",
    "total_tokens": 908,
    "translated_title": "评估个体项公平性的推荐系统评估指标：一项关键研究",
    "translated_abstract": "公平性是推荐系统中的一个新兴且具有挑战性的话题。近年来，出现了各种评估和改善公平性的方式。本研究对推荐系统中现有的公平性评估指标进行了研究。具体来说，我们仅关注个体项的曝光度公平性评估指标，旨在量化个体项在向用户推荐时的差异，与用户对项的相关性无关。我们收集了所有这些指标，并对它们的理论属性进行了批判性分析。我们发现每个指标都存在一系列限制，这些限制可能使得受影响的指标难以解释、计算或用于比较推荐。我们通过重新定义或纠正受影响的指标来解决这些限制，或者我们解释了为什么某些限制无法解决。我们还对这些公平性指标的原始版本和我们纠正后的版本进行了全面的实证分析。",
    "tldr": "本研究对推荐系统中个体项的公平性评估指标进行了关键研究，并指出了现有指标存在的限制和问题。通过重新定义和纠正这些指标，或者解释为何某些限制无法解决，我们提出了改进的方法。此外，我们还进行了全面的实证分析，验证了这些改进的有效性。",
    "en_tdlr": "This study critically examines existing evaluation measures of individual item fairness in recommender systems, identifying limitations and proposing improvements. The study also conducts a comprehensive empirical analysis to validate the effectiveness of these improvements."
}