{
    "title": "A Bi-level Framework for Traffic Accident Duration Prediction: Leveraging Weather and Road Condition Data within a Practical Optimum Pipeline. (arXiv:2311.00634v1 [cs.AI])",
    "abstract": "Due to the stochastic nature of events, predicting the duration of a traffic incident presents a formidable challenge. Accurate duration estimation can result in substantial advantages for commuters in selecting optimal routes and for traffic management personnel in addressing non-recurring congestion issues. In this study, we gathered accident duration, road conditions, and meteorological data from a database of traffic accidents to check the feasibility of a traffic accident duration pipeline without accident contextual information data like accident severity and textual description. Multiple machine learning models were employed to predict whether an accident's impact on road traffic would be of a short-term or long-term nature, and then utilizing a bimodal approach the precise duration of the incident's effect was determined. Our binary classification random forest model distinguished between short-term and long-term effects with an 83% accuracy rate, while the LightGBM regression ",
    "link": "http://arxiv.org/abs/2311.00634",
    "context": "Title: A Bi-level Framework for Traffic Accident Duration Prediction: Leveraging Weather and Road Condition Data within a Practical Optimum Pipeline. (arXiv:2311.00634v1 [cs.AI])\nAbstract: Due to the stochastic nature of events, predicting the duration of a traffic incident presents a formidable challenge. Accurate duration estimation can result in substantial advantages for commuters in selecting optimal routes and for traffic management personnel in addressing non-recurring congestion issues. In this study, we gathered accident duration, road conditions, and meteorological data from a database of traffic accidents to check the feasibility of a traffic accident duration pipeline without accident contextual information data like accident severity and textual description. Multiple machine learning models were employed to predict whether an accident's impact on road traffic would be of a short-term or long-term nature, and then utilizing a bimodal approach the precise duration of the incident's effect was determined. Our binary classification random forest model distinguished between short-term and long-term effects with an 83% accuracy rate, while the LightGBM regression ",
    "path": "papers/23/11/2311.00634.json",
    "total_tokens": 935,
    "translated_title": "基于气象和道路状况数据的交通事故持续时间预测的双层框架",
    "translated_abstract": "由于事件的随机性，预测交通事故持续时间是一个严峻的挑战。准确的持续时间估计可以为通勤者选择最佳路线和交通管理人员解决非经常性拥堵问题带来巨大优势。本研究从交通事故数据库中收集了事故持续时间、道路状况和气象数据，以检查在没有事故上下文信息数据（如事故严重性和文本描述）的情况下交通事故持续时间管道的可行性。采用多个机器学习模型来预测交通事故对道路交通的影响是短期还是长期，然后利用双模式方法确定事故影响的精确持续时间。我们的二分类随机森林模型可以以83%的准确率区分短期和长期影响，而LightGBM回归模型可以预测事故的精确持续时间。",
    "tldr": "本研究提出了一个双层框架，利用气象和道路状况数据预测交通事故持续时间。通过多个机器学习模型和双模式方法，可以准确预测事故对交通的影响是短期还是长期，并确定事故的精确持续时间。"
}