{
    "title": "EnduRL: Enhancing Safety, Stability, and Efficiency of Mixed Traffic Under Real-World Perturbations Via Reinforcement Learning",
    "abstract": "arXiv:2311.12261v2 Announce Type: replace-cross  Abstract: Human-driven vehicles (HVs) amplify naturally occurring perturbations in traffic, leading to congestion--a major contributor to increased fuel consumption, higher collision risks, and reduced road capacity utilization. While previous research demonstrates that Robot Vehicles (RVs) can be leveraged to mitigate these issues, most such studies rely on simulations with simplistic models of human car-following behaviors. In this work, we analyze real-world driving trajectories and extract a wide range of acceleration profiles. We then incorporates these profiles into simulations for training RVs to mitigate congestion. We evaluate the safety, efficiency, and stability of mixed traffic via comprehensive experiments conducted in two mixed traffic environments (Ring and Bottleneck) at various traffic densities, configurations, and RV penetration rates. The results show that under real-world perturbations, prior RV controllers experienc",
    "link": "https://arxiv.org/abs/2311.12261",
    "context": "Title: EnduRL: Enhancing Safety, Stability, and Efficiency of Mixed Traffic Under Real-World Perturbations Via Reinforcement Learning\nAbstract: arXiv:2311.12261v2 Announce Type: replace-cross  Abstract: Human-driven vehicles (HVs) amplify naturally occurring perturbations in traffic, leading to congestion--a major contributor to increased fuel consumption, higher collision risks, and reduced road capacity utilization. While previous research demonstrates that Robot Vehicles (RVs) can be leveraged to mitigate these issues, most such studies rely on simulations with simplistic models of human car-following behaviors. In this work, we analyze real-world driving trajectories and extract a wide range of acceleration profiles. We then incorporates these profiles into simulations for training RVs to mitigate congestion. We evaluate the safety, efficiency, and stability of mixed traffic via comprehensive experiments conducted in two mixed traffic environments (Ring and Bottleneck) at various traffic densities, configurations, and RV penetration rates. The results show that under real-world perturbations, prior RV controllers experienc",
    "path": "papers/23/11/2311.12261.json",
    "total_tokens": 917,
    "translated_title": "EnduRL: 通过强化学习提高混合交通在真实世界扰动下的安全性、稳定性和效率",
    "translated_abstract": "arXiv:2311.12261v2 公告类型: replace-cross 摘要: 人驾驶车辆（HVs）放大了交通中自然发生的扰动，导致拥堵-这是增加燃油消耗、增加碰撞风险以及减少道路容量利用的主要原因。虽然先前的研究表明，机器人车辆（RVs）可以被利用来缓解这些问题，但大多数此类研究依赖于使用简化的人车跟驰行为模型的模拟。在这项工作中，我们分析了真实世界的行车轨迹并提取了各种加速度曲线。然后将这些曲线结合到模拟中，用于训练RVs以缓解拥堵。我们通过在两种混合交通环境（环形和瓶颈）中进行的综合实验评估了混合交通的安全性、效率和稳定性，包括不同的交通密度、配置和RV渗透率。结果表明，在真实世界的扰动下，先前的RV控制器遇到",
    "tldr": "通过分析真实世界驾驶轨迹并将其应用于机器人车辆训练，可以提高混合交通在各种环境中的安全性、效率和稳定性",
    "en_tdlr": "Analyzing real-world driving trajectories and incorporating them into training of robot vehicles can enhance the safety, efficiency, and stability of mixed traffic in various environments."
}