{
    "title": "Large Language Models to the Rescue: Reducing the Complexity in Scientific Workflow Development Using ChatGPT. (arXiv:2311.01825v1 [cs.DC])",
    "abstract": "Scientific workflow systems are increasingly popular for expressing and executing complex data analysis pipelines over large datasets, as they offer reproducibility, dependability, and scalability of analyses by automatic parallelization on large compute clusters. However, implementing workflows is difficult due to the involvement of many black-box tools and the deep infrastructure stack necessary for their execution. Simultaneously, user-supporting tools are rare, and the number of available examples is much lower than in classical programming languages. To address these challenges, we investigate the efficiency of Large Language Models (LLMs), specifically ChatGPT, to support users when dealing with scientific workflows. We performed three user studies in two scientific domains to evaluate ChatGPT for comprehending, adapting, and extending workflows. Our results indicate that LLMs efficiently interpret workflows but achieve lower performance for exchanging components or purposeful wo",
    "link": "http://arxiv.org/abs/2311.01825",
    "context": "Title: Large Language Models to the Rescue: Reducing the Complexity in Scientific Workflow Development Using ChatGPT. (arXiv:2311.01825v1 [cs.DC])\nAbstract: Scientific workflow systems are increasingly popular for expressing and executing complex data analysis pipelines over large datasets, as they offer reproducibility, dependability, and scalability of analyses by automatic parallelization on large compute clusters. However, implementing workflows is difficult due to the involvement of many black-box tools and the deep infrastructure stack necessary for their execution. Simultaneously, user-supporting tools are rare, and the number of available examples is much lower than in classical programming languages. To address these challenges, we investigate the efficiency of Large Language Models (LLMs), specifically ChatGPT, to support users when dealing with scientific workflows. We performed three user studies in two scientific domains to evaluate ChatGPT for comprehending, adapting, and extending workflows. Our results indicate that LLMs efficiently interpret workflows but achieve lower performance for exchanging components or purposeful wo",
    "path": "papers/23/11/2311.01825.json",
    "total_tokens": 915,
    "translated_title": "大型语言模型拯救行动：使用ChatGPT减少科学工作流开发的复杂性",
    "translated_abstract": "科学工作流系统越来越受欢迎，用于在大型数据集上表达和执行复杂的数据分析流程，因为它们通过在大型计算集群上的自动并行化提供了可复制性、可靠性和可扩展性的分析。然而，由于涉及许多黑盒工具和必要的深层基础设施栈，实现工作流非常困难。与此同时，用户支持工具很少，并且可用示例的数量远远低于传统编程语言。为了解决这些挑战，我们研究了大型语言模型（LLMs），特别是ChatGPT，在处理科学工作流时支持用户的效率。我们在两个科学领域进行了三个用户研究，评估了ChatGPT的理解、适应和扩展工作流的能力。我们的结果表明，LLMs可以有效解释工作流，但在交换组件或有目的的工作方面性能较低。",
    "tldr": "本研究调查了使用大型语言模型ChatGPT支持科学工作流时的效率。通过在两个科学领域进行三个用户研究，研究结果显示LLMs能够高效解释工作流，但在组件交换和有目的工作方面的性能较低。",
    "en_tdlr": "This study investigates the efficiency of using large language models, specifically ChatGPT, to support scientific workflows. Through three user studies in two scientific domains, the results show that LLMs can efficiently interpret workflows but achieve lower performance in component exchange and purposeful work."
}