{
    "title": "Machine-learning optimized measurements of chaotic dynamical systems via the information bottleneck",
    "abstract": "arXiv:2311.04896v2 Announce Type: replace  Abstract: Deterministic chaos permits a precise notion of a \"perfect measurement\" as one that, when obtained repeatedly, captures all of the information created by the system's evolution with minimal redundancy. Finding an optimal measurement is challenging, and has generally required intimate knowledge of the dynamics in the few cases where it has been done. We establish an equivalence between a perfect measurement and a variant of the information bottleneck. As a consequence, we can employ machine learning to optimize measurement processes that efficiently extract information from trajectory data. We obtain approximately optimal measurements for multiple chaotic maps and lay the necessary groundwork for efficient information extraction from general time series.",
    "link": "https://arxiv.org/abs/2311.04896",
    "context": "Title: Machine-learning optimized measurements of chaotic dynamical systems via the information bottleneck\nAbstract: arXiv:2311.04896v2 Announce Type: replace  Abstract: Deterministic chaos permits a precise notion of a \"perfect measurement\" as one that, when obtained repeatedly, captures all of the information created by the system's evolution with minimal redundancy. Finding an optimal measurement is challenging, and has generally required intimate knowledge of the dynamics in the few cases where it has been done. We establish an equivalence between a perfect measurement and a variant of the information bottleneck. As a consequence, we can employ machine learning to optimize measurement processes that efficiently extract information from trajectory data. We obtain approximately optimal measurements for multiple chaotic maps and lay the necessary groundwork for efficient information extraction from general time series.",
    "path": "papers/23/11/2311.04896.json",
    "total_tokens": 708,
    "translated_title": "通过信息瓶颈优化的机器学习测量混沌动态系统",
    "translated_abstract": "确定性混沌允许对“完美测量”的精确概念，即当重复获得时，捕获系统演化所产生的所有信息并具有最小冗余。寻找最佳测量是具有挑战性的，并且在极少数情况下需要对动态的深入了解。我们建立了完美测量和信息瓶颈变种之间的等价性。因此，我们可以利用机器学习来优化测量过程，从轨迹数据有效提取信息。我们获得了多个混沌映射的近似最优测量，并为从一般时间序列中高效提取信息奠定了必要的基础。",
    "tldr": "通过信息瓶颈等效性，我们能够利用机器学习来优化测量过程，实现对混沌动态系统的近似最优测量。",
    "en_tdlr": "By establishing an equivalence between perfect measurement and a variant of the information bottleneck, we can utilize machine learning to optimize measurement processes for approximately optimal measurements of chaotic dynamical systems."
}