{
    "title": "Active Noise Control Portable Device Design. (arXiv:2311.00535v1 [cs.SD])",
    "abstract": "While our world is filled with its own natural sounds that we can't resist enjoying, it is also chock-full of other sounds that can be irritating, this is noise. Noise not only influences the working efficiency but also the human's health. The problem of reducing noise is one of great importance and great difficulty. The problem has been addressed in many ways over the years. The current methods for noise reducing mostly rely on the materials and transmission medium, which are only effective to some extent for the high frequency noise. However, the effective reduction noise method especially for low frequency noise is very limited.  Here we come up with a noise reduction system consist of a sensor to detect the noise in the environment. Then the noise will be sent to an electronic control system to process the noise, which will generate a reverse phase frequency signal to counteract the disturbance. Finally, the processed smaller noise will be broadcasted by the speaker. Through this s",
    "link": "http://arxiv.org/abs/2311.00535",
    "context": "Title: Active Noise Control Portable Device Design. (arXiv:2311.00535v1 [cs.SD])\nAbstract: While our world is filled with its own natural sounds that we can't resist enjoying, it is also chock-full of other sounds that can be irritating, this is noise. Noise not only influences the working efficiency but also the human's health. The problem of reducing noise is one of great importance and great difficulty. The problem has been addressed in many ways over the years. The current methods for noise reducing mostly rely on the materials and transmission medium, which are only effective to some extent for the high frequency noise. However, the effective reduction noise method especially for low frequency noise is very limited.  Here we come up with a noise reduction system consist of a sensor to detect the noise in the environment. Then the noise will be sent to an electronic control system to process the noise, which will generate a reverse phase frequency signal to counteract the disturbance. Finally, the processed smaller noise will be broadcasted by the speaker. Through this s",
    "path": "papers/23/11/2311.00535.json",
    "total_tokens": 864,
    "translated_title": "主动降噪便携式设备设计",
    "translated_abstract": "虽然我们的世界充满了令人愉悦的自然声音，但也充斥着其他让人讨厌的声音，即噪音。噪音不仅影响工作效率，也对人类健康有影响。减少噪音的问题非常重要且困难。多年来，人们通过多种方式来解决这个问题。目前降噪方法大多依赖于材料和传输介质，在高频噪音方面有效，但对低频噪音的降噪方法非常有限。因此，我们提出了一个降噪系统，包括一个传感器来检测环境中的噪音。然后将噪音发送到电子控制系统进行处理，生成一个反位相频率信号来抵消干扰。最后，通过扬声器广播处理后的较小噪音。",
    "tldr": "该论文提出了一种便携式的主动降噪设备设计，通过传感器检测环境中的噪音，经过电子控制系统处理后，使用反位相频率信号来降低噪音。这种方法对低频噪音也更加有效。",
    "en_tdlr": "This paper proposes a portable active noise control device, which detects environmental noise with a sensor and processes it using an electronic control system, generating a reverse-phase frequency signal to reduce the noise. It is especially effective for low-frequency noise."
}