{
    "title": "Augmentation is AUtO-Net: Augmentation-Driven Contrastive Multiview Learning for Medical Image Segmentation. (arXiv:2311.01023v1 [cs.CV])",
    "abstract": "The utilisation of deep learning segmentation algorithms that learn complex organs and tissue patterns and extract essential regions of interest from the noisy background to improve the visual ability for medical image diagnosis has achieved impressive results in Medical Image Computing (MIC). This thesis focuses on retinal blood vessel segmentation tasks, providing an extensive literature review of deep learning-based medical image segmentation approaches while comparing the methodologies and empirical performances. The work also examines the limitations of current state-of-the-art methods by pointing out the two significant existing limitations: data size constraints and the dependency on high computational resources. To address such problems, this work proposes a novel efficient, simple multiview learning framework that contrastively learns invariant vessel feature representation by comparing with multiple augmented views by various transformations to overcome data shortage and impr",
    "link": "http://arxiv.org/abs/2311.01023",
    "context": "Title: Augmentation is AUtO-Net: Augmentation-Driven Contrastive Multiview Learning for Medical Image Segmentation. (arXiv:2311.01023v1 [cs.CV])\nAbstract: The utilisation of deep learning segmentation algorithms that learn complex organs and tissue patterns and extract essential regions of interest from the noisy background to improve the visual ability for medical image diagnosis has achieved impressive results in Medical Image Computing (MIC). This thesis focuses on retinal blood vessel segmentation tasks, providing an extensive literature review of deep learning-based medical image segmentation approaches while comparing the methodologies and empirical performances. The work also examines the limitations of current state-of-the-art methods by pointing out the two significant existing limitations: data size constraints and the dependency on high computational resources. To address such problems, this work proposes a novel efficient, simple multiview learning framework that contrastively learns invariant vessel feature representation by comparing with multiple augmented views by various transformations to overcome data shortage and impr",
    "path": "papers/23/11/2311.01023.json",
    "total_tokens": 882,
    "translated_title": "增强是AUtO-Net：基于增强驱动的对比多视图学习的医学图像分割",
    "translated_abstract": "利用深度学习分割算法学习复杂器官和组织模式，并从噪声背景中提取感兴趣的重要区域，以提高医学图像诊断的视觉能力，在医学图像计算中取得了令人印象深刻的结果。本论文关注视网膜血管分割任务，提供了对基于深度学习的医学图像分割方法的广泛文献综述，并比较了各种方法和实证性能。本研究还通过指出两个重要现有限制（数据大小约束和对高计算资源的依赖性）来检查当前最先进方法的局限性。为了解决这些问题，本文提出了一种新颖的高效简单的多视图学习框架，通过与多个增强视图进行对比性学习不变的血管特征表示，以克服数据短缺和计算资源依赖的问题。",
    "tldr": "本论文提出了一种基于增强驱动的对比多视图学习框架用于医学图像分割，通过与多个增强视图进行对比性学习不变的特征表示，以克服数据短缺和计算资源依赖的问题。"
}