{
    "title": "Identifying Alzheimer Disease Dementia Levels Using Machine Learning Methods. (arXiv:2311.01428v1 [cs.LG])",
    "abstract": "Dementia, a prevalent neurodegenerative condition, is a major manifestation of Alzheimer's disease (AD). As the condition progresses from mild to severe, it significantly impairs the individual's ability to perform daily tasks independently, necessitating the need for timely and accurate AD classification. Machine learning or deep learning models have emerged as effective tools for this purpose. In this study, we suggested an approach for classifying the four stages of dementia using RF, SVM, and CNN algorithms, augmented with watershed segmentation for feature extraction from MRI images. Our results reveal that SVM with watershed features achieves an impressive accuracy of 96.25%, surpassing other classification methods. The ADNI dataset is utilized to evaluate the effectiveness of our method, and we observed that the inclusion of watershed segmentation contributes to the enhanced performance of the models.",
    "link": "http://arxiv.org/abs/2311.01428",
    "context": "Title: Identifying Alzheimer Disease Dementia Levels Using Machine Learning Methods. (arXiv:2311.01428v1 [cs.LG])\nAbstract: Dementia, a prevalent neurodegenerative condition, is a major manifestation of Alzheimer's disease (AD). As the condition progresses from mild to severe, it significantly impairs the individual's ability to perform daily tasks independently, necessitating the need for timely and accurate AD classification. Machine learning or deep learning models have emerged as effective tools for this purpose. In this study, we suggested an approach for classifying the four stages of dementia using RF, SVM, and CNN algorithms, augmented with watershed segmentation for feature extraction from MRI images. Our results reveal that SVM with watershed features achieves an impressive accuracy of 96.25%, surpassing other classification methods. The ADNI dataset is utilized to evaluate the effectiveness of our method, and we observed that the inclusion of watershed segmentation contributes to the enhanced performance of the models.",
    "path": "papers/23/11/2311.01428.json",
    "total_tokens": 876,
    "translated_title": "使用机器学习方法鉴别阿尔茨海默病痴呆水平",
    "translated_abstract": "痴呆是一种常见的神经退行性疾病，是阿尔茨海默病的主要表现。随着病情从轻度到严重的进展，显著影响患者独立完成日常任务的能力，迫切需要及时准确的阿尔茨海默病分类。机器学习或深度学习模型已成为达到此目的的有效工具。在本研究中，我们提出了一种通过RF、SVM和CNN算法结合MRI图像的分水岭分割进行特征提取的方法来对四个痴呆阶段进行分类。我们的结果表明，SVM结合分水岭特征的准确率达到了96.25%，超过了其他分类方法。我们使用ADNI数据集评估了我们方法的有效性，并观察到分水岭分割的引入提升了模型的性能。",
    "tldr": "本研究提出了一种使用RF、SVM和CNN算法结合MRI图像分水岭分割进行特征提取的方法来鉴别四个阿尔茨海默病痴呆阶段的分类，其中SVM结合分水岭特征的准确率达到了96.25%。",
    "en_tdlr": "This study proposes a method using RF, SVM, and CNN algorithms combined with watershed segmentation on MRI images for feature extraction to classify the four stages of Alzheimer's disease dementia. The SVM with watershed features achieves an accuracy of 96.25%, surpassing other classification methods."
}