{
    "title": "Measuring Entrainment in Spontaneous Code-switched Speech",
    "abstract": "arXiv:2311.07703v2 Announce Type: replace  Abstract: It is well-known that speakers who entrain to one another have more successful conversations than those who do not. Previous research has shown that interlocutors entrain on linguistic features in both written and spoken monolingual domains. More recent work on code-switched communication has also shown preliminary evidence of entrainment on certain aspects of code-switching (CSW). However, such studies of entrainment in code-switched domains have been extremely few and restricted to human-machine textual interactions. Our work studies code-switched spontaneous speech between humans, finding that (1) patterns of written and spoken entrainment in monolingual settings largely generalize to code-switched settings, and (2) some patterns of entrainment on code-switching in dialogue agent-generated text generalize to spontaneous code-switched speech. Our findings give rise to important implications for the potentially \"universal\" nature of",
    "link": "https://arxiv.org/abs/2311.07703",
    "context": "Title: Measuring Entrainment in Spontaneous Code-switched Speech\nAbstract: arXiv:2311.07703v2 Announce Type: replace  Abstract: It is well-known that speakers who entrain to one another have more successful conversations than those who do not. Previous research has shown that interlocutors entrain on linguistic features in both written and spoken monolingual domains. More recent work on code-switched communication has also shown preliminary evidence of entrainment on certain aspects of code-switching (CSW). However, such studies of entrainment in code-switched domains have been extremely few and restricted to human-machine textual interactions. Our work studies code-switched spontaneous speech between humans, finding that (1) patterns of written and spoken entrainment in monolingual settings largely generalize to code-switched settings, and (2) some patterns of entrainment on code-switching in dialogue agent-generated text generalize to spontaneous code-switched speech. Our findings give rise to important implications for the potentially \"universal\" nature of",
    "path": "papers/23/11/2311.07703.json",
    "total_tokens": 860,
    "translated_title": "测量自发混合语音中的同步性",
    "translated_abstract": "众所周知，那些相互同步的说话者比那些不同步的说话者有更成功的对话。先前的研究表明，交际者在书面和口头单语领域都会同步语言特征。更近期关于混合语言交流的研究也显示了在一些代码切换（CSW）方面存在同步的初步证据。然而，这些关于混合语音领域的同步研究非常少，并且局限于人机文本互动。我们的工作研究了人与人之间的混合语音自发语音，发现（1）书面和口语单语环境中的同步模式在混合语言环境中大体上是普适的，（2）对话系统生成的文本中的代码切换同步模式在自发混合语音中也是普适的。我们的发现对于可能具有“普遍”性的重要含义。",
    "tldr": "研究发现人与人之间的混合语音自发语音中存在与书面和口语单语环境同步的模式，并且对话系统生成的文本中的代码切换同步模式在这种环境中也是普适的。"
}