{
    "title": "S-ConvNet: A Shallow Convolutional Neural Network Architecture for Neuromuscular Activity Recognition Using Instantaneous High-Density Surface EMG Images. (arXiv:1906.03381v1 [eess.SP] CROSS LISTED)",
    "abstract": "The concept of neuromuscular activity recognition using instantaneous high-density surface electromyography (HD-sEMG) images opens up new avenues for the development of more fluid and natural muscle-computer interfaces. However, the existing approaches employed a very large deep convolutional neural network (ConvNet) architecture and complex training schemes for HD-sEMG image recognition, which requires the network architecture to be pre-trained on a very large-scale labeled training dataset, as a result, it makes computationally very expensive. To overcome this problem, we propose S-ConvNet and All-ConvNet models, a simple yet efficient framework for learning instantaneous HD-sEMG images from scratch for neuromuscular activity recognition. Without using any pre-trained models, our proposed S-ConvNet and All-ConvNet demonstrate very competitive recognition accuracy to the more complex state of the art for neuromuscular activity recognition based on instantaneous HD-sEMG images, while u",
    "link": "http://arxiv.org/abs/1906.03381",
    "context": "Title: S-ConvNet: A Shallow Convolutional Neural Network Architecture for Neuromuscular Activity Recognition Using Instantaneous High-Density Surface EMG Images. (arXiv:1906.03381v1 [eess.SP] CROSS LISTED)\nAbstract: The concept of neuromuscular activity recognition using instantaneous high-density surface electromyography (HD-sEMG) images opens up new avenues for the development of more fluid and natural muscle-computer interfaces. However, the existing approaches employed a very large deep convolutional neural network (ConvNet) architecture and complex training schemes for HD-sEMG image recognition, which requires the network architecture to be pre-trained on a very large-scale labeled training dataset, as a result, it makes computationally very expensive. To overcome this problem, we propose S-ConvNet and All-ConvNet models, a simple yet efficient framework for learning instantaneous HD-sEMG images from scratch for neuromuscular activity recognition. Without using any pre-trained models, our proposed S-ConvNet and All-ConvNet demonstrate very competitive recognition accuracy to the more complex state of the art for neuromuscular activity recognition based on instantaneous HD-sEMG images, while u",
    "path": "papers/19/06/1906.03381.json",
    "total_tokens": 949,
    "translated_title": "S-ConvNet: 一种深度表面肌电图像神经肌肉活动识别的浅层卷积神经网络架构",
    "translated_abstract": "利用瞬时高密度表面肌电图像进行神经肌肉活动识别的概念为开发更流畅和自然的肌肉-计算机接口开辟了新的途径。然而，现有的方法采用了非常大的深度卷积神经网络(ConvNet)架构和复杂的训练方案来进行HD-sEMG图像识别，需要在非常大规模的标记训练数据集上预训练网络架构，因此计算非常昂贵。为了解决这个问题，本文提出了一种简单而有效的学习即时HD-sEMG图像的神经肌肉活动识别框架——S-ConvNet和All-ConvNet模型。在不使用任何预训练模型的情况下，我们提出的S-ConvNet和All-ConvNet表现出了非常具有竞争力的识别准确性，比基于瞬时HD-sEMG图像的神经肌肉活动识别的更复杂的最先进技术更具优势。",
    "tldr": "S-ConvNet和All-ConvNet模型为神经肌肉活动识别提出了一种简单而有效的学习框架，不需要预训练，表现出非常具有竞争力的识别准确性。"
}