{
    "title": "Bias-Aware Inference in Fuzzy Regression Discontinuity Designs. (arXiv:1906.04631v4 [econ.EM] UPDATED)",
    "abstract": "We propose new confidence sets (CSs) for the regression discontinuity parameter in fuzzy designs. Our CSs are based on local linear regression, and are bias-aware, in the sense that they take possible bias explicitly into account. Their construction shares similarities with that of Anderson-Rubin CSs in exactly identified instrumental variable models, and thereby avoids issues with \"delta method\" approximations that underlie most commonly used existing inference methods for fuzzy regression discontinuity analysis. Our CSs are asymptotically equivalent to existing procedures in canonical settings with strong identification and a continuous running variable. However, due to their particular construction they are also valid under a wide range of empirically relevant conditions in which existing methods can fail, such as setups with discrete running variables, donut designs, and weak identification.",
    "link": "http://arxiv.org/abs/1906.04631",
    "context": "Title: Bias-Aware Inference in Fuzzy Regression Discontinuity Designs. (arXiv:1906.04631v4 [econ.EM] UPDATED)\nAbstract: We propose new confidence sets (CSs) for the regression discontinuity parameter in fuzzy designs. Our CSs are based on local linear regression, and are bias-aware, in the sense that they take possible bias explicitly into account. Their construction shares similarities with that of Anderson-Rubin CSs in exactly identified instrumental variable models, and thereby avoids issues with \"delta method\" approximations that underlie most commonly used existing inference methods for fuzzy regression discontinuity analysis. Our CSs are asymptotically equivalent to existing procedures in canonical settings with strong identification and a continuous running variable. However, due to their particular construction they are also valid under a wide range of empirically relevant conditions in which existing methods can fail, such as setups with discrete running variables, donut designs, and weak identification.",
    "path": "papers/19/06/1906.04631.json",
    "total_tokens": 869,
    "translated_title": "在模糊回归不连续设计中的偏差感知推断",
    "translated_abstract": "我们针对模糊设计中的回归不连续参数提出了新的置信区间（CS），这些CS基于局部线性回归，并且在可能的偏差方面是感知的，即它们明确地考虑了可能的偏差。它们的构造与完全确定的工具变量模型中的Anderson-Rubin CS相似，从而避免了大多数常用的模糊回归不连续分析现有推断方法中依赖于\"delta method\"逼近的问题。我们的CS在具有强识别和连续运行变量的经典设置中与现有程序渐进等价。然而，由于其特殊构造，它们在许多实际相关条件下也是有效的，而现有方法可能会失败，例如离散运行变量、环形设计和弱识别设置。",
    "tldr": "本文提出了一种新的置信区间方法，针对模糊设计中的回归不连续参数，该方法基于局部线性回归，并且明确考虑了可能的偏差。与常用的模糊回归不连续分析推断方法不同，该方法避免了\"delta method\"逼近问题，并在多种实际相关条件下都是有效的。"
}