{
    "title": "Stochastic PDEs for large portfolios with general mean-reverting volatility processes",
    "abstract": "arXiv:1906.05898v4 Announce Type: replace-cross  Abstract: We consider a structural stochastic volatility model for the loss from a large portfolio of credit risky assets. Both the asset value and the volatility processes are correlated through systemic Brownian motions, with default determined by the asset value reaching a lower boundary. We prove that if our volatility models are picked from a class of mean-reverting diffusions, the system converges as the portfolio becomes large and, when the vol-of-vol function satisfies certain regularity and boundedness conditions, the limit of the empirical measure process has a density given in terms of a solution to a stochastic initial-boundary value problem on a half-space. The problem is defined in a special weighted Sobolev space. Regularity results are established for solutions to this problem, and then we show that there exists a unique solution. In contrast to the CIR volatility setting covered by the existing literature, our results ho",
    "link": "https://arxiv.org/abs/1906.05898",
    "context": "Title: Stochastic PDEs for large portfolios with general mean-reverting volatility processes\nAbstract: arXiv:1906.05898v4 Announce Type: replace-cross  Abstract: We consider a structural stochastic volatility model for the loss from a large portfolio of credit risky assets. Both the asset value and the volatility processes are correlated through systemic Brownian motions, with default determined by the asset value reaching a lower boundary. We prove that if our volatility models are picked from a class of mean-reverting diffusions, the system converges as the portfolio becomes large and, when the vol-of-vol function satisfies certain regularity and boundedness conditions, the limit of the empirical measure process has a density given in terms of a solution to a stochastic initial-boundary value problem on a half-space. The problem is defined in a special weighted Sobolev space. Regularity results are established for solutions to this problem, and then we show that there exists a unique solution. In contrast to the CIR volatility setting covered by the existing literature, our results ho",
    "path": "papers/19/06/1906.05898.json",
    "total_tokens": 913,
    "translated_title": "具有一般均值回归波动率过程的大型投资组合的随机偏微分方程",
    "translated_abstract": "我们考虑一个结构性随机波动率模型，用于对一个大型信用风险资产组合的损失进行建模。资产价值和波动率过程都通过系统性布朗运动进行相关，违约由资产价值达到下限确定。我们证明，如果我们的波动率模型来自一类均值回归扩散过程，那么当投资组合变大时系统会收敛，而当波动率函数满足一定的正则性和有界性条件时，经验测度过程的极限具有一个密度，该密度由半空间上的随机初边值问题的解给出。该问题在特殊加权Sobolev空间中定义。我们为解决方案建立了正则性结果，然后证明存在唯一解。与现有文献覆盖的CIR波动率设置相比，我们的结果ho",
    "tldr": "该研究提出了一个结构性随机波动率模型，用于大型信用风险资产组合的损失建模，并证明了在投资组合规模变大时系统会收敛，同时提出了一种密度方程，描述了经验测度过程的极限情况，并且解决方案在特殊加权Sobolev空间中定义。",
    "en_tdlr": "This study presents a structural stochastic volatility model for modeling the loss of a large portfolio of credit risky assets, and proves the convergence of the system as the portfolio size increases, while introducing a density equation describing the limit of the empirical measure process, with the solution defined in a special weighted Sobolev space."
}