{
    "title": "ENCORE: Ensemble Learning using Convolution Neural Machine Translation for Automatic Program Repair",
    "abstract": "arXiv:1906.08691v2 Announce Type: replace-cross  Abstract: Automated generate-and-validate (G&V) program repair techniques typically rely on hard-coded rules, only fix bugs following specific patterns, and are hard to adapt to different programming languages. We propose ENCORE, a new G&V technique, which uses ensemble learning on convolutional neural machine translation (NMT) models to automatically fix bugs in multiple programming languages.   We take advantage of the randomness in hyper-parameter tuning to build multiple models that fix different bugs and combine them using ensemble learning. This new convolutional NMT approach outperforms the standard long short-term memory (LSTM) approach used in previous work, as it better captures both local and long-distance connections between tokens.   Our evaluation on two popular benchmarks, Defects4J and QuixBugs, shows that ENCORE fixed 42 bugs, including 16 that have not been fixed by existing techniques. In addition, ENCORE is the first ",
    "link": "https://arxiv.org/abs/1906.08691",
    "context": "Title: ENCORE: Ensemble Learning using Convolution Neural Machine Translation for Automatic Program Repair\nAbstract: arXiv:1906.08691v2 Announce Type: replace-cross  Abstract: Automated generate-and-validate (G&V) program repair techniques typically rely on hard-coded rules, only fix bugs following specific patterns, and are hard to adapt to different programming languages. We propose ENCORE, a new G&V technique, which uses ensemble learning on convolutional neural machine translation (NMT) models to automatically fix bugs in multiple programming languages.   We take advantage of the randomness in hyper-parameter tuning to build multiple models that fix different bugs and combine them using ensemble learning. This new convolutional NMT approach outperforms the standard long short-term memory (LSTM) approach used in previous work, as it better captures both local and long-distance connections between tokens.   Our evaluation on two popular benchmarks, Defects4J and QuixBugs, shows that ENCORE fixed 42 bugs, including 16 that have not been fixed by existing techniques. In addition, ENCORE is the first ",
    "path": "papers/19/06/1906.08691.json",
    "total_tokens": 931,
    "translated_title": "ENCORE：使用卷积神经机器翻译的集成学习进行自动程序修复",
    "translated_abstract": "arXiv:1906.08691v2 通告类型: 交叉替换 摘要: 自动生成验证（G&V）程序修复技术通常依赖硬编码规则，仅修复遵循特定模式的错误，并且难以适应不同的编程语言。我们提出了ENCORE，一种新的G&V技术，它利用卷积神经机器翻译（NMT）模型的集成学习来自动修复多种编程语言中的错误。我们利用超参数调整的随机性构建多个模型，这些模型修复不同的错误，并使用集成学习将它们结合在一起。这种新的卷积NMT方法优于之前工作中使用的标准长短期记忆（LSTM）方法，因为它更好地捕捉了令牌之间的局部和长距离连接。我们在两个流行的基准测试集Defects4J和QuixBugs上的评估显示，ENCORE修复了42个错误，其中包括16个未被现有技术修复的错误。",
    "tldr": "ENCORE提出了一种新的自动程序修复技术，使用卷积神经机器翻译的集成学习方法可以有效修复多种编程语言中的错误，超越了之前使用的LSTM方法，成功修复了42个错误，其中包括16个先前未被修复的错误。",
    "en_tdlr": "ENCORE proposes a new automatic program repair technique using ensemble learning with convolution neural machine translation, outperforming the LSTM approach used previously, fixing 42 bugs including 16 not fixed before."
}