{
    "title": "Gift Contagion in Online Groups: Evidence From Virtual Red Packets. (arXiv:1906.09698v5 [econ.GN] UPDATED)",
    "abstract": "Gifts are important instruments for forming bonds in interpersonal relationships. Our study analyzes the phenomenon of gift contagion in online groups. Gift contagion encourages social bonds by prompting further gifts; it may also promote group interaction and solidarity. Using data on 36 million online red packet gifts on a large social site in East Asia, we leverage a natural experimental design to identify the social contagion of gift giving in online groups. Our natural experiment is enabled by the randomization of the gift amount allocation algorithm on the platform, which addresses the common challenge of causal identifications in observational data. Our study provides evidence of gift contagion: on average, receiving one additional dollar causes a recipient to send 18 cents back to the group within the subsequent 24 hours. Decomposing this effect, we find that it is mainly driven by the extensive margin -- more recipients are triggered to send red packets. Moreover, we find that",
    "link": "http://arxiv.org/abs/1906.09698",
    "context": "Title: Gift Contagion in Online Groups: Evidence From Virtual Red Packets. (arXiv:1906.09698v5 [econ.GN] UPDATED)\nAbstract: Gifts are important instruments for forming bonds in interpersonal relationships. Our study analyzes the phenomenon of gift contagion in online groups. Gift contagion encourages social bonds by prompting further gifts; it may also promote group interaction and solidarity. Using data on 36 million online red packet gifts on a large social site in East Asia, we leverage a natural experimental design to identify the social contagion of gift giving in online groups. Our natural experiment is enabled by the randomization of the gift amount allocation algorithm on the platform, which addresses the common challenge of causal identifications in observational data. Our study provides evidence of gift contagion: on average, receiving one additional dollar causes a recipient to send 18 cents back to the group within the subsequent 24 hours. Decomposing this effect, we find that it is mainly driven by the extensive margin -- more recipients are triggered to send red packets. Moreover, we find that",
    "path": "papers/19/06/1906.09698.json",
    "total_tokens": 963,
    "translated_title": "在线群组中的礼物传染：来自虚拟红包的证据",
    "translated_abstract": "礼物在人际关系中形成纽带的重要工具。我们的研究分析了在线群组中的礼物传染现象。礼物传染通过促使进一步的礼物来鼓励社交纽带；它还可以促进群组互动和团结。我们利用东亚大型社交网站上3600万个在线红包礼物的数据，利用自然实验设计来识别在线群组中礼物赠送的社交传染现象。我们的自然实验得以实现的原因是平台上礼物金额分配算法的随机化，这解决了观察数据中因果识别的常见挑战。我们的研究提供了礼物传染的证据：平均而言，接收到额外的一美元会导致接收者在随后的24小时内向群组发送18美分。分解这个效应，我们发现主要是由广泛边际所驱动--更多的接收者被触发发送红包。此外，我们发现...",
    "tldr": "通过分析东亚大型社交网站上的红包礼物数据，我们研究了在线群组中的礼物传染现象，发现接收到额外的一美元会导致接收者在随后的24小时内向群组发送18美分。这种效应主要是由更多的接收者被触发发送红包所驱动。",
    "en_tdlr": "By analyzing red packet gift data from a large social site in East Asia, our study investigates the phenomenon of gift contagion in online groups and finds that receiving an additional dollar prompts recipients to send back 18 cents to the group within the subsequent 24 hours. This effect is mainly driven by triggering more recipients to send red packets."
}