{
    "title": "Net gains in evolutionary dynamics: A unifying and intuitive approach to dynamic stability. (arXiv:1805.04898v9 [math.OC] UPDATED)",
    "abstract": "Static stability in economic models means negative incentives for deviation from equilibrium strategies, which we expect to assure a return to equilibrium, i.e., dynamic stability, as long as agents respond to incentives. There have been many attempts to prove this link, especially in evolutionary game theory, yielding both negative and positive results. This paper presents a universal and intuitive approach to this link. We prove that static stability assures dynamic stability if agents' choices of switching strategies are rationalizable by introducing costs and constraints in those switching decisions. This idea guides us to define \\textit{net }gains from switches as the payoff improvement after deducting the costs. Under rationalizable dynamics, an agent maximizes the expected net gain subject to the constraints. We prove that the aggregate maximized expected net gain works as a Lyapunov function. It also explains reasons behind the known negative results. While our analysis here is",
    "link": "http://arxiv.org/abs/1805.04898",
    "context": "Title: Net gains in evolutionary dynamics: A unifying and intuitive approach to dynamic stability. (arXiv:1805.04898v9 [math.OC] UPDATED)\nAbstract: Static stability in economic models means negative incentives for deviation from equilibrium strategies, which we expect to assure a return to equilibrium, i.e., dynamic stability, as long as agents respond to incentives. There have been many attempts to prove this link, especially in evolutionary game theory, yielding both negative and positive results. This paper presents a universal and intuitive approach to this link. We prove that static stability assures dynamic stability if agents' choices of switching strategies are rationalizable by introducing costs and constraints in those switching decisions. This idea guides us to define \\textit{net }gains from switches as the payoff improvement after deducting the costs. Under rationalizable dynamics, an agent maximizes the expected net gain subject to the constraints. We prove that the aggregate maximized expected net gain works as a Lyapunov function. It also explains reasons behind the known negative results. While our analysis here is",
    "path": "papers/18/05/1805.04898.json",
    "total_tokens": 966,
    "translated_title": "进化动力学中的净收益：一种统一而直观的动态稳定性方法",
    "translated_abstract": "经济模型中的静态稳定性意味着对离开平衡策略的负面激励，我们期望只要代理人对激励做出反应，就能确保回归平衡，即动态稳定性。迄今为止，已经有很多尝试证明这种联系，特别是在进化博弈论中，得出了负面和正面的结果。本文介绍了一种通用和直观的方法来解决这种联系。我们证明了只要代理人的策略切换选择是合理化的，即引入成本和约束，静态稳定性就能确保动态稳定性。这一思想引导我们将策略切换的“净收益”定义为在扣除成本后的收益改善。在合理化的动态中，代理人最大化预期的净收益，同时满足约束条件。我们证明了最大化的预期净收益对于Lyapunov函数起作用。它也解释了已知负面结果的原因。虽然我们的分析在这里是...",
    "tldr": "本研究提出了一种统一而直观的方法来证明静态稳定性确保动态稳定性的联系，即代理人的策略切换选择合理化。我们证明了合理化动态中的最大化预期净收益作为Lyapunov函数，并解释了负面结果的原因。",
    "en_tdlr": "This study presents a unified and intuitive approach to prove the link between static stability and dynamic stability in evolutionary dynamics, by rationalizing agents' choices of switching strategies. It is proven that maximizing the expected net gain under rationalized dynamics acts as a Lyapunov function, and explanations for negative results are provided."
}