{
    "title": "Predicting Race and Ethnicity From the Sequence of Characters in a Name. (arXiv:1805.02109v2 [stat.AP] UPDATED)",
    "abstract": "To answer questions about racial inequality and fairness, we often need a way to infer race and ethnicity from names. One way to infer race and ethnicity from names is by relying on the Census Bureau's list of popular last names. The list, however, suffers from at least three limitations: 1. it only contains last names, 2. it only includes popular last names, and 3. it is updated once every 10 years. To provide better generalization, and higher accuracy when first names are available, we model the relationship between characters in a name and race and ethnicity using various techniques. A model using Long Short-Term Memory works best with out-of-sample accuracy of .85. The best-performing last-name model achieves out-of-sample accuracy of .81. To illustrate the utility of the models, we apply them to campaign finance data to estimate the share of donations made by people of various racial groups, and to news data to estimate the coverage of various races and ethnicities in the news.",
    "link": "http://arxiv.org/abs/1805.02109",
    "context": "Title: Predicting Race and Ethnicity From the Sequence of Characters in a Name. (arXiv:1805.02109v2 [stat.AP] UPDATED)\nAbstract: To answer questions about racial inequality and fairness, we often need a way to infer race and ethnicity from names. One way to infer race and ethnicity from names is by relying on the Census Bureau's list of popular last names. The list, however, suffers from at least three limitations: 1. it only contains last names, 2. it only includes popular last names, and 3. it is updated once every 10 years. To provide better generalization, and higher accuracy when first names are available, we model the relationship between characters in a name and race and ethnicity using various techniques. A model using Long Short-Term Memory works best with out-of-sample accuracy of .85. The best-performing last-name model achieves out-of-sample accuracy of .81. To illustrate the utility of the models, we apply them to campaign finance data to estimate the share of donations made by people of various racial groups, and to news data to estimate the coverage of various races and ethnicities in the news.",
    "path": "papers/18/05/1805.02109.json",
    "total_tokens": 900,
    "translated_title": "从名字中的字符序列预测种族和民族",
    "translated_abstract": "为了回答关于种族不平等和公正性的问题，我们经常需要一种从名字中推断种族和民族的方法。一种从名字中推断种族和民族的方法是依赖于人口普查局的热门姓氏列表。然而，该列表存在至少三个限制：1. 它只包含姓氏，2. 它只包含常见的姓氏，3. 它每10年更新一次。为了提供更好的泛化能力，并在名字可用时提高准确性，我们使用各种技术建立了名字中的字符与种族和民族之间的关系模型。使用长短期记忆的模型具有最佳的样本外准确性，为0.85。最佳表现的姓氏模型的样本外准确性为0.81。为了说明模型的实用性，我们将其应用于竞选资金数据，估计不同种族群体的捐款份额，并将其应用于新闻数据，估计新闻中各种种族和民族的报道情况。",
    "tldr": "通过分析名字中的字符序列，可以预测种族和民族，并应用于竞选资金数据和新闻报道中。",
    "en_tdlr": "The paper proposes a method to infer race and ethnicity from names by analyzing the sequence of characters. It overcomes limitations of existing methods and achieves high accuracy. The method is applied to estimate the share of donations made by different racial groups in campaign finance data, as well as the coverage of various races and ethnicities in news."
}