{
    "title": "Unsupervised tree boosting for learning probability distributions. (arXiv:2101.11083v7 [stat.ME] UPDATED)",
    "abstract": "We propose an unsupervised tree boosting algorithm for inferring the underlying sampling distribution of an i.i.d. sample based on fitting additive tree ensembles in a fashion analogous to supervised tree boosting. Integral to the algorithm is a new notion of \"addition\" on probability distributions that leads to a coherent notion of \"residualization\", i.e., subtracting a probability distribution from an observation to remove the distributional structure from the sampling distribution of the latter. We show that these notions arise naturally for univariate distributions through cumulative distribution function (CDF) transforms and compositions due to several \"group-like\" properties of univariate CDFs. While the traditional multivariate CDF does not preserve these properties, a new definition of multivariate CDF can restore these properties, thereby allowing the notions of \"addition\" and \"residualization\" to be formulated for multivariate settings as well. This then gives rise to the uns",
    "link": "http://arxiv.org/abs/2101.11083",
    "context": "Title: Unsupervised tree boosting for learning probability distributions. (arXiv:2101.11083v7 [stat.ME] UPDATED)\nAbstract: We propose an unsupervised tree boosting algorithm for inferring the underlying sampling distribution of an i.i.d. sample based on fitting additive tree ensembles in a fashion analogous to supervised tree boosting. Integral to the algorithm is a new notion of \"addition\" on probability distributions that leads to a coherent notion of \"residualization\", i.e., subtracting a probability distribution from an observation to remove the distributional structure from the sampling distribution of the latter. We show that these notions arise naturally for univariate distributions through cumulative distribution function (CDF) transforms and compositions due to several \"group-like\" properties of univariate CDFs. While the traditional multivariate CDF does not preserve these properties, a new definition of multivariate CDF can restore these properties, thereby allowing the notions of \"addition\" and \"residualization\" to be formulated for multivariate settings as well. This then gives rise to the uns",
    "path": "papers/21/01/2101.11083.json",
    "total_tokens": 975,
    "translated_title": "无监督树提升学习概率分布",
    "translated_abstract": "我们提出了一种无监督树提升算法，用于根据拟合叠加树集合来推断独立同分布样本的潜在采样分布，其类似于监督树提升。该算法的核心是一种新的概率分布上的\"加法\"概念，该概念引出了\"剩余化\"的一致概念，即从观测中减去概率分布，以消除后者的采样分布中的分布结构。我们通过累积分布函数（CDF）变换和组合展示了这些概念在一维分布中的自然出现，由于一维CDF的几个\"类似群体\"属性。虽然传统的多元CDF不保留这些属性，但新的多元CDF定义可以恢复这些属性，从而使\"加法\"和\"剩余化\"的概念也可以在多元设置中得到规范。这样就产生了",
    "tldr": "本文提出了一种无监督树提升算法，通过拟合叠加树集合来推断独立同分布样本的潜在采样分布，其中关键是引入了新的概率分布上的\"加法\"概念和与之相对应的\"剩余化\"操作。这些概念通过一维累积分布函数（CDF）变换和组合自然而然地出现，并扩展到了多元设置中。",
    "en_tdlr": "This paper proposes an unsupervised tree boosting algorithm for inferring the underlying sampling distribution of an i.i.d. sample based on fitting additive tree ensembles. The key contribution is the introduction of a new notion of \"addition\" on probability distributions and its corresponding \"residualization\" operation, which are shown to naturally arise through univariate cumulative distribution function (CDF) transforms and compositions, and can be extended to multivariate settings."
}