{
    "title": "Measure of Strength of Evidence for Visually Observed Differences between Subpopulations. (arXiv:2101.00362v3 [stat.ME] UPDATED)",
    "abstract": "For measuring the strength of visually-observed subpopulation differences, the Population Difference Criterion is proposed to assess the statistical significance of visually observed subpopulation differences. It addresses the following challenges: in high-dimensional contexts, distributional models can be dubious; in high-signal contexts, conventional permutation tests give poor pairwise comparisons. We also make two other contributions: Based on a careful analysis we find that a balanced permutation approach is more powerful in high-signal contexts than conventional permutations. Another contribution is the quantification of uncertainty due to permutation variation via a bootstrap confidence interval. The practical usefulness of these ideas is illustrated in the comparison of subpopulations of modern cancer data.",
    "link": "http://arxiv.org/abs/2101.00362",
    "context": "Title: Measure of Strength of Evidence for Visually Observed Differences between Subpopulations. (arXiv:2101.00362v3 [stat.ME] UPDATED)\nAbstract: For measuring the strength of visually-observed subpopulation differences, the Population Difference Criterion is proposed to assess the statistical significance of visually observed subpopulation differences. It addresses the following challenges: in high-dimensional contexts, distributional models can be dubious; in high-signal contexts, conventional permutation tests give poor pairwise comparisons. We also make two other contributions: Based on a careful analysis we find that a balanced permutation approach is more powerful in high-signal contexts than conventional permutations. Another contribution is the quantification of uncertainty due to permutation variation via a bootstrap confidence interval. The practical usefulness of these ideas is illustrated in the comparison of subpopulations of modern cancer data.",
    "path": "papers/21/01/2101.00362.json",
    "total_tokens": 916,
    "translated_title": "衡量视觉观察到的子群差异的证据强度的方法",
    "translated_abstract": "为了衡量视觉上观察到的子群差异的强度，提出了“人群差异准则”来评估视觉上观察到的子群差异的统计显著性。它解决了以下挑战：在高维环境中，分布模型可能是可疑的；在高信号环境中，传统的置换检验在配对比较方面效果不佳。我们还做出了两项其他贡献：基于仔细的分析，我们发现在高信号环境中，平衡的置换方法比传统的置换方法更强大。另一个贡献是通过自助法置换变化的不确定性进行量化，得到一个自助法置信区间。这些想法的实用性在对现代癌症数据的子群比较中得到了说明。",
    "tldr": "本文介绍了一种衡量视觉观察到的子群差异的证据强度的方法，并提出了\"人群差异准则\"来评估其统计显著性。研究发现在高维和高信号环境下，传统方法存在局限性，因此提出了新的平衡置换方法和自助法置信区间来解决这些问题。在现代癌症数据的比较中，这些方法展示出了实用性和有效性。",
    "en_tdlr": "This paper introduces a method to measure the strength of visually observed subpopulation differences and proposes a \"Population Difference Criterion\" to assess their statistical significance. The study finds limitations in conventional methods in high-dimensional and high-signal contexts, thus proposing new balanced permutation approaches and bootstrap confidence intervals to address these issues. The practical and effective utility of these methods is demonstrated in comparing subpopulations of modern cancer data."
}