{
    "title": "Gauge Invariant and Anyonic Symmetric Autoregressive Neural Networks for Quantum Lattice Models. (arXiv:2101.07243v3 [cond-mat.str-el] UPDATED)",
    "abstract": "Symmetries such as gauge invariance and anyonic symmetry play a crucial role in quantum many-body physics. We develop a general approach to constructing gauge invariant or anyonic symmetric autoregressive neural networks, including a wide range of architectures such as Transformer and recurrent neural network, for quantum lattice models. These networks can be efficiently sampled and explicitly obey gauge symmetries or anyonic constraint. We prove that our methods can provide exact representation for the ground and excited states of the 2D and 3D toric codes, and the X-cube fracton model. We variationally optimize our symmetry incorporated autoregressive neural networks for ground states as well as real-time dynamics for a variety of models. We simulate the dynamics and the ground states of the quantum link model of $\\text{U(1)}$ lattice gauge theory, obtain the phase diagram for the 2D $\\mathbb{Z}_2$ gauge theory, determine the phase transition and the central charge of the $\\text{SU(2",
    "link": "http://arxiv.org/abs/2101.07243",
    "context": "Title: Gauge Invariant and Anyonic Symmetric Autoregressive Neural Networks for Quantum Lattice Models. (arXiv:2101.07243v3 [cond-mat.str-el] UPDATED)\nAbstract: Symmetries such as gauge invariance and anyonic symmetry play a crucial role in quantum many-body physics. We develop a general approach to constructing gauge invariant or anyonic symmetric autoregressive neural networks, including a wide range of architectures such as Transformer and recurrent neural network, for quantum lattice models. These networks can be efficiently sampled and explicitly obey gauge symmetries or anyonic constraint. We prove that our methods can provide exact representation for the ground and excited states of the 2D and 3D toric codes, and the X-cube fracton model. We variationally optimize our symmetry incorporated autoregressive neural networks for ground states as well as real-time dynamics for a variety of models. We simulate the dynamics and the ground states of the quantum link model of $\\text{U(1)}$ lattice gauge theory, obtain the phase diagram for the 2D $\\mathbb{Z}_2$ gauge theory, determine the phase transition and the central charge of the $\\text{SU(2",
    "path": "papers/21/01/2101.07243.json",
    "total_tokens": 1051,
    "translated_title": "量子晶格模型的规范不变性和任意子对称自回归神经网络",
    "translated_abstract": "对称性，如规范不变性和任意子对称性，在量子多体物理中起着至关重要的作用。我们开发了一种通用方法来构建针对量子晶格模型的规范不变性或任意子对称性自回归神经网络，包括 Transformer 和循环神经网络等各种架构。这些网络可以高效地采样，并明确地遵守规范对称性或任意子约束。我们证明了我们的方法可以提供精确表示2D和3D扭曲码以及X-立方体分形模型的基态和激发态。我们变分优化了我们的对称性合并的自回归神经网络，用于各种模型的基态以及实时动力学。我们模拟了 $\\text{U(1)}$ 网格规范理论的量子链接模型的动力学和基态，得到了 2D $\\mathbb{Z}_2$ 规范理论的相图，确定了 $\\text{SU(2)}$ 临界链的相变和中心荷，以及研究了 2D 三角晶格的自旋模型的热化动力学。",
    "tldr": "该论文提出了一种针对量子晶格模型的自回归神经网络，并明确遵守规范对称性或任意子约束，能够提供精确表示量子晶格模型基态和激发态的方法。",
    "en_tdlr": "The paper proposes a method for constructing autoregressive neural networks for quantum lattice models with gauge invariance or anyonic symmetry, efficiently sampling and explicitly obeying the constraints, which can provide an exact representation for the ground and excited states. The networks are optimized for ground states and real-time dynamics, and applied to various models such as $\\text{U(1)}$ lattice gauge theory, $\\text{SU(2)}$ critical chain, and spin model on a 2D triangular lattice, providing insights into phase transitions and thermalization."
}