{
    "title": "SDGNN: Learning Node Representation for Signed Directed Networks. (arXiv:2101.02390v4 [cs.SI] UPDATED)",
    "abstract": "Network embedding is aimed at mapping nodes in a network into low-dimensional vector representations. Graph Neural Networks (GNNs) have received widespread attention and lead to state-of-the-art performance in learning node representations. However, most GNNs only work in unsigned networks, where only positive links exist. It is not trivial to transfer these models to signed directed networks, which are widely observed in the real world yet less studied. In this paper, we first review two fundamental sociological theories (i.e., status theory and balance theory) and conduct empirical studies on real-world datasets to analyze the social mechanism in signed directed networks. Guided by related sociological theories, we propose a novel Signed Directed Graph Neural Networks model named SDGNN to learn node embeddings for signed directed networks. The proposed model simultaneously reconstructs link signs, link directions, and signed directed triangles. We validate our model's effectiveness o",
    "link": "http://arxiv.org/abs/2101.02390",
    "context": "Title: SDGNN: Learning Node Representation for Signed Directed Networks. (arXiv:2101.02390v4 [cs.SI] UPDATED)\nAbstract: Network embedding is aimed at mapping nodes in a network into low-dimensional vector representations. Graph Neural Networks (GNNs) have received widespread attention and lead to state-of-the-art performance in learning node representations. However, most GNNs only work in unsigned networks, where only positive links exist. It is not trivial to transfer these models to signed directed networks, which are widely observed in the real world yet less studied. In this paper, we first review two fundamental sociological theories (i.e., status theory and balance theory) and conduct empirical studies on real-world datasets to analyze the social mechanism in signed directed networks. Guided by related sociological theories, we propose a novel Signed Directed Graph Neural Networks model named SDGNN to learn node embeddings for signed directed networks. The proposed model simultaneously reconstructs link signs, link directions, and signed directed triangles. We validate our model's effectiveness o",
    "path": "papers/21/01/2101.02390.json",
    "total_tokens": 876,
    "translated_title": "SDGNN: 学习有向有符号网络节点表示的方法",
    "translated_abstract": "网络嵌入旨在将网络中的节点映射为低维向量表示形式。图神经网络(GNN)已经得到广泛关注，并在学习节点表示方面引领了最先进的性能。但是，大多数GNN仅适用于仅存在正链接的无符号网络。将这些模型转移到有向有符号网络中并不容易，而这种网络在现实世界中广泛存在但研究较少。在本文中，我们首先回顾两个基本的社会学理论（即地位理论和平衡理论），并在真实数据集上进行实证研究以分析有向有符号网络中的社会机制。在相关的社会学理论指导下，我们提出了一种新颖的有向有符号图神经网络模型SDGNN，用于学习有向有符号网络中的节点嵌入。所提出的模型同时重构链接符号、链接方向和有向有符号三角形。我们证实了模型的有效性。",
    "tldr": "该论文提出了一种新颖的有向有符号图神经网络模型SDGNN，用于学习有向有符号网络中的节点嵌入，该模型重构了链接符号、链接方向和有向有符号三角形，验证了其有效性。"
}