{
    "title": "The Law of Large Numbers for Large Stable Matchings. (arXiv:2101.00399v6 [econ.EM] UPDATED)",
    "abstract": "In many empirical studies of a large two-sided matching market (such as in a college admissions problem), the researcher performs statistical inference under the assumption that they observe a random sample from a large matching market. In this paper, we consider a setting in which the researcher observes either all or a nontrivial fraction of outcomes from a stable matching. We establish a concentration inequality for empirical matching probabilities assuming strong correlation among the colleges' preferences while allowing students' preferences to be fully heterogeneous. Our concentration inequality yields laws of large numbers for the empirical matching probabilities and other statistics commonly used in empirical analyses of a large matching market. To illustrate the usefulness of our concentration inequality, we prove consistency for estimators of conditional matching probabilities and measures of positive assortative matching.",
    "link": "http://arxiv.org/abs/2101.00399",
    "context": "Title: The Law of Large Numbers for Large Stable Matchings. (arXiv:2101.00399v6 [econ.EM] UPDATED)\nAbstract: In many empirical studies of a large two-sided matching market (such as in a college admissions problem), the researcher performs statistical inference under the assumption that they observe a random sample from a large matching market. In this paper, we consider a setting in which the researcher observes either all or a nontrivial fraction of outcomes from a stable matching. We establish a concentration inequality for empirical matching probabilities assuming strong correlation among the colleges' preferences while allowing students' preferences to be fully heterogeneous. Our concentration inequality yields laws of large numbers for the empirical matching probabilities and other statistics commonly used in empirical analyses of a large matching market. To illustrate the usefulness of our concentration inequality, we prove consistency for estimators of conditional matching probabilities and measures of positive assortative matching.",
    "path": "papers/21/01/2101.00399.json",
    "total_tokens": 827,
    "translated_title": "大规模稳定匹配中大数量级定律",
    "translated_abstract": "在大规模双边匹配的实证研究中，如大学入学中的问题，研究者通常在假设他们观察到一个大匹配市场的随机样本的情况下进行统计推断。本文考虑研究者观察到稳定匹配的全部或部分结果的情况。在假设学校偏好强相关且允许学生偏好完全异质的情况下，我们建立了实际匹配概率的集中不等式。我们的集中不等式为常用的统计量如实证分析中大匹配市场中的实际匹配概率和其他统计量提供了大数量级定律。为了展示我们的集中不等式的实用性，我们证明了条件匹配概率的估计器及正向配对的测量结果的一致性。",
    "tldr": "本文提出了一种在大规模稳定匹配中获得实际匹配概率的集中不等式。这将提供大数量级定律和其他统计量，如用于大匹配市场的实证分析的统计量。",
    "en_tdlr": "This paper proposes a concentration inequality for obtaining empirical matching probabilities in large stable matching settings, yielding laws of large numbers and commonly used statistics in the empirical analysis of large matching markets. The usefulness of this inequality is illustrated through proving consistency of estimators for conditional matching probabilities and measures of positive assortative matching."
}