{
    "title": "Double-Adversarial Activation Anomaly Detection: Adversarial Autoencoders are Anomaly Generators. (arXiv:2101.04645v5 [cs.LG] UPDATED)",
    "abstract": "Anomaly detection is a challenging task for machine learning algorithms due to the inherent class imbalance. It is costly and time-demanding to manually analyse the observed data, thus usually only few known anomalies if any are available. Inspired by generative models and the analysis of the hidden activations of neural networks, we introduce a novel unsupervised anomaly detection method called DA3D. Here, we use adversarial autoencoders to generate anomalous counterexamples based on the normal data only. These artificial anomalies used during training allow the detection of real, yet unseen anomalies. With our novel generative approach, we transform the unsupervised task of anomaly detection to a supervised one, which is more tractable by machine learning and especially deep learning methods. DA3D surpasses the performance of state-of-the-art anomaly detection methods in a purely data-driven way, where no domain knowledge is required.",
    "link": "http://arxiv.org/abs/2101.04645",
    "context": "Title: Double-Adversarial Activation Anomaly Detection: Adversarial Autoencoders are Anomaly Generators. (arXiv:2101.04645v5 [cs.LG] UPDATED)\nAbstract: Anomaly detection is a challenging task for machine learning algorithms due to the inherent class imbalance. It is costly and time-demanding to manually analyse the observed data, thus usually only few known anomalies if any are available. Inspired by generative models and the analysis of the hidden activations of neural networks, we introduce a novel unsupervised anomaly detection method called DA3D. Here, we use adversarial autoencoders to generate anomalous counterexamples based on the normal data only. These artificial anomalies used during training allow the detection of real, yet unseen anomalies. With our novel generative approach, we transform the unsupervised task of anomaly detection to a supervised one, which is more tractable by machine learning and especially deep learning methods. DA3D surpasses the performance of state-of-the-art anomaly detection methods in a purely data-driven way, where no domain knowledge is required.",
    "path": "papers/21/01/2101.04645.json",
    "total_tokens": 885,
    "translated_title": "双重对抗激活异常检测：对抗自编码器是异常生成器",
    "translated_abstract": "异常检测是机器学习算法面临的挑战之一，这是由于固有的类别不平衡性所导致的。由于手动分析观察数据是昂贵且耗时的，因此通常只有一些已知的异常，如果有的话。受到生成模型和神经网络隐藏激活分析的启发，我们引入了一种名为DA3D的新型无监督异常检测方法。在这里，我们使用对抗自编码器仅基于正常数据生成异常的反例。训练过程中使用这些人工异常可以检测到真实但未见过的异常。通过我们的新型生成方法，我们将无监督的异常检测任务转化为一种监督任务，这对于机器学习和特别是深度学习方法更易处理。DA3D在纯数据驱动的方式下超过了最先进的异常检测方法的性能，而无需领域知识。",
    "tldr": "该论文提出了一种名为DA3D的无监督异常检测方法，利用对抗自编码器生成基于正常数据的异常反例，从而实现在没有领域知识的情况下超越最先进的异常检测方法的性能。",
    "en_tdlr": "This paper proposes a novel unsupervised anomaly detection method called DA3D, which uses adversarial autoencoders to generate anomalous counterexamples based on normal data, surpassing the performance of state-of-the-art anomaly detection methods without requiring domain knowledge."
}