{
    "title": "Uncertainty Quantification for Bayesian Optimization. (arXiv:2002.01569v2 [math.ST] UPDATED)",
    "abstract": "Bayesian optimization is a class of global optimization techniques. In Bayesian optimization, the underlying objective function is modeled as a realization of a Gaussian process. Although the Gaussian process assumption implies a random distribution of the Bayesian optimization outputs, quantification of this uncertainty is rarely studied in the literature. In this work, we propose a novel approach to assess the output uncertainty of Bayesian optimization algorithms, which proceeds by constructing confidence regions of the maximum point (or value) of the objective function. These regions can be computed efficiently, and their confidence levels are guaranteed by the uniform error bounds for sequential Gaussian process regression newly developed in the present work. Our theory provides a unified uncertainty quantification framework for all existing sequential sampling policies and stopping criteria.",
    "link": "http://arxiv.org/abs/2002.01569",
    "context": "Title: Uncertainty Quantification for Bayesian Optimization. (arXiv:2002.01569v2 [math.ST] UPDATED)\nAbstract: Bayesian optimization is a class of global optimization techniques. In Bayesian optimization, the underlying objective function is modeled as a realization of a Gaussian process. Although the Gaussian process assumption implies a random distribution of the Bayesian optimization outputs, quantification of this uncertainty is rarely studied in the literature. In this work, we propose a novel approach to assess the output uncertainty of Bayesian optimization algorithms, which proceeds by constructing confidence regions of the maximum point (or value) of the objective function. These regions can be computed efficiently, and their confidence levels are guaranteed by the uniform error bounds for sequential Gaussian process regression newly developed in the present work. Our theory provides a unified uncertainty quantification framework for all existing sequential sampling policies and stopping criteria.",
    "path": "papers/20/02/2002.01569.json",
    "total_tokens": 803,
    "translated_title": "贝叶斯优化中的不确定性量化",
    "translated_abstract": "贝叶斯优化是一种全局优化技术。在贝叶斯优化中，目标函数被建模为高斯过程的实现。尽管高斯过程的假设意味着贝叶斯优化输出的随机分布，但对于此不确定性的量化在文献中很少有研究。在本文中，我们提出了一种新方法来评估贝叶斯优化算法的输出不确定性，该方法通过构建目标函数最大点（或值）的置信区间来实现。这些区间可以高效地计算，其置信水平由本研究中新开发的顺序高斯过程回归的统一误差界保证。我们的理论为所有现有的顺序取样策略和停止准则提供了统一的不确定性量化框架。",
    "tldr": "本文提出了一种评估贝叶斯优化算法输出不确定性的新方法，通过构建置信区间实现。这一理论提供了所有现有的顺序取样策略和停止准则的统一不确定性量化框架。",
    "en_tdlr": "This paper proposes a novel approach to assess the output uncertainty of Bayesian optimization algorithms, which proceeds by constructing confidence regions of the maximum point (or value) of the objective function. Our theory provides a unified uncertainty quantification framework for all existing sequential sampling policies and stopping criteria."
}