{
    "title": "Wavelet-based temporal models of human activity for anomaly detection in smart robot-assisted environments. (arXiv:2002.11503v3 [cs.AI] UPDATED)",
    "abstract": "Abstract. Detecting anomalies in patterns of sensor data is important in many practical applications, including domestic activity monitoring for Active Assisted Living (AAL). How to represent and analyse these patterns, however, remains a challenging task, especially when data is relatively scarce and an explicit model is required to be fine-tuned for specific scenarios. This paper, therefore, presents a new approach for temporal modelling of long-term human activities with smart-home sensors, which is used to detect anomalous situations in a robot-assisted environment. The model is based on wavelet transforms and used to forecast smart sensor data, providing a temporal prior to detect unexpected events in human environments. To this end, a new extension of Hybrid Markov Logic Networks has been developed that merges different anomaly indicators, including activities detected by binary sensors, expert logic rules, and wavelet-based temporal models. The latter in particular allows the in",
    "link": "http://arxiv.org/abs/2002.11503",
    "context": "Title: Wavelet-based temporal models of human activity for anomaly detection in smart robot-assisted environments. (arXiv:2002.11503v3 [cs.AI] UPDATED)\nAbstract: Abstract. Detecting anomalies in patterns of sensor data is important in many practical applications, including domestic activity monitoring for Active Assisted Living (AAL). How to represent and analyse these patterns, however, remains a challenging task, especially when data is relatively scarce and an explicit model is required to be fine-tuned for specific scenarios. This paper, therefore, presents a new approach for temporal modelling of long-term human activities with smart-home sensors, which is used to detect anomalous situations in a robot-assisted environment. The model is based on wavelet transforms and used to forecast smart sensor data, providing a temporal prior to detect unexpected events in human environments. To this end, a new extension of Hybrid Markov Logic Networks has been developed that merges different anomaly indicators, including activities detected by binary sensors, expert logic rules, and wavelet-based temporal models. The latter in particular allows the in",
    "path": "papers/20/02/2002.11503.json",
    "total_tokens": 952,
    "translated_title": "基于小波的人类活动时间模型在智能机器人辅助环境中的异常检测",
    "translated_abstract": "检测传感器数据模式中的异常在许多实际应用中非常重要，包括用于主动辅助生活的家庭活动监测。然而，如何表示和分析这些模式仍然是一个具有挑战性的任务，特别是当数据相对稀缺且需要明确的模型来对特定场景进行精细调整时。因此，本文提出了一种用于长时期人类活动在智能家居传感器上的时间建模的新方法，该方法用于在机器人辅助环境中检测异常情况。该模型基于小波变换，用于预测智能传感器数据，提供时间先验以检测人类环境中的意外事件。为此，开发了一种新的混合马尔科夫逻辑网络的扩展，将包括二元传感器检测到的活动、专家逻辑规则和基于小波的时间模型在内的不同异常指标合并在一起。",
    "tldr": "本文提出了一种基于小波变换的新方法，用于在智能机器人辅助环境中检测人类活动的异常情况。该方法通过预测智能传感器数据，并结合混合马尔科夫逻辑网络扩展，将不同的异常指标合并在一起，以提供时间先验，并检测人类环境中的意外事件。"
}