{
    "title": "Uzbek text's correspondence with the educational potential of pupils: a case study of the School corpus. (arXiv:2303.00465v2 [cs.CL] UPDATED)",
    "abstract": "One of the major challenges of an educational system is choosing appropriate content considering pupils' age and intellectual potential. In this article the experiment of primary school grades (from 1st to 4th grades) is considered for automatically determining the correspondence of an educational materials recommended for pupils by using the School corpus where it includes the dataset of 25 school textbooks confirmed by the Ministry of preschool and school education of the Republic of Uzbekistan. In this case, TF-IDF scores of the texts are determined, they are converted into a vector representation, and the given educational materials are compared with the corresponding class of the School corpus using the cosine similarity algorithm. Based on the results of the calculation, it is determined whether the given educational material is appropriate or not appropriate for the pupils' educational potential.",
    "link": "http://arxiv.org/abs/2303.00465",
    "context": "Title: Uzbek text's correspondence with the educational potential of pupils: a case study of the School corpus. (arXiv:2303.00465v2 [cs.CL] UPDATED)\nAbstract: One of the major challenges of an educational system is choosing appropriate content considering pupils' age and intellectual potential. In this article the experiment of primary school grades (from 1st to 4th grades) is considered for automatically determining the correspondence of an educational materials recommended for pupils by using the School corpus where it includes the dataset of 25 school textbooks confirmed by the Ministry of preschool and school education of the Republic of Uzbekistan. In this case, TF-IDF scores of the texts are determined, they are converted into a vector representation, and the given educational materials are compared with the corresponding class of the School corpus using the cosine similarity algorithm. Based on the results of the calculation, it is determined whether the given educational material is appropriate or not appropriate for the pupils' educational potential.",
    "path": "papers/23/03/2303.00465.json",
    "total_tokens": 821,
    "translated_title": "乌兹别克文本与学生教育潜力的对应关系：学校语料库案例研究",
    "translated_abstract": "教育系统面临的主要挑战之一是选择适合学生年龄和思维潜力的内容。本文研究了小学一年级到四年级的实验，旨在通过使用学校语料库自动确定推荐给学生的教材与学生的教育材料之间的对应关系。该语料库包括乌兹别克斯坦幼儿园和学校教育部确认的25本学校教科书的数据集。在这种情况下，计算文本的TF-IDF分数并将其转换为向量表示，然后使用余弦相似性算法比较所给的教育材料与学校语料库相应班级的内容。根据计算结果，确定所给教育材料是否适合学生的教育潜力。",
    "tldr": "本文研究了使用学校语料库自动确定推荐给学生的教材与学生的教育材料之间的对应关系，为教育系统选择适当的内容提供了参考。",
    "en_tdlr": "This article examines the correspondence between educational materials recommended for pupils and their educational potential using the School corpus, providing a reference for selecting appropriate content in the education system."
}