{
    "title": "Tackling Clutter in Radar Data -- Label Generation and Detection Using PointNet++. (arXiv:2303.09530v1 [cs.CV])",
    "abstract": "Radar sensors employed for environment perception, e.g. in autonomous vehicles, output a lot of unwanted clutter. These points, for which no corresponding real objects exist, are a major source of errors in following processing steps like object detection or tracking. We therefore present two novel neural network setups for identifying clutter. The input data, network architectures and training configuration are adjusted specifically for this task. Special attention is paid to the downsampling of point clouds composed of multiple sensor scans. In an extensive evaluation, the new setups display substantially better performance than existing approaches. Because there is no suitable public data set in which clutter is annotated, we design a method to automatically generate the respective labels. By applying it to existing data with object annotations and releasing its code, we effectively create the first freely available radar clutter data set representing real-world driving scenarios. C",
    "link": "http://arxiv.org/abs/2303.09530",
    "context": "Title: Tackling Clutter in Radar Data -- Label Generation and Detection Using PointNet++. (arXiv:2303.09530v1 [cs.CV])\nAbstract: Radar sensors employed for environment perception, e.g. in autonomous vehicles, output a lot of unwanted clutter. These points, for which no corresponding real objects exist, are a major source of errors in following processing steps like object detection or tracking. We therefore present two novel neural network setups for identifying clutter. The input data, network architectures and training configuration are adjusted specifically for this task. Special attention is paid to the downsampling of point clouds composed of multiple sensor scans. In an extensive evaluation, the new setups display substantially better performance than existing approaches. Because there is no suitable public data set in which clutter is annotated, we design a method to automatically generate the respective labels. By applying it to existing data with object annotations and releasing its code, we effectively create the first freely available radar clutter data set representing real-world driving scenarios. C",
    "path": "papers/23/03/2303.09530.json",
    "total_tokens": 884,
    "translated_title": "利用PointNet++解决雷达数据中的杂波 ——标签生成和检测",
    "translated_abstract": "在自动驾驶等环境感知领域中，雷达传感器输出了大量不需要的杂波。这些点没有对应的真实对象，是后续处理步骤（如物体检测或跟踪）中错误的主要来源。因此，我们提出了两种新颖的神经网络设置来识别杂波。输入数据、网络架构和训练配置都是针对这个任务进行调整的。特别注意的是，对于由多个传感器扫描组成的点云的下采样。在广泛的评估中，新的设置显示出比现有方法更好的性能。由于没有适合的公共数据集来注释杂波，我们设计了一种方法来自动生成相应的标签。通过将其应用于具有对象注释的现有数据并发布其代码，我们有效地创建了第一个代表实际驾驶场景的自由可用雷达杂波数据集。",
    "tldr": "本文提出了两种神经网络来识别雷达数据中的杂波，并设计了一种方法来自动生成杂波标签。对现有数据进行评估，显示出比现有方法更好的性能。同时发布第一个表示实际驾驶场景的自由可用雷达杂波数据集。",
    "en_tdlr": "This paper proposes two neural network setups to identify clutter in radar data and designs a method to automatically generate the respective labels. The new setups show substantially better performance than existing approaches upon evaluation using existing data with object annotations. Furthermore, the first freely available radar clutter dataset representing real-world driving scenarios has been created and released."
}