{
    "title": "JobHam-place with smart recommend job options and candidate filtering options. (arXiv:2303.17930v1 [cs.CL])",
    "abstract": "Due to the increasing number of graduates, many applicants experience the situation about finding a job, and employers experience difficulty filtering job applicants, which might negatively impact their effectiveness. However, most job-hunting websites lack job recommendation and CV filtering or ranking functionality, which are not integrated into the system. Thus, a smart job hunter combined with the above functionality will be conducted in this project, which contains job recommendations, CV ranking and even a job dashboard for skills and job applicant functionality. Job recommendation and CV ranking starts from the automatic keyword extraction and end with the Job/CV ranking algorithm. Automatic keyword extraction is implemented by Job2Skill and the CV2Skill model based on Bert. Job2Skill consists of two components, text encoder and Gru-based layers, while CV2Skill is mainly based on Bert and fine-tunes the pre-trained model by the Resume- Entity dataset. Besides, to match skills fr",
    "link": "http://arxiv.org/abs/2303.17930",
    "context": "Title: JobHam-place with smart recommend job options and candidate filtering options. (arXiv:2303.17930v1 [cs.CL])\nAbstract: Due to the increasing number of graduates, many applicants experience the situation about finding a job, and employers experience difficulty filtering job applicants, which might negatively impact their effectiveness. However, most job-hunting websites lack job recommendation and CV filtering or ranking functionality, which are not integrated into the system. Thus, a smart job hunter combined with the above functionality will be conducted in this project, which contains job recommendations, CV ranking and even a job dashboard for skills and job applicant functionality. Job recommendation and CV ranking starts from the automatic keyword extraction and end with the Job/CV ranking algorithm. Automatic keyword extraction is implemented by Job2Skill and the CV2Skill model based on Bert. Job2Skill consists of two components, text encoder and Gru-based layers, while CV2Skill is mainly based on Bert and fine-tunes the pre-trained model by the Resume- Entity dataset. Besides, to match skills fr",
    "path": "papers/23/03/2303.17930.json",
    "total_tokens": 1112,
    "translated_title": "通过智能推荐工作和过滤求职者的选项的JobHam-place。",
    "translated_abstract": "随着毕业生人数的增加，许多求职应聘者经常遇到找工作的难题，而雇主则经常遇到难以过滤求职者的情况，这可能会对他们的效率产生负面影响。然而，大多数求职网站缺乏工作推荐、简历过滤或排名功能，这些功能没有整合到系统中。因此，本项目将实现一个智能求职系统，其中包含工作推荐、简历排名甚至带有技能和求职者功能的职位仪表板。工作推荐和简历排名从自动关键字提取开始，以Job/CV排名算法结束。自动关键字提取由Job2Skill和基于Bert的CV2Skill模型实现。Job2Skill由文本编码器和基于门控循环单元的层组成，而CV2Skill主要基于Bert，并通过简历实体数据集微调预训练模型。此外，为了将工作要求中的技能与求职者技能匹配，提出了一种基于词嵌入和余弦相似性的新算法。最后，我们系统在真实数据上进行了评估，实验结果表明，提出的系统可以提供准确的工作推荐和简历排名。",
    "tldr": "本论文设计了一个名为JobHam-place的智能求职系统，其包含工作推荐、简历排名及职位仪表板等功能，通过自动关键字提取和Job/CV排名算法实现，同时提出了一种新的基于词嵌入和余弦相似性的算法来匹配工作要求和求职者技能，实验结果表明系统具有准确的工作推荐和简历排名能力。",
    "en_tdlr": "This paper presents a smart job hunting system, named JobHam-place, which includes job recommendations, CV ranking, and job dashboard for skills and job applicants. The system uses automatic keyword extraction and the Job/CV ranking algorithm while proposing a new algorithm based on Word Embedding and Cosine Similarity to match skills with job requirements. Experimental results show that the system can provide accurate job recommendations and CV rankings."
}