{
    "title": "The Stable Signature: Rooting Watermarks in Latent Diffusion Models. (arXiv:2303.15435v2 [cs.CV] UPDATED)",
    "abstract": "Generative image modeling enables a wide range of applications but raises ethical concerns about responsible deployment. This paper introduces an active strategy combining image watermarking and Latent Diffusion Models. The goal is for all generated images to conceal an invisible watermark allowing for future detection and/or identification. The method quickly fine-tunes the latent decoder of the image generator, conditioned on a binary signature. A pre-trained watermark extractor recovers the hidden signature from any generated image and a statistical test then determines whether it comes from the generative model. We evaluate the invisibility and robustness of the watermarks on a variety of generation tasks, showing that Stable Signature works even after the images are modified. For instance, it detects the origin of an image generated from a text prompt, then cropped to keep $10\\%$ of the content, with $90$+$\\%$ accuracy at a false positive rate below 10$^{-6}$.",
    "link": "http://arxiv.org/abs/2303.15435",
    "context": "Title: The Stable Signature: Rooting Watermarks in Latent Diffusion Models. (arXiv:2303.15435v2 [cs.CV] UPDATED)\nAbstract: Generative image modeling enables a wide range of applications but raises ethical concerns about responsible deployment. This paper introduces an active strategy combining image watermarking and Latent Diffusion Models. The goal is for all generated images to conceal an invisible watermark allowing for future detection and/or identification. The method quickly fine-tunes the latent decoder of the image generator, conditioned on a binary signature. A pre-trained watermark extractor recovers the hidden signature from any generated image and a statistical test then determines whether it comes from the generative model. We evaluate the invisibility and robustness of the watermarks on a variety of generation tasks, showing that Stable Signature works even after the images are modified. For instance, it detects the origin of an image generated from a text prompt, then cropped to keep $10\\%$ of the content, with $90$+$\\%$ accuracy at a false positive rate below 10$^{-6}$.",
    "path": "papers/23/03/2303.15435.json",
    "total_tokens": 880,
    "translated_title": "稳定签名：将水印扎根于潜在扩散模型中",
    "translated_abstract": "生成图像建模可以实现各种应用，但也引发了关于负责任部署的道德关注。本文介绍了一种结合图像水印和潜在扩散模型的主动策略。其目标是使所有生成的图像都隐藏一个不可见的水印，以供将来检测和/或识别。该方法通过在二进制签名的条件下快速微调图像生成器的潜在解码器来实现。预训练的水印提取器可以从任何生成的图像中恢复隐藏的签名，然后通过统计测试来确定它是否来自生成模型。我们评估了水印在各种生成任务上的隐形性和鲁棒性，结果表明稳定签名在图像被修改后仍然有效。例如，当将从文本提示生成的图像裁剪保留10%的内容后，以10$^{-6}$以下的错误率下，能以90%以上的准确率检测出图像的源头。",
    "tldr": "本文介绍了一种结合图像水印和潜在扩散模型的方法，使所有生成的图像都能隐藏一个不可见的水印，该方法在各种生成任务中表现出良好的隐形性和鲁棒性。",
    "en_tdlr": "This paper introduces a method that combines image watermarking and Latent Diffusion Models to hide invisible watermarks in generated images, demonstrating good invisibility and robustness in various generation tasks."
}