{
    "title": "3D Cinemagraphy from a Single Image. (arXiv:2303.05724v1 [cs.CV])",
    "abstract": "We present 3D Cinemagraphy, a new technique that marries 2D image animation with 3D photography. Given a single still image as input, our goal is to generate a video that contains both visual content animation and camera motion. We empirically find that naively combining existing 2D image animation and 3D photography methods leads to obvious artifacts or inconsistent animation. Our key insight is that representing and animating the scene in 3D space offers a natural solution to this task. To this end, we first convert the input image into feature-based layered depth images using predicted depth values, followed by unprojecting them to a feature point cloud. To animate the scene, we perform motion estimation and lift the 2D motion into the 3D scene flow. Finally, to resolve the problem of hole emergence as points move forward, we propose to bidirectionally displace the point cloud as per the scene flow and synthesize novel views by separately projecting them into target image planes and",
    "link": "http://arxiv.org/abs/2303.05724",
    "raw_ret": "{\n    \"translated_title\": \"一张单照片生成3D Cinemagraphy\",\n    \"translated_abstract\": \"本文提出了一种新技术3D Cinemagraphy，将2D图像动画和3D摄影融合起来。给定一张单照片作为输入，我们的目标是生成包含视觉内容动画和相机动作的视频。通过实验我们发现，简单的组合现有的2D图像动画和3D摄影方法会导致明显的伪影或不一致的动画。我们的关键洞察力是在3D空间中表示和动画化场景为这个任务提供了一个自然的解决方案。为此，我们首先使用预测的深度值将输入图像转换为基于特征的分层深度图像，然后将它们展开到一个特征点云中。为了动画化场景，我们执行运动估计并将2D动作提升到3D场景流中。最后，为了解决点向前移动时出现的洞隐问题，我们建议按场景流双向位移点云，并通过将其分别投影到目标图像平面中合成新视图。\",\n    \"tldr\": \"本文提出了一种新技术3D Cinemagraphy，给定一张单照片作为输入，可以生成包含视觉内容动画和相机动作的视频。通过将场景在3D空间中表示和动画化，解决了现有2D图像动画和3D摄影方法组合带来的伪影或不一致的动画问题。\"\n}<|im_sep|>",
    "total_tokens": 911,
    "ret": {
        "translated_title": "一张单照片生成3D Cinemagraphy",
        "translated_abstract": "本文提出了一种新技术3D Cinemagraphy，将2D图像动画和3D摄影融合起来。给定一张单照片作为输入，我们的目标是生成包含视觉内容动画和相机动作的视频。通过实验我们发现，简单的组合现有的2D图像动画和3D摄影方法会导致明显的伪影或不一致的动画。我们的关键洞察力是在3D空间中表示和动画化场景为这个任务提供了一个自然的解决方案。为此，我们首先使用预测的深度值将输入图像转换为基于特征的分层深度图像，然后将它们展开到一个特征点云中。为了动画化场景，我们执行运动估计并将2D动作提升到3D场景流中。最后，为了解决点向前移动时出现的洞隐问题，我们建议按场景流双向位移点云，并通过将其分别投影到目标图像平面中合成新视图。",
        "tldr": "本文提出了一种新技术3D Cinemagraphy，给定一张单照片作为输入，可以生成包含视觉内容动画和相机动作的视频。通过将场景在3D空间中表示和动画化，解决了现有2D图像动画和3D摄影方法组合带来的伪影或不一致的动画问题。"
    }
}