{
    "title": "A System for Generalized 3D Multi-Object Search. (arXiv:2303.03178v2 [cs.RO] UPDATED)",
    "abstract": "Searching for objects is a fundamental skill for robots. As such, we expect object search to eventually become an off-the-shelf capability for robots, similar to e.g., object detection and SLAM. In contrast, however, no system for 3D object search exists that generalizes across real robots and environments. In this paper, building upon a recent theoretical framework that exploited the octree structure for representing belief in 3D, we present GenMOS (Generalized Multi-Object Search), the first general-purpose system for multi-object search (MOS) in a 3D region that is robot-independent and environment-agnostic. GenMOS takes as input point cloud observations of the local region, object detection results, and localization of the robot's view pose, and outputs a 6D viewpoint to move to through online planning. In particular, GenMOS uses point cloud observations in three ways: (1) to simulate occlusion; (2) to inform occupancy and initialize octree belief; and (3) to sample a belief-depend",
    "link": "http://arxiv.org/abs/2303.03178",
    "context": "Title: A System for Generalized 3D Multi-Object Search. (arXiv:2303.03178v2 [cs.RO] UPDATED)\nAbstract: Searching for objects is a fundamental skill for robots. As such, we expect object search to eventually become an off-the-shelf capability for robots, similar to e.g., object detection and SLAM. In contrast, however, no system for 3D object search exists that generalizes across real robots and environments. In this paper, building upon a recent theoretical framework that exploited the octree structure for representing belief in 3D, we present GenMOS (Generalized Multi-Object Search), the first general-purpose system for multi-object search (MOS) in a 3D region that is robot-independent and environment-agnostic. GenMOS takes as input point cloud observations of the local region, object detection results, and localization of the robot's view pose, and outputs a 6D viewpoint to move to through online planning. In particular, GenMOS uses point cloud observations in three ways: (1) to simulate occlusion; (2) to inform occupancy and initialize octree belief; and (3) to sample a belief-depend",
    "path": "papers/23/03/2303.03178.json",
    "total_tokens": 1012,
    "translated_title": "通用的三维多物体搜索系统",
    "translated_abstract": "对物体进行搜索是机器人的一项基本技能。因此，我们希望物体搜索最终能够成为类似于物体检测和SLAM等机器人的即插即用能力。然而，迄今没有一个3D物体搜索系统能够适用于实际机器人和环境。基于最近利用八叉树结构表示3D信念的理论框架，本文提出了GenMOS（通用多物体搜索），这是第一个独立于机器人和环境的三维多物体搜索（MOS）通用系统。GenMOS以本地区域的点云观察、物体检测结果和机器人视角定位作为输入，并通过在线规划输出一个六自由度视点。特别是，GenMOS使用点云观察的三种方式：（1）模拟遮挡；（2）信息占用并初始化八叉树信念；（3）为每个物体采样信念相关的3D位姿先验。该系统在两个模拟数据集和一个真实世界数据集上进行了评估，展示了GenMOS的有效性和效率。",
    "tldr": "本文介绍了GenMOS，这是第一个适用于实际机器人和环境的通用三维多物体搜索系统。它使用点云观察的三种方式，并通过在线规划输出一个六自由度视点，成功展示了其在多个数据集上的有效性和效率。",
    "en_tdlr": "This paper presents GenMOS, which is the first general-purpose system for multi-object search (MOS) in a 3D region that is robot-independent and environment-agnostic. The system utilizes point cloud observations in three ways and outputs a 6D viewpoint through online planning, effectively and efficiently demonstrated on multiple datasets."
}