{
    "title": "Probabilistic relations for modelling epistemic and aleatoric uncertainty: its semantics and automated reasoning with theorem proving. (arXiv:2303.09692v1 [cs.LO])",
    "abstract": "Probabilistic programming is a programming paradigm that combines general computer programming, statistical inference, and formal semantics to help systems to made decisions when facing uncertainty. Probabilistic programs are ubiquitous and believed to have a major impact on machine intelligence. While many probabilistic algorithms have been used in practice in different domains, their automated verification based on formal semantics is still a relatively new research area. In the last two decades, it has been attracting a lot of interest. Many challenges, however, still remain. Our work presented in this paper, probabilistic relations, takes a step into our vision to tackle these challenges.  Our work in essence is based on Hehner's predicative probabilistic programming, but there are several obstacles to the wider adoption of his work. Our contributions here include (1) the formalisation of its syntax and semantics by introducing an Iverson bracket notation to separate relations from",
    "link": "http://arxiv.org/abs/2303.09692",
    "context": "Title: Probabilistic relations for modelling epistemic and aleatoric uncertainty: its semantics and automated reasoning with theorem proving. (arXiv:2303.09692v1 [cs.LO])\nAbstract: Probabilistic programming is a programming paradigm that combines general computer programming, statistical inference, and formal semantics to help systems to made decisions when facing uncertainty. Probabilistic programs are ubiquitous and believed to have a major impact on machine intelligence. While many probabilistic algorithms have been used in practice in different domains, their automated verification based on formal semantics is still a relatively new research area. In the last two decades, it has been attracting a lot of interest. Many challenges, however, still remain. Our work presented in this paper, probabilistic relations, takes a step into our vision to tackle these challenges.  Our work in essence is based on Hehner's predicative probabilistic programming, but there are several obstacles to the wider adoption of his work. Our contributions here include (1) the formalisation of its syntax and semantics by introducing an Iverson bracket notation to separate relations from",
    "path": "papers/23/03/2303.09692.json",
    "total_tokens": 854,
    "translated_abstract": "概率编程是一种编程范式，将通用计算机编程、统计推断和形式语义结合起来，帮助系统在面对不确定性时做出决策。概率程序无处不在，被认为对机器智能有重大影响。尽管许多概率算法已在不同领域的实践中使用，但基于形式语义的自动验证仍是一个相对较新的研究领域，近二十年来一直受到广泛关注。我们在本文中提出的概率关系是解决这些挑战的一个方向。我们的工作基于Hehner的预测性概率编程，但是存在一些障碍阻碍其更广泛的应用。我们的贡献包括（1）通过引入Iverson bracket记号来分离关系，实现了语法和语义的形式化。",
    "tldr": "本文提出概率关系以解决基于形式语义的自动验证的挑战。贡献包括形式化语法和语义并引入Iverson bracket记号以分离关系。",
    "en_tdlr": "The paper presents probabilistic relations to tackle the challenges of automated verification based on formal semantics. The contributions include the formalization of syntax and semantics and the introduction of Iverson bracket notation to separate relations."
}