{
    "title": "From Single-Hospital to Multi-Centre Applications: Enhancing the Generalisability of Deep Learning Models for Adverse Event Prediction in the ICU. (arXiv:2303.15354v2 [cs.LG] UPDATED)",
    "abstract": "Deep learning (DL) can aid doctors in detecting worsening patient states early, affording them time to react and prevent bad outcomes. While DL-based early warning models usually work well in the hospitals they were trained for, they tend to be less reliable when applied at new hospitals. This makes it difficult to deploy them at scale. Using carefully harmonised intensive care data from four data sources across Europe and the US (totalling 334,812 stays), we systematically assessed the reliability of DL models for three common adverse events: death, acute kidney injury (AKI), and sepsis. We tested whether using more than one data source and/or explicitly optimising for generalisability during training improves model performance at new hospitals. We found that models achieved high AUROC for mortality (0.838-0.869), AKI (0.823-0.866), and sepsis (0.749-0.824) at the training hospital. As expected, performance dropped at new hospitals, sometimes by as much as -0.200. Using more than one ",
    "link": "http://arxiv.org/abs/2303.15354",
    "context": "Title: From Single-Hospital to Multi-Centre Applications: Enhancing the Generalisability of Deep Learning Models for Adverse Event Prediction in the ICU. (arXiv:2303.15354v2 [cs.LG] UPDATED)\nAbstract: Deep learning (DL) can aid doctors in detecting worsening patient states early, affording them time to react and prevent bad outcomes. While DL-based early warning models usually work well in the hospitals they were trained for, they tend to be less reliable when applied at new hospitals. This makes it difficult to deploy them at scale. Using carefully harmonised intensive care data from four data sources across Europe and the US (totalling 334,812 stays), we systematically assessed the reliability of DL models for three common adverse events: death, acute kidney injury (AKI), and sepsis. We tested whether using more than one data source and/or explicitly optimising for generalisability during training improves model performance at new hospitals. We found that models achieved high AUROC for mortality (0.838-0.869), AKI (0.823-0.866), and sepsis (0.749-0.824) at the training hospital. As expected, performance dropped at new hospitals, sometimes by as much as -0.200. Using more than one ",
    "path": "papers/23/03/2303.15354.json",
    "total_tokens": 1157,
    "translated_title": "从单个医院到多个中心应用：增强ICU中深度学习模型的泛化能力",
    "translated_abstract": "深度学习模型可以帮助医生及早检测患者恶化状态，为他们提供反应时间并防止不良结果。虽然基于深度学习的早期预警模型通常在它们受过训练的医院中表现良好，但在新医院应用时它们往往不太可靠。这使得在规模上部署它们变得困难。我们使用来自欧洲和美国四个数据源的精心协调的重症监护数据（总计334,812个停留时间），系统评估深度学习模型对三种常见不良事件的可靠性：死亡、急性肾损伤（AKI）和脓毒症。我们测试了使用多个数据源和/或在训练过程中明确优化泛化能力是否提高了模型在新医院的性能。我们发现，模型在训练医院对于死亡率（0.838-0.869）、AKI（0.823-0.866）和脓毒症（0.749-0.824）实现了较高的AUROC。预期地，性能在新医院下降，有时下降了-0.200。在训练过程中使用超过一个数据源并明确优化泛化性能可以提高模型在新医院的性能。我们的发现表明，这种方法可以帮助部署健壮且普适的深度学习模型，以预测ICU中的不良事件。",
    "tldr": "本研究通过使用多个数据源和在训练中明确优化泛化性能，提高了深度学习模型在新医院中预测ICU患者不良事件的性能和可靠性。",
    "en_tdlr": "This study enhances the reliability and applicability of deep learning models for predicting adverse events in the ICU at new hospitals by using multiple data sources and optimizing for generalizability during training. The approach could aid in the deployment of robust models at scale."
}