{
    "title": "Large AI Models in Health Informatics: Applications, Challenges, and the Future. (arXiv:2303.11568v1 [cs.AI])",
    "abstract": "Large AI models, or foundation models, are models recently emerging with massive scales both parameter-wise and data-wise, the magnitudes of which often reach beyond billions. Once pretrained, large AI models demonstrate impressive performance in various downstream tasks. A concrete example is the recent debut of ChatGPT, whose capability has compelled people's imagination about the far-reaching influence that large AI models can have and their potential to transform different domains of our life. In health informatics, the advent of large AI models has brought new paradigms for the design of methodologies. The scale of multimodality data in the biomedical and health domain has been ever-expanding especially since the community embraced the era of deep learning, which provides the ground to develop, validate, and advance large AI models for breakthroughs in health-related areas. This article presents an up-to-date comprehensive review of large AI models, from background to their applic",
    "link": "http://arxiv.org/abs/2303.11568",
    "context": "Title: Large AI Models in Health Informatics: Applications, Challenges, and the Future. (arXiv:2303.11568v1 [cs.AI])\nAbstract: Large AI models, or foundation models, are models recently emerging with massive scales both parameter-wise and data-wise, the magnitudes of which often reach beyond billions. Once pretrained, large AI models demonstrate impressive performance in various downstream tasks. A concrete example is the recent debut of ChatGPT, whose capability has compelled people's imagination about the far-reaching influence that large AI models can have and their potential to transform different domains of our life. In health informatics, the advent of large AI models has brought new paradigms for the design of methodologies. The scale of multimodality data in the biomedical and health domain has been ever-expanding especially since the community embraced the era of deep learning, which provides the ground to develop, validate, and advance large AI models for breakthroughs in health-related areas. This article presents an up-to-date comprehensive review of large AI models, from background to their applic",
    "path": "papers/23/03/2303.11568.json",
    "total_tokens": 735,
    "translated_title": "健康信息学中的大型AI模型：应用、挑战和未来展望",
    "translated_abstract": "大型AI模型是最近出现的模型，具有庞大的参数和数据规模，其规模往往超过数十亿。一旦预训练，大型AI模型在各种下游任务中展现出令人印象深刻的性能。在健康信息学领域，大型AI模型的出现为方法学设计带来了新的范例，并为健康相关领域的突破提供了推动力量。本文对大型AI模型进行了全面综述，包括背景、应用和挑战等方面。",
    "tldr": "大型AI模型在健康信息学领域具有突破性应用，但其规模和数据量的挑战需要克服，未来仍需深入探索。",
    "en_tdlr": "Large AI models have breakthrough applications in health informatics, but their challenges in scale and data size need to be overcome, and further exploration is needed in the future."
}