{
    "title": "Explaining Groups of Instances Counterfactually for XAI: A Use Case, Algorithm and User Study for Group-Counterfactuals. (arXiv:2303.09297v1 [cs.AI])",
    "abstract": "Counterfactual explanations are an increasingly popular form of post hoc explanation due to their (i) applicability across problem domains, (ii) proposed legal compliance (e.g., with GDPR), and (iii) reliance on the contrastive nature of human explanation. Although counterfactual explanations are normally used to explain individual predictive-instances, we explore a novel use case in which groups of similar instances are explained in a collective fashion using ``group counterfactuals'' (e.g., to highlight a repeating pattern of illness in a group of patients). These group counterfactuals meet a human preference for coherent, broad explanations covering multiple events/instances. A novel, group-counterfactual algorithm is proposed to generate high-coverage explanations that are faithful to the to-be-explained model. This explanation strategy is also evaluated in a large, controlled user study (N=207), using objective (i.e., accuracy) and subjective (i.e., confidence, explanation satisfa",
    "link": "http://arxiv.org/abs/2303.09297",
    "context": "Title: Explaining Groups of Instances Counterfactually for XAI: A Use Case, Algorithm and User Study for Group-Counterfactuals. (arXiv:2303.09297v1 [cs.AI])\nAbstract: Counterfactual explanations are an increasingly popular form of post hoc explanation due to their (i) applicability across problem domains, (ii) proposed legal compliance (e.g., with GDPR), and (iii) reliance on the contrastive nature of human explanation. Although counterfactual explanations are normally used to explain individual predictive-instances, we explore a novel use case in which groups of similar instances are explained in a collective fashion using ``group counterfactuals'' (e.g., to highlight a repeating pattern of illness in a group of patients). These group counterfactuals meet a human preference for coherent, broad explanations covering multiple events/instances. A novel, group-counterfactual algorithm is proposed to generate high-coverage explanations that are faithful to the to-be-explained model. This explanation strategy is also evaluated in a large, controlled user study (N=207), using objective (i.e., accuracy) and subjective (i.e., confidence, explanation satisfa",
    "path": "papers/23/03/2303.09297.json",
    "total_tokens": 977,
    "translated_title": "解释群体实例的反事实推理，用于可解释人工智能：群体反事实推理的使用案例、算法和用户研究。",
    "translated_abstract": "反事实解释是一种越来越受欢迎的事后解释形式，因为它们适用于各种问题领域、提供了法律合规性（例如符合《通用数据保护条例》），并且依赖于人类解释的对比性质。虽然反事实解释通常用于解释单个预测实例，但我们探索了一个新的用例，即使用“群体反事实”来集体解释类似实例的组（例如突出显示一组患者中疾病重复出现的模式）。这些群体反事实满足人们对包含多个事件/实例的连贯、广泛解释的偏好。我们提出了一种新颖的群体反事实算法来生成高覆盖率的解释，这种解释又忠实于待解释模型。还使用客观（即准确性）和主观（即信心、解释满意度）评估了该解释策略在大型控制用户研究（N=207）中的表现。",
    "tldr": "该论文探索了一种新的用例，使用“群体反事实”集体解释类似实例的组，提出了一种新颖的群体反事实算法来生成高覆盖率的解释，适合人类对连贯、广泛解释的喜好。",
    "en_tdlr": "The paper proposes a novel use case of using group counterfactuals, and presents a group-counterfactual algorithm to generate high-coverage explanations, which meet human preference for coherent, broad explanations. The proposed strategy is evaluated in a large, controlled user study."
}