{
    "title": "Designing Participatory AI: Creative Professionals' Worries and Expectations about Generative AI. (arXiv:2303.08931v1 [cs.HC])",
    "abstract": "Generative AI, i.e., the group of technologies that automatically generate visual or written content based on text prompts, has undergone a leap in complexity and become widely available within just a few years. Such technologies potentially introduce a massive disruption to creative fields. This paper presents the results of a qualitative survey ($N$ = 23) investigating how creative professionals think about generative AI. The results show that the advancement of these AI models prompts important reflections on what defines creativity and how creatives imagine using AI to support their workflows. Based on these reflections, we discuss how we might design \\textit{participatory AI} in the domain of creative expertise with the goal of empowering creative professionals in their present and future coexistence with AI.",
    "link": "http://arxiv.org/abs/2303.08931",
    "context": "Title: Designing Participatory AI: Creative Professionals' Worries and Expectations about Generative AI. (arXiv:2303.08931v1 [cs.HC])\nAbstract: Generative AI, i.e., the group of technologies that automatically generate visual or written content based on text prompts, has undergone a leap in complexity and become widely available within just a few years. Such technologies potentially introduce a massive disruption to creative fields. This paper presents the results of a qualitative survey ($N$ = 23) investigating how creative professionals think about generative AI. The results show that the advancement of these AI models prompts important reflections on what defines creativity and how creatives imagine using AI to support their workflows. Based on these reflections, we discuss how we might design \\textit{participatory AI} in the domain of creative expertise with the goal of empowering creative professionals in their present and future coexistence with AI.",
    "path": "papers/23/03/2303.08931.json",
    "total_tokens": 811,
    "translated_title": "设计参与式AI：创意专业人士对生成AI的忧虑和期望。",
    "translated_abstract": "自动基于文本提示生成视觉或书面内容的生成AI已经在短短几年内经历了复杂性的飞跃并广泛普及。这些技术潜在地对创意领域造成了巨大的冲击。本文介绍了一项定性调研（$N$ = 23），调查了创意专业人士如何思考生成AI。结果表明，这些AI模型的进步促使对定义创造力的重要反思，并探讨了创意专业人士如何想象使用AI来支持他们的工作流程。基于这些思考，我们讨论如何设计在创意专业领域中的\\textit{参与式 AI}，以赋予创意专业人士在他们与AI的现在和未来共存中的自主权。",
    "tldr": "本文介绍了一项调查，调查了创意专业人士对生成AI的关注点和期望，并讨论了如何设计参与式AI来赋予创意专业人士在与AI的现在和未来的协作中的自主权。",
    "en_tdlr": "This paper presents the results of a survey on creative professionals' concerns and expectations regarding generative AI, and discusses how to design participatory AI to empower them in their present and future coexistence with AI."
}