{
    "title": "Traffic State Estimation from Vehicle Trajectories with Anisotropic Gaussian Processes",
    "abstract": "arXiv:2303.02311v2 Announce Type: replace  Abstract: Accurately monitoring road traffic state is crucial for various applications, including travel time prediction, traffic control, and traffic safety. However, the lack of sensors often results in incomplete traffic state data, making it challenging to obtain reliable information for decision-making. This paper proposes a novel method for imputing traffic state data using Gaussian processes (GP) to address this issue. We propose a kernel rotation re-parametrization scheme that transforms a standard isotropic GP kernel into an anisotropic kernel, which can better model the congestion propagation in traffic flow data. The model parameters can be estimated by statistical inference using data from sparse probe vehicles or loop detectors. Moreover, the rotated GP method provides statistical uncertainty quantification for the imputed traffic state, making it more reliable. We also extend our approach to a multi-output GP, which allows for si",
    "link": "https://arxiv.org/abs/2303.02311",
    "context": "Title: Traffic State Estimation from Vehicle Trajectories with Anisotropic Gaussian Processes\nAbstract: arXiv:2303.02311v2 Announce Type: replace  Abstract: Accurately monitoring road traffic state is crucial for various applications, including travel time prediction, traffic control, and traffic safety. However, the lack of sensors often results in incomplete traffic state data, making it challenging to obtain reliable information for decision-making. This paper proposes a novel method for imputing traffic state data using Gaussian processes (GP) to address this issue. We propose a kernel rotation re-parametrization scheme that transforms a standard isotropic GP kernel into an anisotropic kernel, which can better model the congestion propagation in traffic flow data. The model parameters can be estimated by statistical inference using data from sparse probe vehicles or loop detectors. Moreover, the rotated GP method provides statistical uncertainty quantification for the imputed traffic state, making it more reliable. We also extend our approach to a multi-output GP, which allows for si",
    "path": "papers/23/03/2303.02311.json",
    "total_tokens": 816,
    "translated_title": "采用各向异性高斯过程从车辆轨迹中估计交通状态",
    "translated_abstract": "准确监测道路交通状态对各种应用至关重要，包括旅行时间预测、交通控制和交通安全。然而，传感器的缺乏经常导致交通状态数据不完整，使得获取可靠信息以进行决策变得具有挑战性。本文提出了一种新颖的方法，使用高斯过程（GP）来填补交通状态数据，以解决这一问题。我们提出了一种核旋转重新参数化方案，将标准各向同性GP核转换为各向异性核，从而更好地对交通流数据中的拥堵传播进行建模。模型参数可以通过使用来自稀疏探测车辆或环形检测器的数据进行统计推断来估计。此外，旋转的GP方法为填补后的交通状态提供了统计不确定性量化，使其更可靠。我们还将我们的方法扩展到多输出GP，这允许si",
    "tldr": "通过各向异性高斯过程的方法填补交通状态数据，提供更可靠的交通状态估计，具有统计不确定性量化。",
    "en_tdlr": "Filling in traffic state data with anisotropic Gaussian processes provides more reliable estimation with statistical uncertainty quantification."
}