{
    "title": "Functional-Coefficient Quantile Regression for Panel Data with Latent Group Structure. (arXiv:2303.13218v1 [econ.EM])",
    "abstract": "This paper considers estimating functional-coefficient models in panel quantile regression with individual effects, allowing the cross-sectional and temporal dependence for large panel observations. A latent group structure is imposed on the heterogenous quantile regression models so that the number of nonparametric functional coefficients to be estimated can be reduced considerably. With the preliminary local linear quantile estimates of the subject-specific functional coefficients, a classic agglomerative clustering algorithm is used to estimate the unknown group structure and an easy-to-implement ratio criterion is proposed to determine the group number. The estimated group number and structure are shown to be consistent. Furthermore, a post-grouping local linear smoothing method is introduced to estimate the group-specific functional coefficients, and the relevant asymptotic normal distribution theory is derived with a normalisation rate comparable to that in the literature. The de",
    "link": "http://arxiv.org/abs/2303.13218",
    "context": "Title: Functional-Coefficient Quantile Regression for Panel Data with Latent Group Structure. (arXiv:2303.13218v1 [econ.EM])\nAbstract: This paper considers estimating functional-coefficient models in panel quantile regression with individual effects, allowing the cross-sectional and temporal dependence for large panel observations. A latent group structure is imposed on the heterogenous quantile regression models so that the number of nonparametric functional coefficients to be estimated can be reduced considerably. With the preliminary local linear quantile estimates of the subject-specific functional coefficients, a classic agglomerative clustering algorithm is used to estimate the unknown group structure and an easy-to-implement ratio criterion is proposed to determine the group number. The estimated group number and structure are shown to be consistent. Furthermore, a post-grouping local linear smoothing method is introduced to estimate the group-specific functional coefficients, and the relevant asymptotic normal distribution theory is derived with a normalisation rate comparable to that in the literature. The de",
    "path": "papers/23/03/2303.13218.json",
    "total_tokens": 985,
    "translated_title": "具有潜在群组结构的面板数据定量回归的功能系数估计",
    "translated_abstract": "本文考虑在个体效应下，在大规模面板观测的情况下，估计面板定量回归中的功能系数模型，允许横向和时间依赖性。在异质定量回归模型中，施加潜在的群组结构，从而可以显著减少需要估计的非参数功能系数数量。使用主题特定功能系数的初步局部线性分位数估计，采用经典的聚类聚合算法来估计未知的群组结构，并提出一个易于实现的比率准则来确定群组数量。证明了估计的群组数量和结构的一致性。此外，引入了一种群组后局部线性平滑方法来估计各群组特定的功能系数，并导出了相关的渐近正常分布理论，其归一化速率与文献中的速率相当。",
    "tldr": "本文提出了一种具有潜在群组结构的面板数据定量回归的功能系数估计方法，通过施加潜在的群组结构的方法，显著减少了需要估计的非参数功能系数数量，使用局部线性分位数估计和经典聚类算法来估计未知的群组结构，并使用一种比率准则确定群组数量。最终通过群组后局部线性平滑方法来估计群组特定的功能系数。",
    "en_tdlr": "This paper proposes a functional-coefficient estimation method for panel quantile regression with latent group structure, which significantly reduces the number of nonparametric functional coefficients by imposing a latent group structure. The method uses local linear quantile estimation and classic clustering algorithm to estimate the unknown group structure, and a ratio criterion to determine the group number. The group-specific functional coefficients are estimated using a post-grouping local linear smoothing method, and the relevant asymptotic normal distribution theory is derived with a comparable normalization rate to the literature."
}