{
    "title": "Wireless Sensor Networks anomaly detection using Machine Learning: A Survey. (arXiv:2303.08823v1 [cs.LG])",
    "abstract": "Wireless Sensor Networks (WSNs) have become increasingly valuable in various civil/military applications like industrial process control, civil engineering applications such as buildings structural strength monitoring, environmental monitoring, border intrusion, IoT (Internet of Things), and healthcare. However, the sensed data generated by WSNs is often noisy and unreliable, making it a challenge to detect and diagnose anomalies. Machine learning (ML) techniques have been widely used to address this problem by detecting and identifying unusual patterns in the sensed data. This survey paper provides an overview of the state of the art applications of ML techniques for data anomaly detection in WSN domains. We first introduce the characteristics of WSNs and the challenges of anomaly detection in WSNs. Then, we review various ML techniques such as supervised, unsupervised, and semi-supervised learning that have been applied to WSN data anomaly detection. We also compare different ML-base",
    "link": "http://arxiv.org/abs/2303.08823",
    "context": "Title: Wireless Sensor Networks anomaly detection using Machine Learning: A Survey. (arXiv:2303.08823v1 [cs.LG])\nAbstract: Wireless Sensor Networks (WSNs) have become increasingly valuable in various civil/military applications like industrial process control, civil engineering applications such as buildings structural strength monitoring, environmental monitoring, border intrusion, IoT (Internet of Things), and healthcare. However, the sensed data generated by WSNs is often noisy and unreliable, making it a challenge to detect and diagnose anomalies. Machine learning (ML) techniques have been widely used to address this problem by detecting and identifying unusual patterns in the sensed data. This survey paper provides an overview of the state of the art applications of ML techniques for data anomaly detection in WSN domains. We first introduce the characteristics of WSNs and the challenges of anomaly detection in WSNs. Then, we review various ML techniques such as supervised, unsupervised, and semi-supervised learning that have been applied to WSN data anomaly detection. We also compare different ML-base",
    "path": "papers/23/03/2303.08823.json",
    "total_tokens": 976,
    "translated_title": "无线传感器网络中的机器学习异常检测：综述",
    "translated_abstract": "无线传感器网络（WSN）已经在各种公民/军事应用中变得越来越有价值，如工业过程控制、建筑结构强度监测、环境监测、边境入侵、物联网和医疗保健等。然而，WSN产生的传感数据通常噪声和不可靠，这使得检测和诊断异常成为一项挑战。机器学习（ML）技术已广泛应用于解决此问题，通过检测和识别传感数据中的异常模式。本综述论文概述了ML技术在WSN领域数据异常检测方面的最新应用。我们首先介绍WSN的特征和WSN中异常检测的挑战。接着，我们回顾了各种应用于WSN数据异常检测的监督，无监督和半监督学习等ML技术。我们还比较了不同的ML异常检测方法，并强调了它们的优缺点。最后，我们讨论了一些开放的研究问题，并概述了这一领域的未来研究方向。",
    "tldr": "本篇综述论文介绍了机器学习技术在无线传感器网络中进行数据异常检测的最新应用。讲述了这种技术能够解决传感数据中异常模式检测的问题，并比较了不同方法的优缺点。",
    "en_tdlr": "This survey paper provides an overview of the latest applications of machine learning techniques for data anomaly detection in wireless sensor networks (WSN). It explains how these techniques can solve the problem of detecting anomalous patterns in sensed data, and compares the pros and cons of different methods."
}