{
    "title": "An End-to-End Neural Network for Image-to-Audio Transformation. (arXiv:2303.06078v1 [eess.AS])",
    "abstract": "This paper describes an end-to-end (E2E) neural architecture for the audio rendering of small portions of display content on low resource personal computing devices. It is intended to address the problem of accessibility for vision-impaired or vision-distracted users at the hardware level. Neural image-to-text (ITT) and text-to-speech (TTS) approaches are reviewed and a new technique is introduced to efficiently integrate them in a way that is both efficient and back-propagate-able, leading to a non-autoregressive E2E image-to-speech (ITS) neural network that is efficient and trainable. Experimental results are presented showing that, compared with the non-E2E approach, the proposed E2E system is 29% faster and uses 19% fewer parameters with a 2% reduction in phone accuracy. A future direction to address accuracy is presented.",
    "link": "http://arxiv.org/abs/2303.06078",
    "raw_ret": "{\n    \"translated_title\": \"一种端到端的图像到音频转换神经网络\",\n    \"translated_abstract\": \"本文描述了一种端到端（E2E）神经结构，用于在低资源个人计算设备上呈现小部分显示内容的音频渲染。旨在解决硬件层面上视障或视觉分散用户的可访问性问题。回顾了神经图像到文本（ITT）和文本到语音（TTS）方法，并引入了一种新技术，以有效地将它们集成在一起，既高效又可反向传播，从而导致一种非自回归的E2E图像到语音（ITS）神经网络，这种神经网络具有高效和可训练性。实验结果表明，与非E2E方法相比，所提出的E2E系统速度提高了29％，参数减少了19％，电话准确率降低了2％。提出了一个未来方向来解决准确性问题。\",\n    \"tldr\": \"本文提出了一种端到端的图像到语音神经网络，用于在低资源设备上呈现小部分显示内容的音频渲染，解决了硬件层面上视障或视觉分散用户的可访问性问题，并且比非E2E方法更高效，使用的参数更少，降低了电话准确率。\"\n}<|im_sep|>",
    "total_tokens": 848,
    "ret": {
        "translated_title": "一种端到端的图像到音频转换神经网络",
        "translated_abstract": "本文描述了一种端到端（E2E）神经结构，用于在低资源个人计算设备上呈现小部分显示内容的音频渲染。旨在解决硬件层面上视障或视觉分散用户的可访问性问题。回顾了神经图像到文本（ITT）和文本到语音（TTS）方法，并引入了一种新技术，以有效地将它们集成在一起，既高效又可反向传播，从而导致一种非自回归的E2E图像到语音（ITS）神经网络，这种神经网络具有高效和可训练性。实验结果表明，与非E2E方法相比，所提出的E2E系统速度提高了29％，参数减少了19％，电话准确率降低了2％。提出了一个未来方向来解决准确性问题。",
        "tldr": "本文提出了一种端到端的图像到语音神经网络，用于在低资源设备上呈现小部分显示内容的音频渲染，解决了硬件层面上视障或视觉分散用户的可访问性问题，并且比非E2E方法更高效，使用的参数更少，降低了电话准确率。"
    }
}