{
    "title": "Heat flux for semi-local machine-learning potentials. (arXiv:2303.14434v1 [cond-mat.mtrl-sci])",
    "abstract": "The Green-Kubo (GK) method is a rigorous framework for heat transport simulations in materials. However, it requires an accurate description of the potential-energy surface and carefully converged statistics. Machine-learning potentials can achieve the accuracy of first-principles simulations while allowing to reach well beyond their simulation time and length scales at a fraction of the cost. In this paper, we explain how to apply the GK approach to the recent class of message-passing machine-learning potentials, which iteratively consider semi-local interactions beyond the initial interaction cutoff. We derive an adapted heat flux formulation that can be implemented using automatic differentiation without compromising computational efficiency. The approach is demonstrated and validated by calculating the thermal conductivity of zirconium dioxide across temperatures.",
    "link": "http://arxiv.org/abs/2303.14434",
    "context": "Title: Heat flux for semi-local machine-learning potentials. (arXiv:2303.14434v1 [cond-mat.mtrl-sci])\nAbstract: The Green-Kubo (GK) method is a rigorous framework for heat transport simulations in materials. However, it requires an accurate description of the potential-energy surface and carefully converged statistics. Machine-learning potentials can achieve the accuracy of first-principles simulations while allowing to reach well beyond their simulation time and length scales at a fraction of the cost. In this paper, we explain how to apply the GK approach to the recent class of message-passing machine-learning potentials, which iteratively consider semi-local interactions beyond the initial interaction cutoff. We derive an adapted heat flux formulation that can be implemented using automatic differentiation without compromising computational efficiency. The approach is demonstrated and validated by calculating the thermal conductivity of zirconium dioxide across temperatures.",
    "path": "papers/23/03/2303.14434.json",
    "total_tokens": 757,
    "translated_title": "半局域机器学习势的热通量",
    "translated_abstract": "Green-Kubo (GK)方法是材料热传输模拟的严格框架，但它需要准确描述势能表面且收敛统计量。机器学习势可以达到第一性原理模拟的准确性，同时可以在一小部分成本内超越其模拟时间和长度尺度。在本文中，我们解释了如何将GK方法应用于最近的消息传递机器学习势类，该方法迭代地考虑初始交互截断以外的半局域交互。我们推导出一个适应的热通量公式，可以使用自动微分实现，而不会影响计算效率。该方法通过计算二氧化锆的热导率验证和验证。",
    "tldr": "本文中介绍了如何将Green-Kubo方法应用于半局域机器学习势，使用自动微分推导出适应的热通量公式，成功计算了二氧化锆的热导率。",
    "en_tdlr": "This paper introduces how to apply the Green-Kubo method to semi-local machine-learning potentials, and derives an adapted heat flux formulation using automatic differentiation, which is demonstrated by calculating the thermal conductivity of zirconium dioxide."
}