{
    "title": "Poisoning Attacks in Federated Edge Learning for Digital Twin 6G-enabled IoTs: An Anticipatory Study. (arXiv:2303.11745v1 [cs.CR])",
    "abstract": "Federated edge learning can be essential in supporting privacy-preserving, artificial intelligence (AI)-enabled activities in digital twin 6G-enabled Internet of Things (IoT) environments. However, we need to also consider the potential of attacks targeting the underlying AI systems (e.g., adversaries seek to corrupt data on the IoT devices during local updates or corrupt the model updates); hence, in this article, we propose an anticipatory study for poisoning attacks in federated edge learning for digital twin 6G-enabled IoT environments. Specifically, we study the influence of adversaries on the training and development of federated learning models in digital twin 6G-enabled IoT environments. We demonstrate that attackers can carry out poisoning attacks in two different learning settings, namely: centralized learning and federated learning, and successful attacks can severely reduce the model's accuracy. We comprehensively evaluate the attacks on a new cyber security dataset designe",
    "link": "http://arxiv.org/abs/2303.11745",
    "context": "Title: Poisoning Attacks in Federated Edge Learning for Digital Twin 6G-enabled IoTs: An Anticipatory Study. (arXiv:2303.11745v1 [cs.CR])\nAbstract: Federated edge learning can be essential in supporting privacy-preserving, artificial intelligence (AI)-enabled activities in digital twin 6G-enabled Internet of Things (IoT) environments. However, we need to also consider the potential of attacks targeting the underlying AI systems (e.g., adversaries seek to corrupt data on the IoT devices during local updates or corrupt the model updates); hence, in this article, we propose an anticipatory study for poisoning attacks in federated edge learning for digital twin 6G-enabled IoT environments. Specifically, we study the influence of adversaries on the training and development of federated learning models in digital twin 6G-enabled IoT environments. We demonstrate that attackers can carry out poisoning attacks in two different learning settings, namely: centralized learning and federated learning, and successful attacks can severely reduce the model's accuracy. We comprehensively evaluate the attacks on a new cyber security dataset designe",
    "path": "papers/23/03/2303.11745.json",
    "total_tokens": 957,
    "translated_title": "面向数字孪生6G物联网的联邦边缘学习中的毒化攻击：一项预测性研究",
    "translated_abstract": "联邦边缘学习在支持数字孪生6G物联网环境下的隐私保护、人工智能（AI）应用方面具有重要作用。然而，我们需要考虑到攻击目标是基于AI系统的潜在威胁，例如，攻击者试图在本地更新期间破坏物联网设备上的数据或破坏模型更新过程。因此，我们提出了一项针对数字孪生6G物联网环境下联邦边缘学习中的毒化攻击的预测性研究。具体来说，我们研究了攻击对数字孪生6G物联网环境中联邦学习模型的训练和发展的影响。我们证明了攻击者可以在两种不同的学习设置中（即集中式学习和联邦学习）进行毒化攻击，并且成功的攻击会严重降低模型的准确性。我们在一个新的网络安全数据集上全面评估了这些攻击。",
    "tldr": "本文研究了面向数字孪生6G物联网的联邦边缘学习中的毒化攻击的预测性研究，发现攻击者可以在集中式学习和联邦学习中进行攻击，并且成功的攻击会降低模型的准确性。",
    "en_tdlr": "This paper proposes an anticipatory study for poisoning attacks in federated edge learning for digital twin 6G-enabled IoT environments. Successful attacks can severely reduce the model's accuracy in both centralized and federated learning settings."
}