{
    "title": "Towards risk-informed PBSHM: Populations as hierarchical systems. (arXiv:2303.13533v1 [cs.AI])",
    "abstract": "The prospect of informed and optimal decision-making regarding the operation and maintenance (O&M) of structures provides impetus to the development of structural health monitoring (SHM) systems. A probabilistic risk-based framework for decision-making has already been proposed. However, in order to learn the statistical models necessary for decision-making, measured data from the structure of interest are required. Unfortunately, these data are seldom available across the range of environmental and operational conditions necessary to ensure good generalisation of the model.  Recently, technologies have been developed that overcome this challenge, by extending SHM to populations of structures, such that valuable knowledge may be transferred between instances of structures that are sufficiently similar. This new approach is termed population-based structural heath monitoring (PBSHM).  The current paper presents a formal representation of populations of structures, such that risk-based d",
    "link": "http://arxiv.org/abs/2303.13533",
    "context": "Title: Towards risk-informed PBSHM: Populations as hierarchical systems. (arXiv:2303.13533v1 [cs.AI])\nAbstract: The prospect of informed and optimal decision-making regarding the operation and maintenance (O&M) of structures provides impetus to the development of structural health monitoring (SHM) systems. A probabilistic risk-based framework for decision-making has already been proposed. However, in order to learn the statistical models necessary for decision-making, measured data from the structure of interest are required. Unfortunately, these data are seldom available across the range of environmental and operational conditions necessary to ensure good generalisation of the model.  Recently, technologies have been developed that overcome this challenge, by extending SHM to populations of structures, such that valuable knowledge may be transferred between instances of structures that are sufficiently similar. This new approach is termed population-based structural heath monitoring (PBSHM).  The current paper presents a formal representation of populations of structures, such that risk-based d",
    "path": "papers/23/03/2303.13533.json",
    "total_tokens": 822,
    "translated_title": "基于风险的群体结构健康监视理论：以层次系统中的人口为例",
    "translated_abstract": "在结构健康监测（SHM）系统的发展中，有一种基于概率风险的决策框架已经被提出。然而，为了学习决策所需的统计模型，需要从感兴趣的结构获得测量数据。不幸的是，这些数据很少在必要的环境和操作条件下涵盖足够的范围，以确保模型的良好泛化。最近，出现了可以将SHM扩展到结构群体的技术，以便在足够相似的结构实例之间传递有价值的知识。这个新方法被称为基于群体的结构健康监测(PBSHM)。本文提出了人群结构的正式表达，以进行基于风险的决策的表示。",
    "tldr": "PBSHM是一种新的结构健康监测方法，它通过对结构群体进行监测，将有价值的知识在结构实例之间传递，从而提高了决策的准确性和泛化能力。"
}