{
    "title": "Exploring the Benefits of Visual Prompting in Differential Privacy. (arXiv:2303.12247v1 [cs.CV])",
    "abstract": "Visual Prompting (VP) is an emerging and powerful technique that allows sample-efficient adaptation to downstream tasks by engineering a well-trained frozen source model. In this work, we explore the benefits of VP in constructing compelling neural network classifiers with differential privacy (DP). We explore and integrate VP into canonical DP training methods and demonstrate its simplicity and efficiency. In particular, we discover that VP in tandem with PATE, a state-of-the-art DP training method that leverages the knowledge transfer from an ensemble of teachers, achieves the state-of-the-art privacy-utility trade-off with minimum expenditure of privacy budget. Moreover, we conduct additional experiments on cross-domain image classification with a sufficient domain gap to further unveil the advantage of VP in DP. Lastly, we also conduct extensive ablation studies to validate the effectiveness and contribution of VP under DP consideration.",
    "link": "http://arxiv.org/abs/2303.12247",
    "context": "Title: Exploring the Benefits of Visual Prompting in Differential Privacy. (arXiv:2303.12247v1 [cs.CV])\nAbstract: Visual Prompting (VP) is an emerging and powerful technique that allows sample-efficient adaptation to downstream tasks by engineering a well-trained frozen source model. In this work, we explore the benefits of VP in constructing compelling neural network classifiers with differential privacy (DP). We explore and integrate VP into canonical DP training methods and demonstrate its simplicity and efficiency. In particular, we discover that VP in tandem with PATE, a state-of-the-art DP training method that leverages the knowledge transfer from an ensemble of teachers, achieves the state-of-the-art privacy-utility trade-off with minimum expenditure of privacy budget. Moreover, we conduct additional experiments on cross-domain image classification with a sufficient domain gap to further unveil the advantage of VP in DP. Lastly, we also conduct extensive ablation studies to validate the effectiveness and contribution of VP under DP consideration.",
    "path": "papers/23/03/2303.12247.json",
    "total_tokens": 934,
    "translated_title": "探索差分隐私中视觉提示的好处",
    "translated_abstract": "视觉提示（VP）是一种新兴且强大的技术，通过设计一个经过良好训练的冻结源模型，可以实现对下游任务的样本高效适应。在本文中，我们探讨了在差分隐私（DP）中利用VP构建引人注目的神经网络分类器的好处。我们探索并将VP整合到经典的DP训练方法中，并展示了其简单性和效率。特别是，我们发现VP与PATE（一种利用教师集合的知识转移的最先进的DP训练方法）相配合，在隐私预算最小的情况下实现了最先进的隐私-效用平衡。此外，我们对跨域图像分类进行了额外的实验，以进一步揭示在DP中VP的优势。最后，我们进行了广泛的消融研究，以验证VP在DP考虑下的有效性和贡献。",
    "tldr": "本文探讨了在差分隐私（DP）中利用视觉提示（VP）构建神经网络分类器的好处。VP与PATE相配合，在隐私预算最小的情况下实现了最先进的隐私-效用平衡，在跨域图像分类中也显示了其优势。此外，消融研究表明VP在DP中具有很好的有效性和贡献。",
    "en_tdlr": "This paper explores the benefits of using Visual Prompting (VP) in constructing neural network classifiers with differential privacy (DP). The results show that VP in tandem with PATE achieves the state-of-the-art privacy-utility trade-off with minimum expenditure of privacy budget, and also demonstrate its advantages in cross-domain image classification. Furthermore, extensive ablation studies validate the effectiveness and contribution of VP under DP consideration."
}