{
    "title": "Self-Supervised One-Shot Learning for Automatic Segmentation of StyleGAN Images. (arXiv:2303.05639v1 [cs.CV])",
    "abstract": "We propose in this paper a framework for automatic one-shot segmentation of synthetic images generated using StyleGANs. As to the need for `one-shot segmentation', we want the network to carry out a semantic segmentation of the images on the fly, that is, as they are being produced at inference time. The implementation of our framework is based on the observation that the multi-scale hidden features produced by a GAN during image synthesis hold useful semantic information that can be utilized for automatic segmentation. Using these features, our proposed framework learns to segment synthetic images using a novel self-supervised, contrastive clustering algorithm that projects the hidden features in the generator onto a compact feature space for per-pixel classification. This contrastive learner uses a swapped prediction loss for image segmentation that is computed using pixel-wise cluster assignments for the image and its transformed variants. Using the hidden features from an already p",
    "link": "http://arxiv.org/abs/2303.05639",
    "raw_ret": "{\n    \"translated_title\": \"自监督单次学习用于StyleGAN图像自动分割\",\n    \"translated_abstract\": \"我们在本文中提出了一种用于StyleGAN合成图像自动单次分割的框架。我们需要网络在推理时间进行语义分割。我们的框架的实现基于一个观察，即GAN在图像合成过程中产生的多尺度隐藏特征包含可以用于自动分割的有用语义信息。使用这些特征，我们提出的框架学习使用新颖的自监督对比聚类算法对合成图像进行分割，该算法将发生器中的隐藏特征投影到紧凑的特征空间进行像素分类。这个对比学习者使用交换的像素分配计算图像分割的交换预测损失，用于图像和其变换版本的像素级聚类分配。使用来自先前训练的GAN生成器的隐藏特征\",\n    \"tldr\": \"该论文提出了一种用于StyleGAN合成图像自动单次分割的框架，利用GAN在图像合成中产生的多尺度隐藏特征进行语义分割，使用新颖的自监督对比聚类算法进行分割，该算法将发生器中的隐藏特征投影到紧凑的特征空间进行像素分类。\"\n}<|im_sep|>",
    "total_tokens": 839,
    "ret": {
        "translated_title": "自监督单次学习用于StyleGAN图像自动分割",
        "translated_abstract": "我们在本文中提出了一种用于StyleGAN合成图像自动单次分割的框架。我们需要网络在推理时间进行语义分割。我们的框架的实现基于一个观察，即GAN在图像合成过程中产生的多尺度隐藏特征包含可以用于自动分割的有用语义信息。使用这些特征，我们提出的框架学习使用新颖的自监督对比聚类算法对合成图像进行分割，该算法将发生器中的隐藏特征投影到紧凑的特征空间进行像素分类。这个对比学习者使用交换的像素分配计算图像分割的交换预测损失，用于图像和其变换版本的像素级聚类分配。使用来自先前训练的GAN生成器的隐藏特征",
        "tldr": "该论文提出了一种用于StyleGAN合成图像自动单次分割的框架，利用GAN在图像合成中产生的多尺度隐藏特征进行语义分割，使用新颖的自监督对比聚类算法进行分割，该算法将发生器中的隐藏特征投影到紧凑的特征空间进行像素分类。"
    }
}