{
    "title": "HRDoc: Dataset and Baseline Method Toward Hierarchical Reconstruction of Document Structures. (arXiv:2303.13839v1 [cs.CL])",
    "abstract": "The problem of document structure reconstruction refers to converting digital or scanned documents into corresponding semantic structures. Most existing works mainly focus on splitting the boundary of each element in a single document page, neglecting the reconstruction of semantic structure in multi-page documents. This paper introduces hierarchical reconstruction of document structures as a novel task suitable for NLP and CV fields. To better evaluate the system performance on the new task, we built a large-scale dataset named HRDoc, which consists of 2,500 multi-page documents with nearly 2 million semantic units. Every document in HRDoc has line-level annotations including categories and relations obtained from rule-based extractors and human annotators. Moreover, we proposed an encoder-decoder-based hierarchical document structure parsing system (DSPS) to tackle this problem. By adopting a multi-modal bidirectional encoder and a structure-aware GRU decoder with soft-mask operation",
    "link": "http://arxiv.org/abs/2303.13839",
    "context": "Title: HRDoc: Dataset and Baseline Method Toward Hierarchical Reconstruction of Document Structures. (arXiv:2303.13839v1 [cs.CL])\nAbstract: The problem of document structure reconstruction refers to converting digital or scanned documents into corresponding semantic structures. Most existing works mainly focus on splitting the boundary of each element in a single document page, neglecting the reconstruction of semantic structure in multi-page documents. This paper introduces hierarchical reconstruction of document structures as a novel task suitable for NLP and CV fields. To better evaluate the system performance on the new task, we built a large-scale dataset named HRDoc, which consists of 2,500 multi-page documents with nearly 2 million semantic units. Every document in HRDoc has line-level annotations including categories and relations obtained from rule-based extractors and human annotators. Moreover, we proposed an encoder-decoder-based hierarchical document structure parsing system (DSPS) to tackle this problem. By adopting a multi-modal bidirectional encoder and a structure-aware GRU decoder with soft-mask operation",
    "path": "papers/23/03/2303.13839.json",
    "total_tokens": 1023,
    "translated_title": "HRDoc: 面向文档结构层次重建的数据集和基线方法",
    "translated_abstract": "文档结构重建问题是将数字或扫描文档转换为相应的语义结构的问题。本文介绍了一种新的适用于 NLP 和 CV 领域的任务，即文档结构的分层重建。为了更好地评估系统在新任务上的性能，我们构建了一个名为 HRDoc 的大规模数据集，包括 2,500 个多页文档，近 2 百万个语义单元。HRDoc 中的每篇文档均具有分类和关系的线级标注，这些标注来自基于规则的提取器和人工标注员。此外，我们提出了一个基于编码器-解码器的文档结构分层解析系统 (DSPS) 来解决这个问题。通过采用多模态双向编码器和结构感知 GRU 解码器，DSPS 可以有效地捕捉高层语义结构并重建语义单元之间的层次关系。实验结果表明，我们提出的 DSPS 在 HRDoc 数据集上显著优于几种最先进的方法。",
    "tldr": "本文介绍了一种新的适用于 NLP 和 CV 领域的任务，即文档结构的分层重建。为了更好地评估系统在新任务上的性能，作者构建了一个名为 HRDoc 的大规模数据集，以及提出了一个基于编码器-解码器的文档结构分层解析系统 (DSPS)，实验结果表明 DSPS 在 HRDoc 数据集上的表现显著优于几种最先进的方法。",
    "en_tdlr": "This paper proposes a novel task of hierarchical reconstruction of document structures suitable for NLP and CV fields. The authors build a large-scale dataset named HRDoc and propose an encoder-decoder-based hierarchical document structure parsing system (DSPS) to tackle this problem, which significantly outperforms several state-of-the-art methods on the HRDoc dataset."
}