{
    "title": "Combating Algorithmic Collusion: A Mechanism Design Approach. (arXiv:2303.02576v2 [econ.TH] UPDATED)",
    "abstract": "Attention has recently been focused on the possibility of artificially intelligent sellers on platforms colluding to limit output and raise prices. Such arrangements (cartels), however, feature an incentive for individual sellers to deviate to a lower price (cheat) to increase their own profits. Stabilizing such cartels therefore requires credible threats of punishments, such as price wars. In this paper, I propose a mechanism to destabilize cartels by protecting any cheaters from a price war by guaranteeing a stream of profits which is unaffected by arbitrary punishments, only if such punishments actually occur. Equilibrium analysis of the induced game predicts a reversion to repeated static Nash pricing. When implemented in a reinforcement learning framework, it provides substantial reductions in prices (reducing markups by 40% or more), without affecting product variety or requiring the platform to make any payments on path. This mechanism applies to both the sale of differentiated ",
    "link": "http://arxiv.org/abs/2303.02576",
    "context": "Title: Combating Algorithmic Collusion: A Mechanism Design Approach. (arXiv:2303.02576v2 [econ.TH] UPDATED)\nAbstract: Attention has recently been focused on the possibility of artificially intelligent sellers on platforms colluding to limit output and raise prices. Such arrangements (cartels), however, feature an incentive for individual sellers to deviate to a lower price (cheat) to increase their own profits. Stabilizing such cartels therefore requires credible threats of punishments, such as price wars. In this paper, I propose a mechanism to destabilize cartels by protecting any cheaters from a price war by guaranteeing a stream of profits which is unaffected by arbitrary punishments, only if such punishments actually occur. Equilibrium analysis of the induced game predicts a reversion to repeated static Nash pricing. When implemented in a reinforcement learning framework, it provides substantial reductions in prices (reducing markups by 40% or more), without affecting product variety or requiring the platform to make any payments on path. This mechanism applies to both the sale of differentiated ",
    "path": "papers/23/03/2303.02576.json",
    "total_tokens": 884,
    "translated_title": "打击算法勾结：一种机制设计方法",
    "translated_abstract": "最近关注的焦点是平台上人工智能卖家勾结限制产量并提高价格的可能性。然而，这样的协议（卡特尔）对个别卖家以低价（欺骗）违背有增加自己利润的动机。因此，稳定这样的卡特尔需要可信的惩罚威胁，例如价格战。本文提出了一种机制，通过保护任何欺骗者免受价格战的影响来瓦解卡特尔，只有在实际发生这样的惩罚时，才保证不受任意惩罚影响的利润流。引发游戏的均衡分析预测会恢复到重复静态纳什定价。当在强化学习框架中实施时，它能够显著降低价格（降低40%或更多的利润率），不影响产品种类或要求平台在路径上进行任何付款。这种机制适用于差异化销售。",
    "tldr": "本文提出了一种机制设计方法来打击算法勾结，通过保护欺骗者免受价格战的影响，实现了有效降低价格，不影响产品种类或平台付款。"
}