{
    "title": "EdgeServe: An Execution Layer for Decentralized Prediction. (arXiv:2303.08028v1 [cs.DB])",
    "abstract": "The relevant features for a machine learning task may be aggregated from data sources collected on different nodes in a network. This problem, which we call decentralized prediction, creates a number of interesting systems challenges in managing data routing, placing computation, and time-synchronization. This paper presents EdgeServe, a machine learning system that can serve decentralized predictions. EdgeServe relies on a low-latency message broker to route data through a network to nodes that can serve predictions. EdgeServe relies on a series of novel optimizations that can tradeoff computation, communication, and accuracy. We evaluate EdgeServe on three decentralized prediction tasks: (1) multi-camera object tracking, (2) network intrusion detection, and (3) human activity recognition.",
    "link": "http://arxiv.org/abs/2303.08028",
    "context": "Title: EdgeServe: An Execution Layer for Decentralized Prediction. (arXiv:2303.08028v1 [cs.DB])\nAbstract: The relevant features for a machine learning task may be aggregated from data sources collected on different nodes in a network. This problem, which we call decentralized prediction, creates a number of interesting systems challenges in managing data routing, placing computation, and time-synchronization. This paper presents EdgeServe, a machine learning system that can serve decentralized predictions. EdgeServe relies on a low-latency message broker to route data through a network to nodes that can serve predictions. EdgeServe relies on a series of novel optimizations that can tradeoff computation, communication, and accuracy. We evaluate EdgeServe on three decentralized prediction tasks: (1) multi-camera object tracking, (2) network intrusion detection, and (3) human activity recognition.",
    "path": "papers/23/03/2303.08028.json",
    "total_tokens": 867,
    "translated_title": "EdgeServe:一种为去中心化预测而设计的执行层",
    "translated_abstract": "机器学习任务的相关特征可能来自于网络中不同节点收集的数据源。这种问题被称之为去中心化预测，并在数据路由、计算布局和时间同步方面带来了许多有趣的系统挑战。本文提出了一种名为EdgeServe的机器学习系统，可以为去中心化预测提供服务。 EdgeServe 依赖于一个低延迟的消息代理程序，通过网络路由数据到可以提供预测的节点。EdgeServe 依赖一系列新颖的优化，可以在计算、通信和准确性之间进行折衷。我们在三个去中心化预测任务中评估了EdgeServe：（1）多摄像机物体跟踪，（2）网络入侵检测和（3）人类活动识别。",
    "tldr": "EdgeServe 是一种为去中心化预测而设计的机器学习系统，通过低延迟的消息代理程序将数据路由到可以提供预测的节点。它具有一系列新颖的优化，可以在计算、通信和准确性之间进行折衷。在多摄像机物体跟踪，网络入侵检测和人类活动识别等三个去中心化预测任务中，EdgeServe 展现了很好的性能。",
    "en_tdlr": "EdgeServe is a machine learning system designed for decentralized prediction, which relies on a low-latency message broker to route data through a network to nodes that can serve predictions. It has a series of novel optimizations that can tradeoff computation, communication, and accuracy. EdgeServe has been evaluated on three decentralized prediction tasks and shows good performance."
}