{
    "title": "Symbolic Music Structure Analysis with Graph Representations and Changepoint Detection Methods. (arXiv:2303.13881v1 [cs.SD])",
    "abstract": "Music Structure Analysis is an open research task in Music Information Retrieval (MIR). In the past, there have been several works that attempt to segment music into the audio and symbolic domains, however, the identification and segmentation of the music structure at different levels is still an open research problem in this area. In this work we propose three methods, two of which are novel graph-based algorithms that aim to segment symbolic music by its form or structure: Norm, G-PELT and G-Window. We performed an ablation study with two public datasets that have different forms or structures in order to compare such methods varying their parameter values and comparing the performance against different music styles. We have found that encoding symbolic music with graph representations and computing the novelty of Adjacency Matrices obtained from graphs represent the structure of symbolic music pieces well without the need to extract features from it. We are able to detect the bounda",
    "link": "http://arxiv.org/abs/2303.13881",
    "context": "Title: Symbolic Music Structure Analysis with Graph Representations and Changepoint Detection Methods. (arXiv:2303.13881v1 [cs.SD])\nAbstract: Music Structure Analysis is an open research task in Music Information Retrieval (MIR). In the past, there have been several works that attempt to segment music into the audio and symbolic domains, however, the identification and segmentation of the music structure at different levels is still an open research problem in this area. In this work we propose three methods, two of which are novel graph-based algorithms that aim to segment symbolic music by its form or structure: Norm, G-PELT and G-Window. We performed an ablation study with two public datasets that have different forms or structures in order to compare such methods varying their parameter values and comparing the performance against different music styles. We have found that encoding symbolic music with graph representations and computing the novelty of Adjacency Matrices obtained from graphs represent the structure of symbolic music pieces well without the need to extract features from it. We are able to detect the bounda",
    "path": "papers/23/03/2303.13881.json",
    "total_tokens": 980,
    "translated_title": "基于图表示和变点检测方法的符号音乐结构分析",
    "translated_abstract": "音乐结构分析是音乐信息检索中的一个开放性研究任务。过去有几项工作试图将音乐分割成音频和符号领域，然而，在不同层面上识别和分割音乐结构仍是这个领域中的一个开放性研究问题。在这项工作中，我们提出了三种方法，其中两种是新颖的基于图的算法，旨在通过其形式或结构对符号音乐进行分割：Norm、G-PELT和G-Window。我们对两个具有不同形式或结构的公共数据集进行了削弱研究，以比较这些方法，改变其参数值，并将性能与不同的音乐风格进行比较。我们发现，用图表示对符号音乐进行编码并计算从图中获得的邻接矩阵的新颖性能很好地表示符号音乐片段的结构，无需从中提取特征。我们能够检测到边界。",
    "tldr": "该论文提出了两个新颖的基于图的算法，Norm和G-PELT，以及G-Window方法，用于通过其形式或结构对符号音乐进行分割。研究发现，使用图表示对符号音乐进行编码，并计算从图中获得的邻接矩阵的新颖性能很好地表示符号音乐片段的结构，并能够检测到边界。"
}