{
    "title": "Benchmarking the Impact of Noise on Deep Learning-based Classification of Atrial Fibrillation in 12-Lead ECG. (arXiv:2303.13915v1 [eess.SP])",
    "abstract": "Electrocardiography analysis is widely used in various clinical applications and Deep Learning models for classification tasks are currently in the focus of research. Due to their data-driven character, they bear the potential to handle signal noise efficiently, but its influence on the accuracy of these methods is still unclear. Therefore, we benchmark the influence of four types of noise on the accuracy of a Deep Learning-based method for atrial fibrillation detection in 12-lead electrocardiograms. We use a subset of a publicly available dataset (PTBXL) and use the metadata provided by human experts regarding noise for assigning a signal quality to each electrocardiogram. Furthermore, we compute a quantitative signal-to-noise ratio for each electrocardiogram. We analyze the accuracy of the Deep Learning model with respect to both metrics and observe that the method can robustly identify atrial fibrillation, even in cases signals are labelled by human experts as being noisy on multipl",
    "link": "http://arxiv.org/abs/2303.13915",
    "context": "Title: Benchmarking the Impact of Noise on Deep Learning-based Classification of Atrial Fibrillation in 12-Lead ECG. (arXiv:2303.13915v1 [eess.SP])\nAbstract: Electrocardiography analysis is widely used in various clinical applications and Deep Learning models for classification tasks are currently in the focus of research. Due to their data-driven character, they bear the potential to handle signal noise efficiently, but its influence on the accuracy of these methods is still unclear. Therefore, we benchmark the influence of four types of noise on the accuracy of a Deep Learning-based method for atrial fibrillation detection in 12-lead electrocardiograms. We use a subset of a publicly available dataset (PTBXL) and use the metadata provided by human experts regarding noise for assigning a signal quality to each electrocardiogram. Furthermore, we compute a quantitative signal-to-noise ratio for each electrocardiogram. We analyze the accuracy of the Deep Learning model with respect to both metrics and observe that the method can robustly identify atrial fibrillation, even in cases signals are labelled by human experts as being noisy on multipl",
    "path": "papers/23/03/2303.13915.json",
    "total_tokens": 987,
    "translated_title": "基于深度学习的房颤分类对噪声的影响评估：一个12导联心电图的基准测试",
    "translated_abstract": "心电图分析在各种临床应用中被广泛使用，深度学习模型用于分类任务目前是研究的重点。由于其数据驱动的特性，深度学习模型能够高效地处理信号噪声，但其对这些方法准确性的影响仍不清楚。因此，我们在一个公共可用数据集（PTBXL）的子集上进行了一个基于深度学习的方法的房颤检测精度在四种类型的噪声下的评估。我们使用由人工专家提供的关于噪声的元数据来为每个心电图分配信号质量。此外，我们为每个心电图计算了定量的信噪比。我们分析了深度学习模型的准确性与这两个度量标准的关系，并观察到该方法能够在某些信号被标记为多导噪声情况下稳健地识别房颤。我们的结果表明，深度学习方法在信号噪声存在的情况下具有很大的潜力。",
    "tldr": "本文评估了基于深度学习的房颤分类方法在12导联心电图噪声存在的情况下的准确性，结果显示该方法能够高效识别房颤并具有很大的潜力。"
}