{
    "title": "Pacos: Modeling Users' Interpretable and Context-Dependent Choices in Preference Reversals. (arXiv:2303.05648v1 [cs.IR])",
    "abstract": "Choice problems refer to selecting the best choices from several items, and learning users' preferences in choice problems is of great significance in understanding the decision making mechanisms and providing personalized services. Existing works typically assume that people evaluate items independently. In practice, however, users' preferences depend on the market in which items are placed, which is known as context effects; and the order of users' preferences for two items may even be reversed, which is referred to preference reversals. In this work, we identify three factors contributing to context effects: users' adaptive weights, the inter-item comparison, and display positions. We propose a context-dependent preference model named Pacos as a unified framework for addressing three factors simultaneously, and consider two design methods including an additive method with high interpretability and an ANN-based method with high accuracy. We study the conditions for preference reversa",
    "link": "http://arxiv.org/abs/2303.05648",
    "raw_ret": "{\n    \"translated_title\": \"Pacos：在偏好反转中建模用户的可解释性和上下文依赖选择\",\n    \"translated_abstract\": \"选择问题是从多个项目中选择最佳选择，学习用户在选择问题中的偏好对于了解决策制定机制和提供个性化服务具有重要意义。现有的工作通常假定人们独立评估项目。然而，在实践中，用户的偏好取决于物品所在的市场，这被称为上下文效应；用户对两个项目的偏好顺序甚至可能被颠倒，这被称为偏好反转。在这项工作中，我们确定了三个导致上下文效应的因素：用户的自适应权重，项目间比较和显示位置。我们提出了一个名为Pacos的上下文依赖偏好模型，作为同时解决三个因素的统一框架，并考虑了两种设计方法，包括具有高解释性的加法方法和具有高准确性的基于ANN的方法。我们研究了偏好反转的条件\",\n    \"tldr\": \"本文提出了一个上下文依赖偏好模型Pacos，针对偏好反转问题同时解决用户自适应权重、项目间比较和显示位置三个因素，该模型包括具有高解释性的加法方法和具有高准确性的基于ANN的方法。\"\n}",
    "total_tokens": 854,
    "ret": {
        "translated_title": "Pacos：在偏好反转中建模用户的可解释性和上下文依赖选择",
        "translated_abstract": "选择问题是从多个项目中选择最佳选择，学习用户在选择问题中的偏好对于了解决策制定机制和提供个性化服务具有重要意义。现有的工作通常假定人们独立评估项目。然而，在实践中，用户的偏好取决于物品所在的市场，这被称为上下文效应；用户对两个项目的偏好顺序甚至可能被颠倒，这被称为偏好反转。在这项工作中，我们确定了三个导致上下文效应的因素：用户的自适应权重，项目间比较和显示位置。我们提出了一个名为Pacos的上下文依赖偏好模型，作为同时解决三个因素的统一框架，并考虑了两种设计方法，包括具有高解释性的加法方法和具有高准确性的基于ANN的方法。我们研究了偏好反转的条件",
        "tldr": "本文提出了一个上下文依赖偏好模型Pacos，针对偏好反转问题同时解决用户自适应权重、项目间比较和显示位置三个因素，该模型包括具有高解释性的加法方法和具有高准确性的基于ANN的方法。"
    }
}