{
    "title": "Fashion-model pose recommendation and generation using Machine Learning. (arXiv:2303.08660v1 [cs.CV])",
    "abstract": "Fashion-model pose is an important attribute in the fashion industry. Creative directors, modeling production houses, and top photographers always look for professional models able to pose. without the skill to correctly pose, their chances of landing professional modeling employment are regrettably quite little. There are occasions when models and photographers are unsure of the best pose to strike while taking photographs. This research concentrates on suggesting the fashion personnel a series of similar images based on the input image. The image is segmented into different parts and similar images are suggested for the user. This was achieved by calculating the color histogram of the input image and applying the same for all the images in the dataset and comparing the histograms. Synthetic images have become popular to avoid privacy concerns and to overcome the high cost of photoshoots. Hence, this paper also extends the work of generating synthetic images from the recommendation en",
    "link": "http://arxiv.org/abs/2303.08660",
    "context": "Title: Fashion-model pose recommendation and generation using Machine Learning. (arXiv:2303.08660v1 [cs.CV])\nAbstract: Fashion-model pose is an important attribute in the fashion industry. Creative directors, modeling production houses, and top photographers always look for professional models able to pose. without the skill to correctly pose, their chances of landing professional modeling employment are regrettably quite little. There are occasions when models and photographers are unsure of the best pose to strike while taking photographs. This research concentrates on suggesting the fashion personnel a series of similar images based on the input image. The image is segmented into different parts and similar images are suggested for the user. This was achieved by calculating the color histogram of the input image and applying the same for all the images in the dataset and comparing the histograms. Synthetic images have become popular to avoid privacy concerns and to overcome the high cost of photoshoots. Hence, this paper also extends the work of generating synthetic images from the recommendation en",
    "path": "papers/23/03/2303.08660.json",
    "total_tokens": 791,
    "translated_title": "用机器学习生成时尚模特的摆姿建议和生成",
    "translated_abstract": "时尚模特的摆姿是时尚行业中很重要的属性。创意总监、模特制作公司和顶尖摄影师总是在寻找能够正确摆姿的专业模特，没有正确摆姿的技能，他们就很难获得专业的模特工作。本研究集中于为时尚人员建议一系列与输入图像相似的图像。该图像被分割成不同的部分，并为用户建议相似的图像。这是通过计算输入图像的颜色直方图并将其应用于数据集中的所有图像并比较直方图来实现的。为了避免隐私问题和克服摄影成本高的问题，生成合成图像变得越来越流行。因此，本文还扩展了从建议中生成合成图像的工作。",
    "tldr": "本研究使用机器学习算法将图像分割，并为时尚人员建议与输入图像相似的摆姿，同时扩展了工作生成合成图像。",
    "en_tdlr": "This research uses machine learning algorithms to segment images and suggest fashion personnel with similar poses to the input image, while also extending the work to generate synthetic images."
}