{
    "title": "How People Respond to the COVID-19 Pandemic on Twitter: A Comparative Analysis of Emotional Expressions from US and India. (arXiv:2303.10560v1 [cs.CL])",
    "abstract": "The COVID-19 pandemic has claimed millions of lives worldwide and elicited heightened emotions. This study examines the expression of various emotions pertaining to COVID-19 in the United States and India as manifested in over 54 million tweets, covering the fifteen-month period from February 2020 through April 2021, a period which includes the beginnings of the huge and disastrous increase in COVID-19 cases that started to ravage India in March 2021. Employing pre-trained emotion analysis and topic modeling algorithms, four distinct types of emotions (fear, anger, happiness, and sadness) and their time- and location-associated variations were examined. Results revealed significant country differences and temporal changes in the relative proportions of fear, anger, and happiness, with fear declining and anger and happiness fluctuating in 2020 until new situations over the first four months of 2021 reversed the trends. Detected differences are discussed briefly in terms of the latent to",
    "link": "http://arxiv.org/abs/2303.10560",
    "context": "Title: How People Respond to the COVID-19 Pandemic on Twitter: A Comparative Analysis of Emotional Expressions from US and India. (arXiv:2303.10560v1 [cs.CL])\nAbstract: The COVID-19 pandemic has claimed millions of lives worldwide and elicited heightened emotions. This study examines the expression of various emotions pertaining to COVID-19 in the United States and India as manifested in over 54 million tweets, covering the fifteen-month period from February 2020 through April 2021, a period which includes the beginnings of the huge and disastrous increase in COVID-19 cases that started to ravage India in March 2021. Employing pre-trained emotion analysis and topic modeling algorithms, four distinct types of emotions (fear, anger, happiness, and sadness) and their time- and location-associated variations were examined. Results revealed significant country differences and temporal changes in the relative proportions of fear, anger, and happiness, with fear declining and anger and happiness fluctuating in 2020 until new situations over the first four months of 2021 reversed the trends. Detected differences are discussed briefly in terms of the latent to",
    "path": "papers/23/03/2303.10560.json",
    "total_tokens": 907,
    "translated_title": "人们如何在 Twitter 上回应 COVID-19 疫情：美国和印度的情绪表达的比较分析",
    "translated_abstract": "COVID-19 疫情已夺去了全球数百万人的生命，引发了高度的情绪。本研究分析了美国和印度与 COVID-19 相关的各种情绪表达，涵盖了从2020年2月至2021年4月的15个月中的超过5400万条推文。采用预训练的情绪分析和主题建模算法，研究了四种不同类型的情绪（恐惧、愤怒、快乐和悲伤）及其与时间和地点相关的变化。结果显示，在恐惧情绪降低、愤怒和快乐情绪波动的情况下，2020年的趋势发生了反转，直到2021年前四个月的新情况再次导致这种趋势的出现。讨论了检测到的差异。",
    "tldr": "本研究分析了从2020年2月至2021年4月，超过5400万条美国和印度的推文中与COVID-19相关的情绪表达，发现两个国家的情绪表达有显著差异，同时在2020年中期情绪表达的趋势出现了反转。"
}