{
    "title": "Removing supervision in semantic segmentation with local-global matching and area balancing. (arXiv:2303.17410v1 [cs.CV])",
    "abstract": "Removing supervision in semantic segmentation is still tricky. Current approaches can deal with common categorical patterns yet resort to multi-stage architectures. We design a novel end-to-end model leveraging local-global patch matching to predict categories, good localization, area and shape of objects for semantic segmentation. The local-global matching is, in turn, compelled by optimal transport plans fulfilling area constraints nearing a solution for exact shape prediction. Our model attains state-of-the-art in Weakly Supervised Semantic Segmentation, only image-level labels, with 75% mIoU on PascalVOC2012 val set and 46% on MS-COCO2014 val set. Dropping the image-level labels and clustering self-supervised learned features to yield pseudo-multi-level labels, we obtain an unsupervised model for semantic segmentation. We also attain state-of-the-art on Unsupervised Semantic Segmentation with 43.6% mIoU on PascalVOC2012 val set and 19.4% on MS-COCO2014 val set. The code is availabl",
    "link": "http://arxiv.org/abs/2303.17410",
    "context": "Title: Removing supervision in semantic segmentation with local-global matching and area balancing. (arXiv:2303.17410v1 [cs.CV])\nAbstract: Removing supervision in semantic segmentation is still tricky. Current approaches can deal with common categorical patterns yet resort to multi-stage architectures. We design a novel end-to-end model leveraging local-global patch matching to predict categories, good localization, area and shape of objects for semantic segmentation. The local-global matching is, in turn, compelled by optimal transport plans fulfilling area constraints nearing a solution for exact shape prediction. Our model attains state-of-the-art in Weakly Supervised Semantic Segmentation, only image-level labels, with 75% mIoU on PascalVOC2012 val set and 46% on MS-COCO2014 val set. Dropping the image-level labels and clustering self-supervised learned features to yield pseudo-multi-level labels, we obtain an unsupervised model for semantic segmentation. We also attain state-of-the-art on Unsupervised Semantic Segmentation with 43.6% mIoU on PascalVOC2012 val set and 19.4% on MS-COCO2014 val set. The code is availabl",
    "path": "papers/23/03/2303.17410.json",
    "total_tokens": 943,
    "translated_title": "通过局部-全局匹配和面积平衡移除语义分割中的监督",
    "translated_abstract": "移除语义分割中的监督仍然很棘手。现有的方法可以处理常见的分类模式，但需要多阶段架构。我们设计了一种新的端到端模型，利用局部-全局补丁匹配预测语义分割的类别、良好的定位、对象的区域和形状。局部-全局匹配受到满足近似形状预测的面积约束的最优传输计划的驱动。我们的模型在只有图像级别标签的弱监督语义分割方面达到了最新水平，PascalVOC2012验证集上的mIoU为75％，在MS-COCO2014验证集上为46％。放弃图像级别标签并对聚类自监督学习的特征进行分组以产生伪多级标签，我们获得了一种用于语义分割的无监督模型。我们还在无监督语义分割方面达到了最新水平，PascalVOC2012验证集上的mIoU为43.6％，在MS-COCO2014验证集上为19.4％。代码可用。",
    "tldr": "本文提出了一种基于局部-全局匹配和面积平衡的端到端模型，可以移除语义分割中的监督，并在弱监督和无监督方面达到最新水平。",
    "en_tdlr": "This paper proposes an end-to-end model based on local-global patch matching and area balancing to remove supervision in semantic segmentation, achieving state-of-the-art results in weakly supervised and unsupervised scenarios."
}