{
    "title": "Neural Operators of Backstepping Controller and Observer Gain Functions for Reaction-Diffusion PDEs. (arXiv:2303.10506v1 [eess.SY])",
    "abstract": "Unlike ODEs, whose models involve system matrices and whose controllers involve vector or matrix gains, PDE models involve functions in those roles functional coefficients, dependent on the spatial variables, and gain functions dependent on space as well. The designs of gains for controllers and observers for PDEs, such as PDE backstepping, are mappings of system model functions into gain functions. These infinite dimensional nonlinear operators are given in an implicit form through PDEs, in spatial variables, which need to be solved to determine the gain function for each new functional coefficient of the PDE. The need for solving such PDEs can be eliminated by learning and approximating the said design mapping in the form of a neural operator. Learning the neural operator requires a sufficient number of prior solutions for the design PDEs, offline, as well as the training of the operator. In recent work, we developed the neural operators for PDE backstepping designs for first order h",
    "link": "http://arxiv.org/abs/2303.10506",
    "context": "Title: Neural Operators of Backstepping Controller and Observer Gain Functions for Reaction-Diffusion PDEs. (arXiv:2303.10506v1 [eess.SY])\nAbstract: Unlike ODEs, whose models involve system matrices and whose controllers involve vector or matrix gains, PDE models involve functions in those roles functional coefficients, dependent on the spatial variables, and gain functions dependent on space as well. The designs of gains for controllers and observers for PDEs, such as PDE backstepping, are mappings of system model functions into gain functions. These infinite dimensional nonlinear operators are given in an implicit form through PDEs, in spatial variables, which need to be solved to determine the gain function for each new functional coefficient of the PDE. The need for solving such PDEs can be eliminated by learning and approximating the said design mapping in the form of a neural operator. Learning the neural operator requires a sufficient number of prior solutions for the design PDEs, offline, as well as the training of the operator. In recent work, we developed the neural operators for PDE backstepping designs for first order h",
    "path": "papers/23/03/2303.10506.json",
    "total_tokens": 725,
    "translated_title": "反应扩散PDE的反步控制器与观测器增益函数的神经算子",
    "translated_abstract": "与ODE的模型涉及系统矩阵、控制器涉及向量或矩阵增益不同，PDE模型涉及函数系数和空间变量相关的增益函数。PDE反步控制器和观测器的设计是将系统模型函数映射到增益函数的非线性算子。通过学习和逼近这种设计映射的神经算子，可以消除解决PDE的需要。学习神经算子需要足够数量的设计PDE的先前解，以及操作员的训练。",
    "tldr": "本文提出了一种使用神经算子学习和逼近设计映射的方法，以消除解决PDE的需要。"
}