{
    "title": "Adversarial Robustness and Feature Impact Analysis for Driver Drowsiness Detection. (arXiv:2303.13649v1 [cs.LG])",
    "abstract": "Drowsy driving is a major cause of road accidents, but drivers are dismissive of the impact that fatigue can have on their reaction times. To detect drowsiness before any impairment occurs, a promising strategy is using Machine Learning (ML) to monitor Heart Rate Variability (HRV) signals. This work presents multiple experiments with different HRV time windows and ML models, a feature impact analysis using Shapley Additive Explanations (SHAP), and an adversarial robustness analysis to assess their reliability when processing faulty input data and perturbed HRV signals. The most reliable model was Extreme Gradient Boosting (XGB) and the optimal time window had between 120 and 150 seconds. Furthermore, SHAP enabled the selection of the 18 most impactful features and the training of new smaller models that achieved a performance as good as the initial ones. Despite the susceptibility of all models to adversarial attacks, adversarial training enabled them to preserve significantly higher r",
    "link": "http://arxiv.org/abs/2303.13649",
    "context": "Title: Adversarial Robustness and Feature Impact Analysis for Driver Drowsiness Detection. (arXiv:2303.13649v1 [cs.LG])\nAbstract: Drowsy driving is a major cause of road accidents, but drivers are dismissive of the impact that fatigue can have on their reaction times. To detect drowsiness before any impairment occurs, a promising strategy is using Machine Learning (ML) to monitor Heart Rate Variability (HRV) signals. This work presents multiple experiments with different HRV time windows and ML models, a feature impact analysis using Shapley Additive Explanations (SHAP), and an adversarial robustness analysis to assess their reliability when processing faulty input data and perturbed HRV signals. The most reliable model was Extreme Gradient Boosting (XGB) and the optimal time window had between 120 and 150 seconds. Furthermore, SHAP enabled the selection of the 18 most impactful features and the training of new smaller models that achieved a performance as good as the initial ones. Despite the susceptibility of all models to adversarial attacks, adversarial training enabled them to preserve significantly higher r",
    "path": "papers/23/03/2303.13649.json",
    "total_tokens": 1087,
    "translated_title": "驾驶员疲劳检测的对抗鲁棒性和特征影响分析",
    "translated_abstract": "疲劳驾驶是道路事故的主要原因之一，但司机们往往低估了疲劳对他们反应时间的影响。为了在发生任何障碍之前检测到疲劳，一个很有前途的策略是使用机器学习(Machine Learning, ML)来监测心率变异(Heart Rate Variability, HRV)信号。本研究提出了多个实验，采用不同的HRV时间窗口和ML模型，使用Shapley Additive Explanations (SHAP)进行特征影响分析，并进行了对抗鲁棒性分析，以评估它们在处理错误输入数据和受干扰的HRV信号时的可靠性。最可靠的模型是Extreme Gradient Boosting (XGB)，最佳时间窗口为120至150秒之间。此外，SHAP允许选择18个最具影响力的特征，并训练新的较小模型，其表现与最初的模型一样好。尽管所有模型都容易受到对抗性攻击的影响，但对抗性训练使它们能够保持更高的对抗鲁棒性。",
    "tldr": "本研究发现，对于驾驶员疲劳检测，最可靠的模型是XGB，最佳窗口时间为120至150秒之间。本研究使用SHAP方法选择了18个最具影响力的特征，并训练出新的较小模型以获得与最初模型相同的性能。尽管所有模型都容易受到对抗性攻击的影响，但对抗性训练使它们能够保持更高的对抗鲁棒性。"
}