{
    "title": "Training Feedforward Neural Networks with Bayesian Hyper-Heuristics. (arXiv:2303.16912v1 [cs.LG])",
    "abstract": "The process of training feedforward neural networks (FFNNs) can benefit from an automated process where the best heuristic to train the network is sought out automatically by means of a high-level probabilistic-based heuristic. This research introduces a novel population-based Bayesian hyper-heuristic (BHH) that is used to train feedforward neural networks (FFNNs). The performance of the BHH is compared to that of ten popular low-level heuristics, each with different search behaviours. The chosen heuristic pool consists of classic gradient-based heuristics as well as meta-heuristics (MHs). The empirical process is executed on fourteen datasets consisting of classification and regression problems with varying characteristics. The BHH is shown to be able to train FFNNs well and provide an automated method for finding the best heuristic to train the FFNNs at various stages of the training process.",
    "link": "http://arxiv.org/abs/2303.16912",
    "context": "Title: Training Feedforward Neural Networks with Bayesian Hyper-Heuristics. (arXiv:2303.16912v1 [cs.LG])\nAbstract: The process of training feedforward neural networks (FFNNs) can benefit from an automated process where the best heuristic to train the network is sought out automatically by means of a high-level probabilistic-based heuristic. This research introduces a novel population-based Bayesian hyper-heuristic (BHH) that is used to train feedforward neural networks (FFNNs). The performance of the BHH is compared to that of ten popular low-level heuristics, each with different search behaviours. The chosen heuristic pool consists of classic gradient-based heuristics as well as meta-heuristics (MHs). The empirical process is executed on fourteen datasets consisting of classification and regression problems with varying characteristics. The BHH is shown to be able to train FFNNs well and provide an automated method for finding the best heuristic to train the FFNNs at various stages of the training process.",
    "path": "papers/23/03/2303.16912.json",
    "total_tokens": 855,
    "translated_title": "使用贝叶斯超启发式算法训练前馈神经网络",
    "translated_abstract": "训练前馈神经网络(FFNNs)的过程可以从自动化过程中受益，其中最佳的启发式算法通过高级基于概率的启发式算法自动寻找来训练网络。本研究引入了一种新型Population-based Bayesian hyper-heuristic (BHH)，用于训练前馈神经网络(FFNNs)。BHH的性能与十种流行的低级启发式方法进行了比较，每种方法都具有不同的查找行为。所选的启发式池包括经典的基于梯度的启发式方法以及元启发式( MHs)。实证过程对十四个具有不同性质的分类和回归问题的数据集进行了执行。研究表明，BHH能够很好地执行FFNNs的训练，并提供了一种自动化方法来在训练过程的各个阶段中寻找最佳的启发式算法。",
    "tldr": "本研究提出了一种用于训练前馈神经网络的Population-based Bayesian hyper-heuristic算法，可以在训练过程的不同阶段自动寻找最佳的启发式算法来训练网络。"
}