{
    "title": "Ewald-based Long-Range Message Passing for Molecular Graphs. (arXiv:2303.04791v2 [cs.LG] UPDATED)",
    "abstract": "Neural architectures that learn potential energy surfaces from molecular data have undergone fast improvement in recent years. A key driver of this success is the Message Passing Neural Network (MPNN) paradigm. Its favorable scaling with system size partly relies upon a spatial distance limit on messages. While this focus on locality is a useful inductive bias, it also impedes the learning of long-range interactions such as electrostatics and van der Waals forces. To address this drawback, we propose Ewald message passing: a nonlocal Fourier space scheme which limits interactions via a cutoff on frequency instead of distance, and is theoretically well-founded in the Ewald summation method. It can serve as an augmentation on top of existing MPNN architectures as it is computationally inexpensive and agnostic to architectural details. We test the approach with four baseline models and two datasets containing diverse periodic (OC20) and aperiodic structures (OE62). We observe robust impro",
    "link": "http://arxiv.org/abs/2303.04791",
    "context": "Title: Ewald-based Long-Range Message Passing for Molecular Graphs. (arXiv:2303.04791v2 [cs.LG] UPDATED)\nAbstract: Neural architectures that learn potential energy surfaces from molecular data have undergone fast improvement in recent years. A key driver of this success is the Message Passing Neural Network (MPNN) paradigm. Its favorable scaling with system size partly relies upon a spatial distance limit on messages. While this focus on locality is a useful inductive bias, it also impedes the learning of long-range interactions such as electrostatics and van der Waals forces. To address this drawback, we propose Ewald message passing: a nonlocal Fourier space scheme which limits interactions via a cutoff on frequency instead of distance, and is theoretically well-founded in the Ewald summation method. It can serve as an augmentation on top of existing MPNN architectures as it is computationally inexpensive and agnostic to architectural details. We test the approach with four baseline models and two datasets containing diverse periodic (OC20) and aperiodic structures (OE62). We observe robust impro",
    "path": "papers/23/03/2303.04791.json",
    "total_tokens": 944,
    "translated_title": "分子图的Ewald长程消息传递",
    "translated_abstract": "近年来，从分子数据中学习势能表面的神经架构有了快速的改进，这个成功的关键在于传递神经网络范式。其中，对消息的空间距离限制是部分优化网站大小的关键驱动因素。虽然这种局部关注是一种有用的归纳偏见，但它也阻碍了对长程相互作用（如静电相互作用和范德华力）的学习。为解决这个缺点，我们提出了Ewald消息传递：一种非局部傅立叶空间方案，它通过频率截断而不是距离限制交互，并在Ewald求和方法中理论上确定。它可以作为现有MPNN架构的增强，因为它计算廉价且不关注架构细节。我们用四个基线模型和两个包含不同周期（OC20）和非周期结构（OE62）的数据集测试了这种方法。我们观察到Ewald消息传递在两个数据集上都比基线模型有更强的预测精度和泛化性能。",
    "tldr": "提出了一种Ewald消息传递的非局部傅立叶空间方案来解决消息传递神经网络范式中长程相互作用难以学习的问题，在多个数据集中表现出更强的预测精度和泛化性能。",
    "en_tdlr": "A non-local Fourier space scheme for Ewald message passing is proposed to address the difficulty in learning long-range interactions in Message Passing Neural Network paradigm. It shows better prediction accuracy and generalization performance on multiple datasets."
}