{
    "title": "Improving Deep Dynamics Models for Autonomous Vehicles with Multimodal Latent Mapping of Surfaces. (arXiv:2303.11756v1 [cs.RO])",
    "abstract": "The safe deployment of autonomous vehicles relies on their ability to effectively react to environmental changes. This can require maneuvering on varying surfaces which is still a difficult problem, especially for slippery terrains. To address this issue we propose a new approach that learns a surface-aware dynamics model by conditioning it on a latent variable vector storing surface information about the current location. A latent mapper is trained to update these latent variables during inference from multiple modalities on every traversal of the corresponding locations and stores them in a map. By training everything end-to-end with the loss of the dynamics model, we enforce the latent mapper to learn an update rule for the latent map that is useful for the subsequent dynamics model. We implement and evaluate our approach on a real miniature electric car. The results show that the latent map is updated to allow more accurate predictions of the dynamics model compared to a model with",
    "link": "http://arxiv.org/abs/2303.11756",
    "context": "Title: Improving Deep Dynamics Models for Autonomous Vehicles with Multimodal Latent Mapping of Surfaces. (arXiv:2303.11756v1 [cs.RO])\nAbstract: The safe deployment of autonomous vehicles relies on their ability to effectively react to environmental changes. This can require maneuvering on varying surfaces which is still a difficult problem, especially for slippery terrains. To address this issue we propose a new approach that learns a surface-aware dynamics model by conditioning it on a latent variable vector storing surface information about the current location. A latent mapper is trained to update these latent variables during inference from multiple modalities on every traversal of the corresponding locations and stores them in a map. By training everything end-to-end with the loss of the dynamics model, we enforce the latent mapper to learn an update rule for the latent map that is useful for the subsequent dynamics model. We implement and evaluate our approach on a real miniature electric car. The results show that the latent map is updated to allow more accurate predictions of the dynamics model compared to a model with",
    "path": "papers/23/03/2303.11756.json",
    "total_tokens": 932,
    "translated_title": "利用多模态潜在映射表面来改进自动驾驶车辆的深度动力学模型",
    "translated_abstract": "自主驾驶汽车的安全部署依赖于它们有效反应环境变化的能力。这可能需要在不同表面上操纵，这仍然是一个难题，特别是对于滑动地形。为了解决这个问题，我们提出了一种新的方法，通过将当前位置的表面信息存储在潜在变量向量中来条件化学习表面感知的动力学模型。通过在推理中从对应位置的多个模态获取信息，并将信息存储到地图中，训练潜在映射器来更新这些潜在变量。通过将一切都与动力学模型的损失进行端对端的训练，我们强制潜在映射器学习潜在地图的更新规则，使其对随后的动力学模型有用。我们在真实的迷你电动汽车上实现和评估了我们的方法。结果表明，相比没有表面信息的模型，潜在地图的更新可以使动力学模型的预测更加准确。",
    "tldr": "该论文提出了一种新的方法来改进自动驾驶汽车的深度动力学模型，通过从多个感知模态中获取信息并将其存储在地图中的方式来更新潜在地图，从而实现对表面信息的感知和识别，在不同表面上的精准操纵得到保障。"
}