{
    "title": "Pareto Optimization of a Laser Wakefield Accelerator. (arXiv:2303.15825v1 [physics.acc-ph])",
    "abstract": "Optimization of accelerator performance parameters is limited by numerous trade-offs and finding the appropriate balance between optimization goals for an unknown system is challenging to achieve. Here we show that multi-objective Bayesian optimization can map the solution space of a laser wakefield accelerator in a very sample-efficient way. Using a Gaussian mixture model, we isolate contributions related to an electron bunch at a certain energy and we observe that there exists a wide range of Pareto-optimal solutions that trade beam energy versus charge at similar laser-to-beam efficiency. However, many applications such as light sources require particle beams at a certain target energy. Once such a constraint is introduced we observe a direct trade-off between energy spread and accelerator efficiency. We furthermore demonstrate how specific solutions can be exploited using \\emph{a posteriori} scalarization of the objectives, thereby efficiently splitting the exploration and exploita",
    "link": "http://arxiv.org/abs/2303.15825",
    "context": "Title: Pareto Optimization of a Laser Wakefield Accelerator. (arXiv:2303.15825v1 [physics.acc-ph])\nAbstract: Optimization of accelerator performance parameters is limited by numerous trade-offs and finding the appropriate balance between optimization goals for an unknown system is challenging to achieve. Here we show that multi-objective Bayesian optimization can map the solution space of a laser wakefield accelerator in a very sample-efficient way. Using a Gaussian mixture model, we isolate contributions related to an electron bunch at a certain energy and we observe that there exists a wide range of Pareto-optimal solutions that trade beam energy versus charge at similar laser-to-beam efficiency. However, many applications such as light sources require particle beams at a certain target energy. Once such a constraint is introduced we observe a direct trade-off between energy spread and accelerator efficiency. We furthermore demonstrate how specific solutions can be exploited using \\emph{a posteriori} scalarization of the objectives, thereby efficiently splitting the exploration and exploita",
    "path": "papers/23/03/2303.15825.json",
    "total_tokens": 948,
    "translated_title": "一种激光等离子体加速器的Pareto优化方案",
    "translated_abstract": "加速器性能参数的优化受到众多权衡的限制，因此找到未知系统优化目标之间的适当平衡具有挑战性。本文展示了多目标贝叶斯优化方法能够以非常高效的方式映射激光等离子体加速器解空间。利用高斯混合模型，我们分离了与某个能量的电子束相关的贡献，并观察到存在广泛的Pareto最优解范围，其在类似激光束效率的同时平衡了束能与电荷。然而，许多应用（如光源）需要特定目标能量的粒子束。一旦引入这样的约束，我们观察到能量展宽与加速器效率之间存在直接的权衡。此外，我们还展示了如何使用\\emph{a posteriori}标量化的目标有效地分解探查与利用具体解决方案。",
    "tldr": "本文展示了一种多目标优化方法可以映射激光等离子体加速器的解空间，并找到了一些在类似激光束效率的同时平衡束能与电荷的Pareto最优解，但当应用需要特定目标能量的粒子束时需要权衡能量展宽与加速器效率。",
    "en_tdlr": "This paper presents a multi-objective optimization method for mapping the solution space of a laser wakefield accelerator and finds a range of Pareto-optimal solutions that balance beam energy versus charge at similar laser-to-beam efficiency. However, it also shows a direct trade-off between energy spread and accelerator efficiency when targeting a specific energy for the particle beams, which is relevant for applications such as light sources. The paper also demonstrates a method for efficiently exploiting specific solutions using a posteriori scalarization of objectives."
}