{
    "title": "Deep symbolic regression for physics guided by units constraints: toward the automated discovery of physical laws. (arXiv:2303.03192v2 [astro-ph.IM] UPDATED)",
    "abstract": "Symbolic Regression is the study of algorithms that automate the search for analytic expressions that fit data. While recent advances in deep learning have generated renewed interest in such approaches, the development of symbolic regression methods has not been focused on physics, where we have important additional constraints due to the units associated with our data. Here we present $\\Phi$-SO, a Physical Symbolic Optimization framework for recovering analytical symbolic expressions from physics data using deep reinforcement learning techniques by learning units constraints. Our system is built, from the ground up, to propose solutions where the physical units are consistent by construction. This is useful not only in eliminating physically impossible solutions, but because the \"grammatical\" rules of dimensional analysis restrict enormously the freedom of the equation generator, thus vastly improving performance. The algorithm can be used to fit noiseless data, which can be useful fo",
    "link": "http://arxiv.org/abs/2303.03192",
    "context": "Title: Deep symbolic regression for physics guided by units constraints: toward the automated discovery of physical laws. (arXiv:2303.03192v2 [astro-ph.IM] UPDATED)\nAbstract: Symbolic Regression is the study of algorithms that automate the search for analytic expressions that fit data. While recent advances in deep learning have generated renewed interest in such approaches, the development of symbolic regression methods has not been focused on physics, where we have important additional constraints due to the units associated with our data. Here we present $\\Phi$-SO, a Physical Symbolic Optimization framework for recovering analytical symbolic expressions from physics data using deep reinforcement learning techniques by learning units constraints. Our system is built, from the ground up, to propose solutions where the physical units are consistent by construction. This is useful not only in eliminating physically impossible solutions, but because the \"grammatical\" rules of dimensional analysis restrict enormously the freedom of the equation generator, thus vastly improving performance. The algorithm can be used to fit noiseless data, which can be useful fo",
    "path": "papers/23/03/2303.03192.json",
    "total_tokens": 896,
    "translated_title": "基于单位约束的深度符号回归：自动发现物理定律的探索",
    "translated_abstract": "符号回归是研究自动搜索与数据拟合的解析表达式的算法。近年来，深度学习的最新进展引起了对这种方法的新兴兴趣，但是符号回归方法的发展并没有专注于物理学，而物理学有重要的单位约束。在这里，我们提出了$\\Phi$-SO，一种基于物理学数据使用深度强化学习技术学习单位约束来恢复解析符号表达式的物理符号优化框架。我们的系统从底层开始构建，通过设计使物理单位在构造过程中保持一致来提出解决方案。这不仅有助于消除物理上不可能的解决方案，也因为维度分析的“语法”规则极大地限制了方程生成器的自由度，从而大大提高了性能。该算法可以用于拟合无噪声数据，这对于理解物理过程具有重要意义。",
    "tldr": "通过学习单位约束，我们提出了一种基于深度强化学习的物理符号优化框架，用于从物理数据中恢复解析符号表达式。这种方法不仅可以消除物理上不可能的解决方案，还通过维度分析的规则提高了性能。",
    "en_tdlr": "We present a Physical Symbolic Optimization framework using deep reinforcement learning to recover analytic symbolic expressions from physics data by learning unit constraints. This method not only eliminates physically impossible solutions but also improves performance by utilizing the rules of dimensional analysis."
}