{
    "title": "Unfinished Architectures: A Perspective from Artificial Intelligence. (arXiv:2303.12732v1 [cs.CV])",
    "abstract": "Unfinished buildings are a constant throughout the history of architecture and have given rise to intense debates on the opportuneness of their completion, in addition to offering alibis for theorizing about the compositional possibilities in coherence with the finished parts. The development of Artificial Intelligence (AI) opens new avenues for the proposal of possibilities for the completion of unfinished architectures. Specifically, with the recent appearance of tools such as DALL-E, capable of completing images guided by a textual description, it is possible to count on the help of AI for architectural design tasks. In this article we explore the use of these new AI tools for the completion of unfinished facades of historical temples and analyse the still germinal stadium in the field of architectural graphic composition.",
    "link": "http://arxiv.org/abs/2303.12732",
    "context": "Title: Unfinished Architectures: A Perspective from Artificial Intelligence. (arXiv:2303.12732v1 [cs.CV])\nAbstract: Unfinished buildings are a constant throughout the history of architecture and have given rise to intense debates on the opportuneness of their completion, in addition to offering alibis for theorizing about the compositional possibilities in coherence with the finished parts. The development of Artificial Intelligence (AI) opens new avenues for the proposal of possibilities for the completion of unfinished architectures. Specifically, with the recent appearance of tools such as DALL-E, capable of completing images guided by a textual description, it is possible to count on the help of AI for architectural design tasks. In this article we explore the use of these new AI tools for the completion of unfinished facades of historical temples and analyse the still germinal stadium in the field of architectural graphic composition.",
    "path": "papers/23/03/2303.12732.json",
    "total_tokens": 758,
    "translated_title": "未完成的建筑：从人工智能的视角出发",
    "translated_abstract": "未完工建筑在建筑历史上一直存在，并引发了关于是否完工的激烈辩论，为与已完成部分相协调的构思提供理论依据。人工智能的发展为未完成建筑的完成提出了新的可能性，尤其是随着DALL-E等工具的出现，这些工具可以根据文本描述完成图像，对于建筑设计任务来说，AI的帮助成为了可能。本文探讨了这些新的AI工具在历史寺庙未完成正面的完成中的应用，分析了建筑图形组成领域中的仍处于萌芽状态的足球场。",
    "tldr": "本文探讨了如何运用AI工具，如DALL-E，来完成未完成的历史建筑，特别是未完成的寺庙正面，并分析了该领域仍处于萌芽状态的建筑图形组成，为建筑设计任务提供可能性。",
    "en_tdlr": "This paper explores the use of AI tools, such as DALL-E, to complete unfinished historical buildings, particularly the unfinished facades of temples, and analyzes the still emerging field of architectural graphic composition, providing possibilities for architectural design tasks."
}