{
    "title": "Physics Informed Neural Networks for Phase Locked Loop Transient Stability Assessment. (arXiv:2303.12116v1 [eess.SY])",
    "abstract": "A significant increase in renewable energy production is necessary to achieve the UN's net-zero emission targets for 2050. Using power-electronic controllers, such as Phase Locked Loops (PLLs), to keep grid-tied renewable resources in synchronism with the grid can cause fast transient behavior during grid faults leading to instability. However, assessing all the probable scenarios is impractical, so determining the stability boundary or region of attraction (ROA) is necessary. However, using EMT simulations or Reduced-order models (ROMs) to accurately determine the ROA is computationally expensive. Alternatively, Machine Learning (ML) models have been proposed as an efficient method to predict stability. However, traditional ML algorithms require large amounts of labeled data for training, which is computationally expensive. This paper proposes a Physics-Informed Neural Network (PINN) architecture that accurately predicts the nonlinear transient dynamics of a PLL controller under fault",
    "link": "http://arxiv.org/abs/2303.12116",
    "context": "Title: Physics Informed Neural Networks for Phase Locked Loop Transient Stability Assessment. (arXiv:2303.12116v1 [eess.SY])\nAbstract: A significant increase in renewable energy production is necessary to achieve the UN's net-zero emission targets for 2050. Using power-electronic controllers, such as Phase Locked Loops (PLLs), to keep grid-tied renewable resources in synchronism with the grid can cause fast transient behavior during grid faults leading to instability. However, assessing all the probable scenarios is impractical, so determining the stability boundary or region of attraction (ROA) is necessary. However, using EMT simulations or Reduced-order models (ROMs) to accurately determine the ROA is computationally expensive. Alternatively, Machine Learning (ML) models have been proposed as an efficient method to predict stability. However, traditional ML algorithms require large amounts of labeled data for training, which is computationally expensive. This paper proposes a Physics-Informed Neural Network (PINN) architecture that accurately predicts the nonlinear transient dynamics of a PLL controller under fault",
    "path": "papers/23/03/2303.12116.json",
    "total_tokens": 984,
    "translated_title": "物理知识网络用于锁相环瞬态稳定性评估",
    "translated_abstract": "实现联合国2050年零净排放目标需要大量的可再生能源，利用电力电子控制器，例如锁相环（PLL），来保持并网的可再生资源与网络同步可能导致在网络故障期间快速瞬态行为，进而导致不稳定。然而，评估所有可能的场景是不切实际的，因此有必要确定稳定的边界或吸引区域（ROA）。然而，使用EMT仿真或简化模型（ROM）来准确确定ROA是计算昂贵的。相反，机器学习（ML）模型已被提出作为一种有效的方法来预测稳定性。然而，传统的ML算法需要大量标记数据进行训练，这是计算昂贵的。本文提出了一种物理知识神经网络（PINN）架构，利用有限的标记数据准确预测PLL控制器在故障情况下的非线性瞬态动力学。所提出的模型结合了EMT仿真的精度和ML模型的计算效率，以准确确定PLL控制器的ROA。",
    "tldr": "本文提出了一种物理知识神经网络（PINN）架构，结合了EMT仿真的精度和ML模型的计算效率，用于准确预测PLL控制器在故障情况下的非线性瞬态动力学并确定其稳定边界。",
    "en_tdlr": "This paper proposes a Physics-Informed Neural Network (PINN) architecture that combines the accuracy of EMT simulations with the computational efficiency of ML models to accurately predict the nonlinear transient dynamics of a PLL controller under fault conditions and determine its stability boundary."
}