{
    "title": "Predicting Individualized Effects of Internet-Based Treatment for Genito-Pelvic Pain/Penetration Disorder: Development and Internal Validation of a Multivariable Decision Tree Model. (arXiv:2303.08732v1 [stat.AP])",
    "abstract": "Genito-Pelvic Pain/Penetration-Disorder (GPPPD) is a common disorder but rarely treated in routine care. Previous research documents that GPPPD symptoms can be treated effectively using internet-based psychological interventions. However, non-response remains common for all state-of-the-art treatments and it is unclear which patient groups are expected to benefit most from an internet-based intervention. Multivariable prediction models are increasingly used to identify predictors of heterogeneous treatment effects, and to allocate treatments with the greatest expected benefits. In this study, we developed and internally validated a multivariable decision tree model that predicts effects of an internet-based treatment on a multidimensional composite score of GPPPD symptoms. Data of a randomized controlled trial comparing the internet-based intervention to a waitlist control group (N =200) was used to develop a decision tree model using model-based recursive partitioning. Model performan",
    "link": "http://arxiv.org/abs/2303.08732",
    "context": "Title: Predicting Individualized Effects of Internet-Based Treatment for Genito-Pelvic Pain/Penetration Disorder: Development and Internal Validation of a Multivariable Decision Tree Model. (arXiv:2303.08732v1 [stat.AP])\nAbstract: Genito-Pelvic Pain/Penetration-Disorder (GPPPD) is a common disorder but rarely treated in routine care. Previous research documents that GPPPD symptoms can be treated effectively using internet-based psychological interventions. However, non-response remains common for all state-of-the-art treatments and it is unclear which patient groups are expected to benefit most from an internet-based intervention. Multivariable prediction models are increasingly used to identify predictors of heterogeneous treatment effects, and to allocate treatments with the greatest expected benefits. In this study, we developed and internally validated a multivariable decision tree model that predicts effects of an internet-based treatment on a multidimensional composite score of GPPPD symptoms. Data of a randomized controlled trial comparing the internet-based intervention to a waitlist control group (N =200) was used to develop a decision tree model using model-based recursive partitioning. Model performan",
    "path": "papers/23/03/2303.08732.json",
    "total_tokens": 1025,
    "translated_title": "针对盆腔疼痛/穿透障碍的基于互联网治疗的个体化预测：多变量决策树模型的开发和内部验证（arXiv：2303.08732v1 [stat.AP]）",
    "translated_abstract": "盆腔疼痛/穿透-障碍（GPPPD）是一种常见的障碍，但在日常护理中很少得到治疗。先前的研究表明，可以使用基于互联网的心理干预有效地治疗GPPPD症状。然而，所有最先进的治疗方法仍然普遍存在未响应的情况，目前尚不清楚哪些患者群体最有望从基于互联网的干预中受益。多变量预测模型越来越多地用于确定异质性治疗效应的预测因子，并分配具有最大预期效益的治疗。在本研究中，我们开发了并内部验证了一种多变量决策树模型，该模型预测基于互联网的治疗对GPPPD症状的多维综合评分的效果。使用一项将基于互联网的干预与等待名单对照组进行比较的随机对照试验的数据（N = 200），利用基于模型的递归分区开发了一种决策树模型。",
    "tldr": "研究开发了一种多变量决策树模型，该模型可预测基于互联网的治疗对盆腔疼痛/穿透障碍患者的症状的多维综合评分的效果。",
    "en_tdlr": "A multivariate decision tree model was developed to predict the effects of internet-based treatment on a multidimensional composite score of genito-pelvic pain/penetration disorder symptoms, providing personalized treatment predictions for improved outcomes."
}