{
    "title": "Linking Alternative Fuel Vehicles Adoption with Socioeconomic Status and Air Quality Index. (arXiv:2303.08286v1 [cs.AI])",
    "abstract": "This is a study on the potential widespread usage of alternative fuel vehicles, linking them with the socio-economic status of the respective consumers as well as the impact on the resulting air quality index. Research in this area aims to leverage machine learning techniques in order to promote appropriate policies for the proliferation of alternative fuel vehicles such as electric vehicles with due justice to different population groups. Pearson correlation coefficient is deployed in the modeling the relationships between socio-economic data, air quality index and data on alternative fuel vehicles. Linear regression is used to conduct predictive modeling on air quality index as per the adoption of alternative fuel vehicles, based on socio-economic factors. This work exemplifies artificial intelligence for social good.",
    "link": "http://arxiv.org/abs/2303.08286",
    "context": "Title: Linking Alternative Fuel Vehicles Adoption with Socioeconomic Status and Air Quality Index. (arXiv:2303.08286v1 [cs.AI])\nAbstract: This is a study on the potential widespread usage of alternative fuel vehicles, linking them with the socio-economic status of the respective consumers as well as the impact on the resulting air quality index. Research in this area aims to leverage machine learning techniques in order to promote appropriate policies for the proliferation of alternative fuel vehicles such as electric vehicles with due justice to different population groups. Pearson correlation coefficient is deployed in the modeling the relationships between socio-economic data, air quality index and data on alternative fuel vehicles. Linear regression is used to conduct predictive modeling on air quality index as per the adoption of alternative fuel vehicles, based on socio-economic factors. This work exemplifies artificial intelligence for social good.",
    "path": "papers/23/03/2303.08286.json",
    "total_tokens": 818,
    "translated_title": "将替代燃料汽车的采用与社会经济地位和空气质量指数联系起来",
    "translated_abstract": "这是一项研究，研究替代燃料汽车的潜在广泛使用，将它们与相应消费者的社会经济地位以及对 resulting 空气质量指数的影响联系起来。该领域的研究旨在利用机器学习技术，以促进适当的政策，推广替代燃料汽车的普及，例如电动汽车，要公正对待不同的人群。该模型使用 Pearson 相关系数对社会经济数据、空气质量指数和替代燃料汽车的数据关系进行建模。基于社会经济因素，使用线性回归对空气质量指数进行预测建模，以根据替代燃料汽车的采用情况进行调整。这项工作证明了人工智能的社会价值。",
    "tldr": "该研究借助机器学习技术，探究替代燃料汽车的普及，同时将其与消费者的社会经济地位和空气质量指数进行关联，从而制定合适的政策。",
    "en_tdlr": "This study leverages machine learning techniques to investigate the proliferation of alternative fuel vehicles while linking them with the socio-economic status of the consumers and the resulting air quality index, in order to formulate appropriate policies."
}