{
    "title": "Transfer Learning for Real-time Deployment of a Screening Tool for Depression Detection Using Actigraphy. (arXiv:2303.07847v1 [cs.LG])",
    "abstract": "Automated depression screening and diagnosis is a highly relevant problem today. There are a number of limitations of the traditional depression detection methods, namely, high dependence on clinicians and biased self-reporting. In recent years, research has suggested strong potential in machine learning (ML) based methods that make use of the user's passive data collected via wearable devices. However, ML is data hungry. Especially in the healthcare domain primary data collection is challenging. In this work, we present an approach based on transfer learning, from a model trained on a secondary dataset, for the real time deployment of the depression screening tool based on the actigraphy data of users. This approach enables machine learning modelling even with limited primary data samples. A modified version of leave one out cross validation approach performed on the primary set resulted in mean accuracy of 0.96, where in each iteration one subject's data from the primary set was set ",
    "link": "http://arxiv.org/abs/2303.07847",
    "context": "Title: Transfer Learning for Real-time Deployment of a Screening Tool for Depression Detection Using Actigraphy. (arXiv:2303.07847v1 [cs.LG])\nAbstract: Automated depression screening and diagnosis is a highly relevant problem today. There are a number of limitations of the traditional depression detection methods, namely, high dependence on clinicians and biased self-reporting. In recent years, research has suggested strong potential in machine learning (ML) based methods that make use of the user's passive data collected via wearable devices. However, ML is data hungry. Especially in the healthcare domain primary data collection is challenging. In this work, we present an approach based on transfer learning, from a model trained on a secondary dataset, for the real time deployment of the depression screening tool based on the actigraphy data of users. This approach enables machine learning modelling even with limited primary data samples. A modified version of leave one out cross validation approach performed on the primary set resulted in mean accuracy of 0.96, where in each iteration one subject's data from the primary set was set ",
    "path": "papers/23/03/2303.07847.json",
    "total_tokens": 957,
    "translated_title": "实时部署抑郁症筛查工具的迁移学习方法使用加速计数据(arXiv：2303.07847v1 [cs.LG])",
    "translated_abstract": "自动化抑郁症筛查和诊断是今天非常相关的问题。传统的抑郁症检测方法存在许多局限性，主要是高度依赖临床医生和有偏差的自我报告。近年来，研究表明利用穿戴设备收集用户的被动数据的基于机器学习（ML）的方法具有强大的潜力。然而，机器学习需要大量的数据，特别是在医疗领域，收集原始数据是具有挑战性的。在这项工作中，我们提出了一种基于迁移学习的方法，从在次要数据集上训练的模型开始，实时部署基于用户的行为数据的抑郁症筛查工具。这种方法可以在有限的原始数据样本下建立机器学习模型。在主数据集上执行的留一法交叉验证方法的修改版本导致平均准确率为0.96，其中在每次迭代中从主数据集中设置一个受试者的数据。",
    "tldr": "研究提出了一种迁移学习方法，使用次要数据集的模型进行训练，并在实时部署基于加速计数据的抑郁症筛查工具时使用。这种方法可以在有限的原始数据样本下建立机器学习模型，具有较高的准确率。",
    "en_tdlr": "The study proposes a transfer learning method that uses a model trained on a secondary dataset and is used for real-time deployment of a depression screening tool based on accelerometer data. This approach enables machine learning modelling even with limited primary data samples and has a high degree of accuracy."
}