{
    "title": "Efficient Bayesian Physics Informed Neural Networks for Inverse Problems via Ensemble Kalman Inversion. (arXiv:2303.07392v1 [stat.ML])",
    "abstract": "Bayesian Physics Informed Neural Networks (B-PINNs) have gained significant attention for inferring physical parameters and learning the forward solutions for problems based on partial differential equations. However, the overparameterized nature of neural networks poses a computational challenge for high-dimensional posterior inference. Existing inference approaches, such as particle-based or variance inference methods, are either computationally expensive for high-dimensional posterior inference or provide unsatisfactory uncertainty estimates. In this paper, we present a new efficient inference algorithm for B-PINNs that uses Ensemble Kalman Inversion (EKI) for high-dimensional inference tasks. We find that our proposed method can achieve inference results with informative uncertainty estimates comparable to Hamiltonian Monte Carlo (HMC)-based B-PINNs with a much reduced computational cost. These findings suggest that our proposed approach has great potential for uncertainty quantifi",
    "link": "http://arxiv.org/abs/2303.07392",
    "context": "Title: Efficient Bayesian Physics Informed Neural Networks for Inverse Problems via Ensemble Kalman Inversion. (arXiv:2303.07392v1 [stat.ML])\nAbstract: Bayesian Physics Informed Neural Networks (B-PINNs) have gained significant attention for inferring physical parameters and learning the forward solutions for problems based on partial differential equations. However, the overparameterized nature of neural networks poses a computational challenge for high-dimensional posterior inference. Existing inference approaches, such as particle-based or variance inference methods, are either computationally expensive for high-dimensional posterior inference or provide unsatisfactory uncertainty estimates. In this paper, we present a new efficient inference algorithm for B-PINNs that uses Ensemble Kalman Inversion (EKI) for high-dimensional inference tasks. We find that our proposed method can achieve inference results with informative uncertainty estimates comparable to Hamiltonian Monte Carlo (HMC)-based B-PINNs with a much reduced computational cost. These findings suggest that our proposed approach has great potential for uncertainty quantifi",
    "path": "papers/23/03/2303.07392.json",
    "total_tokens": 901,
    "translated_title": "使用集合卡尔曼反演的高效贝叶斯物理感知神经网络求解反问题",
    "translated_abstract": "贝叶斯物理感知神经网络已经在基于偏微分方程的问题中得到了广泛的应用，用于推断物理参数和学习正向解。然而，神经网络的过度参数化为高维后验推断带来了计算挑战。现有的推断方法，例如基于粒子或方差的推断方法，要么在高维后验推断时计算昂贵，要么提供不令人满意的不确定性估计。在本文中，我们提出了一种新的B-PINNs推断算法，利用集合卡尔曼反演(EKI)处理高维推断任务。我们发现，我们提出的方法可以在大大降低计算成本的情况下，实现具有信息量的不确定性估计，与基于哈密顿蒙特卡罗（HMC）的B-PINNs方法相当。这些发现表明，我们提出的方法在许多反问题的不确定性量化方面具有巨大的潜力。",
    "tldr": "本文提出了一种使用集合卡尔曼反演实现高效贝叶斯物理感知神经网络求解反问题的新推断算法，并且在提高计算效率的同时，实现了数据具有信息量的不确定性估计。",
    "en_tdlr": "This paper proposes a new efficient inference algorithm for Bayesian Physics Informed Neural Networks (B-PINNs) using Ensemble Kalman Inversion (EKI) for high-dimensional inference tasks in inverse problems, which achieves informative uncertainty estimates with reduced computational cost compared to existing inference methods."
}