{
    "title": "Simfluence: Modeling the Influence of Individual Training Examples by Simulating Training Runs. (arXiv:2303.08114v1 [cs.LG])",
    "abstract": "Training data attribution (TDA) methods offer to trace a model's prediction on any given example back to specific influential training examples. Existing approaches do so by assigning a scalar influence score to each training example, under a simplifying assumption that influence is additive. But in reality, we observe that training examples interact in highly non-additive ways due to factors such as inter-example redundancy, training order, and curriculum learning effects.  To study such interactions, we propose Simfluence, a new paradigm for TDA where the goal is not to produce a single influence score per example, but instead a training run simulator: the user asks, ``If my model had trained on example $z_1$, then $z_2$, ..., then $z_n$, how would it behave on $z_{test}$?''; the simulator should then output a simulated training run, which is a time series predicting the loss on $z_{test}$ at every step of the simulated run. This enables users to answer counterfactual questions about",
    "link": "http://arxiv.org/abs/2303.08114",
    "context": "Title: Simfluence: Modeling the Influence of Individual Training Examples by Simulating Training Runs. (arXiv:2303.08114v1 [cs.LG])\nAbstract: Training data attribution (TDA) methods offer to trace a model's prediction on any given example back to specific influential training examples. Existing approaches do so by assigning a scalar influence score to each training example, under a simplifying assumption that influence is additive. But in reality, we observe that training examples interact in highly non-additive ways due to factors such as inter-example redundancy, training order, and curriculum learning effects.  To study such interactions, we propose Simfluence, a new paradigm for TDA where the goal is not to produce a single influence score per example, but instead a training run simulator: the user asks, ``If my model had trained on example $z_1$, then $z_2$, ..., then $z_n$, how would it behave on $z_{test}$?''; the simulator should then output a simulated training run, which is a time series predicting the loss on $z_{test}$ at every step of the simulated run. This enables users to answer counterfactual questions about",
    "path": "papers/23/03/2303.08114.json",
    "total_tokens": 967,
    "translated_title": "Simfluence：通过模拟训练过程建模单个训练样例的影响",
    "translated_abstract": "训练数据归因（TDA）方法可以追溯模型在任何给定示例上的预测结果到特定的有影响力的训练示例。现有方法通过为每个训练示例分配一个标量影响分数来实现，假设影响是可加的。但实际上，我们观察到由于诸如示例之间的冗余、训练顺序和课程学习效应等因素，训练示例以高度非可加的方式相互作用。为了研究这种交互作用，我们提出了Simfluence，这是一种新的TDA范式，目标不是为每个示例生成单个的影响分数，而是一个训练过程模拟器：用户可以询问“如果我的模型训练了示例 z1、z2、……、zn，它在示例ztest上的表现会如何？”；然后模拟器应该输出一个模拟的训练过程，它是一个时间序列，在模拟的每个步骤都预测了在ztest上的损失。这使用户能够回答反事实问题。",
    "tldr": "本文提出了一种新的训练数据归因方法Simfluence，通过建立一个训练过程模拟器，可以追溯模型在任何给定样例上的预测结果到特定的有影响力的训练样例，从而研究训练样例间交互作用。",
    "en_tdlr": "This paper proposes a new training data attribution method called Simfluence, which establishes a simulated training run to trace a model's prediction on any given example back to specific influential training examples and study the interactions between training examples."
}