{
    "title": "A Commons-Compatible Implementation of the Sharing Economy: Blockchain-Based Open Source Mediation. (arXiv:2303.07786v1 [econ.GN])",
    "abstract": "The network economical sharing economy, with direct exchange as a core characteristic, is implemented both, on a commons and platform economical basis. This is due to a gain in importance of trust, collaborative consumption and democratic management as well as technological progress, in the form of near zero marginal costs, open source contributions and digital transformation. Concurrent to these commons-based drivers, the grey area between commerce and private exchange is used to exploit work, safety and tax regulations by central platform economists. Instead of central intermediators, the blockchain technology makes decentralized consensus finding, using Proof-of-Work (PoW) within a self-sustaining Peer-to-Peer network, possible. Therefore, a blockchain-based open source mediation seems to offer a commons-compatible implementation of the sharing economy. This thesis is investigated through a qualitative case study of Sardex and Interlace with their blockchain application, based on ex",
    "link": "http://arxiv.org/abs/2303.07786",
    "context": "Title: A Commons-Compatible Implementation of the Sharing Economy: Blockchain-Based Open Source Mediation. (arXiv:2303.07786v1 [econ.GN])\nAbstract: The network economical sharing economy, with direct exchange as a core characteristic, is implemented both, on a commons and platform economical basis. This is due to a gain in importance of trust, collaborative consumption and democratic management as well as technological progress, in the form of near zero marginal costs, open source contributions and digital transformation. Concurrent to these commons-based drivers, the grey area between commerce and private exchange is used to exploit work, safety and tax regulations by central platform economists. Instead of central intermediators, the blockchain technology makes decentralized consensus finding, using Proof-of-Work (PoW) within a self-sustaining Peer-to-Peer network, possible. Therefore, a blockchain-based open source mediation seems to offer a commons-compatible implementation of the sharing economy. This thesis is investigated through a qualitative case study of Sardex and Interlace with their blockchain application, based on ex",
    "path": "papers/23/03/2303.07786.json",
    "total_tokens": 794,
    "translated_title": "区块链技术基于开源调解的共享经济平台实现",
    "translated_abstract": "直接交换作为核心特征的经济共享经济在 commons 和平台经济学基础上实施。这是由于信任、协作消费和民主管理的重要性增加，以及技术进步在近零边际成本、开放源代码贡献和数字化转型方面的进展。除了这些基于 commons 的驱动因素之外，商业和私人交流之间的灰色地带被用来通过中心平台经济学家利用工作、安全和税收规定。区块链技术使得在自我维持的点对点网络中使用 PoW 实现分散的共识达成成为可能，而不是中心中介者。因此，基于区块链的开源调解似乎提供了一个共享经济的共同实现。本文通过对基于区块链的 Sardex 和 Interlace 的案例研究，对其区块链应用进行了定性分析。",
    "tldr": "区块链技术和开源调解提供了一个共享经济的 commons-compatible 实现。",
    "en_tdlr": "The combination of blockchain technology and open source mediation offers a commons-compatible implementation of the sharing economy."
}