{
    "title": "Boosting Semi-Supervised Few-Shot Object Detection with SoftER Teacher. (arXiv:2303.05739v2 [cs.CV] UPDATED)",
    "abstract": "Few-shot object detection (FSOD) is an emerging problem aimed at detecting novel concepts from few exemplars. Existing approaches to FSOD assume abundant base labels to adapt to novel objects. This paper studies the task of semi-supervised FSOD by considering a realistic scenario in which both base and novel labels are simultaneously scarce. We explore the utility of unlabeled data and discover its remarkable ability to boost semi-supervised FSOD by way of region proposals. Motivated by this finding, we introduce SoftER Teacher, a robust detector combining pseudo-labeling with representation learning on region proposals, to harness unlabeled data for improved FSOD without relying on abundant labels. Extensive experiments show that SoftER Teacher surpasses the novel performance of a strong supervised detector using only 10% of required base labels, without experiencing catastrophic forgetting observed in prior approaches. Our work also sheds light on a potential relationship between sem",
    "link": "http://arxiv.org/abs/2303.05739",
    "context": "Title: Boosting Semi-Supervised Few-Shot Object Detection with SoftER Teacher. (arXiv:2303.05739v2 [cs.CV] UPDATED)\nAbstract: Few-shot object detection (FSOD) is an emerging problem aimed at detecting novel concepts from few exemplars. Existing approaches to FSOD assume abundant base labels to adapt to novel objects. This paper studies the task of semi-supervised FSOD by considering a realistic scenario in which both base and novel labels are simultaneously scarce. We explore the utility of unlabeled data and discover its remarkable ability to boost semi-supervised FSOD by way of region proposals. Motivated by this finding, we introduce SoftER Teacher, a robust detector combining pseudo-labeling with representation learning on region proposals, to harness unlabeled data for improved FSOD without relying on abundant labels. Extensive experiments show that SoftER Teacher surpasses the novel performance of a strong supervised detector using only 10% of required base labels, without experiencing catastrophic forgetting observed in prior approaches. Our work also sheds light on a potential relationship between sem",
    "path": "papers/23/03/2303.05739.json",
    "total_tokens": 999,
    "translated_title": "使用SoftER Teacher增强半监督Few-Shot目标检测",
    "translated_abstract": "Few-shot目标检测（FSOD）是一个新兴的问题，旨在从少量样本中检测新概念。现有的FSOD方法假定有丰富的基础标签来适应新对象。本文研究了半监督FSOD任务，考虑到基础和新标签同时很少的现实情况。我们探索了未标记数据的实用性，并发现其通过区域提议的方式提高了半监督FSOD的显着能力。受此发现的启发，我们引入了SoftER Teacher，一种结合区域提议上的伪标记和表示学习的强大检测器，以利用未标记数据改进FSOD，而无需依赖丰富的标签。广泛的实验表明，SoftER Teacher超越了强有力的监督检测器的新性能，仅使用所需基础标签的10％，而不会出现之前方法中观察到的灾难性遗忘。我们的工作还揭示了半监督学习和Few-Shot目标检测之间潜在关系的可能性。",
    "tldr": "本文研究了半监督Few-Shot目标检测任务，发现未标记数据对提高半监督FSOD有好处。受此发现启发，我们引入了SoftER Teacher，一种强大的检测器，用于改进FSOD，不需要丰富的标签，并能在性能方面超越强有力的监督检测器，而且不会出现灾难性遗忘。"
}