{
    "title": "Residual Physics Learning and System Identification for Sim-to-real Transfer of Policies on Buoyancy Assisted Legged Robots. (arXiv:2303.09597v1 [cs.RO])",
    "abstract": "The light and soft characteristics of Buoyancy Assisted Lightweight Legged Unit (BALLU) robots have a great potential to provide intrinsically safe interactions in environments involving humans, unlike many heavy and rigid robots. However, their unique and sensitive dynamics impose challenges to obtaining robust control policies in the real world. In this work, we demonstrate robust sim-to-real transfer of control policies on the BALLU robots via system identification and our novel residual physics learning method, Environment Mimic (EnvMimic). First, we model the nonlinear dynamics of the actuators by collecting hardware data and optimizing the simulation parameters. Rather than relying on standard supervised learning formulations, we utilize deep reinforcement learning to train an external force policy to match real-world trajectories, which enables us to model residual physics with greater fidelity. We analyze the improved simulation fidelity by comparing the simulation trajectories",
    "link": "http://arxiv.org/abs/2303.09597",
    "context": "Title: Residual Physics Learning and System Identification for Sim-to-real Transfer of Policies on Buoyancy Assisted Legged Robots. (arXiv:2303.09597v1 [cs.RO])\nAbstract: The light and soft characteristics of Buoyancy Assisted Lightweight Legged Unit (BALLU) robots have a great potential to provide intrinsically safe interactions in environments involving humans, unlike many heavy and rigid robots. However, their unique and sensitive dynamics impose challenges to obtaining robust control policies in the real world. In this work, we demonstrate robust sim-to-real transfer of control policies on the BALLU robots via system identification and our novel residual physics learning method, Environment Mimic (EnvMimic). First, we model the nonlinear dynamics of the actuators by collecting hardware data and optimizing the simulation parameters. Rather than relying on standard supervised learning formulations, we utilize deep reinforcement learning to train an external force policy to match real-world trajectories, which enables us to model residual physics with greater fidelity. We analyze the improved simulation fidelity by comparing the simulation trajectories",
    "path": "papers/23/03/2303.09597.json",
    "total_tokens": 1014,
    "translated_title": "基于残差物理学习和系统识别的浮力辅助腿式机器人的模拟到真实世界转移方案",
    "translated_abstract": "浮力辅助轻量化腿部机器人具有轻便和柔软的特性，与许多沉重和刚性机器人相比，有很大的潜力提供内在安全性交互。然而，它们独特而敏感的动态特性对于在真实世界中获得稳健的控制策略而言是具有挑战性的。在这项工作中，我们通过系统识别和我们的新颖的残差物理学习方法——环境模型（EnvMimic），展示了在BALLU机器人上稳健的模拟到真实世界控制策略转移。首先，我们通过收集硬件数据并优化模拟参数来建模执行器的非线性动态。我们不依赖标准的监督式学习公式，而是利用深度强化学习来训练一个外部力策略以匹配真实世界轨迹，这使我们能够更准确地建模残差物理学。我们通过比较仿真轨迹来分析改进的仿真准确度。",
    "tldr": "本文利用残差物理学习方法和系统识别，在轻量化、柔软机器人BALLU上实现了从模拟到真实世界的稳健控制转移。通过使用强化学习训练外部力策略以匹配真实世界轨迹，建模残差物理学，提高了仿真精度。",
    "en_tdlr": "This paper presents a robust sim-to-real transfer of control policies on the light and soft Buoyancy Assisted Lightweight Legged Unit (BALLU) robots via system identification and a novel residual physics learning method. The method uses deep reinforcement learning to train an external force policy to match real-world trajectories, which enables more accurate modeling of residual physics and improved simulation fidelity."
}