{
    "title": "UniTS: A Universal Time Series Analysis Framework with Self-supervised Representation Learning. (arXiv:2303.13804v1 [cs.LG])",
    "abstract": "Machine learning has emerged as a powerful tool for time series analysis. Existing methods are usually customized for different analysis tasks and face challenges in tackling practical problems such as partial labeling and domain shift. To achieve universal analysis and address the aforementioned problems, we develop UniTS, a novel framework that incorporates self-supervised representation learning (or pre-training). The components of UniTS are designed using sklearn-like APIs to allow flexible extensions. We demonstrate how users can easily perform an analysis task using the user-friendly GUIs, and show the superior performance of UniTS over the traditional task-specific methods without self-supervised pre-training on five mainstream tasks and two practical settings.",
    "link": "http://arxiv.org/abs/2303.13804",
    "context": "Title: UniTS: A Universal Time Series Analysis Framework with Self-supervised Representation Learning. (arXiv:2303.13804v1 [cs.LG])\nAbstract: Machine learning has emerged as a powerful tool for time series analysis. Existing methods are usually customized for different analysis tasks and face challenges in tackling practical problems such as partial labeling and domain shift. To achieve universal analysis and address the aforementioned problems, we develop UniTS, a novel framework that incorporates self-supervised representation learning (or pre-training). The components of UniTS are designed using sklearn-like APIs to allow flexible extensions. We demonstrate how users can easily perform an analysis task using the user-friendly GUIs, and show the superior performance of UniTS over the traditional task-specific methods without self-supervised pre-training on five mainstream tasks and two practical settings.",
    "path": "papers/23/03/2303.13804.json",
    "total_tokens": 765,
    "translated_title": "UniTS: 一种带自监督表示学习的通用时间序列分析框架",
    "translated_abstract": "机器学习已经成为时间序列分析的强有力工具。现有方法通常针对不同分析任务进行定制，并面临着处理部分标记和领域转移等实际问题的挑战。为了实现通用分析并解决上述问题，我们开发了UniTS，这是一个新颖的框架，它集成了自监督表示学习（或预训练）。 UniTS的组件使用类似于sklearn的API进行设计，以允许灵活的扩展。我们演示了用户如何使用用户友好的GUI执行分析任务，并展示了UniTS在五个主流任务和两个实际设置中相较于传统特定任务方法没有自监督预训练的卓越性能。",
    "tldr": "UniTS是一个带自监督表示学习的通用时间序列分析框架，能够解决部分标记和领域转移等实际问题，并在多个任务和设置中实现了优秀的性能表现。",
    "en_tdlr": "UniTS is a universal time series analysis framework with self-supervised representation learning, which can solve practical problems such as partial labeling and domain shift, and has achieved superior performance in multiple tasks and settings compared to traditional task-specific methods without self-supervised pre-training."
}