{
    "title": "Self-accumulative Vision Transformer for Bone Age Assessment Using the Sauvegrain Method. (arXiv:2303.16557v1 [cs.CV])",
    "abstract": "This study presents a novel approach to bone age assessment (BAA) using a multi-view, multi-task classification model based on the Sauvegrain method. A straightforward solution to automating the Sauvegrain method, which assesses a maturity score for each landmark in the elbow and predicts the bone age, is to train classifiers independently to score each region of interest (RoI), but this approach limits the accessible information to local morphologies and increases computational costs. As a result, this work proposes a self-accumulative vision transformer (SAT) that mitigates anisotropic behavior, which usually occurs in multi-view, multi-task problems and limits the effectiveness of a vision transformer, by applying token replay and regional attention bias. A number of experiments show that SAT successfully exploits the relationships between landmarks and learns global morphological features, resulting in a mean absolute error of BAA that is 0.11 lower than that of the previous work. ",
    "link": "http://arxiv.org/abs/2303.16557",
    "context": "Title: Self-accumulative Vision Transformer for Bone Age Assessment Using the Sauvegrain Method. (arXiv:2303.16557v1 [cs.CV])\nAbstract: This study presents a novel approach to bone age assessment (BAA) using a multi-view, multi-task classification model based on the Sauvegrain method. A straightforward solution to automating the Sauvegrain method, which assesses a maturity score for each landmark in the elbow and predicts the bone age, is to train classifiers independently to score each region of interest (RoI), but this approach limits the accessible information to local morphologies and increases computational costs. As a result, this work proposes a self-accumulative vision transformer (SAT) that mitigates anisotropic behavior, which usually occurs in multi-view, multi-task problems and limits the effectiveness of a vision transformer, by applying token replay and regional attention bias. A number of experiments show that SAT successfully exploits the relationships between landmarks and learns global morphological features, resulting in a mean absolute error of BAA that is 0.11 lower than that of the previous work. ",
    "path": "papers/23/03/2303.16557.json",
    "total_tokens": 921,
    "translated_title": "Bone Age Assessment的自累积视觉变换器，使用Sauvegrain方法",
    "translated_abstract": "本研究提出了一种新的方法，基于Sauvegrain方法，使用多视角、多任务分类模型进行骨龄评估（BAA）。该方法通过训练分类器来评分每个一点的成熟度并预测骨龄，但是这种方法局限于本地形态，并增加了计算成本。因此，本文提出了一种自累积视觉变换器（SAT），通过应用标记重放和区域注意偏差，消减了多视角、多任务问题中通常发生的各向异性行为，从而有效地挖掘地标之间的关系并学习全局形态特征。通过多次实验表明，SAT成功地将地标之间的关系和全局形态特征融合，使骨龄评估的平均绝对误差比之前的工作降低了0.11。",
    "tldr": "该研究提出了一种基于自累积视觉变换器的方法，应用于骨龄评估。通过应用标记重放和区域注意偏差，该方法有效地挖掘地标之间的关系并学习全局形态特征，使骨龄评估的平均绝对误差比之前的工作降低了0.11。",
    "en_tdlr": "This study proposes a self-accumulative vision transformer (SAT) approach for bone age assessment, which effectively exploits relationships between landmarks and learns global morphological features using token replay and regional attention bias. This approach outperforms previous methods with a 0.11 lower mean absolute error in bone age assessment."
}