{
    "title": "Reinforced Labels: Multi-Agent Deep Reinforcement Learning for Point-Feature Label Placement. (arXiv:2303.01388v2 [cs.LG] UPDATED)",
    "abstract": "Over recent years, Reinforcement Learning combined with Deep Learning techniques has successfully proven to solve complex problems in various domains, including robotics, self-driving cars, and finance. In this paper, we are introducing Reinforcement Learning (RL) to label placement, a complex task in data visualization that seeks optimal positioning for labels to avoid overlap and ensure legibility. Our novel point-feature label placement method utilizes Multi-Agent Deep Reinforcement Learning (MADRL) to learn the label placement strategy, which is the first machine-learning-driven labeling method in contrast to existing hand-crafted algorithms designed by human experts. To facilitate RL learning, we developed an environment where an agent acts as a proxy for a label, a short textual annotation that augments visualization. Our results show that the strategy trained by our method significantly outperforms the random strategy of an untrained agent and compared methods designed by human ",
    "link": "http://arxiv.org/abs/2303.01388",
    "context": "Title: Reinforced Labels: Multi-Agent Deep Reinforcement Learning for Point-Feature Label Placement. (arXiv:2303.01388v2 [cs.LG] UPDATED)\nAbstract: Over recent years, Reinforcement Learning combined with Deep Learning techniques has successfully proven to solve complex problems in various domains, including robotics, self-driving cars, and finance. In this paper, we are introducing Reinforcement Learning (RL) to label placement, a complex task in data visualization that seeks optimal positioning for labels to avoid overlap and ensure legibility. Our novel point-feature label placement method utilizes Multi-Agent Deep Reinforcement Learning (MADRL) to learn the label placement strategy, which is the first machine-learning-driven labeling method in contrast to existing hand-crafted algorithms designed by human experts. To facilitate RL learning, we developed an environment where an agent acts as a proxy for a label, a short textual annotation that augments visualization. Our results show that the strategy trained by our method significantly outperforms the random strategy of an untrained agent and compared methods designed by human ",
    "path": "papers/23/03/2303.01388.json",
    "total_tokens": 913,
    "translated_title": "强化标签: 多智能体深度强化学习用于点特征标签放置",
    "translated_abstract": "最近几年，结合深度学习技术的强化学习已成功应用于解决各个领域的复杂问题，包括机器人、自动驾驶汽车和金融等。本文将强化学习引入标签放置，这是数据可视化中一个复杂的任务，旨在找到最佳位置以避免重叠并确保可读性。我们提出了一种新颖的点特征标签放置方法，利用多智能体深度强化学习(MADRL)来学习标签放置策略，这是与现有手工设计的算法相对应的第一个机器学习驱动的标签放置方法。为了方便强化学习的学习过程，我们开发了一个环境，其中代理作为标签的代理，这些标签是一种增强可视化的短文本注释。我们的结果表明，通过我们的方法训练得到的策略明显优于未经训练的代理的随机策略以及由人类设计的比较方法。",
    "tldr": "本论文介绍了一种利用多智能体深度强化学习的标签放置方法，该方法在数据可视化中解决了标签重叠和可读性问题，与现有的手工设计算法相比具有显著的优势。",
    "en_tdlr": "This paper presents a label placement method using multi-agent deep reinforcement learning, which addresses the issue of label overlap and legibility in data visualization, and outperforms existing hand-crafted algorithms."
}