{
    "title": "pyribs: A Bare-Bones Python Library for Quality Diversity Optimization. (arXiv:2303.00191v2 [cs.NE] UPDATED)",
    "abstract": "Recent years have seen a rise in the popularity of quality diversity (QD) optimization, a branch of optimization that seeks to find a collection of diverse, high-performing solutions to a given problem. To grow further, we believe the QD community faces two challenges: developing a framework to represent the field's growing array of algorithms, and implementing that framework in software that supports a range of researchers and practitioners. To address these challenges, we have developed pyribs, a library built on a highly modular conceptual QD framework. By replacing components in the conceptual framework, and hence in pyribs, users can compose algorithms from across the QD literature; equally important, they can identify unexplored algorithm variations. Furthermore, pyribs makes this framework simple, flexible, and accessible, with a user-friendly API supported by extensive documentation and tutorials. This paper overviews the creation of pyribs, focusing on the conceptual framework",
    "link": "http://arxiv.org/abs/2303.00191",
    "context": "Title: pyribs: A Bare-Bones Python Library for Quality Diversity Optimization. (arXiv:2303.00191v2 [cs.NE] UPDATED)\nAbstract: Recent years have seen a rise in the popularity of quality diversity (QD) optimization, a branch of optimization that seeks to find a collection of diverse, high-performing solutions to a given problem. To grow further, we believe the QD community faces two challenges: developing a framework to represent the field's growing array of algorithms, and implementing that framework in software that supports a range of researchers and practitioners. To address these challenges, we have developed pyribs, a library built on a highly modular conceptual QD framework. By replacing components in the conceptual framework, and hence in pyribs, users can compose algorithms from across the QD literature; equally important, they can identify unexplored algorithm variations. Furthermore, pyribs makes this framework simple, flexible, and accessible, with a user-friendly API supported by extensive documentation and tutorials. This paper overviews the creation of pyribs, focusing on the conceptual framework",
    "path": "papers/23/03/2303.00191.json",
    "total_tokens": 924,
    "translated_title": "pyribs: 一个Python基础库用于质量多样性优化",
    "translated_abstract": "近年来，质量多样性(QD)优化在优化的分支中变得越来越受欢迎，该分支寻求找到给定问题的多样化高性能解决方案集合。为了进一步发展，我们认为QD社区面临两个挑战：开发一个代表该领域不断增长的算法数组的框架，并在支持一系列研究人员和实践者的软件中实现该框架。为了解决这些挑战，我们开发了一个基于高度模块化的概念QD框架的库pyribs。通过替换概念框架中的组件，因此在pyribs中，用户可以从QD文献中组合算法，同样重要的是，他们可以识别未探索的算法变化。此外，pyribs使这个框架简单，灵活和易于访问，具有用户友好的API，支持广泛的文档和教程。本篇论文重点概述了pyribs的创建过程，着重介绍了概念框架。",
    "tldr": "pyribs是一个Python库，可以用于质量多样性优化，支持广泛的研究人员和实践者，具有高度模块化的框架可用于组合算法，是一个灵活易用的框架。",
    "en_tdlr": "pyribs is a Python library for quality diversity optimization that is flexible and accessible, with a highly modular framework for composing algorithms from across QD literature, as well as a user-friendly API supported by extensive documentation and tutorials."
}