{
    "title": "Distinguishing Cause from Effect on Categorical Data: The Uniform Channel Model. (arXiv:2303.08572v1 [cs.LG])",
    "abstract": "Distinguishing cause from effect using observations of a pair of random variables is a core problem in causal discovery. Most approaches proposed for this task, namely additive noise models (ANM), are only adequate for quantitative data. We propose a criterion to address the cause-effect problem with categorical variables (living in sets with no meaningful order), inspired by seeing a conditional probability mass function (pmf) as a discrete memoryless channel. We select as the most likely causal direction the one in which the conditional pmf is closer to a uniform channel (UC). The rationale is that, in a UC, as in an ANM, the conditional entropy (of the effect given the cause) is independent of the cause distribution, in agreement with the principle of independence of cause and mechanism. Our approach, which we call the uniform channel model (UCM), thus extends the ANM rationale to categorical variables. To assess how close a conditional pmf (estimated from data) is to a UC, we use s",
    "link": "http://arxiv.org/abs/2303.08572",
    "context": "Title: Distinguishing Cause from Effect on Categorical Data: The Uniform Channel Model. (arXiv:2303.08572v1 [cs.LG])\nAbstract: Distinguishing cause from effect using observations of a pair of random variables is a core problem in causal discovery. Most approaches proposed for this task, namely additive noise models (ANM), are only adequate for quantitative data. We propose a criterion to address the cause-effect problem with categorical variables (living in sets with no meaningful order), inspired by seeing a conditional probability mass function (pmf) as a discrete memoryless channel. We select as the most likely causal direction the one in which the conditional pmf is closer to a uniform channel (UC). The rationale is that, in a UC, as in an ANM, the conditional entropy (of the effect given the cause) is independent of the cause distribution, in agreement with the principle of independence of cause and mechanism. Our approach, which we call the uniform channel model (UCM), thus extends the ANM rationale to categorical variables. To assess how close a conditional pmf (estimated from data) is to a UC, we use s",
    "path": "papers/23/03/2303.08572.json",
    "total_tokens": 889,
    "translated_title": "区分分类数据中的因果关系：均匀通道模型",
    "translated_abstract": "区分因果关系是因果发现中的核心问题。大多数用于此任务的方法，即加性噪声模型（ANM），仅适用于定量数据。我们提出了一个在分类变量（属于没有有意义顺序的集合）上解决因果-效应问题的标准，灵感来源于将条件概率质量函数（pmf）视为离散无记忆通道。我们选择最可能的因果方向，其中条件pmf更接近均匀通道（UC）。原理是，在UC中，正如在ANM中一样，（给定因果关系的效应）条件熵独立于因果分布，符合因果和机制独立性原则。因此，我们的方法称为均匀通道模型（UCM），扩展了ANM理论到分类变量。为了评估从数据估计的条件pmf与UC的接近程度，我们使用s",
    "tldr": "本文提出了一种名为“均匀通道模型”的方法，用于区分分类数据中的因果关系，该方法将条件概率质量函数视为离散无记忆通道，并选择最可能的因果方向使得条件概率质量函数更接近于均匀分布。",
    "en_tdlr": "This paper proposes a method called the \"Uniform Channel Model\" to distinguish cause from effect in categorical data, which treats the conditional probability mass function as a discrete memoryless channel and selects the most likely causal direction where the conditional pmf is closer to a uniform channel."
}