{
    "title": "Error Bounds for Kernel-Based Linear System Identification with Unknown Hyperparameters. (arXiv:2303.09842v1 [eess.SY])",
    "abstract": "The kernel-based method has been successfully applied in linear system identification using stable kernel designs. From a Gaussian process perspective, it automatically provides probabilistic error bounds for the identified models from the posterior covariance, which are useful in robust and stochastic control. However, the error bounds require knowledge of the true hyperparameters in the kernel design and are demonstrated to be inaccurate with estimated hyperparameters for lightly damped systems or in the presence of high noise. In this work, we provide reliable quantification of the estimation error when the hyperparameters are unknown. The bounds are obtained by first constructing a high-probability set for the true hyperparameters from the marginal likelihood function and then finding the worst-case posterior covariance within the set. The proposed bound is proven to contain the true model with a high probability and its validity is verified in numerical simulation.",
    "link": "http://arxiv.org/abs/2303.09842",
    "context": "Title: Error Bounds for Kernel-Based Linear System Identification with Unknown Hyperparameters. (arXiv:2303.09842v1 [eess.SY])\nAbstract: The kernel-based method has been successfully applied in linear system identification using stable kernel designs. From a Gaussian process perspective, it automatically provides probabilistic error bounds for the identified models from the posterior covariance, which are useful in robust and stochastic control. However, the error bounds require knowledge of the true hyperparameters in the kernel design and are demonstrated to be inaccurate with estimated hyperparameters for lightly damped systems or in the presence of high noise. In this work, we provide reliable quantification of the estimation error when the hyperparameters are unknown. The bounds are obtained by first constructing a high-probability set for the true hyperparameters from the marginal likelihood function and then finding the worst-case posterior covariance within the set. The proposed bound is proven to contain the true model with a high probability and its validity is verified in numerical simulation.",
    "path": "papers/23/03/2303.09842.json",
    "total_tokens": 892,
    "translated_title": "未知超参数的基于核的线性系统辨识的误差界限",
    "translated_abstract": "基于核的方法已经成功地应用于使用稳定核设计的线性系统辨识中。从高斯过程的角度来看，它可以通过后验协方差为识别的模型自动提供概率误差界限，这在鲁棒和随机控制中非常有用。然而，这些误差界限需要内核设计中真实超参数的知识，并且在估计的超参数不准确或在存在高噪声的情况下被证明是不准确的。在这项工作中，我们提供了在超参数未知的情况下可靠地量化估计误差的方法。这些边界是通过首先从边际似然函数构建真实超参数的高概率集合，然后在该集合内找到最坏情况下的后验协方差而获得的。所提出的边界被证明具有高概率包含真实模型，并且在数值模拟中验证了其有效性。",
    "tldr": "本研究提出了一种在超参数未知的情况下可靠地量化估计误差的方法，通过构建真实超参数的高概率集合来获得边界，并在其中找到最坏的后验协方差。该方法在数值模拟中被证明是有效的。",
    "en_tdlr": "This paper proposes a reliable method for quantifying estimation error when hyperparameters are unknown in kernel-based linear system identification, by constructing a high-probability set for the true hyperparameters and finding the worst-case posterior covariance within the set. The proposed method is validated through numerical simulations."
}