{
    "title": "Improving 3D Imaging with Pre-Trained Perpendicular 2D Diffusion Models. (arXiv:2303.08440v1 [eess.IV])",
    "abstract": "Diffusion models have become a popular approach for image generation and reconstruction due to their numerous advantages. However, most diffusion-based inverse problem-solving methods only deal with 2D images, and even recently published 3D methods do not fully exploit the 3D distribution prior. To address this, we propose a novel approach using two perpendicular pre-trained 2D diffusion models to solve the 3D inverse problem. By modeling the 3D data distribution as a product of 2D distributions sliced in different directions, our method effectively addresses the curse of dimensionality. Our experimental results demonstrate that our method is highly effective for 3D medical image reconstruction tasks, including MRI Z-axis super-resolution, compressed sensing MRI, and sparse-view CT. Our method can generate high-quality voxel volumes suitable for medical applications.",
    "link": "http://arxiv.org/abs/2303.08440",
    "context": "Title: Improving 3D Imaging with Pre-Trained Perpendicular 2D Diffusion Models. (arXiv:2303.08440v1 [eess.IV])\nAbstract: Diffusion models have become a popular approach for image generation and reconstruction due to their numerous advantages. However, most diffusion-based inverse problem-solving methods only deal with 2D images, and even recently published 3D methods do not fully exploit the 3D distribution prior. To address this, we propose a novel approach using two perpendicular pre-trained 2D diffusion models to solve the 3D inverse problem. By modeling the 3D data distribution as a product of 2D distributions sliced in different directions, our method effectively addresses the curse of dimensionality. Our experimental results demonstrate that our method is highly effective for 3D medical image reconstruction tasks, including MRI Z-axis super-resolution, compressed sensing MRI, and sparse-view CT. Our method can generate high-quality voxel volumes suitable for medical applications.",
    "path": "papers/23/03/2303.08440.json",
    "total_tokens": 928,
    "translated_title": "利用预训练的垂直二维扩散模型改进三维成像",
    "translated_abstract": "由于其众多的优点，扩散模型已成为图像生成和重构的流行方法。 然而，大多数基于扩散的逆问题求解方法仅处理二维图像，即使是最近发布的三维方法也没有充分利用三维先验分布。 为了解决这个问题，我们提出了一种新方法，使用两个相互垂直的预训练二维扩散模型来解决三维逆问题。 通过将三维数据分布建模为在不同方向上切片的二维分布的乘积，我们的方法有效地解决了维数的灾难性问题。 我们的实验结果证明，我们的方法对于三维医学图像重建任务非常有效，包括MRI Z轴超分辨率，压缩感知MRI和稀疏视图CT。 我们的方法可以生成适用于医学应用的高质量体素体积。",
    "tldr": "本论文提出了一种使用两个预训练的垂直二维扩散模型来解决三维逆问题的方法，将三维数据分布建模为在不同方向上切片的二维分布的乘积，解决了维数的灾难性问题，并以高效的方式用于医学图像重建任务。",
    "en_tdlr": "This paper proposes a novel approach using two perpendicular pre-trained 2D diffusion models to solve the 3D inverse problem, modeling the 3D data distribution as a product of 2D distributions sliced in different directions, effectively addressing the curse of dimensionality. The method is highly effective for 3D medical image reconstruction tasks and can generate high-quality voxel volumes suitable for medical applications."
}