{
    "title": "Efficient Image-Text Retrieval via Keyword-Guided Pre-Screening. (arXiv:2303.07740v1 [cs.CV])",
    "abstract": "Under the flourishing development in performance, current image-text retrieval methods suffer from $N$-related time complexity, which hinders their application in practice. Targeting at efficiency improvement, this paper presents a simple and effective keyword-guided pre-screening framework for the image-text retrieval. Specifically, we convert the image and text data into the keywords and perform the keyword matching across modalities to exclude a large number of irrelevant gallery samples prior to the retrieval network. For the keyword prediction, we transfer it into a multi-label classification problem and propose a multi-task learning scheme by appending the multi-label classifiers to the image-text retrieval network to achieve a lightweight and high-performance keyword prediction. For the keyword matching, we introduce the inverted index in the search engine and create a win-win situation on both time and space complexities for the pre-screening. Extensive experiments on two widel",
    "link": "http://arxiv.org/abs/2303.07740",
    "context": "Title: Efficient Image-Text Retrieval via Keyword-Guided Pre-Screening. (arXiv:2303.07740v1 [cs.CV])\nAbstract: Under the flourishing development in performance, current image-text retrieval methods suffer from $N$-related time complexity, which hinders their application in practice. Targeting at efficiency improvement, this paper presents a simple and effective keyword-guided pre-screening framework for the image-text retrieval. Specifically, we convert the image and text data into the keywords and perform the keyword matching across modalities to exclude a large number of irrelevant gallery samples prior to the retrieval network. For the keyword prediction, we transfer it into a multi-label classification problem and propose a multi-task learning scheme by appending the multi-label classifiers to the image-text retrieval network to achieve a lightweight and high-performance keyword prediction. For the keyword matching, we introduce the inverted index in the search engine and create a win-win situation on both time and space complexities for the pre-screening. Extensive experiments on two widel",
    "path": "papers/23/03/2303.07740.json",
    "total_tokens": 931,
    "translated_title": "通过关键词引导的预处理实现高效的图像文本检索",
    "translated_abstract": "针对目前图像文本检索方法在性能方面蓬勃发展，但存在$N$相关时间复杂度的问题，影响了它们在实际应用中的使用。本文提出了一种简单有效的基于关键词引导的预处理框架，可用于图像文本检索。具体来说，我们将图像和文本数据转换为关键词，并在模态之间执行关键词匹配以排除大量无关的样本，然后再输入到检索网络中。对于关键词预测，我们将其转换为多标签分类问题，提出了一种多任务学习方案，通过将多标签分类器附加到图像文本检索网络中以实现轻量级和高性能的关键词预测。对于关键词匹配，我们在搜索引擎中引入倒排索引，实现了对预检索中的时间和空间复杂度双赢的情况。在两个广泛使用的数据集上进行了广泛的实验。",
    "tldr": "本文提出了一种基于关键词引导的预处理框架，可以用于在图像和文本之间进行快速高效的关键词匹配，以排除大量的无关样本。多任务学习方案以实现高性能关键词预测，并在检索中引入倒排索引，以实现高效的关键词匹配。",
    "en_tdlr": "This paper proposes a keyword-guided pre-screening framework for efficient image-text retrieval. The framework converts image and text data into keywords and matches them across modalities to exclude irrelevant samples prior to retrieval. A multi-task learning scheme and inverted index are used for keyword prediction and matching, respectively, achieving a lightweight and high-performance approach."
}