{
    "title": "Learning Spatio-Temporal Aggregations for Large-Scale Capacity Expansion Problems. (arXiv:2303.08996v1 [cs.LG])",
    "abstract": "Effective investment planning decisions are crucial to ensure cyber-physical infrastructures satisfy performance requirements over an extended time horizon. Computing these decisions often requires solving Capacity Expansion Problems (CEPs). In the context of regional-scale energy systems, these problems are prohibitively expensive to solve due to large network sizes, heterogeneous node characteristics, and a large number of operational periods. To maintain tractability, traditional approaches aggregate network nodes and/or select a set of representative time periods. Often, these reductions do not capture supply-demand variations that crucially impact CEP costs and constraints, leading to suboptimal decisions. Here, we propose a novel graph convolutional autoencoder approach for spatio-temporal aggregation of a generic CEP with heterogeneous nodes (CEPHN). Our architecture leverages graph pooling to identify nodes with similar characteristics and minimizes a multi-objective loss funct",
    "link": "http://arxiv.org/abs/2303.08996",
    "context": "Title: Learning Spatio-Temporal Aggregations for Large-Scale Capacity Expansion Problems. (arXiv:2303.08996v1 [cs.LG])\nAbstract: Effective investment planning decisions are crucial to ensure cyber-physical infrastructures satisfy performance requirements over an extended time horizon. Computing these decisions often requires solving Capacity Expansion Problems (CEPs). In the context of regional-scale energy systems, these problems are prohibitively expensive to solve due to large network sizes, heterogeneous node characteristics, and a large number of operational periods. To maintain tractability, traditional approaches aggregate network nodes and/or select a set of representative time periods. Often, these reductions do not capture supply-demand variations that crucially impact CEP costs and constraints, leading to suboptimal decisions. Here, we propose a novel graph convolutional autoencoder approach for spatio-temporal aggregation of a generic CEP with heterogeneous nodes (CEPHN). Our architecture leverages graph pooling to identify nodes with similar characteristics and minimizes a multi-objective loss funct",
    "path": "papers/23/03/2303.08996.json",
    "total_tokens": 983,
    "translated_title": "学习大规模容量扩展问题的时空聚合",
    "translated_abstract": "有效的投资规划决策对于确保网络物理基础设施在扩展期内满足性能要求至关重要。计算这些决策通常需要解决容量扩展问题。在区域规模的能源系统中，由于网络规模大、节点特征异构、操作周期众多等原因，这些问题往往难以解决。为了保持可行性，传统方法会聚合网络节点和/或选择一组代表性时段。然而，这些简化未能捕捉到供需变化对 CEP 成本和约束的重要影响，导致次优决策。本文提出了一种新颖的图卷积自编码器方法，用于到异构节点的泛型 CEP 的时空聚合。我们的架构利用图池化来识别具有相似特征的节点，并最小化一个多目标损失函数，该函数包括成本和性能目标。我们的方法在合成数据集和实际电网数据集上优于传统方法和现有基准。因此，所提出的方法为决策者提供了一种可扩展的工具，用于评估能源基础设施的容量扩展方案。",
    "tldr": "本文提出了一种新颖的方法，用于有效解决容量扩展问题，该方法通过时空聚合解决了由于网络规模大、节点特征异构等原因而导致的问题，并优于传统方法和现有基准。",
    "en_tdlr": "This paper proposes a novel approach that effectively solves the capacity expansion problem by addressing the issues arising from large network sizes and heterogeneous node characteristics through spatio-temporal aggregation, and outperforms traditional methods and existing benchmarks."
}