{
    "title": "mHealth hyperspectral learning for instantaneous spatiospectral imaging of hemodynamics. (arXiv:2303.16205v1 [eess.IV])",
    "abstract": "Hyperspectral imaging acquires data in both the spatial and frequency domains to offer abundant physical or biological information. However, conventional hyperspectral imaging has intrinsic limitations of bulky instruments, slow data acquisition rate, and spatiospectral tradeoff. Here we introduce hyperspectral learning for snapshot hyperspectral imaging in which sampled hyperspectral data in a small subarea are incorporated into a learning algorithm to recover the hypercube. Hyperspectral learning exploits the idea that a photograph is more than merely a picture and contains detailed spectral information. A small sampling of hyperspectral data enables spectrally informed learning to recover a hypercube from an RGB image. Hyperspectral learning is capable of recovering full spectroscopic resolution in the hypercube, comparable to high spectral resolutions of scientific spectrometers. Hyperspectral learning also enables ultrafast dynamic imaging, leveraging ultraslow video recording in ",
    "link": "http://arxiv.org/abs/2303.16205",
    "context": "Title: mHealth hyperspectral learning for instantaneous spatiospectral imaging of hemodynamics. (arXiv:2303.16205v1 [eess.IV])\nAbstract: Hyperspectral imaging acquires data in both the spatial and frequency domains to offer abundant physical or biological information. However, conventional hyperspectral imaging has intrinsic limitations of bulky instruments, slow data acquisition rate, and spatiospectral tradeoff. Here we introduce hyperspectral learning for snapshot hyperspectral imaging in which sampled hyperspectral data in a small subarea are incorporated into a learning algorithm to recover the hypercube. Hyperspectral learning exploits the idea that a photograph is more than merely a picture and contains detailed spectral information. A small sampling of hyperspectral data enables spectrally informed learning to recover a hypercube from an RGB image. Hyperspectral learning is capable of recovering full spectroscopic resolution in the hypercube, comparable to high spectral resolutions of scientific spectrometers. Hyperspectral learning also enables ultrafast dynamic imaging, leveraging ultraslow video recording in ",
    "path": "papers/23/03/2303.16205.json",
    "total_tokens": 933,
    "tldr": "介绍了一种用于瞬间超光谱成像的超光谱学习方法，可从 RGB 图像中恢复出一个具有全光谱分辨率的超立方体，实现了超高光谱分辨率和超快速的动态成像。",
    "en_tdlr": "Introduces a hyperspectral learning method for snapshot hyperspectral imaging, which can recover a hypercube with full spectral resolution from an RGB image, achieving both high spectral resolution and ultrafast dynamic imaging."
}