{
    "title": "Feature-adjacent multi-fidelity physics-informed machine learning for partial differential equations. (arXiv:2303.11577v1 [cs.LG])",
    "abstract": "Physics-informed neural networks have emerged as an alternative method for solving partial differential equations. However, for complex problems, the training of such networks can still require high-fidelity data which can be expensive to generate. To reduce or even eliminate the dependency on high-fidelity data, we propose a novel multi-fidelity architecture which is based on a feature space shared by the low- and high-fidelity solutions. In the feature space, the projections of the low-fidelity and high-fidelity solutions are adjacent by constraining their relative distance. The feature space is represented with an encoder and its mapping to the original solution space is effected through a decoder. The proposed multi-fidelity approach is validated on forward and inverse problems for steady and unsteady problems described by partial differential equations.",
    "link": "http://arxiv.org/abs/2303.11577",
    "context": "Title: Feature-adjacent multi-fidelity physics-informed machine learning for partial differential equations. (arXiv:2303.11577v1 [cs.LG])\nAbstract: Physics-informed neural networks have emerged as an alternative method for solving partial differential equations. However, for complex problems, the training of such networks can still require high-fidelity data which can be expensive to generate. To reduce or even eliminate the dependency on high-fidelity data, we propose a novel multi-fidelity architecture which is based on a feature space shared by the low- and high-fidelity solutions. In the feature space, the projections of the low-fidelity and high-fidelity solutions are adjacent by constraining their relative distance. The feature space is represented with an encoder and its mapping to the original solution space is effected through a decoder. The proposed multi-fidelity approach is validated on forward and inverse problems for steady and unsteady problems described by partial differential equations.",
    "path": "papers/23/03/2303.11577.json",
    "total_tokens": 820,
    "translated_title": "特征相邻多保真物理学习用于偏微分方程",
    "translated_abstract": "物理学习神经网络已成为求解偏微分方程的备选方法。然而，对于复杂问题，这种网络的训练仍然需要高精度的数据，而这些数据的生成成本可能很高。为了减少甚至消除对高保真数据的依赖，我们提出了一种基于特征空间的多保真体系结构，该空间由低保真度和高保真度解决方案共享。在特征空间中，低精度和高精度解决方案的投影相邻，并通过约束它们的相对距离来实现。特征空间由编码器表示，其映射到原始解空间通过解码器实现。所提出的多保真方法在由偏微分方程描述的定态和非定态问题的正问题和逆问题上进行了验证。",
    "tldr": "提出了一种基于特征相邻的多保真体系结构，通过共享低保真度和高保真度解决方案的特征空间来减少或消除对高精度数据的依赖，这在解决复杂问题时具有重要意义。",
    "en_tdlr": "The paper proposes a novel multi-fidelity architecture based on a feature space shared by low- and high-fidelity solutions to reduce or eliminate the dependency on high-fidelity data. It is validated for complex problems described by partial differential equations."
}