{
    "title": "Development of a deep learning-based tool to assist wound classification. (arXiv:2303.16522v1 [cs.CV])",
    "abstract": "This paper presents a deep learning-based wound classification tool that can assist medical personnel in non-wound care specialization to classify five key wound conditions, namely deep wound, infected wound, arterial wound, venous wound, and pressure wound, given color images captured using readily available cameras. The accuracy of the classification is vital for appropriate wound management. The proposed wound classification method adopts a multi-task deep learning framework that leverages the relationships among the five key wound conditions for a unified wound classification architecture. With differences in Cohen's kappa coefficients as the metrics to compare our proposed model with humans, the performance of our model was better or non-inferior to those of all human medical personnel. Our convolutional neural network-based model is the first to classify five tasks of deep, infected, arterial, venous, and pressure wounds simultaneously with good accuracy. The proposed model is co",
    "link": "http://arxiv.org/abs/2303.16522",
    "context": "Title: Development of a deep learning-based tool to assist wound classification. (arXiv:2303.16522v1 [cs.CV])\nAbstract: This paper presents a deep learning-based wound classification tool that can assist medical personnel in non-wound care specialization to classify five key wound conditions, namely deep wound, infected wound, arterial wound, venous wound, and pressure wound, given color images captured using readily available cameras. The accuracy of the classification is vital for appropriate wound management. The proposed wound classification method adopts a multi-task deep learning framework that leverages the relationships among the five key wound conditions for a unified wound classification architecture. With differences in Cohen's kappa coefficients as the metrics to compare our proposed model with humans, the performance of our model was better or non-inferior to those of all human medical personnel. Our convolutional neural network-based model is the first to classify five tasks of deep, infected, arterial, venous, and pressure wounds simultaneously with good accuracy. The proposed model is co",
    "path": "papers/23/03/2303.16522.json",
    "total_tokens": 958,
    "translated_title": "基于深度学习的伤口分类辅助工具开发",
    "translated_abstract": "本文提出了一个基于深度学习的伤口分类工具，能够帮助非伤口护理专业的医务人员对五种关键伤口情况进行分类，包括深创口、感染性伤口、动脉性伤口、静脉性伤口和压力性伤口，使用易于获取的相机拍摄的彩色图像。分类的准确性对于适当的伤口管理至关重要。所提出的伤口分类方法采用了多任务深度学习框架，利用五种关键伤口情况之间的关系来实现统一的伤口分类架构。通过使用Cohen的kappa系数作为指标将我们的模型与人类进行比较，我们的模型的表现优于或不劣于所有医务人员。我们的卷积神经网络模型是第一个能够同时准确分类深创口、感染性伤口、动脉性伤口、静脉性伤口和压力性伤口的模型。所提出的模型是协助医护人员进行伤口分类的重要工具。",
    "tldr": "本文提出了一个基于深度学习的伤口分类工具，可以协助医务人员对五种关键伤口情况进行分类。使用了多任务深度学习框架，使用Cohen's kappa系数来评估模型的准确性，模型的表现优于或不劣于所有医务人员。",
    "en_tdlr": "This paper presents a deep learning-based wound classification tool that can assist medical personnel in non-wound care specialization to classify five key wound conditions. The proposed model adopts a multi-task deep learning framework and outperforms or is non-inferior to all human medical personnel according to Cohen's kappa coefficients."
}