{
    "title": "Statistical-Computational Tradeoffs in Mixed Sparse Linear Regression. (arXiv:2303.02118v2 [stat.ML] UPDATED)",
    "abstract": "We consider the problem of mixed sparse linear regression with two components, where two real $k$-sparse signals $\\beta_1, \\beta_2$ are to be recovered from $n$ unlabelled noisy linear measurements. The sparsity is allowed to be sublinear in the dimension, and additive noise is assumed to be independent Gaussian with variance $\\sigma^2$. Prior work has shown that the problem suffers from a $\\frac{k}{SNR^2}$-to-$\\frac{k^2}{SNR^2}$ statistical-to-computational gap, resembling other computationally challenging high-dimensional inference problems such as Sparse PCA and Robust Sparse Mean Estimation; here $SNR$ is the signal-to-noise ratio. We establish the existence of a more extensive computational barrier for this problem through the method of low-degree polynomials, but show that the problem is computationally hard only in a very narrow symmetric parameter regime. We identify a smooth information-computation tradeoff between the sample complexity $n$ and runtime for any randomized algor",
    "link": "http://arxiv.org/abs/2303.02118",
    "context": "Title: Statistical-Computational Tradeoffs in Mixed Sparse Linear Regression. (arXiv:2303.02118v2 [stat.ML] UPDATED)\nAbstract: We consider the problem of mixed sparse linear regression with two components, where two real $k$-sparse signals $\\beta_1, \\beta_2$ are to be recovered from $n$ unlabelled noisy linear measurements. The sparsity is allowed to be sublinear in the dimension, and additive noise is assumed to be independent Gaussian with variance $\\sigma^2$. Prior work has shown that the problem suffers from a $\\frac{k}{SNR^2}$-to-$\\frac{k^2}{SNR^2}$ statistical-to-computational gap, resembling other computationally challenging high-dimensional inference problems such as Sparse PCA and Robust Sparse Mean Estimation; here $SNR$ is the signal-to-noise ratio. We establish the existence of a more extensive computational barrier for this problem through the method of low-degree polynomials, but show that the problem is computationally hard only in a very narrow symmetric parameter regime. We identify a smooth information-computation tradeoff between the sample complexity $n$ and runtime for any randomized algor",
    "path": "papers/23/03/2303.02118.json",
    "total_tokens": 930,
    "translated_title": "混合稀疏线性回归中的统计与计算权衡",
    "translated_abstract": "我们考虑具有两个部分的混合稀疏线性回归问题，其中需要从n个无标签的噪声线性测量中恢复两个实数k稀疏信号β1、β2。稀疏度允许在维度上是亚线性的，且假设添加的噪声是独立的高斯噪声，方差为σ²。之前的研究表明，该问题存在一个k/SNR²到k²/SNR²的统计到计算间隙，类似于其他具有计算挑战性的高维推断问题，如稀疏主成分分析和鲁棒稀疏均值估计；这里的SNR是信噪比。通过低次多项式方法，我们证明了这个问题存在更广泛的计算障碍，但只在非常狭窄的对称参数范围内才表现出计算困难。我们确定了样本复杂度n和运行时间之间的平滑信息-计算权衡关系，对于任何随机化算法。",
    "tldr": "本研究研究了混合稀疏线性回归问题，在实际应用中发现了统计和计算之间的权衡关系，并确定了样本复杂度和运行时间之间的平滑信息-计算权衡关系。",
    "en_tdlr": "This study investigates the tradeoff between statistics and computation in mixed sparse linear regression, revealing a smooth balance between sample complexity and runtime for any randomized algorithm."
}