{
    "title": "Skip Connections in Spiking Neural Networks: An Analysis of Their Effect on Network Training. (arXiv:2303.13563v1 [cs.NE])",
    "abstract": "Spiking neural networks (SNNs) have gained attention as a promising alternative to traditional artificial neural networks (ANNs) due to their potential for energy efficiency and their ability to model spiking behavior in biological systems. However, the training of SNNs is still a challenging problem, and new techniques are needed to improve their performance. In this paper, we study the impact of skip connections on SNNs and propose a hyperparameter optimization technique that adapts models from ANN to SNN. We demonstrate that optimizing the position, type, and number of skip connections can significantly improve the accuracy and efficiency of SNNs by enabling faster convergence and increasing information flow through the network. Our results show an average +8% accuracy increase on CIFAR-10-DVS and DVS128 Gesture datasets adaptation of multiple state-of-the-art models.",
    "link": "http://arxiv.org/abs/2303.13563",
    "context": "Title: Skip Connections in Spiking Neural Networks: An Analysis of Their Effect on Network Training. (arXiv:2303.13563v1 [cs.NE])\nAbstract: Spiking neural networks (SNNs) have gained attention as a promising alternative to traditional artificial neural networks (ANNs) due to their potential for energy efficiency and their ability to model spiking behavior in biological systems. However, the training of SNNs is still a challenging problem, and new techniques are needed to improve their performance. In this paper, we study the impact of skip connections on SNNs and propose a hyperparameter optimization technique that adapts models from ANN to SNN. We demonstrate that optimizing the position, type, and number of skip connections can significantly improve the accuracy and efficiency of SNNs by enabling faster convergence and increasing information flow through the network. Our results show an average +8% accuracy increase on CIFAR-10-DVS and DVS128 Gesture datasets adaptation of multiple state-of-the-art models.",
    "path": "papers/23/03/2303.13563.json",
    "total_tokens": 887,
    "translated_title": "跳跃连接在脉冲神经网络中的作用：对网络训练影响的分析。",
    "translated_abstract": "由于脉冲神经网络（SNN）具有潜在的能量效率和模拟生物系统尖峰行为的能力，因此已引起人们的关注，成为传统人工神经网络（ANN）的有力替代。然而，SNN的训练仍然是一个具有挑战性的问题，需要新的技术来提高其性能。在本文中，我们研究了跳跃连接对SNN的影响，并提出了一种超参数优化技术，将ANN模型调整为SNN模型。我们证明了优化跳跃连接的位置、类型和数量可以显著提高SNN的准确性和效率，通过加快收敛速度和增加网络中的信息流。我们的结果表明，在CIFAR-10-DVS和DVS128手势数据集上，多种最先进模型的平均准确率提高了8%以上。",
    "tldr": "本文研究了跳跃连接在脉冲神经网络中的作用，并提出了一种优化技术。通过优化跳跃连接的位置、类型和数量等超参数，可以显著提高SNN的准确性和效率，使其收敛更快、信息流更畅。",
    "en_tdlr": "This paper studies the impact of skip connections on spiking neural networks (SNNs) and proposes a hyperparameter optimization technique. Optimizing the position, type, and number of skip connections can significantly improve the accuracy and efficiency of SNNs by enabling faster convergence and increasing information flow through the network."
}