{
    "title": "Carolina: a General Corpus of Contemporary Brazilian Portuguese with Provenance, Typology and Versioning Information. (arXiv:2303.16098v1 [cs.CL])",
    "abstract": "This paper presents the first publicly available version of the Carolina Corpus and discusses its future directions. Carolina is a large open corpus of Brazilian Portuguese texts under construction using web-as-corpus methodology enhanced with provenance, typology, versioning, and text integrality. The corpus aims at being used both as a reliable source for research in Linguistics and as an important resource for Computer Science research on language models, contributing towards removing Portuguese from the set of low-resource languages. Here we present the construction of the corpus methodology, comparing it with other existing methodologies, as well as the corpus current state: Carolina's first public version has $653,322,577$ tokens, distributed over $7$ broad types. Each text is annotated with several different metadata categories in its header, which we developed using TEI annotation standards. We also present ongoing derivative works and invite NLP researchers to contribute with ",
    "link": "http://arxiv.org/abs/2303.16098",
    "context": "Title: Carolina: a General Corpus of Contemporary Brazilian Portuguese with Provenance, Typology and Versioning Information. (arXiv:2303.16098v1 [cs.CL])\nAbstract: This paper presents the first publicly available version of the Carolina Corpus and discusses its future directions. Carolina is a large open corpus of Brazilian Portuguese texts under construction using web-as-corpus methodology enhanced with provenance, typology, versioning, and text integrality. The corpus aims at being used both as a reliable source for research in Linguistics and as an important resource for Computer Science research on language models, contributing towards removing Portuguese from the set of low-resource languages. Here we present the construction of the corpus methodology, comparing it with other existing methodologies, as well as the corpus current state: Carolina's first public version has $653,322,577$ tokens, distributed over $7$ broad types. Each text is annotated with several different metadata categories in its header, which we developed using TEI annotation standards. We also present ongoing derivative works and invite NLP researchers to contribute with ",
    "path": "papers/23/03/2303.16098.json",
    "total_tokens": 933,
    "translated_title": "Carolina：一种具有来源、类型和版本信息的巴西葡萄牙语通用现代语料库",
    "translated_abstract": "本文介绍了首个公开版本的Carolina语料库，并讨论了它的未来方向。Carolina是一个使用增强的来源、类型、版本和文本完整性的网络语料库方法正在构建中的巴西葡萄牙语文本的大型开放语料库。该语料库旨在作为语言学研究的可靠来源和计算机科学研究语言模型的重要资源，有助于将葡萄牙语从低资源语言中移除。本文介绍了构建语料库的方法，并将其与其他现有方法进行比较，以及语料库的当前状态：Carolina的第一个公开版有653,322,577个标记，分布在7个广泛的类型上。每个文本的标头都用TEI注释标准进行了多个不同的元数据类别的注释。我们还介绍了正在进行的派生作品，并邀请NLP研究人员进行贡献。",
    "tldr": "介绍了首个公开版本的巴西葡萄牙语通用现代语料库Carolina，它使用了增强的来源、类型、版本和文本完整性的网络语料库方法，并且可作为语言学研究和计算机科学研究语言模型的重要资源。",
    "en_tdlr": "This paper introduces the first publicly available version of the Carolina Corpus, a large open corpus of Brazilian Portuguese texts constructed using web-as-corpus methodology enhanced with provenance, typology, versioning, and text integrality. The corpus is intended to be a reliable source for research in Linguistics and an important resource for Computer Science research on language models, contributing to removing Portuguese from the set of low-resource languages."
}