{
    "title": "Predictive Optimized Model on Money Markets Instruments With Capital Market and Bank Rates Ratio. (arXiv:2303.10481v1 [q-fin.ST])",
    "abstract": "The money market and the capital market of the Indian financial markets have a symbiotic relationship in the development of the Indian economy. The nature and the characteristics of the markets differ to a large extent as the money market ensures liquidity in the system through the monetary policy by the regulators; capital markets propel and act as the engine driver for the economy in the long term. Therefore, the final throughput of the economy is the aggregation of the output of both the markets. Does that imply that the development of both markets is parallel in nature or is any one superior to the other or are they competitors? To understand the influence of one over the other the research was undertaken through a correlation matrix and time series model. A predictive model was further constructed for predicting the volume of money market instrument on the basis of fourteen days historical.",
    "link": "http://arxiv.org/abs/2303.10481",
    "context": "Title: Predictive Optimized Model on Money Markets Instruments With Capital Market and Bank Rates Ratio. (arXiv:2303.10481v1 [q-fin.ST])\nAbstract: The money market and the capital market of the Indian financial markets have a symbiotic relationship in the development of the Indian economy. The nature and the characteristics of the markets differ to a large extent as the money market ensures liquidity in the system through the monetary policy by the regulators; capital markets propel and act as the engine driver for the economy in the long term. Therefore, the final throughput of the economy is the aggregation of the output of both the markets. Does that imply that the development of both markets is parallel in nature or is any one superior to the other or are they competitors? To understand the influence of one over the other the research was undertaken through a correlation matrix and time series model. A predictive model was further constructed for predicting the volume of money market instrument on the basis of fourteen days historical.",
    "path": "papers/23/03/2303.10481.json",
    "total_tokens": 836,
    "translated_title": "基于资本市场和银行利率比率的货币市场工具预测优化模型",
    "translated_abstract": "印度金融市场的货币市场和资本市场在印度经济的发展中有着共生关系。市场的性质和特点在很大程度上不同，货币市场通过监管机构的货币政策确保系统中的流动性；资本市场则长期推动和担任经济引擎驱动器。因此，经济的最终吞吐量是两个市场的输出之和。这是否意味着两个市场的发展是并行的，或者任何一个市场优于另一个市场，或者它们竞争？为了了解一个市场对另一个市场的影响，本研究通过相关矩阵和时间序列模型进行了研究。进一步构建了一个基于14天历史的预测模型，用于预测货币市场工具的交易量。",
    "tldr": "本研究通过相关矩阵和时间序列模型构建了一个预测模型，以预测货币市场工具的交易量，并探讨了货币市场与资本市场在印度经济中的共生关系。",
    "en_tdlr": "This study constructs a predictive model using correlation matrix and time series models to predict the volume of money market instruments and explores the symbiotic relationship between the money market and the capital market in the Indian economy."
}