{
    "title": "Mean-Field Liquidation Games with Market Drop-out. (arXiv:2303.05783v2 [q-fin.MF] UPDATED)",
    "abstract": "We consider a novel class of portfolio liquidation games with market drop-out (\"absorption\"). More precisely, we consider mean-field and finite player liquidation games where a player drops out of the market when her position hits zero. In particular round-trips are not admissible. This can be viewed as a no statistical arbitrage condition. In a model with only sellers we prove that the absorption condition is equivalent to a short selling constraint. We prove that equilibria (both in the mean-field and the finite player game) are given as solutions to a non-linear higher-order integral equation with endogenous terminal condition. We prove the existence of a unique solution to the integral equation from which we obtain the existence of a unique equilibrium in the MFG and the existence of a unique equilibrium in the $N$-player game. We establish the convergence of the equilibria in the finite player games to the obtained mean-field equilibrium and illustrate the impact of the drop-out c",
    "link": "http://arxiv.org/abs/2303.05783",
    "context": "Title: Mean-Field Liquidation Games with Market Drop-out. (arXiv:2303.05783v2 [q-fin.MF] UPDATED)\nAbstract: We consider a novel class of portfolio liquidation games with market drop-out (\"absorption\"). More precisely, we consider mean-field and finite player liquidation games where a player drops out of the market when her position hits zero. In particular round-trips are not admissible. This can be viewed as a no statistical arbitrage condition. In a model with only sellers we prove that the absorption condition is equivalent to a short selling constraint. We prove that equilibria (both in the mean-field and the finite player game) are given as solutions to a non-linear higher-order integral equation with endogenous terminal condition. We prove the existence of a unique solution to the integral equation from which we obtain the existence of a unique equilibrium in the MFG and the existence of a unique equilibrium in the $N$-player game. We establish the convergence of the equilibria in the finite player games to the obtained mean-field equilibrium and illustrate the impact of the drop-out c",
    "path": "papers/23/03/2303.05783.json",
    "total_tokens": 916,
    "translated_title": "带有市场退出的均场清算游戏",
    "translated_abstract": "我们考虑了一种新的投资组合清算游戏，其中包括市场退出（\"吸收\"）。更具体地说，我们考虑了均场和有限玩家的清算游戏，当玩家的头寸达到零时，玩家将退出市场。特别地，不允许往返交易，这可以视为无统计套利条件。在一个仅有卖方的模型中，我们证明了吸收条件等价于卖空约束。我们证明均场和有限玩家游戏的均衡是一个具有内生期末条件的非线性高阶积分方程的解。我们证明了积分方程存在唯一解，从而得到了MFG中的唯一均衡存在性，以及$N$-player游戏中唯一均衡存在性。我们证实了有限玩家游戏中均衡收敛到均场均衡，并说明了市场退出条件的影响。",
    "tldr": "这项研究讨论了一种新颖的投资组合清算游戏，其中考虑了市场退出和无统计套利条件。研究表明，均衡状态可以通过解决一个高阶积分方程来获得，并且有限玩家游戏的均衡会收敛到均场均衡状态。",
    "en_tdlr": "This paper discusses a novel class of portfolio liquidation games with market drop-out and no statistical arbitrage condition. The equilibrium states of the games can be obtained by solving a higher-order integral equation, and the equilibria in finite player games converge to the mean-field equilibrium."
}