{
    "title": "Genetic Analysis of Prostate Cancer with Computer Science Methods. (arXiv:2303.15851v1 [cs.IR])",
    "abstract": "Metastatic prostate cancer is one of the most common cancers in men. In the advanced stages of prostate cancer, tumours can metastasise to other tissues in the body, which is fatal. In this thesis, we performed a genetic analysis of prostate cancer tumours at different metastatic sites using data science, machine learning and topological network analysis methods. We presented a general procedure for pre-processing gene expression datasets and pre-filtering significant genes by analytical methods. We then used machine learning models for further key gene filtering and secondary site tumour classification. Finally, we performed gene co-expression network analysis and community detection on samples from different prostate cancer secondary site types. In this work, 13 of the 14,379 genes were selected as the most metastatic prostate cancer related genes, achieving approximately 92% accuracy under cross-validation. In addition, we provide preliminary insights into the co-expression patterns",
    "link": "http://arxiv.org/abs/2303.15851",
    "context": "Title: Genetic Analysis of Prostate Cancer with Computer Science Methods. (arXiv:2303.15851v1 [cs.IR])\nAbstract: Metastatic prostate cancer is one of the most common cancers in men. In the advanced stages of prostate cancer, tumours can metastasise to other tissues in the body, which is fatal. In this thesis, we performed a genetic analysis of prostate cancer tumours at different metastatic sites using data science, machine learning and topological network analysis methods. We presented a general procedure for pre-processing gene expression datasets and pre-filtering significant genes by analytical methods. We then used machine learning models for further key gene filtering and secondary site tumour classification. Finally, we performed gene co-expression network analysis and community detection on samples from different prostate cancer secondary site types. In this work, 13 of the 14,379 genes were selected as the most metastatic prostate cancer related genes, achieving approximately 92% accuracy under cross-validation. In addition, we provide preliminary insights into the co-expression patterns",
    "path": "papers/23/03/2303.15851.json",
    "total_tokens": 829,
    "translated_title": "计算机科学方法在前列腺癌遗传学中的应用",
    "translated_abstract": "转移性前列腺癌是男性最常见的癌症之一。本文采用数据科学、机器学习和拓扑网络分析方法对不同转移部位的前列腺癌肿瘤进行基因分析。文章提出了一般性的基因表达数据预处理和分析方法来过滤显著基因，并采用机器学习模型和次要肿瘤分类来进一步过滤关键基因。最后，本文对不同类型前列腺癌细胞系样本进行了基因共表达网络分析和社区检测。文章筛选出了与前列腺癌转移相关的13个基因，交叉验证下准确率达到了92%。此外，本文还提供了共表达模式的初步见解。",
    "tldr": "本文应用数据科学、机器学习和拓扑网络分析方法对不同转移部位的前列腺癌肿瘤进行了基因分析，筛选出了与前列腺癌转移相关的13个基因，准确率达到了92%。"
}