{
    "title": "Synergistic Graph Fusion via Encoder Embedding. (arXiv:2303.18051v1 [cs.SI])",
    "abstract": "In this paper, we introduce a novel approach to multi-graph embedding called graph fusion encoder embedding. The method is designed to work with multiple graphs that share a common vertex set. Under the supervised learning setting, we show that the resulting embedding exhibits a surprising yet highly desirable \"synergistic effect\": for sufficiently large vertex size, the vertex classification accuracy always benefits from additional graphs. We provide a mathematical proof of this effect under the stochastic block model, and identify the necessary and sufficient condition for asymptotically perfect classification. The simulations and real data experiments confirm the superiority of the proposed method, which consistently outperforms recent benchmark methods in classification.",
    "link": "http://arxiv.org/abs/2303.18051",
    "context": "Title: Synergistic Graph Fusion via Encoder Embedding. (arXiv:2303.18051v1 [cs.SI])\nAbstract: In this paper, we introduce a novel approach to multi-graph embedding called graph fusion encoder embedding. The method is designed to work with multiple graphs that share a common vertex set. Under the supervised learning setting, we show that the resulting embedding exhibits a surprising yet highly desirable \"synergistic effect\": for sufficiently large vertex size, the vertex classification accuracy always benefits from additional graphs. We provide a mathematical proof of this effect under the stochastic block model, and identify the necessary and sufficient condition for asymptotically perfect classification. The simulations and real data experiments confirm the superiority of the proposed method, which consistently outperforms recent benchmark methods in classification.",
    "path": "papers/23/03/2303.18051.json",
    "total_tokens": 757,
    "translated_title": "基于编码器嵌入的协同图融合",
    "translated_abstract": "本文提出了一种称为图融合编码器嵌入的多图嵌入新方法，该方法旨在处理具有共同顶点集的多个图。在监督学习设置下，我们证明了该方法展现出了令人惊叹但非常理想的“协同效应”：对于足够大的顶点数，分类准确度总是受益于额外的图。我们在随机块模型下提供了这种效应的数学证明，并确定了渐近完美分类的必要条件和充分条件。模拟和真实数据实验证实了所提出的方法的卓越性能，该方法在分类中始终优于最近的基准方法。",
    "tldr": "本文提出了一种协同图融合的新方法，该方法处理具有共同顶点集的多个图，有着非常理想的“协同效应”，即顶点分类准确度总是受益于额外的图，并在实验中证实了其卓越性能。",
    "en_tdlr": "This paper proposes a novel approach to multi-graph embedding called graph fusion encoder embedding, which exhibits a highly desirable \"synergistic effect\" under supervised learning setting. The method consistently outperforms recent benchmark methods in classification, as confirmed by simulations and real data experiments."
}