{
    "title": "Removing confounding information from fetal ultrasound images. (arXiv:2303.13918v1 [cs.CV])",
    "abstract": "Confounding information in the form of text or markings embedded in medical images can severely affect the training of diagnostic deep learning algorithms. However, data collected for clinical purposes often have such markings embedded in them. In dermatology, known examples include drawings or rulers that are overrepresented in images of malignant lesions. In this paper, we encounter text and calipers placed on the images found in national databases containing fetal screening ultrasound scans, which correlate with standard planes to be predicted. In order to utilize the vast amounts of data available in these databases, we develop and validate a series of methods for minimizing the confounding effects of embedded text and calipers on deep learning algorithms designed for ultrasound, using standard plane classification as a test case.",
    "link": "http://arxiv.org/abs/2303.13918",
    "context": "Title: Removing confounding information from fetal ultrasound images. (arXiv:2303.13918v1 [cs.CV])\nAbstract: Confounding information in the form of text or markings embedded in medical images can severely affect the training of diagnostic deep learning algorithms. However, data collected for clinical purposes often have such markings embedded in them. In dermatology, known examples include drawings or rulers that are overrepresented in images of malignant lesions. In this paper, we encounter text and calipers placed on the images found in national databases containing fetal screening ultrasound scans, which correlate with standard planes to be predicted. In order to utilize the vast amounts of data available in these databases, we develop and validate a series of methods for minimizing the confounding effects of embedded text and calipers on deep learning algorithms designed for ultrasound, using standard plane classification as a test case.",
    "path": "papers/23/03/2303.13918.json",
    "total_tokens": 771,
    "translated_title": "去除胎儿超声图像中的混淆信息。",
    "translated_abstract": "医学图像中嵌入的文本或标记等混淆信息可能会严重影响诊断深度学习算法的训练。然而，为临床目的收集的数据通常拥有这样的标记。在皮肤学中，已知存在将图像中恶性病变过度展示的绘画或标尺等标记。本文中，我们发现了嵌入在国家数据库中包含胎儿筛查超声扫描图像中的文本和卡尺，这些图像与需要预测的标准平面相关。为了利用这些数据库中可用的大量数据，我们开发并验证了一系列最小化嵌入文本和卡尺对超声诊断深度学习算法影响的方法，以标准平面分类作为测试案例。",
    "tldr": "本文讨论了如何针对胎儿筛查超声扫描图像中的文本和卡尺去除混淆信息，以训练更加准确的超声诊断深度学习算法。",
    "en_tdlr": "This paper discusses methods for removing confounding information in the form of text and calipers from ultrasound images of fetal screening, to train more accurate deep learning algorithms for ultrasound diagnosis."
}