{
    "title": "Requirements Engineering Framework for Human-centered Artificial Intelligence Software Systems. (arXiv:2303.02920v2 [cs.SE] UPDATED)",
    "abstract": "[Context] Artificial intelligence (AI) components used in building software solutions have substantially increased in recent years. However, many of these solutions focus on technical aspects and ignore critical human-centered aspects. [Objective] Including human-centered aspects during requirements engineering (RE) when building AI-based software can help achieve more responsible, unbiased, and inclusive AI-based software solutions. [Method] In this paper, we present a new framework developed based on human-centered AI guidelines and a user survey to aid in collecting requirements for human-centered AI-based software. We provide a catalog to elicit these requirements and a conceptual model to present them visually. [Results] The framework is applied to a case study to elicit and model requirements for enhancing the quality of 360 degree~videos intended for virtual reality (VR) users. [Conclusion] We found that our proposed approach helped the project team fully understand the human-ce",
    "link": "http://arxiv.org/abs/2303.02920",
    "context": "Title: Requirements Engineering Framework for Human-centered Artificial Intelligence Software Systems. (arXiv:2303.02920v2 [cs.SE] UPDATED)\nAbstract: [Context] Artificial intelligence (AI) components used in building software solutions have substantially increased in recent years. However, many of these solutions focus on technical aspects and ignore critical human-centered aspects. [Objective] Including human-centered aspects during requirements engineering (RE) when building AI-based software can help achieve more responsible, unbiased, and inclusive AI-based software solutions. [Method] In this paper, we present a new framework developed based on human-centered AI guidelines and a user survey to aid in collecting requirements for human-centered AI-based software. We provide a catalog to elicit these requirements and a conceptual model to present them visually. [Results] The framework is applied to a case study to elicit and model requirements for enhancing the quality of 360 degree~videos intended for virtual reality (VR) users. [Conclusion] We found that our proposed approach helped the project team fully understand the human-ce",
    "path": "papers/23/03/2303.02920.json",
    "total_tokens": 962,
    "translated_title": "面向以人为中心的人工智能软件系统的需求工程框架",
    "translated_abstract": "[背景] 近年来，用于构建软件解决方案的人工智能（AI）组件显著增加。然而，许多解决方案侧重于技术方面，忽略了关键的以人为中心的方面。[目标] 在构建基于人工智能的软件时包含以人为中心的方面，可以帮助实现更负责任、无偏见和包容性的基于人工智能的软件解决方案。[方法] 本文提出了一个新的框架，基于人工智能的以人为中心的指南和用户调查开发，以帮助收集人工智能的以人为中心的软件需求。我们提供一个目录来引出这些需求，以及一个概念模型来直观地呈现它们。[结果] 框架应用于一个案例研究中，以引出和建模增强360度视频质量的需求，该视频旨在为虚拟现实用户提供。[结论] 我们发现，我们提出的方法帮助项目团队充分了解以人为中心的方面，并提高了最终的软件解决方案的质量和可靠性。",
    "tldr": "该研究提出了一个基于以人为中心的人工智能指南和用户调查开发的框架，以帮助收集和建模人工智能的以人为中心的软件需求，并在一项案例研究中成功应用于提高360度视频质量。",
    "en_tdlr": "This study proposes a framework developed based on human-centered AI guidelines and a user survey to collect and model human-centered AI-based software requirements, successfully applied to enhance the quality of 360-degree videos through a case study."
}