{
    "title": "Training, Architecture, and Prior for Deterministic Uncertainty Methods. (arXiv:2303.05796v1 [cs.LG])",
    "abstract": "Accurate and efficient uncertainty estimation is crucial to build reliable Machine Learning (ML) models capable to provide calibrated uncertainty estimates, generalize and detect Out-Of-Distribution (OOD) datasets. To this end, Deterministic Uncertainty Methods (DUMs) is a promising model family capable to perform uncertainty estimation in a single forward pass. This work investigates important design choices in DUMs: (1) we show that training schemes decoupling the core architecture and the uncertainty head schemes can significantly improve uncertainty performances. (2) we demonstrate that the core architecture expressiveness is crucial for uncertainty performance and that additional architecture constraints to avoid feature collapse can deteriorate the trade-off between OOD generalization and detection. (3) Contrary to other Bayesian models, we show that the prior defined by DUMs do not have a strong effect on the final performances.",
    "link": "http://arxiv.org/abs/2303.05796",
    "raw_ret": "{\n    \"translated_title\": \"确定性不确定性方法的训练、架构和先验\",\n    \"translated_abstract\": \"准确高效的不确定性估计对于构建可靠的机器学习模型非常重要，这些模型能够提供校准的不确定性估计、推广并检测超出分布的数据集。为此，确定性不确定性方法（DUMs）是一种有前途的模型族，能够在单次前向传递中执行不确定性估计。本文研究了DUM中的重要设计选择：(1)我们表明，解耦核心架构和不确定性头方案的训练方案可以显著提高不确定性性能。(2)我们证明了核心架构的表达能力对不确定性性能至关重要，并且避免特征崩溃的其他架构约束可能会恶化OOD概括和检测之间的平衡。(3)与其他贝叶斯模型相反，我们表明DUMs定义的先验不会对最终性能产生强烈的影响。\",\n    \"tldr\": \"这项工作研究了确定性不确定性方法中的重要设计选择，包括解耦核心架构和不确定性头方案的训练方案、核心架构的表达能力对不确定性性能至关重要，以及与其他贝叶斯模型相反，DUMs定义的先验不会对最终性能产生强烈的影响。\"\n}<|im_sep|>",
    "total_tokens": 877,
    "ret": {
        "translated_title": "确定性不确定性方法的训练、架构和先验",
        "translated_abstract": "准确高效的不确定性估计对于构建可靠的机器学习模型非常重要，这些模型能够提供校准的不确定性估计、推广并检测超出分布的数据集。为此，确定性不确定性方法（DUMs）是一种有前途的模型族，能够在单次前向传递中执行不确定性估计。本文研究了DUM中的重要设计选择：(1)我们表明，解耦核心架构和不确定性头方案的训练方案可以显著提高不确定性性能。(2)我们证明了核心架构的表达能力对不确定性性能至关重要，并且避免特征崩溃的其他架构约束可能会恶化OOD概括和检测之间的平衡。(3)与其他贝叶斯模型相反，我们表明DUMs定义的先验不会对最终性能产生强烈的影响。",
        "tldr": "这项工作研究了确定性不确定性方法中的重要设计选择，包括解耦核心架构和不确定性头方案的训练方案、核心架构的表达能力对不确定性性能至关重要，以及与其他贝叶斯模型相反，DUMs定义的先验不会对最终性能产生强烈的影响。"
    }
}