{
    "title": "ERSAM: Neural Architecture Search For Energy-Efficient and Real-Time Social Ambiance Measurement. (arXiv:2303.10727v2 [cs.LG] UPDATED)",
    "abstract": "Social ambiance describes the context in which social interactions happen, and can be measured using speech audio by counting the number of concurrent speakers. This measurement has enabled various mental health tracking and human-centric IoT applications. While on-device Socal Ambiance Measure (SAM) is highly desirable to ensure user privacy and thus facilitate wide adoption of the aforementioned applications, the required computational complexity of state-of-the-art deep neural networks (DNNs) powered SAM solutions stands at odds with the often constrained resources on mobile devices. Furthermore, only limited labeled data is available or practical when it comes to SAM under clinical settings due to various privacy constraints and the required human effort, further challenging the achievable accuracy of on-device SAM solutions. To this end, we propose a dedicated neural architecture search framework for Energy-efficient and Real-time SAM (ERSAM). Specifically, our ERSAM framework can",
    "link": "http://arxiv.org/abs/2303.10727",
    "context": "Title: ERSAM: Neural Architecture Search For Energy-Efficient and Real-Time Social Ambiance Measurement. (arXiv:2303.10727v2 [cs.LG] UPDATED)\nAbstract: Social ambiance describes the context in which social interactions happen, and can be measured using speech audio by counting the number of concurrent speakers. This measurement has enabled various mental health tracking and human-centric IoT applications. While on-device Socal Ambiance Measure (SAM) is highly desirable to ensure user privacy and thus facilitate wide adoption of the aforementioned applications, the required computational complexity of state-of-the-art deep neural networks (DNNs) powered SAM solutions stands at odds with the often constrained resources on mobile devices. Furthermore, only limited labeled data is available or practical when it comes to SAM under clinical settings due to various privacy constraints and the required human effort, further challenging the achievable accuracy of on-device SAM solutions. To this end, we propose a dedicated neural architecture search framework for Energy-efficient and Real-time SAM (ERSAM). Specifically, our ERSAM framework can",
    "path": "papers/23/03/2303.10727.json",
    "total_tokens": 1143,
    "translated_title": "ERSAM: 面向能源高效和实时社交氛围测量的神经架构搜索",
    "translated_abstract": "社交氛围描述了社交互动发生的背景，可以使用语音音频通过计算同时发言者的数量来测量。这种测量已经实现了各种心理健康跟踪和面向人类的物联网应用。虽然设备上的社交氛围测量 (SAM) 非常理想，以确保用户隐私并促进上述应用的广泛采用，但最先进的深度神经网络（DNNs）驱动的SAM解决方案所需的计算复杂度与移动设备上的常见资源相矛盾。此外，在临床设置下，由于各种隐私限制和所需的人力劳动，只有有限的标记数据可用或实际可行，这进一步挑战了设备上SAM解决方案的可实现准确性。为此，我们提出了一个专门的神经架构搜索框架，用于面向能源高效和实时SAM的ERSAM。具体而言，我们的ERSAM框架可以自动搜索适合SAM任务的神经网络架构，并满足能源效率、实时处理和有限标签数据的严格要求。我们在基准数据集上展示了我们提出的ERSAM框架的有效性，它优于最先进的SAM解决方案，并提高了精度和效率。",
    "tldr": "本文提出了一种面向能源高效性和实时性的社交氛围测量神经网络架构搜索框架ERSAM。该框架可以自动搜索适合SAM任务的神经网络架构，并满足能源效率、实时处理和有限标签数据的要求。在基准数据集上，该框架优于现有解决方案，具有更好的精度和效率。"
}