{
    "title": "Variational formulations of ODE-Net as a mean-field optimal control problem and existence results. (arXiv:2303.05924v2 [math.AP] UPDATED)",
    "abstract": "This paper presents a mathematical analysis of ODE-Net, a continuum model of deep neural networks (DNNs). In recent years, Machine Learning researchers have introduced ideas of replacing the deep structure of DNNs with ODEs as a continuum limit. These studies regard the \"learning\" of ODE-Net as the minimization of a \"loss\" constrained by a parametric ODE. Although the existence of a minimizer for this minimization problem needs to be assumed, only a few studies have investigated its existence analytically in detail. In the present paper, the existence of a minimizer is discussed based on a formulation of ODE-Net as a measure-theoretic mean-field optimal control problem. The existence result is proved when a neural network, which describes a vector field of ODE-Net, is linear with respect to learnable parameters. The proof employs the measure-theoretic formulation combined with the direct method of Calculus of Variations. Secondly, an idealized minimization problem is proposed to remove",
    "link": "http://arxiv.org/abs/2303.05924",
    "context": "Title: Variational formulations of ODE-Net as a mean-field optimal control problem and existence results. (arXiv:2303.05924v2 [math.AP] UPDATED)\nAbstract: This paper presents a mathematical analysis of ODE-Net, a continuum model of deep neural networks (DNNs). In recent years, Machine Learning researchers have introduced ideas of replacing the deep structure of DNNs with ODEs as a continuum limit. These studies regard the \"learning\" of ODE-Net as the minimization of a \"loss\" constrained by a parametric ODE. Although the existence of a minimizer for this minimization problem needs to be assumed, only a few studies have investigated its existence analytically in detail. In the present paper, the existence of a minimizer is discussed based on a formulation of ODE-Net as a measure-theoretic mean-field optimal control problem. The existence result is proved when a neural network, which describes a vector field of ODE-Net, is linear with respect to learnable parameters. The proof employs the measure-theoretic formulation combined with the direct method of Calculus of Variations. Secondly, an idealized minimization problem is proposed to remove",
    "path": "papers/23/03/2303.05924.json",
    "total_tokens": 944,
    "translated_title": "ODE-Net的变分形式：均场最优控制问题及存在性结果",
    "translated_abstract": "本文对ODE-Net进行了数学分析，它是深度神经网络（DNN）的连续模型。近年来，机器学习研究人员提出了用ODE代替DNN深度结构作为连续极限的想法。这些研究将ODE-Net的\"学习\"视为最小化由参数ODE约束的\"损失\"。虽然需要假定该最小化问题的存在，但只有少数研究详细地分析了其存在性。本文将ODE-Net的形式化表述为一种测度论均场最优控制问题，并基于此讨论了最小化器的存在性结果。当描述ODE-Net向量场的神经网络针对可学习参数是线性的时，证明了最小化器的存在性。证明使用测度论形式化和变分法的直接方法相结合。其次，本文提出了一个理想化的最小化问题，以消除针对基于边界条件的\"恒等\"ODE的最优控制问题的一些技术困难。",
    "tldr": "本文探讨了ODE-Net在最小化损失函数的同时约束参数ODE的数学问题，并提出了一种测度论均场最优控制问题的形式化表述，并针对线性神经网络证明了最小化器的存在性结果。",
    "en_tdlr": "This paper discusses the mathematical problem of ODE-Net, which minimizes the loss function while constraining the parameter ODE, and proposes a formalization of measure-theoretic mean-field optimal control problem, and proves the existence of a minimizer for linear neural networks."
}