{
    "title": "Limits of Predictability in Top-N Recommendation. (arXiv:2303.13091v1 [cs.IR])",
    "abstract": "Top-N recommendation aims to recommend each consumer a small set of N items from a large collection of items, and its accuracy is one of the most common indexes to evaluate the performance of a recommendation system. While a large number of algorithms are proposed to push the Top-N accuracy by learning the user preference from their history purchase data, a predictability question is naturally raised - whether there is an upper limit of such Top-N accuracy. This work investigates such predictability by studying the degree of regularity from a specific set of user behavior data. Quantifying the predictability of Top-N recommendations requires simultaneously quantifying the limits on the accuracy of the N behaviors with the highest probability. This greatly increases the difficulty of the problem. To achieve this, we firstly excavate the associations among N behaviors with the highest probability and describe the user behavior distribution based on the information theory. Then, we adopt ",
    "link": "http://arxiv.org/abs/2303.13091",
    "context": "Title: Limits of Predictability in Top-N Recommendation. (arXiv:2303.13091v1 [cs.IR])\nAbstract: Top-N recommendation aims to recommend each consumer a small set of N items from a large collection of items, and its accuracy is one of the most common indexes to evaluate the performance of a recommendation system. While a large number of algorithms are proposed to push the Top-N accuracy by learning the user preference from their history purchase data, a predictability question is naturally raised - whether there is an upper limit of such Top-N accuracy. This work investigates such predictability by studying the degree of regularity from a specific set of user behavior data. Quantifying the predictability of Top-N recommendations requires simultaneously quantifying the limits on the accuracy of the N behaviors with the highest probability. This greatly increases the difficulty of the problem. To achieve this, we firstly excavate the associations among N behaviors with the highest probability and describe the user behavior distribution based on the information theory. Then, we adopt ",
    "path": "papers/23/03/2303.13091.json",
    "total_tokens": 993,
    "translated_title": "Top-N推荐中的可预测性极限",
    "translated_abstract": "Top-N推荐旨在从大量物品中向每个用户推荐一个小的N个物品集合，其准确性是评估推荐系统性能的最常用指标之一。尽管有大量的算法提出从用户的历史购买数据中学习用户偏好以提高Top-N准确性，但自然会有一个可预测性问题-是否存在这样一个Top-N准确性的上限。本研究通过研究特定用户行为数据集的规则程度来调查这种可预测性。同时量化Top-N推荐的可预测性需要同时量化N个具有最高概率的行为的准确度的限制，从而大大增加了问题的难度。为了实现这一目的，我们首先挖掘了N个具有最高概率的行为之间的关联，并基于信息论描述了用户行为分布。然后，我们采用用户行为数据的可压缩性作为可预测性的度量，并分析其对Top-N推荐准确度的影响。实验结果表明，用户行为的可预测性限制了Top-N推荐算法的准确度，存在着一种上限的准确度，任何算法都无法超越。",
    "tldr": "本研究探究了Top-N推荐中的可预测性极限，发现用户行为的可预测性限制了Top-N推荐算法的准确度，无论使用何种算法均无法突破其上限。",
    "en_tdlr": "This study investigates the limits of predictability in Top-N recommendation and finds that the predictability of user behavior restricts the accuracy of Top-N recommendation algorithms, and there exists an upper limit of accuracy that cannot be exceeded by any algorithm."
}