{
    "title": "Classifying the evolution of COVID-19 severity on patients with combined dynamic Bayesian networks and neural networks. (arXiv:2303.05972v1 [cs.LG])",
    "abstract": "When we face patients arriving to a hospital suffering from the effects of some illness, one of the main problems we can encounter is evaluating whether or not said patients are going to require intensive care in the near future. This intensive care requires allotting valuable and scarce resources, and knowing beforehand the severity of a patients illness can improve both its treatment and the organization of resources. We illustrate this issue in a dataset consistent of Spanish COVID-19 patients from the sixth epidemic wave where we label patients as critical when they either had to enter the intensive care unit or passed away. We then combine the use of dynamic Bayesian networks, to forecast the vital signs and the blood analysis results of patients over the next 40 hours, and neural networks, to evaluate the severity of a patients disease in that interval of time. Our empirical results show that the transposition of the current state of a patient to future values with the DBN for it",
    "link": "http://arxiv.org/abs/2303.05972",
    "raw_ret": "{\n    \"translated_title\": \"采用动态贝叶斯网络和神经网络对COVID-19患者病情演变进行分类\",\n    \"translated_abstract\": \"当我们面对到达医院的患者患病的影响时，我们会面临一个主要问题，即评估这些患者是否在不久的将来需要重症监护。这种重症监护需要分配宝贵而稀缺的资源，预先知道患者疾病的严重程度可以改善其治疗和资源组织。我们在由西班牙COVID-19患者组成的数据集中说明了这个问题，其中我们将患者标记为重症患者，当他们不得不进入重症监护室或去世时。然后，我们结合使用动态贝叶斯网络，对未来40小时内患者的生命体征和血液分析结果进行预测，并使用神经网络评估患者在该时间间隔内的疾病严重程度。我们的实证结果表明，使用DBN将患者当前状态转移到未来值可以提高模型的准确性，我们的模型具有很高的分类准确性。\",\n    \"tldr\": \"本研究采用动态贝叶斯网络和神经网络，对COVID-19患者的病情进行预测分类，该模型具有较高的分类准确性。\"\n}",
    "total_tokens": 886,
    "ret": {
        "translated_title": "采用动态贝叶斯网络和神经网络对COVID-19患者病情演变进行分类",
        "translated_abstract": "当我们面对到达医院的患者患病的影响时，我们会面临一个主要问题，即评估这些患者是否在不久的将来需要重症监护。这种重症监护需要分配宝贵而稀缺的资源，预先知道患者疾病的严重程度可以改善其治疗和资源组织。我们在由西班牙COVID-19患者组成的数据集中说明了这个问题，其中我们将患者标记为重症患者，当他们不得不进入重症监护室或去世时。然后，我们结合使用动态贝叶斯网络，对未来40小时内患者的生命体征和血液分析结果进行预测，并使用神经网络评估患者在该时间间隔内的疾病严重程度。我们的实证结果表明，使用DBN将患者当前状态转移到未来值可以提高模型的准确性，我们的模型具有很高的分类准确性。",
        "tldr": "本研究采用动态贝叶斯网络和神经网络，对COVID-19患者的病情进行预测分类，该模型具有较高的分类准确性。"
    }
}