{
    "title": "ENVIDR: Implicit Differentiable Renderer with Neural Environment Lighting. (arXiv:2303.13022v1 [cs.CV])",
    "abstract": "Recent advances in neural rendering have shown great potential for reconstructing scenes from multiview images. However, accurately representing objects with glossy surfaces remains a challenge for existing methods. In this work, we introduce ENVIDR, a rendering and modeling framework for high-quality rendering and reconstruction of surfaces with challenging specular reflections. To achieve this, we first propose a novel neural renderer with decomposed rendering components to learn the interaction between surface and environment lighting. This renderer is trained using existing physically based renderers and is decoupled from actual scene representations. We then propose an SDF-based neural surface model that leverages this learned neural renderer to represent general scenes. Our model additionally synthesizes indirect illuminations caused by inter-reflections from shiny surfaces by marching surface-reflected rays. We demonstrate that our method outperforms state-of-art methods on chal",
    "link": "http://arxiv.org/abs/2303.13022",
    "context": "Title: ENVIDR: Implicit Differentiable Renderer with Neural Environment Lighting. (arXiv:2303.13022v1 [cs.CV])\nAbstract: Recent advances in neural rendering have shown great potential for reconstructing scenes from multiview images. However, accurately representing objects with glossy surfaces remains a challenge for existing methods. In this work, we introduce ENVIDR, a rendering and modeling framework for high-quality rendering and reconstruction of surfaces with challenging specular reflections. To achieve this, we first propose a novel neural renderer with decomposed rendering components to learn the interaction between surface and environment lighting. This renderer is trained using existing physically based renderers and is decoupled from actual scene representations. We then propose an SDF-based neural surface model that leverages this learned neural renderer to represent general scenes. Our model additionally synthesizes indirect illuminations caused by inter-reflections from shiny surfaces by marching surface-reflected rays. We demonstrate that our method outperforms state-of-art methods on chal",
    "path": "papers/23/03/2303.13022.json",
    "total_tokens": 941,
    "translated_title": "ENVIDR: 具有神经环境光照的隐式可微分渲染器",
    "translated_abstract": "近期神经渲染的进展显示出从多视图图像重建场景的巨大潜力，然而现有方法在准确表示具有光泽表面的物体方面仍然存在挑战。本文提出了 ENVIDR，一种用于高质量渲染和重构具有挑战性的镜面反射表面的渲染和建模框架。为了实现这一目标，我们首先提出了一种新颖的神经渲染器，并采用分解渲染组件来学习表面和环境光照的相互作用。该渲染器使用现有的物理渲染器进行训练，并与实际场景表示分离。接着，我们提出了一种基于 SDF 的神经表面模型，利用这个已学习的神经渲染器来表示一般的场景。我们的模型还通过行进表面反射的光线来合成由闪亮表面引起的间接光照。我们证明了我们的方法在处理具有光泽表面和镜面反射时，在具有挑战性的数据集上优于现有方法。",
    "tldr": "本文介绍了一种名为ENVIDR的渲染和建模框架，在渲染具有挑战性的镜面反射表面方面表现出卓越性能，集成了神经渲染器和基于SDF的神经表面模型。",
    "en_tdlr": "The paper introduces a rendering and modeling framework named ENVIDR, which achieves excellent performance in rendering challenging surfaces with specular reflections, incorporating a neural renderer and an SDF-based neural surface model."
}