{
    "title": "Dynamic Vertex Replacement Grammars. (arXiv:2303.11553v1 [cs.LG])",
    "abstract": "Context-free graph grammars have shown a remarkable ability to model structures in real-world relational data. However, graph grammars lack the ability to capture time-changing phenomena since the left-to-right transitions of a production rule do not represent temporal change. In the present work, we describe dynamic vertex-replacement grammars (DyVeRG), which generalize vertex replacement grammars in the time domain by providing a formal framework for updating a learned graph grammar in accordance with modifications to its underlying data. We show that DyVeRG grammars can be learned from, and used to generate, real-world dynamic graphs faithfully while remaining human-interpretable. We also demonstrate their ability to forecast by computing dyvergence scores, a novel graph similarity measurement exposed by this framework.",
    "link": "http://arxiv.org/abs/2303.11553",
    "context": "Title: Dynamic Vertex Replacement Grammars. (arXiv:2303.11553v1 [cs.LG])\nAbstract: Context-free graph grammars have shown a remarkable ability to model structures in real-world relational data. However, graph grammars lack the ability to capture time-changing phenomena since the left-to-right transitions of a production rule do not represent temporal change. In the present work, we describe dynamic vertex-replacement grammars (DyVeRG), which generalize vertex replacement grammars in the time domain by providing a formal framework for updating a learned graph grammar in accordance with modifications to its underlying data. We show that DyVeRG grammars can be learned from, and used to generate, real-world dynamic graphs faithfully while remaining human-interpretable. We also demonstrate their ability to forecast by computing dyvergence scores, a novel graph similarity measurement exposed by this framework.",
    "path": "papers/23/03/2303.11553.json",
    "total_tokens": 800,
    "translated_title": "动态顶点替换文法",
    "translated_abstract": "上下文无关图文法已经显示出在现实世界中建模结构的惊人能力。然而，图文法缺乏捕捉时变现象的能力，因为产生规则的从左到右的转换不表示时间变化。在本文中，我们描述动态顶点替换文法（DyVeRG），它们在时间域中推广了顶点替换文法，通过为学习图文法更新提供形式框架，以符合其基础数据的修改。我们展示了DyVeRG文法可以从真实世界的动态图中进行学习，并被用于忠实地生成这些图，同时保持可解释性。我们还通过计算DyVeRG曲线生成的德沃尔贝格差异分数（dyvergence scores），展示了它们的预测能力，这是由该框架引出的一种新的图相似度度量。",
    "tldr": "本文提出动态顶点替换文法（DyVeRG），它们提供一种在时间域内更新学习图文法的形式框架，用于生成和预测真实世界的动态图，同时保持了人类可解释性。",
    "en_tdlr": "This paper proposes dynamic vertex-replacement grammars (DyVeRG), which provide a formal framework for updating a learned graph grammar in the time domain, to generate and predict real-world dynamic graphs while remaining human-interpretable."
}