{
    "title": "Anti-DreamBooth: Protecting users from personalized text-to-image synthesis. (arXiv:2303.15433v2 [cs.CV] UPDATED)",
    "abstract": "Text-to-image diffusion models are nothing but a revolution, allowing anyone, even without design skills, to create realistic images from simple text inputs. With powerful personalization tools like DreamBooth, they can generate images of a specific person just by learning from his/her few reference images. However, when misused, such a powerful and convenient tool can produce fake news or disturbing content targeting any individual victim, posing a severe negative social impact. In this paper, we explore a defense system called Anti-DreamBooth against such malicious use of DreamBooth. The system aims to add subtle noise perturbation to each user's image before publishing in order to disrupt the generation quality of any DreamBooth model trained on these perturbed images. We investigate a wide range of algorithms for perturbation optimization and extensively evaluate them on two facial datasets over various text-to-image model versions. Despite the complicated formulation of DreamBooth",
    "link": "http://arxiv.org/abs/2303.15433",
    "context": "Title: Anti-DreamBooth: Protecting users from personalized text-to-image synthesis. (arXiv:2303.15433v2 [cs.CV] UPDATED)\nAbstract: Text-to-image diffusion models are nothing but a revolution, allowing anyone, even without design skills, to create realistic images from simple text inputs. With powerful personalization tools like DreamBooth, they can generate images of a specific person just by learning from his/her few reference images. However, when misused, such a powerful and convenient tool can produce fake news or disturbing content targeting any individual victim, posing a severe negative social impact. In this paper, we explore a defense system called Anti-DreamBooth against such malicious use of DreamBooth. The system aims to add subtle noise perturbation to each user's image before publishing in order to disrupt the generation quality of any DreamBooth model trained on these perturbed images. We investigate a wide range of algorithms for perturbation optimization and extensively evaluate them on two facial datasets over various text-to-image model versions. Despite the complicated formulation of DreamBooth",
    "path": "papers/23/03/2303.15433.json",
    "total_tokens": 1003,
    "translated_title": "抵抗个性化文本生成图像的反梦幻机：保护用户免受伪造图像的侵害",
    "translated_abstract": "文本生成图像扩散模型是一场革命，它使得任何人，甚至没有设计技巧的人，都能够从简单的文本输入中创建逼真的图像。像梦幻机这样的强大个性化工具能够通过学习目标人物的几张参考图片生成该人物的图像。然而，当被滥用时，这种强大而方便的工具可能会产生虚假新闻或针对任何个人受害者的令人不安的内容，给社会带来严重的负面影响。本文中，我们探讨了一种名为反梦幻机的防御系统，以对抗对梦幻机的恶意使用。该系统旨在在发布用户图像之前向每个用户的图像添加微小的噪声扰动，以干扰对这些扰动图像进行训练的任何梦幻机模型的生成质量。我们对扰动优化的多种算法进行了广泛的研究，并在两个面部数据集上对各种文本生成图像模型版本进行了详细评估。尽管梦幻机的公式复杂，但我们发现了一种高效的防御方法。",
    "tldr": "本文介绍了一种名为反梦幻机的防御系统，通过向用户图像添加微小的噪声扰动来保护用户免受个性化文本生成图像的恶意使用，从而避免产生虚假新闻或针对个人受害者的令人不安的内容。",
    "en_tdlr": "This paper presents a defense system called Anti-DreamBooth that protects users from malicious use of personalized text-to-image synthesis by adding subtle noise perturbation to user images, preventing the generation of fake news or disturbing content targeting individual victims."
}