{
    "title": "Traffic Sign Recognition Dataset and Data Augmentation. (arXiv:2303.18037v1 [cs.CV])",
    "abstract": "Although there are many datasets for traffic sign classification, there are few datasets collected for traffic sign recognition and few of them obtain enough instances especially for training a model with the deep learning method. The deep learning method is almost the only way to train a model for real-world usage that covers various highly similar classes compared with the traditional way such as through color, shape, etc. Also, for some certain sign classes, their sign meanings were destined to can't get enough instances in the dataset. To solve this problem, we purpose a unique data augmentation method for the traffic sign recognition dataset that takes advantage of the standard of the traffic sign. We called it TSR dataset augmentation. We based on the benchmark Tsinghua-Tencent 100K (TT100K) dataset to verify the unique data augmentation method. we performed the method on four main iteration version datasets based on the TT100K dataset and the experimental results showed our meth",
    "link": "http://arxiv.org/abs/2303.18037",
    "context": "Title: Traffic Sign Recognition Dataset and Data Augmentation. (arXiv:2303.18037v1 [cs.CV])\nAbstract: Although there are many datasets for traffic sign classification, there are few datasets collected for traffic sign recognition and few of them obtain enough instances especially for training a model with the deep learning method. The deep learning method is almost the only way to train a model for real-world usage that covers various highly similar classes compared with the traditional way such as through color, shape, etc. Also, for some certain sign classes, their sign meanings were destined to can't get enough instances in the dataset. To solve this problem, we purpose a unique data augmentation method for the traffic sign recognition dataset that takes advantage of the standard of the traffic sign. We called it TSR dataset augmentation. We based on the benchmark Tsinghua-Tencent 100K (TT100K) dataset to verify the unique data augmentation method. we performed the method on four main iteration version datasets based on the TT100K dataset and the experimental results showed our meth",
    "path": "papers/23/03/2303.18037.json",
    "total_tokens": 956,
    "translated_title": "交通标志识别数据集与数据增强",
    "translated_abstract": "尽管有许多交通标志分类的数据集，但很少有收集用于交通标志识别的数据集，其中只有很少的数据集能够获取足够的实例来训练深度学习模型。 深度学习方法几乎是唯一的途径，可用于训练涵盖与传统方法（如通过颜色、形状等）相比高度相似类别的真实世界使用模型。同样，对于某些特定标志类别，它们的标志含义注定无法在数据集中获得足够的实例。为解决这个问题，我们提出了一种独特的交通标志识别数据集增强方法，利用了交通标志的标准，称之为TSR数据集增强。我们基于基准清华大学-腾讯100K（TT100K）数据集来验证该独特的数据增强方法。我们对基于TT100K数据集的四个主要迭代版本数据集执行该方法，实验结果表明我们的方法显著提高了特定标志类别的性能，并在TSR数据集上实现了最先进的性能。",
    "tldr": "本论文介绍了解决交通标志识别中数据集不足的问题的方法——TSR数据集增强，以及在TT100K数据集上实现的成果，可以显著提高特定标志类别的性能并实现最先进的性能。",
    "en_tdlr": "This paper proposes a unique method, called TSR dataset augmentation, to solve the problem of insufficient dataset for traffic sign recognition. The experimental results based on the TT100K dataset showed that this method significantly improved the performance for specific sign classes and achieved state-of-the-art performance on the TSR dataset."
}