{
    "title": "Learning to Backdoor Federated Learning. (arXiv:2303.03320v2 [cs.LG] UPDATED)",
    "abstract": "In a federated learning (FL) system, malicious participants can easily embed backdoors into the aggregated model while maintaining the model's performance on the main task. To this end, various defenses, including training stage aggregation-based defenses and post-training mitigation defenses, have been proposed recently. While these defenses obtain reasonable performance against existing backdoor attacks, which are mainly heuristics based, we show that they are insufficient in the face of more advanced attacks. In particular, we propose a general reinforcement learning-based backdoor attack framework where the attacker first trains a (non-myopic) attack policy using a simulator built upon its local data and common knowledge on the FL system, which is then applied during actual FL training. Our attack framework is both adaptive and flexible and achieves strong attack performance and durability even under state-of-the-art defenses.",
    "link": "http://arxiv.org/abs/2303.03320",
    "context": "Title: Learning to Backdoor Federated Learning. (arXiv:2303.03320v2 [cs.LG] UPDATED)\nAbstract: In a federated learning (FL) system, malicious participants can easily embed backdoors into the aggregated model while maintaining the model's performance on the main task. To this end, various defenses, including training stage aggregation-based defenses and post-training mitigation defenses, have been proposed recently. While these defenses obtain reasonable performance against existing backdoor attacks, which are mainly heuristics based, we show that they are insufficient in the face of more advanced attacks. In particular, we propose a general reinforcement learning-based backdoor attack framework where the attacker first trains a (non-myopic) attack policy using a simulator built upon its local data and common knowledge on the FL system, which is then applied during actual FL training. Our attack framework is both adaptive and flexible and achieves strong attack performance and durability even under state-of-the-art defenses.",
    "path": "papers/23/03/2303.03320.json",
    "total_tokens": 875,
    "translated_title": "学习如何在联邦学习中设置后门",
    "translated_abstract": "在联邦学习（FL）系统中，恶意参与者可以轻易地将后门嵌入到聚合模型中，同时保持模型在主任务上的性能。为此，近期提出了各种防御措施，包括训练阶段的基于聚合的防御和后期防御措施。虽然这些防御措施在现有的基于启发式的后门攻击中可以获得合理的性能，但我们发现它们在面对更高级的攻击时不足以应对。特别地，我们提出了一种基于强化学习（RL）的后门攻击框架，攻击者首先使用基于其本地数据和FL系统的共同知识建立的仿真器训练一个（非近视）攻击策略，然后在实际的FL训练中应用它。我们的攻击框架既是适应性又是灵活的，并且即使在最先进的防御措施下也能实现强大的攻击性能和耐用性。",
    "tldr": "本文提出了一种基于强化学习的后门攻击框架，能够在联邦学习中成功设置后门，在现有防御措施下也具有强大的攻击性能和耐用性。",
    "en_tdlr": "The paper proposes a reinforcement learning-based backdoor attack framework that can successfully embed backdoors in federated learning and has strong attack performance and durability even under existing defenses."
}