{
    "title": "GiveMeLabeledIssues: An Open Source Issue Recommendation System. (arXiv:2303.13418v1 [cs.SE])",
    "abstract": "Developers often struggle to navigate an Open Source Software (OSS) project's issue-tracking system and find a suitable task. Proper issue labeling can aid task selection, but current tools are limited to classifying the issues according to their type (e.g., bug, question, good first issue, feature, etc.). In contrast, this paper presents a tool (GiveMeLabeledIssues) that mines project repositories and labels issues based on the skills required to solve them. We leverage the domain of the APIs involved in the solution (e.g., User Interface (UI), Test, Databases (DB), etc.) as a proxy for the required skills. GiveMeLabeledIssues facilitates matching developers' skills to tasks, reducing the burden on project maintainers. The tool obtained a precision of 83.9% when predicting the API domains involved in the issues. The replication package contains instructions on executing the tool and including new projects. A demo video is available at https://www.youtube.com/watch?v=ic2quUue7i8",
    "link": "http://arxiv.org/abs/2303.13418",
    "context": "Title: GiveMeLabeledIssues: An Open Source Issue Recommendation System. (arXiv:2303.13418v1 [cs.SE])\nAbstract: Developers often struggle to navigate an Open Source Software (OSS) project's issue-tracking system and find a suitable task. Proper issue labeling can aid task selection, but current tools are limited to classifying the issues according to their type (e.g., bug, question, good first issue, feature, etc.). In contrast, this paper presents a tool (GiveMeLabeledIssues) that mines project repositories and labels issues based on the skills required to solve them. We leverage the domain of the APIs involved in the solution (e.g., User Interface (UI), Test, Databases (DB), etc.) as a proxy for the required skills. GiveMeLabeledIssues facilitates matching developers' skills to tasks, reducing the burden on project maintainers. The tool obtained a precision of 83.9% when predicting the API domains involved in the issues. The replication package contains instructions on executing the tool and including new projects. A demo video is available at https://www.youtube.com/watch?v=ic2quUue7i8",
    "path": "papers/23/03/2303.13418.json",
    "total_tokens": 929,
    "translated_title": "GiveMeLabeledIssues：一个开放源代码的任务推荐系统",
    "translated_abstract": "开发者经常难以在开放源代码（OSS）项目的问题跟踪系统中找到合适的任务。正确的问题标记可以帮助选择任务，但当前的工具仅限于按照问题的类型（例如，错误、问题、好的第一个问题、功能等）对其进行分类。相反，本文介绍了一种工具（GiveMeLabeledIssues），它可以挖掘项目存储库并基于解决问题所需的技能对问题进行标记。我们利用解决方案涉及的API（例如，用户界面（UI）、测试、数据库（DB）等）领域作为所需技能的代理。GiveMeLabeledIssues有助于将开发者的技能与任务匹配，减轻项目维护者的负担。该工具在预测问题中涉及的API领域时获得了83.9％的精度。复制包含有关执行该工具和包含新项目的说明。演示视频可在https://www.youtube.com/watch?v=ic2quUue7i8找到。",
    "tldr": "GiveMeLabeledIssues是一个开源的任务推荐系统，利用API领域代理技能，从而可以帮助开发者更好地匹配任务，并减轻项目维护者的负担。在预测API领域时，该工具的精度达到了83.9%。",
    "en_tdlr": "GiveMeLabeledIssues is an open source task recommendation system that uses API domain as a proxy for skills required to solve the issues, helping developers better match tasks and reducing the burden on project maintainers. The tool achieved a precision of 83.9% in predicting API domains involved in the issues."
}