{
    "title": "Adaptive Interventions for Global Health: A Case Study of Malaria. (arXiv:2303.02075v2 [stat.ML] UPDATED)",
    "abstract": "Malaria can be prevented, diagnosed, and treated; however, every year, there are more than 200 million cases and 200.000 preventable deaths. Malaria remains a pressing public health concern in low- and middle-income countries, especially in sub-Saharan Africa. We describe how by means of mobile health applications, machine-learning-based adaptive interventions can strengthen malaria surveillance and treatment adherence, increase testing, measure provider skills and quality of care, improve public health by supporting front-line workers and patients (e.g., by capacity building and encouraging behavioral changes, like using bed nets), reduce test stockouts in pharmacies and clinics and informing public health for policy intervention.",
    "link": "http://arxiv.org/abs/2303.02075",
    "context": "Title: Adaptive Interventions for Global Health: A Case Study of Malaria. (arXiv:2303.02075v2 [stat.ML] UPDATED)\nAbstract: Malaria can be prevented, diagnosed, and treated; however, every year, there are more than 200 million cases and 200.000 preventable deaths. Malaria remains a pressing public health concern in low- and middle-income countries, especially in sub-Saharan Africa. We describe how by means of mobile health applications, machine-learning-based adaptive interventions can strengthen malaria surveillance and treatment adherence, increase testing, measure provider skills and quality of care, improve public health by supporting front-line workers and patients (e.g., by capacity building and encouraging behavioral changes, like using bed nets), reduce test stockouts in pharmacies and clinics and informing public health for policy intervention.",
    "path": "papers/23/03/2303.02075.json",
    "total_tokens": 832,
    "translated_title": "全球健康的自适应干预：以疟疾为例的案例研究",
    "translated_abstract": "疟疾是可以预防、诊断和治疗的疾病；但每年仍有超过两亿个病例和两万个可预防死亡。尤其在撒哈拉以南非洲的低收入和中等收入国家，疟疾仍然是一个紧迫的公共卫生问题。我们通过移动健康应用、基于机器学习的自适应干预，可以加强疟疾监测和治疗的依从性，增加检测，衡量提供者的技能和护理质量，通过支持一线工作人员和患者（如容量建设和鼓励行为变化，如使用蚊帐）改善公共卫生，减少药店和诊所的测试库存短缺并为政策干预提供信息。",
    "tldr": "介绍了如何通过移动健康应用和机器学习自适应干预来加强疟疾监测和治疗依从性，改善医护质量，提高检测率和公共卫生，减少药品短缺和为政策干预提供信息。",
    "en_tdlr": "This paper introduces how mobile health applications and machine-learning-based adaptive interventions can strengthen malaria surveillance and treatment adherence, improve healthcare quality, increase testing and public health, reduce drug shortages, and provide information for policy interventions."
}