{
    "title": "Concentration of Contractive Stochastic Approximation: Additive and Multiplicative Noise. (arXiv:2303.15740v1 [cs.LG])",
    "abstract": "In this work, we study the concentration behavior of a stochastic approximation (SA) algorithm under a contractive operator with respect to an arbitrary norm. We consider two settings where the iterates are potentially unbounded: (1) bounded multiplicative noise, and (2) additive sub-Gaussian noise. We obtain maximal concentration inequalities on the convergence errors, and show that these errors have sub-Gaussian tails in the additive noise setting, and super-polynomial tails (faster than polynomial decay) in the multiplicative noise setting. In addition, we provide an impossibility result showing that it is in general not possible to achieve sub-exponential tails for SA with multiplicative noise. To establish these results, we develop a novel bootstrapping argument that involves bounding the moment generating function of the generalized Moreau envelope of the error and the construction of an exponential supermartingale to enable using Ville's maximal inequality.  To demonstrate the a",
    "link": "http://arxiv.org/abs/2303.15740",
    "context": "Title: Concentration of Contractive Stochastic Approximation: Additive and Multiplicative Noise. (arXiv:2303.15740v1 [cs.LG])\nAbstract: In this work, we study the concentration behavior of a stochastic approximation (SA) algorithm under a contractive operator with respect to an arbitrary norm. We consider two settings where the iterates are potentially unbounded: (1) bounded multiplicative noise, and (2) additive sub-Gaussian noise. We obtain maximal concentration inequalities on the convergence errors, and show that these errors have sub-Gaussian tails in the additive noise setting, and super-polynomial tails (faster than polynomial decay) in the multiplicative noise setting. In addition, we provide an impossibility result showing that it is in general not possible to achieve sub-exponential tails for SA with multiplicative noise. To establish these results, we develop a novel bootstrapping argument that involves bounding the moment generating function of the generalized Moreau envelope of the error and the construction of an exponential supermartingale to enable using Ville's maximal inequality.  To demonstrate the a",
    "path": "papers/23/03/2303.15740.json",
    "total_tokens": 974,
    "translated_title": "合同扩张随机近似的浓度：加法和乘法噪声",
    "translated_abstract": "本文研究了在任何范数下，具有合同算子的随机逼近(SA)算法的浓度行为。 我们考虑两种情况，其中迭代可能无界：（1）有界乘法噪声，（2）加性次高斯噪声。 我们得到了关于收敛误差的极大浓度不等式，并表明这些误差在加性噪声设置下具有亚高斯尾巴，在乘法噪声设置下具有超多项式尾巴（快于多项式衰减）。 此外，我们提供了一个不可能结果，显示通常无法通过乘法噪声的SA实现亚指数尾巴。 为了确立这些结果，我们开发了一种新的自举论证，其中涉及边界误差的广义Moreau包络的矩生成函数和指数超马尔可夫构造，以启用使用Ville的极大不等式。",
    "tldr": "本文研究了具有合同算子的随机逼近算法在有界乘法噪声和加性次高斯噪声设置下的浓度行为，提供了关于收敛误差的极大浓度不等式，并表明这些误差具有亚高斯尾巴或者超多项式尾巴。同时还发现，乘法噪声情况下一般不可能实现亚指数尾巴。"
}