{
    "title": "Relative coordinates are crucial for Ulam's \"trick to the train of thought\". (arXiv:2303.08969v1 [cs.AI])",
    "abstract": "Spatial signal processing algorithms often use pre-given coordinate systems to label pixel positions. These processing algorithms are thus burdened by an external reference grid, making the acquisition of relative, intrinsic features difficult. This is in contrast to animal vision and cognition: animals recognize features without an external coordinate system. We show that a coordinate system-independent algorithm for visual signal processing is not only important for animal vision, but also fundamental for concept formation. In this paper we start with a visual object deformation transfer experiment. We then formulate an algorithm that achieves deformation-invariance with relative coordinates. The paper concludes with implications for general concept formation.",
    "link": "http://arxiv.org/abs/2303.08969",
    "context": "Title: Relative coordinates are crucial for Ulam's \"trick to the train of thought\". (arXiv:2303.08969v1 [cs.AI])\nAbstract: Spatial signal processing algorithms often use pre-given coordinate systems to label pixel positions. These processing algorithms are thus burdened by an external reference grid, making the acquisition of relative, intrinsic features difficult. This is in contrast to animal vision and cognition: animals recognize features without an external coordinate system. We show that a coordinate system-independent algorithm for visual signal processing is not only important for animal vision, but also fundamental for concept formation. In this paper we start with a visual object deformation transfer experiment. We then formulate an algorithm that achieves deformation-invariance with relative coordinates. The paper concludes with implications for general concept formation.",
    "path": "papers/23/03/2303.08969.json",
    "total_tokens": 735,
    "translated_title": "相对坐标对于乌拉姆的\"思维技巧\"至关重要(arXiv:2303.08969v1 [cs.AI])",
    "translated_abstract": "空间信号处理算法通常使用预设的坐标系来标记像素位置。这些处理算法因此负担着外部参考网格，使得获取相对内部特征变得困难。这与动物的视觉和认知不同：动物可以识别没有外部坐标系统的特征。我们展示了，一个独立于坐标系的视觉信号处理算法不仅对于动物视觉重要，而且也是概念形成的基础。本文开始展示了一个视觉物体变形传递实验，接着我们推导出了一个使用相对坐标实现变形不变性的算法。文章最后讨论了通用概念形成的影响。",
    "tldr": "本文证明了，在视觉信号处理中，相对坐标对于概念形成至关重要，在动物识别特征时也很重要。",
    "en_tdlr": "This paper demonstrates the importance of relative coordinates in concept formation and animal feature recognition in visual signal processing. The authors provide evidence that an algorithm independent of a pre-given coordinate system is fundamental and necessary for these processes."
}