{
    "title": "Graph Transformer GANs for Graph-Constrained House Generation. (arXiv:2303.08225v1 [cs.CV])",
    "abstract": "We present a novel graph Transformer generative adversarial network (GTGAN) to learn effective graph node relations in an end-to-end fashion for the challenging graph-constrained house generation task. The proposed graph-Transformer-based generator includes a novel graph Transformer encoder that combines graph convolutions and self-attentions in a Transformer to model both local and global interactions across connected and non-connected graph nodes. Specifically, the proposed connected node attention (CNA) and non-connected node attention (NNA) aim to capture the global relations across connected nodes and non-connected nodes in the input graph, respectively. The proposed graph modeling block (GMB) aims to exploit local vertex interactions based on a house layout topology. Moreover, we propose a new node classification-based discriminator to preserve the high-level semantic and discriminative node features for different house components. Finally, we propose a novel graph-based cycle-co",
    "link": "http://arxiv.org/abs/2303.08225",
    "context": "Title: Graph Transformer GANs for Graph-Constrained House Generation. (arXiv:2303.08225v1 [cs.CV])\nAbstract: We present a novel graph Transformer generative adversarial network (GTGAN) to learn effective graph node relations in an end-to-end fashion for the challenging graph-constrained house generation task. The proposed graph-Transformer-based generator includes a novel graph Transformer encoder that combines graph convolutions and self-attentions in a Transformer to model both local and global interactions across connected and non-connected graph nodes. Specifically, the proposed connected node attention (CNA) and non-connected node attention (NNA) aim to capture the global relations across connected nodes and non-connected nodes in the input graph, respectively. The proposed graph modeling block (GMB) aims to exploit local vertex interactions based on a house layout topology. Moreover, we propose a new node classification-based discriminator to preserve the high-level semantic and discriminative node features for different house components. Finally, we propose a novel graph-based cycle-co",
    "path": "papers/23/03/2303.08225.json",
    "total_tokens": 950,
    "translated_title": "基于图变换器的 GANs 用于图约束房屋生成",
    "translated_abstract": "本文提出了一种新颖的图变换器生成对抗网络 (GTGAN)，以学习端到端的有效图节点关系，以解决具有挑战性的图约束房屋生成任务。所提出的基于图变换器的生成器，包括一种新颖的图变换器编码器，它结合了 Transformer 中的图卷积和自注意力机制，以对连接和非连接图节点间的本地和全局交互进行建模。具体而言，所提出的连接节点注意力 (CNA) 和非连接节点注意力 (NNA) 旨在捕捉输入图中连接节点和非连接节点之间的全局关系。所提出的图建模块 (GMB) 旨在利用基于房屋布局拓扑的本地顶点交互。此外，我们提出了一种基于节点分类的新型鉴别器，以保留不同房屋组件的高层语义和判别性节点特征。最后，我们提出一种新的基于图的循环一致性损失，通过循环生成和重构来增强 GTGAN 的学习。",
    "tldr": "本文提出了一种基于图变换器生成对抗网络的方法，通过连接节点和非连接节点的全局关系以及基于房屋布局拓扑的本地顶点交互，实现了图约束房屋的端到端生成。",
    "en_tdlr": "This paper proposes a graph Transformer generative adversarial network (GTGAN) for graph-constrained house generation, which models both local and global interactions across connected and non-connected graph nodes through a combination of graph convolutions, self-attentions, and a novel graph modeling block. The approach also includes a node classification-based discriminator and a graph-based cycle-consistency loss for enhanced learning."
}