{
    "title": "Heart Murmur and Abnormal PCG Detection via Wavelet Scattering Transform & a 1D-CNN. (arXiv:2303.11423v1 [eess.SP])",
    "abstract": "This work leverages deep learning (DL) techniques in order to do automatic and accurate heart murmur detection from phonocardiogram (PCG) recordings. Two public PCG datasets (CirCor Digiscope 2022 dataset and PCG 2016 dataset) from Physionet online database are utilized to train and test three custom neural networks (NN): a 1D convolutional neural network (CNN), a long short-term memory (LSTM) recurrent neural network (RNN), and a convolutional RNN (C-RNN). Under our proposed method, we first do pre-processing on both datasets in order to prepare the data for the NNs. Key pre-processing steps include the following: denoising, segmentation, re-labeling of noise-only segments, data normalization, and time-frequency analysis of the PCG segments using wavelet scattering transform. To evaluate the performance of the three NNs we have implemented, we conduct four experiments, first three using PCG 2022 dataset, and fourth using PCG 2016 dataset. It turns out that our custom 1D-CNN outperform",
    "link": "http://arxiv.org/abs/2303.11423",
    "context": "Title: Heart Murmur and Abnormal PCG Detection via Wavelet Scattering Transform & a 1D-CNN. (arXiv:2303.11423v1 [eess.SP])\nAbstract: This work leverages deep learning (DL) techniques in order to do automatic and accurate heart murmur detection from phonocardiogram (PCG) recordings. Two public PCG datasets (CirCor Digiscope 2022 dataset and PCG 2016 dataset) from Physionet online database are utilized to train and test three custom neural networks (NN): a 1D convolutional neural network (CNN), a long short-term memory (LSTM) recurrent neural network (RNN), and a convolutional RNN (C-RNN). Under our proposed method, we first do pre-processing on both datasets in order to prepare the data for the NNs. Key pre-processing steps include the following: denoising, segmentation, re-labeling of noise-only segments, data normalization, and time-frequency analysis of the PCG segments using wavelet scattering transform. To evaluate the performance of the three NNs we have implemented, we conduct four experiments, first three using PCG 2022 dataset, and fourth using PCG 2016 dataset. It turns out that our custom 1D-CNN outperform",
    "path": "papers/23/03/2303.11423.json",
    "total_tokens": 859,
    "translated_title": "利用小波散射变换和1D-CNN进行听诊器心杂音和异常PCG检测",
    "translated_abstract": "本项研究利用深度学习技术对听诊器心杂音的自动和准确检测，并使用两个公共PCG数据集（CirCor Digiscope 2022和PCG 2016数据集）进行训练和测试三个自定义神经网络：一维卷积神经网络（CNN），长短期记忆（LSTM）递归神经网络（RNN）和卷积RNN（C-RNN）。",
    "tldr": "该研究提出了一种小波散射变换和1D-CNN深度学习技术结合的心杂音自动检测方法，可实现97.98%的高准确率。",
    "en_tdlr": "This study proposes an automatic detection method for heart murmurs by combining wavelet scattering transform with 1D-CNN deep learning technology, achieving a high accuracy of 97.98%."
}