{
    "title": "Forecast-Aware Model Driven LSTM. (arXiv:2303.12963v1 [cs.LG])",
    "abstract": "Poor air quality can have a significant impact on human health. The National Oceanic and Atmospheric Administration (NOAA) air quality forecasting guidance is challenged by the increasing presence of extreme air quality events due to extreme weather events such as wild fires and heatwaves. These extreme air quality events further affect human health. Traditional methods used to correct model bias make assumptions about linearity and the underlying distribution. Extreme air quality events tend to occur without a strong signal leading up to the event and this behavior tends to cause existing methods to either under or over compensate for the bias. Deep learning holds promise for air quality forecasting in the presence of extreme air quality events due to its ability to generalize and learn nonlinear problems. However, in the presence of these anomalous air quality events, standard deep network approaches that use a single network for generalizing to future forecasts, may not always provi",
    "link": "http://arxiv.org/abs/2303.12963",
    "context": "Title: Forecast-Aware Model Driven LSTM. (arXiv:2303.12963v1 [cs.LG])\nAbstract: Poor air quality can have a significant impact on human health. The National Oceanic and Atmospheric Administration (NOAA) air quality forecasting guidance is challenged by the increasing presence of extreme air quality events due to extreme weather events such as wild fires and heatwaves. These extreme air quality events further affect human health. Traditional methods used to correct model bias make assumptions about linearity and the underlying distribution. Extreme air quality events tend to occur without a strong signal leading up to the event and this behavior tends to cause existing methods to either under or over compensate for the bias. Deep learning holds promise for air quality forecasting in the presence of extreme air quality events due to its ability to generalize and learn nonlinear problems. However, in the presence of these anomalous air quality events, standard deep network approaches that use a single network for generalizing to future forecasts, may not always provi",
    "path": "papers/23/03/2303.12963.json",
    "total_tokens": 773,
    "translated_title": "预测感知的模型驱动LSTM",
    "translated_abstract": "恶劣的空气质量会对人类健康产生严重影响。由于极端天气事件（如野火和热浪）增多，NOAA的空气质量预测受到了挑战。传统方法用于改正模型偏差时做了线性假设和基础分布假设，当出现极端空气质量事件时这些方法容易产生偏差修正过度或者不足。深度学习在非线性问题中广泛应用，通过学习通用性可以应对极端空气质量事件预测的需求。然而，当存在异常空气质量事件时，使用单个网络进行未来预测的标准深度网络方法不一定总是有效。",
    "tldr": "本文旨在提出一种预测感知的模型驱动LSTM来解决空气质量预测中常见的偏差修正问题，此方法可以更好地处理极端空气质量事件。",
    "en_tdlr": "This paper aims to propose a forecast-aware model driven LSTM to solve the common bias correction problem in air quality forecasting. This method can better handle extreme air quality events."
}