{
    "title": "Beyond Multilayer Perceptrons: Investigating Complex Topologies in Neural Networks. (arXiv:2303.17925v1 [cs.NE])",
    "abstract": "In this study, we explore the impact of network topology on the approximation capabilities of artificial neural networks (ANNs), with a particular focus on complex topologies. We propose a novel methodology for constructing complex ANNs based on various topologies, including Barab\\'asi-Albert, Erd\\H{o}s-R\\'enyi, Watts-Strogatz, and multilayer perceptrons (MLPs). The constructed networks are evaluated on synthetic datasets generated from manifold learning generators, with varying levels of task difficulty and noise. Our findings reveal that complex topologies lead to superior performance in high-difficulty regimes compared to traditional MLPs. This performance advantage is attributed to the ability of complex networks to exploit the compositionality of the underlying target function. However, this benefit comes at the cost of increased forward-pass computation time and reduced robustness to graph damage. Additionally, we investigate the relationship between various topological attribute",
    "link": "http://arxiv.org/abs/2303.17925",
    "context": "Title: Beyond Multilayer Perceptrons: Investigating Complex Topologies in Neural Networks. (arXiv:2303.17925v1 [cs.NE])\nAbstract: In this study, we explore the impact of network topology on the approximation capabilities of artificial neural networks (ANNs), with a particular focus on complex topologies. We propose a novel methodology for constructing complex ANNs based on various topologies, including Barab\\'asi-Albert, Erd\\H{o}s-R\\'enyi, Watts-Strogatz, and multilayer perceptrons (MLPs). The constructed networks are evaluated on synthetic datasets generated from manifold learning generators, with varying levels of task difficulty and noise. Our findings reveal that complex topologies lead to superior performance in high-difficulty regimes compared to traditional MLPs. This performance advantage is attributed to the ability of complex networks to exploit the compositionality of the underlying target function. However, this benefit comes at the cost of increased forward-pass computation time and reduced robustness to graph damage. Additionally, we investigate the relationship between various topological attribute",
    "path": "papers/23/03/2303.17925.json",
    "total_tokens": 938,
    "translated_title": "超越多层感知器：研究神经网络中的复杂拓扑结构",
    "translated_abstract": "在本研究中，我们探讨了神经网络的网络拓扑对其近似能力的影响，特别是复杂网络拓扑结构。我们提出了一种基于各种拓扑结构构建复杂神经网络的新方法，包括Barabasi-Albert，Erdos-Renyi，Watts-Strogatz和多层感知器（MLP）。我们使用从流形学习生成器产生的合成数据集对构建的网络进行评估，其中难度和噪声水平各不相同。我们的发现表明，与传统的MLP相比，复杂拓扑结构在高难度情况下表现优异。这种性能优势归因于复杂网络利用底层目标函数的复合性能力。然而，这种好处是以前向传播计算时间的增加和图形损伤的鲁棒性的降低为代价的。此外，我们还研究了各种拓扑属性之间的关系。",
    "tldr": "本研究探索了神经网络的复杂拓扑对其近似能力的影响，发现在高难度情况下，复杂拓扑相比于传统的多层感知器表现更优异，但代价是前向传播计算时间的增加和图形损伤的鲁棒性的降低。",
    "en_tdlr": "This study investigates the impact of network topology on the approximation capabilities of artificial neural networks, revealing that complex topologies outperform traditional multilayer perceptrons in high-difficulty situations, at the cost of increased computation time and reduced robustness to graph damage."
}