{
    "title": "Characteristic Function of the Tsallis $q$-Gaussian and Its Applications in Measurement and Metrology. (arXiv:2303.08615v1 [stat.CO])",
    "abstract": "The Tsallis $q$-Gaussian distribution is a powerful generalization of the standard Gaussian distribution and is commonly used in various fields, including non-extensive statistical mechanics, financial markets, and image processing. It belongs to the $q$-distribution family, which is characterized by a non-additive entropy. Due to their versatility and practicality, $q$-Gaussians are a natural choice for modeling input quantities in measurement models. This paper presents the characteristic function of a linear combination of independent $q$-Gaussian random variables and proposes a numerical method for its inversion. The proposed technique enables the assessment of the probability distribution of output quantities in linear measurement models and the conduct of uncertainty analysis in metrology.",
    "link": "http://arxiv.org/abs/2303.08615",
    "context": "Title: Characteristic Function of the Tsallis $q$-Gaussian and Its Applications in Measurement and Metrology. (arXiv:2303.08615v1 [stat.CO])\nAbstract: The Tsallis $q$-Gaussian distribution is a powerful generalization of the standard Gaussian distribution and is commonly used in various fields, including non-extensive statistical mechanics, financial markets, and image processing. It belongs to the $q$-distribution family, which is characterized by a non-additive entropy. Due to their versatility and practicality, $q$-Gaussians are a natural choice for modeling input quantities in measurement models. This paper presents the characteristic function of a linear combination of independent $q$-Gaussian random variables and proposes a numerical method for its inversion. The proposed technique enables the assessment of the probability distribution of output quantities in linear measurement models and the conduct of uncertainty analysis in metrology.",
    "path": "papers/23/03/2303.08615.json",
    "total_tokens": 784,
    "translated_title": "Tsallis $q$-高斯函数的特征函数及其在测量与计量中的应用",
    "translated_abstract": "Tsallis $q$-高斯分布是标准高斯分布的一个强大的推广，广泛应用于非广义统计力学、金融市场和图像处理等领域。它属于$q$-分布族，其特征是非可加熵。由于其多功能性和实用性，$q$-高斯分布是模拟测量模型中的输入量的自然选择。本文介绍了独立的$q$-高斯随机变量线性组合的特征函数，并提出了其反演的数值方法。该方法使得能够评估线性测量模型中输出量的概率分布，并进行计量的不确定度分析。",
    "tldr": "本文介绍了Tsallis $q$-高斯函数的特征函数及其在测量与计量中的应用，提出了一种反演的数值方法，使得能够评估线性测量模型中输出量的概率分布，并进行计量的不确定度分析。",
    "en_tdlr": "This paper presents the characteristic function of the Tsallis $q$-Gaussian distribution and proposes a numerical method for its inversion. The proposed technique enables the assessment of the probability distribution of output quantities in linear measurement models and the conduct of uncertainty analysis in metrology."
}