{
    "title": "Diffusion-based Target Sampler for Unsupervised Domain Adaptation. (arXiv:2303.12724v1 [cs.CV])",
    "abstract": "Limited transferability hinders the performance of deep learning models when applied to new application scenarios. Recently, unsupervised domain adaptation (UDA) has achieved significant progress in addressing this issue via learning domain-invariant features. However, large domain shifts and the sample scarcity in the target domain make existing UDA methods achieve suboptimal performance. To alleviate these issues, we propose a plug-and-play Diffusion-based Target Sampler (DTS) to generate high fidelity and diversity pseudo target samples. By introducing class-conditional information, the labels of the generated target samples can be controlled. The generated samples can well simulate the data distribution of the target domain and help existing UDA methods transfer from the source domain to the target domain more easily, thus improving the transfer performance. Extensive experiments on various benchmarks demonstrate that the performance of existing UDA methods can be greatly improved ",
    "link": "http://arxiv.org/abs/2303.12724",
    "context": "Title: Diffusion-based Target Sampler for Unsupervised Domain Adaptation. (arXiv:2303.12724v1 [cs.CV])\nAbstract: Limited transferability hinders the performance of deep learning models when applied to new application scenarios. Recently, unsupervised domain adaptation (UDA) has achieved significant progress in addressing this issue via learning domain-invariant features. However, large domain shifts and the sample scarcity in the target domain make existing UDA methods achieve suboptimal performance. To alleviate these issues, we propose a plug-and-play Diffusion-based Target Sampler (DTS) to generate high fidelity and diversity pseudo target samples. By introducing class-conditional information, the labels of the generated target samples can be controlled. The generated samples can well simulate the data distribution of the target domain and help existing UDA methods transfer from the source domain to the target domain more easily, thus improving the transfer performance. Extensive experiments on various benchmarks demonstrate that the performance of existing UDA methods can be greatly improved ",
    "path": "papers/23/03/2303.12724.json",
    "total_tokens": 883,
    "translated_title": "基于扩散的无监督领域自适应目标采样器",
    "translated_abstract": "当应用到新的应用场景时，深度学习模型的有限可转移性会限制其性能。最近，通过学习域不变特征，无监督领域自适应（UDA）已经在解决这个问题方面取得了显著进展。然而，目标域中的大域漂移和样本稀缺导致现有的UDA方法表现不佳。为了缓解这些问题，我们提出了一种即插即用的基于扩散的目标采样器（DTS），以生成高保真度和多样性伪目标样本。通过引入类条件信息，可以控制生成的目标样本的标签。生成的样本可以很好地模拟目标域的数据分布，并帮助现有的UDA方法更轻松地从源域转移至目标域，从而提高了转移性能。各种基准测试的大量实验表明，现有UDA方法的性能可以得到极大的改进。",
    "tldr": "该论文提出了一种基于扩散的目标采样器，可以生成高保真度和多样性伪目标样本，它可以帮助现有的无监督领域自适应方法更容易地从源域转移至目标域并且在提高转移性能。",
    "en_tdlr": "This paper proposes a diffusion-based target sampler that can generate high-fidelity and diverse pseudo target samples to help existing unsupervised domain adaptation methods easily transfer from the source domain to the target domain, thus improving transfer performance."
}