{
    "title": "SemEval-2023 Task 10: Explainable Detection of Online Sexism. (arXiv:2303.04222v2 [cs.CL] UPDATED)",
    "abstract": "Online sexism is a widespread and harmful phenomenon. Automated tools can assist the detection of sexism at scale. Binary detection, however, disregards the diversity of sexist content, and fails to provide clear explanations for why something is sexist. To address this issue, we introduce SemEval Task 10 on the Explainable Detection of Online Sexism (EDOS). We make three main contributions: i) a novel hierarchical taxonomy of sexist content, which includes granular vectors of sexism to aid explainability; ii) a new dataset of 20,000 social media comments with fine-grained labels, along with larger unlabelled datasets for model adaptation; and iii) baseline models as well as an analysis of the methods, results and errors for participant submissions to our task.",
    "link": "http://arxiv.org/abs/2303.04222",
    "context": "Title: SemEval-2023 Task 10: Explainable Detection of Online Sexism. (arXiv:2303.04222v2 [cs.CL] UPDATED)\nAbstract: Online sexism is a widespread and harmful phenomenon. Automated tools can assist the detection of sexism at scale. Binary detection, however, disregards the diversity of sexist content, and fails to provide clear explanations for why something is sexist. To address this issue, we introduce SemEval Task 10 on the Explainable Detection of Online Sexism (EDOS). We make three main contributions: i) a novel hierarchical taxonomy of sexist content, which includes granular vectors of sexism to aid explainability; ii) a new dataset of 20,000 social media comments with fine-grained labels, along with larger unlabelled datasets for model adaptation; and iii) baseline models as well as an analysis of the methods, results and errors for participant submissions to our task.",
    "path": "papers/23/03/2303.04222.json",
    "total_tokens": 851,
    "translated_title": "SemEval-2023任务10：可解释的在线性别歧视检测",
    "translated_abstract": "在线性别歧视是一种广泛且有害的现象。自动化工具可以协助大规模检测性别歧视。然而，二分类检测忽略了性别歧视内容的多样性，并且无法清楚地解释为什么某些内容是性别歧视的。为了解决这个问题，我们介绍了SemEval任务10：对可解释的在线性别歧视检测（EDOS）进行了三个主要贡献：i）一种新的性别歧视内容的层次分类法，其中包括性别歧视向量以帮助解释； ii）一个新的包含细粒度标签的2万个社交媒体评论数据集，以及用于模型适应的更大的未标记数据集；和 iii）基线模型以及对参与者提交的任务的方法、结果和错误的分析。",
    "tldr": "本文介绍了SemEval任务10：可解释的在线性别歧视检测，创新地提出了具有可解释性的性别歧视内容的层次分类法，以及新的标签细粒度的数据集，可帮助解决二分类检测忽略了多样性的问题。",
    "en_tdlr": "This paper introduces SemEval Task 10 on the Explainable Detection of Online Sexism (EDOS), which proposes a novel hierarchical taxonomy of sexist content with granular vectors for explainability and a new dataset of 20,000 social media comments with fine-grained labels to address the diversity oversight in binary detection."
}