{
    "title": "The Tiny Time-series Transformer: Low-latency High-throughput Classification of Astronomical Transients using Deep Model Compression. (arXiv:2303.08951v1 [astro-ph.IM])",
    "abstract": "A new golden age in astronomy is upon us, dominated by data. Large astronomical surveys are broadcasting unprecedented rates of information, demanding machine learning as a critical component in modern scientific pipelines to handle the deluge of data. The upcoming Legacy Survey of Space and Time (LSST) of the Vera C. Rubin Observatory will raise the big-data bar for time-domain astronomy, with an expected 10 million alerts per-night, and generating many petabytes of data over the lifetime of the survey. Fast and efficient classification algorithms that can operate in real-time, yet robustly and accurately, are needed for time-critical events where additional resources can be sought for follow-up analyses. In order to handle such data, state-of-the-art deep learning architectures coupled with tools that leverage modern hardware accelerators are essential. We showcase how the use of modern deep compression methods can achieve a $18\\times$ reduction in model size, whilst preserving class",
    "link": "http://arxiv.org/abs/2303.08951",
    "context": "Title: The Tiny Time-series Transformer: Low-latency High-throughput Classification of Astronomical Transients using Deep Model Compression. (arXiv:2303.08951v1 [astro-ph.IM])\nAbstract: A new golden age in astronomy is upon us, dominated by data. Large astronomical surveys are broadcasting unprecedented rates of information, demanding machine learning as a critical component in modern scientific pipelines to handle the deluge of data. The upcoming Legacy Survey of Space and Time (LSST) of the Vera C. Rubin Observatory will raise the big-data bar for time-domain astronomy, with an expected 10 million alerts per-night, and generating many petabytes of data over the lifetime of the survey. Fast and efficient classification algorithms that can operate in real-time, yet robustly and accurately, are needed for time-critical events where additional resources can be sought for follow-up analyses. In order to handle such data, state-of-the-art deep learning architectures coupled with tools that leverage modern hardware accelerators are essential. We showcase how the use of modern deep compression methods can achieve a $18\\times$ reduction in model size, whilst preserving class",
    "path": "papers/23/03/2303.08951.json",
    "total_tokens": 740,
    "translated_title": "微型时间序列Transformer：深度模型压缩实现低延迟高吞吐量天文瞬变分类",
    "translated_abstract": "由于天文学大数据的出现，机器学习已成为现代科学处理流程中至关重要的组成部分。本文提出了一种新的深度压缩方法，可以将模型大小减小18倍，同时保持分类性能，并展示了该方法如何实现高效的实时分类算法，以适应日益增加的实时及时域天文学数据量。",
    "tldr": "本论文提出了一种能够以实时、鲁棒和准确的方式处理天文事件的快速高效分类算法，且通过深度压缩方法显著减小模型大小，适应日益增长的实时及时域天文学数据。",
    "en_tdlr": "This paper proposes a fast and efficient classification algorithm that can handle astronomical events in real-time and adapt to the increasing amount of real-time and time-domain astronomical data by significantly reducing the size of the model through deep compression methods."
}