{
    "title": "Comparison of Probabilistic Deep Learning Methods for Autism Detection. (arXiv:2303.12707v1 [cs.CV])",
    "abstract": "Autism Spectrum Disorder (ASD) is one neuro developmental disorder that is now widespread in the world. ASD persists throughout the life of an individual, impacting the way they behave and communicate, resulting to notable deficits consisting of social life retardation, repeated behavioural traits and a restriction in their interests. Early detection of the disorder helps in the onset treatment and helps one to lead a normal life. There are clinical approaches used in detection of autism, relying on behavioural data and in worst cases, neuroimaging. Quantitative methods involving machine learning have been studied and developed to overcome issues with clinical approaches. These quantitative methods rely on machine learning, with some complex methods based on deep learning developed to accelerate detection and diagnosis of ASD. These literature is aimed at exploring most state-of-the-art probabilistic methods in use today, characterizing them with the type of dataset they're most applie",
    "link": "http://arxiv.org/abs/2303.12707",
    "context": "Title: Comparison of Probabilistic Deep Learning Methods for Autism Detection. (arXiv:2303.12707v1 [cs.CV])\nAbstract: Autism Spectrum Disorder (ASD) is one neuro developmental disorder that is now widespread in the world. ASD persists throughout the life of an individual, impacting the way they behave and communicate, resulting to notable deficits consisting of social life retardation, repeated behavioural traits and a restriction in their interests. Early detection of the disorder helps in the onset treatment and helps one to lead a normal life. There are clinical approaches used in detection of autism, relying on behavioural data and in worst cases, neuroimaging. Quantitative methods involving machine learning have been studied and developed to overcome issues with clinical approaches. These quantitative methods rely on machine learning, with some complex methods based on deep learning developed to accelerate detection and diagnosis of ASD. These literature is aimed at exploring most state-of-the-art probabilistic methods in use today, characterizing them with the type of dataset they're most applie",
    "path": "papers/23/03/2303.12707.json",
    "total_tokens": 887,
    "translated_title": "比较概率深度学习在自闭症检测中的方法",
    "translated_abstract": "自闭症谱系障碍（ASD）是一种目前在世界范围内普遍存在的神经发育障碍。ASD 会在个体的整个生命期内存在，影响他们的行为和交流方式，导致明显的社交障碍、重复的行为特征以及兴趣受限。早期发现该疾病有助于启动治疗并帮助患者过上正常的生活。目前已经研究和开发了一些基于机器学习的定量方法，以克服临床方法存在的问题。这些量化方法依赖于机器学习，一些复杂的基于深度学习的方法已经被开发用于加速自闭症的检测和诊断。本文旨在探讨目前最先进的概率方法，以其所应用的数据集类型为特征进行描述。",
    "tldr": "该文章研究了最先进的概率深度学习方法，用于自闭症的检测和诊断，旨在量化方法依赖于机器学习解决客观的自闭症谱系障碍行为特征的挑战。",
    "en_tdlr": "This paper investigates state-of-the-art probabilistic deep learning methods for autism detection and diagnosis. The research aims to overcome the challenges of using clinical approaches by relying on quantitative methods based on machine learning to objectively measure behavioral traits of individuals with Autism Spectrum Disorder."
}