{
    "title": "Inferring Traffic Models in Terminal Airspace from Flight Tracks and Procedures. (arXiv:2303.09981v1 [cs.LG])",
    "abstract": "Realistic aircraft trajectory models are useful in the design and validation of air traffic management (ATM) systems. Models of aircraft operated under instrument flight rules (IFR) require capturing the variability inherent in how aircraft follow standard flight procedures. The variability in aircraft behavior varies among flight stages. In this paper, we propose a probabilistic model that can learn the variability from the procedural data and flight tracks collected from radar surveillance data. For each segment, a Gaussian mixture model is used to learn the deviations of aircraft trajectories from their procedures. Given new procedures, we can generate synthetic trajectories by sampling a series of deviations from the trained Gaussian distributions and reconstructing the aircraft trajectory using the deviations and the procedures. We extend this method to capture pairwise correlations between aircraft and show how a pairwise model can be used to generate traffic involving an arbitra",
    "link": "http://arxiv.org/abs/2303.09981",
    "context": "Title: Inferring Traffic Models in Terminal Airspace from Flight Tracks and Procedures. (arXiv:2303.09981v1 [cs.LG])\nAbstract: Realistic aircraft trajectory models are useful in the design and validation of air traffic management (ATM) systems. Models of aircraft operated under instrument flight rules (IFR) require capturing the variability inherent in how aircraft follow standard flight procedures. The variability in aircraft behavior varies among flight stages. In this paper, we propose a probabilistic model that can learn the variability from the procedural data and flight tracks collected from radar surveillance data. For each segment, a Gaussian mixture model is used to learn the deviations of aircraft trajectories from their procedures. Given new procedures, we can generate synthetic trajectories by sampling a series of deviations from the trained Gaussian distributions and reconstructing the aircraft trajectory using the deviations and the procedures. We extend this method to capture pairwise correlations between aircraft and show how a pairwise model can be used to generate traffic involving an arbitra",
    "path": "papers/23/03/2303.09981.json",
    "total_tokens": 850,
    "translated_title": "从飞行轨迹和程序中推断终端空域交通模型",
    "translated_abstract": "真实的航空器轨迹模型对于空中交通管理（ATM）系统设计和验证很有用。仪表飞行规则（IFR）下操作的飞行器模型需要捕捉飞行器按照标准飞行程序的固有变异性。飞行器行为的变异性在不同的飞行阶段之间各不相同。本文提出了一种概率模型，可以从程序数据和从雷达监视数据收集的飞行轨迹中学习变异性。 对于每个段落，使用高斯混合模型学习飞行器轨迹与其程序之间的偏差。给定新的程序，我们可以通过从经过训练的高斯分布中抽样一系列偏差，并使用偏差和程序重构飞行器轨迹来生成合成轨迹。我们将这种方法扩展到捕捉飞行器之间的成对相关性，并展示如何使用成对模型来生成涉及任意数量飞行器的交通模型。",
    "tldr": "本文提出了一种通过收集飞行轨迹和程序数据学习飞行器行为变异性的概率模型，并且可以生成涉及任意数量飞行器的交通模型。",
    "en_tdlr": "This paper proposes a probabilistic model to learn the variability of aircraft behavior from procedural data and flight tracks, and can generate traffic models involving any number of aircraft."
}