{
    "title": "Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada. (arXiv:2303.14232v1 [econ.GN])",
    "abstract": "Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer resid",
    "link": "http://arxiv.org/abs/2303.14232",
    "context": "Title: Effects of extending residencies on the supply of family medicine practitioners; difference-in-differences evidence from the implementation of mandatory family medicine residencies in Canada. (arXiv:2303.14232v1 [econ.GN])\nAbstract: Background: There is currently interest in extending medical residency training in several countries including the United States and Canada. There is little evidence on what impacts extending medical residency has on supply of primary care practitioners.  Methods: I leverage the province-by-province roll-out of mandatory family medicine residencies in Canada from 1976 to 1994. This mandated that practitioners had to complete a two year residency instead of a one year internship. I use annual Canadian Institute of Health Information data on supply of physicians by specialty and province. I employ a difference-in-differences estimation strategy comparing specialties impacted by the legislation to those that had no change in their residency length (first difference). I compare before and after legislation by province (second difference).  Results: I find reductions in the supply of family medicine practitioners in the range of 5-10% of overall supply after implementation of a longer resid",
    "path": "papers/23/03/2303.14232.json",
    "total_tokens": 893,
    "translated_title": "延长住院医师规定对家庭医学从业者供应的影响：加拿大强制实施家庭医学住院医师规定差异性分析",
    "translated_abstract": "背景：当前，包括美国和加拿大在内的一些国家有兴趣延长医学住院医师培训时间。目前关于延长住院医师培训时间对初级医疗保健从业者供应的影响还缺乏证据。方法：该研究利用加拿大1976年至1994年强制实施的一项家庭医学住院医师规定，对省份与省份之间的实施情况进行对比研究，对家庭医学从业者与其他无变化的医疗人员进行比较。利用年度医疗供应数据进行差异性估计策略。结果：实施住院医师规定后，家庭医学从业者的供应量减少了5%-10%。",
    "tldr": "该研究分析了加拿大强制实施家庭医学住院医师规定的影响，发现延长住院医师培训时间可能导致家庭医学从业者供应下降5%-10%。",
    "en_tdlr": "This study analyzed the impact of mandatory family medicine residency training in Canada, finding that extending the training period may lead to a 5-10% decrease in supply of family medicine practitioners."
}