{
    "title": "Interacting Particle Langevin Algorithm for Maximum Marginal Likelihood Estimation. (arXiv:2303.13429v1 [stat.CO])",
    "abstract": "We study a class of interacting particle systems for implementing a marginal maximum likelihood estimation (MLE) procedure to optimize over the parameters of a latent variable model. To do so, we propose a continuous-time interacting particle system which can be seen as a Langevin diffusion over an extended state space, where the number of particles acts as the inverse temperature parameter in classical settings for optimisation. Using Langevin diffusions, we prove nonasymptotic concentration bounds for the optimisation error of the maximum marginal likelihood estimator in terms of the number of particles in the particle system, the number of iterations of the algorithm, and the step-size parameter for the time discretisation analysis.",
    "link": "http://arxiv.org/abs/2303.13429",
    "context": "Title: Interacting Particle Langevin Algorithm for Maximum Marginal Likelihood Estimation. (arXiv:2303.13429v1 [stat.CO])\nAbstract: We study a class of interacting particle systems for implementing a marginal maximum likelihood estimation (MLE) procedure to optimize over the parameters of a latent variable model. To do so, we propose a continuous-time interacting particle system which can be seen as a Langevin diffusion over an extended state space, where the number of particles acts as the inverse temperature parameter in classical settings for optimisation. Using Langevin diffusions, we prove nonasymptotic concentration bounds for the optimisation error of the maximum marginal likelihood estimator in terms of the number of particles in the particle system, the number of iterations of the algorithm, and the step-size parameter for the time discretisation analysis.",
    "path": "papers/23/03/2303.13429.json",
    "total_tokens": 741,
    "translated_title": "最大边缘似然估计的相互作用粒子 Langevin 算法",
    "translated_abstract": "本文研究了一类相互作用粒子系统，用于实现潜变量模型参数的最大边缘似然估计过程。为此，我们提出了一种连续时间相互作用粒子系统，它可以被看作是在扩展的状态空间上的 Langevin漂移，其中在经典的优化中，粒子数量作为相反温度参数。使用Langevin漂移，我们证明了最大边缘似然估计器的优化误差的非渐近浓度界限，这些界限与粒子系统中的粒子数量，算法的迭代次数以及时间离散化分析的步长参数有关。",
    "tldr": "本文提出了一种相互作用粒子 Langevin 算法，用于最大边缘似然估计。使用此算法，估计器的优化误差具有非渐近浓度界限。",
    "en_tdlr": "This paper proposes an interacting particle Langevin algorithm for maximum marginal likelihood estimation, which provides non-asymptotic concentration bounds for the optimization error of the estimator, in terms of particle number, iterations and step size parameter for time discretization analysis."
}