{
    "title": "GazeReader: Detecting Unknown Word Using Webcam for English as a Second Language (ESL) Learners. (arXiv:2303.10443v1 [cs.HC])",
    "abstract": "Automatic unknown word detection techniques can enable new applications for assisting English as a Second Language (ESL) learners, thus improving their reading experiences. However, most modern unknown word detection methods require dedicated eye-tracking devices with high precision that are not easily accessible to end-users. In this work, we propose GazeReader, an unknown word detection method only using a webcam. GazeReader tracks the learner's gaze and then applies a transformer-based machine learning model that encodes the text information to locate the unknown word. We applied knowledge enhancement including term frequency, part of speech, and named entity recognition to improve the performance. The user study indicates that the accuracy and F1-score of our method were 98.09% and 75.73%, respectively. Lastly, we explored the design scope for ESL reading and discussed the findings.",
    "link": "http://arxiv.org/abs/2303.10443",
    "context": "Title: GazeReader: Detecting Unknown Word Using Webcam for English as a Second Language (ESL) Learners. (arXiv:2303.10443v1 [cs.HC])\nAbstract: Automatic unknown word detection techniques can enable new applications for assisting English as a Second Language (ESL) learners, thus improving their reading experiences. However, most modern unknown word detection methods require dedicated eye-tracking devices with high precision that are not easily accessible to end-users. In this work, we propose GazeReader, an unknown word detection method only using a webcam. GazeReader tracks the learner's gaze and then applies a transformer-based machine learning model that encodes the text information to locate the unknown word. We applied knowledge enhancement including term frequency, part of speech, and named entity recognition to improve the performance. The user study indicates that the accuracy and F1-score of our method were 98.09% and 75.73%, respectively. Lastly, we explored the design scope for ESL reading and discussed the findings.",
    "path": "papers/23/03/2303.10443.json",
    "total_tokens": 877,
    "translated_title": "GazeReader：利用网络摄像头检测英语作为第二语言学习者的未知单词",
    "translated_abstract": "自动检测未知单词的技术可以为辅助英语作为第二语言学习者的新应用提供可能性，从而提高他们的阅读体验。然而，大多数现代未知单词检测方法需要具有高精度的专用眼动仪，这些设备对于终端用户来说不易获取。在这项工作中，我们提出了GazeReader，一种只使用网络摄像头的未知单词检测方法。GazeReader跟踪学习者的凝视，然后应用一个基于Transformer的机器学习模型来编码文本信息以定位未知单词。我们还应用了知识增强技术，包括词频、词性和命名实体识别，以提高性能。用户研究表明，我们的方法的准确率和F1分数分别为98.09%和75.73%。最后，我们探讨了ESL阅读的设计范围并讨论了研究结果。",
    "tldr": "GazeReader是一种利用网络摄像头来检测未知单词的方法，可辅助英语作为第二语言学习者的阅读体验，准确率和F1分数分别为98.09%和75.73%。",
    "en_tdlr": "GazeReader is a method that detects unknown words using a webcam to assist ESL learners' reading experience, with an accuracy of 98.09% and an F1 score of 75.73%."
}