{
    "title": "ALUM: Adversarial Data Uncertainty Modeling from Latent Model Uncertainty Compensation. (arXiv:2303.16866v1 [cs.LG])",
    "abstract": "It is critical that the models pay attention not only to accuracy but also to the certainty of prediction. Uncertain predictions of deep models caused by noisy data raise significant concerns in trustworthy AI areas. To explore and handle uncertainty due to intrinsic data noise, we propose a novel method called ALUM to simultaneously handle the model uncertainty and data uncertainty in a unified scheme. Rather than solely modeling data uncertainty in the ultimate layer of a deep model based on randomly selected training data, we propose to explore mined adversarial triplets to facilitate data uncertainty modeling and non-parametric uncertainty estimations to compensate for the insufficiently trained latent model layers. Thus, the critical data uncertainty and model uncertainty caused by noisy data can be readily quantified for improving model robustness. Our proposed ALUM is model-agnostic which can be easily implemented into any existing deep model with little extra computation overhe",
    "link": "http://arxiv.org/abs/2303.16866",
    "context": "Title: ALUM: Adversarial Data Uncertainty Modeling from Latent Model Uncertainty Compensation. (arXiv:2303.16866v1 [cs.LG])\nAbstract: It is critical that the models pay attention not only to accuracy but also to the certainty of prediction. Uncertain predictions of deep models caused by noisy data raise significant concerns in trustworthy AI areas. To explore and handle uncertainty due to intrinsic data noise, we propose a novel method called ALUM to simultaneously handle the model uncertainty and data uncertainty in a unified scheme. Rather than solely modeling data uncertainty in the ultimate layer of a deep model based on randomly selected training data, we propose to explore mined adversarial triplets to facilitate data uncertainty modeling and non-parametric uncertainty estimations to compensate for the insufficiently trained latent model layers. Thus, the critical data uncertainty and model uncertainty caused by noisy data can be readily quantified for improving model robustness. Our proposed ALUM is model-agnostic which can be easily implemented into any existing deep model with little extra computation overhe",
    "path": "papers/23/03/2303.16866.json",
    "total_tokens": 961,
    "translated_title": "ALUM: 从潜在模型的不确定性补偿对抗数据不确定性建模",
    "translated_abstract": "模型不确定度的预测对于建立可信的AI至关重要。由于数据噪声引起的模型不确定性，使深度模型出现不确定的预测结果，引起重要的担忧。为了探索和处理由于固有数据噪声引起的不确定性，我们提出了一种称为ALUM的新方法，可以同时处理模型不确定性和数据不确定性。我们不是仅在深度模型的最终层中根据随机选择的训练数据建模数据不确定性，而是提出探索开采的对抗三元组以促进数据不确定性建模和非参数不确定性估计来补偿训练不足的潜伏模型层。因此，由于噪声数据引起的关键数据不确定性和模型不确定性可以被轻松地量化以提高模型的鲁棒性。我们提出的ALUM是模型不可知的，可以很容易地用很少的额外计算实现到任何现有的深度模型中。",
    "tldr": "提出了一种新方法ALUM，可以同时处理模型不确定性和数据不确定性。通过探索开采的对抗三元组来促进数据不确定性建模和非参数不确定性估计，以弥补潜在教练层的不足。该方法是模型不可知的，可以很容易地整合到任何现有的深度模型中，以提高模型的稳健性。",
    "en_tdlr": "ALUM proposes a novel method to simultaneously handle model uncertainty and data uncertainty caused by noisy data. Adversarial triplets are mined to facilitate data uncertainty modeling along with non-parametric uncertainty estimations to compensate for latent model layers. The model-agnostic method can be easily integrated into existing deep models to improve model robustness."
}