{
    "title": "A Unified Framework for Learned Sparse Retrieval. (arXiv:2303.13416v1 [cs.IR])",
    "abstract": "Learned sparse retrieval (LSR) is a family of first-stage retrieval methods that are trained to generate sparse lexical representations of queries and documents for use with an inverted index. Many LSR methods have been recently introduced, with Splade models achieving state-of-the-art performance on MSMarco. Despite similarities in their model architectures, many LSR methods show substantial differences in effectiveness and efficiency. Differences in the experimental setups and configurations used make it difficult to compare the methods and derive insights. In this work, we analyze existing LSR methods and identify key components to establish an LSR framework that unifies all LSR methods under the same perspective. We then reproduce all prominent methods using a common codebase and re-train them in the same environment, which allows us to quantify how components of the framework affect effectiveness and efficiency. We find that (1) including document term weighting is most important ",
    "link": "http://arxiv.org/abs/2303.13416",
    "context": "Title: A Unified Framework for Learned Sparse Retrieval. (arXiv:2303.13416v1 [cs.IR])\nAbstract: Learned sparse retrieval (LSR) is a family of first-stage retrieval methods that are trained to generate sparse lexical representations of queries and documents for use with an inverted index. Many LSR methods have been recently introduced, with Splade models achieving state-of-the-art performance on MSMarco. Despite similarities in their model architectures, many LSR methods show substantial differences in effectiveness and efficiency. Differences in the experimental setups and configurations used make it difficult to compare the methods and derive insights. In this work, we analyze existing LSR methods and identify key components to establish an LSR framework that unifies all LSR methods under the same perspective. We then reproduce all prominent methods using a common codebase and re-train them in the same environment, which allows us to quantify how components of the framework affect effectiveness and efficiency. We find that (1) including document term weighting is most important ",
    "path": "papers/23/03/2303.13416.json",
    "total_tokens": 850,
    "translated_title": "一种学习稀疏检索的统一框架",
    "translated_abstract": "学习稀疏检索(Learned sparse retrieval, LSR)是一组用于生成查询和文档的稀疏词汇表示以用于反向索引的第一阶段检索方法。最近引入了许多LSR方法，其中Splade模型在MSMarco上取得了最先进的性能。尽管这些LSR方法在模型架构上相似，但在有效性和效率方面存在实质性差异。使用不同的实验设置和配置使得难以比较这些方法并获得深入的见解。本文分析了现有的LSR方法，确定了关键组件，建立了一个统一的LSR框架，将所有LSR方法统一到一个框架下。我们使用相同的代码库重现了所有重要的方法，然后在相同的环境中重新训练它们，这使我们能够量化框架的组件如何影响有效性和效率。我们发现，(1)包括文档术语加权最为重要。",
    "tldr": "本文提出了一个LSR框架，以统一已有的LSR方法并分析了其关键组件。实验结果表明，在包括文档术语加权时，LSR方法的有效性和效率最优。"
}