{
    "title": "A Survey on Explainable Artificial Intelligence for Network Cybersecurity. (arXiv:2303.12942v1 [cs.CR])",
    "abstract": "The black-box nature of artificial intelligence (AI) models has been the source of many concerns in their use for critical applications. Explainable Artificial Intelligence (XAI) is a rapidly growing research field that aims to create machine learning models that can provide clear and interpretable explanations for their decisions and actions. In the field of network cybersecurity, XAI has the potential to revolutionize the way we approach network security by enabling us to better understand the behavior of cyber threats and to design more effective defenses. In this survey, we review the state of the art in XAI for cybersecurity in network systems and explore the various approaches that have been proposed to address this important problem. The review follows a systematic classification of network-driven cybersecurity threats and issues. We discuss the challenges and limitations of current XAI methods in the context of cybersecurity and outline promising directions for future research.",
    "link": "http://arxiv.org/abs/2303.12942",
    "context": "Title: A Survey on Explainable Artificial Intelligence for Network Cybersecurity. (arXiv:2303.12942v1 [cs.CR])\nAbstract: The black-box nature of artificial intelligence (AI) models has been the source of many concerns in their use for critical applications. Explainable Artificial Intelligence (XAI) is a rapidly growing research field that aims to create machine learning models that can provide clear and interpretable explanations for their decisions and actions. In the field of network cybersecurity, XAI has the potential to revolutionize the way we approach network security by enabling us to better understand the behavior of cyber threats and to design more effective defenses. In this survey, we review the state of the art in XAI for cybersecurity in network systems and explore the various approaches that have been proposed to address this important problem. The review follows a systematic classification of network-driven cybersecurity threats and issues. We discuss the challenges and limitations of current XAI methods in the context of cybersecurity and outline promising directions for future research.",
    "path": "papers/23/03/2303.12942.json",
    "total_tokens": 843,
    "translated_title": "论网络网络安全的可解释人工智能综述",
    "translated_abstract": "人工智能模型的黑匣子特性一直是用于关键应用程序的许多关注点的来源。可解释人工智能（XAI）是一个快速发展的研究领域，旨在创建能够为其决策和行动提供清晰可解释解释的机器学习模型。在网络网络安全领域，XAI具有通过使我们能够更好地了解网络威胁的行为并设计更有效的防御来彻底改变我们处理网络安全的方式的潜力。在本综述中，我们对网络驱动的威胁和问题进行系统分类，审查了网络系统中的可解释人工智能（XAI）在网络网络安全中的最新技术，探讨了各种解决这个重要问题的方法。我们讨论了当前XAI方法在网络安全背景下的挑战和局限性，并勾画未来研究的有前途的方向。",
    "tldr": "这篇论文综述了网络驱动的威胁和问题的系统分类，审查了网络系统中的可解释人工智能在网络安全中的最新技术，并勾画了未来研究的有前途的方向。",
    "en_tdlr": "This paper surveys the systematic classification of network-driven threats and issues, examines the latest technology of explainable artificial intelligence in network cybersecurity, and outlines promising directions for future research."
}