{
    "title": "RN-Net: Reservoir Nodes-Enabled Neuromorphic Vision Sensing Network. (arXiv:2303.10770v2 [cs.CV] UPDATED)",
    "abstract": "Event-based cameras are inspired by the sparse and asynchronous spike representation of the biological visual system. However, processing the even data requires either using expensive feature descriptors to transform spikes into frames, or using spiking neural networks that are difficult to train. In this work, we propose a neural network architecture based on simple convolution layers integrated with dynamic temporal encoding reservoirs with low hardware and training costs. The Reservoir Nodes-enabled neuromorphic vision sensing Network (RN-Net) allows the network to efficiently process asynchronous temporal features, and achieves the highest accuracy of 99.2% for DVS128 Gesture reported to date, and one of the highest accuracy of 67.5% for DVS Lip dataset at a much smaller network size. By leveraging the internal dynamics of memristors, asynchronous temporal feature encoding can be implemented at very low hardware cost without preprocessing or dedicated memory and arithmetic units. T",
    "link": "http://arxiv.org/abs/2303.10770",
    "context": "Title: RN-Net: Reservoir Nodes-Enabled Neuromorphic Vision Sensing Network. (arXiv:2303.10770v2 [cs.CV] UPDATED)\nAbstract: Event-based cameras are inspired by the sparse and asynchronous spike representation of the biological visual system. However, processing the even data requires either using expensive feature descriptors to transform spikes into frames, or using spiking neural networks that are difficult to train. In this work, we propose a neural network architecture based on simple convolution layers integrated with dynamic temporal encoding reservoirs with low hardware and training costs. The Reservoir Nodes-enabled neuromorphic vision sensing Network (RN-Net) allows the network to efficiently process asynchronous temporal features, and achieves the highest accuracy of 99.2% for DVS128 Gesture reported to date, and one of the highest accuracy of 67.5% for DVS Lip dataset at a much smaller network size. By leveraging the internal dynamics of memristors, asynchronous temporal feature encoding can be implemented at very low hardware cost without preprocessing or dedicated memory and arithmetic units. T",
    "path": "papers/23/03/2303.10770.json",
    "total_tokens": 933,
    "translated_title": "RN-Net: 基于储备节点的神经元视觉感知网络",
    "translated_abstract": "事件相机受生物视觉系统稀疏和异步脉冲表示的启发。然而，处理事件数据要么需要使用昂贵的特征描述符将脉冲转换成帧，要么使用难以训练的脉冲神经网络。在本文中，我们提出了一种基于简单卷积层和动态时间编码储备的神经网络架构，具有低硬件和训练成本。使用储备节点的神经元视觉感知网络（RN-Net）使网络能够有效处理异步的时间特征，并实现了DVS128手势的迄今最高准确度99.2％，同时在更小的网络尺寸下实现了DVS Lip数据集的67.5％准确度。通过利用记忆电阻器的内部动态，可以以非常低的硬件成本实现异步时间特征编码，而不需要预处理或专用的存储器和算术单元。",
    "tldr": "本论文提出一种基于储备节点的神经元视觉感知网络（RN-Net）。RN-Net可以以低成本有效地处理异步的时间特征，并在DVS128手势上实现了迄今最高的准确率99.2％，在更小的网络尺寸下实现了DVS Lip数据集的67.5％准确率。",
    "en_tdlr": "This paper proposes a neural network architecture called RN-Net that is based on reservoir nodes and can efficiently process asynchronous temporal features. RN-Net achieves the highest reported accuracy of 99.2% for DVS128 Gesture and 67.5% for DVS Lip dataset with a smaller network size, at a low hardware and training cost."
}