{
    "title": "PPG-based Heart Rate Estimation with Efficient Sensor Sampling and Learning Models. (arXiv:2303.13636v1 [cs.LG])",
    "abstract": "Recent studies showed that Photoplethysmography (PPG) sensors embedded in wearable devices can estimate heart rate (HR) with high accuracy. However, despite of prior research efforts, applying PPG sensor based HR estimation to embedded devices still faces challenges due to the energy-intensive high-frequency PPG sampling and the resource-intensive machine-learning models. In this work, we aim to explore HR estimation techniques that are more suitable for lower-power and resource-constrained embedded devices. More specifically, we seek to design techniques that could provide high-accuracy HR estimation with low-frequency PPG sampling, small model size, and fast inference time. First, we show that by combining signal processing and ML, it is possible to reduce the PPG sampling frequency from 125 Hz to only 25 Hz while providing higher HR estimation accuracy. This combination also helps to reduce the ML model feature size, leading to smaller models. Additionally, we present a comprehensiv",
    "link": "http://arxiv.org/abs/2303.13636",
    "context": "Title: PPG-based Heart Rate Estimation with Efficient Sensor Sampling and Learning Models. (arXiv:2303.13636v1 [cs.LG])\nAbstract: Recent studies showed that Photoplethysmography (PPG) sensors embedded in wearable devices can estimate heart rate (HR) with high accuracy. However, despite of prior research efforts, applying PPG sensor based HR estimation to embedded devices still faces challenges due to the energy-intensive high-frequency PPG sampling and the resource-intensive machine-learning models. In this work, we aim to explore HR estimation techniques that are more suitable for lower-power and resource-constrained embedded devices. More specifically, we seek to design techniques that could provide high-accuracy HR estimation with low-frequency PPG sampling, small model size, and fast inference time. First, we show that by combining signal processing and ML, it is possible to reduce the PPG sampling frequency from 125 Hz to only 25 Hz while providing higher HR estimation accuracy. This combination also helps to reduce the ML model feature size, leading to smaller models. Additionally, we present a comprehensiv",
    "path": "papers/23/03/2303.13636.json",
    "total_tokens": 986,
    "translated_title": "基于高效传感器采样和学习模型的PPG心率估计",
    "translated_abstract": "最近的研究表明，在可穿戴设备中嵌入的PPG传感器可以高精度地估计心率。然而，尽管之前的研究努力，将基于PPG传感器的心率估计应用于嵌入式设备仍面临着高能耗的高频PPG采样和资源密集型的机器学习模型的挑战。为此，我们旨在探索更适合低功耗和资源受限的嵌入式设备的心率估计技术。具体来说，我们希望设计出可以提供高精度心率估计的技术，其采样频率低，模型尺寸小且推断时间快。首先，我们展示了通过结合信号处理和机器学习，可以将PPG采样频率从125 Hz降至仅25 Hz，同时提供更高的心率估计精度。这种组合还有助于减小机器学习模型的特征大小，导致模型更小。此外，我们还呈现了一个全面的",
    "tldr": "本文研究了如何将PPG心率估计技术应用于低功耗和资源受限的嵌入式设备中，在结合信号处理和机器学习的基础上，成功将PPG采样频率降至仅25Hz，并提高了心率估计的精度，同时也减小了机器学习模型的特征大小，使得模型更小。",
    "en_tdlr": "This paper explores how to apply PPG heart rate estimation techniques to low-power and resource-constrained embedded devices. By combining signal processing and machine learning, the authors successfully reduced the PPG sampling frequency to only 25Hz while improving the accuracy of heart rate estimation, and minimized the feature size of the machine learning model, resulting in smaller models."
}