{
    "title": "A Study of Variable-Role-based Feature Enrichment in Neural Models of Code. (arXiv:2303.04942v2 [cs.LG] UPDATED)",
    "abstract": "Although deep neural models substantially reduce the overhead of feature engineering, the features readily available in the inputs might significantly impact training cost and the performance of the models. In this paper, we explore the impact of an unsuperivsed feature enrichment approach based on variable roles on the performance of neural models of code. The notion of variable roles (as introduced in the works of Sajaniemi et al. [Refs. 1,2]) has been found to help students' abilities in programming. In this paper, we investigate if this notion would improve the performance of neural models of code. To the best of our knowledge, this is the first work to investigate how Sajaniemi et al.'s concept of variable roles can affect neural models of code. In particular, we enrich a source code dataset by adding the role of individual variables in the dataset programs, and thereby conduct a study on the impact of variable role enrichment in training the Code2Seq model. In addition, we shed l",
    "link": "http://arxiv.org/abs/2303.04942",
    "total_tokens": 927,
    "translated_title": "代码神经模型中基于变量角色的特征增强研究",
    "translated_abstract": "尽管深度神经模型大大减少了特征工程的开销，但输入中可用的特征可能会显著影响模型的训练成本和性能。本文探讨了一种基于变量角色的无监督特征增强方法对代码神经模型性能的影响。变量角色的概念（如Sajaniemi等人的作品中所介绍的）已被发现有助于学生的编程能力。本文研究了这个概念是否会提高代码神经模型的性能。据我们所知，这是第一篇研究Sajaniemi等人的变量角色概念如何影响代码神经模型的工作。具体而言，我们通过在数据集程序中添加单个变量的角色来丰富源代码数据集，并因此对变量角色增强在训练Code2Seq模型中的影响进行了研究。",
    "tldr": "本文研究了一种基于变量角色的无监督特征增强方法对代码神经模型性能的影响，通过在数据集程序中添加单个变量的角色来丰富源代码数据集，并因此对变量角色增强在训练Code2Seq模型中的影响进行了研究。",
    "en_tldr": "This paper investigates the impact of an unsupervised feature enrichment approach based on variable roles on the performance of neural models of code, and enriches a source code dataset by adding the role of individual variables in the dataset programs, thereby conducting a study on the impact of variable role enrichment in training the Code2Seq model."
}