{
    "title": "GeoMIM: Towards Better 3D Knowledge Transfer via Masked Image Modeling for Multi-view 3D Understanding. (arXiv:2303.11325v2 [cs.CV] UPDATED)",
    "abstract": "Multi-view camera-based 3D detection is a challenging problem in computer vision. Recent works leverage a pretrained LiDAR detection model to transfer knowledge to a camera-based student network. However, we argue that there is a major domain gap between the LiDAR BEV features and the camera-based BEV features, as they have different characteristics and are derived from different sources. In this paper, we propose Geometry Enhanced Masked Image Modeling (GeoMIM) to transfer the knowledge of the LiDAR model in a pretrain-finetune paradigm for improving the multi-view camera-based 3D detection. GeoMIM is a multi-camera vision transformer with Cross-View Attention (CVA) blocks that uses LiDAR BEV features encoded by the pretrained BEV model as learning targets. During pretraining, GeoMIM's decoder has a semantic branch completing dense perspective-view features and the other geometry branch reconstructing dense perspective-view depth maps. The depth branch is designed to be camera-aware b",
    "link": "http://arxiv.org/abs/2303.11325",
    "context": "Title: GeoMIM: Towards Better 3D Knowledge Transfer via Masked Image Modeling for Multi-view 3D Understanding. (arXiv:2303.11325v2 [cs.CV] UPDATED)\nAbstract: Multi-view camera-based 3D detection is a challenging problem in computer vision. Recent works leverage a pretrained LiDAR detection model to transfer knowledge to a camera-based student network. However, we argue that there is a major domain gap between the LiDAR BEV features and the camera-based BEV features, as they have different characteristics and are derived from different sources. In this paper, we propose Geometry Enhanced Masked Image Modeling (GeoMIM) to transfer the knowledge of the LiDAR model in a pretrain-finetune paradigm for improving the multi-view camera-based 3D detection. GeoMIM is a multi-camera vision transformer with Cross-View Attention (CVA) blocks that uses LiDAR BEV features encoded by the pretrained BEV model as learning targets. During pretraining, GeoMIM's decoder has a semantic branch completing dense perspective-view features and the other geometry branch reconstructing dense perspective-view depth maps. The depth branch is designed to be camera-aware b",
    "path": "papers/23/03/2303.11325.json",
    "total_tokens": 1063,
    "translated_title": "GeoMIM：通过基于掩膜图像建模的三维知识转移实现更好的多视角三维理解",
    "translated_abstract": "在计算机视觉中，多视角基于相机的三维检测是一个具有挑战性的问题。最近的研究利用预训练的激光雷达检测模型将知识转移到基于相机的学生网络中。然而，我们认为激光雷达BEV特征和基于相机的BEV特征之间存在重大的领域差异，因为它们具有不同的特征和来源。在本文中，我们提出了几何增强的掩膜图像建模（GeoMIM），以在预训练-微调范式中通过激光雷达模型的知识来改进基于相机的多视角三维检测。GeoMIM是一个多相机视觉变换器，具有跨视图注意力（CVA）块，使用预训练的BEV模型编码的激光雷达BEV特征作为学习目标。在预训练过程中，GeoMIM的解码器具有一个语义分支，完成密集的透视图特征，并且另一个几何分支重构密集的透视视图深度图。深度分支设计为相机感知。",
    "tldr": "该论文提出了一种称为GeoMIM的方法，通过基于掩膜图像建模的方式来改进多视角基于相机的三维检测。该方法使用激光雷达模型的知识进行预训练和微调，并利用激光雷达BEV特征作为学习目标。实验结果表明，GeoMIM在多视角三维理解中取得了良好的效果。",
    "en_tdlr": "This paper proposes a method called GeoMIM to improve multi-view camera-based 3D detection by using masked image modeling. The method pretrains and fine-tunes the knowledge of a LiDAR model, and utilizes LiDAR BEV features as learning targets. Experimental results demonstrate the effectiveness of GeoMIM in multi-view 3D understanding."
}