{
    "title": "Constructing High Frequency Economic Indicators by Imputation. (arXiv:2303.01863v2 [econ.EM] UPDATED)",
    "abstract": "Monthly and weekly economic indicators are often taken to be the largest common factor estimated from high and low frequency data, either separately or jointly. To incorporate mixed frequency information without directly modeling them, we target a low frequency diffusion index that is already available, and treat high frequency values as missing. We impute these values using multiple factors estimated from the high frequency data. In the empirical examples considered, static matrix completion that does not account for serial correlation in the idiosyncratic errors yields imprecise estimates of the missing values irrespective of how the factors are estimated. Single equation and systems-based dynamic procedures that account for serial correlation yield imputed values that are closer to the observed low frequency ones. This is the case in the counterfactual exercise that imputes the monthly values of consumer sentiment series before 1978 when the data was released only on a quarterly bas",
    "link": "http://arxiv.org/abs/2303.01863",
    "context": "Title: Constructing High Frequency Economic Indicators by Imputation. (arXiv:2303.01863v2 [econ.EM] UPDATED)\nAbstract: Monthly and weekly economic indicators are often taken to be the largest common factor estimated from high and low frequency data, either separately or jointly. To incorporate mixed frequency information without directly modeling them, we target a low frequency diffusion index that is already available, and treat high frequency values as missing. We impute these values using multiple factors estimated from the high frequency data. In the empirical examples considered, static matrix completion that does not account for serial correlation in the idiosyncratic errors yields imprecise estimates of the missing values irrespective of how the factors are estimated. Single equation and systems-based dynamic procedures that account for serial correlation yield imputed values that are closer to the observed low frequency ones. This is the case in the counterfactual exercise that imputes the monthly values of consumer sentiment series before 1978 when the data was released only on a quarterly bas",
    "path": "papers/23/03/2303.01863.json",
    "total_tokens": 871,
    "translated_title": "利用插补方法构建高频经济指标",
    "translated_abstract": "通常将月度和周度经济指标视为从高频和低频数据中估计出的最大公因子，可以分别或联合使用。为了在不直接建模的情况下融合混合频率的信息，我们针对已有的低频扩散指数，将高频值视为缺失值进行插补。我们使用从高频数据估计出的多个因子来插补这些值。在考虑的实证例子中，不考虑特异误差的序列相关性的静态矩阵完成得到的缺失值估计不精确，而无论因子是如何估计的。考虑序列相关性的单方程和基于系统的动态过程得到的插补值更接近观测到的低频值。这在将消费者情绪指标的月度值插补到1978年之前只有季度数据发布的反事实练习中也适用。",
    "tldr": "该论文提出了一种通过插补方法构建高频经济指标的方法，通过利用已有的低频扩散指数和从高频数据估计的多个因子来插补高频数据，考虑序列相关性的动态过程可以得到更准确的插补值。",
    "en_tdlr": "This paper proposes a method to construct high-frequency economic indicators using imputation, which utilizes a low-frequency diffusion index and multiple factors estimated from high-frequency data to impute missing values. Dynamic procedures that account for serial correlation yield more accurate imputed values."
}