{
    "title": "Interactive Text Generation. (arXiv:2303.00908v2 [cs.CL] UPDATED)",
    "abstract": "Users interact with text, image, code, or other editors on a daily basis. However, machine learning models are rarely trained in the settings that reflect the interactivity between users and their editor. This is understandable as training AI models with real users is not only slow and costly, but what these models learn may be specific to user interface design choices. Unfortunately, this means most of the research on text, code, and image generation has focused on non-interactive settings, whereby the model is expected to get everything right without accounting for any input from a user who may be willing to help.  We introduce a new Interactive Text Generation task that allows training generation models interactively without the costs of involving real users, by using user simulators that provide edits that guide the model towards a given target text. We train our interactive models using Imitation Learning, and our experiments against competitive non-interactive generation models s",
    "link": "http://arxiv.org/abs/2303.00908",
    "context": "Title: Interactive Text Generation. (arXiv:2303.00908v2 [cs.CL] UPDATED)\nAbstract: Users interact with text, image, code, or other editors on a daily basis. However, machine learning models are rarely trained in the settings that reflect the interactivity between users and their editor. This is understandable as training AI models with real users is not only slow and costly, but what these models learn may be specific to user interface design choices. Unfortunately, this means most of the research on text, code, and image generation has focused on non-interactive settings, whereby the model is expected to get everything right without accounting for any input from a user who may be willing to help.  We introduce a new Interactive Text Generation task that allows training generation models interactively without the costs of involving real users, by using user simulators that provide edits that guide the model towards a given target text. We train our interactive models using Imitation Learning, and our experiments against competitive non-interactive generation models s",
    "path": "papers/23/03/2303.00908.json",
    "total_tokens": 891,
    "translated_title": "交互式文本生成",
    "translated_abstract": "用户每天都要与文本、图片、代码或其他编辑器互动。然而，机器学习模型很少在反映用户与编辑器之间互动的设置中进行训练。这是可以理解的，因为使用真实用户进行AI模型的训练不仅速度慢且成本高，而且这些模型所学习的内容可能特定于用户界面设计选择。不幸的是，这意味着大多数文本、代码和图像生成的研究都集中在非交互设置上，即模型被期望在没有考虑任何来自愿意帮助的用户输入的情况下完成所有任务。我们引入了一项新的交互式文本生成任务，允许使用用户模拟器进行交互式训练生成模型，无需涉及真实用户的成本，模拟器通过提供编辑指导模型朝着给定的目标文本前进。我们使用模仿学习训练我们的交互式模型，并与具有竞争力的非交互式生成模型进行了实验比较。",
    "tldr": "本研究提出了一种新的交互式文本生成任务，使用用户模拟器进行交互式训练生成模型，避免了真实用户参与的成本，并通过提供编辑指导模型朝着给定目标前进，从而提高了生成质量。",
    "en_tdlr": "This research proposes a new interactive text generation task that trains generation models interactively using user simulators, which avoids the cost of involving real users and improves the quality of generation by providing edits that guide the model towards a given target."
}