{
    "title": "Evaluating the Role of Target Arguments in Rumour Stance Classification. (arXiv:2303.12665v1 [cs.CL])",
    "abstract": "Considering a conversation thread, stance classification aims to identify the opinion (e.g. agree or disagree) of replies towards a given target. The target of the stance is expected to be an essential component in this task, being one of the main factors that make it different from sentiment analysis. However, a recent study shows that a target-oblivious model outperforms target-aware models, suggesting that targets are not useful when predicting stance. This paper re-examines this phenomenon for rumour stance classification (RSC) on social media, where a target is a rumour story implied by the source tweet in the conversation. We propose adversarial attacks in the test data, aiming to assess the models robustness and evaluate the role of the data in the models performance. Results show that state-of-the-art models, including approaches that use the entire conversation thread, overly relying on superficial signals. Our hypothesis is that the naturally high occurrence of target-indepen",
    "link": "http://arxiv.org/abs/2303.12665",
    "context": "Title: Evaluating the Role of Target Arguments in Rumour Stance Classification. (arXiv:2303.12665v1 [cs.CL])\nAbstract: Considering a conversation thread, stance classification aims to identify the opinion (e.g. agree or disagree) of replies towards a given target. The target of the stance is expected to be an essential component in this task, being one of the main factors that make it different from sentiment analysis. However, a recent study shows that a target-oblivious model outperforms target-aware models, suggesting that targets are not useful when predicting stance. This paper re-examines this phenomenon for rumour stance classification (RSC) on social media, where a target is a rumour story implied by the source tweet in the conversation. We propose adversarial attacks in the test data, aiming to assess the models robustness and evaluate the role of the data in the models performance. Results show that state-of-the-art models, including approaches that use the entire conversation thread, overly relying on superficial signals. Our hypothesis is that the naturally high occurrence of target-indepen",
    "path": "papers/23/03/2303.12665.json",
    "total_tokens": 882,
    "translated_title": "评估目标论据在谣言立场分类中的作用",
    "translated_abstract": "针对一组对话，立场分类旨在确定答复对给定目标的意见（例如同意或不同意）。在这项任务中，立场的目标预计是一个重要组成部分，是使其与情感分析不同的主要因素之一。然而，最近的一项研究表明，一个忽略目标的模型优于目标感知模型，表明在预测立场时目标并不有用。本文重新审视了这一现象，针对社交媒体上的谣言立场分类（RSC），其中目标是源推文中隐含的谣言故事。我们在测试数据中提出了对抗攻击，旨在评估模型的鲁棒性并评估数据在模型性能中的作用。结果显示，包括使用整个对话线程的方法在内的最先进的模型过于依赖表面信号。我们的假设是，目标不独立的事件自然高发生率可能导致模型过度拟合。",
    "tldr": "本文重新评估了目标论据在谣言立场分类中的作用，证明最先进的模型过于依赖表面信号，目标不独立的事件自然高发生率可能导致模型过度拟合。"
}