{
    "title": "Converging Measures and an Emergent Model: A Meta-Analysis of Human-Automation Trust Questionnaires. (arXiv:2303.13799v1 [cs.HC])",
    "abstract": "A significant challenge to measuring human-automation trust is the amount of construct proliferation, models, and questionnaires with highly variable validation. However, all agree that trust is a crucial element of technological acceptance, continued usage, fluency, and teamwork. Herein, we synthesize a consensus model for trust in human-automation interaction by performing a meta-analysis of validated and reliable trust survey instruments. To accomplish this objective, this work identifies the most frequently cited and best-validated human-automation and human-robot trust questionnaires, as well as the most well-established factors, which form the dimensions and antecedents of such trust. To reduce both confusion and construct proliferation, we provide a detailed mapping of terminology between questionnaires. Furthermore, we perform a meta-analysis of the regression models that emerged from those experiments which used multi-factorial survey instruments. Based on this meta-analysis, ",
    "link": "http://arxiv.org/abs/2303.13799",
    "context": "Title: Converging Measures and an Emergent Model: A Meta-Analysis of Human-Automation Trust Questionnaires. (arXiv:2303.13799v1 [cs.HC])\nAbstract: A significant challenge to measuring human-automation trust is the amount of construct proliferation, models, and questionnaires with highly variable validation. However, all agree that trust is a crucial element of technological acceptance, continued usage, fluency, and teamwork. Herein, we synthesize a consensus model for trust in human-automation interaction by performing a meta-analysis of validated and reliable trust survey instruments. To accomplish this objective, this work identifies the most frequently cited and best-validated human-automation and human-robot trust questionnaires, as well as the most well-established factors, which form the dimensions and antecedents of such trust. To reduce both confusion and construct proliferation, we provide a detailed mapping of terminology between questionnaires. Furthermore, we perform a meta-analysis of the regression models that emerged from those experiments which used multi-factorial survey instruments. Based on this meta-analysis, ",
    "path": "papers/23/03/2303.13799.json",
    "total_tokens": 840,
    "translated_title": "一种新的模型：对人机信任问卷的元分析",
    "translated_abstract": "测量人机信任的一个显著挑战是存在大量的构建、模型和问卷，这些问卷验证高度变化。然而，所有人都同意，信任是技术接受、持续使用、流利度和团队合作的关键元素。在本研究中，我们通过对经过验证和可靠的信任调查工具进行元分析，综合了人机交互中信任的共识模型。为了实现这个目标，这项工作确定了最常被引用和最好验证的人机和人机器人信任问卷，以及形成这种信任的维度和前因。为了减少混淆和构建扩散，我们提供了问卷术语之间的详细映射。此外，我们对使用多因素调查工具的实验中出现的回归模型进行了元分析。基于这个元分析，",
    "tldr": "本文通过元分析提出了一种共识模型，以测量人机交互中的信任，并确定了最常被引用和最好验证的人机和人机器人信任问卷以及相关因素。",
    "en_tdlr": "This paper proposes a consensus model for measuring trust in human-automation interaction through meta-analysis, and identifies the most frequently cited and best-validated human-automation and human-robot trust questionnaires and related factors."
}