{
    "title": "A Single-Step Multiclass SVM based on Quantum Annealing for Remote Sensing Data Classification. (arXiv:2303.11705v1 [cs.LG])",
    "abstract": "In recent years, the development of quantum annealers has enabled experimental demonstrations and has increased research interest in applications of quantum annealing, such as in quantum machine learning and in particular for the popular quantum SVM. Several versions of the quantum SVM have been proposed, and quantum annealing has been shown to be effective in them. Extensions to multiclass problems have also been made, which consist of an ensemble of multiple binary classifiers. This work proposes a novel quantum SVM formulation for direct multiclass classification based on quantum annealing, called Quantum Multiclass SVM (QMSVM). The multiclass classification problem is formulated as a single Quadratic Unconstrained Binary Optimization (QUBO) problem solved with quantum annealing. The main objective of this work is to evaluate the feasibility, accuracy, and time performance of this approach. Experiments have been performed on the D-Wave Advantage quantum annealer for a classification",
    "link": "http://arxiv.org/abs/2303.11705",
    "context": "Title: A Single-Step Multiclass SVM based on Quantum Annealing for Remote Sensing Data Classification. (arXiv:2303.11705v1 [cs.LG])\nAbstract: In recent years, the development of quantum annealers has enabled experimental demonstrations and has increased research interest in applications of quantum annealing, such as in quantum machine learning and in particular for the popular quantum SVM. Several versions of the quantum SVM have been proposed, and quantum annealing has been shown to be effective in them. Extensions to multiclass problems have also been made, which consist of an ensemble of multiple binary classifiers. This work proposes a novel quantum SVM formulation for direct multiclass classification based on quantum annealing, called Quantum Multiclass SVM (QMSVM). The multiclass classification problem is formulated as a single Quadratic Unconstrained Binary Optimization (QUBO) problem solved with quantum annealing. The main objective of this work is to evaluate the feasibility, accuracy, and time performance of this approach. Experiments have been performed on the D-Wave Advantage quantum annealer for a classification",
    "path": "papers/23/03/2303.11705.json",
    "total_tokens": 806,
    "translated_title": "基于量子退火的多类SVM一步分类研究应用于遥感数据分类",
    "translated_abstract": "近年来，量子退火器的发展促进了实验演示并增加了对量子退火应用的研究兴趣，例如在量子机器学习中以及特别是流行的量子SVM中。已经提出了量子SVM的几个版本，并已证明量子退火在其中是有效的。也已经进行了扩展到多类问题，包括多个二进制分类器的集成。本文提出了一种新的基于量子退火的直接多类分类的量子SVM(QMSVM)。多类分类问题被公式化为单个二次无约束二进制优化(QUBO)问题，并用量子退火求解。本文的主要目标是评估这种方法的可行性、准确性和时间性能。在D-Wave Advantage量子退火器上进行了分类的实验。",
    "tldr": "本研究提出了一种新的基于量子退火的直接多类分类的量子SVM(QMSVM)，可以快速而准确地对遥感数据进行分类。",
    "en_tdlr": "This study proposes a novel quantum SVM formulation for direct multiclass classification based on quantum annealing, called Quantum Multiclass SVM (QMSVM), which can classify remote sensing data quickly and accurately."
}