{
    "title": "The Edinburgh International Accents of English Corpus: Towards the Democratization of English ASR. (arXiv:2303.18110v1 [cs.CL])",
    "abstract": "English is the most widely spoken language in the world, used daily by millions of people as a first or second language in many different contexts. As a result, there are many varieties of English. Although the great many advances in English automatic speech recognition (ASR) over the past decades, results are usually reported based on test datasets which fail to represent the diversity of English as spoken today around the globe. We present the first release of The Edinburgh International Accents of English Corpus (EdAcc). This dataset attempts to better represent the wide diversity of English, encompassing almost 40 hours of dyadic video call conversations between friends. Unlike other datasets, EdAcc includes a wide range of first and second-language varieties of English and a linguistic background profile of each speaker. Results on latest public, and commercial models show that EdAcc highlights shortcomings of current English ASR models. The best performing model, trained on 680 t",
    "link": "http://arxiv.org/abs/2303.18110",
    "context": "Title: The Edinburgh International Accents of English Corpus: Towards the Democratization of English ASR. (arXiv:2303.18110v1 [cs.CL])\nAbstract: English is the most widely spoken language in the world, used daily by millions of people as a first or second language in many different contexts. As a result, there are many varieties of English. Although the great many advances in English automatic speech recognition (ASR) over the past decades, results are usually reported based on test datasets which fail to represent the diversity of English as spoken today around the globe. We present the first release of The Edinburgh International Accents of English Corpus (EdAcc). This dataset attempts to better represent the wide diversity of English, encompassing almost 40 hours of dyadic video call conversations between friends. Unlike other datasets, EdAcc includes a wide range of first and second-language varieties of English and a linguistic background profile of each speaker. Results on latest public, and commercial models show that EdAcc highlights shortcomings of current English ASR models. The best performing model, trained on 680 t",
    "path": "papers/23/03/2303.18110.json",
    "total_tokens": 1079,
    "translated_title": "爱丁堡国际英语口音语料库：迈向英语语音识别（ASR）的民主化",
    "translated_abstract": "英语是世界上使用最广泛的语言，每天有数百万人使用英语作为第一或第二语言，在许多不同的语境中使用。因此，英语有许多变体。虽然过去几十年来英语自动语音识别（ASR）取得了许多进展，但通常基于测试数据集报告的结果未能代表今天全球使用的多样化英语。我们提出了首个爱丁堡国际英语口音语料库（EdAcc）的版本。此数据集试图更好地代表英语的广泛多样性，包括约40小时的朋友之间的二元视频通话。与其他数据集不同，EdAcc包括广泛的英语第一语言和第二语言变体以及每个人的语言背景概况。最新公共和商业模型的结果显示，EdAcc强调了当前英语ASR模型的缺点。在680个转录的EdAcc对话上训练的表现最佳的模型在这个数据集上明显优于所有现有模型。该数据集是公开的，我们希望它能为民主化英语ASR研究和开发做出贡献。",
    "tldr": "爱丁堡国际英语口音语料库（EdAcc）发布，包括英语的广泛多样性和每个说话者的语言背景概况。在 EdAcc 上训练的最佳模型明显优于所有现有模型，这突显了当前英语ASR模型的缺点。这一数据集的公开共享将有助于民主化英语语音识别研究和开发。",
    "en_tdlr": "The Edinburgh International Accents of English Corpus (EdAcc) is released, which includes the wide diversity of English and the linguistic background profile of each speaker. The best model trained on EdAcc outperforms all existing models, highlighting the shortcomings of current English ASR models. The public sharing of this dataset will contribute to democratizing English ASR research and development."
}