{
    "title": "ART: Automatic multi-step reasoning and tool-use for large language models. (arXiv:2303.09014v1 [cs.CL])",
    "abstract": "Large language models (LLMs) can perform complex reasoning in few- and zero-shot settings by generating intermediate chain of thought (CoT) reasoning steps. Further, each reasoning step can rely on external tools to support computation beyond the core LLM capabilities (e.g. search/running code). Prior work on CoT prompting and tool use typically requires hand-crafting task-specific demonstrations and carefully scripted interleaving of model generations with tool use. We introduce Automatic Reasoning and Tool-use (ART), a framework that uses frozen LLMs to automatically generate intermediate reasoning steps as a program. Given a new task to solve, ART selects demonstrations of multi-step reasoning and tool use from a task library. At test time, ART seamlessly pauses generation whenever external tools are called, and integrates their output before resuming generation. ART achieves a substantial improvement over few-shot prompting and automatic CoT on unseen tasks in the BigBench and MMLU",
    "link": "http://arxiv.org/abs/2303.09014",
    "context": "Title: ART: Automatic multi-step reasoning and tool-use for large language models. (arXiv:2303.09014v1 [cs.CL])\nAbstract: Large language models (LLMs) can perform complex reasoning in few- and zero-shot settings by generating intermediate chain of thought (CoT) reasoning steps. Further, each reasoning step can rely on external tools to support computation beyond the core LLM capabilities (e.g. search/running code). Prior work on CoT prompting and tool use typically requires hand-crafting task-specific demonstrations and carefully scripted interleaving of model generations with tool use. We introduce Automatic Reasoning and Tool-use (ART), a framework that uses frozen LLMs to automatically generate intermediate reasoning steps as a program. Given a new task to solve, ART selects demonstrations of multi-step reasoning and tool use from a task library. At test time, ART seamlessly pauses generation whenever external tools are called, and integrates their output before resuming generation. ART achieves a substantial improvement over few-shot prompting and automatic CoT on unseen tasks in the BigBench and MMLU",
    "path": "papers/23/03/2303.09014.json",
    "total_tokens": 917,
    "translated_title": "ART: 大型语言模型的自动多步推理和工具使用",
    "translated_abstract": "大型语言模型（LLMs）可以在少量和零-shot的情况下执行复杂的推理，生成中间的思维链（CoT）推理步骤。此外，每个推理步骤可以依赖外部工具来支持超出核心LLM功能的计算（例如搜索/运行代码）。在CoT提示和工具使用方面的先前工作通常需要手工制作特定任务的演示，并精心编写模型生成与工具使用交错的脚本。我们介绍了自动推理和工具使用（ART），这是一个使用冻结LLMs的框架，用于自动生成中间推理步骤作为程序。给定新的任务来解决，ART从任务库中选择多步推理和工具使用的演示。在测试时，ART在调用外部工具时无缝地暂停生成，并在恢复生成之前集成其输出。ART在BigBench和MMLU上看到了在未见任务的少量提示和自动CoT上的显着改进。",
    "tldr": "该研究提出了自动推理和工具使用（ART）框架，用于为大型语言模型（LLMs）自动生成复杂多步推理步骤，可无缝集成外部工具支持。该框架获得了在新任务上显着改进，且无需手工制作演示或精心编写脚本。",
    "en_tdlr": "ART is a framework for large language models (LLMs) to automatically generate complex multi-step reasoning with seamless integration of external tools. It achieves substantial improvement over few-shot prompting and automatic CoT on unseen tasks without requiring task-specific demonstrations or careful scripting."
}