{
    "title": "Study on the risk-informed heuristic of decision-making on the restoration of defaulted corporation networks. (arXiv:2303.15863v1 [econ.TH])",
    "abstract": "Government-run (Government-led) restoration has become a common and effective approach to the mitigation of financial risks triggered by corporation credit defaults. However, in practice, it is often challenging to come up with the optimal plan of those restorations, due to the massive search space associated with defaulted corporation networks (DCNs), as well as the dynamic and looped interdependence among the recovery of those individual corporations. To address such a challenge, this paper proposes an array of viable heuristics of the decision-making that drives those restoration campaigns. To examine their applicability and measure their performance, those heuristics have been applied to two real-work DCNs that consists of 100 listed Chinese A-share companies, whose restoration has been modelled based on the 2021 financial data, in the wake of randomly generated default scenarios. The corresponding simulation outcome of the case-study shows that the restoration of the DCNs would be",
    "link": "http://arxiv.org/abs/2303.15863",
    "context": "Title: Study on the risk-informed heuristic of decision-making on the restoration of defaulted corporation networks. (arXiv:2303.15863v1 [econ.TH])\nAbstract: Government-run (Government-led) restoration has become a common and effective approach to the mitigation of financial risks triggered by corporation credit defaults. However, in practice, it is often challenging to come up with the optimal plan of those restorations, due to the massive search space associated with defaulted corporation networks (DCNs), as well as the dynamic and looped interdependence among the recovery of those individual corporations. To address such a challenge, this paper proposes an array of viable heuristics of the decision-making that drives those restoration campaigns. To examine their applicability and measure their performance, those heuristics have been applied to two real-work DCNs that consists of 100 listed Chinese A-share companies, whose restoration has been modelled based on the 2021 financial data, in the wake of randomly generated default scenarios. The corresponding simulation outcome of the case-study shows that the restoration of the DCNs would be",
    "path": "papers/23/03/2303.15863.json",
    "total_tokens": 883,
    "translated_title": "对违约公司网络恢复的风险知情启发式决策研究",
    "translated_abstract": "由政府主导的恢复已成为减轻因公司信用违约引发的金融风险的常见且有效方法。然而，在实践中，由于违约公司网络（DCNs）中存在大量搜索空间以及个体公司间的动态和循环相互依赖关系，往往难以提出最优方案。为了解决这一挑战，本文提出了一系列可行的决策启发式，驱动这些恢复工作的决策制定。为了检查其适用性和测量其性能，将这些启发式应用于由100家上市中国A股公司组成的两个真实DCN，并基于2021年财务数据，模拟随机生成的违约情况下的恢复。相应的案例研究模拟结果表明，DCN的恢复将会是...",
    "tldr": "本文提出了可行的启发式决策制定方案，用于驱动违约公司网络恢复工作，在两个真实的DCN案例中进行了实验验证，研究结果表明启发式决策制定方案的实用性和性能。"
}