{
    "title": "Guarded Policy Optimization with Imperfect Online Demonstrations. (arXiv:2303.01728v2 [cs.LG] UPDATED)",
    "abstract": "The Teacher-Student Framework (TSF) is a reinforcement learning setting where a teacher agent guards the training of a student agent by intervening and providing online demonstrations. Assuming optimal, the teacher policy has the perfect timing and capability to intervene in the learning process of the student agent, providing safety guarantee and exploration guidance. Nevertheless, in many real-world settings it is expensive or even impossible to obtain a well-performing teacher policy. In this work, we relax the assumption of a well-performing teacher and develop a new method that can incorporate arbitrary teacher policies with modest or inferior performance. We instantiate an Off-Policy Reinforcement Learning algorithm, termed Teacher-Student Shared Control (TS2C), which incorporates teacher intervention based on trajectory-based value estimation. Theoretical analysis validates that the proposed TS2C algorithm attains efficient exploration and substantial safety guarantee without be",
    "link": "http://arxiv.org/abs/2303.01728",
    "context": "Title: Guarded Policy Optimization with Imperfect Online Demonstrations. (arXiv:2303.01728v2 [cs.LG] UPDATED)\nAbstract: The Teacher-Student Framework (TSF) is a reinforcement learning setting where a teacher agent guards the training of a student agent by intervening and providing online demonstrations. Assuming optimal, the teacher policy has the perfect timing and capability to intervene in the learning process of the student agent, providing safety guarantee and exploration guidance. Nevertheless, in many real-world settings it is expensive or even impossible to obtain a well-performing teacher policy. In this work, we relax the assumption of a well-performing teacher and develop a new method that can incorporate arbitrary teacher policies with modest or inferior performance. We instantiate an Off-Policy Reinforcement Learning algorithm, termed Teacher-Student Shared Control (TS2C), which incorporates teacher intervention based on trajectory-based value estimation. Theoretical analysis validates that the proposed TS2C algorithm attains efficient exploration and substantial safety guarantee without be",
    "path": "papers/23/03/2303.01728.json",
    "total_tokens": 824,
    "translated_title": "有缺陷在线演示的保护策略优化",
    "translated_abstract": "“教师-学生框架”（TSF）是一种强化学习设置，其中教师代理通过干预和提供在线演示来监督学生代理的训练。本文放宽了教师表现良好的假设，并开发了一种能够融合任意教师策略的新方法。我们实例化了一个离策略强化学习算法,即教师-学生共享控制（TS2C），它基于基于轨迹的价值估计来融入教师干预。理论分析证明了所提出的TS2C算法实现了高效的探索和可靠的安全保障，而不会过分依赖教师策略的质量。",
    "tldr": "本文放弃了教师表现良好的假设，提出了一种新的算法，能够融合任意教师策略，并通过基于轨迹的价值估计实现高效的探索和安全保障。",
    "en_tdlr": "This paper proposes a new algorithm that can incorporate arbitrary teacher policies, and achieve efficient exploration and safety guarantee with trajectory-based value estimation, without relying too much on the quality of the teacher's policy, by abandoning the assumption of a well-performing teacher."
}