{
    "title": "Anonymity in sharing the revenues from broadcasting sports leagues. (arXiv:2303.17897v1 [econ.TH])",
    "abstract": "We study the problem of sharing the revenues from broadcasting sports leagues axiomatically. Our key axiom is anonymity, the classical impartiality axiom. Other impartiality axioms already studied in these problems are equal treatment of equals, weak equal treatment of equals and symmetry. We study the relationship between all impartiality axioms. Besides we combine anonymity with other existing axioms in the literature. Some combinations give rise to new characterizations of well-known rules. The family of generalized split rules is characterized with anonymity, additivity and null team. The concede-and-divide rule is characterized with anonymity, additivity and essential team. Others combinations characterize new rules that had not been considered before. We provide three characterizations in which three axioms are the same (anonymity, additivity, and order preservation) the fourth one is different (maximum aspirations, weak upper bound, and non-negativity). Depending on the fourth a",
    "link": "http://arxiv.org/abs/2303.17897",
    "context": "Title: Anonymity in sharing the revenues from broadcasting sports leagues. (arXiv:2303.17897v1 [econ.TH])\nAbstract: We study the problem of sharing the revenues from broadcasting sports leagues axiomatically. Our key axiom is anonymity, the classical impartiality axiom. Other impartiality axioms already studied in these problems are equal treatment of equals, weak equal treatment of equals and symmetry. We study the relationship between all impartiality axioms. Besides we combine anonymity with other existing axioms in the literature. Some combinations give rise to new characterizations of well-known rules. The family of generalized split rules is characterized with anonymity, additivity and null team. The concede-and-divide rule is characterized with anonymity, additivity and essential team. Others combinations characterize new rules that had not been considered before. We provide three characterizations in which three axioms are the same (anonymity, additivity, and order preservation) the fourth one is different (maximum aspirations, weak upper bound, and non-negativity). Depending on the fourth a",
    "path": "papers/23/03/2303.17897.json",
    "total_tokens": 1003,
    "translated_title": "分享广播体育联赛收益中的匿名性",
    "translated_abstract": "我们从公理化的角度研究了从广播体育联赛中分享收益的问题。我们的主要公理是匿名性，即传统的公正性公理。其他公正性公理在这些问题中已经得到研究，包括平等地对待相等的人、弱平等对待相等的人和对称性。我们研究了所有公正性公理之间的关系。此外，我们将匿名性与文献中已有的其他公理相结合。有些组合产生了对众所周知规则的新刻画。以匿名性、可加性和零团队为特征的广义分割规则系列得到了刻画。具有匿名性、可加性和必要团队特征的让步和分割规则也被刻画。其他组合对以前未考虑过的新规则进行了刻画。我们提供了三个刻画，其中三个公理是相同的（匿名性、可加性和顺序保持），第四个公理不同（最大渴望、弱上界和非负性）。取决于第四个公理，结果规则可能高度集中或分散，并且可能与先前的规则产生相当大的差异。",
    "tldr": "研究了分享广播体育联赛收益的公平性问题，提出匿名性为主要公理，结合其他公理得到多种规则的特征，包括零团队的广义分割规则以及必要团队的让步和分割规则，同时提出了几种新的规则并对这些规则进行了刻画和分析。"
}