{
    "title": "Attention Boosted Autoencoder for Building Energy Anomaly Detection. (arXiv:2303.16097v1 [cs.LG])",
    "abstract": "Leveraging data collected from smart meters in buildings can aid in developing policies towards energy conservation. Significant energy savings could be realised if deviations in the building operating conditions are detected early, and appropriate measures are taken. Towards this end, machine learning techniques can be used to automate the discovery of these abnormal patterns in the collected data. Current methods in anomaly detection rely on an underlying model to capture the usual or acceptable operating behaviour. In this paper, we propose a novel attention mechanism to model the consumption behaviour of a building and demonstrate the effectiveness of the model in capturing the relations using sample case studies. A real-world dataset is modelled using the proposed architecture, and the results are presented. A visualisation approach towards understanding the relations captured by the model is also presented.",
    "link": "http://arxiv.org/abs/2303.16097",
    "context": "Title: Attention Boosted Autoencoder for Building Energy Anomaly Detection. (arXiv:2303.16097v1 [cs.LG])\nAbstract: Leveraging data collected from smart meters in buildings can aid in developing policies towards energy conservation. Significant energy savings could be realised if deviations in the building operating conditions are detected early, and appropriate measures are taken. Towards this end, machine learning techniques can be used to automate the discovery of these abnormal patterns in the collected data. Current methods in anomaly detection rely on an underlying model to capture the usual or acceptable operating behaviour. In this paper, we propose a novel attention mechanism to model the consumption behaviour of a building and demonstrate the effectiveness of the model in capturing the relations using sample case studies. A real-world dataset is modelled using the proposed architecture, and the results are presented. A visualisation approach towards understanding the relations captured by the model is also presented.",
    "path": "papers/23/03/2303.16097.json",
    "total_tokens": 788,
    "translated_title": "基于注意力机制的自编码器在建筑能耗异常检测中的应用",
    "translated_abstract": "利用建筑智能电表收集的数据可以帮助制定节能政策。如果能够及早检测建筑运行状况的偏差，并采取适当的措施，将可以实现显著的节能效果。为此，可以使用机器学习技术自动发现收集数据中的异常模式。目前异常检测中的方法依赖于一个基础模型来捕捉正常或可接受的运行行为。本文提出了一种新颖的注意力机制来建模建筑的能耗行为，并通过样例研究展示了模型在捕捉这些关系方面的有效性。使用所提出的架构对真实世界的数据集进行建模，并呈现了结果。还提出了一种可视化方法来理解模型所捕捉到的关系。",
    "tldr": "本论文提出了一种基于注意力机制的自编码器模型，可用于建筑能耗异常检测，同时使用可视化方法辅助理解模型所捕捉到的关系。",
    "en_tdlr": "This paper proposes an attention boosted autoencoder model for anomaly detection in building energy consumption, and presents a visualization approach to aid understanding of the captured relations in the model."
}