{
    "title": "Extracting real estate values of rental apartment floor plans using graph convolutional networks. (arXiv:2303.13568v1 [cs.LG])",
    "abstract": "Access graphs that indicate adjacency relationships from the perspective of flow lines of rooms are extracted automatically from a large number of floor plan images of a family-oriented rental apartment complex in Osaka Prefecture, Japan, based on a recently proposed access graph extraction method with slight modifications. We define and implement a graph convolutional network (GCN) for access graphs and propose a model to estimate the real estate value of access graphs as the floor plan value. The model, which includes the floor plan value and hedonic method using other general explanatory variables, is used to estimate rents and their estimation accuracies are compared. In addition, the features of the floor plan that explain the rent are analyzed from the learned convolution network. Therefore, a new model for comprehensively estimating the value of real estate floor plans is proposed and validated. The results show that the proposed method significantly improves the accuracy of ren",
    "link": "http://arxiv.org/abs/2303.13568",
    "context": "Title: Extracting real estate values of rental apartment floor plans using graph convolutional networks. (arXiv:2303.13568v1 [cs.LG])\nAbstract: Access graphs that indicate adjacency relationships from the perspective of flow lines of rooms are extracted automatically from a large number of floor plan images of a family-oriented rental apartment complex in Osaka Prefecture, Japan, based on a recently proposed access graph extraction method with slight modifications. We define and implement a graph convolutional network (GCN) for access graphs and propose a model to estimate the real estate value of access graphs as the floor plan value. The model, which includes the floor plan value and hedonic method using other general explanatory variables, is used to estimate rents and their estimation accuracies are compared. In addition, the features of the floor plan that explain the rent are analyzed from the learned convolution network. Therefore, a new model for comprehensively estimating the value of real estate floor plans is proposed and validated. The results show that the proposed method significantly improves the accuracy of ren",
    "path": "papers/23/03/2303.13568.json",
    "total_tokens": 888,
    "translated_title": "利用图卷积神经网络提取租赁公寓平面图的房地产价值",
    "translated_abstract": "本文从大量位于日本大阪的家庭式租赁公寓的平面图像中提取反映房间流线邻接关系的几何图形，并使用改进后的访问图提取方法定义和实现访问图的图卷积网络（GCN）模型，提出了一种估计访问图的房地产价值的方法，即“平面图价值”。该模型包括平面图价值、使用其他一般性解释变量的享受方法，并用于估计租金，比较估计精度。此外，通过学习卷积网络，分析了解释租金的平面图的特征。因此，本文提出并验证了一种全面估计房地产平面图价值的新模型。结果表明，所提出的方法显著提高了租金估计的准确性。",
    "tldr": "本文使用改进后的方法从大量平面图像中提取访问图，利用图卷积神经网络模型“平面图价值”估计访问图的房地产价值，大幅提高了租金估计的精度。该模型为全面估计平面图的价值提供了新思路。"
}