{
    "title": "The Effects of the Pandemic on Market Power and Profitability. (arXiv:2303.08765v1 [econ.GN])",
    "abstract": "We explore firm-level markup and profit rates during the COVID-19 pandemic for a panel of 3,611 publicly traded firms in Compustat and find increases for the average firm. We offer conditions to give markups and profit rate forecasts a causal interpretation of what would have happened had the pandemic not happened. Our estimations suggest that had the pandemic not happened, markups would have been 4% and 7% higher than observed in 2020 and 2021, respectively, and profit rates would have been 2.1 and 6.4 percentage points lower. We perform a battery of tests to assess the robustness of our approach. We further show significant heterogeneity in the impact of the pandemic on firms by key firm characteristics and industry. We find that firms with lower than forecasted markups tend to have lower stock-exchange tenure and fewer employees.",
    "link": "http://arxiv.org/abs/2303.08765",
    "context": "Title: The Effects of the Pandemic on Market Power and Profitability. (arXiv:2303.08765v1 [econ.GN])\nAbstract: We explore firm-level markup and profit rates during the COVID-19 pandemic for a panel of 3,611 publicly traded firms in Compustat and find increases for the average firm. We offer conditions to give markups and profit rate forecasts a causal interpretation of what would have happened had the pandemic not happened. Our estimations suggest that had the pandemic not happened, markups would have been 4% and 7% higher than observed in 2020 and 2021, respectively, and profit rates would have been 2.1 and 6.4 percentage points lower. We perform a battery of tests to assess the robustness of our approach. We further show significant heterogeneity in the impact of the pandemic on firms by key firm characteristics and industry. We find that firms with lower than forecasted markups tend to have lower stock-exchange tenure and fewer employees.",
    "path": "papers/23/03/2303.08765.json",
    "total_tokens": 883,
    "translated_title": "疫情对市场力量和盈利能力的影响",
    "translated_abstract": "该论文研究了3,611家上市公司在COVID-19疫情期间的公司水平的标记和利润率，并发现了平均公司的增长。我们提供了一些条件，使得标记和利润率的预测具有因果解释，即如果疫情没有发生，会发生什么。我们的估计表明，如果疫情没有发生，标记价格将比2020年和2021年观察到的高4％和7％，利润率将比预测低2.1和6.4个百分点。我们进行了一系列测试，以评估我们方法的稳健性。我们进一步展示了由关键公司特征和行业造成的冠状病毒对公司影响的显著差异。我们发现，标记价格低于预期的公司往往在股票上交易时间较短且员工较少。",
    "tldr": "该论文研究了COVID-19疫情期间上市公司的标价和利润率，估计了如果没有疫情，标记价格将比观察到的高，利润率将比预测低，此外还发现了疫情对关键公司特征和行业造成的明显影响。"
}