{
    "title": "MAGNNETO: A Graph Neural Network-based Multi-Agent system for Traffic Engineering. (arXiv:2303.18157v1 [cs.NI])",
    "abstract": "Current trends in networking propose the use of Machine Learning (ML) for a wide variety of network optimization tasks. As such, many efforts have been made to produce ML-based solutions for Traffic Engineering (TE), which is a fundamental problem in ISP networks. Nowadays, state-of-the-art TE optimizers rely on traditional optimization techniques, such as Local search, Constraint Programming, or Linear programming. In this paper, we present MAGNNETO, a distributed ML-based framework that leverages Multi-Agent Reinforcement Learning and Graph Neural Networks for distributed TE optimization. MAGNNETO deploys a set of agents across the network that learn and communicate in a distributed fashion via message exchanges between neighboring agents. Particularly, we apply this framework to optimize link weights in OSPF, with the goal of minimizing network congestion. In our evaluation, we compare MAGNNETO against several state-of-the-art TE optimizers in more than 75 topologies (up to 153 node",
    "link": "http://arxiv.org/abs/2303.18157",
    "context": "Title: MAGNNETO: A Graph Neural Network-based Multi-Agent system for Traffic Engineering. (arXiv:2303.18157v1 [cs.NI])\nAbstract: Current trends in networking propose the use of Machine Learning (ML) for a wide variety of network optimization tasks. As such, many efforts have been made to produce ML-based solutions for Traffic Engineering (TE), which is a fundamental problem in ISP networks. Nowadays, state-of-the-art TE optimizers rely on traditional optimization techniques, such as Local search, Constraint Programming, or Linear programming. In this paper, we present MAGNNETO, a distributed ML-based framework that leverages Multi-Agent Reinforcement Learning and Graph Neural Networks for distributed TE optimization. MAGNNETO deploys a set of agents across the network that learn and communicate in a distributed fashion via message exchanges between neighboring agents. Particularly, we apply this framework to optimize link weights in OSPF, with the goal of minimizing network congestion. In our evaluation, we compare MAGNNETO against several state-of-the-art TE optimizers in more than 75 topologies (up to 153 node",
    "path": "papers/23/03/2303.18157.json",
    "total_tokens": 931,
    "translated_title": "基于图神经网络的交通工程多智能体系统MAGNNETO",
    "translated_abstract": "当前网络优化的趋势是使用机器学习(ML)解决各种各样的网络优化任务。因此，已经做出了许多面向交通工程(Traffic Engineering, TE)的属于ML的解决方案，因为它是ISP网络中的核心问题。目前，最先进的TE优化器依赖于传统的优化技术，比如局部搜索(Local search)、约束程序设计(Constraint Programming)或线性程序设计(Linear programming)。在本文中，我们提出了MAGNNETO，这是一个基于分布式ML的框架，它利用多智能体强化学习(Multi-Agent Reinforcement Learning)和图神经网络(Graph Neural Networks)进行分布式TE优化。MAGNNETO在网络中部署了一组智能体，这些智能体通过邻近智能体之间的消息交换进行分布式学习和通信。特别地，我们将该框架应用于优化OSPF中的链路权重，以实现最小化网络拥塞的目标。在我们的评估中，我们将MAGNNETO与多个最新的TE优化器进行了比较，在超过75个拓扑结构(达到153个节点)上进行了测试。",
    "tldr": "提出了一个基于分布式ML框架MAGNNETO，运用多智能体强化学习和图神经网络来解决ISP网络的TE优化问题，在OSPF中的链路权重调整方面表现良好。",
    "en_tdlr": "MAGNNETO, a distributed ML-based framework that utilizes Multi-Agent Reinforcement Learning and Graph Neural Networks to optimize link weights in OSPF performs well in TE optimization in ISP networks."
}