{
    "title": "DACOS-A Manually Annotated Dataset of Code Smells. (arXiv:2303.08729v1 [cs.SE])",
    "abstract": "Researchers apply machine-learning techniques for code smell detection to counter the subjectivity of many code smells. Such approaches need a large, manually annotated dataset for training and benchmarking. Existing literature offers a few datasets; however, they are small in size and, more importantly, do not focus on the subjective code snippets. In this paper, we present DACOS, a manually annotated dataset containing 10,267 annotations for 5,192 code snippets. The dataset targets three kinds of code smells at different granularity: multifaceted abstraction, complex method, and long parameter list. The dataset is created in two phases. The first phase helps us identify the code snippets that are potentially subjective by determining the thresholds of metrics used to detect a smell. The second phase collects annotations for potentially subjective snippets. We also offer an extended dataset DACOSX that includes definitely benign and definitely smelly snippets by using the thresholds i",
    "link": "http://arxiv.org/abs/2303.08729",
    "context": "Title: DACOS-A Manually Annotated Dataset of Code Smells. (arXiv:2303.08729v1 [cs.SE])\nAbstract: Researchers apply machine-learning techniques for code smell detection to counter the subjectivity of many code smells. Such approaches need a large, manually annotated dataset for training and benchmarking. Existing literature offers a few datasets; however, they are small in size and, more importantly, do not focus on the subjective code snippets. In this paper, we present DACOS, a manually annotated dataset containing 10,267 annotations for 5,192 code snippets. The dataset targets three kinds of code smells at different granularity: multifaceted abstraction, complex method, and long parameter list. The dataset is created in two phases. The first phase helps us identify the code snippets that are potentially subjective by determining the thresholds of metrics used to detect a smell. The second phase collects annotations for potentially subjective snippets. We also offer an extended dataset DACOSX that includes definitely benign and definitely smelly snippets by using the thresholds i",
    "path": "papers/23/03/2303.08729.json",
    "total_tokens": 877,
    "translated_title": "DACOS-一个手动注释的代码异味数据集",
    "translated_abstract": "研究人员应用机器学习技术来检测代码异味，以抵消许多代码异味的主观性。这种方法需要一个大型、手动注释的数据集进行训练和基准测试。现有文献提供了一些数据集，但它们规模较小，更重要的是，它们没有关注主观代码片段。本文介绍了DACOS，一个手动注释的数据集，包含10,267个对5,192个代码片段的注释。该数据集针对不同粒度的三种代码异味：多面抽象、复杂方法和长参数列表。数据集分为两个阶段创建。第一阶段通过确定用于检测气味的度量标准的阈值来帮助我们识别可能具有主观性的代码片段。第二阶段收集可能具有主观性的代码片段的注释。我们还提供了一个扩展数据集DACOSX，它使用阈值包含明确的良性代码片段和明确的有异味的代码片段。",
    "tldr": "DACOS是一个手动注释的包含三种不同粒度的代码异味（多面抽象、复杂方法和长参数列表）的数据集，用于作为机器学习检测代码异味的训练和基准测试。",
    "en_tdlr": "DACOS is a manually annotated dataset containing three different granularity code smells (multifaceted abstraction, complex method, and long parameter list) used for training and benchmarking machine learning techniques for code smell detection."
}