{
    "title": "Recursive Euclidean Distance Based Robust Aggregation Technique For Federated Learning. (arXiv:2303.11337v1 [cs.LG])",
    "abstract": "Federated learning has gained popularity as a solution to data availability and privacy challenges in machine learning. However, the aggregation process of local model updates to obtain a global model in federated learning is susceptible to malicious attacks, such as backdoor poisoning, label-flipping, and membership inference. Malicious users aim to sabotage the collaborative learning process by training the local model with malicious data. In this paper, we propose a novel robust aggregation approach based on recursive Euclidean distance calculation. Our approach measures the distance of the local models from the previous global model and assigns weights accordingly. Local models far away from the global model are assigned smaller weights to minimize the data poisoning effect during aggregation. Our experiments demonstrate that the proposed algorithm outperforms state-of-the-art algorithms by at least $5\\%$ in accuracy while reducing time complexity by less than $55\\%$. Our contribut",
    "link": "http://arxiv.org/abs/2303.11337",
    "context": "Title: Recursive Euclidean Distance Based Robust Aggregation Technique For Federated Learning. (arXiv:2303.11337v1 [cs.LG])\nAbstract: Federated learning has gained popularity as a solution to data availability and privacy challenges in machine learning. However, the aggregation process of local model updates to obtain a global model in federated learning is susceptible to malicious attacks, such as backdoor poisoning, label-flipping, and membership inference. Malicious users aim to sabotage the collaborative learning process by training the local model with malicious data. In this paper, we propose a novel robust aggregation approach based on recursive Euclidean distance calculation. Our approach measures the distance of the local models from the previous global model and assigns weights accordingly. Local models far away from the global model are assigned smaller weights to minimize the data poisoning effect during aggregation. Our experiments demonstrate that the proposed algorithm outperforms state-of-the-art algorithms by at least $5\\%$ in accuracy while reducing time complexity by less than $55\\%$. Our contribut",
    "path": "papers/23/03/2303.11337.json",
    "total_tokens": 1072,
    "translated_title": "递归欧几里得距离基于鲁棒聚合技术的联邦学习方法",
    "translated_abstract": "联邦学习作为解决机器学习中数据可用性和隐私挑战的解决方案已经变得非常受欢迎。然而，在联邦学习中，本地模型更新的聚合过程容易受到恶意攻击，如背包攻击、标签翻转和成员推断。恶意用户旨在通过恶意数据训练本地模型来破坏合作学习过程。本文提出了一种基于递归欧几里得距离计算的新型鲁棒聚合方法。我们的方法测量本地模型与之前全局模型的距离，并相应地分配权重。远离全局模型的本地模型被分配较小的权重，以最小化聚合过程中的数据污染效应。我们的实验表明，所提出的算法在精度方面的表现优于现有算法，且时间复杂度减少不超过$55\\%$。我们的贡献有两个：1）我们提出了一种新的递归欧几里得距离聚合技术，以防范联邦学习中的恶意攻击。2）我们的实验证明了所提出算法的精度和时间复杂度的有效性。",
    "tldr": "本文提出了一种递归欧几里得距离计算的鲁棒聚合方法来防御联邦学习中的恶意攻击，该方法分配权重以最小化数据污染效应，实验表明其精度优于现有算法并且时间复杂度降低。",
    "en_tdlr": "This paper proposes a novel robust aggregation approach based on recursive Euclidean distance calculation for federated learning, which assigns weights to minimize data poisoning effect and is effective against malicious attacks. Experimental results show its superiority in accuracy compared to state-of-the-art algorithms while reducing time complexity."
}