{
    "title": "AutoTransfer: AutoML with Knowledge Transfer -- An Application to Graph Neural Networks. (arXiv:2303.07669v1 [cs.LG])",
    "abstract": "AutoML has demonstrated remarkable success in finding an effective neural architecture for a given machine learning task defined by a specific dataset and an evaluation metric. However, most present AutoML techniques consider each task independently from scratch, which requires exploring many architectures, leading to high computational cost. Here we propose AutoTransfer, an AutoML solution that improves search efficiency by transferring the prior architectural design knowledge to the novel task of interest. Our key innovation includes a task-model bank that captures the model performance over a diverse set of GNN architectures and tasks, and a computationally efficient task embedding that can accurately measure the similarity among different tasks. Based on the task-model bank and the task embeddings, we estimate the design priors of desirable models of the novel task, by aggregating a similarity-weighted sum of the top-K design distributions on tasks that are similar to the task of i",
    "link": "http://arxiv.org/abs/2303.07669",
    "context": "Title: AutoTransfer: AutoML with Knowledge Transfer -- An Application to Graph Neural Networks. (arXiv:2303.07669v1 [cs.LG])\nAbstract: AutoML has demonstrated remarkable success in finding an effective neural architecture for a given machine learning task defined by a specific dataset and an evaluation metric. However, most present AutoML techniques consider each task independently from scratch, which requires exploring many architectures, leading to high computational cost. Here we propose AutoTransfer, an AutoML solution that improves search efficiency by transferring the prior architectural design knowledge to the novel task of interest. Our key innovation includes a task-model bank that captures the model performance over a diverse set of GNN architectures and tasks, and a computationally efficient task embedding that can accurately measure the similarity among different tasks. Based on the task-model bank and the task embeddings, we estimate the design priors of desirable models of the novel task, by aggregating a similarity-weighted sum of the top-K design distributions on tasks that are similar to the task of i",
    "path": "papers/23/03/2303.07669.json",
    "total_tokens": 870,
    "translated_title": "AutoTransfer: 带有知识转移的AutoML——应用于图神经网络",
    "translated_abstract": "AutoML已经展现出在针对特定数据集和评价指标的机器学习任务中寻找有效神经网络结构的显著成功。然而，大多数现有的AutoML技术独立地考虑每个任务，这需要探索许多结构，导致高计算成本。在这里，我们提出了AutoTransfer，这是一种AutoML解决方案，它通过向感兴趣的新任务转移先前的建筑设计知识来提高搜索效率。我们的关键创新包括一个任务模型库，它捕捉了对各种不同的GNN体系结构和任务的模型性能，以及一种能够准确衡量不同任务之间相似性的计算有效任务嵌入。基于任务模型库和任务嵌入，通过聚合与任务相似的顶级设计分布的相似性加权和来估计新任务的理想模型的设计先验。",
    "tldr": "AutoTransfer是一种带有知识转移的AutoML解决方案，可以将先前的GNN架构设计知识转移到新的任务中，通过任务嵌入和任务模型库来寻找理想模型的设计先验，以提高搜索效率。"
}