{
    "title": "How can Deep Learning Retrieve the Write-Missing Additional Diagnosis from Chinese Electronic Medical Record For DRG. (arXiv:2303.16757v1 [cs.CL])",
    "abstract": "The purpose of write-missing diagnosis detection is to find diseases that have been clearly diagnosed from medical records but are missed in the discharge diagnosis. Unlike the definition of missed diagnosis, the write-missing diagnosis is clearly manifested in the medical record without further reasoning. The write-missing diagnosis is a common problem, often caused by physician negligence. The write-missing diagnosis will result in an incomplete diagnosis of medical records. While under DRG grouping, the write-missing diagnoses will miss important additional diagnoses (CC, MCC), thus affecting the correct rate of DRG enrollment.  Under the circumstance that countries generally start to adopt DRG enrollment and payment, the problem of write-missing diagnosis is a common and serious problem. The current manual-based method is expensive due to the complex content of the full medical record. We think this problem is suitable to be solved as natural language processing. But to the best of",
    "link": "http://arxiv.org/abs/2303.16757",
    "context": "Title: How can Deep Learning Retrieve the Write-Missing Additional Diagnosis from Chinese Electronic Medical Record For DRG. (arXiv:2303.16757v1 [cs.CL])\nAbstract: The purpose of write-missing diagnosis detection is to find diseases that have been clearly diagnosed from medical records but are missed in the discharge diagnosis. Unlike the definition of missed diagnosis, the write-missing diagnosis is clearly manifested in the medical record without further reasoning. The write-missing diagnosis is a common problem, often caused by physician negligence. The write-missing diagnosis will result in an incomplete diagnosis of medical records. While under DRG grouping, the write-missing diagnoses will miss important additional diagnoses (CC, MCC), thus affecting the correct rate of DRG enrollment.  Under the circumstance that countries generally start to adopt DRG enrollment and payment, the problem of write-missing diagnosis is a common and serious problem. The current manual-based method is expensive due to the complex content of the full medical record. We think this problem is suitable to be solved as natural language processing. But to the best of",
    "path": "papers/23/03/2303.16757.json",
    "total_tokens": 1041,
    "translated_title": "深度学习如何从电子病历中检测漏诊的额外诊断以适用于DRG",
    "translated_abstract": "漏诊的检测的目的是找到已经在医疗记录中清晰诊断但被漏掉的疾病。不同于漏诊的定义，漏诊在医疗记录中明显表现，无须进一步推理。漏诊问题很常见，通常是由于医生疏忽造成的。漏诊会导致医疗记录的不完整性。在DRG的分组下，漏诊将错过重要的额外诊断（CC，MCC），从而影响DRG招生的正确率。在国家普遍开始采用DRG招生和支付的情况下，漏诊问题是普遍存在的严重问题。当前的基于手动方法由于全面医疗记录的复杂内容而昂贵。因此，我们认为自然语言处理可以用于解决这个问题。但据我所知，该论文提出了一种使用深度学习的方法，从中国电子病历中检索漏诊的额外诊断，以适用于DRG分组。",
    "tldr": "该论文提出了一种使用深度学习的方法，从电子病历中检索漏诊的额外诊断，以适用于DRG分组，解决了漏诊问题导致医疗记录不完整、影响DRG招生正确率的问题。",
    "en_tdlr": "The paper proposes a deep learning approach to retrieve write-missing additional diagnosis from Chinese electronic medical records for DRG grouping, addressing the common problem of write-missing diagnosis and aiming to solve the issues of incomplete diagnosis and the impact on the correct rate of DRG enrollment."
}