{
    "title": "Lifelong Machine Learning Potentials. (arXiv:2303.05911v2 [cs.LG] UPDATED)",
    "abstract": "Machine learning potentials (MLPs) trained on accurate quantum chemical data can retain the high accuracy, while inflicting little computational demands. On the downside, they need to be trained for each individual system. In recent years, a vast number of MLPs has been trained from scratch because learning additional data typically requires to train again on all data to not forget previously acquired knowledge. Additionally, most common structural descriptors of MLPs cannot represent efficiently a large number of different chemical elements. In this work, we tackle these problems by introducing element-embracing atom-centered symmetry functions (eeACSFs) which combine structural properties and element information from the periodic table. These eeACSFs are a key for our development of a lifelong machine learning potential (lMLP). Uncertainty quantification can be exploited to transgress a fixed, pre-trained MLP to arrive at a continuously adapting lMLP, because a predefined level of ac",
    "link": "http://arxiv.org/abs/2303.05911",
    "context": "Title: Lifelong Machine Learning Potentials. (arXiv:2303.05911v2 [cs.LG] UPDATED)\nAbstract: Machine learning potentials (MLPs) trained on accurate quantum chemical data can retain the high accuracy, while inflicting little computational demands. On the downside, they need to be trained for each individual system. In recent years, a vast number of MLPs has been trained from scratch because learning additional data typically requires to train again on all data to not forget previously acquired knowledge. Additionally, most common structural descriptors of MLPs cannot represent efficiently a large number of different chemical elements. In this work, we tackle these problems by introducing element-embracing atom-centered symmetry functions (eeACSFs) which combine structural properties and element information from the periodic table. These eeACSFs are a key for our development of a lifelong machine learning potential (lMLP). Uncertainty quantification can be exploited to transgress a fixed, pre-trained MLP to arrive at a continuously adapting lMLP, because a predefined level of ac",
    "path": "papers/23/03/2303.05911.json",
    "total_tokens": 971,
    "translated_title": "终身机器学习潜力",
    "translated_abstract": "在准确的量子化学数据上训练的机器学习势(Machine learning potentials, MLPs)可以保持高精度且计算需求小。但缺点是它们需要为每个系统训练。近年来，因为学习附加数据通常需要重新训练所有数据以不忘记先前获得的知识，所以已经从头开始训练了大量的MLP。此外，MLP的大多数常见结构描述符无法有效地表示许多不同的化学元素。在这项工作中，我们通过引入元素包容的中心对称函数 (eeACSFs)，结合来自周期表的结构属性和元素信息，来解决这些问题。这些eeACSFs是我们发展终身机器学习势(lMLP)的关键。不确定性量化可被利用来超越一个固定的、预先训练的MLP，以达到连续适应的lMLP，因为始终会实现预定义的精度水平和增强性能。我们的方法允许有效而准确地预测新系统，并为其他科学领域的终身机器学习潜力的发展打开了大门。",
    "tldr": "该论文提出了一种使用元素包容的中心对称函数来开发终身机器学习潜力，这可以有效且准确地预测新系统，并为其他科学领域的终身机器学习潜力的发展打开了大门。",
    "en_tdlr": "This paper proposes a lifelong machine learning potential (lMLP) using element-embracing atom-centered symmetry functions (eeACSFs) to efficiently and accurately predict novel systems and open the door for the development of lifelong machine learning potentials in other scientific fields."
}