{
    "title": "Exposure to War and Its Labor Market Consequences over the Life Cycle. (arXiv:2303.14486v1 [econ.GN])",
    "abstract": "With 70 million dead, World War II remains the most devastating conflict in history. Of the survivors, millions were displaced, returned maimed from the battlefield, or spent years in captivity. We examine the impact of such wartime experiences on labor market careers and show that they often become apparent only at certain life stages. While war injuries reduced employment in old age, former prisoners of war postponed their retirement. Many displaced workers, particularly women, never returned to employment. These responses are in line with standard life-cycle theory and thus likely extend to other conflicts.",
    "link": "http://arxiv.org/abs/2303.14486",
    "context": "Title: Exposure to War and Its Labor Market Consequences over the Life Cycle. (arXiv:2303.14486v1 [econ.GN])\nAbstract: With 70 million dead, World War II remains the most devastating conflict in history. Of the survivors, millions were displaced, returned maimed from the battlefield, or spent years in captivity. We examine the impact of such wartime experiences on labor market careers and show that they often become apparent only at certain life stages. While war injuries reduced employment in old age, former prisoners of war postponed their retirement. Many displaced workers, particularly women, never returned to employment. These responses are in line with standard life-cycle theory and thus likely extend to other conflicts.",
    "path": "papers/23/03/2303.14486.json",
    "total_tokens": 832,
    "translated_title": "战争暴露及其对个人职业生涯的影响",
    "translated_abstract": "二战是人类历史上最具破坏性的战争，共有7000万人死亡，而幸存者中有数百万人被迫流离失所、残疾退伍或被囚禁多年。本文探讨了此类战争经历对个人职业生涯的影响，并指出这些影响往往只在某些生命周期阶段才显现。尽管战争伤亡导致老年人就业减少，但前战俘则推迟了退休时间。许多流离失所的工人，特别是女性，从未重返就业市场。这些响应符合标准的生命周期理论，因此可能适用于其他冲突情境。",
    "tldr": "研究探讨了个人在战争暴露后的职业生涯受到的影响，发现这些影响仅在某些生命周期阶段才显现，尽管战争伤亡导致老年人就业减少，但前战俘则推迟了退休时间，许多流离失所的工人，特别是女性，从未重返就业市场。",
    "en_tdlr": "The study explores the impact of exposure to war on individuals' career paths, finding that the effects manifest only at certain life stages. While war injuries reduce employment in old age, former prisoners of war postpone their retirement, and many displaced workers, particularly women, never return to the labor market. These responses align with standard life-cycle theory and likely extend to other conflicts."
}