{
    "title": "Efficient Quality Diversity Optimization of 3D Buildings through 2D Pre-optimization. (arXiv:2303.15896v1 [cs.NE])",
    "abstract": "Quality diversity algorithms can be used to efficiently create a diverse set of solutions to inform engineers' intuition. But quality diversity is not efficient in very expensive problems, needing 100.000s of evaluations. Even with the assistance of surrogate models, quality diversity needs 100s or even 1000s of evaluations, which can make it use infeasible. In this study we try to tackle this problem by using a pre-optimization strategy on a lower-dimensional optimization problem and then map the solutions to a higher-dimensional case. For a use case to design buildings that minimize wind nuisance, we show that we can predict flow features around 3D buildings from 2D flow features around building footprints. For a diverse set of building designs, by sampling the space of 2D footprints with a quality diversity algorithm, a predictive model can be trained that is more accurate than when trained on a set of footprints that were selected with a space-filling algorithm like the Sobol seque",
    "link": "http://arxiv.org/abs/2303.15896",
    "context": "Title: Efficient Quality Diversity Optimization of 3D Buildings through 2D Pre-optimization. (arXiv:2303.15896v1 [cs.NE])\nAbstract: Quality diversity algorithms can be used to efficiently create a diverse set of solutions to inform engineers' intuition. But quality diversity is not efficient in very expensive problems, needing 100.000s of evaluations. Even with the assistance of surrogate models, quality diversity needs 100s or even 1000s of evaluations, which can make it use infeasible. In this study we try to tackle this problem by using a pre-optimization strategy on a lower-dimensional optimization problem and then map the solutions to a higher-dimensional case. For a use case to design buildings that minimize wind nuisance, we show that we can predict flow features around 3D buildings from 2D flow features around building footprints. For a diverse set of building designs, by sampling the space of 2D footprints with a quality diversity algorithm, a predictive model can be trained that is more accurate than when trained on a set of footprints that were selected with a space-filling algorithm like the Sobol seque",
    "path": "papers/23/03/2303.15896.json",
    "total_tokens": 978,
    "translated_title": "通过二维预优化实现三维建筑的高效质量多样性优化",
    "translated_abstract": "质量多样性算法可用于有效地创建多种解决方案，帮助工程师的直觉判断。但在非常昂贵的问题中，质量多样性不够高效，需要进行成千上万次评估。即使辅以替代模型的帮助，质量多样性也需要几百甚至几千次评估，这使得它很难成为可行的方案。本研究尝试通过在较低维优化问题上使用预优化策略，然后将解决方案映射到更高维度的情况来解决此问题。以设计最小化风扰建筑为例，我们展示了可以通过二维建筑底板的流特征预测三维建筑周围的流特征。通过使用质量多样性算法对2D建筑底板空间进行采样，可以训练出比使用类似Sobol序列这样的填充算法所选出底板的预测模型更准确的多样的建筑设计。",
    "tldr": "本研究使用预优化策略解决质量多样性算法在高维度问题上的低效性，用于设计建筑底板，通过在低维优化问题上进行预优化，然后将解决方案映射到高维度情况下，成功训练出更准确的建筑设计预测模型。",
    "en_tdlr": "This study addresses the inefficiency of quality diversity algorithms in high-dimensional problems by using a pre-optimization strategy for designing building footprints, mapping the solutions from a lower-dimensional to a higher-dimensional space. The approach yields a more accurate predictive model for a diverse set of building designs."
}