{
    "title": "Edge Deep Learning Model Protection via Neuron Authorization. (arXiv:2303.12397v1 [cs.CR])",
    "abstract": "With the development of deep learning processors and accelerators, deep learning models have been widely deployed on edge devices as part of the Internet of Things. Edge device models are generally considered as valuable intellectual properties that are worth for careful protection. Unfortunately, these models have a great risk of being stolen or illegally copied. The existing model protections using encryption algorithms are suffered from high computation overhead which is not practical due to the limited computing capacity on edge devices. In this work, we propose a light-weight, practical, and general Edge device model Pro tection method at neuron level, denoted as EdgePro. Specifically, we select several neurons as authorization neurons and set their activation values to locking values and scale the neuron outputs as the \"asswords\" during training. EdgePro protects the model by ensuring it can only work correctly when the \"passwords\" are met, at the cost of encrypting and storing t",
    "link": "http://arxiv.org/abs/2303.12397",
    "context": "Title: Edge Deep Learning Model Protection via Neuron Authorization. (arXiv:2303.12397v1 [cs.CR])\nAbstract: With the development of deep learning processors and accelerators, deep learning models have been widely deployed on edge devices as part of the Internet of Things. Edge device models are generally considered as valuable intellectual properties that are worth for careful protection. Unfortunately, these models have a great risk of being stolen or illegally copied. The existing model protections using encryption algorithms are suffered from high computation overhead which is not practical due to the limited computing capacity on edge devices. In this work, we propose a light-weight, practical, and general Edge device model Pro tection method at neuron level, denoted as EdgePro. Specifically, we select several neurons as authorization neurons and set their activation values to locking values and scale the neuron outputs as the \"asswords\" during training. EdgePro protects the model by ensuring it can only work correctly when the \"passwords\" are met, at the cost of encrypting and storing t",
    "path": "papers/23/03/2303.12397.json",
    "total_tokens": 944,
    "translated_abstract": "随着深度学习处理器和加速器的发展，深度学习模型已经广泛部署在边缘设备上，作为物联网的一部分。边缘设备模型通常被视为有价值的知识产权，值得仔细保护。不幸的是，这些模型存在被盗窃或非法复制的风险。现有的使用加密算法的模型保护由于边缘设备的有限计算能力而受到高计算开销的影响，因此不实用。在这项工作中，我们提出了一种轻量级、实用且通用的基于神经元级别的边缘设备模型保护方法，称为EdgePro。具体而言，我们选择几个神经元作为授权神经元，并将它们的激活值设置为锁定值，并在训练过程中将神经元输出缩放为“密码”。EdgePro通过确保只有在满足“密码”时才能正确工作来保护模型，代价是加密和存储许多较小的权重参数。",
    "tldr": "本论文提出了一种轻量级、实用和通用的基于神经元授权的边缘设备模型保护方法——EdgePro。EdgePro以极小的计算开销通过设置授权神经元和缩放神经元输出来保证模型只能在满足特定条件时正确运行。"
}