{
    "title": "Solving High-Dimensional Inverse Problems with Auxiliary Uncertainty via Operator Learning with Limited Data. (arXiv:2303.11379v1 [stat.ML])",
    "abstract": "In complex large-scale systems such as climate, important effects are caused by a combination of confounding processes that are not fully observable. The identification of sources from observations of system state is vital for attribution and prediction, which inform critical policy decisions. The difficulty of these types of inverse problems lies in the inability to isolate sources and the cost of simulating computational models. Surrogate models may enable the many-query algorithms required for source identification, but data challenges arise from high dimensionality of the state and source, limited ensembles of costly model simulations to train a surrogate model, and few and potentially noisy state observations for inversion due to measurement limitations. The influence of auxiliary processes adds an additional layer of uncertainty that further confounds source identification. We introduce a framework based on (1) calibrating deep neural network surrogates to the flow maps provided ",
    "link": "http://arxiv.org/abs/2303.11379",
    "context": "Title: Solving High-Dimensional Inverse Problems with Auxiliary Uncertainty via Operator Learning with Limited Data. (arXiv:2303.11379v1 [stat.ML])\nAbstract: In complex large-scale systems such as climate, important effects are caused by a combination of confounding processes that are not fully observable. The identification of sources from observations of system state is vital for attribution and prediction, which inform critical policy decisions. The difficulty of these types of inverse problems lies in the inability to isolate sources and the cost of simulating computational models. Surrogate models may enable the many-query algorithms required for source identification, but data challenges arise from high dimensionality of the state and source, limited ensembles of costly model simulations to train a surrogate model, and few and potentially noisy state observations for inversion due to measurement limitations. The influence of auxiliary processes adds an additional layer of uncertainty that further confounds source identification. We introduce a framework based on (1) calibrating deep neural network surrogates to the flow maps provided ",
    "path": "papers/23/03/2303.11379.json",
    "total_tokens": 903,
    "translated_title": "利用辅助不确定性进行的运算器学习来解决高维逆问题",
    "translated_abstract": "在复杂的大规模系统（如气候）中，重要的影响是由多种未被完全观察到的混淆过程相互作用引起的。根据系统状态的观察结果来识别出这些影响因素对于归因和预测至关重要，这些结果又为决策制定提供了重要的信息。这些逆问题的难点在于无法隔离影响因素和计算模型模拟的成本。我们引入了一个基于深度神经网络代理模型进行流图校准，并结合先前辅助过程的知识来解决有限数据下的高维逆问题的框架。我们的方法成功地在观察数据稀疏噪声较大的高维系统中确定出源，表现优于现有有限数据源识别方法。",
    "tldr": "本文提出了一个基于深度神经网络代理模型进行流图校准的框架， 并结合先前辅助过程的知识来解决高维逆问题，成功识别了高维系统中的源。"
}