{
    "title": "Cross-Cultural Transfer Learning for Chinese Offensive Language Detection. (arXiv:2303.17927v1 [cs.CL])",
    "abstract": "Detecting offensive language is a challenging task. Generalizing across different cultures and languages becomes even more challenging: besides lexical, syntactic and semantic differences, pragmatic aspects such as cultural norms and sensitivities, which are particularly relevant in this context, vary greatly. In this paper, we target Chinese offensive language detection and aim to investigate the impact of transfer learning using offensive language detection data from different cultural backgrounds, specifically Korean and English. We find that culture-specific biases in what is considered offensive negatively impact the transferability of language models (LMs) and that LMs trained on diverse cultural data are sensitive to different features in Chinese offensive language detection. In a few-shot learning scenario, however, our study shows promising prospects for non-English offensive language detection with limited resources. Our findings highlight the importance of cross-cultural tra",
    "link": "http://arxiv.org/abs/2303.17927",
    "context": "Title: Cross-Cultural Transfer Learning for Chinese Offensive Language Detection. (arXiv:2303.17927v1 [cs.CL])\nAbstract: Detecting offensive language is a challenging task. Generalizing across different cultures and languages becomes even more challenging: besides lexical, syntactic and semantic differences, pragmatic aspects such as cultural norms and sensitivities, which are particularly relevant in this context, vary greatly. In this paper, we target Chinese offensive language detection and aim to investigate the impact of transfer learning using offensive language detection data from different cultural backgrounds, specifically Korean and English. We find that culture-specific biases in what is considered offensive negatively impact the transferability of language models (LMs) and that LMs trained on diverse cultural data are sensitive to different features in Chinese offensive language detection. In a few-shot learning scenario, however, our study shows promising prospects for non-English offensive language detection with limited resources. Our findings highlight the importance of cross-cultural tra",
    "path": "papers/23/03/2303.17927.json",
    "total_tokens": 983,
    "translated_title": "跨文化迁移学习在中文恶意语言检测中的应用",
    "translated_abstract": "恶意语言的检测是一项具有挑战性的任务，而在不同文化和语言之间进行概括则变得更加困难：除了词汇、句法和语义上的差异外，文化规范和敏感性等语用方面的因素在这种情况下变化很大。本文针对中文恶意语言检测，旨在探究使用来自不同文化背景（韩语和英语）的数据实现迁移学习的影响。我们发现，特定文化对什么被视为恶意的偏见会对语言模型的可迁移性产生负面影响，并且在多元文化数据上进行训练的语言模型对于中文恶意语言检测中的不同特征是敏感的。然而，在少量资源的 Few-shot 学习方案中，我们的研究显示了非英语恶意语言检测的有前途的前景。我们的研究结果强调了跨文化翻译学习在恶意语言检测中的重要性，以及在模型训练中应该纳入多元文化背景。",
    "tldr": "本文研究了跨文化迁移学习在中文恶意语言检测上的应用，发现特定文化背景下的偏见会对语言模型的可迁移性产生负面影响。此研究结果支持在模型训练时考虑多元文化背景，以提高恶意语言检测的效果。",
    "en_tdlr": "This paper investigates the application of cross-cultural transfer learning in Chinese offensive language detection and finds that culture-specific biases negatively impact the transferability of language models. The study emphasizes incorporating diverse cultural backgrounds in model training to improve the effectiveness of offensive language detection."
}