{
    "title": "Federated Learning on Heterogenous Data using Chest CT. (arXiv:2303.13567v1 [cs.LG])",
    "abstract": "Large data have accelerated advances in AI. While it is well known that population differences from genetics, sex, race, diet, and various environmental factors contribute significantly to disease, AI studies in medicine have largely focused on locoregional patient cohorts with less diverse data sources. Such limitation stems from barriers to large-scale data share in medicine and ethical concerns over data privacy. Federated learning (FL) is one potential pathway for AI development that enables learning across hospitals without data share. In this study, we show the results of various FL strategies on one of the largest and most diverse COVID-19 chest CT datasets: 21 participating hospitals across five continents that comprise >10,000 patients with >1 million images. We present three techniques: Fed Averaging (FedAvg), Incremental Institutional Learning (IIL), and Cyclical Incremental Institutional Learning (CIIL). We also propose an FL strategy that leverages synthetically generated ",
    "link": "http://arxiv.org/abs/2303.13567",
    "context": "Title: Federated Learning on Heterogenous Data using Chest CT. (arXiv:2303.13567v1 [cs.LG])\nAbstract: Large data have accelerated advances in AI. While it is well known that population differences from genetics, sex, race, diet, and various environmental factors contribute significantly to disease, AI studies in medicine have largely focused on locoregional patient cohorts with less diverse data sources. Such limitation stems from barriers to large-scale data share in medicine and ethical concerns over data privacy. Federated learning (FL) is one potential pathway for AI development that enables learning across hospitals without data share. In this study, we show the results of various FL strategies on one of the largest and most diverse COVID-19 chest CT datasets: 21 participating hospitals across five continents that comprise >10,000 patients with >1 million images. We present three techniques: Fed Averaging (FedAvg), Incremental Institutional Learning (IIL), and Cyclical Incremental Institutional Learning (CIIL). We also propose an FL strategy that leverages synthetically generated ",
    "path": "papers/23/03/2303.13567.json",
    "total_tokens": 1023,
    "translated_title": "使用胸部CT进行异构数据联邦学习",
    "translated_abstract": "大规模数据推动了人工智能的快速发展。虽然众所周知，来自遗传、性别、种族、饮食和各种环境因素的人群差异对疾病贡献显著，但是，在医学中进行的AI研究主要集中在具有较少数据来源和较少样本差异的区域患者队列中。这种限制源于在医学中实现大规模数据共享的障碍以及对数据隐私的道德担忧。联邦学习（FL）是一种潜在的AI发展途径，可以在医院之间进行学习，而无需进行数据共享。在本研究中，我们展示了使用三种技术（联邦平均（FedAvg）、增量制度学习（IIL）和循环增量制度学习（CIIL））在涵盖5个大陆的21家参与医院中进行的联邦学习策略在COVID-19胸部CT数据集上的结果，该数据集是最大和最多样化的，包括>10,000位患者和>1,000,000张图像。我们还提出了一种利用合成生成数据和FL策略相结合的方法。",
    "tldr": "本研究使用联邦学习技术在全球21家医院的10,000多位COVID患者的胸部CT扫描图像数据集上进行了研究，提出了三种联邦学习策略，并提出了结合合成生成数据的联邦学习策略，为医学AI在异构数据上的应用提供了新的解决方案。",
    "en_tdlr": "This study uses federated learning technology to research on the chest CT scan image dataset of more than 10,000 COVID patients at 21 hospitals worldwide. Three federated learning strategies are proposed, along with a synthetic generated data and federated learning combined method, providing new solutions for the application of medical AI on heterogeneous data."
}