{
    "title": "Computably Continuous Reinforcement-Learning Objectives are PAC-learnable. (arXiv:2303.05518v1 [cs.LG])",
    "abstract": "In reinforcement learning, the classic objectives of maximizing discounted and finite-horizon cumulative rewards are PAC-learnable: There are algorithms that learn a near-optimal policy with high probability using a finite amount of samples and computation. In recent years, researchers have introduced objectives and corresponding reinforcement-learning algorithms beyond the classic cumulative rewards, such as objectives specified as linear temporal logic formulas. However, questions about the PAC-learnability of these new objectives have remained open.  This work demonstrates the PAC-learnability of general reinforcement-learning objectives through sufficient conditions for PAC-learnability in two analysis settings. In particular, for the analysis that considers only sample complexity, we prove that if an objective given as an oracle is uniformly continuous, then it is PAC-learnable. Further, for the analysis that considers computational complexity, we prove that if an objective is com",
    "link": "http://arxiv.org/abs/2303.05518",
    "raw_ret": "{\n    \"translated_title\": \"可计算连续强化学习目标是PAC可学习的\",\n    \"translated_abstract\": \"在强化学习中，最大化折扣和有限时间累积回报的经典目标是可以被PAC学习的：有算法可以使用有限的样本和计算高概率地学习接近最优策略。近年来，研究人员介绍了超越经典累积回报的目标和相应的强化学习算法，如指定为线性时态逻辑公式的目标。然而，这些新目标的PAC可学习性问题仍然没有得到解决。这项工作通过两种分析设置的PAC可学习性的充分条件，证明了通用强化学习目标的PAC可学习性。特别是对于只考虑样本复杂度的分析，我们证明，如果作为一个oracle给出的目标是一致连续的，则它是PAC可学习的。此外，对于考虑计算复杂度的分析，我们证明如果一个目标是可计算连续的则它是PAC可学习的。\",\n    \"tldr\": \"本文研究了强化学习中通用目标的PAC可学习性，并证明了只要该目标是一致连续的或可计算连续的，则它就是PAC可学习的\"\n}",
    "total_tokens": 847,
    "ret": {
        "translated_title": "可计算连续强化学习目标是PAC可学习的",
        "translated_abstract": "在强化学习中，最大化折扣和有限时间累积回报的经典目标是可以被PAC学习的：有算法可以使用有限的样本和计算高概率地学习接近最优策略。近年来，研究人员介绍了超越经典累积回报的目标和相应的强化学习算法，如指定为线性时态逻辑公式的目标。然而，这些新目标的PAC可学习性问题仍然没有得到解决。这项工作通过两种分析设置的PAC可学习性的充分条件，证明了通用强化学习目标的PAC可学习性。特别是对于只考虑样本复杂度的分析，我们证明，如果作为一个oracle给出的目标是一致连续的，则它是PAC可学习的。此外，对于考虑计算复杂度的分析，我们证明如果一个目标是可计算连续的则它是PAC可学习的。",
        "tldr": "本文研究了强化学习中通用目标的PAC可学习性，并证明了只要该目标是一致连续的或可计算连续的，则它就是PAC可学习的"
    }
}