{
    "title": "Toward Artificial Empathy for Human-Centered Design: A Framework. (arXiv:2303.10583v1 [cs.HC])",
    "abstract": "In the early stages of the design process, designers explore opportunities by discovering unmet needs and developing innovative concepts as potential solutions. From a human-centered design perspective, designers must develop empathy with people to truly understand their needs. However, developing empathy is a complex and subjective process that relies heavily on the designer's empathetic capability. Therefore, the development of empathetic understanding is intuitive, and the discovery of underlying needs is often serendipitous. This paper aims to provide insights from artificial intelligence research to indicate the future direction of AI-driven human-centered design, taking into account the essential role of empathy. Specifically, we conduct an interdisciplinary investigation of research areas such as data-driven user studies, empathetic understanding development, and artificial empathy. Based on this foundation, we discuss the role that artificial empathy can play in human-centered ",
    "link": "http://arxiv.org/abs/2303.10583",
    "context": "Title: Toward Artificial Empathy for Human-Centered Design: A Framework. (arXiv:2303.10583v1 [cs.HC])\nAbstract: In the early stages of the design process, designers explore opportunities by discovering unmet needs and developing innovative concepts as potential solutions. From a human-centered design perspective, designers must develop empathy with people to truly understand their needs. However, developing empathy is a complex and subjective process that relies heavily on the designer's empathetic capability. Therefore, the development of empathetic understanding is intuitive, and the discovery of underlying needs is often serendipitous. This paper aims to provide insights from artificial intelligence research to indicate the future direction of AI-driven human-centered design, taking into account the essential role of empathy. Specifically, we conduct an interdisciplinary investigation of research areas such as data-driven user studies, empathetic understanding development, and artificial empathy. Based on this foundation, we discuss the role that artificial empathy can play in human-centered ",
    "path": "papers/23/03/2303.10583.json",
    "total_tokens": 866,
    "translated_title": "人本设计中的人工共情：一个框架",
    "translated_abstract": "设计过程的早期阶段，设计师通过发现未满足的需求和开发创新的概念作为潜在的解决方案来探索机会。从人本设计的角度来看，设计师必须与人发展共情，才能真正理解他们的需求。然而，发展共情是一个复杂而主观的过程，非常依赖于设计师的共情能力。因此，共情的发展是直觉性的，潜在需求的发现往往是偶然的。本文旨在提供人工智能研究的见解，以指出以共情为核心的人本设计人工智能驱动的发展方向。具体而言，我们进行了跨学科研究，包括数据驱动的用户研究、共情理解的发展和人工共情等研究领域。基于这个基础，我们讨论了人工共情在人本设计中可以发挥的作用，并提出了一个在设计过程中开发人工共情的框架。",
    "tldr": "本文提出了一个框架，旨在从人工智能研究中引入人工共情的思想进入人本设计，以帮助设计师更好地理解用户的需求。",
    "en_tdlr": "This paper proposes a framework aimed at introducing the idea of artificial empathy into human-centered design from artificial intelligence research to help designers better understand user needs."
}