{
    "title": "Improving Recommendation Systems with User Personality Inferred from Product Reviews. (arXiv:2303.05039v2 [cs.IR] UPDATED)",
    "abstract": "Personality is a psychological factor that reflects people's preferences, which in turn influences their decision-making. We hypothesize that accurate modeling of users' personalities improves recommendation systems' performance. However, acquiring such personality profiles is both sensitive and expensive. We address this problem by introducing a novel method to automatically extract personality profiles from public product review text. We then design and assess three context-aware recommendation architectures that leverage the profiles to test our hypothesis.  Experiments on our two newly contributed personality datasets -Amazon-beauty and Amazon-music -- validate our hypothesis, showing performance boosts of 3--28%.Our analysis uncovers that varying personality types contribute differently to recommendation performance: open and extroverted personalities are most helpful in music recommendation, while a conscientious personality is most helpful in beauty product recommendation.",
    "link": "http://arxiv.org/abs/2303.05039",
    "context": "Title: Improving Recommendation Systems with User Personality Inferred from Product Reviews. (arXiv:2303.05039v2 [cs.IR] UPDATED)\nAbstract: Personality is a psychological factor that reflects people's preferences, which in turn influences their decision-making. We hypothesize that accurate modeling of users' personalities improves recommendation systems' performance. However, acquiring such personality profiles is both sensitive and expensive. We address this problem by introducing a novel method to automatically extract personality profiles from public product review text. We then design and assess three context-aware recommendation architectures that leverage the profiles to test our hypothesis.  Experiments on our two newly contributed personality datasets -Amazon-beauty and Amazon-music -- validate our hypothesis, showing performance boosts of 3--28%.Our analysis uncovers that varying personality types contribute differently to recommendation performance: open and extroverted personalities are most helpful in music recommendation, while a conscientious personality is most helpful in beauty product recommendation.",
    "path": "papers/23/03/2303.05039.json",
    "total_tokens": 896,
    "translated_title": "从产品评论中推断用户个性以提高推荐系统的性能",
    "translated_abstract": "个性是影响人们决策的心理因素，反映出人们的偏好。我们假设准确地建模用户个性能够提高推荐系统的性能。然而，获取这样的个性资料既敏感又昂贵。因此，我们引入了一种新方法，从公共产品评论文本中自动提取用户个性。接着，我们设计和评估了三种上下文感知推荐体系结构，利用这些个性资料来测试我们的假设。在我们贡献的两个新的个性数据集 -  Amazon 美容和 Amazon 音乐上进行的实验验证了我们的假设，显示出 3--28% 的性能提升。我们的分析揭示了不同类型的个性对推荐系统性能的贡献是不同的：在音乐推荐中，开放和外向的个性最有帮助，而在美容产品推荐中，有责任心的个性最有帮助。",
    "tldr": "本研究从产品评论中自动提取个性资料，并通过设计三种上下文感知推荐体系结构来利用这些个性资料，验证了个性资料能够提高推荐系统性能的假设，研究发现不同类型的个性对推荐系统性能的贡献是不同的。"
}