{
    "title": "Deep Single Image Camera Calibration by Heatmap Regression to Recover Fisheye Images Under ManhattanWorld AssumptionWithout Ambiguity. (arXiv:2303.17166v1 [cs.CV])",
    "abstract": "In orthogonal world coordinates, a Manhattan world lying along cuboid buildings is widely useful for various computer vision tasks. However, the Manhattan world has much room for improvement because the origin of pan angles from an image is arbitrary, that is, four-fold rotational symmetric ambiguity of pan angles. To address this problem, we propose a definition for the pan-angle origin based on the directions of the roads with respect to a camera and the direction of travel. We propose a learning-based calibration method that uses heatmap regression to remove the ambiguity by each direction of labeled image coordinates, similar to pose estimation keypoints. Simultaneously, our two-branched network recovers the rotation and removes fisheye distortion from a general scene image. To alleviate the lack of vanishing points in images, we introduce auxiliary diagonal points that have the optimal 3D arrangement of spatial uniformity. Extensive experiments demonstrated that our method outperf",
    "link": "http://arxiv.org/abs/2303.17166",
    "context": "Title: Deep Single Image Camera Calibration by Heatmap Regression to Recover Fisheye Images Under ManhattanWorld AssumptionWithout Ambiguity. (arXiv:2303.17166v1 [cs.CV])\nAbstract: In orthogonal world coordinates, a Manhattan world lying along cuboid buildings is widely useful for various computer vision tasks. However, the Manhattan world has much room for improvement because the origin of pan angles from an image is arbitrary, that is, four-fold rotational symmetric ambiguity of pan angles. To address this problem, we propose a definition for the pan-angle origin based on the directions of the roads with respect to a camera and the direction of travel. We propose a learning-based calibration method that uses heatmap regression to remove the ambiguity by each direction of labeled image coordinates, similar to pose estimation keypoints. Simultaneously, our two-branched network recovers the rotation and removes fisheye distortion from a general scene image. To alleviate the lack of vanishing points in images, we introduce auxiliary diagonal points that have the optimal 3D arrangement of spatial uniformity. Extensive experiments demonstrated that our method outperf",
    "path": "papers/23/03/2303.17166.json",
    "total_tokens": 1050,
    "translated_title": "使用热度图回归进行深度单张图片摄像机标定，在曼哈顿世界假设下在不模糊的情况下还原鱼眼图片",
    "translated_abstract": "在正交世界坐标系中，曼哈顿世界沿着长方体建筑物广泛用于各种计算机视觉任务。然而，曼哈顿世界需要改进，因为图像中的横向角度的原点是任意的，即具有四倍轮换对称的横向角度的歧义。为了解决这个问题，我们提出了一个基于摄像机和行驶方向的道路方向的平角定义。我们提出了一种基于学习的标定方法，它使用热度图回归来消除歧义，类似于姿态估计关键点。与此同时，我们的两个分支网络恢复旋转并从一般场景图像中消除鱼眼失真。为了缓解图像中缺乏消失点的情况，我们引入了具有空间均匀性最佳的对角线点。大量实验证明，我们的方法在曼哈顿世界假设下对鱼眼图像的深度单张图片摄像机标定优于现有技术，没有歧义。",
    "tldr": "本文提出一种基于学习的标定方法，使用热度图回归来消除曼哈顿世界假设下鱼眼图片中横向角度歧义，同时恢复旋转和消除鱼眼失真。该方法使用优化的对角线点缓解图像中缺乏消失点的情况，并在实验证明其性能优于现有技术。",
    "en_tdlr": "The paper proposes a learning-based calibration method using heatmap regression to remove the four-fold rotational symmetric ambiguity in fisheye images under the Manhattan world assumption, simultaneously recovering rotation and removing fisheye distortion. The method introduces auxiliary diagonal points to alleviate the lack of vanishing points in images, and outperforms state-of-the-art methods in experiments."
}