{
    "title": "Evaluation of distance-based approaches for forensic comparison: Application to hand odor evidence. (arXiv:2303.09126v1 [cs.LG])",
    "abstract": "The issue of distinguishing between the same-source and different-source hypotheses based on various types of traces is a generic problem in forensic science. This problem is often tackled with Bayesian approaches, which are able to provide a likelihood ratio that quantifies the relative strengths of evidence supporting each of the two competing hypotheses. Here, we focus on distance-based approaches, whose robustness and specifically whose capacity to deal with high-dimensional evidence are very different, and need to be evaluated and optimized. A unified framework for direct methods based on estimating the likelihoods of the distance between traces under each of the two competing hypotheses, and indirect methods using logistic regression to discriminate between same-source and different-source distance distributions, is presented. Whilst direct methods are more flexible, indirect methods are more robust and quite natural in machine learning. Moreover, indirect methods also enable the",
    "link": "http://arxiv.org/abs/2303.09126",
    "context": "Title: Evaluation of distance-based approaches for forensic comparison: Application to hand odor evidence. (arXiv:2303.09126v1 [cs.LG])\nAbstract: The issue of distinguishing between the same-source and different-source hypotheses based on various types of traces is a generic problem in forensic science. This problem is often tackled with Bayesian approaches, which are able to provide a likelihood ratio that quantifies the relative strengths of evidence supporting each of the two competing hypotheses. Here, we focus on distance-based approaches, whose robustness and specifically whose capacity to deal with high-dimensional evidence are very different, and need to be evaluated and optimized. A unified framework for direct methods based on estimating the likelihoods of the distance between traces under each of the two competing hypotheses, and indirect methods using logistic regression to discriminate between same-source and different-source distance distributions, is presented. Whilst direct methods are more flexible, indirect methods are more robust and quite natural in machine learning. Moreover, indirect methods also enable the",
    "path": "papers/23/03/2303.09126.json",
    "total_tokens": 865,
    "translated_title": "基于距离的取证比较方法评估：应用于手部气味取证",
    "translated_abstract": "在法医学中，通过不同类型的痕迹区分相同来源和不同来源的假设是一个普遍的问题。这个问题通常使用贝叶斯方法来解决，它们能够提供似然比来量化支持两个竞争假设的证据之间的相对强度。在这里，我们集中于基于距离的方法，它们的鲁棒性，特别是处理高维度证据的能力非常不同，需要评估和优化。我们提出了一个直接方法和一个间接方法的统一框架，前者基于估计两个竞争假设下的痕迹距离的似然性，后者使用逻辑回归来区分同一来源和不同来源的距离分布。虽然直接方法更灵活，但间接方法更稳健，并且在机器学习中相当自然。此外，间接方法还能够实现自动的特征选择和降维。",
    "tldr": "本文提出了一种基于距离的法医学取证比较方法，同时评估并优化了直接方法和间接方法。间接方法更稳健，适用于机器学习，自动特征选择和降维。",
    "en_tdlr": "This paper proposes a distance-based method for forensic comparison and evaluates and optimizes direct and indirect methods. The indirect method is more robust, suitable for machine learning, and enables automatic feature selection and dimensionality reduction."
}