{
    "title": "Fuzzy Alignments in Directed Acyclic Graph for Non-Autoregressive Machine Translation. (arXiv:2303.06662v2 [cs.CL] UPDATED)",
    "abstract": "Non-autoregressive translation (NAT) reduces the decoding latency but suffers from performance degradation due to the multi-modality problem. Recently, the structure of directed acyclic graph has achieved great success in NAT, which tackles the multi-modality problem by introducing dependency between vertices. However, training it with negative log-likelihood loss implicitly requires a strict alignment between reference tokens and vertices, weakening its ability to handle multiple translation modalities. In this paper, we hold the view that all paths in the graph are fuzzily aligned with the reference sentence. We do not require the exact alignment but train the model to maximize a fuzzy alignment score between the graph and reference, which takes captured translations in all modalities into account. Extensive experiments on major WMT benchmarks show that our method substantially improves translation performance and increases prediction confidence, setting a new state of the art for NA",
    "link": "http://arxiv.org/abs/2303.06662",
    "context": "Title: Fuzzy Alignments in Directed Acyclic Graph for Non-Autoregressive Machine Translation. (arXiv:2303.06662v2 [cs.CL] UPDATED)\nAbstract: Non-autoregressive translation (NAT) reduces the decoding latency but suffers from performance degradation due to the multi-modality problem. Recently, the structure of directed acyclic graph has achieved great success in NAT, which tackles the multi-modality problem by introducing dependency between vertices. However, training it with negative log-likelihood loss implicitly requires a strict alignment between reference tokens and vertices, weakening its ability to handle multiple translation modalities. In this paper, we hold the view that all paths in the graph are fuzzily aligned with the reference sentence. We do not require the exact alignment but train the model to maximize a fuzzy alignment score between the graph and reference, which takes captured translations in all modalities into account. Extensive experiments on major WMT benchmarks show that our method substantially improves translation performance and increases prediction confidence, setting a new state of the art for NA",
    "path": "papers/23/03/2303.06662.json",
    "total_tokens": 894,
    "translated_title": "非自回归机器翻译中有向无环图的模糊对齐",
    "translated_abstract": "非自回归翻译（NAT）通过引入顶点间的依赖关系，解决了多模态问题，但由于与参考标记和顶点之间需要严格对齐，严重削弱了处理多种翻译模式的能力。本文认为图中的所有路径都与参考句子模糊对齐，不需要精确对齐，而是训练模型以最大化图与参考之间的模糊对齐得分，考虑到所有模态中捕捉到的翻译。在主要的WMT基准测试上进行了广泛实验，结果显示我们的方法显著提高了翻译性能，并增加了预测置信度，创造了NA的新的state of the art。",
    "tldr": "本文提出了一种在非自回归机器翻译中通过模糊对齐解决多模态问题的方法，通过最大化图与参考之间的模糊对齐得分来训练模型，实验证明了方法显著提高了翻译性能，并增加了预测置信度，创造了非自回归机器翻译的新的state of the art。"
}