{
    "title": "Improving Content Retrievability in Search with Controllable Query Generation. (arXiv:2303.11648v1 [cs.IR])",
    "abstract": "An important goal of online platforms is to enable content discovery, i.e. allow users to find a catalog entity they were not familiar with. A pre-requisite to discover an entity, e.g. a book, with a search engine is that the entity is retrievable, i.e. there are queries for which the system will surface such entity in the top results. However, machine-learned search engines have a high retrievability bias, where the majority of the queries return the same entities. This happens partly due to the predominance of narrow intent queries, where users create queries using the title of an already known entity, e.g. in book search 'harry potter'. The amount of broad queries where users want to discover new entities, e.g. in music search 'chill lyrical electronica with an atmospheric feeling to it', and have a higher tolerance to what they might find, is small in comparison. We focus here on two factors that have a negative impact on the retrievability of the entities (I) the training data use",
    "link": "http://arxiv.org/abs/2303.11648",
    "context": "Title: Improving Content Retrievability in Search with Controllable Query Generation. (arXiv:2303.11648v1 [cs.IR])\nAbstract: An important goal of online platforms is to enable content discovery, i.e. allow users to find a catalog entity they were not familiar with. A pre-requisite to discover an entity, e.g. a book, with a search engine is that the entity is retrievable, i.e. there are queries for which the system will surface such entity in the top results. However, machine-learned search engines have a high retrievability bias, where the majority of the queries return the same entities. This happens partly due to the predominance of narrow intent queries, where users create queries using the title of an already known entity, e.g. in book search 'harry potter'. The amount of broad queries where users want to discover new entities, e.g. in music search 'chill lyrical electronica with an atmospheric feeling to it', and have a higher tolerance to what they might find, is small in comparison. We focus here on two factors that have a negative impact on the retrievability of the entities (I) the training data use",
    "path": "papers/23/03/2303.11648.json",
    "total_tokens": 950,
    "tldr": "该论文提出了一种基于控制查询生成的方法来提高搜索系统中实体的检索能力，该方法可以增加广义查询的数量以解决狭义意图查询造成的检索偏差问题。",
    "en_tdlr": "This paper proposes a controllable query generation method to improve the retrievability of entities in search systems by increasing the number of broad queries, addressing the retrievability bias caused by narrow intent queries."
}