{
    "title": "Embedding Contextual Information through Reward Shaping in Multi-Agent Learning: A Case Study from Google Football. (arXiv:2303.15471v1 [cs.LG])",
    "abstract": "Artificial Intelligence has been used to help human complete difficult tasks in complicated environments by providing optimized strategies for decision-making or replacing the manual labour. In environments including multiple agents, such as football, the most common methods to train agents are Imitation Learning and Multi-Agent Reinforcement Learning (MARL). However, the agents trained by Imitation Learning cannot outperform the expert demonstrator, which makes humans hardly get new insights from the learnt policy. Besides, MARL is prone to the credit assignment problem. In environments with sparse reward signal, this method can be inefficient. The objective of our research is to create a novel reward shaping method by embedding contextual information in reward function to solve the aforementioned challenges. We demonstrate this in the Google Research Football (GRF) environment. We quantify the contextual information extracted from game state observation and use this quantification to",
    "link": "http://arxiv.org/abs/2303.15471",
    "context": "Title: Embedding Contextual Information through Reward Shaping in Multi-Agent Learning: A Case Study from Google Football. (arXiv:2303.15471v1 [cs.LG])\nAbstract: Artificial Intelligence has been used to help human complete difficult tasks in complicated environments by providing optimized strategies for decision-making or replacing the manual labour. In environments including multiple agents, such as football, the most common methods to train agents are Imitation Learning and Multi-Agent Reinforcement Learning (MARL). However, the agents trained by Imitation Learning cannot outperform the expert demonstrator, which makes humans hardly get new insights from the learnt policy. Besides, MARL is prone to the credit assignment problem. In environments with sparse reward signal, this method can be inefficient. The objective of our research is to create a novel reward shaping method by embedding contextual information in reward function to solve the aforementioned challenges. We demonstrate this in the Google Research Football (GRF) environment. We quantify the contextual information extracted from game state observation and use this quantification to",
    "path": "papers/23/03/2303.15471.json",
    "total_tokens": 673,
    "tldr": "本文提出了一种新的奖励塑形方法——CoRS，通过将上下文信息嵌入到奖励函数中来解决多智能体强化学习中的挑战。使用CoRS方法可以在Google Research Football等环境中更有效地实现智能体的训练和学习，并得到更高的胜率以及创建不同风格的足球游戏。"
}