{
    "title": "Cascaded Zoom-in Detector for High Resolution Aerial Images. (arXiv:2303.08747v1 [cs.CV])",
    "abstract": "Detecting objects in aerial images is challenging because they are typically composed of crowded small objects distributed non-uniformly over high-resolution images. Density cropping is a widely used method to improve this small object detection where the crowded small object regions are extracted and processed in high resolution. However, this is typically accomplished by adding other learnable components, thus complicating the training and inference over a standard detection process. In this paper, we propose an efficient Cascaded Zoom-in (CZ) detector that re-purposes the detector itself for density-guided training and inference. During training, density crops are located, labeled as a new class, and employed to augment the training dataset. During inference, the density crops are first detected along with the base class objects, and then input for a second stage of inference. This approach is easily integrated into any detector, and creates no significant change in the standard det",
    "link": "http://arxiv.org/abs/2303.08747",
    "context": "Title: Cascaded Zoom-in Detector for High Resolution Aerial Images. (arXiv:2303.08747v1 [cs.CV])\nAbstract: Detecting objects in aerial images is challenging because they are typically composed of crowded small objects distributed non-uniformly over high-resolution images. Density cropping is a widely used method to improve this small object detection where the crowded small object regions are extracted and processed in high resolution. However, this is typically accomplished by adding other learnable components, thus complicating the training and inference over a standard detection process. In this paper, we propose an efficient Cascaded Zoom-in (CZ) detector that re-purposes the detector itself for density-guided training and inference. During training, density crops are located, labeled as a new class, and employed to augment the training dataset. During inference, the density crops are first detected along with the base class objects, and then input for a second stage of inference. This approach is easily integrated into any detector, and creates no significant change in the standard det",
    "path": "papers/23/03/2303.08747.json",
    "total_tokens": 910,
    "translated_title": "基于级联放大的高分辨率航空图像检测器",
    "translated_abstract": "在航空图像中检测物体是具有挑战性的，因为它们通常由分布不均匀的拥挤小物体组成，分辨率也很高。密度裁剪是改善小物体检测的广泛方法，其中提取并处理高分辨率下的拥挤小物体区域。然而，这通常通过添加其他可学习组件来完成，从而使训练和推理过程复杂化，这不符合标准检测流程。在本文中，我们提出了一种有效的级联放大检测器（CZ检测器），它重新定位检测器本身以进行密度引导式训练和推理。在训练期间，定位密度裁剪，标记为新类别，并用于增强训练数据集。在推理期间，密度裁剪与基类别对象一起首先被检测，然后输入进行第二阶段的推理。这种方法可以轻松地集成到任何检测器中，并且不会对标准检测流程造成重大变化。",
    "tldr": "本研究提出了一种基于级联放大的高分辨率航空图像检测器，使用密度裁剪来增强小物体检测，且易于集成到任何检测器中。",
    "en_tdlr": "This paper proposes an efficient Cascaded Zoom-in (CZ) detector for detecting small crowded objects in high-resolution aerial images. It uses density cropping to improve small object detection and is easily integrated into any detector. The approach involves no significant change to the standard detection process."
}