{
    "title": "SignCRF: Scalable Channel-agnostic Data-driven Radio Authentication System. (arXiv:2303.12811v1 [cs.CR])",
    "abstract": "Radio Frequency Fingerprinting through Deep Learning (RFFDL) is a data-driven IoT authentication technique that leverages the unique hardware-level manufacturing imperfections associated with a particular device to recognize (fingerprint) the device based on variations introduced in the transmitted waveform. The proposed SignCRF is a scalable, channel-agnostic, data-driven radio authentication platform with unmatched precision in fingerprinting wireless devices based on their unique manufacturing impairments and independent of the dynamic channel irregularities caused by mobility. SignCRF consists of (i) a baseline classifier finely trained to authenticate devices with high accuracy and at scale; (ii) an environment translator carefully designed and trained to remove the dynamic channel impact from RF signals while maintaining the radio's specific signature; (iii) a Max-Rule module that selects the highest precision authentication technique between the baseline classifier and the envir",
    "link": "http://arxiv.org/abs/2303.12811",
    "context": "Title: SignCRF: Scalable Channel-agnostic Data-driven Radio Authentication System. (arXiv:2303.12811v1 [cs.CR])\nAbstract: Radio Frequency Fingerprinting through Deep Learning (RFFDL) is a data-driven IoT authentication technique that leverages the unique hardware-level manufacturing imperfections associated with a particular device to recognize (fingerprint) the device based on variations introduced in the transmitted waveform. The proposed SignCRF is a scalable, channel-agnostic, data-driven radio authentication platform with unmatched precision in fingerprinting wireless devices based on their unique manufacturing impairments and independent of the dynamic channel irregularities caused by mobility. SignCRF consists of (i) a baseline classifier finely trained to authenticate devices with high accuracy and at scale; (ii) an environment translator carefully designed and trained to remove the dynamic channel impact from RF signals while maintaining the radio's specific signature; (iii) a Max-Rule module that selects the highest precision authentication technique between the baseline classifier and the envir",
    "path": "papers/23/03/2303.12811.json",
    "total_tokens": 877,
    "translated_title": "SignCRF: 可扩展的无频道数据驱动射频认证系统",
    "translated_abstract": "无线电频率指纹通过深度学习(RFFDL)是一种数据驱动的物联网身份认证技术，利用与特定设备相关的独特硬件级制造缺陷来识别（指纹）基于传输波形引入的变化的设备。提出的SignCRF是一个可扩展的、无频道的、数据驱动的射频认证平台，在识别基于其独特的制造缺陷的无线设备方面具有无与伦比的精度，并且独立于由移动性引起的动态信道不规则性。SignCRF由三部分组成：(i)基线分类器，经过精细训练，能够高精度地扩展认证设备;(ii)环境翻译器，经过精心设计和训练，能够从RF信号中去除动态信道影响，同时保持收发机具体的信号；(iii)最大规则模块选择基线分类器和环境翻译器之间的最高精度认证技术。",
    "tldr": "SignCRF是一个可扩展的无频道数据驱动射频认证平台，能够高精度地识别无线设备，不受移动性带来的动态信道影响。",
    "en_tdlr": "SignCRF is a scalable channel-agnostic data-driven radio authentication platform that can accurately identify wireless devices based on their unique manufacturing impairments and is independent of dynamic channel irregularities caused by mobility."
}