{
    "title": "Mixture of segmentation for heterogeneous functional data. (arXiv:2303.10712v1 [stat.ME])",
    "abstract": "In this paper we consider functional data with heterogeneity in time and in population. We propose a mixture model with segmentation of time to represent this heterogeneity while keeping the functional structure. Maximum likelihood estimator is considered, proved to be identifiable and consistent. In practice, an EM algorithm is used, combined with dynamic programming for the maximization step, to approximate the maximum likelihood estimator. The method is illustrated on a simulated dataset, and used on a real dataset of electricity consumption.",
    "link": "http://arxiv.org/abs/2303.10712",
    "context": "Title: Mixture of segmentation for heterogeneous functional data. (arXiv:2303.10712v1 [stat.ME])\nAbstract: In this paper we consider functional data with heterogeneity in time and in population. We propose a mixture model with segmentation of time to represent this heterogeneity while keeping the functional structure. Maximum likelihood estimator is considered, proved to be identifiable and consistent. In practice, an EM algorithm is used, combined with dynamic programming for the maximization step, to approximate the maximum likelihood estimator. The method is illustrated on a simulated dataset, and used on a real dataset of electricity consumption.",
    "path": "papers/23/03/2303.10712.json",
    "total_tokens": 608,
    "translated_title": "异质性功能数据的混合分割模型",
    "translated_abstract": "本文针对时间和人口异质性的功能数据提出了一种混合分割模型，旨在保持功能结构的同时表示异质性。 讨论了最大似然估计器的可辨识性和一致性，并采用动态规划的EM算法来近似最大似然估计器。 该方法在模拟数据上进行了说明，并在用电量真实数据集上得到了应用。",
    "tldr": "本文提出了一种混合分割模型，可以处理异质性功能数据，通过动态规划的EM算法近似最大似然估计器，方法在模拟与真实数据集上得到验证。",
    "en_tdlr": "The paper proposes a mixture model for segmenting functional data with heterogeneity in time and population to maintain functional structure, which is approximated using an EM algorithm with dynamic programming. The approach is validated using both simulated and real data sets."
}