{
    "title": "FTSO: Effective NAS via First Topology Second Operator. (arXiv:2303.12948v1 [cs.CV])",
    "abstract": "Existing one-shot neural architecture search (NAS) methods have to conduct a search over a giant super-net, which leads to the huge computational cost. To reduce such cost, in this paper, we propose a method, called FTSO, to divide the whole architecture search into two sub-steps. Specifically, in the first step, we only search for the topology, and in the second step, we search for the operators. FTSO not only reduces NAS's search time from days to 0.68 seconds, but also significantly improves the found architecture's accuracy. Our extensive experiments on ImageNet show that within 18 seconds, FTSO can achieve a 76.4% testing accuracy, 1.5% higher than the SOTA, PC-DARTS. In addition, FTSO can reach a 97.77% testing accuracy, 0.27% higher than the SOTA, with nearly 100% (99.8%) search time saved, when searching on CIFAR10.",
    "link": "http://arxiv.org/abs/2303.12948",
    "context": "Title: FTSO: Effective NAS via First Topology Second Operator. (arXiv:2303.12948v1 [cs.CV])\nAbstract: Existing one-shot neural architecture search (NAS) methods have to conduct a search over a giant super-net, which leads to the huge computational cost. To reduce such cost, in this paper, we propose a method, called FTSO, to divide the whole architecture search into two sub-steps. Specifically, in the first step, we only search for the topology, and in the second step, we search for the operators. FTSO not only reduces NAS's search time from days to 0.68 seconds, but also significantly improves the found architecture's accuracy. Our extensive experiments on ImageNet show that within 18 seconds, FTSO can achieve a 76.4% testing accuracy, 1.5% higher than the SOTA, PC-DARTS. In addition, FTSO can reach a 97.77% testing accuracy, 0.27% higher than the SOTA, with nearly 100% (99.8%) search time saved, when searching on CIFAR10.",
    "path": "papers/23/03/2303.12948.json",
    "total_tokens": 936,
    "translated_title": "FTSO: 通过第一拓扑第二算子实现高效的 NAS",
    "translated_abstract": "现有的一次性神经架构搜索（NAS）方法必须在巨大的超级网络上进行搜索，这导致了巨大的计算成本。为了降低这种成本，本文提出了一种方法，称为 FTSO，将整个架构搜索分为两个子步骤。具体而言，在第一步中，我们仅搜索拓扑，而在第二步中，我们搜索算子。 FTSO 不仅将 NAS 的搜索时间从几天缩短到 0.68 秒，而且显着提高了搜索到的架构的准确性。 在 ImageNet 上进行的广泛实验表明，在 18 秒内，FTSO 可以实现 76.4％ 的测试准确率，比 SOTA（PC-DARTS）高 1.5％。此外，在 CIFAR10 上进行搜索时，FTSO 可达到 97.77％的测试准确度，比 SOTA 高 0.27％，并且几乎可以节省 100％（99.8％）的搜索时间。",
    "tldr": "本文提出了 FTSO 方法，将整个架构搜索分为两个子步骤：拓扑搜索和算子搜索。FTSO方法大大降低了 NAS 搜索的时间，同时提高了搜索到的架构准确性，并在ImageNet和CIFAR10数据集上达到了优秀的准确率。",
    "en_tdlr": "This paper proposes the FTSO method to divide the architecture search into two sub-steps: topology search and operator search. FTSO significantly reduces the search time of NAS, improves the accuracy of the found architecture and achieves excellent accuracy on ImageNet and CIFAR10 datasets."
}