{
    "title": "WebSHAP: Towards Explaining Any Machine Learning Models Anywhere. (arXiv:2303.09545v1 [cs.LG])",
    "abstract": "As machine learning (ML) is increasingly integrated into our everyday Web experience, there is a call for transparent and explainable web-based ML. However, existing explainability techniques often require dedicated backend servers, which limit their usefulness as the Web community moves toward in-browser ML for lower latency and greater privacy. To address the pressing need for a client-side explainability solution, we present WebSHAP, the first in-browser tool that adapts the state-of-the-art model-agnostic explainability technique SHAP to the Web environment. Our open-source tool is developed with modern Web technologies such as WebGL that leverage client-side hardware capabilities and make it easy to integrate into existing Web ML applications. We demonstrate WebSHAP in a usage scenario of explaining ML-based loan approval decisions to loan applicants. Reflecting on our work, we discuss the opportunities and challenges for future research on transparent Web ML. WebSHAP is available",
    "link": "http://arxiv.org/abs/2303.09545",
    "context": "Title: WebSHAP: Towards Explaining Any Machine Learning Models Anywhere. (arXiv:2303.09545v1 [cs.LG])\nAbstract: As machine learning (ML) is increasingly integrated into our everyday Web experience, there is a call for transparent and explainable web-based ML. However, existing explainability techniques often require dedicated backend servers, which limit their usefulness as the Web community moves toward in-browser ML for lower latency and greater privacy. To address the pressing need for a client-side explainability solution, we present WebSHAP, the first in-browser tool that adapts the state-of-the-art model-agnostic explainability technique SHAP to the Web environment. Our open-source tool is developed with modern Web technologies such as WebGL that leverage client-side hardware capabilities and make it easy to integrate into existing Web ML applications. We demonstrate WebSHAP in a usage scenario of explaining ML-based loan approval decisions to loan applicants. Reflecting on our work, we discuss the opportunities and challenges for future research on transparent Web ML. WebSHAP is available",
    "path": "papers/23/03/2303.09545.json",
    "total_tokens": 888,
    "translated_title": "WebSHAP: 面向任意机器学习模型的解释工具",
    "translated_abstract": "随着机器学习被越来越广泛地应用于我们日常的网络体验中，人们越来越需要透明和可解释的基于Web的机器学习。 然而，现有的解释技术往往需要专用的后端服务器，这限制了它们在向较低延迟和更高隐私性的基于浏览器的Web ML迁移时的实用性。为了解决客户端解释方案的迫切需求，我们提出了WebSHAP，这是第一个将先进的模型无关解释技术SHAP适应Web环境的浏览器内工具。我们的开源工具是使用现代Web技术（如WebGL）开发的，利用客户端硬件能力，易于集成到现有的Web ML应用程序中。我们演示了WebSHAP在解释基于ML的贷款批准决策的使用场景中的应用。 回顾我们的工作，我们讨论了透明Web ML的未来研究机会和挑战。WebSHAP现已提供。",
    "tldr": "WebSHAP是第一个将先进的模型无关解释技术SHAP适应Web环境的浏览器内工具，可用于解释基于ML的贷款批准决策。",
    "en_tdlr": "WebSHAP is the first in-browser tool that adapts the state-of-the-art model-agnostic explainability technique SHAP to the Web environment, which can be used for explaining ML-based loan approval decisions."
}