{
    "title": "Spatially-Aware Car-Sharing Demand Prediction. (arXiv:2303.14421v1 [cs.LG])",
    "abstract": "In recent years, car-sharing services have emerged as viable alternatives to private individual mobility, promising more sustainable and resource-efficient, but still comfortable transportation. Research on short-term prediction and optimization methods has improved operations and fleet control of car-sharing services; however, long-term projections and spatial analysis are sparse in the literature. We propose to analyze the average monthly demand in a station-based car-sharing service with spatially-aware learning algorithms that offer high predictive performance as well as interpretability. In particular, we compare the spatially-implicit Random Forest model with spatially-aware methods for predicting average monthly per-station demand. The study utilizes a rich set of socio-demographic, location-based (e.g., POIs), and car-sharing-specific features as input, extracted from a large proprietary car-sharing dataset and publicly available datasets. We show that the global Random Forest ",
    "link": "http://arxiv.org/abs/2303.14421",
    "context": "Title: Spatially-Aware Car-Sharing Demand Prediction. (arXiv:2303.14421v1 [cs.LG])\nAbstract: In recent years, car-sharing services have emerged as viable alternatives to private individual mobility, promising more sustainable and resource-efficient, but still comfortable transportation. Research on short-term prediction and optimization methods has improved operations and fleet control of car-sharing services; however, long-term projections and spatial analysis are sparse in the literature. We propose to analyze the average monthly demand in a station-based car-sharing service with spatially-aware learning algorithms that offer high predictive performance as well as interpretability. In particular, we compare the spatially-implicit Random Forest model with spatially-aware methods for predicting average monthly per-station demand. The study utilizes a rich set of socio-demographic, location-based (e.g., POIs), and car-sharing-specific features as input, extracted from a large proprietary car-sharing dataset and publicly available datasets. We show that the global Random Forest ",
    "path": "papers/23/03/2303.14421.json",
    "total_tokens": 894,
    "translated_title": "空间感知的共享汽车需求预测",
    "translated_abstract": "近年来，共享汽车服务作为私人个人出行的可行替代品出现，承诺更可持续、资源利用效率更高，但仍然等同于私人出行。关于短期预测和优化方法的研究已经改善了共享汽车服务的运营和车队控制;然而，在文献中长期预测和空间分析是缺乏的。我们建议使用具有空间感知学习算法的平均月度需求来分析基于站点的共享汽车服务，这种算法既具有高预测性能，又具有可解释性。具体而言，我们比较了全球随机森林模型与空间感知方法来预测平均每个站点的月度需求。该研究利用了丰富的社会-人口学、基于位置的(例如POI)和共享汽车特定特征作为输入，这些特征来自一个大型的专有共享汽车数据集和公开可用的数据集。我们展示了全球随机森林模型通常表现最好，但在某些情况下，空间感知方法可以提高预测性能。",
    "tldr": "本文提出了一种基于空间感知学习算法的方法来分析共享汽车站点的平均月度需求，利用了丰富的特征作为输入，可以提高预测性能。",
    "en_tdlr": "This paper proposes a spatially-aware learning algorithm to analyze the demand for station-based car-sharing services on a monthly basis, using a rich set of features as input to improve predictive performance."
}