{
    "title": "MSTFormer: Motion Inspired Spatial-temporal Transformer with Dynamic-aware Attention for long-term Vessel Trajectory Prediction. (arXiv:2303.11540v1 [cs.LG])",
    "abstract": "Incorporating the dynamics knowledge into the model is critical for achieving accurate trajectory prediction while considering the spatial and temporal characteristics of the vessel. However, existing methods rarely consider the underlying dynamics knowledge and directly use machine learning algorithms to predict the trajectories. Intuitively, the vessel's motions are following the laws of dynamics, e.g., the speed of a vessel decreases when turning a corner. Yet, it is challenging to combine dynamic knowledge and neural networks due to their inherent heterogeneity. Against this background, we propose MSTFormer, a motion inspired vessel trajectory prediction method based on Transformer. The contribution of this work is threefold. First, we design a data augmentation method to describe the spatial features and motion features of the trajectory. Second, we propose a Multi-headed Dynamic-aware Self-attention mechanism to focus on trajectory points with frequent motion transformations. Fin",
    "link": "http://arxiv.org/abs/2303.11540",
    "context": "Title: MSTFormer: Motion Inspired Spatial-temporal Transformer with Dynamic-aware Attention for long-term Vessel Trajectory Prediction. (arXiv:2303.11540v1 [cs.LG])\nAbstract: Incorporating the dynamics knowledge into the model is critical for achieving accurate trajectory prediction while considering the spatial and temporal characteristics of the vessel. However, existing methods rarely consider the underlying dynamics knowledge and directly use machine learning algorithms to predict the trajectories. Intuitively, the vessel's motions are following the laws of dynamics, e.g., the speed of a vessel decreases when turning a corner. Yet, it is challenging to combine dynamic knowledge and neural networks due to their inherent heterogeneity. Against this background, we propose MSTFormer, a motion inspired vessel trajectory prediction method based on Transformer. The contribution of this work is threefold. First, we design a data augmentation method to describe the spatial features and motion features of the trajectory. Second, we propose a Multi-headed Dynamic-aware Self-attention mechanism to focus on trajectory points with frequent motion transformations. Fin",
    "path": "papers/23/03/2303.11540.json",
    "total_tokens": 913,
    "translated_title": "MSTFormer：动态感知注意力的运动启发式时空Transformer用于长期船舶轨迹预测",
    "translated_abstract": "将动态知识纳入模型对于准确预测航迹至关重要，同时考虑船舶的空间和时间特征。不过，现有方法很少考虑潜在的动态知识，直接使用机器学习算法来预测航迹。直观地，船舶的运动遵循动力学定律，例如，转弯时速度会下降。然而，由于深度神经网络和动力学定律的内在异质性，将动态知识与神经网络相结合具有挑战性。在此背景下，我们提出了MSTFormer，一种基于Transformer的运动启发式船舶轨迹预测方法。本文的贡献有三个方面。首先，我们设计了一种数据增强方法来描述轨迹的空间特征和运动特征。其次，我们提出了一个多头动态感知自注意机制，以专注于运动变换频繁的轨迹点。",
    "tldr": "该论文提出了一种基于Transformer和动态感知注意力机制的运动启发式船舶轨迹预测方法，通过数据增强方法描述轨迹的空间和运动特征，能够更加准确地预测船舶轨迹。",
    "en_tdlr": "This paper proposes a motion inspired vessel trajectory prediction method based on Transformer and dynamic-aware attention mechanism, which describes the spatial and motion features of the trajectory using data augmentation method and focuses on trajectory points with frequent motion transformations using a multi-headed dynamic-aware self-attention mechanism, resulting in more accurate vessel trajectory prediction."
}