{
    "title": "Neural-BO: A Black-box Optimization Algorithm using Deep Neural Networks. (arXiv:2303.01682v2 [cs.LG] UPDATED)",
    "abstract": "Bayesian Optimization (BO) is an effective approach for global optimization of black-box functions when function evaluations are expensive. Most prior works use Gaussian processes to model the black-box function, however, the use of kernels in Gaussian processes leads to two problems: first, the kernel-based methods scale poorly with the number of data points and second, kernel methods are usually not effective on complex structured high dimensional data due to curse of dimensionality. Therefore, we propose a novel black-box optimization algorithm where the black-box function is modeled using a neural network. Our algorithm does not need a Bayesian neural network to estimate predictive uncertainty and is therefore computationally favorable. We analyze the theoretical behavior of our algorithm in terms of regret bound using advances in NTK theory showing its efficient convergence. We perform experiments with both synthetic and real-world optimization tasks and show that our algorithm is",
    "link": "http://arxiv.org/abs/2303.01682",
    "context": "Title: Neural-BO: A Black-box Optimization Algorithm using Deep Neural Networks. (arXiv:2303.01682v2 [cs.LG] UPDATED)\nAbstract: Bayesian Optimization (BO) is an effective approach for global optimization of black-box functions when function evaluations are expensive. Most prior works use Gaussian processes to model the black-box function, however, the use of kernels in Gaussian processes leads to two problems: first, the kernel-based methods scale poorly with the number of data points and second, kernel methods are usually not effective on complex structured high dimensional data due to curse of dimensionality. Therefore, we propose a novel black-box optimization algorithm where the black-box function is modeled using a neural network. Our algorithm does not need a Bayesian neural network to estimate predictive uncertainty and is therefore computationally favorable. We analyze the theoretical behavior of our algorithm in terms of regret bound using advances in NTK theory showing its efficient convergence. We perform experiments with both synthetic and real-world optimization tasks and show that our algorithm is",
    "path": "papers/23/03/2303.01682.json",
    "total_tokens": 815,
    "translated_title": "Neural-BO: 使用深度神经网络的黑盒优化算法",
    "translated_abstract": "贝叶斯优化（BO）是一种对黑盒函数进行全局优化的有效方法，当函数评估代价高时。之前的大部分工作使用高斯过程来模拟黑盒函数，然而，高斯过程中使用的核函数导致了两个问题：一是基于核函数的方法在数据点数量较大时缩放困难，二是核方法在复杂结构高维数据上通常效果不佳，因为维数灾难。因此，我们提出了一种新颖的黑盒优化算法，其中黑盒函数使用神经网络进行建模。我们的算法不需要贝叶斯神经网络来估计预测不确定性，因此计算上更加有利。我们使用NTK理论的进展分析了我们算法的理论行为，展示了其收敛的高效性。我们在合成和真实世界的优化任务上进行了实验，证明了我们算法的",
    "tldr": "Neural-BO是一种使用神经网络模型的黑盒优化算法，避免了高斯过程中的缩放和维数问题，具有高效收敛的特性。",
    "en_tdlr": "Neural-BO is a black-box optimization algorithm that uses neural networks to model the black-box function, avoiding the scaling and dimensionality problems of Gaussian processes and demonstrating efficient convergence."
}