{
    "title": "Verbal behavior without syntactic structures: beyond Skinner and Chomsky. (arXiv:2303.08080v1 [cs.CL])",
    "abstract": "What does it mean to know language? Since the Chomskian revolution, one popular answer to this question has been: to possess a generative grammar that exclusively licenses certain syntactic structures. Decades later, not even an approximation to such a grammar, for any language, has been formulated; the idea that grammar is universal and innately specified has proved barren; and attempts to show how it could be learned from experience invariably come up short. To move on from this impasse, we must rediscover the extent to which language is like any other human behavior: dynamic, social, multimodal, patterned, and purposive, its purpose being to promote desirable actions (or thoughts) in others and self. Recent psychological, computational, neurobiological, and evolutionary insights into the shaping and structure of behavior may then point us toward a new, viable account of language.",
    "link": "http://arxiv.org/abs/2303.08080",
    "context": "Title: Verbal behavior without syntactic structures: beyond Skinner and Chomsky. (arXiv:2303.08080v1 [cs.CL])\nAbstract: What does it mean to know language? Since the Chomskian revolution, one popular answer to this question has been: to possess a generative grammar that exclusively licenses certain syntactic structures. Decades later, not even an approximation to such a grammar, for any language, has been formulated; the idea that grammar is universal and innately specified has proved barren; and attempts to show how it could be learned from experience invariably come up short. To move on from this impasse, we must rediscover the extent to which language is like any other human behavior: dynamic, social, multimodal, patterned, and purposive, its purpose being to promote desirable actions (or thoughts) in others and self. Recent psychological, computational, neurobiological, and evolutionary insights into the shaping and structure of behavior may then point us toward a new, viable account of language.",
    "path": "papers/23/03/2303.08080.json",
    "total_tokens": 888,
    "translated_title": "语法结构外的言语行为：超越斯金纳和乔姆斯基",
    "translated_abstract": "什么是语言认知？自乔姆斯基革命以来，对这个问题的一个普遍回答是：拥有产生语法结构的生成式语法。数十年过去了，任何语言的近似语法结构都未被制定出来。通用语法是天生具有的，这个理念已经证明是毫无成果的。试图展示语法如何从经验中学习也屡屡失败。为了摆脱这个僵局，我们必须重新发现语言与所有其他人类行为的相似性：动态的、社交的、多模态的、有模式的、有目的性的，其目的是促进他人和自己的理想行为（或思考）。最近对行为塑造和结构的心理、计算、神经生物学和进化方面的了解，可能会指引我们走向一种新的、可行的语言理论。",
    "tldr": "语言的认知不能仅仅局限于语法结构研究，其模式化、动态的、多模态的、具有目的性及促进他人和自身理想行为（或思考）的特质可能是一个新的、可行的语言理论。",
    "en_tdlr": "Language cognition cannot be limited to the study of grammatical structures alone. Its patterned, dynamic, multimodal, purposive nature and its ability to promote desirable actions (or thoughts) in others and oneself may lead us to a new viable theory of language beyond grammar structures, based on recent insights from psychology, computation, neurobiology, and evolution."
}