{
    "title": "Geometric Deep Learning for Molecular Crystal Structure Prediction. (arXiv:2303.10140v1 [cond-mat.mtrl-sci])",
    "abstract": "We develop and test new machine learning strategies for accelerating molecular crystal structure ranking and crystal property prediction using tools from geometric deep learning on molecular graphs. Leveraging developments in graph-based learning and the availability of large molecular crystal datasets, we train models for density prediction and stability ranking which are accurate, fast to evaluate, and applicable to molecules of widely varying size and composition. Our density prediction model, MolXtalNet-D, achieves state of the art performance, with lower than 2% mean absolute error on a large and diverse test dataset. Our crystal ranking tool, MolXtalNet-S, correctly discriminates experimental samples from synthetically generated fakes and is further validated through analysis of the submissions to the Cambridge Structural Database Blind Tests 5 and 6. Our new tools are computationally cheap and flexible enough to be deployed within an existing crystal structure prediction pipelin",
    "link": "http://arxiv.org/abs/2303.10140",
    "context": "Title: Geometric Deep Learning for Molecular Crystal Structure Prediction. (arXiv:2303.10140v1 [cond-mat.mtrl-sci])\nAbstract: We develop and test new machine learning strategies for accelerating molecular crystal structure ranking and crystal property prediction using tools from geometric deep learning on molecular graphs. Leveraging developments in graph-based learning and the availability of large molecular crystal datasets, we train models for density prediction and stability ranking which are accurate, fast to evaluate, and applicable to molecules of widely varying size and composition. Our density prediction model, MolXtalNet-D, achieves state of the art performance, with lower than 2% mean absolute error on a large and diverse test dataset. Our crystal ranking tool, MolXtalNet-S, correctly discriminates experimental samples from synthetically generated fakes and is further validated through analysis of the submissions to the Cambridge Structural Database Blind Tests 5 and 6. Our new tools are computationally cheap and flexible enough to be deployed within an existing crystal structure prediction pipelin",
    "path": "papers/23/03/2303.10140.json",
    "total_tokens": 903,
    "translated_title": "分子晶体结构预测中的几何深度学习",
    "translated_abstract": "我们使用分子图形的几何深度学习工具，开发和测试了新的机器学习策略，加速了分子晶体结构排名和晶体性质预测。利用基于图形的学习和大型分子晶体数据集的发展，我们训练了密度预测和稳定性排名模型，这些模型精确、评估速度快，并且适用于不同大小和成分的分子。我们的密度预测模型MolXtalNet-D实现了最先进的性能，在大而多样的测试数据集上均方根误差小于2%。我们的晶体排名工具MolXtalNet-S能够正确区分实验样品和合成生成的假样品，并通过对剑桥结构数据库盲测试5和6的提交分析进一步验证。我们的新工具计算成本低廉且灵活，可以在现有的晶体结构预测流程中部署。",
    "tldr": "本研究使用基于分子图形的几何深度学习开发出能够精确、快速评估和适用于不同分子的密度预测和稳定性排名模型，这些模型可用于分子晶体结构预测。同时，我们开发的晶体排名工具具有低成本、灵活部署等优点。",
    "en_tdlr": "This study applies geometric deep learning on molecular graphs to develop accurate and fast density prediction and stability ranking models, which can be used for molecular crystal structure prediction. The crystal ranking tool developed in this study is also computationally cheap and flexible for deployment."
}