{
    "title": "Using a Variational Autoencoder to Learn Valid Search Spaces of Safely Monitored Autonomous Robots for Last-Mile Delivery. (arXiv:2303.03211v2 [cs.NE] UPDATED)",
    "abstract": "The use of autonomous robots for delivery of goods to customers is an exciting new way to provide a reliable and sustainable service. However, in the real world, autonomous robots still require human supervision for safety reasons. We tackle the realworld problem of optimizing autonomous robot timings to maximize deliveries, while ensuring that there are never too many robots running simultaneously so that they can be monitored safely. We assess the use of a recent hybrid machine-learningoptimization approach COIL (constrained optimization in learned latent space) and compare it with a baseline genetic algorithm for the purposes of exploring variations of this problem. We also investigate new methods for improving the speed and efficiency of COIL. We show that only COIL can find valid solutions where appropriate numbers of robots run simultaneously for all problem variations tested. We also show that when COIL has learned its latent representation, it can optimize 10% faster than the G",
    "link": "http://arxiv.org/abs/2303.03211",
    "context": "Title: Using a Variational Autoencoder to Learn Valid Search Spaces of Safely Monitored Autonomous Robots for Last-Mile Delivery. (arXiv:2303.03211v2 [cs.NE] UPDATED)\nAbstract: The use of autonomous robots for delivery of goods to customers is an exciting new way to provide a reliable and sustainable service. However, in the real world, autonomous robots still require human supervision for safety reasons. We tackle the realworld problem of optimizing autonomous robot timings to maximize deliveries, while ensuring that there are never too many robots running simultaneously so that they can be monitored safely. We assess the use of a recent hybrid machine-learningoptimization approach COIL (constrained optimization in learned latent space) and compare it with a baseline genetic algorithm for the purposes of exploring variations of this problem. We also investigate new methods for improving the speed and efficiency of COIL. We show that only COIL can find valid solutions where appropriate numbers of robots run simultaneously for all problem variations tested. We also show that when COIL has learned its latent representation, it can optimize 10% faster than the G",
    "path": "papers/23/03/2303.03211.json",
    "total_tokens": 808,
    "translated_title": "使用变分自编码器学习自主机器人最后一英里可靠监控的有效搜索空间",
    "translated_abstract": "使用自主机器人送货给客户是一种可靠且可持续的服务方式。然而，在实际情况下，为了安全起见，自主机器人仍需要人类监督。本文解决了在保证安全监控的前提下，最大化自主机器人配送效率的问题。我们评估了一个基于机器学习和优化的方法 COIL（在学习的潜在空间中进行约束优化），并将其与基准遗传算法进行比较。我们还研究了改善 COIL 的速度和效率的新方法。我们表明只有 COIL 能够找到所有问题变化测试中适当数量的机器人同时运行的有效解决方案。我们还表明，当 COIL 学习其潜在表示时，可以比 G（遗传算法）更快地进行优化。",
    "tldr": "本文使用 COIL 方法研究了有效的自主机器人配送问题，确保在保证安全监控的前提下最大化机器人配送效率。",
    "en_tdlr": "This paper explores effective autonomous robot delivery problem using the COIL approach to maximize robot delivery efficiency while ensuring safety monitoring."
}