{
    "title": "Automated Interactive Domain-Specific Conversational Agents that Understand Human Dialogs. (arXiv:2303.08941v1 [cs.AI])",
    "abstract": "Achieving human-like communication with machines remains a classic, challenging topic in the field of Knowledge Representation and Reasoning and Natural Language Processing. These Large Language Models (LLMs) rely on pattern-matching rather than a true understanding of the semantic meaning of a sentence. As a result, they may generate incorrect responses. To generate an assuredly correct response, one has to \"understand\" the semantics of a sentence. To achieve this \"understanding\", logic-based (commonsense) reasoning methods such as Answer Set Programming (ASP) are arguably needed. In this paper, we describe the AutoConcierge system that leverages LLMs and ASP to develop a conversational agent that can truly \"understand\" human dialogs in restricted domains. AutoConcierge is focused on a specific domain-advising users about restaurants in their local area based on their preferences. AutoConcierge will interactively understand a user's utterances, identify the missing information in them",
    "link": "http://arxiv.org/abs/2303.08941",
    "context": "Title: Automated Interactive Domain-Specific Conversational Agents that Understand Human Dialogs. (arXiv:2303.08941v1 [cs.AI])\nAbstract: Achieving human-like communication with machines remains a classic, challenging topic in the field of Knowledge Representation and Reasoning and Natural Language Processing. These Large Language Models (LLMs) rely on pattern-matching rather than a true understanding of the semantic meaning of a sentence. As a result, they may generate incorrect responses. To generate an assuredly correct response, one has to \"understand\" the semantics of a sentence. To achieve this \"understanding\", logic-based (commonsense) reasoning methods such as Answer Set Programming (ASP) are arguably needed. In this paper, we describe the AutoConcierge system that leverages LLMs and ASP to develop a conversational agent that can truly \"understand\" human dialogs in restricted domains. AutoConcierge is focused on a specific domain-advising users about restaurants in their local area based on their preferences. AutoConcierge will interactively understand a user's utterances, identify the missing information in them",
    "path": "papers/23/03/2303.08941.json",
    "total_tokens": 881,
    "translated_title": "自动化交互式特定领域对话代理，理解人类对话",
    "translated_abstract": "在知识表示与推理以及自然语言处理领域，实现与人类的人类对话相似的通信仍然是一个经典而具有挑战性的主题。这些大型语言模型（LLM）依赖于模式匹配，而不是真正理解句子的语义含义。因此，它们可能会生成错误的响应。要生成保证正确的响应，必须“理解”句子的语义。为了实现这种“理解”，需要基于逻辑的（常识）推理方法，例如答案集编程（ASP）。在本文中，我们描述了AutoConcierge系统，它利用LLMs和ASP开发了一种对话代理，可以真正“理解”受限领域内的人类对话。AutoConcierge专注于一个特定的领域-根据用户的喜好建议他们附近的餐厅。AutoConcierge将交互式地理解用户的话语，确定其中缺失的信息。",
    "tldr": "本文介绍了利用大型语言模型和Answer Set Programming实现真正“理解”人类对话的AutoConcierge系统。该系统针对特定领域，为用户提供有关附近餐厅的建议。",
    "en_tdlr": "This paper introduces the AutoConcierge system, which utilizes Large Language Models and Answer Set Programming to truly \"understand\" human dialogue in a specific domain, providing users with recommendations about nearby restaurants based on their preferences."
}