{
    "title": "Standard errors when a regressor is randomly assigned. (arXiv:2303.10306v1 [econ.EM])",
    "abstract": "We examine asymptotic properties of the OLS estimator when the values of the regressor of interest are assigned randomly and independently of other regressors. We find that the OLS variance formula in this case is often simplified, sometimes substantially. In particular, when the regressor of interest is independent not only of other regressors but also of the error term, the textbook homoskedastic variance formula is valid even if the error term and auxiliary regressors exhibit a general dependence structure. In the context of randomized controlled trials, this conclusion holds in completely randomized experiments with constant treatment effects. When the error term is heteroscedastic with respect to the regressor of interest, the variance formula has to be adjusted not only for heteroscedasticity but also for correlation structure of the error term. However, even in the latter case, some simplifications are possible as only a part of the correlation structure of the error term should",
    "link": "http://arxiv.org/abs/2303.10306",
    "context": "Title: Standard errors when a regressor is randomly assigned. (arXiv:2303.10306v1 [econ.EM])\nAbstract: We examine asymptotic properties of the OLS estimator when the values of the regressor of interest are assigned randomly and independently of other regressors. We find that the OLS variance formula in this case is often simplified, sometimes substantially. In particular, when the regressor of interest is independent not only of other regressors but also of the error term, the textbook homoskedastic variance formula is valid even if the error term and auxiliary regressors exhibit a general dependence structure. In the context of randomized controlled trials, this conclusion holds in completely randomized experiments with constant treatment effects. When the error term is heteroscedastic with respect to the regressor of interest, the variance formula has to be adjusted not only for heteroscedasticity but also for correlation structure of the error term. However, even in the latter case, some simplifications are possible as only a part of the correlation structure of the error term should",
    "path": "papers/23/03/2303.10306.json",
    "total_tokens": 988,
    "translated_title": "随机分配回归变量时的标准误分析",
    "translated_abstract": "本文研究OLS估计当回归变量的值随机且独立于其他回归变量时的渐近性质。我们发现在这种情况下，OLS的方差公式通常可以简化，有时甚至可以大幅简化。特别地，当感兴趣的回归变量不仅与其他回归变量独立，而且与误差项也独立时，即使误差项和辅助回归器表现出普遍的依赖结构，教科书中的均方差公式也是有效的。在随机控制试验的背景下，当治疗效应恒定且完全随机分配时，该结论适用。当误差项关于回归变量的异方差时，方差公式不仅必须考虑异方差性，还必须考虑误差项的相关结构。但即使在后一种情况下，也可能存在一些简化。",
    "tldr": "研究了回归变量随机分配时OLS估计的方差计算，发现在回归变量与误差项相互独立时，教科书中的方差公式成立，即使误差项与辅助回归变量存在依赖结构，该结论在随机控制试验中适用。当回归变量的异方差和误差项的相关结构均存在时，方差公式需要相应调整。",
    "en_tdlr": "This paper investigates the OLS estimator variance formula when the regressor of interest is randomly and independently assigned, and finds that the textbook homoskedastic variance formula is valid even if the error term and auxiliary regressors exhibit a general dependence structure, while heteroscedasticity and correlation structure of the error term need to be considered in some cases. The conclusion holds in completely randomized experiments with constant treatment effects."
}