{
    "title": "Enhancing Embedding Representations of Biomedical Data using Logic Knowledge. (arXiv:2303.13566v1 [cs.AI])",
    "abstract": "Knowledge Graph Embeddings (KGE) have become a quite popular class of models specifically devised to deal with ontologies and graph structure data, as they can implicitly encode statistical dependencies between entities and relations in a latent space. KGE techniques are particularly effective for the biomedical domain, where it is quite common to deal with large knowledge graphs underlying complex interactions between biological and chemical objects. Recently in the literature, the PharmKG dataset has been proposed as one of the most challenging knowledge graph biomedical benchmark, with hundreds of thousands of relational facts between genes, diseases and chemicals. Despite KGEs can scale to very large relational domains, they generally fail at representing more complex relational dependencies between facts, like logic rules, which may be fundamental in complex experimental settings. In this paper, we exploit logic rules to enhance the embedding representations of KGEs on the PharmKG",
    "link": "http://arxiv.org/abs/2303.13566",
    "context": "Title: Enhancing Embedding Representations of Biomedical Data using Logic Knowledge. (arXiv:2303.13566v1 [cs.AI])\nAbstract: Knowledge Graph Embeddings (KGE) have become a quite popular class of models specifically devised to deal with ontologies and graph structure data, as they can implicitly encode statistical dependencies between entities and relations in a latent space. KGE techniques are particularly effective for the biomedical domain, where it is quite common to deal with large knowledge graphs underlying complex interactions between biological and chemical objects. Recently in the literature, the PharmKG dataset has been proposed as one of the most challenging knowledge graph biomedical benchmark, with hundreds of thousands of relational facts between genes, diseases and chemicals. Despite KGEs can scale to very large relational domains, they generally fail at representing more complex relational dependencies between facts, like logic rules, which may be fundamental in complex experimental settings. In this paper, we exploit logic rules to enhance the embedding representations of KGEs on the PharmKG",
    "path": "papers/23/03/2303.13566.json",
    "total_tokens": 875,
    "translated_title": "使用逻辑知识增强生物医学数据的嵌入表示",
    "translated_abstract": "知识图谱嵌入（KGE）已经成为一种流行的模型，专门设计用于处理本体论和图形结构数据，因为它们可以隐式地在潜在空间中编码实体和关系之间的统计依赖关系。 KGE技术在生物医学领域特别有效，因为在生物和化学对象之间存在复杂的相互作用，因此处理大型知识图谱非常常见。最近，PharmKG数据集被提出作为最具挑战性的知识图谱生物医学基准之一，其中涉及基因，疾病和化学物质之间数十万个关系事实。尽管 KGE 可以处理非常大的关系域，但它们通常无法表示关系事实之间更复杂的关系依赖性，例如逻辑规则，在复杂的实验环境中可能是基本的。在本文中，我们利用逻辑规则增强KGE在PharmKG数据集上的嵌入表示。",
    "tldr": "本文提出使用逻辑规则增强生物医学数据的嵌入表示，应用于最具挑战性的PharmKG数据集，并能够处理复杂的实验环境中关系事实之间的依赖性。",
    "en_tdlr": "This paper proposes enhancing the embedding representations of biomedical data using logic rules, applied to the challenging PharmKG dataset and enabling the handling of complex dependency relationships between relationship facts in experimental environments."
}