{
    "title": "Graph Neural Rough Differential Equations for Traffic Forecasting. (arXiv:2303.10909v2 [cs.LG] UPDATED)",
    "abstract": "Traffic forecasting is one of the most popular spatio-temporal tasks in the field of machine learning. A prevalent approach in the field is to combine graph convolutional networks and recurrent neural networks for the spatio-temporal processing. There has been fierce competition and many novel methods have been proposed. In this paper, we present the method of spatio-temporal graph neural rough differential equation (STG-NRDE). Neural rough differential equations (NRDEs) are a breakthrough concept for processing time-series data. Their main concept is to use the log-signature transform to convert a time-series sample into a relatively shorter series of feature vectors. We extend the concept and design two NRDEs: one for the temporal processing and the other for the spatial processing. After that, we combine them into a single framework. We conduct experiments with 6 benchmark datasets and 27 baselines. STG-NRDE shows the best accuracy in all cases, outperforming all those 27 baselines ",
    "link": "http://arxiv.org/abs/2303.10909",
    "context": "Title: Graph Neural Rough Differential Equations for Traffic Forecasting. (arXiv:2303.10909v2 [cs.LG] UPDATED)\nAbstract: Traffic forecasting is one of the most popular spatio-temporal tasks in the field of machine learning. A prevalent approach in the field is to combine graph convolutional networks and recurrent neural networks for the spatio-temporal processing. There has been fierce competition and many novel methods have been proposed. In this paper, we present the method of spatio-temporal graph neural rough differential equation (STG-NRDE). Neural rough differential equations (NRDEs) are a breakthrough concept for processing time-series data. Their main concept is to use the log-signature transform to convert a time-series sample into a relatively shorter series of feature vectors. We extend the concept and design two NRDEs: one for the temporal processing and the other for the spatial processing. After that, we combine them into a single framework. We conduct experiments with 6 benchmark datasets and 27 baselines. STG-NRDE shows the best accuracy in all cases, outperforming all those 27 baselines ",
    "path": "papers/23/03/2303.10909.json",
    "total_tokens": 872,
    "translated_title": "基于图神经粗糙微分方程的交通预测方法",
    "translated_abstract": "交通预测是机器学习中最受欢迎的时空任务之一。目前广泛使用的方法是将图卷积网络和循环神经网络组合起来进行时空处理。本文提出了一种新的时空图神经粗糙微分方程（STG-NRDE）方法。我们利用神经粗糙微分方程（NRDE）的对数签名变换将时间序列数据转换为较短的特征向量序列，并将其扩展应用于时空处理。我们将两种NRDE设计成一个框架用于交通预测。实验数据集包括6个基准数据集和27个基线模型。实验结果表明，STG-NRDE在所有情况下都表现出最佳准确性，胜过这27个基线模型。",
    "tldr": "本文提出一种基于图神经粗糙微分方程的交通预测方法(STG-NRDE)，通过两个NRDE进行时空处理并组合起来构成一个框架。实验结果表明，在6个基准数据集和27个基线模型上表现最佳。"
}