{
    "title": "Physics-informed neural networks for solving forward and inverse problems in complex beam systems. (arXiv:2303.01055v2 [cs.LG] UPDATED)",
    "abstract": "This paper proposes a new framework using physics-informed neural networks (PINNs) to simulate complex structural systems that consist of single and double beams based on Euler-Bernoulli and Timoshenko theory, where the double beams are connected with a Winkler foundation. In particular, forward and inverse problems for the Euler-Bernoulli and Timoshenko partial differential equations (PDEs) are solved using nondimensional equations with the physics-informed loss function. Higher-order complex beam PDEs are efficiently solved for forward problems to compute the transverse displacements and cross-sectional rotations with less than 1e-3 percent error. Furthermore, inverse problems are robustly solved to determine the unknown dimensionless model parameters and applied force in the entire space-time domain, even in the case of noisy data. The results suggest that PINNs are a promising strategy for solving problems in engineering structures and machines involving beam systems.",
    "link": "http://arxiv.org/abs/2303.01055",
    "context": "Title: Physics-informed neural networks for solving forward and inverse problems in complex beam systems. (arXiv:2303.01055v2 [cs.LG] UPDATED)\nAbstract: This paper proposes a new framework using physics-informed neural networks (PINNs) to simulate complex structural systems that consist of single and double beams based on Euler-Bernoulli and Timoshenko theory, where the double beams are connected with a Winkler foundation. In particular, forward and inverse problems for the Euler-Bernoulli and Timoshenko partial differential equations (PDEs) are solved using nondimensional equations with the physics-informed loss function. Higher-order complex beam PDEs are efficiently solved for forward problems to compute the transverse displacements and cross-sectional rotations with less than 1e-3 percent error. Furthermore, inverse problems are robustly solved to determine the unknown dimensionless model parameters and applied force in the entire space-time domain, even in the case of noisy data. The results suggest that PINNs are a promising strategy for solving problems in engineering structures and machines involving beam systems.",
    "path": "papers/23/03/2303.01055.json",
    "total_tokens": 966,
    "translated_title": "使用物理信息神经网络在复杂梁系统中解决正向和逆向问题",
    "translated_abstract": "本文提出了一种新的框架，使用物理信息神经网络（PINNs）来模拟由欧拉-伯努利和Timoshenko理论构成的复杂结构系统，其中双梁与Winkler基础相连。特别地，使用物理信息损失函数解决了欧拉-伯努利和Timoshenko偏微分方程的正向和逆向问题。高阶复杂梁偏微分方程在正向问题中被高效地解决，以计算横向位移和横截面旋转，误差小于1e-3％。此外，逆向问题稳健地解决了在整个时空域内确定未知无量纲模型参数和施加力的问题，甚至在数据噪声存在的情况下。结果表明，PINNs是解决涉及梁系统的工程结构和机械问题的一种有前景的策略。",
    "tldr": "本文提出了一种使用物理信息神经网络（PINNs）解决复杂梁系统中正向和逆向问题的新框架，通过求解欧拉-伯努利和Timoshenko偏微分方程，高效地计算横向位移和横截面旋转，并稳健地确定未知模型参数和施加力，为工程结构和机械问题的解决提供了有前景的策略。",
    "en_tdlr": "This paper presents a new framework using physics-informed neural networks (PINNs) to solve forward and inverse problems in complex beam systems, efficiently computing transverse displacements and cross-sectional rotations by solving Euler-Bernoulli and Timoshenko partial differential equations, and robustly determining unknown model parameters and applied force, providing a promising strategy for solving engineering and mechanical problems involving beam systems."
}