{
    "title": "Domain Randomization for Robust, Affordable and Effective Closed-loop Control of Soft Robots. (arXiv:2303.04136v2 [cs.RO] UPDATED)",
    "abstract": "Soft robots are gaining popularity thanks to their intrinsic safety to contacts and adaptability. However, the potentially infinite number of Degrees of Freedom makes their modeling a daunting task, and in many cases only an approximated description is available. This challenge makes reinforcement learning (RL) based approaches inefficient when deployed on a realistic scenario, due to the large domain gap between models and the real platform. In this work, we demonstrate, for the first time, how Domain Randomization (DR) can solve this problem by enhancing RL policies for soft robots with: i) robustness w.r.t. unknown dynamics parameters; ii) reduced training times by exploiting drastically simpler dynamic models for learning; iii) better environment exploration, which can lead to exploitation of environmental constraints for optimal performance. Moreover, we introduce a novel algorithmic extension to previous adaptive domain randomization methods for the automatic inference of dynamic",
    "link": "http://arxiv.org/abs/2303.04136",
    "context": "Title: Domain Randomization for Robust, Affordable and Effective Closed-loop Control of Soft Robots. (arXiv:2303.04136v2 [cs.RO] UPDATED)\nAbstract: Soft robots are gaining popularity thanks to their intrinsic safety to contacts and adaptability. However, the potentially infinite number of Degrees of Freedom makes their modeling a daunting task, and in many cases only an approximated description is available. This challenge makes reinforcement learning (RL) based approaches inefficient when deployed on a realistic scenario, due to the large domain gap between models and the real platform. In this work, we demonstrate, for the first time, how Domain Randomization (DR) can solve this problem by enhancing RL policies for soft robots with: i) robustness w.r.t. unknown dynamics parameters; ii) reduced training times by exploiting drastically simpler dynamic models for learning; iii) better environment exploration, which can lead to exploitation of environmental constraints for optimal performance. Moreover, we introduce a novel algorithmic extension to previous adaptive domain randomization methods for the automatic inference of dynamic",
    "path": "papers/23/03/2303.04136.json",
    "total_tokens": 912,
    "translated_title": "面向软机器人的领域随机化实现鲁棒、经济和有效的闭环控制",
    "translated_abstract": "软机器人由于其固有的安全性和可适应性而越来越受欢迎。然而，无限的自由度使得它们的建模变得困难，而且在许多情况下只能得到一个近似的描述。这个挑战使得基于强化学习（RL）的方法在实际场景中变得低效，因为模型与真实平台之间存在巨大的领域差距。在这项工作中，我们首次展示了领域随机化（DR）如何通过增强软机器人的RL策略来解决这个问题：i）对未知动力学参数的鲁棒性；ii）通过利用更简化的动力学模型进行学习，减少训练时间；iii）更好的环境探索，可以利用环境约束以实现最佳性能。此外，我们还引入了一个新的算法扩展来自先前适应性领域随机化方法，用于自动推断动态特征。",
    "tldr": "本研究首次展示了领域随机化方法如何通过增强软机器人的强化学习策略来解决模型与真实平台之间的领域差距，实现鲁棒、经济和有效的闭环控制。"
}