{
    "title": "StyleGANEX: StyleGAN-Based Manipulation Beyond Cropped Aligned Faces. (arXiv:2303.06146v1 [cs.CV])",
    "abstract": "Recent advances in face manipulation using StyleGAN have produced impressive results. However, StyleGAN is inherently limited to cropped aligned faces at a fixed image resolution it is pre-trained on. In this paper, we propose a simple and effective solution to this limitation by using dilated convolutions to rescale the receptive fields of shallow layers in StyleGAN, without altering any model parameters. This allows fixed-size small features at shallow layers to be extended into larger ones that can accommodate variable resolutions, making them more robust in characterizing unaligned faces. To enable real face inversion and manipulation, we introduce a corresponding encoder that provides the first-layer feature of the extended StyleGAN in addition to the latent style code. We validate the effectiveness of our method using unaligned face inputs of various resolutions in a diverse set of face manipulation tasks, including facial attribute editing, super-resolution, sketch/mask-to-face ",
    "link": "http://arxiv.org/abs/2303.06146",
    "raw_ret": "{\n    \"translated_title\": \"StyleGANEX：基于StyleGAN的面部操作扩展到除了裁剪对齐的人脸之外\",\n    \"translated_abstract\": \"使用StyleGAN进行面部操作的最新进展取得了令人印象深刻的结果。然而，StyleGAN在固定图像分辨率下，本质上仅限于裁剪对齐的人脸。在本文中，我们通过使用扩张卷积来重新调整StyleGAN中浅层的接受域，而不改变任何模型参数，提出了一个简单有效的解决方案。这使得浅层固定大小的小特征可以扩展为可以适应变量分辨率的较大特征，使它们能够更好地表征不对齐的人脸。为了实现真实的面部反演和操作，我们引入了相应的编码器，除了潜在的样式代码外，还提供了扩展StyleGAN的第一层特征。我们在包括面部属性编辑、超分辨率、草图/面具到面部等各种分辨率的非对齐面部输入中验证了我们方法的有效性。\",\n    \"tldr\": \"本文提出了一种简单有效的解决方案，通过使用扩张卷积来重新调整StyleGAN中浅层的接受域，从而将StyleGAN的面部操作扩展到除了裁剪对齐的人脸之外，以实现真实的面部反演和操作。\"\n}<|im_sep|>",
    "total_tokens": 881,
    "ret": {
        "translated_title": "StyleGANEX：基于StyleGAN的面部操作扩展到除了裁剪对齐的人脸之外",
        "translated_abstract": "使用StyleGAN进行面部操作的最新进展取得了令人印象深刻的结果。然而，StyleGAN在固定图像分辨率下，本质上仅限于裁剪对齐的人脸。在本文中，我们通过使用扩张卷积来重新调整StyleGAN中浅层的接受域，而不改变任何模型参数，提出了一个简单有效的解决方案。这使得浅层固定大小的小特征可以扩展为可以适应变量分辨率的较大特征，使它们能够更好地表征不对齐的人脸。为了实现真实的面部反演和操作，我们引入了相应的编码器，除了潜在的样式代码外，还提供了扩展StyleGAN的第一层特征。我们在包括面部属性编辑、超分辨率、草图/面具到面部等各种分辨率的非对齐面部输入中验证了我们方法的有效性。",
        "tldr": "本文提出了一种简单有效的解决方案，通过使用扩张卷积来重新调整StyleGAN中浅层的接受域，从而将StyleGAN的面部操作扩展到除了裁剪对齐的人脸之外，以实现真实的面部反演和操作。"
    }
}