{
    "title": "ChatGPT Participates in a Computer Science Exam. (arXiv:2303.09461v1 [cs.CL])",
    "abstract": "We asked ChatGPT to participate in an undergraduate computer science exam on ''Algorithms and Data Structures''. We evaluated the program on the entire exam as posed to the students. We hand-copied its answers onto an exam sheet, which was subsequently graded in a blind setup alongside those of 200 participating students. We find that ChatGPT narrowly passed the exam, obtaining 20.5 out of 40 points. This impressive performance indicates that ChatGPT can indeed succeed in challenging tasks like university exams. At the same time, the tasks in our exam are structurally similar to those on other exams, solved homework problems, and teaching materials that can be found online. Therefore, it would be premature to conclude from this experiment that ChatGPT has any understanding of computer science. The transcript of our conversation with ChatGPT is available at \\url{https://github.com/tml-tuebingen/chatgpt-algorithm-exam}, and the entire graded exam is in the appendix of this paper.",
    "link": "http://arxiv.org/abs/2303.09461",
    "context": "Title: ChatGPT Participates in a Computer Science Exam. (arXiv:2303.09461v1 [cs.CL])\nAbstract: We asked ChatGPT to participate in an undergraduate computer science exam on ''Algorithms and Data Structures''. We evaluated the program on the entire exam as posed to the students. We hand-copied its answers onto an exam sheet, which was subsequently graded in a blind setup alongside those of 200 participating students. We find that ChatGPT narrowly passed the exam, obtaining 20.5 out of 40 points. This impressive performance indicates that ChatGPT can indeed succeed in challenging tasks like university exams. At the same time, the tasks in our exam are structurally similar to those on other exams, solved homework problems, and teaching materials that can be found online. Therefore, it would be premature to conclude from this experiment that ChatGPT has any understanding of computer science. The transcript of our conversation with ChatGPT is available at \\url{https://github.com/tml-tuebingen/chatgpt-algorithm-exam}, and the entire graded exam is in the appendix of this paper.",
    "path": "papers/23/03/2303.09461.json",
    "total_tokens": 850,
    "translated_title": "ChatGPT参加计算机科学考试",
    "translated_abstract": "我们要求ChatGPT参加“算法和数据结构”的本科计算机科学考试。我们评估了程序在整个考试中的表现，并将其答案手动复制到考试答题纸上，与其他200名学生一起进行匿名评分。我们发现ChatGPT勉强通过了考试，获得了40分中的20.5分。这个结果表明，ChatGPT确实可以在像大学考试这样的具有挑战性的任务中成功。同时，我们考试中的任务在结构上与其他在线可找到的考试卷、完成的作业问题和教学材料相似。因此，从这个实验中得出ChatGPT有任何计算机科学理解的结论是为时过早的。我们与ChatGPT的谈话记录可以在\\url{https://github.com/tml-tuebingen/chatgpt-algorithm-exam}上找到，整个评分考试在本文的附录中。",
    "tldr": "ChatGPT在算法和数据结构考试中取得20.5分的成绩，表现出能在具有挑战性的大学考试中成功，但不能说明其对计算机科学有理解。",
    "en_tdlr": "ChatGPT scored 20.5 points in an undergraduate computer science exam on algorithms and data structures, demonstrating its ability to succeed in challenging university exams. However, it cannot be concluded that ChatGPT has an understanding of computer science."
}