{
    "title": "Edge-aware Plug-and-play Scheme for Semantic Segmentation. (arXiv:2303.10307v1 [cs.CV])",
    "abstract": "Semantic segmentation is a classic and fundamental computer vision problem dedicated to assigning each pixel with its corresponding class. Some recent methods introduce edge-based information for improving the segmentation performance. However these methods are specific and limited to certain network architectures, and they can not be transferred to other models or tasks. Therefore, we propose an abstract and universal edge supervision method called Edge-aware Plug-and-play Scheme (EPS), which can be easily and quickly applied to any semantic segmentation models. The core is edge-width/thickness preserving guided for semantic segmentation. The EPS first extracts the Edge Ground Truth (Edge GT) with a predefined edge thickness from the training data; and then for any network architecture, it directly copies the decoder head for the auxiliary task with the Edge GT supervision. To ensure the edge thickness preserving consistantly, we design a new boundarybased loss, called Polar Hausdorff",
    "link": "http://arxiv.org/abs/2303.10307",
    "context": "Title: Edge-aware Plug-and-play Scheme for Semantic Segmentation. (arXiv:2303.10307v1 [cs.CV])\nAbstract: Semantic segmentation is a classic and fundamental computer vision problem dedicated to assigning each pixel with its corresponding class. Some recent methods introduce edge-based information for improving the segmentation performance. However these methods are specific and limited to certain network architectures, and they can not be transferred to other models or tasks. Therefore, we propose an abstract and universal edge supervision method called Edge-aware Plug-and-play Scheme (EPS), which can be easily and quickly applied to any semantic segmentation models. The core is edge-width/thickness preserving guided for semantic segmentation. The EPS first extracts the Edge Ground Truth (Edge GT) with a predefined edge thickness from the training data; and then for any network architecture, it directly copies the decoder head for the auxiliary task with the Edge GT supervision. To ensure the edge thickness preserving consistantly, we design a new boundarybased loss, called Polar Hausdorff",
    "path": "papers/23/03/2303.10307.json",
    "total_tokens": 840,
    "translated_title": "一种面向语义分割的边缘感知即插即用方案",
    "translated_abstract": "语义分割是一种经典且基础的计算机视觉问题，旨在将每个像素分配到其对应的类别。近期的一些方法引入了基于边缘信息的方法以提高分割性能。然而，这些方法仅限于特定的网络结构，无法转移到其他模型或任务中。因此，我们提出了一种抽象且通用的边缘监督方法，称为Edge-aware Plug-and-play Scheme (EPS)，可以轻松快速地应用于任何语义分割模型中。该方法的核心是边缘宽度/厚度保持的指导性语义分割。EPS首先从训练数据提取具有预定义边缘厚度的边缘真值（Edge GT），然后针对任何网络结构，直接利用辅助任务的解码器头以Edge GT监督的方式进行训练。为确保边缘厚度保持一致，我们设计了一种新的基于边界的损失，称为Polar Hausdorff。",
    "tldr": "本文提出了一种抽象且通用的边缘监督方法，可以轻松快速地应用于任何语义分割模型中，称为Edge-aware Plug-and-play Scheme (EPS)，其核心是边缘宽度/厚度保持的指导性语义分割。"
}