{
    "title": "Mastering Strategy Card Game (Hearthstone) with Improved Techniques. (arXiv:2303.05197v2 [cs.LG] UPDATED)",
    "abstract": "Strategy card game is a well-known genre that is demanding on the intelligent game-play and can be an ideal test-bench for AI. Previous work combines an end-to-end policy function and an optimistic smooth fictitious play, which shows promising performances on the strategy card game Legend of Code and Magic. In this work, we apply such algorithms to Hearthstone, a famous commercial game that is more complicated in game rules and mechanisms. We further propose several improved techniques and consequently achieve significant progress. For a machine-vs-human test we invite a Hearthstone streamer whose best rank was top 10 of the official league in China region that is estimated to be of millions of players. Our models defeat the human player in all Best-of-5 tournaments of full games (including both deck building and battle), showing a strong capability of decision making.",
    "link": "http://arxiv.org/abs/2303.05197",
    "context": "Title: Mastering Strategy Card Game (Hearthstone) with Improved Techniques. (arXiv:2303.05197v2 [cs.LG] UPDATED)\nAbstract: Strategy card game is a well-known genre that is demanding on the intelligent game-play and can be an ideal test-bench for AI. Previous work combines an end-to-end policy function and an optimistic smooth fictitious play, which shows promising performances on the strategy card game Legend of Code and Magic. In this work, we apply such algorithms to Hearthstone, a famous commercial game that is more complicated in game rules and mechanisms. We further propose several improved techniques and consequently achieve significant progress. For a machine-vs-human test we invite a Hearthstone streamer whose best rank was top 10 of the official league in China region that is estimated to be of millions of players. Our models defeat the human player in all Best-of-5 tournaments of full games (including both deck building and battle), showing a strong capability of decision making.",
    "path": "papers/23/03/2303.05197.json",
    "total_tokens": 884,
    "translated_title": "改进技术掌握策略卡牌游戏（爐石戰記）",
    "translated_abstract": "策略卡牌游戏是一种著名的游戏类型，要求智能游戏玩法，并可以作为人工智能的理想测试平台。以往的研究合并了端到端策略函数和乐观平滑虚拟博弈，在《魔法与魅力：代码传说》等策略卡牌游戏中表现出有希望的性能。在本文中，我们将这些算法应用到爐石戰記上，并进一步提出了几种改进的技术，从而取得了显着的进展。为了进行机器对人的测试，我们邀请了一位在中国官方联赛中排名前十的爐石戰記播主，该地区的玩家数量估计在数百万人以上。我们的模型在所有完整游戏（包括构建卡组和对战）的五局比赛中击败了人类玩家，展现了强大的决策能力。",
    "tldr": "本文将端到端策略函数和乐观平滑虚拟博弈算法应用于更加复杂的商业游戏爐石戰記，提出改进技术并在人机对战中表现出较强决策能力。",
    "en_tdlr": "This paper applies end-to-end policy function and optimistic smooth fictitious play algorithm to the more complicated commercial game Hearthstone, proposes improved techniques and achieves significant progress. The machine vs. human test shows strong decision-making capabilities."
}