{
    "title": "Dual Cross-Attention for Medical Image Segmentation. (arXiv:2303.17696v1 [eess.IV])",
    "abstract": "We propose Dual Cross-Attention (DCA), a simple yet effective attention module that is able to enhance skip-connections in U-Net-based architectures for medical image segmentation. DCA addresses the semantic gap between encoder and decoder features by sequentially capturing channel and spatial dependencies across multi-scale encoder features. First, the Channel Cross-Attention (CCA) extracts global channel-wise dependencies by utilizing cross-attention across channel tokens of multi-scale encoder features. Then, the Spatial Cross-Attention (SCA) module performs cross-attention to capture spatial dependencies across spatial tokens. Finally, these fine-grained encoder features are up-sampled and connected to their corresponding decoder parts to form the skip-connection scheme. Our proposed DCA module can be integrated into any encoder-decoder architecture with skip-connections such as U-Net and its variants. We test our DCA module by integrating it into six U-Net-based architectures such",
    "link": "http://arxiv.org/abs/2303.17696",
    "context": "Title: Dual Cross-Attention for Medical Image Segmentation. (arXiv:2303.17696v1 [eess.IV])\nAbstract: We propose Dual Cross-Attention (DCA), a simple yet effective attention module that is able to enhance skip-connections in U-Net-based architectures for medical image segmentation. DCA addresses the semantic gap between encoder and decoder features by sequentially capturing channel and spatial dependencies across multi-scale encoder features. First, the Channel Cross-Attention (CCA) extracts global channel-wise dependencies by utilizing cross-attention across channel tokens of multi-scale encoder features. Then, the Spatial Cross-Attention (SCA) module performs cross-attention to capture spatial dependencies across spatial tokens. Finally, these fine-grained encoder features are up-sampled and connected to their corresponding decoder parts to form the skip-connection scheme. Our proposed DCA module can be integrated into any encoder-decoder architecture with skip-connections such as U-Net and its variants. We test our DCA module by integrating it into six U-Net-based architectures such",
    "path": "papers/23/03/2303.17696.json",
    "total_tokens": 813,
    "translated_title": "双重交叉注意力在医学图像分割中的应用",
    "translated_abstract": "本文提出一种简单而有效的注意力模块——双重交叉注意力（DCA），它能够增强基于U-Net的医学图像分割模型中的跳跃连接。DCA通过依次捕获多尺度编码器特征中的通道和空间依赖性来解决编码器和解码器之间的语义鸿沟问题。DCA模块可以集成到任何带有跳跃连接的编码器-解码器架构中，比如U-Net及其变种。本文将DCA模块集成到六种U-Net-based架构中进行了测试。",
    "tldr": "本文提出了一种双重交叉注意力模块，用于增强U-Net-based架构的医学图像分割模型。该模块通过捕获通道和空间依赖性，解决了编码器和解码器之间的语义鸿沟问题。",
    "en_tdlr": "This paper proposes a Dual Cross-Attention (DCA) module to enhance U-Net-based architectures for medical image segmentation by addressing the semantic gap between encoder and decoder features through sequentially capturing channel and spatial dependencies across multi-scale encoder features. The DCA module can be integrated into any encoder-decoder architecture with skip-connections and was tested in six U-Net-based architectures."
}