{
    "title": "Reinforcement Learning-based Wavefront Sensorless Adaptive Optics Approaches for Satellite-to-Ground Laser Communication. (arXiv:2303.07516v1 [cs.LG])",
    "abstract": "Optical satellite-to-ground communication (OSGC) has the potential to improve access to fast and affordable Internet in remote regions. Atmospheric turbulence, however, distorts the optical beam, eroding the data rate potential when coupling into single-mode fibers. Traditional adaptive optics (AO) systems use a wavefront sensor to improve fiber coupling. This leads to higher system size, cost and complexity, consumes a fraction of the incident beam and introduces latency, making OSGC for internet service impractical. We propose the use of reinforcement learning (RL) to reduce the latency, size and cost of the system by up to $30-40\\%$ by learning a control policy through interactions with a low-cost quadrant photodiode rather than a wavefront phase profiling camera. We develop and share an AO RL environment that provides a standardized platform to develop and evaluate RL based on the Strehl ratio, which is correlated to fiber-coupling performance. Our empirical analysis finds that Pro",
    "link": "http://arxiv.org/abs/2303.07516",
    "context": "Title: Reinforcement Learning-based Wavefront Sensorless Adaptive Optics Approaches for Satellite-to-Ground Laser Communication. (arXiv:2303.07516v1 [cs.LG])\nAbstract: Optical satellite-to-ground communication (OSGC) has the potential to improve access to fast and affordable Internet in remote regions. Atmospheric turbulence, however, distorts the optical beam, eroding the data rate potential when coupling into single-mode fibers. Traditional adaptive optics (AO) systems use a wavefront sensor to improve fiber coupling. This leads to higher system size, cost and complexity, consumes a fraction of the incident beam and introduces latency, making OSGC for internet service impractical. We propose the use of reinforcement learning (RL) to reduce the latency, size and cost of the system by up to $30-40\\%$ by learning a control policy through interactions with a low-cost quadrant photodiode rather than a wavefront phase profiling camera. We develop and share an AO RL environment that provides a standardized platform to develop and evaluate RL based on the Strehl ratio, which is correlated to fiber-coupling performance. Our empirical analysis finds that Pro",
    "path": "papers/23/03/2303.07516.json",
    "total_tokens": 980,
    "tldr": "本文提出了基于强化学习的卫星到地面激光通信自适应光学方法，通过与四分之一光敏二极管的交互学习控制策略，取代传统波前传感器提高光纤耦合效果，可将系统的延迟、尺寸和成本降低 $30-40\\%$。",
    "en_tdlr": "This paper proposes a reinforcement learning-based adaptive optics approach for satellite-to-ground laser communication, which replaces traditional wavefront sensors with interaction with a quadrant photodiode to reduce latency, size, and cost by $30-40\\%$ while improving fiber coupling performance."
}