{
    "title": "Are uGLAD? Time will tell!. (arXiv:2303.11647v1 [cs.LG])",
    "abstract": "We frequently encounter multiple series that are temporally correlated in our surroundings, such as EEG data to examine alterations in brain activity or sensors to monitor body movements. Segmentation of multivariate time series data is a technique for identifying meaningful patterns or changes in the time series that can signal a shift in the system's behavior. However, most segmentation algorithms have been designed primarily for univariate time series, and their performance on multivariate data remains largely unsatisfactory, making this a challenging problem. In this work, we introduce a novel approach for multivariate time series segmentation using conditional independence (CI) graphs. CI graphs are probabilistic graphical models that represents the partial correlations between the nodes. We propose a domain agnostic multivariate segmentation framework `$\\texttt{tGLAD}$' which draws a parallel between the CI graph nodes and the variables of the time series. Consider applying a gra",
    "link": "http://arxiv.org/abs/2303.11647",
    "context": "Title: Are uGLAD? Time will tell!. (arXiv:2303.11647v1 [cs.LG])\nAbstract: We frequently encounter multiple series that are temporally correlated in our surroundings, such as EEG data to examine alterations in brain activity or sensors to monitor body movements. Segmentation of multivariate time series data is a technique for identifying meaningful patterns or changes in the time series that can signal a shift in the system's behavior. However, most segmentation algorithms have been designed primarily for univariate time series, and their performance on multivariate data remains largely unsatisfactory, making this a challenging problem. In this work, we introduce a novel approach for multivariate time series segmentation using conditional independence (CI) graphs. CI graphs are probabilistic graphical models that represents the partial correlations between the nodes. We propose a domain agnostic multivariate segmentation framework `$\\texttt{tGLAD}$' which draws a parallel between the CI graph nodes and the variables of the time series. Consider applying a gra",
    "path": "papers/23/03/2303.11647.json",
    "total_tokens": 897,
    "translated_title": "你用$\\texttt{tGLAD}$了吗？时间会告诉你！",
    "translated_abstract": "我们经常遇到周围存在多个相关的时间序列，例如用于检查脑活动变化的脑电图数据或用于监测身体运动的传感器。多元时间序列数据的分割是一种识别时间序列中含义的模式或变化的技术，这可以标志系统行为的变化。但是，大多数分割算法主要设计用于单变量时间序列，它们在多元数据上的表现仍然不令人满意，这是一个具有挑战性的问题。在这项工作中，我们介绍了一种使用条件独立（CI）图的多元时间序列分割的新方法。CI图是表示节点之间的偏相关关系的概率图模型。我们提出了一个领域不可知的多元分割框架“$\\texttt{tGLAD}$”，它将CI图节点和时间序列的变量进行并行。在CI图上应用图形结构学习算法可以标识时间序列的有意义的段。我们在合成和实际多元时间序列数据集上展示了我们方法的有效性。",
    "tldr": "本文提出了一种使用条件独立图的多元时间序列分割方法$\\texttt{tGLAD}$，可以有效地标识时间序列的有意义的段。",
    "en_tdlr": "This paper proposes a novel approach for multivariate time series segmentation using conditional independence graphs, which outperforms existing algorithms on both synthetic and real-world data."
}