{
    "title": "Interval Logic Tensor Networks. (arXiv:2303.17892v1 [cs.AI])",
    "abstract": "In this paper, we introduce Interval Real Logic (IRL), a two-sorted logic that interprets knowledge such as sequential properties (traces) and event properties using sequences of real-featured data. We interpret connectives using fuzzy logic, event durations using trapezoidal fuzzy intervals, and fuzzy temporal relations using relationships between the intervals' areas. We propose Interval Logic Tensor Networks (ILTN), a neuro-symbolic system that learns by propagating gradients through IRL. In order to support effective learning, ILTN defines smoothened versions of the fuzzy intervals and temporal relations of IRL using softplus activations. We show that ILTN can successfully leverage knowledge expressed in IRL in synthetic tasks that require reasoning about events to predict their fuzzy durations. Our results show that the system is capable of making events compliant with background temporal knowledge.",
    "link": "http://arxiv.org/abs/2303.17892",
    "context": "Title: Interval Logic Tensor Networks. (arXiv:2303.17892v1 [cs.AI])\nAbstract: In this paper, we introduce Interval Real Logic (IRL), a two-sorted logic that interprets knowledge such as sequential properties (traces) and event properties using sequences of real-featured data. We interpret connectives using fuzzy logic, event durations using trapezoidal fuzzy intervals, and fuzzy temporal relations using relationships between the intervals' areas. We propose Interval Logic Tensor Networks (ILTN), a neuro-symbolic system that learns by propagating gradients through IRL. In order to support effective learning, ILTN defines smoothened versions of the fuzzy intervals and temporal relations of IRL using softplus activations. We show that ILTN can successfully leverage knowledge expressed in IRL in synthetic tasks that require reasoning about events to predict their fuzzy durations. Our results show that the system is capable of making events compliant with background temporal knowledge.",
    "path": "papers/23/03/2303.17892.json",
    "total_tokens": 809,
    "translated_title": "区间逻辑张量网络",
    "translated_abstract": "本文介绍了一个两排序知识表示系统Interval Real Logic (IRL)，用于解释顺序属性（痕迹）和事件属性，使用实数特征数据序列。我们使用模糊逻辑对连接词进行解释，使用梯形模糊区间对事件持续时间进行解释，使用示性函数对模糊时间关系进行解释。我们提出了Interval Logic Tensor Networks(ILTN)这个神经符号系统，通过IRL通过梯度传播进行学习。为了支持有效的学习，ILTN使用softplus激活函数定义了平滑版本的IRL的模糊区间和时间关系。我们展示了，在需要推理事件并预测它们的模糊持续时间的合成任务中，ILTN可以成功利用表示在IRL中的知识。我们的结果表明，该系统能够使事件符合背景时间知识。",
    "tldr": "本文提出了Interval Logic Tensor Networks (ILTN)一个神经符号系统，可以处理模糊逻辑、模糊时间区间的知识表示学习，并在推理事件和预测它们的模糊持续时间等任务上表现良好。",
    "en_tdlr": "This paper proposes Interval Logic Tensor Networks (ILTN), a neuro-symbolic system that can handle the representation and learning of fuzzy logic and fuzzy temporal intervals, and performs well in tasks such as reasoning about events and predicting their fuzzy durations."
}