{
    "title": "It is all Connected: A New Graph Formulation for Spatio-Temporal Forecasting. (arXiv:2303.13177v1 [cs.LG])",
    "abstract": "With an ever-increasing number of sensors in modern society, spatio-temporal time series forecasting has become a de facto tool to make informed decisions about the future. Most spatio-temporal forecasting models typically comprise distinct components that learn spatial and temporal dependencies. A common methodology employs some Graph Neural Network (GNN) to capture relations between spatial locations, while another network, such as a recurrent neural network (RNN), learns temporal correlations. By representing every recorded sample as its own node in a graph, rather than all measurements for a particular location as a single node, temporal and spatial information is encoded in a similar manner. In this setting, GNNs can now directly learn both temporal and spatial dependencies, jointly, while also alleviating the need for additional temporal networks. Furthermore, the framework does not require aligned measurements along the temporal dimension, meaning that it also naturally facilita",
    "link": "http://arxiv.org/abs/2303.13177",
    "context": "Title: It is all Connected: A New Graph Formulation for Spatio-Temporal Forecasting. (arXiv:2303.13177v1 [cs.LG])\nAbstract: With an ever-increasing number of sensors in modern society, spatio-temporal time series forecasting has become a de facto tool to make informed decisions about the future. Most spatio-temporal forecasting models typically comprise distinct components that learn spatial and temporal dependencies. A common methodology employs some Graph Neural Network (GNN) to capture relations between spatial locations, while another network, such as a recurrent neural network (RNN), learns temporal correlations. By representing every recorded sample as its own node in a graph, rather than all measurements for a particular location as a single node, temporal and spatial information is encoded in a similar manner. In this setting, GNNs can now directly learn both temporal and spatial dependencies, jointly, while also alleviating the need for additional temporal networks. Furthermore, the framework does not require aligned measurements along the temporal dimension, meaning that it also naturally facilita",
    "path": "papers/23/03/2303.13177.json",
    "total_tokens": 848,
    "translated_abstract": "随着现代社会传感器数量的不断增加，时空时间序列预测已成为做出未来明智决策的必备工具。大多数时空预测模型通常包括学习空间和时间依赖性的独立组件。常见的方法是使用一些图形神经网络来捕捉空间位置之间的关系，而另一个网络（例如循环神经网络）则学习时间相关性。通过表示每个记录的样本作为自己在图中的一个节点，而不是将一个位置的所有观测值表示为单个节点，从而以类似的方式对时间和空间信息进行编码。在这种设置下，GNN现在可以直接学习时间和空间依赖关系，同时也减轻了对额外时间网络的需求。此外，该框架不需要沿时间步对齐测量，这意味着它也自然地促进了不对齐的数据采集。",
    "tldr": "该论文提出了一个可以在同一个图形神经网络中直接学习时空依赖性的新模型，为时空预测提供了一个简单并且高效的解决方案。",
    "en_tdlr": "This paper proposes a new model that can directly learn spatio-temporal dependencies in the same graph neural network, providing a simple and efficient solution for spatio-temporal forecasting."
}