{
    "title": "GNNFormer: A Graph-based Framework for Cytopathology Report Generation. (arXiv:2303.09956v1 [cs.CV])",
    "abstract": "Cytopathology report generation is a necessary step for the standardized examination of pathology images. However, manually writing detailed reports brings heavy workloads for pathologists. To improve efficiency, some existing works have studied automatic generation of cytopathology reports, mainly by applying image caption generation frameworks with visual encoders originally proposed for natural images. A common weakness of these works is that they do not explicitly model the structural information among cells, which is a key feature of pathology images and provides significant information for making diagnoses. In this paper, we propose a novel graph-based framework called GNNFormer, which seamlessly integrates graph neural network (GNN) and Transformer into the same framework, for cytopathology report generation. To the best of our knowledge, GNNFormer is the first report generation method that explicitly models the structural information among cells in pathology images. It also eff",
    "link": "http://arxiv.org/abs/2303.09956",
    "context": "Title: GNNFormer: A Graph-based Framework for Cytopathology Report Generation. (arXiv:2303.09956v1 [cs.CV])\nAbstract: Cytopathology report generation is a necessary step for the standardized examination of pathology images. However, manually writing detailed reports brings heavy workloads for pathologists. To improve efficiency, some existing works have studied automatic generation of cytopathology reports, mainly by applying image caption generation frameworks with visual encoders originally proposed for natural images. A common weakness of these works is that they do not explicitly model the structural information among cells, which is a key feature of pathology images and provides significant information for making diagnoses. In this paper, we propose a novel graph-based framework called GNNFormer, which seamlessly integrates graph neural network (GNN) and Transformer into the same framework, for cytopathology report generation. To the best of our knowledge, GNNFormer is the first report generation method that explicitly models the structural information among cells in pathology images. It also eff",
    "path": "papers/23/03/2303.09956.json",
    "total_tokens": 1055,
    "translated_title": "GNNFormer：一种基于图的细胞病理学报告生成框架",
    "translated_abstract": "细胞病理学报告的自动生成是病理图像标准化检验的必要步骤，但是手动撰写详细报告会给病理学家带来沉重的工作负担。为了提高效率，一些现有的工作研究了利用最初针对自然图像的视觉编码器应用于细胞病理图像的图像描述生成框架，自动生成细胞病理学报告。这些工作的一个共同缺点是它们没有明确地对细胞之间的结构信息进行建模，而这是病理图像的关键特征，并为诊断提供了重要信息。本文提出了一种新颖的基于图的框架GNNFormer，无缝地将图神经网络（GNN）和Transformer集成到同一框架中，用于细胞病理学报告生成。据我们所知，GNNFormer是第一个明确对病理图像中的细胞之间的结构信息进行建模的报告生成方法。它还能够同时轻松处理细胞级分类和报告级语言生成任务。我们在两个公开数据集上的实验证明了GNNFormer在语言生成指标和诊断准确度方面优于几种最先进的方法。",
    "tldr": "提出了一种名为GNNFormer的图神经网络和Transformer结合的基于图的框架，用于细胞病理学报告生成，这是第一个明确对病理图像中的细胞之间的结构信息进行建模的报告生成方法，并在语言生成指标和诊断准确度方面表现优异。"
}