{
    "title": "Energy-Efficient Cellular-Connected UAV Swarm Control Optimization. (arXiv:2303.10398v1 [cs.NI])",
    "abstract": "Cellular-connected unmanned aerial vehicle (UAV) swarm is a promising solution for diverse applications, including cargo delivery and traffic control. However, it is still challenging to communicate with and control the UAV swarm with high reliability, low latency, and high energy efficiency. In this paper, we propose a two-phase command and control (C&C) transmission scheme in a cellular-connected UAV swarm network, where the ground base station (GBS) broadcasts the common C&C message in Phase I. In Phase II, the UAVs that have successfully decoded the C&C message will relay the message to the rest of UAVs via device-to-device (D2D) communications in either broadcast or unicast mode, under latency and energy constraints. To maximize the number of UAVs that receive the message successfully within the latency and energy constraints, we formulate the problem as a Constrained Markov Decision Process to find the optimal policy. To address this problem, we propose a decentralized constraine",
    "link": "http://arxiv.org/abs/2303.10398",
    "context": "Title: Energy-Efficient Cellular-Connected UAV Swarm Control Optimization. (arXiv:2303.10398v1 [cs.NI])\nAbstract: Cellular-connected unmanned aerial vehicle (UAV) swarm is a promising solution for diverse applications, including cargo delivery and traffic control. However, it is still challenging to communicate with and control the UAV swarm with high reliability, low latency, and high energy efficiency. In this paper, we propose a two-phase command and control (C&C) transmission scheme in a cellular-connected UAV swarm network, where the ground base station (GBS) broadcasts the common C&C message in Phase I. In Phase II, the UAVs that have successfully decoded the C&C message will relay the message to the rest of UAVs via device-to-device (D2D) communications in either broadcast or unicast mode, under latency and energy constraints. To maximize the number of UAVs that receive the message successfully within the latency and energy constraints, we formulate the problem as a Constrained Markov Decision Process to find the optimal policy. To address this problem, we propose a decentralized constraine",
    "path": "papers/23/03/2303.10398.json",
    "total_tokens": 991,
    "translated_title": "能源高效的基于蜂窝网络连接的无人机群控制优化",
    "translated_abstract": "基于蜂窝网络连接的无人机群体是一种广泛应用于货运和交通管理等领域的有前途的解决方案。然而，如何高可靠、低延迟、高能效地通信和控制无人机群体仍然是一项挑战。本文在基于蜂窝网络连接的无人机群体中提出了一个两阶段命令与控制（C&C）传输方案，其中地面基站（GBS）在第一阶段广播常规C&C消息。在第二阶段，已成功解码C&C消息的无人机将通过设备对设备（D2D）通信以广播或单播模式将消息中继到其余无人机，以满足延迟和能量限制下尽可能多的无人机成功接收消息。为了找到最优策略使成功接收消息的无人机数最大化，在限制条件下，我们将问题制定为约束马尔可夫决策过程。为了解决此问题，我们提出了一个分散的有约束Q学习算法来学习最优策略。仿真结果表明，我们提出的方案在能源效率和可靠性方面优于现有方案。",
    "tldr": "本文提出了一种基于蜂窝网络连接的无人机群控制方案，通过两阶段命令与控制（C&C）传输方案和设备对设备（D2D）通信来提高通信可靠性和能源效率。",
    "en_tdlr": "This paper proposes a cellular-connected UAV swarm control scheme, which improves communication reliability and energy efficiency through a two-phase command and control (C&C) transmission scheme and device-to-device (D2D) communications."
}