{
    "title": "On Feature Scaling of Recursive Feature Machines. (arXiv:2303.15745v1 [cs.LG])",
    "abstract": "In this technical report, we explore the behavior of Recursive Feature Machines (RFMs), a type of novel kernel machine that recursively learns features via the average gradient outer product, through a series of experiments on regression datasets. When successively adding random noise features to a dataset, we observe intriguing patterns in the Mean Squared Error (MSE) curves with the test MSE exhibiting a decrease-increase-decrease pattern. This behavior is consistent across different dataset sizes, noise parameters, and target functions. Interestingly, the observed MSE curves show similarities to the \"double descent\" phenomenon observed in deep neural networks, hinting at new connection between RFMs and neural network behavior. This report lays the groundwork for future research into this peculiar behavior.",
    "link": "http://arxiv.org/abs/2303.15745",
    "context": "Title: On Feature Scaling of Recursive Feature Machines. (arXiv:2303.15745v1 [cs.LG])\nAbstract: In this technical report, we explore the behavior of Recursive Feature Machines (RFMs), a type of novel kernel machine that recursively learns features via the average gradient outer product, through a series of experiments on regression datasets. When successively adding random noise features to a dataset, we observe intriguing patterns in the Mean Squared Error (MSE) curves with the test MSE exhibiting a decrease-increase-decrease pattern. This behavior is consistent across different dataset sizes, noise parameters, and target functions. Interestingly, the observed MSE curves show similarities to the \"double descent\" phenomenon observed in deep neural networks, hinting at new connection between RFMs and neural network behavior. This report lays the groundwork for future research into this peculiar behavior.",
    "path": "papers/23/03/2303.15745.json",
    "total_tokens": 878,
    "translated_title": "关于递归特征机器的特征缩放",
    "translated_abstract": "本技术报告通过一系列在回归数据集上的实验，探究了递归特征机器(RFMs)的行为，RFMs是一种通过平均梯度外积来递归地学习特征的新型核机器。当在数据集中迭代地添加随机噪声特征时，我们观察到均方误差(MSE)曲线呈现出降低-增加-降低的有趣模式。这种行为在不同的数据集大小、噪声参数和目标函数下保持一致。有趣的是，观察到的MSE曲线与深度神经网络中观察到的“双峰下降”现象相似，暗示RFMs和神经网络行为之间存在新的联系。这份报告为未来研究这种奇妙行为奠定了基础。",
    "tldr": "本报告通过实验探究了递归特征机器的行为，发现其在添加随机噪声特征时MSE曲线呈现出降低-增加-降低的模式，并且与神经网络的“双峰下降”现象相似，为后续研究奠定基础。",
    "en_tdlr": "This technical report investigates the behavior of Recursive Feature Machines (RFMs) through experiments on regression datasets, revealing a decrease-increase-decrease pattern in the Mean Squared Error (MSE) curves when adding random noise features, which bears similarity to the \"double descent\" phenomenon observed in deep neural networks and suggests new connections between RFMs and neural network behavior. The report lays the groundwork for future research in this area."
}