{
    "title": "Fast American Option Pricing using Nonlinear Stencils. (arXiv:2303.02317v2 [cs.CE] UPDATED)",
    "abstract": "We study the binomial, trinomial, and Black-Scholes-Merton models of option pricing. We present fast parallel discrete-time finite-difference algorithms for American call option pricing under the binomial and trinomial models and American put option pricing under the Black-Scholes-Merton model. For $T$-step finite differences, each algorithm runs in $O(\\left(T\\log^2{T}\\right)/p + T)$ time under a greedy scheduler on $p$ processing cores, which is a significant improvement over the $\\Theta({T^2}/{p}) + \\Omega(T\\log{T})$ time taken by the corresponding state-of-the-art parallel algorithm. Even when run on a single core, the $O(T\\log^2{T})$ time taken by our algorithms is asymptotically much smaller than the $\\Theta(T^2)$ running time of the fastest known serial algorithms. Implementations of our algorithms significantly outperform the fastest implementations of existing algorithms in practice, e.g., when run for $T \\approx 1000$ steps on a 48-core machine, our algorithm for the binomial ",
    "link": "http://arxiv.org/abs/2303.02317",
    "context": "Title: Fast American Option Pricing using Nonlinear Stencils. (arXiv:2303.02317v2 [cs.CE] UPDATED)\nAbstract: We study the binomial, trinomial, and Black-Scholes-Merton models of option pricing. We present fast parallel discrete-time finite-difference algorithms for American call option pricing under the binomial and trinomial models and American put option pricing under the Black-Scholes-Merton model. For $T$-step finite differences, each algorithm runs in $O(\\left(T\\log^2{T}\\right)/p + T)$ time under a greedy scheduler on $p$ processing cores, which is a significant improvement over the $\\Theta({T^2}/{p}) + \\Omega(T\\log{T})$ time taken by the corresponding state-of-the-art parallel algorithm. Even when run on a single core, the $O(T\\log^2{T})$ time taken by our algorithms is asymptotically much smaller than the $\\Theta(T^2)$ running time of the fastest known serial algorithms. Implementations of our algorithms significantly outperform the fastest implementations of existing algorithms in practice, e.g., when run for $T \\approx 1000$ steps on a 48-core machine, our algorithm for the binomial ",
    "path": "papers/23/03/2303.02317.json",
    "total_tokens": 949,
    "translated_title": "使用非线性模板的快速美式期权定价",
    "translated_abstract": "我们研究了二项式、三项式和Black-Scholes-Merton模型的期权定价。我们提出了在二项式和三项式模型下的美式认购期权定价以及在Black-Scholes-Merton模型下的美式认沽期权定价的快速并行离散时间有限差分算法。对于$T$步有限差分，每个算法在$p$个处理核心上在贪婪调度器下运行时间为$O(\\left(T\\log^2{T}\\right)/p + T)$，这比相应的最先进并行算法所花费的$\\Theta({T^2}/{p}) + \\Omega(T\\log{T})$时间显著改进。即使在单核心上运行，我们的算法所花费的$O(T\\log^2{T})$时间在渐进上远小于最快已知串行算法的$\\Theta(T^2)$运行时间。我们算法的实现在实际中明显优于现有算法的最快实现，例如，在48核心机器上运行$T \\approx 1000$步时，我们的二项式算法。",
    "tldr": "本文提出了快速并行算法来解决美式期权定价问题，在二项式、三项式和Black-Scholes-Merton模型中，算法的运行时间显著优于现有算法，并且在实际中取得了显著的性能提升。"
}