{
    "title": "Inflation forecasting with attention based transformer neural networks. (arXiv:2303.15364v1 [econ.EM])",
    "abstract": "Inflation is a major determinant for allocation decisions and its forecast is a fundamental aim of governments and central banks. However, forecasting inflation is not a trivial task, as its prediction relies on low frequency, highly fluctuating data with unclear explanatory variables. While classical models show some possibility of predicting inflation, reliably beating the random walk benchmark remains difficult. Recently, (deep) neural networks have shown impressive results in a multitude of applications, increasingly setting the new state-of-the-art. This paper investigates the potential of the transformer deep neural network architecture to forecast different inflation rates. The results are compared to a study on classical time series and machine learning models. We show that our adapted transformer, on average, outperforms the baseline in 6 out of 16 experiments, showing best scores in two out of four investigated inflation rates. Our results demonstrate that a transformer based",
    "link": "http://arxiv.org/abs/2303.15364",
    "context": "Title: Inflation forecasting with attention based transformer neural networks. (arXiv:2303.15364v1 [econ.EM])\nAbstract: Inflation is a major determinant for allocation decisions and its forecast is a fundamental aim of governments and central banks. However, forecasting inflation is not a trivial task, as its prediction relies on low frequency, highly fluctuating data with unclear explanatory variables. While classical models show some possibility of predicting inflation, reliably beating the random walk benchmark remains difficult. Recently, (deep) neural networks have shown impressive results in a multitude of applications, increasingly setting the new state-of-the-art. This paper investigates the potential of the transformer deep neural network architecture to forecast different inflation rates. The results are compared to a study on classical time series and machine learning models. We show that our adapted transformer, on average, outperforms the baseline in 6 out of 16 experiments, showing best scores in two out of four investigated inflation rates. Our results demonstrate that a transformer based",
    "path": "papers/23/03/2303.15364.json",
    "total_tokens": 907,
    "translated_title": "基于注意力机制变压器神经网络的通胀预测",
    "translated_abstract": "通胀是资金配置决策的重要因素，其预测是政府和中央银行的基本目标。然而，由于其预测取决于低频高波动数据且缺乏清晰的解释变量，因此预测通胀并不是一项简单的任务。最近，（深度）神经网络在许多应用中已显示出惊人的结果，逐渐成为新的技术水平标杆。本文研究了变压器深度神经网络架构用于预测不同通胀率的潜力。结果与经典时间序列和机器学习模型进行了比较。我们发现，我们改进后的变压器模型在16个实验中平均超过基准模型6个实验，在研究的4个通货膨胀率中表现最佳。我们的结果表明，基于变压器的通胀预测模型有超越传统模型的潜力，并可以成为金融决策中的有用工具。",
    "tldr": "本文研究了基于注意力机制变压器神经网络用于预测不同通货膨胀率的潜力，结果表明其可以超越传统模型，成为金融决策中的有用工具。",
    "en_tdlr": "This paper investigates the potential of transformer neural networks with attention mechanism to forecast different inflation rates, and shows that it can outperform classical models and be a useful tool for decision making in the financial sector."
}