{
    "title": "Student's t-Distribution: On Measuring the Inter-Rater Reliability When the Observations are Scarce. (arXiv:2303.04526v2 [cs.CL] UPDATED)",
    "abstract": "In natural language processing (NLP) we always rely on human judgement as the golden quality evaluation method. However, there has been an ongoing debate on how to better evaluate inter-rater reliability (IRR) levels for certain evaluation tasks, such as translation quality evaluation (TQE), especially when the data samples (observations) are very scarce. In this work, we first introduce the study on how to estimate the confidence interval for the measurement value when only one data (evaluation) point is available. Then, this leads to our example with two human-generated observational scores, for which, we introduce ``Student's \\textit{t}-Distribution'' method and explain how to use it to measure the IRR score using only these two data points, as well as the confidence intervals (CIs) of the quality evaluation. We give quantitative analysis on how the evaluation confidence can be greatly improved by introducing more observations, even if only one extra observation. We encourage resear",
    "link": "http://arxiv.org/abs/2303.04526",
    "context": "Title: Student's t-Distribution: On Measuring the Inter-Rater Reliability When the Observations are Scarce. (arXiv:2303.04526v2 [cs.CL] UPDATED)\nAbstract: In natural language processing (NLP) we always rely on human judgement as the golden quality evaluation method. However, there has been an ongoing debate on how to better evaluate inter-rater reliability (IRR) levels for certain evaluation tasks, such as translation quality evaluation (TQE), especially when the data samples (observations) are very scarce. In this work, we first introduce the study on how to estimate the confidence interval for the measurement value when only one data (evaluation) point is available. Then, this leads to our example with two human-generated observational scores, for which, we introduce ``Student's \\textit{t}-Distribution'' method and explain how to use it to measure the IRR score using only these two data points, as well as the confidence intervals (CIs) of the quality evaluation. We give quantitative analysis on how the evaluation confidence can be greatly improved by introducing more observations, even if only one extra observation. We encourage resear",
    "path": "papers/23/03/2303.04526.json",
    "total_tokens": 894,
    "translated_title": "学生t-分布：在观察稀缺时测量评价者间可靠性",
    "translated_abstract": "在自然语言处理中，我们总是依赖于人类判断作为黄金质量评估方法。然而，对于某些评估任务（如翻译质量评估）的评价者间可靠性（IRR）水平如何更好评估一直存在争议，特别是当数据样本（观察）非常稀缺时。本研究首先介绍了当只有一个数据（评估）点可用时如何估计测量值的置信区间。然后，我们通过具体例子介绍了两个人生成的观察评分，引入了\"学生t-分布\"方法，并解释了如何使用它仅使用这两个数据点来测量IRR得分，以及质量评估的置信区间（CI）。我们定量分析了通过引入更多观察即使只有一个额外观察如何大大提高评估置信度。我们鼓励研究者们进行进一步研究和应用。",
    "tldr": "这篇论文介绍了在数据稀缺时如何使用学生t-分布方法评估评价者间可靠性，并通过定量分析展示了引入更多观察可以大大提高评估置信度。",
    "en_tdlr": "This paper introduces how to use the Student's t-Distribution method to evaluate inter-rater reliability when data is scarce, and demonstrates through quantitative analysis that introducing more observations can greatly improve evaluation confidence."
}