{
    "title": "Multi-modal Differentiable Unsupervised Feature Selection. (arXiv:2303.09381v1 [cs.LG])",
    "abstract": "Multi-modal high throughput biological data presents a great scientific opportunity and a significant computational challenge. In multi-modal measurements, every sample is observed simultaneously by two or more sets of sensors. In such settings, many observed variables in both modalities are often nuisance and do not carry information about the phenomenon of interest. Here, we propose a multi-modal unsupervised feature selection framework: identifying informative variables based on coupled high-dimensional measurements. Our method is designed to identify features associated with two types of latent low-dimensional structures: (i) shared structures that govern the observations in both modalities and (ii) differential structures that appear in only one modality. To that end, we propose two Laplacian-based scoring operators. We incorporate the scores with differentiable gates that mask nuisance features and enhance the accuracy of the structure captured by the graph Laplacian. The perform",
    "link": "http://arxiv.org/abs/2303.09381",
    "context": "Title: Multi-modal Differentiable Unsupervised Feature Selection. (arXiv:2303.09381v1 [cs.LG])\nAbstract: Multi-modal high throughput biological data presents a great scientific opportunity and a significant computational challenge. In multi-modal measurements, every sample is observed simultaneously by two or more sets of sensors. In such settings, many observed variables in both modalities are often nuisance and do not carry information about the phenomenon of interest. Here, we propose a multi-modal unsupervised feature selection framework: identifying informative variables based on coupled high-dimensional measurements. Our method is designed to identify features associated with two types of latent low-dimensional structures: (i) shared structures that govern the observations in both modalities and (ii) differential structures that appear in only one modality. To that end, we propose two Laplacian-based scoring operators. We incorporate the scores with differentiable gates that mask nuisance features and enhance the accuracy of the structure captured by the graph Laplacian. The perform",
    "path": "papers/23/03/2303.09381.json",
    "total_tokens": 976,
    "translated_title": "多模态可微无监督特征选择",
    "translated_abstract": "多模态高通量生物数据既是一个巨大的科学机遇，又是一个重大的计算挑战。在多模态测量中，每个样本同时被两个或更多组传感器观察。在这种情况下，两个模态中的许多观察变量通常都是不相关的，并且不 carry information about the phenomenon of interest。我们在此提出了一个多模态无监督特征选择框架，它基于耦合的高维测量识别信息变量。为此，我们提出了两个基于拉普拉斯的评分算子。我们将得分与可区分的掩码结合起来，以遮蔽无用特征并增强图拉普拉斯所捕捉的结构的准确性。该方法在合成和真实的多模态数据集上进行了评估，包括fMRI和基因表达数据。我们的特征选择方法优于现有的无监督和监督方法，并实现了生物相关的发现。",
    "tldr": "该论文提出了一个多模态无监督特征选择框架用于识别具有生物学相关性的信息变量。通过两个基于拉普拉斯的评分算子和可区分的掩码来增强图拉普拉斯所捕捉的结构的准确性，该方法在真实的多模态数据集上表现优于现有的无监督和监督方法。",
    "en_tdlr": "The paper proposes a multi-modal unsupervised feature selection framework to identify informative variables associated with biological structures. The proposed method enhances the accuracy of the structure captured by the graph Laplacian via two Laplacian-based scoring operators and differentiable gates, and outperforms existing unsupervised and supervised methods on real-world multi-modal datasets."
}