{
    "title": "Tollywood Emotions: Annotation of Valence-Arousal in Telugu Song Lyrics. (arXiv:2303.09364v1 [cs.CL])",
    "abstract": "Emotion recognition from a given music track has heavily relied on acoustic features, social tags, and metadata but is seldom focused on lyrics. There are no datasets of Indian language songs that contain both valence and arousal manual ratings of lyrics. We present a new manually annotated dataset of Telugu songs' lyrics collected from Spotify with valence and arousal annotated on a discrete scale. A fairly high inter-annotator agreement was observed for both valence and arousal. Subsequently, we create two music emotion recognition models by using two classification techniques to identify valence, arousal and respective emotion quadrant from lyrics. Support vector machine (SVM) with term frequency-inverse document frequency (TF-IDF) features and fine-tuning the pre-trained XLMRoBERTa (XLM-R) model were used for valence, arousal and quadrant classification tasks. Fine-tuned XLMRoBERTa performs better than the SVM by improving macro-averaged F1-scores of 54.69%, 67.61%, 34.13% to 77.90",
    "link": "http://arxiv.org/abs/2303.09364",
    "context": "Title: Tollywood Emotions: Annotation of Valence-Arousal in Telugu Song Lyrics. (arXiv:2303.09364v1 [cs.CL])\nAbstract: Emotion recognition from a given music track has heavily relied on acoustic features, social tags, and metadata but is seldom focused on lyrics. There are no datasets of Indian language songs that contain both valence and arousal manual ratings of lyrics. We present a new manually annotated dataset of Telugu songs' lyrics collected from Spotify with valence and arousal annotated on a discrete scale. A fairly high inter-annotator agreement was observed for both valence and arousal. Subsequently, we create two music emotion recognition models by using two classification techniques to identify valence, arousal and respective emotion quadrant from lyrics. Support vector machine (SVM) with term frequency-inverse document frequency (TF-IDF) features and fine-tuning the pre-trained XLMRoBERTa (XLM-R) model were used for valence, arousal and quadrant classification tasks. Fine-tuned XLMRoBERTa performs better than the SVM by improving macro-averaged F1-scores of 54.69%, 67.61%, 34.13% to 77.90",
    "path": "papers/23/03/2303.09364.json",
    "total_tokens": 973,
    "translated_title": "Tollywood情感：泰卢固语歌词中价值-唤起标注",
    "translated_abstract": "在识别音乐情感方面，人们主要依赖于声学特征、社会标签和元数据，但很少关注歌词。目前没有包含价值和唤起手动评分的印度语歌曲数据集。我们在Spotify上收集了Telugu歌曲歌词的手动注释数据集，评注了离散尺度上的价值和唤起。对于价值和唤起，观察到相当高的人际间一致性。随后，我们使用两种分类技术创建了两个音乐情感识别模型，以从歌词中识别价值、唤起和相应的情感象限。使用术语频率-逆文档频率（TF-IDF）功能的支持向量机（SVM）和微调预训练XLMRoBERTa（XLM-R）模型用于价值，唤起和象限分类任务。微调后的XLMRoBERTa优于SVM，将价值、唤起和象限的宏平均F1分数分别提高了54.69％、67.61％和34.13％，达到77.90％。",
    "tldr": "该论文建立了一个Telugu歌曲的歌词情感数据集，用于音乐情感识别，研究者使用了两种分类技术进行研究，结果表明使用微调后的XLMRoBERTa模型可以比使用支持向量机模型更好的提高模型的性能。",
    "en_tdlr": "This paper establishes a Telugu song lyrics emotion dataset for music emotion recognition, and researchers used two classification techniques. Results showed that fine-tuned XLMRoBERTa model outperformed the SVM model for valence, arousal and quadrant classification tasks."
}