{
    "title": "Towards a Deep Learning Pain-Level Detection Deployment at UAE for Patient-Centric-Pain Management and Diagnosis Support: Framework and Performance Evaluation. (arXiv:2303.08273v1 [cs.HC])",
    "abstract": "The outbreak of the COVID-19 pandemic revealed the criticality of timely intervention in a situation exacerbated by a shortage in medical staff and equipment. Pain-level screening is the initial step toward identifying the severity of patient conditions. Automatic recognition of state and feelings help in identifying patient symptoms to take immediate adequate action and providing a patient-centric medical plan tailored to a patient's state. In this paper, we propose a framework for pain-level detection for deployment in the United Arab Emirates and assess its performance using the most used approaches in the literature. Our results show that a deployment of a pain-level deep learning detection framework is promising in identifying the pain level accurately.",
    "link": "http://arxiv.org/abs/2303.08273",
    "context": "Title: Towards a Deep Learning Pain-Level Detection Deployment at UAE for Patient-Centric-Pain Management and Diagnosis Support: Framework and Performance Evaluation. (arXiv:2303.08273v1 [cs.HC])\nAbstract: The outbreak of the COVID-19 pandemic revealed the criticality of timely intervention in a situation exacerbated by a shortage in medical staff and equipment. Pain-level screening is the initial step toward identifying the severity of patient conditions. Automatic recognition of state and feelings help in identifying patient symptoms to take immediate adequate action and providing a patient-centric medical plan tailored to a patient's state. In this paper, we propose a framework for pain-level detection for deployment in the United Arab Emirates and assess its performance using the most used approaches in the literature. Our results show that a deployment of a pain-level deep learning detection framework is promising in identifying the pain level accurately.",
    "path": "papers/23/03/2303.08273.json",
    "total_tokens": 838,
    "translated_title": "面向UAE的深度学习疼痛级别检测部署：为以患者为中心的疼痛管理和诊断支持奠定基础",
    "translated_abstract": "COVID-19大流行爆发揭示了及时干预的重要性，而短缺的医疗人员和设备使情况更加恶化。检测疼痛级别是确定患者病情严重程度的首要步骤。自动识别状态和感受有助于识别患者的症状，以及采取立即恰当的行动，并提供特定于患者状态的以患者为中心的医疗计划。本文提出了一个疼痛级别检测框架，用于在阿拉伯联合酋长国部署，并使用文献中最常用的方法评估其性能。我们的结果表明，部署疼痛级别深度学习检测框架在准确识别疼痛级别方面是有前途的。",
    "tldr": "本文提出了一个能在UAE部署的疼痛级别检测框架，并证明了它能够准确地识别疼痛级别，有助于以患者为中心的医疗计划。",
    "en_tdlr": "This paper proposes a pain-level detection framework that can be deployed in the UAE and demonstrates its accuracy in identifying pain levels, aiding in patient-centric medical planning."
}