{
    "title": "Prevalence and major risk factors of non-communicable diseases: A Hospital-based Cross-Sectional Study in Dhaka, Bangladesh. (arXiv:2303.04808v2 [q-bio.QM] UPDATED)",
    "abstract": "Objective: The study aimed to determine the prevalence of several non-communicable diseases (NCD) and analyze risk factors among adult patients seeking nutritional guidance in Dhaka, Bangladesh. Result: Our study observed the relationships between gender, age groups, obesity, and NCDs (DM, CKD, IBS, CVD, CRD, thyroid). The most frequently reported NCD was cardiovascular issues (CVD), which was present in 83.56% of all participants. CVD was more common in male participants. Consequently, male participants had a higher blood pressure distribution than females. Diabetes mellitus (DM), on the other hand, did not have a gender-based inclination. Both CVD and DM had an age-based progression. Our study showed that chronic respiratory illness was more frequent in middle-aged participants than in younger or elderly individuals. Based on the data, every one in five hospitalized patients was obese. We analyzed the co-morbidities and found that 31.5% of the population has only one NCD, 30.1% has t",
    "link": "http://arxiv.org/abs/2303.04808",
    "context": "Title: Prevalence and major risk factors of non-communicable diseases: A Hospital-based Cross-Sectional Study in Dhaka, Bangladesh. (arXiv:2303.04808v2 [q-bio.QM] UPDATED)\nAbstract: Objective: The study aimed to determine the prevalence of several non-communicable diseases (NCD) and analyze risk factors among adult patients seeking nutritional guidance in Dhaka, Bangladesh. Result: Our study observed the relationships between gender, age groups, obesity, and NCDs (DM, CKD, IBS, CVD, CRD, thyroid). The most frequently reported NCD was cardiovascular issues (CVD), which was present in 83.56% of all participants. CVD was more common in male participants. Consequently, male participants had a higher blood pressure distribution than females. Diabetes mellitus (DM), on the other hand, did not have a gender-based inclination. Both CVD and DM had an age-based progression. Our study showed that chronic respiratory illness was more frequent in middle-aged participants than in younger or elderly individuals. Based on the data, every one in five hospitalized patients was obese. We analyzed the co-morbidities and found that 31.5% of the population has only one NCD, 30.1% has t",
    "path": "papers/23/03/2303.04808.json",
    "total_tokens": 1189,
    "translated_title": "孟加拉达卡市基于医院的横断面研究：非传染性疾病的患病率及主要风险因素。",
    "translated_abstract": "该研究旨在确定孟加拉国达卡市寻求营养指导的成年患者中多种非传染性疾病（NCD）的患病率，分析其风险因素。结果显示，性别、年龄组、肥胖与NCD（糖尿病、CKD、IBS、心血管疾病、慢性肾脏疾病、甲状腺疾病）之间有关联。NCD中最常见的是心血管问题（CVD），在所有参与者中占83.56%。CVD在男性参与者中更为普遍。相应地，男性参与者的血压分布比女性更高。另一方面，糖尿病并没有性别倾向。无论CVD还是DM，都具有年龄上的进展。慢性呼吸系统疾病在中年参与者中比年轻或老年人更为常见。基于数据，五分之一的住院患者患有肥胖症。我们对合并症进行了分析，发现31.5%的人口仅患有一种NCD，30.1%的人患有两种或两种以上的NCD。",
    "tldr": "该研究调查了孟加拉国达卡市成年患者中多种非传染性疾病的患病率及其风险因素，其中心血管疾病最为普遍。男性参与者较女性更容易患有心血管疾病，但糖尿病不具有性别倾向。CVD和DM都会随着年龄的增长而增加。患有肥胖症的住院病人占五分之一。",
    "en_tdlr": "This study investigated the prevalence of various non-communicable diseases and their risk factors among adult patients seeking nutritional guidance in Dhaka, Bangladesh. Cardiovascular disease was found to be the most common NCD. Male participants were more likely to have CVD, while diabetes mellitus did not show a gender-based inclination. Both CVD and DM had an age-based progression. Chronic respiratory illness was more common in middle-aged participants. One in five hospitalized patients was obese."
}