{
    "title": "Inherently Interpretable Multi-Label Classification Using Class-Specific Counterfactuals. (arXiv:2303.00500v2 [cs.CV] UPDATED)",
    "abstract": "Interpretability is essential for machine learning algorithms in high-stakes application fields such as medical image analysis. However, high-performing black-box neural networks do not provide explanations for their predictions, which can lead to mistrust and suboptimal human-ML collaboration. Post-hoc explanation techniques, which are widely used in practice, have been shown to suffer from severe conceptual problems. Furthermore, as we show in this paper, current explanation techniques do not perform adequately in the multi-label scenario, in which multiple medical findings may co-occur in a single image. We propose Attri-Net, an inherently interpretable model for multi-label classification. Attri-Net is a powerful classifier that provides transparent, trustworthy, and human-understandable explanations. The model first generates class-specific attribution maps based on counterfactuals to identify which image regions correspond to certain medical findings. Then a simple logistic regre",
    "link": "http://arxiv.org/abs/2303.00500",
    "context": "Title: Inherently Interpretable Multi-Label Classification Using Class-Specific Counterfactuals. (arXiv:2303.00500v2 [cs.CV] UPDATED)\nAbstract: Interpretability is essential for machine learning algorithms in high-stakes application fields such as medical image analysis. However, high-performing black-box neural networks do not provide explanations for their predictions, which can lead to mistrust and suboptimal human-ML collaboration. Post-hoc explanation techniques, which are widely used in practice, have been shown to suffer from severe conceptual problems. Furthermore, as we show in this paper, current explanation techniques do not perform adequately in the multi-label scenario, in which multiple medical findings may co-occur in a single image. We propose Attri-Net, an inherently interpretable model for multi-label classification. Attri-Net is a powerful classifier that provides transparent, trustworthy, and human-understandable explanations. The model first generates class-specific attribution maps based on counterfactuals to identify which image regions correspond to certain medical findings. Then a simple logistic regre",
    "path": "papers/23/03/2303.00500.json",
    "total_tokens": 924,
    "translated_title": "以类别特定的对抗事实为基础的内在可解释多标签分类",
    "translated_abstract": "在高风险应用领域，如医学影像分析中，可解释性对于机器学习算法至关重要。然而，高性能的黑盒神经网络不会提供其预测的解释，这可能导致人与机器学习的合作不可信任和次优。目前的后处理解释技术在多标签情景下表现不佳，其中同一图像中可能同时出现多个医疗发现。我们提出了一种名为Attri-Net的内在可解释模型，用于多标签分类。Attri-Net是一个强大的分类器，提供透明、可信赖和人可理解的解释。该模型首先基于对抗事实生成类别特定的归因图，以确定哪些图像区域对应于特定的医疗发现。然后，使用简单的逻辑回归模型对归因图进行分类预测。",
    "tldr": "提出了一种名为Attri-Net的内在可解释模型，用于多标签分类，它能提供透明、可信赖和人可理解的解释。该模型通过生成类别特定的归因图，基于对抗事实来确定图像中对应于特定医疗发现的区域，并使用逻辑回归模型对归因图进行分类预测。"
}