{
    "title": "Deployment of Image Analysis Algorithms under Prevalence Shifts. (arXiv:2303.12540v1 [cs.CV])",
    "abstract": "Domain gaps are among the most relevant roadblocks in the clinical translation of machine learning (ML)-based solutions for medical image analysis. While current research focuses on new training paradigms and network architectures, little attention is given to the specific effect of prevalence shifts on an algorithm deployed in practice. Such discrepancies between class frequencies in the data used for a method's development/validation and that in its deployment environment(s) are of great importance, for example in the context of artificial intelligence (AI) democratization, as disease prevalences may vary widely across time and location. Our contribution is twofold. First, we empirically demonstrate the potentially severe consequences of missing prevalence handling by analyzing (i) the extent of miscalibration, (ii) the deviation of the decision threshold from the optimum, and (iii) the ability of validation metrics to reflect neural network performance on the deployment population a",
    "link": "http://arxiv.org/abs/2303.12540",
    "context": "Title: Deployment of Image Analysis Algorithms under Prevalence Shifts. (arXiv:2303.12540v1 [cs.CV])\nAbstract: Domain gaps are among the most relevant roadblocks in the clinical translation of machine learning (ML)-based solutions for medical image analysis. While current research focuses on new training paradigms and network architectures, little attention is given to the specific effect of prevalence shifts on an algorithm deployed in practice. Such discrepancies between class frequencies in the data used for a method's development/validation and that in its deployment environment(s) are of great importance, for example in the context of artificial intelligence (AI) democratization, as disease prevalences may vary widely across time and location. Our contribution is twofold. First, we empirically demonstrate the potentially severe consequences of missing prevalence handling by analyzing (i) the extent of miscalibration, (ii) the deviation of the decision threshold from the optimum, and (iii) the ability of validation metrics to reflect neural network performance on the deployment population a",
    "path": "papers/23/03/2303.12540.json",
    "total_tokens": 834,
    "translated_title": "“图像分析算法在流行病变化下的部署”",
    "translated_abstract": "领域差距是医学图像分析的机器学习解决方案临床转化中最重要的障碍之一。尽管当前的研究重点是新的训练范式和网络架构，但很少关注算法在实践中部署时流行病发生率变化的特定影响。对于人工智能民主化的背景，由于疾病流行率可能在时间和地点上变化很大，因此开发/验证方法中使用的数据和部署环境中的数据的类别频率之间的差异非常重要。我们的贡献有两个方面。首先，我们通过分析（i）校准的程度，（ii）决策阈值与最优值的偏差，以及（iii）验证指标反映神经网络性能在部署人口的能力，实证地证明了缺少流行病处理的潜在严重后果。",
    "tldr": "本文通过实证研究表明，在机器学习在医学图像分析领域的实际应用中，流行病变化对算法的部署效果有重要影响。",
    "en_tdlr": "This paper empirically demonstrates that prevalence shifts have a significant impact on the deployment effectiveness of machine learning algorithms in medical image analysis."
}