{
    "title": "Entropy of financial time series due to the shock of war. (arXiv:2303.16155v1 [q-fin.ST])",
    "abstract": "The concept of entropy is not uniquely relevant to the statistical mechanics but among others it can play pivotal role in the analysis of a time series, particularly the stock market data. In this area sudden events are especially interesting as they describe abrupt data changes which may have long-lasting effects. Here, we investigate the impact of such events on the entropy of financial time series. As a case study we assume data of polish stock market in the context of its main cumulative index. This index is discussed for the finite time periods before and after outbreak of the 2022 Russian invasion of Ukraine, acting as the sudden event. The analysis allows us to validate the entropy-based methodology in assessing market changes as driven by the extreme external factors. We show that qualitative features of market changes can be captured quantitatively in terms of the entropy. In addition to that, the magnitude of the impact is analysed over various time periods in terms of the in",
    "link": "http://arxiv.org/abs/2303.16155",
    "context": "Title: Entropy of financial time series due to the shock of war. (arXiv:2303.16155v1 [q-fin.ST])\nAbstract: The concept of entropy is not uniquely relevant to the statistical mechanics but among others it can play pivotal role in the analysis of a time series, particularly the stock market data. In this area sudden events are especially interesting as they describe abrupt data changes which may have long-lasting effects. Here, we investigate the impact of such events on the entropy of financial time series. As a case study we assume data of polish stock market in the context of its main cumulative index. This index is discussed for the finite time periods before and after outbreak of the 2022 Russian invasion of Ukraine, acting as the sudden event. The analysis allows us to validate the entropy-based methodology in assessing market changes as driven by the extreme external factors. We show that qualitative features of market changes can be captured quantitatively in terms of the entropy. In addition to that, the magnitude of the impact is analysed over various time periods in terms of the in",
    "path": "papers/23/03/2303.16155.json",
    "total_tokens": 878,
    "translated_title": "战争冲击对金融时间序列熵的影响",
    "translated_abstract": "熵的概念不仅仅与统计力学有关，而且在时间序列分析中也可以起到关键作用，特别是股票市场数据。在这个领域中，突发事件尤其引人关注，因为它们描述了可能会产生长期影响的突然数据变化。本文旨在研究这些事件对金融时间序列熵的影响。以波兰股票市场为案例研究，考虑其主要累积指数在2022年俄罗斯入侵乌克兰的爆发前后的有限时间段内的数据。通过分析，我们可以验证以熵为基础的方法在评估市场变化时受到极端外部因素的影响。我们表明，市场变化的定性特征可以量化地用熵来捕捉。此外，影响的大小也在各种时间段内进行了分析。",
    "tldr": "本文研究了突发事件对金融时间序列熵的影响，通过波兰股票市场数据表明熵可以量化地捕捉市场变化的定性特征。",
    "en_tdlr": "This paper investigates the impact of sudden events on the entropy of financial time series, specifically in the context of the Polish stock market data before and after the outbreak of the 2022 Russian invasion of Ukraine. The study shows that entropy can quantitatively capture the qualitative features of market changes and validates its use in assessing market changes as driven by extreme external factors."
}