{
    "title": "FactReranker: Fact-guided Reranker for Faithful Radiology Report Summarization. (arXiv:2303.08335v1 [cs.CL])",
    "abstract": "Automatic radiology report summarization is a crucial clinical task, whose key challenge is to maintain factual accuracy between produced summaries and ground truth radiology findings. Existing research adopts reinforcement learning to directly optimize factual consistency metrics such as CheXBert or RadGraph score. However, their decoding method using greedy search or beam search considers no factual consistency when picking the optimal candidate, leading to limited factual consistency improvement. To address it, we propose a novel second-stage summarizing approach FactReranker, the first attempt that learns to choose the best summary from all candidates based on their estimated factual consistency score. We propose to extract medical facts of the input medical report, its gold summary, and candidate summaries based on the RadGraph schema and design the fact-guided reranker to efficiently incorporate the extracted medical facts for selecting the optimal summary. We decompose the fact-",
    "link": "http://arxiv.org/abs/2303.08335",
    "context": "Title: FactReranker: Fact-guided Reranker for Faithful Radiology Report Summarization. (arXiv:2303.08335v1 [cs.CL])\nAbstract: Automatic radiology report summarization is a crucial clinical task, whose key challenge is to maintain factual accuracy between produced summaries and ground truth radiology findings. Existing research adopts reinforcement learning to directly optimize factual consistency metrics such as CheXBert or RadGraph score. However, their decoding method using greedy search or beam search considers no factual consistency when picking the optimal candidate, leading to limited factual consistency improvement. To address it, we propose a novel second-stage summarizing approach FactReranker, the first attempt that learns to choose the best summary from all candidates based on their estimated factual consistency score. We propose to extract medical facts of the input medical report, its gold summary, and candidate summaries based on the RadGraph schema and design the fact-guided reranker to efficiently incorporate the extracted medical facts for selecting the optimal summary. We decompose the fact-",
    "path": "papers/23/03/2303.08335.json",
    "total_tokens": 908,
    "translated_title": "FactReranker：基于事实引导的辅助评估器用于忠实的放射学报告摘要。",
    "translated_abstract": "自动放射学报告摘要是一项至关重要的临床任务，其主要挑战在于保持所产生的摘要和地面实况放射学发现之间的实际准确性。现有研究采用强化学习来直接优化正确认知度量指标，如CheXBert或RadGraph分数。然而，它们使用贪婪搜索或束搜索的解码方法，在选择最佳候选项时没有考虑事实的一致性，从而导致实际一致性的改善受限。为了解决这个问题，我们提出了一种新颖的第二阶段摘要方法FactReranker，它是第一次尝试基于它们估计的实际一致性得分来学习从所有候选项中选择最佳摘要。我们建议基于RadGraph模式提取输入医疗报告、其黄金摘要和候选摘要的医疗事实，并设计基于事实引导的重新排序器，以有效地结合提取的医疗事实来选择最佳摘要。我们分解了事实-",
    "tldr": "FactReranker是一种新颖的辅助评估器，可以在保持摘要与放射学发现实况一致性的基础上，通过事实引导来有效地选择最佳的摘要。"
}