{
    "title": "PeakNet: An Autonomous Bragg Peak Finder with Deep Neural Networks. (arXiv:2303.15301v2 [physics.ins-det] UPDATED)",
    "abstract": "Serial crystallography at X-ray free electron laser (XFEL) and synchrotron facilities has experienced tremendous progress in recent times enabling novel scientific investigations into macromolecular structures and molecular processes. However, these experiments generate a significant amount of data posing computational challenges in data reduction and real-time feedback. Bragg peak finding algorithm is used to identify useful images and also provide real-time feedback about hit-rate and resolution. Shot-to-shot intensity fluctuations and strong background scattering from buffer solution, injection nozzle and other shielding materials make this a time-consuming optimization problem. Here, we present PeakNet, an autonomous Bragg peak finder that utilizes deep neural networks. The development of this system 1) eliminates the need for manual algorithm parameter tuning, 2) reduces false-positive peaks by adjusting to shot-to-shot variations in strong background scattering in real-time, 3) e",
    "link": "http://arxiv.org/abs/2303.15301",
    "context": "Title: PeakNet: An Autonomous Bragg Peak Finder with Deep Neural Networks. (arXiv:2303.15301v2 [physics.ins-det] UPDATED)\nAbstract: Serial crystallography at X-ray free electron laser (XFEL) and synchrotron facilities has experienced tremendous progress in recent times enabling novel scientific investigations into macromolecular structures and molecular processes. However, these experiments generate a significant amount of data posing computational challenges in data reduction and real-time feedback. Bragg peak finding algorithm is used to identify useful images and also provide real-time feedback about hit-rate and resolution. Shot-to-shot intensity fluctuations and strong background scattering from buffer solution, injection nozzle and other shielding materials make this a time-consuming optimization problem. Here, we present PeakNet, an autonomous Bragg peak finder that utilizes deep neural networks. The development of this system 1) eliminates the need for manual algorithm parameter tuning, 2) reduces false-positive peaks by adjusting to shot-to-shot variations in strong background scattering in real-time, 3) e",
    "path": "papers/23/03/2303.15301.json",
    "total_tokens": 854,
    "translated_title": "PeakNet：一种利用深度神经网络的自动Bragg峰点寻找器",
    "translated_abstract": "近年来，在X射线自由电子激光器（XFEL）和同步辐射设施中的串行晶体学取得了巨大的进步，使得可以对大分子结构和分子过程进行新颖的科学研究。然而，这些实验产生了大量的数据，给数据减少和实时反馈带来了计算挑战。Bragg峰点寻找算法用于识别有用的图像，并提供关于命中率和分辨率的实时反馈。来自缓冲溶液、注射喷嘴和其他屏蔽材料的逐发强度波动和强背景散射使得这成为一个耗时的优化问题。在这里，我们提出了PeakNet，一种利用深度神经网络的自动Bragg峰点寻找器。",
    "tldr": "PeakNet是一个利用深度神经网络的自动Bragg峰点寻找器，它通过实时调整来适应逐发强背景散射的波动，消除了手动调整算法参数的需求，减少了误报峰点的数量。",
    "en_tdlr": "PeakNet is an autonomous Bragg peak finder that utilizes deep neural networks. It eliminates the need for manual algorithm parameter tuning and reduces the number of false-positive peaks by adjusting to shot-to-shot variations in strong background scattering in real-time."
}