{
    "title": "BIFRNet: A Brain-Inspired Feature Restoration DNN for Partially Occluded Image Recognition. (arXiv:2303.01309v2 [cs.CV] UPDATED)",
    "abstract": "The partially occluded image recognition (POIR) problem has been a challenge for artificial intelligence for a long time. A common strategy to handle the POIR problem is using the non-occluded features for classification. Unfortunately, this strategy will lose effectiveness when the image is severely occluded, since the visible parts can only provide limited information. Several studies in neuroscience reveal that feature restoration which fills in the occluded information and is called amodal completion is essential for human brains to recognize partially occluded images. However, feature restoration is commonly ignored by CNNs, which may be the reason why CNNs are ineffective for the POIR problem. Inspired by this, we propose a novel brain-inspired feature restoration network (BIFRNet) to solve the POIR problem. It mimics a ventral visual pathway to extract image features and a dorsal visual pathway to distinguish occluded and visible image regions. In addition, it also uses a knowle",
    "link": "http://arxiv.org/abs/2303.01309",
    "context": "Title: BIFRNet: A Brain-Inspired Feature Restoration DNN for Partially Occluded Image Recognition. (arXiv:2303.01309v2 [cs.CV] UPDATED)\nAbstract: The partially occluded image recognition (POIR) problem has been a challenge for artificial intelligence for a long time. A common strategy to handle the POIR problem is using the non-occluded features for classification. Unfortunately, this strategy will lose effectiveness when the image is severely occluded, since the visible parts can only provide limited information. Several studies in neuroscience reveal that feature restoration which fills in the occluded information and is called amodal completion is essential for human brains to recognize partially occluded images. However, feature restoration is commonly ignored by CNNs, which may be the reason why CNNs are ineffective for the POIR problem. Inspired by this, we propose a novel brain-inspired feature restoration network (BIFRNet) to solve the POIR problem. It mimics a ventral visual pathway to extract image features and a dorsal visual pathway to distinguish occluded and visible image regions. In addition, it also uses a knowle",
    "path": "papers/23/03/2303.01309.json",
    "total_tokens": 902,
    "translated_title": "BIFRNet: 一种脑启发的特征重建深度神经网络用于部分遮挡图像识别",
    "translated_abstract": "部分遮挡图像识别（POIR）一直以来是人工智能中的难题。解决POIR问题的一种常见策略是使用未遮挡的特征进行分类。然而，当图像严重遮挡时，该策略将失去效果，因为可见部分只能提供有限的信息。神经科学的几项研究表明，要识别部分遮挡的图像，特征重建（填补被遮挡的信息）非常重要，被称为无模完成。然而，CNN常常忽略特征重建，这可能是CNN对POIR问题无效的原因。受此启发，我们提出了一种新型的脑启发特征重建网络（BIFRNet）来解决POIR问题。它模仿了腹侧视觉通路来提取图像特征和背侧视觉通路来区分被遮挡和可见的图像区域。",
    "tldr": "BIFRNet是一种脑启发的深度神经网络，使用特殊的背侧视觉通路来识别部分遮挡的图像，并且能够通过特征重建来填补被遮挡的信息。"
}