{
    "title": "OntoMath${}^{\\mathbf{PRO}}$ 2.0 Ontology: Updates of the Formal Model. (arXiv:2303.13542v1 [cs.AI])",
    "abstract": "This paper is devoted to the problems of ontology-based mathematical knowledge management and representation. The main attention is paid to the development of a formal model for the representation of mathematical statements in the Open Linked Data cloud. The proposed model is intended for applications that extract mathematical facts from natural language mathematical texts and represent these facts as Linked Open Data. The model is used in development of a new version of the OntoMath${}^{\\mathrm{PRO}}$ ontology of professional mathematics is described. OntoMath${}^{\\mathrm{PRO}}$ underlies a semantic publishing platform, that takes as an input a collection of mathematical papers in LaTeX format and builds their ontology-based Linked Open Data representation. The semantic publishing platform, in turn, is a central component of OntoMath digital ecosystem, an ecosystem of ontologies, text analytics tools, and applications for mathematical knowledge management, including semantic search fo",
    "link": "http://arxiv.org/abs/2303.13542",
    "context": "Title: OntoMath${}^{\\mathbf{PRO}}$ 2.0 Ontology: Updates of the Formal Model. (arXiv:2303.13542v1 [cs.AI])\nAbstract: This paper is devoted to the problems of ontology-based mathematical knowledge management and representation. The main attention is paid to the development of a formal model for the representation of mathematical statements in the Open Linked Data cloud. The proposed model is intended for applications that extract mathematical facts from natural language mathematical texts and represent these facts as Linked Open Data. The model is used in development of a new version of the OntoMath${}^{\\mathrm{PRO}}$ ontology of professional mathematics is described. OntoMath${}^{\\mathrm{PRO}}$ underlies a semantic publishing platform, that takes as an input a collection of mathematical papers in LaTeX format and builds their ontology-based Linked Open Data representation. The semantic publishing platform, in turn, is a central component of OntoMath digital ecosystem, an ecosystem of ontologies, text analytics tools, and applications for mathematical knowledge management, including semantic search fo",
    "path": "papers/23/03/2303.13542.json",
    "total_tokens": 808,
    "translated_title": "OntoMath${}^{\\mathbf{PRO}}$ 2.0本体论：正式模型的更新",
    "translated_abstract": "本文探讨本体论用于数学知识管理和表达的问题。主要关注点在于开发一种形式模型，用于在Open Linked Data云中表示数学陈述。该模型旨在用于从自然语言数学文本中提取数学事实并将这些事实表示为Linked Open Data的应用程序中。本文介绍了OntoMath${}^{\\mathrm{PRO}}$一个新版本的本体，该本体用于专业数学，并且是语义发布平台的基础，接受以LaTeX格式编写的数学论文集，并建立其基于本体的Linked Open Data表示。语义发布平台是OntoMath数字生态系统的核心组件，该生态系统由本体、文本分析工具和数学知识管理应用程序（包括语义搜索等）组成。",
    "tldr": "本文介绍了OntoMath${}^{\\mathrm{PRO}}$的新版本，该本体使用形式模型将数学事实表示为Linked Open Data。",
    "en_tdlr": "This paper presents a new version of OntoMath${}^{\\mathrm{PRO}}$ ontology, which uses a formal model to represent mathematical facts as Linked Open Data. This ontology serves as the basis for a semantic publishing platform and a digital ecosystem for mathematical knowledge management."
}