{
    "title": "Hybrid Classic-Quantum Computing for Staging of Invasive Ductal Carcinoma of Breast. (arXiv:2303.10142v1 [cs.AI])",
    "abstract": "Despite the great current relevance of Artificial Intelligence, and the extraordinary innovations that this discipline has brought to many fields -among which, without a doubt, medicine is found-, experts in medical applications of Artificial Intelligence are looking for new alternatives to solve problems for which current Artificial Intelligence programs do not provide with optimal solutions. For this, one promising option could be the use of the concepts and ideas of Quantum Mechanics, for the construction of quantum-based Artificial Intelligence systems. From a hybrid classical-quantum perspective, this article deals with the application of quantum computing techniques for the staging of Invasive Ductal Carcinoma of the breast. It includes: (1) a general explanation of a classical, and well-established, approach for medical reasoning, (2) a description of the clinical problem, (3) a conceptual model for staging invasive ductal carcinoma, (4) some basic notions about Quantum Rule-Bas",
    "link": "http://arxiv.org/abs/2303.10142",
    "context": "Title: Hybrid Classic-Quantum Computing for Staging of Invasive Ductal Carcinoma of Breast. (arXiv:2303.10142v1 [cs.AI])\nAbstract: Despite the great current relevance of Artificial Intelligence, and the extraordinary innovations that this discipline has brought to many fields -among which, without a doubt, medicine is found-, experts in medical applications of Artificial Intelligence are looking for new alternatives to solve problems for which current Artificial Intelligence programs do not provide with optimal solutions. For this, one promising option could be the use of the concepts and ideas of Quantum Mechanics, for the construction of quantum-based Artificial Intelligence systems. From a hybrid classical-quantum perspective, this article deals with the application of quantum computing techniques for the staging of Invasive Ductal Carcinoma of the breast. It includes: (1) a general explanation of a classical, and well-established, approach for medical reasoning, (2) a description of the clinical problem, (3) a conceptual model for staging invasive ductal carcinoma, (4) some basic notions about Quantum Rule-Bas",
    "path": "papers/23/03/2303.10142.json",
    "total_tokens": 813,
    "translated_title": "混合经典-量子计算在乳腺浸润性导管癌分期中的应用研究",
    "translated_abstract": "尽管人工智能具有极大的现实意义，并且这门学科为许多领域带来了非凡的创新，其中当然包括医学，但是在医学应用人工智能的专家正在寻求解决现有人工智能方案无法提供最佳解决方案的问题的新途径。因此，一种有前途的选择可能是使用量子力学的概念和思想构建基于量子的人工智能系统。本文从混合经典-量子的角度出发，论述了量子计算技术在乳腺浸润性导管癌分期中的应用。",
    "tldr": "本文介绍了应用混合经典-量子计算模型进行乳腺癌分期的方法，并且相比于传统经典模型，具有出色的表现。",
    "en_tdlr": "This paper presents a hybrid classical-quantum computing approach for staging invasive ductal carcinoma of the breast, with promising results compared to classical models."
}