{
    "title": "CIFAKE: Image Classification and Explainable Identification of AI-Generated Synthetic Images. (arXiv:2303.14126v1 [cs.CV])",
    "abstract": "Recent technological advances in synthetic data have enabled the generation of images with such high quality that human beings cannot tell the difference between real-life photographs and Artificial Intelligence (AI) generated images. Given the critical necessity of data reliability and authentication, this article proposes to enhance our ability to recognise AI-generated images through computer vision. Initially, a synthetic dataset is generated that mirrors the ten classes of the already available CIFAR-10 dataset with latent diffusion which provides a contrasting set of images for comparison to real photographs. The model is capable of generating complex visual attributes, such as photorealistic reflections in water. The two sets of data present as a binary classification problem with regard to whether the photograph is real or generated by AI. This study then proposes the use of a Convolutional Neural Network (CNN) to classify the images into two categories; Real or Fake. Following",
    "link": "http://arxiv.org/abs/2303.14126",
    "context": "Title: CIFAKE: Image Classification and Explainable Identification of AI-Generated Synthetic Images. (arXiv:2303.14126v1 [cs.CV])\nAbstract: Recent technological advances in synthetic data have enabled the generation of images with such high quality that human beings cannot tell the difference between real-life photographs and Artificial Intelligence (AI) generated images. Given the critical necessity of data reliability and authentication, this article proposes to enhance our ability to recognise AI-generated images through computer vision. Initially, a synthetic dataset is generated that mirrors the ten classes of the already available CIFAR-10 dataset with latent diffusion which provides a contrasting set of images for comparison to real photographs. The model is capable of generating complex visual attributes, such as photorealistic reflections in water. The two sets of data present as a binary classification problem with regard to whether the photograph is real or generated by AI. This study then proposes the use of a Convolutional Neural Network (CNN) to classify the images into two categories; Real or Fake. Following",
    "path": "papers/23/03/2303.14126.json",
    "total_tokens": 800,
    "translated_title": "CIFAKE: AI生成图像的分类和可解释识别",
    "translated_abstract": "最近合成数据技术的进步使得生成的图像质量如此之高，以至于人类无法区分真实照片和人工智能生成的图像。鉴于数据可靠性和认证的至关重要性，本文提出通过计算机视觉增强我们识别AI生成图像的能力。首先，通过潜在扩散生成合成数据集，该数据集与已有的CIFAR-10数据集中的十个类别相似，提供与真实照片对比的不同类型的图像。该模型能够生成复杂的视觉属性，例如水中逼真的反射。这两组数据之间存在二元分类问题，即照片是真实的还是由AI生成的。本研究随后提出使用卷积神经网络（CNN）将图像分类为两个类别：真实或伪造。",
    "tldr": "本文提出了一个名为CIFAKE的方法，可以通过计算机视觉将真实照片与AI生成图像进行二元分类。该方法使用了卷积神经网络（CNN）对图像进行分类。"
}