{
    "title": "Design by Contract Framework for Quantum Software. (arXiv:2303.17750v1 [cs.CL])",
    "abstract": "To realize reliable quantum software, techniques to automatically ensure the quantum software's correctness have recently been investigated. However, they primarily focus on fixed quantum circuits rather than the procedure of building quantum circuits. Despite being a common approach, the correctness of building circuits using different parameters following the same procedure is not guaranteed. To this end, we propose a design-by-contract framework for quantum software. Our framework provides a python-embedded language to write assertions on the input and output states of all quantum circuits built by certain procedures. Additionally, it provides a method to write assertions about the statistical processing of measurement results to ensure the procedure's correctness for obtaining the final result. These assertions are automatically checked using a quantum computer simulator. For evaluation, we implemented our framework and wrote assertions for some widely used quantum algorithms. Cons",
    "link": "http://arxiv.org/abs/2303.17750",
    "context": "Title: Design by Contract Framework for Quantum Software. (arXiv:2303.17750v1 [cs.CL])\nAbstract: To realize reliable quantum software, techniques to automatically ensure the quantum software's correctness have recently been investigated. However, they primarily focus on fixed quantum circuits rather than the procedure of building quantum circuits. Despite being a common approach, the correctness of building circuits using different parameters following the same procedure is not guaranteed. To this end, we propose a design-by-contract framework for quantum software. Our framework provides a python-embedded language to write assertions on the input and output states of all quantum circuits built by certain procedures. Additionally, it provides a method to write assertions about the statistical processing of measurement results to ensure the procedure's correctness for obtaining the final result. These assertions are automatically checked using a quantum computer simulator. For evaluation, we implemented our framework and wrote assertions for some widely used quantum algorithms. Cons",
    "path": "papers/23/03/2303.17750.json",
    "total_tokens": 859,
    "translated_title": "基于合约的量子软件设计框架",
    "translated_abstract": "为了实现可靠的量子软件，最近研究了自动确保量子软件正确性的技术。然而，它们主要关注固定的量子电路，而不是构建量子电路的过程。尽管这是一种常见的方法，但使用不同参数按照相同的过程构建电路的正确性并不保证。为此，我们提出了一种量子软件的合约设计框架。我们的框架提供了一种嵌入python的语言，用于编写关于由某些过程构建的所有量子电路的输入和输出状态的断言。此外，它提供了一种方法，用于编写关于测量结果的统计处理的断言，以确保获得最终结果的过程的正确性。这些断言使用量子计算机模拟器自动检查。为了评估，我们实现了我们的框架，并为一些广泛使用的量子算法编写了assertions。",
    "tldr": "该论文提出了一种基于合约的量子软件设计框架，用于自动确保量子电路构建过程的正确性，这对于验证量子电路的正确性具有重要意义。",
    "en_tdlr": "This paper proposes a Design by Contract framework for quantum software, which automatically ensures the correctness of the process of building quantum circuits by using assertions on input/output states and statistical processing of measurement results. The framework significantly simplifies the correctness verification for quantum circuits and reduces the probability of errors."
}