{
    "title": "GRAF: Graph Attention-aware Fusion Networks. (arXiv:2303.16781v1 [cs.LG])",
    "abstract": "A large number of real-world networks include multiple types of nodes and edges. Graph Neural Network (GNN) emerged as a deep learning framework to utilize node features on graph-structured data showing superior performance. However, popular GNN-based architectures operate on one homogeneous network. Enabling them to work on multiple networks brings additional challenges due to the heterogeneity of the networks and the multiplicity of the existing associations. In this study, we present a computational approach named GRAF utilizing GNN-based approaches on multiple networks with the help of attention mechanisms and network fusion. Using attention-based neighborhood aggregation, GRAF learns the importance of each neighbor per node (called node-level attention) followed by the importance of association (called association-level attention) in a hierarchical way. Then, GRAF processes a network fusion step weighing each edge according to learned node- and association-level attention, which r",
    "link": "http://arxiv.org/abs/2303.16781",
    "context": "Title: GRAF: Graph Attention-aware Fusion Networks. (arXiv:2303.16781v1 [cs.LG])\nAbstract: A large number of real-world networks include multiple types of nodes and edges. Graph Neural Network (GNN) emerged as a deep learning framework to utilize node features on graph-structured data showing superior performance. However, popular GNN-based architectures operate on one homogeneous network. Enabling them to work on multiple networks brings additional challenges due to the heterogeneity of the networks and the multiplicity of the existing associations. In this study, we present a computational approach named GRAF utilizing GNN-based approaches on multiple networks with the help of attention mechanisms and network fusion. Using attention-based neighborhood aggregation, GRAF learns the importance of each neighbor per node (called node-level attention) followed by the importance of association (called association-level attention) in a hierarchical way. Then, GRAF processes a network fusion step weighing each edge according to learned node- and association-level attention, which r",
    "path": "papers/23/03/2303.16781.json",
    "total_tokens": 867,
    "translated_title": "GRAF：图形注意融合网络",
    "translated_abstract": "许多现实世界的网络包含多种类型的节点和边。图神经网络(GNN)作为一种利用图结构数据上的节点特征的深度学习框架已经证明了卓越的性能。然而，流行的基于GNN的架构只能处理一个同构网络。使它们能够处理多个网络带来了额外的挑战，因为网络的异构性和现有关联的多样性。在本研究中，我们提出了一个名为GRAF的计算方法，利用GNN的方法在多个网络上使用注意机制和网络融合。使用基于注意力的邻域聚合，GRAF学习每个节点的邻居节点的重要性（称为节点级注意力）以及分层方式下的关联的重要性（称为关联级注意力）。然后，GRAF处理一个网络融合步骤，根据学习到的节点和关联级注意力加权每条边。",
    "tldr": "本文提出了一个名为GRAF的方法，使用注意机制和网络融合在多个网络上使用基于GNN的方法。通过attention-based neighborhood aggregation，GRAF能够学习每个节点和关联的重要性，并根据它们在网络融合中进行边缘加权。",
    "en_tdlr": "This paper proposes a method called GRAF, which uses attention mechanisms and network fusion to apply GNN-based approaches on multiple networks. Utilizing attention-based neighborhood aggregation, GRAF is able to learn the importance of each node and association, and weight each edge according to the learned importance during network fusion."
}