{
    "title": "A Novel Neural Network Approach for Predicting the Arrival Time of Buses for Smart On-Demand Public Transit. (arXiv:2303.15495v1 [cs.LG])",
    "abstract": "Among the major public transportation systems in cities, bus transit has its problems, including more accuracy and reliability when estimating the bus arrival time for riders. This can lead to delays and decreased ridership, especially in cities where public transportation is heavily relied upon. A common issue is that the arrival times of buses do not match the schedules, resulting in latency for fixed schedules. According to the study in this paper on New York City bus data, there is an average delay of around eight minutes or 491 seconds mismatch between the bus arrivals and the actual scheduled time. This research paper presents a novel AI-based data-driven approach for estimating the arrival times of buses at each transit point (station). Our approach is based on a fully connected neural network and can predict the arrival time collectively across all bus lines in large metropolitan areas. Our neural-net data-driven approach provides a new way to estimate the arrival time of the b",
    "link": "http://arxiv.org/abs/2303.15495",
    "context": "Title: A Novel Neural Network Approach for Predicting the Arrival Time of Buses for Smart On-Demand Public Transit. (arXiv:2303.15495v1 [cs.LG])\nAbstract: Among the major public transportation systems in cities, bus transit has its problems, including more accuracy and reliability when estimating the bus arrival time for riders. This can lead to delays and decreased ridership, especially in cities where public transportation is heavily relied upon. A common issue is that the arrival times of buses do not match the schedules, resulting in latency for fixed schedules. According to the study in this paper on New York City bus data, there is an average delay of around eight minutes or 491 seconds mismatch between the bus arrivals and the actual scheduled time. This research paper presents a novel AI-based data-driven approach for estimating the arrival times of buses at each transit point (station). Our approach is based on a fully connected neural network and can predict the arrival time collectively across all bus lines in large metropolitan areas. Our neural-net data-driven approach provides a new way to estimate the arrival time of the b",
    "path": "papers/23/03/2303.15495.json",
    "total_tokens": 904,
    "translated_title": "一种用于智能按需公共交通预测公交车到达时间的新型神经网络方法",
    "translated_abstract": "在城市的主要公共交通系统中，公交运输存在着问题，其中包括对于乘客公交车到达时间的估计更加准确和可靠。这可能导致延误和减少乘客人数，尤其是在依靠公共交通的城市中更加严重。公交车到达时间与时间表不匹配是一个普遍的问题，导致固定时刻表的延迟。根据本文在纽约市公交数据上进行的研究，公交车到达时间和实际计划时间之间存在平均约八分钟或491秒的延迟。本研究提出了一种基于人工智能的数据驱动方法，用于估计每个交通点（站）公交车的到达时间。我们的方法基于全连接神经网络，可以在大都市区域中跨所有公交线路集体预测到达时间。我们的神经网络数据驱动方法为估算公交车到达时间提供了一种新的方式。",
    "tldr": "本文介绍了一种基于神经网络的数据驱动方法，可以跨所有公交线路集体预测公交车到达每个交通点的时间，解决公交运输中公交车到达时间不准确和可靠的问题。",
    "en_tdlr": "This paper presents a novel data-driven approach based on neural network to collectively predict the arrival time of buses at each transit point across all bus lines in large metropolitan areas, which solves the problem of inaccurate and unreliable bus arrival time estimation in public transit."
}