{
    "title": "An investigation of licensing of datasets for machine learning based on the GQM model. (arXiv:2303.13735v1 [cs.SE])",
    "abstract": "Dataset licensing is currently an issue in the development of machine learning systems. And in the development of machine learning systems, the most widely used are publicly available datasets. However, since the images in the publicly available dataset are mainly obtained from the Internet, some images are not commercially available. Furthermore, developers of machine learning systems do not often care about the license of the dataset when training machine learning models with it. In summary, the licensing of datasets for machine learning systems is in a state of incompleteness in all aspects at this stage.  Our investigation of two collection datasets revealed that most of the current datasets lacked licenses, and the lack of licenses made it impossible to determine the commercial availability of the datasets. Therefore, we decided to take a more scientific and systematic approach to investigate the licensing of datasets and the licensing of machine learning systems that use the data",
    "link": "http://arxiv.org/abs/2303.13735",
    "context": "Title: An investigation of licensing of datasets for machine learning based on the GQM model. (arXiv:2303.13735v1 [cs.SE])\nAbstract: Dataset licensing is currently an issue in the development of machine learning systems. And in the development of machine learning systems, the most widely used are publicly available datasets. However, since the images in the publicly available dataset are mainly obtained from the Internet, some images are not commercially available. Furthermore, developers of machine learning systems do not often care about the license of the dataset when training machine learning models with it. In summary, the licensing of datasets for machine learning systems is in a state of incompleteness in all aspects at this stage.  Our investigation of two collection datasets revealed that most of the current datasets lacked licenses, and the lack of licenses made it impossible to determine the commercial availability of the datasets. Therefore, we decided to take a more scientific and systematic approach to investigate the licensing of datasets and the licensing of machine learning systems that use the data",
    "path": "papers/23/03/2303.13735.json",
    "total_tokens": 825,
    "translated_title": "基于GQM模型的机器学习数据集许可证调查",
    "translated_abstract": "数据集许可证目前在机器学习系统开发中是一个问题。而在机器学习系统开发中，最常用的是公开可用的数据集。然而，由于公开可用的数据集中的图像主要是从互联网上获取的，因此一些图像并不是商业可用的。此外，当使用数据集训练机器学习模型时，开发人员通常不关心数据集的许可证。总结而言，在这个阶段，机器学习系统的数据集许可证在所有方面都处于不完整的状态。我们调查了两个收集的数据集，发现大多数当前的数据集缺乏许可证，缺乏许可证使得无法确定数据集的商业可用性。因此，我们决定采取更科学和系统的方法来调查数据集的许可证和使用数据的机器学习系统的许可证。",
    "tldr": "机器学习数据集的许可证是一个问题，公开数据集质量不佳，缺乏商业可用性。当前数据集缺少许可证，需要更科学和系统的方法来调查。",
    "en_tdlr": "Licensing of datasets for machine learning is incomplete, and most publicly available datasets lack licenses. The lack of licenses makes it impossible to determine commercial availability, and a more scientific and systematic approach is needed to investigate dataset and machine learning system licensing."
}