{
    "title": "FUSQA: Fetal Ultrasound Segmentation Quality Assessment. (arXiv:2303.04418v2 [eess.IV] UPDATED)",
    "abstract": "Deep learning models have been effective for various fetal ultrasound segmentation tasks. However, generalization to new unseen data has raised questions about their effectiveness for clinical adoption. Normally, a transition to new unseen data requires time-consuming and costly quality assurance processes to validate the segmentation performance post-transition. Segmentation quality assessment efforts have focused on natural images, where the problem has been typically formulated as a dice score regression task. In this paper, we propose a simplified Fetal Ultrasound Segmentation Quality Assessment (FUSQA) model to tackle the segmentation quality assessment when no masks exist to compare with. We formulate the segmentation quality assessment process as an automated classification task to distinguish between good and poor-quality segmentation masks for more accurate gestational age estimation. We validate the performance of our proposed approach on two datasets we collect from two hosp",
    "link": "http://arxiv.org/abs/2303.04418",
    "context": "Title: FUSQA: Fetal Ultrasound Segmentation Quality Assessment. (arXiv:2303.04418v2 [eess.IV] UPDATED)\nAbstract: Deep learning models have been effective for various fetal ultrasound segmentation tasks. However, generalization to new unseen data has raised questions about their effectiveness for clinical adoption. Normally, a transition to new unseen data requires time-consuming and costly quality assurance processes to validate the segmentation performance post-transition. Segmentation quality assessment efforts have focused on natural images, where the problem has been typically formulated as a dice score regression task. In this paper, we propose a simplified Fetal Ultrasound Segmentation Quality Assessment (FUSQA) model to tackle the segmentation quality assessment when no masks exist to compare with. We formulate the segmentation quality assessment process as an automated classification task to distinguish between good and poor-quality segmentation masks for more accurate gestational age estimation. We validate the performance of our proposed approach on two datasets we collect from two hosp",
    "path": "papers/23/03/2303.04418.json",
    "total_tokens": 848,
    "translated_title": "FUSQA: 胎儿超声分割质量评估",
    "translated_abstract": "深度学习模型在各种胎儿超声分割任务中取得了很好的效果。然而，对于新的未见数据的泛化引发了关于它们在临床应用中的效果的问题。通常，向新的未见数据的转换需要耗时且昂贵的质量保证流程来验证转换后的分割性能。分割质量评估的工作集中在自然图像上，其中问题通常被形式化为一个dice分数回归任务。在本文中，我们提出了一个简化的胎儿超声分割质量评估（FUSQA）模型，用于处理当不存在用于比较的掩码时的分割质量评估。我们将分割质量评估过程定为一个自动化分类任务，以区分优质和低质量的分割掩码，以实现更准确的孕龄估计。我们在从两个医院收集的两个数据集上验证了我们提出方法的性能。",
    "tldr": "FUSQA是一个用于胎儿超声分割质量评估的简化模型，通过将分割质量评估过程定为自动化分类任务，实现了更准确的孕龄估计。"
}