{
    "title": "The State of Food Systems Worldwide: Counting Down to 2030. (arXiv:2303.13669v1 [econ.GN])",
    "abstract": "Transforming food systems is essential to bring about a healthier, equitable, sustainable, and resilient future, including achieving global development and sustainability goals. To date, no comprehensive framework exists to track food systems transformation and their contributions to global goals. In 2021, the Food Systems Countdown to 2030 Initiative (FSCI) articulated an architecture to monitor food systems across five themes: 1 diets, nutrition, and health; 2 environment, natural resources, and production; 3 livelihoods, poverty, and equity; 4 governance; and 5 resilience and sustainability. Each theme comprises three-to-five indicator domains. This paper builds on that architecture, presenting the inclusive, consultative process used to select indicators and an application of the indicator framework using the latest available data, constructing the first global food systems baseline to track transformation. While data are available to cover most themes and domains, critical indicat",
    "link": "http://arxiv.org/abs/2303.13669",
    "context": "Title: The State of Food Systems Worldwide: Counting Down to 2030. (arXiv:2303.13669v1 [econ.GN])\nAbstract: Transforming food systems is essential to bring about a healthier, equitable, sustainable, and resilient future, including achieving global development and sustainability goals. To date, no comprehensive framework exists to track food systems transformation and their contributions to global goals. In 2021, the Food Systems Countdown to 2030 Initiative (FSCI) articulated an architecture to monitor food systems across five themes: 1 diets, nutrition, and health; 2 environment, natural resources, and production; 3 livelihoods, poverty, and equity; 4 governance; and 5 resilience and sustainability. Each theme comprises three-to-five indicator domains. This paper builds on that architecture, presenting the inclusive, consultative process used to select indicators and an application of the indicator framework using the latest available data, constructing the first global food systems baseline to track transformation. While data are available to cover most themes and domains, critical indicat",
    "path": "papers/23/03/2303.13669.json",
    "total_tokens": 890,
    "translated_title": "全球食物系统的现状：倒计时至2030年",
    "translated_abstract": "转变食物系统是实现全球发展和可持续目标、带来更健康、公平、可持续和有弹性的未来所必需的。迄今为止，没有综合性框架来跟踪食物系统的转型及其对全球目标的贡献。在2021年，食物系统到2030倒计时倡议（FSCI）阐明了一种体系结构来监测食物系统，分为五个主题：1 饮食、营养和健康；2 环境、自然资源和生产；3 生计、贫困和公平；4 治理；和5弹性和可持续性。每个主题包括三至五个指标领域。本文基于该体系结构，介绍了包容性、咨询性的过程用于选择指标，并应用最新可用的数据构建了第一个全球食物系统基线以跟踪转型。虽然涵盖了大多数主题和领域的数据，但关键指标仍需进一步开发。",
    "tldr": "本文介绍了食物系统到2030倒计时倡议提出的五个主题和指标体系结构，并应用最新可用数据构建了第一个全球食物系统基线以跟踪转型。",
    "en_tdlr": "This paper presents the five themes and indicator framework proposed by the Food Systems Countdown to 2030 Initiative, and constructs the first global food systems baseline to track transformation using the latest available data."
}