{
    "title": "Multiphysics discovery with moving boundaries using Ensemble SINDy and Peridynamic Differential Operator. (arXiv:2303.15631v1 [cs.LG])",
    "abstract": "This study proposes a novel framework for learning the underlying physics of phenomena with moving boundaries. The proposed approach combines Ensemble SINDy and Peridynamic Differential Operator (PDDO) and imposes an inductive bias assuming the moving boundary physics evolve in its own corotational coordinate system. The robustness of the approach is demonstrated by considering various levels of noise in the measured data using the 2D Fisher-Stefan model. The confidence intervals of recovered coefficients are listed, and the uncertainties of the moving boundary positions are depicted by obtaining the solutions with the recovered coefficients. Although the main focus of this study is the Fisher-Stefan model, the proposed approach is applicable to any type of moving boundary problem with a smooth moving boundary front without a mushy region. The code and data for this framework is available at: https://github.com/alicanbekar/MB_PDDO-SINDy.",
    "link": "http://arxiv.org/abs/2303.15631",
    "context": "Title: Multiphysics discovery with moving boundaries using Ensemble SINDy and Peridynamic Differential Operator. (arXiv:2303.15631v1 [cs.LG])\nAbstract: This study proposes a novel framework for learning the underlying physics of phenomena with moving boundaries. The proposed approach combines Ensemble SINDy and Peridynamic Differential Operator (PDDO) and imposes an inductive bias assuming the moving boundary physics evolve in its own corotational coordinate system. The robustness of the approach is demonstrated by considering various levels of noise in the measured data using the 2D Fisher-Stefan model. The confidence intervals of recovered coefficients are listed, and the uncertainties of the moving boundary positions are depicted by obtaining the solutions with the recovered coefficients. Although the main focus of this study is the Fisher-Stefan model, the proposed approach is applicable to any type of moving boundary problem with a smooth moving boundary front without a mushy region. The code and data for this framework is available at: https://github.com/alicanbekar/MB_PDDO-SINDy.",
    "path": "papers/23/03/2303.15631.json",
    "total_tokens": 922,
    "translated_title": "使用集合SINDy和Peridynamic差分算子的移动边界多物理发现",
    "translated_abstract": "本研究提出了一种用于学习具有移动边界现象的潜在物理学的新型框架。所提出的方法将集合SINDy和Peridynamic差分算子（PDDO）相结合，并假设移动边界物理学在其自身的旋转坐标系中演化。通过使用2D Fisher-Stefan模型考虑测量数据中的各个噪声水平来演示方法的鲁棒性。列出了恢复系数的置信区间，并通过使用恢复系数获得解来描绘移动边界位置的不确定性。尽管本研究的重点是Fisher-Stefan模型，但所提出的方法适用于任何具有平滑移动边界前端且没有粘液区域的移动边界问题。该框架的代码和数据可在以下网址获得：https://github.com/alicanbekar/MB_PDDO-SINDy。",
    "tldr": "本研究提出了一种使用集合SINDy和Peridynamic差分算子的新型框架，用于学习具有移动边界现象的潜在物理学。演示了该方法在各种噪声水平下的鲁棒性，适用于任何平滑移动边界前端且没有粘液区域的移动边界问题。",
    "en_tdlr": "This study proposes a novel framework using Ensemble SINDy and Peridynamic Differential Operator (PDDO) to learn the underlying physics of phenomena with moving boundaries. The approach is robust and applicable to any moving boundary problem with a smooth front."
}