{
    "title": "Ensemble-based Blackbox Attacks on Dense Prediction. (arXiv:2303.14304v1 [cs.CV])",
    "abstract": "We propose an approach for adversarial attacks on dense prediction models (such as object detectors and segmentation). It is well known that the attacks generated by a single surrogate model do not transfer to arbitrary (blackbox) victim models. Furthermore, targeted attacks are often more challenging than the untargeted attacks. In this paper, we show that a carefully designed ensemble can create effective attacks for a number of victim models. In particular, we show that normalization of the weights for individual models plays a critical role in the success of the attacks. We then demonstrate that by adjusting the weights of the ensemble according to the victim model can further improve the performance of the attacks. We performed a number of experiments for object detectors and segmentation to highlight the significance of the our proposed methods. Our proposed ensemble-based method outperforms existing blackbox attack methods for object detection and segmentation. Finally we show t",
    "link": "http://arxiv.org/abs/2303.14304",
    "context": "Title: Ensemble-based Blackbox Attacks on Dense Prediction. (arXiv:2303.14304v1 [cs.CV])\nAbstract: We propose an approach for adversarial attacks on dense prediction models (such as object detectors and segmentation). It is well known that the attacks generated by a single surrogate model do not transfer to arbitrary (blackbox) victim models. Furthermore, targeted attacks are often more challenging than the untargeted attacks. In this paper, we show that a carefully designed ensemble can create effective attacks for a number of victim models. In particular, we show that normalization of the weights for individual models plays a critical role in the success of the attacks. We then demonstrate that by adjusting the weights of the ensemble according to the victim model can further improve the performance of the attacks. We performed a number of experiments for object detectors and segmentation to highlight the significance of the our proposed methods. Our proposed ensemble-based method outperforms existing blackbox attack methods for object detection and segmentation. Finally we show t",
    "path": "papers/23/03/2303.14304.json",
    "total_tokens": 913,
    "translated_title": "基于集成的黑盒攻击密集预测模型",
    "translated_abstract": "我们提出了一种针对密集预测模型的对抗攻击方法(例如目标检测和分割)。众所周知，单个替代模型产生的攻击不适用于任意(黑盒)受害者模型。此外，有针对性的攻击通常比无针对性的攻击更具挑战性。本文表明，经过精心设计的集成可以为多个受害者模型创建有效的攻击。特别地，我们表明，对于单个模型的权重的规范化对于攻击的成功至关重要。然后，我们展示了通过根据受害者模型调整集成权重可以进一步提高攻击的性能。我们进行了许多目标检测和分割实验，以突显我们提出的方法的重要性。我们提出的基于集成的方法优于现有的用于目标检测和分割的黑盒攻击方法。最后，我们展示了通过使用权重调整方法测得的性能优于调整前的集成。",
    "tldr": "本文提出了一种对密集预测模型进行黑盒攻击的方法，该方法基于一个经过精心设计的集成，并注意到单个模型的权重规范化和集成权重的调整可以进一步提高攻击性能。该方法已经在目标检测和分割任务上得到了验证。",
    "en_tdlr": "This paper proposes an approach for blackbox attacks on dense prediction models using a carefully designed ensemble, with attention paid to the normalization of individual model weights and ensemble weight adjustments. It outperforms existing blackbox attack methods for object detection and segmentation, as demonstrated through experiments."
}