{
    "title": "Thread Counting in Plain Weave for Old Paintings Using Semi-Supervised Regression Deep Learning Models. (arXiv:2303.15999v1 [cs.CV])",
    "abstract": "In this work the authors develop regression approaches based on deep learning to perform thread density estimation for plain weave canvas analysis. Previous approaches were based on Fourier analysis, that are quite robust for some scenarios but fail in some other, in machine learning tools, that involve pre-labeling of the painting at hand, or the segmentation of thread crossing points, that provides good estimations in all scenarios with no need of pre-labeling. The segmentation approach is time-consuming as estimation of the densities is performed after locating the crossing points. In this novel proposal, we avoid this step by computing the density of threads directly from the image with a regression deep learning model. We also incorporate some improvements in the initial preprocessing of the input image with an impact on the final error. Several models are proposed and analyzed to retain the best one. Furthermore, we further reduce the density estimation error by introducing a sem",
    "link": "http://arxiv.org/abs/2303.15999",
    "context": "Title: Thread Counting in Plain Weave for Old Paintings Using Semi-Supervised Regression Deep Learning Models. (arXiv:2303.15999v1 [cs.CV])\nAbstract: In this work the authors develop regression approaches based on deep learning to perform thread density estimation for plain weave canvas analysis. Previous approaches were based on Fourier analysis, that are quite robust for some scenarios but fail in some other, in machine learning tools, that involve pre-labeling of the painting at hand, or the segmentation of thread crossing points, that provides good estimations in all scenarios with no need of pre-labeling. The segmentation approach is time-consuming as estimation of the densities is performed after locating the crossing points. In this novel proposal, we avoid this step by computing the density of threads directly from the image with a regression deep learning model. We also incorporate some improvements in the initial preprocessing of the input image with an impact on the final error. Several models are proposed and analyzed to retain the best one. Furthermore, we further reduce the density estimation error by introducing a sem",
    "path": "papers/23/03/2303.15999.json",
    "total_tokens": 767,
    "translated_title": "一种基于半监督回归深度学习模型的简绸纱线数目计算方法以应用于古老油画",
    "translated_abstract": "本文作者开发了一种基于深度学习的回归方法，以执行对简绸纱线密度的估计，以进行画布分析。该新方法可以直接从图像中计算线密度，并在训练过程中使用了专家知识。该方法在艺术保存和修复领域具有潜在应用。",
    "tldr": "本文开发了一种基于深度学习的半监督回归模型，可直接从图片中计算简绸纱线的线密度，以应用于古老油画，为艺术品保护和修复提供了可靠的线密度估计方法。",
    "en_tdlr": "The authors propose a semi-supervised regression deep learning approach to directly estimate thread density in plain weave canvases from images, without the need for labeling or segmentation. This method has potential applications in the conservation and restoration of art."
}