{
    "title": "Domain Specific Question Answering Over Knowledge Graphs Using Logical Programming and Large Language Models. (arXiv:2303.02206v2 [cs.LG] UPDATED)",
    "abstract": "Answering questions over domain-specific graphs requires a tailored approach due to the limited number of relations and the specific nature of the domain. Our approach integrates classic logical programming languages into large language models (LLMs), enabling the utilization of logical reasoning capabilities to tackle the KGQA task. By representing the questions as Prolog queries, which are readable and near close to natural language in representation, we facilitate the generation of programmatically derived answers. To validate the effectiveness of our approach, we evaluate it using a well-known benchmark dataset, MetaQA. Our experimental results demonstrate that our method achieves accurate identification of correct answer entities for all test questions, even when trained on a small fraction of annotated data. Overall, our work presents a promising approach to addressing question answering over domain-specific graphs, offering an explainable and robust solution by incorporating log",
    "link": "http://arxiv.org/abs/2303.02206",
    "context": "Title: Domain Specific Question Answering Over Knowledge Graphs Using Logical Programming and Large Language Models. (arXiv:2303.02206v2 [cs.LG] UPDATED)\nAbstract: Answering questions over domain-specific graphs requires a tailored approach due to the limited number of relations and the specific nature of the domain. Our approach integrates classic logical programming languages into large language models (LLMs), enabling the utilization of logical reasoning capabilities to tackle the KGQA task. By representing the questions as Prolog queries, which are readable and near close to natural language in representation, we facilitate the generation of programmatically derived answers. To validate the effectiveness of our approach, we evaluate it using a well-known benchmark dataset, MetaQA. Our experimental results demonstrate that our method achieves accurate identification of correct answer entities for all test questions, even when trained on a small fraction of annotated data. Overall, our work presents a promising approach to addressing question answering over domain-specific graphs, offering an explainable and robust solution by incorporating log",
    "path": "papers/23/03/2303.02206.json",
    "total_tokens": 992,
    "translated_title": "使用逻辑编程和大型语言模型的领域特定问题回答在知识图谱上。 (arXiv:2303.02206v2 [cs.LG] UPDATED)",
    "translated_abstract": "在领域特定的图谱上回答问题需要一种定制的方法，因为关系的数量有限，并且领域的特定性。我们的方法将经典的逻辑编程语言整合到大型语言模型中，使其能够利用逻辑推理能力来解决KGQA任务。通过将问题表示为Prolog查询，我们可以容易地生成程序化生成的答案。为了验证我们的方法的有效性，我们使用一个著名的基准数据集MetaQA进行评估。实验结果表明，即使在训练了一小部分注释数据的情况下，我们的方法也能准确地识别出所有测试问题的正确答案实体。总体而言，我们的工作提出了一种有前景的方法来解决领域特定图谱上的问题回答，通过整合逻辑编程提供了一个可解释和健壮的解决方案。",
    "tldr": "该论文提出了一种在知识图谱上回答领域特定问题的方法，通过将经典的逻辑编程语言与大型语言模型整合，实现逻辑推理能力来解决KGQA任务。实验证明该方法在准确识别所有测试问题的正确答案实体方面表现出较高效果，即使仅使用少量标注数据进行训练。这种方法为解决领域特定图谱上的问题回答提供了有前景的解决方案，具有可解释性和稳健性。",
    "en_tdlr": "This paper presents an approach for answering domain-specific questions over knowledge graphs by integrating classic logical programming languages into large language models, enabling logical reasoning capabilities for the KGQA task. Experimental results demonstrate accurate identification of correct answer entities for all test questions, even with limited annotated data. The proposed method offers a promising solution for question answering over domain-specific graphs, providing explainability and robustness by incorporating logical programming."
}