{
    "title": "Towards Phytoplankton Parasite Detection Using Autoencoders. (arXiv:2303.08744v1 [cs.CV])",
    "abstract": "Phytoplankton parasites are largely understudied microbial components with a potentially significant ecological impact on phytoplankton bloom dynamics. To better understand their impact, we need improved detection methods to integrate phytoplankton parasite interactions in monitoring aquatic ecosystems. Automated imaging devices usually produce high amount of phytoplankton image data, while the occurrence of anomalous phytoplankton data is rare. Thus, we propose an unsupervised anomaly detection system based on the similarity of the original and autoencoder-reconstructed samples. With this approach, we were able to reach an overall F1 score of 0.75 in nine phytoplankton species, which could be further improved by species-specific fine-tuning. The proposed unsupervised approach was further compared with the supervised Faster R-CNN based object detector. With this supervised approach and the model trained on plankton species and anomalies, we were able to reach the highest F1 score of 0.",
    "link": "http://arxiv.org/abs/2303.08744",
    "context": "Title: Towards Phytoplankton Parasite Detection Using Autoencoders. (arXiv:2303.08744v1 [cs.CV])\nAbstract: Phytoplankton parasites are largely understudied microbial components with a potentially significant ecological impact on phytoplankton bloom dynamics. To better understand their impact, we need improved detection methods to integrate phytoplankton parasite interactions in monitoring aquatic ecosystems. Automated imaging devices usually produce high amount of phytoplankton image data, while the occurrence of anomalous phytoplankton data is rare. Thus, we propose an unsupervised anomaly detection system based on the similarity of the original and autoencoder-reconstructed samples. With this approach, we were able to reach an overall F1 score of 0.75 in nine phytoplankton species, which could be further improved by species-specific fine-tuning. The proposed unsupervised approach was further compared with the supervised Faster R-CNN based object detector. With this supervised approach and the model trained on plankton species and anomalies, we were able to reach the highest F1 score of 0.",
    "path": "papers/23/03/2303.08744.json",
    "total_tokens": 1299,
    "tldr": "本文提出了一种基于自编码器的无监督异类检测系统，能够在多个浮游植物物种中达到总体F1得分为0.75，提供了一种新的检测方法来研究浮游植物寄生虫及其对生态系统的影响。",
    "en_tdlr": "This paper introduces an unsupervised anomaly detection system based on autoencoder to detect phytoplankton parasites, with an overall F1 score of 0.75 in nine phytoplankton species. It provides a new method to study the impact of phytoplankton parasites on aquatic ecosystems."
}