{
    "title": "Sasaki Metric for Spline Models of Manifold-Valued Trajectories. (arXiv:2303.17299v1 [math.DG])",
    "abstract": "We propose a generic spatiotemporal framework to analyze manifold-valued measurements, which allows for employing an intrinsic and computationally efficient Riemannian hierarchical model. Particularly, utilizing regression, we represent discrete trajectories in a Riemannian manifold by composite B\\' ezier splines, propose a natural metric induced by the Sasaki metric to compare the trajectories, and estimate average trajectories as group-wise trends. We evaluate our framework in comparison to state-of-the-art methods within qualitative and quantitative experiments on hurricane tracks. Notably, our results demonstrate the superiority of spline-based approaches for an intensity classification of the tracks.",
    "link": "http://arxiv.org/abs/2303.17299",
    "context": "Title: Sasaki Metric for Spline Models of Manifold-Valued Trajectories. (arXiv:2303.17299v1 [math.DG])\nAbstract: We propose a generic spatiotemporal framework to analyze manifold-valued measurements, which allows for employing an intrinsic and computationally efficient Riemannian hierarchical model. Particularly, utilizing regression, we represent discrete trajectories in a Riemannian manifold by composite B\\' ezier splines, propose a natural metric induced by the Sasaki metric to compare the trajectories, and estimate average trajectories as group-wise trends. We evaluate our framework in comparison to state-of-the-art methods within qualitative and quantitative experiments on hurricane tracks. Notably, our results demonstrate the superiority of spline-based approaches for an intensity classification of the tracks.",
    "path": "papers/23/03/2303.17299.json",
    "total_tokens": 801,
    "translated_title": "样条模型中测量流形值轨迹的Sasaki度量",
    "translated_abstract": "我们提出了一个通用的时空框架来分析流形值测量，它允许使用固有且计算高效的黎曼分层模型。特别地，利用回归，我们通过复合B\\' ezier样条在黎曼流形上表达离散轨迹，提出了一种由Sasaki度量诱导的自然度量来比较轨迹，并将平均轨迹估计为群体趋势。我们在飓风轨迹上进行了定性和定量实验，将我们的框架与最先进的方法进行了比较。值得注意的是，我们的结果表明，基于样条的方法在轨迹强度分类方面具有优越性。",
    "tldr": "该论文提出了一个使用Sasaki度量实现比较离散轨迹的方法，从而在流形值测量中建立了一个计算高效、固有的黎曼分层模型，该方法还可用于群体趋势的平均轨迹估计，经过实验证明在飓风轨迹强度分类方面具有优越性。",
    "en_tdlr": "This paper proposes a method using the Sasaki metric to compare discrete trajectories, establishes an intrinsic and computationally efficient Riemannian hierarchical model for manifold-valued measurements, and estimates average trajectories as group-wise trends. The method demonstrates superiority in intensity classification of hurricane tracks through both qualitative and quantitative experiments."
}