{
    "title": "Feature Selection with Annealing for Forecasting Financial Time Series",
    "abstract": "arXiv:2303.02223v3 Announce Type: replace  Abstract: Stock market and cryptocurrency forecasting is very important to investors as they aspire to achieve even the slightest improvement to their buy or hold strategies so that they may increase profitability. However, obtaining accurate and reliable predictions is challenging, noting that accuracy does not equate to reliability, especially when financial time-series forecasting is applied owing to its complex and chaotic tendencies. To mitigate this complexity, this study provides a comprehensive method for forecasting financial time series based on tactical input output feature mapping techniques using machine learning (ML) models. During the prediction process, selecting the relevant indicators is vital to obtaining the desired results. In the financial field, limited attention has been paid to this problem with ML solutions. We investigate the use of feature selection with annealing (FSA) for the first time in this field, and we apply",
    "link": "https://arxiv.org/abs/2303.02223",
    "context": "Title: Feature Selection with Annealing for Forecasting Financial Time Series\nAbstract: arXiv:2303.02223v3 Announce Type: replace  Abstract: Stock market and cryptocurrency forecasting is very important to investors as they aspire to achieve even the slightest improvement to their buy or hold strategies so that they may increase profitability. However, obtaining accurate and reliable predictions is challenging, noting that accuracy does not equate to reliability, especially when financial time-series forecasting is applied owing to its complex and chaotic tendencies. To mitigate this complexity, this study provides a comprehensive method for forecasting financial time series based on tactical input output feature mapping techniques using machine learning (ML) models. During the prediction process, selecting the relevant indicators is vital to obtaining the desired results. In the financial field, limited attention has been paid to this problem with ML solutions. We investigate the use of feature selection with annealing (FSA) for the first time in this field, and we apply",
    "path": "papers/23/03/2303.02223.json",
    "total_tokens": 644,
    "translated_title": "特征选择与退火用于预测金融时间序列",
    "translated_abstract": "股票市场和加密货币的预测对投资者非常重要，因为他们渴望改进购买或持有策略，以增加盈利。本研究提供了一种基于机器学习模型的战略输入输出特征映射技术，用于预测金融时间序列的全面方法，以减少复杂性。",
    "tldr": "本研究首次在金融领域研究了特征选择与退火方法，为预测金融时间序列提供了有效的解决方案。",
    "en_tdlr": "This study investigates the application of feature selection with annealing for the first time in the financial domain, providing an effective solution for forecasting financial time series."
}