{
    "title": "Planning for Manipulation among Movable Objects: Deciding Which Objects Go Where, in What Order, and How. (arXiv:2303.13385v1 [cs.RO])",
    "abstract": "We are interested in pick-and-place style robot manipulation tasks in cluttered and confined 3D workspaces among movable objects that may be rearranged by the robot and may slide, tilt, lean or topple. A recently proposed algorithm, M4M, determines which objects need to be moved and where by solving a Multi-Agent Pathfinding MAPF abstraction of this problem. It then utilises a nonprehensile push planner to compute actions for how the robot might realise these rearrangements and a rigid body physics simulator to check whether the actions satisfy physics constraints encoded in the problem. However, M4M greedily commits to valid pushes found during planning, and does not reason about orderings over pushes if multiple objects need to be rearranged. Furthermore, M4M does not reason about other possible MAPF solutions that lead to different rearrangements and pushes. In this paper, we extend M4M and present Enhanced-M4M (E-M4M) -- a systematic graph search-based solver that searches over ord",
    "link": "http://arxiv.org/abs/2303.13385",
    "context": "Title: Planning for Manipulation among Movable Objects: Deciding Which Objects Go Where, in What Order, and How. (arXiv:2303.13385v1 [cs.RO])\nAbstract: We are interested in pick-and-place style robot manipulation tasks in cluttered and confined 3D workspaces among movable objects that may be rearranged by the robot and may slide, tilt, lean or topple. A recently proposed algorithm, M4M, determines which objects need to be moved and where by solving a Multi-Agent Pathfinding MAPF abstraction of this problem. It then utilises a nonprehensile push planner to compute actions for how the robot might realise these rearrangements and a rigid body physics simulator to check whether the actions satisfy physics constraints encoded in the problem. However, M4M greedily commits to valid pushes found during planning, and does not reason about orderings over pushes if multiple objects need to be rearranged. Furthermore, M4M does not reason about other possible MAPF solutions that lead to different rearrangements and pushes. In this paper, we extend M4M and present Enhanced-M4M (E-M4M) -- a systematic graph search-based solver that searches over ord",
    "path": "papers/23/03/2303.13385.json",
    "total_tokens": 1148,
    "translated_title": "可移动物体操纵规划：如何决定哪些物体被放置在哪里、按什么顺序放置以及如何放置",
    "translated_abstract": "本文研究在充满障碍物且空间狭小的三维工作区域中，机器人如何进行扫描-抓取-搬运风格的物品操纵任务。我们提出了M4M算法来解决这个问题，该算法解决了多智能体路径规划(MAPF)的抽象，确定了需要移动的物体和它们的目的地，并采用非预抓取推式规划器来计算机器人如何实现这些重新排列，并使用一个刚体物理模拟器来检查行动是否符合编码在问题中的物理约束。然而，M4M算法在规划过程中贪心地选择有效的推动操作，并且如果需要重新排列多个物体，则不考虑它们之间的顺序。此外，M4M算法也无法考虑导致不同物品重新排列和推动的其他MAPF解决方案。本文扩展了M4M算法，并提出了Enhanced-M4M (E-M4M)算法，一种基于系统图搜索的求解器，可搜索推动操作的顺序和不同的MAPF解决方案。E-M4M算法能够确定在受约束的空间中排列多个物体的可行推动序列。我们在一组具有随机物体配置的模拟环境数据集上评估了我们的规划器，并显示E-M4M算法在成功率和规划时间方面优于M4M算法。",
    "tldr": "本文扩展了M4M算法并提出了E-M4M算法，在受约束的环境中排列多个物体，并且能够确定可行的推动序列，表现优于M4M算法。",
    "en_tdlr": "This paper proposes an Enhanced-M4M algorithm to plan for manipulation among movable objects in confined spaces, which systematically searches over orderings of push actions and different MAPF solutions. It outperforms the previous M4M algorithm in terms of success rate and planning time."
}