{
    "title": "Sandwiched Video Compression: Efficiently Extending the Reach of Standard Codecs with Neural Wrappers. (arXiv:2303.11473v1 [eess.IV])",
    "abstract": "We propose sandwiched video compression -- a video compression system that wraps neural networks around a standard video codec. The sandwich framework consists of a neural pre- and post-processor with a standard video codec between them. The networks are trained jointly to optimize a rate-distortion loss function with the goal of significantly improving over the standard codec in various compression scenarios. End-to-end training in this setting requires a differentiable proxy for the standard video codec, which incorporates temporal processing with motion compensation, inter/intra mode decisions, and in-loop filtering. We propose differentiable approximations to key video codec components and demonstrate that the neural codes of the sandwich lead to significantly better rate-distortion performance compared to compressing the original frames of the input video in two important scenarios. When transporting high-resolution video via low-resolution HEVC, the sandwich system obtains 6.5 dB",
    "link": "http://arxiv.org/abs/2303.11473",
    "context": "Title: Sandwiched Video Compression: Efficiently Extending the Reach of Standard Codecs with Neural Wrappers. (arXiv:2303.11473v1 [eess.IV])\nAbstract: We propose sandwiched video compression -- a video compression system that wraps neural networks around a standard video codec. The sandwich framework consists of a neural pre- and post-processor with a standard video codec between them. The networks are trained jointly to optimize a rate-distortion loss function with the goal of significantly improving over the standard codec in various compression scenarios. End-to-end training in this setting requires a differentiable proxy for the standard video codec, which incorporates temporal processing with motion compensation, inter/intra mode decisions, and in-loop filtering. We propose differentiable approximations to key video codec components and demonstrate that the neural codes of the sandwich lead to significantly better rate-distortion performance compared to compressing the original frames of the input video in two important scenarios. When transporting high-resolution video via low-resolution HEVC, the sandwich system obtains 6.5 dB",
    "path": "papers/23/03/2303.11473.json",
    "total_tokens": 990,
    "translated_title": "夹心视频压缩：通过神经网络封装来高效扩展标准编解码器的应用",
    "translated_abstract": "我们提出了夹心视频压缩--一种在标准视频编解码器周围包装神经网络的视频压缩系统。该夹心框架由神经前处理器、标准视频编解码器和神经后处理器组成。这些网络被联合训练以优化码率-失真损失函数，旨在在各种压缩场景中显着改善标准编解码器。在这个设置下的端到端训练需要一个可微的标准视频编解码器代理，它包括时间处理、运动补偿、内/间模式决策和循环滤波。我们提出了针对关键视频编解码器组件的可微逼近，并证明了夹心的神经编码相对于在两个重要场景中压缩输入视频的原始帧而言，具有显着更好的码率失真性能。在通过低分辨率HEVC传输高分辨率视频的情况下，夹心系统获得了6.5 dB的PSNR改善；在另一种场景中，压缩大词汇语音识别视频在0.02 bpp的情况下使用夹心系统，获得了30%的单词错误率降低。",
    "tldr": "本文提出了夹心视频压缩方法，通过包装标准编解码器来使神经网络优化压缩性能，在高清视频传输和语音识别视频压缩等场景中表现显著。",
    "en_tdlr": "This article proposes the sandwiched video compression method, which optimizes compression performance by wrapping neural networks around standard codecs, performing significantly better in scenarios such as high-definition video transmission and speech recognition video compression."
}