{
    "title": "Exact Non-Oblivious Performance of Rademacher Random Embeddings. (arXiv:2303.11774v1 [cs.LG])",
    "abstract": "This paper revisits the performance of Rademacher random projections, establishing novel statistical guarantees that are numerically sharp and non-oblivious with respect to the input data. More specifically, the central result is the Schur-concavity property of Rademacher random projections with respect to the inputs. This offers a novel geometric perspective on the performance of random projections, while improving quantitatively on bounds from previous works. As a corollary of this broader result, we obtained the improved performance on data which is sparse or is distributed with small spread. This non-oblivious analysis is a novelty compared to techniques from previous work, and bridges the frequently observed gap between theory and practise. The main result uses an algebraic framework for proving Schur-concavity properties, which is a contribution of independent interest and an elegant alternative to derivative-based criteria.",
    "link": "http://arxiv.org/abs/2303.11774",
    "context": "Title: Exact Non-Oblivious Performance of Rademacher Random Embeddings. (arXiv:2303.11774v1 [cs.LG])\nAbstract: This paper revisits the performance of Rademacher random projections, establishing novel statistical guarantees that are numerically sharp and non-oblivious with respect to the input data. More specifically, the central result is the Schur-concavity property of Rademacher random projections with respect to the inputs. This offers a novel geometric perspective on the performance of random projections, while improving quantitatively on bounds from previous works. As a corollary of this broader result, we obtained the improved performance on data which is sparse or is distributed with small spread. This non-oblivious analysis is a novelty compared to techniques from previous work, and bridges the frequently observed gap between theory and practise. The main result uses an algebraic framework for proving Schur-concavity properties, which is a contribution of independent interest and an elegant alternative to derivative-based criteria.",
    "path": "papers/23/03/2303.11774.json",
    "total_tokens": 903,
    "translated_title": "Rademacher随机嵌入的精确非遗忘性能",
    "translated_abstract": "本文重新审视了Rademacher随机投影的性能，建立了新颖的统计保证，与输入数据相比具有数值上的精度和非遗忘性。具体而言，中心结果是Rademacher随机投影与输入的Schur-凹性质。这提供了随机投影性能的新颖几何视角，同时在比以前的研究更好地提高了量化界限。作为这一更广泛结果的推论，我们在稀疏数据或分布具有小范围的数据上获得了改进的表现。这种非遗忘性分析与以前的技术相比是一种新奇之处，并弥合了理论和实践之间经常观察到的差距。主要结果使用代数框架来证明Schur-凹性质，这是一个独立于兴趣的贡献，并且是导数基础标准的一种优雅的替代方法。",
    "tldr": "本文证实了Rademacher随机投影的非遗忘性能，并建立了Schur-凹性质。这项成果为随机投影的性能提供了新的几何视角，具有更好的量化界限，填补了理论和实践之间的差距。",
    "en_tdlr": "This paper establishes the non-oblivious performance of Rademacher random projections with respect to input data, providing a novel geometric perspective and improving quantitatively on previous works. The main result proves the Schur-concavity property of Rademacher random projections and bridges the gap between theory and practice, with improved performance on sparse or small-spread data."
}