{
    "title": "AIIPot: Adaptive Intelligent-Interaction Honeypot for IoT Devices. (arXiv:2303.12367v1 [cs.CR])",
    "abstract": "The proliferation of the Internet of Things (IoT) has raised concerns about the security of connected devices. There is a need to develop suitable and cost-efficient methods to identify vulnerabilities in IoT devices in order to address them before attackers seize opportunities to compromise them. The deception technique is a prominent approach to improving the security posture of IoT systems. Honeypot is a popular deception technique that mimics interaction in real fashion and encourages unauthorised users (attackers) to launch attacks. Due to the large number and the heterogeneity of IoT devices, manually crafting the low and high-interaction honeypots is not affordable. This has forced researchers to seek innovative ways to build honeypots for IoT devices. In this paper, we propose a honeypot for IoT devices that uses machine learning techniques to learn and interact with attackers automatically. The evaluation of the proposed model indicates that our system can improve the session ",
    "link": "http://arxiv.org/abs/2303.12367",
    "context": "Title: AIIPot: Adaptive Intelligent-Interaction Honeypot for IoT Devices. (arXiv:2303.12367v1 [cs.CR])\nAbstract: The proliferation of the Internet of Things (IoT) has raised concerns about the security of connected devices. There is a need to develop suitable and cost-efficient methods to identify vulnerabilities in IoT devices in order to address them before attackers seize opportunities to compromise them. The deception technique is a prominent approach to improving the security posture of IoT systems. Honeypot is a popular deception technique that mimics interaction in real fashion and encourages unauthorised users (attackers) to launch attacks. Due to the large number and the heterogeneity of IoT devices, manually crafting the low and high-interaction honeypots is not affordable. This has forced researchers to seek innovative ways to build honeypots for IoT devices. In this paper, we propose a honeypot for IoT devices that uses machine learning techniques to learn and interact with attackers automatically. The evaluation of the proposed model indicates that our system can improve the session ",
    "path": "papers/23/03/2303.12367.json",
    "total_tokens": 876,
    "translated_title": "AIIPot: 适应性物联网设备智能交互蜜罐",
    "translated_abstract": "物联网的发展引起了人们对连接设备安全性的担忧。应该开发适合的、经济有效的方法来识别IoT设备的漏洞，以便在攻击者利用它们之前解决这些问题。欺骗技术是改善IoT系统安全性的一种重要方法，其中蜜罐是一种流行的欺骗技术，可以模拟真实交互并鼓励未经授权的用户（攻击者）发动攻击。由于IoT设备的数量和异构性巨大，手动制作低交互和高交互蜜罐是不可承受的。因此，研究人员也要寻求创新的方式来构建IoT设备的蜜罐。在本文中，我们提出了一种适用于IoT设备的蜜罐，它使用机器学习技术来自动学习和自动与攻击者交互。所提出模型的评估表明，我们的系统可以提高会话的以及安全级别。",
    "tldr": "本文提出一种使用机器学习技术的蜜罐，可以自动学习和与攻击者交互，并有效提高物联网设备的安全水平。"
}