{
    "title": "Deep Generative Multi-Agent Imitation Model as a Computational Benchmark for Evaluating Human Performance in Complex Interactive Tasks: A Case Study in Football. (arXiv:2303.13323v1 [stat.ML])",
    "abstract": "Evaluating the performance of human is a common need across many applications, such as in engineering and sports. When evaluating human performance in completing complex and interactive tasks, the most common way is to use a metric having been proved efficient for that context, or to use subjective measurement techniques. However, this can be an error prone and unreliable process since static metrics cannot capture all the complex contexts associated with such tasks and biases exist in subjective measurement. The objective of our research is to create data-driven AI agents as computational benchmarks to evaluate human performance in solving difficult tasks involving multiple humans and contextual factors. We demonstrate this within the context of football performance analysis. We train a generative model based on Conditional Variational Recurrent Neural Network (VRNN) Model on a large player and ball tracking dataset. The trained model is used to imitate the interactions between two te",
    "link": "http://arxiv.org/abs/2303.13323",
    "context": "Title: Deep Generative Multi-Agent Imitation Model as a Computational Benchmark for Evaluating Human Performance in Complex Interactive Tasks: A Case Study in Football. (arXiv:2303.13323v1 [stat.ML])\nAbstract: Evaluating the performance of human is a common need across many applications, such as in engineering and sports. When evaluating human performance in completing complex and interactive tasks, the most common way is to use a metric having been proved efficient for that context, or to use subjective measurement techniques. However, this can be an error prone and unreliable process since static metrics cannot capture all the complex contexts associated with such tasks and biases exist in subjective measurement. The objective of our research is to create data-driven AI agents as computational benchmarks to evaluate human performance in solving difficult tasks involving multiple humans and contextual factors. We demonstrate this within the context of football performance analysis. We train a generative model based on Conditional Variational Recurrent Neural Network (VRNN) Model on a large player and ball tracking dataset. The trained model is used to imitate the interactions between two te",
    "path": "papers/23/03/2303.13323.json",
    "total_tokens": 1122,
    "translated_title": "复杂互动任务中的人类表现评估：一个基于深度生成多智能体模型的计算基准方法案例研究，以足球为例",
    "translated_abstract": "在许多应用中，如工程和体育中，评估人类的表现是常见的需求。评估人类在完成复杂的互动任务中的表现，最常见的方法是使用已被证明在该情境下有效的度量标准，或使用主观测量技术。然而，这可能是一个容易出错和不可靠的过程，因为静态度量标准无法捕捉到与这些任务相关的所有复杂情境，并且主观测量存在偏差。我们的研究的目标是创建基于数据驱动的 AI 智能体，作为计算基准来评估人类在解决涉及多个人类和情境因素的困难任务中的表现。我们在足球表现分析的背景下进行了演示。我们在大型球员和球位置跟踪数据集上训练了基于 Conditional Variational Recurrent Neural Network（VRNN）模型的生成模型。训练后的模型用于模仿两个团队在足球比赛中的交互。我们的结果表明，生成模型能够模拟比赛中逼真的球员移动和团队之间的交互。这个模型可以用作评估人类足球表现的基准，并确定需要提高的领域。",
    "tldr": "该论文使用基于生成模型的 AI 智能体作为计算基准，以评估人类在困难的涉及多个人类和情境因素的任务中的表现及发现有待改进的领域。该论文以足球表现分析为例，使用大型球员和球位置跟踪数据集训练生成模型，并成功进行足球比赛中的交互模仿。",
    "en_tdlr": "This paper proposes creating data-driven AI agents as computational benchmarks to evaluate human performance in completing complex interactive tasks involving multiple humans and contextual factors. Using football performance analysis as a case study, the authors train a generative model and demonstrate its ability to imitate realistic team interactions, providing a benchmark for evaluating and improving human performance."
}