{
    "title": "Strategy-proofness with single-peaked and single-dipped preferences",
    "abstract": "arXiv:2303.05781v2 Announce Type: replace  Abstract: We analyze the problem of locating a public facility in a domain of single-peaked and single-dipped preferences when the social planner knows the type of preference (single-peaked or single-dipped) of each agent. Our main result characterizes all strategy-proof rules and shows that they can be decomposed into two steps. In the first step, the agents with single-peaked preferences are asked about their peaks and, for each profile of reported peaks, at most two alternatives are preselected. In the second step, the agents with single-dipped preferences are asked to reveal their dips to complete the decision between the preselected alternatives. Our result generalizes the findings of Moulin (1980) and Barber\\`a and Jackson (1994) for single-peaked and of Manjunath (2014) for single-dipped preferences. Finally, we show that all strategy-proof rules are also group strategy-proof and analyze the implications of Pareto efficiency.",
    "link": "https://arxiv.org/abs/2303.05781",
    "context": "Title: Strategy-proofness with single-peaked and single-dipped preferences\nAbstract: arXiv:2303.05781v2 Announce Type: replace  Abstract: We analyze the problem of locating a public facility in a domain of single-peaked and single-dipped preferences when the social planner knows the type of preference (single-peaked or single-dipped) of each agent. Our main result characterizes all strategy-proof rules and shows that they can be decomposed into two steps. In the first step, the agents with single-peaked preferences are asked about their peaks and, for each profile of reported peaks, at most two alternatives are preselected. In the second step, the agents with single-dipped preferences are asked to reveal their dips to complete the decision between the preselected alternatives. Our result generalizes the findings of Moulin (1980) and Barber\\`a and Jackson (1994) for single-peaked and of Manjunath (2014) for single-dipped preferences. Finally, we show that all strategy-proof rules are also group strategy-proof and analyze the implications of Pareto efficiency.",
    "path": "papers/23/03/2303.05781.json",
    "total_tokens": 888,
    "translated_title": "具有单峰和单谷偏好的无作弊策略性问题",
    "translated_abstract": "我们分析了在社会规划者了解每个代理人偏好类型（单峰或单谷）的情况下，在具有单峰和单谷偏好的领域中定位公共设施的问题。我们的主要结果刻画了所有无作弊规则，并显示它们可以分解为两个步骤。在第一步中，要求具有单峰偏好的代理人说明其峰值，并针对每个报告的峰值配置，最多预选两个备选方案。在第二步中，要求具有单谷偏好的代理人揭示其谷底，以完成在预选备选方案之间的决策。我们的结果推广了Moulin（1980）和Barber\\`a与Jackson（1994）关于单峰偏好以及Manjunath（2014）关于单谷偏好的研究结果。最后，我们表明所有无作弊规则也是群体无作弊的，并分析了帕累托效率的影响。",
    "tldr": "分析了在单峰和单谷偏好领域中定位公共设施的策略性问题，提出了所有无作弊规则的特征，并展示了它们可以分解为两个步骤。",
    "en_tdlr": "Investigated the strategic problem of locating a public facility in domains of single-peaked and single-dipped preferences, proposed the characteristics of all strategy-proof rules, showing they can be decomposed into two steps."
}