{
    "title": "MWE as WSD: Solving Multiword Expression Identification with Word Sense Disambiguation. (arXiv:2303.06623v2 [cs.CL] UPDATED)",
    "abstract": "Recent approaches to word sense disambiguation (WSD) utilize encodings of the sense gloss (definition), in addition to the input context, to improve performance. In this work we demonstrate that this approach can be adapted for use in multiword expression (MWE) identification by training models which use gloss and context information to filter MWE candidates produced by a rule-based extraction pipeline. Our approach substantially improves precision, outperforming the state-of-the-art in MWE identification on the DiMSUM dataset by up to 1.9 F1 points and achieving competitive results on the PARSEME 1.1 English dataset. Our models also retain most of their WSD performance, showing that a single model can be used for both tasks. Finally, building on similar approaches using Bi-encoders for WSD, we introduce a novel Poly-encoder architecture which improves MWE identification performance.",
    "link": "http://arxiv.org/abs/2303.06623",
    "context": "Title: MWE as WSD: Solving Multiword Expression Identification with Word Sense Disambiguation. (arXiv:2303.06623v2 [cs.CL] UPDATED)\nAbstract: Recent approaches to word sense disambiguation (WSD) utilize encodings of the sense gloss (definition), in addition to the input context, to improve performance. In this work we demonstrate that this approach can be adapted for use in multiword expression (MWE) identification by training models which use gloss and context information to filter MWE candidates produced by a rule-based extraction pipeline. Our approach substantially improves precision, outperforming the state-of-the-art in MWE identification on the DiMSUM dataset by up to 1.9 F1 points and achieving competitive results on the PARSEME 1.1 English dataset. Our models also retain most of their WSD performance, showing that a single model can be used for both tasks. Finally, building on similar approaches using Bi-encoders for WSD, we introduce a novel Poly-encoder architecture which improves MWE identification performance.",
    "path": "papers/23/03/2303.06623.json",
    "total_tokens": 897,
    "translated_title": "MWE作为WSD：用词义消歧解决多词表达式识别问题",
    "translated_abstract": "最近的词义消歧（WSD）方法利用词义的描述（定义）来提高性能，同时使用输入上下文。在本研究中，我们证明这种方法可以用于多词表达式（MWE）的识别，通过训练模型使用描述和上下文信息来过滤基于规则的提取流程产生的MWE候选项。我们的方法显著提高了精确度，在DiMSUM数据集上的MWE识别中超过了现有技术1.9个F1分数，并在PARSEME 1.1英语数据集上实现了竞争结果。我们的模型还保留了大部分WSD性能，表明一个模型可以同时用于两个任务。最后，基于类似于用于WSD的双编码器的方法，我们引入了一种新颖的Poly-encoder架构，提高了MWE识别性能。",
    "tldr": "该论文提出了一种利用词义消歧来解决多词表达式识别问题的方法，并通过训练模型使用词义的描述和上下文信息来过滤候选项，从而显著提高了精确度。研究还引入了一种新的架构，通过双编码器进一步提高了MWE识别性能。",
    "en_tdlr": "This paper presents an approach to solving multiword expression identification using word sense disambiguation, which improves precision by training models to filter candidates with gloss and context information. Additionally, a novel Poly-encoder architecture is introduced to further enhance MWE identification performance."
}