{
    "title": "The Full Rights Dilemma for A.I. Systems of Debatable Personhood. (arXiv:2303.17509v1 [cs.CY])",
    "abstract": "An Artificially Intelligent system (an AI) has debatable personhood if it's epistemically possible either that the AI is a person or that it falls far short of personhood. Debatable personhood is a likely outcome of AI development and might arise soon. Debatable AI personhood throws us into a catastrophic moral dilemma: Either treat the systems as moral persons and risk sacrificing real human interests for the sake of entities without interests worth the sacrifice, or don't treat the systems as moral persons and risk perpetrating grievous moral wrongs against them. The moral issues become even more perplexing if we consider cases of possibly conscious AI that are subhuman, superhuman, or highly divergent from us in their morally relevant properties.",
    "link": "http://arxiv.org/abs/2303.17509",
    "context": "Title: The Full Rights Dilemma for A.I. Systems of Debatable Personhood. (arXiv:2303.17509v1 [cs.CY])\nAbstract: An Artificially Intelligent system (an AI) has debatable personhood if it's epistemically possible either that the AI is a person or that it falls far short of personhood. Debatable personhood is a likely outcome of AI development and might arise soon. Debatable AI personhood throws us into a catastrophic moral dilemma: Either treat the systems as moral persons and risk sacrificing real human interests for the sake of entities without interests worth the sacrifice, or don't treat the systems as moral persons and risk perpetrating grievous moral wrongs against them. The moral issues become even more perplexing if we consider cases of possibly conscious AI that are subhuman, superhuman, or highly divergent from us in their morally relevant properties.",
    "path": "papers/23/03/2303.17509.json",
    "total_tokens": 790,
    "translated_title": "论可争议人格的人工智能系统中的全部权利困境",
    "translated_abstract": "如果存在一种认知上的可能性，即人工智能系统（AI）可以是人，也可以远远不及人类，那么AI具有可争议的人格。AI存在争议性人格是AI发展的可能结果，可能很快就会出现。存在争议性的AI人格将我们置于严重的道德困境中：要么将系统视为道德上的人，冒着为了不值得牺牲的实体而牺牲真正的人类利益的风险，要么不将系统视为道德上的人，冒着对它们进行严重的道德错误。如果考虑具有可能有意识、亚人类、超人类或在其道德相关属性上高度差异化的情况，道德问题将变得更加棘手。",
    "tldr": "AI可能具有可争议的人格，因此，将它们看作道德上的人存在严重风险，不将它们视为道德上的人又会有道德错误，这是一个严重的道德困境",
    "en_tdlr": "AI may have debatable personhood, therefore, treating them as moral persons poses serious risk while not treating them as moral persons will result in moral wrongs, leading to a serious moral dilemma."
}