{
    "title": "A comparison of rational and neural network based approximations. (arXiv:2303.04436v2 [math.OC] UPDATED)",
    "abstract": "Rational and neural network based approximations are efficient tools in modern approximation. These approaches are able to produce accurate approximations to nonsmooth and non-Lipschitz functions, including multivariate domain functions. In this paper we compare the efficiency of function approximation using rational approximation, neural network and their combinations. It was found that rational approximation is superior to neural network based approaches with the same number of decision variables. Our numerical experiments demonstrate the efficiency of rational approximation, even when the number of approximation parameters (that is, the dimension of the corresponding optimisation problems) is small. Another important contribution of this paper lies in the improvement of rational approximation algorithms. Namely, the optimisation based algorithms for rational approximation can be adjusted to in such a way that the conditioning number of the constraint matrices are controlled. This si",
    "link": "http://arxiv.org/abs/2303.04436",
    "context": "Title: A comparison of rational and neural network based approximations. (arXiv:2303.04436v2 [math.OC] UPDATED)\nAbstract: Rational and neural network based approximations are efficient tools in modern approximation. These approaches are able to produce accurate approximations to nonsmooth and non-Lipschitz functions, including multivariate domain functions. In this paper we compare the efficiency of function approximation using rational approximation, neural network and their combinations. It was found that rational approximation is superior to neural network based approaches with the same number of decision variables. Our numerical experiments demonstrate the efficiency of rational approximation, even when the number of approximation parameters (that is, the dimension of the corresponding optimisation problems) is small. Another important contribution of this paper lies in the improvement of rational approximation algorithms. Namely, the optimisation based algorithms for rational approximation can be adjusted to in such a way that the conditioning number of the constraint matrices are controlled. This si",
    "path": "papers/23/03/2303.04436.json",
    "total_tokens": 873,
    "translated_title": "理性和神经网络的近似方法的比较",
    "translated_abstract": "在现代逼近方法中，理性和神经网络的近似方法是高效的工具。这些方法能够对非光滑和非Lipschitz函数，包括多变量域函数，进行精确逼近。本文比较了使用理性逼近、神经网络和它们的组合进行函数逼近的效率。研究结果发现，在相同决策变量数目下，理性逼近优于基于神经网络的方法。我们的数值实验证明了理性逼近的效率，即使逼近参数的数目（即相应优化问题的维数）较小也是如此。本文的另一个重要贡献在于理性逼近算法的改进。也就是说，基于优化的理性逼近算法可以进行调整，以控制约束矩阵的条件数。",
    "tldr": "本文比较了理性和神经网络的近似方法，并发现理性逼近在决策变量数目相同的情况下优于神经网络。数值实验证明了理性逼近的效率，即使逼近参数的数目较小。此外，本文还改进了理性逼近算法，通过调整优化方法来控制约束矩阵的条件数。",
    "en_tdlr": "This paper compares rational and neural network based approximations and finds that rational approximation outperforms neural network approaches with the same number of decision variables. Numerical experiments demonstrate the efficiency of rational approximation, even with a small number of approximation parameters. Additionally, this paper improves rational approximation algorithms by adjusting the optimization method to control the condition number of constraint matrices."
}