{
    "title": "Learning to reason over visual objects. (arXiv:2303.02260v2 [cs.CV] UPDATED)",
    "abstract": "A core component of human intelligence is the ability to identify abstract patterns inherent in complex, high-dimensional perceptual data, as exemplified by visual reasoning tasks such as Raven's Progressive Matrices (RPM). Motivated by the goal of designing AI systems with this capacity, recent work has focused on evaluating whether neural networks can learn to solve RPM-like problems. Previous work has generally found that strong performance on these problems requires the incorporation of inductive biases that are specific to the RPM problem format, raising the question of whether such models might be more broadly useful. Here, we investigated the extent to which a general-purpose mechanism for processing visual scenes in terms of objects might help promote abstract visual reasoning. We found that a simple model, consisting only of an object-centric encoder and a transformer reasoning module, achieved state-of-the-art results on both of two challenging RPM-like benchmarks (PGM and I-",
    "link": "http://arxiv.org/abs/2303.02260",
    "context": "Title: Learning to reason over visual objects. (arXiv:2303.02260v2 [cs.CV] UPDATED)\nAbstract: A core component of human intelligence is the ability to identify abstract patterns inherent in complex, high-dimensional perceptual data, as exemplified by visual reasoning tasks such as Raven's Progressive Matrices (RPM). Motivated by the goal of designing AI systems with this capacity, recent work has focused on evaluating whether neural networks can learn to solve RPM-like problems. Previous work has generally found that strong performance on these problems requires the incorporation of inductive biases that are specific to the RPM problem format, raising the question of whether such models might be more broadly useful. Here, we investigated the extent to which a general-purpose mechanism for processing visual scenes in terms of objects might help promote abstract visual reasoning. We found that a simple model, consisting only of an object-centric encoder and a transformer reasoning module, achieved state-of-the-art results on both of two challenging RPM-like benchmarks (PGM and I-",
    "path": "papers/23/03/2303.02260.json",
    "total_tokens": 866,
    "translated_title": "学习在视觉对象上进行推理",
    "translated_abstract": "人类智能的核心组成部分是能够识别复杂高维感知数据中的抽象模式，例如Raven's Progressive Matrices （RPM）等视觉推理任务。为了设计具备这种能力的人工智能系统，最近的研究集中在评估神经网络是否能够学习解决类似RPM的问题。先前的研究通常发现，在这些问题上表现良好需要将RPM问题格式的归纳偏见纳入模型中，这引发了这样一个问题：这样的模型是否可以更广泛地应用。在本研究中，我们调查了以对象为中心的处理视觉场景的通用机制对促进抽象视觉推理的程度。我们发现，一个简单的模型，仅由一个对象为中心的编码器和一个transformer推理模块组成，在两个具有挑战性的RPM-like基准测试中（PGM和I-）取得了最先进的结果。",
    "tldr": "本研究调查了以对象为中心的处理视觉场景的通用机制对于提升抽象视觉推理的作用，并发现在RPM-like的基准测试中，这样的模型取得了最先进的结果。",
    "en_tdlr": "This study investigated the effectiveness of a general-purpose mechanism for processing visual scenes in terms of objects in promoting abstract visual reasoning. The results showed that a simple model, consisting of an object-centric encoder and a transformer reasoning module, achieved state-of-the-art results on challenging RPM-like benchmarks."
}