{
    "title": "Self-supervised Training Sample Difficulty Balancing for Local Descriptor Learning. (arXiv:2303.06124v1 [cs.CV])",
    "abstract": "In the case of an imbalance between positive and negative samples, hard negative mining strategies have been shown to help models learn more subtle differences between positive and negative samples, thus improving recognition performance. However, if too strict mining strategies are promoted in the dataset, there may be a risk of introducing false negative samples. Meanwhile, the implementation of the mining strategy disrupts the difficulty distribution of samples in the real dataset, which may cause the model to over-fit these difficult samples. Therefore, in this paper, we investigate how to trade off the difficulty of the mined samples in order to obtain and exploit high-quality negative samples, and try to solve the problem in terms of both the loss function and the training strategy. The proposed balance loss provides an effective discriminant for the quality of negative samples by combining a self-supervised approach to the loss function, and uses a dynamic gradient modulation st",
    "link": "http://arxiv.org/abs/2303.06124",
    "raw_ret": "{\n    \"translated_title\": \"自监督训练样本难度平衡的局部描述符学习\",\n    \"translated_abstract\": \"在正负样本不平衡的情况下，硬负样本挖掘策略已被证明有助于模型学习正负样本之间更微妙的差异，从而提高识别性能。然而，如果在数据集中推广过于严格的挖掘策略，可能存在引入假负样本的风险。同时，挖掘策略的实施破坏了真实数据集中样本的难度分布，这可能导致模型过度拟合这些难的样本。因此，本文研究了如何权衡挖掘样本的难度，以获得和利用高质量的负样本，并试图从损失函数和训练策略两方面解决问题。所提出的平衡损失通过将自监督方法与损失函数相结合，提供了负样本质量的有效鉴别，并使用动态梯度调节来实现样本难度的平衡。\",\n    \"tldr\": \"本文提出了一种自监督训练样本难度平衡的局部描述符学习方法，在正负样本不平衡的情况下，通过平衡损失对负样本的质量进行有效的鉴别，并使用动态梯度调节来实现样本难度的平衡。\"\n}",
    "total_tokens": 875,
    "ret": {
        "translated_title": "自监督训练样本难度平衡的局部描述符学习",
        "translated_abstract": "在正负样本不平衡的情况下，硬负样本挖掘策略已被证明有助于模型学习正负样本之间更微妙的差异，从而提高识别性能。然而，如果在数据集中推广过于严格的挖掘策略，可能存在引入假负样本的风险。同时，挖掘策略的实施破坏了真实数据集中样本的难度分布，这可能导致模型过度拟合这些难的样本。因此，本文研究了如何权衡挖掘样本的难度，以获得和利用高质量的负样本，并试图从损失函数和训练策略两方面解决问题。所提出的平衡损失通过将自监督方法与损失函数相结合，提供了负样本质量的有效鉴别，并使用动态梯度调节来实现样本难度的平衡。",
        "tldr": "本文提出了一种自监督训练样本难度平衡的局部描述符学习方法，在正负样本不平衡的情况下，通过平衡损失对负样本的质量进行有效的鉴别，并使用动态梯度调节来实现样本难度的平衡。"
    }
}