{
    "title": "Towards Fair Patient-Trial Matching via Patient-Criterion Level Fairness Constraint. (arXiv:2303.13790v1 [cs.LG])",
    "abstract": "Clinical trials are indispensable in developing new treatments, but they face obstacles in patient recruitment and retention, hindering the enrollment of necessary participants. To tackle these challenges, deep learning frameworks have been created to match patients to trials. These frameworks calculate the similarity between patients and clinical trial eligibility criteria, considering the discrepancy between inclusion and exclusion criteria. Recent studies have shown that these frameworks outperform earlier approaches. However, deep learning models may raise fairness issues in patient-trial matching when certain sensitive groups of individuals are underrepresented in clinical trials, leading to incomplete or inaccurate data and potential harm. To tackle the issue of fairness, this work proposes a fair patient-trial matching framework by generating a patient-criterion level fairness constraint. The proposed framework considers the inconsistency between the embedding of inclusion and e",
    "link": "http://arxiv.org/abs/2303.13790",
    "context": "Title: Towards Fair Patient-Trial Matching via Patient-Criterion Level Fairness Constraint. (arXiv:2303.13790v1 [cs.LG])\nAbstract: Clinical trials are indispensable in developing new treatments, but they face obstacles in patient recruitment and retention, hindering the enrollment of necessary participants. To tackle these challenges, deep learning frameworks have been created to match patients to trials. These frameworks calculate the similarity between patients and clinical trial eligibility criteria, considering the discrepancy between inclusion and exclusion criteria. Recent studies have shown that these frameworks outperform earlier approaches. However, deep learning models may raise fairness issues in patient-trial matching when certain sensitive groups of individuals are underrepresented in clinical trials, leading to incomplete or inaccurate data and potential harm. To tackle the issue of fairness, this work proposes a fair patient-trial matching framework by generating a patient-criterion level fairness constraint. The proposed framework considers the inconsistency between the embedding of inclusion and e",
    "path": "papers/23/03/2303.13790.json",
    "total_tokens": 1018,
    "translated_title": "通过病人准则级别的公平性约束实现公平的病人-试验匹配",
    "translated_abstract": "临床试验在新型治疗方法的开发中不可或缺，但由于招募和留存病人的难度，往往难以招募足够数量的参与者。为了解决这些挑战，已经创建了基于深度学习框架的病人-试验匹配方法。这些框架会计算病人和临床试验的相似度，考虑包含和排除标准之间的差异。近期的研究表明这些框架的性能优于早期的方法。然而，深度学习模型可能会导致病人-试验匹配中的公平性问题，当某些敏感人群在临床试验中被低估时，可能会导致数据不完整或不准确，从而对患者造成潜在危害。针对这个问题，本文提出了一个公平的病人-试验匹配框架，通过生成一个病人准则级别的公平性约束来解决不公平性问题。所提出的框架考虑了包含和排除标准的嵌入差异，基于嵌入差异制定了公平性约束。该框架的有效性在一个真实的临床试验数据集上得到了验证。",
    "tldr": "本文提出了一个公平的病人-试验匹配框架，通过生成病人准则级别的公平性约束，考虑了包含和排除标准的嵌入差异，有效地解决了病人-试验匹配中的不公平性问题。",
    "en_tdlr": "This paper proposes a fair patient-trial matching framework by generating patient-criterion level fairness constraint, which considers the embedding difference between inclusion and exclusion criteria, effectively solving the fairness issue in patient-trial matching."
}