{
    "title": "Rule-based Out-Of-Distribution Detection. (arXiv:2303.01860v3 [cs.AI] UPDATED)",
    "abstract": "Out-of-distribution detection is one of the most critical issue in the deployment of machine learning. The data analyst must assure that data in operation should be compliant with the training phase as well as understand if the environment has changed in a way that autonomous decisions would not be safe anymore. The method of the paper is based on eXplainable Artificial Intelligence (XAI); it takes into account different metrics to identify any resemblance between in-distribution and out of, as seen by the XAI model. The approach is non-parametric and distributional assumption free. The validation over complex scenarios (predictive maintenance, vehicle platooning, covert channels in cybersecurity) corroborates both precision in detection and evaluation of training-operation conditions proximity. Results are available via open source and open data at the following link: https://github.com/giacomo97cnr/Rule-based-ODD.",
    "link": "http://arxiv.org/abs/2303.01860",
    "context": "Title: Rule-based Out-Of-Distribution Detection. (arXiv:2303.01860v3 [cs.AI] UPDATED)\nAbstract: Out-of-distribution detection is one of the most critical issue in the deployment of machine learning. The data analyst must assure that data in operation should be compliant with the training phase as well as understand if the environment has changed in a way that autonomous decisions would not be safe anymore. The method of the paper is based on eXplainable Artificial Intelligence (XAI); it takes into account different metrics to identify any resemblance between in-distribution and out of, as seen by the XAI model. The approach is non-parametric and distributional assumption free. The validation over complex scenarios (predictive maintenance, vehicle platooning, covert channels in cybersecurity) corroborates both precision in detection and evaluation of training-operation conditions proximity. Results are available via open source and open data at the following link: https://github.com/giacomo97cnr/Rule-based-ODD.",
    "path": "papers/23/03/2303.01860.json",
    "total_tokens": 840,
    "translated_title": "基于规则的OoD检测",
    "translated_abstract": "检测数据集中是否存在OoD是部署机器学习的最关键问题之一。本文采用XAI解释性人工智能方法，通过考虑不同的指标鉴别出in-distribution和out of-distribution之间的相似性。该方法是非参数统计模型，不需要分布假设。在复杂应用场景下（如预测性维护、车队管制、网络安全追踪等）的验证显示了该方法在检测准确度和评估训练和操作条件的接近程度方面的优良性能。结果可在以下链接中的github上获得: https://github.com/giacomo97cnr/Rule-based-ODD。",
    "tldr": "本文提出了一种基于XAI的方法，通过不同指标鉴别in-distribution和out of-distribution之间的相似性，从而实现非参数统计模型的OoD检测。该方法在多个复杂场景下表现出良好的检测准确度和评估训练和操作条件的接近程度。",
    "en_tdlr": "This paper proposes a rule-based Out-of-Distribution (OoD) detection method based on eXplainable Artificial Intelligence (XAI), which identifies the similarity between in-distribution and out-of-distribution through different metrics. The non-parametric and distributional assumption-free approach shows good performance in detecting OoD in various complex scenarios and evaluating the proximity of training-operation conditions. The results are available via open source and open data on Github."
}