{
    "title": "Laplacian Segmentation Networks: Improved Epistemic Uncertainty from Spatial Aleatoric Uncertainty. (arXiv:2303.13123v1 [cs.CV])",
    "abstract": "Out of distribution (OOD) medical images are frequently encountered, e.g. because of site- or scanner differences, or image corruption. OOD images come with a risk of incorrect image segmentation, potentially negatively affecting downstream diagnoses or treatment. To ensure robustness to such incorrect segmentations, we propose Laplacian Segmentation Networks (LSN) that jointly model epistemic (model) and aleatoric (data) uncertainty in image segmentation. We capture data uncertainty with a spatially correlated logit distribution. For model uncertainty, we propose the first Laplace approximation of the weight posterior that scales to large neural networks with skip connections that have high-dimensional outputs. Empirically, we demonstrate that modelling spatial pixel correlation allows the Laplacian Segmentation Network to successfully assign high epistemic uncertainty to out-of-distribution objects appearing within images.",
    "link": "http://arxiv.org/abs/2303.13123",
    "context": "Title: Laplacian Segmentation Networks: Improved Epistemic Uncertainty from Spatial Aleatoric Uncertainty. (arXiv:2303.13123v1 [cs.CV])\nAbstract: Out of distribution (OOD) medical images are frequently encountered, e.g. because of site- or scanner differences, or image corruption. OOD images come with a risk of incorrect image segmentation, potentially negatively affecting downstream diagnoses or treatment. To ensure robustness to such incorrect segmentations, we propose Laplacian Segmentation Networks (LSN) that jointly model epistemic (model) and aleatoric (data) uncertainty in image segmentation. We capture data uncertainty with a spatially correlated logit distribution. For model uncertainty, we propose the first Laplace approximation of the weight posterior that scales to large neural networks with skip connections that have high-dimensional outputs. Empirically, we demonstrate that modelling spatial pixel correlation allows the Laplacian Segmentation Network to successfully assign high epistemic uncertainty to out-of-distribution objects appearing within images.",
    "path": "papers/23/03/2303.13123.json",
    "total_tokens": 848,
    "translated_title": "拉普拉斯分割网络: 从空间数据不确定性到改进的认知不确定性",
    "translated_abstract": "媒体图像常常会出现非正常的情况，例如因为位置或扫描器的不同或图像损坏等原因而经常出现，这种媒体图像可能会对下游临床诊断或治疗产生影响。为了确保对这种错误分割的鲁棒性，我们提出了拉普拉斯分割网络（LSN），其能够共同建模图像分割中的认知（模型）不确定性和空间数据（随机）不确定性。我们使用具有空间相关性的logit分布捕获数据的不确定性。对于模型不确定性，我们提出了针对高维输出和具有跳过连接的大型神经网络的第一个拉普拉斯权重后验的逼近。从实证上，我们证明了建模空间像素相关性使得拉普拉斯分割网络能够将高认知不确定性成功分配到图像中的OOF目标。",
    "tldr": "所提出的拉普拉斯分割网络可同时捕获图像分割中的认知和随机不确定性，成功将高认知不确定性分配到OOF目标中。",
    "en_tdlr": "The proposed Laplacian Segmentation Network can simultaneously capture epistemic and aleatoric uncertainty in image segmentation, and successfully assign high epistemic uncertainty to OOF objects in images by modeling spatial pixel correlation."
}