{
    "title": "SEAL: Semantic Frame Execution And Localization for Perceiving Afforded Robot Actions. (arXiv:2303.14067v1 [cs.RO])",
    "abstract": "Recent advances in robotic mobile manipulation have spurred the expansion of the operating environment for robots from constrained workspaces to large-scale, human environments. In order to effectively complete tasks in these spaces, robots must be able to perceive, reason, and execute over a diversity of affordances, well beyond simple pick-and-place. We posit the notion of semantic frames provides a compelling representation for robot actions that is amenable to action-focused perception, task-level reasoning, action-level execution, and integration with language. Semantic frames, a product of the linguistics community, define the necessary elements, pre- and post- conditions, and a set of sequential robot actions necessary to successfully execute an action evoked by a verb phrase. In this work, we extend the semantic frame representation for robot manipulation actions and introduce the problem of Semantic Frame Execution And Localization for Perceiving Afforded Robot Actions (SEAL) ",
    "link": "http://arxiv.org/abs/2303.14067",
    "context": "Title: SEAL: Semantic Frame Execution And Localization for Perceiving Afforded Robot Actions. (arXiv:2303.14067v1 [cs.RO])\nAbstract: Recent advances in robotic mobile manipulation have spurred the expansion of the operating environment for robots from constrained workspaces to large-scale, human environments. In order to effectively complete tasks in these spaces, robots must be able to perceive, reason, and execute over a diversity of affordances, well beyond simple pick-and-place. We posit the notion of semantic frames provides a compelling representation for robot actions that is amenable to action-focused perception, task-level reasoning, action-level execution, and integration with language. Semantic frames, a product of the linguistics community, define the necessary elements, pre- and post- conditions, and a set of sequential robot actions necessary to successfully execute an action evoked by a verb phrase. In this work, we extend the semantic frame representation for robot manipulation actions and introduce the problem of Semantic Frame Execution And Localization for Perceiving Afforded Robot Actions (SEAL) ",
    "path": "papers/23/03/2303.14067.json",
    "total_tokens": 755,
    "translated_title": "SEAL: 用于理解机器人行为的语义框架执行和本地化",
    "translated_abstract": "机器人移动操作的最新进展已经促进了机器人的操作环境从受限的工作空间扩展到大规模的人类环境。为了有效地完成这些空间中的任务，机器人必须能够感知、推理和执行各种可行性，远远超出了简单的拾取和放置。我们提出了语义框架的概念，为机器人行为提供了一种有利于行动感知、任务级别推理、行动级别执行和语言集成的表征。本文扩展了机器人操作行为的语义框架表示，并引入了语义框架执行和本地化问题。",
    "tldr": "本文提出了语义框架的概念，并给出了用于机器人操作行为的扩展表示，解决了语义框架执行和本地化问题。",
    "en_tdlr": "This paper proposes the concept of semantic frames and presents an extended representation for robot manipulation actions, addressing the problem of Semantic Frame Execution and Localization for Perceiving Afforded Robot Actions (SEAL)."
}