{
    "title": "Quantized Radio Map Estimation Using Tensor and Deep Generative Models. (arXiv:2303.01770v2 [eess.SP] UPDATED)",
    "abstract": "Spectrum cartography (SC), also known as radio map estimation (RME), aims at crafting multi-domain (e.g., frequency and space) radio power propagation maps from limited sensor measurements. While early methods often lacked theoretical support, recent works have demonstrated that radio maps can be provably recovered using low-dimensional models -- such as the block-term tensor decomposition (BTD) model and certain deep generative models (DGMs) -- of the high-dimensional multi-domain radio signals. However, these existing provable SC approaches assume that sensors send real-valued (full-resolution) measurements to the fusion center, which is unrealistic. This work puts forth a quantized SC framework that generalizes the BTD and DGM-based SC to scenarios where heavily quantized sensor measurements are used. A maximum likelihood estimation (MLE)-based SC framework under a Gaussian quantizer is proposed. Recoverability of the radio map using the MLE criterion are characterized under realist",
    "link": "http://arxiv.org/abs/2303.01770",
    "context": "Title: Quantized Radio Map Estimation Using Tensor and Deep Generative Models. (arXiv:2303.01770v2 [eess.SP] UPDATED)\nAbstract: Spectrum cartography (SC), also known as radio map estimation (RME), aims at crafting multi-domain (e.g., frequency and space) radio power propagation maps from limited sensor measurements. While early methods often lacked theoretical support, recent works have demonstrated that radio maps can be provably recovered using low-dimensional models -- such as the block-term tensor decomposition (BTD) model and certain deep generative models (DGMs) -- of the high-dimensional multi-domain radio signals. However, these existing provable SC approaches assume that sensors send real-valued (full-resolution) measurements to the fusion center, which is unrealistic. This work puts forth a quantized SC framework that generalizes the BTD and DGM-based SC to scenarios where heavily quantized sensor measurements are used. A maximum likelihood estimation (MLE)-based SC framework under a Gaussian quantizer is proposed. Recoverability of the radio map using the MLE criterion are characterized under realist",
    "path": "papers/23/03/2303.01770.json",
    "total_tokens": 889,
    "translated_title": "使用张量和深度生成模型的量化无线电图估计",
    "translated_abstract": "频谱制图（SC），也称为无线电图估计（RME），旨在从有限的传感器测量数据中制作多领域（例如频率和空间）无线电功率传播图。最近的研究表明，使用低维模型（如块状张量分解（BTD）模型和某些深度生成模型（DGM）），可以通过理论保证恢复无线电地图。然而，这些现有的可证明SC方法假设传感器将实值（全分辨率）测量值发送至融合中心，这是不现实的。本文提出了一个量化SC框架，将基于BTD和基于DGM的SC推广到使用高度量化的传感器测量值的情况。提出了一个基于最大似然估计（MLE）的SC框架，在高斯量化器的作用下对无线电地图的可恢复性进行了刻画。",
    "tldr": "本文提出了一个量化无线电图估计的框架，利用张量和深度生成模型的方法，扩展了现有的无线电图估计方法，并提出了一种基于最大似然估计的框架来实现从高度量化的传感器测量值中恢复无线电地图。",
    "en_tdlr": "This paper presents a quantized radio map estimation framework, extending existing approaches using tensor and deep generative models, and proposes a maximum likelihood estimation framework to recover the radio map from heavily quantized sensor measurements."
}