{
    "title": "Adaptive Voronoi NeRFs. (arXiv:2303.16001v1 [cs.CV])",
    "abstract": "Neural Radiance Fields (NeRFs) learn to represent a 3D scene from just a set of registered images. Increasing sizes of a scene demands more complex functions, typically represented by neural networks, to capture all details. Training and inference then involves querying the neural network millions of times per image, which becomes impractically slow. Since such complex functions can be replaced by multiple simpler functions to improve speed, we show that a hierarchy of Voronoi diagrams is a suitable choice to partition the scene. By equipping each Voronoi cell with its own NeRF, our approach is able to quickly learn a scene representation. We propose an intuitive partitioning of the space that increases quality gains during training by distributing information evenly among the networks and avoids artifacts through a top-down adaptive refinement. Our framework is agnostic to the underlying NeRF method and easy to implement, which allows it to be applied to various NeRF variants for impr",
    "link": "http://arxiv.org/abs/2303.16001",
    "context": "Title: Adaptive Voronoi NeRFs. (arXiv:2303.16001v1 [cs.CV])\nAbstract: Neural Radiance Fields (NeRFs) learn to represent a 3D scene from just a set of registered images. Increasing sizes of a scene demands more complex functions, typically represented by neural networks, to capture all details. Training and inference then involves querying the neural network millions of times per image, which becomes impractically slow. Since such complex functions can be replaced by multiple simpler functions to improve speed, we show that a hierarchy of Voronoi diagrams is a suitable choice to partition the scene. By equipping each Voronoi cell with its own NeRF, our approach is able to quickly learn a scene representation. We propose an intuitive partitioning of the space that increases quality gains during training by distributing information evenly among the networks and avoids artifacts through a top-down adaptive refinement. Our framework is agnostic to the underlying NeRF method and easy to implement, which allows it to be applied to various NeRF variants for impr",
    "path": "papers/23/03/2303.16001.json",
    "total_tokens": 924,
    "translated_abstract": "神经辐射场 (NeRFs) 能够仅从一组已注册的图像中学习表示 3D 场景。随着场景规模增大，通常需要用神经网络来表示更复杂的函数以捕捉所有细节。训练和推理涉及每个图像数百万次的神经网络查询，这变得非常缓慢。我们展示了一种适合于分区场景的 Voronoi 图层次结构，用多个较简单的函数取代这些更复杂的函数以提高速度。通过为每个 Voronoi 单元格配备自己的 NeRF，我们的方法能够快速学习场景表示。我们提出的空间划分方式通过在网络之间均匀分配信息和通过自上而下的自适应细化来避免伪影，并在训练过程中提高质量增益。我们的框架对基础的 NeRF 方法不敏感，并且易于实现，这使其能够适用于各种 NeRF 变体，从而提高了其实际应用性能。",
    "tldr": "本文提出了一种自适应 Voronoi NeRFs 方法，用于快速学习表示 3D 场景，通过为每个 Voronoi 单元格配备自己的 NeRF，避免了查询神经网络过于复杂而过慢的问题。",
    "en_tdlr": "This paper proposes an adaptive Voronoi NeRFs approach to quickly learning and representing 3D scenes, which replaces complex functions with multiple simpler ones by equipping each Voronoi cell with its own NeRF to avoid slow queries on the neural network, achieving quality gains through an intuitive partitioning of space and a top-down adaptive refinement."
}