{
    "title": "Differentially Private Synthetic Control. (arXiv:2303.14084v1 [cs.LG])",
    "abstract": "Synthetic control is a causal inference tool used to estimate the treatment effects of an intervention by creating synthetic counterfactual data. This approach combines measurements from other similar observations (i.e., donor pool ) to predict a counterfactual time series of interest (i.e., target unit) by analyzing the relationship between the target and the donor pool before the intervention. As synthetic control tools are increasingly applied to sensitive or proprietary data, formal privacy protections are often required. In this work, we provide the first algorithms for differentially private synthetic control with explicit error bounds. Our approach builds upon tools from non-private synthetic control and differentially private empirical risk minimization. We provide upper and lower bounds on the sensitivity of the synthetic control query and provide explicit error bounds on the accuracy of our private synthetic control algorithms. We show that our algorithms produce accurate pre",
    "link": "http://arxiv.org/abs/2303.14084",
    "context": "Title: Differentially Private Synthetic Control. (arXiv:2303.14084v1 [cs.LG])\nAbstract: Synthetic control is a causal inference tool used to estimate the treatment effects of an intervention by creating synthetic counterfactual data. This approach combines measurements from other similar observations (i.e., donor pool ) to predict a counterfactual time series of interest (i.e., target unit) by analyzing the relationship between the target and the donor pool before the intervention. As synthetic control tools are increasingly applied to sensitive or proprietary data, formal privacy protections are often required. In this work, we provide the first algorithms for differentially private synthetic control with explicit error bounds. Our approach builds upon tools from non-private synthetic control and differentially private empirical risk minimization. We provide upper and lower bounds on the sensitivity of the synthetic control query and provide explicit error bounds on the accuracy of our private synthetic control algorithms. We show that our algorithms produce accurate pre",
    "path": "papers/23/03/2303.14084.json",
    "total_tokens": 814,
    "translated_title": "差分隐私合成控制",
    "translated_abstract": "合成控制是一种因果推断工具，用于通过创建合成对照数据来估计干预的治疗效果。这种方法结合了来自其他相似观察（即，捐赠者池）的测量结果，通过分析干预前目标和捐赠者池之间的关系来预测感兴趣的反事实时间序列（即，目标单元）。随着合成控制工具被越来越应用于敏感或专有数据，形式化的隐私保护通常是必需的。在这项工作中，我们提供了首个具有显式误差界限的差分隐私合成控制算法。我们的方法基于非私有合成控制和差分隐私经验风险最小化的工具。我们提供关于合成控制查询敏感性的上下界，并提供有关我们的私有合成控制算法准确性的显式误差界限。我们展示了我们的算法产生准确的预测结果。",
    "tldr": "本文提供了首个具有显式误差界限的差分隐私合成控制算法，具有广泛的应用前景。",
    "en_tdlr": "This paper provides the first differentially private synthetic control algorithms with explicit error bounds, which have broad application prospects."
}