{
    "title": "TSI-GAN: Unsupervised Time Series Anomaly Detection using Convolutional Cycle-Consistent Generative Adversarial Networks. (arXiv:2303.12952v1 [cs.LG])",
    "abstract": "Anomaly detection is widely used in network intrusion detection, autonomous driving, medical diagnosis, credit card frauds, etc. However, several key challenges remain open, such as lack of ground truth labels, presence of complex temporal patterns, and generalizing over different datasets. This paper proposes TSI-GAN, an unsupervised anomaly detection model for time-series that can learn complex temporal patterns automatically and generalize well, i.e., no need for choosing dataset-specific parameters, making statistical assumptions about underlying data, or changing model architectures. To achieve these goals, we convert each input time-series into a sequence of 2D images using two encoding techniques with the intent of capturing temporal patterns and various types of deviance. Moreover, we design a reconstructive GAN that uses convolutional layers in an encoder-decoder network and employs cycle-consistency loss during training to ensure that inverse mappings are accurate as well. In",
    "link": "http://arxiv.org/abs/2303.12952",
    "context": "Title: TSI-GAN: Unsupervised Time Series Anomaly Detection using Convolutional Cycle-Consistent Generative Adversarial Networks. (arXiv:2303.12952v1 [cs.LG])\nAbstract: Anomaly detection is widely used in network intrusion detection, autonomous driving, medical diagnosis, credit card frauds, etc. However, several key challenges remain open, such as lack of ground truth labels, presence of complex temporal patterns, and generalizing over different datasets. This paper proposes TSI-GAN, an unsupervised anomaly detection model for time-series that can learn complex temporal patterns automatically and generalize well, i.e., no need for choosing dataset-specific parameters, making statistical assumptions about underlying data, or changing model architectures. To achieve these goals, we convert each input time-series into a sequence of 2D images using two encoding techniques with the intent of capturing temporal patterns and various types of deviance. Moreover, we design a reconstructive GAN that uses convolutional layers in an encoder-decoder network and employs cycle-consistency loss during training to ensure that inverse mappings are accurate as well. In",
    "path": "papers/23/03/2303.12952.json",
    "total_tokens": 756,
    "translated_title": "TSI-GAN: 使用卷积循环一致生成对抗网络的无监督时间序列异常检测",
    "translated_abstract": "异常检测广泛应用于网络入侵检测、自动驾驶、医学诊断、信用卡欺诈等。然而，仍存在一些关键挑战，例如缺乏真实标签、存在复杂的时间模式和在不同数据集上进行泛化。本文提出了TSI-GAN，这是一种用于时间序列的无监督异常检测模型，可以自动学习复杂的时间模式并且具有很好的泛化性能，即不需要选择特定于数据集的参数、对底层数据做出统计假设或更改模型架构。",
    "tldr": "TSI-GAN是一种无监督时间序列异常检测模型，它可以自动学习时间序列中的复杂模式，并具有良好的泛化性能。",
    "en_tdlr": "TSI-GAN is an unsupervised time series anomaly detection model that can automatically learn complex temporal patterns and has good generalization performance."
}