{
    "title": "Machine Learning Computer Vision Applications for Spatial AI Object Recognition in Orange County, California. (arXiv:2303.07560v1 [cs.CV])",
    "abstract": "We provide an integrated and systematic automation approach to spatial object recognition and positional detection using AI machine learning and computer vision algorithms for Orange County, California. We describe a comprehensive methodology for multi-sensor, high-resolution field data acquisition, along with post-field processing and pre-analysis processing tasks. We developed a series of algorithmic formulations and workflows that integrate convolutional deep neural network learning with detected object positioning estimation in 360{\\deg} equirectancular photosphere imagery. We provide examples of application processing more than 800 thousand cardinal directions in photosphere images across two areas in Orange County, and present detection results for stop-sign and fire hydrant object recognition. We discuss the efficiency and effectiveness of our approach, along with broader inferences related to the performance and implications of this approach for future technological innovations",
    "link": "http://arxiv.org/abs/2303.07560",
    "context": "Title: Machine Learning Computer Vision Applications for Spatial AI Object Recognition in Orange County, California. (arXiv:2303.07560v1 [cs.CV])\nAbstract: We provide an integrated and systematic automation approach to spatial object recognition and positional detection using AI machine learning and computer vision algorithms for Orange County, California. We describe a comprehensive methodology for multi-sensor, high-resolution field data acquisition, along with post-field processing and pre-analysis processing tasks. We developed a series of algorithmic formulations and workflows that integrate convolutional deep neural network learning with detected object positioning estimation in 360{\\deg} equirectancular photosphere imagery. We provide examples of application processing more than 800 thousand cardinal directions in photosphere images across two areas in Orange County, and present detection results for stop-sign and fire hydrant object recognition. We discuss the efficiency and effectiveness of our approach, along with broader inferences related to the performance and implications of this approach for future technological innovations",
    "path": "papers/23/03/2303.07560.json",
    "total_tokens": 829,
    "translated_title": "机器学习计算机视觉在加州橙县空间AI物体识别中的应用",
    "translated_abstract": "我们提供了一种集成的系统化方法，利用人工智能机器学习和计算机视觉算法实现橙县空间物体识别和位置检测。我们描述了一种多传感器、高分辨率野外数据获取的全面方法，以及野外后处理和预分析处理任务。我们开发了一系列算法公式和工作流程，将卷积深度神经网络学习与360{\\deg}全景图像中检测的物体位置估计相结合。我们提供了在橙县的两个区域的照片球图像中处理超过 80 万个方位角的应用实例，并展示了停车标志和消防栓识别的检测结果。我们讨论了我们方法的效率和有效性，以及与此方法相关的更广泛的性能和未来技术创新的影响。",
    "tldr": "本论文介绍了一种利用机器学习和计算机视觉算法进行空间物体识别和位置检测的方法，并在加州橙县实现了这一方法，并成功地进行了对停车标志和消防栓的识别。",
    "en_tdlr": "This paper presents a method for spatial object recognition and positional detection using machine learning and computer vision algorithms, and successfully applies it in Orange County, California, achieving the recognition of stop-signs and fire hydrants."
}