{
    "title": "Predicting Density of States via Multi-modal Transformer. (arXiv:2303.07000v2 [cs.LG] UPDATED)",
    "abstract": "The density of states (DOS) is a spectral property of materials, which provides fundamental insights on various characteristics of materials. In this paper, we propose a model to predict the DOS by reflecting the nature of DOS: DOS determines the general distribution of states as a function of energy. Specifically, we integrate the heterogeneous information obtained from the crystal structure and the energies via multi-modal transformer, thereby modeling the complex relationships between the atoms in the crystal structure, and various energy levels. Extensive experiments on two types of DOS, i.e., Phonon DOS and Electron DOS, with various real-world scenarios demonstrate the superiority of DOSTransformer. The source code for DOSTransformer is available at https://github.com/HeewoongNoh/DOSTransformer.",
    "link": "http://arxiv.org/abs/2303.07000",
    "context": "Title: Predicting Density of States via Multi-modal Transformer. (arXiv:2303.07000v2 [cs.LG] UPDATED)\nAbstract: The density of states (DOS) is a spectral property of materials, which provides fundamental insights on various characteristics of materials. In this paper, we propose a model to predict the DOS by reflecting the nature of DOS: DOS determines the general distribution of states as a function of energy. Specifically, we integrate the heterogeneous information obtained from the crystal structure and the energies via multi-modal transformer, thereby modeling the complex relationships between the atoms in the crystal structure, and various energy levels. Extensive experiments on two types of DOS, i.e., Phonon DOS and Electron DOS, with various real-world scenarios demonstrate the superiority of DOSTransformer. The source code for DOSTransformer is available at https://github.com/HeewoongNoh/DOSTransformer.",
    "path": "papers/23/03/2303.07000.json",
    "total_tokens": 741,
    "translated_title": "多模态Transformer预测态密度",
    "translated_abstract": "状态密度（DOS）是材料的谱学特性，它提供了关于材料各种特性的基本见解。本文提出了一种模型来预测DOS，通过反映DOS的性质：DOS确定作为能量函数的状态的一般分布。具体地，我们通过多模态Transformer集成晶体结构和能量获得的异构信息，从而模拟晶体结构中原子之间的复杂关系和各种能级。通过各种真实情况下的两种DOS（即声子DOS和电子DOS）的广泛实验显示了DOSTransformer的优越性。DOSTransformer的源代码可在https://github.com/HeewoongNoh/DOSTransformer上获得。",
    "tldr": "本文基于多模态Transformer，从晶体结构和能量入手预测DOS，可应用于声子和电子DOS。",
    "en_tdlr": "This paper proposes a model, DOSTransformer, to predict density of states (DOS) by integrating heterogeneous information obtained from crystal structure and energy via multi-modal transformer. The model is validated with extensive experiments on two types of DOS, Phonon DOS and Electron DOS, showing its superiority."
}