{
    "title": "Neuro-symbolic Commonsense Social Reasoning. (arXiv:2303.08264v1 [cs.AI])",
    "abstract": "Social norms underlie all human social interactions, yet formalizing and reasoning with them remains a major challenge for AI systems. We present a novel system for taking social rules of thumb (ROTs) in natural language from the Social Chemistry 101 dataset and converting them to first-order logic where reasoning is performed using a neuro-symbolic theorem prover. We accomplish this in several steps. First, ROTs are converted into Abstract Meaning Representation (AMR), which is a graphical representation of the concepts in a sentence, and align the AMR with RoBERTa embeddings. We then generate alternate simplified versions of the AMR via a novel algorithm, recombining and merging embeddings for added robustness against different wordings of text, and incorrect AMR parses. The AMR is then converted into first-order logic, and is queried with a neuro-symbolic theorem prover. The goal of this paper is to develop and evaluate a neuro-symbolic method which performs explicit reasoning about",
    "link": "http://arxiv.org/abs/2303.08264",
    "context": "Title: Neuro-symbolic Commonsense Social Reasoning. (arXiv:2303.08264v1 [cs.AI])\nAbstract: Social norms underlie all human social interactions, yet formalizing and reasoning with them remains a major challenge for AI systems. We present a novel system for taking social rules of thumb (ROTs) in natural language from the Social Chemistry 101 dataset and converting them to first-order logic where reasoning is performed using a neuro-symbolic theorem prover. We accomplish this in several steps. First, ROTs are converted into Abstract Meaning Representation (AMR), which is a graphical representation of the concepts in a sentence, and align the AMR with RoBERTa embeddings. We then generate alternate simplified versions of the AMR via a novel algorithm, recombining and merging embeddings for added robustness against different wordings of text, and incorrect AMR parses. The AMR is then converted into first-order logic, and is queried with a neuro-symbolic theorem prover. The goal of this paper is to develop and evaluate a neuro-symbolic method which performs explicit reasoning about",
    "path": "papers/23/03/2303.08264.json",
    "total_tokens": 992,
    "translated_title": "神经符号常识社会推理",
    "translated_abstract": "社会规范是所有人类社交互动的基础，但将其形式化并进行推理仍然是人工智能系统面临的主要挑战。本文提出了一个新颖的系统，从Social Chemistry 101数据集中以自然语言的形式获取社交规则，并将它们转换为一阶逻辑，使用神经符号定理证明器进行推理。我们通过几个步骤实现了这一目标。首先，将社交规则转换为抽象意义表示(AMR)，即一句话中概念的图形表示，并与RoBERTa嵌入对齐。然后，通过一种新颖的算法生成AMR的备用简化版本，重新组合和合并嵌入以增强对文本不同措辞和不正确的AMR解析的鲁棒性。然后将AMR转换为一阶逻辑，并使用神经符号定理证明器进行查询。本文旨在开发和评估一种神经符号方法，对自然语言中的常识规则进行明确的推理。我们的方法弥合了符号和神经方法在人工智能领域的差距，在一组社交常识问题上展现了有希望的结果。",
    "tldr": "本文介绍了一种神经符号方法，将自然语言中的社交规则转换为一阶逻辑，并使用神经符号定理证明器进行推理。该方法展现了有希望的结果，可以用来进行对社交常识问题的明确推理。",
    "en_tdlr": "This paper presents a neuro-symbolic approach to convert social rules of thumb in natural language to first-order logic and perform reasoning using a neuro-symbolic theorem prover. The method shows promising results and can be used for explicit reasoning of social commonsense problems."
}