{
    "title": "Federated Learning for Metaverse: A Survey. (arXiv:2303.17987v1 [cs.CR])",
    "abstract": "The metaverse, which is at the stage of innovation and exploration, faces the dilemma of data collection and the problem of private data leakage in the process of development. This can seriously hinder the widespread deployment of the metaverse. Fortunately, federated learning (FL) is a solution to the above problems. FL is a distributed machine learning paradigm with privacy-preserving features designed for a large number of edge devices. Federated learning for metaverse (FL4M) will be a powerful tool. Because FL allows edge devices to participate in training tasks locally using their own data, computational power, and model-building capabilities. Applying FL to the metaverse not only protects the data privacy of participants but also reduces the need for high computing power and high memory on servers. Until now, there have been many studies about FL and the metaverse, respectively. In this paper, we review some of the early advances of FL4M, which will be a research direction with u",
    "link": "http://arxiv.org/abs/2303.17987",
    "context": "Title: Federated Learning for Metaverse: A Survey. (arXiv:2303.17987v1 [cs.CR])\nAbstract: The metaverse, which is at the stage of innovation and exploration, faces the dilemma of data collection and the problem of private data leakage in the process of development. This can seriously hinder the widespread deployment of the metaverse. Fortunately, federated learning (FL) is a solution to the above problems. FL is a distributed machine learning paradigm with privacy-preserving features designed for a large number of edge devices. Federated learning for metaverse (FL4M) will be a powerful tool. Because FL allows edge devices to participate in training tasks locally using their own data, computational power, and model-building capabilities. Applying FL to the metaverse not only protects the data privacy of participants but also reduces the need for high computing power and high memory on servers. Until now, there have been many studies about FL and the metaverse, respectively. In this paper, we review some of the early advances of FL4M, which will be a research direction with u",
    "path": "papers/23/03/2303.17987.json",
    "total_tokens": 756,
    "translated_title": "面向元宇宙的联邦学习：综述",
    "translated_abstract": "在元宇宙发展的过程中，数据采集和私人数据泄漏问题成为了制约其广泛应用的难题。联邦学习（FL）是一种分布式机器学习范式，具有隐私保护功能，专门设计用于大量边缘设备的训练任务。将FL应用于元宇宙不仅可以保护参与者的数据隐私，还可以减少服务器上高计算能力和高存储量的需求。本文回顾了针对FL4M的一些早期研究进展。",
    "tldr": "本文综述了早期FL4M的研究进展，并探讨了FL对于保护元宇宙参与者的数据隐私和降低服务器计算和存储需求的重要性。",
    "en_tdlr": "This paper provides a survey of the early advances of federated learning for metaverse (FL4M) and discusses the importance of FL in protecting data privacy of metaverse participants and reducing the need for high computing and storage requirements on servers."
}