{
    "title": "Generate labeled training data using Prompt Programming and GPT-3. An example of Big Five Personality Classification. (arXiv:2303.12279v1 [cs.HC])",
    "abstract": "We generated 25000 conversations labeled with Big Five Personality traits using prompt programming at GPT-3. Then we train Big Five classification models with these data and evaluate them with 2500 data from generated dialogues and real conversational datasets labeled in Big Five by human annotators. The results indicated that this approach is promising for creating effective training data. We then compare the performance by different training approaches and models. Our results suggest that using Adapter-Transformers and transfer learning from pre-trained RoBERTa sentiment analysis model will perform best with the generated data. Our best model obtained an accuracy of 0.71 in generated data and 0.65 in real datasets. Finally, we discuss this approach's potential limitations and confidence metric.",
    "link": "http://arxiv.org/abs/2303.12279",
    "context": "Title: Generate labeled training data using Prompt Programming and GPT-3. An example of Big Five Personality Classification. (arXiv:2303.12279v1 [cs.HC])\nAbstract: We generated 25000 conversations labeled with Big Five Personality traits using prompt programming at GPT-3. Then we train Big Five classification models with these data and evaluate them with 2500 data from generated dialogues and real conversational datasets labeled in Big Five by human annotators. The results indicated that this approach is promising for creating effective training data. We then compare the performance by different training approaches and models. Our results suggest that using Adapter-Transformers and transfer learning from pre-trained RoBERTa sentiment analysis model will perform best with the generated data. Our best model obtained an accuracy of 0.71 in generated data and 0.65 in real datasets. Finally, we discuss this approach's potential limitations and confidence metric.",
    "path": "papers/23/03/2303.12279.json",
    "total_tokens": 773,
    "translated_title": "使用Prompt Programming和GPT-3生成标记训练数据——以大五人格分类为例",
    "translated_abstract": "我们使用Prompt Programming和GPT-3生成了25000个带有大五人格特征标记的对话，并使用这些数据训练了大五分类模型。随后，我们使用2500条来自生成对话和真实对话数据集的人类注释的大五标记数据对这些模型进行了评估。结果表明，这种方法有望创建有效的训练数据。我们进一步比较了不同的训练方法和模型的性能。我们的结果表明，使用Adapter-Transformers和来自预训练RoBERTa情感分析模型的迁移学习将在生成的数据中表现最佳。我们的最佳模型在生成的数据中获得了0.71的准确率，在真实数据集中获得了0.65的准确率。最后，我们讨论了这种方法的潜在限制和置信度度量。",
    "tldr": "本研究使用Prompt Programming和GPT-3技术生成了大量带有特征标记的对话数据，有效用于训练大五人格分类模型。",
    "en_tdlr": "This study uses Prompt Programming and GPT-3 technology to generate a large amount of labeled dialogue data for training Big Five personality classification models with high accuracy."
}