{
    "title": "Hyper-Reduced Autoencoders for Efficient and Accurate Nonlinear Model Reductions. (arXiv:2303.09630v1 [physics.comp-ph])",
    "abstract": "Projection-based model order reduction on nonlinear manifolds has been recently proposed for problems with slowly decaying Kolmogorov n-width such as advection-dominated ones. These methods often use neural networks for manifold learning and showcase improved accuracy over traditional linear subspace-reduced order models. A disadvantage of the previously proposed methods is the potential high computational costs of training the networks on high-fidelity solution snapshots. In this work, we propose and analyze a novel method that overcomes this disadvantage by training a neural network only on subsampled versions of the high-fidelity solution snapshots. This method coupled with collocation-based hyper-reduction and Gappy-POD allows for efficient and accurate surrogate models. We demonstrate the validity of our approach on a 2d Burgers problem.",
    "link": "http://arxiv.org/abs/2303.09630",
    "context": "Title: Hyper-Reduced Autoencoders for Efficient and Accurate Nonlinear Model Reductions. (arXiv:2303.09630v1 [physics.comp-ph])\nAbstract: Projection-based model order reduction on nonlinear manifolds has been recently proposed for problems with slowly decaying Kolmogorov n-width such as advection-dominated ones. These methods often use neural networks for manifold learning and showcase improved accuracy over traditional linear subspace-reduced order models. A disadvantage of the previously proposed methods is the potential high computational costs of training the networks on high-fidelity solution snapshots. In this work, we propose and analyze a novel method that overcomes this disadvantage by training a neural network only on subsampled versions of the high-fidelity solution snapshots. This method coupled with collocation-based hyper-reduction and Gappy-POD allows for efficient and accurate surrogate models. We demonstrate the validity of our approach on a 2d Burgers problem.",
    "path": "papers/23/03/2303.09630.json",
    "total_tokens": 857,
    "translated_title": "高效准确的非线性模型降维的超降维自编码器",
    "translated_abstract": "最近，投影模型降维在非线性流形上被提出来用于慢速下降Kolmogorov n-width问题的模型降维，如流程主导问题。这些方法通常使用神经网络进行流形学习，并展示出比传统的线性子空间降维模型更好的准确性。先前提出的方法的一个缺点是在高保真度的解快照上训练网络可能导致潜在的高计算成本。在这项工作中，我们提出并分析了一种新方法，通过仅在高保真度的解快照的子采样版本上训练神经网络来克服这个缺点。这种方法与基于重心插值的超降维和Gappy-POD结合使用，可以实现高效准确的代理模型。我们在2D Burgers问题上演示我们方法的有效性。",
    "tldr": "提出一种新的方法使用超降维自编码器来实现高效准确的非线性模型降维，在高保真度的解快照的子采样版本上训练神经网络以克服高计算成本。在2D Burgers问题上演示了方法的有效性。",
    "en_tdlr": "A novel method using hyper-reduced autoencoders is proposed to achieve efficient and accurate nonlinear model reduction, which trains a neural network only on subsampled versions of high-fidelity solution snapshots to overcome the potential high computational costs. The method is demonstrated to be effective on a 2D Burgers problem."
}