{
    "title": "A Categorical Framework of General Intelligence. (arXiv:2303.04571v2 [cs.AI] UPDATED)",
    "abstract": "Can machines think? Since Alan Turing asked this question in 1950, nobody is able to give a direct answer, due to the lack of solid mathematical foundations for general intelligence. In this paper, we introduce a categorical framework towards this goal, with two main results. First, we investigate object representation through presheaves, introducing the notion of self-state awareness as a categorical analogue to self-consciousness, along with corresponding algorithms for its enforcement and evaluation. Secondly, we extend object representation to scenario representation using diagrams and limits, which then become building blocks for mathematical modeling, interpretability and AI safety. As an ancillary result, our framework introduces various categorical invariance properties that can serve as the alignment signals for model training.",
    "link": "http://arxiv.org/abs/2303.04571",
    "context": "Title: A Categorical Framework of General Intelligence. (arXiv:2303.04571v2 [cs.AI] UPDATED)\nAbstract: Can machines think? Since Alan Turing asked this question in 1950, nobody is able to give a direct answer, due to the lack of solid mathematical foundations for general intelligence. In this paper, we introduce a categorical framework towards this goal, with two main results. First, we investigate object representation through presheaves, introducing the notion of self-state awareness as a categorical analogue to self-consciousness, along with corresponding algorithms for its enforcement and evaluation. Secondly, we extend object representation to scenario representation using diagrams and limits, which then become building blocks for mathematical modeling, interpretability and AI safety. As an ancillary result, our framework introduces various categorical invariance properties that can serve as the alignment signals for model training.",
    "path": "papers/23/03/2303.04571.json",
    "total_tokens": 775,
    "translated_title": "一种通用智能的范畴框架",
    "translated_abstract": "自从Alan Turing在1950年提出“机器是否可以思考”的问题以来，由于缺少扎实的通用智能数学基础，至今难以给出直接答案。本文介绍了一个通往这一目标的范畴框架，得到了两个主要结果。首先，我们通过预层次研究对象表示，引入了自我状态感知的概念作为类别对应自我意识的模拟，并提出了相应的强制执行和评估算法。其次，我们将对象表示扩展到场景表示，使用图表和界限，这些成为了数学建模、可解释性和AI安全的构建块。作为一个附带的结果，我们的框架引入了各种范畴不变性属性，可以用作模型训练的对准信号。",
    "tldr": "本文介绍了一个通用智能的范畴框架，涉及对象和场景的表示及模拟，并提出了相应的算法和不变性属性，可以用于解决AI的可解释性和安全问题。",
    "en_tdlr": "This paper introduces a categorical framework for general intelligence, focusing on object and scenario representation and simulation, with corresponding algorithms and invariance properties that can be applied to improve interpretability and safety in AI."
}