{
    "title": "A hybrid deep-learning-metaheuristic framework for discrete road network design problems. (arXiv:2303.06024v2 [cs.NE] UPDATED)",
    "abstract": "This study proposes a hybrid deep-learning-metaheuristic framework with a bi-level architecture for road network design problems (NDPs). We train a graph neural network (GNN) to approximate the solution of the user equilibrium (UE) traffic assignment problem, and use inferences made by the trained model to calculate fitness function evaluations of a genetic algorithm (GA) to approximate solutions for NDPs. Using two NDP variants and an exact solver as benchmark, we show that our proposed framework can provide solutions within 5% gap of the global optimum results given less than 1% of the time required for finding the optimal results. Our framework can be utilized within an expert system for infrastructure planning to intelligently determine the best infrastructure management decisions. Given the flexibility of the framework, it can easily be adapted to many other decision problems that can be modeled as bi-level problems on graphs. Moreover, we observe many interesting future direction",
    "link": "http://arxiv.org/abs/2303.06024",
    "context": "Title: A hybrid deep-learning-metaheuristic framework for discrete road network design problems. (arXiv:2303.06024v2 [cs.NE] UPDATED)\nAbstract: This study proposes a hybrid deep-learning-metaheuristic framework with a bi-level architecture for road network design problems (NDPs). We train a graph neural network (GNN) to approximate the solution of the user equilibrium (UE) traffic assignment problem, and use inferences made by the trained model to calculate fitness function evaluations of a genetic algorithm (GA) to approximate solutions for NDPs. Using two NDP variants and an exact solver as benchmark, we show that our proposed framework can provide solutions within 5% gap of the global optimum results given less than 1% of the time required for finding the optimal results. Our framework can be utilized within an expert system for infrastructure planning to intelligently determine the best infrastructure management decisions. Given the flexibility of the framework, it can easily be adapted to many other decision problems that can be modeled as bi-level problems on graphs. Moreover, we observe many interesting future direction",
    "path": "papers/23/03/2303.06024.json",
    "total_tokens": 936,
    "translated_title": "一种离散道路网络设计问题的混合深度学习-元启发式框架",
    "translated_abstract": "本研究提出了一种具有双层架构的混合深度学习元启发式框架，用于解决道路网络设计问题（NDPs）。我们使用图神经网络（GNN）训练来近似用户均衡（UE）交通分配问题的解，并使用训练模型进行的推理来计算遗传算法（GA）的适应度函数评估，以近似解决NDPs。通过使用两个NDP变量和一个精确求解器作为基准，我们证明了我们提出的框架可以在少于1％的时间内给出全局最优结果的5％左右的间隙内提供解决方案。我们的框架可以在专家系统中使用，用于基础设施规划，以智能地确定最佳基础设施管理决策。由于该框架的灵活性，可以轻松地适应许多可以被建模为图上双层问题的其他决策问题。此外，我们还观察到许多有趣的未来方向。",
    "tldr": "本研究提出了一种混合框架，结合了深度学习和元启发式算法，用于离散道路网络设计问题。该框架可以快速地得到高质量的解决方案，并且可以应用于其他以图为模型的双层问题决策中。",
    "en_tdlr": "This study proposes a hybrid framework combining deep learning and metaheuristic algorithms for discrete road network design problems. The framework can efficiently provide high-quality solutions and can be adapted to other bi-level decision problems modeled on graphs."
}