{
    "title": "Model Based Explanations of Concept Drift. (arXiv:2303.09331v1 [cs.LG])",
    "abstract": "The notion of concept drift refers to the phenomenon that the distribution generating the observed data changes over time. If drift is present, machine learning models can become inaccurate and need adjustment. While there do exist methods to detect concept drift or to adjust models in the presence of observed drift, the question of explaining drift, i.e., describing the potentially complex and high dimensional change of distribution in a human-understandable fashion, has hardly been considered so far. This problem is of importance since it enables an inspection of the most prominent characteristics of how and where drift manifests itself. Hence, it enables human understanding of the change and it increases acceptance of life-long learning models. In this paper, we present a novel technology characterizing concept drift in terms of the characteristic change of spatial features based on various explanation techniques. To do so, we propose a methodology to reduce the explanation of conce",
    "link": "http://arxiv.org/abs/2303.09331",
    "context": "Title: Model Based Explanations of Concept Drift. (arXiv:2303.09331v1 [cs.LG])\nAbstract: The notion of concept drift refers to the phenomenon that the distribution generating the observed data changes over time. If drift is present, machine learning models can become inaccurate and need adjustment. While there do exist methods to detect concept drift or to adjust models in the presence of observed drift, the question of explaining drift, i.e., describing the potentially complex and high dimensional change of distribution in a human-understandable fashion, has hardly been considered so far. This problem is of importance since it enables an inspection of the most prominent characteristics of how and where drift manifests itself. Hence, it enables human understanding of the change and it increases acceptance of life-long learning models. In this paper, we present a novel technology characterizing concept drift in terms of the characteristic change of spatial features based on various explanation techniques. To do so, we propose a methodology to reduce the explanation of conce",
    "path": "papers/23/03/2303.09331.json",
    "total_tokens": 799,
    "translated_title": "基于模型的概念漂移解释",
    "translated_abstract": "概念漂移是指生成观测数据的分布随时间改变的现象。本文提出了一种新的技术，通过各种解释技术，以空间特征的特征变化来表征概念漂移。我们提出了一种将概念漂移的解释简化为重要特征及其空间特征识别的方法，该方法可以适用于任何机器学习模型。在多个数据集上评估了我们的方法，并显示它可以准确地表征概念漂移，并在可解释性方面优于现有方法。",
    "tldr": "本文提出了一种新的技术，通过各种解释技术，以空间特征的特征变化来表征概念漂移，可以适用于任何模型，并在多个数据集上评估和优化方法。",
    "en_tdlr": "This paper presents a novel technology that characterizes concept drift in terms of the characteristic change of spatial features based on various explanation techniques, which is applicable to any model and has been evaluated and optimized on multiple datasets."
}