{
    "title": "Targeted Adversarial Attacks on Wind Power Forecasts. (arXiv:2303.16633v1 [cs.LG])",
    "abstract": "In recent years, researchers proposed a variety of deep learning models for wind power forecasting. These models predict the wind power generation of wind farms or entire regions more accurately than traditional machine learning algorithms or physical models. However, latest research has shown that deep learning models can often be manipulated by adversarial attacks. Since wind power forecasts are essential for the stability of modern power systems, it is important to protect them from this threat. In this work, we investigate the vulnerability of two different forecasting models to targeted, semitargeted, and untargeted adversarial attacks. We consider a Long Short-Term Memory (LSTM) network for predicting the power generation of a wind farm and a Convolutional Neural Network (CNN) for forecasting the wind power generation throughout Germany. Moreover, we propose the Total Adversarial Robustness Score (TARS), an evaluation metric for quantifying the robustness of regression models to ",
    "link": "http://arxiv.org/abs/2303.16633",
    "context": "Title: Targeted Adversarial Attacks on Wind Power Forecasts. (arXiv:2303.16633v1 [cs.LG])\nAbstract: In recent years, researchers proposed a variety of deep learning models for wind power forecasting. These models predict the wind power generation of wind farms or entire regions more accurately than traditional machine learning algorithms or physical models. However, latest research has shown that deep learning models can often be manipulated by adversarial attacks. Since wind power forecasts are essential for the stability of modern power systems, it is important to protect them from this threat. In this work, we investigate the vulnerability of two different forecasting models to targeted, semitargeted, and untargeted adversarial attacks. We consider a Long Short-Term Memory (LSTM) network for predicting the power generation of a wind farm and a Convolutional Neural Network (CNN) for forecasting the wind power generation throughout Germany. Moreover, we propose the Total Adversarial Robustness Score (TARS), an evaluation metric for quantifying the robustness of regression models to ",
    "path": "papers/23/03/2303.16633.json",
    "total_tokens": 938,
    "translated_title": "针对风电功率预测的有目标对抗攻击",
    "translated_abstract": "近年来，研究人员提出了多种用于风电功率预测的深度学习模型。这些模型比传统的机器学习算法或物理模型更准确地预测了风电场或整个地区的风力发电。然而，最新的研究表明，深度学习模型常常会受到对抗性攻击的影响。由于风电功率预测对现代电力系统的稳定性至关重要，因此保护预测结果免受这种威胁非常重要。本文研究了两种不同预测模型对有目标、半有目标和无目标对抗攻击的脆弱性。我们考虑了一种用于预测风电场功率发电的长短期记忆（LSTM）网络和一种用于预测德国整个地区的风力发电的卷积神经网络（CNN）。此外，我们提出了总对抗鲁棒性评分（TARS），一种用于量化回归模型稳健性的评估指标。",
    "tldr": "本研究检测了两个深度学习预测模型的脆弱性，并提出了一种新的评估指标。这些模型可以被针对性攻击，因此保护风电功率预测结果对现代电力系统的稳定性至关重要。",
    "en_tdlr": "This work investigates the vulnerability of two different deep learning models for wind power forecasting and proposes a new evaluation metric. These models are susceptible to targeted attacks, highlighting the importance of protecting wind power forecast results for the stability of modern power systems."
}