{
    "title": "SigVIC: Spatial Importance Guided Variable-Rate Image Compression. (arXiv:2303.09112v1 [eess.IV])",
    "abstract": "Variable-rate mechanism has improved the flexibility and efficiency of learning-based image compression that trains multiple models for different rate-distortion tradeoffs. One of the most common approaches for variable-rate is to channel-wisely or spatial-uniformly scale the internal features. However, the diversity of spatial importance is instructive for bit allocation of image compression. In this paper, we introduce a Spatial Importance Guided Variable-rate Image Compression (SigVIC), in which a spatial gating unit (SGU) is designed for adaptively learning a spatial importance mask. Then, a spatial scaling network (SSN) takes the spatial importance mask to guide the feature scaling and bit allocation for variable-rate. Moreover, to improve the quality of decoded image, Top-K shallow features are selected to refine the decoded features through a shallow feature fusion module (SFFM). Experiments show that our method outperforms other learning-based methods (whether variable-rate or ",
    "link": "http://arxiv.org/abs/2303.09112",
    "context": "Title: SigVIC: Spatial Importance Guided Variable-Rate Image Compression. (arXiv:2303.09112v1 [eess.IV])\nAbstract: Variable-rate mechanism has improved the flexibility and efficiency of learning-based image compression that trains multiple models for different rate-distortion tradeoffs. One of the most common approaches for variable-rate is to channel-wisely or spatial-uniformly scale the internal features. However, the diversity of spatial importance is instructive for bit allocation of image compression. In this paper, we introduce a Spatial Importance Guided Variable-rate Image Compression (SigVIC), in which a spatial gating unit (SGU) is designed for adaptively learning a spatial importance mask. Then, a spatial scaling network (SSN) takes the spatial importance mask to guide the feature scaling and bit allocation for variable-rate. Moreover, to improve the quality of decoded image, Top-K shallow features are selected to refine the decoded features through a shallow feature fusion module (SFFM). Experiments show that our method outperforms other learning-based methods (whether variable-rate or ",
    "path": "papers/23/03/2303.09112.json",
    "total_tokens": 1027,
    "translated_title": "SigVIC: 空间重要性指导的可变比图像压缩",
    "translated_abstract": "可变比机制提高了基于学习的图像压缩的灵活性和效率，该方法为不同的速率-失真权衡训练多个模型。变比率的最常见方法之一是按通道或空间均匀缩放内部特征。但是，空间重要性的多样性对于图像压缩的比特分配是有指导意义的。在本文中，我们介绍了一种空间重要性指导的可变比图像压缩方法（SigVIC），其中设计了一个空间门控单元（SGU），用于自适应学习空间重要性掩码。然后，一个空间缩放网络（SSN）使用空间重要性掩码来指导特征缩放和可变比率的比特分配。此外，为了提高解码图像的质量，选择Top-K浅层特征通过浅层特征融合模块（SFFM）来精细地调整解码特征。实验证明，我们的方法在多个基准数据集上优于其他基于学习的方法（无论是变比率还是非变比率），在速率失真性能和视觉质量方面均实现了最先进的性能。",
    "tldr": "SigVIC是一种空间重要性指导的可变比图像压缩方法，通过自适应学习空间重要性掩码指导特征缩放和比特分配，选择Top-K浅层特征来精细调整解码特征，实验结果表明其在速率失真性能和视觉质量方面均实现了最先进的性能。"
}