{
    "title": "Semi-decentralized Inference in Heterogeneous Graph Neural Networks for Traffic Demand Forecasting: An Edge-Computing Approach. (arXiv:2303.00524v2 [cs.LG] UPDATED)",
    "abstract": "Prediction of taxi service demand and supply is essential for improving customer's experience and provider's profit. Recently, graph neural networks (GNNs) have been shown promising for this application. This approach models city regions as nodes in a transportation graph and their relations as edges. GNNs utilize local node features and the graph structure in the prediction. However, more efficient forecasting can still be achieved by following two main routes; enlarging the scale of the transportation graph, and simultaneously exploiting different types of nodes and edges in the graphs. However, both approaches are challenged by the scalability of GNNs. An immediate remedy to the scalability challenge is to decentralize the GNN operation. However, this creates excessive node-to-node communication. In this paper, we first characterize the excessive communication needs for the decentralized GNN approach. Then, we propose a semi-decentralized approach utilizing multiple cloudlets, moder",
    "link": "http://arxiv.org/abs/2303.00524",
    "context": "Title: Semi-decentralized Inference in Heterogeneous Graph Neural Networks for Traffic Demand Forecasting: An Edge-Computing Approach. (arXiv:2303.00524v2 [cs.LG] UPDATED)\nAbstract: Prediction of taxi service demand and supply is essential for improving customer's experience and provider's profit. Recently, graph neural networks (GNNs) have been shown promising for this application. This approach models city regions as nodes in a transportation graph and their relations as edges. GNNs utilize local node features and the graph structure in the prediction. However, more efficient forecasting can still be achieved by following two main routes; enlarging the scale of the transportation graph, and simultaneously exploiting different types of nodes and edges in the graphs. However, both approaches are challenged by the scalability of GNNs. An immediate remedy to the scalability challenge is to decentralize the GNN operation. However, this creates excessive node-to-node communication. In this paper, we first characterize the excessive communication needs for the decentralized GNN approach. Then, we propose a semi-decentralized approach utilizing multiple cloudlets, moder",
    "path": "papers/23/03/2303.00524.json",
    "total_tokens": 1014,
    "translated_title": "异构图神经网络中的半分散推理技术在交通需求预测中的应用：一种边缘计算方法",
    "translated_abstract": "预测出租车服务的需求和供应对于提高客户体验和提供商利润至关重要。最近，图神经网络（GNN）在此类应用中展现出了良好的前景。该方法将城市区域建模为一个交通图中的节点以及它们之间的关系作为边。GNN利用本地节点特征和图形结构进行预测。然而，通过两种主要途径，可以实现更高效的预测：扩大交通网络的规模，同时利用图中不同类型的节点和边。然而，这两种方法都面临GNN可扩展性的挑战。即时的解决方法是分散GNN操作。然而，这会产生过多的节点之间传输通信。在本文中，我们首先表征了分散的GNN方法对于过多的通信需求。然后，我们提出了一种半分散方法，利用多个负责调节的云计算节点来减少通信需求，同时保持分散化的优势。我们在大规模出租车服务需求预测数据集上评估了我们的方法。实验结果表明，我们的方法能够在保持高精度的同时，有效减少通信开销。",
    "tldr": "本文提出一种半分散推理方法，利用多个云节点降低通信需求，同时保持图神经网络分散化的优势，从而提高交通需求预测效率。",
    "en_tdlr": "This paper proposes a semi-decentralized approach that utilizes multiple cloudlets to reduce communication needs while preserving the benefits of graph neural network decentralization, in order to improve the efficiency of traffic demand forecasting."
}