{
    "title": "Rearrange Indoor Scenes for Human-Robot Co-Activity. (arXiv:2303.05676v1 [cs.RO])",
    "abstract": "We present an optimization-based framework for rearranging indoor furniture to accommodate human-robot co-activities better. The rearrangement aims to afford sufficient accessible space for robot activities without compromising everyday human activities. To retain human activities, our algorithm preserves the functional relations among furniture by integrating spatial and semantic co-occurrence extracted from SUNCG and ConceptNet, respectively. By defining the robot's accessible space by the amount of open space it can traverse and the number of objects it can reach, we formulate the rearrangement for human-robot co-activity as an optimization problem, solved by adaptive simulated annealing (ASA) and covariance matrix adaptation evolution strategy (CMA-ES). Our experiments on the SUNCG dataset quantitatively show that rearranged scenes provide an average of 14% more accessible space and 30% more objects to interact with. The quality of the rearranged scenes is qualitatively validated b",
    "link": "http://arxiv.org/abs/2303.05676",
    "raw_ret": "{\n    \"translated_title\": \"室内场景的人机合作优化与重组\",\n    \"translated_abstract\": \"我们提出了一种基于优化的框架，以更好地配合人机协作来重新布置室内家具。重组旨在为机器人活动提供足够的可访问空间，同时不影响日常人类活动。为保留人类活动，我们的算法通过整合从SUNCG和ConceptNet中提取的空间和语义共现来保留家具之间的功能关系。通过定义机器人可访问空间的开放空间量和能够到达的物体数量，我们将人机协作的重组形式化为一个优化问题，由自适应模拟退火(ASA)和协方差矩阵适应进化策略(CMA-ES)求解。我们在SUNCG数据集上的实验定量显示，重新排列的场景提供平均14%的可访问空间和30%的可交互对象。重组场景的质量在定性上得到验证。\",\n    \"tldr\": \"我们提出了一种室内家具的重组框架，旨在为机器人活动提供足够的可访问空间，同时不影响日常人类活动。实验显示，这种方法可以增加14%的可访问空间和30%的可交互对象。\"\n}",
    "total_tokens": 834,
    "ret": {
        "translated_title": "室内场景的人机合作优化与重组",
        "translated_abstract": "我们提出了一种基于优化的框架，以更好地配合人机协作来重新布置室内家具。重组旨在为机器人活动提供足够的可访问空间，同时不影响日常人类活动。为保留人类活动，我们的算法通过整合从SUNCG和ConceptNet中提取的空间和语义共现来保留家具之间的功能关系。通过定义机器人可访问空间的开放空间量和能够到达的物体数量，我们将人机协作的重组形式化为一个优化问题，由自适应模拟退火(ASA)和协方差矩阵适应进化策略(CMA-ES)求解。我们在SUNCG数据集上的实验定量显示，重新排列的场景提供平均14%的可访问空间和30%的可交互对象。重组场景的质量在定性上得到验证。",
        "tldr": "我们提出了一种室内家具的重组框架，旨在为机器人活动提供足够的可访问空间，同时不影响日常人类活动。实验显示，这种方法可以增加14%的可访问空间和30%的可交互对象。"
    }
}