{
    "title": "Uncovering Bias in Personal Informatics. (arXiv:2303.15592v1 [cs.CY])",
    "abstract": "Personal informatics (PI) systems, powered by smartphones and wearables, enable people to lead healthier lifestyles by providing meaningful and actionable insights that break down barriers between users and their health information. Today, such systems are used by billions of users for monitoring not only physical activity and sleep but also vital signs and women's and heart health, among others. %Despite their widespread usage, the processing of particularly sensitive personal data, and their proximity to domains known to be susceptible to bias, such as healthcare, bias in PI has not been investigated systematically. Despite their widespread usage, the processing of sensitive PI data may suffer from biases, which may entail practical and ethical implications. In this work, we present the first comprehensive empirical and analytical study of bias in PI systems, including biases in raw data and in the entire machine learning life cycle. We use the most detailed framework to date for exp",
    "link": "http://arxiv.org/abs/2303.15592",
    "context": "Title: Uncovering Bias in Personal Informatics. (arXiv:2303.15592v1 [cs.CY])\nAbstract: Personal informatics (PI) systems, powered by smartphones and wearables, enable people to lead healthier lifestyles by providing meaningful and actionable insights that break down barriers between users and their health information. Today, such systems are used by billions of users for monitoring not only physical activity and sleep but also vital signs and women's and heart health, among others. %Despite their widespread usage, the processing of particularly sensitive personal data, and their proximity to domains known to be susceptible to bias, such as healthcare, bias in PI has not been investigated systematically. Despite their widespread usage, the processing of sensitive PI data may suffer from biases, which may entail practical and ethical implications. In this work, we present the first comprehensive empirical and analytical study of bias in PI systems, including biases in raw data and in the entire machine learning life cycle. We use the most detailed framework to date for exp",
    "path": "papers/23/03/2303.15592.json",
    "total_tokens": 793,
    "translated_title": "揭示个人信息学中的偏见",
    "translated_abstract": "由智能手机和可穿戴设备驱动的个人信息学（PI）系统，通过提供有意义且可执行的见解，消除了用户与其健康信息之间的障碍，使人们能够过上更健康的生活。今天，数十亿用户使用此类系统来监测不仅是身体活动和睡眠，还有生命体征、女性健康和心脏健康等。尽管被广泛使用，并且处理敏感的PI数据，但偏见问题尚未得到系统的调查。这项工作是第一个对包括原始数据和整个机器学习生命周期中的偏见进行全面实证和分析研究的工作，并使用迄今为止最详细的框架。",
    "tldr": "该论文是第一个对个人信息学系统中的偏见进行实证和分析研究的工作，研究包括原始数据和整个机器学习周期中的偏见，并找出其中的实践和道德影响。",
    "en_tdlr": "This paper presents the first comprehensive empirical and analytical study of bias in personal informatics (PI) systems, including biases in raw data and in the entire machine learning lifecycle, and identifies practical and ethical implications of these biases."
}