{
    "title": "Transcriptomics-based matching of drugs to diseases with deep learning. (arXiv:2303.11695v1 [q-bio.GN])",
    "abstract": "In this work we present a deep learning approach to conduct hypothesis-free, transcriptomics-based matching of drugs for diseases. Our proposed neural network architecture is trained on approved drug-disease indications, taking as input the relevant disease and drug differential gene expression profiles, and learns to identify novel indications. We assemble an evaluation dataset of disease-drug indications spanning 68 diseases and evaluate in silico our approach against the most widely used transcriptomics-based matching baselines, CMap and the Characteristic Direction. Our results show a more than 200% improvement over both baselines in terms of standard retrieval metrics. We further showcase our model's ability to capture different genes' expressions interactions among drugs and diseases. We provide our trained models, data and code to predict with them at https://github.com/healx/dgem-nn-public.",
    "link": "http://arxiv.org/abs/2303.11695",
    "context": "Title: Transcriptomics-based matching of drugs to diseases with deep learning. (arXiv:2303.11695v1 [q-bio.GN])\nAbstract: In this work we present a deep learning approach to conduct hypothesis-free, transcriptomics-based matching of drugs for diseases. Our proposed neural network architecture is trained on approved drug-disease indications, taking as input the relevant disease and drug differential gene expression profiles, and learns to identify novel indications. We assemble an evaluation dataset of disease-drug indications spanning 68 diseases and evaluate in silico our approach against the most widely used transcriptomics-based matching baselines, CMap and the Characteristic Direction. Our results show a more than 200% improvement over both baselines in terms of standard retrieval metrics. We further showcase our model's ability to capture different genes' expressions interactions among drugs and diseases. We provide our trained models, data and code to predict with them at https://github.com/healx/dgem-nn-public.",
    "path": "papers/23/03/2303.11695.json",
    "total_tokens": 978,
    "translated_title": "基于转录组学和深度学习的药物和疾病匹配研究",
    "translated_abstract": "本文提出了一种深度学习方法，用于进行无假设的基于转录组学的药物和疾病匹配研究。我们提出的神经网络架构是在批准的药物 - 疾病适应症方面进行训练的，以相关的疾病和药物差异基因表达谱作为输入，并学习识别新的适应症。我们组装了一个包含68种疾病的疾病 - 药物适应症评估数据集，并在计算机模拟中将我们的方法与最广泛使用的转录组学匹配基线CMap和Characteristic Direction进行了评估。我们的结果显示，在标准检索度量方面，我们的方法比这两个基线提高了200%以上。我们进一步展示了我们的模型捕获了不同基因表达之间的相互作用，包括药物和疾病。我们提供了我们训练的模型，数据和代码供学者在 https://github.com/healx/dgem-nn-public 上使用。",
    "tldr": "本文通过使用深度学习方法，基于转录组学进行无假设的药物和疾病匹配研究。研究结果显示，相比于其他转录组学匹配方法，我们提出的方法具备更高的性能。此外，我们的模型还能够捕捉不同基因表达之间的相互作用，为新药开发提供了新思路。",
    "en_tdlr": "This paper proposes a deep learning approach for hypothesis-free, transcriptomics-based matching of drugs to diseases. The results show a significant improvement over other transcriptomics-based matching methods. The model is also able to capture gene expression interactions among drugs and diseases, providing new insights into drug development. The trained models, data, and code are available for further research."
}