{
    "title": "Complementary Domain Adaptation and Generalization for Unsupervised Continual Domain Shift Learning. (arXiv:2303.15833v1 [cs.LG])",
    "abstract": "Continual domain shift poses a significant challenge in real-world applications, particularly in situations where labeled data is not available for new domains. The challenge of acquiring knowledge in this problem setting is referred to as unsupervised continual domain shift learning. Existing methods for domain adaptation and generalization have limitations in addressing this issue, as they focus either on adapting to a specific domain or generalizing to unseen domains, but not both. In this paper, we propose Complementary Domain Adaptation and Generalization (CoDAG), a simple yet effective learning framework that combines domain adaptation and generalization in a complementary manner to achieve three major goals of unsupervised continual domain shift learning: adapting to a current domain, generalizing to unseen domains, and preventing forgetting of previously seen domains. Our approach is model-agnostic, meaning that it is compatible with any existing domain adaptation and generaliz",
    "link": "http://arxiv.org/abs/2303.15833",
    "context": "Title: Complementary Domain Adaptation and Generalization for Unsupervised Continual Domain Shift Learning. (arXiv:2303.15833v1 [cs.LG])\nAbstract: Continual domain shift poses a significant challenge in real-world applications, particularly in situations where labeled data is not available for new domains. The challenge of acquiring knowledge in this problem setting is referred to as unsupervised continual domain shift learning. Existing methods for domain adaptation and generalization have limitations in addressing this issue, as they focus either on adapting to a specific domain or generalizing to unseen domains, but not both. In this paper, we propose Complementary Domain Adaptation and Generalization (CoDAG), a simple yet effective learning framework that combines domain adaptation and generalization in a complementary manner to achieve three major goals of unsupervised continual domain shift learning: adapting to a current domain, generalizing to unseen domains, and preventing forgetting of previously seen domains. Our approach is model-agnostic, meaning that it is compatible with any existing domain adaptation and generaliz",
    "path": "papers/23/03/2303.15833.json",
    "total_tokens": 939,
    "translated_abstract": "连续的领域偏移对于现实应用来说是一个重要的挑战，特别是在新领域没有标定数据可用的情况下。在这种问题设置中获取知识的挑战被称为无监督连续领域偏移学习。现有的领域自适应和泛化方法存在限制，无法解决这个问题，因为它们专注于适应特定领域或推广到看不见的领域，但是两者都不能。为了解决无监督连续领域偏移学习的三个主要目标：适应当前领域、推广到看不见的领域和防止遗忘之前看到的领域，本文提出了互补领域自适应与泛化 (CoDAG)——一种简单而有效的学习框架。我们的方法是模型无关的，这意味着它与任何现有的领域自适                                                                      应和泛化方法兼容。",
    "tldr": "本文提出了CoDAG——结合了领域适应和泛化的学习框架，旨在实现无监督连续领域偏移学习的三个主要目标。该方法可以适应当前领域、推广到看不见的领域和防止遗忘之前看到的领域。",
    "en_tdlr": "The paper proposes CoDAG, a learning framework that combines domain adaptation and generalization in a complementary manner to achieve three major goals of unsupervised continual domain shift learning: adapting to a current domain, generalizing to unseen domains, and preventing forgetting."
}