{
    "title": "Applying unsupervised keyphrase methods on concepts extracted from discharge sheets. (arXiv:2303.08928v1 [cs.CL])",
    "abstract": "Clinical notes containing valuable patient information are written by different health care providers with various scientific levels and writing styles. It might be helpful for clinicians and researchers to understand what information is essential when dealing with extensive electronic medical records. Entities recognizing and mapping them to standard terminologies is crucial in reducing ambiguity in processing clinical notes. Although named entity recognition and entity linking are critical steps in clinical natural language processing, they can also result in the production of repetitive and low-value concepts. In other hand, all parts of a clinical text do not share the same importance or content in predicting the patient's condition. As a result, it is necessary to identify the section in which each content is recorded and also to identify key concepts to extract meaning from clinical texts. In this study, these challenges have been addressed by using clinical natural language proc",
    "link": "http://arxiv.org/abs/2303.08928",
    "context": "Title: Applying unsupervised keyphrase methods on concepts extracted from discharge sheets. (arXiv:2303.08928v1 [cs.CL])\nAbstract: Clinical notes containing valuable patient information are written by different health care providers with various scientific levels and writing styles. It might be helpful for clinicians and researchers to understand what information is essential when dealing with extensive electronic medical records. Entities recognizing and mapping them to standard terminologies is crucial in reducing ambiguity in processing clinical notes. Although named entity recognition and entity linking are critical steps in clinical natural language processing, they can also result in the production of repetitive and low-value concepts. In other hand, all parts of a clinical text do not share the same importance or content in predicting the patient's condition. As a result, it is necessary to identify the section in which each content is recorded and also to identify key concepts to extract meaning from clinical texts. In this study, these challenges have been addressed by using clinical natural language proc",
    "path": "papers/23/03/2303.08928.json",
    "total_tokens": 921,
    "translated_title": "应用无监督关键词方法对出院单中提取的概念进行处理",
    "translated_abstract": "不同医疗保健提供者用各种科学水平和写作风格编写包含有价值患者信息的临床记录。对于处理广泛的电子医疗记录，理解什么信息是必要的可能对临床医生和研究人员有所帮助。实体识别和将其映射到标准术语是减少处理临床记录中的歧义的关键步骤。尽管命名实体识别和实体链接在临床自然语言处理中至关重要，但它们也可能导致产生重复和低价值的概念。因此，有必要确定每个内容记录的部分并识别关键概念以从临床文本中提取含义。本研究通过使用临床自然语言处理技术从出院单中提取概念，并应用无监督关键词方法来识别重要概念来解决这些挑战。结果表明，所提出的方法有效地从临床文本中识别出关键概念。",
    "tldr": "本研究利用临床自然语言处理技术从出院单中提取概念，并应用无监督关键词方法识别重要概念，成功地解决了临床文本中的挑战。",
    "en_tdlr": "This study addresses the challenge of identifying important concepts from clinical texts by using clinical natural language processing techniques to extract concepts from discharge sheets and applying unsupervised keyphrase methods."
}