{
    "title": "Probabilistic Overview of Probabilities of Default for Low Default Portfolios by K. Pluto and D. Tasche. (arXiv:2303.06148v1 [q-fin.RM])",
    "abstract": "This article gives a probabilistic overview of the widely used method of default probability estimation proposed by K. Pluto and D. Tasche. There are listed detailed assumptions and derivation of the inequality where the probability of default is involved under the influence of systematic factor. The author anticipates adding more clarity, especially for early career analysts or scholars, regarding the assumption of borrowers' independence, conditional independence and interaction between the probability distributions such as binomial, beta, normal and others. There is also shown the relation between the probability of default and the joint distribution of $\\sqrt{\\varrho}X-\\sqrt{1-\\varrho}Y$, where $X$, including but not limiting, is the standard normal, $Y$ admits, including but not limiting, the beta-normal distribution and $X,\\,Y$ are independent.",
    "link": "http://arxiv.org/abs/2303.06148",
    "total_tokens": 975,
    "translated_title": "低违约组合的违约概率的概率论概述",
    "translated_abstract": "本文对K. Pluto和D. Tasche提出的违约概率估计方法进行了概率论概述。列出了关于系统因素影响下涉及违约概率的不等式的详细假设和推导。作者预计为早期职业分析师或学者提供更多的清晰度，特别是关于借款人独立性、条件独立性和概率分布之间的交互作用，如二项式、贝塔、正态分布等的假设。还展示了违约概率与$\\sqrt{\\varrho}X-\\sqrt{1-\\varrho}Y$的联合分布之间的关系，其中$X$包括但不限于标准正态分布，$Y$包括但不限于贝塔-正态分布，$X,\\,Y$是独立的。",
    "tldr": "本文概述了K. Pluto和D. Tasche提出的违约概率估计方法，详细列出了假设和推导，为早期职业分析师或学者提供更多的清晰度，特别是关于借款人独立性、条件独立性和概率分布之间的交互作用，如二项式、贝塔、正态分布等的假设。同时，还展示了违约概率与$\\sqrt{\\varrho}X-\\sqrt{1-\\varrho}Y$的联合分布之间的关系。",
    "en_tldr": "This article provides a probabilistic overview of the default probability estimation method proposed by K. Pluto and D. Tasche, including detailed assumptions and derivations. It aims to clarify the assumptions of borrower independence, conditional independence, and interaction between probability distributions such as binomial, beta, and normal for early career analysts or scholars. Additionally, it shows the relationship between the probability of default and the joint distribution of $\\sqrt{\\varrho}X-\\sqrt{1-\\varrho}Y$, where $X$ is the standard normal and $Y$ is the beta-normal distribution."
}