{
    "title": "A Self-supervised Framework for Improved Data-Driven Monitoring of Stress via Multi-modal Passive Sensing. (arXiv:2303.14267v1 [cs.LG])",
    "abstract": "Recent advances in remote health monitoring systems have significantly benefited patients and played a crucial role in improving their quality of life. However, while physiological health-focused solutions have demonstrated increasing success and maturity, mental health-focused applications have seen comparatively limited success in spite of the fact that stress and anxiety disorders are among the most common issues people deal with in their daily lives. In the hopes of furthering progress in this domain through the development of a more robust analytic framework for the measurement of indicators of mental health, we propose a multi-modal semi-supervised framework for tracking physiological precursors of the stress response. Our methodology enables utilizing multi-modal data of differing domains and resolutions from wearable devices and leveraging them to map short-term episodes to semantically efficient embeddings for a given task. Additionally, we leverage an inter-modality contrasti",
    "link": "http://arxiv.org/abs/2303.14267",
    "context": "Title: A Self-supervised Framework for Improved Data-Driven Monitoring of Stress via Multi-modal Passive Sensing. (arXiv:2303.14267v1 [cs.LG])\nAbstract: Recent advances in remote health monitoring systems have significantly benefited patients and played a crucial role in improving their quality of life. However, while physiological health-focused solutions have demonstrated increasing success and maturity, mental health-focused applications have seen comparatively limited success in spite of the fact that stress and anxiety disorders are among the most common issues people deal with in their daily lives. In the hopes of furthering progress in this domain through the development of a more robust analytic framework for the measurement of indicators of mental health, we propose a multi-modal semi-supervised framework for tracking physiological precursors of the stress response. Our methodology enables utilizing multi-modal data of differing domains and resolutions from wearable devices and leveraging them to map short-term episodes to semantically efficient embeddings for a given task. Additionally, we leverage an inter-modality contrasti",
    "path": "papers/23/03/2303.14267.json",
    "total_tokens": 889,
    "translated_title": "一种自监督框架来通过多模态被动感知改进基于数据驱动的压力监测",
    "translated_abstract": "远程健康监测系统的最新进展大大惠及了患者，并在提高其生活质量方面起到了至关重要的作用。然而，尽管生理健康解决方案已经展示出越来越多的成功和成熟性，但精神健康集中的应用相对而言取得的成功还比较有限，尽管压力和焦虑障碍是人们日常生活中最常见的问题之一。为了通过开发更强大的分析框架来测量精神健康的指标，我们提出了一种多模态半监督框架，用于跟踪压力反应的生理前体。我们的方法使我们能够利用来自可穿戴设备的不同领域和分辨率的多模态数据，并利用它们将短期情节映射到给定任务的语义高效嵌入中。另外，我们利用一种跨模态对比方法来增强结果的可靠性。",
    "tldr": "本文介绍了一种利用多模态数据和自监督框架来跟踪压力反应的生理前体的新方法。这种方法有助于提高精神健康监测的可靠性和效果。",
    "en_tdlr": "This paper proposes a novel method of utilizing multi-modal data and a self-supervised framework to track physiological precursors of the stress response, aiming to improve the reliability and effectiveness of mental health monitoring."
}