{
    "title": "How will Language Modelers like ChatGPT Affect Occupations and Industries?. (arXiv:2303.01157v2 [econ.GN] UPDATED)",
    "abstract": "Recent dramatic increases in AI language modeling capabilities has led to many questions about the effect of these technologies on the economy. In this paper we present a methodology to systematically assess the extent to which occupations, industries and geographies are exposed to advances in AI language modeling capabilities. We find that the top occupations exposed to language modeling include telemarketers and a variety of post-secondary teachers such as English language and literature, foreign language and literature, and history teachers. We find the top industries exposed to advances in language modeling are legal services and securities, commodities, and investments. We also find a positive correlation between wages and exposure to AI language modeling.",
    "link": "http://arxiv.org/abs/2303.01157",
    "context": "Title: How will Language Modelers like ChatGPT Affect Occupations and Industries?. (arXiv:2303.01157v2 [econ.GN] UPDATED)\nAbstract: Recent dramatic increases in AI language modeling capabilities has led to many questions about the effect of these technologies on the economy. In this paper we present a methodology to systematically assess the extent to which occupations, industries and geographies are exposed to advances in AI language modeling capabilities. We find that the top occupations exposed to language modeling include telemarketers and a variety of post-secondary teachers such as English language and literature, foreign language and literature, and history teachers. We find the top industries exposed to advances in language modeling are legal services and securities, commodities, and investments. We also find a positive correlation between wages and exposure to AI language modeling.",
    "path": "papers/23/03/2303.01157.json",
    "total_tokens": 818,
    "translated_title": "语言模型（如ChatGPT）将如何影响职业和行业？",
    "translated_abstract": "最近人工智能语言建模能力的急剧提高引发了关于这些技术对经济的影响的许多问题。在本文中，我们提出了一种方法来系统评估职业、行业和地域对人工智能语言建模能力进步的暴露程度。我们发现，最受语言建模影响的职业包括电话销售员和各种高等教育教师，例如英语语言和文学、外语和文学以及历史教师。我们发现，最受语言建模影响的行业是法律服务和证券、商品和投资。我们还发现，工资与人工智能语言建模暴露度之间存在正相关关系。",
    "tldr": "本研究使用方法系统评估了职业和行业对人工智能语言建模技术进步的暴露程度，结果发现电话销售员、英语语言和文学、外语和文学、历史等高等教育教师是最受影响的职业，法律服务、证券、商品和投资是最受影响的行业；而工资与暴露度存在正相关关系。",
    "en_tdlr": "This study presents a methodology to assess how various occupations and industries are exposed to AI language modeling advancements. The findings suggest that post-secondary teachers and legal services industry are the most exposed, whereas wages are positively correlated with the exposure level."
}