{
    "title": "Deep hybrid model with satellite imagery: how to combine demand modeling and computer vision for behavior analysis?",
    "abstract": "arXiv:2303.04204v2 Announce Type: replace  Abstract: Classical demand modeling analyzes travel behavior using only low-dimensional numeric data (i.e. sociodemographics and travel attributes) but not high-dimensional urban imagery. However, travel behavior depends on the factors represented by both numeric data and urban imagery, thus necessitating a synergetic framework to combine them. This study creates a theoretical framework of deep hybrid models with a crossing structure consisting of a mixing operator and a behavioral predictor, thus integrating the numeric and imagery data into a latent space. Empirically, this framework is applied to analyze travel mode choice using the MyDailyTravel Survey from Chicago as the numeric inputs and the satellite images as the imagery inputs. We found that deep hybrid models outperform both the traditional demand models and the recent deep learning in predicting the aggregate and disaggregate travel behavior with our supervision-as-mixing design. T",
    "link": "https://arxiv.org/abs/2303.04204",
    "context": "Title: Deep hybrid model with satellite imagery: how to combine demand modeling and computer vision for behavior analysis?\nAbstract: arXiv:2303.04204v2 Announce Type: replace  Abstract: Classical demand modeling analyzes travel behavior using only low-dimensional numeric data (i.e. sociodemographics and travel attributes) but not high-dimensional urban imagery. However, travel behavior depends on the factors represented by both numeric data and urban imagery, thus necessitating a synergetic framework to combine them. This study creates a theoretical framework of deep hybrid models with a crossing structure consisting of a mixing operator and a behavioral predictor, thus integrating the numeric and imagery data into a latent space. Empirically, this framework is applied to analyze travel mode choice using the MyDailyTravel Survey from Chicago as the numeric inputs and the satellite images as the imagery inputs. We found that deep hybrid models outperform both the traditional demand models and the recent deep learning in predicting the aggregate and disaggregate travel behavior with our supervision-as-mixing design. T",
    "path": "papers/23/03/2303.04204.json",
    "total_tokens": 894,
    "translated_title": "具有卫星图像的深度混合模型：如何将需求建模和计算机视觉相结合用于行为分析？",
    "translated_abstract": "传统的需求建模仅使用低维数数值数据（即社会人口统计数据和出行属性），而不使用高维城市影像。然而，出行行为取决于数值数据和城市影像所代表的因素，因此需要一个协同框架来将它们结合起来。本研究创建了一个具有交叉结构的深度混合模型的理论框架，包括一个混合运算器和一个行为预测器，从而将数值和影像数据整合到一个潜在空间中。从实证角度看，该框架被应用于使用芝加哥的MyDailyTravel调查作为数值输入和卫星图像作为影像输入来分析出行方式选择。我们发现，深度混合模型在使用我们的监督混合设计来预测聚合和细分出行行为时，胜过传统的需求模型和最近的深度学习。",
    "tldr": "该研究提出了一个深度混合模型框架，通过将数值数据和城市影像整合到一个潜在空间中，成功应用于分析出行方式选择，并在预测聚合和细分出行行为方面优于传统需求模型和深度学习方法。",
    "en_tdlr": "The study introduces a deep hybrid model framework that integrates numeric data and urban imagery into a latent space, successfully applied to analyze travel mode choice and outperforming traditional demand models and deep learning methods in predicting both aggregate and disaggregate travel behavior."
}