{
    "title": "Efficient Alternating Minimization Solvers for Wyner Multi-View Unsupervised Learning. (arXiv:2303.15866v1 [cs.IT])",
    "abstract": "In this work, we adopt Wyner common information framework for unsupervised multi-view representation learning. Within this framework, we propose two novel formulations that enable the development of computational efficient solvers based on the alternating minimization principle. The first formulation, referred to as the {\\em variational form}, enjoys a linearly growing complexity with the number of views and is based on a variational-inference tight surrogate bound coupled with a Lagrangian optimization objective function. The second formulation, i.e., the {\\em representational form}, is shown to include known results as special cases. Here, we develop a tailored version from the alternating direction method of multipliers (ADMM) algorithm for solving the resulting non-convex optimization problem. In the two cases, the convergence of the proposed solvers is established in certain relevant regimes. Furthermore, our empirical results demonstrate the effectiveness of the proposed methods ",
    "link": "http://arxiv.org/abs/2303.15866",
    "context": "Title: Efficient Alternating Minimization Solvers for Wyner Multi-View Unsupervised Learning. (arXiv:2303.15866v1 [cs.IT])\nAbstract: In this work, we adopt Wyner common information framework for unsupervised multi-view representation learning. Within this framework, we propose two novel formulations that enable the development of computational efficient solvers based on the alternating minimization principle. The first formulation, referred to as the {\\em variational form}, enjoys a linearly growing complexity with the number of views and is based on a variational-inference tight surrogate bound coupled with a Lagrangian optimization objective function. The second formulation, i.e., the {\\em representational form}, is shown to include known results as special cases. Here, we develop a tailored version from the alternating direction method of multipliers (ADMM) algorithm for solving the resulting non-convex optimization problem. In the two cases, the convergence of the proposed solvers is established in certain relevant regimes. Furthermore, our empirical results demonstrate the effectiveness of the proposed methods ",
    "path": "papers/23/03/2303.15866.json",
    "total_tokens": 871,
    "translated_title": "Wyner多视图无监督学习的高效交替最小化求解器",
    "translated_abstract": "在本文中，我们采用Wyner通用信息框架进行无监督的多视图表示学习。在这个框架内，我们提出了两种新的公式，使得可以基于交替最小化原则开发计算高效的求解器。第一种公式被称为“变分形式”，其复杂度随着视图数量的增加而线性增长，并基于变分推理紧束缚和拉格朗日优化目标函数。第二种公式，即“表现形式”，被证明包括已知结果的特殊情况。在这里，我们开发了一个定制版本的多重乘数交替方向算法（ADMM），用于解决由此产生的非凸优化问题。在两种情况下，所提出的求解器的收敛性在某些相关范围内得到了证明。此外，我们的实证结果证明了提出的方法的有效性。",
    "tldr": "本文提出了适用于Wyner多视图无监督学习的高效交替最小化求解器，包括变分形式和表现形式，通过多重乘数交替方向算法可以解决由此造成的非凸优化问题。"
}