{
    "title": "Edge Selection and Clustering for Federated Learning in Optical Inter-LEO Satellite Constellation. (arXiv:2303.16071v1 [cs.LG])",
    "abstract": "Low-Earth orbit (LEO) satellites have been prosperously deployed for various Earth observation missions due to its capability of collecting a large amount of image or sensor data. However, traditionally, the data training process is performed in the terrestrial cloud server, which leads to a high transmission overhead. With the recent development of LEO, it is more imperative to provide ultra-dense LEO constellation with enhanced on-board computation capability. Benefited from it, we have proposed a collaborative federated learning over LEO satellite constellation (FedLEO). We allocate the entire process on LEOs with low payload inter-satellite transmissions, whilst the low-delay terrestrial gateway server (GS) only takes care for initial signal controlling. The GS initially selects an LEO server, whereas its LEO clients are all determined by clustering mechanism and communication capability through the optical inter-satellite links (ISLs). The re-clustering of changing LEO server will",
    "link": "http://arxiv.org/abs/2303.16071",
    "context": "Title: Edge Selection and Clustering for Federated Learning in Optical Inter-LEO Satellite Constellation. (arXiv:2303.16071v1 [cs.LG])\nAbstract: Low-Earth orbit (LEO) satellites have been prosperously deployed for various Earth observation missions due to its capability of collecting a large amount of image or sensor data. However, traditionally, the data training process is performed in the terrestrial cloud server, which leads to a high transmission overhead. With the recent development of LEO, it is more imperative to provide ultra-dense LEO constellation with enhanced on-board computation capability. Benefited from it, we have proposed a collaborative federated learning over LEO satellite constellation (FedLEO). We allocate the entire process on LEOs with low payload inter-satellite transmissions, whilst the low-delay terrestrial gateway server (GS) only takes care for initial signal controlling. The GS initially selects an LEO server, whereas its LEO clients are all determined by clustering mechanism and communication capability through the optical inter-satellite links (ISLs). The re-clustering of changing LEO server will",
    "path": "papers/23/03/2303.16071.json",
    "total_tokens": 1087,
    "translated_title": "光学星间链路联合学习中的边缘选择和聚类",
    "translated_abstract": "由于低地球轨道 (LEO) 卫星可以收集大量的影像或传感器数据，因此已经被广泛用于各种地球观测任务。然而，传统上，数据训练过程是在地面云服务器上进行的，这导致了很高的传输开销。最近 LEO 的发展更迫切地需要提供具备增强的机载计算能力的超密集 LEO 卫星星座。基于此，我们提出了一种在 LEO 卫星星座上进行协作联合学习的方法 (FedLEO)。我们将整个过程都分配在具备低载荷星间传输的 LEO 上，而低时延的地面网关服务器 (GS) 仅负责初始信号控制。GS 首先选择一个 LEO 服务器，而其 LEO 客户端都通过聚类机制和光学星间链路(ISLs)的通信能力决定。更换 LEO 服务器时的重新聚类将触发新一轮的 LEO 客户端聚类，从而使 FedLEO 能够适应动态 LEO 星座。仿真结果表明，FedLEO 可以在不同的 LEO 星座设置下实现高效的学习性能。",
    "tldr": "FedLEO是一种在超密集LEO卫星星座上进行联合学习的方法，其在LEO上进行视频/数据传输和聚类，而低时延的地面网关服务器 (GS) 仅负责初始信号控制。随着LEO服务器的变化和重新聚类，FedLEO能够适应动态LEO星座并在不同的LEO星座设置下实现高效的学习性能。",
    "en_tdlr": "FedLEO is a collaborative federated learning method on ultra-dense LEO satellite constellation, with video/data transmission and clustering on LEO and only initial signal control by low-delay terrestrial gateway server (GS). With changing LEO server and re-clustering, FedLEO can accommodate dynamic LEO constellation and achieve high learning performance under different LEO constellation settings."
}