{
    "title": "Computer Assisted Proofs and Automated Methods in Mathematics Education. (arXiv:2303.10166v1 [math.HO])",
    "abstract": "This survey paper is an expanded version of an invited keynote at the ThEdu'22 workshop, August 2022, in Haifa (Israel). After a short introduction on the developments of CAS, DGS and other useful technologies, we show implications in Mathematics Education, and in the broader frame of STEAM Education. In particular, we discuss the transformation of Mathematics Education into exploration-discovery-conjecture-proof scheme, avoiding usage as a black box . This scheme fits well into the so-called 4 C's of 21st Century Education. Communication and Collaboration are emphasized not only between humans, but also between machines, and between man and machine. Specific characteristics of the outputs enhance the need of Critical Thinking. The usage of automated commands for exploration and discovery is discussed, with mention of limitations where they exist. We illustrate the topic with examples from parametric integrals (describing a \"cognitive neighborhood\" of a mathematical notion), plane geom",
    "link": "http://arxiv.org/abs/2303.10166",
    "context": "Title: Computer Assisted Proofs and Automated Methods in Mathematics Education. (arXiv:2303.10166v1 [math.HO])\nAbstract: This survey paper is an expanded version of an invited keynote at the ThEdu'22 workshop, August 2022, in Haifa (Israel). After a short introduction on the developments of CAS, DGS and other useful technologies, we show implications in Mathematics Education, and in the broader frame of STEAM Education. In particular, we discuss the transformation of Mathematics Education into exploration-discovery-conjecture-proof scheme, avoiding usage as a black box . This scheme fits well into the so-called 4 C's of 21st Century Education. Communication and Collaboration are emphasized not only between humans, but also between machines, and between man and machine. Specific characteristics of the outputs enhance the need of Critical Thinking. The usage of automated commands for exploration and discovery is discussed, with mention of limitations where they exist. We illustrate the topic with examples from parametric integrals (describing a \"cognitive neighborhood\" of a mathematical notion), plane geom",
    "path": "papers/23/03/2303.10166.json",
    "total_tokens": 1028,
    "translated_title": "计算辅助证明与数学教育中的自动化方法",
    "translated_abstract": "本调查论文是 ThEdu'22 研讨会的特邀主题演讲的扩展版本，于 2022 年 8 月在以色列海法举行。在简要介绍计算机代数系统、动态几何软件和其他有用技术的发展后，我们展示了其在数学教育和更广泛的 STEAM 教育框架中的影响。特别地，我们讨论了将数学教育转化为探索-发现-猜想-证明的方案，避免使用成为一个黑盒子。这种方案很好地符合 21 世纪教育所称的 4C，即创新、协作、批判性思维和沟通。强调了人与人、机器与机器、人与机器之间的交流与协作。对于输出的特定特征加强了批判性思维的需求。我们讨论了利用自动化命令进行探索和发现的方式，并提及其存在的局限性。我们用参数积分（描述数学概念的“认知领域”）、平面几何（引入自动化证明的“猜想不变量”概念）和代数操作的例子说明了这个主题。",
    "tldr": "本研究探讨了计算辅助证明和自动化方法在数学和STEAM教育中的应用，强调了探索-发现-猜想-证明方案与21世纪教育的关系，并提出了机器与人之间的交流与批判性思维的重要性。",
    "en_tdlr": "This survey paper discusses the application of computer-assisted proofs and automated methods in mathematics and STEAM education, emphasizes the relationship between the exploration-discovery-conjecture-proof scheme and 21st century education, and highlights the importance of communication and critical thinking between humans and machines."
}