{
    "title": "Integrating Image Features with Convolutional Sequence-to-sequence Network for Multilingual Visual Question Answering. (arXiv:2303.12671v1 [cs.CV])",
    "abstract": "Visual Question Answering (VQA) is a task that requires computers to give correct answers for the input questions based on the images. This task can be solved by humans with ease but is a challenge for computers. The VLSP2022-EVJVQA shared task carries the Visual Question Answering task in the multilingual domain on a newly released dataset: UIT-EVJVQA, in which the questions and answers are written in three different languages: English, Vietnamese and Japanese. We approached the challenge as a sequence-to-sequence learning task, in which we integrated hints from pre-trained state-of-the-art VQA models and image features with Convolutional Sequence-to-Sequence network to generate the desired answers. Our results obtained up to 0.3442 by F1 score on the public test set, 0.4210 on the private test set, and placed 3rd in the competition.",
    "link": "http://arxiv.org/abs/2303.12671",
    "context": "Title: Integrating Image Features with Convolutional Sequence-to-sequence Network for Multilingual Visual Question Answering. (arXiv:2303.12671v1 [cs.CV])\nAbstract: Visual Question Answering (VQA) is a task that requires computers to give correct answers for the input questions based on the images. This task can be solved by humans with ease but is a challenge for computers. The VLSP2022-EVJVQA shared task carries the Visual Question Answering task in the multilingual domain on a newly released dataset: UIT-EVJVQA, in which the questions and answers are written in three different languages: English, Vietnamese and Japanese. We approached the challenge as a sequence-to-sequence learning task, in which we integrated hints from pre-trained state-of-the-art VQA models and image features with Convolutional Sequence-to-Sequence network to generate the desired answers. Our results obtained up to 0.3442 by F1 score on the public test set, 0.4210 on the private test set, and placed 3rd in the competition.",
    "path": "papers/23/03/2303.12671.json",
    "total_tokens": 864,
    "translated_title": "基于卷积序列到序列网络将图像特征集成到多语言视觉问答中",
    "translated_abstract": "视觉问答(VQA)是一项要求计算机基于图像回答输入问题的任务。这个任务对人类来说很容易，但对计算机来说很具有挑战性。VLSP2022-EVJVQA共享任务在一个新发布的数据集UIT-EVJVQA中进行了多语言领域的VQA任务，其中问题和答案用三种不同语言编写：英语、越南语和日语。我们将这个挑战作为一个序列到序列的学习任务，通过将来自预训练的最先进的VQA模型和图像特征的提示与卷积序列到序列网络集成在一起来生成所需的答案。我们在公共测试集上获得了F1得分达到0.3442，在私有测试集上获得了0.4210的好成绩，并在比赛中取得了第三名。",
    "tldr": "该论文针对VLSP2022-EVJVQA共享任务提出了一种基于卷积序列到序列网络的方法，在多语言视觉问答中将预训练的VQA模型和图像特征集成，获得了很好的效果。",
    "en_tdlr": "This paper proposes a method based on convolutional sequence-to-sequence network that integrates pre-trained VQA models and image features in multilingual visual question answering, achieving good performance in the VLSP2022-EVJVQA shared task."
}