{
    "title": "Multi-Behavior Recommendation with Cascading Graph Convolution Networks. (arXiv:2303.15720v1 [cs.IR])",
    "abstract": "Multi-behavior recommendation, which exploits auxiliary behaviors (e.g., click and cart) to help predict users' potential interactions on the target behavior (e.g., buy), is regarded as an effective way to alleviate the data sparsity or cold-start issues in recommendation. Multi-behaviors are often taken in certain orders in real-world applications (e.g., click>cart>buy). In a behavior chain, a latter behavior usually exhibits a stronger signal of user preference than the former one does. Most existing multi-behavior models fail to capture such dependencies in a behavior chain for embedding learning. In this work, we propose a novel multi-behavior recommendation model with cascading graph convolution networks (named MB-CGCN). In MB-CGCN, the embeddings learned from one behavior are used as the input features for the next behavior's embedding learning after a feature transformation operation. In this way, our model explicitly utilizes the behavior dependencies in embedding learning. Exp",
    "link": "http://arxiv.org/abs/2303.15720",
    "context": "Title: Multi-Behavior Recommendation with Cascading Graph Convolution Networks. (arXiv:2303.15720v1 [cs.IR])\nAbstract: Multi-behavior recommendation, which exploits auxiliary behaviors (e.g., click and cart) to help predict users' potential interactions on the target behavior (e.g., buy), is regarded as an effective way to alleviate the data sparsity or cold-start issues in recommendation. Multi-behaviors are often taken in certain orders in real-world applications (e.g., click>cart>buy). In a behavior chain, a latter behavior usually exhibits a stronger signal of user preference than the former one does. Most existing multi-behavior models fail to capture such dependencies in a behavior chain for embedding learning. In this work, we propose a novel multi-behavior recommendation model with cascading graph convolution networks (named MB-CGCN). In MB-CGCN, the embeddings learned from one behavior are used as the input features for the next behavior's embedding learning after a feature transformation operation. In this way, our model explicitly utilizes the behavior dependencies in embedding learning. Exp",
    "path": "papers/23/03/2303.15720.json",
    "total_tokens": 893,
    "translated_title": "基于级联图卷积网络的多行为推荐",
    "translated_abstract": "多行为推荐利用辅助行为（例如点击和加入购物车）来帮助预测用户在目标行为（例如购买）上的潜在交互，被认为是缓解推荐系统数据稀疏或冷启动问题的有效方法。在现实应用中，多个行为通常按特定顺序进行（例如点击>加入购物车>购买）。在行为链中，后续行为通常比前面的行为展现出更强的用户偏好信号。现有的多行为模型大多未能抓住此类行为链中的依赖关系。为此，本文提出了一种基于级联图卷积网络的新型多行为推荐模型（称为MB-CGCN）。在MB-CGCN中，经过特征变换操作后，从一个行为学习到的嵌入被用作下一个行为嵌入学习的输入特征。这样，我们的模型明确地利用了嵌入学习中的行为依赖性。",
    "tldr": "本文提出了一种基于级联图卷积网络的多行为推荐模型，能够明确地利用行为链中的依赖关系，以缓解推荐系统数据稀疏或冷启动问题。",
    "en_tdlr": "This paper proposes a novel multi-behavior recommendation model with cascading graph convolution networks (MB-CGCN), which can explicitly utilize the dependencies in a behavior chain and alleviate the data sparsity or cold-start issues in recommendation systems."
}