{
    "title": "One-4-All: Neural Potential Fields for Embodied Navigation. (arXiv:2303.04011v2 [cs.RO] CROSS LISTED)",
    "abstract": "A fundamental task in robotics is to navigate between two locations. In particular, real-world navigation can require long-horizon planning using high-dimensional RGB images, which poses a substantial challenge for end-to-end learning-based approaches. Current semi-parametric methods instead achieve long-horizon navigation by combining learned modules with a topological memory of the environment, often represented as a graph over previously collected images. However, using these graphs in practice typically involves tuning a number of pruning heuristics to avoid spurious edges, limit runtime memory usage and allow reasonably fast graph queries. In this work, we present One-4-All (O4A), a method leveraging self-supervised and manifold learning to obtain a graph-free, end-to-end navigation pipeline in which the goal is specified as an image. Navigation is achieved by greedily minimizing a potential function defined continuously over the O4A latent space. Our system is trained offline on ",
    "link": "http://arxiv.org/abs/2303.04011",
    "context": "Title: One-4-All: Neural Potential Fields for Embodied Navigation. (arXiv:2303.04011v2 [cs.RO] CROSS LISTED)\nAbstract: A fundamental task in robotics is to navigate between two locations. In particular, real-world navigation can require long-horizon planning using high-dimensional RGB images, which poses a substantial challenge for end-to-end learning-based approaches. Current semi-parametric methods instead achieve long-horizon navigation by combining learned modules with a topological memory of the environment, often represented as a graph over previously collected images. However, using these graphs in practice typically involves tuning a number of pruning heuristics to avoid spurious edges, limit runtime memory usage and allow reasonably fast graph queries. In this work, we present One-4-All (O4A), a method leveraging self-supervised and manifold learning to obtain a graph-free, end-to-end navigation pipeline in which the goal is specified as an image. Navigation is achieved by greedily minimizing a potential function defined continuously over the O4A latent space. Our system is trained offline on ",
    "path": "papers/23/03/2303.04011.json",
    "total_tokens": 963,
    "translated_title": "一招鲜：神经潜力场用于实体导航",
    "translated_abstract": "机器人的基本任务之一是在两个位置之间导航。特别地，真实世界的导航可能需要使用高维RGB图像进行长期规划，这对于端到端的学习方法构成了重大挑战。目前的半参数方法通过将学习模块与环境的拓扑记忆相结合来实现长期规划，通常使用以先前收集的图像为基础的图形表示。然而，实际上使用这些图表通常需要调整大量的修剪启发式方法，以避免虚假的边缘，限制运行时内存使用并允许相当快速的图形查询。在这项工作中，我们提出了One-4-All（O4A），一种利用自我监督和流形学习来获得无图形、端到端导航管道的方法，其中目标被指定为一幅图像。导航通过贪婪地最小化连续定义在O4A潜在空间上的潜力函数来实现。我们的系统是离线训练的。",
    "tldr": "本文提出了一种新方法 One-4-All (O4A)，利用自我监督和流形学习，实现了一种无图形、端到端的导航程序。其通过贪婪最小化潜在空间内的潜力函数来进行导航，在真实世界的导航中具有重要应用价值。",
    "en_tdlr": "This paper presents a novel approach One-4-All(O4A) which leverages self-supervised and manifold learning to obtain a graph-free, end-to-end navigation pipeline. Navigation is achieved by greedily minimizing a potential function defined continuously over the O4A latent space. O4A has significant practical relevance for real-world navigation tasks."
}