{
    "title": "Panoptic One-Click Segmentation: Applied to Agricultural Data. (arXiv:2303.08689v1 [cs.CV])",
    "abstract": "In weed control, precision agriculture can help to greatly reduce the use of herbicides, resulting in both economical and ecological benefits. A key element is the ability to locate and segment all the plants from image data. Modern instance segmentation techniques can achieve this, however, training such systems requires large amounts of hand-labelled data which is expensive and laborious to obtain. Weakly supervised training can help to greatly reduce labelling efforts and costs. We propose panoptic one-click segmentation, an efficient and accurate offline tool to produce pseudo-labels from click inputs which reduces labelling effort. Our approach jointly estimates the pixel-wise location of all N objects in the scene, compared to traditional approaches which iterate independently through all N objects; this greatly reduces training time. Using just 10% of the data to train our panoptic one-click segmentation approach yields 68.1% and 68.8% mean object intersection over union (IoU) o",
    "link": "http://arxiv.org/abs/2303.08689",
    "context": "Title: Panoptic One-Click Segmentation: Applied to Agricultural Data. (arXiv:2303.08689v1 [cs.CV])\nAbstract: In weed control, precision agriculture can help to greatly reduce the use of herbicides, resulting in both economical and ecological benefits. A key element is the ability to locate and segment all the plants from image data. Modern instance segmentation techniques can achieve this, however, training such systems requires large amounts of hand-labelled data which is expensive and laborious to obtain. Weakly supervised training can help to greatly reduce labelling efforts and costs. We propose panoptic one-click segmentation, an efficient and accurate offline tool to produce pseudo-labels from click inputs which reduces labelling effort. Our approach jointly estimates the pixel-wise location of all N objects in the scene, compared to traditional approaches which iterate independently through all N objects; this greatly reduces training time. Using just 10% of the data to train our panoptic one-click segmentation approach yields 68.1% and 68.8% mean object intersection over union (IoU) o",
    "path": "papers/23/03/2303.08689.json",
    "total_tokens": 886,
    "translated_title": "全景式一键分割：应用于农业数据",
    "translated_abstract": "在杂草控制方面，精准农业可以帮助大大减少除草剂的使用，从而产生经济和生态效益。其中一个关键因素是能够从图像数据中定位和分割所有植物。现代实例分割技术可以实现这一点，但是训练这样的系统需要大量手工标记的数据，这是昂贵且费力的。弱监督训练可以大大减少标记工作和成本。我们提出了全景式一键分割，这是一种高效准确的离线工具，可以从点击输入中产生伪标签，从而减少标记工作量。与传统方法独立迭代所有N个对象相比，我们的方法联合估计了N个对象场景中每个像素的位置，从而大大减少了训练时间。只使用10％的数据来训练我们的全景式一键分割方法，即可获得68.1％和68.8％的平均目标交集联合（IoU）。",
    "tldr": "本研究提出了一种全景式一键分割方法，允许从点击输入中以高效准确的方式产生伪标签，用于训练实例分割模型，从而大大减少了标记工作和成本。",
    "en_tdlr": "This paper proposes a panoptic one-click segmentation approach that allows efficient and accurate pseudo-labeling from click inputs for training instance segmentation models, greatly reducing labeling efforts and costs."
}