{
    "title": "TLAG: An Informative Trigger and Label-Aware Knowledge Guided Model for Dialogue-based Relation Extraction. (arXiv:2303.17119v1 [cs.CL])",
    "abstract": "Dialogue-based Relation Extraction (DRE) aims to predict the relation type of argument pairs that are mentioned in dialogue. The latest trigger-enhanced methods propose trigger prediction tasks to promote DRE. However, these methods are not able to fully leverage the trigger information and even bring noise to relation extraction. To solve these problems, we propose TLAG, which fully leverages the trigger and label-aware knowledge to guide the relation extraction. First, we design an adaptive trigger fusion module to fully leverage the trigger information. Then, we introduce label-aware knowledge to further promote our model's performance. Experimental results on the DialogRE dataset show that our TLAG outperforms the baseline models, and detailed analyses demonstrate the effectiveness of our approach.",
    "link": "http://arxiv.org/abs/2303.17119",
    "context": "Title: TLAG: An Informative Trigger and Label-Aware Knowledge Guided Model for Dialogue-based Relation Extraction. (arXiv:2303.17119v1 [cs.CL])\nAbstract: Dialogue-based Relation Extraction (DRE) aims to predict the relation type of argument pairs that are mentioned in dialogue. The latest trigger-enhanced methods propose trigger prediction tasks to promote DRE. However, these methods are not able to fully leverage the trigger information and even bring noise to relation extraction. To solve these problems, we propose TLAG, which fully leverages the trigger and label-aware knowledge to guide the relation extraction. First, we design an adaptive trigger fusion module to fully leverage the trigger information. Then, we introduce label-aware knowledge to further promote our model's performance. Experimental results on the DialogRE dataset show that our TLAG outperforms the baseline models, and detailed analyses demonstrate the effectiveness of our approach.",
    "path": "papers/23/03/2303.17119.json",
    "total_tokens": 802,
    "translated_title": "TLAG: 一种信息触发器和标签感知知识引导模型用于基于对话的关系抽取",
    "translated_abstract": "基于对话的关系抽取（DRE）旨在预测在对话中提到的参数对的关系类型。最新的触发器增强方法提出了触发器预测任务以促进DRE。然而，这些方法不能充分利用触发器信息，甚至会给关系抽取带来噪声。为了解决这些问题，我们提出了TLAG，它充分利用触发器和标签感知知识来引导关系抽取。首先，我们设计了一个自适应触发器融合模块来充分利用触发器信息。然后，我们引入了标签感知知识，进一步提升了模型的性能。在DialogRE数据集上的实验结果表明，我们的TLAG优于基准模型，并且详细的分析表明了我们方法的有效性。",
    "tldr": "TLAG是一种信息触发器和标签感知知识引导模型，通过充分利用触发器和标签信息以及引入标签感知知识来促进基于对话的关系抽取。",
    "en_tdlr": "TLAG is an informative trigger and label-aware knowledge guided model for dialogue-based relation extraction, which fully leverages the trigger and label information as well as introduces label-aware knowledge to promote the task."
}