{
    "title": "Guided Transfer Learning. (arXiv:2303.16154v1 [cs.LG])",
    "abstract": "Machine learning requires exuberant amounts of data and computation. Also, models require equally excessive growth in the number of parameters. It is, therefore, sensible to look for technologies that reduce these demands on resources. Here, we propose an approach called guided transfer learning. Each weight and bias in the network has its own guiding parameter that indicates how much this parameter is allowed to change while learning a new task. Guiding parameters are learned during an initial scouting process. Guided transfer learning can result in a reduction in resources needed to train a network. In some applications, guided transfer learning enables the network to learn from a small amount of data. In other cases, a network with a smaller number of parameters can learn a task which otherwise only a larger network could learn. Guided transfer learning potentially has many applications when the amount of data, model size, or the availability of computational resources reach their l",
    "link": "http://arxiv.org/abs/2303.16154",
    "context": "Title: Guided Transfer Learning. (arXiv:2303.16154v1 [cs.LG])\nAbstract: Machine learning requires exuberant amounts of data and computation. Also, models require equally excessive growth in the number of parameters. It is, therefore, sensible to look for technologies that reduce these demands on resources. Here, we propose an approach called guided transfer learning. Each weight and bias in the network has its own guiding parameter that indicates how much this parameter is allowed to change while learning a new task. Guiding parameters are learned during an initial scouting process. Guided transfer learning can result in a reduction in resources needed to train a network. In some applications, guided transfer learning enables the network to learn from a small amount of data. In other cases, a network with a smaller number of parameters can learn a task which otherwise only a larger network could learn. Guided transfer learning potentially has many applications when the amount of data, model size, or the availability of computational resources reach their l",
    "path": "papers/23/03/2303.16154.json",
    "total_tokens": 880,
    "translated_title": "引导迁移学习",
    "translated_abstract": "机器学习需要大量数据与计算。此外，模型还需要相对应的参数数量增长。因此，寻找减少资源需求的技术是明智的。本文提出了一种称为引导迁移学习的方法。网络中的每个权重和偏置都有自己的引导参数，指示在学习新任务时该参数允许改变多少。引导参数是在初始探索过程中学习的。引导迁移学习可以减少训练网络所需的资源。在一些应用中，引导迁移学习能够使网络从少量数据中学习。在其他情况下，一个具有较少参数的网络可以学习一个原本只有一个较大的网络才能学习的任务。当数据量、模型大小或计算资源的可用性达到极限时，引导迁移学习可能具有许多应用。",
    "tldr": "提出了一种称为引导迁移学习的方法，在初始探索过程中学习每个网络参数的引导参数，从而在训练网络时减少资源需求。这种方法可以使网络从少量数据中学习，并让具有较少参数的网络学习一个原本只有一个较大的网络才能学习的任务。",
    "en_tdlr": "Proposed guided transfer learning method, where guiding parameters for each network parameter are learned during an initial scouting process, to reduce resource demands when training networks. This method enables networks to learn from a small amount of data and allows networks with fewer parameters to learn tasks previously only achievable by larger networks, potentially useful when data, model size, or computational resources are limited."
}