{
    "title": "Optimal investment in ambiguous financial markets with learning. (arXiv:2303.08521v1 [q-fin.PM])",
    "abstract": "We consider the classical multi-asset Merton investment problem under drift uncertainty, i.e. the asset price dynamics are given by geometric Brownian motions with constant but unknown drift coefficients. The investor assumes a prior drift distribution and is able to learn by observing the asset prize realizations during the investment horizon. While the solution of an expected utility maximizing investor with constant relative risk aversion (CRRA) is well known, we consider the optimization problem under risk and ambiguity preferences by means of the KMM (Klibanoff et al. (2005)) approach. Here, the investor maximizes a double certainty equivalent. The inner certainty equivalent is for given drift coefficient, the outer is based on a drift distribution. Assuming also a CRRA type ambiguity function, it turns out that the optimal strategy can be stated in terms of the solution without ambiguity preferences but an adjusted drift distribution. To the best of our knowledge an explicit solu",
    "link": "http://arxiv.org/abs/2303.08521",
    "context": "Title: Optimal investment in ambiguous financial markets with learning. (arXiv:2303.08521v1 [q-fin.PM])\nAbstract: We consider the classical multi-asset Merton investment problem under drift uncertainty, i.e. the asset price dynamics are given by geometric Brownian motions with constant but unknown drift coefficients. The investor assumes a prior drift distribution and is able to learn by observing the asset prize realizations during the investment horizon. While the solution of an expected utility maximizing investor with constant relative risk aversion (CRRA) is well known, we consider the optimization problem under risk and ambiguity preferences by means of the KMM (Klibanoff et al. (2005)) approach. Here, the investor maximizes a double certainty equivalent. The inner certainty equivalent is for given drift coefficient, the outer is based on a drift distribution. Assuming also a CRRA type ambiguity function, it turns out that the optimal strategy can be stated in terms of the solution without ambiguity preferences but an adjusted drift distribution. To the best of our knowledge an explicit solu",
    "path": "papers/23/03/2303.08521.json",
    "total_tokens": 957,
    "translated_title": "具有学习能力的不确定金融市场中的最优投资",
    "translated_abstract": "本研究考虑传统的多资产Merton投资问题，其价格动态由具有恒定但未知漂移系数的几何布朗运动给出。投资者假设漂移分布，并通过观察投资期内资产价格实现情况来学习。研究者采用KMM方法考虑了在风险和模糊偏好下的优化问题。在此处，投资者最大化一个双重确定性等价值。内在确定性等价值是基于给定漂移系数的，而外部确定性等价值是基于漂移分布的。假设也有CRRA类型的模糊函数，结果表明，最优策略可以用不带模糊偏好的解决方案来表述，但要调整漂移分布。据我们所知，对于这个具有学习能力的经典Merton问题的模糊情形，尚未在文献中得出显式解决方案。",
    "tldr": "本研究考虑了具有学习能力的不确定金融市场中的投资问题，并采用KMM方法考虑了在风险和模糊偏好下的优化问题。最优策略可以用不带模糊偏好的解决方案来表述，但要调整漂移分布。",
    "en_tdlr": "This study considers the investment problem in uncertain financial markets with learning and applies the KMM approach to optimize under risk and ambiguity preferences. It is found that the optimal strategy can be expressed in terms of the solution without ambiguity preferences but an adjusted drift distribution. To the best of our knowledge, an explicit solution for this classic Merton problem with learning under ambiguity has not been derived in literature."
}