{
    "title": "Verifying Properties of Tsetlin Machines. (arXiv:2303.14464v1 [cs.LG])",
    "abstract": "Tsetlin Machines (TsMs) are a promising and interpretable machine learning method which can be applied for various classification tasks. We present an exact encoding of TsMs into propositional logic and formally verify properties of TsMs using a SAT solver. In particular, we introduce in this work a notion of similarity of machine learning models and apply our notion to check for similarity of TsMs. We also consider notions of robustness and equivalence from the literature and adapt them for TsMs. Then, we show the correctness of our encoding and provide results for the properties: adversarial robustness, equivalence, and similarity of TsMs. In our experiments, we employ the MNIST and IMDB datasets for (respectively) image and sentiment classification. We discuss the results for verifying robustness obtained with TsMs with those in the literature obtained with Binarized Neural Networks on MNIST.",
    "link": "http://arxiv.org/abs/2303.14464",
    "context": "Title: Verifying Properties of Tsetlin Machines. (arXiv:2303.14464v1 [cs.LG])\nAbstract: Tsetlin Machines (TsMs) are a promising and interpretable machine learning method which can be applied for various classification tasks. We present an exact encoding of TsMs into propositional logic and formally verify properties of TsMs using a SAT solver. In particular, we introduce in this work a notion of similarity of machine learning models and apply our notion to check for similarity of TsMs. We also consider notions of robustness and equivalence from the literature and adapt them for TsMs. Then, we show the correctness of our encoding and provide results for the properties: adversarial robustness, equivalence, and similarity of TsMs. In our experiments, we employ the MNIST and IMDB datasets for (respectively) image and sentiment classification. We discuss the results for verifying robustness obtained with TsMs with those in the literature obtained with Binarized Neural Networks on MNIST.",
    "path": "papers/23/03/2303.14464.json",
    "total_tokens": 891,
    "translated_title": "Tsetlin机器的性质验证",
    "translated_abstract": "Tsetlin机器（TsMs）是一种有前途且易于解释的机器学习方法，可应用于各种分类任务。我们将TsMs精确编码为命题逻辑并使用SAT求解器正式验证了TsMs的性质。特别地，在这项工作中，我们引入了一种机器学习模型相似性的概念，并将我们的概念应用于检查TsMs的相似性。我们还考虑了文献中的鲁棒性和等价性概念，并为TsMs重新调整了它们。然后，我们展示了我们编码的正确性，并为TsMs的性质——对抗鲁棒性，等价性和相似性提供结果。在我们的实验中，我们分别应用MNIST和IMDB数据集进行图像和情感分类。我们将使用TsMs检查对抗性鲁棒性的结果与文献中在MNIST上使用二进制神经网络获得的结果进行讨论。",
    "tldr": "该论文介绍了一种对Tsetlin Machine进行正式验证性质的方法，并展示了对抗性鲁棒性、等价性和相似性方面的结果。此外，还将新的模型相似性概念应用于TsMs。",
    "en_tdlr": "This paper presents a method for formally verifying properties of Tsetlin Machines (TsMs) and shows results for adversarial robustness, equivalence, and similarity of TsMs. It also introduces a new notion of machine learning model similarity and applies it to TsMs. Additionally, the paper adapts existing notions of robustness and equivalence for TsMs and discusses the results in comparison to those from Binarized Neural Networks on MNIST."
}