{
    "title": "Intention-Aware Decision-Making for Mixed Intersection Scenarios. (arXiv:2303.17493v1 [cs.AI])",
    "abstract": "This paper presents a white-box intention-aware decision-making for the handling of interactions between a pedestrian and an automated vehicle (AV) in an unsignalized street crossing scenario. Moreover, a design framework has been developed, which enables automated parameterization of the decision-making. This decision-making is designed in such a manner that it can understand pedestrians in urban traffic and can react accordingly to their intentions. That way, a human-like response to the actions of the pedestrian is ensured, leading to a higher acceptance of AVs. The core notion of this paper is that the intention prediction of the pedestrian to cross the street and decision-making are divided into two subsystems. On the one hand, the intention detection is a data-driven, black-box model. Thus, it can model the complex behavior of the pedestrians. On the other hand, the decision-making is a white-box model to ensure traceability and to enable a rapid verification and validation of AV",
    "link": "http://arxiv.org/abs/2303.17493",
    "context": "Title: Intention-Aware Decision-Making for Mixed Intersection Scenarios. (arXiv:2303.17493v1 [cs.AI])\nAbstract: This paper presents a white-box intention-aware decision-making for the handling of interactions between a pedestrian and an automated vehicle (AV) in an unsignalized street crossing scenario. Moreover, a design framework has been developed, which enables automated parameterization of the decision-making. This decision-making is designed in such a manner that it can understand pedestrians in urban traffic and can react accordingly to their intentions. That way, a human-like response to the actions of the pedestrian is ensured, leading to a higher acceptance of AVs. The core notion of this paper is that the intention prediction of the pedestrian to cross the street and decision-making are divided into two subsystems. On the one hand, the intention detection is a data-driven, black-box model. Thus, it can model the complex behavior of the pedestrians. On the other hand, the decision-making is a white-box model to ensure traceability and to enable a rapid verification and validation of AV",
    "path": "papers/23/03/2303.17493.json",
    "total_tokens": 871,
    "translated_title": "混合路口场景中的意图感知决策制定",
    "translated_abstract": "本文提出了面向白盒的意图感知决策制定，用于处理未信号化的道路交叉口场景下的行人和自动驾驶车辆（AV）之间的交互。此外，还开发了一个设计框架，可以自动参数化决策制定。该决策制定被设计为能够理解城市交通中的行人，并能根据他们的意图做出反应。这样可以确保对行人动作的类人反应，从而提高AV的接受度。本文的核心概念是将行人的意图预测和决策制定划分为两个子系统。一方面，意图检测是一个基于数据驱动的黑盒模型，因此它可以模拟行人的复杂行为。另一方面，决策制定是一个白盒模型，以确保可追踪性，并启用AV的快速验证和验证。",
    "tldr": "本文提出了一种适用于城市交通的混合路口的白盒意图感知决策制定框架，用于处理行人和自动驾驶车辆之间的交互，以提高AV的接受度。",
    "en_tdlr": "A white-box intention-aware decision-making framework for mixed intersection scenarios is proposed in this paper, which is designed for handling interactions between pedestrians and automated vehicles in urban traffic to improve the acceptance of AVs."
}