{
    "title": "Economics of In-Space Industry and Competitiveness of Lunar-Derived Rocket Propellant. (arXiv:2303.09011v1 [econ.GN])",
    "abstract": "Economic parameters are identified for an in-space industry where the capital is made on one planet, it is transported to and teleoperated on a second planet, and the product is transported off the second planet for consumption. This framework is used to model the long-run cost of lunar propellant production to help answer whether it is commercially competitive against propellant launched from Earth. The prior techno-economic analyses (TEAs) of lunar propellant production had disagreed over this. The \"gear ratio on cost\" for capital transport, G, and the production mass ratio of the capital, phi, are identified as the most important factors determining competitiveness. The prior TEAs are examined for how they handled these two metrics. This identifies crucial mistakes in some of the TEAs: choosing transportation architectures with high G, and neglecting to make choices for the capital that could achieve adequate phi. The tent sublimation technology has a value of phi that is an order o",
    "link": "http://arxiv.org/abs/2303.09011",
    "context": "Title: Economics of In-Space Industry and Competitiveness of Lunar-Derived Rocket Propellant. (arXiv:2303.09011v1 [econ.GN])\nAbstract: Economic parameters are identified for an in-space industry where the capital is made on one planet, it is transported to and teleoperated on a second planet, and the product is transported off the second planet for consumption. This framework is used to model the long-run cost of lunar propellant production to help answer whether it is commercially competitive against propellant launched from Earth. The prior techno-economic analyses (TEAs) of lunar propellant production had disagreed over this. The \"gear ratio on cost\" for capital transport, G, and the production mass ratio of the capital, phi, are identified as the most important factors determining competitiveness. The prior TEAs are examined for how they handled these two metrics. This identifies crucial mistakes in some of the TEAs: choosing transportation architectures with high G, and neglecting to make choices for the capital that could achieve adequate phi. The tent sublimation technology has a value of phi that is an order o",
    "path": "papers/23/03/2303.09011.json",
    "total_tokens": 990,
    "translated_title": "太空经济学和月球衍生推进剂竞争力",
    "translated_abstract": "本文分析了一种在两个星球间进行的太空产业的经济参数，资本在第一个星球上制造，运往第二个星球上进行远程操作，产品再被运输离开第二个星球进行消费。运用这一框架，对月球推进剂生产的长期成本进行建模，以回答它是否与从地球发射的推进剂具有商业竞争力。之前的技术经济分析在这一问题上存在分歧。资本运输的成本比例和资本生产的产量比被确定为决定竞争力的最重要因素。分析了之前的技术经济分析如何处理这两个指标。指出了一些技术经济分析中的关键错误：选择具有高成本比例的运输架构，并忽略了可以实现足够产量比的资本选择。帐篷升华技术的产量比值接近1。",
    "tldr": "本文通过分析运用太空经济学框架对月球推进剂生产的长期成本进行建模，研究对比从地球发射的推进剂是否具有商业竞争力，结果发现运输成本比和资本产量比是决定竞争力的重要因素，而之前分析结果的分歧是由于选择高成本比例的运输架构和忽略提高资本产量比的关键因素造成的。",
    "en_tdlr": "This article uses the framework of space economics to model the long-term cost of lunar propellant production and investigate its commercial competitiveness against propellant launched from Earth. The results show that the gear ratio on cost for capital transport and the production mass ratio of the capital are the most important factors determining competitiveness, and previous analyses had disagreements due to the choice of high-cost transportation architectures and neglecting the key factors to increase capital production mass ratio."
}