{
    "title": "Orthogonal Directions Constrained Gradient Method: from non-linear equality constraints to Stiefel manifold. (arXiv:2303.09261v1 [math.OC])",
    "abstract": "We consider the problem of minimizing a non-convex function over a smooth manifold $\\mathcal{M}$. We propose a novel algorithm, the Orthogonal Directions Constrained Gradient Method (ODCGM) which only requires computing a projection onto a vector space. ODCGM is infeasible but the iterates are constantly pulled towards the manifold, ensuring the convergence of ODCGM towards $\\mathcal{M}$. ODCGM is much simpler to implement than the classical methods which require the computation of a retraction. Moreover, we show that ODCGM exhibits the near-optimal oracle complexities $\\mathcal{O}(1/\\varepsilon^2)$ and $\\mathcal{O}(1/\\varepsilon^4)$ in the deterministic and stochastic cases, respectively. Furthermore, we establish that, under an appropriate choice of the projection metric, our method recovers the landing algorithm of Ablin and Peyr\\'e (2022), a recently introduced algorithm for optimization over the Stiefel manifold. As a result, we significantly extend the analysis of Ablin and Peyr\\",
    "link": "http://arxiv.org/abs/2303.09261",
    "context": "Title: Orthogonal Directions Constrained Gradient Method: from non-linear equality constraints to Stiefel manifold. (arXiv:2303.09261v1 [math.OC])\nAbstract: We consider the problem of minimizing a non-convex function over a smooth manifold $\\mathcal{M}$. We propose a novel algorithm, the Orthogonal Directions Constrained Gradient Method (ODCGM) which only requires computing a projection onto a vector space. ODCGM is infeasible but the iterates are constantly pulled towards the manifold, ensuring the convergence of ODCGM towards $\\mathcal{M}$. ODCGM is much simpler to implement than the classical methods which require the computation of a retraction. Moreover, we show that ODCGM exhibits the near-optimal oracle complexities $\\mathcal{O}(1/\\varepsilon^2)$ and $\\mathcal{O}(1/\\varepsilon^4)$ in the deterministic and stochastic cases, respectively. Furthermore, we establish that, under an appropriate choice of the projection metric, our method recovers the landing algorithm of Ablin and Peyr\\'e (2022), a recently introduced algorithm for optimization over the Stiefel manifold. As a result, we significantly extend the analysis of Ablin and Peyr\\",
    "path": "papers/23/03/2303.09261.json",
    "total_tokens": 1094,
    "translated_title": "正交方向约束梯度法：从非线性等式约束到Stiefel流形",
    "translated_abstract": "本文考虑在光滑流形 $\\mathcal{M}$ 上最小化一个非凸函数的问题。我们提出了一种新的算法——正交方向约束梯度法(ODCGM)，该算法只需要计算向量空间上的投影。ODCGM虽然不可行，但迭代过程始终被拉向流形，确保了ODCGM收敛到 $\\mathcal{M}$。相比需要计算收缩算子的传统方法，ODCGM的实现要简单得多。此外，我们证明了ODCGM在确定性和随机情况下具有近似最优的误差复杂度，分别为 $\\mathcal{O}(1/\\varepsilon^2)$ 和 $\\mathcal{O}(1/\\varepsilon^4)$。此外，我们还证明，在适当选择投影度量的情况下，我们的方法可以恢复出Ablin 和 Peyr\\'e (2022)的Landing算法，后者是一种最近用于优化Stiefel流形的算法。因此，我们显著扩展了Ablin 和 Peyr\\'e的分析。",
    "tldr": "提出了一种新的算法——ODCGM，可以优化在光滑流形上最小化非凸函数的问题。算法的实现要简单得多，并且在确定性和随机情况下具有近似最优的误差复杂度。此外，我们还证明，在适当选择投影度量的情况下，方法可以恢复出Ablin 和 Peyr\\'e (2022)的Landing算法，后者是一种最近用于优化Stiefel流形的算法。",
    "en_tdlr": "A novel algorithm, ODCGM, is proposed for minimizing a non-convex function over a smooth manifold $\\mathcal{M}$. The algorithm only requires computing a projection onto a vector space and its iterates are constantly pulled towards the manifold, ensuring convergence towards $\\mathcal{M}$. ODCGM has near-optimal oracle complexities in the deterministic and stochastic cases. Additionally, it is shown that, under an appropriate choice of the projection metric, ODCGM recovers the Landing algorithm of Ablin and Peyr\\'e, a recently introduced algorithm for optimization over the Stiefel manifold."
}