{
    "title": "Explainable Intrusion Detection Systems Using Competitive Learning Techniques. (arXiv:2303.17387v1 [cs.CR])",
    "abstract": "The current state of the art systems in Artificial Intelligence (AI) enabled intrusion detection use a variety of black box methods. These black box methods are generally trained using Error Based Learning (EBL) techniques with a focus on creating accurate models. These models have high performative costs and are not easily explainable. A white box Competitive Learning (CL) based eXplainable Intrusion Detection System (X-IDS) offers a potential solution to these problem. CL models utilize an entirely different learning paradigm than EBL approaches. This different learning process makes the CL family of algorithms innately explainable and less resource intensive. In this paper, we create an X-IDS architecture that is based on DARPA's recommendation for explainable systems. In our architecture we leverage CL algorithms like, Self Organizing Maps (SOM), Growing Self Organizing Maps (GSOM), and Growing Hierarchical Self Organizing Map (GHSOM). The resulting models can be data-mined to crea",
    "link": "http://arxiv.org/abs/2303.17387",
    "context": "Title: Explainable Intrusion Detection Systems Using Competitive Learning Techniques. (arXiv:2303.17387v1 [cs.CR])\nAbstract: The current state of the art systems in Artificial Intelligence (AI) enabled intrusion detection use a variety of black box methods. These black box methods are generally trained using Error Based Learning (EBL) techniques with a focus on creating accurate models. These models have high performative costs and are not easily explainable. A white box Competitive Learning (CL) based eXplainable Intrusion Detection System (X-IDS) offers a potential solution to these problem. CL models utilize an entirely different learning paradigm than EBL approaches. This different learning process makes the CL family of algorithms innately explainable and less resource intensive. In this paper, we create an X-IDS architecture that is based on DARPA's recommendation for explainable systems. In our architecture we leverage CL algorithms like, Self Organizing Maps (SOM), Growing Self Organizing Maps (GSOM), and Growing Hierarchical Self Organizing Map (GHSOM). The resulting models can be data-mined to crea",
    "path": "papers/23/03/2303.17387.json",
    "total_tokens": 889,
    "translated_title": "使用竞争学习技术的可解释入侵检测系统",
    "translated_abstract": "当前，人工智能（AI）启用的入侵检测系统采用各种黑匣子方法。这些黑匣子方法通常使用基于错误学习（EBL）技术进行训练，并专注于创建准确的模型。这些模型具有高性能成本且不易解释。基于竞争学习（CL）的白盒可解释入侵检测系统（X-IDS）为这些问题提供了潜在解决方案。CL模型利用与EBL方法完全不同的学习范式。这种不同的学习过程使得CL算法族固有地可解释且资源消耗较小。在本文中，我们创建了一个基于DARPA对可解释系统的建议的X-IDS架构。在我们的架构中，我们利用像自组织映射（SOM）、增长式自组织映射（GSOM）和增长式分层自组织映射（GHSOM）等CL算法。生成的模型可以进行数据挖掘以创建可解释的规则。",
    "tldr": "本文提出一种基于竞争学习算法的白盒可解释入侵检测系统，与黑匣子方法相比，能够提供更为可解释的模型，且资源消耗较小。",
    "en_tdlr": "This paper proposes a white box explainable intrusion detection system based on competitive learning algorithms, which can provide more explainable models with less resource consumption compared to black box methods."
}