{
    "title": "Learning Human-to-Robot Handovers from Point Clouds. (arXiv:2303.17592v1 [cs.RO])",
    "abstract": "We propose the first framework to learn control policies for vision-based human-to-robot handovers, a critical task for human-robot interaction. While research in Embodied AI has made significant progress in training robot agents in simulated environments, interacting with humans remains challenging due to the difficulties of simulating humans. Fortunately, recent research has developed realistic simulated environments for human-to-robot handovers. Leveraging this result, we introduce a method that is trained with a human-in-the-loop via a two-stage teacher-student framework that uses motion and grasp planning, reinforcement learning, and self-supervision. We show significant performance gains over baselines on a simulation benchmark, sim-to-sim transfer and sim-to-real transfer.",
    "link": "http://arxiv.org/abs/2303.17592",
    "context": "Title: Learning Human-to-Robot Handovers from Point Clouds. (arXiv:2303.17592v1 [cs.RO])\nAbstract: We propose the first framework to learn control policies for vision-based human-to-robot handovers, a critical task for human-robot interaction. While research in Embodied AI has made significant progress in training robot agents in simulated environments, interacting with humans remains challenging due to the difficulties of simulating humans. Fortunately, recent research has developed realistic simulated environments for human-to-robot handovers. Leveraging this result, we introduce a method that is trained with a human-in-the-loop via a two-stage teacher-student framework that uses motion and grasp planning, reinforcement learning, and self-supervision. We show significant performance gains over baselines on a simulation benchmark, sim-to-sim transfer and sim-to-real transfer.",
    "path": "papers/23/03/2303.17592.json",
    "total_tokens": 873,
    "translated_title": "基于点云的人机交互机器人递送控制方法学习",
    "translated_abstract": "我们提出了第一个学习基于视觉的人机交互机器人递送控制方法的框架，这是一个关键的任务。虽然在具身化人工智能研究中，在模拟环境中训练机器人代理取得了显著进展，但由于模拟人类的困难而与人交互仍然具有挑战性。幸运的是，最近的研究已经开发出逼真的人机交互机器人递送的模拟环境。利用这一结果，我们介绍了一种方法，该方法通过两阶段的教师-学生框架进行人机交互训练，使用运动和抓握规划、强化学习和自监督。我们在模拟基准、模拟到模拟转移和模拟到真实转移中展示了显著的性能提升。",
    "tldr": "该论文提出了一种基于点云的学习方法来控制人与机器人之间的递送过程，通过两阶段的教师-学生框架进行人机交互训练，在模拟基准、模拟到模拟转移和模拟到真实转移中均实现了显著的性能提升。",
    "en_tdlr": "This paper proposes a point cloud-based learning method for controlling the handover process between humans and robots. By using a two-stage teacher-student framework for human-robot interaction training, significant performance gains were achieved on simulation benchmarks, sim-to-sim transfer, and sim-to-real transfer."
}