{
    "title": "Scalable Object Detection on Embedded Devices Using Weight Pruning and Singular Value Decomposition. (arXiv:2303.02735v2 [cs.CV] UPDATED)",
    "abstract": "This paper presents a method for optimizing object detection models by combining weight pruning and singular value decomposition (SVD). The proposed method was evaluated on a custom dataset of street work images obtained from https://universe.roboflow.com/roboflow-100/street-work. The dataset consists of 611 training images, 175 validation images, and 87 test images with 7 classes. We compared the performance of the optimized models with the original unoptimized model in terms of frame rate, mean average precision (mAP@50), and weight size. The results show that the weight pruning + SVD model achieved a 0.724 mAP@50 with a frame rate of 1.48 FPS and a weight size of 12.1 MB, outperforming the original model (0.717 mAP@50, 1.50 FPS, and 12.3 MB). Precision-recall curves were also plotted for all models. Our work demonstrates that the proposed method can effectively optimize object detection models while balancing accuracy, speed, and model size.",
    "link": "http://arxiv.org/abs/2303.02735",
    "context": "Title: Scalable Object Detection on Embedded Devices Using Weight Pruning and Singular Value Decomposition. (arXiv:2303.02735v2 [cs.CV] UPDATED)\nAbstract: This paper presents a method for optimizing object detection models by combining weight pruning and singular value decomposition (SVD). The proposed method was evaluated on a custom dataset of street work images obtained from https://universe.roboflow.com/roboflow-100/street-work. The dataset consists of 611 training images, 175 validation images, and 87 test images with 7 classes. We compared the performance of the optimized models with the original unoptimized model in terms of frame rate, mean average precision (mAP@50), and weight size. The results show that the weight pruning + SVD model achieved a 0.724 mAP@50 with a frame rate of 1.48 FPS and a weight size of 12.1 MB, outperforming the original model (0.717 mAP@50, 1.50 FPS, and 12.3 MB). Precision-recall curves were also plotted for all models. Our work demonstrates that the proposed method can effectively optimize object detection models while balancing accuracy, speed, and model size.",
    "path": "papers/23/03/2303.02735.json",
    "total_tokens": 952,
    "translated_title": "利用权重修剪和奇异值分解在嵌入式设备上进行可扩展物体检测",
    "translated_abstract": "本文提出了一种组合利用权重修剪和奇异值分解（SVD）进行优化物体检测模型的方法。在https://universe.roboflow.com/roboflow-100/street-work获取的街道工作图像自定义数据集上对所提出的方法进行了评估。数据集包含611个训练图像，175个验证图像和87个具有7个分类的测试图像。我们通过帧率、平均精度（mAP@50）和权重大小等方面比较了优化后的模型与原始未优化模型的性能。结果表明，权重修剪+SVD模型具有0.724 mAP@50，帧率为1.48 FPS，权重大小为12.1 MB，优于原始模型（0.717 mAP@50，1.50 FPS和12.3 MB）。所有模型的精度-召回曲线也绘制出来。我们的研究表明，所提出的方法可以在平衡准确性、速度和模型大小的同时有效地优化物体检测模型。",
    "tldr": "本文提出了一种利用权重修剪和奇异值分解来优化物体检测模型的方法，并在自定义数据集上进行了评估，结果表明此方法可以在平衡准确性、速度和模型大小过程中有效地优化物体检测模型性能。",
    "en_tdlr": "This paper proposes a method for optimizing object detection models by combining weight pruning and singular value decomposition (SVD), and evaluates it on a custom dataset. The results show that this method can effectively optimize object detection model performance while balancing accuracy, speed, and model size."
}