{
    "title": "Concise QBF Encodings for Games on a Grid (extended version). (arXiv:2303.16949v1 [cs.AI])",
    "abstract": "Encoding 2-player games in QBF correctly and efficiently is challenging and error-prone. To enable concise specifications and uniform encodings of games played on grid boards, like Tic-Tac-Toe, Connect-4, Domineering, Pursuer-Evader and Breakthrough, we introduce Board-game Domain Definition Language (BDDL), inspired by the success of PDDL in the planning domain.  We provide an efficient translation from BDDL into QBF, encoding the existence of a winning strategy of bounded depth. Our lifted encoding treats board positions symbolically and allows concise definitions of conditions, effects and winning configurations, relative to symbolic board positions. The size of the encoding grows linearly in the input model and the considered depth.  To show the feasibility of such a generic approach, we use QBF solvers to compute the critical depths of winning strategies for instances of several known games. For several games, our work provides the first QBF encoding. Unlike plan validation in SAT",
    "link": "http://arxiv.org/abs/2303.16949",
    "context": "Title: Concise QBF Encodings for Games on a Grid (extended version). (arXiv:2303.16949v1 [cs.AI])\nAbstract: Encoding 2-player games in QBF correctly and efficiently is challenging and error-prone. To enable concise specifications and uniform encodings of games played on grid boards, like Tic-Tac-Toe, Connect-4, Domineering, Pursuer-Evader and Breakthrough, we introduce Board-game Domain Definition Language (BDDL), inspired by the success of PDDL in the planning domain.  We provide an efficient translation from BDDL into QBF, encoding the existence of a winning strategy of bounded depth. Our lifted encoding treats board positions symbolically and allows concise definitions of conditions, effects and winning configurations, relative to symbolic board positions. The size of the encoding grows linearly in the input model and the considered depth.  To show the feasibility of such a generic approach, we use QBF solvers to compute the critical depths of winning strategies for instances of several known games. For several games, our work provides the first QBF encoding. Unlike plan validation in SAT",
    "path": "papers/23/03/2303.16949.json",
    "total_tokens": 1303,
    "translated_title": "网格游戏的简洁QBF编码（扩展版本）",
    "translated_abstract": "编码2人游戏QBF的正确性和效率是具有挑战性和容易出错的。为了实现在网格棋盘上进行游戏（如井字游戏，连四，占领比赛，追逐者-逃避者和突破）的简洁规格和统一编码，我们引入了他人领域定义语言（BDDL），它受到了在计划领域中PDDL的成功启发。我们提供了从BDDL到QBF的有效转换，将有限深度的获胜策略的存在进行编码。我们的提升编码符号地处理棋盘位置，并允许相对于符号棋盘位置简洁定义条件、效果和获胜配置。编码的大小在输入模型和考虑的深度中呈线性增长。为了展示这种通用方法的可行性，我们使用QBF求解器计算了几个已知游戏实例的获胜策略的关键深度。对于几个游戏，我们的工作提供了第一个QBF编码。与SAT中的计划验证不同，",
    "tldr": "该论文介绍了一种名为BDDL的领域定义语言以进行网格棋盘游戏（如井字游戏，连四，占领游戏，追逐者-逃避者和突破）的统一和简洁的QBF编码方法，通过使用QBF求解器在有限深度上决定胜者。",
    "en_tdlr": "This paper introduces a unified and concise QBF encoding approach for grid board games (such as Tic-Tac-Toe, Connect-4, Domineering, Pursuer-Evader and Breakthrough) using a domain definition language called BDDL and using QBF solvers to determine the winner at a bounded depth."
}