{
    "title": "Mean-variance hybrid portfolio optimization with quantile-based risk measure. (arXiv:2303.15830v1 [q-fin.PM])",
    "abstract": "This paper addresses the importance of incorporating various risk measures in portfolio management and proposes a dynamic hybrid portfolio optimization model that combines the spectral risk measure and the Value-at-Risk in the mean-variance formulation. By utilizing the quantile optimization technique and martingale representation, we offer a solution framework for these issues and also develop a closed-form portfolio policy when all market parameters are deterministic. Our hybrid model outperforms the classical continuous-time mean-variance portfolio policy by allocating a higher position of the risky asset in favorable market states and a less risky asset in unfavorable market states. This desirable property leads to promising numerical experiment results, including improved Sortino ratio and reduced downside risk compared to the benchmark models.",
    "link": "http://arxiv.org/abs/2303.15830",
    "context": "Title: Mean-variance hybrid portfolio optimization with quantile-based risk measure. (arXiv:2303.15830v1 [q-fin.PM])\nAbstract: This paper addresses the importance of incorporating various risk measures in portfolio management and proposes a dynamic hybrid portfolio optimization model that combines the spectral risk measure and the Value-at-Risk in the mean-variance formulation. By utilizing the quantile optimization technique and martingale representation, we offer a solution framework for these issues and also develop a closed-form portfolio policy when all market parameters are deterministic. Our hybrid model outperforms the classical continuous-time mean-variance portfolio policy by allocating a higher position of the risky asset in favorable market states and a less risky asset in unfavorable market states. This desirable property leads to promising numerical experiment results, including improved Sortino ratio and reduced downside risk compared to the benchmark models.",
    "path": "papers/23/03/2303.15830.json",
    "total_tokens": 819,
    "translated_title": "基于分位数风险度量的均值-方差混合组合优化。",
    "translated_abstract": "本文探讨了在投资组合管理中加入风险度量的重要性，并提出了一种动态混合组合优化模型，该模型将频谱风险度量和价值风险度量结合在均值-方差公式中。通过利用分位数优化技术和鞅表示，我们为这些问题提供了一个解决框架，并在所有市场参数都是确定性的情况下，开发了一个闭式组合策略。相比于基准模型，我们的混合模型通过在有利市场状态下分配更高的风险资产和在不利市场状态下分配更少的风险资产来获得更好的表现。这种优势带来了很有前景的数值实验结果，包括改善了Sortino比率，降低了下行风险。",
    "tldr": "本文提出了一种基于分位数风险度量的动态混合组合优化模型，在有利市场状态下分配更高的风险资产和在不利市场状态下分配更少的风险资产来提高投资回报并降低风险。",
    "en_tdlr": "This paper proposes a dynamic hybrid portfolio optimization model based on quantile-based risk measure, which allocates a higher position of the risky asset in favorable market states and a less risky asset in unfavorable market states, leading to improved investment return and reduced risk."
}