{
    "title": "Augmented Collective Intelligence in Collaborative Ideation: Agenda and Challenges. (arXiv:2303.18010v1 [cs.CY])",
    "abstract": "AI systems may be better thought of as peers than as tools. This paper explores applications of augmented collective intelligence (ACI) beneficial to collaborative ideation. Design considerations are offered for an experiment that evaluates the performance of hybrid human- AI collectives. The investigation described combines humans and large language models (LLMs) to ideate on increasingly complex topics. A promising real-time collection tool called Polis is examined to facilitate ACI, including case studies from citizen engagement projects in Taiwan and Bowling Green, Kentucky. The authors discuss three challenges to consider when designing an ACI experiment: topic selection, participant selection, and evaluation of results. The paper concludes that researchers should address these challenges to conduct empirical studies of ACI in collaborative ideation.",
    "link": "http://arxiv.org/abs/2303.18010",
    "context": "Title: Augmented Collective Intelligence in Collaborative Ideation: Agenda and Challenges. (arXiv:2303.18010v1 [cs.CY])\nAbstract: AI systems may be better thought of as peers than as tools. This paper explores applications of augmented collective intelligence (ACI) beneficial to collaborative ideation. Design considerations are offered for an experiment that evaluates the performance of hybrid human- AI collectives. The investigation described combines humans and large language models (LLMs) to ideate on increasingly complex topics. A promising real-time collection tool called Polis is examined to facilitate ACI, including case studies from citizen engagement projects in Taiwan and Bowling Green, Kentucky. The authors discuss three challenges to consider when designing an ACI experiment: topic selection, participant selection, and evaluation of results. The paper concludes that researchers should address these challenges to conduct empirical studies of ACI in collaborative ideation.",
    "path": "papers/23/03/2303.18010.json",
    "total_tokens": 906,
    "translated_title": "协同创新中的增强集体智能：议程与挑战",
    "translated_abstract": "人工智能系统可能更应被看作是同伴而不是工具。",
    "tldr": "本文探讨了增强集体智能（ACI）在协同创新中的应用，包括设计一个实验来评估人工智能和人类混合团队的表现，并考察一种实时数据收集工具Polis。作者讨论了设计ACI实验时需要考虑的三个挑战：主题选择，参与者选择和结果评估。",
    "en_tdlr": "This paper explores the applications of augmented collective intelligence (ACI) in collaborative ideation, including an experiment designed to evaluate the performance of human-AI hybrid teams and an examination of a real-time data collection tool called Polis. The authors discuss three challenges to consider when designing an ACI experiment: topic selection, participant selection, and evaluation of results."
}