{
    "title": "SFHarmony: Source Free Domain Adaptation for Distributed Neuroimaging Analysis. (arXiv:2303.15965v1 [cs.CV])",
    "abstract": "To represent the biological variability of clinical neuroimaging populations, it is vital to be able to combine data across scanners and studies. However, different MRI scanners produce images with different characteristics, resulting in a domain shift known as the `harmonisation problem'. Additionally, neuroimaging data is inherently personal in nature, leading to data privacy concerns when sharing the data. To overcome these barriers, we propose an Unsupervised Source-Free Domain Adaptation (SFDA) method, SFHarmony. Through modelling the imaging features as a Gaussian Mixture Model and minimising an adapted Bhattacharyya distance between the source and target features, we can create a model that performs well for the target data whilst having a shared feature representation across the data domains, without needing access to the source data for adaptation or target labels. We demonstrate the performance of our method on simulated and real domain shifts, showing that the approach is ap",
    "link": "http://arxiv.org/abs/2303.15965",
    "context": "Title: SFHarmony: Source Free Domain Adaptation for Distributed Neuroimaging Analysis. (arXiv:2303.15965v1 [cs.CV])\nAbstract: To represent the biological variability of clinical neuroimaging populations, it is vital to be able to combine data across scanners and studies. However, different MRI scanners produce images with different characteristics, resulting in a domain shift known as the `harmonisation problem'. Additionally, neuroimaging data is inherently personal in nature, leading to data privacy concerns when sharing the data. To overcome these barriers, we propose an Unsupervised Source-Free Domain Adaptation (SFDA) method, SFHarmony. Through modelling the imaging features as a Gaussian Mixture Model and minimising an adapted Bhattacharyya distance between the source and target features, we can create a model that performs well for the target data whilst having a shared feature representation across the data domains, without needing access to the source data for adaptation or target labels. We demonstrate the performance of our method on simulated and real domain shifts, showing that the approach is ap",
    "path": "papers/23/03/2303.15965.json",
    "total_tokens": 955,
    "translated_title": "SFHarmony：无需源数据适用于分布式神经影像分析的领域自适应",
    "translated_abstract": "为了代表临床神经影像人群的生物学变异，能够合并来自扫描仪和研究的数据至关重要。然而，不同的MRI扫描仪产生具有不同特征的图像，导致了所谓的“协调问题”的领域转移。此外，神经影像数据本质上是个人个性特征，因此在共享数据时涉及到数据隐私问题。为了克服这些障碍，我们提出了一种无监督的无源领域适应（SFDA）方法SFHarmony。通过将成像特征建模为高斯混合模型，并最小化源特征和目标特征之间的自适应Bhattacharyya距离，我们可以创建一个模型，在不需要访问源数据以适应或目标标签的情况下，为目标数据表现出色，同时具有跨数据域的共享特征表示。我们展示了我们的方法在模拟和真实领域转移中的表现，证明了该方法适用于分布式神经影像分析，并能有效地协调跨扫描器和研究的数据，同时保护数据隐私。",
    "tldr": "SFHarmony是一种无需访问源数据且能有效协调跨扫描器和研究的数据以及保护数据隐私的分布式神经影像分析方法。"
}