{
    "title": "Learning Feasibility Constraints for Control Barrier Functions. (arXiv:2303.09403v1 [math.OC])",
    "abstract": "It has been shown that optimizing quadratic costs while stabilizing affine control systems to desired (sets of) states subject to state and control constraints can be reduced to a sequence of Quadratic Programs (QPs) by using Control Barrier Functions (CBFs) and Control Lyapunov Functions (CLFs). In this paper, we employ machine learning techniques to ensure the feasibility of these QPs, which is a challenging problem, especially for high relative degree constraints where High Order CBFs (HOCBFs) are required. To this end, we propose a sampling-based learning approach to learn a new feasibility constraint for CBFs; this constraint is then enforced by another HOCBF added to the QPs. The accuracy of the learned feasibility constraint is recursively improved by a recurrent training algorithm. We demonstrate the advantages of the proposed learning approach to constrained optimal control problems with specific focus on a robot control problem and on autonomous driving in an unknown environm",
    "link": "http://arxiv.org/abs/2303.09403",
    "context": "Title: Learning Feasibility Constraints for Control Barrier Functions. (arXiv:2303.09403v1 [math.OC])\nAbstract: It has been shown that optimizing quadratic costs while stabilizing affine control systems to desired (sets of) states subject to state and control constraints can be reduced to a sequence of Quadratic Programs (QPs) by using Control Barrier Functions (CBFs) and Control Lyapunov Functions (CLFs). In this paper, we employ machine learning techniques to ensure the feasibility of these QPs, which is a challenging problem, especially for high relative degree constraints where High Order CBFs (HOCBFs) are required. To this end, we propose a sampling-based learning approach to learn a new feasibility constraint for CBFs; this constraint is then enforced by another HOCBF added to the QPs. The accuracy of the learned feasibility constraint is recursively improved by a recurrent training algorithm. We demonstrate the advantages of the proposed learning approach to constrained optimal control problems with specific focus on a robot control problem and on autonomous driving in an unknown environm",
    "path": "papers/23/03/2303.09403.json",
    "total_tokens": 928,
    "translated_title": "学习控制屏障函数的可行性约束",
    "translated_abstract": "通过使用控制屏障函数（CBFs）和控制Lyapunov函数（CLFs），已经证明在稳定具有所需状态和状态/控制约束的仿射控制系统时，优化二次成本可以通过将其减少到一系列二次规划问题（QPs）。在本文中，我们采用机器学习技术来确保这些QPs的可行性，这是一个具有挑战性的问题，特别是对于需要高阶CBFs的高相对次约束。为此，我们提出了一种基于采样的学习方法，用于学习CBFs的新可行性约束；然后，通过添加到QPs中的另一个高阶CBF来强制执行此约束。经过递归训练算法的不断改进，学习的可行性约束的准确性得到提高。我们重点针对机器人控制问题和在未知环境中进行自主驾驶的约束优化控制问题，展示所提出的学习方法的优势。",
    "tldr": "本文通过机器学习技术学习控制屏障函数（CBFs）的新可行性约束，并提出了一种基于采样的学习方法来强制实施该约束，具有在约束优化控制问题中的实践应用价值。",
    "en_tdlr": "This paper proposes a sampling-based learning approach to learn a new feasibility constraint for Control Barrier Functions (CBFs) in order to ensure the feasibility of Quadratic Programs (QPs) in constrained optimal control problems, and the accuracy of the learned feasibility constraint is recursively improved by a recurrent training algorithm. This technique has practical applications in robot control and autonomous driving in unknown environments."
}