{
    "title": "GNN-Assisted Phase Space Integration with Application to Atomistics. (arXiv:2303.16088v1 [physics.comp-ph])",
    "abstract": "Overcoming the time scale limitations of atomistics can be achieved by switching from the state-space representation of Molecular Dynamics (MD) to a statistical-mechanics-based representation in phase space, where approximations such as maximum-entropy or Gaussian phase packets (GPP) evolve the atomistic ensemble in a time-coarsened fashion. In practice, this requires the computation of expensive high-dimensional integrals over all of phase space of an atomistic ensemble. This, in turn, is commonly accomplished efficiently by low-order numerical quadrature. We show that numerical quadrature in this context, unfortunately, comes with a set of inherent problems, which corrupt the accuracy of simulations -- especially when dealing with crystal lattices with imperfections. As a remedy, we demonstrate that Graph Neural Networks, trained on Monte-Carlo data, can serve as a replacement for commonly used numerical quadrature rules, overcoming their deficiencies and significantly improving the ",
    "link": "http://arxiv.org/abs/2303.16088",
    "context": "Title: GNN-Assisted Phase Space Integration with Application to Atomistics. (arXiv:2303.16088v1 [physics.comp-ph])\nAbstract: Overcoming the time scale limitations of atomistics can be achieved by switching from the state-space representation of Molecular Dynamics (MD) to a statistical-mechanics-based representation in phase space, where approximations such as maximum-entropy or Gaussian phase packets (GPP) evolve the atomistic ensemble in a time-coarsened fashion. In practice, this requires the computation of expensive high-dimensional integrals over all of phase space of an atomistic ensemble. This, in turn, is commonly accomplished efficiently by low-order numerical quadrature. We show that numerical quadrature in this context, unfortunately, comes with a set of inherent problems, which corrupt the accuracy of simulations -- especially when dealing with crystal lattices with imperfections. As a remedy, we demonstrate that Graph Neural Networks, trained on Monte-Carlo data, can serve as a replacement for commonly used numerical quadrature rules, overcoming their deficiencies and significantly improving the ",
    "path": "papers/23/03/2303.16088.json",
    "total_tokens": 830,
    "translated_title": "基于GNN的相空间积分在原子学中的应用",
    "translated_abstract": "通过从分子动力学（MD）的状态空间表示转换为基于统计力学的相空间表示，可以克服原子学的时间尺度限制。在相空间中，最大熵或高斯相包（GPP）等近似方法以时间缩减的方式演化原子集合。在实践中，这需要计算原子集合在整个相空间中昂贵的高维积分。常常利用低阶数值积分来高效完成这一点。我们展示了此上下文中的数值积分存在固有问题，特别是处理带有缺陷的晶格时，会损坏模拟的准确性。为此，我们证明了在Monte-Carlo数据上训练的图神经网络可以作为常用数值积分规则的替代品，克服了它们的缺陷并显着提高了模拟精度。",
    "tldr": "本文在原子学中提出了一种基于GNN的相空间积分方法，通过训练图神经网络可以替代传统数值积分规则，从而显着提高模拟精度。",
    "en_tdlr": "This paper proposes a GNN-assisted phase space integration method in atomistics, which uses machine learning to replace traditional numerical quadrature rules and significantly improve simulation accuracy."
}