{
    "title": "Multi-View Clustering via Semi-non-negative Tensor Factorization. (arXiv:2303.16748v1 [cs.LG])",
    "abstract": "Multi-view clustering (MVC) based on non-negative matrix factorization (NMF) and its variants have received a huge amount of attention in recent years due to their advantages in clustering interpretability. However, existing NMF-based multi-view clustering methods perform NMF on each view data respectively and ignore the impact of between-view. Thus, they can't well exploit the within-view spatial structure and between-view complementary information. To resolve this issue, we present semi-non-negative tensor factorization (Semi-NTF) and develop a novel multi-view clustering based on Semi-NTF with one-side orthogonal constraint. Our model directly performs Semi-NTF on the 3rd-order tensor which is composed of anchor graphs of views. Thus, our model directly considers the between-view relationship. Moreover, we use the tensor Schatten p-norm regularization as a rank approximation of the 3rd-order tensor which characterizes the cluster structure of multi-view data and exploits the between",
    "link": "http://arxiv.org/abs/2303.16748",
    "context": "Title: Multi-View Clustering via Semi-non-negative Tensor Factorization. (arXiv:2303.16748v1 [cs.LG])\nAbstract: Multi-view clustering (MVC) based on non-negative matrix factorization (NMF) and its variants have received a huge amount of attention in recent years due to their advantages in clustering interpretability. However, existing NMF-based multi-view clustering methods perform NMF on each view data respectively and ignore the impact of between-view. Thus, they can't well exploit the within-view spatial structure and between-view complementary information. To resolve this issue, we present semi-non-negative tensor factorization (Semi-NTF) and develop a novel multi-view clustering based on Semi-NTF with one-side orthogonal constraint. Our model directly performs Semi-NTF on the 3rd-order tensor which is composed of anchor graphs of views. Thus, our model directly considers the between-view relationship. Moreover, we use the tensor Schatten p-norm regularization as a rank approximation of the 3rd-order tensor which characterizes the cluster structure of multi-view data and exploits the between",
    "path": "papers/23/03/2303.16748.json",
    "total_tokens": 909,
    "translated_title": "基于半非负张量分解的多视图聚类",
    "translated_abstract": "非负矩阵分解及其变体被广泛应用于多视图聚类(MVC)。然而，现有基于非负矩阵分解的MVC方法分别对每个视图数据进行矩阵分解，忽略了视图间的影响，不能很好地利用视图内部空间结构和视 图间的互补信息。为解决这个问题，提出了半非负张量分解(Semi-NTF)，并开发了一种基于Semi-NTF的新型多视图聚类方法，其中约束条件为单侧正交约束。我们的模型直接在第3阶张量上执行Semi-NTF，该张量由视图的锚图组成，因此我们的模型直接考虑视图间的关系。此外，我们使用张量Schatten p-范数正则化作为对第3阶张量的秩近似，来表征多视图数据的簇结构，并利用视图间的互补信息。",
    "tldr": "该论文提出了基于半非负张量分解的多视图聚类方法，该方法采用单侧正交约束来考虑视图间的关系，并使用张量Schatten p-范数正则化来表征多视图数据的簇结构和利用视图间的互补信息。"
}