{
    "title": "Efficient Mixed-Type Wafer Defect Pattern Recognition Using Compact Deformable Convolutional Transformers. (arXiv:2303.13827v1 [cs.CV])",
    "abstract": "Manufacturing wafers is an intricate task involving thousands of steps. Defect Pattern Recognition (DPR) of wafer maps is crucial to find the root cause of the issue and further improving the yield in the wafer foundry. Mixed-type DPR is much more complicated compared to single-type DPR due to varied spatial features, the uncertainty of defects, and the number of defects present. To accurately predict the number of defects as well as the types of defects, we propose a novel compact deformable convolutional transformer (DC Transformer). Specifically, DC Transformer focuses on the global features present in the wafer map by virtue of learnable deformable kernels and multi-head attention to the global features. The proposed method succinctly models the internal relationship between the wafer maps and the defects. DC Transformer is evaluated on a real dataset containing 38 defect patterns. Experimental results show that DC Transformer performs exceptionally well in recognizing both single ",
    "link": "http://arxiv.org/abs/2303.13827",
    "context": "Title: Efficient Mixed-Type Wafer Defect Pattern Recognition Using Compact Deformable Convolutional Transformers. (arXiv:2303.13827v1 [cs.CV])\nAbstract: Manufacturing wafers is an intricate task involving thousands of steps. Defect Pattern Recognition (DPR) of wafer maps is crucial to find the root cause of the issue and further improving the yield in the wafer foundry. Mixed-type DPR is much more complicated compared to single-type DPR due to varied spatial features, the uncertainty of defects, and the number of defects present. To accurately predict the number of defects as well as the types of defects, we propose a novel compact deformable convolutional transformer (DC Transformer). Specifically, DC Transformer focuses on the global features present in the wafer map by virtue of learnable deformable kernels and multi-head attention to the global features. The proposed method succinctly models the internal relationship between the wafer maps and the defects. DC Transformer is evaluated on a real dataset containing 38 defect patterns. Experimental results show that DC Transformer performs exceptionally well in recognizing both single ",
    "path": "papers/23/03/2303.13827.json",
    "total_tokens": 924,
    "translated_title": "高效混合型晶圆缺陷图案识别使用紧凑型可形变卷积变换器",
    "translated_abstract": "晶圆制造是一项复杂的任务，涉及数千个步骤。晶圆缺陷图案识别（DPR）对于找到问题的根本原因并进一步提高晶圆铸造的产量至关重要。与单一类型DPR相比，混合类型DPR由于空间特征的多样性，缺陷的不确定性和存在数目等原因更加复杂。为了准确预测缺陷的数目和类型，我们提出了一种新颖的紧凑型可形变卷积变换器（DC Transformer）。具体来说，DC Transformer通过可学习的可形变内核和多头注意力，聚焦于晶圆图中存在的全局特征。所提出的方法简洁地模拟了晶圆图和缺陷之间的内部关系。在一个包含38种缺陷模式的真实数据集上评估了DC Transformer。实验结果表明，DC Transformer在识别单一以及混合型晶圆缺陷方面表现得异常优秀。",
    "tldr": "本文提出了一种紧凑型可形变卷积变换器（DC Transformer），能够高效地识别单一和混合型晶圆缺陷，聚焦于全局特征，准确预测缺陷的数目和类型。",
    "en_tdlr": "This paper proposes a novel compact deformable convolutional transformer (DC Transformer) that efficiently recognizes single and mixed-type wafer defects by focusing on global features and accurately predicting the number and type of defects."
}