{
    "title": "Modular Retrieval for Generalization and Interpretation. (arXiv:2303.13419v1 [cs.IR])",
    "abstract": "New retrieval tasks have always been emerging, thus urging the development of new retrieval models. However, instantiating a retrieval model for each new retrieval task is resource-intensive and time-consuming, especially for a retrieval model that employs a large-scale pre-trained language model. To address this issue, we shift to a novel retrieval paradigm called modular retrieval, which aims to solve new retrieval tasks by instead composing multiple existing retrieval modules. Built upon the paradigm, we propose a retrieval model with modular prompt tuning named REMOP. It constructs retrieval modules subject to task attributes with deep prompt tuning, and yields retrieval models subject to tasks with module composition. We validate that, REMOP inherently with modularity not only has appealing generalizability and interpretability in preliminary explorations, but also achieves comparable performance to state-of-the-art retrieval models on a zero-shot retrieval benchmark.\\footnote{Our",
    "link": "http://arxiv.org/abs/2303.13419",
    "context": "Title: Modular Retrieval for Generalization and Interpretation. (arXiv:2303.13419v1 [cs.IR])\nAbstract: New retrieval tasks have always been emerging, thus urging the development of new retrieval models. However, instantiating a retrieval model for each new retrieval task is resource-intensive and time-consuming, especially for a retrieval model that employs a large-scale pre-trained language model. To address this issue, we shift to a novel retrieval paradigm called modular retrieval, which aims to solve new retrieval tasks by instead composing multiple existing retrieval modules. Built upon the paradigm, we propose a retrieval model with modular prompt tuning named REMOP. It constructs retrieval modules subject to task attributes with deep prompt tuning, and yields retrieval models subject to tasks with module composition. We validate that, REMOP inherently with modularity not only has appealing generalizability and interpretability in preliminary explorations, but also achieves comparable performance to state-of-the-art retrieval models on a zero-shot retrieval benchmark.\\footnote{Our",
    "path": "papers/23/03/2303.13419.json",
    "total_tokens": 868,
    "translated_title": "模块化检索：泛化和解释的出路",
    "translated_abstract": "随着新的检索任务不断涌现，需要开发新的检索模型。但是，为每个新的检索任务实例化检索模型是耗费资源和耗时的，尤其是对于采用大规模预训练语言模型的检索模型而言。为解决这个问题，我们转向一种新的检索范式，称为模块化检索，它旨在通过组合多个现有的检索模块来解决新的检索任务。基于这个范式，我们提出了一个具有模块化提示调整的检索模型（REMOP）。它通过深度提示调整构建与任务属性相关联的检索模块，并通过模块化组合产生与任务相关的检索模型。我们验证，REMOP天生具有模块性不仅在初步探索中具有吸引人的泛化能力和可解释性，而且在零-shot检索基准测试中具有与最先进的检索模型相媲美的性能。",
    "tldr": "调整模块化提示的检索模型REMOP，通过多个现有检索模块的组合解决新的检索任务，具有泛化和解释能力， 在零-shot检索基准测试中表现与最先进的检索模型相媲美。"
}