{
    "title": "Deep Visual Forced Alignment: Learning to Align Transcription with Talking Face Video. (arXiv:2303.08670v1 [cs.CV])",
    "abstract": "Forced alignment refers to a technology that time-aligns a given transcription with a corresponding speech. However, as the forced alignment technologies have developed using speech audio, they might fail in alignment when the input speech audio is noise-corrupted or is not accessible. We focus on that there is another component that the speech can be inferred from, the speech video (i.e., talking face video). Since the drawbacks of audio-based forced alignment can be complemented using the visual information when the audio signal is under poor condition, we try to develop a novel video-based forced alignment method. However, different from audio forced alignment, it is challenging to develop a reliable visual forced alignment technology for the following two reasons: 1) Visual Speech Recognition (VSR) has a much lower performance compared to audio-based Automatic Speech Recognition (ASR), and 2) the translation from text to video is not reliable, so the method typically used for build",
    "link": "http://arxiv.org/abs/2303.08670",
    "context": "Title: Deep Visual Forced Alignment: Learning to Align Transcription with Talking Face Video. (arXiv:2303.08670v1 [cs.CV])\nAbstract: Forced alignment refers to a technology that time-aligns a given transcription with a corresponding speech. However, as the forced alignment technologies have developed using speech audio, they might fail in alignment when the input speech audio is noise-corrupted or is not accessible. We focus on that there is another component that the speech can be inferred from, the speech video (i.e., talking face video). Since the drawbacks of audio-based forced alignment can be complemented using the visual information when the audio signal is under poor condition, we try to develop a novel video-based forced alignment method. However, different from audio forced alignment, it is challenging to develop a reliable visual forced alignment technology for the following two reasons: 1) Visual Speech Recognition (VSR) has a much lower performance compared to audio-based Automatic Speech Recognition (ASR), and 2) the translation from text to video is not reliable, so the method typically used for build",
    "path": "papers/23/03/2303.08670.json",
    "total_tokens": 986,
    "translated_title": "深度视觉强制对齐: 学习将音频文字对齐到人脸视频中",
    "translated_abstract": "强制对齐是指将给定的音频文字转录与相应的语音进行时序对齐的技术。然而，随着强制对齐技术使用语音音频进行开发，当输入的语音音频受到噪声污染或无法访问时，它们可能会在对齐方面失败。我们关注的是语音可以从另一个组件中推断出，即语音视频(即，说话人的面部视频)。由于当音频信号处于不良状态时，可以使用视觉信息来补充音频强制对齐技术的缺点，因此我们尝试开发一种新型的基于视频的强制对齐方法。然而，与音频强制对齐不同，开发可靠的视觉强制对齐技术具有挑战性，原因在于: 1)视觉语音识别(VSR)与基于音频的自动语音识别(ASR)相比性能较低, 2)从文本到视频的翻译不可靠。",
    "tldr": "本论文提出了基于人脸视频的强制对齐技术，补充了使用音频强制对齐技术存在的缺陷，但由于视觉语音识别技术性能较低且文本到视频的翻译不可靠，开发可靠的视觉强制对齐技术具有挑战性。",
    "en_tdlr": "This paper proposes a novel video-based forced alignment method to overcome the limitations of audio-based forced alignment, by using talking face video as an additional component to complement audio information. However, the challenge lies in the fact that Visual Speech Recognition (VSR) has lower performance compared to audio-based Automatic Speech Recognition (ASR), and the translation from text to video is unreliable."
}