{
    "title": "CoolPINNs: A Physics-informed Neural Network Modeling of Active Cooling in Vascular Systems. (arXiv:2303.05300v2 [math.NA] UPDATED)",
    "abstract": "Emerging technologies like hypersonic aircraft, space exploration vehicles, and batteries avail fluid circulation in embedded microvasculatures for efficient thermal regulation. Modeling is vital during these engineered systems' design and operational phases. However, many challenges exist in developing a modeling framework. What is lacking is an accurate framework that (i) captures sharp jumps in the thermal flux across complex vasculature layouts, (ii) deals with oblique derivatives (involving tangential and normal components), (iii) handles nonlinearity because of radiative heat transfer, (iv) provides a high-speed forecast for real-time monitoring, and (v) facilitates robust inverse modeling. This paper addresses these challenges by availing the power of physics-informed neural networks (PINNs). We develop a fast, reliable, and accurate Scientific Machine Learning (SciML) framework for vascular-based thermal regulation -- called CoolPINNs: a PINNs-based modeling framework for activ",
    "link": "http://arxiv.org/abs/2303.05300",
    "context": "Title: CoolPINNs: A Physics-informed Neural Network Modeling of Active Cooling in Vascular Systems. (arXiv:2303.05300v2 [math.NA] UPDATED)\nAbstract: Emerging technologies like hypersonic aircraft, space exploration vehicles, and batteries avail fluid circulation in embedded microvasculatures for efficient thermal regulation. Modeling is vital during these engineered systems' design and operational phases. However, many challenges exist in developing a modeling framework. What is lacking is an accurate framework that (i) captures sharp jumps in the thermal flux across complex vasculature layouts, (ii) deals with oblique derivatives (involving tangential and normal components), (iii) handles nonlinearity because of radiative heat transfer, (iv) provides a high-speed forecast for real-time monitoring, and (v) facilitates robust inverse modeling. This paper addresses these challenges by availing the power of physics-informed neural networks (PINNs). We develop a fast, reliable, and accurate Scientific Machine Learning (SciML) framework for vascular-based thermal regulation -- called CoolPINNs: a PINNs-based modeling framework for activ",
    "path": "papers/23/03/2303.05300.json",
    "total_tokens": 888,
    "translated_title": "CoolPINNs: 基于物理学的神经网络建模血管系统中的主动冷却",
    "translated_abstract": "新兴技术如高超声速飞机、空间探索车和电池利用嵌入式微细循环进行高效热调节。然而，在这些工程系统的设计和操作阶段进行建模是至关重要的，但在开发建模框架方面存在许多挑战。本文通过物理学引导的神经网络（PINNs）的应用来解决这些挑战。我们开发了一个名为CoolPINNs的快速、可靠、准确的基于PINNs的科学机器学习（SciML）框架，用于血管系统的热调节建模。",
    "tldr": "本文提出了一种基于物理学引导的神经网络的建模框架——CoolPINNs，用于旨在高效热调节的血管系统。它能够准确捕捉复杂血管布局中的热流急剧跳变，处理包括切向和法向分量的斜率导数，解决由于辐射热传递引起的非线性，并为实时监测提供高速预测，更便于稳健的反演建模。"
}