{
    "title": "Planning for Complex Non-prehensile Manipulation Among Movable Objects by Interleaving Multi-Agent Pathfinding and Physics-Based Simulation. (arXiv:2303.13352v1 [cs.RO])",
    "abstract": "Real-world manipulation problems in heavy clutter require robots to reason about potential contacts with objects in the environment. We focus on pick-and-place style tasks to retrieve a target object from a shelf where some `movable' objects must be rearranged in order to solve the task. In particular, our motivation is to allow the robot to reason over and consider non-prehensile rearrangement actions that lead to complex robot-object and object-object interactions where multiple objects might be moved by the robot simultaneously, and objects might tilt, lean on each other, or topple. To support this, we query a physics-based simulator to forward simulate these interaction dynamics which makes action evaluation during planning computationally very expensive. To make the planner tractable, we establish a connection between the domain of Manipulation Among Movable Objects and Multi-Agent Pathfinding that lets us decompose the problem into two phases our M4M algorithm iterates over. Firs",
    "link": "http://arxiv.org/abs/2303.13352",
    "context": "Title: Planning for Complex Non-prehensile Manipulation Among Movable Objects by Interleaving Multi-Agent Pathfinding and Physics-Based Simulation. (arXiv:2303.13352v1 [cs.RO])\nAbstract: Real-world manipulation problems in heavy clutter require robots to reason about potential contacts with objects in the environment. We focus on pick-and-place style tasks to retrieve a target object from a shelf where some `movable' objects must be rearranged in order to solve the task. In particular, our motivation is to allow the robot to reason over and consider non-prehensile rearrangement actions that lead to complex robot-object and object-object interactions where multiple objects might be moved by the robot simultaneously, and objects might tilt, lean on each other, or topple. To support this, we query a physics-based simulator to forward simulate these interaction dynamics which makes action evaluation during planning computationally very expensive. To make the planner tractable, we establish a connection between the domain of Manipulation Among Movable Objects and Multi-Agent Pathfinding that lets us decompose the problem into two phases our M4M algorithm iterates over. Firs",
    "path": "papers/23/03/2303.13352.json",
    "total_tokens": 1121,
    "translated_title": "通过交织多智能体路径规划和基于物理模拟的规划，规划可动物体的复杂非握取式操作",
    "translated_abstract": "在高混杂度环境中，实现物体的操作可能需要考虑物体间的潜在接触。我们聚焦于从架子上取下目标物体的 pick-and-place 操作，其中必须重新排列一些“可动”物体才能解决任务。我们的重点是允许机器人考虑非握取的重新排列行动，这些行动会导致复杂的机器人-物体和物体-物体的交互，机器人可能同时移动多个物体，物体可能倾斜，相互靠在一起或倾倒。为了支持这一点，我们查询基于物理学的模拟器来前向模拟这些交互动力学，这使得计划过程中的行动评估变得非常耗时。为了使规划器可行，我们建立了可动物体操作领域和多智能体路径规划之间的联系，让我们将问题分解成两个阶段，我们的 M4M 算法迭代地进行。首先，我们使用多智能体路径规划生成一系列机器人运动，将物体运输到它们的目标位置，其次，我们使用基于物理模拟的模拟器评估生成的每个运动计划以找到最优计划。我们的实验表明，我们的方法在规划时间和成功率方面优于现有的最先进方法。",
    "tldr": "本文通过交织多智能体路径规划和基于物理模拟的规划，使机器人能够考虑复杂的机器人-物体和物体-物体的交互，并成功实现可动物体的复杂非握取式操作。",
    "en_tdlr": "This paper proposes a method that interleaves multi-agent pathfinding and physics-based simulation to enable robots to consider complex robot-object and object-object interactions, and successfully execute complex non-prehensile manipulation among movable objects. The proposed approach outperforms existing state-of-the-art methods in planning time and success rate."
}