{
    "title": "Towards Improved Illicit Node Detection with Positive-Unlabelled Learning. (arXiv:2303.02462v2 [cs.LG] UPDATED)",
    "abstract": "Detecting illicit nodes on blockchain networks is a valuable task for strengthening future regulation. Recent machine learning-based methods proposed to tackle the tasks are using some blockchain transaction datasets with a small portion of samples labeled positive and the rest unlabelled (PU). Albeit the assumption that a random sample of unlabeled nodes are normal nodes is used in some works, we discuss that the label mechanism assumption for the hidden positive labels and its effect on the evaluation metrics is worth considering. We further explore that PU classifiers dealing with potential hidden positive labels can have improved performance compared to regular machine learning models. We test the PU classifiers with a list of graph representation learning methods for obtaining different feature distributions for the same data to have more reliable results.",
    "link": "http://arxiv.org/abs/2303.02462",
    "context": "Title: Towards Improved Illicit Node Detection with Positive-Unlabelled Learning. (arXiv:2303.02462v2 [cs.LG] UPDATED)\nAbstract: Detecting illicit nodes on blockchain networks is a valuable task for strengthening future regulation. Recent machine learning-based methods proposed to tackle the tasks are using some blockchain transaction datasets with a small portion of samples labeled positive and the rest unlabelled (PU). Albeit the assumption that a random sample of unlabeled nodes are normal nodes is used in some works, we discuss that the label mechanism assumption for the hidden positive labels and its effect on the evaluation metrics is worth considering. We further explore that PU classifiers dealing with potential hidden positive labels can have improved performance compared to regular machine learning models. We test the PU classifiers with a list of graph representation learning methods for obtaining different feature distributions for the same data to have more reliable results.",
    "path": "papers/23/03/2303.02462.json",
    "total_tokens": 789,
    "translated_title": "基于正样本未标注学习的提高非法节点检测方法",
    "translated_abstract": "在区块链网络上检测非法节点是加强未来监管的一项有价值的任务。最近提出了基于机器学习的方法来解决这一任务，这些方法使用了一些区块链交易数据集，其中有一小部分标记为正样本，其余未标记（PU）。虽然一些研究使用了随机样本假定未标记节点是正常节点，但我们认为值得考虑隐藏正样本标签的标签机制假设及其对评估指标的影响。我们进一步探讨了处理潜在隐藏正样本的PU分类器与常规机器学习模型相比可以具有改进的性能。我们测试了PU分类器与一系列图表示学习方法结合使用，以获得相同数据的不同特征分布，以获得更可靠的结果。",
    "tldr": "本文提出基于正样本未标注学习的改进非法节点检测方法，通过探讨隐藏正样本的标签机制假设，与一系列图表示学习方法相结合，实现了更可靠的结果。",
    "en_tdlr": "This paper proposes an improved illicit node detection method using positive-unlabelled learning. By discussing the label mechanism assumption for hidden positive labels and combining with a list of graph representation learning methods, more reliable results were achieved."
}