{
    "title": "Plant Disease Detection using Region-Based Convolutional Neural Network. (arXiv:2303.09063v1 [cs.CV])",
    "abstract": "Agriculture plays an important role in the food and economy of Bangladesh. The rapid growth of population over the years also has increased the demand for food production. One of the major reasons behind low crop production is numerous bacteria, virus and fungal plant diseases. Early detection of plant diseases and proper usage of pesticides and fertilizers are vital for preventing the diseases and boost the yield. Most of the farmers use generalized pesticides and fertilizers in the entire fields without specifically knowing the condition of the plants. Thus the production cost oftentimes increases, and, not only that, sometimes this becomes detrimental to the yield. Deep Learning models are found to be very effective to automatically detect plant diseases from images of plants, thereby reducing the need for human specialists. This paper aims at building a lightweight deep learning model for predicting leaf disease in tomato plants. By modifying the region-based convolutional neural n",
    "link": "http://arxiv.org/abs/2303.09063",
    "context": "Title: Plant Disease Detection using Region-Based Convolutional Neural Network. (arXiv:2303.09063v1 [cs.CV])\nAbstract: Agriculture plays an important role in the food and economy of Bangladesh. The rapid growth of population over the years also has increased the demand for food production. One of the major reasons behind low crop production is numerous bacteria, virus and fungal plant diseases. Early detection of plant diseases and proper usage of pesticides and fertilizers are vital for preventing the diseases and boost the yield. Most of the farmers use generalized pesticides and fertilizers in the entire fields without specifically knowing the condition of the plants. Thus the production cost oftentimes increases, and, not only that, sometimes this becomes detrimental to the yield. Deep Learning models are found to be very effective to automatically detect plant diseases from images of plants, thereby reducing the need for human specialists. This paper aims at building a lightweight deep learning model for predicting leaf disease in tomato plants. By modifying the region-based convolutional neural n",
    "path": "papers/23/03/2303.09063.json",
    "total_tokens": 897,
    "translated_title": "基于区域卷积神经网络的植物病害检测",
    "translated_abstract": "农业在孟加拉国的食品和经济中起着重要作用，但细菌，病毒和真菌病害限制了作物生产。本论文旨在构建一个轻量级深度学习模型以预测番茄植物的叶病害。通过修改区域卷积神经网络（R-CNN）的结构，本文提出了一个架构，利用整个番茄植物图像的特征来检测植物病害，而不仅仅是感兴趣区域（ROI）。所提出的模型在检测四种常见的番茄植物病害方面表现出94.3％的准确性。",
    "tldr": "本文提出了一种新的基于区域卷积神经网络（R-CNN）的轻量级深度学习模型，可用于检测番茄植物的叶病害。与传统方法相比，该模型利用整个番茄植物图像的特征进行检测，具有更高的准确性和效率。",
    "en_tdlr": "This paper proposes a lightweight deep learning model based on region-based convolutional neural network (R-CNN) for detecting leaf disease in tomato plants. By utilizing the features from the entire plant image, the model shows higher accuracy and efficiency compared to traditional methods."
}