{
    "title": "GNN-based physics solver for time-independent PDEs. (arXiv:2303.15681v1 [cs.LG])",
    "abstract": "Physics-based deep learning frameworks have shown to be effective in accurately modeling the dynamics of complex physical systems with generalization capability across problem inputs. However, time-independent problems pose the challenge of requiring long-range exchange of information across the computational domain for obtaining accurate predictions. In the context of graph neural networks (GNNs), this calls for deeper networks, which, in turn, may compromise or slow down the training process. In this work, we present two GNN architectures to overcome this challenge - the Edge Augmented GNN and the Multi-GNN. We show that both these networks perform significantly better (by a factor of 1.5 to 2) than baseline methods when applied to time-independent solid mechanics problems. Furthermore, the proposed architectures generalize well to unseen domains, boundary conditions, and materials. Here, the treatment of variable domains is facilitated by a novel coordinate transformation that enabl",
    "link": "http://arxiv.org/abs/2303.15681",
    "context": "Title: GNN-based physics solver for time-independent PDEs. (arXiv:2303.15681v1 [cs.LG])\nAbstract: Physics-based deep learning frameworks have shown to be effective in accurately modeling the dynamics of complex physical systems with generalization capability across problem inputs. However, time-independent problems pose the challenge of requiring long-range exchange of information across the computational domain for obtaining accurate predictions. In the context of graph neural networks (GNNs), this calls for deeper networks, which, in turn, may compromise or slow down the training process. In this work, we present two GNN architectures to overcome this challenge - the Edge Augmented GNN and the Multi-GNN. We show that both these networks perform significantly better (by a factor of 1.5 to 2) than baseline methods when applied to time-independent solid mechanics problems. Furthermore, the proposed architectures generalize well to unseen domains, boundary conditions, and materials. Here, the treatment of variable domains is facilitated by a novel coordinate transformation that enabl",
    "path": "papers/23/03/2303.15681.json",
    "total_tokens": 896,
    "translated_title": "基于GNN的求解时间无关PDE的物理求解器",
    "translated_abstract": "物理基础深度学习框架已被证明在准确建模复杂物理系统的动态过程方面具有广泛的推广能力，然而，时间无关问题需要跨越计算域进行长距离的信息交换才能获得准确的预测，这对于图形神经网络(GNN)来说需要更深的网络，这反过来又可能会损害或减缓训练过程。在这项工作中，我们提出了两个GNN架构来克服这一挑战——边增强GNN和多GNN。我们表明，当应用于时间无关的固体力学问题时，这两个网络明显比基线方法更好（提高了1.5到2倍）。此外，所提出的体系结构具有良好的泛化能力，可以适用于未见过的域、边界条件和材料。这里，通过一种新颖的坐标转换来处理变量域。",
    "tldr": "本文介绍了两种基于GNN的深度神经网络架构——边增强GNN和多GNN来解决时间无关PDE的问题，这两个网络明显比基线模型准确率更高，同时具备良好的泛化能力。"
}