{
    "title": "Dealing With Heterogeneous 3D MR Knee Images: A Federated Few-Shot Learning Method With Dual Knowledge Distillation. (arXiv:2303.14357v1 [eess.IV])",
    "abstract": "Federated Learning has gained popularity among medical institutions since it enables collaborative training between clients (e.g., hospitals) without aggregating data. However, due to the high cost associated with creating annotations, especially for large 3D image datasets, clinical institutions do not have enough supervised data for training locally. Thus, the performance of the collaborative model is subpar under limited supervision. On the other hand, large institutions have the resources to compile data repositories with high-resolution images and labels. Therefore, individual clients can utilize the knowledge acquired in the public data repositories to mitigate the shortage of private annotated images. In this paper, we propose a federated few-shot learning method with dual knowledge distillation. This method allows joint training with limited annotations across clients without jeopardizing privacy. The supervised learning of the proposed method extracts features from limited lab",
    "link": "http://arxiv.org/abs/2303.14357",
    "context": "Title: Dealing With Heterogeneous 3D MR Knee Images: A Federated Few-Shot Learning Method With Dual Knowledge Distillation. (arXiv:2303.14357v1 [eess.IV])\nAbstract: Federated Learning has gained popularity among medical institutions since it enables collaborative training between clients (e.g., hospitals) without aggregating data. However, due to the high cost associated with creating annotations, especially for large 3D image datasets, clinical institutions do not have enough supervised data for training locally. Thus, the performance of the collaborative model is subpar under limited supervision. On the other hand, large institutions have the resources to compile data repositories with high-resolution images and labels. Therefore, individual clients can utilize the knowledge acquired in the public data repositories to mitigate the shortage of private annotated images. In this paper, we propose a federated few-shot learning method with dual knowledge distillation. This method allows joint training with limited annotations across clients without jeopardizing privacy. The supervised learning of the proposed method extracts features from limited lab",
    "path": "papers/23/03/2303.14357.json",
    "total_tokens": 1136,
    "translated_title": "处理异构3D MR膝关节图像：一种具有双重知识蒸馏的联邦少样本学习方法",
    "translated_abstract": "联邦学习在医学机构中越来越受欢迎，因为它可以在不汇总数据的情况下实现客户(如医院)之间的协作培训。然而，由于为大型3D图像数据集创建注释的成本高昂，特别是对于医疗机构来说，他们没有足够的监督数据来进行本地培训。因此，有限监督下的合作模型表现不佳。另一方面，大型机构有资源来编制高分辨率图像和标签数据存储库。因此，个体客户可以利用从公共数据存储库中获得的知识来缓解私有标注图像的短缺。在本文中，我们提出了一种具有双重知识蒸馏的联邦少样本学习方法。该方法允许在客户之间进行有限标注的联合培训，而不会危害隐私。所提出方法的监督学习从每个客户的有限标注数据中提取特征，而无监督学习从公共数据存储库中学习。此外，实现了双重知识蒸馏以生成更多的不同特征。对膝关节MR图像的异构临床数据集进行的实验证明，我们提出的方法优于现有的最先进方法，实现了0.87的AUC得分。",
    "tldr": "本文提出了一种具有双重知识蒸馏的联邦少样本学习方法，利用公共数据库的知识来缓解私人标注图像的短缺，并通过有限的标注数据、无监督学习和双重知识蒸馏，达到优于现有最先进方法的结果。",
    "en_tdlr": "This paper proposes a federated few-shot learning method with dual knowledge distillation, using public data repositories to mitigate the shortage of private annotated images. The proposed method achieves superior results over existing state-of-the-art methods by leveraging limited annotated data, unsupervised learning, and dual knowledge distillation."
}