{
    "title": "Dual Feedback Attention Framework via Boundary-Aware Auxiliary and Progressive Semantic Optimization for Salient Object Detection in Optical Remote Sensing Imagery. (arXiv:2303.02867v2 [cs.CV] UPDATED)",
    "abstract": "Salient object detection in optical remote sensing image (ORSI-SOD) has gradually attracted attention thanks to the development of deep learning (DL) and salient object detection in natural scene image (NSI-SOD). However, NSI and ORSI are different in many aspects, such as large coverage, complex background, and large differences in target types and scales. Therefore, a new dedicated method is needed for ORSI-SOD. In addition, existing methods do not pay sufficient attention to the boundary of the object, and the completeness of the final saliency map still needs improvement. To address these issues, we propose a novel method called Dual Feedback Attention Framework via Boundary-Aware Auxiliary and Progressive Semantic Optimization (DFA-BASO). First, Boundary Protection Calibration (BPC) module is proposed to reduce the loss of edge position information during forward propagation and suppress noise in low-level features. Second, a Dual Feature Feedback Complementary (DFFC) module is pr",
    "link": "http://arxiv.org/abs/2303.02867",
    "context": "Title: Dual Feedback Attention Framework via Boundary-Aware Auxiliary and Progressive Semantic Optimization for Salient Object Detection in Optical Remote Sensing Imagery. (arXiv:2303.02867v2 [cs.CV] UPDATED)\nAbstract: Salient object detection in optical remote sensing image (ORSI-SOD) has gradually attracted attention thanks to the development of deep learning (DL) and salient object detection in natural scene image (NSI-SOD). However, NSI and ORSI are different in many aspects, such as large coverage, complex background, and large differences in target types and scales. Therefore, a new dedicated method is needed for ORSI-SOD. In addition, existing methods do not pay sufficient attention to the boundary of the object, and the completeness of the final saliency map still needs improvement. To address these issues, we propose a novel method called Dual Feedback Attention Framework via Boundary-Aware Auxiliary and Progressive Semantic Optimization (DFA-BASO). First, Boundary Protection Calibration (BPC) module is proposed to reduce the loss of edge position information during forward propagation and suppress noise in low-level features. Second, a Dual Feature Feedback Complementary (DFFC) module is pr",
    "path": "papers/23/03/2303.02867.json",
    "total_tokens": 1136,
    "translated_title": "基于边界感知辅助和渐进语义优化的双反馈注意力框架用于光学遥感图像中的显著目标检测",
    "translated_abstract": "光学遥感图像中的显著目标检测逐渐引起了人们的关注，这要归功于深度学习和自然场景图像中的显著目标检测的发展。然而，自然场景图像和光学遥感图像在许多方面是不同的，例如覆盖范围大、背景复杂以及目标类型和尺度的巨大差异。因此，需要一种专门的方法来处理光学遥感图像中的显著目标检测。此外，现有的方法没有充分关注到目标的边界，最终显著性图的完整性仍需要改进。为了解决这些问题，我们提出了一种新的方法，称为基于边界感知辅助和渐进语义优化的双反馈注意力框架（DFA-BASO）。首先，引入了边界保护校准(BPC)模块，用于减少正向传播过程中边界位置信息的丢失，并抑制低级特征中的噪声。其次，引入了双特征反馈补充(DFFC)模块，用于增强正反馈和负反馈之间的相互作用，提高显著性目标的准确性和完整性。",
    "tldr": "本文提出了一种面向光学遥感图像中显著目标检测的新方法，称为基于边界感知辅助和渐进语义优化的双反馈注意力框架 (DFA-BASO)。通过引入边界保护校准和双特征反馈补充模块，该方法能够减少信息损失、抑制噪声、增强目标的准确性和完整性。",
    "en_tdlr": "This paper proposes a novel method called Dual Feedback Attention Framework via Boundary-Aware Auxiliary and Progressive Semantic Optimization (DFA-BASO) for salient object detection in optical remote sensing imagery. By introducing the Boundary Protection Calibration and Dual Feature Feedback Complementary modules, this method reduces information loss, suppresses noise, and enhances the accuracy and completeness of salient objects."
}