{
    "title": "Error Analysis of Physics-Informed Neural Networks for Approximating Dynamic PDEs of Second Order in Time. (arXiv:2303.12245v1 [math.NA])",
    "abstract": "We consider the approximation of a class of dynamic partial differential equations (PDE) of second order in time by the physics-informed neural network (PINN) approach, and provide an error analysis of PINN for the wave equation, the Sine-Gordon equation and the linear elastodynamic equation. Our analyses show that, with feed-forward neural networks having two hidden layers and the $\\tanh$ activation function, the PINN approximation errors for the solution field, its time derivative and its gradient field can be effectively bounded by the training loss and the number of training data points (quadrature points). Our analyses further suggest new forms for the training loss function, which contain certain residuals that are crucial to the error estimate but would be absent from the canonical PINN loss formulation. Adopting these new forms for the loss function leads to a variant PINN algorithm. We present ample numerical experiments with the new PINN algorithm for the wave equation, the S",
    "link": "http://arxiv.org/abs/2303.12245",
    "context": "Title: Error Analysis of Physics-Informed Neural Networks for Approximating Dynamic PDEs of Second Order in Time. (arXiv:2303.12245v1 [math.NA])\nAbstract: We consider the approximation of a class of dynamic partial differential equations (PDE) of second order in time by the physics-informed neural network (PINN) approach, and provide an error analysis of PINN for the wave equation, the Sine-Gordon equation and the linear elastodynamic equation. Our analyses show that, with feed-forward neural networks having two hidden layers and the $\\tanh$ activation function, the PINN approximation errors for the solution field, its time derivative and its gradient field can be effectively bounded by the training loss and the number of training data points (quadrature points). Our analyses further suggest new forms for the training loss function, which contain certain residuals that are crucial to the error estimate but would be absent from the canonical PINN loss formulation. Adopting these new forms for the loss function leads to a variant PINN algorithm. We present ample numerical experiments with the new PINN algorithm for the wave equation, the S",
    "path": "papers/23/03/2303.12245.json",
    "total_tokens": 985,
    "translated_title": "物理启发式神经网络逼近二阶时间动力学偏微分方程的误差分析",
    "translated_abstract": "本文考虑利用物理启发式神经网络(PINN)方法逼近一类二阶时间动力学偏微分方程(PDE)，并对波动方程、正弦-戈登方程和线性弹性动力学方程进行PINN的误差分析。结果表明，在具有两个隐藏层和$\\tanh$激活函数的前馈神经网络中，PINN逼近误差可以通过训练损失和训练数据点数量(积分点)来有效地限制。我们进一步建议损失函数的新形式，其中包含某些残差，这些残差对误差估计至关重要，但在经典的PINN损失公式中可能不存在。采用这些新的损失函数形式可以导致一种变异的PINN算法。我们使用新的PINN算法对波动方程、正弦-戈登方程和线性弹性动力学方程进行了大量的数值实验，验证了误差估计的有效性并展示了新PINN算法的有效性。",
    "tldr": "本文采用物理启发式神经网络(PINN)方法逼近一类二阶时间动力学偏微分方程(PDE)，提出一种新的损失函数形式，有效限制了逼近误差，并通过数值实验验证了新算法的有效性。",
    "en_tdlr": "This paper uses the physics-informed neural network (PINN) approach to approximate a class of second-order dynamic partial differential equations (PDE) in time, proposes a new form of loss function that effectively bounds the approximation error, and validates the effectiveness of the new PINN algorithm through numerical experiments on the wave equation, the Sine-Gordon equation, and the linear elastodynamic equation."
}