{
    "title": "IRIS: Interpretable Rubric-Informed Segmentation for Action Quality Assessment. (arXiv:2303.09097v1 [cs.AI])",
    "abstract": "AI-driven Action Quality Assessment (AQA) of sports videos can mimic Olympic judges to help score performances as a second opinion or for training. However, these AI methods are uninterpretable and do not justify their scores, which is important for algorithmic accountability. Indeed, to account for their decisions, instead of scoring subjectively, sports judges use a consistent set of criteria - rubric - on multiple actions in each performance sequence. Therefore, we propose IRIS to perform Interpretable Rubric-Informed Segmentation on action sequences for AQA. We investigated IRIS for scoring videos of figure skating performance. IRIS predicts (1) action segments, (2) technical element score differences of each segment relative to base scores, (3) multiple program component scores, and (4) the summed final score. In a modeling study, we found that IRIS performs better than non-interpretable, state-of-the-art models. In a formative user study, practicing figure skaters agreed with the",
    "link": "http://arxiv.org/abs/2303.09097",
    "context": "Title: IRIS: Interpretable Rubric-Informed Segmentation for Action Quality Assessment. (arXiv:2303.09097v1 [cs.AI])\nAbstract: AI-driven Action Quality Assessment (AQA) of sports videos can mimic Olympic judges to help score performances as a second opinion or for training. However, these AI methods are uninterpretable and do not justify their scores, which is important for algorithmic accountability. Indeed, to account for their decisions, instead of scoring subjectively, sports judges use a consistent set of criteria - rubric - on multiple actions in each performance sequence. Therefore, we propose IRIS to perform Interpretable Rubric-Informed Segmentation on action sequences for AQA. We investigated IRIS for scoring videos of figure skating performance. IRIS predicts (1) action segments, (2) technical element score differences of each segment relative to base scores, (3) multiple program component scores, and (4) the summed final score. In a modeling study, we found that IRIS performs better than non-interpretable, state-of-the-art models. In a formative user study, practicing figure skaters agreed with the",
    "path": "papers/23/03/2303.09097.json",
    "total_tokens": 933,
    "tldr": "IRIS 是一个可解释的评分标准指导下的动作质量评估分割方法，通过使用一致的标准对多个动作进行评分，其表现优于其他非可解释的最先进模型。",
    "en_tdlr": "IRIS is an interpretable segmentation method for action quality assessment, which uses a consistent set of criteria to score multiple actions, outperforming other state-of-the-art non-interpretable models."
}