{
    "title": "Option pricing using a skew random walk pricing tree. (arXiv:2303.17014v1 [q-fin.MF])",
    "abstract": "Motivated by the Corns-Satchell, continuous time, option pricing model, we develop a binary tree pricing model with underlying asset price dynamics following It\\^o-Mckean skew Brownian motion. While the Corns-Satchell market model is incomplete, our discrete time market model is defined in the natural world; extended to the risk neutral world under the no-arbitrage condition where derivatives are priced under uniquely determined risk-neutral probabilities; and is complete. The skewness introduced in the natural world is preserved in the risk neutral world. Furthermore, we show that the model preserves skewness under the continuous-time limit. We provide numerical applications of our model to the valuation of European put and call options on exchange-traded funds tracking the S&P Global 1200 index.",
    "link": "http://arxiv.org/abs/2303.17014",
    "context": "Title: Option pricing using a skew random walk pricing tree. (arXiv:2303.17014v1 [q-fin.MF])\nAbstract: Motivated by the Corns-Satchell, continuous time, option pricing model, we develop a binary tree pricing model with underlying asset price dynamics following It\\^o-Mckean skew Brownian motion. While the Corns-Satchell market model is incomplete, our discrete time market model is defined in the natural world; extended to the risk neutral world under the no-arbitrage condition where derivatives are priced under uniquely determined risk-neutral probabilities; and is complete. The skewness introduced in the natural world is preserved in the risk neutral world. Furthermore, we show that the model preserves skewness under the continuous-time limit. We provide numerical applications of our model to the valuation of European put and call options on exchange-traded funds tracking the S&P Global 1200 index.",
    "path": "papers/23/03/2303.17014.json",
    "total_tokens": 891,
    "translated_title": "使用偏斜随机漫步定价树的期权定价",
    "translated_abstract": "受Corns-Satchell 连续时间期权定价模型的启发，我们开发了一个二叉树定价模型，其中基础资产价格动态遵循It\\^o-Mckean偏斜布朗运动。尽管Corns-Satchell市场模型不完备，但我们的离散时间市场模型定义于自然世界中，在无套利条件下在风险中性世界下进行扩展，其中衍生品是以唯一确定的风险中性概率进行定价的。并且是完备的。自然界中引入的偏斜在风险中性世界中被保留。此外，我们证明了该模型在连续时间极限下保持偏斜。我们向交易所交易的跟踪S＆P全球1200指数的ETF上的欧式看涨期权和看跌期权的估值提供了数字应用。",
    "tldr": "本论文提出了基于二叉树模型和It\\^o-Mckean偏斜布朗运动的期权定价模型，继承自然界的偏斜性质，并在风险中性世界中得以保留，具备完备性质。应用于估值的数字应用，可计算交易所的欧式看涨期权和看跌期权的价格。",
    "en_tdlr": "This paper proposes a binary tree pricing model with underlying asset price dynamics following It\\^o-Mckean skew Brownian motion for option pricing. The model preserves the skewness property from the natural world to the risk-neutral world and remains complete. Numerical applications show its viability in valuing European put and call options on exchange-traded funds."
}