{
    "title": "Mitigating Decentralized Finance Liquidations with Reversible Call Options. (arXiv:2303.15162v1 [q-fin.PR])",
    "abstract": "Liquidations in DeFi are both a blessing and a curse -- whereas liquidations prevent lenders from capital loss, they simultaneously lead to liquidation spirals and system-wide failures. Since most lending and borrowing protocols assume liquidations are indispensable, there is an increased interest in alternative constructions that prevent immediate systemic-failure under uncertain circumstances.  In this work, we introduce reversible call options, a novel financial primitive that enables the seller of a call option to terminate it before maturity. We apply reversible call options to lending in DeFi and devise Miqado, a protocol for lending platforms to replace the liquidation mechanisms. To the best of our knowledge, Miqado is the first protocol that actively mitigates liquidations to reduce the risk of liquidation spirals. Instead of selling collateral, Miqado incentivizes external entities, so-called supporters, to top-up a borrowing position and grant the borrower additional time to",
    "link": "http://arxiv.org/abs/2303.15162",
    "context": "Title: Mitigating Decentralized Finance Liquidations with Reversible Call Options. (arXiv:2303.15162v1 [q-fin.PR])\nAbstract: Liquidations in DeFi are both a blessing and a curse -- whereas liquidations prevent lenders from capital loss, they simultaneously lead to liquidation spirals and system-wide failures. Since most lending and borrowing protocols assume liquidations are indispensable, there is an increased interest in alternative constructions that prevent immediate systemic-failure under uncertain circumstances.  In this work, we introduce reversible call options, a novel financial primitive that enables the seller of a call option to terminate it before maturity. We apply reversible call options to lending in DeFi and devise Miqado, a protocol for lending platforms to replace the liquidation mechanisms. To the best of our knowledge, Miqado is the first protocol that actively mitigates liquidations to reduce the risk of liquidation spirals. Instead of selling collateral, Miqado incentivizes external entities, so-called supporters, to top-up a borrowing position and grant the borrower additional time to",
    "path": "papers/23/03/2303.15162.json",
    "total_tokens": 870,
    "translated_title": "用可逆认购期权缓解去中心化金融清算问题",
    "translated_abstract": "去中心化金融中的清算既是福音也是咒诅——尽管可以防止放贷人的资本损失，但同时也导致清算螺旋和系统性失败。本文介绍了可逆认购期权——一种新的金融原语，使得认购期权的卖方能在到期前终止它。我们将可逆认购期权应用到去中心化金融的借贷中，并设计了Miqado——一个替代清算机制的借贷协议。据我们所知，Miqado是首个积极缓解清算以减少清算螺旋风险的协议。Miqado并不是卖出抵押品，它鼓励外部实体——所谓的支持者，来补充借贷头寸，并为借方提供额外时间。",
    "tldr": "本文提出了可逆认购期权的金融原语，将其运用于去中心化金融的借贷中，设计了Miqado借贷协议，作为清算机制的替代方案，通过鼓励支持者来缓解清算风险。",
    "en_tdlr": "This article proposes a novel financial primitive, reversible call options, and applies it to lending in DeFi to develop the Miqado protocol, which replaces traditional liquidation mechanisms and mitigates the risk of liquidation spirals by incentivizing external entities to support borrowing positions."
}