{
    "title": "Automated deep learning segmentation of high-resolution 7 T ex vivo MRI for quantitative analysis of structure-pathology correlations in neurodegenerative diseases. (arXiv:2303.12237v1 [cs.CV])",
    "abstract": "Ex vivo MRI of the brain provides remarkable advantages over in vivo MRI for visualizing and characterizing detailed neuroanatomy, and helps to link microscale histology studies with morphometric measurements. However, automated segmentation methods for brain mapping in ex vivo MRI are not well developed, primarily due to limited availability of labeled datasets, and heterogeneity in scanner hardware and acquisition protocols. In this work, we present a high resolution dataset of 37 ex vivo post-mortem human brain tissue specimens scanned on a 7T whole-body MRI scanner. We developed a deep learning pipeline to segment the cortical mantle by benchmarking the performance of nine deep neural architectures. We then segment the four subcortical structures: caudate, putamen, globus pallidus, and thalamus; white matter hyperintensities, and the normal appearing white matter. We show excellent generalizing capabilities across whole brain hemispheres in different specimens, and also on unseen i",
    "link": "http://arxiv.org/abs/2303.12237",
    "context": "Title: Automated deep learning segmentation of high-resolution 7 T ex vivo MRI for quantitative analysis of structure-pathology correlations in neurodegenerative diseases. (arXiv:2303.12237v1 [cs.CV])\nAbstract: Ex vivo MRI of the brain provides remarkable advantages over in vivo MRI for visualizing and characterizing detailed neuroanatomy, and helps to link microscale histology studies with morphometric measurements. However, automated segmentation methods for brain mapping in ex vivo MRI are not well developed, primarily due to limited availability of labeled datasets, and heterogeneity in scanner hardware and acquisition protocols. In this work, we present a high resolution dataset of 37 ex vivo post-mortem human brain tissue specimens scanned on a 7T whole-body MRI scanner. We developed a deep learning pipeline to segment the cortical mantle by benchmarking the performance of nine deep neural architectures. We then segment the four subcortical structures: caudate, putamen, globus pallidus, and thalamus; white matter hyperintensities, and the normal appearing white matter. We show excellent generalizing capabilities across whole brain hemispheres in different specimens, and also on unseen i",
    "path": "papers/23/03/2303.12237.json",
    "total_tokens": 1170,
    "translated_title": "用于神经退行性疾病结构病理相关性定量分析的高分辨率7T离体MRI的自动化深度学习分割",
    "translated_abstract": "相较于在 vivo MRI，大脑离体 MRI 提供了明显的优势，可用于可视化和表征详细的神经解剖，协助将微观组织学研究与形态测量相联系。然而，由于受限于标记数据集的有限可用性和扫描器硬件和采集协议的异质性，离体 MRI 的脑区域分割自动化方法并不发达。在本研究中，我们提出了一个高分辨率数据集，包含在7T全身MRI扫描器上扫描的37个离体人脑组织标本。我们开发了一个深度学习管道来分割皮层，通过对九种深度神经体系结构的性能进行基准测试。然后，我们对四个皮质下结构（尾状核，脑豆核，苍白球和丘脑）、白质高信号以及正常出现的白质进行分割。我们展示了不同标本的全脑半球之间的出色的泛化能力，也展示了在看不见的硬件上的泛化能力。我们的方法有潜力提高神经病理学和神经退行性疾病结构病理相关性的定量分析的效率和准确性。",
    "tldr": "本文提出了一个深度学习分割管道，用于离体MRI图像的自动化分割。基于37个标本的高分辨率7 T MRI图像，该方法可准确分割整个脑半球，包括皮层、皮质下结构、白质高信号以及正常出现的白质。该方法可为神经病理学研究提供帮助。",
    "en_tdlr": "This paper presents a deep learning pipeline for automated segmentation of ex vivo MRI images. Based on a high-resolution 7T MRI dataset of 37 specimens, the method accurately segments the entire brain hemisphere, including the cortical mantle, subcortical structures, white matter hyperintensities, and normal appearing white matter. The approach has the potential to aid in neuropathology research."
}