{
    "title": "Domain Knowledge integrated for Blast Furnace Classifier Design. (arXiv:2303.17769v1 [cs.LG])",
    "abstract": "Blast furnace modeling and control is one of the important problems in the industrial field, and the black-box model is an effective mean to describe the complex blast furnace system. In practice, there are often different learning targets, such as safety and energy saving in industrial applications, depending on the application. For this reason, this paper proposes a framework to design a domain knowledge integrated classification model that yields a classifier for industrial application. Our knowledge incorporated learning scheme allows the users to create a classifier that identifies \"important samples\" (whose misclassifications can lead to severe consequences) more correctly, while keeping the proper precision of classifying the remaining samples. The effectiveness of the proposed method has been verified by two real blast furnace datasets, which guides the operators to utilize their prior experience for controlling the blast furnace systems better.",
    "link": "http://arxiv.org/abs/2303.17769",
    "context": "Title: Domain Knowledge integrated for Blast Furnace Classifier Design. (arXiv:2303.17769v1 [cs.LG])\nAbstract: Blast furnace modeling and control is one of the important problems in the industrial field, and the black-box model is an effective mean to describe the complex blast furnace system. In practice, there are often different learning targets, such as safety and energy saving in industrial applications, depending on the application. For this reason, this paper proposes a framework to design a domain knowledge integrated classification model that yields a classifier for industrial application. Our knowledge incorporated learning scheme allows the users to create a classifier that identifies \"important samples\" (whose misclassifications can lead to severe consequences) more correctly, while keeping the proper precision of classifying the remaining samples. The effectiveness of the proposed method has been verified by two real blast furnace datasets, which guides the operators to utilize their prior experience for controlling the blast furnace systems better.",
    "path": "papers/23/03/2303.17769.json",
    "total_tokens": 790,
    "translated_title": "爆炉分类器设计中融合领域知识",
    "translated_abstract": "爆炉建模和控制是工业领域中的重要问题，黑匣子模型是描述复杂爆炉系统的有效手段。为了满足工业应用中的安全和节能等不同学习目标，本文提出了一种框架，用于设计融合领域知识的分类模型，生成适用于工业应用的分类器。我们的知识融入学习方案允许用户更正确地创建一个分类器，以识别“重要样本”（其错误分类可能导致严重后果），同时保持恰当的分类精度。所提出的方法的有效性已经通过两个真实的爆炉数据集得到验证，这将指导操作人员更好地利用他们的先前经验来控制爆炉系统。",
    "tldr": "本文设计了一种融合领域知识的分类模型框架，生成适用于工业应用的分类器，有效解决了安全和能源等不同学习目标下爆炉复杂系统的问题。",
    "en_tdlr": "This paper proposes a classification model framework that integrates domain knowledge, which yields a classifier suitable for industrial application to solve the problems of complex blast furnace systems under different learning objectives such as safety and energy saving."
}