{
    "title": "GPU-accelerated Matrix Cover Algorithm for Multiple Patterning Layout Decomposition. (arXiv:2303.14335v1 [cs.AI])",
    "abstract": "Multiple patterning lithography (MPL) is regarded as one of the most promising ways of overcoming the resolution limitations of conventional optical lithography due to the delay of next-generation lithography technology. As the feature size continues to decrease, layout decomposition for multiple patterning lithography (MPLD) technology is becoming increasingly crucial for improving the manufacturability in advanced nodes. The decomposition process refers to assigning the layout features to different mask layers according to the design rules and density requirements. When the number of masks $k \\geq 3$, the MPLD problems are NP-hard and thus may suffer from runtime overhead for practical designs. However, the number of layout patterns is increasing exponentially in industrial layouts, which hinders the runtime performance of MPLD models. In this research, we substitute the CPU's dance link data structure with parallel GPU matrix operations to accelerate the solution for exact cover-bas",
    "link": "http://arxiv.org/abs/2303.14335",
    "context": "Title: GPU-accelerated Matrix Cover Algorithm for Multiple Patterning Layout Decomposition. (arXiv:2303.14335v1 [cs.AI])\nAbstract: Multiple patterning lithography (MPL) is regarded as one of the most promising ways of overcoming the resolution limitations of conventional optical lithography due to the delay of next-generation lithography technology. As the feature size continues to decrease, layout decomposition for multiple patterning lithography (MPLD) technology is becoming increasingly crucial for improving the manufacturability in advanced nodes. The decomposition process refers to assigning the layout features to different mask layers according to the design rules and density requirements. When the number of masks $k \\geq 3$, the MPLD problems are NP-hard and thus may suffer from runtime overhead for practical designs. However, the number of layout patterns is increasing exponentially in industrial layouts, which hinders the runtime performance of MPLD models. In this research, we substitute the CPU's dance link data structure with parallel GPU matrix operations to accelerate the solution for exact cover-bas",
    "path": "papers/23/03/2303.14335.json",
    "total_tokens": 1127,
    "translated_title": "多重图案版式分解中的GPU加速矩阵覆盖算法",
    "translated_abstract": "多重图案光刻（MPL）被认为是克服常规光学光刻分辨率限制的最有希望的方式之一，由于下一代光刻技术的延迟。 随着晶体管尺寸的不断缩小，适用于多次互锁（MPLD）技术的布局分解变得越来越关键，以提高先进节点中的可制造性。当掩膜数 $k \\geq 3$ 时，MPLD问题是NP难问题，因此对于实际设计可能会出现运行时间开销。然而，布局模式的数量在工业布局中呈指数增长，这妨碍了MPLD模型的运行时性能。 在本研究中，我们用并行GPU矩阵操作替换了CPU的跳舞链数据结构，以加速解决基于精确覆盖的MPLD问题。我们的GPU加速矩阵覆盖算法（GAMCA）旨在处理具有数千个约束条件的MPLD问题，时间仅为以前解决方案所需的一小部分。实验结果表明，在NVIDIA GTX 1080 Ti上，GAMCA比最先进的算法快5-7倍，在24核机器上，比并行CPU算法快100倍。我们的方法为具有挑战性的MPLD问题提供了高效的解决方案，并可以有效地应用于各种EDA软件系统中。",
    "tldr": "本文提出了一种GPU加速矩阵覆盖算法(GAMCA), 通过使用并行GPU矩阵操作替换CPU跳舞链数据结构，以加速解决基于精确覆盖的多重图案版式分解中的NP难问题。实验结果显示，GAMCA比最先进的算法快5-7倍，在24核机器上，比并行CPU算法快100倍。"
}