{
    "title": "Feedback Effect in User Interaction with Intelligent Assistants: Delayed Engagement, Adaption and Drop-out. (arXiv:2303.10255v1 [cs.HC])",
    "abstract": "With the growing popularity of intelligent assistants (IAs), evaluating IA quality becomes an increasingly active field of research. This paper identifies and quantifies the feedback effect, a novel component in IA-user interactions: how the capabilities and limitations of the IA influence user behavior over time. First, we demonstrate that unhelpful responses from the IA cause users to delay or reduce subsequent interactions in the short term via an observational study. Next, we expand the time horizon to examine behavior changes and show that as users discover the limitations of the IA's understanding and functional capabilities, they learn to adjust the scope and wording of their requests to increase the likelihood of receiving a helpful response from the IA. Our findings highlight the impact of the feedback effect at both the micro and meso levels. We further discuss its macro-level consequences: unsatisfactory interactions continuously reduce the likelihood and diversity of future",
    "link": "http://arxiv.org/abs/2303.10255",
    "context": "Title: Feedback Effect in User Interaction with Intelligent Assistants: Delayed Engagement, Adaption and Drop-out. (arXiv:2303.10255v1 [cs.HC])\nAbstract: With the growing popularity of intelligent assistants (IAs), evaluating IA quality becomes an increasingly active field of research. This paper identifies and quantifies the feedback effect, a novel component in IA-user interactions: how the capabilities and limitations of the IA influence user behavior over time. First, we demonstrate that unhelpful responses from the IA cause users to delay or reduce subsequent interactions in the short term via an observational study. Next, we expand the time horizon to examine behavior changes and show that as users discover the limitations of the IA's understanding and functional capabilities, they learn to adjust the scope and wording of their requests to increase the likelihood of receiving a helpful response from the IA. Our findings highlight the impact of the feedback effect at both the micro and meso levels. We further discuss its macro-level consequences: unsatisfactory interactions continuously reduce the likelihood and diversity of future",
    "path": "papers/23/03/2303.10255.json",
    "total_tokens": 934,
    "tldr": "本文研究了智能助手的反馈效应，发现用户会受到IA的能力和局限性影响，不满意的交互会导致短期内延迟或减少后续交互，但用户在长期内也会学会调整自己的请求以获得更好的结果。"
}