{
    "title": "A Slow-Shifting Concerned Machine Learning Method for Short-term Traffic Flow Forecasting. (arXiv:2303.17782v1 [cs.LG])",
    "abstract": "The ability to predict traffic flow over time for crowded areas during rush hours is increasingly important as it can help authorities make informed decisions for congestion mitigation or scheduling of infrastructure development in an area. However, a crucial challenge in traffic flow forecasting is the slow shifting in temporal peaks between daily and weekly cycles, resulting in the nonstationarity of the traffic flow signal and leading to difficulty in accurate forecasting. To address this challenge, we propose a slow shifting concerned machine learning method for traffic flow forecasting, which includes two parts. First, we take advantage of Empirical Mode Decomposition as the feature engineering to alleviate the nonstationarity of traffic flow data, yielding a series of stationary components. Second, due to the superiority of Long-Short-Term-Memory networks in capturing temporal features, an advanced traffic flow forecasting model is developed by taking the stationary components as",
    "link": "http://arxiv.org/abs/2303.17782",
    "context": "Title: A Slow-Shifting Concerned Machine Learning Method for Short-term Traffic Flow Forecasting. (arXiv:2303.17782v1 [cs.LG])\nAbstract: The ability to predict traffic flow over time for crowded areas during rush hours is increasingly important as it can help authorities make informed decisions for congestion mitigation or scheduling of infrastructure development in an area. However, a crucial challenge in traffic flow forecasting is the slow shifting in temporal peaks between daily and weekly cycles, resulting in the nonstationarity of the traffic flow signal and leading to difficulty in accurate forecasting. To address this challenge, we propose a slow shifting concerned machine learning method for traffic flow forecasting, which includes two parts. First, we take advantage of Empirical Mode Decomposition as the feature engineering to alleviate the nonstationarity of traffic flow data, yielding a series of stationary components. Second, due to the superiority of Long-Short-Term-Memory networks in capturing temporal features, an advanced traffic flow forecasting model is developed by taking the stationary components as",
    "path": "papers/23/03/2303.17782.json",
    "total_tokens": 911,
    "translated_title": "一种用于短期交通流量预测的关注缓慢变化的机器学习方法",
    "translated_abstract": "预测拥挤区域的交通流量变化对当局制定缓解拥堵的措施或安排基础设施建设至关重要。然而，交通流量预测面临一个关键挑战，即每日和每周峰值之间缓慢变化的时间漂移，导致交通流量信号的非平稳性，进而导致准确预测的困难。为解决这一挑战，我们提出了一种关注缓慢变化的机器学习方法来预测交通流量，其包括两个部分。首先，我们利用经验模态分解作为特征工程，以减轻交通流量数据的非平稳性，得到一系列平稳分量。其次，由于长短期记忆网络在捕捉时间特征方面的优越性，我们以平稳分量为特征训练一个先进的交通流量预测模型。",
    "tldr": "该论文提出了一种关注缓慢变化的机器学习方法来解决交通流量预测中的时间漂移问题，该方法包括经验模态分解和长短期记忆网络等步骤，可缓解交通流量数据的非平稳性，提高交通流量预测的准确性。",
    "en_tdlr": "This paper proposes a slow shifting concerned machine learning method for short-term traffic flow forecasting by utilizing Empirical Mode Decomposition and Long-Short-Term-Memory networks to alleviate the nonstationarity of traffic flow data and improve the accuracy of prediction."
}