{
    "title": "Is In-hospital Meta-information Useful for Abstractive Discharge Summary Generation?. (arXiv:2303.06002v1 [cs.CL])",
    "abstract": "During the patient's hospitalization, the physician must record daily observations of the patient and summarize them into a brief document called \"discharge summary\" when the patient is discharged. Automated generation of discharge summary can greatly relieve the physicians' burden, and has been addressed recently in the research community. Most previous studies of discharge summary generation using the sequence-to-sequence architecture focus on only inpatient notes for input. However, electric health records (EHR) also have rich structured metadata (e.g., hospital, physician, disease, length of stay, etc.) that might be useful. This paper investigates the effectiveness of medical meta-information for summarization tasks. We obtain four types of meta-information from the EHR systems and encode each meta-information into a sequence-to-sequence model. Using Japanese EHRs, meta-information encoded models increased ROUGE-1 by up to 4.45 points and BERTScore by 3.77 points over the vanilla ",
    "link": "http://arxiv.org/abs/2303.06002",
    "raw_ret": "{\n    \"translated_title\": \"住院元信息对抽象出院摘要生成是否有用？\",\n    \"translated_abstract\": \"在病人住院期间，医生必须记录病人的日常观察结果，并在病人出院时将它们总结为一份简短的文档，称为“出院摘要”。自动化生成出院摘要可以大大减轻医生的负担，并最近得到研究界的关注。大多数以序列到序列架构为基础的出院摘要生成研究只关注住院记录作为输入。然而，电子健康记录（EHR）还具有丰富的结构化元数据（例如，医院、医生、疾病、住院时间等），可能会有所帮助。本文研究了医疗元信息对总结任务的有效性。我们从EHR系统获取了四种类型的元信息，并将每个元信息编码到序列到序列模型中。使用日本EHR，编码元信息的模型将ROUGE-1提高了最多4.45个点，BERTScore提高了3.77个点，超过了基本模型。\",\n    \"tldr\": \"本论文研究了电子健康记录系统中住院元信息对于出院摘要生成任务的有效性。研究表明，将编码元信息的模型与基本模型相比，可以显著提高摘要生成的ROUGE-1和BERTScore评分。\"\n}",
    "total_tokens": 886,
    "ret": {
        "translated_title": "住院元信息对抽象出院摘要生成是否有用？",
        "translated_abstract": "在病人住院期间，医生必须记录病人的日常观察结果，并在病人出院时将它们总结为一份简短的文档，称为“出院摘要”。自动化生成出院摘要可以大大减轻医生的负担，并最近得到研究界的关注。大多数以序列到序列架构为基础的出院摘要生成研究只关注住院记录作为输入。然而，电子健康记录（EHR）还具有丰富的结构化元数据（例如，医院、医生、疾病、住院时间等），可能会有所帮助。本文研究了医疗元信息对总结任务的有效性。我们从EHR系统获取了四种类型的元信息，并将每个元信息编码到序列到序列模型中。使用日本EHR，编码元信息的模型将ROUGE-1提高了最多4.45个点，BERTScore提高了3.77个点，超过了基本模型。",
        "tldr": "本论文研究了电子健康记录系统中住院元信息对于出院摘要生成任务的有效性。研究表明，将编码元信息的模型与基本模型相比，可以显著提高摘要生成的ROUGE-1和BERTScore评分。"
    }
}