{
    "title": "HD-Bind: Encoding of Molecular Structure with Low Precision, Hyperdimensional Binary Representations. (arXiv:2303.15604v1 [q-bio.BM])",
    "abstract": "Publicly available collections of drug-like molecules have grown to comprise 10s of billions of possibilities in recent history due to advances in chemical synthesis. Traditional methods for identifying ``hit'' molecules from a large collection of potential drug-like candidates have relied on biophysical theory to compute approximations to the Gibbs free energy of the binding interaction between the drug to its protein target. A major drawback of the approaches is that they require exceptional computing capabilities to consider for even relatively small collections of molecules.  Hyperdimensional Computing (HDC) is a recently proposed learning paradigm that is able to leverage low-precision binary vector arithmetic to build efficient representations of the data that can be obtained without the need for gradient-based optimization approaches that are required in many conventional machine learning and deep learning approaches. This algorithmic simplicity allows for acceleration in hardwa",
    "link": "http://arxiv.org/abs/2303.15604",
    "context": "Title: HD-Bind: Encoding of Molecular Structure with Low Precision, Hyperdimensional Binary Representations. (arXiv:2303.15604v1 [q-bio.BM])\nAbstract: Publicly available collections of drug-like molecules have grown to comprise 10s of billions of possibilities in recent history due to advances in chemical synthesis. Traditional methods for identifying ``hit'' molecules from a large collection of potential drug-like candidates have relied on biophysical theory to compute approximations to the Gibbs free energy of the binding interaction between the drug to its protein target. A major drawback of the approaches is that they require exceptional computing capabilities to consider for even relatively small collections of molecules.  Hyperdimensional Computing (HDC) is a recently proposed learning paradigm that is able to leverage low-precision binary vector arithmetic to build efficient representations of the data that can be obtained without the need for gradient-based optimization approaches that are required in many conventional machine learning and deep learning approaches. This algorithmic simplicity allows for acceleration in hardwa",
    "path": "papers/23/03/2303.15604.json",
    "total_tokens": 1146,
    "translated_title": "HD-Bind：使用低精度、超高维度二进制编码分子结构",
    "translated_abstract": "近年来，随着化学合成技术的进步，公开可用的类似药物的分子集合已经增长到数十亿个可能性。然而，传统的从大量药物候选中确定“命中”分子的方法依赖于生物物理理论来计算药物与其蛋白质靶标之间结合相互作用的吉布斯自由能的近似值。该方法的主要缺点是即使对于相对较小的分子集合，也需要出色的计算能力。Hyperdimensional Computing（HDC）是一种最近提出的学习范式，它能够利用低精度二进制向量算术来构建数据的有效表示，而不需要渐进式优化方法，这些优化方法在许多传统的机器学习和深度学习方法中是必需的。本文介绍了HD-Bind，一种将分子结构表示为超高维度二进制向量的方法，用于预测蛋白质中小分子的分子间结合亲和力。HD-Bind构建了超维二进制向量，表示分子结构，并能够捕获与蛋白质-配体结合相关的结构特征，同时显著减少了存储和计算所需的位数。我们的结果表明，HD-Bind优于现有的方法，并为在其他药物发现应用中使用HDC铺平了道路。",
    "tldr": "HD-Bind是一种用于表示分子结构的超高维度二进制向量的方法，能够预测蛋白质中小分子的分子间结合亲和力。它显著减少了存储和计算所需的位数，并在药物发现中优于现有的方法。",
    "en_tdlr": "HD-Bind is a method for representing molecular structure using hyperdimensional binary vectors, capable of predicting intermolecular binding affinities for small molecules in proteins. It significantly reduces the number of bits required for storage and computation and outperforms existing methods in drug discovery."
}