{
    "title": "The crime of being poor. (arXiv:2303.14128v1 [cs.CL])",
    "abstract": "The criminalization of poverty has been widely denounced as a collective bias against the most vulnerable. NGOs and international organizations claim that the poor are blamed for their situation, are more often associated with criminal offenses than the wealthy strata of society and even incur criminal offenses simply as a result of being poor. While no evidence has been found in the literature that correlates poverty and overall criminality rates, this paper offers evidence of a collective belief that associates both concepts. This brief report measures the societal bias that correlates criminality with the poor, as compared to the rich, by using Natural Language Processing (NLP) techniques in Twitter. The paper quantifies the level of crime-poverty bias in a panel of eight different English-speaking countries. The regional differences in the association between crime and poverty cannot be justified based on different levels of inequality or unemployment, which the literature correlat",
    "link": "http://arxiv.org/abs/2303.14128",
    "context": "Title: The crime of being poor. (arXiv:2303.14128v1 [cs.CL])\nAbstract: The criminalization of poverty has been widely denounced as a collective bias against the most vulnerable. NGOs and international organizations claim that the poor are blamed for their situation, are more often associated with criminal offenses than the wealthy strata of society and even incur criminal offenses simply as a result of being poor. While no evidence has been found in the literature that correlates poverty and overall criminality rates, this paper offers evidence of a collective belief that associates both concepts. This brief report measures the societal bias that correlates criminality with the poor, as compared to the rich, by using Natural Language Processing (NLP) techniques in Twitter. The paper quantifies the level of crime-poverty bias in a panel of eight different English-speaking countries. The regional differences in the association between crime and poverty cannot be justified based on different levels of inequality or unemployment, which the literature correlat",
    "path": "papers/23/03/2303.14128.json",
    "total_tokens": 814,
    "translated_title": "贫穷的罪行",
    "translated_abstract": "贫穷犯罪化一直被公认为是一种对最弱势群体的集体偏见。NGO和国际组织声称，穷人因其处境而受到指责，与刑事犯罪的触发因素的关联性比富人更高，甚至只是因为贫穷而犯罪。然而，文献中没有找到贫穷与整体犯罪率之间的相关证据，本文利用自然语言处理技术在Twitter中量化了在八个英语国家面板中，犯罪和贫穷之间的社会偏见水平，并测量了该观念的程度。根据文献相关的不同水平的不平等或失业，不足以证明在犯罪和贫穷之间的联想所呈现出的区域性差异。",
    "tldr": "本文使用自然语言处理技术在Twitter中分析了八个英语国家对贫穷与犯罪之间关联的社会偏见水平，结果显示出了对最弱势群体的集体偏见。"
}