{
    "title": "DroNeRF: Real-time Multi-agent Drone Pose Optimization for Computing Neural Radiance Fields. (arXiv:2303.04322v2 [cs.RO] UPDATED)",
    "abstract": "We present a novel optimization algorithm called DroNeRF for the autonomous positioning of monocular camera drones around an object for real-time 3D reconstruction using only a few images. Neural Radiance Fields or NeRF, is a novel view synthesis technique used to generate new views of an object or scene from a set of input images. Using drones in conjunction with NeRF provides a unique and dynamic way to generate novel views of a scene, especially with limited scene capabilities of restricted movements. Our approach focuses on calculating optimized pose for individual drones while solely depending on the object geometry without using any external localization system. The unique camera positioning during the data-capturing phase significantly impacts the quality of the 3D model. To evaluate the quality of our generated novel views, we compute different perceptual metrics like the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index Measure(SSIM). Our work demonstrates the ",
    "link": "http://arxiv.org/abs/2303.04322",
    "context": "Title: DroNeRF: Real-time Multi-agent Drone Pose Optimization for Computing Neural Radiance Fields. (arXiv:2303.04322v2 [cs.RO] UPDATED)\nAbstract: We present a novel optimization algorithm called DroNeRF for the autonomous positioning of monocular camera drones around an object for real-time 3D reconstruction using only a few images. Neural Radiance Fields or NeRF, is a novel view synthesis technique used to generate new views of an object or scene from a set of input images. Using drones in conjunction with NeRF provides a unique and dynamic way to generate novel views of a scene, especially with limited scene capabilities of restricted movements. Our approach focuses on calculating optimized pose for individual drones while solely depending on the object geometry without using any external localization system. The unique camera positioning during the data-capturing phase significantly impacts the quality of the 3D model. To evaluate the quality of our generated novel views, we compute different perceptual metrics like the Peak Signal-to-Noise Ratio (PSNR) and Structural Similarity Index Measure(SSIM). Our work demonstrates the ",
    "path": "papers/23/03/2303.04322.json",
    "total_tokens": 912,
    "translated_title": "DroNeRF: 实时多代理无人机位姿优化用于计算神经辐射场",
    "translated_abstract": "我们提出了一种新的优化算法DroNeRF，用于自主定位单目无人机围绕一个物体进行实时三维重建，只使用少量图像。神经辐射场（Neural Radiance Fields）是一种新颖的视图合成技术，用于从一组输入图像生成物体或场景的新视图。使用无人机结合NeRF提供了一种独特而动态的方式来生成场景的新视图，尤其是在场景能力有限且移动受限的情况下。我们的方法侧重于计算各个无人机的优化位姿，仅依赖于物体几何而不使用任何外部定位系统。在数据捕获阶段期间独特的相机定位显著影响着3D模型的质量。为了评估我们生成的新视图的质量，我们计算了不同的感知度量，如峰值信噪比（PSNR）和结构相似性指数测度（SSIM）。",
    "tldr": "DroNeRF是一种实时多代理无人机位姿优化算法，在只使用少量图像的情况下，通过计算物体几何来实现自主定位和3D重建，并结合神经辐射场技术生成独特而动态的新视图。",
    "en_tdlr": "DroNeRF is a real-time multi-agent drone pose optimization algorithm that achieves autonomous positioning and 3D reconstruction by calculating object geometry, using only a few images, and generates unique and dynamic new views in conjunction with Neural Radiance Fields technique."
}