{
    "title": "Complementarity in Demand-side Variables and Educational Participation. (arXiv:2303.04647v2 [econ.TH] UPDATED)",
    "abstract": "Decision to participate in education depends on the circumstances individual inherits and on the returns to education she expects as well. If one person from any socio-economically disadvantaged social group inherits poor circumstances measured in terms of family background, then she is having poor opportunities vis-\\`a-vis her capability set becomes confined. Accordingly, her freedom to choose the best alternative from many is also less, and she fails to expect the potential returns from educational participation. Consequently, a complementary relationship between the circumstances one inherits and the returns to education she expects can be observed. This paper is an attempt to look at this complementarity on the basis of theoretical logic and empirical investigation, which enables us to unearth the origin of inter-group disparity in educational participation, as is existed across the groups defined by taking caste and gender together in Indian society. Furthermore, in the second pie",
    "link": "http://arxiv.org/abs/2303.04647",
    "context": "Title: Complementarity in Demand-side Variables and Educational Participation. (arXiv:2303.04647v2 [econ.TH] UPDATED)\nAbstract: Decision to participate in education depends on the circumstances individual inherits and on the returns to education she expects as well. If one person from any socio-economically disadvantaged social group inherits poor circumstances measured in terms of family background, then she is having poor opportunities vis-\\`a-vis her capability set becomes confined. Accordingly, her freedom to choose the best alternative from many is also less, and she fails to expect the potential returns from educational participation. Consequently, a complementary relationship between the circumstances one inherits and the returns to education she expects can be observed. This paper is an attempt to look at this complementarity on the basis of theoretical logic and empirical investigation, which enables us to unearth the origin of inter-group disparity in educational participation, as is existed across the groups defined by taking caste and gender together in Indian society. Furthermore, in the second pie",
    "path": "papers/23/03/2303.04647.json",
    "total_tokens": 820,
    "translated_title": "需求侧变量与教育参与中的互补性",
    "translated_abstract": "教育参与的决定取决于个体继承的环境，以及她所期望的教育回报。如果任何一个社会经济劣势群体中的个人继承了以家庭背景衡量的不良环境，那么她的能力集限制了，拥有的选择最佳方案的自由也较少，从教育参与中获得的潜在回报也更少。因此，可以观察到继承环境与预期教育回报之间具有互补关系。本文基于理论逻辑和实证调查来研究这种互补性，从而揭示了印度社会中以种姓和性别定义的群体之间存在的教育参与不平等的根源。",
    "tldr": "本文研究了继承环境与预期教育回报之间的互补关系，揭示了印度社会中以种姓和性别定义的群体之间存在的教育参与不平等的根源。",
    "en_tdlr": "This paper examines the complementarity between the circumstances one inherits and the returns to education she expects, and reveals the origin of inter-group disparity in educational participation, as is existed across the groups defined by taking caste and gender together in Indian society."
}