{
    "title": "CHAMPAGNE: Learning Real-world Conversation from Large-Scale Web Videos. (arXiv:2303.09713v1 [cs.CL])",
    "abstract": "Visual information is central to conversation: body gestures and facial expressions, for example, contribute to meaning that transcends words alone. To date, however, most neural conversational models are limited to just text. We introduce CHAMPAGNE, a generative model of conversations that can account for visual contexts. To train CHAMPAGNE, we collect and release YTD-18M, a large-scale corpus of 18M video-based dialogues. YTD-18M is constructed from web videos: crucial to our data collection pipeline is a pretrained language model that converts error-prone automatic transcripts to a cleaner dialogue format while maintaining meaning. Human evaluation reveals that YTD-18M is more sensible and specific than prior resources (MMDialog, 1M dialogues), while maintaining visual-groundedness. Experiments demonstrate that 1) CHAMPAGNE learns to conduct conversation from YTD-18M; and 2) when fine-tuned, it achieves state-of-the-art results on four vision-language tasks focused on real-world con",
    "link": "http://arxiv.org/abs/2303.09713",
    "context": "Title: CHAMPAGNE: Learning Real-world Conversation from Large-Scale Web Videos. (arXiv:2303.09713v1 [cs.CL])\nAbstract: Visual information is central to conversation: body gestures and facial expressions, for example, contribute to meaning that transcends words alone. To date, however, most neural conversational models are limited to just text. We introduce CHAMPAGNE, a generative model of conversations that can account for visual contexts. To train CHAMPAGNE, we collect and release YTD-18M, a large-scale corpus of 18M video-based dialogues. YTD-18M is constructed from web videos: crucial to our data collection pipeline is a pretrained language model that converts error-prone automatic transcripts to a cleaner dialogue format while maintaining meaning. Human evaluation reveals that YTD-18M is more sensible and specific than prior resources (MMDialog, 1M dialogues), while maintaining visual-groundedness. Experiments demonstrate that 1) CHAMPAGNE learns to conduct conversation from YTD-18M; and 2) when fine-tuned, it achieves state-of-the-art results on four vision-language tasks focused on real-world con",
    "path": "papers/23/03/2303.09713.json",
    "total_tokens": 937,
    "tldr": "CHAMPAGNE是一个新的对话生成模型，可以考虑视觉上下文，通过预训练语言模型和大型的语料库YTD-18M进行训练，能够实现在多个任务上的最先进表现。"
}