{
    "title": "PC-JeDi: Diffusion for Particle Cloud Generation in High Energy Physics",
    "abstract": "arXiv:2303.05376v2 Announce Type: replace-cross  Abstract: In this paper, we present a new method to efficiently generate jets in High Energy Physics called PC-JeDi. This method utilises score-based diffusion models in conjunction with transformers which are well suited to the task of generating jets as particle clouds due to their permutation equivariance. PC-JeDi achieves competitive performance with current state-of-the-art methods across several metrics that evaluate the quality of the generated jets. Although slower than other models, due to the large number of forward passes required by diffusion models, it is still substantially faster than traditional detailed simulation. Furthermore, PC-JeDi uses conditional generation to produce jets with a desired mass and transverse momentum for two different particles, top quarks and gluons.",
    "link": "https://arxiv.org/abs/2303.05376",
    "context": "Title: PC-JeDi: Diffusion for Particle Cloud Generation in High Energy Physics\nAbstract: arXiv:2303.05376v2 Announce Type: replace-cross  Abstract: In this paper, we present a new method to efficiently generate jets in High Energy Physics called PC-JeDi. This method utilises score-based diffusion models in conjunction with transformers which are well suited to the task of generating jets as particle clouds due to their permutation equivariance. PC-JeDi achieves competitive performance with current state-of-the-art methods across several metrics that evaluate the quality of the generated jets. Although slower than other models, due to the large number of forward passes required by diffusion models, it is still substantially faster than traditional detailed simulation. Furthermore, PC-JeDi uses conditional generation to produce jets with a desired mass and transverse momentum for two different particles, top quarks and gluons.",
    "path": "papers/23/03/2303.05376.json",
    "total_tokens": 770,
    "translated_title": "PC-JeDi: 在高能物理中用于生成粒子云的扩散方法",
    "translated_abstract": "在这篇论文中，我们提出了一种名为PC-JeDi的新方法，用于在高能物理中高效生成喷注。该方法利用基于分数的扩散模型，结合适用于生成粒子云的变换器，因为它们具有置换等变性。PC-JeDi在评估生成喷注质量的几个指标上取得了与当前最先进方法相竞争的性能。尽管由于扩散模型需要大量前向传递而比其他模型慢，但仍然比传统详细模拟快得多。此外，PC-JeDi使用条件生成来为两种不同的粒子，夸克和胶子，生成具有所需质量和横动量的喷注。",
    "tldr": "PC-JeDi是一种在高能物理中生成粒子云的新方法，利用分数扩散模型和变换器，实现了竞争性能，并能以条件生成方式产生具有所需质量和横动量的喷注。",
    "en_tdlr": "PC-JeDi is a new method for generating particle clouds in high energy physics, utilizing score-based diffusion models and transformers, achieving competitive performance and producing jets with desired mass and transverse momentum through conditional generation."
}