{
    "title": "A comprehensive evaluation of ChatGPT's zero-shot Text-to-SQL capability. (arXiv:2303.13547v1 [cs.CL])",
    "abstract": "This paper presents the first comprehensive analysis of ChatGPT's Text-to-SQL ability. Given the recent emergence of large-scale conversational language model ChatGPT and its impressive capabilities in both conversational abilities and code generation, we sought to evaluate its Text-to-SQL performance. We conducted experiments on 12 benchmark datasets with different languages, settings, or scenarios, and the results demonstrate that ChatGPT has strong text-to-SQL abilities. Although there is still a gap from the current state-of-the-art (SOTA) model performance, considering that the experiment was conducted in a zero-shot scenario, ChatGPT's performance is still impressive. Notably, in the ADVETA (RPL) scenario, the zero-shot ChatGPT even outperforms the SOTA model that requires fine-tuning on the Spider dataset by 4.1\\%, demonstrating its potential for use in practical applications. To support further research in related fields, we have made the data generated by ChatGPT publicly avai",
    "link": "http://arxiv.org/abs/2303.13547",
    "context": "Title: A comprehensive evaluation of ChatGPT's zero-shot Text-to-SQL capability. (arXiv:2303.13547v1 [cs.CL])\nAbstract: This paper presents the first comprehensive analysis of ChatGPT's Text-to-SQL ability. Given the recent emergence of large-scale conversational language model ChatGPT and its impressive capabilities in both conversational abilities and code generation, we sought to evaluate its Text-to-SQL performance. We conducted experiments on 12 benchmark datasets with different languages, settings, or scenarios, and the results demonstrate that ChatGPT has strong text-to-SQL abilities. Although there is still a gap from the current state-of-the-art (SOTA) model performance, considering that the experiment was conducted in a zero-shot scenario, ChatGPT's performance is still impressive. Notably, in the ADVETA (RPL) scenario, the zero-shot ChatGPT even outperforms the SOTA model that requires fine-tuning on the Spider dataset by 4.1\\%, demonstrating its potential for use in practical applications. To support further research in related fields, we have made the data generated by ChatGPT publicly avai",
    "path": "papers/23/03/2303.13547.json",
    "total_tokens": 929,
    "translated_title": "ChatGPT 的零-shot Text-to-SQL 能力的综合评估",
    "translated_abstract": "本文首次全面分析了 ChatGPT 的 Text-to-SQL 能力。考虑到大型对话语言模型 ChatGPT 和其在对话能力和代码生成能力上的印象深刻的表现，我们试图评估其 Text-to-SQL 性能。我们对12个基准数据集进行了实验，涉及不同的语言、设置或场景，并且结果表明 ChatGPT 具有强大的 Text-to-SQL 能力。虽然与当前最先进的模型表现仍有差距，但考虑到 实验是在零-shot场景下进行的，ChatGPT 的表现仍然令人印象深刻。值得注意的是，在 ADVETA（RPL）场景中，即使是零-shot ChatGPT 在 Spider 数据集上仍然优于需要微调的 SOTA 模型，表现提升了4.1\\%，展示了它在实际应用中的潜力。为了支持相关领域的进一步研究，我们已经公开 ChatGPT 生成的数据。",
    "tldr": "本文对ChatGPT的Text-to-SQL能力进行了全面的评估，展示其强大的零-shot表现，尤其在ADVETA(RPL)情境下优于需要微调的SOTA模型，有望在实际应用中发挥潜力。"
}