{
    "title": "SuperMask: Generating High-resolution object masks from multi-view, unaligned low-resolution MRIs. (arXiv:2303.07517v1 [eess.IV])",
    "abstract": "Three-dimensional segmentation in magnetic resonance images (MRI), which reflects the true shape of the objects, is challenging since high-resolution isotropic MRIs are rare and typical MRIs are anisotropic, with the out-of-plane dimension having a much lower resolution. A potential remedy to this issue lies in the fact that often multiple sequences are acquired on different planes. However, in practice, these sequences are not orthogonal to each other, limiting the applicability of many previous solutions to reconstruct higher-resolution images from multiple lower-resolution ones. We propose a weakly-supervised deep learning-based solution to generating high-resolution masks from multiple low-resolution images. Our method combines segmentation and unsupervised registration networks by introducing two new regularizations to make registration and segmentation reinforce each other. Finally, we introduce a multi-view fusion method to generate high-resolution target object masks. The exper",
    "link": "http://arxiv.org/abs/2303.07517",
    "context": "Title: SuperMask: Generating High-resolution object masks from multi-view, unaligned low-resolution MRIs. (arXiv:2303.07517v1 [eess.IV])\nAbstract: Three-dimensional segmentation in magnetic resonance images (MRI), which reflects the true shape of the objects, is challenging since high-resolution isotropic MRIs are rare and typical MRIs are anisotropic, with the out-of-plane dimension having a much lower resolution. A potential remedy to this issue lies in the fact that often multiple sequences are acquired on different planes. However, in practice, these sequences are not orthogonal to each other, limiting the applicability of many previous solutions to reconstruct higher-resolution images from multiple lower-resolution ones. We propose a weakly-supervised deep learning-based solution to generating high-resolution masks from multiple low-resolution images. Our method combines segmentation and unsupervised registration networks by introducing two new regularizations to make registration and segmentation reinforce each other. Finally, we introduce a multi-view fusion method to generate high-resolution target object masks. The exper",
    "path": "papers/23/03/2303.07517.json",
    "total_tokens": 1022,
    "translated_title": "SuperMask：从多视角不对齐的低分辨率磁共振图像中生成高分辨率目标掩模",
    "translated_abstract": "三维磁共振图像（MRI）中的分割是具有挑战性的，因为高分辨率的等向性MRI很少，而典型的MRI是非等向性的，其中的平面分辨率远低于体素分辨率。解决这个问题的一个方法是常常在不同的平面上获取多个序列，然而在实践中，这些序列不正交于彼此，限制了许多以前的解决方案重构多个低分辨率图像以得到高分辨率图像的适用性。我们提出了一种基于弱监督的深度学习方法来从多个低分辨率图像中生成高分辨率掩模。我们的方法通过引入两个新的规范化方法使得配准和分割相互增强，结合了分割和无监督注册网络。最后，我们引入多视角融合方法来生成高分辨率目标对象掩模。实验结果表明，我们的方法在合成和真实数据集上均达到了最先进的性能。",
    "tldr": "本论文提出了一种基于弱监督深度学习的方法，从多个低分辨率图像中生成高分辨率的目标掩模。该方法结合了分割和无监督注册网络，引入两个新的规范化方法使得配准和分割相互增强，并提出了多视角融合方法。实验结果表明，该方法在合成和真实数据集上均达到了最先进的性能。",
    "en_tdlr": "This paper proposes a weakly supervised deep learning-based method to generate high-resolution masks from multiple low-resolution images, which combines segmentation and unsupervised registration networks by introducing two new regularizations to make them reinforce each other. The multi-view fusion method is also introduced. The experimental results show that this method achieves state-of-the-art performance on both synthetic and real-world datasets."
}