{
    "title": "Web and Mobile Platforms for Managing Elections based on IoT And Machine Learning Algorithms. (arXiv:2303.09045v1 [cs.LG])",
    "abstract": "The global pandemic situation has severely affected all countries. As a result, almost all countries had to adjust to online technologies to continue their processes. In addition, Sri Lanka is yearly spending ten billion on elections. We have examined a proper way of minimizing the cost of hosting these events online. To solve the existing problems and increase the time potency and cost reduction we have used IoT and ML-based technologies. IoT-based data will identify, register, and be used to secure from fraud, while ML algorithms manipulate the election data and produce winning predictions, weather-based voters attendance, and election violence. All the data will be saved in cloud computing and a standard database to store and access the data. This study mainly focuses on four aspects of an E-voting system. The most frequent problems across the world in E-voting are the security, accuracy, and reliability of the systems. E-government systems must be secured against various cyber-atta",
    "link": "http://arxiv.org/abs/2303.09045",
    "context": "Title: Web and Mobile Platforms for Managing Elections based on IoT And Machine Learning Algorithms. (arXiv:2303.09045v1 [cs.LG])\nAbstract: The global pandemic situation has severely affected all countries. As a result, almost all countries had to adjust to online technologies to continue their processes. In addition, Sri Lanka is yearly spending ten billion on elections. We have examined a proper way of minimizing the cost of hosting these events online. To solve the existing problems and increase the time potency and cost reduction we have used IoT and ML-based technologies. IoT-based data will identify, register, and be used to secure from fraud, while ML algorithms manipulate the election data and produce winning predictions, weather-based voters attendance, and election violence. All the data will be saved in cloud computing and a standard database to store and access the data. This study mainly focuses on four aspects of an E-voting system. The most frequent problems across the world in E-voting are the security, accuracy, and reliability of the systems. E-government systems must be secured against various cyber-atta",
    "path": "papers/23/03/2303.09045.json",
    "total_tokens": 879,
    "translated_title": "基于物联网和机器学习算法的选举管理Web和移动平台",
    "translated_abstract": "全球疫情严重影响各国。结果，几乎所有国家不得不调整在线技术以继续他们的流程。斯里兰卡每年在选举上花费100亿。为了解决现有问题并增加时间效率和降低成本，我们使用了IoT和ML技术。基于IoT的数据将识别、注册和用于防止欺诈，而ML算法将操纵选举数据并产生获胜预测、基于天气的选民出席率和选举暴力。所有数据将保存在云计算和标准数据库中以存储和访问数据。该研究主要关注E-voting系统的四个方面。 E-voting的最常见问题是系统的安全性，准确性和可靠性。提出的IoT和ML技术旨在提高E-voting系统的安全性，准确性和可靠性，同时降低成本并增加效率。",
    "tldr": "本研究使用IoT和ML技术降低选举成本并提高效率，解决E-voting系统安全性、准确性和可靠性问题。",
    "en_tdlr": "This study proposes using IoT and ML technologies to reduce election costs and increase efficiency, while improving the security, accuracy, and reliability of E-voting systems."
}