{
    "title": "DARE-GRAM : Unsupervised Domain Adaptation Regression by Aligning Inverse Gram Matrices. (arXiv:2303.13325v1 [cs.CV])",
    "abstract": "Unsupervised Domain Adaptation Regression (DAR) aims to bridge the domain gap between a labeled source dataset and an unlabelled target dataset for regression problems. Recent works mostly focus on learning a deep feature encoder by minimizing the discrepancy between source and target features. In this work, we present a different perspective for the DAR problem by analyzing the closed-form ordinary least square~(OLS) solution to the linear regressor in the deep domain adaptation context. Rather than aligning the original feature embedding space, we propose to align the inverse Gram matrix of the features, which is motivated by its presence in the OLS solution and the Gram matrix's ability to capture the feature correlations. Specifically, we propose a simple yet effective DAR method which leverages the pseudo-inverse low-rank property to align the scale and angle in a selected subspace generated by the pseudo-inverse Gram matrix of the two domains. We evaluate our method on three doma",
    "link": "http://arxiv.org/abs/2303.13325",
    "context": "Title: DARE-GRAM : Unsupervised Domain Adaptation Regression by Aligning Inverse Gram Matrices. (arXiv:2303.13325v1 [cs.CV])\nAbstract: Unsupervised Domain Adaptation Regression (DAR) aims to bridge the domain gap between a labeled source dataset and an unlabelled target dataset for regression problems. Recent works mostly focus on learning a deep feature encoder by minimizing the discrepancy between source and target features. In this work, we present a different perspective for the DAR problem by analyzing the closed-form ordinary least square~(OLS) solution to the linear regressor in the deep domain adaptation context. Rather than aligning the original feature embedding space, we propose to align the inverse Gram matrix of the features, which is motivated by its presence in the OLS solution and the Gram matrix's ability to capture the feature correlations. Specifically, we propose a simple yet effective DAR method which leverages the pseudo-inverse low-rank property to align the scale and angle in a selected subspace generated by the pseudo-inverse Gram matrix of the two domains. We evaluate our method on three doma",
    "path": "papers/23/03/2303.13325.json",
    "total_tokens": 1046,
    "translated_title": "通过对齐逆格拉姆矩阵进行无监督领域自适应回归：DARE-GRAM",
    "translated_abstract": "无监督领域自适应回归(DAR)旨在解决回归问题中标记源数据集与未标记目标数据集之间的领域差异问题。最近的研究主要集中在学习深度特征编码器，通过减小源和目标特征之间的差异来实现。本文提出了一种不同于以往的DAR问题的观点，通过分析深度领域适应背景下线性回归器的闭式普通最小二乘(OLS)解法，提出了对特征嵌入空间进行对齐的不同方法，即通过对齐特征的逆格拉姆矩阵来进行对齐，这是由于逆Gram矩阵存在于OLS解法中并且Gram矩阵能够捕捉特征之间的相关性所促使。具体而言，我们提出了一种简单而有效地DAR方法，利用伪逆低秩性在由两个领域的伪逆格拉姆矩阵生成的选择子空间中对齐尺度和角度。我们在三个领域自适应数据集上评估了我们的方法。",
    "tldr": "本文提出了一种简单而有效的无监督领域自适应回归方法 DARE-GRAM，利用伪逆低秩性在由两个领域的伪逆格拉姆矩阵生成的选择子空间中对齐尺度和角度，解决了回归问题中标记源数据集与未标记目标数据集之间的领域差异问题。",
    "en_tdlr": "This paper proposes a simple and effective unsupervised domain adaptation regression method called DARE-GRAM, which aligns the scale and angle in a selected subspace generated by the pseudo-inverse Gram matrix of two domains by leveraging the pseudo-inverse low-rank property, to solve the problem of domain gap between a labeled source dataset and an unlabelled target dataset for regression problems."
}