{
    "title": "Multimodal Manoeuvre and Trajectory Prediction for Autonomous Vehicles Using Transformer Networks. (arXiv:2303.16109v1 [cs.LG])",
    "abstract": "Predicting the behaviour (i.e. manoeuvre/trajectory) of other road users, including vehicles, is critical for the safe and efficient operation of autonomous vehicles (AVs), a.k.a. automated driving systems (ADSs). Due to the uncertain future behaviour of vehicles, multiple future behaviour modes are often plausible for a vehicle in a given driving scene. Therefore, multimodal prediction can provide richer information than single-mode prediction enabling AVs to perform a better risk assessment. To this end, we propose a novel multimodal prediction framework that can predict multiple plausible behaviour modes and their likelihoods. The proposed framework includes a bespoke problem formulation for manoeuvre prediction, a novel transformer-based prediction model, and a tailored training method for multimodal manoeuvre and trajectory prediction. The performance of the framework is evaluated using two public benchmark highway driving datasets, namely NGSIM and highD. The results show that th",
    "link": "http://arxiv.org/abs/2303.16109",
    "context": "Title: Multimodal Manoeuvre and Trajectory Prediction for Autonomous Vehicles Using Transformer Networks. (arXiv:2303.16109v1 [cs.LG])\nAbstract: Predicting the behaviour (i.e. manoeuvre/trajectory) of other road users, including vehicles, is critical for the safe and efficient operation of autonomous vehicles (AVs), a.k.a. automated driving systems (ADSs). Due to the uncertain future behaviour of vehicles, multiple future behaviour modes are often plausible for a vehicle in a given driving scene. Therefore, multimodal prediction can provide richer information than single-mode prediction enabling AVs to perform a better risk assessment. To this end, we propose a novel multimodal prediction framework that can predict multiple plausible behaviour modes and their likelihoods. The proposed framework includes a bespoke problem formulation for manoeuvre prediction, a novel transformer-based prediction model, and a tailored training method for multimodal manoeuvre and trajectory prediction. The performance of the framework is evaluated using two public benchmark highway driving datasets, namely NGSIM and highD. The results show that th",
    "path": "papers/23/03/2303.16109.json",
    "total_tokens": 924,
    "translated_title": "基于Transformer网络的自动驾驶车辆多模态操作和轨迹预测",
    "translated_abstract": "预测其他道路用户（包括车辆）的行为（即操作/轨迹）对于自动驾驶车辆（AVs）或自动化驾驶系统（ADSs）的安全和高效运行至关重要。由于车辆未来行为的不确定性，对于给定的行驶场景，一个车辆通常存在多个未来行为模式是合理的。因此，多模态预测可以提供比单模态预测更丰富的信息，使AV能够更好地评估风险。为此，我们提出了一种新颖的多模态预测框架，可以预测多个可能的行为模式及其概率。该框架包括一个定制的操作预测问题公式，一个基于Transformer的预测模型，以及一种定制的多模态操作和轨迹预测的训练方法。使用两个公共基准公路驾驶数据集（即NGSIM和highD）评估了该框架的性能。结果表明，该框架在多模态操作和轨迹预测方面的表现得到了优化。",
    "tldr": "提出了一种新颖的基于Transformer网络的多模态操作和轨迹预测框架，能够预测多个可能的行为模式及其概率，并且在两个公共基准公路驾驶数据集上得到了优秀的表现。"
}