{
    "title": "Dual-stream Time-Delay Neural Network with Dynamic Global Filter for Speaker Verification. (arXiv:2303.11020v2 [cs.SD] UPDATED)",
    "abstract": "The time-delay neural network (TDNN) is one of the state-of-the-art models for text-independent speaker verification. However, it is difficult for conventional TDNN to capture global context that has been proven critical for robust speaker representations and long-duration speaker verification in many recent works. Besides, the common solutions, e.g., self-attention, have quadratic complexity for input tokens, which makes them computationally unaffordable when applied to the feature maps with large sizes in TDNN. To address these issues, we propose the Global Filter for TDNN, which applies log-linear complexity FFT/IFFT and a set of differentiable frequency-domain filters to efficiently model the long-term dependencies in speech. Besides, a dynamic filtering strategy, and a sparse regularization method are specially designed to enhance the performance of the global filter and prevent it from overfitting. Furthermore, we construct a dual-stream TDNN (DS-TDNN), which splits the basic cha",
    "link": "http://arxiv.org/abs/2303.11020",
    "context": "Title: Dual-stream Time-Delay Neural Network with Dynamic Global Filter for Speaker Verification. (arXiv:2303.11020v2 [cs.SD] UPDATED)\nAbstract: The time-delay neural network (TDNN) is one of the state-of-the-art models for text-independent speaker verification. However, it is difficult for conventional TDNN to capture global context that has been proven critical for robust speaker representations and long-duration speaker verification in many recent works. Besides, the common solutions, e.g., self-attention, have quadratic complexity for input tokens, which makes them computationally unaffordable when applied to the feature maps with large sizes in TDNN. To address these issues, we propose the Global Filter for TDNN, which applies log-linear complexity FFT/IFFT and a set of differentiable frequency-domain filters to efficiently model the long-term dependencies in speech. Besides, a dynamic filtering strategy, and a sparse regularization method are specially designed to enhance the performance of the global filter and prevent it from overfitting. Furthermore, we construct a dual-stream TDNN (DS-TDNN), which splits the basic cha",
    "path": "papers/23/03/2303.11020.json",
    "total_tokens": 1057,
    "translated_title": "具有动态全局滤波器的双流时延神经网络用于说话人验证",
    "translated_abstract": "时延神经网络(TDNN)是文本无关说话人验证领域的最先进模型之一。然而，对于传统的TDNN来说，捕捉被证明对于鲁棒说话人表示和长时间说话人验证至关重要的全局上下文是困难的。此外，常见的解决方案(例如自我关注)对于输入令牌具有二次复杂度，当应用于TDNN中具有大尺寸特征映射时，这使它们在计算上无法承受。为了解决这些问题，我们提出了TDNN的全局滤波器(GFTDNN)，它应用对数线性复杂度的FFT/IFFT和一组可微频域滤波器来高效地建模语音中的长期依赖关系。此外，还为增强全局滤波器的性能并防止过度拟合，特别设计了动态滤波策略和稀疏正则化方法。此外，我们构建了一个双流TDNN(DS-TDNN)，将基本通道分成两个并行通道，使用不同的频域滤波器训练每个通道。在两个不同的大规模说话人验证数据集上的实验表明，所提出的方法在性能上优于标准TDNN和其他最先进方法，并实现了最先进的性能。",
    "tldr": "该论文提出了具有动态全局滤波器的双流时延神经网络，在说话人验证领域的表现优于其他最先进的方法，并实现了最先进的性能。",
    "en_tdlr": "The paper proposes a Dual-stream Time-Delay Neural Network (DS-TDNN) with Dynamic Global Filter for speaker verification, which outperforms other state-of-the-art methods and achieves state-of-the-art performance in the field of speaker verification."
}