{
    "title": "Optimal Cross-Correlation Estimates from Asynchronous Tick-by-Tick Trading Data. (arXiv:2303.16153v1 [q-fin.ST])",
    "abstract": "Given two time series, A and B, sampled asynchronously at different times {t_A_i} and {t_B_j}, termed \"ticks\", how can one best estimate the correlation coefficient \\rho between changes in A and B? We derive a natural, minimum-variance estimator that does not use any interpolation or binning, then derive from it a fast (linear time) estimator that is demonstrably nearly as good. This \"fast tickwise estimator\" is compared in simulation to the usual method of interpolating changes to a regular grid. Even when the grid spacing is optimized for the particular parameters (not often possible in practice), the fast tickwise estimator has generally smaller estimation errors, often by a large factor. These results are directly applicable to tick-by-tick price data of financial assets.",
    "link": "http://arxiv.org/abs/2303.16153",
    "context": "Title: Optimal Cross-Correlation Estimates from Asynchronous Tick-by-Tick Trading Data. (arXiv:2303.16153v1 [q-fin.ST])\nAbstract: Given two time series, A and B, sampled asynchronously at different times {t_A_i} and {t_B_j}, termed \"ticks\", how can one best estimate the correlation coefficient \\rho between changes in A and B? We derive a natural, minimum-variance estimator that does not use any interpolation or binning, then derive from it a fast (linear time) estimator that is demonstrably nearly as good. This \"fast tickwise estimator\" is compared in simulation to the usual method of interpolating changes to a regular grid. Even when the grid spacing is optimized for the particular parameters (not often possible in practice), the fast tickwise estimator has generally smaller estimation errors, often by a large factor. These results are directly applicable to tick-by-tick price data of financial assets.",
    "path": "papers/23/03/2303.16153.json",
    "total_tokens": 818,
    "translated_title": "异步逐笔交易数据的最优交叉相关估计",
    "translated_abstract": "在给定两个异步采样的时间序列A和B，分别在不同的时间{t_A_i}和{t_B_j} 上，如何最好地估计A和B的变化之间的相关系数ρ？我们推导了一种自然的最小方差估计器，不使用任何插值或分组，然后从中推导出一种快速（线性时间）的估计器，它可以证明几乎和最佳方法一样好。将这种“快速逐笔估算法”与通常的插值变化到常规网格的方法进行了模拟比较。即使优化了网格间距以适应特定参数（在实践中不经常发生），快速逐笔估算器的估计误差通常更小，而且经常小得多。这些结果直接适用于金融资产的逐笔价格数据。",
    "tldr": "该论文提出了一种快速且精度较高的逐笔估算器，可用于计算金融资产逐笔价格数据中变化之间的相关系数。",
    "en_tdlr": "The paper proposes a fast and accurate tickwise estimator for computing the correlation coefficient between changes in asynchronously-sampled time series, and demonstrates its superior performance compared to the usual method of interpolating changes to a regular grid, with direct applicability to tick-by-tick price data of financial assets."
}