{
    "title": "Self-Supervised CSF Inpainting with Synthetic Atrophy for Improved Accuracy Validation of Cortical Surface Analyses. (arXiv:2303.05777v1 [eess.IV])",
    "abstract": "Accuracy validation of cortical thickness measurement is a difficult problem due to the lack of ground truth data. To address this need, many methods have been developed to synthetically induce gray matter (GM) atrophy in an MRI via deformable registration, creating a set of images with known changes in cortical thickness. However, these methods often cause blurring in atrophied regions, and cannot simulate realistic atrophy within deep sulci where cerebrospinal fluid (CSF) is obscured or absent. In this paper, we present a solution using a self-supervised inpainting model to generate CSF in these regions and create images with more plausible GM/CSF boundaries. Specifically, we introduce a novel, 3D GAN model that incorporates patch-based dropout training, edge map priors, and sinusoidal positional encoding, all of which are established methods previously limited to 2D domains. We show that our framework significantly improves the quality of the resulting synthetic images and is adapta",
    "link": "http://arxiv.org/abs/2303.05777",
    "raw_ret": "{\n    \"translated_title\": \"自我监督的合成脑萎缩下的脑表面分析准确度验证中的CSF修复方法\",\n    \"translated_abstract\": \"由于缺乏基础真实数据，对大脑皮层厚度测量的准确性验证是一个困难的问题。为了解决这个问题，许多方法已经开发出来，通过可变形配准在MRI上合成灰质(GM)萎缩，创造一组已知皮层厚度变化的图像。然而，这些方法经常在萎缩区域造成模糊，并且无法在脑沟深处模拟真实的萎缩，脑脊液(CSF)在此处被遮挡或缺失。在本文中，我们提出了一种解决方案，使用自我监督的修复模型，在这些区域生成CSF，创建更加合理的GM/CSF边界图像。具体而言，我们引入了一种新颖的三维GAN模型，它结合了基于块的dropout训练，边缘映射先验和正弦位置编码，这些方法之前仅限于2D域。我们展示了我们的框架显著提高了生成的合成图像的质量，并且是可以适应不同的数据集。\",\n    \"tldr\": \"通过引入一种自我监督的修复模型，在缺失真实数据的情况下，实现了脑表面分析准确度验证中的CSF修复，提高了图像质量并且适应不同的数据集。\"\n}",
    "total_tokens": 947,
    "ret": {
        "translated_title": "自我监督的合成脑萎缩下的脑表面分析准确度验证中的CSF修复方法",
        "translated_abstract": "由于缺乏基础真实数据，对大脑皮层厚度测量的准确性验证是一个困难的问题。为了解决这个问题，许多方法已经开发出来，通过可变形配准在MRI上合成灰质(GM)萎缩，创造一组已知皮层厚度变化的图像。然而，这些方法经常在萎缩区域造成模糊，并且无法在脑沟深处模拟真实的萎缩，脑脊液(CSF)在此处被遮挡或缺失。在本文中，我们提出了一种解决方案，使用自我监督的修复模型，在这些区域生成CSF，创建更加合理的GM/CSF边界图像。具体而言，我们引入了一种新颖的三维GAN模型，它结合了基于块的dropout训练，边缘映射先验和正弦位置编码，这些方法之前仅限于2D域。我们展示了我们的框架显著提高了生成的合成图像的质量，并且是可以适应不同的数据集。",
        "tldr": "通过引入一种自我监督的修复模型，在缺失真实数据的情况下，实现了脑表面分析准确度验证中的CSF修复，提高了图像质量并且适应不同的数据集。"
    }
}