{
    "title": "Exploring ChatGPT's Ability to Rank Content: A Preliminary Study on Consistency with Human Preferences. (arXiv:2303.07610v1 [cs.CL])",
    "abstract": "As a natural language assistant, ChatGPT is capable of performing various tasks, including but not limited to article generation, code completion, and data analysis. Furthermore, ChatGPT has consistently demonstrated a remarkable level of accuracy and reliability in terms of content evaluation, exhibiting the capability of mimicking human preferences. To further explore ChatGPT's potential in this regard, a study is conducted to assess its ability to rank content. In order to do so, a test set consisting of prompts is created, covering a wide range of use cases, and five models are utilized to generate corresponding responses. ChatGPT is then instructed to rank the responses generated by these models. The results on the test set show that ChatGPT's ranking preferences are consistent with human to a certain extent. This preliminary experimental finding implies that ChatGPT's zero-shot ranking capability could be used to reduce annotation pressure in a number of ranking tasks.",
    "link": "http://arxiv.org/abs/2303.07610",
    "context": "Title: Exploring ChatGPT's Ability to Rank Content: A Preliminary Study on Consistency with Human Preferences. (arXiv:2303.07610v1 [cs.CL])\nAbstract: As a natural language assistant, ChatGPT is capable of performing various tasks, including but not limited to article generation, code completion, and data analysis. Furthermore, ChatGPT has consistently demonstrated a remarkable level of accuracy and reliability in terms of content evaluation, exhibiting the capability of mimicking human preferences. To further explore ChatGPT's potential in this regard, a study is conducted to assess its ability to rank content. In order to do so, a test set consisting of prompts is created, covering a wide range of use cases, and five models are utilized to generate corresponding responses. ChatGPT is then instructed to rank the responses generated by these models. The results on the test set show that ChatGPT's ranking preferences are consistent with human to a certain extent. This preliminary experimental finding implies that ChatGPT's zero-shot ranking capability could be used to reduce annotation pressure in a number of ranking tasks.",
    "path": "papers/23/03/2303.07610.json",
    "total_tokens": 867,
    "translated_title": "探索ChatGPT在内容排序方面的能力：与人类偏好一致性的初步研究",
    "translated_abstract": "作为自然语言助手，ChatGPT能够执行各种任务，包括但不限于文章生成、代码完成和数据分析。此外，ChatGPT在内容评估方面始终表现出卓越的准确性和可靠性，展示出模仿人类偏好的能力。为了进一步探索ChatGPT在这方面的潜力，进行了一项研究以评估其排序内容的能力。为此，创建了一个测试集，包括广泛的用例，利用五个模型生成相应的回应。然后，指示ChatGPT对这些模型生成的回应进行排序。测试集的结果表明，ChatGPT的排序偏好与人类在一定程度上一致。这个初步的实验发现意味着ChatGPT的零样本排序能力可用于减轻许多排序任务中的注释压力。",
    "tldr": "本研究探索了ChatGPT在内容排序方面的能力，通过排名测试集验证其排名偏好与人类相似，这意味着ChatGPT的零样本排名能力可用于减轻排序任务的注释压力。",
    "en_tdlr": "This study explores ChatGPT's ability to rank content and verifies its ranking preferences are similar to humans through a ranking test set, implying that ChatGPT's zero-shot ranking capability could be used to reduce annotation pressure in ranking tasks."
}