{
    "title": "InterviewBot: Real-Time End-to-End Dialogue System to Interview Students for College Admission. (arXiv:2303.15049v2 [cs.CL] UPDATED)",
    "abstract": "We present the InterviewBot that dynamically integrates conversation history and customized topics into a coherent embedding space to conduct 10 mins hybrid-domain (open and closed) conversations with foreign students applying to U.S. colleges for assessing their academic and cultural readiness. To build a neural-based end-to-end dialogue model, 7,361 audio recordings of human-to-human interviews are automatically transcribed, where 440 are manually corrected for finetuning and evaluation. To overcome the input/output size limit of a transformer-based encoder-decoder model, two new methods are proposed, context attention and topic storing, allowing the model to make relevant and consistent interactions. Our final model is tested both statistically by comparing its responses to the interview data and dynamically by inviting professional interviewers and various students to interact with it in real-time, finding it highly satisfactory in fluency and context awareness.",
    "link": "http://arxiv.org/abs/2303.15049",
    "context": "Title: InterviewBot: Real-Time End-to-End Dialogue System to Interview Students for College Admission. (arXiv:2303.15049v2 [cs.CL] UPDATED)\nAbstract: We present the InterviewBot that dynamically integrates conversation history and customized topics into a coherent embedding space to conduct 10 mins hybrid-domain (open and closed) conversations with foreign students applying to U.S. colleges for assessing their academic and cultural readiness. To build a neural-based end-to-end dialogue model, 7,361 audio recordings of human-to-human interviews are automatically transcribed, where 440 are manually corrected for finetuning and evaluation. To overcome the input/output size limit of a transformer-based encoder-decoder model, two new methods are proposed, context attention and topic storing, allowing the model to make relevant and consistent interactions. Our final model is tested both statistically by comparing its responses to the interview data and dynamically by inviting professional interviewers and various students to interact with it in real-time, finding it highly satisfactory in fluency and context awareness.",
    "path": "papers/23/03/2303.15049.json",
    "total_tokens": 1012,
    "translated_title": "InterviewBot：面向大学招生考试的实时端到端对话系统",
    "translated_abstract": "我们提出了InterviewBot，它动态将会话历史和定制主题集成到一致的嵌入空间中，以进行10分钟的混合领域（开放和封闭）对话，以评估外国学生申请美国大学的学术和文化准备情况。为构建基于神经元的端到端对话模型，我们自动转录了7,361个人对人的面试音频记录，其中440个进行了手动纠正以进行微调和评估。为了克服基于变形金刚编码器-解码器模型的输入/输出大小限制，我们提出了两种新方法，上下文关注和主题存储，使模型能够进行相关和一致的交互。我们的最终模型在统计上被测试，通过将其响应与面试数据进行比较，并动态地邀请专业面试官和各种学生与其实时交互，在流畅性和上下文感知方面发现其非常令人满意。",
    "tldr": "论文介绍了一种基于神经元的端到端对话模型- InterviewBot，该模型利用与输入的历史对话和定制主题集成到同一嵌入空间中来评估外国学生申请美国大学的学术和文化准备情况。同时，为克服基于变形金刚编码器-解码器模型的输入/输出大小限制，提出了上下文关注和主题存储两种新方法。该模型在统计和动态测试中表现出了流畅性和上下文感知的高度满意。"
}