{
    "title": "Contribution of clinical course to outcome after traumatic brain injury: mining patient trajectories from European intensive care unit data. (arXiv:2303.04630v2 [cs.LG] UPDATED)",
    "abstract": "Existing methods to characterise the evolving condition of traumatic brain injury (TBI) patients in the intensive care unit (ICU) do not capture the context necessary for individualising treatment. We aimed to develop a modelling strategy which integrates all data stored in medical records to produce an interpretable disease course for each TBI patient's ICU stay. From a prospective, European cohort (n=1,550, 65 centres, 19 countries) of TBI patients, we extracted all 1,166 variables collected before or during ICU stay as well as 6-month functional outcome on the Glasgow Outcome Scale-Extended (GOSE). We trained recurrent neural network models to map a token-embedded time series representation of all variables (including missing data) to an ordinal GOSE prognosis every 2 hours. With repeated cross-validation, we evaluated calibration and the explanation of ordinal variance in GOSE with Somers' Dxy. Furthermore, we applied TimeSHAP to calculate the contribution of variables and prior ti",
    "link": "http://arxiv.org/abs/2303.04630",
    "context": "Title: Contribution of clinical course to outcome after traumatic brain injury: mining patient trajectories from European intensive care unit data. (arXiv:2303.04630v2 [cs.LG] UPDATED)\nAbstract: Existing methods to characterise the evolving condition of traumatic brain injury (TBI) patients in the intensive care unit (ICU) do not capture the context necessary for individualising treatment. We aimed to develop a modelling strategy which integrates all data stored in medical records to produce an interpretable disease course for each TBI patient's ICU stay. From a prospective, European cohort (n=1,550, 65 centres, 19 countries) of TBI patients, we extracted all 1,166 variables collected before or during ICU stay as well as 6-month functional outcome on the Glasgow Outcome Scale-Extended (GOSE). We trained recurrent neural network models to map a token-embedded time series representation of all variables (including missing data) to an ordinal GOSE prognosis every 2 hours. With repeated cross-validation, we evaluated calibration and the explanation of ordinal variance in GOSE with Somers' Dxy. Furthermore, we applied TimeSHAP to calculate the contribution of variables and prior ti",
    "path": "papers/23/03/2303.04630.json",
    "total_tokens": 1015,
    "translated_title": "创伤性脑损伤的临床进程对结果的贡献：从欧洲重症监护室数据中挖掘患者轨迹",
    "translated_abstract": "现有的创伤性脑损伤（TBI）患者状况表述方法不能捕捉个体化治疗所需的上下文信息。本研究旨在开发一种建模策略，整合住院期间所有记录的数据，为每名TBI患者的重症监护室（ICU）住院提供可解释的疾病进展。研究随机选择了1550名来自欧洲65个中心、19个国家的TBI患者，提取了在ICU住院期间或之前收集的所有1166个变量，以及6个月的Glasgow Outcome Scale-Extended（GOSE）功能结果。研究使用递归神经网络模型，将所有变量的令牌嵌入时间序列表示（包括缺失数据）映射到每2个小时的GOSE预后。通过重复交叉验证，我们使用Somers' Dxy评估了GOSE的日常差异的校准和解释。此外，我们应用了TimeSHAP来计算变量及先前时间对每个病例的贡献。",
    "tldr": "本研究研发了一种整合患者ICU住院期间所有记录的数据来为每名TBI患者提供可解释的疾病进展的建模策略，并应用递归神经网络模型对患者状况进行预测，以帮助实现个体化治疗。",
    "en_tdlr": "This study developed a modeling strategy that integrates all data stored in medical records during ICU stay to provide an interpretable disease progression for each TBI patient, and applied recurrent neural network models to predict patient outcomes, aiming to facilitate individualized treatment."
}