{
    "title": "An evaluation framework for dimensionality reduction through sectional curvature. (arXiv:2303.09909v1 [cs.LG])",
    "abstract": "Unsupervised machine learning lacks ground truth by definition. This poses a major difficulty when designing metrics to evaluate the performance of such algorithms. In sharp contrast with supervised learning, for which plenty of quality metrics have been studied in the literature, in the field of dimensionality reduction only a few over-simplistic metrics has been proposed. In this work, we aim to introduce the first highly non-trivial dimensionality reduction performance metric. This metric is based on the sectional curvature behaviour arising from Riemannian geometry. To test its feasibility, this metric has been used to evaluate the performance of the most commonly used dimension reduction algorithms in the state of the art. Furthermore, to make the evaluation of the algorithms robust and representative, using curvature properties of planar curves, a new parameterized problem instance generator has been constructed in the form of a function generator. Experimental results are consis",
    "link": "http://arxiv.org/abs/2303.09909",
    "context": "Title: An evaluation framework for dimensionality reduction through sectional curvature. (arXiv:2303.09909v1 [cs.LG])\nAbstract: Unsupervised machine learning lacks ground truth by definition. This poses a major difficulty when designing metrics to evaluate the performance of such algorithms. In sharp contrast with supervised learning, for which plenty of quality metrics have been studied in the literature, in the field of dimensionality reduction only a few over-simplistic metrics has been proposed. In this work, we aim to introduce the first highly non-trivial dimensionality reduction performance metric. This metric is based on the sectional curvature behaviour arising from Riemannian geometry. To test its feasibility, this metric has been used to evaluate the performance of the most commonly used dimension reduction algorithms in the state of the art. Furthermore, to make the evaluation of the algorithms robust and representative, using curvature properties of planar curves, a new parameterized problem instance generator has been constructed in the form of a function generator. Experimental results are consis",
    "path": "papers/23/03/2303.09909.json",
    "total_tokens": 838,
    "translated_title": "基于分段曲率的降维评估框架研究",
    "translated_abstract": "无监督机器学习在定义上缺乏基准，这给评估此类算法的性能设计指标带来了重大困难。与监督学习形成鲜明对比的是，监督学习的质量指标在文献中得到了广泛的研究，而在降维领域中，只提出了一些过于简化的指标。本文旨在介绍一种极其非平凡的降维性能评估指标，该指标基于来自黎曼几何的分段曲率行为。为了测试其可行性，该指标已被用于评估最先进的降维算法的性能。此外，为了使算法评估具有鲁棒性和代表性，利用平面曲线的曲率特性，构造了一种新的参数化问题实例生成器形式的函数生成器。实验结果是一致的。",
    "tldr": "本文提出了基于分段曲率的高度非平凡维度规约性能评估指标，并利用此指标来评估最先进的维度规约算法的性能",
    "en_tdlr": "This paper proposes a highly non-trivial performance metric for dimensionality reduction based on sectional curvature arising from Riemannian geometry and uses it to evaluate the performance of state-of-the-art dimension reduction algorithms."
}