{
    "title": "SECAD-Net: Self-Supervised CAD Reconstruction by Learning Sketch-Extrude Operations. (arXiv:2303.10613v1 [cs.CV])",
    "abstract": "Reverse engineering CAD models from raw geometry is a classic but strenuous research problem. Previous learning-based methods rely heavily on labels due to the supervised design patterns or reconstruct CAD shapes that are not easily editable. In this work, we introduce SECAD-Net, an end-to-end neural network aimed at reconstructing compact and easy-to-edit CAD models in a self-supervised manner. Drawing inspiration from the modeling language that is most commonly used in modern CAD software, we propose to learn 2D sketches and 3D extrusion parameters from raw shapes, from which a set of extrusion cylinders can be generated by extruding each sketch from a 2D plane into a 3D body. By incorporating the Boolean operation (i.e., union), these cylinders can be combined to closely approximate the target geometry. We advocate the use of implicit fields for sketch representation, which allows for creating CAD variations by interpolating latent codes in the sketch latent space. Extensive experim",
    "link": "http://arxiv.org/abs/2303.10613",
    "context": "Title: SECAD-Net: Self-Supervised CAD Reconstruction by Learning Sketch-Extrude Operations. (arXiv:2303.10613v1 [cs.CV])\nAbstract: Reverse engineering CAD models from raw geometry is a classic but strenuous research problem. Previous learning-based methods rely heavily on labels due to the supervised design patterns or reconstruct CAD shapes that are not easily editable. In this work, we introduce SECAD-Net, an end-to-end neural network aimed at reconstructing compact and easy-to-edit CAD models in a self-supervised manner. Drawing inspiration from the modeling language that is most commonly used in modern CAD software, we propose to learn 2D sketches and 3D extrusion parameters from raw shapes, from which a set of extrusion cylinders can be generated by extruding each sketch from a 2D plane into a 3D body. By incorporating the Boolean operation (i.e., union), these cylinders can be combined to closely approximate the target geometry. We advocate the use of implicit fields for sketch representation, which allows for creating CAD variations by interpolating latent codes in the sketch latent space. Extensive experim",
    "path": "papers/23/03/2303.10613.json",
    "total_tokens": 1215,
    "translated_title": "SECAD-Net：通过学习草图挤压操作进行自我监督的CAD重建",
    "translated_abstract": "从原始几何形状中反向工程CAD模型是一个经典但困难的研究问题。以往基于学习的方法由于受监督的设计模式或重建不易编辑的CAD形状而大量依赖标签。在这项工作中，我们介绍了SECAD-Net，这是一个端到端的神经网络，旨在以自我监督的方式重建紧凑且易于编辑的CAD模型。从现代CAD软件中最常使用的建模语言中汲取灵感，我们提出从原始形状中学习2D草图和3D挤压参数，从而通过将每个草图从2D平面挤压到3D体来生成一组挤压筒。通过融合布尔操作（即联合），这些筒可以组合在一起，以密切逼近目标几何形状。我们倡导使用隐式场来表示草图，这允许通过在草图潜在空间中插值潜在代码来创建CAD变体。广泛的实验结果表明，SECAD-Net可以从原始输入中重建高质量的CAD模型，在重建质量和推断速度方面超越了现有的最先进方法。",
    "tldr": "本论文提出了一种名为SECAD-Net的自我监督神经网络，旨在以紧凑且易于编辑的方式从原始输入中重建高质量的CAD模型。其利用学习2D草图和3D挤压参数以创建一组挤压筒，并结合布尔操作来逼近目标几何形状。使用隐式场表示草图，允许通过在草图潜在空间中插值潜在代码来创建CAD变体。在实验中，SECAD-Net超越了现有的最先进方法，证明了其在重建质量和推断速度方面的卓越表现。"
}