{
    "title": "Identification of Novel Classes for Improving Few-Shot Object Detection. (arXiv:2303.10422v1 [cs.CV])",
    "abstract": "Conventional training of deep neural networks requires a large number of the annotated image which is a laborious and time-consuming task, particularly for rare objects. Few-shot object detection (FSOD) methods offer a remedy by realizing robust object detection using only a few training samples per class. An unexplored challenge for FSOD is that instances from unlabeled novel classes that do not belong to the fixed set of training classes appear in the background. These objects behave similarly to label noise, leading to FSOD performance degradation. We develop a semi-supervised algorithm to detect and then utilize these unlabeled novel objects as positive samples during training to improve FSOD performance. Specifically, we propose a hierarchical ternary classification region proposal network (HTRPN) to localize the potential unlabeled novel objects and assign them new objectness labels. Our improved hierarchical sampling strategy for the region proposal network (RPN) also boosts the",
    "link": "http://arxiv.org/abs/2303.10422",
    "context": "Title: Identification of Novel Classes for Improving Few-Shot Object Detection. (arXiv:2303.10422v1 [cs.CV])\nAbstract: Conventional training of deep neural networks requires a large number of the annotated image which is a laborious and time-consuming task, particularly for rare objects. Few-shot object detection (FSOD) methods offer a remedy by realizing robust object detection using only a few training samples per class. An unexplored challenge for FSOD is that instances from unlabeled novel classes that do not belong to the fixed set of training classes appear in the background. These objects behave similarly to label noise, leading to FSOD performance degradation. We develop a semi-supervised algorithm to detect and then utilize these unlabeled novel objects as positive samples during training to improve FSOD performance. Specifically, we propose a hierarchical ternary classification region proposal network (HTRPN) to localize the potential unlabeled novel objects and assign them new objectness labels. Our improved hierarchical sampling strategy for the region proposal network (RPN) also boosts the",
    "path": "papers/23/03/2303.10422.json",
    "total_tokens": 904,
    "translated_title": "提高少样本目标检测的新类别的识别方法",
    "translated_abstract": "传统的深度神经网络训练需要大量的标注图像，这是一项繁重且耗时的任务，特别是对于罕见的物体。少样本目标检测(FSOD)方法通过仅使用每个类别的少量训练样本实现强大的目标检测。对于FSOD来说一个未被探索的挑战是未标注的新类别的实例出现在背景中，这些物体表现类似于标签噪音，导致FSOD性能下降。我们开发了一种半监督算法来检测并利用这些未标注的新物体作为训练时的正样本，以提高FSOD的性能。具体而言，我们提出了一种分层三元分类区域提议网络(HTRPN)来定位潜在的未标注新物体并为它们分配新的目标性标签。我们改进了区域提议网络(RPN)的层次抽样策略，也提高了性能。",
    "tldr": "该论文提出一种半监督算法，利用未标注的新物体来提高少样本目标检测的性能，主要包括使用分层三元分类区域提议网络来定位潜在的未标注新物体，并为它们分配新的目标性标签。",
    "en_tdlr": "This paper proposes a semi-supervised algorithm to improve few-shot object detection by utilizing unlabeled novel objects during training. A hierarchical ternary classification region proposal network is used to localize potential unlabeled objects and assign them new labels, while an improved hierarchical sampling strategy enhances the network's performance."
}