{
    "title": "Robot Navigation in Risky, Crowded Environments: Understanding Human Preferences. (arXiv:2303.08284v1 [cs.RO])",
    "abstract": "Risky and crowded environments (RCE) contain abstract sources of risk and uncertainty, which are perceived differently by humans, leading to a variety of behaviors. Thus, robots deployed in RCEs, need to exhibit diverse perception and planning capabilities in order to interpret other human agents' behavior and act accordingly in such environments. To understand this problem domain, we conducted a study to explore human path choices in RCEs, enabling better robotic navigational explainable AI (XAI) designs. We created a novel COVID-19 pandemic grocery shopping scenario which had time-risk tradeoffs, and acquired users' path preferences. We found that participants showcase a variety of path preferences: from risky and urgent to safe and relaxed. To model users' decision making, we evaluated three popular risk models (Cumulative Prospect Theory (CPT), Conditional Value at Risk (CVAR), and Expected Risk (ER). We found that CPT captured people's decision making more accurately than CVaR and",
    "link": "http://arxiv.org/abs/2303.08284",
    "context": "Title: Robot Navigation in Risky, Crowded Environments: Understanding Human Preferences. (arXiv:2303.08284v1 [cs.RO])\nAbstract: Risky and crowded environments (RCE) contain abstract sources of risk and uncertainty, which are perceived differently by humans, leading to a variety of behaviors. Thus, robots deployed in RCEs, need to exhibit diverse perception and planning capabilities in order to interpret other human agents' behavior and act accordingly in such environments. To understand this problem domain, we conducted a study to explore human path choices in RCEs, enabling better robotic navigational explainable AI (XAI) designs. We created a novel COVID-19 pandemic grocery shopping scenario which had time-risk tradeoffs, and acquired users' path preferences. We found that participants showcase a variety of path preferences: from risky and urgent to safe and relaxed. To model users' decision making, we evaluated three popular risk models (Cumulative Prospect Theory (CPT), Conditional Value at Risk (CVAR), and Expected Risk (ER). We found that CPT captured people's decision making more accurately than CVaR and",
    "path": "papers/23/03/2303.08284.json",
    "total_tokens": 987,
    "translated_title": "在风险与拥挤环境中的机器人导航：理解人类偏好",
    "translated_abstract": "风险与拥挤环境(RCE)包含虚拟的风险和不确定性来源，而这些风险被不同的人感知为不同的行为，因此，在RCE中部署的机器人需要具备多样化的感知和规划能力，以解读其他人类的行为并在这些环境中做出相应的行动。为了了解这个问题域，我们进行了一个研究，探讨了在RCE中人类的路径选择，以便更好地设计机器人导航可解释人工智能(XAI)。我们创建了一个新的COVID-19大流行购物场景，其中包含时间风险权衡，获取了用户的路径偏好。我们发现参与者展示了各种路径首选项：从冒险与紧急到安全与放松。为了对用户的决策进行建模，我们评估了三种流行的风险模型(累积前景理论(CPT),条件价值风险(CVaR)和期望风险(ER))。我们发现，CPT比CVaR和ER更准确地捕捉到了人们的决策行为。",
    "tldr": "本文研究了在风险与拥挤环境下的机器人导航，通过探索人们在COVID-19疫情购物场景中的路径选择偏好，并评估三种流行的风险模型(CPT，CVaR和ER)，以更好地设计机器人导航可解释人工智能(XAI)。",
    "en_tdlr": "This paper explores robot navigation in risky and crowded environments, by studying human path choices in a COVID-19 pandemic grocery shopping scenario and evaluating three popular risk models (CPT, CVaR, and ER), enabling better design of explainable AI for robotic navigation."
}