{
    "title": "Driver Profiling and Bayesian Workload Estimation Using Naturalistic Peripheral Detection Study Data. (arXiv:2303.14720v2 [eess.SP] UPDATED)",
    "abstract": "Monitoring drivers' mental workload facilitates initiating and maintaining safe interactions with in-vehicle information systems, and thus delivers adaptive human machine interaction with reduced impact on the primary task of driving. In this paper, we tackle the problem of workload estimation from driving performance data. First, we present a novel on-road study for collecting subjective workload data via a modified peripheral detection task in naturalistic settings. Key environmental factors that induce a high mental workload are identified via video analysis, e.g. junctions and behaviour of vehicle in front. Second, a supervised learning framework using state-of-the-art time series classifiers (e.g. convolutional neural network and transform techniques) is introduced to profile drivers based on the average workload they experience during a journey. A Bayesian filtering approach is then proposed for sequentially estimating, in (near) real-time, the driver's instantaneous workload. Th",
    "link": "http://arxiv.org/abs/2303.14720",
    "context": "Title: Driver Profiling and Bayesian Workload Estimation Using Naturalistic Peripheral Detection Study Data. (arXiv:2303.14720v2 [eess.SP] UPDATED)\nAbstract: Monitoring drivers' mental workload facilitates initiating and maintaining safe interactions with in-vehicle information systems, and thus delivers adaptive human machine interaction with reduced impact on the primary task of driving. In this paper, we tackle the problem of workload estimation from driving performance data. First, we present a novel on-road study for collecting subjective workload data via a modified peripheral detection task in naturalistic settings. Key environmental factors that induce a high mental workload are identified via video analysis, e.g. junctions and behaviour of vehicle in front. Second, a supervised learning framework using state-of-the-art time series classifiers (e.g. convolutional neural network and transform techniques) is introduced to profile drivers based on the average workload they experience during a journey. A Bayesian filtering approach is then proposed for sequentially estimating, in (near) real-time, the driver's instantaneous workload. Th",
    "path": "papers/23/03/2303.14720.json",
    "total_tokens": 937,
    "translated_title": "使用自然主义周边感知研究数据的驾驶员特征识别与贝叶斯工作负荷预测",
    "translated_abstract": "监测驾驶员的心理工作负荷有助于与车内信息系统进行安全互动，从而实现自适应的人机交互，并减少对驾驶主任务的影响。本文通过驾驶性能数据实现了工作负荷估计的问题。首先，我们提出了一种在自然环境中通过改进的周边感知任务收集主观工作负荷数据的新型实地研究。通过视频分析确定诱发高心理工作负荷的关键环境因素，如交叉路口和前方车辆行为。其次，引入了一个基于最先进的时间序列分类器（如卷积神经网络和变换技术）的监督学习框架，用于根据驾驶员在行程中平均经历的工作负荷特征来进行驾驶员特征识别。然后，提出了一种基于贝叶斯滤波的方法，用于实时或接近实时地顺序估计驾驶员的瞬时工作负荷。",
    "tldr": "本研究通过自然主义周边感知研究数据，提出了一种驾驶员特征识别和贝叶斯工作负荷预测的方法，通过对驾驶性能数据进行监测和分析，实现了驾驶员工作负荷的估计。",
    "en_tdlr": "This paper proposes a method for driver profiling and Bayesian workload estimation using naturalistic peripheral detection study data, which involves monitoring and analyzing driving performance data to estimate the driver's workload."
}