{
    "title": "Local-Global Methods for Generalised Solar Irradiance Forecasting. (arXiv:2303.06010v2 [cs.LG] UPDATED)",
    "abstract": "As the use of solar power increases, having accurate and timely forecasts will be essential for smooth grid operators. There are many proposed methods for forecasting solar irradiance / solar power production. However, many of these methods formulate the problem as a time-series, relying on near real-time access to observations at the location of interest to generate forecasts. This requires both access to a real-time stream of data and enough historical observations for these methods to be deployed. In this paper, we propose the use of Global methods to train our models in a generalised way, enabling them to generate forecasts for unseen locations. We apply this approach to both classical ML and state of the art methods. Using data from 20 locations distributed throughout the UK and widely available weather data, we show that it is possible to build systems that do not require access to this data. We utilise and compare both satellite and ground observations (e.g. temperature, pressur",
    "link": "http://arxiv.org/abs/2303.06010",
    "context": "Title: Local-Global Methods for Generalised Solar Irradiance Forecasting. (arXiv:2303.06010v2 [cs.LG] UPDATED)\nAbstract: As the use of solar power increases, having accurate and timely forecasts will be essential for smooth grid operators. There are many proposed methods for forecasting solar irradiance / solar power production. However, many of these methods formulate the problem as a time-series, relying on near real-time access to observations at the location of interest to generate forecasts. This requires both access to a real-time stream of data and enough historical observations for these methods to be deployed. In this paper, we propose the use of Global methods to train our models in a generalised way, enabling them to generate forecasts for unseen locations. We apply this approach to both classical ML and state of the art methods. Using data from 20 locations distributed throughout the UK and widely available weather data, we show that it is possible to build systems that do not require access to this data. We utilise and compare both satellite and ground observations (e.g. temperature, pressur",
    "path": "papers/23/03/2303.06010.json",
    "total_tokens": 844,
    "translated_title": "通过局部-全局方法进行广义太阳辐射预测",
    "translated_abstract": "随着太阳能使用量的增加，准确及时的预测对于运营平稳的电网运营商至关重要。目前有许多提出的方法用于预测太阳辐射/太阳能产量。然而，许多方法将问题表述为时间序列，依赖于对感兴趣位置附近观测数据的实时访问来生成预测。这要求同时具备实时数据流和足够的历史观测数据。在本文中，我们提出了使用全局方法以一种泛化的方式训练我们的模型，使其能够为未知位置生成预测。我们将这种方法应用于传统机器学习和最先进的方法。利用分布在英国境内的20个位置和广泛可得的天气数据，我们证明了可以构建不需要访问此数据的系统。我们同时利用和比较了卫星和地面观测数据（例如温度，压强）。",
    "tldr": "本文提出了使用局部-全局方法进行广义太阳辐射预测，并且证明了可以构建不需要实时数据和历史观测数据的系统。",
    "en_tdlr": "This paper proposes the use of local-global methods for generalized solar irradiance forecasting, demonstrating the possibility of building systems that do not require real-time data and historical observations."
}