{
    "title": "A Heterogeneous Parallel Non-von Neumann Architecture System for Accurate and Efficient Machine Learning Molecular Dynamics. (arXiv:2303.15474v1 [cs.LG])",
    "abstract": "This paper proposes a special-purpose system to achieve high-accuracy and high-efficiency machine learning (ML) molecular dynamics (MD) calculations. The system consists of field programmable gate array (FPGA) and application specific integrated circuit (ASIC) working in heterogeneous parallelization. To be specific, a multiplication-less neural network (NN) is deployed on the non-von Neumann (NvN)-based ASIC (SilTerra 180 nm process) to evaluate atomic forces, which is the most computationally expensive part of MD. All other calculations of MD are done using FPGA (Xilinx XC7Z100). It is shown that, to achieve similar-level accuracy, the proposed NvN-based system based on low-end fabrication technologies (180 nm) is 1.6x faster and 10^2-10^3x more energy efficiency than state-of-the-art vN based MLMD using graphics processing units (GPUs) based on much more advanced technologies (12 nm), indicating superiority of the proposed NvN-based heterogeneous parallel architecture.",
    "link": "http://arxiv.org/abs/2303.15474",
    "context": "Title: A Heterogeneous Parallel Non-von Neumann Architecture System for Accurate and Efficient Machine Learning Molecular Dynamics. (arXiv:2303.15474v1 [cs.LG])\nAbstract: This paper proposes a special-purpose system to achieve high-accuracy and high-efficiency machine learning (ML) molecular dynamics (MD) calculations. The system consists of field programmable gate array (FPGA) and application specific integrated circuit (ASIC) working in heterogeneous parallelization. To be specific, a multiplication-less neural network (NN) is deployed on the non-von Neumann (NvN)-based ASIC (SilTerra 180 nm process) to evaluate atomic forces, which is the most computationally expensive part of MD. All other calculations of MD are done using FPGA (Xilinx XC7Z100). It is shown that, to achieve similar-level accuracy, the proposed NvN-based system based on low-end fabrication technologies (180 nm) is 1.6x faster and 10^2-10^3x more energy efficiency than state-of-the-art vN based MLMD using graphics processing units (GPUs) based on much more advanced technologies (12 nm), indicating superiority of the proposed NvN-based heterogeneous parallel architecture.",
    "path": "papers/23/03/2303.15474.json",
    "total_tokens": 990,
    "translated_title": "一种用于精确高效的机器学习分子动力学的异构并行非冯·诺依曼结构系统",
    "translated_abstract": "本文提出了一个专用系统，用于实现高精度和高效率的机器学习（ML）分子动力学（MD）计算。该系统由异构并行的现场可编程门阵列（FPGA）和应用特定集成电路（ASIC）组成。具体而言，采用不依赖冯·诺依曼（NvN）体系结构（SilTerra 180 nm工艺）的去乘法神经网络（NN）来评估原子力，这是MD的计算开销最大的部分。MD的所有其他计算都使用FPGA（Xilinx XC7Z100）完成。结果显示，为了实现类似精度，基于低端制造工艺（180 nm）的NvN系统比基于显卡处理器（GPU）的最先进vN MLMD快1.6倍，并且能源效率高出10^2-10^3倍，表明所提出的NvN异构并行架构的优越性。",
    "tldr": "该论文提出了一个用于实现高精度高效率的机器学习分子动力学计算的专用系统。该系统采用异构并行结构，其中不依赖冯·诺依曼结构的ASIC用于评估计算开销最大的原子力。与基于GPU的现有技术相比，该系统具有更高的能源效率和更低的制造成本。",
    "en_tdlr": "This paper proposes a special-purpose system for accurate and efficient machine learning molecular dynamics calculations. The system uses a heterogeneous parallel architecture, with an ASIC that does not rely on von Neumann architecture to evaluate atomic forces, which is the most computationally expensive part of MD. Compared to existing GPU-based technology, the proposed system has higher energy efficiency and lower manufacturing costs."
}