{
    "title": "MindDiffuser: Controlled Image Reconstruction from Human Brain Activity with Semantic and Structural Diffusion. (arXiv:2303.14139v1 [cs.CV])",
    "abstract": "Reconstructing visual stimuli from measured functional magnetic resonance imaging (fMRI) has been a meaningful and challenging task. Previous studies have successfully achieved reconstructions with structures similar to the original images, such as the outlines and size of some natural images. However, these reconstructions lack explicit semantic information and are difficult to discern. In recent years, many studies have utilized multi-modal pre-trained models with stronger generative capabilities to reconstruct images that are semantically similar to the original ones. However, these images have uncontrollable structural information such as position and orientation. To address both of the aforementioned issues simultaneously, we propose a two-stage image reconstruction model called MindDiffuser, utilizing Stable Diffusion. In Stage 1, the VQ-VAE latent representations and the CLIP text embeddings decoded from fMRI are put into the image-to-image process of Stable Diffusion, which yie",
    "link": "http://arxiv.org/abs/2303.14139",
    "context": "Title: MindDiffuser: Controlled Image Reconstruction from Human Brain Activity with Semantic and Structural Diffusion. (arXiv:2303.14139v1 [cs.CV])\nAbstract: Reconstructing visual stimuli from measured functional magnetic resonance imaging (fMRI) has been a meaningful and challenging task. Previous studies have successfully achieved reconstructions with structures similar to the original images, such as the outlines and size of some natural images. However, these reconstructions lack explicit semantic information and are difficult to discern. In recent years, many studies have utilized multi-modal pre-trained models with stronger generative capabilities to reconstruct images that are semantically similar to the original ones. However, these images have uncontrollable structural information such as position and orientation. To address both of the aforementioned issues simultaneously, we propose a two-stage image reconstruction model called MindDiffuser, utilizing Stable Diffusion. In Stage 1, the VQ-VAE latent representations and the CLIP text embeddings decoded from fMRI are put into the image-to-image process of Stable Diffusion, which yie",
    "path": "papers/23/03/2303.14139.json",
    "total_tokens": 871,
    "translated_title": "MindDiffuser：基于人脑活动的受控图像重建与语义结构扩散",
    "translated_abstract": "从测量的功能磁共振成像（fMRI）中重建视觉刺激是一项有意义且具有挑战性的任务。以前的研究已成功实现了重建与原始图像相似的结构，例如一些自然图像的轮廓和大小。但这些重建缺乏明确的语义信息，难以识别。近年来，许多研究利用具有更强生成能力的多模态预训练模型重建与原始图像在语义上相似的图像。但是，这些图像具有不可控制的结构信息，例如位置和方向。为了同时解决上述问题，我们提出了一个名为MindDiffuser的两阶段图像重建模型，利用稳定扩散技术。在第一阶段中，将从fMRI解码的VQ-VAE潜在表示和CLIP文本嵌入放入稳定扩散的图像对图像处理中，这产生了...",
    "tldr": "本文提出了一个名为MindDiffuser的两阶段图像重建模型，通过利用稳定扩散技术，同时解决了重建图像缺乏明确语义信息和图像结构不可控制的问题。"
}