{
    "title": "Synthetic ECG Signal Generation using Probabilistic Diffusion Models. (arXiv:2303.02475v2 [eess.SP] UPDATED)",
    "abstract": "Deep learning image processing models have had remarkable success in recent years in generating high quality images. Particularly, the Improved Denoising Diffusion Probabilistic Models (DDPM) have shown superiority in image quality to the state-of-the-art generative models, which motivated us to investigate its capability in generation of the synthetic electrocardiogram (ECG) signals. In this work, synthetic ECG signals are generated by the Improved DDPM and by the Wasserstein GAN with Gradient Penalty (WGAN-GP) models and then compared. To this end, we devise a pipeline to utilize DDPM in its original $2D$ form. First, the $1D$ ECG time series data are embedded into the $2D$ space, for which we employed the Gramian Angular Summation/Difference Fields (GASF/GADF) as well as Markov Transition Fields (MTF) to generate three $2D$ matrices from each ECG time series that, which when put together, form a $3$-channel $2D$ datum. Then $2D$ DDPM is used to generate $2D$ $3$-channel synthetic EC",
    "link": "http://arxiv.org/abs/2303.02475",
    "context": "Title: Synthetic ECG Signal Generation using Probabilistic Diffusion Models. (arXiv:2303.02475v2 [eess.SP] UPDATED)\nAbstract: Deep learning image processing models have had remarkable success in recent years in generating high quality images. Particularly, the Improved Denoising Diffusion Probabilistic Models (DDPM) have shown superiority in image quality to the state-of-the-art generative models, which motivated us to investigate its capability in generation of the synthetic electrocardiogram (ECG) signals. In this work, synthetic ECG signals are generated by the Improved DDPM and by the Wasserstein GAN with Gradient Penalty (WGAN-GP) models and then compared. To this end, we devise a pipeline to utilize DDPM in its original $2D$ form. First, the $1D$ ECG time series data are embedded into the $2D$ space, for which we employed the Gramian Angular Summation/Difference Fields (GASF/GADF) as well as Markov Transition Fields (MTF) to generate three $2D$ matrices from each ECG time series that, which when put together, form a $3$-channel $2D$ datum. Then $2D$ DDPM is used to generate $2D$ $3$-channel synthetic EC",
    "path": "papers/23/03/2303.02475.json",
    "total_tokens": 847,
    "tldr": "本文研究了改进去噪扩散概率模型（DDPM）在合成ECG信号方面的应用，生成的合成ECG信号和WGAN-GP模型进行了比较。",
    "en_tdlr": "This paper investigates the application of the Improved Denoising Diffusion Probabilistic Models (DDPM) in generating synthetic electrocardiogram (ECG) signals and compares the generated signals with Wasserstein GAN with Gradient Penalty (WGAN-GP) model."
}