{
    "title": "Long-tailed Classification from a Bayesian-decision-theory Perspective. (arXiv:2303.06075v1 [cs.LG])",
    "abstract": "Long-tailed classification poses a challenge due to its heavy imbalance in class probabilities and tail-sensitivity risks with asymmetric misprediction costs. Recent attempts have used re-balancing loss and ensemble methods, but they are largely heuristic and depend heavily on empirical results, lacking theoretical explanation. Furthermore, existing methods overlook the decision loss, which characterizes different costs associated with tailed classes. This paper presents a general and principled framework from a Bayesian-decision-theory perspective, which unifies existing techniques including re-balancing and ensemble methods, and provides theoretical justifications for their effectiveness. From this perspective, we derive a novel objective based on the integrated risk and a Bayesian deep-ensemble approach to improve the accuracy of all classes, especially the ``tail\". Besides, our framework allows for task-adaptive decision loss which provides provably optimal decisions in varying tas",
    "link": "http://arxiv.org/abs/2303.06075",
    "raw_ret": "{\n    \"translated_title\": \"基于贝叶斯决策理论的长尾分类\",\n    \"translated_abstract\": \"由于其类概率的严重不平衡和尾部敏感性风险以及不对称的错误预测成本，长尾分类面临挑战。最近的尝试使用重新平衡损失和集合方法，但它们在很大程度上是启发式的，并且严重依赖于实证结果，缺乏理论解释。此外，现有方法忽略了决策损失，其表征了与尾部类别相关的不同成本。本文从贝叶斯决策理论的角度提出了一个通用和原则性的框架，统一了包括重新平衡和集合方法在内的现有技术，并为其有效性提供了理论证明。从这个角度出发，我们基于综合风险和贝叶斯深度集成方法，提出了一种改进所有类别精度的新目标，特别是“尾部”。此外，我们的框架允许任务自适应决策损失，从而在不同的任务中提供可证明的最优决策。\",\n    \"tldr\": \"本论文提出了一种基于贝叶斯决策理论的通用和原则性的长尾分类框架，通过综合风险和贝叶斯深度集成方法，提出了一种改进所有类别精度的新目标，特别是“尾部”。此外，该框架允许任务自适应决策损失，从而在不同的任务中提供可证明的最优决策。\"\n}<|im_sep|>",
    "total_tokens": 930,
    "ret": {
        "translated_title": "基于贝叶斯决策理论的长尾分类",
        "translated_abstract": "由于其类概率的严重不平衡和尾部敏感性风险以及不对称的错误预测成本，长尾分类面临挑战。最近的尝试使用重新平衡损失和集合方法，但它们在很大程度上是启发式的，并且严重依赖于实证结果，缺乏理论解释。此外，现有方法忽略了决策损失，其表征了与尾部类别相关的不同成本。本文从贝叶斯决策理论的角度提出了一个通用和原则性的框架，统一了包括重新平衡和集合方法在内的现有技术，并为其有效性提供了理论证明。从这个角度出发，我们基于综合风险和贝叶斯深度集成方法，提出了一种改进所有类别精度的新目标，特别是“尾部”。此外，我们的框架允许任务自适应决策损失，从而在不同的任务中提供可证明的最优决策。",
        "tldr": "本论文提出了一种基于贝叶斯决策理论的通用和原则性的长尾分类框架，通过综合风险和贝叶斯深度集成方法，提出了一种改进所有类别精度的新目标，特别是“尾部”。此外，该框架允许任务自适应决策损失，从而在不同的任务中提供可证明的最优决策。"
    }
}