{
    "title": "Efficient Lipschitzian Global Optimization of H\\\"older Continuous Multivariate Functions. (arXiv:2303.14293v1 [cs.LG])",
    "abstract": "This study presents an effective global optimization technique designed for multivariate functions that are H\\\"older continuous. Unlike traditional methods that construct lower bounding proxy functions, this algorithm employs a predetermined query creation rule that makes it computationally superior. The algorithm's performance is assessed using the average or cumulative regret, which also implies a bound for the simple regret and reflects the overall effectiveness of the approach. The results show that with appropriate parameters the algorithm attains an average regret bound of $O(T^{-\\frac{\\alpha}{n}})$ for optimizing a H\\\"older continuous target function with H\\\"older exponent $\\alpha$ in an $n$-dimensional space within a given time horizon $T$. We demonstrate that this bound is minimax optimal.",
    "link": "http://arxiv.org/abs/2303.14293",
    "context": "Title: Efficient Lipschitzian Global Optimization of H\\\"older Continuous Multivariate Functions. (arXiv:2303.14293v1 [cs.LG])\nAbstract: This study presents an effective global optimization technique designed for multivariate functions that are H\\\"older continuous. Unlike traditional methods that construct lower bounding proxy functions, this algorithm employs a predetermined query creation rule that makes it computationally superior. The algorithm's performance is assessed using the average or cumulative regret, which also implies a bound for the simple regret and reflects the overall effectiveness of the approach. The results show that with appropriate parameters the algorithm attains an average regret bound of $O(T^{-\\frac{\\alpha}{n}})$ for optimizing a H\\\"older continuous target function with H\\\"older exponent $\\alpha$ in an $n$-dimensional space within a given time horizon $T$. We demonstrate that this bound is minimax optimal.",
    "path": "papers/23/03/2303.14293.json",
    "total_tokens": 775,
    "translated_title": "针对Hölder连续多元函数的高效Lipschitzian全局优化方法",
    "translated_abstract": "本研究提出了一种有效的全局优化技术，专门针对Hölder连续的多元函数。与构造下界代理函数的传统方法不同，这个算法采用了预定的查询创建规则，使其在计算上更具优势。算法的性能使用平均或累积遗憾进行评估，这也意味着简单遗憾的界限，反映了该方法的整体有效性。结果表明，使用适当的参数，算法在给定时间段$T$内针对Hölder连续的Hölder指数为$\\alpha$的目标函数在$n$维空间中获得了$O(T^{-\\frac{\\alpha}{n}})$的平均遗憾界限。我们证明了这一界限是极小化最优的。",
    "tldr": "本研究提出了一种高效的全局优化技术，通过预定的查询创建规则实现了对Hölder连续多元函数的计算优势，可在给定时间段内获得 minimax 最优的结果。",
    "en_tdlr": "An efficient global optimization technique is proposed for H\\\"older continuous multivariate functions using a predetermined query creation rule, achieving minimax optimal results within a given time frame."
}