{
    "title": "Learning-based Observer Evaluated on the Kinematic Bicycle Model. (arXiv:2303.17933v1 [cs.RO])",
    "abstract": "The knowledge of the states of a vehicle is a necessity to perform proper planning and control. These quantities are usually accessible through measurements. Control theory brings extremely useful methods -- observers -- to deal with quantities that cannot be directly measured or with noisy measurements. Classical observers are mathematically derived from models. In spite of their success, such as the Kalman filter, they show their limits when systems display high non-linearities, modeling errors, high uncertainties or difficult interactions with the environment (e.g. road contact). In this work, we present a method to build a learning-based observer able to outperform classical observing methods. We compare several neural network architectures and define the data generation procedure used to train them. The method is evaluated on a kinematic bicycle model which allows to easily generate data for training and testing. This model is also used in an Extended Kalman Filter (EKF) for compa",
    "link": "http://arxiv.org/abs/2303.17933",
    "context": "Title: Learning-based Observer Evaluated on the Kinematic Bicycle Model. (arXiv:2303.17933v1 [cs.RO])\nAbstract: The knowledge of the states of a vehicle is a necessity to perform proper planning and control. These quantities are usually accessible through measurements. Control theory brings extremely useful methods -- observers -- to deal with quantities that cannot be directly measured or with noisy measurements. Classical observers are mathematically derived from models. In spite of their success, such as the Kalman filter, they show their limits when systems display high non-linearities, modeling errors, high uncertainties or difficult interactions with the environment (e.g. road contact). In this work, we present a method to build a learning-based observer able to outperform classical observing methods. We compare several neural network architectures and define the data generation procedure used to train them. The method is evaluated on a kinematic bicycle model which allows to easily generate data for training and testing. This model is also used in an Extended Kalman Filter (EKF) for compa",
    "path": "papers/23/03/2303.17933.json",
    "total_tokens": 922,
    "translated_title": "基于学习的观测器在动力学自行车模型上的应用",
    "translated_abstract": "车辆状态的知识是进行适当规划和控制的必要条件。这些量通常可以通过测量获得。控制理论提供了极其有用的方法-观测器-用于处理不能直接测量或具有噪声测量的数量。经典观察器是从模型中数学推导出来的。尽管它们成功地应用在如卡尔曼滤波器之类的情况下，但在系统表现出高度非线性、建模误差、高度不确定性或与环境交互困难（例如道路接触）时，它们表现出其局限性。在本文中，我们提出了一种建立在学习基础上的观测器方法，能够胜过经典的观测方法。我们比较了几种神经网络架构，并定义了用于训练它们的数据生成过程。该方法在动力学自行车模型上得到评价，这可以方便地生成用于训练和测试的数据。这个模型也被用于扩展卡尔曼滤波器（EKF）进行比较。",
    "tldr": "本文提出了一种基于学习的观测器方法，能够在处理非线性、不确定、模型误差等问题方面胜过经典观测器。该方法在动力学自行车模型上已得到评价和应用。"
}