{
    "title": "Multiple Hands Make Light Work: Enhancing Quality and Diversity using MAP-Elites with Multiple Parallel Evolution Strategies. (arXiv:2303.06137v1 [cs.NE])",
    "abstract": "With the development of hardware accelerators and their corresponding tools, evaluations have become more affordable through fast and massively parallel evaluations in some applications. This advancement has drastically sped up the runtime of evolution-inspired algorithms such as Quality-Diversity optimization, creating tremendous potential for algorithmic innovation through scale. In this work, we propose MAP-Elites-Multi-ES (MEMES), a novel QD algorithm based on Evolution Strategies (ES) designed for fast parallel evaluations. ME-Multi-ES builds on top of the existing MAP-Elites-ES algorithm, scaling it by maintaining multiple independent ES threads with massive parallelization. We also introduce a new dynamic reset procedure for the lifespan of the independent ES to autonomously maximize the improvement of the QD population. We show experimentally that MEMES outperforms existing gradient-based and objective-agnostic QD algorithms when compared in terms of generations. We perform thi",
    "link": "http://arxiv.org/abs/2303.06137",
    "raw_ret": "{\n    \"translated_title\": \"多手轻松完成：使用多个并行进化策略的MAP-Elites增强质量和多样性\",\n    \"translated_abstract\": \"随着硬件加速器及其相应工具的发展，在某些应用中通过快速和大规模的评估，评估已变得更加经济实惠。这种进展极大地加快了启发式算法（如质量-多样性优化）的运行时，并创造了通过规模进行算法创新的巨大潜力。在这项工作中，我们提出了MAP-Elites-Multi-ES（MEMES），这是一种基于进化策略（ES）的新型QD算法，专为快速并行评估而设计。 ME-Multi-ES在现有的MAP-Elites-ES算法基础上进行了改进，通过维护具有大规模并行性的多个独立ES线程来扩展它。我们还介绍了一种新的动态重置程序，用于自主最大化QD群体的改进。实验表明，与基于梯度和客观不可知的QD算法相比，MEMES在代数方面表现更好。\",\n    \"tldr\": \"本论文提出了一种新的QD算法——MAP-Elites-Multi-ES（MEMES），该算法基于进化策略（ES）和快速并行评估，通过维护具有大规模并行性的多个独立ES线程来扩展现有算法。实验表明，该算法在代数方面表现更好，是一种有效的算法创新。\"\n}",
    "total_tokens": 917,
    "ret": {
        "translated_title": "多手轻松完成：使用多个并行进化策略的MAP-Elites增强质量和多样性",
        "translated_abstract": "随着硬件加速器及其相应工具的发展，在某些应用中通过快速和大规模的评估，评估已变得更加经济实惠。这种进展极大地加快了启发式算法（如质量-多样性优化）的运行时，并创造了通过规模进行算法创新的巨大潜力。在这项工作中，我们提出了MAP-Elites-Multi-ES（MEMES），这是一种基于进化策略（ES）的新型QD算法，专为快速并行评估而设计。 ME-Multi-ES在现有的MAP-Elites-ES算法基础上进行了改进，通过维护具有大规模并行性的多个独立ES线程来扩展它。我们还介绍了一种新的动态重置程序，用于自主最大化QD群体的改进。实验表明，与基于梯度和客观不可知的QD算法相比，MEMES在代数方面表现更好。",
        "tldr": "本论文提出了一种新的QD算法——MAP-Elites-Multi-ES（MEMES），该算法基于进化策略（ES）和快速并行评估，通过维护具有大规模并行性的多个独立ES线程来扩展现有算法。实验表明，该算法在代数方面表现更好，是一种有效的算法创新。"
    }
}