{
    "title": "A Pathway Towards Responsible AI Generated Content. (arXiv:2303.01325v2 [cs.AI] UPDATED)",
    "abstract": "AI Generated Content (AIGC) has received tremendous attention within the past few years, with content ranging from image, text, to audio, video, etc. Meanwhile, AIGC has become a double-edged sword and recently received much criticism regarding its responsible usage. In this vision paper, we focus on three main concerns that may hinder the healthy development and deployment of AIGC in practice, including risks from privacy, bias, toxicity, misinformation, and intellectual property (IP). By documenting known and potential risks, as well as any possible misuse scenarios of AIGC, the aim is to draw attention to potential risks and misuse, help society to eliminate obstacles, and promote the more ethical and secure deployment of AIGC. Additionally, we provide insights into the promising directions for tackling these risks while constructing generative models, enabling AIGC to be used responsibly to benefit society.",
    "link": "http://arxiv.org/abs/2303.01325",
    "context": "Title: A Pathway Towards Responsible AI Generated Content. (arXiv:2303.01325v2 [cs.AI] UPDATED)\nAbstract: AI Generated Content (AIGC) has received tremendous attention within the past few years, with content ranging from image, text, to audio, video, etc. Meanwhile, AIGC has become a double-edged sword and recently received much criticism regarding its responsible usage. In this vision paper, we focus on three main concerns that may hinder the healthy development and deployment of AIGC in practice, including risks from privacy, bias, toxicity, misinformation, and intellectual property (IP). By documenting known and potential risks, as well as any possible misuse scenarios of AIGC, the aim is to draw attention to potential risks and misuse, help society to eliminate obstacles, and promote the more ethical and secure deployment of AIGC. Additionally, we provide insights into the promising directions for tackling these risks while constructing generative models, enabling AIGC to be used responsibly to benefit society.",
    "path": "papers/23/03/2303.01325.json",
    "total_tokens": 862,
    "translated_title": "前往负责任的AI生成内容之路",
    "translated_abstract": "近年来，AI生成内容（AIGC）受到了极大的关注，其内容涵盖了图像、文本、音频、视频等。与此同时，AIGC已经成为一把双刃剑，并最近在其负责任使用方面受到了许多批评。在本视野论文中，我们关注可能阻碍AIGC在实践中健康发展和部署的三个主要问题，包括来自隐私、偏见、毒性、错误信息和知识产权（IP）的风险。通过记录已知和潜在的风险，以及AIGC的任何可能的滥用情况，旨在引起对潜在风险和滥用的注意，帮助社会消除障碍，并促进更加道德和安全的AIGC部署。此外，我们提供了对应对这些风险的有希望的方向的见解，同时构建生成模型，使AIGC能够负责任地为社会带来益处。",
    "tldr": "本文探讨了AI生成内容的合理使用所面临的风险，包括隐私、偏见、毒性、错误信息和知识产权等，并提供有希望的解决方向。",
    "en_tdlr": "This paper discusses the risks associated with responsible usage of AI Generated Content, including privacy, bias, toxicity, misinformation, and intellectual property. Promising directions for addressing these risks are also provided."
}