{
    "title": "marl-jax: Multi-agent Reinforcement Leaning framework for Social Generalization. (arXiv:2303.13808v1 [cs.MA])",
    "abstract": "Recent advances in Reinforcement Learning (RL) have led to many exciting applications. These advancements have been driven by improvements in both algorithms and engineering, which have resulted in faster training of RL agents. We present marl-jax, a multi-agent reinforcement learning software package for training and evaluating social generalization of the agents. The package is designed for training a population of agents in multi-agent environments and evaluating their ability to generalize to diverse background agents. It is built on top of DeepMind's JAX ecosystem~\\cite{deepmind2020jax} and leverages the RL ecosystem developed by DeepMind. Our framework marl-jax is capable of working in cooperative and competitive, simultaneous-acting environments with multiple agents. The package offers an intuitive and user-friendly command-line interface for training a population and evaluating its generalization capabilities. In conclusion, marl-jax provides a valuable resource for researchers",
    "link": "http://arxiv.org/abs/2303.13808",
    "context": "Title: marl-jax: Multi-agent Reinforcement Leaning framework for Social Generalization. (arXiv:2303.13808v1 [cs.MA])\nAbstract: Recent advances in Reinforcement Learning (RL) have led to many exciting applications. These advancements have been driven by improvements in both algorithms and engineering, which have resulted in faster training of RL agents. We present marl-jax, a multi-agent reinforcement learning software package for training and evaluating social generalization of the agents. The package is designed for training a population of agents in multi-agent environments and evaluating their ability to generalize to diverse background agents. It is built on top of DeepMind's JAX ecosystem~\\cite{deepmind2020jax} and leverages the RL ecosystem developed by DeepMind. Our framework marl-jax is capable of working in cooperative and competitive, simultaneous-acting environments with multiple agents. The package offers an intuitive and user-friendly command-line interface for training a population and evaluating its generalization capabilities. In conclusion, marl-jax provides a valuable resource for researchers",
    "path": "papers/23/03/2303.13808.json",
    "total_tokens": 908,
    "translated_title": "marl-jax：用于社会普适性的多智能体强化学习框架",
    "translated_abstract": "最近，强化学习领域的进展促进了许多令人兴奋的应用。这些进展是由算法和工程方面的改进驱动的，导致RL代理的训练速度更快。我们提出了marl-jax，这是一个用于训练和评估代理的社会普适性的多智能体强化学习软件包。该包旨在训练多智能体环境中的一组代理，并评估其对多样化背景代理的泛化能力。它建立在DeepMind的JAX生态系统上，并利用由DeepMind开发的RL生态系统。我们的marl-jax框架能够在多个代理的合作和竞争、同时行动的环境中工作。该包提供了一个直观且用户友好的命令行界面，用于训练一组代理并评估其泛化能力。总之，marl-jax为研究人员提供了有价值的资源。",
    "tldr": "marl-jax是一个基于DeepMind的JAX生态系和RL生态系的多智能体RL软件包，可以训练和评估代理在多样性背景下的社会普适性，提供命令行界面，适用于合作与竞争游戏环境。",
    "en_tdlr": "marl-jax is a multi-agent RL package based on DeepMind's JAX and RL ecosystem, capable of training and evaluating agents for social generalization in diverse backgrounds in cooperative and competitive games, offering a command-line interface."
}