{
    "title": "Large-scale End-of-Life Prediction of Hard Disks in Distributed Datacenters. (arXiv:2303.08955v1 [cs.LG])",
    "abstract": "On a daily basis, data centers process huge volumes of data backed by the proliferation of inexpensive hard disks. Data stored in these disks serve a range of critical functional needs from financial, and healthcare to aerospace. As such, premature disk failure and consequent loss of data can be catastrophic. To mitigate the risk of failures, cloud storage providers perform condition-based monitoring and replace hard disks before they fail. By estimating the remaining useful life of hard disk drives, one can predict the time-to-failure of a particular device and replace it at the right time, ensuring maximum utilization whilst reducing operational costs. In this work, large-scale predictive analyses are performed using severely skewed health statistics data by incorporating customized feature engineering and a suite of sequence learners. Past work suggests using LSTMs as an excellent approach to predicting remaining useful life. To this end, we present an encoder-decoder LSTM model whe",
    "link": "http://arxiv.org/abs/2303.08955",
    "context": "Title: Large-scale End-of-Life Prediction of Hard Disks in Distributed Datacenters. (arXiv:2303.08955v1 [cs.LG])\nAbstract: On a daily basis, data centers process huge volumes of data backed by the proliferation of inexpensive hard disks. Data stored in these disks serve a range of critical functional needs from financial, and healthcare to aerospace. As such, premature disk failure and consequent loss of data can be catastrophic. To mitigate the risk of failures, cloud storage providers perform condition-based monitoring and replace hard disks before they fail. By estimating the remaining useful life of hard disk drives, one can predict the time-to-failure of a particular device and replace it at the right time, ensuring maximum utilization whilst reducing operational costs. In this work, large-scale predictive analyses are performed using severely skewed health statistics data by incorporating customized feature engineering and a suite of sequence learners. Past work suggests using LSTMs as an excellent approach to predicting remaining useful life. To this end, we present an encoder-decoder LSTM model whe",
    "path": "papers/23/03/2303.08955.json",
    "total_tokens": 855,
    "translated_title": "分布式数据中心中硬盘寿命大规模预测",
    "translated_abstract": "数据中心每天处理海量数据，这些数据存储在价格便宜的硬盘中，用于金融、医疗和航天等重要领域。硬盘的过早损坏和数据的丢失可能会造成灾难性的后果。为了降低故障的风险，云存储提供商执行基于条件的监控并在故障之前更换硬盘。通过估计硬盘剩余寿命，可以预测特定设备的故障时间并在合适的时间内替换硬盘，确保最大利用率同时降低运营成本。本文使用定制的特征工程和一套序列学习器对极度偏斜的健康统计数据进行大规模预测分析。过去的工作表明，使用LSTM预测剩余寿命是一个很好的方法。因此，我们提出了一种编码器-解码器LSTM模型",
    "tldr": "本文通过定制特征工程和序列学习器，提出一种编码器-解码器LSTM模型，用于大规模预测硬盘剩余寿命，从而降低运营成本",
    "en_tdlr": "This paper proposes an encoder-decoder LSTM model for large-scale prediction of hard disk remaining useful life by incorporating customized feature engineering and a suite of sequence learners, aiming to reduce operational costs."
}