{
    "title": "Unsupervised Feature Selection to Identify Important ICD-10 Codes for Machine Learning: A Case Study on a Coronary Artery Disease Patient Cohort. (arXiv:2303.14303v1 [cs.LG])",
    "abstract": "The use of International Classification of Diseases (ICD) codes in healthcare presents a challenge in selecting relevant codes as features for machine learning models due to this system's large number of codes. In this study, we compared several unsupervised feature selection methods for an ICD code database of 49,075 coronary artery disease patients in Alberta, Canada. Specifically, we employed Laplacian Score, Unsupervised Feature Selection for Multi-Cluster Data, Autoencoder Inspired Unsupervised Feature Selection, Principal Feature Analysis, and Concrete Autoencoders with and without ICD tree weight adjustment to select the 100 best features from over 9,000 codes. We assessed the selected features based on their ability to reconstruct the initial feature space and predict 90-day mortality following discharge. Our findings revealed that the Concrete Autoencoder methods outperformed all other methods in both tasks. Furthermore, the weight adjustment in the Concrete Autoencoder method",
    "link": "http://arxiv.org/abs/2303.14303",
    "context": "Title: Unsupervised Feature Selection to Identify Important ICD-10 Codes for Machine Learning: A Case Study on a Coronary Artery Disease Patient Cohort. (arXiv:2303.14303v1 [cs.LG])\nAbstract: The use of International Classification of Diseases (ICD) codes in healthcare presents a challenge in selecting relevant codes as features for machine learning models due to this system's large number of codes. In this study, we compared several unsupervised feature selection methods for an ICD code database of 49,075 coronary artery disease patients in Alberta, Canada. Specifically, we employed Laplacian Score, Unsupervised Feature Selection for Multi-Cluster Data, Autoencoder Inspired Unsupervised Feature Selection, Principal Feature Analysis, and Concrete Autoencoders with and without ICD tree weight adjustment to select the 100 best features from over 9,000 codes. We assessed the selected features based on their ability to reconstruct the initial feature space and predict 90-day mortality following discharge. Our findings revealed that the Concrete Autoencoder methods outperformed all other methods in both tasks. Furthermore, the weight adjustment in the Concrete Autoencoder method",
    "path": "papers/23/03/2303.14303.json",
    "total_tokens": 996,
    "translated_title": "无监督特征选择识别ICD-10编码，以用于机器学习：冠状动脉疾病患者队列的案例研究",
    "translated_abstract": "在医疗保健中使用的国际疾病分类（ICD）代码因代码数量过多而在选择用于机器学习模型的相关代码作为特征时面临挑战。本研究比较了49,075例加拿大阿尔伯塔省冠状动脉疾病患者的ICD编码数据库的几种无监督特征选择方法。我们采用了拉普拉斯分数、多集群数据无监督特征选择、自编码器启发的无监督特征选择、主要特征分析以及具有和不具有ICD树权重调整的Concrete Autoencoders来选择超过9,000个代码中的100个最佳特征。我们评估了选择的特征能力，基于其重建初始特征空间和预测出院后90天的死亡率。我们的研究结果表明，在两项任务中，Concrete Autoencoder方法优于所有其他方法。此外，Concrete Autoencoder方法中的权重调整经证实提高了其准确性。",
    "tldr": "本研究比较了几种无监督特征选择方法，通过选择性能最佳的Concrete Autoencoder方法，成功识别出49,075例冠状动脉疾病患者数据库中的最佳100个特征，并证实Concrete Autoencoder方法中的权重调整能够提高其准确性。",
    "en_tdlr": "This study compared several unsupervised feature selection methods and successfully identified the top 100 features from a database of 49,075 coronary artery disease patients using the Concrete Autoencoder method, which outperformed all other methods in both tasks. The weight adjustment in the Concrete Autoencoder method was also found to improve its accuracy."
}