{
    "title": "Multi-Flow Transmission in Wireless Interference Networks: A Convergent Graph Learning Approach. (arXiv:2303.15544v1 [cs.LG])",
    "abstract": "We consider the problem of of multi-flow transmission in wireless networks, where data signals from different flows can interfere with each other due to mutual interference between links along their routes, resulting in reduced link capacities. The objective is to develop a multi-flow transmission strategy that routes flows across the wireless interference network to maximize the network utility. However, obtaining an optimal solution is computationally expensive due to the large state and action spaces involved. To tackle this challenge, we introduce a novel algorithm called Dual-stage Interference-Aware Multi-flow Optimization of Network Data-signals (DIAMOND). The design of DIAMOND allows for a hybrid centralized-distributed implementation, which is a characteristic of 5G and beyond technologies with centralized unit deployments. A centralized stage computes the multi-flow transmission strategy using a novel design of graph neural network (GNN) reinforcement learning (RL) routing ag",
    "link": "http://arxiv.org/abs/2303.15544",
    "context": "Title: Multi-Flow Transmission in Wireless Interference Networks: A Convergent Graph Learning Approach. (arXiv:2303.15544v1 [cs.LG])\nAbstract: We consider the problem of of multi-flow transmission in wireless networks, where data signals from different flows can interfere with each other due to mutual interference between links along their routes, resulting in reduced link capacities. The objective is to develop a multi-flow transmission strategy that routes flows across the wireless interference network to maximize the network utility. However, obtaining an optimal solution is computationally expensive due to the large state and action spaces involved. To tackle this challenge, we introduce a novel algorithm called Dual-stage Interference-Aware Multi-flow Optimization of Network Data-signals (DIAMOND). The design of DIAMOND allows for a hybrid centralized-distributed implementation, which is a characteristic of 5G and beyond technologies with centralized unit deployments. A centralized stage computes the multi-flow transmission strategy using a novel design of graph neural network (GNN) reinforcement learning (RL) routing ag",
    "path": "papers/23/03/2303.15544.json",
    "total_tokens": 1094,
    "translated_title": "无线干扰网络中的多流传输：基于收敛图学习方法的研究",
    "translated_abstract": "本文针对无线网络中多流传输的问题进行研究，其中不同流间的数据信号可能由于它们路径上的链路间相互干扰而使链路容量减小。其目的是开发一种多流传输策略，通过路由在无线干扰网络中传输流以最大化网络效用。然而，由于涉及大量状态和操作空间，获得最优解的计算代价是昂贵的。为应对这个挑战，我们引入了一种新的算法Dual-stage Interference-Aware Multi-flow Optimization of Network Data-signals (DIAMOND)。DIAMOND算法的设计允许采用混合式的集中式-分布式实现，这是5G及更高技术中具有中央单元部署特征的一种。集中式阶段使用一种新颖的图神经网络 (GNN) 强化学习 (RL) 路由代理计算多流传输策略。GNN-RL代理已经训练好了以学习网络状态并设计一个考虑干扰的路由策略。然后，这个策略被用于指导沿无干扰路径传输流，随后分布式阶段则利用这个策略来传输数据包。模拟结果表明DIAMOND算法在网络性能方面比现有方法表现更好，提高了15-20％。",
    "tldr": "本研究提出DIAMOND算法用于无线干扰网络中的多流传输，该算法基于收敛图学习方法，既可以集中式计算多流传输策略，也可以分布式实现数据包的传输，相比现有方法提高了15-20％的网络性能。",
    "en_tdlr": "This study proposes the DIAMOND algorithm for multi-flow transmission in wireless interference networks, which utilizes a convergent graph learning approach. It can perform both centralized and distributed operations, and outperforms existing methods by improving network performance by 15-20%."
}