{
    "title": "Human Behavior in the Time of COVID-19: Learning from Big Data. (arXiv:2303.13452v1 [cs.CY])",
    "abstract": "Since the World Health Organization (WHO) characterized COVID-19 as a pandemic in March 2020, there have been over 600 million confirmed cases of COVID-19 and more than six million deaths as of October 2022. The relationship between the COVID-19 pandemic and human behavior is complicated. On one hand, human behavior is found to shape the spread of the disease. On the other hand, the pandemic has impacted and even changed human behavior in almost every aspect. To provide a holistic understanding of the complex interplay between human behavior and the COVID-19 pandemic, researchers have been employing big data techniques such as natural language processing, computer vision, audio signal processing, frequent pattern mining, and machine learning. In this study, we present an overview of the existing studies on using big data techniques to study human behavior in the time of the COVID-19 pandemic. In particular, we categorize these studies into three groups - using big data to measure, mode",
    "link": "http://arxiv.org/abs/2303.13452",
    "context": "Title: Human Behavior in the Time of COVID-19: Learning from Big Data. (arXiv:2303.13452v1 [cs.CY])\nAbstract: Since the World Health Organization (WHO) characterized COVID-19 as a pandemic in March 2020, there have been over 600 million confirmed cases of COVID-19 and more than six million deaths as of October 2022. The relationship between the COVID-19 pandemic and human behavior is complicated. On one hand, human behavior is found to shape the spread of the disease. On the other hand, the pandemic has impacted and even changed human behavior in almost every aspect. To provide a holistic understanding of the complex interplay between human behavior and the COVID-19 pandemic, researchers have been employing big data techniques such as natural language processing, computer vision, audio signal processing, frequent pattern mining, and machine learning. In this study, we present an overview of the existing studies on using big data techniques to study human behavior in the time of the COVID-19 pandemic. In particular, we categorize these studies into three groups - using big data to measure, mode",
    "path": "papers/23/03/2303.13452.json",
    "total_tokens": 939,
    "translated_title": "COVID-19背景下的人类行为：从大数据中学习 (arXiv:2303.13452v1 [cs.CY])",
    "translated_abstract": "自2020年3月世界卫生组织(WHO)将COVID-19定性为大流行病以来，截至2022年10月已有超过6亿例COVID-19确诊病例和超过600万例死亡。COVID-19大流行与人类行为之间的关系是复杂的。一方面，人类行为被发现可以塑造疾病的传播，另一方面，疫情影响并甚至改变了几乎每个方面的人类行为。为了提供对人类行为与COVID-19大流行之间复杂相互作用的全面理解，研究人员一直在采用自然语言处理、计算机视觉、音频信号处理、频繁模式挖掘和机器学习等大数据技术。在本研究中，我们总结了使用大数据技术研究COVID-19背景下人类行为的现有研究。特别是，我们将这些研究分为三类——使用大数据测量、模拟和干预人类行为的研究。",
    "tldr": "本研究综述了使用大数据技术研究COVID-19背景下人类行为的现有研究，分为使用大数据测量、模拟和干预人类行为三类研究。",
    "en_tdlr": "This study provides an overview of existing studies on using big data techniques to study human behavior in the time of COVID-19 pandemic, categorizing them into three groups: using big data to measure, model, and intervene human behavior."
}