{
    "title": "Exploring the Relevance of Data Privacy-Enhancing Technologies for AI Governance Use Cases. (arXiv:2303.08956v1 [cs.AI])",
    "abstract": "The development of privacy-enhancing technologies has made immense progress in reducing trade-offs between privacy and performance in data exchange and analysis. Similar tools for structured transparency could be useful for AI governance by offering capabilities such as external scrutiny, auditing, and source verification. It is useful to view these different AI governance objectives as a system of information flows in order to avoid partial solutions and significant gaps in governance, as there may be significant overlap in the software stacks needed for the AI governance use cases mentioned in this text. When viewing the system as a whole, the importance of interoperability between these different AI governance solutions becomes clear. Therefore, it is imminently important to look at these problems in AI governance as a system, before these standards, auditing procedures, software, and norms settle into place.",
    "link": "http://arxiv.org/abs/2303.08956",
    "context": "Title: Exploring the Relevance of Data Privacy-Enhancing Technologies for AI Governance Use Cases. (arXiv:2303.08956v1 [cs.AI])\nAbstract: The development of privacy-enhancing technologies has made immense progress in reducing trade-offs between privacy and performance in data exchange and analysis. Similar tools for structured transparency could be useful for AI governance by offering capabilities such as external scrutiny, auditing, and source verification. It is useful to view these different AI governance objectives as a system of information flows in order to avoid partial solutions and significant gaps in governance, as there may be significant overlap in the software stacks needed for the AI governance use cases mentioned in this text. When viewing the system as a whole, the importance of interoperability between these different AI governance solutions becomes clear. Therefore, it is imminently important to look at these problems in AI governance as a system, before these standards, auditing procedures, software, and norms settle into place.",
    "path": "papers/23/03/2303.08956.json",
    "total_tokens": 806,
    "translated_title": "探究数据隐私增强技术在AI治理应用中的相关性",
    "translated_abstract": "随着隐私增强技术的发展，数据交换和分析中隐私与性能之间的权衡已经得到了极大的改善。类似的透明度结构工具对于AI治理也很有用，因为它们可以提供外部审查、审计和源验证等能力。为了避免治理上的重大漏洞和局限性，需要将这些不同的AI治理目标视为信息流系统。由于在本文提到的AI治理用例所需的软件栈中可能存在重叠，因此在整体上看待系统，了解这些不同的AI治理解决方案之间的互操作性变得很重要。因此，在这些标准、审计程序、软件和规范定型之前，首先紧急需要将AI治理中的这些问题作为系统来研究和解决。",
    "tldr": "探究数据隐私增强技术对AI治理的重要性，将不同的AI治理目标视为系统信息流，强调解决方案之间的互操作性。",
    "en_tdlr": "This paper explores the relevance of data privacy-enhancing technologies for AI governance, emphasizes the importance of viewing different AI governance objectives as a system of information flows, and advocates for interoperability between different solutions in order to avoid significant gaps in governance."
}