{
    "title": "Composite Optimization Algorithms for Sigmoid Networks. (arXiv:2303.00589v2 [math.OC] UPDATED)",
    "abstract": "In this paper, we use composite optimization algorithms to solve sigmoid networks. We equivalently transfer the sigmoid networks to a convex composite optimization and propose the composite optimization algorithms based on the linearized proximal algorithms and the alternating direction method of multipliers. Under the assumptions of the weak sharp minima and the regularity condition, the algorithm is guaranteed to converge to a globally optimal solution of the objective function even in the case of non-convex and non-smooth problems. Furthermore, the convergence results can be directly related to the amount of training data and provide a general guide for setting the size of sigmoid networks. Numerical experiments on Franke's function fitting and handwritten digit recognition show that the proposed algorithms perform satisfactorily and robustly.",
    "link": "http://arxiv.org/abs/2303.00589",
    "context": "Title: Composite Optimization Algorithms for Sigmoid Networks. (arXiv:2303.00589v2 [math.OC] UPDATED)\nAbstract: In this paper, we use composite optimization algorithms to solve sigmoid networks. We equivalently transfer the sigmoid networks to a convex composite optimization and propose the composite optimization algorithms based on the linearized proximal algorithms and the alternating direction method of multipliers. Under the assumptions of the weak sharp minima and the regularity condition, the algorithm is guaranteed to converge to a globally optimal solution of the objective function even in the case of non-convex and non-smooth problems. Furthermore, the convergence results can be directly related to the amount of training data and provide a general guide for setting the size of sigmoid networks. Numerical experiments on Franke's function fitting and handwritten digit recognition show that the proposed algorithms perform satisfactorily and robustly.",
    "path": "papers/23/03/2303.00589.json",
    "total_tokens": 756,
    "translated_title": "基于复合优化算法的Sigmoid网络求解方法",
    "translated_abstract": "本文使用复合优化算法求解Sigmoid网络问题，将Sigmoid网络转化为一个凸复合优化问题，并提出了基于线性化近端算法和交替方向乘子法的复合优化算法。在假设具有弱锐最小值和正则条件的情况下，该算法可以在非凸和非光滑问题的情况下收敛到目标函数的全局最优解。此外，收敛结果可以直接与训练数据量相关联，为设置Sigmoid网络的大小提供一般指导。在Franke函数拟合和手写数字识别方面的数值实验表明，所提出的算法表现良好且稳健。",
    "tldr": "本文使用复合优化算法解决Sigmoid网络问题，可以在非凸和非光滑问题的情况下收敛到全局最优解，并提供了一般指导来设置网络大小。",
    "en_tdlr": "This paper proposes composite optimization algorithms to solve sigmoid network problems, which can converge to a globally optimal solution even with non-convex and non-smooth problems. The convergence results are related to the amount of training data and provide a guide for setting the network size. The proposed algorithms perform well and robustly in numerical experiments on Franke's function fitting and handwritten digit recognition."
}