{
    "title": "Data-Centric Learning from Unlabeled Graphs with Diffusion Model. (arXiv:2303.10108v1 [cs.LG])",
    "abstract": "Graph property prediction tasks are important and numerous. While each task offers a small size of labeled examples, unlabeled graphs have been collected from various sources and at a large scale. A conventional approach is training a model with the unlabeled graphs on self-supervised tasks and then fine-tuning the model on the prediction tasks. However, the self-supervised task knowledge could not be aligned or sometimes conflicted with what the predictions needed. In this paper, we propose to extract the knowledge underlying the large set of unlabeled graphs as a specific set of useful data points to augment each property prediction model. We use a diffusion model to fully utilize the unlabeled graphs and design two new objectives to guide the model's denoising process with each task's labeled data to generate task-specific graph examples and their labels. Experiments demonstrate that our data-centric approach performs significantly better than fourteen existing various methods on fi",
    "link": "http://arxiv.org/abs/2303.10108",
    "context": "Title: Data-Centric Learning from Unlabeled Graphs with Diffusion Model. (arXiv:2303.10108v1 [cs.LG])\nAbstract: Graph property prediction tasks are important and numerous. While each task offers a small size of labeled examples, unlabeled graphs have been collected from various sources and at a large scale. A conventional approach is training a model with the unlabeled graphs on self-supervised tasks and then fine-tuning the model on the prediction tasks. However, the self-supervised task knowledge could not be aligned or sometimes conflicted with what the predictions needed. In this paper, we propose to extract the knowledge underlying the large set of unlabeled graphs as a specific set of useful data points to augment each property prediction model. We use a diffusion model to fully utilize the unlabeled graphs and design two new objectives to guide the model's denoising process with each task's labeled data to generate task-specific graph examples and their labels. Experiments demonstrate that our data-centric approach performs significantly better than fourteen existing various methods on fi",
    "path": "papers/23/03/2303.10108.json",
    "total_tokens": 840,
    "translated_title": "基于扩散模型的无标签图数据中心学习",
    "translated_abstract": "图属性预测任务非常重要和众多。虽然每个任务只提供少量的标记示例，但无标签图已从各种渠道并大规模收集。传统方法是在自监督任务的无标签图上训练模型，然后在预测任务上微调模型。然而，自监督任务的知识可能无法与预测任务需要的知识相吻合或有时会产生冲突。本文提出了一种从大量无标签图中提取知识作为特定有用数据点的方法，以增强每个属性预测模型。我们使用扩散模型充分利用无标签图，并设计了两个新的目标来指导模型的去噪过程，使用每个任务的标记数据生成任务特定图形示例及其标签。实验证明，我们的数据中心方法比14种现有方法在fi上表现显着优异。",
    "tldr": "本文提出了一种从无标签图中提取知识并增强属性预测模型的数据中心方法，使用扩散模型和两个新目标进行去噪，实验证明其效果比14种现有方法更好。",
    "en_tdlr": "This paper proposes a data-centric approach to extract knowledge from unlabeled graphs and enhance property prediction models using a diffusion model and two new objectives for denoising, which outperforms 14 existing methods according to the experiments."
}