{
    "title": "Mobile Edge Adversarial Detection for Digital Twinning to the Metaverse with Deep Reinforcement Learning. (arXiv:2303.10288v1 [cs.NI])",
    "abstract": "Real-time Digital Twinning of physical world scenes onto the Metaverse is necessary for a myriad of applications such as augmented-reality (AR) assisted driving. In AR assisted driving, physical environment scenes are first captured by Internet of Vehicles (IoVs) and are uploaded to the Metaverse. A central Metaverse Map Service Provider (MMSP) will aggregate information from all IoVs to develop a central Metaverse Map. Information from the Metaverse Map can then be downloaded into individual IoVs on demand and be delivered as AR scenes to the driver. However, the growing interest in developing AR assisted driving applications which relies on digital twinning invites adversaries. These adversaries may place physical adversarial patches on physical world objects such as cars, signboards, or on roads, seeking to contort the virtual world digital twin. Hence, there is a need to detect these physical world adversarial patches. Nevertheless, as real-time, accurate detection of adversarial p",
    "link": "http://arxiv.org/abs/2303.10288",
    "context": "Title: Mobile Edge Adversarial Detection for Digital Twinning to the Metaverse with Deep Reinforcement Learning. (arXiv:2303.10288v1 [cs.NI])\nAbstract: Real-time Digital Twinning of physical world scenes onto the Metaverse is necessary for a myriad of applications such as augmented-reality (AR) assisted driving. In AR assisted driving, physical environment scenes are first captured by Internet of Vehicles (IoVs) and are uploaded to the Metaverse. A central Metaverse Map Service Provider (MMSP) will aggregate information from all IoVs to develop a central Metaverse Map. Information from the Metaverse Map can then be downloaded into individual IoVs on demand and be delivered as AR scenes to the driver. However, the growing interest in developing AR assisted driving applications which relies on digital twinning invites adversaries. These adversaries may place physical adversarial patches on physical world objects such as cars, signboards, or on roads, seeking to contort the virtual world digital twin. Hence, there is a need to detect these physical world adversarial patches. Nevertheless, as real-time, accurate detection of adversarial p",
    "path": "papers/23/03/2303.10288.json",
    "total_tokens": 1009,
    "translated_title": "移动边缘对抗检测用于深度强化学习数字双生技术到虚拟现实的应用",
    "translated_abstract": "实时数字双生技术的应用必须将现实世界场景快速映射到虚拟现实（也称为Metaverse），以进行增强现实辅助驾驶等应用。然而，由于数字双生技术应用的增长，可能会受到攻击者的干扰，这些攻击者可能会在物理世界中的物体上（例如汽车、路标或道路上）放置对抗性的贴片，从而扭曲虚拟世界中的数字双生体。因此，本文提出了一种新的移动边缘对抗检测（MEAD）框架，通过使用深度强化学习在网络边缘检测对抗性贴片，降低了中央Metaverse Map Service Provider（MMSP）的资源负担。我们还在现实世界的物理环境中评估了MEAD检测对抗性贴片的有效性，并显示其优于现有方法。",
    "tldr": "本文提出了一种新的移动边缘对抗检测（MEAD）框架，可以准确地检测出在物理世界物体上的对抗性贴片，从而在数字双生技术应用的虚拟世界中确保安全性。",
    "en_tdlr": "This paper proposes a novel Mobile Edge Adversarial Detection (MEAD) framework that accurately detects adversarial patches on physical world objects, ensuring security in the virtual world of digital twinning applications."
}