{
    "title": "Randomly Projected Convex Clustering Model: Motivation, Realization, and Cluster Recovery Guarantees. (arXiv:2303.16841v1 [cs.LG])",
    "abstract": "In this paper, we propose a randomly projected convex clustering model for clustering a collection of $n$ high dimensional data points in $\\mathbb{R}^d$ with $K$ hidden clusters. Compared to the convex clustering model for clustering original data with dimension $d$, we prove that, under some mild conditions, the perfect recovery of the cluster membership assignments of the convex clustering model, if exists, can be preserved by the randomly projected convex clustering model with embedding dimension $m = O(\\epsilon^{-2}\\log(n))$, where $0 < \\epsilon < 1$ is some given parameter. We further prove that the embedding dimension can be improved to be $O(\\epsilon^{-2}\\log(K))$, which is independent of the number of data points. Extensive numerical experiment results will be presented in this paper to demonstrate the robustness and superior performance of the randomly projected convex clustering model. The numerical results presented in this paper also demonstrate that the randomly projected ",
    "link": "http://arxiv.org/abs/2303.16841",
    "context": "Title: Randomly Projected Convex Clustering Model: Motivation, Realization, and Cluster Recovery Guarantees. (arXiv:2303.16841v1 [cs.LG])\nAbstract: In this paper, we propose a randomly projected convex clustering model for clustering a collection of $n$ high dimensional data points in $\\mathbb{R}^d$ with $K$ hidden clusters. Compared to the convex clustering model for clustering original data with dimension $d$, we prove that, under some mild conditions, the perfect recovery of the cluster membership assignments of the convex clustering model, if exists, can be preserved by the randomly projected convex clustering model with embedding dimension $m = O(\\epsilon^{-2}\\log(n))$, where $0 < \\epsilon < 1$ is some given parameter. We further prove that the embedding dimension can be improved to be $O(\\epsilon^{-2}\\log(K))$, which is independent of the number of data points. Extensive numerical experiment results will be presented in this paper to demonstrate the robustness and superior performance of the randomly projected convex clustering model. The numerical results presented in this paper also demonstrate that the randomly projected ",
    "path": "papers/23/03/2303.16841.json",
    "total_tokens": 956,
    "translated_title": "随机投影的凸聚类模型：动机，实现和簇恢复保证",
    "translated_abstract": "本文提出了一种随机投影凸聚类模型，用于对$\\mathbb{R}^d$中的$n$个高维数据点进行聚类，并假设这些点存在$K$个隐藏的簇。与用于聚类原始数据的凸聚类模型相比($d$维)，我们证明，在某些温和的条件下，如果存在凸聚类模型的完美拆分，那么通过嵌入维度$m=O(\\epsilon^{-2}\\log(n))$的随机投影凸聚类模型可以保留拆分结果，其中$0 < \\epsilon < 1$是一些给定的参数。我们进一步证明，嵌入维度可以改进为$O(\\epsilon^{-2}\\log(K))$，不受数据点数量的影响。本文还通过广泛的数字实验结果展示了随机投影凸聚类模型的鲁棒性和卓越性能。本文中呈现的数字实验结果还表明，随机投影凸聚类模型在聚类精度和可伸缩性方面优于许多最先进的聚类算法。",
    "tldr": "本文提出了一种随机投影凸聚类模型，具有簇恢复保证和良好的鲁棒性，在聚类精度和可伸缩性方面优于许多最先进的聚类算法。",
    "en_tdlr": "This paper proposes a randomly projected convex clustering model with cluster recovery guarantees and good robustness, which outperforms many state-of-the-art clustering algorithms in terms of clustering accuracy and scalability."
}