{
    "title": "Decision-Oriented Learning with Differentiable Submodular Maximization for Vehicle Routing Problem. (arXiv:2303.01543v2 [cs.RO] UPDATED)",
    "abstract": "We study the problem of learning a function that maps context observations (input) to parameters of a submodular function (output). Our motivating case study is a specific type of vehicle routing problem, in which a team of Unmanned Ground Vehicles (UGVs) can serve as mobile charging stations to recharge a team of Unmanned Ground Vehicles (UAVs) that execute persistent monitoring tasks. {We want to learn the mapping from observations of UAV task routes and wind field to the parameters of a submodular objective function, which describes the distribution of landing positions of the UAVs .} Traditionally, such a learning problem is solved independently as a prediction phase without considering the downstream task optimization phase. However, the loss function used in prediction may be misaligned with our final goal, i.e., a good routing decision. Good performance in the isolated prediction phase does not necessarily lead to good decisions in the downstream routing task. In this paper, we ",
    "link": "http://arxiv.org/abs/2303.01543",
    "context": "Title: Decision-Oriented Learning with Differentiable Submodular Maximization for Vehicle Routing Problem. (arXiv:2303.01543v2 [cs.RO] UPDATED)\nAbstract: We study the problem of learning a function that maps context observations (input) to parameters of a submodular function (output). Our motivating case study is a specific type of vehicle routing problem, in which a team of Unmanned Ground Vehicles (UGVs) can serve as mobile charging stations to recharge a team of Unmanned Ground Vehicles (UAVs) that execute persistent monitoring tasks. {We want to learn the mapping from observations of UAV task routes and wind field to the parameters of a submodular objective function, which describes the distribution of landing positions of the UAVs .} Traditionally, such a learning problem is solved independently as a prediction phase without considering the downstream task optimization phase. However, the loss function used in prediction may be misaligned with our final goal, i.e., a good routing decision. Good performance in the isolated prediction phase does not necessarily lead to good decisions in the downstream routing task. In this paper, we ",
    "path": "papers/23/03/2303.01543.json",
    "total_tokens": 941,
    "translated_title": "面向决策的可微子模最大化学习在车辆路径问题中的应用",
    "translated_abstract": "本文研究了学习一个将上下文观察（输入）映射到子模函数参数（输出）的函数的问题。我们的案例研究是一种特定类型的车辆路径问题，其中一组无人地面车辆（UGV）可以作为移动充电站为执行持续监测任务的无人机地面车辆（UAV）充电。我们希望学习从UAV任务路径和风场观察到子模目标函数参数的映射，该函数描述了UAV的降落位置分布。传统上，这类学习问题独立解决预测阶段，而不考虑下游任务优化阶段。然而，预测中使用的损失函数可能与我们的最终目标，即良好航线决策，不一致。在孤立的预测阶段表现良好并不一定会导致下游路径任务中的良好决策。",
    "tldr": "本文研究了面向车辆路径问题的决策导向学习方法，该方法利用可微子模最大化学习函数，将上下文观察映射到子模函数参数。该研究强调了在考虑下游任务优化的情况下，传统的独立解决预测阶段的学习问题可能导致与最终目标不一致的结果。"
}