{
    "title": "Inexact iterative numerical linear algebra for neural network-based spectral estimation and rare-event prediction. (arXiv:2303.12534v1 [physics.comp-ph])",
    "abstract": "Understanding dynamics in complex systems is challenging because there are many degrees of freedom, and those that are most important for describing events of interest are often not obvious. The leading eigenfunctions of the transition operator are useful for visualization, and they can provide an efficient basis for computing statistics such as the likelihood and average time of events (predictions). Here we develop inexact iterative linear algebra methods for computing these eigenfunctions (spectral estimation) and making predictions from a data set of short trajectories sampled at finite intervals. We demonstrate the methods on a low-dimensional model that facilitates visualization and a high-dimensional model of a biomolecular system. Implications for the prediction problem in reinforcement learning are discussed.",
    "link": "http://arxiv.org/abs/2303.12534",
    "context": "Title: Inexact iterative numerical linear algebra for neural network-based spectral estimation and rare-event prediction. (arXiv:2303.12534v1 [physics.comp-ph])\nAbstract: Understanding dynamics in complex systems is challenging because there are many degrees of freedom, and those that are most important for describing events of interest are often not obvious. The leading eigenfunctions of the transition operator are useful for visualization, and they can provide an efficient basis for computing statistics such as the likelihood and average time of events (predictions). Here we develop inexact iterative linear algebra methods for computing these eigenfunctions (spectral estimation) and making predictions from a data set of short trajectories sampled at finite intervals. We demonstrate the methods on a low-dimensional model that facilitates visualization and a high-dimensional model of a biomolecular system. Implications for the prediction problem in reinforcement learning are discussed.",
    "path": "papers/23/03/2303.12534.json",
    "total_tokens": 817,
    "translated_title": "不精确的迭代数值线性代数用于基于神经网络的谱估计和稀有事件预测",
    "translated_abstract": "由于复杂系统存在大量自由度，其中最重要的度量通常并不明显，因此理解其动态是具有挑战性的。转移算符的主要特征函数对于可视化很有用，它们可以为计算统计量（例如事件的可能性和平均时间）提供高效的基础（预测）。在本文中，我们开发了不精确的迭代线性代数方法来计算这些特征函数（谱估计）并从短轨迹数据集上进行预测。我们在便于可视化的低维模型和生物分子系统的高维模型上演示了该方法。我们还讨论了这些方法对强化学习中的预测问题的影响。",
    "tldr": "本文开发了一种不精确的迭代线性代数方法，用于基于神经网络的谱估计和从短轨迹数据集中进行稀有事件的预测，这对于理解复杂系统的动态是具有挑战性的，并讨论了该方法对强化学习中的预测问题的影响。",
    "en_tdlr": "This paper develops inexact iterative linear algebra methods for spectral estimation and rare-event prediction from a data set of short trajectories sampled at finite intervals based on neural networks. The method is demonstrated on low-dimensional and high-dimensional models and discussed in the context of prediction problems in reinforcement learning."
}