{
    "title": "Improving Adversarial Robustness with Hypersphere Embedding and Angular-based Regularizations. (arXiv:2303.08289v1 [cs.LG])",
    "abstract": "Adversarial training (AT) methods have been found to be effective against adversarial attacks on deep neural networks. Many variants of AT have been proposed to improve its performance. Pang et al. [1] have recently shown that incorporating hypersphere embedding (HE) into the existing AT procedures enhances robustness. We observe that the existing AT procedures are not designed for the HE framework, and thus fail to adequately learn the angular discriminative information available in the HE framework. In this paper, we propose integrating HE into AT with regularization terms that exploit the rich angular information available in the HE framework. Specifically, our method, termed angular-AT, adds regularization terms to AT that explicitly enforce weight-feature compactness and inter-class separation; all expressed in terms of angular features. Experimental results show that angular-AT further improves adversarial robustness.",
    "link": "http://arxiv.org/abs/2303.08289",
    "context": "Title: Improving Adversarial Robustness with Hypersphere Embedding and Angular-based Regularizations. (arXiv:2303.08289v1 [cs.LG])\nAbstract: Adversarial training (AT) methods have been found to be effective against adversarial attacks on deep neural networks. Many variants of AT have been proposed to improve its performance. Pang et al. [1] have recently shown that incorporating hypersphere embedding (HE) into the existing AT procedures enhances robustness. We observe that the existing AT procedures are not designed for the HE framework, and thus fail to adequately learn the angular discriminative information available in the HE framework. In this paper, we propose integrating HE into AT with regularization terms that exploit the rich angular information available in the HE framework. Specifically, our method, termed angular-AT, adds regularization terms to AT that explicitly enforce weight-feature compactness and inter-class separation; all expressed in terms of angular features. Experimental results show that angular-AT further improves adversarial robustness.",
    "path": "papers/23/03/2303.08289.json",
    "total_tokens": 840,
    "translated_title": "通过超球嵌入和基于角度的正则化提高对抗鲁棒性",
    "translated_abstract": "对抗训练（AT）方法已被证明对深度神经网络的对抗攻击具有一定效果。已经提出了许多AT的变体来改善其性能。 Pang等人最近表明，将超球嵌入（HE）纳入现有的AT过程中可以提高对抗性。我们观察到现有的AT过程并不是为HE框架设计的，因此未能充分学习HE框架中的角度判别信息。在本文中，我们提出将HE与利用HE框架中的丰富角度信息的正则化项目相结合，将其集成到AT中。具体而言，我们提出的方法称为角度AT，将正则化项目添加到AT中，并通过角度特征明确强制权重特征紧凑性和类间分隔。实验结果表明，角度AT进一步提高了对抗鲁棒性。",
    "tldr": "本文提出了一种新的对抗训练方法，角度-AT，结合超球嵌入和基于角度的正则化技术以提高深度神经网络的对抗鲁棒性能。",
    "en_tdlr": "This paper proposes a new method, angular-AT, which integrates hypersphere embedding and angular-based regularization techniques into the adversarial training (AT) framework to improve the adversarial robustness of deep neural networks."
}