{
    "title": "Predicting discrete-time bifurcations with deep learning. (arXiv:2303.09669v1 [q-bio.QM])",
    "abstract": "Many natural and man-made systems are prone to critical transitions -- abrupt and potentially devastating changes in dynamics. Deep learning classifiers can provide an early warning signal (EWS) for critical transitions by learning generic features of bifurcations (dynamical instabilities) from large simulated training data sets. So far, classifiers have only been trained to predict continuous-time bifurcations, ignoring rich dynamics unique to discrete-time bifurcations. Here, we train a deep learning classifier to provide an EWS for the five local discrete-time bifurcations of codimension-1. We test the classifier on simulation data from discrete-time models used in physiology, economics and ecology, as well as experimental data of spontaneously beating chick-heart aggregates that undergo a period-doubling bifurcation. The classifier outperforms commonly used EWS under a wide range of noise intensities and rates of approach to the bifurcation. It also predicts the correct bifurcation",
    "link": "http://arxiv.org/abs/2303.09669",
    "context": "Title: Predicting discrete-time bifurcations with deep learning. (arXiv:2303.09669v1 [q-bio.QM])\nAbstract: Many natural and man-made systems are prone to critical transitions -- abrupt and potentially devastating changes in dynamics. Deep learning classifiers can provide an early warning signal (EWS) for critical transitions by learning generic features of bifurcations (dynamical instabilities) from large simulated training data sets. So far, classifiers have only been trained to predict continuous-time bifurcations, ignoring rich dynamics unique to discrete-time bifurcations. Here, we train a deep learning classifier to provide an EWS for the five local discrete-time bifurcations of codimension-1. We test the classifier on simulation data from discrete-time models used in physiology, economics and ecology, as well as experimental data of spontaneously beating chick-heart aggregates that undergo a period-doubling bifurcation. The classifier outperforms commonly used EWS under a wide range of noise intensities and rates of approach to the bifurcation. It also predicts the correct bifurcation",
    "path": "papers/23/03/2303.09669.json",
    "total_tokens": 917,
    "translated_title": "利用深度学习预测离散时间分歧",
    "translated_abstract": "许多自然和人造系统容易发生关键转变-动力学的突然和潜在的破坏性变化。深度学习分类器通过从大规模模拟训练数据集中学习分岔（动力学不稳定性）的通用特征，为关键转变提供提前警告信号（EWS）。到目前为止，分类器只被训练用于预测连续时间分歧，而忽略了离散时间分歧独特的丰富动态特征。本文使用深度学习分类器训练提供 EWS 的五种离散时间、共维度1的本地分岔。我们在生理学、经济学和生态学中使用的离散时间模型的模拟数据以及经历了倍增分岔的鸡心聚集的实验数据进行测试。在广泛的噪声强度和接近分岔的速率范围内，分类器优于常用的 EWS。它也能够正确预测分岔。",
    "tldr": "本研究利用深度学习训练分类器预测离散时间五种本地分岔，在经济、生态、生理学等方面的试验数据中都具有优秀表现，是提前警告关键转变的重要方法。",
    "en_tdlr": "This study trains a deep learning classifier to predict the five local discrete-time bifurcations, and evaluates the classifier's performance on simulation and experimental data, proving to be a promising method for early warning of critical transitions in various fields such as physiology, economics and ecology."
}