{
    "title": "Visually Wired NFTs: Exploring the Role of Inspiration in Non-Fungible Tokens. (arXiv:2303.17031v1 [cs.SI])",
    "abstract": "The fervor for Non-Fungible Tokens (NFTs) attracted countless creators, leading to a Big Bang of digital assets driven by latent or explicit forms of inspiration, as in many creative processes. This work exploits Vision Transformers and graph-based modeling to delve into visual inspiration phenomena between NFTs over the years. Our goals include unveiling the main structural traits that shape visual inspiration networks, exploring the interrelation between visual inspiration and asset performances, investigating crypto influence on inspiration processes, and explaining the inspiration relationships among NFTs. Our findings unveil how the pervasiveness of inspiration led to a temporary saturation of the visual feature space, the impact of the dichotomy between inspiring and inspired NFTs on their financial performance, and an intrinsic self-regulatory mechanism between markets and inspiration waves. Our work can serve as a starting point for gaining a broader view of the evolution of We",
    "link": "http://arxiv.org/abs/2303.17031",
    "context": "Title: Visually Wired NFTs: Exploring the Role of Inspiration in Non-Fungible Tokens. (arXiv:2303.17031v1 [cs.SI])\nAbstract: The fervor for Non-Fungible Tokens (NFTs) attracted countless creators, leading to a Big Bang of digital assets driven by latent or explicit forms of inspiration, as in many creative processes. This work exploits Vision Transformers and graph-based modeling to delve into visual inspiration phenomena between NFTs over the years. Our goals include unveiling the main structural traits that shape visual inspiration networks, exploring the interrelation between visual inspiration and asset performances, investigating crypto influence on inspiration processes, and explaining the inspiration relationships among NFTs. Our findings unveil how the pervasiveness of inspiration led to a temporary saturation of the visual feature space, the impact of the dichotomy between inspiring and inspired NFTs on their financial performance, and an intrinsic self-regulatory mechanism between markets and inspiration waves. Our work can serve as a starting point for gaining a broader view of the evolution of We",
    "path": "papers/23/03/2303.17031.json",
    "total_tokens": 964,
    "tldr": "本文利用视觉变压器和基于图形的建模对 NFT 之间的视觉灵感现象进行实验。研究结果表明，灵感的普及导致了视觉特征空间的暂时饱和，并对 NFT 的财务表现产生了影响。",
    "en_tdlr": "This paper explores the visual inspiration phenomena between NFTs over the years using Vision Transformers and graph-based modeling, revealing how the pervasiveness of inspiration led to a temporary saturation of the visual feature space and affected the financial performance of NFTs."
}