{
    "title": "Towards Cooperative Federated Learning over Heterogeneous Edge/Fog Networks. (arXiv:2303.08361v1 [cs.DC])",
    "abstract": "Federated learning (FL) has been promoted as a popular technique for training machine learning (ML) models over edge/fog networks. Traditional implementations of FL have largely neglected the potential for inter-network cooperation, treating edge/fog devices and other infrastructure participating in ML as separate processing elements. Consequently, FL has been vulnerable to several dimensions of network heterogeneity, such as varying computation capabilities, communication resources, data qualities, and privacy demands. We advocate for cooperative federated learning (CFL), a cooperative edge/fog ML paradigm built on device-to-device (D2D) and device-to-server (D2S) interactions. Through D2D and D2S cooperation, CFL counteracts network heterogeneity in edge/fog networks through enabling a model/data/resource pooling mechanism, which will yield substantial improvements in ML model training quality and network resource consumption. We propose a set of core methodologies that form the foun",
    "link": "http://arxiv.org/abs/2303.08361",
    "context": "Title: Towards Cooperative Federated Learning over Heterogeneous Edge/Fog Networks. (arXiv:2303.08361v1 [cs.DC])\nAbstract: Federated learning (FL) has been promoted as a popular technique for training machine learning (ML) models over edge/fog networks. Traditional implementations of FL have largely neglected the potential for inter-network cooperation, treating edge/fog devices and other infrastructure participating in ML as separate processing elements. Consequently, FL has been vulnerable to several dimensions of network heterogeneity, such as varying computation capabilities, communication resources, data qualities, and privacy demands. We advocate for cooperative federated learning (CFL), a cooperative edge/fog ML paradigm built on device-to-device (D2D) and device-to-server (D2S) interactions. Through D2D and D2S cooperation, CFL counteracts network heterogeneity in edge/fog networks through enabling a model/data/resource pooling mechanism, which will yield substantial improvements in ML model training quality and network resource consumption. We propose a set of core methodologies that form the foun",
    "path": "papers/23/03/2303.08361.json",
    "total_tokens": 902,
    "translated_title": "面向异构边缘/雾计算网络的合作式联邦学习",
    "translated_abstract": "联邦学习是一种在边缘/雾计算网络上训练机器学习模型的流行技术。然而，传统的联邦学习实现忽略了网络之间的潜在合作，将参与机器学习的边缘/雾设备和其他基础设施视为独立的处理单元。因此，联邦学习容易受到网络异构性的影响，如计算能力、通信资源、数据质量和隐私需求的差异。我们提出了一种合作式联邦学习(CFL)范式，建立在设备对设备(D2D)和设备对服务器(D2S)交互之上。通过D2D和D2S合作，CFL通过启用模型/数据/资源汇集机制来抵消边缘/雾网络中的异构性，从而显著提高机器学习模型训练质量和网络资源利用率。我们提出了一组核心方法，构成了CFL的基础。",
    "tldr": "提出了一种合作式联邦学习(CFL)范式，通过设备间的合作来抵消边缘/雾网络中的异构性，从而提高机器学习模型训练质量和网络资源利用率。",
    "en_tdlr": "Proposed a cooperative federated learning (CFL) paradigm to counteract network heterogeneity in edge/fog networks through enabling device-to-device (D2D) and device-to-server (D2S) cooperation, yielding substantial improvements in machine learning model training quality and network resource consumption."
}