{
    "title": "Ref-NeuS: Ambiguity-Reduced Neural Implicit Surface Learning for Multi-View Reconstruction with Reflection. (arXiv:2303.10840v2 [cs.CV] UPDATED)",
    "abstract": "Neural implicit surface learning has shown significant progress in multi-view 3D reconstruction, where an object is represented by multilayer perceptrons that provide continuous implicit surface representation and view-dependent radiance. However, current methods often fail to accurately reconstruct reflective surfaces, leading to severe ambiguity. To overcome this issue, we propose Ref-NeuS, which aims to reduce ambiguity by attenuating the effect of reflective surfaces. Specifically, we utilize an anomaly detector to estimate an explicit reflection score with the guidance of multi-view context to localize reflective surfaces. Afterward, we design a reflection-aware photometric loss that adaptively reduces ambiguity by modeling rendered color as a Gaussian distribution, with the reflection score representing the variance. We show that together with a reflection direction-dependent radiance, our model achieves high-quality surface reconstruction on reflective surfaces and outperforms t",
    "link": "http://arxiv.org/abs/2303.10840",
    "context": "Title: Ref-NeuS: Ambiguity-Reduced Neural Implicit Surface Learning for Multi-View Reconstruction with Reflection. (arXiv:2303.10840v2 [cs.CV] UPDATED)\nAbstract: Neural implicit surface learning has shown significant progress in multi-view 3D reconstruction, where an object is represented by multilayer perceptrons that provide continuous implicit surface representation and view-dependent radiance. However, current methods often fail to accurately reconstruct reflective surfaces, leading to severe ambiguity. To overcome this issue, we propose Ref-NeuS, which aims to reduce ambiguity by attenuating the effect of reflective surfaces. Specifically, we utilize an anomaly detector to estimate an explicit reflection score with the guidance of multi-view context to localize reflective surfaces. Afterward, we design a reflection-aware photometric loss that adaptively reduces ambiguity by modeling rendered color as a Gaussian distribution, with the reflection score representing the variance. We show that together with a reflection direction-dependent radiance, our model achieves high-quality surface reconstruction on reflective surfaces and outperforms t",
    "path": "papers/23/03/2303.10840.json",
    "total_tokens": 856,
    "translated_title": "Ref-NeuS: 减少歧义的神经隐式表面学习，用于带有反射的多视角重建",
    "translated_abstract": "神经隐式表面学习在多视角3D重建中取得了显著进展，其中对象通过多层感知器表示，提供连续的隐式表面表示和视角相关辐射。然而，当前的方法常常无法准确重建反射表面，导致严重的歧义。为了克服这个问题，我们提出了Ref-NeuS，旨在通过削弱反射表面的影响来减少歧义。具体来说，我们利用异常检测器来估计一个显式的反射分数，并在多视角上下文的指导下定位反射表面。然后，我们设计了一个反射感知的光度损失，通过将渲染的颜色建模为高斯分布来自适应地减少歧义，其中反射分数代表方差。我们证明，结合反射方向相关的辐射，我们的模型能够在反射表面上实现高质量的表面重建，并超过了其他方法。",
    "tldr": "Ref-NeuS通过减少反射表面的影响以降低歧义，在多视角3D重建中取得了显著的进展。",
    "en_tdlr": "Ref-NeuS achieves significant progress in multi-view 3D reconstruction by reducing ambiguity through attenuating the effect of reflective surfaces."
}