{
    "title": "Complementary Pseudo Multimodal Feature for Point Cloud Anomaly Detection. (arXiv:2303.13194v1 [cs.CV])",
    "abstract": "Point cloud (PCD) anomaly detection steadily emerges as a promising research area. This study aims to improve PCD anomaly detection performance by combining handcrafted PCD descriptions with powerful pre-trained 2D neural networks. To this end, this study proposes Complementary Pseudo Multimodal Feature (CPMF) that incorporates local geometrical information in 3D modality using handcrafted PCD descriptors and global semantic information in the generated pseudo 2D modality using pre-trained 2D neural networks. For global semantics extraction, CPMF projects the origin PCD into a pseudo 2D modality containing multi-view images. These images are delivered to pre-trained 2D neural networks for informative 2D modality feature extraction. The 3D and 2D modality features are aggregated to obtain the CPMF for PCD anomaly detection. Extensive experiments demonstrate the complementary capacity between 2D and 3D modality features and the effectiveness of CPMF, with 95.15% image-level AU-ROC and 92",
    "link": "http://arxiv.org/abs/2303.13194",
    "context": "Title: Complementary Pseudo Multimodal Feature for Point Cloud Anomaly Detection. (arXiv:2303.13194v1 [cs.CV])\nAbstract: Point cloud (PCD) anomaly detection steadily emerges as a promising research area. This study aims to improve PCD anomaly detection performance by combining handcrafted PCD descriptions with powerful pre-trained 2D neural networks. To this end, this study proposes Complementary Pseudo Multimodal Feature (CPMF) that incorporates local geometrical information in 3D modality using handcrafted PCD descriptors and global semantic information in the generated pseudo 2D modality using pre-trained 2D neural networks. For global semantics extraction, CPMF projects the origin PCD into a pseudo 2D modality containing multi-view images. These images are delivered to pre-trained 2D neural networks for informative 2D modality feature extraction. The 3D and 2D modality features are aggregated to obtain the CPMF for PCD anomaly detection. Extensive experiments demonstrate the complementary capacity between 2D and 3D modality features and the effectiveness of CPMF, with 95.15% image-level AU-ROC and 92",
    "path": "papers/23/03/2303.13194.json",
    "total_tokens": 966,
    "translated_title": "基于伪多模特征的点云异常检测方法",
    "translated_abstract": "点云异常检测作为一种新兴的研究领域不断出现。本研究旨在通过将手工制作的点云描述符与强大的预训练2D神经网络相结合来提高点云异常检测性能。为此，本研究提出了一种基于伪多模特征 (CPMF) 的方法，该方法利用手工制作的点云描述符将局部几何信息纳入3D模态中，并利用预训练的2D神经网络在生成的伪2D模态中提取全局语义信息。对于全局语义提取，CPMF将原始点云投影到包含多视图图像的伪2D模态中。这些图像被传递给预训练的2D神经网络以提取信息丰富的2D模态特征。3D和2D模态特征被聚合以获得用于点云异常检测的CPMF。广泛的实验证明了2D和3D模态特征之间的互补能力以及CPMF的有效性，在基准数据集上达到了95.15%的图像级AU-ROC和92.67%的点级AU-ROC。",
    "tldr": "本研究提出了一种基于伪多模特征的点云异常检测方法，聚合了局部几何信息和全局语义信息，并能够达到较高的AU-ROC值。",
    "en_tdlr": "This study proposes a point cloud anomaly detection method that combines local geometric information and global semantic information using a Complementary Pseudo Multimodal Feature approach, achieving high AU-ROC values on a benchmark dataset."
}