{
    "title": "When Brain-inspired AI Meets AGI. (arXiv:2303.15935v1 [cs.AI])",
    "abstract": "Artificial General Intelligence (AGI) has been a long-standing goal of humanity, with the aim of creating machines capable of performing any intellectual task that humans can do. To achieve this, AGI researchers draw inspiration from the human brain and seek to replicate its principles in intelligent machines. Brain-inspired artificial intelligence is a field that has emerged from this endeavor, combining insights from neuroscience, psychology, and computer science to develop more efficient and powerful AI systems. In this article, we provide a comprehensive overview of brain-inspired AI from the perspective of AGI. We begin with the current progress in brain-inspired AI and its extensive connection with AGI. We then cover the important characteristics for both human intelligence and AGI (e.g., scaling, multimodality, and reasoning). We discuss important technologies toward achieving AGI in current AI systems, such as in-context learning and prompt tuning. We also investigate the evolu",
    "link": "http://arxiv.org/abs/2303.15935",
    "context": "Title: When Brain-inspired AI Meets AGI. (arXiv:2303.15935v1 [cs.AI])\nAbstract: Artificial General Intelligence (AGI) has been a long-standing goal of humanity, with the aim of creating machines capable of performing any intellectual task that humans can do. To achieve this, AGI researchers draw inspiration from the human brain and seek to replicate its principles in intelligent machines. Brain-inspired artificial intelligence is a field that has emerged from this endeavor, combining insights from neuroscience, psychology, and computer science to develop more efficient and powerful AI systems. In this article, we provide a comprehensive overview of brain-inspired AI from the perspective of AGI. We begin with the current progress in brain-inspired AI and its extensive connection with AGI. We then cover the important characteristics for both human intelligence and AGI (e.g., scaling, multimodality, and reasoning). We discuss important technologies toward achieving AGI in current AI systems, such as in-context learning and prompt tuning. We also investigate the evolu",
    "path": "papers/23/03/2303.15935.json",
    "total_tokens": 848,
    "translated_title": "当脑启发式人工智能遇见AGI",
    "translated_abstract": "人工智能的长期目标是创造出能够像人类一样执行智力任务的机器，这就是通常所说的人工通用智能（AGI）。为了实现这一目标，AGI研究者从人脑中汲取灵感，并试图在智能机器中复制其原理。脑启发式人工智能是从这一努力中崛起的一个领域，它结合了神经科学、心理学和计算机科学的见解，以开发更高效、更强大的AI系统。本文从AGI的角度全面介绍脑启发式AI，包括目前的研究进展以及其与AGI的广泛联系，介绍了人类智能和AGI的重要特征（例如可伸缩性、多模式性和推理能力），并讨论了实现AGI的重要技术，例如上下文学习和提示调整等。",
    "tldr": "本文综述了从AGI的角度看脑启发式人工智能的研究现状和重要特征，讨论了实现AGI的重要技术，如上下文学习和提示调整等。",
    "en_tdlr": "This article provides a comprehensive overview of brain-inspired artificial intelligence from the perspective of AGI, discussing its current status and important characteristics, as well as technologies for achieving AGI, such as in-context learning and prompt tuning."
}