{
    "title": "Infrastructure-based End-to-End Learning and Prevention of Driver Failure. (arXiv:2303.12224v1 [cs.RO])",
    "abstract": "Intelligent intersection managers can improve safety by detecting dangerous drivers or failure modes in autonomous vehicles, warning oncoming vehicles as they approach an intersection. In this work, we present FailureNet, a recurrent neural network trained end-to-end on trajectories of both nominal and reckless drivers in a scaled miniature city. FailureNet observes the poses of vehicles as they approach an intersection and detects whether a failure is present in the autonomy stack, warning cross-traffic of potentially dangerous drivers. FailureNet can accurately identify control failures, upstream perception errors, and speeding drivers, distinguishing them from nominal driving. The network is trained and deployed with autonomous vehicles in the MiniCity. Compared to speed or frequency-based predictors, FailureNet's recurrent neural network structure provides improved predictive power, yielding upwards of 84% accuracy when deployed on hardware.",
    "link": "http://arxiv.org/abs/2303.12224",
    "context": "Title: Infrastructure-based End-to-End Learning and Prevention of Driver Failure. (arXiv:2303.12224v1 [cs.RO])\nAbstract: Intelligent intersection managers can improve safety by detecting dangerous drivers or failure modes in autonomous vehicles, warning oncoming vehicles as they approach an intersection. In this work, we present FailureNet, a recurrent neural network trained end-to-end on trajectories of both nominal and reckless drivers in a scaled miniature city. FailureNet observes the poses of vehicles as they approach an intersection and detects whether a failure is present in the autonomy stack, warning cross-traffic of potentially dangerous drivers. FailureNet can accurately identify control failures, upstream perception errors, and speeding drivers, distinguishing them from nominal driving. The network is trained and deployed with autonomous vehicles in the MiniCity. Compared to speed or frequency-based predictors, FailureNet's recurrent neural network structure provides improved predictive power, yielding upwards of 84% accuracy when deployed on hardware.",
    "path": "papers/23/03/2303.12224.json",
    "total_tokens": 874,
    "translated_title": "基于基础设施的端到端学习和驾驶员失误预防",
    "translated_abstract": "智能交叉路口管理器可以通过检测自动驾驶车辆中的危险驾驶员或故障模式，警告接近交叉路口的来车，从而提高安全性。在这项工作中，我们介绍了FailureNet，这是一个在缩小的微型城市中基于轨迹对正常和不安全驾驶员进行端到端训练的循环神经网络。FailureNet观察车辆接近交叉口时的姿态，检测自主堆栈中是否存在故障，并警告交叉流量有潜在危险的驾驶员。FailureNet能够准确地识别控制故障、上游感知错误和超速驾驶员，与正常驾驶加以区别。该网络在MiniCity中进行训练和部署，与基于速度或频率的预测器相比，FailureNet的循环神经网络结构提供了更高的预测能力，当部署在硬件上时，其准确性高达84%以上。",
    "tldr": "本论文介绍了一种基于循环神经网络的端到端训练方法来预测自动驾驶车辆中可能存在的故障和危险驾驶员，并在缩小的微型城市中进行了测试。",
    "en_tdlr": "This paper presents a recurrent neural network trained using an end-to-end approach to predict potential failures and reckless drivers in autonomous vehicles, achieving high accuracy in a scaled miniature city."
}