{
    "title": "Traffic4cast at NeurIPS 2022 -- Predict Dynamics along Graph Edges from Sparse Node Data: Whole City Traffic and ETA from Stationary Vehicle Detectors. (arXiv:2303.07758v1 [cs.LG])",
    "abstract": "The global trends of urbanization and increased personal mobility force us to rethink the way we live and use urban space. The Traffic4cast competition series tackles this problem in a data-driven way, advancing the latest methods in machine learning for modeling complex spatial systems over time. In this edition, our dynamic road graph data combine information from road maps, $10^{12}$ probe data points, and stationary vehicle detectors in three cities over the span of two years. While stationary vehicle detectors are the most accurate way to capture traffic volume, they are only available in few locations. Traffic4cast 2022 explores models that have the ability to generalize loosely related temporal vertex data on just a few nodes to predict dynamic future traffic states on the edges of the entire road graph. In the core challenge, participants are invited to predict the likelihoods of three congestion classes derived from the speed levels in the GPS data for the entire road graph in",
    "link": "http://arxiv.org/abs/2303.07758",
    "context": "Title: Traffic4cast at NeurIPS 2022 -- Predict Dynamics along Graph Edges from Sparse Node Data: Whole City Traffic and ETA from Stationary Vehicle Detectors. (arXiv:2303.07758v1 [cs.LG])\nAbstract: The global trends of urbanization and increased personal mobility force us to rethink the way we live and use urban space. The Traffic4cast competition series tackles this problem in a data-driven way, advancing the latest methods in machine learning for modeling complex spatial systems over time. In this edition, our dynamic road graph data combine information from road maps, $10^{12}$ probe data points, and stationary vehicle detectors in three cities over the span of two years. While stationary vehicle detectors are the most accurate way to capture traffic volume, they are only available in few locations. Traffic4cast 2022 explores models that have the ability to generalize loosely related temporal vertex data on just a few nodes to predict dynamic future traffic states on the edges of the entire road graph. In the core challenge, participants are invited to predict the likelihoods of three congestion classes derived from the speed levels in the GPS data for the entire road graph in",
    "path": "papers/23/03/2303.07758.json",
    "total_tokens": 870,
    "translated_title": "NeurIPS 2022的Traffic4cast--预测城市交通和ETA的动态路网模型利用静止车辆探测器的稀疏节点数据。",
    "translated_abstract": "城市化和个人的交通业务趋势使我们不得不重新考虑我们生活和使用城市空间的方式。Traffic4cast竞赛通过数据驱动的方式，并利用机器学习来研究复杂时空系统的建模，从而解决这个问题。在这个版本中，我们将来自路网，$10^{12}$ 个探针数据点和三个城市两年的静止车辆探测器的信息结合在一起。然而，静止车辆探测器只在少数位置上可用，尽管它们是捕获交通量最准确的方法。Traffic4cast 2022探索的模型有能力将只有几个节点上的松散关联的时间节点数据概括到整个道路图的动态未来交通状态的预测中。",
    "tldr": "NeurIPS 2022的Traffic4cast竞赛要求参与者利用稀疏节点数据预测整个道路图的动态未来交通状态，并将GPS数据的速度级别转化为三个拥堵等级的概率。",
    "en_tdlr": "Traffic4cast at NeurIPS 2022 requires participants to use sparse node data to predict the dynamic future traffic state of the entire road graph and convert the speed levels of GPS data into probabilities of three congestion levels."
}