{
    "title": "Relax, it doesn't matter how you get there: A new self-supervised approach for multi-timescale behavior analysis. (arXiv:2303.08811v1 [cs.LG])",
    "abstract": "Natural behavior consists of dynamics that are complex and unpredictable, especially when trying to predict many steps into the future. While some success has been found in building representations of behavior under constrained or simplified task-based conditions, many of these models cannot be applied to free and naturalistic settings where behavior becomes increasingly hard to model. In this work, we develop a multi-task representation learning model for behavior that combines two novel components: (i) An action prediction objective that aims to predict the distribution of actions over future timesteps, and (ii) A multi-scale architecture that builds separate latent spaces to accommodate short- and long-term dynamics. After demonstrating the ability of the method to build representations of both local and global dynamics in realistic robots in varying environments and terrains, we apply our method to the MABe 2022 Multi-agent behavior challenge, where our model ranks 1st overall and ",
    "link": "http://arxiv.org/abs/2303.08811",
    "context": "Title: Relax, it doesn't matter how you get there: A new self-supervised approach for multi-timescale behavior analysis. (arXiv:2303.08811v1 [cs.LG])\nAbstract: Natural behavior consists of dynamics that are complex and unpredictable, especially when trying to predict many steps into the future. While some success has been found in building representations of behavior under constrained or simplified task-based conditions, many of these models cannot be applied to free and naturalistic settings where behavior becomes increasingly hard to model. In this work, we develop a multi-task representation learning model for behavior that combines two novel components: (i) An action prediction objective that aims to predict the distribution of actions over future timesteps, and (ii) A multi-scale architecture that builds separate latent spaces to accommodate short- and long-term dynamics. After demonstrating the ability of the method to build representations of both local and global dynamics in realistic robots in varying environments and terrains, we apply our method to the MABe 2022 Multi-agent behavior challenge, where our model ranks 1st overall and ",
    "path": "papers/23/03/2303.08811.json",
    "total_tokens": 925,
    "translated_title": "不用担心你怎么到达目的地：一种新的自监督多时间尺度行为分析方法",
    "translated_abstract": "自然行为具有复杂和不可预测的动态，特别是在尝试预测未来许多步骤时。尽管在受限或简化的任务条件下构建行为表示方面取得了一定的成功，但其中许多模型不能应用于自由和自然的环境中，因为这些行为变得越来越难以建模。在这项工作中，我们为行为开发了一种多任务表示学习模型，其中包括两个新颖组件：（i）一个行动预测目标，旨在预测未来时间步长的行动分布; （ii）一种多尺度结构，建立独立的潜在空间以适应短期和长期动态。在展示了该方法在不同环境和地形中对真实机器人的局部和全局动态建模能力后，我们将该方法应用到MABe 2022多智能体行为挑战赛中，其中我们的模型在总体排名中排名第一，并达到了最先进的结果。",
    "tldr": "本文提出了一种自监督的多任务表示学习模型，结合行动预测和多尺度结构以建立局部和全局动态的潜在空间，并在多智能体行为挑战赛中取得最先进的结果。",
    "en_tdlr": "This paper proposes a self-supervised multi-task representation learning model that combines action prediction and multi-scale architecture to build separate latent spaces for local and global dynamics, achieving state-of-the-art results in the MABe 2022 Multi-agent behavior challenge."
}