{
    "title": "A fast Multiplicative Updates algorithm for Non-negative Matrix Factorization. (arXiv:2303.17992v1 [math.OC])",
    "abstract": "Nonnegative Matrix Factorization is an important tool in unsupervised machine learning to decompose a data matrix into a product of parts that are often interpretable. Many algorithms have been proposed during the last three decades. A well-known method is the Multiplicative Updates algorithm proposed by Lee and Seung in 2002. Multiplicative updates have many interesting features: they are simple to implement and can be adapted to popular variants such as sparse Nonnegative Matrix Factorization, and, according to recent benchmarks, is state-of-the-art for many problems where the loss function is not the Frobenius norm. In this manuscript, we propose to improve the Multiplicative Updates algorithm seen as an alternating majorization minimization algorithm by crafting a tighter upper bound of the Hessian matrix for each alternate subproblem. Convergence is still ensured and we observe in practice on both synthetic and real world dataset that the proposed fastMU algorithm is often several",
    "link": "http://arxiv.org/abs/2303.17992",
    "context": "Title: A fast Multiplicative Updates algorithm for Non-negative Matrix Factorization. (arXiv:2303.17992v1 [math.OC])\nAbstract: Nonnegative Matrix Factorization is an important tool in unsupervised machine learning to decompose a data matrix into a product of parts that are often interpretable. Many algorithms have been proposed during the last three decades. A well-known method is the Multiplicative Updates algorithm proposed by Lee and Seung in 2002. Multiplicative updates have many interesting features: they are simple to implement and can be adapted to popular variants such as sparse Nonnegative Matrix Factorization, and, according to recent benchmarks, is state-of-the-art for many problems where the loss function is not the Frobenius norm. In this manuscript, we propose to improve the Multiplicative Updates algorithm seen as an alternating majorization minimization algorithm by crafting a tighter upper bound of the Hessian matrix for each alternate subproblem. Convergence is still ensured and we observe in practice on both synthetic and real world dataset that the proposed fastMU algorithm is often several",
    "path": "papers/23/03/2303.17992.json",
    "total_tokens": 894,
    "translated_title": "一种快速的非负矩阵分解乘法更新算法",
    "translated_abstract": "非负矩阵分解是一种重要的无监督机器学习工具，可以将数据矩阵分解为易于解释的部分。过去三十年中出现了许多算法，其中一种广为人知的方法是由李飞飞和才华横溢于2002年提出的乘法更新算法。该算法在许多领域表现良好，具有简单易实现和可适应流行变体的特点。本文建议通过为每个替代子问题制作更紧密的Hessian矩阵的上限来改进乘法更新算法，并将其视为交替主体化最小化算法。在合成数据和实际数据上实践中观察到，所提出的fastMU算法通常比原始的乘法更新算法快数倍，同时在逼近精度方面实现了类似或更好的结果，收敛仍然得到保证。",
    "tldr": "提出了一种快速的非负矩阵分解乘法更新算法，通过改进交替主体化最小化算法，实现了较快的求解和类似或更好的逼近精度结果。",
    "en_tdlr": "A fast algorithm for non-negative matrix factorization using multiplicative updates is proposed, where a tighter upper bound of the Hessian matrix is utilized to improve the convergence rate. The proposed fastMU algorithm demonstrates significantly faster computation time compared to the original algorithm, while maintaining similar or improved approximation accuracy."
}