{
    "title": "Tensor-based Multimodal Learning for Prediction of Pulmonary Arterial Wedge Pressure from Cardiac MRI. (arXiv:2303.07540v1 [cs.LG])",
    "abstract": "Heart failure is a serious and life-threatening condition that can lead to elevated pressure in the left ventricle. Pulmonary Arterial Wedge Pressure (PAWP) is an important surrogate marker indicating high pressure in the left ventricle. PAWP is determined by Right Heart Catheterization (RHC) but it is an invasive procedure. A non-invasive method is useful in quickly identifying high-risk patients from a large population. In this work, we develop a tensor learning-based pipeline for identifying PAWP from multimodal cardiac Magnetic Resonance Imaging (MRI). This pipeline extracts spatial and temporal features from high-dimensional scans. For quality control, we incorporate an epistemic uncertainty-based binning strategy to identify poor-quality training samples. To improve the performance, we learn complementary information by integrating features from multimodal data: cardiac MRI with short-axis and four-chamber views, and Electronic Health Records. The experimental analysis on a large",
    "link": "http://arxiv.org/abs/2303.07540",
    "context": "Title: Tensor-based Multimodal Learning for Prediction of Pulmonary Arterial Wedge Pressure from Cardiac MRI. (arXiv:2303.07540v1 [cs.LG])\nAbstract: Heart failure is a serious and life-threatening condition that can lead to elevated pressure in the left ventricle. Pulmonary Arterial Wedge Pressure (PAWP) is an important surrogate marker indicating high pressure in the left ventricle. PAWP is determined by Right Heart Catheterization (RHC) but it is an invasive procedure. A non-invasive method is useful in quickly identifying high-risk patients from a large population. In this work, we develop a tensor learning-based pipeline for identifying PAWP from multimodal cardiac Magnetic Resonance Imaging (MRI). This pipeline extracts spatial and temporal features from high-dimensional scans. For quality control, we incorporate an epistemic uncertainty-based binning strategy to identify poor-quality training samples. To improve the performance, we learn complementary information by integrating features from multimodal data: cardiac MRI with short-axis and four-chamber views, and Electronic Health Records. The experimental analysis on a large",
    "path": "papers/23/03/2303.07540.json",
    "total_tokens": 931,
    "translated_title": "基于张量的多模态学习预测心脏MRI中肺动脉楔压力",
    "translated_abstract": "心衰是一种严重的生命威胁疾病，会导致左心室压力升高。肺动脉楔压力（PAWP）是一个重要的代理标志，表示左心室的高压。PAWP 由右心导管检查（RHC）确定，但它是一种有创性的过程。通过非侵入性的方法，可以快速地从大量人群中识别高危患者。在这项工作中，我们开发了一个基于张量学习的流程，从多模态心脏磁共振成像（MRI）中识别PAWP。这个流程提取高维扫描中的空间和时间特征。为了质量控制，我们采用认识不确定性为基础的分组策略，以识别质量差的训练样本。为了提高性能，我们通过整合多模态数据的特征：心脏MRI与短轴和四腔视图以及电子病历，学习互补信息。这项实验分析对大型数据集进行了验证。",
    "tldr": "提出了一种基于张量学习的流程，从多模态心脏磁共振成像（MRI）中识别肺动脉楔压力（PAWP）。通过整合多种特征信息，提高了识别准确度。",
    "en_tdlr": "A tensor learning-based pipeline is developed to identify pulmonary arterial wedge pressure (PAWP) from multimodal cardiac MRI, which improves accuracy by integrating multiple features from the data."
}