{
    "title": "ChatGPT or academic scientist? Distinguishing authorship with over 99% accuracy using off-the-shelf machine learning tools. (arXiv:2303.16352v1 [cs.LG])",
    "abstract": "ChatGPT has enabled access to AI-generated writing for the masses, and within just a few months, this product has disrupted the knowledge economy, initiating a culture shift in the way people work, learn, and write. The need to discriminate human writing from AI is now both critical and urgent, particularly in domains like higher education and academic writing, where AI had not been a significant threat or contributor to authorship. Addressing this need, we developed a method for discriminating text generated by ChatGPT from (human) academic scientists, relying on prevalent and accessible supervised classification methods. We focused on how a particular group of humans, academic scientists, write differently than ChatGPT, and this targeted approach led to the discovery of new features for discriminating (these) humans from AI; as examples, scientists write long paragraphs and have a penchant for equivocal language, frequently using words like but, however, and although. With a set of 2",
    "link": "http://arxiv.org/abs/2303.16352",
    "context": "Title: ChatGPT or academic scientist? Distinguishing authorship with over 99% accuracy using off-the-shelf machine learning tools. (arXiv:2303.16352v1 [cs.LG])\nAbstract: ChatGPT has enabled access to AI-generated writing for the masses, and within just a few months, this product has disrupted the knowledge economy, initiating a culture shift in the way people work, learn, and write. The need to discriminate human writing from AI is now both critical and urgent, particularly in domains like higher education and academic writing, where AI had not been a significant threat or contributor to authorship. Addressing this need, we developed a method for discriminating text generated by ChatGPT from (human) academic scientists, relying on prevalent and accessible supervised classification methods. We focused on how a particular group of humans, academic scientists, write differently than ChatGPT, and this targeted approach led to the discovery of new features for discriminating (these) humans from AI; as examples, scientists write long paragraphs and have a penchant for equivocal language, frequently using words like but, however, and although. With a set of 2",
    "path": "papers/23/03/2303.16352.json",
    "total_tokens": 993,
    "translated_title": "用现有机器学习工具以超过99%的准确度区分ChatGPT和学术科学家的作者身份",
    "translated_abstract": "ChatGPT使广大群众能够访问AI生成的文章，在短短几个月内，这个产品颠覆了知识经济，引发了人们工作、学习和写作方式的文化变革。现在区分人类写作和AI写作的需求变得至关重要和紧迫，特别是在高等教育和学术写作等领域，AI在之前不曾是一个重要的威胁或者贡献者。针对这一需求，我们开发了一种区分ChatGPT生成文本和（人类）学术科学家撰写文本的方法，依靠普及且易于获取的监督分类方法。我们的重点在于，学术科学家这一特定人群的写作与ChatGPT有何不同，这种有针对性的方法导致我们发现了用于区分（这些）人类和AI的新特征。例如，科学家经常写长段落，喜欢使用模糊语言，经常使用but、however和although等词汇。我们训练和测试了这种方法，使用了2.5k个样本，成功实现了99.2%的准确率，区分ChatGPT和学术科学家的写作。",
    "tldr": "该论文设计了一种用于区分ChatGPT生成文本和学术科学家撰写文本的方法，并在2.5k个样本上测试，实现了99.2%的准确率。",
    "en_tdlr": "This paper presents a method for discriminating text generated by ChatGPT from human academic scientists with over 99% accuracy, through targeted feature discovery and prevalent supervised classification methods."
}