{
    "title": "Wearing Masks Implies Refuting Trump?: Towards Target-specific User Stance Prediction across Events in COVID-19 and US Election 2020. (arXiv:2303.12029v1 [cs.SI])",
    "abstract": "People who share similar opinions towards controversial topics could form an echo chamber and may share similar political views toward other topics as well. The existence of such connections, which we call connected behavior, gives researchers a unique opportunity to predict how one would behave for a future event given their past behaviors. In this work, we propose a framework to conduct connected behavior analysis. Neural stance detection models are trained on Twitter data collected on three seemingly independent topics, i.e., wearing a mask, racial equality, and Trump, to detect people's stance, which we consider as their online behavior in each topic-related event. Our results reveal a strong connection between the stances toward the three topical events and demonstrate the power of past behaviors in predicting one's future behavior.",
    "link": "http://arxiv.org/abs/2303.12029",
    "context": "Title: Wearing Masks Implies Refuting Trump?: Towards Target-specific User Stance Prediction across Events in COVID-19 and US Election 2020. (arXiv:2303.12029v1 [cs.SI])\nAbstract: People who share similar opinions towards controversial topics could form an echo chamber and may share similar political views toward other topics as well. The existence of such connections, which we call connected behavior, gives researchers a unique opportunity to predict how one would behave for a future event given their past behaviors. In this work, we propose a framework to conduct connected behavior analysis. Neural stance detection models are trained on Twitter data collected on three seemingly independent topics, i.e., wearing a mask, racial equality, and Trump, to detect people's stance, which we consider as their online behavior in each topic-related event. Our results reveal a strong connection between the stances toward the three topical events and demonstrate the power of past behaviors in predicting one's future behavior.",
    "path": "papers/23/03/2303.12029.json",
    "total_tokens": 852,
    "translated_title": "戴口罩是否意味着反对特朗普？：跨新冠疫情和2020年美国大选的目标特定用户立场预测之路",
    "translated_abstract": "在具有争议的话题中，持相似观点的人可能会形成回音室，并可能对其他话题持有类似的政治观点。我们称这种联系存在的连接行为，为研究人员提供了预测一个人在未来事件中会如何行动的独特机会。在这项工作中，我们提出了一个框架来进行连接行为分析。我们利用在 Twitter 上收集的关于三个看似独立的话题（口罩、种族平等和特朗普）的数据来训练神经立场检测模型，以检测人们的立场，我们认为这是他们在每个与话题有关的事件中的在线行为。我们的结果揭示了三个主题事件的观点之间的强连接，并展示了过去行为在预测一个人未来行为方面的能力。",
    "tldr": "该研究提出了一个框架，旨在预测一个人在未来事件中的行为，通过分析人们在口罩、种族平等和特朗普等话题上的立场，并揭示了过去行为在预测未来行为方面的能力。",
    "en_tdlr": "This research proposes a framework for predicting future behavior by analyzing people's stances on topics such as wearing masks, racial equality, and Trump, and reveals the power of past behaviors in predicting future actions."
}