{
    "title": "Critical Thinking Via Storytelling: Theory and Social Media Experiment. (arXiv:2303.16422v1 [econ.TH])",
    "abstract": "In a stylized voting model, we establish that increasing the share of critical thinkers -- individuals who are aware of the ambivalent nature of a certain issue -- in the population increases the efficiency of surveys (elections) but might increase surveys' bias. In an incentivized online social media experiment on a representative US population (N = 706), we show that different digital storytelling formats -- different designs to present the same set of facts -- affect the intensity at which individuals become critical thinkers. Intermediate-length designs (Facebook posts) are most effective at triggering individuals into critical thinking. Individuals with a high need for cognition mostly drive the differential effects of the treatments.",
    "link": "http://arxiv.org/abs/2303.16422",
    "context": "Title: Critical Thinking Via Storytelling: Theory and Social Media Experiment. (arXiv:2303.16422v1 [econ.TH])\nAbstract: In a stylized voting model, we establish that increasing the share of critical thinkers -- individuals who are aware of the ambivalent nature of a certain issue -- in the population increases the efficiency of surveys (elections) but might increase surveys' bias. In an incentivized online social media experiment on a representative US population (N = 706), we show that different digital storytelling formats -- different designs to present the same set of facts -- affect the intensity at which individuals become critical thinkers. Intermediate-length designs (Facebook posts) are most effective at triggering individuals into critical thinking. Individuals with a high need for cognition mostly drive the differential effects of the treatments.",
    "path": "papers/23/03/2303.16422.json",
    "total_tokens": 742,
    "translated_title": "通过讲故事培养批判性思维：理论与社交媒体实验",
    "translated_abstract": "在一个简化的投票模型中，我们证明了增加具有意识到某一问题模棱两可性质的批判性思维者的比例会提高调查（选举）的效率，但可能会增加调查的偏见。在针对代表性美国人口的激励在线社交媒体实验（N = 706）中，我们证明了不同的数字叙事格式 – 不同的设计来呈现同一组事实 – 影响个体成为批判性思维者的强度。中等长度的设计（Facebook帖子）最有效地激发个体的批判性思维。需要认知的程度高的个体主要驱动了治疗效果的差异。",
    "tldr": "通过社交媒体实验，研究人员发现不同的数字叙事格式会影响人们的批判性思维，中等长度的设计最有效，需要认知程度高的个体影响最大。",
    "en_tdlr": "Researchers found through a social media experiment that different digital storytelling formats affect critical thinking, with intermediate-length designs being most effective and individuals with a high need for cognition having the biggest impact."
}