{
    "title": "Don't PANIC: Prototypical Additive Neural Network for Interpretable Classification of Alzheimer's Disease. (arXiv:2303.07125v2 [cs.LG] UPDATED)",
    "abstract": "Alzheimer's disease (AD) has a complex and multifactorial etiology, which requires integrating information about neuroanatomy, genetics, and cerebrospinal fluid biomarkers for accurate diagnosis. Hence, recent deep learning approaches combined image and tabular information to improve diagnostic performance. However, the black-box nature of such neural networks is still a barrier for clinical applications, in which understanding the decision of a heterogeneous model is integral. We propose PANIC, a prototypical additive neural network for interpretable AD classification that integrates 3D image and tabular data. It is interpretable by design and, thus, avoids the need for post-hoc explanations that try to approximate the decision of a network. Our results demonstrate that PANIC achieves state-of-the-art performance in AD classification, while directly providing local and global explanations. Finally, we show that PANIC extracts biologically meaningful signatures of AD, and satisfies a s",
    "link": "http://arxiv.org/abs/2303.07125",
    "context": "Title: Don't PANIC: Prototypical Additive Neural Network for Interpretable Classification of Alzheimer's Disease. (arXiv:2303.07125v2 [cs.LG] UPDATED)\nAbstract: Alzheimer's disease (AD) has a complex and multifactorial etiology, which requires integrating information about neuroanatomy, genetics, and cerebrospinal fluid biomarkers for accurate diagnosis. Hence, recent deep learning approaches combined image and tabular information to improve diagnostic performance. However, the black-box nature of such neural networks is still a barrier for clinical applications, in which understanding the decision of a heterogeneous model is integral. We propose PANIC, a prototypical additive neural network for interpretable AD classification that integrates 3D image and tabular data. It is interpretable by design and, thus, avoids the need for post-hoc explanations that try to approximate the decision of a network. Our results demonstrate that PANIC achieves state-of-the-art performance in AD classification, while directly providing local and global explanations. Finally, we show that PANIC extracts biologically meaningful signatures of AD, and satisfies a s",
    "path": "papers/23/03/2303.07125.json",
    "total_tokens": 934,
    "translated_title": "不要惊慌：基于原型加性神经网络的阿尔茨海默病可解释分类",
    "translated_abstract": "阿尔茨海默病（AD）具有复杂和多因素的病因学，需要整合神经解剖学、遗传学和脑脊液生物标志物的信息进行准确的诊断。因此，近期的深度学习方法结合了图像和表格信息以提高诊断性能。然而，这些神经网络的黑盒特性仍然是临床应用的障碍，其中理解异质模型的决策是必要的。我们提出了一个名为PANIC的原型加性神经网络，用于解释性的AD分类，其整合了3D图像和表格数据。它是通过设计来可解释的，从而避免了尝试逼近网络决策的事后解释的需要。我们的结果表明，PANIC在AD分类方面实现了最先进的性能，同时直接提供局部和全局的解释。最后，我们展示了PANIC提取出有生物意义的AD特征，并满足了一定的s要求。",
    "tldr": "本研究提出了PANIC，一个基于原型加性神经网络的可解释AD分类模型，整合了3D图像和表格数据并且表现出最先进的性能，提供了直接的局部和全局解释，并提取出了有生物意义的AD特征。"
}