{
    "title": "High-Frequency Volatility Estimation with Fast Multiple Change Points Detection. (arXiv:2303.10550v1 [q-fin.ST])",
    "abstract": "We propose high-frequency volatility estimators with multiple change points that are $\\ell_1$-regularized versions of two classical estimators: quadratic variation and bipower variation. We establish consistency of these estimators for the true unobserved volatility and the change points locations under general sub-Weibull distribution assumptions on the jump process. The proposed estimators employ the computationally efficient least angle regression algorithm for estimation purposes, followed by a reduced dynamic programming step to refine the final number of change points. In terms of numerical performance, the proposed estimators are computationally fast and accurately identify breakpoints near the end of the sample, which is highly desirable in today's electronic trading environment. In terms of out-of-sample volatility prediction, our new estimators provide more realistic and smoother volatility forecasts, and they outperform a wide range of classical and recent volatility estimat",
    "link": "http://arxiv.org/abs/2303.10550",
    "context": "Title: High-Frequency Volatility Estimation with Fast Multiple Change Points Detection. (arXiv:2303.10550v1 [q-fin.ST])\nAbstract: We propose high-frequency volatility estimators with multiple change points that are $\\ell_1$-regularized versions of two classical estimators: quadratic variation and bipower variation. We establish consistency of these estimators for the true unobserved volatility and the change points locations under general sub-Weibull distribution assumptions on the jump process. The proposed estimators employ the computationally efficient least angle regression algorithm for estimation purposes, followed by a reduced dynamic programming step to refine the final number of change points. In terms of numerical performance, the proposed estimators are computationally fast and accurately identify breakpoints near the end of the sample, which is highly desirable in today's electronic trading environment. In terms of out-of-sample volatility prediction, our new estimators provide more realistic and smoother volatility forecasts, and they outperform a wide range of classical and recent volatility estimat",
    "path": "papers/23/03/2303.10550.json",
    "total_tokens": 844,
    "translated_abstract": "本文提出了一种带有多个变点的高频波动率估计器，它们是两个经典估计器——二次变分和双能量变分的$\\ell_1$正则版本。在跳跃过程的一般子Weibull分布假设下，我们建立了这些估计器对真实未观测波动率和变点位置的一致性。所提出的估计器采用计算有效的最小角度回归算法进行估计，然后通过减少的动态规划步骤来确定最终变点数。在数值表现方面，所提出的估计器计算速度快，在样本结束附近准确识别断点，这在今天的电子交易环境中非常理想。在样本外波动率预测方面，我们的新估计器提供了更为真实、更为平滑的波动率预测，并且在广泛的经典和最近的波动率估计中表现优异。",
    "tldr": "本文提出了一种快速多变点检测的高频波动率估计方法，能够在样本结束附近准确识别断点，并在样本外表现优异。",
    "en_tdlr": "This paper presents a fast multiple change-point detection method for high-frequency volatility estimation, which accurately identifies breakpoints near the end of the sample and performs well out-of-sample."
}