{
    "title": "AmorProt: Amino Acid Molecular Fingerprints Repurposing based Protein Fingerprint. (arXiv:2303.16209v1 [q-bio.QM])",
    "abstract": "As protein therapeutics play an important role in almost all medical fields, numerous studies have been conducted on proteins using artificial intelligence. Artificial intelligence has enabled data driven predictions without the need for expensive experiments. Nevertheless, unlike the various molecular fingerprint algorithms that have been developed, protein fingerprint algorithms have rarely been studied. In this study, we proposed the amino acid molecular fingerprints repurposing based protein (AmorProt) fingerprint, a protein sequence representation method that effectively uses the molecular fingerprints corresponding to 20 amino acids. Subsequently, the performances of the tree based machine learning and artificial neural network models were compared using (1) amyloid classification and (2) isoelectric point regression. Finally, the applicability and advantages of the developed platform were demonstrated through a case study and the following experiments: (3) comparison of dataset ",
    "link": "http://arxiv.org/abs/2303.16209",
    "context": "Title: AmorProt: Amino Acid Molecular Fingerprints Repurposing based Protein Fingerprint. (arXiv:2303.16209v1 [q-bio.QM])\nAbstract: As protein therapeutics play an important role in almost all medical fields, numerous studies have been conducted on proteins using artificial intelligence. Artificial intelligence has enabled data driven predictions without the need for expensive experiments. Nevertheless, unlike the various molecular fingerprint algorithms that have been developed, protein fingerprint algorithms have rarely been studied. In this study, we proposed the amino acid molecular fingerprints repurposing based protein (AmorProt) fingerprint, a protein sequence representation method that effectively uses the molecular fingerprints corresponding to 20 amino acids. Subsequently, the performances of the tree based machine learning and artificial neural network models were compared using (1) amyloid classification and (2) isoelectric point regression. Finally, the applicability and advantages of the developed platform were demonstrated through a case study and the following experiments: (3) comparison of dataset ",
    "path": "papers/23/03/2303.16209.json",
    "total_tokens": 951,
    "translated_title": "AmorProt：基于氨基酸分子指纹重用的蛋白质指纹算法",
    "translated_abstract": "随着蛋白质治疗在几乎所有医疗领域中的重要作用，已经有许多使用人工智能研究蛋白质的相关工作。人工智能使得在不需要昂贵的实验的情况下可以进行含有大量数据的预测。然而，与开发的各种分子指纹算法不同的是，蛋白质指纹算法很少被研究。在本研究中，我们提出了基于氨基酸分子指纹重用的蛋白质指纹算法（AmorProt），这是一种有效利用对应于20种氨基酸的分子指纹的蛋白质序列表示方法。随后，我们使用（1）淀粉样蛋白分组和（2）等电点回归来比较了基于树的机器学习和人工神经网络模型的表现。最后，通过案例研究和以下实验展示了开发平台的适用性和优势：（3）数据集比较。",
    "tldr": "本文提出了一种基于氨基酸分子指纹重用的蛋白质指纹算法AmorProt，使用树形机器学习和人工神经网络模型进行淀粉样蛋白分组和等电点回归，并展示了该平台的适用性和优势。",
    "en_tdlr": "This paper proposes a protein fingerprint algorithm called AmorProt, which effectively uses molecular fingerprints corresponding to 20 amino acids. The tree-based machine learning and artificial neural network models were used to classify amyloids and predict the isoelectric point, demonstrating the applicability and advantages of the platform."
}