{
    "title": "Self-Correctable and Adaptable Inference for Generalizable Human Pose Estimation. (arXiv:2303.11180v2 [cs.CV] UPDATED)",
    "abstract": "A central challenge in human pose estimation, as well as in many other machine learning and prediction tasks, is the generalization problem. The learned network does not have the capability to characterize the prediction error, generate feedback information from the test sample, and correct the prediction error on the fly for each individual test sample, which results in degraded performance in generalization. In this work, we introduce a self-correctable and adaptable inference (SCAI) method to address the generalization challenge of network prediction and use human pose estimation as an example to demonstrate its effectiveness and performance. We learn a correction network to correct the prediction result conditioned by a fitness feedback error. This feedback error is generated by a learned fitness feedback network which maps the prediction result to the original input domain and compares it against the original input. Interestingly, we find that this self-referential feedback error ",
    "link": "http://arxiv.org/abs/2303.11180",
    "context": "Title: Self-Correctable and Adaptable Inference for Generalizable Human Pose Estimation. (arXiv:2303.11180v2 [cs.CV] UPDATED)\nAbstract: A central challenge in human pose estimation, as well as in many other machine learning and prediction tasks, is the generalization problem. The learned network does not have the capability to characterize the prediction error, generate feedback information from the test sample, and correct the prediction error on the fly for each individual test sample, which results in degraded performance in generalization. In this work, we introduce a self-correctable and adaptable inference (SCAI) method to address the generalization challenge of network prediction and use human pose estimation as an example to demonstrate its effectiveness and performance. We learn a correction network to correct the prediction result conditioned by a fitness feedback error. This feedback error is generated by a learned fitness feedback network which maps the prediction result to the original input domain and compares it against the original input. Interestingly, we find that this self-referential feedback error ",
    "path": "papers/23/03/2303.11180.json",
    "total_tokens": 719,
    "translated_title": "可自我修正和自适应推理的通用人体姿态估计方法",
    "translated_abstract": "人体姿态估计中的一个主要挑战是泛化问题，即学习的网络无法对预测误差进行特征化，不能从测试样本中生成反馈信息并针对每个测试样本动态修正预测误差，导致泛化性能下降。本文引入自我修正和自适应推理（SCAI）方法来解决网络预测的泛化挑战，并以人体姿态估计为例来展示其有效性和性能。",
    "tldr": "本文提出了可自我修正和自适应推理的通用人体姿态估计方法，通过学习一个校正网络和健康反馈网络来解决网络预测的泛化挑战。",
    "en_tdlr": "This paper proposes a self-correctable and adaptable inference method for generalizable human pose estimation, which uses a correction network and a fitness feedback network to address the generalization challenge of network prediction."
}