{
    "title": "Error-mitigated Quantum Approximate Optimization via Learning-based Adaptive Optimization",
    "abstract": "Combinatorial optimization problems are ubiquitous and computationally hard to solve in general. Quantum computing is envisioned as a powerful tool offering potential computational advantages for solving some of these problems. Quantum approximate optimization algorithm (QAOA), one of the most representative quantum-classical hybrid algorithms, is designed to solve certain combinatorial optimization problems by transforming a discrete optimization problem into a classical optimization problem over a continuous circuit parameter domain. QAOA objective landscape over the parameter variables is notorious for pervasive local minima and barren plateaus, and its viability in training significantly relies on the efficacy of the classical optimization algorithm. To enhance the performance of QAOA, we design double adaptive-region Bayesian optimization (DARBO), an adaptive classical optimizer for QAOA. Our experimental results demonstrate that the algorithm greatly outperforms conventional grad",
    "link": "https://arxiv.org/abs/2303.14877",
    "context": "Title: Error-mitigated Quantum Approximate Optimization via Learning-based Adaptive Optimization\nAbstract: Combinatorial optimization problems are ubiquitous and computationally hard to solve in general. Quantum computing is envisioned as a powerful tool offering potential computational advantages for solving some of these problems. Quantum approximate optimization algorithm (QAOA), one of the most representative quantum-classical hybrid algorithms, is designed to solve certain combinatorial optimization problems by transforming a discrete optimization problem into a classical optimization problem over a continuous circuit parameter domain. QAOA objective landscape over the parameter variables is notorious for pervasive local minima and barren plateaus, and its viability in training significantly relies on the efficacy of the classical optimization algorithm. To enhance the performance of QAOA, we design double adaptive-region Bayesian optimization (DARBO), an adaptive classical optimizer for QAOA. Our experimental results demonstrate that the algorithm greatly outperforms conventional grad",
    "path": "papers/23/03/2303.14877.json",
    "total_tokens": 849,
    "translated_title": "通过基于学习的自适应优化纠正误差的量子近似优化算法",
    "translated_abstract": "组合优化问题普遍存在，并且在一般情况下很难求解。量子计算被视为一种强大的工具，可以在解决某些问题时具有潜在的计算优势。量子近似优化算法（QAOA）是最具代表性的量子-经典混合算法之一，旨在通过将离散优化问题转化为连续电路参数域上的经典优化问题来解决特定的组合优化问题。QAOA目标函数在参数变量上的景观因其普遍存在的局部最小值和贫瘠平台而臭名昭著，其可行性在很大程度上依赖于经典优化算法的有效性。为了提高QAOA的性能，我们设计了一种双自适应区域贝叶斯优化（DARBO），一种适应性经典优化器用于QAOA。我们的实验结果表明，该算法在性能上远远超过了传统的grad方法。",
    "tldr": "我们设计了一种双自适应区域贝叶斯优化算法，用于提升量子近似优化算法的性能。实验结果表明，该算法在性能上远远超过了传统的方法。"
}