{
    "title": "Specification-Guided Data Aggregation for Semantically Aware Imitation Learning. (arXiv:2303.17010v1 [cs.LG])",
    "abstract": "Advancements in simulation and formal methods-guided environment sampling have enabled the rigorous evaluation of machine learning models in a number of safety-critical scenarios, such as autonomous driving. Application of these environment sampling techniques towards improving the learned models themselves has yet to be fully exploited. In this work, we introduce a novel method for improving imitation-learned models in a semantically aware fashion by leveraging specification-guided sampling techniques as a means of aggregating expert data in new environments. Specifically, we create a set of formal specifications as a means of partitioning the space of possible environments into semantically similar regions, and identify elements of this partition where our learned imitation behaves most differently from the expert. We then aggregate expert data on environments in these identified regions, leading to more accurate imitation of the expert's behavior semantics. We instantiate our approa",
    "link": "http://arxiv.org/abs/2303.17010",
    "context": "Title: Specification-Guided Data Aggregation for Semantically Aware Imitation Learning. (arXiv:2303.17010v1 [cs.LG])\nAbstract: Advancements in simulation and formal methods-guided environment sampling have enabled the rigorous evaluation of machine learning models in a number of safety-critical scenarios, such as autonomous driving. Application of these environment sampling techniques towards improving the learned models themselves has yet to be fully exploited. In this work, we introduce a novel method for improving imitation-learned models in a semantically aware fashion by leveraging specification-guided sampling techniques as a means of aggregating expert data in new environments. Specifically, we create a set of formal specifications as a means of partitioning the space of possible environments into semantically similar regions, and identify elements of this partition where our learned imitation behaves most differently from the expert. We then aggregate expert data on environments in these identified regions, leading to more accurate imitation of the expert's behavior semantics. We instantiate our approa",
    "path": "papers/23/03/2303.17010.json",
    "total_tokens": 908,
    "translated_title": "语义感知模仿学习的规范引导数据聚合",
    "translated_abstract": "仿真和正式方法引导的环境采样的发展使得在许多安全关键场景中，如自动驾驶中，机器学习模型得到了严格的评估。这些环境采样技术的应用，以改进学习的模型本身为目的，尚未得到充分的利用。在这项工作中，我们介绍了一种新的方法，通过利用规范引导采样技术作为聚合新环境中专业数据的手段来以语义感知的方式改进模仿学习的模型。具体而言，我们创建一组正式规范，作为将可能环境空间划分为语义相似区域的手段，并确定该划分中我们所学习的模仿行为与专家之间最不同的元素。然后在这些确定的区域内聚合专家数据，从而更准确地模仿专家的行为语义。我们将我们的方法实例化到自动驾驶的背景下，显示出比传统的模仿学习技术有显着的改进。",
    "tldr": "本文提出了一种通过利用规范引导采样技术来聚合专业数据的方法，以语义感知的方式改进模仿学习模型，在自动驾驶领域实现了显着改进。",
    "en_tdlr": "This paper proposes a method of improving imitation learning models in a semantically aware fashion by leveraging specification-guided sampling techniques as a means of aggregating expert data in new environments, and demonstrates significant improvements in the context of autonomous driving."
}