{
    "title": "Using Explanations to Guide Models. (arXiv:2303.11932v1 [cs.CV])",
    "abstract": "Deep neural networks are highly performant, but might base their decision on spurious or background features that co-occur with certain classes, which can hurt generalization. To mitigate this issue, the usage of 'model guidance' has gained popularity recently: for this, models are guided to be \"right for the right reasons\" by regularizing the models' explanations to highlight the right features. Experimental validation of these approaches has thus far however been limited to relatively simple and / or synthetic datasets. To gain a better understanding of which model-guiding approaches actually transfer to more challenging real-world datasets, in this work we conduct an in-depth evaluation across various loss functions, attribution methods, models, and 'guidance depths' on the PASCAL VOC 2007 and MS COCO 2014 datasets, and show that model guidance can sometimes even improve model performance. In this context, we further propose a novel energy loss, show its effectiveness in directing t",
    "link": "http://arxiv.org/abs/2303.11932",
    "context": "Title: Using Explanations to Guide Models. (arXiv:2303.11932v1 [cs.CV])\nAbstract: Deep neural networks are highly performant, but might base their decision on spurious or background features that co-occur with certain classes, which can hurt generalization. To mitigate this issue, the usage of 'model guidance' has gained popularity recently: for this, models are guided to be \"right for the right reasons\" by regularizing the models' explanations to highlight the right features. Experimental validation of these approaches has thus far however been limited to relatively simple and / or synthetic datasets. To gain a better understanding of which model-guiding approaches actually transfer to more challenging real-world datasets, in this work we conduct an in-depth evaluation across various loss functions, attribution methods, models, and 'guidance depths' on the PASCAL VOC 2007 and MS COCO 2014 datasets, and show that model guidance can sometimes even improve model performance. In this context, we further propose a novel energy loss, show its effectiveness in directing t",
    "path": "papers/23/03/2303.11932.json",
    "total_tokens": 844,
    "translated_abstract": "深度神经网络具有高性能，但可能基于虚假的或背景特征来做出决策，这可能会损害泛化能力。为了解决这个问题，“模型指导”最近变得越来越受欢迎：采用正则化模型的解释以突出正确的特征，引导模型“正确的原因成为正确的原因”。然而，这些方法的实验验证迄今为止仅限于相对简单和/或合成数据集。为了更好地了解哪些模型引导方法实际上可以转移到更具挑战性的实际数据集，我们在PASCAL VOC 2007和MS COCO 2014数据集上进行了深入评估，跨越各种损失函数、属性方法、模型和“指导深度”，并展示了模型指导有时甚至可以提高模型性能。在这个背景下，我们进一步提出了一种新的能量损失，并展示其在指导模型方面的有效性。",
    "tldr": "研究模型指导方法在现实世界数据集上的适用性，提出了一种新的能量损失函数，并证明模型指导有时可以提高模型性能。",
    "en_tdlr": "Investigating the applicability of model guidance methods on real-world datasets, proposing a novel energy loss function, and demonstrating that model guidance can sometimes improve model performance."
}