{
    "title": "Expected Utility from a Constructive Viewpoint. (arXiv:2303.08633v1 [econ.TH])",
    "abstract": "This paper proves a constructive version of the expected utility theorem. The word constructive is construed here in two senses - first, as in constructive mathematics, whereby the logic underlying proofs is intuitionistic. In a second sense of the word, constructive is taken to mean built up from simpler components. Preferences are defined over lotteries that vary continuously over some topological space and are themselves assumed to vary depending upon some underlying process of measurement, deliberation, or observation. The open sets of the topology serve as the possible truth values of assertions about preference and constrain what can be measured, deduced, or observed. Replacing an open set by an open covering of smaller sets serves as a notion of refinement of information, and deductions made for these smaller sets can be combined or collated to yield corresponding deductions over the larger set. The two notions of constructive turn out to be related because the underlying logic ",
    "link": "http://arxiv.org/abs/2303.08633",
    "context": "Title: Expected Utility from a Constructive Viewpoint. (arXiv:2303.08633v1 [econ.TH])\nAbstract: This paper proves a constructive version of the expected utility theorem. The word constructive is construed here in two senses - first, as in constructive mathematics, whereby the logic underlying proofs is intuitionistic. In a second sense of the word, constructive is taken to mean built up from simpler components. Preferences are defined over lotteries that vary continuously over some topological space and are themselves assumed to vary depending upon some underlying process of measurement, deliberation, or observation. The open sets of the topology serve as the possible truth values of assertions about preference and constrain what can be measured, deduced, or observed. Replacing an open set by an open covering of smaller sets serves as a notion of refinement of information, and deductions made for these smaller sets can be combined or collated to yield corresponding deductions over the larger set. The two notions of constructive turn out to be related because the underlying logic ",
    "path": "papers/23/03/2303.08633.json",
    "total_tokens": 938,
    "translated_title": "从建设性观点看期望效用",
    "translated_abstract": "本文证明了期望效用定理的一个建设性版本。这里的建设性有两个含义——第一，像建设性数学那样，证明所依据的逻辑是直觉主义的；第二，建设性意味着由简单的组件构建而来。偏好是在某个拓扑空间上连续变化的抽签上定义的，而且这些抽签本身被认为是取决于某种基础的测量、商议或观察过程。拓扑空间的开集作为有关偏好的断言的可能真值，并且制约着可以测量、推导或观察到的内容。用较小集合的开覆盖替换开集作为信息细化的一个概念，并且对这些较小集合作出的推断可以组合或汇总，以便得到在较大集合上的相应推断。这两个建设性观点结果是相关的，因为其中一个涉及到直觉主义逻辑而另一个则涉及到集合的分解。",
    "tldr": "本文证明了期望效用定理的一个建设性版本，在这个版本中，偏好是在某个拓扑空间上连续变化的抽签上定义的，并用较小集合的开覆盖作为信息细化的一个概念，这两个建设性观点涉及到直觉主义逻辑和集合的分解。",
    "en_tdlr": "This paper provides a constructive version of the expected utility theorem, in which preferences are defined over lotteries that vary continuously over some topological space, and the refinement of information is achieved by replacing open sets with open coverings of smaller sets. These two constructive notions relate to intuitionistic logic and set decomposition, respectively."
}