{
    "title": "Machine learning tools to improve nonlinear modeling parameters of RC columns. (arXiv:2303.16140v1 [cs.LG])",
    "abstract": "Modeling parameters are essential to the fidelity of nonlinear models of concrete structures subjected to earthquake ground motions, especially when simulating seismic events strong enough to cause collapse. This paper addresses two of the most significant barriers to improving nonlinear modeling provisions in seismic evaluation standards using experimental data sets: identifying the most likely mode of failure of structural components, and implementing data fitting techniques capable of recognizing interdependencies between input parameters and nonlinear relationships between input parameters and model outputs. Machine learning tools in the Scikit-learn and Pytorch libraries were used to calibrate equations and black-box numerical models for nonlinear modeling parameters (MP) a and b of reinforced concrete columns defined in the ASCE 41 and ACI 369.1 standards, and to estimate their most likely mode of failure. It was found that machine learning regression models and machine learning ",
    "link": "http://arxiv.org/abs/2303.16140",
    "context": "Title: Machine learning tools to improve nonlinear modeling parameters of RC columns. (arXiv:2303.16140v1 [cs.LG])\nAbstract: Modeling parameters are essential to the fidelity of nonlinear models of concrete structures subjected to earthquake ground motions, especially when simulating seismic events strong enough to cause collapse. This paper addresses two of the most significant barriers to improving nonlinear modeling provisions in seismic evaluation standards using experimental data sets: identifying the most likely mode of failure of structural components, and implementing data fitting techniques capable of recognizing interdependencies between input parameters and nonlinear relationships between input parameters and model outputs. Machine learning tools in the Scikit-learn and Pytorch libraries were used to calibrate equations and black-box numerical models for nonlinear modeling parameters (MP) a and b of reinforced concrete columns defined in the ASCE 41 and ACI 369.1 standards, and to estimate their most likely mode of failure. It was found that machine learning regression models and machine learning ",
    "path": "papers/23/03/2303.16140.json",
    "total_tokens": 847,
    "translated_title": "用机器学习工具改进RC柱非线性建模参数",
    "translated_abstract": "建模参数对于混凝土结构的非线性模拟至关重要，特别是在模拟足以引起倒塌的地震事件时。本文解决了通过实验数据集提高地震评估标准中非线性建模要求的最大障碍之一：确定结构组件最可能的失效模式，并实施能够识别输入参数之间的相互依赖和输入参数与模型输出之间的非线性关系的数据拟合技术。本文使用Scikit-learn和Pytorch库中的机器学习工具来校准ASCE 41和ACI 369.1标准中强化混凝土柱的非线性建模参数MP a和b的方程和黑盒数值模型，并估计其最可能的失效模式。研究发现，机器学习回归模型和机器学习分类器可以显著提高预测MP a和b的准确性，并有助于确定RC柱的最可能失效模式。",
    "tldr": "用机器学习工具可以显著提高预测RC柱非线性建模参数的准确性，并有助于确定其最可能的失效模式。",
    "en_tdlr": "Using machine learning tools can significantly improve the accuracy of predicting nonlinear modeling parameters of reinforced concrete columns and help identify their most likely mode of failure."
}