{
    "title": "Recommendation Systems in Libraries: an Application with Heterogeneous Data Sources. (arXiv:2303.11746v1 [cs.IR])",
    "abstract": "The Reading&Machine project exploits the support of digitalization to increase the attractiveness of libraries and improve the users' experience. The project implements an application that helps the users in their decision-making process, providing recommendation system (RecSys)-generated lists of books the users might be interested in, and showing them through an interactive Virtual Reality (VR)-based Graphical User Interface (GUI). In this paper, we focus on the design and testing of the recommendation system, employing data about all users' loans over the past 9 years from the network of libraries located in Turin, Italy. In addition, we use data collected by the Anobii online social community of readers, who share their feedback and additional information about books they read. Armed with this heterogeneous data, we build and evaluate Content Based (CB) and Collaborative Filtering (CF) approaches. Our results show that the CF outperforms the CB approach, improving by up to 47\\% the",
    "link": "http://arxiv.org/abs/2303.11746",
    "context": "Title: Recommendation Systems in Libraries: an Application with Heterogeneous Data Sources. (arXiv:2303.11746v1 [cs.IR])\nAbstract: The Reading&Machine project exploits the support of digitalization to increase the attractiveness of libraries and improve the users' experience. The project implements an application that helps the users in their decision-making process, providing recommendation system (RecSys)-generated lists of books the users might be interested in, and showing them through an interactive Virtual Reality (VR)-based Graphical User Interface (GUI). In this paper, we focus on the design and testing of the recommendation system, employing data about all users' loans over the past 9 years from the network of libraries located in Turin, Italy. In addition, we use data collected by the Anobii online social community of readers, who share their feedback and additional information about books they read. Armed with this heterogeneous data, we build and evaluate Content Based (CB) and Collaborative Filtering (CF) approaches. Our results show that the CF outperforms the CB approach, improving by up to 47\\% the",
    "path": "papers/23/03/2303.11746.json",
    "total_tokens": 852,
    "translated_title": "图书馆中的推荐系统：一种异构数据源应用",
    "translated_abstract": "Reading&Machine项目利用数字化支持，提高图书馆的吸引力和改善用户体验。该项目实现了一个应用程序，通过推荐系统生成用户可能感兴趣的书籍列表，并通过基于虚拟现实（VR）的图形用户界面（GUI）互动显示，帮助用户进行决策。本文重点研究了推荐系统的设计和测试，采用意大利都灵图书馆网络过去9年所有用户借阅的数据，以及读者在线社交平台Anobii收集的反馈和关于读过书的附加信息。凭借这种异构的数据，我们构建和评估了基于内容的（CB）和协同过滤（CF）方法。结果表明，CF优于CB方法，提高了最高47%。",
    "tldr": "本文介绍了一种图书馆推荐系统，利用了来自异构数据源的数据，包括借阅记录和在线社交读者的反馈和信息。研究发现，协同过滤（CF）方法优于基于内容的（CB）方法，可以提高推荐系统的性能达到47%。",
    "en_tdlr": "This paper presents a recommendation system for libraries, utilizing data from heterogeneous sources including loan records and online social community of readers. Collaborative Filtering (CF) approach outperforms Content Based (CB) approach, improving the recommendation system performance by up to 47%."
}