{
    "title": "Improving Perceptual Quality, Intelligibility, and Acoustics on VoIP Platforms. (arXiv:2303.09048v1 [cs.SD])",
    "abstract": "In this paper, we present a method for fine-tuning models trained on the Deep Noise Suppression (DNS) 2020 Challenge to improve their performance on Voice over Internet Protocol (VoIP) applications. Our approach involves adapting the DNS 2020 models to the specific acoustic characteristics of VoIP communications, which includes distortion and artifacts caused by compression, transmission, and platform-specific processing. To this end, we propose a multi-task learning framework for VoIP-DNS that jointly optimizes noise suppression and VoIP-specific acoustics for speech enhancement. We evaluate our approach on a diverse VoIP scenarios and show that it outperforms both industry performance and state-of-the-art methods for speech enhancement on VoIP applications. Our results demonstrate the potential of models trained on DNS-2020 to be improved and tailored to different VoIP platforms using VoIP-DNS, whose findings have important applications in areas such as speech recognition, voice assi",
    "link": "http://arxiv.org/abs/2303.09048",
    "context": "Title: Improving Perceptual Quality, Intelligibility, and Acoustics on VoIP Platforms. (arXiv:2303.09048v1 [cs.SD])\nAbstract: In this paper, we present a method for fine-tuning models trained on the Deep Noise Suppression (DNS) 2020 Challenge to improve their performance on Voice over Internet Protocol (VoIP) applications. Our approach involves adapting the DNS 2020 models to the specific acoustic characteristics of VoIP communications, which includes distortion and artifacts caused by compression, transmission, and platform-specific processing. To this end, we propose a multi-task learning framework for VoIP-DNS that jointly optimizes noise suppression and VoIP-specific acoustics for speech enhancement. We evaluate our approach on a diverse VoIP scenarios and show that it outperforms both industry performance and state-of-the-art methods for speech enhancement on VoIP applications. Our results demonstrate the potential of models trained on DNS-2020 to be improved and tailored to different VoIP platforms using VoIP-DNS, whose findings have important applications in areas such as speech recognition, voice assi",
    "path": "papers/23/03/2303.09048.json",
    "total_tokens": 933,
    "translated_title": "在VoIP平台上提高知觉质量、可懂度和声学表现",
    "translated_abstract": "本文提出了一种方法，通过调整Deep Noise Suppression (DNS) 2020 Challenge模型在VoIP应用中的表现来提高其性能。我们的方法涉及将DNS 2020模型适应于VoIP通信的特定声学特征，包括因压缩、传输和平台特定处理而引起的失真和伪影。为此，我们提出了一种针对语音增强的VoIP-DNS多任务学习框架，共同优化降噪和VoIP特定的声学表现。我们在各种VoIP场景下评估了我们的方法，并表明它在VoIP应用的语音增强方面优于行业性能和最先进的方法。我们的结果证明了利用VoIP-DNS能够提高和定制DNS-2020训练的模型在不同的VoIP平台上的潜力，这项发现在语音识别、语音助理等领域有重要的应用。",
    "tldr": "本文提出一种基于VoIP通信平台进行DNS模型微调的方法，提高其在语音增强方面的性能。这种多任务学习框架能够将噪声抑制和VoIP特有的声学特征相结合，优于行业性能和最先进的方法。"
}