{
    "title": "How Much Should We Trust Instrumental Variable Estimates in Political Science? Practical Advice Based on Over 60 Replicated Studies. (arXiv:2303.11399v1 [econ.EM])",
    "abstract": "Instrumental variable (IV) strategies are widely used in political science to establish causal relationships. However, the identifying assumptions required by an IV design are demanding, and it remains challenging for researchers to assess their validity. In this paper, we replicate 67 papers published in three top journals in political science during 2010-2022 and identify several troubling patterns. First, researchers often overestimate the strength of their IVs due to non-i.i.d. errors, such as a clustering structure. Second, the most commonly used t-test for the two-stage-least-squares (2SLS) estimates often severely underestimates uncertainty. Using more robust inferential methods, we find that around 19-30% of the 2SLS estimates in our sample are underpowered. Third, in the majority of the replicated studies, the 2SLS estimates are much larger than the ordinary-least-squares estimates, and their ratio is negatively correlated with the strength of the IVs in studies where the IVs ",
    "link": "http://arxiv.org/abs/2303.11399",
    "context": "Title: How Much Should We Trust Instrumental Variable Estimates in Political Science? Practical Advice Based on Over 60 Replicated Studies. (arXiv:2303.11399v1 [econ.EM])\nAbstract: Instrumental variable (IV) strategies are widely used in political science to establish causal relationships. However, the identifying assumptions required by an IV design are demanding, and it remains challenging for researchers to assess their validity. In this paper, we replicate 67 papers published in three top journals in political science during 2010-2022 and identify several troubling patterns. First, researchers often overestimate the strength of their IVs due to non-i.i.d. errors, such as a clustering structure. Second, the most commonly used t-test for the two-stage-least-squares (2SLS) estimates often severely underestimates uncertainty. Using more robust inferential methods, we find that around 19-30% of the 2SLS estimates in our sample are underpowered. Third, in the majority of the replicated studies, the 2SLS estimates are much larger than the ordinary-least-squares estimates, and their ratio is negatively correlated with the strength of the IVs in studies where the IVs ",
    "path": "papers/23/03/2303.11399.json",
    "total_tokens": 1003,
    "translated_title": "政治学中的工具变量估计：我们应该相信多少？基于60多个复制研究的实用建议",
    "translated_abstract": "工具变量（IV）策略被广泛用于政治学中建立因果关系，但是其所需的识别假设很苛刻，研究人员评估其有效性仍然具有挑战性。本文复制了2010-2022年期间在政治学三个顶级期刊上发表的67篇论文，并发现了一些令人不安的模式。我们发现，研究人员经常由于非独立同分布误差（如聚类结构）而高估其IV的强度。同时，两阶段最小二乘法（2SLS）估计最常用的t检验（t-test）通常严重低估不确定性。而采用更强健的推断方法，我们发现在样本中约19-30％的2SLS估计是无法达到统计功效的。此外，大多数复制研究中，2SLS估计值远大于普通最小二乘估计值，其比值与IV强度呈负相关。",
    "tldr": "工具变量策略广泛应用于政治学中，但是识别假设苛刻，本文复制了67篇论文发现，研究人员往往高估IV的强度，并且2SLS估计值存在一定的不确定性，同时其估计值也往往比普通最小二乘法大许多，值得注意。"
}