{
    "title": "Toward Data-Driven Glare Classification and Prediction for Marine Megafauna Survey. (arXiv:2303.12730v1 [cs.CV])",
    "abstract": "Critically endangered species in Canadian North Atlantic waters are systematically surveyed to estimate species populations which influence governing policies. Due to its impact on policy, population accuracy is important. This paper lays the foundation towards a data-driven glare modelling system, which will allow surveyors to preemptively minimize glare. Surveyors use a detection function to estimate megafauna populations which are not explicitly seen. A goal of the research is to maximize useful imagery collected, to that end we will use our glare model to predict glare and optimize for glare-free data collection. To build this model, we leverage a small labelled dataset to perform semi-supervised learning. The large dataset is labelled with a Cascading Random Forest Model using a na\\\"ive pseudo-labelling approach. A reflectance model is used, which pinpoints features of interest, to populate our datasets which allows for context-aware machine learning models. The pseudo-labelled da",
    "link": "http://arxiv.org/abs/2303.12730",
    "context": "Title: Toward Data-Driven Glare Classification and Prediction for Marine Megafauna Survey. (arXiv:2303.12730v1 [cs.CV])\nAbstract: Critically endangered species in Canadian North Atlantic waters are systematically surveyed to estimate species populations which influence governing policies. Due to its impact on policy, population accuracy is important. This paper lays the foundation towards a data-driven glare modelling system, which will allow surveyors to preemptively minimize glare. Surveyors use a detection function to estimate megafauna populations which are not explicitly seen. A goal of the research is to maximize useful imagery collected, to that end we will use our glare model to predict glare and optimize for glare-free data collection. To build this model, we leverage a small labelled dataset to perform semi-supervised learning. The large dataset is labelled with a Cascading Random Forest Model using a na\\\"ive pseudo-labelling approach. A reflectance model is used, which pinpoints features of interest, to populate our datasets which allows for context-aware machine learning models. The pseudo-labelled da",
    "path": "papers/23/03/2303.12730.json",
    "total_tokens": 837,
    "translated_title": "面向数据驱动的海洋大型动物调查中的耀斑分类和预测",
    "translated_abstract": "为了估计物种数量，加拿大北大西洋水域的濒危物种进行系统调查，并影响着政策。本文针对数据驱动的耀斑建模系统进行了基础建设，这将允许调查员预先最小化耀斑。调查员使用检测函数估计未明显看到的巨型动物种群。研究的一个目标是最大限度地利用有用的图像来收集数据，为此，我们将使用耀斑模型预测耀斑并优化无耀斑数据的收集。为构建此模型，我们利用小型标记数据集进行半监督学习。大型数据集使用自然伪标签方法使用级联随机森林模型进行标记。使用反射率模型，以确定感兴趣的特征，填充我们的数据集，从而可以进行上下文感知的机器学习模型。",
    "tldr": "本文针对数据驱动的耀斑建模系统进行了基础建设，允许调查员预先最小化耀斑并最大限度地利用有用的图像来收集数据。",
    "en_tdlr": "This paper lays the foundation towards a data-driven glare modelling system, which allows surveyors to preemptively minimize glare and maximize useful imagery collected."
}