{
    "title": "Robust Social Welfare Maximization via Information Design in Linear-Quadratic-Gaussian Games. (arXiv:2303.05489v2 [math.OC] UPDATED)",
    "abstract": "Information design in an incomplete information game includes a designer with the goal of influencing players' actions through signals generated from a designed probability distribution so that its objective function is optimized. We consider a setting in which the designer has partial knowledge on agents' utilities. We address the uncertainty about players' preferences by formulating a robust information design problem against worst case payoffs. If the players have quadratic payoffs that depend on the players' actions and an unknown payoff-relevant state, and signals on the state that follow a Gaussian distribution conditional on the state realization, then the information design problem under quadratic design objectives is a semidefinite program (SDP). Specifically, we consider ellipsoid perturbations over payoff coefficients in linear-quadratic-Gaussian (LQG) games. We show that this leads to a tractable robust SDP formulation. Numerical studies are carried out to identify the rela",
    "link": "http://arxiv.org/abs/2303.05489",
    "context": "Title: Robust Social Welfare Maximization via Information Design in Linear-Quadratic-Gaussian Games. (arXiv:2303.05489v2 [math.OC] UPDATED)\nAbstract: Information design in an incomplete information game includes a designer with the goal of influencing players' actions through signals generated from a designed probability distribution so that its objective function is optimized. We consider a setting in which the designer has partial knowledge on agents' utilities. We address the uncertainty about players' preferences by formulating a robust information design problem against worst case payoffs. If the players have quadratic payoffs that depend on the players' actions and an unknown payoff-relevant state, and signals on the state that follow a Gaussian distribution conditional on the state realization, then the information design problem under quadratic design objectives is a semidefinite program (SDP). Specifically, we consider ellipsoid perturbations over payoff coefficients in linear-quadratic-Gaussian (LQG) games. We show that this leads to a tractable robust SDP formulation. Numerical studies are carried out to identify the rela",
    "path": "papers/23/03/2303.05489.json",
    "total_tokens": 852,
    "translated_title": "通过信息设计实现线性二次高斯博弈中的稳健社会福利最大化",
    "translated_abstract": "不完全信息博弈中的信息设计包括一个旨在通过从设计的概率分布中生成的信号来影响玩家行为的设计师，以使其目标函数被优化。我们考虑一个设计者具有部分对代理人效用的知识的情况。我们通过针对最坏情况支付来解决有关玩家偏好的不确定性，制定一个稳健的信息设计问题。如果玩家具有依赖于玩家动作和未知的与支付相关的状态的二次支付，以及在状态实现的条件下遵循高斯分布的状态信号，则在二次设计目标下的信息设计问题是一个半定规划（SDP）。具体而言，我们考虑线性二次高斯（LQG）游戏中的支付系数上的椭球体扰动。我们展示了这导致一个可处理的稳健SDP公式。进行了数值研究以确定关系",
    "tldr": "该论文研究了一个设计者具有部分对代理人效用的知识的情况下，如何通过信息设计来实现线性二次高斯博弈中的稳健社会福利最大化。"
}