{
    "title": "A Bi-LSTM Autoencoder Framework for Anomaly Detection -- A Case Study of a Wind Power Dataset. (arXiv:2303.09703v1 [cs.LG])",
    "abstract": "Anomalies refer to data points or events that deviate from normal and homogeneous events, which can include fraudulent activities, network infiltrations, equipment malfunctions, process changes, or other significant but infrequent events. Prompt detection of such events can prevent potential losses in terms of finances, information, and human resources. With the advancement of computational capabilities and the availability of large datasets, anomaly detection has become a major area of research. Among these, anomaly detection in time series has gained more attention recently due to the added complexity imposed by the time dimension. This study presents a novel framework for time series anomaly detection using a combination of Bidirectional Long Short Term Memory (Bi-LSTM) architecture and Autoencoder. The Bi-LSTM network, which comprises two unidirectional LSTM networks, can analyze the time series data from both directions and thus effectively discover the long-term dependencies hidd",
    "link": "http://arxiv.org/abs/2303.09703",
    "context": "Title: A Bi-LSTM Autoencoder Framework for Anomaly Detection -- A Case Study of a Wind Power Dataset. (arXiv:2303.09703v1 [cs.LG])\nAbstract: Anomalies refer to data points or events that deviate from normal and homogeneous events, which can include fraudulent activities, network infiltrations, equipment malfunctions, process changes, or other significant but infrequent events. Prompt detection of such events can prevent potential losses in terms of finances, information, and human resources. With the advancement of computational capabilities and the availability of large datasets, anomaly detection has become a major area of research. Among these, anomaly detection in time series has gained more attention recently due to the added complexity imposed by the time dimension. This study presents a novel framework for time series anomaly detection using a combination of Bidirectional Long Short Term Memory (Bi-LSTM) architecture and Autoencoder. The Bi-LSTM network, which comprises two unidirectional LSTM networks, can analyze the time series data from both directions and thus effectively discover the long-term dependencies hidd",
    "path": "papers/23/03/2303.09703.json",
    "total_tokens": 845,
    "translated_title": "一种用于异常检测的双向LSTM自编码器框架——以风能数据集为案例研究",
    "translated_abstract": "异常指偏离正常和均一事件的数据点或事件，包括欺诈活动、网络渗透、设备故障、工艺变化或其他重要但不频繁发生的事件。及时发现此类事件可以避免潜在的财务、信息和人力资源损失。随着计算能力的提高和大规模数据集的可用性，异常检测已成为一个重要的研究领域。其中，时间序列的异常检测由于时间维度带来的额外复杂性而最近受到更多关注。本研究提出了一种新的时间序列异常检测框架，利用双向长短时记忆(Bi-LSTM)结构和自编码器的组合。Bi-LSTM网络由两个单向LSTM网络组成，可以从两个方向分析时间序列数据，从而有效地发现隐藏的长期依赖关系。",
    "tldr": "本文提出了一种双向LSTM自编码器框架用于发现时间序列数据中的异常，可以从两个方向发现隐藏的长期依赖关系。",
    "en_tdlr": "This paper presents a Bi-LSTM autoencoder framework for anomaly detection in time series data, which can effectively discover the hidden long-term dependencies by analyzing the data from both directions."
}