{
    "title": "Efficient Neural Generation of 4K Masks for Homogeneous Diffusion Inpainting. (arXiv:2303.10096v1 [eess.IV])",
    "abstract": "With well-selected data, homogeneous diffusion inpainting can reconstruct images from sparse data with high quality. While 4K colour images of size 3840 x 2160 can already be inpainted in real time, optimising the known data for applications like image compression remains challenging: Widely used stochastic strategies can take days for a single 4K image. Recently, a first neural approach for this so-called mask optimisation problem offered high speed and good quality for small images. It trains a mask generation network with the help of a neural inpainting surrogate. However, these mask networks can only output masks for the resolution and mask density they were trained for. We solve these problems and enable mask optimisation for high-resolution images through a neuroexplicit coarse-to-fine strategy. Additionally, we improve the training and interpretability of mask networks by including a numerical inpainting solver directly into the network. This allows to generate masks for 4K imag",
    "link": "http://arxiv.org/abs/2303.10096",
    "context": "Title: Efficient Neural Generation of 4K Masks for Homogeneous Diffusion Inpainting. (arXiv:2303.10096v1 [eess.IV])\nAbstract: With well-selected data, homogeneous diffusion inpainting can reconstruct images from sparse data with high quality. While 4K colour images of size 3840 x 2160 can already be inpainted in real time, optimising the known data for applications like image compression remains challenging: Widely used stochastic strategies can take days for a single 4K image. Recently, a first neural approach for this so-called mask optimisation problem offered high speed and good quality for small images. It trains a mask generation network with the help of a neural inpainting surrogate. However, these mask networks can only output masks for the resolution and mask density they were trained for. We solve these problems and enable mask optimisation for high-resolution images through a neuroexplicit coarse-to-fine strategy. Additionally, we improve the training and interpretability of mask networks by including a numerical inpainting solver directly into the network. This allows to generate masks for 4K imag",
    "path": "papers/23/03/2303.10096.json",
    "total_tokens": 924,
    "translated_title": "高效生成4K掩膜用于齐次扩散修复",
    "translated_abstract": "利用优选数据，齐次扩散修复可以重建具有高质量的稀疏数据图像。虽然大小为3840 x 2160的4K彩色图像可以实时修复，但优化已知数据以用于图像压缩等应用仍然具有挑战性：广泛使用的随机策略可能需要数天才能处理单个4K图像。最近，第一个针对这个所谓的掩膜优化问题的神经方法通过神经修复代理帮助训练掩膜生成网络，提供了高速度和良好质量的小型图像。但是，这些掩膜网络只能在它们训练的分辨率和掩膜密度下输出掩膜。我们通过一种神经-显式的自粗到细的策略解决了这些问题，并实现了高分辨率图像的掩膜优化。此外，我们通过直接将数值修复求解器纳入网络中来改进掩膜网络的训练和可解释性。这使得能够在短短几秒钟内生成高质量的4K图像掩膜。",
    "tldr": "该论文提出了一种高效生成4K掩膜的神经网络方法，可以实现对高分辨率图像进行快速且高质量的修复。",
    "en_tdlr": "The paper proposes an efficient neural network method for generating 4K masks, which enables fast and high-quality inpainting of high-resolution images."
}