{
    "title": "A Multimodal Data-driven Framework for Anxiety Screening. (arXiv:2303.09041v1 [cs.LG])",
    "abstract": "Early screening for anxiety and appropriate interventions are essential to reduce the incidence of self-harm and suicide in patients. Due to limited medical resources, traditional methods that overly rely on physician expertise and specialized equipment cannot simultaneously meet the needs for high accuracy and model interpretability. Multimodal data can provide more objective evidence for anxiety screening to improve the accuracy of models. The large amount of noise in multimodal data and the unbalanced nature of the data make the model prone to overfitting. However, it is a non-differentiable problem when high-dimensional and multimodal feature combinations are used as model inputs and incorporated into model training. This causes existing anxiety screening methods based on machine learning and deep learning to be inapplicable. Therefore, we propose a multimodal data-driven anxiety screening framework, namely MMD-AS, and conduct experiments on the collected health data of over 200 se",
    "link": "http://arxiv.org/abs/2303.09041",
    "context": "Title: A Multimodal Data-driven Framework for Anxiety Screening. (arXiv:2303.09041v1 [cs.LG])\nAbstract: Early screening for anxiety and appropriate interventions are essential to reduce the incidence of self-harm and suicide in patients. Due to limited medical resources, traditional methods that overly rely on physician expertise and specialized equipment cannot simultaneously meet the needs for high accuracy and model interpretability. Multimodal data can provide more objective evidence for anxiety screening to improve the accuracy of models. The large amount of noise in multimodal data and the unbalanced nature of the data make the model prone to overfitting. However, it is a non-differentiable problem when high-dimensional and multimodal feature combinations are used as model inputs and incorporated into model training. This causes existing anxiety screening methods based on machine learning and deep learning to be inapplicable. Therefore, we propose a multimodal data-driven anxiety screening framework, namely MMD-AS, and conduct experiments on the collected health data of over 200 se",
    "path": "papers/23/03/2303.09041.json",
    "total_tokens": 729,
    "translated_title": "一种基于多模态数据驱动的焦虑筛查框架",
    "translated_abstract": "针对焦虑筛查的需求，传统的方法往往通过专业的设备及医生的经验和判断力，但由于资源的有限性，无法同时满足高准确性和模型可解释性的需求。而多模态数据可以提供更客观的数据，以提高模型的准确性。但是由于多模态数据中存在大量的噪音，同时数据不平衡问题也容易导致过拟合。这使得现有基于机器学习和深度学习的焦虑筛查方法难以应用。 因此，我们提出了一种基于多模态数据驱动的焦虑筛查框架，即MMD-AS，并在收集了200个患者的健康数据上进行了实验。",
    "tldr": "提出了一种基于多模态数据驱动的焦虑筛查框架（MMD-AS），可以提高模型准确性。"
}