{
    "title": "Validation of uncertainty quantification metrics: a primer based on the consistency and adaptivity concepts. (arXiv:2303.07170v2 [physics.chem-ph] UPDATED)",
    "abstract": "The practice of uncertainty quantification (UQ) validation, notably in machine learning for the physico-chemical sciences, rests on several graphical methods (scattering plots, calibration curves, reliability diagrams and confidence curves) which explore complementary aspects of calibration, without covering all the desirable ones. For instance, none of these methods deals with the reliability of UQ metrics across the range of input features (adaptivity). Based on the complementary concepts of consistency and adaptivity, the toolbox of common validation methods for variance- and intervals- based UQ metrics is revisited with the aim to provide a better grasp on their capabilities. This study is conceived as an introduction to UQ validation, and all methods are derived from a few basic rules. The methods are illustrated and tested on synthetic datasets and representative examples extracted from the recent physico-chemical machine learning UQ literature.",
    "link": "http://arxiv.org/abs/2303.07170",
    "context": "Title: Validation of uncertainty quantification metrics: a primer based on the consistency and adaptivity concepts. (arXiv:2303.07170v2 [physics.chem-ph] UPDATED)\nAbstract: The practice of uncertainty quantification (UQ) validation, notably in machine learning for the physico-chemical sciences, rests on several graphical methods (scattering plots, calibration curves, reliability diagrams and confidence curves) which explore complementary aspects of calibration, without covering all the desirable ones. For instance, none of these methods deals with the reliability of UQ metrics across the range of input features (adaptivity). Based on the complementary concepts of consistency and adaptivity, the toolbox of common validation methods for variance- and intervals- based UQ metrics is revisited with the aim to provide a better grasp on their capabilities. This study is conceived as an introduction to UQ validation, and all methods are derived from a few basic rules. The methods are illustrated and tested on synthetic datasets and representative examples extracted from the recent physico-chemical machine learning UQ literature.",
    "path": "papers/23/03/2303.07170.json",
    "total_tokens": 852,
    "translated_title": "基于一致性和适应性概念的不确定性量化度量的验证：一个入门指南。",
    "translated_abstract": "不确定性量化（UQ）验证的实践，尤其是在物理化学科学的机器学习中，依赖于几种图形方法（散点图、校准曲线、可靠性图和置信曲线），这些图形方法探索校准的互补方面，但有些方面并没有得到很好的探索。例如，这些方法中没有一种涉及到UQ度量在输入特征范围内的可靠性（适应性）。基于一致性和适应性的互补概念，重新审视了基于方差和间隔的UQ度量的常见验证方法，旨在提供更好的理解它们的能力。本研究旨在介绍UQ验证，并从几个基本规则中导出所有方法。这些方法在合成数据集和从最近的物理化学机器学习UQ文献中提取的代表性示例上进行了说明和测试。",
    "tldr": "本文介绍了一种基于一致性和适应性概念的UQ度量验证方法，通过重新审视已有的方法，提高了对UQ度量能力的理解。",
    "en_tdlr": "This paper introduces a validation method for UQ metrics based on the concepts of consistency and adaptivity, which improves the understanding of the capabilities of UQ metrics by revisiting existing methods."
}