{
    "title": "Cross-domain Sentiment Classification in Spanish. (arXiv:2303.08985v1 [cs.CL])",
    "abstract": "Sentiment Classification is a fundamental task in the field of Natural Language Processing, and has very important academic and commercial applications. It aims to automatically predict the degree of sentiment present in a text that contains opinions and subjectivity at some level, like product and movie reviews, or tweets. This can be really difficult to accomplish, in part, because different domains of text contains different words and expressions. In addition, this difficulty increases when text is written in a non-English language due to the lack of databases and resources. As a consequence, several cross-domain and cross-language techniques are often applied to this task in order to improve the results. In this work we perform a study on the ability of a classification system trained with a large database of product reviews to generalize to different Spanish domains. Reviews were collected from the MercadoLibre website from seven Latin American countries, allowing the creation of ",
    "link": "http://arxiv.org/abs/2303.08985",
    "context": "Title: Cross-domain Sentiment Classification in Spanish. (arXiv:2303.08985v1 [cs.CL])\nAbstract: Sentiment Classification is a fundamental task in the field of Natural Language Processing, and has very important academic and commercial applications. It aims to automatically predict the degree of sentiment present in a text that contains opinions and subjectivity at some level, like product and movie reviews, or tweets. This can be really difficult to accomplish, in part, because different domains of text contains different words and expressions. In addition, this difficulty increases when text is written in a non-English language due to the lack of databases and resources. As a consequence, several cross-domain and cross-language techniques are often applied to this task in order to improve the results. In this work we perform a study on the ability of a classification system trained with a large database of product reviews to generalize to different Spanish domains. Reviews were collected from the MercadoLibre website from seven Latin American countries, allowing the creation of ",
    "path": "papers/23/03/2303.08985.json",
    "total_tokens": 764,
    "translated_title": "跨领域西班牙语情感分类研究",
    "translated_abstract": "情感分类是自然语言处理领域中的一项基础任务，具有重要的学术和商业应用。其目的是自动预测包含观点和主观性的文本中存在的情感程度，例如产品和电影评论或推文。然而，由于不同领域的文本包含不同的词语和表达，因此跨领域和跨语言技术经常被应用于该任务以改善结果，而且由于缺乏数据库和资源，使用非英语语言的文本难度更大。因此，本研究旨在对使用大型产品评论数据库训练的分类系统在不同的西班牙语领域中的泛化能力进行研究。",
    "tldr": "本研究旨在研究使用跨领域技术将大型产品评论数据库的分类系统训练，以适用于不同的西班牙语领域的能力。",
    "en_tdlr": "This paper studies the ability of a cross-domain sentiment classification system trained with a large database of product reviews to generalize to different Spanish domains using cross-domain techniques."
}