{
    "title": "Edge Ranking of Graphs in Transportation Networks using a Graph Neural Network (GNN). (arXiv:2303.17485v1 [cs.SI])",
    "abstract": "Many networks, such as transportation, power, and water distribution, can be represented as graphs. Crucial challenge in graph representations is identifying the importance of graph edges and their influence on overall network efficiency and information flow performance. For example, important edges in a transportation network are those roads that, when affected, will significantly alter the network's overall efficiency. Commonly used approach to finding such important edges is ``edge betweenness centrality'' (EBC), an edge ranking measure to determine the influential edges of the graph based on connectivity and information spread. Computing the EBC utilizing the common Brandes algorithm involves calculating the shortest paths for every node pair, which can be computationally expensive and restrictive, especially for large graphs. Changes in the graph parameters, e.g., in the edge weight or the addition and deletion of nodes or edges, require the recalculation of the EBC. As the main c",
    "link": "http://arxiv.org/abs/2303.17485",
    "context": "Title: Edge Ranking of Graphs in Transportation Networks using a Graph Neural Network (GNN). (arXiv:2303.17485v1 [cs.SI])\nAbstract: Many networks, such as transportation, power, and water distribution, can be represented as graphs. Crucial challenge in graph representations is identifying the importance of graph edges and their influence on overall network efficiency and information flow performance. For example, important edges in a transportation network are those roads that, when affected, will significantly alter the network's overall efficiency. Commonly used approach to finding such important edges is ``edge betweenness centrality'' (EBC), an edge ranking measure to determine the influential edges of the graph based on connectivity and information spread. Computing the EBC utilizing the common Brandes algorithm involves calculating the shortest paths for every node pair, which can be computationally expensive and restrictive, especially for large graphs. Changes in the graph parameters, e.g., in the edge weight or the addition and deletion of nodes or edges, require the recalculation of the EBC. As the main c",
    "path": "papers/23/03/2303.17485.json",
    "total_tokens": 1065,
    "translated_title": "利用图神经网络对交通网络中的图进行边缘评级",
    "translated_abstract": "许多网络，例如交通、电力和供水分布，都可以表示为图形。在图形表示中的一个关键挑战是确定图形边缘的重要性及其对整体网络效率和信息流性能的影响。例如，交通网络中的重要边缘是受影响时会显著改变网络整体效率的道路。找到这样重要的边缘的常用方法是“边缘介数中心度”（EBC），一种基于连通性和信息传播确定图的有影响力边缘的边缘排序度量。使用常见的Brandes算法计算EBC涉及计算每个节点对的最短路径，这可能会在计算和限制大型图形时耗费大量计算资源。图形参数的更改，例如边缘权重或节点或边缘的添加和删除，需要重新计算EBC。作为本文的主要贡献，我们提出了一种使用图神经网络（GNN）对交通网络的边缘进行评分的新方法。我们的方法能够快速准确地识别网络中的边缘重要性，并且不必为每个边缘对计算EBC。在实验中，我们的方法在真实和合成数据集上的表现均优于EBC方法，无论是在精度还是效率上。",
    "tldr": "本文提出了一种使用图神经网络对交通网络中边缘进行评级的新方法，可以快速准确地确定网络中的重要边缘，而无需计算每个边缘对的边缘介数中心度。",
    "en_tdlr": "This paper proposes a novel method to rank edges of a transportation network using a Graph Neural Network (GNN), able to accurately identify the importance of edges in the network without calculating the edge betweenness centrality for every edge pair, and outperforming the traditional approach in accuracy and efficiency."
}