{
    "title": "LEAPT: Learning Adaptive Prefix-to-prefix Translation For Simultaneous Machine Translation. (arXiv:2303.11750v1 [cs.CL])",
    "abstract": "Simultaneous machine translation, which aims at a real-time translation, is useful in many live scenarios but very challenging due to the trade-off between accuracy and latency. To achieve the balance for both, the model needs to wait for appropriate streaming text (READ policy) and then generates its translation (WRITE policy). However, WRITE policies of previous work either are specific to the method itself due to the end-to-end training or suffer from the input mismatch between training and decoding for the non-end-to-end training. Therefore, it is essential to learn a generic and better WRITE policy for simultaneous machine translation. Inspired by strategies utilized by human interpreters and \"wait\" policies, we propose a novel adaptive prefix-to-prefix training policy called LEAPT, which allows our machine translation model to learn how to translate source sentence prefixes and make use of the future context. Experiments show that our proposed methods greatly outperform competiti",
    "link": "http://arxiv.org/abs/2303.11750",
    "context": "Title: LEAPT: Learning Adaptive Prefix-to-prefix Translation For Simultaneous Machine Translation. (arXiv:2303.11750v1 [cs.CL])\nAbstract: Simultaneous machine translation, which aims at a real-time translation, is useful in many live scenarios but very challenging due to the trade-off between accuracy and latency. To achieve the balance for both, the model needs to wait for appropriate streaming text (READ policy) and then generates its translation (WRITE policy). However, WRITE policies of previous work either are specific to the method itself due to the end-to-end training or suffer from the input mismatch between training and decoding for the non-end-to-end training. Therefore, it is essential to learn a generic and better WRITE policy for simultaneous machine translation. Inspired by strategies utilized by human interpreters and \"wait\" policies, we propose a novel adaptive prefix-to-prefix training policy called LEAPT, which allows our machine translation model to learn how to translate source sentence prefixes and make use of the future context. Experiments show that our proposed methods greatly outperform competiti",
    "path": "papers/23/03/2303.11750.json",
    "total_tokens": 1016,
    "translated_title": "LEAPT: 学习适应性前缀到前缀翻译以进行同声机器翻译",
    "translated_abstract": "同声机器翻译旨在实现实时翻译，在许多现场应用中非常有用，但由于准确性与延迟之间的权衡而非常具有挑战性。为了在精度与延迟之间取得平衡，模型需要等待适当的流式文本（读取策略），然后生成翻译（写入策略）。然而，之前工作的写入策略要么由于端到端训练而对该方法本身具有特异性，要么由于非端到端训练的输入不匹配而受到影响。因此，学习同声机器翻译的通用且更好的写入策略至关重要。本研究受人类口译者及“等待”策略的启发，提出了一种名为LEAPT的新的自适应前缀到前缀训练策略，使我们的机器翻译模型能够学习如何翻译源句子前缀并利用未来的上下文。实验证明，在不同水平噪声和不同流式文本长度的情况下，我们的方法表现优于竞争模型，精度与延迟均得到了提高。",
    "tldr": "LEAPT提出了一种自适应前缀到前缀训练策略，使机器翻译模型能够更好地进行同声翻译，实验表明其在各种参数设置下均具有较好的表现。",
    "en_tdlr": "LEAPT proposes an adaptive prefix-to-prefix training policy for simultaneous machine translation, which allows machine translation model to better learn how to translate source sentence prefixes and make use of the future context. Experimental results show that LEAPT outperforms competitive models in terms of both accuracy and latency under various noise levels and streaming text lengths."
}