{
    "title": "SiamTHN: Siamese Target Highlight Network for Visual Tracking. (arXiv:2303.12304v1 [cs.CV])",
    "abstract": "Siamese network based trackers develop rapidly in the field of visual object tracking in recent years. The majority of siamese network based trackers now in use treat each channel in the feature maps generated by the backbone network equally, making the similarity response map sensitive to background influence and hence challenging to focus on the target region. Additionally, there are no structural links between the classification and regression branches in these trackers, and the two branches are optimized separately during training. Therefore, there is a misalignment between the classification and regression branches, which results in less accurate tracking results. In this paper, a Target Highlight Module is proposed to help the generated similarity response maps to be more focused on the target region. To reduce the misalignment and produce more precise tracking results, we propose a corrective loss to train the model. The two branches of the model are jointly tuned with the use o",
    "link": "http://arxiv.org/abs/2303.12304",
    "context": "Title: SiamTHN: Siamese Target Highlight Network for Visual Tracking. (arXiv:2303.12304v1 [cs.CV])\nAbstract: Siamese network based trackers develop rapidly in the field of visual object tracking in recent years. The majority of siamese network based trackers now in use treat each channel in the feature maps generated by the backbone network equally, making the similarity response map sensitive to background influence and hence challenging to focus on the target region. Additionally, there are no structural links between the classification and regression branches in these trackers, and the two branches are optimized separately during training. Therefore, there is a misalignment between the classification and regression branches, which results in less accurate tracking results. In this paper, a Target Highlight Module is proposed to help the generated similarity response maps to be more focused on the target region. To reduce the misalignment and produce more precise tracking results, we propose a corrective loss to train the model. The two branches of the model are jointly tuned with the use o",
    "path": "papers/23/03/2303.12304.json",
    "total_tokens": 1053,
    "translated_title": "SiamTHN：Siamese目标突出网络用于视觉跟踪",
    "translated_abstract": "最近，基于孪生网络的跟踪器在视觉目标跟踪领域迅速发展。现在大多数使用的孪生网络跟踪器将由主干网络生成的特征图中的每个通道平等处理，这使得相似性响应图对背景影响敏感，因此难以集中在目标区域。此外，这些跟踪器的分类和回归分支之间没有结构链接，两个分支在训练期间独立优化。因此，分类和回归分支之间存在不对齐，导致跟踪结果不够精确。为了帮助生成的相似性响应图更加集中在目标区域，本文提出了一个目标突出模块。为了减少不对齐并产生更精确的跟踪结果，我们提出了一种校正损失来训练模型。使用这个校正损失，我们共同调整了模型的两个分支，使它们的结构更好地匹配。实验结果表明，所提出的SiamTHN跟踪器在多个跟踪基准测试，如VOT2018、VOT2019和LaSOT上均取得了最新的性能。",
    "tldr": "本文提出了SiamTHN跟踪器，使用目标突出模块帮助相似性响应图集中在目标区域，使用校正损失进一步提高模型的精度，取得了在多个基准测试上的最新性能。",
    "en_tdlr": "The paper proposes the SiamTHN tracker, which uses a Target Highlight Module to help the generated similarity response maps focus on the target region, and a corrective loss to reduce the misalignment between the classification and regression branches and produce more precise tracking results. The proposed tracker achieves state-of-the-art performance on several tracking benchmarks, such as VOT2018, VOT2019 and LaSOT."
}