{
    "title": "HARDC : A novel ECG-based heartbeat classification method to detect arrhythmia using hierarchical attention based dual structured RNN with dilated CNN. (arXiv:2303.06020v1 [eess.SP])",
    "abstract": "In this paper have developed a novel hybrid hierarchical attention-based bidirectional recurrent neural network with dilated CNN (HARDC) method for arrhythmia classification. This solves problems that arise when traditional dilated convolutional neural network (CNN) models disregard the correlation between contexts and gradient dispersion. The proposed HARDC fully exploits the dilated CNN and bidirectional recurrent neural network unit (BiGRU-BiLSTM) architecture to generate fusion features. As a result of incorporating both local and global feature information and an attention mechanism, the model's performance for prediction is improved.By combining the fusion features with a dilated CNN and a hierarchical attention mechanism, the trained HARDC model showed significantly improved classification results and interpretability of feature extraction on the PhysioNet 2017 challenge dataset. Sequential Z-Score normalization, filtering, denoising, and segmentation are used to prepare the raw",
    "link": "http://arxiv.org/abs/2303.06020",
    "raw_ret": "{\n    \"translated_title\": \"HARDC：一种基于心电图的心跳分类方法，使用分层注意力双结构RNN和扩张CNN(arXiv：2303.06020v1 [eess.SP])\",\n    \"translated_abstract\": \"本文提出了一种新的混合分层注意力双向循环神经网络与扩张CNN（HARDC）方法用于心律失常分类。这解决了传统扩张卷积神经网络(CNN)模型忽略上下文之间的关联和梯度分散的问题。所提出的HARDC充分利用了扩张CNN和双向递归神经网络单元（BiGRU-BiLSTM）体系结构来生成融合特征。通过结合本地和全局特征信息和注意力机制，该模型的预测性能得到了提高。通过将融合特征与扩张CNN和分层注意力机制相结合，训练后的HARDC模型在PhysioNet 2017挑战数据集上表现出了明显的改进分类结果和特征提取的可解释性。使用连续Z-Score归一化、滤波、去噪和分段来准备原始数据。\",\n    \"tldr\": \"本文提出了一种新的心律失常分类方法，称为HARDC，通过利用扩张CNN和双向递归神经网络单元来生成融合特征，加上注意力机制，显著提高了模型的性能和可解释性。\"\n}<|im_sep|>",
    "total_tokens": 897,
    "ret": {
        "translated_title": "HARDC：一种基于心电图的心跳分类方法，使用分层注意力双结构RNN和扩张CNN(arXiv：2303.06020v1 [eess.SP])",
        "translated_abstract": "本文提出了一种新的混合分层注意力双向循环神经网络与扩张CNN（HARDC）方法用于心律失常分类。这解决了传统扩张卷积神经网络(CNN)模型忽略上下文之间的关联和梯度分散的问题。所提出的HARDC充分利用了扩张CNN和双向递归神经网络单元（BiGRU-BiLSTM）体系结构来生成融合特征。通过结合本地和全局特征信息和注意力机制，该模型的预测性能得到了提高。通过将融合特征与扩张CNN和分层注意力机制相结合，训练后的HARDC模型在PhysioNet 2017挑战数据集上表现出了明显的改进分类结果和特征提取的可解释性。使用连续Z-Score归一化、滤波、去噪和分段来准备原始数据。",
        "tldr": "本文提出了一种新的心律失常分类方法，称为HARDC，通过利用扩张CNN和双向递归神经网络单元来生成融合特征，加上注意力机制，显著提高了模型的性能和可解释性。"
    }
}