{
    "title": "Language Models Trained on Media Diets Can Predict Public Opinion. (arXiv:2303.16779v1 [cs.CL])",
    "abstract": "Public opinion reflects and shapes societal behavior, but the traditional survey-based tools to measure it are limited. We introduce a novel approach to probe media diet models -- language models adapted to online news, TV broadcast, or radio show content -- that can emulate the opinions of subpopulations that have consumed a set of media. To validate this method, we use as ground truth the opinions expressed in U.S. nationally representative surveys on COVID-19 and consumer confidence. Our studies indicate that this approach is (1) predictive of human judgements found in survey response distributions and robust to phrasing and channels of media exposure, (2) more accurate at modeling people who follow media more closely, and (3) aligned with literature on which types of opinions are affected by media consumption. Probing language models provides a powerful new method for investigating media effects, has practical applications in supplementing polls and forecasting public opinion, and ",
    "link": "http://arxiv.org/abs/2303.16779",
    "context": "Title: Language Models Trained on Media Diets Can Predict Public Opinion. (arXiv:2303.16779v1 [cs.CL])\nAbstract: Public opinion reflects and shapes societal behavior, but the traditional survey-based tools to measure it are limited. We introduce a novel approach to probe media diet models -- language models adapted to online news, TV broadcast, or radio show content -- that can emulate the opinions of subpopulations that have consumed a set of media. To validate this method, we use as ground truth the opinions expressed in U.S. nationally representative surveys on COVID-19 and consumer confidence. Our studies indicate that this approach is (1) predictive of human judgements found in survey response distributions and robust to phrasing and channels of media exposure, (2) more accurate at modeling people who follow media more closely, and (3) aligned with literature on which types of opinions are affected by media consumption. Probing language models provides a powerful new method for investigating media effects, has practical applications in supplementing polls and forecasting public opinion, and ",
    "path": "papers/23/03/2303.16779.json",
    "total_tokens": 953,
    "translated_title": "基于媒体偏好训练的语言模型可以预测公众舆论",
    "translated_abstract": "公众舆论反映和塑造社会行为，但传统的基于调查的工具存在局限性。我们介绍一种新的方法来探索媒体偏好模型——适用于在线新闻、电视广播或广播节目内容的语言模型，可以模拟已消费一组媒体的亚群体的意见。为了验证这种方法，我们使用美国全国代表性调查中针对COVID-19和消费者信心的观点表达作为基本事实。我们的研究表明，这种方法（1）可以预测调查响应分布中的人类判断，并且对措辞和媒体曝光渠道具有鲁棒性，（2）在建模更密切关注媒体的人方面更准确，（3）符合关于哪些类型的观点受媒体消费影响的文献。探测语言模型提供了一种强大的新方法来研究媒体效应，具有在补充调查和预测公众舆论方面的实际应用，也涉及解决与媒体偏见有关的问题。",
    "tldr": "该论文介绍了一种新的方法来探索媒体偏好模型——适用于在线新闻、电视广播或广播节目内容的语言模型，可以预测公众舆论并具有实际应用价值。",
    "en_tdlr": "This paper proposes a new approach to probe media diet models - language models adapted to online news, TV broadcast, or radio show content - that can predict public opinion and have practical applications in supplementing polls and forecasting public opinion."
}