{
    "title": "Foundation Models and Fair Use. (arXiv:2303.15715v1 [cs.CY] CROSS LISTED)",
    "abstract": "Existing foundation models are trained on copyrighted material. Deploying these models can pose both legal and ethical risks when data creators fail to receive appropriate attribution or compensation. In the United States and several other countries, copyrighted content may be used to build foundation models without incurring liability due to the fair use doctrine. However, there is a caveat: If the model produces output that is similar to copyrighted data, particularly in scenarios that affect the market of that data, fair use may no longer apply to the output of the model. In this work, we emphasize that fair use is not guaranteed, and additional work may be necessary to keep model development and deployment squarely in the realm of fair use. First, we survey the potential risks of developing and deploying foundation models based on copyrighted content. We review relevant U.S. case law, drawing parallels to existing and potential applications for generating text, source code, and vis",
    "link": "http://arxiv.org/abs/2303.15715",
    "context": "Title: Foundation Models and Fair Use. (arXiv:2303.15715v1 [cs.CY] CROSS LISTED)\nAbstract: Existing foundation models are trained on copyrighted material. Deploying these models can pose both legal and ethical risks when data creators fail to receive appropriate attribution or compensation. In the United States and several other countries, copyrighted content may be used to build foundation models without incurring liability due to the fair use doctrine. However, there is a caveat: If the model produces output that is similar to copyrighted data, particularly in scenarios that affect the market of that data, fair use may no longer apply to the output of the model. In this work, we emphasize that fair use is not guaranteed, and additional work may be necessary to keep model development and deployment squarely in the realm of fair use. First, we survey the potential risks of developing and deploying foundation models based on copyrighted content. We review relevant U.S. case law, drawing parallels to existing and potential applications for generating text, source code, and vis",
    "path": "papers/23/03/2303.15715.json",
    "total_tokens": 854,
    "translated_title": "基础模型与合理使用",
    "translated_abstract": "现有的基础模型是基于有版权的材料训练出来的。在数据创建者没有得到适当的归属或赔偿时部署这些模型可能带来法律和道德风险。在美国和其他几个国家，版权内容可能被用于构建基础模型而不会产生法律责任，这是因为合理使用原则的存在。但是需要注意的是，如果这些模型的输出产生了与版权数据相似的结果，尤其是在影响到这些数据市场的情况下，合理使用原则将不再适用于模型的输出。本文强调合理使用原则并不保证，可能需要进一步的工作才能确保模型的开发和部署在合理使用的范围内。首先，我们调查了基于有版权内容的开发和部署基础模型的潜在风险。我们回顾了相关的美国案例法，并类比生成文本、源代码和可视化等可能的应用。",
    "tldr": "基础模型开发和部署需确保在合理使用的范围内，但这并不保证。在使用有版权内容时需要注意风险并可能需要进一步的工作。",
    "en_tdlr": "Developing and deploying foundation models based on copyrighted content may pose legal and ethical risks, and fair use doctrine may not always apply. Additional work may be necessary to ensure compliance with fair use, and caution must be taken when using copyrighted material."
}