{
    "title": "Leveraging Pretrained Representations with Task-related Keywords for Alzheimer's Disease Detection. (arXiv:2303.08019v1 [eess.AS])",
    "abstract": "With the global population aging rapidly, Alzheimer's disease (AD) is particularly prominent in older adults, which has an insidious onset and leads to a gradual, irreversible deterioration in cognitive domains (memory, communication, etc.). Speech-based AD detection opens up the possibility of widespread screening and timely disease intervention. Recent advances in pre-trained models motivate AD detection modeling to shift from low-level features to high-level representations. This paper presents several efficient methods to extract better AD-related cues from high-level acoustic and linguistic features. Based on these features, the paper also proposes a novel task-oriented approach by modeling the relationship between the participants' description and the cognitive task. Experiments are carried out on the ADReSS dataset in a binary classification setup, and models are evaluated on the unseen test set. Results and comparison with recent literature demonstrate the efficiency and superi",
    "link": "http://arxiv.org/abs/2303.08019",
    "context": "Title: Leveraging Pretrained Representations with Task-related Keywords for Alzheimer's Disease Detection. (arXiv:2303.08019v1 [eess.AS])\nAbstract: With the global population aging rapidly, Alzheimer's disease (AD) is particularly prominent in older adults, which has an insidious onset and leads to a gradual, irreversible deterioration in cognitive domains (memory, communication, etc.). Speech-based AD detection opens up the possibility of widespread screening and timely disease intervention. Recent advances in pre-trained models motivate AD detection modeling to shift from low-level features to high-level representations. This paper presents several efficient methods to extract better AD-related cues from high-level acoustic and linguistic features. Based on these features, the paper also proposes a novel task-oriented approach by modeling the relationship between the participants' description and the cognitive task. Experiments are carried out on the ADReSS dataset in a binary classification setup, and models are evaluated on the unseen test set. Results and comparison with recent literature demonstrate the efficiency and superi",
    "path": "papers/23/03/2303.08019.json",
    "total_tokens": 842,
    "translated_title": "利用预训练表示和任务相关关键词进行阿尔茨海默病检测",
    "translated_abstract": "随着全球人口迅速老龄化，阿尔茨海默病（AD）在老年人中尤为突出，其具有隐匿性质，导致认知领域（记忆、交流等）逐渐不可逆转的恶化。基于语音的AD检测为广泛筛查和及时干预提供了可能性。预训练模型的最新进展推动AD检测建模从低层特征转向高层次表示。本文提出了几种有效的方法，从高层次的声学和语言特征中提取更好的AD相关线索。基于这些特征，本文还提出了一种新颖的任务导向方法，通过对参与者描述和认知任务之间的关系进行建模。实验在ADReSS数据集上进行二元分类设置，并在未见测试集上评估模型。结果及与最近文献的比较表明了效率和优越性。",
    "tldr": "本研究提出了一种利用高层次表示和任务相关关键词的方法来检测阿尔茨海默病，实验结果表明其具有较高的效率和优越性。",
    "en_tdlr": "This paper proposes a method to detect Alzheimer's disease using high-level representations and task-related keywords. The experimental results demonstrate its high efficiency and superiority."
}