{
    "title": "On the Trade-Off between Actionable Explanations and the Right to be Forgotten. (arXiv:2208.14137v3 [cs.LG] UPDATED)",
    "abstract": "As machine learning (ML) models are increasingly being deployed in high-stakes applications, policymakers have suggested tighter data protection regulations (e.g., GDPR, CCPA). One key principle is the \"right to be forgotten\" which gives users the right to have their data deleted. Another key principle is the right to an actionable explanation, also known as algorithmic recourse, allowing users to reverse unfavorable decisions. To date, it is unknown whether these two principles can be operationalized simultaneously. Therefore, we introduce and study the problem of recourse invalidation in the context of data deletion requests. More specifically, we theoretically and empirically analyze the behavior of popular state-of-the-art algorithms and demonstrate that the recourses generated by these algorithms are likely to be invalidated if a small number of data deletion requests (e.g., 1 or 2) warrant updates of the predictive model. For the setting of differentiable models, we suggest a fra",
    "link": "http://arxiv.org/abs/2208.14137",
    "context": "Title: On the Trade-Off between Actionable Explanations and the Right to be Forgotten. (arXiv:2208.14137v3 [cs.LG] UPDATED)\nAbstract: As machine learning (ML) models are increasingly being deployed in high-stakes applications, policymakers have suggested tighter data protection regulations (e.g., GDPR, CCPA). One key principle is the \"right to be forgotten\" which gives users the right to have their data deleted. Another key principle is the right to an actionable explanation, also known as algorithmic recourse, allowing users to reverse unfavorable decisions. To date, it is unknown whether these two principles can be operationalized simultaneously. Therefore, we introduce and study the problem of recourse invalidation in the context of data deletion requests. More specifically, we theoretically and empirically analyze the behavior of popular state-of-the-art algorithms and demonstrate that the recourses generated by these algorithms are likely to be invalidated if a small number of data deletion requests (e.g., 1 or 2) warrant updates of the predictive model. For the setting of differentiable models, we suggest a fra",
    "path": "papers/22/08/2208.14137.json",
    "total_tokens": 895,
    "translated_title": "论可行解释与被遗忘权之间的权衡",
    "translated_abstract": "随着机器学习模型在高风险应用中的部署越来越多，决策者提出了更严格的数据保护法规（例如GDPR、CCPA）。其中一个关键原则是“被遗忘权”，即用户有权要求删除其数据。另一个关键原则是可行解释权，也称为算法追索权，允许用户撤销不利的决定。迄今为止，尚不清楚这两个原则是否可以同时实施。因此，我们在数据删除请求的背景下引入并研究了追索无效问题。具体而言，我们从理论和实证角度分析了流行的最先进算法的行为，并证明了这些算法生成的追索很可能会在少量数据删除请求（例如1或2个）引发对预测模型的更新时失效。对于不可区分模型的设置，我们提出一种框架。",
    "tldr": "本文研究了在数据删除请求的背景下，可行解释与被遗忘权之间的权衡问题。通过理论和实证分析，发现当少量数据删除请求触发预测模型的更新时，目前流行的最先进算法生成的可行解释可能失效。",
    "en_tdlr": "This paper explores the trade-off between actionable explanations and the right to be forgotten in the context of data deletion requests. Through theoretical and empirical analysis, it is found that the actionable explanations generated by popular state-of-the-art algorithms may become invalidated when a small number of data deletion requests trigger updates of the predictive model."
}