{
    "title": "HELP ME THINK: A Simple Prompting Strategy for Non-experts to Create Customized Content with Models. (arXiv:2208.08232v2 [cs.CL] UPDATED)",
    "abstract": "Controlling the text generated by language models and customizing the content has been a long-standing challenge. Existing prompting techniques proposed in pursuit of providing control are task-specific and lack generality; this provides overwhelming choices for non-expert users to find a suitable method for their task. The effort associated with those techniques, such as in writing examples, explanations, instructions, etc. further limits their adoption among non-expert users. In this paper, we propose a simple prompting strategy HELP ME THINK where we encourage GPT3 to help non-expert users by asking a set of relevant questions and leveraging user answers to execute the task. We demonstrate the efficacy of our technique HELP ME THINK on a variety of tasks. Specifically, we focus on tasks that are hard for average humans and require significant thinking to perform. We hope our work will encourage the development of unconventional ways to harness the power of large language models.",
    "link": "http://arxiv.org/abs/2208.08232",
    "context": "Title: HELP ME THINK: A Simple Prompting Strategy for Non-experts to Create Customized Content with Models. (arXiv:2208.08232v2 [cs.CL] UPDATED)\nAbstract: Controlling the text generated by language models and customizing the content has been a long-standing challenge. Existing prompting techniques proposed in pursuit of providing control are task-specific and lack generality; this provides overwhelming choices for non-expert users to find a suitable method for their task. The effort associated with those techniques, such as in writing examples, explanations, instructions, etc. further limits their adoption among non-expert users. In this paper, we propose a simple prompting strategy HELP ME THINK where we encourage GPT3 to help non-expert users by asking a set of relevant questions and leveraging user answers to execute the task. We demonstrate the efficacy of our technique HELP ME THINK on a variety of tasks. Specifically, we focus on tasks that are hard for average humans and require significant thinking to perform. We hope our work will encourage the development of unconventional ways to harness the power of large language models.",
    "path": "papers/22/08/2208.08232.json",
    "total_tokens": 863,
    "translated_title": "HELP ME THINK：一种帮助非专家使用模型创建定制内容的简单提示策略",
    "translated_abstract": "控制语言模型生成的文本并定制内容一直是一个长期存在的挑战。现有的提示技术提出了为了提供控制而特定于任务的方法，并缺乏一般性；这为非专业用户找到适合其任务的方法提供了压倒性的选择。这些技术所涉及的工作，如编写示例、解释、指令等，进一步限制了它们在非专业用户中的采用率。在本文中，我们提出了一种名为HELP ME THINK的简单提示策略，鼓励GPT3通过提出一组相关问题和利用用户的答案来执行任务来帮助非专家用户。我们展示了我们的技术HELP ME THINK在各种任务上的功效。具体来说，我们关注难以完成且需要重要思考的任务。我们希望我们的工作将鼓励开发非传统的方式来利用大型语言模型的力量。",
    "tldr": "HELP ME THINK是一种帮助非专家用户创建定制化内容的简单提示策略，利用GPT3提出相关问题和利用用户答案执行任务，适用于各种需要重要思考的任务。",
    "en_tdlr": "HELP ME THINK is a simple prompting strategy that helps non-expert users create customized content by encouraging GPT3 to ask relevant questions and leverage user answers to execute tasks. It is effective for various tasks that require significant thinking."
}