{
    "title": "Latent Neural Stochastic Differential Equations for Change Point Detection. (arXiv:2208.10317v2 [cs.LG] UPDATED)",
    "abstract": "Automated analysis of complex systems based on multiple readouts remains a challenge. Change point detection algorithms are aimed to locating abrupt changes in the time series behaviour of a process. In this paper, we present a novel change point detection algorithm based on Latent Neural Stochastic Differential Equations (SDE). Our method learns a non-linear deep learning transformation of the process into a latent space and estimates a SDE that describes its evolution over time. The algorithm uses the likelihood ratio of the learned stochastic processes in different timestamps to find change points of the process. We demonstrate the detection capabilities and performance of our algorithm on synthetic and real-world datasets. The proposed method outperforms the state-of-the-art algorithms on the majority of our experiments.",
    "link": "http://arxiv.org/abs/2208.10317",
    "context": "Title: Latent Neural Stochastic Differential Equations for Change Point Detection. (arXiv:2208.10317v2 [cs.LG] UPDATED)\nAbstract: Automated analysis of complex systems based on multiple readouts remains a challenge. Change point detection algorithms are aimed to locating abrupt changes in the time series behaviour of a process. In this paper, we present a novel change point detection algorithm based on Latent Neural Stochastic Differential Equations (SDE). Our method learns a non-linear deep learning transformation of the process into a latent space and estimates a SDE that describes its evolution over time. The algorithm uses the likelihood ratio of the learned stochastic processes in different timestamps to find change points of the process. We demonstrate the detection capabilities and performance of our algorithm on synthetic and real-world datasets. The proposed method outperforms the state-of-the-art algorithms on the majority of our experiments.",
    "path": "papers/22/08/2208.10317.json",
    "total_tokens": 805,
    "translated_title": "潜在神经随机微分方程用于变点检测",
    "translated_abstract": "基于多个读数的复杂系统的自动分析仍然是一个挑战。变点检测算法用于定位过程的时间序列行为中的突变点。在本文中，我们提出了一种基于潜在神经随机微分方程（SDE）的新型变点检测算法。我们的方法学习将过程非线性地转换为潜在空间，并估计描述其随时间演化的SDE。该算法使用不同时间戳的学习随机过程的似然比来找到过程的变点。我们在合成和真实数据集上展示了我们算法的检测能力和性能。在我们的大多数实验中，所提出的方法优于现有算法。",
    "tldr": "本文提出了一种基于潜在神经随机微分方程的变点检测算法，通过学习将过程转换到潜在空间，并使用学习随机过程的似然比来定位过程中的变点。在合成和真实数据集上的实验证明了该方法的出色性能。",
    "en_tdlr": "This paper proposes a change point detection algorithm based on Latent Neural Stochastic Differential Equations (SDE), which learns a nonlinear transformation of the process into a latent space and detects change points by using the likelihood ratio of learned stochastic processes. Experimental results on synthetic and real-world datasets demonstrate the superior performance of the proposed method."
}