{
    "title": "Tree species classification from hyperspectral data using graph-regularized neural networks. (arXiv:2208.08675v2 [cs.CV] UPDATED)",
    "abstract": "We propose a novel graph-regularized neural network (GRNN) algorithm for tree species classification. The proposed algorithm encompasses superpixel-based segmentation for graph construction, a pixel-wise neural network classifier, and the label propagation technique to generate an accurate and realistic (emulating tree crowns) classification map on a sparsely annotated data set. GRNN outperforms several state-of-the-art techniques not only for the standard Indian Pines HSI but also achieves a high classification accuracy (approx. 92%) on a new HSI data set collected over the heterogeneous forests of French Guiana (FG) when less than 1% of the pixels are labeled. We further show that GRNN is competitive with the state-of-the-art semi-supervised methods and exhibits a small deviation in accuracy for different numbers of training samples and over repeated trials with randomly sampled labeled pixels for training.",
    "link": "http://arxiv.org/abs/2208.08675",
    "context": "Title: Tree species classification from hyperspectral data using graph-regularized neural networks. (arXiv:2208.08675v2 [cs.CV] UPDATED)\nAbstract: We propose a novel graph-regularized neural network (GRNN) algorithm for tree species classification. The proposed algorithm encompasses superpixel-based segmentation for graph construction, a pixel-wise neural network classifier, and the label propagation technique to generate an accurate and realistic (emulating tree crowns) classification map on a sparsely annotated data set. GRNN outperforms several state-of-the-art techniques not only for the standard Indian Pines HSI but also achieves a high classification accuracy (approx. 92%) on a new HSI data set collected over the heterogeneous forests of French Guiana (FG) when less than 1% of the pixels are labeled. We further show that GRNN is competitive with the state-of-the-art semi-supervised methods and exhibits a small deviation in accuracy for different numbers of training samples and over repeated trials with randomly sampled labeled pixels for training.",
    "path": "papers/22/08/2208.08675.json",
    "total_tokens": 889,
    "translated_title": "基于图正则化神经网络的高光谱数据树种分类方法",
    "translated_abstract": "本文提出了一种新颖的图正则化神经网络（GRNN）算法，用于树种分类。该算法包括基于超像素的分割用于图像构建、基于像素的神经网络分类器，以及标签传播技术，用于在稀疏注释的数据集上生成准确且真实的分类地图（模拟树冠）。与多种先进技术相比，GRNN在标准的印度玉米高光谱图像中表现出更优的性能，并且在新的在法属圭亚那森林收集的高光谱图像上（当标注像素少于1％时），达到高达92％的分类精度。此外，我们进一步证明了GRNN在半监督方法方面的竞争力，并且在不同数量的训练样本和多次随机抽样训练标记像素的重复试验中表现出小的精度偏差。",
    "tldr": "本文提出了一种基于图正则化神经网络的树种分类方法，该方法在稀疏注释的数据集上使用标签传播技术，能够达到高精度的分类效果；同时，该方法在半监督方法方面具有竞争力。"
}