{
    "title": "Mining Legal Arguments in Court Decisions. (arXiv:2208.06178v2 [cs.CL] UPDATED)",
    "abstract": "Identifying, classifying, and analyzing arguments in legal discourse has been a prominent area of research since the inception of the argument mining field. However, there has been a major discrepancy between the way natural language processing (NLP) researchers model and annotate arguments in court decisions and the way legal experts understand and analyze legal argumentation. While computational approaches typically simplify arguments into generic premises and claims, arguments in legal research usually exhibit a rich typology that is important for gaining insights into the particular case and applications of law in general. We address this problem and make several substantial contributions to move the field forward. First, we design a new annotation scheme for legal arguments in proceedings of the European Court of Human Rights (ECHR) that is deeply rooted in the theory and practice of legal argumentation research. Second, we compile and annotate a large corpus of 373 court decision",
    "link": "http://arxiv.org/abs/2208.06178",
    "context": "Title: Mining Legal Arguments in Court Decisions. (arXiv:2208.06178v2 [cs.CL] UPDATED)\nAbstract: Identifying, classifying, and analyzing arguments in legal discourse has been a prominent area of research since the inception of the argument mining field. However, there has been a major discrepancy between the way natural language processing (NLP) researchers model and annotate arguments in court decisions and the way legal experts understand and analyze legal argumentation. While computational approaches typically simplify arguments into generic premises and claims, arguments in legal research usually exhibit a rich typology that is important for gaining insights into the particular case and applications of law in general. We address this problem and make several substantial contributions to move the field forward. First, we design a new annotation scheme for legal arguments in proceedings of the European Court of Human Rights (ECHR) that is deeply rooted in the theory and practice of legal argumentation research. Second, we compile and annotate a large corpus of 373 court decision",
    "path": "papers/22/08/2208.06178.json",
    "total_tokens": 882,
    "translated_title": "挖掘法庭裁决中的法律论点",
    "translated_abstract": "自从论点挖掘领域的产生以来，识别、分类和分析法律话语中的论点一直是一个重要的研究领域。然而，在自然语言处理研究人员对法庭决定中的论点进行建模和注释的方式与法律专家理解和分析法律论证方面存在重大差异。虽然计算方法通常将论点简化为通用前提和主张，但法律研究中的论点通常呈现出丰富的类型，这对于深入了解特定案例和法律应用非常重要。我们解决了这个问题，并做出了一些实质性的贡献，以推动该领域向前发展。首先，我们设计了一个深深植根于法律论证研究理论和实践的欧洲人权裁判所（ECHR）诉讼中法律论点的新的注释方案。其次，我们编译和注释了一个包括373项裁决的大型语料库。",
    "tldr": "该论文针对法律领域论点挖掘存在的问题，设计了深入法律论证研究理论和实践的新的注释方案，并编译了包含373项裁决的大型语料库。",
    "en_tdlr": "This paper addresses the problem of argument mining in legal discourse. It presents a new annotation scheme deeply rooted in the theory and practice of legal argumentation research and compiles a large corpus of 373 court decisions."
}