{
    "title": "Algebraic Reduction of Hidden Markov Models. (arXiv:2208.05968v2 [cs.LG] UPDATED)",
    "abstract": "The problem of reducing a Hidden Markov Model (HMM) to one of smaller dimension that exactly reproduces the same marginals is tackled by using a system-theoretic approach. Realization theory tools are extended to HMMs by leveraging suitable algebraic representations of probability spaces. We propose two algorithms that return coarse-grained equivalent HMMs obtained by stochastic projection operators: the first returns models that exactly reproduce the single-time distribution of a given output process, while in the second the full (multi-time) distribution is preserved. The reduction method exploits not only the structure of the observed output, but also its initial condition, whenever the latter is known or belongs to a given subclass. Optimal algorithms are derived for a class of HMM, namely observable ones.",
    "link": "http://arxiv.org/abs/2208.05968",
    "context": "Title: Algebraic Reduction of Hidden Markov Models. (arXiv:2208.05968v2 [cs.LG] UPDATED)\nAbstract: The problem of reducing a Hidden Markov Model (HMM) to one of smaller dimension that exactly reproduces the same marginals is tackled by using a system-theoretic approach. Realization theory tools are extended to HMMs by leveraging suitable algebraic representations of probability spaces. We propose two algorithms that return coarse-grained equivalent HMMs obtained by stochastic projection operators: the first returns models that exactly reproduce the single-time distribution of a given output process, while in the second the full (multi-time) distribution is preserved. The reduction method exploits not only the structure of the observed output, but also its initial condition, whenever the latter is known or belongs to a given subclass. Optimal algorithms are derived for a class of HMM, namely observable ones.",
    "path": "papers/22/08/2208.05968.json",
    "total_tokens": 756,
    "translated_title": "隐马尔可夫模型的代数约简",
    "translated_abstract": "通过使用系统理论方法，利用适当的概率空间的代数表示，我们解决了将隐马尔可夫模型(HMM)简化为一个更小维度的问题，以完全再现相同边缘的问题。我们提出了两种算法，通过随机投影算子返回粗粒度等效的HMM: 第一种返回精确复制给定输出过程的单时间分布的模型，而第二种则保留完整(多时间)分布。该简化方法不仅利用了观测输出的结构，而且还利用其初始条件，只要后者已知或属于给定的子类。对于可观测类隐马尔可夫模型，推导出了最优算法。",
    "tldr": "本论文提出了两种算法用于将隐马尔可夫模型简化为维度更小的模型，并精确复现其边缘分布，首次扩展了实现理论工具到这个应用领域。",
    "en_tdlr": "This paper proposes two algorithms for reducing Hidden Markov Models (HMMs) to smaller dimension while reproducing the same marginals, and for the first time extends realization theory tools to HMMs."
}