{
    "title": "ARIEL: Adversarial Graph Contrastive Learning",
    "abstract": "Contrastive learning is an effective unsupervised method in graph representation learning, and the key component of contrastive learning lies in the construction of positive and negative samples. Previous methods usually utilize the proximity of nodes in the graph as the principle. Recently, the data-augmentation-based contrastive learning method has advanced to show great power in the visual domain, and some works extended this method from images to graphs. However, unlike the data augmentation on images, the data augmentation on graphs is far less intuitive and much harder to provide high-quality contrastive samples, which leaves much space for improvement. In this work, by introducing an adversarial graph view for data augmentation, we propose a simple but effective method, Adversarial Graph Contrastive Learning (ARIEL), to extract informative contrastive samples within reasonable constraints. We develop a new technique called information regularization for stable training and use s",
    "link": "https://arxiv.org/abs/2208.06956",
    "context": "Title: ARIEL: Adversarial Graph Contrastive Learning\nAbstract: Contrastive learning is an effective unsupervised method in graph representation learning, and the key component of contrastive learning lies in the construction of positive and negative samples. Previous methods usually utilize the proximity of nodes in the graph as the principle. Recently, the data-augmentation-based contrastive learning method has advanced to show great power in the visual domain, and some works extended this method from images to graphs. However, unlike the data augmentation on images, the data augmentation on graphs is far less intuitive and much harder to provide high-quality contrastive samples, which leaves much space for improvement. In this work, by introducing an adversarial graph view for data augmentation, we propose a simple but effective method, Adversarial Graph Contrastive Learning (ARIEL), to extract informative contrastive samples within reasonable constraints. We develop a new technique called information regularization for stable training and use s",
    "path": "papers/22/08/2208.06956.json",
    "total_tokens": 821,
    "translated_title": "ARIEL: 对抗图对比学习",
    "translated_abstract": "对比学习是图表示学习中有效的无监督方法，对比学习的关键组成部分在于正负样本的构建。以前的方法通常利用图中节点之间的接近性作为原则。最近，基于数据增强的对比学习方法在视觉领域展现了很大的能力，并且一些工作将这种方法从图像扩展到了图中。然而，与图像上的数据增强不同，图上的数据增强不太直观，更难以提供高质量的对比样本，这给改进留下了很大的空间。在这项工作中，通过引入对抗图视图进行数据增强，我们提出了一种简单而有效的方法，对抗图对比学习（ARIEL），在合理的约束条件下提取信息丰富的对比样本。我们开发了一种名为信息正则化的技术，用于稳定训练，并使用s",
    "tldr": "该论文提出了对抗图对比学习（ARIEL）方法，通过引入对抗图视图进行数据增强，提取信息丰富的对比样本，进一步改进了图表示学习中的对比学习方法。",
    "en_tdlr": "The paper proposes a method called ARIEL, which introduces adversarial graph view for data augmentation, and extracts informative contrastive samples to improve the method of contrastive learning in graph representation learning."
}