{
    "title": "Re4: Learning to Re-contrast, Re-attend, Re-construct for Multi-interest Recommendation",
    "abstract": "arXiv:2208.08011v2 Announce Type: replace  Abstract: Effectively representing users lie at the core of modern recommender systems. Since users' interests naturally exhibit multiple aspects, it is of increasing interest to develop multi-interest frameworks for recommendation, rather than represent each user with an overall embedding. Despite their effectiveness, existing methods solely exploit the encoder (the forward flow) to represent multiple aspects of interests. However, without explicit regularization, the interest embeddings may not be distinct from each other nor semantically reflect representative historical items. Towards this end, we propose the Re4 framework, which leverages the backward flow to reexamine each interest embedding. Specifically, Re4 encapsulates three backward flows, i.e., 1) Re-contrast, which drives each interest embedding to be distinct from other interests using contrastive learning; 2) Re-attend, which ensures the interest-item correlation estimation in t",
    "link": "https://arxiv.org/abs/2208.08011",
    "context": "Title: Re4: Learning to Re-contrast, Re-attend, Re-construct for Multi-interest Recommendation\nAbstract: arXiv:2208.08011v2 Announce Type: replace  Abstract: Effectively representing users lie at the core of modern recommender systems. Since users' interests naturally exhibit multiple aspects, it is of increasing interest to develop multi-interest frameworks for recommendation, rather than represent each user with an overall embedding. Despite their effectiveness, existing methods solely exploit the encoder (the forward flow) to represent multiple aspects of interests. However, without explicit regularization, the interest embeddings may not be distinct from each other nor semantically reflect representative historical items. Towards this end, we propose the Re4 framework, which leverages the backward flow to reexamine each interest embedding. Specifically, Re4 encapsulates three backward flows, i.e., 1) Re-contrast, which drives each interest embedding to be distinct from other interests using contrastive learning; 2) Re-attend, which ensures the interest-item correlation estimation in t",
    "path": "papers/22/08/2208.08011.json",
    "total_tokens": 837,
    "translated_title": "Re4: 学习重新对比、重新关注、重新构建以用于多兴趣推荐",
    "translated_abstract": "有效地表示用户是现代推荐系统的核心。由于用户的兴趣自然地展现出多个方面，发展多兴趣推荐框架而不是用整体嵌入表示每个用户变得越来越重要。现有方法虽然有效，却仅利用编码器（前向流）来表示兴趣的多个方面。然而，缺乏明确的正则化，兴趣嵌入可能彼此不明显区分，也不能语义上反映代表性历史项目。为此，我们提出了Re4框架，它利用反向流重新审视每个兴趣嵌入。具体来说，Re4包含三个反向流，即1）Re-contrast，利用对比学习驱使每个兴趣嵌入与其他兴趣区分开来；2）Re-attend，确保兴趣-项目相关性估计",
    "tldr": "Re4框架使用反向流重新审视每个兴趣嵌入，包括Re-contrast对兴趣嵌入进行对比学习使其彼此区分开，Re-attend确保兴趣-项目相关性估计",
    "en_tdlr": "The Re4 framework leverages backward flow to reexamine each interest embedding through Re-contrast for differentiation and Re-attend for ensuring interest-item correlation estimation."
}