{
    "title": "Graph Neural Network with Local Frame for Molecular Potential Energy Surface. (arXiv:2208.00716v2 [cs.LG] UPDATED)",
    "abstract": "Modeling molecular potential energy surface is of pivotal importance in science. Graph Neural Networks have shown great success in this field. However, their message passing schemes need special designs to capture geometric information and fulfill symmetry requirement like rotation equivariance, leading to complicated architectures. To avoid these designs, we introduce a novel local frame method to molecule representation learning and analyze its expressivity. Projected onto a frame, equivariant features like 3D coordinates are converted to invariant features, so that we can capture geometric information with these projections and decouple the symmetry requirement from GNN design. Theoretically, we prove that given non-degenerate frames, even ordinary GNNs can encode molecules injectively and reach maximum expressivity with coordinate projection and frame-frame projection. In experiments, our model uses a simple ordinary GNN architecture yet achieves state-of-the-art accuracy. The simp",
    "link": "http://arxiv.org/abs/2208.00716",
    "context": "Title: Graph Neural Network with Local Frame for Molecular Potential Energy Surface. (arXiv:2208.00716v2 [cs.LG] UPDATED)\nAbstract: Modeling molecular potential energy surface is of pivotal importance in science. Graph Neural Networks have shown great success in this field. However, their message passing schemes need special designs to capture geometric information and fulfill symmetry requirement like rotation equivariance, leading to complicated architectures. To avoid these designs, we introduce a novel local frame method to molecule representation learning and analyze its expressivity. Projected onto a frame, equivariant features like 3D coordinates are converted to invariant features, so that we can capture geometric information with these projections and decouple the symmetry requirement from GNN design. Theoretically, we prove that given non-degenerate frames, even ordinary GNNs can encode molecules injectively and reach maximum expressivity with coordinate projection and frame-frame projection. In experiments, our model uses a simple ordinary GNN architecture yet achieves state-of-the-art accuracy. The simp",
    "path": "papers/22/08/2208.00716.json",
    "total_tokens": 950,
    "translated_title": "基于局部框架的图神经网络在分子势能面建模中的应用",
    "translated_abstract": "分子势能面建模是科学研究中非常关键的一部分。图神经网络在这个领域内已经展示出了很大的成功。然而，他们的信息传递方案需要特殊设计来捕捉几何信息和满足旋转等变性这样的对称要求，导致了复杂的结构。为了避免这些设计，我们引入了一种新型的局部框架方法来进行分子表征学习，并分析了其表达性。通过投影到框架上，等变特征如3D坐标被转化为不变特征，这样我们就可以通过这些投影来捕捉几何信息，同时从GNN设计中分离对称要求。我们在理论上证明，给定非退化的框架，即使是普通的GNN也可以将分子编码为可注入的，并且使用坐标投影和框架之间的投影可以达到最大表达性。在实验中，我们的模型使用了简单的普通GNN架构，但是达到了最先进的精度。这种简单的架构也使得计算更快，实现更容易。",
    "tldr": "本论文提出了一种基于局部框架的分子表征学习方法，通过投影来捕捉几何信息，并且不需要特殊设计来满足对称要求，其相对于之前的方法具有更快的计算速度和更容易的实现。"
}