{
    "title": "Matrix Quantile Factor Model. (arXiv:2208.08693v2 [stat.ME] UPDATED)",
    "abstract": "This paper introduces a matrix quantile factor model for matrix-valued data with a low-rank structure. We estimate the row and column factor spaces via minimizing the empirical check loss function over all panels. We show the estimates converge at rate $1/\\min\\{\\sqrt{p_1p_2}, \\sqrt{p_2T},$ $\\sqrt{p_1T}\\}$ in average Frobenius norm, where $p_1$, $p_2$ and $T$ are the row dimensionality, column dimensionality and length of the matrix sequence. This rate is faster than that of the quantile estimates via ``flattening\" the matrix model into a large vector model. Smoothed estimates are given and their central limit theorems are derived under some mild condition. We provide three consistent criteria to determine the pair of row and column factor numbers. Extensive simulation studies and an empirical study justify our theory.",
    "link": "http://arxiv.org/abs/2208.08693",
    "context": "Title: Matrix Quantile Factor Model. (arXiv:2208.08693v2 [stat.ME] UPDATED)\nAbstract: This paper introduces a matrix quantile factor model for matrix-valued data with a low-rank structure. We estimate the row and column factor spaces via minimizing the empirical check loss function over all panels. We show the estimates converge at rate $1/\\min\\{\\sqrt{p_1p_2}, \\sqrt{p_2T},$ $\\sqrt{p_1T}\\}$ in average Frobenius norm, where $p_1$, $p_2$ and $T$ are the row dimensionality, column dimensionality and length of the matrix sequence. This rate is faster than that of the quantile estimates via ``flattening\" the matrix model into a large vector model. Smoothed estimates are given and their central limit theorems are derived under some mild condition. We provide three consistent criteria to determine the pair of row and column factor numbers. Extensive simulation studies and an empirical study justify our theory.",
    "path": "papers/22/08/2208.08693.json",
    "total_tokens": 933,
    "translated_title": "矩阵分位因子模型",
    "translated_abstract": "本文为具有低秩结构的矩阵型数据引入了矩阵分位因子模型。通过在所有面板上最小化经验核损失函数，我们估计了行和列因子空间。我们证明了这些估计收敛于速率$1/\\min\\{\\sqrt{p_1p_2}, \\sqrt{p_2T}, \\sqrt{p_1T}\\}$在平均Frobenius范数下，其中$p_1$，$p_2$和$T$分别表示矩阵序列的行维数、列维数和长度。该速率比将矩阵模型“展平”为大向量模型的分位估计速率更快。给出了平滑的估计量，并在一些温和的条件下导出了它们的中心极限定理。我们提供了三个一致的标准来确定行和列因子数对。广泛的模拟研究和实证研究验证了我们的理论。",
    "tldr": "本文提出了一种新的矩阵分位因子模型，针对矩阵型数据具有低秩结构。我们通过优化经验核损失函数估计行和列的因子空间，证明了估计值的快速收敛速率，提供了合理的因子数对确定方法，并进行了广泛的模拟研究和实证研究。",
    "en_tdlr": "This paper proposes a novel matrix quantile factor model for matrix-valued data with a low-rank structure. The estimates of row and column factor spaces converge quickly through minimizing the empirical check loss function over all panels. Three consistent criteria are provided to determine the pair of row and column factor numbers. Extensive simulation studies and an empirical study support the proposed theory."
}