{
    "title": "Lifelong Learning for Neural powered Mixed Integer Programming. (arXiv:2208.12226v3 [math.OC] UPDATED)",
    "abstract": "Mixed Integer programs (MIPs) are typically solved by the Branch-and-Bound algorithm. Recently, Learning to imitate fast approximations of the expert strong branching heuristic has gained attention due to its success in reducing the running time for solving MIPs. However, existing learning-to-branch methods assume that the entire training data is available in a single session of training. This assumption is often not true, and if the training data is supplied in continual fashion over time, existing techniques suffer from catastrophic forgetting. In this work, we study the hitherto unexplored paradigm of Lifelong Learning to Branch on Mixed Integer Programs. To mitigate catastrophic forgetting, we propose LIMIP, which is powered by the idea of modeling an MIP instance in the form of a bipartite graph, which we map to an embedding space using a bipartite Graph Attention Network. This rich embedding space avoids catastrophic forgetting through the application of knowledge distillation an",
    "link": "http://arxiv.org/abs/2208.12226",
    "context": "Title: Lifelong Learning for Neural powered Mixed Integer Programming. (arXiv:2208.12226v3 [math.OC] UPDATED)\nAbstract: Mixed Integer programs (MIPs) are typically solved by the Branch-and-Bound algorithm. Recently, Learning to imitate fast approximations of the expert strong branching heuristic has gained attention due to its success in reducing the running time for solving MIPs. However, existing learning-to-branch methods assume that the entire training data is available in a single session of training. This assumption is often not true, and if the training data is supplied in continual fashion over time, existing techniques suffer from catastrophic forgetting. In this work, we study the hitherto unexplored paradigm of Lifelong Learning to Branch on Mixed Integer Programs. To mitigate catastrophic forgetting, we propose LIMIP, which is powered by the idea of modeling an MIP instance in the form of a bipartite graph, which we map to an embedding space using a bipartite Graph Attention Network. This rich embedding space avoids catastrophic forgetting through the application of knowledge distillation an",
    "path": "papers/22/08/2208.12226.json",
    "total_tokens": 873,
    "translated_title": "基于神经网络的混合整数规划的终身学习",
    "translated_abstract": "混合整数规划（MIP）通常通过分支定界算法来求解。最近，学习模仿专家强分支启发式快速逼近的方法引起了关注，因为它在减少解决MIP问题的运行时间方面取得了成功。然而，现有的学习分支方法假设整个训练数据在单个训练会话中可用。这个假设通常不成立，如果训练数据随时间连续提供，现有技术会遭受灾难性的遗忘。在这项工作中，我们研究了迄今为止未被探索的混合整数规划的终身学习范例。为了减轻灾难性遗忘，我们提出了LIMIP，它利用了将MIP实例建模为一个二分图的思想，我们使用二分图注意力网络将其映射到嵌入空间中。通过应用知识蒸馏，在这个丰富的嵌入空间中避免了灾难性遗忘。",
    "tldr": "本论文研究了混合整数规划的终身学习范例，并提出了一种名为LIMIP的方法，在嵌入空间中建模MIP实例，通过应用知识蒸馏来避免灾难性遗忘。"
}