{
    "title": "Runtime Analysis for the NSGA-II: Provable Speed-Ups From Crossover. (arXiv:2208.08759v2 [cs.NE] UPDATED)",
    "abstract": "Very recently, the first mathematical runtime analyses for the NSGA-II, the most common multi-objective evolutionary algorithm, have been conducted. Continuing this research direction, we prove that the NSGA-II optimizes the OneJumpZeroJump benchmark asymptotically faster when crossover is employed. Together with a parallel independent work by Dang, Opris, Salehi, and Sudholt, this is the first time such an advantage of crossover is proven for the NSGA-II. Our arguments can be transferred to single-objective optimization. They then prove that crossover can speed up the $(\\mu+1)$ genetic algorithm in a different way and more pronounced than known before. Our experiments confirm the added value of crossover and show that the observed advantages are even larger than what our proofs can guarantee.",
    "link": "http://arxiv.org/abs/2208.08759",
    "context": "Title: Runtime Analysis for the NSGA-II: Provable Speed-Ups From Crossover. (arXiv:2208.08759v2 [cs.NE] UPDATED)\nAbstract: Very recently, the first mathematical runtime analyses for the NSGA-II, the most common multi-objective evolutionary algorithm, have been conducted. Continuing this research direction, we prove that the NSGA-II optimizes the OneJumpZeroJump benchmark asymptotically faster when crossover is employed. Together with a parallel independent work by Dang, Opris, Salehi, and Sudholt, this is the first time such an advantage of crossover is proven for the NSGA-II. Our arguments can be transferred to single-objective optimization. They then prove that crossover can speed up the $(\\mu+1)$ genetic algorithm in a different way and more pronounced than known before. Our experiments confirm the added value of crossover and show that the observed advantages are even larger than what our proofs can guarantee.",
    "path": "papers/22/08/2208.08759.json",
    "total_tokens": 810,
    "translated_title": "NSGA-II的运行时分析：交叉操作带来可证明的加速",
    "translated_abstract": "最近，对于NSGA-II，最常用的多目标演化算法进行了第一次数学运行时分析。本研究证明，当使用交叉时，NSGA-II在优化OneJumpZeroJump基准函数时会呈现出渐近更快的速度。与Dang、Opris、Salehi和Sudholt的一项独立并行工作一起，这是第一次证明交叉操作对NSGA-II有这样的优势。我们的论证可以被转移到单目标优化中。而且，他们证明交叉操作可以比以前更加显著地加速$(\\mu+1)$遗传算法。我们的实验证实了交叉的附加价值，并表明观察到的优势甚至比我们的证明所能保证的更大。",
    "tldr": "本文证明NSGA-II优化OneJumpZeroJump基准函数时，交叉操作可以带来可证明的加速效果；同样，交叉操作对于单目标优化中的$(\\mu+1)$遗传算法也有更显著的加速效果。"
}