{
    "title": "Finding Reusable Machine Learning Components to Build Programming Language Processing Pipelines. (arXiv:2208.05596v2 [cs.LG] UPDATED)",
    "abstract": "Programming Language Processing (PLP) using machine learning has made vast improvements in the past few years. Increasingly more people are interested in exploring this promising field. However, it is challenging for new researchers and developers to find the right components to construct their own machine learning pipelines, given the diverse PLP tasks to be solved, the large number of datasets and models being released, and the set of complex compilers or tools involved. To improve the findability, accessibility, interoperability and reusability (FAIRness) of machine learning components, we collect and analyze a set of representative papers in the domain of machine learning-based PLP. We then identify and characterize key concepts including PLP tasks, model architectures and supportive tools. Finally, we show some example use cases of leveraging the reusable components to construct machine learning pipelines to solve a set of PLP tasks.",
    "link": "http://arxiv.org/abs/2208.05596",
    "context": "Title: Finding Reusable Machine Learning Components to Build Programming Language Processing Pipelines. (arXiv:2208.05596v2 [cs.LG] UPDATED)\nAbstract: Programming Language Processing (PLP) using machine learning has made vast improvements in the past few years. Increasingly more people are interested in exploring this promising field. However, it is challenging for new researchers and developers to find the right components to construct their own machine learning pipelines, given the diverse PLP tasks to be solved, the large number of datasets and models being released, and the set of complex compilers or tools involved. To improve the findability, accessibility, interoperability and reusability (FAIRness) of machine learning components, we collect and analyze a set of representative papers in the domain of machine learning-based PLP. We then identify and characterize key concepts including PLP tasks, model architectures and supportive tools. Finally, we show some example use cases of leveraging the reusable components to construct machine learning pipelines to solve a set of PLP tasks.",
    "path": "papers/22/08/2208.05596.json",
    "total_tokens": 937,
    "translated_title": "寻找可重用的机器学习组件以构建编程语言处理流水线",
    "translated_abstract": "机器学习在编程语言处理方面取得了巨大的进展，越来越多的人对这一领域表现出浓厚的兴趣。然而，对于新的研究和开发人员来说，由于需要解决各种不同的编程语言处理任务、发布的数据集和模型数量众多以及涉及的编译器或工具集复杂等因素，很难找到构建自己的机器学习流水线所需的正确组件。为了改善机器学习组件的可发现性、可访问性、互操作性和可重用性，我们收集并分析了一组代表性的基于机器学习的编程语言处理论文。然后，我们鉴定和描述了关键概念，包括编程语言处理任务、模型架构和支持工具。最后，我们展示了一些应用示例，说明如何利用可重用组件构建机器学习流水线来解决一组编程语言处理任务。",
    "tldr": "该论文提出一种寻找可重用的机器学习组件以构建编程语言处理流水线的方法，并通过收集、分析代表性论文来鉴定和描述关键概念，从而改善机器学习组件的可发现性、可访问性、互操作性和可重用性。",
    "en_tdlr": "This paper proposes a method for finding reusable machine learning components to build programming language processing pipelines. It improves the findability, accessibility, interoperability, and reusability of machine learning components by collecting and analyzing representative papers and identifying key concepts, including PLP tasks, model architectures, and supportive tools. The paper also shows examples of leveraging reusable components to solve a set of PLP tasks."
}