{
    "title": "Discovering Conservation Laws using Optimal Transport and Manifold Learning. (arXiv:2208.14995v2 [physics.comp-ph] UPDATED)",
    "abstract": "Conservation laws are key theoretical and practical tools for understanding, characterizing, and modeling nonlinear dynamical systems. However, for many complex systems, the corresponding conserved quantities are difficult to identify, making it hard to analyze their dynamics and build stable predictive models. Current approaches for discovering conservation laws often depend on detailed dynamical information or rely on black box parametric deep learning methods. We instead reformulate this task as a manifold learning problem and propose a non-parametric approach for discovering conserved quantities. We test this new approach on a variety of physical systems and demonstrate that our method is able to both identify the number of conserved quantities and extract their values. Using tools from optimal transport theory and manifold learning, our proposed method provides a direct geometric approach to identifying conservation laws that is both robust and interpretable without requiring an e",
    "link": "http://arxiv.org/abs/2208.14995",
    "context": "Title: Discovering Conservation Laws using Optimal Transport and Manifold Learning. (arXiv:2208.14995v2 [physics.comp-ph] UPDATED)\nAbstract: Conservation laws are key theoretical and practical tools for understanding, characterizing, and modeling nonlinear dynamical systems. However, for many complex systems, the corresponding conserved quantities are difficult to identify, making it hard to analyze their dynamics and build stable predictive models. Current approaches for discovering conservation laws often depend on detailed dynamical information or rely on black box parametric deep learning methods. We instead reformulate this task as a manifold learning problem and propose a non-parametric approach for discovering conserved quantities. We test this new approach on a variety of physical systems and demonstrate that our method is able to both identify the number of conserved quantities and extract their values. Using tools from optimal transport theory and manifold learning, our proposed method provides a direct geometric approach to identifying conservation laws that is both robust and interpretable without requiring an e",
    "path": "papers/22/08/2208.14995.json",
    "total_tokens": 884,
    "translated_title": "使用最优传输和流形学习发现保守定律",
    "translated_abstract": "保守定律是理解、表征和建模非线性动力系统的关键理论和实际工具。然而，对于许多复杂系统，很难确定相应的保守量，从而难以分析它们的动力学和构建稳定的预测模型。当前发现保守定律的方法通常依赖于详细的动力学信息或依赖于黑盒参数化深度学习方法。相反，我们将这个任务重新定义为流形学习问题，并提出了一种非参数方法来发现保守量。我们在各种物理系统上测试了这种新方法，并证明我们的方法能够确定保守量的数量并提取它们的值。利用最优传输理论和流形学习工具，我们提出的方法提供了一种直接的几何方法来确定保守定律，既稳健又可解释，而无需额外的动力学信息。",
    "tldr": "本论文提出了一种使用最优传输和流形学习的非参数方法来发现复杂系统中的保守定律。通过测试在不同物理系统上，证明该方法能够确定保守定律的数量并提取其值，为分析系统动力学和构建稳定预测模型提供了新的可靠而解释性强的方法。",
    "en_tdlr": "This paper presents a non-parametric approach using optimal transport and manifold learning to discover conservation laws in complex systems. The method is able to identify the number of conserved quantities and extract their values, providing a new reliable and interpretable method for analyzing system dynamics and building stable predictive models."
}