{
    "title": "Early heart disease prediction using hybrid quantum classification. (arXiv:2208.08882v2 [quant-ph] UPDATED)",
    "abstract": "The rate of heart morbidity and heart mortality increases significantly which affect the global public health and world economy. Early prediction of heart disease is crucial for reducing heart morbidity and mortality. This paper proposes two quantum machine learning methods i.e. hybrid quantum neural network and hybrid random forest quantum neural network for early detection of heart disease. The methods are applied on the Cleveland and Statlog datasets. The results show that hybrid quantum neural network and hybrid random forest quantum neural network are suitable for high dimensional and low dimensional problems respectively. The hybrid quantum neural network is sensitive to outlier data while hybrid random forest is robust on outlier data. A comparison between different machine learning methods shows that the proposed quantum methods are more appropriate for early heart disease prediction where 96.43% and 97.78% area under curve are obtained for Cleveland and Statlog dataset respect",
    "link": "http://arxiv.org/abs/2208.08882",
    "context": "Title: Early heart disease prediction using hybrid quantum classification. (arXiv:2208.08882v2 [quant-ph] UPDATED)\nAbstract: The rate of heart morbidity and heart mortality increases significantly which affect the global public health and world economy. Early prediction of heart disease is crucial for reducing heart morbidity and mortality. This paper proposes two quantum machine learning methods i.e. hybrid quantum neural network and hybrid random forest quantum neural network for early detection of heart disease. The methods are applied on the Cleveland and Statlog datasets. The results show that hybrid quantum neural network and hybrid random forest quantum neural network are suitable for high dimensional and low dimensional problems respectively. The hybrid quantum neural network is sensitive to outlier data while hybrid random forest is robust on outlier data. A comparison between different machine learning methods shows that the proposed quantum methods are more appropriate for early heart disease prediction where 96.43% and 97.78% area under curve are obtained for Cleveland and Statlog dataset respect",
    "path": "papers/22/08/2208.08882.json",
    "total_tokens": 934,
    "translated_title": "早期心脏疾病预测的混合量子分类方法",
    "translated_abstract": "心脏发病率和心脏死亡率的增加明显影响了全球公共健康和世界经济。早期预测对于减少心脏发病率和死亡率至关重要。本文提出了两种量子机器学习方法：混合量子神经网络和混合随机森林量子神经网络，用于早期检测心脏疾病。这些方法在Cleveland和Statlog数据集上应用。结果表明，混合量子神经网络和混合随机森林量子神经网络分别适用于高维和低维问题。混合量子神经网络对异常数据敏感，而混合随机森林对异常数据具有鲁棒性。与不同机器学习方法的比较表明，所提出的量子方法更适合早期心脏疾病预测，在Cleveland和Statlog数据集上分别获得了96.43％和97.78％的曲线下面积。",
    "tldr": "本文提出了两种量子机器学习方法，分别适用于高维和低维问题，并在Cleveland和Statlog数据集上实验表明这些方法更适合于早期心脏疾病预测，可获得高达96.43％和97.78％的曲线下面积。",
    "en_tdlr": "This paper proposes two quantum machine learning methods for early detection of heart disease, suitable for high and low dimensional problems respectively. Experimental results on the Cleveland and Statlog datasets show that these methods are more appropriate for early heart disease prediction, achieving up to 96.43% and 97.78% area under curve."
}