{
    "title": "EchoGNN: Explainable Ejection Fraction Estimation with Graph Neural Networks. (arXiv:2208.14003v2 [eess.IV] UPDATED)",
    "abstract": "Ejection fraction (EF) is a key indicator of cardiac function, allowing identification of patients prone to heart dysfunctions such as heart failure. EF is estimated from cardiac ultrasound videos known as echocardiograms (echo) by manually tracing the left ventricle and estimating its volume on certain frames. These estimations exhibit high inter-observer variability due to the manual process and varying video quality. Such sources of inaccuracy and the need for rapid assessment necessitate reliable and explainable machine learning techniques. In this work, we introduce EchoGNN, a model based on graph neural networks (GNNs) to estimate EF from echo videos. Our model first infers a latent echo-graph from the frames of one or multiple echo cine series. It then estimates weights over nodes and edges of this graph, indicating the importance of individual frames that aid EF estimation. A GNN regressor uses this weighted graph to predict EF. We show, qualitatively and quantitatively, that t",
    "link": "http://arxiv.org/abs/2208.14003",
    "context": "Title: EchoGNN: Explainable Ejection Fraction Estimation with Graph Neural Networks. (arXiv:2208.14003v2 [eess.IV] UPDATED)\nAbstract: Ejection fraction (EF) is a key indicator of cardiac function, allowing identification of patients prone to heart dysfunctions such as heart failure. EF is estimated from cardiac ultrasound videos known as echocardiograms (echo) by manually tracing the left ventricle and estimating its volume on certain frames. These estimations exhibit high inter-observer variability due to the manual process and varying video quality. Such sources of inaccuracy and the need for rapid assessment necessitate reliable and explainable machine learning techniques. In this work, we introduce EchoGNN, a model based on graph neural networks (GNNs) to estimate EF from echo videos. Our model first infers a latent echo-graph from the frames of one or multiple echo cine series. It then estimates weights over nodes and edges of this graph, indicating the importance of individual frames that aid EF estimation. A GNN regressor uses this weighted graph to predict EF. We show, qualitatively and quantitatively, that t",
    "path": "papers/22/08/2208.14003.json",
    "total_tokens": 999,
    "translated_title": "EchoGNN: 基于图神经网络的可解释性射血分数估计",
    "translated_abstract": "射血分数（EF）是心脏功能的关键指标，可用于识别容易出现心功能障碍（如心衰）的患者。EF是通过手动追踪左心室并估计特定帧上其体积的心脏超声视频（超声心动图）来估计的。由于手动过程和视频质量的差异，这些估计存在高度的观察者差异。这种不准确性和快速评估的需求需要可靠且可解释的机器学习技术。在这项工作中，我们提出了EchoGNN，一种基于图神经网络（GNNs）的模型，用于从超声心动图视频中估计EF。我们的模型首先从一个或多个超声心动图序列的帧中推断出潜在的超声心动图。然后，它估计这个图的节点和边的权重，表示对于帮助估计EF的个别帧的重要性。一个GNN回归器使用这个加权图来预测EF。我们通过定性和定量的方法展示了EchoGNN的效果。",
    "tldr": "EchoGNN是一种基于图神经网络的模型，用于从超声心动图视频中可解释地估计射血分数。它推断出一个潜在的超声心动图，并通过节点和边的权重来确定帧的重要性，以帮助估计射血分数。该模型在定性和定量方面展现出良好的效果。"
}