{
    "title": "Accelerating discrete dislocation dynamics simulations with graph neural networks. (arXiv:2208.03296v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "Discrete dislocation dynamics (DDD) is a widely employed computational method to study plasticity at the mesoscale that connects the motion of dislocation lines to the macroscopic response of crystalline materials. However, the computational cost of DDD simulations remains a bottleneck that limits its range of applicability. Here, we introduce a new DDD-GNN framework in which the expensive time-integration of dislocation motion is entirely substituted by a graph neural network (GNN) model trained on DDD trajectories. As a first application, we demonstrate the feasibility and potential of our method on a simple yet relevant model of a dislocation line gliding through an array of obstacles. We show that the DDD-GNN model is stable and reproduces very well unseen ground-truth DDD simulation responses for a range of straining rates and obstacle densities, without the need to explicitly compute nodal forces or dislocation mobilities during time-integration. Our approach opens new promising ",
    "link": "http://arxiv.org/abs/2208.03296",
    "context": "Title: Accelerating discrete dislocation dynamics simulations with graph neural networks. (arXiv:2208.03296v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: Discrete dislocation dynamics (DDD) is a widely employed computational method to study plasticity at the mesoscale that connects the motion of dislocation lines to the macroscopic response of crystalline materials. However, the computational cost of DDD simulations remains a bottleneck that limits its range of applicability. Here, we introduce a new DDD-GNN framework in which the expensive time-integration of dislocation motion is entirely substituted by a graph neural network (GNN) model trained on DDD trajectories. As a first application, we demonstrate the feasibility and potential of our method on a simple yet relevant model of a dislocation line gliding through an array of obstacles. We show that the DDD-GNN model is stable and reproduces very well unseen ground-truth DDD simulation responses for a range of straining rates and obstacle densities, without the need to explicitly compute nodal forces or dislocation mobilities during time-integration. Our approach opens new promising ",
    "path": "papers/22/08/2208.03296.json",
    "total_tokens": 991,
    "translated_title": "利用图神经网络加速离散位错动力学仿真",
    "translated_abstract": "离散位错动力学（DDD）是一种广泛应用于研究介观尺度下晶体材料塑性行为的计算方法，将位错线的运动与宏观响应相连。然而，DDD模拟的计算成本仍然是限制其适用范围的瓶颈。在这里，我们介绍了一种新的DDD-GNN框架，其中耗时的位错运动时间积分完全由基于DDD轨迹训练的图神经网络（GNN）模型替代。作为第一个应用，我们展示了我们的方法对于一种简单但相关的位错线在障碍物阵列上滑动的模型的可行性和潜力。我们展示了DDD-GNN模型在一定的应变速率和障碍物密度范围内稳定，并且很好地重现了未见过的真实DDD模拟响应，而无需在时间积分期间明确计算节点力或位错迁移率。我们的方法为将机器学习技术纳入介观尺度下力学行为的建模和仿真打开了新的有前途的途径。",
    "tldr": "研究团队提出了一种利用基于DDD轨迹训练的图神经网络模型替代耗时的位错运动时间积分的DDD-GNN框架，有效加速介观尺度下晶体材料塑性行为的计算模拟。",
    "en_tdlr": "The researchers propose a DDD-GNN framework that uses a graph neural network model trained on DDD trajectories to replace the expensive time-integration of dislocation motion, and demonstrate its feasibility and potential for modeling and simulating mechanical behavior at the mesoscale."
}