{
    "title": "Detect to Learn: Structure Learning with Attention and Decision Feedback for MIMO-OFDM Receive Processing. (arXiv:2208.09287v4 [eess.SP] UPDATED)",
    "abstract": "The limited over-the-air (OTA) pilot symbols in multiple-input-multiple-output orthogonal-frequency-division-multiplexing (MIMO-OFDM) systems presents a major challenge for detecting transmitted data symbols at the receiver, especially for machine learning-based approaches. While it is crucial to explore effective ways to exploit pilots, one can also take advantage of the data symbols to improve detection performance. Thus, this paper introduces an online attention-based approach, namely RC-AttStructNet-DF, that can efficiently utilize pilot symbols and be dynamically updated with the detected payload data using the decision feedback (DF) mechanism. Reservoir computing (RC) is employed in the time domain network to facilitate efficient online training. The frequency domain network adopts the novel 2D multi-head attention (MHA) module to capture the time and frequency correlations, and the structural-based StructNet to facilitate the DF mechanism. The attention loss is designed to learn",
    "link": "http://arxiv.org/abs/2208.09287",
    "context": "Title: Detect to Learn: Structure Learning with Attention and Decision Feedback for MIMO-OFDM Receive Processing. (arXiv:2208.09287v4 [eess.SP] UPDATED)\nAbstract: The limited over-the-air (OTA) pilot symbols in multiple-input-multiple-output orthogonal-frequency-division-multiplexing (MIMO-OFDM) systems presents a major challenge for detecting transmitted data symbols at the receiver, especially for machine learning-based approaches. While it is crucial to explore effective ways to exploit pilots, one can also take advantage of the data symbols to improve detection performance. Thus, this paper introduces an online attention-based approach, namely RC-AttStructNet-DF, that can efficiently utilize pilot symbols and be dynamically updated with the detected payload data using the decision feedback (DF) mechanism. Reservoir computing (RC) is employed in the time domain network to facilitate efficient online training. The frequency domain network adopts the novel 2D multi-head attention (MHA) module to capture the time and frequency correlations, and the structural-based StructNet to facilitate the DF mechanism. The attention loss is designed to learn",
    "path": "papers/22/08/2208.09287.json",
    "total_tokens": 887,
    "tldr": "本文提出了一种在线利用注意力机制和决策反馈进行MIMO-OFDM接收处理的结构学习方法，其中采用了储备计算和面向结构的网络，能有效利用导频符号和数据符号提高检测性能。"
}