{
    "title": "Multi-fidelity wavelet neural operator with application to uncertainty quantification. (arXiv:2208.05606v2 [cs.LG] UPDATED)",
    "abstract": "Operator learning frameworks, because of their ability to learn nonlinear maps between two infinite dimensional functional spaces and utilization of neural networks in doing so, have recently emerged as one of the more pertinent areas in the field of applied machine learning. Although these frameworks are extremely capable when it comes to modeling complex phenomena, they require an extensive amount of data for successful training which is often not available or is too expensive. However, this issue can be alleviated with the use of multi-fidelity learning, where a model is trained by making use of a large amount of inexpensive low-fidelity data along with a small amount of expensive high-fidelity data. To this end, we develop a new framework based on the wavelet neural operator which is capable of learning from a multi-fidelity dataset. The developed model's excellent learning capabilities are demonstrated by solving different problems which require effective correlation learning betw",
    "link": "http://arxiv.org/abs/2208.05606",
    "context": "Title: Multi-fidelity wavelet neural operator with application to uncertainty quantification. (arXiv:2208.05606v2 [cs.LG] UPDATED)\nAbstract: Operator learning frameworks, because of their ability to learn nonlinear maps between two infinite dimensional functional spaces and utilization of neural networks in doing so, have recently emerged as one of the more pertinent areas in the field of applied machine learning. Although these frameworks are extremely capable when it comes to modeling complex phenomena, they require an extensive amount of data for successful training which is often not available or is too expensive. However, this issue can be alleviated with the use of multi-fidelity learning, where a model is trained by making use of a large amount of inexpensive low-fidelity data along with a small amount of expensive high-fidelity data. To this end, we develop a new framework based on the wavelet neural operator which is capable of learning from a multi-fidelity dataset. The developed model's excellent learning capabilities are demonstrated by solving different problems which require effective correlation learning betw",
    "path": "papers/22/08/2208.05606.json",
    "total_tokens": 870,
    "translated_title": "多保真度小波神经算子及其在不确定性量化中的应用",
    "translated_abstract": "运算学习框架因其在两个无限维函数空间之间学习非线性映射的能力以及利用神经网络进行学习而在应用机器学习领域中最近成为一个更为重要的领域。尽管这些框架在建模复杂现象方面非常有能力，但为了成功训练，它们需要大量的数据，而这些数据通常不可用或过于昂贵。然而，使用多保真度学习可以缓解这个问题，其中模型使用大量廉价的低保真度数据和少量昂贵的高保真度数据进行训练。为此，我们开发了一个基于小波神经算子的新框架，该框架能够从多保真度数据集中进行学习。通过解决需要有效相关性学习的不同问题，我们展示了所开发模型的出色学习能力。",
    "tldr": "提出了一个基于小波神经算子的多保真度学习框架，可以利用廉价的低保真度数据和昂贵的高保真度数据进行训练。该框架展示了出色的学习能力，并解决了需要有效相关性学习的问题。",
    "en_tdlr": "A multi-fidelity learning framework based on wavelet neural operator is proposed, which utilizes both inexpensive low-fidelity data and expensive high-fidelity data for training. The framework demonstrates excellent learning capabilities and solves problems requiring effective correlation learning."
}