{
    "title": "Near-Optimal $\\Phi$-Regret Learning in Extensive-Form Games. (arXiv:2208.09747v2 [cs.GT] UPDATED)",
    "abstract": "In this paper, we establish efficient and uncoupled learning dynamics so that, when employed by all players in multiplayer perfect-recall imperfect-information extensive-form games, the trigger regret of each player grows as $O(\\log T)$ after $T$ repetitions of play. This improves exponentially over the prior best known trigger-regret bound of $O(T^{1/4})$, and settles a recent open question by Bai et al. (2022). As an immediate consequence, we guarantee convergence to the set of extensive-form correlated equilibria and coarse correlated equilibria at a near-optimal rate of $\\frac{\\log T}{T}$.  Building on prior work, at the heart of our construction lies a more general result regarding fixed points deriving from rational functions with polynomial degree, a property that we establish for the fixed points of (coarse) trigger deviation functions. Moreover, our construction leverages a refined regret circuit for the convex hull, which -- unlike prior guarantees -- preserves the RVU proper",
    "link": "http://arxiv.org/abs/2208.09747",
    "context": "Title: Near-Optimal $\\Phi$-Regret Learning in Extensive-Form Games. (arXiv:2208.09747v2 [cs.GT] UPDATED)\nAbstract: In this paper, we establish efficient and uncoupled learning dynamics so that, when employed by all players in multiplayer perfect-recall imperfect-information extensive-form games, the trigger regret of each player grows as $O(\\log T)$ after $T$ repetitions of play. This improves exponentially over the prior best known trigger-regret bound of $O(T^{1/4})$, and settles a recent open question by Bai et al. (2022). As an immediate consequence, we guarantee convergence to the set of extensive-form correlated equilibria and coarse correlated equilibria at a near-optimal rate of $\\frac{\\log T}{T}$.  Building on prior work, at the heart of our construction lies a more general result regarding fixed points deriving from rational functions with polynomial degree, a property that we establish for the fixed points of (coarse) trigger deviation functions. Moreover, our construction leverages a refined regret circuit for the convex hull, which -- unlike prior guarantees -- preserves the RVU proper",
    "path": "papers/22/08/2208.09747.json",
    "total_tokens": 1071,
    "translated_title": "博弈树中的NEAR-OPTIMAL PHI-REGRET学习",
    "translated_abstract": "本文在多人完美回忆不完美信息博弈中建立了有效和解耦的学习动力学，以便每个玩家的触发后悔在T次游戏重复后按$O(\\log T)$增长。这相对于先前已知的触发后悔边界$O(T^{1/4})$有指数级的改进，并解决了Bai等人（2022）提出的一个最近的开放问题。作为直接的结果，我们保证以接近最优的速度$\\frac{\\log T}{T}$收敛到广泛形式的相关均衡和粗略的相关均衡。在现有工作的基础上，我们的构建的核心是一个更为一般的由具有多项式次数的有理函数导出的不动点结果，这是我们为触发偏差函数（粗略的）固定点所建立的属性。此外，我们的构建利用了凸包的更细致的后悔电路，与先前的保证不同，它保留了RVU合适性的属性。",
    "tldr": "本文介绍了一种有效和解耦的学习动力学，在多人博弈中能够使每个玩家的触发后悔按$O(\\log T)$增长，达到接近最优的收敛速度。并且构建利用了一个更为一般的由具有多项式次数的有理函数导出的不动点结果，以及一个凸包的更细致的后悔电路，保留了RVU合适性的属性。",
    "en_tdlr": "This paper presents an efficient and uncoupled learning dynamics for multiplayer perfect-recall imperfect-information extensive-form games, which ensures that each player's trigger regret grows as $O(\\log T)$ after $T$ repetitions of play. The construction leverages a more general result regarding fixed points deriving from rational functions with polynomial degree and a refined regret circuit for the convex hull, preserving the RVU proper. The paper settles a recent open question by Bai et al. (2022) and guarantees convergence to the set of extensive-form correlated equilibria and coarse correlated equilibria at a near-optimal rate of $\\frac{\\log T}{T}$."
}