{
    "title": "Last-Iterate Convergence with Full and Noisy Feedback in Two-Player Zero-Sum Games. (arXiv:2208.09855v3 [cs.GT] UPDATED)",
    "abstract": "This paper proposes Mutation-Driven Multiplicative Weights Update (M2WU) for learning an equilibrium in two-player zero-sum normal-form games and proves that it exhibits the last-iterate convergence property in both full and noisy feedback settings. In the former, players observe their exact gradient vectors of the utility functions. In the latter, they only observe the noisy gradient vectors. Even the celebrated Multiplicative Weights Update (MWU) and Optimistic MWU (OMWU) algorithms may not converge to a Nash equilibrium with noisy feedback. On the contrary, M2WU exhibits the last-iterate convergence to a stationary point near a Nash equilibrium in both feedback settings. We then prove that it converges to an exact Nash equilibrium by iteratively adapting the mutation term. We empirically confirm that M2WU outperforms MWU and OMWU in exploitability and convergence rates.",
    "link": "http://arxiv.org/abs/2208.09855",
    "context": "Title: Last-Iterate Convergence with Full and Noisy Feedback in Two-Player Zero-Sum Games. (arXiv:2208.09855v3 [cs.GT] UPDATED)\nAbstract: This paper proposes Mutation-Driven Multiplicative Weights Update (M2WU) for learning an equilibrium in two-player zero-sum normal-form games and proves that it exhibits the last-iterate convergence property in both full and noisy feedback settings. In the former, players observe their exact gradient vectors of the utility functions. In the latter, they only observe the noisy gradient vectors. Even the celebrated Multiplicative Weights Update (MWU) and Optimistic MWU (OMWU) algorithms may not converge to a Nash equilibrium with noisy feedback. On the contrary, M2WU exhibits the last-iterate convergence to a stationary point near a Nash equilibrium in both feedback settings. We then prove that it converges to an exact Nash equilibrium by iteratively adapting the mutation term. We empirically confirm that M2WU outperforms MWU and OMWU in exploitability and convergence rates.",
    "path": "papers/22/08/2208.09855.json",
    "total_tokens": 941,
    "translated_title": "两人零和博弈中全反馈和噪声反馈下的最后迭代收敛",
    "translated_abstract": "本文提出了突变驱动乘性权重更新(M2WU)方法，用于学习两人零和正态型博弈中的均衡点，并证明了在全反馈和噪声反馈两种情况下都具有最后迭代收敛性质。其中，前者表示玩家观察到他们的效用函数的精确梯度向量，后者表示玩家只观察到带噪声的梯度向量。与广受欢迎的乘性权重更新(MWU)和乐观的MWU（OMWU）算法相比，在噪声反馈下，它们可能不能收敛到纳什均衡。相反，M2WU方法在两种反馈情况下都表现出最后迭代收敛到接近纳什均衡点的稳定点的性质。我们还证明了通过迭代适应突变项，M2WU方法最终会收敛到一个精确的纳什平衡状态。我们在实验中验证了M2WU在可利用性和收敛速度方面的优越性和效果高于MWU和OMWU算法。",
    "tldr": "本文提出的M2WU方法能够实现两人零和博弈中的最后迭代收敛，并在全反馈和噪声反馈情况下具有较高的性能和效果。",
    "en_tdlr": "The proposed M2WU method achieves last-iterate convergence in two-player zero-sum games with both full and noisy feedback, outperforming MWU and OMWU algorithms in exploitability and convergence rates."
}