{
    "title": "Unified Bayesian Frameworks for Multi-criteria Decision-making Problems. (arXiv:2208.13390v4 [cs.AI] UPDATED)",
    "abstract": "This paper introduces Bayesian frameworks for tackling various aspects of multi-criteria decision-making (MCDM) problems, leveraging a probabilistic interpretation of MCDM methods and challenges. By harnessing the flexibility of Bayesian models, the proposed frameworks offer statistically elegant solutions to key challenges in MCDM, such as group decision-making problems and criteria correlation. Additionally, these models can accommodate diverse forms of uncertainty in decision makers' (DMs) preferences, including normal and triangular distributions, as well as interval preferences. To address large-scale group MCDM scenarios, a probabilistic mixture model is developed, enabling the identification of homogeneous subgroups of DMs. Furthermore, a probabilistic ranking scheme is devised to assess the relative importance of criteria and alternatives based on DM(s) preferences. Through experimentation on various numerical examples, the proposed frameworks are validated, demonstrating their",
    "link": "http://arxiv.org/abs/2208.13390",
    "context": "Title: Unified Bayesian Frameworks for Multi-criteria Decision-making Problems. (arXiv:2208.13390v4 [cs.AI] UPDATED)\nAbstract: This paper introduces Bayesian frameworks for tackling various aspects of multi-criteria decision-making (MCDM) problems, leveraging a probabilistic interpretation of MCDM methods and challenges. By harnessing the flexibility of Bayesian models, the proposed frameworks offer statistically elegant solutions to key challenges in MCDM, such as group decision-making problems and criteria correlation. Additionally, these models can accommodate diverse forms of uncertainty in decision makers' (DMs) preferences, including normal and triangular distributions, as well as interval preferences. To address large-scale group MCDM scenarios, a probabilistic mixture model is developed, enabling the identification of homogeneous subgroups of DMs. Furthermore, a probabilistic ranking scheme is devised to assess the relative importance of criteria and alternatives based on DM(s) preferences. Through experimentation on various numerical examples, the proposed frameworks are validated, demonstrating their",
    "path": "papers/22/08/2208.13390.json",
    "total_tokens": 977,
    "translated_title": "统一贝叶斯框架用于多准则决策问题",
    "translated_abstract": "本文引入了贝叶斯框架来解决多准则决策问题的各个方面，利用概率解释多准则决策方法和挑战。通过利用贝叶斯模型的灵活性，提出的框架为多准则决策问题中的关键挑战，如团体决策问题和准则相关性，提供了统计优雅的解决方案。此外，这些模型可以适应决策者偏好中各种形式的不确定性，包括正态分布、三角分布和区间偏好。为了解决大规模团体多准则决策场景，开发了一个概率混合模型，可以识别出一致的决策者子群。此外，设计了一个概率排序方案，根据决策者偏好评估准则和备选方案的相对重要性。通过在各种数值示例上实验，验证了提出的框架，证明了它们的有效性。",
    "tldr": "本文引入了贝叶斯框架解决多准则决策问题，在团体决策问题和准则相关性方面提供了统计优雅的解决方案，适应了不同形式的决策者偏好，开发了识别决策者子群的混合模型，并设计了评估准则和备选方案相对重要性的概率排序方案。",
    "en_tdlr": "This paper introduces Bayesian frameworks that offer statistically elegant solutions to various aspects of multi-criteria decision-making (MCDM) problems, including group decision-making problems and criteria correlation. The frameworks accommodate diverse forms of decision makers' preferences, utilize a mixture model to identify homogeneous subgroups of decision makers, and devise a probabilistic ranking scheme to assess the relative importance of criteria and alternatives. Through experimentation, the proposed frameworks are validated and demonstrated their effectiveness."
}