{
    "title": "Continuous QA Learning with Structured Prompts",
    "abstract": "arXiv:2208.14602v3 Announce Type: replace-cross  Abstract: QA models with lifelong learning (LL) abilities are important for practical QA applications, and architecture-based LL methods are reported to be an effective implementation for these models. However, it is non-trivial to extend previous approaches to QA tasks since they either require access to task identities in the testing phase or do not explicitly model samples from unseen tasks. In this paper, we propose Diana: a dynamic architecture-based lifelong QA model that tries to learn a sequence of QA tasks with a prompt enhanced language model. Four types of hierarchically organized prompts are used in Diana to capture QA knowledge from different granularities. Specifically, we dedicate task-level prompts to capture task-specific knowledge to retain high LL performances and maintain instance-level prompts to learn knowledge shared across different input samples to improve the model's generalization performance. Moreover, we dedi",
    "link": "https://arxiv.org/abs/2208.14602",
    "context": "Title: Continuous QA Learning with Structured Prompts\nAbstract: arXiv:2208.14602v3 Announce Type: replace-cross  Abstract: QA models with lifelong learning (LL) abilities are important for practical QA applications, and architecture-based LL methods are reported to be an effective implementation for these models. However, it is non-trivial to extend previous approaches to QA tasks since they either require access to task identities in the testing phase or do not explicitly model samples from unseen tasks. In this paper, we propose Diana: a dynamic architecture-based lifelong QA model that tries to learn a sequence of QA tasks with a prompt enhanced language model. Four types of hierarchically organized prompts are used in Diana to capture QA knowledge from different granularities. Specifically, we dedicate task-level prompts to capture task-specific knowledge to retain high LL performances and maintain instance-level prompts to learn knowledge shared across different input samples to improve the model's generalization performance. Moreover, we dedi",
    "path": "papers/22/08/2208.14602.json",
    "total_tokens": 836,
    "translated_title": "具有结构化提示的持续问答学习",
    "translated_abstract": "具有终身学习（LL）能力的QA模型对于实际的QA应用至关重要，并且基于架构的LL方法被报告为这些模型的有效实现。然而，将先前的方法扩展到QA任务并不是一件简单的事情，因为它们要么在测试阶段需要访问任务标识，要么不明确地对来自未见任务的样本进行建模。在本文中，我们提出了Diana：一种基于动态架构的终身QA模型，试图通过增强语言模型学习一系列QA任务。在Diana中使用了四种层次组织的提示来捕获不同粒度的QA知识。具体来说，我们将任务级提示用于捕获任务特定知识，以保持高LL性能，并保持实例级提示来学习跨不同输入样本共享的知识以提高模型的泛化性能。",
    "tldr": "提出了一种名为Diana的动态架构终身QA模型，通过增强语言模型学习一系列QA任务，并使用四种层次组织的提示来捕获不同粒度的QA知识，以提高模型的泛化性能。",
    "en_tdlr": "Introduced Diana, a dynamic architecture-based lifelong QA model that learns a sequence of QA tasks with an enhanced language model and uses four hierarchically organized prompts to capture QA knowledge from different granularities, improving the model's generalization performance."
}