{
    "title": "A Hybrid Deep Feature-Based Deformable Image Registration Method for Pathology Images. (arXiv:2208.07655v4 [eess.IV] UPDATED)",
    "abstract": "Pathologists need to combine information from differently stained pathology slices for accurate diagnosis. Deformable image registration is a necessary technique for fusing multi-modal pathology slices. This paper proposes a hybrid deep feature-based deformable image registration framework for stained pathology samples. We first extract dense feature points via the detector-based and detector-free deep learning feature networks and perform points matching. Then, to further reduce false matches, an outlier detection method combining the isolation forest statistical model and the local affine correction model is proposed. Finally, the interpolation method generates the deformable vector field for pathology image registration based on the above matching points. We evaluate our method on the dataset of the Non-rigid Histology Image Registration (ANHIR) challenge, which is co-organized with the IEEE ISBI 2019 conference. Our technique outperforms the traditional approaches by 17% with the A",
    "link": "http://arxiv.org/abs/2208.07655",
    "context": "Title: A Hybrid Deep Feature-Based Deformable Image Registration Method for Pathology Images. (arXiv:2208.07655v4 [eess.IV] UPDATED)\nAbstract: Pathologists need to combine information from differently stained pathology slices for accurate diagnosis. Deformable image registration is a necessary technique for fusing multi-modal pathology slices. This paper proposes a hybrid deep feature-based deformable image registration framework for stained pathology samples. We first extract dense feature points via the detector-based and detector-free deep learning feature networks and perform points matching. Then, to further reduce false matches, an outlier detection method combining the isolation forest statistical model and the local affine correction model is proposed. Finally, the interpolation method generates the deformable vector field for pathology image registration based on the above matching points. We evaluate our method on the dataset of the Non-rigid Histology Image Registration (ANHIR) challenge, which is co-organized with the IEEE ISBI 2019 conference. Our technique outperforms the traditional approaches by 17% with the A",
    "path": "papers/22/08/2208.07655.json",
    "total_tokens": 1012,
    "translated_title": "一种基于深度特征的病理图像可变形配准的混合方法",
    "translated_abstract": "病理学家需要结合来自不同染色的病理切片的信息进行准确的诊断。可变形图像配准是融合多模态病理切片的必要技术。本文提出了一种混合的基于深度特征的可变形图像配准框架，用于染色病理样本。我们首先通过基于探测器和无探测器的深度学习特征网络提取密集特征点，并进行点匹配。然后，为了进一步减少错误匹配，提出一种离群值检测方法，将孤立森林统计模型和局部仿射校正模型相结合。最后，插值方法基于上述匹配点生成病理图像注册的可变形向量场。我们在与IEEE ISBI 2019会议联合组织的Non-rigid Histology Image Registration（ANHIR）挑战数据集上评估了我们的方法。我们的技术比传统方法提高了17％以上的A度量值。",
    "tldr": "本文提出了一种混合的基于深度特征的病理图像可变形配准框架，使用探测器和无探测器的深度学习特征网络提取密集的特征点，并通过孤立森林统计模型和局部仿射校正模型结合的离群值检测方法进一步减少错误匹配。在ANHIR挑战数据集上，本文所提出的方法比传统方法提高了17％以上的A度量值。",
    "en_tdlr": "This paper proposes a hybrid deep feature-based deformable image registration framework for stained pathology samples, which extracts dense feature points via detector-based and detector-free deep learning feature networks, and reduces false matches with an outlier detection method combining the isolation forest statistical model and the local affine correction model. The method outperforms traditional approaches by 17% with the A metric on the ANHIR challenge dataset."
}