{
    "title": "CTRL: Clustering Training Losses for Label Error Detection. (arXiv:2208.08464v2 [cs.LG] UPDATED)",
    "abstract": "In supervised machine learning, use of correct labels is extremely important to ensure high accuracy. Unfortunately, most datasets contain corrupted labels. Machine learning models trained on such datasets do not generalize well. Thus, detecting their label errors can significantly increase their efficacy. We propose a novel framework, called CTRL (Clustering TRaining Losses for label error detection), to detect label errors in multi-class datasets. It detects label errors in two steps based on the observation that models learn clean and noisy labels in different ways. First, we train a neural network using the noisy training dataset and obtain the loss curve for each sample. Then, we apply clustering algorithms to the training losses to group samples into two categories: cleanly-labeled and noisily-labeled. After label error detection, we remove samples with noisy labels and retrain the model. Our experimental results demonstrate state-of-the-art error detection accuracy on both image",
    "link": "http://arxiv.org/abs/2208.08464",
    "context": "Title: CTRL: Clustering Training Losses for Label Error Detection. (arXiv:2208.08464v2 [cs.LG] UPDATED)\nAbstract: In supervised machine learning, use of correct labels is extremely important to ensure high accuracy. Unfortunately, most datasets contain corrupted labels. Machine learning models trained on such datasets do not generalize well. Thus, detecting their label errors can significantly increase their efficacy. We propose a novel framework, called CTRL (Clustering TRaining Losses for label error detection), to detect label errors in multi-class datasets. It detects label errors in two steps based on the observation that models learn clean and noisy labels in different ways. First, we train a neural network using the noisy training dataset and obtain the loss curve for each sample. Then, we apply clustering algorithms to the training losses to group samples into two categories: cleanly-labeled and noisily-labeled. After label error detection, we remove samples with noisy labels and retrain the model. Our experimental results demonstrate state-of-the-art error detection accuracy on both image",
    "path": "papers/22/08/2208.08464.json",
    "total_tokens": 974,
    "translated_title": "CTRL: 针对标签错误检测进行聚类训练损失",
    "translated_abstract": "在监督式机器学习中，正确的标签使用非常重要，以确保高准确性。不幸的是，大多数数据集都包含有损标签。在这些数据集上训练的机器学习模型不具备良好的泛化能力。因此，检测其标签错误可以极大地提高其效果。我们提出了一种名为CTRL（Clustering TRaining Losses for label error detection）的新框架，用于检测多类别数据集中的标签错误。它根据模型以不同方式学习干净和有噪声标签的观察，通过两个步骤检测标签错误。首先，我们使用有噪声训练数据集训练神经网络并获得每个样本的损失曲线。然后，我们将聚类算法应用于训练损失，将样本分为两类：干净标记和有噪声标记。在标签错误检测后，我们删除具有噪声标签的样本并重新训练模型。我们的实验结果在图像数据集和文本数据集上展现出了最先进的错误检测准确性。",
    "tldr": "CTRL是一种用于检测多类别数据集中标签错误的新框架，通过聚类训练损失将样本分为干净标记和有噪声标记两类，并通过去除有噪声标签的样本来提高模型的效果。实验结果表明，该方法在图像和文本数据集上具有最先进的错误检测准确性。",
    "en_tdlr": "CTRL is a novel framework for detecting label errors in multi-class datasets. It clusters training losses to categorize samples into clean and noisy labels, and improves model performance by removing samples with noisy labels. Experimental results demonstrate state-of-the-art error detection accuracy on both image and text datasets."
}