{
    "title": "Stronger Privacy Amplification by Shuffling for R\\'enyi and Approximate Differential Privacy. (arXiv:2208.04591v2 [cs.CR] UPDATED)",
    "abstract": "The shuffle model of differential privacy has gained significant interest as an intermediate trust model between the standard local and central models [EFMRTT19; CSUZZ19]. A key result in this model is that randomly shuffling locally randomized data amplifies differential privacy guarantees. Such amplification implies substantially stronger privacy guarantees for systems in which data is contributed anonymously [BEMMRLRKTS17].  In this work, we improve the state of the art privacy amplification by shuffling results both theoretically and numerically. Our first contribution is the first asymptotically optimal analysis of the R\\'enyi differential privacy parameters for the shuffled outputs of LDP randomizers. Our second contribution is a new analysis of privacy amplification by shuffling. This analysis improves on the techniques of [FMT20] and leads to tighter numerical bounds in all parameter settings.",
    "link": "http://arxiv.org/abs/2208.04591",
    "context": "Title: Stronger Privacy Amplification by Shuffling for R\\'enyi and Approximate Differential Privacy. (arXiv:2208.04591v2 [cs.CR] UPDATED)\nAbstract: The shuffle model of differential privacy has gained significant interest as an intermediate trust model between the standard local and central models [EFMRTT19; CSUZZ19]. A key result in this model is that randomly shuffling locally randomized data amplifies differential privacy guarantees. Such amplification implies substantially stronger privacy guarantees for systems in which data is contributed anonymously [BEMMRLRKTS17].  In this work, we improve the state of the art privacy amplification by shuffling results both theoretically and numerically. Our first contribution is the first asymptotically optimal analysis of the R\\'enyi differential privacy parameters for the shuffled outputs of LDP randomizers. Our second contribution is a new analysis of privacy amplification by shuffling. This analysis improves on the techniques of [FMT20] and leads to tighter numerical bounds in all parameter settings.",
    "path": "papers/22/08/2208.04591.json",
    "total_tokens": 818,
    "translated_title": "R\\'enyi和近似差分隐私中通过洗牌实现更强隐私放大效果",
    "translated_abstract": "差分隐私的洗牌模型作为标准本地和集中模型之间的一种中间信任模型，引起了极大的关注。在该模型中的一个关键结果是，随机洗牌本地随机化数据可以放大差分隐私的保证。这种放大效果意味着对于匿名贡献数据的系统而言，隐私保证会更加强大。本研究在理论和数值上改进了洗牌导致的隐私放大效果。首先，我们首次提出了LDP随机化器洗牌输出的R\\'enyi差分隐私参数的渐近最优分析。其次，我们对隐私放大效果进行了新的分析，改进了[FMT20]的技术，并在所有参数设置下得到了更紧密的数值界限。",
    "tldr": "本研究在R\\'enyi和近似差分隐私中通过洗牌提出了更强隐私放大的方法，并对理论和数值进行了改进和优化。",
    "en_tdlr": "This paper presents stronger privacy amplification by shuffling in R\\'enyi and approximate differential privacy, improving the state of the art in theory and numerical analysis, and providing tighter bounds in all parameter settings."
}