{
    "title": "Machine Learning with Confidential Computing: A Systematization of Knowledge. (arXiv:2208.10134v2 [cs.CR] UPDATED)",
    "abstract": "Privacy and security challenges in Machine Learning (ML) have become increasingly severe, along with ML's pervasive development and the recent demonstration of large attack surfaces. As a mature system-oriented approach, Confidential Computing has been utilized in both academia and industry to mitigate privacy and security issues in various ML scenarios. In this paper, the conjunction between ML and Confidential Computing is investigated. We systematize the prior work on Confidential Computing-assisted ML techniques that provide i) confidentiality guarantees and ii) integrity assurances, and discuss their advanced features and drawbacks. Key challenges are further identified, and we provide dedicated analyses of the limitations in existing Trusted Execution Environment (TEE) systems for ML use cases. Finally, prospective works are discussed, including grounded privacy definitions for closed-loop protection, partitioned executions of efficient ML, dedicated TEE-assisted designs for ML, ",
    "link": "http://arxiv.org/abs/2208.10134",
    "context": "Title: Machine Learning with Confidential Computing: A Systematization of Knowledge. (arXiv:2208.10134v2 [cs.CR] UPDATED)\nAbstract: Privacy and security challenges in Machine Learning (ML) have become increasingly severe, along with ML's pervasive development and the recent demonstration of large attack surfaces. As a mature system-oriented approach, Confidential Computing has been utilized in both academia and industry to mitigate privacy and security issues in various ML scenarios. In this paper, the conjunction between ML and Confidential Computing is investigated. We systematize the prior work on Confidential Computing-assisted ML techniques that provide i) confidentiality guarantees and ii) integrity assurances, and discuss their advanced features and drawbacks. Key challenges are further identified, and we provide dedicated analyses of the limitations in existing Trusted Execution Environment (TEE) systems for ML use cases. Finally, prospective works are discussed, including grounded privacy definitions for closed-loop protection, partitioned executions of efficient ML, dedicated TEE-assisted designs for ML, ",
    "path": "papers/22/08/2208.10134.json",
    "total_tokens": 930,
    "translated_title": "机器学习与机密计算：知识系统化的概述",
    "translated_abstract": "随着机器学习的广泛发展和攻击面的扩大，机器学习中的隐私和安全挑战日益严重。作为一种成熟的系统级方法，机密计算已被学术界和工业界用于缓解各种机器学习场景中的隐私和安全问题。本文研究了机器学习和机密计算之间的结合。我们系统梳理了先前基于机密计算辅助的机器学习技术，提供了i）机密性保证和ii）完整性保证，并讨论了它们的高级特性和缺陷。进一步确定了关键挑战，并对现有的可信执行环境（TEE）系统在机器学习用例中的限制进行了专门的分析。最后，讨论了展望性的工作，包括闭环保护的基于地面的隐私定义，高效机器学习的分区执行，专门的TEE辅助机器学习设计。",
    "tldr": "本文研究机器学习和机密计算的结合，并梳理了先前的研究成果，提供了关于保证机密性和完整性的技术，同时讨论了它们的高级特性和局限性。本文进一步确定了现有的可信执行环境（TEE）系统在机器学习用例中的限制，并讨论了未来的展望。",
    "en_tdlr": "This paper investigates the combination of machine learning and confidential computing, and systematizes prior research on confidentiality and integrity guarantees in ML scenarios assisted by confidential computing. Limitations in existing trusted execution environment systems for ML use cases are identified and future work is discussed."
}