{
    "title": "The optimality of word lengths. Theoretical foundations and an empirical study. (arXiv:2208.10384v5 [cs.CL] UPDATED)",
    "abstract": "Zipf's law of abbreviation, namely the tendency of more frequent words to be shorter, has been viewed as a manifestation of compression, i.e. the minimization of the length of forms -- a universal principle of natural communication. Although the claim that languages are optimized has become trendy, attempts to measure the degree of optimization of languages have been rather scarce. Here we present two optimality scores that are dualy normalized, namely, they are normalized with respect to both the minimum and the random baseline. We analyze the theoretical and statistical pros and cons of these and other scores. Harnessing the best score, we quantify for the first time the degree of optimality of word lengths in languages. This indicates that languages are optimized to 62 or 67 percent on average (depending on the source) when word lengths are measured in characters, and to 65 percent on average when word lengths are measured in time. In general, spoken word durations are more optimize",
    "link": "http://arxiv.org/abs/2208.10384",
    "context": "Title: The optimality of word lengths. Theoretical foundations and an empirical study. (arXiv:2208.10384v5 [cs.CL] UPDATED)\nAbstract: Zipf's law of abbreviation, namely the tendency of more frequent words to be shorter, has been viewed as a manifestation of compression, i.e. the minimization of the length of forms -- a universal principle of natural communication. Although the claim that languages are optimized has become trendy, attempts to measure the degree of optimization of languages have been rather scarce. Here we present two optimality scores that are dualy normalized, namely, they are normalized with respect to both the minimum and the random baseline. We analyze the theoretical and statistical pros and cons of these and other scores. Harnessing the best score, we quantify for the first time the degree of optimality of word lengths in languages. This indicates that languages are optimized to 62 or 67 percent on average (depending on the source) when word lengths are measured in characters, and to 65 percent on average when word lengths are measured in time. In general, spoken word durations are more optimize",
    "path": "papers/22/08/2208.10384.json",
    "total_tokens": 966,
    "translated_title": "词长的最优性：理论基础和实证研究",
    "translated_abstract": "Zipf的缩写定律表明，更常见的词更短，这被视为压缩的一种表现——自然交流的普遍原则之一是形式长度的最小化。虽然语言优化的说法变得流行起来，但衡量语言优化程度的尝试却相当稀少。本文提出了两个正则化的最优性分数，它们是对最小和随机基线都进行了归一化处理的。我们分析了这些分数以及其他分数的理论和统计优缺点。利用最佳分数，我们首次量化了语言中词长的最优性程度。这表明当以字符计算词长时，语言平均优化到62或67％（取决于数据来源），当以时间计算词长时，平均为65％。总的来说，口语单词持续时间比书面词长更优化。我们的研究表明，语言在词长方面高度优化，而Zipf的缩写定律确实是压缩的一种表现。",
    "tldr": "本文提出了两个正则化的最优性分数，它们是对最小和随机基线都进行了归一化处理的。研究表明，语言在词长方面高度优化，而Zipf的缩写定律确实是压缩的一种表现。",
    "en_tdlr": "This paper proposes two normalized optimality scores and quantifies for the first time the degree of optimality of word lengths in languages. The study suggests that languages are highly optimized with respect to word lengths and that Zipf's law of abbreviation is indeed a manifestation of compression."
}