{
    "title": "Persuading Risk-Conscious Agents: A Geometric Approach. (arXiv:2208.03758v3 [econ.TH] UPDATED)",
    "abstract": "We consider a persuasion problem between a sender and a receiver whose utility may be nonlinear in her belief; we call such receivers risk-conscious. Such utility models arise when the receiver exhibits systematic biases away from expected-utility-maximization, such as uncertainty aversion (e.g., from sensitivity to the variance of the waiting time for a service). Due to this nonlinearity, the standard approach to finding the optimal persuasion mechanism using revelation principle fails. To overcome this difficulty, we use the underlying geometry of the problem to develop a convex optimization framework to find the optimal persuasion mechanism. We define the notion of full persuasion and use our framework to characterize conditions under which full persuasion can be achieved. We use our approach to study binary persuasion, where the receiver has two actions and the sender strictly prefers one of them at every state. Under a convexity assumption, we show that the binary persuasion probl",
    "link": "http://arxiv.org/abs/2208.03758",
    "context": "Title: Persuading Risk-Conscious Agents: A Geometric Approach. (arXiv:2208.03758v3 [econ.TH] UPDATED)\nAbstract: We consider a persuasion problem between a sender and a receiver whose utility may be nonlinear in her belief; we call such receivers risk-conscious. Such utility models arise when the receiver exhibits systematic biases away from expected-utility-maximization, such as uncertainty aversion (e.g., from sensitivity to the variance of the waiting time for a service). Due to this nonlinearity, the standard approach to finding the optimal persuasion mechanism using revelation principle fails. To overcome this difficulty, we use the underlying geometry of the problem to develop a convex optimization framework to find the optimal persuasion mechanism. We define the notion of full persuasion and use our framework to characterize conditions under which full persuasion can be achieved. We use our approach to study binary persuasion, where the receiver has two actions and the sender strictly prefers one of them at every state. Under a convexity assumption, we show that the binary persuasion probl",
    "path": "papers/22/08/2208.03758.json",
    "total_tokens": 921,
    "translated_title": "说服风险意识代理人：几何方法的应用",
    "translated_abstract": "我们考虑了一个发送者与一个其效用可能非线性于其信念的接收者之间的说服问题；我们将这样的接收者称为风险意识代理人。这样的效用模型出现在接收者偏离期望效用最大化的系统性偏差时，比如不确定度厌恶（例如，对服务等待时间方差的敏感性）。由于这种非线性，使用揭示原理寻找最优说服机制的标准方法失败了。为了克服这个困难，我们利用问题的底层几何性质，开发了一个凸优化框架来找到最优的说服机制。我们定义了完全说服的概念，并使用我们的框架来刻画完全说服可以实现的条件。我们用我们的方法研究了二元说服问题，其中接收者有两个行动，发送者在每个状态下都严格偏好其中一个。在凸性假设下，我们证明了二元说服问题的条件。",
    "tldr": "本研究利用几何方法解决了发送者与风险意识代理人之间的说服问题，提出了一个凸优化框架来找到最优的说服机制，并探讨了完全说服的实现条件。在二元说服问题中，我们证明了在凸性假设下可以找到最优解。"
}