{
    "title": "Differentiable WORLD Synthesizer-based Neural Vocoder With Application To End-To-End Audio Style Transfer. (arXiv:2208.07282v4 [eess.AS] UPDATED)",
    "abstract": "In this paper, we propose a differentiable WORLD synthesizer and demonstrate its use in end-to-end audio style transfer tasks such as (singing) voice conversion and the DDSP timbre transfer task. Accordingly, our baseline differentiable synthesizer has no model parameters, yet it yields adequate synthesis quality. We can extend the baseline synthesizer by appending lightweight black-box postnets which apply further processing to the baseline output in order to improve fidelity. An alternative differentiable approach considers extraction of the source excitation spectrum directly, which can improve naturalness albeit for a narrower class of style transfer applications. The acoustic feature parameterization used by our approaches has the added benefit that it naturally disentangles pitch and timbral information so that they can be modeled separately. Moreover, as there exists a robust means of estimating these acoustic features from monophonic audio sources, it allows for parameter loss ",
    "link": "http://arxiv.org/abs/2208.07282",
    "context": "Title: Differentiable WORLD Synthesizer-based Neural Vocoder With Application To End-To-End Audio Style Transfer. (arXiv:2208.07282v4 [eess.AS] UPDATED)\nAbstract: In this paper, we propose a differentiable WORLD synthesizer and demonstrate its use in end-to-end audio style transfer tasks such as (singing) voice conversion and the DDSP timbre transfer task. Accordingly, our baseline differentiable synthesizer has no model parameters, yet it yields adequate synthesis quality. We can extend the baseline synthesizer by appending lightweight black-box postnets which apply further processing to the baseline output in order to improve fidelity. An alternative differentiable approach considers extraction of the source excitation spectrum directly, which can improve naturalness albeit for a narrower class of style transfer applications. The acoustic feature parameterization used by our approaches has the added benefit that it naturally disentangles pitch and timbral information so that they can be modeled separately. Moreover, as there exists a robust means of estimating these acoustic features from monophonic audio sources, it allows for parameter loss ",
    "path": "papers/22/08/2208.07282.json",
    "total_tokens": 879,
    "translated_title": "基于可微分WORLD合成器的神经声码器及其在端到端音频风格转换中的应用",
    "translated_abstract": "本文提出了一种可微分的WORLD合成器，并展示了其在端到端音频风格转换任务（如（唱）声音转换和DDSP音色转换任务）中的应用。我们的基线可微分合成器没有模型参数，但它产生了足够的合成质量。我们可以通过附加轻量级的黑箱后网络来扩展基线合成器，以进一步处理基线输出，从而提高保真度。另一种可微分方法是直接提取源激发谱，这可以改善自然度，但仅适用于较窄的风格转换应用类别。我们方法使用的声学特征参数化具有附加的好处，它自然地将音高和音色信息分离开来，以便它们可以分别建模。此外，由于有一种强大的方法可以从单声道音频源估计这些声学特征，它允许风格转换任务中的参数损失。",
    "tldr": "比较不同方法在音频风格转换中的应用，提出一种可微分的WORLD合成器，并通过声学特征参数来实现音高和音色信息的分离。",
    "en_tdlr": "This paper proposes a differentiable WORLD synthesizer and compares different methods for end-to-end audio style transfer. The proposed approach uses acoustic feature parameterization to naturally disentangle pitch and timbral information for separate modeling."
}