{
    "title": "A biology-driven deep generative model for cell-type annotation in cytometry. (arXiv:2208.05745v2 [q-bio.QM] UPDATED)",
    "abstract": "Cytometry enables precise single-cell phenotyping within heterogeneous populations. These cell types are traditionally annotated via manual gating, but this method suffers from a lack of reproducibility and sensitivity to batch-effect. Also, the most recent cytometers - spectral flow or mass cytometers - create rich and high-dimensional data whose analysis via manual gating becomes challenging and time-consuming. To tackle these limitations, we introduce Scyan (https://github.com/MICS-Lab/scyan), a Single-cell Cytometry Annotation Network that automatically annotates cell types using only prior expert knowledge about the cytometry panel. We demonstrate that Scyan significantly outperforms the related state-of-the-art models on multiple public datasets while being faster and interpretable. In addition, Scyan overcomes several complementary tasks such as batch-effect removal, debarcoding, and population discovery. Overall, this model accelerates and eases cell population characterisation",
    "link": "http://arxiv.org/abs/2208.05745",
    "context": "Title: A biology-driven deep generative model for cell-type annotation in cytometry. (arXiv:2208.05745v2 [q-bio.QM] UPDATED)\nAbstract: Cytometry enables precise single-cell phenotyping within heterogeneous populations. These cell types are traditionally annotated via manual gating, but this method suffers from a lack of reproducibility and sensitivity to batch-effect. Also, the most recent cytometers - spectral flow or mass cytometers - create rich and high-dimensional data whose analysis via manual gating becomes challenging and time-consuming. To tackle these limitations, we introduce Scyan (https://github.com/MICS-Lab/scyan), a Single-cell Cytometry Annotation Network that automatically annotates cell types using only prior expert knowledge about the cytometry panel. We demonstrate that Scyan significantly outperforms the related state-of-the-art models on multiple public datasets while being faster and interpretable. In addition, Scyan overcomes several complementary tasks such as batch-effect removal, debarcoding, and population discovery. Overall, this model accelerates and eases cell population characterisation",
    "path": "papers/22/08/2208.05745.json",
    "total_tokens": 980,
    "translated_title": "一种基于生物学的深度生成模型用于细胞分类学中的单细胞注释",
    "translated_abstract": "细胞分类学可实现对杂多种群体内单个细胞的准确表型分析。传统上这些细胞按人工筛选方式进行分类，但这种方法缺乏再现性，且对批次效应敏感。最新的光谱流式细胞术或质谱细胞术创造了丰富和高维数据，而通过人工筛选的分析变得具有挑战性和耗时。为了解决这些限制，我们引入了Scyan（https://github.com/MICS-Lab/scyan），一种单细胞细胞学注释网络，仅使用有关细胞学面板的先前专家知识自动注释细胞类型。我们证明Scyan在多个公共数据集上的性能显着优于相关的最新模型，同时速度更快且具有可解释性。此外，Scyan还可解决几个辅助任务，例如批次效应去除、去条形码和人口发现。总体而言，这一模型加速和简化了细胞种群表征。",
    "tldr": "Scyan是一种单细胞细胞学注释网络，仅使用有关细胞学面板的先前专家知识自动注释细胞类型，旨在解决传统手动筛选细胞分类的缺乏再现性和人工耗时的问题。它还可以快速去除批次效应，去条形码和人口发现。",
    "en_tdlr": "Scyan is a single-cell cytometry annotation network that automatically annotates cell types using only prior expert knowledge about the cytometry panel to overcome the limitations of traditional manual gating method. It also accelerates and eases cell population characterization by addressing several complementary tasks such as batch-effect removal, debarcoding, and population discovery."
}