{
    "title": "Learning Invariant Representations under General Interventions on the Response. (arXiv:2208.10027v3 [stat.ME] UPDATED)",
    "abstract": "It has become increasingly common nowadays to collect observations of feature and response pairs from different environments. As a consequence, one has to apply learned predictors to data with a different distribution due to distribution shifts. One principled approach is to adopt the structural causal models to describe training and test models, following the invariance principle which says that the conditional distribution of the response given its predictors remains the same across environments. However, this principle might be violated in practical settings when the response is intervened. A natural question is whether it is still possible to identify other forms of invariance to facilitate prediction in unseen environments. To shed light on this challenging scenario, we focus on linear structural causal models (SCMs) and introduce invariant matching property (IMP), an explicit relation to capture interventions through an additional feature, leading to an alternative form of invari",
    "link": "http://arxiv.org/abs/2208.10027",
    "context": "Title: Learning Invariant Representations under General Interventions on the Response. (arXiv:2208.10027v3 [stat.ME] UPDATED)\nAbstract: It has become increasingly common nowadays to collect observations of feature and response pairs from different environments. As a consequence, one has to apply learned predictors to data with a different distribution due to distribution shifts. One principled approach is to adopt the structural causal models to describe training and test models, following the invariance principle which says that the conditional distribution of the response given its predictors remains the same across environments. However, this principle might be violated in practical settings when the response is intervened. A natural question is whether it is still possible to identify other forms of invariance to facilitate prediction in unseen environments. To shed light on this challenging scenario, we focus on linear structural causal models (SCMs) and introduce invariant matching property (IMP), an explicit relation to capture interventions through an additional feature, leading to an alternative form of invari",
    "path": "papers/22/08/2208.10027.json",
    "total_tokens": 834,
    "translated_title": "在响应上进行一般干预的学习不变表示",
    "translated_abstract": "如今，从不同环境中收集特征和响应对的观察变得越来越常见。因此，由于分布的变化，我们必须将学习到的预测器应用于具有不同分布的数据。一种有原则的方法是采用结构因果模型来描述训练和测试模型，遵循不变性原则，即给定预测器的条件分布在不同环境中保持不变。然而，在实际情况下，这个原则可能被违反，特别是在响应被干预的情况下。一个自然的问题是，在未知环境中是否仍然可能识别其他形式的不变性以促进预测。为了阐明这种具有挑战性的场景，我们专注于线性结构因果模型（SCMs）并引入不变匹配属性（IMP），这是通过附加特征来捕捉干预的一个明确关系，从而导致另一种形式的不变性。",
    "tldr": "本文研究了在响应被干预的情况下学习不变表示的问题，提出了不变匹配属性（IMP）作为一种捕捉干预关系的方法。",
    "en_tdlr": "This paper investigates learning invariant representations under interventions on the response and introduces the invariant matching property (IMP) as a way to capture intervention relationships."
}