{
    "title": "Learning Relational Causal Models with Cycles through Relational Acyclification. (arXiv:2208.12210v7 [cs.AI] UPDATED)",
    "abstract": "In real-world phenomena which involve mutual influence or causal effects between interconnected units, equilibrium states are typically represented with cycles in graphical models. An expressive class of graphical models, relational causal models, can represent and reason about complex dynamic systems exhibiting such cycles or feedback loops. Existing cyclic causal discovery algorithms for learning causal models from observational data assume that the data instances are independent and identically distributed which makes them unsuitable for relational causal models. At the same time, causal discovery algorithms for relational causal models assume acyclicity. In this work, we examine the necessary and sufficient conditions under which a constraint-based relational causal discovery algorithm is sound and complete for cyclic relational causal models. We introduce relational acyclification, an operation specifically designed for relational models that enables reasoning about the identifiab",
    "link": "http://arxiv.org/abs/2208.12210",
    "context": "Title: Learning Relational Causal Models with Cycles through Relational Acyclification. (arXiv:2208.12210v7 [cs.AI] UPDATED)\nAbstract: In real-world phenomena which involve mutual influence or causal effects between interconnected units, equilibrium states are typically represented with cycles in graphical models. An expressive class of graphical models, relational causal models, can represent and reason about complex dynamic systems exhibiting such cycles or feedback loops. Existing cyclic causal discovery algorithms for learning causal models from observational data assume that the data instances are independent and identically distributed which makes them unsuitable for relational causal models. At the same time, causal discovery algorithms for relational causal models assume acyclicity. In this work, we examine the necessary and sufficient conditions under which a constraint-based relational causal discovery algorithm is sound and complete for cyclic relational causal models. We introduce relational acyclification, an operation specifically designed for relational models that enables reasoning about the identifiab",
    "path": "papers/22/08/2208.12210.json",
    "total_tokens": 783,
    "translated_title": "通过关系无环化学习带有循环关系的关系因果模型",
    "translated_abstract": "在互相影响或具有因果效应的联通单元的现实世界现象中，平衡状态通常用图模型中的循环表示。关系因果模型是一种表达复杂动态系统且能展示循环或反馈环的图模型，可以表示和推理。现有的从观测数据学习因果模型的循环因果发现算法假定数据实例是独立且同分布的，因此不适用于关系因果模型。同时，为关系因果模型设计的因果发现算法假定了无环性。本文研究约束基的关系因果发现算法在关系循环因果模型中为什么是正确且完全的必要和充分条件。我们引入关系无环化作为一个为关系模型设计的操作，能够对可确定性做出推理。",
    "tldr": "本文通过引入关系无环化的算法，能够处理循环关系的因果模型，从而学习复杂动态系统。",
    "en_tdlr": "This paper introduces a relational acyclification algorithm, which enables the learning of complex dynamic systems with cyclic causal models, overcoming limitations in existing algorithms that assume acyclicity or independence and identical distribution of data instances."
}