{
    "title": "Bayesian Floor Field: Transferring people flow predictions across environments",
    "abstract": "arXiv:2208.10851v2 Announce Type: replace-cross  Abstract: Mapping people dynamics is a crucial skill for robots, because it enables them to coexist in human-inhabited environments. However, learning a model of people dynamics is a time consuming process which requires observation of large amount of people moving in an environment. Moreover, approaches for mapping dynamics are unable to transfer the learned models across environments: each model is only able to describe the dynamics of the environment it has been built in. However, the impact of architectural geometry on people's movement can be used to anticipate their patterns of dynamics, and recent work has looked into learning maps of dynamics from occupancy. So far however, approaches based on trajectories and those based on geometry have not been combined. In this work we propose a novel Bayesian approach to learn people dynamics able to combine knowledge about the environment geometry with observations from human trajectories. ",
    "link": "https://arxiv.org/abs/2208.10851",
    "context": "Title: Bayesian Floor Field: Transferring people flow predictions across environments\nAbstract: arXiv:2208.10851v2 Announce Type: replace-cross  Abstract: Mapping people dynamics is a crucial skill for robots, because it enables them to coexist in human-inhabited environments. However, learning a model of people dynamics is a time consuming process which requires observation of large amount of people moving in an environment. Moreover, approaches for mapping dynamics are unable to transfer the learned models across environments: each model is only able to describe the dynamics of the environment it has been built in. However, the impact of architectural geometry on people's movement can be used to anticipate their patterns of dynamics, and recent work has looked into learning maps of dynamics from occupancy. So far however, approaches based on trajectories and those based on geometry have not been combined. In this work we propose a novel Bayesian approach to learn people dynamics able to combine knowledge about the environment geometry with observations from human trajectories. ",
    "path": "papers/22/08/2208.10851.json",
    "total_tokens": 794,
    "translated_title": "贝叶斯地板场：跨环境传输人流预测",
    "translated_abstract": "映射人员动态对机器人非常重要，因为它使它们能够在人类居住的环境中共存。然而，学习人员动态模型是一个耗时的过程，需要观察大量人员在环境中移动。此外，用于映射动态的方法无法跨环境传输学习的模型。然而，建筑几何形状对人员移动的影响可以用来预测他们的动态模式，最近的研究已经开始从占用学习动态地图。到目前为止，基于轨迹和基于几何的方法尚未结合。在这项工作中，我们提出了一种新颖的贝叶斯方法来学习可以结合环境几何知识和来自人类轨迹的观察的人员动态。",
    "tldr": "提出了一种贝叶斯方法，能够结合环境几何知识和人类轨迹观察，学习人员动态，实现跨环境人流预测。"
}