{
    "title": "Risk-Aware Linear Bandits: Theory and Applications in Smart Order Routing. (arXiv:2208.02389v2 [cs.LG] UPDATED)",
    "abstract": "Motivated by practical considerations in machine learning for financial decision-making, such as risk aversion and large action space, we consider risk-aware bandits optimization with applications in smart order routing (SOR). Specifically, based on preliminary observations of linear price impacts made from the NASDAQ ITCH dataset, we initiate the study of risk-aware linear bandits. In this setting, we aim at minimizing regret, which measures our performance deficit compared to the optimum's, under the mean-variance metric when facing a set of actions whose rewards are linear functions of (initially) unknown parameters. Driven by the variance-minimizing globally-optimal (G-optimal) design, we propose the novel instance-independent Risk-Aware Explore-then-Commit (RISE) algorithm and the instance-dependent Risk-Aware Successive Elimination (RISE++) algorithm. Then, we rigorously analyze their near-optimal regret upper bounds to show that, by leveraging the linear structure, our algorithm",
    "link": "http://arxiv.org/abs/2208.02389",
    "context": "Title: Risk-Aware Linear Bandits: Theory and Applications in Smart Order Routing. (arXiv:2208.02389v2 [cs.LG] UPDATED)\nAbstract: Motivated by practical considerations in machine learning for financial decision-making, such as risk aversion and large action space, we consider risk-aware bandits optimization with applications in smart order routing (SOR). Specifically, based on preliminary observations of linear price impacts made from the NASDAQ ITCH dataset, we initiate the study of risk-aware linear bandits. In this setting, we aim at minimizing regret, which measures our performance deficit compared to the optimum's, under the mean-variance metric when facing a set of actions whose rewards are linear functions of (initially) unknown parameters. Driven by the variance-minimizing globally-optimal (G-optimal) design, we propose the novel instance-independent Risk-Aware Explore-then-Commit (RISE) algorithm and the instance-dependent Risk-Aware Successive Elimination (RISE++) algorithm. Then, we rigorously analyze their near-optimal regret upper bounds to show that, by leveraging the linear structure, our algorithm",
    "path": "papers/22/08/2208.02389.json",
    "total_tokens": 969,
    "translated_title": "风险意识的线性赌博机：理论和在智能订单路由中的应用",
    "translated_abstract": "受金融决策中机器学习的实际考虑（如风险厌恶和大型操作空间）的驱动，我们考虑了具有智能订单路由（SOR）应用的风险意识赌博机优化。具体来说，基于从纳斯达克ITCH数据集中对线性价格影响的初步观察，我们开展了风险意识线性赌博机的研究。在这种设置中，我们旨在在面对一组（最初）未知参数的线性函数作为奖励的行动时，通过使用均值方差度量来最小化遗憾，该度量反映了我们的表现与最优解之间的差距。基于方差最小化的全局最优（G-最优）设计，我们提出了独立于实例的全新的风险意识探索-承诺（RISE）算法和依赖于实例的风险意识连续淘汰（RISE++）算法。然后，我们通过严格分析它们近乎最优的遗憾上界，展示了通过利用线性结构，我们的算法的性能。",
    "tldr": "本论文研究了风险意识线性赌博机在智能订单路由中的应用，并提出了两种算法来最小化遗憾。分析表明，这些算法在近乎最优的情况下能够通过利用线性结构来提高性能。"
}