{
    "title": "Unsupervisedly Prompting AlphaFold2 for Few-Shot Learning of Accurate Folding Landscape and Protein Structure Prediction. (arXiv:2208.09652v2 [cs.LG] UPDATED)",
    "abstract": "Data-driven predictive methods which can efficiently and accurately transform protein sequences into biologically active structures are highly valuable for scientific research and medical development. Determining accurate folding landscape using co-evolutionary information is fundamental to the success of modern protein structure prediction methods. As the state of the art, AlphaFold2 has dramatically raised the accuracy without performing explicit co-evolutionary analysis. Nevertheless, its performance still shows strong dependence on available sequence homologs. Based on the interrogation on the cause of such dependence, we presented EvoGen, a meta generative model, to remedy the underperformance of AlphaFold2 for poor MSA targets. By prompting the model with calibrated or virtually generated homologue sequences, EvoGen helps AlphaFold2 fold accurately in low-data regime and even achieve encouraging performance with single-sequence predictions. Being able to make accurate predictions",
    "link": "http://arxiv.org/abs/2208.09652",
    "context": "Title: Unsupervisedly Prompting AlphaFold2 for Few-Shot Learning of Accurate Folding Landscape and Protein Structure Prediction. (arXiv:2208.09652v2 [cs.LG] UPDATED)\nAbstract: Data-driven predictive methods which can efficiently and accurately transform protein sequences into biologically active structures are highly valuable for scientific research and medical development. Determining accurate folding landscape using co-evolutionary information is fundamental to the success of modern protein structure prediction methods. As the state of the art, AlphaFold2 has dramatically raised the accuracy without performing explicit co-evolutionary analysis. Nevertheless, its performance still shows strong dependence on available sequence homologs. Based on the interrogation on the cause of such dependence, we presented EvoGen, a meta generative model, to remedy the underperformance of AlphaFold2 for poor MSA targets. By prompting the model with calibrated or virtually generated homologue sequences, EvoGen helps AlphaFold2 fold accurately in low-data regime and even achieve encouraging performance with single-sequence predictions. Being able to make accurate predictions",
    "path": "papers/22/08/2208.09652.json",
    "total_tokens": 899,
    "translated_title": "无监督引导AlphaFold2进行少样本学习的准确折叠路径和蛋白质结构预测",
    "translated_abstract": "数据驱动的预测方法能够高效准确地将蛋白质序列转化为生物活性结构，对科学研究和医学发展非常有价值。使用共进化信息确定准确的折叠路径是现代蛋白质结构预测方法成功的基础。作为最先进的方法，AlphaFold2在不进行显式共进化分析的情况下显著提高了准确性。然而，其性能仍然强烈依赖于可用的序列同源体。基于对这种依赖原因的探究，我们提出了EvoGen，一个元生成模型，以解决AlphaFold2在贫乏MSA目标上的性能不足。通过使用校准或虚拟生成的同源序列来引导模型，EvoGen帮助AlphaFold2在低数据环境中准确折叠，甚至在单序列预测中取得了令人鼓舞的性能。能够进行准确预测",
    "tldr": "本研究提出了EvoGen，一个元生成模型，通过使用校准或虚拟生成的同源序列来引导AlphaFold2模型，在少样本情况下实现准确的蛋白质折叠和结构预测。"
}