{
    "title": "Langevin Diffusion Variational Inference. (arXiv:2208.07743v2 [cs.LG] UPDATED)",
    "abstract": "Many methods that build powerful variational distributions based on unadjusted Langevin transitions exist. Most of these were developed using a wide range of different approaches and techniques. Unfortunately, the lack of a unified analysis and derivation makes developing new methods and reasoning about existing ones a challenging task. We address this giving a single analysis that unifies and generalizes these existing techniques. The main idea is to augment the target and variational by numerically simulating the underdamped Langevin diffusion process and its time reversal. The benefits of this approach are twofold: it provides a unified formulation for many existing methods, and it simplifies the development of new ones. In fact, using our formulation we propose a new method that combines the strengths of previously existing algorithms; it uses underdamped Langevin transitions and powerful augmentations parameterized by a score network. Our empirical evaluation shows that our propos",
    "link": "http://arxiv.org/abs/2208.07743",
    "context": "Title: Langevin Diffusion Variational Inference. (arXiv:2208.07743v2 [cs.LG] UPDATED)\nAbstract: Many methods that build powerful variational distributions based on unadjusted Langevin transitions exist. Most of these were developed using a wide range of different approaches and techniques. Unfortunately, the lack of a unified analysis and derivation makes developing new methods and reasoning about existing ones a challenging task. We address this giving a single analysis that unifies and generalizes these existing techniques. The main idea is to augment the target and variational by numerically simulating the underdamped Langevin diffusion process and its time reversal. The benefits of this approach are twofold: it provides a unified formulation for many existing methods, and it simplifies the development of new ones. In fact, using our formulation we propose a new method that combines the strengths of previously existing algorithms; it uses underdamped Langevin transitions and powerful augmentations parameterized by a score network. Our empirical evaluation shows that our propos",
    "path": "papers/22/08/2208.07743.json",
    "total_tokens": 874,
    "translated_title": "Langevin扩散变分推断",
    "translated_abstract": "许多基于未调整Langevin转移的强大变分分布构建方法已经存在。但是，它们大多采用了各种不同的方法和技术，缺乏统一的分析和推导，从而使开发新方法和推理现有方法成为一项具有挑战性的任务。为了解决这个问题，我们提出了一种单一的分析方法，以统一和概括这些现有技术。主要思想是通过数值模拟欠阻尼Langevin扩散过程及其时间翻转对目标和变分进行增广。这种方法的好处有两个方面：它为许多现有方法提供了统一的公式，并简化了新方法的开发。事实上，利用我们的公式，我们提出了一种新方法，它结合了以前现有算法的优点；它使用欠阻尼Langevin转移和由得分网络参数化的强大的增广。我们的实证评估显示，我们提出的方法在一系列基准问题上优于现有方法。",
    "tldr": "本论文提出了一种统一的分析方法以概括并改进现有的基于未调整Langevin转移的强大变分分布构建方法，同时提出了一种新方法，在基准测试中表现更好。",
    "en_tdlr": "This paper proposes a unified analysis method to generalize and improve existing powerful variational distribution building methods based on unadjusted Langevin transitions, and presents a new method that performs better in benchmark tests."
}