{
    "title": "Sharp Analysis of Sketch-and-Project Methods via a Connection to Randomized Singular Value Decomposition. (arXiv:2208.09585v2 [math.OC] UPDATED)",
    "abstract": "Sketch-and-project is a framework which unifies many known iterative methods for solving linear systems and their variants, as well as further extensions to non-linear optimization problems. It includes popular methods such as randomized Kaczmarz, coordinate descent, variants of the Newton method in convex optimization, and others. In this paper, we develop a theoretical framework for obtaining sharp guarantees on the convergence rate of sketch-and-project methods. Our approach is the first to: (1) show that the convergence rate improves at least linearly with the sketch size, and even faster when the data matrix exhibits certain spectral decays; and (2) allow for sparse sketching matrices, which are more efficient than dense sketches and more robust than sub-sampling methods. In particular, our results explain an observed phenomenon that a radical sparsification of the sketching matrix does not affect the per iteration convergence rate of sketch-and-project. To obtain our results, we ",
    "link": "http://arxiv.org/abs/2208.09585",
    "context": "Title: Sharp Analysis of Sketch-and-Project Methods via a Connection to Randomized Singular Value Decomposition. (arXiv:2208.09585v2 [math.OC] UPDATED)\nAbstract: Sketch-and-project is a framework which unifies many known iterative methods for solving linear systems and their variants, as well as further extensions to non-linear optimization problems. It includes popular methods such as randomized Kaczmarz, coordinate descent, variants of the Newton method in convex optimization, and others. In this paper, we develop a theoretical framework for obtaining sharp guarantees on the convergence rate of sketch-and-project methods. Our approach is the first to: (1) show that the convergence rate improves at least linearly with the sketch size, and even faster when the data matrix exhibits certain spectral decays; and (2) allow for sparse sketching matrices, which are more efficient than dense sketches and more robust than sub-sampling methods. In particular, our results explain an observed phenomenon that a radical sparsification of the sketching matrix does not affect the per iteration convergence rate of sketch-and-project. To obtain our results, we ",
    "path": "papers/22/08/2208.09585.json",
    "total_tokens": 869,
    "translated_title": "通过与随机奇异值分解的连接，对草图投影方法进行了尖锐分析",
    "translated_abstract": "草图投影是一个统一了许多已知迭代方法以及它们的变体的框架，用于解线性系统和非线性优化问题。本文提出了一个理论框架，以获得草图投影方法的收敛速度的尖锐保证。我们的方法首次展示了：（1）收敛速度至少与草图大小线性增加，当数据矩阵具有一定的谱衰减时，收敛速度增加更快；（2）允许使用稀疏的草图矩阵，这比密集草图更有效率，比子采样方法更稳健。特别是，我们的结果解释了一个观察到的现象，即对草图矩阵进行激进的稀疏化不会影响草图投影的每次迭代收敛速度。",
    "tldr": "本文通过与随机奇异值分解的连接，对草图投影方法进行了尖锐分析，首次展示了草图大小与收敛速度的线性关系，同时解释了稀疏草图矩阵对每次迭代收敛速度的影响。"
}