{
    "title": "Non-Asymptotic Analysis of Ensemble Kalman Updates: Effective Dimension and Localization. (arXiv:2208.03246v2 [stat.ML] UPDATED)",
    "abstract": "Many modern algorithms for inverse problems and data assimilation rely on ensemble Kalman updates to blend prior predictions with observed data. Ensemble Kalman methods often perform well with a small ensemble size, which is essential in applications where generating each particle is costly. This paper develops a non-asymptotic analysis of ensemble Kalman updates that rigorously explains why a small ensemble size suffices if the prior covariance has moderate effective dimension due to fast spectrum decay or approximate sparsity. We present our theory in a unified framework, comparing several implementations of ensemble Kalman updates that use perturbed observations, square root filtering, and localization. As part of our analysis, we develop new dimension-free covariance estimation bounds for approximately sparse matrices that may be of independent interest.",
    "link": "http://arxiv.org/abs/2208.03246",
    "context": "Title: Non-Asymptotic Analysis of Ensemble Kalman Updates: Effective Dimension and Localization. (arXiv:2208.03246v2 [stat.ML] UPDATED)\nAbstract: Many modern algorithms for inverse problems and data assimilation rely on ensemble Kalman updates to blend prior predictions with observed data. Ensemble Kalman methods often perform well with a small ensemble size, which is essential in applications where generating each particle is costly. This paper develops a non-asymptotic analysis of ensemble Kalman updates that rigorously explains why a small ensemble size suffices if the prior covariance has moderate effective dimension due to fast spectrum decay or approximate sparsity. We present our theory in a unified framework, comparing several implementations of ensemble Kalman updates that use perturbed observations, square root filtering, and localization. As part of our analysis, we develop new dimension-free covariance estimation bounds for approximately sparse matrices that may be of independent interest.",
    "path": "papers/22/08/2208.03246.json",
    "total_tokens": 870,
    "translated_title": "集合卡尔曼更新的非渐近分析: 有效维度和本地化",
    "translated_abstract": "许多用于反问题和数据同化的现代算法依赖于集合卡尔曼更新来将先前的预测结果与观测数据融合。集合卡尔曼方法通常在小集合大小时表现良好，这在生成每个粒子很昂贵的应用中是必要的。本文开发了集合卡尔曼更新的非渐近分析，从理论上严格说明了为什么如果先前的协方差具有中等的有效维度，快速谱衰减或近似稀疏，则小的集合大小就足够了。我们在统一框架下提出了我们的理论，比较了使用扰动观测、平方根滤波和本地化的集合卡尔曼更新的几种实现。作为我们分析的一部分，我们开发了适用于近似稀疏矩阵的无维度协方差估计界限，这可能是独立感兴趣的内容。",
    "tldr": "本文开发了集合卡尔曼更新的非渐近分析，解释了为什么在先前的协方差具有中等的有效维度、快速谱衰减或近似稀疏的情况下，小的集合大小就足够了。",
    "en_tdlr": "This paper develops a non-asymptotic analysis of ensemble Kalman updates and explains why a small ensemble size suffices if the prior covariance has moderate effective dimension due to fast spectrum decay or approximate sparsity."
}