{
    "title": "A Missing Value Filling Model Based on Feature Fusion Enhanced Autoencoder. (arXiv:2208.13495v2 [cs.LG] UPDATED)",
    "abstract": "With the advent of the big data era, the data quality problem is becoming more critical. Among many factors, data with missing values is one primary issue, and thus developing effective imputation models is a key topic in the research community. Recently, a major research direction is to employ neural network models such as self-organizing mappings or automatic encoders for filling missing values. However, these classical methods can hardly discover interrelated features and common features simultaneously among data attributes. Especially, it is a very typical problem for classical autoencoders that they often learn invalid constant mappings, which dramatically hurts the filling performance. To solve the above-mentioned problems, we propose a missing-value-filling model based on a feature-fusion-enhanced autoencoder. We first incorporate into an autoencoder a hidden layer that consists of de-tracking neurons and radial basis function neurons, which can enhance the ability of learning i",
    "link": "http://arxiv.org/abs/2208.13495",
    "context": "Title: A Missing Value Filling Model Based on Feature Fusion Enhanced Autoencoder. (arXiv:2208.13495v2 [cs.LG] UPDATED)\nAbstract: With the advent of the big data era, the data quality problem is becoming more critical. Among many factors, data with missing values is one primary issue, and thus developing effective imputation models is a key topic in the research community. Recently, a major research direction is to employ neural network models such as self-organizing mappings or automatic encoders for filling missing values. However, these classical methods can hardly discover interrelated features and common features simultaneously among data attributes. Especially, it is a very typical problem for classical autoencoders that they often learn invalid constant mappings, which dramatically hurts the filling performance. To solve the above-mentioned problems, we propose a missing-value-filling model based on a feature-fusion-enhanced autoencoder. We first incorporate into an autoencoder a hidden layer that consists of de-tracking neurons and radial basis function neurons, which can enhance the ability of learning i",
    "path": "papers/22/08/2208.13495.json",
    "total_tokens": 898,
    "translated_title": "基于特征融合增强自编码器的缺失值填充模型",
    "translated_abstract": "随着大数据时代的到来，数据质量问题变得更加关键。在众多因素中，缺失值数据是一个主要问题，因此开发有效的填充模型成为研究社区的一个关键课题。最近，一项主要的研究方向是利用神经网络模型，如自组织映射或自动编码器来填充缺失值。然而，这些传统方法很难同时发现数据属性间的相关特征和共同特征。特别是，对于经典的自动编码器来说，他们常常学习到无效的常量映射，这严重影响了填充性能。为了解决上述问题，我们提出了一种基于特征融合增强自编码器的缺失值填充模型。我们首先在自编码器中引入了一个包含去轨迹神经元和径向基神经元的隐藏层，这可以增强学习相关特征和共同特征的能力。",
    "tldr": "本文提出了一种基于特征融合增强自编码器的缺失值填充模型，通过引入去轨迹神经元和径向基神经元的隐藏层，实现了同时学习相关特征和共同特征的能力。"
}