{
    "title": "Neuro-Dynamic State Estimation for Networked Microgrids. (arXiv:2208.12288v2 [eess.SY] UPDATED)",
    "abstract": "We devise neuro-dynamic state estimation (Neuro-DSE), a learning-based dynamic state estimation (DSE) algorithm for networked microgrids (NMs) under unknown subsystems. Our contributions include: 1) a data-driven Neuro-DSE algorithm for NMs DSE with partially unidentified dynamic models, which incorporates the neural-ordinary-differential-equations (ODE-Net) into Kalman filters; 2) a self-refining Neuro-DSE algorithm (Neuro-DSE+) which enables data-driven DSE under limited and noisy measurements by establishing an automatic filtering, augmenting and correcting framework; 3) a Neuro-KalmanNet-DSE algorithm which further integrates KalmanNet with Neuro-DSE to relieve the model mismatch of both neural- and physics-based dynamic models; and 4) an augmented Neuro-DSE for joint estimation of NMs states and unknown parameters (e.g., inertia). Extensive case studies demonstrate the efficacy of Neuro-DSE and its variants under different noise levels, control modes, power sources, observabilitie",
    "link": "http://arxiv.org/abs/2208.12288",
    "context": "Title: Neuro-Dynamic State Estimation for Networked Microgrids. (arXiv:2208.12288v2 [eess.SY] UPDATED)\nAbstract: We devise neuro-dynamic state estimation (Neuro-DSE), a learning-based dynamic state estimation (DSE) algorithm for networked microgrids (NMs) under unknown subsystems. Our contributions include: 1) a data-driven Neuro-DSE algorithm for NMs DSE with partially unidentified dynamic models, which incorporates the neural-ordinary-differential-equations (ODE-Net) into Kalman filters; 2) a self-refining Neuro-DSE algorithm (Neuro-DSE+) which enables data-driven DSE under limited and noisy measurements by establishing an automatic filtering, augmenting and correcting framework; 3) a Neuro-KalmanNet-DSE algorithm which further integrates KalmanNet with Neuro-DSE to relieve the model mismatch of both neural- and physics-based dynamic models; and 4) an augmented Neuro-DSE for joint estimation of NMs states and unknown parameters (e.g., inertia). Extensive case studies demonstrate the efficacy of Neuro-DSE and its variants under different noise levels, control modes, power sources, observabilitie",
    "path": "papers/22/08/2208.12288.json",
    "total_tokens": 1100,
    "translated_title": "网络化微电网的神经动态状态估计",
    "translated_abstract": "我们设计了一个名为神经动态状态估计（Neuro-DSE）的基于学习的动态状态估计（DSE）算法，用于未知子系统的网络化微电网（NM）。我们的贡献包括：1）一种基于数据驱动的Neuro-DSE算法，用于具有部分未知动态模型的NM DSE，该算法将神经常微分方程（ODE-Net）与卡尔曼滤波器相结合；2）一种自我完善的Neuro-DSE算法（Neuro-DSE+），通过建立自动过滤、增加和校正框架，使得在有限且存在噪声测量情况下可以进行数据驱动的DSE；3）一种称为神经KalmanNet-DSE的算法，进一步将KalmanNet与Neuro-DSE相结合，以缓解神经和物理动态模型之间的模型不匹配；4）一种增强的Neuro-DSE算法，用于联合估计NM状态和未知参数（如惯性）。大量案例研究证明了Neuro-DSE及其变体在不同噪声水平、控制模式、电源和可观测性下的有效性。",
    "tldr": "这项研究提出了一种神经动态状态估计算法，用于网络化微电网中的未知子系统。具体贡献包括：基于数据驱动的Neuro-DSE算法、自我完善的Neuro-DSE+算法、神经KalmanNet-DSE算法以及用于联合估计微电网状态和未知参数的增强Neuro-DSE算法。大量实验表明，在不同噪声水平、控制模式、电源和可观测性下，这些算法都具有有效性。",
    "en_tdlr": "This research proposes a neuro-dynamic state estimation algorithm for networked microgrids with unknown subsystems. The contributions include a data-driven Neuro-DSE algorithm, a self-refining Neuro-DSE+ algorithm, a Neuro-KalmanNet-DSE algorithm, and an augmented Neuro-DSE algorithm for joint estimation of microgrid states and unknown parameters. Extensive experiments demonstrate the effectiveness of these algorithms under various noise levels, control modes, power sources, and observability."
}