{
    "title": "FIGO: Enhanced Fingerprint Identification Approach Using GAN and One Shot Learning Techniques. (arXiv:2208.05615v2 [cs.CV] UPDATED)",
    "abstract": "Fingerprint evidence plays an important role in a criminal investigation for the identification of individuals. Although various techniques have been proposed for fingerprint classification and feature extraction, automated fingerprint identification of fingerprints is still in its earliest stage. The performance of traditional \\textit{Automatic Fingerprint Identification System} (AFIS) depends on the presence of valid minutiae points and still requires human expert assistance in feature extraction and identification stages. Based on this motivation, we propose a Fingerprint Identification approach based on Generative adversarial network and One-shot learning techniques (FIGO). Our solution contains two components: fingerprint enhancement tier and fingerprint identification tier. First, we propose a Pix2Pix model to transform low-quality fingerprint images to a higher level of fingerprint images pixel by pixel directly in the fingerprint enhancement tier. With the proposed enhancement ",
    "link": "http://arxiv.org/abs/2208.05615",
    "context": "Title: FIGO: Enhanced Fingerprint Identification Approach Using GAN and One Shot Learning Techniques. (arXiv:2208.05615v2 [cs.CV] UPDATED)\nAbstract: Fingerprint evidence plays an important role in a criminal investigation for the identification of individuals. Although various techniques have been proposed for fingerprint classification and feature extraction, automated fingerprint identification of fingerprints is still in its earliest stage. The performance of traditional \\textit{Automatic Fingerprint Identification System} (AFIS) depends on the presence of valid minutiae points and still requires human expert assistance in feature extraction and identification stages. Based on this motivation, we propose a Fingerprint Identification approach based on Generative adversarial network and One-shot learning techniques (FIGO). Our solution contains two components: fingerprint enhancement tier and fingerprint identification tier. First, we propose a Pix2Pix model to transform low-quality fingerprint images to a higher level of fingerprint images pixel by pixel directly in the fingerprint enhancement tier. With the proposed enhancement ",
    "path": "papers/22/08/2208.05615.json",
    "total_tokens": 885,
    "translated_title": "FIGO:使用GAN和单样本学习技术的增强指纹识别方法",
    "translated_abstract": "指纹证据在刑侦调查中发挥着重要作用，但自动化指纹识别仍处于早期阶段。本文提出了一种基于生成对抗网络和单样本学习技术的指纹识别方法（FIGO），包含指纹增强和指纹识别两个环节。采用Pix2Pix模型直接在指纹增强环节将低质量指纹图像转换为高像素水平指纹图像，使用一次学习技术和孪生网络架构在识别环节中进行指纹信息的分类和比对。实验结果表明，与其他方法相比，该方法取得了更好的性能。",
    "tldr": "本文提出了一种基于GAN和单样本学习技术的FIGO指纹识别方法，通过Pix2Pix模型对低质量指纹图像进行增强，在识别环节中使用一次学习进行指纹信息分类，取得了更好的性能。",
    "en_tdlr": "This paper proposes a fingerprint identification method based on GAN and one-shot learning techniques (FIGO), which enhances low-quality fingerprint images using a Pix2Pix model and identifies fingerprints using one-shot learning with a Siamese network architecture, achieving better performance compared to state-of-the-art methods."
}