{
    "title": "Scalable Multi-Agent Lab Framework for Lab Optimization. (arXiv:2208.09099v3 [cs.MA] UPDATED)",
    "abstract": "Autonomous materials research systems allow scientists to fail smarter, learn faster, and spend less resources in their studies. As these systems grow in number, capability, and complexity, a new challenge arises - how will they work together across large facilities? We explore one solution to this question - a multi-agent laboratory control frame-work. We demonstrate this framework with an autonomous material science lab in mind - where information from diverse research campaigns can be combined to ad-dress the scientific question at hand. This framework can 1) account for realistic resource limits such as equipment use, 2) allow for machine learning agents with diverse learning capabilities and goals capable of running re-search campaigns, and 3) facilitate multi-agent collaborations and teams. The framework is dubbed the MULTI-agent auTonomous fAcilities - a Scalable frameworK aka MULTITASK. MULTITASK makes possible facility-wide simulations, including agent-instrument and agent-age",
    "link": "http://arxiv.org/abs/2208.09099",
    "context": "Title: Scalable Multi-Agent Lab Framework for Lab Optimization. (arXiv:2208.09099v3 [cs.MA] UPDATED)\nAbstract: Autonomous materials research systems allow scientists to fail smarter, learn faster, and spend less resources in their studies. As these systems grow in number, capability, and complexity, a new challenge arises - how will they work together across large facilities? We explore one solution to this question - a multi-agent laboratory control frame-work. We demonstrate this framework with an autonomous material science lab in mind - where information from diverse research campaigns can be combined to ad-dress the scientific question at hand. This framework can 1) account for realistic resource limits such as equipment use, 2) allow for machine learning agents with diverse learning capabilities and goals capable of running re-search campaigns, and 3) facilitate multi-agent collaborations and teams. The framework is dubbed the MULTI-agent auTonomous fAcilities - a Scalable frameworK aka MULTITASK. MULTITASK makes possible facility-wide simulations, including agent-instrument and agent-age",
    "path": "papers/22/08/2208.09099.json",
    "total_tokens": 951,
    "translated_title": "可扩展的多智能体实验室优化框架",
    "translated_abstract": "自主材料研究系统让科学家能够更加聪明地失败、更快地学习，以及在研究中节省更少的资源。随着这些系统在数量、能力和复杂性上的增长，一个新的挑战出现了——如何让它们在大型设施中共同工作呢？我们探讨了一种解决这个问题的方法——多智能体实验室控制框架。我们以自主材料科学实验室为例来演示这个框架，其中来自不同研究活动的信息可以被合并来解决手头的科学问题。这个框架可以 1）考虑到现实资源限制，如设备使用；2）允许具有不同学习能力和目标的机器学习智能体来运行研究活动；以及 3）促进多智能体协作和团队。该框架被称为可扩展的多智能体自主设施框架，即MULTITASK。MULTITASK使得设施范围内的模拟成为可能，包括智能体-仪器和智能体-智能体之间的交互。",
    "tldr": "本文介绍了一种可扩展的多智能体实验室优化框架，能够有效地控制设备使用，让具有不同学习能力和目标的机器学习智能体协同运行研究活动。",
    "en_tdlr": "This paper introduces a scalable multi-agent laboratory optimization framework, which can effectively control resource limits such as equipment use, and enables machine learning agents with diverse learning capabilities and goals to collaborate in running research campaigns."
}