{
    "title": "Individual Claims Reserving using Activation Patterns. (arXiv:2208.08430v3 [q-fin.MF] UPDATED)",
    "abstract": "The occurrence of a claim often impacts not one but multiple insurance coverages provided in the contract. To account for this multivariate feature, we propose a new individual claims reserving model built around the activation of the different coverages to predict the reserve amounts. Using the framework of multinomial logistic regression, we model the activation of the different insurance coverages for each claim and their development in the following years, i.e. the activation of other coverages in the later years and all the possible payments that might result from them. As such, the model allows us to complete the individual development of the open claims in the portfolio. Using a recent automobile dataset from a major Canadian insurance company, we demonstrate that this approach generates accurate predictions of the total reserves as well as of the reserves per insurance coverage. This allows the insurer to get better insights in the dynamics of his claims reserves.",
    "link": "http://arxiv.org/abs/2208.08430",
    "context": "Title: Individual Claims Reserving using Activation Patterns. (arXiv:2208.08430v3 [q-fin.MF] UPDATED)\nAbstract: The occurrence of a claim often impacts not one but multiple insurance coverages provided in the contract. To account for this multivariate feature, we propose a new individual claims reserving model built around the activation of the different coverages to predict the reserve amounts. Using the framework of multinomial logistic regression, we model the activation of the different insurance coverages for each claim and their development in the following years, i.e. the activation of other coverages in the later years and all the possible payments that might result from them. As such, the model allows us to complete the individual development of the open claims in the portfolio. Using a recent automobile dataset from a major Canadian insurance company, we demonstrate that this approach generates accurate predictions of the total reserves as well as of the reserves per insurance coverage. This allows the insurer to get better insights in the dynamics of his claims reserves.",
    "path": "papers/22/08/2208.08430.json",
    "total_tokens": 871,
    "translated_title": "利用激活模式进行个别理赔准备金估计",
    "translated_abstract": "一个索赔的发生往往不仅会影响合同中提供的一项保险，而是多个保险。为了考虑到这种多变量特性，我们提出了一种围绕不同保险激活来预测准备金金额的新个别索赔准备金模型。使用多项逻辑回归的框架，我们模拟了每项索赔的不同保险的激活情况以及其在后续年份中的发展，即后续年份中其他保险的激活情况以及可能由此产生的所有可能支付。因此，该模型允许我们完成投资组合中的个别未决索赔的发展。利用来自加拿大一家主要保险公司的最新汽车数据集，我们证明了这种方法能够准确预测总准备金以及每项保险的准备金，从而使保险人能够更好地了解其索赔准备金的动态。",
    "tldr": "通过激活模式，我们提出了一种利用多项逻辑回归模型来预测个别索赔准备金的方法。通过使用加拿大一家主要保险公司的汽车数据集进行验证，我们证明了这种方法能够准确预测总准备金和每个保险类别的准备金，有助于保险人更好地了解其索赔准备金的动态。"
}