{
    "title": "GSim: A Graph Neural Network based Relevance Measure for Heterogeneous Graphs. (arXiv:2208.06144v2 [cs.IR] UPDATED)",
    "abstract": "Heterogeneous graphs, which contain nodes and edges of multiple types, are prevalent in various domains, including bibliographic networks, social media, and knowledge graphs. As a fundamental task in analyzing heterogeneous graphs, relevance measure aims to calculate the relevance between two objects of different types, which has been used in many applications such as web search, recommendation, and community detection. Most of existing relevance measures focus on homogeneous networks where objects are of the same type, and a few measures are developed for heterogeneous graphs, but they often need the pre-defined meta-path. Defining meaningful meta-paths requires much domain knowledge, which largely limits their applications, especially on schema-rich heterogeneous graphs like knowledge graphs. Recently, the Graph Neural Network (GNN) has been widely applied in many graph mining tasks, but it has not been applied for measuring relevance yet. To address the aforementioned problems, we p",
    "link": "http://arxiv.org/abs/2208.06144",
    "context": "Title: GSim: A Graph Neural Network based Relevance Measure for Heterogeneous Graphs. (arXiv:2208.06144v2 [cs.IR] UPDATED)\nAbstract: Heterogeneous graphs, which contain nodes and edges of multiple types, are prevalent in various domains, including bibliographic networks, social media, and knowledge graphs. As a fundamental task in analyzing heterogeneous graphs, relevance measure aims to calculate the relevance between two objects of different types, which has been used in many applications such as web search, recommendation, and community detection. Most of existing relevance measures focus on homogeneous networks where objects are of the same type, and a few measures are developed for heterogeneous graphs, but they often need the pre-defined meta-path. Defining meaningful meta-paths requires much domain knowledge, which largely limits their applications, especially on schema-rich heterogeneous graphs like knowledge graphs. Recently, the Graph Neural Network (GNN) has been widely applied in many graph mining tasks, but it has not been applied for measuring relevance yet. To address the aforementioned problems, we p",
    "path": "papers/22/08/2208.06144.json",
    "total_tokens": 982,
    "translated_title": "GSim ：面向异构图的图神经网络关联度量",
    "translated_abstract": "异构图在各个领域中广泛存在，包含具有多种类型的节点和边缘。关联度量是分析异构图的基本任务之一，目的是计算不同类型的两个对象之间的相关性，已经在许多应用程序中得到了广泛的应用，例如网络搜索、推荐和社区检测。大多数现有的关联度量方法专注于同质网络，但为异构图开发了一些方法，但它们经常需要预定义的元路径。定义有意义的元路径需要大量领域知识，这在基于架构丰富的异构图（如知识图谱）上极大地限制了它们的应用。最近，图神经网络已广泛应用于许多图挖掘任务中，但尚未用于衡量关联性。为解决上述问题，我们提出了GSim，一种基于图神经网络的异构图关联度量方法。GSim能够捕捉异构图的隐含结构，不需要预定义的元路径。我们在三个真实世界的数据集上评估了我们提出的方法，结果表明GSim显著优于几种最先进的方法。",
    "tldr": "GSim是一种基于图神经网络的异构图关联度量方法，不需要预定义的元路径，能够捕捉异构图的隐含结构，已在多个数据集上得到验证。",
    "en_tdlr": "GSim is a Graph Neural Network based relevance measure for heterogeneous graphs, which captures the implicit structure of heterogeneous graphs without the need for pre-defined meta-paths, and outperforms several state-of-the-art methods on multiple datasets."
}