{
    "title": "Detecting Multivariate Time Series Anomalies with Zero Known Label. (arXiv:2208.02108v3 [cs.LG] UPDATED)",
    "abstract": "Multivariate time series anomaly detection has been extensively studied under the semi-supervised setting, where a training dataset with all normal instances is required. However, preparing such a dataset is very laborious since each single data instance should be fully guaranteed to be normal. It is, therefore, desired to explore multivariate time series anomaly detection methods based on the dataset without any label knowledge. In this paper, we propose MTGFlow, an unsupervised anomaly detection approach for multivariate time series anomaly detection via dynamic graph and entity-aware normalizing flow, leaning only on a widely accepted hypothesis that abnormal instances exhibit sparse densities than the normal. However, the complex interdependencies among entities and the diverse inherent characteristics of each entity pose significant challenges on the density estimation, let alone to detect anomalies based on the estimated possibility distribution. To tackle these problems, we prop",
    "link": "http://arxiv.org/abs/2208.02108",
    "context": "Title: Detecting Multivariate Time Series Anomalies with Zero Known Label. (arXiv:2208.02108v3 [cs.LG] UPDATED)\nAbstract: Multivariate time series anomaly detection has been extensively studied under the semi-supervised setting, where a training dataset with all normal instances is required. However, preparing such a dataset is very laborious since each single data instance should be fully guaranteed to be normal. It is, therefore, desired to explore multivariate time series anomaly detection methods based on the dataset without any label knowledge. In this paper, we propose MTGFlow, an unsupervised anomaly detection approach for multivariate time series anomaly detection via dynamic graph and entity-aware normalizing flow, leaning only on a widely accepted hypothesis that abnormal instances exhibit sparse densities than the normal. However, the complex interdependencies among entities and the diverse inherent characteristics of each entity pose significant challenges on the density estimation, let alone to detect anomalies based on the estimated possibility distribution. To tackle these problems, we prop",
    "path": "papers/22/08/2208.02108.json",
    "total_tokens": 928,
    "translated_title": "零标签的多元时间序列异常检测",
    "translated_abstract": "多元时间序列异常检测已在半监督环境下 extensively studied，但需要训练集中的所有正常样本，这很费力。因此，本文提出了一种无监督的异常检测方法，MTGFlow，基于一个广泛的假设，即异常实例的密度比正常实例稀疏。MTGFlow 建立动态图捕捉实体间的交互，并利用实体注意机制进行密度和异常分数建模，不仅能有效解决实体特征多样性和密度估计问题，而且在多个基准数据集上的实验结果表明，MTGFlow 比几种先进的无监督方法优越，并即使与半监督方法相比也有竞争力。",
    "tldr": "本文提出了一种利用动态图和实体注意力机制实现零标签多元时间序列异常检测的方法，其利用密度估计比较异常和正常实例，性能优于多种无监督方法和半监督方法。",
    "en_tdlr": "This paper proposed an unsupervised approach called MTGFlow for anomaly detection in multivariate time series data without any labeled samples, based on the assumption that abnormal instances have sparser densities than normal ones. MTGFlow uses dynamic graph and entity-aware normalizing flow to model interdependencies among entities and entity-wise density and anomaly score. Experiment results demonstrate that MTGFlow outperforms several state-of-the-art unsupervised methods and is competitive even with semi-supervised methods."
}