{
    "title": "Relational Action Bases: Formalization, Effective Safety Verification, and Invariants (Extended Version). (arXiv:2208.06377v2 [cs.AI] UPDATED)",
    "abstract": "Modeling and verification of dynamic systems operating over a relational representation of states are increasingly investigated problems in AI, Business Process Management, and Database Theory. To make these systems amenable to verification, the amount of information stored in each relational state needs to be bounded, or restrictions are imposed on the preconditions and effects of actions. We introduce the general framework of relational action bases (RABs), which generalizes existing models by lifting both these restrictions: unbounded relational states can be evolved through actions that can quantify both existentially and universally over the data, and that can exploit numerical datatypes with arithmetic predicates. We then study parameterized safety of RABs via (approximated) SMT-based backward search, singling out essential meta-properties of the resulting procedure, and showing how it can be realized by an off-the-shelf combination of existing verification modules of the state-o",
    "link": "http://arxiv.org/abs/2208.06377",
    "context": "Title: Relational Action Bases: Formalization, Effective Safety Verification, and Invariants (Extended Version). (arXiv:2208.06377v2 [cs.AI] UPDATED)\nAbstract: Modeling and verification of dynamic systems operating over a relational representation of states are increasingly investigated problems in AI, Business Process Management, and Database Theory. To make these systems amenable to verification, the amount of information stored in each relational state needs to be bounded, or restrictions are imposed on the preconditions and effects of actions. We introduce the general framework of relational action bases (RABs), which generalizes existing models by lifting both these restrictions: unbounded relational states can be evolved through actions that can quantify both existentially and universally over the data, and that can exploit numerical datatypes with arithmetic predicates. We then study parameterized safety of RABs via (approximated) SMT-based backward search, singling out essential meta-properties of the resulting procedure, and showing how it can be realized by an off-the-shelf combination of existing verification modules of the state-o",
    "path": "papers/22/08/2208.06377.json",
    "total_tokens": 833,
    "translated_title": "关系行动基础：形式化、有效安全验证和不变量（扩展版）",
    "translated_abstract": "在人工智能、业务流程管理和数据库理论中，对基于关系表示的动态系统的建模和验证是越来越受关注的问题。为了使这些系统适于验证，需要限制每个关系状态中存储的信息量，或者对行动的先决条件和影响施加限制。我们引入了关系行动基础（RABs）的通用框架，通过取消这些限制从而推广现有模型：无限制的关系状态可以通过可以对数据进行存在量词和全称量词量化的行动演变，并且可以利用带有算术谓词的数字数据类型。然后，我们通过（近似）基于SMT的反向搜索研究了RABs的参数化安全性，挑出了结果过程的基本元属性，并展示了它如何通过现有验证模块的组合实现。",
    "tldr": "该论文介绍了关系行动基础（RABs）的通用框架，通过取消关系状态和行动的限制，实现了对动态系统的建模和验证，同时提供了参数化安全性的研究方法。"
}