{
    "title": "Feature-Based Time-Series Analysis in R using the theft Package. (arXiv:2208.06146v4 [stat.ML] UPDATED)",
    "abstract": "Time series are measured and analyzed across the sciences. One method of quantifying the structure of time series is by calculating a set of summary statistics or `features', and then representing a time series in terms of its properties as a feature vector. The resulting feature space is interpretable and informative, and enables conventional statistical learning approaches, including clustering, regression, and classification, to be applied to time-series datasets. Many open-source software packages for computing sets of time-series features exist across multiple programming languages, including catch22 (22 features: Matlab, R, Python, Julia), feasts (42 features: R), tsfeatures (63 features: R), Kats (40 features: Python), tsfresh (779 features: Python), and TSFEL (390 features: Python). However, there are several issues: (i) a singular access point to these packages is not currently available; (ii) to access all feature sets, users must be fluent in multiple languages; and (iii) th",
    "link": "http://arxiv.org/abs/2208.06146",
    "context": "Title: Feature-Based Time-Series Analysis in R using the theft Package. (arXiv:2208.06146v4 [stat.ML] UPDATED)\nAbstract: Time series are measured and analyzed across the sciences. One method of quantifying the structure of time series is by calculating a set of summary statistics or `features', and then representing a time series in terms of its properties as a feature vector. The resulting feature space is interpretable and informative, and enables conventional statistical learning approaches, including clustering, regression, and classification, to be applied to time-series datasets. Many open-source software packages for computing sets of time-series features exist across multiple programming languages, including catch22 (22 features: Matlab, R, Python, Julia), feasts (42 features: R), tsfeatures (63 features: R), Kats (40 features: Python), tsfresh (779 features: Python), and TSFEL (390 features: Python). However, there are several issues: (i) a singular access point to these packages is not currently available; (ii) to access all feature sets, users must be fluent in multiple languages; and (iii) th",
    "path": "papers/22/08/2208.06146.json",
    "total_tokens": 899,
    "translated_title": "在R中使用theft包进行基于特征的时间序列分析",
    "translated_abstract": "时间序列在各个科学领域中被测量和分析。一种量化时间序列结构的方法是通过计算一组摘要统计量或\"特征\"，然后用特征向量的属性来表示时间序列。结果得到的特征空间是可解释和信息丰富的，使得传统的统计学习方法，包括聚类、回归和分类，可以应用于时间序列数据集。存在许多开源软件包在多种编程语言中计算时间序列特征集，包括catch22（22个特征：Matlab、R、Python、Julia）、feasts（42个特征：R）、tsfeatures（63个特征：R）、Kats（40个特征：Python）、tsfresh（779个特征：Python）和TSFEL（390个特征：Python）。然而，存在几个问题：（i）目前尚无这些软件包的单一访问点；（ii）要访问所有特征集，用户必须精通多种语言；（iii）th",
    "tldr": "本研究介绍了在R中使用theft包进行基于特征的时间序列分析的方法，并指出了当前存在的问题包括缺乏统一的访问点以及用户需要掌握多种编程语言来获得所有特征集。",
    "en_tdlr": "This paper presents a method for feature-based time-series analysis in R using the theft package, and highlights the current issues including the lack of a unified access point and the requirement for users to be proficient in multiple languages to access all feature sets."
}