{
    "title": "The Role of Morphological Variation in Evolutionary Robotics: Maximizing Performance and Robustness. (arXiv:2208.02809v2 [cs.NE] UPDATED)",
    "abstract": "Exposing an Evolutionary Algorithm that is used to evolve robot controllers to variable conditions is necessary to obtain solutions which are robust and can cross the reality gap. However, we do not yet have methods for analyzing and understanding the impact of the varying morphological conditions which impact the evolutionary process, and therefore for choosing suitable variation ranges. By morphological conditions, we refer to the starting state of the robot, and to variations in its sensor readings during operation due to noise. In this article, we introduce a method that permits us to measure the impact of these morphological variations and we analyze the relation between the amplitude of variations, the modality with which they are introduced, and the performance and robustness of evolving agents. Our results demonstrate that (i) the evolutionary algorithm can tolerate morphological variations which have a very high impact, (ii) variations affecting the actions of the agent are to",
    "link": "http://arxiv.org/abs/2208.02809",
    "context": "Title: The Role of Morphological Variation in Evolutionary Robotics: Maximizing Performance and Robustness. (arXiv:2208.02809v2 [cs.NE] UPDATED)\nAbstract: Exposing an Evolutionary Algorithm that is used to evolve robot controllers to variable conditions is necessary to obtain solutions which are robust and can cross the reality gap. However, we do not yet have methods for analyzing and understanding the impact of the varying morphological conditions which impact the evolutionary process, and therefore for choosing suitable variation ranges. By morphological conditions, we refer to the starting state of the robot, and to variations in its sensor readings during operation due to noise. In this article, we introduce a method that permits us to measure the impact of these morphological variations and we analyze the relation between the amplitude of variations, the modality with which they are introduced, and the performance and robustness of evolving agents. Our results demonstrate that (i) the evolutionary algorithm can tolerate morphological variations which have a very high impact, (ii) variations affecting the actions of the agent are to",
    "path": "papers/22/08/2208.02809.json",
    "total_tokens": 836,
    "translated_title": "演化机器人学中形态变异的作用：最大化性能和鲁棒性",
    "translated_abstract": "为了获得鲁棒且能够克服现实差距的解决方案，有必要暴露用于演化机器人控制器到不同条件的演化算法。然而，我们还没有方法来分析和理解影响演化过程的各种形态条件的影响，也没有方法来选择合适的变异范围。通过形态条件，我们指的是机器人的起始状态以及由于噪声导致操作过程中传感器读数的变化。在本文中，我们介绍了一种可以测量这些形态变异影响的方法，并分析了变异幅度、引入方式与演化体性能和鲁棒性之间的关系。我们的结果表明：（i）演化算法能够容忍具有很高影响的形态变异；（ii）影响机器人行为的变异对演化体的性能有影响。",
    "tldr": "本文提出了一种测量形态变异影响的方法，并分析了变异幅度和引入方式与演化体性能和鲁棒性之间的关系。",
    "en_tdlr": "This paper introduces a method to measure the impact of morphological variations and analyzes the relationship between the amplitude and modality of variations and the performance and robustness of evolved agents."
}