{
    "title": "A physics-based domain adaptation framework for modelling and forecasting building energy systems. (arXiv:2208.09456v2 [cs.LG] UPDATED)",
    "abstract": "State-of-the-art machine-learning-based models are a popular choice for modeling and forecasting energy behavior in buildings because given enough data, they are good at finding spatiotemporal patterns and structures even in scenarios where the complexity prohibits analytical descriptions. However, their architecture typically does not hold physical correspondence to mechanistic structures linked with governing physical phenomena. As a result, their ability to successfully generalize for unobserved timesteps depends on the representativeness of the dynamics underlying the observed system in the data, which is difficult to guarantee in real-world engineering problems such as control and energy management in digital twins. In response, we present a framework that combines lumped-parameter models in the form of linear time-invariant (LTI) state-space models (SSMs) with unsupervised reduced-order modeling in a subspace-based domain adaptation (SDA) framework. SDA is a type of transfer-lear",
    "link": "http://arxiv.org/abs/2208.09456",
    "context": "Title: A physics-based domain adaptation framework for modelling and forecasting building energy systems. (arXiv:2208.09456v2 [cs.LG] UPDATED)\nAbstract: State-of-the-art machine-learning-based models are a popular choice for modeling and forecasting energy behavior in buildings because given enough data, they are good at finding spatiotemporal patterns and structures even in scenarios where the complexity prohibits analytical descriptions. However, their architecture typically does not hold physical correspondence to mechanistic structures linked with governing physical phenomena. As a result, their ability to successfully generalize for unobserved timesteps depends on the representativeness of the dynamics underlying the observed system in the data, which is difficult to guarantee in real-world engineering problems such as control and energy management in digital twins. In response, we present a framework that combines lumped-parameter models in the form of linear time-invariant (LTI) state-space models (SSMs) with unsupervised reduced-order modeling in a subspace-based domain adaptation (SDA) framework. SDA is a type of transfer-lear",
    "path": "papers/22/08/2208.09456.json",
    "total_tokens": 1157,
    "translated_title": "基于物理学的领域自适应框架用于建筑能量系统建模和预测",
    "translated_abstract": "现代的基于机器学习的模型在建筑能源行为建模和预测方面已经成为一个流行的选择。然而，它们的结构通常并不具有与物理现象相关的机械结构相对应。因此，它们成功地泛化为未观测到的时间步取决于所观察到的系统动态在数据中表现的代表性，在数字孪生控制和能源管理等真实世界的工程问题中很难得到保证。为了解决这一问题，本文提出了一个框架，将线性时不变（LTI）状态空间模型（SSM）的成批参数模型与基于子空间的无监督降阶建模相结合，形成了一个子空间导向的领域适应（SDA）框架。SDA是一种转移学习方法，旨在通过最小化共享子空间中的模型表示的差异来将在一个领域上训练过的模型适应到另一个领域。在一个建筑能量系统案例研究中展示了我们提出的基于物理学的领域自适应框架，证明了它在短期和长期能量预测方面优于现有的基于机器学习的模型。",
    "tldr": "本文提出了一种基于物理学的领域自适应框架，将线性时不变状态空间模型与基于子空间的无监督降阶建模相结合，通过最小化模型在共享子空间中的表示差异，将在一个领域上训练过的模型适应到另一个领域，用于建筑能量系统的建模和预测，并在实验中表现出优异的预测性能。",
    "en_tdlr": "This paper presents a physics-based domain adaptation framework that combines linear time-invariant state space models with unsupervised reduced-order modeling, and adapts models trained in one domain to another by minimizing the discrepancy of the model representations in a shared subspace. Demonstrated on a building energy system case study, the proposed framework outperforms state-of-the-art machine-learning-based models in both short-term and long-term energy forecasting."
}