{
    "title": "A Kind Introduction to Lexical and Grammatical Aspect, with a Survey of Computational Approaches. (arXiv:2208.09012v2 [cs.CL] UPDATED)",
    "abstract": "Aspectual meaning refers to how the internal temporal structure of situations is presented. This includes whether a situation is described as a state or as an event, whether the situation is finished or ongoing, and whether it is viewed as a whole or with a focus on a particular phase. This survey gives an overview of computational approaches to modeling lexical and grammatical aspect along with intuitive explanations of the necessary linguistic concepts and terminology. In particular, we describe the concepts of stativity, telicity, habituality, perfective and imperfective, as well as influential inventories of eventuality and situation types. We argue that because aspect is a crucial component of semantics, especially when it comes to reporting the temporal structure of situations in a precise way, future NLP approaches need to be able to handle and evaluate it systematically in order to achieve human-level language understanding.",
    "link": "http://arxiv.org/abs/2208.09012",
    "raw_ret": "{\n    \"translated_title\": \"词汇和语法体向的友善介绍以及计算方法综述\",\n    \"translated_abstract\": \"体向意味着事情的内部时间结构是如何呈现的。这包括情况是被描述为一种状态还是事件，情况是已结束还是正在进行，以及情况是整体还是关注于特定阶段。本文概述了模拟词汇和语法体向的计算方法以及必要的语言概念和术语的直观解释。特别地，我们描述了状态、目的性、习惯性、完成式和未完成式的概念，以及事件和情况类型的重要清单。我们认为，由于体向是语义的关键组成部分，特别是在精确报告情况的时间结构时，未来的NLP方法需要能够系统地处理和评估它，以实现人类水平的语言理解。\",\n    \"tldr\": \"本文介绍了模拟词汇和语法体向的计算方法以及必要的语言概念和术语的直观解释。特别地，我们描述了状态、目的性、习惯性、完成式和未完成式的概念，以及事件和情况类型的重要清单。\"\n}",
    "total_tokens": 805,
    "ret": {
        "translated_title": "词汇和语法体向的友善介绍以及计算方法综述",
        "translated_abstract": "体向意味着事情的内部时间结构是如何呈现的。这包括情况是被描述为一种状态还是事件，情况是已结束还是正在进行，以及情况是整体还是关注于特定阶段。本文概述了模拟词汇和语法体向的计算方法以及必要的语言概念和术语的直观解释。特别地，我们描述了状态、目的性、习惯性、完成式和未完成式的概念，以及事件和情况类型的重要清单。我们认为，由于体向是语义的关键组成部分，特别是在精确报告情况的时间结构时，未来的NLP方法需要能够系统地处理和评估它，以实现人类水平的语言理解。",
        "tldr": "本文介绍了模拟词汇和语法体向的计算方法以及必要的语言概念和术语的直观解释。特别地，我们描述了状态、目的性、习惯性、完成式和未完成式的概念，以及事件和情况类型的重要清单。"
    }
}