{
    "title": "Convolutional Persistence Transforms. (arXiv:2208.02107v2 [math.AT] UPDATED)",
    "abstract": "In this paper, we consider topological featurizations of data defined over simplicial complexes, like images and labeled graphs, obtained by convolving this data with various filters before computing persistence. Viewing a convolution filter as a local motif, the persistence diagram of the resulting convolution describes the way the motif is distributed across the simplicial complex. This pipeline, which we call convolutional persistence, extends the capacity of topology to observe patterns in such data. Moreover, we prove that (generically speaking) for any two labeled complexes one can find some filter for which they produce different persistence diagrams, so that the collection of all possible convolutional persistence diagrams is an injective invariant. This is proven by showing convolutional persistence to be a special case of another topological invariant, the Persistent Homology Transform. Other advantages of convolutional persistence are improved stability, greater flexibility ",
    "link": "http://arxiv.org/abs/2208.02107",
    "context": "Title: Convolutional Persistence Transforms. (arXiv:2208.02107v2 [math.AT] UPDATED)\nAbstract: In this paper, we consider topological featurizations of data defined over simplicial complexes, like images and labeled graphs, obtained by convolving this data with various filters before computing persistence. Viewing a convolution filter as a local motif, the persistence diagram of the resulting convolution describes the way the motif is distributed across the simplicial complex. This pipeline, which we call convolutional persistence, extends the capacity of topology to observe patterns in such data. Moreover, we prove that (generically speaking) for any two labeled complexes one can find some filter for which they produce different persistence diagrams, so that the collection of all possible convolutional persistence diagrams is an injective invariant. This is proven by showing convolutional persistence to be a special case of another topological invariant, the Persistent Homology Transform. Other advantages of convolutional persistence are improved stability, greater flexibility ",
    "path": "papers/22/08/2208.02107.json",
    "total_tokens": 903,
    "translated_title": "卷积坚持转换",
    "translated_abstract": "本文考虑了定义在简单复合体上的数据（如图像和标记图）的拓扑特征化，通过将这些数据与不同的滤波器进行卷积计算持续性。将卷积滤波器视为局部模式，所得卷积的持久图描述了模式在简单复合体上的分布方式。这种流程，我们称之为卷积坚持转换，扩展了拓扑学在此类数据中观察模式的能力。此外，我们证明（一般情况下），对于任意两个标记复合体，都可以找到某个滤波器，使它们产生不同的持久图，使得所有可能的卷积持久图的集合是一个注入不变量。这通过显示卷积坚持转换是另一个拓扑不变量——持续同调变换的特殊情况来证明。卷积坚持转换的其他优点是改善的稳定性，更大的灵活性。",
    "tldr": "本文介绍了一种称为卷积坚持转换的方法，通过将数据与滤波器进行卷积计算来获取拓扑特征化。通过证明其持久图是一个注入不变量，证明了卷积坚持转换的独特性。该方法具有改善的稳定性和更大的灵活性。",
    "en_tdlr": "This paper introduces a method called convolutional persistence, which uses convolution with filters to obtain topological featurizations of data. It is proven that the resulting persistence diagrams are injective invariants, demonstrating the uniqueness of convolutional persistence. This method has improved stability and greater flexibility."
}