{
    "title": "Adaptive Identification of Populations with Treatment Benefit in Clinical Trials: Machine Learning Challenges and Solutions. (arXiv:2208.05844v2 [stat.ML] UPDATED)",
    "abstract": "We study the problem of adaptively identifying patient subpopulations that benefit from a given treatment during a confirmatory clinical trial. This type of adaptive clinical trial has been thoroughly studied in biostatistics, but has been allowed only limited adaptivity so far. Here, we aim to relax classical restrictions on such designs and investigate how to incorporate ideas from the recent machine learning literature on adaptive and online experimentation to make trials more flexible and efficient. We find that the unique characteristics of the subpopulation selection problem -- most importantly that (i) one is usually interested in finding subpopulations with any treatment benefit (and not necessarily the single subgroup with largest effect) given a limited budget and that (ii) effectiveness only has to be demonstrated across the subpopulation on average -- give rise to interesting challenges and new desiderata when designing algorithmic solutions. Building on these findings, we ",
    "link": "http://arxiv.org/abs/2208.05844",
    "context": "Title: Adaptive Identification of Populations with Treatment Benefit in Clinical Trials: Machine Learning Challenges and Solutions. (arXiv:2208.05844v2 [stat.ML] UPDATED)\nAbstract: We study the problem of adaptively identifying patient subpopulations that benefit from a given treatment during a confirmatory clinical trial. This type of adaptive clinical trial has been thoroughly studied in biostatistics, but has been allowed only limited adaptivity so far. Here, we aim to relax classical restrictions on such designs and investigate how to incorporate ideas from the recent machine learning literature on adaptive and online experimentation to make trials more flexible and efficient. We find that the unique characteristics of the subpopulation selection problem -- most importantly that (i) one is usually interested in finding subpopulations with any treatment benefit (and not necessarily the single subgroup with largest effect) given a limited budget and that (ii) effectiveness only has to be demonstrated across the subpopulation on average -- give rise to interesting challenges and new desiderata when designing algorithmic solutions. Building on these findings, we ",
    "path": "papers/22/08/2208.05844.json",
    "total_tokens": 1130,
    "translated_title": "临床试验中受益人群的自适应识别：机器学习挑战与解决方案",
    "translated_abstract": "本文研究了在确认性临床试验中自适应性地识别受益于给定治疗的患者亚群的问题。这种自适应性临床试验已经在生物统计学中得到了深入研究，但目前仅允许有限的自适应性。本文旨在放宽这样的设计的经典限制，并研究如何融合最近机器学习文献中的自适应和在线实验的思想，使试验更加灵活和高效。我们发现，亚群选择问题的独特特征——最重要的是，（i）通常感兴趣的是在有限的预算下找到任何受益于治疗的亚群（而不一定是单个效果最大的亚组），以及（ii）只需在平均水平上证明有效性——催生了有趣的挑战和设计算法解决方案的新要求。基于这些发现，我们提出了一种新的数据驱动的子群体识别方法，同时使用了机器学习和自适应实验技术。我们进行了大量的模拟和实际数据分析，展示了我们方法不仅表现优异，而且解决了这一问题的独特挑战，产生了有效和有用的发现。",
    "tldr": "本文提出了一种新的数据驱动的方法，同时使用了机器学习和自适应实验技术，用于自适应性临床试验中受益于给定治疗的患者亚群的识别。本文通过实验展示了该方法的优异表现，并解决了这一问题的独特挑战，产生了有效和有用的发现。",
    "en_tdlr": "This paper proposes a novel data-driven approach that uses both machine learning and adaptive experimentation techniques to identify patient subpopulations that benefit from a given treatment during a confirmatory clinical trial. By addressing the unique challenges of this problem, the proposed method outperforms existing approaches and produces valid and useful findings."
}