{
    "title": "Regression modelling of spatiotemporal extreme U.S. wildfires via partially-interpretable neural networks",
    "abstract": "arXiv:2208.07581v4 Announce Type: replace-cross  Abstract: Risk management in many environmental settings requires an understanding of the mechanisms that drive extreme events. Useful metrics for quantifying such risk are extreme quantiles of response variables conditioned on predictor variables that describe, e.g., climate, biosphere and environmental states. Typically these quantiles lie outside the range of observable data and so, for estimation, require specification of parametric extreme value models within a regression framework. Classical approaches in this context utilise linear or additive relationships between predictor and response variables and suffer in either their predictive capabilities or computational efficiency; moreover, their simplicity is unlikely to capture the truly complex structures that lead to the creation of extreme wildfires. In this paper, we propose a new methodological framework for performing extreme quantile regression using artificial neutral network",
    "link": "https://arxiv.org/abs/2208.07581",
    "context": "Title: Regression modelling of spatiotemporal extreme U.S. wildfires via partially-interpretable neural networks\nAbstract: arXiv:2208.07581v4 Announce Type: replace-cross  Abstract: Risk management in many environmental settings requires an understanding of the mechanisms that drive extreme events. Useful metrics for quantifying such risk are extreme quantiles of response variables conditioned on predictor variables that describe, e.g., climate, biosphere and environmental states. Typically these quantiles lie outside the range of observable data and so, for estimation, require specification of parametric extreme value models within a regression framework. Classical approaches in this context utilise linear or additive relationships between predictor and response variables and suffer in either their predictive capabilities or computational efficiency; moreover, their simplicity is unlikely to capture the truly complex structures that lead to the creation of extreme wildfires. In this paper, we propose a new methodological framework for performing extreme quantile regression using artificial neutral network",
    "path": "papers/22/08/2208.07581.json",
    "total_tokens": 723,
    "translated_title": "美国极端森林火灾的时空回归建模：部分可解释神经网络",
    "translated_abstract": "许多环境背景下的风险管理需要理解驱动极端事件的机制。用于量化这种风险的有用指标是响应变量的极端分位数，其条件是描述气候、生物圈和环境状态等预测变量。典型情况下，这些分位数位于可观测数据范围之外，因此，为了进行估计，需要在回归框架内指定参数极值模型。在这篇论文中，我们提出了一种新的方法框架，用于利用人工神经网络进行极端分位数回归。",
    "tldr": "提出了一种新的方法框架，利用神经网络进行极端分位数回归，以更好地理解和量化美国极端森林火灾的风险",
    "en_tdlr": "Proposed a new methodological framework using artificial neural networks for extreme quantile regression to better understand and quantify the risk of extreme wildfires in the United States."
}