{
    "title": "Identifying Dominant Industrial Sectors in Market States of the S&P 500 Financial Data. (arXiv:2208.14106v3 [q-fin.ST] UPDATED)",
    "abstract": "Understanding and forecasting changing market conditions in complex economic systems like the financial market is of great importance to various stakeholders such as financial institutions and regulatory agencies. Based on the finding that the dynamics of sector correlation matrices of the S&P 500 stock market can be described by a sequence of distinct states via a clustering algorithm, we try to identify the industrial sectors dominating the correlation structure of each state. For this purpose, we use a method from Explainable Artificial Intelligence (XAI) on daily S&P 500 stock market data from 1992 to 2012 to assign relevance scores to every feature of each data point. To compare the significance of the features for the entire data set we develop an aggregation procedure and apply a Bayesian change point analysis to identify the most significant sector correlations. We show that the correlation matrix of each state is dominated only by a few sector correlations. Especially the ener",
    "link": "http://arxiv.org/abs/2208.14106",
    "context": "Title: Identifying Dominant Industrial Sectors in Market States of the S&P 500 Financial Data. (arXiv:2208.14106v3 [q-fin.ST] UPDATED)\nAbstract: Understanding and forecasting changing market conditions in complex economic systems like the financial market is of great importance to various stakeholders such as financial institutions and regulatory agencies. Based on the finding that the dynamics of sector correlation matrices of the S&P 500 stock market can be described by a sequence of distinct states via a clustering algorithm, we try to identify the industrial sectors dominating the correlation structure of each state. For this purpose, we use a method from Explainable Artificial Intelligence (XAI) on daily S&P 500 stock market data from 1992 to 2012 to assign relevance scores to every feature of each data point. To compare the significance of the features for the entire data set we develop an aggregation procedure and apply a Bayesian change point analysis to identify the most significant sector correlations. We show that the correlation matrix of each state is dominated only by a few sector correlations. Especially the ener",
    "path": "papers/22/08/2208.14106.json",
    "total_tokens": 938,
    "translated_title": "在S&P 500金融数据的市场状态中识别主导产业部门",
    "translated_abstract": "理解和预测金融市场等复杂经济系统中的变化市场条件对各利益相关者（如金融机构和监管机构）至关重要。基于一项发现，即可以通过聚类算法将S＆P 500股票市场的部门相关矩阵动态描述为一系列不同状态，我们试图确定主导每种状态的相关结构的产业部门。为此，我们使用Explainable Artificial Intelligence（XAI）中的一种方法，对1992年至2012年的日度S＆P 500股票市场数据分配每个数据点的相关分数。为了比较整个数据集的特征重要性，我们开发了一种聚合过程，并应用贝叶斯变点分析来识别最显著的部门相关性。我们展示了每种状态的相关矩阵仅由少数部门相关性主导。特别是能源部门表现出了独特的特征。",
    "tldr": "本研究使用聚类算法识别了S&P 500股票市场的部门相关矩阵动态变化的不同状态，并通过XAI方法和贝叶斯变点分析确定了每个状态中占主导地位的产业部门，结果发现少数产业部门主导了每个状态的相关矩阵，尤其是能源部门表现出了独特的特征。",
    "en_tdlr": "This study identifies the dominant industrial sectors in the correlation structure of each state in the S&P 500 stock market, using a clustering algorithm and XAI method on daily data from 1992 to 2012, and finds that only a few sector correlations dominate each state's correlation matrix, with the energy sector showing unique features."
}