{
    "title": "Cross-Domain Evaluation of a Deep Learning-Based Type Inference System. (arXiv:2208.09189v3 [cs.SE] UPDATED)",
    "abstract": "Optional type annotations allow for enriching dynamic programming languages with static typing features like better Integrated Development Environment (IDE) support, more precise program analysis, and early detection and prevention of type-related runtime errors. Machine learning-based type inference promises interesting results for automating this task. However, the practical usage of such systems depends on their ability to generalize across different domains, as they are often applied outside their training domain. In this work, we investigate Type4Py as a representative of state-of-the-art deep learning-based type inference systems, by conducting extensive cross-domain experiments. Thereby, we address the following problems: class imbalances, out-of-vocabulary words, dataset shifts, and unknown classes. To perform such experiments, we use the datasets ManyTypes4Py and CrossDomainTypes4Py. The latter we introduce in this paper. Our dataset enables the evaluation of type inference sy",
    "link": "http://arxiv.org/abs/2208.09189",
    "context": "Title: Cross-Domain Evaluation of a Deep Learning-Based Type Inference System. (arXiv:2208.09189v3 [cs.SE] UPDATED)\nAbstract: Optional type annotations allow for enriching dynamic programming languages with static typing features like better Integrated Development Environment (IDE) support, more precise program analysis, and early detection and prevention of type-related runtime errors. Machine learning-based type inference promises interesting results for automating this task. However, the practical usage of such systems depends on their ability to generalize across different domains, as they are often applied outside their training domain. In this work, we investigate Type4Py as a representative of state-of-the-art deep learning-based type inference systems, by conducting extensive cross-domain experiments. Thereby, we address the following problems: class imbalances, out-of-vocabulary words, dataset shifts, and unknown classes. To perform such experiments, we use the datasets ManyTypes4Py and CrossDomainTypes4Py. The latter we introduce in this paper. Our dataset enables the evaluation of type inference sy",
    "path": "papers/22/08/2208.09189.json",
    "total_tokens": 997,
    "translated_title": "基于深度学习的类型推断系统的跨域评估",
    "translated_abstract": "可选类型注释允许在动态编程语言中增加静态类型特性，例如更好的集成开发环境（IDE）支持、更精确的程序分析以及类型相关的运行时错误的早期检测和预防。基于机器学习的类型推断为自动化此任务提供了有趣的结果。然而，这些系统的实际使用取决于它们跨不同领域的泛化能力，因为它们经常被应用于训练领域之外。本文通过进行广泛的跨领域实验，将Type4Py作为最先进的基于深度学习的类型推断系统的代表进行了研究。我们解决以下问题：类不平衡、词汇表外单词、数据集转移和未知类。为了进行这样的实验，我们使用了ManyTypes4Py和CrossDomainTypes4Py数据集。我们在本文中介绍了后者。我们的数据集可以在更现实的情况下评估类型推断系统，在该情况下程序领域与训练集中的领域不同。我们表明，Type4Py优于基准方法，并为不同领域的类型推断提供了可伸缩的解决方案。",
    "tldr": "本文研究了基于深度学习的类型推断系统Type4Py的跨领域泛化能力，并通过广泛的实验表明，Type4Py在应用于不同领域的类型推断时能够提供优异的性能。",
    "en_tdlr": "This paper investigates the cross-domain generalization ability of Type4Py, a state-of-the-art deep learning-based type inference system, and shows through extensive experiments that Type4Py can provide excellent performance when applied to type inference in different domains."
}