{
    "title": "ARMA Cell: A Modular and Effective Approach for Neural Autoregressive Modeling. (arXiv:2208.14919v2 [cs.LG] UPDATED)",
    "abstract": "The autoregressive moving average (ARMA) model is a classical, and arguably one of the most studied approaches to model time series data. It has compelling theoretical properties and is widely used among practitioners. More recent deep learning approaches popularize recurrent neural networks (RNNs) and, in particular, Long Short-Term Memory (LSTM) cells that have become one of the best performing and most common building blocks in neural time series modeling. While advantageous for time series data or sequences with long-term effects, complex RNN cells are not always a must and can sometimes even be inferior to simpler recurrent approaches. In this work, we introduce the ARMA cell, a simpler, modular, and effective approach for time series modeling in neural networks. This cell can be used in any neural network architecture where recurrent structures are present and naturally handles multivariate time series using vector autoregression. We also introduce the ConvARMA cell as a natural ",
    "link": "http://arxiv.org/abs/2208.14919",
    "context": "Title: ARMA Cell: A Modular and Effective Approach for Neural Autoregressive Modeling. (arXiv:2208.14919v2 [cs.LG] UPDATED)\nAbstract: The autoregressive moving average (ARMA) model is a classical, and arguably one of the most studied approaches to model time series data. It has compelling theoretical properties and is widely used among practitioners. More recent deep learning approaches popularize recurrent neural networks (RNNs) and, in particular, Long Short-Term Memory (LSTM) cells that have become one of the best performing and most common building blocks in neural time series modeling. While advantageous for time series data or sequences with long-term effects, complex RNN cells are not always a must and can sometimes even be inferior to simpler recurrent approaches. In this work, we introduce the ARMA cell, a simpler, modular, and effective approach for time series modeling in neural networks. This cell can be used in any neural network architecture where recurrent structures are present and naturally handles multivariate time series using vector autoregression. We also introduce the ConvARMA cell as a natural ",
    "path": "papers/22/08/2208.14919.json",
    "total_tokens": 898,
    "translated_title": "ARMA单元：神经自回归建模的模块化和有效方法",
    "translated_abstract": "自回归移动平均(ARMA)模型是一种经典的、被广泛研究的时间序列数据建模方法。它具有引人入胜的理论性质，在实践中被广泛应用。最近的深度学习方法普及了循环神经网络(RNN)，特别是长短期记忆(LSTM)单元，在神经时间序列建模中成为表现最好和最常见的构建模块之一。虽然复杂的RNN单元对于具有长期影响的时间序列数据或序列有优势，但并不总是必需的，有时甚至不如更简单的循环方法好。在本文中，我们引入了ARMA单元，这是一种更简单、模块化和有效的神经网络时间序列建模方法。这个单元可以在任何存在循环结构的神经网络架构中使用，并且可以自然地处理多变量时间序列，使用向量自回归技术。我们还介绍了ConvARMA单元作为一种自然的解决方法。",
    "tldr": "本文介绍了ARMA单元，一种更简单、模块化和有效的神经网络时间序列建模方法，能够自然地处理多变量时间序列，并引入了ConvARMA单元作为一种解决方法。",
    "en_tdlr": "This paper introduces the ARMA cell, a simpler, modular, and effective approach for neural time series modeling. It can handle multivariate time series naturally and introduces the ConvARMA cell as a solution."
}