{
    "title": "LogLG: Weakly Supervised Log Anomaly Detection via Log-Event Graph Construction. (arXiv:2208.10833v5 [cs.SE] UPDATED)",
    "abstract": "Fully supervised log anomaly detection methods suffer the heavy burden of annotating massive unlabeled log data. Recently, many semi-supervised methods have been proposed to reduce annotation costs with the help of parsed templates. However, these methods consider each keyword independently, which disregards the correlation between keywords and the contextual relationships among log sequences. In this paper, we propose a novel weakly supervised log anomaly detection framework, named LogLG, to explore the semantic connections among keywords from sequences. Specifically, we design an end-to-end iterative process, where the keywords of unlabeled logs are first extracted to construct a log-event graph. Then, we build a subgraph annotator to generate pseudo labels for unlabeled log sequences. To ameliorate the annotation quality, we adopt a self-supervised task to pre-train a subgraph annotator. After that, a detection model is trained with the generated pseudo labels. Conditioned on the cl",
    "link": "http://arxiv.org/abs/2208.10833",
    "context": "Title: LogLG: Weakly Supervised Log Anomaly Detection via Log-Event Graph Construction. (arXiv:2208.10833v5 [cs.SE] UPDATED)\nAbstract: Fully supervised log anomaly detection methods suffer the heavy burden of annotating massive unlabeled log data. Recently, many semi-supervised methods have been proposed to reduce annotation costs with the help of parsed templates. However, these methods consider each keyword independently, which disregards the correlation between keywords and the contextual relationships among log sequences. In this paper, we propose a novel weakly supervised log anomaly detection framework, named LogLG, to explore the semantic connections among keywords from sequences. Specifically, we design an end-to-end iterative process, where the keywords of unlabeled logs are first extracted to construct a log-event graph. Then, we build a subgraph annotator to generate pseudo labels for unlabeled log sequences. To ameliorate the annotation quality, we adopt a self-supervised task to pre-train a subgraph annotator. After that, a detection model is trained with the generated pseudo labels. Conditioned on the cl",
    "path": "papers/22/08/2208.10833.json",
    "total_tokens": 898,
    "translated_title": "LogLG: 通过事件图构建实现弱监督日志异常检测",
    "translated_abstract": "完全监督的日志异常检测方法需要为大量未标记的日志数据进行标注。最近，许多半监督方法已经被提出，以降低标注成本，并借助解析模板。然而，这些方法独立考虑每个关键字，忽略关键字之间的相关性和日志序列之间的上下文关系。本文提出了一种新型的弱监督日志异常检测框架，名为LogLG，以探索序列中关键字之间的语义联系。具体来说，我们设计了一种端到端的迭代过程，首先提取未标记日志的关键字以构建日志事件图。然后，我们构建了一个子图注释器生成未标记日志序列的伪标签。为了改善注释质量，我们采用了自监督任务来预训练子图注释器。之后，我们使用生成的伪标签训练检测模型。在条件 下，模型能够识别来自应用程序日志的异常行为。",
    "tldr": "本文提出了一种LogLG弱监督日志异常检测框架，采用事件图构建和伪标签生成，旨在探索序列中关键字之间的语义联系，有效识别应用程序日志的异常行为。",
    "en_tdlr": "LogLG is a novel weakly-supervised log anomaly detection framework that explores semantic connections among keywords by constructing an event graph and generating pseudo labels, which can effectively detect anomalous behavior in application logs."
}