{
    "title": "Improving Small Molecule Generation using Mutual Information Machine. (arXiv:2208.09016v2 [cs.LG] UPDATED)",
    "abstract": "We address the task of controlled generation of small molecules, which entails finding novel molecules with desired properties under certain constraints (e.g., similarity to a reference molecule). Here we introduce MolMIM, a probabilistic auto-encoder for small molecule drug discovery that learns an informative and clustered latent space. MolMIM is trained with Mutual Information Machine (MIM) learning, and provides a fixed length representation of variable length SMILES strings. Since encoder-decoder models can learn representations with ``holes'' of invalid samples, here we propose a novel extension to the training procedure which promotes a dense latent space, and allows the model to sample valid molecules from random perturbations of latent codes. We provide a thorough comparison of MolMIM to several variable-size and fixed-size encoder-decoder models, demonstrating MolMIM's superior generation as measured in terms of validity, uniqueness, and novelty. We then utilize CMA-ES, a nai",
    "link": "http://arxiv.org/abs/2208.09016",
    "context": "Title: Improving Small Molecule Generation using Mutual Information Machine. (arXiv:2208.09016v2 [cs.LG] UPDATED)\nAbstract: We address the task of controlled generation of small molecules, which entails finding novel molecules with desired properties under certain constraints (e.g., similarity to a reference molecule). Here we introduce MolMIM, a probabilistic auto-encoder for small molecule drug discovery that learns an informative and clustered latent space. MolMIM is trained with Mutual Information Machine (MIM) learning, and provides a fixed length representation of variable length SMILES strings. Since encoder-decoder models can learn representations with ``holes'' of invalid samples, here we propose a novel extension to the training procedure which promotes a dense latent space, and allows the model to sample valid molecules from random perturbations of latent codes. We provide a thorough comparison of MolMIM to several variable-size and fixed-size encoder-decoder models, demonstrating MolMIM's superior generation as measured in terms of validity, uniqueness, and novelty. We then utilize CMA-ES, a nai",
    "path": "papers/22/08/2208.09016.json",
    "total_tokens": 1080,
    "translated_title": "使用互信息机器提高小分子生成",
    "translated_abstract": "本文研究了控制小分子生成的任务，即在一定限制条件下（如与参考分子的相似度），寻找具有所需属性的新型分子。我们介绍了MolMIM，一种用于小分子药物发现的概率自编码器，它学习了一种信息丰富且聚类的潜在空间。 MolMIM是用互信息机器（MIM）学习训练的，并提供了变长SMILES字符串的固定长度表示。由于编码器-解码器模型可以学习具有无效样本的“空洞”的表示，因此我们在训练过程中提出了一种新颖的扩展，促进了致密的潜在空间，并允许模型从潜在代码的随机扰动中采样有效的分子。我们对MolMIM与几种可变大小和固定大小的编码器-解码器模型进行了全面比较，通过有效性、独特性和新颖性等指标证明了MolMIM的更好的生成能力。然后，我们利用CMA-ES（一种朴素演化算法）来优化分子性质的组合目标函数，并展示了MolMIM在分子优化方面的表现优于现有最先进的方法。",
    "tldr": "MolMIM是用于小分子药物发现的概率自编码器，其学习了一种信息丰富且聚类的潜在空间，并通过促进致密的潜在空间来采样有效的分子。通过与其他模型的比较，证明了MolMIM的更好的生成能力，并展示了其出色的分子优化性能。",
    "en_tdlr": "MolMIM is a probabilistic auto-encoder for small molecule drug discovery that learns an informative and clustered latent space using Mutual Information Machine (MIM) learning. It proposes a novel extension that promotes a dense latent space and allows valid molecule sampling from random perturbations of latent codes. MolMIM showed superior generation as measured by validity, uniqueness and novelty compared to other models, and its performance in molecule optimization outperforms state-of-the-art methods."
}