{
    "title": "From Workplace to Residence: The Spillover Effects of Minimum Wage Policies on Local Housing Markets. (arXiv:2208.01791v2 [econ.GN] UPDATED)",
    "abstract": "The recent rise of sub-national minimum wage (MW) policies in the US has resulted in significant dispersion of MW levels within urban areas. In this paper, we study the spillover effects of these policies on local rental markets through commuting. To do so, for each USPS ZIP code we construct a \"workplace\" MW measure based on the location of its resident's jobs, and use it to estimate the effect of MW policies on rents. We use a novel identification strategy that exploits the fine timing of differential changes in the workplace MW across ZIP codes that share the same \"residence\" MW, defined as the same location's MW. Our baseline results imply that a 10 percent increase in the workplace MW increases rents at residence ZIP codes by 0.69 percent. To illustrate the importance of commuting patterns, we use our estimates and a simple model to simulate the impact of federal and city counterfactual MW policies. The simulations suggest that landlords pocket approximately 10 cents of each dolla",
    "link": "http://arxiv.org/abs/2208.01791",
    "context": "Title: From Workplace to Residence: The Spillover Effects of Minimum Wage Policies on Local Housing Markets. (arXiv:2208.01791v2 [econ.GN] UPDATED)\nAbstract: The recent rise of sub-national minimum wage (MW) policies in the US has resulted in significant dispersion of MW levels within urban areas. In this paper, we study the spillover effects of these policies on local rental markets through commuting. To do so, for each USPS ZIP code we construct a \"workplace\" MW measure based on the location of its resident's jobs, and use it to estimate the effect of MW policies on rents. We use a novel identification strategy that exploits the fine timing of differential changes in the workplace MW across ZIP codes that share the same \"residence\" MW, defined as the same location's MW. Our baseline results imply that a 10 percent increase in the workplace MW increases rents at residence ZIP codes by 0.69 percent. To illustrate the importance of commuting patterns, we use our estimates and a simple model to simulate the impact of federal and city counterfactual MW policies. The simulations suggest that landlords pocket approximately 10 cents of each dolla",
    "path": "papers/22/08/2208.01791.json",
    "total_tokens": 1013,
    "translated_title": "从工作地到居住地：最低工资政策对当地住房市场的溢出效应",
    "translated_abstract": "美国最近出现了各州颁布地方最低工资政策，导致城市地区内的最低工资水平出现显著差异。本文通过通勤研究这些政策对当地租房市场的溢出效应。我们根据居民工作地点构建每个邮政编码区域的“工作地”最低工资水平，并用它估计最低工资政策对租金的影响。我们采用了一种新的识别策略，利用了共享“居住地”最低工资水平（即相同地点的最低工资水平）的邮政编码区域之间工作地最低工资变化的细节时机不同。我们的基准结果表明，工作地最低工资水平增加10%会导致居住地邮政编码区域的租金增加0.69%。为了说明通勤模式的重要性，我们使用估计结果和一个简单的模型来模拟联邦和城市虚拟最低工资政策的影响。模拟结果表明，房东每收入1美元，大约会入袋10美分。",
    "tldr": "本研究通过研究最低工资政策对通勤造成的溢出效应，发现工作地的最低工资增加会导致居住地租金上涨，每10%的工作地最低工资增加将使居住地租金增加0.69%。"
}