{
    "title": "Combining AI and AM - Improving Approximate Matching through Transformer Networks. (arXiv:2208.11367v3 [cs.CR] UPDATED)",
    "abstract": "Approximate matching (AM) is a concept in digital forensics to determine the similarity between digital artifacts. An important use case of AM is the reliable and efficient detection of case-relevant data structures on a blacklist, if only fragments of the original are available. For instance, if only a cluster of indexed malware is still present during the digital forensic investigation, the AM algorithm shall be able to assign the fragment to the blacklisted malware. However, traditional AM functions like TLSH and ssdeep fail to detect files based on their fragments if the presented piece is relatively small compared to the overall file size. A second well-known issue with traditional AM algorithms is the lack of scaling due to the ever-increasing lookup databases. We propose an improved matching algorithm based on transformer models from the field of natural language processing. We call our approach Deep Learning Approximate Matching (DLAM). As a concept from artificial intelligence",
    "link": "http://arxiv.org/abs/2208.11367",
    "context": "Title: Combining AI and AM - Improving Approximate Matching through Transformer Networks. (arXiv:2208.11367v3 [cs.CR] UPDATED)\nAbstract: Approximate matching (AM) is a concept in digital forensics to determine the similarity between digital artifacts. An important use case of AM is the reliable and efficient detection of case-relevant data structures on a blacklist, if only fragments of the original are available. For instance, if only a cluster of indexed malware is still present during the digital forensic investigation, the AM algorithm shall be able to assign the fragment to the blacklisted malware. However, traditional AM functions like TLSH and ssdeep fail to detect files based on their fragments if the presented piece is relatively small compared to the overall file size. A second well-known issue with traditional AM algorithms is the lack of scaling due to the ever-increasing lookup databases. We propose an improved matching algorithm based on transformer models from the field of natural language processing. We call our approach Deep Learning Approximate Matching (DLAM). As a concept from artificial intelligence",
    "path": "papers/22/08/2208.11367.json",
    "total_tokens": 723,
    "translated_title": "AI与AM的结合——通过Transformer网络提高近似匹配",
    "translated_abstract": "近似匹配（AM）是数字取证中用于确定数字工件相似度的概念。 AM的重要用例是在只有原始工件的碎片可用时，可靠高效地检测黑名单中与案件相关的数据结构。我们提出了一种基于自然语言处理领域的Transformer模型的改进匹配算法，称为Deep Learning Approximate Matching（DLAM），为人工智能的概念。",
    "tldr": "该论文提出了一种基于Transformer模型的Deep Learning Approximate Matching算法，该算法结合AI与AM，能够在只有原始工件的碎片可用时，可靠高效地检测黑名单中与案件相关的数据结构。",
    "en_tdlr": "The paper proposes an improved matching algorithm, named Deep Learning Approximate Matching (DLAM), based on Transformer models. This algorithm combines AI and AM and is capable of reliably and efficiently detecting case-relevant data structures on a blacklist, even when only fragments of the original artifacts are available."
}