{
    "title": "Community Detection in the Hypergraph SBM: Optimal Recovery Given the Similarity Matrix. (arXiv:2208.12227v2 [cs.SI] UPDATED)",
    "abstract": "Community detection is a fundamental problem in network science. In this paper, we consider community detection in hypergraphs drawn from the $hypergraph$ $stochastic$ $block$ $model$ (HSBM), with a focus on exact community recovery. We study the performance of polynomial-time algorithms which operate on the $similarity$ $matrix$ $W$, where $W_{ij}$ reports the number of hyperedges containing both $i$ and $j$. Under this information model, Kim, Bandeira, and Goemans determined the information-theoretic threshold for exact recovery in the logarithmic degree regime, and proposed a semidefinite programming relaxation which they conjectured to be optimal. In this paper, we confirm this conjecture. We also design a simple and highly efficient spectral algorithm with nearly linear runtime and show that it achieves the information-theoretic threshold. Moreover, the spectral algorithm also succeeds in denser regimes and is considerably more efficient than previous approaches, establishing it a",
    "link": "http://arxiv.org/abs/2208.12227",
    "context": "Title: Community Detection in the Hypergraph SBM: Optimal Recovery Given the Similarity Matrix. (arXiv:2208.12227v2 [cs.SI] UPDATED)\nAbstract: Community detection is a fundamental problem in network science. In this paper, we consider community detection in hypergraphs drawn from the $hypergraph$ $stochastic$ $block$ $model$ (HSBM), with a focus on exact community recovery. We study the performance of polynomial-time algorithms which operate on the $similarity$ $matrix$ $W$, where $W_{ij}$ reports the number of hyperedges containing both $i$ and $j$. Under this information model, Kim, Bandeira, and Goemans determined the information-theoretic threshold for exact recovery in the logarithmic degree regime, and proposed a semidefinite programming relaxation which they conjectured to be optimal. In this paper, we confirm this conjecture. We also design a simple and highly efficient spectral algorithm with nearly linear runtime and show that it achieves the information-theoretic threshold. Moreover, the spectral algorithm also succeeds in denser regimes and is considerably more efficient than previous approaches, establishing it a",
    "path": "papers/22/08/2208.12227.json",
    "total_tokens": 900,
    "translated_title": "超图SBM中的社区发现：给定相似性矩阵的最优恢复",
    "translated_abstract": "社区发现是网络科学中的一个基础问题。本文考虑了超图随机块模型（HSBM）中的社区发现问题，重点是确切的社区恢复。我们研究了基于相似性矩阵W的多项式时间算法的性能，其中W_{ij}表示同时包含i和j的超边的数量。在这个信息模型下，Kim，Bandeira和Goemans确定了在对数度数区间内的精确恢复的信息论阈值，他们提出了一个半定规划松弛，认为这是最优的猜想。在本文中，我们证实了这个猜想。我们还设计了一个简单且高效的谱算法，几乎具有线性运行时间，并且证明它达到了信息论阈值。此外，这个谱算法还能在更密集的情况下成功，并且比之前的方法更高效，因此被认为是一种有效的方法。",
    "tldr": "本文研究了超图随机块模型中的社区发现问题，通过分析相似性矩阵和设计谱算法，实现了在不同密度条件下的精确恢复和高效计算。",
    "en_tdlr": "This paper addresses the problem of community detection in hypergraphs drawn from the hypergraph stochastic block model (HSBM), and proposes polynomial-time algorithms based on the similarity matrix and a spectral algorithm to achieve exact recovery and efficient computation under different density conditions."
}