{
    "title": "POCS-based Clustering Algorithm. (arXiv:2208.08888v3 [cs.LG] UPDATED)",
    "abstract": "A novel clustering technique based on the projection onto convex set (POCS) method, called POCS-based clustering algorithm, is proposed in this paper. The proposed POCS-based clustering algorithm exploits a parallel projection method of POCS to find appropriate cluster prototypes in the feature space. The algorithm considers each data point as a convex set and projects the cluster prototypes parallelly to the member data points. The projections are convexly combined to minimize the objective function for data clustering purpose. The performance of the proposed POCS-based clustering algorithm is verified through experiments on various synthetic datasets. The experimental results show that the proposed POCS-based clustering algorithm is competitive and efficient in terms of clustering error and execution speed when compared with other conventional clustering methods including Fuzzy C-Means (FCM) and K-means clustering algorithms.",
    "link": "http://arxiv.org/abs/2208.08888",
    "context": "Title: POCS-based Clustering Algorithm. (arXiv:2208.08888v3 [cs.LG] UPDATED)\nAbstract: A novel clustering technique based on the projection onto convex set (POCS) method, called POCS-based clustering algorithm, is proposed in this paper. The proposed POCS-based clustering algorithm exploits a parallel projection method of POCS to find appropriate cluster prototypes in the feature space. The algorithm considers each data point as a convex set and projects the cluster prototypes parallelly to the member data points. The projections are convexly combined to minimize the objective function for data clustering purpose. The performance of the proposed POCS-based clustering algorithm is verified through experiments on various synthetic datasets. The experimental results show that the proposed POCS-based clustering algorithm is competitive and efficient in terms of clustering error and execution speed when compared with other conventional clustering methods including Fuzzy C-Means (FCM) and K-means clustering algorithms.",
    "path": "papers/22/08/2208.08888.json",
    "total_tokens": 807,
    "translated_title": "基于POCS的聚类算法",
    "translated_abstract": "本文提出了一种基于凸集投影(POCS)方法的新型聚类技术，称为基于POCS的聚类算法。该算法利用POCS的并行投影方法在特征空间中找到适当的聚类原型。该算法将每个数据点视为一个凸集，并将聚类原型平行投影到成员数据点上，最小化数据聚类目标函数。在各种合成数据集上进行实验验证，结果表明，与其他传统聚类方法，包括模糊C-均值(FCM)和K-means聚类算法相比，提出的基于POCS的聚类算法在聚类误差和执行速度方面都具有竞争力和效率。",
    "tldr": "本文提出了一种基于POCS方法的聚类算法，该算法利用并行投影方法在特征空间中找到适当的聚类原型，实验结果表明在聚类误差和执行速度方面与传统聚类方法相比优势明显。",
    "en_tdlr": "This paper proposes a new clustering algorithm based on the projection onto convex set (POCS) method, which uses a parallel projection method of POCS to find appropriate cluster prototypes in the feature space. The experimental results show that the proposed algorithm outperforms conventional clustering methods including Fuzzy C-Means (FCM) and K-means clustering algorithms in terms of clustering error and execution speed."
}