{
    "title": "DIET: Conditional independence testing with marginal dependence measures of residual information. (arXiv:2208.08579v2 [stat.ME] UPDATED)",
    "abstract": "Conditional randomization tests (CRTs) assess whether a variable $x$ is predictive of another variable $y$, having observed covariates $z$. CRTs require fitting a large number of predictive models, which is often computationally intractable. Existing solutions to reduce the cost of CRTs typically split the dataset into a train and test portion, or rely on heuristics for interactions, both of which lead to a loss in power. We propose the decoupled independence test (DIET), an algorithm that avoids both of these issues by leveraging marginal independence statistics to test conditional independence relationships. DIET tests the marginal independence of two random variables: $F(x \\mid z)$ and $F(y \\mid z)$ where $F(\\cdot \\mid z)$ is a conditional cumulative distribution function (CDF). These variables are termed \"information residuals.\" We give sufficient conditions for DIET to achieve finite sample type-1 error control and power greater than the type-1 error rate. We then prove that when ",
    "link": "http://arxiv.org/abs/2208.08579",
    "context": "Title: DIET: Conditional independence testing with marginal dependence measures of residual information. (arXiv:2208.08579v2 [stat.ME] UPDATED)\nAbstract: Conditional randomization tests (CRTs) assess whether a variable $x$ is predictive of another variable $y$, having observed covariates $z$. CRTs require fitting a large number of predictive models, which is often computationally intractable. Existing solutions to reduce the cost of CRTs typically split the dataset into a train and test portion, or rely on heuristics for interactions, both of which lead to a loss in power. We propose the decoupled independence test (DIET), an algorithm that avoids both of these issues by leveraging marginal independence statistics to test conditional independence relationships. DIET tests the marginal independence of two random variables: $F(x \\mid z)$ and $F(y \\mid z)$ where $F(\\cdot \\mid z)$ is a conditional cumulative distribution function (CDF). These variables are termed \"information residuals.\" We give sufficient conditions for DIET to achieve finite sample type-1 error control and power greater than the type-1 error rate. We then prove that when ",
    "path": "papers/22/08/2208.08579.json",
    "total_tokens": 971,
    "translated_title": "DIET: 利用剩余信息的边际相关度量进行条件独立性检验",
    "translated_abstract": "条件随机化检验（CRT）用于评估变量$x$在已知协变量$z$的情况下对另一个变量$y$的预测能力。CRT通常需要大量预测模型的拟合，这通常是计算上不可行的。现有的解决方案通常将数据集分成训练和测试部分，或依靠相互作用的启发式方法，这两种方法都会导致功率损失。本文提出了解耦的独立性检验（DIET）算法，通过利用边际独立统计量测试条件独立关系，避免了这两种问题。DIET测试两个随机变量的边际独立性：$F(x \\mid z)$和$F(y \\mid z)$其中$F(\\cdot \\mid z)$是条件累积分布函数（CDF），这些变量被称为“信息残差”。我们给出了DIET实现有限样本的类型1错误控制和功率大于类型1错误率的充分条件。然后，我们证明当DIET应用时，数据的分布不需要满足任何特定要求。",
    "tldr": "本文提出了一种名为解耦的独立性检验（DIET）算法，通过利用边际独立统计量测试条件独立关系，避免了需要大量预测模型的拟合和相互作用的启发式方法所导致的损失功率问题。",
    "en_tdlr": "This paper proposes a new algorithm called Decoupled Independence Test (DIET) that tests conditional independence relationships by leveraging marginal independence statistics while avoiding the need for fitting a large number of predictive models and relying on heuristics for interactions thus solving the power loss problem."
}