{
    "title": "Learning Efficient Abstract Planning Models that Choose What to Predict. (arXiv:2208.07737v3 [cs.AI] UPDATED)",
    "abstract": "An effective approach to solving long-horizon tasks in robotics domains with continuous state and action spaces is bilevel planning, wherein a high-level search over an abstraction of an environment is used to guide low-level decision-making. Recent work has shown how to enable such bilevel planning by learning abstract models in the form of symbolic operators and neural samplers. In this work, we show that existing symbolic operator learning approaches fall short in many robotics domains where a robot's actions tend to cause a large number of irrelevant changes in the abstract state. This is primarily because they attempt to learn operators that exactly predict all observed changes in the abstract state. To overcome this issue, we propose to learn operators that 'choose what to predict' by only modelling changes necessary for abstract planning to achieve specified goals. Experimentally, we show that our approach learns operators that lead to efficient planning across 10 different hybr",
    "link": "http://arxiv.org/abs/2208.07737",
    "context": "Title: Learning Efficient Abstract Planning Models that Choose What to Predict. (arXiv:2208.07737v3 [cs.AI] UPDATED)\nAbstract: An effective approach to solving long-horizon tasks in robotics domains with continuous state and action spaces is bilevel planning, wherein a high-level search over an abstraction of an environment is used to guide low-level decision-making. Recent work has shown how to enable such bilevel planning by learning abstract models in the form of symbolic operators and neural samplers. In this work, we show that existing symbolic operator learning approaches fall short in many robotics domains where a robot's actions tend to cause a large number of irrelevant changes in the abstract state. This is primarily because they attempt to learn operators that exactly predict all observed changes in the abstract state. To overcome this issue, we propose to learn operators that 'choose what to predict' by only modelling changes necessary for abstract planning to achieve specified goals. Experimentally, we show that our approach learns operators that lead to efficient planning across 10 different hybr",
    "path": "papers/22/08/2208.07737.json",
    "total_tokens": 838,
    "translated_title": "学习有效的选择预测的抽象规划模型",
    "translated_abstract": "在具有连续状态和行动空间的机器人领域中，解决长期任务的有效方法是双层规划，其中在环境的抽象层上进行高级搜索以指导低级决策。最近的研究表明，通过学习符号操作和神经采样器的抽象模型，可以实现这种双层规划。在本研究中，我们展示了现有的符号操作学习方法在许多机器人领域存在不足之处，因为机器人的行动往往会引起抽象状态中大量无关的变化，而这些方法试图学习准确预测抽象状态中所有观察到的变化的操作。为了解决这个问题，我们提出了一种学习\"选择要预测\"的操作的方法，只对实现指定目标的抽象规划所必需的变化建模。通过实验证明，我们的方法能够学习出导致10个不同混合任务上的高效规划的操作。",
    "tldr": "该论文提出了一种学习抽象规划模型的方法，通过选择预测来提高机器人在长期任务中的决策效率。",
    "en_tdlr": "This paper proposes a method to learn abstract planning models that improve the decision efficiency of robots in long-horizon tasks by choosing what to predict."
}