{
    "title": "Individual fairness under Varied Notions of Group Fairness in Bipartite Matching -- One Framework to Approximate Them Al. (arXiv:2208.09951v3 [cs.AI] UPDATED)",
    "abstract": "We consider the problem of assigning items to platforms while satisfying group and individual fairness constraints. Each item is associated with certain groups and has a preference ordering over platforms. Each platform enforces group fairness by specifying an upper and a lower bound on the number of items that can be matched to it from each group. Although there may be multiple optimal solutions that satisfy the group fairness constraints, we aim to achieve `probabilistic individual fairness' by computing a distribution over `group fair' matchings such that each item has a reasonable probability of being matched to one of its top choices. When each item can belong to multiple groups, the problem of finding a maximum size group-fair matching is NP-hard even when all the group lower bounds are 0, and there are no individual fairness constraints. Given a total of $n$ items, we achieve a $O(\\Delta \\log n)$ approximation algorithm when an item can belong to at most $\\Delta$ groups, and all",
    "link": "http://arxiv.org/abs/2208.09951",
    "context": "Title: Individual fairness under Varied Notions of Group Fairness in Bipartite Matching -- One Framework to Approximate Them Al. (arXiv:2208.09951v3 [cs.AI] UPDATED)\nAbstract: We consider the problem of assigning items to platforms while satisfying group and individual fairness constraints. Each item is associated with certain groups and has a preference ordering over platforms. Each platform enforces group fairness by specifying an upper and a lower bound on the number of items that can be matched to it from each group. Although there may be multiple optimal solutions that satisfy the group fairness constraints, we aim to achieve `probabilistic individual fairness' by computing a distribution over `group fair' matchings such that each item has a reasonable probability of being matched to one of its top choices. When each item can belong to multiple groups, the problem of finding a maximum size group-fair matching is NP-hard even when all the group lower bounds are 0, and there are no individual fairness constraints. Given a total of $n$ items, we achieve a $O(\\Delta \\log n)$ approximation algorithm when an item can belong to at most $\\Delta$ groups, and all",
    "path": "papers/22/08/2208.09951.json",
    "total_tokens": 1101,
    "translated_title": "二分图匹配中的不同群体公平性下的个体公平性——一种近似框架",
    "translated_abstract": "本文研究在满足群体和个体公平性约束的情况下分配物品给平台的问题。每个物品都与某些群体相关联，并且对平台有优先顺序。每个平台通过指定每个群体可以与之匹配的物品数量的上限和下限来执行群体公平性。尽管可能存在满足群体公平性约束的多个最优解，我们旨在通过计算一个分布来实现“随机个体公平性”，使得每个物品被匹配到其前几个选择之一的合理概率。当每个物品可以属于多个群体时，即使所有群体下限均为0且没有个体公平性约束，寻找最大大小群体公平匹配的问题也是NP-难的。对于一共$n$个物品，当一个物品最多属于$\\Delta$个群体，并且所有群体的上限和下限都是常数时，我们实现了$O(\\Delta \\log n)$近似算法。我们还证明，对于所有群体公平性约束都是区间的特殊情况，我们可以高效地计算满足这些约束的个体公平匹配的分布。因此，我们的框架可以用于近似文献中提出的群体公平性概念，同时实现个体公平性。",
    "tldr": "本文研究在满足群体和个体公平性约束的情况下分配物品给平台的问题，并提出了一种近似框架，可以用来近似文献中提出的群体公平性概念，同时实现个体公平性。",
    "en_tdlr": "This paper studies the problem of assigning items to platforms while satisfying group and individual fairness constraints, and proposes an approximation framework that can be used to approximate the notions of group fairness proposed in literature while achieving individual fairness."
}