{
    "title": "Label-Noise Learning with Intrinsically Long-Tailed Data. (arXiv:2208.09833v2 [cs.LG] UPDATED)",
    "abstract": "Label noise is one of the key factors that lead to the poor generalization of deep learning models. Existing label-noise learning methods usually assume that the ground-truth classes of the training data are balanced. However, the real-world data is often imbalanced, leading to the inconsistency between observed and intrinsic class distribution with label noises. In this case, it is hard to distinguish clean samples from noisy samples on the intrinsic tail classes with the unknown intrinsic class distribution. In this paper, we propose a learning framework for label-noise learning with intrinsically long-tailed data. Specifically, we propose two-stage bi-dimensional sample selection (TABASCO) to better separate clean samples from noisy samples, especially for the tail classes. TABASCO consists of two new separation metrics that complement each other to compensate for the limitation of using a single metric in sample separation. Extensive experiments on benchmarks we proposed with real-",
    "link": "http://arxiv.org/abs/2208.09833",
    "context": "Title: Label-Noise Learning with Intrinsically Long-Tailed Data. (arXiv:2208.09833v2 [cs.LG] UPDATED)\nAbstract: Label noise is one of the key factors that lead to the poor generalization of deep learning models. Existing label-noise learning methods usually assume that the ground-truth classes of the training data are balanced. However, the real-world data is often imbalanced, leading to the inconsistency between observed and intrinsic class distribution with label noises. In this case, it is hard to distinguish clean samples from noisy samples on the intrinsic tail classes with the unknown intrinsic class distribution. In this paper, we propose a learning framework for label-noise learning with intrinsically long-tailed data. Specifically, we propose two-stage bi-dimensional sample selection (TABASCO) to better separate clean samples from noisy samples, especially for the tail classes. TABASCO consists of two new separation metrics that complement each other to compensate for the limitation of using a single metric in sample separation. Extensive experiments on benchmarks we proposed with real-",
    "path": "papers/22/08/2208.09833.json",
    "total_tokens": 926,
    "translated_title": "自带长尾数据的标签噪声学习",
    "translated_abstract": "标签噪声是导致深度学习模型泛化能力差的关键因素之一。现有的标签噪声学习方法通常假设训练数据的真实类别是平衡的。然而，现实世界的数据往往是不平衡的，导致观察到的和内在类别分布之间存在不一致的标签噪声。在这种情况下，很难在具有未知内在类别分布的长尾类上区分干净样本和噪声样本。本文提出了一种用于自带长尾数据的标签噪声学习的学习框架。具体而言，我们提出了两阶段的双维样本选择（TABASCO）来更好地将干净样本与噪声样本分开，尤其是对于尾部类别。TABASCO包括两个新的分离度量，相互补充，弥补了在样本分离中使用单个度量的局限性。对我们提出的具有真实数据的基准进行了大量实验证明。",
    "tldr": "本文针对自带长尾数据的标签噪声学习问题，提出了一个学习框架并设计了双维样本选择算法 TABASCO，有效地将干净样本与噪声样本分开，特别适用于长尾类别。",
    "en_tdlr": "This paper addresses the problem of label-noise learning with intrinsically long-tailed data. It proposes a learning framework and a two-stage b-dimensional sample selection algorithm (TABASCO) to effectively separate clean samples from noisy samples, especially for the tail classes."
}