{
    "title": "Measuring incompatibility and clustering quantum observables with a quantum switch. (arXiv:2208.06210v3 [quant-ph] UPDATED)",
    "abstract": "The existence of incompatible observables is a cornerstone of quantum mechanics and a valuable resource in quantum technologies. Here we introduce a measure of incompatibility, called the mutual eigenspace disturbance (MED), which quantifies the amount of disturbance induced by the measurement of a sharp observable on the eigenspaces of another. The MED provides a metric on the space of von Neumann measurements, and can be efficiently estimated by letting the measurement processes act in an indefinite order, using a setup known as the quantum switch, which also allows one to quantify the noncommutativity of arbitrary quantum processes. Thanks to these features, the MED can be used in quantum machine learning tasks. We demonstrate this application by providing an unsupervised algorithm that clusters unknown von Neumann measurements. Our algorithm is robust to noise can be used to identify groups of observers that share approximately the same measurement context.",
    "link": "http://arxiv.org/abs/2208.06210",
    "context": "Title: Measuring incompatibility and clustering quantum observables with a quantum switch. (arXiv:2208.06210v3 [quant-ph] UPDATED)\nAbstract: The existence of incompatible observables is a cornerstone of quantum mechanics and a valuable resource in quantum technologies. Here we introduce a measure of incompatibility, called the mutual eigenspace disturbance (MED), which quantifies the amount of disturbance induced by the measurement of a sharp observable on the eigenspaces of another. The MED provides a metric on the space of von Neumann measurements, and can be efficiently estimated by letting the measurement processes act in an indefinite order, using a setup known as the quantum switch, which also allows one to quantify the noncommutativity of arbitrary quantum processes. Thanks to these features, the MED can be used in quantum machine learning tasks. We demonstrate this application by providing an unsupervised algorithm that clusters unknown von Neumann measurements. Our algorithm is robust to noise can be used to identify groups of observers that share approximately the same measurement context.",
    "path": "papers/22/08/2208.06210.json",
    "total_tokens": 911,
    "translated_title": "用量子开关测量不相容性并对量子观测结果进行聚类",
    "translated_abstract": "不相容观测结果是量子力学的基石，并且是量子技术中的宝贵资源。本文提出了一种不相容性测量指标，即“共同本征空间干扰”，可以量化一个精确观测量对另一个本征空间的干扰量。该指标提供了 von Neumann 测量空间的度量，并可以通过使用称为“量子开关”的设置，让测量过程以不确定的顺序进行，从而高效地进行估计。由于这些特性，MED可以在量子机器学习任务中使用。通过提供一个无监督算法，对未知的von Neumann 测量结果进行聚类。我们的算法对噪声具有鲁棒性，并可用于确定共享近似相同测量环境的观察者组。",
    "tldr": "本研究提出了一种量子不相容性测量指标“共同本征空间干扰”，并进一步通过量子开关实现量化，方便量子机器学习任务的处理。同时，算法可以对测量结果进行聚类，确定共享相似测量环境的观察者组。",
    "en_tdlr": "This paper introduces a measure of incompatibility called Mutual Eigenspace Disturbance (MED), which can quantify the disturbance induced by one sharp observable's measurement on the eigenspaces of another in a von Neumann measurement space. The authors use a quantum switch to efficiently estimate the MED and demonstrate its usefulness in quantum machine learning tasks by providing an unsupervised algorithm for clustering unknown von Neumann measurements. The algorithm is robust to noise and can identify groups of observers sharing approximately the same measurement context."
}