{
    "title": "CFARnet: deep learning for target detection with constant false alarm rate. (arXiv:2208.02474v2 [cs.LG] UPDATED)",
    "abstract": "We consider the problem of target detection with a constant false alarm rate (CFAR). This constraint is crucial in many practical applications and is a standard requirement in classical composite hypothesis testing. In settings where classical approaches are computationally expensive or where only data samples are given, Bayesian and machine learning methodologies are advantageous. CFAR is less understood in these settings. To close this gap, we introduce a framework of CFAR constrained detectors. Theoretically, we prove that a CFAR constrained Bayes optimal detector is asymptotically equivalent to the classical generalized likelihood ratio test (GLRT). Practically, we develop a deep learning framework for fitting neural networks that approximate it. Experiments in both model based target detection and data-driven hyper-spectral images demonstrates that the proposed CFARnet allows a flexible tradeoff between CFAR and accuracy. In many problems near CFAR detectors can be developed with ",
    "link": "http://arxiv.org/abs/2208.02474",
    "context": "Title: CFARnet: deep learning for target detection with constant false alarm rate. (arXiv:2208.02474v2 [cs.LG] UPDATED)\nAbstract: We consider the problem of target detection with a constant false alarm rate (CFAR). This constraint is crucial in many practical applications and is a standard requirement in classical composite hypothesis testing. In settings where classical approaches are computationally expensive or where only data samples are given, Bayesian and machine learning methodologies are advantageous. CFAR is less understood in these settings. To close this gap, we introduce a framework of CFAR constrained detectors. Theoretically, we prove that a CFAR constrained Bayes optimal detector is asymptotically equivalent to the classical generalized likelihood ratio test (GLRT). Practically, we develop a deep learning framework for fitting neural networks that approximate it. Experiments in both model based target detection and data-driven hyper-spectral images demonstrates that the proposed CFARnet allows a flexible tradeoff between CFAR and accuracy. In many problems near CFAR detectors can be developed with ",
    "path": "papers/22/08/2208.02474.json",
    "total_tokens": 906,
    "translated_abstract": "本文考虑具有恒定虚警率（CFAR）的目标检测问题。在许多实际应用中，此约束条件至关重要，是经典复合假设检验的标准要求。在计算昂贵或仅给定数据样本的情况下，贝叶斯和机器学习方法是有优势的。然而，在这些设置中，CFAR被理解得较少。为了填补这个空缺，我们引入了CFAR约束检测器的框架。理论上，我们证明了CFAR约束的贝叶斯最优检测器渐近等价于经典的广义似然比测试（GLRT）。在实践中，我们开发了一个深度学习框架，用于拟合近似该检测器的神经网络。在基于模型的目标检测和数据驱动的高光谱图像实验中，CFARnet提供了CFAR和精度之间灵活的平衡点。在许多问题上，可以开发接近CFAR的检测器。",
    "tldr": "提出了 CFARnet，一种可以平衡 CFAR 和精度之间的深度学习框架，实验证明在许多问题上可以开发接近 CFAR 的检测器。"
}