{
    "title": "A Multimodal Transformer: Fusing Clinical Notes with Structured EHR Data for Interpretable In-Hospital Mortality Prediction. (arXiv:2208.10240v2 [cs.CL] UPDATED)",
    "abstract": "Deep-learning-based clinical decision support using structured electronic health records (EHR) has been an active research area for predicting risks of mortality and diseases. Meanwhile, large amounts of narrative clinical notes provide complementary information, but are often not integrated into predictive models. In this paper, we provide a novel multimodal transformer to fuse clinical notes and structured EHR data for better prediction of in-hospital mortality. To improve interpretability, we propose an integrated gradients (IG) method to select important words in clinical notes and discover the critical structured EHR features with Shapley values. These important words and clinical features are visualized to assist with interpretation of the prediction outcomes. We also investigate the significance of domain adaptive pretraining and task adaptive fine-tuning on the Clinical BERT, which is used to learn the representations of clinical notes. Experiments demonstrated that our model o",
    "link": "http://arxiv.org/abs/2208.10240",
    "context": "Title: A Multimodal Transformer: Fusing Clinical Notes with Structured EHR Data for Interpretable In-Hospital Mortality Prediction. (arXiv:2208.10240v2 [cs.CL] UPDATED)\nAbstract: Deep-learning-based clinical decision support using structured electronic health records (EHR) has been an active research area for predicting risks of mortality and diseases. Meanwhile, large amounts of narrative clinical notes provide complementary information, but are often not integrated into predictive models. In this paper, we provide a novel multimodal transformer to fuse clinical notes and structured EHR data for better prediction of in-hospital mortality. To improve interpretability, we propose an integrated gradients (IG) method to select important words in clinical notes and discover the critical structured EHR features with Shapley values. These important words and clinical features are visualized to assist with interpretation of the prediction outcomes. We also investigate the significance of domain adaptive pretraining and task adaptive fine-tuning on the Clinical BERT, which is used to learn the representations of clinical notes. Experiments demonstrated that our model o",
    "path": "papers/22/08/2208.10240.json",
    "total_tokens": 1021,
    "translated_title": "一种多模态变换器：将临床笔记与结构化 EHR 数据融合以解释住院死亡风险预测",
    "translated_abstract": "基于深度学习的结构化电子健康记录（EHR）临床决策支持一直是预测死亡风险和疾病的研究重点。同时，大量的叙述性临床笔记提供了补充信息，但常常未集成到预测模型中。本文提出一种新型多模态转换器，融合临床笔记和结构化的 EHR 数据，以更好地预测住院死亡风险。为了提高解释性，我们提出了一种集成梯度（IG）方法来选择临床笔记中的重要词语，并使用 Shapley 值发现重要的结构化 EHR 特征。这些重要的词语和临床特征可视化以协助解释预测结果。我们还研究了领域自适应预训练和任务自适应微调对临床 BERT 的意义，该模型用于学习临床笔记的表示。实验表明，我们的模型优于现有技术。",
    "tldr": "本论文提出了一种新型多模态转换器，融合临床笔记和结构化的EHR数据，以更好地预测住院死亡风险。通过集成梯度方法选择临床笔记中的关键词和利用 Shapley 值发现重要的结构化 EHR 特征，并对其进行可视化解释，提高了模型的解释性。",
    "en_tdlr": "This paper proposes a novel multimodal transformer to fuse clinical notes and structured EHR data for better prediction of in-hospital mortality. The important words in clinical notes are selected using the integrated gradients method, and critical structured EHR features are discovered by Shapley values, which are visualized to assist with interpretation of the prediction outcomes, enhancing the interpretability of the model."
}