{
    "title": "Multiple Descent in the Multiple Random Feature Model. (arXiv:2208.09897v3 [math.ST] UPDATED)",
    "abstract": "Recent works have demonstrated a double descent phenomenon in over-parameterized learning. Although this phenomenon has been investigated by recent works, it has not been fully understood in theory. In this paper, we investigate the multiple descent phenomenon in a class of multi-component prediction models. We first consider a ''double random feature model'' (DRFM) concatenating two types of random features, and study the excess risk achieved by the DRFM in ridge regression. We calculate the precise limit of the excess risk under the high dimensional framework where the training sample size, the dimension of data, and the dimension of random features tend to infinity proportionally. Based on the calculation, we further theoretically demonstrate that the risk curves of DRFMs can exhibit triple descent. We then provide a thorough experimental study to verify our theory. At last, we extend our study to the ''multiple random feature model'' (MRFM), and show that MRFMs ensembling $K$ types",
    "link": "http://arxiv.org/abs/2208.09897",
    "context": "Title: Multiple Descent in the Multiple Random Feature Model. (arXiv:2208.09897v3 [math.ST] UPDATED)\nAbstract: Recent works have demonstrated a double descent phenomenon in over-parameterized learning. Although this phenomenon has been investigated by recent works, it has not been fully understood in theory. In this paper, we investigate the multiple descent phenomenon in a class of multi-component prediction models. We first consider a ''double random feature model'' (DRFM) concatenating two types of random features, and study the excess risk achieved by the DRFM in ridge regression. We calculate the precise limit of the excess risk under the high dimensional framework where the training sample size, the dimension of data, and the dimension of random features tend to infinity proportionally. Based on the calculation, we further theoretically demonstrate that the risk curves of DRFMs can exhibit triple descent. We then provide a thorough experimental study to verify our theory. At last, we extend our study to the ''multiple random feature model'' (MRFM), and show that MRFMs ensembling $K$ types",
    "path": "papers/22/08/2208.09897.json",
    "total_tokens": 927,
    "translated_title": "多个随机特征模型中的多次下降现象",
    "translated_abstract": "最近的研究表明，过度参数化学习中存在双下降现象。尽管这一现象已经得到了研究，但在理论上尚未完全理解。本文研究了多组分预测模型中的多次下降现象。首先考虑一个“双随机特征模型” (DRFM)，它连接了两种类型的随机特征，并研究了DRFM在岭回归中实现的过度风险。我们计算了高维框架下，当训练样本量、数据维度和随机特征维度趋向于无穷大时，过度风险的精确极限。基于这个计算，我们进一步从理论上证明了DRFM的风险曲线可能呈现出三次下降。然后我们进行了深入的实验研究，以验证我们的理论。最后，我们将研究扩展到“多随机特征模型” (MRFM)，并展示了MRFMs集成K种类型的情况。",
    "tldr": "本文研究了过度参数化学习中的双下降现象，并在多组分预测模型中进一步探究了多次下降现象。通过理论计算和实验证实，随机特征模型的风险曲线可以呈现出三次下降。",
    "en_tdlr": "This paper investigates the double descent phenomenon in over-parameterized learning and further explores the multiple descent phenomenon in a class of multi-component prediction models. The risk curves of the random feature models can exhibit triple descent, as demonstrated through theoretical calculations and empirical studies."
}