{
    "title": "Disentangled Contrastive Learning for Social Recommendation. (arXiv:2208.08723v2 [cs.IR] UPDATED)",
    "abstract": "Social recommendations utilize social relations to enhance the representation learning for recommendations. Most social recommendation models unify user representations for the user-item interactions (collaborative domain) and social relations (social domain). However, such an approach may fail to model the users heterogeneous behavior patterns in two domains, impairing the expressiveness of user representations. In this work, to address such limitation, we propose a novel Disentangled contrastive learning framework for social Recommendations DcRec. More specifically, we propose to learn disentangled users representations from the item and social domains. Moreover, disentangled contrastive learning is designed to perform knowledge transfer between disentangled users representations for social recommendations. Comprehensive experiments on various real-world datasets demonstrate the superiority of our proposed model.",
    "link": "http://arxiv.org/abs/2208.08723",
    "context": "Title: Disentangled Contrastive Learning for Social Recommendation. (arXiv:2208.08723v2 [cs.IR] UPDATED)\nAbstract: Social recommendations utilize social relations to enhance the representation learning for recommendations. Most social recommendation models unify user representations for the user-item interactions (collaborative domain) and social relations (social domain). However, such an approach may fail to model the users heterogeneous behavior patterns in two domains, impairing the expressiveness of user representations. In this work, to address such limitation, we propose a novel Disentangled contrastive learning framework for social Recommendations DcRec. More specifically, we propose to learn disentangled users representations from the item and social domains. Moreover, disentangled contrastive learning is designed to perform knowledge transfer between disentangled users representations for social recommendations. Comprehensive experiments on various real-world datasets demonstrate the superiority of our proposed model.",
    "path": "papers/22/08/2208.08723.json",
    "total_tokens": 808,
    "translated_title": "社交推荐中的解缠对比学习",
    "translated_abstract": "社交推荐利用社交关系来增强推荐系统的表示学习。大多数社交推荐模型统一了用户在用户-物品交互领域（协同领域）和社交关系领域的表示。然而，这种方法可能无法建模用户在两个领域中的异质行为模式，从而损害了用户表示的表达能力。为了解决这个问题，本文提出了一种新颖的面向社交推荐的解缠对比学习框架DcRec。具体而言，我们提出从物品和社交领域中学习解缠用户表示。此外，还设计了解缠对比学习来实现解缠用户表示之间的知识转移，用于社交推荐。在各种真实世界的数据集上进行的综合实验证明了我们提出的模型的优越性。",
    "tldr": "本文提出了一种针对社交推荐的解缠对比学习框架DcRec，可以学习解缠用户在物品和社交领域的表示，实现了知识转移，从而提高了社交推荐的性能。",
    "en_tdlr": "This paper proposes a disentangled contrastive learning framework DcRec for social recommendation, which learns disentangled user representations from item and social domains and performs knowledge transfer to improve the performance of social recommendations."
}