{
    "title": "Unsupervised machine learning framework for discriminating major variants of concern during COVID-19. (arXiv:2208.01439v3 [q-bio.OT] UPDATED)",
    "abstract": "Due to the high mutation rate of the virus, the COVID-19 pandemic evolved rapidly. Certain variants of the virus, such as Delta and Omicron, emerged with altered viral properties leading to severe transmission and death rates. These variants burdened the medical systems worldwide with a major impact to travel, productivity, and the world economy. Unsupervised machine learning methods have the ability to compress, characterize, and visualize unlabelled data. This paper presents a framework that utilizes unsupervised machine learning methods to discriminate and visualize the associations between major COVID-19 variants based on their genome sequences. These methods comprise a combination of selected dimensionality reduction and clustering techniques. The framework processes the RNA sequences by performing a k-mer analysis on the data and further visualises and compares the results using selected dimensionality reduction methods that include principal component analysis (PCA), t-distribut",
    "link": "http://arxiv.org/abs/2208.01439",
    "context": "Title: Unsupervised machine learning framework for discriminating major variants of concern during COVID-19. (arXiv:2208.01439v3 [q-bio.OT] UPDATED)\nAbstract: Due to the high mutation rate of the virus, the COVID-19 pandemic evolved rapidly. Certain variants of the virus, such as Delta and Omicron, emerged with altered viral properties leading to severe transmission and death rates. These variants burdened the medical systems worldwide with a major impact to travel, productivity, and the world economy. Unsupervised machine learning methods have the ability to compress, characterize, and visualize unlabelled data. This paper presents a framework that utilizes unsupervised machine learning methods to discriminate and visualize the associations between major COVID-19 variants based on their genome sequences. These methods comprise a combination of selected dimensionality reduction and clustering techniques. The framework processes the RNA sequences by performing a k-mer analysis on the data and further visualises and compares the results using selected dimensionality reduction methods that include principal component analysis (PCA), t-distribut",
    "path": "papers/22/08/2208.01439.json",
    "total_tokens": 1051,
    "translated_title": "无监督机器学习框架用于区分COVID-19主要变异体",
    "translated_abstract": "由于病毒的高突变率，COVID-19疫情迅速演变。某些病毒变异体，如Delta和Omicron，出现并改变了病毒的特性，导致病例传播和死亡率严重。这些变异体对全球医疗系统造成了沉重负担，对旅行、生产力和世界经济产生了重大影响。无监督机器学习方法具有压缩、描述和可视化未标记数据的能力。本文提出了一个框架，利用无监督机器学习方法，基于基因组序列区分和可视化COVID-19主要变异体之间的关联。这些方法采用一些选定的降维和聚类技术的组合。该框架通过对数据执行k-mer分析来处理RNA序列，并使用包括主成分分析（PCA）、t-分布随机邻域嵌入（t-SNE）和均匀流形逼近和投影（UMAP）的选定降维方法进一步可视化和比较结果。这个框架展示的聚类和关联可以帮助研究人员和医疗保健专业人员了解COVID-19病毒的流行病学和进化动态。",
    "tldr": "本文提出了一个无监督机器学习框架，利用基因组序列区分和可视化COVID-19主要变异体之间的关联。这一框架可以帮助医疗保健专业人员了解病毒的流行病学和进化动态。",
    "en_tdlr": "This paper presents an unsupervised machine learning framework that discriminates and visualizes the associations between major COVID-19 variants based on genome sequences, which can aid healthcare professionals in understanding the epidemiological and evolutionary dynamics of the virus."
}