{
    "title": "Valuation of general GMWB annuities in a low interest rate environment. (arXiv:2208.10183v2 [q-fin.PR] UPDATED)",
    "abstract": "Variable annuities with Guaranteed Minimum Withdrawal Benefits (GMWB) entitle the policy holder to periodic withdrawals together with a terminal payoff linked to the performance of an equity fund. In this paper, we consider the valuation of a general class of GMWB annuities, allowing for step-up, bonus and surrender features, taking also into account mortality risk and death benefits. When dynamic withdrawals are allowed, the valuation of GMWB annuities leads to a stochastic optimal control problem, which we address here by dynamic programming techniques. Adopting a Hull-White interest rate model, correlated with the equity fund, we propose an efficient tree-based algorithm. We perform a thorough analysis of the determinants of the market value of GMWB annuities and of the optimal withdrawal strategies. In particular, we study the impact of a low/negative interest rate environment. Our findings indicate that low/negative rates profoundly affect the optimal withdrawal behaviour and, in ",
    "link": "http://arxiv.org/abs/2208.10183",
    "context": "Title: Valuation of general GMWB annuities in a low interest rate environment. (arXiv:2208.10183v2 [q-fin.PR] UPDATED)\nAbstract: Variable annuities with Guaranteed Minimum Withdrawal Benefits (GMWB) entitle the policy holder to periodic withdrawals together with a terminal payoff linked to the performance of an equity fund. In this paper, we consider the valuation of a general class of GMWB annuities, allowing for step-up, bonus and surrender features, taking also into account mortality risk and death benefits. When dynamic withdrawals are allowed, the valuation of GMWB annuities leads to a stochastic optimal control problem, which we address here by dynamic programming techniques. Adopting a Hull-White interest rate model, correlated with the equity fund, we propose an efficient tree-based algorithm. We perform a thorough analysis of the determinants of the market value of GMWB annuities and of the optimal withdrawal strategies. In particular, we study the impact of a low/negative interest rate environment. Our findings indicate that low/negative rates profoundly affect the optimal withdrawal behaviour and, in ",
    "path": "papers/22/08/2208.10183.json",
    "total_tokens": 950,
    "translated_title": "低利率环境下通用GMWB年金的估值",
    "translated_abstract": "保证最低提取收益GMWB的可变年金（VA）使保单持有人能够定期提取一定金额以及与股票基金表现相关的最终结算。本文考虑了通用类别GMWB年金的估值，允许阶梯上升、奖金和放弃特性，同时考虑死亡风险和死亡福利。当允许动态提取时，GMWB年金的估值将导致具有随机最优控制问题，我们在此采用动态规划技术解决。采用与股票基金相关的Hull-White利率模型，我们提出了一种有效的基于树结构的算法。我们对GMWB年金市场价值和最优提取策略的决定因素进行了彻底分析。特别是，我们研究了低/负利率环境的影响。我们的研究结果表明，低/负利率深刻影响最优提取行为，并导致提前年金的重要性不断上升。",
    "tldr": "本文研究了低利率环境下通用GMWB年金的估值，并采用动态规划技术解决了具有随机最优控制问题，分析了最优提取策略和决定因素，并揭示了低/负利率环境对该年金的深刻影响。"
}