{
    "title": "Robust Tests of Model Incompleteness in the Presence of Nuisance Parameters. (arXiv:2208.11281v2 [econ.EM] UPDATED)",
    "abstract": "Economic models may exhibit incompleteness depending on whether or not they admit certain policy-relevant features such as strategic interaction, self-selection, or state dependence. We develop a novel test of model incompleteness and analyze its asymptotic properties. A key observation is that one can identify the least-favorable parametric model that represents the most challenging scenario for detecting local alternatives without knowledge of the selection mechanism. We build a robust test of incompleteness on a score function constructed from such a model. The proposed procedure remains computationally tractable even with nuisance parameters because it suffices to estimate them only under the null hypothesis of model completeness. We illustrate the test by applying it to a market entry model and a triangular model with a set-valued control function.",
    "link": "http://arxiv.org/abs/2208.11281",
    "context": "Title: Robust Tests of Model Incompleteness in the Presence of Nuisance Parameters. (arXiv:2208.11281v2 [econ.EM] UPDATED)\nAbstract: Economic models may exhibit incompleteness depending on whether or not they admit certain policy-relevant features such as strategic interaction, self-selection, or state dependence. We develop a novel test of model incompleteness and analyze its asymptotic properties. A key observation is that one can identify the least-favorable parametric model that represents the most challenging scenario for detecting local alternatives without knowledge of the selection mechanism. We build a robust test of incompleteness on a score function constructed from such a model. The proposed procedure remains computationally tractable even with nuisance parameters because it suffices to estimate them only under the null hypothesis of model completeness. We illustrate the test by applying it to a market entry model and a triangular model with a set-valued control function.",
    "path": "papers/22/08/2208.11281.json",
    "total_tokens": 865,
    "translated_title": "在存在干扰参数的情况下，有关模型不完整性的鲁棒性测试",
    "translated_abstract": "经济模型可能会显示出不完整性，具体取决于它们是否具有某些与政策相关的特征，例如战略互动、自我选择或状态依赖性。我们开发了一种新的模型不完整性测试方法，并分析了其渐近性质。一个关键观察是，可以在不知道选择机制的情况下，确定表示最具挑战性情景以便检测局部替代品的最不利参数模型。我们构建了一个基于这样一个模型的得分函数的不完整性鲁棒性测试。所提出的程序即使在存在干扰参数的情况下仍然可以计算出来，因为它只需要在模型完整性的零假设下进行估计。我们通过将其应用于市场进入模型和具有集值控制函数的三角形模型来说明测试方法。",
    "tldr": "该研究开发了一种鲁棒性测试方法，可以测试经济模型在存在干扰参数时的不完整性，而不需要了解选择机制。这项研究通过构建一个基于最具挑战情景的参数模型的得分函数，提出了一种计算简便的鲁棒性测试方法。",
    "en_tdlr": "This study develops a robust test for model incompleteness in the presence of nuisance parameters. The test can be applied to economic models without knowledge of the selection mechanism. It utilizes a score function constructed from the least-favorable parametric model to provide a computationally tractable approach."
}