{
    "title": "American cultural regions mapped through the lexical analysis of social media. (arXiv:2208.07649v2 [cs.CL] UPDATED)",
    "abstract": "Cultural areas represent a useful concept that cross-fertilizes diverse fields in social sciences. Knowledge of how humans organize and relate their ideas and behavior within a society helps to understand their actions and attitudes towards different issues. However, the selection of common traits that shape a cultural area is somewhat arbitrary. What is needed is a method that can leverage the massive amounts of data coming online, especially through social media, to identify cultural regions without ad-hoc assumptions, biases or prejudices. This work takes a crucial step in this direction by introducing a method to infer cultural regions based on the automatic analysis of large datasets from microblogging posts. The approach presented here is based on the principle that cultural affiliation can be inferred from the topics that people discuss among themselves. Specifically, regional variations in written discourse are measured in American social media. From the frequency distributions",
    "link": "http://arxiv.org/abs/2208.07649",
    "context": "Title: American cultural regions mapped through the lexical analysis of social media. (arXiv:2208.07649v2 [cs.CL] UPDATED)\nAbstract: Cultural areas represent a useful concept that cross-fertilizes diverse fields in social sciences. Knowledge of how humans organize and relate their ideas and behavior within a society helps to understand their actions and attitudes towards different issues. However, the selection of common traits that shape a cultural area is somewhat arbitrary. What is needed is a method that can leverage the massive amounts of data coming online, especially through social media, to identify cultural regions without ad-hoc assumptions, biases or prejudices. This work takes a crucial step in this direction by introducing a method to infer cultural regions based on the automatic analysis of large datasets from microblogging posts. The approach presented here is based on the principle that cultural affiliation can be inferred from the topics that people discuss among themselves. Specifically, regional variations in written discourse are measured in American social media. From the frequency distributions",
    "path": "papers/22/08/2208.07649.json",
    "total_tokens": 1153,
    "translated_title": "通过社交媒体的词汇分析绘制美国文化地域图",
    "translated_abstract": "文化领域代表了一个有用的概念，可以促进社会科学的不同领域的交流。了解人们在社会中如何组织和关联他们的思想和行为，有助于理解他们对不同问题的行动和态度。然而，塑造文化地区的共同特征的选择有些随意。需要的是一种可以利用大量在线数据，特别是通过社交媒体，识别文化地区而没有特定的假设、偏见或成见的方法。本研究通过介绍一种基于自动分析微博数据集的方法来推断文化地区，从而朝着这个方向迈出了重要的一步。本文所提出的方法是基于这样一个原则：文化归属可以通过人们在他们之间讨论的主题来推断出来。具体地，在美国社交媒体上测量了书面话语的地区变化，从标记地点为美国的推文中使用的单词和表达式的频率分布，构建了文化地区轮廓，代表人们共享常见的沟通模式，并可能受到共同文化根源的影响。美国的文化地图显示出几个具有明显身份的地区和其他具有复杂和多方面组成的地区。我们的结果表明，本文提出的方法可以提供一种客观、显著的方法，以识别一个国家内的文化地区。",
    "tldr": "本文利用微博数据集自动分析文化地域，创新地提出了一种不需要假设、偏见或成见来识别文化地区的方法。该方法基于人们在社交媒体上的讨论主题来推断文化归属，揭示了美国多个具有明显身份的地区和其他复杂多面的地区。",
    "en_tdlr": "This paper innovatively proposes a method to identify cultural regions without assumptions, biases or prejudices, by automatically analyzing microblogging datasets. The method is based on inferring cultural affiliation from the topics people discuss among themselves. The resulting cultural map of the United States reveals several areas with clear-cut identities and others with complex and multifaceted composition."
}