{
    "title": "SIAD: Self-supervised Image Anomaly Detection System. (arXiv:2208.04173v2 [cs.CV] UPDATED)",
    "abstract": "Recent trends in AIGC effectively boosted the application of visual inspection. However, most of the available systems work in a human-in-the-loop manner and can not provide long-term support to the online application. To make a step forward, this paper outlines an automatic annotation system called SsaA, working in a self-supervised learning manner, for continuously making the online visual inspection in the manufacturing automation scenarios. Benefit from the self-supervised learning, SsaA is effective to establish a visual inspection application for the whole life-cycle of manufacturing. In the early stage, with only the anomaly-free data, the unsupervised algorithms are adopted to process the pretext task and generate coarse labels for the following data. Then supervised algorithms are trained for the downstream task. With user-friendly web-based interfaces, SsaA is very convenient to integrate and deploy both of the unsupervised and supervised algorithms. So far, the SsaA system h",
    "link": "http://arxiv.org/abs/2208.04173",
    "context": "Title: SIAD: Self-supervised Image Anomaly Detection System. (arXiv:2208.04173v2 [cs.CV] UPDATED)\nAbstract: Recent trends in AIGC effectively boosted the application of visual inspection. However, most of the available systems work in a human-in-the-loop manner and can not provide long-term support to the online application. To make a step forward, this paper outlines an automatic annotation system called SsaA, working in a self-supervised learning manner, for continuously making the online visual inspection in the manufacturing automation scenarios. Benefit from the self-supervised learning, SsaA is effective to establish a visual inspection application for the whole life-cycle of manufacturing. In the early stage, with only the anomaly-free data, the unsupervised algorithms are adopted to process the pretext task and generate coarse labels for the following data. Then supervised algorithms are trained for the downstream task. With user-friendly web-based interfaces, SsaA is very convenient to integrate and deploy both of the unsupervised and supervised algorithms. So far, the SsaA system h",
    "path": "papers/22/08/2208.04173.json",
    "total_tokens": 867,
    "translated_title": "SIAD: 自监督图像异常检测系统",
    "translated_abstract": "最近，人工智能在视觉检测方面的应用极大地提升了。然而，大多数现有系统都是以人为中心的，并且无法为在线应用提供长期支持。为了向前迈一步，本文提出了一种名为SsaA的自监督学习的自动标注系统，用于在制造自动化场景下持续进行在线视觉检测。借助自监督学习，SsaA能够有效地为整个制造生命周期建立视觉检测应用。在早期阶段，仅有无异常数据时，采用无监督算法处理预训练任务，并为后续数据生成粗糙的标签。然后训练有监督算法进行下游任务。借助用户友好的基于Web的接口，SsaA非常便于集成和部署无监督和有监督的算法。到目前为止，SsaA系统已经实现了长期在线的视觉检测应用。",
    "tldr": "本论文提出了一种名为SsaA的自监督学习的自动标注系统，用于在制造自动化场景下持续进行在线视觉检测，并能为整个制造生命周期建立视觉检测应用。",
    "en_tdlr": "This paper proposes a self-supervised learning-based automatic annotation system called SsaA, which enables continuous online visual inspection in manufacturing automation scenarios and establishes a visual inspection application for the entire manufacturing lifecycle."
}