{
    "title": "Enhancing the Robustness via Adversarial Learning and Joint Spatial-Temporal Embeddings in Traffic Forecasting. (arXiv:2208.03063v2 [cs.LG] UPDATED)",
    "abstract": "Traffic forecasting is an essential problem in urban planning and computing. The complex dynamic spatial-temporal dependencies among traffic objects (e.g., sensors and road segments) have been calling for highly flexible models; unfortunately, sophisticated models may suffer from poor robustness especially in capturing the trend of the time series (1st-order derivatives with time), leading to unrealistic forecasts. To address the challenge of balancing dynamics and robustness, we propose TrendGCN, a new scheme that extends the flexibility of GCNs and the distribution-preserving capacity of generative and adversarial loss for handling sequential data with inherent statistical correlations. On the one hand, our model simultaneously incorporates spatial (node-wise) embeddings and temporal (time-wise) embeddings to account for heterogeneous space-and-time convolutions; on the other hand, it uses GAN structure to systematically evaluate statistical consistencies between the real and the pre",
    "link": "http://arxiv.org/abs/2208.03063",
    "context": "Title: Enhancing the Robustness via Adversarial Learning and Joint Spatial-Temporal Embeddings in Traffic Forecasting. (arXiv:2208.03063v2 [cs.LG] UPDATED)\nAbstract: Traffic forecasting is an essential problem in urban planning and computing. The complex dynamic spatial-temporal dependencies among traffic objects (e.g., sensors and road segments) have been calling for highly flexible models; unfortunately, sophisticated models may suffer from poor robustness especially in capturing the trend of the time series (1st-order derivatives with time), leading to unrealistic forecasts. To address the challenge of balancing dynamics and robustness, we propose TrendGCN, a new scheme that extends the flexibility of GCNs and the distribution-preserving capacity of generative and adversarial loss for handling sequential data with inherent statistical correlations. On the one hand, our model simultaneously incorporates spatial (node-wise) embeddings and temporal (time-wise) embeddings to account for heterogeneous space-and-time convolutions; on the other hand, it uses GAN structure to systematically evaluate statistical consistencies between the real and the pre",
    "path": "papers/22/08/2208.03063.json",
    "total_tokens": 906,
    "translated_title": "通过对抗学习和联合时空嵌入增强交通预测的鲁棒性",
    "translated_abstract": "交通预测是城市规划和计算中的一个重要问题。交通对象（例如传感器和道路段）之间存在复杂的动态时空依赖关系，这要求使用高度灵活的模型。然而，复杂模型在捕捉时间序列趋势（一阶导数随时间变化）方面可能表现出较差的鲁棒性，从而导致不现实的预测结果。为解决动态性和鲁棒性的平衡难题，我们提出了TrendGCN，这是一种新的方案，扩展了GCN的灵活性和生成对抗损失的分布保持能力，用于处理具有固有统计相关性的顺序数据。我们的模型同时结合了空间（节点级）嵌入和时间（时间级）嵌入，以考虑异质的时空卷积；同时，它使用GAN结构来系统评估实际数据和预测数据之间的统计一致性。",
    "tldr": "通过对抗学习和联合时空嵌入，我们提出了TrendGCN来增强交通预测的鲁棒性，该模型能够平衡动态性和鲁棒性，并在处理具有统计相关性的顺序数据时表现出较好的效果。",
    "en_tdlr": "We propose TrendGCN, which enhances the robustness of traffic forecasting by incorporating adversarial learning and joint spatial-temporal embeddings. This model efficiently balances dynamics and robustness, leading to improved performance in handling sequential data with statistical correlations."
}