{
    "title": "Investigating Antigram Behaviour using Distributional Semantics. (arXiv:1901.05066v2 [cs.CL] UPDATED)",
    "abstract": "The field of computational linguistics constantly presents new challenges and topics for research. Whether it be analyzing word usage changes over time or identifying relationships between pairs of seemingly unrelated words. To this point, we identify Anagrams and Antigrams as words possessing such unique properties. The presented work is an exploration into generating anagrams from a given word and determining whether there exists antigram (semantically opposite anagrams) relationships between the pairs of generated anagrams using GloVe embeddings. We propose a rudimentary, yet interpretable, rule-based algorithm for detecting antigrams. On a small dataset of just 12 antigrams, our approach yielded an accuracy of 39\\% which shows that there is much work left to be done in this space.",
    "link": "http://arxiv.org/abs/1901.05066",
    "context": "Title: Investigating Antigram Behaviour using Distributional Semantics. (arXiv:1901.05066v2 [cs.CL] UPDATED)\nAbstract: The field of computational linguistics constantly presents new challenges and topics for research. Whether it be analyzing word usage changes over time or identifying relationships between pairs of seemingly unrelated words. To this point, we identify Anagrams and Antigrams as words possessing such unique properties. The presented work is an exploration into generating anagrams from a given word and determining whether there exists antigram (semantically opposite anagrams) relationships between the pairs of generated anagrams using GloVe embeddings. We propose a rudimentary, yet interpretable, rule-based algorithm for detecting antigrams. On a small dataset of just 12 antigrams, our approach yielded an accuracy of 39\\% which shows that there is much work left to be done in this space.",
    "path": "papers/19/01/1901.05066.json",
    "total_tokens": 782,
    "translated_title": "使用分布语义研究反词行为的探究",
    "translated_abstract": "计算语言学领域不断为研究提出新的挑战和主题，无论是分析词语随时间变化的用法还是识别看似不相关的词语之间的关系。在这篇论文中，我们将回文和反词作为具有独特属性的词语进行了研究。我们使用GloVe嵌入来生成给定词语的回文，并确定生成的回文之间是否存在反词（语义上相反的回文）的关系。我们提出了一种基于规则的简单但可解释的算法来检测反词。在仅有12个反词的小数据集上，我们的方法准确率达到了39％，这表明在这个领域还有很多工作要做。",
    "tldr": "本文通过使用分布语义研究探究反词行为，提出了一种基于规则的算法用于检测反词。在小数据集上取得了39%的准确率，展示了该领域仍有待进一步研究。",
    "en_tdlr": "This work investigates antigram behavior by utilizing distributional semantics. It proposes a rule-based algorithm for detecting antigrams and achieves an accuracy of 39% on a small dataset, indicating the need for further research in this field."
}