{
    "title": "Stochastic Gradient MCMC for Nonlinear State Space Models. (arXiv:1901.10568v3 [stat.ML] UPDATED)",
    "abstract": "State space models (SSMs) provide a flexible framework for modeling complex time series via a latent stochastic process. Inference for nonlinear, non-Gaussian SSMs is often tackled with particle methods that do not scale well to long time series. The challenge is two-fold: not only do computations scale linearly with time, as in the linear case, but particle filters additionally suffer from increasing particle degeneracy with longer series. Stochastic gradient MCMC methods have been developed to scale Bayesian inference for finite-state hidden Markov models and linear SSMs using buffered stochastic gradient estimates to account for temporal dependencies. We extend these stochastic gradient estimators to nonlinear SSMs using particle methods. We present error bounds that account for both buffering error and particle error in the case of nonlinear SSMs that are log-concave in the latent process. We evaluate our proposed particle buffered stochastic gradient using stochastic gradient MCMC",
    "link": "http://arxiv.org/abs/1901.10568",
    "context": "Title: Stochastic Gradient MCMC for Nonlinear State Space Models. (arXiv:1901.10568v3 [stat.ML] UPDATED)\nAbstract: State space models (SSMs) provide a flexible framework for modeling complex time series via a latent stochastic process. Inference for nonlinear, non-Gaussian SSMs is often tackled with particle methods that do not scale well to long time series. The challenge is two-fold: not only do computations scale linearly with time, as in the linear case, but particle filters additionally suffer from increasing particle degeneracy with longer series. Stochastic gradient MCMC methods have been developed to scale Bayesian inference for finite-state hidden Markov models and linear SSMs using buffered stochastic gradient estimates to account for temporal dependencies. We extend these stochastic gradient estimators to nonlinear SSMs using particle methods. We present error bounds that account for both buffering error and particle error in the case of nonlinear SSMs that are log-concave in the latent process. We evaluate our proposed particle buffered stochastic gradient using stochastic gradient MCMC",
    "path": "papers/19/01/1901.10568.json",
    "total_tokens": 900,
    "translated_title": "非线性状态空间模型的随机梯度MCMC方法",
    "translated_abstract": "状态空间模型（SSM）通过潜在的随机过程提供了建模复杂时间序列的灵活框架。对于非线性、非高斯的SSM推断通常使用粒子方法，但这些方法在处理长时间序列时不具备良好的可扩展性。挑战有两方面：计算与时间线性扩展，粒子滤波器在长序列中还会出现逐渐退化的问题。已经开发了使用缓冲随机梯度估计量来应对时序依赖性的有限状态隐马尔可夫模型和线性SSM的随机梯度MCMC方法，我们将这些方法扩展到了非线性SSM，并提出了误差界限，考虑了缓冲误差和粒子误差，适用于在潜在过程中具有对数凹性的非线性SSM情况。我们使用随机梯度MCMC方法评估了我们提出的粒子缓冲随机梯度方法。",
    "tldr": "该论文提出了一种针对非线性状态空间模型的随机梯度MCMC方法，通过扩展已有方法，利用粒子缓冲随机梯度估计量解决了长时间序列下计算和粒子退化的问题。",
    "en_tdlr": "This paper proposes a stochastic gradient MCMC method for nonlinear state space models, which addresses the computational and particle degeneracy issues in long time series by extending existing methods and utilizing particle buffered stochastic gradient estimates."
}