{
    "title": "Efficient ECG-based Atrial Fibrillation Detection via Parameterised Hypercomplex Neural Networks. (arXiv:2211.02678v2 [eess.SP] UPDATED)",
    "abstract": "Atrial fibrillation (AF) is the most common cardiac arrhythmia and associated with a high risk for serious conditions like stroke. The use of wearable devices embedded with automatic and timely AF assessment from electrocardiograms (ECGs) has shown to be promising in preventing life-threatening situations. Although deep neural networks have demonstrated superiority in model performance, their use on wearable devices is limited by the trade-off between model performance and complexity. In this work, we propose to use lightweight convolutional neural networks (CNNs) with parameterised hypercomplex (PH) layers for AF detection based on ECGs. The proposed approach trains small-scale CNNs, thus overcoming the limited computing resources on wearable devices. We show comparable performance to corresponding real-valued CNNs on two publicly available ECG datasets using significantly fewer model parameters. PH models are more flexible than other hypercomplex neural networks and can operate on an",
    "link": "http://arxiv.org/abs/2211.02678",
    "total_tokens": 963,
    "translated_title": "基于参数化超复数神经网络的心房颤动检测的高效ECG方法",
    "translated_abstract": "心房颤动（AF）是最常见的心律失常，与中风等严重疾病的高风险相关。嵌入自动和及时的AF评估的可穿戴设备使用心电图（ECG）已被证明在预防危及生命的情况方面具有前景。虽然深度神经网络在模型性能方面表现出优越性，但它们在可穿戴设备上的使用受到模型性能和复杂性之间的权衡的限制。在这项工作中，我们提出使用带有参数化超复数（PH）层的轻量级卷积神经网络（CNN）来基于ECG进行AF检测。所提出的方法训练小规模CNN，从而克服了可穿戴设备上的有限计算资源。我们使用显着较少的模型参数在两个公开可用的ECG数据集上展示了与相应的实值CNN相当的性能。PH模型比其他超复数神经网络更灵活，可以在...",
    "tldr": "本文提出了一种基于参数化超复数神经网络的轻量级卷积神经网络方法，用于心房颤动检测。该方法在可穿戴设备上训练小规模CNN，克服了有限的计算资源。在两个公开可用的ECG数据集上，该方法表现出与实值CNN相当的性能，但使用了显着较少的模型参数。",
    "en_tldr": "This paper proposes a lightweight convolutional neural network method based on parameterized hypercomplex neural networks for atrial fibrillation detection. The method trains small-scale CNNs on wearable devices, overcoming limited computing resources. The approach shows comparable performance to real-valued CNNs on two publicly available ECG datasets using significantly fewer model parameters."
}