{
    "title": "MAgNET: A Graph U-Net Architecture for Mesh-Based Simulations. (arXiv:2211.00713v2 [cs.LG] UPDATED)",
    "abstract": "In many cutting-edge applications, high-fidelity computational models prove too slow to be practical and are thus replaced by much faster surrogate models. Recently, deep learning techniques have become increasingly important in accelerating such predictions. However, they tend to falter when faced with larger and more complex problems. Therefore, this work introduces MAgNET: Multi-channel Aggregation Network, a novel geometric deep learning framework designed to operate on large-dimensional data of arbitrary structure (graph data). MAgNET is built upon the MAg (Multichannel Aggregation) operation, which generalizes the concept of multi-channel local operations in convolutional neural networks to arbitrary non-grid inputs. The MAg layers are interleaved with the proposed novel graph pooling/unpooling operations to form a graph U-Net architecture that is robust and can handle arbitrary complex meshes, efficiently performing supervised learning on large-dimensional graph-structured data.",
    "link": "http://arxiv.org/abs/2211.00713",
    "context": "Title: MAgNET: A Graph U-Net Architecture for Mesh-Based Simulations. (arXiv:2211.00713v2 [cs.LG] UPDATED)\nAbstract: In many cutting-edge applications, high-fidelity computational models prove too slow to be practical and are thus replaced by much faster surrogate models. Recently, deep learning techniques have become increasingly important in accelerating such predictions. However, they tend to falter when faced with larger and more complex problems. Therefore, this work introduces MAgNET: Multi-channel Aggregation Network, a novel geometric deep learning framework designed to operate on large-dimensional data of arbitrary structure (graph data). MAgNET is built upon the MAg (Multichannel Aggregation) operation, which generalizes the concept of multi-channel local operations in convolutional neural networks to arbitrary non-grid inputs. The MAg layers are interleaved with the proposed novel graph pooling/unpooling operations to form a graph U-Net architecture that is robust and can handle arbitrary complex meshes, efficiently performing supervised learning on large-dimensional graph-structured data.",
    "path": "papers/22/11/2211.00713.json",
    "total_tokens": 910,
    "translated_title": "MAgNET: 面向基于网格模拟的图形U-Net架构",
    "translated_abstract": "在许多尖端应用中，高保真计算模型被证明速度太慢而不切实际，因此被更快的代理模型所替代。最近，深度学习技术在加速这种预测方面变得越来越重要。然而，当面对更大更复杂的问题时，它们往往表现不佳。因此，本文介绍了MAgNET：多通道聚合网络，这是一种新颖的几何深度学习框架，旨在处理任意结构（图形数据）的大维数据。MAgNET建立在MAg（多通道聚合）操作之上，它将卷积神经网络中多通道本地操作的概念推广到任意非网格输入。MAg层与所提出的新型图形池化/反池化操作交错，形成了一个图形U-Net架构，具有鲁棒性，可以高效地处理任意复杂的网格，并对大维图形结构数据进行监督学习。",
    "tldr": "MAgNET是一个新颖的几何深度学习框架，基于MAg（多通道聚合）操作，采用图形U-Net架构处理任意结构（图形数据）的大维数据，能够高效地处理任意复杂的网格。",
    "en_tdlr": "MAgNET is a novel geometric deep learning framework based on the MAg (Multichannel Aggregation) operation, using graph U-Net architecture to process large-dimensional data of arbitrary structure (graph data) efficiently, and can handle arbitrary complex meshes."
}