{
    "title": "Estimation of Systemic Shortfall Risk Measure using Stochastic Algorithms",
    "abstract": "arXiv:2211.16159v2 Announce Type: replace-cross  Abstract: Systemic risk measures were introduced to capture the global risk and the corresponding contagion effects that is generated by an interconnected system of financial institutions. To this purpose, two approaches were suggested. In the first one, systemic risk measures can be interpreted as the minimal amount of cash needed to secure a system after aggregating individual risks. In the second approach, systemic risk measures can be interpreted as the minimal amount of cash that secures a system by allocating capital to each single institution before aggregating individual risks. Although the theory behind these risk measures has been well investigated by several authors, the numerical part has been neglected so far. In this paper, we use stochastic algorithms schemes in estimating MSRM and prove that the resulting estimators are consistent and asymptotically normal. We also test numerically the performance of these algorithms on s",
    "link": "https://arxiv.org/abs/2211.16159",
    "context": "Title: Estimation of Systemic Shortfall Risk Measure using Stochastic Algorithms\nAbstract: arXiv:2211.16159v2 Announce Type: replace-cross  Abstract: Systemic risk measures were introduced to capture the global risk and the corresponding contagion effects that is generated by an interconnected system of financial institutions. To this purpose, two approaches were suggested. In the first one, systemic risk measures can be interpreted as the minimal amount of cash needed to secure a system after aggregating individual risks. In the second approach, systemic risk measures can be interpreted as the minimal amount of cash that secures a system by allocating capital to each single institution before aggregating individual risks. Although the theory behind these risk measures has been well investigated by several authors, the numerical part has been neglected so far. In this paper, we use stochastic algorithms schemes in estimating MSRM and prove that the resulting estimators are consistent and asymptotically normal. We also test numerically the performance of these algorithms on s",
    "path": "papers/22/11/2211.16159.json",
    "total_tokens": 792,
    "translated_title": "使用随机算法估计系统性缺口风险度量",
    "translated_abstract": "系统风险度量被引入用来捕捉由金融机构互联系统产生的全球风险及相应的传染效应。为此目的，提出了两种方法。在第一种方法中，系统风险度量可以被解释为在聚合个体风险后，确保系统所需的最小现金金额。在第二种方法中，系统风险度量可以被解释为在将资本分配给每个单一机构后，确保系统所需的最小现金金额，然后再聚合个体风险。尽管这些风险度量背后的理论已经被多位作者深入研究，但迄今为止数字部分被忽视了。本文中，我们使用随机算法方案估计MSRM并证明所得估计量是一致的且渐近正态的。我们还在数字上测试了这些算法的性能。",
    "tldr": "本文使用随机算法方案估计系统性缺口风险度量，并证明该估计值是一致的且渐近正态的。",
    "en_tdlr": "This paper estimates the systemic shortfall risk measure using stochastic algorithms, proving the estimators to be consistent and asymptotically normal."
}