{
    "title": "Evaluating and reducing the distance between synthetic and real speech distributions. (arXiv:2211.16049v2 [eess.AS] UPDATED)",
    "abstract": "While modern Text-to-Speech (TTS) systems can produce natural-sounding speech, they remain unable to reproduce the full diversity found in natural speech data. We consider the distribution of all possible real speech samples that could be generated by these speakers alongside the distribution of all synthetic samples that could be generated for the same set of speakers, using a particular TTS system. We set out to quantify the distance between real and synthetic speech via a range of utterance-level statistics related to properties of the speaker, speech prosody and acoustic environment. Differences in the distribution of these statistics are evaluated using the Wasserstein distance. We reduce these distances by providing ground-truth values at generation time, and quantify the improvements to the overall distribution distance, approximated using an automatic speech recognition system. Our best system achieves a 10\\% reduction in distribution distance.",
    "link": "http://arxiv.org/abs/2211.16049",
    "context": "Title: Evaluating and reducing the distance between synthetic and real speech distributions. (arXiv:2211.16049v2 [eess.AS] UPDATED)\nAbstract: While modern Text-to-Speech (TTS) systems can produce natural-sounding speech, they remain unable to reproduce the full diversity found in natural speech data. We consider the distribution of all possible real speech samples that could be generated by these speakers alongside the distribution of all synthetic samples that could be generated for the same set of speakers, using a particular TTS system. We set out to quantify the distance between real and synthetic speech via a range of utterance-level statistics related to properties of the speaker, speech prosody and acoustic environment. Differences in the distribution of these statistics are evaluated using the Wasserstein distance. We reduce these distances by providing ground-truth values at generation time, and quantify the improvements to the overall distribution distance, approximated using an automatic speech recognition system. Our best system achieves a 10\\% reduction in distribution distance.",
    "path": "papers/22/11/2211.16049.json",
    "total_tokens": 805,
    "translated_title": "评估和缩小合成语音和真实语音分布之间的差距",
    "translated_abstract": "尽管现代TTS系统可以产生自然流畅的语音，但它们仍无法复现自然语音数据中发现的全部多样性。本研究考虑了一组发音者所能产生的所有可能真实语音样本的分布，以及使用特定TTS系统可以生成的所有合成样本的分布。我们通过一系列与发音者属性、语音韵律和声学环境相关的话语水平统计信息来量化真实语音和合成语音之间的距离，并使用Wasserstein距离评估这些统计信息分布的差异。通过在生成时提供基准值，我们缩小了这些距离，并使用自动语音识别系统来量化整体分布距离的改进情况。在我们的最佳系统中，分布距离缩小了10％。",
    "tldr": "本研究通过比较真实语音和合成语音的分布，使用统计学方法量化它们之间的距离，最终实现了10%的距离缩小。",
    "en_tdlr": "This study uses statistical methods to quantify the distance between real and synthetic speech distributions and achieved a 10% reduction in distance by comparing the distributions and providing ground-truth values at generation time."
}