{
    "title": "Active Exploration based on Information Gain by Particle Filter for Efficient Spatial Concept Formation. (arXiv:2211.10934v2 [cs.RO] UPDATED)",
    "abstract": "Autonomous robots need to learn the categories of various places by exploring their environments and interacting with users. However, preparing training datasets with linguistic instructions from users is time-consuming and labor-intensive. Moreover, effective exploration is essential for appropriate concept formation and rapid environmental coverage. To address this issue, we propose an active inference method, referred to as spatial concept formation with information gain-based active exploration (SpCoAE) that combines sequential Bayesian inference using particle filters and information gain-based destination determination in a probabilistic generative model. This study interprets the robot's action as a selection of destinations to ask the user, `What kind of place is this?' in the context of active inference. This study provides insights into the technical aspects of the proposed method, including active perception and exploration by the robot, and how the method can enable mobile ",
    "link": "http://arxiv.org/abs/2211.10934",
    "context": "Title: Active Exploration based on Information Gain by Particle Filter for Efficient Spatial Concept Formation. (arXiv:2211.10934v2 [cs.RO] UPDATED)\nAbstract: Autonomous robots need to learn the categories of various places by exploring their environments and interacting with users. However, preparing training datasets with linguistic instructions from users is time-consuming and labor-intensive. Moreover, effective exploration is essential for appropriate concept formation and rapid environmental coverage. To address this issue, we propose an active inference method, referred to as spatial concept formation with information gain-based active exploration (SpCoAE) that combines sequential Bayesian inference using particle filters and information gain-based destination determination in a probabilistic generative model. This study interprets the robot's action as a selection of destinations to ask the user, `What kind of place is this?' in the context of active inference. This study provides insights into the technical aspects of the proposed method, including active perception and exploration by the robot, and how the method can enable mobile ",
    "path": "papers/22/11/2211.10934.json",
    "total_tokens": 934,
    "translated_title": "基于粒子滤波器的信息增益主导的主动探索用于高效的空间概念形成",
    "translated_abstract": "自主机器人需要通过探索环境并与用户交互来学习各种地方的类别。然而，从用户那里准备语言指导的训练数据集是耗时且劳动密集的。此外，有效的探索对于适当的概念形成和快速环境覆盖至关重要。为了解决这个问题，我们提出了一种主动推理方法，称为基于信息增益的主动探索空间概念形成（SpCoAE），将粒子滤波器的顺序贝叶斯推理和基于信息增益的目标确定与概率生成模型相结合。该研究将机器人的动作解释为在主动推理的环境下选择要问用户“这是什么地方？”的目的地。该研究提供了有关所提出的方法的技术方面，包括机器人的积极感知和探索，以及该方法如何使移动机器人能够高效地形成和学习空间概念。",
    "tldr": "该论文提出了一种基于信息增益主导的主动探索方法，通过粒子滤波器实现顺序贝叶斯推理和目标确定，能够帮助自主机器人在形成和学习空间概念的过程中高效地探索环境和与用户交互。"
}