{
    "title": "On Designing Light-Weight Object Trackers through Network Pruning: Use CNNs or Transformers?. (arXiv:2211.13769v2 [cs.CV] UPDATED)",
    "abstract": "Object trackers deployed on low-power devices need to be light-weight, however, most of the current state-of-the-art (SOTA) methods rely on using compute-heavy backbones built using CNNs or transformers. Large sizes of such models do not allow their deployment in low-power conditions and designing compressed variants of large tracking models is of great importance. This paper demonstrates how highly compressed light-weight object trackers can be designed using neural architectural pruning of large CNN and transformer based trackers. Further, a comparative study on architectural choices best suited to design light-weight trackers is provided. A comparison between SOTA trackers using CNNs, transformers as well as the combination of the two is presented to study their stability at various compression ratios. Finally results for extreme pruning scenarios going as low as 1% in some cases are shown to study the limits of network pruning in object tracking. This work provides deeper insights ",
    "link": "http://arxiv.org/abs/2211.13769",
    "context": "Title: On Designing Light-Weight Object Trackers through Network Pruning: Use CNNs or Transformers?. (arXiv:2211.13769v2 [cs.CV] UPDATED)\nAbstract: Object trackers deployed on low-power devices need to be light-weight, however, most of the current state-of-the-art (SOTA) methods rely on using compute-heavy backbones built using CNNs or transformers. Large sizes of such models do not allow their deployment in low-power conditions and designing compressed variants of large tracking models is of great importance. This paper demonstrates how highly compressed light-weight object trackers can be designed using neural architectural pruning of large CNN and transformer based trackers. Further, a comparative study on architectural choices best suited to design light-weight trackers is provided. A comparison between SOTA trackers using CNNs, transformers as well as the combination of the two is presented to study their stability at various compression ratios. Finally results for extreme pruning scenarios going as low as 1% in some cases are shown to study the limits of network pruning in object tracking. This work provides deeper insights ",
    "path": "papers/22/11/2211.13769.json",
    "total_tokens": 1005,
    "translated_title": "通过网络剪枝设计轻量级物体跟踪器：使用CNN还是Transformers?",
    "translated_abstract": "低功耗设备上部署的物体跟踪器需要轻量级设计，然而，大多数现有最先进的方法依赖于使用构建于CNN或transformers上的计算密集的主干网络。这些模型的巨大尺寸不允许在低功耗条件下部署它们，因此设计压缩版的大型跟踪模型具有重要意义。本文演示了如何通过神经结构剪枝设计高度压缩的轻量级物体跟踪器，同时提供了一个比较研究，以确定最适合设计轻量级跟踪器的架构选择。还提供了使用CNNs、transformers以及两者组合的最新跟踪器之间的比较，以研究它们在各种压缩比下的稳定性。最后，展示了极端剪枝场景下的结果，有些情况下剪枝比率低至1%，以研究网络剪枝在物体跟踪中的限制。本文提供了更深入的洞察力。",
    "tldr": "本文介绍了如何通过神经网络结构剪枝技术设计压缩版的高度压缩轻量级物体跟踪器。通过对CNN和Transformers跟踪器的比较研究，揭示出在设计轻量级跟踪器时的最佳架构选择。最后，提供了极端剪枝率的跟踪结果，可能有助于更好地了解网络剪枝在物体跟踪中的限制。",
    "en_tdlr": "This paper demonstrates the design of highly compressed light-weight object trackers using neural architectural pruning of large CNN and transformer-based trackers. It provides a comparative study on architectural choices best suited to design light-weight trackers and showcases the limits of network pruning in object tracking."
}