{
    "title": "Predicting adverse outcomes following catheter ablation treatment for atrial fibrillation. (arXiv:2211.11965v2 [cs.LG] UPDATED)",
    "abstract": "Objective: To develop prognostic survival models for predicting adverse outcomes after catheter ablation treatment for non-valvular atrial fibrillation (AF).  Methods: We used a linked dataset including hospital administrative data, prescription medicine claims, emergency department presentations, and death registrations of patients in New South Wales, Australia. The cohort included patients who received catheter ablation for AF. Traditional and deep survival models were trained to predict major bleeding events and a composite of heart failure, stroke, cardiac arrest, and death.  Results: Out of a total of 3285 patients in the cohort, 177 (5.3%) experienced the composite outcome (heart failure, stroke, cardiac arrest, death) and 167 (5.1%) experienced major bleeding events after catheter ablation treatment. Models predicting the composite outcome had high risk discrimination accuracy, with the best model having a concordance index > 0.79 at the evaluated time horizons. Models for predi",
    "link": "http://arxiv.org/abs/2211.11965",
    "context": "Title: Predicting adverse outcomes following catheter ablation treatment for atrial fibrillation. (arXiv:2211.11965v2 [cs.LG] UPDATED)\nAbstract: Objective: To develop prognostic survival models for predicting adverse outcomes after catheter ablation treatment for non-valvular atrial fibrillation (AF).  Methods: We used a linked dataset including hospital administrative data, prescription medicine claims, emergency department presentations, and death registrations of patients in New South Wales, Australia. The cohort included patients who received catheter ablation for AF. Traditional and deep survival models were trained to predict major bleeding events and a composite of heart failure, stroke, cardiac arrest, and death.  Results: Out of a total of 3285 patients in the cohort, 177 (5.3%) experienced the composite outcome (heart failure, stroke, cardiac arrest, death) and 167 (5.1%) experienced major bleeding events after catheter ablation treatment. Models predicting the composite outcome had high risk discrimination accuracy, with the best model having a concordance index > 0.79 at the evaluated time horizons. Models for predi",
    "path": "papers/22/11/2211.11965.json",
    "total_tokens": 1178,
    "translated_title": "预测心房颤动电子消融治疗后的不良结局。",
    "translated_abstract": "目的：为预测非瓣膜性心房颤动（AF）电子消融治疗后不良结果，开发预后生存模型。方法：我们使用联合数据集，包括澳大利亚新南威尔士州患者的医院行政数据、处方药物索赔、急诊科呈现和死亡登记。该队列包括接受心房颤动电子消融治疗的患者。传统和深度生存模型用于预测主要出血事件和心力衰竭、中风、心脏骤停和死亡的组合结果。结果：在3285名队列中，177名（5.3％）经历了心力衰竭、中风、心脏骤停和死亡的复合结果，167名（5.1％）在接受心房颤动电子消融治疗后出现了重大出血事件。预测组合结果的模型具有高风险辨别准确性，最佳模型在所评估的时间范围内具有一致性指数> 0.79。预测重大出血事件的模型精度较低，但仍优于朴素模型。深度学习模型在两种结果的预测中表现优于传统模型。结论：我们开发了预后模型，用于预测心房颤动电子消融治疗后的不良结果，在预测组合结果方面具有高准确性，在预测重大出血事件方面具有合理准确性。",
    "tldr": "该研究开发了预后生存模型，用于预测患者在接受心房颤动电子消融治疗后可能出现的不良结果。最佳模型具有高准确性，深度学习模型的表现优于传统模型。",
    "en_tdlr": "This study developed prognostic survival models to predict adverse outcomes after catheter ablation treatment for non-valvular atrial fibrillation. The best model showed high accuracy in predicting the composite outcome, and the deep learning model outperformed traditional models."
}