{
    "title": "Prosody-controllable spontaneous TTS with neural HMMs. (arXiv:2211.13533v2 [eess.AS] UPDATED)",
    "abstract": "Spontaneous speech has many affective and pragmatic functions that are interesting and challenging to model in TTS. However, the presence of reduced articulation, fillers, repetitions, and other disfluencies in spontaneous speech make the text and acoustics less aligned than in read speech, which is problematic for attention-based TTS. We propose a TTS architecture that can rapidly learn to speak from small and irregular datasets, while also reproducing the diversity of expressive phenomena present in spontaneous speech. Specifically, we add utterance-level prosody control to an existing neural HMM-based TTS system which is capable of stable, monotonic alignments for spontaneous speech. We objectively evaluate control accuracy and perform perceptual tests that demonstrate that prosody control does not degrade synthesis quality. To exemplify the power of combining prosody control and ecologically valid data for reproducing intricate spontaneous speech phenomena, we evaluate the system's",
    "link": "http://arxiv.org/abs/2211.13533",
    "context": "Title: Prosody-controllable spontaneous TTS with neural HMMs. (arXiv:2211.13533v2 [eess.AS] UPDATED)\nAbstract: Spontaneous speech has many affective and pragmatic functions that are interesting and challenging to model in TTS. However, the presence of reduced articulation, fillers, repetitions, and other disfluencies in spontaneous speech make the text and acoustics less aligned than in read speech, which is problematic for attention-based TTS. We propose a TTS architecture that can rapidly learn to speak from small and irregular datasets, while also reproducing the diversity of expressive phenomena present in spontaneous speech. Specifically, we add utterance-level prosody control to an existing neural HMM-based TTS system which is capable of stable, monotonic alignments for spontaneous speech. We objectively evaluate control accuracy and perform perceptual tests that demonstrate that prosody control does not degrade synthesis quality. To exemplify the power of combining prosody control and ecologically valid data for reproducing intricate spontaneous speech phenomena, we evaluate the system's",
    "path": "papers/22/11/2211.13533.json",
    "total_tokens": 793,
    "translated_title": "带有神经HMM的语调可控的自然语音合成技术",
    "translated_abstract": "自然语音合成技术中，控制表现情感和语用功能的流畅语音是很有挑战性的。本文提出了一种能够从少量不规则数据中快速学习并同时重现自然语音中表现多样性的TTS架构。具体来说，我们在一个已有的基于神经HMM的TTS系统中添加了话语级的语调控制，这个系统能够稳定、单调地保持和自然语音的对齐状态。我们对控制准确性进行了客观的评估，并进行了感知测试来证明语调控制不会降低合成质量。",
    "tldr": "本文提出一种神经HMM TTS系统，在保持和自然语音对齐状态的前提下，实现了话语级语调控制，使得从少量不规则数据中快速学习变得可能，能够重现自然语音中的多样性表现。",
    "en_tdlr": "This paper proposes a neural HMM-based TTS system with utterance-level prosody control, which can rapidly learn from small and irregular datasets while reproducing the diversity of expressive phenomena present in spontaneous speech, without degrading synthesis quality."
}