{
    "title": "Automating Systematic Literature Reviews with Natural Language Processing and Text Mining: a Systematic Literature Review. (arXiv:2211.15397v2 [cs.IR] UPDATED)",
    "abstract": "Objectives: An SLR is presented focusing on text mining based automation of SLR creation. The present review identifies the objectives of the automation studies and the aspects of those steps that were automated. In so doing, the various ML techniques used, challenges, limitations and scope of further research are explained.  Methods: Accessible published literature studies that primarily focus on automation of study selection, study quality assessment, data extraction and data synthesis portions of SLR. Twenty-nine studies were analyzed.  Results: This review identifies the objectives of the automation studies, steps within the study selection, study quality assessment, data extraction and data synthesis portions that were automated, the various ML techniques used, challenges, limitations and scope of further research.  Discussion: We describe uses of NLP/TM techniques to support increased automation of systematic literature reviews. This area has attracted increase attention in the l",
    "link": "http://arxiv.org/abs/2211.15397",
    "context": "Title: Automating Systematic Literature Reviews with Natural Language Processing and Text Mining: a Systematic Literature Review. (arXiv:2211.15397v2 [cs.IR] UPDATED)\nAbstract: Objectives: An SLR is presented focusing on text mining based automation of SLR creation. The present review identifies the objectives of the automation studies and the aspects of those steps that were automated. In so doing, the various ML techniques used, challenges, limitations and scope of further research are explained.  Methods: Accessible published literature studies that primarily focus on automation of study selection, study quality assessment, data extraction and data synthesis portions of SLR. Twenty-nine studies were analyzed.  Results: This review identifies the objectives of the automation studies, steps within the study selection, study quality assessment, data extraction and data synthesis portions that were automated, the various ML techniques used, challenges, limitations and scope of further research.  Discussion: We describe uses of NLP/TM techniques to support increased automation of systematic literature reviews. This area has attracted increase attention in the l",
    "path": "papers/22/11/2211.15397.json",
    "total_tokens": 744,
    "translated_title": "使用自然语言处理和文本挖掘自动化系统性文献综述：一项系统性文献综述",
    "translated_abstract": "本文介绍了一项针对基于文本挖掘的系统性文献综述（SLR）自动化的SLR。该综述识别了自动化研究的目标和自动化的各个步骤。此外，还介绍了使用的各种机器学习技术、挑战、限制和进一步研究的范围。",
    "tldr": "本文调查了基于文本挖掘的系统性文献综述自动化的研究。研究中识别了自动化研究的目标和自动化步骤。另外，还介绍了使用的机器学习技术和存在的挑战及未来研究的范围。",
    "en_tdlr": "This paper investigates the automation of systematic literature reviews using text mining. The objectives and steps of automation studies were identified, along with the various machine learning techniques used and the challenges and scope for further research."
}