{
    "title": "SUPRA: Superpixel Guided Loss for Improved Multi-modal Segmentation in Endoscopy. (arXiv:2211.04658v3 [cs.CV] UPDATED)",
    "abstract": "Domain shift is a well-known problem in the medical imaging community. In particular, for endoscopic image analysis where the data can have different modalities the performance of deep learning (DL) methods gets adversely affected. In other words, methods developed on one modality cannot be used for a different modality. However, in real clinical settings, endoscopists switch between modalities for better mucosal visualisation. In this paper, we explore the domain generalisation technique to enable DL methods to be used in such scenarios. To this extend, we propose to use super pixels generated with Simple Linear Iterative Clustering (SLIC) which we refer to as \"SUPRA\" for SUPeRpixel Augmented method. SUPRA first generates a preliminary segmentation mask making use of our new loss \"SLICLoss\" that encourages both an accurate and color-consistent segmentation. We demonstrate that SLICLoss when combined with Binary Cross Entropy loss (BCE) can improve the model's generalisability with dat",
    "link": "http://arxiv.org/abs/2211.04658",
    "context": "Title: SUPRA: Superpixel Guided Loss for Improved Multi-modal Segmentation in Endoscopy. (arXiv:2211.04658v3 [cs.CV] UPDATED)\nAbstract: Domain shift is a well-known problem in the medical imaging community. In particular, for endoscopic image analysis where the data can have different modalities the performance of deep learning (DL) methods gets adversely affected. In other words, methods developed on one modality cannot be used for a different modality. However, in real clinical settings, endoscopists switch between modalities for better mucosal visualisation. In this paper, we explore the domain generalisation technique to enable DL methods to be used in such scenarios. To this extend, we propose to use super pixels generated with Simple Linear Iterative Clustering (SLIC) which we refer to as \"SUPRA\" for SUPeRpixel Augmented method. SUPRA first generates a preliminary segmentation mask making use of our new loss \"SLICLoss\" that encourages both an accurate and color-consistent segmentation. We demonstrate that SLICLoss when combined with Binary Cross Entropy loss (BCE) can improve the model's generalisability with dat",
    "path": "papers/22/11/2211.04658.json",
    "total_tokens": 902,
    "translated_title": "SUPRA:超像素引导损失用于改进内窥镜多模态分割",
    "translated_abstract": "领域转移是医学影像领域的一个众所周知的问题。特别是对于内窥镜图像分析，其中数据可以具有不同的模态，深度学习（DL）方法的性能受到不利影响。在真实的临床环境中，内镜医生会在模态之间切换以获得更好的黏膜可视化效果。在本文中，我们探索领域概括技术，使DL方法可以在这种情况下使用。因此，我们提出使用Simple Linear Iterative Clustering (SLIC) 产生的超像素，称为 \"SUPRA\"，用于超像素增强方法。SUPRA首先生成预定分割掩模，利用我们的新损失\"SLICLoss\"鼓励准确和颜色一致的分割。我们证明了当将SLICLoss与二元交叉熵损失（BCE）相结合时，可以提高模型的概括能力。",
    "tldr": "本文提出了一种名为SUPRA的超像素增强方法，通过使用SLICLoss与二元交叉熵损失的结合，提高了深度学习模型在内窥镜图像分析中的领域泛化能力。",
    "en_tdlr": "This paper proposes a novel superpixel augmented method named SUPRA to improve the domain generalisation ability of deep learning models for endoscopic image analysis, by utilizing SLICLoss and binary cross entropy loss combination."
}