{
    "title": "LMD: A Learnable Mask Network to Detect Adversarial Examples for Speaker Verification. (arXiv:2211.00825v2 [eess.AS] UPDATED)",
    "abstract": "Although the security of automatic speaker verification (ASV) is seriously threatened by recently emerged adversarial attacks, there have been some countermeasures to alleviate the threat. However, many defense approaches not only require the prior knowledge of the attackers but also possess weak interpretability. To address this issue, in this paper, we propose an attacker-independent and interpretable method, named learnable mask detector (LMD), to separate adversarial examples from the genuine ones. It utilizes score variation as an indicator to detect adversarial examples, where the score variation is the absolute discrepancy between the ASV scores of an original audio recording and its transformed audio synthesized from its masked complex spectrogram. A core component of the score variation detector is to generate the masked spectrogram by a neural network. The neural network needs only genuine examples for training, which makes it an attacker-independent approach. Its interpretab",
    "link": "http://arxiv.org/abs/2211.00825",
    "context": "Title: LMD: A Learnable Mask Network to Detect Adversarial Examples for Speaker Verification. (arXiv:2211.00825v2 [eess.AS] UPDATED)\nAbstract: Although the security of automatic speaker verification (ASV) is seriously threatened by recently emerged adversarial attacks, there have been some countermeasures to alleviate the threat. However, many defense approaches not only require the prior knowledge of the attackers but also possess weak interpretability. To address this issue, in this paper, we propose an attacker-independent and interpretable method, named learnable mask detector (LMD), to separate adversarial examples from the genuine ones. It utilizes score variation as an indicator to detect adversarial examples, where the score variation is the absolute discrepancy between the ASV scores of an original audio recording and its transformed audio synthesized from its masked complex spectrogram. A core component of the score variation detector is to generate the masked spectrogram by a neural network. The neural network needs only genuine examples for training, which makes it an attacker-independent approach. Its interpretab",
    "path": "papers/22/11/2211.00825.json",
    "total_tokens": 904,
    "translated_title": "LMD：一种可学习的掩蔽网络，用于检测语音验证中的对抗性样本",
    "translated_abstract": "虽然自动语音验证（ASV）的安全性受到最近出现的对抗性攻击的严重威胁，但已经有一些对策来缓解这种威胁。然而，许多防御方法不仅需要攻击者的先前知识，还有弱的可解释性。为了解决这个问题，本文提出了一种攻击者独立和可解释的方法，称为可以学习的掩蔽检测器（LMD），以区分对抗性样本和真正的样本。它利用分数变化作为指标来检测对抗性样本，其中分数变化是原始音频记录及其从掩蔽复杂谱图合成的转换音频的ASV分数之间的绝对差异。分数变化检测的核心组成部分是通过神经网络生成掩蔽谱图。神经网络只需要真实的样本进行训练，这使其成为一种攻击者独立的方法。",
    "tldr": "LMD是一种攻击者独立和可解释的方法，用于检测语音验证中的对抗性样本，其核心是通过神经网络生成掩蔽谱图，利用ASV分数的绝对差异来检测对抗性样本。",
    "en_tdlr": "LMD is an attacker-independent and interpretable method for detecting adversarial examples in speaker verification, which generates masked spectrogram by neural network and utilizes the absolute discrepancy of ASV scores to detect adversarial examples."
}