{
    "title": "Background-Mixed Augmentation for Weakly Supervised Change Detection. (arXiv:2211.11478v3 [cs.CV] UPDATED)",
    "abstract": "Change detection (CD) is to decouple object changes (i.e., object missing or appearing) from background changes (i.e., environment variations) like light and season variations in two images captured in the same scene over a long time span, presenting critical applications in disaster management, urban development, etc. In particular, the endless patterns of background changes require detectors to have a high generalization against unseen environment variations, making this task significantly challenging. Recent deep learning-based methods develop novel network architectures or optimization strategies with paired-training examples, which do not handle the generalization issue explicitly and require huge manual pixel-level annotation efforts. In this work, for the first attempt in the CD community, we study the generalization issue of CD from the perspective of data augmentation and develop a novel weakly supervised training algorithm that only needs image-level labels. Different from ge",
    "link": "http://arxiv.org/abs/2211.11478",
    "context": "Title: Background-Mixed Augmentation for Weakly Supervised Change Detection. (arXiv:2211.11478v3 [cs.CV] UPDATED)\nAbstract: Change detection (CD) is to decouple object changes (i.e., object missing or appearing) from background changes (i.e., environment variations) like light and season variations in two images captured in the same scene over a long time span, presenting critical applications in disaster management, urban development, etc. In particular, the endless patterns of background changes require detectors to have a high generalization against unseen environment variations, making this task significantly challenging. Recent deep learning-based methods develop novel network architectures or optimization strategies with paired-training examples, which do not handle the generalization issue explicitly and require huge manual pixel-level annotation efforts. In this work, for the first attempt in the CD community, we study the generalization issue of CD from the perspective of data augmentation and develop a novel weakly supervised training algorithm that only needs image-level labels. Different from ge",
    "path": "papers/22/11/2211.11478.json",
    "total_tokens": 660,
    "translated_title": "背景混合增强用于弱监督变化检测",
    "translated_abstract": "变化检测是从两个在同一场景中拍摄的图像中分离出物体变化（如物体的缺失或出现）与背景变化（如光线和季节变化）的过程，在灾难管理、城市发展等方面具有重要应用。本文从数据增强的角度研究了变化检测的泛化问题，并开发了一种新的弱监督训练算法，只需要图像级别标签。",
    "tldr": "本文通过背景混合增强和弱监督算法，成功地解决了变化检测的泛化问题。",
    "en_tdlr": "This paper successfully addresses the generalization issue in change detection through background-mixed augmentation and weakly supervised training algorithm."
}