{
    "title": "Cracking Double-Blind Review: Authorship Attribution with Deep Learning. (arXiv:2211.07467v3 [cs.CL] UPDATED)",
    "abstract": "Double-blind peer review is considered a pillar of academic research because it is perceived to ensure a fair, unbiased, and fact-centered scientific discussion. Yet, experienced researchers can often correctly guess from which research group an anonymous submission originates, biasing the peer-review process. In this work, we present a transformer-based, neural-network architecture that only uses the text content and the author names in the bibliography to attribute an anonymous manuscript to an author. To train and evaluate our method, we created the largest authorship identification dataset to date. It leverages all research papers publicly available on arXiv amounting to over 2 million manuscripts. In arXiv-subsets with up to 2,000 different authors, our method achieves an unprecedented authorship attribution accuracy, where up to 73% of papers are attributed correctly. We present a scaling analysis to highlight the applicability of the proposed method to even larger datasets when ",
    "link": "http://arxiv.org/abs/2211.07467",
    "context": "Title: Cracking Double-Blind Review: Authorship Attribution with Deep Learning. (arXiv:2211.07467v3 [cs.CL] UPDATED)\nAbstract: Double-blind peer review is considered a pillar of academic research because it is perceived to ensure a fair, unbiased, and fact-centered scientific discussion. Yet, experienced researchers can often correctly guess from which research group an anonymous submission originates, biasing the peer-review process. In this work, we present a transformer-based, neural-network architecture that only uses the text content and the author names in the bibliography to attribute an anonymous manuscript to an author. To train and evaluate our method, we created the largest authorship identification dataset to date. It leverages all research papers publicly available on arXiv amounting to over 2 million manuscripts. In arXiv-subsets with up to 2,000 different authors, our method achieves an unprecedented authorship attribution accuracy, where up to 73% of papers are attributed correctly. We present a scaling analysis to highlight the applicability of the proposed method to even larger datasets when ",
    "path": "papers/22/11/2211.07467.json",
    "total_tokens": 927,
    "translated_title": "突破双盲评审: 基于深度学习的作者归属度量",
    "translated_abstract": "双盲同行评审被认为是学术研究的基石，因为它被认为可以确保一个公正、无偏和以事实为中心的科学讨论。然而，有经验的研究人员通常能准确猜测出匿名投稿的研究组来自何方，从而使同行评审过程产生偏见。在这项工作中，我们提出了一种基于Transformer的神经网络架构，它仅使用文本内容和参考文献中的作者姓名来将匿名手稿归属给一个作者。为了训练和评估我们的方法，我们创建了迄今为止最大的作者身份识别数据集。它利用了全部公开的arXiv研究论文，总计超过200万篇手稿。在包含多达2000个不同作者的arXiv子集中，我们的方法实现了前所未有的作者归属准确性，其中多达73%的论文被正确归属。我们进行了一个扩展性分析，以突出该方法在更大数据集中的适用性。",
    "tldr": "该论文提出了一种基于深度学习的作者归属度量方法，通过利用文本内容和参考文献中的作者姓名，可以将匿名手稿正确归属给作者。该方法在迄今为止最大的作者身份识别数据集上进行了训练和评估，在包含多达2000个不同作者的arXiv子集中，取得了前所未有的作者归属准确性。"
}