{
    "title": "Birth-death dynamics for sampling: Global convergence, approximations and their asymptotics. (arXiv:2211.00450v2 [math.AP] UPDATED)",
    "abstract": "Motivated by the challenge of sampling Gibbs measures with nonconvex potentials, we study a continuum birth-death dynamics. We improve results in previous works [51,57] and provide weaker hypotheses under which the probability density of the birth-death governed by Kullback-Leibler divergence or by $\\chi^2$ divergence converge exponentially fast to the Gibbs equilibrium measure, with a universal rate that is independent of the potential barrier. To build a practical numerical sampler based on the pure birth-death dynamics, we consider an interacting particle system, which is inspired by the gradient flow structure and the classical Fokker-Planck equation and relies on kernel-based approximations of the measure. Using the technique of $\\Gamma$-convergence of gradient flows, we show that on the torus, smooth and bounded positive solutions of the kernelized dynamics converge on finite time intervals, to the pure birth-death dynamics as the kernel bandwidth shrinks to zero. Moreover we pro",
    "link": "http://arxiv.org/abs/2211.00450",
    "context": "Title: Birth-death dynamics for sampling: Global convergence, approximations and their asymptotics. (arXiv:2211.00450v2 [math.AP] UPDATED)\nAbstract: Motivated by the challenge of sampling Gibbs measures with nonconvex potentials, we study a continuum birth-death dynamics. We improve results in previous works [51,57] and provide weaker hypotheses under which the probability density of the birth-death governed by Kullback-Leibler divergence or by $\\chi^2$ divergence converge exponentially fast to the Gibbs equilibrium measure, with a universal rate that is independent of the potential barrier. To build a practical numerical sampler based on the pure birth-death dynamics, we consider an interacting particle system, which is inspired by the gradient flow structure and the classical Fokker-Planck equation and relies on kernel-based approximations of the measure. Using the technique of $\\Gamma$-convergence of gradient flows, we show that on the torus, smooth and bounded positive solutions of the kernelized dynamics converge on finite time intervals, to the pure birth-death dynamics as the kernel bandwidth shrinks to zero. Moreover we pro",
    "path": "papers/22/11/2211.00450.json",
    "total_tokens": 1052,
    "translated_title": "采样的出生死亡动态：全局收敛，逼近及其渐近性质研究",
    "translated_abstract": "本文以采样非凸位势吉布斯测度为挑战，研究了一种连续出生死亡动态。我们提出了一种弱假设，改进了先前[51,57]的结果，证明了由Kullback-Leibler散度或$\\chi^2$散度控制的出生死亡概率密度会指数级快速地收敛到吉布斯平衡测度，其普适速率独立于势垒。为了构建基于纯出生死亡动态的实用数值采样器，我们考虑了一个交互粒子系统，它灵感来自于梯度流结构和经典的Fokker-Planck方程，并依赖于测量的基于核的逼近。通过梯度流的$\\Gamma$-收敛技术，证明在环上，核化动态的光滑有界正解在有限时间间隔内，当核带宽收缩到零时，收敛于纯出生死亡动态。此外，我们使用了伽马收敛的技术对纯出生死亡过程的逼近品质进行了定量评估。",
    "tldr": "本文研究了一种连续的出生死亡动态，并提出了弱假设。通过这种动态控制的概率密度指数级地快速收敛到吉布斯平衡测度，同时提出了一种实用的基于纯出生死亡动态的数值采样器，并对其逼近品质进行了定量评估。",
    "en_tdlr": "This paper investigates a continuous birth-death dynamics and proposes weaker hypotheses. The probability density controlled by this dynamic converges exponentially fast to the Gibbs equilibrium measure, which is proved by Kullback-Leibler divergence or $\\chi^2$ divergence. A practical numerical sampler based on the pure birth-death dynamics is also proposed, and its approximation quality is quantitatively evaluated using the technique of $\\Gamma$-convergence of gradient flows."
}