{
    "title": "Social media mining for toxicovigilance of prescription medications: End-to-end pipeline, challenges and future work. (arXiv:2211.10443v2 [cs.CL] UPDATED)",
    "abstract": "Substance use, substance use disorder, and overdoses related to substance use are major public health problems globally and in the United States. A key aspect of addressing these problems from a public health standpoint is improved surveillance. Traditional surveillance systems are laggy, and social media are potentially useful sources of timely data. However, mining knowledge from social media is challenging, and requires the development of advanced artificial intelligence, specifically natural language processing (NLP) and machine learning methods. We developed a sophisticated end-to-end pipeline for mining information about nonmedical prescription medication use from social media, namely Twitter and Reddit. Our pipeline employs supervised machine learning and NLP for filtering out noise and characterizing the chatter. In this paper, we describe our end-to-end pipeline developed over four years. In addition to describing our data mining infrastructure, we discuss existing challenges ",
    "link": "http://arxiv.org/abs/2211.10443",
    "context": "Title: Social media mining for toxicovigilance of prescription medications: End-to-end pipeline, challenges and future work. (arXiv:2211.10443v2 [cs.CL] UPDATED)\nAbstract: Substance use, substance use disorder, and overdoses related to substance use are major public health problems globally and in the United States. A key aspect of addressing these problems from a public health standpoint is improved surveillance. Traditional surveillance systems are laggy, and social media are potentially useful sources of timely data. However, mining knowledge from social media is challenging, and requires the development of advanced artificial intelligence, specifically natural language processing (NLP) and machine learning methods. We developed a sophisticated end-to-end pipeline for mining information about nonmedical prescription medication use from social media, namely Twitter and Reddit. Our pipeline employs supervised machine learning and NLP for filtering out noise and characterizing the chatter. In this paper, we describe our end-to-end pipeline developed over four years. In addition to describing our data mining infrastructure, we discuss existing challenges ",
    "path": "papers/22/11/2211.10443.json",
    "total_tokens": 858,
    "translated_title": "社交媒体挖掘处方药物的毒性监测: 从头到尾的管道，挑战和未来工作。",
    "translated_abstract": "物质使用、物质使用障碍和与物质使用相关的过量是全球和美国的主要公共卫生问题。从公共卫生的角度来解决这些问题的一个关键方面是改进监测系统。传统的监测系统滞后，而社交媒体是及时数据的潜在有用来源。然而，从社交媒体中挖掘知识是具有挑战性的，并且需要开发先进的人工智能，特别是自然语言处理（NLP）和机器学习方法。我们开发了一个复杂的从社交媒体中挖掘非医学处方药物使用信息的端到端管道，即Twitter和Reddit。我们的管道采用了监督式机器学习和NLP来过滤噪音和描述交流内容。在本文中，我们描述了我们在四年内开发的端到端管道。除了描述我们的数据挖掘基础设施外，我们还讨论了现有的挑战。",
    "tldr": "本文描述了一个为社交媒体挖掘非医学处方药物使用信息而开发的端到端管道，并讨论了挑战和未来工作。"
}