{
    "title": "Grammatical Error Correction: A Survey of the State of the Art. (arXiv:2211.05166v3 [cs.CL] UPDATED)",
    "abstract": "Grammatical Error Correction (GEC) is the task of automatically detecting and correcting errors in text. The task not only includes the correction of grammatical errors, such as missing prepositions and mismatched subject-verb agreement, but also orthographic and semantic errors, such as misspellings and word choice errors respectively. The field has seen significant progress in the last decade, motivated in part by a series of five shared tasks, which drove the development of rule-based methods, statistical classifiers, statistical machine translation, and finally neural machine translation systems which represent the current dominant state of the art. In this survey paper, we condense the field into a single article and first outline some of the linguistic challenges of the task, introduce the most popular datasets that are available to researchers (for both English and other languages), and summarise the various methods and techniques that have been developed with a particular focus",
    "link": "http://arxiv.org/abs/2211.05166",
    "context": "Title: Grammatical Error Correction: A Survey of the State of the Art. (arXiv:2211.05166v3 [cs.CL] UPDATED)\nAbstract: Grammatical Error Correction (GEC) is the task of automatically detecting and correcting errors in text. The task not only includes the correction of grammatical errors, such as missing prepositions and mismatched subject-verb agreement, but also orthographic and semantic errors, such as misspellings and word choice errors respectively. The field has seen significant progress in the last decade, motivated in part by a series of five shared tasks, which drove the development of rule-based methods, statistical classifiers, statistical machine translation, and finally neural machine translation systems which represent the current dominant state of the art. In this survey paper, we condense the field into a single article and first outline some of the linguistic challenges of the task, introduce the most popular datasets that are available to researchers (for both English and other languages), and summarise the various methods and techniques that have been developed with a particular focus",
    "path": "papers/22/11/2211.05166.json",
    "total_tokens": 1031,
    "tldr": "本文调查了语法错误纠正任务的现状，包括该任务的语言学挑战、最受欢迎的数据集以及各种方法和技术，特别关注最新的神经机器翻译方法。"
}