{
    "title": "Thermodynamics of bidirectional associative memories. (arXiv:2211.09694v2 [cond-mat.dis-nn] UPDATED)",
    "abstract": "In this paper we investigate the equilibrium properties of bidirectional associative memories (BAMs). Introduced by Kosko in 1988 as a generalization of the Hopfield model to a bipartite structure, the simplest architecture is defined by two layers of neurons, with synaptic connections only between units of different layers: even without internal connections within each layer, information storage and retrieval are still possible through the reverberation of neural activities passing from one layer to another. We characterize the computational capabilities of a stochastic extension of this model in the thermodynamic limit, by applying rigorous techniques from statistical physics. A detailed picture of the phase diagram at the replica symmetric level is provided, both at finite temperature and in the noiseless regimes. Also for the latter, the critical load is further investigated up to one step of replica symmetry breaking. An analytical and numerical inspection of the transition curves",
    "link": "http://arxiv.org/abs/2211.09694",
    "context": "Title: Thermodynamics of bidirectional associative memories. (arXiv:2211.09694v2 [cond-mat.dis-nn] UPDATED)\nAbstract: In this paper we investigate the equilibrium properties of bidirectional associative memories (BAMs). Introduced by Kosko in 1988 as a generalization of the Hopfield model to a bipartite structure, the simplest architecture is defined by two layers of neurons, with synaptic connections only between units of different layers: even without internal connections within each layer, information storage and retrieval are still possible through the reverberation of neural activities passing from one layer to another. We characterize the computational capabilities of a stochastic extension of this model in the thermodynamic limit, by applying rigorous techniques from statistical physics. A detailed picture of the phase diagram at the replica symmetric level is provided, both at finite temperature and in the noiseless regimes. Also for the latter, the critical load is further investigated up to one step of replica symmetry breaking. An analytical and numerical inspection of the transition curves",
    "path": "papers/22/11/2211.09694.json",
    "total_tokens": 856,
    "translated_title": "双向联想记忆的热力学",
    "translated_abstract": "本文研究了双向联想记忆（BAM）的平衡性质。最简单的结构是由两层神经元定义的，仅在不同层之间的单元之间存在突触连接：即使在每层内没有内部连接的情况下，通过神经活动在层与层之间传递，信息的存储和检索仍然是可能的。我们通过应用统计物理的严格技术，表征了此模型的随机扩展在热力学极限下的计算能力。我们提供了复制对称层面上相图的详细描绘，包括有限温度和无噪声的情况。对于后者，我们进一步研究了临界负载，直到一步复制对称性破缺。我们对转换曲线进行了分析和数值检查。",
    "tldr": "研究了双向联想记忆的平衡性质，表征了其随机扩展在热力学极限下的计算能力，提供了有限温度和无噪声情况下的相图，分析了临界负载。",
    "en_tdlr": "Investigated the equilibrium properties of Bidirectional Associative Memories (BAMs) and characterized the computational capabilities of a stochastic extension of this model in the thermodynamic limit. Provided a detailed picture of the phase diagram at the replica symmetric level and analyzed the critical load under finite temperature and noiseless regimes."
}