{
    "title": "On the Convergence of Credit Risk in Current Consumer Automobile Loans. (arXiv:2211.09176v2 [q-fin.ST] UPDATED)",
    "abstract": "Conditional credit risk of a current loan is understudied. Using large-sample statistics and asset-level consumer automobile asset-backed security data, we find default risk conditional on survival eventually converges for borrowers in disparate credit risk bands, a phenomenon we call credit risk convergence. We conservatively estimate that borrowers forwent $1,212 - $2,327 in savings through delayed prepayment and find the surprising result that current lower risk borrowers behave less efficiently than current higher risk borrowers. We also present visual evidence prepayments rose with used auto values and economic stimulus rather than financial acumen. Our results are robust to various sensitivity tests.",
    "link": "http://arxiv.org/abs/2211.09176",
    "context": "Title: On the Convergence of Credit Risk in Current Consumer Automobile Loans. (arXiv:2211.09176v2 [q-fin.ST] UPDATED)\nAbstract: Conditional credit risk of a current loan is understudied. Using large-sample statistics and asset-level consumer automobile asset-backed security data, we find default risk conditional on survival eventually converges for borrowers in disparate credit risk bands, a phenomenon we call credit risk convergence. We conservatively estimate that borrowers forwent $1,212 - $2,327 in savings through delayed prepayment and find the surprising result that current lower risk borrowers behave less efficiently than current higher risk borrowers. We also present visual evidence prepayments rose with used auto values and economic stimulus rather than financial acumen. Our results are robust to various sensitivity tests.",
    "path": "papers/22/11/2211.09176.json",
    "total_tokens": 931,
    "translated_title": "当前消费者汽车贷款的信用风险收敛研究",
    "translated_abstract": "当前贷款的条件信用风险鲜少研究。本研究使用大样本统计和基于消费者汽车资产支持证券数据的资产层面的分析，发现对于不同信用风险组的借款人，存活后的违约风险最终会趋于收敛，这种现象被称为信用风险收敛。我们估计低风险借款人的拖延偿还造成了1212-2327美元的损失，并发现了出人意料的结果：当前的低风险借款人比当前的高风险借款人表现得不够有效率。我们还通过视觉证据展示了汽车价值和经济刺激导致贷款提前偿还增加，但并非由于借款人的财务能力。我们的结果经过多种敏感性测试，表现稳健。",
    "tldr": "本研究使用大量样本数据证明，对于不同信用风险组的借款人，存活后的违约风险最终会趋于收敛，这种现象被称为信用风险收敛。低风险借款人的拖延偿还让他们损失了1212-2327美元，同时当前的低风险借款人比当前的高风险借款人表现得不够有效率。",
    "en_tdlr": "This study uses large-sample statistics and asset-level consumer automobile asset-backed security data to show that default risk of current loans eventually converges for borrowers in different credit risk groups, a phenomenon called credit risk convergence. Delayed prepayment caused low-risk borrowers to forego savings of $1,212-2,327, and surprisingly, low-risk borrowers were less efficient than high-risk borrowers. The study also presents visual evidence that prepayments increased with used car values and economic stimulus, but not financial acumen."
}