{
    "title": "SexWEs: Domain-Aware Word Embeddings via Cross-lingual Semantic Specialisation for Chinese Sexism Detection in Social Media. (arXiv:2211.08447v3 [cs.CL] UPDATED)",
    "abstract": "The goal of sexism detection is to mitigate negative online content targeting certain gender groups of people. However, the limited availability of labeled sexism-related datasets makes it problematic to identify online sexism for low-resource languages. In this paper, we address the task of automatic sexism detection in social media for one low-resource language -- Chinese. Rather than collecting new sexism data or building cross-lingual transfer learning models, we develop a cross-lingual domain-aware semantic specialisation system in order to make the most of existing data. Semantic specialisation is a technique for retrofitting pre-trained distributional word vectors by integrating external linguistic knowledge (such as lexico-semantic relations) into the specialised feature space. To do this, we leverage semantic resources for sexism from a high-resource language (English) to specialise pre-trained word vectors in the target language (Chinese) to inject domain knowledge. We demons",
    "link": "http://arxiv.org/abs/2211.08447",
    "context": "Title: SexWEs: Domain-Aware Word Embeddings via Cross-lingual Semantic Specialisation for Chinese Sexism Detection in Social Media. (arXiv:2211.08447v3 [cs.CL] UPDATED)\nAbstract: The goal of sexism detection is to mitigate negative online content targeting certain gender groups of people. However, the limited availability of labeled sexism-related datasets makes it problematic to identify online sexism for low-resource languages. In this paper, we address the task of automatic sexism detection in social media for one low-resource language -- Chinese. Rather than collecting new sexism data or building cross-lingual transfer learning models, we develop a cross-lingual domain-aware semantic specialisation system in order to make the most of existing data. Semantic specialisation is a technique for retrofitting pre-trained distributional word vectors by integrating external linguistic knowledge (such as lexico-semantic relations) into the specialised feature space. To do this, we leverage semantic resources for sexism from a high-resource language (English) to specialise pre-trained word vectors in the target language (Chinese) to inject domain knowledge. We demons",
    "path": "papers/22/11/2211.08447.json",
    "total_tokens": 899,
    "translated_title": "SexWEs: 通过跨语言语义专业化实现领域感知词向量来检测社交媒体中的中文性别歧视",
    "translated_abstract": "性别歧视检测的目标是减少针对某些性别群体的负面在线内容。然而，有限的带有性别歧视标签的数据集可用性使得在缺乏资源的语言中识别在线性别歧视成为一个问题。本文解决了自动检测社交媒体中中文性别歧视的任务。我们开发了一个跨语言的领域感知语义专业化系统，以充分利用现有数据。语义专业化是一种通过将外部语言知识（如词汇语义关系）集成到专业化特征空间中来改进预先训练的分布式词向量的技术。为此，我们利用高资源语言（英语）中的性别歧视语义资源来专业化目标语言（中文）中的预先训练的词向量以注入领域知识。",
    "tldr": "本文通过利用跨语言的领域感知语义专业化系统，在不采集新歧视数据或搭建跨语言转移学习模型的情况下，实现了对社交媒体中的中文性别歧视的自动检测。",
    "en_tdlr": "This paper proposes a cross-lingual domain-aware semantic specialisation system, which leverages semantic resources for sexism from a high-resource language (English) to automatically detect Chinese sexism in social media without collecting new data or building cross-lingual transfer learning models."
}