{
    "title": "Spatial-temporal recurrent reinforcement learning for autonomous ships. (arXiv:2211.01004v2 [cs.LG] UPDATED)",
    "abstract": "This paper proposes a spatial-temporal recurrent neural network architecture for deep $Q$-networks that can be used to steer an autonomous ship. The network design makes it possible to handle an arbitrary number of surrounding target ships while offering robustness to partial observability. Furthermore, a state-of-the-art collision risk metric is proposed to enable an easier assessment of different situations by the agent. The COLREG rules of maritime traffic are explicitly considered in the design of the reward function. The final policy is validated on a custom set of newly created single-ship encounters called `Around the Clock' problems and the commonly used Imazu (1987) problems, which include 18 multi-ship scenarios. Performance comparisons with artificial potential field and velocity obstacle methods demonstrate the potential of the proposed approach for maritime path planning. Furthermore, the new architecture exhibits robustness when it is deployed in multi-agent scenarios and",
    "link": "http://arxiv.org/abs/2211.01004",
    "context": "Title: Spatial-temporal recurrent reinforcement learning for autonomous ships. (arXiv:2211.01004v2 [cs.LG] UPDATED)\nAbstract: This paper proposes a spatial-temporal recurrent neural network architecture for deep $Q$-networks that can be used to steer an autonomous ship. The network design makes it possible to handle an arbitrary number of surrounding target ships while offering robustness to partial observability. Furthermore, a state-of-the-art collision risk metric is proposed to enable an easier assessment of different situations by the agent. The COLREG rules of maritime traffic are explicitly considered in the design of the reward function. The final policy is validated on a custom set of newly created single-ship encounters called `Around the Clock' problems and the commonly used Imazu (1987) problems, which include 18 multi-ship scenarios. Performance comparisons with artificial potential field and velocity obstacle methods demonstrate the potential of the proposed approach for maritime path planning. Furthermore, the new architecture exhibits robustness when it is deployed in multi-agent scenarios and",
    "path": "papers/22/11/2211.01004.json",
    "total_tokens": 916,
    "translated_title": "自主船舶的时空循环强化学习",
    "translated_abstract": "本文提出了一个空间-时间循环神经网络架构，可用于驾驶自主船舶的深度 Q 网络。该网络设计使得可以处理任意数量的周围目标船只，并对局部观测具有鲁棒性。此外，提出了一种最先进的碰撞风险度量方法，以便智能体更容易评估不同情况。海上交通 COLREG 规则明确地考虑在奖励函数设计中。最终策略在自定义的 Around the Clock 单船遭遇问题集和包括 18 个多船情景的常用 Imazu (1987) 问题中进行了验证。通过与人工势场和速度障碍方法的性能比较表明了所提出方法在海上路径规划中的潜力。此外，新架构在多智能体场景中的部署也表现出鲁棒性。",
    "tldr": "本文提出了一个时空循环神经网络架构，通过考虑 COLREG 规则和引入最先进的碰撞风险度量方法，实现了针对自主船舶的深度 Q 网络。在真实环境和模拟环境中验证后，所提出的方法表现出在海上路径规划中的潜力并具有鲁棒性。"
}