{
    "title": "Automating Rigid Origami Design. (arXiv:2211.13219v2 [cs.GR] UPDATED)",
    "abstract": "Rigid origami has shown potential in large diversity of practical applications. However, current rigid origami crease pattern design mostly relies on known tessellations. This strongly limits the diversity and novelty of patterns that can be created. In this work, we build upon the recently developed principle of three units method to formulate rigid origami design as a discrete optimization problem, the rigid origami game. Our implementation allows for a simple definition of diverse objectives and thereby expands the potential of rigid origami further to optimized, application-specific crease patterns. We showcase the flexibility of our formulation through use of a diverse set of search methods in several illustrative case studies. We are not only able to construct various patterns that approximate given target shapes, but to also specify abstract, function-based rewards which result in novel, foldable and functional designs for everyday objects.",
    "link": "http://arxiv.org/abs/2211.13219",
    "context": "Title: Automating Rigid Origami Design. (arXiv:2211.13219v2 [cs.GR] UPDATED)\nAbstract: Rigid origami has shown potential in large diversity of practical applications. However, current rigid origami crease pattern design mostly relies on known tessellations. This strongly limits the diversity and novelty of patterns that can be created. In this work, we build upon the recently developed principle of three units method to formulate rigid origami design as a discrete optimization problem, the rigid origami game. Our implementation allows for a simple definition of diverse objectives and thereby expands the potential of rigid origami further to optimized, application-specific crease patterns. We showcase the flexibility of our formulation through use of a diverse set of search methods in several illustrative case studies. We are not only able to construct various patterns that approximate given target shapes, but to also specify abstract, function-based rewards which result in novel, foldable and functional designs for everyday objects.",
    "path": "papers/22/11/2211.13219.json",
    "total_tokens": 882,
    "translated_title": "自动化刚性折纸设计",
    "translated_abstract": "刚性折纸在很多实际应用中展现出了其潜力，然而目前的刚性折纸褶皱图案设计主要依赖于已知的拼贴。这严重限制了可以创建的图案的多样性和新颖性。在这项工作中，我们在最近开发的三单元原则的基础上，将刚性折纸设计成一种离散优化问题，即刚性折纸游戏。我们的实现允许简单定义多样的目标，从而进一步扩展刚性折纸的潜力，得到针对应用特定的折痕图案。我们通过多种搜索方法在几个案例研究中展示了我们公式的灵活性。我们不仅能够构造出近似给定目标形状的各种图案，而且还能够指定基于函数的抽象奖励，从而得到日常物品的新颖、可折叠和实用的设计。",
    "tldr": "这篇论文介绍了一种离散优化问题-刚性折纸游戏，该游戏可以扩展刚性折纸的潜力，使其得到针对应用特定的折痕图案，从而可以得到日常物品的新颖、可折叠和实用的设计。",
    "en_tdlr": "This paper introduces a discrete optimization problem- rigid origami game, which can expand the potential of rigid origami by allowing for application-specific crease patterns, resulting in novel, foldable, and functional designs for everyday objects."
}