{
    "title": "Collaborative Training of Medical Artificial Intelligence Models with non-uniform Labels. (arXiv:2211.13606v2 [cs.LG] UPDATED)",
    "abstract": "Due to the rapid advancements in recent years, medical image analysis is largely dominated by deep learning (DL). However, building powerful and robust DL models requires training with large multi-party datasets. While multiple stakeholders have provided publicly available datasets, the ways in which these data are labeled vary widely. For Instance, an institution might provide a dataset of chest radiographs containing labels denoting the presence of pneumonia, while another institution might have a focus on determining the presence of metastases in the lung. Training a single AI model utilizing all these data is not feasible with conventional federated learning (FL). This prompts us to propose an extension to the widespread FL process, namely flexible federated learning (FFL) for collaborative training on such data. Using 695,000 chest radiographs from five institutions from across the globe each with differing labels - we demonstrate that having heterogeneously labeled datasets, FF",
    "link": "http://arxiv.org/abs/2211.13606",
    "context": "Title: Collaborative Training of Medical Artificial Intelligence Models with non-uniform Labels. (arXiv:2211.13606v2 [cs.LG] UPDATED)\nAbstract: Due to the rapid advancements in recent years, medical image analysis is largely dominated by deep learning (DL). However, building powerful and robust DL models requires training with large multi-party datasets. While multiple stakeholders have provided publicly available datasets, the ways in which these data are labeled vary widely. For Instance, an institution might provide a dataset of chest radiographs containing labels denoting the presence of pneumonia, while another institution might have a focus on determining the presence of metastases in the lung. Training a single AI model utilizing all these data is not feasible with conventional federated learning (FL). This prompts us to propose an extension to the widespread FL process, namely flexible federated learning (FFL) for collaborative training on such data. Using 695,000 chest radiographs from five institutions from across the globe each with differing labels - we demonstrate that having heterogeneously labeled datasets, FF",
    "path": "papers/22/11/2211.13606.json",
    "total_tokens": 885,
    "translated_title": "医疗人工智能模型非均一标签的协同训练",
    "translated_abstract": "近年来，深度学习已经成为医学图像分析领域的主流手段。然而，构建强大而稳健的深度学习模型需要使用大规模多方数据集进行训练。虽然多个利益相关者已经提供了公开的数据集，但是这些数据的标签方式差异很大。为了解决这一问题，本文提出了一种灵活的联合学习方法：灵活联合学习(FFL)。通过对来自全球五个机构的695,000个具有不同标签的胸部透视图进行协同训练，我们证明了在异质化标注数据集情况下使用FFL可以比传统的联邦学习获得更好的性能，并提供了在机构之间进行广泛协作的一种有前途的替代方法。",
    "tldr": "本研究提出了一种灵活的联合学习方法(FFL)，可以协同训练异质化标注数据集来构建强大而稳健的深度学习模型，为不同机构间的广泛合作提供了一种有前途的替代方案。",
    "en_tdlr": "This paper proposes a flexible federated learning (FFL) method for collaborative training on heterogeneously labeled datasets, which can build powerful and robust deep learning models and provide a promising alternative for widespread collaboration among institutions."
}