{
    "title": "Cross-Sectional Dynamics Under Network Structure: Theory and Macroeconomic Applications. (arXiv:2211.13610v2 [econ.EM] UPDATED)",
    "abstract": "Many environments in economics feature a cross-section of units linked by bilateral ties. I develop a framework for studying dynamics of cross-sectional variables exploiting this network structure. It is a vector autoregression in which innovations transmit cross-sectionally only via bilateral links and which can accommodate rich patterns of how network effects of higher order accumulate over time. The model can be used to estimate dynamic network effects, with the network given or inferred from dynamic cross-correlations in the data. It also offers a dimensionality-reduction technique for modeling (cross-sectional) processes, owing to networks' ability to summarize complex relations among units by relatively few non-zero bilateral links. In a first application, I estimate how sectoral productivity shocks transmit along supply chain linkages and affect dynamics of sectoral prices in the US economy. The analysis suggests that network positions can rationalize not only the strength of a ",
    "link": "http://arxiv.org/abs/2211.13610",
    "context": "Title: Cross-Sectional Dynamics Under Network Structure: Theory and Macroeconomic Applications. (arXiv:2211.13610v2 [econ.EM] UPDATED)\nAbstract: Many environments in economics feature a cross-section of units linked by bilateral ties. I develop a framework for studying dynamics of cross-sectional variables exploiting this network structure. It is a vector autoregression in which innovations transmit cross-sectionally only via bilateral links and which can accommodate rich patterns of how network effects of higher order accumulate over time. The model can be used to estimate dynamic network effects, with the network given or inferred from dynamic cross-correlations in the data. It also offers a dimensionality-reduction technique for modeling (cross-sectional) processes, owing to networks' ability to summarize complex relations among units by relatively few non-zero bilateral links. In a first application, I estimate how sectoral productivity shocks transmit along supply chain linkages and affect dynamics of sectoral prices in the US economy. The analysis suggests that network positions can rationalize not only the strength of a ",
    "path": "papers/22/11/2211.13610.json",
    "total_tokens": 900,
    "translated_title": "网络结构下的横向动力学: 理论及其宏观经济学应用",
    "translated_abstract": "许多经济学领域都涉及通过双边联系联系在一起的单位横向切面。本文提出了一个研究利用这种网络结构研究横向变量动态的框架。它是一个矢量自回归，其中创新仅通过双边联系在横向传输，并且可以容纳网络效应的高阶如何随时间累积的丰富模式。该模型可用于估计动态网络效应，其中网络由数据中的动态交叉相关性确定或推断。它还提供了一种建模(new_word)的降维技术，因为网络能够通过相对较少的非零双边链接汇总单位之间的复杂关系。",
    "tldr": "本文提出了一个网络结构下横向动力学的框架，可以用于估计动态网络效应和建模降维等应用。第一次应用该框架时，作者估计了部门生产力冲击如何沿着供应链传输并影响美国经济中部门价格的动态。分析表明，网络位置不仅可以解释经济变化的强度，还可以解释供应链的作用。",
    "en_tdlr": "This paper presents a framework for studying dynamics of cross-sectional variables under network structure, which can be used for dynamic network effects estimation and modeling dimensionality reduction. The author applied this framework to estimate how sectoral productivity shocks transmit along supply chain linkages and affect the US economy, demonstrating the role of network positions in explaining economic changes."
}