{
    "title": "Neural Network Complexity of Chaos and Turbulence. (arXiv:2211.15382v2 [cs.LG] UPDATED)",
    "abstract": "Chaos and turbulence are complex physical phenomena, yet a precise definition of the complexity measure that quantifies them is still lacking. In this work we consider the relative complexity of chaos and turbulence from the perspective of deep neural networks. We analyze a set of classification problems, where the network has to distinguish images of fluid profiles in the turbulent regime from other classes of images such as fluid profiles in the chaotic regime, various constructions of noise and real world images. We analyze incompressible as well as weakly compressible fluid flows. We quantify the complexity of the computation performed by the network via the intrinsic dimensionality of the internal feature representations, and calculate the effective number of independent features which the network uses in order to distinguish between classes. In addition to providing a numerical estimate of the complexity of the computation, the measure also characterizes the neural network proces",
    "link": "http://arxiv.org/abs/2211.15382",
    "context": "Title: Neural Network Complexity of Chaos and Turbulence. (arXiv:2211.15382v2 [cs.LG] UPDATED)\nAbstract: Chaos and turbulence are complex physical phenomena, yet a precise definition of the complexity measure that quantifies them is still lacking. In this work we consider the relative complexity of chaos and turbulence from the perspective of deep neural networks. We analyze a set of classification problems, where the network has to distinguish images of fluid profiles in the turbulent regime from other classes of images such as fluid profiles in the chaotic regime, various constructions of noise and real world images. We analyze incompressible as well as weakly compressible fluid flows. We quantify the complexity of the computation performed by the network via the intrinsic dimensionality of the internal feature representations, and calculate the effective number of independent features which the network uses in order to distinguish between classes. In addition to providing a numerical estimate of the complexity of the computation, the measure also characterizes the neural network proces",
    "path": "papers/22/11/2211.15382.json",
    "total_tokens": 798,
    "translated_title": "混沌与湍流的神经网络复杂性",
    "translated_abstract": "混沌和湍流是复杂的物理现象，然而对于量化它们的复杂度的精确定义仍然缺乏。在这项工作中，我们从深度神经网络的角度考虑了混沌和湍流的相对复杂性。我们分析了一系列分类问题，网络需要区分湍流状态下的流体轮廓图像和其他类别的图像，如混沌状态下的流体轮廓、各种噪声构造和真实世界图像。我们分析了不可压缩和弱压缩流体流动。我们通过内部特征表示的内在维度量化网络执行的计算的复杂性，并计算网络用于区分类别的有效独立特征数量。除了提供计算复杂度的数值估计外，该度量还表征了神经网络的处理过程。",
    "tldr": "本文通过深度神经网络分析了混沌和湍流的相对复杂性，并使用内在维度和有效独立特征数量量化了网络的计算复杂度。",
    "en_tdlr": "This paper analyzes the relative complexity of chaos and turbulence using deep neural networks, and quantifies the computational complexity of the network using intrinsic dimensionality and effective number of independent features."
}