{
    "title": "Variance of entropy for testing time-varying regimes with an application to meme stocks. (arXiv:2211.05415v3 [q-fin.ST] UPDATED)",
    "abstract": "Shannon entropy is the most common metric to measure the degree of randomness of time series in many fields, ranging from physics and finance to medicine and biology. Real-world systems may be in general non stationary, with an entropy value that is not constant in time. The goal of this paper is to propose a hypothesis testing procedure to test the null hypothesis of constant Shannon entropy for time series, against the alternative of a significant variation of the entropy between two subsequent periods. To this end, we find an unbiased approximation of the variance of the Shannon entropy's estimator, up to the order O(n^(-4)) with n the sample size. In order to characterize the variance of the estimator, we first obtain the explicit formulas of the central moments for both the binomial and the multinomial distributions, which describe the distribution of the Shannon entropy. Second, we find the optimal length of the rolling window used for estimating the time-varying Shannon entropy ",
    "link": "http://arxiv.org/abs/2211.05415",
    "context": "Title: Variance of entropy for testing time-varying regimes with an application to meme stocks. (arXiv:2211.05415v3 [q-fin.ST] UPDATED)\nAbstract: Shannon entropy is the most common metric to measure the degree of randomness of time series in many fields, ranging from physics and finance to medicine and biology. Real-world systems may be in general non stationary, with an entropy value that is not constant in time. The goal of this paper is to propose a hypothesis testing procedure to test the null hypothesis of constant Shannon entropy for time series, against the alternative of a significant variation of the entropy between two subsequent periods. To this end, we find an unbiased approximation of the variance of the Shannon entropy's estimator, up to the order O(n^(-4)) with n the sample size. In order to characterize the variance of the estimator, we first obtain the explicit formulas of the central moments for both the binomial and the multinomial distributions, which describe the distribution of the Shannon entropy. Second, we find the optimal length of the rolling window used for estimating the time-varying Shannon entropy ",
    "path": "papers/22/11/2211.05415.json",
    "total_tokens": 915,
    "translated_title": "应用于模因股票的时变制度检验中熵的方差",
    "translated_abstract": "Shannon熵是用于衡量许多领域（从物理学和金融到医学和生物学）时间序列随机程度的最常用度量。现实世界中的系统普遍非平稳，熵值在时间上不是恒定的。本文旨在提出一种假设检验程序，以检验时间序列Shannon熵的恒定零假设，对立的是两个相邻时间段之间熵的显著变化的备择假设。为此，我们找到了Shannon熵估计量的方差的无偏估计，直到n为样本大小的高阶项O(n−4)。为了表征估计量的方差，我们首先得到二项分布和多项分布的中心矩的显式公式，它们描述了Shannon熵的分布。其次，我们找到了用于估计时变Shannon熵的滚动窗口的最佳长度。",
    "tldr": "本文提出了一种假设检验程序，以检验时间序列Shannon熵的恒定零假设，对立的是两个相邻时间段之间熵的显著变化的备择假设，并找到了Shannon熵估计量的方差的无偏估计。"
}