{
    "title": "A Bi-level Nonlinear Eigenvector Algorithm for Wasserstein Discriminant Analysis. (arXiv:2211.11891v2 [stat.ML] UPDATED)",
    "abstract": "Much like the classical Fisher linear discriminant analysis (LDA), the recently proposed Wasserstein discriminant analysis (WDA) is a linear dimensionality reduction method that seeks a projection matrix to maximize the dispersion of different data classes and minimize the dispersion of same data classes via a bi-level optimization. In contrast to LDA, WDA can account for both global and local interconnections between data classes by using the underlying principles of optimal transport. In this paper, a bi-level nonlinear eigenvector algorithm (WDA-nepv) is presented to fully exploit the structures of the bi-level optimization of WDA. The inner level of WDA-nepv for computing the optimal transport matrices is formulated as an eigenvector-dependent nonlinear eigenvalue problem (NEPv), and meanwhile, the outer level for trace ratio optimizations is formulated as another NEPv. Both NEPvs can be computed efficiently under the self-consistent field (SCF) framework. WDA-nepv is derivative-fr",
    "link": "http://arxiv.org/abs/2211.11891",
    "context": "Title: A Bi-level Nonlinear Eigenvector Algorithm for Wasserstein Discriminant Analysis. (arXiv:2211.11891v2 [stat.ML] UPDATED)\nAbstract: Much like the classical Fisher linear discriminant analysis (LDA), the recently proposed Wasserstein discriminant analysis (WDA) is a linear dimensionality reduction method that seeks a projection matrix to maximize the dispersion of different data classes and minimize the dispersion of same data classes via a bi-level optimization. In contrast to LDA, WDA can account for both global and local interconnections between data classes by using the underlying principles of optimal transport. In this paper, a bi-level nonlinear eigenvector algorithm (WDA-nepv) is presented to fully exploit the structures of the bi-level optimization of WDA. The inner level of WDA-nepv for computing the optimal transport matrices is formulated as an eigenvector-dependent nonlinear eigenvalue problem (NEPv), and meanwhile, the outer level for trace ratio optimizations is formulated as another NEPv. Both NEPvs can be computed efficiently under the self-consistent field (SCF) framework. WDA-nepv is derivative-fr",
    "path": "papers/22/11/2211.11891.json",
    "total_tokens": 976,
    "translated_title": "基于双层非线性特征向量算法的Wasserstein判别分析",
    "translated_abstract": "如同经典的Fisher线性判别分析（LDA），最近提出的Wasserstein判别分析（WDA）是一种线性降维方法，通过双层优化来寻求一个投影矩阵，最大化不同数据类别的离散度，并最小化相同数据类别的离散度。与LDA不同，WDA利用最优传输的基本原理，可以考虑数据类别之间的全局和局部相互关联关系。本文提出了一种基于双层非线性特征向量算法（WDA-nepv）来充分利用WDA的双层优化结构。WDA-nepv的内部层用于计算最优传输矩阵，并被构造为一个依赖于特征向量的非线性特征值问题（NEPv），同时，外部层用于追踪比率优化，并被构造为另一个NEPv问题。这两个NEPv问题可以在自洽场（SCF）框架下高效计算。WDA-nepv是可导的。",
    "tldr": "本文提出了一种基于双层非线性特征向量算法（WDA-nepv）的Wasserstein判别分析方法，通过最大化不同类别的离散度，并最小化相同类别的离散度，充分利用WDA的双层优化结构，并在自洽场框架下高效求解。"
}