{
    "title": "Can lies be faked? Comparing low-stakes and high-stakes deception video datasets from a Machine Learning perspective. (arXiv:2211.13035v2 [cs.CV] UPDATED)",
    "abstract": "Despite the great impact of lies in human societies and a meager 54% human accuracy for Deception Detection (DD), Machine Learning systems that perform automated DD are still not viable for proper application in real-life settings due to data scarcity. Few publicly available DD datasets exist and the creation of new datasets is hindered by the conceptual distinction between low-stakes and high-stakes lies. Theoretically, the two kinds of lies are so distinct that a dataset of one kind could not be used for applications for the other kind. Even though it is easier to acquire data on low-stakes deception since it can be simulated (faked) in controlled settings, these lies do not hold the same significance or depth as genuine high-stakes lies, which are much harder to obtain and hold the practical interest of automated DD systems. To investigate whether this distinction holds true from a practical perspective, we design several experiments comparing a high-stakes DD dataset and a low-stak",
    "link": "http://arxiv.org/abs/2211.13035",
    "context": "Title: Can lies be faked? Comparing low-stakes and high-stakes deception video datasets from a Machine Learning perspective. (arXiv:2211.13035v2 [cs.CV] UPDATED)\nAbstract: Despite the great impact of lies in human societies and a meager 54% human accuracy for Deception Detection (DD), Machine Learning systems that perform automated DD are still not viable for proper application in real-life settings due to data scarcity. Few publicly available DD datasets exist and the creation of new datasets is hindered by the conceptual distinction between low-stakes and high-stakes lies. Theoretically, the two kinds of lies are so distinct that a dataset of one kind could not be used for applications for the other kind. Even though it is easier to acquire data on low-stakes deception since it can be simulated (faked) in controlled settings, these lies do not hold the same significance or depth as genuine high-stakes lies, which are much harder to obtain and hold the practical interest of automated DD systems. To investigate whether this distinction holds true from a practical perspective, we design several experiments comparing a high-stakes DD dataset and a low-stak",
    "path": "papers/22/11/2211.13035.json",
    "total_tokens": 973,
    "translated_title": "谎言可以被伪造吗？从机器学习的角度比较低风险和高风险的欺骗视频数据集",
    "translated_abstract": "尽管谎言对人类社会有着巨大影响，并且欺骗检测的人类准确率仅为54％，但机器学习系统仍然无法在现实应用中有效执行自动化的欺骗检测，原因在于数据稀缺。公开的欺骗检测数据集很少，并且由于低风险和高风险谎言之间的概念区别，创造新的数据集变得困难。理论上，这两种谎言是如此不同，以至于一个种类的数据集不能用于另一个种类的应用。尽管获得低风险欺骗的数据更容易，因为它可以在受控环境中进行模拟（伪造），但这些谎言不具有与真实的高风险谎言相同的重要性或深度，而真实的高风险谎言很难获得，并且对于自动化欺骗检测系统具有实际兴趣。为了从实践角度探究这个区别是否成立，我们设计了几个实验，比较了一个高风险的欺骗检测数据集和一个低风险数据集。",
    "tldr": "该论文从机器学习的角度比较了低风险和高风险的欺骗视频数据集，并探究了它们在实际应用中的区别和可行性。",
    "en_tdlr": "This paper compares low-stakes and high-stakes deception video datasets from a Machine Learning perspective and investigates their distinctions and viability in practical applications."
}