{
    "title": "FedGen: Generalizable Federated Learning for Sequential Data. (arXiv:2211.01914v2 [cs.LG] UPDATED)",
    "abstract": "Existing federated learning models that follow the standard risk minimization paradigm of machine learning often fail to generalize in the presence of spurious correlations in the training data. In many real-world distributed settings, spurious correlations exist due to biases and data sampling issues on distributed devices or clients that can erroneously influence models. Current generalization approaches are designed for centralized training and attempt to identify features that have an invariant causal relationship with the target, thereby reducing the effect of spurious features. However, such invariant risk minimization approaches rely on apriori knowledge of training data distributions which is hard to obtain in many applications. In this work, we present a generalizable federated learning framework called FedGen, which allows clients to identify and distinguish between spurious and invariant features in a collaborative manner without prior knowledge of training distributions. We",
    "link": "http://arxiv.org/abs/2211.01914",
    "context": "Title: FedGen: Generalizable Federated Learning for Sequential Data. (arXiv:2211.01914v2 [cs.LG] UPDATED)\nAbstract: Existing federated learning models that follow the standard risk minimization paradigm of machine learning often fail to generalize in the presence of spurious correlations in the training data. In many real-world distributed settings, spurious correlations exist due to biases and data sampling issues on distributed devices or clients that can erroneously influence models. Current generalization approaches are designed for centralized training and attempt to identify features that have an invariant causal relationship with the target, thereby reducing the effect of spurious features. However, such invariant risk minimization approaches rely on apriori knowledge of training data distributions which is hard to obtain in many applications. In this work, we present a generalizable federated learning framework called FedGen, which allows clients to identify and distinguish between spurious and invariant features in a collaborative manner without prior knowledge of training distributions. We",
    "path": "papers/22/11/2211.01914.json",
    "total_tokens": 852,
    "translated_title": "FedGen: 适用于序列数据的可推广联邦学习",
    "translated_abstract": "现有的遵循标准机器学习风险最小化范式的联邦学习模型在训练数据存在伪相关性的情况下往往难以推广。在许多现实世界的分布式场景中，由于分布式设备或客户端的偏差和数据采样问题，会产生伪相关性，从而错误地影响模型。当前的推广方法是为集中式训练设计的，试图识别具有与目标不变因果关系的特征，从而减少伪特征的影响。然而，这种不变风险最小化方法依赖于训练数据分布的先验知识，在许多应用中难以获得。在这项工作中，我们提出了一个名为FedGen的可推广联邦学习框架，它允许客户端以协作的方式识别和区分伪特征和不变特征，而不需要训练分布的先前知识。",
    "tldr": "FedGen为联邦学习带来可推广性，允许分布式设备共同识别和区分伪特征和不变特征，而不需要训练分布的先前知识。",
    "en_tdlr": "FedGen brings generalizability to federated learning by allowing distributed devices to collaboratively identify and distinguish between spurious and invariant features without prior knowledge of training distributions."
}