{
    "title": "Bipartite Mixed Membership Distribution-Free Model. A novel model for community detection in overlapping bipartite weighted networks. (arXiv:2211.00912v2 [cs.SI] UPDATED)",
    "abstract": "Modeling and estimating mixed memberships for overlapping unipartite un-weighted networks has been well studied in recent years. However, to our knowledge, there is no model for a more general case, the overlapping bipartite weighted networks. To close this gap, we introduce a novel model, the Bipartite Mixed Membership Distribution-Free (BiMMDF) model. Our model allows an adjacency matrix to follow any distribution as long as its expectation has a block structure related to node membership. In particular, BiMMDF can model overlapping bipartite signed networks and it is an extension of many previous models, including the popular mixed membership stochastic blcokmodels. An efficient algorithm with a theoretical guarantee of consistent estimation is applied to fit BiMMDF. We then obtain the separation conditions of BiMMDF for different distributions. Furthermore, we also consider missing edges for sparse networks. The advantage of BiMMDF is demonstrated in extensive synthetic networks an",
    "link": "http://arxiv.org/abs/2211.00912",
    "context": "Title: Bipartite Mixed Membership Distribution-Free Model. A novel model for community detection in overlapping bipartite weighted networks. (arXiv:2211.00912v2 [cs.SI] UPDATED)\nAbstract: Modeling and estimating mixed memberships for overlapping unipartite un-weighted networks has been well studied in recent years. However, to our knowledge, there is no model for a more general case, the overlapping bipartite weighted networks. To close this gap, we introduce a novel model, the Bipartite Mixed Membership Distribution-Free (BiMMDF) model. Our model allows an adjacency matrix to follow any distribution as long as its expectation has a block structure related to node membership. In particular, BiMMDF can model overlapping bipartite signed networks and it is an extension of many previous models, including the popular mixed membership stochastic blcokmodels. An efficient algorithm with a theoretical guarantee of consistent estimation is applied to fit BiMMDF. We then obtain the separation conditions of BiMMDF for different distributions. Furthermore, we also consider missing edges for sparse networks. The advantage of BiMMDF is demonstrated in extensive synthetic networks an",
    "path": "papers/22/11/2211.00912.json",
    "total_tokens": 1015,
    "translated_title": "无分布双分块混合成员模型：一种新的用于重叠双分块加权网络社区发现的模型",
    "translated_abstract": "近年来，对于重叠单分块无权重网络的混合成员建模和估计已经得到了广泛的研究。然而，据我们所知，没有模型适用于更一般的情况，即重叠双分块加权网络。为了填补这一空白，我们引入了一种新的模型，即无分布双分块混合成员模型（BiMMDF）。我们的模型允许邻接矩阵遵循任何分布，只要其期望具有与节点成员有关的块结构即可。特别地，BiMMDF可以模拟重叠双分块符号网络，并且是许多先前模型的扩展，包括流行的混合成员随机块模型。我们应用具有一致估计理论保证的高效算法来拟合BiMMDF。我们进一步探讨了不同分布的BiMMDF的分离条件。此外，我们还考虑了稀疏网络的缺失边缘。BiMMDF的优势在广泛的合成网络和现实网络应用中得到了展示。",
    "tldr": "提出了一种无分布双分块混合成员模型（BiMMDF），可用于重叠双分块加权网络的社区发现，并可以模拟重叠双分块符号网络。该模型的估计具有一致性保证和理论分离条件，并可提高在合成网络和现实网络应用中的性能。",
    "en_tdlr": "A novel Bipartite Mixed Membership Distribution-Free (BiMMDF) model is proposed for community detection in overlapping bipartite weighted networks, which is an extension of many previous models and can simulate bipartite signed networks. The model's estimation has a theoretical guarantee of consistency and separation conditions for different distributions, and it demonstrates superior performance in both synthetic and real-world network applications."
}