{
    "title": "A Riemannian ADMM. (arXiv:2211.02163v2 [math.OC] UPDATED)",
    "abstract": "We consider a class of Riemannian optimization problems where the objective is the sum of a smooth function and a nonsmooth function, considered in the ambient space. This class of problems finds important applications in machine learning and statistics such as the sparse principal component analysis, sparse spectral clustering, and orthogonal dictionary learning. We propose a Riemannian alternating direction method of multipliers (ADMM) to solve this class of problems. Our algorithm adopts easily computable steps in each iteration. The iteration complexity of the proposed algorithm for obtaining an $\\epsilon$-stationary point is analyzed under mild assumptions. Existing ADMM for solving nonconvex problems either does not allow nonconvex constraint set, or does not allow nonsmooth objective function. In contrast, our complexity result is established for problems with simultaneous nonsmooth objective and manifold constraint. Numerical experiments are conducted to demonstrate the advanta",
    "link": "http://arxiv.org/abs/2211.02163",
    "context": "Title: A Riemannian ADMM. (arXiv:2211.02163v2 [math.OC] UPDATED)\nAbstract: We consider a class of Riemannian optimization problems where the objective is the sum of a smooth function and a nonsmooth function, considered in the ambient space. This class of problems finds important applications in machine learning and statistics such as the sparse principal component analysis, sparse spectral clustering, and orthogonal dictionary learning. We propose a Riemannian alternating direction method of multipliers (ADMM) to solve this class of problems. Our algorithm adopts easily computable steps in each iteration. The iteration complexity of the proposed algorithm for obtaining an $\\epsilon$-stationary point is analyzed under mild assumptions. Existing ADMM for solving nonconvex problems either does not allow nonconvex constraint set, or does not allow nonsmooth objective function. In contrast, our complexity result is established for problems with simultaneous nonsmooth objective and manifold constraint. Numerical experiments are conducted to demonstrate the advanta",
    "path": "papers/22/11/2211.02163.json",
    "total_tokens": 912,
    "translated_title": "一种黎曼ADMM方法",
    "translated_abstract": "我们考虑了一类黎曼优化问题，其中目标函数是在环空间中的光滑函数和非光滑函数之和。这类问题在机器学习和统计学中有重要的应用，例如稀疏主成分分析、稀疏谱聚类和正交字典学习。我们提出了一种黎曼交替方向乘子法（ADMM）来解决这一类问题。每次迭代我们采用易于计算的步骤。在温和的假设下，我们分析了算法得到$\\epsilon$-稳定点的迭代复杂度。现有的用于解决非凸问题的ADMM方法要么不允许非凸约束集合，要么不允许非光滑的目标函数。反之，我们的复杂度结果适用于同时具有非光滑目标和流形约束的问题。通过数值实验，我们展示了该算法的优点。",
    "tldr": "该论文提出了一种适用于机器学习和统计学中重要应用的黎曼交替方向乘子法（ADMM），能够同时处理非凸约束和非光滑的目标函数，并分析了算法得到$\\epsilon$-稳定点的迭代复杂度。",
    "en_tdlr": "This paper proposes a Riemannian alternating direction method of multipliers (ADMM) for solving a class of optimization problems with a smooth function and a non-smooth function as the objective, which finds important applications in machine learning and statistics. The proposed algorithm can handle non-convex constraint and non-smooth objective simultaneously, and the iteration complexity for obtaining an $\\epsilon$-stationary point is analyzed under mild assumptions."
}