{
    "title": "Data-driven multinomial random forest: A new random forest variant with strong consistency. (arXiv:2211.15154v2 [cs.LG] UPDATED)",
    "abstract": "In this paper, we modify the proof methods of some previously weakly consistent variants of random forests into strongly consistent proof methods, and improve the data utilization of these variants in order to obtain better theoretical properties and experimental performance. In addition, we propose a data-driven multinomial random forest (DMRF), which has the same complexity with BreimanRF (proposed by Breiman) while satisfying strong consistency with probability 1. It has better performance in classification and regression problems than previous RF variants that only satisfy weak consistency, and in most cases even surpasses BreimanRF in classification tasks. To the best of our knowledge, DMRF is currently a low-complexity and high-performing variation of random forests that achieves strong consistency with probability 1.",
    "link": "http://arxiv.org/abs/2211.15154",
    "context": "Title: Data-driven multinomial random forest: A new random forest variant with strong consistency. (arXiv:2211.15154v2 [cs.LG] UPDATED)\nAbstract: In this paper, we modify the proof methods of some previously weakly consistent variants of random forests into strongly consistent proof methods, and improve the data utilization of these variants in order to obtain better theoretical properties and experimental performance. In addition, we propose a data-driven multinomial random forest (DMRF), which has the same complexity with BreimanRF (proposed by Breiman) while satisfying strong consistency with probability 1. It has better performance in classification and regression problems than previous RF variants that only satisfy weak consistency, and in most cases even surpasses BreimanRF in classification tasks. To the best of our knowledge, DMRF is currently a low-complexity and high-performing variation of random forests that achieves strong consistency with probability 1.",
    "path": "papers/22/11/2211.15154.json",
    "total_tokens": 847,
    "translated_title": "数据驱动的多项式随机森林: 一种具有强一致性的新随机森林变体",
    "translated_abstract": "本文将一些先前弱一致性随机森林变体的证明方法修改为强一致性证明方法，并改进了这些变体的数据利用，以获得更好的理论性质和实验性能。此外，我们提出了一种数据驱动的多项式随机森林（DMRF），其与BreimanRF（由Breiman提出）具有相同的复杂度，同时以概率1满足强一致性。在分类和回归问题上，它比先前仅满足弱一致性的RF变体具有更好的性能，并且在大多数情况下甚至超过了BreimanRF在分类任务上的表现。据我们所知，DMRF是当前实现了概率1的强一致性的低复杂性和高性能随机森林的一种变体。",
    "tldr": "本研究改进了先前弱一致性随机森林变体的证明方法，提出了一种数据驱动的多项式随机森林（DMRF），并表明DMRF在分类和回归问题中具有更好的性能，并且实现了概率1的强一致性。",
    "en_tdlr": "This paper improves the proof methods of previous weakly consistent random forest variants, proposes a data-driven multinomial random forest (DMRF), and demonstrates that DMRF has better performance in classification and regression problems, achieving strong consistency with probability 1."
}