{
    "title": "Simple and Effective Augmentation Methods for CSI Based Indoor Localization. (arXiv:2211.10790v2 [eess.SP] UPDATED)",
    "abstract": "Indoor localization is a challenging task. Compared to outdoor environments where GPS is dominant, there is no robust and almost-universal approach. Recently, machine learning (ML) has emerged as the most promising approach for achieving accurate indoor localization. Nevertheless, its main challenge is requiring large datasets to train the neural networks. The data collection procedure is costly and laborious, requiring extensive measurements and labeling processes for different indoor environments. The situation can be improved by Data Augmentation (DA), a general framework to enlarge the datasets for ML, making ML systems more robust and increasing their generalization capabilities. This paper proposes two simple yet surprisingly effective DA algorithms for channel state information (CSI) based indoor localization motivated by physical considerations. We show that the number of measurements for a given accuracy requirement may be decreased by an order of magnitude. Specifically, we d",
    "link": "http://arxiv.org/abs/2211.10790",
    "context": "Title: Simple and Effective Augmentation Methods for CSI Based Indoor Localization. (arXiv:2211.10790v2 [eess.SP] UPDATED)\nAbstract: Indoor localization is a challenging task. Compared to outdoor environments where GPS is dominant, there is no robust and almost-universal approach. Recently, machine learning (ML) has emerged as the most promising approach for achieving accurate indoor localization. Nevertheless, its main challenge is requiring large datasets to train the neural networks. The data collection procedure is costly and laborious, requiring extensive measurements and labeling processes for different indoor environments. The situation can be improved by Data Augmentation (DA), a general framework to enlarge the datasets for ML, making ML systems more robust and increasing their generalization capabilities. This paper proposes two simple yet surprisingly effective DA algorithms for channel state information (CSI) based indoor localization motivated by physical considerations. We show that the number of measurements for a given accuracy requirement may be decreased by an order of magnitude. Specifically, we d",
    "path": "papers/22/11/2211.10790.json",
    "total_tokens": 859,
    "translated_title": "基于CSI的室内定位的简单有效增广方法",
    "translated_abstract": "室内定位是一项具有挑战性的任务。与GPS在室外环境中占主导地位不同，目前还没有稳健且几乎普遍适用的方法。最近，机器学习（ML）已成为实现准确室内定位的最有前途的方法。然而，其主要挑战是需要大量的数据集来训练神经网络。数据收集程序成本高昂，费时费力，需要针对不同的室内环境进行广泛的测量和标记过程。数据增广（DA）可改善这种情况，它是扩大ML数据集的一般框架，使ML系统更加稳健，并增加其泛化能力。本文提出了两种简单但惊人有效的DA算法，用于基于通道状态信息（CSI）的室内定位，并得到了物理考虑的激励。我们发现，在给定精度要求的情况下，测量次数可能减少一个数量级。具体而言，我们提出了一种基于相似变换的算法和一种基于模拟的算法。",
    "tldr": "本论文提出了两种简单但惊人有效的数据增广算法，基于通道状态信息（CSI）的室内定位可以减少测量次数一个数量级。",
    "en_tdlr": "This paper proposes two simple yet surprisingly effective data augmentation algorithms, which reduce the number of measurements an order of magnitude for CSI-based indoor localization."
}