{
    "title": "Deep Temporal Modelling of Clinical Depression through Social Media Text. (arXiv:2211.07717v2 [cs.CL] UPDATED)",
    "abstract": "We describe the development of a model to detect user-level clinical depression based on a user's temporal social media posts. Our model uses a Depression Symptoms Detection (DSD) classifier, which is trained on the largest existing samples of clinician annotated tweets for clinical depression symptoms. We subsequently use our DSD model to extract clinically relevant features, e.g., depression scores and their consequent temporal patterns, as well as user posting activity patterns, e.g., quantifying their ``no activity'' or ``silence.'' Furthermore, to evaluate the efficacy of these extracted features, we create three kinds of datasets including a test dataset, from two existing well-known benchmark datasets for user-level depression detection. We then provide accuracy measures based on single features, baseline features and feature ablation tests, at several different levels of temporal granularity. The relevant data distributions and clinical depression detection related settings can",
    "link": "http://arxiv.org/abs/2211.07717",
    "context": "Title: Deep Temporal Modelling of Clinical Depression through Social Media Text. (arXiv:2211.07717v2 [cs.CL] UPDATED)\nAbstract: We describe the development of a model to detect user-level clinical depression based on a user's temporal social media posts. Our model uses a Depression Symptoms Detection (DSD) classifier, which is trained on the largest existing samples of clinician annotated tweets for clinical depression symptoms. We subsequently use our DSD model to extract clinically relevant features, e.g., depression scores and their consequent temporal patterns, as well as user posting activity patterns, e.g., quantifying their ``no activity'' or ``silence.'' Furthermore, to evaluate the efficacy of these extracted features, we create three kinds of datasets including a test dataset, from two existing well-known benchmark datasets for user-level depression detection. We then provide accuracy measures based on single features, baseline features and feature ablation tests, at several different levels of temporal granularity. The relevant data distributions and clinical depression detection related settings can",
    "path": "papers/22/11/2211.07717.json",
    "total_tokens": 892,
    "translated_title": "社交媒体文本深度时间建模在临床抑郁症中的应用",
    "translated_abstract": "本文描述了一种基于用户时间轴社交媒体帖子的模型，用于检测用户的临床抑郁症。我们的模型使用了抑郁症状检测（DSD）分类器，该分类器基于最大数量的已经过临床医师注释的推文。我们随后使用我们的DSD模型来提取临床相关特征，例如抑郁症评分及其随后的时间模式，以及用户发布活动模式，例如量化他们的“无活动”或“沉默”。此外，为了评估这些提取特征的有效性，我们创建了三种数据集，包括来自两个现有的众所周知的用户级别抑郁症检测基准数据集的测试数据集。然后，我们提供了基于单个特征、基线特征和特征削减测试的准确度度量，在不同时间粒度的几个级别上。",
    "tldr": "本文通过使用抑郁症状检测分类器，从社交媒体文本提取临床相关特征，建立了一个模型用于检测用户的临床抑郁症，通过提供不同时间粒度的准确度度量来评估该模型。",
    "en_tdlr": "This paper develops a model for user-level clinical depression detection through temporal analysis of social media posts, utilizing depression symptom detection classifier and extracting clinically relevant features. The accuracy of the model is evaluated with different granularity levels and feature ablation tests on benchmark datasets."
}