{
    "title": "Equivariant Contrastive Learning for Sequential Recommendation. (arXiv:2211.05290v3 [cs.IR] UPDATED)",
    "abstract": "Contrastive learning (CL) benefits the training of sequential recommendation models with informative self-supervision signals. Existing solutions apply general sequential data augmentation strategies to generate positive pairs and encourage their representations to be invariant. However, due to the inherent properties of user behavior sequences, some augmentation strategies, such as item substitution, can lead to changes in user intent. Learning indiscriminately invariant representations for all augmentation strategies might be suboptimal. Therefore, we propose Equivariant Contrastive Learning for Sequential Recommendation (ECL-SR), which endows SR models with great discriminative power, making the learned user behavior representations sensitive to invasive augmentations (e.g., item substitution) and insensitive to mild augmentations (e.g., featurelevel dropout masking). In detail, we use the conditional discriminator to capture differences in behavior due to item substitution, which e",
    "link": "http://arxiv.org/abs/2211.05290",
    "context": "Title: Equivariant Contrastive Learning for Sequential Recommendation. (arXiv:2211.05290v3 [cs.IR] UPDATED)\nAbstract: Contrastive learning (CL) benefits the training of sequential recommendation models with informative self-supervision signals. Existing solutions apply general sequential data augmentation strategies to generate positive pairs and encourage their representations to be invariant. However, due to the inherent properties of user behavior sequences, some augmentation strategies, such as item substitution, can lead to changes in user intent. Learning indiscriminately invariant representations for all augmentation strategies might be suboptimal. Therefore, we propose Equivariant Contrastive Learning for Sequential Recommendation (ECL-SR), which endows SR models with great discriminative power, making the learned user behavior representations sensitive to invasive augmentations (e.g., item substitution) and insensitive to mild augmentations (e.g., featurelevel dropout masking). In detail, we use the conditional discriminator to capture differences in behavior due to item substitution, which e",
    "path": "papers/22/11/2211.05290.json",
    "total_tokens": 870,
    "translated_title": "序列推荐的等变性对比学习",
    "translated_abstract": "对比学习（CL）通过信息自监督信号有益于训练序列推荐模型。现有的解决方案采用通用的序列数据增强策略生成正样本，并鼓励它们的表示具有不变性。然而，由于用户行为序列的固有特性，一些增强策略（如物品替换）可能导致用户意图的改变。为了避免不选定适所有增强策略的不变表示，我们提出了序列推荐的等变性对比学习（ECL-SR），该方法赋予SR模型强大的区分能力，使学习到的用户行为表示对侵入性增强（如物品替换）敏感并对轻微增强（如特征级丢失遮蔽）不敏感。具体而言，我们使用条件判别器来捕捉由于物品替换而产生的行为差异。",
    "tldr": "本论文提出了序列推荐的等变性对比学习（ECL-SR）方法，通过使用条件判别器来使得学习到的用户行为表示对于侵入性增强敏感并对轻微增强不敏感，从而提高了序列推荐模型的区分能力。",
    "en_tdlr": "This paper proposes Equivariant Contrastive Learning for Sequential Recommendation (ECL-SR) method, which uses a conditional discriminator to make the learned user behavior representations sensitive to invasive augmentations and insensitive to mild augmentations, thereby enhancing the discriminative power of sequential recommendation models."
}