{
    "title": "From Node Interaction to Hop Interaction: New Effective and Scalable Graph Learning Paradigm. (arXiv:2211.11761v2 [cs.LG] UPDATED)",
    "abstract": "Existing Graph Neural Networks (GNNs) follow the message-passing mechanism that conducts information interaction among nodes iteratively. While considerable progress has been made, such node interaction paradigms still have the following limitation. First, the scalability limitation precludes the broad application of GNNs in large-scale industrial settings since the node interaction among rapidly expanding neighbors incurs high computation and memory costs. Second, the over-smoothing problem restricts the discrimination ability of nodes, i.e., node representations of different classes will converge to indistinguishable after repeated node interactions. In this work, we propose a novel hop interaction paradigm to address these limitations simultaneously. The core idea is to convert the interaction target among nodes to pre-processed multi-hop features inside each node. We design a simple yet effective HopGNN framework that can easily utilize existing GNNs to achieve hop interaction. Fur",
    "link": "http://arxiv.org/abs/2211.11761",
    "context": "Title: From Node Interaction to Hop Interaction: New Effective and Scalable Graph Learning Paradigm. (arXiv:2211.11761v2 [cs.LG] UPDATED)\nAbstract: Existing Graph Neural Networks (GNNs) follow the message-passing mechanism that conducts information interaction among nodes iteratively. While considerable progress has been made, such node interaction paradigms still have the following limitation. First, the scalability limitation precludes the broad application of GNNs in large-scale industrial settings since the node interaction among rapidly expanding neighbors incurs high computation and memory costs. Second, the over-smoothing problem restricts the discrimination ability of nodes, i.e., node representations of different classes will converge to indistinguishable after repeated node interactions. In this work, we propose a novel hop interaction paradigm to address these limitations simultaneously. The core idea is to convert the interaction target among nodes to pre-processed multi-hop features inside each node. We design a simple yet effective HopGNN framework that can easily utilize existing GNNs to achieve hop interaction. Fur",
    "path": "papers/22/11/2211.11761.json",
    "total_tokens": 895,
    "translated_title": "从节点交互到跳跃交互：新的高效可扩展的图学习范式",
    "translated_abstract": "存在的图神经网络（GNN）遵循迭代地在节点之间进行信息交互的信息传递机制。然而，这种节点交互范式仍存在可扩展性限制，即在快速扩展的邻居之间进行节点交互会产生高计算和内存开销；以及过度平滑问题，即节点的判别能力受限，重复节点交互后不同类别节点的表示将会收敛到无法区分的状态。本文提出了一种新的跳跃交互范式，以同时解决这些限制。其核心思想是将节点之间的交互目标转换为节点内部经过预处理的多跳特征。我们设计了一个简单而有效的 HopGNN 框架，可以轻松地利用现有的GNN实现跳跃交往。",
    "tldr": "本文提出了一种新的跳跃交互范式，用于解决现有图神经网络（GNN）中存在的可扩展性限制和过度平滑问题。其核心思想是将节点之间的交互目标转换为节点内部经过预处理的多跳特征，并通过HopGNN框架实现跳跃交互。",
    "en_tdlr": "This paper proposes a new hop interaction paradigm to address the scalability limitation and over-smoothing problem in existing Graph Neural Networks (GNNs). The core idea is to convert the interaction target among nodes to pre-processed multi-hop features inside each node, and achieve hop interaction through the simple and effective HopGNN framework."
}