{
    "title": "Deep Curvilinear Editing: Commutative and Nonlinear Image Manipulation for Pretrained Deep Generative Model. (arXiv:2211.14573v2 [cs.CV] UPDATED)",
    "abstract": "Semantic editing of images is the fundamental goal of computer vision. Although deep learning methods, such as generative adversarial networks (GANs), are capable of producing high-quality images, they often do not have an inherent way of editing generated images semantically. Recent studies have investigated a way of manipulating the latent variable to determine the images to be generated. However, methods that assume linear semantic arithmetic have certain limitations in terms of the quality of image editing, whereas methods that discover nonlinear semantic pathways provide non-commutative editing, which is inconsistent when applied in different orders. This study proposes a novel method called deep curvilinear editing (DeCurvEd) to determine semantic commuting vector fields on the latent space. We theoretically demonstrate that owing to commutativity, the editing of multiple attributes depends only on the quantities and not on the order. Furthermore, we experimentally demonstrate th",
    "link": "http://arxiv.org/abs/2211.14573",
    "context": "Title: Deep Curvilinear Editing: Commutative and Nonlinear Image Manipulation for Pretrained Deep Generative Model. (arXiv:2211.14573v2 [cs.CV] UPDATED)\nAbstract: Semantic editing of images is the fundamental goal of computer vision. Although deep learning methods, such as generative adversarial networks (GANs), are capable of producing high-quality images, they often do not have an inherent way of editing generated images semantically. Recent studies have investigated a way of manipulating the latent variable to determine the images to be generated. However, methods that assume linear semantic arithmetic have certain limitations in terms of the quality of image editing, whereas methods that discover nonlinear semantic pathways provide non-commutative editing, which is inconsistent when applied in different orders. This study proposes a novel method called deep curvilinear editing (DeCurvEd) to determine semantic commuting vector fields on the latent space. We theoretically demonstrate that owing to commutativity, the editing of multiple attributes depends only on the quantities and not on the order. Furthermore, we experimentally demonstrate th",
    "path": "papers/22/11/2211.14573.json",
    "total_tokens": 855,
    "translated_title": "深度曲线编辑：针对预训练深度生成模型的可交换和非线性图像编辑",
    "translated_abstract": "图像的语义编辑是计算机视觉的基本目标。尽管深度学习方法，如生成对抗网络（GAN），能够生成高质量的图像，但通常它们不具备对生成的图像进行语义编辑的内在方式。最近的研究探讨了通过操纵潜变量来确定要生成的图像的方法。然而，假设线性语义算术的方法在图像编辑方面具有某些局限性，而发现非线性的语义路径提供了不可交换的编辑，这在以不同的顺序应用时不一致。本研究提出了一种称为深度曲线编辑（DeCurvEd）的新方法，以确定潜空间中的语义交错矢量场。我们从理论上证明，由于可交换性，多个属性的编辑仅取决于数量而不是顺序。此外，我们还通过实验证明了该方法的成功应用。",
    "tldr": "本研究提出了一种名为DeCurvEd的新方法，以可交换的方式确定潜空间中的语义交错矢量场，从而提供了高质量的图像编辑方案。",
    "en_tdlr": "This study proposes a novel method called DeCurvEd to determine semantic commuting vector fields on the latent space in a commutative way, providing high-quality image editing solution."
}