{
    "title": "FED-CD: Federated Causal Discovery from Interventional and Observational Data. (arXiv:2211.03846v3 [cs.LG] UPDATED)",
    "abstract": "Existing causal discovery methods typically require the data to be available in a centralized location. However, many practical domains, such as healthcare, limit access to the data gathered by local entities, primarily for privacy and regulatory constraints. To address this, we propose FED-CD, a federated framework for inferring causal structures from distributed datasets containing observational and interventional data. By exchanging updates instead of data samples, FED-CD ensures privacy while enabling decentralized discovery of the underlying directed acyclic graph (DAG). We accommodate scenarios with shared or disjoint intervened covariates, and mitigate the adverse effects of interventional data heterogeneity. We provide empirical evidence for the performance and scalability of FED-CD for decentralized causal discovery using synthetic and real-world DAGs.",
    "link": "http://arxiv.org/abs/2211.03846",
    "context": "Title: FED-CD: Federated Causal Discovery from Interventional and Observational Data. (arXiv:2211.03846v3 [cs.LG] UPDATED)\nAbstract: Existing causal discovery methods typically require the data to be available in a centralized location. However, many practical domains, such as healthcare, limit access to the data gathered by local entities, primarily for privacy and regulatory constraints. To address this, we propose FED-CD, a federated framework for inferring causal structures from distributed datasets containing observational and interventional data. By exchanging updates instead of data samples, FED-CD ensures privacy while enabling decentralized discovery of the underlying directed acyclic graph (DAG). We accommodate scenarios with shared or disjoint intervened covariates, and mitigate the adverse effects of interventional data heterogeneity. We provide empirical evidence for the performance and scalability of FED-CD for decentralized causal discovery using synthetic and real-world DAGs.",
    "path": "papers/22/11/2211.03846.json",
    "total_tokens": 809,
    "translated_title": "FED-CD：来自干预和观测数据的联合因果发现",
    "translated_abstract": "现有的因果推断方法通常要求数据在集中位置可用。然而，许多实际领域，如医疗保健，限制对局部实体收集的数据的访问，主要是出于隐私和监管限制。为了解决这个问题，我们提出了FED-CD，这是一个联邦框架，用于从包含观测数据和干预数据的分布式数据集中推断因果结构。通过交换更新而不是数据样本，FED-CD确保隐私，同时实现去中心化的发现底层有向无环图（DAG）。我们适应共享或不相交的干预协变量的场景，并减轻干预数据异质性的不良影响。我们提供了使用合成和真实DAG的FED-CD性能和可扩展性的实证证据。",
    "tldr": "FED-CD是一个联邦框架，可以从分布式数据集中推断出因果关系，同时保护隐私，适应共享和不相交的干预协变量的场景，具有可扩展性。",
    "en_tdlr": "FED-CD is a federated framework that infers causal relationships from distributed datasets while protecting privacy and accommodating scenarios with shared or disjoint intervened covariates, demonstrating scalability with empirical evidence using synthetic and real-world DAGs."
}