{
    "title": "Human Biophysics as Network Weights: Conditional Generative Models for Dynamic Simulation. (arXiv:2211.01856v3 [cs.LG] UPDATED)",
    "abstract": "Simulations of biophysical systems are fundamental for studying physiological mechanisms and developing human machine interfaces. Whilst advanced numerical methods, such as finite element models, can excel in this task, they are extremely computationally expensive to use when generating a large number of simulations or simulating dynamic events with continuously changing structural parameters. We propose an architecture that uses a conditional generative model to interpolate between the numerical model states, dramatically lowering the modeling time while maintaining a high generation accuracy. As a demonstration of this concept, we present BioMime, a hybrid-structured generative model that enables an accurate, ultra-fast, and arbitrarily high temporal-resolution simulation of a specific biophysical system during dynamic changes. This methodology has wide applications in physiological and clinical research as well as in supporting data augmentation strategies for signal analysis, repre",
    "link": "http://arxiv.org/abs/2211.01856",
    "context": "Title: Human Biophysics as Network Weights: Conditional Generative Models for Dynamic Simulation. (arXiv:2211.01856v3 [cs.LG] UPDATED)\nAbstract: Simulations of biophysical systems are fundamental for studying physiological mechanisms and developing human machine interfaces. Whilst advanced numerical methods, such as finite element models, can excel in this task, they are extremely computationally expensive to use when generating a large number of simulations or simulating dynamic events with continuously changing structural parameters. We propose an architecture that uses a conditional generative model to interpolate between the numerical model states, dramatically lowering the modeling time while maintaining a high generation accuracy. As a demonstration of this concept, we present BioMime, a hybrid-structured generative model that enables an accurate, ultra-fast, and arbitrarily high temporal-resolution simulation of a specific biophysical system during dynamic changes. This methodology has wide applications in physiological and clinical research as well as in supporting data augmentation strategies for signal analysis, repre",
    "path": "papers/22/11/2211.01856.json",
    "total_tokens": 788,
    "translated_title": "人类生物物理学作为网络权重：用于动态模拟的条件生成模型。",
    "translated_abstract": "生物物理系统的模拟对于研究生理机制和开发人机界面至关重要。虽然先进的数值方法，如有限元模型，在这个任务中表现出色，但是当生成大量模拟或模拟具有连续变化结构参数的动态事件时，它们的计算成本非常高。我们提出了一种使用条件生成模型在数值模型状态之间进行插值的架构，大大降低了建模时间，同时保持高的生成精度。作为这一概念的示范，我们提出了BioMime，一种混合结构生成模型，可以在动态变化期间对特定生物物理系统进行准确、超快速和任意高时间分辨率的模拟。这种方法在生理和临床研究以及支持信号分析的数据增强策略方面具有广泛的应用。",
    "tldr": "提出了一种使用条件生成模型插值的架构，可以在动态模拟中降低建模时间并保持高的生成精度。"
}