{
    "title": "Changing agents and ascribing beliefs in dynamic epistemic logic. (arXiv:2211.02452v3 [cs.AI] UPDATED)",
    "abstract": "In dynamic epistemic logic (Van Ditmarsch, Van Der Hoek, & Kooi, 2008) it is customary to use an action frame (Baltag & Moss, 2004; Baltag, Moss, & Solecki, 1998) to describe different views of a single action. In this article, action frames are extended to add or remove agents, we call these agent-update frames. This can be done selectively so that only some specified agents get information of the update, which can be used to model several interesting examples such as private update and deception, studied earlier by Baltag and Moss (2004); Sakama (2015); Van Ditmarsch, Van Eijck, Sietsma, and Wang (2012). The product update of a Kripke model by an action frame is an abbreviated way of describing the transformed Kripke model which is the result of performing the action. This is substantially extended to a sum-product update of a Kripke model by an agent-update frame in the new setting. These ideas are applied to an AI problem of modelling a story. We show that dynamic epistemic logics,",
    "link": "http://arxiv.org/abs/2211.02452",
    "context": "Title: Changing agents and ascribing beliefs in dynamic epistemic logic. (arXiv:2211.02452v3 [cs.AI] UPDATED)\nAbstract: In dynamic epistemic logic (Van Ditmarsch, Van Der Hoek, & Kooi, 2008) it is customary to use an action frame (Baltag & Moss, 2004; Baltag, Moss, & Solecki, 1998) to describe different views of a single action. In this article, action frames are extended to add or remove agents, we call these agent-update frames. This can be done selectively so that only some specified agents get information of the update, which can be used to model several interesting examples such as private update and deception, studied earlier by Baltag and Moss (2004); Sakama (2015); Van Ditmarsch, Van Eijck, Sietsma, and Wang (2012). The product update of a Kripke model by an action frame is an abbreviated way of describing the transformed Kripke model which is the result of performing the action. This is substantially extended to a sum-product update of a Kripke model by an agent-update frame in the new setting. These ideas are applied to an AI problem of modelling a story. We show that dynamic epistemic logics,",
    "path": "papers/22/11/2211.02452.json",
    "total_tokens": 849,
    "translated_title": "动态认知逻辑中的代理更新与信念归属",
    "translated_abstract": "在动态认知逻辑中，通常使用行动框架来描述单个行动的不同视角。本文将行动框架扩展为添加或删除代理，称之为代理更新框架。可以有选择性地进行代理更新，只有某些指定的代理会获得更新的信息，这可用于模拟一些有趣的例子，如私有更新和欺骗。然后将一个Kripke模型通过代理更新框架的求和积更新进一步扩展，用于建模故事的问题。我们证明了动态认知逻辑对于人工智能问题的应用。",
    "tldr": "本文在动态认知逻辑中扩展了行动框架，提出了代理更新框架，可以有选择性地添加或删除代理，并进行代理更新。这个框架可以用于模拟一些有趣的例子，并在人工智能问题的建模中得到应用。",
    "en_tdlr": "This paper extends action frames in dynamic epistemic logic by introducing agent-update frames which can selectively add or remove agents for agent updates. This framework is used to simulate interesting examples and applied to an AI problem of story modeling."
}