{
    "title": "Who are you referring to? Coreference resolution in image narrations. (arXiv:2211.14563v2 [cs.CV] UPDATED)",
    "abstract": "Coreference resolution aims to identify words and phrases which refer to same entity in a text, a core task in natural language processing. In this paper, we extend this task to resolving coreferences in long-form narrations of visual scenes. First we introduce a new dataset with annotated coreference chains and their bounding boxes, as most existing image-text datasets only contain short sentences without coreferring expressions or labeled chains. We propose a new technique that learns to identify coreference chains using weak supervision, only from image-text pairs and a regularization using prior linguistic knowledge. Our model yields large performance gains over several strong baselines in resolving coreferences. We also show that coreference resolution helps improving grounding narratives in images.",
    "link": "http://arxiv.org/abs/2211.14563",
    "context": "Title: Who are you referring to? Coreference resolution in image narrations. (arXiv:2211.14563v2 [cs.CV] UPDATED)\nAbstract: Coreference resolution aims to identify words and phrases which refer to same entity in a text, a core task in natural language processing. In this paper, we extend this task to resolving coreferences in long-form narrations of visual scenes. First we introduce a new dataset with annotated coreference chains and their bounding boxes, as most existing image-text datasets only contain short sentences without coreferring expressions or labeled chains. We propose a new technique that learns to identify coreference chains using weak supervision, only from image-text pairs and a regularization using prior linguistic knowledge. Our model yields large performance gains over several strong baselines in resolving coreferences. We also show that coreference resolution helps improving grounding narratives in images.",
    "path": "papers/22/11/2211.14563.json",
    "total_tokens": 814,
    "translated_title": "图像叙述中的指代消解：你指的是谁？",
    "translated_abstract": "指代消解的目标是在文本中识别指向同一实体的词语和短语，这是自然语言处理中的一项核心任务。本文将这一任务扩展到长篇视觉场景叙述中的指代消解。首先，我们引入了一个新的数据集，其中注释了指代链及其边界框，因为大多数现有图像-文本数据集仅包含不带指示性表达式或标记链的短句。我们提出了一种新的技术，利用弱监督只从图像-文本对和使用先前的语言知识的正则化来学习识别指代链。我们的模型在解决指代消解方面比几个强基线模型产生了大量的性能提升。我们还展示了指代消解有助于提高图片中的叙述表达能力。",
    "tldr": "本研究介绍了一个新的数据集和技术来解决图像叙述中的指代消解问题，提出的模型在解决这一任务中表现出较强的性能和优势，指代消解有助于提高图片中的叙述表达能力。",
    "en_tdlr": "This research introduces a new dataset and technique for resolving coreferences in long-form visual scene narrations, showing improved grounding of narratives in images. The proposed model achieves strong performance on this task using weak supervision and prior linguistic knowledge regularization."
}