{
    "title": "Security Issuance, Institutional Investors and Quid Pro Quo: Insights from SPACs. (arXiv:2211.16643v3 [q-fin.GN] UPDATED)",
    "abstract": "Security issuance is subject to informational and agency-related frictions. However, it is difficult to separate their effects. We consider SPACs and assess those effects separately. To this end, we identify premium investors who produce value-relevant information: their participation is associated with higher SPAC success and announcement-day returns. Non-premium investors, however, engage only in quid pro quo arrangements. Their high returns today from issuers (quid) mean they are more likely to participate in low-returns future deals initiated by those issuers (quo). Thus quid pro quo is not pure agency cost but partly a transfer that enables more firms to go public.",
    "link": "http://arxiv.org/abs/2211.16643",
    "context": "Title: Security Issuance, Institutional Investors and Quid Pro Quo: Insights from SPACs. (arXiv:2211.16643v3 [q-fin.GN] UPDATED)\nAbstract: Security issuance is subject to informational and agency-related frictions. However, it is difficult to separate their effects. We consider SPACs and assess those effects separately. To this end, we identify premium investors who produce value-relevant information: their participation is associated with higher SPAC success and announcement-day returns. Non-premium investors, however, engage only in quid pro quo arrangements. Their high returns today from issuers (quid) mean they are more likely to participate in low-returns future deals initiated by those issuers (quo). Thus quid pro quo is not pure agency cost but partly a transfer that enables more firms to go public.",
    "path": "papers/22/11/2211.16643.json",
    "total_tokens": 720,
    "translated_title": "SPAC的发行、机构投资者和交换条件：洞察力",
    "translated_abstract": "证券发行受信息和代理成本的影响。然而，很难将它们分开考虑。我们考虑SPAC并分别评估这些影响。为此，我们确定产生价值相关信息的优质投资者：他们的参与与更高的SPAC成功和公告日回报相关。然而，非优质投资者仅参与交换条件安排。他们今天从发行人（优惠）获得高回报，这意味着他们更有可能参与由这些发行人发起的低回报未来交易（条件）。因此，交换条件不是纯代理成本，而是部分使更多的公司上市的转移。",
    "tldr": "SPAC中的优质投资者参与可以创造价值，非优质投资者则仅参与交换条件安排，这不仅仅是代理成本还能使更多公司上市。",
    "en_tdlr": "Premium investors in SPACs participate in value creation, while non-premium investors engage in quid pro quo arrangements, which is not only an agency cost, but also enables more firms to go public."
}