{
    "title": "DriftRec: Adapting diffusion models to blind JPEG restoration. (arXiv:2211.06757v2 [eess.IV] UPDATED)",
    "abstract": "In this work, we utilize the high-fidelity generation abilities of diffusion models to solve blind JPEG restoration at high compression levels. We propose an elegant modification of the forward stochastic differential equation of diffusion models to adapt them to this restoration task and name our method DriftRec. Comparing DriftRec against an $L_2$ regression baseline with the same network architecture and two state-of-the-art techniques for JPEG restoration, we show that our approach can escape the tendency of other methods to generate blurry images, and recovers the distribution of clean images significantly more faithfully. For this, only a dataset of clean/corrupted image pairs and no knowledge about the corruption operation is required, enabling wider applicability to other restoration tasks. In contrast to other conditional and unconditional diffusion models, we utilize the idea that the distributions of clean and corrupted images are much closer to each other than each is to th",
    "link": "http://arxiv.org/abs/2211.06757",
    "context": "Title: DriftRec: Adapting diffusion models to blind JPEG restoration. (arXiv:2211.06757v2 [eess.IV] UPDATED)\nAbstract: In this work, we utilize the high-fidelity generation abilities of diffusion models to solve blind JPEG restoration at high compression levels. We propose an elegant modification of the forward stochastic differential equation of diffusion models to adapt them to this restoration task and name our method DriftRec. Comparing DriftRec against an $L_2$ regression baseline with the same network architecture and two state-of-the-art techniques for JPEG restoration, we show that our approach can escape the tendency of other methods to generate blurry images, and recovers the distribution of clean images significantly more faithfully. For this, only a dataset of clean/corrupted image pairs and no knowledge about the corruption operation is required, enabling wider applicability to other restoration tasks. In contrast to other conditional and unconditional diffusion models, we utilize the idea that the distributions of clean and corrupted images are much closer to each other than each is to th",
    "path": "papers/22/11/2211.06757.json",
    "total_tokens": 942,
    "translated_title": "DriftRec: 将扩散模型应用于盲JPEG恢复",
    "translated_abstract": "本研究利用扩散模型的高保真生成能力，在高压缩水平下解决盲JPEG恢复问题。我们提出了对扩散模型正向随机微分方程的优雅修改，使其适应此恢复任务，并将我们的方法命名为DriftRec。通过将DriftRec与具有相同网络架构的$L_2$回归基线以及两种最先进的JPEG恢复技术进行比较，我们表明我们的方法可以避免其他方法生成模糊图像的倾向，并显著更加真实地恢复了干净图像的分布。为此，只需要一个干净/损坏图像对的数据集，而无需关于损坏操作的任何知识，使得它在其他恢复任务中具有更广泛的适用性。与其他有条件和无条件的扩散模型不同，我们利用了干净图像和损坏图像的分布彼此更接近的观念。",
    "tldr": "DriftRec是一种将扩散模型应用于盲JPEG恢复的方法，通过优雅地修改扩散模型的正向随机微分方程，DriftRec能够在高压缩水平下恢复干净图像的分布，避免生成模糊图像，并且不需要关于损坏操作的先验知识，具有广泛的适用性。",
    "en_tdlr": "DriftRec is a method that applies diffusion models to blind JPEG restoration. By elegantly modifying the forward stochastic differential equation of diffusion models, DriftRec is able to recover the distribution of clean images at high compression levels, avoiding the generation of blurry images, and does not require prior knowledge about the corruption operation, making it widely applicable."
}