{
    "title": "Incorporating Prior Knowledge of Latent Group Structure in Panel Data Models. (arXiv:2211.16714v2 [econ.EM] UPDATED)",
    "abstract": "The assumption of group heterogeneity has become popular in panel data models. We develop a constrained Bayesian grouped estimator that exploits researchers' prior beliefs on groups in a form of pairwise constraints, indicating whether a pair of units is likely to belong to a same group or different groups. We propose a prior to incorporate the pairwise constraints with varying degrees of confidence. The whole framework is built on the nonparametric Bayesian method, which implicitly specifies a distribution over the group partitions, and so the posterior analysis takes the uncertainty of the latent group structure into account. Monte Carlo experiments reveal that adding prior knowledge yields more accurate estimates of coefficient and scores predictive gains over alternative estimators. We apply our method to two empirical applications. In a first application to forecasting U.S. CPI inflation, we illustrate that prior knowledge of groups improves density forecasts when the data is not ",
    "link": "http://arxiv.org/abs/2211.16714",
    "context": "Title: Incorporating Prior Knowledge of Latent Group Structure in Panel Data Models. (arXiv:2211.16714v2 [econ.EM] UPDATED)\nAbstract: The assumption of group heterogeneity has become popular in panel data models. We develop a constrained Bayesian grouped estimator that exploits researchers' prior beliefs on groups in a form of pairwise constraints, indicating whether a pair of units is likely to belong to a same group or different groups. We propose a prior to incorporate the pairwise constraints with varying degrees of confidence. The whole framework is built on the nonparametric Bayesian method, which implicitly specifies a distribution over the group partitions, and so the posterior analysis takes the uncertainty of the latent group structure into account. Monte Carlo experiments reveal that adding prior knowledge yields more accurate estimates of coefficient and scores predictive gains over alternative estimators. We apply our method to two empirical applications. In a first application to forecasting U.S. CPI inflation, we illustrate that prior knowledge of groups improves density forecasts when the data is not ",
    "path": "papers/22/11/2211.16714.json",
    "total_tokens": 1010,
    "translated_title": "将潜在组结构的先验知识纳入面板数据模型中",
    "translated_abstract": "组异质性假设已经成为面板数据模型中的研究热点。本文提出了一种受限制的贝叶斯分组估计器，利用研究人员对组的先验信念以两两约束的形式进行表达，表明一对单位是否可能属于同一组或不同组。我们提出了一种先验方法，用不同程度的置信度来纳入两两约束。整个框架建立在非参数贝叶斯方法上，隐含地指定了对组分区的分布，因此后验分析考虑了潜在的组结构的不确定性。蒙特卡罗实验显示，加入先验知识可以得到更准确的系数估计，并且比替代估计器获得更多的预测增益分数。我们应用了我们的方法到两个经验应用中。在第一个预测美国CPI通货膨胀率的应用中，我们证明了组的先验知识可以在数据不充足时提高密度预测。",
    "tldr": "本文提出了一种受限制的贝叶斯分组估计器，通过利用研究人员对组的先验信念以两两约束的形式进行表达，将潜在组结构的先验知识纳入到面板数据模型中。蒙特卡罗实验显示，加入先验知识可以得到更准确的系数估计，并且比替代估计器获得更多的预测增益分数。我们应用了我们的方法到两个经验应用中。",
    "en_tdlr": "This paper proposes a constrained Bayesian grouped estimator that incorporates researchers' prior beliefs on group structure as pairwise constraints, and applies it to panel data models. Monte Carlo experiments show that incorporating prior knowledge improves coefficient estimates and predictive gains. Two empirical applications demonstrate the effectiveness of the method."
}