{
    "title": "Representations of Domains via CF-approximation Spaces. (arXiv:2211.17099v2 [math.RA] UPDATED)",
    "abstract": "Representations of domains mean in a general way representing a domain as a suitable family endowed with set-inclusion order of some mathematical structures. In this paper, representations of domains via CF-approximation spaces are considered. Concepts of CF-approximation spaces and CF-closed sets are introduced. It is proved that the family of CF-closed sets in a CF-approximation space endowed with set-inclusion order is a continuous domain and that every continuous domain is isomorphic to the family of CF-closed sets of some CF-approximation space endowed with set-inclusion order. The concept of CF-approximable relations is introduced using a categorical approach, which later facilitates the proof that the category of CF-approximation spaces and CF-approximable relations is equivalent to that of continuous domains and Scott continuous maps.",
    "link": "http://arxiv.org/abs/2211.17099",
    "context": "Title: Representations of Domains via CF-approximation Spaces. (arXiv:2211.17099v2 [math.RA] UPDATED)\nAbstract: Representations of domains mean in a general way representing a domain as a suitable family endowed with set-inclusion order of some mathematical structures. In this paper, representations of domains via CF-approximation spaces are considered. Concepts of CF-approximation spaces and CF-closed sets are introduced. It is proved that the family of CF-closed sets in a CF-approximation space endowed with set-inclusion order is a continuous domain and that every continuous domain is isomorphic to the family of CF-closed sets of some CF-approximation space endowed with set-inclusion order. The concept of CF-approximable relations is introduced using a categorical approach, which later facilitates the proof that the category of CF-approximation spaces and CF-approximable relations is equivalent to that of continuous domains and Scott continuous maps.",
    "path": "papers/22/11/2211.17099.json",
    "total_tokens": 912,
    "translated_title": "通过CF-逼近空间的表示领域",
    "translated_abstract": "领域的表示通常指将领域表示为一些含有某些数学结构的适当族，该族带有集合包含顺序。本文研究了通过CF-逼近空间的表示领域。介绍了CF-逼近空间和CF闭集的概念，证明了在带有集合包含顺序的CF-逼近空间中，CF闭集族是连续领域，而且每个连续领域都与某个带有集合包含顺序的CF-逼近空间的CF闭集族同构。使用范畴论的方法引入了CF-可逼近关系的概念，这后来有助于证明CF-逼近空间和CF-可逼近关系的范畴等同于连续领域和Scott连续映射的范畴。",
    "tldr": "本文研究了通过CF-逼近空间的表示领域，介绍了CF-逼近空间和CF闭集的概念，并且证明了CF-逼近空间中的CF闭集族是连续领域，使用范畴论的方法，证明了CF-逼近空间和CF-可逼近关系的范畴与连续领域和Scott连续映射的范畴等同。"
}