{
    "title": "An Advantage Using Feature Selection with a Quantum Annealer. (arXiv:2211.09756v4 [quant-ph] UPDATED)",
    "abstract": "Feature selection is a technique in statistical prediction modeling that identifies features in a record with a strong statistical connection to the target variable. Excluding features with a weak statistical connection to the target variable in training not only drops the dimension of the data, which decreases the time complexity of the algorithm, it also decreases noise within the data which assists in avoiding overfitting. In all, feature selection assists in training a robust statistical model that performs well and is stable. Given the lack of scalability in classical computation, current techniques only consider the predictive power of the feature and not redundancy between the features themselves. Recent advancements in feature selection that leverages quantum annealing (QA) gives a scalable technique that aims to maximize the predictive power of the features while minimizing redundancy. As a consequence, it is expected that this algorithm would assist in the bias/variance trade",
    "link": "http://arxiv.org/abs/2211.09756",
    "context": "Title: An Advantage Using Feature Selection with a Quantum Annealer. (arXiv:2211.09756v4 [quant-ph] UPDATED)\nAbstract: Feature selection is a technique in statistical prediction modeling that identifies features in a record with a strong statistical connection to the target variable. Excluding features with a weak statistical connection to the target variable in training not only drops the dimension of the data, which decreases the time complexity of the algorithm, it also decreases noise within the data which assists in avoiding overfitting. In all, feature selection assists in training a robust statistical model that performs well and is stable. Given the lack of scalability in classical computation, current techniques only consider the predictive power of the feature and not redundancy between the features themselves. Recent advancements in feature selection that leverages quantum annealing (QA) gives a scalable technique that aims to maximize the predictive power of the features while minimizing redundancy. As a consequence, it is expected that this algorithm would assist in the bias/variance trade",
    "path": "papers/22/11/2211.09756.json",
    "total_tokens": 854,
    "translated_title": "一种利用量子退火器进行特征选择的优势",
    "translated_abstract": "特征选择是一种在统计预测建模中使用的技术，它确定一条记录中与目标变量有强统计关联的特征。在训练中排除与目标变量没有强关联的特征不仅降低了数据的维度，从而减少了算法的时空复杂度，还减少了数据中的噪声，有助于避免过拟合。总之，特征选择有助于训练出性能优异且稳定的统计模型。鉴于经典计算的缺乏可扩展性，当前的技术仅考虑特征的预测能力，而不考虑特征自身之间的冗余性。利用量子退火(QA) 的特征选择近期有所进展，可以提供一种可扩展的技术，旨在尽可能地提高特征的预测能力，同时最小化冗余性。因此，预计该算法将有助于进行bias/variance的平衡，使预测更准确。",
    "tldr": "利用量子退火器进行特征选择的这种技术，可以尽可能提高特征的预测能力，同时最小化冗余性，使数据处理更准确且有效。",
    "en_tdlr": "Using quantum annealing for feature selection offers a scalable technique that focuses on maximizing the predictive power of features while minimizing redundancy, leading to more accurate and efficient data processing."
}