{
    "title": "Seamful XAI: Operationalizing Seamful Design in Explainable AI",
    "abstract": "arXiv:2211.06753v2 Announce Type: replace-cross  Abstract: Mistakes in AI systems are inevitable, arising from both technical limitations and sociotechnical gaps. While black-boxing AI systems can make the user experience seamless, hiding the seams risks disempowering users to mitigate fallouts from AI mistakes. Instead of hiding these AI imperfections, can we leverage them to help the user? While Explainable AI (XAI) has predominantly tackled algorithmic opaqueness, we propose that seamful design can foster AI explainability by revealing and leveraging sociotechnical and infrastructural mismatches. We introduce the concept of Seamful XAI by (1) conceptually transferring \"seams\" to the AI context and (2) developing a design process that helps stakeholders anticipate and design with seams. We explore this process with 43 AI practitioners and real end-users, using a scenario-based co-design activity informed by real-world use cases. We found that the Seamful XAI design process helped use",
    "link": "https://arxiv.org/abs/2211.06753",
    "context": "Title: Seamful XAI: Operationalizing Seamful Design in Explainable AI\nAbstract: arXiv:2211.06753v2 Announce Type: replace-cross  Abstract: Mistakes in AI systems are inevitable, arising from both technical limitations and sociotechnical gaps. While black-boxing AI systems can make the user experience seamless, hiding the seams risks disempowering users to mitigate fallouts from AI mistakes. Instead of hiding these AI imperfections, can we leverage them to help the user? While Explainable AI (XAI) has predominantly tackled algorithmic opaqueness, we propose that seamful design can foster AI explainability by revealing and leveraging sociotechnical and infrastructural mismatches. We introduce the concept of Seamful XAI by (1) conceptually transferring \"seams\" to the AI context and (2) developing a design process that helps stakeholders anticipate and design with seams. We explore this process with 43 AI practitioners and real end-users, using a scenario-based co-design activity informed by real-world use cases. We found that the Seamful XAI design process helped use",
    "path": "papers/22/11/2211.06753.json",
    "total_tokens": 854,
    "translated_title": "Seamful XAI: 将无缝设计运用于可解释人工智能",
    "translated_abstract": "人工智能系统中的错误是不可避免的，这些错误既来自技术限制，也来自社会技术差距。虽然将AI系统设为黑匣子可以使用户体验更流畅，但隐藏接缝会使用户失去减轻AI错误后果的能力。我们提出，可以利用这些AI不完美来帮助用户，而不是将其隐藏起来。虽然可解释人工智能（XAI）主要解决了算法不透明性，但我们认为通过揭示和利用社会技术和基础设施不匹配，无缝设计可以促进AI可解释性。我们引入了Seamful XAI的概念，通过（1）将“接缝”概念转移到AI背景下和（2）开发帮助利益相关者预见和设计接缝的设计过程。我们将这一过程与43名AI从业者和真实终端用户一起探讨，使用基于场景的协同设计活动，并根据现实用例进行信息。我们发现，Seamful XAI设计过程有助于使用",
    "tldr": "通过揭示和利用社会技术和基础设施不匹配，无缝设计可以促进AI可解释性"
}