{
    "title": "OverFlow: Putting flows on top of neural transducers for better TTS. (arXiv:2211.06892v2 [eess.AS] UPDATED)",
    "abstract": "Neural HMMs are a type of neural transducer recently proposed for sequence-to-sequence modelling in text-to-speech. They combine the best features of classic statistical speech synthesis and modern neural TTS, requiring less data and fewer training updates, and are less prone to gibberish output caused by neural attention failures. In this paper, we combine neural HMM TTS with normalising flows for describing the highly non-Gaussian distribution of speech acoustics. The result is a powerful, fully probabilistic model of durations and acoustics that can be trained using exact maximum likelihood. Experiments show that a system based on our proposal needs fewer updates than comparable methods to produce accurate pronunciations and a subjective speech quality close to natural speech. Please see https://shivammehta25.github.io/OverFlow/ for audio examples and code.",
    "link": "http://arxiv.org/abs/2211.06892",
    "context": "Title: OverFlow: Putting flows on top of neural transducers for better TTS. (arXiv:2211.06892v2 [eess.AS] UPDATED)\nAbstract: Neural HMMs are a type of neural transducer recently proposed for sequence-to-sequence modelling in text-to-speech. They combine the best features of classic statistical speech synthesis and modern neural TTS, requiring less data and fewer training updates, and are less prone to gibberish output caused by neural attention failures. In this paper, we combine neural HMM TTS with normalising flows for describing the highly non-Gaussian distribution of speech acoustics. The result is a powerful, fully probabilistic model of durations and acoustics that can be trained using exact maximum likelihood. Experiments show that a system based on our proposal needs fewer updates than comparable methods to produce accurate pronunciations and a subjective speech quality close to natural speech. Please see https://shivammehta25.github.io/OverFlow/ for audio examples and code.",
    "path": "papers/22/11/2211.06892.json",
    "total_tokens": 837,
    "translated_title": "OverFlow：在神经转录器上叠加流来提高TTS效果",
    "translated_abstract": "神经HMM是一种最近提出的神经转录器，用于文本到语音的序列模型。它们结合了经典的统计语音合成和现代的神经TTS的最佳特性，需要更少的数据和较少的训练更新，并且不容易出现由于神经注意力失败导致的无意义输出。在本文中，我们将神经HMM TTS与归一化流相结合，用于描述语音声学的高度非高斯分布。结果是一个强大而全面的概率模型，可以使用准确的最大似然进行训练。实验表明，基于我们的提议的系统需要比可比方法更少的更新，以产生准确的发音和接近自然语音的主观语音质量。请参见https://shivammehta25.github.io/OverFlow/获取音频示例和代码。",
    "tldr": "本论文将神经HMM TTS与归一化流相结合，提出了一种强大而全面的概率模型，需要的数据更少，训练更新更少，发音准确性高，主观语音质量接近自然语音。",
    "en_tdlr": "This paper proposes a powerful and comprehensive probabilistic model that combines neural HMM TTS with normalizing flows to achieve less data and fewer training updates, high accuracy in pronunciation, and subjective speech quality close to natural speech."
}