{
    "title": "Graph Filters for Signal Processing and Machine Learning on Graphs",
    "abstract": "arXiv:2211.08854v2 Announce Type: replace-cross  Abstract: Filters are fundamental in extracting information from data. For time series and image data that reside on Euclidean domains, filters are the crux of many signal processing and machine learning techniques, including convolutional neural networks. Increasingly, modern data also reside on networks and other irregular domains whose structure is better captured by a graph. To process and learn from such data, graph filters account for the structure of the underlying data domain. In this article, we provide a comprehensive overview of graph filters, including the different filtering categories, design strategies for each type, and trade-offs between different types of graph filters. We discuss how to extend graph filters into filter banks and graph neural networks to enhance the representational power; that is, to model a broader variety of signal classes, data patterns, and relationships. We also showcase the fundamental role of gr",
    "link": "https://arxiv.org/abs/2211.08854",
    "context": "Title: Graph Filters for Signal Processing and Machine Learning on Graphs\nAbstract: arXiv:2211.08854v2 Announce Type: replace-cross  Abstract: Filters are fundamental in extracting information from data. For time series and image data that reside on Euclidean domains, filters are the crux of many signal processing and machine learning techniques, including convolutional neural networks. Increasingly, modern data also reside on networks and other irregular domains whose structure is better captured by a graph. To process and learn from such data, graph filters account for the structure of the underlying data domain. In this article, we provide a comprehensive overview of graph filters, including the different filtering categories, design strategies for each type, and trade-offs between different types of graph filters. We discuss how to extend graph filters into filter banks and graph neural networks to enhance the representational power; that is, to model a broader variety of signal classes, data patterns, and relationships. We also showcase the fundamental role of gr",
    "path": "papers/22/11/2211.08854.json",
    "total_tokens": 834,
    "translated_title": "图滤波器在图信号处理和机器学习中的应用",
    "translated_abstract": "滤波器在从数据中提取信息中起着基础作用。对于存在于欧氏域上的时间序列和图像数据，滤波器是许多信号处理和机器学习技术的关键，包括卷积神经网络。越来越多的现代数据存在于网络和其他不规则域，其结构更适合用图表示。为了处理和学习这些数据，图滤波器考虑了底层数据域的结构。在本文中，我们全面介绍了图滤波器，包括不同的滤波器类别，每种类型的设计策略，以及不同类型图滤波器之间的权衡。我们讨论如何将图滤波器扩展到滤波器组和图神经网络，以增强表示能力；也就是说，模拟更广泛的信号类、数据模式和关系。我们还展示了图滤波器在提高表征能力方面的基本作用",
    "tldr": "图滤波器是为处理和学习网络和其他不规则域数据而设计的，可以增强表示能力以模拟更广泛的信号类、数据模式和关系。",
    "en_tdlr": "Graph filters are designed for processing and learning from data on networks and other irregular domains, enhancing representational power to model a broader variety of signal classes, data patterns, and relationships."
}