{
    "title": "Optimal Privacy Preserving for Federated Learning in Mobile Edge Computing. (arXiv:2211.07166v2 [cs.LG] UPDATED)",
    "abstract": "Federated Learning (FL) with quantization and deliberately added noise over wireless networks is a promising approach to preserve user differential privacy (DP) while reducing wireless resources. Specifically, an FL process can be fused with quantized Binomial mechanism-based updates contributed by multiple users. However, optimizing quantization parameters, communication resources (e.g., transmit power, bandwidth, and quantization bits), and the added noise to guarantee the DP requirement and performance of the learned FL model remains an open and challenging problem. This article aims to jointly optimize the quantization and Binomial mechanism parameters and communication resources to maximize the convergence rate under the constraints of the wireless network and DP requirement. To that end, we first derive a novel DP budget estimation of the FL with quantization/noise that is tighter than the state-of-the-art bound. We then provide a theoretical bound on the convergence rate. This t",
    "link": "http://arxiv.org/abs/2211.07166",
    "context": "Title: Optimal Privacy Preserving for Federated Learning in Mobile Edge Computing. (arXiv:2211.07166v2 [cs.LG] UPDATED)\nAbstract: Federated Learning (FL) with quantization and deliberately added noise over wireless networks is a promising approach to preserve user differential privacy (DP) while reducing wireless resources. Specifically, an FL process can be fused with quantized Binomial mechanism-based updates contributed by multiple users. However, optimizing quantization parameters, communication resources (e.g., transmit power, bandwidth, and quantization bits), and the added noise to guarantee the DP requirement and performance of the learned FL model remains an open and challenging problem. This article aims to jointly optimize the quantization and Binomial mechanism parameters and communication resources to maximize the convergence rate under the constraints of the wireless network and DP requirement. To that end, we first derive a novel DP budget estimation of the FL with quantization/noise that is tighter than the state-of-the-art bound. We then provide a theoretical bound on the convergence rate. This t",
    "path": "papers/22/11/2211.07166.json",
    "total_tokens": 872,
    "translated_title": "移动边缘计算环境下联邦学习的最优隐私保护",
    "translated_abstract": "在无线网络上，采用量化和有意添加的噪声的联邦学习是一种有前途的方法，可以保护用户的差分隐私，同时减少无线资源的使用。具体而言，联邦学习过程可以与来自多个用户的基于二项机制的量化更新进行融合。但是，优化量化参数，通信资源（例如传输功率、带宽和量化比特）以及添加的噪声，以保证DP要求和学习的FL模型的性能仍然是一个开放且具有挑战性的问题。本文旨在联合优化量化和二项机制参数以及通信资源，以在无线网络和DP要求的约束下最大化收敛速度。为此，我们首先推导了FL与量化/噪声的DP预算估计，该估计比现有的上界更紧。然后，我们提供了收敛速度的理论界限。",
    "tldr": "本文介绍了一种在移动边缘计算环境下最优隐私保护的联邦学习方法，通过联合优化量化和二项机制参数以及通信资源，最大化收敛速度并保证DP要求。",
    "en_tdlr": "This article presents an optimal privacy-preserving federated learning method in mobile edge computing environment, which optimizes quantization parameters, Binomial mechanism parameters and communication resources to achieve maximum convergence rate while preserving differential privacy."
}