{
    "title": "Orthogonal Polynomials Approximation Algorithm (OPAA):a functional analytic approach to estimating probability densities. (arXiv:2211.08594v3 [cs.LG] UPDATED)",
    "abstract": "We present the new Orthogonal Polynomials Approximation Algorithm (OPAA), a parallelizable algorithm that estimates probability distributions using functional analytic approach: first, it finds a smooth functional estimate of the probability distribution, whether it is normalized or not; second, the algorithm provides an estimate of the normalizing weight; and third, the algorithm proposes a new computation scheme to compute such estimates.  A core component of OPAA is a special transform of the square root of the joint distribution into a special functional space of our construct. Through this transform, the evidence is equated with the $L^2$ norm of the transformed function, squared. Hence, the evidence can be estimated by the sum of squares of the transform coefficients. Computations can be parallelized and completed in one pass.  OPAA can be applied broadly to the estimation of probability density functions. In Bayesian problems, it can be applied to estimating the normalizing weig",
    "link": "http://arxiv.org/abs/2211.08594",
    "context": "Title: Orthogonal Polynomials Approximation Algorithm (OPAA):a functional analytic approach to estimating probability densities. (arXiv:2211.08594v3 [cs.LG] UPDATED)\nAbstract: We present the new Orthogonal Polynomials Approximation Algorithm (OPAA), a parallelizable algorithm that estimates probability distributions using functional analytic approach: first, it finds a smooth functional estimate of the probability distribution, whether it is normalized or not; second, the algorithm provides an estimate of the normalizing weight; and third, the algorithm proposes a new computation scheme to compute such estimates.  A core component of OPAA is a special transform of the square root of the joint distribution into a special functional space of our construct. Through this transform, the evidence is equated with the $L^2$ norm of the transformed function, squared. Hence, the evidence can be estimated by the sum of squares of the transform coefficients. Computations can be parallelized and completed in one pass.  OPAA can be applied broadly to the estimation of probability density functions. In Bayesian problems, it can be applied to estimating the normalizing weig",
    "path": "papers/22/11/2211.08594.json",
    "total_tokens": 942,
    "translated_title": "正交多项式逼近算法（OPAA）：一种用于估计概率密度的功能分析方法",
    "translated_abstract": "我们提出了一种新的正交多项式逼近算法（OPAA），这是一种可并行化的算法，使用功能分析方法估计概率分布：首先，它找到了概率分布的平滑函数估计，无论它是否归一化；其次，算法提供了归一化权重的估计；第三，算法提出了一种新的计算方案来计算这些估计值。OPAA的核心组成部分是将联合分布的平方根转化为我们构造的特殊函数空间的特殊变换。通过这个变换，证据等于转换函数的$L^2$范数的平方。因此，可以通过转换系数的平方和来估计证据。计算可以并行化并在一次通过中完成。OPAA可以广泛应用于概率密度函数的估计。在贝叶斯问题中，它可以用于估计归一化权重。",
    "tldr": "OPAA是一种功能分析方法的算法，通过找到平滑的概率分布函数估计值、计算归一化权重的估计值，并使用特殊的函数空间转换来估计证据，实现了并行计算的一次通过。它适用于估计概率密度函数，尤其在贝叶斯问题中估计归一化权重。",
    "en_tdlr": "OPAA is an algorithm based on functional analysis that estimates probability density functions by finding smooth probability distribution function estimates, calculating estimates of normalizing weights, and using the transformation of a special function space to estimate evidence. It enables parallel computation in one pass and is applicable for estimating probability density functions, particularly in Bayesian problems for estimating normalizing weights."
}