{
    "title": "Interpretable Dimensionality Reduction by Feature Preserving Manifold Approximation and Projection",
    "abstract": "arXiv:2211.09321v2 Announce Type: replace-cross  Abstract: Nonlinear dimensionality reduction lacks interpretability due to the absence of source features in low-dimensional embedding space. We propose an interpretable method featMAP to preserve source features by tangent space embedding. The core of our proposal is to utilize local singular value decomposition (SVD) to approximate the tangent space which is embedded to low-dimensional space by maintaining the alignment. Based on the embedding tangent space, featMAP enables the interpretability by locally demonstrating the source features and feature importance. Furthermore, featMAP embeds the data points by anisotropic projection to preserve the local similarity and original density. We apply featMAP to interpreting digit classification, object detection and MNIST adversarial examples. FeatMAP uses source features to explicitly distinguish the digits and objects and to explain the misclassification of adversarial examples. We also com",
    "link": "https://arxiv.org/abs/2211.09321",
    "context": "Title: Interpretable Dimensionality Reduction by Feature Preserving Manifold Approximation and Projection\nAbstract: arXiv:2211.09321v2 Announce Type: replace-cross  Abstract: Nonlinear dimensionality reduction lacks interpretability due to the absence of source features in low-dimensional embedding space. We propose an interpretable method featMAP to preserve source features by tangent space embedding. The core of our proposal is to utilize local singular value decomposition (SVD) to approximate the tangent space which is embedded to low-dimensional space by maintaining the alignment. Based on the embedding tangent space, featMAP enables the interpretability by locally demonstrating the source features and feature importance. Furthermore, featMAP embeds the data points by anisotropic projection to preserve the local similarity and original density. We apply featMAP to interpreting digit classification, object detection and MNIST adversarial examples. FeatMAP uses source features to explicitly distinguish the digits and objects and to explain the misclassification of adversarial examples. We also com",
    "path": "papers/22/11/2211.09321.json",
    "total_tokens": 821,
    "translated_title": "可解释的特征保留流形逼近与投影的降维方法",
    "translated_abstract": "非线性降维由于低维嵌入空间中缺少源特征而缺乏可解释性。我们提出了一种名为featMAP的可解释方法，通过切线空间嵌入来保留源特征。我们的提议的核心是利用局部奇异值分解（SVD）来逼近切线空间，并通过保持对齐将其嵌入到低维空间中。基于嵌入的切线空间，featMAP通过局部展示源特征和特征重要性实现了可解释性。此外，featMAP通过各向异性投影将数据点嵌入以保留局部相似性和原始密度。我们将featMAP应用于解释数字分类、目标检测和MNIST对抗样本。FeatMAP利用源特征明确区分数字和对象，并解释对抗样本的误分类。",
    "tldr": "featMAP方法通过保留源特征，利用切线空间嵌入和各向异性投影实现了可解释的降维，能够有效解释数字分类、目标检测和对抗样本的误分类。",
    "en_tdlr": "featMAP method achieves interpretable dimensionality reduction by preserving source features, utilizing tangent space embedding and anisotropic projection, enabling effective explanations for digit classification, object detection, and misclassification of adversarial examples."
}