{
    "title": "Model Based Residual Policy Learning with Applications to Antenna Control. (arXiv:2211.08796v3 [cs.LG] UPDATED)",
    "abstract": "Non-differentiable controllers and rule-based policies are widely used for controlling real systems such as telecommunication networks and robots. Specifically, parameters of mobile network base station antennas can be dynamically configured by these policies to improve users coverage and quality of service. Motivated by the antenna tilt control problem, we introduce Model-Based Residual Policy Learning (MBRPL), a practical reinforcement learning (RL) method. MBRPL enhances existing policies through a model-based approach, leading to improved sample efficiency and a decreased number of interactions with the actual environment when compared to off-the-shelf RL methods.To the best of our knowledge, this is the first paper that examines a model-based approach for antenna control. Experimental results reveal that our method delivers strong initial performance while improving sample efficiency over previous RL methods, which is one step towards deploying these algorithms in real networks.",
    "link": "http://arxiv.org/abs/2211.08796",
    "context": "Title: Model Based Residual Policy Learning with Applications to Antenna Control. (arXiv:2211.08796v3 [cs.LG] UPDATED)\nAbstract: Non-differentiable controllers and rule-based policies are widely used for controlling real systems such as telecommunication networks and robots. Specifically, parameters of mobile network base station antennas can be dynamically configured by these policies to improve users coverage and quality of service. Motivated by the antenna tilt control problem, we introduce Model-Based Residual Policy Learning (MBRPL), a practical reinforcement learning (RL) method. MBRPL enhances existing policies through a model-based approach, leading to improved sample efficiency and a decreased number of interactions with the actual environment when compared to off-the-shelf RL methods.To the best of our knowledge, this is the first paper that examines a model-based approach for antenna control. Experimental results reveal that our method delivers strong initial performance while improving sample efficiency over previous RL methods, which is one step towards deploying these algorithms in real networks.",
    "path": "papers/22/11/2211.08796.json",
    "total_tokens": 914,
    "translated_title": "基于模型的残差策略学习及其在天线控制中的应用",
    "translated_abstract": "非可微控制器和基于规则的策略广泛应用于控制诸如电信网络和机器人等实际系统。特别是，移动网络基站天线的参数可以通过这些策略进行动态配置，以改善用户覆盖率和服务质量。受天线倾斜控制问题的启发，我们引入了一种实用的强化学习方法——基于模型的残差策略学习（MBRPL）。MBRPL通过基于模型的方法增强现有策略，提高样本效率，并与现成的强化学习方法相比减少与实际环境的交互次数。据我们所知，这是第一篇研究基于模型的天线控制方法的论文。实验结果表明，我们的方法在初始性能方面表现出色，并提高了样本效率，这是将这些算法应用于实际网络的一步。",
    "tldr": "本文介绍了一种基于模型的残差策略学习（MBRPL）方法，用于解决天线控制问题。该方法通过增强现有策略，提高了样本效率，并减少了与实际环境的交互次数。实验结果表明，该方法在初始性能方面表现出色，并为将这些算法应用于实际网络迈出了一步。"
}