{
    "title": "Mathematically Modeling the Lexicon Entropy of Emergent Language. (arXiv:2211.15783v2 [cs.CL] UPDATED)",
    "abstract": "We formulate a stochastic process, FiLex, as a mathematical model of lexicon entropy in deep learning-based emergent language systems. Defining a model mathematically allows it to generate clear predictions which can be directly and decisively tested. We empirically verify across four different environments that FiLex predicts the correct correlation between hyperparameters (training steps, lexicon size, learning rate, rollout buffer size, and Gumbel-Softmax temperature) and the emergent language's entropy in 20 out of 20 environment-hyperparameter combinations. Furthermore, our experiments reveal that different environments show diverse relationships between their hyperparameters and entropy which demonstrates the need for a model which can make well-defined predictions at a precise level of granularity.",
    "link": "http://arxiv.org/abs/2211.15783",
    "context": "Title: Mathematically Modeling the Lexicon Entropy of Emergent Language. (arXiv:2211.15783v2 [cs.CL] UPDATED)\nAbstract: We formulate a stochastic process, FiLex, as a mathematical model of lexicon entropy in deep learning-based emergent language systems. Defining a model mathematically allows it to generate clear predictions which can be directly and decisively tested. We empirically verify across four different environments that FiLex predicts the correct correlation between hyperparameters (training steps, lexicon size, learning rate, rollout buffer size, and Gumbel-Softmax temperature) and the emergent language's entropy in 20 out of 20 environment-hyperparameter combinations. Furthermore, our experiments reveal that different environments show diverse relationships between their hyperparameters and entropy which demonstrates the need for a model which can make well-defined predictions at a precise level of granularity.",
    "path": "papers/22/11/2211.15783.json",
    "total_tokens": 800,
    "translated_title": "数学建模深度学习新兴语言系统的词汇熵",
    "translated_abstract": "本文提出了一种随机过程 FiLex 作为深度学习新兴语言系统中词汇熵的数学模型。通过将模型进行数学定义，可以产生清晰的预测并直接予以验证。我们在四个不同环境下进行了验证测试，证明 FiLex 可以以20个组合中的20个组合正确预测超参数(训练步数、词汇库大小、学习率、回溯缓存大小和 Gumbel-Softmax温度)与新兴语言熵之间的相关性。此外，我们的实验表明不同环境之间的超参数与熵之间的关系是各异的，这表明需要一种可以在精确的粒度水平上进行明确定义的模型进行预测。",
    "tldr": "本文提出了一种随机过程 FiLex 作为深度学习新兴语言系统中词汇熵的数学模型，该模型可以正确预测超参数与新兴语言熵之间的相关性，为研究新兴语言带来新的方法。",
    "en_tdlr": "This paper proposes a stochastic process FiLex as a mathematical model of the lexicon entropy in deep learning-based emergent language systems, which can predict the correlation between hyperparameters and the emergent language's entropy correctly. This model brings new methods to study emergent languages."
}