{
    "title": "Enhanced Bayesian Neural Networks for Macroeconomics and Finance. (arXiv:2211.04752v3 [econ.EM] UPDATED)",
    "abstract": "We develop Bayesian neural networks (BNNs) that permit to model generic nonlinearities and time variation for (possibly large sets of) macroeconomic and financial variables. From a methodological point of view, we allow for a general specification of networks that can be applied to either dense or sparse datasets, and combines various activation functions, a possibly very large number of neurons, and stochastic volatility (SV) for the error term. From a computational point of view, we develop fast and efficient estimation algorithms for the general BNNs we introduce. From an empirical point of view, we show both with simulated data and with a set of common macro and financial applications that our BNNs can be of practical use, particularly so for observations in the tails of the cross-sectional or time series distributions of the target variables, which makes the method particularly informative for policy making in uncommon times.",
    "link": "http://arxiv.org/abs/2211.04752",
    "context": "Title: Enhanced Bayesian Neural Networks for Macroeconomics and Finance. (arXiv:2211.04752v3 [econ.EM] UPDATED)\nAbstract: We develop Bayesian neural networks (BNNs) that permit to model generic nonlinearities and time variation for (possibly large sets of) macroeconomic and financial variables. From a methodological point of view, we allow for a general specification of networks that can be applied to either dense or sparse datasets, and combines various activation functions, a possibly very large number of neurons, and stochastic volatility (SV) for the error term. From a computational point of view, we develop fast and efficient estimation algorithms for the general BNNs we introduce. From an empirical point of view, we show both with simulated data and with a set of common macro and financial applications that our BNNs can be of practical use, particularly so for observations in the tails of the cross-sectional or time series distributions of the target variables, which makes the method particularly informative for policy making in uncommon times.",
    "path": "papers/22/11/2211.04752.json",
    "total_tokens": 869,
    "translated_title": "增强贝叶斯神经网络在宏观经济和金融领域的应用",
    "translated_abstract": "我们开发了贝叶斯神经网络 (BNNs)，它们能够模拟可能包含大量宏观经济和金融变量的通用非线性和时间变化。从方法论上讲，我们允许对网络进行一般规格的说明，可以应用于密集或稀疏数据集，并结合各种激活功能、可能非常多的神经元和误差项的随机波动。从计算的角度来看，我们为引入的通用BNNs开发了快速高效的估计算法。从实证的角度来看，我们用模拟数据和一组常见的宏观金融应用来展示我们的BNNs可以实际使用，特别是对于观测目标变量的横截面或时间序列分布的尾部，该方法特别适用于在不寻常的时间做出决策方面具有信息量。",
    "tldr": "该论文提出的增强贝叶斯神经网络能够模拟大量宏观经济和金融变量的通用非线性和时间变化，具有潜在的政策决策应用价值。",
    "en_tdlr": "The paper proposes enhanced Bayesian neural networks that can model generic nonlinearities and time variation for possibly large sets of macroeconomic and financial variables. It introduces general specification of networks and fast and efficient estimation algorithms. The method is particularly informative for policy making in uncommon times."
}