{
    "title": "Approximating Intersections and Differences Between Linear Statistical Shape Models Using Markov Chain Monte Carlo. (arXiv:2211.16314v2 [cs.CV] UPDATED)",
    "abstract": "To date, the comparison of Statistical Shape Models (SSMs) is often solely performance-based, carried out by means of simplistic metrics such as compactness, generalization, or specificity. Any similarities or differences between the actual shape spaces can neither be visualized nor quantified. In this paper, we present a new method to qualitatively compare two linear SSMs in dense correspondence by computing approximate intersection spaces and set-theoretic differences between the (hyper-ellipsoidal) allowable shape domains spanned by the models. To this end, we approximate the distribution of shapes lying in the intersection space using Markov chain Monte Carlo and subsequently apply Principal Component Analysis (PCA) to the posterior samples, eventually yielding a new SSM of the intersection space. We estimate differences between linear SSMs in a similar manner; here, however, the resulting spaces are no longer convex and we do not apply PCA but instead use the posterior samples for",
    "link": "http://arxiv.org/abs/2211.16314",
    "context": "Title: Approximating Intersections and Differences Between Linear Statistical Shape Models Using Markov Chain Monte Carlo. (arXiv:2211.16314v2 [cs.CV] UPDATED)\nAbstract: To date, the comparison of Statistical Shape Models (SSMs) is often solely performance-based, carried out by means of simplistic metrics such as compactness, generalization, or specificity. Any similarities or differences between the actual shape spaces can neither be visualized nor quantified. In this paper, we present a new method to qualitatively compare two linear SSMs in dense correspondence by computing approximate intersection spaces and set-theoretic differences between the (hyper-ellipsoidal) allowable shape domains spanned by the models. To this end, we approximate the distribution of shapes lying in the intersection space using Markov chain Monte Carlo and subsequently apply Principal Component Analysis (PCA) to the posterior samples, eventually yielding a new SSM of the intersection space. We estimate differences between linear SSMs in a similar manner; here, however, the resulting spaces are no longer convex and we do not apply PCA but instead use the posterior samples for",
    "path": "papers/22/11/2211.16314.json",
    "total_tokens": 925,
    "translated_title": "使用马尔可夫链蒙特卡洛方法，近似计算线性统计形状模型之间的相交和差异",
    "translated_abstract": "到目前为止，对统计形状模型 (SSMs) 的比较通常仅基于性能，通过简单的度量指标（如紧致性、泛化性或特异性）进行。实际形状空间之间的相似性或差异无法可视化或量化。在本文中，我们提出了一种新方法，通过计算模型所跨越的（超椭球形）可允许形状域之间的近似相交空间和集合差异，对比两个线性SSM在密集对应上进行定性比较。为此，我们使用马尔可夫链蒙特卡洛方法近似计算处于相交空间中的形状分布，并随后应用主成分分析 (PCA) 对后验样本进行处理，最终得到相交空间的新SSM。我们以类似的方式估计线性SSM之间的差异；然而，在这种情况下，所得空间不再是凸的，我们不再应用PCA，而是使用后验样本进行处理。",
    "tldr": "本文提出了一种使用马尔可夫链蒙特卡洛方法近似计算线性统计形状模型之间相交和差异的新方法。该方法能够对比两个模型的相交空间和集合差异，并生成新的统计形状模型。",
    "en_tdlr": "This paper presents a new method that uses Markov chain Monte Carlo to approximate intersections and differences between linear statistical shape models. The method allows for qualitative comparison of shape spaces and generates new statistical shape models."
}