{
    "title": "Normalizing Flows for Human Pose Anomaly Detection. (arXiv:2211.10946v2 [cs.CV] UPDATED)",
    "abstract": "Video anomaly detection is an ill-posed problem because it relies on many parameters such as appearance, pose, camera angle, background, and more. We distill the problem to anomaly detection of human pose, thus decreasing the risk of nuisance parameters such as appearance affecting the result. Focusing on pose alone also has the side benefit of reducing bias against distinct minority groups. Our model works directly on human pose graph sequences and is exceptionally lightweight (~1K parameters), capable of running on any machine able to run the pose estimation with negligible additional resources. We leverage the highly compact pose representation in a normalizing flows framework, which we extend to tackle the unique characteristics of spatio-temporal pose data and show its advantages in this use case. The algorithm is quite general and can handle training data of only normal examples as well as a supervised setting that consists of labeled normal and abnormal examples. We report state",
    "link": "http://arxiv.org/abs/2211.10946",
    "context": "Title: Normalizing Flows for Human Pose Anomaly Detection. (arXiv:2211.10946v2 [cs.CV] UPDATED)\nAbstract: Video anomaly detection is an ill-posed problem because it relies on many parameters such as appearance, pose, camera angle, background, and more. We distill the problem to anomaly detection of human pose, thus decreasing the risk of nuisance parameters such as appearance affecting the result. Focusing on pose alone also has the side benefit of reducing bias against distinct minority groups. Our model works directly on human pose graph sequences and is exceptionally lightweight (~1K parameters), capable of running on any machine able to run the pose estimation with negligible additional resources. We leverage the highly compact pose representation in a normalizing flows framework, which we extend to tackle the unique characteristics of spatio-temporal pose data and show its advantages in this use case. The algorithm is quite general and can handle training data of only normal examples as well as a supervised setting that consists of labeled normal and abnormal examples. We report state",
    "path": "papers/22/11/2211.10946.json",
    "total_tokens": 981,
    "translated_title": "标准化流用于人体姿势异常检测",
    "translated_abstract": "视频异常检测是一个不确定的问题，因为它依赖于许多参数，如外观、姿势、摄像机角度、背景等等。我们将问题简化为人体姿势的异常检测，从而减少了外观等影响结果的干扰参数的风险。仅关注姿势还可以减少对特定少数群体的偏见。我们的模型直接在人体姿势图序列上运行，非常轻量级（约1K个参数），可以在任何能够运行姿势估计的机器上运行，几乎不需要额外资源。我们利用高度紧凑的姿势表示在标准化流框架中进行改进，解决了时空姿势数据的特殊特征，并展示了在这种用例中的优势。该算法非常通用，既可以处理只有正常示例的训练数据，也可以处理包含标记的正常和异常示例的监督设置。我们报告了最先进的实验结果。",
    "tldr": "该论文提出了一种用于人体姿势异常检测的标准化流模型，通过将问题简化为姿势异常检测减少了干扰参数的影响，同时具有减少偏见的优势。该模型基于高度紧凑的姿势表示，在解决时空姿势数据的特殊特征上表现出优势，并且可以处理准则设置和非准则设置下的训练数据。实验结果表明该模型达到了最先进的水平。",
    "en_tdlr": "This paper presents a normalizing flows model for human pose anomaly detection. By distilling the problem to anomaly detection of human pose, it reduces the influence of nuisance parameters and biases. The model leverages compact pose representation and shows advantages in handling spatio-temporal pose data, achieving state-of-the-art results."
}