{
    "title": "World Knowledge in Multiple Choice Reading Comprehension. (arXiv:2211.07040v2 [cs.CL] UPDATED)",
    "abstract": "Recently it has been shown that without any access to the contextual passage, multiple choice reading comprehension (MCRC) systems are able to answer questions significantly better than random on average. These systems use their accumulated \"world knowledge\" to directly answer questions, rather than using information from the passage. This paper examines the possibility of exploiting this observation as a tool for test designers to ensure that the use of \"world knowledge\" is acceptable for a particular set of questions. We propose information-theory based metrics that enable the level of \"world knowledge\" exploited by systems to be assessed. Two metrics are described: the expected number of options, which measures whether a passage-free system can identify the answer a question using world knowledge; and the contextual mutual information, which measures the importance of context for a given question. We demonstrate that questions with low expected number of options, and hence answerabl",
    "link": "http://arxiv.org/abs/2211.07040",
    "context": "Title: World Knowledge in Multiple Choice Reading Comprehension. (arXiv:2211.07040v2 [cs.CL] UPDATED)\nAbstract: Recently it has been shown that without any access to the contextual passage, multiple choice reading comprehension (MCRC) systems are able to answer questions significantly better than random on average. These systems use their accumulated \"world knowledge\" to directly answer questions, rather than using information from the passage. This paper examines the possibility of exploiting this observation as a tool for test designers to ensure that the use of \"world knowledge\" is acceptable for a particular set of questions. We propose information-theory based metrics that enable the level of \"world knowledge\" exploited by systems to be assessed. Two metrics are described: the expected number of options, which measures whether a passage-free system can identify the answer a question using world knowledge; and the contextual mutual information, which measures the importance of context for a given question. We demonstrate that questions with low expected number of options, and hence answerabl",
    "path": "papers/22/11/2211.07040.json",
    "total_tokens": 998,
    "translated_title": "多项选择阅读理解中的世界知识",
    "translated_abstract": "最近的研究表明，在没有上下文语境的情况下，多项选择阅读理解（MCRC）系统能够比随机回答问题要好得多。这些系统使用他们积累的“世界知识”来直接回答问题，而不使用来自段落的信息。本文探讨了利用这个观察结果作为测试设计工具的可能性，以确保在特定的一组问题中使用“世界知识”是可接受的。我们提出了基于信息理论的度量方法，可以评估系统利用\"世界知识\"的水平。我们描述了两个度量标准：期望选项数，它测量了无需使用上下文信息，系统是否可以利用世界知识来确定一个问题的答案；词汇互信息，它测量了对于给定的问题来说上下文的重要性。我们证明了那些期望选项数较低的问题，即可以利用世界知识来回答的问题，可以被准确地鉴定。我们的结果进一步表明，我们所提出的度量方法可以用于测试问题的质量并确定测试设计中可能存在的问题。",
    "tldr": "本文研究了在多项选择阅读理解中利用世界知识的可能性，并提出了基于信息理论的度量方法，这些方法能够评估系统利用世界知识的水平，帮助测试设计人员确保使用世界知识的问题是可接受的，同时可以测试问题的质量并发现设计中可能存在的问题。"
}