{
    "title": "Zero-Shot Classification by Logical Reasoning on Natural Language Explanations. (arXiv:2211.03252v2 [cs.CL] UPDATED)",
    "abstract": "Humans can classify data of an unseen category by reasoning on its language explanations. This ability is owing to the compositional nature of language: we can combine previously seen attributes to describe the new category. For example, we might describe a sage thrasher as \"it has a slim straight relatively short bill, yellow eyes and a long tail\", so that others can use their knowledge of attributes \"slim straight relatively short bill\", \"yellow eyes\" and \"long tail\" to recognize a sage thrasher. Inspired by this observation, in this work we tackle zero-shot classification task by logically parsing and reasoning on natural language expla-nations. To this end, we propose the framework CLORE (Classification by LOgical Reasoning on Explanations). While previous methods usually regard textual information as implicit features, CLORE parses explanations into logical structures and then explicitly reasons along thess structures on the input to produce a classification score. Experimental re",
    "link": "http://arxiv.org/abs/2211.03252",
    "context": "Title: Zero-Shot Classification by Logical Reasoning on Natural Language Explanations. (arXiv:2211.03252v2 [cs.CL] UPDATED)\nAbstract: Humans can classify data of an unseen category by reasoning on its language explanations. This ability is owing to the compositional nature of language: we can combine previously seen attributes to describe the new category. For example, we might describe a sage thrasher as \"it has a slim straight relatively short bill, yellow eyes and a long tail\", so that others can use their knowledge of attributes \"slim straight relatively short bill\", \"yellow eyes\" and \"long tail\" to recognize a sage thrasher. Inspired by this observation, in this work we tackle zero-shot classification task by logically parsing and reasoning on natural language expla-nations. To this end, we propose the framework CLORE (Classification by LOgical Reasoning on Explanations). While previous methods usually regard textual information as implicit features, CLORE parses explanations into logical structures and then explicitly reasons along thess structures on the input to produce a classification score. Experimental re",
    "path": "papers/22/11/2211.03252.json",
    "total_tokens": 755,
    "translated_title": "基于自然语言解释的逻辑推理零样本分类",
    "translated_abstract": "人类可以通过对其语言解释的推理来分类未见过的数据类别。这种能力源于语言的组成性质：我们可以组合以前看到的属性来描述新的类别。本文受到这一观察的启发，通过对自然语言解释进行逻辑分析和推理，解决了零样本分类任务。为此，我们提出了CLORE框架（Classification by LOgical Reasoning on Explanations）。 CLORE将以前的方法所隐含的文本信息解析成逻辑结构并沿着这些结构推理，以产生分类分数。",
    "tldr": "本文提出了一种基于逻辑推理的零样本分类方法，通过对自然语言解释进行分析和推理，将文本信息显式地编码成逻辑结构， 进而获得可靠的分类结果。",
    "en_tdlr": "This paper proposes a logic reasoning-based zero-shot classification method, CLORE, which parses natural language explanations into logical structures and explicitly encodes textual information into reasoning process, achieving reliable classification results."
}