{
    "title": "An Inclusive Notion of Text. (arXiv:2211.05604v2 [cs.CL] UPDATED)",
    "abstract": "Natural language processing (NLP) researchers develop models of grammar, meaning and communication based on written text. Due to task and data differences, what is considered text can vary substantially across studies. A conceptual framework for systematically capturing these differences is lacking. We argue that clarity on the notion of text is crucial for reproducible and generalizable NLP. Towards that goal, we propose common terminology to discuss the production and transformation of textual data, and introduce a two-tier taxonomy of linguistic and non-linguistic elements that are available in textual sources and can be used in NLP modeling. We apply this taxonomy to survey existing work that extends the notion of text beyond the conservative language-centered view. We outline key desiderata and challenges of the emerging inclusive approach to text in NLP, and suggest community-level reporting as a crucial next step to consolidate the discussion.",
    "link": "http://arxiv.org/abs/2211.05604",
    "context": "Title: An Inclusive Notion of Text. (arXiv:2211.05604v2 [cs.CL] UPDATED)\nAbstract: Natural language processing (NLP) researchers develop models of grammar, meaning and communication based on written text. Due to task and data differences, what is considered text can vary substantially across studies. A conceptual framework for systematically capturing these differences is lacking. We argue that clarity on the notion of text is crucial for reproducible and generalizable NLP. Towards that goal, we propose common terminology to discuss the production and transformation of textual data, and introduce a two-tier taxonomy of linguistic and non-linguistic elements that are available in textual sources and can be used in NLP modeling. We apply this taxonomy to survey existing work that extends the notion of text beyond the conservative language-centered view. We outline key desiderata and challenges of the emerging inclusive approach to text in NLP, and suggest community-level reporting as a crucial next step to consolidate the discussion.",
    "path": "papers/22/11/2211.05604.json",
    "total_tokens": 855,
    "translated_title": "包容性文本概念论",
    "translated_abstract": "自然语言处理（NLP）研究人员根据书面文本开发语法、意义和交流模型。由于任务和数据的差异，被认为是文本的内容在研究中可能会有很大的变化。缺乏一个系统性捕捉这些差异的概念框架。我们认为，澄清文本概念对于可重复和可推广的NLP至关重要。为此，我们提出了通用术语来讨论文本数据的生产和转换，并引入了一个二层次的语言和非语言元素的分类法，这些元素在文本来源中可用于NLP建模。我们将此分类法应用于调查将文本概念扩展到保守的以语言为中心的视角以外的现有工作。我们概述了正在兴起的NLP中包容性文本方法的关键要求和挑战，并建议社区级别的报告作为巩固讨论的关键下一步。",
    "tldr": "我们提出了一个通用术语以及一个语言和非语言元素的分类法，用于系统性地捕捉不同任务和数据下的文本概念差异。这显著提高了NLP模型的可重复性和可推广性。",
    "en_tdlr": "We propose common terminology and a taxonomy of language and non-language elements to systematically capture the differences in the notion of text across various tasks and data, thus significantly improving the reproducibility and generalizability of NLP models."
}