{
    "title": "Logic and Commonsense-Guided Temporal Knowledge Graph Completion. (arXiv:2211.16865v2 [cs.AI] UPDATED)",
    "abstract": "A temporal knowledge graph (TKG) stores the events derived from the data involving time. Predicting events is extremely challenging due to the time-sensitive property of events. Besides, the previous TKG completion (TKGC) approaches cannot represent both the timeliness and the causality properties of events, simultaneously. To address these challenges, we propose a Logic and Commonsense-Guided Embedding model (LCGE) to jointly learn the time-sensitive representation involving timeliness and causality of events, together with the time-independent representation of events from the perspective of commonsense. Specifically, we design a temporal rule learning algorithm to construct a rule-guided predicate embedding regularization strategy for learning the causality among events. Furthermore, we could accurately evaluate the plausibility of events via auxiliary commonsense knowledge. The experimental results of TKGC task illustrate the significant performance improvements of our model compar",
    "link": "http://arxiv.org/abs/2211.16865",
    "context": "Title: Logic and Commonsense-Guided Temporal Knowledge Graph Completion. (arXiv:2211.16865v2 [cs.AI] UPDATED)\nAbstract: A temporal knowledge graph (TKG) stores the events derived from the data involving time. Predicting events is extremely challenging due to the time-sensitive property of events. Besides, the previous TKG completion (TKGC) approaches cannot represent both the timeliness and the causality properties of events, simultaneously. To address these challenges, we propose a Logic and Commonsense-Guided Embedding model (LCGE) to jointly learn the time-sensitive representation involving timeliness and causality of events, together with the time-independent representation of events from the perspective of commonsense. Specifically, we design a temporal rule learning algorithm to construct a rule-guided predicate embedding regularization strategy for learning the causality among events. Furthermore, we could accurately evaluate the plausibility of events via auxiliary commonsense knowledge. The experimental results of TKGC task illustrate the significant performance improvements of our model compar",
    "path": "papers/22/11/2211.16865.json",
    "total_tokens": 897,
    "translated_title": "逻辑和常识引导的时间知识图谱补全",
    "translated_abstract": "时间知识图谱（TKG）存储与时间有关的数据事件。预测事件由于其时态特性而极具挑战性。此外，以往的TKG补全方法无法同时表示事件的实时性和因果性。为了解决这些问题，我们提出了一种“逻辑和常识引导的嵌入模型”（LCGE），能够共同学习事件的时间敏感性表示（涉及时态和因果性的事件表示）与常识角度上的时间无关表示。具体来说，我们设计了一个时间规则学习算法，构建了一个规则引导的谓词嵌入规范策略，学习事件之间的因果关系。此外，我们通过辅助常识知识能够准确评估事件的合理性。实验结果表明，我们的模型在TKGC任务中实现了显著的性能提升。",
    "tldr": "本文提出一种\"逻辑和常识引导的嵌入模型\"（LCGE），通过共同学习时间敏感性表示（涉及时态和因果性的事件表示）与常识角度上的时间无关表示，解决了时间知识图谱补全中表示事件的实时性和因果性的挑战。",
    "en_tdlr": "This paper proposes a Logic and Commonsense-Guided Embedding model (LCGE) which jointly learns the time-sensitive representation involving timeliness and causality of events, together with the time-independent representation of events from the perspective of commonsense, in order to solve the challenge of representing both the timeliness and causality of events in temporal knowledge graph completion."
}