{
    "title": "SongRewriter: A Chinese Song Rewriting System with Controllable Content and Rhyme Scheme. (arXiv:2211.15037v2 [cs.CL] UPDATED)",
    "abstract": "Although lyrics generation has achieved significant progress in recent years, it has limited practical applications because the generated lyrics cannot be performed without composing compatible melodies. In this work, we bridge this practical gap by proposing a song rewriting system which rewrites the lyrics of an existing song such that the generated lyrics are compatible with the rhythm of the existing melody and thus singable. In particular, we propose SongRewriter,a controllable Chinese lyrics generation and editing system which assists users without prior knowledge of melody composition. The system is trained by a randomized multi-level masking strategy which produces a unified model for generating entirely new lyrics or editing a few fragments. To improve the controllabiliy of the generation process, we further incorporate a keyword prompt to control the lexical choices of the content and propose novel decoding constraints and a vowel modeling task to enable flexible end and inte",
    "link": "http://arxiv.org/abs/2211.15037",
    "context": "Title: SongRewriter: A Chinese Song Rewriting System with Controllable Content and Rhyme Scheme. (arXiv:2211.15037v2 [cs.CL] UPDATED)\nAbstract: Although lyrics generation has achieved significant progress in recent years, it has limited practical applications because the generated lyrics cannot be performed without composing compatible melodies. In this work, we bridge this practical gap by proposing a song rewriting system which rewrites the lyrics of an existing song such that the generated lyrics are compatible with the rhythm of the existing melody and thus singable. In particular, we propose SongRewriter,a controllable Chinese lyrics generation and editing system which assists users without prior knowledge of melody composition. The system is trained by a randomized multi-level masking strategy which produces a unified model for generating entirely new lyrics or editing a few fragments. To improve the controllabiliy of the generation process, we further incorporate a keyword prompt to control the lexical choices of the content and propose novel decoding constraints and a vowel modeling task to enable flexible end and inte",
    "path": "papers/22/11/2211.15037.json",
    "total_tokens": 876,
    "translated_title": "SongRewriter: 一种具有可控内容和韵律方案的中文歌曲改编系统",
    "translated_abstract": "尽管歌词生成在近年来取得了重大进展，但由于无法生成与相配的旋律进行演唱，因此具有限制性的实际应用。因此，我们提出了一种歌曲改编系统，可通过重新编写现有歌曲的歌词来生成与该旋律相容的歌词。具体而言，我们提出了SongRewriter，一种可控的中文歌词生成和编辑系统，可以帮助没有旋律组成知识的用户。该系统通过随机的多级屏蔽策略进行训练，从而生成适用于生成全新歌词或编辑少量片段的统一模型。为了改善生成过程的可控性，我们进一步加入了关键词提示来控制内容的词汇选择，并提出了新颖的解码约束和元音建模任务，以实现灵活的前后结构和内韵。",
    "tldr": "SongRewriter是一种中文歌曲改编系统，可以重新编写现有歌曲的歌词生成与旋律相配的歌词，可帮助没有旋律组成知识的用户，易于控制生成过程。",
    "en_tdlr": "SongRewriter is a Chinese song rewriting system that rewrites the lyrics of an existing song in a controllable way to generate singable lyrics that are compatible with the rhythm of the existing melody, which can assist users without prior knowledge of melody composition and improve the controllability of the generation process."
}