{
    "title": "Machine Learned Calabi-Yau Metrics and Curvature. (arXiv:2211.09801v3 [hep-th] UPDATED)",
    "abstract": "Finding Ricci-flat (Calabi-Yau) metrics is a long standing problem in geometry with deep implications for string theory and phenomenology. A new attack on this problem uses neural networks to engineer approximations to the Calabi-Yau metric within a given K\\\"ahler class. In this paper we investigate numerical Ricci-flat metrics over smooth and singular K3 surfaces and Calabi-Yau threefolds. Using these Ricci-flat metric approximations for the Cefal\\'u family of quartic twofolds and the Dwork family of quintic threefolds, we study characteristic forms on these geometries. We observe that the numerical stability of the numerically computed topological characteristic is heavily influenced by the choice of the neural network model, in particular, we briefly discuss a different neural network model, namely Spectral networks, which correctly approximate the topological characteristic of a Calabi-Yau. Using persistent homology, we show that high curvature regions of the manifolds form cluster",
    "link": "http://arxiv.org/abs/2211.09801",
    "context": "Title: Machine Learned Calabi-Yau Metrics and Curvature. (arXiv:2211.09801v3 [hep-th] UPDATED)\nAbstract: Finding Ricci-flat (Calabi-Yau) metrics is a long standing problem in geometry with deep implications for string theory and phenomenology. A new attack on this problem uses neural networks to engineer approximations to the Calabi-Yau metric within a given K\\\"ahler class. In this paper we investigate numerical Ricci-flat metrics over smooth and singular K3 surfaces and Calabi-Yau threefolds. Using these Ricci-flat metric approximations for the Cefal\\'u family of quartic twofolds and the Dwork family of quintic threefolds, we study characteristic forms on these geometries. We observe that the numerical stability of the numerically computed topological characteristic is heavily influenced by the choice of the neural network model, in particular, we briefly discuss a different neural network model, namely Spectral networks, which correctly approximate the topological characteristic of a Calabi-Yau. Using persistent homology, we show that high curvature regions of the manifolds form cluster",
    "path": "papers/22/11/2211.09801.json",
    "total_tokens": 973,
    "translated_title": "机器学习的Calabi-Yau度量和曲率",
    "translated_abstract": "寻找Ricci-flat（Calabi-Yau）度量是几何学中一个长期存在的问题，对于弦论和现象学有着深远的影响。解决这个问题的新方法是使用神经网络构建在给定Kähler类中逼近Calabi-Yau度量。在本文中，我们研究了光滑和奇异K3曲面和Calabi-Yau三体上的数值Ricci-flat度量。使用这些度量逼近Cefalù家族的四次型双曲面和Dwork家族的五次型三体，我们研究这些几何体上的特征形式。我们观察到，数值计算出的拓扑特征的稳定性受到神经网络模型选择的影响较大，我们简要讨论了一种不同的神经网络模型，即谱网络，它可以正确逼近Calabi-Yau的拓扑特性。使用持久同调，我们展示了流形的高曲率区域形成一个聚类。",
    "tldr": "这篇论文使用机器学习方法构建了逼近Calabi-Yau度量的神经网络模型，研究了光滑和奇异K3曲面和Calabi-Yau三体上的数值Ricci-flat度量，并观察到神经网络模型对于计算出的拓扑特征的稳定性有较大影响。",
    "en_tdlr": "This paper uses machine learning to construct a neural network model that approximates the Calabi-Yau metric, and studies numerical Ricci-flat metrics over smooth and singular K3 surfaces and Calabi-Yau threefolds. The authors observe that the choice of neural network model heavily influences the numerical stability of the topological characteristic, and briefly discuss a different neural network model that correctly approximates the topological characteristic of a Calabi-Yau."
}