{
    "title": "Neural Fourier Shift for Binaural Speech Rendering. (arXiv:2211.00878v2 [eess.AS] UPDATED)",
    "abstract": "We present a neural network for rendering binaural speech from given monaural audio, position, and orientation of the source. Most of the previous works have focused on synthesizing binaural speeches by conditioning the positions and orientations in the feature space of convolutional neural networks. These synthesis approaches are powerful in estimating the target binaural speeches even for in-the-wild data but are difficult to generalize for rendering the audio from out-of-distribution domains. To alleviate this, we propose Neural Fourier Shift (NFS), a novel network architecture that enables binaural speech rendering in the Fourier space. Specifically, utilizing a geometric time delay based on the distance between the source and the receiver, NFS is trained to predict the delays and scales of various early reflections. NFS is efficient in both memory and computational cost, is interpretable, and operates independently of the source domain by its design. Experimental results show that",
    "link": "http://arxiv.org/abs/2211.00878",
    "context": "Title: Neural Fourier Shift for Binaural Speech Rendering. (arXiv:2211.00878v2 [eess.AS] UPDATED)\nAbstract: We present a neural network for rendering binaural speech from given monaural audio, position, and orientation of the source. Most of the previous works have focused on synthesizing binaural speeches by conditioning the positions and orientations in the feature space of convolutional neural networks. These synthesis approaches are powerful in estimating the target binaural speeches even for in-the-wild data but are difficult to generalize for rendering the audio from out-of-distribution domains. To alleviate this, we propose Neural Fourier Shift (NFS), a novel network architecture that enables binaural speech rendering in the Fourier space. Specifically, utilizing a geometric time delay based on the distance between the source and the receiver, NFS is trained to predict the delays and scales of various early reflections. NFS is efficient in both memory and computational cost, is interpretable, and operates independently of the source domain by its design. Experimental results show that",
    "path": "papers/22/11/2211.00878.json",
    "total_tokens": 895,
    "tldr": "本文提出了一种基于神经傅里叶变换的网络架构，可在傅里叶空间中实现双耳语音渲染，具有高效、可解释和独立于源域的优势。"
}