{
    "title": "Benefits of Monotonicity in Safe Exploration with Gaussian Processes. (arXiv:2211.01561v2 [stat.ML] UPDATED)",
    "abstract": "We consider the problem of sequentially maximising an unknown function over a set of actions while ensuring that every sampled point has a function value below a given safety threshold. We model the function using kernel-based and Gaussian process methods, while differing from previous works in our assumption that the function is monotonically increasing with respect to a \\emph{safety variable}. This assumption is motivated by various practical applications such as adaptive clinical trial design and robotics. Taking inspiration from the \\textsc{\\sffamily GP-UCB} and \\textsc{\\sffamily SafeOpt} algorithms, we propose an algorithm, monotone safe {\\sffamily UCB} (\\textsc{\\sffamily M-SafeUCB}) for this task. We show that \\textsc{\\sffamily M-SafeUCB} enjoys theoretical guarantees in terms of safety, a suitably-defined regret notion, and approximately finding the entire safe boundary. In addition, we illustrate that the monotonicity assumption yields significant benefits in terms of the guara",
    "link": "http://arxiv.org/abs/2211.01561",
    "context": "Title: Benefits of Monotonicity in Safe Exploration with Gaussian Processes. (arXiv:2211.01561v2 [stat.ML] UPDATED)\nAbstract: We consider the problem of sequentially maximising an unknown function over a set of actions while ensuring that every sampled point has a function value below a given safety threshold. We model the function using kernel-based and Gaussian process methods, while differing from previous works in our assumption that the function is monotonically increasing with respect to a \\emph{safety variable}. This assumption is motivated by various practical applications such as adaptive clinical trial design and robotics. Taking inspiration from the \\textsc{\\sffamily GP-UCB} and \\textsc{\\sffamily SafeOpt} algorithms, we propose an algorithm, monotone safe {\\sffamily UCB} (\\textsc{\\sffamily M-SafeUCB}) for this task. We show that \\textsc{\\sffamily M-SafeUCB} enjoys theoretical guarantees in terms of safety, a suitably-defined regret notion, and approximately finding the entire safe boundary. In addition, we illustrate that the monotonicity assumption yields significant benefits in terms of the guara",
    "path": "papers/22/11/2211.01561.json",
    "total_tokens": 843,
    "translated_title": "基于高斯过程中单调性的安全探索的优势",
    "translated_abstract": "本文考虑了在相应的安全阈值下顺序地寻找未知函数的最大值的问题。我们使用基于核的和高斯过程方法建模函数，但假设该函数相对于“安全变量”是单调递增的，这与以前的工作不同。此假设受到了各种实际应用的启发，例如自适应临床试验设计和机器人学。我们从GP-UCB和SafeOpt算法中汲取灵感，提出了一种名为单调安全UCB(M-SafeUCB)的算法来完成这个任务。我们证明了M-SafeUCB在安全性、适当定义的后悔概念和近似找到整个安全边界方面具有理论保证。此外，我们说明，单调性假设在保证准确性的同时也具有显著优势。",
    "tldr": "本文提出了一种名为单调安全UCB(M-SafeUCB)的算法，通过单调性假设，取得了在保证精度的同时显著的优势。",
    "en_tdlr": "This paper presents an algorithm named M-SafeUCB for the problem of sequentially maximizing an unknown function over a set of actions while ensuring safety, which benefits significantly from the assumption of monotonicity."
}