{
    "title": "Enabling Deep Learning-based Physical-layer Secret Key Generation for FDD-OFDM Systems in Multi-Environments",
    "abstract": "arXiv:2211.03065v2 Announce Type: replace-cross  Abstract: Deep learning-based physical-layer secret key generation (PKG) has been used to overcome the imperfect uplink/downlink channel reciprocity in frequency division duplexing (FDD) orthogonal frequency division multiplexing (OFDM) systems. However, existing efforts have focused on key generation for users in a specific environment where the training samples and test samples follow the same distribution, which is unrealistic for real-world applications. This paper formulates the PKG problem in multiple environments as a learning-based problem by learning the knowledge such as data and models from known environments to generate keys quickly and efficiently in multiple new environments. Specifically, we propose deep transfer learning (DTL) and meta-learning-based channel feature mapping algorithms for key generation. The two algorithms use different training methods to pre-train the model in the known environments, and then quickly ad",
    "link": "https://arxiv.org/abs/2211.03065",
    "context": "Title: Enabling Deep Learning-based Physical-layer Secret Key Generation for FDD-OFDM Systems in Multi-Environments\nAbstract: arXiv:2211.03065v2 Announce Type: replace-cross  Abstract: Deep learning-based physical-layer secret key generation (PKG) has been used to overcome the imperfect uplink/downlink channel reciprocity in frequency division duplexing (FDD) orthogonal frequency division multiplexing (OFDM) systems. However, existing efforts have focused on key generation for users in a specific environment where the training samples and test samples follow the same distribution, which is unrealistic for real-world applications. This paper formulates the PKG problem in multiple environments as a learning-based problem by learning the knowledge such as data and models from known environments to generate keys quickly and efficiently in multiple new environments. Specifically, we propose deep transfer learning (DTL) and meta-learning-based channel feature mapping algorithms for key generation. The two algorithms use different training methods to pre-train the model in the known environments, and then quickly ad",
    "path": "papers/22/11/2211.03065.json",
    "total_tokens": 842,
    "translated_title": "在多环境下为FDD-OFDM系统实现基于深度学习的物理层秘钥生成",
    "translated_abstract": "基于深度学习的物理层秘钥生成（PKG）被用于克服频分双工（FDD）正交频分复用（OFDM）系统中不完美的上下行信道互易性。然而，现有的研究主要集中在针对特定环境中用户的秘钥生成，其中训练样本和测试样本遵循相同的分布，这对于实际应用是不现实的。本文将多环境下的PKG问题表述为一个学习性问题，通过从已知环境中学习数据和模型等知识，快速高效地在多个新环境中生成秘钥。具体来说，我们提出了基于深度传递学习（DTL）和元学习的信道特征映射算法用于秘钥生成。",
    "tldr": "本文在多个环境下将物理层秘钥生成问题转化为学习性问题，提出了基于深度传递学习和元学习的信道特征映射算法，实现了在多个新环境中快速有效地生成秘钥。",
    "en_tdlr": "This paper formulates the physical-layer secret key generation problem in multiple environments as a learning-based problem, and proposes deep transfer learning and meta-learning-based channel feature mapping algorithms to efficiently generate keys in multiple new environments."
}