{
    "title": "Fully Stochastic Trust-Region Sequential Quadratic Programming for Equality-Constrained Optimization Problems. (arXiv:2211.15943v2 [math.OC] UPDATED)",
    "abstract": "We propose a trust-region stochastic sequential quadratic programming algorithm (TR-StoSQP) to solve nonlinear optimization problems with stochastic objectives and deterministic equality constraints. We consider a fully stochastic setting, where at each step a single sample is generated to estimate the objective gradient. The algorithm adaptively selects the trust-region radius and, compared to the existing line-search StoSQP schemes, allows us to utilize indefinite Hessian matrices (i.e., Hessians without modification) in SQP subproblems. As a trust-region method for constrained optimization, our algorithm must address an infeasibility issue -- the linearized equality constraints and trust-region constraints may lead to infeasible SQP subproblems. In this regard, we propose an adaptive relaxation technique to compute the trial step, consisting of a normal step and a tangential step. To control the lengths of these two steps while ensuring a scale-invariant property, we adaptively deco",
    "link": "http://arxiv.org/abs/2211.15943",
    "context": "Title: Fully Stochastic Trust-Region Sequential Quadratic Programming for Equality-Constrained Optimization Problems. (arXiv:2211.15943v2 [math.OC] UPDATED)\nAbstract: We propose a trust-region stochastic sequential quadratic programming algorithm (TR-StoSQP) to solve nonlinear optimization problems with stochastic objectives and deterministic equality constraints. We consider a fully stochastic setting, where at each step a single sample is generated to estimate the objective gradient. The algorithm adaptively selects the trust-region radius and, compared to the existing line-search StoSQP schemes, allows us to utilize indefinite Hessian matrices (i.e., Hessians without modification) in SQP subproblems. As a trust-region method for constrained optimization, our algorithm must address an infeasibility issue -- the linearized equality constraints and trust-region constraints may lead to infeasible SQP subproblems. In this regard, we propose an adaptive relaxation technique to compute the trial step, consisting of a normal step and a tangential step. To control the lengths of these two steps while ensuring a scale-invariant property, we adaptively deco",
    "path": "papers/22/11/2211.15943.json",
    "total_tokens": 1017,
    "translated_title": "完全随机信任区间顺序二次规划方法用于等式约束优化问题",
    "translated_abstract": "我们提出了一种信任区间随机顺序二次规划算法(TR-StoSQP)，用于解决具有随机目标和确定性等式约束的非线性优化问题。我们考虑了完全随机的情况，在每一步中生成一个样本来估计目标梯度。该算法自适应地选择信任区间半径，并且与现有的线搜索StoSQP方案相比，允许我们在SQP子问题中使用非确定Hessian矩阵（即未经修改的Hessian矩阵）。作为约束优化的信任区间方法，我们的算法必须解决一个不可行性问题--线性化的等式约束和信任区间约束可能导致不可行的SQP子问题。在这方面，我们提出了一种自适应的松弛技术来计算试验步长，包括一个正常步长和一个切线步长。为了控制这两个步长的长度，同时确保一个尺度不变的属性，我们自适应地装饰。",
    "tldr": "本文提出了一种完全随机的信任区间顺序二次规划算法(TR-StoSQP)，用于解决非线性优化问题，其中包含随机目标和确定性等式约束。该算法通过自适应选择信任区间半径，并允许使用未经修改的Hessian矩阵，在SQP子问题中应对不可行性问题。为了控制试验步长的长度并保证尺度不变性，作者采用自适应的松弛技术计算试验步长。"
}