{
    "title": "Probing neural language models for understanding of words of estimative probability. (arXiv:2211.03358v2 [cs.CL] UPDATED)",
    "abstract": "Words of estimative probability (WEP) are expressions of a statement's plausibility (probably, maybe, likely, doubt, likely, unlikely, impossible...). Multiple surveys demonstrate the agreement of human evaluators when assigning numerical probability levels to WEP. For example, highly likely corresponds to a median chance of 0.90+-0.08 in Fagen-Ulmschneider (2015)'s survey. In this work, we measure the ability of neural language processing models to capture the consensual probability level associated to each WEP. Firstly, we use the UNLI dataset (Chen et al., 2020) which associates premises and hypotheses with their perceived joint probability p, to construct prompts, e.g. \"[PREMISE]. [WEP], [HYPOTHESIS].\" and assess whether language models can predict whether the WEP consensual probability level is close to p. Secondly, we construct a dataset of WEP-based probabilistic reasoning, to test whether language models can reason with WEP compositions. When prompted \"[EVENTA] is likely. [EVEN",
    "link": "http://arxiv.org/abs/2211.03358",
    "context": "Title: Probing neural language models for understanding of words of estimative probability. (arXiv:2211.03358v2 [cs.CL] UPDATED)\nAbstract: Words of estimative probability (WEP) are expressions of a statement's plausibility (probably, maybe, likely, doubt, likely, unlikely, impossible...). Multiple surveys demonstrate the agreement of human evaluators when assigning numerical probability levels to WEP. For example, highly likely corresponds to a median chance of 0.90+-0.08 in Fagen-Ulmschneider (2015)'s survey. In this work, we measure the ability of neural language processing models to capture the consensual probability level associated to each WEP. Firstly, we use the UNLI dataset (Chen et al., 2020) which associates premises and hypotheses with their perceived joint probability p, to construct prompts, e.g. \"[PREMISE]. [WEP], [HYPOTHESIS].\" and assess whether language models can predict whether the WEP consensual probability level is close to p. Secondly, we construct a dataset of WEP-based probabilistic reasoning, to test whether language models can reason with WEP compositions. When prompted \"[EVENTA] is likely. [EVEN",
    "path": "papers/22/11/2211.03358.json",
    "total_tokens": 1179,
    "translated_title": "探究神经语言模型对估计概率词语的理解",
    "translated_abstract": "估计概率词语(WEP)是陈述的可信度表达（例如，可能，或许，很有可能，怀疑，不可能等）。多项调查表明，人类评估者在为WEP分配数值概率水平时存在一致性。例如， Fagen-Ulmschneider(2015)的调查中，“很有可能”对应着中位数0.90+-0.08的几率。本研究测量了神经语言处理模型捕捉与每个WEP相关联的共识概率水平的能力。首先，我们使用UNLI数据集(陈等人，2020)，将前提和假设与其感知的联合概率p相联系，构建提示，例如“[前提]。[WEP]，[假设]。”并评估语言模型是否可以预测WEP共识概率水平是否接近于p。其次，我们构建了一个基于WEP的概率推理数据集，测试语言模型是否能够使用WEP组合进行推理。在提示“[事件A]很有可能。[事件B]不可能。[结果]会发生的概率是多少？ \"时，人们可以根据WEP词汇的可信度估算概率水平。我们对两个现有的神经语言处理模型进行了实验，并观察到虽然它们在预测WEP的存在时很有效，但它们没有完全捕捉到与每个词相关联的共识概率水平。",
    "tldr": "本研究探究了神经语言处理模型对于估计概率词语的理解能力，使用UNLI数据集和构建WEP数据集进行实验，发现语言模型在预测WEP的存在时很有效，但没有完全捕捉到与每个词相关联的共识概率水平。",
    "en_tdlr": "This study investigates the ability of neural language processing models to understand words of estimative probability (WEP) using UNLI dataset and constructing a WEP-based probabilistic reasoning dataset. While the models are effective at predicting the presence of WEP, they fail to fully capture the consensual probability level associated with each word."
}