{
    "title": "Non-inferiority of Deep Learning Acute Ischemic Stroke Segmentation on Non-Contrast CT Compared to Expert Neuroradiologists. (arXiv:2211.15341v3 [eess.IV] UPDATED)",
    "abstract": "To determine if a convolutional neural network (CNN) deep learning model can accurately segment acute ischemic changes on non-contrast CT compared to neuroradiologists. Non-contrast CT (NCCT) examinations from 232 acute ischemic stroke patients who were enrolled in the DEFUSE 3 trial were included in this study. Three experienced neuroradiologists independently segmented hypodensity that reflected the ischemic core on each scan. The neuroradiologist with the most experience (expert A) served as the ground truth for deep learning model training. Two additional neuroradiologists (experts B and C) segmentations were used for data testing. The 232 studies were randomly split into training and test sets. The training set was further randomly divided into 5 folds with training and validation sets. A 3-dimensional CNN architecture was trained and optimized to predict the segmentations of expert A from NCCT. The performance of the model was assessed using a set of volume, overlap, and distance",
    "link": "http://arxiv.org/abs/2211.15341",
    "context": "Title: Non-inferiority of Deep Learning Acute Ischemic Stroke Segmentation on Non-Contrast CT Compared to Expert Neuroradiologists. (arXiv:2211.15341v3 [eess.IV] UPDATED)\nAbstract: To determine if a convolutional neural network (CNN) deep learning model can accurately segment acute ischemic changes on non-contrast CT compared to neuroradiologists. Non-contrast CT (NCCT) examinations from 232 acute ischemic stroke patients who were enrolled in the DEFUSE 3 trial were included in this study. Three experienced neuroradiologists independently segmented hypodensity that reflected the ischemic core on each scan. The neuroradiologist with the most experience (expert A) served as the ground truth for deep learning model training. Two additional neuroradiologists (experts B and C) segmentations were used for data testing. The 232 studies were randomly split into training and test sets. The training set was further randomly divided into 5 folds with training and validation sets. A 3-dimensional CNN architecture was trained and optimized to predict the segmentations of expert A from NCCT. The performance of the model was assessed using a set of volume, overlap, and distance",
    "path": "papers/22/11/2211.15341.json",
    "total_tokens": 1012,
    "translated_title": "深度学习在非对比度CT上对急性缺血性中风分割的非劣性与专家神经放射医学家比较",
    "translated_abstract": "本研究旨在确定卷积神经网络（CNN）深度学习模型在非对比度CT上是否能够准确分割急性缺血性改变，与神经放射医学家相比。该研究纳入了232例参与DEFUSE 3试验的急性缺血性中风患者的非对比度CT检查。三名经验丰富的神经放射医学家独立地对每个扫描图像上反映缺血灶的低密度进行分割。经验最丰富的神经放射医学家（专家A）的分割结果作为深度学习模型训练的基准。另外两名神经放射医学家（专家B和C）的分割结果用于数据测试。232个研究被随机分成训练集和测试集。训练集进一步随机分成5折，包括训练集和验证集。使用三维CNN架构训练和优化模型，以预测对非对比度CT上专家A的分割。使用一组容积、重叠和距离指标评估模型的性能。",
    "tldr": "本研究旨在确定卷积神经网络（CNN）深度学习模型在非对比度CT上对急性缺血性改变的分割是否能够达到与神经放射医学家相媲美的水平。",
    "en_tdlr": "This study aims to determine if a convolutional neural network (CNN) deep learning model can accurately segment acute ischemic changes on non-contrast CT compared to neuroradiologists."
}