{
    "title": "C3: Cross-instance guided Contrastive Clustering. (arXiv:2211.07136v3 [cs.LG] UPDATED)",
    "abstract": "Clustering is the task of gathering similar data samples into clusters without using any predefined labels. It has been widely studied in machine learning literature, and recent advancements in deep learning have revived interest in this field. Contrastive clustering (CC) models are a staple of deep clustering in which positive and negative pairs of each data instance are generated through data augmentation. CC models aim to learn a feature space where instance-level and cluster-level representations of positive pairs are grouped together. Despite improving the SOTA, these algorithms ignore the cross-instance patterns, which carry essential information for improving clustering performance. This increases the false-negative-pair rate of the model while decreasing its true-positive-pair rate. In this paper, we propose a novel contrastive clustering method, Cross-instance guided Contrastive Clustering (C3), that considers the cross-sample relationships to increase the number of positive p",
    "link": "http://arxiv.org/abs/2211.07136",
    "context": "Title: C3: Cross-instance guided Contrastive Clustering. (arXiv:2211.07136v3 [cs.LG] UPDATED)\nAbstract: Clustering is the task of gathering similar data samples into clusters without using any predefined labels. It has been widely studied in machine learning literature, and recent advancements in deep learning have revived interest in this field. Contrastive clustering (CC) models are a staple of deep clustering in which positive and negative pairs of each data instance are generated through data augmentation. CC models aim to learn a feature space where instance-level and cluster-level representations of positive pairs are grouped together. Despite improving the SOTA, these algorithms ignore the cross-instance patterns, which carry essential information for improving clustering performance. This increases the false-negative-pair rate of the model while decreasing its true-positive-pair rate. In this paper, we propose a novel contrastive clustering method, Cross-instance guided Contrastive Clustering (C3), that considers the cross-sample relationships to increase the number of positive p",
    "path": "papers/22/11/2211.07136.json",
    "total_tokens": 812,
    "translated_title": "C3: 跨实例引导对比聚类",
    "translated_abstract": "聚类是将相似的数据样本聚集到无需预定义标签的簇中的任务。它在机器学习文献中得到了广泛研究，最近深度学习的进展重新引起了人们对该领域的兴趣。对比聚类（CC）模型是深度聚类的一个重要组成部分，通过数据增强生成每个数据实例的正负对。CC模型的目标是学习一个将正对实例的实例级和聚类级表示分组在一起的特征空间。尽管提高了SOTA，但这些算法忽略了携带有改进聚类性能的交叉实例模式。这增加了模型的错误负对数，同时降低了它的真正正对数。在本文中，我们提出了一种新颖的对比聚类方法，Cross-instance guided Contrastive Clustering (C3)，考虑了样本之间的关系以增加正对数。",
    "tldr": "C3是一种引入了交叉实例关系的对比聚类方法，通过考虑实例之间的关系增加了正对数，从而提高了聚类性能。",
    "en_tdlr": "C3 is a contrastive clustering method that incorporates cross-instance relationships to increase the number of positive pairs, thus improving clustering performance."
}