{
    "title": "BASiS: Batch Aligned Spectral Embedding Space. (arXiv:2211.16960v2 [cs.CV] UPDATED)",
    "abstract": "Graph is a highly generic and diverse representation, suitable for almost any data processing problem. Spectral graph theory has been shown to provide powerful algorithms, backed by solid linear algebra theory. It thus can be extremely instrumental to design deep network building blocks with spectral graph characteristics. For instance, such a network allows the design of optimal graphs for certain tasks or obtaining a canonical orthogonal low-dimensional embedding of the data. Recent attempts to solve this problem were based on minimizing Rayleigh-quotient type losses. We propose a different approach of directly learning the eigensapce. A severe problem of the direct approach, applied in batch-learning, is the inconsistent mapping of features to eigenspace coordinates in different batches. We analyze the degrees of freedom of learning this task using batches and propose a stable alignment mechanism that can work both with batch changes and with graph-metric changes. We show that our l",
    "link": "http://arxiv.org/abs/2211.16960",
    "context": "Title: BASiS: Batch Aligned Spectral Embedding Space. (arXiv:2211.16960v2 [cs.CV] UPDATED)\nAbstract: Graph is a highly generic and diverse representation, suitable for almost any data processing problem. Spectral graph theory has been shown to provide powerful algorithms, backed by solid linear algebra theory. It thus can be extremely instrumental to design deep network building blocks with spectral graph characteristics. For instance, such a network allows the design of optimal graphs for certain tasks or obtaining a canonical orthogonal low-dimensional embedding of the data. Recent attempts to solve this problem were based on minimizing Rayleigh-quotient type losses. We propose a different approach of directly learning the eigensapce. A severe problem of the direct approach, applied in batch-learning, is the inconsistent mapping of features to eigenspace coordinates in different batches. We analyze the degrees of freedom of learning this task using batches and propose a stable alignment mechanism that can work both with batch changes and with graph-metric changes. We show that our l",
    "path": "papers/22/11/2211.16960.json",
    "total_tokens": 872,
    "translated_title": "BASiS：批量对齐谱嵌入空间",
    "translated_abstract": "图是一种高度通用和多样化的表示形式，适用于几乎任何数据处理问题。谱图理论已被证明提供了强大的算法，并得到了坚实的线性代数理论支持。因此，设计具有谱图特性的深度网络建模块可能会非常有用。例如，这样的网络允许为某些任务设计最佳图形或获得数据的规范正交低维嵌入。最近解决这个问题的尝试是基于最小化瑞利商损失的方式。我们提出了一种直接学习特征向量空间的不同方法。应用于批量学习的直接方法的一个严重问题是将特征不一致地映射到不同批次中的特征向量坐标。我们分析了使用批量学习这项任务的自由度，并提出了一个稳定的对齐机制，可以同时处理批量变化和图度量变化。我们展示了我们的方法比已有的最佳模型表现更好。",
    "tldr": "该论文提出了BASiS，一种用于直接学习特征向量空间的对齐机制，可以同时处理批量和图度量变化，表现优于现有的最佳模型。",
    "en_tdlr": "This paper proposes BASiS, a mechanism for directly learning the eigenspace and providing a stable alignment mechanism that can handle both batch and graph-metric changes, outperforming state-of-the-art models."
}