{
    "title": "Unsupervised Model Adaptation for Source-free Segmentation of Medical Images. (arXiv:2211.00807v2 [cs.CV] UPDATED)",
    "abstract": "The recent prevalence of deep neural networks has lead semantic segmentation networks to achieve human-level performance in the medical field when sufficient training data is provided. Such networks however fail to generalize when tasked with predicting semantic maps for out-of-distribution images, requiring model re-training on the new distributions. This expensive process necessitates expert knowledge in order to generate training labels. Distribution shifts can arise naturally in the medical field via the choice of imaging device, i.e. MRI or CT scanners. To combat the need for labeling images in a target domain after a model is successfully trained in a fully annotated \\textit{source domain} with a different data distribution, unsupervised domain adaptation (UDA) can be used. Most UDA approaches ensure target generalization by creating a shared source/target latent feature space. This allows a source trained classifier to maintain performance on the target domain. However most UDA ",
    "link": "http://arxiv.org/abs/2211.00807",
    "context": "Title: Unsupervised Model Adaptation for Source-free Segmentation of Medical Images. (arXiv:2211.00807v2 [cs.CV] UPDATED)\nAbstract: The recent prevalence of deep neural networks has lead semantic segmentation networks to achieve human-level performance in the medical field when sufficient training data is provided. Such networks however fail to generalize when tasked with predicting semantic maps for out-of-distribution images, requiring model re-training on the new distributions. This expensive process necessitates expert knowledge in order to generate training labels. Distribution shifts can arise naturally in the medical field via the choice of imaging device, i.e. MRI or CT scanners. To combat the need for labeling images in a target domain after a model is successfully trained in a fully annotated \\textit{source domain} with a different data distribution, unsupervised domain adaptation (UDA) can be used. Most UDA approaches ensure target generalization by creating a shared source/target latent feature space. This allows a source trained classifier to maintain performance on the target domain. However most UDA ",
    "path": "papers/22/11/2211.00807.json",
    "total_tokens": 965,
    "translated_title": "无监督模型自适应用于无源医学图像分割",
    "translated_abstract": "最近深度神经网络的普及使得在提供足够的训练数据的情况下，语义分割网络在医学领域实现了人类水平的性能。然而，当面临预测分布不同的图像的语义映射时，这些网络在泛化方面存在困难，需要在新的分布上对模型重新训练。这个昂贵的过程需要专业知识来生成训练标签。在医学领域中，通过选择成像设备（如MRI或CT扫描仪）可能会自然产生分布转变。为了克服在在成功地在一个完全注释的“源域”中训练模型之后，在目标域中标记图像的需要，可以使用无监督领域自适应（UDA）。大多数UDA方法通过创建共享的源/目标潜在特征空间来确保目标泛化。这使得源培训的分类器能够在目标域上保持性能。然而，大多数UDA方法要么选择性地偏向源特征空间，使得目标域表现不佳，要么嵌入了具体领域知识，导致无法泛化到不同的目标领域。",
    "tldr": "本文提出了一种无监督模型自适应方法，用于解决医学图像分割中分布转变的问题。该方法通过创建共享的源/目标潜在特征空间，使得源培训的分类器能够在目标域上保持性能。",
    "en_tdlr": "This paper proposes an unsupervised model adaptation approach to address the issue of distribution shift in medical image segmentation. By creating a shared source/target latent feature space, the method enables a source-trained classifier to maintain performance on the target domain."
}