{
    "title": "Towards Good Practices in Evaluating Transfer Adversarial Attacks. (arXiv:2211.09565v3 [cs.CR] UPDATED)",
    "abstract": "Transfer adversarial attacks raise critical security concerns in real-world, black-box scenarios. However, the actual progress of this field is difficult to assess due to two common limitations in existing evaluations. First, different methods are often not systematically and fairly evaluated in a one-to-one comparison. Second, only transferability is evaluated but another key attack property, stealthiness, is largely overlooked. In this work, we design good practices to address these limitations, and we present the first comprehensive evaluation of transfer attacks, covering 23 representative attacks against 9 defenses on ImageNet. In particular, we propose to categorize existing attacks into five categories, which enables our systematic category-wise analyses. These analyses lead to new findings that even challenge existing knowledge and also help determine the optimal attack hyperparameters for our attack-wise comprehensive evaluation. We also pay particular attention to stealthines",
    "link": "http://arxiv.org/abs/2211.09565",
    "context": "Title: Towards Good Practices in Evaluating Transfer Adversarial Attacks. (arXiv:2211.09565v3 [cs.CR] UPDATED)\nAbstract: Transfer adversarial attacks raise critical security concerns in real-world, black-box scenarios. However, the actual progress of this field is difficult to assess due to two common limitations in existing evaluations. First, different methods are often not systematically and fairly evaluated in a one-to-one comparison. Second, only transferability is evaluated but another key attack property, stealthiness, is largely overlooked. In this work, we design good practices to address these limitations, and we present the first comprehensive evaluation of transfer attacks, covering 23 representative attacks against 9 defenses on ImageNet. In particular, we propose to categorize existing attacks into five categories, which enables our systematic category-wise analyses. These analyses lead to new findings that even challenge existing knowledge and also help determine the optimal attack hyperparameters for our attack-wise comprehensive evaluation. We also pay particular attention to stealthines",
    "path": "papers/22/11/2211.09565.json",
    "total_tokens": 862,
    "translated_title": "在评估转移对抗攻击中的良好实践",
    "translated_abstract": "转移对抗攻击在真实世界、黑盒子场景中引发了关键的安全问题。然而，由于现有评估中存在两个常见限制，这个领域的实际进展很难评估。首先，不同方法往往没有进行系统和公正的一对一比较评估。其次，只评估了可转移性，而另一个关键的攻击属性——隐蔽性则被大部分忽视了。在这项工作中，我们设计了良好的实践来解决这些限制，并且我们对转移攻击进行了首次全面的评估，涵盖了对ImageNet上9种防御措施的23种代表性攻击。特别地，我们提出将现有攻击分为五大类，这样可以进行系统的类别分析。这些分析得出了新的发现，甚至挑战了现有的知识，并且有助于确定我们的攻击全面评估中的最佳攻击超参数。我们还特别注意了隐蔽性方面。",
    "tldr": "本文提出了良好的实践来解决现有评估中的限制，首次全面评估了转移对抗攻击，并发现了新的攻击特点和最佳超参数。",
    "en_tdlr": "This paper proposes good practices to address limitations in existing evaluations, presents the first comprehensive evaluation of transfer adversarial attacks, and discovers new attack characteristics and optimal hyperparameters."
}