{
    "title": "Multi-Step Short-Term Wind Speed Prediction with Rank Pooling and Fast Fourier Transformation. (arXiv:2211.14434v2 [cs.LG] UPDATED)",
    "abstract": "Short-term wind speed prediction is essential for economical wind power utilization. The real-world wind speed data is typically intermittent and fluctuating, presenting great challenges to existing shallow models. In this paper, we present a novel deep hybrid model for multi-step wind speed prediction, namely LR-FFT-RP-MLP/LSTM (Linear Fast Fourier Transformation Rank Pooling Multiple-Layer Perception/Long Short-Term Memory). Our hybrid model processes the local and global input features simultaneously. We leverage Rank Pooling (RP) for the local feature extraction to capture the temporal structure while maintaining the temporal order. Besides, to understand the wind periodic patterns, we exploit Fast Fourier Transformation (FFT) to extract global features and relevant frequency components in the wind speed data. The resulting local and global features are respectively integrated with the original data and are fed into an MLP/LSTM layer for the initial wind speed predictions. Finally,",
    "link": "http://arxiv.org/abs/2211.14434",
    "context": "Title: Multi-Step Short-Term Wind Speed Prediction with Rank Pooling and Fast Fourier Transformation. (arXiv:2211.14434v2 [cs.LG] UPDATED)\nAbstract: Short-term wind speed prediction is essential for economical wind power utilization. The real-world wind speed data is typically intermittent and fluctuating, presenting great challenges to existing shallow models. In this paper, we present a novel deep hybrid model for multi-step wind speed prediction, namely LR-FFT-RP-MLP/LSTM (Linear Fast Fourier Transformation Rank Pooling Multiple-Layer Perception/Long Short-Term Memory). Our hybrid model processes the local and global input features simultaneously. We leverage Rank Pooling (RP) for the local feature extraction to capture the temporal structure while maintaining the temporal order. Besides, to understand the wind periodic patterns, we exploit Fast Fourier Transformation (FFT) to extract global features and relevant frequency components in the wind speed data. The resulting local and global features are respectively integrated with the original data and are fed into an MLP/LSTM layer for the initial wind speed predictions. Finally,",
    "path": "papers/22/11/2211.14434.json",
    "total_tokens": 1032,
    "translated_title": "基于排序池化和快速傅里叶变换的多步短期风速预测",
    "translated_abstract": "短期风速预测对于经济利用风能至关重要。现实世界中的风速数据通常是间歇性和波动性的，对现有浅层模型提出了很大的挑战。本文提出了一种新型深度混合模型用于多步风速预测，名为LR-FFT-RP-MLP/LSTM（线性快速傅里叶变换排序池化多层感知/长短期记忆）。我们的混合模型同时处理本地和全局输入特征。我们利用排序池化（RP）进行本地特征提取以捕捉时间结构同时保持时间顺序。此外，为了了解风的周期性模式，我们利用快速傅里叶变换（FFT）提取全局特征和风速数据中相关的频率分量。产生的本地和全局特征分别与原始数据集成，然后输入MLP/LSTM层进行初始的风速预测。最后，预测结果基于先前的多步预测进行更新。我们在两个真实世界数据集上进行了实验，证明我们提出的模型优于几个基准模型，达到了最先进的结果。",
    "tldr": "本文提出了一种新型深度混合模型LR-FFT-RP-MLP/LSTM，利用排序池化和快速傅里叶变换进行多步短期风速预测，实验结果表明其优于几个基准模型并达到最先进水平。",
    "en_tdlr": "A novel deep hybrid model, LR-FFT-RP-MLP/LSTM, is proposed for multi-step short-term wind speed prediction, which leverages rank pooling and fast Fourier transformation to extract local and global features respectively. The experimental results show that the proposed model outperforms several baseline models and achieves state-of-the-art performance."
}