{
    "title": "GREAD: Graph Neural Reaction-Diffusion Networks. (arXiv:2211.14208v2 [cs.LG] UPDATED)",
    "abstract": "Graph neural networks (GNNs) are one of the most popular research topics for deep learning. GNN methods typically have been designed on top of the graph signal processing theory. In particular, diffusion equations have been widely used for designing the core processing layer of GNNs, and therefore they are inevitably vulnerable to the notorious oversmoothing problem. Recently, a couple of papers paid attention to reaction equations in conjunctions with diffusion equations. However, they all consider limited forms of reaction equations. To this end, we present a reaction-diffusion equation-based GNN method that considers all popular types of reaction equations in addition to one special reaction equation designed by us. To our knowledge, our paper is one of the most comprehensive studies on reaction-diffusion equation-based GNNs. In our experiments with 9 datasets and 28 baselines, our method, called GREAD, outperforms them in a majority of cases. Further synthetic data experiments show",
    "link": "http://arxiv.org/abs/2211.14208",
    "context": "Title: GREAD: Graph Neural Reaction-Diffusion Networks. (arXiv:2211.14208v2 [cs.LG] UPDATED)\nAbstract: Graph neural networks (GNNs) are one of the most popular research topics for deep learning. GNN methods typically have been designed on top of the graph signal processing theory. In particular, diffusion equations have been widely used for designing the core processing layer of GNNs, and therefore they are inevitably vulnerable to the notorious oversmoothing problem. Recently, a couple of papers paid attention to reaction equations in conjunctions with diffusion equations. However, they all consider limited forms of reaction equations. To this end, we present a reaction-diffusion equation-based GNN method that considers all popular types of reaction equations in addition to one special reaction equation designed by us. To our knowledge, our paper is one of the most comprehensive studies on reaction-diffusion equation-based GNNs. In our experiments with 9 datasets and 28 baselines, our method, called GREAD, outperforms them in a majority of cases. Further synthetic data experiments show",
    "path": "papers/22/11/2211.14208.json",
    "total_tokens": 914,
    "translated_title": "GREAD: 基于图神经反应扩散网络的研究",
    "translated_abstract": "图神经网络是深度学习中最受欢迎的研究课题之一。GNN方法通常是基于图信号处理理论进行设计的。特别地，扩散方程被广泛用于设计GNN的核心处理层，因此不可避免地容易出现过度平滑问题。最近，有几篇论文注意到反应方程和扩散方程的结合。不过，它们都只考虑了有限的反应方程形式。因此，我们提出了一种基于反应扩散方程的GNN方法，考虑了所有流行的反应方程类型和我们设计的一种特殊反应方程。据我们所知，我们的论文是关于基于反应扩散方程的GNN的最全面的研究之一。在我们使用9个数据集和28个基准模型进行的实验中，我们的方法 GREAD 在大多数情况下性能优于它们。进一步的人工数据实验显示……",
    "tldr": "本文介绍了一种基于反应扩散方程的GNN方法，考虑了所有流行的反应方程类型和一种特殊的反应方程，是目前其中最全面的研究之一，并在实验中表现出更好的性能。",
    "en_tdlr": "This paper introduces a GNN method based on reaction-diffusion equations, which considers all popular types of reaction equations and one special reaction equation designed by the authors. It is one of the most comprehensive studies on this topic and outperforms other baselines in most cases according to experiments with 9 datasets and 28 baselines."
}