{
    "title": "Artificial Intelligence for Automatic Detection and Classification Disease on the X-Ray Images. (arXiv:2211.08244v2 [eess.IV] UPDATED)",
    "abstract": "Detecting and classifying diseases using X-ray images is one of the more challenging core tasks in the medical and research world. Due to the recent high interest in radiological images and AI, early detection of diseases in X-ray images has become notably more essential to prevent further spreading and flatten the curve. Innovations and revolutions of Computer Vision with Deep learning methods offer great promise for fast and accurate diagnosis of screening and detection from chest X-ray images (CXR). This work presents rapid detection of diseases in the lung using the efficient Deep learning pre-trained RepVGG algorithm for deep feature extraction and classification. We used X-ray images as an example to show the model's efficiency. To perform this task, we classify X-Ray images into Covid-19, Pneumonia, and Normal X-Ray images. Employ ROI object to improve the detection accuracy for lung extraction, followed by data pre-processing and augmentation. We are applying Artificial Intelli",
    "link": "http://arxiv.org/abs/2211.08244",
    "context": "Title: Artificial Intelligence for Automatic Detection and Classification Disease on the X-Ray Images. (arXiv:2211.08244v2 [eess.IV] UPDATED)\nAbstract: Detecting and classifying diseases using X-ray images is one of the more challenging core tasks in the medical and research world. Due to the recent high interest in radiological images and AI, early detection of diseases in X-ray images has become notably more essential to prevent further spreading and flatten the curve. Innovations and revolutions of Computer Vision with Deep learning methods offer great promise for fast and accurate diagnosis of screening and detection from chest X-ray images (CXR). This work presents rapid detection of diseases in the lung using the efficient Deep learning pre-trained RepVGG algorithm for deep feature extraction and classification. We used X-ray images as an example to show the model's efficiency. To perform this task, we classify X-Ray images into Covid-19, Pneumonia, and Normal X-Ray images. Employ ROI object to improve the detection accuracy for lung extraction, followed by data pre-processing and augmentation. We are applying Artificial Intelli",
    "path": "papers/22/11/2211.08244.json",
    "total_tokens": 977,
    "translated_title": "人工智能用于X射线图像的自动检测和疾病分类",
    "translated_abstract": "在医学和研究领域中，使用X射线图像进行疾病的检测和分类是更具挑战性的核心任务之一。由于近期对放射学图像和人工智能的高度关注，通过X射线图像早期检测疾病变得更加重要，以预防进一步传播和压平曲线。计算机视觉与深度学习方法的创新和革命为快速准确地诊断筛查和检测胸部X射线图像（CXR）提供了巨大的希望。本研究提出了使用高效的深度学习预训练算法RepVGG进行深度特征提取和分类的肺疾病快速检测。我们使用X射线图像作为示例来展示模型的效率。为了完成这个任务，我们将X射线图像分为Covid-19、肺炎和正常的X射线图像进行分类。采用ROI对象来提高肺部提取的检测准确性，随后进行数据预处理和增强。我们正在应用人工智能方法...",
    "tldr": "该论文研究了人工智能在X射线图像上的自动检测和疾病分类的应用。通过使用深度学习方法和RepVGG算法进行快速准确的肺部疾病检测，以实现早期疾病的诊断和预防进一步传播。",
    "en_tdlr": "This paper investigates the application of artificial intelligence in automatic detection and classification of diseases on X-ray images. It utilizes deep learning methods and the RepVGG algorithm for fast and accurate detection of lung diseases, aiming for early diagnosis and prevention of further spread."
}