{
    "title": "Knowledge-Aware Federated Active Learning with Non-IID Data. (arXiv:2211.13579v2 [cs.LG] UPDATED)",
    "abstract": "Federated learning enables multiple decentralized clients to learn collaboratively without sharing the local training data. However, the expensive annotation cost to acquire data labels on local clients remains an obstacle in utilizing local data. In this paper, we propose a federated active learning paradigm to efficiently learn a global model with limited annotation budget while protecting data privacy in a decentralized learning way. The main challenge faced by federated active learning is the mismatch between the active sampling goal of the global model on the server and that of the asynchronous local clients. This becomes even more significant when data is distributed non-IID across local clients. To address the aforementioned challenge, we propose Knowledge-Aware Federated Active Learning (KAFAL), which consists of Knowledge-Specialized Active Sampling (KSAS) and Knowledge-Compensatory Federated Update (KCFU). KSAS is a novel active sampling method tailored for the federated acti",
    "link": "http://arxiv.org/abs/2211.13579",
    "context": "Title: Knowledge-Aware Federated Active Learning with Non-IID Data. (arXiv:2211.13579v2 [cs.LG] UPDATED)\nAbstract: Federated learning enables multiple decentralized clients to learn collaboratively without sharing the local training data. However, the expensive annotation cost to acquire data labels on local clients remains an obstacle in utilizing local data. In this paper, we propose a federated active learning paradigm to efficiently learn a global model with limited annotation budget while protecting data privacy in a decentralized learning way. The main challenge faced by federated active learning is the mismatch between the active sampling goal of the global model on the server and that of the asynchronous local clients. This becomes even more significant when data is distributed non-IID across local clients. To address the aforementioned challenge, we propose Knowledge-Aware Federated Active Learning (KAFAL), which consists of Knowledge-Specialized Active Sampling (KSAS) and Knowledge-Compensatory Federated Update (KCFU). KSAS is a novel active sampling method tailored for the federated acti",
    "path": "papers/22/11/2211.13579.json",
    "total_tokens": 880,
    "translated_title": "知识感知的非IID数据联邦主动学习",
    "translated_abstract": "联邦学习使得多个分散的客户端能够在不共享本地训练数据的情况下进行协作学习。然而，获取本地数据标签的昂贵注释成本仍然是利用本地数据的障碍。在本文中，我们提出了一种联邦主动学习范式，以在有限注释预算的同时保护数据隐私，以分散化学习的方式高效地学习全局模型。联邦主动学习面临的主要挑战是服务器端全局模型的主动抽样目标与异步本地客户端的目标不匹配。当数据在本地客户端之间分布非IID时，这一挑战变得更加重要。为了解决上述挑战，我们提出了一种知识感知的联邦主动学习(KAFAL)方法，它包括知识专业化主动抽样(KSAS)和知识补偿联邦更新(KCFU)。",
    "tldr": "本文提出了一种知识感知的非IID数据联邦主动学习方法，通过知识专业化主动抽样和知识补偿联邦更新来解决联邦主动学习中的目标不匹配问题。",
    "en_tdlr": "This paper proposes a knowledge-aware federated active learning approach to address the mismatch between global model's active sampling goal and that of asynchronous local clients in federated learning. The approach includes knowledge-specialized active sampling and knowledge-compensatory federated update."
}