{
    "title": "Score-based calibration testing for multivariate forecast distributions. (arXiv:2211.16362v2 [econ.EM] UPDATED)",
    "abstract": "Multivariate distributional forecasts have become widespread in recent years. To assess the quality of such forecasts, suitable evaluation methods are needed. In the univariate case, calibration tests based on the probability integral transform (PIT) are routinely used. However, multivariate extensions of PIT-based calibration tests face various challenges. We therefore introduce a general framework for calibration testing in the multivariate case and propose two new tests that arise from it. Both approaches use proper scoring rules and are simple to implement even in large dimensions. The first employs the PIT of the score. The second is based on comparing the expected performance of the forecast distribution (i.e., the expected score) to its actual performance based on realized observations (i.e., the realized score). The tests have good size and power properties in simulations and solve various problems of existing tests. We apply the new tests to forecast distributions for macroeco",
    "link": "http://arxiv.org/abs/2211.16362",
    "context": "Title: Score-based calibration testing for multivariate forecast distributions. (arXiv:2211.16362v2 [econ.EM] UPDATED)\nAbstract: Multivariate distributional forecasts have become widespread in recent years. To assess the quality of such forecasts, suitable evaluation methods are needed. In the univariate case, calibration tests based on the probability integral transform (PIT) are routinely used. However, multivariate extensions of PIT-based calibration tests face various challenges. We therefore introduce a general framework for calibration testing in the multivariate case and propose two new tests that arise from it. Both approaches use proper scoring rules and are simple to implement even in large dimensions. The first employs the PIT of the score. The second is based on comparing the expected performance of the forecast distribution (i.e., the expected score) to its actual performance based on realized observations (i.e., the realized score). The tests have good size and power properties in simulations and solve various problems of existing tests. We apply the new tests to forecast distributions for macroeco",
    "path": "papers/22/11/2211.16362.json",
    "total_tokens": 889,
    "translated_title": "多元预测分布的基于评分的校准测试",
    "translated_abstract": "多元分布预测近年来已经广泛应用。为了评估此类预测的质量，需要合适的评估方法。在单变量情况下，基于概率积分变换的校准测试已成为常规方法。然而，基于PIT的多变量校准测试面临着各种挑战。因此，我们引入了一个适用于多元情况的普适性校准测试框架，并提出了两个由此产生的新测试。两种方法都使用适当的评分规则，即使在大维数情况下也很容易实现。第一种方法使用评分的概率积分变换。第二种方法基于将预测分布的预期性能（即预期得分）与基于实际观测数据（即实现得分）的实际性能进行比较。这些测试在模拟中具有良好的尺寸和功率特性，解决了现有测试的各种问题。我们将新测试应用于宏观经济预测分布。",
    "tldr": "该论文提出了针对多元预测分布的基于评分的校准测试方法，包括评分的概率积分变换和预期性能实际性能比较两种方法，并通过模拟测试证明其有效性。",
    "en_tdlr": "This paper proposes score-based calibration testing methods for multivariate forecast distributions, including two approaches: probability integral transform of the score and comparison of expected vs. realized performance. The tests have good properties in simulation experiments and solve existing problems."
}