{
    "title": "Generalized Difference-in-differences Models: Robust Bounds. (arXiv:2211.06710v4 [econ.EM] UPDATED)",
    "abstract": "The difference-in-differences (DID) method identifies the average treatment effects on the treated (ATT) under mainly the so-called parallel trends (PT) assumption. The most common and widely used approach to justify the PT assumption is the pre-treatment period examination. If a null hypothesis of the same trend in the outcome means for both treatment and control groups in the pre-treatment periods is rejected, researchers believe less in PT and the DID results. This paper develops a robust generalized DID method that utilizes all the information available not only from the pre-treatment periods but also from multiple data sources. Our approach interprets PT in a different way using a notion of selection bias, which enables us to generalize the standard DID estimand by defining an information set that may contain multiple pre-treatment periods or other baseline covariates. Our main assumption states that the selection bias in the post-treatment period lies within the convex hull of al",
    "link": "http://arxiv.org/abs/2211.06710",
    "context": "Title: Generalized Difference-in-differences Models: Robust Bounds. (arXiv:2211.06710v4 [econ.EM] UPDATED)\nAbstract: The difference-in-differences (DID) method identifies the average treatment effects on the treated (ATT) under mainly the so-called parallel trends (PT) assumption. The most common and widely used approach to justify the PT assumption is the pre-treatment period examination. If a null hypothesis of the same trend in the outcome means for both treatment and control groups in the pre-treatment periods is rejected, researchers believe less in PT and the DID results. This paper develops a robust generalized DID method that utilizes all the information available not only from the pre-treatment periods but also from multiple data sources. Our approach interprets PT in a different way using a notion of selection bias, which enables us to generalize the standard DID estimand by defining an information set that may contain multiple pre-treatment periods or other baseline covariates. Our main assumption states that the selection bias in the post-treatment period lies within the convex hull of al",
    "path": "papers/22/11/2211.06710.json",
    "total_tokens": 877,
    "translated_title": "广义差异-in-差异模型：稳健的界限",
    "translated_abstract": "差异-in-差异（DID）方法主要基于平行趋势（PT）假设，确定了被治疗对象的平均治疗效果（ATT）。通常，预处理期检验是证明PT假设的最常用方法。如果预处理期内治疗组和对照组的结果平均值趋势假设被拒绝，研究人员则对PT和DID结果的可信程度降低。本文发展了一个鲁棒的广义DID方法，利用所有可用的信息，不仅包括来自预处理期的信息，还包括来自多个数据来源的信息。我们采用一种不同于常规DID方法的方法来解释PT，利用了选择偏差的概念，使我们能够通过定义可能包含多个预处理期或其他基线协变量的信息集来推广标准DID估计量。我们的主要假设是，后处理期的选择偏差在所有可能结果的凸包内。",
    "tldr": "该论文发展了一个鲁棒的广义DID方法，可以利用多个数据来源的信息来推断治疗效果。这种方法通过选择偏差的概念重新解释了平行趋势假设，适用性更广泛。",
    "en_tdlr": "This paper develops a robust generalized DID method that utilizes information from multiple data sources to infer treatment effects, and reinterprets the parallel trends assumption using the concept of selection bias, making it more widely applicable."
}