{
    "title": "Hierarchical Proxy Modeling for Improved HPO in Time Series Forecasting. (arXiv:2211.15092v2 [cs.LG] UPDATED)",
    "abstract": "Selecting the right set of hyperparameters is crucial in time series forecasting. The classical temporal cross-validation framework for hyperparameter optimization (HPO) often leads to poor test performance because of a possible mismatch between validation and test periods. To address this test-validation mismatch, we propose a novel technique, H-Pro to drive HPO via test proxies by exploiting data hierarchies often associated with time series datasets. Since higher-level aggregated time series often show less irregularity and better predictability as compared to the lowest-level time series which can be sparse and intermittent, we optimize the hyperparameters of the lowest-level base-forecaster by leveraging the proxy forecasts for the test period generated from the forecasters at higher levels. H-Pro can be applied on any off-the-shelf machine learning model to perform HPO. We validate the efficacy of our technique with extensive empirical evaluation on five publicly available hierar",
    "link": "http://arxiv.org/abs/2211.15092",
    "context": "Title: Hierarchical Proxy Modeling for Improved HPO in Time Series Forecasting. (arXiv:2211.15092v2 [cs.LG] UPDATED)\nAbstract: Selecting the right set of hyperparameters is crucial in time series forecasting. The classical temporal cross-validation framework for hyperparameter optimization (HPO) often leads to poor test performance because of a possible mismatch between validation and test periods. To address this test-validation mismatch, we propose a novel technique, H-Pro to drive HPO via test proxies by exploiting data hierarchies often associated with time series datasets. Since higher-level aggregated time series often show less irregularity and better predictability as compared to the lowest-level time series which can be sparse and intermittent, we optimize the hyperparameters of the lowest-level base-forecaster by leveraging the proxy forecasts for the test period generated from the forecasters at higher levels. H-Pro can be applied on any off-the-shelf machine learning model to perform HPO. We validate the efficacy of our technique with extensive empirical evaluation on five publicly available hierar",
    "path": "papers/22/11/2211.15092.json",
    "total_tokens": 897,
    "translated_title": "提升时间序列预测中超参数优化的分层代理建模",
    "translated_abstract": "在时间序列预测中，选择正确的超参数集是至关重要的。传统的时间交叉验证框架在超参数优化中经常导致测试性能差，因为验证和测试期间可能存在不匹配的情况。为了解决这个测试-验证不匹配问题，我们提出了一种新颖的技术，即H-Pro，通过利用与时间序列数据集经常相关的数据层次结构，通过测试代理来驱动HPO。由于高层次的聚合时间序列通常显示出较少的不规则性和更好的可预测性，相比之下最低层次的时间序列可能是稀疏和间歇性的，我们通过利用高层次预测器生成的测试期间的代理预测结果来优化最低层次的基本预测器的超参数。H-Pro可以应用于任何现成的机器学习模型进行HPO。我们通过对五个公开可用的分层时间序列数据集进行了大量的经验评估，验证了我们的技术的有效性。",
    "tldr": "该论文提出了一种使用分层代理建模的技术H-Pro，通过利用时间序列数据的层次结构，通过测试代理驱动超参数优化，以解决测试验证期间不匹配的问题，并验证了该技术在时间序列数据集上的有效性。"
}