{
    "title": "Peer Effects in Labor Market Training. (arXiv:2211.12366v2 [econ.EM] UPDATED)",
    "abstract": "This paper shows that the group composition matters for the effectiveness of labor market training programs for jobseekers. Using rich administrative data from Germany, I document that greater average exposure to highly employable peers leads to increased employment stability after program participation. Peer effects on earnings are positive and long-lasting in classic vocational training and negative but of short duration in retraining, pointing to different mechanisms. Finally, I also find evidence for non-linearities in effects and show that more heterogeneity in the peer group is detrimental.",
    "link": "http://arxiv.org/abs/2211.12366",
    "context": "Title: Peer Effects in Labor Market Training. (arXiv:2211.12366v2 [econ.EM] UPDATED)\nAbstract: This paper shows that the group composition matters for the effectiveness of labor market training programs for jobseekers. Using rich administrative data from Germany, I document that greater average exposure to highly employable peers leads to increased employment stability after program participation. Peer effects on earnings are positive and long-lasting in classic vocational training and negative but of short duration in retraining, pointing to different mechanisms. Finally, I also find evidence for non-linearities in effects and show that more heterogeneity in the peer group is detrimental.",
    "path": "papers/22/11/2211.12366.json",
    "total_tokens": 805,
    "translated_title": "劳动力市场培训中的同侪效应",
    "translated_abstract": "本文展示了培训计划中的群体组成对于求职者工作市场培训计划效果的影响。利用德国丰富的行政数据，笔者发现，高度就业同侪平均暴露的增加，可提高参与培训计划后的就业稳定性。职业技能培训对收入的同侪效应是积极和长期的，但进修培训的效果则是负面和短暂的，指向了不同的机制。最后，笔者发现效应非线性，并证明同侪群体中的更多异质性是有害的。",
    "tldr": "本文研究了劳动力市场培训中的同侪效应，发现高度就业同侪的平均暴露可以提高参与培训计划后的就业稳定性。职业技能培训对收入的同侪效应是积极和长期的，但进修培训的效果则是负面和短暂的，同时还发现效应非线性，更多的群体异质性是有害的。",
    "en_tdlr": "This paper explores the peer effects in labor market training and finds that greater average exposure to highly employable peers leads to increased employment stability after program participation. The paper also discovers different mechanisms in the positive and long-lasting peer effects on earnings in classic vocational training and the negative and short-term effects in retraining. Finally, the research shows the non-linearities in effects and the detrimental effect of more heterogeneity in the peer group."
}