{
    "title": "General time-reversal equivariant neural network potential for magnetic materials. (arXiv:2211.11403v3 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "This study introduces time-reversal E(3)-equivariant neural network and SpinGNN++ framework for constructing a comprehensive interatomic potential for magnetic systems, encompassing spin-orbit coupling and noncollinear magnetic moments. SpinGNN++ integrates multitask spin equivariant neural network with explicit spin-lattice terms, including Heisenberg, Dzyaloshinskii-Moriya, Kitaev, single-ion anisotropy, and biquadratic interactions, and employs time-reversal equivariant neural network to learn high-order spin-lattice interactions using time-reversal E(3)-equivariant convolutions. To validate SpinGNN++, a complex magnetic model dataset is introduced as a benchmark and employed to demonstrate its capabilities. SpinGNN++ provides accurate descriptions of the complex spin-lattice coupling in monolayer CrI$_3$ and CrTe$_2$, achieving sub-meV errors. Importantly, it facilitates large-scale parallel spin-lattice dynamics, thereby enabling the exploration of associated properties, including",
    "link": "http://arxiv.org/abs/2211.11403",
    "context": "Title: General time-reversal equivariant neural network potential for magnetic materials. (arXiv:2211.11403v3 [cond-mat.mtrl-sci] UPDATED)\nAbstract: This study introduces time-reversal E(3)-equivariant neural network and SpinGNN++ framework for constructing a comprehensive interatomic potential for magnetic systems, encompassing spin-orbit coupling and noncollinear magnetic moments. SpinGNN++ integrates multitask spin equivariant neural network with explicit spin-lattice terms, including Heisenberg, Dzyaloshinskii-Moriya, Kitaev, single-ion anisotropy, and biquadratic interactions, and employs time-reversal equivariant neural network to learn high-order spin-lattice interactions using time-reversal E(3)-equivariant convolutions. To validate SpinGNN++, a complex magnetic model dataset is introduced as a benchmark and employed to demonstrate its capabilities. SpinGNN++ provides accurate descriptions of the complex spin-lattice coupling in monolayer CrI$_3$ and CrTe$_2$, achieving sub-meV errors. Importantly, it facilitates large-scale parallel spin-lattice dynamics, thereby enabling the exploration of associated properties, including",
    "path": "papers/22/11/2211.11403.json",
    "total_tokens": 1018,
    "translated_title": "磁性材料的时间反演等变神经网络势",
    "translated_abstract": "本研究引入了时间反演E(3)等变神经网络和SpinGNN++框架，用于构建磁性系统的全面原子间势能，包括自旋轨道耦合和非共线磁矩。SpinGNN++将多任务自旋等变神经网络与显式自旋格子项相结合，包括海森堡、Dzyaloshinskii-Moriya、Kitaev、单离子各向异性和二次项相互作用，并采用时间反演等变神经网络来学习高阶自旋-格子相互作用。为了验证SpinGNN++，引入了一个复杂的磁性模型数据集作为基准，并用它来展示其能力。SpinGNN++能够准确描述单层CrI$_3$和CrTe$_2$中复杂的自旋-格子耦合，达到亚毫电子伏特的误差。重要的是，它能够进行大规模并行自旋-格子动力学计算，从而实现相关性质的探索。",
    "tldr": "本研究提出了时间反演等变神经网络势SpinGNN++，用于磁性系统的全面原子间势能建模和大规模并行自旋-格子动力学计算。通过引入复杂磁性模型数据并验证其能力，SpinGNN++展示了精确描述磁性材料自旋-格子耦合的能力，为相关性质的探索提供了重要工具。",
    "en_tdlr": "This study proposes the time-reversal equivariant neural network potential SpinGNN++, which enables comprehensive interatomic potential modeling and large-scale parallel spin-lattice dynamics calculations for magnetic systems. By introducing a complex magnetic model dataset and validating its capabilities, SpinGNN++ demonstrates accurate descriptions of spin-lattice coupling in magnetic materials, providing an important tool for exploring related properties."
}