{
    "title": "MedleyVox: An Evaluation Dataset for Multiple Singing Voices Separation. (arXiv:2211.07302v2 [cs.SD] UPDATED)",
    "abstract": "Separation of multiple singing voices into each voice is a rarely studied area in music source separation research. The absence of a benchmark dataset has hindered its progress. In this paper, we present an evaluation dataset and provide baseline studies for multiple singing voices separation. First, we introduce MedleyVox, an evaluation dataset for multiple singing voices separation. We specify the problem definition in this dataset by categorizing it into i) unison, ii) duet, iii) main vs. rest, and iv) N-singing separation. Second, to overcome the absence of existing multi-singing datasets for a training purpose, we present a strategy for construction of multiple singing mixtures using various single-singing datasets. Third, we propose the improved super-resolution network (iSRNet), which greatly enhances initial estimates of separation networks. Jointly trained with the Conv-TasNet and the multi-singing mixture construction strategy, the proposed iSRNet achieved comparable performa",
    "link": "http://arxiv.org/abs/2211.07302",
    "context": "Title: MedleyVox: An Evaluation Dataset for Multiple Singing Voices Separation. (arXiv:2211.07302v2 [cs.SD] UPDATED)\nAbstract: Separation of multiple singing voices into each voice is a rarely studied area in music source separation research. The absence of a benchmark dataset has hindered its progress. In this paper, we present an evaluation dataset and provide baseline studies for multiple singing voices separation. First, we introduce MedleyVox, an evaluation dataset for multiple singing voices separation. We specify the problem definition in this dataset by categorizing it into i) unison, ii) duet, iii) main vs. rest, and iv) N-singing separation. Second, to overcome the absence of existing multi-singing datasets for a training purpose, we present a strategy for construction of multiple singing mixtures using various single-singing datasets. Third, we propose the improved super-resolution network (iSRNet), which greatly enhances initial estimates of separation networks. Jointly trained with the Conv-TasNet and the multi-singing mixture construction strategy, the proposed iSRNet achieved comparable performa",
    "path": "papers/22/11/2211.07302.json",
    "total_tokens": 1004,
    "translated_title": "MedleyVox: 一份用于多声部歌曲分离的评估数据集",
    "translated_abstract": "多声部歌曲分离是音乐源分离研究中鲜为人知的领域。缺乏基准数据集阻碍了其进展。本文提出了一份评估数据集，并为多声部歌曲分离提供了基准研究。首先，我们介绍了 MedleyVox，这是一份用于多声部歌曲分离的评估数据集。我们通过将其分类为 i) 合唱、ii) 二重唱、iii) 主声部和其余声部、和 iv) N 声部分离来指定该数据集中的问题定义。其次，为了解决缺乏用于训练的现有多声部数据集的问题，我们提出了一种使用各种单声部数据集构建多声部混合物的策略。第三，我们提出了改进的超分辨率网络（iSRNet），它极大地增强了分离网络的初始估计。与 Conv-TasNet 和多声部混合物构建策略一起进行联合训练，所提出的 iSRNet 实现了可比较的性能。",
    "tldr": "本文提出了用于多声部歌曲分离的评估数据集 MedleyVox，为解决缺乏用于训练的现有多声部数据集的问题，提出了使用各种单声部数据集构建多声部混合物的策略，并提出了改进的超分辨率网络（iSRNet），实现了可比较的性能。",
    "en_tdlr": "This paper presents an evaluation dataset MedleyVox for multiple singing voices separation, and proposes a strategy for constructing multiple singing mixtures using various single-singing datasets to address the lack of existing multi-singing datasets for training. It also introduces the improved super-resolution network (iSRNet) which achieved comparable performance when jointly trained with Conv-TasNet and the multi-singing mixture construction strategy."
}