{
    "title": "An Isolation-Aware Online Virtual Network Embedding via Deep Reinforcement Learning. (arXiv:2211.14158v2 [cs.NI] UPDATED)",
    "abstract": "Virtualization technologies are the foundation of modern ICT infrastructure, enabling service providers to create dedicated virtual networks (VNs) that can support a wide range of smart city applications. These VNs continuously generate massive amounts of data, necessitating stringent reliability and security requirements. In virtualized network environments, however, multiple VNs may coexist on the same physical infrastructure and, if not properly isolated, may interfere with or provide unauthorized access to one another. The former causes performance degradation, while the latter compromises the security of VNs. Service assurance for infrastructure providers becomes significantly more complicated when a specific VN violates the isolation requirement.  In an effort to address the isolation issue, this paper proposes isolation during virtual network embedding (VNE), the procedure of allocating VNs onto physical infrastructure. We define a simple abstracted concept of isolation levels t",
    "link": "http://arxiv.org/abs/2211.14158",
    "context": "Title: An Isolation-Aware Online Virtual Network Embedding via Deep Reinforcement Learning. (arXiv:2211.14158v2 [cs.NI] UPDATED)\nAbstract: Virtualization technologies are the foundation of modern ICT infrastructure, enabling service providers to create dedicated virtual networks (VNs) that can support a wide range of smart city applications. These VNs continuously generate massive amounts of data, necessitating stringent reliability and security requirements. In virtualized network environments, however, multiple VNs may coexist on the same physical infrastructure and, if not properly isolated, may interfere with or provide unauthorized access to one another. The former causes performance degradation, while the latter compromises the security of VNs. Service assurance for infrastructure providers becomes significantly more complicated when a specific VN violates the isolation requirement.  In an effort to address the isolation issue, this paper proposes isolation during virtual network embedding (VNE), the procedure of allocating VNs onto physical infrastructure. We define a simple abstracted concept of isolation levels t",
    "path": "papers/22/11/2211.14158.json",
    "total_tokens": 841,
    "translated_title": "一种基于深度强化学习的隔离感知在线虚拟网络嵌入方法",
    "translated_abstract": "虚拟化技术是现代ICT基础设施的基础，它使服务提供商能够创建支持各种智能城市应用的专用虚拟网络（VN）。这些VN不断产生大量数据，需要严格的可靠性和安全性要求。然而，在虚拟化网络环境中，多个VN可能共存于同一物理基础设施上，如果隔离不当，则可能相互干扰或提供未经授权的访问。前者会导致性能降低，后者会破坏VN的安全性。当特定VN违反隔离要求时，基础设施提供商的服务保障变得更加复杂。为解决隔离问题，本文提出在虚拟网络嵌入（VNE）期间进行隔离，即将VN分配到物理基础设施上的过程。",
    "tldr": "本文提出了一种基于深度强化学习的隔离感知在线虚拟网络嵌入方法，以解决虚拟网络环境中多个VN共存可能导致隔离问题的挑战。",
    "en_tdlr": "This paper proposes an isolation-aware online virtual network embedding method based on deep reinforcement learning to address the challenge of isolation issues that may arise when multiple VNs coexist in virtualized network environments."
}