{
    "title": "Establishment of Neural Networks Robust to Label Noise. (arXiv:2211.15279v3 [cs.LG] UPDATED)",
    "abstract": "Label noise is a significant obstacle in deep learning model training. It can have a considerable impact on the performance of image classification models, particularly deep neural networks, which are especially susceptible because they have a strong propensity to memorise noisy labels. In this paper, we have examined the fundamental concept underlying related label noise approaches. A transition matrix estimator has been created, and its effectiveness against the actual transition matrix has been demonstrated. In addition, we examined the label noise robustness of two convolutional neural network classifiers with LeNet and AlexNet designs. The two FashionMINIST datasets have revealed the robustness of both models. We are not efficiently able to demonstrate the influence of the transition matrix noise correction on robustness enhancements due to our inability to correctly tune the complex convolutional neural network model due to time and computing resource constraints. There is a need",
    "link": "http://arxiv.org/abs/2211.15279",
    "context": "Title: Establishment of Neural Networks Robust to Label Noise. (arXiv:2211.15279v3 [cs.LG] UPDATED)\nAbstract: Label noise is a significant obstacle in deep learning model training. It can have a considerable impact on the performance of image classification models, particularly deep neural networks, which are especially susceptible because they have a strong propensity to memorise noisy labels. In this paper, we have examined the fundamental concept underlying related label noise approaches. A transition matrix estimator has been created, and its effectiveness against the actual transition matrix has been demonstrated. In addition, we examined the label noise robustness of two convolutional neural network classifiers with LeNet and AlexNet designs. The two FashionMINIST datasets have revealed the robustness of both models. We are not efficiently able to demonstrate the influence of the transition matrix noise correction on robustness enhancements due to our inability to correctly tune the complex convolutional neural network model due to time and computing resource constraints. There is a need",
    "path": "papers/22/11/2211.15279.json",
    "total_tokens": 971,
    "translated_title": "建立鲁棒性强的神经网络以克服标签噪声",
    "translated_abstract": "标签噪声是深度学习模型训练中的重要障碍，尤其对于深度神经网络来说影响尤为明显，因为它们很容易记忆嘈杂的标签。在本文中，我们对相关标签噪声方法的基本概念进行了研究。我们创建了一个转换矩阵估计器，并展示了它对于实际转换矩阵的有效性。此外，我们还研究了两个卷积神经网络分类器（LeNet和AlexNet设计）的标签噪声鲁棒性。两个FashionMINIST数据集都展现了这两个模型的鲁棒性。但是，由于时间和计算资源限制，我们不能有效地展示转换矩阵噪声校正对鲁棒性增强的影响。因此，需要建立能够克服标签噪声挑战的神经网络。",
    "tldr": "本文介绍了建立鲁棒性强的神经网络以克服标签噪声的研究，通过创建转换矩阵估计器、研究两个卷积神经网络分类器的标签噪声鲁棒性等，揭示了两个FashionMINIST数据集的鲁棒性，旨在解决深度学习模型训练中标签噪声带来的难题。",
    "en_tdlr": "This paper presents a study on establishing neural networks that can overcome label noise in deep learning model training. By creating a transition matrix estimator and studying the label noise robustness of two convolutional neural network classifiers, the robustness of both models to two FashionMINIST datasets is demonstrated. The aim is to solve the challenge of label noise in deep learning model training."
}