{
    "title": "A Mathematical Runtime Analysis of the Non-dominated Sorting Genetic Algorithm III (NSGA-III). (arXiv:2211.08202v3 [cs.NE] UPDATED)",
    "abstract": "The Non-dominated Sorting Genetic Algorithm II (NSGA-II) is the most prominent multi-objective evolutionary algorithm for real-world applications. While it performs evidently well on bi-objective optimization problems, empirical studies suggest that it is less effective when applied to problems with more than two objectives. A recent mathematical runtime analysis confirmed this observation by proving the NGSA-II for an exponential number of iterations misses a constant factor of the Pareto front of the simple 3-objective OneMinMax problem.  In this work, we provide the first mathematical runtime analysis of the NSGA-III, a refinement of the NSGA-II aimed at better handling more than two objectives. We prove that the NSGA-III with sufficiently many reference points -- a small constant factor more than the size of the Pareto front, as suggested for this algorithm -- computes the complete Pareto front of the 3-objective OneMinMax benchmark in an expected number of O(n log n) iterations. T",
    "link": "http://arxiv.org/abs/2211.08202",
    "context": "Title: A Mathematical Runtime Analysis of the Non-dominated Sorting Genetic Algorithm III (NSGA-III). (arXiv:2211.08202v3 [cs.NE] UPDATED)\nAbstract: The Non-dominated Sorting Genetic Algorithm II (NSGA-II) is the most prominent multi-objective evolutionary algorithm for real-world applications. While it performs evidently well on bi-objective optimization problems, empirical studies suggest that it is less effective when applied to problems with more than two objectives. A recent mathematical runtime analysis confirmed this observation by proving the NGSA-II for an exponential number of iterations misses a constant factor of the Pareto front of the simple 3-objective OneMinMax problem.  In this work, we provide the first mathematical runtime analysis of the NSGA-III, a refinement of the NSGA-II aimed at better handling more than two objectives. We prove that the NSGA-III with sufficiently many reference points -- a small constant factor more than the size of the Pareto front, as suggested for this algorithm -- computes the complete Pareto front of the 3-objective OneMinMax benchmark in an expected number of O(n log n) iterations. T",
    "path": "papers/22/11/2211.08202.json",
    "total_tokens": 912,
    "translated_abstract": "非支配排序遗传算法 II（NSGA-II）是现实世界应用中最著名的多目标进化算法。虽然在双目标优化问题上表现出色，但实证研究表明，在处理超过两个目标的问题时，其效果较差。最近的数学运行时间分析通过证明 NSGA-II 在指数级迭代次数中错过了简单的 3 目标 OneMinMax 问题 Pareto 前沿的常数因子来证实了这一观察结果。在本文中，我们提供了 NSGA-III 的首个数学运行时间分析，NSGA-III 是 NSGA-II 的改进版本，旨在更好地处理超过两个目标。我们证明了当 NSGA-III 的参考点足够多——略大于 Pareto 前沿的大小的小常数因子，如此算法建议——它可以在 O(n log n) 迭代的预期次数内计算出 3 目标 OneMinMax 基准测试的完整 Pareto 前沿。",
    "tldr": "本文提供了 NSGA-III 的首个数学运行时间分析，NSGA-III 可以在 O(n log n) 迭代的预期次数内计算出 3 目标 OneMinMax 基准测试的完整 Pareto 前沿。",
    "en_tdlr": "This paper provides the first mathematical runtime analysis of NSGA-III and proves that NSGA-III can compute the complete Pareto front of the 3-objective OneMinMax benchmark within an expected number of O(n log n) iterations, with a sufficiently large number of reference points."
}