{
    "title": "Data-driven identification and analysis of the glass transition in polymer melts. (arXiv:2211.14220v2 [cond-mat.soft] UPDATED)",
    "abstract": "Understanding the nature of glass transition, as well as precise estimation of the glass transition temperature for polymeric materials, remain open questions in both experimental and theoretical polymer sciences. We propose a data-driven approach, which utilizes the high-resolution details accessible through the molecular dynamics simulation and considers the structural information of individual chains. It clearly identifies the glass transition temperature of polymer melts of weakly semiflexible chains. By combining principal component analysis and clustering, we identify the glass transition temperature in the asymptotic limit even from relatively short-time trajectories, which just reach into the Rouse-like monomer displacement regime. We demonstrate that fluctuations captured by the principal component analysis reflect the change in a chain's behaviour: from conformational rearrangement above to small rearrangements below the glass transition temperature. Our approach is straightf",
    "link": "http://arxiv.org/abs/2211.14220",
    "context": "Title: Data-driven identification and analysis of the glass transition in polymer melts. (arXiv:2211.14220v2 [cond-mat.soft] UPDATED)\nAbstract: Understanding the nature of glass transition, as well as precise estimation of the glass transition temperature for polymeric materials, remain open questions in both experimental and theoretical polymer sciences. We propose a data-driven approach, which utilizes the high-resolution details accessible through the molecular dynamics simulation and considers the structural information of individual chains. It clearly identifies the glass transition temperature of polymer melts of weakly semiflexible chains. By combining principal component analysis and clustering, we identify the glass transition temperature in the asymptotic limit even from relatively short-time trajectories, which just reach into the Rouse-like monomer displacement regime. We demonstrate that fluctuations captured by the principal component analysis reflect the change in a chain's behaviour: from conformational rearrangement above to small rearrangements below the glass transition temperature. Our approach is straightf",
    "path": "papers/22/11/2211.14220.json",
    "total_tokens": 871,
    "translated_title": "基于数据驱动的聚合物熔体玻璃转变的识别与分析",
    "translated_abstract": "理解玻璃转变的性质以及准确估计聚合物材料的玻璃转变温度仍然是实验和理论聚合物科学中的未解之谜。我们提出一种基于数据驱动的方法，利用分子动力学模拟提供的高分辨率细节，并考虑单个链的结构信息。它清楚地识别了弱半刚性聚合物熔体的玻璃转变温度。通过结合主成分分析和聚类，我们即使从相对短时间轨迹中也能够识别出玻璃转变温度，在这些轨迹中，单体的位移达到了Rouse类似的程度。我们证明了主成分分析捕捉到的波动反映了链的行为变化：从玻璃转变温度以上的构象重排到温度以下的小重排。我们的方法是直接的。",
    "tldr": "本研究提出了一种基于数据驱动的方法，通过分子动力学模拟和聚类方法，清晰地识别了聚合物熔体的玻璃转变温度，并揭示了主成分分析在捕捉聚合物链行为变化中的作用。",
    "en_tdlr": "This study proposes a data-driven approach that uses molecular dynamics simulation and clustering methods to identify the glass transition temperature in polymer melts and reveals the role of principal component analysis in capturing changes in polymer chain behavior."
}