{
    "title": "AIONER: All-in-one scheme-based biomedical named entity recognition using deep learning. (arXiv:2211.16944v3 [cs.CL] UPDATED)",
    "abstract": "Biomedical named entity recognition (BioNER) seeks to automatically recognize biomedical entities in natural language text, serving as a necessary foundation for downstream text mining tasks and applications such as information extraction and question answering. Manually labeling training data for the BioNER task is costly, however, due to the significant domain expertise required for accurate annotation. The resulting data scarcity causes current BioNER approaches to be prone to overfitting, to suffer from limited generalizability, and to address a single entity type at a time (e.g., gene or disease). We therefore propose a novel all-in-one (AIO) scheme that uses external data from existing annotated resources to enhance the accuracy and stability of BioNER models. We further present AIONER, a general-purpose BioNER tool based on cutting-edge deep learning and our AIO schema. We evaluate AIONER on 14 BioNER benchmark tasks and show that AIONER is effective, robust, and compares favora",
    "link": "http://arxiv.org/abs/2211.16944",
    "context": "Title: AIONER: All-in-one scheme-based biomedical named entity recognition using deep learning. (arXiv:2211.16944v3 [cs.CL] UPDATED)\nAbstract: Biomedical named entity recognition (BioNER) seeks to automatically recognize biomedical entities in natural language text, serving as a necessary foundation for downstream text mining tasks and applications such as information extraction and question answering. Manually labeling training data for the BioNER task is costly, however, due to the significant domain expertise required for accurate annotation. The resulting data scarcity causes current BioNER approaches to be prone to overfitting, to suffer from limited generalizability, and to address a single entity type at a time (e.g., gene or disease). We therefore propose a novel all-in-one (AIO) scheme that uses external data from existing annotated resources to enhance the accuracy and stability of BioNER models. We further present AIONER, a general-purpose BioNER tool based on cutting-edge deep learning and our AIO schema. We evaluate AIONER on 14 BioNER benchmark tasks and show that AIONER is effective, robust, and compares favora",
    "path": "papers/22/11/2211.16944.json",
    "total_tokens": 936,
    "translated_title": "AIONER: 基于深度学习的全套方案生物医学命名实体识别",
    "translated_abstract": "生物医学命名实体识别（BioNER）旨在自动识别自然语言文本中的生物医学实体，为信息提取和问答等下游文本挖掘任务和应用提供必要的基础。然而，由于准确注释所需的领域专业知识昂贵，因此手动标记训练数据对BioNER任务来说是昂贵的。导致的数据稀缺问题导致当前的BioNER方法容易出现过度拟合，具有有限的泛化能力，并且一次只能解决一种实体类型（例如，基因或疾病）。因此，我们提出了一种新颖的全套方案（AIO）方案，利用现有的注释资源外部数据来提高BioNER模型的准确性和稳定性。我们进一步提出了基于尖端深度学习和我们的AIO方案的通用BioNER工具AIONER。我们在14个BioNER基准任务上评估了AIONER，并展示了AIONER的有效性，稳健性，与其他方法相比优异。",
    "tldr": "AIONER是一种新颖的基于深度学习的全套方案生物医学命名实体识别工具，利用外部数据提高BioNER模型准确性和稳定性，具有良好的性能和泛化能力。",
    "en_tdlr": "AIONER is a novel, deep-learning-based, all-in-one scheme for biomedical named entity recognition (BioNER) that enhances accuracy and stability of models by using external data from annotated resources, with good performance and generalizability."
}