{
    "title": "mOKB6: A Multilingual Open Knowledge Base Completion Benchmark. (arXiv:2211.06959v2 [cs.CL] UPDATED)",
    "abstract": "Automated completion of open knowledge bases (Open KBs), which are constructed from triples of the form (subject phrase, relation phrase, object phrase), obtained via open information extraction (Open IE) system, are useful for discovering novel facts that may not be directly present in the text. However, research in Open KB completion (Open KBC) has so far been limited to resource-rich languages like English. Using the latest advances in multilingual Open IE, we construct the first multilingual Open KBC dataset, called mOKB6, containing facts from Wikipedia in six languages (including English). Improving the previous Open KB construction pipeline by doing multilingual coreference resolution and keeping only entity-linked triples, we create a dense Open KB. We experiment with several models for the task and observe a consistent benefit of combining languages with the help of shared embedding space as well as translations of facts. We also observe that current multilingual models strugg",
    "link": "http://arxiv.org/abs/2211.06959",
    "context": "Title: mOKB6: A Multilingual Open Knowledge Base Completion Benchmark. (arXiv:2211.06959v2 [cs.CL] UPDATED)\nAbstract: Automated completion of open knowledge bases (Open KBs), which are constructed from triples of the form (subject phrase, relation phrase, object phrase), obtained via open information extraction (Open IE) system, are useful for discovering novel facts that may not be directly present in the text. However, research in Open KB completion (Open KBC) has so far been limited to resource-rich languages like English. Using the latest advances in multilingual Open IE, we construct the first multilingual Open KBC dataset, called mOKB6, containing facts from Wikipedia in six languages (including English). Improving the previous Open KB construction pipeline by doing multilingual coreference resolution and keeping only entity-linked triples, we create a dense Open KB. We experiment with several models for the task and observe a consistent benefit of combining languages with the help of shared embedding space as well as translations of facts. We also observe that current multilingual models strugg",
    "path": "papers/22/11/2211.06959.json",
    "total_tokens": 895,
    "translated_title": "mOKB6：一种多语言开放知识库补全基准",
    "translated_abstract": "自动补全开放知识库（Open KB）的能力，有助于发现文本中无法直接呈现的新事实。然而，开放知识库补全（Open KBC）研究至今仅局限于像英语这样的资源丰富语言。与以往的方法不同，我们使用最新的多语言开放信息提取技术，构建了第一个名为mOKB6的多语言Open KBC数据集，包含六种语言（包括英语）的维基百科事实。通过进行多语言共指消解和保留仅有实体链接的三元组，我们改进了先前的Open KB构建流程，创建了一个密集的Open KB。我们尝试了几种模型，并观察到通过共享嵌入空间以及事实的翻译，将多语言组合起来有一致的好处。我们还观察到当前的多语言模型存在困难。",
    "tldr": "该论文使用最新的多语言开放信息提取技术构建了第一个名为mOKB6的多语言Open KBC数据集，旨在补全开放知识库。研究结果表明，将多语言组合起来有一致的好处，但当前的多语言模型存在困难。",
    "en_tdlr": "This paper constructs the first multilingual Open KBC dataset, called mOKB6, using the latest advances in multilingual Open IE and aims to improve the automated completion of open knowledge bases. The research shows that combining languages has consistent benefits, but current multilingual models struggle."
}