{
    "title": "Log-density gradient covariance and automatic metric tensors for Riemann manifold Monte Carlo methods. (arXiv:2211.01746v2 [stat.CO] UPDATED)",
    "abstract": "A metric tensor for Riemann manifold Monte Carlo particularly suited for non-linear Bayesian hierarchical models is proposed. The metric tensor is built from symmetric positive semidefinite log-density gradient covariance (LGC) matrices, which are also proposed and further explored here. The LGCs generalize the Fisher information matrix by measuring the joint information content and dependence structure of both a random variable and the parameters of said variable. Consequently, positive definite Fisher/LGC-based metric tensors may be constructed not only from the observation likelihoods as is current practice, but also from arbitrarily complicated non-linear prior/latent variable structures, provided the LGC may be derived for each conditional distribution used to construct said structures. The proposed methodology is highly automatic and allows for exploitation of any sparsity associated with the model in question. When implemented in conjunction with a Riemann manifold variant of th",
    "link": "http://arxiv.org/abs/2211.01746",
    "context": "Title: Log-density gradient covariance and automatic metric tensors for Riemann manifold Monte Carlo methods. (arXiv:2211.01746v2 [stat.CO] UPDATED)\nAbstract: A metric tensor for Riemann manifold Monte Carlo particularly suited for non-linear Bayesian hierarchical models is proposed. The metric tensor is built from symmetric positive semidefinite log-density gradient covariance (LGC) matrices, which are also proposed and further explored here. The LGCs generalize the Fisher information matrix by measuring the joint information content and dependence structure of both a random variable and the parameters of said variable. Consequently, positive definite Fisher/LGC-based metric tensors may be constructed not only from the observation likelihoods as is current practice, but also from arbitrarily complicated non-linear prior/latent variable structures, provided the LGC may be derived for each conditional distribution used to construct said structures. The proposed methodology is highly automatic and allows for exploitation of any sparsity associated with the model in question. When implemented in conjunction with a Riemann manifold variant of th",
    "path": "papers/22/11/2211.01746.json",
    "total_tokens": 914,
    "translated_title": "对于Riemann流形蒙特卡洛方法的对数密度梯度协方差和自动度量张量的提出",
    "translated_abstract": "提出了一种适用于非线性贝叶斯分层模型的Riemann流形蒙特卡洛方法的度量张量。该度量张量由对称正半定的对数密度梯度协方差（LGC）矩阵构建，本文还对其进行了进一步的探索。LGC可以通过测量随机变量和该变量的参数之间的联合信息内容和依赖结构来推广费舍尔信息矩阵。因此，可以从观测似然函数构造正定的基于费舍尔/LGC的度量张量，而不仅仅是像目前的做法那样仅从观测似然函数构造。同时，只要可以为用于构造这些结构的每个条件分布导出LGC，该方法就具有高度自动化的特点，并且允许利用与特定模型相关联的任何稀疏性。该方法与Riemann流形变体的结合实现时，可以更高效地近似流形上的概率密度，并提高采样效率。",
    "tldr": "提出了一种适用于非线性贝叶斯分层模型的Riemann流形蒙特卡洛方法的度量张量，该方法利用对数密度梯度协方差矩阵构造度量张量，可以从任意复杂的非线性先验/潜变量结构中构建度量张量，该方法具有自动化的特点并允许利用模型的稀疏性。"
}