{
    "title": "Farm-wide virtual load monitoring for offshore wind structures via Bayesian neural networks. (arXiv:2211.00642v2 [cs.LG] UPDATED)",
    "abstract": "Offshore wind structures are subject to deterioration mechanisms throughout their operational lifetime. Even if the deterioration evolution of structural elements can be estimated through physics-based deterioration models, the uncertainties involved in the process hurdle the selection of lifecycle management decisions. In this scenario, the collection of relevant information through an efficient monitoring system enables the reduction of uncertainties, ultimately driving more optimal lifecycle decisions. However, a full monitoring instrumentation implemented on all wind turbines in a farm might become unfeasible due to practical and economical constraints. Besides, certain load monitoring systems often become defective after a few years of marine environment exposure. Addressing the aforementioned concerns, a farm-wide virtual load monitoring scheme directed by a fleet-leader wind turbine offers an attractive solution. Fetched with data retrieved from a fully-instrumented wind turbine",
    "link": "http://arxiv.org/abs/2211.00642",
    "context": "Title: Farm-wide virtual load monitoring for offshore wind structures via Bayesian neural networks. (arXiv:2211.00642v2 [cs.LG] UPDATED)\nAbstract: Offshore wind structures are subject to deterioration mechanisms throughout their operational lifetime. Even if the deterioration evolution of structural elements can be estimated through physics-based deterioration models, the uncertainties involved in the process hurdle the selection of lifecycle management decisions. In this scenario, the collection of relevant information through an efficient monitoring system enables the reduction of uncertainties, ultimately driving more optimal lifecycle decisions. However, a full monitoring instrumentation implemented on all wind turbines in a farm might become unfeasible due to practical and economical constraints. Besides, certain load monitoring systems often become defective after a few years of marine environment exposure. Addressing the aforementioned concerns, a farm-wide virtual load monitoring scheme directed by a fleet-leader wind turbine offers an attractive solution. Fetched with data retrieved from a fully-instrumented wind turbine",
    "path": "papers/22/11/2211.00642.json",
    "total_tokens": 820,
    "translated_title": "基于贝叶斯神经网络的离岸风电结构全场虚拟负载监测",
    "translated_abstract": "离岸风电结构在运行寿命内会受到退化机制的影响。即使通过基于物理的退化模型可以估计结构元件的退化演变，但过程中涉及的不确定性阻碍了生命周期管理决策的选择。在这种情况下，通过高效的监测系统收集相关信息，可以减少不确定性，最终推动更优化的生命周期决策。然而，在整个风电场的所有风力涡轮上实施完整的监测仪器可能由于实际和经济限制而变得不可行。此外，某些负载监测系统在海洋环境暴露几年后经常发生故障。为解决上述问题，由一个领导型风力涡轮指导的全场虚拟负载监测方案提供了一种有吸引力的解决方案。",
    "tldr": "该论文介绍了一种基于贝叶斯神经网络的全场虚拟负载监测方案，以解决离岸风电结构监测的不确定性和实际限制问题。",
    "en_tdlr": "This paper presents a farm-wide virtual load monitoring scheme based on Bayesian neural networks to address the uncertainties and practical constraints in monitoring offshore wind structures."
}