{
    "title": "BeGin: Extensive Benchmark Scenarios and An Easy-to-use Framework for Graph Continual Learning. (arXiv:2211.14568v2 [cs.LG] UPDATED)",
    "abstract": "Continual Learning (CL) is the process of learning ceaselessly a sequence of tasks. Most existing CL methods deal with independent data (e.g., images and text) for which many benchmark frameworks and results under standard experimental settings are available. However, CL methods for graph data (graph CL) are surprisingly underexplored because of (a) the lack of standard experimental settings, especially regarding how to deal with the dependency between instances, (b) the lack of benchmark datasets and scenarios, and (c) high complexity in implementation and evaluation due to the dependency. In this paper, regarding (a), we define four standard incremental settings (task-, class-, domain-, and time-incremental) for graph data, which are naturally applied to many node-, link-, and graph-level problems. Regarding (b), we provide 25 benchmark scenarios based on 15 real-world graphs. Regarding (c), we develop BeGin, an easy and fool-proof framework for graph CL. BeGin is easily extended sin",
    "link": "http://arxiv.org/abs/2211.14568",
    "context": "Title: BeGin: Extensive Benchmark Scenarios and An Easy-to-use Framework for Graph Continual Learning. (arXiv:2211.14568v2 [cs.LG] UPDATED)\nAbstract: Continual Learning (CL) is the process of learning ceaselessly a sequence of tasks. Most existing CL methods deal with independent data (e.g., images and text) for which many benchmark frameworks and results under standard experimental settings are available. However, CL methods for graph data (graph CL) are surprisingly underexplored because of (a) the lack of standard experimental settings, especially regarding how to deal with the dependency between instances, (b) the lack of benchmark datasets and scenarios, and (c) high complexity in implementation and evaluation due to the dependency. In this paper, regarding (a), we define four standard incremental settings (task-, class-, domain-, and time-incremental) for graph data, which are naturally applied to many node-, link-, and graph-level problems. Regarding (b), we provide 25 benchmark scenarios based on 15 real-world graphs. Regarding (c), we develop BeGin, an easy and fool-proof framework for graph CL. BeGin is easily extended sin",
    "path": "papers/22/11/2211.14568.json",
    "total_tokens": 936,
    "tldr": "本文提出了四种标准的渐进式设置和25个基准场景，用于解决图连续学习中实例之间的依赖性问题。同时，开发了易于扩展和使用的BeGin框架。",
    "en_tdlr": "This paper proposes four standard incremental settings and 25 benchmark scenarios for tackling the dependency problem between instances in graph continual learning. A user-friendly framework, BeGin, is also developed for easy extension and usage."
}