{
    "title": "Hierarchical Pronunciation Assessment with Multi-Aspect Attention. (arXiv:2211.08102v2 [cs.CL] UPDATED)",
    "abstract": "Automatic pronunciation assessment is a major component of a computer-assisted pronunciation training system. To provide in-depth feedback, scoring pronunciation at various levels of granularity such as phoneme, word, and utterance, with diverse aspects such as accuracy, fluency, and completeness, is essential. However, existing multi-aspect multi-granularity methods simultaneously predict all aspects at all granularity levels; therefore, they have difficulty in capturing the linguistic hierarchy of phoneme, word, and utterance. This limitation further leads to neglecting intimate cross-aspect relations at the same linguistic unit. In this paper, we propose a Hierarchical Pronunciation Assessment with Multi-aspect Attention (HiPAMA) model, which hierarchically represents the granularity levels to directly capture their linguistic structures and introduces multi-aspect attention that reflects associations across aspects at the same level to create more connotative representations. By ob",
    "link": "http://arxiv.org/abs/2211.08102",
    "context": "Title: Hierarchical Pronunciation Assessment with Multi-Aspect Attention. (arXiv:2211.08102v2 [cs.CL] UPDATED)\nAbstract: Automatic pronunciation assessment is a major component of a computer-assisted pronunciation training system. To provide in-depth feedback, scoring pronunciation at various levels of granularity such as phoneme, word, and utterance, with diverse aspects such as accuracy, fluency, and completeness, is essential. However, existing multi-aspect multi-granularity methods simultaneously predict all aspects at all granularity levels; therefore, they have difficulty in capturing the linguistic hierarchy of phoneme, word, and utterance. This limitation further leads to neglecting intimate cross-aspect relations at the same linguistic unit. In this paper, we propose a Hierarchical Pronunciation Assessment with Multi-aspect Attention (HiPAMA) model, which hierarchically represents the granularity levels to directly capture their linguistic structures and introduces multi-aspect attention that reflects associations across aspects at the same level to create more connotative representations. By ob",
    "path": "papers/22/11/2211.08102.json",
    "total_tokens": 936,
    "translated_title": "多层次多方面注意力的发音评估模型",
    "translated_abstract": "自动发音评估是计算机辅助发音训练系统的主要组成部分。为了提供深入的反馈，对各种粒度（如音素，单词和话语）和各种方面（如准确性，流畅度和完整性）进行发音评分至关重要。然而，现有的多方面多粒度方法同时预测所有粒度级别的所有方面；因此，它们难以捕捉音素，单词和话语的语言层次结构。该限制进一步导致忽略在同一语言单位内的亲密跨方面关系。在本文中，我们提出了一种多层次多方面注意力的发音评估模型（HiPAMA），该模型按层次表示粒度级别，以直接捕获其语言结构，并引入多方面注意力，以反映在同一级别上各方面之间的关联以创建更具内涵的表示。通过在中英文几个语料库上进行评估基准测试，我们表明我们的HiPAMA模型取得了最先进的结果。",
    "tldr": "本论文提出了一种多层次多方面注意力的发音评估模型，能够更好地捕捉音素、单词和话语的语言层次结构，并在评估准确性、流畅度和完整性方面取得了最先进的结果。",
    "en_tdlr": "This paper proposes a hierarchical pronunciation assessment model with multi-aspect attention, which can better capture the linguistic structures of phonemes, words and utterances and achieves state-of-the-art results in evaluating accuracy, fluency and completeness."
}