{
    "title": "Music Mixing Style Transfer: A Contrastive Learning Approach to Disentangle Audio Effects. (arXiv:2211.02247v2 [eess.AS] UPDATED)",
    "abstract": "We propose an end-to-end music mixing style transfer system that converts the mixing style of an input multitrack to that of a reference song. This is achieved with an encoder pre-trained with a contrastive objective to extract only audio effects related information from a reference music recording. All our models are trained in a self-supervised manner from an already-processed wet multitrack dataset with an effective data preprocessing method that alleviates the data scarcity of obtaining unprocessed dry data. We analyze the proposed encoder for the disentanglement capability of audio effects and also validate its performance for mixing style transfer through both objective and subjective evaluations. From the results, we show the proposed system not only converts the mixing style of multitrack audio close to a reference but is also robust with mixture-wise style transfer upon using a music source separation model.",
    "link": "http://arxiv.org/abs/2211.02247",
    "context": "Title: Music Mixing Style Transfer: A Contrastive Learning Approach to Disentangle Audio Effects. (arXiv:2211.02247v2 [eess.AS] UPDATED)\nAbstract: We propose an end-to-end music mixing style transfer system that converts the mixing style of an input multitrack to that of a reference song. This is achieved with an encoder pre-trained with a contrastive objective to extract only audio effects related information from a reference music recording. All our models are trained in a self-supervised manner from an already-processed wet multitrack dataset with an effective data preprocessing method that alleviates the data scarcity of obtaining unprocessed dry data. We analyze the proposed encoder for the disentanglement capability of audio effects and also validate its performance for mixing style transfer through both objective and subjective evaluations. From the results, we show the proposed system not only converts the mixing style of multitrack audio close to a reference but is also robust with mixture-wise style transfer upon using a music source separation model.",
    "path": "papers/22/11/2211.02247.json",
    "total_tokens": 955,
    "translated_title": "音乐混音风格转换：采用对比学习方法解开音频效果的紧密联系",
    "translated_abstract": "我们提出了一种端到端的音乐混音风格转换系统，将输入多轨混音的混音风格转换为参考歌曲的风格。这是通过使用一个预先经过对比目标训练的编码器来实现的，该编码器从参考音乐录音中提取仅与音频效果相关的信息。我们所有的模型都是自监督方式训练的，使用一种有效的数据预处理方法从已处理的湿度多轨数据集中缓解了获取未处理干燥数据的数据稀缺性。我们对所提出的编码器进行分析，以确定其分离音频效果的能力，并通过客观和主观评估验证其混音风格转换的性能。从结果中，我们展示了所提出的系统不仅可以将多轨音频的混音风格转换为参考风格，而且在使用音乐源分离模型时也具有混合风格转换的鲁棒性。",
    "tldr": "本论文提出了一种对比学习方法，用于实现音乐混音风格转换。该方法采用已处理的数据集进行自监督训练，并使用编码器从参考歌曲中提取仅与音频效果相关的信息。系统实现了多轨音频的混音风格转换，并且在使用音乐源分离模型时具有鲁棒性。",
    "en_tdlr": "This paper proposes a contrastive learning method for music mixing style transfer, which uses a pre-trained encoder to extract audio effects related information from a reference recording. The system is trained in a self-supervised manner with an effective data preprocessing method, and is able to achieve mixing style transfer for multitrack audio and maintain its robustness using a music source separation model."
}