{
    "title": "Explainability in Practice: Estimating Electrification Rates from Mobile Phone Data in Senegal. (arXiv:2211.06277v2 [cs.CY] UPDATED)",
    "abstract": "Explainable artificial intelligence (XAI) provides explanations for not interpretable machine learning (ML) models. While many technical approaches exist, there is a lack of validation of these techniques on real-world datasets. In this work, we present a use-case of XAI: an ML model which is trained to estimate electrification rates based on mobile phone data in Senegal. The data originate from the Data for Development challenge by Orange in 2014/15. We apply two model-agnostic, local explanation techniques and find that while the model can be verified, it is biased with respect to the population density. We conclude our paper by pointing to the two main challenges we encountered during our work: data processing and model design that might be restricted by currently available XAI methods, and the importance of domain knowledge to interpret explanations.",
    "link": "http://arxiv.org/abs/2211.06277",
    "context": "Title: Explainability in Practice: Estimating Electrification Rates from Mobile Phone Data in Senegal. (arXiv:2211.06277v2 [cs.CY] UPDATED)\nAbstract: Explainable artificial intelligence (XAI) provides explanations for not interpretable machine learning (ML) models. While many technical approaches exist, there is a lack of validation of these techniques on real-world datasets. In this work, we present a use-case of XAI: an ML model which is trained to estimate electrification rates based on mobile phone data in Senegal. The data originate from the Data for Development challenge by Orange in 2014/15. We apply two model-agnostic, local explanation techniques and find that while the model can be verified, it is biased with respect to the population density. We conclude our paper by pointing to the two main challenges we encountered during our work: data processing and model design that might be restricted by currently available XAI methods, and the importance of domain knowledge to interpret explanations.",
    "path": "papers/22/11/2211.06277.json",
    "total_tokens": 862,
    "translated_title": "在实践中的可解释性: 从塞内加尔的移动电话数据中估计电气化率",
    "translated_abstract": "可解释的人工智能（XAI）为不可解释的机器学习（ML）模型提供解释。尽管存在许多技术方法，但缺乏对真实世界数据集的验证。在这项工作中，我们提出了XAI的一个用例：一个使用塞内加尔的移动电话数据训练的ML模型，用于估计电气化率。这些数据源自2014/15年橙子公司的数据发展挑战。我们应用了两种模型不可知的局部解释技术，并发现虽然模型可以被验证，但在人口密度方面存在偏见。我们通过指出我们在工作过程中遇到的两个主要挑战来总结本文：数据处理和模型设计可能受到目前可用的XAI方法的限制，以及解释的解释的重要性。",
    "tldr": "本论文介绍了使用XAI的一个实际案例：在塞内加尔的移动电话数据上基于ML模型进行电气化率估计。研究发现该模型存在人口密度偏见，并指出了数据处理和模型设计方面的挑战，以及解释的解释的重要性。"
}