{
    "title": "NQE: N-ary Query Embedding for Complex Query Answering over Hyper-Relational Knowledge Graphs. (arXiv:2211.13469v3 [cs.AI] UPDATED)",
    "abstract": "Complex query answering (CQA) is an essential task for multi-hop and logical reasoning on knowledge graphs (KGs). Currently, most approaches are limited to queries among binary relational facts and pay less attention to n-ary facts (n>=2) containing more than two entities, which are more prevalent in the real world. Moreover, previous CQA methods can only make predictions for a few given types of queries and cannot be flexibly extended to more complex logical queries, which significantly limits their applications. To overcome these challenges, in this work, we propose a novel N-ary Query Embedding (NQE) model for CQA over hyper-relational knowledge graphs (HKGs), which include massive n-ary facts. The NQE utilizes a dual-heterogeneous Transformer encoder and fuzzy logic theory to satisfy all n-ary FOL queries, including existential quantifiers, conjunction, disjunction, and negation. We also propose a parallel processing algorithm that can train or predict arbitrary n-ary FOL queries i",
    "link": "http://arxiv.org/abs/2211.13469",
    "context": "Title: NQE: N-ary Query Embedding for Complex Query Answering over Hyper-Relational Knowledge Graphs. (arXiv:2211.13469v3 [cs.AI] UPDATED)\nAbstract: Complex query answering (CQA) is an essential task for multi-hop and logical reasoning on knowledge graphs (KGs). Currently, most approaches are limited to queries among binary relational facts and pay less attention to n-ary facts (n>=2) containing more than two entities, which are more prevalent in the real world. Moreover, previous CQA methods can only make predictions for a few given types of queries and cannot be flexibly extended to more complex logical queries, which significantly limits their applications. To overcome these challenges, in this work, we propose a novel N-ary Query Embedding (NQE) model for CQA over hyper-relational knowledge graphs (HKGs), which include massive n-ary facts. The NQE utilizes a dual-heterogeneous Transformer encoder and fuzzy logic theory to satisfy all n-ary FOL queries, including existential quantifiers, conjunction, disjunction, and negation. We also propose a parallel processing algorithm that can train or predict arbitrary n-ary FOL queries i",
    "path": "papers/22/11/2211.13469.json",
    "total_tokens": 1017,
    "translated_title": "NQE: 超关系知识图谱中的复杂查询回答中的N元查询嵌入",
    "translated_abstract": "复杂查询回答是在知识图谱上进行多跳和逻辑推理的重要任务。目前，大多数方法仅限于在二元关系事实中进行查询，并且对包含多个实体的N元事实（n >= 2）关注较少，这在真实世界中更为普遍。此外，以前的CQA方法仅能为一些特定类型的查询做出预测，并且不能灵活扩展到更复杂的逻辑查询，这严重限制了它们的应用。为了解决这些挑战，本研究提出了一种用于超关系知识图谱中CQA的N元查询嵌入（NQE）模型，这些知识图谱包括大量的N元事实。NQE利用双异构Transformer编码器和模糊逻辑理论来满足所有N元FOL查询，包括存在量词、合取、析取和否定。我们还提出了一种并行处理算法，可以训练或预测任意的N元FOL查询。",
    "tldr": "本论文提出了一种N元查询嵌入模型，用于超关系知识图谱中的复杂查询回答。该模型利用双异构Transformer编码器和模糊逻辑理论来满足所有N元的FOL查询，包括存在量词、合取、析取和否定，并提出了一种并行处理算法，可以训练或预测任意的N元FOL查询。"
}