{
    "title": "On the Effect of Anticipation on Reading Times. (arXiv:2211.14301v2 [cs.CL] UPDATED)",
    "abstract": "Over the past two decades, numerous studies have demonstrated how less predictable (i.e., higher surprisal) words take more time to read. In general, these studies have implicitly assumed the reading process is purely responsive: Readers observe a new word and allocate time to process it as required. We argue that prior results are also compatible with a reading process that is at least partially anticipatory: Readers could make predictions about a future word and allocate time to process it based on their expectation. In this work, we operationalize this anticipation as a word's contextual entropy. We assess the effect of anticipation on reading by comparing how well surprisal and contextual entropy predict reading times on four naturalistic reading datasets: two self-paced and two eye-tracking. Experimentally, across datasets and analyses, we find substantial evidence for effects of contextual entropy over surprisal on a word's reading time (RT): in fact, entropy is sometimes better ",
    "link": "http://arxiv.org/abs/2211.14301",
    "context": "Title: On the Effect of Anticipation on Reading Times. (arXiv:2211.14301v2 [cs.CL] UPDATED)\nAbstract: Over the past two decades, numerous studies have demonstrated how less predictable (i.e., higher surprisal) words take more time to read. In general, these studies have implicitly assumed the reading process is purely responsive: Readers observe a new word and allocate time to process it as required. We argue that prior results are also compatible with a reading process that is at least partially anticipatory: Readers could make predictions about a future word and allocate time to process it based on their expectation. In this work, we operationalize this anticipation as a word's contextual entropy. We assess the effect of anticipation on reading by comparing how well surprisal and contextual entropy predict reading times on four naturalistic reading datasets: two self-paced and two eye-tracking. Experimentally, across datasets and analyses, we find substantial evidence for effects of contextual entropy over surprisal on a word's reading time (RT): in fact, entropy is sometimes better ",
    "path": "papers/22/11/2211.14301.json",
    "total_tokens": 925,
    "translated_title": "关于预期对阅读时间的影响",
    "translated_abstract": "在过去的二十年中，许多研究已经证明了较难预测（即更高的惊奇度）的单词需要更长的阅读时间。一般来说，这些研究暗示了阅读过程是完全响应式的：读者观察一个新单词，并根据需要分配时间来处理它。我们认为，先前的结果也与阅读过程至少部分地具有预期性是一致的：读者可以对未来的单词进行预测，并根据他们的期望分配时间来处理它。在这项工作中，我们将这种预期性操作化为一个单词的上下文熵。我们通过比较惊奇程度和上下文熵对四个自然阅读数据集（两个自定节奏和两个眼动追踪）中的阅读时间进行预测的效果来评估预期对阅读的影响。在实验中，跨数据集和分析，我们发现上下文熵对于词的阅读时间（RT）的影响具有实质性的证据：事实上，有时上下文熵比惊奇度更好地预测阅读时间。",
    "tldr": "该论文研究了预期对阅读时间的影响。通过比较惊奇度和上下文熵对阅读时间的预测效果，发现上下文熵对词的阅读时间影响有实质性的证据。",
    "en_tdlr": "This paper investigates the effect of anticipation on reading times. By comparing the predictive power of surprisal and contextual entropy, substantial evidence is found for the impact of contextual entropy on reading time of words."
}