{
    "title": "Artificial intelligence approaches for materials-by-design of energetic materials: state-of-the-art, challenges, and future directions. (arXiv:2211.08179v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "Artificial intelligence (AI) is rapidly emerging as an enabling tool for solving various complex materials design problems. This paper aims to review recent advances in AI-driven materials-by-design and their applications to energetic materials (EM). Trained with data from numerical simulations and/or physical experiments, AI models can assimilate trends and patterns within the design parameter space, identify optimal material designs (micro-morphologies, combinations of materials in composites, etc.), and point to designs with superior/targeted property and performance metrics. We review approaches focusing on such capabilities with respect to the three main stages of materials-by-design, namely representation learning of microstructure morphology (i.e., shape descriptors), structure-property-performance (S-P-P) linkage estimation, and optimization/design exploration. We provide a perspective view of these methods in terms of their potential, practicality, and efficacy towards the rea",
    "link": "http://arxiv.org/abs/2211.08179",
    "context": "Title: Artificial intelligence approaches for materials-by-design of energetic materials: state-of-the-art, challenges, and future directions. (arXiv:2211.08179v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: Artificial intelligence (AI) is rapidly emerging as an enabling tool for solving various complex materials design problems. This paper aims to review recent advances in AI-driven materials-by-design and their applications to energetic materials (EM). Trained with data from numerical simulations and/or physical experiments, AI models can assimilate trends and patterns within the design parameter space, identify optimal material designs (micro-morphologies, combinations of materials in composites, etc.), and point to designs with superior/targeted property and performance metrics. We review approaches focusing on such capabilities with respect to the three main stages of materials-by-design, namely representation learning of microstructure morphology (i.e., shape descriptors), structure-property-performance (S-P-P) linkage estimation, and optimization/design exploration. We provide a perspective view of these methods in terms of their potential, practicality, and efficacy towards the rea",
    "path": "papers/22/11/2211.08179.json",
    "total_tokens": 801,
    "translated_title": "能量材料设计中的人工智能方法：现状、挑战和未来方向",
    "translated_abstract": "人工智能作为解决各种复杂材料设计问题的工具正在快速发展。本文旨在回顾最近在人工智能驱动下的能量材料设计方面的进展及其应用。通过数据驱动的方法，人工智能模型可以识别材料设计参数空间中的趋势和模式，确定最佳材料设计以及指向具有优越/目标性能和性能指标的设计。我们将重点关注材料设计的三个主要阶段，即微结构形态的表示学习，结构-性能-性能 (S-P-P) 联系的估计以及优化/设计探索。我们将提供这些方法的潜力、实用性和功效的展望。",
    "tldr": "本文回顾了人工智能在能量材料设计方面的最新进展及应用，通过数据驱动的方法，可以确定最佳材料设计以及指向具有优越性能和性能指标的设计。",
    "en_tdlr": "This paper reviews recent advances and applications of artificial intelligence in materials-by-design for energetic materials. By data-driven methods, optimal material designs with superior targeted performance can be identified."
}