{
    "title": "Causal Counterfactuals for Improving the Robustness of Reinforcement Learning. (arXiv:2211.05551v3 [cs.LG] UPDATED)",
    "abstract": "Reinforcement learning (RL) is used in various robotic applications. RL enables agents to learn tasks autonomously by interacting with the environment. The more critical the tasks are, the higher the demand for the robustness of the RL systems. Causal RL combines RL and causal inference to make RL more robust. Causal RL agents use a causal representation to capture the invariant causal mechanisms that can be transferred from one task to another. Currently, there is limited research in Causal RL, and existing solutions are usually not complete or feasible for real-world applications. In this work, we propose CausalCF, the first complete Causal RL solution incorporating ideas from Causal Curiosity and CoPhy. Causal Curiosity provides an approach for using interventions, and CoPhy is modified to enable the RL agent to perform counterfactuals. Causal Curiosity has been applied to robotic grasping and manipulation tasks in CausalWorld. CausalWorld provides a realistic simulation environment",
    "link": "http://arxiv.org/abs/2211.05551",
    "context": "Title: Causal Counterfactuals for Improving the Robustness of Reinforcement Learning. (arXiv:2211.05551v3 [cs.LG] UPDATED)\nAbstract: Reinforcement learning (RL) is used in various robotic applications. RL enables agents to learn tasks autonomously by interacting with the environment. The more critical the tasks are, the higher the demand for the robustness of the RL systems. Causal RL combines RL and causal inference to make RL more robust. Causal RL agents use a causal representation to capture the invariant causal mechanisms that can be transferred from one task to another. Currently, there is limited research in Causal RL, and existing solutions are usually not complete or feasible for real-world applications. In this work, we propose CausalCF, the first complete Causal RL solution incorporating ideas from Causal Curiosity and CoPhy. Causal Curiosity provides an approach for using interventions, and CoPhy is modified to enable the RL agent to perform counterfactuals. Causal Curiosity has been applied to robotic grasping and manipulation tasks in CausalWorld. CausalWorld provides a realistic simulation environment",
    "path": "papers/22/11/2211.05551.json",
    "total_tokens": 900,
    "translated_title": "用因果反事实推断提高强化学习的鲁棒性",
    "translated_abstract": "强化学习在各种机器人应用中被使用。强化学习使代理能够通过与环境交互自主地学习任务。任务越重要，对RL系统的鲁棒性的需求就越高。因果RL将RL和因果推断相结合，使RL更加鲁棒。因果RL代理使用因果表示来捕捉可以从一个任务转移到另一个任务的不变因果机制。目前，因果RL的研究有限，现有的解决方案通常不完整或不适用于实际应用。在这项工作中，我们提出了CausalCF，这是第一个完整的因果RL解决方案，结合了Causal Curiosity和CoPhy的思想。Causal Curiosity提供了一种使用干预的方法，并修改了CoPhy，使RL代理能够执行反事实推断。Causal Curiosity已应用于CausalWorld中的机器人抓取和操纵任务。CausalWorld提供了一个真实的仿真环境。",
    "tldr": "本文提出了CausalCF，它是第一个完整的因果RL解决方案，能够通过因果反事实推断提高RL系统的鲁棒性，并已在机器人抓取和操纵任务中得到应用。",
    "en_tdlr": "This paper proposes CausalCF, the first complete Causal RL solution, which can improve the robustness of RL systems through causal counterfactuals and has been applied in robotic grasping and manipulation tasks in CausalWorld."
}