{
    "title": "Simple and Scalable Algorithms for Cluster-Aware Precision Medicine. (arXiv:2211.16553v3 [cs.LG] UPDATED)",
    "abstract": "AI-enabled precision medicine promises a transformational improvement in healthcare outcomes by enabling data-driven personalized diagnosis, prognosis, and treatment. However, the well-known \"curse of dimensionality\" and the clustered structure of biomedical data together interact to present a joint challenge in the high dimensional, limited observation precision medicine regime. To overcome both issues simultaneously we propose a simple and scalable approach to joint clustering and embedding that combines standard embedding methods with a convex clustering penalty in a modular way. This novel, cluster-aware embedding approach overcomes the complexity and limitations of current joint embedding and clustering methods, which we show with straightforward implementations of hierarchically clustered principal component analysis (PCA), locally linear embedding (LLE), and canonical correlation analysis (CCA). Through both numerical experiments and real-world examples, we demonstrate that our ",
    "link": "http://arxiv.org/abs/2211.16553",
    "context": "Title: Simple and Scalable Algorithms for Cluster-Aware Precision Medicine. (arXiv:2211.16553v3 [cs.LG] UPDATED)\nAbstract: AI-enabled precision medicine promises a transformational improvement in healthcare outcomes by enabling data-driven personalized diagnosis, prognosis, and treatment. However, the well-known \"curse of dimensionality\" and the clustered structure of biomedical data together interact to present a joint challenge in the high dimensional, limited observation precision medicine regime. To overcome both issues simultaneously we propose a simple and scalable approach to joint clustering and embedding that combines standard embedding methods with a convex clustering penalty in a modular way. This novel, cluster-aware embedding approach overcomes the complexity and limitations of current joint embedding and clustering methods, which we show with straightforward implementations of hierarchically clustered principal component analysis (PCA), locally linear embedding (LLE), and canonical correlation analysis (CCA). Through both numerical experiments and real-world examples, we demonstrate that our ",
    "path": "papers/22/11/2211.16553.json",
    "total_tokens": 870,
    "translated_title": "简单高效的基于聚类的精准医疗算法",
    "translated_abstract": "利用人工智能实现数据驱动的个性化诊断、预后和治疗，为精准医疗带来了前所未有的变革。然而，生物医学数据的高维度和聚类结构使得在高维度、限制性观测的精准医疗领域中会遇到挑战。为了同时克服这两个问题，我们提出了一种简单高效的联合聚类和嵌入方法，将标准嵌入方法与凸聚类惩罚以模块化的方式结合。这种新颖的基于聚类的嵌入方法克服了当前联合嵌入和聚类方法的复杂性和局限性，我们通过层次聚类主成分分析（PCA）、局部线性嵌入（LLE）和规范相关分析（CCA）的简单实现进行了证明。通过数值实验和真实世界的案例，我们证明了我们方法的有效性。",
    "tldr": "本文提出了基于聚类和嵌入的简单高效方法，用于克服精准医疗中的高维问题和聚类问题，经验证该方法较当前方法具有更高的有效性和可行性。",
    "en_tdlr": "This paper proposes a simple and efficient method based on clustering and embedding to overcome the challenges of high-dimensionality and clustering in precision medicine, which has higher effectiveness and feasibility compared to current methods, as demonstrated by numerical experiments and real-world examples."
}