{
    "title": "Online Distribution Shift Detection via Recency Prediction. (arXiv:2211.09916v3 [cs.RO] UPDATED)",
    "abstract": "When deploying modern machine learning-enabled robotic systems in high-stakes applications, detecting distribution shift is critical. However, most existing methods for detecting distribution shift are not well-suited to robotics settings, where data often arrives in a streaming fashion and may be very high-dimensional. In this work, we present an online method for detecting distribution shift with guarantees on the false positive rate - i.e., when there is no distribution shift, our system is very unlikely (with probability $< \\epsilon$) to falsely issue an alert; any alerts that are issued should therefore be heeded. Our method is specifically designed for efficient detection even with high dimensional data, and it empirically achieves up to 11x faster detection on realistic robotics settings compared to prior work while maintaining a low false negative rate in practice (whenever there is a distribution shift in our experiments, our method indeed emits an alert). We demonstrate our a",
    "link": "http://arxiv.org/abs/2211.09916",
    "context": "Title: Online Distribution Shift Detection via Recency Prediction. (arXiv:2211.09916v3 [cs.RO] UPDATED)\nAbstract: When deploying modern machine learning-enabled robotic systems in high-stakes applications, detecting distribution shift is critical. However, most existing methods for detecting distribution shift are not well-suited to robotics settings, where data often arrives in a streaming fashion and may be very high-dimensional. In this work, we present an online method for detecting distribution shift with guarantees on the false positive rate - i.e., when there is no distribution shift, our system is very unlikely (with probability $< \\epsilon$) to falsely issue an alert; any alerts that are issued should therefore be heeded. Our method is specifically designed for efficient detection even with high dimensional data, and it empirically achieves up to 11x faster detection on realistic robotics settings compared to prior work while maintaining a low false negative rate in practice (whenever there is a distribution shift in our experiments, our method indeed emits an alert). We demonstrate our a",
    "path": "papers/22/11/2211.09916.json",
    "total_tokens": 798,
    "translated_title": "在线分布漂移检测方法基于最近性预测",
    "translated_abstract": "在高风险应用中部署现代机器学习驱动的机器人系统时，检测分布漂移至关重要。然而，大多数现有的分布漂移检测方法不适用于机器人环境，因为数据通常以流式方式到达并且可能具有非常高的维度。在本文中，我们提出了一种在线方法来检测分布漂移，并对误报率提供了保证 - 即当没有分布漂移时，我们的系统非常不可能（概率小于 epsilon）发出错误的警报；因此，任何发出的警报应该被重视。我们的方法专为高维数据的高效检测而设计，并且在实际情况下与以前的方法相比，实现了高达11倍的快速检测，同时保持低的误报率（在我们的实验中，当存在分布漂移时，我们的方法确实发出了警报）。",
    "tldr": "本文提出了一种在线方法来有效检测机器人系统中的分布漂移，具有低误报率和高效率的特点。",
    "en_tdlr": "This paper presents an online method for effectively detecting distribution shift in robotic systems, with low false positive rate and high efficiency."
}