{
    "title": "Self-Supervised Continual Graph Learning in Adaptive Riemannian Spaces. (arXiv:2211.17068v2 [cs.LG] UPDATED)",
    "abstract": "Continual graph learning routinely finds its role in a variety of real-world applications where the graph data with different tasks come sequentially. Despite the success of prior works, it still faces great challenges. On the one hand, existing methods work with the zero-curvature Euclidean space, and largely ignore the fact that curvature varies over the coming graph sequence. On the other hand, continual learners in the literature rely on abundant labels, but labeling graph in practice is particularly hard especially for the continuously emerging graphs on-the-fly. To address the aforementioned challenges, we propose to explore a challenging yet practical problem, the self-supervised continual graph learning in adaptive Riemannian spaces. In this paper, we propose a novel self-supervised Riemannian Graph Continual Learner (RieGrace). In RieGrace, we first design an Adaptive Riemannian GCN (AdaRGCN), a unified GCN coupled with a neural curvature adapter, so that Riemannian space is s",
    "link": "http://arxiv.org/abs/2211.17068",
    "context": "Title: Self-Supervised Continual Graph Learning in Adaptive Riemannian Spaces. (arXiv:2211.17068v2 [cs.LG] UPDATED)\nAbstract: Continual graph learning routinely finds its role in a variety of real-world applications where the graph data with different tasks come sequentially. Despite the success of prior works, it still faces great challenges. On the one hand, existing methods work with the zero-curvature Euclidean space, and largely ignore the fact that curvature varies over the coming graph sequence. On the other hand, continual learners in the literature rely on abundant labels, but labeling graph in practice is particularly hard especially for the continuously emerging graphs on-the-fly. To address the aforementioned challenges, we propose to explore a challenging yet practical problem, the self-supervised continual graph learning in adaptive Riemannian spaces. In this paper, we propose a novel self-supervised Riemannian Graph Continual Learner (RieGrace). In RieGrace, we first design an Adaptive Riemannian GCN (AdaRGCN), a unified GCN coupled with a neural curvature adapter, so that Riemannian space is s",
    "path": "papers/22/11/2211.17068.json",
    "total_tokens": 1283,
    "translated_title": "自监督连续适应黎曼空间图学习",
    "translated_abstract": "连续的图学习在各种需要依次出现图数据的实际应用中扮演着重要的角色。尽管先前的研究取得了一定成就，但仍面临巨大挑战。一方面，现有方法在零曲率欧几里得空间中工作，很大程度上忽视了曲率随即出现的图序列而变化的事实。另一方面，文献中不断的学习器依赖丰富的标签，但实践中标记图尤其是针对不断出现的图，对实时性的要求很高。为了应对上述挑战，我们提出了一个具有挑战性但实用的问题，即自监督连续适应黎曼空间图学习。我们提出了一种新颖的自监督黎曼图连续学习器（RieGrace）。在RieGrace中，我们首先设计了自适应黎曼GCN（AdaRGCN），该方法将GCN与神经曲率适配器耦合在一起，使得黎曼空间可以适应变化。",
    "tldr": "本文提出了一种自监督连续适应黎曼空间图学习的方法，解决了现有方法忽视曲率变化和对标签依赖过高的问题。",
    "en_tdlr": "This paper proposes a self-supervised continual graph learning method in adaptive Riemannian spaces, addressing the problems of overlooking the curvature variation and relying too much on labels in existing approaches."
}