{
    "title": "Extreme Changes in Changes. (arXiv:2211.14870v2 [econ.EM] UPDATED)",
    "abstract": "Policy analysts are often interested in treating the units with extreme outcomes, such as infants with extremely low birth weights. Existing changes-in-changes (CIC) estimators are tailored to middle quantiles and do not work well for such subpopulations. This paper proposes a new CIC estimator to accurately estimate treatment effects at extreme quantiles. With its asymptotic normality, we also propose a method of statistical inference, which is simple to implement. Based on simulation studies, we propose to use our extreme CIC estimator for extreme, such as below 5% and above 95%, quantiles, while the conventional CIC estimator should be used for intermediate quantiles. Applying the proposed method, we study the effects of income gains from the 1993 EITC reform on infant birth weights for those in the most critical conditions. This paper is accompanied by a Stata command.",
    "link": "http://arxiv.org/abs/2211.14870",
    "context": "Title: Extreme Changes in Changes. (arXiv:2211.14870v2 [econ.EM] UPDATED)\nAbstract: Policy analysts are often interested in treating the units with extreme outcomes, such as infants with extremely low birth weights. Existing changes-in-changes (CIC) estimators are tailored to middle quantiles and do not work well for such subpopulations. This paper proposes a new CIC estimator to accurately estimate treatment effects at extreme quantiles. With its asymptotic normality, we also propose a method of statistical inference, which is simple to implement. Based on simulation studies, we propose to use our extreme CIC estimator for extreme, such as below 5% and above 95%, quantiles, while the conventional CIC estimator should be used for intermediate quantiles. Applying the proposed method, we study the effects of income gains from the 1993 EITC reform on infant birth weights for those in the most critical conditions. This paper is accompanied by a Stata command.",
    "path": "papers/22/11/2211.14870.json",
    "total_tokens": 876,
    "translated_title": "变革中的极端变化",
    "translated_abstract": "政策分析师通常对极端结果的单位感兴趣，例如出生体重极低的婴儿。现有的变化-变化（CIC）估计量是针对中位数量身定制的，对于这种子集并不适用。本文提出了一种新的CIC估计方法，以准确估计极端分位数的处理效应。我们还提出了一种简单易行的统计推论方法，其中包括它的渐近正态性。基于模拟研究，我们建议使用我们的极端CIC估计器来进行极端量（如低于5％和高于95％）的估计，而传统的CIC估计器应用于中间分位数。应用所提出的方法，我们研究了1993年EITC改革的收入增长对处于最危急状态的婴儿出生体重的影响。本文附有Stata命令。",
    "tldr": "本文提出了一种新的CIC估计方法，可准确估计极端分位数的处理效应，并提出了简单易行的统计推论方法，可应用于极端分位数（如低于5％和高于95％）的估计，此方法在研究极端结果的单位上具有重要价值。",
    "en_tdlr": "This paper proposes a new CIC estimator to accurately estimate treatment effects at extreme quantiles, and proposes a simple method of statistical inference for asymptotic normality. This method has important value in studying units with extreme outcomes."
}