{
    "title": "Crown-CAM: Interpretable Visual Explanations for Tree Crown Detection in Aerial Images. (arXiv:2211.13126v2 [cs.CV] UPDATED)",
    "abstract": "Visual explanation of ``black-box'' models allows researchers in explainable artificial intelligence (XAI) to interpret the model's decisions in a human-understandable manner. In this paper, we propose interpretable class activation mapping for tree crown detection (Crown-CAM) that overcomes inaccurate localization & computational complexity of previous methods while generating reliable visual explanations for the challenging and dynamic problem of tree crown detection in aerial images. It consists of an unsupervised selection of activation maps, computation of local score maps, and non-contextual background suppression to efficiently provide fine-grain localization of tree crowns in scenarios with dense forest trees or scenes without tree crowns. Additionally, two Intersection over Union (IoU)-based metrics are introduced to effectively quantify both the accuracy and inaccuracy of generated explanations with respect to regions with or even without tree crowns in the image. Empirical e",
    "link": "http://arxiv.org/abs/2211.13126",
    "context": "Title: Crown-CAM: Interpretable Visual Explanations for Tree Crown Detection in Aerial Images. (arXiv:2211.13126v2 [cs.CV] UPDATED)\nAbstract: Visual explanation of ``black-box'' models allows researchers in explainable artificial intelligence (XAI) to interpret the model's decisions in a human-understandable manner. In this paper, we propose interpretable class activation mapping for tree crown detection (Crown-CAM) that overcomes inaccurate localization & computational complexity of previous methods while generating reliable visual explanations for the challenging and dynamic problem of tree crown detection in aerial images. It consists of an unsupervised selection of activation maps, computation of local score maps, and non-contextual background suppression to efficiently provide fine-grain localization of tree crowns in scenarios with dense forest trees or scenes without tree crowns. Additionally, two Intersection over Union (IoU)-based metrics are introduced to effectively quantify both the accuracy and inaccuracy of generated explanations with respect to regions with or even without tree crowns in the image. Empirical e",
    "path": "papers/22/11/2211.13126.json",
    "total_tokens": 963,
    "translated_title": "Crown-CAM：高空图像中树冠检测的可解释视觉解释方法",
    "translated_abstract": "“黑匣子”模型的可视解释允许可解释人工智能领域的研究人员以人类可理解的方式解释模型的决策。本文提出了一种可解释的树冠检测类激活映射方法（Crown-CAM），它克服了以往方法的不准确的定位和计算复杂度问题，同时为高空图像中树冠检测这一具有挑战性和动态的问题提供可靠的可视化解释。它包括无监督选择激活映射，计算局部得分映射以及非上下文背景抑制，以有效地提供树冠的精细定位，适用于密林或者没有树冠的场景。另外，本文引入了两个基于IoU的指标，可以有效地量化生成的解释与图像中树冠或无树冠区域的准确性和不准确性。",
    "tldr": "本文提出了一种名为Crown-CAM的可解释的类激活映射方法，用于解决高空图像中树冠检测的问题，该方法通过无监督选择激活映射、计算局部得分映射和非上下文背景抑制等步骤，既可以有效地提供树冠的精细定位，又可以量化生成的解释的准确性和不准确性。",
    "en_tdlr": "This paper proposes an interpretable class activation mapping method called Crown-CAM for tree crown detection in aerial images, which can provide fine-grain localization of tree crowns and quantify the accuracy and inaccuracy of generated explanations through unsupervised selection of activation maps, computation of local score maps, and non-contextual background suppression."
}