{
    "title": "SMAuC -- The Scientific Multi-Authorship Corpus. (arXiv:2211.02477v2 [cs.CL] UPDATED)",
    "abstract": "The rapidly growing volume of scientific publications offers an interesting challenge for research on methods for analyzing the authorship of documents with one or more authors. However, most existing datasets lack scientific documents or the necessary metadata for constructing new experiments and test cases. We introduce SMAuC, a comprehensive, metadata-rich corpus tailored to scientific authorship analysis. Comprising over 3 million publications across various disciplines from over 5 million authors, SMAuC is the largest openly accessible corpus for this purpose. It encompasses scientific texts from humanities and natural sciences, accompanied by extensive, curated metadata, including unambiguous author IDs. SMAuC aims to significantly advance the domain of authorship analysis in scientific texts.",
    "link": "http://arxiv.org/abs/2211.02477",
    "context": "Title: SMAuC -- The Scientific Multi-Authorship Corpus. (arXiv:2211.02477v2 [cs.CL] UPDATED)\nAbstract: The rapidly growing volume of scientific publications offers an interesting challenge for research on methods for analyzing the authorship of documents with one or more authors. However, most existing datasets lack scientific documents or the necessary metadata for constructing new experiments and test cases. We introduce SMAuC, a comprehensive, metadata-rich corpus tailored to scientific authorship analysis. Comprising over 3 million publications across various disciplines from over 5 million authors, SMAuC is the largest openly accessible corpus for this purpose. It encompasses scientific texts from humanities and natural sciences, accompanied by extensive, curated metadata, including unambiguous author IDs. SMAuC aims to significantly advance the domain of authorship analysis in scientific texts.",
    "path": "papers/22/11/2211.02477.json",
    "total_tokens": 726,
    "translated_title": "SMAuC -- 科学多作者语料库",
    "translated_abstract": "快速增长的科学文献数量为研究分析单个或多个作者的文档方法提供了有趣的挑战。然而，大多数现有数据集缺乏科学文档或构建新实验和测试用例所必需的元数据。本文介绍了SMAuC，这是一个专为科学作者分析量身定制的全面的元数据丰富的语料库。SMAuC是最大的公开可访问的语料库，包括来自各个学科的超过500万作者的300多万篇科学文本，其中还包括明确的作者ID等广泛策划的元数据。SMAuC旨在显著推进科学文本中的作者身份分析领域。",
    "tldr": "SMAuC是一个包含300万篇科学文本，且元数据丰富的语料库，涵盖各个学科的500万作者，并旨在推进科学文本中的作者身份分析领域。",
    "en_tdlr": "SMAuC is a comprehensive and metadata-rich corpus with over 3 million scientific documents across various disciplines from over 5 million authors, aiming to significantly advance the domain of authorship analysis in scientific texts."
}