{
    "title": "Unconfoundedness with Network Interference. (arXiv:2211.07823v2 [econ.EM] UPDATED)",
    "abstract": "This paper studies nonparametric estimation of treatment and spillover effects using observational data from a single large network. We consider a model in which interference decays with network distance, which allows for peer influence in both outcomes and selection into treatment. Under this model, the total network and covariates of all units constitute sources of confounding, in contrast to existing work that assumes confounding can be summarized by a known, low-dimensional function of these objects. We propose to use graph neural networks to estimate the high-dimensional nuisance functions of a doubly robust estimator. We establish a network analog of approximate sparsity to justify the use of shallow architectures.",
    "link": "http://arxiv.org/abs/2211.07823",
    "context": "Title: Unconfoundedness with Network Interference. (arXiv:2211.07823v2 [econ.EM] UPDATED)\nAbstract: This paper studies nonparametric estimation of treatment and spillover effects using observational data from a single large network. We consider a model in which interference decays with network distance, which allows for peer influence in both outcomes and selection into treatment. Under this model, the total network and covariates of all units constitute sources of confounding, in contrast to existing work that assumes confounding can be summarized by a known, low-dimensional function of these objects. We propose to use graph neural networks to estimate the high-dimensional nuisance functions of a doubly robust estimator. We establish a network analog of approximate sparsity to justify the use of shallow architectures.",
    "path": "papers/22/11/2211.07823.json",
    "total_tokens": 749,
    "translated_title": "使用网络干扰进行无偏性估计研究",
    "translated_abstract": "本文研究使用来自单个大型网络的观测数据对治疗效应和溢出效应进行非参数估计。我们考虑一个模型，其中干扰随着网络距离的增加而衰减，这允许对结果和治疗选择的同伴影响进行建模。在这个模型下，总网络和所有单位的协变量构成了混淆的来源，与现有工作不同的是，现有工作假设混淆可以由这些对象的已知低维函数总结。我们提出使用图神经网络来估计双重稳健估计量的高维烦恼函数。我们建立了近似稀疏的网络类比，以证明使用浅层结构的合理性。",
    "tldr": "本文研究使用单个大型网络的观测数据进行非参数估计，利用图神经网络估计高维烦恼函数，研究治疗效应和溢出效应。",
    "en_tdlr": "This paper investigates nonparametric estimation of treatment and spillover effects using observational data from a single large network. It proposes the use of graph neural networks to estimate high-dimensional nuisance functions and examines treatment effects and spillover effects."
}