{
    "title": "Unsupervised Unlearning of Concept Drift with Autoencoders. (arXiv:2211.12989v2 [cs.LG] UPDATED)",
    "abstract": "Concept drift refers to a change in the data distribution affecting the data stream of future samples. Consequently, learning models operating on the data stream might become obsolete, and need costly and difficult adjustments such as retraining or adaptation. Existing methods usually implement a local concept drift adaptation scheme, where either incremental learning of the models is used, or the models are completely retrained when a drift detection mechanism triggers an alarm. This paper proposes an alternative approach in which an unsupervised and model-agnostic concept drift adaptation method at the global level is introduced, based on autoencoders. Specifically, the proposed method aims to ``unlearn'' the concept drift without having to retrain or adapt any of the learning models operating on the data. An extensive experimental evaluation is conducted in two application domains. We consider a realistic water distribution network with more than 30 models in-place, from which we cr",
    "link": "http://arxiv.org/abs/2211.12989",
    "context": "Title: Unsupervised Unlearning of Concept Drift with Autoencoders. (arXiv:2211.12989v2 [cs.LG] UPDATED)\nAbstract: Concept drift refers to a change in the data distribution affecting the data stream of future samples. Consequently, learning models operating on the data stream might become obsolete, and need costly and difficult adjustments such as retraining or adaptation. Existing methods usually implement a local concept drift adaptation scheme, where either incremental learning of the models is used, or the models are completely retrained when a drift detection mechanism triggers an alarm. This paper proposes an alternative approach in which an unsupervised and model-agnostic concept drift adaptation method at the global level is introduced, based on autoencoders. Specifically, the proposed method aims to ``unlearn'' the concept drift without having to retrain or adapt any of the learning models operating on the data. An extensive experimental evaluation is conducted in two application domains. We consider a realistic water distribution network with more than 30 models in-place, from which we cr",
    "path": "papers/22/11/2211.12989.json",
    "total_tokens": 869,
    "translated_title": "使用自编码器进行无监督的概念漂移取消学习",
    "translated_abstract": "概念漂移是指影响未来样本数据流的数据分布变化。因此，对数据流进行操作的学习模型可能会变得过时，需要昂贵且困难的调整，如重新训练或适应。现有方法通常实施局部概念漂移适应方案，其中要么使用增量学习模型，要么在漂移检测机制触发警报时完全重新训练模型。本文提出了一种替代方法，介绍了一种基于自编码器的无监督和模型无关的全局级别概念漂移适应方法。具体而言，所提出的方法旨在“取消学习”概念漂移，而无需重新训练或调整任何在数据上操作的学习模型。在两个应用领域进行了广泛的实验评估。我们考虑了一个具有30个以上模型的真实水配送网络，其中我们...",
    "tldr": "本论文提出了一种基于自编码器的无监督的概念漂移取消学习方法，通过在全局级别引入自编码器，可以避免重新训练或调整学习模型，从而实现对概念漂移的适应。"
}