{
    "title": "Physics-informed neural networks for gravity currents reconstruction from limited data. (arXiv:2211.09715v2 [physics.flu-dyn] UPDATED)",
    "abstract": "The present work investigates the use of physics-informed neural networks (PINNs) for the 3D reconstruction of unsteady gravity currents from limited data. In the PINN context, the flow fields are reconstructed by training a neural network whose objective function penalizes the mismatch between the network predictions and the observed data and embeds the underlying equations using automatic differentiation. This study relies on a high-fidelity numerical experiment of the canonical lock-exchange configuration. This allows us to benchmark quantitatively the PINNs reconstruction capabilities on several training databases that mimic state-of-the-art experimental measurement techniques for density and velocity. Notably, spatially averaged density measurements by light attenuation technique (LAT) are employed for the training procedure. An optimal experimental setup for flow reconstruction by PINNs is proposed according to two criteria : the implementation complexity and the accuracy of the ",
    "link": "http://arxiv.org/abs/2211.09715",
    "context": "Title: Physics-informed neural networks for gravity currents reconstruction from limited data. (arXiv:2211.09715v2 [physics.flu-dyn] UPDATED)\nAbstract: The present work investigates the use of physics-informed neural networks (PINNs) for the 3D reconstruction of unsteady gravity currents from limited data. In the PINN context, the flow fields are reconstructed by training a neural network whose objective function penalizes the mismatch between the network predictions and the observed data and embeds the underlying equations using automatic differentiation. This study relies on a high-fidelity numerical experiment of the canonical lock-exchange configuration. This allows us to benchmark quantitatively the PINNs reconstruction capabilities on several training databases that mimic state-of-the-art experimental measurement techniques for density and velocity. Notably, spatially averaged density measurements by light attenuation technique (LAT) are employed for the training procedure. An optimal experimental setup for flow reconstruction by PINNs is proposed according to two criteria : the implementation complexity and the accuracy of the ",
    "path": "papers/22/11/2211.09715.json",
    "total_tokens": 1073,
    "translated_title": "物理信息神经网络用于受限数据情况下重建重力气流",
    "translated_abstract": "本文研究了物理信息神经网络(PINNs)在三维重建不稳定重力气流方面的应用。在PINN框架下，通过训练神经网络重建流场，使其目标函数惩罚网络预测与实际观测数据之间的不匹配并使用自动微分嵌入基础方程。本研究依赖于规范锁定交换配置的高保真数值实验，可在几个训练数据库上定量测试PINNs重建能力，这些数据库模拟了密度和速度的最新实验测量技术。特别地，采用光衰减技术(LAT)平均空间密度测量进行训练过程。根据两个标准提出了流重建的最佳实验设置: 实施复杂度和重建准确性。结果表明，PINNs可以从少量LAT测量值中快速、精确地重建不稳定流场，并且与粒子图像测速术(PIV)和荧光颗粒跟踪测速术(FPTV)的实验数据比较表明了该方法的可靠性和稳健性。",
    "tldr": "本文研究了物理信息神经网络在受限数据情况下重建重力气流方面的应用，通过光衰减技术(LAT)平均空间密度测量进行训练，结果表明该方法可以在少量测量值下快速、精确地重建流场，并且与实验数据比较表明了其可靠性。",
    "en_tdlr": "This paper investigates the use of physics-informed neural networks (PINNs) for reconstructing unsteady gravity currents with limited data. The proposed method employs light attenuation technique (LAT) for training and achieves accurate and reliable results with a small number of measurements, as confirmed by comparisons to experimental data obtained by other methods."
}