{
    "title": "Enhancing Constraint Programming via Supervised Learning for Job Shop Scheduling. (arXiv:2211.14492v2 [cs.AI] UPDATED)",
    "abstract": "Constraint programming (CP) is a powerful technique for solving constraint satisfaction and optimization problems. In CP solvers, the variable ordering strategy used to select which variable to explore first in the solving process has a significant impact on solver effectiveness. To address this issue, we propose a novel variable ordering strategy based on supervised learning, which we evaluate in the context of job shop scheduling problems. Our learning-based methods predict the optimal solution of a problem instance and use the predicted solution to order variables for CP solvers. \\added[]{Unlike traditional variable ordering methods, our methods can learn from the characteristics of each problem instance and customize the variable ordering strategy accordingly, leading to improved solver performance.} Our experiments demonstrate that training machine learning models is highly efficient and can achieve high accuracy. Furthermore, our learned variable ordering methods perform competit",
    "link": "http://arxiv.org/abs/2211.14492",
    "context": "Title: Enhancing Constraint Programming via Supervised Learning for Job Shop Scheduling. (arXiv:2211.14492v2 [cs.AI] UPDATED)\nAbstract: Constraint programming (CP) is a powerful technique for solving constraint satisfaction and optimization problems. In CP solvers, the variable ordering strategy used to select which variable to explore first in the solving process has a significant impact on solver effectiveness. To address this issue, we propose a novel variable ordering strategy based on supervised learning, which we evaluate in the context of job shop scheduling problems. Our learning-based methods predict the optimal solution of a problem instance and use the predicted solution to order variables for CP solvers. \\added[]{Unlike traditional variable ordering methods, our methods can learn from the characteristics of each problem instance and customize the variable ordering strategy accordingly, leading to improved solver performance.} Our experiments demonstrate that training machine learning models is highly efficient and can achieve high accuracy. Furthermore, our learned variable ordering methods perform competit",
    "path": "papers/22/11/2211.14492.json",
    "total_tokens": 831,
    "translated_title": "通过监督学习增强约束编程在作业车间调度中的应用",
    "translated_abstract": "约束编程是解决约束满足和优化问题的一种有效技术。在约束编程求解器中，选取变量的顺序对求解器的有效性有重要影响。为了解决这个问题，我们提出了一种基于监督学习的变量排序策略，在作业车间调度问题的背景下对其进行评估。我们的学习方法使用问题实例的最优解来排序约束编程求解器中的变量，不同于传统的变量排序方法，我们的方法可以根据每个问题实例的特征进行学习，并相应地定制变量排序策略，从而提高求解器的性能。我们的实验表明，训练机器学习模型非常高效且具有高准确性。此外，我们学到的变量排序方法的性能表现也很优秀。",
    "tldr": "该论文提出了一种基于监督学习的变量排序策略，可根据不同问题实例的特征定制变量排序策略以提高约束编程的求解性能。实验表明，该方法具有高效性和高准确性。",
    "en_tdlr": "This paper proposed a variable ordering strategy based on supervised learning for job shop scheduling problems, which can customize the variable ordering according to the characteristics of each problem instance to improve the solver performance. Experiments show that the method is efficient and accurate."
}