{
    "title": "Enhancing Recommender Systems: A Strategy to Mitigate False Negative Impact",
    "abstract": "arXiv:2211.13912v2 Announce Type: replace  Abstract: In implicit collaborative filtering (CF) task of recommender systems, recent works mainly focus on model structure design with promising techniques like graph neural networks (GNNs). Effective and efficient negative sampling methods that suit these models, however, remain underdeveloped. One challenge is that existing hard negative samplers tend to suffer from severer over-fitting in model training. In this work, we first study the reason behind the over-fitting, and illustrate it with the incorrect selection of false negative instances with the support of experiments. In addition, we empirically observe a counter-intuitive phenomenon, that is, polluting hard negative samples' embeddings with a quite large proportional of positive samples' embeddings will lead to remarkable performance gains for prediction accuracy. On top of this finding, we present a novel negative sampling strategy, i.e., positive-dominated negative synthesizing (",
    "link": "https://arxiv.org/abs/2211.13912",
    "context": "Title: Enhancing Recommender Systems: A Strategy to Mitigate False Negative Impact\nAbstract: arXiv:2211.13912v2 Announce Type: replace  Abstract: In implicit collaborative filtering (CF) task of recommender systems, recent works mainly focus on model structure design with promising techniques like graph neural networks (GNNs). Effective and efficient negative sampling methods that suit these models, however, remain underdeveloped. One challenge is that existing hard negative samplers tend to suffer from severer over-fitting in model training. In this work, we first study the reason behind the over-fitting, and illustrate it with the incorrect selection of false negative instances with the support of experiments. In addition, we empirically observe a counter-intuitive phenomenon, that is, polluting hard negative samples' embeddings with a quite large proportional of positive samples' embeddings will lead to remarkable performance gains for prediction accuracy. On top of this finding, we present a novel negative sampling strategy, i.e., positive-dominated negative synthesizing (",
    "path": "papers/22/11/2211.13912.json",
    "total_tokens": 858,
    "translated_title": "加强推荐系统：减轻假阴性影响的策略",
    "translated_abstract": "在推荐系统的隐式协同过滤任务中，最近的研究主要集中在模型结构设计，使用了一些很有前景的技术，如图神经网络(GNNs)。然而，适用于这些模型的有效且高效的负采样方法仍未得到充分发展。一个挑战是现有的硬负采样器往往在模型训练中遭受更严重的过拟合问题。在这项工作中，我们首先研究了过拟合的原因，并通过实验证明了这一点，即通过不正确地选择假负实例。此外，我们经验性地观察到了一个逆向现象，即用相当大比例的正样本嵌入来污染硬负样本的嵌入，将导致预测准确性出现明显提升。基于这一发现，我们提出了一种新颖的负采样策略，即以正样本为主导的负样本合成",
    "tldr": "本研究提出了一种新颖的负采样策略，即以正样本为主导的负样本合成，可以显著提升推荐系统的预测准确性"
}