{
    "title": "Differentiable User Models. (arXiv:2211.16277v2 [cs.LG] UPDATED)",
    "abstract": "Probabilistic user modeling is essential for building machine learning systems in the ubiquitous cases with humans in the loop. However, modern advanced user models, often designed as cognitive behavior simulators, are incompatible with modern machine learning pipelines and computationally prohibitive for most practical applications. We address this problem by introducing widely-applicable differentiable surrogates for bypassing this computational bottleneck; the surrogates enable computationally efficient inference with modern cognitive models. We show experimentally that modeling capabilities comparable to the only available solution, existing likelihood-free inference methods, are achievable with a computational cost suitable for online applications. Finally, we demonstrate how AI-assistants can now use cognitive models for online interaction in a menu-search task, which has so far required hours of computation during interaction.",
    "link": "http://arxiv.org/abs/2211.16277",
    "context": "Title: Differentiable User Models. (arXiv:2211.16277v2 [cs.LG] UPDATED)\nAbstract: Probabilistic user modeling is essential for building machine learning systems in the ubiquitous cases with humans in the loop. However, modern advanced user models, often designed as cognitive behavior simulators, are incompatible with modern machine learning pipelines and computationally prohibitive for most practical applications. We address this problem by introducing widely-applicable differentiable surrogates for bypassing this computational bottleneck; the surrogates enable computationally efficient inference with modern cognitive models. We show experimentally that modeling capabilities comparable to the only available solution, existing likelihood-free inference methods, are achievable with a computational cost suitable for online applications. Finally, we demonstrate how AI-assistants can now use cognitive models for online interaction in a menu-search task, which has so far required hours of computation during interaction.",
    "path": "papers/22/11/2211.16277.json",
    "total_tokens": 851,
    "translated_title": "可微分的用户模型",
    "translated_abstract": "概率用户建模对于在人机交互中构建机器学习系统至关重要。然而，现代先进的用户模型通常被设计为认知行为模拟器，与现代机器学习流程不兼容，对于大多数实际应用来说计算代价过高。为了解决这个问题，我们引入了可广泛应用的可微分替代品，绕过计算瓶颈，使现代认知模型的推理更高效。通过实验证明，我们可以以适用于在线应用的计算成本实现与现有的无似然推理方法相当的建模能力。最后，我们展示了人工智能助手如何在菜单搜索任务中使用认知模型进行在线交互，而在交互过程中通常需要数小时的计算时间。",
    "tldr": "该研究提出了可微分的用户模型，通过引入可广泛应用的可微分替代品解决了现代先进用户模型与机器学习流程的不兼容性和计算代价过高的问题。实验证明，在线应用中可以实现与现有无似然推理方法相当的建模能力，并展示了在菜单搜索任务中如何利用认知模型进行在线交互。"
}