{
    "title": "A Benchmark of Long-tailed Instance Segmentation with Noisy Labels. (arXiv:2211.13435v2 [cs.CV] UPDATED)",
    "abstract": "In this paper, we consider the instance segmentation task on a long-tailed dataset, which contains label noise, i.e., some of the annotations are incorrect. There are two main reasons making this case realistic. First, datasets collected from real world usually obey a long-tailed distribution. Second, for instance segmentation datasets, as there are many instances in one image and some of them are tiny, it is easier to introduce noise into the annotations. Specifically, we propose a new dataset, which is a large vocabulary long-tailed dataset containing label noise for instance segmentation. Furthermore, we evaluate previous proposed instance segmentation algorithms on this dataset. The results indicate that the noise in the training dataset will hamper the model in learning rare categories and decrease the overall performance, and inspire us to explore more effective approaches to address this practical challenge. The code and dataset are available in https://github.com/GuanlinLee/Noi",
    "link": "http://arxiv.org/abs/2211.13435",
    "context": "Title: A Benchmark of Long-tailed Instance Segmentation with Noisy Labels. (arXiv:2211.13435v2 [cs.CV] UPDATED)\nAbstract: In this paper, we consider the instance segmentation task on a long-tailed dataset, which contains label noise, i.e., some of the annotations are incorrect. There are two main reasons making this case realistic. First, datasets collected from real world usually obey a long-tailed distribution. Second, for instance segmentation datasets, as there are many instances in one image and some of them are tiny, it is easier to introduce noise into the annotations. Specifically, we propose a new dataset, which is a large vocabulary long-tailed dataset containing label noise for instance segmentation. Furthermore, we evaluate previous proposed instance segmentation algorithms on this dataset. The results indicate that the noise in the training dataset will hamper the model in learning rare categories and decrease the overall performance, and inspire us to explore more effective approaches to address this practical challenge. The code and dataset are available in https://github.com/GuanlinLee/Noi",
    "path": "papers/22/11/2211.13435.json",
    "total_tokens": 968,
    "translated_title": "一种带有嘈杂标签的长尾实例分割基准测试",
    "translated_abstract": "本文考虑了在长尾数据集上进行实例分割任务，该数据集包含噪声标签，即一些注释是不正确的。这种情况具有现实意义的原因有两个。首先，从真实世界中收集的数据集通常遵循长尾分布。其次，对于实例分割数据集来说，由于一幅图像中有许多实例，其中一些实例很小，因此更容易引入注释误差。具体来说，我们提出了一个新的数据集，该数据集是一个包含噪声标签的大词汇量的长尾数据集，用于实例分割。此外，我们在该数据集上评估了先前提出的实例分割算法。结果表明，训练数据集中的噪声将阻碍模型学习稀有类别并降低整体性能，这启发我们探索更有效的方法来解决这个实际挑战。代码和数据集可以在https://github.com/GuanlinLee/Noi上找到。",
    "tldr": "本文提出了一个带有噪声标签的大词汇量的长尾数据集，用于实例分割任务的基准测试，并在该数据集上评估了先前的实例分割算法。结果表明，训练数据集中的噪声会影响模型学习稀有类别并降低整体性能，为解决这一实际挑战提供了启示。"
}