{
    "title": "A weighted-variance variational autoencoder model for speech enhancement. (arXiv:2211.00990v2 [cs.SD] CROSS LISTED)",
    "abstract": "We address speech enhancement based on variational autoencoders, which involves learning a speech prior distribution in the time-frequency (TF) domain. A zero-mean complex-valued Gaussian distribution is usually assumed for the generative model, where the speech information is encoded in the variance as a function of a latent variable. In contrast to this commonly used approach, we propose a weighted variance generative model, where the contribution of each spectrogram time-frame in parameter learning is weighted. We impose a Gamma prior distribution on the weights, which would effectively lead to a Student's t-distribution instead of Gaussian for speech generative modeling. We develop efficient training and speech enhancement algorithms based on the proposed generative model. Our experimental results on spectrogram auto-encoding and speech enhancement demonstrate the effectiveness and robustness of the proposed approach compared to the standard unweighted variance model.",
    "link": "http://arxiv.org/abs/2211.00990",
    "context": "Title: A weighted-variance variational autoencoder model for speech enhancement. (arXiv:2211.00990v2 [cs.SD] CROSS LISTED)\nAbstract: We address speech enhancement based on variational autoencoders, which involves learning a speech prior distribution in the time-frequency (TF) domain. A zero-mean complex-valued Gaussian distribution is usually assumed for the generative model, where the speech information is encoded in the variance as a function of a latent variable. In contrast to this commonly used approach, we propose a weighted variance generative model, where the contribution of each spectrogram time-frame in parameter learning is weighted. We impose a Gamma prior distribution on the weights, which would effectively lead to a Student's t-distribution instead of Gaussian for speech generative modeling. We develop efficient training and speech enhancement algorithms based on the proposed generative model. Our experimental results on spectrogram auto-encoding and speech enhancement demonstrate the effectiveness and robustness of the proposed approach compared to the standard unweighted variance model.",
    "path": "papers/22/11/2211.00990.json",
    "total_tokens": 862,
    "translated_title": "一种加权方差变分自编码器模型用于语音增强",
    "translated_abstract": "我们针对基于变分自编码器的语音增强问题进行研究，其中涉及在时频（TF）域中学习语音先验分布。通常假设生成模型为零均值复数高斯分布，其中语音信息编码在方差中作为潜在变量的函数。与常用方法相比，我们提出了一种加权方差生成模型，其中每个频谱图时间帧在参数学习中的贡献加权。我们对权重施加Gamma先验分布，这将有效地导致使用学生t分布而不是高斯分布进行语音生成建模。我们基于所提出的生成模型开发了高效的训练和语音增强算法。我们的实验结果在频谱图自编码和语音增强方面证明了所提出方法的有效性和鲁棒性，相比标准的未加权方差模型。",
    "tldr": "我们提出了一种加权方差生成模型，通过在参数学习中加权每个频谱图时间帧的贡献，并使用Gamma先验分布将复杂值高斯分布改为学生t分布，实现了更有效和更鲁棒的语音增强。",
    "en_tdlr": "We propose a weighted variance generative model that weights the contribution of each spectrogram time-frame in parameter learning and uses a Gamma prior distribution to change the complex-valued Gaussian distribution to a Student's t-distribution, achieving more effective and robust speech enhancement."
}