{
    "title": "On Estimation and Inference of Large Approximate Dynamic Factor Models via the Principal Component Analysis. (arXiv:2211.01921v3 [econ.EM] UPDATED)",
    "abstract": "We provide an alternative derivation of the asymptotic results for the Principal Components estimator of a large approximate factor model. Results are derived under a minimal set of assumptions and, in particular, we require only the existence of 4th order moments. A special focus is given to the time series setting, a case considered in almost all recent econometric applications of factor models. Hence, estimation is based on the classical $n\\times n$ sample covariance matrix and not on a $T\\times T$ covariance matrix often considered in the literature. Indeed, despite the two approaches being asymptotically equivalent, the former is more coherent with a time series setting and it immediately allows us to write more intuitive asymptotic expansions for the Principal Component estimators showing that they are equivalent to OLS as long as $\\sqrt n/T\\to 0$ and $\\sqrt T/n\\to 0$, that is the loadings are estimated in a time series regression as if the factors were known, while the factors a",
    "link": "http://arxiv.org/abs/2211.01921",
    "context": "Title: On Estimation and Inference of Large Approximate Dynamic Factor Models via the Principal Component Analysis. (arXiv:2211.01921v3 [econ.EM] UPDATED)\nAbstract: We provide an alternative derivation of the asymptotic results for the Principal Components estimator of a large approximate factor model. Results are derived under a minimal set of assumptions and, in particular, we require only the existence of 4th order moments. A special focus is given to the time series setting, a case considered in almost all recent econometric applications of factor models. Hence, estimation is based on the classical $n\\times n$ sample covariance matrix and not on a $T\\times T$ covariance matrix often considered in the literature. Indeed, despite the two approaches being asymptotically equivalent, the former is more coherent with a time series setting and it immediately allows us to write more intuitive asymptotic expansions for the Principal Component estimators showing that they are equivalent to OLS as long as $\\sqrt n/T\\to 0$ and $\\sqrt T/n\\to 0$, that is the loadings are estimated in a time series regression as if the factors were known, while the factors a",
    "path": "papers/22/11/2211.01921.json",
    "total_tokens": 917,
    "translated_title": "对大型近似动态因子模型进行主成分分析的估计和推断",
    "translated_abstract": "我们提供了一种对大型近似因子模型主成分估计器的渐近结果的替代推导。结果是在最小的假设集合下导出的，特别地，我们只需要存在4阶矩。在时间序列设置中给予了特别关注，这是几乎所有最新计量应用因子模型的情况。因此，估计是基于经典的$n\\times n$样本协方差矩阵，而不是文献中常考虑的$T\\times T$协方差矩阵。事实上，尽管这两种方法在渐近意义下等价，但前者更符合时间序列设置，并且它立即允许我们编写更直观的主成分估计渐近展开，显示它们等价于OLS，只要$\\sqrt n/T\\to 0$和$\\sqrt T/n\\to 0$，即在时间序列回归中估计载荷时假设因子已知，而因子则已知。",
    "tldr": "本文研究了大型近似动态因子模型的主成分分析估计和推断，提供了渐近结果的替代推导，并且通过经典的样本协方差矩阵进行估计，得出它们等价于OLS的结论。",
    "en_tdlr": "This paper studies estimation and inference of large approximate dynamic factor models via principal component analysis, providing an alternative derivation of asymptotic results and showing that the estimators are equivalent to ordinary least squares (OLS) when certain conditions are met."
}