{
    "title": "An interpretable imbalanced semi-supervised deep learning framework for improving differential diagnosis of skin diseases. (arXiv:2211.10858v2 [cs.CV] UPDATED)",
    "abstract": "Dermatological diseases are among the most common disorders worldwide. This paper presents the first study of the interpretability and imbalanced semi-supervised learning of the multiclass intelligent skin diagnosis framework (ISDL) using 58,457 skin images with 10,857 unlabeled samples. Pseudo-labelled samples from minority classes have a higher probability at each iteration of class-rebalancing self-training, thereby promoting the utilization of unlabeled samples to solve the class imbalance problem. Our ISDL achieved a promising performance with an accuracy of 0.979, sensitivity of 0.975, specificity of 0.973, macro-F1 score of 0.974 and area under the receiver operating characteristic curve (AUC) of 0.999 for multi-label skin disease classification. The Shapley Additive explanation (SHAP) method is combined with our ISDL to explain how the deep learning model makes predictions. This finding is consistent with the clinical diagnosis. We also proposed a sampling distribution optimisa",
    "link": "http://arxiv.org/abs/2211.10858",
    "context": "Title: An interpretable imbalanced semi-supervised deep learning framework for improving differential diagnosis of skin diseases. (arXiv:2211.10858v2 [cs.CV] UPDATED)\nAbstract: Dermatological diseases are among the most common disorders worldwide. This paper presents the first study of the interpretability and imbalanced semi-supervised learning of the multiclass intelligent skin diagnosis framework (ISDL) using 58,457 skin images with 10,857 unlabeled samples. Pseudo-labelled samples from minority classes have a higher probability at each iteration of class-rebalancing self-training, thereby promoting the utilization of unlabeled samples to solve the class imbalance problem. Our ISDL achieved a promising performance with an accuracy of 0.979, sensitivity of 0.975, specificity of 0.973, macro-F1 score of 0.974 and area under the receiver operating characteristic curve (AUC) of 0.999 for multi-label skin disease classification. The Shapley Additive explanation (SHAP) method is combined with our ISDL to explain how the deep learning model makes predictions. This finding is consistent with the clinical diagnosis. We also proposed a sampling distribution optimisa",
    "path": "papers/22/11/2211.10858.json",
    "total_tokens": 1051,
    "translated_title": "基于可解释性和不平衡半监督的深度学习框架改善皮肤疾病不同诊断的研究",
    "translated_abstract": "皮肤疾病是世界上最常见的疾病之一。本文利用58,457张皮肤图像和10,857个未标记样本，对多类智能皮肤诊断框架（ISDL）的可解释性和不平衡的半监督学习进行了研究。通过在不平衡性类别的伪标签样本上自我训练，在每次迭代中使少数类别的伪标签样本具有更高的概率，从而促进了未标记样本的利用，解决了类别不平衡问题。我们的ISDL在多标签皮肤病分类中取得了令人满意的性能，准确率为0.979，灵敏度为0.975，特异度为0.973，宏F1分数为0.974，接收者操作特征曲线下面积（AUC）为0.999。我们还将Shapley Additive explanation (SHAP)方法与ISDL结合，解释了深度学习模型的预测方式。这一发现与临床诊断一致。我们还提出了一种采样分布最优化的方法。",
    "tldr": "本文提出了一种基于可解释性和不平衡半监督深度学习框架的研究，利用伪标签样本进行自我训练来解决皮肤疾病分类中的类别不平衡问题，并取得了令人满意的性能表现。",
    "en_tdlr": "This paper presents an interpretable and imbalanced semi-supervised deep learning framework for improving differential diagnosis of skin diseases. The framework utilized self-training with pseudo-labeled samples from minority classes to solve the class imbalance problem and achieved promising performance for multi-label skin disease classification. The Shapley Additive explanation (SHAP) method was combined with the framework to explain the deep learning model's predictions, and a sampling distribution optimization was proposed."
}