{
    "title": "Semiparametric Estimation of Dynamic Binary Choice Panel Data Models. (arXiv:2202.12062v3 [econ.EM] UPDATED)",
    "abstract": "We propose a new approach to the semiparametric analysis of panel data binary choice models with fixed effects and dynamics (lagged dependent variables). The model we consider has the same random utility framework as in Honore and Kyriazidou (2000). We demonstrate that, with additional serial dependence conditions on the process of deterministic utility and tail restrictions on the error distribution, the (point) identification of the model can proceed in two steps, and only requires matching the value of an index function of explanatory variables over time, as opposed to that of each explanatory variable. Our identification approach motivates an easily implementable, two-step maximum score (2SMS) procedure -- producing estimators whose rates of convergence, in contrast to Honore and Kyriazidou's (2000) methods, are independent of the model dimension. We then derive the asymptotic properties of the 2SMS procedure and propose bootstrap-based distributional approximations for inference. ",
    "link": "http://arxiv.org/abs/2202.12062",
    "context": "Title: Semiparametric Estimation of Dynamic Binary Choice Panel Data Models. (arXiv:2202.12062v3 [econ.EM] UPDATED)\nAbstract: We propose a new approach to the semiparametric analysis of panel data binary choice models with fixed effects and dynamics (lagged dependent variables). The model we consider has the same random utility framework as in Honore and Kyriazidou (2000). We demonstrate that, with additional serial dependence conditions on the process of deterministic utility and tail restrictions on the error distribution, the (point) identification of the model can proceed in two steps, and only requires matching the value of an index function of explanatory variables over time, as opposed to that of each explanatory variable. Our identification approach motivates an easily implementable, two-step maximum score (2SMS) procedure -- producing estimators whose rates of convergence, in contrast to Honore and Kyriazidou's (2000) methods, are independent of the model dimension. We then derive the asymptotic properties of the 2SMS procedure and propose bootstrap-based distributional approximations for inference. ",
    "path": "papers/22/02/2202.12062.json",
    "total_tokens": 894,
    "translated_title": "动态二元选择面板数据模型的半参数估计",
    "translated_abstract": "我们提出了一种用于固定效应和动态（滞后依赖变量）面板数据二元选择模型的半参数分析的新方法。我们考虑的模型与Honore和Kyriazidou（2000）中的随机效用框架相同。我们证明，在对确定性效用过程和误差分布的尾部约束条件下，模型的（点）识别可以在两个步骤中进行，只需要在时间上匹配解释变量的指标函数的值，而不是每个解释变量的值。我们的识别方法提出了一种易于实施的两步最大得分（2SMS）程序--产生估计器，其收敛率与模型维数无关，与Honore和Kyriazidou（2000）的方法相比。然后，我们推导了2SMS程序的渐近性质，并提出了基于自助法的分布逼近方法进行推断。",
    "tldr": "该论文提出了一种新的方法来分析固定效应和动态二元选择模型的面板数据，通过约束条件和指标函数匹配的方式实现了模型的识别，并提出了具有独立于模型维度的收敛速度的估计器和基于自助法的推断方法。",
    "en_tdlr": "This paper proposes a new approach to analyze panel data of binary choice models with fixed effects and dynamics. By applying constraints and matching the index function of explanatory variables, the model is identified, and estimators with convergence rates independent of the model dimension are provided, along with a bootstrap-based inference method."
}