{
    "title": "The Economics of Orbit Use: Open Access, External Costs, and Runaway Debris Growth. (arXiv:2202.07442v2 [econ.GN] UPDATED)",
    "abstract": "We present a dynamic physico-economic model of Earth orbit use with endogenous satellite collision risk to study conditions under which debris-producing collisions between orbiting bodies result in debris growth that may render Earth's orbits unusable, an outcome known as Kessler Syndrome. We characterize the dynamics of objects in orbit under open access as well as when external costs -- the impact of an additional satellite launch on the collision risk faced by all satellites -- are internalized, and we show that Kessler Syndrome can emerge in both cases. Finally, we show that once the economic incentives of satellite launching are modeled, for Kessler Syndrome to emerge, autocatalytic debris growth is essential. In our main calibration, Kessler Syndrome can emerge anytime between the year 2040 and the year 2184, with the precise date being very sensitive to the calibration of autocatalytic debris growth parameters.",
    "link": "http://arxiv.org/abs/2202.07442",
    "context": "Title: The Economics of Orbit Use: Open Access, External Costs, and Runaway Debris Growth. (arXiv:2202.07442v2 [econ.GN] UPDATED)\nAbstract: We present a dynamic physico-economic model of Earth orbit use with endogenous satellite collision risk to study conditions under which debris-producing collisions between orbiting bodies result in debris growth that may render Earth's orbits unusable, an outcome known as Kessler Syndrome. We characterize the dynamics of objects in orbit under open access as well as when external costs -- the impact of an additional satellite launch on the collision risk faced by all satellites -- are internalized, and we show that Kessler Syndrome can emerge in both cases. Finally, we show that once the economic incentives of satellite launching are modeled, for Kessler Syndrome to emerge, autocatalytic debris growth is essential. In our main calibration, Kessler Syndrome can emerge anytime between the year 2040 and the year 2184, with the precise date being very sensitive to the calibration of autocatalytic debris growth parameters.",
    "path": "papers/22/02/2202.07442.json",
    "total_tokens": 909,
    "translated_title": "轨道利用的经济学：开放获取、外部成本和失控碎片的增长",
    "translated_abstract": "我们提出了一个动态的物理经济模型，用于研究地球轨道利用的条件，其中具有内生的卫星碰撞风险，以研究在轨道物体之间产生碎片的碰撞导致的可能使地球轨道无法使用的结果，即Kessler综合症。我们描述了开放获取条件下轨道上物体的动力学以及当外部成本——额外卫星发射对所有卫星面临的碰撞风险的影响——内部化时的情况，我们证明Kessler综合症在两种情况下都可能出现。最后，我们表明，一旦对卫星发射的经济激励建模，Kessler综合症的出现需要自催化的碎片增长是必不可少的。在我们的主要校准中，Kessler综合症可能在2040年至2184年之间的任何时间出现，具体日期对自催化碎片增长参数的校准非常敏感。",
    "tldr": "本研究提出了一个动态的物理经济模型，研究了地球轨道利用的条件，其中包括内生的卫星碰撞风险。研究发现，在开放获取和外部成本内部化两种情况下，Kessler综合症都可能出现，而自催化的碎片增长在Kessler综合症的出现中起到关键作用。"
}