{
    "title": "Universal approximation of credit portfolio losses using Restricted Boltzmann Machines. (arXiv:2202.11060v3 [q-fin.CP] UPDATED)",
    "abstract": "We introduce a new portfolio credit risk model based on Restricted Boltzmann Machines (RBMs), which are stochastic neural networks capable of universal approximation of loss distributions. We test the model on an empirical dataset of default probabilities of 1'012 US companies and we show that it outperforms commonly used parametric factor copula models -- such as the Gaussian or the t factor copula models -- across several credit risk management tasks. In particular, the model leads to better fits for the empirical loss distribution and more accurate risk measure estimations. We introduce an importance sampling procedure which allows risk measures to be estimated at high confidence levels in a computationally efficient way and which is a substantial improvement over the Monte Carlo techniques currently available for copula models. Furthermore, the statistical factors extracted by the model admit an interpretation in terms of the underlying portfolio sector structure and provide practi",
    "link": "http://arxiv.org/abs/2202.11060",
    "context": "Title: Universal approximation of credit portfolio losses using Restricted Boltzmann Machines. (arXiv:2202.11060v3 [q-fin.CP] UPDATED)\nAbstract: We introduce a new portfolio credit risk model based on Restricted Boltzmann Machines (RBMs), which are stochastic neural networks capable of universal approximation of loss distributions. We test the model on an empirical dataset of default probabilities of 1'012 US companies and we show that it outperforms commonly used parametric factor copula models -- such as the Gaussian or the t factor copula models -- across several credit risk management tasks. In particular, the model leads to better fits for the empirical loss distribution and more accurate risk measure estimations. We introduce an importance sampling procedure which allows risk measures to be estimated at high confidence levels in a computationally efficient way and which is a substantial improvement over the Monte Carlo techniques currently available for copula models. Furthermore, the statistical factors extracted by the model admit an interpretation in terms of the underlying portfolio sector structure and provide practi",
    "path": "papers/22/02/2202.11060.json",
    "total_tokens": 942,
    "translated_title": "利用受限玻尔兹曼机实现信用组合损失的通用逼近",
    "translated_abstract": "我们介绍了一种基于受限玻尔兹曼机（RBMs）的新型组合信用风险模型，这是一种具有通用逼近损失分布能力的随机神经网络。我们在一个包含1,012家美国公司违约概率的实证数据集上测试了该模型，并且证明它在多个信用风险管理任务中优于常用的参数因子Copula模型，如高斯或t因子Copula模型。特别地，该模型可以更好地拟合实际损失分布，并提供更准确的风险度量估计。我们引入了一种重要性采样过程，可以以计算高效的方式估计置信度水平较高的风险度量，并且这是目前对于Copula模型可用的蒙特卡罗技术的重大改进。此外，该模型提取的统计因素在组合行业结构方面具有解释性，并为实践提供了参考。",
    "tldr": "本论文提出了一种基于受限玻尔兹曼机的信用组合风险模型，能够更好地拟合实际损失分布并提供更准确的风险度量估计，同时引入的重要性采样算法使得估计高置信度水平下的风险度量变得更加高效。"
}