{
    "title": "Bernstein Flows for Flexible Posteriors in Variational Bayes",
    "abstract": "arXiv:2202.05650v2 Announce Type: replace-cross  Abstract: Variational inference (VI) is a technique to approximate difficult to compute posteriors by optimization. In contrast to MCMC, VI scales to many observations. In the case of complex posteriors, however, state-of-the-art VI approaches often yield unsatisfactory posterior approximations. This paper presents Bernstein flow variational inference (BF-VI), a robust and easy-to-use method, flexible enough to approximate complex multivariate posteriors. BF-VI combines ideas from normalizing flows and Bernstein polynomial-based transformation models. In benchmark experiments, we compare BF-VI solutions with exact posteriors, MCMC solutions, and state-of-the-art VI methods including normalizing flow based VI. We show for low-dimensional models that BF-VI accurately approximates the true posterior; in higher-dimensional models, BF-VI outperforms other VI methods. Further, we develop with BF-VI a Bayesian model for the semi-structured Mela",
    "link": "https://arxiv.org/abs/2202.05650",
    "context": "Title: Bernstein Flows for Flexible Posteriors in Variational Bayes\nAbstract: arXiv:2202.05650v2 Announce Type: replace-cross  Abstract: Variational inference (VI) is a technique to approximate difficult to compute posteriors by optimization. In contrast to MCMC, VI scales to many observations. In the case of complex posteriors, however, state-of-the-art VI approaches often yield unsatisfactory posterior approximations. This paper presents Bernstein flow variational inference (BF-VI), a robust and easy-to-use method, flexible enough to approximate complex multivariate posteriors. BF-VI combines ideas from normalizing flows and Bernstein polynomial-based transformation models. In benchmark experiments, we compare BF-VI solutions with exact posteriors, MCMC solutions, and state-of-the-art VI methods including normalizing flow based VI. We show for low-dimensional models that BF-VI accurately approximates the true posterior; in higher-dimensional models, BF-VI outperforms other VI methods. Further, we develop with BF-VI a Bayesian model for the semi-structured Mela",
    "path": "papers/22/02/2202.05650.json",
    "total_tokens": 883,
    "translated_title": "变分贝叶斯中的柔性后验的伯恩斯块流",
    "translated_abstract": "变分推断（VI）是一种通过优化来近似难以计算后验的技术。与MCMC相比，VI可以扩展到许多观测。然而，在复杂后验的情况下，现有的VI方法通常产生令人不满意的后验近似。本文提出了伯恩斯块流变分推断（BF-VI），这是一种稳健且易于使用的方法，足够灵活以逼近复杂的多元后验。BF-VI结合了归一化流和基于伯恩斯多项式的转换模型的思想。在基准实验中，我们将BF-VI解与准确的后验、MCMC解以及基于归一化流的VI等现有VI方法进行了比较。我们发现在低维模型中，BF-VI可以准确逼近真实后验；而在高维模型中，BF-VI优于其他VI方法。此外，我们利用BF-VI针对半结构化Mela开发了一个贝叶斯模型。",
    "tldr": "该论文提出了一种名为伯恩斯块流变分推断（BF-VI）的方法，能够灵活逼近复杂的多元后验，在实验中表现优于其他VI方法。",
    "en_tdlr": "This paper introduces a method called Bernstein flow variational inference (BF-VI), which is able to flexibly approximate complex multivariate posteriors and outperforms other VI methods in experiments."
}