{
    "title": "CMW-Net: Learning a Class-Aware Sample Weighting Mapping for Robust Deep Learning. (arXiv:2202.05613v3 [cs.LG] UPDATED)",
    "abstract": "Modern deep neural networks can easily overfit to biased training data containing corrupted labels or class imbalance. Sample re-weighting methods are popularly used to alleviate this data bias issue. Most current methods, however, require to manually pre-specify the weighting schemes as well as their additional hyper-parameters relying on the characteristics of the investigated problem and training data. This makes them fairly hard to be generally applied in practical scenarios, due to their significant complexities and inter-class variations of data bias situations. To address this issue, we propose a meta-model capable of adaptively learning an explicit weighting scheme directly from data. Specifically, by seeing each training class as a separate learning task, our method aims to extract an explicit weighting function with sample loss and task/class feature as input, and sample weight as output, expecting to impose adaptively varying weighting schemes to different sample classes bas",
    "link": "http://arxiv.org/abs/2202.05613",
    "context": "Title: CMW-Net: Learning a Class-Aware Sample Weighting Mapping for Robust Deep Learning. (arXiv:2202.05613v3 [cs.LG] UPDATED)\nAbstract: Modern deep neural networks can easily overfit to biased training data containing corrupted labels or class imbalance. Sample re-weighting methods are popularly used to alleviate this data bias issue. Most current methods, however, require to manually pre-specify the weighting schemes as well as their additional hyper-parameters relying on the characteristics of the investigated problem and training data. This makes them fairly hard to be generally applied in practical scenarios, due to their significant complexities and inter-class variations of data bias situations. To address this issue, we propose a meta-model capable of adaptively learning an explicit weighting scheme directly from data. Specifically, by seeing each training class as a separate learning task, our method aims to extract an explicit weighting function with sample loss and task/class feature as input, and sample weight as output, expecting to impose adaptively varying weighting schemes to different sample classes bas",
    "path": "papers/22/02/2202.05613.json",
    "total_tokens": 843,
    "translated_title": "CMW-Net: 用于深度学习的类别感知样本加权映射的鲁棒性学习",
    "translated_abstract": "现代深度神经网络很容易过度拟合具有有偏标签或类别不平衡的训练数据。样本重新加权方法被广泛用于缓解这种数据偏见问题。然而，大多数现有方法需要手动预先指定加权方案以及它们的额外超参数，依赖于研究问题和训练数据的特性。为了解决这个问题，我们提出了一种元模型，能够从数据中自适应地学习显式的加权方案。具体来说，我们的方法将每个训练类别视为单独的学习任务，并旨在提取一个显式的加权函数，将样本损失和任务/类别特征作为输入，样本权重作为输出，从而期望对不同的样本类别施加自适应的变化加权方案。",
    "tldr": "提出了一种从数据中自适应地学习显式的加权方案的元模型，用于缓解深度神经网络在具有数据偏见问题时的过度拟合问题。",
    "en_tdlr": "A meta-model is proposed to adaptively learn an explicit weighting scheme directly from data, aiming to alleviate the overfitting problem of deep neural networks with data bias, which usually requires manually pre-specified weighting schemes and additional hyper-parameters."
}