{
    "title": "StratDef: Strategic Defense Against Adversarial Attacks in ML-based Malware Detection. (arXiv:2202.07568v5 [cs.LG] UPDATED)",
    "abstract": "Over the years, most research towards defenses against adversarial attacks on machine learning models has been in the image recognition domain. The malware detection domain has received less attention despite its importance. Moreover, most work exploring these defenses has focused on several methods but with no strategy when applying them. In this paper, we introduce StratDef, which is a strategic defense system based on a moving target defense approach. We overcome challenges related to the systematic construction, selection, and strategic use of models to maximize adversarial robustness. StratDef dynamically and strategically chooses the best models to increase the uncertainty for the attacker while minimizing critical aspects in the adversarial ML domain, like attack transferability. We provide the first comprehensive evaluation of defenses against adversarial attacks on machine learning for malware detection, where our threat model explores different levels of threat, attacker know",
    "link": "http://arxiv.org/abs/2202.07568",
    "context": "Title: StratDef: Strategic Defense Against Adversarial Attacks in ML-based Malware Detection. (arXiv:2202.07568v5 [cs.LG] UPDATED)\nAbstract: Over the years, most research towards defenses against adversarial attacks on machine learning models has been in the image recognition domain. The malware detection domain has received less attention despite its importance. Moreover, most work exploring these defenses has focused on several methods but with no strategy when applying them. In this paper, we introduce StratDef, which is a strategic defense system based on a moving target defense approach. We overcome challenges related to the systematic construction, selection, and strategic use of models to maximize adversarial robustness. StratDef dynamically and strategically chooses the best models to increase the uncertainty for the attacker while minimizing critical aspects in the adversarial ML domain, like attack transferability. We provide the first comprehensive evaluation of defenses against adversarial attacks on machine learning for malware detection, where our threat model explores different levels of threat, attacker know",
    "path": "papers/22/02/2202.07568.json",
    "total_tokens": 1024,
    "translated_title": "StratDef: 机器学习恶意软件检测对抗攻击的战略防御",
    "translated_abstract": "多年来针对机器学习模型的对抗攻击防御大多集中在图像识别领域。尽管恶意软件检测领域的重要性很高，但它却受到了较少的关注。而且，大多数关于这些防御措施的研究都集中在一些方法上，而没有具体的应用策略。本文提出了一个名为StratDef的战略防御系统，它基于移动目标防御方法。我们解决了涉及模型系统化构建、选择和战略使用的挑战，以最大化对抗鲁棒性。在对抗机器学习领域的关键方面，如攻击可转移性，StratDef动态地和策略地选择最佳模型，以增加攻击者的不确定性，同时最小化对攻击的影响。我们为机器学习恶意软件检测的防御措施首次进行了全面评估，其中我们的威胁模型探索了不同级别的威胁、攻击者的知识水平等。",
    "tldr": "本文提出了一个名为StratDef的移动目标防御方法的战略防御系统，针对机器学习恶意软件检测的防御措施进行了全面评估。StratDef动态地和策略地选择最佳模型，以增加攻击者的不确定性，同时最小化对攻击的影响，使其具有很高的对抗鲁棒性。",
    "en_tdlr": "This paper presents StratDef, a strategic defense system for machine learning-based malware detection against adversarial attacks, based on a moving target defense approach. It provides the first comprehensive evaluation of defenses against adversarial attacks on machine learning for malware detection. StratDef dynamically and strategically chooses the best models to increase the uncertainty for the attacker while minimizing critical aspects in the adversarial ML domain, resulting in high adversarial robustness."
}