{
    "title": "Learning POD of Complex Dynamics Using Heavy-ball Neural ODEs. (arXiv:2202.12373v2 [cs.LG] UPDATED)",
    "abstract": "Proper orthogonal decomposition (POD) allows reduced-order modeling of complex dynamical systems at a substantial level, while maintaining a high degree of accuracy in modeling the underlying dynamical systems. Advances in machine learning algorithms enable learning POD-based dynamics from data and making accurate and fast predictions of dynamical systems. In this paper, we leverage the recently proposed heavy-ball neural ODEs (HBNODEs) [Xia et al. NeurIPS, 2021] for learning data-driven reduced-order models (ROMs) in the POD context, in particular, for learning dynamics of time-varying coefficients generated by the POD analysis on training snapshots generated from solving full order models. HBNODE enjoys several practical advantages for learning POD-based ROMs with theoretical guarantees, including 1) HBNODE can learn long-term dependencies effectively from sequential observations and 2) HBNODE is computationally efficient in both training and testing. We compare HBNODE with other pop",
    "link": "http://arxiv.org/abs/2202.12373",
    "raw_ret": "{\n    \"translated_title\": \"使用重球神经ODE学习复杂动力学的POD\",\n    \"translated_abstract\": \"适当的正交分解（POD）允许在显著程度上减小复杂动态系统的建模，同时保持对底层动态系统建模的高度准确性。机器学习算法的进步使得可以从数据中学习基于POD的动态，并对动态系统进行准确快速的预测。在本文中，我们利用最近提出的重球神经ODE（HBNODE）[Xia等人NeurIPS，2021]，在POD上下文中用于学习基于数据驱动的降阶模型（ROMs），特别是用于学习由POD分析生成的训练快照中解决完整阶模型产生的时间变化系数的动态。 HBNODE具有几个实用优点，具有理论保证，包括1）HBNODE可以有效地从顺序观测中学习长期依赖关系，2）HBNODE在训练和测试中都具有计算效率。我们将HBNODE与其他流行的模型进行了比较\",\n    \"tldr\": \"本文提出利用重球神经ODE学习POD上下文中的数据驱动的降阶模型，以及HBNODE学习长期依赖关系的能力，具有高效的计算性能。\"\n}",
    "total_tokens": 871,
    "ret": {
        "translated_title": "使用重球神经ODE学习复杂动力学的POD",
        "translated_abstract": "适当的正交分解（POD）允许在显著程度上减小复杂动态系统的建模，同时保持对底层动态系统建模的高度准确性。机器学习算法的进步使得可以从数据中学习基于POD的动态，并对动态系统进行准确快速的预测。在本文中，我们利用最近提出的重球神经ODE（HBNODE）[Xia等人NeurIPS，2021]，在POD上下文中用于学习基于数据驱动的降阶模型（ROMs），特别是用于学习由POD分析生成的训练快照中解决完整阶模型产生的时间变化系数的动态。 HBNODE具有几个实用优点，具有理论保证，包括1）HBNODE可以有效地从顺序观测中学习长期依赖关系，2）HBNODE在训练和测试中都具有计算效率。我们将HBNODE与其他流行的模型进行了比较",
        "tldr": "本文提出利用重球神经ODE学习POD上下文中的数据驱动的降阶模型，以及HBNODE学习长期依赖关系的能力，具有高效的计算性能。"
    }
}