{
    "title": "Mapping intra firm trade in the automotive sector: a network approach. (arXiv:2202.00409v2 [econ.GN] UPDATED)",
    "abstract": "Intra-firm trade describes the trade between affiliated firms and is increasingly important as global production is fragmented. However, statistics and data on global intra-firm trade patterns are widely unavailable. This study proposes a novel multilevel approach combining firm and country level data to construct a set of country intra-firm trade networks for various segments of the automotive production chain. A multilevel network is constructed with a network of international trade at the macro level, a firm ownership network at the micro level and a firm-country affiliation network linking the two, at the meso level. A motif detection approach is used to filter these networks to extract potential intra-firm trade ties between countries, where the motif (or substructure) is two countries linked by trade, each affiliated with a firm, and these two firms linked by ownership. The motif detection is used to extract potential country level intra-firm trade ties. An Exponential Random Gra",
    "link": "http://arxiv.org/abs/2202.00409",
    "context": "Title: Mapping intra firm trade in the automotive sector: a network approach. (arXiv:2202.00409v2 [econ.GN] UPDATED)\nAbstract: Intra-firm trade describes the trade between affiliated firms and is increasingly important as global production is fragmented. However, statistics and data on global intra-firm trade patterns are widely unavailable. This study proposes a novel multilevel approach combining firm and country level data to construct a set of country intra-firm trade networks for various segments of the automotive production chain. A multilevel network is constructed with a network of international trade at the macro level, a firm ownership network at the micro level and a firm-country affiliation network linking the two, at the meso level. A motif detection approach is used to filter these networks to extract potential intra-firm trade ties between countries, where the motif (or substructure) is two countries linked by trade, each affiliated with a firm, and these two firms linked by ownership. The motif detection is used to extract potential country level intra-firm trade ties. An Exponential Random Gra",
    "path": "papers/22/02/2202.00409.json",
    "total_tokens": 937,
    "translated_title": "在汽车行业中的企业内贸易的映射: 一种网络方法",
    "translated_abstract": "企业内贸易描述的是附属企业之间的贸易，随着全球生产的分散化，它变得越来越重要。然而，关于全球企业内贸易模式的统计数据普遍不可得。本研究提出了一种新颖的多层次方法，将企业和国家层面的数据结合起来，构建了一组汽车生产链各个环节的国家内部企业贸易网络。在宏观层面上构建了一种多层次网络，其中包括国际贸易网络、微观层面上的企业所有权网络以及将两者连接起来的企业-国家隶属网络。采用图形模式检测方法来筛选这些网络，提取潜在的国家内部企业贸易联系，其中模式（或子结构）是由贸易相连的两个国家，每个国家都附属于一个企业，而这两个企业又通过所有权联系在一起。图形模式检测用于提取潜在的国家层面的企业内贸易联系。",
    "tldr": "本研究提出了一种多层次方法，利用企业和国家层面的数据构建了一组汽车生产链各个环节的国家内部企业贸易网络。通过图形模式检测方法，提取了潜在的国家层面的企业内贸易联系。",
    "en_tdlr": "This study proposes a multilevel approach that combines firm and country level data to construct a set of country intra-firm trade networks for various segments of the automotive production chain. Using motif detection, potential intra-firm trade ties between countries are extracted."
}