{
    "title": "Group-Agent Reinforcement Learning. (arXiv:2202.05135v4 [cs.LG] UPDATED)",
    "abstract": "It can largely benefit the reinforcement learning (RL) process of each agent if multiple geographically distributed agents perform their separate RL tasks cooperatively. Different from multi-agent reinforcement learning (MARL) where multiple agents are in a common environment and should learn to cooperate or compete with each other, in this case each agent has its separate environment and only communicates with others to share knowledge without any cooperative or competitive behaviour as a learning outcome. In fact, this scenario exists widely in real life whose concept can be utilised in many applications, but is not well understood yet and not well formulated. As the first effort, we propose group-agent system for RL as a formulation of this scenario and the third type of RL system with respect to single-agent and multi-agent systems. We then propose a distributed RL framework called DDAL (Decentralised Distributed Asynchronous Learning) designed for group-agent reinforcement learnin",
    "link": "http://arxiv.org/abs/2202.05135",
    "context": "Title: Group-Agent Reinforcement Learning. (arXiv:2202.05135v4 [cs.LG] UPDATED)\nAbstract: It can largely benefit the reinforcement learning (RL) process of each agent if multiple geographically distributed agents perform their separate RL tasks cooperatively. Different from multi-agent reinforcement learning (MARL) where multiple agents are in a common environment and should learn to cooperate or compete with each other, in this case each agent has its separate environment and only communicates with others to share knowledge without any cooperative or competitive behaviour as a learning outcome. In fact, this scenario exists widely in real life whose concept can be utilised in many applications, but is not well understood yet and not well formulated. As the first effort, we propose group-agent system for RL as a formulation of this scenario and the third type of RL system with respect to single-agent and multi-agent systems. We then propose a distributed RL framework called DDAL (Decentralised Distributed Asynchronous Learning) designed for group-agent reinforcement learnin",
    "path": "papers/22/02/2202.05135.json",
    "total_tokens": 924,
    "translated_title": "群体代理强化学习",
    "translated_abstract": "如果多个地理分布的代理进行合作性的个别强化学习任务，可以为每个代理的强化学习过程带来很大的好处。与多智能体强化学习（MARL）不同，MARL中多个代理共同存在于一个环境中，并且需要学习如何合作或竞争。在群体代理强化学习中，每个代理都有自己的环境，并且只与其他代理进行通信以分享知识，没有合作或竞争行为作为学习结果。事实上，这种情景在现实生活中普遍存在，其概念可以应用于许多应用领域，但尚未很好理解和表述。作为首次尝试，我们提出了群体代理强化学习系统作为对单个代理和多个代理系统的第三类强化学习系统的表述。然后，我们提出了一种分布式强化学习框架DDAL（分散式分布式异步学习），专为群体代理强化学习而设计。",
    "tldr": "群体代理强化学习是一种新型的强化学习方法，其利用多个代理之间的合作来提高每个代理的学习效果。我们提出了群体代理强化学习系统的概念，并设计了一种分布式强化学习框架DDAL来支持群体代理强化学习。",
    "en_tdlr": "Group-Agent Reinforcement Learning is a novel approach that leverages cooperative learning among multiple agents to improve individual learning performance. We propose the concept of a group-agent reinforcement learning system and introduce a distributed reinforcement learning framework called DDAL to support this approach."
}