{
    "title": "On the Convergence of SARSA with Linear Function Approximation. (arXiv:2202.06828v2 [cs.LG] UPDATED)",
    "abstract": "SARSA, a classical on-policy control algorithm for reinforcement learning, is known to chatter when combined with linear function approximation: SARSA does not diverge but oscillates in a bounded region. However, little is known about how fast SARSA converges to that region and how large the region is. In this paper, we make progress towards this open problem by showing the convergence rate of projected SARSA to a bounded region. Importantly, the region is much smaller than the region that we project into, provided that the magnitude of the reward is not too large. Existing works regarding the convergence of linear SARSA to a fixed point all require the Lipschitz constant of SARSA's policy improvement operator to be sufficiently small; our analysis instead applies to arbitrary Lipschitz constants and thus characterizes the behavior of linear SARSA for a new regime.",
    "link": "http://arxiv.org/abs/2202.06828",
    "context": "Title: On the Convergence of SARSA with Linear Function Approximation. (arXiv:2202.06828v2 [cs.LG] UPDATED)\nAbstract: SARSA, a classical on-policy control algorithm for reinforcement learning, is known to chatter when combined with linear function approximation: SARSA does not diverge but oscillates in a bounded region. However, little is known about how fast SARSA converges to that region and how large the region is. In this paper, we make progress towards this open problem by showing the convergence rate of projected SARSA to a bounded region. Importantly, the region is much smaller than the region that we project into, provided that the magnitude of the reward is not too large. Existing works regarding the convergence of linear SARSA to a fixed point all require the Lipschitz constant of SARSA's policy improvement operator to be sufficiently small; our analysis instead applies to arbitrary Lipschitz constants and thus characterizes the behavior of linear SARSA for a new regime.",
    "path": "papers/22/02/2202.06828.json",
    "total_tokens": 806,
    "translated_title": "关于带有线性函数逼近的SARSA算法收敛性的研究",
    "translated_abstract": "SARSA是一种经典的增强学习算法，该算法在与线性函数逼近相结合时会出现震荡现象。本文通过展示投影SARSA到有限区域的收敛速度，取得了在此方面的一定进展。惊人的是，只要奖励的大小不是太大，收敛区域比想象中的要小得多。值得注意的是，现有的关于线性SARSA收敛性的研究都需要SARSA策略改进算子的Lipschitz常数足够小；与之不同的是，我们的分析适用于任意Lipschitz常数，从而揭示了线性SARSA的新行为范式。",
    "tldr": "本文通过对投影SARSA到有限区域的收敛速度的探究，取得了在带有线性函数逼近的SARSA算法收敛性方面的进展，发现收敛区域比想象的要小得多。"
}