{
    "title": "Improving Molecular Representation Learning with Metric Learning-enhanced Optimal Transport. (arXiv:2202.06208v3 [cs.LG] UPDATED)",
    "abstract": "Training data are usually limited or heterogeneous in many chemical and biological applications. Existing machine learning models for chemistry and materials science fail to consider generalizing beyond training domains. In this article, we develop a novel optimal transport-based algorithm termed MROT to enhance their generalization capability for molecular regression problems. MROT learns a continuous label of the data by measuring a new metric of domain distances and a posterior variance regularization over the transport plan to bridge the chemical domain gap. Among downstream tasks, we consider basic chemical regression tasks in unsupervised and semi-supervised settings, including chemical property prediction and materials adsorption selection. Extensive experiments show that MROT significantly outperforms state-of-the-art models, showing promising potential in accelerating the discovery of new substances with desired properties.",
    "link": "http://arxiv.org/abs/2202.06208",
    "context": "Title: Improving Molecular Representation Learning with Metric Learning-enhanced Optimal Transport. (arXiv:2202.06208v3 [cs.LG] UPDATED)\nAbstract: Training data are usually limited or heterogeneous in many chemical and biological applications. Existing machine learning models for chemistry and materials science fail to consider generalizing beyond training domains. In this article, we develop a novel optimal transport-based algorithm termed MROT to enhance their generalization capability for molecular regression problems. MROT learns a continuous label of the data by measuring a new metric of domain distances and a posterior variance regularization over the transport plan to bridge the chemical domain gap. Among downstream tasks, we consider basic chemical regression tasks in unsupervised and semi-supervised settings, including chemical property prediction and materials adsorption selection. Extensive experiments show that MROT significantly outperforms state-of-the-art models, showing promising potential in accelerating the discovery of new substances with desired properties.",
    "path": "papers/22/02/2202.06208.json",
    "total_tokens": 885,
    "translated_title": "用度量学习增强的最优传输改进分子表示学习",
    "translated_abstract": "在许多化学和生物应用中，训练数据通常有限或异构。现有的化学和材料科学的机器学习模型未能考虑训练领域之外的泛化能力。在本文中，我们开发了一种基于最优传输的新算法MROT，用于增强分子回归问题的泛化能力。MROT通过测量一种新的领域距离度量和传输计划上的后验方差正则化，来学习数据的连续标签，以弥合化学领域的差距。在下游任务中，我们考虑了无监督和半监督设置中的基本化学回归任务，包括化学性质预测和材料吸附选择。大量实验表明，MROT显著优于现有模型，在加速发现具有期望性质的新物质方面具有潜在的潜力。",
    "tldr": "本文提出了一种基于最优传输的算法MROT，用于改进分子表示学习和增强其泛化能力。实验证明，MROT在化学性质预测和材料吸附选择等任务中显著优于现有模型，具有加速发现具有期望性质的新物质的潜力。"
}