{
    "title": "Information Design in Games: Certification Approach. (arXiv:2202.10883v3 [econ.TH] UPDATED)",
    "abstract": "Several players participate in a game with a continuum of actions. A designer chooses an information structure -- a joint distribution of a state and private signals -- and evaluates it according to the expected designer's payoff in the induced Bayes Nash equilibrium. We show an information structure is designer-optimal whenever the equilibrium play it induces can also be induced in an auxiliary contracting problem.  This finding gives rise to a tractable solution method, which we use to study two novel applications. In an investment game, an optimal structure fully informs a single investor while providing no information to others. This structure is robustly optimal, for any state distribution and number of investors. In a price competition game, an optimal structure is Gaussian and recommends prices linearly in the state. This structure is uniquely optimal.",
    "link": "http://arxiv.org/abs/2202.10883",
    "context": "Title: Information Design in Games: Certification Approach. (arXiv:2202.10883v3 [econ.TH] UPDATED)\nAbstract: Several players participate in a game with a continuum of actions. A designer chooses an information structure -- a joint distribution of a state and private signals -- and evaluates it according to the expected designer's payoff in the induced Bayes Nash equilibrium. We show an information structure is designer-optimal whenever the equilibrium play it induces can also be induced in an auxiliary contracting problem.  This finding gives rise to a tractable solution method, which we use to study two novel applications. In an investment game, an optimal structure fully informs a single investor while providing no information to others. This structure is robustly optimal, for any state distribution and number of investors. In a price competition game, an optimal structure is Gaussian and recommends prices linearly in the state. This structure is uniquely optimal.",
    "path": "papers/22/02/2202.10883.json",
    "total_tokens": 876,
    "translated_title": "游戏中的信息设计: 认证方法",
    "translated_abstract": "多个参与者在具有连续动作的游戏中参与。设计师选择一种信息结构--一个状态和私有信号的联合分布，并根据在引起贝叶斯纳什均衡中的预期设计师回报来评估它。我们表明，当信息结构还可以在辅助合同问题中诱导出纳什均衡时，该信息结构是设计师最优的。这一发现引发了一个可处理的解决方法，我们用它来研究两个新的应用。在一个投资游戏中，最优结构向单个投资者提供完全信息，但对其他投资者不提供任何信息。这种结构在任何状态分布和投资者数量下都是稳健最优的。在一个价格竞争游戏中，最优结构是高斯的，并且在状态中线性推荐价格。这种结构是唯一最优的。",
    "tldr": "该论文提出了一种认证方法，用于游戏中的信息设计。研究发现，在设计师期望的贝叶斯纳什均衡中诱导出来的信息结构也可以通过辅助合同问题诱导出来。该方法适用于解决投资游戏和价格竞争游戏中的问题，并得到了稳健最优的解决方法。",
    "en_tdlr": "This paper presents a certification approach for information design in games. The study shows that an information structure is designer-optimal when the equilibrium play it induces can also be induced in an auxiliary contracting problem. This approach provides a tractable solution method for investment games and price competition games, achieving robust optimality."
}