{
    "title": "Optimal Algorithms for Decentralized Stochastic Variational Inequalities. (arXiv:2202.02771v2 [math.OC] UPDATED)",
    "abstract": "Variational inequalities are a formalism that includes games, minimization, saddle point, and equilibrium problems as special cases. Methods for variational inequalities are therefore universal approaches for many applied tasks, including machine learning problems. This work concentrates on the decentralized setting, which is increasingly important but not well understood. In particular, we consider decentralized stochastic (sum-type) variational inequalities over fixed and time-varying networks. We present lower complexity bounds for both communication and local iterations and construct optimal algorithms that match these lower bounds. Our algorithms are the best among the available literature not only in the decentralized stochastic case, but also in the decentralized deterministic and non-distributed stochastic cases. Experimental results confirm the effectiveness of the presented algorithms.",
    "link": "http://arxiv.org/abs/2202.02771",
    "context": "Title: Optimal Algorithms for Decentralized Stochastic Variational Inequalities. (arXiv:2202.02771v2 [math.OC] UPDATED)\nAbstract: Variational inequalities are a formalism that includes games, minimization, saddle point, and equilibrium problems as special cases. Methods for variational inequalities are therefore universal approaches for many applied tasks, including machine learning problems. This work concentrates on the decentralized setting, which is increasingly important but not well understood. In particular, we consider decentralized stochastic (sum-type) variational inequalities over fixed and time-varying networks. We present lower complexity bounds for both communication and local iterations and construct optimal algorithms that match these lower bounds. Our algorithms are the best among the available literature not only in the decentralized stochastic case, but also in the decentralized deterministic and non-distributed stochastic cases. Experimental results confirm the effectiveness of the presented algorithms.",
    "path": "papers/22/02/2202.02771.json",
    "total_tokens": 820,
    "translated_title": "分布式随机变分不等式的最优算法",
    "translated_abstract": "变分不等式是一个包括了博弈、最小化、鞍点和平衡问题的形式化方法。因此，变分不等式的方法是许多应用任务的通用方法，包括机器学习问题。本文关注分布式设置，分布式设置越来越重要，但不太被了解。特别是，我们考虑在固定和时变网络上进行分布式随机（总和类型）变分不等式。我们为通信和局部迭代双方提出了较低的复杂度下界，并构建了与这些下界匹配的最优算法。我们的算法不仅在分布式随机情况下是最好的，而且在分布式确定性和非分布式随机情况下也是最好的。实验结果证实了所提出算法的有效性。",
    "tldr": "本文针对分布式随机变分不等式的问题，提出了匹配复杂度下界的最优算法，不仅在分布式随机情况下表现最佳，在分布式确定性和非分布式随机情况下也是最佳的，并得到实验验证。",
    "en_tdlr": "This paper proposes optimal algorithms that match the lower complexity bounds for decentralized stochastic variational inequalities, which address both fixed and time-varying networks. The algorithms not only outperform other available options for decentralized stochastic cases, but also for decentralized deterministic and non-distributed stochastic cases. Experimental results confirm their effectiveness."
}