{
    "title": "Bayesian Imputation with Optimal Look-Ahead-Bias and Variance Tradeoff. (arXiv:2202.00871v2 [stat.ME] UPDATED)",
    "abstract": "Missing time-series data is a prevalent problem in many prescriptive analytics models in operations management, healthcare and finance. Imputation methods for time-series data are usually applied to the full panel data with the purpose of training a prescriptive model for a downstream out-of-sample task. For example, the imputation of missing asset returns may be applied before estimating an optimal portfolio allocation. However, this practice can result in a look-ahead-bias in the future performance of the downstream task, and there is an inherent trade-off between the look-ahead-bias of using the entire data set for imputation and the larger variance of using only the training portion of the data set for imputation. By connecting layers of information revealed in time, we propose a Bayesian consensus posterior that fuses an arbitrary number of posteriors to optimize the variance and look-ahead-bias trade-off in the imputation. We derive tractable two-step optimization procedures for ",
    "link": "http://arxiv.org/abs/2202.00871",
    "context": "Title: Bayesian Imputation with Optimal Look-Ahead-Bias and Variance Tradeoff. (arXiv:2202.00871v2 [stat.ME] UPDATED)\nAbstract: Missing time-series data is a prevalent problem in many prescriptive analytics models in operations management, healthcare and finance. Imputation methods for time-series data are usually applied to the full panel data with the purpose of training a prescriptive model for a downstream out-of-sample task. For example, the imputation of missing asset returns may be applied before estimating an optimal portfolio allocation. However, this practice can result in a look-ahead-bias in the future performance of the downstream task, and there is an inherent trade-off between the look-ahead-bias of using the entire data set for imputation and the larger variance of using only the training portion of the data set for imputation. By connecting layers of information revealed in time, we propose a Bayesian consensus posterior that fuses an arbitrary number of posteriors to optimize the variance and look-ahead-bias trade-off in the imputation. We derive tractable two-step optimization procedures for ",
    "path": "papers/22/02/2202.00871.json",
    "total_tokens": 975,
    "translated_title": "贝叶斯插补中的最优前瞻偏差和方差权衡",
    "translated_abstract": "缺失的时间序列数据常常是规范分析模型中的问题，针对这个问题，我们提出了一种贝叶斯共识后验来优化方差和前瞻偏差之间的权衡。我们还推导了可行的两步优化过程。",
    "tldr": "本文提出了一种贝叶斯共识后验来解决规范分析模型中缺失时间序列数据的问题，可以优化方差和前瞻偏差之间的权衡。",
    "en_tdlr": "This paper proposes a Bayesian consensus posterior to address the issue of missing time-series data in prescriptive analytics models, and provides a solution to optimize the tradeoff between variance and look-ahead-bias."
}