{
    "title": "PGCN: Progressive Graph Convolutional Networks for Spatial-Temporal Traffic Forecasting. (arXiv:2202.08982v2 [cs.LG] UPDATED)",
    "abstract": "The complex spatial-temporal correlations in transportation networks make the traffic forecasting problem challenging. Since transportation system inherently possesses graph structures, much research efforts have been put with graph neural networks. Recently, constructing adaptive graphs to the data has shown promising results over the models relying on a single static graph structure. However, the graph adaptations are applied during the training phases, and do not reflect the data used during the testing phases. Such shortcomings can be problematic especially in traffic forecasting since the traffic data often suffers from the unexpected changes and irregularities in the time series. In this study, we propose a novel traffic forecasting framework called Progressive Graph Convolutional Network (PGCN). PGCN constructs a set of graphs by progressively adapting to input data during the training and the testing phases. Specifically, we implemented the model to construct progressive adjace",
    "link": "http://arxiv.org/abs/2202.08982",
    "context": "Title: PGCN: Progressive Graph Convolutional Networks for Spatial-Temporal Traffic Forecasting. (arXiv:2202.08982v2 [cs.LG] UPDATED)\nAbstract: The complex spatial-temporal correlations in transportation networks make the traffic forecasting problem challenging. Since transportation system inherently possesses graph structures, much research efforts have been put with graph neural networks. Recently, constructing adaptive graphs to the data has shown promising results over the models relying on a single static graph structure. However, the graph adaptations are applied during the training phases, and do not reflect the data used during the testing phases. Such shortcomings can be problematic especially in traffic forecasting since the traffic data often suffers from the unexpected changes and irregularities in the time series. In this study, we propose a novel traffic forecasting framework called Progressive Graph Convolutional Network (PGCN). PGCN constructs a set of graphs by progressively adapting to input data during the training and the testing phases. Specifically, we implemented the model to construct progressive adjace",
    "path": "papers/22/02/2202.08982.json",
    "total_tokens": 876,
    "translated_title": "PGCN：用于时空交通预测的渐进图卷积网络",
    "translated_abstract": "交通网络中复杂的时空相关性使得交通预测问题具有挑战性。由于交通系统本质上具有图结构，因此已经进行了大量关于图神经网络的研究。最近，构建适应性图对数据进行预测在单一静态图结构上的模型上显示了有希望的结果。然而，图适应性仅在训练阶段应用，并不反映训练阶段使用的数据。这种缺点在交通预测中可能有问题，因为交通数据常常存在时间序列中的意外变化和不规则性。在本研究中，我们提出了一种新的交通预测框架，称为渐进图卷积网络（PGCN）。PGCN通过在训练和测试阶段逐步适应输入数据来构建一组图。具体而言，我们实现了该模型来构建渐进行的邻接矩阵。",
    "tldr": "这项研究提出了一种名为渐进图卷积网络（PGCN）的交通预测框架，通过在训练和测试阶段逐步适应输入数据来构建一组图，以解决交通预测中的复杂时空相关性和数据变化问题。",
    "en_tdlr": "This study proposes a traffic forecasting framework called Progressive Graph Convolutional Network (PGCN) which constructs a set of graphs by progressively adapting to input data during the training and testing phases, addressing the complex spatial-temporal correlations and data changes in traffic forecasting."
}