{
    "title": "Continuous permanent unobserved heterogeneity in dynamic discrete choice models. (arXiv:2202.03960v2 [econ.EM] UPDATED)",
    "abstract": "In dynamic discrete choice (DDC) analysis, it is common to use mixture models to control for unobserved heterogeneity. However, consistent estimation typically requires both restrictions on the support of unobserved heterogeneity and a high-level injectivity condition that is difficult to verify. This paper provides primitive conditions for point identification of a broad class of DDC models with multivariate continuous permanent unobserved heterogeneity. The results apply to both finite- and infinite-horizon DDC models, do not require a full support assumption, nor a long panel, and place no parametric restriction on the distribution of unobserved heterogeneity. In addition, I propose a seminonparametric estimator that is computationally attractive and can be implemented using familiar parametric methods.",
    "link": "http://arxiv.org/abs/2202.03960",
    "context": "Title: Continuous permanent unobserved heterogeneity in dynamic discrete choice models. (arXiv:2202.03960v2 [econ.EM] UPDATED)\nAbstract: In dynamic discrete choice (DDC) analysis, it is common to use mixture models to control for unobserved heterogeneity. However, consistent estimation typically requires both restrictions on the support of unobserved heterogeneity and a high-level injectivity condition that is difficult to verify. This paper provides primitive conditions for point identification of a broad class of DDC models with multivariate continuous permanent unobserved heterogeneity. The results apply to both finite- and infinite-horizon DDC models, do not require a full support assumption, nor a long panel, and place no parametric restriction on the distribution of unobserved heterogeneity. In addition, I propose a seminonparametric estimator that is computationally attractive and can be implemented using familiar parametric methods.",
    "path": "papers/22/02/2202.03960.json",
    "total_tokens": 787,
    "translated_title": "动态离散选择模型中的连续永久不可观测异质性",
    "translated_abstract": "在动态离散选择（DDC）分析中，常常使用混合模型来控制不可观测的异质性。然而，一致估计通常需要对不可观测异质性的支持进行限制，并且需要难以验证的高级可注入性条件。本文提供了一个广泛的DDC模型类的点识别的原始条件，其中包括了多变量连续永久不可观测异质性。该结果适用于有限期和无限期的DDC模型，不需要完全支持的假设，也不需要长期面板，并且对不可观测异质性的分布没有参数限制。此外，本文提出了一种半非参数估计方法，具有计算吸引力，可以使用熟悉的参数化方法实施。",
    "tldr": "该论文提出了一个新的方法来识别动态离散选择模型中的连续永久不可观测异质性，并提出了一种计算吸引力的半非参数估计方法。",
    "en_tdlr": "This paper presents a new approach to identify continuous permanent unobserved heterogeneity in dynamic discrete choice models and proposes a computationally attractive seminonparametric estimator."
}