{
    "title": "Sion's Minimax Theorem in Geodesic Metric Spaces and a Riemannian Extragradient Algorithm. (arXiv:2202.06950v2 [math.OC] UPDATED)",
    "abstract": "Deciding whether saddle points exist or are approximable for nonconvex-nonconcave problems is usually intractable. This paper takes a step towards understanding a broad class of nonconvex-nonconcave minimax problems that do remain tractable. Specifically, it studies minimax problems over geodesic metric spaces, which provide a vast generalization of the usual convex-concave saddle point problems. The first main result of the paper is a geodesic metric space version of Sion's minimax theorem; we believe our proof is novel and broadly accessible as it relies on the finite intersection property alone. The second main result is a specialization to geodesically complete Riemannian manifolds: here, we devise and analyze the complexity of first-order methods for smooth minimax problems.",
    "link": "http://arxiv.org/abs/2202.06950",
    "context": "Title: Sion's Minimax Theorem in Geodesic Metric Spaces and a Riemannian Extragradient Algorithm. (arXiv:2202.06950v2 [math.OC] UPDATED)\nAbstract: Deciding whether saddle points exist or are approximable for nonconvex-nonconcave problems is usually intractable. This paper takes a step towards understanding a broad class of nonconvex-nonconcave minimax problems that do remain tractable. Specifically, it studies minimax problems over geodesic metric spaces, which provide a vast generalization of the usual convex-concave saddle point problems. The first main result of the paper is a geodesic metric space version of Sion's minimax theorem; we believe our proof is novel and broadly accessible as it relies on the finite intersection property alone. The second main result is a specialization to geodesically complete Riemannian manifolds: here, we devise and analyze the complexity of first-order methods for smooth minimax problems.",
    "path": "papers/22/02/2202.06950.json",
    "total_tokens": 872,
    "translated_title": "在测地度量空间中的Sion极小极大定理和黎曼外推算法",
    "translated_abstract": "判断非凸-非凹问题是否存在鞍点通常是难以处理的。该论文向理解一类保持可处理的非凸-非凹极小极大问题迈出了一步。具体而言，它研究了测地度量空间上的极小极大问题，这提供了通常的凸-凹鞍点问题的广泛推广。论文的第一个主要结果是Sion极小极大定理的测地度量空间版本; 我们认为我们的证明是新颖且广泛可用的，因为它仅基于有限交叉性质。第二个主要结果是针对完整测地黎曼流形的专业化：在这里，我们设计和分析了光滑极小极大问题的一阶方法的复杂性。",
    "tldr": "该论文提出了在测地度量空间中的Sion极小极大定理和黎曼外推算法，在保持问题可处理的同时，为非凸-非凹极小极大问题提供了一个广泛的推广。",
    "en_tdlr": "This paper presents Sion's minimax theorem and a Riemannian extragradient algorithm in geodesic metric spaces, providing a broad generalization for nonconvex-nonconcave minimax problems while remaining tractable. The results include a novel proof of the geodesic metric space version of Sion's minimax theorem and analysis of the complexity of first-order methods for smooth minimax problems on geodesically complete Riemannian manifolds."
}