{
    "title": "Robust Hybrid Learning With Expert Augmentation. (arXiv:2202.03881v3 [cs.LG] UPDATED)",
    "abstract": "Hybrid modelling reduces the misspecification of expert models by combining them with machine learning (ML) components learned from data. Similarly to many ML algorithms, hybrid model performance guarantees are limited to the training distribution. Leveraging the insight that the expert model is usually valid even outside the training domain, we overcome this limitation by introducing a hybrid data augmentation strategy termed \\textit{expert augmentation}. Based on a probabilistic formalization of hybrid modelling, we demonstrate that expert augmentation, which can be incorporated into existing hybrid systems, improves generalization. We empirically validate the expert augmentation on three controlled experiments modelling dynamical systems with ordinary and partial differential equations. Finally, we assess the potential real-world applicability of expert augmentation on a dataset of a real double pendulum.",
    "link": "http://arxiv.org/abs/2202.03881",
    "context": "Title: Robust Hybrid Learning With Expert Augmentation. (arXiv:2202.03881v3 [cs.LG] UPDATED)\nAbstract: Hybrid modelling reduces the misspecification of expert models by combining them with machine learning (ML) components learned from data. Similarly to many ML algorithms, hybrid model performance guarantees are limited to the training distribution. Leveraging the insight that the expert model is usually valid even outside the training domain, we overcome this limitation by introducing a hybrid data augmentation strategy termed \\textit{expert augmentation}. Based on a probabilistic formalization of hybrid modelling, we demonstrate that expert augmentation, which can be incorporated into existing hybrid systems, improves generalization. We empirically validate the expert augmentation on three controlled experiments modelling dynamical systems with ordinary and partial differential equations. Finally, we assess the potential real-world applicability of expert augmentation on a dataset of a real double pendulum.",
    "path": "papers/22/02/2202.03881.json",
    "total_tokens": 916,
    "translated_title": "强韧的混合学习：专家增强",
    "translated_abstract": "混合建模通过将专家模型与从数据中学习的机器学习（ML）组件相结合，减少了专家模型的错误建模。与许多机器学习算法类似，混合模型的性能保证仅限于训练分布。利用专家模型通常在训练域外也适用的见解，我们通过引入一种名为专家增强的混合数据增强策略克服了这个限制。基于混合建模的概率形式化，我们证明了可以将专家增强纳入现有的混合系统以提高泛化性能。我们还在三个控制实验中从常微分方程和偏微分方程建模动态系统。最后，我们评估了专家增强在真实双摆数据集上的潜在现实世界应用。",
    "tldr": "该论文介绍了一种名为“专家增强”的混合数据增强策略，可以将其纳入混合系统以提高泛化性能，该方法可以有效克服混合模型性能仅限于训练分布的限制。作者在三个控制实验中从常微分方程和偏微分方程建模动态系统，并在真实双摆数据集上评估了该方法的潜在应用。",
    "en_tdlr": "This paper introduces a hybrid data augmentation strategy called \"expert augmentation\" and incorporates it into existing hybrid systems to improve generalization performance. The method overcomes the limitation that hybrid model performance guarantees are limited to the training distribution by leveraging the insight that the expert model is usually valid even outside the training domain. The authors demonstrate the effectiveness of this approach on three controlled experiments modeling dynamical systems with ordinary and partial differential equations, and assess its potential real-world applicability on a dataset of a real double pendulum."
}