{
    "title": "Fundamental Limits for Sensor-Based Robot Control. (arXiv:2202.00129v5 [cs.RO] UPDATED)",
    "abstract": "Our goal is to develop theory and algorithms for establishing fundamental limits on performance imposed by a robot's sensors for a given task. In order to achieve this, we define a quantity that captures the amount of task-relevant information provided by a sensor. Using a novel version of the generalized Fano inequality from information theory, we demonstrate that this quantity provides an upper bound on the highest achievable expected reward for one-step decision making tasks. We then extend this bound to multi-step problems via a dynamic programming approach. We present algorithms for numerically computing the resulting bounds, and demonstrate our approach on three examples: (i) the lava problem from the literature on partially observable Markov decision processes, (ii) an example with continuous state and observation spaces corresponding to a robot catching a freely-falling object, and (iii) obstacle avoidance using a depth sensor with non-Gaussian noise. We demonstrate the ability",
    "link": "http://arxiv.org/abs/2202.00129",
    "context": "Title: Fundamental Limits for Sensor-Based Robot Control. (arXiv:2202.00129v5 [cs.RO] UPDATED)\nAbstract: Our goal is to develop theory and algorithms for establishing fundamental limits on performance imposed by a robot's sensors for a given task. In order to achieve this, we define a quantity that captures the amount of task-relevant information provided by a sensor. Using a novel version of the generalized Fano inequality from information theory, we demonstrate that this quantity provides an upper bound on the highest achievable expected reward for one-step decision making tasks. We then extend this bound to multi-step problems via a dynamic programming approach. We present algorithms for numerically computing the resulting bounds, and demonstrate our approach on three examples: (i) the lava problem from the literature on partially observable Markov decision processes, (ii) an example with continuous state and observation spaces corresponding to a robot catching a freely-falling object, and (iii) obstacle avoidance using a depth sensor with non-Gaussian noise. We demonstrate the ability",
    "path": "papers/22/02/2202.00129.json",
    "total_tokens": 1005,
    "translated_title": "基于传感器的机器人控制的基本限制",
    "translated_abstract": "我们的目标是为给定任务建立机器人传感器性能的基本限制的理论和算法。为了实现这一目标，我们定义了一个捕捉传感器提供的与任务相关信息数量的量。利用信息论中广义Fano不等式的新颖版本，我们证明了这个量提供了一步决策任务的最高可实现预期报酬的上界。然后，我们通过动态规划方法将这个上界扩展到多步问题。我们提出了用于数值计算得出的上界的算法，并在三个示例上演示了我们的方法：（i）来自部分可观察性马尔可夫决策过程文献的熔岩问题，（ii）具有连续状态和观测空间的示例，对应于机器人接住自由落体物体的问题，以及（iii）使用非高斯噪声深度传感器的避障问题。我们展示了算法的能力",
    "tldr": "该论文提出了一个新的方法，利用信息论和动态规划技术，为基于传感器的机器人控制建立了性能的基本限制。通过计算任务相关信息的数量，可以获得一步决策任务的最高可实现预期报酬的上界，并通过动态规划将这个上界扩展到多步问题。实验证明了该方法在三个示例上的有效性，包括部分可观察性决策过程、自由落体物体的捕捉和使用深度传感器的避障问题。"
}