{
    "title": "Graph Neural Networks for Graphs with Heterophily: A Survey",
    "abstract": "arXiv:2202.07082v2 Announce Type: replace  Abstract: Recent years have witnessed fast developments of graph neural networks (GNNs) that have benefited myriads of graph analytic tasks and applications. In general, most GNNs depend on the homophily assumption that nodes belonging to the same class are more likely to be connected. However, as a ubiquitous graph property in numerous real-world scenarios, heterophily, i.e., nodes with different labels tend to be linked, significantly limits the performance of tailor-made homophilic GNNs. Hence, GNNs for heterophilic graphs are gaining increasing research attention to enhance graph learning with heterophily. In this paper, we provide a comprehensive review of GNNs for heterophilic graphs. Specifically, we propose a systematic taxonomy that essentially governs existing heterophilic GNN models, along with a general summary and detailed analysis. %Furthermore, we summarize the mainstream heterophilic graph benchmarks to facilitate robust and fa",
    "link": "https://arxiv.org/abs/2202.07082",
    "context": "Title: Graph Neural Networks for Graphs with Heterophily: A Survey\nAbstract: arXiv:2202.07082v2 Announce Type: replace  Abstract: Recent years have witnessed fast developments of graph neural networks (GNNs) that have benefited myriads of graph analytic tasks and applications. In general, most GNNs depend on the homophily assumption that nodes belonging to the same class are more likely to be connected. However, as a ubiquitous graph property in numerous real-world scenarios, heterophily, i.e., nodes with different labels tend to be linked, significantly limits the performance of tailor-made homophilic GNNs. Hence, GNNs for heterophilic graphs are gaining increasing research attention to enhance graph learning with heterophily. In this paper, we provide a comprehensive review of GNNs for heterophilic graphs. Specifically, we propose a systematic taxonomy that essentially governs existing heterophilic GNN models, along with a general summary and detailed analysis. %Furthermore, we summarize the mainstream heterophilic graph benchmarks to facilitate robust and fa",
    "path": "papers/22/02/2202.07082.json",
    "total_tokens": 822,
    "translated_title": "具有异质性的图神经网络：一项调查",
    "translated_abstract": "近年来，图神经网络（GNNs）的快速发展使得许多图分析任务和应用受益。大多数GNNs通常依赖于同质性假设，即属于同一类别的节点更可能相连。然而，在许多真实场景中，作为一种普遍的图属性，即不同标签的节点往往相连，这显著限制了定制的同质性GNNs的性能。因此，针对异质性图的GNNs正受到越来越多的研究关注，以增强对具有异质性的图学习。本文针对具有异质性的图提供了全面的GNNs回顾。具体来说，我们提出了一个系统性分类法，本质上指导着现有的异质性GNN模型，以及一个概括性摘要和详细分析。",
    "tldr": "该论文提出了对具有异质性的图进行图神经网络研究的系统回顾，并提出了系统性分类法以指导现有异质性GNN模型。",
    "en_tdlr": "This paper presents a systematic review of graph neural network research on graphs with heterophily and proposes a systematic taxonomy to guide existing heterophilic GNN models."
}