{
    "title": "Market-Based Price Autocorrelation",
    "abstract": "arXiv:2202.09323v2 Announce Type: replace  Abstract: This paper assumes that the randomness of market trade values and volumes determines the properties of stochastic market prices. We derive the direct dependence of the first two price statistical moments and price volatility on statistical moments, volatilities, and correlations of market trade values and volumes. That helps describe the dependence of market-based price autocorrelation between times t and t-{\\tau} on statistical moments and correlations between trade values and volumes. That highlights the impact of the randomness of the size of market deals on price statistical moments and autocorrelation. Statistical moments and correlations of market trade values and volumes are assessed by conventional frequency-based probabilities. The distinctions between market-based price autocorrelation and autocorrelation that are assessed by the frequency-based probability analysis of price time series reveal the different approaches to th",
    "link": "https://arxiv.org/abs/2202.09323",
    "context": "Title: Market-Based Price Autocorrelation\nAbstract: arXiv:2202.09323v2 Announce Type: replace  Abstract: This paper assumes that the randomness of market trade values and volumes determines the properties of stochastic market prices. We derive the direct dependence of the first two price statistical moments and price volatility on statistical moments, volatilities, and correlations of market trade values and volumes. That helps describe the dependence of market-based price autocorrelation between times t and t-{\\tau} on statistical moments and correlations between trade values and volumes. That highlights the impact of the randomness of the size of market deals on price statistical moments and autocorrelation. Statistical moments and correlations of market trade values and volumes are assessed by conventional frequency-based probabilities. The distinctions between market-based price autocorrelation and autocorrelation that are assessed by the frequency-based probability analysis of price time series reveal the different approaches to th",
    "path": "papers/22/02/2202.09323.json",
    "total_tokens": 794,
    "translated_title": "基于市场的价格自相关性",
    "translated_abstract": "本文假设市场交易价值和成交量的随机性决定了随机市场价格的属性。我们推导了第一和第二价格统计时刻以及价格波动率对市场交易价值和成交量的统计时刻、波动率以及相关性的直接依赖关系。这有助于描述基于市场的价格在t时刻和t-{\\tau}时刻之间的自相关性依赖于交易价值和成交量之间的统计时刻和相关性。这突显了市场交易规模的随机性对价格统计时刻和自相关性的影响。市场交易价值和成交量的统计时刻和相关性是通过传统基于频率的概率评估的。基于市场的价格自相关性和通过价格时间序列的基于频率概率分析评估的自相关性之间的区别揭示了对市场自相关性的不同方法。",
    "tldr": "本文探讨了基于市场的价格自相关性，发现市场交易价值和成交量的随机性对价格的统计时刻和自相关性有影响，并提出了新的评估方法。",
    "en_tdlr": "This paper investigates market-based price autocorrelation, revealing the influence of randomness in market trade values and volumes on price statistical moments and autocorrelation, and proposes new assessment methods."
}