{
    "title": "JAMES: Normalizing Job Titles with Multi-Aspect Graph Embeddings and Reasoning. (arXiv:2202.10739v2 [cs.AI] UPDATED)",
    "abstract": "In online job marketplaces, it is important to establish a well-defined job title taxonomy for various downstream tasks (e.g., job recommendation, users' career analysis, and turnover prediction). Job Title Normalization (JTN) is such a cleaning step to classify user-created non-standard job titles into normalized ones. However, solving the JTN problem is non-trivial with challenges: (1) semantic similarity of different job titles, (2) non-normalized user-created job titles, and (3) large-scale and long-tailed job titles in real-world applications. To this end, we propose a novel solution, named JAMES, that constructs three unique embeddings (i.e., graph, contextual, and syntactic) of a target job title to effectively capture its various traits. We further propose a multi-aspect co-attention mechanism to attentively combine these embeddings, and employ neural logical reasoning representations to collaboratively estimate similarities between messy job titles and normalized job titles in",
    "link": "http://arxiv.org/abs/2202.10739",
    "context": "Title: JAMES: Normalizing Job Titles with Multi-Aspect Graph Embeddings and Reasoning. (arXiv:2202.10739v2 [cs.AI] UPDATED)\nAbstract: In online job marketplaces, it is important to establish a well-defined job title taxonomy for various downstream tasks (e.g., job recommendation, users' career analysis, and turnover prediction). Job Title Normalization (JTN) is such a cleaning step to classify user-created non-standard job titles into normalized ones. However, solving the JTN problem is non-trivial with challenges: (1) semantic similarity of different job titles, (2) non-normalized user-created job titles, and (3) large-scale and long-tailed job titles in real-world applications. To this end, we propose a novel solution, named JAMES, that constructs three unique embeddings (i.e., graph, contextual, and syntactic) of a target job title to effectively capture its various traits. We further propose a multi-aspect co-attention mechanism to attentively combine these embeddings, and employ neural logical reasoning representations to collaboratively estimate similarities between messy job titles and normalized job titles in",
    "path": "papers/22/02/2202.10739.json",
    "total_tokens": 1047,
    "translated_title": "JAMES: 基于多方面图嵌入和推理的岗位职称规范化",
    "translated_abstract": "在在线职位市场中，建立一个明确定义的岗位职称分类体系对于各种下游任务（如工作推荐、用户职业分析和离职预测）至关重要。岗位职称规范化是将用户创建的非标准岗位职称分类为规范化职称的一个清洁步骤。然而，解决岗位职称规范化问题并不容易，面临着以下挑战：(1)不同岗位职称的语义相似性，(2)非规范化的用户创建的岗位职称，以及(3)实际应用中大规模和长尾分布的岗位职称。为了解决这个问题，我们提出了一种名为JAMES的新颖解决方案，它构建目标岗位职称的三种独特嵌入（即图、上下文和句法），以有效捕捉其各种特征。我们进一步提出了一种多方面协同注意机制来注意地结合这些嵌入，还使用神经逻辑推理表示共同估计混乱的岗位职称与规范化岗位职称之间的相似性。",
    "tldr": "JAMES是一个用于岗位职称规范化的解决方案，它通过构建三种独特嵌入和使用协同注意机制和神经逻辑推理表示来有效地捕捉岗位职称的各种特征，并解决了语义相似性、非规范化用户创建的职称以及实际应用中大规模和长尾分布的岗位职称等挑战。",
    "en_tdlr": "JAMES is a solution for job title normalization that effectively captures various traits of job titles by constructing three unique embeddings, using a multi-aspect co-attention mechanism and neural logical reasoning representations, and solves challenges such as semantic similarity, non-normalized user-created job titles, and large-scale and long-tailed job titles in real-world applications."
}