{
    "title": "STG-GAN: A spatiotemporal graph generative adversarial networks for short-term passenger flow prediction in urban rail transit systems. (arXiv:2202.06727v3 [cs.LG] UPDATED)",
    "abstract": "Short-term passenger flow prediction is an important but challenging task for better managing urban rail transit (URT) systems. Some emerging deep learning models provide good insights to improve short-term prediction accuracy. However, there exist many complex spatiotemporal dependencies in URT systems. Most previous methods only consider the absolute error between ground truth and predictions as the optimization objective, which fails to account for spatial and temporal constraints on the predictions. Furthermore, a large number of existing prediction models introduce complex neural network layers to improve accuracy while ignoring their training efficiency and memory occupancy, decreasing the chances to be applied to the real world. To overcome these limitations, we propose a novel deep learning-based spatiotemporal graph generative adversarial network (STG-GAN) model with higher prediction accuracy, higher efficiency, and lower memory occupancy to predict short-term passenger flows",
    "link": "http://arxiv.org/abs/2202.06727",
    "context": "Title: STG-GAN: A spatiotemporal graph generative adversarial networks for short-term passenger flow prediction in urban rail transit systems. (arXiv:2202.06727v3 [cs.LG] UPDATED)\nAbstract: Short-term passenger flow prediction is an important but challenging task for better managing urban rail transit (URT) systems. Some emerging deep learning models provide good insights to improve short-term prediction accuracy. However, there exist many complex spatiotemporal dependencies in URT systems. Most previous methods only consider the absolute error between ground truth and predictions as the optimization objective, which fails to account for spatial and temporal constraints on the predictions. Furthermore, a large number of existing prediction models introduce complex neural network layers to improve accuracy while ignoring their training efficiency and memory occupancy, decreasing the chances to be applied to the real world. To overcome these limitations, we propose a novel deep learning-based spatiotemporal graph generative adversarial network (STG-GAN) model with higher prediction accuracy, higher efficiency, and lower memory occupancy to predict short-term passenger flows",
    "path": "papers/22/02/2202.06727.json",
    "total_tokens": 898,
    "translated_title": "STG-GAN：一种用于城市轨道交通系统短期客流预测的时空图生成对抗网络",
    "translated_abstract": "短期客流预测是更好管理城市轨道交通系统的重要且具有挑战性的任务。一些新兴的深度学习模型为改善短期预测准确性提供了有益的见解。然而，在城市轨道交通系统中存在许多复杂的时空依赖关系。大多数先前的方法只将真实值和预测值之间的绝对误差作为优化目标，未能考虑到对预测的空间和时间约束。此外，许多现有的预测模型引入了复杂的神经网络层以提高准确性，但忽视了它们的训练效率和内存占用，降低了在现实世界中应用的机会。为了克服这些限制，我们提出了一种新颖的基于深度学习的时空图生成对抗网络（STG-GAN）模型，具有更高的预测准确性、更高的效率和更低的内存占用，用于预测短期客流。",
    "tldr": "STG-GAN提出了一种基于深度学习的时空图生成对抗网络，用于解决短期客流预测的准确性、效率和内存占用问题。",
    "en_tdlr": "STG-GAN proposes a deep learning-based spatiotemporal graph generative adversarial network to address the issues of accuracy, efficiency, and memory occupancy in short-term passenger flow prediction."
}