{
    "title": "Single-Leg Revenue Management with Advice. (arXiv:2202.10939v3 [cs.GT] UPDATED)",
    "abstract": "Single-leg revenue management is a foundational problem of revenue management that has been particularly impactful in the airline and hotel industry: Given $n$ units of a resource, e.g. flight seats, and a stream of sequentially-arriving customers segmented by fares, what is the optimal online policy for allocating the resource. Previous work focused on designing algorithms when forecasts are available, which are not robust to inaccuracies in the forecast, or online algorithms with worst-case performance guarantees, which can be too conservative in practice. In this work, we look at the single-leg revenue management problem through the lens of the algorithms-with-advice framework, which attempts to harness the increasing prediction accuracy of machine learning methods by optimally incorporating advice about the future into online algorithms. In particular, we characterize the Pareto frontier that captures the tradeoff between consistency (performance when advice is accurate) and compet",
    "link": "http://arxiv.org/abs/2202.10939",
    "context": "Title: Single-Leg Revenue Management with Advice. (arXiv:2202.10939v3 [cs.GT] UPDATED)\nAbstract: Single-leg revenue management is a foundational problem of revenue management that has been particularly impactful in the airline and hotel industry: Given $n$ units of a resource, e.g. flight seats, and a stream of sequentially-arriving customers segmented by fares, what is the optimal online policy for allocating the resource. Previous work focused on designing algorithms when forecasts are available, which are not robust to inaccuracies in the forecast, or online algorithms with worst-case performance guarantees, which can be too conservative in practice. In this work, we look at the single-leg revenue management problem through the lens of the algorithms-with-advice framework, which attempts to harness the increasing prediction accuracy of machine learning methods by optimally incorporating advice about the future into online algorithms. In particular, we characterize the Pareto frontier that captures the tradeoff between consistency (performance when advice is accurate) and compet",
    "path": "papers/22/02/2202.10939.json",
    "total_tokens": 984,
    "translated_title": "单程收益管理中考虑建议的优化分配问题",
    "translated_abstract": "单程收益管理是收益管理中的基础问题，特别是在航空和酒店行业有着很大的影响：给定$n$个资源单位，例如航班座位，并且顺序到达的客户根据不同价格分段，我们需要确定这个资源的最优在线分配策略。以前的研究聚焦于设计当预测可用时的算法，但是这种算法对于预测的不准确性并不稳健，或者是在线算法以保证最差性能，然而这样实践中可能过于保守，本文通过算法建议框架，旨在通过最佳地整合有关未来的建议进入在线算法中，试图利用机器学习方法日益增加的预测准确性解决单程收益管理问题。具体地，我们表征了捕获一致性（建议准确时的性能）和竞争比率（建议不准确时的性能）之间的权衡的帕累托前沿。我们分析了几种自然算法和基于神经网络的策略在此问题的实例上的性能，并观察到帕累托最优方法可以有效平衡这两个目标。",
    "tldr": "本文提出了一种算法建议框架解决了单程收益管理问题，试图应用机器学习方法的预测准确性并平衡准确性和不准确性的竞争比率。",
    "en_tdlr": "This paper proposes an algorithms-with-advice framework to address the single-leg revenue management problem, aiming to utilize the increasingly prediction accuracy of machine learning methods and balance the competition ratio between accuracy and inaccuracy, and characterizes the Pareto frontier for this tradeoff."
}