{
    "title": "On The Effectiveness of One-Class Support Vector Machine in Different Defect Prediction Scenarios",
    "abstract": "arXiv:2202.12074v2 Announce Type: replace-cross  Abstract: Defect prediction aims at identifying software components that are likely to cause faults before a software is made available to the end-user. To date, this task has been modeled as a two-class classification problem, however its nature also allows it to be formulated as a one-class classification task. Previous studies show that One-Class Support Vector Machine (OCSVM) can outperform two-class classifiers for within-project defect prediction, however it is not effective when employed at a finer granularity (i.e., commit-level defect prediction). In this paper, we further investigate whether learning from one class only is sufficient to produce effective defect prediction model in two other different scenarios (i.e., granularity), namely cross-version and cross-project defect prediction models, as well as replicate the previous work at within-project granularity for completeness. Our empirical results confirm that OCSVM perform",
    "link": "https://arxiv.org/abs/2202.12074",
    "context": "Title: On The Effectiveness of One-Class Support Vector Machine in Different Defect Prediction Scenarios\nAbstract: arXiv:2202.12074v2 Announce Type: replace-cross  Abstract: Defect prediction aims at identifying software components that are likely to cause faults before a software is made available to the end-user. To date, this task has been modeled as a two-class classification problem, however its nature also allows it to be formulated as a one-class classification task. Previous studies show that One-Class Support Vector Machine (OCSVM) can outperform two-class classifiers for within-project defect prediction, however it is not effective when employed at a finer granularity (i.e., commit-level defect prediction). In this paper, we further investigate whether learning from one class only is sufficient to produce effective defect prediction model in two other different scenarios (i.e., granularity), namely cross-version and cross-project defect prediction models, as well as replicate the previous work at within-project granularity for completeness. Our empirical results confirm that OCSVM perform",
    "path": "papers/22/02/2202.12074.json",
    "total_tokens": 832,
    "translated_title": "对于一类支持向量机在不同缺陷预测场景中的有效性研究",
    "translated_abstract": "缺陷预测旨在识别在软件提供给最终用户之前可能引起故障的软件组件。迄今为止，这一任务被建模为一个双类别分类问题，然而其本质也允许将其构建为一个一类分类任务。先前的研究表明，一类支持向量机（OCSVM）在项目内缺陷预测方面可以胜过双类别分类器，然而当应用于更细粒度的情况（即基于提交级别的缺陷预测）时并不有效。在本文中，我们进一步研究仅从一类进行学习是否足以生成在两种其他不同场景（即粒度）中产生有效缺陷预测模型，即跨版本和跨项目缺陷预测模型，并为了完整性复制在项目内粒度的先前工作。我们的实证结果证实了OCSVM的表现",
    "tldr": "本文研究了一类支持向量机在不同缺陷预测场景中的有效性，并发现其在跨版本和跨项目的缺陷预测模型中表现出色。",
    "en_tdlr": "This paper investigates the effectiveness of One-Class Support Vector Machine in different defect prediction scenarios and finds that it performs well in cross-version and cross-project defect prediction models."
}