{
    "title": "AugESC: Dialogue Augmentation with Large Language Models for Emotional Support Conversation. (arXiv:2202.13047v2 [cs.CL] UPDATED)",
    "abstract": "Crowdsourced dialogue corpora are usually limited in scale and topic coverage due to the expensive cost of data curation. This would hinder the generalization of downstream dialogue models to open-domain topics. In this work, we leverage large language models for dialogue augmentation in the task of emotional support conversation (ESC). By treating dialogue augmentation as a dialogue completion task, we prompt a fine-tuned language model to complete full dialogues from available dialogue posts of various topics, which are then postprocessed based on heuristics. Applying this approach, we construct AugESC, an augmented dataset for the ESC task, which largely extends the scale and topic coverage of the crowdsourced ESConv corpus. Through comprehensive human evaluation, we demonstrate that our approach is superior to strong baselines of dialogue augmentation and that AugESC has comparable dialogue quality to the crowdsourced corpus. We also conduct human interactive evaluation and prove t",
    "link": "http://arxiv.org/abs/2202.13047",
    "context": "Title: AugESC: Dialogue Augmentation with Large Language Models for Emotional Support Conversation. (arXiv:2202.13047v2 [cs.CL] UPDATED)\nAbstract: Crowdsourced dialogue corpora are usually limited in scale and topic coverage due to the expensive cost of data curation. This would hinder the generalization of downstream dialogue models to open-domain topics. In this work, we leverage large language models for dialogue augmentation in the task of emotional support conversation (ESC). By treating dialogue augmentation as a dialogue completion task, we prompt a fine-tuned language model to complete full dialogues from available dialogue posts of various topics, which are then postprocessed based on heuristics. Applying this approach, we construct AugESC, an augmented dataset for the ESC task, which largely extends the scale and topic coverage of the crowdsourced ESConv corpus. Through comprehensive human evaluation, we demonstrate that our approach is superior to strong baselines of dialogue augmentation and that AugESC has comparable dialogue quality to the crowdsourced corpus. We also conduct human interactive evaluation and prove t",
    "path": "papers/22/02/2202.13047.json",
    "total_tokens": 952,
    "translated_abstract": "由于数据筛查的高昂成本，众包式的对话语料库通常在规模和主题覆盖范围上受到限制。这将阻碍下游对话模型对开放领域主题的概括。在本研究中，我们利用大型语言模型在情感支持会话（ESC）任务中完成对话增强。将对话增强视为一种对话完成任务，我们会提示微调的语言模型根据各种主题的可用对话帖子完成完整的对话，然后根据启发式方法进行后处理。通过这种方法，我们构建了AugESC，这是一个增强的ESC数据集，极大地扩展了众包式ESConv语料库的规模和主题覆盖范围。通过全面的人工评估，我们证明了我们的方法优于对话增强的强基线，并且AugESC的对话质量与众包式语料库相当。我们还进行了人际互动评估，并证明了AugESC在模拟人类与情感支持探讨机器人的对话方面。",
    "tldr": "本论文介绍了一种对话增强算法，使用大型语言模型对情感支持会话进行增强，构建了规模更大且主题覆盖范围更广的数据集AugESC，并且证明了该方法优于强基线，并且AugESC的对话质量与众包式语料库相当。",
    "en_tdlr": "The paper presents an algorithm for dialogue augmentation using large language models for emotional support conversation, which leads to the creation of a larger and more diverse dataset called AugESC. The approach is proven to be superior to strong baselines and comparable in dialogue quality to crowdsourced corpora through comprehensive human evaluation."
}