{
    "title": "Recovering Unbalanced Communities in the Stochastic Block Model With Application to Clustering with a Faulty Oracle. (arXiv:2202.08522v3 [cs.LG] UPDATED)",
    "abstract": "The stochastic block model (SBM) is a fundamental model for studying graph clustering or community detection in networks. It has received great attention in the last decade and the balanced case, i.e., assuming all clusters have large size, has been well studied. However, our understanding of SBM with unbalanced communities (arguably, more relevant in practice) is still limited. In this paper, we provide a simple SVD-based algorithm for recovering the communities in the SBM with communities of varying sizes. We improve upon a result of Ailon, Chen and Xu [ICML 2013; JMLR 2015] by removing the assumption that there is a large interval such that the sizes of clusters do not fall in, and also remove the dependency of the size of the recoverable clusters on the number of underlying clusters. We further complement our theoretical improvements with experimental comparisons. Under the planted clique conjecture, the size of the clusters that can be recovered by our algorithm is nearly optimal ",
    "link": "http://arxiv.org/abs/2202.08522",
    "context": "Title: Recovering Unbalanced Communities in the Stochastic Block Model With Application to Clustering with a Faulty Oracle. (arXiv:2202.08522v3 [cs.LG] UPDATED)\nAbstract: The stochastic block model (SBM) is a fundamental model for studying graph clustering or community detection in networks. It has received great attention in the last decade and the balanced case, i.e., assuming all clusters have large size, has been well studied. However, our understanding of SBM with unbalanced communities (arguably, more relevant in practice) is still limited. In this paper, we provide a simple SVD-based algorithm for recovering the communities in the SBM with communities of varying sizes. We improve upon a result of Ailon, Chen and Xu [ICML 2013; JMLR 2015] by removing the assumption that there is a large interval such that the sizes of clusters do not fall in, and also remove the dependency of the size of the recoverable clusters on the number of underlying clusters. We further complement our theoretical improvements with experimental comparisons. Under the planted clique conjecture, the size of the clusters that can be recovered by our algorithm is nearly optimal ",
    "path": "papers/22/02/2202.08522.json",
    "total_tokens": 1005,
    "translated_title": "用于故障参照的随机块模型中的非平衡社区恢复",
    "translated_abstract": "随机块模型（SBM）是研究网络中图聚类或社区检测的基础模型。过去十年中，它受到了广泛关注，对于平衡情况，即假设所有社区都具有较大的大小，已经进行了深入研究。然而，对于具有非平衡社区的SBM（在实践中更相关），我们对其理解仍然有限。在本文中，我们提供了一种基于奇异值分解（SVD）的简单算法，用于恢复具有不同大小的社区的SBM。我们改进了Ailon，Chen和Xu在ICML 2013和JMLR 2015的结果，消除了存在一个较大区间使得聚类的大小不在其内的假设，并且消除了可恢复聚类的大小与基础聚类数目的依赖关系。我们进一步通过实验比较来补充我们的理论改进。在种植的团簇猜想下，我们的算法可以恢复的聚类大小几乎是最优的。",
    "tldr": "本文在随机块模型中提出了一种用于恢复不同大小社区的简单算法，并改进了先前研究的结果，使得可以恢复的聚类大小与基础聚类数目无关。在实验中进行了验证，结果表明算法在种植的团簇猜想下实现了几乎最优的聚类恢复效果。",
    "en_tdlr": "This paper presents a simple algorithm for recovering communities of varying sizes in the stochastic block model (SBM) and improves upon previous results by removing the dependency of the recoverable cluster sizes on the number of underlying clusters. Experimental comparisons confirm the nearly optimal clustering recovery performance of the algorithm under the planted clique conjecture."
}