{
    "title": "Strategy Synthesis for Zero-Sum Neuro-Symbolic Concurrent Stochastic Games. (arXiv:2202.06255v5 [cs.AI] UPDATED)",
    "abstract": "Neuro-symbolic approaches to artificial intelligence, which combine neural networks with classical symbolic techniques, are growing in prominence, necessitating formal approaches to reason about their correctness. We propose a novel modelling formalism called neuro-symbolic concurrent stochastic games (NS-CSGs), which comprise probabilistic finite-state agents interacting in a shared continuous-state environment observed through perception mechanisms implemented as neural networks (NNs). We focus on the class of NS-CSGs with Borel state spaces and prove the existence and measurability of the value function for zero-sum discounted cumulative rewards under piecewise-constant restrictions on the components of this class of models. To compute values and synthesise strategies, we present, for the first time, implementable value iteration (VI) and policy iteration (PI) algorithms to solve a class of continuous-state CSGs. These require a finite representation of the pre-image of the environm",
    "link": "http://arxiv.org/abs/2202.06255",
    "context": "Title: Strategy Synthesis for Zero-Sum Neuro-Symbolic Concurrent Stochastic Games. (arXiv:2202.06255v5 [cs.AI] UPDATED)\nAbstract: Neuro-symbolic approaches to artificial intelligence, which combine neural networks with classical symbolic techniques, are growing in prominence, necessitating formal approaches to reason about their correctness. We propose a novel modelling formalism called neuro-symbolic concurrent stochastic games (NS-CSGs), which comprise probabilistic finite-state agents interacting in a shared continuous-state environment observed through perception mechanisms implemented as neural networks (NNs). We focus on the class of NS-CSGs with Borel state spaces and prove the existence and measurability of the value function for zero-sum discounted cumulative rewards under piecewise-constant restrictions on the components of this class of models. To compute values and synthesise strategies, we present, for the first time, implementable value iteration (VI) and policy iteration (PI) algorithms to solve a class of continuous-state CSGs. These require a finite representation of the pre-image of the environm",
    "path": "papers/22/02/2202.06255.json",
    "total_tokens": 1056,
    "translated_title": "零和神经符号并发随机博弈的策略合成",
    "translated_abstract": "结合神经网络和经典符号技术的神经符号人工智能方法越来越受到关注，需要正式的方法来推理其正确性。本文提出了一种新型的建模形式，称为神经符号并发随机博弈（NS-CSG），由在通过神经网络实现的感知机制观察到的共享连续状态环境中相互作用的概率有限状态代理组成。我们专注于具有 Borel 状态空间的 NS-CSG 类，证明了在对这类模型的组件施加分段常数限制的情况下，零和折扣累积回报的价值函数的存在性和可测性。为了计算值和合成策略，我们首次提出可实施的值迭代（VI）和策略迭代（PI）算法来解决类连续状态 CSG问题。这些需要对动力学下的环境的前像进行有限表示，我们通过测度论的标准技术来构造这个表示。我们证明了我们算法的正确性，并通过基准NS-CSG中的实验证明了它们的有效性。",
    "tldr": "本文提出了神经符号并发随机博弈（NS-CSG）的建模形式，并针对具有 Borel 状态空间的 NS-CSG 类展示了零和折扣累积回报的价值函数的存在性和可测性。首次提出了可实施的值迭代（VI）和策略迭代（PI）算法，证明了算法的正确性，并验证了在基准 NS-CSG 中的有效性。",
    "en_tdlr": "This paper proposes a formalism called neuro-symbolic concurrent stochastic games (NS-CSGs), introduces implementable algorithms to compute values and synthesise strategies for a class of continuous-state CSGs and proves the existence and measurability of the value function for zero-sum discounted cumulative rewards under piecewise-constant restrictions on the components of this class of models. The effectiveness of the algorithms is tested with experiments on benchmark NS-CSGs."
}