{
    "title": "A Proximal Algorithm for Sampling. (arXiv:2202.13975v3 [cs.LG] UPDATED)",
    "abstract": "We study sampling problems associated with potentials that lack smoothness. The potentials can be either convex or non-convex. Departing from the standard smooth setting, the potentials are only assumed to be weakly smooth or non-smooth, or the summation of multiple such functions. We develop a sampling algorithm that resembles proximal algorithms in optimization for this challenging sampling task. Our algorithm is based on a special case of Gibbs sampling known as the alternating sampling framework (ASF). The key contribution of this work is a practical realization of the ASF based on rejection sampling for both non-convex and convex potentials that are not necessarily smooth. In almost all the cases of sampling considered in this work, our proximal sampling algorithm achieves better complexity than all existing methods.",
    "link": "http://arxiv.org/abs/2202.13975",
    "context": "Title: A Proximal Algorithm for Sampling. (arXiv:2202.13975v3 [cs.LG] UPDATED)\nAbstract: We study sampling problems associated with potentials that lack smoothness. The potentials can be either convex or non-convex. Departing from the standard smooth setting, the potentials are only assumed to be weakly smooth or non-smooth, or the summation of multiple such functions. We develop a sampling algorithm that resembles proximal algorithms in optimization for this challenging sampling task. Our algorithm is based on a special case of Gibbs sampling known as the alternating sampling framework (ASF). The key contribution of this work is a practical realization of the ASF based on rejection sampling for both non-convex and convex potentials that are not necessarily smooth. In almost all the cases of sampling considered in this work, our proximal sampling algorithm achieves better complexity than all existing methods.",
    "path": "papers/22/02/2202.13975.json",
    "total_tokens": 847,
    "translated_title": "一种用于采样的近端算法",
    "translated_abstract": "我们研究了与缺乏平滑性的势能相关的采样问题。这些势能可以是凸的或非凸的。不同于标准的平滑设置，这些势能只被认为是弱平滑或非平滑的，或者是多个这样的函数的求和。我们开发了一种采样算法，该算法类似于用于这种具有挑战性的采样任务的优化问题的近端算法。我们的算法基于一种称为交替采样框架（ASF）的Gibbs采样的特殊情况。这项工作的关键贡献是基于拒绝采样的ASF的实际实现，适用于非凸和不一定平滑的凸势能。在本工作考虑的几乎所有采样案例中，我们的近端采样算法的复杂性都优于所有现有方法。",
    "tldr": "本论文提出了一种用于处理缺乏平滑性的势能的采样问题的近端算法，在凸和非凸情况下均可适用。该算法的关键创新点在于基于拒绝采样的交替采样框架的实际实现，比现有方法更高效。",
    "en_tdlr": "This paper proposes a proximal algorithm for sampling problems associated with potentials that lack smoothness. The algorithm achieves better complexity than existing methods by employing a practical realization of the alternating sampling framework based on rejection sampling for both non-convex and convex potentials that are not necessarily smooth."
}