{
    "title": "Laplacian2Mesh: Laplacian-Based Mesh Understanding. (arXiv:2202.00307v2 [cs.CV] UPDATED)",
    "abstract": "Geometric deep learning has sparked a rising interest in computer graphics to perform shape understanding tasks, such as shape classification and semantic segmentation. When the input is a polygonal surface, one has to suffer from the irregular mesh structure. Motivated by the geometric spectral theory, we introduce Laplacian2Mesh, a novel and flexible convolutional neural network (CNN) framework for coping with irregular triangle meshes (vertices may have any valence). By mapping the input mesh surface to the multi-dimensional Laplacian-Beltrami space, Laplacian2Mesh enables one to perform shape analysis tasks directly using the mature CNNs, without the need to deal with the irregular connectivity of the mesh structure. We further define a mesh pooling operation such that the receptive field of the network can be expanded while retaining the original vertex set as well as the connections between them. Besides, we introduce a channel-wise self-attention block to learn the individual im",
    "link": "http://arxiv.org/abs/2202.00307",
    "context": "Title: Laplacian2Mesh: Laplacian-Based Mesh Understanding. (arXiv:2202.00307v2 [cs.CV] UPDATED)\nAbstract: Geometric deep learning has sparked a rising interest in computer graphics to perform shape understanding tasks, such as shape classification and semantic segmentation. When the input is a polygonal surface, one has to suffer from the irregular mesh structure. Motivated by the geometric spectral theory, we introduce Laplacian2Mesh, a novel and flexible convolutional neural network (CNN) framework for coping with irregular triangle meshes (vertices may have any valence). By mapping the input mesh surface to the multi-dimensional Laplacian-Beltrami space, Laplacian2Mesh enables one to perform shape analysis tasks directly using the mature CNNs, without the need to deal with the irregular connectivity of the mesh structure. We further define a mesh pooling operation such that the receptive field of the network can be expanded while retaining the original vertex set as well as the connections between them. Besides, we introduce a channel-wise self-attention block to learn the individual im",
    "path": "papers/22/02/2202.00307.json",
    "total_tokens": 890,
    "translated_title": "Laplacian2Mesh：基于拉普拉斯的网格理解",
    "translated_abstract": "几何深度学习引起了计算机图形学在形状理解任务上的兴趣，如形状分类和语义分割。当输入为多边形表面时，人们必须应对不规则网格结构。受到几何谱理论的启发，我们介绍Laplacian2Mesh，一种新颖且灵活的卷积神经网络（CNN）框架，用于应对不规则的三角形网格（顶点可能具有任何价值）。通过将输入网格表面映射到多维Laplacian-Beltrami空间，Laplacian2Mesh使人们能够直接使用成熟的CNN执行形状分析任务，而无需处理网格结构的不规则连接。我们进一步定义了一个网格汇集操作，以使网络的感受野可以扩展，同时保留原始顶点集以及它们之间的连接。此外，我们引入了一种通道级自我注意块来学习个别特征的相关性，从而有效地提高网络结果。",
    "tldr": "Laplacian2Mesh是一种克服不规则三角形网格结构困难的方法，使用卷积神经网络来直接处理形状分析任务，并具有可扩展的感受野和个别特征学习的机制。",
    "en_tdlr": "Laplacian2Mesh is a method to overcome the difficulty of irregular triangle mesh structures and perform shape analysis tasks directly using convolutional neural networks. It has a scalable receptive field and individual feature learning mechanism."
}