{
    "title": "Social Learning under Platform Influence: Consensus and Persistent Disagreement. (arXiv:2202.12453v2 [econ.TH] UPDATED)",
    "abstract": "Individuals increasingly rely on social networking platforms to form opinions. However, these platforms typically aim to maximize engagement, which may not align with social good. In this paper, we introduce an opinion dynamics model where agents are connected in a social network, and update their opinions based on their neighbors' opinions and on the content shown to them by the platform. We focus on a stochastic block model with two blocks, where the initial opinions of the individuals in different blocks are different. We prove that for large and dense enough networks the trajectory of opinion dynamics in such networks can be approximated well by a simple two-agent system. The latter admits tractable analytical analysis, which we leverage to provide interesting insights into the platform's impact on the social learning outcome in our original two-block model. Specifically, by using our approximation result, we show that agents' opinions approximately converge to some limiting opinio",
    "link": "http://arxiv.org/abs/2202.12453",
    "context": "Title: Social Learning under Platform Influence: Consensus and Persistent Disagreement. (arXiv:2202.12453v2 [econ.TH] UPDATED)\nAbstract: Individuals increasingly rely on social networking platforms to form opinions. However, these platforms typically aim to maximize engagement, which may not align with social good. In this paper, we introduce an opinion dynamics model where agents are connected in a social network, and update their opinions based on their neighbors' opinions and on the content shown to them by the platform. We focus on a stochastic block model with two blocks, where the initial opinions of the individuals in different blocks are different. We prove that for large and dense enough networks the trajectory of opinion dynamics in such networks can be approximated well by a simple two-agent system. The latter admits tractable analytical analysis, which we leverage to provide interesting insights into the platform's impact on the social learning outcome in our original two-block model. Specifically, by using our approximation result, we show that agents' opinions approximately converge to some limiting opinio",
    "path": "papers/22/02/2202.12453.json",
    "total_tokens": 875,
    "translated_title": "社会学习中的平台影响：共识与持久的分歧",
    "translated_abstract": "个体越来越依赖社交网络平台形成意见。然而，这些平台通常旨在最大化参与度，而这可能与社会公益不一致。在本文中，我们引入了一个意见动态模型，其中代理通过社交网络连接，并根据邻居的意见和平台展示给他们的内容来更新他们的意见。我们关注一个带有两个块的随机块模型，在不同块中个体的初始意见不同。我们证明，对于足够大和密集的网络，这种网络中意见动态的轨迹可以很好地近似为一个简单的两个代理系统。后者允许可行的分析分析，我们利用这一结果提供对我们原始的两个块模型中平台对社会学习结果的影响的有趣见解。具体来说，通过使用我们的近似结果，我们展示了代理的意见大致收敛到一些极限意见。",
    "tldr": "本文研究了社交网络平台对社会学习的影响，通过引入意见动态模型和随机块模型，从分析两个代理系统出发，揭示了平台对社会学习结果的重要影响。",
    "en_tdlr": "This paper investigates the impact of social networking platforms on social learning. By introducing an opinion dynamics model and a stochastic block model, the paper reveals the significant influence of the platform on the outcome of social learning, starting from the analysis of a two-agent system."
}