{
    "title": "Supervision by Denoising. (arXiv:2202.02952v2 [eess.IV] UPDATED)",
    "abstract": "Learning-based image reconstruction models, such as those based on the U-Net, require a large set of labeled images if good generalization is to be guaranteed. In some imaging domains, however, labeled data with pixel- or voxel-level label accuracy are scarce due to the cost of acquiring them. This problem is exacerbated further in domains like medical imaging, where there is no single ground truth label, resulting in large amounts of repeat variability in the labels. Therefore, training reconstruction networks to generalize better by learning from both labeled and unlabeled examples (called semi-supervised learning) is problem of practical and theoretical interest. However, traditional semi-supervised learning methods for image reconstruction often necessitate handcrafting a differentiable regularizer specific to some given imaging problem, which can be extremely time-consuming. In this work, we propose \"supervision by denoising\" (SUD), a framework that enables us to supervise reconst",
    "link": "http://arxiv.org/abs/2202.02952",
    "context": "Title: Supervision by Denoising. (arXiv:2202.02952v2 [eess.IV] UPDATED)\nAbstract: Learning-based image reconstruction models, such as those based on the U-Net, require a large set of labeled images if good generalization is to be guaranteed. In some imaging domains, however, labeled data with pixel- or voxel-level label accuracy are scarce due to the cost of acquiring them. This problem is exacerbated further in domains like medical imaging, where there is no single ground truth label, resulting in large amounts of repeat variability in the labels. Therefore, training reconstruction networks to generalize better by learning from both labeled and unlabeled examples (called semi-supervised learning) is problem of practical and theoretical interest. However, traditional semi-supervised learning methods for image reconstruction often necessitate handcrafting a differentiable regularizer specific to some given imaging problem, which can be extremely time-consuming. In this work, we propose \"supervision by denoising\" (SUD), a framework that enables us to supervise reconst",
    "path": "papers/22/02/2202.02952.json",
    "total_tokens": 891,
    "translated_title": "去噪监督。 (arXiv:2202.02952v2 [eess.IV] UPDATED)",
    "translated_abstract": "基于学习的图像重建模型，例如基于 U-Net 的模型，如果要保证良好的泛化性能，则需要大量标记的图像数据。然而，在某些成像领域中，由于获取这些数据的成本，具有像素或体素级别精度的标记数据很少。在医学成像等领域，由于不存在单一的标准标签，标签之间存在大量的重复变异性，因此训练重建网络从带标签和无标签的示例中学习以更好地泛化（称为半监督学习），是一个实践和理论上的问题。 然而，针对图像重建的传统半监督学习方法通常需要手工制作针对某些给定成像问题的可微正则化器，这可能非常耗时。 在这项工作中，我们提出了“去噪监督”（SUD）框架，该框架使我们能够监督重建模型，同时避免手动制作特定于成像领域的可微正则化器。",
    "tldr": "本文提出了一种去噪监督（SUD）框架，可以监督重建模型，并避免制作特定于成像领域的可微正则化器。",
    "en_tdlr": "This paper proposes a \"supervision by denoising\" (SUD) framework that enables supervision of reconstruction networks without the need for a differentiable regularizer specific to a given imaging problem."
}