{
    "title": "Machine Translation from Signed to Spoken Languages: State of the Art and Challenges. (arXiv:2202.03086v4 [cs.CL] UPDATED)",
    "abstract": "Automatic translation from signed to spoken languages is an interdisciplinary research domain, lying on the intersection of computer vision, machine translation and linguistics. Nevertheless, research in this domain is performed mostly by computer scientists in isolation. As the domain is becoming increasingly popular - the majority of scientific papers on the topic of sign language translation have been published in the past three years - we provide an overview of the state of the art as well as some required background in the different related disciplines. We give a high-level introduction to sign language linguistics and machine translation to illustrate the requirements of automatic sign language translation. We present a systematic literature review to illustrate the state of the art in the domain and then, harking back to the requirements, lay out several challenges for future research. We find that significant advances have been made on the shoulders of spoken language machine t",
    "link": "http://arxiv.org/abs/2202.03086",
    "context": "Title: Machine Translation from Signed to Spoken Languages: State of the Art and Challenges. (arXiv:2202.03086v4 [cs.CL] UPDATED)\nAbstract: Automatic translation from signed to spoken languages is an interdisciplinary research domain, lying on the intersection of computer vision, machine translation and linguistics. Nevertheless, research in this domain is performed mostly by computer scientists in isolation. As the domain is becoming increasingly popular - the majority of scientific papers on the topic of sign language translation have been published in the past three years - we provide an overview of the state of the art as well as some required background in the different related disciplines. We give a high-level introduction to sign language linguistics and machine translation to illustrate the requirements of automatic sign language translation. We present a systematic literature review to illustrate the state of the art in the domain and then, harking back to the requirements, lay out several challenges for future research. We find that significant advances have been made on the shoulders of spoken language machine t",
    "path": "papers/22/02/2202.03086.json",
    "total_tokens": 905,
    "translated_title": "从手语到口语的机器翻译：现状与挑战",
    "translated_abstract": "从手语到口语的自动翻译是一个跨学科的研究领域，涉及计算机视觉、机器翻译和语言学。尽管如此，在这个领域的研究大多由计算机科学家单独进行。随着这个领域越来越受欢迎 - 过去三年中关于手语翻译的大部分科学论文已经发表 - 我们提供了现状概述以及不同相关学科的一些必要背景知识。我们对手语语言学和机器翻译进行了高层次的介绍，以说明自动手语翻译的要求。我们进行了系统的文献综述，以说明领域的现状，然后基于这些要求，提出了未来研究面临的几个挑战。我们发现，在口语机器翻译的基础上取得了重大进展，但手语翻译存在独特的挑战需要进一步研究关注。",
    "tldr": "手语到口语自动翻译是一个跨学科的研究领域，它的研究现状得到了总结，但手语翻译存在独特的挑战需要进一步关注。",
    "en_tdlr": "Automatic translation from signed to spoken languages is an interdisciplinary research domain, which has been summarized with the current state of the art, but sign language translation has unique challenges that require further attention."
}