{
    "title": "Exploratory Hidden Markov Factor Models for Longitudinal Mobile Health Data: Application to Adverse Posttraumatic Neuropsychiatric Sequelae. (arXiv:2202.12819v2 [stat.AP] UPDATED)",
    "abstract": "Adverse posttraumatic neuropsychiatric sequelae (APNS) are common among veterans and millions of Americans after traumatic exposures, resulting in substantial burdens for trauma survivors and society. Despite numerous studies conducted on APNS over the past decades, there has been limited progress in understanding the underlying neurobiological mechanisms due to several unique challenges. One of these challenges is the reliance on subjective self-report measures to assess APNS, which can easily result in measurement errors and biases (e.g., recall bias). To mitigate this issue, in this paper, we investigate the potential of leveraging the objective longitudinal mobile device data to identify homogeneous APNS states and study the dynamic transitions and potential risk factors of APNS after trauma exposure. To handle specific challenges posed by longitudinal mobile device data, we developed exploratory hidden Markov factor models and designed a Stabilized Expectation-Maximization algorit",
    "link": "http://arxiv.org/abs/2202.12819",
    "context": "Title: Exploratory Hidden Markov Factor Models for Longitudinal Mobile Health Data: Application to Adverse Posttraumatic Neuropsychiatric Sequelae. (arXiv:2202.12819v2 [stat.AP] UPDATED)\nAbstract: Adverse posttraumatic neuropsychiatric sequelae (APNS) are common among veterans and millions of Americans after traumatic exposures, resulting in substantial burdens for trauma survivors and society. Despite numerous studies conducted on APNS over the past decades, there has been limited progress in understanding the underlying neurobiological mechanisms due to several unique challenges. One of these challenges is the reliance on subjective self-report measures to assess APNS, which can easily result in measurement errors and biases (e.g., recall bias). To mitigate this issue, in this paper, we investigate the potential of leveraging the objective longitudinal mobile device data to identify homogeneous APNS states and study the dynamic transitions and potential risk factors of APNS after trauma exposure. To handle specific challenges posed by longitudinal mobile device data, we developed exploratory hidden Markov factor models and designed a Stabilized Expectation-Maximization algorit",
    "path": "papers/22/02/2202.12819.json",
    "total_tokens": 1231,
    "translated_title": "探索性的隐马尔可夫因子模型用于纵向移动健康数据：以不良创伤后神经精神后遗症为例。",
    "translated_abstract": "不良的创伤后神经精神后遗症（APNS）在退役军人和数百万美国人中很常见，给创伤幸存者和社会带来了巨大重负。尽管过去几十年对APNS进行了Numerous的研究，但由于几个独特的挑战，理解其潜在神经生物机制的进展有限。其中一个挑战是依赖于主观的自我报告测量APNS，这容易导致测量误差和偏差（例如回忆偏倚）。为了减轻这个问题，在本文中，我们研究了利用客观纵向移动设备数据以识别同质APNS状态并研究创伤暴露后APNS的动态转换和潜在风险因素的潜力。为了处理纵向移动设备数据所面临的特定挑战，我们开发了探索性的隐马尔可夫因子模型，并设计了一个稳定的期望最大化算法来学习模型参数。所提出的方法使用模拟和真实数据进行了评估，这些数据来自大量遭受创伤的退役军人。结果表明，所提出的模型能够成功地识别同质APNS状态，捕获这些状态之间的动态转换，并揭示与这些转换相关的风险因素。所提出的方法有潜力提供更客观和全面的理解APNS潜在神经形成机制，并为创伤幸存者的有针对性的干预的开发提供信息。",
    "tldr": "本文提出了一个探索性的隐马尔可夫因子模型以利用长期移动设备数据，确定 APNS 状态并研究其转换和潜在风险因素，为理解和干预 APNS 提供了更全面和客观的途径。",
    "en_tdlr": "This paper proposes an exploratory hidden Markov factor model to leverage longitudinal mobile device data, identify APNS states, study their transitions and potential risk factors, offering a more comprehensive and objective approach for understanding and intervening APNS."
}