{
    "title": "The HaMSE Ontology: Using Semantic Technologies to support Music Representation Interoperability and Musicological Analysis. (arXiv:2202.05817v1 [cs.SD] CROSS LISTED)",
    "abstract": "The use of Semantic Technologies - in particular the Semantic Web - has revealed to be a great tool for describing the cultural heritage domain and artistic practices. However, the panorama of ontologies for musicological applications seems to be limited and restricted to specific applications. In this research, we propose HaMSE, an ontology capable of describing musical features that can assist musicological research. More specifically, HaMSE proposes to address sues that have been affecting musicological research for decades: the representation of music and the relationship between quantitative and qualitative data. To do this, HaMSE allows the alignment between different music representation systems and describes a set of musicological features that can allow the music analysis at different granularity levels.",
    "link": "http://arxiv.org/abs/2202.05817",
    "context": "Title: The HaMSE Ontology: Using Semantic Technologies to support Music Representation Interoperability and Musicological Analysis. (arXiv:2202.05817v1 [cs.SD] CROSS LISTED)\nAbstract: The use of Semantic Technologies - in particular the Semantic Web - has revealed to be a great tool for describing the cultural heritage domain and artistic practices. However, the panorama of ontologies for musicological applications seems to be limited and restricted to specific applications. In this research, we propose HaMSE, an ontology capable of describing musical features that can assist musicological research. More specifically, HaMSE proposes to address sues that have been affecting musicological research for decades: the representation of music and the relationship between quantitative and qualitative data. To do this, HaMSE allows the alignment between different music representation systems and describes a set of musicological features that can allow the music analysis at different granularity levels.",
    "path": "papers/22/02/2202.05817.json",
    "total_tokens": 845,
    "translated_title": "HaMSE本体论：利用语义技术支持音乐表现互操作性和音乐学分析",
    "translated_abstract": "使用语义技术 - 特别是语义Web - 已经成为描述文化遗产领域和艺术实践的伟大工具。 然而，音乐学应用本体的景观似乎是有限的，并且仅限于特定的应用程序。在这项研究中，我们提出了HaMSE，一种能够描述音乐特征并有助于音乐学研究的本体论。更具体而言，HaMSE旨在解决困扰音乐学研究几十年的问题：音乐的表示和定量和定性数据之间的关系。为此，HaMSE允许不同音乐表现系统之间的对齐，并描述了一组音乐学特征，可以允许以不同的粒度级别进行音乐分析。",
    "tldr": "本论文提出了HaMSE本体论，它可以描述音乐特征并有助于音乐学研究。它通过允许不同音乐表现系统之间的对齐，并描述了一组音乐学特征，可以解决音乐表示和定量和定性数据之间的关系。",
    "en_tdlr": "This paper proposes the HaMSE ontology, which is capable of describing musical features and assisting musicological research. It allows alignment between different music representation systems and describes a set of musicological features that can help to address the relationship between music representation and quantitative and qualitative data."
}