{
    "title": "Structured Prediction Problem Archive. (arXiv:2202.03574v4 [cs.LG] UPDATED)",
    "abstract": "Structured prediction problems are one of the fundamental tools in machine learning. In order to facilitate algorithm development for their numerical solution, we collect in one place a large number of datasets in easy to read formats for a diverse set of problem classes. We provide archival links to datasets, description of the considered problems and problem formats, and a short summary of problem characteristics including size, number of instances etc. For reference we also give a non-exhaustive selection of algorithms proposed in the literature for their solution. We hope that this central repository will make benchmarking and comparison to established works easier. We welcome submission of interesting new datasets and algorithms for inclusion in our archive.",
    "link": "http://arxiv.org/abs/2202.03574",
    "context": "Title: Structured Prediction Problem Archive. (arXiv:2202.03574v4 [cs.LG] UPDATED)\nAbstract: Structured prediction problems are one of the fundamental tools in machine learning. In order to facilitate algorithm development for their numerical solution, we collect in one place a large number of datasets in easy to read formats for a diverse set of problem classes. We provide archival links to datasets, description of the considered problems and problem formats, and a short summary of problem characteristics including size, number of instances etc. For reference we also give a non-exhaustive selection of algorithms proposed in the literature for their solution. We hope that this central repository will make benchmarking and comparison to established works easier. We welcome submission of interesting new datasets and algorithms for inclusion in our archive.",
    "path": "papers/22/02/2202.03574.json",
    "total_tokens": 761,
    "translated_title": "结构化预测问题存档",
    "translated_abstract": "结构化预测问题是机器学习中的基本工具之一。为了便于算法开发，我们在一个地方收集了大量易于阅读的数据集，涵盖了各种问题类别的问题。我们提供数据集的存档链接，问题描述和问题格式，以及问题特性的简要总结，包括大小，实例数量等。为了参考，我们还列举了文献中提出的一些算法，用于解决这些问题。我们希望这个中央存储库能够更容易地进行基准测试和与已有工作的比较。我们欢迎提交有趣的新数据集和算法，以便将其纳入我们的存档。",
    "tldr": "该论文介绍了一个结构化预测问题的存档，集中收集了各种问题类别的数据集，并提供对问题的描述、格式和特性进行总结，以及列举了相关算法。该存档旨在方便进行基准测试和与已有工作的比较，并欢迎提交新的数据集和算法。",
    "en_tdlr": "This paper presents a structured prediction problem archive that collects datasets from various problem classes and provides descriptions, formats, and summaries of problem characteristics, as well as a list of related algorithms. The archive aims to facilitate benchmarking and comparison to established works, and welcomes submissions of new datasets and algorithms."
}