{
    "title": "Data-Driven Minimax Optimization with Expectation Constraints. (arXiv:2202.07868v2 [cs.LG] UPDATED)",
    "abstract": "Attention to data-driven optimization approaches, including the well-known stochastic gradient descent method, has grown significantly over recent decades, but data-driven constraints have rarely been studied, because of the computational challenges of projections onto the feasible set defined by these hard constraints. In this paper, we focus on the non-smooth convex-concave stochastic minimax regime and formulate the data-driven constraints as expectation constraints. The minimax expectation constrained problem subsumes a broad class of real-world applications, including two-player zero-sum game and data-driven robust optimization. We propose a class of efficient primal-dual algorithms to tackle the minimax expectation-constrained problem, and show that our algorithms converge at the optimal rate of $\\mathcal{O}(\\frac{1}{\\sqrt{N}})$. We demonstrate the practical efficiency of our algorithms by conducting numerical experiments on large-scale real-world applications.",
    "link": "http://arxiv.org/abs/2202.07868",
    "context": "Title: Data-Driven Minimax Optimization with Expectation Constraints. (arXiv:2202.07868v2 [cs.LG] UPDATED)\nAbstract: Attention to data-driven optimization approaches, including the well-known stochastic gradient descent method, has grown significantly over recent decades, but data-driven constraints have rarely been studied, because of the computational challenges of projections onto the feasible set defined by these hard constraints. In this paper, we focus on the non-smooth convex-concave stochastic minimax regime and formulate the data-driven constraints as expectation constraints. The minimax expectation constrained problem subsumes a broad class of real-world applications, including two-player zero-sum game and data-driven robust optimization. We propose a class of efficient primal-dual algorithms to tackle the minimax expectation-constrained problem, and show that our algorithms converge at the optimal rate of $\\mathcal{O}(\\frac{1}{\\sqrt{N}})$. We demonstrate the practical efficiency of our algorithms by conducting numerical experiments on large-scale real-world applications.",
    "path": "papers/22/02/2202.07868.json",
    "total_tokens": 868,
    "translated_title": "基于数据驱动的带期望约束的极小极大优化",
    "translated_abstract": "近年来，对于包括著名的随机梯度下降方法在内的数据驱动优化方法的关注度显著增加，但很少有人研究数据驱动约束，因为这些硬性约束定义的可行集上的投影计算挑战巨大。本文关注于非光滑凸凹随机极小极大框架，并将数据驱动约束形式化为期望约束。极小极大期望约束问题涵盖了广泛的实际应用，包括二人零和博弈和数据驱动鲁棒优化。我们提出了一类高效的原始对偶算法来解决极小极大期望约束问题，并证明了我们的算法以$\\mathcal{O}(\\frac{1}{\\sqrt{N}})$的最优速率收敛。我们通过在大规模实际应用上进行数值实验来证明我们算法的实际效率。",
    "tldr": "本论文研究了基于数据驱动的带期望约束的极小极大优化问题，并提出了一类高效的算法来解决这一问题。依据实验结果，该算法在大规模实际应用中具有实际效率。",
    "en_tdlr": "This paper investigates data-driven minimax optimization problems with expectation constraints and proposes an efficient algorithm to solve them. Experimental results demonstrate the practical efficiency of the algorithm in large-scale real-world applications."
}