{
    "title": "Causal-StoNet: Causal Inference for High-Dimensional Complex Data",
    "abstract": "arXiv:2403.18994v1 Announce Type: cross  Abstract: With the advancement of data science, the collection of increasingly complex datasets has become commonplace. In such datasets, the data dimension can be extremely high, and the underlying data generation process can be unknown and highly nonlinear. As a result, the task of making causal inference with high-dimensional complex data has become a fundamental problem in many disciplines, such as medicine, econometrics, and social science. However, the existing methods for causal inference are frequently developed under the assumption that the data dimension is low or that the underlying data generation process is linear or approximately linear. To address these challenges, this paper proposes a novel causal inference approach for dealing with high-dimensional complex data. The proposed approach is based on deep learning techniques, including sparse deep learning theory and stochastic neural networks, that have been developed in recent lit",
    "link": "https://arxiv.org/abs/2403.18994",
    "context": "Title: Causal-StoNet: Causal Inference for High-Dimensional Complex Data\nAbstract: arXiv:2403.18994v1 Announce Type: cross  Abstract: With the advancement of data science, the collection of increasingly complex datasets has become commonplace. In such datasets, the data dimension can be extremely high, and the underlying data generation process can be unknown and highly nonlinear. As a result, the task of making causal inference with high-dimensional complex data has become a fundamental problem in many disciplines, such as medicine, econometrics, and social science. However, the existing methods for causal inference are frequently developed under the assumption that the data dimension is low or that the underlying data generation process is linear or approximately linear. To address these challenges, this paper proposes a novel causal inference approach for dealing with high-dimensional complex data. The proposed approach is based on deep learning techniques, including sparse deep learning theory and stochastic neural networks, that have been developed in recent lit",
    "path": "papers/24/03/2403.18994.json",
    "total_tokens": 772,
    "translated_title": "Causal-StoNet: 高维复杂数据的因果推断",
    "translated_abstract": "随着数据科学的发展，收集越来越复杂的数据集已经变得司空见惯。在这些数据集中，数据维度可能非常高，并且潜在的数据生成过程可能是未知的，高度非线性的。因此，在许多领域，如医学、计量经济学和社会科学，对高维复杂数据进行因果推断的任务已经成为一个基本问题。然而，现有的因果推断方法通常是在假设数据维度较低或潜在数据生成过程为线性或近似线性的情况下开发的。为了解决这些挑战，本文提出了一种新颖的因果推断方法，用于处理高维复杂数据。所提出的方法基于深度学习技术，包括最近发展的稀疏深度学习理论和随机神经网络。",
    "tldr": "本文提出了一种基于深度学习技术的新颖因果推断方法，用于处理高维复杂数据。"
}