{
    "title": "DecompOpt: Controllable and Decomposed Diffusion Models for Structure-based Molecular Optimization",
    "abstract": "arXiv:2403.13829v1 Announce Type: cross  Abstract: Recently, 3D generative models have shown promising performances in structure-based drug design by learning to generate ligands given target binding sites. However, only modeling the target-ligand distribution can hardly fulfill one of the main goals in drug discovery -- designing novel ligands with desired properties, e.g., high binding affinity, easily synthesizable, etc. This challenge becomes particularly pronounced when the target-ligand pairs used for training do not align with these desired properties. Moreover, most existing methods aim at solving \\textit{de novo} design task, while many generative scenarios requiring flexible controllability, such as R-group optimization and scaffold hopping, have received little attention. In this work, we propose DecompOpt, a structure-based molecular optimization method based on a controllable and decomposed diffusion model. DecompOpt presents a new generation paradigm which combines optimi",
    "link": "https://arxiv.org/abs/2403.13829",
    "context": "Title: DecompOpt: Controllable and Decomposed Diffusion Models for Structure-based Molecular Optimization\nAbstract: arXiv:2403.13829v1 Announce Type: cross  Abstract: Recently, 3D generative models have shown promising performances in structure-based drug design by learning to generate ligands given target binding sites. However, only modeling the target-ligand distribution can hardly fulfill one of the main goals in drug discovery -- designing novel ligands with desired properties, e.g., high binding affinity, easily synthesizable, etc. This challenge becomes particularly pronounced when the target-ligand pairs used for training do not align with these desired properties. Moreover, most existing methods aim at solving \\textit{de novo} design task, while many generative scenarios requiring flexible controllability, such as R-group optimization and scaffold hopping, have received little attention. In this work, we propose DecompOpt, a structure-based molecular optimization method based on a controllable and decomposed diffusion model. DecompOpt presents a new generation paradigm which combines optimi",
    "path": "papers/24/03/2403.13829.json",
    "total_tokens": 810,
    "translated_title": "DecompOpt：用于基于结构的分子优化的可控分解扩散模型",
    "translated_abstract": "最近，3D生成模型在基于结构的药物设计中表现出良好性能，通过学习在给定靶标结合位点的情况下生成配体。然而，仅建模靶-配体分布几乎无法实现药物发现的主要目标之一——设计具有所需属性（如高结合亲和力，易合成等）的新型配体。当用于训练的靶-配体对不符合这些期望属性时，这一挑战尤为明显。此外，大多数现有方法旨在解决\\textit{从无到有}的设计任务，而许多需要灵活可控性的生成场景，如R基团优化和骨架跳跃等，却受到了很少关注。在这项工作中，我们提出了DecompOpt，这是一种基于结构的分子优化方法，基于一个可控且分解的扩散模型。DecompOpt提出了一种新的生成范式，结合了优化的",
    "tldr": "提出了一种基于可控分解扩散模型的结构化分子优化方法",
    "en_tdlr": "Proposed a structured molecular optimization method based on a controllable and decomposed diffusion model."
}