{
    "title": "Evaluating Shortest Edit Script Methods for Contextual Lemmatization",
    "abstract": "arXiv:2403.16968v1 Announce Type: new  Abstract: Modern contextual lemmatizers often rely on automatically induced Shortest Edit Scripts (SES), namely, the number of edit operations to transform a word form into its lemma. In fact, different methods of computing SES have been proposed as an integral component in the architecture of several state-of-the-art contextual lemmatizers currently available. However, previous work has not investigated the direct impact of SES in the final lemmatization performance. In this paper we address this issue by focusing on lemmatization as a token classification task where the only input that the model receives is the word-label pairs in context, where the labels correspond to previously induced SES. Thus, by modifying in our lemmatization system only the SES labels that the model needs to learn, we may then objectively conclude which SES representation produces the best lemmatization results. We experiment with seven languages of different morphologic",
    "link": "https://arxiv.org/abs/2403.16968",
    "context": "Title: Evaluating Shortest Edit Script Methods for Contextual Lemmatization\nAbstract: arXiv:2403.16968v1 Announce Type: new  Abstract: Modern contextual lemmatizers often rely on automatically induced Shortest Edit Scripts (SES), namely, the number of edit operations to transform a word form into its lemma. In fact, different methods of computing SES have been proposed as an integral component in the architecture of several state-of-the-art contextual lemmatizers currently available. However, previous work has not investigated the direct impact of SES in the final lemmatization performance. In this paper we address this issue by focusing on lemmatization as a token classification task where the only input that the model receives is the word-label pairs in context, where the labels correspond to previously induced SES. Thus, by modifying in our lemmatization system only the SES labels that the model needs to learn, we may then objectively conclude which SES representation produces the best lemmatization results. We experiment with seven languages of different morphologic",
    "path": "papers/24/03/2403.16968.json",
    "total_tokens": 854,
    "translated_title": "评估用于上下文词形还原的最短编辑脚本方法",
    "translated_abstract": "现代上下文词形还原器通常依赖于自动诱导的最短编辑脚本（SES），即转换单词形式为其词元所需的编辑操作次数。事实上，已经提出了不同的计算SES方法作为几种当前可用的最先进的上下文词形还原器架构的一个组成部分。然而，以往的研究未考察SES在最终词形还原性能中的直接影响。本文通过将词形还原视为一个令牌分类任务来解决这个问题，模型仅接收上下文中的词-标签对作为输入，其中标签对应于先前诱导的SES。因此，通过仅修改模型需要学习的SES标签，我们可以客观地得出哪种SES表示产生最佳的词形还原结果。我们在使用不同形态的七种语言进行实验。",
    "tldr": "本文评估了用于上下文词形还原的最短编辑脚本方法，通过将词形还原视为令牌分类任务，仅修改需要学习的SES标签，客观得出最佳的词形还原结果。"
}