{
    "title": "A vicious cycle along busy bus corridors and how to abate it",
    "abstract": "arXiv:2403.08230v1 Announce Type: new  Abstract: We unveil that a previously-unreported vicious cycle can be created when bus queues form at curbside stops along a corridor. Buses caught in this cycle exhibit growing variation in headways as they travel from stop to stop. Bus (and patron) delays accumulate in like fashion and can grow large on long, busy corridors. We show that this damaging cycle can be abated in simple ways. Present solutions entail holding buses at a corridor entrance and releasing them as per various strategies proposed in the literature. We introduce a modest variant to the simplest of these strategies. It releases buses at headways that are slightly less than, or equal to, the scheduled values. It turns out that periodically releasing buses at slightly smaller headways can substantially reduce bus delays caused by holding so that benefits can more readily outweigh costs in corridors that contain a sufficient number of serial bus stops. The simple variant is shown",
    "link": "https://arxiv.org/abs/2403.08230",
    "context": "Title: A vicious cycle along busy bus corridors and how to abate it\nAbstract: arXiv:2403.08230v1 Announce Type: new  Abstract: We unveil that a previously-unreported vicious cycle can be created when bus queues form at curbside stops along a corridor. Buses caught in this cycle exhibit growing variation in headways as they travel from stop to stop. Bus (and patron) delays accumulate in like fashion and can grow large on long, busy corridors. We show that this damaging cycle can be abated in simple ways. Present solutions entail holding buses at a corridor entrance and releasing them as per various strategies proposed in the literature. We introduce a modest variant to the simplest of these strategies. It releases buses at headways that are slightly less than, or equal to, the scheduled values. It turns out that periodically releasing buses at slightly smaller headways can substantially reduce bus delays caused by holding so that benefits can more readily outweigh costs in corridors that contain a sufficient number of serial bus stops. The simple variant is shown",
    "path": "papers/24/03/2403.08230.json",
    "total_tokens": 929,
    "translated_title": "沿繁忙公交走廊的恶性循环及其缓解方法",
    "translated_abstract": "我们揭示了一个以往未报告的恶性循环现象，即在走廊沿线的路边站点形成公交车队列时可以产生。被困在该循环中的公交车在从一个站点到另一个站点的行驶过程中，出现头way的变化。公交车（以及乘客）的延误也以类似方式积累，并且在长距离、繁忙的走廊上可能会变得很大。我们展示了可以通过简单方式减轻这种有害循环的方法。目前的解决方案包括在走廊入口处暂停公交车，并按照文献中提出的各种策略释放它们。我们介绍了对最简单策略的一种小型变体。它以略小于或等于计划值的头车间隔释放公交车。事实证明，周期性地以稍少的头车间隔释放公交车可以大幅减少由于暂停而造成的公交车延误，因此在包含足够数量串行公交站点的走廊中，益处可以更快地超过成本。这种简单的变体已被证明",
    "tldr": "公交走廊上形成的恶性循环会导致公交车头车间隔的不断增大，延误逐渐积累，采用一种简单的释放策略可以有效减轻公交车延误。"
}