{
    "title": "The Artificial Neural Twin -- Process Optimization and Continual Learning in Distributed Process Chains",
    "abstract": "arXiv:2403.18343v1 Announce Type: new  Abstract: Industrial process optimization and control is crucial to increase economic and ecologic efficiency. However, data sovereignty, differing goals, or the required expert knowledge for implementation impede holistic implementation. Further, the increasing use of data-driven AI-methods in process models and industrial sensory often requires regular fine-tuning to accommodate distribution drifts. We propose the Artificial Neural Twin, which combines concepts from model predictive control, deep learning, and sensor networks to address these issues. Our approach introduces differentiable data fusion to estimate the state of distributed process steps and their dependence on input data. By treating the interconnected process steps as a quasi neural-network, we can backpropagate loss gradients for process optimization or model fine-tuning to process parameters or AI models respectively. The concept is demonstrated on a virtual machine park simulat",
    "link": "https://arxiv.org/abs/2403.18343",
    "context": "Title: The Artificial Neural Twin -- Process Optimization and Continual Learning in Distributed Process Chains\nAbstract: arXiv:2403.18343v1 Announce Type: new  Abstract: Industrial process optimization and control is crucial to increase economic and ecologic efficiency. However, data sovereignty, differing goals, or the required expert knowledge for implementation impede holistic implementation. Further, the increasing use of data-driven AI-methods in process models and industrial sensory often requires regular fine-tuning to accommodate distribution drifts. We propose the Artificial Neural Twin, which combines concepts from model predictive control, deep learning, and sensor networks to address these issues. Our approach introduces differentiable data fusion to estimate the state of distributed process steps and their dependence on input data. By treating the interconnected process steps as a quasi neural-network, we can backpropagate loss gradients for process optimization or model fine-tuning to process parameters or AI models respectively. The concept is demonstrated on a virtual machine park simulat",
    "path": "papers/24/03/2403.18343.json",
    "total_tokens": 868,
    "translated_title": "人工神经孪生体--分布式过程链中的流程优化和持续学习",
    "translated_abstract": "工业过程优化和控制对于提高经济和生态效率至关重要。然而，数据主权、不同的目标，或者实施所需的专业知识阻碍了整体实现。此外，越来越多地使用基于数据的AI方法在过程模型和工业传感器中经常需要定期微调以适应分布漂移。我们提出了人工神经孪生体，它结合了模型预测控制、深度学习和传感器网络的概念，以解决这些问题。我们的方法引入了可微分数据融合来估计分布式过程步骤的状态及其对输入数据的依赖。通过将相互连接的过程步骤视为准神经网络，我们可以反向传播损失梯度，用于流程优化或模型微调到过程参数或AI模型中。该概念在虚拟机组模拟中进行了演示。",
    "tldr": "提出了人工神经孪生体，结合了模型预测控制、深度学习和传感器网络的概念，通过可微分数据融合和反向传播损失梯度来实现分布式过程链中的流程优化和持续学习。",
    "en_tdlr": "The Artificial Neural Twin is proposed, which integrates concepts from model predictive control, deep learning, and sensor networks to achieve process optimization and continual learning in distributed process chains through differentiable data fusion and backpropagating loss gradients."
}