{
    "title": "Scalability of Metropolis-within-Gibbs schemes for high-dimensional Bayesian models",
    "abstract": "arXiv:2403.09416v1 Announce Type: cross  Abstract: We study general coordinate-wise MCMC schemes (such as Metropolis-within-Gibbs samplers), which are commonly used to fit Bayesian non-conjugate hierarchical models. We relate their convergence properties to the ones of the corresponding (potentially not implementable) Gibbs sampler through the notion of conditional conductance. This allows us to study the performances of popular Metropolis-within-Gibbs schemes for non-conjugate hierarchical models, in high-dimensional regimes where both number of datapoints and parameters increase. Given random data-generating assumptions, we establish dimension-free convergence results, which are in close accordance with numerical evidences. Applications to Bayesian models for binary regression with unknown hyperparameters and discretely observed diffusions are also discussed. Motivated by such statistical applications, auxiliary results of independent interest on approximate conductances and perturba",
    "link": "https://arxiv.org/abs/2403.09416",
    "context": "Title: Scalability of Metropolis-within-Gibbs schemes for high-dimensional Bayesian models\nAbstract: arXiv:2403.09416v1 Announce Type: cross  Abstract: We study general coordinate-wise MCMC schemes (such as Metropolis-within-Gibbs samplers), which are commonly used to fit Bayesian non-conjugate hierarchical models. We relate their convergence properties to the ones of the corresponding (potentially not implementable) Gibbs sampler through the notion of conditional conductance. This allows us to study the performances of popular Metropolis-within-Gibbs schemes for non-conjugate hierarchical models, in high-dimensional regimes where both number of datapoints and parameters increase. Given random data-generating assumptions, we establish dimension-free convergence results, which are in close accordance with numerical evidences. Applications to Bayesian models for binary regression with unknown hyperparameters and discretely observed diffusions are also discussed. Motivated by such statistical applications, auxiliary results of independent interest on approximate conductances and perturba",
    "path": "papers/24/03/2403.09416.json",
    "total_tokens": 918,
    "translated_title": "Metropolis-within-Gibbs方案在高维贝叶斯模型中的可扩展性",
    "translated_abstract": "我们研究了一般的坐标逐步MCMC方案（如Metropolis-within-Gibbs抽样器），这些方案通常用于拟合贝叶斯非共轭分层模型。我们将它们的收敛性质与相应的（可能无法实现的）Gibbs抽样器的概念联系起来，通过条件导纳的概念。这使我们能够研究流行的Metropolis-within-Gibbs方案在高维情况下（数据点和参数同时增加）的非共轭分层模型的性能。在给定随机数据生成假设的情况下，我们建立了与数值证据密切一致的与维度无关的收敛结果。还讨论了在具有未知超参数的二元回归贝叶斯模型和离散观察扩散方面的应用。受这类统计应用的启发，我们还讨论了关于近似导纳和扰动的独立兴趣的辅助结果。",
    "tldr": "研究了Metropolis-within-Gibbs方案在高维贝叶斯模型中的可扩展性，建立了与数值证据密切一致的与维度无关的收敛结果，并讨论了其在二元回归和离散观察扩散贝叶斯模型中的应用。",
    "en_tdlr": "Investigated the scalability of Metropolis-within-Gibbs schemes for high-dimensional Bayesian models, established dimension-free convergence results in close accordance with numerical evidences, and discussed their applications in Bayesian models for binary regression and discretely observed diffusions."
}