{
    "title": "Modeling and predicting students' engagement behaviors using mixture Markov models",
    "abstract": "arXiv:2403.05556v1 Announce Type: cross  Abstract: Students' engagements reflect their level of involvement in an ongoing learning process which can be estimated through their interactions with a computer-based learning or assessment system. A pre-requirement for stimulating student engagement lies in the capability to have an approximate representation model for comprehending students' varied (dis)engagement behaviors. In this paper, we utilized model-based clustering for this purpose which generates K mixture Markov models to group students' traces containing their (dis)engagement behavioral patterns. To prevent the Expectation-Maximization (EM) algorithm from getting stuck in a local maxima, we also introduced a K-means-based initialization method named as K-EM. We performed an experimental work on two real datasets using the three variants of the EM algorithm: the original EM, emEM, K-EM; and, non-mixture baseline models for both datasets. The proposed K-EM has shown very promising",
    "link": "https://arxiv.org/abs/2403.05556",
    "context": "Title: Modeling and predicting students' engagement behaviors using mixture Markov models\nAbstract: arXiv:2403.05556v1 Announce Type: cross  Abstract: Students' engagements reflect their level of involvement in an ongoing learning process which can be estimated through their interactions with a computer-based learning or assessment system. A pre-requirement for stimulating student engagement lies in the capability to have an approximate representation model for comprehending students' varied (dis)engagement behaviors. In this paper, we utilized model-based clustering for this purpose which generates K mixture Markov models to group students' traces containing their (dis)engagement behavioral patterns. To prevent the Expectation-Maximization (EM) algorithm from getting stuck in a local maxima, we also introduced a K-means-based initialization method named as K-EM. We performed an experimental work on two real datasets using the three variants of the EM algorithm: the original EM, emEM, K-EM; and, non-mixture baseline models for both datasets. The proposed K-EM has shown very promising",
    "path": "papers/24/03/2403.05556.json",
    "total_tokens": 835,
    "translated_title": "通过混合马尔可夫模型对学生的参与行为进行建模和预测",
    "translated_abstract": "学生的参与反映了他们在进行中的学习过程中的参与程度，可以通过他们与基于计算机的学习或评估系统的互动来估计。激发学生的参与需要具备大致的表示模型，以理解学生的各种（不）参与行为。本文利用基于模型的聚类，生成K个混合马尔可夫模型，对包含学生（不）参与行为模式的轨迹进行分组。为了防止期望最大化（EM）算法陷入局部最大值，我们还引入了一种名为K-EM的基于K均值的初始化方法。我们对两个真实数据集进行了实验，使用EM算法的三个变体：原始EM、emEM、K-EM；以及两个数据集的非混合基线模型。所提出的K-EM表现出了极具前景。",
    "tldr": "本文通过混合马尔可夫模型对学生的参与行为进行建模和预测，并引入了一种名为K-EM的基于K均值的初始化方法，实验结果表明其效果极具前景",
    "en_tdlr": "This paper models and predicts students' engagement behaviors using mixture Markov models and introduces a K-means-based initialization method named as K-EM, showing very promising results in the experiments."
}