{
    "title": "LLMs-based Few-Shot Disease Predictions using EHR: A Novel Approach Combining Predictive Agent Reasoning and Critical Agent Instruction",
    "abstract": "arXiv:2403.15464v1 Announce Type: cross  Abstract: Electronic health records (EHRs) contain valuable patient data for health-related prediction tasks, such as disease prediction. Traditional approaches rely on supervised learning methods that require large labeled datasets, which can be expensive and challenging to obtain. In this study, we investigate the feasibility of applying Large Language Models (LLMs) to convert structured patient visit data (e.g., diagnoses, labs, prescriptions) into natural language narratives. We evaluate the zero-shot and few-shot performance of LLMs using various EHR-prediction-oriented prompting strategies. Furthermore, we propose a novel approach that utilizes LLM agents with different roles: a predictor agent that makes predictions and generates reasoning processes and a critic agent that analyzes incorrect predictions and provides guidance for improving the reasoning of the predictor agent. Our results demonstrate that with the proposed approach, LLMs c",
    "link": "https://arxiv.org/abs/2403.15464",
    "context": "Title: LLMs-based Few-Shot Disease Predictions using EHR: A Novel Approach Combining Predictive Agent Reasoning and Critical Agent Instruction\nAbstract: arXiv:2403.15464v1 Announce Type: cross  Abstract: Electronic health records (EHRs) contain valuable patient data for health-related prediction tasks, such as disease prediction. Traditional approaches rely on supervised learning methods that require large labeled datasets, which can be expensive and challenging to obtain. In this study, we investigate the feasibility of applying Large Language Models (LLMs) to convert structured patient visit data (e.g., diagnoses, labs, prescriptions) into natural language narratives. We evaluate the zero-shot and few-shot performance of LLMs using various EHR-prediction-oriented prompting strategies. Furthermore, we propose a novel approach that utilizes LLM agents with different roles: a predictor agent that makes predictions and generates reasoning processes and a critic agent that analyzes incorrect predictions and provides guidance for improving the reasoning of the predictor agent. Our results demonstrate that with the proposed approach, LLMs c",
    "path": "papers/24/03/2403.15464.json",
    "total_tokens": 890,
    "translated_title": "基于LLMs的少样本疾病预测：结合预测性代理推理和批判性代理指导的新方法",
    "translated_abstract": "arXiv:2403.15464v1 类型：跨学科 摘要：电子健康记录(EHRs)包含对健康相关预测任务，如疾病预测，有价值的患者数据。传统方法依赖于需要大量标记数据集的监督学习方法，这可能是昂贵和具有挑战性的。在本研究中，我们调查了将大型语言模型(LLMs)应用于将结构化患者就诊数据(例如诊断、实验室、处方)转换为自然语言叙述的可行性。我们使用各种面向EHR预测的提示策略评估了LLMs的零样本和少样本性能。此外，我们提出了一种新方法，利用具有不同角色的LLM代理：一个进行预测并生成推理过程的预测代理，以及分析不正确预测并为改善预测代理推理提供指导的批评代理。我们的结果表明，通过提出的方法，LLMs能够...",
    "tldr": "该论文提出了一种新方法，结合预测性代理推理和批判性代理指导，利用LLMs对结构化患者就诊数据进行预测，取得了较好的效果。",
    "en_tdlr": "This paper presents a novel approach that combines predictive agent reasoning and critical agent instruction, using LLMs to predict structured patient visit data, showing promising results."
}