{
    "title": "ERD: A Framework for Improving LLM Reasoning for Cognitive Distortion Classification",
    "abstract": "arXiv:2403.14255v1 Announce Type: new  Abstract: Improving the accessibility of psychotherapy with the aid of Large Language Models (LLMs) is garnering a significant attention in recent years. Recognizing cognitive distortions from the interviewee's utterances can be an essential part of psychotherapy, especially for cognitive behavioral therapy. In this paper, we propose ERD, which improves LLM-based cognitive distortion classification performance with the aid of additional modules of (1) extracting the parts related to cognitive distortion, and (2) debating the reasoning steps by multiple agents. Our experimental results on a public dataset show that ERD improves the multi-class F1 score as well as binary specificity score. Regarding the latter score, it turns out that our method is effective in debiasing the baseline method which has high false positive rate, especially when the summary of multi-agent debate is provided to LLMs.",
    "link": "https://arxiv.org/abs/2403.14255",
    "context": "Title: ERD: A Framework for Improving LLM Reasoning for Cognitive Distortion Classification\nAbstract: arXiv:2403.14255v1 Announce Type: new  Abstract: Improving the accessibility of psychotherapy with the aid of Large Language Models (LLMs) is garnering a significant attention in recent years. Recognizing cognitive distortions from the interviewee's utterances can be an essential part of psychotherapy, especially for cognitive behavioral therapy. In this paper, we propose ERD, which improves LLM-based cognitive distortion classification performance with the aid of additional modules of (1) extracting the parts related to cognitive distortion, and (2) debating the reasoning steps by multiple agents. Our experimental results on a public dataset show that ERD improves the multi-class F1 score as well as binary specificity score. Regarding the latter score, it turns out that our method is effective in debiasing the baseline method which has high false positive rate, especially when the summary of multi-agent debate is provided to LLMs.",
    "path": "papers/24/03/2403.14255.json",
    "total_tokens": 798,
    "translated_title": "ERD：一个用于改善认知失调分类的LLM推理框架",
    "translated_abstract": "使用大型语言模型（LLMs）改进心理治疗的可访问性近年来受到了重视。从受访者的话语中识别认知失调可以是心理治疗的重要组成部分，特别是对于认知行为疗法。在本文中，我们提出了ERD，通过额外模块的（1）提取与认知失调相关的部分和（2）通过多个代理人进行推理步骤的辩论，提高了基于LLM的认知失调分类性能。我们在一个公共数据集上的实验结果显示，ERD提高了多类F1分数以及二元特异性分数。关于后者的分数，我们的方法在向LLMs提供多代理人辩论摘要时有效地消除了基准方法的偏见，尤其是当该摘要被提供给LLMs时。",
    "tldr": "ERD提出了一个框架，通过提取与认知失调相关的部分和通过多个代理人进行推理步骤的辩论，改进了基于LLM的认知失调分类性能。"
}