{
    "title": "LocalRQA: From Generating Data to Locally Training, Testing, and Deploying Retrieval-Augmented QA Systems",
    "abstract": "arXiv:2403.00982v1 Announce Type: new  Abstract: Retrieval-augmented question-answering systems combine retrieval techniques with large language models to provide answers that are more accurate and informative. Many existing toolkits allow users to quickly build such systems using off-the-shelf models, but they fall short in supporting researchers and developers to customize the model training, testing, and deployment process. We propose LocalRQA, an open-source toolkit that features a wide selection of model training algorithms, evaluation methods, and deployment tools curated from the latest research. As a showcase, we build QA systems using online documentation obtained from Databricks and Faire's websites. We find 7B-models trained and deployed using LocalRQA reach a similar performance compared to using OpenAI's text-ada-002 and GPT-4-turbo.",
    "link": "https://arxiv.org/abs/2403.00982",
    "context": "Title: LocalRQA: From Generating Data to Locally Training, Testing, and Deploying Retrieval-Augmented QA Systems\nAbstract: arXiv:2403.00982v1 Announce Type: new  Abstract: Retrieval-augmented question-answering systems combine retrieval techniques with large language models to provide answers that are more accurate and informative. Many existing toolkits allow users to quickly build such systems using off-the-shelf models, but they fall short in supporting researchers and developers to customize the model training, testing, and deployment process. We propose LocalRQA, an open-source toolkit that features a wide selection of model training algorithms, evaluation methods, and deployment tools curated from the latest research. As a showcase, we build QA systems using online documentation obtained from Databricks and Faire's websites. We find 7B-models trained and deployed using LocalRQA reach a similar performance compared to using OpenAI's text-ada-002 and GPT-4-turbo.",
    "path": "papers/24/03/2403.00982.json",
    "total_tokens": 862,
    "translated_title": "从生成数据到本地训练、测试和部署检索增强问答系统的LocalRQA",
    "translated_abstract": "检索增强问答系统将检索技术与大型语言模型相结合，提供更准确和丰富信息的答案。许多现有工具包允许用户使用现成模型快速构建这种系统，但在支持研究人员和开发人员定制模型训练、测试和部署过程方面表现不佳。我们提出了一种名为LocalRQA的开源工具包，其中包含了从最新研究中精选的多种模型训练算法、评估方法和部署工具。作为一个展示，我们使用从Databricks和Faire网站获取的在线文档构建问答系统。我们发现使用LocalRQA训练和部署的7B模型在性能上与使用OpenAI的text-ada-002和GPT-4-turbo相当。",
    "tldr": "LocalRQA是一个开源工具包，提供多种模型训练算法、评估方法和部署工具，用于构建检索增强问答系统，其训练和部署的模型性能与使用OpenAI的text-ada-002和GPT-4-turbo相当。",
    "en_tdlr": "LocalRQA is an open-source toolkit that offers a wide selection of model training algorithms, evaluation methods, and deployment tools for building retrieval-augmented question-answering systems, with models trained and deployed using LocalRQA reaching a similar performance compared to using OpenAI's text-ada-002 and GPT-4-turbo."
}