{
    "title": "SAR-AE-SFP: SAR Imagery Adversarial Example in Real Physics domain with Target Scattering Feature Parameters",
    "abstract": "arXiv:2403.01210v1 Announce Type: cross  Abstract: Deep neural network-based Synthetic Aperture Radar (SAR) target recognition models are susceptible to adversarial examples. Current adversarial example generation methods for SAR imagery primarily operate in the 2D digital domain, known as image adversarial examples. Recent work, while considering SAR imaging scatter mechanisms, fails to account for the actual imaging process, rendering attacks in the three-dimensional physical domain infeasible, termed pseudo physics adversarial examples. To address these challenges, this paper proposes SAR-AE-SFP-Attack, a method to generate real physics adversarial examples by altering the scattering feature parameters of target objects. Specifically, we iteratively optimize the coherent energy accumulation of the target echo by perturbing the reflection coefficient and scattering coefficient in the scattering feature parameters of the three-dimensional target object, and obtain the adversarial exam",
    "link": "https://arxiv.org/abs/2403.01210",
    "context": "Title: SAR-AE-SFP: SAR Imagery Adversarial Example in Real Physics domain with Target Scattering Feature Parameters\nAbstract: arXiv:2403.01210v1 Announce Type: cross  Abstract: Deep neural network-based Synthetic Aperture Radar (SAR) target recognition models are susceptible to adversarial examples. Current adversarial example generation methods for SAR imagery primarily operate in the 2D digital domain, known as image adversarial examples. Recent work, while considering SAR imaging scatter mechanisms, fails to account for the actual imaging process, rendering attacks in the three-dimensional physical domain infeasible, termed pseudo physics adversarial examples. To address these challenges, this paper proposes SAR-AE-SFP-Attack, a method to generate real physics adversarial examples by altering the scattering feature parameters of target objects. Specifically, we iteratively optimize the coherent energy accumulation of the target echo by perturbing the reflection coefficient and scattering coefficient in the scattering feature parameters of the three-dimensional target object, and obtain the adversarial exam",
    "path": "papers/24/03/2403.01210.json",
    "total_tokens": 897,
    "translated_title": "SAR-AE-SFP: 具有目标散射特征参数的实际物理领域合成孔径雷达（SAR）图像对抗样本",
    "translated_abstract": "arXiv:2403.01210v1 通告类型: 交叉 深度神经网络的合成孔径雷达（SAR）目标识别模型容易受到对抗样本的影响。当前针对SAR图像的对抗样本生成方法主要在二维数字领域中运行，被称为图像对抗样本。最近的工作在考虑SAR成像散射机制的同时，未能考虑实际成像过程，导致在三维物理领域中攻击不可行，称为伪物理对抗样本。为解决这些挑战，本文提出了SAR-AE-SFP-Attack，一种通过改变目标物体的散射特征参数生成真实物理对抗样本的方法。具体来说，我们通过扰动目标物体的散射特征参数中的反射系数和散射系数，迭代优化目标回波的一致能量积累，并获得对抗性样本。",
    "tldr": "该研究提出了一种通过改变目标物体的散射特征参数生成真实物理对抗样本的方法，解决了合成孔径雷达目标识别模型受到对抗样本影响的挑战。",
    "en_tdlr": "This paper proposes a method to generate real physics adversarial examples by altering the scattering feature parameters of target objects, addressing the challenge of adversarial impact on Synthetic Aperture Radar target recognition models."
}