{
    "title": "tLaSDI: Thermodynamics-informed latent space dynamics identification",
    "abstract": "arXiv:2403.05848v1 Announce Type: new  Abstract: We propose a data-driven latent space dynamics identification method (tLaSDI) that embeds the first and second principles of thermodynamics. The latent variables are learned through an autoencoder as a nonlinear dimension reduction model. The dynamics of the latent variables are constructed by a neural network-based model that preserves certain structures to respect the thermodynamic laws through the GENERIC formalism. An abstract error estimate of the approximation is established, which provides a new loss formulation involving the Jacobian computation of autoencoder. Both the autoencoder and the latent dynamics are trained to minimize the new loss. Numerical examples are presented to demonstrate the performance of tLaSDI, which exhibits robust generalization ability, even in extrapolation. In addition, an intriguing correlation is empirically observed between the entropy production rates in the latent space and the behaviors of the ful",
    "link": "https://arxiv.org/abs/2403.05848",
    "context": "Title: tLaSDI: Thermodynamics-informed latent space dynamics identification\nAbstract: arXiv:2403.05848v1 Announce Type: new  Abstract: We propose a data-driven latent space dynamics identification method (tLaSDI) that embeds the first and second principles of thermodynamics. The latent variables are learned through an autoencoder as a nonlinear dimension reduction model. The dynamics of the latent variables are constructed by a neural network-based model that preserves certain structures to respect the thermodynamic laws through the GENERIC formalism. An abstract error estimate of the approximation is established, which provides a new loss formulation involving the Jacobian computation of autoencoder. Both the autoencoder and the latent dynamics are trained to minimize the new loss. Numerical examples are presented to demonstrate the performance of tLaSDI, which exhibits robust generalization ability, even in extrapolation. In addition, an intriguing correlation is empirically observed between the entropy production rates in the latent space and the behaviors of the ful",
    "path": "papers/24/03/2403.05848.json",
    "total_tokens": 938,
    "translated_title": "tLaSDI: 热力学信息驱动的潜空间动力学识别",
    "translated_abstract": "我们提出了一种数据驱动的潜空间动力学识别方法（tLaSDI），该方法融入了热力学的第一和第二定律。通过自动编码器学习潜变量作为非线性降维模型。潜变量的动力学由基于神经网络的模型构建，通过通用形式主义保留某些结构以尊重热力学定律。建立了对近似值的抽象误差估计，提供了涉及自动编码器雅可比计算的新损失制定。自动编码器和潜动态都经过训练以最小化新的损失。展示了数值示例以演示tLaSDI的性能，即使在外推情况下也表现出稳健的泛化能力。此外，在潜空间中观察到了熵产生速率与完整行为之间的有趣相关性。",
    "tldr": "提出了一种融合热力学定律的数据驱动潜空间动力学识别方法，通过自动编码器学习潜变量并构建动力学模型，实现对热力学定律的遵守，并通过新的损失函数进行训练。演示了其在稳健泛化能力方面的表现，以及在潜空间中熵产生速率与系统行为之间的相关性。",
    "en_tdlr": "A data-driven latent space dynamics identification method incorporating the laws of thermodynamics is proposed, where latent variables are learned through an autoencoder and dynamical models are built to respect thermodynamic laws, trained with a new loss formulation. Its robust generalization ability and intriguing correlation between entropy production rates and system behaviors in the latent space are demonstrated."
}