{
    "title": "COMPRER: A Multimodal Multi-Objective Pretraining Framework for Enhanced Medical Image Representation",
    "abstract": "arXiv:2403.09672v1 Announce Type: cross  Abstract: Substantial advances in multi-modal Artificial Intelligence (AI) facilitate the combination of diverse medical modalities to achieve holistic health assessments. We present COMPRER , a novel multi-modal, multi-objective pretraining framework which enhances medical-image representation, diagnostic inferences, and prognosis of diseases. COMPRER employs a multi-objective training framework, where each objective introduces distinct knowledge to the model. This includes a multimodal loss that consolidates information across different imaging modalities; A temporal loss that imparts the ability to discern patterns over time; Medical-measure prediction adds appropriate medical insights; Lastly, reconstruction loss ensures the integrity of image structure within the latent space. Despite the concern that multiple objectives could weaken task performance, our findings show that this combination actually boosts outcomes on certain tasks. Here, w",
    "link": "https://arxiv.org/abs/2403.09672",
    "context": "Title: COMPRER: A Multimodal Multi-Objective Pretraining Framework for Enhanced Medical Image Representation\nAbstract: arXiv:2403.09672v1 Announce Type: cross  Abstract: Substantial advances in multi-modal Artificial Intelligence (AI) facilitate the combination of diverse medical modalities to achieve holistic health assessments. We present COMPRER , a novel multi-modal, multi-objective pretraining framework which enhances medical-image representation, diagnostic inferences, and prognosis of diseases. COMPRER employs a multi-objective training framework, where each objective introduces distinct knowledge to the model. This includes a multimodal loss that consolidates information across different imaging modalities; A temporal loss that imparts the ability to discern patterns over time; Medical-measure prediction adds appropriate medical insights; Lastly, reconstruction loss ensures the integrity of image structure within the latent space. Despite the concern that multiple objectives could weaken task performance, our findings show that this combination actually boosts outcomes on certain tasks. Here, w",
    "path": "papers/24/03/2403.09672.json",
    "total_tokens": 832,
    "translated_title": "COMPRER：增强医学图像表征的多模态多目标预训练框架",
    "translated_abstract": "多模态人工智能（AI）的实质性进展促进了将不同医学模态相结合以实现整体健康评估。我们提出了COMPRER，一个新颖的多模态、多目标预训练框架，可以增强医学图像表征、诊断推断和疾病预后。COMPRER采用多目标训练框架，其中每个目标向模型引入不同的知识。其中包括整合不同成像模态信息的多模态损失；赋予模型识别时间模式的时间损失；添加适当的医学洞见的医学测量预测；最后，通过重建损失保证潜在空间内的图像结构完整性。尽管存在多个目标可能削弱任务性能的担忧，但我们的研究结果表明，这种组合实际上提高了特定任务的结果。",
    "tldr": "COMPRER提出了一种新颖的多模态、多目标预训练框架，可以增强医学图像表征，并通过多目标训练提高了特定任务的结果。",
    "en_tdlr": "COMPRER proposes a novel multimodal, multi-objective pretraining framework for enhanced medical image representation, which boosts outcomes on certain tasks through multi-objective training."
}