{
    "title": "TGPT-PINN: Nonlinear model reduction with transformed GPT-PINNs",
    "abstract": "arXiv:2403.03459v1 Announce Type: cross  Abstract: We introduce the Transformed Generative Pre-Trained Physics-Informed Neural Networks (TGPT-PINN) for accomplishing nonlinear model order reduction (MOR) of transport-dominated partial differential equations in an MOR-integrating PINNs framework. Building on the recent development of the GPT-PINN that is a network-of-networks design achieving snapshot-based model reduction, we design and test a novel paradigm for nonlinear model reduction that can effectively tackle problems with parameter-dependent discontinuities. Through incorporation of a shock-capturing loss function component as well as a parameter-dependent transform layer, the TGPT-PINN overcomes the limitations of linear model reduction in the transport-dominated regime. We demonstrate this new capability for nonlinear model reduction in the PINNs framework by several nontrivial parametric partial differential equations.",
    "link": "https://arxiv.org/abs/2403.03459",
    "context": "Title: TGPT-PINN: Nonlinear model reduction with transformed GPT-PINNs\nAbstract: arXiv:2403.03459v1 Announce Type: cross  Abstract: We introduce the Transformed Generative Pre-Trained Physics-Informed Neural Networks (TGPT-PINN) for accomplishing nonlinear model order reduction (MOR) of transport-dominated partial differential equations in an MOR-integrating PINNs framework. Building on the recent development of the GPT-PINN that is a network-of-networks design achieving snapshot-based model reduction, we design and test a novel paradigm for nonlinear model reduction that can effectively tackle problems with parameter-dependent discontinuities. Through incorporation of a shock-capturing loss function component as well as a parameter-dependent transform layer, the TGPT-PINN overcomes the limitations of linear model reduction in the transport-dominated regime. We demonstrate this new capability for nonlinear model reduction in the PINNs framework by several nontrivial parametric partial differential equations.",
    "path": "papers/24/03/2403.03459.json",
    "total_tokens": 812,
    "translated_title": "TGPT-PINN：具有转换GPT-PINNs的非线性模型缩减",
    "translated_abstract": "我们引入了转换生成预训练物理信息神经网络（TGPT-PINN），用于在MOR整合PINNs框架中完成传输主导偏微分方程的非线性模型阶减。在最近开发的GPT-PINN的基础上，GPT-PINN是一种实现基于快照的模型缩减的网络结构设计，我们设计并测试了一种新颖的非线性模型减范例，可以有效处理具有参数依赖性间断的问题。通过纳入捕获冲击的损失函数分量以及参数依赖的变换层，TGPT-PINN克服了传输主导区域中线性模型减的限制。我们通过几个非平凡参数偏微分方程在PINNs框架中展示了这种新的非线性模型缩减能力。",
    "tldr": "TGPT-PINN通过引入转换层和捕获冲击损失函数组件，在PINNs框架中实现了非线性模型的缩减，有效解决了具有参数依赖性间断的问题。",
    "en_tdlr": "TGPT-PINN achieves nonlinear model reduction in the PINNs framework by introducing a transformation layer and a shock-capturing loss function component, effectively addressing problems with parameter-dependent discontinuities."
}