{
    "title": "A Tulu Resource for Machine Translation",
    "abstract": "arXiv:2403.19142v1 Announce Type: new  Abstract: We present the first parallel dataset for English-Tulu translation. Tulu, classified within the South Dravidian linguistic family branch, is predominantly spoken by approximately 2.5 million individuals in southwestern India. Our dataset is constructed by integrating human translations into the multilingual machine translation resource FLORES-200. Furthermore, we use this dataset for evaluation purposes in developing our English-Tulu machine translation model. For the model's training, we leverage resources available for related South Dravidian languages. We adopt a transfer learning approach that exploits similarities between high-resource and low-resource languages. This method enables the training of a machine translation system even in the absence of parallel data between the source and target language, thereby overcoming a significant obstacle in machine translation development for low-resource languages. Our English-Tulu system, tr",
    "link": "https://arxiv.org/abs/2403.19142",
    "context": "Title: A Tulu Resource for Machine Translation\nAbstract: arXiv:2403.19142v1 Announce Type: new  Abstract: We present the first parallel dataset for English-Tulu translation. Tulu, classified within the South Dravidian linguistic family branch, is predominantly spoken by approximately 2.5 million individuals in southwestern India. Our dataset is constructed by integrating human translations into the multilingual machine translation resource FLORES-200. Furthermore, we use this dataset for evaluation purposes in developing our English-Tulu machine translation model. For the model's training, we leverage resources available for related South Dravidian languages. We adopt a transfer learning approach that exploits similarities between high-resource and low-resource languages. This method enables the training of a machine translation system even in the absence of parallel data between the source and target language, thereby overcoming a significant obstacle in machine translation development for low-resource languages. Our English-Tulu system, tr",
    "path": "papers/24/03/2403.19142.json",
    "total_tokens": 824,
    "translated_title": "用于机器翻译的图鲁语资源",
    "translated_abstract": "我们呈现了第一个用于英语-图鲁语翻译的平行数据集。图鲁语属于南德拉维达语系，主要分布在印度西南部，约有250万人口。我们通过将人类翻译整合到多语种机器翻译资源FLORES-200中来构建我们的数据集。此外，我们利用该数据集来评估开发我们的英语-图鲁语机器翻译模型。在模型的训练中，我们利用了相关南德拉维达语言的资源。我们采用迁移学习方法，利用高资源语言和低资源语言之间的相似性。这种方法使得即使源语言和目标语言之间没有平行数据，也能训练出一个机器翻译系统，从而克服了低资源语言机器翻译开发中的一个重大障碍。我们的英语-图鲁语系统...",
    "tldr": "迁移学习方法使得即使源语言和目标语言之间没有平行数据，也能训练出一个机器翻译系统，从而克服了低资源语言机器翻译开发中的一个重大障碍。"
}