{
    "title": "StainFuser: Controlling Diffusion for Faster Neural Style Transfer in Multi-Gigapixel Histology Images",
    "abstract": "arXiv:2403.09302v1 Announce Type: cross  Abstract: Stain normalization algorithms aim to transform the color and intensity characteristics of a source multi-gigapixel histology image to match those of a target image, mitigating inconsistencies in the appearance of stains used to highlight cellular components in the images. We propose a new approach, StainFuser, which treats this problem as a style transfer task using a novel Conditional Latent Diffusion architecture, eliminating the need for handcrafted color components. With this method, we curate SPI-2M the largest stain normalization dataset to date of over 2 million histology images with neural style transfer for high-quality transformations. Trained on this data, StainFuser outperforms current state-of-the-art GAN and handcrafted methods in terms of the quality of normalized images. Additionally, compared to existing approaches, it improves the performance of nuclei instance segmentation and classification models when used as a te",
    "link": "https://arxiv.org/abs/2403.09302",
    "context": "Title: StainFuser: Controlling Diffusion for Faster Neural Style Transfer in Multi-Gigapixel Histology Images\nAbstract: arXiv:2403.09302v1 Announce Type: cross  Abstract: Stain normalization algorithms aim to transform the color and intensity characteristics of a source multi-gigapixel histology image to match those of a target image, mitigating inconsistencies in the appearance of stains used to highlight cellular components in the images. We propose a new approach, StainFuser, which treats this problem as a style transfer task using a novel Conditional Latent Diffusion architecture, eliminating the need for handcrafted color components. With this method, we curate SPI-2M the largest stain normalization dataset to date of over 2 million histology images with neural style transfer for high-quality transformations. Trained on this data, StainFuser outperforms current state-of-the-art GAN and handcrafted methods in terms of the quality of normalized images. Additionally, compared to existing approaches, it improves the performance of nuclei instance segmentation and classification models when used as a te",
    "path": "papers/24/03/2403.09302.json",
    "total_tokens": 929,
    "translated_title": "StainFuser：在多吉加像素组织学图像中控制扩散以加快神经风格迁移",
    "translated_abstract": "染色标准化算法旨在将源多吉加像素组织学图像的颜色和强度特征转换为与目标图像相匹配，从而减轻图像中用于突出显示细胞组分的染色剂外观的不一致性。我们提出了一种新方法，StainFuser，将这个问题视为一个风格迁移任务，使用一种新颖的条件潜在扩散架构，消除了手工制作颜色组分的需要。通过这种方法，我们为高质量转换筛选了迄今为止包含超过200万个组织学图像的最大染色标准化数据集SPI-2M，并进行了神经风格迁移训练。在这些数据上训练后，StainFuser在质量上优于当前最先进的GAN和手工制作方法的标准化图像。此外，与现有方法相比，在用作te时，它改善了细胞核实例分割和分类模型的性能",
    "tldr": "StainFuser提出了一种新颖的条件潜在扩散架构，将染色标准化问题视为风格迁移任务，无需手工制作颜色组分，在2百万多个组织学图像上训练的结果优于当前最先进的方法。",
    "en_tdlr": "StainFuser proposes a novel Conditional Latent Diffusion architecture to address stain normalization as a style transfer task, eliminating the need for handcrafted color components, and outperforms current state-of-the-art methods when trained on over 2 million histology images."
}