{
    "title": "Deep Clustering Evaluation: How to Validate Internal Clustering Validation Measures",
    "abstract": "arXiv:2403.14830v1 Announce Type: cross  Abstract: Deep clustering, a method for partitioning complex, high-dimensional data using deep neural networks, presents unique evaluation challenges. Traditional clustering validation measures, designed for low-dimensional spaces, are problematic for deep clustering, which involves projecting data into lower-dimensional embeddings before partitioning. Two key issues are identified: 1) the curse of dimensionality when applying these measures to raw data, and 2) the unreliable comparison of clustering results across different embedding spaces stemming from variations in training procedures and parameter settings in different clustering models. This paper addresses these challenges in evaluating clustering quality in deep learning. We present a theoretical framework to highlight ineffectiveness arising from using internal validation measures on raw and embedded data and propose a systematic approach to applying clustering validity indices in deep ",
    "link": "https://arxiv.org/abs/2403.14830",
    "context": "Title: Deep Clustering Evaluation: How to Validate Internal Clustering Validation Measures\nAbstract: arXiv:2403.14830v1 Announce Type: cross  Abstract: Deep clustering, a method for partitioning complex, high-dimensional data using deep neural networks, presents unique evaluation challenges. Traditional clustering validation measures, designed for low-dimensional spaces, are problematic for deep clustering, which involves projecting data into lower-dimensional embeddings before partitioning. Two key issues are identified: 1) the curse of dimensionality when applying these measures to raw data, and 2) the unreliable comparison of clustering results across different embedding spaces stemming from variations in training procedures and parameter settings in different clustering models. This paper addresses these challenges in evaluating clustering quality in deep learning. We present a theoretical framework to highlight ineffectiveness arising from using internal validation measures on raw and embedded data and propose a systematic approach to applying clustering validity indices in deep ",
    "path": "papers/24/03/2403.14830.json",
    "total_tokens": 832,
    "translated_title": "深度聚类评估：如何验证内部聚类有效性测量方法",
    "translated_abstract": "arXiv:2403.14830v1 通告类型：跨领域 摘要：深度聚类是一种使用深度神经网络对复杂、高维数据进行划分的方法，它面临着独特的评估挑战。传统的聚类验证方法，设计用于低维空间，对于涉及将数据投影到较低维嵌入空间后再进行划分的深度聚类来说是有问题的。论文确定了两个关键问题：1）在将这些方法应用于原始数据时的维度灾难，2）由于不同聚类模型的训练过程和参数设置的变化而导致不同嵌入空间中的聚类结果无法可靠比较。本文解决了在深度学习中评估聚类质量所面临的挑战。我们提出了一个理论框架来强调在原始数据和嵌入数据上使用内部验证方法可能出现的无效性，并提出了一种系统方法来应用深度聚类有效性指标。",
    "tldr": "本文解决了深度聚类方法在评估聚类质量时面临的挑战，提出了一种系统方法来应用聚类有效性指标。",
    "en_tdlr": "This paper addresses the challenges of evaluating clustering quality in deep learning, proposing a systematic approach for applying clustering validity indices."
}