{
    "title": "Recovering Latent Confounders from High-dimensional Proxy Variables",
    "abstract": "arXiv:2403.14228v1 Announce Type: cross  Abstract: Detecting latent confounders from proxy variables is an essential problem in causal effect estimation. Previous approaches are limited to low-dimensional proxies, sorted proxies, and binary treatments. We remove these assumptions and present a novel Proxy Confounder Factorization (PCF) framework for continuous treatment effect estimation when latent confounders manifest through high-dimensional, mixed proxy variables. For specific sample sizes, our two-step PCF implementation, using Independent Component Analysis (ICA-PCF), and the end-to-end implementation, using Gradient Descent (GD-PCF), achieve high correlation with the latent confounder and low absolute error in causal effect estimation with synthetic datasets in the high sample size regime. Even when faced with climate data, ICA-PCF recovers four components that explain $75.9\\%$ of the variance in the North Atlantic Oscillation, a known confounder of precipitation patterns in Eur",
    "link": "https://arxiv.org/abs/2403.14228",
    "context": "Title: Recovering Latent Confounders from High-dimensional Proxy Variables\nAbstract: arXiv:2403.14228v1 Announce Type: cross  Abstract: Detecting latent confounders from proxy variables is an essential problem in causal effect estimation. Previous approaches are limited to low-dimensional proxies, sorted proxies, and binary treatments. We remove these assumptions and present a novel Proxy Confounder Factorization (PCF) framework for continuous treatment effect estimation when latent confounders manifest through high-dimensional, mixed proxy variables. For specific sample sizes, our two-step PCF implementation, using Independent Component Analysis (ICA-PCF), and the end-to-end implementation, using Gradient Descent (GD-PCF), achieve high correlation with the latent confounder and low absolute error in causal effect estimation with synthetic datasets in the high sample size regime. Even when faced with climate data, ICA-PCF recovers four components that explain $75.9\\%$ of the variance in the North Atlantic Oscillation, a known confounder of precipitation patterns in Eur",
    "path": "papers/24/03/2403.14228.json",
    "total_tokens": 922,
    "translated_title": "从高维代理变量中恢复潜在潜在因素",
    "translated_abstract": "检测潜在潜伏者，从代理变量是因果效应估计中的一个重要问题。以前的方法局限于低维代理，排序代理和二元治疗。我们消除了这些假设，并提出了一个新颖的代理混淆因子分解 (PCF) 框架，用于连续处理效应估计，当潜在混淆因子通过高维，混合代理变量而显现。对于特定样本大小，我们的两步 PCF 实施，使用独立成分分析 (ICA-PCF) 和端到端实施，使用梯度下降 (GD-PCF)，在高样本大小范围内，与潜在混淆因子的相关性较高，因果效应估计的绝对误差较低。，利用合成数据。即使面对气候数据，ICA-PCF 恢复了解释欧洲降雨模式的 North Atlantic Oscillation $75.9\\%$ 方差的四个分量，一个已知的降水模式的混淆",
    "tldr": "提出了一种新颖的代理混淆因子分解 (PCF) 框架，用于处理高维混合代理变量来估计连续处理效应，实验证明在高样本大小情况下，该方法在因果效果估计中表现出较高的相关性和较低的误差。",
    "en_tdlr": "A novel Proxy Confounder Factorization (PCF) framework is proposed for continuous treatment effect estimation from high-dimensional mixed proxy variables, showing high correlation and low error in causal effect estimation in the high sample size regime."
}