{
    "title": "One flow to correct them all: improving simulations in high-energy physics with a single normalising flow and a switch",
    "abstract": "arXiv:2403.18582v1 Announce Type: cross  Abstract: Simulated events are key ingredients in almost all high-energy physics analyses. However, imperfections in the simulation can lead to sizeable differences between the observed data and simulated events. The effects of such mismodelling on relevant observables must be corrected either effectively via scale factors, with weights or by modifying the distributions of the observables and their correlations. We introduce a correction method that transforms one multidimensional distribution (simulation) into another one (data) using a simple architecture based on a single normalising flow with a boolean condition. We demonstrate the effectiveness of the method on a physics-inspired toy dataset with non-trivial mismodelling of several observables and their correlations.",
    "link": "https://arxiv.org/abs/2403.18582",
    "context": "Title: One flow to correct them all: improving simulations in high-energy physics with a single normalising flow and a switch\nAbstract: arXiv:2403.18582v1 Announce Type: cross  Abstract: Simulated events are key ingredients in almost all high-energy physics analyses. However, imperfections in the simulation can lead to sizeable differences between the observed data and simulated events. The effects of such mismodelling on relevant observables must be corrected either effectively via scale factors, with weights or by modifying the distributions of the observables and their correlations. We introduce a correction method that transforms one multidimensional distribution (simulation) into another one (data) using a simple architecture based on a single normalising flow with a boolean condition. We demonstrate the effectiveness of the method on a physics-inspired toy dataset with non-trivial mismodelling of several observables and their correlations.",
    "path": "papers/24/03/2403.18582.json",
    "total_tokens": 772,
    "translated_title": "用单一归一化流和一个开关改进高能物理模拟",
    "translated_abstract": "模拟事件是几乎所有高能物理分析中的关键要素。然而，模拟中的不完美可能导致观测数据和模拟事件之间存在相当大的差异。这种模拟不完全性对相关可观测量的影响必须通过比例因子、权重或修改可观测量及其相关性的分布来有效地进行校正。我们引入了一种校正方法，使用基于单一正常化流和布尔条件的简单架构将一个多维分布（模拟）转换为另一个多维分布（数据）。我们在一个受物理启发的玩具数据集上展示了该方法的有效性，该数据集存在几个可观测量及其相关性的非平凡模拟问题。",
    "tldr": "提出了一种使用单一归一化流和布尔条件的简单架构，将高能物理模拟事件的分布有效地转换为观测数据分布的校正方法，并在玩具数据集上证明了该方法的有效性",
    "en_tdlr": "Proposed a correction method using a single normalising flow with a boolean condition to effectively transform the distribution of simulated events in high-energy physics into that of observed data, demonstrated its effectiveness on a physics-inspired toy dataset with non-trivial mismodelling."
}