{
    "title": "Quantum Many-Body Physics Calculations with Large Language Models",
    "abstract": "arXiv:2403.03154v1 Announce Type: cross  Abstract: Large language models (LLMs) have demonstrated an unprecedented ability to perform complex tasks in multiple domains, including mathematical and scientific reasoning. We demonstrate that with carefully designed prompts, LLMs can accurately carry out key calculations in research papers in theoretical physics. We focus on a broadly used approximation method in quantum physics: the Hartree-Fock method, requiring an analytic multi-step calculation deriving approximate Hamiltonian and corresponding self-consistency equations. To carry out the calculations using LLMs, we design multi-step prompt templates that break down the analytic calculation into standardized steps with placeholders for problem-specific information. We evaluate GPT-4's performance in executing the calculation for 15 research papers from the past decade, demonstrating that, with correction of intermediate steps, it can correctly derive the final Hartree-Fock Hamiltonian i",
    "link": "https://arxiv.org/abs/2403.03154",
    "context": "Title: Quantum Many-Body Physics Calculations with Large Language Models\nAbstract: arXiv:2403.03154v1 Announce Type: cross  Abstract: Large language models (LLMs) have demonstrated an unprecedented ability to perform complex tasks in multiple domains, including mathematical and scientific reasoning. We demonstrate that with carefully designed prompts, LLMs can accurately carry out key calculations in research papers in theoretical physics. We focus on a broadly used approximation method in quantum physics: the Hartree-Fock method, requiring an analytic multi-step calculation deriving approximate Hamiltonian and corresponding self-consistency equations. To carry out the calculations using LLMs, we design multi-step prompt templates that break down the analytic calculation into standardized steps with placeholders for problem-specific information. We evaluate GPT-4's performance in executing the calculation for 15 research papers from the past decade, demonstrating that, with correction of intermediate steps, it can correctly derive the final Hartree-Fock Hamiltonian i",
    "path": "papers/24/03/2403.03154.json",
    "total_tokens": 759,
    "translated_title": "使用大型语言模型进行量子多体物理计算",
    "translated_abstract": "大型语言模型（LLMs）展示了在多个领域（包括数学和科学推理）执行复杂任务的前所未有能力。我们证明，通过精心设计的提示，LLMs可以准确地执行理论物理研究论文中的关键计算。我们专注于量子物理中广泛使用的近似方法：Hartree-Fock方法，该方法需要进行分析性的多步计算，导出近似哈密顿量和相应的自洽方程。为了使用LLMs进行计算，我们设计了多步提示模板，将分析计算拆分为标准步骤，并为问题特定信息留出占位符。我们评估了GPT-4在执行过去十年的15篇研究论文中的计算表现，结果表明，通过修正中间步骤，它可以正确地推导出最终的Hartree-Fock哈密顿量。",
    "tldr": "使用大型语言模型准确地执行理论物理研究论文中关键的Hartree-Fock方法计算。",
    "en_tdlr": "Accurately performing key Hartree-Fock method calculations in theoretical physics research papers using large language models."
}