{
    "title": "An Analysis of Linear Time Series Forecasting Models",
    "abstract": "arXiv:2403.14587v1 Announce Type: new  Abstract: Despite their simplicity, linear models perform well at time series forecasting, even when pitted against deeper and more expensive models. A number of variations to the linear model have been proposed, often including some form of feature normalisation that improves model generalisation. In this paper we analyse the sets of functions expressible using these linear model architectures. In so doing we show that several popular variants of linear models for time series forecasting are equivalent and functionally indistinguishable from standard, unconstrained linear regression. We characterise the model classes for each linear variant. We demonstrate that each model can be reinterpreted as unconstrained linear regression over a suitably augmented feature set, and therefore admit closed-form solutions when using a mean-squared loss function. We provide experimental evidence that the models under inspection learn nearly identical solutions, a",
    "link": "https://arxiv.org/abs/2403.14587",
    "context": "Title: An Analysis of Linear Time Series Forecasting Models\nAbstract: arXiv:2403.14587v1 Announce Type: new  Abstract: Despite their simplicity, linear models perform well at time series forecasting, even when pitted against deeper and more expensive models. A number of variations to the linear model have been proposed, often including some form of feature normalisation that improves model generalisation. In this paper we analyse the sets of functions expressible using these linear model architectures. In so doing we show that several popular variants of linear models for time series forecasting are equivalent and functionally indistinguishable from standard, unconstrained linear regression. We characterise the model classes for each linear variant. We demonstrate that each model can be reinterpreted as unconstrained linear regression over a suitably augmented feature set, and therefore admit closed-form solutions when using a mean-squared loss function. We provide experimental evidence that the models under inspection learn nearly identical solutions, a",
    "path": "papers/24/03/2403.14587.json",
    "total_tokens": 810,
    "translated_title": "线性时间序列预测模型分析",
    "translated_abstract": "尽管简单，线性模型在时间序列预测中表现良好，即使与更深层次和更昂贵的模型进行对比也是如此。已经提出了许多线性模型的变体，通常包括某种形式的特征规范化，可以改善模型的泛化能力。在本文中，我们分析了使用这些线性模型架构可以表达的函数集合。通过这样做，我们展示了几种流行的线性时间序列预测模型变体等效，并在功能上无法区分标准的非约束线性回归。我们为每种线性变体描述了模型类别。我们证明了每个模型都可以重新解释为在适当扩充的特征集上的非约束线性回归，因此在使用均方损失函数时可以得到封闭形式的解决方案。我们提供实验证据表明，待检查的模型学习到了几乎相同的解决方案。",
    "tldr": "分析了线性时间序列预测模型，证明了几种流行的线性模型变体等效于标准的线性回归，提供了实验证据支持这一结论。",
    "en_tdlr": "Analyzed linear time series forecasting models, demonstrated equivalence of popular linear model variants to standard linear regression, and provided experimental evidence to support this conclusion."
}