{
    "title": "ILPO-NET: Network for the invariant recognition of arbitrary volumetric patterns in 3D",
    "abstract": "arXiv:2403.19612v1 Announce Type: cross  Abstract: Effective recognition of spatial patterns and learning their hierarchy is crucial in modern spatial data analysis. Volumetric data applications seek techniques ensuring invariance not only to shifts but also to pattern rotations. While traditional methods can readily achieve translational invariance, rotational invariance possesses multiple challenges and remains an active area of research. Here, we present ILPO-Net (Invariant to Local Patterns Orientation Network), a novel approach that handles arbitrarily shaped patterns with the convolutional operation inherently invariant to local spatial pattern orientations using the Wigner matrix expansions. Our architecture seamlessly integrates the new convolution operator and, when benchmarked on diverse volumetric datasets such as MedMNIST and CATH, demonstrates superior performance over the baselines with significantly reduced parameter counts - up to 1000 times fewer in the case of MedMNIS",
    "link": "https://arxiv.org/abs/2403.19612",
    "context": "Title: ILPO-NET: Network for the invariant recognition of arbitrary volumetric patterns in 3D\nAbstract: arXiv:2403.19612v1 Announce Type: cross  Abstract: Effective recognition of spatial patterns and learning their hierarchy is crucial in modern spatial data analysis. Volumetric data applications seek techniques ensuring invariance not only to shifts but also to pattern rotations. While traditional methods can readily achieve translational invariance, rotational invariance possesses multiple challenges and remains an active area of research. Here, we present ILPO-Net (Invariant to Local Patterns Orientation Network), a novel approach that handles arbitrarily shaped patterns with the convolutional operation inherently invariant to local spatial pattern orientations using the Wigner matrix expansions. Our architecture seamlessly integrates the new convolution operator and, when benchmarked on diverse volumetric datasets such as MedMNIST and CATH, demonstrates superior performance over the baselines with significantly reduced parameter counts - up to 1000 times fewer in the case of MedMNIS",
    "path": "papers/24/03/2403.19612.json",
    "total_tokens": 794,
    "translated_title": "ILPO-NET：用于三维中任意体积模式不变识别的网络",
    "translated_abstract": "现代空间数据分析中，有效识别空间模式并学习其层次结构至关重要。体积数据应用寻求确保对位移和模式旋转均具有不变性的技术。ILPO-Net（Invariant to Local Patterns Orientation Network）是一种新颖方法，通过Wigner矩阵展开，在卷积操作中处理任意形状的模式，从而本质上对局部空间模式方向具有不变性。我们的架构无缝集成了新的卷积运算符，在各种体积数据集（如MedMNIST和CATH）上进行基准测试，表现出比基准线更卓越的性能，并且参数数量显著减少 - 在MedMNIST的情况下减少了高达1000倍。",
    "tldr": "ILPO-Net是一种处理任意形状模式的新方法，通过卷积运算对局部空间模式方向具有不变性，在各种体积数据集上展现出优越性能并显著减少参数数量。"
}