{
    "title": "Misinformation is not about Bad Facts: An Analysis of the Production and Consumption of Fringe Content",
    "abstract": "arXiv:2403.08391v1 Announce Type: new  Abstract: What if misinformation is not an information problem at all? Our findings suggest that online fringe ideologies spread through the use of content that is consensus-based and \"factually correct\". We found that Australian news publishers with both moderate and far-right political leanings contain comparable levels of information completeness and quality; and furthermore, that far-right Twitter users often share from moderate sources. However, a stark difference emerges when we consider two additional factors: 1) the narrow topic selection of articles by far-right users, suggesting that they cherrypick only news articles that engage with specific topics of their concern, and 2) the difference between moderate and far-right publishers when we examine the writing style of their articles. Furthermore, we can even identify users prone to sharing misinformation based on their communication style. These findings have important implications for co",
    "link": "https://arxiv.org/abs/2403.08391",
    "context": "Title: Misinformation is not about Bad Facts: An Analysis of the Production and Consumption of Fringe Content\nAbstract: arXiv:2403.08391v1 Announce Type: new  Abstract: What if misinformation is not an information problem at all? Our findings suggest that online fringe ideologies spread through the use of content that is consensus-based and \"factually correct\". We found that Australian news publishers with both moderate and far-right political leanings contain comparable levels of information completeness and quality; and furthermore, that far-right Twitter users often share from moderate sources. However, a stark difference emerges when we consider two additional factors: 1) the narrow topic selection of articles by far-right users, suggesting that they cherrypick only news articles that engage with specific topics of their concern, and 2) the difference between moderate and far-right publishers when we examine the writing style of their articles. Furthermore, we can even identify users prone to sharing misinformation based on their communication style. These findings have important implications for co",
    "path": "papers/24/03/2403.08391.json",
    "total_tokens": 895,
    "translated_title": "虚假信息不是关于错误事实：对边缘内容的生产和消费进行分析",
    "translated_abstract": "如果误传根本不是一个信息问题呢？我们的研究发现，在线边缘意识形态通过一种基于共识和“事实正确”的内容传播。我们发现，具有中间和极右政治倾向的澳大利亚新闻出版商在信息完整性和质量方面居于可比水平；此外，极右翼Twitter用户经常分享来自中间来源的内容。然而，当我们考虑到两个额外因素时，出现了明显差异：1）极右用户对文章的狭隘主题选择，暗示他们只挑选与他们关注特定主题的新闻文章，2）在审查文章写作风格时，中间和极右出版商之间的巨大差异。此外，我们甚至可以根据用户的沟通风格识别易于分享错误信息的用户。这些发现对于合作方面有重要的启示。",
    "tldr": "虚假信息不仅仅涉及错误的事实，研究发现在线边缘意识形态通过共识和“事实正确”的内容传播，同时发现了极右用户倾向挑选关注特定主题的新闻，并且可以根据用户的沟通风格识别易于分享错误信息的用户。",
    "en_tdlr": "Misinformation is not just about wrong facts, findings suggest that online fringe ideologies spread through consensus-based and \"factually correct\" content, revealing that far-right users tend to cherry-pick news articles related to specific topics, and users prone to sharing misinformation can be identified based on their communication style."
}