{
    "title": "Cloud-based Federated Learning Framework for MRI Segmentation",
    "abstract": "arXiv:2403.00254v1 Announce Type: cross  Abstract: In contemporary rural healthcare settings, the principal challenge in diagnosing brain images is the scarcity of available data, given that most of the existing deep learning models demand extensive training data to optimize their performance, necessitating centralized processing methods that potentially compromise data privacy. This paper proposes a novel framework tailored for brain tissue segmentation in rural healthcare facilities. The framework employs a deep reinforcement learning (DRL) environment in tandem with a refinement model (RM) deployed locally at rural healthcare sites. The proposed DRL model has a reduced parameter count and practicality for implementation across distributed rural sites. To uphold data privacy and enhance model generalization without transgressing privacy constraints, we employ federated learning (FL) for cooperative model training. We demonstrate the efficacy of our approach by training the network wi",
    "link": "https://arxiv.org/abs/2403.00254",
    "context": "Title: Cloud-based Federated Learning Framework for MRI Segmentation\nAbstract: arXiv:2403.00254v1 Announce Type: cross  Abstract: In contemporary rural healthcare settings, the principal challenge in diagnosing brain images is the scarcity of available data, given that most of the existing deep learning models demand extensive training data to optimize their performance, necessitating centralized processing methods that potentially compromise data privacy. This paper proposes a novel framework tailored for brain tissue segmentation in rural healthcare facilities. The framework employs a deep reinforcement learning (DRL) environment in tandem with a refinement model (RM) deployed locally at rural healthcare sites. The proposed DRL model has a reduced parameter count and practicality for implementation across distributed rural sites. To uphold data privacy and enhance model generalization without transgressing privacy constraints, we employ federated learning (FL) for cooperative model training. We demonstrate the efficacy of our approach by training the network wi",
    "path": "papers/24/03/2403.00254.json",
    "total_tokens": 865,
    "translated_title": "基于云的MRI分割联邦学习框架",
    "translated_abstract": "在当代农村医疗环境中，诊断脑部图像的主要挑战是数据稀缺，因为大多数现有的深度学习模型需要大量的训练数据来优化其性能，这需要中心化处理方法，可能会损害数据隐私。本文提出了一个针对农村医疗设施的脑组织分割的新颖框架。该框架同时使用了深度强化学习（DRL）环境和在农村医疗网站本地部署的精调模型（RM）。所提出的DRL模型具有较少的参数数量，并且适用于在分布式农村站点上实现。为了维护数据隐私并增强模型的泛化能力，我们采用联邦学习（FL）进行合作模型训练。我们通过训练网络来展示我们方法的有效性",
    "tldr": "提出了一个针对农村医疗环境的脑组织分割的新型框架，结合了深度强化学习环境和本地的精调模型，采用联邦学习进行模型训练，以维护数据隐私并增强模型泛化能力。",
    "en_tdlr": "This paper presents a novel framework for brain tissue segmentation in rural healthcare facilities, utilizing a combination of deep reinforcement learning environment and local refinement model, while employing federated learning for model training to maintain data privacy and enhance model generalization."
}