{
    "title": "Statistical Mechanics of Dynamical System Identification",
    "abstract": "arXiv:2403.01723v1 Announce Type: cross  Abstract: Recovering dynamical equations from observed noisy data is the central challenge of system identification. We develop a statistical mechanical approach to analyze sparse equation discovery algorithms, which typically balance data fit and parsimony through a trial-and-error selection of hyperparameters. In this framework, statistical mechanics offers tools to analyze the interplay between complexity and fitness, in analogy to that done between entropy and energy. To establish this analogy, we define the optimization procedure as a two-level Bayesian inference problem that separates variable selection from coefficient values and enables the computation of the posterior parameter distribution in closed form. A key advantage of employing statistical mechanical concepts, such as free energy and the partition function, is in the quantification of uncertainty, especially in in the low-data limit; frequently encountered in real-world applicati",
    "link": "https://arxiv.org/abs/2403.01723",
    "context": "Title: Statistical Mechanics of Dynamical System Identification\nAbstract: arXiv:2403.01723v1 Announce Type: cross  Abstract: Recovering dynamical equations from observed noisy data is the central challenge of system identification. We develop a statistical mechanical approach to analyze sparse equation discovery algorithms, which typically balance data fit and parsimony through a trial-and-error selection of hyperparameters. In this framework, statistical mechanics offers tools to analyze the interplay between complexity and fitness, in analogy to that done between entropy and energy. To establish this analogy, we define the optimization procedure as a two-level Bayesian inference problem that separates variable selection from coefficient values and enables the computation of the posterior parameter distribution in closed form. A key advantage of employing statistical mechanical concepts, such as free energy and the partition function, is in the quantification of uncertainty, especially in in the low-data limit; frequently encountered in real-world applicati",
    "path": "papers/24/03/2403.01723.json",
    "total_tokens": 791,
    "translated_title": "动力学系统识别的统计力学",
    "translated_abstract": "从观测到的噪声数据中恢复动力学方程是系统识别的核心挑战。我们发展了一种统计力学方法来分析稀疏方程发现算法，这些算法通常通过对超参数的试错选择平衡数据拟合和简洁性。在这个框架中，统计力学提供了分析复杂性和适应性之间相互作用的工具，类似于熵与能量之间的分析。为了建立这种类比，我们将优化过程定义为一个将变量选择与系数值分开的两级贝叶斯推断问题，并使得后验参数分布可以以闭式形式计算。采用统计力学概念（如自由能和配分函数）的一个关键优势在于在低数据极限中量化不确定性，这在真实世界应用中经常遇到。",
    "tldr": "统计力学提供了一种稀疏方程发现算法的分析方法，通过两级贝叶斯推断问题来平衡数据拟合和简洁性，特别在低数据极限中能够量化不确定性。",
    "en_tdlr": "Statistical mechanics offers an analysis approach for sparse equation discovery algorithms, balancing data fit and parsimony through a two-level Bayesian inference problem, particularly quantifying uncertainty in the low-data limit."
}