{
    "title": "Understanding Subjectivity through the Lens of Motivational Context in Model-Generated Image Satisfaction",
    "abstract": "arXiv:2403.05576v1 Announce Type: cross  Abstract: Image generation models are poised to become ubiquitous in a range of applications. These models are often fine-tuned and evaluated using human quality judgments that assume a universal standard, failing to consider the subjectivity of such tasks. To investigate how to quantify subjectivity, and the scale of its impact, we measure how assessments differ among human annotators across different use cases. Simulating the effects of ordinarily latent elements of annotators subjectivity, we contrive a set of motivations (t-shirt graphics, presentation visuals, and phone background images) to contextualize a set of crowdsourcing tasks. Our results show that human evaluations of images vary within individual contexts and across combinations of contexts. Three key factors affecting this subjectivity are image appearance, image alignment with text, and representation of objects mentioned in the text. Our study highlights the importance of takin",
    "link": "https://arxiv.org/abs/2403.05576",
    "context": "Title: Understanding Subjectivity through the Lens of Motivational Context in Model-Generated Image Satisfaction\nAbstract: arXiv:2403.05576v1 Announce Type: cross  Abstract: Image generation models are poised to become ubiquitous in a range of applications. These models are often fine-tuned and evaluated using human quality judgments that assume a universal standard, failing to consider the subjectivity of such tasks. To investigate how to quantify subjectivity, and the scale of its impact, we measure how assessments differ among human annotators across different use cases. Simulating the effects of ordinarily latent elements of annotators subjectivity, we contrive a set of motivations (t-shirt graphics, presentation visuals, and phone background images) to contextualize a set of crowdsourcing tasks. Our results show that human evaluations of images vary within individual contexts and across combinations of contexts. Three key factors affecting this subjectivity are image appearance, image alignment with text, and representation of objects mentioned in the text. Our study highlights the importance of takin",
    "path": "papers/24/03/2403.05576.json",
    "total_tokens": 933,
    "translated_title": "通过激励背景理解模型生成图像满意度中的主观性",
    "translated_abstract": "图像生成模型在各种应用中都有望成为普遍存在。这些模型通常通过人类的质量评价进行微调和评估，而这些评价假定了一个普遍标准，未能考虑到这类任务的主观性。为了研究如何量化主观性及其影响规模，我们测量了不同使用情况下人类注释者的评估差异。通过模拟注释者主观性原本的潜在因素的影响，我们设计了一组动机（T恤图案、演示文稿视觉和手机背景图像）来为一组众包任务提供语境。我们的研究结果表明，图像的人类评估在不同语境中有所不同，以及不同语境组合之间也有所差异。影响这种主观性的三个关键因素是图像外观、图像与文本的对齐以及文本中提及的对象的表现。我们的研究凸显了考虑主观性重要性，并强调了获取主观性数据以提高模型性能的重要性。",
    "tldr": "通过模拟不同激励背景下的主观性因素，研究发现在评估图片时，主观性受图像外观、图像与文本对齐以及文本中提及对象的影响，强调了探究主观性对模型性能的重要性。",
    "en_tdlr": "Investigating subjectivity quantification under various motivational contexts revealed that image evaluations are influenced by appearance, alignment with text, and representation of objects, emphasizing the importance of considering subjectivity for model performance."
}