{
    "title": "Advanced Knowledge Extraction of Physical Design Drawings, Translation and conversion to CAD formats using Deep Learning",
    "abstract": "arXiv:2403.11291v1 Announce Type: cross  Abstract: The maintenance, archiving and usage of the design drawings is cumbersome in physical form in different industries for longer period. It is hard to extract information by simple scanning of drawing sheets. Converting them to their digital formats such as Computer-Aided Design (CAD), with needed knowledge extraction can solve this problem. The conversion of these machine drawings to its digital form is a crucial challenge which requires advanced techniques. This research proposes an innovative methodology utilizing Deep Learning methods. The approach employs object detection model, such as Yolov7, Faster R-CNN, to detect physical drawing objects present in the images followed by, edge detection algorithms such as canny filter to extract and refine the identified lines from the drawing region and curve detection techniques to detect circle. Also ornaments (complex shapes) within the drawings are extracted. To ensure comprehensive convers",
    "link": "https://arxiv.org/abs/2403.11291",
    "context": "Title: Advanced Knowledge Extraction of Physical Design Drawings, Translation and conversion to CAD formats using Deep Learning\nAbstract: arXiv:2403.11291v1 Announce Type: cross  Abstract: The maintenance, archiving and usage of the design drawings is cumbersome in physical form in different industries for longer period. It is hard to extract information by simple scanning of drawing sheets. Converting them to their digital formats such as Computer-Aided Design (CAD), with needed knowledge extraction can solve this problem. The conversion of these machine drawings to its digital form is a crucial challenge which requires advanced techniques. This research proposes an innovative methodology utilizing Deep Learning methods. The approach employs object detection model, such as Yolov7, Faster R-CNN, to detect physical drawing objects present in the images followed by, edge detection algorithms such as canny filter to extract and refine the identified lines from the drawing region and curve detection techniques to detect circle. Also ornaments (complex shapes) within the drawings are extracted. To ensure comprehensive convers",
    "path": "papers/24/03/2403.11291.json",
    "total_tokens": 853,
    "translated_title": "物理设计图纸的高级知识提取、翻译和转换为CAD格式的深度学习",
    "translated_abstract": "物理形式下设计图纸的维护、存档和使用在不同行业中长时间以来变得繁琐。简单扫描图纸很难提取信息。将它们转换为计算机辅助设计（CAD）等数字格式，并进行必要的知识提取可以解决这个问题。将这些机器图纸转换为数字形式是一个关键挑战，需要先进的技术。本研究提出了一种利用深度学习方法的创新方法。该方法采用物体检测模型，如Yolov7、Faster R-CNN，来检测图像中存在的物理绘图对象，随后使用边缘检测算法，如Canny滤波器，从图纸区域提取和精化识别的线条，以及曲线检测技术来检测圆。还提取图纸中的装饰物（复杂形状）。为确保全面性的转换",
    "tldr": "通过利用深度学习方法，本研究提出了一种创新的方法，利用物体检测模型和边缘检测算法提取物理设计图纸的信息，将其转换为CAD格式。",
    "en_tdlr": "This research proposes an innovative methodology utilizing Deep Learning methods to extract information from physical design drawings using object detection models and edge detection algorithms, converting them to CAD formats."
}