{
    "title": "Impoverished Language Technology: The Lack of (Social) Class in NLP",
    "abstract": "arXiv:2403.03874v1 Announce Type: cross  Abstract: Since Labov's (1964) foundational work on the social stratification of language, linguistics has dedicated concerted efforts towards understanding the relationships between socio-demographic factors and language production and perception. Despite the large body of evidence identifying significant relationships between socio-demographic factors and language production, relatively few of these factors have been investigated in the context of NLP technology. While age and gender are well covered, Labov's initial target, socio-economic class, is largely absent. We survey the existing Natural Language Processing (NLP) literature and find that only 20 papers even mention socio-economic status. However, the majority of those papers do not engage with class beyond collecting information of annotator-demographics. Given this research lacuna, we provide a definition of class that can be operationalised by NLP researchers, and argue for including",
    "link": "https://arxiv.org/abs/2403.03874",
    "context": "Title: Impoverished Language Technology: The Lack of (Social) Class in NLP\nAbstract: arXiv:2403.03874v1 Announce Type: cross  Abstract: Since Labov's (1964) foundational work on the social stratification of language, linguistics has dedicated concerted efforts towards understanding the relationships between socio-demographic factors and language production and perception. Despite the large body of evidence identifying significant relationships between socio-demographic factors and language production, relatively few of these factors have been investigated in the context of NLP technology. While age and gender are well covered, Labov's initial target, socio-economic class, is largely absent. We survey the existing Natural Language Processing (NLP) literature and find that only 20 papers even mention socio-economic status. However, the majority of those papers do not engage with class beyond collecting information of annotator-demographics. Given this research lacuna, we provide a definition of class that can be operationalised by NLP researchers, and argue for including",
    "path": "papers/24/03/2403.03874.json",
    "total_tokens": 847,
    "translated_title": "贫困的语言技术：NLP中缺乏（社会）阶级因素",
    "translated_abstract": "自Labov（1964年）关于语言社会层级的基础性工作以来，语言学界致力于理解社会人口因素和语言生产和感知之间的关系。尽管大量证据表明社会人口因素与语言生产之间存在显著关系，但相对较少的因素在NLP技术的背景下得到研究。虽然年龄和性别得到了很好的覆盖，Labov最初关注的社会经济阶级却几乎不被涉及。我们调查了现有的自然语言处理（NLP）文献，并发现只有20篇论文提到了社会经济地位。然而，这些论文中的大部分并没有探讨超出收集注释者人口信息之外的阶级。鉴于这一研究空白，我们提供了一个可以被NLP研究人员操作的阶级定义，并主张包含该因素",
    "tldr": "该论文探讨了NLP领域中缺乏对社会阶级因素的研究，呼吁研究者在NLP技术中考虑和操作化阶级因素。"
}