{
    "title": "Self-Supervised Backbone Framework for Diverse Agricultural Vision Tasks",
    "abstract": "arXiv:2403.15248v1 Announce Type: cross  Abstract: Computer vision in agriculture is game-changing with its ability to transform farming into a data-driven, precise, and sustainable industry. Deep learning has empowered agriculture vision to analyze vast, complex visual data, but heavily rely on the availability of large annotated datasets. This remains a bottleneck as manual labeling is error-prone, time-consuming, and expensive. The lack of efficient labeling approaches inspired us to consider self-supervised learning as a paradigm shift, learning meaningful feature representations from raw agricultural image data. In this work, we explore how self-supervised representation learning unlocks the potential applicability to diverse agriculture vision tasks by eliminating the need for large-scale annotated datasets. We propose a lightweight framework utilizing SimCLR, a contrastive learning approach, to pre-train a ResNet-50 backbone on a large, unannotated dataset of real-world agricult",
    "link": "https://arxiv.org/abs/2403.15248",
    "context": "Title: Self-Supervised Backbone Framework for Diverse Agricultural Vision Tasks\nAbstract: arXiv:2403.15248v1 Announce Type: cross  Abstract: Computer vision in agriculture is game-changing with its ability to transform farming into a data-driven, precise, and sustainable industry. Deep learning has empowered agriculture vision to analyze vast, complex visual data, but heavily rely on the availability of large annotated datasets. This remains a bottleneck as manual labeling is error-prone, time-consuming, and expensive. The lack of efficient labeling approaches inspired us to consider self-supervised learning as a paradigm shift, learning meaningful feature representations from raw agricultural image data. In this work, we explore how self-supervised representation learning unlocks the potential applicability to diverse agriculture vision tasks by eliminating the need for large-scale annotated datasets. We propose a lightweight framework utilizing SimCLR, a contrastive learning approach, to pre-train a ResNet-50 backbone on a large, unannotated dataset of real-world agricult",
    "path": "papers/24/03/2403.15248.json",
    "total_tokens": 873,
    "translated_title": "自监督骨干框架用于多样化农业视觉任务",
    "translated_abstract": "农业中的计算机视觉具有改变游戏规则的能力，可以将农业转变为数据驱动、精确和可持续的行业。深度学习赋予了农业视觉分析大量复杂的视觉数据的能力，但严重依赖于大规模带标注数据集的可用性。这仍然是一个瓶颈，因为手动标注容易出错、耗时且昂贵。缺乏有效的标注方法激发了我们考虑自监督学习作为一种范式转变，从原始农业图像数据中学习有意义的特征表示。在这项工作中，我们探讨了自监督表示学习如何通过消除对大规模带标注数据集的需求，解锁了对多样化农业视觉任务的潜在适用性。我们提出了一个利用SimCLR，一种对比学习方法，对大量未标注的真实世界农业数据集上预训练ResNet-50骨干的轻量级框架。",
    "tldr": "通过自监督学习，该研究利用SimCLR对农业图像进行预训练，成功应用于多样化的农业视觉任务，消除了大规模带标注数据集的需求。"
}