{
    "title": "Many-Objective Evolutionary Influence Maximization: Balancing Spread, Budget, Fairness, and Time",
    "abstract": "arXiv:2403.18755v1 Announce Type: cross  Abstract: The Influence Maximization (IM) problem seeks to discover the set of nodes in a graph that can spread the information propagation at most. This problem is known to be NP-hard, and it is usually studied by maximizing the influence (spread) and, optionally, optimizing a second objective, such as minimizing the seed set size or maximizing the influence fairness. However, in many practical scenarios multiple aspects of the IM problem must be optimized at the same time. In this work, we propose a first case study where several IM-specific objective functions, namely budget, fairness, communities, and time, are optimized on top of the maximization of influence and minimization of the seed set size. To this aim, we introduce MOEIM (Many-Objective Evolutionary Algorithm for Influence Maximization) a Multi-Objective Evolutionary Algorithm (MOEA) based on NSGA-II incorporating graph-aware operators and a smart initialization. We compare MOEIM in",
    "link": "https://arxiv.org/abs/2403.18755",
    "context": "Title: Many-Objective Evolutionary Influence Maximization: Balancing Spread, Budget, Fairness, and Time\nAbstract: arXiv:2403.18755v1 Announce Type: cross  Abstract: The Influence Maximization (IM) problem seeks to discover the set of nodes in a graph that can spread the information propagation at most. This problem is known to be NP-hard, and it is usually studied by maximizing the influence (spread) and, optionally, optimizing a second objective, such as minimizing the seed set size or maximizing the influence fairness. However, in many practical scenarios multiple aspects of the IM problem must be optimized at the same time. In this work, we propose a first case study where several IM-specific objective functions, namely budget, fairness, communities, and time, are optimized on top of the maximization of influence and minimization of the seed set size. To this aim, we introduce MOEIM (Many-Objective Evolutionary Algorithm for Influence Maximization) a Multi-Objective Evolutionary Algorithm (MOEA) based on NSGA-II incorporating graph-aware operators and a smart initialization. We compare MOEIM in",
    "path": "papers/24/03/2403.18755.json",
    "total_tokens": 856,
    "translated_title": "多目标进化影响最大化：平衡传播、预算、公平性和时间",
    "translated_abstract": "影响最大化（IM）问题旨在发现图中可以最大程度传播信息传播的节点集。这个问题被称为NP难题，通常通过最大化影响（传播）以及选择性优化第二个目标（例如最小化种子集大小或最大化影响公平性）来研究。然而，在许多实际场景中，IM问题的多个方面必须同时进行优化。在这项工作中，我们提出了一个第一个案例研究，在此基础上优化了几个IM特定目标函数，即预算、公平性、社区和时间，同时最大化传播影响并最小化种子集大小。为此，我们引入了MOEIM（用于影响最大化的多目标进化算法），这是一个基于NSGA-II的多目标进化算法（MOEA），结合了具有图感知性的算子和智能初始化。我们通过...",
    "tldr": "通过引入多目标进化算法，本研究在最大化影响和最小化种子集大小的基础上，优化了多个IM特定目标函数，包括预算、公平性、社区和时间。",
    "en_tdlr": "This study optimizes multiple IM-specific objective functions, including budget, fairness, communities, and time, on top of maximizing influence and minimizing seed set size, by introducing a multi-objective evolutionary algorithm."
}