{
    "title": "Guiding the generation of counterfactual explanations through temporal background knowledge for Predictive Process Monitoring",
    "abstract": "arXiv:2403.11642v1 Announce Type: new  Abstract: Counterfactual explanations suggest what should be different in the input instance to change the outcome of an AI system. When dealing with counterfactual explanations in the field of Predictive Process Monitoring, however, control flow relationships among events have to be carefully considered. A counterfactual, indeed, should not violate control flow relationships among activities (temporal background knowledege). Within the field of Explainability in Predictive Process Monitoring, there have been a series of works regarding counterfactual explanations for outcome-based predictions. However, none of them consider the inclusion of temporal background knowledge when generating these counterfactuals. In this work, we adapt state-of-the-art techniques for counterfactual generation in the domain of XAI that are based on genetic algorithms to consider a series of temporal constraints at runtime. We assume that this temporal background knowle",
    "link": "https://arxiv.org/abs/2403.11642",
    "context": "Title: Guiding the generation of counterfactual explanations through temporal background knowledge for Predictive Process Monitoring\nAbstract: arXiv:2403.11642v1 Announce Type: new  Abstract: Counterfactual explanations suggest what should be different in the input instance to change the outcome of an AI system. When dealing with counterfactual explanations in the field of Predictive Process Monitoring, however, control flow relationships among events have to be carefully considered. A counterfactual, indeed, should not violate control flow relationships among activities (temporal background knowledege). Within the field of Explainability in Predictive Process Monitoring, there have been a series of works regarding counterfactual explanations for outcome-based predictions. However, none of them consider the inclusion of temporal background knowledge when generating these counterfactuals. In this work, we adapt state-of-the-art techniques for counterfactual generation in the domain of XAI that are based on genetic algorithms to consider a series of temporal constraints at runtime. We assume that this temporal background knowle",
    "path": "papers/24/03/2403.11642.json",
    "total_tokens": 811,
    "translated_title": "引导基于时间背景知识生成可解释性反事实解释来进行预测性流程监控",
    "translated_abstract": "反事实解释指出了修改输入实例以改变人工智能系统结果应该有什么不同。然而，在预测性流程监控领域处理反事实解释时，必须仔细考虑事件之间的控制流关系。确实，一个反事实不应违反活动之间的控制流关系（即时间背景知识）。在预测性流程监控的可解释性领域中，已经有一系列关于基于结果的预测的反事实解释的作品。然而，其中没有一个在生成这些反事实时考虑了时间背景知识的包含。在这项工作中，我们改进了基于遗传算法的最先进技术，以考虑一系列运行时的时间约束来生成反事实。我们假定这种时间背景知识",
    "tldr": "通过考虑运行时的时间约束，本研究通过调整基于遗传算法的技术，在预测性流程监控中引入了时间背景知识来生成反事实解释。",
    "en_tdlr": "This study introduces temporal background knowledge into the generation of counterfactual explanations in Predictive Process Monitoring by adapting genetic algorithm-based techniques to consider runtime temporal constraints."
}