{
    "title": "A Unified Framework for Microscopy Defocus Deblur with Multi-Pyramid Transformer and Contrastive Learning",
    "abstract": "arXiv:2403.02611v1 Announce Type: cross  Abstract: Defocus blur is a persistent problem in microscope imaging that poses harm to pathology interpretation and medical intervention in cell microscopy and microscope surgery. To address this problem, a unified framework including multi-pyramid transformer (MPT) and extended frequency contrastive regularization (EFCR) is proposed to tackle two outstanding challenges in microscopy deblur: longer attention span and feature deficiency. The MPT employs an explicit pyramid structure at each network stage that integrates the cross-scale window attention (CSWA), the intra-scale channel attention (ISCA), and the feature-enhancing feed-forward network (FEFN) to capture long-range cross-scale spatial interaction and global channel context. The EFCR addresses the feature deficiency problem by exploring latent deblur signals from different frequency bands. It also enables deblur knowledge transfer to learn cross-domain information from extra data, impr",
    "link": "https://arxiv.org/abs/2403.02611",
    "context": "Title: A Unified Framework for Microscopy Defocus Deblur with Multi-Pyramid Transformer and Contrastive Learning\nAbstract: arXiv:2403.02611v1 Announce Type: cross  Abstract: Defocus blur is a persistent problem in microscope imaging that poses harm to pathology interpretation and medical intervention in cell microscopy and microscope surgery. To address this problem, a unified framework including multi-pyramid transformer (MPT) and extended frequency contrastive regularization (EFCR) is proposed to tackle two outstanding challenges in microscopy deblur: longer attention span and feature deficiency. The MPT employs an explicit pyramid structure at each network stage that integrates the cross-scale window attention (CSWA), the intra-scale channel attention (ISCA), and the feature-enhancing feed-forward network (FEFN) to capture long-range cross-scale spatial interaction and global channel context. The EFCR addresses the feature deficiency problem by exploring latent deblur signals from different frequency bands. It also enables deblur knowledge transfer to learn cross-domain information from extra data, impr",
    "path": "papers/24/03/2403.02611.json",
    "total_tokens": 906,
    "translated_title": "一种统一的显微镜焦外模糊去除框架: 多金字塔变换器和对比学习",
    "translated_abstract": "虚焦模糊是显微镜成像中的持续问题，对病理解释和细胞显微镜和显微手术中的医疗干预造成伤害。为了解决这一问题，提出了一个包括多金字塔变换器（MPT）和扩展频率对比正规化（EFCR）的统一框架，以解决显微镜去模糊中的两个突出挑战：较长的注意力跨度和特征不足。MPT在每个网络阶段使用显式金字塔结构，集成了跨尺度窗口注意力（CSWA）、内尺度通道注意力（ISCA）和特征增强前向网络（FEFN），以捕获长距离跨尺度空间交互和全局通道上下文。EFCR通过探索不同频段的潜在去模糊信号来解决特征不足的问题。它还使去模糊知识传输，从额外数据中学习跨域信息。",
    "tldr": "该论文提出了一个统一的框架，结合了多金字塔变换器和扩展频率对比正规化，以解决显微镜去模糊中的长距离交互和特征不足挑战。",
    "en_tdlr": "The paper introduces a unified framework incorporating multi-pyramid transformer and extended frequency contrastive regularization to address the challenges of long-range interaction and feature deficiency in microscopy deblur."
}