{
    "title": "Workplace sustainability or financial resilience? Composite-financial resilience index",
    "abstract": "arXiv:2403.16296v1 Announce Type: new  Abstract: Due to the variety of corporate risks in turmoil markets and the consequent financial distress especially in COVID-19 time, this paper investigates corporate resilience and compares different types of resilience that can be potential sources of heterogeneity in firms' implied rate of return. Specifically, the novelty is not only to quantify firms' financial resilience but also to compare it with workplace resilience which matters more in the COVID-19 era. The study prepares several pieces of evidence of the necessity and insufficiency of these two main types of resilience by comparing earnings expectations and implied discount rates of high- and low-resilience firms. Particularly, results present evidence of the possible amplification of workplace resilience by the financial status of firms in the COVID-19 era. The paper proposes a novel composite-financial resilience index as a potential measure for disaster risk that significantly and ",
    "link": "https://arxiv.org/abs/2403.16296",
    "context": "Title: Workplace sustainability or financial resilience? Composite-financial resilience index\nAbstract: arXiv:2403.16296v1 Announce Type: new  Abstract: Due to the variety of corporate risks in turmoil markets and the consequent financial distress especially in COVID-19 time, this paper investigates corporate resilience and compares different types of resilience that can be potential sources of heterogeneity in firms' implied rate of return. Specifically, the novelty is not only to quantify firms' financial resilience but also to compare it with workplace resilience which matters more in the COVID-19 era. The study prepares several pieces of evidence of the necessity and insufficiency of these two main types of resilience by comparing earnings expectations and implied discount rates of high- and low-resilience firms. Particularly, results present evidence of the possible amplification of workplace resilience by the financial status of firms in the COVID-19 era. The paper proposes a novel composite-financial resilience index as a potential measure for disaster risk that significantly and ",
    "path": "papers/24/03/2403.16296.json",
    "total_tokens": 914,
    "translated_title": "职场可持续性还是财务弹性？综合财务弹性指数",
    "translated_abstract": "由于市场动荡中存在各种企业风险以及随之而来的财务困境，尤其是在COVID-19时期，本文研究了企业的弹性，并比较了不同类型的弹性，这些弹性可能成为公司隐含回报率异质性的潜在来源。具体来说，本文的创新之处不仅在于量化公司的财务弹性，还在于将其与在COVID-19时代更为重要的职场弹性进行比较。研究通过比较高低弹性公司的盈利预期和隐含折现率，准备了几个关于这两种主要弹性的必要性和不足性的证据。特别地，结果表明了在COVID-19时代公司的财务状况可能放大职场弹性的可能性。本文提出了一个新颖的综合财务弹性指数作为潜在的灾害风险衡量指标，这在衡量公司财务和职场弹性的相关性方面具有重要意义。",
    "tldr": "本文研究了企业的财务弹性和职场弹性，提出了综合财务弹性指数作为灾害风险的潜在衡量指标，在COVID-19时代职场弹性可能受到公司财务状况的影响。",
    "en_tdlr": "This paper examines corporate financial resilience and workplace resilience, proposing a composite-financial resilience index as a potential measure for disaster risk, with workplace resilience potentially influenced by the financial status of firms in the COVID-19 era."
}