{
    "title": "Scaling up Dynamic Edge Partition Models via Stochastic Gradient MCMC",
    "abstract": "arXiv:2403.00044v1 Announce Type: cross  Abstract: The edge partition model (EPM) is a generative model for extracting an overlapping community structure from static graph-structured data. In the EPM, the gamma process (GaP) prior is adopted to infer the appropriate number of latent communities, and each vertex is endowed with a gamma distributed positive memberships vector. Despite having many attractive properties, inference in the EPM is typically performed using Markov chain Monte Carlo (MCMC) methods that prevent it from being applied to massive network data. In this paper, we generalize the EPM to account for dynamic enviroment by representing each vertex with a positive memberships vector constructed using Dirichlet prior specification, and capturing the time-evolving behaviour of vertices via a Dirichlet Markov chain construction. A simple-to-implement Gibbs sampler is proposed to perform posterior computation using Negative- Binomial augmentation technique. For large network d",
    "link": "https://arxiv.org/abs/2403.00044",
    "context": "Title: Scaling up Dynamic Edge Partition Models via Stochastic Gradient MCMC\nAbstract: arXiv:2403.00044v1 Announce Type: cross  Abstract: The edge partition model (EPM) is a generative model for extracting an overlapping community structure from static graph-structured data. In the EPM, the gamma process (GaP) prior is adopted to infer the appropriate number of latent communities, and each vertex is endowed with a gamma distributed positive memberships vector. Despite having many attractive properties, inference in the EPM is typically performed using Markov chain Monte Carlo (MCMC) methods that prevent it from being applied to massive network data. In this paper, we generalize the EPM to account for dynamic enviroment by representing each vertex with a positive memberships vector constructed using Dirichlet prior specification, and capturing the time-evolving behaviour of vertices via a Dirichlet Markov chain construction. A simple-to-implement Gibbs sampler is proposed to perform posterior computation using Negative- Binomial augmentation technique. For large network d",
    "path": "papers/24/03/2403.00044.json",
    "total_tokens": 881,
    "translated_title": "通过随机梯度MCMC扩展动态边缘划分模型",
    "translated_abstract": "arXiv:2403.00044v1宣布类型:cross 摘要: 边缘划分模型(EPM)是一种从静态图结构数据中提取重叠社区结构的生成模型。 在EPM中，采用Gamma过程（GaP）先验来推断合适的潜在社区数量，并且每个顶点被赋予一个Gamma分布的正成员向量。 尽管具有许多吸引人的特性，EPM中的推理通常使用马尔可夫链蒙特卡罗（MCMC）方法执行，这阻止了其应用于大规模网络数据。 在本文中，我们通过使用Dirichlet先验规范表示每个顶点的正成员向量来将EPM泛化以考虑动态环境，并通过Dirichlet马尔可夫链构造捕获顶点的时间演变行为。 提出了一种简单实施的Gibbs采样器，使用负二项增强技术执行后验计算。 对于大网络资料",
    "tldr": "该论文通过引入Dirichlet先验规范和Dirichlet马尔可夫链构建，扩展了边缘划分模型（EPM）以适应动态环境，并提出了一个简单的Gibbs采样器来处理后验计算。",
    "en_tdlr": "This paper scales up the edge partition model (EPM) for dynamic environments by introducing Dirichlet prior specification and Dirichlet Markov chain construction, and proposes a simple Gibbs sampler for posterior computation."
}