{
    "title": "Detecting a Proxy for Potential Comorbid ADHD in People Reporting Anxiety Symptoms from Social Media Data",
    "abstract": "arXiv:2403.05561v1 Announce Type: cross  Abstract: We present a novel task that can elucidate the connection between anxiety and ADHD; use Transformers to make progress toward solving a task that is not solvable by keyword-based classifiers; and discuss a method for visualization of our classifier illuminating the connection between anxiety and ADHD presentations.   Up to approximately 50% of adults with ADHD may also have an anxiety disorder and approximately 30\\% of adults with anxiety may also have ADHD. Patients presenting with anxiety may be treated for anxiety without ADHD ever being considered, possibly affecting treatment. We show how data that bears on ADHD that is comorbid with anxiety can be obtained from social media data, and show that Transformers can be used to detect a proxy for possible comorbid ADHD in people with anxiety symptoms.   We collected data from anxiety and ADHD online forums (subreddits). We identified posters who first started posting in the Anxiety subre",
    "link": "https://arxiv.org/abs/2403.05561",
    "context": "Title: Detecting a Proxy for Potential Comorbid ADHD in People Reporting Anxiety Symptoms from Social Media Data\nAbstract: arXiv:2403.05561v1 Announce Type: cross  Abstract: We present a novel task that can elucidate the connection between anxiety and ADHD; use Transformers to make progress toward solving a task that is not solvable by keyword-based classifiers; and discuss a method for visualization of our classifier illuminating the connection between anxiety and ADHD presentations.   Up to approximately 50% of adults with ADHD may also have an anxiety disorder and approximately 30\\% of adults with anxiety may also have ADHD. Patients presenting with anxiety may be treated for anxiety without ADHD ever being considered, possibly affecting treatment. We show how data that bears on ADHD that is comorbid with anxiety can be obtained from social media data, and show that Transformers can be used to detect a proxy for possible comorbid ADHD in people with anxiety symptoms.   We collected data from anxiety and ADHD online forums (subreddits). We identified posters who first started posting in the Anxiety subre",
    "path": "papers/24/03/2403.05561.json",
    "total_tokens": 871,
    "translated_title": "从社交媒体数据中检测可能患有亚临床ADHD的潜在伴随症状",
    "translated_abstract": "我们提出了一个新颖的任务，可以阐明焦虑和ADHD之间的联系；利用变压器技术在解决基于关键字的分类器无法解决的任务方面取得进展；并讨论了一种可视化分类器的方法，阐明焦虑和ADHD表现之间的联系。大约50%的ADHD成年患者可能还患有焦虑症，约30%的焦虑成年患者可能也患有ADHD。患有焦虑症的患者可能会接受焦虑治疗，而不考虑ADHD，这可能会影响治疗。我们展示了如何从社交媒体数据中获取有关携带焦虑伴随的ADHD的数据，并展示了变压器可以用于检测在具有焦虑症状的人群中可能存在的亚临床ADHD的代理。",
    "tldr": "通过分析社交媒体数据，使用Transformers技术检测出焦虑症状患者中潜在的亚临床ADHD代理，帮助阐明了焦虑和ADHD之间的关系。",
    "en_tdlr": "Detecting a potential proxy for subclinical ADHD in people with anxiety symptoms through social media analysis using Transformers technology has helped elucidate the relationship between anxiety and ADHD."
}