{
    "title": "Real-time Adaptation for Condition Monitoring Signal Prediction using Label-aware Neural Processes",
    "abstract": "arXiv:2403.16377v1 Announce Type: new  Abstract: Building a predictive model that rapidly adapts to real-time condition monitoring (CM) signals is critical for engineering systems/units. Unfortunately, many current methods suffer from a trade-off between representation power and agility in online settings. For instance, parametric methods that assume an underlying functional form for CM signals facilitate efficient online prediction updates. However, this simplification leads to vulnerability to model specifications and an inability to capture complex signals. On the other hand, approaches based on over-parameterized or non-parametric models can excel at explaining complex nonlinear signals, but real-time updates for such models pose a challenging task. In this paper, we propose a neural process-based approach that addresses this trade-off. It encodes available observations within a CM signal into a representation space and then reconstructs the signal's history and evolution for predi",
    "link": "https://arxiv.org/abs/2403.16377",
    "context": "Title: Real-time Adaptation for Condition Monitoring Signal Prediction using Label-aware Neural Processes\nAbstract: arXiv:2403.16377v1 Announce Type: new  Abstract: Building a predictive model that rapidly adapts to real-time condition monitoring (CM) signals is critical for engineering systems/units. Unfortunately, many current methods suffer from a trade-off between representation power and agility in online settings. For instance, parametric methods that assume an underlying functional form for CM signals facilitate efficient online prediction updates. However, this simplification leads to vulnerability to model specifications and an inability to capture complex signals. On the other hand, approaches based on over-parameterized or non-parametric models can excel at explaining complex nonlinear signals, but real-time updates for such models pose a challenging task. In this paper, we propose a neural process-based approach that addresses this trade-off. It encodes available observations within a CM signal into a representation space and then reconstructs the signal's history and evolution for predi",
    "path": "papers/24/03/2403.16377.json",
    "total_tokens": 662,
    "translated_title": "使用具有标签感知的神经过程进行实时适应条件监测信号预测",
    "translated_abstract": "建立一个快速适应实时条件监测（CM）信号的预测模型对于工程系统/单元至关重要。然而，许多当前方法在表示能力和在线环境中的敏捷性之间存在权衡问题。本文提出了一种基于神经过程的方法，解决了这一权衡问题。它将CM信号中的可用观测编码到表示空间中，然后重建信号的历史和演变以进行预测。",
    "tldr": "提出了一种神经过程方法，可以在实时条件监测信号预测中实现表示能力和敏捷性的权衡",
    "en_tdlr": "Proposed a neural process-based approach that balances representation power and agility in real-time condition monitoring signal prediction."
}