{
    "title": "Intention-aware Denoising Diffusion Model for Trajectory Prediction",
    "abstract": "arXiv:2403.09190v1 Announce Type: cross  Abstract: Trajectory prediction is an essential component in autonomous driving, particularly for collision avoidance systems. Considering the inherent uncertainty of the task, numerous studies have utilized generative models to produce multiple plausible future trajectories for each agent. However, most of them suffer from restricted representation ability or unstable training issues. To overcome these limitations, we propose utilizing the diffusion model to generate the distribution of future trajectories. Two cruxes are to be settled to realize such an idea. First, the diversity of intention is intertwined with the uncertain surroundings, making the true distribution hard to parameterize. Second, the diffusion process is time-consuming during the inference phase, rendering it unrealistic to implement in a real-time driving system. We propose an Intention-aware denoising Diffusion Model (IDM), which tackles the above two problems. We decouple ",
    "link": "https://arxiv.org/abs/2403.09190",
    "context": "Title: Intention-aware Denoising Diffusion Model for Trajectory Prediction\nAbstract: arXiv:2403.09190v1 Announce Type: cross  Abstract: Trajectory prediction is an essential component in autonomous driving, particularly for collision avoidance systems. Considering the inherent uncertainty of the task, numerous studies have utilized generative models to produce multiple plausible future trajectories for each agent. However, most of them suffer from restricted representation ability or unstable training issues. To overcome these limitations, we propose utilizing the diffusion model to generate the distribution of future trajectories. Two cruxes are to be settled to realize such an idea. First, the diversity of intention is intertwined with the uncertain surroundings, making the true distribution hard to parameterize. Second, the diffusion process is time-consuming during the inference phase, rendering it unrealistic to implement in a real-time driving system. We propose an Intention-aware denoising Diffusion Model (IDM), which tackles the above two problems. We decouple ",
    "path": "papers/24/03/2403.09190.json",
    "total_tokens": 832,
    "translated_title": "轨迹预测中的意图感知去噪扩散模型",
    "translated_abstract": "轨迹预测是自动驾驶中的一个关键组件，尤其对于碰撞回避系统。考虑到任务的固有不确定性，许多研究利用生成模型为每个参与者产生多个可能的未来轨迹。然而，大多数模型存在表示能力受限或训练不稳定的问题。为了克服这些限制，我们提出利用扩散模型生成未来轨迹的分布。实现这一想法需解决两个关键问题。首先，意图的多样性与不确定环境相互交织，使得真实分布难以参数化。其次，扩散过程在推断阶段耗时，使得在实时驾驶系统中实现不切实际。我们提出了一种意图感知去噪扩散模型（IDM）来解决上述两个问题。",
    "tldr": "该论文提出了一种解决传统轨迹预测模型受限和训练不稳定问题的新方法，即利用意图感知去噪扩散模型（IDM）生成未来轨迹的分布。"
}