{
    "title": "Effect of Leaders Voice on Financial Market: An Empirical Deep Learning Expedition on NASDAQ, NSE, and Beyond",
    "abstract": "arXiv:2403.12161v1 Announce Type: cross  Abstract: Financial market like the price of stock, share, gold, oil, mutual funds are affected by the news and posts on social media. In this work deep learning based models are proposed to predict the trend of financial market based on NLP analysis of the twitter handles of leaders of different fields. There are many models available to predict financial market based on only the historical data of the financial component but combining historical data with news and posts of the social media like Twitter is the main objective of the present work. Substantial improvement is shown in the result. The main features of the present work are: a) proposing completely generalized algorithm which is able to generate models for any twitter handle and any financial component, b) predicting the time window for a tweets effect on a stock price c) analyzing the effect of multiple twitter handles for predicting the trend. A detailed survey is done to find out t",
    "link": "https://arxiv.org/abs/2403.12161",
    "context": "Title: Effect of Leaders Voice on Financial Market: An Empirical Deep Learning Expedition on NASDAQ, NSE, and Beyond\nAbstract: arXiv:2403.12161v1 Announce Type: cross  Abstract: Financial market like the price of stock, share, gold, oil, mutual funds are affected by the news and posts on social media. In this work deep learning based models are proposed to predict the trend of financial market based on NLP analysis of the twitter handles of leaders of different fields. There are many models available to predict financial market based on only the historical data of the financial component but combining historical data with news and posts of the social media like Twitter is the main objective of the present work. Substantial improvement is shown in the result. The main features of the present work are: a) proposing completely generalized algorithm which is able to generate models for any twitter handle and any financial component, b) predicting the time window for a tweets effect on a stock price c) analyzing the effect of multiple twitter handles for predicting the trend. A detailed survey is done to find out t",
    "path": "papers/24/03/2403.12161.json",
    "total_tokens": 910,
    "translated_title": "领导者的声音对金融市场的影响：关于纳斯达克、印度国家证券交易所等的经验深度学习探究",
    "translated_abstract": "金融市场，如股票、股份、黄金、石油、共同基金的价格受到社交媒体上的新闻和帖子的影响。本文提出基于深度学习模型，通过对不同领域领导人的Twitter帐户进行NLP分析，预测金融市场趋势。目前有许多模型可用于仅基于金融组成部分的历史数据预测金融市场，但将历史数据与Twitter等社交媒体的新闻和帖子相结合是本研究的主要目标。结果显示实质性改进。本研究的主要特点包括：a）提出完全通用的算法，能够为任何Twitter帐户和任何金融组件生成模型，b）预测推文对股价影响的时间窗口，c）分析多个Twitter帐户对预测趋势的影响。已进行详尽调查以找出",
    "tldr": "通过深度学习和NLP分析领导人的Twitter帐户，结合历史数据与社交媒体新闻，实现对金融市场趋势的预测及推文对股价影响的分析。",
    "en_tdlr": "Prediction of financial market trends and analysis of tweets' impact on stock prices by utilizing deep learning and NLP analysis of leaders' Twitter accounts combined with historical data and social media news."
}