{
    "title": "Improving Diffusion-Based Generative Models via Approximated Optimal Transport",
    "abstract": "arXiv:2403.05069v1 Announce Type: cross  Abstract: We introduce the Approximated Optimal Transport (AOT) technique, a novel training scheme for diffusion-based generative models. Our approach aims to approximate and integrate optimal transport into the training process, significantly enhancing the ability of diffusion models to estimate the denoiser outputs accurately. This improvement leads to ODE trajectories of diffusion models with lower curvature and reduced truncation errors during sampling. We achieve superior image quality and reduced sampling steps by employing AOT in training. Specifically, we achieve FID scores of 1.88 with just 27 NFEs and 1.73 with 29 NFEs in unconditional and conditional generations, respectively. Furthermore, when applying AOT to train the discriminator for guidance, we establish new state-of-the-art FID scores of 1.68 and 1.58 for unconditional and conditional generations, respectively, each with 29 NFEs. This outcome demonstrates the effectiveness of A",
    "link": "https://arxiv.org/abs/2403.05069",
    "context": "Title: Improving Diffusion-Based Generative Models via Approximated Optimal Transport\nAbstract: arXiv:2403.05069v1 Announce Type: cross  Abstract: We introduce the Approximated Optimal Transport (AOT) technique, a novel training scheme for diffusion-based generative models. Our approach aims to approximate and integrate optimal transport into the training process, significantly enhancing the ability of diffusion models to estimate the denoiser outputs accurately. This improvement leads to ODE trajectories of diffusion models with lower curvature and reduced truncation errors during sampling. We achieve superior image quality and reduced sampling steps by employing AOT in training. Specifically, we achieve FID scores of 1.88 with just 27 NFEs and 1.73 with 29 NFEs in unconditional and conditional generations, respectively. Furthermore, when applying AOT to train the discriminator for guidance, we establish new state-of-the-art FID scores of 1.68 and 1.58 for unconditional and conditional generations, respectively, each with 29 NFEs. This outcome demonstrates the effectiveness of A",
    "path": "papers/24/03/2403.05069.json",
    "total_tokens": 912,
    "translated_title": "通过近似最优输运改进基于扩散的生成模型",
    "translated_abstract": "我们引入了近似最优输运（AOT）技术，一种新颖的用于扩散生成模型的训练方案。我们的方法旨在将最优输运近似并整合到训练过程中，显著增强扩散模型准确估计去噪器输出的能力。这种改进导致扩散模型的ODE轨迹具有较低曲率和减少采样过程中的截断误差。通过在训练中采用AOT，我们实现了更优越的图像质量和减少的采样步骤。具体来说，我们在无条件和有条件生成中仅使用27个NFEs和29个NFEs分别实现了1.88和1.73的FID分数。此外，当将AOT应用于为引导训练鉴别器时，我们分别为无条件和有条件生成树立了新的最先进的FID分数，每个分别为1.68和1.58，每个都使用了29个NFEs。这一结果展示了AOT的有效性。",
    "tldr": "通过近似最优输运技术改进了基于扩散的生成模型，显著提高了模型准确估计去噪器输出的能力，降低了采样过程中的截断误差，实现了更优质的图像生成质量。",
    "en_tdlr": "Improved diffusion-based generative models by approximating optimal transport, enhancing model accuracy in estimating denoiser outputs, reducing truncation errors during sampling, and achieving higher quality image generation."
}