{
    "title": "Light Curve Classification with DistClassiPy: a new distance-based classifier",
    "abstract": "arXiv:2403.12120v1 Announce Type: cross  Abstract: The rise of synoptic sky surveys has ushered in an era of big data in time-domain astronomy, making data science and machine learning essential tools for studying celestial objects. Tree-based (e.g. Random Forests) and deep learning models represent the current standard in the field. We explore the use of different distance metrics to aid in the classification of objects. For this, we developed a new distance metric based classifier called DistClassiPy. The direct use of distance metrics is an approach that has not been explored in time-domain astronomy, but distance-based methods can aid in increasing the interpretability of the classification result and decrease the computational costs. In particular, we classify light curves of variable stars by comparing the distances between objects of different classes. Using 18 distance metrics applied to a catalog of 6,000 variable stars in 10 classes, we demonstrate classification and dimensio",
    "link": "https://arxiv.org/abs/2403.12120",
    "context": "Title: Light Curve Classification with DistClassiPy: a new distance-based classifier\nAbstract: arXiv:2403.12120v1 Announce Type: cross  Abstract: The rise of synoptic sky surveys has ushered in an era of big data in time-domain astronomy, making data science and machine learning essential tools for studying celestial objects. Tree-based (e.g. Random Forests) and deep learning models represent the current standard in the field. We explore the use of different distance metrics to aid in the classification of objects. For this, we developed a new distance metric based classifier called DistClassiPy. The direct use of distance metrics is an approach that has not been explored in time-domain astronomy, but distance-based methods can aid in increasing the interpretability of the classification result and decrease the computational costs. In particular, we classify light curves of variable stars by comparing the distances between objects of different classes. Using 18 distance metrics applied to a catalog of 6,000 variable stars in 10 classes, we demonstrate classification and dimensio",
    "path": "papers/24/03/2403.12120.json",
    "total_tokens": 847,
    "translated_title": "使用DistClassiPy进行光变曲线分类：一种新的基于距离的分类器",
    "translated_abstract": "天文学领域的巡天调查的兴起引领了时域天文学中大数据时代的到来，使得数据科学和机器学习成为研究天体对象的必备工具。我们探讨了使用不同距离度量来辅助对象分类的方法。为此，我们开发了一种基于距离度量的新分类器，称为DistClassiPy。直接使用距离度量是一种在时域天文学中尚未探索的方法，但基于距离的方法可以帮助增加分类结果的可解释性并减少计算成本。具体而言，我们通过比较不同类别对象之间的距离，对可变星的光变曲线进行分类。通过对10个类别中的6000颗可变星的目录应用18种距离度量，我们展示了分类和维度缩减。",
    "tldr": "提出了一种新的基于距离度量的分类器DistClassiPy，通过比较不同类别对象之间的距离，实现了可变星的光变曲线分类，帮助增加分类结果的可解释性并减少计算成本。"
}