{
    "title": "Graph Neural Aggregation-diffusion with Metastability",
    "abstract": "arXiv:2403.20221v1 Announce Type: cross  Abstract: Continuous graph neural models based on differential equations have expanded the architecture of graph neural networks (GNNs). Due to the connection between graph diffusion and message passing, diffusion-based models have been widely studied. However, diffusion naturally drives the system towards an equilibrium state, leading to issues like over-smoothing. To this end, we propose GRADE inspired by graph aggregation-diffusion equations, which includes the delicate balance between nonlinear diffusion and aggregation induced by interaction potentials. The node representations obtained through aggregation-diffusion equations exhibit metastability, indicating that features can aggregate into multiple clusters. In addition, the dynamics within these clusters can persist for long time periods, offering the potential to alleviate over-smoothing effects. This nonlinear diffusion in our model generalizes existing diffusion-based models and estab",
    "link": "https://arxiv.org/abs/2403.20221",
    "context": "Title: Graph Neural Aggregation-diffusion with Metastability\nAbstract: arXiv:2403.20221v1 Announce Type: cross  Abstract: Continuous graph neural models based on differential equations have expanded the architecture of graph neural networks (GNNs). Due to the connection between graph diffusion and message passing, diffusion-based models have been widely studied. However, diffusion naturally drives the system towards an equilibrium state, leading to issues like over-smoothing. To this end, we propose GRADE inspired by graph aggregation-diffusion equations, which includes the delicate balance between nonlinear diffusion and aggregation induced by interaction potentials. The node representations obtained through aggregation-diffusion equations exhibit metastability, indicating that features can aggregate into multiple clusters. In addition, the dynamics within these clusters can persist for long time periods, offering the potential to alleviate over-smoothing effects. This nonlinear diffusion in our model generalizes existing diffusion-based models and estab",
    "path": "papers/24/03/2403.20221.json",
    "total_tokens": 802,
    "translated_title": "带隐蔽状态的图神经聚合-扩散",
    "translated_abstract": "基于微分方程的连续图神经模型扩展了图神经网络（GNN）的架构。由于图扩散与信息传递之间的联系，基于扩散的模型得到了广泛研究。然而，扩散自然地将系统推向平衡状态，导致问题，如过度平滑。为此，我们提出了受图聚合-扩散方程启发的GRADE，其中包括非线性扩散和相互作用势引起的聚合之间的微妙平衡。通过聚合-扩散方程获得的节点表示表现出亚稳态，表明特征可以聚合成多个簇。此外，这些簇内的动态可以持续很长时间，有望缓解过度平滑的影响。我们模型中的非线性扩散推广了现有基于扩散的模型并确立了",
    "tldr": "提出了GRADE模型，通过图聚合-扩散方程实现了节点表示的亚稳定性，能够缓解图神经网络中过度平滑的问题。",
    "en_tdlr": "Introduced the GRADE model, which achieves metastability of node representations through graph aggregation-diffusion equations, mitigating the issue of oversmoothing in graph neural networks."
}