{
    "title": "Fractal interpolation in the context of prediction accuracy optimization",
    "abstract": "arXiv:2403.00403v1 Announce Type: new  Abstract: This paper focuses on the hypothesis of optimizing time series predictions using fractal interpolation techniques. In general, the accuracy of machine learning model predictions is closely related to the quality and quantitative aspects of the data used, following the principle of \\textit{garbage-in, garbage-out}. In order to quantitatively and qualitatively augment datasets, one of the most prevalent concerns of data scientists is to generate synthetic data, which should follow as closely as possible the actual pattern of the original data.   This study proposes three different data augmentation strategies based on fractal interpolation, namely the \\textit{Closest Hurst Strategy}, \\textit{Closest Values Strategy} and \\textit{Formula Strategy}. To validate the strategies, we used four public datasets from the literature, as well as a private dataset obtained from meteorological records in the city of Brasov, Romania. The prediction resul",
    "link": "https://arxiv.org/abs/2403.00403",
    "context": "Title: Fractal interpolation in the context of prediction accuracy optimization\nAbstract: arXiv:2403.00403v1 Announce Type: new  Abstract: This paper focuses on the hypothesis of optimizing time series predictions using fractal interpolation techniques. In general, the accuracy of machine learning model predictions is closely related to the quality and quantitative aspects of the data used, following the principle of \\textit{garbage-in, garbage-out}. In order to quantitatively and qualitatively augment datasets, one of the most prevalent concerns of data scientists is to generate synthetic data, which should follow as closely as possible the actual pattern of the original data.   This study proposes three different data augmentation strategies based on fractal interpolation, namely the \\textit{Closest Hurst Strategy}, \\textit{Closest Values Strategy} and \\textit{Formula Strategy}. To validate the strategies, we used four public datasets from the literature, as well as a private dataset obtained from meteorological records in the city of Brasov, Romania. The prediction resul",
    "path": "papers/24/03/2403.00403.json",
    "total_tokens": 745,
    "translated_title": "在预测准确性优化的背景下的分形插值",
    "translated_abstract": "本文关注使用分形插值技术优化时间序列预测的假设。一般来说，机器学习模型预测的准确性与使用数据的质量和数量方面密切相关，遵循“垃圾进，垃圾出”的原则。为了定量和定性增加数据集，数据科学家最关注的问题之一是生成合成数据，这些数据应尽可能地紧随原始数据的实际模式。",
    "tldr": "该研究提出了三种基于分形插值的数据增强策略，分别是“最接近Hurst策略”、“最接近值策略”和“公式策略”，并使用四个公共数据集和一组来自罗马尼亚布拉索夫市气象记录的私人数据集来验证这些策略。",
    "en_tdlr": "This study proposes three different data augmentation strategies based on fractal interpolation and validates them using public datasets and a private dataset obtained from meteorological records in the city of Brasov, Romania."
}