{
    "title": "GAgent: An Adaptive Rigid-Soft Gripping Agent with Vision Language Models for Complex Lighting Environments",
    "abstract": "arXiv:2403.10850v1 Announce Type: cross  Abstract: This paper introduces GAgent: an Gripping Agent designed for open-world environments that provides advanced cognitive abilities via VLM agents and flexible grasping abilities with variable stiffness soft grippers. GAgent comprises three primary components - Prompt Engineer module, Visual-Language Model (VLM) core and Workflow module. These three modules enhance gripper success rates by recognizing objects and materials and accurately estimating grasp area even under challenging lighting conditions. As part of creativity, researchers also created a bionic hybrid soft gripper with variable stiffness capable of gripping heavy loads while still gently engaging objects. This intelligent agent, featuring VLM-based cognitive processing with bionic design, shows promise as it could potentially benefit UAVs in various scenarios.",
    "link": "https://arxiv.org/abs/2403.10850",
    "context": "Title: GAgent: An Adaptive Rigid-Soft Gripping Agent with Vision Language Models for Complex Lighting Environments\nAbstract: arXiv:2403.10850v1 Announce Type: cross  Abstract: This paper introduces GAgent: an Gripping Agent designed for open-world environments that provides advanced cognitive abilities via VLM agents and flexible grasping abilities with variable stiffness soft grippers. GAgent comprises three primary components - Prompt Engineer module, Visual-Language Model (VLM) core and Workflow module. These three modules enhance gripper success rates by recognizing objects and materials and accurately estimating grasp area even under challenging lighting conditions. As part of creativity, researchers also created a bionic hybrid soft gripper with variable stiffness capable of gripping heavy loads while still gently engaging objects. This intelligent agent, featuring VLM-based cognitive processing with bionic design, shows promise as it could potentially benefit UAVs in various scenarios.",
    "path": "papers/24/03/2403.10850.json",
    "total_tokens": 892,
    "translated_title": "GAgent：一种适应复杂照明环境的自适应刚柔握持Agent",
    "translated_abstract": "这篇论文介绍了GAgent：一种为开放世界环境设计的握持Agent，通过VLM代理提供先进的认知能力，并具备可变硬度软手持器的灵活抓取能力。GAgent包括三个主要组件 - Prompt Engineer模块，Visual-Language Model（VLM）核心和Workflow模块。这三个模块通过识别物体和材料，即使在挑战性的光照条件下也能准确估计抓取区域，提高了夹爪成功率。作为创造性的一部分，研究人员还创建了一种具有可变硬度的仿生混合软手握器，能够夹持重物同时轻柔接触物体。这种特征VLM基础认知处理和仿生设计的智能Agent显示了潜力，因为它可能有助于各种情景中的无人机。",
    "tldr": "GAgent 基于视觉语言模型的自适应刚柔握持Agent在复杂照明环境下提供了先进的认知能力，包括Prompt Engineer模块、VLM核心和Workflow模块，同时具备可变硬度软手持器，对物体和材料进行识别和准确抓取，为无人机等场景带来潜在好处。",
    "en_tdlr": "GAgent is an adaptive rigid-soft gripping Agent based on vision language models that provides advanced cognitive abilities in complex lighting environments. It includes Prompt Engineer module, VLM core, and Workflow module, with variable stiffness soft grippers for recognizing objects and materials and accurately estimating grasp area, potentially benefiting UAVs in various scenarios."
}