{
    "title": "Leveraging Chat-Based Large Vision Language Models for Multimodal Out-Of-Context Detection",
    "abstract": "arXiv:2403.08776v1 Announce Type: cross  Abstract: Out-of-context (OOC) detection is a challenging task involving identifying images and texts that are irrelevant to the context in which they are presented. Large vision-language models (LVLMs) are effective at various tasks, including image classification and text generation. However, the extent of their proficiency in multimodal OOC detection tasks is unclear. In this paper, we investigate the ability of LVLMs to detect multimodal OOC and show that these models cannot achieve high accuracy on OOC detection tasks without fine-tuning. However, we demonstrate that fine-tuning LVLMs on multimodal OOC datasets can further improve their OOC detection accuracy. To evaluate the performance of LVLMs on OOC detection tasks, we fine-tune MiniGPT-4 on the NewsCLIPpings dataset, a large dataset of multimodal OOC. Our results show that fine-tuning MiniGPT-4 on the NewsCLIPpings dataset significantly improves the OOC detection accuracy in this datas",
    "link": "https://arxiv.org/abs/2403.08776",
    "context": "Title: Leveraging Chat-Based Large Vision Language Models for Multimodal Out-Of-Context Detection\nAbstract: arXiv:2403.08776v1 Announce Type: cross  Abstract: Out-of-context (OOC) detection is a challenging task involving identifying images and texts that are irrelevant to the context in which they are presented. Large vision-language models (LVLMs) are effective at various tasks, including image classification and text generation. However, the extent of their proficiency in multimodal OOC detection tasks is unclear. In this paper, we investigate the ability of LVLMs to detect multimodal OOC and show that these models cannot achieve high accuracy on OOC detection tasks without fine-tuning. However, we demonstrate that fine-tuning LVLMs on multimodal OOC datasets can further improve their OOC detection accuracy. To evaluate the performance of LVLMs on OOC detection tasks, we fine-tune MiniGPT-4 on the NewsCLIPpings dataset, a large dataset of multimodal OOC. Our results show that fine-tuning MiniGPT-4 on the NewsCLIPpings dataset significantly improves the OOC detection accuracy in this datas",
    "path": "papers/24/03/2403.08776.json",
    "total_tokens": 895,
    "translated_title": "利用基于聊天的大规模视觉语言模型进行多模态脱离上下文检测",
    "translated_abstract": "脱离上下文（OOC）检测是一项具有挑战性的任务，涉及识别出上下文中呈现的与图像和文本无关的内容。大型视觉语言模型（LVLMs）在各种任务中表现出效果，包括图像分类和文本生成。然而，LVLMs在多模态OOC检测任务中的熟练程度尚不清楚。在本文中，我们调查了LVLMs检测多模态OOC的能力，并展示这些模型在没有微调的情况下无法在OOC检测任务上达到高准确率。然而，我们证明了在多模态OOC数据集上微调LVLMs可以进一步提高其OOC检测准确性。为了评估LVLMs在OOC检测任务中的性能，我们在NewsCLIPpings数据集上对MiniGPT-4进行微调，该数据集是一个大型的多模态OOC数据集。我们的结果显示，对MiniGPT-4在NewsCLIPpings数据集上进行微调显著提高了该数据集中的OOC检测准确率。",
    "tldr": "LVLMs在多模态脱离上下文检测任务中表现不佳，但在进行微调后可以进一步提高准确性。",
    "en_tdlr": "LVLMs perform poorly in multimodal out-of-context detection tasks, but further improving their accuracy is achievable through fine-tuning."
}