{
    "title": "Automatic Speech Recognition (ASR) for the Diagnosis of pronunciation of Speech Sound Disorders in Korean children",
    "abstract": "arXiv:2403.08187v1 Announce Type: new  Abstract: This study presents a model of automatic speech recognition (ASR) designed to diagnose pronunciation issues in children with speech sound disorders (SSDs) to replace manual transcriptions in clinical procedures. Since ASR models trained for general purposes primarily predict input speech into real words, employing a well-known high-performance ASR model for evaluating pronunciation in children with SSDs is impractical. We fine-tuned the wav2vec 2.0 XLS-R model to recognize speech as pronounced rather than as existing words. The model was fine-tuned with a speech dataset from 137 children with inadequate speech production pronouncing 73 Korean words selected for actual clinical diagnosis. The model's predictions of the pronunciations of the words matched the human annotations with about 90% accuracy. While the model still requires improvement in recognizing unclear pronunciation, this study demonstrates that ASR models can streamline comp",
    "link": "https://arxiv.org/abs/2403.08187",
    "context": "Title: Automatic Speech Recognition (ASR) for the Diagnosis of pronunciation of Speech Sound Disorders in Korean children\nAbstract: arXiv:2403.08187v1 Announce Type: new  Abstract: This study presents a model of automatic speech recognition (ASR) designed to diagnose pronunciation issues in children with speech sound disorders (SSDs) to replace manual transcriptions in clinical procedures. Since ASR models trained for general purposes primarily predict input speech into real words, employing a well-known high-performance ASR model for evaluating pronunciation in children with SSDs is impractical. We fine-tuned the wav2vec 2.0 XLS-R model to recognize speech as pronounced rather than as existing words. The model was fine-tuned with a speech dataset from 137 children with inadequate speech production pronouncing 73 Korean words selected for actual clinical diagnosis. The model's predictions of the pronunciations of the words matched the human annotations with about 90% accuracy. While the model still requires improvement in recognizing unclear pronunciation, this study demonstrates that ASR models can streamline comp",
    "path": "papers/24/03/2403.08187.json",
    "total_tokens": 878,
    "translated_title": "自动语音识别 (ASR) 用于诊断韩国儿童言语声音障碍的发音",
    "translated_abstract": "这项研究提出了一个自动语音识别 (ASR) 模型，旨在诊断患有言语声音障碍 (SSDs) 的儿童的发音问题，以取代临床程序中的手动转录。我们对 wav2vec 2.0 XLS-R 模型进行了微调，使其能够识别实际发音而非现有单词。该模型使用了来自137名言语表达不足的儿童的语音数据集，这些儿童发音73个为实际临床诊断选定的韩语单词。模型对这些单词的发音进行的预测与人工标注的准确率约为90%。尽管模型仍需改进以识别不清楚的发音，但该研究表明 ASR 模型能够简化串行的诊断过程。",
    "tldr": "该研究提出了一个专门用于诊断韩国儿童言语声音障碍发音问题的自动语音识别模型，通过微调 wav2vec 2.0 XLS-R 模型，成功实现了对孩子们发音的高准确度识别。",
    "en_tdlr": "This study presents an automatic speech recognition (ASR) model designed to diagnose pronunciation issues in Korean children with speech sound disorders, achieving high accuracy in recognizing children's pronunciation through fine-tuning the wav2vec 2.0 XLS-R model."
}