{
    "title": "From English to ASIC: Hardware Implementation with Large Language Model",
    "abstract": "arXiv:2403.07039v1 Announce Type: cross  Abstract: In the realm of ASIC engineering, the landscape has been significantly reshaped by the rapid development of LLM, paralleled by an increase in the complexity of modern digital circuits. This complexity has escalated the requirements for HDL coding, necessitating a higher degree of precision and sophistication. However, challenges have been faced due to the less-than-optimal performance of modern language models in generating hardware description code, a situation further exacerbated by the scarcity of the corresponding high-quality code datasets. These challenges have highlighted the gap between the potential of LLMs to revolutionize digital circuit design and their current capabilities in accurately interpreting and implementing hardware specifications. To address these challenges, a strategy focusing on the fine-tuning of the leading-edge nature language model and the reshuffling of the HDL code dataset has been developed. The fine-tu",
    "link": "https://arxiv.org/abs/2403.07039",
    "context": "Title: From English to ASIC: Hardware Implementation with Large Language Model\nAbstract: arXiv:2403.07039v1 Announce Type: cross  Abstract: In the realm of ASIC engineering, the landscape has been significantly reshaped by the rapid development of LLM, paralleled by an increase in the complexity of modern digital circuits. This complexity has escalated the requirements for HDL coding, necessitating a higher degree of precision and sophistication. However, challenges have been faced due to the less-than-optimal performance of modern language models in generating hardware description code, a situation further exacerbated by the scarcity of the corresponding high-quality code datasets. These challenges have highlighted the gap between the potential of LLMs to revolutionize digital circuit design and their current capabilities in accurately interpreting and implementing hardware specifications. To address these challenges, a strategy focusing on the fine-tuning of the leading-edge nature language model and the reshuffling of the HDL code dataset has been developed. The fine-tu",
    "path": "papers/24/03/2403.07039.json",
    "total_tokens": 795,
    "translated_title": "从英语到ASIC：大型语言模型的硬件实现",
    "translated_abstract": "在ASIC工程领域，随着大型语言模型的快速发展，现代数字电路的复杂性也在增加，这加剧了对HDL编码的要求，需要更高的精度和复杂性。然而，由于现代语言模型在生成硬件描述代码方面性能不佳，加之相应高质量的代码数据集稀缺，挑战不断。这些挑战凸显了LLM潜力革新数字电路设计与当前能力准确解释和实施硬件规范之间的差距。为了解决这些挑战，制定了一种专注于领先自然语言模型微调和HDL代码数据集重组的策略。",
    "tldr": "大型语言模型的快速发展改变了ASIC工程领域，但现代语言模型在生成硬件描述代码方面性能不佳，研究重点在于通过微调自然语言模型和重组HDL代码数据集来提高精度和准确性。",
    "en_tdlr": "The rapid development of large language models has reshaped the realm of ASIC engineering, but challenges exist in their suboptimal performance in generating hardware description code, with focus on fine-tuning the models and reshuffling the HDL code dataset to improve accuracy."
}