{
    "title": "Iterative Learning for Joint Image Denoising and Motion Artifact Correction of 3D Brain MRI",
    "abstract": "arXiv:2403.08162v1 Announce Type: cross  Abstract: Image noise and motion artifacts greatly affect the quality of brain MRI and negatively influence downstream medical image analysis. Previous studies often focus on 2D methods that process each volumetric MR image slice-by-slice, thus losing important 3D anatomical information. Additionally, these studies generally treat image denoising and artifact correction as two standalone tasks, without considering their potential relationship, especially on low-quality images where severe noise and motion artifacts occur simultaneously. To address these issues, we propose a Joint image Denoising and motion Artifact Correction (JDAC) framework via iterative learning to handle noisy MRIs with motion artifacts, consisting of an adaptive denoising model and an anti-artifact model. In the adaptive denoising model, we first design a novel noise level estimation strategy, and then adaptively reduce the noise through a U-Net backbone with feature normal",
    "link": "https://arxiv.org/abs/2403.08162",
    "context": "Title: Iterative Learning for Joint Image Denoising and Motion Artifact Correction of 3D Brain MRI\nAbstract: arXiv:2403.08162v1 Announce Type: cross  Abstract: Image noise and motion artifacts greatly affect the quality of brain MRI and negatively influence downstream medical image analysis. Previous studies often focus on 2D methods that process each volumetric MR image slice-by-slice, thus losing important 3D anatomical information. Additionally, these studies generally treat image denoising and artifact correction as two standalone tasks, without considering their potential relationship, especially on low-quality images where severe noise and motion artifacts occur simultaneously. To address these issues, we propose a Joint image Denoising and motion Artifact Correction (JDAC) framework via iterative learning to handle noisy MRIs with motion artifacts, consisting of an adaptive denoising model and an anti-artifact model. In the adaptive denoising model, we first design a novel noise level estimation strategy, and then adaptively reduce the noise through a U-Net backbone with feature normal",
    "path": "papers/24/03/2403.08162.json",
    "total_tokens": 749,
    "translated_title": "三维脑MRI联合图像去噪和运动伪影校正的迭代学习",
    "translated_abstract": "图像噪声和运动伪影严重影响脑部MRI的质量，对下游医学图像分析产生负面影响。本文提出了一种通过迭代学习处理带有噪声和运动伪影的MRI的联合图像去噪和运动伪影修正（JDAC）框架，包括一种自适应去噪模型和一种抗伪影模型。在自适应去噪模型中，首先设计了一种新颖的噪声水平估计策略，然后通过具有特征归一化的U-Net骨干自适应地减少噪声。",
    "tldr": "提出了一种通过迭代学习处理带有噪声和运动伪影的MRI的联合图像去噪和运动伪影修正框架",
    "en_tdlr": "Proposed an iterative learning framework for joint image denoising and motion artifact correction of MRIs with noise and motion artifacts."
}