{
    "title": "Model Uncertainty in Evolutionary Optimization and Bayesian Optimization: A Comparative Analysis",
    "abstract": "arXiv:2403.14413v1 Announce Type: cross  Abstract: Black-box optimization problems, which are common in many real-world applications, require optimization through input-output interactions without access to internal workings. This often leads to significant computational resources being consumed for simulations. Bayesian Optimization (BO) and Surrogate-Assisted Evolutionary Algorithm (SAEA) are two widely used gradient-free optimization techniques employed to address such challenges. Both approaches follow a similar iterative procedure that relies on surrogate models to guide the search process. This paper aims to elucidate the similarities and differences in the utilization of model uncertainty between these two methods, as well as the impact of model inaccuracies on algorithmic performance. A novel model-assisted strategy is introduced, which utilizes unevaluated solutions to generate offspring, leveraging the population-based search capabilities of evolutionary algorithm to enhance ",
    "link": "https://arxiv.org/abs/2403.14413",
    "context": "Title: Model Uncertainty in Evolutionary Optimization and Bayesian Optimization: A Comparative Analysis\nAbstract: arXiv:2403.14413v1 Announce Type: cross  Abstract: Black-box optimization problems, which are common in many real-world applications, require optimization through input-output interactions without access to internal workings. This often leads to significant computational resources being consumed for simulations. Bayesian Optimization (BO) and Surrogate-Assisted Evolutionary Algorithm (SAEA) are two widely used gradient-free optimization techniques employed to address such challenges. Both approaches follow a similar iterative procedure that relies on surrogate models to guide the search process. This paper aims to elucidate the similarities and differences in the utilization of model uncertainty between these two methods, as well as the impact of model inaccuracies on algorithmic performance. A novel model-assisted strategy is introduced, which utilizes unevaluated solutions to generate offspring, leveraging the population-based search capabilities of evolutionary algorithm to enhance ",
    "path": "papers/24/03/2403.14413.json",
    "total_tokens": 744,
    "translated_title": "进化优化和贝叶斯优化中的模型不确定性：一项比较分析",
    "translated_abstract": "黑盒优化问题在许多实际应用中很常见，需要通过输入输出交互来进行优化，而没有访问内部工作原理。贝叶斯优化（BO）和辅助代理进化算法（SAEA）是两种广泛使用的无梯度优化技术，用于解决这些挑战。本文旨在阐明这两种方法在利用模型不确定性方面的相似性和差异，以及模型不准确性对算法性能的影响。引入了一种新颖的模型辅助策略，利用未评估的解决方案生成后代，利用进化算法的基于种群的搜索能力来增强。",
    "tldr": "这项研究比较了进化优化和贝叶斯优化中的模型不确定性，引入了一种新的模型辅助策略以增强算法性能。",
    "en_tdlr": "This study compares the model uncertainty in evolutionary optimization and Bayesian optimization, and introduces a novel model-assisted strategy to enhance algorithm performance."
}