{
    "title": "DiffImpute: Tabular Data Imputation With Denoising Diffusion Probabilistic Model",
    "abstract": "arXiv:2403.13863v1 Announce Type: cross  Abstract: Tabular data plays a crucial role in various domains but often suffers from missing values, thereby curtailing its potential utility. Traditional imputation techniques frequently yield suboptimal results and impose substantial computational burdens, leading to inaccuracies in subsequent modeling tasks. To address these challenges, we propose DiffImpute, a novel Denoising Diffusion Probabilistic Model (DDPM). Specifically, DiffImpute is trained on complete tabular datasets, ensuring that it can produce credible imputations for missing entries without undermining the authenticity of the existing data. Innovatively, it can be applied to various settings of Missing Completely At Random (MCAR) and Missing At Random (MAR). To effectively handle the tabular features in DDPM, we tailor four tabular denoising networks, spanning MLP, ResNet, Transformer, and U-Net. We also propose Harmonization to enhance coherence between observed and imputed d",
    "link": "https://arxiv.org/abs/2403.13863",
    "context": "Title: DiffImpute: Tabular Data Imputation With Denoising Diffusion Probabilistic Model\nAbstract: arXiv:2403.13863v1 Announce Type: cross  Abstract: Tabular data plays a crucial role in various domains but often suffers from missing values, thereby curtailing its potential utility. Traditional imputation techniques frequently yield suboptimal results and impose substantial computational burdens, leading to inaccuracies in subsequent modeling tasks. To address these challenges, we propose DiffImpute, a novel Denoising Diffusion Probabilistic Model (DDPM). Specifically, DiffImpute is trained on complete tabular datasets, ensuring that it can produce credible imputations for missing entries without undermining the authenticity of the existing data. Innovatively, it can be applied to various settings of Missing Completely At Random (MCAR) and Missing At Random (MAR). To effectively handle the tabular features in DDPM, we tailor four tabular denoising networks, spanning MLP, ResNet, Transformer, and U-Net. We also propose Harmonization to enhance coherence between observed and imputed d",
    "path": "papers/24/03/2403.13863.json",
    "total_tokens": 916,
    "translated_title": "用去噪扩散概率模型进行表格数据插补的DiffImpute",
    "translated_abstract": "表格数据在各个领域中起着至关重要的作用，但往往存在缺失值，从而限制了其潜在效用。传统的插值技术通常会产生次优结果，并给后续建模任务带来重大计算负担，导致出现不准确性。为了解决这些挑战，我们提出了DiffImpute，一种新颖的去噪扩散概率模型（DDPM）。具体来说，DiffImpute在完整的表格数据集上进行训练，确保可以为缺失条目生成可信的插补，而不会破坏现有数据的真实性。创新地，它可以应用于缺失完全随机（MCAR）和缺失随机（MAR）的各种情境。为了有效处理DDPM中的表格特征，我们定制了四个表格去噪网络，涵盖MLP、ResNet、Transformer和U-Net。我们还提出了Harmonization来增强观察到的数据和插补数据之间的一致性。",
    "tldr": "提出了DiffImpute，一种基于去噪扩散概率模型的表格数据插补方法，可以有效处理不同类型的缺失数据，并通过定制多个表格去噪网络来增强插补的一致性。"
}