{
    "title": "FairSTG: Countering performance heterogeneity via collaborative sample-level optimization",
    "abstract": "arXiv:2403.12391v1 Announce Type: cross  Abstract: Spatiotemporal learning plays a crucial role in mobile computing techniques to empower smart cites. While existing research has made great efforts to achieve accurate predictions on the overall dataset, they still neglect the significant performance heterogeneity across samples. In this work, we designate the performance heterogeneity as the reason for unfair spatiotemporal learning, which not only degrades the practical functions of models, but also brings serious potential risks to real-world urban applications. To fix this gap, we propose a model-independent Fairness-aware framework for SpatioTemporal Graph learning (FairSTG), which inherits the idea of exploiting advantages of well-learned samples to challenging ones with collaborative mix-up. Specifically, FairSTG consists of a spatiotemporal feature extractor for model initialization, a collaborative representation enhancement for knowledge transfer between well-learned samples a",
    "link": "https://arxiv.org/abs/2403.12391",
    "context": "Title: FairSTG: Countering performance heterogeneity via collaborative sample-level optimization\nAbstract: arXiv:2403.12391v1 Announce Type: cross  Abstract: Spatiotemporal learning plays a crucial role in mobile computing techniques to empower smart cites. While existing research has made great efforts to achieve accurate predictions on the overall dataset, they still neglect the significant performance heterogeneity across samples. In this work, we designate the performance heterogeneity as the reason for unfair spatiotemporal learning, which not only degrades the practical functions of models, but also brings serious potential risks to real-world urban applications. To fix this gap, we propose a model-independent Fairness-aware framework for SpatioTemporal Graph learning (FairSTG), which inherits the idea of exploiting advantages of well-learned samples to challenging ones with collaborative mix-up. Specifically, FairSTG consists of a spatiotemporal feature extractor for model initialization, a collaborative representation enhancement for knowledge transfer between well-learned samples a",
    "path": "papers/24/03/2403.12391.json",
    "total_tokens": 925,
    "translated_title": "FairSTG: 通过协作样本级优化对抗性能异质性",
    "translated_abstract": "arXiv:2403.12391v1 公告类型：跨越  摘要：时空学习在移动计算技术中发挥着关键作用，以赋予智能城市更强大的功能。尽管现有研究已经在整个数据集上取得了准确的预测，但它们仍然忽视了样本之间的显著性能异质性。在这项工作中，我们将性能异质性定为不公平时空学习的原因，这不仅会降低模型的实际功能，还会给现实世界的城市应用带来严重的潜在风险。为了填补这一空白，我们提出了一个模型独立的面向公平性的时空图学习框架FairSTG，借鉴了利用已充分学习样本的优势来协作挑战性样本的思想。具体而言，FairSTG包括一个时空特征提取器用于模型初始化，一个用于知识转移的协作表示增强模块，从已充分学习样本到困难样本。",
    "tldr": "FairSTG通过协作样本级优化对抗性能异质性，提出了一个模型独立的面向公平性的时空图学习框架，通过协作挑战性样本与已学习样本的 mix-up 实现知识转移。",
    "en_tdlr": "FairSTG counters performance heterogeneity by collaborative sample-level optimization, proposing a model-independent fairness-aware framework for spatiotemporal graph learning that transfers knowledge through collaborative mix-up between challenging and well-learned samples."
}