{
    "title": "DART: Implicit Doppler Tomography for Radar Novel View Synthesis",
    "abstract": "arXiv:2403.03896v1 Announce Type: cross  Abstract: Simulation is an invaluable tool for radio-frequency system designers that enables rapid prototyping of various algorithms for imaging, target detection, classification, and tracking. However, simulating realistic radar scans is a challenging task that requires an accurate model of the scene, radio frequency material properties, and a corresponding radar synthesis function. Rather than specifying these models explicitly, we propose DART - Doppler Aided Radar Tomography, a Neural Radiance Field-inspired method which uses radar-specific physics to create a reflectance and transmittance-based rendering pipeline for range-Doppler images. We then evaluate DART by constructing a custom data collection platform and collecting a novel radar dataset together with accurate position and instantaneous velocity measurements from lidar-based localization. In comparison to state-of-the-art baselines, DART synthesizes superior radar range-Doppler imag",
    "link": "https://arxiv.org/abs/2403.03896",
    "context": "Title: DART: Implicit Doppler Tomography for Radar Novel View Synthesis\nAbstract: arXiv:2403.03896v1 Announce Type: cross  Abstract: Simulation is an invaluable tool for radio-frequency system designers that enables rapid prototyping of various algorithms for imaging, target detection, classification, and tracking. However, simulating realistic radar scans is a challenging task that requires an accurate model of the scene, radio frequency material properties, and a corresponding radar synthesis function. Rather than specifying these models explicitly, we propose DART - Doppler Aided Radar Tomography, a Neural Radiance Field-inspired method which uses radar-specific physics to create a reflectance and transmittance-based rendering pipeline for range-Doppler images. We then evaluate DART by constructing a custom data collection platform and collecting a novel radar dataset together with accurate position and instantaneous velocity measurements from lidar-based localization. In comparison to state-of-the-art baselines, DART synthesizes superior radar range-Doppler imag",
    "path": "papers/24/03/2403.03896.json",
    "total_tokens": 818,
    "translated_title": "DART：雷达新视图合成的隐式多普勒层析成像",
    "translated_abstract": "模拟是射频系统设计人员的宝贵工具，可以快速原型化各种用于成像、目标检测、分类和跟踪的算法。本文提出了DART - 多普勒辅助雷达层析成像，这是一种受神经辐射场启发的方法，利用雷达特定的物理学来创建一个基于反射率和透射率的呈现流水线，用于距离-多普勒图像。然后，我们通过构建一个自定义数据收集平台，并与基于激光雷达的定位一起收集了一个新颖的雷达数据集以及准确的位置和瞬时速度测量来评估DART。与最先进的基线方法相比，DART合成了更优越的雷达距离-多普勒图像。",
    "tldr": "DART提出了一种基于雷达特定物理学的隐式多普勒层析成像方法，通过创建反射率和透射率的呈现流水线，实现了优越的雷达距离-多普勒图像合成。",
    "en_tdlr": "DART proposes an implicit Doppler tomography method based on radar-specific physics, which achieves superior radar range-Doppler image synthesis by creating a rendering pipeline of reflectance and transmittance."
}