{
    "title": "Authors' Values and Attitudes Towards AI-bridged Scalable Personalization of Creative Language Arts",
    "abstract": "arXiv:2403.00439v1 Announce Type: cross  Abstract: Generative AI has the potential to create a new form of interactive media: AI-bridged creative language arts (CLA), which bridge the author and audience by personalizing the author's vision to the audience's context and taste at scale. However, it is unclear what the authors' values and attitudes would be regarding AI-bridged CLA. To identify these values and attitudes, we conducted an interview study with 18 authors across eight genres (e.g., poetry, comics) by presenting speculative but realistic AI-bridged CLA scenarios. We identified three benefits derived from the dynamics between author, artifact, and audience: those that 1) authors get from the process, 2) audiences get from the artifact, and 3) authors get from the audience. We found how AI-bridged CLA would either promote or reduce these benefits, along with authors' concerns. We hope our investigation hints at how AI can provide intriguing experiences to CLA audiences while p",
    "link": "https://arxiv.org/abs/2403.00439",
    "context": "Title: Authors' Values and Attitudes Towards AI-bridged Scalable Personalization of Creative Language Arts\nAbstract: arXiv:2403.00439v1 Announce Type: cross  Abstract: Generative AI has the potential to create a new form of interactive media: AI-bridged creative language arts (CLA), which bridge the author and audience by personalizing the author's vision to the audience's context and taste at scale. However, it is unclear what the authors' values and attitudes would be regarding AI-bridged CLA. To identify these values and attitudes, we conducted an interview study with 18 authors across eight genres (e.g., poetry, comics) by presenting speculative but realistic AI-bridged CLA scenarios. We identified three benefits derived from the dynamics between author, artifact, and audience: those that 1) authors get from the process, 2) audiences get from the artifact, and 3) authors get from the audience. We found how AI-bridged CLA would either promote or reduce these benefits, along with authors' concerns. We hope our investigation hints at how AI can provide intriguing experiences to CLA audiences while p",
    "path": "papers/24/03/2403.00439.json",
    "total_tokens": 982,
    "translated_title": "作者对人工智能桥接的可伸缩个性化创意语言艺术的价值观和态度",
    "translated_abstract": "生成式人工智能有潜力创造一种新形式的交互式媒体：人工智能桥接的创意语言艺术（CLA），通过在规模上将作者的愿景个性化地呈现给观众，从而桥接了作者和观众之间的联系。然而，就作者对人工智能桥接的CLA的价值观和态度而言，目前尚不清楚。为了识别这些价值观和态度，我们通过呈现具有推测性但现实的人工智能桥接的CLA场景，对跨越八种流派（如诗歌、漫画）的18位作者进行了访谈研究。我们确定了作者、作品和观众之间的动态带来的三个收益：作者从该过程中获得的收益，观众从作品中获得的收益，以及作者从观众处获得的收益。我们发现了AI桥接的CLA如何会促进或减少这些利益，以及作者的担忧。我们希望我们的调查能够暗示AI如何为CLA观众提供有趣的体验，同时解决了作者的担忧。",
    "tldr": "作者们通过对人工智能桥接的创意语言艺术进行了价值观和态度的研究，发现了AI如何影响作者、作品和观众之间的利益关系，以及作者的担忧。",
    "en_tdlr": "Authors conducted a study on the values and attitudes towards AI-bridged creative language arts, revealing how AI impacts the benefits between authors, artifacts, and audiences, along with authors' concerns."
}