{
    "title": "Emotion Granularity from Text: An Aggregate-Level Indicator of Mental Health",
    "abstract": "arXiv:2403.02281v1 Announce Type: new  Abstract: We are united in how emotions are central to shaping our experiences; and yet, individuals differ greatly in how we each identify, categorize, and express emotions. In psychology, variation in the ability of individuals to differentiate between emotion concepts is called emotion granularity (determined through self-reports of one's emotions). High emotion granularity has been linked with better mental and physical health; whereas low emotion granularity has been linked with maladaptive emotion regulation strategies and poor health outcomes. In this work, we propose computational measures of emotion granularity derived from temporally-ordered speaker utterances in social media (in lieu of self-reports that suffer from various biases). We then investigate the effectiveness of such text-derived measures of emotion granularity in functioning as markers of various mental health conditions (MHCs). We establish baseline measures of emotion gran",
    "link": "https://arxiv.org/abs/2403.02281",
    "context": "Title: Emotion Granularity from Text: An Aggregate-Level Indicator of Mental Health\nAbstract: arXiv:2403.02281v1 Announce Type: new  Abstract: We are united in how emotions are central to shaping our experiences; and yet, individuals differ greatly in how we each identify, categorize, and express emotions. In psychology, variation in the ability of individuals to differentiate between emotion concepts is called emotion granularity (determined through self-reports of one's emotions). High emotion granularity has been linked with better mental and physical health; whereas low emotion granularity has been linked with maladaptive emotion regulation strategies and poor health outcomes. In this work, we propose computational measures of emotion granularity derived from temporally-ordered speaker utterances in social media (in lieu of self-reports that suffer from various biases). We then investigate the effectiveness of such text-derived measures of emotion granularity in functioning as markers of various mental health conditions (MHCs). We establish baseline measures of emotion gran",
    "path": "papers/24/03/2403.02281.json",
    "total_tokens": 833,
    "translated_title": "文本中的情绪细粒度：心理健康的汇总级指标",
    "translated_abstract": "我们在情绪对塑造我们的经历中有共同点，然而，每个人在如何识别、分类和表达情绪方面有很大差异。在心理学中，个体区分情绪概念的能力变化被称为情绪细粒度（通过个体对自己情绪的自我报告来确定）。高情绪细粒度已与更好的心理和身体健康联系在一起；而低情绪细粒度已与应激情绪调节策略和不良健康结果联系在一起。在这项工作中，我们提出从社交媒体中的时间顺序演讲者话语中计算情绪细粒度的计算方法（代替各种偏见的自我报告）。然后我们研究这种文本衍生情绪细粒度措施在作为各种心理健康条件（MHCs）的标记时的有效性。我们建立情绪细粒度的基线措施",
    "tldr": "提出从社交媒体的文本中计算情绪细粒度的方法，并研究其在心理健康条件中作为指标的有效性",
    "en_tdlr": "Proposing computational measures of emotion granularity from text in social media and investigating their effectiveness as markers of various mental health conditions."
}