{
    "title": "Prioritizing Informative Features and Examples for Deep Learning from Noisy Data",
    "abstract": "arXiv:2403.00013v1 Announce Type: new  Abstract: In this dissertation, we propose a systemic framework that prioritizes informative features and examples to enhance each stage of the development process. Specifically, we prioritize informative features and examples and improve the performance of feature learning, data labeling, and data selection. We first propose an approach to extract only informative features that are inherent to solving a target task by using auxiliary out-of-distribution data. We deactivate the noise features in the target distribution by using that in the out-of-distribution data. Next, we introduce an approach that prioritizes informative examples from unlabeled noisy data in order to reduce the labeling cost of active learning. In order to solve the purity-information dilemma, where an attempt to select informative examples induces the selection of many noisy examples, we propose a meta-model that finds the best balance between purity and informativeness. Lastl",
    "link": "https://arxiv.org/abs/2403.00013",
    "context": "Title: Prioritizing Informative Features and Examples for Deep Learning from Noisy Data\nAbstract: arXiv:2403.00013v1 Announce Type: new  Abstract: In this dissertation, we propose a systemic framework that prioritizes informative features and examples to enhance each stage of the development process. Specifically, we prioritize informative features and examples and improve the performance of feature learning, data labeling, and data selection. We first propose an approach to extract only informative features that are inherent to solving a target task by using auxiliary out-of-distribution data. We deactivate the noise features in the target distribution by using that in the out-of-distribution data. Next, we introduce an approach that prioritizes informative examples from unlabeled noisy data in order to reduce the labeling cost of active learning. In order to solve the purity-information dilemma, where an attempt to select informative examples induces the selection of many noisy examples, we propose a meta-model that finds the best balance between purity and informativeness. Lastl",
    "path": "papers/24/03/2403.00013.json",
    "total_tokens": 784,
    "translated_title": "从嘈杂数据中为深度学习优先选择信息特征和样本",
    "translated_abstract": "在这篇论文中，我们提出了一个系统框架，可以优先选择信息特征和样本，以增强开发过程的每个阶段。具体而言，我们优先选择信息特征和样本，并提高特征学习、数据标记和数据选择的性能。我们首先提出一种方法，通过使用辅助的分布数据提取只与解决目标任务相关的信息特征。我们通过使用辅助分布数据中的信息特征来去除目标分布中的噪声特征。接下来，我们引入一种方法，从无标签的嘈杂数据中优先选择信息样本，以降低主动学习的标记成本。为了解决纯度-信息困境，即尝试选择信息样本会导致选择许多噪声样本的问题，我们提出了一个元模型，找到最佳纯度和信息性之间的平衡。",
    "tldr": "提出了一个系统框架，通过优先选择信息特征和样本来增强深度学习中的开发过程"
}