{
    "title": "A Hierarchical Fused Quantum Fuzzy Neural Network for Image Classification",
    "abstract": "arXiv:2403.09318v1 Announce Type: cross  Abstract: Neural network is a powerful learning paradigm for data feature learning in the era of big data. However, most neural network models are deterministic models that ignore the uncertainty of data. Fuzzy neural networks are proposed to address this problem. FDNN is a hierarchical deep neural network that derives information from both fuzzy and neural representations, the representations are then fused to form representation to be classified. FDNN perform well on uncertain data classification tasks. In this paper, we proposed a novel hierarchical fused quantum fuzzy neural network (HQFNN). Different from classical FDNN, HQFNN uses quantum neural networks to learn fuzzy membership functions in fuzzy neural network. We conducted simulated experiment on two types of datasets (Dirty-MNIST and 15-Scene), the results show that the proposed model can outperform several existing methods. In addition, we demonstrate the robustness of the proposed q",
    "link": "https://arxiv.org/abs/2403.09318",
    "context": "Title: A Hierarchical Fused Quantum Fuzzy Neural Network for Image Classification\nAbstract: arXiv:2403.09318v1 Announce Type: cross  Abstract: Neural network is a powerful learning paradigm for data feature learning in the era of big data. However, most neural network models are deterministic models that ignore the uncertainty of data. Fuzzy neural networks are proposed to address this problem. FDNN is a hierarchical deep neural network that derives information from both fuzzy and neural representations, the representations are then fused to form representation to be classified. FDNN perform well on uncertain data classification tasks. In this paper, we proposed a novel hierarchical fused quantum fuzzy neural network (HQFNN). Different from classical FDNN, HQFNN uses quantum neural networks to learn fuzzy membership functions in fuzzy neural network. We conducted simulated experiment on two types of datasets (Dirty-MNIST and 15-Scene), the results show that the proposed model can outperform several existing methods. In addition, we demonstrate the robustness of the proposed q",
    "path": "papers/24/03/2403.09318.json",
    "total_tokens": 841,
    "translated_title": "一种用于图像分类的层级融合量子模糊神经网络",
    "translated_abstract": "神经网络是大数据时代数据特征学习的强大学习范式，然而大多数神经网络模型是忽略数据不确定性的确定性模型。模糊神经网络被提出来解决这个问题。FDNN是层级深度神经网络，从模糊和神经表示中提取信息，然后融合这些表示形成待分类的表示。FDNN在不确定数据分类任务上表现良好。在本文中，我们提出了一种新颖的层级融合量子模糊神经网络（HQFNN）。与经典的FDNN不同，HQFNN使用量子神经网络来学习模糊神经网络中的模糊成员函数。我们在两种数据集（Dirty-MNIST和15-Scene）上进行了模拟实验，结果显示所提出的模型可以胜过几种现有方法。此外，我们展示了所提出的模型的鲁棒性。",
    "tldr": "提出了一种新颖的层级融合量子模糊神经网络（HQFNN），通过使用量子神经网络学习模糊成员函数，在不确定数据分类任务中表现出色。"
}