{
    "title": "Modeling Collaborator: Enabling Subjective Vision Classification With Minimal Human Effort via LLM Tool-Use",
    "abstract": "arXiv:2403.02626v1 Announce Type: cross  Abstract: From content moderation to wildlife conservation, the number of applications that require models to recognize nuanced or subjective visual concepts is growing. Traditionally, developing classifiers for such concepts requires substantial manual effort measured in hours, days, or even months to identify and annotate data needed for training. Even with recently proposed Agile Modeling techniques, which enable rapid bootstrapping of image classifiers, users are still required to spend 30 minutes or more of monotonous, repetitive data labeling just to train a single classifier. Drawing on Fiske's Cognitive Miser theory, we propose a new framework that alleviates manual effort by replacing human labeling with natural language interactions, reducing the total effort required to define a concept by an order of magnitude: from labeling 2,000 images to only 100 plus some natural language interactions. Our framework leverages recent advances in f",
    "link": "https://arxiv.org/abs/2403.02626",
    "context": "Title: Modeling Collaborator: Enabling Subjective Vision Classification With Minimal Human Effort via LLM Tool-Use\nAbstract: arXiv:2403.02626v1 Announce Type: cross  Abstract: From content moderation to wildlife conservation, the number of applications that require models to recognize nuanced or subjective visual concepts is growing. Traditionally, developing classifiers for such concepts requires substantial manual effort measured in hours, days, or even months to identify and annotate data needed for training. Even with recently proposed Agile Modeling techniques, which enable rapid bootstrapping of image classifiers, users are still required to spend 30 minutes or more of monotonous, repetitive data labeling just to train a single classifier. Drawing on Fiske's Cognitive Miser theory, we propose a new framework that alleviates manual effort by replacing human labeling with natural language interactions, reducing the total effort required to define a concept by an order of magnitude: from labeling 2,000 images to only 100 plus some natural language interactions. Our framework leverages recent advances in f",
    "path": "papers/24/03/2403.02626.json",
    "total_tokens": 821,
    "translated_title": "利用LLM工具实现主观视觉分类的协作建模:减少人力投入",
    "translated_abstract": "从内容审核到野生动物保护，需要模型识别微妙或主观视觉概念的应用数量正在增加。传统上，为这类概念开发分类器需要大量手动工作，需要以时、天甚至月来测量识别和注释训练所需数据。即使使用最近提出的敏捷建模技术，可以快速引导图像分类器的训练，用户仍需要花费30分钟甚至更多的单调重复数据标注时间来训练单个分类器。借鉴菲斯克的认知懒汉理论，我们提出了一个新框架，通过用自然语言交互取代人工标注，减少定义概念所需的总体投入一个数量级：从标记2,000张图像到仅需100张图像再加上一些自然语言交互。我们的框架利用了最近在f",
    "tldr": "提出了一个新的框架，利用自然语言交互取代人工标注，将定义视觉概念所需的人力投入减少了一个数量级",
    "en_tdlr": "Proposed a new framework that replaces human labeling with natural language interactions, reducing the human effort needed to define visual concepts by an order of magnitude."
}