{
    "title": "DP-RDM: Adapting Diffusion Models to Private Domains Without Fine-Tuning",
    "abstract": "arXiv:2403.14421v1 Announce Type: new  Abstract: Text-to-image diffusion models have been shown to suffer from sample-level memorization, possibly reproducing near-perfect replica of images that they are trained on, which may be undesirable. To remedy this issue, we develop the first differentially private (DP) retrieval-augmented generation algorithm that is capable of generating high-quality image samples while providing provable privacy guarantees. Specifically, we assume access to a text-to-image diffusion model trained on a small amount of public data, and design a DP retrieval mechanism to augment the text prompt with samples retrieved from a private retrieval dataset. Our \\emph{differentially private retrieval-augmented diffusion model} (DP-RDM) requires no fine-tuning on the retrieval dataset to adapt to another domain, and can use state-of-the-art generative models to generate high-quality image samples while satisfying rigorous DP guarantees. For instance, when evaluated on M",
    "link": "https://arxiv.org/abs/2403.14421",
    "context": "Title: DP-RDM: Adapting Diffusion Models to Private Domains Without Fine-Tuning\nAbstract: arXiv:2403.14421v1 Announce Type: new  Abstract: Text-to-image diffusion models have been shown to suffer from sample-level memorization, possibly reproducing near-perfect replica of images that they are trained on, which may be undesirable. To remedy this issue, we develop the first differentially private (DP) retrieval-augmented generation algorithm that is capable of generating high-quality image samples while providing provable privacy guarantees. Specifically, we assume access to a text-to-image diffusion model trained on a small amount of public data, and design a DP retrieval mechanism to augment the text prompt with samples retrieved from a private retrieval dataset. Our \\emph{differentially private retrieval-augmented diffusion model} (DP-RDM) requires no fine-tuning on the retrieval dataset to adapt to another domain, and can use state-of-the-art generative models to generate high-quality image samples while satisfying rigorous DP guarantees. For instance, when evaluated on M",
    "path": "papers/24/03/2403.14421.json",
    "total_tokens": 856,
    "translated_title": "将扩散模型调整到私有领域而无需微调",
    "translated_abstract": "arXiv:2403.14421v1 公告类型：新的 文摘：文本到图像的扩散模型已经被证明存在样本级别的记忆化问题，可能会复制出与其训练图像几乎完全相同的副本，这可能是不希望看到的。为了解决这个问题，我们开发了第一个能够生成高质量图像样本并提供可证明的隐私保证的差分隐私检索增强生成算法。具体而言，我们假设可以访问一个在少量公共数据上训练的文本到图像扩散模型，并设计一个DP检索机制，以从私有检索数据集中检索的样本来增强文本提示。我们的\\emph{差分隐私检索增强扩散模型}（DP-RDM）在适应另一个领域时无需对检索数据集进行微调，并且可以使用最先进的生成模型生成高质量的图像样本，同时满足严格的差分隐私保证。例如，在评估时",
    "tldr": "开发了第一个差分隐私检索增强生成算法，能够在生成高质量图像样本的同时提供可证明的隐私保证",
    "en_tdlr": "Developed the first differentially private retrieval-augmented generation algorithm that can generate high-quality image samples while providing provable privacy guarantees."
}