{
    "title": "Eternal Sunshine of the Mechanical Mind: The Irreconcilability of Machine Learning and the Right to be Forgotten",
    "abstract": "arXiv:2403.05592v1 Announce Type: cross  Abstract: As we keep rapidly advancing toward an era where artificial intelligence is a constant and normative experience for most of us, we must also be aware of what this vision and this progress entail. By first approximating neural connections and activities in computer circuits and then creating more and more sophisticated versions of this crude approximation, we are now facing an age to come where modern deep learning-based artificial intelligence systems can rightly be called thinking machines, and they are sometimes even lauded for their emergent behavior and black-box approaches. But as we create more powerful electronic brains, with billions of neural connections and parameters, can we guarantee that these mammoths built of artificial neurons will be able to forget the data that we store in them? If they are at some level like a brain, can the right to be forgotten still be protected while dealing with these AIs? The essential gap betw",
    "link": "https://arxiv.org/abs/2403.05592",
    "context": "Title: Eternal Sunshine of the Mechanical Mind: The Irreconcilability of Machine Learning and the Right to be Forgotten\nAbstract: arXiv:2403.05592v1 Announce Type: cross  Abstract: As we keep rapidly advancing toward an era where artificial intelligence is a constant and normative experience for most of us, we must also be aware of what this vision and this progress entail. By first approximating neural connections and activities in computer circuits and then creating more and more sophisticated versions of this crude approximation, we are now facing an age to come where modern deep learning-based artificial intelligence systems can rightly be called thinking machines, and they are sometimes even lauded for their emergent behavior and black-box approaches. But as we create more powerful electronic brains, with billions of neural connections and parameters, can we guarantee that these mammoths built of artificial neurons will be able to forget the data that we store in them? If they are at some level like a brain, can the right to be forgotten still be protected while dealing with these AIs? The essential gap betw",
    "path": "papers/24/03/2403.05592.json",
    "total_tokens": 878,
    "translated_title": "机械头脑的永恒阳光：机器学习与被遗忘权的不可调和性",
    "translated_abstract": "随着我们迅速迈向人工智能成为大多数人不断发生和规范化的时代，我们也必须意识到这一愿景和这一进步蕴含着什么。通过首先近似计算机电路中的神经连接和活动，然后创建越来越复杂版本的这种粗糙近似，我们现在正面临一个未来时代，现代基于深度学习的人工智能系统可以被称为思考机器，有时甚至因其新生行为和黑盒方法而受到称赞。但随着我们创造更强大的电子大脑，具有数十亿的神经连接和参数，我们能确保这些由人工神经构建的庞然大物能够遗忘我们在其中存储的数据吗？如果它们在某种程度上像大脑，那么在应对这些人工智能时，被遗忘的权利仍能得到保护吗？",
    "tldr": "人工智能的发展带来了深度学习系统的出现，但在处理这些人工大脑时，如何保护被遗忘的权利仍然是一个挑战。",
    "en_tdlr": "The development of artificial intelligence has led to the emergence of deep learning systems, but how to protect the right to be forgotten when dealing with these artificial brains remains a challenge."
}