{
    "title": "Exact Enforcement of Temporal Continuity in Sequential Physics-Informed Neural Networks",
    "abstract": "arXiv:2403.03223v1 Announce Type: new  Abstract: The use of deep learning methods in scientific computing represents a potential paradigm shift in engineering problem solving. One of the most prominent developments is Physics-Informed Neural Networks (PINNs), in which neural networks are trained to satisfy partial differential equations (PDEs) and/or observed data. While this method shows promise, the standard version has been shown to struggle in accurately predicting the dynamic behavior of time-dependent problems. To address this challenge, methods have been proposed that decompose the time domain into multiple segments, employing a distinct neural network in each segment and directly incorporating continuity between them in the loss function of the minimization problem. In this work we introduce a method to exactly enforce continuity between successive time segments via a solution ansatz. This hard constrained sequential PINN (HCS-PINN) method is simple to implement and eliminates ",
    "link": "https://arxiv.org/abs/2403.03223",
    "context": "Title: Exact Enforcement of Temporal Continuity in Sequential Physics-Informed Neural Networks\nAbstract: arXiv:2403.03223v1 Announce Type: new  Abstract: The use of deep learning methods in scientific computing represents a potential paradigm shift in engineering problem solving. One of the most prominent developments is Physics-Informed Neural Networks (PINNs), in which neural networks are trained to satisfy partial differential equations (PDEs) and/or observed data. While this method shows promise, the standard version has been shown to struggle in accurately predicting the dynamic behavior of time-dependent problems. To address this challenge, methods have been proposed that decompose the time domain into multiple segments, employing a distinct neural network in each segment and directly incorporating continuity between them in the loss function of the minimization problem. In this work we introduce a method to exactly enforce continuity between successive time segments via a solution ansatz. This hard constrained sequential PINN (HCS-PINN) method is simple to implement and eliminates ",
    "path": "papers/24/03/2403.03223.json",
    "total_tokens": 859,
    "translated_title": "在顺序物理信息神经网络中精确执⾏时间连续性",
    "translated_abstract": "科学计算中深度学习方法的应⽤代表了⼯程问题解决⽅法的潜在范式转变。最显著的发展之⼀是物理信息神经⽹络（PINNs），其中神经⽹络被训练以满⾜偏微分⽅程（PDEs）和/或观察数据。尽管此⽅法有希望，但标准版本已被证明在准确预测时间相关问题的动态⾏为⽅⾯存在困难。为了解决这⼀挑战，已经提出⽅法将时间域分解为多个段，每个段中使⽤⼀个不同的神经⽹络，并直接在最⼩化问题的损失函数中将它们之间的连续性纳⼊其中。在本⼯作中，我们引⼊⼀种通过解析解精确强制实现连续性的⽅法。这种⽅法简单易⽤，能够消除",
    "tldr": "精确执⾏时间连续性是本论⽂的⼀项重要创新，简化了解决时间相关问题动态⾏为预测困难的挑战。",
    "en_tdlr": "The exact enforcement of temporal continuity is a key innovation in this paper, simplifying the challenge of accurately predicting the dynamic behavior of time-dependent problems."
}