{
    "title": "FLAP: Flow Adhering Planning with Constrained Decoding in LLMs",
    "abstract": "arXiv:2403.05766v1 Announce Type: new  Abstract: Planning is a crucial task for agents in task oriented dialogs (TODs). Human agents typically resolve user issues by following predefined workflows, decomposing workflow steps into actionable items, and performing actions by executing APIs in order; all of which require reasoning and planning. With the recent advances in LLMs, there have been increasing attempts to use LLMs for task planning and API usage. However, the faithfulness of the plans to predefined workflows and API dependencies, is not guaranteed with LLMs because of their bias towards pretraining data. Moreover, in real life, workflows are custom-defined and prone to change, hence, quickly adapting agents to the changes is desirable. In this paper, we study faithful planning in TODs to resolve user intents by following predefined flows and preserving API dependencies. We propose a constrained decoding algorithm based on lookahead heuristic for faithful planning. Our algorithm",
    "link": "https://arxiv.org/abs/2403.05766",
    "context": "Title: FLAP: Flow Adhering Planning with Constrained Decoding in LLMs\nAbstract: arXiv:2403.05766v1 Announce Type: new  Abstract: Planning is a crucial task for agents in task oriented dialogs (TODs). Human agents typically resolve user issues by following predefined workflows, decomposing workflow steps into actionable items, and performing actions by executing APIs in order; all of which require reasoning and planning. With the recent advances in LLMs, there have been increasing attempts to use LLMs for task planning and API usage. However, the faithfulness of the plans to predefined workflows and API dependencies, is not guaranteed with LLMs because of their bias towards pretraining data. Moreover, in real life, workflows are custom-defined and prone to change, hence, quickly adapting agents to the changes is desirable. In this paper, we study faithful planning in TODs to resolve user intents by following predefined flows and preserving API dependencies. We propose a constrained decoding algorithm based on lookahead heuristic for faithful planning. Our algorithm",
    "path": "papers/24/03/2403.05766.json",
    "total_tokens": 866,
    "translated_title": "FLAP: 在LLMs中具有受限解码的流程遵循规划",
    "translated_abstract": "计划对于任务导向对话中的代理人是至关重要的任务。人类代理人通常通过遵循预定义的工作流程解决用户问题，将工作流程步骤分解为可操作项目，并通过执行API执行操作；所有这些都需要推理和规划。鉴于LLMs的最新进展，人们越来越多地尝试使用LLMs进行任务规划和API使用。然而，由于LLMs偏向预训练数据，计划与预定义工作流程和API依赖性的忠实性并不被保证。此外，在现实生活中，工作流程是自定义的并且容易更改，因此，快速使代理人适应变化是可取的。在本文中，我们研究了在任务导向对话中通过遵循预定义流程和保留API依赖性解决用户意图的忠实规划。我们提出了一种基于前瞻启发式的受限解码算法用于忠实规划。",
    "tldr": "本文研究了在任务导向对话中通过遵循预定义流程和保留API依赖性解决用户意图的忠实规划，提出了一种基于前瞻启发式的受限解码算法。",
    "en_tdlr": "This paper studies faithful planning in task oriented dialogs to resolve user intents by following predefined flows and preserving API dependencies, proposing a constrained decoding algorithm based on lookahead heuristic."
}