{
    "title": "Bidirectional Progressive Neural Networks with Episodic Return Progress for Emergent Task Sequencing and Robotic Skill Transfer",
    "abstract": "arXiv:2403.04001v1 Announce Type: cross  Abstract: Human brain and behavior provide a rich venue that can inspire novel control and learning methods for robotics. In an attempt to exemplify such a development by inspiring how humans acquire knowledge and transfer skills among tasks, we introduce a novel multi-task reinforcement learning framework named Episodic Return Progress with Bidirectional Progressive Neural Networks (ERP-BPNN). The proposed ERP-BPNN model (1) learns in a human-like interleaved manner by (2) autonomous task switching based on a novel intrinsic motivation signal and, in contrast to existing methods, (3) allows bidirectional skill transfer among tasks. ERP-BPNN is a general architecture applicable to several multi-task learning settings; in this paper, we present the details of its neural architecture and show its ability to enable effective learning and skill transfer among morphologically different robots in a reaching task. The developed Bidirectional Progressiv",
    "link": "https://arxiv.org/abs/2403.04001",
    "context": "Title: Bidirectional Progressive Neural Networks with Episodic Return Progress for Emergent Task Sequencing and Robotic Skill Transfer\nAbstract: arXiv:2403.04001v1 Announce Type: cross  Abstract: Human brain and behavior provide a rich venue that can inspire novel control and learning methods for robotics. In an attempt to exemplify such a development by inspiring how humans acquire knowledge and transfer skills among tasks, we introduce a novel multi-task reinforcement learning framework named Episodic Return Progress with Bidirectional Progressive Neural Networks (ERP-BPNN). The proposed ERP-BPNN model (1) learns in a human-like interleaved manner by (2) autonomous task switching based on a novel intrinsic motivation signal and, in contrast to existing methods, (3) allows bidirectional skill transfer among tasks. ERP-BPNN is a general architecture applicable to several multi-task learning settings; in this paper, we present the details of its neural architecture and show its ability to enable effective learning and skill transfer among morphologically different robots in a reaching task. The developed Bidirectional Progressiv",
    "path": "papers/24/03/2403.04001.json",
    "total_tokens": 909,
    "translated_title": "具有双向进步神经网络和情节回归进展的新兴任务排序和机器人技能迁移",
    "translated_abstract": "人类大脑和行为提供了一个丰富的场景，可以启发机器人的新型控制和学习方法。为了通过激发人类如何获取知识并在任务之间传递技能来展示这样一种发展，我们引入了一种名为具有双向进步神经网络的情节回归进展（ERP-BPNN）的新型多任务强化学习框架。提出的ERP-BPNN模型（1）通过人类般交叉的方式学习，通过一种新颖的内在激励信号实现自主任务切换，并且与现有方法不同，（3）允许在任务之间进行双向技能传递。ERP-BPNN是一个通用架构，适用于几种多任务学习设置；在本文中，我们介绍了其神经结构的细节，并展示了它在不同机器人形态的触碰任务中实现有效学习和技能传递的能力。",
    "tldr": "提出了一种名为具有双向进步神经网络的情节回归进展（ERP-BPNN）的新型多任务强化学习框架，通过人类般交叉的方式学习，实现自主任务切换，并允许在任务之间进行双向技能传递。",
    "en_tdlr": "Proposed a novel multi-task reinforcement learning framework named Episodic Return Progress with Bidirectional Progressive Neural Networks (ERP-BPNN), which learns in a human-like interleaved manner, enables autonomous task switching, and allows bidirectional skill transfer among tasks."
}