{
    "title": "Integrating Efficient Optimal Transport and Functional Maps For Unsupervised Shape Correspondence Learning",
    "abstract": "arXiv:2403.01781v1 Announce Type: cross  Abstract: In the realm of computer vision and graphics, accurately establishing correspondences between geometric 3D shapes is pivotal for applications like object tracking, registration, texture transfer, and statistical shape analysis. Moving beyond traditional hand-crafted and data-driven feature learning methods, we incorporate spectral methods with deep learning, focusing on functional maps (FMs) and optimal transport (OT). Traditional OT-based approaches, often reliant on entropy regularization OT in learning-based framework, face computational challenges due to their quadratic cost. Our key contribution is to employ the sliced Wasserstein distance (SWD) for OT, which is a valid fast optimal transport metric in an unsupervised shape matching framework. This unsupervised framework integrates functional map regularizers with a novel OT-based loss derived from SWD, enhancing feature alignment between shapes treated as discrete probability mea",
    "link": "https://arxiv.org/abs/2403.01781",
    "context": "Title: Integrating Efficient Optimal Transport and Functional Maps For Unsupervised Shape Correspondence Learning\nAbstract: arXiv:2403.01781v1 Announce Type: cross  Abstract: In the realm of computer vision and graphics, accurately establishing correspondences between geometric 3D shapes is pivotal for applications like object tracking, registration, texture transfer, and statistical shape analysis. Moving beyond traditional hand-crafted and data-driven feature learning methods, we incorporate spectral methods with deep learning, focusing on functional maps (FMs) and optimal transport (OT). Traditional OT-based approaches, often reliant on entropy regularization OT in learning-based framework, face computational challenges due to their quadratic cost. Our key contribution is to employ the sliced Wasserstein distance (SWD) for OT, which is a valid fast optimal transport metric in an unsupervised shape matching framework. This unsupervised framework integrates functional map regularizers with a novel OT-based loss derived from SWD, enhancing feature alignment between shapes treated as discrete probability mea",
    "path": "papers/24/03/2403.01781.json",
    "total_tokens": 844,
    "translated_title": "整合高效的最优输运和功能映射，用于无监督形状对应学习",
    "translated_abstract": "在计算机视觉和图形领域中，准确建立几何3D形状之间的对应对于对象跟踪、配准、纹理转移和统计形状分析等应用至关重要。我们将光谱方法与深度学习相结合，聚焦于功能映射（FMs）和最优输运（OT），从而超越传统的手工制作和数据驱动特征学习方法。我们的关键贡献是采用切片Wasserstein距离（SWD）用于OT，这是一种在无监督形状匹配框架中有效且快速的最优输运度量。该无监督框架将功能映射正则化器与从SWD导出的新型OT损失集成在一起，增强了被视为离散概率测度的形状之间的特征对齐。",
    "tldr": "该论文将光谱方法与深度学习相结合，通过使用切片Wasserstein距离（SWD）进行最优输运，在无监督形状匹配框架中实现了功能映射和最优输运的高效整合。",
    "en_tdlr": "This paper integrates spectral methods with deep learning to efficiently combine functional maps and optimal transport using sliced Wasserstein distance (SWD) in an unsupervised shape matching framework."
}