{
    "title": "End-to-End Mineral Exploration with Artificial Intelligence and Ambient Noise Tomography",
    "abstract": "arXiv:2403.15095v1 Announce Type: cross  Abstract: This paper presents an innovative end-to-end workflow for mineral exploration, integrating ambient noise tomography (ANT) and artificial intelligence (AI) to enhance the discovery and delineation of mineral resources essential for the global transition to a low carbon economy. We focus on copper as a critical element, required in significant quantities for renewable energy solutions. We show the benefits of utilising ANT, characterised by its speed, scalability, depth penetration, resolution, and low environmental impact, alongside artificial intelligence (AI) techniques to refine a continent-scale prospectivity model at the deposit scale by fine-tuning our model on local high-resolution data. We show the promise of the method by first presenting a new data-driven AI prospectivity model for copper within Australia, which serves as our foundation model for further fine-tuning. We then focus on the Hillside IOCG deposit on the prospectiv",
    "link": "https://arxiv.org/abs/2403.15095",
    "context": "Title: End-to-End Mineral Exploration with Artificial Intelligence and Ambient Noise Tomography\nAbstract: arXiv:2403.15095v1 Announce Type: cross  Abstract: This paper presents an innovative end-to-end workflow for mineral exploration, integrating ambient noise tomography (ANT) and artificial intelligence (AI) to enhance the discovery and delineation of mineral resources essential for the global transition to a low carbon economy. We focus on copper as a critical element, required in significant quantities for renewable energy solutions. We show the benefits of utilising ANT, characterised by its speed, scalability, depth penetration, resolution, and low environmental impact, alongside artificial intelligence (AI) techniques to refine a continent-scale prospectivity model at the deposit scale by fine-tuning our model on local high-resolution data. We show the promise of the method by first presenting a new data-driven AI prospectivity model for copper within Australia, which serves as our foundation model for further fine-tuning. We then focus on the Hillside IOCG deposit on the prospectiv",
    "path": "papers/24/03/2403.15095.json",
    "total_tokens": 877,
    "translated_title": "利用人工智能和环境噪声层析成像的端到端矿产勘探",
    "translated_abstract": "本文提出了一种创新的端到端工作流程，将环境噪声层析成像（ANT）和人工智能（AI）相结合，以增强对矿产资源的发现和描绘，这对全球转向低碳经济至关重要。我们集中讨论铜作为一种关键元素，可在可再生能源解决方案中大量需要。我们展示了利用ANT的好处，其特点是速度快、可伸缩、穿透深度高、分辨率高和环境影响小，结合人工智能（AI）技术，在本地高分辨率数据上微调我们的模型，在矿床尺度上细化所在大陆尺度上远景性的模型。我们首先展示了针对澳大利亚铜矿的新一代数据驱动的AI远景模型，作为我们进一步微调的基础模型。然后我们专注于Hillside IOCG矿床的远景。",
    "tldr": "该论文提出了一种端到端工作流程，将环境噪声层析成像（ANT）和人工智能（AI）相结合，以增强对于铜等矿产资源的发现和描绘。",
    "en_tdlr": "This paper introduces an end-to-end workflow that integrates ambient noise tomography (ANT) and artificial intelligence (AI) to enhance the discovery and delineation of mineral resources like copper."
}