{
    "title": "Can Factual Statements be Deceptive? The DeFaBel Corpus of Belief-based Deception",
    "abstract": "arXiv:2403.10185v1 Announce Type: new  Abstract: If a person firmly believes in a non-factual statement, such as \"The Earth is flat\", and argues in its favor, there is no inherent intention to deceive. As the argumentation stems from genuine belief, it may be unlikely to exhibit the linguistic properties associated with deception or lying. This interplay of factuality, personal belief, and intent to deceive remains an understudied area. Disentangling the influence of these variables in argumentation is crucial to gain a better understanding of the linguistic properties attributed to each of them. To study the relation between deception and factuality, based on belief, we present the DeFaBel corpus, a crowd-sourced resource of belief-based deception. To create this corpus, we devise a study in which participants are instructed to write arguments supporting statements like \"eating watermelon seeds can cause indigestion\", regardless of its factual accuracy or their personal beliefs about ",
    "link": "https://arxiv.org/abs/2403.10185",
    "context": "Title: Can Factual Statements be Deceptive? The DeFaBel Corpus of Belief-based Deception\nAbstract: arXiv:2403.10185v1 Announce Type: new  Abstract: If a person firmly believes in a non-factual statement, such as \"The Earth is flat\", and argues in its favor, there is no inherent intention to deceive. As the argumentation stems from genuine belief, it may be unlikely to exhibit the linguistic properties associated with deception or lying. This interplay of factuality, personal belief, and intent to deceive remains an understudied area. Disentangling the influence of these variables in argumentation is crucial to gain a better understanding of the linguistic properties attributed to each of them. To study the relation between deception and factuality, based on belief, we present the DeFaBel corpus, a crowd-sourced resource of belief-based deception. To create this corpus, we devise a study in which participants are instructed to write arguments supporting statements like \"eating watermelon seeds can cause indigestion\", regardless of its factual accuracy or their personal beliefs about ",
    "path": "papers/24/03/2403.10185.json",
    "total_tokens": 932,
    "translated_title": "可以欺骗性地陈述事实吗？基于信仰的欺骗DeFaBel语料库",
    "translated_abstract": "如果一个人坚信一个非事实性的陈述，比如“地球是平的”，并为其辩护，那么他并没有本质上的欺骗意图。由于论证源于真诚的信念，它可能不太可能展示出与欺骗或撒谎相关的语言特征。事实性、个人信念和欺骗意图之间的相互作用仍然是一个未经充分研究的领域。解开这些变量在论证中的影响对于更好地理解归因于每一个的语言特征至关重要。为了研究基于信念的欺骗与事实性之间的关系，我们提出了DeFaBel语料库，这是一个基于信仰的欺骗的众包资源。为了创建这个语料库，我们设计了一个研究，要求参与者撰写支持诸如“食用西瓜籽可能导致消化不良”的陈述，而不论其事实准确性或个人信念如何。",
    "tldr": "论文提出了DeFaBel语料库，这是一个基于信仰的欺骗的众包资源，用于研究欺骗与事实性之间的关系，并强调了论证中事实性、个人信念和欺骗意图之间的重要性。",
    "en_tdlr": "The paper introduces the DeFaBel corpus, a crowd-sourced resource of belief-based deception, to study the relationship between deception and factuality, emphasizing the importance of factuality, personal belief, and intent to deceive in arguments."
}