{
    "title": "Enhanced Generative Recommendation via Content and Collaboration Integration",
    "abstract": "arXiv:2403.18480v1 Announce Type: new  Abstract: Generative recommendation has emerged as a promising paradigm aimed at augmenting recommender systems with recent advancements in generative artificial intelligence. This task has been formulated as a sequence-to-sequence generation process, wherein the input sequence encompasses data pertaining to the user's previously interacted items, and the output sequence denotes the generative identifier for the suggested item. However, existing generative recommendation approaches still encounter challenges in (i) effectively integrating user-item collaborative signals and item content information within a unified generative framework, and (ii) executing an efficient alignment between content information and collaborative signals.   In this paper, we introduce content-based collaborative generation for recommender systems, denoted as ColaRec. To capture collaborative signals, the generative item identifiers are derived from a pretrained collabora",
    "link": "https://arxiv.org/abs/2403.18480",
    "context": "Title: Enhanced Generative Recommendation via Content and Collaboration Integration\nAbstract: arXiv:2403.18480v1 Announce Type: new  Abstract: Generative recommendation has emerged as a promising paradigm aimed at augmenting recommender systems with recent advancements in generative artificial intelligence. This task has been formulated as a sequence-to-sequence generation process, wherein the input sequence encompasses data pertaining to the user's previously interacted items, and the output sequence denotes the generative identifier for the suggested item. However, existing generative recommendation approaches still encounter challenges in (i) effectively integrating user-item collaborative signals and item content information within a unified generative framework, and (ii) executing an efficient alignment between content information and collaborative signals.   In this paper, we introduce content-based collaborative generation for recommender systems, denoted as ColaRec. To capture collaborative signals, the generative item identifiers are derived from a pretrained collabora",
    "path": "papers/24/03/2403.18480.json",
    "total_tokens": 697,
    "translated_title": "通过内容和协作集成增强生成式推荐",
    "translated_abstract": "生成式推荐已经出现作为一种有前途的范式，旨在通过生成式人工智能的最新进展来增强推荐系统。本任务被制定为一个序列到序列的生成过程，其中输入序列包含与用户先前交互的项目相关的数据，输出序列表示建议项目的生成标识符。然而，现有的生成式推荐方法仍然面临着以下挑战：有效地在统一生成框架内集成用户-项目协作信号和项目内容信息，以及在内容信息和协作信号之间执行高效的对齐。",
    "tldr": "本文引入了一种基于内容的协作生成式推荐系统ColaRec，旨在解决生成式推荐中的协作信号集成和信息对齐的挑战。",
    "en_tdlr": "This paper introduces a content-based collaborative generative recommendation system, ColaRec, aiming to address the challenges of integrating collaborative signals and aligning information in generative recommendation."
}