{
    "title": "Over-The-Air Double-Threshold Deep Learner for Jamming Detection in 5G RF domain",
    "abstract": "arXiv:2403.02645v1 Announce Type: cross  Abstract: With the evolution of 5G wireless communications, the Synchronization Signal Block (SSB) plays a critical role in the synchronization of devices and accessibility of services. However, due to the predictable nature of SSB transmission, including the Primary and Secondary Synchronization Signals (PSS and SSS), jamming attacks are critical threats. By leveraging RF domain knowledge, this work presents a novel deep learning-based technique for detecting jammers in 5G networks. Unlike the existing jamming detection algorithms that mostly rely on network parameters, we introduce a double threshold deep learning jamming detector by focusing on the SSB. The detection method is focused on RF domain features and improves the robustness of the network without requiring integration with the pre-existing network infrastructure. By integrating a preprocessing block that extracts PSS correlation and energy per null resource elements (EPNRE) characte",
    "link": "https://arxiv.org/abs/2403.02645",
    "context": "Title: Over-The-Air Double-Threshold Deep Learner for Jamming Detection in 5G RF domain\nAbstract: arXiv:2403.02645v1 Announce Type: cross  Abstract: With the evolution of 5G wireless communications, the Synchronization Signal Block (SSB) plays a critical role in the synchronization of devices and accessibility of services. However, due to the predictable nature of SSB transmission, including the Primary and Secondary Synchronization Signals (PSS and SSS), jamming attacks are critical threats. By leveraging RF domain knowledge, this work presents a novel deep learning-based technique for detecting jammers in 5G networks. Unlike the existing jamming detection algorithms that mostly rely on network parameters, we introduce a double threshold deep learning jamming detector by focusing on the SSB. The detection method is focused on RF domain features and improves the robustness of the network without requiring integration with the pre-existing network infrastructure. By integrating a preprocessing block that extracts PSS correlation and energy per null resource elements (EPNRE) characte",
    "path": "papers/24/03/2403.02645.json",
    "total_tokens": 887,
    "translated_title": "在5G RF领域，用于干扰检测的空中双阈值深度学习器",
    "translated_abstract": "随着5G无线通信的发展，同步信号块（SSB）在设备同步和服务可访问性中起着关键作用。然而，由于SSB传输具有可预测性，包括主要同步信号（PSS）和次要同步信号（SSS），干扰攻击是重要威胁。本文利用RF领域知识，提出了一种新颖的基于深度学习的5G网络干扰检测技术。与现有的大多依赖网络参数的干扰检测算法不同，我们通过专注于SSB引入了双阈值深度学习干扰检测器。该检测方法侧重于RF领域特征，提高了网络的鲁棒性，无需与现有网络基础设施集成。通过集成一个预处理块来提取PSS相关性和每个空闲资源元素的能量（EPNRE）",
    "tldr": "本文提出了一种在5G网络中检测干扰者的新型深度学习技术，通过引入双阈值深度学习干扰检测器，专注于SSB的RF领域特征，提高了网络的鲁棒性。",
    "en_tdlr": "This work presents a novel deep learning-based technique for detecting jammers in 5G networks by introducing a double threshold deep learning jamming detector that focuses on RF domain features of the SSB, improving network robustness."
}