{
    "title": "Digital Video Manipulation Detection Technique Based on Compression Algorithms",
    "abstract": "arXiv:2403.07891v1 Announce Type: cross  Abstract: Digital images and videos play a very important role in everyday life. Nowadays, people have access the affordable mobile devices equipped with advanced integrated cameras and powerful image processing applications. Technological development facilitates not only the generation of multimedia content, but also the intentional modification of it, either with recreational or malicious purposes. This is where forensic techniques to detect manipulation of images and videos become essential. This paper proposes a forensic technique by analysing compression algorithms used by the H.264 coding. The presence of recompression uses information of macroblocks, a characteristic of the H.264-MPEG4 standard, and motion vectors. A Vector Support Machine is used to create the model that allows to accurately detect if a video has been recompressed.",
    "link": "https://arxiv.org/abs/2403.07891",
    "context": "Title: Digital Video Manipulation Detection Technique Based on Compression Algorithms\nAbstract: arXiv:2403.07891v1 Announce Type: cross  Abstract: Digital images and videos play a very important role in everyday life. Nowadays, people have access the affordable mobile devices equipped with advanced integrated cameras and powerful image processing applications. Technological development facilitates not only the generation of multimedia content, but also the intentional modification of it, either with recreational or malicious purposes. This is where forensic techniques to detect manipulation of images and videos become essential. This paper proposes a forensic technique by analysing compression algorithms used by the H.264 coding. The presence of recompression uses information of macroblocks, a characteristic of the H.264-MPEG4 standard, and motion vectors. A Vector Support Machine is used to create the model that allows to accurately detect if a video has been recompressed.",
    "path": "papers/24/03/2403.07891.json",
    "total_tokens": 804,
    "translated_title": "基于压缩算法的数字视频篡改检测技术",
    "translated_abstract": "数字图像和视频在日常生活中起着非常重要的作用。如今，人们可以使用配备先进集成摄像头和强大图像处理应用程序的可负担移动设备。技术的发展不仅促进了多媒体内容的生成，也促进了有意对其进行修改，无论是出于娱乐目的还是恶意目的。在这种情况下，必不可少的是用于检测图像和视频篡改的取证技术。本文提出了一种通过分析H.264编码使用的压缩算法的取证技术。重新压缩的存在使用了宏块信息，这是H.264-MPEG4标准的特点，以及运动矢量。使用矢量支持机构建立模型，可以准确检测视频是否已经重新压缩。",
    "tldr": "该论文提出了一种基于H.264编码压缩算法的数字视频篡改检测技术，通过分析宏块信息和运动矢量，利用矢量支持机构建立模型，成功实现对视频重新压缩的准确检测。",
    "en_tdlr": "This paper proposes a digital video manipulation detection technique based on compression algorithms used by the H.264 coding, utilizing macroblock information and motion vectors to create a model with a Vector Support Machine for accurately detecting video recompression."
}