{
    "title": "Autonomous Robotic Arm Manipulation for Planetary Missions using Causal Machine Learning",
    "abstract": "arXiv:2403.00470v1 Announce Type: cross  Abstract: Autonomous robotic arm manipulators have the potential to make planetary exploration and in-situ resource utilization missions more time efficient and productive, as the manipulator can handle the objects itself and perform goal-specific actions. We train a manipulator to autonomously study objects of which it has no prior knowledge, such as planetary rocks. This is achieved using causal machine learning in a simulated planetary environment. Here, the manipulator interacts with objects, and classifies them based on differing causal factors. These are parameters, such as mass or friction coefficient, that causally determine the outcomes of its interactions. Through reinforcement learning, the manipulator learns to interact in ways that reveal the underlying causal factors. We show that this method works even without any prior knowledge of the objects, or any previously-collected training data. We carry out the training in planetary expl",
    "link": "https://arxiv.org/abs/2403.00470",
    "context": "Title: Autonomous Robotic Arm Manipulation for Planetary Missions using Causal Machine Learning\nAbstract: arXiv:2403.00470v1 Announce Type: cross  Abstract: Autonomous robotic arm manipulators have the potential to make planetary exploration and in-situ resource utilization missions more time efficient and productive, as the manipulator can handle the objects itself and perform goal-specific actions. We train a manipulator to autonomously study objects of which it has no prior knowledge, such as planetary rocks. This is achieved using causal machine learning in a simulated planetary environment. Here, the manipulator interacts with objects, and classifies them based on differing causal factors. These are parameters, such as mass or friction coefficient, that causally determine the outcomes of its interactions. Through reinforcement learning, the manipulator learns to interact in ways that reveal the underlying causal factors. We show that this method works even without any prior knowledge of the objects, or any previously-collected training data. We carry out the training in planetary expl",
    "path": "papers/24/03/2403.00470.json",
    "total_tokens": 788,
    "translated_title": "使用因果机器学习进行行星任务的自主机器臂操作",
    "translated_abstract": "自主机器臂操作具有潜力使行星探测和原位资源利用任务更加高效和有成效，因为机器臂可以自行处理物体并执行特定目标的动作。我们在模拟行星环境中训练机器臂自主研究其没有先前知识的物体，例如行星岩石。机器臂与物体互动，并根据不同的因果因素对其进行分类，这些因素是诸如质量或摩擦系数之类的参数，确定其互动结果的因果关系。通过强化学习，机器臂学会以揭示潜在因果因素的方式互动。我们展示了即使没有任何先前关于物体的知识或以前收集的训练数据，这种方法也可以运作。我们在行星探索环境中进行训练。",
    "tldr": "使用因果机器学习，在模拟行星环境中训练机器臂自主研究并互动物体，以揭示潜在的因果因素。",
    "en_tdlr": "Training a robotic arm autonomously in a simulated planetary environment using causal machine learning to interact with and study objects, revealing underlying causal factors."
}