{
    "title": "Removing the need for ground truth UWB data collection: self-supervised ranging error correction using deep reinforcement learning",
    "abstract": "arXiv:2403.19262v1 Announce Type: cross  Abstract: Indoor positioning using UWB technology has gained interest due to its centimeter-level accuracy potential. However, multipath effects and non-line-of-sight conditions cause ranging errors between anchors and tags. Existing approaches for mitigating these ranging errors rely on collecting large labeled datasets, making them impractical for real-world deployments. This paper proposes a novel self-supervised deep reinforcement learning approach that does not require labeled ground truth data. A reinforcement learning agent uses the channel impulse response as a state and predicts corrections to minimize the error between corrected and estimated ranges. The agent learns, self-supervised, by iteratively improving corrections that are generated by combining the predictability of trajectories with filtering and smoothening. Experiments on real-world UWB measurements demonstrate comparable performance to state-of-the-art supervised methods, o",
    "link": "https://arxiv.org/abs/2403.19262",
    "context": "Title: Removing the need for ground truth UWB data collection: self-supervised ranging error correction using deep reinforcement learning\nAbstract: arXiv:2403.19262v1 Announce Type: cross  Abstract: Indoor positioning using UWB technology has gained interest due to its centimeter-level accuracy potential. However, multipath effects and non-line-of-sight conditions cause ranging errors between anchors and tags. Existing approaches for mitigating these ranging errors rely on collecting large labeled datasets, making them impractical for real-world deployments. This paper proposes a novel self-supervised deep reinforcement learning approach that does not require labeled ground truth data. A reinforcement learning agent uses the channel impulse response as a state and predicts corrections to minimize the error between corrected and estimated ranges. The agent learns, self-supervised, by iteratively improving corrections that are generated by combining the predictability of trajectories with filtering and smoothening. Experiments on real-world UWB measurements demonstrate comparable performance to state-of-the-art supervised methods, o",
    "path": "papers/24/03/2403.19262.json",
    "total_tokens": 847,
    "translated_title": "不需要地面真实数据收集：使用深度强化学习进行自监督测距误差校正",
    "translated_abstract": "室内定位利用UWB技术因其厘米级准确度潜力而备受关注。然而，多径效应和非直射条件导致了基站与标签之间的测距误差。现有的缓解这些测距误差的方法依赖于收集大量标记数据集，这使它们在实际部署中不切实际。本文提出了一种新颖的自监督深度强化学习方法，不需要标记的地面真实数据。一个强化学习代理将通道脉冲响应作为状态，并预测校正以减小校正和估计测距之间的误差。该代理通过结合轨迹的可预测性与过滤和平滑处理生成的校正，自监督地学习和迭代改进。对真实世界UWB测量的实验表明，其性能与最先进的监督方法相媲美。",
    "tldr": "提出了一种使用深度强化学习进行自监督测距误差校正的方法，无需收集地面真实数据集，实验表明性能与有监督方法相媲美",
    "en_tdlr": "Proposed a self-supervised ranging error correction method using deep reinforcement learning that does not require collecting ground truth data, showing comparable performance to supervised methods in experiments."
}