{
    "title": "Conditional Score-Based Diffusion Model for Cortical Thickness Trajectory Prediction",
    "abstract": "arXiv:2403.06940v1 Announce Type: cross  Abstract: Alzheimer's Disease (AD) is a neurodegenerative condition characterized by diverse progression rates among individuals, with changes in cortical thickness (CTh) closely linked to its progression. Accurately forecasting CTh trajectories can significantly enhance early diagnosis and intervention strategies, providing timely care. However, the longitudinal data essential for these studies often suffer from temporal sparsity and incompleteness, presenting substantial challenges in modeling the disease's progression accurately. Existing methods are limited, focusing primarily on datasets without missing entries or requiring predefined assumptions about CTh progression. To overcome these obstacles, we propose a conditional score-based diffusion model specifically designed to generate CTh trajectories with the given baseline information, such as age, sex, and initial diagnosis. Our conditional diffusion model utilizes all available data durin",
    "link": "https://arxiv.org/abs/2403.06940",
    "context": "Title: Conditional Score-Based Diffusion Model for Cortical Thickness Trajectory Prediction\nAbstract: arXiv:2403.06940v1 Announce Type: cross  Abstract: Alzheimer's Disease (AD) is a neurodegenerative condition characterized by diverse progression rates among individuals, with changes in cortical thickness (CTh) closely linked to its progression. Accurately forecasting CTh trajectories can significantly enhance early diagnosis and intervention strategies, providing timely care. However, the longitudinal data essential for these studies often suffer from temporal sparsity and incompleteness, presenting substantial challenges in modeling the disease's progression accurately. Existing methods are limited, focusing primarily on datasets without missing entries or requiring predefined assumptions about CTh progression. To overcome these obstacles, we propose a conditional score-based diffusion model specifically designed to generate CTh trajectories with the given baseline information, such as age, sex, and initial diagnosis. Our conditional diffusion model utilizes all available data durin",
    "path": "papers/24/03/2403.06940.json",
    "total_tokens": 851,
    "translated_title": "用于皮质厚度轨迹预测的条件得分扩散模型",
    "translated_abstract": "阿尔茨海默病（AD）是一种以个体之间病程进展速率不同为特征的神经退行性疾病，皮质厚度（CTh）的变化与疾病进展密切相关。准确预测CTh轨迹可以显著提升早期诊断和干预策略，为患者提供及时护理。然而，用于这些研究的纵向数据通常存在时间稀疏和不完整的问题，导致在准确建模疾病进展方面面临重大挑战。现有方法局限性较大，主要集中在没有缺失条目的数据集上或要求对CTh进展进行预定义假设。为克服这些障碍，我们提出了一种特别设计用于生成带有基线信息（如年龄、性别和初步诊断）的CTh轨迹的条件得分扩散模型。我们的条件扩散模型利用所有可用数据进行模型拟合。",
    "tldr": "该论文提出了一种条件得分扩散模型，针对皮质厚度轨迹预测，在应对数据缺失和对疾病进展建模方面具有优势。",
    "en_tdlr": "The paper introduces a conditional score-based diffusion model tailored for predicting cortical thickness trajectories, with advantages in handling data sparsity and modeling disease progression."
}