{
    "title": "End-to-end Conditional Robust Optimization",
    "abstract": "arXiv:2403.04670v1 Announce Type: new  Abstract: The field of Contextual Optimization (CO) integrates machine learning and optimization to solve decision making problems under uncertainty. Recently, a risk sensitive variant of CO, known as Conditional Robust Optimization (CRO), combines uncertainty quantification with robust optimization in order to promote safety and reliability in high stake applications. Exploiting modern differentiable optimization methods, we propose a novel end-to-end approach to train a CRO model in a way that accounts for both the empirical risk of the prescribed decisions and the quality of conditional coverage of the contextual uncertainty set that supports them. While guarantees of success for the latter objective are impossible to obtain from the point of view of conformal prediction theory, high quality conditional coverage is achieved empirically by ingeniously employing a logistic regression differentiable layer within the calculation of coverage quality",
    "link": "https://arxiv.org/abs/2403.04670",
    "context": "Title: End-to-end Conditional Robust Optimization\nAbstract: arXiv:2403.04670v1 Announce Type: new  Abstract: The field of Contextual Optimization (CO) integrates machine learning and optimization to solve decision making problems under uncertainty. Recently, a risk sensitive variant of CO, known as Conditional Robust Optimization (CRO), combines uncertainty quantification with robust optimization in order to promote safety and reliability in high stake applications. Exploiting modern differentiable optimization methods, we propose a novel end-to-end approach to train a CRO model in a way that accounts for both the empirical risk of the prescribed decisions and the quality of conditional coverage of the contextual uncertainty set that supports them. While guarantees of success for the latter objective are impossible to obtain from the point of view of conformal prediction theory, high quality conditional coverage is achieved empirically by ingeniously employing a logistic regression differentiable layer within the calculation of coverage quality",
    "path": "papers/24/03/2403.04670.json",
    "total_tokens": 825,
    "translated_title": "端到端条件鲁棒优化",
    "translated_abstract": "语境优化（CO）领域整合了机器学习和优化以解决不确定性下的决策问题。最近，一种风险敏感的CO变体，称为条件鲁棒优化（CRO），结合了不确定性量化和鲁棒优化，以在高风险应用中促进安全性和可靠性。利用现代可微分优化方法，我们提出了一种新颖的端到端方法来训练CRO模型，以考虑所规定决策的经验风险和支持它们的语境不确定性集合的条件覆盖质量。尽管从合规预测理论的角度来看，无法获得对后者目标成功的保证，但通过巧妙地在覆盖质量的计算中使用逻辑回归可微分层，可以在经验上实现高质量的条件覆盖。",
    "tldr": "提出了一种新颖的端到端方法，利用现代可微分优化方法训练CRO模型，以同时考虑所规定决策的经验风险和支持它们的语境不确定性集合的条件覆盖质量",
    "en_tdlr": "A novel end-to-end approach is proposed to train a CRO model using modern differentiable optimization methods, taking into account both the empirical risk of the prescribed decisions and the quality of conditional coverage of the contextual uncertainty set that supports them."
}