{
    "title": "Federated Learning of Socially Appropriate Agent Behaviours in Simulated Home Environments",
    "abstract": "arXiv:2403.07586v1 Announce Type: cross  Abstract: As social robots become increasingly integrated into daily life, ensuring their behaviours align with social norms is crucial. For their widespread open-world application, it is important to explore Federated Learning (FL) settings where individual robots can learn about their unique environments while also learning from each others' experiences. In this paper, we present a novel FL benchmark that evaluates different strategies, using multi-label regression objectives, where each client individually learns to predict the social appropriateness of different robot actions while also sharing their learning with others. Furthermore, splitting the training data by different contexts such that each client incrementally learns across contexts, we present a novel Federated Continual Learning (FCL) benchmark that adapts FL-based methods to use state-of-the-art Continual Learning (CL) methods to continually learn socially appropriate agent behav",
    "link": "https://arxiv.org/abs/2403.07586",
    "context": "Title: Federated Learning of Socially Appropriate Agent Behaviours in Simulated Home Environments\nAbstract: arXiv:2403.07586v1 Announce Type: cross  Abstract: As social robots become increasingly integrated into daily life, ensuring their behaviours align with social norms is crucial. For their widespread open-world application, it is important to explore Federated Learning (FL) settings where individual robots can learn about their unique environments while also learning from each others' experiences. In this paper, we present a novel FL benchmark that evaluates different strategies, using multi-label regression objectives, where each client individually learns to predict the social appropriateness of different robot actions while also sharing their learning with others. Furthermore, splitting the training data by different contexts such that each client incrementally learns across contexts, we present a novel Federated Continual Learning (FCL) benchmark that adapts FL-based methods to use state-of-the-art Continual Learning (CL) methods to continually learn socially appropriate agent behav",
    "path": "papers/24/03/2403.07586.json",
    "total_tokens": 881,
    "translated_title": "在模拟家庭环境中联邦学习社会适宜的机器人行为",
    "translated_abstract": "随着社交机器人越来越多地融入日常生活，确保它们的行为符合社会规范变得至关重要。为了广泛应用于开放世界，探索个体机器人可以在学习其独特环境的同时也从彼此的经验中学习的联邦学习（FL）设置非常重要。本文提出了一个新颖的FL基准，评估不同策略，使用多标签回归目标，其中每个客户端分别学习预测不同机器人行为的社会适宜性，同时与他人共享其学习。此外，通过将训练数据按不同上下文拆分，使每个客户端逐渐跨上下文学习，我们提出了一个新颖的联邦持续学习（FCL）基准，将FL方法调整为使用最先进的持续学习（CL）方法，以持续学习社会适宜的代理行为。",
    "tldr": "本研究提出了在模拟家庭环境中进行联邦学习的新方法，旨在评估机器人行为的社会适宜性，并结合持续学习方法，使机器人可以从彼此的经验中学习社会规范。",
    "en_tdlr": "This paper introduces a novel approach of federated learning in simulated home environments to evaluate the social appropriateness of robot behaviors and incorporates continual learning methods for robots to learn social norms from each other's experiences."
}