{
    "title": "Agile gesture recognition for low-power applications: customisation for generalisation",
    "abstract": "arXiv:2403.15421v1 Announce Type: cross  Abstract: Automated hand gesture recognition has long been a focal point in the AI community. Traditionally, research in this field has predominantly focused on scenarios with access to a continuous flow of hand's images. This focus has been driven by the widespread use of cameras and the abundant availability of image data. However, there is an increasing demand for gesture recognition technologies that operate on low-power sensor devices. This is due to the rising concerns for data leakage and end-user privacy, as well as the limited battery capacity and the computing power in low-cost devices. Moreover, the challenge in data collection for individually designed hardware also hinders the generalisation of a gesture recognition model.   In this study, we unveil a novel methodology for pattern recognition systems using adaptive and agile error correction, designed to enhance the performance of legacy gesture recognition models on devices with li",
    "link": "https://arxiv.org/abs/2403.15421",
    "context": "Title: Agile gesture recognition for low-power applications: customisation for generalisation\nAbstract: arXiv:2403.15421v1 Announce Type: cross  Abstract: Automated hand gesture recognition has long been a focal point in the AI community. Traditionally, research in this field has predominantly focused on scenarios with access to a continuous flow of hand's images. This focus has been driven by the widespread use of cameras and the abundant availability of image data. However, there is an increasing demand for gesture recognition technologies that operate on low-power sensor devices. This is due to the rising concerns for data leakage and end-user privacy, as well as the limited battery capacity and the computing power in low-cost devices. Moreover, the challenge in data collection for individually designed hardware also hinders the generalisation of a gesture recognition model.   In this study, we unveil a novel methodology for pattern recognition systems using adaptive and agile error correction, designed to enhance the performance of legacy gesture recognition models on devices with li",
    "path": "papers/24/03/2403.15421.json",
    "total_tokens": 696,
    "translated_title": "面向低功耗应用的敏捷手势识别：通用性定制化",
    "translated_abstract": "自动手势识别长期以来一直是人工智能社区的焦点。传统上，这一领域的研究主要集中在对手部图像连续流的访问情境上。然而，对于在低功耗传感器设备上运行的手势识别技术的需求日益增长。本研究揭示了一种新颖的模式识别系统方法，利用自适应和敏捷误差校正，旨在提高传统手势识别模型在带有li的设备上的性能。",
    "tldr": "通过自适应和敏捷误差校正，提升了传统手势识别模型在低功耗设备上的性能",
    "en_tdlr": "Enhanced performance of traditional gesture recognition models on low-power devices through adaptive and agile error correction."
}