{
    "title": "Optimistic and pessimistic approaches for cooperative games",
    "abstract": "arXiv:2403.01442v1 Announce Type: new  Abstract: Cooperative game theory aims to study how to divide a joint value created by a set of players. These games are often studied through the characteristic function form with transferable utility, which represents the value obtainable by each coalition. In the presence of externalities, there are many ways to define this value. Various models that account for different levels of player cooperation and the influence of external players on coalition value have been studied. Although there are different approaches, typically, the optimistic and pessimistic approaches provide sufficient insights into strategic interactions. This paper clarifies the interpretation of these approaches by providing a unified framework. We show that making sure that no coalition receives more than their (optimistic) upper bounds is always at least as difficult as guaranteeing their (pessimistic) lower bounds. We also show that if externalities are negative, providin",
    "link": "https://arxiv.org/abs/2403.01442",
    "context": "Title: Optimistic and pessimistic approaches for cooperative games\nAbstract: arXiv:2403.01442v1 Announce Type: new  Abstract: Cooperative game theory aims to study how to divide a joint value created by a set of players. These games are often studied through the characteristic function form with transferable utility, which represents the value obtainable by each coalition. In the presence of externalities, there are many ways to define this value. Various models that account for different levels of player cooperation and the influence of external players on coalition value have been studied. Although there are different approaches, typically, the optimistic and pessimistic approaches provide sufficient insights into strategic interactions. This paper clarifies the interpretation of these approaches by providing a unified framework. We show that making sure that no coalition receives more than their (optimistic) upper bounds is always at least as difficult as guaranteeing their (pessimistic) lower bounds. We also show that if externalities are negative, providin",
    "path": "papers/24/03/2403.01442.json",
    "total_tokens": 840,
    "translated_title": "合作博弈的乐观与悲观方法",
    "translated_abstract": "合作博弈理论旨在研究如何划分一组玩家共同创造的价值。这些游戏通常通过可转让效用的特征函数形式进行研究，该形式代表了每个联盟可获得的价值。在存在外部性的情况下，有许多定义这个价值的方式。已经研究了各种模型，考虑了不同水平的玩家合作以及外部玩家对联盟价值的影响。尽管存在不同的方法，但通常，乐观和悲观方法为战略互动提供了充分的见解。本文通过提供统一框架来澄清这些方法的解释。我们表明，确保没有任何联盟获得多于他们（乐观）上界的是至少和保证他们（悲观）下界一样困难的。我们还表明，如果外部性是负面的，提供",
    "tldr": "本文澄清了乐观和悲观方法的解释，展示了确保联盟不超过其乐观上界至少和保证其悲观下界一样困难的关系。",
    "en_tdlr": "This paper clarifies the interpretation of optimistic and pessimistic approaches and shows the relationship between ensuring no coalition receives more than their optimistic upper bounds is at least as difficult as guaranteeing their pessimistic lower bounds."
}