{
    "title": "The impact of social status on the formation of collaborative ties and effort provision: An experimental study",
    "abstract": "arXiv:2403.05830v1 Announce Type: new  Abstract: We study whether competition for social status induces higher effort provision and efficiency when individuals collaborate with their network neighbors. We consider a laboratory experiment in which individuals choose a costly collaborative effort and their network neighbors. They benefit from their neighbors' effort and effort choices of direct neighbors are strategic complements. We introduce two types of social status in a 2x2 factorial design: 1) individuals receive monetary benefits for incoming links representing popularity; 2) they receive feedback on their relative payoff ranking within the group. We find that link benefits induce higher effort provision and strengthen the collaborative ties relative to the Baseline treatment without social status. In contrast, the ranking information induces lower effort as individuals start competing for higher ranking. Overall, we find that social status has no significant impact on the number ",
    "link": "https://arxiv.org/abs/2403.05830",
    "context": "Title: The impact of social status on the formation of collaborative ties and effort provision: An experimental study\nAbstract: arXiv:2403.05830v1 Announce Type: new  Abstract: We study whether competition for social status induces higher effort provision and efficiency when individuals collaborate with their network neighbors. We consider a laboratory experiment in which individuals choose a costly collaborative effort and their network neighbors. They benefit from their neighbors' effort and effort choices of direct neighbors are strategic complements. We introduce two types of social status in a 2x2 factorial design: 1) individuals receive monetary benefits for incoming links representing popularity; 2) they receive feedback on their relative payoff ranking within the group. We find that link benefits induce higher effort provision and strengthen the collaborative ties relative to the Baseline treatment without social status. In contrast, the ranking information induces lower effort as individuals start competing for higher ranking. Overall, we find that social status has no significant impact on the number ",
    "path": "papers/24/03/2403.05830.json",
    "total_tokens": 870,
    "translated_title": "社会地位对协作关系和努力提供形成的影响：一项实验研究",
    "translated_abstract": "我们研究社会地位竞争是否会促使在个体与他们的网络邻居协作时提供更高的努力和效率。我们考虑了一个实验室实验，在该实验中，个体选择了一项昂贵的合作努力以及他们的网络邻居。他们从邻居的努力中获益，而直接邻居的努力选择是战略互补的。我们在2x2的因子设计中引入了两种社会地位类型：1) 个体因为入链而获得货币利益，代表受欢迎程度；2) 他们接收有关他们在群体中相对收益排名的反馈意见。我们发现，链路利益会增加努力提供并加强协作关系，相对于无社会地位的基线处理。相反，排名信息会降低努力，因为个体开始为更高排名而竞争。总体而言，我们发现社会地位对结果并没有明显影响。",
    "tldr": "社会地位竞争鼓励了更高的努力提供和强化了协作关系，但排名信息导致了较低的努力提供。社会地位对结果影响不显著。",
    "en_tdlr": "Competition for social status promotes higher effort provision and strengthens collaborative ties, while ranking information leads to lower effort provision. Social status has no significant impact on outcomes."
}