{
    "title": "EAGLE: A Domain Generalization Framework for AI-generated Text Detection",
    "abstract": "arXiv:2403.15690v1 Announce Type: cross  Abstract: With the advancement in capabilities of Large Language Models (LLMs), one major step in the responsible and safe use of such LLMs is to be able to detect text generated by these models. While supervised AI-generated text detectors perform well on text generated by older LLMs, with the frequent release of new LLMs, building supervised detectors for identifying text from such new models would require new labeled training data, which is infeasible in practice. In this work, we tackle this problem and propose a domain generalization framework for the detection of AI-generated text from unseen target generators. Our proposed framework, EAGLE, leverages the labeled data that is available so far from older language models and learns features invariant across these generators, in order to detect text generated by an unknown target generator. EAGLE learns such domain-invariant features by combining the representational power of self-supervised ",
    "link": "https://arxiv.org/abs/2403.15690",
    "context": "Title: EAGLE: A Domain Generalization Framework for AI-generated Text Detection\nAbstract: arXiv:2403.15690v1 Announce Type: cross  Abstract: With the advancement in capabilities of Large Language Models (LLMs), one major step in the responsible and safe use of such LLMs is to be able to detect text generated by these models. While supervised AI-generated text detectors perform well on text generated by older LLMs, with the frequent release of new LLMs, building supervised detectors for identifying text from such new models would require new labeled training data, which is infeasible in practice. In this work, we tackle this problem and propose a domain generalization framework for the detection of AI-generated text from unseen target generators. Our proposed framework, EAGLE, leverages the labeled data that is available so far from older language models and learns features invariant across these generators, in order to detect text generated by an unknown target generator. EAGLE learns such domain-invariant features by combining the representational power of self-supervised ",
    "path": "papers/24/03/2403.15690.json",
    "total_tokens": 872,
    "translated_title": "EAGLE：面向人工智能生成文本检测的领域泛化框架",
    "translated_abstract": "随着大型语言模型（LLMs）能力的提升，负责任和安全使用这些LLMs的一个重要步骤是能够检测这些模型生成的文本。尽管监督式AI生成的文本检测器在旧LLMs生成的文本上表现良好，但随着新LLMs的频繁发布，构建用于识别这些新模型文本的监督检测器将需要新的标记训练数据，在实践中是不可行的。在这项工作中，我们解决这个问题，提出了一个用于检测来自未知目标生成器的AI生成文本的领域泛化框架。我们提出的框架EAGLE利用迄今为止从旧语言模型获得的标记数据，并学习跨这些生成器不变的特征，以便检测由未知目标生成器生成的文本。EAGLE通过结合自监督的表征能力来学习这种领域不变特征。",
    "tldr": "EAGLE提出了一个领域泛化框架，能够利用从旧语言模型中获得的标记数据，学习特征的不变性，从而检测出未知目标生成器生成的文本。",
    "en_tdlr": "EAGLE proposed a domain generalization framework that leverages labeled data from older language models to learn invariant features for detecting text generated by unknown target generators."
}