{
    "title": "First path component power based NLOS mitigation in UWB positioning system",
    "abstract": "arXiv:2403.19706v1 Announce Type: cross  Abstract: The paper describes an NLOS (Non-Line-of-Sight) mitigation method intended for use in a UWB positioning system. In the proposed method propagation conditions between the localized objects and the anchors forming system infrastructure are classified into one of three categories: LOS (Line-of-Sight), NLOS and severe NLOS. Non-Line-of-Sight detection is conducted based on first path signal component power measurements. For each of the categories, average NLOS inducted time of arrival bias and bias standard deviation have been estimated based on results gathered during a measurement campaign conducted in a fully furnished apartment. To locate a tag, an EKF (Extended Kalman Filter) based algorithm is used. The proposed method of NLOS mitigation consists in correcting measurement results obtained in NLOS conditions and lowering their significance in a tag position estimation process. The paper includes the description of the method and the r",
    "link": "https://arxiv.org/abs/2403.19706",
    "context": "Title: First path component power based NLOS mitigation in UWB positioning system\nAbstract: arXiv:2403.19706v1 Announce Type: cross  Abstract: The paper describes an NLOS (Non-Line-of-Sight) mitigation method intended for use in a UWB positioning system. In the proposed method propagation conditions between the localized objects and the anchors forming system infrastructure are classified into one of three categories: LOS (Line-of-Sight), NLOS and severe NLOS. Non-Line-of-Sight detection is conducted based on first path signal component power measurements. For each of the categories, average NLOS inducted time of arrival bias and bias standard deviation have been estimated based on results gathered during a measurement campaign conducted in a fully furnished apartment. To locate a tag, an EKF (Extended Kalman Filter) based algorithm is used. The proposed method of NLOS mitigation consists in correcting measurement results obtained in NLOS conditions and lowering their significance in a tag position estimation process. The paper includes the description of the method and the r",
    "path": "papers/24/03/2403.19706.json",
    "total_tokens": 815,
    "translated_title": "UWB定位系统中基于第一个路径成分功率的NLOS抑制",
    "translated_abstract": "该论文描述了一种用于UWB定位系统的NLOS（非视距）抑制方法。该方法将局部对象与形成系统基础设施的锚点之间的传播条件分类为LOS（视距）、NLOS和严重NLOS中的一种。根据第一个路径信号成分功率测量进行非视距检测。针对每个类别，基于在配备齐全的公寓进行的测量活动期间收集到的结果，估计了平均NLOS引入到达时间偏差和偏差标准差。为了定位标签，使用了基于EKF（扩展卡尔曼滤波器）的算法。提出的NLOS抑制方法在纠正在NLOS条件下获得的测量结果并降低其在标签位置估计过程中的重要性方面。论文包括该方法和r",
    "tldr": "该论文介绍了一种基于第一个路径信号成分功率的NLOS抑制方法，通过纠正NLOS条件下的测量结果并降低其在标签位置估计中的重要性来实现。",
    "en_tdlr": "This paper presents a NLOS mitigation method based on the first path signal component power, correcting measurement results obtained in NLOS conditions and reducing their significance in tag position estimation."
}