{
    "title": "Assessing effect sizes, variability, and power in the on-line study of language production",
    "abstract": "arXiv:2403.15459v1 Announce Type: new  Abstract: With the pandemic, many experimental psychologists and linguists have started to collect data over the internet (hereafter on-line data). The feasibility of such experiments and the sample sizes required to achieve sufficient statistical power in future experiments have to be assessed. This in turn requires information on effect sizes and variability. In a series of analyses, we compare response time data obtained in the same word production experiment conducted in the lab and on-line. These analyses allow us to determine whether the two settings differ in effect sizes, in the consistency of responses over the course of the experiment, in the variability of average response times across participants, in the magnitude of effect sizes across participants, or in the amount of unexplained variability. We assess the impact of these differences on the power of the design in a series of simulations. Our findings temper the enthusiasm raised by ",
    "link": "https://arxiv.org/abs/2403.15459",
    "context": "Title: Assessing effect sizes, variability, and power in the on-line study of language production\nAbstract: arXiv:2403.15459v1 Announce Type: new  Abstract: With the pandemic, many experimental psychologists and linguists have started to collect data over the internet (hereafter on-line data). The feasibility of such experiments and the sample sizes required to achieve sufficient statistical power in future experiments have to be assessed. This in turn requires information on effect sizes and variability. In a series of analyses, we compare response time data obtained in the same word production experiment conducted in the lab and on-line. These analyses allow us to determine whether the two settings differ in effect sizes, in the consistency of responses over the course of the experiment, in the variability of average response times across participants, in the magnitude of effect sizes across participants, or in the amount of unexplained variability. We assess the impact of these differences on the power of the design in a series of simulations. Our findings temper the enthusiasm raised by ",
    "path": "papers/24/03/2403.15459.json",
    "total_tokens": 796,
    "translated_title": "评估语言生成在线研究中的效应大小、变异性和功效",
    "translated_abstract": "随着疫情的流行，许多实验心理学家和语言学家已经开始在互联网上收集数据（以下简称在线数据）。必须评估这类实验的可行性以及未来实验所需的样本量，以达到足够的统计功效。这反过来需要了解效应大小和变异性的信息。在一系列分析中，我们比较了在实验室和在线进行的相同词汇产生实验中获得的响应时间数据。这些分析让我们能够确定两种设置在效应大小、实验过程中响应的一致性、跨参与者平均响应时间的变异性、参与者之间效应大小的差异，以及未解释变异量的数量是否存在差异。我们通过一系列模拟评估这些差异对设计效果的影响。我们的研究结果对在线研究可能带来的热情进行了调查。",
    "tldr": "评估语言生成在线研究中效应大小、变异性和功效对设计效果的影响",
    "en_tdlr": "Evaluating the impact of effect sizes, variability, and power in online language production studies on the design效果."
}