{
    "title": "Quantum-activated neural reservoirs on-chip open up large hardware security models for resilient authentication",
    "abstract": "arXiv:2403.14188v1 Announce Type: cross  Abstract: Quantum artificial intelligence is a frontier of artificial intelligence research, pioneering quantum AI-powered circuits to address problems beyond the reach of deep learning with classical architectures. This work implements a large-scale quantum-activated recurrent neural network possessing more than 3 trillion hardware nodes/cm$^2$, originating from repeatable atomic-scale nucleation dynamics in an amorphous material integrated on-chip, controlled with 0.07 nW electric power per readout channel. Compared to the best-performing reservoirs currently reported, this implementation increases the scale of the network by two orders of magnitude and reduces the power consumption by six, reaching power efficiencies in the range of the human brain, dissipating 0.2 nW/neuron. When interrogated by a classical input, the chip implements a large-scale hardware security model, enabling dictionary-free authentication secure against statistical inf",
    "link": "https://arxiv.org/abs/2403.14188",
    "context": "Title: Quantum-activated neural reservoirs on-chip open up large hardware security models for resilient authentication\nAbstract: arXiv:2403.14188v1 Announce Type: cross  Abstract: Quantum artificial intelligence is a frontier of artificial intelligence research, pioneering quantum AI-powered circuits to address problems beyond the reach of deep learning with classical architectures. This work implements a large-scale quantum-activated recurrent neural network possessing more than 3 trillion hardware nodes/cm$^2$, originating from repeatable atomic-scale nucleation dynamics in an amorphous material integrated on-chip, controlled with 0.07 nW electric power per readout channel. Compared to the best-performing reservoirs currently reported, this implementation increases the scale of the network by two orders of magnitude and reduces the power consumption by six, reaching power efficiencies in the range of the human brain, dissipating 0.2 nW/neuron. When interrogated by a classical input, the chip implements a large-scale hardware security model, enabling dictionary-free authentication secure against statistical inf",
    "path": "papers/24/03/2403.14188.json",
    "total_tokens": 893,
    "translated_title": "芯片上的量子激活神经水库为具有弹性身份验证的大型硬件安全模型打开了大门",
    "translated_abstract": "arXiv:2403.14188v1 公告类型：交叉摘要：量子人工智能是人工智能研究的前沿，开创性地利用量子人工智能电路解决深度学习和经典架构无法解决的问题。该工作实现了一个大规模的量子激活循环神经网络，拥有超过3万亿硬件节点/平方厘米，源于芯片上集成的非晶材料中可重复的原子尺度成核动态，每个读取通道的控制电力为0.07 nW。与目前报道的表现最好的水库相比，该实施将网络规模提高了两个数量级，并将功耗降低了六倍，达到了人脑功率效率范围，每个神经元消耗0.2 nW。当由经典输入审问时，芯片实现了一个大规模的硬件安全模型，实现了免词典身份验证，可以抵抗统计",
    "tldr": "该研究在芯片上实现了一个大规模量子激活神经水库，使网络规模和功耗均大幅提高，可用于实现具有弹性身份验证功能的大型硬件安全模型",
    "en_tdlr": "This study implemented a large-scale quantum-activated neural reservoir on a chip, significantly increasing the network scale and power efficiency, enabling the realization of a large hardware security model for resilient authentication."
}