{
    "title": "Strong and Controllable Blind Image Decomposition",
    "abstract": "arXiv:2403.10520v1 Announce Type: cross  Abstract: Blind image decomposition aims to decompose all components present in an image, typically used to restore a multi-degraded input image. While fully recovering the clean image is appealing, in some scenarios, users might want to retain certain degradations, such as watermarks, for copyright protection. To address this need, we add controllability to the blind image decomposition process, allowing users to enter which types of degradation to remove or retain. We design an architecture named controllable blind image decomposition network. Inserted in the middle of U-Net structure, our method first decomposes the input feature maps and then recombines them according to user instructions. Advantageously, this functionality is implemented at minimal computational cost: decomposition and recombination are all parameter-free. Experimentally, our system excels in blind image decomposition tasks and can outputs partially or fully restored images",
    "link": "https://arxiv.org/abs/2403.10520",
    "context": "Title: Strong and Controllable Blind Image Decomposition\nAbstract: arXiv:2403.10520v1 Announce Type: cross  Abstract: Blind image decomposition aims to decompose all components present in an image, typically used to restore a multi-degraded input image. While fully recovering the clean image is appealing, in some scenarios, users might want to retain certain degradations, such as watermarks, for copyright protection. To address this need, we add controllability to the blind image decomposition process, allowing users to enter which types of degradation to remove or retain. We design an architecture named controllable blind image decomposition network. Inserted in the middle of U-Net structure, our method first decomposes the input feature maps and then recombines them according to user instructions. Advantageously, this functionality is implemented at minimal computational cost: decomposition and recombination are all parameter-free. Experimentally, our system excels in blind image decomposition tasks and can outputs partially or fully restored images",
    "path": "papers/24/03/2403.10520.json",
    "total_tokens": 824,
    "translated_title": "强大且可控的盲图像分解",
    "translated_abstract": "盲图像分解旨在分解图像中的所有组成部分，通常用于恢复一个多重降低的输入图像。虽然完全恢复干净的图像很吸引人，但在某些情况下，用户可能希望保留某些降解，例如水印，以进行版权保护。为了满足这种需要，我们在盲图像分解过程中添加了可控性，允许用户输入要移除或保留的降解类型。我们设计了一个名为可控盲图像分解网络的架构。我们的方法首先将输入的特征图分解，然后根据用户的指令重新组合它们。有利的是，这种功能以极小的计算成本实现：分解和重组都是无参数的。实验结果表明，我们的系统在盲图像分解任务中表现出色，并能输出部分或完全恢复的图像。",
    "tldr": "该论文提出了一种具有可控性的盲图像分解方法，允许用户选择移除或保留特定类型的降解，实现了在 minimal computational cost的情况下对输入图像进行部分或完全恢复",
    "en_tdlr": "This paper introduces a controllable blind image decomposition method that allows users to select which types of degradations to remove or retain, achieving partial or full restoration of input images at minimal computational cost."
}