{
    "title": "TutoAI: A Cross-domain Framework for AI-assisted Mixed-media Tutorial Creation on Physical Tasks",
    "abstract": "arXiv:2403.08049v1 Announce Type: cross  Abstract: Mixed-media tutorials, which integrate videos, images, text, and diagrams to teach procedural skills, offer more browsable alternatives than timeline-based videos. However, manually creating such tutorials is tedious, and existing automated solutions are often restricted to a particular domain. While AI models hold promise, it is unclear how to effectively harness their powers, given the multi-modal data involved and the vast landscape of models. We present TutoAI, a cross-domain framework for AI-assisted mixed-media tutorial creation on physical tasks. First, we distill common tutorial components by surveying existing work; then, we present an approach to identify, assemble, and evaluate AI models for component extraction; finally, we propose guidelines for designing user interfaces (UI) that support tutorial creation based on AI-generated components. We show that TutoAI has achieved higher or similar quality compared to a baseline mo",
    "link": "https://arxiv.org/abs/2403.08049",
    "context": "Title: TutoAI: A Cross-domain Framework for AI-assisted Mixed-media Tutorial Creation on Physical Tasks\nAbstract: arXiv:2403.08049v1 Announce Type: cross  Abstract: Mixed-media tutorials, which integrate videos, images, text, and diagrams to teach procedural skills, offer more browsable alternatives than timeline-based videos. However, manually creating such tutorials is tedious, and existing automated solutions are often restricted to a particular domain. While AI models hold promise, it is unclear how to effectively harness their powers, given the multi-modal data involved and the vast landscape of models. We present TutoAI, a cross-domain framework for AI-assisted mixed-media tutorial creation on physical tasks. First, we distill common tutorial components by surveying existing work; then, we present an approach to identify, assemble, and evaluate AI models for component extraction; finally, we propose guidelines for designing user interfaces (UI) that support tutorial creation based on AI-generated components. We show that TutoAI has achieved higher or similar quality compared to a baseline mo",
    "path": "papers/24/03/2403.08049.json",
    "total_tokens": 961,
    "translated_title": "TutoAI：用于物理任务的跨领域 AI 辅助混合媒体教程创作框架",
    "translated_abstract": "混合媒体教程将视频、图片、文本和图表整合起来，以教授过程技能，提供比基于时间轴的视频更具可浏览性的选择。然而，手动创建此类教程是乏味的，现有的自动化解决方案通常局限于特定领域。虽然 AI 模型具有潜力，但如何有效利用它们的能力尚不清楚，考虑到所涉及的多模态数据和模型的广阔领域。我们提出了 TutoAI，这是一个用于物理任务的跨领域 AI 辅助混合媒体教程创作的框架。首先，通过调查现有工作，我们提炼了常见的教程组件；然后，我们提出了一种识别、组装和评估用于组件提取的 AI 模型的方法；最后，我们提出了为基于 AI 生成的组件支持教程创建的用户界面（UI）设计指南。我们展示了 TutoAI 在质量上达到或高于基准模型的结果。",
    "tldr": "TutoAI 是一个跨领域的框架，用于在物理任务上利用AI辅助混合媒体教程创建，通过调查常见教程组件、评估AI模型提取组件的方法以及设计UI支持教程创建的指南，证明了其较基准模型具有更高或相似的质量。",
    "en_tdlr": "TutoAI is a cross-domain framework for AI-assisted mixed-media tutorial creation on physical tasks, which distills common tutorial components, evaluates methods for AI model extraction, and provides guidelines for designing UI to support tutorial creation, demonstrating higher or similar quality compared to baseline models."
}