{
    "title": "Learn from Heterophily: Heterophilous Information-enhanced Graph Neural Network",
    "abstract": "arXiv:2403.17351v1 Announce Type: new  Abstract: Under circumstances of heterophily, where nodes with different labels tend to be connected based on semantic meanings, Graph Neural Networks (GNNs) often exhibit suboptimal performance. Current studies on graph heterophily mainly focus on aggregation calibration or neighbor extension and address the heterophily issue by utilizing node features or structural information to improve GNN representations. In this paper, we propose and demonstrate that the valuable semantic information inherent in heterophily can be utilized effectively in graph learning by investigating the distribution of neighbors for each individual node within the graph. The theoretical analysis is carried out to demonstrate the efficacy of the idea in enhancing graph learning. Based on this analysis, we propose HiGNN, an innovative approach that constructs an additional new graph structure, that integrates heterophilous information by leveraging node distribution to enha",
    "link": "https://arxiv.org/abs/2403.17351",
    "context": "Title: Learn from Heterophily: Heterophilous Information-enhanced Graph Neural Network\nAbstract: arXiv:2403.17351v1 Announce Type: new  Abstract: Under circumstances of heterophily, where nodes with different labels tend to be connected based on semantic meanings, Graph Neural Networks (GNNs) often exhibit suboptimal performance. Current studies on graph heterophily mainly focus on aggregation calibration or neighbor extension and address the heterophily issue by utilizing node features or structural information to improve GNN representations. In this paper, we propose and demonstrate that the valuable semantic information inherent in heterophily can be utilized effectively in graph learning by investigating the distribution of neighbors for each individual node within the graph. The theoretical analysis is carried out to demonstrate the efficacy of the idea in enhancing graph learning. Based on this analysis, we propose HiGNN, an innovative approach that constructs an additional new graph structure, that integrates heterophilous information by leveraging node distribution to enha",
    "path": "papers/24/03/2403.17351.json",
    "total_tokens": 790,
    "translated_title": "从异质性学习：异质信息增强图神经网络",
    "translated_abstract": "在异质性环境中，Graph Neural Networks (GNNs)通常表现出次优性能，因为不同标签的节点倾向于基于语义含义相连。目前关于图异质性的研究主要集中在聚合校准或邻居扩展上，通过利用节点特征或结构信息来改善GNN表示以解决异质性问题。本文提出并证明了异质性中内在的宝贵语义信息可以通过调查图中每个单独节点的邻居分布来有效地利用在图学习中。通过理论分析，论证了这一理念在增强图学习中的有效性。基于此分析，提出了HiGNN，一种创新方法，构建了一个额外的新图结构，通过利用节点分布整合异质信息来增强图学习。",
    "tldr": "本文提出了HiGNN，一种创新方法，通过调查节点的邻居分布来有效利用异质信息，从而增强图神经网络的学习效果。"
}