{
    "title": "Jet Discrimination with Quantum Complete Graph Neural Network",
    "abstract": "arXiv:2403.04990v1 Announce Type: cross  Abstract: Machine learning, particularly deep neural networks, has been widely utilized in high energy physics and has shown remarkable results in various applications. Moreover, the concept of machine learning has been extended to quantum computers, giving rise to a new research area known as quantum machine learning. In this paper, we propose a novel variational quantum circuit model, Quantum Complete Graph Neural Network (QCGNN), designed for learning complete graphs. We argue that QCGNN has a polynomial speedup against its classical counterpart, due to the property of quantum parallelism. In this paper, we study the application of QCGNN through the challenging jet discrimination, where the jets are represented with complete graphs. Subsequently, we conduct a comparative analysis with classical graph neural networks to establish a benchmark.",
    "link": "https://arxiv.org/abs/2403.04990",
    "context": "Title: Jet Discrimination with Quantum Complete Graph Neural Network\nAbstract: arXiv:2403.04990v1 Announce Type: cross  Abstract: Machine learning, particularly deep neural networks, has been widely utilized in high energy physics and has shown remarkable results in various applications. Moreover, the concept of machine learning has been extended to quantum computers, giving rise to a new research area known as quantum machine learning. In this paper, we propose a novel variational quantum circuit model, Quantum Complete Graph Neural Network (QCGNN), designed for learning complete graphs. We argue that QCGNN has a polynomial speedup against its classical counterpart, due to the property of quantum parallelism. In this paper, we study the application of QCGNN through the challenging jet discrimination, where the jets are represented with complete graphs. Subsequently, we conduct a comparative analysis with classical graph neural networks to establish a benchmark.",
    "path": "papers/24/03/2403.04990.json",
    "total_tokens": 753,
    "translated_title": "使用量子完全图神经网络进行喷注判别",
    "translated_abstract": "机器学习，特别是深度神经网络，在高能物理中被广泛应用，并在各种应用中展现出显著的效果。此外，机器学习的概念已扩展到量子计算机，形成了一个被称为量子机器学习的新研究领域。在本文中，我们提出了一个新颖的变分量子电路模型，即量子完全图神经网络（QCGNN），旨在学习完全图。我们认为QCGNN由于量子并行性的特性，在速度上对其经典对应物具有多项式加速。本文研究了QCGNN在具有挑战性的喷注判别中的应用，其中喷注用完全图表示。随后，我们与经典图神经网络进行了比较分析，以建立基准。",
    "tldr": "QCGNN通过量子并行性实现了对喷注判别的多项式加速，为喷注判别问题带来新的解决方案",
    "en_tdlr": "QCGNN achieves polynomial speedup for jet discrimination through quantum parallelism, offering a novel solution for jet discrimination."
}