{
    "title": "Application of Machine Learning Algorithms in Classifying Postoperative Success in Metabolic Bariatric Surgery: A Comprehensive Study",
    "abstract": "arXiv:2403.20124v1 Announce Type: new  Abstract: Objectives: Metabolic Bariatric Surgery (MBS) is a critical intervention for patients living with obesity and related health issues. Accurate classification and prediction of patient outcomes are vital for optimizing treatment strategies. This study presents a novel machine learning approach to classify patients in the context of metabolic bariatric surgery, providing insights into the efficacy of different models and variable types. Methods: Various machine learning models, including GaussianNB, ComplementNB, KNN, Decision Tree, KNN with RandomOverSampler, and KNN with SMOTE, were applied to a dataset of 73 patients. The dataset, comprising psychometric, socioeconomic, and analytical variables, was analyzed to determine the most efficient predictive model. The study also explored the impact of different variable groupings and oversampling techniques. Results: Experimental results indicate average accuracy values as high as 66.7% for the",
    "link": "https://arxiv.org/abs/2403.20124",
    "context": "Title: Application of Machine Learning Algorithms in Classifying Postoperative Success in Metabolic Bariatric Surgery: A Comprehensive Study\nAbstract: arXiv:2403.20124v1 Announce Type: new  Abstract: Objectives: Metabolic Bariatric Surgery (MBS) is a critical intervention for patients living with obesity and related health issues. Accurate classification and prediction of patient outcomes are vital for optimizing treatment strategies. This study presents a novel machine learning approach to classify patients in the context of metabolic bariatric surgery, providing insights into the efficacy of different models and variable types. Methods: Various machine learning models, including GaussianNB, ComplementNB, KNN, Decision Tree, KNN with RandomOverSampler, and KNN with SMOTE, were applied to a dataset of 73 patients. The dataset, comprising psychometric, socioeconomic, and analytical variables, was analyzed to determine the most efficient predictive model. The study also explored the impact of different variable groupings and oversampling techniques. Results: Experimental results indicate average accuracy values as high as 66.7% for the",
    "path": "papers/24/03/2403.20124.json",
    "total_tokens": 920,
    "translated_title": "机器学习算法在代谢性减重手术术后成功分类中的应用：一项全面研究",
    "translated_abstract": "目标：代谢性减重手术(MBS)是对患有肥胖及相关健康问题的患者进行重要干预。精确分类和预测患者结果对优化治疗策略至关重要。本研究提出了一种新颖的机器学习方法，用于在代谢性减重手术环境中对患者进行分类，为不同模型和变量类型的有效性提供见解。方法：对73名患者的数据集应用了各种机器学习模型，包括GaussianNB、ComplementNB、KNN、决策树、带有RandomOverSampler的KNN和带有SMOTE的KNN。数据集包括心理测量、社会经济和分析变量，通过分析确定最有效的预测模型。研究还探讨了不同变量分组和过采样技术的影响。结果：实验结果显示，平均准确率高达66.7%，表明了一些模型在代谢性减重手术中具有良好预测能力。",
    "tldr": "该研究提出了一种新颖的机器学习方法，用于代谢性减重手术患者的分类，通过对比不同模型和变量类型的有效性，为优化治疗策略提供了重要见解。",
    "en_tdlr": "This study presents a novel machine learning approach for classifying patients in metabolic bariatric surgery, providing insights into the efficacy of different models and variable types to optimize treatment strategies."
}