{
    "title": "MPXGAT: An Attention based Deep Learning Model for Multiplex Graphs Embedding",
    "abstract": "arXiv:2403.19246v1 Announce Type: new  Abstract: Graph representation learning has rapidly emerged as a pivotal field of study. Despite its growing popularity, the majority of research has been confined to embedding single-layer graphs, which fall short in representing complex systems with multifaceted relationships. To bridge this gap, we introduce MPXGAT, an innovative attention-based deep learning model tailored to multiplex graph embedding. Leveraging the robustness of Graph Attention Networks (GATs), MPXGAT captures the structure of multiplex networks by harnessing both intra-layer and inter-layer connections. This exploitation facilitates accurate link prediction within and across the network's multiple layers. Our comprehensive experimental evaluation, conducted on various benchmark datasets, confirms that MPXGAT consistently outperforms state-of-the-art competing algorithms.",
    "link": "https://arxiv.org/abs/2403.19246",
    "context": "Title: MPXGAT: An Attention based Deep Learning Model for Multiplex Graphs Embedding\nAbstract: arXiv:2403.19246v1 Announce Type: new  Abstract: Graph representation learning has rapidly emerged as a pivotal field of study. Despite its growing popularity, the majority of research has been confined to embedding single-layer graphs, which fall short in representing complex systems with multifaceted relationships. To bridge this gap, we introduce MPXGAT, an innovative attention-based deep learning model tailored to multiplex graph embedding. Leveraging the robustness of Graph Attention Networks (GATs), MPXGAT captures the structure of multiplex networks by harnessing both intra-layer and inter-layer connections. This exploitation facilitates accurate link prediction within and across the network's multiple layers. Our comprehensive experimental evaluation, conducted on various benchmark datasets, confirms that MPXGAT consistently outperforms state-of-the-art competing algorithms.",
    "path": "papers/24/03/2403.19246.json",
    "total_tokens": 831,
    "translated_title": "MPXGAT：一种用于多重图嵌入的基于注意力机制的深度学习模型",
    "translated_abstract": "图表示学习已迅速成为一个关键的研究领域。尽管其日益普及，但大部分研究仍仅限于嵌入单层图，这在表示具有多方面关系的复杂系统时不足以胜任。为了填补这一空白，我们引入了MPXGAT，这是一种创新的基于注意力机制的深度学习模型，专门用于多重图嵌入。通过利用图注意力网络（GATs）的稳健性，MPXGAT通过利用层内和层间连接捕捉多重网络的结构。这种利用有助于准确预测网络多个层内和层间的链接。我们在各种基准数据集上进行的全面实验证实，MPXGAT始终优于当前最先进的竞争算法。",
    "tldr": "MPXGAT是一种基于注意力机制的深度学习模型，用于多重图嵌入，通过结合GATs在层内和层间连接的强大性能，实现了准确预测多重网络中各层内和层间的链接。",
    "en_tdlr": "MPXGAT is an attention-based deep learning model designed for multiplex graph embedding, which combines the power of GATs in capturing intra- and inter-layer connections to accurately predict links within and across the layers of multiplex networks."
}