{
    "title": "HealthGAT: Node Classifications in Electronic Health Records using Graph Attention Networks",
    "abstract": "arXiv:2403.18128v1 Announce Type: new  Abstract: While electronic health records (EHRs) are widely used across various applications in healthcare, most applications use the EHRs in their raw (tabular) format. Relying on raw or simple data pre-processing can greatly limit the performance or even applicability of downstream tasks using EHRs. To address this challenge, we present HealthGAT, a novel graph attention network framework that utilizes a hierarchical approach to generate embeddings from EHR, surpassing traditional graph-based methods. Our model iteratively refines the embeddings for medical codes, resulting in improved EHR data analysis. We also introduce customized EHR-centric auxiliary pre-training tasks to leverage the rich medical knowledge embedded within the data. This approach provides a comprehensive analysis of complex medical relationships and offers significant advancement over standard data representation techniques. HealthGAT has demonstrated its effectiveness in va",
    "link": "https://arxiv.org/abs/2403.18128",
    "context": "Title: HealthGAT: Node Classifications in Electronic Health Records using Graph Attention Networks\nAbstract: arXiv:2403.18128v1 Announce Type: new  Abstract: While electronic health records (EHRs) are widely used across various applications in healthcare, most applications use the EHRs in their raw (tabular) format. Relying on raw or simple data pre-processing can greatly limit the performance or even applicability of downstream tasks using EHRs. To address this challenge, we present HealthGAT, a novel graph attention network framework that utilizes a hierarchical approach to generate embeddings from EHR, surpassing traditional graph-based methods. Our model iteratively refines the embeddings for medical codes, resulting in improved EHR data analysis. We also introduce customized EHR-centric auxiliary pre-training tasks to leverage the rich medical knowledge embedded within the data. This approach provides a comprehensive analysis of complex medical relationships and offers significant advancement over standard data representation techniques. HealthGAT has demonstrated its effectiveness in va",
    "path": "papers/24/03/2403.18128.json",
    "total_tokens": 887,
    "translated_title": "使用图注意力网络对电子健康记录进行节点分类的HealthGAT",
    "translated_abstract": "虽然电子健康记录（EHRs）在医疗保健的各种应用中被广泛使用，但大多数应用程序使用原始（表格）格式的EHRs。依赖原始或简单的数据预处理可能会大大限制利用EHR进行下游任务的性能或适用性。为解决这一挑战，我们提出了HealthGAT，这是一个新颖的图注意力网络框架，采用分层方法从EHR生成嵌入，超越了传统的基于图的方法。我们的模型通过迭代改进医疗代码的嵌入，从而改进了EHR数据分析。我们还引入了定制的以EHR为中心的辅助预训练任务，以利用数据中嵌入的丰富医学知识。这种方法提供了对复杂医学关系的全面分析，并且在标准数据表示技术上取得了显著进展。HealthGAT已经证明了其在va方面的有效性",
    "tldr": "HealthGAT是一个新颖的图注意力网络框架，通过分层方法生成EHR嵌入，并引入定制的以EHR为中心的辅助预训练任务，从而在医学代码嵌入和复杂医学关系分析方面取得重大进展。",
    "en_tdlr": "HealthGAT is a novel graph attention network framework that generates EHR embeddings using a hierarchical approach and introduces customized EHR-centric auxiliary pre-training tasks, leading to significant advancements in the embedding of medical codes and analysis of complex medical relationships."
}