{
    "title": "Planning and Acting While the Clock Ticks",
    "abstract": "arXiv:2403.14796v1 Announce Type: new  Abstract: Standard temporal planning assumes that planning takes place offline and then execution starts at time 0. Recently, situated temporal planning was introduced, where planning starts at time 0 and execution occurs after planning terminates. Situated temporal planning reflects a more realistic scenario where time passes during planning. However, in situated temporal planning a complete plan must be generated before any action is executed. In some problems with time pressure, timing is too tight to complete planning before the first action must be executed. For example, an autonomous car that has a truck backing towards it should probably move out of the way now and plan how to get to its destination later. In this paper, we propose a new problem setting: concurrent planning and execution, in which actions can be dispatched (executed) before planning terminates. Unlike previous work on planning and execution, we must handle wall clock deadli",
    "link": "https://arxiv.org/abs/2403.14796",
    "context": "Title: Planning and Acting While the Clock Ticks\nAbstract: arXiv:2403.14796v1 Announce Type: new  Abstract: Standard temporal planning assumes that planning takes place offline and then execution starts at time 0. Recently, situated temporal planning was introduced, where planning starts at time 0 and execution occurs after planning terminates. Situated temporal planning reflects a more realistic scenario where time passes during planning. However, in situated temporal planning a complete plan must be generated before any action is executed. In some problems with time pressure, timing is too tight to complete planning before the first action must be executed. For example, an autonomous car that has a truck backing towards it should probably move out of the way now and plan how to get to its destination later. In this paper, we propose a new problem setting: concurrent planning and execution, in which actions can be dispatched (executed) before planning terminates. Unlike previous work on planning and execution, we must handle wall clock deadli",
    "path": "papers/24/03/2403.14796.json",
    "total_tokens": 826,
    "translated_title": "在时钟滴答声中规划和行动",
    "translated_abstract": "标准的时间规划假设规划是离线进行的，然后执行从时间0开始。最近，引入了情境化时间规划，其中规划从时间0开始，然后在规划终止后执行。情境化时间规划反映了更加真实的情景，即在规划过程中时间是流逝的。然而，在情境化时间规划中，必须在执行任何动作之前生成完整的计划。在一些时间压力较大的问题中，时间太紧迫，无法在必须执行第一个动作之前完成规划。例如，一辆自动驾驶汽车在一辆卡车朝它倒车时，可能现在应该躲开，然后再计划如何到达目的地。在本文中，我们提出了一个新的问题设置：并发规划和执行，即在规划终止之前可以派发（执行）动作。与以前关于规划和执行的工作不同，我们必须处理实时时钟的截止时间。",
    "tldr": "提出了并发规划和执行的新问题设置，允许在规划终止之前派发动作，适用于一些时间压力较大的情况。",
    "en_tdlr": "Introducing a new problem setting of concurrent planning and execution, allowing actions to be dispatched before planning terminates, suitable for scenarios with time pressure."
}