{
    "title": "Representing Anatomical Trees by Denoising Diffusion of Implicit Neural Fields",
    "abstract": "arXiv:2403.08974v1 Announce Type: cross  Abstract: Anatomical trees play a central role in clinical diagnosis and treatment planning. However, accurately representing anatomical trees is challenging due to their varying and complex topology and geometry. Traditional methods for representing tree structures, captured using medical imaging, while invaluable for visualizing vascular and bronchial networks, exhibit drawbacks in terms of limited resolution, flexibility, and efficiency. Recently, implicit neural representations (INRs) have emerged as a powerful tool for representing shapes accurately and efficiently. We propose a novel approach for representing anatomical trees using INR, while also capturing the distribution of a set of trees via denoising diffusion in the space of INRs. We accurately capture the intricate geometries and topologies of anatomical trees at any desired resolution. Through extensive qualitative and quantitative evaluation, we demonstrate high-fidelity tree reco",
    "link": "https://arxiv.org/abs/2403.08974",
    "context": "Title: Representing Anatomical Trees by Denoising Diffusion of Implicit Neural Fields\nAbstract: arXiv:2403.08974v1 Announce Type: cross  Abstract: Anatomical trees play a central role in clinical diagnosis and treatment planning. However, accurately representing anatomical trees is challenging due to their varying and complex topology and geometry. Traditional methods for representing tree structures, captured using medical imaging, while invaluable for visualizing vascular and bronchial networks, exhibit drawbacks in terms of limited resolution, flexibility, and efficiency. Recently, implicit neural representations (INRs) have emerged as a powerful tool for representing shapes accurately and efficiently. We propose a novel approach for representing anatomical trees using INR, while also capturing the distribution of a set of trees via denoising diffusion in the space of INRs. We accurately capture the intricate geometries and topologies of anatomical trees at any desired resolution. Through extensive qualitative and quantitative evaluation, we demonstrate high-fidelity tree reco",
    "path": "papers/24/03/2403.08974.json",
    "total_tokens": 705,
    "translated_title": "用去噪扩散隐式神经场表示解剖树",
    "translated_abstract": "解剖树在临床诊断和治疗规划中起着核心作用。然而，由于解剖树的拓扑结构和几何形状多样且复杂，准确表示解剖树具有挑战性。我们提出了一种使用隐式神经表示（INRs）来表示解剖树的新方法，同时通过在INR空间中进行去噪扩散来捕捉一组树的分布。我们可以在任何所需分辨率下准确捕捉解剖树的复杂几何和拓扑结构。",
    "tldr": "提出了一种使用隐式神经表示和去噪扩散来准确捕捉解剖树几何和拓扑结构的新方法",
    "en_tdlr": "Propose a novel approach using implicit neural representations and denoising diffusion to accurately capture the geometry and topology of anatomical trees."
}