{
    "title": "Predicting large scale cosmological structure evolution with GAN-based autoencoders",
    "abstract": "arXiv:2403.02171v1 Announce Type: cross  Abstract: Cosmological simulations play a key role in the prediction and understanding of large scale structure formation from initial conditions. We make use of GAN-based Autoencoders (AEs) in an attempt to predict structure evolution within simulations. The AEs are trained on images and cubes issued from respectively 2D and 3D N-body simulations describing the evolution of the dark matter (DM) field. We find that while the AEs can predict structure evolution for 2D simulations of DM fields well, using only the density fields as input, they perform significantly more poorly in similar conditions for 3D simulations. However, additionally providing velocity fields as inputs greatly improves results, with similar predictions regardless of time-difference between input and target.",
    "link": "https://arxiv.org/abs/2403.02171",
    "context": "Title: Predicting large scale cosmological structure evolution with GAN-based autoencoders\nAbstract: arXiv:2403.02171v1 Announce Type: cross  Abstract: Cosmological simulations play a key role in the prediction and understanding of large scale structure formation from initial conditions. We make use of GAN-based Autoencoders (AEs) in an attempt to predict structure evolution within simulations. The AEs are trained on images and cubes issued from respectively 2D and 3D N-body simulations describing the evolution of the dark matter (DM) field. We find that while the AEs can predict structure evolution for 2D simulations of DM fields well, using only the density fields as input, they perform significantly more poorly in similar conditions for 3D simulations. However, additionally providing velocity fields as inputs greatly improves results, with similar predictions regardless of time-difference between input and target.",
    "path": "papers/24/03/2403.02171.json",
    "total_tokens": 823,
    "translated_title": "使用基于GAN的自动编码器预测宇宙大尺度结构演化",
    "translated_abstract": "宇宙学模拟在从初始条件预测和理解大尺度结构形成中起着关键作用。我们利用基于GAN的自动编码器尝试预测模拟中的结构演化。自动编码器是在描述暗物质场演化的2D和3D N体模拟生成的图像和立方体上进行训练的。我们发现，虽然自动编码器可以很好地预测2D模拟暗物质场的结构演化，但在类似条件下，仅使用密度场作为输入情况下，在3D模拟中表现明显更差。然而，提供速度场作为输入能够大大改善结果，预测类似，而无论输入和目标之间的时间差异如何。",
    "tldr": "使用基于GAN的自动编码器在宇宙学模拟中尝试预测结构演化，发现在2D模拟中能够很好地预测暗物质场的结构演化，但在3D模拟中表现更差，提供速度场作为输入后结果显著改善。",
    "en_tdlr": "Predicting large scale structure evolution in cosmological simulations using GAN-based autoencoders. While performing well in 2D simulations of dark matter fields, the autoencoders show poor performance in 3D simulations, which can be greatly improved by providing velocity fields as inputs."
}