{
    "title": "Divide-and-Conquer Posterior Sampling for Denoising Diffusion Priors",
    "abstract": "arXiv:2403.11407v1 Announce Type: cross  Abstract: Interest in the use of Denoising Diffusion Models (DDM) as priors for solving inverse Bayesian problems has recently increased significantly. However, sampling from the resulting posterior distribution poses a challenge. To solve this problem, previous works have proposed approximations to bias the drift term of the diffusion. In this work, we take a different approach and utilize the specific structure of the DDM prior to define a set of intermediate and simpler posterior sampling problems, resulting in a lower approximation error compared to previous methods. We empirically demonstrate the reconstruction capability of our method for general linear inverse problems using synthetic examples and various image restoration tasks.",
    "link": "https://arxiv.org/abs/2403.11407",
    "context": "Title: Divide-and-Conquer Posterior Sampling for Denoising Diffusion Priors\nAbstract: arXiv:2403.11407v1 Announce Type: cross  Abstract: Interest in the use of Denoising Diffusion Models (DDM) as priors for solving inverse Bayesian problems has recently increased significantly. However, sampling from the resulting posterior distribution poses a challenge. To solve this problem, previous works have proposed approximations to bias the drift term of the diffusion. In this work, we take a different approach and utilize the specific structure of the DDM prior to define a set of intermediate and simpler posterior sampling problems, resulting in a lower approximation error compared to previous methods. We empirically demonstrate the reconstruction capability of our method for general linear inverse problems using synthetic examples and various image restoration tasks.",
    "path": "papers/24/03/2403.11407.json",
    "total_tokens": 728,
    "translated_title": "分布式分隔后验采样用于去噪扩散先验",
    "translated_abstract": "近年来，对于使用去噪扩散模型（DDM）作为逆贝叶斯问题求解的先验引起了极大的兴趣。然而，从结果后验分布中抽样是一个挑战。为了解决这个问题，先前的研究提出了近似方法来偏置扩散的漂移项。在本工作中，我们采取了一种不同的方法，并利用DDM先验的特定结构来定义一组中间和更简单的后验抽样问题，相比先前的方法，这些方法具有更低的逼近误差。我们通过使用合成例子和各种图像恢复任务来实证地展示我们方法对于一般线性逆问题的重构能力。",
    "tldr": "通过利用去噪扩散模型先验结构，提出了一种分布式分隔后验采样方法，相比先前的方法具有更低的逼近误差。",
    "en_tdlr": "Proposed a divide-and-conquer posterior sampling method for denoising diffusion priors by utilizing the specific structure of the DDM prior, which achieves lower approximation error compared to previous methods."
}