{
    "title": "WHAC: World-grounded Humans and Cameras",
    "abstract": "arXiv:2403.12959v1 Announce Type: cross  Abstract: Estimating human and camera trajectories with accurate scale in the world coordinate system from a monocular video is a highly desirable yet challenging and ill-posed problem. In this study, we aim to recover expressive parametric human models (i.e., SMPL-X) and corresponding camera poses jointly, by leveraging the synergy between three critical players: the world, the human, and the camera. Our approach is founded on two key observations. Firstly, camera-frame SMPL-X estimation methods readily recover absolute human depth. Secondly, human motions inherently provide absolute spatial cues. By integrating these insights, we introduce a novel framework, referred to as WHAC, to facilitate world-grounded expressive human pose and shape estimation (EHPS) alongside camera pose estimation, without relying on traditional optimization techniques. Additionally, we present a new synthetic dataset, WHAC-A-Mole, which includes accurately annotated h",
    "link": "https://arxiv.org/abs/2403.12959",
    "context": "Title: WHAC: World-grounded Humans and Cameras\nAbstract: arXiv:2403.12959v1 Announce Type: cross  Abstract: Estimating human and camera trajectories with accurate scale in the world coordinate system from a monocular video is a highly desirable yet challenging and ill-posed problem. In this study, we aim to recover expressive parametric human models (i.e., SMPL-X) and corresponding camera poses jointly, by leveraging the synergy between three critical players: the world, the human, and the camera. Our approach is founded on two key observations. Firstly, camera-frame SMPL-X estimation methods readily recover absolute human depth. Secondly, human motions inherently provide absolute spatial cues. By integrating these insights, we introduce a novel framework, referred to as WHAC, to facilitate world-grounded expressive human pose and shape estimation (EHPS) alongside camera pose estimation, without relying on traditional optimization techniques. Additionally, we present a new synthetic dataset, WHAC-A-Mole, which includes accurately annotated h",
    "path": "papers/24/03/2403.12959.json",
    "total_tokens": 892,
    "translated_title": "WHAC: 世界基准人类与摄像机",
    "translated_abstract": "从单目视频中准确估计世界坐标系中具有比例的人类和摄像机轨迹是一项非常理想但具有挑战性和模糊定义的问题。在本研究中，我们旨在通过利用世界、人类和摄像机三个关键要素之间的协同作用，联合恢复表现力强的参数化人体模型（即SMPL-X）和相应的摄像机姿势。我们的方法基于两个关键观察。首先，相机框架下的SMPL-X估计方法可以轻松恢复绝对人类深度。其次，人体动作本质上提供绝对空间线索。通过整合这些见解，我们引入了一个名为WHAC的新颖框架，以促进基于世界的表现力强的人体姿势和形状估计（EHPS），同时进行摄像机姿势估计，无需依赖传统的优化技术。此外，我们提出了一个新的合成数据集WHAC-A-Mole，其中包含了精确注释的信息。",
    "tldr": "该研究提出了一个名为WHAC的框架，可以实现基于世界坐标系的丰富人体姿势和形状估计，同时进行摄像机姿势估计，无需依赖传统优化技术。",
    "en_tdlr": "This study introduces a framework called WHAC that enables world-grounded expressive human pose and shape estimation alongside camera pose estimation without relying on traditional optimization techniques."
}