{
    "title": "Local Causal Discovery with Linear non-Gaussian Cyclic Models",
    "abstract": "arXiv:2403.14843v1 Announce Type: cross  Abstract: Local causal discovery is of great practical significance, as there are often situations where the discovery of the global causal structure is unnecessary, and the interest lies solely on a single target variable. Most existing local methods utilize conditional independence relations, providing only a partially directed graph, and assume acyclicity for the ground-truth structure, even though real-world scenarios often involve cycles like feedback mechanisms. In this work, we present a general, unified local causal discovery method with linear non-Gaussian models, whether they are cyclic or acyclic. We extend the application of independent component analysis from the global context to independent subspace analysis, enabling the exact identification of the equivalent local directed structures and causal strengths from the Markov blanket of the target variable. We also propose an alternative regression-based method in the particular acycl",
    "link": "https://arxiv.org/abs/2403.14843",
    "context": "Title: Local Causal Discovery with Linear non-Gaussian Cyclic Models\nAbstract: arXiv:2403.14843v1 Announce Type: cross  Abstract: Local causal discovery is of great practical significance, as there are often situations where the discovery of the global causal structure is unnecessary, and the interest lies solely on a single target variable. Most existing local methods utilize conditional independence relations, providing only a partially directed graph, and assume acyclicity for the ground-truth structure, even though real-world scenarios often involve cycles like feedback mechanisms. In this work, we present a general, unified local causal discovery method with linear non-Gaussian models, whether they are cyclic or acyclic. We extend the application of independent component analysis from the global context to independent subspace analysis, enabling the exact identification of the equivalent local directed structures and causal strengths from the Markov blanket of the target variable. We also propose an alternative regression-based method in the particular acycl",
    "path": "papers/24/03/2403.14843.json",
    "total_tokens": 731,
    "translated_title": "具有线性非高斯循环模型的局部因果发现",
    "translated_abstract": "局部因果发现具有重要的实际意义，因为经常会出现发现全局因果结构并非必要的情况，兴趣仅仅在于单个目标变量。本工作提出了一种通用的、统一的局部因果发现方法，使用线性非高斯模型，无论其是否是循环的或非循环的。我们将独立成分分析的应用从全局上下文扩展到独立子空间分析，从目标变量的马尔可夫毯中精确识别等效的局部有向结构和因果强度。",
    "tldr": "提出一种通用的、统一的局部因果发现方法，使用线性非高斯模型，实现了从目标变量的马尔可夫毯中精确识别等效的局部有向结构和因果强度",
    "en_tdlr": "Propose a general, unified method for local causal discovery with linear non-Gaussian models, enabling the exact identification of equivalent local directed structures and causal strengths from the Markov blanket of the target variable."
}