{
    "title": "Human and Automatic Interpretation of Romanian Noun Compounds",
    "abstract": "arXiv:2403.06360v1 Announce Type: cross  Abstract: Determining the intended, context-dependent meanings of noun compounds like \"shoe sale\" and \"fire sale\" remains a challenge for NLP. Previous work has relied on inventories of semantic relations that capture the different meanings between compound members. Focusing on Romanian compounds, whose morphosyntax differs from that of their English counterparts, we propose a new set of relations and test it with human annotators and a neural net classifier. Results show an alignment of the network's predictions and human judgments, even where the human agreement rate is low. Agreement tracks with the frequency of the selected relations, regardless of structural differences. However, the most frequently selected relation was none of the sixteen labeled semantic relations, indicating the need for a better relation inventory.",
    "link": "https://arxiv.org/abs/2403.06360",
    "context": "Title: Human and Automatic Interpretation of Romanian Noun Compounds\nAbstract: arXiv:2403.06360v1 Announce Type: cross  Abstract: Determining the intended, context-dependent meanings of noun compounds like \"shoe sale\" and \"fire sale\" remains a challenge for NLP. Previous work has relied on inventories of semantic relations that capture the different meanings between compound members. Focusing on Romanian compounds, whose morphosyntax differs from that of their English counterparts, we propose a new set of relations and test it with human annotators and a neural net classifier. Results show an alignment of the network's predictions and human judgments, even where the human agreement rate is low. Agreement tracks with the frequency of the selected relations, regardless of structural differences. However, the most frequently selected relation was none of the sixteen labeled semantic relations, indicating the need for a better relation inventory.",
    "path": "papers/24/03/2403.06360.json",
    "total_tokens": 857,
    "translated_title": "人类和自动解释罗马尼亚名词复合词",
    "translated_abstract": "确定类似\"鞋子销售\"和\"火灾大甩卖\"这样的名词复合词在特定语境中的预期含义对于自然语言处理而言仍然是一个挑战。先前的研究依赖于捕捉复合词成员间不同含义的语义关系清单。针对罗马尼亚的复合词，其形态句法与英语的对应物不同，我们提出了一个新的关系集，并通过人类注释者和神经网络分类器进行了测试。结果显示网络的预测与人类判断之间存在一致，即使在人类一致率较低的地方也是如此。一致性与所选关系的频率保持一致，而不受结构差异的影响。然而，最常选择的关系不属于十六个标记的语义关系之一，这表明需要一个更好的关系清单。",
    "tldr": "提出了新的罗马尼亚名词复合词关系集，通过人类和神经网络分类器测试后发现，网络的预测与人类判断存在一致，即使是在人类一致率较低的情况下。需要一个更好的关系清单。",
    "en_tdlr": "Proposed a new set of relations for Romanian noun compounds, testing with human annotators and a neural net classifier resulted in alignment between network predictions and human judgments, even in cases of low human agreement rates. Need for a better relation inventory was indicated by the most frequently selected relation not being among the sixteen labeled semantic relations."
}