{
    "title": "BVR Gym: A Reinforcement Learning Environment for Beyond-Visual-Range Air Combat",
    "abstract": "arXiv:2403.17533v1 Announce Type: new  Abstract: Creating new air combat tactics and discovering novel maneuvers can require numerous hours of expert pilots' time. Additionally, for each different combat scenario, the same strategies may not work since small changes in equipment performance may drastically change the air combat outcome. For this reason, we created a reinforcement learning environment to help investigate potential air combat tactics in the field of beyond-visual-range (BVR) air combat: the BVR Gym. This type of air combat is important since long-range missiles are often the first weapon to be used in aerial combat. Some existing environments provide high-fidelity simulations but are either not open source or are not adapted to the BVR air combat domain. Other environments are open source but use less accurate simulation models. Our work provides a high-fidelity environment based on the open-source flight dynamics simulator JSBSim and is adapted to the BVR air combat dom",
    "link": "https://arxiv.org/abs/2403.17533",
    "context": "Title: BVR Gym: A Reinforcement Learning Environment for Beyond-Visual-Range Air Combat\nAbstract: arXiv:2403.17533v1 Announce Type: new  Abstract: Creating new air combat tactics and discovering novel maneuvers can require numerous hours of expert pilots' time. Additionally, for each different combat scenario, the same strategies may not work since small changes in equipment performance may drastically change the air combat outcome. For this reason, we created a reinforcement learning environment to help investigate potential air combat tactics in the field of beyond-visual-range (BVR) air combat: the BVR Gym. This type of air combat is important since long-range missiles are often the first weapon to be used in aerial combat. Some existing environments provide high-fidelity simulations but are either not open source or are not adapted to the BVR air combat domain. Other environments are open source but use less accurate simulation models. Our work provides a high-fidelity environment based on the open-source flight dynamics simulator JSBSim and is adapted to the BVR air combat dom",
    "path": "papers/24/03/2403.17533.json",
    "total_tokens": 906,
    "translated_title": "BVR体育馆：一种超视距空战的强化学习环境",
    "translated_abstract": "创建新的空战战术和发现新的机动可能需要大量专家飞行员的时间。此外，对于每种不同的作战场景，相同的策略可能不适用，因为设备性能的微小变化可能会极大地改变空中战斗结果。出于这个原因，我们创建了一个强化学习环境，以帮助调查超视距（BVR）空中战斗领域潜在的空战战术：BVR体育馆。这种空中战斗是重要的，因为远程导弹通常是空中战斗中首先被使用的武器。一些现有环境提供了高保真度的模拟，但要么不是开源的，要么没有适应于BVR空战领域。其他环境是开源的，但使用不太准确的模拟模型。我们的工作提供了一个基于开源飞行动力学模拟器JSBSim的高保真度环境，并适应于BVR空战领域。",
    "tldr": "研究者创建了一个强化学习环境BVR体育馆，用于探究超视距空中战斗领域的潜在战术，提供了基于开源飞行动力学模拟器JSBSim的高保真度环境。",
    "en_tdlr": "Researchers created a reinforcement learning environment called BVR Gym to investigate potential tactics in beyond-visual-range air combat, offering a high-fidelity environment based on the open-source flight dynamics simulator JSBSim."
}