{
    "title": "Understanding Training-free Diffusion Guidance: Mechanisms and Limitations",
    "abstract": "arXiv:2403.12404v1 Announce Type: new  Abstract: Adding additional control to pretrained diffusion models has become an increasingly popular research area, with extensive applications in computer vision, reinforcement learning, and AI for science. Recently, several studies have proposed training-free diffusion guidance by using off-the-shelf networks pretrained on clean images. This approach enables zero-shot conditional generation for universal control formats, which appears to offer a free lunch in diffusion guidance. In this paper, we aim to develop a deeper understanding of the operational mechanisms and fundamental limitations of training-free guidance. We offer a theoretical analysis that supports training-free guidance from the perspective of optimization, distinguishing it from classifier-based (or classifier-free) guidance. To elucidate their drawbacks, we theoretically demonstrate that training-free methods are more susceptible to adversarial gradients and exhibit slower conv",
    "link": "https://arxiv.org/abs/2403.12404",
    "context": "Title: Understanding Training-free Diffusion Guidance: Mechanisms and Limitations\nAbstract: arXiv:2403.12404v1 Announce Type: new  Abstract: Adding additional control to pretrained diffusion models has become an increasingly popular research area, with extensive applications in computer vision, reinforcement learning, and AI for science. Recently, several studies have proposed training-free diffusion guidance by using off-the-shelf networks pretrained on clean images. This approach enables zero-shot conditional generation for universal control formats, which appears to offer a free lunch in diffusion guidance. In this paper, we aim to develop a deeper understanding of the operational mechanisms and fundamental limitations of training-free guidance. We offer a theoretical analysis that supports training-free guidance from the perspective of optimization, distinguishing it from classifier-based (or classifier-free) guidance. To elucidate their drawbacks, we theoretically demonstrate that training-free methods are more susceptible to adversarial gradients and exhibit slower conv",
    "path": "papers/24/03/2403.12404.json",
    "total_tokens": 877,
    "translated_title": "理解无需训练的扩散引导：机制与局限性",
    "translated_abstract": "向预先训练的扩散模型添加额外控制已成为越来越流行的研究领域，在计算机视觉、强化学习和科学人工智能等领域有广泛应用。最近，一些研究提出使用在干净图像上预训练的现成网络进行无需训练的扩散引导。这种方法实现了零样本条件生成，适用于通用控制格式，看起来提供了无需训练的扩散引导中的免费午餐。本文旨在对无需训练的引导的运行机制和基本限制进行更深入的理解。我们提供了一项支持无需训练引导的理论分析，从优化的角度区分了它与基于分类器的（或者无分类器的）引导。为了阐明它们的缺点，我们在理论上证明了无需训练方法更容易受到对抗性梯度的影响，并表现出更慢的收敛速度。",
    "tldr": "本文旨在深入理解无需训练的扩散引导的操作机制和基本限制，提供了理论分析支持该方法，同时揭示了其更易受到对抗性梯度影响和较慢收敛的缺点。",
    "en_tdlr": "This paper aims to develop a deeper understanding of the operational mechanisms and fundamental limitations of training-free diffusion guidance, offering theoretical analysis supporting the method while revealing its vulnerability to adversarial gradients and slower convergence."
}