{
    "title": "A Multi-constraint and Multi-objective Allocation Model for Emergency Rescue in IoT Environment",
    "abstract": "arXiv:2403.10299v1 Announce Type: new  Abstract: Emergency relief operations are essential in disaster aftermaths, necessitating effective resource allocation to minimize negative impacts and maximize benefits. In prolonged crises or extensive disasters, a systematic, multi-cycle approach is key for timely and informed decision-making. Leveraging advancements in IoT and spatio-temporal data analytics, we've developed the Multi-Objective Shuffled Gray-Wolf Frog Leaping Model (MSGW-FLM). This multi-constraint, multi-objective resource allocation model has been rigorously tested against 28 diverse challenges, showing superior performance in comparison to established models such as NSGA-II, IBEA, and MOEA/D. MSGW-FLM's effectiveness is particularly notable in complex, multi-cycle emergency rescue scenarios, which involve numerous constraints and objectives. This model represents a significant step forward in optimizing resource distribution in emergency response situations.",
    "link": "https://arxiv.org/abs/2403.10299",
    "context": "Title: A Multi-constraint and Multi-objective Allocation Model for Emergency Rescue in IoT Environment\nAbstract: arXiv:2403.10299v1 Announce Type: new  Abstract: Emergency relief operations are essential in disaster aftermaths, necessitating effective resource allocation to minimize negative impacts and maximize benefits. In prolonged crises or extensive disasters, a systematic, multi-cycle approach is key for timely and informed decision-making. Leveraging advancements in IoT and spatio-temporal data analytics, we've developed the Multi-Objective Shuffled Gray-Wolf Frog Leaping Model (MSGW-FLM). This multi-constraint, multi-objective resource allocation model has been rigorously tested against 28 diverse challenges, showing superior performance in comparison to established models such as NSGA-II, IBEA, and MOEA/D. MSGW-FLM's effectiveness is particularly notable in complex, multi-cycle emergency rescue scenarios, which involve numerous constraints and objectives. This model represents a significant step forward in optimizing resource distribution in emergency response situations.",
    "path": "papers/24/03/2403.10299.json",
    "total_tokens": 803,
    "translated_title": "一种面向物联网环境中紧急救援的多约束多目标分配模型",
    "translated_abstract": "紧急救援行动在灾后至关重要，需要有效的资源分配以最小化负面影响并最大化收益。在长时间危机或大规模灾害中，系统化的多周期方法对于及时和明智的决策至关重要。借助物联网和时空数据分析的进展，我们开发了多目标洗牌灰狼青蛙跳模型（MSGW-FLM）。这个多约束、多目标的资源分配模型已经经过严格测试，与NSGA-II、IBEA和MOEA/D等已建立的模型相比表现出更优异的性能。MSGW-FLM的有效性在复杂的多周期紧急救援场景中尤为引人注目，这些场景涉及众多约束和目标。这个模型在优化应急响应情境中资源分配方面迈出了重要的一步。",
    "tldr": "这个多约束多目标分配模型在紧急救援场景中优化资源分配方面取得了显著进展。",
    "en_tdlr": "This multi-constraint, multi-objective allocation model represents a significant step forward in optimizing resource distribution in emergency rescue scenarios."
}