{
    "title": "AI Sustainability in Practice Part One: Foundations for Sustainable AI Projects",
    "abstract": "arXiv:2403.14635v1 Announce Type: cross  Abstract: Sustainable AI projects are continuously responsive to the transformative effects as well as short-, medium-, and long-term impacts on individuals and society that the design, development, and deployment of AI technologies may have. Projects, which centre AI Sustainability, ensure that values-led, collaborative, and anticipatory reflection both guides the assessment of potential social and ethical impacts and steers responsible innovation practices.   This workbook is the first part of a pair that provides the concepts and tools needed to put AI Sustainability into practice. It introduces the SUM Values, which help AI project teams to assess the potential societal impacts and ethical permissibility of their projects. It then presents a Stakeholder Engagement Process (SEP), which provides tools to facilitate proportionate engagement of and input from stakeholders with an emphasis on equitable and meaningful participation and positionali",
    "link": "https://arxiv.org/abs/2403.14635",
    "context": "Title: AI Sustainability in Practice Part One: Foundations for Sustainable AI Projects\nAbstract: arXiv:2403.14635v1 Announce Type: cross  Abstract: Sustainable AI projects are continuously responsive to the transformative effects as well as short-, medium-, and long-term impacts on individuals and society that the design, development, and deployment of AI technologies may have. Projects, which centre AI Sustainability, ensure that values-led, collaborative, and anticipatory reflection both guides the assessment of potential social and ethical impacts and steers responsible innovation practices.   This workbook is the first part of a pair that provides the concepts and tools needed to put AI Sustainability into practice. It introduces the SUM Values, which help AI project teams to assess the potential societal impacts and ethical permissibility of their projects. It then presents a Stakeholder Engagement Process (SEP), which provides tools to facilitate proportionate engagement of and input from stakeholders with an emphasis on equitable and meaningful participation and positionali",
    "path": "papers/24/03/2403.14635.json",
    "total_tokens": 811,
    "translated_title": "AI可持续性在实践中的应用 第一部分：可持续AI项目的基础",
    "translated_abstract": "可持续的AI项目持续关注设计、开发和部署AI技术可能对个人和社会产生的转变效应以及短期、中期和长期影响。着重于AI可持续性的项目确保价值导向、协作和预见性反思引导评估潜在社会和伦理影响，并引导负责任的创新实践。该工作手册是成对提供的第一部分，提供了将AI可持续性付诸实践所需的概念和工具。它介绍了SUM价值，帮助AI项目团队评估其项目的潜在社会影响和伦理可容忍性。然后介绍了利益相关者参与流程(SEP)，提供工具促进利益相关者的比例参与和意见，强调平等和有意义的参与和定位。",
    "tldr": "该论文介绍了AI可持续性概念及工具，旨在指导AI项目团队评估社会影响和伦理可容忍性，提出了促进利益相关者参与的流程。",
    "en_tdlr": "This paper introduces the concept and tools of AI sustainability to guide AI project teams in evaluating societal impacts and ethical permissibility, presenting a process to facilitate stakeholder engagement."
}