{
    "title": "MulCogBench: A Multi-modal Cognitive Benchmark Dataset for Evaluating Chinese and English Computational Language Models",
    "abstract": "arXiv:2403.01116v1 Announce Type: new  Abstract: Pre-trained computational language models have recently made remarkable progress in harnessing the language abilities which were considered unique to humans. Their success has raised interest in whether these models represent and process language like humans. To answer this question, this paper proposes MulCogBench, a multi-modal cognitive benchmark dataset collected from native Chinese and English participants. It encompasses a variety of cognitive data, including subjective semantic ratings, eye-tracking, functional magnetic resonance imaging (fMRI), and magnetoencephalography (MEG). To assess the relationship between language models and cognitive data, we conducted a similarity-encoding analysis which decodes cognitive data based on its pattern similarity with textual embeddings. Results show that language models share significant similarities with human cognitive data and the similarity patterns are modulated by the data modality and",
    "link": "https://arxiv.org/abs/2403.01116",
    "context": "Title: MulCogBench: A Multi-modal Cognitive Benchmark Dataset for Evaluating Chinese and English Computational Language Models\nAbstract: arXiv:2403.01116v1 Announce Type: new  Abstract: Pre-trained computational language models have recently made remarkable progress in harnessing the language abilities which were considered unique to humans. Their success has raised interest in whether these models represent and process language like humans. To answer this question, this paper proposes MulCogBench, a multi-modal cognitive benchmark dataset collected from native Chinese and English participants. It encompasses a variety of cognitive data, including subjective semantic ratings, eye-tracking, functional magnetic resonance imaging (fMRI), and magnetoencephalography (MEG). To assess the relationship between language models and cognitive data, we conducted a similarity-encoding analysis which decodes cognitive data based on its pattern similarity with textual embeddings. Results show that language models share significant similarities with human cognitive data and the similarity patterns are modulated by the data modality and",
    "path": "papers/24/03/2403.01116.json",
    "total_tokens": 925,
    "translated_title": "MulCogBench：用于评估中文和英文计算语言模型的多模式认知基准数据集",
    "translated_abstract": "arXiv:2403.01116v1 宣布类型: 新的 摘要: 最近，预训练的计算语言模型在利用人类认为是独有的语言能力方面取得了显著进展。它们的成功引起了人们对这些模型是否像人类一样表示和处理语言的兴趣。为了回答这个问题，本文提出了MulCogBench，这是一个从母语为中文和英文的参与者那里收集的多模式认知基准数据集。它包含各种认知数据，包括主观语义评分，眼动追踪，功能磁共振成像（fMRI）和巨磁脑电图（MEG）。为了评估语言模型与认知数据之间的关系，我们进行了一项相似性编码分析，该分析根据其与文本嵌入的模式相似性对认知数据进行解码。结果显示，语言模型与人类认知数据共享显著相似性，并且相似性模式受数据模态的调节。",
    "tldr": "MulCogBench是一个多模式认知基准数据集，旨在评估中文和英文计算语言模型。通过相似性编码分析发现，语言模型与人类认知数据之间存在显著相似性，并且这种相似性模式受数据模态和调节影响。",
    "en_tdlr": "MulCogBench is a multi-modal cognitive benchmark dataset designed to evaluate Chinese and English computational language models. Through similarity-encoding analysis, it is found that language models share significant similarities with human cognitive data, and this similarity pattern is modulated by data modality and adjustments."
}