{
    "title": "MCformer: Multivariate Time Series Forecasting with Mixed-Channels Transformer",
    "abstract": "arXiv:2403.09223v1 Announce Type: new  Abstract: The massive generation of time-series data by largescale Internet of Things (IoT) devices necessitates the exploration of more effective models for multivariate time-series forecasting. In previous models, there was a predominant use of the Channel Dependence (CD) strategy (where each channel represents a univariate sequence). Current state-of-the-art (SOTA) models primarily rely on the Channel Independence (CI) strategy. The CI strategy treats all channels as a single channel, expanding the dataset to improve generalization performance and avoiding inter-channel correlation that disrupts long-term features. However, the CI strategy faces the challenge of interchannel correlation forgetting. To address this issue, we propose an innovative Mixed Channels strategy, combining the data expansion advantages of the CI strategy with the ability to counteract inter-channel correlation forgetting. Based on this strategy, we introduce MCformer, a ",
    "link": "https://arxiv.org/abs/2403.09223",
    "context": "Title: MCformer: Multivariate Time Series Forecasting with Mixed-Channels Transformer\nAbstract: arXiv:2403.09223v1 Announce Type: new  Abstract: The massive generation of time-series data by largescale Internet of Things (IoT) devices necessitates the exploration of more effective models for multivariate time-series forecasting. In previous models, there was a predominant use of the Channel Dependence (CD) strategy (where each channel represents a univariate sequence). Current state-of-the-art (SOTA) models primarily rely on the Channel Independence (CI) strategy. The CI strategy treats all channels as a single channel, expanding the dataset to improve generalization performance and avoiding inter-channel correlation that disrupts long-term features. However, the CI strategy faces the challenge of interchannel correlation forgetting. To address this issue, we propose an innovative Mixed Channels strategy, combining the data expansion advantages of the CI strategy with the ability to counteract inter-channel correlation forgetting. Based on this strategy, we introduce MCformer, a ",
    "path": "papers/24/03/2403.09223.json",
    "total_tokens": 739,
    "translated_title": "MCformer: 混合通道Transformer实现多变量时间序列预测",
    "translated_abstract": "大规模物联网设备的时间序列数据大量生成，需要探索更有效的多变量时间序列预测模型。当前最先进的模型主要依赖通道独立（CI）策略，但是CI策略面临着跨通道相关性忘却的挑战。为了解决这个问题，我们提出了创新的混合通道策略，结合了CI策略的数据扩展优势和对抗跨通道相关性忘却的能力。基于这个策略，我们引入了MCformer，一个...",
    "tldr": "提出了混合通道策略，结合了通道独立策略的数据扩展优势，能对抗跨通道相关性忘却，实现多变量时间序列预测的创新模型MCformer。",
    "en_tdlr": "Introduced a Mixed Channels strategy that combines the data expansion advantages of the Channel Independence strategy, capable of counteracting inter-channel correlation forgetting, to achieve innovative multivariate time series forecasting model MCformer."
}