{
    "title": "An Interpretable Ensemble of Graph and Language Models for Improving Search Relevance in E-Commerce",
    "abstract": "arXiv:2403.00923v1 Announce Type: cross  Abstract: The problem of search relevance in the E-commerce domain is a challenging one since it involves understanding the intent of a user's short nuanced query and matching it with the appropriate products in the catalog. This problem has traditionally been addressed using language models (LMs) and graph neural networks (GNNs) to capture semantic and inter-product behavior signals, respectively. However, the rapid development of new architectures has created a gap between research and the practical adoption of these techniques. Evaluating the generalizability of these models for deployment requires extensive experimentation on complex, real-world datasets, which can be non-trivial and expensive. Furthermore, such models often operate on latent space representations that are incomprehensible to humans, making it difficult to evaluate and compare the effectiveness of different models. This lack of interpretability hinders the development and ad",
    "link": "https://arxiv.org/abs/2403.00923",
    "context": "Title: An Interpretable Ensemble of Graph and Language Models for Improving Search Relevance in E-Commerce\nAbstract: arXiv:2403.00923v1 Announce Type: cross  Abstract: The problem of search relevance in the E-commerce domain is a challenging one since it involves understanding the intent of a user's short nuanced query and matching it with the appropriate products in the catalog. This problem has traditionally been addressed using language models (LMs) and graph neural networks (GNNs) to capture semantic and inter-product behavior signals, respectively. However, the rapid development of new architectures has created a gap between research and the practical adoption of these techniques. Evaluating the generalizability of these models for deployment requires extensive experimentation on complex, real-world datasets, which can be non-trivial and expensive. Furthermore, such models often operate on latent space representations that are incomprehensible to humans, making it difficult to evaluate and compare the effectiveness of different models. This lack of interpretability hinders the development and ad",
    "path": "papers/24/03/2403.00923.json",
    "total_tokens": 863,
    "translated_title": "用于提高电子商务搜索相关性的图形和语言模型可解释的集成",
    "translated_abstract": "在电子商务领域，搜索相关性的问题是一个具有挑战性的问题，因为它涉及理解用户的简短微妙查询的意图，并将其与目录中的适当产品相匹配。传统上，这个问题是通过使用语言模型（LMs）和图神经网络（GNNs）来应对的，以捕捉语义和产品间行为信号。然而，新架构的快速发展造成了研究和这些技术实际应用之间的鸿沟。评估这些模型在部署中的泛化能力需要对复杂的现实世界数据集进行广泛的实验，这可能并不简单且昂贵。此外，这种模型通常在不为人类所理解的潜在空间表示上运行，这使得评估和比较不同模型的有效性变得困难。这种缺乏可解释性阻碍了开发和ad",
    "tldr": "该研究提出了一个可解释的图形和语言模型集成方法，用于提高电子商务领域中搜索相关性，弥补了现有模型在实际部署中的泛化能力和可解释性方面的不足。",
    "en_tdlr": "This study presents an interpretable ensemble approach of graph and language models to enhance search relevance in the E-commerce domain, addressing the shortcomings in generalizability and interpretability of existing models for practical deployment."
}