{
    "title": "Anytime Neural Architecture Search on Tabular Data",
    "abstract": "arXiv:2403.10318v1 Announce Type: new  Abstract: The increasing demand for tabular data analysis calls for transitioning from manual architecture design to Neural Architecture Search (NAS). This transition demands an efficient and responsive anytime NAS approach that is capable of returning current optimal architectures within any given time budget while progressively enhancing architecture quality with increased budget allocation. However, the area of research on Anytime NAS for tabular data remains unexplored. To this end, we introduce ATLAS, the first anytime NAS approach tailored for tabular data. ATLAS introduces a novel two-phase filtering-and-refinement optimization scheme with joint optimization, combining the strengths of both paradigms of training-free and training-based architecture evaluation. Specifically, in the filtering phase, ATLAS employs a new zero-cost proxy specifically designed for tabular data to efficiently estimate the performance of candidate architectures, th",
    "link": "https://arxiv.org/abs/2403.10318",
    "context": "Title: Anytime Neural Architecture Search on Tabular Data\nAbstract: arXiv:2403.10318v1 Announce Type: new  Abstract: The increasing demand for tabular data analysis calls for transitioning from manual architecture design to Neural Architecture Search (NAS). This transition demands an efficient and responsive anytime NAS approach that is capable of returning current optimal architectures within any given time budget while progressively enhancing architecture quality with increased budget allocation. However, the area of research on Anytime NAS for tabular data remains unexplored. To this end, we introduce ATLAS, the first anytime NAS approach tailored for tabular data. ATLAS introduces a novel two-phase filtering-and-refinement optimization scheme with joint optimization, combining the strengths of both paradigms of training-free and training-based architecture evaluation. Specifically, in the filtering phase, ATLAS employs a new zero-cost proxy specifically designed for tabular data to efficiently estimate the performance of candidate architectures, th",
    "path": "papers/24/03/2403.10318.json",
    "total_tokens": 822,
    "translated_title": "基于表格数据的任意时间神经网络架构搜索",
    "translated_abstract": "随着对表格数据分析的需求增加，从手动架构设计转变为神经网络架构搜索(NAS)。这种转变需要一种高效且响应灵敏的任意时间NAS方法，能够在任何给定的时间预算内返回当前的最佳架构，并随着预算分配的增加逐渐提高架构质量。然而，关于表格数据的任意时间NAS领域仍未被探索。为此，我们引入了ATLAS，第一个专为表格数据量身定制的任意时间NAS方法。ATLAS引入了一种新颖的两阶段过滤和优化方案，结合了训练-free和基于训练的架构评估两种范式的优势。具体来说，在过滤阶段，ATLAS采用了一种新的为表格数据专门设计的零成本代理，用于高效估计候选架构的性能。",
    "tldr": "ATLAS是第一个专为表格数据设计的任意时间神经网络架构搜索方法，引入了过滤和优化方案，结合了训练-free和基于训练的架构评估两种范式的优势"
}