{
    "title": "AIx Speed: Playback Speed Optimization Using Listening Comprehension of Speech Recognition Models",
    "abstract": "arXiv:2403.02938v1 Announce Type: new  Abstract: Since humans can listen to audio and watch videos at faster speeds than actually observed, we often listen to or watch these pieces of content at higher playback speeds to increase the time efficiency of content comprehension. To further utilize this capability, systems that automatically adjust the playback speed according to the user's condition and the type of content to assist in more efficient comprehension of time-series content have been developed. However, there is still room for these systems to further extend human speed-listening ability by generating speech with playback speed optimized for even finer time units and providing it to humans. In this study, we determine whether humans can hear the optimized speech and propose a system that automatically adjusts playback speed at units as small as phonemes while ensuring speech intelligibility. The system uses the speech recognizer score as a proxy for how well a human can hear a",
    "link": "https://arxiv.org/abs/2403.02938",
    "context": "Title: AIx Speed: Playback Speed Optimization Using Listening Comprehension of Speech Recognition Models\nAbstract: arXiv:2403.02938v1 Announce Type: new  Abstract: Since humans can listen to audio and watch videos at faster speeds than actually observed, we often listen to or watch these pieces of content at higher playback speeds to increase the time efficiency of content comprehension. To further utilize this capability, systems that automatically adjust the playback speed according to the user's condition and the type of content to assist in more efficient comprehension of time-series content have been developed. However, there is still room for these systems to further extend human speed-listening ability by generating speech with playback speed optimized for even finer time units and providing it to humans. In this study, we determine whether humans can hear the optimized speech and propose a system that automatically adjusts playback speed at units as small as phonemes while ensuring speech intelligibility. The system uses the speech recognizer score as a proxy for how well a human can hear a",
    "path": "papers/24/03/2403.02938.json",
    "total_tokens": 812,
    "translated_title": "AIx Speed：使用语音识别模型的听力理解优化回放速度",
    "translated_abstract": "由于人类可以以比实际观察到的速度更快地倾听音频和观看视频，因此我们经常以更高的播放速度倾听或观看这些内容的片段，以提高内容理解的时间效率。为了进一步利用这种能力，已经开发出了根据用户情况和内容类型自动调整播放速度的系统，以协助更高效地理解时间序列内容。然而，这些系统仍有进一步提高人类速听能力的空间，即生成已经针对更精细的时间单位优化过的语音，并将其提供给人类。在本研究中，我们确定人类能否听到优化过的语音，并提出了一种系统，该系统可根据音素为单位自动调整播放速度，同时确保语音可辨识度。系统使用语音识别得分作为衡量人类能否听到的代理。",
    "tldr": "本研究探讨了人类是否可以听到经过优化的语音，并提出了一种系统，可根据音素为单位自动调整播放速度，以确保语音可辨识度。"
}