{
    "title": "Symmetry Considerations for Learning Task Symmetric Robot Policies",
    "abstract": "arXiv:2403.04359v1 Announce Type: cross  Abstract: Symmetry is a fundamental aspect of many real-world robotic tasks. However, current deep reinforcement learning (DRL) approaches can seldom harness and exploit symmetry effectively. Often, the learned behaviors fail to achieve the desired transformation invariances and suffer from motion artifacts. For instance, a quadruped may exhibit different gaits when commanded to move forward or backward, even though it is symmetrical about its torso. This issue becomes further pronounced in high-dimensional or complex environments, where DRL methods are prone to local optima and fail to explore regions of the state space equally. Past methods on encouraging symmetry for robotic tasks have studied this topic mainly in a single-task setting, where symmetry usually refers to symmetry in the motion, such as the gait patterns. In this paper, we revisit this topic for goal-conditioned tasks in robotics, where symmetry lies mainly in task execution and",
    "link": "https://arxiv.org/abs/2403.04359",
    "context": "Title: Symmetry Considerations for Learning Task Symmetric Robot Policies\nAbstract: arXiv:2403.04359v1 Announce Type: cross  Abstract: Symmetry is a fundamental aspect of many real-world robotic tasks. However, current deep reinforcement learning (DRL) approaches can seldom harness and exploit symmetry effectively. Often, the learned behaviors fail to achieve the desired transformation invariances and suffer from motion artifacts. For instance, a quadruped may exhibit different gaits when commanded to move forward or backward, even though it is symmetrical about its torso. This issue becomes further pronounced in high-dimensional or complex environments, where DRL methods are prone to local optima and fail to explore regions of the state space equally. Past methods on encouraging symmetry for robotic tasks have studied this topic mainly in a single-task setting, where symmetry usually refers to symmetry in the motion, such as the gait patterns. In this paper, we revisit this topic for goal-conditioned tasks in robotics, where symmetry lies mainly in task execution and",
    "path": "papers/24/03/2403.04359.json",
    "total_tokens": 654,
    "translated_title": "学习任务对称机器人策略的对称性考虑",
    "translated_abstract": "对称性是许多现实世界机器人任务的基本特征。然而，目前的深度强化学习（DRL）方法很少能够有效地利用和利用对称性。通常，学习到的行为不能实现所需的转换不变性，并且存在运动缺陷。本文重新研究了针对机器人任务中的目标条件对称性的主题，其中对称性主要存在于任务执行中。",
    "tldr": "该论文重新研究了针对机器人任务中的目标条件对称性的主题，突出表现在任务执行中。",
    "en_tdlr": "This paper revisits the topic of goal-conditioned symmetry for robotic tasks, with symmetry mainly present in task execution."
}