{
    "title": "Single Transit Detection In Kepler With Machine Learning And Onboard Spacecraft Diagnostics",
    "abstract": "arXiv:2403.03427v1 Announce Type: cross  Abstract: Exoplanet discovery at long orbital periods requires reliably detecting individual transits without additional information about the system. Techniques like phase-folding of light curves and periodogram analysis of radial velocity data are more sensitive to planets with shorter orbital periods, leaving a dearth of planet discoveries at long periods. We present a novel technique using an ensemble of Convolutional Neural Networks incorporating the onboard spacecraft diagnostics of \\emph{Kepler} to classify transits within a light curve. We create a pipeline to recover the location of individual transits, and the period of the orbiting planet, which maintains $>80\\%$ transit recovery sensitivity out to an 800-day orbital period. Our neural network pipeline has the potential to discover additional planets in the \\emph{Kepler} dataset, and crucially, within the $\\eta$-Earth regime. We report our first candidate from this pipeline, KOI 1271.",
    "link": "https://arxiv.org/abs/2403.03427",
    "context": "Title: Single Transit Detection In Kepler With Machine Learning And Onboard Spacecraft Diagnostics\nAbstract: arXiv:2403.03427v1 Announce Type: cross  Abstract: Exoplanet discovery at long orbital periods requires reliably detecting individual transits without additional information about the system. Techniques like phase-folding of light curves and periodogram analysis of radial velocity data are more sensitive to planets with shorter orbital periods, leaving a dearth of planet discoveries at long periods. We present a novel technique using an ensemble of Convolutional Neural Networks incorporating the onboard spacecraft diagnostics of \\emph{Kepler} to classify transits within a light curve. We create a pipeline to recover the location of individual transits, and the period of the orbiting planet, which maintains $>80\\%$ transit recovery sensitivity out to an 800-day orbital period. Our neural network pipeline has the potential to discover additional planets in the \\emph{Kepler} dataset, and crucially, within the $\\eta$-Earth regime. We report our first candidate from this pipeline, KOI 1271.",
    "path": "papers/24/03/2403.03427.json",
    "total_tokens": 864,
    "translated_title": "用机器学习和航天器上的诊断技术在Kepler中单次变迁检测",
    "translated_abstract": "发现长轨道周期的外行星需要可靠地检测单个变迁，而无需关于系统的其他信息。像相位折叠光变曲线和径向速度数据的周期图分析这样的技术对于轨道周期较短的行星更敏感，导致在长周期下的行星发现不足。我们提出了一种新颖的技术，利用集成的卷积神经网络结合Kepler上的航天器诊断来对光变曲线中的变迁进行分类。我们创建了一个流程来恢复单个变迁的位置，以及轨道行星的周期，保持超过80%的变迁恢复灵敏度，达到800天的轨道周期。我们的神经网络流程有潜力在Kepler数据集中发现额外的行星，并且关键地，在η-地球区域内。我们报告了此流程的首个候选对象，KOI 1271。",
    "tldr": "使用卷积神经网络和航天器诊断技术，在Kepler数据集中实现了可靠地检测长轨道周期外行星的单次变迁，潜在地发现了新的行星。",
    "en_tdlr": "Utilizing Convolutional Neural Networks and onboard spacecraft diagnostics, reliable single transit detection of long orbital period exoplanets in the Kepler dataset is achieved, potentially leading to the discovery of new planets."
}