{
    "title": "DIALECTBENCH: A NLP Benchmark for Dialects, Varieties, and Closely-Related Languages",
    "abstract": "arXiv:2403.11009v1 Announce Type: cross  Abstract: Language technologies should be judged on their usefulness in real-world use cases. An often overlooked aspect in natural language processing (NLP) research and evaluation is language variation in the form of non-standard dialects or language varieties (hereafter, varieties). Most NLP benchmarks are limited to standard language varieties. To fill this gap, we propose DIALECTBENCH, the first-ever large-scale benchmark for NLP on varieties, which aggregates an extensive set of task-varied variety datasets (10 text-level tasks covering 281 varieties). This allows for a comprehensive evaluation of NLP system performance on different language varieties. We provide substantial evidence of performance disparities between standard and non-standard language varieties, and we also identify language clusters with large performance divergence across tasks. We believe DIALECTBENCH provides a comprehensive view of the current state of NLP for langua",
    "link": "https://arxiv.org/abs/2403.11009",
    "context": "Title: DIALECTBENCH: A NLP Benchmark for Dialects, Varieties, and Closely-Related Languages\nAbstract: arXiv:2403.11009v1 Announce Type: cross  Abstract: Language technologies should be judged on their usefulness in real-world use cases. An often overlooked aspect in natural language processing (NLP) research and evaluation is language variation in the form of non-standard dialects or language varieties (hereafter, varieties). Most NLP benchmarks are limited to standard language varieties. To fill this gap, we propose DIALECTBENCH, the first-ever large-scale benchmark for NLP on varieties, which aggregates an extensive set of task-varied variety datasets (10 text-level tasks covering 281 varieties). This allows for a comprehensive evaluation of NLP system performance on different language varieties. We provide substantial evidence of performance disparities between standard and non-standard language varieties, and we also identify language clusters with large performance divergence across tasks. We believe DIALECTBENCH provides a comprehensive view of the current state of NLP for langua",
    "path": "papers/24/03/2403.11009.json",
    "total_tokens": 910,
    "translated_title": "DIALECTBENCH：一个方言、语言变体和密切相关语言的自然语言处理基准",
    "translated_abstract": "arXiv:2403.11009v1 语种：交叉  摘要：语言技术应该根据其在实际用例中的有用性来判断。在自然语言处理（NLP）研究和评估中经常被忽视的一个方面是非标准方言或语言变体（以下简称为变体）形式的语言变体. 大多数NLP基准测试仅限于标准语言变体。为填补这一空白，我们提出了DIALECTBENCH，这是首个针对语言变体的大规模NLP基准测试，汇总了一系列多样任务样本的变体数据集（涵盖281种变体的10个文本级任务）。这允许对不同语言变体上NLP系统性能进行全面评估。我们提供了大量证据表明标准语言变体与非标准语言变体之间存在性能差距，并且我们还确定了在任务之间存在大量性能差距的语言类群。我们认为DIALECTBENCH提供了对当前语言NLP状态的全面视图。",
    "tldr": "DIALECTBENCH是第一个面向自然语言处理中的方言、语言变体和密切相关语言的大规模基准测试，为实现对不同语言变体上NLP系统性能的全面评估提供了重要工具。",
    "en_tdlr": "DIALECTBENCH is the first large-scale benchmark for dialects, language varieties, and closely-related languages in natural language processing, providing a crucial tool for comprehensive evaluation of NLP system performance on different language varieties."
}