{
    "title": "Unsupervised Spatio-Temporal State Estimation for Fine-grained Adaptive Anomaly Diagnosis of Industrial Cyber-physical Systems",
    "abstract": "arXiv:2403.02616v1 Announce Type: cross  Abstract: Accurate detection and diagnosis of abnormal behaviors such as network attacks from multivariate time series (MTS) are crucial for ensuring the stable and effective operation of industrial cyber-physical systems (CPS). However, existing researches pay little attention to the logical dependencies among system working states, and have difficulties in explaining the evolution mechanisms of abnormal signals. To reveal the spatio-temporal association relationships and evolution mechanisms of the working states of industrial CPS, this paper proposes a fine-grained adaptive anomaly diagnosis method (i.e. MAD-Transformer) to identify and diagnose anomalies in MTS. MAD-Transformer first constructs a temporal state matrix to characterize and estimate the change patterns of the system states in the temporal dimension. Then, to better locate the anomalies, a spatial state matrix is also constructed to capture the inter-sensor state correlation rel",
    "link": "https://arxiv.org/abs/2403.02616",
    "context": "Title: Unsupervised Spatio-Temporal State Estimation for Fine-grained Adaptive Anomaly Diagnosis of Industrial Cyber-physical Systems\nAbstract: arXiv:2403.02616v1 Announce Type: cross  Abstract: Accurate detection and diagnosis of abnormal behaviors such as network attacks from multivariate time series (MTS) are crucial for ensuring the stable and effective operation of industrial cyber-physical systems (CPS). However, existing researches pay little attention to the logical dependencies among system working states, and have difficulties in explaining the evolution mechanisms of abnormal signals. To reveal the spatio-temporal association relationships and evolution mechanisms of the working states of industrial CPS, this paper proposes a fine-grained adaptive anomaly diagnosis method (i.e. MAD-Transformer) to identify and diagnose anomalies in MTS. MAD-Transformer first constructs a temporal state matrix to characterize and estimate the change patterns of the system states in the temporal dimension. Then, to better locate the anomalies, a spatial state matrix is also constructed to capture the inter-sensor state correlation rel",
    "path": "papers/24/03/2403.02616.json",
    "total_tokens": 760,
    "translated_title": "工业物理系统细粒度自适应异常诊断的无监督时空状态估计",
    "translated_abstract": "精确检测和诊断异常行为，如多变量时间序列（MTS）中的网络攻击，对于确保工业物理系统（CPS）的稳定有效运行至关重要。然而，现有研究很少关注系统工作状态之间的逻辑依赖关系，并且难以解释异常信号的演变机制。为了揭示工业CPS工作状态的时空关联关系和演变机制，本文提出了一种细粒度自适应异常诊断方法（即MAD-Transformer），用于识别和诊断MTS中的异常。",
    "tldr": "提出了一种细粒度自适应异常诊断方法（MAD-Transformer），通过构建时间状态矩阵和空间状态矩阵来揭示工业CPS工作状态的时空关联关系和演变机制",
    "en_tdlr": "Proposed a fine-grained adaptive anomaly diagnosis method (MAD-Transformer) to reveal the spatio-temporal association relationships and evolution mechanisms of the working states of industrial CPS by constructing temporal and spatial state matrices."
}