{
    "title": "Soft Reasoning on Uncertain Knowledge Graphs",
    "abstract": "arXiv:2403.01508v1 Announce Type: new  Abstract: The study of machine learning-based logical query-answering enables reasoning with large-scale and incomplete knowledge graphs. This paper further advances this line of research by considering the uncertainty in the knowledge. The uncertain nature of knowledge is widely observed in the real world, but \\textit{does not} align seamlessly with the first-order logic underpinning existing studies. To bridge this gap, we study the setting of soft queries on uncertain knowledge, which is motivated by the establishment of soft constraint programming. We further propose an ML-based approach with both forward inference and backward calibration to answer soft queries on large-scale, incomplete, and uncertain knowledge graphs. Theoretical discussions present that our methods share the same complexity as state-of-the-art inference algorithms for first-order queries. Empirical results justify the superior performance of our approach against previous M",
    "link": "https://arxiv.org/abs/2403.01508",
    "context": "Title: Soft Reasoning on Uncertain Knowledge Graphs\nAbstract: arXiv:2403.01508v1 Announce Type: new  Abstract: The study of machine learning-based logical query-answering enables reasoning with large-scale and incomplete knowledge graphs. This paper further advances this line of research by considering the uncertainty in the knowledge. The uncertain nature of knowledge is widely observed in the real world, but \\textit{does not} align seamlessly with the first-order logic underpinning existing studies. To bridge this gap, we study the setting of soft queries on uncertain knowledge, which is motivated by the establishment of soft constraint programming. We further propose an ML-based approach with both forward inference and backward calibration to answer soft queries on large-scale, incomplete, and uncertain knowledge graphs. Theoretical discussions present that our methods share the same complexity as state-of-the-art inference algorithms for first-order queries. Empirical results justify the superior performance of our approach against previous M",
    "path": "papers/24/03/2403.01508.json",
    "total_tokens": 668,
    "translated_title": "不确定知识图上的软推理",
    "translated_abstract": "通过考虑知识中的不确定性，这项研究进一步推动了基于机器学习的逻辑查询回答的研究。该论文研究了不确定知识上的软查询设置，受软约束编程的建立启发。我们提出了一种基于机器学习的方法，既具有前向推理又具有后向校准，用于回答大规模、不完整和不确定的知识图上的软查询。",
    "tldr": "本文研究了在不确定知识图上进行软查询，并提出了一种基于机器学习的方法，可以有效回答大规模、不完整和不确定的知识图上的查询。",
    "en_tdlr": "This paper explores soft queries on uncertain knowledge graphs and proposes an ML-based approach to effectively answer queries on large-scale, incomplete, and uncertain knowledge graphs."
}