{
    "title": "Chain of Thought Explanation for Dialogue State Tracking",
    "abstract": "arXiv:2403.04656v1 Announce Type: new  Abstract: Dialogue state tracking (DST) aims to record user queries and goals during a conversational interaction achieved by maintaining a prede- fined set of slots and their corresponding values. Current approaches decide slot values opaquely, while humans usually adopt a more deliberate approach by collecting information from relevant dialogue turns and then reasoning the appropriate values. In this work, we focus on the steps needed to figure out slot values by proposing a model named Chain-of-Thought-Explanation (CoTE) for the DST task. CoTE, which is built on the generative DST framework, is designed to create detailed explanations step by step after determining the slot values. This process leads to more accurate and reliable slot values. More-over, to improve the reasoning ability of the CoTE, we further construct more fluent and high-quality explanations with automatic paraphrasing, leading the method CoTE-refined. Experimental results on",
    "link": "https://arxiv.org/abs/2403.04656",
    "context": "Title: Chain of Thought Explanation for Dialogue State Tracking\nAbstract: arXiv:2403.04656v1 Announce Type: new  Abstract: Dialogue state tracking (DST) aims to record user queries and goals during a conversational interaction achieved by maintaining a prede- fined set of slots and their corresponding values. Current approaches decide slot values opaquely, while humans usually adopt a more deliberate approach by collecting information from relevant dialogue turns and then reasoning the appropriate values. In this work, we focus on the steps needed to figure out slot values by proposing a model named Chain-of-Thought-Explanation (CoTE) for the DST task. CoTE, which is built on the generative DST framework, is designed to create detailed explanations step by step after determining the slot values. This process leads to more accurate and reliable slot values. More-over, to improve the reasoning ability of the CoTE, we further construct more fluent and high-quality explanations with automatic paraphrasing, leading the method CoTE-refined. Experimental results on",
    "path": "papers/24/03/2403.04656.json",
    "total_tokens": 844,
    "translated_title": "对话状态跟踪的思维链解释",
    "translated_abstract": "对话状态跟踪(DST)旨在记录用户在会话互动期间提出的查询和目标，通过维护一组预定义的插槽及其对应的值来实现。当前的方法以不透明方式决定插槽值，而人类通常采用更谨慎的方法，从相关的对话轮中收集信息，然后推理出适当的值。在这项工作中，我们聚焦于通过提出一个名为Chain-of-Thought-Explanation（CoTE）的模型，来解决确定插槽值所需的步骤。CoTE建立在生成式DST框架之上，旨在在确定插槽值后逐步创建详细解释。这一过程导致了更准确可靠的插槽值。此外，为了提高CoTE的推理能力，我们进一步通过自动改写构建更流畅高质量的解释，从而形成了CoTE-refined方法。",
    "tldr": "提出了一种名为Chain-of-Thought-Explanation（CoTE）的模型，用于对话状态跟踪(DST)任务，通过逐步创建详细解释来确定插槽值，从而实现更准确可靠的结果。",
    "en_tdlr": "Introduced a model named Chain-of-Thought-Explanation (CoTE) for Dialogue State Tracking (DST) task, which creates detailed explanations step by step to determine slot values, leading to more accurate and reliable outcomes."
}