{
    "title": "ESG Classification by Implicit Rule Learning via GPT-4",
    "abstract": "arXiv:2403.15040v1 Announce Type: new  Abstract: Environmental, social, and governance (ESG) factors are widely adopted as higher investment return indicators. Accordingly, ongoing efforts are being made to automate ESG evaluation with language models to extract signals from massive web text easily. However, recent approaches suffer from a lack of training data, as rating agencies keep their evaluation metrics confidential. This paper investigates whether state-of-the-art language models like GPT-4 can be guided to align with unknown ESG evaluation criteria through strategies such as prompting, chain-of-thought reasoning, and dynamic in-context learning. We demonstrate the efficacy of these approaches by ranking 2nd in the Shared-Task ML-ESG-3 Impact Type track for Korean without updating the model on the provided training data. We also explore how adjusting prompts impacts the ability of language models to address financial tasks leveraging smaller models with openly available weights",
    "link": "https://arxiv.org/abs/2403.15040",
    "context": "Title: ESG Classification by Implicit Rule Learning via GPT-4\nAbstract: arXiv:2403.15040v1 Announce Type: new  Abstract: Environmental, social, and governance (ESG) factors are widely adopted as higher investment return indicators. Accordingly, ongoing efforts are being made to automate ESG evaluation with language models to extract signals from massive web text easily. However, recent approaches suffer from a lack of training data, as rating agencies keep their evaluation metrics confidential. This paper investigates whether state-of-the-art language models like GPT-4 can be guided to align with unknown ESG evaluation criteria through strategies such as prompting, chain-of-thought reasoning, and dynamic in-context learning. We demonstrate the efficacy of these approaches by ranking 2nd in the Shared-Task ML-ESG-3 Impact Type track for Korean without updating the model on the provided training data. We also explore how adjusting prompts impacts the ability of language models to address financial tasks leveraging smaller models with openly available weights",
    "path": "papers/24/03/2403.15040.json",
    "total_tokens": 892,
    "translated_title": "通过GPT-4进行隐式规则学习的ESG分类",
    "translated_abstract": "环境、社会和治理（ESG）因素被广泛采用作为更高投资回报的指标。因此，正在进行持续努力，利用语言模型自动化ESG评估，从海量网络文本中提取信号变得更容易。然而，由于评级机构保密其评估指标，最近的方法饱受缺乏训练数据之苦。本文探讨了当前最先进的语言模型如GPT-4是否可以通过提示、思维链推理和动态上下文学习等策略来引导符合未知ESG评估标准。我们通过在所提供的训练数据上不更新模型，在韩文共享任务ML-ESG-3影响类型跟踪中排名第二，展示了这些方法的有效性。我们还探讨了调整提示如何影响语言模型处理金融任务的能力，利用具有公开可用权重的较小模型。",
    "tldr": "本文研究了如何通过引导最先进的语言模型GPT-4，通过提示、思维链推理和动态上下文学习等策略来与未知的ESG评估标准达成一致，并在韩文共享任务中取得了第二名的成绩。",
    "en_tdlr": "This paper investigates how state-of-the-art language model GPT-4 can be guided to align with unknown ESG evaluation criteria through strategies such as prompting, chain-of-thought reasoning, and dynamic in-context learning, achieving 2nd rank in the Shared-Task ML-ESG-3 Impact Type track for Korean."
}