{
    "title": "An Efficient Learning-based Solver Comparable to Metaheuristics for the Capacitated Arc Routing Problem",
    "abstract": "arXiv:2403.07028v1 Announce Type: cross  Abstract: Recently, neural networks (NN) have made great strides in combinatorial optimization. However, they face challenges when solving the capacitated arc routing problem (CARP) which is to find the minimum-cost tour covering all required edges on a graph, while within capacity constraints. In tackling CARP, NN-based approaches tend to lag behind advanced metaheuristics, since they lack directed arc modeling and efficient learning methods tailored for complex CARP. In this paper, we introduce an NN-based solver to significantly narrow the gap with advanced metaheuristics while exhibiting superior efficiency. First, we propose the direction-aware attention model (DaAM) to incorporate directionality into the embedding process, facilitating more effective one-stage decision-making. Second, we design a supervised reinforcement learning scheme that involves supervised pre-training to establish a robust initial policy for subsequent reinforcement ",
    "link": "https://arxiv.org/abs/2403.07028",
    "context": "Title: An Efficient Learning-based Solver Comparable to Metaheuristics for the Capacitated Arc Routing Problem\nAbstract: arXiv:2403.07028v1 Announce Type: cross  Abstract: Recently, neural networks (NN) have made great strides in combinatorial optimization. However, they face challenges when solving the capacitated arc routing problem (CARP) which is to find the minimum-cost tour covering all required edges on a graph, while within capacity constraints. In tackling CARP, NN-based approaches tend to lag behind advanced metaheuristics, since they lack directed arc modeling and efficient learning methods tailored for complex CARP. In this paper, we introduce an NN-based solver to significantly narrow the gap with advanced metaheuristics while exhibiting superior efficiency. First, we propose the direction-aware attention model (DaAM) to incorporate directionality into the embedding process, facilitating more effective one-stage decision-making. Second, we design a supervised reinforcement learning scheme that involves supervised pre-training to establish a robust initial policy for subsequent reinforcement ",
    "path": "papers/24/03/2403.07028.json",
    "total_tokens": 892,
    "translated_title": "一种与元启发式算法可比的高效学习型解决器，用于容量弧路由问题",
    "translated_abstract": "最近，神经网络（NN）在组合优化方面取得了长足进展。然而，它们在解决容量弧路由问题（CARP）时面临挑战，CARP是指在图上找到覆盖所有必需边的最小成本路径，同时在容量约束内。在解决CARP方面，基于NN的方法往往落后于先进的元启发式算法，因为它们缺乏针对复杂CARP定制的定向弧建模和高效学习方法。在本文中，我们引入了一种基于NN的解决器，以大大缩小与先进元启发式算法之间的差距，同时表现出更高的效率。首先，我们提出了方向感知注意模型（DaAM），将方向性引入嵌入过程，促进更有效的一阶段决策。其次，我们设计了一个监督强化学习方案，涉及监督预训练，为随后的强化学习建立一个强大的初始策略。",
    "tldr": "该论文提出了一种基于神经网络的解决器，通过引入方向感知技术和监督强化学习，显著缩小了与先进元启发式算法的差距，同时表现出优越的效率。"
}