{
    "title": "Evolutionary Algorithms Simulating Molecular Evolution: A New Field Proposal",
    "abstract": "arXiv:2403.08797v1 Announce Type: cross  Abstract: The genetic blueprint for the essential functions of life is encoded in DNA, which is translated into proteins -- the engines driving most of our metabolic processes. Recent advancements in genome sequencing have unveiled a vast diversity of protein families, but compared to the massive search space of all possible amino acid sequences, the set of known functional families is minimal. One could say nature has a limited protein \"vocabulary.\" The major question for computational biologists, therefore, is whether this vocabulary can be expanded to include useful proteins that went extinct long ago, or maybe never evolved in the first place. We outline a computational approach to solving this problem. By merging evolutionary algorithms, machine learning (ML), and bioinformatics, we can facilitate the development of completely novel proteins which have never existed before. We envision this work forming a new sub-field of computational evol",
    "link": "https://arxiv.org/abs/2403.08797",
    "context": "Title: Evolutionary Algorithms Simulating Molecular Evolution: A New Field Proposal\nAbstract: arXiv:2403.08797v1 Announce Type: cross  Abstract: The genetic blueprint for the essential functions of life is encoded in DNA, which is translated into proteins -- the engines driving most of our metabolic processes. Recent advancements in genome sequencing have unveiled a vast diversity of protein families, but compared to the massive search space of all possible amino acid sequences, the set of known functional families is minimal. One could say nature has a limited protein \"vocabulary.\" The major question for computational biologists, therefore, is whether this vocabulary can be expanded to include useful proteins that went extinct long ago, or maybe never evolved in the first place. We outline a computational approach to solving this problem. By merging evolutionary algorithms, machine learning (ML), and bioinformatics, we can facilitate the development of completely novel proteins which have never existed before. We envision this work forming a new sub-field of computational evol",
    "path": "papers/24/03/2403.08797.json",
    "total_tokens": 846,
    "translated_title": "模拟分子进化的进化算法：一个新领域的提议",
    "translated_abstract": "生命活动的基本功能基因蓝图编码在DNA中，转译为蛋白质--推动大多数代谢过程的引擎。最近的基因组测序进展揭示了大量的蛋白质家族，但与所有可能的氨基酸序列的巨大搜索空间相比，已知的功能家族集合很小。一个问题是，自然具有有限的蛋白质“词汇量”。因此，计算生物学家的一个主要问题是，这个词汇量是否可以扩展，以包括很久以前灭绝或者从未在第一次进化中出现的有用蛋白质。我们概述了解决这个问题的计算方法。通过融合进化算法、机器学习（ML）和生物信息学，我们可以促进开发从未存在过的全新蛋白质。我们设想这项工作将形成计算进化的新的子领域。",
    "tldr": "通过融合进化算法、机器学习和生物信息学，提出了一个计算方法来扩展自然蛋白质“词汇量”，以开发从未存在过的全新蛋白质。",
    "en_tdlr": "Proposed a computational approach to expand the limited \"vocabulary\" of natural proteins by merging evolutionary algorithms, machine learning, and bioinformatics to develop completely novel proteins that have never existed before."
}