{
    "title": "Problem space structural adversarial attacks for Network Intrusion Detection Systems based on Graph Neural Networks",
    "abstract": "arXiv:2403.11830v1 Announce Type: cross  Abstract: Machine Learning (ML) algorithms have become increasingly popular for supporting Network Intrusion Detection Systems (NIDS). Nevertheless, extensive research has shown their vulnerability to adversarial attacks, which involve subtle perturbations to the inputs of the models aimed at compromising their performance. Recent proposals have effectively leveraged Graph Neural Networks (GNN) to produce predictions based also on the structural patterns exhibited by intrusions to enhance the detection robustness. However, the adoption of GNN-based NIDS introduces new types of risks. In this paper, we propose the first formalization of adversarial attacks specifically tailored for GNN in network intrusion detection. Moreover, we outline and model the problem space constraints that attackers need to consider to carry out feasible structural attacks in real-world scenarios. As a final contribution, we conduct an extensive experimental campaign in ",
    "link": "https://arxiv.org/abs/2403.11830",
    "context": "Title: Problem space structural adversarial attacks for Network Intrusion Detection Systems based on Graph Neural Networks\nAbstract: arXiv:2403.11830v1 Announce Type: cross  Abstract: Machine Learning (ML) algorithms have become increasingly popular for supporting Network Intrusion Detection Systems (NIDS). Nevertheless, extensive research has shown their vulnerability to adversarial attacks, which involve subtle perturbations to the inputs of the models aimed at compromising their performance. Recent proposals have effectively leveraged Graph Neural Networks (GNN) to produce predictions based also on the structural patterns exhibited by intrusions to enhance the detection robustness. However, the adoption of GNN-based NIDS introduces new types of risks. In this paper, we propose the first formalization of adversarial attacks specifically tailored for GNN in network intrusion detection. Moreover, we outline and model the problem space constraints that attackers need to consider to carry out feasible structural attacks in real-world scenarios. As a final contribution, we conduct an extensive experimental campaign in ",
    "path": "papers/24/03/2403.11830.json",
    "total_tokens": 856,
    "translated_title": "基于图神经网络的网络入侵检测系统的问题空间结构对抗攻击",
    "translated_abstract": "机器学习算法已经越来越受欢迎地用于支持网络入侵检测系统（NIDS）。然而，大量研究已经表明它们对于对抗性攻击的脆弱性，这些攻击涉及对模型输入的微小扰动，旨在危害其性能。最近的提议有效地利用图神经网络（GNN）来产生基于入侵展示的结构模式的预测，以增强检测的稳健性。然而，采用基于GNN的NIDS引入了新类型的风险。本文首次提出了专门针对GNN在网络入侵检测中形成对抗攻击的形式化。此外，我们概述并模拟了攻击者需要考虑的问题空间约束，以在现实场景中执行可行的结构攻击。作为最终贡献，我们进行了广泛的实验活动。",
    "tldr": "本文首次提出了针对基于图神经网络的网络入侵检测系统的形式化对抗攻击，并模拟了攻击者在现实场景中执行可行结构攻击所需考虑的问题空间约束。",
    "en_tdlr": "This paper introduces the first formalization of adversarial attacks tailored for Graph Neural Networks in network intrusion detection, and models the problem space constraints attackers need to consider for feasible structural attacks in real-world scenarios."
}