{
    "title": "Prompt-fused framework for Inductive Logical Query Answering",
    "abstract": "arXiv:2403.12646v1 Announce Type: new  Abstract: Answering logical queries on knowledge graphs (KG) poses a significant challenge for machine reasoning. The primary obstacle in this task stems from the inherent incompleteness of KGs. Existing research has predominantly focused on addressing the issue of missing edges in KGs, thereby neglecting another aspect of incompleteness: the emergence of new entities. Furthermore, most of the existing methods tend to reason over each logical operator separately, rather than comprehensively analyzing the query as a whole during the reasoning process. In this paper, we propose a query-aware prompt-fused framework named Pro-QE, which could incorporate existing query embedding methods and address the embedding of emerging entities through contextual information aggregation. Additionally, a query prompt, which is generated by encoding the symbolic query, is introduced to gather information relevant to the query from a holistic perspective. To evaluate",
    "link": "https://arxiv.org/abs/2403.12646",
    "context": "Title: Prompt-fused framework for Inductive Logical Query Answering\nAbstract: arXiv:2403.12646v1 Announce Type: new  Abstract: Answering logical queries on knowledge graphs (KG) poses a significant challenge for machine reasoning. The primary obstacle in this task stems from the inherent incompleteness of KGs. Existing research has predominantly focused on addressing the issue of missing edges in KGs, thereby neglecting another aspect of incompleteness: the emergence of new entities. Furthermore, most of the existing methods tend to reason over each logical operator separately, rather than comprehensively analyzing the query as a whole during the reasoning process. In this paper, we propose a query-aware prompt-fused framework named Pro-QE, which could incorporate existing query embedding methods and address the embedding of emerging entities through contextual information aggregation. Additionally, a query prompt, which is generated by encoding the symbolic query, is introduced to gather information relevant to the query from a holistic perspective. To evaluate",
    "path": "papers/24/03/2403.12646.json",
    "total_tokens": 807,
    "translated_title": "基于提示融合框架的归纳逻辑查询回答",
    "translated_abstract": "在知识图谱（KG）上回答逻辑查询对机器推理提出了重大挑战，这个任务的主要障碍来自KG的固有不完整性。现有研究主要集中在解决KG中缺失边的问题，从而忽视了另一个不完整性方面：新实体的出现。此外，大部分现有方法倾向于单独对每个逻辑运算符进行推理，而不是在推理过程中全面分析查询作为一个整体。在本文中，我们提出了一个名为Pro-QE的查询感知提示融合框架，它可以整合现有的查询嵌入方法，并通过上下文信息聚合来解决新实体的嵌入。此外，介绍了一个通过编码符号查询生成的查询提示，用于从整体视角收集与查询相关的信息。",
    "tldr": "提出了一种名为Pro-QE的查询感知提示融合框架，能够整合现有查询嵌入方法并通过上下文信息聚合来解决知识图谱中新实体的嵌入问题。",
    "en_tdlr": "Proposed a query-aware prompt-fused framework named Pro-QE, which integrates existing query embedding methods and addresses the embedding of emerging entities in knowledge graphs through contextual information aggregation."
}