{
    "title": "Semi-Supervised Dialogue Abstractive Summarization via High-Quality Pseudolabel Selection",
    "abstract": "arXiv:2403.04073v1 Announce Type: cross  Abstract: Semi-supervised dialogue summarization (SSDS) leverages model-generated summaries to reduce reliance on human-labeled data and improve the performance of summarization models. While addressing label noise, previous works on semi-supervised learning primarily focus on natural language understanding tasks, assuming each sample has a unique label. However, these methods are not directly applicable to SSDS, as it is a generative task, and each dialogue can be summarized in different ways. In this work, we propose a novel scoring approach, SiCF, which encapsulates three primary dimensions of summarization model quality: Semantic invariance (indicative of model confidence), Coverage (factual recall), and Faithfulness (factual precision). Using the SiCF score, we select unlabeled dialogues with high-quality generated summaries to train summarization models. Comprehensive experiments on three public datasets demonstrate the effectiveness of Si",
    "link": "https://arxiv.org/abs/2403.04073",
    "context": "Title: Semi-Supervised Dialogue Abstractive Summarization via High-Quality Pseudolabel Selection\nAbstract: arXiv:2403.04073v1 Announce Type: cross  Abstract: Semi-supervised dialogue summarization (SSDS) leverages model-generated summaries to reduce reliance on human-labeled data and improve the performance of summarization models. While addressing label noise, previous works on semi-supervised learning primarily focus on natural language understanding tasks, assuming each sample has a unique label. However, these methods are not directly applicable to SSDS, as it is a generative task, and each dialogue can be summarized in different ways. In this work, we propose a novel scoring approach, SiCF, which encapsulates three primary dimensions of summarization model quality: Semantic invariance (indicative of model confidence), Coverage (factual recall), and Faithfulness (factual precision). Using the SiCF score, we select unlabeled dialogues with high-quality generated summaries to train summarization models. Comprehensive experiments on three public datasets demonstrate the effectiveness of Si",
    "path": "papers/24/03/2403.04073.json",
    "total_tokens": 727,
    "translated_title": "通过高质量伪标签选择的半监督对话抽取式摘要生成",
    "translated_abstract": "半监督对话摘要生成（SSDS）利用模型生成的摘要减少对人工标记数据的依赖，提高摘要生成模型的性能。本文提出了一种新颖的评分方法 SiCF，包含了摘要模型质量的三个主要维度：语义不变性（模型信心的指示）、覆盖度（事实召回）和忠实度（事实精度）。利用 SiCF 分数，选择具有高质量生成摘要的无标签对话来训练摘要生成模型。",
    "tldr": "提出了一种新的高质量伪标签选择方法 SiCF，通过该方法选择具有高质量生成摘要的无标签对话来进行半监督对话抽取式摘要生成。"
}