{
    "title": "Emergent communication and learning pressures in language models: a language evolution perspective",
    "abstract": "arXiv:2403.14427v1 Announce Type: new  Abstract: Language models and humans are two types of learning systems. Finding or facilitating commonalities could enable major breakthroughs in our understanding of the acquisition and evolution of language. Many theories of language evolution rely heavily on learning biases and learning pressures. Yet due to substantial differences in learning pressures, it is questionable whether the similarity between humans and machines is sufficient for insights to carry over and to be worth testing with human participants. Here, we review the emergent communication literature, a subfield of multi-agent reinforcement learning, from a language evolution perspective. We find that the emergent communication literature excels at designing and adapting models to recover initially absent linguistic phenomena of natural languages. Based on a short literature review, we identify key pressures that have recovered initially absent human patterns in emergent communica",
    "link": "https://arxiv.org/abs/2403.14427",
    "context": "Title: Emergent communication and learning pressures in language models: a language evolution perspective\nAbstract: arXiv:2403.14427v1 Announce Type: new  Abstract: Language models and humans are two types of learning systems. Finding or facilitating commonalities could enable major breakthroughs in our understanding of the acquisition and evolution of language. Many theories of language evolution rely heavily on learning biases and learning pressures. Yet due to substantial differences in learning pressures, it is questionable whether the similarity between humans and machines is sufficient for insights to carry over and to be worth testing with human participants. Here, we review the emergent communication literature, a subfield of multi-agent reinforcement learning, from a language evolution perspective. We find that the emergent communication literature excels at designing and adapting models to recover initially absent linguistic phenomena of natural languages. Based on a short literature review, we identify key pressures that have recovered initially absent human patterns in emergent communica",
    "path": "papers/24/03/2403.14427.json",
    "total_tokens": 886,
    "translated_title": "语言模型中的紧急沟通和学习压力：语言进化视角",
    "translated_abstract": "语言模型和人类是两种学习系统。发现或促进二者之间的共同点可能会在我们理解语言的习得和演化方面取得重大突破。许多语言进化理论在很大程度上依赖于学习偏好和学习压力。然而，由于学习压力存在着重大差异，对于人类和机器之间的相似性是否足以启发洞见并值得与人类参与者一起进行测试是值得怀疑的。本文从语言进化的角度审视了新兴沟通文献，这是多智能体强化学习的一个子领域。我们发现，新兴沟通文献在设计和调整模型以恢复自然语言的最初不显现的语言现象方面有杰出表现。根据对文献的简要回顾，我们确定了一些在新兴沟通中恢复最初不显现的人类模式的关键压力。",
    "tldr": "从语言进化的角度研究了新兴沟通文献，发现其在设计和调整模型以恢复自然语言中初始缺失的语言现象方面表现优秀，揭示了关键压力促使恢复最初不显现的人类模式。",
    "en_tdlr": "Explored emergent communication literature from a language evolution perspective, highlighting its excellence in designing models to recover initially absent linguistic phenomena of natural languages and identifying key pressures that have restored initially absent human patterns in emergent communication."
}