{
    "title": "Machine learning predicts long-term mortality after acute myocardial infarction using systolic time intervals and routinely collected clinical data",
    "abstract": "arXiv:2403.01533v1 Announce Type: cross  Abstract: Precise estimation of cardiac patients' current and future comorbidities is an important factor in prioritizing continuous physiological monitoring and new therapies. ML models have shown satisfactory performance in short-term mortality prediction of patients with heart disease, while their utility in long-term predictions is limited. This study aims to investigate the performance of tree-based ML models on long-term mortality prediction and the effect of two recently introduced biomarkers on long-term mortality. This study utilized publicly available data from CCHIA at the Ministry of Health and Welfare, Taiwan, China. Medical records were used to gather demographic and clinical data, including age, gender, BMI, percutaneous coronary intervention (PCI) status, and comorbidities such as hypertension, dyslipidemia, ST-segment elevation myocardial infarction (STEMI), and non-STEMI. Using medical and demographic records as well as two rec",
    "link": "https://arxiv.org/abs/2403.01533",
    "context": "Title: Machine learning predicts long-term mortality after acute myocardial infarction using systolic time intervals and routinely collected clinical data\nAbstract: arXiv:2403.01533v1 Announce Type: cross  Abstract: Precise estimation of cardiac patients' current and future comorbidities is an important factor in prioritizing continuous physiological monitoring and new therapies. ML models have shown satisfactory performance in short-term mortality prediction of patients with heart disease, while their utility in long-term predictions is limited. This study aims to investigate the performance of tree-based ML models on long-term mortality prediction and the effect of two recently introduced biomarkers on long-term mortality. This study utilized publicly available data from CCHIA at the Ministry of Health and Welfare, Taiwan, China. Medical records were used to gather demographic and clinical data, including age, gender, BMI, percutaneous coronary intervention (PCI) status, and comorbidities such as hypertension, dyslipidemia, ST-segment elevation myocardial infarction (STEMI), and non-STEMI. Using medical and demographic records as well as two rec",
    "path": "papers/24/03/2403.01533.json",
    "total_tokens": 904,
    "translated_title": "机器学习利用收缩时间间隔和日常收集的临床数据预测急性心肌梗死后的长期死亡率",
    "translated_abstract": "精确估计心脏患者当前和未来的合并症是优先考虑连续生理监测和新疗法的重要因素。机器学习模型在预测患有心脏病的患者短期死亡率方面表现良好，但在长期预测方面的效用有限。本研究旨在研究基于树的机器学习模型在长期死亡率预测上的性能，以及两个最近引入的生物标志物对长期死亡率的影响。本研究利用了台湾中国卫生福利部CCHIA的公开可用数据。医疗记录用于收集包括年龄、性别、BMI、经皮冠状动脉介入（PCI）状态和高血压、血脂异常、ST段抬高型心肌梗死（STEMI）和非STEMI等合并症在内的人口统计学和临床数据。",
    "tldr": "该研究利用机器学习模型和新生物标志物探索长期死亡率预测，为心脏病患者提供更准确的医疗决策支持。",
    "en_tdlr": "This study explores long-term mortality prediction using machine learning models and new biomarkers, providing more accurate medical decision support for patients with heart disease."
}