{
    "title": "Supporting Energy Policy Research with Large Language Models",
    "abstract": "arXiv:2403.12924v1 Announce Type: new  Abstract: The recent growth in renewable energy development in the United States has been accompanied by a simultaneous surge in renewable energy siting ordinances. These zoning laws play a critical role in dictating the placement of wind and solar resources that are critical for achieving low-carbon energy futures. In this context, efficient access to and management of siting ordinance data becomes imperative. The National Renewable Energy Laboratory (NREL) recently introduced a public wind and solar siting database to fill this need. This paper presents a method for harnessing Large Language Models (LLMs) to automate the extraction of these siting ordinances from legal documents, enabling this database to maintain accurate up-to-date information in the rapidly changing energy policy landscape. A novel contribution of this research is the integration of a decision tree framework with LLMs. Our results show that this approach is 85 to 90% accurate",
    "link": "https://arxiv.org/abs/2403.12924",
    "context": "Title: Supporting Energy Policy Research with Large Language Models\nAbstract: arXiv:2403.12924v1 Announce Type: new  Abstract: The recent growth in renewable energy development in the United States has been accompanied by a simultaneous surge in renewable energy siting ordinances. These zoning laws play a critical role in dictating the placement of wind and solar resources that are critical for achieving low-carbon energy futures. In this context, efficient access to and management of siting ordinance data becomes imperative. The National Renewable Energy Laboratory (NREL) recently introduced a public wind and solar siting database to fill this need. This paper presents a method for harnessing Large Language Models (LLMs) to automate the extraction of these siting ordinances from legal documents, enabling this database to maintain accurate up-to-date information in the rapidly changing energy policy landscape. A novel contribution of this research is the integration of a decision tree framework with LLMs. Our results show that this approach is 85 to 90% accurate",
    "path": "papers/24/03/2403.12924.json",
    "total_tokens": 840,
    "translated_title": "用大型语言模型支持能源政策研究",
    "translated_abstract": "美国可再生能源开发的最近增长伴随着可再生能源用地条例的同时激增。这些区位法规在规定对于实现低碳能源未来至关重要的风能和太阳能资源的摆放方面发挥着关键作用。在这种背景下，有效访问和管理用地法规数据变得至关重要。美国国家可再生能源实验室（NREL）最近推出了一个公开的风能和太阳能选址数据库，以满足这一需求。本文提出了一种利用大型语言模型（LLMs）自动提取这些选址法规的方法，使得该数据库能够在快速变化的能源政策格局中保持准确的最新信息。这项研究的一个新颖成果是将决策树框架与LLMs集成。我们的结果表明，这种方法的准确率达到了85%至90%。",
    "tldr": "本研究的创新贡献在于将决策树框架与大型语言模型集成，从而实现了自动提取法规的准确性达到85%至90%。",
    "en_tdlr": "The novel contribution of this research is the integration of a decision tree framework with Large Language Models (LLMs), resulting in an accuracy of 85% to 90% in automating the extraction of ordinances."
}