{
    "title": "Language Evolution with Deep Learning",
    "abstract": "arXiv:2403.11958v1 Announce Type: new  Abstract: Computational modeling plays an essential role in the study of language emergence. It aims to simulate the conditions and learning processes that could trigger the emergence of a structured language within a simulated controlled environment. Several methods have been used to investigate the origin of our language, including agent-based systems, Bayesian agents, genetic algorithms, and rule-based systems. This chapter explores another class of computational models that have recently revolutionized the field of machine learning: deep learning models. The chapter introduces the basic concepts of deep and reinforcement learning methods and summarizes their helpfulness for simulating language emergence. It also discusses the key findings, limitations, and recent attempts to build realistic simulations. This chapter targets linguists and cognitive scientists seeking an introduction to deep learning as a tool to investigate language evolution.",
    "link": "https://arxiv.org/abs/2403.11958",
    "context": "Title: Language Evolution with Deep Learning\nAbstract: arXiv:2403.11958v1 Announce Type: new  Abstract: Computational modeling plays an essential role in the study of language emergence. It aims to simulate the conditions and learning processes that could trigger the emergence of a structured language within a simulated controlled environment. Several methods have been used to investigate the origin of our language, including agent-based systems, Bayesian agents, genetic algorithms, and rule-based systems. This chapter explores another class of computational models that have recently revolutionized the field of machine learning: deep learning models. The chapter introduces the basic concepts of deep and reinforcement learning methods and summarizes their helpfulness for simulating language emergence. It also discusses the key findings, limitations, and recent attempts to build realistic simulations. This chapter targets linguists and cognitive scientists seeking an introduction to deep learning as a tool to investigate language evolution.",
    "path": "papers/24/03/2403.11958.json",
    "total_tokens": 763,
    "translated_title": "基于深度学习的语言演化",
    "translated_abstract": "计算建模在语言演化研究中起着至关重要的作用，旨在模拟触发结构化语言在受控环境中出现的条件和学习过程。本章探讨了另一类计算模型——深度学习模型，这些模型最近在机器学习领域引起了革命。本章介绍了深度学习和强化学习方法的基本概念，并总结了它们在模拟语言演化方面的帮助。还讨论了关键发现、局限性和最近尝试构建逼真模拟的工作。本章主要面向寻求将深度学习作为研究语言演化的工具的语言学家和认知科学家。",
    "tldr": "通过深度学习模型，本研究探讨了语言演化的计算模拟，以及其对于模拟语言演化的帮助和局限性，适用于语言学家和认知科学家。",
    "en_tdlr": "This study explores computational simulations of language evolution using deep learning models, discussing their assistance and limitations in simulating language emergence, and targeting linguists and cognitive scientists."
}