{
    "title": "Unsupervised Graph Neural Architecture Search with Disentangled Self-supervision",
    "abstract": "arXiv:2403.05064v1 Announce Type: cross  Abstract: The existing graph neural architecture search (GNAS) methods heavily rely on supervised labels during the search process, failing to handle ubiquitous scenarios where supervisions are not available. In this paper, we study the problem of unsupervised graph neural architecture search, which remains unexplored in the literature. The key problem is to discover the latent graph factors that drive the formation of graph data as well as the underlying relations between the factors and the optimal neural architectures. Handling this problem is challenging given that the latent graph factors together with architectures are highly entangled due to the nature of the graph and the complexity of the neural architecture search process. To address the challenge, we propose a novel Disentangled Self-supervised Graph Neural Architecture Search (DSGAS) model, which is able to discover the optimal architectures capturing various latent graph factors in ",
    "link": "https://arxiv.org/abs/2403.05064",
    "context": "Title: Unsupervised Graph Neural Architecture Search with Disentangled Self-supervision\nAbstract: arXiv:2403.05064v1 Announce Type: cross  Abstract: The existing graph neural architecture search (GNAS) methods heavily rely on supervised labels during the search process, failing to handle ubiquitous scenarios where supervisions are not available. In this paper, we study the problem of unsupervised graph neural architecture search, which remains unexplored in the literature. The key problem is to discover the latent graph factors that drive the formation of graph data as well as the underlying relations between the factors and the optimal neural architectures. Handling this problem is challenging given that the latent graph factors together with architectures are highly entangled due to the nature of the graph and the complexity of the neural architecture search process. To address the challenge, we propose a novel Disentangled Self-supervised Graph Neural Architecture Search (DSGAS) model, which is able to discover the optimal architectures capturing various latent graph factors in ",
    "path": "papers/24/03/2403.05064.json",
    "total_tokens": 783,
    "translated_title": "无监督图神经架构搜索与解耦自监督",
    "translated_abstract": "现有的图神经架构搜索方法在搜索过程中严重依赖监督标签，无法处理监督不可用的普遍情况。本文研究了无监督图神经架构搜索问题，在文献中尚未探索。关键问题是发现驱动图数据形成以及潜在关系的潜在图因素与最优神经架构之间的关系。由于图的性质和神经架构搜索过程的复杂性，这一问题很具挑战性。为了解决这一挑战，我们提出了一种新颖的解耦自监督图神经架构搜索（DSGAS）模型，能够发现捕获各种潜在图因素的最佳架构",
    "tldr": "提出了一种新颖的解耦自监督图神经架构搜索（DSGAS）模型，能够发现捕获各种潜在图因素的最佳架构",
    "en_tdlr": "Proposed a novel Disentangled Self-supervised Graph Neural Architecture Search (DSGAS) model, which is able to discover the optimal architectures capturing various latent graph factors."
}