{
    "title": "Time-bound Contextual Bio-ID Generation for Minimalist Wearables",
    "abstract": "arXiv:2403.00889v1 Announce Type: cross  Abstract: As wearable devices become increasingly miniaturized and powerful, a new opportunity arises for instant and dynamic device-to-device collaboration and human-to-device interaction. However, this progress presents a unique challenge: these minimalist wearables lack inherent mechanisms for real-time authentication, posing significant risks to data privacy and overall security. To address this, we introduce Proteus that realizes an innovative concept of time-bound contextual bio-IDs, which are generated from on-device sensor data and embedded into a common latent space. These bio-IDs act as a time-bound unique user identifier that can be used to identify the wearer in a certain context. Proteus enables dynamic and contextual device collaboration as well as robust human-to-device interaction. Our evaluations demonstrate the effectiveness of our method, particularly in the context of minimalist wearables.",
    "link": "https://arxiv.org/abs/2403.00889",
    "context": "Title: Time-bound Contextual Bio-ID Generation for Minimalist Wearables\nAbstract: arXiv:2403.00889v1 Announce Type: cross  Abstract: As wearable devices become increasingly miniaturized and powerful, a new opportunity arises for instant and dynamic device-to-device collaboration and human-to-device interaction. However, this progress presents a unique challenge: these minimalist wearables lack inherent mechanisms for real-time authentication, posing significant risks to data privacy and overall security. To address this, we introduce Proteus that realizes an innovative concept of time-bound contextual bio-IDs, which are generated from on-device sensor data and embedded into a common latent space. These bio-IDs act as a time-bound unique user identifier that can be used to identify the wearer in a certain context. Proteus enables dynamic and contextual device collaboration as well as robust human-to-device interaction. Our evaluations demonstrate the effectiveness of our method, particularly in the context of minimalist wearables.",
    "path": "papers/24/03/2403.00889.json",
    "total_tokens": 857,
    "translated_title": "面向极简可穿戴设备的时限上下文生物身份生成",
    "translated_abstract": "随着可穿戴设备越来越小型化和强大，即时动态的设备对设备协作和人对设备交互的新机遇应运而生。然而，这一进展带来了独特的挑战：这些极简可穿戴设备缺乏实时身份验证机制，给数据隐私和整体安全带来了重大风险。为了解决这一问题，我们介绍了Proteus，实现了一种创新的时限上下文生物身份概念，这些生物身份是从设备传感器数据生成并嵌入到一个共同的潜在空间中。这些生物身份充当着时限的独特用户标识符，在特定上下文中用于识别佩戴者。Proteus实现了动态的上下文设备协作以及强大的人对设备交互。我们的评估证明了我们的方法的有效性，尤其在极简可穿戴设备的背景下。",
    "tldr": "提出了一种名为Proteus的创新概念，实现了时限上下文生物身份的生成，可以有效解决极简可穿戴设备的实时认证挑战，促进设备协作和用户交互。",
    "en_tdlr": "Introduced Proteus, a novel concept enabling the generation of time-bound contextual bio-IDs to address real-time authentication challenge in minimalist wearables, facilitating device collaboration and human interaction."
}