{
    "title": "Understanding Archives: Towards New Research Interfaces Relying on the Semantic Annotation of Documents",
    "abstract": "arXiv:2403.19201v1 Announce Type: cross  Abstract: The digitisation campaigns carried out by libraries and archives in recent years have facilitated access to documents in their collections. However, exploring and exploiting these documents remain difficult tasks due to the sheer quantity of documents available for consultation. In this article, we show how the semantic annotation of the textual content of study corpora of archival documents allow to facilitate their exploitation and valorisation. First, we present a methodological framework for the construction of new interfaces based on textual semantics, then address the current technological obstacles and their potential solutions. We conclude by presenting a practical case of the application of this framework.",
    "link": "https://arxiv.org/abs/2403.19201",
    "context": "Title: Understanding Archives: Towards New Research Interfaces Relying on the Semantic Annotation of Documents\nAbstract: arXiv:2403.19201v1 Announce Type: cross  Abstract: The digitisation campaigns carried out by libraries and archives in recent years have facilitated access to documents in their collections. However, exploring and exploiting these documents remain difficult tasks due to the sheer quantity of documents available for consultation. In this article, we show how the semantic annotation of the textual content of study corpora of archival documents allow to facilitate their exploitation and valorisation. First, we present a methodological framework for the construction of new interfaces based on textual semantics, then address the current technological obstacles and their potential solutions. We conclude by presenting a practical case of the application of this framework.",
    "path": "papers/24/03/2403.19201.json",
    "total_tokens": 723,
    "translated_title": "理解档案：基于文档语义标注的新研究界面",
    "translated_abstract": "近年来图书馆和档案馆进行的数字化活动促进了对其收藏文档的访问。然而，由于可供查阅的文档数量庞大，探索和利用这些文档仍然是困难的任务。在本文中，我们展示了如何通过对档案文件研究语料库的文本内容进行语义标注来促进其利用和价值。首先，我们提出了一个基于文本语义构建新界面的方法论框架，然后讨论当前的技术障碍及其潜在解决方案。最后，我们通过展示该框架的应用实例来总结。",
    "tldr": "通过语义标注档案文件的文本内容，我们提出了构建新界面的方法论框架，解决了探索和利用文档的困难，以及应对当前技术障碍的潜在解决方案。",
    "en_tdlr": "By semantically annotating the textual content of archival documents, we propose a methodological framework for constructing new interfaces, addressing the difficulty in exploring and exploiting documents, as well as potential solutions to current technological obstacles."
}