{
    "title": "Particle identification with machine learning from incomplete data in the ALICE experiment",
    "abstract": "arXiv:2403.17436v1 Announce Type: cross  Abstract: The ALICE experiment at the LHC measures properties of the strongly interacting matter formed in ultrarelativistic heavy-ion collisions. Such studies require accurate particle identification (PID). ALICE provides PID information via several detectors for particles with momentum from about 100 MeV/c up to 20 GeV/c. Traditionally, particles are selected with rectangular cuts. Acmuch better performance can be achieved with machine learning (ML) methods. Our solution uses multiple neural networks (NN) serving as binary classifiers. Moreover, we extended our particle classifier with Feature Set Embedding and attention in order to train on data with incomplete samples. We also present the integration of the ML project with the ALICE analysis software, and we discuss domain adaptation, the ML technique needed to transfer the knowledge between simulated and real experimental data.",
    "link": "https://arxiv.org/abs/2403.17436",
    "context": "Title: Particle identification with machine learning from incomplete data in the ALICE experiment\nAbstract: arXiv:2403.17436v1 Announce Type: cross  Abstract: The ALICE experiment at the LHC measures properties of the strongly interacting matter formed in ultrarelativistic heavy-ion collisions. Such studies require accurate particle identification (PID). ALICE provides PID information via several detectors for particles with momentum from about 100 MeV/c up to 20 GeV/c. Traditionally, particles are selected with rectangular cuts. Acmuch better performance can be achieved with machine learning (ML) methods. Our solution uses multiple neural networks (NN) serving as binary classifiers. Moreover, we extended our particle classifier with Feature Set Embedding and attention in order to train on data with incomplete samples. We also present the integration of the ML project with the ALICE analysis software, and we discuss domain adaptation, the ML technique needed to transfer the knowledge between simulated and real experimental data.",
    "path": "papers/24/03/2403.17436.json",
    "total_tokens": 856,
    "translated_title": "在ALICE实验中利用机器学习从不完整数据中进行粒子识别",
    "translated_abstract": "LHC的ALICE实验测量在超相对论重离子对撞中形成的强相互作用物质的性质。这些研究需要准确的粒子识别(PID)。ALICE通过几个探测器为动量从约100 MeV/c到20 GeV/c的粒子提供PID信息。传统上，粒子是通过矩形切割进行选择的。利用机器学习(ML)方法可以实现更好的性能。我们的解决方案使用多个神经网络(NN)作为二进制分类器。此外，我们通过特征集嵌入和关注扩展了粒子分类器，以便对包含不完整样本的数据进行训练。我们还介绍了ML项目与ALICE分析软件的集成，并讨论了域自适应，这是将知识从模拟数据转移到实际实验数据所需的ML技术。",
    "tldr": "在ALICE实验中，我们利用机器学习方法和多神经网络进行粒子识别，包括特征集嵌入和注意力机制，以在不完整数据样本上进行训练，并将ML项目与ALICE分析软件集成，讨论了域自适应技术。",
    "en_tdlr": "In the ALICE experiment, particle identification is improved using machine learning and multiple neural networks, incorporating feature set embedding and attention mechanisms for training on incomplete data samples, integrating the ML project with ALICE analysis software, and discussing domain adaptation techniques."
}