{
    "title": "AZ-NAS: Assembling Zero-Cost Proxies for Network Architecture Search",
    "abstract": "arXiv:2403.19232v1 Announce Type: cross  Abstract: Training-free network architecture search (NAS) aims to discover high-performing networks with zero-cost proxies, capturing network characteristics related to the final performance. However, network rankings estimated by previous training-free NAS methods have shown weak correlations with the performance. To address this issue, we propose AZ-NAS, a novel approach that leverages the ensemble of various zero-cost proxies to enhance the correlation between a predicted ranking of networks and the ground truth substantially in terms of the performance. To achieve this, we introduce four novel zero-cost proxies that are complementary to each other, analyzing distinct traits of architectures in the views of expressivity, progressivity, trainability, and complexity. The proxy scores can be obtained simultaneously within a single forward and backward pass, making an overall NAS process highly efficient. In order to integrate the rankings predic",
    "link": "https://arxiv.org/abs/2403.19232",
    "context": "Title: AZ-NAS: Assembling Zero-Cost Proxies for Network Architecture Search\nAbstract: arXiv:2403.19232v1 Announce Type: cross  Abstract: Training-free network architecture search (NAS) aims to discover high-performing networks with zero-cost proxies, capturing network characteristics related to the final performance. However, network rankings estimated by previous training-free NAS methods have shown weak correlations with the performance. To address this issue, we propose AZ-NAS, a novel approach that leverages the ensemble of various zero-cost proxies to enhance the correlation between a predicted ranking of networks and the ground truth substantially in terms of the performance. To achieve this, we introduce four novel zero-cost proxies that are complementary to each other, analyzing distinct traits of architectures in the views of expressivity, progressivity, trainability, and complexity. The proxy scores can be obtained simultaneously within a single forward and backward pass, making an overall NAS process highly efficient. In order to integrate the rankings predic",
    "path": "papers/24/03/2403.19232.json",
    "total_tokens": 816,
    "translated_title": "AZ-NAS: 针对网络架构搜索的零成本代理组装",
    "translated_abstract": "训练免费的网络架构搜索（NAS）旨在发现具有零成本代理的表现优异的网络，捕获与最终性能相关的网络特征。然而，先前训练免费的NAS方法估计的网络排名与性能之间的相关性较弱。为解决此问题，我们提出了AZ-NAS，一种新方法，利用各种零成本代理的集合来显著增强预测的网络排名与性能地面实况之间的相关性。为了实现这一点，我们引入了四种新的零成本代理，这些代理在表达性、进步性、可训练性和复杂性等方面相辅相成，分析了架构的不同特征。代理评分可以在单次前向和后向传递中同时获得，使整个NAS过程极其高效。",
    "tldr": "AZ-NAS提出了一种新方法，通过集合各种零成本代理来增强网络排名与性能之间的相关性，在表达性、进步性、可训练性和复杂性等方面进行了分析。"
}