{
    "title": "MedBN: Robust Test-Time Adaptation against Malicious Test Samples",
    "abstract": "arXiv:2403.19326v1 Announce Type: new  Abstract: Test-time adaptation (TTA) has emerged as a promising solution to address performance decay due to unforeseen distribution shifts between training and test data. While recent TTA methods excel in adapting to test data variations, such adaptability exposes a model to vulnerability against malicious examples, an aspect that has received limited attention. Previous studies have uncovered security vulnerabilities within TTA even when a small proportion of the test batch is maliciously manipulated. In response to the emerging threat, we propose median batch normalization (MedBN), leveraging the robustness of the median for statistics estimation within the batch normalization layer during test-time inference. Our method is algorithm-agnostic, thus allowing seamless integration with existing TTA frameworks. Our experimental results on benchmark datasets, including CIFAR10-C, CIFAR100-C and ImageNet-C, consistently demonstrate that MedBN outperf",
    "link": "https://arxiv.org/abs/2403.19326",
    "context": "Title: MedBN: Robust Test-Time Adaptation against Malicious Test Samples\nAbstract: arXiv:2403.19326v1 Announce Type: new  Abstract: Test-time adaptation (TTA) has emerged as a promising solution to address performance decay due to unforeseen distribution shifts between training and test data. While recent TTA methods excel in adapting to test data variations, such adaptability exposes a model to vulnerability against malicious examples, an aspect that has received limited attention. Previous studies have uncovered security vulnerabilities within TTA even when a small proportion of the test batch is maliciously manipulated. In response to the emerging threat, we propose median batch normalization (MedBN), leveraging the robustness of the median for statistics estimation within the batch normalization layer during test-time inference. Our method is algorithm-agnostic, thus allowing seamless integration with existing TTA frameworks. Our experimental results on benchmark datasets, including CIFAR10-C, CIFAR100-C and ImageNet-C, consistently demonstrate that MedBN outperf",
    "path": "papers/24/03/2403.19326.json",
    "total_tokens": 885,
    "translated_title": "MedBN: 针对恶意测试样本的鲁棒测试时间适应",
    "translated_abstract": "Test-time adaptation (TTA)已经成为解决由于训练和测试数据之间未预料到的分布转移而导致性能下降的一个有希望的解决方案。虽然最近的TTA方法在适应于测试数据的变化方面表现出色，但这种适应性使模型暴露于恶意示例的攻击中，这一方面受到了有限的关注。之前的研究已经发现，即使测试批次的一小部分受到恶意篡改，也会暴露出TTA中的安全漏洞。作为对新兴威胁的回应，我们提出了中值批次归一化（MedBN），利用了中值对在测试时间推断期间批次归一化层内的统计估计的稳健性。我们的方法是算法不可知的，因此可以与现有的TTA框架无缝集成。我们在基准数据集，包括CIFAR10-C、CIFAR100-C和ImageNet-C上的实验结果一致表明，MedBN性能优越",
    "tldr": "MedBN是一种针对恶意测试样本的新方法，利用中值批次归一化（MedBN）在测试时间推断期间保护模型免受攻击，并成功集成到现有的TTA框架中。"
}