{
    "title": "A Decade of Privacy-Relevant Android App Reviews: Large Scale Trends",
    "abstract": "arXiv:2403.02292v1 Announce Type: new  Abstract: We present an analysis of 12 million instances of privacy-relevant reviews publicly visible on the Google Play Store that span a 10 year period. By leveraging state of the art NLP techniques, we can examine what users have been writing about privacy along multiple dimensions: time, countries, app types, diverse privacy topics, and even across a spectrum of emotions. We find consistent growth of privacy-relevant reviews, and explore topics that are trending (such as Data Deletion and Data Theft), as well as those on the decline (such as privacy-relevant reviews on sensitive permissions). We find that although privacy reviews come from more than 200 countries, 33 countries provide 90% of privacy reviews. We conduct a comparison across countries by examining the distribution of privacy topics a country's users write about, and find that geographic proximity is not a reliable indicator that nearby countries have similar privacy perspectives.",
    "link": "https://arxiv.org/abs/2403.02292",
    "context": "Title: A Decade of Privacy-Relevant Android App Reviews: Large Scale Trends\nAbstract: arXiv:2403.02292v1 Announce Type: new  Abstract: We present an analysis of 12 million instances of privacy-relevant reviews publicly visible on the Google Play Store that span a 10 year period. By leveraging state of the art NLP techniques, we can examine what users have been writing about privacy along multiple dimensions: time, countries, app types, diverse privacy topics, and even across a spectrum of emotions. We find consistent growth of privacy-relevant reviews, and explore topics that are trending (such as Data Deletion and Data Theft), as well as those on the decline (such as privacy-relevant reviews on sensitive permissions). We find that although privacy reviews come from more than 200 countries, 33 countries provide 90% of privacy reviews. We conduct a comparison across countries by examining the distribution of privacy topics a country's users write about, and find that geographic proximity is not a reliable indicator that nearby countries have similar privacy perspectives.",
    "path": "papers/24/03/2403.02292.json",
    "total_tokens": 873,
    "translated_title": "Android应用隐私相关评论的十年大规模趋势分析",
    "translated_abstract": "我们展示了对谷歌应用商店上1200万条隐私相关评论的分析结果，这些评论跨越了10年时间。通过应用最先进的自然语言处理技术，我们能够在时间、国家、应用类型、不同隐私主题以及多种情感维度上检视用户对隐私问题的看法。我们发现隐私相关评论持续增长，并探究了一些热门话题（如数据删除和数据窃取），以及一些逐渐减少的话题（如涉及敏感权限的隐私相关评论）。尽管隐私评论来自200多个国家，但有33个国家提供了90%的隐私评论。我们通过检查每个国家用户评论的隐私主题分布来进行跨国家比较，发现地理接近并不意味着附近国家有类似的隐私观点。",
    "tldr": "通过分析谷歌应用商店上1200万条隐私相关评论，研究了十年间隐私评论的大规模趋势，发现隐私评论呈现持续增长，探讨了热门和逐渐减少的隐私话题，以及不同国家用户对隐私问题看法的差异。",
    "en_tdlr": "Analyzing 12 million instances of privacy-relevant reviews on Google Play Store over a decade, this study reveals the continuous growth of privacy reviews, explores trending and declining privacy topics, and variations in privacy perspectives among users from different countries."
}