{
    "title": "Offensive Lineup Analysis in Basketball with Clustering Players Based on Shooting Style and Offensive Role",
    "abstract": "arXiv:2403.13821v1 Announce Type: new  Abstract: In a basketball game, scoring efficiency holds significant importance due to the numerous offensive possessions per game. Enhancing scoring efficiency necessitates effective collaboration among players with diverse playing styles. In previous studies, basketball lineups have been analyzed, but their playing style compatibility has not been quantitatively examined. The purpose of this study is to analyze more specifically the impact of playing style compatibility on scoring efficiency, focusing only on offense. This study employs two methods to capture the playing styles of players on offense: shooting style clustering using tracking data, and offensive role clustering based on annotated playtypes and advanced statistics. For the former, interpretable hand-crafted shot features and Wasserstein distances between shooting style distributions were utilized. For the latter, soft clustering was applied to playtype data for the first time. Subs",
    "link": "https://arxiv.org/abs/2403.13821",
    "context": "Title: Offensive Lineup Analysis in Basketball with Clustering Players Based on Shooting Style and Offensive Role\nAbstract: arXiv:2403.13821v1 Announce Type: new  Abstract: In a basketball game, scoring efficiency holds significant importance due to the numerous offensive possessions per game. Enhancing scoring efficiency necessitates effective collaboration among players with diverse playing styles. In previous studies, basketball lineups have been analyzed, but their playing style compatibility has not been quantitatively examined. The purpose of this study is to analyze more specifically the impact of playing style compatibility on scoring efficiency, focusing only on offense. This study employs two methods to capture the playing styles of players on offense: shooting style clustering using tracking data, and offensive role clustering based on annotated playtypes and advanced statistics. For the former, interpretable hand-crafted shot features and Wasserstein distances between shooting style distributions were utilized. For the latter, soft clustering was applied to playtype data for the first time. Subs",
    "path": "papers/24/03/2403.13821.json",
    "total_tokens": 856,
    "translated_title": "用投篮风格和进攻角色对篮球球员进行聚类的进攻阵容分析",
    "translated_abstract": "在篮球比赛中，得分效率由于每场比赛中的大量进攻次数而显得非常重要。提高得分效率需要球员之间具有不同比赛风格的有效协作。以往的研究中，曾对篮球阵容进行分析，但它们的比赛风格兼容性尚未得到量化检验。本研究的目的是更具体地分析比赛风格兼容性对得分效率的影响，重点放在进攻端。本研究采用两种方法来捕捉球员在进攻端的比赛风格：利用跟踪数据进行投篮风格聚类，以及基于注释的比赛类型和高级统计数据进行进攻角色聚类。对于前者，利用可解释的手工制作的投篮特征和投篮风格分布之间的Wasserstein距离。对于后者，首次将软聚类应用于比赛类型数据。",
    "tldr": "本研究通过使用投篮风格聚类和基于注释的进攻角色聚类，更专门地分析了比赛风格兼容性对得分效率的影响，集中在进攻端。"
}