{
    "title": "Learning Topological Representations for Deep Image Understanding",
    "abstract": "arXiv:2403.15361v1 Announce Type: cross  Abstract: In many scenarios, especially biomedical applications, the correct delineation of complex fine-scaled structures such as neurons, tissues, and vessels is critical for downstream analysis. Despite the strong predictive power of deep learning methods, they do not provide a satisfactory representation of these structures, thus creating significant barriers in scalable annotation and downstream analysis. In this dissertation, we tackle such challenges by proposing novel representations of these topological structures in a deep learning framework. We leverage the mathematical tools from topological data analysis, i.e., persistent homology and discrete Morse theory, to develop principled methods for better segmentation and uncertainty estimation, which will become powerful tools for scalable annotation.",
    "link": "https://arxiv.org/abs/2403.15361",
    "context": "Title: Learning Topological Representations for Deep Image Understanding\nAbstract: arXiv:2403.15361v1 Announce Type: cross  Abstract: In many scenarios, especially biomedical applications, the correct delineation of complex fine-scaled structures such as neurons, tissues, and vessels is critical for downstream analysis. Despite the strong predictive power of deep learning methods, they do not provide a satisfactory representation of these structures, thus creating significant barriers in scalable annotation and downstream analysis. In this dissertation, we tackle such challenges by proposing novel representations of these topological structures in a deep learning framework. We leverage the mathematical tools from topological data analysis, i.e., persistent homology and discrete Morse theory, to develop principled methods for better segmentation and uncertainty estimation, which will become powerful tools for scalable annotation.",
    "path": "papers/24/03/2403.15361.json",
    "total_tokens": 759,
    "translated_title": "学习深度图像理解的拓扑表示",
    "translated_abstract": "在许多场景中，尤其是生物医学应用中，正确划分复杂的细小结构如神经元、组织和血管对下游分析至关重要。深度学习方法虽然具有强大的预测能力，但并没有提供对这些结构的令人满意的表示，从而在可伸缩的注释和下游分析中产生重大障碍。本文提出了在深度学习框架中针对这些拓扑结构提出的新颖表示来解决这些挑战。我们利用拓扑数据分析中的数学工具，即持久同调和离散莫尔斯理论，开发了基于原则的更好分割和不确定性估计方法，这将成为可伸缩注释的强大工具。",
    "tldr": "提出了在深度学习框架中利用拓扑数据分析方法提高对图像中复杂结构的分割和不确定性估计，为可伸缩注释提供了强大工具。",
    "en_tdlr": "Proposes novel representations of topological structures in deep learning framework, leveraging topological data analysis methods to improve segmentation and uncertainty estimation of complex structures in images, providing powerful tools for scalable annotation."
}