{
    "title": "PaddingFlow: Improving Normalizing Flows with Padding-Dimensional Noise",
    "abstract": "arXiv:2403.08216v1 Announce Type: new  Abstract: Normalizing flow is a generative modeling approach with efficient sampling. However, Flow-based models suffer two issues, which are manifold and discrete data. If the target distribution is a manifold, which means the dimension of the latent target distribution and the dimension of the data distribution are unmatched, flow-based models might perform badly. Discrete data makes flow-based models collapse into a degenerate mixture of point masses. In this paper, to sidestep such two issues we propose PaddingFlow, a novel dequantization method, which improves normalizing flows with padding-dimensional noise. PaddingFlow is easy to implement, computationally cheap, widely suitable for various tasks, and generates samples that are unbiased estimations of the data. Especially, our method can overcome the limitation of existing dequantization methods that have to change the data distribution, which might degrade performance. We validate our meth",
    "link": "https://arxiv.org/abs/2403.08216",
    "context": "Title: PaddingFlow: Improving Normalizing Flows with Padding-Dimensional Noise\nAbstract: arXiv:2403.08216v1 Announce Type: new  Abstract: Normalizing flow is a generative modeling approach with efficient sampling. However, Flow-based models suffer two issues, which are manifold and discrete data. If the target distribution is a manifold, which means the dimension of the latent target distribution and the dimension of the data distribution are unmatched, flow-based models might perform badly. Discrete data makes flow-based models collapse into a degenerate mixture of point masses. In this paper, to sidestep such two issues we propose PaddingFlow, a novel dequantization method, which improves normalizing flows with padding-dimensional noise. PaddingFlow is easy to implement, computationally cheap, widely suitable for various tasks, and generates samples that are unbiased estimations of the data. Especially, our method can overcome the limitation of existing dequantization methods that have to change the data distribution, which might degrade performance. We validate our meth",
    "path": "papers/24/03/2403.08216.json",
    "total_tokens": 823,
    "translated_title": "PaddingFlow：利用填充维度噪声改进归一化流",
    "translated_abstract": "正规化流是一种具有高效采样的生成建模方法。然而，基于流的模型存在两个问题，即流形和离散数据。 如果目标分布是一个流形，也就是说潜在目标分布的维度和数据分布的维度不匹配，基于流的模型可能表现不佳。离散数据会导致基于流的模型坍缩为退化的点质量混合。 为了规避这两个问题，本文提出了PaddingFlow，一种新颖的去量化方法，利用填充维度噪声改进了正规化流。PaddingFlow易于实现、计算廉价、广泛适用于各种任务，并生成无偏估计的数据样本。特别是，我们的方法可以克服现有去量化方法的局限性，而这些方法必须改变数据分布，可能会降低性能。我们验证了我们的方法",
    "tldr": "提出了一种名为PaddingFlow的去量化方法，利用填充维度噪声改进了正规化流，解决了基于流的模型在流形和离散数据上的性能问题。",
    "en_tdlr": "Introducing PaddingFlow, a dequantization method that improves normalizing flows with padding-dimensional noise, addressing the performance issues of flow-based models on manifolds and discrete data."
}