{
    "title": "A Python library for efficient computation of molecular fingerprints",
    "abstract": "arXiv:2403.19718v1 Announce Type: cross  Abstract: Machine learning solutions are very popular in the field of chemoinformatics, where they have numerous applications, such as novel drug discovery or molecular property prediction. Molecular fingerprints are algorithms commonly used for vectorizing chemical molecules as a part of preprocessing in this kind of solution. However, despite their popularity, there are no libraries that implement them efficiently for large datasets, utilizing modern, multicore architectures. On top of that, most of them do not provide the user with an intuitive interface, or one that would be compatible with other machine learning tools.   In this project, we created a Python library that computes molecular fingerprints efficiently and delivers an interface that is comprehensive and enables the user to easily incorporate the library into their existing machine learning workflow. The library enables the user to perform computation on large datasets using paral",
    "link": "https://arxiv.org/abs/2403.19718",
    "context": "Title: A Python library for efficient computation of molecular fingerprints\nAbstract: arXiv:2403.19718v1 Announce Type: cross  Abstract: Machine learning solutions are very popular in the field of chemoinformatics, where they have numerous applications, such as novel drug discovery or molecular property prediction. Molecular fingerprints are algorithms commonly used for vectorizing chemical molecules as a part of preprocessing in this kind of solution. However, despite their popularity, there are no libraries that implement them efficiently for large datasets, utilizing modern, multicore architectures. On top of that, most of them do not provide the user with an intuitive interface, or one that would be compatible with other machine learning tools.   In this project, we created a Python library that computes molecular fingerprints efficiently and delivers an interface that is comprehensive and enables the user to easily incorporate the library into their existing machine learning workflow. The library enables the user to perform computation on large datasets using paral",
    "path": "papers/24/03/2403.19718.json",
    "total_tokens": 687,
    "translated_title": "用于高效计算分子指纹的Python库",
    "translated_abstract": "机器学习解决方案在化学信息学领域非常流行，具有诸多应用，如新药发现或分子性质预测。分子指纹是一种常用算法，用于将化学分子向量化，作为预处理解决方案的一部分。然而，尽管它们很受欢迎，但没有一个库能够高效地为大型数据集实现它们，利用现代的多核架构。此外，大部分库并没有提供用户友好的接口，或者与其他机器学习工具兼容的接口。",
    "tldr": "创建了一个Python库，可以高效计算分子指纹，并提供了全面的接口，使用户能够轻松将该库整合到其现有的机器学习工作流程中。",
    "en_tdlr": "Developed a Python library for efficiently computing molecular fingerprints with a comprehensive interface for easy integration into existing machine learning workflows."
}