{
    "title": "Physics-Informed Neural Networks for Satellite State Estimation",
    "abstract": "arXiv:2403.19736v1 Announce Type: cross  Abstract: The Space Domain Awareness (SDA) community routinely tracks satellites in orbit by fitting an orbital state to observations made by the Space Surveillance Network (SSN). In order to fit such orbits, an accurate model of the forces that are acting on the satellite is required. Over the past several decades, high-quality, physics-based models have been developed for satellite state estimation and propagation. These models are exceedingly good at estimating and propagating orbital states for non-maneuvering satellites; however, there are several classes of anomalous accelerations that a satellite might experience which are not well-modeled, such as satellites that use low-thrust electric propulsion to modify their orbit. Physics-Informed Neural Networks (PINNs) are a valuable tool for these classes of satellites as they combine physics models with Deep Neural Networks (DNNs), which are highly expressive and versatile function approximator",
    "link": "https://arxiv.org/abs/2403.19736",
    "context": "Title: Physics-Informed Neural Networks for Satellite State Estimation\nAbstract: arXiv:2403.19736v1 Announce Type: cross  Abstract: The Space Domain Awareness (SDA) community routinely tracks satellites in orbit by fitting an orbital state to observations made by the Space Surveillance Network (SSN). In order to fit such orbits, an accurate model of the forces that are acting on the satellite is required. Over the past several decades, high-quality, physics-based models have been developed for satellite state estimation and propagation. These models are exceedingly good at estimating and propagating orbital states for non-maneuvering satellites; however, there are several classes of anomalous accelerations that a satellite might experience which are not well-modeled, such as satellites that use low-thrust electric propulsion to modify their orbit. Physics-Informed Neural Networks (PINNs) are a valuable tool for these classes of satellites as they combine physics models with Deep Neural Networks (DNNs), which are highly expressive and versatile function approximator",
    "path": "papers/24/03/2403.19736.json",
    "total_tokens": 839,
    "translated_title": "物理信息神经网络用于卫星状态估计",
    "translated_abstract": "《物理信息神经网络用于卫星状态估计》论文翻译摘要：太空领域意识（SDA）群体通过将轨道状态拟合到太空监视网络（SSN）观测到的卫星来定期跟踪发射卫星。为了拟合这样的轨道，需要准确的作用于卫星的力模型。过去几十年，为卫星状态估计和传播开发了高质量的基于物理的模型。这些模型在估算和传播非机动卫星的轨道状态方面表现非常出色；然而，卫星可能遇到几类不太好建模的异常加速度，比如使用低推力电推进来修改轨道的卫星。对于这些类别的卫星，物理信息神经网络（PINNs）是一个宝贵的工具，因为它们将物理模型与深度神经网络（DNNs）结合起来，DNN是高度表现力和多功能的函数逼近器。",
    "tldr": "物理信息神经网络与深度神经网络相结合，为卫星中一些难以建模的异常加速度情况提供了强大的工具",
    "en_tdlr": "Physics-Informed Neural Networks combined with Deep Neural Networks provide a powerful tool for handling anomalous accelerations in satellites that are difficult to model."
}