{
    "title": "Rethinking Clustered Federated Learning in NOMA Enhanced Wireless Networks",
    "abstract": "arXiv:2403.03157v1 Announce Type: cross  Abstract: This study explores the benefits of integrating the novel clustered federated learning (CFL) approach with non-orthogonal multiple access (NOMA) under non-independent and identically distributed (non-IID) datasets, where multiple devices participate in the aggregation with time limitations and a finite number of sub-channels. A detailed theoretical analysis of the generalization gap that measures the degree of non-IID in the data distribution is presented. Following that, solutions to address the challenges posed by non-IID conditions are proposed with the analysis of the properties. Specifically, users' data distributions are parameterized as concentration parameters and grouped using spectral clustering, with Dirichlet distribution serving as the prior. The investigation into the generalization gap and convergence rate guides the design of sub-channel assignments through the matching-based algorithm, and the power allocation is achie",
    "link": "https://arxiv.org/abs/2403.03157",
    "context": "Title: Rethinking Clustered Federated Learning in NOMA Enhanced Wireless Networks\nAbstract: arXiv:2403.03157v1 Announce Type: cross  Abstract: This study explores the benefits of integrating the novel clustered federated learning (CFL) approach with non-orthogonal multiple access (NOMA) under non-independent and identically distributed (non-IID) datasets, where multiple devices participate in the aggregation with time limitations and a finite number of sub-channels. A detailed theoretical analysis of the generalization gap that measures the degree of non-IID in the data distribution is presented. Following that, solutions to address the challenges posed by non-IID conditions are proposed with the analysis of the properties. Specifically, users' data distributions are parameterized as concentration parameters and grouped using spectral clustering, with Dirichlet distribution serving as the prior. The investigation into the generalization gap and convergence rate guides the design of sub-channel assignments through the matching-based algorithm, and the power allocation is achie",
    "path": "papers/24/03/2403.03157.json",
    "total_tokens": 823,
    "translated_title": "在NOMA增强的无线网络中重新思考聚类联邦学习",
    "translated_abstract": "本研究探讨了将新型的聚类联邦学习（CFL）方法与非正交多址接入（NOMA）相结合在非独立同分布（non-IID）数据集下的优势，其中多个设备参与具有时间限制和有限子信道数量的聚合。详细的理论分析了衡量数据分布中非IID程度的泛化差距。在此之后，提出了解决非IID条件所带来挑战的解决方案，并分析了各项性质。具体地，用户的数据分布被参数化为集中参数，并使用谱聚类进行分组，Dirichlet分布作为先验。对泛化差距和收敛速率的探讨指导了通过基于匹配的算法设计子信道分配，并实现功率分配。",
    "tldr": "本研究探讨了在NOMA增强的无线网络中将聚类联邦学习与非独立同分布数据集相结合的优势，并提出了解决非IID条件挑战的解决方案。",
    "en_tdlr": "This study explores the benefits of integrating the novel clustered federated learning (CFL) approach with non-orthogonal multiple access (NOMA) under non-IID datasets, and proposes solutions to address the challenges posed by non-IID conditions."
}