{
    "title": "Quantitative Analysis of AI-Generated Texts in Academic Research: A Study of AI Presence in Arxiv Submissions using AI Detection Tool",
    "abstract": "arXiv:2403.13812v1 Announce Type: cross  Abstract: Many people are interested in ChatGPT since it has become a prominent AIGC model that provides high-quality responses in various contexts, such as software development and maintenance. Misuse of ChatGPT might cause significant issues, particularly in public safety and education, despite its immense potential. The majority of researchers choose to publish their work on Arxiv. The effectiveness and originality of future work depend on the ability to detect AI components in such contributions. To address this need, this study will analyze a method that can see purposely manufactured content that academic organizations use to post on Arxiv. For this study, a dataset was created using physics, mathematics, and computer science articles. Using the newly built dataset, the following step is to put originality.ai through its paces. The statistical analysis shows that Originality.ai is very accurate, with a rate of 98%.",
    "link": "https://arxiv.org/abs/2403.13812",
    "context": "Title: Quantitative Analysis of AI-Generated Texts in Academic Research: A Study of AI Presence in Arxiv Submissions using AI Detection Tool\nAbstract: arXiv:2403.13812v1 Announce Type: cross  Abstract: Many people are interested in ChatGPT since it has become a prominent AIGC model that provides high-quality responses in various contexts, such as software development and maintenance. Misuse of ChatGPT might cause significant issues, particularly in public safety and education, despite its immense potential. The majority of researchers choose to publish their work on Arxiv. The effectiveness and originality of future work depend on the ability to detect AI components in such contributions. To address this need, this study will analyze a method that can see purposely manufactured content that academic organizations use to post on Arxiv. For this study, a dataset was created using physics, mathematics, and computer science articles. Using the newly built dataset, the following step is to put originality.ai through its paces. The statistical analysis shows that Originality.ai is very accurate, with a rate of 98%.",
    "path": "papers/24/03/2403.13812.json",
    "total_tokens": 897,
    "translated_title": "AI生成文本在学术研究中的定量分析：利用AI检测工具研究Arxiv投稿中的AI存在性",
    "translated_abstract": "许多人对ChatGPT感兴趣，因为它已成为一个突出的AIGC模型，可以在各种情境下提供高质量的响应，如软件开发和维护。ChatGPT的误用可能引起重大问题，特别是在公共安全和教育领域，尽管其有巨大潜力。研究人员大多选择在Arxiv上发表他们的作品。未来工作的有效性和独创性取决于在这些贡献中检测到AI组件的能力。为了满足这一需求，本研究将分析一种方法，可以查看学术机构用于在Arxiv上发布的刻意制造的内容。为了进行这项研究，使用了物理、数学和计算机科学文章创建了一个数据集。利用新建立的数据集，接下来的步骤是将originality.ai投入使用。统计分析显示，Originality.ai非常精准，准确率达到98%。",
    "tldr": "论文研究了一种能够检测Arxiv投稿中AI成分的方法，使用物理、数学和计算机科学文章创建数据集，并通过Originality.ai进行分析，准确率达到98%。",
    "en_tdlr": "The paper investigates a method to detect AI components in Arxiv submissions, creates a dataset using physics, mathematics, and computer science articles, and analyzes it with Originality.ai, achieving an accuracy rate of 98%."
}