{
    "title": "RAD-PHI2: Instruction Tuning PHI-2 for Radiology",
    "abstract": "arXiv:2403.09725v1 Announce Type: cross  Abstract: Small Language Models (SLMs) have shown remarkable performance in general domain language understanding, reasoning and coding tasks, but their capabilities in the medical domain, particularly concerning radiology text, is less explored. In this study, we investigate the application of SLMs for general radiology knowledge specifically question answering related to understanding of symptoms, radiological appearances of findings, differential diagnosis, assessing prognosis, and suggesting treatments w.r.t diseases pertaining to different organ systems. Additionally, we explore the utility of SLMs in handling text-related tasks with respect to radiology reports within AI-driven radiology workflows. We fine-tune Phi-2, a SLM with 2.7 billion parameters using high-quality educational content from Radiopaedia, a collaborative online radiology resource. The resulting language model, RadPhi-2-Base, exhibits the ability to address general radiol",
    "link": "https://arxiv.org/abs/2403.09725",
    "context": "Title: RAD-PHI2: Instruction Tuning PHI-2 for Radiology\nAbstract: arXiv:2403.09725v1 Announce Type: cross  Abstract: Small Language Models (SLMs) have shown remarkable performance in general domain language understanding, reasoning and coding tasks, but their capabilities in the medical domain, particularly concerning radiology text, is less explored. In this study, we investigate the application of SLMs for general radiology knowledge specifically question answering related to understanding of symptoms, radiological appearances of findings, differential diagnosis, assessing prognosis, and suggesting treatments w.r.t diseases pertaining to different organ systems. Additionally, we explore the utility of SLMs in handling text-related tasks with respect to radiology reports within AI-driven radiology workflows. We fine-tune Phi-2, a SLM with 2.7 billion parameters using high-quality educational content from Radiopaedia, a collaborative online radiology resource. The resulting language model, RadPhi-2-Base, exhibits the ability to address general radiol",
    "path": "papers/24/03/2403.09725.json",
    "total_tokens": 863,
    "translated_title": "RAD-PHI2：为放射学调整PHI-2的指导",
    "translated_abstract": "小语言模型（SLMs）在一般领域语言理解、推理和编码任务中表现出色，但它们在医学领域的能力，尤其是涉及放射学文本的能力，还没有得到充分探讨。本研究探讨了SLMs在一般放射学知识特别是与了解症状、放射学发现的外观、鉴别诊断、评估预后以及针对不同器官系统疾病的治疗方面的问题回答中的应用。此外，我们探讨了将SLMs应用于处理与放射学报告相关任务在基于AI的放射学工作流中的效用。我们使用Radiopaedia这一协作在线放射学资源中的高质量教育内容对具有27亿参数的Phi-2进行微调。所得的语言模型，RadPhi-2-Base，表现出了解决一般放射学问题的能力。",
    "tldr": "本研究调查了将小语言模型用于放射学领域的应用，通过微调具有27亿参数的Phi-2，提出了具有良好性能的RadPhi-2-Base语言模型。",
    "en_tdlr": "This study investigates the application of Small Language Models (SLMs) in the field of radiology by fine-tuning Phi-2 with 2.7 billion parameters, resulting in the high-performance language model RadPhi-2-Base."
}