{
    "title": "CATSE: A Context-Aware Framework for Causal Target Sound Extraction",
    "abstract": "arXiv:2403.14246v1 Announce Type: cross  Abstract: Target Sound Extraction (TSE) focuses on the problem of separating sources of interest, indicated by a user's cue, from the input mixture. Most existing solutions operate in an offline fashion and are not suited to the low-latency causal processing constraints imposed by applications in live-streamed content such as augmented hearing. We introduce a family of context-aware low-latency causal TSE models suitable for real-time processing. First, we explore the utility of context by providing the TSE model with oracle information about what sound classes make up the input mixture, where the objective of the model is to extract one or more sources of interest indicated by the user. Since the practical applications of oracle models are limited due to their assumptions, we introduce a composite multi-task training objective involving separation and classification losses. Our evaluation involving single- and multi-source extraction shows the ",
    "link": "https://arxiv.org/abs/2403.14246",
    "context": "Title: CATSE: A Context-Aware Framework for Causal Target Sound Extraction\nAbstract: arXiv:2403.14246v1 Announce Type: cross  Abstract: Target Sound Extraction (TSE) focuses on the problem of separating sources of interest, indicated by a user's cue, from the input mixture. Most existing solutions operate in an offline fashion and are not suited to the low-latency causal processing constraints imposed by applications in live-streamed content such as augmented hearing. We introduce a family of context-aware low-latency causal TSE models suitable for real-time processing. First, we explore the utility of context by providing the TSE model with oracle information about what sound classes make up the input mixture, where the objective of the model is to extract one or more sources of interest indicated by the user. Since the practical applications of oracle models are limited due to their assumptions, we introduce a composite multi-task training objective involving separation and classification losses. Our evaluation involving single- and multi-source extraction shows the ",
    "path": "papers/24/03/2403.14246.json",
    "total_tokens": 814,
    "translated_title": "CATSE: 一种上下文感知的因果目标声音提取框架",
    "translated_abstract": "目标声音提取（TSE）专注于将用户提示的感兴趣来源与输入混合物分离的问题。大多数现有解决方案以线下方式运行，不适用于应用于实时内容（如增强听力）中所施加的低延迟因果处理约束。我们引入了一系列适用于实时处理的上下文感知低延迟因果TSE模型。首先，我们通过为TSE模型提供有关组成输入混合物的声音类别的神谕信息，探讨了上下文的实用性，其中模型的目标是提取用户指示的一个或多个感兴趣来源。由于神谕模型的实际应用受到假设的限制，我们引入了一个包含分离和分类损失的复合多任务训练目标。我们的评估涉及单源和多源提取",
    "tldr": "CATSE提出了一种适用于实时处理的上下文感知低延迟因果TSE模型，通过引入复合多任务训练目标，提高了目标声音提取的性能。",
    "en_tdlr": "CATSE introduces a context-aware low-latency causal TSE model suitable for real-time processing, enhancing the performance of target sound extraction by introducing a composite multi-task training objective."
}