{
    "title": "AC-EVAL: Evaluating Ancient Chinese Language Understanding in Large Language Models",
    "abstract": "arXiv:2403.06574v1 Announce Type: new  Abstract: Given the importance of ancient Chinese in capturing the essence of rich historical and cultural heritage, the rapid advancements in Large Language Models (LLMs) necessitate benchmarks that can effectively evaluate their understanding of ancient contexts. To meet this need, we present AC-EVAL, an innovative benchmark designed to assess the advanced knowledge and reasoning capabilities of LLMs within the context of ancient Chinese. AC-EVAL is structured across three levels of difficulty reflecting different facets of language comprehension: general historical knowledge, short text understanding, and long text comprehension. The benchmark comprises 13 tasks, spanning historical facts, geography, social customs, art, philosophy, classical poetry and prose, providing a comprehensive assessment framework. Our extensive evaluation of top-performing LLMs, tailored for both English and Chinese, reveals a substantial potential for enhancing ancie",
    "link": "https://arxiv.org/abs/2403.06574",
    "context": "Title: AC-EVAL: Evaluating Ancient Chinese Language Understanding in Large Language Models\nAbstract: arXiv:2403.06574v1 Announce Type: new  Abstract: Given the importance of ancient Chinese in capturing the essence of rich historical and cultural heritage, the rapid advancements in Large Language Models (LLMs) necessitate benchmarks that can effectively evaluate their understanding of ancient contexts. To meet this need, we present AC-EVAL, an innovative benchmark designed to assess the advanced knowledge and reasoning capabilities of LLMs within the context of ancient Chinese. AC-EVAL is structured across three levels of difficulty reflecting different facets of language comprehension: general historical knowledge, short text understanding, and long text comprehension. The benchmark comprises 13 tasks, spanning historical facts, geography, social customs, art, philosophy, classical poetry and prose, providing a comprehensive assessment framework. Our extensive evaluation of top-performing LLMs, tailored for both English and Chinese, reveals a substantial potential for enhancing ancie",
    "path": "papers/24/03/2403.06574.json",
    "total_tokens": 906,
    "translated_title": "AC-EVAL：评估大型语言模型中对古代汉语的理解",
    "translated_abstract": "鉴于古代汉语在捕捉丰富历史和文化遗产精髓方面的重要性，大型语言模型（LLMs）的快速发展需要有效评估它们对古代语境的理解能力的基准。为了满足这一需求，我们提出了AC-EVAL，这是一个创新的基准，旨在评估LLMs在古代汉语语境中的高级知识和推理能力。AC-EVAL分为三个难度级别，反映了语言理解的不同方面：一般历史知识、短文本理解和长文本理解。该基准包括13个任务，涵盖历史事实、地理、社会习俗、艺术、哲学、古典诗歌和散文，提供了一个全面的评估框架。我们对表现最佳的针对英文和汉语的LLMs进行了广泛评估，揭示了增强古代汉语理解潜力的重要性。",
    "tldr": "AC-EVAL是一个评估大型语言模型对古代汉语理解的创新基准，分为三个难度级别，涵盖历史知识、短文本和长文本理解，对LLMs的高级知识和推理能力进行评估。"
}