{
    "title": "Active Generation for Image Classification",
    "abstract": "arXiv:2403.06517v1 Announce Type: cross  Abstract: Recently, the growing capabilities of deep generative models have underscored their potential in enhancing image classification accuracy. However, existing methods often demand the generation of a disproportionately large number of images compared to the original dataset, while having only marginal improvements in accuracy. This computationally expensive and time-consuming process hampers the practicality of such approaches. In this paper, we propose to address the efficiency of image generation by focusing on the specific needs and characteristics of the model. With a central tenet of active learning, our method, named ActGen, takes a training-aware approach to image generation. It aims to create images akin to the challenging or misclassified samples encountered by the current model and incorporates these generated images into the training set to augment model performance. ActGen introduces an attentive image guidance technique, usin",
    "link": "https://arxiv.org/abs/2403.06517",
    "context": "Title: Active Generation for Image Classification\nAbstract: arXiv:2403.06517v1 Announce Type: cross  Abstract: Recently, the growing capabilities of deep generative models have underscored their potential in enhancing image classification accuracy. However, existing methods often demand the generation of a disproportionately large number of images compared to the original dataset, while having only marginal improvements in accuracy. This computationally expensive and time-consuming process hampers the practicality of such approaches. In this paper, we propose to address the efficiency of image generation by focusing on the specific needs and characteristics of the model. With a central tenet of active learning, our method, named ActGen, takes a training-aware approach to image generation. It aims to create images akin to the challenging or misclassified samples encountered by the current model and incorporates these generated images into the training set to augment model performance. ActGen introduces an attentive image guidance technique, usin",
    "path": "papers/24/03/2403.06517.json",
    "total_tokens": 830,
    "translated_title": "图像分类的主动生成",
    "translated_abstract": "最近，深度生成模型不断增强的能力突显了它们在提高图像分类准确性方面的潜力。然而，现有方法往往要求生成的图像数量远远超过原始数据集，而在准确性方面只有极小的改进。这种计算昂贵且耗时的过程阻碍了这种方法的实用性。在本文中，我们提出通过专注于模型的具体需求和特征来提高图像生成的效率。我们的方法ActGen以主动学习为中心原则，采用了一个针对训练感知的图像生成方法。它旨在创建类似于当前模型遇到的具有挑战性或被误分类样本的图像，并将这些生成的图像纳入训练集以增强模型性能。",
    "tldr": "该论文提出了一种名为ActGen的方法，通过采用训练感知的方式来生成图像，以提高图像分类准确性。ActGen利用主动学习的理念，生成类似于挑战性或被误分类样本的图像，并将其整合到训练集中，从而增强模型性能。",
    "en_tdlr": "The paper introduces a method called ActGen to improve image classification accuracy by generating images in a training-aware manner. ActGen leverages the concept of active learning to generate images similar to challenging or misclassified samples encountered by the current model and incorporates them into the training set to enhance model performance."
}