{
    "title": "Granular Change Accuracy: A More Accurate Performance Metric for Dialogue State Tracking",
    "abstract": "arXiv:2403.11123v1 Announce Type: new  Abstract: Current metrics for evaluating Dialogue State Tracking (DST) systems exhibit three primary limitations. They: i) erroneously presume a uniform distribution of slots throughout the dialog, ii) neglect to assign partial scores for individual turns, iii) frequently overestimate or underestimate performance by repeatedly counting the models' successful or failed predictions. To address these shortcomings, we introduce a novel metric: Granular Change Accuracy (GCA). GCA focuses on evaluating the predicted changes in dialogue state over the entire dialogue history. Benchmarking reveals that GCA effectively reduces biases arising from distribution uniformity and the positioning of errors across turns, resulting in a more precise evaluation. Notably, we find that these biases are particularly pronounced when evaluating few-shot or zero-shot trained models, becoming even more evident as the model's error rate increases. Hence, GCA offers signific",
    "link": "https://arxiv.org/abs/2403.11123",
    "context": "Title: Granular Change Accuracy: A More Accurate Performance Metric for Dialogue State Tracking\nAbstract: arXiv:2403.11123v1 Announce Type: new  Abstract: Current metrics for evaluating Dialogue State Tracking (DST) systems exhibit three primary limitations. They: i) erroneously presume a uniform distribution of slots throughout the dialog, ii) neglect to assign partial scores for individual turns, iii) frequently overestimate or underestimate performance by repeatedly counting the models' successful or failed predictions. To address these shortcomings, we introduce a novel metric: Granular Change Accuracy (GCA). GCA focuses on evaluating the predicted changes in dialogue state over the entire dialogue history. Benchmarking reveals that GCA effectively reduces biases arising from distribution uniformity and the positioning of errors across turns, resulting in a more precise evaluation. Notably, we find that these biases are particularly pronounced when evaluating few-shot or zero-shot trained models, becoming even more evident as the model's error rate increases. Hence, GCA offers signific",
    "path": "papers/24/03/2403.11123.json",
    "total_tokens": 893,
    "translated_title": "Granular Change Accuracy: 一种更准确的对话状态跟踪性能度量",
    "translated_abstract": "目前用于评估对话状态跟踪（DST）系统的度量表现出三个主要限制：i）错误地假定对话中插槽的分布是均匀的，ii）忽视为单个对话轮分配部分分数，iii）经常通过反复计算模型成功或失败预测的次数来高估或低估性能。为了解决这些缺陷，我们引入了一种新的度量标准：Granular Change Accuracy（GCA）。GCA专注于评估整个对话历史上对话状态的预测变化。基准测试显示，GCA有效地减少了由于分布均匀性和错误定位不同对话轮之间而产生的偏见，从而实现了更精确的评估。值得注意的是，在评估少样本或零样本训练的模型时，我们发现这些偏见特别明显，在模型错误率增加时更加显著。因此，GCA在提供显著性方面提供了",
    "tldr": "Granular Change Accuracy (GCA) 是一种更准确的对话状态跟踪性能度量，有效减少了由于分布均匀性和对话轮之间错误定位而产生的偏见，特别适用于评估少样本或零样本训练的模型。",
    "en_tdlr": "Granular Change Accuracy (GCA) is a more accurate performance metric for dialogue state tracking, effectively reducing biases arising from distribution uniformity and error positioning across dialogue turns, particularly useful for evaluating few-shot or zero-shot trained models."
}