{
    "title": "Generative Modelling of Stochastic Rotating Shallow Water Noise",
    "abstract": "arXiv:2403.10578v1 Announce Type: cross  Abstract: In recent work, the authors have developed a generic methodology for calibrating the noise in fluid dynamics stochastic partial differential equations where the stochasticity was introduced to parametrize subgrid-scale processes. The stochastic parameterization of sub-grid scale processes is required in the estimation of uncertainty in weather and climate predictions, to represent systematic model errors arising from subgrid-scale fluctuations. The previous methodology used a principal component analysis (PCA) technique based on the ansatz that the increments of the stochastic parametrization are normally distributed.   In this paper, the PCA technique is replaced by a generative model technique. This enables us to avoid imposing additional constraints on the increments. The methodology is tested on a stochastic rotating shallow water model with the elevation variable of the model used as input data. The numerical simulations show that",
    "link": "https://arxiv.org/abs/2403.10578",
    "context": "Title: Generative Modelling of Stochastic Rotating Shallow Water Noise\nAbstract: arXiv:2403.10578v1 Announce Type: cross  Abstract: In recent work, the authors have developed a generic methodology for calibrating the noise in fluid dynamics stochastic partial differential equations where the stochasticity was introduced to parametrize subgrid-scale processes. The stochastic parameterization of sub-grid scale processes is required in the estimation of uncertainty in weather and climate predictions, to represent systematic model errors arising from subgrid-scale fluctuations. The previous methodology used a principal component analysis (PCA) technique based on the ansatz that the increments of the stochastic parametrization are normally distributed.   In this paper, the PCA technique is replaced by a generative model technique. This enables us to avoid imposing additional constraints on the increments. The methodology is tested on a stochastic rotating shallow water model with the elevation variable of the model used as input data. The numerical simulations show that",
    "path": "papers/24/03/2403.10578.json",
    "total_tokens": 799,
    "translated_title": "随机旋转浅水噪声的生成建模",
    "translated_abstract": "在最近的工作中，作者们开发了一种用于校准流体动力学随机偏微分方程中噪声的通用方法，其中随机性被引入以参数化次网格尺度过程。子网格尺度过程的随机参数化在天气和气候预测的不确定性估计中是必需的，以表示由子网格尺度波动引起的系统模型误差。以前的方法使用基于随机参数化增量为正态分布的假设的主成分分析（PCA）技术。在本文中，PCA技术被生成模型技术所取代。这使我们能够避免对增量施加额外约束。该方法在具有模型高程变量作为输入数据的随机旋转浅水模型上进行了测试。数值模拟表明",
    "tldr": "本文提出一种用于校准流体动力学随机偏微分方程中噪声的通用方法，使用生成模型技术取代了以往的PCA技术，这能够避免对增量施加额外约束。",
    "en_tdlr": "This paper presents a generic methodology for calibrating noise in fluid dynamics stochastic partial differential equations, replacing the previous PCA technique with generative model technique to avoid imposing additional constraints on increments."
}