{
    "title": "Predicting Energy Budgets in Droplet Dynamics: A Recurrent Neural Network Approach",
    "abstract": "arXiv:2403.16144v1 Announce Type: cross  Abstract: Neural networks in fluid mechanics offer an efficient approach for exploring complex flows, including multiphase and free surface flows. The recurrent neural network, particularly the Long Short-Term Memory (LSTM) model, proves attractive for learning mappings from transient inputs to dynamic outputs. This study applies LSTM to predict transient and static outputs for fluid flows under surface tension effects. Specifically, we explore two distinct droplet dynamic scenarios: droplets with diverse initial shapes impacting with solid surfaces, as well as the coalescence of two droplets following collision. Using only dimensionless numbers and geometric time series data from numerical simulations, LSTM predicts the energy budget. The marker-and-cell front-tracking methodology combined with a marker-and-cell finite-difference strategy is adopted for simulating the droplet dynamics. Using a recurrent neural network (RNN) architecture fed wit",
    "link": "https://arxiv.org/abs/2403.16144",
    "context": "Title: Predicting Energy Budgets in Droplet Dynamics: A Recurrent Neural Network Approach\nAbstract: arXiv:2403.16144v1 Announce Type: cross  Abstract: Neural networks in fluid mechanics offer an efficient approach for exploring complex flows, including multiphase and free surface flows. The recurrent neural network, particularly the Long Short-Term Memory (LSTM) model, proves attractive for learning mappings from transient inputs to dynamic outputs. This study applies LSTM to predict transient and static outputs for fluid flows under surface tension effects. Specifically, we explore two distinct droplet dynamic scenarios: droplets with diverse initial shapes impacting with solid surfaces, as well as the coalescence of two droplets following collision. Using only dimensionless numbers and geometric time series data from numerical simulations, LSTM predicts the energy budget. The marker-and-cell front-tracking methodology combined with a marker-and-cell finite-difference strategy is adopted for simulating the droplet dynamics. Using a recurrent neural network (RNN) architecture fed wit",
    "path": "papers/24/03/2403.16144.json",
    "total_tokens": 872,
    "translated_title": "预测液滴动力学中的能量预算：一种循环神经网络方法",
    "translated_abstract": "arXiv:2403.16144v1 公告类型: 交叉摘要: 流体力学中的神经网络为探索复杂流动（包括多相和自由表面流动）提供了一种高效方法。 循环神经网络，特别是长短期记忆（LSTM）模型，证明了对学习从瞬态输入到动态输出的映射具有吸引力。 本研究应用LSTM来预测受表面张力影响的流体流动的瞬态和静态输出。 具体而言，我们探索了两种不同的液滴动力学场景：具有不同初始形状的液滴与固体表面碰撞，以及两个液滴碰撞后凝聚。 仅使用无量纲数和来自数值模拟的几何时间序列数据，LSTM可以预测能量预算。 采用标记格点法前向跟踪方法结合标记格点法有限差分策略来模拟液滴动力学。 使用馈送循环神经网络（RNN）架构",
    "tldr": "该研究应用循环神经网络方法，特别是LSTM模型，来预测受表面张力影响的流体流动中的能量预算。",
    "en_tdlr": "This study applies a recurrent neural network approach, particularly the LSTM model, to predict energy budgets in fluid flows under surface tension effects."
}