{
    "title": "Graph Construction with Flexible Nodes for Traffic Demand Prediction",
    "abstract": "arXiv:2403.00276v1 Announce Type: new  Abstract: Graph neural networks (GNNs) have been widely applied in traffic demand prediction, and transportation modes can be divided into station-based mode and free-floating traffic mode. Existing research in traffic graph construction primarily relies on map matching to construct graphs based on the road network. However, the complexity and inhomogeneity of data distribution in free-floating traffic demand forecasting make road network matching inflexible. To tackle these challenges, this paper introduces a novel graph construction method tailored to free-floating traffic mode. We propose a novel density-based clustering algorithm (HDPC-L) to determine the flexible positioning of nodes in the graph, overcoming the computational bottlenecks of traditional clustering algorithms and enabling effective handling of large-scale datasets. Furthermore, we extract valuable information from ridership data to initialize the edge weights of GNNs. Comprehen",
    "link": "https://arxiv.org/abs/2403.00276",
    "context": "Title: Graph Construction with Flexible Nodes for Traffic Demand Prediction\nAbstract: arXiv:2403.00276v1 Announce Type: new  Abstract: Graph neural networks (GNNs) have been widely applied in traffic demand prediction, and transportation modes can be divided into station-based mode and free-floating traffic mode. Existing research in traffic graph construction primarily relies on map matching to construct graphs based on the road network. However, the complexity and inhomogeneity of data distribution in free-floating traffic demand forecasting make road network matching inflexible. To tackle these challenges, this paper introduces a novel graph construction method tailored to free-floating traffic mode. We propose a novel density-based clustering algorithm (HDPC-L) to determine the flexible positioning of nodes in the graph, overcoming the computational bottlenecks of traditional clustering algorithms and enabling effective handling of large-scale datasets. Furthermore, we extract valuable information from ridership data to initialize the edge weights of GNNs. Comprehen",
    "path": "papers/24/03/2403.00276.json",
    "total_tokens": 856,
    "translated_title": "具有灵活节点的图构建用于交通需求预测",
    "translated_abstract": "图神经网络（GNNs）已被广泛应用于交通需求预测中，交通模式可分为基于站点的模式和自由漂浮交通模式。现有的交通图构建研究主要依赖于地图匹配，基于道路网络构建图。然而，在自由漂浮交通需求预测中，数据分布的复杂性和不均匀性使得道路网络匹配不够灵活。为了解决这些挑战，本文提出了一种针对自由漂浮交通模式量身定制的新型图构建方法。我们提出了一种新颖的基于密度的聚类算法（HDPC-L）来确定图中节点的灵活定位，克服传统聚类算法的计算瓶颈，实现对大规模数据集的有效处理。此外，我们从乘客数据中提取有价值的信息，以初始化GNNs的边权重。",
    "tldr": "本文提出一种新型的图构建方法，利用基于密度的聚类算法确定了图中节点的灵活定位，克服了传统算法的计算瓶颈，并从乘客数据中提取有价值信息用于初始化GNNs的边权重。"
}