{
    "title": "Addressing Concept Shift in Online Time Series Forecasting: Detect-then-Adapt",
    "abstract": "arXiv:2403.14949v1 Announce Type: new  Abstract: Online updating of time series forecasting models aims to tackle the challenge of concept drifting by adjusting forecasting models based on streaming data. While numerous algorithms have been developed, most of them focus on model design and updating. In practice, many of these methods struggle with continuous performance regression in the face of accumulated concept drifts over time. To address this limitation, we present a novel approach, Concept \\textbf{D}rift \\textbf{D}etection an\\textbf{D} \\textbf{A}daptation (D3A), that first detects drifting conception and then aggressively adapts the current model to the drifted concepts after the detection for rapid adaption. To best harness the utility of historical data for model adaptation, we propose a data augmentation strategy introducing Gaussian noise into existing training instances. It helps mitigate the data distribution gap, a critical factor contributing to train-test performance in",
    "link": "https://arxiv.org/abs/2403.14949",
    "context": "Title: Addressing Concept Shift in Online Time Series Forecasting: Detect-then-Adapt\nAbstract: arXiv:2403.14949v1 Announce Type: new  Abstract: Online updating of time series forecasting models aims to tackle the challenge of concept drifting by adjusting forecasting models based on streaming data. While numerous algorithms have been developed, most of them focus on model design and updating. In practice, many of these methods struggle with continuous performance regression in the face of accumulated concept drifts over time. To address this limitation, we present a novel approach, Concept \\textbf{D}rift \\textbf{D}etection an\\textbf{D} \\textbf{A}daptation (D3A), that first detects drifting conception and then aggressively adapts the current model to the drifted concepts after the detection for rapid adaption. To best harness the utility of historical data for model adaptation, we propose a data augmentation strategy introducing Gaussian noise into existing training instances. It helps mitigate the data distribution gap, a critical factor contributing to train-test performance in",
    "path": "papers/24/03/2403.14949.json",
    "total_tokens": 886,
    "translated_title": "在在线时间序列预测中解决概念漂移：先检测再调整",
    "translated_abstract": "时间序列预测模型的在线更新旨在通过基于流数据调整预测模型来解决概念漂移的挑战。尽管已经发展了许多算法，但大多数算法侧重于模型设计和更新。实际上，许多方法在面对随时间累积的概念漂移时，很难保持持续的性能。为解决这一局限性，我们提出了一种新方法，称为概念漂移检测和适应（D3A），该方法首先检测漂移概念，然后在检测后积极调整当前模型以适应漂移的概念，实现快速适应。为了最大程度地利用历史数据进行模型适应，我们提出了一种数据增强策略，将高斯噪声引入现有训练实例。这有助于缓解数据分布差距，这是影响训练 - 测试性能的关键因素。",
    "tldr": "提出了一种名为Concept Drift Detection and Adaptation（D3A）的新方法，通过检测漂移概念并在检测后积极调整模型来解决在线时间序列预测中遇到的概念漂移问题。",
    "en_tdlr": "A new approach named Concept Drift Detection and Adaptation (D3A) is proposed to address the concept shift in online time series forecasting by detecting drifting conception and aggressively adapting the model after detection."
}