{
    "title": "NeuroLGP-SM: A Surrogate-assisted Neuroevolution Approach using Linear Genetic Programming",
    "abstract": "arXiv:2403.19459v1 Announce Type: cross  Abstract: Evolutionary algorithms are increasingly recognised as a viable computational approach for the automated optimisation of deep neural networks (DNNs) within artificial intelligence. This method extends to the training of DNNs, an approach known as neuroevolution. However, neuroevolution is an inherently resource-intensive process, with certain studies reporting the consumption of thousands of GPU days for refining and training a single DNN network. To address the computational challenges associated with neuroevolution while still attaining good DNN accuracy, surrogate models emerge as a pragmatic solution. Despite their potential, the integration of surrogate models into neuroevolution is still in its early stages, hindered by factors such as the effective use of high-dimensional data and the representation employed in neuroevolution. In this context, we address these challenges by employing a suitable representation based on Linear Gen",
    "link": "https://arxiv.org/abs/2403.19459",
    "context": "Title: NeuroLGP-SM: A Surrogate-assisted Neuroevolution Approach using Linear Genetic Programming\nAbstract: arXiv:2403.19459v1 Announce Type: cross  Abstract: Evolutionary algorithms are increasingly recognised as a viable computational approach for the automated optimisation of deep neural networks (DNNs) within artificial intelligence. This method extends to the training of DNNs, an approach known as neuroevolution. However, neuroevolution is an inherently resource-intensive process, with certain studies reporting the consumption of thousands of GPU days for refining and training a single DNN network. To address the computational challenges associated with neuroevolution while still attaining good DNN accuracy, surrogate models emerge as a pragmatic solution. Despite their potential, the integration of surrogate models into neuroevolution is still in its early stages, hindered by factors such as the effective use of high-dimensional data and the representation employed in neuroevolution. In this context, we address these challenges by employing a suitable representation based on Linear Gen",
    "path": "papers/24/03/2403.19459.json",
    "total_tokens": 880,
    "translated_title": "NeuroLGP-SM：使用线性遗传规划的辅助神经进化方法",
    "translated_abstract": "进化算法越来越被认为是一种可行的计算方法，用于在人工智能领域自动优化深度神经网络（DNNs）。这种方法延伸到DNNs的训练，即所谓的神经进化方法。然而，神经进化是一个固有的资源密集型过程，某些研究报告称为改进和训练单个DNN网络消耗了数千个GPU天。为了解决与神经进化相关的计算挑战，同时仍然获得良好的DNN准确性，代理模型出现作为一个切实可行的解决方案。尽管代理模型有潜力，但是将代理模型整合到神经进化中仍处于起步阶段，受到诸如高维数据的有效利用和神经进化中采用的表示等因素的阻碍。在这个背景下，我们通过使用基于线性遗传规划的适当表示来解决这些挑战。",
    "tldr": "使用线性遗传规划作为表示，NeuroLGP-SM 提出了一种利用代理模型辅助神经进化的方法，以应对神经进化的计算挑战，同时保持良好的DNN准确性。",
    "en_tdlr": "Utilizing linear genetic programming as representation, NeuroLGP-SM introduces a surrogate-assisted neuroevolution approach to tackle computational challenges of neuroevolution while maintaining good DNN accuracy."
}