{
    "title": "NN-Defined Modulator: Reconfigurable and Portable Software Modulator on IoT Gateways",
    "abstract": "arXiv:2403.09861v1 Announce Type: cross  Abstract: A physical-layer modulator is a vital component for an IoT gateway to map the symbols to signals. However, due to the soldered hardware chipsets on the gateway's motherboards or the diverse toolkits on different platforms for the software radio, the existing solutions either have limited extensibility or are platform-specific. Such limitation is hard to ignore when modulation schemes and hardware platforms have become extremely diverse. This paper presents a new paradigm of using neural networks as an abstraction layer for physical layer modulators in IoT gateway devices, referred to as NN-defined modulators. Our approach addresses the challenges of extensibility and portability for multiple technologies on various hardware platforms. The proposed NN-defined modulator uses a model-driven methodology rooted in solid mathematical foundations while having native support for hardware acceleration and portability to heterogeneous platforms.",
    "link": "https://arxiv.org/abs/2403.09861",
    "context": "Title: NN-Defined Modulator: Reconfigurable and Portable Software Modulator on IoT Gateways\nAbstract: arXiv:2403.09861v1 Announce Type: cross  Abstract: A physical-layer modulator is a vital component for an IoT gateway to map the symbols to signals. However, due to the soldered hardware chipsets on the gateway's motherboards or the diverse toolkits on different platforms for the software radio, the existing solutions either have limited extensibility or are platform-specific. Such limitation is hard to ignore when modulation schemes and hardware platforms have become extremely diverse. This paper presents a new paradigm of using neural networks as an abstraction layer for physical layer modulators in IoT gateway devices, referred to as NN-defined modulators. Our approach addresses the challenges of extensibility and portability for multiple technologies on various hardware platforms. The proposed NN-defined modulator uses a model-driven methodology rooted in solid mathematical foundations while having native support for hardware acceleration and portability to heterogeneous platforms.",
    "path": "papers/24/03/2403.09861.json",
    "total_tokens": 870,
    "translated_title": "基于神经网络的调制器：IoT网关上可重构和可移植的软件调制器",
    "translated_abstract": "用户物联网（IoT）网关的物理层调制器是将符号映射到信号的重要组件。然而，由于网关主板上焊接的硬件芯片组件或不同平台上软件无线电的多样化工具包，现有解决方案要么具有有限的可扩展性，要么特定于平台。在调制方案和硬件平台变得极为多样化的情况下，这种限制很难忽视。本文提出了一种新的范式，即在IoT网关设备中使用神经网络作为物理层调制器的抽象层，称为NN-defined modulators。我们的方法解决了在各种硬件平台上实现多种技术的可扩展性和可移植性方面的挑战。所提出的NN-defined modulator使用根植于坚实数学基础的模型驱动方法论，同时具有对硬件加速的本地支持，可移植到异构平台。",
    "tldr": "使用神经网络作为IoT网关设备中物理层调制器的抽象层，解决了可扩展性和可移植性方面的挑战，并具有硬件加速和异构平台移植的支持。",
    "en_tdlr": "Utilizing neural networks as an abstraction layer for physical layer modulators in IoT gateway devices addresses challenges of extensibility and portability, with native hardware acceleration support and portability to heterogeneous platforms."
}