{
    "title": "FUELVISION: A Multimodal Data Fusion and Multimodel Ensemble Algorithm for Wildfire Fuels Mapping",
    "abstract": "arXiv:2403.15462v1 Announce Type: cross  Abstract: Accurate assessment of fuel conditions is a prerequisite for fire ignition and behavior prediction, and risk management. The method proposed herein leverages diverse data sources including Landsat-8 optical imagery, Sentinel-1 (C-band) Synthetic Aperture Radar (SAR) imagery, PALSAR (L-band) SAR imagery, and terrain features to capture comprehensive information about fuel types and distributions. An ensemble model was trained to predict landscape-scale fuels such as the 'Scott and Burgan 40' using the as-received Forest Inventory and Analysis (FIA) field survey plot data obtained from the USDA Forest Service. However, this basic approach yielded relatively poor results due to the inadequate amount of training data. Pseudo-labeled and fully synthetic datasets were developed using generative AI approaches to address the limitations of ground truth data availability. These synthetic datasets were used for augmenting the FIA data from Calif",
    "link": "https://arxiv.org/abs/2403.15462",
    "context": "Title: FUELVISION: A Multimodal Data Fusion and Multimodel Ensemble Algorithm for Wildfire Fuels Mapping\nAbstract: arXiv:2403.15462v1 Announce Type: cross  Abstract: Accurate assessment of fuel conditions is a prerequisite for fire ignition and behavior prediction, and risk management. The method proposed herein leverages diverse data sources including Landsat-8 optical imagery, Sentinel-1 (C-band) Synthetic Aperture Radar (SAR) imagery, PALSAR (L-band) SAR imagery, and terrain features to capture comprehensive information about fuel types and distributions. An ensemble model was trained to predict landscape-scale fuels such as the 'Scott and Burgan 40' using the as-received Forest Inventory and Analysis (FIA) field survey plot data obtained from the USDA Forest Service. However, this basic approach yielded relatively poor results due to the inadequate amount of training data. Pseudo-labeled and fully synthetic datasets were developed using generative AI approaches to address the limitations of ground truth data availability. These synthetic datasets were used for augmenting the FIA data from Calif",
    "path": "papers/24/03/2403.15462.json",
    "total_tokens": 891,
    "translated_title": "FUELVISION: 一种用于野火燃料映射的多模态数据融合和多模型集成算法",
    "translated_abstract": "燃料条件的准确评估是预测火灾点燃和行为以及风险管理的前提条件。本文提出的方法利用包括Landsat-8光学影像、两种SAR（合成孔径雷达）影像Sentinel-1（C波段）和PALSAR（L波段）以及地形特征在内的各种数据源，捕获燃料类型和分布的综合信息。通过训练集成模型来预测类似“Scott and Burgan 40”这样的景观尺度燃料，使用美国农业部林务局获得的森林清查与分析（FIA）田间调查地块数据。然而，由于训练数据量不足，这种基本方法产生了相对较差的结果。针对地面真实数据可用性的限制，使用生成式人工智能方法开发了伪标记和完全合成数据集。这些合成数据集被用于增强来自加利福尼亚",
    "tldr": "通过多模态数据融合和多模型集成方法，采用生成式人工智能技术开发伪标记和完全合成数据集，以提高野火燃料映射的准确性。",
    "en_tdlr": "The paper proposes a method for accurate wildfire fuels mapping by leveraging multimodal data fusion, ensemble modeling, and generative AI for developing pseudo-labeled and fully synthetic datasets."
}