{
    "title": "RG-CAT: Detection Pipeline and Catalogue of Radio Galaxies in the EMU Pilot Survey",
    "abstract": "arXiv:2403.14235v1 Announce Type: cross  Abstract: We present source detection and catalogue construction pipelines to build the first catalogue of radio galaxies from the 270 $\\rm deg^2$ pilot survey of the Evolutionary Map of the Universe (EMU-PS) conducted with the Australian Square Kilometre Array Pathfinder (ASKAP) telescope. The detection pipeline uses Gal-DINO computer-vision networks (Gupta et al., 2024) to predict the categories of radio morphology and bounding boxes for radio sources, as well as their potential infrared host positions. The Gal-DINO network is trained and evaluated on approximately 5,000 visually inspected radio galaxies and their infrared hosts, encompassing both compact and extended radio morphologies. We find that the Intersection over Union (IoU) for the predicted and ground truth bounding boxes is larger than 0.5 for 99% of the radio sources, and 98% of predicted host positions are within $3^{\\prime \\prime}$ of the ground truth infrared host in the evalua",
    "link": "https://arxiv.org/abs/2403.14235",
    "context": "Title: RG-CAT: Detection Pipeline and Catalogue of Radio Galaxies in the EMU Pilot Survey\nAbstract: arXiv:2403.14235v1 Announce Type: cross  Abstract: We present source detection and catalogue construction pipelines to build the first catalogue of radio galaxies from the 270 $\\rm deg^2$ pilot survey of the Evolutionary Map of the Universe (EMU-PS) conducted with the Australian Square Kilometre Array Pathfinder (ASKAP) telescope. The detection pipeline uses Gal-DINO computer-vision networks (Gupta et al., 2024) to predict the categories of radio morphology and bounding boxes for radio sources, as well as their potential infrared host positions. The Gal-DINO network is trained and evaluated on approximately 5,000 visually inspected radio galaxies and their infrared hosts, encompassing both compact and extended radio morphologies. We find that the Intersection over Union (IoU) for the predicted and ground truth bounding boxes is larger than 0.5 for 99% of the radio sources, and 98% of predicted host positions are within $3^{\\prime \\prime}$ of the ground truth infrared host in the evalua",
    "path": "papers/24/03/2403.14235.json",
    "total_tokens": 868,
    "translated_title": "RG-CAT: EMU Pilot Survey中天体检测管线和无线电星系目录",
    "translated_abstract": "我们提出了源检测和目录构建管线，以构建通过澳大利亚平方千米阵列探测器（ASKAP）望远镜进行的Evolutionary Map of the Universe（EMU-PS）270 $\\rm deg^2$试验观测的第一个无线电星系目录。检测管线使用Gal-DINO计算机视觉网络（Gupta等人，2024年）来预测无线电源的类别和边界框，以及它们潜在的红外主机位置。Gal-DINO网络在大约5,000个经过视觉检验的无线电星系及其红外主机上进行训练和评估，包括紧凑和扩展的无线电形态。我们发现，对于99%的无线电源，预测和真值边界框的交集超过0.5，98%的预测主机位置与真值红外主机在评估中距离小于$3^{\\prime \\prime}$。",
    "tldr": "通过Gal-DINO计算机视觉网络，我们建立了EMU Pilot Survey中的射电星系目录，可高效预测无线电源形态、位置和红外主机信息。",
    "en_tdlr": "We present a detection pipeline using Gal-DINO computer-vision networks to efficiently build a catalogue of radio galaxies in the EMU Pilot Survey, predicting radio morphology, positions, and potential infrared hosts."
}