{
    "title": "Counterfactual Reasoning with Knowledge Graph Embeddings",
    "abstract": "arXiv:2403.06936v1 Announce Type: cross  Abstract: Knowledge graph embeddings (KGEs) were originally developed to infer true but missing facts in incomplete knowledge repositories. In this paper, we link knowledge graph completion and counterfactual reasoning via our new task CFKGR. We model the original world state as a knowledge graph, hypothetical scenarios as edges added to the graph, and plausible changes to the graph as inferences from logical rules. We create corresponding benchmark datasets, which contain diverse hypothetical scenarios with plausible changes to the original knowledge graph and facts that should be retained. We develop COULDD, a general method for adapting existing knowledge graph embeddings given a hypothetical premise, and evaluate it on our benchmark. Our results indicate that KGEs learn patterns in the graph without explicit training. We further observe that KGEs adapted with COULDD solidly detect plausible counterfactual changes to the graph that follow the",
    "link": "https://arxiv.org/abs/2403.06936",
    "context": "Title: Counterfactual Reasoning with Knowledge Graph Embeddings\nAbstract: arXiv:2403.06936v1 Announce Type: cross  Abstract: Knowledge graph embeddings (KGEs) were originally developed to infer true but missing facts in incomplete knowledge repositories. In this paper, we link knowledge graph completion and counterfactual reasoning via our new task CFKGR. We model the original world state as a knowledge graph, hypothetical scenarios as edges added to the graph, and plausible changes to the graph as inferences from logical rules. We create corresponding benchmark datasets, which contain diverse hypothetical scenarios with plausible changes to the original knowledge graph and facts that should be retained. We develop COULDD, a general method for adapting existing knowledge graph embeddings given a hypothetical premise, and evaluate it on our benchmark. Our results indicate that KGEs learn patterns in the graph without explicit training. We further observe that KGEs adapted with COULDD solidly detect plausible counterfactual changes to the graph that follow the",
    "path": "papers/24/03/2403.06936.json",
    "total_tokens": 898,
    "translated_title": "使用知识图嵌入进行反事实推理",
    "translated_abstract": "知识图嵌入（KGEs）最初是为了推断不完整知识库中缺失的真实事实而开发的。本文通过我们的新任务CFKGR将知识图补全和反事实推理联系起来。我们将原始世界状态建模为知识图，假设情景为添加到图中的边，对图的合理变化为逻辑规则推理的结果。我们创建了相应的基准数据集，其中包含各种假设情景及对原始知识图的合理改变以及应该保留的事实。我们开发了COULDD，一种针对特定假设前提调整现有知识图嵌入的通用方法，并在我们的基准上进行评估。我们的结果表明，KGEs可以在没有显式训练的情况下从图中学习模式。我们进一步观察到，通过COULDD调整后的KGEs可以可靠地检测出遵循逻辑规则的图的合理反事实变化。",
    "tldr": "通过新任务CFKGR，本文将知识图补全和反事实推理联系起来，提出了一种用于适应假设前提的知识图嵌入方法COULDD，并通过基准数据集的评估表明KGEs可以学习图中的模式，检测出合理的反事实变化。",
    "en_tdlr": "This paper links knowledge graph completion and counterfactual reasoning through a new task CFKGR, proposes a knowledge graph embedding method COULDD for adapting to hypothetical premises, and shows through benchmark evaluation that KGEs can learn patterns in the graph and detect plausible counterfactual changes."
}