{
    "title": "Unknown Domain Inconsistency Minimization for Domain Generalization",
    "abstract": "arXiv:2403.07329v1 Announce Type: new  Abstract: The objective of domain generalization (DG) is to enhance the transferability of the model learned from a source domain to unobserved domains. To prevent overfitting to a specific domain, Sharpness-Aware Minimization (SAM) reduces source domain's loss sharpness. Although SAM variants have delivered significant improvements in DG, we highlight that there's still potential for improvement in generalizing to unknown domains through the exploration on data space. This paper introduces an objective rooted in both parameter and data perturbed regions for domain generalization, coined Unknown Domain Inconsistency Minimization (UDIM). UDIM reduces the loss landscape inconsistency between source domain and unknown domains. As unknown domains are inaccessible, these domains are empirically crafted by perturbing instances from the source domain dataset. In particular, by aligning the loss landscape acquired in the source domain to the loss landscap",
    "link": "https://arxiv.org/abs/2403.07329",
    "context": "Title: Unknown Domain Inconsistency Minimization for Domain Generalization\nAbstract: arXiv:2403.07329v1 Announce Type: new  Abstract: The objective of domain generalization (DG) is to enhance the transferability of the model learned from a source domain to unobserved domains. To prevent overfitting to a specific domain, Sharpness-Aware Minimization (SAM) reduces source domain's loss sharpness. Although SAM variants have delivered significant improvements in DG, we highlight that there's still potential for improvement in generalizing to unknown domains through the exploration on data space. This paper introduces an objective rooted in both parameter and data perturbed regions for domain generalization, coined Unknown Domain Inconsistency Minimization (UDIM). UDIM reduces the loss landscape inconsistency between source domain and unknown domains. As unknown domains are inaccessible, these domains are empirically crafted by perturbing instances from the source domain dataset. In particular, by aligning the loss landscape acquired in the source domain to the loss landscap",
    "path": "papers/24/03/2403.07329.json",
    "total_tokens": 886,
    "translated_title": "未知领域不一致性最小化的域泛化方法",
    "translated_abstract": "领域泛化（DG）的目标是增强从源领域学得的模型对未观测领域的可迁移性。为了防止对特定领域的过拟合，Sharpness-Aware Minimization（SAM）减少源领域的损失尖锐度。尽管SAM的变种在DG中取得了显著的改进，但我们指出，在数据空间中仍有潜力通过探索来提高对未知领域的泛化能力。本文介绍了一种根植于参数和数据扰动区域的领域泛化目标，命名为未知领域不一致性最小化（UDIM）。UDIM减少了源领域和未知领域之间的损失景观不一致性。由于无法访问未知领域，这些域是通过扰动源领域数据集中的实例来经验性地构建的。具体来说，通过将在源领域中获得的损失景观与损失景观对齐",
    "tldr": "该论文提出了一种名为未知领域不一致性最小化（UDIM）的方法，通过降低源领域和未知领域之间的损失景观不一致性来改善领域泛化。"
}