{
    "title": "New Intent Discovery with Attracting and Dispersing Prototype",
    "abstract": "arXiv:2403.16913v1 Announce Type: new  Abstract: New Intent Discovery (NID) aims to recognize known and infer new intent categories with the help of limited labeled and large-scale unlabeled data. The task is addressed as a feature-clustering problem and recent studies augment instance representation. However, existing methods fail to capture cluster-friendly representations, since they show less capability to effectively control and coordinate within-cluster and between-cluster distances. Tailored to the NID problem, we propose a Robust and Adaptive Prototypical learning (RAP) framework for globally distinct decision boundaries for both known and new intent categories. Specifically, a robust prototypical attracting learning (RPAL) method is designed to compel instances to gravitate toward their corresponding prototype, achieving greater within-cluster compactness. To attain larger between-cluster separation, another adaptive prototypical dispersing learning (APDL) method is devised to",
    "link": "https://arxiv.org/abs/2403.16913",
    "context": "Title: New Intent Discovery with Attracting and Dispersing Prototype\nAbstract: arXiv:2403.16913v1 Announce Type: new  Abstract: New Intent Discovery (NID) aims to recognize known and infer new intent categories with the help of limited labeled and large-scale unlabeled data. The task is addressed as a feature-clustering problem and recent studies augment instance representation. However, existing methods fail to capture cluster-friendly representations, since they show less capability to effectively control and coordinate within-cluster and between-cluster distances. Tailored to the NID problem, we propose a Robust and Adaptive Prototypical learning (RAP) framework for globally distinct decision boundaries for both known and new intent categories. Specifically, a robust prototypical attracting learning (RPAL) method is designed to compel instances to gravitate toward their corresponding prototype, achieving greater within-cluster compactness. To attain larger between-cluster separation, another adaptive prototypical dispersing learning (APDL) method is devised to",
    "path": "papers/24/03/2403.16913.json",
    "total_tokens": 843,
    "translated_title": "具有吸引和分散原型的新意图发现",
    "translated_abstract": "新意图发现旨在利用有限标记和大规模未标记数据，识别已知和推断新的意图类别。本文将任务视为特征聚类问题，并增强了实例表示。为解决现有方法无法捕捉友好聚类表示的问题，我们针对NID问题提出了一个具有全局明显决策边界的健壮且自适应的原型学习（RAP）框架，用于已知和新的意图类别。具体而言，设计了一种鲁棒的原型吸引学习（RPAL）方法，以促使实例向其对应的原型靠拢，实现更大的簇内紧凑性。为实现更大的簇间分离度，另一个自适应的原型分散学习（APDL）方法被设计为",
    "tldr": "提出了针对新意图发现问题的Robust and Adaptive Prototypical learning (RAP)框架，通过健壮的原型吸引学习(RPAL)和自适应的原型分散学习(APDL)方法，在已知和新的意图类别之间实现全局明显的决策边界。",
    "en_tdlr": "Proposed a Robust and Adaptive Prototypical learning (RAP) framework tailored to New Intent Discovery (NID) problem, achieving globally distinct decision boundaries for both known and new intent categories through robust prototypical attracting learning (RPAL) and adaptive prototypical dispersing learning (APDL) methods."
}