{
    "title": "Designing Poisson Integrators Through Machine Learning",
    "abstract": "arXiv:2403.20139v1 Announce Type: cross  Abstract: This paper presents a general method to construct Poisson integrators, i.e., integrators that preserve the underlying Poisson geometry. We assume the Poisson manifold is integrable, meaning there is a known local symplectic groupoid for which the Poisson manifold serves as the set of units. Our constructions build upon the correspondence between Poisson diffeomorphisms and Lagrangian bisections, which allows us to reformulate the design of Poisson integrators as solutions to a certain PDE (Hamilton-Jacobi). The main novelty of this work is to understand the Hamilton-Jacobi PDE as an optimization problem, whose solution can be easily approximated using machine learning related techniques. This research direction aligns with the current trend in the PDE and machine learning communities, as initiated by Physics- Informed Neural Networks, advocating for designs that combine both physical modeling (the Hamilton-Jacobi PDE) and data.",
    "link": "https://arxiv.org/abs/2403.20139",
    "context": "Title: Designing Poisson Integrators Through Machine Learning\nAbstract: arXiv:2403.20139v1 Announce Type: cross  Abstract: This paper presents a general method to construct Poisson integrators, i.e., integrators that preserve the underlying Poisson geometry. We assume the Poisson manifold is integrable, meaning there is a known local symplectic groupoid for which the Poisson manifold serves as the set of units. Our constructions build upon the correspondence between Poisson diffeomorphisms and Lagrangian bisections, which allows us to reformulate the design of Poisson integrators as solutions to a certain PDE (Hamilton-Jacobi). The main novelty of this work is to understand the Hamilton-Jacobi PDE as an optimization problem, whose solution can be easily approximated using machine learning related techniques. This research direction aligns with the current trend in the PDE and machine learning communities, as initiated by Physics- Informed Neural Networks, advocating for designs that combine both physical modeling (the Hamilton-Jacobi PDE) and data.",
    "path": "papers/24/03/2403.20139.json",
    "total_tokens": 890,
    "translated_title": "通过机器学习设计泊松积分器",
    "translated_abstract": "本文提出了一种构建泊松积分器的通用方法，即保留基础泊松几何的积分器。我们假设泊松流形是可积的，这意味着存在已知的局部辛群体，泊松流形作为单位的集合。我们的构造建立在泊松微分同胚和拉格朗日切分之间的对应关系之上，这使得我们可以将泊松积分器的设计重新表述为对某个特定PDE（哈密顿-雅可比）的解。这项工作的主要创新在于将哈密顿-雅可比PDE理解为一个优化问题，其解可以通过机器学习相关技术轻松近似。这个研究方向与当前PDE和机器学习社区的趋势相一致，如由物理启发的神经网络所发起，倡导结合物理建模（哈密顿-雅可比PDE）和数据的设计。",
    "tldr": "本文通过机器学习技术，将泊松积分器的设计理解为解决特定PDE问题的优化过程，实现了对哈密顿-雅可比PDE的简单近似，结合了物理建模和数据的设计趋势。",
    "en_tdlr": "This paper presents a method to construct Poisson integrators using machine learning techniques, reformulating the design as an optimization process for solving a specific PDE, enabling a simple approximation of the Hamilton-Jacobi PDE and combining the trend of physical modeling with data-driven designs."
}