{
    "title": "Robust Inference in Locally Misspecified Bipartite Networks",
    "abstract": "arXiv:2403.13725v1 Announce Type: new  Abstract: This paper introduces a methodology to conduct robust inference in bipartite networks under local misspecification. We focus on a class of dyadic network models with misspecified conditional moment restrictions. The framework of misspecification is local, as the effect of misspecification varies with the sample size. We utilize this local asymptotic approach to construct a robust estimator that is minimax optimal for the mean square error within a neighborhood of misspecification. Additionally, we introduce bias-aware confidence intervals that account for the effect of the local misspecification. These confidence intervals have the correct asymptotic coverage for the true parameter of interest under sparse network asymptotics. Monte Carlo experiments demonstrate that the robust estimator performs well in finite samples and sparse networks. As an empirical illustration, we study the formation of a scientific collaboration network among ec",
    "link": "https://arxiv.org/abs/2403.13725",
    "context": "Title: Robust Inference in Locally Misspecified Bipartite Networks\nAbstract: arXiv:2403.13725v1 Announce Type: new  Abstract: This paper introduces a methodology to conduct robust inference in bipartite networks under local misspecification. We focus on a class of dyadic network models with misspecified conditional moment restrictions. The framework of misspecification is local, as the effect of misspecification varies with the sample size. We utilize this local asymptotic approach to construct a robust estimator that is minimax optimal for the mean square error within a neighborhood of misspecification. Additionally, we introduce bias-aware confidence intervals that account for the effect of the local misspecification. These confidence intervals have the correct asymptotic coverage for the true parameter of interest under sparse network asymptotics. Monte Carlo experiments demonstrate that the robust estimator performs well in finite samples and sparse networks. As an empirical illustration, we study the formation of a scientific collaboration network among ec",
    "path": "papers/24/03/2403.13725.json",
    "total_tokens": 859,
    "translated_title": "局部错误指定的二分网络中的稳健推断",
    "translated_abstract": "本文介绍了一种在局部错误指定条件下在二分网络中进行稳健推断的方法。我们专注于一类具有错误指定条件矩限制的二元网络模型。错误指定的框架是局部的，因为错误指定的影响随样本大小变化而变化。我们利用这种局部渐近方法构建了一个在错误指定邻域内具有极小化最小平方误差的稳健估计量。此外，我们介绍了考虑局部错误指定效应的偏差感知置信区间。这些置信区间在稀疏网络渐近条件下对于真实感兴趣参数具有正确的渐近覆盖。蒙特卡洛实验展示了稳健估计在有限样本和稀疏网络中的良好性能。作为实证说明，我们研究了生态学中科学合作网络的形成。",
    "tldr": "介绍了一种在局部错误指定条件下在二分网络中进行稳健推断的方法，提出了局部渐近方法构建的稳健估计量和偏差感知置信区间，具有在稀疏网络渐近条件下对真实参数正确的渐近覆盖。",
    "en_tdlr": "Introduces a methodology for robust inference in bipartite networks under local misspecification, proposing a robust estimator and bias-aware confidence intervals constructed using a local asymptotic approach, with correct asymptotic coverage for the true parameter under sparse network asymptotics."
}