{
    "title": "Diffusion-based Generative Prior for Low-Complexity MIMO Channel Estimation",
    "abstract": "arXiv:2403.03545v1 Announce Type: cross  Abstract: This work proposes a novel channel estimator based on diffusion models (DMs), one of the currently top-rated generative models. Contrary to related works utilizing generative priors, a lightweight convolutional neural network (CNN) with positional embedding of the signal-to-noise ratio (SNR) information is designed by learning the channel distribution in the sparse angular domain. Combined with an estimation strategy that avoids stochastic resampling and truncates reverse diffusion steps that account for lower SNR than the given pilot observation, the resulting DM estimator has both low complexity and memory overhead. Numerical results exhibit better performance than state-of-the-art channel estimators utilizing generative priors.",
    "link": "https://arxiv.org/abs/2403.03545",
    "context": "Title: Diffusion-based Generative Prior for Low-Complexity MIMO Channel Estimation\nAbstract: arXiv:2403.03545v1 Announce Type: cross  Abstract: This work proposes a novel channel estimator based on diffusion models (DMs), one of the currently top-rated generative models. Contrary to related works utilizing generative priors, a lightweight convolutional neural network (CNN) with positional embedding of the signal-to-noise ratio (SNR) information is designed by learning the channel distribution in the sparse angular domain. Combined with an estimation strategy that avoids stochastic resampling and truncates reverse diffusion steps that account for lower SNR than the given pilot observation, the resulting DM estimator has both low complexity and memory overhead. Numerical results exhibit better performance than state-of-the-art channel estimators utilizing generative priors.",
    "path": "papers/24/03/2403.03545.json",
    "total_tokens": 868,
    "translated_title": "基于扩散模型的低复杂度MIMO信道估计的生成先验",
    "translated_abstract": "本文提出了一种基于扩散模型（DMs）的新型信道估计器，这是目前评价最高的生成模型之一。与利用生成先验的相关工作相反，设计了一个轻量级的卷积神经网络（CNN），该网络通过学习稀疏角域中的信噪比（SNR）信息的位置嵌入来设计了一个轻量级的卷积神经网络（CNN）。结合一个避免随机重采样的估计策略，并截断用于解释比给定导频观察更低信噪比的反向扩散步骤，导致的DM信道估计器具有低复杂性和内存开销。 数值结果表明，与利用生成先验的最先进信道估计器相比，DM估计器表现更好。",
    "tldr": "提出了一种基于扩散模型的低复杂度MIMO信道估计器，通过设计轻量级CNN和位置嵌入的学习方法，实现了在稀疏角域中对信道分布进行估计，并采用避免随机重采样的估计策略，以及截断反向扩散步骤的策略，取得了低复杂度和内存开销的效果。",
    "en_tdlr": "A diffusion-based low-complexity MIMO channel estimator is proposed in this work, which utilizes a lightweight CNN with positional embedding for learning channel distribution in the sparse angular domain, along with an estimation strategy avoiding stochastic resampling and truncating reverse diffusion steps for achieving low complexity and memory overhead."
}