{
    "title": "FRESCO: Federated Reinforcement Energy System for Cooperative Optimization",
    "abstract": "arXiv:2403.18444v1 Announce Type: new  Abstract: The rise in renewable energy is creating new dynamics in the energy grid that promise to create a cleaner and more participative energy grid, where technology plays a crucial part in making the required flexibility to achieve the vision of the next-generation grid. This work presents FRESCO, a framework that aims to ease the implementation of energy markets using a hierarchical control architecture of reinforcement learning agents trained using federated learning. The core concept we are proving is that having greedy agents subject to changing conditions from a higher level agent creates a cooperative setup that will allow for fulfilling all the individual objectives. This paper presents a general overview of the framework, the current progress, and some insights we obtained from the recent results.",
    "link": "https://arxiv.org/abs/2403.18444",
    "context": "Title: FRESCO: Federated Reinforcement Energy System for Cooperative Optimization\nAbstract: arXiv:2403.18444v1 Announce Type: new  Abstract: The rise in renewable energy is creating new dynamics in the energy grid that promise to create a cleaner and more participative energy grid, where technology plays a crucial part in making the required flexibility to achieve the vision of the next-generation grid. This work presents FRESCO, a framework that aims to ease the implementation of energy markets using a hierarchical control architecture of reinforcement learning agents trained using federated learning. The core concept we are proving is that having greedy agents subject to changing conditions from a higher level agent creates a cooperative setup that will allow for fulfilling all the individual objectives. This paper presents a general overview of the framework, the current progress, and some insights we obtained from the recent results.",
    "path": "papers/24/03/2403.18444.json",
    "total_tokens": 727,
    "translated_title": "FRESCO：合作优化的联邦强化能源系统",
    "translated_abstract": "随着可再生能源的兴起，能源网格中出现了新的动态，承诺创造一个更清洁、更参与式的能源网格，在这个网格中，技术在实现所需灵活性方面起着至关重要的作用，以实现下一代网格的愿景。本文介绍了FRESCO，一个旨在通过使用强化学习代理的分层控制架构来简化能源市场实施的框架。我们证明的核心概念是，让贪婪代理受高级代理变化的条件支配，创造出一个合作设置，这将允许实现所有个体目标。",
    "tldr": "FRESCO是一个旨在通过使用强化学习代理的分层控制架构来简化能源市场实施的框架，核心概念是创建一个合作设置，使各个个体目标得以实现。",
    "en_tdlr": "FRESCO is a framework aimed at simplifying the implementation of energy markets using a hierarchical control architecture of reinforcement learning agents, with the core concept of creating a cooperative setup to achieve individual objectives."
}