{
    "title": "HDReason: Algorithm-Hardware Codesign for Hyperdimensional Knowledge Graph Reasoning",
    "abstract": "arXiv:2403.05763v1 Announce Type: cross  Abstract: In recent times, a plethora of hardware accelerators have been put forth for graph learning applications such as vertex classification and graph classification. However, previous works have paid little attention to Knowledge Graph Completion (KGC), a task that is well-known for its significantly higher algorithm complexity. The state-of-the-art KGC solutions based on graph convolution neural network (GCN) involve extensive vertex/relation embedding updates and complicated score functions, which are inherently cumbersome for acceleration. As a result, existing accelerator designs are no longer optimal, and a novel algorithm-hardware co-design for KG reasoning is needed.   Recently, brain-inspired HyperDimensional Computing (HDC) has been introduced as a promising solution for lightweight machine learning, particularly for graph learning applications. In this paper, we leverage HDC for an intrinsically more efficient and acceleration-fri",
    "link": "https://arxiv.org/abs/2403.05763",
    "context": "Title: HDReason: Algorithm-Hardware Codesign for Hyperdimensional Knowledge Graph Reasoning\nAbstract: arXiv:2403.05763v1 Announce Type: cross  Abstract: In recent times, a plethora of hardware accelerators have been put forth for graph learning applications such as vertex classification and graph classification. However, previous works have paid little attention to Knowledge Graph Completion (KGC), a task that is well-known for its significantly higher algorithm complexity. The state-of-the-art KGC solutions based on graph convolution neural network (GCN) involve extensive vertex/relation embedding updates and complicated score functions, which are inherently cumbersome for acceleration. As a result, existing accelerator designs are no longer optimal, and a novel algorithm-hardware co-design for KG reasoning is needed.   Recently, brain-inspired HyperDimensional Computing (HDC) has been introduced as a promising solution for lightweight machine learning, particularly for graph learning applications. In this paper, we leverage HDC for an intrinsically more efficient and acceleration-fri",
    "path": "papers/24/03/2403.05763.json",
    "total_tokens": 800,
    "translated_title": "HDReason：超维知识图推理的算法-硬件协同设计",
    "translated_abstract": "最近，为图学习应用如顶点分类和图分类提出了大量硬件加速器。然而，先前的工作很少关注知识图补全（KGC），这是一项以其显著更高算法复杂性而闻名的任务。基于图卷积神经网络（GCN）的最先进KGC解决方案涉及广泛的顶点/关系嵌入更新和复杂的得分函数，这对加速来说是困难的。因此，现有的加速器设计不再是最佳选择，需要一种新颖的算法-硬件协同设计来进行KG推理。最近，受脑启发的超维计算（HDC）被引入作为轻量级机器学习的有前途的解决方案，特别适用于图学习应用。在本文中，我们利用HDC来实现一个固有更高效且适合加速的",
    "tldr": "本文提出了一种基于超维计算的算法-硬件协同设计，用于更高效和加速的知识图推理。"
}