{
    "title": "Homomorphic WiSARDs: Efficient Weightless Neural Network training over encrypted data",
    "abstract": "arXiv:2403.20190v1 Announce Type: cross  Abstract: The widespread application of machine learning algorithms is a matter of increasing concern for the data privacy research community, and many have sought to develop privacy-preserving techniques for it. Among existing approaches, the homomorphic evaluation of ML algorithms stands out by performing operations directly over encrypted data, enabling strong guarantees of confidentiality. The homomorphic evaluation of inference algorithms is practical even for relatively deep Convolution Neural Networks (CNNs). However, training is still a major challenge, with current solutions often resorting to lightweight algorithms that can be unfit for solving more complex problems, such as image recognition. This work introduces the homomorphic evaluation of Wilkie, Stonham, and Aleksander's Recognition Device (WiSARD) and subsequent Weightless Neural Networks (WNNs) for training and inference on encrypted data. Compared to CNNs, WNNs offer better pe",
    "link": "https://arxiv.org/abs/2403.20190",
    "context": "Title: Homomorphic WiSARDs: Efficient Weightless Neural Network training over encrypted data\nAbstract: arXiv:2403.20190v1 Announce Type: cross  Abstract: The widespread application of machine learning algorithms is a matter of increasing concern for the data privacy research community, and many have sought to develop privacy-preserving techniques for it. Among existing approaches, the homomorphic evaluation of ML algorithms stands out by performing operations directly over encrypted data, enabling strong guarantees of confidentiality. The homomorphic evaluation of inference algorithms is practical even for relatively deep Convolution Neural Networks (CNNs). However, training is still a major challenge, with current solutions often resorting to lightweight algorithms that can be unfit for solving more complex problems, such as image recognition. This work introduces the homomorphic evaluation of Wilkie, Stonham, and Aleksander's Recognition Device (WiSARD) and subsequent Weightless Neural Networks (WNNs) for training and inference on encrypted data. Compared to CNNs, WNNs offer better pe",
    "path": "papers/24/03/2403.20190.json",
    "total_tokens": 871,
    "translated_title": "Homomorphic WiSARDs: Efficient Weightless Neural Network training over encrypted data",
    "translated_abstract": "机器学习算法的广泛应用越来越受到数据隐私研究界的关注，许多人试图为其开发保护隐私的技术。在现有方法中，通过对加密数据直接执行操作的同态评估具有突出优点，可以提供强大的保密保障。推断算法的同态评估即使对于相对深的卷积神经网络(CNNs)也是实用的。然而, 训练仍然是一个主要挑战，目前的解决方案通常倾向于使用轻量级算法，这可能不适合解决更复杂的问题，如图像识别。本文介绍了对Wilkie, Stonham和Aleksander的Recognition Device (WiSARD)和随后的Weightless Neural Networks (WNNs)进行同态评估，用于加密数据的训练和推断。与CNNs相比，WNNs在性能上提供了更好的表现。",
    "tldr": "本文提出了对Wilkie, Stonham和Aleksander的Recognition Device (WiSARD)进行同态评估，然后用于加密数据的训练和推断Weightless Neural Networks (WNNs)的方法，相比较传统的CNNs，WNNs在性能上提供了更好的表现。",
    "en_tdlr": "This paper introduces the homomorphic evaluation of Wilkie, Stonham, and Aleksander's Recognition Device (WiSARD) followed by Weightless Neural Networks (WNNs) for training and inference on encrypted data, offering better performance compared to traditional CNNs."
}