{
    "title": "Verification-Aided Learning of Neural Network Barrier Functions with Termination Guarantees",
    "abstract": "arXiv:2403.07308v1 Announce Type: cross  Abstract: Barrier functions are a general framework for establishing a safety guarantee for a system. However, there is no general method for finding these functions. To address this shortcoming, recent approaches use self-supervised learning techniques to learn these functions using training data that are periodically generated by a verification procedure, leading to a verification-aided learning framework. Despite its immense potential in automating barrier function synthesis, the verification-aided learning framework does not have termination guarantees and may suffer from a low success rate of finding a valid barrier function in practice. In this paper, we propose a holistic approach to address these drawbacks. With a convex formulation of the barrier function synthesis, we propose to first learn an empirically well-behaved NN basis function and then apply a fine-tuning algorithm that exploits the convexity and counterexamples from the verif",
    "link": "https://arxiv.org/abs/2403.07308",
    "context": "Title: Verification-Aided Learning of Neural Network Barrier Functions with Termination Guarantees\nAbstract: arXiv:2403.07308v1 Announce Type: cross  Abstract: Barrier functions are a general framework for establishing a safety guarantee for a system. However, there is no general method for finding these functions. To address this shortcoming, recent approaches use self-supervised learning techniques to learn these functions using training data that are periodically generated by a verification procedure, leading to a verification-aided learning framework. Despite its immense potential in automating barrier function synthesis, the verification-aided learning framework does not have termination guarantees and may suffer from a low success rate of finding a valid barrier function in practice. In this paper, we propose a holistic approach to address these drawbacks. With a convex formulation of the barrier function synthesis, we propose to first learn an empirically well-behaved NN basis function and then apply a fine-tuning algorithm that exploits the convexity and counterexamples from the verif",
    "path": "papers/24/03/2403.07308.json",
    "total_tokens": 777,
    "translated_title": "使用验证辅助学习神经网络屏障函数并具有终止保证",
    "translated_abstract": "屏障函数是为系统建立安全保证的一般框架。然而，目前尚无通用方法找到这些函数。为了解决这一缺点，最近的方法使用自监督学习技术，通过由验证程序周期生成的训练数据来学习这些函数，从而导致一个具有验证辅助的学习框架。尽管验证辅助学习框架在自动合成屏障函数方面有巨大潜力，但该框架缺乏终止保证，并且在实践中可能在找到有效屏障函数的成功率方面存在问题。在本文中，我们提出了一种全面解决这些缺点的方法。通过对屏障函数合成的凸形式化，我们首先提出学习一个经验良好的NN基函数，然后应用一种利用凸性和验证中的反例的微调算法。",
    "tldr": "提出了一种使用验证辅助学习神经网络屏障函数的终止保证方法。",
    "en_tdlr": "Proposed an approach for using verification-aided learning of neural network barrier functions with termination guarantees."
}