{
    "title": "A Transfer Learning Causal Approach to Evaluate Racial/Ethnic and Geographic Variation in Outcomes Following Congenital Heart Surgery",
    "abstract": "arXiv:2403.14573v1 Announce Type: cross  Abstract: Congenital heart defects (CHD) are the most prevalent birth defects in the United States and surgical outcomes vary considerably across the country. The outcomes of treatment for CHD differ for specific patient subgroups, with non-Hispanic Black and Hispanic populations experiencing higher rates of mortality and morbidity. A valid comparison of outcomes within racial/ethnic subgroups is difficult given large differences in case-mix and small subgroup sizes. We propose a causal inference framework for outcome assessment and leverage advances in transfer learning to incorporate data from both target and source populations to help estimate causal effects while accounting for different sources of risk factor and outcome differences across populations. Using the Society of Thoracic Surgeons' Congenital Heart Surgery Database (STS-CHSD), we focus on a national cohort of patients undergoing the Norwood operation from 2016-2022 to assess opera",
    "link": "https://arxiv.org/abs/2403.14573",
    "context": "Title: A Transfer Learning Causal Approach to Evaluate Racial/Ethnic and Geographic Variation in Outcomes Following Congenital Heart Surgery\nAbstract: arXiv:2403.14573v1 Announce Type: cross  Abstract: Congenital heart defects (CHD) are the most prevalent birth defects in the United States and surgical outcomes vary considerably across the country. The outcomes of treatment for CHD differ for specific patient subgroups, with non-Hispanic Black and Hispanic populations experiencing higher rates of mortality and morbidity. A valid comparison of outcomes within racial/ethnic subgroups is difficult given large differences in case-mix and small subgroup sizes. We propose a causal inference framework for outcome assessment and leverage advances in transfer learning to incorporate data from both target and source populations to help estimate causal effects while accounting for different sources of risk factor and outcome differences across populations. Using the Society of Thoracic Surgeons' Congenital Heart Surgery Database (STS-CHSD), we focus on a national cohort of patients undergoing the Norwood operation from 2016-2022 to assess opera",
    "path": "papers/24/03/2403.14573.json",
    "total_tokens": 838,
    "translated_title": "一个传递学习因果方法来评估先天性心脏手术后结果的种族/民族和地理变异",
    "translated_abstract": "先天性心脏缺陷(CHD)是美国最常见的先天缺陷，手术结果在全国范围内变化很大。特定患者亚组的CHD治疗结果有所不同，非西班牙裔黑人和西班牙裔人口的死亡率和发病率较高。由于病例混合有很大差异和亚组规模较小，种族/民族亚组内结果的有效比较很困难。我们提出了一个因果推断框架用于结果评估，并利用传递学习的进展结合目标和源人群的数据，帮助估计因果效应，同时考虑跨人群不同风险因素和结果差异的来源。",
    "tldr": "提出了一个传递学习因果方法来评估先天性心脏手术后结果的种族/民族和地理变异，有助于在考虑不同人群风险因素和结果差异来源的情况下估计因果效应"
}