{
    "title": "Reflecting the Male Gaze: Quantifying Female Objectification in 19th and 20th Century Novels",
    "abstract": "arXiv:2403.17158v1 Announce Type: new  Abstract: Inspired by the concept of the male gaze (Mulvey, 1975) in literature and media studies, this paper proposes a framework for analyzing gender bias in terms of female objectification: the extent to which a text portrays female individuals as objects of visual pleasure. Our framework measures female objectification along two axes. First, we compute an agency bias score that indicates whether male entities are more likely to appear in the text as grammatical agents than female entities. Next, by analyzing the word embedding space induced by a text (Caliskan et al., 2017), we compute an appearance bias score that indicates whether female entities are more closely associated with appearance-related words than male entities. Applying our framework to 19th and 20th century novels reveals evidence of female objectification in literature: we find that novels written from a male perspective systematically objectify female characters, while novels ",
    "link": "https://arxiv.org/abs/2403.17158",
    "context": "Title: Reflecting the Male Gaze: Quantifying Female Objectification in 19th and 20th Century Novels\nAbstract: arXiv:2403.17158v1 Announce Type: new  Abstract: Inspired by the concept of the male gaze (Mulvey, 1975) in literature and media studies, this paper proposes a framework for analyzing gender bias in terms of female objectification: the extent to which a text portrays female individuals as objects of visual pleasure. Our framework measures female objectification along two axes. First, we compute an agency bias score that indicates whether male entities are more likely to appear in the text as grammatical agents than female entities. Next, by analyzing the word embedding space induced by a text (Caliskan et al., 2017), we compute an appearance bias score that indicates whether female entities are more closely associated with appearance-related words than male entities. Applying our framework to 19th and 20th century novels reveals evidence of female objectification in literature: we find that novels written from a male perspective systematically objectify female characters, while novels ",
    "path": "papers/24/03/2403.17158.json",
    "total_tokens": 865,
    "translated_title": "反映男性凝视：量化19世纪和20世纪小说中的女性客体化",
    "translated_abstract": "受到Mulvey（1975年）关于文学和媒体研究中男性凝视的概念的启发，本文提出了一个分析性别偏见的框架，即女性客体化的程度：文本中女性个体被描绘为视觉愉悦对象的程度。我们的框架沿着两个轴度衡量女性客体化。首先，我们计算一个代理偏见分数，指示男性实体是否比女性实体更有可能在文本中出现为语法代理。接下来，通过分析文本引发的词嵌入空间（Caliskan等，2017），我们计算一个外貌偏见分数，指示女性实体是否与外貌相关词汇更紧密地联系。将我们的框架应用于19世纪和20世纪的小说中揭示了文学中的女性客体化证据：我们发现从男性视角写作的小说系统性地将女性角色客体化，而小说...",
    "tldr": "通过提出量化女性客体化的框架，发现19世纪和20世纪小说中存在男性视角系统性对象化女性角色的证据",
    "en_tdlr": "Evidence of systematic objectification of female characters from a male perspective in 19th and 20th century novels is revealed by proposing a framework to quantify female objectification."
}