{
    "title": "Towards Multimodal Sentiment Analysis Debiasing via Bias Purification",
    "abstract": "arXiv:2403.05023v1 Announce Type: new  Abstract: Multimodal Sentiment Analysis (MSA) aims to understand human intentions by integrating emotion-related clues from diverse modalities, such as visual, language, and audio. Unfortunately, the current MSA task invariably suffers from unplanned dataset biases, particularly multimodal utterance-level label bias and word-level context bias. These harmful biases potentially mislead models to focus on statistical shortcuts and spurious correlations, causing severe performance bottlenecks. To alleviate these issues, we present a Multimodal Counterfactual Inference Sentiment (MCIS) analysis framework based on causality rather than conventional likelihood. Concretely, we first formulate a causal graph to discover harmful biases from already-trained vanilla models. In the inference phase, given a factual multimodal input, MCIS imagines two counterfactual scenarios to purify and mitigate these biases. Then, MCIS can make unbiased decisions from biase",
    "link": "https://arxiv.org/abs/2403.05023",
    "context": "Title: Towards Multimodal Sentiment Analysis Debiasing via Bias Purification\nAbstract: arXiv:2403.05023v1 Announce Type: new  Abstract: Multimodal Sentiment Analysis (MSA) aims to understand human intentions by integrating emotion-related clues from diverse modalities, such as visual, language, and audio. Unfortunately, the current MSA task invariably suffers from unplanned dataset biases, particularly multimodal utterance-level label bias and word-level context bias. These harmful biases potentially mislead models to focus on statistical shortcuts and spurious correlations, causing severe performance bottlenecks. To alleviate these issues, we present a Multimodal Counterfactual Inference Sentiment (MCIS) analysis framework based on causality rather than conventional likelihood. Concretely, we first formulate a causal graph to discover harmful biases from already-trained vanilla models. In the inference phase, given a factual multimodal input, MCIS imagines two counterfactual scenarios to purify and mitigate these biases. Then, MCIS can make unbiased decisions from biase",
    "path": "papers/24/03/2403.05023.json",
    "total_tokens": 877,
    "translated_title": "通过偏差净化实现多模态情感分析的研究",
    "translated_abstract": "多模态情感分析（MSA）旨在通过整合来自不同模态（如视觉、语言和音频）的与情感相关线索来理解人类意图。然而，当前MSA任务普遍受到未经计划的数据集偏见的影响，尤其是多模态话语级标签偏见和单词级上下文偏见。这些有害的偏见可能会误导模型专注于统计捷径和错误相关性，导致严重的性能瓶颈。为了缓解这些问题，我们提出了一种基于因果关系而非传统似然性的多模态对事实推理情感（MCIS）分析框架。具体而言，我们首先制定一个因果图来发现已训练的基准模型中的有害偏见。在推理阶段，给定一个事实多模态输入，MCIS想象两种对事实情形，以净化和缓解这些偏见。然后，MCIS可以从偏差中做出不带偏见的决策。",
    "tldr": "提出了一种基于因果关系的多模态对事实推理情感分析框架，用于净化和缓解数据集的偏见，从而提高多模态情感分析的性能。",
    "en_tdlr": "Introduced a multimodal counterfactual inference sentiment (MCIS) analysis framework based on causality to purify and mitigate biases in datasets, improving the performance of multimodal sentiment analysis."
}