{
    "title": "Improving Fairness in Credit Lending Models using Subgroup Threshold Optimization",
    "abstract": "arXiv:2403.10652v1 Announce Type: new  Abstract: In an effort to improve the accuracy of credit lending decisions, many financial intuitions are now using predictions from machine learning models. While such predictions enjoy many advantages, recent research has shown that the predictions have the potential to be biased and unfair towards certain subgroups of the population. To combat this, several techniques have been introduced to help remove the bias and improve the overall fairness of the predictions. We introduce a new fairness technique, called \\textit{Subgroup Threshold Optimizer} (\\textit{STO}), that does not require any alternations to the input training data nor does it require any changes to the underlying machine learning algorithm, and thus can be used with any existing machine learning pipeline. STO works by optimizing the classification thresholds for individual subgroups in order to minimize the overall discrimination score between them. Our experiments on a real-world ",
    "link": "https://arxiv.org/abs/2403.10652",
    "context": "Title: Improving Fairness in Credit Lending Models using Subgroup Threshold Optimization\nAbstract: arXiv:2403.10652v1 Announce Type: new  Abstract: In an effort to improve the accuracy of credit lending decisions, many financial intuitions are now using predictions from machine learning models. While such predictions enjoy many advantages, recent research has shown that the predictions have the potential to be biased and unfair towards certain subgroups of the population. To combat this, several techniques have been introduced to help remove the bias and improve the overall fairness of the predictions. We introduce a new fairness technique, called \\textit{Subgroup Threshold Optimizer} (\\textit{STO}), that does not require any alternations to the input training data nor does it require any changes to the underlying machine learning algorithm, and thus can be used with any existing machine learning pipeline. STO works by optimizing the classification thresholds for individual subgroups in order to minimize the overall discrimination score between them. Our experiments on a real-world ",
    "path": "papers/24/03/2403.10652.json",
    "total_tokens": 852,
    "translated_title": "使用子群阈值优化提高信贷借贷模型公平性",
    "translated_abstract": "为提高信贷借贷决策的准确性，许多金融机构现在使用机器学习模型的预测。然而，最近的研究表明，这些预测有可能对人口的某些子群体存在偏见和不公平。为了解决这个问题，引入了几种技术来消除偏见，提高预测的整体公平性。我们介绍了一种名为“Subgroup Threshold Optimizer”（简称STO）的新的公平性技术，它不需要对输入训练数据进行任何改动，也不需要对底层机器学习算法进行任何更改，因此可以与任何现有的机器学习流程一起使用。STO通过优化各个子群的分类阈值，以最小化它们之间的整体歧视分数。我们在一个真实世界的实验中",
    "tldr": "使用子群阈值优化（STO）技术，在不改动训练数据和底层机器学习算法的情况下，优化各个子群的分类阈值，以最小化整体歧视分数，从而提高信贷借贷模型的公平性。",
    "en_tdlr": "The Subgroup Threshold Optimizer (STO) technique optimizes classification thresholds for individual subgroups without altering the training data and underlying machine learning algorithm, aiming to minimize overall discrimination score and enhance fairness in credit lending models."
}