{
    "title": "UNICORN: Ultrasound Nakagami Imaging via Score Matching and Adaptation",
    "abstract": "arXiv:2403.06275v1 Announce Type: cross  Abstract: Nakagami imaging holds promise for visualizing and quantifying tissue scattering in ultrasound waves, with potential applications in tumor diagnosis and fat fraction estimation which are challenging to discern by conventional ultrasound B-mode images. Existing methods struggle with optimal window size selection and suffer from estimator instability, leading to degraded resolution images. To address this, here we propose a novel method called UNICORN (Ultrasound Nakagami Imaging via Score Matching and Adaptation), that offers an accurate, closed-form estimator for Nakagami parameter estimation in terms of the score function of ultrasonic envelope. Extensive experiments using simulation and real ultrasound RF data demonstrate UNICORN's superiority over conventional approaches in accuracy and resolution quality.",
    "link": "https://arxiv.org/abs/2403.06275",
    "context": "Title: UNICORN: Ultrasound Nakagami Imaging via Score Matching and Adaptation\nAbstract: arXiv:2403.06275v1 Announce Type: cross  Abstract: Nakagami imaging holds promise for visualizing and quantifying tissue scattering in ultrasound waves, with potential applications in tumor diagnosis and fat fraction estimation which are challenging to discern by conventional ultrasound B-mode images. Existing methods struggle with optimal window size selection and suffer from estimator instability, leading to degraded resolution images. To address this, here we propose a novel method called UNICORN (Ultrasound Nakagami Imaging via Score Matching and Adaptation), that offers an accurate, closed-form estimator for Nakagami parameter estimation in terms of the score function of ultrasonic envelope. Extensive experiments using simulation and real ultrasound RF data demonstrate UNICORN's superiority over conventional approaches in accuracy and resolution quality.",
    "path": "papers/24/03/2403.06275.json",
    "total_tokens": 796,
    "translated_title": "UNICORN: 通过分数匹配和自适应实现的超声纳卡加米成像",
    "translated_abstract": "Nakagami成像在超声波中可视化和量化组织散射方面具有潜力，在肿瘤诊断和脂肪分数估计等领域有潜在应用，而这些领域很难通过传统超声B模式图像分辨。现有方法在选择最优窗口大小上存在困难，并且由于估计不稳定性而导致分辨率降低。为解决这一问题，本文提出了一种名为UNICORN（通过分数匹配和自适应实现的超声纳卡加米成像）的新方法，它提供了一种准确的，封闭形式的方法，用于通过超声包络的分数函数来估计卡加米参数。通过使用模拟和真实超声RF数据进行的大量实验证明了UNICORN在准确性和分辨率质量方面优于传统方法。",
    "tldr": "提出了一种名为UNICORN的新方法，通过分数匹配和自适应实现超声纳卡加米成像，能够在准确性和分辨率质量上超越传统方法。",
    "en_tdlr": "Introducing UNICORN, a novel method for ultrasound Nakagami imaging via score matching and adaptation, surpassing traditional approaches in accuracy and resolution quality."
}