{
    "title": "Robust Conformal Prediction under Distribution Shift via Physics-Informed Structural Causal Model",
    "abstract": "arXiv:2403.15025v1 Announce Type: new  Abstract: Uncertainty is critical to reliable decision-making with machine learning. Conformal prediction (CP) handles uncertainty by predicting a set on a test input, hoping the set to cover the true label with at least $(1-\\alpha)$ confidence. This coverage can be guaranteed on test data even if the marginal distributions $P_X$ differ between calibration and test datasets. However, as it is common in practice, when the conditional distribution $P_{Y|X}$ is different on calibration and test data, the coverage is not guaranteed and it is essential to measure and minimize the coverage loss under distributional shift at \\textit{all} possible confidence levels. To address these issues, we upper bound the coverage difference at all levels using the cumulative density functions of calibration and test conformal scores and Wasserstein distance. Inspired by the invariance of physics across data distributions, we propose a physics-informed structural caus",
    "link": "https://arxiv.org/abs/2403.15025",
    "context": "Title: Robust Conformal Prediction under Distribution Shift via Physics-Informed Structural Causal Model\nAbstract: arXiv:2403.15025v1 Announce Type: new  Abstract: Uncertainty is critical to reliable decision-making with machine learning. Conformal prediction (CP) handles uncertainty by predicting a set on a test input, hoping the set to cover the true label with at least $(1-\\alpha)$ confidence. This coverage can be guaranteed on test data even if the marginal distributions $P_X$ differ between calibration and test datasets. However, as it is common in practice, when the conditional distribution $P_{Y|X}$ is different on calibration and test data, the coverage is not guaranteed and it is essential to measure and minimize the coverage loss under distributional shift at \\textit{all} possible confidence levels. To address these issues, we upper bound the coverage difference at all levels using the cumulative density functions of calibration and test conformal scores and Wasserstein distance. Inspired by the invariance of physics across data distributions, we propose a physics-informed structural caus",
    "path": "papers/24/03/2403.15025.json",
    "total_tokens": 849,
    "translated_title": "通过物理信息结构因果模型在分布转移下的稳健符合预测",
    "translated_abstract": "不确定性对于利用机器学习进行可靠决策至关重要。 符合预测（CP）通过预测测试输入的一个集合来处理不确定性，希望该集合以至少$(1-\\alpha)$的置信度覆盖真实标签。 即使在校准和测试数据集之间的边缘分布 $P_X$ 不同的情况下，这种覆盖也可以在测试数据上得到保证。 但是，实践中很常见的情况是，当校准和测试数据上的条件分布 $P_{Y|X}$ 不同时，覆盖就无法保证，在所有可能的置信水平下测量和最小化分布转移下的覆盖损失是至关重要的。 为了解决这些问题，我们使用校准和测试符合分数的累积密度函数以及Wasserstein距离在各个水平上上界覆盖差异。 受物理学在数据分布方面的不变性启发，我们提出了一种受物理信息指导的结构因果模型。",
    "tldr": "通过引入物理信息指导的结构因果模型，我们提出了一种在分布转移下稳健的符合预测方法。",
    "en_tdlr": "We propose a robust conformal prediction method under distribution shift by introducing a physics-informed structural causal model."
}