{
    "title": "Improving Image Classification Accuracy through Complementary Intra-Class and Inter-Class Mixup",
    "abstract": "arXiv:2403.14137v1 Announce Type: cross  Abstract: MixUp and its variants, such as Manifold MixUp, have two key limitations in image classification tasks. First, they often neglect mixing within the same class (intra-class mixup), leading to an underutilization of the relationships among samples within the same class. Second, although these methods effectively enhance inter-class separability by mixing between different classes (inter-class mixup), they fall short in improving intra-class cohesion through their mixing operations, limiting their classification performance. To tackle these issues, we propose a novel mixup method and a comprehensive integrated solution.Our mixup approach specifically targets intra-class mixup, an aspect commonly overlooked, to strengthen intra-class cohesion-a feature not provided by current mixup techniques.For each mini-batch, our method utilizes feature representations of unaugmented original images from each class within the mini-batch to generate a s",
    "link": "https://arxiv.org/abs/2403.14137",
    "context": "Title: Improving Image Classification Accuracy through Complementary Intra-Class and Inter-Class Mixup\nAbstract: arXiv:2403.14137v1 Announce Type: cross  Abstract: MixUp and its variants, such as Manifold MixUp, have two key limitations in image classification tasks. First, they often neglect mixing within the same class (intra-class mixup), leading to an underutilization of the relationships among samples within the same class. Second, although these methods effectively enhance inter-class separability by mixing between different classes (inter-class mixup), they fall short in improving intra-class cohesion through their mixing operations, limiting their classification performance. To tackle these issues, we propose a novel mixup method and a comprehensive integrated solution.Our mixup approach specifically targets intra-class mixup, an aspect commonly overlooked, to strengthen intra-class cohesion-a feature not provided by current mixup techniques.For each mini-batch, our method utilizes feature representations of unaugmented original images from each class within the mini-batch to generate a s",
    "path": "papers/24/03/2403.14137.json",
    "total_tokens": 791,
    "translated_title": "通过互补的类内和类间Mixup提高图像分类准确性",
    "translated_abstract": "MixUp及其变体，在图像分类任务中存在两个关键限制。首先，它们通常忽略了同一类别内的混合（类内Mixup），导致同一类别样本之间的关系被低估。其次，尽管这些方法通过不同类别之间的混合（类间Mixup）有效增强了类间可分离性，但在通过其混合操作改进类内凝聚力方面表现不足，限制了它们的分类性能。为了解决这些问题，我们提出了一种新颖的mixup方法和一个全面的综合解决方案。我们的mixup方法专门针对常常被忽视的类内Mixup，以加强类内凝聚性-这是目前的mixup技术没有提供的特性。对于每个小批量，我们的方法利用小批量中每个类别的未增强原始图像的特征表示来生成a",
    "tldr": "通过提出一种新的mixup方法，该方法针对类内混合进行了优化，提高了图像分类准确性。",
    "en_tdlr": "Proposes a new mixup method targeting intra-class mixup to improve image classification accuracy."
}