{
    "title": "Membership Testing in Markov Equivalence Classes via Independence Query Oracles",
    "abstract": "arXiv:2403.05759v1 Announce Type: cross  Abstract: Understanding causal relationships between variables is a fundamental problem with broad impact in numerous scientific fields. While extensive research has been dedicated to learning causal graphs from data, its complementary concept of testing causal relationships has remained largely unexplored. While learning involves the task of recovering the Markov equivalence class (MEC) of the underlying causal graph from observational data, the testing counterpart addresses the following critical question: Given a specific MEC and observational data from some causal graph, can we determine if the data-generating causal graph belongs to the given MEC?   We explore constraint-based testing methods by establishing bounds on the required number of conditional independence tests. Our bounds are in terms of the size of the maximum undirected clique ($s$) of the given MEC. In the worst case, we show a lower bound of $\\exp(\\Omega(s))$ independence tes",
    "link": "https://arxiv.org/abs/2403.05759",
    "context": "Title: Membership Testing in Markov Equivalence Classes via Independence Query Oracles\nAbstract: arXiv:2403.05759v1 Announce Type: cross  Abstract: Understanding causal relationships between variables is a fundamental problem with broad impact in numerous scientific fields. While extensive research has been dedicated to learning causal graphs from data, its complementary concept of testing causal relationships has remained largely unexplored. While learning involves the task of recovering the Markov equivalence class (MEC) of the underlying causal graph from observational data, the testing counterpart addresses the following critical question: Given a specific MEC and observational data from some causal graph, can we determine if the data-generating causal graph belongs to the given MEC?   We explore constraint-based testing methods by establishing bounds on the required number of conditional independence tests. Our bounds are in terms of the size of the maximum undirected clique ($s$) of the given MEC. In the worst case, we show a lower bound of $\\exp(\\Omega(s))$ independence tes",
    "path": "papers/24/03/2403.05759.json",
    "total_tokens": 749,
    "translated_title": "通过独立查询预言者在马尔可夫等价类中进行成员测试",
    "translated_abstract": "变量之间因果关系的理解是许多科学领域中具有广泛影响的基本问题。虽然已经投入了大量研究来从数据中学习因果图，但其补充概念——测试因果关系却基本没有被探索。我们通过建立在给定MEC(Markov等价类)的最大无向团的大小($s$)方面的下界，探讨基于约束的测试方法。在最坏情况下，我们展示了$\\exp(\\Omega(s))$个独立性测试的下界。",
    "tldr": "通过建立在给定的最大无向团大小($s$)方面的下界，我们探讨了通过独立查询预言者在马尔可夫等价类中进行成员测试这一问题。",
    "en_tdlr": "We explore constraint-based testing methods by establishing bounds on the required number of conditional independence tests, in terms of the size of the maximum undirected clique ($s$) of the Markov equivalence class (MEC), showing a lower bound of $\\exp(\\Omega(s))$ independence tests in the worst case."
}