{
    "title": "Hyperparameter Tuning MLPs for Probabilistic Time Series Forecasting",
    "abstract": "arXiv:2403.04477v1 Announce Type: new  Abstract: Time series forecasting attempts to predict future events by analyzing past trends and patterns. Although well researched, certain critical aspects pertaining to the use of deep learning in time series forecasting remain ambiguous. Our research primarily focuses on examining the impact of specific hyperparameters related to time series, such as context length and validation strategy, on the performance of the state-of-the-art MLP model in time series forecasting. We have conducted a comprehensive series of experiments involving 4800 configurations per dataset across 20 time series forecasting datasets, and our findings demonstrate the importance of tuning these parameters. Furthermore, in this work, we introduce the largest metadataset for timeseries forecasting to date, named TSBench, comprising 97200 evaluations, which is a twentyfold increase compared to previous works in the field. Finally, we demonstrate the utility of the created m",
    "link": "https://arxiv.org/abs/2403.04477",
    "context": "Title: Hyperparameter Tuning MLPs for Probabilistic Time Series Forecasting\nAbstract: arXiv:2403.04477v1 Announce Type: new  Abstract: Time series forecasting attempts to predict future events by analyzing past trends and patterns. Although well researched, certain critical aspects pertaining to the use of deep learning in time series forecasting remain ambiguous. Our research primarily focuses on examining the impact of specific hyperparameters related to time series, such as context length and validation strategy, on the performance of the state-of-the-art MLP model in time series forecasting. We have conducted a comprehensive series of experiments involving 4800 configurations per dataset across 20 time series forecasting datasets, and our findings demonstrate the importance of tuning these parameters. Furthermore, in this work, we introduce the largest metadataset for timeseries forecasting to date, named TSBench, comprising 97200 evaluations, which is a twentyfold increase compared to previous works in the field. Finally, we demonstrate the utility of the created m",
    "path": "papers/24/03/2403.04477.json",
    "total_tokens": 858,
    "translated_title": "超参数调整MLP用于概率时间序列预测",
    "translated_abstract": "时间序列预测试图通过分析过去的趋势和模式来预测未来事件。尽管经过深入研究，但关于在时间序列预测中使用深度学习的某些关键方面仍不明确。我们的研究主要集中在考察与时间序列相关的特定超参数（如上下文长度和验证策略）对时间序列预测中现代MLP模型性能的影响。我们进行了一系列全面的实验，涉及20个时间序列预测数据集中每个数据集4800个配置，并且我们的研究结果表明调整这些参数的重要性。此外，在这项工作中，我们引入了迄今为止用于时间序列预测的最大元数据集，名为TSBench，包括97200次评估，比该领域先前工作增加了20倍。最后，我们展示了所创建模型的效用。",
    "tldr": "该研究通过大量实验调查时间序列相关的特定超参数对MLP模型在时间序列预测中性能的影响，引入了迄今为止最大的用于时间序列预测的元数据集TSBench，强调调整这些参数的重要性。",
    "en_tdlr": "The study investigates the impact of specific hyperparameters related to time series on the performance of the MLP model in time series forecasting through extensive experiments, introduces the largest metadataset for time series forecasting to date, TSBench, emphasizing the importance of tuning these parameters."
}