{
    "title": "Topologically faithful multi-class segmentation in medical images",
    "abstract": "arXiv:2403.11001v1 Announce Type: cross  Abstract: Topological accuracy in medical image segmentation is a highly important property for downstream applications such as network analysis and flow modeling in vessels or cell counting. Recently, significant methodological advancements have brought well-founded concepts from algebraic topology to binary segmentation. However, these approaches have been underexplored in multi-class segmentation scenarios, where topological errors are common. We propose a general loss function for topologically faithful multi-class segmentation extending the recent Betti matching concept, which is based on induced matchings of persistence barcodes. We project the N-class segmentation problem to N single-class segmentation tasks, which allows us to use 1-parameter persistent homology making training of neural networks computationally feasible. We validate our method on a comprehensive set of four medical datasets with highly variant topological characteristic",
    "link": "https://arxiv.org/abs/2403.11001",
    "context": "Title: Topologically faithful multi-class segmentation in medical images\nAbstract: arXiv:2403.11001v1 Announce Type: cross  Abstract: Topological accuracy in medical image segmentation is a highly important property for downstream applications such as network analysis and flow modeling in vessels or cell counting. Recently, significant methodological advancements have brought well-founded concepts from algebraic topology to binary segmentation. However, these approaches have been underexplored in multi-class segmentation scenarios, where topological errors are common. We propose a general loss function for topologically faithful multi-class segmentation extending the recent Betti matching concept, which is based on induced matchings of persistence barcodes. We project the N-class segmentation problem to N single-class segmentation tasks, which allows us to use 1-parameter persistent homology making training of neural networks computationally feasible. We validate our method on a comprehensive set of four medical datasets with highly variant topological characteristic",
    "path": "papers/24/03/2403.11001.json",
    "total_tokens": 835,
    "translated_title": "医学图像中拓扑保真的多类别分割",
    "translated_abstract": "在医学图像分割中，拓扑精度是一个非常重要的属性，对于下游应用如网络分析和血管或细胞计数中的流模拟至关重要。最近，重要的方法论进步将代数拓扑中扎实的概念带到了二值分割中。然而，在多类别分割场景中，这些方法很少被探索，拓扑错误很常见。我们提出了一个通用损失函数，用于拓扑保真的多类别分割，扩展了最近基于持久条码的Betti匹配概念。我们将N类别分割问题投影到N个单类别分割任务，这使得我们能够使用一参数持久同调，从而使神经网络的训练变得可行。我们在一组包含高度不同拓扑特征的四个医学数据集上验证了我们的方法。",
    "tldr": "提出了一种用于医学图像的拓扑保真多类别分割的通用损失函数，通过将N类别分割问题分解为N个单类别分割任务，实现了对神经网络的训练，验证了在四个医学数据集上的有效性",
    "en_tdlr": "Proposed a general loss function for topologically faithful multi-class segmentation in medical images, projecting the N-class segmentation problem to N single-class segmentation tasks, enabling training of neural networks and validated on four medical datasets with highly variant topological characteristics."
}