{
    "title": "Deep Learning-Assisted Parallel Interference Cancellation for Grant-Free NOMA in Machine-Type Communication",
    "abstract": "arXiv:2403.07255v1 Announce Type: cross  Abstract: In this paper, we present a novel approach for joint activity detection (AD), channel estimation (CE), and data detection (DD) in uplink grant-free non-orthogonal multiple access (NOMA) systems. Our approach employs an iterative and parallel interference removal strategy inspired by parallel interference cancellation (PIC), enhanced with deep learning to jointly tackle the AD, CE, and DD problems. Based on this approach, we develop three PIC frameworks, each of which is designed for either coherent or non-coherence schemes. The first framework performs joint AD and CE using received pilot signals in the coherent scheme. Building upon this framework, the second framework utilizes both the received pilot and data signals for CE, further enhancing the performances of AD, CE, and DD in the coherent scheme. The third framework is designed to accommodate the non-coherent scheme involving a small number of data bits, which simultaneously perf",
    "link": "https://arxiv.org/abs/2403.07255",
    "context": "Title: Deep Learning-Assisted Parallel Interference Cancellation for Grant-Free NOMA in Machine-Type Communication\nAbstract: arXiv:2403.07255v1 Announce Type: cross  Abstract: In this paper, we present a novel approach for joint activity detection (AD), channel estimation (CE), and data detection (DD) in uplink grant-free non-orthogonal multiple access (NOMA) systems. Our approach employs an iterative and parallel interference removal strategy inspired by parallel interference cancellation (PIC), enhanced with deep learning to jointly tackle the AD, CE, and DD problems. Based on this approach, we develop three PIC frameworks, each of which is designed for either coherent or non-coherence schemes. The first framework performs joint AD and CE using received pilot signals in the coherent scheme. Building upon this framework, the second framework utilizes both the received pilot and data signals for CE, further enhancing the performances of AD, CE, and DD in the coherent scheme. The third framework is designed to accommodate the non-coherent scheme involving a small number of data bits, which simultaneously perf",
    "path": "papers/24/03/2403.07255.json",
    "total_tokens": 866,
    "translated_title": "基于深度学习辅助的机器类型通信中无授权NOMA的并行干扰消除",
    "translated_abstract": "在这篇论文中，我们提出了一种新颖的方法，用于在上行无授权非正交多址接入（NOMA）系统中联合进行活动检测（AD）、信道估计（CE）和数据检测（DD）。我们的方法采用了一个受并行干扰消除（PIC）启发的迭代和并行干扰移除策略，并结合了深度学习来共同解决AD、CE和DD问题。基于这种方法，我们开发了三种PIC框架，每种框架都设计用于相干或非一致方案。第一个框架在相干方案中使用接收到的导频信号进行联合AD和CE。在此框架基础上，第二个框架利用接收到的导频和数据信号进行CE，进一步增强了相干方案中AD、CE和DD的性能。第三个框架设计用于适应包含少量数据位的非相干方案，同时实现...",
    "tldr": "论文提出了一种基于深度学习辅助的并行干扰消除方法，用于在无授权NOMA系统中联合处理活动检测、信道估计和数据检测问题。",
    "en_tdlr": "The paper presents a deep learning-assisted parallel interference cancellation approach for jointly addressing activity detection, channel estimation, and data detection problems in grant-free NOMA systems."
}