{
    "title": "Applying ranking techniques for estimating influence of Earth variables on temperature forecast error",
    "abstract": "arXiv:2403.07966v1 Announce Type: new  Abstract: This paper describes how to analyze the influence of Earth system variables on the errors when providing temperature forecasts. The initial framework to get the data has been based on previous research work, which resulted in a very interesting discovery. However, the aforementioned study only worked on individual correlations of the variables with respect to the error. This research work is going to re-use the main ideas but introduce three main novelties: (1) applying a data science approach by a few representative locations; (2) taking advantage of the rankings created by Spearman correlation but enriching them with other metrics looking for a more robust ranking of the variables; (3) evaluation of the methodology by learning random forest models for regression with the distinct experimental variations. The main contribution is the framework that shows how to convert correlations into rankings and combine them into an aggregate rankin",
    "link": "https://arxiv.org/abs/2403.07966",
    "context": "Title: Applying ranking techniques for estimating influence of Earth variables on temperature forecast error\nAbstract: arXiv:2403.07966v1 Announce Type: new  Abstract: This paper describes how to analyze the influence of Earth system variables on the errors when providing temperature forecasts. The initial framework to get the data has been based on previous research work, which resulted in a very interesting discovery. However, the aforementioned study only worked on individual correlations of the variables with respect to the error. This research work is going to re-use the main ideas but introduce three main novelties: (1) applying a data science approach by a few representative locations; (2) taking advantage of the rankings created by Spearman correlation but enriching them with other metrics looking for a more robust ranking of the variables; (3) evaluation of the methodology by learning random forest models for regression with the distinct experimental variations. The main contribution is the framework that shows how to convert correlations into rankings and combine them into an aggregate rankin",
    "path": "papers/24/03/2403.07966.json",
    "total_tokens": 891,
    "translated_title": "应用排名技术估计地球变量对温度预报误差的影响",
    "translated_abstract": "本文描述了如何分析地球系统变量对温度预报误差的影响。获取数据的初始框架基于先前的研究工作，这导致了一个非常有趣的发现。然而，前述研究仅仅针对变量与误差的个体相关性进行工作。本研究将重新使用主要思想，但引入了三个主要创新：(1)通过少数代表性位置应用数据科学方法；(2)利用Spearman相关性创建的排名，但用其他度量丰富它们以寻找更稳健的变量排名；(3)通过学习具有不同实验变化的随机森林模型来评估方法论。其主要贡献是展示如何将相关性转化为排名，并将它们合并成一个总体排名。",
    "tldr": "本研究介绍了如何分析地球系统变量对温度预报误差的影响，通过引入三个创新：应用数据科学方法在代表性位置进行排名、利用Spearman相关性创建排名并结合其他度量丰富排名、通过学习随机森林模型评估方法论，最终将相关性转化为排名并组合成一个总体排名。",
    "en_tdlr": "This study describes the analysis of Earth system variables' impact on temperature forecast errors, introducing three innovations: applying data science methods for ranking at representative locations, enriching rankings by combining Spearman correlations with other metrics, evaluating the methodology through random forest models, ultimately converting correlations into rankings and aggregating them."
}