{
    "title": "An EnKF-LSTM Assimilation Algorithm for Crop Growth Model",
    "abstract": "arXiv:2403.03406v1 Announce Type: new  Abstract: Accurate and timely prediction of crop growth is of great significance to ensure crop yields and researchers have developed several crop models for the prediction of crop growth. However, there are large difference between the simulation results obtained by the crop models and the actual results, thus in this paper, we proposed to combine the simulation results with the collected crop data for data assimilation so that the accuracy of prediction will be improved. In this paper, an EnKF-LSTM data assimilation method for various crops is proposed by combining ensemble Kalman filter and LSTM neural network, which effectively avoids the overfitting problem of existing data assimilation methods and eliminates the uncertainty of the measured data. The verification of the proposed EnKF-LSTM method and the comparison of the proposed method with other data assimilation methods were performed using datasets collected by sensor equipment deployed o",
    "link": "https://arxiv.org/abs/2403.03406",
    "context": "Title: An EnKF-LSTM Assimilation Algorithm for Crop Growth Model\nAbstract: arXiv:2403.03406v1 Announce Type: new  Abstract: Accurate and timely prediction of crop growth is of great significance to ensure crop yields and researchers have developed several crop models for the prediction of crop growth. However, there are large difference between the simulation results obtained by the crop models and the actual results, thus in this paper, we proposed to combine the simulation results with the collected crop data for data assimilation so that the accuracy of prediction will be improved. In this paper, an EnKF-LSTM data assimilation method for various crops is proposed by combining ensemble Kalman filter and LSTM neural network, which effectively avoids the overfitting problem of existing data assimilation methods and eliminates the uncertainty of the measured data. The verification of the proposed EnKF-LSTM method and the comparison of the proposed method with other data assimilation methods were performed using datasets collected by sensor equipment deployed o",
    "path": "papers/24/03/2403.03406.json",
    "total_tokens": 768,
    "translated_title": "一种用于作物生长模型的EnKF-LSTM同化算法",
    "translated_abstract": "准确及时地预测作物生长对于确保作物产量具有重要意义，研究人员开发了几种用于预测作物生长的模型。然而，作物模型得到的模拟结果与实际结果之间存在较大差异，因此本文提出将模拟结果与采集的作物数据结合进行数据同化，从而提高预测的准确性。本文提出了一种EnKF-LSTM数据同化方法，通过结合集合卡尔曼滤波器和LSTM神经网络，有效避免了现有数据同化方法的过度拟合问题，并消除了测量数据的不确定性。利用传感器设备收集的数据集对所提出的EnKF-LSTM方法进行了验证，并与其他数据同化方法进行了比较。",
    "tldr": "本文提出了一种EnKF-LSTM数据同化方法，通过结合集合卡尔曼滤波器和LSTM神经网络，提高了作物生长预测的准确性。"
}