{
    "title": "Volatility-based strategy on Chinese equity index ETF options",
    "abstract": "arXiv:2403.00474v1 Announce Type: new  Abstract: In recent years, there has been quick developments of derivative markets in China and standardized derivative trading have reached considerable volumes. In this research, we collect all the daily data of ETF options traded at Shanghai Stock Exchange and start with a simple short-volatility strategy. The strategy delivers nice performance before 2018, providing significant excess return over the buy and hold benchmark. However, after 2018, this strategy starts to deteriorate and no obvious risk-adjusted return is shown. Based on the discussion of relationship between the strategy's performance and market's volatility, we improve the model by adjusting positions and exposure according to volatility forecasts using methods such as volatility momentum and GARCH. The new models have improved performance in different ways, where larger upside capture and smaller drawbacks can be achieved in market fluctuation. This research has shown potential",
    "link": "https://arxiv.org/abs/2403.00474",
    "context": "Title: Volatility-based strategy on Chinese equity index ETF options\nAbstract: arXiv:2403.00474v1 Announce Type: new  Abstract: In recent years, there has been quick developments of derivative markets in China and standardized derivative trading have reached considerable volumes. In this research, we collect all the daily data of ETF options traded at Shanghai Stock Exchange and start with a simple short-volatility strategy. The strategy delivers nice performance before 2018, providing significant excess return over the buy and hold benchmark. However, after 2018, this strategy starts to deteriorate and no obvious risk-adjusted return is shown. Based on the discussion of relationship between the strategy's performance and market's volatility, we improve the model by adjusting positions and exposure according to volatility forecasts using methods such as volatility momentum and GARCH. The new models have improved performance in different ways, where larger upside capture and smaller drawbacks can be achieved in market fluctuation. This research has shown potential",
    "path": "papers/24/03/2403.00474.json",
    "total_tokens": 847,
    "translated_title": "基于中国股票指数ETF期权的波动率策略",
    "translated_abstract": "最近几年，中国衍生品市场得到了快速发展，标准化衍生品交易量已达到相当规模。本研究收集了上海证券交易所交易的所有ETF期权的每日数据，并从一个简单的短波动率策略开始。该策略在2018年之前表现良好，提供了显著超额回报，超过了买入持有基准。然而，2018年之后，该策略开始恶化，没有显示明显的风险调整回报。根据策略表现与市场波动性之间的关系讨论，我们通过根据波动率预测调整仓位和暴露的方法（如波动率动能和GARCH）改进了模型。新模型在不同方面表现得更好，可以在市场波动中实现更大的上涨捕捉和更小的回撤。这项研究展示了潜力。",
    "tldr": "该研究通过基于波动率的策略调整仓位和暴露，改进了基于中国股票指数ETF期权的交易模型，在市场波动中实现更大的上涨捕捉和更小的回撤。",
    "en_tdlr": "The research improves the trading model based on Chinese equity index ETF options by adjusting positions and exposure according to volatility forecasts, achieving larger upside capture and smaller drawbacks in market fluctuations."
}