{
    "title": "Application of GPT Language Models for Innovation in Activities in University Teaching",
    "abstract": "arXiv:2403.14694v1 Announce Type: cross  Abstract: The GPT (Generative Pre-trained Transformer) language models are an artificial intelligence and natural language processing technology that enables automatic text generation. There is a growing interest in applying GPT language models to university teaching in various dimensions. From the perspective of innovation in student and teacher activities, they can provide support in understanding and generating content, problem-solving, as well as personalization and test correction, among others. From the dimension of internationalization, the misuse of these models represents a global problem that requires taking a series of common measures in universities from different geographical areas. In several countries, there has been a review of assessment tools to ensure that work is done by students and not by AI. To this end, we have conducted a detailed experiment in a representative subject of Computer Science such as Software Engineering, wh",
    "link": "https://arxiv.org/abs/2403.14694",
    "context": "Title: Application of GPT Language Models for Innovation in Activities in University Teaching\nAbstract: arXiv:2403.14694v1 Announce Type: cross  Abstract: The GPT (Generative Pre-trained Transformer) language models are an artificial intelligence and natural language processing technology that enables automatic text generation. There is a growing interest in applying GPT language models to university teaching in various dimensions. From the perspective of innovation in student and teacher activities, they can provide support in understanding and generating content, problem-solving, as well as personalization and test correction, among others. From the dimension of internationalization, the misuse of these models represents a global problem that requires taking a series of common measures in universities from different geographical areas. In several countries, there has been a review of assessment tools to ensure that work is done by students and not by AI. To this end, we have conducted a detailed experiment in a representative subject of Computer Science such as Software Engineering, wh",
    "path": "papers/24/03/2403.14694.json",
    "total_tokens": 860,
    "translated_title": "GPT语言模型在大学教学活动创新中的应用",
    "translated_abstract": "GPT（生成式预训练变换器）语言模型是一种人工智能和自然语言处理技术，可以实现自动文本生成。在将GPT语言模型应用于大学教学的各个维度中存在着日益增长的兴趣。从学生和教师活动创新的角度来看，它们可以在理解和生成内容、问题解决以及个性化和测试纠错等方面提供支持。从国际化的角度来看，误用这些模型代表着一个需要采取一系列共同措施的全球问题，这些措施需要各地区的大学共同参与。在一些国家，已经对评估工具进行了审查，以确保工作是由学生完成的，而不是由人工智能完成的。为此，我们在计算机科学这种代表性学科的一个具体课题，比如软件工程中进行了详细的实验。",
    "tldr": "GPT语言模型在大学教学活动创新中的应用不仅可以支持理解和生成内容、问题解决，还可以在个性化和测试纠错等方面提供帮助，但是在国际化方面需注意避免其误用导致的全球问题。"
}