{
    "title": "An AI-Driven Approach to Wind Turbine Bearing Fault Diagnosis from Acoustic Signals",
    "abstract": "arXiv:2403.09030v1 Announce Type: cross  Abstract: This study aimed to develop a deep learning model for the classification of bearing faults in wind turbine generators from acoustic signals. A convolutional LSTM model was successfully constructed and trained by using audio data from five predefined fault types for both training and validation. To create the dataset, raw audio signal data was collected and processed in frames to capture time and frequency domain information. The model exhibited outstanding accuracy on training samples and demonstrated excellent generalization ability during validation, indicating its proficiency of generalization capability. On the test samples, the model achieved remarkable classification performance, with an overall accuracy exceeding 99.5%, and a false positive rate of less than 1% for normal status. The findings of this study provide essential support for the diagnosis and maintenance of bearing faults in wind turbine generators, with the potential",
    "link": "https://arxiv.org/abs/2403.09030",
    "context": "Title: An AI-Driven Approach to Wind Turbine Bearing Fault Diagnosis from Acoustic Signals\nAbstract: arXiv:2403.09030v1 Announce Type: cross  Abstract: This study aimed to develop a deep learning model for the classification of bearing faults in wind turbine generators from acoustic signals. A convolutional LSTM model was successfully constructed and trained by using audio data from five predefined fault types for both training and validation. To create the dataset, raw audio signal data was collected and processed in frames to capture time and frequency domain information. The model exhibited outstanding accuracy on training samples and demonstrated excellent generalization ability during validation, indicating its proficiency of generalization capability. On the test samples, the model achieved remarkable classification performance, with an overall accuracy exceeding 99.5%, and a false positive rate of less than 1% for normal status. The findings of this study provide essential support for the diagnosis and maintenance of bearing faults in wind turbine generators, with the potential",
    "path": "papers/24/03/2403.09030.json",
    "total_tokens": 853,
    "translated_title": "一种基于人工智能的方法用于从声学信号诊断风力涡轮机轴承故障",
    "translated_abstract": "该研究旨在开发一个深度学习模型，用于通过声学信号对风力涡轮机发电机中的轴承故障进行分类。通过使用来自五种预定义故障类型的音频数据进行训练和验证成功构建和训练了一个卷积LSTM模型。为了创建数据集，收集并处理原始音频信号数据，将其处理成帧以捕获时间和频率域信息。该模型在训练样本上表现出色，并在验证过程中展现出极佳的泛化能力，表明其具有出色的泛化能力。在测试样本上，该模型取得了显著的分类性能，整体准确率超过99.5％，正常状态的假阳性率低于1％。该研究结果为风力涡轮机发电机中轴承故障的诊断和维护提供了重要支持，具有潜在的...",
    "tldr": "该研究开发了一个深度学习模型，通过声学信号对风力涡轮机发电机中的轴承故障进行分类，取得了在准确性和泛化能力方面的出色成果。",
    "en_tdlr": "This study developed a deep learning model for classifying bearing faults in wind turbine generators from acoustic signals, achieving outstanding results in accuracy and generalization capability."
}