{
    "title": "TESTAM: A Time-Enhanced Spatio-Temporal Attention Model with Mixture of Experts",
    "abstract": "arXiv:2403.02600v1 Announce Type: new  Abstract: Accurate traffic forecasting is challenging due to the complex dependency on road networks, various types of roads, and the abrupt speed change due to the events. Recent works mainly focus on dynamic spatial modeling with adaptive graph embedding or graph attention having less consideration for temporal characteristics and in-situ modeling. In this paper, we propose a novel deep learning model named TESTAM, which individually models recurring and non-recurring traffic patterns by a mixture-of-experts model with three experts on temporal modeling, spatio-temporal modeling with static graph, and dynamic spatio-temporal dependency modeling with dynamic graph. By introducing different experts and properly routing them, TESTAM could better model various circumstances, including spatially isolated nodes, highly related nodes, and recurring and non-recurring events. For the proper routing, we reformulate a gating problem into a classification p",
    "link": "https://arxiv.org/abs/2403.02600",
    "context": "Title: TESTAM: A Time-Enhanced Spatio-Temporal Attention Model with Mixture of Experts\nAbstract: arXiv:2403.02600v1 Announce Type: new  Abstract: Accurate traffic forecasting is challenging due to the complex dependency on road networks, various types of roads, and the abrupt speed change due to the events. Recent works mainly focus on dynamic spatial modeling with adaptive graph embedding or graph attention having less consideration for temporal characteristics and in-situ modeling. In this paper, we propose a novel deep learning model named TESTAM, which individually models recurring and non-recurring traffic patterns by a mixture-of-experts model with three experts on temporal modeling, spatio-temporal modeling with static graph, and dynamic spatio-temporal dependency modeling with dynamic graph. By introducing different experts and properly routing them, TESTAM could better model various circumstances, including spatially isolated nodes, highly related nodes, and recurring and non-recurring events. For the proper routing, we reformulate a gating problem into a classification p",
    "path": "papers/24/03/2403.02600.json",
    "total_tokens": 867,
    "translated_title": "TESTAM: 一种具有时间增强的时空注意力模型与专家混合模型",
    "translated_abstract": "准确的交通预测因对路网的复杂依赖、各种类型的道路以及由事件造成的速度突变而具有挑战性。最近的工作主要集中在具有自适应图嵌入或图注意力的动态空间建模，对于时间特性和就地建模的考虑较少。在本文中，我们提出了一种名为TESTAM的新型深度学习模型，通过三个专家模型（分别处理时间建模、具有静态图的时空建模和具有动态图的动态时空依赖建模）分别对周期性和非周期性交通模式进行建模。通过引入不同的专家并适当路由它们，TESTAM能更好地模拟各种情况，包括空间隔离节点、高度相关节点以及循环和非循环事件。为了进行适当的路由，我们将一个门控问题重新表述为一个分类问题。",
    "tldr": "TESTAM模型通过引入混合的专家模型，并且针对时间建模、静态图的时空建模以及动态图的动态时空依赖建模，能够更好地捕捉交通数据的各种模式和情况。",
    "en_tdlr": "The TESTAM model introduces a mixture of experts approach, addressing recurring and non-recurring traffic patterns through temporal modeling, spatio-temporal modeling with static graph, and dynamic spatio-temporal dependency modeling, enabling better capture of various traffic patterns and scenarios."
}