{
    "title": "Reading Users' Minds from What They Say: An Investigation into LLM-based Empathic Mental Inference",
    "abstract": "arXiv:2403.13301v1 Announce Type: cross  Abstract: In human-centered design, developing a comprehensive and in-depth understanding of user experiences, i.e., empathic understanding, is paramount for designing products that truly meet human needs. Nevertheless, accurately comprehending the real underlying mental states of a large human population remains a significant challenge today. This difficulty mainly arises from the trade-off between depth and scale of user experience research: gaining in-depth insights from a small group of users does not easily scale to a larger population, and vice versa. This paper investigates the use of Large Language Models (LLMs) for performing mental inference tasks, specifically inferring users' underlying goals and fundamental psychological needs (FPNs). Baseline and benchmark datasets were collected from human users and designers to develop an empathic accuracy metric for measuring the mental inference performance of LLMs. The empathic accuracy of inf",
    "link": "https://arxiv.org/abs/2403.13301",
    "context": "Title: Reading Users' Minds from What They Say: An Investigation into LLM-based Empathic Mental Inference\nAbstract: arXiv:2403.13301v1 Announce Type: cross  Abstract: In human-centered design, developing a comprehensive and in-depth understanding of user experiences, i.e., empathic understanding, is paramount for designing products that truly meet human needs. Nevertheless, accurately comprehending the real underlying mental states of a large human population remains a significant challenge today. This difficulty mainly arises from the trade-off between depth and scale of user experience research: gaining in-depth insights from a small group of users does not easily scale to a larger population, and vice versa. This paper investigates the use of Large Language Models (LLMs) for performing mental inference tasks, specifically inferring users' underlying goals and fundamental psychological needs (FPNs). Baseline and benchmark datasets were collected from human users and designers to develop an empathic accuracy metric for measuring the mental inference performance of LLMs. The empathic accuracy of inf",
    "path": "papers/24/03/2403.13301.json",
    "total_tokens": 786,
    "translated_title": "从言语中阅读用户心思：基于LLM的移情心理推理研究",
    "translated_abstract": "在以人为中心的设计中，发展对用户体验的全面深入理解，即共情理解，对于设计真正满足人类需求的产品至关重要。然而，准确理解大人口群体真实的潜在心理状态在今天仍然是一个重大挑战。本文调查了使用大型语言模型（LLMs）执行心理推理任务，特别是推断用户的潜在目标和基本心理需求（FPNs）。从人类用户和设计者那里收集了基准和基准数据集，以开发一个共情准确度指标，用于衡量LLMs的心理推理性能。",
    "tldr": "本论文研究了使用大型语言模型（LLMs）进行心智推断任务，特别是推断用户的潜在目标和基本心理需求（FPNs），并提出了一种衡量LLMs心理推理性能的共情准确度指标。",
    "en_tdlr": "This paper investigates the use of Large Language Models (LLMs) for performing mental inference tasks, specifically inferring users' underlying goals and fundamental psychological needs (FPNs), and proposes an empathic accuracy metric for measuring the mental inference performance of LLMs."
}