{
    "title": "Domain-Guided Masked Autoencoders for Unique Player Identification",
    "abstract": "arXiv:2403.11328v1 Announce Type: cross  Abstract: Unique player identification is a fundamental module in vision-driven sports analytics. Identifying players from broadcast videos can aid with various downstream tasks such as player assessment, in-game analysis, and broadcast production. However, automatic detection of jersey numbers using deep features is challenging primarily due to: a) motion blur, b) low resolution video feed, and c) occlusions. With their recent success in various vision tasks, masked autoencoders (MAEs) have emerged as a superior alternative to conventional feature extractors. However, most MAEs simply zero-out image patches either randomly or focus on where to mask rather than how to mask. Motivated by human vision, we devise a novel domain-guided masking policy for MAEs termed d-MAE to facilitate robust feature extraction in the presence of motion blur for player identification. We further introduce a new spatio-temporal network leveraging our novel d-MAE for ",
    "link": "https://arxiv.org/abs/2403.11328",
    "context": "Title: Domain-Guided Masked Autoencoders for Unique Player Identification\nAbstract: arXiv:2403.11328v1 Announce Type: cross  Abstract: Unique player identification is a fundamental module in vision-driven sports analytics. Identifying players from broadcast videos can aid with various downstream tasks such as player assessment, in-game analysis, and broadcast production. However, automatic detection of jersey numbers using deep features is challenging primarily due to: a) motion blur, b) low resolution video feed, and c) occlusions. With their recent success in various vision tasks, masked autoencoders (MAEs) have emerged as a superior alternative to conventional feature extractors. However, most MAEs simply zero-out image patches either randomly or focus on where to mask rather than how to mask. Motivated by human vision, we devise a novel domain-guided masking policy for MAEs termed d-MAE to facilitate robust feature extraction in the presence of motion blur for player identification. We further introduce a new spatio-temporal network leveraging our novel d-MAE for ",
    "path": "papers/24/03/2403.11328.json",
    "total_tokens": 881,
    "translated_title": "领域引导的遮罩自动编码器用于独特球员识别",
    "translated_abstract": "独特球员识别是视觉驱动体育分析中的一个基本模块。从广播视频中识别球员可以帮助各种下游任务，如球员评估、比赛分析和转播制作。然而，使用深度特征自动检测球衣号码具有挑战性，主要原因包括：a）运动模糊，b）低分辨率视频信号，和c）遮挡。遮罩自动编码器（MAEs）以在各种视觉任务中取得成功而脱颖而出，成为传统特征提取器的优越替代品。然而，大多数MAEs只是简单地将图像补丁置零，要么随机要么关注于在哪里遮罩，而不是如何遮罩。受人类视觉的启发，我们设计了一种新颖的领域引导遮罩策略，用于促进d-MAE以提高在运动模糊存在的情况下进行球员识别的稳健特征提取。",
    "tldr": "设计了一种新颖的领域引导遮罩策略d-MAE，用于在存在运动模糊的情况下进行球员识别的稳健特征提取。",
    "en_tdlr": "A novel domain-guided masking policy d-MAE is designed for robust feature extraction in player identification in the presence of motion blur."
}