{
    "title": "Learning to Ask Critical Questions for Assisting Product Search",
    "abstract": "arXiv:2403.02754v1 Announce Type: new  Abstract: Product search plays an essential role in eCommerce. It was treated as a special type of information retrieval problem. Most existing works make use of historical data to improve the search performance, which do not take the opportunity to ask for user's current interest directly. Some session-aware methods take the user's clicks within the session as implicit feedback, but it is still just a guess on user's preference. To address this problem, recent conversational or question-based search models interact with users directly for understanding the user's interest explicitly. However, most users do not have a clear picture on what to buy at the initial stage. Asking critical attributes that the user is looking for after they explored for a while should be a more efficient way to help them searching for the target items. In this paper, we propose a dual-learning model that hybrids the best from both implicit session feedback and proactivel",
    "link": "https://arxiv.org/abs/2403.02754",
    "context": "Title: Learning to Ask Critical Questions for Assisting Product Search\nAbstract: arXiv:2403.02754v1 Announce Type: new  Abstract: Product search plays an essential role in eCommerce. It was treated as a special type of information retrieval problem. Most existing works make use of historical data to improve the search performance, which do not take the opportunity to ask for user's current interest directly. Some session-aware methods take the user's clicks within the session as implicit feedback, but it is still just a guess on user's preference. To address this problem, recent conversational or question-based search models interact with users directly for understanding the user's interest explicitly. However, most users do not have a clear picture on what to buy at the initial stage. Asking critical attributes that the user is looking for after they explored for a while should be a more efficient way to help them searching for the target items. In this paper, we propose a dual-learning model that hybrids the best from both implicit session feedback and proactivel",
    "path": "papers/24/03/2403.02754.json",
    "total_tokens": 770,
    "translated_title": "学习提出关键问题以帮助产品搜索",
    "translated_abstract": "产品搜索在电子商务中扮演着至关重要的角色，它被视为一种特殊类型的信息检索问题。大多数现有的工作利用历史数据来提升搜索性能，未直接利用用户当前的兴趣。为了解决这个问题，最近的对话或基于问题的搜索模型直接与用户交互，以明确了解用户的兴趣。然而，大多数用户在最初阶段并不清楚要购买什么。在用户探索一段时间后询问用户正在寻找的关键属性应该是帮助他们搜索目标项目的更有效方式。本文提出了一个混合了隐式会话反馈和主动学习的双学习模型。",
    "tldr": "提出了一个双学习模型，结合了隐式会话反馈和主动学习的最佳方法，以问询用户在探索一段时间后正在寻找的关键属性来帮助产品搜索。",
    "en_tdlr": "Proposed a dual-learning model that hybrids the best from both implicit session feedback and proactive learning, to ask critical attributes that the user is looking for after they explored for a while to assist product search."
}