{
    "title": "A comprehensive study on Frequent Pattern Mining and Clustering categories for topic detection in Persian text stream",
    "abstract": "arXiv:2403.10237v1 Announce Type: new  Abstract: Topic detection is a complex process and depends on language because it somehow needs to analyze text. There have been few studies on topic detection in Persian, and the existing algorithms are not remarkable. Therefore, we aimed to study topic detection in Persian. The objectives of this study are: 1) to conduct an extensive study on the best algorithms for topic detection, 2) to identify necessary adaptations to make these algorithms suitable for the Persian language, and 3) to evaluate their performance on Persian social network texts. To achieve these objectives, we have formulated two research questions: First, considering the lack of research in Persian, what modifications should be made to existing frameworks, especially those developed in English, to make them compatible with Persian? Second, how do these algorithms perform, and which one is superior? There are various topic detection methods that can be categorized into differen",
    "link": "https://arxiv.org/abs/2403.10237",
    "context": "Title: A comprehensive study on Frequent Pattern Mining and Clustering categories for topic detection in Persian text stream\nAbstract: arXiv:2403.10237v1 Announce Type: new  Abstract: Topic detection is a complex process and depends on language because it somehow needs to analyze text. There have been few studies on topic detection in Persian, and the existing algorithms are not remarkable. Therefore, we aimed to study topic detection in Persian. The objectives of this study are: 1) to conduct an extensive study on the best algorithms for topic detection, 2) to identify necessary adaptations to make these algorithms suitable for the Persian language, and 3) to evaluate their performance on Persian social network texts. To achieve these objectives, we have formulated two research questions: First, considering the lack of research in Persian, what modifications should be made to existing frameworks, especially those developed in English, to make them compatible with Persian? Second, how do these algorithms perform, and which one is superior? There are various topic detection methods that can be categorized into differen",
    "path": "papers/24/03/2403.10237.json",
    "total_tokens": 910,
    "translated_title": "在波斯文本流中对频繁模式挖掘和聚类类别进行主题检测的综合研究",
    "translated_abstract": "主题检测是一个复杂的过程，取决于语言，因为它需要对文本进行分析。迄今为止，在波斯文主题检测方面的研究很少，现有的算法并不引人注目。因此，我们旨在研究波斯文主题检测。本研究的目标是：1）对主题检测的最佳算法进行广泛研究，2）确定必要的调整，使这些算法适用于波斯语，3）评估它们在波斯社交网络文本上的性能。为实现这些目标，我们提出了两个研究问题：第一，鉴于波斯语研究不足，应对现有框架进行何种修改，特别是那些用英语开发的框架，以使它们与波斯语兼容？第二，这些算法的表现如何，哪种算法更优？有各种主题检测方法可以归为不同类别",
    "tldr": "本研究旨在深入研究波斯文主题检测中的最佳算法，确定对这些算法进行适配以适用于波斯语的必要改动，并在波斯社交网络文本上评估它们的性能。",
    "en_tdlr": "This study aims to explore the best algorithms for topic detection in Persian, identify necessary adaptations to make these algorithms compatible with the Persian language, and evaluate their performance on Persian social network texts."
}