{
    "title": "On using Machine Learning Algorithms for Motorcycle Collision Detection",
    "abstract": "arXiv:2403.09491v1 Announce Type: new  Abstract: Globally, motorcycles attract vast and varied users. However, since the rate of severe injury and fatality in motorcycle accidents far exceeds passenger car accidents, efforts have been directed toward increasing passive safety systems. Impact simulations show that the risk of severe injury or death in the event of a motorcycle-to-car impact can be greatly reduced if the motorcycle is equipped with passive safety measures such as airbags and seat belts. For the passive safety systems to be activated, a collision must be detected within milliseconds for a wide variety of impact configurations, but under no circumstances may it be falsely triggered. For the challenge of reliably detecting impending collisions, this paper presents an investigation towards the applicability of machine learning algorithms. First, a series of simulations of accidents and driving operation is introduced to collect data to train machine learning classification m",
    "link": "https://arxiv.org/abs/2403.09491",
    "context": "Title: On using Machine Learning Algorithms for Motorcycle Collision Detection\nAbstract: arXiv:2403.09491v1 Announce Type: new  Abstract: Globally, motorcycles attract vast and varied users. However, since the rate of severe injury and fatality in motorcycle accidents far exceeds passenger car accidents, efforts have been directed toward increasing passive safety systems. Impact simulations show that the risk of severe injury or death in the event of a motorcycle-to-car impact can be greatly reduced if the motorcycle is equipped with passive safety measures such as airbags and seat belts. For the passive safety systems to be activated, a collision must be detected within milliseconds for a wide variety of impact configurations, but under no circumstances may it be falsely triggered. For the challenge of reliably detecting impending collisions, this paper presents an investigation towards the applicability of machine learning algorithms. First, a series of simulations of accidents and driving operation is introduced to collect data to train machine learning classification m",
    "path": "papers/24/03/2403.09491.json",
    "total_tokens": 849,
    "translated_title": "利用机器学习算法进行摩托车碰撞检测",
    "translated_abstract": "全球范围内，摩托车吸引了大量不同类型的用户。然而，由于摩托车事故中严重伤亡率远远超过客车事故，人们一直致力于增加被动安全系统。碰撞模拟显示，如果摩托车配备了诸如气囊和安全带等被动安全措施，那么在摩托车与汽车碰撞时，严重受伤或死亡的风险可以大大降低。为了使被动安全系统被激活，必须在毫秒内检测到碰撞，涉及各种碰撞配置，但绝不能误触发。为了可靠地检测即将发生的碰撞，本文介绍了一项关于机器学习算法适用性的研究。首先，引入了一系列事故和驾驶操作模拟来收集数据，以用于训练机器学习分类器。",
    "tldr": "本文研究了机器学习算法在摩托车碰撞检测中的应用，通过数据收集和训练分类器，探讨了可靠地检测即将发生的碰撞的挑战。",
    "en_tdlr": "This paper investigates the application of machine learning algorithms for motorcycle collision detection, exploring the challenge of reliably detecting impending collisions through data collection and classifier training."
}