{
    "title": "HyPer-EP: Meta-Learning Hybrid Personalized Models for Cardiac Electrophysiology",
    "abstract": "arXiv:2403.15433v1 Announce Type: cross  Abstract: Personalized virtual heart models have demonstrated increasing potential for clinical use, although the estimation of their parameters given patient-specific data remain a challenge. Traditional physics-based modeling approaches are computationally costly and often neglect the inherent structural errors in these models due to model simplifications and assumptions. Modern deep learning approaches, on the other hand, rely heavily on data supervision and lacks interpretability. In this paper, we present a novel hybrid modeling framework to describe a personalized cardiac digital twin as a combination of a physics-based known expression augmented by neural network modeling of its unknown gap to reality. We then present a novel meta-learning framework to enable the separate identification of both the physics-based and neural components in the hybrid model. We demonstrate the feasibility and generality of this hybrid modeling framework with ",
    "link": "https://arxiv.org/abs/2403.15433",
    "context": "Title: HyPer-EP: Meta-Learning Hybrid Personalized Models for Cardiac Electrophysiology\nAbstract: arXiv:2403.15433v1 Announce Type: cross  Abstract: Personalized virtual heart models have demonstrated increasing potential for clinical use, although the estimation of their parameters given patient-specific data remain a challenge. Traditional physics-based modeling approaches are computationally costly and often neglect the inherent structural errors in these models due to model simplifications and assumptions. Modern deep learning approaches, on the other hand, rely heavily on data supervision and lacks interpretability. In this paper, we present a novel hybrid modeling framework to describe a personalized cardiac digital twin as a combination of a physics-based known expression augmented by neural network modeling of its unknown gap to reality. We then present a novel meta-learning framework to enable the separate identification of both the physics-based and neural components in the hybrid model. We demonstrate the feasibility and generality of this hybrid modeling framework with ",
    "path": "papers/24/03/2403.15433.json",
    "total_tokens": 877,
    "translated_title": "HyPer-EP: 为心脏电生理而元学习的混合个性化模型",
    "translated_abstract": "个性化虚拟心脏模型在临床上展示出越来越大的潜力，尽管在给定患者特定数据的情况下估计其参数仍然是一个挑战。传统的基于物理的建模方法在计算上成本高昂，往往忽视了这些模型中的结构性错误，这是由于模型简化和假设所造成的。另一方面，现代深度学习方法依赖于数据监督，并且缺乏可解释性。在本文中，我们提出了一个新颖的混合建模框架，将个性化心脏数字孪生描述为基于物理已知表达式和神经网络建模未知与现实之间差距的组合。然后，我们提出了一个新颖的元学习框架，以实现混合模型中基于物理和神经网络组件的分离识别。我们展示了这种混合建模框架的可行性和普适性。",
    "tldr": "提出了一个新颖的混合建模框架，结合了基于物理已知表达式和神经网络建模的元学习方法，用于描述个性化心脏数字孪生模型，实现了基于物理和神经网络组件的分离识别。",
    "en_tdlr": "Introduced a novel hybrid modeling framework combining physics-based known expression and neural network modeling with meta-learning for describing personalized cardiac digital twin models, enabling the separate identification of physics-based and neural components."
}