{
    "title": "AI Ethics: A Bibliometric Analysis, Critical Issues, and Key Gaps",
    "abstract": "arXiv:2403.14681v1 Announce Type: cross  Abstract: Artificial intelligence (AI) ethics has emerged as a burgeoning yet pivotal area of scholarly research. This study conducts a comprehensive bibliometric analysis of the AI ethics literature over the past two decades. The analysis reveals a discernible tripartite progression, characterized by an incubation phase, followed by a subsequent phase focused on imbuing AI with human-like attributes, culminating in a third phase emphasizing the development of human-centric AI systems. After that, they present seven key AI ethics issues, encompassing the Collingridge dilemma, the AI status debate, challenges associated with AI transparency and explainability, privacy protection complications, considerations of justice and fairness, concerns about algocracy and human enfeeblement, and the issue of superintelligence. Finally, they identify two notable research gaps in AI ethics regarding the large ethics model (LEM) and AI identification and exten",
    "link": "https://arxiv.org/abs/2403.14681",
    "context": "Title: AI Ethics: A Bibliometric Analysis, Critical Issues, and Key Gaps\nAbstract: arXiv:2403.14681v1 Announce Type: cross  Abstract: Artificial intelligence (AI) ethics has emerged as a burgeoning yet pivotal area of scholarly research. This study conducts a comprehensive bibliometric analysis of the AI ethics literature over the past two decades. The analysis reveals a discernible tripartite progression, characterized by an incubation phase, followed by a subsequent phase focused on imbuing AI with human-like attributes, culminating in a third phase emphasizing the development of human-centric AI systems. After that, they present seven key AI ethics issues, encompassing the Collingridge dilemma, the AI status debate, challenges associated with AI transparency and explainability, privacy protection complications, considerations of justice and fairness, concerns about algocracy and human enfeeblement, and the issue of superintelligence. Finally, they identify two notable research gaps in AI ethics regarding the large ethics model (LEM) and AI identification and exten",
    "path": "papers/24/03/2403.14681.json",
    "total_tokens": 916,
    "translated_title": "AI伦理学：文献计量分析、关键问题和主要研究空白",
    "translated_abstract": "人工智能（AI）伦理学已经成为一个日益重要的学术研究领域。本研究对过去二十年的AI伦理学文献进行了全面的计量分析。分析揭示了一个明显的三部曲发展过程，包括一个孵化阶段，随后是专注于赋予AI人类属性的阶段，最终是强调发展以人为中心的AI系统的第三阶段。在此基础上，作者提出了七个关键AI伦理问题，涵盖了Collingridge困境、AI地位辩论、与AI透明度和可解释性相关的挑战、隐私保护复杂性、对公正和公平的考虑、对算法统治和人类衰弱的担忧，以及超智能的问题。最后，他们确定了AI伦理学中两个值得关注的研究空白，即大伦理模型（LEM）和AI识别与扩展。",
    "tldr": "通过对过去二十年的AI伦理学文献进行全面计量分析，揭示了AI伦理研究的发展三部曲，并提出了七个关键AI伦理问题，同时指出了关于大伦理模型（LEM）和AI识别与扩展的两个研究空白。"
}