{
    "title": "Recommending Missed Citations Identified by Reviewers: A New Task, Dataset and Baselines",
    "abstract": "arXiv:2403.01873v1 Announce Type: new  Abstract: Citing comprehensively and appropriately has become a challenging task with the explosive growth of scientific publications. Current citation recommendation systems aim to recommend a list of scientific papers for a given text context or a draft paper. However, none of the existing work focuses on already included citations of full papers, which are imperfect and still have much room for improvement. In the scenario of peer reviewing, it is a common phenomenon that submissions are identified as missing vital citations by reviewers. This may lead to a negative impact on the credibility and validity of the research presented. To help improve citations of full papers, we first define a novel task of Recommending Missed Citations Identified by Reviewers (RMC) and construct a corresponding expert-labeled dataset called CitationR. We conduct an extensive evaluation of several state-of-the-art methods on CitationR. Furthermore, we propose a new",
    "link": "https://arxiv.org/abs/2403.01873",
    "context": "Title: Recommending Missed Citations Identified by Reviewers: A New Task, Dataset and Baselines\nAbstract: arXiv:2403.01873v1 Announce Type: new  Abstract: Citing comprehensively and appropriately has become a challenging task with the explosive growth of scientific publications. Current citation recommendation systems aim to recommend a list of scientific papers for a given text context or a draft paper. However, none of the existing work focuses on already included citations of full papers, which are imperfect and still have much room for improvement. In the scenario of peer reviewing, it is a common phenomenon that submissions are identified as missing vital citations by reviewers. This may lead to a negative impact on the credibility and validity of the research presented. To help improve citations of full papers, we first define a novel task of Recommending Missed Citations Identified by Reviewers (RMC) and construct a corresponding expert-labeled dataset called CitationR. We conduct an extensive evaluation of several state-of-the-art methods on CitationR. Furthermore, we propose a new",
    "path": "papers/24/03/2403.01873.json",
    "total_tokens": 852,
    "translated_title": "推荐评论者标识的遗漏引用：一项新任务、数据集和基准",
    "translated_abstract": "随着科学出版物数量的爆炸性增长，全面和恰当地引用已经成为一项具有挑战性的任务。目前的引用推荐系统旨在为给定文本环境或草稿推荐一系列科学论文。然而，现有工作都没有着重于已经包含在完整论文中的引用，这些引用并不完美，仍有很大的改进空间。在同行评审的场景中，提交的论文被评论者标识为遗漏重要引用是一种常见现象。这可能会对所呈现的研究的可信度和有效性产生负面影响。为了帮助改进完整论文的引用，我们首先定义了一个新任务——推荐评论者标识的遗漏引用（RMC），并构建了一个相应的专家标记数据集称为CitationR。我们在CitationR上对几种最先进方法进行了广泛评估。此外，我们提出了一种新的",
    "tldr": "该论文定义了一个新任务——推荐评论者标识的遗漏引用(RMC)，并构建了对应的数据集CitationR，以改进完整论文的引用。",
    "en_tdlr": "This paper defines a new task of Recommending Missed Citations Identified by Reviewers (RMC), constructs a corresponding dataset CitationR to improve citations of full papers."
}