{
    "title": "What has LeBenchmark Learnt about French Syntax?",
    "abstract": "arXiv:2403.02173v1 Announce Type: new  Abstract: The paper reports on a series of experiments aiming at probing LeBenchmark, a pretrained acoustic model trained on 7k hours of spoken French, for syntactic information. Pretrained acoustic models are increasingly used for downstream speech tasks such as automatic speech recognition, speech translation, spoken language understanding or speech parsing. They are trained on very low level information (the raw speech signal), and do not have explicit lexical knowledge. Despite that, they obtained reasonable results on tasks that requires higher level linguistic knowledge. As a result, an emerging question is whether these models encode syntactic information. We probe each representation layer of LeBenchmark for syntax, using the Orf\\'eo treebank, and observe that it has learnt some syntactic information. Our results show that syntactic information is more easily extractable from the middle layers of the network, after which a very sharp decre",
    "link": "https://arxiv.org/abs/2403.02173",
    "context": "Title: What has LeBenchmark Learnt about French Syntax?\nAbstract: arXiv:2403.02173v1 Announce Type: new  Abstract: The paper reports on a series of experiments aiming at probing LeBenchmark, a pretrained acoustic model trained on 7k hours of spoken French, for syntactic information. Pretrained acoustic models are increasingly used for downstream speech tasks such as automatic speech recognition, speech translation, spoken language understanding or speech parsing. They are trained on very low level information (the raw speech signal), and do not have explicit lexical knowledge. Despite that, they obtained reasonable results on tasks that requires higher level linguistic knowledge. As a result, an emerging question is whether these models encode syntactic information. We probe each representation layer of LeBenchmark for syntax, using the Orf\\'eo treebank, and observe that it has learnt some syntactic information. Our results show that syntactic information is more easily extractable from the middle layers of the network, after which a very sharp decre",
    "path": "papers/24/03/2403.02173.json",
    "total_tokens": 833,
    "translated_title": "LeBenchmark对法语句法学习了什么？",
    "translated_abstract": "这篇论文报告了一系列旨在探究LeBenchmark的实验，LeBenchmark是一个在7000小时的法语口语上训练的预训练声学模型，用于获取句法信息。预训练的声学模型越来越多地用于下游语音任务，如自动语音识别、语音翻译、口语理解或语音解析。 尽管它们是在非常低级的信息（原始语音信号）上训练的，并且没有明确的词汇知识，但它们在需要更高级别语言知识的任务上取得了合理的结果。因此，一个新兴的问题是这些模型是否对句法信息进行编码。我们使用Orf\\'eo树库来探究LeBenchmark的每个表示层的句法，并观察到它已经学会了一些句法信息。我们的结果表明，句法信息在网络的中间层更容易被抽取出来，之后是一个非常陡峭的下降。",
    "tldr": "论文探讨了LeBenchmark这个预训练声学模型对法语句法信息的学习情况，结果显示模型在中间层学习到了一些句法信息。",
    "en_tdlr": "The paper investigates what the LeBenchmark pretrained acoustic model has learned about French syntax, finding that the model has acquired some syntactic information in its middle layers."
}