{
    "title": "Virtual birefringence imaging and histological staining of amyloid deposits in label-free tissue using autofluorescence microscopy and deep learning",
    "abstract": "arXiv:2403.09100v1 Announce Type: cross  Abstract: Systemic amyloidosis is a group of diseases characterized by the deposition of misfolded proteins in various organs and tissues, leading to progressive organ dysfunction and failure. Congo red stain is the gold standard chemical stain for the visualization of amyloid deposits in tissue sections, as it forms complexes with the misfolded proteins and shows a birefringence pattern under polarized light microscopy. However, Congo red staining is tedious and costly to perform, and prone to false diagnoses due to variations in the amount of amyloid, staining quality and expert interpretation through manual examination of tissue under a polarization microscope. Here, we report the first demonstration of virtual birefringence imaging and virtual Congo red staining of label-free human tissue to show that a single trained neural network can rapidly transform autofluorescence images of label-free tissue sections into brightfield and polarized lig",
    "link": "https://arxiv.org/abs/2403.09100",
    "context": "Title: Virtual birefringence imaging and histological staining of amyloid deposits in label-free tissue using autofluorescence microscopy and deep learning\nAbstract: arXiv:2403.09100v1 Announce Type: cross  Abstract: Systemic amyloidosis is a group of diseases characterized by the deposition of misfolded proteins in various organs and tissues, leading to progressive organ dysfunction and failure. Congo red stain is the gold standard chemical stain for the visualization of amyloid deposits in tissue sections, as it forms complexes with the misfolded proteins and shows a birefringence pattern under polarized light microscopy. However, Congo red staining is tedious and costly to perform, and prone to false diagnoses due to variations in the amount of amyloid, staining quality and expert interpretation through manual examination of tissue under a polarization microscope. Here, we report the first demonstration of virtual birefringence imaging and virtual Congo red staining of label-free human tissue to show that a single trained neural network can rapidly transform autofluorescence images of label-free tissue sections into brightfield and polarized lig",
    "path": "papers/24/03/2403.09100.json",
    "total_tokens": 972,
    "translated_title": "使用自发荧光显微镜和深度学习实现对不加标记组织中淀粉样沉积的虚拟双折射成像和组织学染色",
    "translated_abstract": "系统性淀粉样变性病是一组疾病，其特征是各种器官和组织中错折蛋白的沉积，导致器官功能逐渐受损和衰竭。刚果红染色是在组织切片中可视化淀粉样沉积的金标准化学染色方法，因为它与错折蛋白形成复合物，在偏振光显微镜下呈现双折射图案。然而，刚果红染色是费时且昂贵的，并且容易出现误诊，因为淀粉量、染色质量和专家解释受到变化，需要通过对组织在偏振显微镜下的手动检查来进行。本文报道了首次演示了对不加标记人类组织的虚拟双折射成像和虚拟刚果红染色，表明单个经过训练的神经网络可以快速地将不加标记组织切片的自发荧光图像转换为明场和偏振光图像。",
    "tldr": "首次实现了对不加标记组织进行虚拟双折射成像和虚拟刚果红染色，通过深度学习将自发荧光图像转换为明场和偏振光图像。"
}