{
    "title": "A Modified Word Saliency-Based Adversarial Attack on Text Classification Models",
    "abstract": "arXiv:2403.11297v1 Announce Type: new  Abstract: This paper introduces a novel adversarial attack method targeting text classification models, termed the Modified Word Saliency-based Adversarial At-tack (MWSAA). The technique builds upon the concept of word saliency to strategically perturb input texts, aiming to mislead classification models while preserving semantic coherence. By refining the traditional adversarial attack approach, MWSAA significantly enhances its efficacy in evading detection by classification systems. The methodology involves first identifying salient words in the input text through a saliency estimation process, which prioritizes words most influential to the model's decision-making process. Subsequently, these salient words are subjected to carefully crafted modifications, guided by semantic similarity metrics to ensure that the altered text remains coherent and retains its original meaning. Empirical evaluations conducted on diverse text classification datasets",
    "link": "https://arxiv.org/abs/2403.11297",
    "context": "Title: A Modified Word Saliency-Based Adversarial Attack on Text Classification Models\nAbstract: arXiv:2403.11297v1 Announce Type: new  Abstract: This paper introduces a novel adversarial attack method targeting text classification models, termed the Modified Word Saliency-based Adversarial At-tack (MWSAA). The technique builds upon the concept of word saliency to strategically perturb input texts, aiming to mislead classification models while preserving semantic coherence. By refining the traditional adversarial attack approach, MWSAA significantly enhances its efficacy in evading detection by classification systems. The methodology involves first identifying salient words in the input text through a saliency estimation process, which prioritizes words most influential to the model's decision-making process. Subsequently, these salient words are subjected to carefully crafted modifications, guided by semantic similarity metrics to ensure that the altered text remains coherent and retains its original meaning. Empirical evaluations conducted on diverse text classification datasets",
    "path": "papers/24/03/2403.11297.json",
    "total_tokens": 860,
    "translated_title": "对文本分类模型的一种修改的基于词显著性的对抗攻击",
    "translated_abstract": "本文介绍了一种新型的针对文本分类模型的对抗攻击方法，称为修改的基于词显著性的对抗攻击（MWSAA）。该技术基于词显著性的概念，通过战略性地扰乱输入文本，旨在误导分类模型同时保持语义连贯性。通过改进传统的对抗攻击方法，MWSAA显著增强了其规避分类系统检测的效果。该方法首先通过显著性估计过程识别输入文本中的显著词，这些词对模型的决策过程具有最大影响。随后，这些显著词经过精心设计的修改，引导语义相似性度量来确保改变的文本保持连贯并保留其原始含义。在不同的文本分类数据集上进行了实证评估。",
    "tldr": "本文介绍了一种修改的基于词显著性的对抗攻击方法，通过对模型最具影响力的词进行修改，旨在欺骗分类模型且保持语义连贯性，在提高攻击效果的同时避开了分类系统的检测。",
    "en_tdlr": "This paper presents a modified word saliency-based adversarial attack method that strategically modifies influential words to deceive text classification models while maintaining semantic coherence, enhancing attack effectiveness and evading detection by classification systems."
}