{
    "title": "Third-Party Language Model Performance Prediction from Instruction",
    "abstract": "arXiv:2403.12413v1 Announce Type: new  Abstract: Language model-based instruction-following systems have lately shown increasing performance on many benchmark tasks, demonstrating the capability of adapting to a broad variety of instructions. However, such systems are often not designed to be transparent about their limitations; a user may easily prompt a model with an instruction without any idea of whether the responses should be expected to be accurate, or if the system is even capable of performing the task. We propose a third party performance prediction framework, where a separate model is trained to predict the metric resulting from evaluating an instruction-following system on a task while assuming access only to its inputs and outputs at inference time. We perform this analysis with a variety of both open and closed instruction-following models as well as multiple performance predictors, and examine the effect of various factors such as model size, number of training tasks, an",
    "link": "https://arxiv.org/abs/2403.12413",
    "context": "Title: Third-Party Language Model Performance Prediction from Instruction\nAbstract: arXiv:2403.12413v1 Announce Type: new  Abstract: Language model-based instruction-following systems have lately shown increasing performance on many benchmark tasks, demonstrating the capability of adapting to a broad variety of instructions. However, such systems are often not designed to be transparent about their limitations; a user may easily prompt a model with an instruction without any idea of whether the responses should be expected to be accurate, or if the system is even capable of performing the task. We propose a third party performance prediction framework, where a separate model is trained to predict the metric resulting from evaluating an instruction-following system on a task while assuming access only to its inputs and outputs at inference time. We perform this analysis with a variety of both open and closed instruction-following models as well as multiple performance predictors, and examine the effect of various factors such as model size, number of training tasks, an",
    "path": "papers/24/03/2403.12413.json",
    "total_tokens": 814,
    "translated_title": "来自指令的第三方语言模型性能预测",
    "translated_abstract": "基于语言模型的指令跟随系统最近在许多基准任务上表现出越来越好的性能，展现出适应各种指令的能力。然而，这些系统通常未设计成透明地展示其局限性；用户可能会轻易用指令提示一个模型，却对其响应是否应该准确一无所知，甚至不知道系统是否有能力执行任务。我们提出了一个第三方性能预测框架，其中单独训练一个模型来预测在推断时仅假设访问其输入和输出的情况下评估任务上的指令跟随系统时产生的度量标准。我们使用多种开放和封闭的指令跟随模型以及多个性能预测器来进行这项分析，并检验各种因素的影响，如模型大小、训练任务数量等。",
    "tldr": "提出了一种第三方性能预测框架，用于预测评估指令跟随系统在任务上表现的度量标准，从而解决用户无法了解系统可靠性的问题。",
    "en_tdlr": "Propose a third-party performance prediction framework to predict the metric resulting from evaluating an instruction-following system on a task, addressing the issue of users' inability to understand the reliability of the system."
}