{
    "title": "Forecasting and Mitigating Disruptions in Public Bus Transit Services",
    "abstract": "arXiv:2403.04072v1 Announce Type: new  Abstract: Public transportation systems often suffer from unexpected fluctuations in demand and disruptions, such as mechanical failures and medical emergencies. These fluctuations and disruptions lead to delays and overcrowding, which are detrimental to the passengers' experience and to the overall performance of the transit service. To proactively mitigate such events, many transit agencies station substitute (reserve) vehicles throughout their service areas, which they can dispatch to augment or replace vehicles on routes that suffer overcrowding or disruption. However, determining the optimal locations where substitute vehicles should be stationed is a challenging problem due to the inherent randomness of disruptions and due to the combinatorial nature of selecting locations across a city. In collaboration with the transit agency of Nashville, TN, we address this problem by introducing data-driven statistical and machine-learning models for fo",
    "link": "https://arxiv.org/abs/2403.04072",
    "context": "Title: Forecasting and Mitigating Disruptions in Public Bus Transit Services\nAbstract: arXiv:2403.04072v1 Announce Type: new  Abstract: Public transportation systems often suffer from unexpected fluctuations in demand and disruptions, such as mechanical failures and medical emergencies. These fluctuations and disruptions lead to delays and overcrowding, which are detrimental to the passengers' experience and to the overall performance of the transit service. To proactively mitigate such events, many transit agencies station substitute (reserve) vehicles throughout their service areas, which they can dispatch to augment or replace vehicles on routes that suffer overcrowding or disruption. However, determining the optimal locations where substitute vehicles should be stationed is a challenging problem due to the inherent randomness of disruptions and due to the combinatorial nature of selecting locations across a city. In collaboration with the transit agency of Nashville, TN, we address this problem by introducing data-driven statistical and machine-learning models for fo",
    "path": "papers/24/03/2403.04072.json",
    "total_tokens": 791,
    "translated_title": "预测和缓解公共公交服务中的中断",
    "translated_abstract": "公共交通系统经常遭受需求的意外波动和中断，例如机械故障和医疗紧急情况。这些波动和中断导致延误和拥挤，这对乘客的体验和公共交通服务的整体性能都是有害的。为了积极减少这类事件，许多运输机构在其服务范围内设置替代（备用）车辆，它们可以调度这些车辆以增加或替代遭受拥挤或中断的路线上的车辆。然而，由于中断的固有随机性和在城市各地选择位置的组合性质，确定替代车辆应该设置的最佳位置是一个具有挑战性的问题。我们与田纳西州纳什维尔的运输机构合作，通过引入基于数据驱动的统计和机器学习模型来解决这一问题。",
    "tldr": "引入数据驱动的统计和机器学习模型，以解决公共公交服务中替代车辆最佳位置选择的挑战性问题",
    "en_tdlr": "Introducing data-driven statistical and machine-learning models to address the challenging problem of selecting optimal locations for substitute vehicles in public bus transit services."
}