{
    "title": "Graph Neural Network based Double Machine Learning Estimator of Network Causal Effects",
    "abstract": "arXiv:2403.11332v1 Announce Type: new  Abstract: Our paper addresses the challenge of inferring causal effects in social network data, characterized by complex interdependencies among individuals resulting in challenges such as non-independence of units, interference (where a unit's outcome is affected by neighbors' treatments), and introduction of additional confounding factors from neighboring units. We propose a novel methodology combining graph neural networks and double machine learning, enabling accurate and efficient estimation of direct and peer effects using a single observational social network. Our approach utilizes graph isomorphism networks in conjunction with double machine learning to effectively adjust for network confounders and consistently estimate the desired causal effects. We demonstrate that our estimator is both asymptotically normal and semiparametrically efficient. A comprehensive evaluation against four state-of-the-art baseline methods using three semi-synth",
    "link": "https://arxiv.org/abs/2403.11332",
    "context": "Title: Graph Neural Network based Double Machine Learning Estimator of Network Causal Effects\nAbstract: arXiv:2403.11332v1 Announce Type: new  Abstract: Our paper addresses the challenge of inferring causal effects in social network data, characterized by complex interdependencies among individuals resulting in challenges such as non-independence of units, interference (where a unit's outcome is affected by neighbors' treatments), and introduction of additional confounding factors from neighboring units. We propose a novel methodology combining graph neural networks and double machine learning, enabling accurate and efficient estimation of direct and peer effects using a single observational social network. Our approach utilizes graph isomorphism networks in conjunction with double machine learning to effectively adjust for network confounders and consistently estimate the desired causal effects. We demonstrate that our estimator is both asymptotically normal and semiparametrically efficient. A comprehensive evaluation against four state-of-the-art baseline methods using three semi-synth",
    "path": "papers/24/03/2403.11332.json",
    "total_tokens": 818,
    "translated_title": "基于图神经网络的网络因果效应双机器学习估计器",
    "translated_abstract": "我们的论文解决了在社交网络数据中推断因果效应的挑战，这些数据具有个体之间复杂的相互依赖关系，导致单位之间不独立、干扰（单位的结果受邻居的处理影响）以及引入来自邻近单位的额外混杂因素等问题。我们提出了一种将图神经网络和双机器学习相结合的创新方法，能够使用单个观测社交网络准确高效地估计直接和同伴效应。我们的方法利用图同构网络与双机器学习相结合，有效调整网络混杂因素并一致地估计所需的因果效应。我们展示了我们的估计器既具有渐近正态性又半参数高效。我们对三个半合成状态下的四种最先进基线方法进行了全面评估",
    "tldr": "提出了一种结合图神经网络和双机器学习的新方法，能够准确和高效地估计直接和同行效应，处理网络混杂因素，并一致地估计所需的因果效应",
    "en_tdlr": "Introduced a novel method that combines graph neural networks and double machine learning to accurately and efficiently estimate direct and peer effects, handle network confounders, and consistently estimate desired causal effects."
}