{
    "title": "Word Order's Impacts: Insights from Reordering and Generation Analysis",
    "abstract": "arXiv:2403.11473v1 Announce Type: cross  Abstract: Existing works have studied the impacts of the order of words within natural text. They usually analyze it by destroying the original order of words to create a scrambled sequence, and then comparing the models' performance between the original and scrambled sequences. The experimental results demonstrate marginal drops. Considering this findings, different hypothesis about word order is proposed, including ``the order of words is redundant with lexical semantics'', and ``models do not rely on word order''. In this paper, we revisit the aforementioned hypotheses by adding a order reconstruction perspective, and selecting datasets of different spectrum. Specifically, we first select four different datasets, and then design order reconstruction and continuing generation tasks. Empirical findings support that ChatGPT relies on word order to infer, but cannot support or negate the redundancy relations between word order lexical semantics.",
    "link": "https://arxiv.org/abs/2403.11473",
    "context": "Title: Word Order's Impacts: Insights from Reordering and Generation Analysis\nAbstract: arXiv:2403.11473v1 Announce Type: cross  Abstract: Existing works have studied the impacts of the order of words within natural text. They usually analyze it by destroying the original order of words to create a scrambled sequence, and then comparing the models' performance between the original and scrambled sequences. The experimental results demonstrate marginal drops. Considering this findings, different hypothesis about word order is proposed, including ``the order of words is redundant with lexical semantics'', and ``models do not rely on word order''. In this paper, we revisit the aforementioned hypotheses by adding a order reconstruction perspective, and selecting datasets of different spectrum. Specifically, we first select four different datasets, and then design order reconstruction and continuing generation tasks. Empirical findings support that ChatGPT relies on word order to infer, but cannot support or negate the redundancy relations between word order lexical semantics.",
    "path": "papers/24/03/2403.11473.json",
    "total_tokens": 865,
    "translated_title": "词序的影响：重新排序和生成分析的洞察",
    "translated_abstract": "现有研究已经研究了自然语言文本中词语顺序的影响。它们通常通过打乱原始词序来创建一个混乱的序列进行分析，然后比较模型在原始序列和混乱序列之间的表现。实验结果表明存在一些小幅下降。考虑到这一发现，提出了不同的关于词序的假设，包括“词序与词汇语义重复”和“模型不依赖于词序”。在本文中，我们通过增加一个顺序重建的视角，选择不同范围的数据集来重新审视上述假设。具体而言，我们首先选择了四个不同的数据集，然后设计了顺序重建和连续生成任务。实证研究支持ChatGPT依赖于词序进行推断，但无法支持或否定词序与词汇语义之间的冗余关系。",
    "tldr": "本文通过顺序重建的角度重新审视了关于词序的假设，并通过选择不同范围的数据集进行了实验证明，ChatGPT依赖于词序进行推断，但不能明确支持或否定词序与词汇语义之间的冗余关系。",
    "en_tdlr": "This paper reconsiders hypotheses about word order by adding an order reconstruction perspective, conducting experiments with different datasets, and concludes that ChatGPT depends on word order for inference, but doesn't definitively support or negate the redundancy relations between word order and lexical semantics."
}