{
    "title": "A Differentially Private Clustering Algorithm for Well-Clustered Graphs",
    "abstract": "arXiv:2403.14332v1 Announce Type: cross  Abstract: We study differentially private (DP) algorithms for recovering clusters in well-clustered graphs, which are graphs whose vertex set can be partitioned into a small number of sets, each inducing a subgraph of high inner conductance and small outer conductance. Such graphs have widespread application as a benchmark in the theoretical analysis of spectral clustering. We provide an efficient ($\\epsilon$,$\\delta$)-DP algorithm tailored specifically for such graphs. Our algorithm draws inspiration from the recent work of Chen et al., who developed DP algorithms for recovery of stochastic block models in cases where the graph comprises exactly two nearly-balanced clusters. Our algorithm works for well-clustered graphs with $k$ nearly-balanced clusters, and the misclassification ratio almost matches the one of the best-known non-private algorithms. We conduct experimental evaluations on datasets with known ground truth clusters to substantiate",
    "link": "https://arxiv.org/abs/2403.14332",
    "context": "Title: A Differentially Private Clustering Algorithm for Well-Clustered Graphs\nAbstract: arXiv:2403.14332v1 Announce Type: cross  Abstract: We study differentially private (DP) algorithms for recovering clusters in well-clustered graphs, which are graphs whose vertex set can be partitioned into a small number of sets, each inducing a subgraph of high inner conductance and small outer conductance. Such graphs have widespread application as a benchmark in the theoretical analysis of spectral clustering. We provide an efficient ($\\epsilon$,$\\delta$)-DP algorithm tailored specifically for such graphs. Our algorithm draws inspiration from the recent work of Chen et al., who developed DP algorithms for recovery of stochastic block models in cases where the graph comprises exactly two nearly-balanced clusters. Our algorithm works for well-clustered graphs with $k$ nearly-balanced clusters, and the misclassification ratio almost matches the one of the best-known non-private algorithms. We conduct experimental evaluations on datasets with known ground truth clusters to substantiate",
    "path": "papers/24/03/2403.14332.json",
    "total_tokens": 831,
    "translated_title": "面向良好聚类图的差分隐私聚类算法",
    "translated_abstract": "我们研究了用于恢复良好聚类图中聚类的差分隐私（DP）算法，这些图的顶点集可以分为少量的集合，每个集合诱导出具有高内电导和小外电导的子图。这些图在谱聚类的理论分析中被广泛应用作为基准。我们提供了一个专门针对这种图设计的高效（ϵ，δ）-DP算法。我们的算法汲取了陈等人最近的研究成果，他们为图包含两个几乎平衡集群的情况开发了DP算法。我们的算法适用于具有k个几乎平衡集群的良好聚类图，并且误分类比率几乎与最佳已知的非私有算法相匹配。我们对已知地面真实聚类的数据集进行实验评估以证实",
    "tldr": "提出了一种面向良好聚类图的差分隐私聚类算法，适用于具有k个几乎平衡集群的图，误分类比率接近最佳非私有算法的水平",
    "en_tdlr": "Proposed a differentially private clustering algorithm for well-clustered graphs, applicable to graphs with k nearly-balanced clusters with a misclassification ratio close to the best non-private algorithms."
}