{
    "title": "Distributed agency in second language learning and teaching through generative AI",
    "abstract": "arXiv:2403.20216v1 Announce Type: cross  Abstract: Generative AI offers significant opportunities for language learning. Tools like ChatGPT can provide informal second language practice through chats in written or voice forms, with the learner specifying through prompts conversational parameters such as proficiency level, language register, and discussion topics. AI can be instructed to give corrective feedback, create practice exercises, or develop an extended study plan. Instructors can use AI to build learning and assessment materials in a variety of media. AI is likely to make immersive technologies more powerful and versatile, moving away from scripted interactions. For both learners and teachers, it is important to understand the limitations of AI systems that arise from their purely statistical model of human language, which limits their ability to deal with nuanced social and cultural aspects of language use. Additionally, there are ethical concerns over how AI systems are crea",
    "link": "https://arxiv.org/abs/2403.20216",
    "context": "Title: Distributed agency in second language learning and teaching through generative AI\nAbstract: arXiv:2403.20216v1 Announce Type: cross  Abstract: Generative AI offers significant opportunities for language learning. Tools like ChatGPT can provide informal second language practice through chats in written or voice forms, with the learner specifying through prompts conversational parameters such as proficiency level, language register, and discussion topics. AI can be instructed to give corrective feedback, create practice exercises, or develop an extended study plan. Instructors can use AI to build learning and assessment materials in a variety of media. AI is likely to make immersive technologies more powerful and versatile, moving away from scripted interactions. For both learners and teachers, it is important to understand the limitations of AI systems that arise from their purely statistical model of human language, which limits their ability to deal with nuanced social and cultural aspects of language use. Additionally, there are ethical concerns over how AI systems are crea",
    "path": "papers/24/03/2403.20216.json",
    "total_tokens": 848,
    "translated_title": "通过生成式人工智能在第二语言学习和教学中的分布式机构",
    "translated_abstract": "arXiv:2403.20216v1 公告类型: 交叉摘要: 生成式人工智能为语言学习提供了重大机会。像ChatGPT这样的工具可以通过书面或口头形式的对话为第二语言提供非正式练习，学习者通过提示指定对话参数，如熟练程度、语言风格和讨论主题。人工智能可以被指导给予纠正性反馈，创建练习题，或制定扩展学习计划。教师可以使用人工智能构建各种媒体的学习和评估材料。人工智能可能会使沉浸式技术更强大和多功能，摆脱脚本化的互动。对于学习者和教师而言，重要的是要理解人工智能系统的局限性，这些局限性来自于它们对人类语言的纯统计模型，限制了它们处理语言使用中微妙社会和文化方面的能力。此外，人工智能系统的创造方式存在伦理问题。",
    "tldr": "生成式人工智能在第二语言学习和教学中提供了分布式机构，并可能使沉浸式技术更强大和多功能。",
    "en_tdlr": "Generative AI provides distributed agency in second language learning and teaching, and may enhance immersive technologies."
}