{
    "title": "Learning to Deliver: a Foundation Model for the Montreal Capacitated Vehicle Routing Problem",
    "abstract": "arXiv:2403.00026v1 Announce Type: cross  Abstract: In this paper, we present the Foundation Model for the Montreal Capacitated Vehicle Routing Problem (FM-MCVRP), a novel Deep Learning (DL) model that approximates high-quality solutions to a variant of the Capacitated Vehicle Routing Problem (CVRP) that characterizes many real-world applications. The so-called Montreal Capacitated Vehicle Routing Problem (MCVRP), first formally described by Bengio et al. (2021), is defined on a fixed and finite graph, which is analogous to a city. Each MCVRP instance is essentially the sub-graph connecting a randomly sampled subset of the nodes in the fixed graph, which represent a set of potential addresses in a real-world delivery problem on a given day. Our work exploits this problem structure to frame the MCVRP as an analogous Natural Language Processing (NLP) task. Specifically, we leverage a Transformer architecture embedded in a Large Language Model (LLM) framework to train our model in a superv",
    "link": "https://arxiv.org/abs/2403.00026",
    "context": "Title: Learning to Deliver: a Foundation Model for the Montreal Capacitated Vehicle Routing Problem\nAbstract: arXiv:2403.00026v1 Announce Type: cross  Abstract: In this paper, we present the Foundation Model for the Montreal Capacitated Vehicle Routing Problem (FM-MCVRP), a novel Deep Learning (DL) model that approximates high-quality solutions to a variant of the Capacitated Vehicle Routing Problem (CVRP) that characterizes many real-world applications. The so-called Montreal Capacitated Vehicle Routing Problem (MCVRP), first formally described by Bengio et al. (2021), is defined on a fixed and finite graph, which is analogous to a city. Each MCVRP instance is essentially the sub-graph connecting a randomly sampled subset of the nodes in the fixed graph, which represent a set of potential addresses in a real-world delivery problem on a given day. Our work exploits this problem structure to frame the MCVRP as an analogous Natural Language Processing (NLP) task. Specifically, we leverage a Transformer architecture embedded in a Large Language Model (LLM) framework to train our model in a superv",
    "path": "papers/24/03/2403.00026.json",
    "total_tokens": 870,
    "translated_title": "学习交付：蒙特利尔容量车辆路径问题的基础模型",
    "translated_abstract": "在本文中，我们提出了蒙特利尔容量车辆路径问题（MCVRP）的基础模型（FM-MCVRP），这是一个新颖的深度学习（DL）模型，用于近似解决一个变体的容量车辆路径问题（CVRP），该问题描述了许多现实世界的应用场景。MCVRP首次由Bengio等人（2021）正式描述，定义在一个固定有限的图上，类似于一个城市。每个MCVRP实例本质上是连接固定图中随机抽样节点的子图，这些节点代表给定日期实际交付问题中潜在地址集合。我们利用这个问题结构，将MCVRP构建成类似的自然语言处理（NLP）任务。具体来说，我们利用Transformer架构嵌入到大型语言模型（LLM）框架中，来训练我们的模型。",
    "tldr": "提出了蒙特利尔容量车辆路径问题的基础模型（FM-MCVRP），将MCVRP视为类似自然语言处理任务，并利用Transformer架构嵌入大型语言模型框架进行训练。",
    "en_tdlr": "Introducing the Foundation Model for the Montreal Capacitated Vehicle Routing Problem (FM-MCVRP), framing MCVRP as a Natural Language Processing task and training the model using a Transformer architecture embedded in a Large Language Model framework."
}