{
    "title": "Fine-grainedly Synthesize Streaming Data Based On Large Language Models With Graph Structure Understanding For Data Sparsity",
    "abstract": "arXiv:2403.06139v1 Announce Type: cross  Abstract: Due to the sparsity of user data, sentiment analysis on user reviews in e-commerce platforms often suffers from poor performance, especially when faced with extremely sparse user data or long-tail labels. Recently, the emergence of LLMs has introduced new solutions to such problems by leveraging graph structures to generate supplementary user profiles. However, previous approaches have not fully utilized the graph understanding capabilities of LLMs and have struggled to adapt to complex streaming data environments. In this work, we propose a fine-grained streaming data synthesis framework that categorizes sparse users into three categories: Mid-tail, Long-tail, and Extreme. Specifically, we design LLMs to comprehensively understand three key graph elements in streaming data, including Local-global Graph Understanding, Second-Order Relationship Extraction, and Product Attribute Understanding, which enables the generation of high-quality",
    "link": "https://arxiv.org/abs/2403.06139",
    "context": "Title: Fine-grainedly Synthesize Streaming Data Based On Large Language Models With Graph Structure Understanding For Data Sparsity\nAbstract: arXiv:2403.06139v1 Announce Type: cross  Abstract: Due to the sparsity of user data, sentiment analysis on user reviews in e-commerce platforms often suffers from poor performance, especially when faced with extremely sparse user data or long-tail labels. Recently, the emergence of LLMs has introduced new solutions to such problems by leveraging graph structures to generate supplementary user profiles. However, previous approaches have not fully utilized the graph understanding capabilities of LLMs and have struggled to adapt to complex streaming data environments. In this work, we propose a fine-grained streaming data synthesis framework that categorizes sparse users into three categories: Mid-tail, Long-tail, and Extreme. Specifically, we design LLMs to comprehensively understand three key graph elements in streaming data, including Local-global Graph Understanding, Second-Order Relationship Extraction, and Product Attribute Understanding, which enables the generation of high-quality",
    "path": "papers/24/03/2403.06139.json",
    "total_tokens": 812,
    "translated_title": "基于大型语言模型与图结构理解的细粒度合成流数据用于数据稀疏性",
    "translated_abstract": "由于用户数据稀疏，电子商务平台上对用户评论进行情感分析通常性能不佳，特别是在面对极度稀疏的用户数据或长尾标签时。最近，LLMs的出现通过利用图结构生成辅助用户档案，为这些问题引入了新的解决方案。然而，先前的方法并未充分利用LLMs的图理解能力，并且难以适应复杂的流数据环境。在这项工作中，我们提出了一种细粒度的流数据合成框架，将稀疏用户分类为三类：中尾、长尾和极端。具体来说，我们设计了LLMs，全面理解流数据中的三个关键图元素，包括局部-全局图理解、二阶关系提取和产品属性理解，从而实现高质量数据的生成。",
    "tldr": "提出了一种细粒度合成流数据的框架，利用大型语言模型和图结构理解，将稀疏用户进行分类并生成高质量数据。"
}