{
    "title": "SFOD: Spiking Fusion Object Detector",
    "abstract": "arXiv:2403.15192v1 Announce Type: cross  Abstract: Event cameras, characterized by high temporal resolution, high dynamic range, low power consumption, and high pixel bandwidth, offer unique capabilities for object detection in specialized contexts. Despite these advantages, the inherent sparsity and asynchrony of event data pose challenges to existing object detection algorithms. Spiking Neural Networks (SNNs), inspired by the way the human brain codes and processes information, offer a potential solution to these difficulties. However, their performance in object detection using event cameras is limited in current implementations. In this paper, we propose the Spiking Fusion Object Detector (SFOD), a simple and efficient approach to SNN-based object detection. Specifically, we design a Spiking Fusion Module, achieving the first-time fusion of feature maps from different scales in SNNs applied to event cameras. Additionally, through integrating our analysis and experiments conducted d",
    "link": "https://arxiv.org/abs/2403.15192",
    "context": "Title: SFOD: Spiking Fusion Object Detector\nAbstract: arXiv:2403.15192v1 Announce Type: cross  Abstract: Event cameras, characterized by high temporal resolution, high dynamic range, low power consumption, and high pixel bandwidth, offer unique capabilities for object detection in specialized contexts. Despite these advantages, the inherent sparsity and asynchrony of event data pose challenges to existing object detection algorithms. Spiking Neural Networks (SNNs), inspired by the way the human brain codes and processes information, offer a potential solution to these difficulties. However, their performance in object detection using event cameras is limited in current implementations. In this paper, we propose the Spiking Fusion Object Detector (SFOD), a simple and efficient approach to SNN-based object detection. Specifically, we design a Spiking Fusion Module, achieving the first-time fusion of feature maps from different scales in SNNs applied to event cameras. Additionally, through integrating our analysis and experiments conducted d",
    "path": "papers/24/03/2403.15192.json",
    "total_tokens": 851,
    "translated_title": "SFOD：脉冲融合目标检测器",
    "translated_abstract": "事件相机以高时间分辨率、高动态范围、低功耗和高像素带宽为特征，为特定背景下的目标检测提供了独特的能力。然而，事件数据固有的稀疏性和异步性给现有的目标检测算法带来挑战。脉冲神经网络（SNNs）受人脑编码和处理信息的方式启发，为这些困难提供了潜在解决方案。然而，当前对事件相机使用SNN进行目标检测的性能受到限制。在本文中，我们提出了脉冲融合目标检测器（SFOD），这是一种简单高效的基于SNN的目标检测方法。具体来说，我们设计了一个脉冲融合模块，实现了首次在应用于事件相机的SNN中从不同尺度融合特征图。此外，通过整合我们的分析和实验进行。",
    "tldr": "SFOD是一种简单而高效的基于脉冲神经网络的目标检测方法，通过设计脉冲融合模块，实现了首次在事件相机中对不同尺度的特征图进行融合。",
    "en_tdlr": "SFOD is a simple and efficient spiking neural network-based object detection method that achieves the first-time fusion of feature maps from different scales in event cameras through the design of a Spiking Fusion Module."
}