{
    "title": "Your device may know you better than you know yourself -- continuous authentication on novel dataset using machine learning",
    "abstract": "arXiv:2403.03832v1 Announce Type: new  Abstract: This research aims to further understanding in the field of continuous authentication using behavioral biometrics. We are contributing a novel dataset that encompasses the gesture data of 15 users playing Minecraft with a Samsung Tablet, each for a duration of 15 minutes. Utilizing this dataset, we employed machine learning (ML) binary classifiers, being Random Forest (RF), K-Nearest Neighbors (KNN), and Support Vector Classifier (SVC), to determine the authenticity of specific user actions. Our most robust model was SVC, which achieved an average accuracy of approximately 90%, demonstrating that touch dynamics can effectively distinguish users. However, further studies are needed to make it viable option for authentication systems",
    "link": "https://arxiv.org/abs/2403.03832",
    "context": "Title: Your device may know you better than you know yourself -- continuous authentication on novel dataset using machine learning\nAbstract: arXiv:2403.03832v1 Announce Type: new  Abstract: This research aims to further understanding in the field of continuous authentication using behavioral biometrics. We are contributing a novel dataset that encompasses the gesture data of 15 users playing Minecraft with a Samsung Tablet, each for a duration of 15 minutes. Utilizing this dataset, we employed machine learning (ML) binary classifiers, being Random Forest (RF), K-Nearest Neighbors (KNN), and Support Vector Classifier (SVC), to determine the authenticity of specific user actions. Our most robust model was SVC, which achieved an average accuracy of approximately 90%, demonstrating that touch dynamics can effectively distinguish users. However, further studies are needed to make it viable option for authentication systems",
    "path": "papers/24/03/2403.03832.json",
    "total_tokens": 770,
    "translated_title": "您的设备可能比您更了解您自己——使用机器学习在新数据集上进行持续认证",
    "translated_abstract": "这项研究旨在通过行为生物特征进一步探讨持续认证领域。我们贡献了一个新数据集，包含了15位用户使用三星平板玩“Minecraft”时的手势数据，每位用户持续15分钟。利用这一数据集，我们使用了机器学习二元分类器，包括随机森林（RF）、K-最近邻算法（KNN）和支持向量分类器（SVC），以确定特定用户操作的真实性。我们最具鲁棒性的模型是SVC，其平均准确率约为90%，表明触摸动态能有效区分用户。然而，还需要进一步研究，以使其成为认证系统的可行选项。",
    "tldr": "通过新数据集和机器学习技术，研究展示了触摸动态可以有效地区分用户，最具鲁棒性的模型是支持向量分类器（SVC），其平均准确率约为90%",
    "en_tdlr": "The research demonstrates that touch dynamics can effectively distinguish users with an average accuracy of approximately 90% using the most robust model, Support Vector Classifier (SVC), based on a novel dataset and machine learning techniques."
}