{
    "title": "Partially Observable Task and Motion Planning with Uncertainty and Risk Awareness",
    "abstract": "arXiv:2403.10454v1 Announce Type: cross  Abstract: Integrated task and motion planning (TAMP) has proven to be a valuable approach to generalizable long-horizon robotic manipulation and navigation problems. However, the typical TAMP problem formulation assumes full observability and deterministic action effects. These assumptions limit the ability of the planner to gather information and make decisions that are risk-aware. We propose a strategy for TAMP with Uncertainty and Risk Awareness (TAMPURA) that is capable of efficiently solving long-horizon planning problems with initial-state and action outcome uncertainty, including problems that require information gathering and avoiding undesirable and irreversible outcomes. Our planner reasons under uncertainty at both the abstract task level and continuous controller level. Given a set of closed-loop goal-conditioned controllers operating in the primitive action space and a description of their preconditions and potential capabilities, w",
    "link": "https://arxiv.org/abs/2403.10454",
    "context": "Title: Partially Observable Task and Motion Planning with Uncertainty and Risk Awareness\nAbstract: arXiv:2403.10454v1 Announce Type: cross  Abstract: Integrated task and motion planning (TAMP) has proven to be a valuable approach to generalizable long-horizon robotic manipulation and navigation problems. However, the typical TAMP problem formulation assumes full observability and deterministic action effects. These assumptions limit the ability of the planner to gather information and make decisions that are risk-aware. We propose a strategy for TAMP with Uncertainty and Risk Awareness (TAMPURA) that is capable of efficiently solving long-horizon planning problems with initial-state and action outcome uncertainty, including problems that require information gathering and avoiding undesirable and irreversible outcomes. Our planner reasons under uncertainty at both the abstract task level and continuous controller level. Given a set of closed-loop goal-conditioned controllers operating in the primitive action space and a description of their preconditions and potential capabilities, w",
    "path": "papers/24/03/2403.10454.json",
    "total_tokens": 874,
    "translated_title": "具有不确定性和风险意识的部分可观测任务和运动规划",
    "translated_abstract": "集成任务和运动规划（TAMP）已被证明是一种有价值的方法，用于解决通用的长时程机器人操纵和导航问题。然而，典型的TAMP问题公式化假设完全可观测和确定性动作效果。这些假设限制了规划者获取信息和做出具有风险意识的决策的能力。我们提出了一种具有不确定性和风险意识的TAMP策略（TAMPURA），能够高效地解决具有初始状态和动作结果不确定性的长时程规划问题，包括需要信息收集和避免不良和不可逆结果的问题。我们的规划者在抽象任务级别和连续控制器级别均在存在不确定性条件下进行推理。鉴于一组在基本动作空间中运行的闭环目标驱动控制器，并描述了它们的前提条件和潜在能力，",
    "tldr": "提出了一种具有不确定性和风险意识的TAMP策略（TAMPURA），能够高效地解决具有初始状态和动作结果不确定性的长时程规划问题，包括需要信息收集和避免不良和不可逆结果的问题。",
    "en_tdlr": "Propose a TAMP strategy (TAMPURA) with uncertainty and risk awareness, capable of efficiently solving long-horizon planning problems with uncertainties in initial state and action outcomes, including scenarios requiring information gathering and avoidance of adverse and irreversible outcomes."
}