{
    "title": "BP4ER: Bootstrap Prompting for Explicit Reasoning in Medical Dialogue Generation",
    "abstract": "arXiv:2403.19414v1 Announce Type: new  Abstract: Medical dialogue generation (MDG) has gained increasing attention due to its substantial practical value. Previous works typically employ a sequence-to-sequence framework to generate medical responses by modeling dialogue context as sequential text with annotated medical entities. While these methods have been successful in generating fluent responses, they fail to provide process explanations of reasoning and require extensive entity annotation. To address these limitations, we propose the method Bootstrap Prompting for Explicit Reasoning in MDG (BP4ER), which explicitly model MDG's multi-step reasoning process and iteratively enhance this reasoning process. We employ a least-to-most prompting strategy to guide a large language model (LLM) in explicit reasoning, breaking down MDG into simpler sub-questions. These sub-questions build on answers from previous ones. Additionally, we also introduce two distinct bootstrapping techniques for ",
    "link": "https://arxiv.org/abs/2403.19414",
    "context": "Title: BP4ER: Bootstrap Prompting for Explicit Reasoning in Medical Dialogue Generation\nAbstract: arXiv:2403.19414v1 Announce Type: new  Abstract: Medical dialogue generation (MDG) has gained increasing attention due to its substantial practical value. Previous works typically employ a sequence-to-sequence framework to generate medical responses by modeling dialogue context as sequential text with annotated medical entities. While these methods have been successful in generating fluent responses, they fail to provide process explanations of reasoning and require extensive entity annotation. To address these limitations, we propose the method Bootstrap Prompting for Explicit Reasoning in MDG (BP4ER), which explicitly model MDG's multi-step reasoning process and iteratively enhance this reasoning process. We employ a least-to-most prompting strategy to guide a large language model (LLM) in explicit reasoning, breaking down MDG into simpler sub-questions. These sub-questions build on answers from previous ones. Additionally, we also introduce two distinct bootstrapping techniques for ",
    "path": "papers/24/03/2403.19414.json",
    "total_tokens": 836,
    "translated_title": "BP4ER: 医学对话生成中用于显式推理的引导式自举方法",
    "translated_abstract": "医学对话生成(MDG)因其实际价值日益受到关注。先前的研究通常采用序列到序列的框架，通过将对话上下文建模为带有标注医学实体的序列文本来生成医学回复。尽管这些方法在生成流畅回复方面取得了成功，但它们未能提供推理过程解释并且需要大量实体标注。为了解决这些限制，我们提出了Bootstrap Prompting for Explicit Reasoning in MDG (BP4ER)方法，该方法明确建模MDG的多步推理过程并迭代增强这一推理过程。我们采用由浅入深的提示策略，引导大型语言模型(LLM)进行显式推理，将MDG分解为更简单的子问题。这些子问题建立在先前问题的答案基础上。此外，我们还引入了两种不同的引导技术。",
    "tldr": "BP4ER提出了一种Bootstrap Prompting方法，通过引导大型语言模型在多步推理中进行显式推理，分解医学对话生成为简单子问题，并引入了两种引导技术。",
    "en_tdlr": "BP4ER proposes a Bootstrap Prompting method that guides a large language model in explicit reasoning for multi-step reasoning in medical dialogue generation, breaking down the process into simpler sub-questions, and introduces two prompting techniques."
}