{
    "title": "Speedrunning and path integrals",
    "abstract": "arXiv:2403.13008v1 Announce Type: cross  Abstract: In this article we will explore the concept of speedrunning as a representation of a simplified version of quantum mechanics within a classical simulation. This analogy can be seen as a simplified approach to understanding the broader idea that quantum mechanics may emerge from classical mechanics simulations due to the limitations of the simulation. The concept of speedrunning will be explored from the perspective inside the simulation, where the player is seen as a \"force of nature\" that can be interpreted through Newton's first law. Starting from this general assumption, the aim is to build a bridge between these two fields by using the mathematical representation of path integrals. The use of such an approach as an intermediate layer between machine learning techniques aimed at finding an optimal strategy and a game simulation is also analysed. This article will focus primarily on the relationship between classical and quantum phys",
    "link": "https://arxiv.org/abs/2403.13008",
    "context": "Title: Speedrunning and path integrals\nAbstract: arXiv:2403.13008v1 Announce Type: cross  Abstract: In this article we will explore the concept of speedrunning as a representation of a simplified version of quantum mechanics within a classical simulation. This analogy can be seen as a simplified approach to understanding the broader idea that quantum mechanics may emerge from classical mechanics simulations due to the limitations of the simulation. The concept of speedrunning will be explored from the perspective inside the simulation, where the player is seen as a \"force of nature\" that can be interpreted through Newton's first law. Starting from this general assumption, the aim is to build a bridge between these two fields by using the mathematical representation of path integrals. The use of such an approach as an intermediate layer between machine learning techniques aimed at finding an optimal strategy and a game simulation is also analysed. This article will focus primarily on the relationship between classical and quantum phys",
    "path": "papers/24/03/2403.13008.json",
    "total_tokens": 744,
    "translated_title": "Speedrunning和路径积分",
    "translated_abstract": "在本文中，我们将探讨速通作为经典模拟中量子力学简化版本的表征的概念。这种类比可以看作是理解量子力学可能由于模拟的局限性而从经典力学模拟中出现的一种简化方法。我们将从模拟内部的视角探讨速通的概念，其中玩家被视为可以通过牛顿第一定律解释的“自然力”。从这个一般假设出发，目标是通过使用路径积分的数学表示来建立这两个领域之间的桥梁。同时，本文还分析了将这种方法用作机器学习技术和游戏模拟之间的中间层以寻找最佳策略的可能性。",
    "tldr": "速通作为经典模拟中量子力学简化版本的表征，探讨经典力学模拟中可能出现的量子力学以及路径积分的数学表示。",
    "en_tdlr": "Speedrunning serves as a simplified representation of quantum mechanics within classical simulation, exploring the emergence of quantum mechanics from classical mechanics simulations and the mathematical representation of path integrals."
}