{
    "title": "A Quick Framework for Evaluating Worst Robustness of Complex Networks",
    "abstract": "arXiv:2403.00027v1 Announce Type: cross  Abstract: Robustness is pivotal for comprehending, designing, optimizing, and rehabilitating networks, with simulation attacks being the prevailing evaluation method. Simulation attacks are often time-consuming or even impractical, however, a more crucial yet persistently overlooked drawback is that any attack strategy merely provides a potential paradigm of disintegration. The key concern is: in the worst-case scenario or facing the most severe attacks, what is the limit of robustness, referred to as ``Worst Robustness'', for a given system? Understanding a system's worst robustness is imperative for grasping its reliability limits, accurately evaluating protective capabilities, and determining associated design and security maintenance costs. To address these challenges, we introduce the concept of Most Destruction Attack (MDA) based on the idea of knowledge stacking. MDA is employed to assess the worst robustness of networks, followed by the ",
    "link": "https://arxiv.org/abs/2403.00027",
    "context": "Title: A Quick Framework for Evaluating Worst Robustness of Complex Networks\nAbstract: arXiv:2403.00027v1 Announce Type: cross  Abstract: Robustness is pivotal for comprehending, designing, optimizing, and rehabilitating networks, with simulation attacks being the prevailing evaluation method. Simulation attacks are often time-consuming or even impractical, however, a more crucial yet persistently overlooked drawback is that any attack strategy merely provides a potential paradigm of disintegration. The key concern is: in the worst-case scenario or facing the most severe attacks, what is the limit of robustness, referred to as ``Worst Robustness'', for a given system? Understanding a system's worst robustness is imperative for grasping its reliability limits, accurately evaluating protective capabilities, and determining associated design and security maintenance costs. To address these challenges, we introduce the concept of Most Destruction Attack (MDA) based on the idea of knowledge stacking. MDA is employed to assess the worst robustness of networks, followed by the ",
    "path": "papers/24/03/2403.00027.json",
    "total_tokens": 863,
    "translated_title": "评估复杂网络最差稳健性的快速框架",
    "translated_abstract": "鲁棒性对于理解、设计、优化和修复网络至关重要，模拟攻击一直是主流的评估方法。然而，模拟攻击往往耗时甚至不切实际，更为关键且持续被忽视的缺点是任何攻击策略仅提供了一个潜在的瓦解范式。关键问题是：在最坏情况下或面临最严重的攻击时，对于给定系统，“最差稳健性”，即所谓的极限鲁棒性是多少？了解系统的最差稳健性对于把握其可靠性极限、准确评估保护能力以及确定相关设计和安全维护成本至关重要。为了解决这些挑战，我们引入了基于知识堆叠思想的“最大破坏攻击”（MDA）的概念。MDA用于评估网络的最差稳健性，随后进行",
    "tldr": "研究引入了Most Destruction Attack（MDA）概念，用于评估网络的最差稳健性，以确定在最坏情况下系统的极限鲁棒性。",
    "en_tdlr": "The study introduces the concept of Most Destruction Attack (MDA) to evaluate the worst robustness of networks and determine the limit of robustness in the worst-case scenario for a system."
}