{
    "title": "Aligning GPTRec with Beyond-Accuracy Goals with Reinforcement Learning",
    "abstract": "arXiv:2403.04875v1 Announce Type: cross  Abstract: Adaptations of Transformer models, such as BERT4Rec and SASRec, achieve state-of-the-art performance in the sequential recommendation task according to accuracy-based metrics, such as NDCG. These models treat items as tokens and then utilise a score-and-rank approach (Top-K strategy), where the model first computes item scores and then ranks them according to this score. While this approach works well for accuracy-based metrics, it is hard to use it for optimising more complex beyond-accuracy metrics such as diversity. Recently, the GPTRec model, which uses a different Next-K strategy, has been proposed as an alternative to the Top-K models. In contrast with traditional Top-K recommendations, Next-K generates recommendations item-by-item and, therefore, can account for complex item-to-item interdependencies important for the beyond-accuracy measures. However, the original GPTRec paper focused only on accuracy in experiments and needed ",
    "link": "https://arxiv.org/abs/2403.04875",
    "context": "Title: Aligning GPTRec with Beyond-Accuracy Goals with Reinforcement Learning\nAbstract: arXiv:2403.04875v1 Announce Type: cross  Abstract: Adaptations of Transformer models, such as BERT4Rec and SASRec, achieve state-of-the-art performance in the sequential recommendation task according to accuracy-based metrics, such as NDCG. These models treat items as tokens and then utilise a score-and-rank approach (Top-K strategy), where the model first computes item scores and then ranks them according to this score. While this approach works well for accuracy-based metrics, it is hard to use it for optimising more complex beyond-accuracy metrics such as diversity. Recently, the GPTRec model, which uses a different Next-K strategy, has been proposed as an alternative to the Top-K models. In contrast with traditional Top-K recommendations, Next-K generates recommendations item-by-item and, therefore, can account for complex item-to-item interdependencies important for the beyond-accuracy measures. However, the original GPTRec paper focused only on accuracy in experiments and needed ",
    "path": "papers/24/03/2403.04875.json",
    "total_tokens": 817,
    "translated_title": "用强化学习将GPTRec与超出准确性目标对齐",
    "translated_abstract": "Transformer模型的改编，如BERT4Rec和SASRec，在顺序推荐任务中取得了 accuracy-based 指标，如NDCG方面的最先进性能。这些模型将项目视为标记，然后利用评分-排名方法（Top-K策略），其中模型首先计算项目得分，然后根据此分数对其进行排名。虽然该方法对于准确性指标效果很好，但很难将其用于优化更复杂的超出准确性指标，如多样性。最近，提出了使用不同 Next-K 策略的GPTRec模型，作为Top-K模型的替代方案。与传统的Top-K推荐相比，Next-K会逐个项目生成推荐，因此，可以考虑超出准确性指标中重要的复杂项目间相互依赖性。",
    "tldr": "GPTRec模型使用Next-K策略来生成推荐，与传统的Top-K模型不同，可以更好地考虑超出准确性指标的复杂项目间相互依赖性。",
    "en_tdlr": "The GPTRec model uses the Next-K strategy to generate recommendations, which differs from traditional Top-K models and can better consider the complex item-to-item interdependencies for beyond-accuracy metrics."
}