{
    "title": "Sound Event Detection and Localization with Distance Estimation",
    "abstract": "arXiv:2403.11827v1 Announce Type: cross  Abstract: Sound Event Detection and Localization (SELD) is a combined task of identifying sound events and their corresponding direction-of-arrival (DOA). While this task has numerous applications and has been extensively researched in recent years, it fails to provide full information about the sound source position. In this paper, we overcome this problem by extending the task to Sound Event Detection, Localization with Distance Estimation (3D SELD). We study two ways of integrating distance estimation within the SELD core - a multi-task approach, in which the problem is tackled by a separate model output, and a single-task approach obtained by extending the multi-ACCDOA method to include distance information. We investigate both methods for the Ambisonic and binaural versions of STARSS23: Sony-TAU Realistic Spatial Soundscapes 2023. Moreover, our study involves experiments on the loss function related to the distance estimation part. Our resu",
    "link": "https://arxiv.org/abs/2403.11827",
    "context": "Title: Sound Event Detection and Localization with Distance Estimation\nAbstract: arXiv:2403.11827v1 Announce Type: cross  Abstract: Sound Event Detection and Localization (SELD) is a combined task of identifying sound events and their corresponding direction-of-arrival (DOA). While this task has numerous applications and has been extensively researched in recent years, it fails to provide full information about the sound source position. In this paper, we overcome this problem by extending the task to Sound Event Detection, Localization with Distance Estimation (3D SELD). We study two ways of integrating distance estimation within the SELD core - a multi-task approach, in which the problem is tackled by a separate model output, and a single-task approach obtained by extending the multi-ACCDOA method to include distance information. We investigate both methods for the Ambisonic and binaural versions of STARSS23: Sony-TAU Realistic Spatial Soundscapes 2023. Moreover, our study involves experiments on the loss function related to the distance estimation part. Our resu",
    "path": "papers/24/03/2403.11827.json",
    "total_tokens": 862,
    "translated_title": "具有距离估计的声音事件检测和定位",
    "translated_abstract": "声音事件检测和定位(SELD)是识别声音事件及其对应到达方向(DOA)的综合任务。尽管这一任务在近年来已得到广泛研究并具有许多应用，但它未能提供有关声源位置的完整信息。本文通过将任务扩展为具有距离估计的声音事件检测、定位(3D SELD)来克服这一问题。我们研究了两种集成距离估计在SELD核心中的方法 - 一种是多任务方法，通过单独模型输出来处理问题，另一种是通过将多ACCDOA方法扩展以包括距离信息而获得的单任务方法。我们对Ambisonic和双耳版本的STARSS23：Sony-TAU Realistic Spatial Soundscapes 2023开展了研究。此外，我们的研究涉及与距离估计部分相关的损失函数的实验。",
    "tldr": "本文将声音事件检测和定位任务扩展为具有距离估计的3D SELD，探讨了两种集成距离估计的方法，并在Ambisonic和双耳版本的声音场景下进行了实验。",
    "en_tdlr": "This paper extends the task of sound event detection and localization to 3D SELD with distance estimation, investigates two integration methods of distance estimation, and conducts experiments in Ambisonic and binaural soundscapes."
}