{
    "title": "Optimal Layout Synthesis for Deep Quantum Circuits on NISQ Processors with 100+ Qubits",
    "abstract": "arXiv:2403.11598v1 Announce Type: cross  Abstract: Layout synthesis is mapping a quantum circuit to a quantum processor. SWAP gate insertions are needed for scheduling 2-qubit gates only on connected physical qubits. With the ever-increasing number of qubits in NISQ processors, scalable layout synthesis is of utmost importance. With large optimality gaps observed in heuristic approaches, scalable exact methods are needed. While recent exact and near-optimal approaches scale to moderate circuits, large deep circuits are still out of scope.   In this work, we propose a SAT encoding based on parallel plans that apply 1 SWAP and a group of CNOTs at each time step. Using domain-specific information, we maintain optimality in parallel plans while scaling to large and deep circuits. From our results, we show the scalability of our approach which significantly outperforms leading exact and near-optimal approaches (up to 100x). For the first time, we can optimally map several 8, 14, and 16 qubi",
    "link": "https://arxiv.org/abs/2403.11598",
    "context": "Title: Optimal Layout Synthesis for Deep Quantum Circuits on NISQ Processors with 100+ Qubits\nAbstract: arXiv:2403.11598v1 Announce Type: cross  Abstract: Layout synthesis is mapping a quantum circuit to a quantum processor. SWAP gate insertions are needed for scheduling 2-qubit gates only on connected physical qubits. With the ever-increasing number of qubits in NISQ processors, scalable layout synthesis is of utmost importance. With large optimality gaps observed in heuristic approaches, scalable exact methods are needed. While recent exact and near-optimal approaches scale to moderate circuits, large deep circuits are still out of scope.   In this work, we propose a SAT encoding based on parallel plans that apply 1 SWAP and a group of CNOTs at each time step. Using domain-specific information, we maintain optimality in parallel plans while scaling to large and deep circuits. From our results, we show the scalability of our approach which significantly outperforms leading exact and near-optimal approaches (up to 100x). For the first time, we can optimally map several 8, 14, and 16 qubi",
    "path": "papers/24/03/2403.11598.json",
    "total_tokens": 879,
    "translated_title": "面向具有100多个量子比特的NISQ处理器的深度量子电路最佳布局综合",
    "translated_abstract": "布局综合是将量子电路映射到量子处理器。需要为仅在连接的物理量子比特上安排2比特门的调度进行SWAP门插入。随着NISQ处理器中量子比特数量的不断增加，可扩展的布局综合至关重要。在启发式方法中观察到的优化间隙较大，需要可扩展的精确方法。尽管最近的精确和接近最优方法适用于中等规模电路，但大型深度电路仍超出范围。",
    "tldr": "本研究提出了一种基于并行计划的SAT编码，每个时间步骤应用1个SWAP和一组CNOT。利用特定领域信息，在并行计划中保持优化性能的同时，扩展到大型深度电路。我们展示了我们方法的可扩展性，在多项比领先的精确和接近最优方法表现出色（高达100倍）。我们首次能够最优地映射多个8、14和16量子比特",
    "en_tdlr": "This work proposes a SAT encoding based on parallel plans for layout synthesis of deep quantum circuits, achieving optimality while scaling to large and deep circuits, outperforming leading approaches by up to 100x, enabling optimal mapping of several 8, 14, and 16 qubit circuits for the first time."
}