{
    "title": "On the Role of Information Structure in Reinforcement Learning for Partially-Observable Sequential Teams and Games",
    "abstract": "arXiv:2403.00993v1 Announce Type: cross  Abstract: In a sequential decision-making problem, the information structure is the description of how events in the system occurring at different points in time affect each other. Classical models of reinforcement learning (e.g., MDPs, POMDPs, Dec-POMDPs, and POMGs) assume a very simple and highly regular information structure, while more general models like predictive state representations do not explicitly model the information structure. By contrast, real-world sequential decision-making problems typically involve a complex and time-varying interdependence of system variables, requiring a rich and flexible representation of information structure.   In this paper, we argue for the perspective that explicit representation of information structures is an important component of analyzing and solving reinforcement learning problems. We propose novel reinforcement learning models with an explicit representation of information structure, capturing ",
    "link": "https://arxiv.org/abs/2403.00993",
    "context": "Title: On the Role of Information Structure in Reinforcement Learning for Partially-Observable Sequential Teams and Games\nAbstract: arXiv:2403.00993v1 Announce Type: cross  Abstract: In a sequential decision-making problem, the information structure is the description of how events in the system occurring at different points in time affect each other. Classical models of reinforcement learning (e.g., MDPs, POMDPs, Dec-POMDPs, and POMGs) assume a very simple and highly regular information structure, while more general models like predictive state representations do not explicitly model the information structure. By contrast, real-world sequential decision-making problems typically involve a complex and time-varying interdependence of system variables, requiring a rich and flexible representation of information structure.   In this paper, we argue for the perspective that explicit representation of information structures is an important component of analyzing and solving reinforcement learning problems. We propose novel reinforcement learning models with an explicit representation of information structure, capturing ",
    "path": "papers/24/03/2403.00993.json",
    "total_tokens": 598,
    "translated_title": "论部分可观察序列团队和游戏中信息结构在强化学习中的作用",
    "translated_abstract": "在顺序决策问题中，信息结构描述了系统中不同时刻事件如何相互影响。本文主张明确表示信息结构是分析和解决强化学习问题的重要组成部分，并提出具有明确信息结构表示的新型强化学习模型。",
    "tldr": "明确表示信息结构是分析和解决强化学习问题的重要组成部分。",
    "en_tdlr": "Explicit representation of information structure is an important component in analyzing and solving reinforcement learning problems."
}