{
    "title": "Couler: Unified Machine Learning Workflow Optimization in Cloud",
    "abstract": "arXiv:2403.07608v1 Announce Type: cross  Abstract: Machine Learning (ML) has become ubiquitous, fueling data-driven applications across various organizations. Contrary to the traditional perception of ML in research, ML workflows can be complex, resource-intensive, and time-consuming. Expanding an ML workflow to encompass a wider range of data infrastructure and data types may lead to larger workloads and increased deployment costs. Currently, numerous workflow engines are available (with over ten being widely recognized). This variety poses a challenge for end-users in terms of mastering different engine APIs. While efforts have primarily focused on optimizing ML Operations (MLOps) for a specific workflow engine, current methods largely overlook workflow optimization across different engines.   In this work, we design and implement Couler, a system designed for unified ML workflow optimization in the cloud. Our main insight lies in the ability to generate an ML workflow using natural ",
    "link": "https://arxiv.org/abs/2403.07608",
    "context": "Title: Couler: Unified Machine Learning Workflow Optimization in Cloud\nAbstract: arXiv:2403.07608v1 Announce Type: cross  Abstract: Machine Learning (ML) has become ubiquitous, fueling data-driven applications across various organizations. Contrary to the traditional perception of ML in research, ML workflows can be complex, resource-intensive, and time-consuming. Expanding an ML workflow to encompass a wider range of data infrastructure and data types may lead to larger workloads and increased deployment costs. Currently, numerous workflow engines are available (with over ten being widely recognized). This variety poses a challenge for end-users in terms of mastering different engine APIs. While efforts have primarily focused on optimizing ML Operations (MLOps) for a specific workflow engine, current methods largely overlook workflow optimization across different engines.   In this work, we design and implement Couler, a system designed for unified ML workflow optimization in the cloud. Our main insight lies in the ability to generate an ML workflow using natural ",
    "path": "papers/24/03/2403.07608.json",
    "total_tokens": 782,
    "translated_title": "Couler: 云中统一机器学习工作流优化",
    "translated_abstract": "机器学习（ML）已经变得无处不在，推动着各种组织中的数据驱动应用。与传统观念中研究中的ML相反，ML工作流可能是复杂的，资源密集的，并且耗时的。扩展ML工作流以包含更广泛的数据基础设施和数据类型可能导致更大的工作量和增加的部署成本。目前，有许多工作流引擎可用（其中超过十个得到广泛认可）。这种多样性对于最终用户来说构成了掌握不同引擎API的挑战。虽然目前的努力主要集中在针对特定工作流引擎优化ML操作（MLOps），但当前方法在跨不同引擎进行工作流优化方面很大程度上被忽视。",
    "tldr": "设计并实现了Couler系统，用于云中统一机器学习工作流优化，主要见解在于能够使用自然生成ML工作流"
}