{
    "title": "Quantifying and Predicting Residential Building Flexibility Using Machine Learning Methods",
    "abstract": "arXiv:2403.01669v1 Announce Type: new  Abstract: Residential buildings account for a significant portion (35\\%) of the total electricity consumption in the U.S. as of 2022. As more distributed energy resources are installed in buildings, their potential to provide flexibility to the grid increases. To tap into that flexibility provided by buildings, aggregators or system operators need to quantify and forecast flexibility. Previous works in this area primarily focused on commercial buildings, with little work on residential buildings. To address the gap, this paper first proposes two complementary flexibility metrics (i.e., power and energy flexibility) and then investigates several mainstream machine learning-based models for predicting the time-variant and sporadic flexibility of residential buildings at four-hour and 24-hour forecast horizons. The long-short-term-memory (LSTM) model achieves the best performance and can predict power flexibility for up to 24 hours ahead with the ave",
    "link": "https://arxiv.org/abs/2403.01669",
    "context": "Title: Quantifying and Predicting Residential Building Flexibility Using Machine Learning Methods\nAbstract: arXiv:2403.01669v1 Announce Type: new  Abstract: Residential buildings account for a significant portion (35\\%) of the total electricity consumption in the U.S. as of 2022. As more distributed energy resources are installed in buildings, their potential to provide flexibility to the grid increases. To tap into that flexibility provided by buildings, aggregators or system operators need to quantify and forecast flexibility. Previous works in this area primarily focused on commercial buildings, with little work on residential buildings. To address the gap, this paper first proposes two complementary flexibility metrics (i.e., power and energy flexibility) and then investigates several mainstream machine learning-based models for predicting the time-variant and sporadic flexibility of residential buildings at four-hour and 24-hour forecast horizons. The long-short-term-memory (LSTM) model achieves the best performance and can predict power flexibility for up to 24 hours ahead with the ave",
    "path": "papers/24/03/2403.01669.json",
    "total_tokens": 803,
    "translated_title": "使用机器学习方法量化和预测住宅建筑的灵活性",
    "translated_abstract": "住宅建筑占到2022年美国总用电量的35\\%，随着建筑中分布式能源资源的增加，它们提供灵活性给电网的潜力也在增加。为了利用建筑所提供的灵活性，聚合商或系统操作者需要量化和预测灵活性。本文提出了两种互补的灵活性指标（即功率和能量灵活性），并探讨了几种主流的基于机器学习的模型，用于预测四小时和24小时预测时段下住宅建筑的时间变化和零星灵活性。长短期记忆（LSTM）模型表现最佳，可预测24小时内的功率灵活性，最多可提前24小时进行预测。",
    "tldr": "本研究提出了两种灵活性指标，并利用机器学习模型来预测住宅建筑在不同时间范围内的灵活性，其中长短期记忆（LSTM）模型表现最佳。"
}