{
    "title": "Fundus: A Simple-to-Use News Scraper Optimized for High Quality Extractions",
    "abstract": "arXiv:2403.15279v1 Announce Type: new  Abstract: This paper introduces Fundus, a user-friendly news scraper that enables users to obtain millions of high-quality news articles with just a few lines of code. Unlike existing news scrapers, we use manually crafted, bespoke content extractors that are specifically tailored to the formatting guidelines of each supported online newspaper. This allows us to optimize our scraping for quality such that retrieved news articles are textually complete and without HTML artifacts. Further, our framework combines both crawling (retrieving HTML from the web or large web archives) and content extraction into a single pipeline. By providing a unified interface for a predefined collection of newspapers, we aim to make Fundus broadly usable even for non-technical users. This paper gives an overview of the framework, discusses our design choices, and presents a comparative evaluation against other popular news scrapers. Our evaluation shows that Fundus yie",
    "link": "https://arxiv.org/abs/2403.15279",
    "context": "Title: Fundus: A Simple-to-Use News Scraper Optimized for High Quality Extractions\nAbstract: arXiv:2403.15279v1 Announce Type: new  Abstract: This paper introduces Fundus, a user-friendly news scraper that enables users to obtain millions of high-quality news articles with just a few lines of code. Unlike existing news scrapers, we use manually crafted, bespoke content extractors that are specifically tailored to the formatting guidelines of each supported online newspaper. This allows us to optimize our scraping for quality such that retrieved news articles are textually complete and without HTML artifacts. Further, our framework combines both crawling (retrieving HTML from the web or large web archives) and content extraction into a single pipeline. By providing a unified interface for a predefined collection of newspapers, we aim to make Fundus broadly usable even for non-technical users. This paper gives an overview of the framework, discusses our design choices, and presents a comparative evaluation against other popular news scrapers. Our evaluation shows that Fundus yie",
    "path": "papers/24/03/2403.15279.json",
    "total_tokens": 887,
    "translated_title": "Fundus：一个简单易用的新闻爬虫，优化高质量提取",
    "translated_abstract": "本文介绍了Fundus，一个用户友好的新闻爬虫，使用户可以仅凭几行代码获得数百万高质量的新闻文章。与现有的新闻爬虫不同，我们使用手工定制的、专门针对每个支持的在线报纸的格式指南的内容提取器。这样我们可以优化我们的爬取质量，以确保检索到的新闻文章完整且没有HTML痕迹。此外，我们的框架将爬取（从网络或大型网络归档中检索HTML）和内容提取结合到一个单一的流水线中。通过为预定义的一组报纸提供统一的界面，我们的目标是使Fundus即使对非技术用户也易于使用。本文概述了框架，讨论了我们的设计选择，并针对其他流行的新闻爬虫进行了比较评估。我们的评估表明，Fundus取得了...",
    "tldr": "Fundus是一个简单易用的新闻爬虫工具，通过手工定制的内容提取器，针对每个支持的在线报纸格式指南进行优化，实现高质量的新闻文章提取，同时结合爬取和内容提取于一体，为非技术用户提供统一使用界面。",
    "en_tdlr": "Fundus is a simple-to-use news scraper that optimizes high-quality news extraction by utilizing manually crafted content extractors tailored to the formatting guidelines of supported online newspapers, combining crawling and content extraction into a single pipeline, and providing a unified interface for non-technical users."
}