{
    "title": "Semantic Is Enough: Only Semantic Information For NeRF Reconstruction",
    "abstract": "arXiv:2403.16043v1 Announce Type: cross  Abstract: Recent research that combines implicit 3D representation with semantic information, like Semantic-NeRF, has proven that NeRF model could perform excellently in rendering 3D structures with semantic labels. This research aims to extend the Semantic Neural Radiance Fields (Semantic-NeRF) model by focusing solely on semantic output and removing the RGB output component. We reformulate the model and its training procedure to leverage only the cross-entropy loss between the model semantic output and the ground truth semantic images, removing the colour data traditionally used in the original Semantic-NeRF approach. We then conduct a series of identical experiments using the original and the modified Semantic-NeRF model. Our primary objective is to obverse the impact of this modification on the model performance by Semantic-NeRF, focusing on tasks such as scene understanding, object detection, and segmentation. The results offer valuable ins",
    "link": "https://arxiv.org/abs/2403.16043",
    "context": "Title: Semantic Is Enough: Only Semantic Information For NeRF Reconstruction\nAbstract: arXiv:2403.16043v1 Announce Type: cross  Abstract: Recent research that combines implicit 3D representation with semantic information, like Semantic-NeRF, has proven that NeRF model could perform excellently in rendering 3D structures with semantic labels. This research aims to extend the Semantic Neural Radiance Fields (Semantic-NeRF) model by focusing solely on semantic output and removing the RGB output component. We reformulate the model and its training procedure to leverage only the cross-entropy loss between the model semantic output and the ground truth semantic images, removing the colour data traditionally used in the original Semantic-NeRF approach. We then conduct a series of identical experiments using the original and the modified Semantic-NeRF model. Our primary objective is to obverse the impact of this modification on the model performance by Semantic-NeRF, focusing on tasks such as scene understanding, object detection, and segmentation. The results offer valuable ins",
    "path": "papers/24/03/2403.16043.json",
    "total_tokens": 847,
    "translated_title": "只需语义信息：NeRF重建中的语义信息足够",
    "translated_abstract": "最近的研究结合隐式3D表示和语义信息，如Semantic-NeRF，证明NeRF模型在呈现具有语义标签的3D结构方面表现出色。本研究旨在通过仅关注语义输出并移除RGB输出组件来扩展Semantic Neural Radiance Fields（Semantic-NeRF）模型。我们重新构建模型及其训练过程，仅利用模型语义输出与地面真实语义图像之间的交叉熵损失，移除了原始Semantic-NeRF方法中传统使用的颜色数据。然后，我们使用原始和修改后的Semantic-NeRF模型进行了一系列相同的实验。我们的主要目标是观察这种修改对Semantic-NeRF模型性能的影响，重点关注场景理解、物体检测和分割等任务。结果为场景理解、物体检测和分割等任务提供了有价值的见解。",
    "tldr": "该研究展示了NeRF模型在重建3D结构中仅利用语义信息的优秀表现，通过去除RGB输出组件，模型训练过程重点关注语义输出与地面真实图像之间的交叉熵损失。",
    "en_tdlr": "This study demonstrates the excellent performance of the NeRF model in reconstructing 3D structures using only semantic information, focusing on the cross-entropy loss between semantic output and ground truth images by removing the RGB output component."
}