{
    "title": "(Un)making AI Magic: a Design Taxonomy",
    "abstract": "arXiv:2403.15216v1 Announce Type: cross  Abstract: This paper examines the role that enchantment plays in the design of AI things by constructing a taxonomy of design approaches that increase or decrease the perception of magic and enchantment. We start from the design discourse surrounding recent developments in AI technologies, highlighting specific interaction qualities such as algorithmic uncertainties and errors and articulating relations to the rhetoric of magic and supernatural thinking. Through analyzing and reflecting upon 52 students' design projects from two editions of a Master course in design and AI, we identify seven design principles and unpack the effects of each in terms of enchantment and disenchantment. We conclude by articulating ways in which this taxonomy can be approached and appropriated by design/HCI practitioners, especially to support exploration and reflexivity.",
    "link": "https://arxiv.org/abs/2403.15216",
    "context": "Title: (Un)making AI Magic: a Design Taxonomy\nAbstract: arXiv:2403.15216v1 Announce Type: cross  Abstract: This paper examines the role that enchantment plays in the design of AI things by constructing a taxonomy of design approaches that increase or decrease the perception of magic and enchantment. We start from the design discourse surrounding recent developments in AI technologies, highlighting specific interaction qualities such as algorithmic uncertainties and errors and articulating relations to the rhetoric of magic and supernatural thinking. Through analyzing and reflecting upon 52 students' design projects from two editions of a Master course in design and AI, we identify seven design principles and unpack the effects of each in terms of enchantment and disenchantment. We conclude by articulating ways in which this taxonomy can be approached and appropriated by design/HCI practitioners, especially to support exploration and reflexivity.",
    "path": "papers/24/03/2403.15216.json",
    "total_tokens": 750,
    "translated_title": "AI魔术的制造与解构：一个设计分类学",
    "translated_abstract": "本文通过构建一个设计方法的分类学，研究了魔术在AI事物设计中所起的作用，这些设计方法可以增加或减少魔法和魅力的感知。我们从围绕AI技术近期发展的设计话语开始，强调特定的交互特性，比如算法不确定性和错误，并阐明与魔法和超自然思维的关系。通过分析和反思来自两届设计与AI硕士课程中52名学生的设计项目，我们确定了七大设计原则，并解开了每个原则在魅力和喜忧无常方面的影响。最后，我们阐述了设计/人机交互从业者可以如何接纳和利用这种分类学，特别是以支持探索与反思。",
    "tldr": "通过构建设计方法的分类学，研究了AI事物设计中魔法的影响，提出了七大设计原则，并探讨了这些原则对魅力和喜忧无常的影响。",
    "en_tdlr": "This paper explores the impact of magic in the design of AI artifacts, presents seven design principles, and discusses their effects on enchantment and disenchantment."
}