{
    "title": "MCD: Diverse Large-Scale Multi-Campus Dataset for Robot Perception",
    "abstract": "arXiv:2403.11496v1 Announce Type: cross  Abstract: Perception plays a crucial role in various robot applications. However, existing well-annotated datasets are biased towards autonomous driving scenarios, while unlabelled SLAM datasets are quickly over-fitted, and often lack environment and domain variations. To expand the frontier of these fields, we introduce a comprehensive dataset named MCD (Multi-Campus Dataset), featuring a wide range of sensing modalities, high-accuracy ground truth, and diverse challenging environments across three Eurasian university campuses. MCD comprises both CCS (Classical Cylindrical Spinning) and NRE (Non-Repetitive Epicyclic) lidars, high-quality IMUs (Inertial Measurement Units), cameras, and UWB (Ultra-WideBand) sensors. Furthermore, in a pioneering effort, we introduce semantic annotations of 29 classes over 59k sparse NRE lidar scans across three domains, thus providing a novel challenge to existing semantic segmentation research upon this largely u",
    "link": "https://arxiv.org/abs/2403.11496",
    "context": "Title: MCD: Diverse Large-Scale Multi-Campus Dataset for Robot Perception\nAbstract: arXiv:2403.11496v1 Announce Type: cross  Abstract: Perception plays a crucial role in various robot applications. However, existing well-annotated datasets are biased towards autonomous driving scenarios, while unlabelled SLAM datasets are quickly over-fitted, and often lack environment and domain variations. To expand the frontier of these fields, we introduce a comprehensive dataset named MCD (Multi-Campus Dataset), featuring a wide range of sensing modalities, high-accuracy ground truth, and diverse challenging environments across three Eurasian university campuses. MCD comprises both CCS (Classical Cylindrical Spinning) and NRE (Non-Repetitive Epicyclic) lidars, high-quality IMUs (Inertial Measurement Units), cameras, and UWB (Ultra-WideBand) sensors. Furthermore, in a pioneering effort, we introduce semantic annotations of 29 classes over 59k sparse NRE lidar scans across three domains, thus providing a novel challenge to existing semantic segmentation research upon this largely u",
    "path": "papers/24/03/2403.11496.json",
    "total_tokens": 942,
    "translated_title": "MCD: 用于机器人感知的多样性大规模多校区数据集",
    "translated_abstract": "感知在各种机器人应用中起着至关重要的作用。然而，现有的标注数据集对自动驾驶场景存在偏见，而未标记的SLAM数据集很快被过度拟合，通常缺乏环境和领域变化。为了拓展这些领域的边界，我们引入了一个全面的名为MCD（多校区数据集）的数据集，涵盖了多种传感模式、高精度地面真值以及跨越三个欧亚大学校园的多样化挑战环境。MCD包括经典圆柱旋转（CCS）和非重复回环（NRE）激光雷达、高质量IMU（惯性测量单元）、摄像头和UWB（超宽带）传感器。此外，在开创性的努力下，我们针对三个领域的59k个稀疏NRE激光雷达扫描引入了29类的语义注释，从而为现有的语义分割研究提供了一个全新挑战。",
    "tldr": "MCD数据集为机器人感知领域带来了全新挑战，包含多种传感模式、高精度地面真值和跨校园的多样化挑战环境，同时还引入了对大规模NRE激光扫描进行的语义注释。",
    "en_tdlr": "The MCD dataset introduces new challenges to robot perception field with various sensing modalities, high-accuracy ground truth, diverse challenging environments across campuses, and semantic annotations for large-scale NRE lidar scans."
}