{
    "title": "In-Memory Learning: A Declarative Learning Framework for Large Language Models",
    "abstract": "arXiv:2403.02757v1 Announce Type: new  Abstract: The exploration of whether agents can align with their environment without relying on human-labeled data presents an intriguing research topic. Drawing inspiration from the alignment process observed in intelligent organisms, where declarative memory plays a pivotal role in summarizing past experiences, we propose a novel learning framework. The agents adeptly distill insights from past experiences, refining and updating existing notes to enhance their performance in the environment. This entire process transpires within the memory components and is implemented through natural language, so we character this framework as In-memory Learning. We also delve into the key features of benchmarks designed to evaluate the self-improvement process. Through systematic experiments, we demonstrate the effectiveness of our framework and provide insights into this problem.",
    "link": "https://arxiv.org/abs/2403.02757",
    "context": "Title: In-Memory Learning: A Declarative Learning Framework for Large Language Models\nAbstract: arXiv:2403.02757v1 Announce Type: new  Abstract: The exploration of whether agents can align with their environment without relying on human-labeled data presents an intriguing research topic. Drawing inspiration from the alignment process observed in intelligent organisms, where declarative memory plays a pivotal role in summarizing past experiences, we propose a novel learning framework. The agents adeptly distill insights from past experiences, refining and updating existing notes to enhance their performance in the environment. This entire process transpires within the memory components and is implemented through natural language, so we character this framework as In-memory Learning. We also delve into the key features of benchmarks designed to evaluate the self-improvement process. Through systematic experiments, we demonstrate the effectiveness of our framework and provide insights into this problem.",
    "path": "papers/24/03/2403.02757.json",
    "total_tokens": 788,
    "translated_title": "基于内存的学习：大型语言模型的声明式学习框架",
    "translated_abstract": "调查代理是否能够与环境对齐而不依赖人工标记数据，提出了一个有趣的研究主题。受智能生物对齐过程的启发，我们提出了一个新颖的学习框架，其中声明式内存在总结过去经验中起着重要作用。代理能够从过去经验中提炼见解，改进和更新现有笔记以提高在环境中的表现。整个过程发生在内存组件中，并通过自然语言实现，因此我们将此框架描述为基于内存的学习。我们还深入探讨了设计用于评估自我改进过程的基准测试的关键特性。通过系统实验，我们展示了我们框架的有效性并提供了对这个问题的见解。",
    "tldr": "提出了一个基于内存的声明式学习框架，通过总结过去经验，帮助代理从中提取见解并改进性能，实现自我改进。进行了系统实验证明了该框架的有效性。",
    "en_tdlr": "Introduced an in-memory declarative learning framework that helps agents distill insights from past experiences, improve performance, and achieve self-improvement. Conducted systematic experiments to demonstrate the effectiveness of the framework."
}