{
    "title": "LAFS: Landmark-based Facial Self-supervised Learning for Face Recognition",
    "abstract": "arXiv:2403.08161v1 Announce Type: cross  Abstract: In this work we focus on learning facial representations that can be adapted to train effective face recognition models, particularly in the absence of labels. Firstly, compared with existing labelled face datasets, a vastly larger magnitude of unlabeled faces exists in the real world. We explore the learning strategy of these unlabeled facial images through self-supervised pretraining to transfer generalized face recognition performance. Moreover, motivated by one recent finding, that is, the face saliency area is critical for face recognition, in contrast to utilizing random cropped blocks of images for constructing augmentations in pretraining, we utilize patches localized by extracted facial landmarks. This enables our method - namely LAndmark-based Facial Self-supervised learning LAFS), to learn key representation that is more critical for face recognition. We also incorporate two landmark-specific augmentations which introduce mo",
    "link": "https://arxiv.org/abs/2403.08161",
    "context": "Title: LAFS: Landmark-based Facial Self-supervised Learning for Face Recognition\nAbstract: arXiv:2403.08161v1 Announce Type: cross  Abstract: In this work we focus on learning facial representations that can be adapted to train effective face recognition models, particularly in the absence of labels. Firstly, compared with existing labelled face datasets, a vastly larger magnitude of unlabeled faces exists in the real world. We explore the learning strategy of these unlabeled facial images through self-supervised pretraining to transfer generalized face recognition performance. Moreover, motivated by one recent finding, that is, the face saliency area is critical for face recognition, in contrast to utilizing random cropped blocks of images for constructing augmentations in pretraining, we utilize patches localized by extracted facial landmarks. This enables our method - namely LAndmark-based Facial Self-supervised learning LAFS), to learn key representation that is more critical for face recognition. We also incorporate two landmark-specific augmentations which introduce mo",
    "path": "papers/24/03/2403.08161.json",
    "total_tokens": 866,
    "translated_title": "基于地标的人脸自监督学习用于人脸识别",
    "translated_abstract": "在这项工作中，我们专注于学习可以适应训练有效人脸识别模型的人脸表示，特别是在缺乏标签的情况下。与现有的带标签人脸数据集相比，现实世界中存在着一个数量上大得多的未标记人脸。我们通过自监督预训练探索这些未标记面部图像的学习策略，以转移广义人脸识别性能。此外，受到最近的一个发现的启发，即面部显著区域对于人脸识别至关重要，与利用随机裁剪的图像块进行预训练增广相反，我们利用通过提取的面部地标定位的补丁。这使得我们的方法 - 即基于地标的人脸自监督学习(LAndmark-based Facial Self-supervised learning LAFS)能够学习更适合人脸识别的关键表示。我们还融入了两种特定于地标的增广，引入了更多",
    "tldr": "本研究提出了一种基于地标的人脸自监督学习方法，通过利用面部地标定位的补丁来学习更适合于人脸识别的关键表示。",
    "en_tdlr": "This study presents a landmark-based facial self-supervised learning approach that learns key representations critical for face recognition by utilizing patches localized by extracted facial landmarks."
}