{
    "title": "On the potential of quantum walks for modeling financial return distributions",
    "abstract": "arXiv:2403.19502v1 Announce Type: new  Abstract: Accurate modeling of the temporal evolution of asset prices is crucial for understanding financial markets. We explore the potential of discrete-time quantum walks to model the evolution of asset prices. Return distributions obtained from a model based on the quantum walk algorithm are compared with those obtained from classical methodologies. We focus on specific limitations of the classical models, and illustrate that the quantum walk model possesses great flexibility in overcoming these. This includes the potential to generate asymmetric return distributions with complex market tendencies and higher probabilities for extreme events than in some of the classical models. Furthermore, the temporal evolution in the quantum walk possesses the potential to provide asset price dynamics.",
    "link": "https://arxiv.org/abs/2403.19502",
    "context": "Title: On the potential of quantum walks for modeling financial return distributions\nAbstract: arXiv:2403.19502v1 Announce Type: new  Abstract: Accurate modeling of the temporal evolution of asset prices is crucial for understanding financial markets. We explore the potential of discrete-time quantum walks to model the evolution of asset prices. Return distributions obtained from a model based on the quantum walk algorithm are compared with those obtained from classical methodologies. We focus on specific limitations of the classical models, and illustrate that the quantum walk model possesses great flexibility in overcoming these. This includes the potential to generate asymmetric return distributions with complex market tendencies and higher probabilities for extreme events than in some of the classical models. Furthermore, the temporal evolution in the quantum walk possesses the potential to provide asset price dynamics.",
    "path": "papers/24/03/2403.19502.json",
    "total_tokens": 751,
    "translated_title": "关于量子漫步用于建模金融回报分布的潜力",
    "translated_abstract": "准确建模资产价格的时间演变对于理解金融市场至关重要。我们探讨了离散时间量子漫步在建模资产价格演变方面的潜力。从基于量子漫步算法的模型获得的回报分布与从经典方法获得的分布进行了比较。我们关注经典模型的特定局限性，并且阐明量子漫步模型具有克服这些局限性的极大灵活性。其中包括产生具有复杂市场倾向的不对称回报分布以及在某些经典模型中比极端事件具有更高概率。此外，量子漫步中的时间演变具有提供资产价格动态的潜力。",
    "tldr": "量子漫步算法在模拟金融市场中的资产价格演变方面展现出了巨大的灵活性，能够克服经典模型的局限性，产生复杂的市场倾向，以及更高概率的极端事件。",
    "en_tdlr": "Quantum walk algorithm shows great flexibility in modeling the evolution of asset prices in financial markets, overcoming limitations of classical models by generating complex market tendencies and higher probabilities of extreme events."
}