{
    "title": "Isometric Neural Machine Translation using Phoneme Count Ratio Reward-based Reinforcement Learning",
    "abstract": "arXiv:2403.15469v1 Announce Type: new  Abstract: Traditional Automatic Video Dubbing (AVD) pipeline consists of three key modules, namely, Automatic Speech Recognition (ASR), Neural Machine Translation (NMT), and Text-to-Speech (TTS). Within AVD pipelines, isometric-NMT algorithms are employed to regulate the length of the synthesized output text. This is done to guarantee synchronization with respect to the alignment of video and audio subsequent to the dubbing process. Previous approaches have focused on aligning the number of characters and words in the source and target language texts of Machine Translation models. However, our approach aims to align the number of phonemes instead, as they are closely associated with speech duration. In this paper, we present the development of an isometric NMT system using Reinforcement Learning (RL), with a focus on optimizing the alignment of phoneme counts in the source and target language sentence pairs. To evaluate our models, we propose the ",
    "link": "https://arxiv.org/abs/2403.15469",
    "context": "Title: Isometric Neural Machine Translation using Phoneme Count Ratio Reward-based Reinforcement Learning\nAbstract: arXiv:2403.15469v1 Announce Type: new  Abstract: Traditional Automatic Video Dubbing (AVD) pipeline consists of three key modules, namely, Automatic Speech Recognition (ASR), Neural Machine Translation (NMT), and Text-to-Speech (TTS). Within AVD pipelines, isometric-NMT algorithms are employed to regulate the length of the synthesized output text. This is done to guarantee synchronization with respect to the alignment of video and audio subsequent to the dubbing process. Previous approaches have focused on aligning the number of characters and words in the source and target language texts of Machine Translation models. However, our approach aims to align the number of phonemes instead, as they are closely associated with speech duration. In this paper, we present the development of an isometric NMT system using Reinforcement Learning (RL), with a focus on optimizing the alignment of phoneme counts in the source and target language sentence pairs. To evaluate our models, we propose the ",
    "path": "papers/24/03/2403.15469.json",
    "total_tokens": 823,
    "translated_title": "使用音素计数比奖励驱动的强化学习实现等距神经机器翻译",
    "translated_abstract": "传统的自动视频配音（AVD）流水线由三个关键模块组成，即自动语音识别（ASR）、神经机器翻译（NMT）和文本到语音（TTS）。AVD管道中使用等距-NMT算法来调节合成输出文本的长度，以确保在配音过程之后，视频和音频的对齐同步。先前的方法集中于调整机器翻译模型源语言和目标语言文本中字符和单词的数量。然而，我们的方法旨在调整音素的数量，因为它们与语音持续时间密切相关。本文提出使用强化学习（RL）开发等距NMT系统，重点优化源语言和目标语言句对中音素计数的对齐。为了评估我们的模型，我们提出了",
    "tldr": "本论文提出了使用强化学习（RL）开发的等距NMT系统，重点在于优化源语言和目标语言句对中音素计数的对齐。"
}