{
    "title": "Understanding the Progression of Educational Topics via Semantic Matching",
    "abstract": "arXiv:2403.05553v1 Announce Type: cross  Abstract: Education systems are dynamically changing to accommodate technological advances, industrial and societal needs, and to enhance students' learning journeys. Curriculum specialists and educators constantly revise taught subjects across educational grades to identify gaps, introduce new learning topics, and enhance the learning outcomes. This process is usually done within the same subjects (e.g. math) or across related subjects (e.g. math and physics) considering the same and different educational levels, leading to massive multi-layer comparisons. Having nuanced data about subjects, topics, and learning outcomes structured within a dataset, empowers us to leverage data science to better understand the progression of various learning topics. In this paper, Bidirectional Encoder Representations from Transformers (BERT) topic modeling was used to extract topics from the curriculum, which were then used to identify relationships between su",
    "link": "https://arxiv.org/abs/2403.05553",
    "context": "Title: Understanding the Progression of Educational Topics via Semantic Matching\nAbstract: arXiv:2403.05553v1 Announce Type: cross  Abstract: Education systems are dynamically changing to accommodate technological advances, industrial and societal needs, and to enhance students' learning journeys. Curriculum specialists and educators constantly revise taught subjects across educational grades to identify gaps, introduce new learning topics, and enhance the learning outcomes. This process is usually done within the same subjects (e.g. math) or across related subjects (e.g. math and physics) considering the same and different educational levels, leading to massive multi-layer comparisons. Having nuanced data about subjects, topics, and learning outcomes structured within a dataset, empowers us to leverage data science to better understand the progression of various learning topics. In this paper, Bidirectional Encoder Representations from Transformers (BERT) topic modeling was used to extract topics from the curriculum, which were then used to identify relationships between su",
    "path": "papers/24/03/2403.05553.json",
    "total_tokens": 669,
    "translated_title": "通过语义匹配理解教育话题的演进",
    "translated_abstract": "教育系统正在动态变化，以适应技术进步、工业和社会需求，并增强学生的学习旅程。课程专家和教育工作者不断修订各教育年级所教授的科目，以确定差距，引入新的学习话题，并提高学习成果。本文利用数据科学来更好地了解各种学习话题的演进。",
    "tldr": "本文利用BERT主题建模从课程中提取主题，然后利用这些主题来识别不同学科之间的关系，帮助我们更好地理解各种学习话题的演进。",
    "en_tdlr": "In this paper, BERT topic modeling was used to extract topics from the curriculum, which were then used to identify relationships between subjects, helping us better understand the progression of various learning topics."
}