{
    "title": "A Memetic Algorithm To Find a Hamiltonian Cycle in a Hamiltonian Graph",
    "abstract": "arXiv:2403.07886v1 Announce Type: cross  Abstract: We present a memetic algorithm (\\maa) approach for finding a Hamiltonian cycle in a Hamiltonian graph. The \\ma is based on a proven approach to the Asymmetric Travelling Salesman Problem (\\atspp) that, in this contribution, is boosted by the introduction of more powerful local searches. Our approach also introduces a novel technique that sparsifies the input graph under consideration for Hamiltonicity and dynamically augments it during the search. Such a combined heuristic approach helps to prove Hamiltonicity by finding a Hamiltonian cycle in less time. In addition, we also employ a recently introduced polynomial-time reduction from the \\hamcyc to the Symmetric \\tsp, which is based on computing the transitive closure of the graph. Although our approach is a metaheuristic, i.e., it does not give a theoretical guarantee for finding a Hamiltonian cycle, we have observed that the method is successful in practice in verifying the Hamiltoni",
    "link": "https://arxiv.org/abs/2403.07886",
    "context": "Title: A Memetic Algorithm To Find a Hamiltonian Cycle in a Hamiltonian Graph\nAbstract: arXiv:2403.07886v1 Announce Type: cross  Abstract: We present a memetic algorithm (\\maa) approach for finding a Hamiltonian cycle in a Hamiltonian graph. The \\ma is based on a proven approach to the Asymmetric Travelling Salesman Problem (\\atspp) that, in this contribution, is boosted by the introduction of more powerful local searches. Our approach also introduces a novel technique that sparsifies the input graph under consideration for Hamiltonicity and dynamically augments it during the search. Such a combined heuristic approach helps to prove Hamiltonicity by finding a Hamiltonian cycle in less time. In addition, we also employ a recently introduced polynomial-time reduction from the \\hamcyc to the Symmetric \\tsp, which is based on computing the transitive closure of the graph. Although our approach is a metaheuristic, i.e., it does not give a theoretical guarantee for finding a Hamiltonian cycle, we have observed that the method is successful in practice in verifying the Hamiltoni",
    "path": "papers/24/03/2403.07886.json",
    "total_tokens": 874,
    "translated_title": "一个在哈密顿图中寻找哈密顿循环的模因算法",
    "translated_abstract": "我们提出了一种用于在哈密顿图中寻找哈密顿循环的模因算法。这种算法基于一种已被证明有效的解决非对称旅行商问题 (\\atspp) 的方法，本文中还通过引入更强大的局部搜索来增强这种算法。我们的方法还引入了一种在考虑哈密顿性的输入图中稀疏化并在搜索过程中动态增强它的新颖技术。这种综合启发式方法有助于通过更短的时间找到哈密顿循环来证明哈密顿性。此外，我们还采用了最近介绍的从 \\hamcyc 到对称 \\tsp 的多项式时间归约方法，该方法基于计算图的传递闭包。尽管我们的方法是一种元启发式方法，即在理论上不能保证找到哈密顿循环，但我们观察到该方法在实践中成功验证了哈密顿性。",
    "tldr": "提出了一种用于在哈密顿图中寻找哈密顿循环的模因算法，并引入了增强局部搜索和动态增强输入图的新颖技术，该方法在实践中成功证明了哈密顿性。"
}