{
    "title": "AesopAgent: Agent-driven Evolutionary System on Story-to-Video Production",
    "abstract": "arXiv:2403.07952v1 Announce Type: cross  Abstract: The Agent and AIGC (Artificial Intelligence Generated Content) technologies have recently made significant progress. We propose AesopAgent, an Agent-driven Evolutionary System on Story-to-Video Production. AesopAgent is a practical application of agent technology for multimodal content generation. The system integrates multiple generative capabilities within a unified framework, so that individual users can leverage these modules easily. This innovative system would convert user story proposals into scripts, images, and audio, and then integrate these multimodal contents into videos. Additionally, the animating units (e.g., Gen-2 and Sora) could make the videos more infectious. The AesopAgent system could orchestrate task workflow for video generation, ensuring that the generated video is both rich in content and coherent. This system mainly contains two layers, i.e., the Horizontal Layer and the Utility Layer. In the Horizontal Layer,",
    "link": "https://arxiv.org/abs/2403.07952",
    "context": "Title: AesopAgent: Agent-driven Evolutionary System on Story-to-Video Production\nAbstract: arXiv:2403.07952v1 Announce Type: cross  Abstract: The Agent and AIGC (Artificial Intelligence Generated Content) technologies have recently made significant progress. We propose AesopAgent, an Agent-driven Evolutionary System on Story-to-Video Production. AesopAgent is a practical application of agent technology for multimodal content generation. The system integrates multiple generative capabilities within a unified framework, so that individual users can leverage these modules easily. This innovative system would convert user story proposals into scripts, images, and audio, and then integrate these multimodal contents into videos. Additionally, the animating units (e.g., Gen-2 and Sora) could make the videos more infectious. The AesopAgent system could orchestrate task workflow for video generation, ensuring that the generated video is both rich in content and coherent. This system mainly contains two layers, i.e., the Horizontal Layer and the Utility Layer. In the Horizontal Layer,",
    "path": "papers/24/03/2403.07952.json",
    "total_tokens": 817,
    "translated_title": "AesopAgent: 基于Agent的故事到视频制作系统",
    "translated_abstract": "近年来，Agent和AIGC（Artificial Intelligence Generated Content）技术取得了显著进展。我们提出了AesopAgent，一种基于Agent的故事到视频制作演进系统。AesopAgent是Agent技术在多模态内容生成方面的实际应用。该系统在统一框架内集成了多种生成能力，使个人用户可以轻松利用这些模块。这一创新系统将用户的故事提案转化为剧本、图像和音频，然后将这些多模态内容集成到视频中。此外，动画单元（例如Gen-2和Sora）可以使视频更具感染力。AesopAgent系统可以协调视频生成的任务工作流程，确保生成的视频内容丰富且连贯。该系统主要包含两个层，即水平层和实用层。在水平层中，",
    "tldr": "AesopAgent是一种基于Agent的故事到视频制作系统，能将用户故事提案转化为剧本、图像和音频，并将这些内容集成为视频，同时确保生成的视频内容丰富且连贯。",
    "en_tdlr": "AesopAgent is an agent-driven evolutionary system for story-to-video production, converting user story proposals into scripts, images, and audio to create rich and coherent videos."
}