{
    "title": "Linear and nonlinear system identification under $\\ell_1$- and group-Lasso regularization via L-BFGS-B",
    "abstract": "arXiv:2403.03827v1 Announce Type: cross  Abstract: In this paper, we propose an approach for identifying linear and nonlinear discrete-time state-space models, possibly under $\\ell_1$- and group-Lasso regularization, based on the L-BFGS-B algorithm. For the identification of linear models, we show that, compared to classical linear subspace methods, the approach often provides better results, is much more general in terms of the loss and regularization terms used, and is also more stable from a numerical point of view. The proposed method not only enriches the existing set of linear system identification tools but can be also applied to identifying a very broad class of parametric nonlinear state-space models, including recurrent neural networks. We illustrate the approach on synthetic and experimental datasets and apply it to solve the challenging industrial robot benchmark for nonlinear multi-input/multi-output system identification proposed by Weigand et al. (2022). A Python impleme",
    "link": "https://arxiv.org/abs/2403.03827",
    "context": "Title: Linear and nonlinear system identification under $\\ell_1$- and group-Lasso regularization via L-BFGS-B\nAbstract: arXiv:2403.03827v1 Announce Type: cross  Abstract: In this paper, we propose an approach for identifying linear and nonlinear discrete-time state-space models, possibly under $\\ell_1$- and group-Lasso regularization, based on the L-BFGS-B algorithm. For the identification of linear models, we show that, compared to classical linear subspace methods, the approach often provides better results, is much more general in terms of the loss and regularization terms used, and is also more stable from a numerical point of view. The proposed method not only enriches the existing set of linear system identification tools but can be also applied to identifying a very broad class of parametric nonlinear state-space models, including recurrent neural networks. We illustrate the approach on synthetic and experimental datasets and apply it to solve the challenging industrial robot benchmark for nonlinear multi-input/multi-output system identification proposed by Weigand et al. (2022). A Python impleme",
    "path": "papers/24/03/2403.03827.json",
    "total_tokens": 937,
    "translated_title": "在L-BFGS-B算法的$\\ell_1$和group-Lasso正则化下进行线性和非线性系统识别",
    "translated_abstract": "在本文中，我们提出了一种基于L-BFGS-B算法的方法，用于识别可能在$\\ell_1$和group-Lasso正则化下的线性和非线性离散时间状态空间模型。针对线性模型的识别，我们展示了与经典线性子空间方法相比，该方法通常提供更好的结果，在损失和正则化项的使用方面更加通用，也在数值上更加稳定。该方法不仅丰富了现有的线性系统识别工具集，还可以应用于识别包括循环神经网络在内的非常广泛的参数化非线性状态空间模型。我们在合成和实验数据集上演示了该方法，并将其应用于解决Weigand等人（2022年）提出的具有挑战性的工业机器人基准的非线性多输入/多输出系统识别。",
    "tldr": "本文提出了一种基于L-BFGS-B算法的方法，可用于在$\\ell_1$和group-Lasso正则化下识别线性和非线性系统，相比传统线性子空间方法，该方法在结果、损失和正则化项使用的通用性以及数值稳定性方面通常提供更好的表现，并且可以广泛应用于各种参数化非线性状态空间模型的识别。",
    "en_tdlr": "The paper presents a method based on the L-BFGS-B algorithm for identifying linear and nonlinear systems under $\\ell_1$ and group-Lasso regularization, showing improved performance compared to traditional methods in terms of results, generality, and numerical stability, and demonstrating applicability to a wide range of parametric nonlinear state-space models."
}