{
    "title": "Applying Self-supervised Learning to Network Intrusion Detection for Network Flows with Graph Neural Network",
    "abstract": "arXiv:2403.01501v1 Announce Type: new  Abstract: Graph Neural Networks (GNNs) have garnered intensive attention for Network Intrusion Detection System (NIDS) due to their suitability for representing the network traffic flows. However, most present GNN-based methods for NIDS are supervised or semi-supervised. Network flows need to be manually annotated as supervisory labels, a process that is time-consuming or even impossible, making NIDS difficult to adapt to potentially complex attacks, especially in large-scale real-world scenarios. The existing GNN-based self-supervised methods focus on the binary classification of network flow as benign or not, and thus fail to reveal the types of attack in practice. This paper studies the application of GNNs to identify the specific types of network flows in an unsupervised manner. We first design an encoder to obtain graph embedding, that introduces the graph attention mechanism and considers the edge information as the only essential factor. Th",
    "link": "https://arxiv.org/abs/2403.01501",
    "context": "Title: Applying Self-supervised Learning to Network Intrusion Detection for Network Flows with Graph Neural Network\nAbstract: arXiv:2403.01501v1 Announce Type: new  Abstract: Graph Neural Networks (GNNs) have garnered intensive attention for Network Intrusion Detection System (NIDS) due to their suitability for representing the network traffic flows. However, most present GNN-based methods for NIDS are supervised or semi-supervised. Network flows need to be manually annotated as supervisory labels, a process that is time-consuming or even impossible, making NIDS difficult to adapt to potentially complex attacks, especially in large-scale real-world scenarios. The existing GNN-based self-supervised methods focus on the binary classification of network flow as benign or not, and thus fail to reveal the types of attack in practice. This paper studies the application of GNNs to identify the specific types of network flows in an unsupervised manner. We first design an encoder to obtain graph embedding, that introduces the graph attention mechanism and considers the edge information as the only essential factor. Th",
    "path": "papers/24/03/2403.01501.json",
    "total_tokens": 827,
    "translated_title": "将自监督学习应用于利用图神经网络进行网络流量入侵检测",
    "translated_abstract": "图神经网络（GNNs）由于其适合表示网络流量而引起人们的广泛关注，尤其是在网络入侵检测系统（NIDS）中。然而，大多数现有的基于GNN的NIDS方法是有监督或半监督的。网络流需要手动注释为监督标签，这个过程耗时，甚至不可能，导致NIDS难以适应潜在复杂的攻击，特别是在大规模实际场景中。现有基于GNN的自监督方法着重于将网络流分类为良性或非良性，难以揭示实际攻击类型。本文研究了以无监督方式应用GNNs识别特定类型网络流的方法。我们首先设计了一个编码器来获取图嵌入，引入了图注意力机制，并将边信息视为唯一基本因素。",
    "tldr": "本文研究了将GNNs应用于无监督方式识别特定类型网络流的方法，通过设计一个引入了图注意力机制的编码器来获取图嵌入。",
    "en_tdlr": "This paper explores the application of GNNs to unsupervised identification of specific types of network flows, achieved by designing an encoder incorporating graph attention mechanism to obtain graph embeddings."
}