{
    "title": "Who is bragging more online? A large scale analysis of bragging in social media",
    "abstract": "arXiv:2403.16668v1 Announce Type: new  Abstract: Bragging is the act of uttering statements that are likely to be positively viewed by others and it is extensively employed in human communication with the aim to build a positive self-image of oneself. Social media is a natural platform for users to employ bragging in order to gain admiration, respect, attention and followers from their audiences. Yet, little is known about the scale of bragging online and its characteristics. This paper employs computational sociolinguistics methods to conduct the first large scale study of bragging behavior on Twitter (U.S.) by focusing on its overall prevalence, temporal dynamics and impact of demographic factors. Our study shows that the prevalence of bragging decreases over time within the same population of users. In addition, younger, more educated and popular users in the U.S. are more likely to brag. Finally, we conduct an extensive linguistics analysis to unveil specific bragging themes associ",
    "link": "https://arxiv.org/abs/2403.16668",
    "context": "Title: Who is bragging more online? A large scale analysis of bragging in social media\nAbstract: arXiv:2403.16668v1 Announce Type: new  Abstract: Bragging is the act of uttering statements that are likely to be positively viewed by others and it is extensively employed in human communication with the aim to build a positive self-image of oneself. Social media is a natural platform for users to employ bragging in order to gain admiration, respect, attention and followers from their audiences. Yet, little is known about the scale of bragging online and its characteristics. This paper employs computational sociolinguistics methods to conduct the first large scale study of bragging behavior on Twitter (U.S.) by focusing on its overall prevalence, temporal dynamics and impact of demographic factors. Our study shows that the prevalence of bragging decreases over time within the same population of users. In addition, younger, more educated and popular users in the U.S. are more likely to brag. Finally, we conduct an extensive linguistics analysis to unveil specific bragging themes associ",
    "path": "papers/24/03/2403.16668.json",
    "total_tokens": 921,
    "translated_title": "谁在网络上炫耀得更多？社交媒体炫耀行为的大规模分析",
    "translated_abstract": "炫耀是说出那些可能被其他人积极看待的话语，它在人类交流中被广泛使用，旨在建立一个积极的自我形象。社交媒体是一个自然的平台，用户可以利用炫耀来获得观众的钦佩、尊重、关注和粉丝。然而，关于网络上炫耀行为的规模和特征知之甚少。本文采用计算社会语言学方法，首次对Twitter（美国）上的炫耀行为进行了大规模研究，重点关注其整体普遍性、时间动态和人口因素的影响。我们的研究表明，在同一用户群体中，炫耀的普遍程度会随着时间的推移而减少。此外，在美国，更年轻、受教育程度较高和受欢迎的用户更有可能炫耀。最后，我们进行了广泛的语言学分析，揭示了特定的炫耀主题。",
    "tldr": "第一次利用计算社会语言学方法在Twitter上进行了大规模研究，发现炫耀行为的普遍性随时间减少，而更年轻、受教育程度较高和受欢迎的用户更容易炫耀。"
}