{
    "title": "Dual Mean-Teacher: An Unbiased Semi-Supervised Framework for Audio-Visual Source Localization",
    "abstract": "arXiv:2403.03145v1 Announce Type: cross  Abstract: Audio-Visual Source Localization (AVSL) aims to locate sounding objects within video frames given the paired audio clips. Existing methods predominantly rely on self-supervised contrastive learning of audio-visual correspondence. Without any bounding-box annotations, they struggle to achieve precise localization, especially for small objects, and suffer from blurry boundaries and false positives. Moreover, the naive semi-supervised method is poor in fully leveraging the information of abundant unlabeled data. In this paper, we propose a novel semi-supervised learning framework for AVSL, namely Dual Mean-Teacher (DMT), comprising two teacher-student structures to circumvent the confirmation bias issue. Specifically, two teachers, pre-trained on limited labeled data, are employed to filter out noisy samples via the consensus between their predictions, and then generate high-quality pseudo-labels by intersecting their confidence maps. The",
    "link": "https://arxiv.org/abs/2403.03145",
    "context": "Title: Dual Mean-Teacher: An Unbiased Semi-Supervised Framework for Audio-Visual Source Localization\nAbstract: arXiv:2403.03145v1 Announce Type: cross  Abstract: Audio-Visual Source Localization (AVSL) aims to locate sounding objects within video frames given the paired audio clips. Existing methods predominantly rely on self-supervised contrastive learning of audio-visual correspondence. Without any bounding-box annotations, they struggle to achieve precise localization, especially for small objects, and suffer from blurry boundaries and false positives. Moreover, the naive semi-supervised method is poor in fully leveraging the information of abundant unlabeled data. In this paper, we propose a novel semi-supervised learning framework for AVSL, namely Dual Mean-Teacher (DMT), comprising two teacher-student structures to circumvent the confirmation bias issue. Specifically, two teachers, pre-trained on limited labeled data, are employed to filter out noisy samples via the consensus between their predictions, and then generate high-quality pseudo-labels by intersecting their confidence maps. The",
    "path": "papers/24/03/2403.03145.json",
    "total_tokens": 918,
    "translated_title": "双重均值教师：用于音频-视觉源定位的无偏半监督框架",
    "translated_abstract": "音频-视觉源定位（AVSL）旨在在视频帧中定位声音对象，给定配对的音频剪辑。现有方法主要依赖于音频-视觉对应关系的自监督对比学习。在没有任何边界框注释的情况下，它们很难实现精确的定位，特别是对于小物体，并且容易出现边界模糊和误报。此外，朴素的半监督方法在充分利用丰富的无标记数据信息方面效果不佳。在本文中，我们提出了一种用于AVSL的新颖半监督学习框架，即双重均值教师（DMT），包括两个教师-学生结构，以规避确认偏差问题。具体地，两个在有限标记数据上预训练的教师被用来通过它们预测之间的一致性来过滤嘈杂样本，然后通过交叉它们的置信图生成高质量伪标签。",
    "tldr": "提出了一种新颖的半监督学习框架用于音频-视觉源定位，通过双重均值教师结构避免确认偏差问题，并利用有限标记数据和丰富无标记数据生成高质量伪标签。",
    "en_tdlr": "Proposed a novel semi-supervised learning framework for audio-visual source localization, which utilizes Dual Mean-Teacher structure to circumvent confirmation bias issue and generate high-quality pseudo-labels with limited labeled and abundant unlabeled data."
}