{
    "title": "Dr3: Ask Large Language Models Not to Give Off-Topic Answers in Open Domain Multi-Hop Question Answering",
    "abstract": "arXiv:2403.12393v1 Announce Type: new  Abstract: Open Domain Multi-Hop Question Answering (ODMHQA) plays a crucial role in Natural Language Processing (NLP) by aiming to answer complex questions through multi-step reasoning over retrieved information from external knowledge sources. Recently, Large Language Models (LLMs) have demonstrated remarkable performance in solving ODMHQA owing to their capabilities including planning, reasoning, and utilizing tools. However, LLMs may generate off-topic answers when attempting to solve ODMHQA, namely the generated answers are irrelevant to the original questions. This issue of off-topic answers accounts for approximately one-third of incorrect answers, yet remains underexplored despite its significance. To alleviate this issue, we propose the Discriminate->Re-Compose->Re- Solve->Re-Decompose (Dr3) mechanism. Specifically, the Discriminator leverages the intrinsic capabilities of LLMs to judge whether the generated answers are off-topic. In cases",
    "link": "https://arxiv.org/abs/2403.12393",
    "context": "Title: Dr3: Ask Large Language Models Not to Give Off-Topic Answers in Open Domain Multi-Hop Question Answering\nAbstract: arXiv:2403.12393v1 Announce Type: new  Abstract: Open Domain Multi-Hop Question Answering (ODMHQA) plays a crucial role in Natural Language Processing (NLP) by aiming to answer complex questions through multi-step reasoning over retrieved information from external knowledge sources. Recently, Large Language Models (LLMs) have demonstrated remarkable performance in solving ODMHQA owing to their capabilities including planning, reasoning, and utilizing tools. However, LLMs may generate off-topic answers when attempting to solve ODMHQA, namely the generated answers are irrelevant to the original questions. This issue of off-topic answers accounts for approximately one-third of incorrect answers, yet remains underexplored despite its significance. To alleviate this issue, we propose the Discriminate->Re-Compose->Re- Solve->Re-Decompose (Dr3) mechanism. Specifically, the Discriminator leverages the intrinsic capabilities of LLMs to judge whether the generated answers are off-topic. In cases",
    "path": "papers/24/03/2403.12393.json",
    "total_tokens": 843,
    "translated_title": "Dr3：要求大型语言模型在开放领域多跳问答中不给出题外答案",
    "translated_abstract": "开放领域多跳问答（ODMHQA）通过对来自外部知识源的信息进行多步推理来回答复杂问题，在自然语言处理（NLP）中扮演着关键角色。最近，大型语言模型（LLMs）在解决ODMHQA方面表现出色，这归因于它们的规划、推理和工具利用等能力。然而，LLMs在尝试解决ODMHQA时可能会生成题外答案，即生成的答案与原始问题无关。这一题外答案的问题约占错误答案的三分之一，但尽管其重要性尚未得到充分探讨。为了缓解这一问题，我们提出了辨别->重组->解决->重新分解（Dr3）机制。具体而言，辨别器利用LLMs的固有能力判断生成的答案是否题外。",
    "tldr": "提出Dr3机制，通过辨别器判断大型语言模型生成的答案是否题外来解决开放领域多跳问答中题外答案的问题",
    "en_tdlr": "Propose the Dr3 mechanism to address off-topic answers in Open Domain Multi-Hop Question Answering by using a discriminator to judge whether the answers generated by large language models are off-topic."
}