{
    "title": "Probabilistic Contrastive Learning for Long-Tailed Visual Recognition",
    "abstract": "arXiv:2403.06726v1 Announce Type: new  Abstract: Long-tailed distributions frequently emerge in real-world data, where a large number of minority categories contain a limited number of samples. Such imbalance issue considerably impairs the performance of standard supervised learning algorithms, which are mainly designed for balanced training sets. Recent investigations have revealed that supervised contrastive learning exhibits promising potential in alleviating the data imbalance. However, the performance of supervised contrastive learning is plagued by an inherent challenge: it necessitates sufficiently large batches of training data to construct contrastive pairs that cover all categories, yet this requirement is difficult to meet in the context of class-imbalanced data. To overcome this obstacle, we propose a novel probabilistic contrastive (ProCo) learning algorithm that estimates the data distribution of the samples from each class in the feature space, and samples contrastive pa",
    "link": "https://arxiv.org/abs/2403.06726",
    "context": "Title: Probabilistic Contrastive Learning for Long-Tailed Visual Recognition\nAbstract: arXiv:2403.06726v1 Announce Type: new  Abstract: Long-tailed distributions frequently emerge in real-world data, where a large number of minority categories contain a limited number of samples. Such imbalance issue considerably impairs the performance of standard supervised learning algorithms, which are mainly designed for balanced training sets. Recent investigations have revealed that supervised contrastive learning exhibits promising potential in alleviating the data imbalance. However, the performance of supervised contrastive learning is plagued by an inherent challenge: it necessitates sufficiently large batches of training data to construct contrastive pairs that cover all categories, yet this requirement is difficult to meet in the context of class-imbalanced data. To overcome this obstacle, we propose a novel probabilistic contrastive (ProCo) learning algorithm that estimates the data distribution of the samples from each class in the feature space, and samples contrastive pa",
    "path": "papers/24/03/2403.06726.json",
    "total_tokens": 817,
    "translated_title": "长尾视觉识别的概率对比学习",
    "translated_abstract": "长尾分布经常出现在现实世界的数据中，其中大量少数类别包含有限数量的样本。这种不平衡问题严重影响了标准监督学习算法的性能，这些算法主要设计用于平衡的训练集。最近的研究表明，监督对比学习在缓解数据不平衡方面表现出有希望的潜力。然而，监督对比学习的性能受到固有挑战的困扰：它需要足够大批次的训练数据来构建涵盖所有类别的对比对，然而在类别不平衡数据的情况下很难满足这一要求。为克服这一障碍，我们提出了一种新颖的概率对比（ProCo）学习算法，该算法估计特征空间中每个类别样本的数据分布，并对比对进行采样。",
    "tldr": "提出了一种新颖的概率对比（ProCo）学习算法，该算法估计特征空间中每个类别样本的数据分布，并对比对进行采样"
}