{
    "title": "Human behaviour through a LENS: How Linguistic content triggers Emotions and Norms and determines Strategy choices",
    "abstract": "arXiv:2403.15293v1 Announce Type: new  Abstract: Over the last two decades, a growing body of experimental research has provided evidence that linguistic frames influence human behaviour in economic games, beyond the economic consequences of the available actions. This article proposes a novel framework that transcends the traditional confines of outcome-based preference models. According to the LENS model, the Linguistic description of the decision problem triggers Emotional responses and suggests potential Norms of behaviour, which then interact to shape an individual's Strategic choice. The article reviews experimental evidence that supports each path of the LENS model. Furthermore, it identifies and discusses several critical research questions that arise from this model, pointing towards avenues for future inquiry.",
    "link": "https://arxiv.org/abs/2403.15293",
    "context": "Title: Human behaviour through a LENS: How Linguistic content triggers Emotions and Norms and determines Strategy choices\nAbstract: arXiv:2403.15293v1 Announce Type: new  Abstract: Over the last two decades, a growing body of experimental research has provided evidence that linguistic frames influence human behaviour in economic games, beyond the economic consequences of the available actions. This article proposes a novel framework that transcends the traditional confines of outcome-based preference models. According to the LENS model, the Linguistic description of the decision problem triggers Emotional responses and suggests potential Norms of behaviour, which then interact to shape an individual's Strategic choice. The article reviews experimental evidence that supports each path of the LENS model. Furthermore, it identifies and discusses several critical research questions that arise from this model, pointing towards avenues for future inquiry.",
    "path": "papers/24/03/2403.15293.json",
    "total_tokens": 744,
    "translated_title": "透过镜头看人类行为：语言内容如何触发情绪和规范，并决定策略选择",
    "translated_abstract": "在过去的二十年里，越来越多的实验研究证明，语言框架影响了经济博弈中人类行为，超越了可用行动的经济后果。本文提出了一个超越传统基于结果偏好模型的新框架。根据LENS模型，对决策问题的语言描述会触发情绪反应并暗示潜在的行为规范，这些规范再相互作用来塑造个体的战略选择。本文审查了支持LENS模型每个路径的实验证据。此外，它确定并讨论了一些由该模型引申出的重要研究问题，指向未来研究的方向。",
    "tldr": "该研究提出了一个名为LENS的框架，指出语言描述会触发情绪反应和潜在行为规范，从而影响个体的战略选择。",
    "en_tdlr": "The study introduces a framework called LENS, indicating that linguistic descriptions trigger emotional responses and potential behavioral norms, thus influencing individual strategic choices."
}