{
    "title": "Natural Language, AI, and Quantum Computing in 2024: Research Ingredients and Directions in QNLP",
    "abstract": "arXiv:2403.19758v1 Announce Type: cross  Abstract: Language processing is at the heart of current developments in artificial intelligence, and quantum computers are becoming available at the same time. This has led to great interest in quantum natural language processing, and several early proposals and experiments. This paper surveys the state of this area, showing how NLP-related techniques including word embeddings, sequential models, attention, and grammatical parsing have been used in quantum language processing. We introduce a new quantum design for the basic task of text encoding (representing a string of characters in memory), which has not been addressed in detail before.   As well as motivating new technologies, quantum theory has made key contributions to the challenging questions of 'What is uncertainty?' and 'What is intelligence?' As these questions are taking on fresh urgency with artificial systems, the paper also considers some of the ways facts are conceptualized and ",
    "link": "https://arxiv.org/abs/2403.19758",
    "context": "Title: Natural Language, AI, and Quantum Computing in 2024: Research Ingredients and Directions in QNLP\nAbstract: arXiv:2403.19758v1 Announce Type: cross  Abstract: Language processing is at the heart of current developments in artificial intelligence, and quantum computers are becoming available at the same time. This has led to great interest in quantum natural language processing, and several early proposals and experiments. This paper surveys the state of this area, showing how NLP-related techniques including word embeddings, sequential models, attention, and grammatical parsing have been used in quantum language processing. We introduce a new quantum design for the basic task of text encoding (representing a string of characters in memory), which has not been addressed in detail before.   As well as motivating new technologies, quantum theory has made key contributions to the challenging questions of 'What is uncertainty?' and 'What is intelligence?' As these questions are taking on fresh urgency with artificial systems, the paper also considers some of the ways facts are conceptualized and ",
    "path": "papers/24/03/2403.19758.json",
    "total_tokens": 972,
    "translated_title": "2024年的自然语言、人工智能和量子计算：QNLP中的研究要点和方向",
    "translated_abstract": "arXiv:2403.19758v1 公告类型：跨领域 抽象：语言处理是当前人工智能发展的关键，同时量子计算也开始应用。这引起了量子自然语言处理的极大兴趣，出现了几个早期提案和实验。本文调查了这一领域的最新进展，展示了NLP相关技术，包括词嵌入、序列模型、注意力和语法分析是如何应用于量子语言处理中的。我们提出了一种新的量子设计用于文本编码的基本任务（在内存中表示一个字符串），这在以前没有详细讨论过。除了推动新技术，量子理论还对“不确定性是什么？”和“智能是什么？”等具有挑战性的问题做出了关键贡献。随着这些问题在人工系统中变得愈发紧迫，本文还考虑了一些事实概念化的方式。",
    "tldr": "该论文调查了2024年自然语言处理、人工智能发展中的量子计算应用，在量子自然语言处理中使用了诸如词嵌入、序列模型、注意力和语法分析等NLP技术，提出了一种新的量子设计来处理文本编码，并探讨了量子理论对“不确定性是什么？”和“智能是什么？”等核心问题的关键贡献。",
    "en_tdlr": "This paper explores the application of quantum computing in natural language processing and artificial intelligence in 2024, showcasing the use of NLP techniques like word embeddings, sequential models, attention, and grammatical parsing in quantum language processing. It introduces a new quantum design for text encoding and discusses the significant contributions of quantum theory to fundamental questions about uncertainty and intelligence in the context of artificial systems."
}