{
    "title": "A Probabilistic Hadamard U-Net for MRI Bias Field Correction",
    "abstract": "arXiv:2403.05024v1 Announce Type: cross  Abstract: Magnetic field inhomogeneity correction remains a challenging task in MRI analysis. Most established techniques are designed for brain MRI by supposing that image intensities in the identical tissue follow a uniform distribution. Such an assumption cannot be easily applied to other organs, especially those that are small in size and heterogeneous in texture (large variations in intensity), such as the prostate. To address this problem, this paper proposes a probabilistic Hadamard U-Net (PHU-Net) for prostate MRI bias field correction. First, a novel Hadamard U-Net (HU-Net) is introduced to extract the low-frequency scalar field, multiplied by the original input to obtain the prototypical corrected image. HU-Net converts the input image from the time domain into the frequency domain via Hadamard transform. In the frequency domain, high-frequency components are eliminated using the trainable filter (scaling layer), hard-thresholding laye",
    "link": "https://arxiv.org/abs/2403.05024",
    "context": "Title: A Probabilistic Hadamard U-Net for MRI Bias Field Correction\nAbstract: arXiv:2403.05024v1 Announce Type: cross  Abstract: Magnetic field inhomogeneity correction remains a challenging task in MRI analysis. Most established techniques are designed for brain MRI by supposing that image intensities in the identical tissue follow a uniform distribution. Such an assumption cannot be easily applied to other organs, especially those that are small in size and heterogeneous in texture (large variations in intensity), such as the prostate. To address this problem, this paper proposes a probabilistic Hadamard U-Net (PHU-Net) for prostate MRI bias field correction. First, a novel Hadamard U-Net (HU-Net) is introduced to extract the low-frequency scalar field, multiplied by the original input to obtain the prototypical corrected image. HU-Net converts the input image from the time domain into the frequency domain via Hadamard transform. In the frequency domain, high-frequency components are eliminated using the trainable filter (scaling layer), hard-thresholding laye",
    "path": "papers/24/03/2403.05024.json",
    "total_tokens": 932,
    "translated_title": "一种用于MRI偏置场校正的概率哈达玛U-Net",
    "translated_abstract": "磁场不均匀性校正在MRI分析中仍然是一个具有挑战性的任务。大多数已建立的技术是为脑MRI设计的，假设相同组织中的图像强度遵循均匀分布。这种假设不易适用于其他器官，特别是那些体积小，质地不均匀（强度变化大）的器官，比如前列腺。为了解决这个问题，本文提出了一种用于前列腺MRI偏置场校正的概率哈达玛U-Net（PHU-Net）。首先，引入了一种新颖的哈达玛U-Net（HU-Net）以提取低频标量场，将其乘以原始输入以获得原型校正图像。HU-Net通过哈达玛变换将输入图像从时域转换为频域。在频域中，使用可训练的滤波器（缩放层）、硬阈值层消除高频部分。",
    "tldr": "提出了一种用于前列腺MRI偏置场校正的概率哈达玛U-Net，引入了哈达玛U-Net（HU-Net）通过哈达玛变换将输入图像从时域转换为频域，并使用可训练的滤波器和硬阈值层消除高频部分。",
    "en_tdlr": "Proposed a probabilistic Hadamard U-Net for prostate MRI bias field correction, introducing a Hadamard U-Net (HU-Net) converting the input image from time domain to frequency domain via Hadamard transform and eliminating high-frequency components using trainable filter and hard-thresholding layer."
}