{
    "title": "A Composite Decomposition Method for Large-Scale Global Optimization",
    "abstract": "arXiv:2403.01192v1 Announce Type: cross  Abstract: Cooperative co-evolution (CC) algorithms, based on the divide-and-conquer strategy, have emerged as the predominant approach to solving large-scale global optimization (LSGO) problems. The efficiency and accuracy of the grouping stage significantly impact the performance of the optimization process. While the general separability grouping (GSG) method has overcome the limitation of previous differential grouping (DG) methods by enabling the decomposition of non-additively separable functions, it suffers from high computational complexity. To address this challenge, this article proposes a composite separability grouping (CSG) method, seamlessly integrating DG and GSG into a problem decomposition framework to utilize the strengths of both approaches. CSG introduces a step-by-step decomposition framework that accurately decomposes various problem types using fewer computational resources. By sequentially identifying additively, multiplic",
    "link": "https://arxiv.org/abs/2403.01192",
    "context": "Title: A Composite Decomposition Method for Large-Scale Global Optimization\nAbstract: arXiv:2403.01192v1 Announce Type: cross  Abstract: Cooperative co-evolution (CC) algorithms, based on the divide-and-conquer strategy, have emerged as the predominant approach to solving large-scale global optimization (LSGO) problems. The efficiency and accuracy of the grouping stage significantly impact the performance of the optimization process. While the general separability grouping (GSG) method has overcome the limitation of previous differential grouping (DG) methods by enabling the decomposition of non-additively separable functions, it suffers from high computational complexity. To address this challenge, this article proposes a composite separability grouping (CSG) method, seamlessly integrating DG and GSG into a problem decomposition framework to utilize the strengths of both approaches. CSG introduces a step-by-step decomposition framework that accurately decomposes various problem types using fewer computational resources. By sequentially identifying additively, multiplic",
    "path": "papers/24/03/2403.01192.json",
    "total_tokens": 784,
    "translated_title": "一种用于大规模全局优化的复合分解方法",
    "translated_abstract": "合作协同进化（CC）算法基于分而治之策略，已成为解决大规模全局优化（LSGO）问题的主要方法。分组阶段的效率和准确性显著影响优化过程的性能。一般可分离分组（GSG）方法克服了以往差分分组方法的局限性，使得非可加分离函数的分解成为可能，但其存在较高的计算复杂性。为了解决这一挑战，本文提出了一种复合可分离分组（CSG）方法，将DG和GSG无缝整合到一个问题分解框架中，以利用两种方法的优势。CSG引入了一个逐步分解框架，可以使用更少的计算资源准确分解各种问题类型。",
    "tldr": "本文提出了一种复合分解方法，将差分分组和一般分组方法整合到一个框架中，通过逐步分解准确分解各种问题类型，降低了计算复杂性。",
    "en_tdlr": "This paper proposes a composite decomposition method that integrates differential grouping and general separability grouping into a framework, accurately decomposing various problem types through step-by-step decomposition to reduce computational complexity."
}