{
    "title": "GPT-generated Text Detection: Benchmark Dataset and Tensor-based Detection Method",
    "abstract": "arXiv:2403.07321v1 Announce Type: new  Abstract: As natural language models like ChatGPT become increasingly prevalent in applications and services, the need for robust and accurate methods to detect their output is of paramount importance. In this paper, we present GPT Reddit Dataset (GRiD), a novel Generative Pretrained Transformer (GPT)-generated text detection dataset designed to assess the performance of detection models in identifying generated responses from ChatGPT. The dataset consists of a diverse collection of context-prompt pairs based on Reddit, with human-generated and ChatGPT-generated responses. We provide an analysis of the dataset's characteristics, including linguistic diversity, context complexity, and response quality. To showcase the dataset's utility, we benchmark several detection methods on it, demonstrating their efficacy in distinguishing between human and ChatGPT-generated responses. This dataset serves as a resource for evaluating and advancing detection te",
    "link": "https://arxiv.org/abs/2403.07321",
    "context": "Title: GPT-generated Text Detection: Benchmark Dataset and Tensor-based Detection Method\nAbstract: arXiv:2403.07321v1 Announce Type: new  Abstract: As natural language models like ChatGPT become increasingly prevalent in applications and services, the need for robust and accurate methods to detect their output is of paramount importance. In this paper, we present GPT Reddit Dataset (GRiD), a novel Generative Pretrained Transformer (GPT)-generated text detection dataset designed to assess the performance of detection models in identifying generated responses from ChatGPT. The dataset consists of a diverse collection of context-prompt pairs based on Reddit, with human-generated and ChatGPT-generated responses. We provide an analysis of the dataset's characteristics, including linguistic diversity, context complexity, and response quality. To showcase the dataset's utility, we benchmark several detection methods on it, demonstrating their efficacy in distinguishing between human and ChatGPT-generated responses. This dataset serves as a resource for evaluating and advancing detection te",
    "path": "papers/24/03/2403.07321.json",
    "total_tokens": 829,
    "translated_title": "GPT生成文本检测：基准数据集和基于张量的检测方法",
    "translated_abstract": "随着诸如ChatGPT等自然语言模型在应用和服务中越来越普遍，检测其输出的鲁棒准确方法变得至关重要。本文介绍了GPT Reddit数据集（GRiD），这是一个用于评估检测模型性能的新颖的GPT生成文本检测数据集，用于识别ChatGPT生成的响应。该数据集包含基于Reddit的各种上下文提示对，包括人为生成和ChatGPT生成的响应。我们对数据集的特征进行了分析，包括语言多样性、上下文复杂性和响应质量。为展示数据集的实用性，我们对其进行了多种检测方法的基准测试，展示它们在区分人类和ChatGPT生成的响应方面的功效。这一数据集可用作评估和推进检测技术的资源。",
    "tldr": "介绍了一个新的GPT生成文本检测数据集GRiD，用于评估检测模型性能和区分人类与ChatGPT生成响应。提供了数据集特征分析和多种检测方法基准测试结果。",
    "en_tdlr": "Introduced a new dataset GRiD for GPT-generated text detection to evaluate detection model performance and differentiate human from ChatGPT-generated responses. Provided dataset characteristic analysis and benchmark results of various detection methods."
}