{
    "title": "Performance, Knowledge Acquisition and Satisfaction in Self-selected Groups: Evidence from a Classroom Field Experiment",
    "abstract": "arXiv:2403.12694v1 Announce Type: new  Abstract: We investigate how to efficiently set up work groups to boost group productivity, individual satisfaction, and learning. Therefore, we conduct a natural field experiment in a compulsory undergraduate course and study differences between self-selected and randomly assigned groups. We find that self-selected groups perform significantly worse on group assignments. Yet, students in self-selected groups learn more and are more satisfied than those in randomly assigned groups. The effect of allowing students to pick group members dominates the effect of different group compositions in self-selected groups: When controlling for the skill, gender, and home region composition of groups, the differences between self-selected and randomly formed groups persist almost unaltered. The distribution of GitHub commits per group reveals that the better average performance of randomly assigned groups is mainly driven by highly skilled individuals distribu",
    "link": "https://arxiv.org/abs/2403.12694",
    "context": "Title: Performance, Knowledge Acquisition and Satisfaction in Self-selected Groups: Evidence from a Classroom Field Experiment\nAbstract: arXiv:2403.12694v1 Announce Type: new  Abstract: We investigate how to efficiently set up work groups to boost group productivity, individual satisfaction, and learning. Therefore, we conduct a natural field experiment in a compulsory undergraduate course and study differences between self-selected and randomly assigned groups. We find that self-selected groups perform significantly worse on group assignments. Yet, students in self-selected groups learn more and are more satisfied than those in randomly assigned groups. The effect of allowing students to pick group members dominates the effect of different group compositions in self-selected groups: When controlling for the skill, gender, and home region composition of groups, the differences between self-selected and randomly formed groups persist almost unaltered. The distribution of GitHub commits per group reveals that the better average performance of randomly assigned groups is mainly driven by highly skilled individuals distribu",
    "path": "papers/24/03/2403.12694.json",
    "total_tokens": 803,
    "translated_title": "自选小组中的绩效、知识获取和满意度：来自一项课堂实地实验的证据",
    "translated_abstract": "我们研究如何有效地组建工作小组以提高小组生产力、个人满意度和学习情况。因此，我们在一门必修本科课程中进行了一项自然的实地实验，并研究了自选小组和随机分配小组之间的差异。我们发现，自选小组在小组任务上表现显著较差。然而，自选小组的学生学到更多，比随机分配的组更满意。允许学生选择组员的影响在自选小组中占主导地位：在控制组的技能、性别和家庭地区构成后，自选小组和随机组之间的差异几乎保持不变。GitHub提交的分布显示，随机分配的组的平均表现更好主要是由技能高的个人推动的。",
    "tldr": "研究发现，在自选小组中，学生表现较差，但学习效果更好和更满意，自选组效果主要受学生选择组员的影响。",
    "en_tdlr": "The study reveals that in self-selected groups, students perform worse on group assignments, yet learn more and are more satisfied, with the effect primarily driven by students selecting their group members."
}