{
    "title": "S3LLM: Large-Scale Scientific Software Understanding with LLMs using Source, Metadata, and Document",
    "abstract": "arXiv:2403.10588v1 Announce Type: cross  Abstract: The understanding of large-scale scientific software poses significant challenges due to its diverse codebase, extensive code length, and target computing architectures. The emergence of generative AI, specifically large language models (LLMs), provides novel pathways for understanding such complex scientific codes. This paper presents S3LLM, an LLM-based framework designed to enable the examination of source code, code metadata, and summarized information in conjunction with textual technical reports in an interactive, conversational manner through a user-friendly interface. S3LLM leverages open-source LLaMA-2 models to enhance code analysis through the automatic transformation of natural language queries into domain-specific language (DSL) queries. Specifically, it translates these queries into Feature Query Language (FQL), enabling efficient scanning and parsing of entire code repositories. In addition, S3LLM is equipped to handle d",
    "link": "https://arxiv.org/abs/2403.10588",
    "context": "Title: S3LLM: Large-Scale Scientific Software Understanding with LLMs using Source, Metadata, and Document\nAbstract: arXiv:2403.10588v1 Announce Type: cross  Abstract: The understanding of large-scale scientific software poses significant challenges due to its diverse codebase, extensive code length, and target computing architectures. The emergence of generative AI, specifically large language models (LLMs), provides novel pathways for understanding such complex scientific codes. This paper presents S3LLM, an LLM-based framework designed to enable the examination of source code, code metadata, and summarized information in conjunction with textual technical reports in an interactive, conversational manner through a user-friendly interface. S3LLM leverages open-source LLaMA-2 models to enhance code analysis through the automatic transformation of natural language queries into domain-specific language (DSL) queries. Specifically, it translates these queries into Feature Query Language (FQL), enabling efficient scanning and parsing of entire code repositories. In addition, S3LLM is equipped to handle d",
    "path": "papers/24/03/2403.10588.json",
    "total_tokens": 924,
    "translated_title": "S3LLM：使用源代码、元数据和文档的LLMs进行大规模科学软件理解",
    "translated_abstract": "由于其多样的代码库、庞大的代码长度和目标计算架构，大规模科学软件的理解面临着重大挑战。生成式人工智能的出现，特别是大型语言模型（LLMs），为理解这种复杂科学代码提供了新的途径。本文提出了S3LLM，一种基于LLM的框架，旨在通过用户友好的界面以交互式、对话式的方式，使用户能够检查源代码、代码元数据和摘要信息以及文本技术报告。S3LLM利用开源的LLaMA-2模型增强了代码分析，通过将自然语言查询自动转换为特定于领域的语言（DSL）查询。具体来说，它将这些查询转换为特征查询语言（FQL），从而实现对整个代码存储库的高效扫描和解析。此外，S3LLM还能够处理d",
    "tldr": "S3LLM是一个基于LLM的框架，利用生成式人工智能技术，通过用户友好的界面以交互式、对话式的方式，使用户能够检查大规模科学软件的源代码、代码元数据和摘要信息以及文本技术报告，并通过转换自然语言查询为领域特定语言查询来增强代码分析。",
    "en_tdlr": "S3LLM is an LLM-based framework that leverages generative AI technology to enable users to inspect the source code, code metadata, summarized information, and textual technical reports of large-scale scientific software in an interactive and conversational manner through a user-friendly interface, enhancing code analysis by translating natural language queries into domain-specific language queries."
}