{
    "title": "Institutional-Level Monitoring of Immune Checkpoint Inhibitor IrAEs Using a Novel Natural Language Processing Algorithmic Pipeline",
    "abstract": "arXiv:2403.09708v1 Announce Type: new  Abstract: Background: Immune checkpoint inhibitors (ICIs) have revolutionized cancer treatment but can result in severe immune-related adverse events (IrAEs). Monitoring IrAEs on a large scale is essential for personalized risk profiling and assisting in treatment decisions.   Methods: In this study, we conducted an analysis of clinical notes from patients who received ICIs at the Tel Aviv Sourasky Medical Center. By employing a Natural Language Processing algorithmic pipeline, we systematically identified seven common or severe IrAEs. We examined the utilization of corticosteroids, treatment discontinuation rates following IrAEs, and constructed survival curves to visualize the occurrence of adverse events during treatment.   Results: Our analysis encompassed 108,280 clinical notes associated with 1,635 patients who had undergone ICI therapy. The detected incidence of IrAEs was consistent with previous reports, exhibiting substantial variation ac",
    "link": "https://arxiv.org/abs/2403.09708",
    "context": "Title: Institutional-Level Monitoring of Immune Checkpoint Inhibitor IrAEs Using a Novel Natural Language Processing Algorithmic Pipeline\nAbstract: arXiv:2403.09708v1 Announce Type: new  Abstract: Background: Immune checkpoint inhibitors (ICIs) have revolutionized cancer treatment but can result in severe immune-related adverse events (IrAEs). Monitoring IrAEs on a large scale is essential for personalized risk profiling and assisting in treatment decisions.   Methods: In this study, we conducted an analysis of clinical notes from patients who received ICIs at the Tel Aviv Sourasky Medical Center. By employing a Natural Language Processing algorithmic pipeline, we systematically identified seven common or severe IrAEs. We examined the utilization of corticosteroids, treatment discontinuation rates following IrAEs, and constructed survival curves to visualize the occurrence of adverse events during treatment.   Results: Our analysis encompassed 108,280 clinical notes associated with 1,635 patients who had undergone ICI therapy. The detected incidence of IrAEs was consistent with previous reports, exhibiting substantial variation ac",
    "path": "papers/24/03/2403.09708.json",
    "total_tokens": 854,
    "translated_title": "利用新型自然语言处理算法管道对免疫检查点抑制剂IrAEs进行机构级监测",
    "translated_abstract": "背景：免疫检查点抑制剂（ICIs）已经彻底改变了癌症治疗，但可能导致严重的免疫相关不良事件（IrAEs）。监测IrAEs的发生对于个性化风险评估以及协助治疗决策至关重要。本研究通过分析接受ICIs治疗的Tel Aviv Sourasky医疗中心患者的临床记录，利用自然语言处理算法管道系统性地识别了七种常见或严重的IrAEs。我们研究了皮质类固醇的使用情况，以及IrAEs后的治疗中断率，并构建了生存曲线以可视化治疗过程中不良事件的发生。",
    "tldr": "通过新型自然语言处理算法管道，研究对108,280份临床记录进行分析，发现ICIs治疗患者中IrAEs的发生情况，并进行了治疗中断率和生存曲线的构建。",
    "en_tdlr": "By utilizing a novel Natural Language Processing algorithmic pipeline, the study analyzed 108,280 clinical notes to identify the occurrence of IrAEs in patients receiving ICIs treatment, and conducted treatment discontinuation rates and survival curves."
}