{
    "title": "Materials science in the era of large language models: a perspective",
    "abstract": "arXiv:2403.06949v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have garnered considerable interest due to their impressive natural language capabilities, which in conjunction with various emergent properties make them versatile tools in workflows ranging from complex code generation to heuristic finding for combinatorial problems. In this paper we offer a perspective on their applicability to materials science research, arguing their ability to handle ambiguous requirements across a range of tasks and disciplines mean they could be a powerful tool to aid researchers. We qualitatively examine basic LLM theory, connecting it to relevant properties and techniques in the literature before providing two case studies that demonstrate their use in task automation and knowledge extraction at-scale. At their current stage of development, we argue LLMs should be viewed less as oracles of novel insight, and more as tireless workers that can accelerate and unify exploration across",
    "link": "https://arxiv.org/abs/2403.06949",
    "context": "Title: Materials science in the era of large language models: a perspective\nAbstract: arXiv:2403.06949v1 Announce Type: cross  Abstract: Large Language Models (LLMs) have garnered considerable interest due to their impressive natural language capabilities, which in conjunction with various emergent properties make them versatile tools in workflows ranging from complex code generation to heuristic finding for combinatorial problems. In this paper we offer a perspective on their applicability to materials science research, arguing their ability to handle ambiguous requirements across a range of tasks and disciplines mean they could be a powerful tool to aid researchers. We qualitatively examine basic LLM theory, connecting it to relevant properties and techniques in the literature before providing two case studies that demonstrate their use in task automation and knowledge extraction at-scale. At their current stage of development, we argue LLMs should be viewed less as oracles of novel insight, and more as tireless workers that can accelerate and unify exploration across",
    "path": "papers/24/03/2403.06949.json",
    "total_tokens": 856,
    "translated_title": "大语言模型时代的材料科学：一个展望",
    "translated_abstract": "大型语言模型（LLMs）由于其令人印象深刻的自然语言能力而引起了广泛关注，结合各种新兴特性，使它们成为从复杂代码生成到启发式找解组合问题等工作流程中的多功能工具。 在本文中，我们提供了关于它们在材料科学研究中的适用性的观点，认为它们能够处理跨多项任务和学科的模糊需求意味着它们可能成为帮助研究人员的强大工具。 我们定性地研究了基本的LLM理论，将其与文献中的相关特性和技术联系起来，然后提供了两个案例研究，展示了它们在规模化任务自动化和知识提取中的应用。 在它们当前的发展阶段，我们认为LLMs应该被看作不是新颖洞察力的预言者，而是能够加速和统一探索的不知疲倦的工作者。",
    "tldr": "大语言模型在材料科学研究中展示出处理模糊需求、加速任务自动化和知识提取的潜力，可作为研究人员的有力工具。",
    "en_tdlr": "Large Language Models show the potential to handle ambiguous requirements, accelerate task automation, and facilitate knowledge extraction in materials science research, serving as powerful tools for researchers."
}