{
    "title": "CCDSReFormer: Traffic Flow Prediction with a Criss-Crossed Dual-Stream Enhanced Rectified Transformer Model",
    "abstract": "arXiv:2403.17753v1 Announce Type: new  Abstract: Accurate, and effective traffic forecasting is vital for smart traffic systems, crucial in urban traffic planning and management. Current Spatio-Temporal Transformer models, despite their prediction capabilities, struggle with balancing computational efficiency and accuracy, favoring global over local information, and handling spatial and temporal data separately, limiting insight into complex interactions. We introduce the Criss-Crossed Dual-Stream Enhanced Rectified Transformer model (CCDSReFormer), which includes three innovative modules: Enhanced Rectified Spatial Self-attention (ReSSA), Enhanced Rectified Delay Aware Self-attention (ReDASA), and Enhanced Rectified Temporal Self-attention (ReTSA). These modules aim to lower computational needs via sparse attention, focus on local information for better traffic dynamics understanding, and merge spatial and temporal insights through a unique learning method. Extensive tests on six real",
    "link": "https://arxiv.org/abs/2403.17753",
    "context": "Title: CCDSReFormer: Traffic Flow Prediction with a Criss-Crossed Dual-Stream Enhanced Rectified Transformer Model\nAbstract: arXiv:2403.17753v1 Announce Type: new  Abstract: Accurate, and effective traffic forecasting is vital for smart traffic systems, crucial in urban traffic planning and management. Current Spatio-Temporal Transformer models, despite their prediction capabilities, struggle with balancing computational efficiency and accuracy, favoring global over local information, and handling spatial and temporal data separately, limiting insight into complex interactions. We introduce the Criss-Crossed Dual-Stream Enhanced Rectified Transformer model (CCDSReFormer), which includes three innovative modules: Enhanced Rectified Spatial Self-attention (ReSSA), Enhanced Rectified Delay Aware Self-attention (ReDASA), and Enhanced Rectified Temporal Self-attention (ReTSA). These modules aim to lower computational needs via sparse attention, focus on local information for better traffic dynamics understanding, and merge spatial and temporal insights through a unique learning method. Extensive tests on six real",
    "path": "papers/24/03/2403.17753.json",
    "total_tokens": 936,
    "translated_title": "CCDSReFormer：一种交叉双流增强整流变压器模型用于交通流预测",
    "translated_abstract": "准确而有效的交通预测对于智能交通系统至关重要，在城市交通规划和管理中至关重要。当前的时空变压器模型，尽管具有预测能力，但在平衡计算效率和准确性、偏好全局而非局部信息、以及分开处理空间和时间数据方面存在困难，限制了对复杂交互作用的洞察。我们引入了交叉双流增强整流变压器模型（CCDSReFormer），其中包括三个创新模块：增强整流空间自注意力（ReSSA）、增强整流延迟感知自注意力（ReDASA）和增强整流时间自注意力（ReTSA）。这些模块旨在通过稀疏注意力降低计算需求，专注于局部信息以更好地理解交通动态，并通过独特的学习方法合并空间和时间见解。对六个真实数据集进行了广泛测试。",
    "tldr": "CCDSReFormer模型引入了三种创新模块来提高交通流预测的效率和准确性，包括增强整流空间自注意力、增强整流延迟感知自注意力和增强整流时间自注意力，以实现稀疏注意力、可解释的局部信息和融合空间和时间见解。",
    "en_tdlr": "The CCDSReFormer model introduces three innovative modules to improve the efficiency and accuracy of traffic flow prediction, including Enhanced Rectified Spatial Self-attention, Enhanced Rectified Delay Aware Self-attention, and Enhanced Rectified Temporal Self-attention, to achieve sparse attention, interpretable local information, and merge spatial and temporal insights."
}