{
    "title": "On the Markov Property of Neural Algorithmic Reasoning: Analyses and Methods",
    "abstract": "arXiv:2403.04929v1 Announce Type: cross  Abstract: Neural algorithmic reasoning is an emerging research direction that endows neural networks with the ability to mimic algorithmic executions step-by-step. A common paradigm in existing designs involves the use of historical embeddings in predicting the results of future execution steps. Our observation in this work is that such historical dependence intrinsically contradicts the Markov nature of algorithmic reasoning tasks. Based on this motivation, we present our ForgetNet, which does not use historical embeddings and thus is consistent with the Markov nature of the tasks. To address challenges in training ForgetNet at early stages, we further introduce G-ForgetNet, which uses a gating mechanism to allow for the selective integration of historical embeddings. Such an enhanced capability provides valuable computational pathways during the model's early training phase. Our extensive experiments, based on the CLRS-30 algorithmic reasoning",
    "link": "https://arxiv.org/abs/2403.04929",
    "context": "Title: On the Markov Property of Neural Algorithmic Reasoning: Analyses and Methods\nAbstract: arXiv:2403.04929v1 Announce Type: cross  Abstract: Neural algorithmic reasoning is an emerging research direction that endows neural networks with the ability to mimic algorithmic executions step-by-step. A common paradigm in existing designs involves the use of historical embeddings in predicting the results of future execution steps. Our observation in this work is that such historical dependence intrinsically contradicts the Markov nature of algorithmic reasoning tasks. Based on this motivation, we present our ForgetNet, which does not use historical embeddings and thus is consistent with the Markov nature of the tasks. To address challenges in training ForgetNet at early stages, we further introduce G-ForgetNet, which uses a gating mechanism to allow for the selective integration of historical embeddings. Such an enhanced capability provides valuable computational pathways during the model's early training phase. Our extensive experiments, based on the CLRS-30 algorithmic reasoning",
    "path": "papers/24/03/2403.04929.json",
    "total_tokens": 859,
    "translated_title": "关于神经算法推理的马尔可夫性质：分析与方法",
    "translated_abstract": "神经算法推理是一种新兴的研究方向，赋予神经网络模仿算法执行逐步进行的能力。现有设计中的一个常见范式涉及使用历史嵌入来预测未来执行步骤的结果。本文的观察是，这种历史依赖本质上与算法推理任务的马尔可夫性质相矛盾。基于这一动机，我们提出了我们的ForgetNet，它不使用历史嵌入，因此与任务的马尔可夫性质一致。为了解决ForgetNet在早期阶段训练中的挑战，我们进一步引入了G-ForgetNet，它使用门控机制允许有选择性地整合历史嵌入。这种增强的能力在模型的早期训练阶段提供了有价值的计算路径。我们进行了大量实验，基于CLRS-30算法推理",
    "tldr": "本研究提出了ForgetNet和G-ForgetNet，通过不使用历史嵌入和引入门控机制来解决神经算法推理中的马尔可夫性质矛盾，提供了有价值的计算路径。",
    "en_tdlr": "This study introduces ForgetNet and G-ForgetNet to address the contradiction with the Markov nature of algorithmic reasoning by not using historical embeddings and introducing a gating mechanism, providing valuable computational pathways."
}