{
    "title": "Feint in Multi-Player Games",
    "abstract": "arXiv:2403.07932v1 Announce Type: cross  Abstract: This paper introduces the first formalization, implementation and quantitative evaluation of Feint in Multi-Player Games. Our work first formalizes Feint from the perspective of Multi-Player Games, in terms of the temporal, spatial, and their collective impacts. The formalization is built upon Non-transitive Active Markov Game Model, where Feint can have a considerable amount of impacts. Then, our work considers practical implementation details of Feint in Multi-Player Games, under the state-of-the-art progress of multi-agent modeling to date (namely Multi-Agent Reinforcement Learning). Finally, our work quantitatively examines the effectiveness of our design, and the results show that our design of Feint can (1) greatly improve the reward gains from the game; (2) significantly improve the diversity of Multi-Player Games; and (3) only incur negligible overheads in terms of time consumption. We conclude that our design of Feint is effec",
    "link": "https://arxiv.org/abs/2403.07932",
    "context": "Title: Feint in Multi-Player Games\nAbstract: arXiv:2403.07932v1 Announce Type: cross  Abstract: This paper introduces the first formalization, implementation and quantitative evaluation of Feint in Multi-Player Games. Our work first formalizes Feint from the perspective of Multi-Player Games, in terms of the temporal, spatial, and their collective impacts. The formalization is built upon Non-transitive Active Markov Game Model, where Feint can have a considerable amount of impacts. Then, our work considers practical implementation details of Feint in Multi-Player Games, under the state-of-the-art progress of multi-agent modeling to date (namely Multi-Agent Reinforcement Learning). Finally, our work quantitatively examines the effectiveness of our design, and the results show that our design of Feint can (1) greatly improve the reward gains from the game; (2) significantly improve the diversity of Multi-Player Games; and (3) only incur negligible overheads in terms of time consumption. We conclude that our design of Feint is effec",
    "path": "papers/24/03/2403.07932.json",
    "total_tokens": 875,
    "translated_title": "多人游戏中的假动作",
    "translated_abstract": "这篇论文介绍了对多人游戏中的假动作进行了首次形式化、实现和定量评估。我们首先从多人游戏的角度对假动作进行了形式化，涉及到时间、空间和它们的集体影响。该形式化建立在非传递性主动马尔可夫游戏模型之上，其中假动作能够产生可观的影响。接下来，我们考虑了在多代理建模的最新进展下（即多智能体强化学习）在多人游戏中实施假动作的实际细节。最后，我们定量检验了我们设计的有效性，结果显示我们的假动作设计可以（1）显著提高游戏中的奖励收益；（2）显著提高多人游戏的多样性；以及（3）仅在时间消耗方面产生可忽略的开销。我们得出结论，我们的假动作设计是有效的。",
    "tldr": "该论文介绍了多人游戏中假动作的首次形式化、实现和定量评估，并证明其能够显著提高奖励收益、增加游戏多样性，且时间消耗方面开销很小。",
    "en_tdlr": "This paper introduces the first formalization, implementation, and quantitative evaluation of Feint in Multi-Player Games, showing its significant improvement in reward gains, diversity of games, with negligible time consumption overheads."
}