{
    "title": "Img2Loc: Revisiting Image Geolocalization using Multi-modality Foundation Models and Image-based Retrieval-Augmented Generation",
    "abstract": "arXiv:2403.19584v1 Announce Type: cross  Abstract: Geolocating precise locations from images presents a challenging problem in computer vision and information retrieval.Traditional methods typically employ either classification, which dividing the Earth surface into grid cells and classifying images accordingly, or retrieval, which identifying locations by matching images with a database of image-location pairs. However, classification-based approaches are limited by the cell size and cannot yield precise predictions, while retrieval-based systems usually suffer from poor search quality and inadequate coverage of the global landscape at varied scale and aggregation levels. To overcome these drawbacks, we present Img2Loc, a novel system that redefines image geolocalization as a text generation task. This is achieved using cutting-edge large multi-modality models like GPT4V or LLaVA with retrieval augmented generation. Img2Loc first employs CLIP-based representations to generate an image",
    "link": "https://arxiv.org/abs/2403.19584",
    "context": "Title: Img2Loc: Revisiting Image Geolocalization using Multi-modality Foundation Models and Image-based Retrieval-Augmented Generation\nAbstract: arXiv:2403.19584v1 Announce Type: cross  Abstract: Geolocating precise locations from images presents a challenging problem in computer vision and information retrieval.Traditional methods typically employ either classification, which dividing the Earth surface into grid cells and classifying images accordingly, or retrieval, which identifying locations by matching images with a database of image-location pairs. However, classification-based approaches are limited by the cell size and cannot yield precise predictions, while retrieval-based systems usually suffer from poor search quality and inadequate coverage of the global landscape at varied scale and aggregation levels. To overcome these drawbacks, we present Img2Loc, a novel system that redefines image geolocalization as a text generation task. This is achieved using cutting-edge large multi-modality models like GPT4V or LLaVA with retrieval augmented generation. Img2Loc first employs CLIP-based representations to generate an image",
    "path": "papers/24/03/2403.19584.json",
    "total_tokens": 812,
    "translated_title": "Img2Loc: 通过多模态基础模型和基于图像检索增强的生成重新审视图像地理定位",
    "translated_abstract": "从图像中定位精确位置在计算机视觉和信息检索中是一个具有挑战性的问题。传统方法通常采用分类或检索，分类方法将地球表面划分为网格单元并相应地对图像进行分类，而检索方法通过将图像与图像-位置对数据库匹配来识别位置。然而，基于分类的方法受到单元格大小的限制，不能产生精确的预测，而基于检索的系统通常搜索质量较差，对全球景观在不同尺度和聚合级别的覆盖不足。为了克服这些缺点，我们提出了Img2Loc，这是一个通过文本生成任务重新定义图像地理定位的新系统。这是通过使用像GPT4V或LLaVA这样的尖端大型多模态模型与检索增强生成来实现的。Img2Loc首先使用基于CLIP的表示来生成一张图像。",
    "tldr": "Img2Loc通过多模态基础模型和基于图像检索增强的生成重新定义图像地理定位为文本生成任务。",
    "en_tdlr": "Img2Loc redefines image geolocalization as a text generation task using large multi-modality models and retrieval-augmented generation."
}