{
    "title": "NeuroPictor: Refining fMRI-to-Image Reconstruction via Multi-individual Pretraining and Multi-level Modulation",
    "abstract": "arXiv:2403.18211v1 Announce Type: cross  Abstract: Recent fMRI-to-image approaches mainly focused on associating fMRI signals with specific conditions of pre-trained diffusion models. These approaches, while producing high-quality images, capture only a limited aspect of the complex information in fMRI signals and offer little detailed control over image creation. In contrast, this paper proposes to directly modulate the generation process of diffusion models using fMRI signals. Our approach, NeuroPictor, divides the fMRI-to-image process into three steps: i) fMRI calibrated-encoding, to tackle multi-individual pre-training for a shared latent space to minimize individual difference and enable the subsequent cross-subject training; ii) fMRI-to-image cross-subject pre-training, perceptually learning to guide diffusion model with high- and low-level conditions across different individuals; iii) fMRI-to-image single-subject refining, similar with step ii but focus on adapting to particula",
    "link": "https://arxiv.org/abs/2403.18211",
    "context": "Title: NeuroPictor: Refining fMRI-to-Image Reconstruction via Multi-individual Pretraining and Multi-level Modulation\nAbstract: arXiv:2403.18211v1 Announce Type: cross  Abstract: Recent fMRI-to-image approaches mainly focused on associating fMRI signals with specific conditions of pre-trained diffusion models. These approaches, while producing high-quality images, capture only a limited aspect of the complex information in fMRI signals and offer little detailed control over image creation. In contrast, this paper proposes to directly modulate the generation process of diffusion models using fMRI signals. Our approach, NeuroPictor, divides the fMRI-to-image process into three steps: i) fMRI calibrated-encoding, to tackle multi-individual pre-training for a shared latent space to minimize individual difference and enable the subsequent cross-subject training; ii) fMRI-to-image cross-subject pre-training, perceptually learning to guide diffusion model with high- and low-level conditions across different individuals; iii) fMRI-to-image single-subject refining, similar with step ii but focus on adapting to particula",
    "path": "papers/24/03/2403.18211.json",
    "total_tokens": 820,
    "translated_title": "NeuroPictor: 通过多个个体的预训练和多层调制优化fMRI到图像的重建",
    "translated_abstract": "最近的fMRI到图像方法主要集中在将fMRI信号与预先训练的扩散模型的特定条件关联起来。相比之下，本文提出直接调制扩散模型的生成过程，将fMRI到图像过程分为三个步骤：i) fMRI校准编码，用于处理共享潜在空间的多个体预训练，以最小化个体差异并实现后续的跨主体训练；ii) fMRI到图像跨个体预训练，感知地学习如何引导不同个体之间高低层次条件的扩散模型；iii) fMRI到图像单个体细化，类似于步骤ii，但侧重于适应特定个体。",
    "tldr": "NeuroPictor通过直接调制扩散模型的生成过程，实现了fMRI到图像的重建，在多个个体预训练和多层次的引导条件下，实现了更详细的图像控制。",
    "en_tdlr": "NeuroPictor refines fMRI-to-image reconstruction by directly modulating the generation process of diffusion models, enabling more detailed control over image creation through multi-individual pretraining and multi-level guiding conditions."
}