{
    "title": "On Robustness and Generalization of ML-Based Congestion Predictors to Valid and Imperceptible Perturbations",
    "abstract": "arXiv:2403.00103v1 Announce Type: new  Abstract: There is substantial interest in the use of machine learning (ML)-based techniques throughout the electronic computer-aided design (CAD) flow, particularly methods based on deep learning. However, while deep learning methods have achieved state-of-the-art performance in several applications, recent work has demonstrated that neural networks are generally vulnerable to small, carefully chosen perturbations of their input (e.g. a single pixel change in an image). In this work, we investigate robustness in the context of ML-based EDA tools -- particularly for congestion prediction. As far as we are aware, we are the first to explore this concept in the context of ML-based EDA.   We first describe a novel notion of imperceptibility designed specifically for VLSI layout problems defined on netlists and cell placements. Our definition of imperceptibility is characterized by a guarantee that a perturbation to a layout will not alter its global ",
    "link": "https://arxiv.org/abs/2403.00103",
    "context": "Title: On Robustness and Generalization of ML-Based Congestion Predictors to Valid and Imperceptible Perturbations\nAbstract: arXiv:2403.00103v1 Announce Type: new  Abstract: There is substantial interest in the use of machine learning (ML)-based techniques throughout the electronic computer-aided design (CAD) flow, particularly methods based on deep learning. However, while deep learning methods have achieved state-of-the-art performance in several applications, recent work has demonstrated that neural networks are generally vulnerable to small, carefully chosen perturbations of their input (e.g. a single pixel change in an image). In this work, we investigate robustness in the context of ML-based EDA tools -- particularly for congestion prediction. As far as we are aware, we are the first to explore this concept in the context of ML-based EDA.   We first describe a novel notion of imperceptibility designed specifically for VLSI layout problems defined on netlists and cell placements. Our definition of imperceptibility is characterized by a guarantee that a perturbation to a layout will not alter its global ",
    "path": "papers/24/03/2403.00103.json",
    "total_tokens": 868,
    "translated_title": "对基于机器学习的拥塞预测器的健壮性和泛化性的研究",
    "translated_abstract": "在电子计算机辅助设计(CAD)流程中，对基于机器学习（ML）技术的使用引起了极大的兴趣，尤其是基于深度学习的方法。然而，尽管深度学习方法在多个应用中取得了最先进的性能，最近的研究表明神经网络通常对其输入的微小、精心选择的扰动（例如图像中的单个像素更改）很容易受攻击。在这项工作中，我们探讨了ML-based EDA工具的健壮性问题--尤其是对拥塞预测。据我们所知，我们是第一个在ML-based EDA背景下探索这个概念的团队。我们首先描述了一个针对VLSI布局问题特别设计的不可察觉性概念，该问题定义在元件列表和单元放置上。我们的不可察觉性定义的特点是保证布局的扰动不会改变其",
    "tldr": "本研究研究了基于机器学习的EDA工具中的健壮性问题，提出了针对VLSI布局的新颖不可察觉性概念。",
    "en_tdlr": "This study investigates the robustness issue in ML-based EDA tools and introduces a novel imperceptibility concept for VLSI layout."
}