{
    "title": "Asset management with an ESG mandate",
    "abstract": "arXiv:2403.11622v1 Announce Type: new  Abstract: We investigate the portfolio frontier and risk premia in equilibrium when an institutional investor aims to minimize the tracking error variance and to attain an ESG score higher than the benchmark's one (ESG mandate). Provided that a negative ESG premium for stocks is priced by the market, we show that an ESG mandate can reduce the mean-variance inefficiency of the portfolio frontier when the asset manager targets a limited over-performance with respect to the benchmark. Instead, for a high over-performance target, an ESG mandate leads to a higher variance. The mean-variance improvement is due to the fact that the ESG mandate induces the asset manager to over-invest in assets with a high mean-standard deviation ratio. In equilibrium, with asset managers and mean-variance investors, a negative ESG premium arises if the ESG mandate is binding for asset managers. A result that is borne out by the data.",
    "link": "https://arxiv.org/abs/2403.11622",
    "context": "Title: Asset management with an ESG mandate\nAbstract: arXiv:2403.11622v1 Announce Type: new  Abstract: We investigate the portfolio frontier and risk premia in equilibrium when an institutional investor aims to minimize the tracking error variance and to attain an ESG score higher than the benchmark's one (ESG mandate). Provided that a negative ESG premium for stocks is priced by the market, we show that an ESG mandate can reduce the mean-variance inefficiency of the portfolio frontier when the asset manager targets a limited over-performance with respect to the benchmark. Instead, for a high over-performance target, an ESG mandate leads to a higher variance. The mean-variance improvement is due to the fact that the ESG mandate induces the asset manager to over-invest in assets with a high mean-standard deviation ratio. In equilibrium, with asset managers and mean-variance investors, a negative ESG premium arises if the ESG mandate is binding for asset managers. A result that is borne out by the data.",
    "path": "papers/24/03/2403.11622.json",
    "total_tokens": 871,
    "translated_title": "具有ESG指导原则的资产管理",
    "translated_abstract": "我们研究了当一个机构投资者旨在最小化跟踪误差方差，并实现高于基准ESG分数（ESG指导原则）时的均衡下的投资组合边界和风险溢价。我们表明，如果市场为股票定价了负的ESG溢价，那么当资产管理者以有限的超越基准的绩效为目标时，ESG指导原则可以减少投资组合边界的均值-方差效率不足。而对于高超越目标，ESG指导原则导致更高的方差。均值-方差的改善是因为ESG指导原则促使资产管理者过度投资于具有高均值-标准差比率的资产。在均衡状态下，当资产管理者和均值-方差投资者存在时，如果ESG指导原则对资产管理者具有约束力，将出现负的ESG溢价。这一结果得到了数据支撑。",
    "tldr": "ESG指导原则可以在降低投资组合边界的不足的同时导致更高的风险方差，根据数据显示，负的ESG溢价是当ESG指导原则对资产管理者有约束力时产生的。",
    "en_tdlr": "An ESG mandate can reduce the mean-variance inefficiency of the portfolio frontier while leading to higher risk variance, supported by data showing negative ESG premium when the ESG mandate is binding for asset managers."
}