{
    "title": "AI for Biomedicine in the Era of Large Language Models",
    "abstract": "arXiv:2403.15673v1 Announce Type: new  Abstract: The capabilities of AI for biomedicine span a wide spectrum, from the atomic level, where it solves partial differential equations for quantum systems, to the molecular level, predicting chemical or protein structures, and further extending to societal predictions like infectious disease outbreaks. Recent advancements in large language models, exemplified by models like ChatGPT, have showcased significant prowess in natural language tasks, such as translating languages, constructing chatbots, and answering questions. When we consider biomedical data, we observe a resemblance to natural language in terms of sequences: biomedical literature and health records presented as text, biological sequences or sequencing data arranged in sequences, or sensor data like brain signals as time series. The question arises: Can we harness the potential of recent large language models to drive biomedical knowledge discoveries? In this survey, we will expl",
    "link": "https://arxiv.org/abs/2403.15673",
    "context": "Title: AI for Biomedicine in the Era of Large Language Models\nAbstract: arXiv:2403.15673v1 Announce Type: new  Abstract: The capabilities of AI for biomedicine span a wide spectrum, from the atomic level, where it solves partial differential equations for quantum systems, to the molecular level, predicting chemical or protein structures, and further extending to societal predictions like infectious disease outbreaks. Recent advancements in large language models, exemplified by models like ChatGPT, have showcased significant prowess in natural language tasks, such as translating languages, constructing chatbots, and answering questions. When we consider biomedical data, we observe a resemblance to natural language in terms of sequences: biomedical literature and health records presented as text, biological sequences or sequencing data arranged in sequences, or sensor data like brain signals as time series. The question arises: Can we harness the potential of recent large language models to drive biomedical knowledge discoveries? In this survey, we will expl",
    "path": "papers/24/03/2403.15673.json",
    "total_tokens": 816,
    "translated_title": "大型语言模型时代的生物医学人工智能",
    "translated_abstract": "生物医学人工智能的能力涵盖了广泛的领域，从解决量子系统的偏微分方程，到预测化学或蛋白质结构的分子水平，进一步延伸到预测传染病爆发等社会预测。最近大型语言模型的进步，如ChatGPT模型，展示了在自然语言任务方面的显著实力，比如翻译语言，构建聊天机器人以及回答问题。当考虑生物医学数据时，我们观察到与自然语言类似的序列性: 生物医学文献和健康记录呈现为文本，生物序列或测序数据以序列方式排列，或者传感器数据如脑信号则呈现为时间序列。一个问题出现了: 我们是否能利用最近大型语言模型的潜力来推动生物医学知识的发现? 在这项调查中，我们将探讨",
    "tldr": "大型语言模型在生物医学领域展现出巨大潜力，能用于推动生物医学知识的发现和应用"
}