{
    "title": "Gene Regulatory Network Inference in the Presence of Dropouts: a Causal View",
    "abstract": "arXiv:2403.15500v1 Announce Type: cross  Abstract: Gene regulatory network inference (GRNI) is a challenging problem, particularly owing to the presence of zeros in single-cell RNA sequencing data: some are biological zeros representing no gene expression, while some others are technical zeros arising from the sequencing procedure (aka dropouts), which may bias GRNI by distorting the joint distribution of the measured gene expressions. Existing approaches typically handle dropout error via imputation, which may introduce spurious relations as the true joint distribution is generally unidentifiable. To tackle this issue, we introduce a causal graphical model to characterize the dropout mechanism, namely, Causal Dropout Model. We provide a simple yet effective theoretical result: interestingly, the conditional independence (CI) relations in the data with dropouts, after deleting the samples with zero values (regardless if technical or not) for the conditioned variables, are asymptoticall",
    "link": "https://arxiv.org/abs/2403.15500",
    "context": "Title: Gene Regulatory Network Inference in the Presence of Dropouts: a Causal View\nAbstract: arXiv:2403.15500v1 Announce Type: cross  Abstract: Gene regulatory network inference (GRNI) is a challenging problem, particularly owing to the presence of zeros in single-cell RNA sequencing data: some are biological zeros representing no gene expression, while some others are technical zeros arising from the sequencing procedure (aka dropouts), which may bias GRNI by distorting the joint distribution of the measured gene expressions. Existing approaches typically handle dropout error via imputation, which may introduce spurious relations as the true joint distribution is generally unidentifiable. To tackle this issue, we introduce a causal graphical model to characterize the dropout mechanism, namely, Causal Dropout Model. We provide a simple yet effective theoretical result: interestingly, the conditional independence (CI) relations in the data with dropouts, after deleting the samples with zero values (regardless if technical or not) for the conditioned variables, are asymptoticall",
    "path": "papers/24/03/2403.15500.json",
    "total_tokens": 728,
    "translated_title": "在缺失值存在的情况下进行基因调控网络推断：一个因果视图",
    "translated_abstract": "基因调控网络推断（GRNI）是一个具有挑战性的问题，尤其是由于单细胞RNA测序数据中存在零值：一些是代表没有基因表达的生物零值，而其他一些是由于测序过程（也称为丢失值）导致的技术性零值，这可能通过扭曲测定基因表达的联合分布而偏倚GRNI。现有方法通常通过插补处理丢失值，这可能会引入伪关系，因为真实的联合分布通常无法识别。为了解决这个问题，我们引入了一个因果图模型来表征丢失机制，即因果丢失模型。",
    "tldr": "引入了因果丢失模型来解决基因调控网络推断中因丢失值引起的偏倚问题。",
    "en_tdlr": "Introduced a causal dropout model to address the bias issue in gene regulatory network inference caused by missing values."
}