{
    "title": "Big City Bias: Evaluating the Impact of Metropolitan Size on Computational Job Market Abilities of Language Models",
    "abstract": "arXiv:2403.08046v1 Announce Type: new  Abstract: Large language models (LLMs) have emerged as a useful technology for job matching, for both candidates and employers. Job matching is often based on a particular geographic location, such as a city or region. However, LLMs have known biases, commonly derived from their training data. In this work, we aim to quantify the metropolitan size bias encoded within large language models, evaluating zero-shot salary, employer presence, and commute duration predictions in 384 of the United States' metropolitan regions. Across all benchmarks, we observe negative correlations between the metropolitan size and the performance of the LLMS, indicating that smaller regions are indeed underrepresented. More concretely, the smallest 10 metropolitan regions show upwards of 300% worse benchmark performance than the largest 10.",
    "link": "https://arxiv.org/abs/2403.08046",
    "context": "Title: Big City Bias: Evaluating the Impact of Metropolitan Size on Computational Job Market Abilities of Language Models\nAbstract: arXiv:2403.08046v1 Announce Type: new  Abstract: Large language models (LLMs) have emerged as a useful technology for job matching, for both candidates and employers. Job matching is often based on a particular geographic location, such as a city or region. However, LLMs have known biases, commonly derived from their training data. In this work, we aim to quantify the metropolitan size bias encoded within large language models, evaluating zero-shot salary, employer presence, and commute duration predictions in 384 of the United States' metropolitan regions. Across all benchmarks, we observe negative correlations between the metropolitan size and the performance of the LLMS, indicating that smaller regions are indeed underrepresented. More concretely, the smallest 10 metropolitan regions show upwards of 300% worse benchmark performance than the largest 10.",
    "path": "papers/24/03/2403.08046.json",
    "total_tokens": 794,
    "translated_title": "大城市偏见：评估都市规模对语言模型计算工作市场能力的影响",
    "translated_abstract": "大型语言模型（LLMs）已经成为求职匹配的一项有用技术，对求职者和雇主都有帮助。求职匹配通常基于特定地理位置，比如城市或地区。然而，LLMs具有已知偏见，通常源自它们的训练数据。在这项工作中，我们旨在量化大型语言模型中编码的都市规模偏见，评估美国384个都市地区的零射击薪水、雇主存在和通勤时间预测。在所有基准测试中，我们观察到都市规模与LLMs性能之间存在负相关，表明较小地区的确受到低估。更具体地说，最小的10个都市地区的基准测试性能要比最大的10个都市地区低300%以上。",
    "tldr": "该研究评估了大型语言模型对美国384个都市地区的工作市场能力，发现都市规模越小，模型的表现越差。",
    "en_tdlr": "This study evaluates the job market abilities of large language models in 384 metropolitan regions of the United States, finding that the smaller the metropolitan size, the worse the model performs."
}