{
    "title": "Language-Based Depth Hints for Monocular Depth Estimation",
    "abstract": "arXiv:2403.15551v1 Announce Type: cross  Abstract: Monocular depth estimation (MDE) is inherently ambiguous, as a given image may result from many different 3D scenes and vice versa. To resolve this ambiguity, an MDE system must make assumptions about the most likely 3D scenes for a given input. These assumptions can be either explicit or implicit. In this work, we demonstrate the use of natural language as a source of an explicit prior about the structure of the world. The assumption is made that human language encodes the likely distribution in depth-space of various objects. We first show that a language model encodes this implicit bias during training, and that it can be extracted using a very simple learned approach. We then show that this prediction can be provided as an explicit source of assumption to an MDE system, using an off-the-shelf instance segmentation model that provides the labels used as the input to the language model. We demonstrate the performance of our method on",
    "link": "https://arxiv.org/abs/2403.15551",
    "context": "Title: Language-Based Depth Hints for Monocular Depth Estimation\nAbstract: arXiv:2403.15551v1 Announce Type: cross  Abstract: Monocular depth estimation (MDE) is inherently ambiguous, as a given image may result from many different 3D scenes and vice versa. To resolve this ambiguity, an MDE system must make assumptions about the most likely 3D scenes for a given input. These assumptions can be either explicit or implicit. In this work, we demonstrate the use of natural language as a source of an explicit prior about the structure of the world. The assumption is made that human language encodes the likely distribution in depth-space of various objects. We first show that a language model encodes this implicit bias during training, and that it can be extracted using a very simple learned approach. We then show that this prediction can be provided as an explicit source of assumption to an MDE system, using an off-the-shelf instance segmentation model that provides the labels used as the input to the language model. We demonstrate the performance of our method on",
    "path": "papers/24/03/2403.15551.json",
    "total_tokens": 873,
    "translated_title": "基于语言的单目深度估计深度提示",
    "translated_abstract": "单目深度估计(MDE)在本质上是模糊的，因为给定的图像可能来源于许多不同的3D场景，反之亦然。为了解决这种模糊性，一个MDE系统必须对给定输入的最可能的3D场景作出假设。这些假设可以是显式的，也可以是隐式的。在这项工作中，我们展示了自然语言作为世界结构的显式先验的用法。假设人类语言对各种物体在深度空间中的可能分布进行编码。我们首先展示了语言模型在训练期间编码了这种隐式偏见，并且可以使用非常简单的学习方法进行提取。然后我们展示了这种预测可以作为假设的显式来源提供给MDE系统，使用一个提供标签作为语言模型输入的现成实例分割模型。我们展示了我们的方法的性能。",
    "tldr": "通过使用自然语言作为进行单目深度估计的显式先验，本研究展示了如何使用简单的学习方法来提取语言模型对世界结构的偏见，并将其作为假设的显式来源输入到MDE系统中。",
    "en_tdlr": "By using natural language as an explicit prior for monocular depth estimation, this study demonstrates how to extract biases of language models on world structures through simple learning methods and provide them as explicit sources of assumption input to MDE systems."
}