{
    "title": "SalienTime: User-driven Selection of Salient Time Steps for Large-Scale Geospatial Data Visualization",
    "abstract": "arXiv:2403.03449v1 Announce Type: cross  Abstract: The voluminous nature of geospatial temporal data from physical monitors and simulation models poses challenges to efficient data access, often resulting in cumbersome temporal selection experiences in web-based data portals. Thus, selecting a subset of time steps for prioritized visualization and pre-loading is highly desirable. Addressing this issue, this paper establishes a multifaceted definition of salient time steps via extensive need-finding studies with domain experts to understand their workflows. Building on this, we propose a novel approach that leverages autoencoders and dynamic programming to facilitate user-driven temporal selections. Structural features, statistical variations, and distance penalties are incorporated to make more flexible selections. User-specified priorities, spatial regions, and aggregations are used to combine different perspectives. We design and implement a web-based interface to enable efficient an",
    "link": "https://arxiv.org/abs/2403.03449",
    "context": "Title: SalienTime: User-driven Selection of Salient Time Steps for Large-Scale Geospatial Data Visualization\nAbstract: arXiv:2403.03449v1 Announce Type: cross  Abstract: The voluminous nature of geospatial temporal data from physical monitors and simulation models poses challenges to efficient data access, often resulting in cumbersome temporal selection experiences in web-based data portals. Thus, selecting a subset of time steps for prioritized visualization and pre-loading is highly desirable. Addressing this issue, this paper establishes a multifaceted definition of salient time steps via extensive need-finding studies with domain experts to understand their workflows. Building on this, we propose a novel approach that leverages autoencoders and dynamic programming to facilitate user-driven temporal selections. Structural features, statistical variations, and distance penalties are incorporated to make more flexible selections. User-specified priorities, spatial regions, and aggregations are used to combine different perspectives. We design and implement a web-based interface to enable efficient an",
    "path": "papers/24/03/2403.03449.json",
    "total_tokens": 846,
    "translated_title": "SalienTime: 用户驱动的大规模地理空间数据可视化中显著时间步长的选择",
    "translated_abstract": "地理空间临时数据的庞大性来自物理监视器和仿真模型，给有效数据访问带来挑战，通常导致网络数据门户中繁琐的时间选择体验。因此，选择一个时间步骤子集以进行优先可视化和预加载是非常可取的。本文通过与领域专家进行广泛的需求研究，建立了对显著时间步骤的多方面定义，以了解他们的工作流程。在此基础上，我们提出了一种利用自动编码器和动态规划来促进用户驱动时间选择的新方法。结构特征，统计变化和距离惩罚被纳入以进行更灵活的选择。用户指定的优先级，空间区域和聚合被用来结合不同的视角。我们设计并实施了一个基于网络的接口，以实现高效",
    "tldr": "通过需要研究，建立了对显著时间步骤的定义，提出了一种利用自动编码器和动态规划的新方法来促进用户驱动的时间选择，结合结构特征和统计变化以实现更灵活的选择",
    "en_tdlr": "A novel method utilizing autoencoders and dynamic programming was proposed for user-driven selection of salient time steps, incorporating structural features and statistical variations for more flexible selections."
}