{
    "title": "Beyond Surface Similarity: Detecting Subtle Semantic Shifts in Financial Narratives",
    "abstract": "arXiv:2403.14341v1 Announce Type: new  Abstract: In this paper, we introduce the Financial-STS task, a financial domain-specific NLP task designed to measure the nuanced semantic similarity between pairs of financial narratives. These narratives originate from the financial statements of the same company but correspond to different periods, such as year-over-year comparisons. Measuring the subtle semantic differences between these paired narratives enables market stakeholders to gauge changes over time in the company's financial and operational situations, which is critical for financial decision-making. We find that existing pretrained embedding models and LLM embeddings fall short in discerning these subtle financial narrative shifts. To address this gap, we propose an LLM-augmented pipeline specifically designed for the Financial-STS task. Evaluation on a human-annotated dataset demonstrates that our proposed method outperforms existing methods trained on classic STS tasks and gener",
    "link": "https://arxiv.org/abs/2403.14341",
    "context": "Title: Beyond Surface Similarity: Detecting Subtle Semantic Shifts in Financial Narratives\nAbstract: arXiv:2403.14341v1 Announce Type: new  Abstract: In this paper, we introduce the Financial-STS task, a financial domain-specific NLP task designed to measure the nuanced semantic similarity between pairs of financial narratives. These narratives originate from the financial statements of the same company but correspond to different periods, such as year-over-year comparisons. Measuring the subtle semantic differences between these paired narratives enables market stakeholders to gauge changes over time in the company's financial and operational situations, which is critical for financial decision-making. We find that existing pretrained embedding models and LLM embeddings fall short in discerning these subtle financial narrative shifts. To address this gap, we propose an LLM-augmented pipeline specifically designed for the Financial-STS task. Evaluation on a human-annotated dataset demonstrates that our proposed method outperforms existing methods trained on classic STS tasks and gener",
    "path": "papers/24/03/2403.14341.json",
    "total_tokens": 854,
    "translated_title": "超越表面相似性：检测金融叙述中微妙的语义转变",
    "translated_abstract": "在本文中，我们介绍了Financial-STS任务，这是一个金融领域特定的自然语言处理任务，旨在衡量金融叙述对之间微妙的语义相似性。这些叙述来自同一公司的财务报表，但对应不同时期，例如年度比较。衡量这些配对叙述之间微妙的语义差异使得市场利益相关者能够评估公司财务和运营情况随时间的变化，这对于金融决策至关重要。我们发现现有的预训练嵌入模型和LLM嵌入在识别这些微妙的金融叙述转变方面表现不足。为填补这一空白，我们提出了一个专门针对Financial-STS任务设计的LLM增强型流程。对一个人工注释的数据集的评估表明，我们提出的方法优于现有在经典STS任务和gen任务上训练的方法",
    "tldr": "本文介绍了Financial-STS任务，旨在衡量金融叙述对之间微妙的语义相似性，提出了一种LLM增强型流程，以优于现有方法的性能。",
    "en_tdlr": "This paper introduces the Financial-STS task to measure nuanced semantic similarity between financial narratives, and proposes an LLM-augmented pipeline to outperform existing methods."
}