{
    "title": "Scalable Continuous-time Diffusion Framework for Network Inference and Influence Estimation",
    "abstract": "arXiv:2403.02867v1 Announce Type: cross  Abstract: The study of continuous-time information diffusion has been an important area of research for many applications in recent years. When only the diffusion traces (cascades) are accessible, cascade-based network inference and influence estimation are two essential problems to explore. Alas, existing methods exhibit limited capability to infer and process networks with more than a few thousand nodes, suffering from scalability issues. In this paper, we view the diffusion process as a continuous-time dynamical system, based on which we establish a continuous-time diffusion model. Subsequently, we instantiate the model to a scalable and effective framework (FIM) to approximate the diffusion propagation from available cascades, thereby inferring the underlying network structure. Furthermore, we undertake an analysis of the approximation error of FIM for network inference. To achieve the desired scalability for influence estimation, we devise ",
    "link": "https://arxiv.org/abs/2403.02867",
    "context": "Title: Scalable Continuous-time Diffusion Framework for Network Inference and Influence Estimation\nAbstract: arXiv:2403.02867v1 Announce Type: cross  Abstract: The study of continuous-time information diffusion has been an important area of research for many applications in recent years. When only the diffusion traces (cascades) are accessible, cascade-based network inference and influence estimation are two essential problems to explore. Alas, existing methods exhibit limited capability to infer and process networks with more than a few thousand nodes, suffering from scalability issues. In this paper, we view the diffusion process as a continuous-time dynamical system, based on which we establish a continuous-time diffusion model. Subsequently, we instantiate the model to a scalable and effective framework (FIM) to approximate the diffusion propagation from available cascades, thereby inferring the underlying network structure. Furthermore, we undertake an analysis of the approximation error of FIM for network inference. To achieve the desired scalability for influence estimation, we devise ",
    "path": "papers/24/03/2403.02867.json",
    "total_tokens": 848,
    "translated_title": "可扩展的连续时间扩散框架用于网络推断和影响估计",
    "translated_abstract": "最近几年，连续时间信息传播的研究已成为许多应用领域的重要研究领域。当只能访问传播跟踪（级联）时，基于级联的网络推断和影响估计是两个必须探讨的重要问题。然而，现有方法在推断和处理超过几千个节点的网络时表现出有限的能力，存在可扩展性问题。本文将扩散过程视为连续时间动力系统，基于此建立了一个连续时间扩散模型。随后，我们将该模型实例化为一个可扩展且有效的框架（FIM），以近似从可用级联中推断出基础网络结构的扩散传播。此外，我们对FIM在网络推断中的近似误差进行了分析。为了实现影响估计的所需可扩展性，我们设计了...",
    "tldr": "将扩散过程视为连续时间动力系统，建立了可扩展且有效的框架以近似从级联中推断出基础网络结构，解决了网络推断和影响估计中存在的可扩展性问题"
}