{
    "title": "Reinforced Sequential Decision-Making for Sepsis Treatment: The POSNEGDM Framework with Mortality Classifier and Transformer",
    "abstract": "arXiv:2403.07309v1 Announce Type: cross  Abstract: Sepsis, a life-threatening condition triggered by the body's exaggerated response to infection, demands urgent intervention to prevent severe complications. Existing machine learning methods for managing sepsis struggle in offline scenarios, exhibiting suboptimal performance with survival rates below 50%. This paper introduces the POSNEGDM -- ``Reinforcement Learning with Positive and Negative Demonstrations for Sequential Decision-Making\" framework utilizing an innovative transformer-based model and a feedback reinforcer to replicate expert actions while considering individual patient characteristics. A mortality classifier with 96.7\\% accuracy guides treatment decisions towards positive outcomes. The POSNEGDM framework significantly improves patient survival, saving 97.39% of patients, outperforming established machine learning algorithms (Decision Transformer and Behavioral Cloning) with survival rates of 33.4% and 43.5%, respective",
    "link": "https://arxiv.org/abs/2403.07309",
    "context": "Title: Reinforced Sequential Decision-Making for Sepsis Treatment: The POSNEGDM Framework with Mortality Classifier and Transformer\nAbstract: arXiv:2403.07309v1 Announce Type: cross  Abstract: Sepsis, a life-threatening condition triggered by the body's exaggerated response to infection, demands urgent intervention to prevent severe complications. Existing machine learning methods for managing sepsis struggle in offline scenarios, exhibiting suboptimal performance with survival rates below 50%. This paper introduces the POSNEGDM -- ``Reinforcement Learning with Positive and Negative Demonstrations for Sequential Decision-Making\" framework utilizing an innovative transformer-based model and a feedback reinforcer to replicate expert actions while considering individual patient characteristics. A mortality classifier with 96.7\\% accuracy guides treatment decisions towards positive outcomes. The POSNEGDM framework significantly improves patient survival, saving 97.39% of patients, outperforming established machine learning algorithms (Decision Transformer and Behavioral Cloning) with survival rates of 33.4% and 43.5%, respective",
    "path": "papers/24/03/2403.07309.json",
    "total_tokens": 930,
    "translated_title": "针对败血症治疗的强化序贯决策：具有死亡分类器和变压器的POSNEGDM框架",
    "translated_abstract": "败血症是由机体对感染产生夸张反应引发的一种危及生命的情况，要求紧急干预以防止严重并发症。现有的用于处理败血症的机器学习方法在离线场景中效果不佳，存活率低于50％。本文介绍了POSNEGDM框架，即“用于序贯决策的具有正负示范的强化学习”，利用创新的基于变压器的模型和反馈强化器复制专家行为，同时考虑个体患者特征。具有96.7％准确度的死亡分类器指导治疗决策取得积极结果。POSNEGDM框架显著提高了患者的生存率，挽救了97.39％的患者，优于现有的机器学习算法（决策变压器和行为克隆）的存活率分别为33.4％和43.5％。",
    "tldr": "该研究提出了POSNEGDM框架，利用变压器模型和反馈强化器，在败血症治疗中取得显著改进，将患者生存率提高至97.39％，明显优于传统算法。",
    "en_tdlr": "This paper introduces the POSNEGDM framework, utilizing a transformer-based model and a feedback reinforcer to significantly improve patient survival in sepsis treatment, achieving a survival rate of 97.39%, outperforming established algorithms."
}