{
    "title": "MORBDD: Multiobjective Restricted Binary Decision Diagrams by Learning to Sparsify",
    "abstract": "arXiv:2403.02482v1 Announce Type: new  Abstract: In multicriteria decision-making, a user seeks a set of non-dominated solutions to a (constrained) multiobjective optimization problem, the so-called Pareto frontier. In this work, we seek to bring a state-of-the-art method for exact multiobjective integer linear programming into the heuristic realm. We focus on binary decision diagrams (BDDs) which first construct a graph that represents all feasible solutions to the problem and then traverse the graph to extract the Pareto frontier. Because the Pareto frontier may be exponentially large, enumerating it over the BDD can be time-consuming. We explore how restricted BDDs, which have already been shown to be effective as heuristics for single-objective problems, can be adapted to multiobjective optimization through the use of machine learning (ML). MORBDD, our ML-based BDD sparsifier, first trains a binary classifier to eliminate BDD nodes that are unlikely to contribute to Pareto solution",
    "link": "https://arxiv.org/abs/2403.02482",
    "context": "Title: MORBDD: Multiobjective Restricted Binary Decision Diagrams by Learning to Sparsify\nAbstract: arXiv:2403.02482v1 Announce Type: new  Abstract: In multicriteria decision-making, a user seeks a set of non-dominated solutions to a (constrained) multiobjective optimization problem, the so-called Pareto frontier. In this work, we seek to bring a state-of-the-art method for exact multiobjective integer linear programming into the heuristic realm. We focus on binary decision diagrams (BDDs) which first construct a graph that represents all feasible solutions to the problem and then traverse the graph to extract the Pareto frontier. Because the Pareto frontier may be exponentially large, enumerating it over the BDD can be time-consuming. We explore how restricted BDDs, which have already been shown to be effective as heuristics for single-objective problems, can be adapted to multiobjective optimization through the use of machine learning (ML). MORBDD, our ML-based BDD sparsifier, first trains a binary classifier to eliminate BDD nodes that are unlikely to contribute to Pareto solution",
    "path": "papers/24/03/2403.02482.json",
    "total_tokens": 853,
    "translated_title": "MORBDD：通过学习稀疏化实现的多目标约束二进制决策图",
    "translated_abstract": "在多标准决策中，用户寻求约束多目标优化问题的非支配解集，即所谓的帕累托前沿。本文旨在将一种精确的多目标整数线性规划方法引入到启发式领域。我们着眼于二进制决策图（BDDs），首先构建一个代表问题所有可行解的图形，然后遍历该图以提取帕累托前沿。由于帕累托前沿可能呈指数增长，BDD上的枚举可能耗时。我们探讨了如何通过机器学习（ML）将已被证明对单目标问题有效的受限BDDs调整为多目标优化。我们的基于ML的BDD稀疏化器MORBDD首先训练一个二元分类器，以消除不太可能贡献于帕累托解的BDD节点。",
    "tldr": "本文提出了一种基于机器学习的BDD稀疏化器MORBDD，通过训练二元分类器来消除不太可能贡献于帕累托解的BDD节点。",
    "en_tdlr": "This paper introduces MORBDD, a machine learning-based BDD sparsifier that eliminates BDD nodes unlikely to contribute to Pareto solutions by training a binary classifier."
}