{
    "title": "VISREAS: Complex Visual Reasoning with Unanswerable Questions",
    "abstract": "arXiv:2403.10534v1 Announce Type: cross  Abstract: Verifying a question's validity before answering is crucial in real-world applications, where users may provide imperfect instructions. In this scenario, an ideal model should address the discrepancies in the query and convey them to the users rather than generating the best possible answer. Addressing this requirement, we introduce a new compositional visual question-answering dataset, VISREAS, that consists of answerable and unanswerable visual queries formulated by traversing and perturbing commonalities and differences among objects, attributes, and relations. VISREAS contains 2.07M semantically diverse queries generated automatically using Visual Genome scene graphs. The unique feature of this task, validating question answerability with respect to an image before answering, and the poor performance of state-of-the-art models inspired the design of a new modular baseline, LOGIC2VISION that reasons by producing and executing pseudo",
    "link": "https://arxiv.org/abs/2403.10534",
    "context": "Title: VISREAS: Complex Visual Reasoning with Unanswerable Questions\nAbstract: arXiv:2403.10534v1 Announce Type: cross  Abstract: Verifying a question's validity before answering is crucial in real-world applications, where users may provide imperfect instructions. In this scenario, an ideal model should address the discrepancies in the query and convey them to the users rather than generating the best possible answer. Addressing this requirement, we introduce a new compositional visual question-answering dataset, VISREAS, that consists of answerable and unanswerable visual queries formulated by traversing and perturbing commonalities and differences among objects, attributes, and relations. VISREAS contains 2.07M semantically diverse queries generated automatically using Visual Genome scene graphs. The unique feature of this task, validating question answerability with respect to an image before answering, and the poor performance of state-of-the-art models inspired the design of a new modular baseline, LOGIC2VISION that reasons by producing and executing pseudo",
    "path": "papers/24/03/2403.10534.json",
    "total_tokens": 659,
    "translated_title": "VISREAS: 复杂视觉推理与无法回答的问题",
    "translated_abstract": "在现实世界的应用中，验证问题的有效性在回答之前至关重要，因为用户可能提供不完美的指示。为了解决这一需求，我们引入了一个新的组合视觉问答数据集VISREAS，其中包含了通过遍历和扰动对象、属性和关系的共同点和差异而构成的可回答和无法回答的视觉查询。",
    "tldr": "提出了新的组合视觉问答数据集VISREAS，通过验证问题在回答之前的有效性，解决了用户提供不完美指示的挑战",
    "en_tdlr": "Introduced a new compositional visual question-answering dataset VISREAS to address the challenge of verifying question validity before answering due to imperfect user instructions."
}