{
    "title": "Improving Matrix Completion by Exploiting Rating Ordinality in Graph Neural Networks",
    "abstract": "arXiv:2403.04504v1 Announce Type: new  Abstract: Matrix completion is an important area of research in recommender systems. Recent methods view a rating matrix as a user-item bi-partite graph with labeled edges denoting observed ratings and predict the edges between the user and item nodes by using the graph neural network (GNN). Despite their effectiveness, they treat each rating type as an independent relation type and thus cannot sufficiently consider the ordinal nature of the ratings. In this paper, we explore a new approach to exploit rating ordinality for GNN, which has not been studied well in the literature. We introduce a new method, called ROGMC, to leverage Rating Ordinality in GNN-based Matrix Completion. It uses cumulative preference propagation to directly incorporate rating ordinality in GNN's message passing, allowing for users' stronger preferences to be more emphasized based on inherent orders of rating types. This process is complemented by interest regularization wh",
    "link": "https://arxiv.org/abs/2403.04504",
    "context": "Title: Improving Matrix Completion by Exploiting Rating Ordinality in Graph Neural Networks\nAbstract: arXiv:2403.04504v1 Announce Type: new  Abstract: Matrix completion is an important area of research in recommender systems. Recent methods view a rating matrix as a user-item bi-partite graph with labeled edges denoting observed ratings and predict the edges between the user and item nodes by using the graph neural network (GNN). Despite their effectiveness, they treat each rating type as an independent relation type and thus cannot sufficiently consider the ordinal nature of the ratings. In this paper, we explore a new approach to exploit rating ordinality for GNN, which has not been studied well in the literature. We introduce a new method, called ROGMC, to leverage Rating Ordinality in GNN-based Matrix Completion. It uses cumulative preference propagation to directly incorporate rating ordinality in GNN's message passing, allowing for users' stronger preferences to be more emphasized based on inherent orders of rating types. This process is complemented by interest regularization wh",
    "path": "papers/24/03/2403.04504.json",
    "total_tokens": 877,
    "translated_title": "通过利用图神经网络中的评分序数改进矩阵完成",
    "translated_abstract": "矩阵完成是推荐系统研究中的一个重要领域。最近的方法将评分矩阵视为一个用户-项目二部图，其中标记的边表示观察到的评分，并使用图神经网络（GNN）预测用户和项目节点之间的边。尽管这些方法有效，但它们将每种评分类型视为独立的关系类型，因此无法充分考虑评分的序数性质。在本文中，我们探讨了一种新方法，用于利用GNN中的评分序数，这在文献中尚未得到很好的研究。我们引入了一种称为ROGMC的新方法，通过Rating Ordinality在基于GNN的矩阵完成中进行利用。它使用累积偏好传播直接在GNN的消息传递中合并评分序数，从而允许根据评分类型的内在顺序更强调用户的更强偏好。这一过程通过兴趣正则化得到补充",
    "tldr": "本文提出了一种新方法ROGMC，通过累积偏好传播直接在GNN的消息传递中合并评分序数，从而更强调用户更强的偏好，并在矩阵完成中取得改进。",
    "en_tdlr": "This paper introduces a new method ROGMC, which directly incorporates rating ordinality in GNN's message passing using cumulative preference propagation to emphasize users' stronger preferences, achieving improvements in matrix completion."
}