{
    "title": "Semantic-Enhanced Representation Learning for Road Networks with Temporal Dynamics",
    "abstract": "arXiv:2403.11495v1 Announce Type: cross  Abstract: In this study, we introduce a novel framework called Toast for learning general-purpose representations of road networks, along with its advanced counterpart DyToast, designed to enhance the integration of temporal dynamics to boost the performance of various time-sensitive downstream tasks. Specifically, we propose to encode two pivotal semantic characteristics intrinsic to road networks: traffic patterns and traveling semantics. To achieve this, we refine the skip-gram module by incorporating auxiliary objectives aimed at predicting the traffic context associated with a target road segment. Moreover, we leverage trajectory data and design pre-training strategies based on Transformer to distill traveling semantics on road networks. DyToast further augments this framework by employing unified trigonometric functions characterized by their beneficial properties, enabling the capture of temporal evolution and dynamic nature of road netwo",
    "link": "https://arxiv.org/abs/2403.11495",
    "context": "Title: Semantic-Enhanced Representation Learning for Road Networks with Temporal Dynamics\nAbstract: arXiv:2403.11495v1 Announce Type: cross  Abstract: In this study, we introduce a novel framework called Toast for learning general-purpose representations of road networks, along with its advanced counterpart DyToast, designed to enhance the integration of temporal dynamics to boost the performance of various time-sensitive downstream tasks. Specifically, we propose to encode two pivotal semantic characteristics intrinsic to road networks: traffic patterns and traveling semantics. To achieve this, we refine the skip-gram module by incorporating auxiliary objectives aimed at predicting the traffic context associated with a target road segment. Moreover, we leverage trajectory data and design pre-training strategies based on Transformer to distill traveling semantics on road networks. DyToast further augments this framework by employing unified trigonometric functions characterized by their beneficial properties, enabling the capture of temporal evolution and dynamic nature of road netwo",
    "path": "papers/24/03/2403.11495.json",
    "total_tokens": 799,
    "translated_title": "具有时间动态的路网语义增强表示学习",
    "translated_abstract": "在这项研究中，我们引入了一个名为Toast的新颖框架，用于学习路网的通用表示，以及其增强版DyToast，旨在增强时间动态的整合，提高各种时间敏感下游任务的性能。具体来说，我们提出编码路网固有的两个关键语义特征：交通模式和行驶语义。为实现此目的，我们通过纳入旨在预测与目标路段相关的交通上下文的辅助目标，改进了skip-gram模块。此外，我们利用轨迹数据，并设计基于Transformer的预训练策略，以在路网上提炼行驶语义。DyToast通过使用具有益处特性的统一三角函数进一步增进了该框架，使其能够捕获路网的时间演变和动态性质。",
    "tldr": "提出了一种名为Toast的新框架，以及增强版DyToast，用于学习路网的通用表示，并增强了时间动态的整合，以提高各种时间敏感下游任务的性能。"
}