{
    "title": "MindArm: Mechanized Intelligent Non-Invasive Neuro-Driven Prosthetic Arm System",
    "abstract": "arXiv:2403.19992v1 Announce Type: new  Abstract: Currently, people with disability or difficulty to move their arms (referred to as \"patients\") have very limited technological solutions to efficiently address their physiological limitations. It is mainly due to two reasons: (1) the non-invasive solutions like mind-controlled prosthetic devices are typically very costly and require expensive maintenance; and (2) other solutions require costly invasive brain surgery, which is high risk to perform, expensive, and difficult to maintain. Therefore, current technological solutions are not accessible for all patients with different financial backgrounds. Toward this, we propose a low-cost technological solution called MindArm, a mechanized intelligent non-invasive neuro-driven prosthetic arm system. Our MindArm system employs a deep neural network (DNN) engine to translate brain signals into the intended prosthetic arm motion, thereby helping patients to perform many activities despite their ",
    "link": "https://arxiv.org/abs/2403.19992",
    "context": "Title: MindArm: Mechanized Intelligent Non-Invasive Neuro-Driven Prosthetic Arm System\nAbstract: arXiv:2403.19992v1 Announce Type: new  Abstract: Currently, people with disability or difficulty to move their arms (referred to as \"patients\") have very limited technological solutions to efficiently address their physiological limitations. It is mainly due to two reasons: (1) the non-invasive solutions like mind-controlled prosthetic devices are typically very costly and require expensive maintenance; and (2) other solutions require costly invasive brain surgery, which is high risk to perform, expensive, and difficult to maintain. Therefore, current technological solutions are not accessible for all patients with different financial backgrounds. Toward this, we propose a low-cost technological solution called MindArm, a mechanized intelligent non-invasive neuro-driven prosthetic arm system. Our MindArm system employs a deep neural network (DNN) engine to translate brain signals into the intended prosthetic arm motion, thereby helping patients to perform many activities despite their ",
    "path": "papers/24/03/2403.19992.json",
    "total_tokens": 878,
    "translated_title": "MindArm: 机械智能非侵入式神经驱动假肢系统",
    "translated_abstract": "目前，残疾或难以移动手臂的人（简称“患者”）在有效解决生理限制方面有非常有限的技术解决方案。这主要是由于两个原因：一是像以思维控制为主的假肢设备通常非常昂贵并需要昂贵的维护；二是其他解决方案需要昂贵的侵入性脑部手术，这种手术风险高，昂贵且维护困难。因此，当前的技术解决方案并不适用于具有不同财务背景的所有患者。为此，我们提出了一种低成本技术解决方案，名为MindArm，即一种机械智能非侵入式神经驱动假肢系统。我们的MindArm系统采用深度神经网络（DNN）引擎将大脑信号翻译成预期的假肢运动，从而帮助患者实施许多活动，尽管他们",
    "tldr": "提出了一种低成本技术解决方案MindArm，利用深度神经网络将大脑信号翻译成假肢运动，帮助患者执行各种活动",
    "en_tdlr": "Proposed a low-cost technological solution called MindArm that translates brain signals into prosthetic arm motion using a deep neural network to help patients perform various activities."
}