{
    "title": "Leap: molecular synthesisability scoring with intermediates",
    "abstract": "arXiv:2403.13005v1 Announce Type: cross  Abstract: Assessing whether a molecule can be synthesised is a primary task in drug discovery. It enables computational chemists to filter for viable compounds or bias molecular generative models. The notion of synthesisability is dynamic as it evolves depending on the availability of key compounds. A common approach in drug discovery involves exploring the chemical space surrounding synthetically-accessible intermediates. This strategy improves the synthesisability of the derived molecules due to the availability of key intermediates. Existing synthesisability scoring methods such as SAScore, SCScore and RAScore, cannot condition on intermediates dynamically. Our approach, Leap, is a GPT-2 model trained on the depth, or longest linear path, of predicted synthesis routes that allows information on the availability of key intermediates to be included at inference time. We show that Leap surpasses all other scoring methods by at least 5% on AUC sc",
    "link": "https://arxiv.org/abs/2403.13005",
    "context": "Title: Leap: molecular synthesisability scoring with intermediates\nAbstract: arXiv:2403.13005v1 Announce Type: cross  Abstract: Assessing whether a molecule can be synthesised is a primary task in drug discovery. It enables computational chemists to filter for viable compounds or bias molecular generative models. The notion of synthesisability is dynamic as it evolves depending on the availability of key compounds. A common approach in drug discovery involves exploring the chemical space surrounding synthetically-accessible intermediates. This strategy improves the synthesisability of the derived molecules due to the availability of key intermediates. Existing synthesisability scoring methods such as SAScore, SCScore and RAScore, cannot condition on intermediates dynamically. Our approach, Leap, is a GPT-2 model trained on the depth, or longest linear path, of predicted synthesis routes that allows information on the availability of key intermediates to be included at inference time. We show that Leap surpasses all other scoring methods by at least 5% on AUC sc",
    "path": "papers/24/03/2403.13005.json",
    "total_tokens": 834,
    "translated_title": "Leap: 中间体的分子合成评分",
    "translated_abstract": "评估分子是否可以合成是药物发现中的首要任务。它使计算化学家能够过滤可行化合物或偏向分子生成模型。合成性的概念是动态的，因为它会随着关键化合物的可用性而演变。药物发现中的一种常见方法涉及探索可合成中间体周围的化学空间。这一策略改善了由于关键中间体的可用性而导致的衍生分子的合成能力。现有的合成可达性评分方法，如SAScore、SCScore和RAScore，无法动态地根据中间体进行条件评分。我们的方法Leap是一个在预测的合成路线深度（或最长线性路径）上训练的GPT-2模型，允许在推断时包含关键中间体的可用性信息。我们展示了Leap在AUC sc上至少比所有其他评分方法高出5%。",
    "tldr": "Leap是一个使用GPT-2模型训练的方法，根据预测的合成路线深度，动态地包含了关键中间体的可用性信息，在合成可达性评分上表现优异。",
    "en_tdlr": "Leap is a method trained using the GPT-2 model that dynamically incorporates the availability information of key intermediates based on the predicted synthesis route depth, outperforming other scoring methods in synthesis accessibility."
}