{
    "title": "MS-Net: A Multi-Path Sparse Model for Motion Prediction in Multi-Scenes",
    "abstract": "arXiv:2403.00353v1 Announce Type: cross  Abstract: The multi-modality and stochastic characteristics of human behavior make motion prediction a highly challenging task, which is critical for autonomous driving. While deep learning approaches have demonstrated their great potential in this area, it still remains unsolved to establish a connection between multiple driving scenes (e.g., merging, roundabout, intersection) and the design of deep learning models. Current learning-based methods typically use one unified model to predict trajectories in different scenarios, which may result in sub-optimal results for one individual scene. To address this issue, we propose Multi-Scenes Network (aka. MS-Net), which is a multi-path sparse model trained by an evolutionary process. MS-Net selectively activates a subset of its parameters during the inference stage to produce prediction results for each scene. In the training stage, the motion prediction task under differentiated scenes is abstracted",
    "link": "https://arxiv.org/abs/2403.00353",
    "context": "Title: MS-Net: A Multi-Path Sparse Model for Motion Prediction in Multi-Scenes\nAbstract: arXiv:2403.00353v1 Announce Type: cross  Abstract: The multi-modality and stochastic characteristics of human behavior make motion prediction a highly challenging task, which is critical for autonomous driving. While deep learning approaches have demonstrated their great potential in this area, it still remains unsolved to establish a connection between multiple driving scenes (e.g., merging, roundabout, intersection) and the design of deep learning models. Current learning-based methods typically use one unified model to predict trajectories in different scenarios, which may result in sub-optimal results for one individual scene. To address this issue, we propose Multi-Scenes Network (aka. MS-Net), which is a multi-path sparse model trained by an evolutionary process. MS-Net selectively activates a subset of its parameters during the inference stage to produce prediction results for each scene. In the training stage, the motion prediction task under differentiated scenes is abstracted",
    "path": "papers/24/03/2403.00353.json",
    "total_tokens": 809,
    "translated_title": "MS-Net：多路径稀疏模型用于多场景中的运动预测",
    "translated_abstract": "人类行为的多模态性和随机特征使得运动预测成为一项极具挑战性的任务，这对于自动驾驶至关重要。尽管深度学习方法在这一领域展现了巨大潜力，但如何建立多个行驶场景（如合并、环岛、十字路口）与深度学习模型设计之间的联系仍未解决。为解决这一问题，我们提出了Multi-Scenes Network（简称MS-Net），这是一个通过进化过程训练的多路径稀疏模型。MS-Net在推断阶段选择性地激活其参数子集，以产生每个场景的预测结果。在训练阶段，将不同场景下的运动预测任务抽象化。",
    "tldr": "MS-Net是一个多路径稀疏模型，通过进化过程进行训练，针对不同场景选择性激活其参数子集进行预测。这种方法解决了多场景下运动预测问题的挑战。",
    "en_tdlr": "MS-Net is a multi-path sparse model trained by an evolutionary process, which selectively activates a subset of its parameters for prediction in different scenes, addressing the challenge of motion prediction in multi-scenes."
}