{
    "title": "Persona Extraction Through Semantic Similarity for Emotional Support Conversation Generation",
    "abstract": "arXiv:2403.04212v1 Announce Type: new  Abstract: Providing emotional support through dialogue systems is becoming increasingly important in today's world, as it can support both mental health and social interactions in many conversation scenarios. Previous works have shown that using persona is effective for generating empathetic and supportive responses. They have often relied on pre-provided persona rather than inferring them during conversations. However, it is not always possible to obtain a user persona before the conversation begins. To address this challenge, we propose PESS (Persona Extraction through Semantic Similarity), a novel framework that can automatically infer informative and consistent persona from dialogues. We devise completeness loss and consistency loss based on semantic similarity scores. The completeness loss encourages the model to generate missing persona information, and the consistency loss guides the model to distinguish between consistent and inconsistent ",
    "link": "https://arxiv.org/abs/2403.04212",
    "context": "Title: Persona Extraction Through Semantic Similarity for Emotional Support Conversation Generation\nAbstract: arXiv:2403.04212v1 Announce Type: new  Abstract: Providing emotional support through dialogue systems is becoming increasingly important in today's world, as it can support both mental health and social interactions in many conversation scenarios. Previous works have shown that using persona is effective for generating empathetic and supportive responses. They have often relied on pre-provided persona rather than inferring them during conversations. However, it is not always possible to obtain a user persona before the conversation begins. To address this challenge, we propose PESS (Persona Extraction through Semantic Similarity), a novel framework that can automatically infer informative and consistent persona from dialogues. We devise completeness loss and consistency loss based on semantic similarity scores. The completeness loss encourages the model to generate missing persona information, and the consistency loss guides the model to distinguish between consistent and inconsistent ",
    "path": "papers/24/03/2403.04212.json",
    "total_tokens": 763,
    "translated_title": "通过语义相似性进行人设提取以用于情感支持对话生成",
    "translated_abstract": "通过对话系统提供情感支持在今天的世界中变得越来越重要，因为它可以支持许多对话场景中的心理健康和社交互动。过去的研究表明，使用人设对生成共情和支持性回复是有效的。然而，他们通常依赖预先提供的人设而不是在对话过程中推断它们。为了解决这一挑战，我们提出了一种新框架 PESS（通过语义相似性进行人设提取），它可以从对话中自动推断信息丰富且一致的人设。我们设计了基于语义相似性分数的完整性损失和一致性损失。完整性损失鼓励模型生成缺失的人设信息，一致性损失指导模型区分一致和不一致的情况。",
    "tldr": "提出了一种新框架 PESS，通过语义相似性自动推断对话中的人设信息，以支持情感对话生成。",
    "en_tdlr": "Proposed a new framework PESS that automatically infers persona information from dialogues through semantic similarity to support emotional conversation generation."
}