{
    "title": "Team Formation amidst Conflicts",
    "abstract": "arXiv:2403.00859v1 Announce Type: new  Abstract: In this work, we formulate the problem of team formation amidst conflicts. The goal is to assign individuals to tasks, with given capacities, taking into account individuals' task preferences and the conflicts between them. Using dependent rounding schemes as our main toolbox, we provide efficient approximation algorithms. Our framework is extremely versatile and can model many different real-world scenarios as they arise in educational settings and human-resource management. We test and deploy our algorithms on real-world datasets and we show that our algorithms find assignments that are better than those found by natural baselines. In the educational setting we also show how our assignments are far better than those done manually by human experts. In the human resource management application we show how our assignments increase the diversity of teams. Finally, using a synthetic dataset we demonstrate that our algorithms scale very well",
    "link": "https://arxiv.org/abs/2403.00859",
    "context": "Title: Team Formation amidst Conflicts\nAbstract: arXiv:2403.00859v1 Announce Type: new  Abstract: In this work, we formulate the problem of team formation amidst conflicts. The goal is to assign individuals to tasks, with given capacities, taking into account individuals' task preferences and the conflicts between them. Using dependent rounding schemes as our main toolbox, we provide efficient approximation algorithms. Our framework is extremely versatile and can model many different real-world scenarios as they arise in educational settings and human-resource management. We test and deploy our algorithms on real-world datasets and we show that our algorithms find assignments that are better than those found by natural baselines. In the educational setting we also show how our assignments are far better than those done manually by human experts. In the human resource management application we show how our assignments increase the diversity of teams. Finally, using a synthetic dataset we demonstrate that our algorithms scale very well",
    "path": "papers/24/03/2403.00859.json",
    "total_tokens": 821,
    "translated_title": "团队在冲突中的形成",
    "translated_abstract": "在这项工作中，我们提出了团队在冲突中形成的问题。我们的目标是分配个体到任务，考虑到个体的任务偏好和他们之间的冲突。利用依赖舍入方案作为我们的主要工具箱，我们提供了高效的近似算法。我们的框架非常灵活，可以模拟许多不同的现实场景，如教育环境和人力资源管理。我们在真实数据集上测试和部署我们的算法，并展示我们的算法找到的分配比自然基线找到的更好。在教育环境中，我们还展示了我们的分配比人类专家手动完成的分配更好。在人力资源管理应用中，我们展示了我们的分配如何增加团队的多样性。最后，使用合成数据集，我们展示了我们的算法扩展得非常好。",
    "tldr": "本文提出了团队在冲突中形成的问题，并提供了高效的近似算法，能够模拟不同的现实场景，在教育环境和人力资源管理中表现出色，特别是通过在真实数据集上的测试和部署，展示了算法的优越性。",
    "en_tdlr": "This paper addresses the problem of team formation amidst conflicts, offering efficient approximation algorithms that can model various real-world scenarios, with demonstrated effectiveness in educational settings and human resource management through testing on real-world datasets."
}