{
    "title": "Robust Graph Structure Learning under Heterophily",
    "abstract": "arXiv:2403.03659v1 Announce Type: new  Abstract: Graph is a fundamental mathematical structure in characterizing relations between different objects and has been widely used on various learning tasks. Most methods implicitly assume a given graph to be accurate and complete. However, real data is inevitably noisy and sparse, which will lead to inferior results. Despite the remarkable success of recent graph representation learning methods, they inherently presume that the graph is homophilic, and largely overlook heterophily, where most connected nodes are from different classes. In this regard, we propose a novel robust graph structure learning method to achieve a high-quality graph from heterophilic data for downstream tasks. We first apply a high-pass filter to make each node more distinctive from its neighbors by encoding structure information into the node features. Then, we learn a robust graph with an adaptive norm characterizing different levels of noise. Afterwards, we propose ",
    "link": "https://arxiv.org/abs/2403.03659",
    "context": "Title: Robust Graph Structure Learning under Heterophily\nAbstract: arXiv:2403.03659v1 Announce Type: new  Abstract: Graph is a fundamental mathematical structure in characterizing relations between different objects and has been widely used on various learning tasks. Most methods implicitly assume a given graph to be accurate and complete. However, real data is inevitably noisy and sparse, which will lead to inferior results. Despite the remarkable success of recent graph representation learning methods, they inherently presume that the graph is homophilic, and largely overlook heterophily, where most connected nodes are from different classes. In this regard, we propose a novel robust graph structure learning method to achieve a high-quality graph from heterophilic data for downstream tasks. We first apply a high-pass filter to make each node more distinctive from its neighbors by encoding structure information into the node features. Then, we learn a robust graph with an adaptive norm characterizing different levels of noise. Afterwards, we propose ",
    "path": "papers/24/03/2403.03659.json",
    "total_tokens": 827,
    "translated_title": "在异质环境下的稳健图结构学习",
    "translated_abstract": "图是一种基本的数学结构，用于描述不同对象之间的关系，在各种学习任务中被广泛应用。大多数方法隐式地假设给定的图是准确和完整的。然而，真实数据不可避免地是嘈杂和稀疏的，这将导致较差的结果。尽管最近的图表示学习方法取得了显著的成功，但它们本质上假设图是同质的，并且很大程度上忽略了异质性，即大多数连接节点来自不同的类别。在这方面，我们提出了一种新颖的稳健图结构学习方法，从异质数据中获得高质量的图以用于下游任务。我们首先应用一个高通滤波器，通过将结构信息编码到节点特征中，使每个节点与其邻居更具有区别性。然后，我们学习一个具有自适应范数的稳健图，用于描述不同噪声水平。随后，我们提出",
    "tldr": "提出了一种稳健图结构学习方法，能够从异质数据中获得高质量图，以用于下游任务",
    "en_tdlr": "Proposed a robust graph structure learning method that can obtain a high-quality graph from heterophilic data for downstream tasks."
}