{
    "title": "Conformal Intent Classification and Clarification for Fast and Accurate Intent Recognition",
    "abstract": "arXiv:2403.18973v1 Announce Type: new  Abstract: We present Conformal Intent Classification and Clarification (CICC), a framework for fast and accurate intent classification for task-oriented dialogue systems. The framework turns heuristic uncertainty scores of any intent classifier into a clarification question that is guaranteed to contain the true intent at a pre-defined confidence level. By disambiguating between a small number of likely intents, the user query can be resolved quickly and accurately. Additionally, we propose to augment the framework for out-of-scope detection. In a comparative evaluation using seven intent recognition datasets we find that CICC generates small clarification questions and is capable of out-of-scope detection. CICC can help practitioners and researchers substantially in improving the user experience of dialogue agents with specific clarification questions.",
    "link": "https://arxiv.org/abs/2403.18973",
    "context": "Title: Conformal Intent Classification and Clarification for Fast and Accurate Intent Recognition\nAbstract: arXiv:2403.18973v1 Announce Type: new  Abstract: We present Conformal Intent Classification and Clarification (CICC), a framework for fast and accurate intent classification for task-oriented dialogue systems. The framework turns heuristic uncertainty scores of any intent classifier into a clarification question that is guaranteed to contain the true intent at a pre-defined confidence level. By disambiguating between a small number of likely intents, the user query can be resolved quickly and accurately. Additionally, we propose to augment the framework for out-of-scope detection. In a comparative evaluation using seven intent recognition datasets we find that CICC generates small clarification questions and is capable of out-of-scope detection. CICC can help practitioners and researchers substantially in improving the user experience of dialogue agents with specific clarification questions.",
    "path": "papers/24/03/2403.18973.json",
    "total_tokens": 806,
    "translated_title": "一种用于快速准确意图识别的拟合意图分类和澄清框架",
    "translated_abstract": "我们提出了一种名为拟合意图分类和澄清（CICC）的框架，用于针对任务导向对话系统的快速准确意图分类。该框架将任何意图分类器的启发式不确定性分数转化为一个澄清问题，该问题被保证包含真正意图并且在预定义的置信水平上。通过区分少量可能的意图，用户查询可以快速准确地解决。此外，我们提议扩展该框架以进行超出范围的检测。通过使用七个意图识别数据集进行比较评估，我们发现CICC生成了小型澄清问题并且具有超出范围检测的能力。CICC可以帮助从业者和研究人员大幅改善对话代理的用户体验，通过特定的澄清问题。",
    "tldr": "提出了一种拟合意图分类和澄清框架，能够将意图分类器的不确定性分数转化为澄清问题，快速准确地解决用户查询，并具有超出范围检测能力。",
    "en_tdlr": "Introduced a framework for conformal intent classification and clarification that transforms uncertainty scores of intent classifiers into clarification questions, quickly and accurately resolving user queries, and possessing out-of-scope detection capability."
}