{
    "title": "A Concept-based Interpretable Model for the Diagnosis of Choroid Neoplasias using Multimodal Data",
    "abstract": "arXiv:2403.05606v1 Announce Type: cross  Abstract: Diagnosing rare diseases presents a common challenge in clinical practice, necessitating the expertise of specialists for accurate identification. The advent of machine learning offers a promising solution, while the development of such technologies is hindered by the scarcity of data on rare conditions and the demand for models that are both interpretable and trustworthy in a clinical context. Interpretable AI, with its capacity for human-readable outputs, can facilitate validation by clinicians and contribute to medical education. In the current work, we focus on choroid neoplasias, the most prevalent form of eye cancer in adults, albeit rare with 5.1 per million. We built the so-far largest dataset consisting of 750 patients, incorporating three distinct imaging modalities collected from 2004 to 2022. Our work introduces a concept-based interpretable model that distinguishes between three types of choroidal tumors, integrating insig",
    "link": "https://arxiv.org/abs/2403.05606",
    "context": "Title: A Concept-based Interpretable Model for the Diagnosis of Choroid Neoplasias using Multimodal Data\nAbstract: arXiv:2403.05606v1 Announce Type: cross  Abstract: Diagnosing rare diseases presents a common challenge in clinical practice, necessitating the expertise of specialists for accurate identification. The advent of machine learning offers a promising solution, while the development of such technologies is hindered by the scarcity of data on rare conditions and the demand for models that are both interpretable and trustworthy in a clinical context. Interpretable AI, with its capacity for human-readable outputs, can facilitate validation by clinicians and contribute to medical education. In the current work, we focus on choroid neoplasias, the most prevalent form of eye cancer in adults, albeit rare with 5.1 per million. We built the so-far largest dataset consisting of 750 patients, incorporating three distinct imaging modalities collected from 2004 to 2022. Our work introduces a concept-based interpretable model that distinguishes between three types of choroidal tumors, integrating insig",
    "path": "papers/24/03/2403.05606.json",
    "total_tokens": 971,
    "translated_title": "基于概念的可解释模型用于利用多模态数据诊断脉络膜肿瘤",
    "translated_abstract": "诊断罕见疾病在临床实践中面临着共同挑战，需要专家的专业知识才能准确识别。机器学习的出现提供了一种有希望的解决方案，然而这类技术的发展受到罕见状况的数据稀缺和在临床环境中需要具有可解释性和可信赖性的模型的需求的阻碍。可解释的人工智能，具有人类可读输出的能力，可以促进临床医生的验证并促进医学教育。在当前工作中，我们专注于脉络膜肿瘤，这是成人中最常见的眼睛癌症形式，尽管罕见，罹患率为每百万人5.1例。我们建立了迄今为止最大的数据集，共包括750名患者，涵盖了从2004年至2022年收集的三种不同成像模态。我们的工作引入了一个基于概念的可解释模型，可区分三种类型的脉络膜肿瘤，融合了一些不太重要的",
    "tldr": "提出了一种基于概念的可解释模型，用于利用多模态数据诊断脉络膜肿瘤，促进了对罕见疾病的诊断，并在临床实践和医学教育中具有重要意义",
    "en_tdlr": "Introduced a concept-based interpretable model for diagnosing choroid neoplasias using multimodal data, facilitating diagnosis of rare diseases and holding significance in clinical practice and medical education."
}