{
    "title": "A Measure for Transparent Comparison of Linguistic Diversity in Multilingual NLP Data Sets",
    "abstract": "arXiv:2403.03909v1 Announce Type: new  Abstract: Typologically diverse benchmarks are increasingly created to track the progress achieved in multilingual NLP. Linguistic diversity of these data sets is typically measured as the number of languages or language families included in the sample, but such measures do not consider structural properties of the included languages. In this paper, we propose assessing linguistic diversity of a data set against a reference language sample as a means of maximising linguistic diversity in the long run. We represent languages as sets of features and apply a version of the Jaccard index suitable for comparing sets of measures. In addition to the features extracted from typological data bases, we propose an automatic text-based measure, which can be used as a means of overcoming the well-known problem of data sparsity in manually collected features. Our diversity score is interpretable in terms of linguistic features and can identify the types of lang",
    "link": "https://arxiv.org/abs/2403.03909",
    "context": "Title: A Measure for Transparent Comparison of Linguistic Diversity in Multilingual NLP Data Sets\nAbstract: arXiv:2403.03909v1 Announce Type: new  Abstract: Typologically diverse benchmarks are increasingly created to track the progress achieved in multilingual NLP. Linguistic diversity of these data sets is typically measured as the number of languages or language families included in the sample, but such measures do not consider structural properties of the included languages. In this paper, we propose assessing linguistic diversity of a data set against a reference language sample as a means of maximising linguistic diversity in the long run. We represent languages as sets of features and apply a version of the Jaccard index suitable for comparing sets of measures. In addition to the features extracted from typological data bases, we propose an automatic text-based measure, which can be used as a means of overcoming the well-known problem of data sparsity in manually collected features. Our diversity score is interpretable in terms of linguistic features and can identify the types of lang",
    "path": "papers/24/03/2403.03909.json",
    "total_tokens": 859,
    "translated_title": "用于透明比较多语言自然语言处理数据集语言多样性的度量方法",
    "translated_abstract": "类型学多样化的基准越来越多地被创建来追踪多语言自然语言处理中取得的进展。这些数据集的语言多样性通常被测量为样本中包含的语言或语言家族的数量，但这些度量并未考虑所包含语言的结构特性。在本文中，我们提出将数据集的语言多样性与参考语言样本进行评估，作为最大程度地促进长期内的语言多样性的一种方式。我们将语言表示为特征集，并应用适用于比较度量集合的Jaccard指数的版本。除了从类型学数据库中提取的特征之外，我们还提出一种自动的基于文本的度量方法，可以作为克服手动收集特征中已知的数据稀疏问题的手段。我们的多样性评分在语言特征方面是可解释的，并且可以识别语言类型",
    "tldr": "本文提出了一种评估数据集语言多样性的方法，通过与参考语言样本进行对比，利用适合比较度量集合的Jaccard指数的版本来最大程度地促进长期内的多语言多样性。"
}