{
    "title": "ActiveAD: Planning-Oriented Active Learning for End-to-End Autonomous Driving",
    "abstract": "arXiv:2403.02877v1 Announce Type: cross  Abstract: End-to-end differentiable learning for autonomous driving (AD) has recently become a prominent paradigm. One main bottleneck lies in its voracious appetite for high-quality labeled data e.g. 3D bounding boxes and semantic segmentation, which are notoriously expensive to manually annotate. The difficulty is further pronounced due to the prominent fact that the behaviors within samples in AD often suffer from long tailed distribution. In other words, a large part of collected data can be trivial (e.g. simply driving forward in a straight road) and only a few cases are safety-critical. In this paper, we explore a practically important yet under-explored problem about how to achieve sample and label efficiency for end-to-end AD. Specifically, we design a planning-oriented active learning method which progressively annotates part of collected raw data according to the proposed diversity and usefulness criteria for planning routes. Empirical",
    "link": "https://arxiv.org/abs/2403.02877",
    "context": "Title: ActiveAD: Planning-Oriented Active Learning for End-to-End Autonomous Driving\nAbstract: arXiv:2403.02877v1 Announce Type: cross  Abstract: End-to-end differentiable learning for autonomous driving (AD) has recently become a prominent paradigm. One main bottleneck lies in its voracious appetite for high-quality labeled data e.g. 3D bounding boxes and semantic segmentation, which are notoriously expensive to manually annotate. The difficulty is further pronounced due to the prominent fact that the behaviors within samples in AD often suffer from long tailed distribution. In other words, a large part of collected data can be trivial (e.g. simply driving forward in a straight road) and only a few cases are safety-critical. In this paper, we explore a practically important yet under-explored problem about how to achieve sample and label efficiency for end-to-end AD. Specifically, we design a planning-oriented active learning method which progressively annotates part of collected raw data according to the proposed diversity and usefulness criteria for planning routes. Empirical",
    "path": "papers/24/03/2403.02877.json",
    "total_tokens": 849,
    "translated_title": "ActiveAD: 面向规划的端到端自动驾驶主动学习",
    "translated_abstract": "最近，端到端可微学习成为自动驾驶 (AD) 的一个突出范例。其中一个主要瓶颈在于其对高质量标记数据的渴望，例如 3D 边界框和语义分割，这些数据的手动注释费用极高。困难之处进一步体现在 AD 样本内部行为往往受长尾分布的影响。换句话说，采集到的数据中大部分可能是微不足道的（例如在笔直道路上简单行驶），而只有少数情况是安全关键的。本文探讨了一个实际重要但尚未深入研究的问题，即如何实现端到端 AD 的样本和标记效率。具体来说，我们设计了一种面向规划的主动学习方法，根据所提出的多样性和有用性标准逐步对采集的原始数据进行注释，以规划路线。",
    "tldr": "设计了一种面向规划的主动学习方法，通过多样性和有用性标准逐步注释采集的原始数据，以实现端到端自动驾驶的样本和标记效率。",
    "en_tdlr": "Proposed a planning-oriented active learning method that progressively annotates collected raw data based on diversity and usefulness criteria to achieve sample and label efficiency for end-to-end autonomous driving."
}