{
    "title": "Neural Field Classifiers via Target Encoding and Classification Loss",
    "abstract": "arXiv:2403.01058v1 Announce Type: cross  Abstract: Neural field methods have seen great progress in various long-standing tasks in computer vision and computer graphics, including novel view synthesis and geometry reconstruction. As existing neural field methods try to predict some coordinate-based continuous target values, such as RGB for Neural Radiance Field (NeRF), all of these methods are regression models and are optimized by some regression loss. However, are regression models really better than classification models for neural field methods? In this work, we try to visit this very fundamental but overlooked question for neural fields from a machine learning perspective. We successfully propose a novel Neural Field Classifier (NFC) framework which formulates existing neural field methods as classification tasks rather than regression tasks. The proposed NFC can easily transform arbitrary Neural Field Regressor (NFR) into its classification variant via employing a novel Target En",
    "link": "https://arxiv.org/abs/2403.01058",
    "context": "Title: Neural Field Classifiers via Target Encoding and Classification Loss\nAbstract: arXiv:2403.01058v1 Announce Type: cross  Abstract: Neural field methods have seen great progress in various long-standing tasks in computer vision and computer graphics, including novel view synthesis and geometry reconstruction. As existing neural field methods try to predict some coordinate-based continuous target values, such as RGB for Neural Radiance Field (NeRF), all of these methods are regression models and are optimized by some regression loss. However, are regression models really better than classification models for neural field methods? In this work, we try to visit this very fundamental but overlooked question for neural fields from a machine learning perspective. We successfully propose a novel Neural Field Classifier (NFC) framework which formulates existing neural field methods as classification tasks rather than regression tasks. The proposed NFC can easily transform arbitrary Neural Field Regressor (NFR) into its classification variant via employing a novel Target En",
    "path": "papers/24/03/2403.01058.json",
    "total_tokens": 842,
    "translated_title": "通过目标编码和分类损失的神经场分类器",
    "translated_abstract": "神经场方法在计算机视觉和计算机图形学中的各种长期任务中取得了巨大进展，包括新视图合成和几何重建。然而，现有神经场方法尝试预测一些基于坐标的连续目标值，如神经辐射场（NeRF）的RGB，所有这些方法都是回归模型，并通过一些回归损失进行优化。本文中，我们尝试从机器学习的视角讨论这个非常基本但被忽视的问题：对于神经场方法来说，回归模型真的比分类模型更好吗？我们成功地提出了一个新颖的神经场分类器（NFC）框架，将现有的神经场方法规定为分类任务而不是回归任务。所提出的NFC可以通过采用新颖的目标编码方法将任意神经场回归器（NFR）轻松转换为其分类变体。",
    "tldr": "本文提出了一个新颖的神经场分类器（NFC）框架，将现有的神经场方法规定为分类任务而不是回归任务，从而探讨了神经场方法中回归模型和分类模型的优劣。",
    "en_tdlr": "This paper introduces a novel Neural Field Classifier (NFC) framework that formulates existing neural field methods as classification tasks rather than regression tasks, exploring the pros and cons of regression models and classification models in neural field methods."
}