{
    "title": "FlowPrecision: Advancing FPGA-Based Real-Time Fluid Flow Estimation with Linear Quantization",
    "abstract": "arXiv:2403.01922v1 Announce Type: new  Abstract: In industrial and environmental monitoring, achieving real-time and precise fluid flow measurement remains a critical challenge. This study applies linear quantization in FPGA-based soft sensors for fluid flow estimation, significantly enhancing Neural Network model precision by overcoming the limitations of traditional fixed-point quantization. Our approach achieves up to a 10.10% reduction in Mean Squared Error and a notable 9.39% improvement in inference speed through targeted hardware optimizations. Validated across multiple data sets, our findings demonstrate that the optimized FPGA-based quantized models can provide efficient, accurate real-time inference, offering a viable alternative to cloud-based processing in pervasive autonomous systems.",
    "link": "https://arxiv.org/abs/2403.01922",
    "context": "Title: FlowPrecision: Advancing FPGA-Based Real-Time Fluid Flow Estimation with Linear Quantization\nAbstract: arXiv:2403.01922v1 Announce Type: new  Abstract: In industrial and environmental monitoring, achieving real-time and precise fluid flow measurement remains a critical challenge. This study applies linear quantization in FPGA-based soft sensors for fluid flow estimation, significantly enhancing Neural Network model precision by overcoming the limitations of traditional fixed-point quantization. Our approach achieves up to a 10.10% reduction in Mean Squared Error and a notable 9.39% improvement in inference speed through targeted hardware optimizations. Validated across multiple data sets, our findings demonstrate that the optimized FPGA-based quantized models can provide efficient, accurate real-time inference, offering a viable alternative to cloud-based processing in pervasive autonomous systems.",
    "path": "papers/24/03/2403.01922.json",
    "total_tokens": 802,
    "translated_title": "FlowPrecision: 利用线性量化推进基于FPGA的实时流体流量估计",
    "translated_abstract": "在工业和环境监测中，实现实时和精确的流体流量测量仍然是一个重要挑战。本研究将线性量化应用于基于FPGA的软传感器中，用于流体流量估计，通过克服传统定点量化的局限性，显著增强了神经网络模型的精度。我们的方法通过针对性的硬件优化，实现了均方误差的最多减少10.10％，推理速度显著提高了9.39％。经过多个数据集的验证，我们的研究结果表明，优化后的基于FPGA的量化模型可以提供高效、精确的实时推理，为普遍自主系统中的云处理提供了一种可行的替代方案。",
    "tldr": "本研究将线性量化应用于FPGA-based soft sensors中，显著提高了神经网络模型精度，通过硬件优化实现了降低均方误差和提升推理速度，为实时流体流量估计提供了高效、精确的替代方案",
    "en_tdlr": "By applying linear quantization in FPGA-based soft sensors, this study significantly enhances the precision of Neural Network models, reducing Mean Squared Error and improving inference speed through hardware optimizations, offering an efficient and accurate alternative for real-time fluid flow estimation."
}