{
    "title": "The 'Must Stock' Challenge in Academic Publishing: Pricing Implications of Transformative Agreements",
    "abstract": "arXiv:2403.03597v1 Announce Type: new  Abstract: The high relevance of top-notch academic journals turns them into 'must stock' products that assign its often commercial owners with extraordinary market power. Intended to tackle this, university consortia around the globe negotiate so-called 'transformative agreements' with many publishing houses. It shall pave the way towards standard open-access publishing. While several contract designs exist, the 'publish-and-read' (PAR) scheme is the one that comes closest to the ideal of an entirely open access environment: Publishers are paid a fixed case-by-case rate for each publication, which includes a fee for their extensive libraries. In turn, all subscription payments are waived. I theoretically derive that this contract design benefits the included publishers regardless of whether the number of publications in these publishers' journals grows or declines. Consequently, widespread PAR contracts are likely to raise entry barriers for new (",
    "link": "https://arxiv.org/abs/2403.03597",
    "context": "Title: The 'Must Stock' Challenge in Academic Publishing: Pricing Implications of Transformative Agreements\nAbstract: arXiv:2403.03597v1 Announce Type: new  Abstract: The high relevance of top-notch academic journals turns them into 'must stock' products that assign its often commercial owners with extraordinary market power. Intended to tackle this, university consortia around the globe negotiate so-called 'transformative agreements' with many publishing houses. It shall pave the way towards standard open-access publishing. While several contract designs exist, the 'publish-and-read' (PAR) scheme is the one that comes closest to the ideal of an entirely open access environment: Publishers are paid a fixed case-by-case rate for each publication, which includes a fee for their extensive libraries. In turn, all subscription payments are waived. I theoretically derive that this contract design benefits the included publishers regardless of whether the number of publications in these publishers' journals grows or declines. Consequently, widespread PAR contracts are likely to raise entry barriers for new (",
    "path": "papers/24/03/2403.03597.json",
    "total_tokens": 865,
    "translated_title": "学术出版中的“必备存货”挑战：转型协议的定价影响",
    "translated_abstract": "顶尖学术期刊的高度相关性使它们成为“必备存货”产品，赋予其通常是商业所有者的非凡市场力量。 为了解决这个问题，全球各地的大学联盟与许多出版社谈判所谓的“转型协议”。 这将为标准开放获取出版打开道路。 尽管存在几种合同设计，但“发布和阅读”（PAR）方案是最接近完全开放获取环境理想的方案：出版商会为每篇发表支付固定的按案例收费，其中包括对其丰富的图书馆收费。 反过来，所有订阅费用都将被免除。 我从理论上推导出，无论这些出版商的期刊中的发表数量增长还是下降，这种合同设计都有利于包括的出版商。 因此，广泛使用PAR合同很可能会提高新参与者的准入壁垒。",
    "tldr": "转型协议如“发布和阅读”方案将为期刊出版商带来好处，无论其期刊中的发表数量增长还是下降，可能会提高新参与者的准入壁垞。"
}