{
    "title": "Optimal Integrated Task and Path Planning and Its Application to Multi-Robot Pickup and Delivery",
    "abstract": "arXiv:2403.01277v1 Announce Type: cross  Abstract: We propose a generic multi-robot planning mechanism that combines an optimal task planner and an optimal path planner to provide a scalable solution for complex multi-robot planning problems. The Integrated planner, through the interaction of the task planner and the path planner, produces optimal collision-free trajectories for the robots. We illustrate our general algorithm on an object pick-and-drop planning problem in a warehouse scenario where a group of robots is entrusted with moving objects from one location to another in the workspace. We solve the task planning problem by reducing it into an SMT-solving problem and employing the highly advanced SMT solver Z3 to solve it. To generate collision-free movement of the robots, we extend the state-of-the-art algorithm Conflict Based Search with Precedence Constraints with several domain-specific constraints. We evaluate our integrated task and path planner extensively on various ins",
    "link": "https://arxiv.org/abs/2403.01277",
    "context": "Title: Optimal Integrated Task and Path Planning and Its Application to Multi-Robot Pickup and Delivery\nAbstract: arXiv:2403.01277v1 Announce Type: cross  Abstract: We propose a generic multi-robot planning mechanism that combines an optimal task planner and an optimal path planner to provide a scalable solution for complex multi-robot planning problems. The Integrated planner, through the interaction of the task planner and the path planner, produces optimal collision-free trajectories for the robots. We illustrate our general algorithm on an object pick-and-drop planning problem in a warehouse scenario where a group of robots is entrusted with moving objects from one location to another in the workspace. We solve the task planning problem by reducing it into an SMT-solving problem and employing the highly advanced SMT solver Z3 to solve it. To generate collision-free movement of the robots, we extend the state-of-the-art algorithm Conflict Based Search with Precedence Constraints with several domain-specific constraints. We evaluate our integrated task and path planner extensively on various ins",
    "path": "papers/24/03/2403.01277.json",
    "total_tokens": 848,
    "translated_title": "最优集成任务和路径规划及其在多机器人取送任务中的应用",
    "translated_abstract": "我们提出了一种通用的多机器人规划机制，结合了最优任务规划器和最优路径规划器，为复杂的多机器人规划问题提供可扩展的解决方案。集成规划器通过任务规划器和路径规划器的相互作用，为机器人产生最优的无碰撞轨迹。我们在一个仓库场景中的物体取放规划问题上展示了我们的通用算法，其中一组机器人负责将物体从一个位置移动到工作区的另一个位置。我们通过将任务规划问题简化为SMT求解问题，并利用高级SMT求解器 Z3 来解决它。为了生成机器人的无碰撞移动，我们使用具有多个特定领域约束的最先进算法 Conflict Based Search with Precedence Constraints。我们在各种情况下广泛评估了我们的集成任务和路径规划器。",
    "tldr": "提出一种结合了最优任务规划器和最优路径规划器的通用多机器人规划机制，通过相互作用生成最优无碰撞轨迹，在仓库场景中的物体取放问题中展示了其有效性。",
    "en_tdlr": "Introduce a generic multi-robot planning mechanism that combines optimal task planner and optimal path planner to generate optimal collision-free trajectories through interaction, demonstrated effectiveness in an object pick-and-drop scenario in a warehouse."
}