{
    "title": "SMOF: Streaming Modern CNNs on FPGAs with Smart Off-Chip Eviction",
    "abstract": "arXiv:2403.18921v1 Announce Type: cross  Abstract: Convolutional Neural Networks (CNNs) have demonstrated their effectiveness in numerous vision tasks. However, their high processing requirements necessitate efficient hardware acceleration to meet the application's performance targets. In the space of FPGAs, streaming-based dataflow architectures are often adopted by users, as significant performance gains can be achieved through layer-wise pipelining and reduced off-chip memory access by retaining data on-chip. However, modern topologies, such as the UNet, YOLO, and X3D models, utilise long skip connections, requiring significant on-chip storage and thus limiting the performance achieved by such system architectures. The paper addresses the above limitation by introducing weight and activation eviction mechanisms to off-chip memory along the computational pipeline, taking into account the available compute and memory resources. The proposed mechanism is incorporated into an existing t",
    "link": "https://arxiv.org/abs/2403.18921",
    "context": "Title: SMOF: Streaming Modern CNNs on FPGAs with Smart Off-Chip Eviction\nAbstract: arXiv:2403.18921v1 Announce Type: cross  Abstract: Convolutional Neural Networks (CNNs) have demonstrated their effectiveness in numerous vision tasks. However, their high processing requirements necessitate efficient hardware acceleration to meet the application's performance targets. In the space of FPGAs, streaming-based dataflow architectures are often adopted by users, as significant performance gains can be achieved through layer-wise pipelining and reduced off-chip memory access by retaining data on-chip. However, modern topologies, such as the UNet, YOLO, and X3D models, utilise long skip connections, requiring significant on-chip storage and thus limiting the performance achieved by such system architectures. The paper addresses the above limitation by introducing weight and activation eviction mechanisms to off-chip memory along the computational pipeline, taking into account the available compute and memory resources. The proposed mechanism is incorporated into an existing t",
    "path": "papers/24/03/2403.18921.json",
    "total_tokens": 834,
    "translated_title": "SMOF：在FPGA上使用智能离片驱逐流模式CNN",
    "translated_abstract": "卷积神经网络（CNNs）在众多视觉任务中展现出了其有效性。然而，它们高的处理要求需要有效的硬件加速以满足应用的性能目标。在FPGAs领域，用户通常采用基于流式数据流架构，通过分层流水线和在芯片上保留数据以降低离片内存访问来获得显著的性能增益。然而，现代拓扑结构，如UNet、YOLO和X3D模型，利用长跳跃连接，需要大量的芯片内存空间，从而限制了这种系统架构所达到的性能。本文通过在计算流程中沿着权重和激活驱逐机制至离片内存，考虑到可用的计算和内存资源，来解决上述限制。",
    "tldr": "本文介绍了一种在FPGA上使用智能离片驱逐流模式CNN的方法，通过引入权重和激活的驱逐机制来解决现代拓扑结构在芯片内存使用方面的性能限制。",
    "en_tdlr": "The paper presents an approach to streaming modern CNNs on FPGAs with smart off-chip eviction, addressing the performance limitations of modern topologies in on-chip memory usage by introducing mechanisms for weight and activation eviction."
}