{
    "title": "FaiMA: Feature-aware In-context Learning for Multi-domain Aspect-based Sentiment Analysis",
    "abstract": "arXiv:2403.01063v1 Announce Type: new  Abstract: Multi-domain aspect-based sentiment analysis (ABSA) seeks to capture fine-grained sentiment across diverse domains. While existing research narrowly focuses on single-domain applications constrained by methodological limitations and data scarcity, the reality is that sentiment naturally traverses multiple domains. Although large language models (LLMs) offer a promising solution for ABSA, it is difficult to integrate effectively with established techniques, including graph-based models and linguistics, because modifying their internal architecture is not easy. To alleviate this problem, we propose a novel framework, Feature-aware In-context Learning for Multi-domain ABSA (FaiMA). The core insight of FaiMA is to utilize in-context learning (ICL) as a feature-aware mechanism that facilitates adaptive learning in multi-domain ABSA tasks. Specifically, we employ a multi-head graph attention network as a text encoder optimized by heuristic rul",
    "link": "https://arxiv.org/abs/2403.01063",
    "context": "Title: FaiMA: Feature-aware In-context Learning for Multi-domain Aspect-based Sentiment Analysis\nAbstract: arXiv:2403.01063v1 Announce Type: new  Abstract: Multi-domain aspect-based sentiment analysis (ABSA) seeks to capture fine-grained sentiment across diverse domains. While existing research narrowly focuses on single-domain applications constrained by methodological limitations and data scarcity, the reality is that sentiment naturally traverses multiple domains. Although large language models (LLMs) offer a promising solution for ABSA, it is difficult to integrate effectively with established techniques, including graph-based models and linguistics, because modifying their internal architecture is not easy. To alleviate this problem, we propose a novel framework, Feature-aware In-context Learning for Multi-domain ABSA (FaiMA). The core insight of FaiMA is to utilize in-context learning (ICL) as a feature-aware mechanism that facilitates adaptive learning in multi-domain ABSA tasks. Specifically, we employ a multi-head graph attention network as a text encoder optimized by heuristic rul",
    "path": "papers/24/03/2403.01063.json",
    "total_tokens": 886,
    "translated_title": "FaiMA：针对多领域基于方面的情感分析的特征感知上下文学习",
    "translated_abstract": "多领域基于方面的情感分析（ABSA）旨在捕捉跨多样领域的细粒度情感。尽管现有研究受到方法限制和数据稀缺的限制，狭窄地关注单一领域的应用，但现实情感自然地跨越多个领域。虽然大型语言模型（LLMs）为ABSA提供了有希望的解决方案，但由于难以有效与已建立的技术（包括基于图的模型和语言学）集成，因为修改它们的内部架构并不容易。为了缓解这个问题，我们提出了一个新颖的框架，即针对多领域ABSA的特征感知上下文学习（FaiMA）。FaiMA的核心见解是利用上下文学习（ICL）作为一种特征感知机制，促进多领域ABSA任务中的自适应学习。具体来说，我们采用了一个多头图注意力网络作为一个文本编码器，通过启发式规则来优化。",
    "tldr": "FaiMA提出了一种新的框架，利用特征感知的上下文学习作为自适应学习机制，用于多领域基于方面的情感分析任务。",
    "en_tdlr": "FaiMA proposes a novel framework utilizing feature-aware in-context learning as an adaptive mechanism for multi-domain aspect-based sentiment analysis tasks."
}