{
    "title": "Quantum Support Vector Machine for Prostate Cancer Detection: A Performance Analysis",
    "abstract": "arXiv:2403.07856v1 Announce Type: new  Abstract: This study addresses the urgent need for improved prostate cancer detection methods by harnessing the power of advanced technological solutions. We introduce the application of Quantum Support Vector Machine (QSVM) to this critical healthcare challenge, showcasing an enhancement in diagnostic performance over the classical Support Vector Machine (SVM) approach. Our study not only outlines the remarkable improvements in diagnostic performance made by QSVM over the classic SVM technique, but it delves into the advancements brought about by the quantum feature map architecture, which has been carefully identified and evaluated, ensuring it aligns seamlessly with the unique characteristics of our prostate cancer dataset. This architecture succeded in creating a distinct feature space, enabling the detection of complex, non-linear patterns in the data. The findings reveal not only a comparable accuracy with classical SVM ($92\\%$) but also a $",
    "link": "https://arxiv.org/abs/2403.07856",
    "context": "Title: Quantum Support Vector Machine for Prostate Cancer Detection: A Performance Analysis\nAbstract: arXiv:2403.07856v1 Announce Type: new  Abstract: This study addresses the urgent need for improved prostate cancer detection methods by harnessing the power of advanced technological solutions. We introduce the application of Quantum Support Vector Machine (QSVM) to this critical healthcare challenge, showcasing an enhancement in diagnostic performance over the classical Support Vector Machine (SVM) approach. Our study not only outlines the remarkable improvements in diagnostic performance made by QSVM over the classic SVM technique, but it delves into the advancements brought about by the quantum feature map architecture, which has been carefully identified and evaluated, ensuring it aligns seamlessly with the unique characteristics of our prostate cancer dataset. This architecture succeded in creating a distinct feature space, enabling the detection of complex, non-linear patterns in the data. The findings reveal not only a comparable accuracy with classical SVM ($92\\%$) but also a $",
    "path": "papers/24/03/2403.07856.json",
    "total_tokens": 848,
    "translated_title": "量子支持向量机用于前列腺癌检测：性能分析",
    "translated_abstract": "本研究通过利用先进技术解决了改进前列腺癌检测方法的迫切需求。我们将量子支持向量机（QSVM）应用于这一重要的医疗挑战，展示了相比经典支持向量机（SVM）方法在诊断性能上的提升。研究不仅概述了QSVM相较于经典SVM技术在诊断性能上的显著改进，而且深入探讨了由量子特征映射架构带来的进步，该架构经过认真识别和评估，确保其与我们的前列腺癌数据集的独特特征完美契合。这种架构成功创建了一个独特的特征空间，实现了对数据中复杂非线性模式的检测。",
    "tldr": "通过量子支持向量机（QSVM）在前列腺癌检测中展现出显著的诊断性能提升，相较于经典SVM方法，并且成功创建了一个独特的特征空间，实现了对数据中复杂非线性模式的检测。",
    "en_tdlr": "By leveraging Quantum Support Vector Machine (QSVM) in prostate cancer detection, a significant enhancement in diagnostic performance over classical SVM is achieved, with the successful creation of a unique feature space for detecting complex non-linear patterns in the data."
}