{
    "title": "Hierarchical Deep Learning for Intention Estimation of Teleoperation Manipulation in Assembly Tasks",
    "abstract": "arXiv:2403.19770v1 Announce Type: cross  Abstract: In human-robot collaboration, shared control presents an opportunity to teleoperate robotic manipulation to improve the efficiency of manufacturing and assembly processes. Robots are expected to assist in executing the user's intentions. To this end, robust and prompt intention estimation is needed, relying on behavioral observations. The framework presents an intention estimation technique at hierarchical levels i.e., low-level actions and high-level tasks, by incorporating multi-scale hierarchical information in neural networks. Technically, we employ hierarchical dependency loss to boost overall accuracy. Furthermore, we propose a multi-window method that assigns proper hierarchical prediction windows of input data. An analysis of the predictive power with various inputs demonstrates the predominance of the deep hierarchical model in the sense of prediction accuracy and early intention identification. We implement the algorithm on a",
    "link": "https://arxiv.org/abs/2403.19770",
    "context": "Title: Hierarchical Deep Learning for Intention Estimation of Teleoperation Manipulation in Assembly Tasks\nAbstract: arXiv:2403.19770v1 Announce Type: cross  Abstract: In human-robot collaboration, shared control presents an opportunity to teleoperate robotic manipulation to improve the efficiency of manufacturing and assembly processes. Robots are expected to assist in executing the user's intentions. To this end, robust and prompt intention estimation is needed, relying on behavioral observations. The framework presents an intention estimation technique at hierarchical levels i.e., low-level actions and high-level tasks, by incorporating multi-scale hierarchical information in neural networks. Technically, we employ hierarchical dependency loss to boost overall accuracy. Furthermore, we propose a multi-window method that assigns proper hierarchical prediction windows of input data. An analysis of the predictive power with various inputs demonstrates the predominance of the deep hierarchical model in the sense of prediction accuracy and early intention identification. We implement the algorithm on a",
    "path": "papers/24/03/2403.19770.json",
    "total_tokens": 853,
    "translated_title": "分层深度学习用于装配任务中远程操纵操作意图估计",
    "translated_abstract": "在人机协作中，共享控制为远程操作机器人操纵提供了提升制造和装配工艺效率的机会。在执行用户意图上，机器人需要辅助。为此，需要鲁棒和即时的意图估计，依赖于行为观察。该框架提出了一种分层级别的意图估计技术，即低级动作和高级任务，通过在神经网络中整合多尺度层次信息。从技术上讲，我们采用分层依赖损失来提高整体准确率。此外，我们提出了一种多窗口方法，为输入数据分配适当的分层预测窗口。通过对各种输入的预测能力进行分析，证明了深度分层模型在预测准确度和提前意图识别方面的优越性。我们将该算法实现在一",
    "tldr": "该论文提出了一种分层深度学习框架，将多尺度层次信息整合到神经网络中，通过采用分层依赖损失来提高意图估计的准确性，在装配任务中实现了较优的意图识别和预测性能。",
    "en_tdlr": "This paper presents a hierarchical deep learning framework that integrates multi-scale hierarchical information into neural networks, boosts intention estimation accuracy with hierarchical dependency loss, and achieves superior intention recognition and prediction performance in assembly tasks."
}