{
    "title": "BlendScape: Enabling Unified and Personalized Video-Conferencing Environments through Generative AI",
    "abstract": "arXiv:2403.13947v1 Announce Type: cross  Abstract: Today's video-conferencing tools support a rich range of professional and social activities, but their generic, grid-based environments cannot be easily adapted to meet the varying needs of distributed collaborators. To enable end-user customization, we developed BlendScape, a system for meeting participants to compose video-conferencing environments tailored to their collaboration context by leveraging AI image generation techniques. BlendScape supports flexible representations of task spaces by blending users' physical or virtual backgrounds into unified environments and implements multimodal interaction techniques to steer the generation. Through an evaluation with 15 end-users, we investigated their customization preferences for work and social scenarios. Participants could rapidly express their design intentions with BlendScape and envisioned using the system to structure collaboration in future meetings, but experienced challenge",
    "link": "https://arxiv.org/abs/2403.13947",
    "context": "Title: BlendScape: Enabling Unified and Personalized Video-Conferencing Environments through Generative AI\nAbstract: arXiv:2403.13947v1 Announce Type: cross  Abstract: Today's video-conferencing tools support a rich range of professional and social activities, but their generic, grid-based environments cannot be easily adapted to meet the varying needs of distributed collaborators. To enable end-user customization, we developed BlendScape, a system for meeting participants to compose video-conferencing environments tailored to their collaboration context by leveraging AI image generation techniques. BlendScape supports flexible representations of task spaces by blending users' physical or virtual backgrounds into unified environments and implements multimodal interaction techniques to steer the generation. Through an evaluation with 15 end-users, we investigated their customization preferences for work and social scenarios. Participants could rapidly express their design intentions with BlendScape and envisioned using the system to structure collaboration in future meetings, but experienced challenge",
    "path": "papers/24/03/2403.13947.json",
    "total_tokens": 840,
    "translated_title": "BlendScape: 通过生成式人工智能实现统一和个性化视频会议环境",
    "translated_abstract": "当今的视频会议工具支持丰富的专业和社交活动，但它们的通用、基于网格的环境无法轻松地适应分布式合作者的各种需求。为了实现最终用户定制，我们开发了BlendScape，这是一个系统，通过利用AI图像生成技术，允许会议参与者构建根据他们的协作背景定制的视频会议环境。BlendScape通过将用户的物理或虚拟背景融合到统一环境中支持任务空间的灵活表示，并实现了多模交互技术以引导生成过程。通过与15名最终用户的评估，我们调查了他们对工作和社交场景的定制偏好。参与者可以快速表达他们对BlendScape的设计意图，并设想使用该系统来组织未来会议中的协作，但也遇到了挑战。",
    "tldr": "BlendScape通过生成式人工智能技术实现了用户定制视频会议环境，支持灵活的任务空间表示和多模交互技术，使用户能够快速表达设计意图并设想未来会议中的协作结构。",
    "en_tdlr": "BlendScape enables user-customized video-conferencing environments through generative AI, supporting flexible representations of task spaces and multimodal interaction techniques, allowing users to quickly express design intentions and envision collaboration structures in future meetings."
}