{
    "title": "Node Centrality Approximation For Large Networks Based On Inductive Graph Neural Networks",
    "abstract": "arXiv:2403.04977v1 Announce Type: cross  Abstract: Closeness Centrality (CC) and Betweenness Centrality (BC) are crucial metrics in network analysis, providing essential reference for discerning the significance of nodes within complex networks. These measures find wide applications in critical tasks, such as community detection and network dismantling. However, their practical implementation on extensive networks remains computationally demanding due to their high time complexity. To mitigate these computational challenges, numerous approximation algorithms have been developed to expedite the computation of CC and BC. Nevertheless, even these approximations still necessitate substantial processing time when applied to large-scale networks. Furthermore, their output proves sensitive to even minor perturbations within the network structure.   In this work, We redefine the CC and BC node ranking problem as a machine learning problem and propose the CNCA-IGE model, which is an encoder-dec",
    "link": "https://arxiv.org/abs/2403.04977",
    "context": "Title: Node Centrality Approximation For Large Networks Based On Inductive Graph Neural Networks\nAbstract: arXiv:2403.04977v1 Announce Type: cross  Abstract: Closeness Centrality (CC) and Betweenness Centrality (BC) are crucial metrics in network analysis, providing essential reference for discerning the significance of nodes within complex networks. These measures find wide applications in critical tasks, such as community detection and network dismantling. However, their practical implementation on extensive networks remains computationally demanding due to their high time complexity. To mitigate these computational challenges, numerous approximation algorithms have been developed to expedite the computation of CC and BC. Nevertheless, even these approximations still necessitate substantial processing time when applied to large-scale networks. Furthermore, their output proves sensitive to even minor perturbations within the network structure.   In this work, We redefine the CC and BC node ranking problem as a machine learning problem and propose the CNCA-IGE model, which is an encoder-dec",
    "path": "papers/24/03/2403.04977.json",
    "total_tokens": 790,
    "translated_title": "基于归纳图神经网络的大网络节点中心性近似",
    "translated_abstract": "靠近中心性（CC）和介数中心性（BC）是网络分析中至关重要的指标，在复杂网络中提供了节点重要性的基本参考。这些度量在关键任务中具有广泛的应用，如社区检测和网络解体。然而，由于其高时间复杂度，它们在大型网络上的实际实现仍然具有极高的计算需求。为了缓解这些计算挑战，已经开发了许多近似算法来加速CC和BC的计算。然而，即使这些近似算法在大规模网络上应用时仍需要大量的处理时间。此外，它们的输出对网络结构中甚至细微的扰动也十分敏感。",
    "tldr": "重新定义了节点排序问题作为一个机器学习问题，并提出了CNCA-IGE模型，该模型是一个编码器-解码器模型，用于基于归纳图神经网络的大网络节点中心性近似。",
    "en_tdlr": "The paper redefines the node ranking problem as a machine learning problem and proposes the CNCA-IGE model, which is an encoder-decoder model for node centrality approximation for large networks based on inductive graph neural networks."
}