{
    "title": "Continual Few-shot Event Detection via Hierarchical Augmentation Networks",
    "abstract": "arXiv:2403.17733v1 Announce Type: new  Abstract: Traditional continual event detection relies on abundant labeled data for training, which is often impractical to obtain in real-world applications. In this paper, we introduce continual few-shot event detection (CFED), a more commonly encountered scenario when a substantial number of labeled samples are not accessible. The CFED task is challenging as it involves memorizing previous event types and learning new event types with few-shot samples. To mitigate these challenges, we propose a memory-based framework: Hierarchical Augmentation Networks (HANet). To memorize previous event types with limited memory, we incorporate prototypical augmentation into the memory set. For the issue of learning new event types in few-shot scenarios, we propose a contrastive augmentation module for token representations. Despite comparing with previous state-of-the-art methods, we also conduct comparisons with ChatGPT. Experiment results demonstrate that o",
    "link": "https://arxiv.org/abs/2403.17733",
    "context": "Title: Continual Few-shot Event Detection via Hierarchical Augmentation Networks\nAbstract: arXiv:2403.17733v1 Announce Type: new  Abstract: Traditional continual event detection relies on abundant labeled data for training, which is often impractical to obtain in real-world applications. In this paper, we introduce continual few-shot event detection (CFED), a more commonly encountered scenario when a substantial number of labeled samples are not accessible. The CFED task is challenging as it involves memorizing previous event types and learning new event types with few-shot samples. To mitigate these challenges, we propose a memory-based framework: Hierarchical Augmentation Networks (HANet). To memorize previous event types with limited memory, we incorporate prototypical augmentation into the memory set. For the issue of learning new event types in few-shot scenarios, we propose a contrastive augmentation module for token representations. Despite comparing with previous state-of-the-art methods, we also conduct comparisons with ChatGPT. Experiment results demonstrate that o",
    "path": "papers/24/03/2403.17733.json",
    "total_tokens": 866,
    "translated_title": "基于分层增强网络的持续少样本事件检测",
    "translated_abstract": "传统的持续事件检测依赖于丰富的标注数据进行训练，而在现实世界的应用中，通常很难获得这些数据。本文介绍了持续少样本事件检测（CFED），这是一个更常见的场景，即很多标记样本无法获取的情况。CFED任务很具挑战性，因为需要记忆先前的事件类型，并用少量样本学习新的事件类型。为了应对这些挑战，我们提出了一种基于记忆的框架：分层增强网络（HANet）。为了在有限的内存中记忆先前的事件类型，我们将原型增强融入到记忆集中。针对在少样本情况下学习新事件类型的问题，我们提出了一个用于标记表示的对比增强模块。除了与先前最先进方法的比较，我们还与ChatGPT进行了比较。实验结果表明，...",
    "tldr": "本文提出了基于分层增强网络的持续少样本事件检测框架，通过原型增强和对比增强解决了记忆先前事件类型和学习少样本中新事件类型的挑战。",
    "en_tdlr": "This paper introduces a memory-based framework for continual few-shot event detection, named Hierarchical Augmentation Networks (HANet), which addresses the challenges of memorizing previous event types and learning new event types with few-shot samples through prototypical augmentation and contrastive augmentation."
}