{
    "title": "Network formation and efficiency in linear-quadratic games: An experimental study",
    "abstract": "arXiv:2403.05913v1 Announce Type: new  Abstract: We experimentally study effort provision and network formation in the linear-quadratic game characterized by positive externality and complementarity of effort choices among network neighbors. We compare experimental outcomes to the equilibrium and efficient allocations and study the impact of group size and linking costs. We find that individuals overprovide effort relative to the equilibrium level on the network they form. However, their payoffs are lower than the equilibrium payoffs because they create fewer links than it is optimal which limits the beneficial spillovers of effort provision. Reducing the linking costs does not significantly increase the connectedness of the network and the welfare loss is higher in larger groups. Individuals connect to the highest effort providers in the group and ignore links to relative low effort providers, even if those links would be beneficial to form. This effect explains the lack of links in t",
    "link": "https://arxiv.org/abs/2403.05913",
    "context": "Title: Network formation and efficiency in linear-quadratic games: An experimental study\nAbstract: arXiv:2403.05913v1 Announce Type: new  Abstract: We experimentally study effort provision and network formation in the linear-quadratic game characterized by positive externality and complementarity of effort choices among network neighbors. We compare experimental outcomes to the equilibrium and efficient allocations and study the impact of group size and linking costs. We find that individuals overprovide effort relative to the equilibrium level on the network they form. However, their payoffs are lower than the equilibrium payoffs because they create fewer links than it is optimal which limits the beneficial spillovers of effort provision. Reducing the linking costs does not significantly increase the connectedness of the network and the welfare loss is higher in larger groups. Individuals connect to the highest effort providers in the group and ignore links to relative low effort providers, even if those links would be beneficial to form. This effect explains the lack of links in t",
    "path": "papers/24/03/2403.05913.json",
    "total_tokens": 862,
    "translated_title": "线性二次博弈中的网络形成和效率：一个实验研究",
    "translated_abstract": "我们通过实验研究了线性二次博弈中的努力提供和网络形成，该博弈以正外部性和网络邻居之间努力选择的互补性为特征。我们将实验结果与均衡和有效分配进行比较，并研究团体规模和连接成本的影响。我们发现，相对于他们形成的网络上的均衡水平，个体提供的努力过多。然而，他们的回报低于均衡回报，因为他们建立的链接比最优水平少，限制了努力提供的有益溢出。减少连接成本并不显著增加网络的联系性，福利损失在较大的团体中更大。个人连接到团体中努力提供者中提供最高努力的人，并忽视相对努力较低的提供者的链接，即使这些链接是有益的。这种效应解释了网络中缺乏链接的现象。",
    "tldr": "个体在线性二次博弈中的网络形成中提供过多的努力，但是他们的回报却低于均衡回报，因为他们建立的连接不足以实现最佳努力的有益溢出。",
    "en_tdlr": "Individuals provide excessive effort in network formation in linear-quadratic games, resulting in lower payoffs than equilibrium levels due to suboptimal connectivity limiting beneficial spillovers of effort provision."
}