{
    "title": "Cell reprogramming design by transfer learning of functional transcriptional networks",
    "abstract": "arXiv:2403.04837v1 Announce Type: cross  Abstract: Recent developments in synthetic biology, next-generation sequencing, and machine learning provide an unprecedented opportunity to rationally design new disease treatments based on measured responses to gene perturbations and drugs to reprogram cells. The main challenges to seizing this opportunity are the incomplete knowledge of the cellular network and the combinatorial explosion of possible interventions, both of which are insurmountable by experiments. To address these challenges, we develop a transfer learning approach to control cell behavior that is pre-trained on transcriptomic data associated with human cell fates, thereby generating a model of the network dynamics that can be transferred to specific reprogramming goals. The approach combines transcriptional responses to gene perturbations to minimize the difference between a given pair of initial and target transcriptional states. We demonstrate our approach's versatility by ",
    "link": "https://arxiv.org/abs/2403.04837",
    "context": "Title: Cell reprogramming design by transfer learning of functional transcriptional networks\nAbstract: arXiv:2403.04837v1 Announce Type: cross  Abstract: Recent developments in synthetic biology, next-generation sequencing, and machine learning provide an unprecedented opportunity to rationally design new disease treatments based on measured responses to gene perturbations and drugs to reprogram cells. The main challenges to seizing this opportunity are the incomplete knowledge of the cellular network and the combinatorial explosion of possible interventions, both of which are insurmountable by experiments. To address these challenges, we develop a transfer learning approach to control cell behavior that is pre-trained on transcriptomic data associated with human cell fates, thereby generating a model of the network dynamics that can be transferred to specific reprogramming goals. The approach combines transcriptional responses to gene perturbations to minimize the difference between a given pair of initial and target transcriptional states. We demonstrate our approach's versatility by ",
    "path": "papers/24/03/2403.04837.json",
    "total_tokens": 791,
    "translated_title": "细胞重编程设计通过功能转录网络的迁移学习",
    "translated_abstract": "最近合成生物学、下一代测序和机器学习的发展为基于基因扰动和药物的测量响应来合理设计新的疾病治疗提供了前所未有的机会，主要挑战是细胞网络的知识不完整和可能干预的组合爆炸，这两者都无法通过实验来克服。为了解决这些挑战，我们开发了一种迁移学习方法来控制细胞行为，该方法在与人类细胞命运相关的转录组数据上进行了预训练，从而生成一个可以转移到特定重编程目标的网络动态模型。该方法结合了对基因扰动的转录反应，以最小化给定初始和目标转录状态之间的差异。我们通过展示我们的方法的多功能性来证明其",
    "tldr": "通过迁移学习设计细胞重编程，利用功能转录网络的知识来控制细胞行为，实现从初始状态到目标状态的转录状态之间的最小化差异",
    "en_tdlr": "Cell reprogramming design through transfer learning leverages knowledge of functional transcriptional networks to control cell behavior by minimizing differences in transcriptional states from initial to target states."
}