{
    "title": "Default Resilience and Worst-Case Effects in Financial Networks",
    "abstract": "arXiv:2403.10631v1 Announce Type: new  Abstract: In this paper we analyze the resilience of a network of banks to joint price fluctuations of the external assets in which they have shared exposures, and evaluate the worst-case effects of the possible default contagion. Indeed, when the prices of certain external assets either decrease or increase, all banks exposed to them experience varying degrees of simultaneous shocks to their balance sheets. These coordinated and structured shocks have the potential to exacerbate the likelihood of defaults. In this context, we introduce first a concept of {default resilience margin}, $\\epsilon^*$, i.e., the maximum amplitude of asset prices fluctuations that the network can tolerate without generating defaults. Such threshold value is computed by considering two different measures of price fluctuations, one based on the maximum individual variation of each asset, and the other based on the sum of all the asset's absolute variations. For any price ",
    "link": "https://arxiv.org/abs/2403.10631",
    "context": "Title: Default Resilience and Worst-Case Effects in Financial Networks\nAbstract: arXiv:2403.10631v1 Announce Type: new  Abstract: In this paper we analyze the resilience of a network of banks to joint price fluctuations of the external assets in which they have shared exposures, and evaluate the worst-case effects of the possible default contagion. Indeed, when the prices of certain external assets either decrease or increase, all banks exposed to them experience varying degrees of simultaneous shocks to their balance sheets. These coordinated and structured shocks have the potential to exacerbate the likelihood of defaults. In this context, we introduce first a concept of {default resilience margin}, $\\epsilon^*$, i.e., the maximum amplitude of asset prices fluctuations that the network can tolerate without generating defaults. Such threshold value is computed by considering two different measures of price fluctuations, one based on the maximum individual variation of each asset, and the other based on the sum of all the asset's absolute variations. For any price ",
    "path": "papers/24/03/2403.10631.json",
    "total_tokens": 865,
    "translated_title": "金融网络中的默认弹性和最坏情况效应",
    "translated_abstract": "在这篇论文中，我们分析了银行网络对它们共同承担风险的外部资产价格波动的弹性，并评估了可能的违约传染的最坏情况影响。当某些外部资产的价格下降或上升时，所有暴露于这些资产的银行都会同时遭受不同程度的冲击。这些协调和有结构的冲击有可能加剧违约的可能性。在这种情况下，我们首先介绍了一个概念——{默认弹性余量}，即网络在不产生违约的情况下能够容忍的资产价格波动的最大幅度，$\\epsilon^*$。这个阈值是通过考虑两种不同的价格波动度量来计算的，一种基于每种资产的最大单个变化，另一种基于所有资产的绝对变化之和。",
    "tldr": "论文分析了金融网络对共同承担的外部资产价格波动的弹性，并评估了违约传染的最坏情况影响，引入了默认弹性余量的概念，并计算了网络能够容忍的最大资产价格波动幅度。",
    "en_tdlr": "The paper analyzes the resilience of a financial network to joint price fluctuations of external assets, evaluates the worst-case effects of default contagion, introduces the concept of default resilience margin, and calculates the maximum asset price fluctuation the network can tolerate without defaults."
}