{
    "title": "EthioMT: Parallel Corpus for Low-resource Ethiopian Languages",
    "abstract": "arXiv:2403.19365v1 Announce Type: new  Abstract: Recent research in natural language processing (NLP) has achieved impressive performance in tasks such as machine translation (MT), news classification, and question-answering in high-resource languages. However, the performance of MT leaves much to be desired for low-resource languages. This is due to the smaller size of available parallel corpora in these languages, if such corpora are available at all. NLP in Ethiopian languages suffers from the same issues due to the unavailability of publicly accessible datasets for NLP tasks, including MT. To help the research community and foster research for Ethiopian languages, we introduce EthioMT -- a new parallel corpus for 15 languages. We also create a new benchmark by collecting a dataset for better-researched languages in Ethiopia. We evaluate the newly collected corpus and the benchmark dataset for 23 Ethiopian languages using transformer and fine-tuning approaches.",
    "link": "https://arxiv.org/abs/2403.19365",
    "context": "Title: EthioMT: Parallel Corpus for Low-resource Ethiopian Languages\nAbstract: arXiv:2403.19365v1 Announce Type: new  Abstract: Recent research in natural language processing (NLP) has achieved impressive performance in tasks such as machine translation (MT), news classification, and question-answering in high-resource languages. However, the performance of MT leaves much to be desired for low-resource languages. This is due to the smaller size of available parallel corpora in these languages, if such corpora are available at all. NLP in Ethiopian languages suffers from the same issues due to the unavailability of publicly accessible datasets for NLP tasks, including MT. To help the research community and foster research for Ethiopian languages, we introduce EthioMT -- a new parallel corpus for 15 languages. We also create a new benchmark by collecting a dataset for better-researched languages in Ethiopia. We evaluate the newly collected corpus and the benchmark dataset for 23 Ethiopian languages using transformer and fine-tuning approaches.",
    "path": "papers/24/03/2403.19365.json",
    "total_tokens": 866,
    "translated_title": "EthioMT：低资源埃塞俄比亚语言的平行语料库",
    "translated_abstract": "自然语言处理（NLP）领域的最新研究取得了在机器翻译（MT）、新闻分类和问答等高资源语言任务中令人印象深刻的性能。然而，对于低资源语言，MT的性能仍有很大改进空间。这是由于这些语言可用平行语料库的规模较小，如果有的话。埃塞俄比亚语言的NLP也因为公开可访问的NLP任务数据集（包括MT）的不可用而受到相同问题的困扰。为了帮助研究界并促进埃塞俄比亚语言的研究，我们介绍了EthioMT - 一个包含15种语言的新平行语料库。我们还通过收集埃塞俄比亚更常见的已研究语言的数据集，创建了一个新的基准。我们使用transformer和微调方法对新收集的语料库和基准数据集对23种埃塞俄比亚语言进行了评估。",
    "tldr": "EthioMT是一个新的平行语料库，为15种低资源埃塞俄比亚语言提供支持，并通过创建基准数据集改进了研究界对埃塞俄比亚语言的研究。",
    "en_tdlr": "EthioMT is a new parallel corpus supporting 15 low-resource Ethiopian languages and improves research in Ethiopian languages by creating benchmark datasets."
}