{
    "title": "ConvSDG: Session Data Generation for Conversational Search",
    "abstract": "arXiv:2403.11335v1 Announce Type: cross  Abstract: Conversational search provides a more convenient interface for users to search by allowing multi-turn interaction with the search engine. However, the effectiveness of the conversational dense retrieval methods is limited by the scarcity of training data required for their fine-tuning. Thus, generating more training conversational sessions with relevant labels could potentially improve search performance. Based on the promising capabilities of large language models (LLMs) on text generation, we propose ConvSDG, a simple yet effective framework to explore the feasibility of boosting conversational search by using LLM for session data generation. Within this framework, we design dialogue/session-level and query-level data generation with unsupervised and semi-supervised learning, according to the availability of relevance judgments. The generated data are used to fine-tune the conversational dense retriever. Extensive experiments on four",
    "link": "https://arxiv.org/abs/2403.11335",
    "context": "Title: ConvSDG: Session Data Generation for Conversational Search\nAbstract: arXiv:2403.11335v1 Announce Type: cross  Abstract: Conversational search provides a more convenient interface for users to search by allowing multi-turn interaction with the search engine. However, the effectiveness of the conversational dense retrieval methods is limited by the scarcity of training data required for their fine-tuning. Thus, generating more training conversational sessions with relevant labels could potentially improve search performance. Based on the promising capabilities of large language models (LLMs) on text generation, we propose ConvSDG, a simple yet effective framework to explore the feasibility of boosting conversational search by using LLM for session data generation. Within this framework, we design dialogue/session-level and query-level data generation with unsupervised and semi-supervised learning, according to the availability of relevance judgments. The generated data are used to fine-tune the conversational dense retriever. Extensive experiments on four",
    "path": "papers/24/03/2403.11335.json",
    "total_tokens": 756,
    "translated_title": "ConvSDG：用于会话搜索的会话数据生成",
    "translated_abstract": "会话搜索通过允许用户与搜索引擎进行多轮交互提供了更便捷的搜索界面。然而，会话密集检索方法的有效性受到训练数据的稀缺性限制，这些数据需要用于微调。因此，生成更多带有相关标签的训练会话可能会提高搜索性能。基于大型语言模型（LLMs）在文本生成上的有益能力，我们提出了ConvSDG，这是一个简单而有效的框架，旨在探索使用LLM进行会话数据生成来提升会话搜索的可行性。在这个框架内，我们根据相关判断的可用性设计了对话/会话级和查询级数据生成的无监督和半监督学习。生成的数据被用于微调会话密集检索器。",
    "tldr": "基于大型语言模型的ConvSDG框架探索了生成更多带相关标签训练会话以提升会话搜索性能的方法。",
    "en_tdlr": "ConvSDG framework, based on large language models, explores the method of generating more training sessions with relevant labels to boost conversational search performance."
}