{
    "title": "Enhancing Event Causality Identification with Rationale and Structure-Aware Causal Question Answering",
    "abstract": "arXiv:2403.11129v1 Announce Type: new  Abstract: Document-level Event Causality Identification (DECI) aims to identify causal relations between two events in documents. Recent research tends to use pre-trained language models to generate the event causal relations. Whereas, these methods are prone to the errors of sequential generation due to multiple events in a document. Moreover, the potential structures such as event coreference and related causal chain are neglected. In this paper, we propose a multi-task learning framework to enhance event causality identification with rationale and structure-aware causal question answering. Specifically, the DECI task is transformed into multiple-choice question answering, and the causes and effects of the questioned event are generated with large language models. In addition, we generate the rationales to explain why these events have causal relations. Moreover, we construct an event structure graph, which models the multi-hop potential relatio",
    "link": "https://arxiv.org/abs/2403.11129",
    "context": "Title: Enhancing Event Causality Identification with Rationale and Structure-Aware Causal Question Answering\nAbstract: arXiv:2403.11129v1 Announce Type: new  Abstract: Document-level Event Causality Identification (DECI) aims to identify causal relations between two events in documents. Recent research tends to use pre-trained language models to generate the event causal relations. Whereas, these methods are prone to the errors of sequential generation due to multiple events in a document. Moreover, the potential structures such as event coreference and related causal chain are neglected. In this paper, we propose a multi-task learning framework to enhance event causality identification with rationale and structure-aware causal question answering. Specifically, the DECI task is transformed into multiple-choice question answering, and the causes and effects of the questioned event are generated with large language models. In addition, we generate the rationales to explain why these events have causal relations. Moreover, we construct an event structure graph, which models the multi-hop potential relatio",
    "path": "papers/24/03/2403.11129.json",
    "total_tokens": 879,
    "translated_title": "使用理由和结构感知因果问答增强事件因果识别",
    "translated_abstract": "文档级事件因果识别（DECI）旨在识别文档中两个事件之间的因果关系。最近的研究倾向于使用预训练语言模型生成事件因果关系。然而，由于文档中存在多个事件，这些方法容易出现顺序生成错误。此外，潜在的结构，如事件共指和相关因果链被忽视。在本文中，我们提出了一个多任务学习框架，通过理由和结构感知的因果问答来增强事件因果识别。具体而言，DECI任务被转化为多项选择问题回答，然后利用大型语言模型生成被问及事件的因果关系。此外，我们生成理由来解释为什么这些事件具有因果关系。此外，我们构建了一个事件结构图，对多跳潜在关系进行建模。",
    "tldr": "提出了一个多任务学习框架，通过理由和结构感知的因果问答来增强事件因果识别，将DECI任务转化为多项选择问题回答，生成被问及事件的因果关系以及解释这些事件具有因果关系的理由，构建了一个事件结构图对多跳潜在关系进行建模。",
    "en_tdlr": "Proposed a multi-task learning framework to enhance event causality identification with rationale and structure-aware causal question answering, transforming the DECI task into multiple-choice question answering, generating causal relations of the questioned event and explaining the reasons for their causal relations, and constructing an event structure graph to model multi-hop potential relationships."
}