{
    "title": "Image-based Novel Fault Detection with Deep Learning Classifiers using Hierarchical Labels",
    "abstract": "arXiv:2403.17891v1 Announce Type: cross  Abstract: One important characteristic of modern fault classification systems is the ability to flag the system when faced with previously unseen fault types. This work considers the unknown fault detection capabilities of deep neural network-based fault classifiers. Specifically, we propose a methodology on how, when available, labels regarding the fault taxonomy can be used to increase unknown fault detection performance without sacrificing model performance. To achieve this, we propose to utilize soft label techniques to improve the state-of-the-art deep novel fault detection techniques during the training process and novel hierarchically consistent detection statistics for online novel fault detection. Finally, we demonstrated increased detection performance on novel fault detection in inspection images from the hot steel rolling process, with results well replicated across multiple scenarios and baseline detection methods.",
    "link": "https://arxiv.org/abs/2403.17891",
    "context": "Title: Image-based Novel Fault Detection with Deep Learning Classifiers using Hierarchical Labels\nAbstract: arXiv:2403.17891v1 Announce Type: cross  Abstract: One important characteristic of modern fault classification systems is the ability to flag the system when faced with previously unseen fault types. This work considers the unknown fault detection capabilities of deep neural network-based fault classifiers. Specifically, we propose a methodology on how, when available, labels regarding the fault taxonomy can be used to increase unknown fault detection performance without sacrificing model performance. To achieve this, we propose to utilize soft label techniques to improve the state-of-the-art deep novel fault detection techniques during the training process and novel hierarchically consistent detection statistics for online novel fault detection. Finally, we demonstrated increased detection performance on novel fault detection in inspection images from the hot steel rolling process, with results well replicated across multiple scenarios and baseline detection methods.",
    "path": "papers/24/03/2403.17891.json",
    "total_tokens": 843,
    "translated_title": "使用深度学习分类器基于图像的新型故障检测，使用分层标签",
    "translated_abstract": "现代故障分类系统的一个重要特征是在面对以前未见过的故障类型时能够标记系统。本文考虑了基于深度神经网络的故障分类器的未知故障检测能力。具体来说，我们提出了一种方法，即在可用的情况下，如何利用有关故障分类法的标签来提高未知故障检测性能，而不会牺牲模型性能。为了实现这一目标，我们建议利用软标签技术来改善现有的深度新型故障检测技术，在训练过程中以及用于在线新型故障检测的层次一致检测统计。最后，我们展示了在热轧钢过程中检查图像中新型故障检测的增强检测性能，结果在多种情况和基线检测方法中都有很好的重现。",
    "tldr": "本研究提出了一种在深度学习分类器中利用分层标签提高未知故障检测性能的方法，同时不影响模型性能，在热轧钢过程中的实验结果表明其具有较好的可复制性。",
    "en_tdlr": "This study proposes a method to improve unknown fault detection performance in deep learning classifiers using hierarchical labels without sacrificing model performance, with experiments in the hot steel rolling process showing good reproducibility."
}