{
    "title": "Equipment Health Assessment: Time Series Analysis for Wind Turbine Performance",
    "abstract": "arXiv:2403.00975v1 Announce Type: cross  Abstract: In this study, we leverage SCADA data from diverse wind turbines to predict power output, employing advanced time series methods, specifically Functional Neural Networks (FNN) and Long Short-Term Memory (LSTM) networks. A key innovation lies in the ensemble of FNN and LSTM models, capitalizing on their collective learning. This ensemble approach outperforms individual models, ensuring stable and accurate power output predictions. Additionally, machine learning techniques are applied to detect wind turbine performance deterioration, enabling proactive maintenance strategies and health assessment. Crucially, our analysis reveals the uniqueness of each wind turbine, necessitating tailored models for optimal predictions. These insight underscores the importance of providing automatized customization for different turbines to keep human modeling effort low. Importantly, the methodologies developed in this analysis are not limited to wind tu",
    "link": "https://arxiv.org/abs/2403.00975",
    "context": "Title: Equipment Health Assessment: Time Series Analysis for Wind Turbine Performance\nAbstract: arXiv:2403.00975v1 Announce Type: cross  Abstract: In this study, we leverage SCADA data from diverse wind turbines to predict power output, employing advanced time series methods, specifically Functional Neural Networks (FNN) and Long Short-Term Memory (LSTM) networks. A key innovation lies in the ensemble of FNN and LSTM models, capitalizing on their collective learning. This ensemble approach outperforms individual models, ensuring stable and accurate power output predictions. Additionally, machine learning techniques are applied to detect wind turbine performance deterioration, enabling proactive maintenance strategies and health assessment. Crucially, our analysis reveals the uniqueness of each wind turbine, necessitating tailored models for optimal predictions. These insight underscores the importance of providing automatized customization for different turbines to keep human modeling effort low. Importantly, the methodologies developed in this analysis are not limited to wind tu",
    "path": "papers/24/03/2403.00975.json",
    "total_tokens": 870,
    "translated_title": "风力发电机性能的时间序列分析设备健康评估",
    "translated_abstract": "在这项研究中，我们利用来自不同风力发电机的SCADA数据，使用先进的时间序列方法，特别是功能神经网络（FNN）和长短期记忆（LSTM）网络来预测功率输出。关键创新在于FNN和LSTM模型的集成，利用它们的集体学习。这种集成方法胜过单个模型，确保稳定和准确的功率输出预测。此外，机器学习技术用于检测风力发电机性能恶化，实现积极的维护策略和健康评估。关键是，我们的分析揭示了每台风力发电机的独特性，需要为最佳预测定制模型。这些见解强调提供不同发电机自动化定制的重要性，以保持人力建模工作量低。重要的是，本分析中开发的方法不局限于风力发电机。",
    "tldr": "利用功能神经网络（FNN）和长短期记忆（LSTM）网络的集成方法来预测风力发电机功率输出，实现准确稳定的预测并检测性能恶化，以推动积极的维护策略和健康评估。",
    "en_tdlr": "An ensemble approach utilizing Functional Neural Networks (FNN) and Long Short-Term Memory (LSTM) networks is used to predict wind turbine power output, ensuring stable and accurate predictions while detecting performance deterioration for proactive maintenance and health assessment."
}