{
    "title": "MRL Parsing Without Tears: The Case of Hebrew",
    "abstract": "arXiv:2403.06970v1 Announce Type: new  Abstract: Syntactic parsing remains a critical tool for relation extraction and information extraction, especially in resource-scarce languages where LLMs are lacking. Yet in morphologically rich languages (MRLs), where parsers need to identify multiple lexical units in each token, existing systems suffer in latency and setup complexity. Some use a pipeline to peel away the layers: first segmentation, then morphology tagging, and then syntax parsing; however, errors in earlier layers are then propagated forward. Others use a joint architecture to evaluate all permutations at once; while this improves accuracy, it is notoriously slow. In contrast, and taking Hebrew as a test case, we present a new \"flipped pipeline\": decisions are made directly on the whole-token units by expert classifiers, each one dedicated to one specific task. The classifiers are independent of one another, and only at the end do we synthesize their predictions. This blazingly",
    "link": "https://arxiv.org/abs/2403.06970",
    "context": "Title: MRL Parsing Without Tears: The Case of Hebrew\nAbstract: arXiv:2403.06970v1 Announce Type: new  Abstract: Syntactic parsing remains a critical tool for relation extraction and information extraction, especially in resource-scarce languages where LLMs are lacking. Yet in morphologically rich languages (MRLs), where parsers need to identify multiple lexical units in each token, existing systems suffer in latency and setup complexity. Some use a pipeline to peel away the layers: first segmentation, then morphology tagging, and then syntax parsing; however, errors in earlier layers are then propagated forward. Others use a joint architecture to evaluate all permutations at once; while this improves accuracy, it is notoriously slow. In contrast, and taking Hebrew as a test case, we present a new \"flipped pipeline\": decisions are made directly on the whole-token units by expert classifiers, each one dedicated to one specific task. The classifiers are independent of one another, and only at the end do we synthesize their predictions. This blazingly",
    "path": "papers/24/03/2403.06970.json",
    "total_tokens": 889,
    "translated_title": "无泪MRL分析：希伯来语案例",
    "translated_abstract": "语法分析仍然是关系提取和信息提取的关键工具，特别是在资源匮乏的语言中，缺乏LLMs的情况下。然而，在形态丰富的语言(MRLs)中，解析器需要识别每个标记中的多个词素单元，现有系统在延迟和设置复杂性方面存在问题。一些系统使用流水线逐层处理：首先进行分词，然后进行形态标记，最后进行语法分析；然而，之前层次的错误会向前传播。另一些系统使用联合架构同时评估所有排列组合；虽然这提高了准确性，但速度极其缓慢。相反，以希伯来语作为测试案例，我们提出了一种新的“翻转流水线”：专家分类器直接在整个标记单元上做出决策，每个分类器专门负责一个特定任务。这些分类器彼此独立，只有在最后我们才综合它们的预测。",
    "tldr": "本研究针对形态丰富的语言提出了一种新的“翻转流水线”方法，在希伯来语上取得了成功，即通过专家分类器直接在整个标记单元上做出决策，最后再综合预测结果。",
    "en_tdlr": "A new \"flipped pipeline\" approach is proposed for morphologically rich languages, demonstrated successfully on Hebrew, making decisions directly on whole-token units by expert classifiers and synthesizing their predictions at the end."
}