{
    "title": "Multi-Level Feedback Generation with Large Language Models for Empowering Novice Peer Counselors",
    "abstract": "arXiv:2403.15482v1 Announce Type: new  Abstract: Realistic practice and tailored feedback are key processes for training peer counselors with clinical skills. However, existing mechanisms of providing feedback largely rely on human supervision. Peer counselors often lack mechanisms to receive detailed feedback from experienced mentors, making it difficult for them to support the large number of people with mental health issues who use peer counseling. Our work aims to leverage large language models to provide contextualized and multi-level feedback to empower peer counselors, especially novices, at scale. To achieve this, we co-design with a group of senior psychotherapy supervisors to develop a multi-level feedback taxonomy, and then construct a publicly available dataset with comprehensive feedback annotations of 400 emotional support conversations. We further design a self-improvement method on top of large language models to enhance the automatic generation of feedback. Via qualita",
    "link": "https://arxiv.org/abs/2403.15482",
    "context": "Title: Multi-Level Feedback Generation with Large Language Models for Empowering Novice Peer Counselors\nAbstract: arXiv:2403.15482v1 Announce Type: new  Abstract: Realistic practice and tailored feedback are key processes for training peer counselors with clinical skills. However, existing mechanisms of providing feedback largely rely on human supervision. Peer counselors often lack mechanisms to receive detailed feedback from experienced mentors, making it difficult for them to support the large number of people with mental health issues who use peer counseling. Our work aims to leverage large language models to provide contextualized and multi-level feedback to empower peer counselors, especially novices, at scale. To achieve this, we co-design with a group of senior psychotherapy supervisors to develop a multi-level feedback taxonomy, and then construct a publicly available dataset with comprehensive feedback annotations of 400 emotional support conversations. We further design a self-improvement method on top of large language models to enhance the automatic generation of feedback. Via qualita",
    "path": "papers/24/03/2403.15482.json",
    "total_tokens": 811,
    "translated_title": "利用大型语言模型生成多级反馈，为初学者同行辅导员赋能",
    "translated_abstract": "实践和个性化反馈是培养具有临床技能的同行辅导员的关键过程。然而，现有的反馈机制主要依赖于人工监督。同行辅导员经常缺乏机制来从经验丰富的导师那里获得详细的反馈，这使得他们难以支持使用同行辅导的大量心理健康问题患者。我们的工作旨在利用大型语言模型提供情境化和多级反馈，以赋能规模化的初学者同行辅导员。为实现这一目标，我们与一组高级心理治疗督导共同设计了一个多级反馈分类法，然后构建了一个具有完整反馈注释的400次情绪支持对话的公开可用数据集。我们进一步设计了一种基于大型语言模型的自我改进方法，以增强反馈的自动生成。",
    "tldr": "利用大型语言模型为初学者同行辅导员提供多级详细反馈，赋能规模化的支持心理健康问题患者。"
}