{
    "title": "A Learning-based Incentive Mechanism for Mobile AIGC Service in Decentralized Internet of Vehicles",
    "abstract": "arXiv:2403.20151v1 Announce Type: new  Abstract: Artificial Intelligence-Generated Content (AIGC) refers to the paradigm of automated content generation utilizing AI models. Mobile AIGC services in the Internet of Vehicles (IoV) network have numerous advantages over traditional cloud-based AIGC services, including enhanced network efficiency, better reconfigurability, and stronger data security and privacy. Nonetheless, AIGC service provisioning frequently demands significant resources. Consequently, resource-constrained roadside units (RSUs) face challenges in maintaining a heterogeneous pool of AIGC services and addressing all user service requests without degrading overall performance. Therefore, in this paper, we propose a decentralized incentive mechanism for mobile AIGC service allocation, employing multi-agent deep reinforcement learning to find the balance between the supply of AIGC services on RSUs and user demand for services within the IoV context, optimizing user experience",
    "link": "https://arxiv.org/abs/2403.20151",
    "context": "Title: A Learning-based Incentive Mechanism for Mobile AIGC Service in Decentralized Internet of Vehicles\nAbstract: arXiv:2403.20151v1 Announce Type: new  Abstract: Artificial Intelligence-Generated Content (AIGC) refers to the paradigm of automated content generation utilizing AI models. Mobile AIGC services in the Internet of Vehicles (IoV) network have numerous advantages over traditional cloud-based AIGC services, including enhanced network efficiency, better reconfigurability, and stronger data security and privacy. Nonetheless, AIGC service provisioning frequently demands significant resources. Consequently, resource-constrained roadside units (RSUs) face challenges in maintaining a heterogeneous pool of AIGC services and addressing all user service requests without degrading overall performance. Therefore, in this paper, we propose a decentralized incentive mechanism for mobile AIGC service allocation, employing multi-agent deep reinforcement learning to find the balance between the supply of AIGC services on RSUs and user demand for services within the IoV context, optimizing user experience",
    "path": "papers/24/03/2403.20151.json",
    "total_tokens": 872,
    "translated_title": "基于学习的分散式车联网移动人工智能生成内容服务激励机制",
    "translated_abstract": "arXiv:2403.20151v1 公告类型: 新的 摘要: 人工智能生成内容（AIGC）指的是利用AI模型进行自动化内容生成的范式。车联网（IoV）网络中的移动AIGC服务比传统基于云的AIGC服务具有诸多优势，包括增强的网络效率、更好的可重构性，以及更强的数据安全和隐私性。然而，AIGC服务提供经常需要大量资源。因此，资源受限的路边单元（RSUs）面临着在不降低整体性能的情况下维护多样化AIGC服务池并满足所有用户服务请求的挑战。因此，在本文中，我们提出了一个用于移动AIGC服务分配的分散激励机制，利用多智能体深度强化学习找到RSUs上AIGC服务供应和IoV环境中用户服务需求之间的平衡，优化用户体验。",
    "tldr": "本文提出了一个基于多智能体深度强化学习的分散式激励机制，旨在在车联网环境中为移动AIGC服务分配的供需平衡。"
}