{
    "title": "PLOT-TAL -- Prompt Learning with Optimal Transport for Few-Shot Temporal Action Localization",
    "abstract": "arXiv:2403.18915v1 Announce Type: cross  Abstract: This paper introduces a novel approach to temporal action localization (TAL) in few-shot learning. Our work addresses the inherent limitations of conventional single-prompt learning methods that often lead to overfitting due to the inability to generalize across varying contexts in real-world videos. Recognizing the diversity of camera views, backgrounds, and objects in videos, we propose a multi-prompt learning framework enhanced with optimal transport. This design allows the model to learn a set of diverse prompts for each action, capturing general characteristics more effectively and distributing the representation to mitigate the risk of overfitting. Furthermore, by employing optimal transport theory, we efficiently align these prompts with action features, optimizing for a comprehensive representation that adapts to the multifaceted nature of video data. Our experiments demonstrate significant improvements in action localization a",
    "link": "https://arxiv.org/abs/2403.18915",
    "context": "Title: PLOT-TAL -- Prompt Learning with Optimal Transport for Few-Shot Temporal Action Localization\nAbstract: arXiv:2403.18915v1 Announce Type: cross  Abstract: This paper introduces a novel approach to temporal action localization (TAL) in few-shot learning. Our work addresses the inherent limitations of conventional single-prompt learning methods that often lead to overfitting due to the inability to generalize across varying contexts in real-world videos. Recognizing the diversity of camera views, backgrounds, and objects in videos, we propose a multi-prompt learning framework enhanced with optimal transport. This design allows the model to learn a set of diverse prompts for each action, capturing general characteristics more effectively and distributing the representation to mitigate the risk of overfitting. Furthermore, by employing optimal transport theory, we efficiently align these prompts with action features, optimizing for a comprehensive representation that adapts to the multifaceted nature of video data. Our experiments demonstrate significant improvements in action localization a",
    "path": "papers/24/03/2403.18915.json",
    "total_tokens": 835,
    "translated_title": "使用最优传输进行少样本时序动作定位的提示学习",
    "translated_abstract": "本文介绍了一种新的方法来处理少样本学习中的时序动作定位（TAL）。我们的工作解决了传统单样本学习方法的固有局限性，这些方法往往由于无法在真实世界的视频中跨不同上下文进行泛化而导致过拟合。鉴于视频中摄像机视角、背景和物体的多样性，我们提出了一个增强了最优传输的多提示学习框架。这个设计允许模型为每个动作学习一组多样的提示，更有效地捕捉通用特征并分布表示以减轻过拟合的风险。此外，通过采用最优传输理论，我们可以有效地将这些提示与动作特征进行对齐，优化以获得适应视频数据多面性的综合表示。我们的实验证明了动作定位方面的显著改进。",
    "tldr": "提出了使用最优传输进行少样本时序动作定位的提示学习方法，通过多提示学习框架和最优传输理论的结合，有效地捕捉通用特征和减轻过拟合风险",
    "en_tdlr": "Proposed a prompt learning approach using optimal transport for few-shot temporal action localization, combining multi-prompt learning framework with optimal transport theory to effectively capture general characteristics and mitigate the risk of overfitting."
}