{
    "title": "XAIport: A Service Framework for the Early Adoption of XAI in AI Model Development",
    "abstract": "arXiv:2403.16858v1 Announce Type: new  Abstract: In this study, we propose the early adoption of Explainable AI (XAI) with a focus on three properties: Quality of explanation, the explanation summaries should be consistent across multiple XAI methods; Architectural Compatibility, for effective integration in XAI, the architecture styles of both the XAI methods and the models to be explained must be compatible with the framework; Configurable operations, XAI explanations are operable, akin to machine learning operations. Thus, an explanation for AI models should be reproducible and tractable to be trustworthy. We present XAIport, a framework of XAI microservices encapsulated into Open APIs to deliver early explanations as observation for learning model quality assurance. XAIport enables configurable XAI operations along with machine learning development. We quantify the operational costs of incorporating XAI with three cloud computer vision services on Microsoft Azure Cognitive Services",
    "link": "https://arxiv.org/abs/2403.16858",
    "context": "Title: XAIport: A Service Framework for the Early Adoption of XAI in AI Model Development\nAbstract: arXiv:2403.16858v1 Announce Type: new  Abstract: In this study, we propose the early adoption of Explainable AI (XAI) with a focus on three properties: Quality of explanation, the explanation summaries should be consistent across multiple XAI methods; Architectural Compatibility, for effective integration in XAI, the architecture styles of both the XAI methods and the models to be explained must be compatible with the framework; Configurable operations, XAI explanations are operable, akin to machine learning operations. Thus, an explanation for AI models should be reproducible and tractable to be trustworthy. We present XAIport, a framework of XAI microservices encapsulated into Open APIs to deliver early explanations as observation for learning model quality assurance. XAIport enables configurable XAI operations along with machine learning development. We quantify the operational costs of incorporating XAI with three cloud computer vision services on Microsoft Azure Cognitive Services",
    "path": "papers/24/03/2403.16858.json",
    "total_tokens": 880,
    "translated_title": "XAIport：用于在AI模型开发中早期采用XAI的服务框架",
    "translated_abstract": "在这项研究中，我们提出了早期采用可解释人工智能（XAI），重点关注三个属性：解释的质量，解释摘要应该在多种XAI方法中保持一致；架构兼容性，为了有效地将XAI集成到XAI中，XAI方法和要解释的模型的架构风格必须与框架兼容；可配置操作，XAI解释是可操作的，类似于机器学习操作。因此，AI模型的解释应该是可重现的和易处理的，才能获得信任。我们提出了XAIport，这是一个将XAI微服务封装成开放API的框架，为学习模型质量保障提供早期解释观察。XAIport使得可配置的XAI操作与机器学习开发相结合。我们量化了在Microsoft Azure Cognitive Services上将XAI与三种云计算机视觉服务整合的运营成本。",
    "tldr": "本研究提出了一种用于早期采用可解释人工智能（XAI）的服务框架XAIport，具有解释质量、架构兼容性和可配置操作三个关键属性，为AI模型的开发提供可信的早期解释。",
    "en_tdlr": "This study introduces a service framework XAIport for the early adoption of Explainable AI (XAI) with key properties of explanation quality, architectural compatibility, and configurable operations, providing trustworthy early explanations for AI model development."
}