{
    "title": "Spectral Invariant Learning for Dynamic Graphs under Distribution Shifts",
    "abstract": "arXiv:2403.05026v1 Announce Type: cross  Abstract: Dynamic graph neural networks (DyGNNs) currently struggle with handling distribution shifts that are inherent in dynamic graphs. Existing work on DyGNNs with out-of-distribution settings only focuses on the time domain, failing to handle cases involving distribution shifts in the spectral domain. In this paper, we discover that there exist cases with distribution shifts unobservable in the time domain while observable in the spectral domain, and propose to study distribution shifts on dynamic graphs in the spectral domain for the first time. However, this investigation poses two key challenges: i) it is non-trivial to capture different graph patterns that are driven by various frequency components entangled in the spectral domain; and ii) it remains unclear how to handle distribution shifts with the discovered spectral patterns. To address these challenges, we propose Spectral Invariant Learning for Dynamic Graphs under Distribution Sh",
    "link": "https://arxiv.org/abs/2403.05026",
    "context": "Title: Spectral Invariant Learning for Dynamic Graphs under Distribution Shifts\nAbstract: arXiv:2403.05026v1 Announce Type: cross  Abstract: Dynamic graph neural networks (DyGNNs) currently struggle with handling distribution shifts that are inherent in dynamic graphs. Existing work on DyGNNs with out-of-distribution settings only focuses on the time domain, failing to handle cases involving distribution shifts in the spectral domain. In this paper, we discover that there exist cases with distribution shifts unobservable in the time domain while observable in the spectral domain, and propose to study distribution shifts on dynamic graphs in the spectral domain for the first time. However, this investigation poses two key challenges: i) it is non-trivial to capture different graph patterns that are driven by various frequency components entangled in the spectral domain; and ii) it remains unclear how to handle distribution shifts with the discovered spectral patterns. To address these challenges, we propose Spectral Invariant Learning for Dynamic Graphs under Distribution Sh",
    "path": "papers/24/03/2403.05026.json",
    "total_tokens": 827,
    "translated_title": "分布漂移下动态图的谱不变学习",
    "translated_abstract": "动态图神经网络（DyGNNs）目前在处理动态图固有的分布漂移时存在困难。现有针对DyGNNs在分布漂移设置中的工作仅关注时间域，未能处理涉及谱域中分布漂移的情况。本文发现存在一些情况，时间域中观察不到的分布漂移却在谱域中可以观察到，并首次提出研究动态图谱域内的分布漂移。然而，这项研究提出了两个关键挑战：i）捕捉谱域中纠缠在一起的不同频率分量驱动的不同图模式并非易事；ii）如何处理与发现的谱模式相关的分布漂移仍不清楚。为解决这些挑战，我们提出了用于处理分布漂移下动态图的谱不变学习方法。",
    "tldr": "该论文首次提出在动态图的谱域内研究分布漂移，并提出了谱不变学习方法来应对谱域中的分布漂移挑战。",
    "en_tdlr": "This paper introduces the study of distribution shifts in the spectral domain for dynamic graphs and proposes a Spectral Invariant Learning method to tackle the challenges of distribution shifts in the spectral domain."
}