{
    "title": "Authorship Attribution in Bangla Literature (AABL) via Transfer Learning using ULMFiT",
    "abstract": "arXiv:2403.05519v1 Announce Type: new  Abstract: Authorship Attribution is the task of creating an appropriate characterization of text that captures the authors' writing style to identify the original author of a given piece of text. With increased anonymity on the internet, this task has become increasingly crucial in various security and plagiarism detection fields. Despite significant advancements in other languages such as English, Spanish, and Chinese, Bangla lacks comprehensive research in this field due to its complex linguistic feature and sentence structure. Moreover, existing systems are not scalable when the number of author increases, and the performance drops for small number of samples per author. In this paper, we propose the use of Average-Stochastic Gradient Descent Weight-Dropped Long Short-Term Memory (AWD-LSTM) architecture and an effective transfer learning approach that addresses the problem of complex linguistic features extraction and scalability for authorship",
    "link": "https://arxiv.org/abs/2403.05519",
    "context": "Title: Authorship Attribution in Bangla Literature (AABL) via Transfer Learning using ULMFiT\nAbstract: arXiv:2403.05519v1 Announce Type: new  Abstract: Authorship Attribution is the task of creating an appropriate characterization of text that captures the authors' writing style to identify the original author of a given piece of text. With increased anonymity on the internet, this task has become increasingly crucial in various security and plagiarism detection fields. Despite significant advancements in other languages such as English, Spanish, and Chinese, Bangla lacks comprehensive research in this field due to its complex linguistic feature and sentence structure. Moreover, existing systems are not scalable when the number of author increases, and the performance drops for small number of samples per author. In this paper, we propose the use of Average-Stochastic Gradient Descent Weight-Dropped Long Short-Term Memory (AWD-LSTM) architecture and an effective transfer learning approach that addresses the problem of complex linguistic features extraction and scalability for authorship",
    "path": "papers/24/03/2403.05519.json",
    "total_tokens": 863,
    "translated_title": "通过使用ULMFiT的迁移学习进行孟加拉文学（AABL）的作者归属",
    "translated_abstract": "作者归属是创建适当的文本特征以捕捉作者写作风格从而识别一段文本的原始作者的任务。随着互联网上的匿名性增加，这一任务在各种安全和抄袭检测领域变得越来越关键。尽管英语、西班牙语和汉语等其他语言取得了显著进展，但由于孟加拉语的复杂语言特征和句子结构，该领域缺乏全面的研究。此外，现有系统在作者数量增加时不具可伸缩性，并且对每位作者样本数量较少时性能下降。本文提出了使用平均随机梯度下降权值丢弃长短期记忆（AWD-LSTM）架构和有效的迁移学习方法，以解决复杂语言特征提取和作者规模问题。",
    "tldr": "该论文提出了使用AWD-LSTM架构和有效的迁移学习方法来解决孟加拉文学中作者归属问题的研究，填补了该领域在复杂语言特征提取和作者规模方面的空白。",
    "en_tdlr": "This paper introduces a study on authorship attribution in Bangla literature using AWD-LSTM architecture and an effective transfer learning approach, filling the gap in complex linguistic feature extraction and author scalability in this field."
}