{
    "title": "Using LLMs for the Extraction and Normalization of Product Attribute Values",
    "abstract": "arXiv:2403.02130v1 Announce Type: new  Abstract: Product offers on e-commerce websites often consist of a textual product title and a textual product description. In order to provide features such as faceted product filtering or content-based product recommendation, the websites need to extract attribute-value pairs from the unstructured product descriptions. This paper explores the potential of using large language models (LLMs), such as OpenAI's GPT-3.5 and GPT-4, to extract and normalize attribute values from product titles and product descriptions. For our experiments, we introduce the WDC Product Attribute-Value Extraction (WDC PAVE) dataset. WDC PAVE consists of product offers from 87 websites that provide schema.org annotations. The offers belong to five different categories, each featuring a specific set of attributes. The dataset provides manually verified attribute-value pairs in two forms: (i) directly extracted values and (ii) normalized attribute values. The normalization ",
    "link": "https://arxiv.org/abs/2403.02130",
    "context": "Title: Using LLMs for the Extraction and Normalization of Product Attribute Values\nAbstract: arXiv:2403.02130v1 Announce Type: new  Abstract: Product offers on e-commerce websites often consist of a textual product title and a textual product description. In order to provide features such as faceted product filtering or content-based product recommendation, the websites need to extract attribute-value pairs from the unstructured product descriptions. This paper explores the potential of using large language models (LLMs), such as OpenAI's GPT-3.5 and GPT-4, to extract and normalize attribute values from product titles and product descriptions. For our experiments, we introduce the WDC Product Attribute-Value Extraction (WDC PAVE) dataset. WDC PAVE consists of product offers from 87 websites that provide schema.org annotations. The offers belong to five different categories, each featuring a specific set of attributes. The dataset provides manually verified attribute-value pairs in two forms: (i) directly extracted values and (ii) normalized attribute values. The normalization ",
    "path": "papers/24/03/2403.02130.json",
    "total_tokens": 825,
    "translated_title": "使用LLMs提取和规范化产品属性值",
    "translated_abstract": "在电子商务网站上的产品提供通常包括文本产品标题和文本产品描述。为了提供诸如分面产品过滤或基于内容的产品推荐等功能，网站需要从非结构化产品描述中提取属性值对。本文探讨了使用大型语言模型（LLMs），如OpenAI的GPT-3.5和GPT-4，从产品标题和产品描述中提取和规范化属性值的潜力。为了进行实验，我们引入了WDC产品属性-值提取（WDC PAVE）数据集。WDC PAVE包含来自提供schema.org注释的87个网站的产品提供。这些提供属于五个不同的类别，每个类别都具有一组特定的属性。该数据集以两种形式提供手动验证的属性-值对：（i）直接提取的值和（ii）规范化的属性值。",
    "tldr": "本文探讨了使用大型语言模型（LLMs）如GPT-3.5和GPT-4从产品标题和描述中提取和规范化属性值的潜力，引入了新的WDC PAVE数据集来支持实验。",
    "en_tdlr": "This paper explores the potential of using large language models (LLMs), such as GPT-3.5 and GPT-4, to extract and normalize attribute values from product titles and descriptions and introduces a new WDC PAVE dataset to support experiments."
}