{
    "title": "Privacy-Protected Spatial Autoregressive Model",
    "abstract": "arXiv:2403.16773v1 Announce Type: cross  Abstract: Spatial autoregressive (SAR) models are important tools for studying network effects. However, with an increasing emphasis on data privacy, data providers often implement privacy protection measures that make classical SAR models inapplicable. In this study, we introduce a privacy-protected SAR model with noise-added response and covariates to meet privacy-protection requirements. However, in this scenario, the traditional quasi-maximum likelihood estimator becomes infeasible because the likelihood function cannot be formulated. To address this issue, we first consider an explicit expression for the likelihood function with only noise-added responses. However, the derivatives are biased owing to the noise in the covariates. Therefore, we develop techniques that can correct the biases introduced by noise. Correspondingly, a Newton-Raphson-type algorithm is proposed to obtain the estimator, leading to a corrected likelihood estimator. To",
    "link": "https://arxiv.org/abs/2403.16773",
    "context": "Title: Privacy-Protected Spatial Autoregressive Model\nAbstract: arXiv:2403.16773v1 Announce Type: cross  Abstract: Spatial autoregressive (SAR) models are important tools for studying network effects. However, with an increasing emphasis on data privacy, data providers often implement privacy protection measures that make classical SAR models inapplicable. In this study, we introduce a privacy-protected SAR model with noise-added response and covariates to meet privacy-protection requirements. However, in this scenario, the traditional quasi-maximum likelihood estimator becomes infeasible because the likelihood function cannot be formulated. To address this issue, we first consider an explicit expression for the likelihood function with only noise-added responses. However, the derivatives are biased owing to the noise in the covariates. Therefore, we develop techniques that can correct the biases introduced by noise. Correspondingly, a Newton-Raphson-type algorithm is proposed to obtain the estimator, leading to a corrected likelihood estimator. To",
    "path": "papers/24/03/2403.16773.json",
    "total_tokens": 877,
    "translated_title": "隐私保护的空间自回归模型",
    "translated_abstract": "空间自回归（SAR）模型是研究网络效应的重要工具。然而，随着对数据隐私的重视增加，数据提供者经常实施隐私保护措施，使传统的SAR模型变得不适用。在本研究中，我们介绍了一种带有添加噪声响应和协变量的隐私保护的SAR模型，以满足隐私保护要求。然而，在这种情况下，由于无法建立似然函数，传统的拟最大似然估计变得不可行。为了解决这个问题，我们首先考虑了只有噪声添加响应的似然函数的显式表达。然而，由于协变量中的噪声，导数是有偏的。因此，我们开发了可以纠正噪声引入的偏差的技术。相应地，提出了一种类似牛顿-拉弗森的算法来获得估计量，从而导致一个修正的似然估计量。",
    "tldr": "提出了一种隐私保护的空间自回归模型，引入了噪声响应和协变量以满足隐私保护要求，并开发了纠正由噪声引入的偏差的技术。",
    "en_tdlr": "Proposed a privacy-protected spatial autoregressive model by introducing noise-added response and covariates to meet privacy-protection requirements, and developed techniques to correct biases introduced by noise."
}