{
    "title": "Rethinking Specificity in SBDD: Leveraging Delta Score and Energy-Guided Diffusion",
    "abstract": "arXiv:2403.12987v1 Announce Type: cross  Abstract: In the field of Structure-based Drug Design (SBDD), deep learning-based generative models have achieved outstanding performance in terms of docking score. However, further study shows that the existing molecular generative methods and docking scores both have lacked consideration in terms of specificity, which means that generated molecules bind to almost every protein pocket with high affinity. To address this, we introduce the Delta Score, a new metric for evaluating the specificity of molecular binding. To further incorporate this insight for generation, we develop an innovative energy-guided approach using contrastive learning, with active compounds as decoys, to direct generative models toward creating molecules with high specificity. Our empirical results show that this method not only enhances the delta score but also maintains or improves traditional docking scores, successfully bridging the gap between SBDD and real-world need",
    "link": "https://arxiv.org/abs/2403.12987",
    "context": "Title: Rethinking Specificity in SBDD: Leveraging Delta Score and Energy-Guided Diffusion\nAbstract: arXiv:2403.12987v1 Announce Type: cross  Abstract: In the field of Structure-based Drug Design (SBDD), deep learning-based generative models have achieved outstanding performance in terms of docking score. However, further study shows that the existing molecular generative methods and docking scores both have lacked consideration in terms of specificity, which means that generated molecules bind to almost every protein pocket with high affinity. To address this, we introduce the Delta Score, a new metric for evaluating the specificity of molecular binding. To further incorporate this insight for generation, we develop an innovative energy-guided approach using contrastive learning, with active compounds as decoys, to direct generative models toward creating molecules with high specificity. Our empirical results show that this method not only enhances the delta score but also maintains or improves traditional docking scores, successfully bridging the gap between SBDD and real-world need",
    "path": "papers/24/03/2403.12987.json",
    "total_tokens": 838,
    "translated_title": "重新思考SBDD中的特异性：利用Delta分数和能量引导扩散",
    "translated_abstract": "在结构基药物设计（SBDD）领域，基于深度学习的生成模型在对接得分方面取得了出色的表现。然而，进一步研究表明，现有的分子生成方法和对接得分在特异性方面缺乏考虑，这意味着生成的分子几乎与每个蛋白质口袋结合并具有较高的亲和力。为了解决这个问题，我们引入了Delta分数，这是一种用于评估分子结合特异性的新度量标准。为了进一步将这一见解融入生成过程中，我们开发了一种创新的基于能量引导的方法，使用对比学习，通过将活性化合物作为诱饵，引导生成模型创造具有高特异性的分子。我们的实证结果表明，这种方法不仅增强了Delta分数，还保持或改善了传统的对接得分，成功地弥合了SBDD和现实需求之间的鸿沟。",
    "tldr": "引入Delta分数，开发基于能量引导的方法，成功提高了分子结合的特异性，同时保持或改善了传统的对接得分",
    "en_tdlr": "Introducing Delta Score and developing an energy-guided approach to enhance molecular specificity while maintaining or improving traditional docking scores in SBDD."
}