{
    "title": "A Compositional Typed Semantics for Universal Dependencies",
    "abstract": "arXiv:2403.01187v1 Announce Type: new  Abstract: Languages may encode similar meanings using different sentence structures. This makes it a challenge to provide a single set of formal rules that can derive meanings from sentences in many languages at once. To overcome the challenge, we can take advantage of language-general connections between meaning and syntax, and build on cross-linguistically parallel syntactic structures. We introduce UD Type Calculus, a compositional, principled, and language-independent system of semantic types and logical forms for lexical items which builds on a widely-used language-general dependency syntax framework. We explain the essential features of UD Type Calculus, which all involve giving dependency relations denotations just like those of words. These allow UD-TC to derive correct meanings for sentences with a wide range of syntactic structures by making use of dependency labels. Finally, we present evaluation results on a large existing corpus of se",
    "link": "https://arxiv.org/abs/2403.01187",
    "context": "Title: A Compositional Typed Semantics for Universal Dependencies\nAbstract: arXiv:2403.01187v1 Announce Type: new  Abstract: Languages may encode similar meanings using different sentence structures. This makes it a challenge to provide a single set of formal rules that can derive meanings from sentences in many languages at once. To overcome the challenge, we can take advantage of language-general connections between meaning and syntax, and build on cross-linguistically parallel syntactic structures. We introduce UD Type Calculus, a compositional, principled, and language-independent system of semantic types and logical forms for lexical items which builds on a widely-used language-general dependency syntax framework. We explain the essential features of UD Type Calculus, which all involve giving dependency relations denotations just like those of words. These allow UD-TC to derive correct meanings for sentences with a wide range of syntactic structures by making use of dependency labels. Finally, we present evaluation results on a large existing corpus of se",
    "path": "papers/24/03/2403.01187.json",
    "total_tokens": 860,
    "translated_title": "通用依存关系的组合式类型语义",
    "translated_abstract": "语言可能使用不同的句子结构来编码类似的含义。这使得提供一个可以一次性从多种语言句子中推导含义的单一形式规则集变得具有挑战性。为了克服这一挑战，我们可以利用语言通用的意义和句法之间的联系，构建跨语言平行的句法结构。我们引入了UD类型演算，这是一个基于广泛使用的语言通用依存句法框架的语义类型和逻辑形式的组合、原则性和与语言无关系统。我们解释了UD类型演算的基本特征，这些特征都涉及给予依存关系与单词类似的指称。这使得UD-TC能够通过利用依存标签推导具有各种句法结构的句子的正确含义。最后，我们在一个大型现有语料库上呈现评估结果。",
    "tldr": "UD类型演算是一个基于广泛使用的语言通用依存句法框架的语义类型和逻辑形式的组合、原则性和与语言无关系统，通过利用依存标签推导具有各种句法结构的句子的正确含义。",
    "en_tdlr": "UD Type Calculus is a compositional, principled, and language-independent system of semantic types and logical forms for lexical items which builds on a widely-used language-general dependency syntax framework, deriving correct meanings for sentences with a wide range of syntactic structures by making use of dependency labels."
}