{
    "title": "Enhancing Manufacturing Quality Prediction Models through the Integration of Explainability Methods",
    "abstract": "arXiv:2403.18731v1 Announce Type: new  Abstract: This research presents a method that utilizes explainability techniques to amplify the performance of machine learning (ML) models in forecasting the quality of milling processes, as demonstrated in this paper through a manufacturing use case. The methodology entails the initial training of ML models, followed by a fine-tuning phase where irrelevant features identified through explainability methods are eliminated. This procedural refinement results in performance enhancements, paving the way for potential reductions in manufacturing costs and a better understanding of the trained ML models. This study highlights the usefulness of explainability techniques in both explaining and optimizing predictive models in the manufacturing realm.",
    "link": "https://arxiv.org/abs/2403.18731",
    "context": "Title: Enhancing Manufacturing Quality Prediction Models through the Integration of Explainability Methods\nAbstract: arXiv:2403.18731v1 Announce Type: new  Abstract: This research presents a method that utilizes explainability techniques to amplify the performance of machine learning (ML) models in forecasting the quality of milling processes, as demonstrated in this paper through a manufacturing use case. The methodology entails the initial training of ML models, followed by a fine-tuning phase where irrelevant features identified through explainability methods are eliminated. This procedural refinement results in performance enhancements, paving the way for potential reductions in manufacturing costs and a better understanding of the trained ML models. This study highlights the usefulness of explainability techniques in both explaining and optimizing predictive models in the manufacturing realm.",
    "path": "papers/24/03/2403.18731.json",
    "total_tokens": 732,
    "translated_title": "通过集成可解释性方法增强制造质量预测模型",
    "translated_abstract": "这项研究提出了一种利用可解释性技术来增强机器学习（ML）模型在预测铣削过程质量方面表现的方法，通过一个制造业案例展示了这一点。该方法包括首先训练ML模型，然后通过可解释性方法识别并消除无关特征进行微调。这种过程的完善结果导致性能的提升，为降低制造成本和更好理解训练后的ML模型铺平了道路。该研究突出了可解释性技术在解释和优化制造领域预测模型中的用处。",
    "tldr": "该研究提出了一种利用可解释性技术来增强制造质量预测模型性能的方法，通过消除无关特征进行微调，提高了性能，为降低制造成本和更好理解训练后的模型铺平了道路。",
    "en_tdlr": "This research presents a method that enhances the performance of manufacturing quality prediction models by utilizing explainability techniques, fine-tuning the models by eliminating irrelevant features, leading to performance improvements, cost reductions, and better understanding of the trained models."
}