{
    "title": "Conversational Grounding: Annotation and Analysis of Grounding Acts and Grounding Units",
    "abstract": "arXiv:2403.16609v1 Announce Type: new  Abstract: Successful conversations often rest on common understanding, where all parties are on the same page about the information being shared. This process, known as conversational grounding, is crucial for building trustworthy dialog systems that can accurately keep track of and recall the shared information. The proficiencies of an agent in grounding the conveyed information significantly contribute to building a reliable dialog system. Despite recent advancements in dialog systems, there exists a noticeable deficit in their grounding capabilities. Traum provided a framework for conversational grounding introducing Grounding Acts and Grounding Units, but substantial progress, especially in the realm of Large Language Models, remains lacking. To bridge this gap, we present the annotation of two dialog corpora employing Grounding Acts, Grounding Units, and a measure of their degree of grounding. We discuss our key findings during the annotation",
    "link": "https://arxiv.org/abs/2403.16609",
    "context": "Title: Conversational Grounding: Annotation and Analysis of Grounding Acts and Grounding Units\nAbstract: arXiv:2403.16609v1 Announce Type: new  Abstract: Successful conversations often rest on common understanding, where all parties are on the same page about the information being shared. This process, known as conversational grounding, is crucial for building trustworthy dialog systems that can accurately keep track of and recall the shared information. The proficiencies of an agent in grounding the conveyed information significantly contribute to building a reliable dialog system. Despite recent advancements in dialog systems, there exists a noticeable deficit in their grounding capabilities. Traum provided a framework for conversational grounding introducing Grounding Acts and Grounding Units, but substantial progress, especially in the realm of Large Language Models, remains lacking. To bridge this gap, we present the annotation of two dialog corpora employing Grounding Acts, Grounding Units, and a measure of their degree of grounding. We discuss our key findings during the annotation",
    "path": "papers/24/03/2403.16609.json",
    "total_tokens": 846,
    "translated_title": "对话接地：关于接地行为和接地单元的注释与分析",
    "translated_abstract": "成功的对话通常建立在共同理解的基础上，所有参与方对所共享的信息心领神会。这个被称为对话接地的过程对于构建可靠的对话系统至关重要，能够准确追踪和回忆所分享的信息。代理在接地传达的信息方面的熟练程度对于构建可靠的对话系统有着重要贡献。尽管对话系统在最近取得了进展，但它们的接地能力仍然存在明显的不足。Traum提出了一个关于对话接地的框架，介绍了接地行为和接地单元，但在大型语言模型领域，特别是在大规模语言模型领域，尚未取得实质性进展。为了弥补这一差距，我们提出了对两个对话语料库进行注释，利用接地行为、接地单元以及它们的接地程度的度量。我们讨论了我们在注释过程中的关键发现。",
    "tldr": "对话系统的可靠性建设中，通过引入接地行为和接地单元的标注和度量，填补了现有对话系统在接地能力上的不足。",
    "en_tdlr": "An annotation and measurement of Grounding Acts and Grounding Units in two dialogue corpora address the deficiency in grounding capabilities of existing dialog systems, contributing to the reliability of dialogue systems."
}