{
    "title": "Unifying and Certifying Top-Quality Planning",
    "abstract": "arXiv:2403.03176v1 Announce Type: new  Abstract: The growing utilization of planning tools in practical scenarios has sparked an interest in generating multiple high-quality plans. Consequently, a range of computational problems under the general umbrella of top-quality planning were introduced over a short time period, each with its own definition. In this work, we show that the existing definitions can be unified into one, based on a dominance relation. The different computational problems, therefore, simply correspond to different dominance relations. Given the unified definition, we can now certify the top-quality of the solutions, leveraging existing certification of unsolvability and optimality. We show that task transformations found in the existing literature can be employed for the efficient certification of various top-quality planning problems and propose a novel transformation to efficiently certify loopless top-quality planning.",
    "link": "https://arxiv.org/abs/2403.03176",
    "context": "Title: Unifying and Certifying Top-Quality Planning\nAbstract: arXiv:2403.03176v1 Announce Type: new  Abstract: The growing utilization of planning tools in practical scenarios has sparked an interest in generating multiple high-quality plans. Consequently, a range of computational problems under the general umbrella of top-quality planning were introduced over a short time period, each with its own definition. In this work, we show that the existing definitions can be unified into one, based on a dominance relation. The different computational problems, therefore, simply correspond to different dominance relations. Given the unified definition, we can now certify the top-quality of the solutions, leveraging existing certification of unsolvability and optimality. We show that task transformations found in the existing literature can be employed for the efficient certification of various top-quality planning problems and propose a novel transformation to efficiently certify loopless top-quality planning.",
    "path": "papers/24/03/2403.03176.json",
    "total_tokens": 798,
    "translated_title": "统一并认证高质量规划",
    "translated_abstract": "实际场景中对规划工具的日益利用引发了对生成多个高质量计划的兴趣。因此，在短时间内引入了一系列涵盖顶级质量规划的计算问题，每个都有自己的定义。在这项工作中，我们展示了现有的定义可以统一为基于支配关系的一个定义。因此，不同的计算问题简单地对应于不同的支配关系。在给定统一定义的情况下，我们现在可以证明解决方案的高质量，利用现有的不可解性和最优性认证。我们展示了现有文献中发现的任务转换可用于有效认证各种高质量规划问题，并提出了一个新的转换来有效地认证无环高质量规划。",
    "tldr": "现有的高质量规划定义可以统一为基于支配关系的一个定义，从而实现认证解决方案的高质量，并提出了有效认证各种高质量规划问题的方法，并且提出了一种新的转换来有效地认证无环高质量规划。",
    "en_tdlr": "Existing definitions of top-quality planning can be unified into one based on a dominance relation, enabling the certification of top-quality solutions, proposing efficient certification methods for various top-quality planning problems, and introducing a novel transformation for certifying loopless top-quality planning."
}