{
    "title": "Collision Avoidance Verification of Multiagent Systems with Learned Policies",
    "abstract": "arXiv:2403.03314v1 Announce Type: cross  Abstract: For many multiagent control problems, neural networks (NNs) have enabled promising new capabilities. However, many of these systems lack formal guarantees (e.g., collision avoidance, robustness), which prevents leveraging these advances in safety-critical settings. While there is recent work on formal verification of NN-controlled systems, most existing techniques cannot handle scenarios with more than one agent. To address this research gap, this paper presents a backward reachability-based approach for verifying the collision avoidance properties of Multi-Agent Neural Feedback Loops (MA-NFLs). Given the dynamics models and trained control policies of each agent, the proposed algorithm computes relative backprojection sets by solving a series of Mixed Integer Linear Programs (MILPs) offline for each pair of agents. Our pair-wise approach is parallelizable and thus scales well with increasing number of agents, and we account for state ",
    "link": "https://arxiv.org/abs/2403.03314",
    "context": "Title: Collision Avoidance Verification of Multiagent Systems with Learned Policies\nAbstract: arXiv:2403.03314v1 Announce Type: cross  Abstract: For many multiagent control problems, neural networks (NNs) have enabled promising new capabilities. However, many of these systems lack formal guarantees (e.g., collision avoidance, robustness), which prevents leveraging these advances in safety-critical settings. While there is recent work on formal verification of NN-controlled systems, most existing techniques cannot handle scenarios with more than one agent. To address this research gap, this paper presents a backward reachability-based approach for verifying the collision avoidance properties of Multi-Agent Neural Feedback Loops (MA-NFLs). Given the dynamics models and trained control policies of each agent, the proposed algorithm computes relative backprojection sets by solving a series of Mixed Integer Linear Programs (MILPs) offline for each pair of agents. Our pair-wise approach is parallelizable and thus scales well with increasing number of agents, and we account for state ",
    "path": "papers/24/03/2403.03314.json",
    "total_tokens": 943,
    "translated_title": "基于学习策略的多智能体系统碰撞避免验证",
    "translated_abstract": "对于许多多智能体控制问题，神经网络（NN）已经实现了有前途的新能力。然而，许多这些系统缺乏正式的保证（例如，碰撞避免、鲁棒性），这阻止了在安全关键环境中利用这些进展。鉴于现有技术不能处理多于一个智能体的情况，为了填补这一研究空白，本论文提出了一种用于验证多智能体神经反馈环路（MA-NFLs）的碰撞避免属性的基于向后可达性的方法。通过给定每个智能体的动力学模型和训练控制策略，所提出的算法通过离线为每对智能体解决一系列混合整数线性规划（MILPs）来计算相对反投影集。我们的逐对方法可并行化，从而可以很好地随着智能体数量的增加而扩展，并且我们考虑了状态。",
    "tldr": "该论文提出了一种基于向后可达性的方法，用于验证多智能体神经反馈环路的碰撞避免属性，通过解决一系列混合整数线性规划计算相对反投影集，并且该逐对方法可并行化，随着智能体数量的增加能够很好地扩展",
    "en_tdlr": "This paper presents a backward reachability-based approach for verifying the collision avoidance properties of Multi-Agent Neural Feedback Loops (MA-NFLs) by computing relative backprojection sets using a series of Mixed Integer Linear Programs (MILPs) offline for each pair of agents. The pairwise approach is parallelizable, scales well with an increasing number of agents."
}