{
    "title": "Cyber-Security Knowledge Graph Generation by Hierarchical Nonnegative Matrix Factorization",
    "abstract": "arXiv:2403.16222v1 Announce Type: new  Abstract: Much of human knowledge in cybersecurity is encapsulated within the ever-growing volume of scientific papers. As this textual data continues to expand, the importance of document organization methods becomes increasingly crucial for extracting actionable insights hidden within large text datasets. Knowledge Graphs (KGs) serve as a means to store factual information in a structured manner, providing explicit, interpretable knowledge that includes domain-specific information from the cybersecurity scientific literature. One of the challenges in constructing a KG from scientific literature is the extraction of ontology from unstructured text. In this paper, we address this topic and introduce a method for building a multi-modal KG by extracting structured ontology from scientific papers. We demonstrate this concept in the cybersecurity domain. One modality of the KG represents observable information from the papers, such as the categories i",
    "link": "https://arxiv.org/abs/2403.16222",
    "context": "Title: Cyber-Security Knowledge Graph Generation by Hierarchical Nonnegative Matrix Factorization\nAbstract: arXiv:2403.16222v1 Announce Type: new  Abstract: Much of human knowledge in cybersecurity is encapsulated within the ever-growing volume of scientific papers. As this textual data continues to expand, the importance of document organization methods becomes increasingly crucial for extracting actionable insights hidden within large text datasets. Knowledge Graphs (KGs) serve as a means to store factual information in a structured manner, providing explicit, interpretable knowledge that includes domain-specific information from the cybersecurity scientific literature. One of the challenges in constructing a KG from scientific literature is the extraction of ontology from unstructured text. In this paper, we address this topic and introduce a method for building a multi-modal KG by extracting structured ontology from scientific papers. We demonstrate this concept in the cybersecurity domain. One modality of the KG represents observable information from the papers, such as the categories i",
    "path": "papers/24/03/2403.16222.json",
    "total_tokens": 785,
    "translated_title": "基于分层非负矩阵分解的网络安全知识图生成",
    "translated_abstract": "许多网络安全领域的人类知识都被封装在不断增长的科学论文中。随着这些文本数据的不断扩大，文档组织方法的重要性变得日益关键，用于从大型文本数据集中提取隐藏的可行见解。知识图（KGs）作为一种以结构化方式存储实际信息的手段，提供包括来自网络安全科学文献的领域特定信息在内的明确、可解释的知识。构建从科学文献中的知识图是提取本体的一个挑战。在本文中，我们讨论了这个主题，并介绍了一种通过从科学论文中提取结构化本体来构建多模态KG的方法。我们在网络安全领域展示了这一概念。KG的一种模态代表了论文中的可观察信息，如目录等",
    "tldr": "本文介绍了一种通过从科学论文中提取结构化本体来构建网络安全领域多模态知识图的方法",
    "en_tdlr": "This paper presents a method for building a multi-modal knowledge graph in the cybersecurity domain by extracting structured ontology from scientific papers."
}