{
    "title": "EL-MLFFs: Ensemble Learning of Machine Leaning Force Fields",
    "abstract": "arXiv:2403.17507v1 Announce Type: new  Abstract: Machine learning force fields (MLFFs) have emerged as a promising approach to bridge the accuracy of quantum mechanical methods and the efficiency of classical force fields. However, the abundance of MLFF models and the challenge of accurately predicting atomic forces pose significant obstacles in their practical application. In this paper, we propose a novel ensemble learning framework, EL-MLFFs, which leverages the stacking method to integrate predictions from diverse MLFFs and enhance force prediction accuracy. By constructing a graph representation of molecular structures and employing a graph neural network (GNN) as the meta-model, EL-MLFFs effectively captures atomic interactions and refines force predictions. We evaluate our approach on two distinct datasets: methane molecules and methanol adsorbed on a Cu(100) surface. The results demonstrate that EL-MLFFs significantly improves force prediction accuracy compared to individual ML",
    "link": "https://arxiv.org/abs/2403.17507",
    "context": "Title: EL-MLFFs: Ensemble Learning of Machine Leaning Force Fields\nAbstract: arXiv:2403.17507v1 Announce Type: new  Abstract: Machine learning force fields (MLFFs) have emerged as a promising approach to bridge the accuracy of quantum mechanical methods and the efficiency of classical force fields. However, the abundance of MLFF models and the challenge of accurately predicting atomic forces pose significant obstacles in their practical application. In this paper, we propose a novel ensemble learning framework, EL-MLFFs, which leverages the stacking method to integrate predictions from diverse MLFFs and enhance force prediction accuracy. By constructing a graph representation of molecular structures and employing a graph neural network (GNN) as the meta-model, EL-MLFFs effectively captures atomic interactions and refines force predictions. We evaluate our approach on two distinct datasets: methane molecules and methanol adsorbed on a Cu(100) surface. The results demonstrate that EL-MLFFs significantly improves force prediction accuracy compared to individual ML",
    "path": "papers/24/03/2403.17507.json",
    "total_tokens": 847,
    "translated_title": "EL-MLFFs：机器学习力场的集成学习",
    "translated_abstract": "机器学习力场（MLFFs）已经成为一种有希望的方法，可以弥合量子力学方法的精确性和经典力场的效率。然而，MLFF模型的丰富性和准确预测原子力的挑战给它们的实际应用带来了重大障碍。在本文中，我们提出了一种新颖的集成学习框架EL-MLFFs，利用堆叠方法整合来自不同MLFFs的预测，增强力预测准确性。通过构建分子结构的图表示并采用图神经网络（GNN）作为元模型，EL-MLFFs有效地捕捉原子间相互作用并改进力的预测。我们在两个不同的数据集上评估了我们的方法：甲烷分子和吸附在Cu（100）表面上的甲醇。结果表明，EL-MLFFs相对于单个MLFF显著提高了力预测准确性。",
    "tldr": "提出了一种新颖的集成学习框架EL-MLFFs，利用堆叠方法整合来自不同MLFFs的预测，从而提高力预测准确性。",
    "en_tdlr": "Introduced a novel ensemble learning framework EL-MLFFs, which leverages the stacking method to integrate predictions from diverse MLFFs and enhance force prediction accuracy."
}