{
    "title": "OntoChat: a Framework for Conversational Ontology Engineering using Language Models",
    "abstract": "arXiv:2403.05921v1 Announce Type: new  Abstract: Ontology engineering (OE) in large projects poses a number of challenges arising from the heterogeneous backgrounds of the various stakeholders, domain experts, and their complex interactions with ontology designers. This multi-party interaction often creates systematic ambiguities and biases from the elicitation of ontology requirements, which directly affect the design, evaluation and may jeopardise the target reuse. Meanwhile, current OE methodologies strongly rely on manual activities (e.g., interviews, discussion pages). After collecting evidence on the most crucial OE activities, we introduce OntoChat, a framework for conversational ontology engineering that supports requirement elicitation, analysis, and testing. By interacting with a conversational agent, users can steer the creation of user stories and the extraction of competency questions, while receiving computational support to analyse the overall requirements and test early",
    "link": "https://arxiv.org/abs/2403.05921",
    "context": "Title: OntoChat: a Framework for Conversational Ontology Engineering using Language Models\nAbstract: arXiv:2403.05921v1 Announce Type: new  Abstract: Ontology engineering (OE) in large projects poses a number of challenges arising from the heterogeneous backgrounds of the various stakeholders, domain experts, and their complex interactions with ontology designers. This multi-party interaction often creates systematic ambiguities and biases from the elicitation of ontology requirements, which directly affect the design, evaluation and may jeopardise the target reuse. Meanwhile, current OE methodologies strongly rely on manual activities (e.g., interviews, discussion pages). After collecting evidence on the most crucial OE activities, we introduce OntoChat, a framework for conversational ontology engineering that supports requirement elicitation, analysis, and testing. By interacting with a conversational agent, users can steer the creation of user stories and the extraction of competency questions, while receiving computational support to analyse the overall requirements and test early",
    "path": "papers/24/03/2403.05921.json",
    "total_tokens": 825,
    "translated_title": "OntoChat: 一种使用语言模型进行对话本体工程的框架",
    "translated_abstract": "大型项目中的本体工程(OE)面临着许多挑战，其中的挑战源于各方利益相关者、领域专家及其与本体设计者的复杂互动背景的异质性。这种多方互动经常会在本体需求的引申中产生系统性的歧义和偏见，直接影响设计、评估并可能危及目标的重复使用性。与此同时，目前的OE方法强烈依赖于手工活动（如采访、讨论页面）。在收集了关于最关键OE活动的证据后，我们引入了OntoChat，这是一个支持需求引申、分析和测试的对话本体工程框架。通过与对话代理进行互动，用户可以引导用户故事的创建和能力问题的提取，同时接收计算支持以分析整体需求并进行早期测试。",
    "tldr": "OntoChat是一个支持对话本体工程的框架，通过与对话代理互动，用户可以引导用户故事的创建和能力问题的提取，同时接收计算支持以分析整体需求并进行早期测试。",
    "en_tdlr": "OntoChat is a framework that supports conversational ontology engineering, allowing users to create user stories, extract competency questions, and receive computational support for analyzing overall requirements and conducting early testing through interaction with a conversational agent."
}