{
    "title": "Abductive Ego-View Accident Video Understanding for Safe Driving Perception",
    "abstract": "arXiv:2403.00436v1 Announce Type: cross  Abstract: We present MM-AU, a novel dataset for Multi-Modal Accident video Understanding. MM-AU contains 11,727 in-the-wild ego-view accident videos, each with temporally aligned text descriptions. We annotate over 2.23 million object boxes and 58,650 pairs of video-based accident reasons, covering 58 accident categories. MM-AU supports various accident understanding tasks, particularly multimodal video diffusion to understand accident cause-effect chains for safe driving. With MM-AU, we present an Abductive accident Video understanding framework for Safe Driving perception (AdVersa-SD). AdVersa-SD performs video diffusion via an Object-Centric Video Diffusion (OAVD) method which is driven by an abductive CLIP model. This model involves a contrastive interaction loss to learn the pair co-occurrence of normal, near-accident, accident frames with the corresponding text descriptions, such as accident reasons, prevention advice, and accident categor",
    "link": "https://arxiv.org/abs/2403.00436",
    "context": "Title: Abductive Ego-View Accident Video Understanding for Safe Driving Perception\nAbstract: arXiv:2403.00436v1 Announce Type: cross  Abstract: We present MM-AU, a novel dataset for Multi-Modal Accident video Understanding. MM-AU contains 11,727 in-the-wild ego-view accident videos, each with temporally aligned text descriptions. We annotate over 2.23 million object boxes and 58,650 pairs of video-based accident reasons, covering 58 accident categories. MM-AU supports various accident understanding tasks, particularly multimodal video diffusion to understand accident cause-effect chains for safe driving. With MM-AU, we present an Abductive accident Video understanding framework for Safe Driving perception (AdVersa-SD). AdVersa-SD performs video diffusion via an Object-Centric Video Diffusion (OAVD) method which is driven by an abductive CLIP model. This model involves a contrastive interaction loss to learn the pair co-occurrence of normal, near-accident, accident frames with the corresponding text descriptions, such as accident reasons, prevention advice, and accident categor",
    "path": "papers/24/03/2403.00436.json",
    "total_tokens": 731,
    "translated_title": "Abductive Ego-View事故视频理解以实现安全驾驶感知",
    "translated_abstract": "我们介绍了MM-AU，这是一个用于多模态事故视频理解的新数据集。MM-AU包含11,727个野外自我视角事故视频，每个视频配有时间上对齐的文本描述。我们标注了超过223万个物体框和58,650对基于视频的事故原因，涵盖了58种事故类别。MM-AU支持各种事故理解任务，特别是多模态视频扩散以理解安全驾驶的事故因果链。",
    "tldr": "提出了MM-AU数据集，用于多模态事故视频理解，支持各种事故理解任务，特别是多模态视频扩散以理解安全驾驶的事故因果链。",
    "en_tdlr": "Introduced the MM-AU dataset for multi-modal accident video understanding, supporting various accident understanding tasks, particularly multimodal video diffusion for understanding the cause-effect chains of accidents for safe driving."
}