{
    "title": "Can Language Beat Numerical Regression? Language-Based Multimodal Trajectory Prediction",
    "abstract": "arXiv:2403.18447v1 Announce Type: new  Abstract: Language models have demonstrated impressive ability in context understanding and generative performance. Inspired by the recent success of language foundation models, in this paper, we propose LMTraj (Language-based Multimodal Trajectory predictor), which recasts the trajectory prediction task into a sort of question-answering problem. Departing from traditional numerical regression models, which treat the trajectory coordinate sequence as continuous signals, we consider them as discrete signals like text prompts. Specially, we first transform an input space for the trajectory coordinate into the natural language space. Here, the entire time-series trajectories of pedestrians are converted into a text prompt, and scene images are described as text information through image captioning. The transformed numerical and image data are then wrapped into the question-answering template for use in a language model. Next, to guide the language mo",
    "link": "https://arxiv.org/abs/2403.18447",
    "context": "Title: Can Language Beat Numerical Regression? Language-Based Multimodal Trajectory Prediction\nAbstract: arXiv:2403.18447v1 Announce Type: new  Abstract: Language models have demonstrated impressive ability in context understanding and generative performance. Inspired by the recent success of language foundation models, in this paper, we propose LMTraj (Language-based Multimodal Trajectory predictor), which recasts the trajectory prediction task into a sort of question-answering problem. Departing from traditional numerical regression models, which treat the trajectory coordinate sequence as continuous signals, we consider them as discrete signals like text prompts. Specially, we first transform an input space for the trajectory coordinate into the natural language space. Here, the entire time-series trajectories of pedestrians are converted into a text prompt, and scene images are described as text information through image captioning. The transformed numerical and image data are then wrapped into the question-answering template for use in a language model. Next, to guide the language mo",
    "path": "papers/24/03/2403.18447.json",
    "total_tokens": 961,
    "translated_title": "语言能否胜过数值回归？基于语言的多模态轨迹预测",
    "translated_abstract": "arXiv:2403.18447v1 公告类型：新摘要：语言模型展示了在上下文理解和生成性能方面令人印象深刻的能力。受到近期语言基础模型成功的启发，在本文中，我们提出了LMTraj（基于语言的多模态轨迹预测器），将轨迹预测任务重新设计为一种类似于问答问题的形式。与传统的将轨迹坐标序列视为连续信号的数值回归模型不同，我们将其视为类似于文本提示的离散信号。特别地，我们首先将轨迹坐标的输入空间转换成自然语言空间。在这里，行人的整个时间序列轨迹被转换为一个文本提示，场景图像通过图像字幕被描述为文本信息。然后，转换后的数值和图像数据被包装进问答模板中，供语言模型使用。接下来，为了引导语言模型继续生成与轨迹相关的多模态预测，我们提出了一种联合训练策略，同时优化文本和图像的编码器和解码器。",
    "tldr": "本文提出了LMTraj（基于语言的多模态轨迹预测器），将轨迹预测任务转化为一种类似于问答问题的形式，通过将数值和图像数据转换为自然语言空间来引导语言模型继续生成与轨迹相关的多模态预测。",
    "en_tdlr": "This paper introduces LMTraj (Language-based Multimodal Trajectory predictor), transforming the trajectory prediction task into a question-answering format by converting numerical and image data into natural language space to guide the language model to generate multimodal predictions related to trajectories."
}