{
    "title": "Qubit-Wise Architecture Search Method for Variational Quantum Circuits",
    "abstract": "arXiv:2403.04268v1 Announce Type: cross  Abstract: Considering the noise level limit, one crucial aspect for quantum machine learning is to design a high-performing variational quantum circuit architecture with small number of quantum gates. As the classical neural architecture search (NAS), quantum architecture search methods (QAS) employ methods like reinforcement learning, evolutionary algorithms and supernet optimiza-tion to improve the search efficiency. In this paper, we propose a novel qubit-wise architec-ture search (QWAS) method, which progres-sively search one-qubit configuration per stage, and combine with Monte Carlo Tree Search al-gorithm to find good quantum architectures by partitioning the search space into several good and bad subregions. The numerical experimental results indicate that our proposed method can balance the exploration and exploitation of cir-cuit performance and size in some real-world tasks, such as MNIST, Fashion and MOSI. As far as we know, QWAS achi",
    "link": "https://arxiv.org/abs/2403.04268",
    "context": "Title: Qubit-Wise Architecture Search Method for Variational Quantum Circuits\nAbstract: arXiv:2403.04268v1 Announce Type: cross  Abstract: Considering the noise level limit, one crucial aspect for quantum machine learning is to design a high-performing variational quantum circuit architecture with small number of quantum gates. As the classical neural architecture search (NAS), quantum architecture search methods (QAS) employ methods like reinforcement learning, evolutionary algorithms and supernet optimiza-tion to improve the search efficiency. In this paper, we propose a novel qubit-wise architec-ture search (QWAS) method, which progres-sively search one-qubit configuration per stage, and combine with Monte Carlo Tree Search al-gorithm to find good quantum architectures by partitioning the search space into several good and bad subregions. The numerical experimental results indicate that our proposed method can balance the exploration and exploitation of cir-cuit performance and size in some real-world tasks, such as MNIST, Fashion and MOSI. As far as we know, QWAS achi",
    "path": "papers/24/03/2403.04268.json",
    "total_tokens": 855,
    "translated_title": "Qubit-Wise架构搜索方法用于变分量子电路",
    "translated_abstract": "考虑到噪音级别的限制，量子机器学习的一个关键方面是设计一个具有较少量子门的高性能变分量子电路架构。与经典神经架构搜索（NAS）类似，量子架构搜索方法（QAS）采用强化学习、进化算法和超网优化等方法来提高搜索效率。本文提出了一种新颖的Qubit-Wise架构搜索（QWAS）方法，逐步搜索每个阶段的一量子位配置，并结合蒙特卡罗树搜索算法通过将搜索空间划分为几个良好和不良子区域来找到良好的量子架构。数值实验结果表明，我们提出的方法可以在一些现实任务中（如MNIST、时尚和MOSI等）平衡电路性能和大小的探索与开发。据我们所知，QWAS达到",
    "tldr": "提出了一种新颖的QWAS方法，通过逐步搜索每个阶段的一量子位配置，并结合蒙特卡罗树搜索算法，实现了在一些实际任务中平衡电路性能和大小的探索与开发。",
    "en_tdlr": "Proposed a novel QWAS method that progressively searches one-qubit configuration per stage and combines with Monte Carlo Tree Search algorithm, achieving a balance between the exploration and exploitation of circuit performance and size in some real-world tasks."
}