{
    "title": "Gentrification, displacement, and income trajectory of incumbents",
    "abstract": "arXiv:2403.10614v1 Announce Type: new  Abstract: Gentrification is associated with rapid demographic changes within inner-city neighborhoods. While many fear that gentrification drives low-income people from their homes and communities, there is limited evidence of the consequences of these changes. I use Canadian administrative tax files to track the movements of incumbent workers and their income trajectory as their neighborhood gentrifies. I exploit the timing at which neighborhoods gentrify in a matched staggered event-study framework. I find no evidence of displacement effects, even for low socioeconomic status households. In fact, families living in gentrifying neighborhoods are more likely to stay longer. I suggest that this might be related to tenant rights protection laws. When they endogenously decide to leave, low-income families do not relocate to worse neighborhoods. Finally, I find no adverse effects on their income trajectory, suggesting no repercussions on their labor m",
    "link": "https://arxiv.org/abs/2403.10614",
    "context": "Title: Gentrification, displacement, and income trajectory of incumbents\nAbstract: arXiv:2403.10614v1 Announce Type: new  Abstract: Gentrification is associated with rapid demographic changes within inner-city neighborhoods. While many fear that gentrification drives low-income people from their homes and communities, there is limited evidence of the consequences of these changes. I use Canadian administrative tax files to track the movements of incumbent workers and their income trajectory as their neighborhood gentrifies. I exploit the timing at which neighborhoods gentrify in a matched staggered event-study framework. I find no evidence of displacement effects, even for low socioeconomic status households. In fact, families living in gentrifying neighborhoods are more likely to stay longer. I suggest that this might be related to tenant rights protection laws. When they endogenously decide to leave, low-income families do not relocate to worse neighborhoods. Finally, I find no adverse effects on their income trajectory, suggesting no repercussions on their labor m",
    "path": "papers/24/03/2403.10614.json",
    "total_tokens": 934,
    "translated_title": "城市翻新、被迫迁移和居民收入轨迹",
    "translated_abstract": "城市翻新与内城社区中人口快速变化密切相关。尽管许多人担心城市翻新会迫使低收入者离开他们的家园和社区，但关于这些变化后果的证据有限。作者使用加拿大行政税务档案追踪现有工人的流动情况及其收入轨迹，当他们所在的社区进行翻新。作者利用社区翻新的时间点，建立了一种匹配的阶段性事件研究框架。作者发现没有被迫迁移的证据，即使对于低社会经济地位的家庭也是如此。事实上，居住在翻新中的社区的家庭更有可能长期居住。作者认为这可能与租户权利保护法有关。当低收入家庭决定自愿离开时，他们并不会搬到更糟糕的社区。最后，作者发现这些变化没有对他们的收入轨迹造成不利影响，这表明对其劳动市场没有后果。",
    "tldr": "作者使用加拿大的税务数据追踪城市翻新过程中居民的流动和收入变化，发现翻新并没有导致被迫迁移，反而居民更有可能长期居住，同时收入轨迹也没有受到不利影响。",
    "en_tdlr": "The author uses Canadian tax data to track the mobility and income changes of residents during urban gentrification, finding that gentrification does not lead to displacement, but rather residents are more likely to stay long-term, with no adverse effects on income trajectory."
}