{
    "title": "Endogenous Fragility in Opaque Supply Chains",
    "abstract": "arXiv:2403.16632v1 Announce Type: new  Abstract: This paper investigates the role of supply chain unobservability in generating endogenously fragile production networks. In a simple production game, in which firms need to multisource to hedge against suppliers' risk under unobservability, firms underdiversify vis-a-vis the social optimum. The unobservability of suppliers' relations is the driver behind this. In production networks where upstream risk is highly correlated and supplier relationships are not observable, the marginal risk reduction of adding an additional supplier is low, because this additional supplier's risk is likely to be correlated to that of existing suppliers. This channel reduces firm incentives to diversify, which gives rise to inefficiently fragile production networks. By solving the social planner problem, I show that, if the risk reduction experienced downstream resulting from upstream diversification were to be internalised by upstream firms, endogenous produ",
    "link": "https://arxiv.org/abs/2403.16632",
    "context": "Title: Endogenous Fragility in Opaque Supply Chains\nAbstract: arXiv:2403.16632v1 Announce Type: new  Abstract: This paper investigates the role of supply chain unobservability in generating endogenously fragile production networks. In a simple production game, in which firms need to multisource to hedge against suppliers' risk under unobservability, firms underdiversify vis-a-vis the social optimum. The unobservability of suppliers' relations is the driver behind this. In production networks where upstream risk is highly correlated and supplier relationships are not observable, the marginal risk reduction of adding an additional supplier is low, because this additional supplier's risk is likely to be correlated to that of existing suppliers. This channel reduces firm incentives to diversify, which gives rise to inefficiently fragile production networks. By solving the social planner problem, I show that, if the risk reduction experienced downstream resulting from upstream diversification were to be internalised by upstream firms, endogenous produ",
    "path": "papers/24/03/2403.16632.json",
    "total_tokens": 764,
    "translated_title": "不透明供应链中的内生脆弱性",
    "translated_abstract": "本文研究了供应链不可观察性在产生内生脆弱生产网络中的作用。在一个简单的生产博弈中，企业需要多源采购以对冲供应商风险，但由于不可观察性，企业相对社会最优状态下未能充分分散风险。供应商关系的不可观察性是这一现象的推动力。在上游风险高度相关且供应商关系不可观察的生产网络中，增加另一个供应商所带来的边际风险降低较小，因为这个额外供应商的风险很可能与现有供应商的风险相关。这种情况削弱了企业多样化的动机，导致产生效率低下的脆弱生产网络。",
    "tldr": "不可观察的供应商关系驱动企业未能有效分散风险，导致内生脆弱生产网络。",
    "en_tdlr": "Unobservable supplier relationships drive firms to inefficiently diversify risks, resulting in endogenously fragile production networks."
}