{
    "title": "Deep Neural Network for Constraint Acquisition through Tailored Loss Function",
    "abstract": "arXiv:2403.02042v1 Announce Type: new  Abstract: The significance of learning constraints from data is underscored by its potential applications in real-world problem-solving. While constraints are popular for modeling and solving, the approaches to learning constraints from data remain relatively scarce. Furthermore, the intricate task of modeling demands expertise and is prone to errors, thus constraint acquisition methods offer a solution by automating this process through learnt constraints from examples or behaviours of solutions and non-solutions. This work introduces a novel approach grounded in Deep Neural Network (DNN) based on Symbolic Regression that, by setting suitable loss functions, constraints can be extracted directly from datasets. Using the present approach, direct formulation of constraints was achieved. Furthermore, given the broad pre-developed architectures and functionalities of DNN, connections and extensions with other frameworks could be foreseen.",
    "link": "https://arxiv.org/abs/2403.02042",
    "context": "Title: Deep Neural Network for Constraint Acquisition through Tailored Loss Function\nAbstract: arXiv:2403.02042v1 Announce Type: new  Abstract: The significance of learning constraints from data is underscored by its potential applications in real-world problem-solving. While constraints are popular for modeling and solving, the approaches to learning constraints from data remain relatively scarce. Furthermore, the intricate task of modeling demands expertise and is prone to errors, thus constraint acquisition methods offer a solution by automating this process through learnt constraints from examples or behaviours of solutions and non-solutions. This work introduces a novel approach grounded in Deep Neural Network (DNN) based on Symbolic Regression that, by setting suitable loss functions, constraints can be extracted directly from datasets. Using the present approach, direct formulation of constraints was achieved. Furthermore, given the broad pre-developed architectures and functionalities of DNN, connections and extensions with other frameworks could be foreseen.",
    "path": "papers/24/03/2403.02042.json",
    "total_tokens": 794,
    "translated_title": "通过量身定制的损失函数进行约束获取的深度神经网络",
    "translated_abstract": "从数据中学习约束的重要性被其在实际问题解决中的潜在应用所强调。尽管约束在建模和解决中很受欢迎，但从数据中学习约束的方法仍然相对稀缺。此外，建模的复杂任务需要专业知识，容易出错，因此约束获取方法通过从示例或解决方案和非解决方案的行为中学到的约束自动化该过程提供了解决方案。本工作引入了一种基于符号回归的深度神经网络（DNN）的创新方法，通过设置适当的损失函数，可以直接从数据集中提取约束。利用当前方法，直接制定约束得以实现。此外，考虑到DNN的广泛预先开发的架构和功能，与其他框架的连接和扩展可以预见到。",
    "tldr": "这项工作介绍了一种基于深度神经网络（DNN）和符号回归的新方法，通过设置适当的损失函数，可以直接从数据集中提取约束。",
    "en_tdlr": "This work introduces a novel approach based on Deep Neural Network (DNN) and Symbolic Regression, where constraints can be directly extracted from datasets by setting appropriate loss functions."
}