{
    "title": "Uncertainty Quantification with Deep Ensembles for 6D Object Pose Estimation",
    "abstract": "arXiv:2403.07741v1 Announce Type: cross  Abstract: The estimation of 6D object poses is a fundamental task in many computer vision applications. Particularly, in high risk scenarios such as human-robot interaction, industrial inspection, and automation, reliable pose estimates are crucial. In the last years, increasingly accurate and robust deep-learning-based approaches for 6D object pose estimation have been proposed. Many top-performing methods are not end-to-end trainable but consist of multiple stages. In the context of deep uncertainty quantification, deep ensembles are considered as state of the art since they have been proven to produce well-calibrated and robust uncertainty estimates. However, deep ensembles can only be applied to methods that can be trained end-to-end. In this work, we propose a method to quantify the uncertainty of multi-stage 6D object pose estimation approaches with deep ensembles. For the implementation, we choose SurfEmb as representative, since it is on",
    "link": "https://arxiv.org/abs/2403.07741",
    "context": "Title: Uncertainty Quantification with Deep Ensembles for 6D Object Pose Estimation\nAbstract: arXiv:2403.07741v1 Announce Type: cross  Abstract: The estimation of 6D object poses is a fundamental task in many computer vision applications. Particularly, in high risk scenarios such as human-robot interaction, industrial inspection, and automation, reliable pose estimates are crucial. In the last years, increasingly accurate and robust deep-learning-based approaches for 6D object pose estimation have been proposed. Many top-performing methods are not end-to-end trainable but consist of multiple stages. In the context of deep uncertainty quantification, deep ensembles are considered as state of the art since they have been proven to produce well-calibrated and robust uncertainty estimates. However, deep ensembles can only be applied to methods that can be trained end-to-end. In this work, we propose a method to quantify the uncertainty of multi-stage 6D object pose estimation approaches with deep ensembles. For the implementation, we choose SurfEmb as representative, since it is on",
    "path": "papers/24/03/2403.07741.json",
    "total_tokens": 843,
    "translated_title": "使用深度集成进行6D物体姿态估计的不确定性量化",
    "translated_abstract": "6D物体姿态的估计是许多计算机视觉应用中的基本任务。特别是在人机交互、工业检验和自动化等高风险场景中，可靠的姿态估计至关重要。近年来，提出了越来越精确和鲁棒的基于深度学习的6D物体姿态估计方法。许多表现最佳的方法并非端到端可训练，而是由多个阶段组成。在深度不确定性量化的背景下，深度集成被认为是最先进的，因为它们已被证明能够产生良好校准和鲁棒的不确定性估计。然而，深度集成只能应用于可以端到端训练的方法。在这项工作中，我们提出了一种使用深度集成来量化多阶段6D物体姿态估计方法的不确定性的方法。对于实现，我们选择SurfEmb作为代表，因为它是一种",
    "tldr": "本研究提出了一种使用深度集成来量化多阶段6D物体姿态估计方法不确定性的方法。",
    "en_tdlr": "A method is proposed in this study to quantify the uncertainty of multi-stage 6D object pose estimation approaches with deep ensembles."
}