{
    "title": "Scenarios for the Transition to AGI",
    "abstract": "arXiv:2403.12107v1 Announce Type: cross  Abstract: We analyze how output and wages behave under different scenarios for technological progress that may culminate in Artificial General Intelligence (AGI), defined as the ability of AI systems to perform all tasks that humans can perform. We assume that human work can be decomposed into atomistic tasks that differ in their complexity. Advances in technology make ever more complex tasks amenable to automation. The effects on wages depend on a race between automation and capital accumulation. If the distribution of task complexity exhibits a sufficiently thick infinite tail, then there is always enough work for humans, and wages may rise forever. By contrast, if the complexity of tasks that humans can perform is bounded and full automation is reached, then wages collapse. But declines may occur even before if large-scale automation outpaces capital accumulation and makes labor too abundant. Automating productivity growth may lead to broad-b",
    "link": "https://arxiv.org/abs/2403.12107",
    "context": "Title: Scenarios for the Transition to AGI\nAbstract: arXiv:2403.12107v1 Announce Type: cross  Abstract: We analyze how output and wages behave under different scenarios for technological progress that may culminate in Artificial General Intelligence (AGI), defined as the ability of AI systems to perform all tasks that humans can perform. We assume that human work can be decomposed into atomistic tasks that differ in their complexity. Advances in technology make ever more complex tasks amenable to automation. The effects on wages depend on a race between automation and capital accumulation. If the distribution of task complexity exhibits a sufficiently thick infinite tail, then there is always enough work for humans, and wages may rise forever. By contrast, if the complexity of tasks that humans can perform is bounded and full automation is reached, then wages collapse. But declines may occur even before if large-scale automation outpaces capital accumulation and makes labor too abundant. Automating productivity growth may lead to broad-b",
    "path": "papers/24/03/2403.12107.json",
    "total_tokens": 825,
    "translated_title": "AGI过渡场景分析",
    "translated_abstract": "我们分析了在可能导致人工通用智能（AGI）的技术进步不同场景下产出和工资的变化。在我们的假设中，人类工作可以分解为在复杂性上不同的原子任务。技术的进步使得越来越复杂的任务可以被自动化实现。工资的影响取决于自动化和资本积累之间的竞赛。如果任务复杂性的分布呈现出足够厚的无限尾部，那么就总是有足够的工作供人类从事，工资可能会无限上升。相比之下，如果人类可以执行的任务复杂性是有界的，并且完全自动化被实现，那么工资会崩溃。但即使在这之前，如果大规模自动化超越了资本积累，劳动力过于丰富，工资可能会下降。自动化生产率的增长可能导致广泛的发展",
    "tldr": "分析了不同的技术进步场景对人工通用智能过渡的影响，探讨了自动化和资本积累之间的关系以及工资变化趋势。",
    "en_tdlr": "Analyzed the impact of different technological progress scenarios on the transition to Artificial General Intelligence (AGI), explored the relationship between automation and capital accumulation, and the trends in wage changes."
}