{
    "title": "Evaluating and Optimizing Educational Content with Large Language Model Judgments",
    "abstract": "arXiv:2403.02795v1 Announce Type: new  Abstract: Creating effective educational materials generally requires expensive and time-consuming studies of student learning outcomes. To overcome this barrier, one idea is to build computational models of student learning and use them to optimize instructional materials. However, it is difficult to model the cognitive processes of learning dynamics. We propose an alternative approach that uses Language Models (LMs) as educational experts to assess the impact of various instructions on learning outcomes. Specifically, we use GPT-3.5 to evaluate the overall effect of instructional materials on different student groups and find that it can replicate well-established educational findings such as the Expertise Reversal Effect and the Variability Effect. This demonstrates the potential of LMs as reliable evaluators of educational content. Building on this insight, we introduce an instruction optimization approach in which one LM generates instruction",
    "link": "https://arxiv.org/abs/2403.02795",
    "context": "Title: Evaluating and Optimizing Educational Content with Large Language Model Judgments\nAbstract: arXiv:2403.02795v1 Announce Type: new  Abstract: Creating effective educational materials generally requires expensive and time-consuming studies of student learning outcomes. To overcome this barrier, one idea is to build computational models of student learning and use them to optimize instructional materials. However, it is difficult to model the cognitive processes of learning dynamics. We propose an alternative approach that uses Language Models (LMs) as educational experts to assess the impact of various instructions on learning outcomes. Specifically, we use GPT-3.5 to evaluate the overall effect of instructional materials on different student groups and find that it can replicate well-established educational findings such as the Expertise Reversal Effect and the Variability Effect. This demonstrates the potential of LMs as reliable evaluators of educational content. Building on this insight, we introduce an instruction optimization approach in which one LM generates instruction",
    "path": "papers/24/03/2403.02795.json",
    "total_tokens": 807,
    "translated_title": "用大型语言模型评估和优化教育内容",
    "translated_abstract": "创建有效的教育材料通常需要对学生学习成果进行昂贵且耗时的研究。为了克服这一障碍，一个想法是构建学生学习的计算模型，并使用它们来优化教学材料。然而，模拟学习动态的认知过程是困难的。我们提出了一种使用语言模型（LMs）作为教育专家来评估各种指导对学习结果影响的替代方法。具体地，我们使用GPT-3.5来评估指导材料对不同学生群体的整体影响，并发现它可以复制诸如专业逆转效应和变异效应等已经建立的教育发现。这展示了LMs作为教育内容可靠评估者的潜力。基于这一见解，我们介绍了一种指导优化方法，其中一个LM生成指导。",
    "tldr": "使用语言模型作为教育专家来评估教育内容的影响，展示了LMs作为可靠评估者的潜力，并介绍了一种指导优化方法。",
    "en_tdlr": "Using language models as educational experts to assess the impact of educational content demonstrates the potential of LMs as reliable evaluators and introduces an instruction optimization approach."
}