{
    "title": "A Bayesian Committee Machine Potential for Oxygen-containing Organic Compounds",
    "abstract": "arXiv:2403.01158v1 Announce Type: cross  Abstract: Understanding the pivotal role of oxygen-containing organic compounds in serving as an energy source for living organisms and contributing to protein formation is crucial in the field of biochemistry. This study addresses the challenge of comprehending protein-protein interactions (PPI) and developing predicitive models for proteins and organic compounds, with a specific focus on quantifying their binding affinity. Here, we introduce the active Bayesian Committee Machine (BCM) potential, specifically designed to predict oxygen-containing organic compounds within eight groups of CHO. The BCM potential adopts a committee-based approach to tackle scalability issues associated with kernel regressors, particularly when dealing with large datasets. Its adaptable structure allows for efficient and cost-effective expansion, maintaing both transferability and scalability. Through systematic benchmarking, we position the sparse BCM potential as ",
    "link": "https://arxiv.org/abs/2403.01158",
    "context": "Title: A Bayesian Committee Machine Potential for Oxygen-containing Organic Compounds\nAbstract: arXiv:2403.01158v1 Announce Type: cross  Abstract: Understanding the pivotal role of oxygen-containing organic compounds in serving as an energy source for living organisms and contributing to protein formation is crucial in the field of biochemistry. This study addresses the challenge of comprehending protein-protein interactions (PPI) and developing predicitive models for proteins and organic compounds, with a specific focus on quantifying their binding affinity. Here, we introduce the active Bayesian Committee Machine (BCM) potential, specifically designed to predict oxygen-containing organic compounds within eight groups of CHO. The BCM potential adopts a committee-based approach to tackle scalability issues associated with kernel regressors, particularly when dealing with large datasets. Its adaptable structure allows for efficient and cost-effective expansion, maintaing both transferability and scalability. Through systematic benchmarking, we position the sparse BCM potential as ",
    "path": "papers/24/03/2403.01158.json",
    "total_tokens": 864,
    "translated_title": "一种基于贝叶斯委员会机制的含氧有机化合物潜势",
    "translated_abstract": "理解含氧有机化合物在为生物体提供能量来源和促进蛋白质形成方面的关键作用对生物化学领域至关重要。本研究解决了理解蛋白质-蛋白质相互作用（PPI）和开发蛋白质和有机化合物的预测模型的挑战，特别关注量化它们的结合亲和力。在这里，我们介绍了一种特别设计用于预测八组CHO内含氧有机化合物的主动贝叶斯委员会机潜势（BCM）。BCM潜势采用基于委员会的方法来解决与核回归器相关的可扩展性问题，特别是在处理大型数据集时。其可适应性结构可以实现高效和具有成本效益的扩展，保持转移性和可扩展性。通过系统化基准测试，我们将稀疏的BCM潜势定位为",
    "tldr": "本研究介绍了一种基于贝叶斯委员会机制的 BCM 潜势，可用于预测含氧有机化合物，具有高效的可扩展结构和适应性，在处理大型数据集时表现出色。",
    "en_tdlr": "This study introduces an active Bayesian Committee Machine (BCM) potential designed to predict oxygen-containing organic compounds, featuring an efficient and scalable structure with adaptability for handling large datasets."
}