{
    "title": "Leveraging Constraint Programming in a Deep Learning Approach for Dynamically Solving the Flexible Job-Shop Scheduling Problem",
    "abstract": "arXiv:2403.09249v1 Announce Type: new  Abstract: Recent advancements in the flexible job-shop scheduling problem (FJSSP) are primarily based on deep reinforcement learning (DRL) due to its ability to generate high-quality, real-time solutions. However, DRL approaches often fail to fully harness the strengths of existing techniques such as exact methods or constraint programming (CP), which can excel at finding optimal or near-optimal solutions for smaller instances. This paper aims to integrate CP within a deep learning (DL) based methodology, leveraging the benefits of both. In this paper, we introduce a method that involves training a DL model using optimal solutions generated by CP, ensuring the model learns from high-quality data, thereby eliminating the need for the extensive exploration typical in DRL and enhancing overall performance. Further, we integrate CP into our DL framework to jointly construct solutions, utilizing DL for the initial complex stages and transitioning to CP",
    "link": "https://arxiv.org/abs/2403.09249",
    "context": "Title: Leveraging Constraint Programming in a Deep Learning Approach for Dynamically Solving the Flexible Job-Shop Scheduling Problem\nAbstract: arXiv:2403.09249v1 Announce Type: new  Abstract: Recent advancements in the flexible job-shop scheduling problem (FJSSP) are primarily based on deep reinforcement learning (DRL) due to its ability to generate high-quality, real-time solutions. However, DRL approaches often fail to fully harness the strengths of existing techniques such as exact methods or constraint programming (CP), which can excel at finding optimal or near-optimal solutions for smaller instances. This paper aims to integrate CP within a deep learning (DL) based methodology, leveraging the benefits of both. In this paper, we introduce a method that involves training a DL model using optimal solutions generated by CP, ensuring the model learns from high-quality data, thereby eliminating the need for the extensive exploration typical in DRL and enhancing overall performance. Further, we integrate CP into our DL framework to jointly construct solutions, utilizing DL for the initial complex stages and transitioning to CP",
    "path": "papers/24/03/2403.09249.json",
    "total_tokens": 756,
    "translated_title": "在动态解决柔性作业车间调度问题中利用约束编程的深度学习方法",
    "translated_abstract": "最近柔性作业车间调度问题（FJSSP）方面的进展主要基于深度强化学习（DRL），因其能够生成高质量、实时解决方案。然而，DRL方法常常未能充分利用现有技术的优势，如确切方法或约束编程（CP），后者能够在较小实例中找到最优或接近最优解。本文旨在将约束编程集成到以深度学习（DL）为基础的方法中，充分利用两者的优势。",
    "tldr": "该研究将约束编程与深度学习相结合，通过使用约束编程生成的最优解来训练深度学习模型，从而消除了深度强化学习中广泛探索的需要，提高了整体性能。",
    "en_tdlr": "This study combines constraint programming with deep learning by training a DL model using optimal solutions generated by CP, eliminating the need for extensive exploration in deep reinforcement learning to enhance overall performance."
}