{
    "title": "Learning-driven Physically-aware Large-scale Circuit Gate Sizing",
    "abstract": "arXiv:2403.08193v1 Announce Type: new  Abstract: Gate sizing plays an important role in timing optimization after physical design. Existing machine learning-based gate sizing works cannot optimize timing on multiple timing paths simultaneously and neglect the physical constraint on layouts. They cause sub-optimal sizing solutions and low-efficiency issues when compared with commercial gate sizing tools. In this work, we propose a learning-driven physically-aware gate sizing framework to optimize timing performance on large-scale circuits efficiently. In our gradient descent optimization-based work, for obtaining accurate gradients, a multi-modal gate sizing-aware timing model is achieved via learning timing information on multiple timing paths and physical information on multiple-scaled layouts jointly. Then, gradient generation based on the sizing-oriented estimator and adaptive back-propagation are developed to update gate sizes. Our results demonstrate that our work achieves higher ",
    "link": "https://arxiv.org/abs/2403.08193",
    "context": "Title: Learning-driven Physically-aware Large-scale Circuit Gate Sizing\nAbstract: arXiv:2403.08193v1 Announce Type: new  Abstract: Gate sizing plays an important role in timing optimization after physical design. Existing machine learning-based gate sizing works cannot optimize timing on multiple timing paths simultaneously and neglect the physical constraint on layouts. They cause sub-optimal sizing solutions and low-efficiency issues when compared with commercial gate sizing tools. In this work, we propose a learning-driven physically-aware gate sizing framework to optimize timing performance on large-scale circuits efficiently. In our gradient descent optimization-based work, for obtaining accurate gradients, a multi-modal gate sizing-aware timing model is achieved via learning timing information on multiple timing paths and physical information on multiple-scaled layouts jointly. Then, gradient generation based on the sizing-oriented estimator and adaptive back-propagation are developed to update gate sizes. Our results demonstrate that our work achieves higher ",
    "path": "papers/24/03/2403.08193.json",
    "total_tokens": 756,
    "translated_title": "学习驱动的物理感知大规模电路门尺寸优化",
    "translated_abstract": "门尺寸在物理设计后的时序优化中扮演重要角色。现有基于机器学习的门尺寸优化方法无法同时优化多个时序路径上的时序，并忽略布局的物理约束。为了高效优化大规模电路的时序性能，本研究提出了一种学习驱动的物理感知门尺寸优化框架。通过学习多个时序路径上的时序信息和多尺度布局上的物理信息，实现了多模态门尺寸感知时序模型，用于梯度下降优化。同时，基于尺寸导向估计器的梯度生成和自适应反向传播被开发用于更新门尺寸。我们的结果表明，相比商业工具，我们的方法实现了更高的",
    "tldr": "本研究提出了一种学习驱动的物理感知门尺寸优化框架，能够有效优化大规模电路的时序性能。",
    "en_tdlr": "This work proposes a learning-driven physically-aware gate sizing framework to optimize timing performance on large-scale circuits efficiently."
}