{
    "title": "COLEP: Certifiably Robust Learning-Reasoning Conformal Prediction via Probabilistic Circuits",
    "abstract": "arXiv:2403.11348v1 Announce Type: cross  Abstract: Conformal prediction has shown spurring performance in constructing statistically rigorous prediction sets for arbitrary black-box machine learning models, assuming the data is exchangeable. However, even small adversarial perturbations during the inference can violate the exchangeability assumption, challenge the coverage guarantees, and result in a subsequent decline in empirical coverage. In this work, we propose a certifiably robust learning-reasoning conformal prediction framework (COLEP) via probabilistic circuits, which comprise a data-driven learning component that trains statistical models to learn different semantic concepts, and a reasoning component that encodes knowledge and characterizes the relationships among the trained models for logic reasoning. To achieve exact and efficient reasoning, we employ probabilistic circuits (PCs) within the reasoning component. Theoretically, we provide end-to-end certification of predict",
    "link": "https://arxiv.org/abs/2403.11348",
    "context": "Title: COLEP: Certifiably Robust Learning-Reasoning Conformal Prediction via Probabilistic Circuits\nAbstract: arXiv:2403.11348v1 Announce Type: cross  Abstract: Conformal prediction has shown spurring performance in constructing statistically rigorous prediction sets for arbitrary black-box machine learning models, assuming the data is exchangeable. However, even small adversarial perturbations during the inference can violate the exchangeability assumption, challenge the coverage guarantees, and result in a subsequent decline in empirical coverage. In this work, we propose a certifiably robust learning-reasoning conformal prediction framework (COLEP) via probabilistic circuits, which comprise a data-driven learning component that trains statistical models to learn different semantic concepts, and a reasoning component that encodes knowledge and characterizes the relationships among the trained models for logic reasoning. To achieve exact and efficient reasoning, we employ probabilistic circuits (PCs) within the reasoning component. Theoretically, we provide end-to-end certification of predict",
    "path": "papers/24/03/2403.11348.json",
    "total_tokens": 905,
    "translated_title": "COLEP: 通过概率电路实现可证实鲁棒学习推理一致性预测",
    "translated_abstract": "参考类型：交叉  摘要：一致性预测已经显示出在为任意黑匣子机器学习模型构建统计严谨的预测集方面表现出色，假设数据是可交换的。然而，即使在推理过程中进行微小的对抗性扰动也可能违反可交换性假设，挑战覆盖率保证，并导致后续实证覆盖率的下降。在这项工作中，我们提出了一个通过概率电路实现可证实鲁棒学习推理的一致性预测框架（COLEP），其中包括一个数据驱动的学习组件，用于训练统计模型以学习不同的语义概念，以及一个用于编码知识并表征训练模型之间关系的推理组件。为了实现精确和高效的推理，我们在推理组件内部使用了概率电路（PCs）。在理论上，我们提供了完整的预测认证",
    "tldr": "通过概率电路，提出了COLEP框架，实现了可证实鲁棒学习推理一致性预测，其特点在于训练统计模型学习不同语义概念，并利用概率电路实现精确高效推理",
    "en_tdlr": "COLEP framework, utilizing probabilistic circuits, achieves certifiably robust learning-reasoning conformal prediction by training statistical models to learn various semantic concepts and enabling exact and efficient reasoning through probabilistic circuits."
}