{
    "title": "Implications of the AI Act for Non-Discrimination Law and Algorithmic Fairness",
    "abstract": "arXiv:2403.20089v1 Announce Type: new  Abstract: The topic of fairness in AI, as debated in the FATE (Fairness, Accountability, Transparency, and Ethics in AI) communities, has sparked meaningful discussions in the past years. However, from a legal perspective, particularly from European Union law, many open questions remain. Whereas algorithmic fairness aims to mitigate structural inequalities at the design level, European non-discrimination law is tailored to individual cases of discrimination after an AI model has been deployed. The AI Act might present a tremendous step towards bridging these two concepts by shifting non-discrimination responsibilities into the design stage of AI models. Based on an integrative reading of the AI Act, we comment on legal as well as technical enforcement problems and propose practical implications on bias detection and bias correction in order to specify and comply with specific technical requirements.",
    "link": "https://arxiv.org/abs/2403.20089",
    "context": "Title: Implications of the AI Act for Non-Discrimination Law and Algorithmic Fairness\nAbstract: arXiv:2403.20089v1 Announce Type: new  Abstract: The topic of fairness in AI, as debated in the FATE (Fairness, Accountability, Transparency, and Ethics in AI) communities, has sparked meaningful discussions in the past years. However, from a legal perspective, particularly from European Union law, many open questions remain. Whereas algorithmic fairness aims to mitigate structural inequalities at the design level, European non-discrimination law is tailored to individual cases of discrimination after an AI model has been deployed. The AI Act might present a tremendous step towards bridging these two concepts by shifting non-discrimination responsibilities into the design stage of AI models. Based on an integrative reading of the AI Act, we comment on legal as well as technical enforcement problems and propose practical implications on bias detection and bias correction in order to specify and comply with specific technical requirements.",
    "path": "papers/24/03/2403.20089.json",
    "total_tokens": 841,
    "translated_title": "AI法案对非歧视法律和算法公平性的影响",
    "translated_abstract": "AI公平性的话题，正如在FATE（AI公平性、责任性、透明性和伦理）社区中讨论的那样，在过去几年中引发了有意义的讨论。然而，从法律角度来看，特别是从欧盟法律的角度，仍然存在许多待解的问题。虽然算法公平性旨在在设计阶段减轻结构不平等，但欧洲的非歧视法律则是针对AI模型部署后的个别歧视案件量身定制的。AI法案可能是朝着弥合这两个概念的巨大一步，通过将非歧视责任转移到AI模型设计阶段。基于对AI法案的综合阅读，我们评论了法律和技术执行问题，并提出了在偏见检测和偏见校正方面的实际影响，以便指定和符合特定的技术要求。",
    "tldr": "AI法案可能成为弥合算法公平性和欧盟非歧视法律的重要一环，通过将非歧视责任转移到AI模型设计阶段，推动偏见检测和偏见校正的相关实践。",
    "en_tdlr": "The AI Act may serve as a crucial step towards bridging algorithmic fairness and EU non-discrimination law by shifting non-discrimination responsibilities to the design stage of AI models, impacting bias detection and correction practices."
}