{
    "title": "Leveraging Large Language Models for Preliminary Security Risk Analysis: A Mission-Critical Case Study",
    "abstract": "arXiv:2403.15756v1 Announce Type: cross  Abstract: Preliminary security risk analysis (PSRA) provides a quick approach to identify, evaluate and propose remeditation to potential risks in specific scenarios. The extensive expertise required for an effective PSRA and the substantial ammount of textual-related tasks hinder quick assessments in mission-critical contexts, where timely and prompt actions are essential. The speed and accuracy of human experts in PSRA significantly impact response time. A large language model can quickly summarise information in less time than a human. To our knowledge, no prior study has explored the capabilities of fine-tuned models (FTM) in PSRA. Our case study investigates the proficiency of FTM to assist practitioners in PSRA. We manually curated 141 representative samples from over 50 mission-critical analyses archived by the industrial context team in the last five years.We compared the proficiency of the FTM versus seven human experts. Within the indu",
    "link": "https://arxiv.org/abs/2403.15756",
    "context": "Title: Leveraging Large Language Models for Preliminary Security Risk Analysis: A Mission-Critical Case Study\nAbstract: arXiv:2403.15756v1 Announce Type: cross  Abstract: Preliminary security risk analysis (PSRA) provides a quick approach to identify, evaluate and propose remeditation to potential risks in specific scenarios. The extensive expertise required for an effective PSRA and the substantial ammount of textual-related tasks hinder quick assessments in mission-critical contexts, where timely and prompt actions are essential. The speed and accuracy of human experts in PSRA significantly impact response time. A large language model can quickly summarise information in less time than a human. To our knowledge, no prior study has explored the capabilities of fine-tuned models (FTM) in PSRA. Our case study investigates the proficiency of FTM to assist practitioners in PSRA. We manually curated 141 representative samples from over 50 mission-critical analyses archived by the industrial context team in the last five years.We compared the proficiency of the FTM versus seven human experts. Within the indu",
    "path": "papers/24/03/2403.15756.json",
    "total_tokens": 810,
    "translated_title": "利用大型语言模型进行初步安全风险分析：一个关键任务案例研究",
    "translated_abstract": "初步安全风险分析（PSRA）提供了一种快速的方法，用于识别、评估和提出潜在风险在具体情境中的应对措施。在关键任务情境中，及时和迅速的行动是至关重要的，所以对有效PSRA所需的广泛专业知识和大量与文本相关的任务在阻碍快速评估。大型语言模型可以比人类更快速地总结信息，利用微调模型（FTM）在PSRA中的能力尚未被先前的研究所探讨。本文通过案例研究调查FTM在协助从业者进行PSRA中的熟练程度。",
    "tldr": "大型语言模型在初步安全风险分析中展现了比人类更快速的信息总结能力，本研究通过案例研究探讨了微调模型在协助从业者进行PSRA方面的实用性。",
    "en_tdlr": "Large language models demonstrate faster information summarization ability than humans in preliminary security risk analysis, and this study explores the practicality of fine-tuned models in assisting practitioners with PSRA through a case study."
}