{
    "title": "Separable Physics-informed Neural Networks for Solving the BGK Model of the Boltzmann Equation",
    "abstract": "arXiv:2403.06342v1 Announce Type: cross  Abstract: In this study, we introduce a method based on Separable Physics-Informed Neural Networks (SPINNs) for effectively solving the BGK model of the Boltzmann equation. While the mesh-free nature of PINNs offers significant advantages in handling high-dimensional partial differential equations (PDEs), challenges arise when applying quadrature rules for accurate integral evaluation in the BGK operator, which can compromise the mesh-free benefit and increase computational costs. To address this, we leverage the canonical polyadic decomposition structure of SPINNs and the linear nature of moment calculation, achieving a substantial reduction in computational expense for quadrature rule application. The multi-scale nature of the particle density function poses difficulties in precisely approximating macroscopic moments using neural networks. To improve SPINN training, we introduce the integration of Gaussian functions into SPINNs, coupled with a",
    "link": "https://arxiv.org/abs/2403.06342",
    "context": "Title: Separable Physics-informed Neural Networks for Solving the BGK Model of the Boltzmann Equation\nAbstract: arXiv:2403.06342v1 Announce Type: cross  Abstract: In this study, we introduce a method based on Separable Physics-Informed Neural Networks (SPINNs) for effectively solving the BGK model of the Boltzmann equation. While the mesh-free nature of PINNs offers significant advantages in handling high-dimensional partial differential equations (PDEs), challenges arise when applying quadrature rules for accurate integral evaluation in the BGK operator, which can compromise the mesh-free benefit and increase computational costs. To address this, we leverage the canonical polyadic decomposition structure of SPINNs and the linear nature of moment calculation, achieving a substantial reduction in computational expense for quadrature rule application. The multi-scale nature of the particle density function poses difficulties in precisely approximating macroscopic moments using neural networks. To improve SPINN training, we introduce the integration of Gaussian functions into SPINNs, coupled with a",
    "path": "papers/24/03/2403.06342.json",
    "total_tokens": 901,
    "translated_title": "可分离的物理信息神经网络用于解决Boltzmann方程的BGK模型",
    "translated_abstract": "在这项研究中，我们介绍了一种基于可分离的物理信息神经网络（SPINNs）的方法，用于有效解决Boltzmann方程的BGK模型。尽管PINNs的无网格特性在处理高维偏微分方程（PDEs）方面具有显著优势，但在BGK操作符的积分精确评估时，应用求积规则会带来挑战，可能影响无网格优势并增加计算成本。为了解决这一问题，我们利用SPINNs的规范polyadic分解结构和矩计算的线性特性，实现了在求积规则应用中大幅减少计算开销。粒子密度函数的多尺度性质使得使用神经网络精确逼近宏观矩困难。为了改进SPINN训练，我们引入了高斯函数的积分到SPINNs中，并结合",
    "tldr": "本研究介绍了一种基于可分离的物理信息神经网络的方法，用于解决Boltzmann方程的BGK模型，在处理高维偏微分方程时能够显著减少计算成本，并通过引入高斯函数来改善对神经网络的训练。",
    "en_tdlr": "This study presents a method based on Separable Physics-Informed Neural Networks (SPINNs) for solving the BGK model of the Boltzmann equation, significantly reducing computational costs in handling high-dimensional partial differential equations and improving SPINN training by integrating Gaussian functions."
}