{
    "title": "Potential of Domain Adaptation in Machine Learning in Ecology and Hydrology to Improve Model Extrapolability",
    "abstract": "arXiv:2403.11331v1 Announce Type: cross  Abstract: Due to the heterogeneity of the global distribution of ecological and hydrological ground-truth observations, machine learning models can have limited adaptability when applied to unknown locations, which is referred to as weak extrapolability. Domain adaptation techniques have been widely used in machine learning domains such as image classification, which can improve the model generalization ability by adjusting the difference or inconsistency of the domain distribution between the training and test sets. However, this approach has rarely been used explicitly in machine learning models in ecology and hydrology at the global scale, although these models have often been questioned due to geographic extrapolability issues. This paper briefly describes the shortcomings of current machine learning models of ecology and hydrology in terms of the global representativeness of the distribution of observations and the resulting limitations of ",
    "link": "https://arxiv.org/abs/2403.11331",
    "context": "Title: Potential of Domain Adaptation in Machine Learning in Ecology and Hydrology to Improve Model Extrapolability\nAbstract: arXiv:2403.11331v1 Announce Type: cross  Abstract: Due to the heterogeneity of the global distribution of ecological and hydrological ground-truth observations, machine learning models can have limited adaptability when applied to unknown locations, which is referred to as weak extrapolability. Domain adaptation techniques have been widely used in machine learning domains such as image classification, which can improve the model generalization ability by adjusting the difference or inconsistency of the domain distribution between the training and test sets. However, this approach has rarely been used explicitly in machine learning models in ecology and hydrology at the global scale, although these models have often been questioned due to geographic extrapolability issues. This paper briefly describes the shortcomings of current machine learning models of ecology and hydrology in terms of the global representativeness of the distribution of observations and the resulting limitations of ",
    "path": "papers/24/03/2403.11331.json",
    "total_tokens": 831,
    "translated_title": "机器学习在生态和水文学中的领域自适应潜力以提高模型的外推能力",
    "translated_abstract": "由于生态和水文地面实际观测的全球分布的异质性，机器学习模型在应用于未知位置时可能具有有限的适应性，也称为弱外推能力。领域自适应技术已经广泛应用于机器学习领域，例如图像分类，通过调整训练集和测试集之间的领域分布的差异或不一致性，可以提高模型的泛化能力。然而，尽管这些模型经常因地理外推能力问题而受到质疑，但这种方法很少被明确地应用于全球范围内生态和水文学中的机器学习模型。本文简要描述了当前生态和水文学中的机器学习模型在全球观测分布的代表性和由此造成的局限性方面的缺陷。",
    "tldr": "本研究讨论了在生态和水文学领域中使用领域自适应技术来改善模型外推能力的潜力，弥补了目前模型普遍存在的地理外推问题。",
    "en_tdlr": "This study explores the potential of using domain adaptation techniques in the fields of ecology and hydrology to improve model extrapolability, addressing the common geographic extrapolation issues in current models."
}