{
    "title": "Learning Visual Quadrupedal Loco-Manipulation from Demonstrations",
    "abstract": "arXiv:2403.20328v1 Announce Type: cross  Abstract: Quadruped robots are progressively being integrated into human environments. Despite the growing locomotion capabilities of quadrupedal robots, their interaction with objects in realistic scenes is still limited. While additional robotic arms on quadrupedal robots enable manipulating objects, they are sometimes redundant given that a quadruped robot is essentially a mobile unit equipped with four limbs, each possessing 3 degrees of freedom (DoFs). Hence, we aim to empower a quadruped robot to execute real-world manipulation tasks using only its legs. We decompose the loco-manipulation process into a low-level reinforcement learning (RL)-based controller and a high-level Behavior Cloning (BC)-based planner. By parameterizing the manipulation trajectory, we synchronize the efforts of the upper and lower layers, thereby leveraging the advantages of both RL and BC. Our approach is validated through simulations and real-world experiments, d",
    "link": "https://arxiv.org/abs/2403.20328",
    "context": "Title: Learning Visual Quadrupedal Loco-Manipulation from Demonstrations\nAbstract: arXiv:2403.20328v1 Announce Type: cross  Abstract: Quadruped robots are progressively being integrated into human environments. Despite the growing locomotion capabilities of quadrupedal robots, their interaction with objects in realistic scenes is still limited. While additional robotic arms on quadrupedal robots enable manipulating objects, they are sometimes redundant given that a quadruped robot is essentially a mobile unit equipped with four limbs, each possessing 3 degrees of freedom (DoFs). Hence, we aim to empower a quadruped robot to execute real-world manipulation tasks using only its legs. We decompose the loco-manipulation process into a low-level reinforcement learning (RL)-based controller and a high-level Behavior Cloning (BC)-based planner. By parameterizing the manipulation trajectory, we synchronize the efforts of the upper and lower layers, thereby leveraging the advantages of both RL and BC. Our approach is validated through simulations and real-world experiments, d",
    "path": "papers/24/03/2403.20328.json",
    "total_tokens": 781,
    "translated_title": "从示范学习视觉四足走行操纵",
    "translated_abstract": "四足机器人逐渐被整合进人类环境。尽管四足机器人的行走能力不断增强，但它们在现实场景中与物体的互动仍然有限。为了让四足机器人能够执行真实世界的操纵任务，我们将走行操纵过程分解为基于强化学习（RL）的低层控制器和基于行为克隆（BC）的高层规划器。通过参数化操纵轨迹，我们同步上层和下层的努力，从而充分利用RL和BC的优势。我们的方法通过模拟和现实世界实验得到验证。",
    "tldr": "通过将走行操纵过程分解为低层强化学习控制器和高层行为克隆规划器，使四足机器人能够执行真实世界的操纵任务。",
    "en_tdlr": "Empowering a quadruped robot to execute real-world manipulation tasks by decomposing the loco-manipulation process into a low-level reinforcement learning-based controller and a high-level Behavior Cloning-based planner."
}