{
    "title": "Castor: Competing shapelets for fast and accurate time series classification",
    "abstract": "arXiv:2403.13176v1 Announce Type: new  Abstract: Shapelets are discriminative subsequences, originally embedded in shapelet-based decision trees but have since been extended to shapelet-based transformations. We propose Castor, a simple, efficient, and accurate time series classification algorithm that utilizes shapelets to transform time series. The transformation organizes shapelets into groups with varying dilation and allows the shapelets to compete over the time context to construct a diverse feature representation. By organizing the shapelets into groups, we enable the transformation to transition between levels of competition, resulting in methods that more closely resemble distance-based transformations or dictionary-based transformations. We demonstrate, through an extensive empirical investigation, that Castor yields transformations that result in classifiers that are significantly more accurate than several state-of-the-art classifiers. In an extensive ablation study, we exa",
    "link": "https://arxiv.org/abs/2403.13176",
    "context": "Title: Castor: Competing shapelets for fast and accurate time series classification\nAbstract: arXiv:2403.13176v1 Announce Type: new  Abstract: Shapelets are discriminative subsequences, originally embedded in shapelet-based decision trees but have since been extended to shapelet-based transformations. We propose Castor, a simple, efficient, and accurate time series classification algorithm that utilizes shapelets to transform time series. The transformation organizes shapelets into groups with varying dilation and allows the shapelets to compete over the time context to construct a diverse feature representation. By organizing the shapelets into groups, we enable the transformation to transition between levels of competition, resulting in methods that more closely resemble distance-based transformations or dictionary-based transformations. We demonstrate, through an extensive empirical investigation, that Castor yields transformations that result in classifiers that are significantly more accurate than several state-of-the-art classifiers. In an extensive ablation study, we exa",
    "path": "papers/24/03/2403.13176.json",
    "total_tokens": 862,
    "translated_title": "Castor: 用于快速准确时间序列分类的竞争形状子序列",
    "translated_abstract": "Shapelets是一种具有区分性的子序列，最初嵌入在基于形状子树的决策树中，但后来被扩展为基于形状子序列的转换。我们提出了一个简单、高效且准确的时间序列分类算法Castor，利用形状子序列来转换时间序列。该转换将形状子序列组织成具有不同扩张的组，并允许形状子序列在时间上竞争，以构建多样化的特征表示。通过将形状子序列组织成组，我们使转换能够在竞争水平之间过渡，从而产生更接近基于距离的转换或基于词典的转换的方法。我们通过大量实证研究证明，Castor产生的转换使分类器比几种最先进的分类器显着更准确。在广泛的消融研究中，我们进行了详细的调查。",
    "tldr": "Castor是一个利用形状子序列转换时间序列的简单高效且准确的分类算法，通过形状子序列的竞争组织构建多样化特征表示，产生比其他现有分类器更准确的分类方法。",
    "en_tdlr": "Castor is a simple, efficient, and accurate time series classification algorithm that utilizes shapelets to transform time series. By organizing shapelets into competing groups to construct a diverse feature representation, Castor yields classifiers that are significantly more accurate than several state-of-the-art classifiers."
}