{
    "title": "Speed, Accuracy, and Complexity",
    "abstract": "arXiv:2403.11240v1 Announce Type: new  Abstract: This paper re-examines the validity of using response time to infer problem complexity. It revisits a canonical Wald model of optimal stopping, taking signal-to-noise ratio as a measure of problem complexity. While choice quality is monotone in problem complexity, expected stopping time is inverse $U$-shaped. Indeed decisions are fast in both very simple and very complex problems: in simple problems it is quick to understand which alternative is best, while in complex problems it would be too costly -- an insight which extends to general costly information acquisition models. This non-monotonicity also underlies an ambiguous relationship between response time and ability, whereby higher ability entails slower decisions in very complex problems, but faster decisions in simple problems. Finally, this paper proposes a new method to correctly infer problem complexity based on the finding that choices react more to changes in incentives in mo",
    "link": "https://arxiv.org/abs/2403.11240",
    "context": "Title: Speed, Accuracy, and Complexity\nAbstract: arXiv:2403.11240v1 Announce Type: new  Abstract: This paper re-examines the validity of using response time to infer problem complexity. It revisits a canonical Wald model of optimal stopping, taking signal-to-noise ratio as a measure of problem complexity. While choice quality is monotone in problem complexity, expected stopping time is inverse $U$-shaped. Indeed decisions are fast in both very simple and very complex problems: in simple problems it is quick to understand which alternative is best, while in complex problems it would be too costly -- an insight which extends to general costly information acquisition models. This non-monotonicity also underlies an ambiguous relationship between response time and ability, whereby higher ability entails slower decisions in very complex problems, but faster decisions in simple problems. Finally, this paper proposes a new method to correctly infer problem complexity based on the finding that choices react more to changes in incentives in mo",
    "path": "papers/24/03/2403.11240.json",
    "total_tokens": 876,
    "translated_title": "速度、准确性和复杂性",
    "translated_abstract": "这篇论文重新审视了使用反应时间来推断问题复杂性的有效性。重新审视了一个经典的Wald模型，将信噪比作为问题复杂性的度量。虽然在问题复杂性上，选择质量是单调的，但期望的停止时间是倒U形的。事实上，决策在非常简单和非常复杂的问题中都很快：在简单问题中很快就能理解哪个选择是最好的，而在复杂问题中将会成本过高--这一洞察力也适用于一般的昂贵信息获取模型。这种非单调性也构成了反应时间与能力之间模糊关系的基础，即更高的能力意味着在非常复杂的问题中决策更慢，但在简单问题中决策更快。最后，本文提出了一种新方法，根据选择对激励变化的反应更多来正确推断问题的复杂性。",
    "tldr": "本文重新审视了使用反应时间来推断问题复杂性的有效性，提出了一个新方法来正确推断问题的复杂性，强调了在简单和复杂问题中决策速度都很快的特点，并探讨了反应时间与能力之间的非单调关系。"
}