{
    "title": "IME: Integrating Multi-curvature Shared and Specific Embedding for Temporal Knowledge Graph Completion",
    "abstract": "arXiv:2403.19881v1 Announce Type: new  Abstract: Temporal Knowledge Graphs (TKGs) incorporate a temporal dimension, allowing for a precise capture of the evolution of knowledge and reflecting the dynamic nature of the real world. Typically, TKGs contain complex geometric structures, with various geometric structures interwoven. However, existing Temporal Knowledge Graph Completion (TKGC) methods either model TKGs in a single space or neglect the heterogeneity of different curvature spaces, thus constraining their capacity to capture these intricate geometric structures. In this paper, we propose a novel Integrating Multi-curvature shared and specific Embedding (IME) model for TKGC tasks. Concretely, IME models TKGs into multi-curvature spaces, including hyperspherical, hyperbolic, and Euclidean spaces. Subsequently, IME incorporates two key properties, namely space-shared property and space-specific property. The space-shared property facilitates the learning of commonalities across di",
    "link": "https://arxiv.org/abs/2403.19881",
    "context": "Title: IME: Integrating Multi-curvature Shared and Specific Embedding for Temporal Knowledge Graph Completion\nAbstract: arXiv:2403.19881v1 Announce Type: new  Abstract: Temporal Knowledge Graphs (TKGs) incorporate a temporal dimension, allowing for a precise capture of the evolution of knowledge and reflecting the dynamic nature of the real world. Typically, TKGs contain complex geometric structures, with various geometric structures interwoven. However, existing Temporal Knowledge Graph Completion (TKGC) methods either model TKGs in a single space or neglect the heterogeneity of different curvature spaces, thus constraining their capacity to capture these intricate geometric structures. In this paper, we propose a novel Integrating Multi-curvature shared and specific Embedding (IME) model for TKGC tasks. Concretely, IME models TKGs into multi-curvature spaces, including hyperspherical, hyperbolic, and Euclidean spaces. Subsequently, IME incorporates two key properties, namely space-shared property and space-specific property. The space-shared property facilitates the learning of commonalities across di",
    "path": "papers/24/03/2403.19881.json",
    "total_tokens": 858,
    "translated_title": "IME：集成多曲率共享和特定嵌入用于时间知识图完成",
    "translated_abstract": "时间知识图（TKG）融合了时间维度，允许精确捕捉知识的演化并反映现实世界的动态特性。通常，TKG包含复杂的几何结构，各种几何结构交织在一起。然而，现有的时间知识图完成（TKGC）方法要么将TKG建模在一个空间中，要么忽略不同曲率空间的异质性，从而限制了捕捉这些复杂几何结构的能力。在本文中，我们提出了一种新颖的集成多曲率共享和特定嵌入（IME）模型用于TKGC任务。具体而言，IME将TKG建模为多曲率空间，包括超球面、双曲线和欧几里得空间。随后，IME融合了两个关键属性，即空间共享属性和空间特定属性。",
    "tldr": "IME模型用于时间知识图完成任务，将知识图建模为多曲率空间，包括超球面、双曲线和欧几里得空间，并融合空间共享属性和空间特定属性。",
    "en_tdlr": "The IME model is used for temporal knowledge graph completion tasks, modeling knowledge graphs into multi-curvature spaces including hyperspherical, hyperbolic, and Euclidean spaces, and incorporating space-shared and space-specific properties."
}