{
    "title": "Multi-Task Learning Using Uncertainty to Weigh Losses for Heterogeneous Face Attribute Estimation",
    "abstract": "arXiv:2403.00561v1 Announce Type: cross  Abstract: Face images contain a wide variety of attribute information. In this paper, we propose a generalized framework for joint estimation of ordinal and nominal attributes based on information sharing. We tackle the correlation problem between heterogeneous attributes using hard parameter sharing of shallow features, and trade-off multiple loss functions by considering homoskedastic uncertainty for each attribute estimation task. This leads to optimal estimation of multiple attributes of the face and reduces the training cost of multitask learning. Experimental results on benchmarks with multiple face attributes show that the proposed approach has superior performance compared to state of the art. Finally, we discuss the bias issues arising from the proposed approach in face attribute estimation and validate its feasibility on edge systems.",
    "link": "https://arxiv.org/abs/2403.00561",
    "context": "Title: Multi-Task Learning Using Uncertainty to Weigh Losses for Heterogeneous Face Attribute Estimation\nAbstract: arXiv:2403.00561v1 Announce Type: cross  Abstract: Face images contain a wide variety of attribute information. In this paper, we propose a generalized framework for joint estimation of ordinal and nominal attributes based on information sharing. We tackle the correlation problem between heterogeneous attributes using hard parameter sharing of shallow features, and trade-off multiple loss functions by considering homoskedastic uncertainty for each attribute estimation task. This leads to optimal estimation of multiple attributes of the face and reduces the training cost of multitask learning. Experimental results on benchmarks with multiple face attributes show that the proposed approach has superior performance compared to state of the art. Finally, we discuss the bias issues arising from the proposed approach in face attribute estimation and validate its feasibility on edge systems.",
    "path": "papers/24/03/2403.00561.json",
    "total_tokens": 791,
    "translated_title": "使用不确定性加权损失进行异构人脸属性估计的多任务学习",
    "translated_abstract": "人脸图像包含各种属性信息。本文提出了一种基于信息共享的联合估计有序和名义属性的通用框架。我们通过对浅层特征进行硬参数共享来解决异构属性之间的相关性问题，并通过考虑每个属性估计任务的同方差不确定性来权衡多个损失函数。这导致了对人脸的多个属性进行最佳估计，并减少了多任务学习的训练成本。在具有多个人脸属性的基准测试上的实验结果表明，所提出的方法相比最先进技术表现出更优越的性能。最后，我们讨论了提出方法在人脸属性估计中引起的偏见问题，并验证了它在边缘系统上的可行性。",
    "tldr": "提出了一种使用不确定性加权损失进行多任务学习的通用框架，通过硬参数共享解决了异构属性之间的相关性问题，取得了对多个人脸属性的最佳估计效果，并降低了训练成本。",
    "en_tdlr": "A generalized framework for multi-task learning using uncertainty to weigh losses is proposed, addressing the correlation issue between heterogeneous attributes through hard parameter sharing, achieving optimal estimation of multiple face attributes while reducing training cost."
}