{
    "title": "Pantypes: Diverse Representatives for Self-Explainable Models",
    "abstract": "arXiv:2403.09383v1 Announce Type: cross  Abstract: Prototypical self-explainable classifiers have emerged to meet the growing demand for interpretable AI systems. These classifiers are designed to incorporate high transparency in their decisions by basing inference on similarity with learned prototypical objects. While these models are designed with diversity in mind, the learned prototypes often do not sufficiently represent all aspects of the input distribution, particularly those in low density regions. Such lack of sufficient data representation, known as representation bias, has been associated with various detrimental properties related to machine learning diversity and fairness. In light of this, we introduce pantypes, a new family of prototypical objects designed to capture the full diversity of the input distribution through a sparse set of objects. We show that pantypes can empower prototypical self-explainable models by occupying divergent regions of the latent space and thu",
    "link": "https://arxiv.org/abs/2403.09383",
    "context": "Title: Pantypes: Diverse Representatives for Self-Explainable Models\nAbstract: arXiv:2403.09383v1 Announce Type: cross  Abstract: Prototypical self-explainable classifiers have emerged to meet the growing demand for interpretable AI systems. These classifiers are designed to incorporate high transparency in their decisions by basing inference on similarity with learned prototypical objects. While these models are designed with diversity in mind, the learned prototypes often do not sufficiently represent all aspects of the input distribution, particularly those in low density regions. Such lack of sufficient data representation, known as representation bias, has been associated with various detrimental properties related to machine learning diversity and fairness. In light of this, we introduce pantypes, a new family of prototypical objects designed to capture the full diversity of the input distribution through a sparse set of objects. We show that pantypes can empower prototypical self-explainable models by occupying divergent regions of the latent space and thu",
    "path": "papers/24/03/2403.09383.json",
    "total_tokens": 809,
    "translated_title": "Pantypes: 代表各种类型的自解释模型",
    "translated_abstract": "随着对可解释人工智能系统日益增长的需求，原型自解释分类器已经出现。这些分类器旨在通过基于与学习的原型对象的相似性进行推理，以在决策中融入高透明度。虽然这些模型在设计时考虑了多样性，但学习的原型对象通常并不足以充分代表所有输入分布的方面，尤其是低密度区域中的方面。这种不足的数据表示，即表示偏差，已经与与机器学习多样性和公平性相关的各种有害特性联系起来。鉴于此，我们引入了pantypes，一种旨在通过一组稀疏对象捕获输入分布的全部多样性的原型对象家族。我们展示pantypes可以通过占据潜在空间中的不同区域来增强原型自解释模型",
    "tldr": "引入了pantypes，一种旨在通过一组稀疏对象捕获输入分布的全部多样性的原型对象家族，可以大大增强原型自解释模型。",
    "en_tdlr": "Introducing pantypes, a new family of prototypical objects designed to capture the full diversity of the input distribution through a sparse set of objects, which can significantly empower prototypical self-explainable models."
}