{
    "title": "Covid-19 detection from CT scans using EfficientNet and Attention mechanism",
    "abstract": "arXiv:2403.11505v1 Announce Type: cross  Abstract: Manual diagnosis and analysis of COVID-19 through the examination of lung Computed Tomography (CT) scan images by physicians tends to result in inefficiency, especially with high patient volumes and numerous images per patient. We address the need for automation by developing a deep learning model-based pipeline for COVID-19 detection from CT scan images of the lungs. The Domain adaptation, Explainability, and Fairness in AI for Medical Image Analysis Workshop and COVID-19 Diagnosis Competition (DEF-AI-MIA COV19D) provides an opportunity to assess our designed pipeline for COVID-19 detection from CT scan images. The proposed pipeline incorporates EfficientNet with an Attention mechanism with a pre-processing step. Our pipeline outperforms last year's teams on the validation set of the competition dataset.",
    "link": "https://arxiv.org/abs/2403.11505",
    "context": "Title: Covid-19 detection from CT scans using EfficientNet and Attention mechanism\nAbstract: arXiv:2403.11505v1 Announce Type: cross  Abstract: Manual diagnosis and analysis of COVID-19 through the examination of lung Computed Tomography (CT) scan images by physicians tends to result in inefficiency, especially with high patient volumes and numerous images per patient. We address the need for automation by developing a deep learning model-based pipeline for COVID-19 detection from CT scan images of the lungs. The Domain adaptation, Explainability, and Fairness in AI for Medical Image Analysis Workshop and COVID-19 Diagnosis Competition (DEF-AI-MIA COV19D) provides an opportunity to assess our designed pipeline for COVID-19 detection from CT scan images. The proposed pipeline incorporates EfficientNet with an Attention mechanism with a pre-processing step. Our pipeline outperforms last year's teams on the validation set of the competition dataset.",
    "path": "papers/24/03/2403.11505.json",
    "total_tokens": 639,
    "translated_title": "使用EfficientNet和注意力机制从CT扫描中检测Covid-19",
    "translated_abstract": "通过深度学习模型，我们开发了一个基于管道的COVID-19检测方法，用于从肺部CT扫描图像中检测COVID-19。我们的方法结合了EfficientNet和注意力机制，并取得了比去年竞赛数据集验证集上的其他团队更好的结果。",
    "tldr": "开发了一个基于深度学习模型的管道，结合EfficientNet和注意力机制，用于从肺部CT扫描图像中检测COVID-19，并在竞赛数据集验证集上表现优异",
    "en_tdlr": "Developed a pipeline based on deep learning model, combining EfficientNet and Attention mechanism for detecting COVID-19 from lung CT scan images, and outperformed other teams on the validation set of the competition dataset."
}