{
    "title": "SocialPET: Socially Informed Pattern Exploiting Training for Few-Shot Stance Detection in Social Media",
    "abstract": "arXiv:2403.05216v1 Announce Type: new  Abstract: Stance detection, as the task of determining the viewpoint of a social media post towards a target as 'favor' or 'against', has been understudied in the challenging yet realistic scenario where there is limited labeled data for a certain target. Our work advances research in few-shot stance detection by introducing SocialPET, a socially informed approach to leveraging language models for the task. Our proposed approach builds on the Pattern Exploiting Training (PET) technique, which addresses classification tasks as cloze questions through the use of language models. To enhance the approach with social awareness, we exploit the social network structure surrounding social media posts. We prove the effectiveness of SocialPET on two stance datasets, Multi-target and P-Stance, outperforming competitive stance detection models as well as the base model, PET, where the labeled instances for the target under study is as few as 100. When we delv",
    "link": "https://arxiv.org/abs/2403.05216",
    "context": "Title: SocialPET: Socially Informed Pattern Exploiting Training for Few-Shot Stance Detection in Social Media\nAbstract: arXiv:2403.05216v1 Announce Type: new  Abstract: Stance detection, as the task of determining the viewpoint of a social media post towards a target as 'favor' or 'against', has been understudied in the challenging yet realistic scenario where there is limited labeled data for a certain target. Our work advances research in few-shot stance detection by introducing SocialPET, a socially informed approach to leveraging language models for the task. Our proposed approach builds on the Pattern Exploiting Training (PET) technique, which addresses classification tasks as cloze questions through the use of language models. To enhance the approach with social awareness, we exploit the social network structure surrounding social media posts. We prove the effectiveness of SocialPET on two stance datasets, Multi-target and P-Stance, outperforming competitive stance detection models as well as the base model, PET, where the labeled instances for the target under study is as few as 100. When we delv",
    "path": "papers/24/03/2403.05216.json",
    "total_tokens": 836,
    "translated_title": "SocialPET: 社交信息模式利用训练用于社交媒体中的少样本立场检测",
    "translated_abstract": "立场检测是指确定社交媒体帖子对于特定目标的观点是否“赞成”或“反对”的任务，在具有限制的标记数据的挑战性但现实情景中一直研究不足。本研究通过引入SocialPET，提出了一种社交信息引导的方法来利用语言模型进行这一任务的研究。我们提出的方法建立在Pattern Exploiting Training (PET) 技术之上，该技术通过使用语言模型将分类任务处理为填空问题。为了增强该方法的社交意识，我们利用社交媒体帖子周围的社交网络结构。我们证明了SocialPET在两个立场数据集Multi-target和P-Stance上的有效性，优于竞争性立场检测模型以及基准模型PET，即针对研究对象标记实例仅为100左右情况下。",
    "tldr": "SocialPET 是一种社交信息引导的方法，通过结合语言模型和社交网络结构来进行立场检测，在少样本情况下优于其他竞争模型。",
    "en_tdlr": "SocialPET is a socially informed method that leverages language models and social network structure for stance detection, outperforming other competitive models in low-data scenarios."
}