{
    "title": "How Private is DP-SGD?",
    "abstract": "arXiv:2403.17673v1 Announce Type: new  Abstract: We demonstrate a substantial gap between the privacy guarantees of the Adaptive Batch Linear Queries (ABLQ) mechanism under different types of batch sampling: (i) Shuffling, and (ii) Poisson subsampling; the typical analysis of Differentially Private Stochastic Gradient Descent (DP-SGD) follows by interpreting it as a post-processing of ABLQ. While shuffling based DP-SGD is more commonly used in practical implementations, it is neither analytically nor numerically amenable to easy privacy analysis. On the other hand, Poisson subsampling based DP-SGD is challenging to scalably implement, but has a well-understood privacy analysis, with multiple open-source numerically tight privacy accountants available. This has led to a common practice of using shuffling based DP-SGD in practice, but using the privacy analysis for the corresponding Poisson subsampling version. Our result shows that there can be a substantial gap between the privacy anal",
    "link": "https://arxiv.org/abs/2403.17673",
    "context": "Title: How Private is DP-SGD?\nAbstract: arXiv:2403.17673v1 Announce Type: new  Abstract: We demonstrate a substantial gap between the privacy guarantees of the Adaptive Batch Linear Queries (ABLQ) mechanism under different types of batch sampling: (i) Shuffling, and (ii) Poisson subsampling; the typical analysis of Differentially Private Stochastic Gradient Descent (DP-SGD) follows by interpreting it as a post-processing of ABLQ. While shuffling based DP-SGD is more commonly used in practical implementations, it is neither analytically nor numerically amenable to easy privacy analysis. On the other hand, Poisson subsampling based DP-SGD is challenging to scalably implement, but has a well-understood privacy analysis, with multiple open-source numerically tight privacy accountants available. This has led to a common practice of using shuffling based DP-SGD in practice, but using the privacy analysis for the corresponding Poisson subsampling version. Our result shows that there can be a substantial gap between the privacy anal",
    "path": "papers/24/03/2403.17673.json",
    "total_tokens": 891,
    "translated_title": "DP-SGD的隐私性有多私密？",
    "translated_abstract": "我们展示了在不同类型的批处理采样下，自适应批量线性查询（ABLQ）机制的隐私保证之间存在着实质性差距：（i）洗牌，和（ii）泊松子采样；典型的差分隐私随机梯度下降（DP-SGD）分析通过将其解释为ABLQ的后处理来进行。虽然基于洗牌的DP-SGD在实际实现中更常用，但它在隐私分析上既不易于解析也不易于数值计算。另一方面，基于泊松子采样的DP-SGD难以实现可扩展性，但具有良好理解的隐私分析，有多个开源的数值紧密的隐私账户可用。这导致了在实践中常见的做法，即使用基于洗牌的DP-SGD，但使用相应泊松子采样版本的隐私分析。我们的结果表明，隐私分析之间可能存在实质性差距",
    "tldr": "ABLQ机制在不同批处理采样下的隐私保证存在实质性差距，DP-SGD的实际实现通常使用基于洗牌的方法，但更可靠的隐私分析却来自于基于泊松子采样的方法。",
    "en_tdlr": "There is a substantial gap in privacy guarantees of the ABLQ mechanism under different batch sampling methods, with DP-SGD commonly implemented using shuffling but relying on more reliable privacy analysis from Poisson subsampling."
}