{
    "title": "Measuring Technological Convergence in Encryption Technologies with Proximity Indices: A Text Mining and Bibliometric Analysis using OpenAlex",
    "abstract": "arXiv:2403.01601v1 Announce Type: cross  Abstract: Identifying technological convergence among emerging technologies in cybersecurity is crucial for advancing science and fostering innovation. Unlike previous studies focusing on the binary relationship between a paper and the concept it attributes to technology, our approach utilizes attribution scores to enhance the relationships between research papers, combining keywords, citation rates, and collaboration status with specific technological concepts. The proposed method integrates text mining and bibliometric analyses to formulate and predict technological proximity indices for encryption technologies using the \"OpenAlex\" catalog. Our case study findings highlight a significant convergence between blockchain and public-key cryptography, evidenced by the increasing proximity indices. These results offer valuable strategic insights for those contemplating investments in these domains.",
    "link": "https://arxiv.org/abs/2403.01601",
    "context": "Title: Measuring Technological Convergence in Encryption Technologies with Proximity Indices: A Text Mining and Bibliometric Analysis using OpenAlex\nAbstract: arXiv:2403.01601v1 Announce Type: cross  Abstract: Identifying technological convergence among emerging technologies in cybersecurity is crucial for advancing science and fostering innovation. Unlike previous studies focusing on the binary relationship between a paper and the concept it attributes to technology, our approach utilizes attribution scores to enhance the relationships between research papers, combining keywords, citation rates, and collaboration status with specific technological concepts. The proposed method integrates text mining and bibliometric analyses to formulate and predict technological proximity indices for encryption technologies using the \"OpenAlex\" catalog. Our case study findings highlight a significant convergence between blockchain and public-key cryptography, evidenced by the increasing proximity indices. These results offer valuable strategic insights for those contemplating investments in these domains.",
    "path": "papers/24/03/2403.01601.json",
    "total_tokens": 838,
    "translated_title": "使用Proximity Indices测量加密技术中的技术融合：基于OpenAlex的文本挖掘和文献计量分析",
    "translated_abstract": "确定网络安全领域新兴技术之间的技术融合对于推动科学发展和促进创新至关重要。我们的方法不同于以往研究仅关注论文与技术概念之间的二元关系，而是利用归因分数增强研究论文之间的关系，结合关键词、引用率和合作状态等与特定技术概念相关的因素。提出的方法整合了文本挖掘和文献计量分析，利用“OpenAlex”目录制定并预测加密技术的技术接近度指数。我们的案例研究结果突显了区块链与公钥密码学之间显著的融合，表现为接近度指数的增加。这些结果为那些考虑在这些领域进行投资的人提供了宝贵的战略见解。",
    "tldr": "该研究利用文本挖掘和文献计量分析方法，基于OpenAlex目录，预测了加密技术的技术接近度指数，发现了区块链与公钥密码学之间显著的技术融合。",
    "en_tdlr": "This study predicts technological proximity indices for encryption technologies using text mining and bibliometric analyses based on the OpenAlex catalog, revealing significant technological convergence between blockchain and public-key cryptography."
}