{
    "title": "Low-Resource Court Judgment Summarization for Common Law Systems",
    "abstract": "arXiv:2403.04454v1 Announce Type: cross  Abstract: Common law courts need to refer to similar precedents' judgments to inform their current decisions. Generating high-quality summaries of court judgment documents can facilitate legal practitioners to efficiently review previous cases and assist the general public in accessing how the courts operate and how the law is applied. Previous court judgment summarization research focuses on civil law or a particular jurisdiction's judgments. However, judges can refer to the judgments from all common law jurisdictions. Current summarization datasets are insufficient to satisfy the demands of summarizing precedents across multiple jurisdictions, especially when labeled data are scarce for many jurisdictions. To address the lack of datasets, we present CLSum, the first dataset for summarizing multi-jurisdictional common law court judgment documents. Besides, this is the first court judgment summarization work adopting large language models (LLMs)",
    "link": "https://arxiv.org/abs/2403.04454",
    "context": "Title: Low-Resource Court Judgment Summarization for Common Law Systems\nAbstract: arXiv:2403.04454v1 Announce Type: cross  Abstract: Common law courts need to refer to similar precedents' judgments to inform their current decisions. Generating high-quality summaries of court judgment documents can facilitate legal practitioners to efficiently review previous cases and assist the general public in accessing how the courts operate and how the law is applied. Previous court judgment summarization research focuses on civil law or a particular jurisdiction's judgments. However, judges can refer to the judgments from all common law jurisdictions. Current summarization datasets are insufficient to satisfy the demands of summarizing precedents across multiple jurisdictions, especially when labeled data are scarce for many jurisdictions. To address the lack of datasets, we present CLSum, the first dataset for summarizing multi-jurisdictional common law court judgment documents. Besides, this is the first court judgment summarization work adopting large language models (LLMs)",
    "path": "papers/24/03/2403.04454.json",
    "total_tokens": 848,
    "translated_title": "低资源条件下普通法系统法院判决摘要",
    "translated_abstract": "普通法法院需要参考类似判例的判决来指导其当前的决定。生成高质量的法院判决文档摘要可以帮助法律从业者高效地审查先前的案例，并协助公众了解法院运作方式及法律如何适用。先前的法院判决摘要研究着重于民法或特定司法管辖区的判决。然而，法官可以参考所有普通法司法管辖区的判决。目前的摘要数据集不足以满足跨多个司法管辖区概括判例的要求，尤其是对于许多司法管辖区缺乏标记数据。为解决数据集不足问题，本文提出了CLSum，这是第一个用于总结多司法管辖区普通法法院判决文档的数据集。此外，这是第一个采用大型语言模型（LLMs）的法院判决摘要工作。",
    "tldr": "提出了用于普通法系统的跨多司法管辖区法院判决文档摘要的第一个数据集CLSum，并首次采用大型语言模型（LLMs）进行判决摘要工作。",
    "en_tdlr": "Introduced the first dataset CLSum for summarizing common law court judgment documents across multiple jurisdictions and the first work on court judgment summarization using large language models (LLMs)."
}