{
    "title": "SteinGen: Generating Fidelitous and Diverse Graph Samples",
    "abstract": "arXiv:2403.18578v1 Announce Type: cross  Abstract: Generating graphs that preserve characteristic structures while promoting sample diversity can be challenging, especially when the number of graph observations is small. Here, we tackle the problem of graph generation from only one observed graph. The classical approach of graph generation from parametric models relies on the estimation of parameters, which can be inconsistent or expensive to compute due to intractable normalisation constants. Generative modelling based on machine learning techniques to generate high-quality graph samples avoids parameter estimation but usually requires abundant training samples. Our proposed generating procedure, SteinGen, which is phrased in the setting of graphs as realisations of exponential random graph models, combines ideas from Stein's method and MCMC by employing Markovian dynamics which are based on a Stein operator for the target model. SteinGen uses the Glauber dynamics associated with an e",
    "link": "https://arxiv.org/abs/2403.18578",
    "context": "Title: SteinGen: Generating Fidelitous and Diverse Graph Samples\nAbstract: arXiv:2403.18578v1 Announce Type: cross  Abstract: Generating graphs that preserve characteristic structures while promoting sample diversity can be challenging, especially when the number of graph observations is small. Here, we tackle the problem of graph generation from only one observed graph. The classical approach of graph generation from parametric models relies on the estimation of parameters, which can be inconsistent or expensive to compute due to intractable normalisation constants. Generative modelling based on machine learning techniques to generate high-quality graph samples avoids parameter estimation but usually requires abundant training samples. Our proposed generating procedure, SteinGen, which is phrased in the setting of graphs as realisations of exponential random graph models, combines ideas from Stein's method and MCMC by employing Markovian dynamics which are based on a Stein operator for the target model. SteinGen uses the Glauber dynamics associated with an e",
    "path": "papers/24/03/2403.18578.json",
    "total_tokens": 711,
    "translated_title": "SteinGen: 生成忠实和多样化的图样本",
    "translated_abstract": "生成保留特征结构并促进样本多样性的图形可能具有挑战性，特别是当图形观察数量较少时。在这里，我们解决了仅从一个观察到的图形生成图形的问题。通过在图形的设置中以指数随机图形模型的形式表达，我们提出的生成过程SteinGen结合了Stein方法和基于MCMC的马尔可夫动力学的思想，该动力学基于目标模型的Stein算子。SteinGen使用与e相关联的Glauber动力学",
    "tldr": "SteinGen是一种生成高质量图样本的新方法，结合了Stein方法和MCMC动力学，适用于只有一次观察到的图形，避免了参数估计的需求。",
    "en_tdlr": "SteinGen is a novel method for generating high-quality graph samples, combining Stein's method and MCMC dynamics, suitable for generating graphs from only one observed instance, avoiding the need for parameter estimation."
}