{
    "title": "Safety Analysis of Autonomous Railway Systems: An Introduction to the SACRED Methodology",
    "abstract": "arXiv:2403.12114v1 Announce Type: cross  Abstract: As the railway industry increasingly seeks to introduce autonomy and machine learning (ML), several questions arise. How can safety be assured for such systems and technologies? What is the applicability of current safety standards within this new technological landscape? What are the key metrics to classify a system as safe? Currently, safety analysis for the railway reflects the failure modes of existing technology; in contrast, the primary concern of analysis of automation is typically average performance. Such purely statistical approaches to measuring ML performance are limited, as they may overlook classes of situations that may occur rarely but in which the function performs consistently poorly. To combat these difficulties we introduce SACRED, a safety methodology for producing an initial safety case and determining important safety metrics for autonomous systems. The development of SACRED is motivated by the proposed GoA-4 lig",
    "link": "https://arxiv.org/abs/2403.12114",
    "context": "Title: Safety Analysis of Autonomous Railway Systems: An Introduction to the SACRED Methodology\nAbstract: arXiv:2403.12114v1 Announce Type: cross  Abstract: As the railway industry increasingly seeks to introduce autonomy and machine learning (ML), several questions arise. How can safety be assured for such systems and technologies? What is the applicability of current safety standards within this new technological landscape? What are the key metrics to classify a system as safe? Currently, safety analysis for the railway reflects the failure modes of existing technology; in contrast, the primary concern of analysis of automation is typically average performance. Such purely statistical approaches to measuring ML performance are limited, as they may overlook classes of situations that may occur rarely but in which the function performs consistently poorly. To combat these difficulties we introduce SACRED, a safety methodology for producing an initial safety case and determining important safety metrics for autonomous systems. The development of SACRED is motivated by the proposed GoA-4 lig",
    "path": "papers/24/03/2403.12114.json",
    "total_tokens": 654,
    "translated_title": "自主铁路系统安全分析：SACRED方法论简介",
    "translated_abstract": "随着铁路行业越来越倾向于引入自主性和机器学习（ML），一些问题随之而来。如何确保这些系统和技术的安全？当前的安全分析反映了现有技术的故障模式；相比之下，自动化分析的主要关注点通常是平均表现。为了解决这些困难，我们介绍了SACRED，这是一个用于为自主系统生成初步安全方案并确定重要安全指标的安全方法论。",
    "tldr": "SACRED是一种安全方法论，用于为自主系统生成初步安全方案并确定重要安全指标。",
    "en_tdlr": "SACRED is a safety methodology for producing an initial safety case and determining important safety metrics for autonomous systems."
}