{
    "title": "Towards Graph Foundation Models for Personalization",
    "abstract": "arXiv:2403.07478v1 Announce Type: cross  Abstract: In the realm of personalization, integrating diverse information sources such as consumption signals and content-based representations is becoming increasingly critical to build state-of-the-art solutions. In this regard, two of the biggest trends in research around this subject are Graph Neural Networks (GNNs) and Foundation Models (FMs). While GNNs emerged as a popular solution in industry for powering personalization at scale, FMs have only recently caught attention for their promising performance in personalization tasks like ranking and retrieval. In this paper, we present a graph-based foundation modeling approach tailored to personalization. Central to this approach is a Heterogeneous GNN (HGNN) designed to capture multi-hop content and consumption relationships across a range of recommendable item types. To ensure the generality required from a Foundation Model, we employ a Large Language Model (LLM) text-based featurization of",
    "link": "https://arxiv.org/abs/2403.07478",
    "context": "Title: Towards Graph Foundation Models for Personalization\nAbstract: arXiv:2403.07478v1 Announce Type: cross  Abstract: In the realm of personalization, integrating diverse information sources such as consumption signals and content-based representations is becoming increasingly critical to build state-of-the-art solutions. In this regard, two of the biggest trends in research around this subject are Graph Neural Networks (GNNs) and Foundation Models (FMs). While GNNs emerged as a popular solution in industry for powering personalization at scale, FMs have only recently caught attention for their promising performance in personalization tasks like ranking and retrieval. In this paper, we present a graph-based foundation modeling approach tailored to personalization. Central to this approach is a Heterogeneous GNN (HGNN) designed to capture multi-hop content and consumption relationships across a range of recommendable item types. To ensure the generality required from a Foundation Model, we employ a Large Language Model (LLM) text-based featurization of",
    "path": "papers/24/03/2403.07478.json",
    "total_tokens": 806,
    "translated_title": "面向个性化的图基础模型",
    "translated_abstract": "在个性化领域，整合消费信号和基于内容的表示等多样信息源变得日益关键，以构建最先进的解决方案。在这方面，围绕Graph Neural Networks（GNNs）和Foundation Models（FMs）的研究存在两大趋势。虽然GNNs成为工业界在规模上实现个性化的热门解决方案，但FMs最近才因其在排名和检索等个性化任务中表现出色而受到关注。本文提出了一种针对个性化的基于图的基础建模方法。该方法的核心是一种设计用于捕捉跨各种可推荐项目类型的多跳内容和消费关系的异质GNN（HGNN）。为确保基础模型所需的一般性，我们采用了基于大语言模型（LLM）的文本特征化方法。",
    "tldr": "本文提出了一种面向个性化的基于图的基础建模方法，其中的Heterogeneous GNN旨在捕捉跨多种可推荐项目类型的多跳内容和消费关系。",
    "en_tdlr": "This paper presents a graph-based foundation modeling approach tailored to personalization, with a Heterogeneous GNN designed to capture multi-hop content and consumption relationships across various recommendable item types."
}