{
    "title": "I would love this to be like an assistant, not the teacher: a voice of the customer perspective of what distance learning students want from an Artificial Intelligence Digital Assistant",
    "abstract": "arXiv:2403.15396v1 Announce Type: cross  Abstract: With the release of Generative AI systems such as ChatGPT, an increasing interest in using Artificial Intelligence (AI) has been observed across domains, including higher education. While emerging statistics show the popularity of using AI amongst undergraduate students, little is yet known about students' perceptions regarding AI including self-reported benefits and concerns from their actual usage, in particular in distance learning contexts. Using a two-step, mixed-methods approach, we examined the perceptions of ten online and distance learning students from diverse disciplines regarding the design of a hypothetical AI Digital Assistant (AIDA). In the first step, we captured students' perceptions via interviews, while the second step supported the triangulation of data by enabling students to share, compare, and contrast perceptions with those of peers. All participants agreed on the usefulness of such an AI tool while studying and",
    "link": "https://arxiv.org/abs/2403.15396",
    "context": "Title: I would love this to be like an assistant, not the teacher: a voice of the customer perspective of what distance learning students want from an Artificial Intelligence Digital Assistant\nAbstract: arXiv:2403.15396v1 Announce Type: cross  Abstract: With the release of Generative AI systems such as ChatGPT, an increasing interest in using Artificial Intelligence (AI) has been observed across domains, including higher education. While emerging statistics show the popularity of using AI amongst undergraduate students, little is yet known about students' perceptions regarding AI including self-reported benefits and concerns from their actual usage, in particular in distance learning contexts. Using a two-step, mixed-methods approach, we examined the perceptions of ten online and distance learning students from diverse disciplines regarding the design of a hypothetical AI Digital Assistant (AIDA). In the first step, we captured students' perceptions via interviews, while the second step supported the triangulation of data by enabling students to share, compare, and contrast perceptions with those of peers. All participants agreed on the usefulness of such an AI tool while studying and",
    "path": "papers/24/03/2403.15396.json",
    "total_tokens": 871,
    "translated_title": "我希望这是一个助手，而不是老师：远程学习学生希望从人工智能数字助手那里得到的客户观点",
    "translated_abstract": "随着ChatGPT等生成式AI系统的发布，人们对使用人工智能（AI）的兴趣逐渐增加，在不同领域中包括高等教育。尽管新兴统计数据显示本科生中使用AI的普及度，但对学生对AI的看法，包括他们在实际使用中自报的好处和关注点，特别是在远程学习背景下，目前为止还知之甚少。本研究采用两步法混合方法，分析了来自不同学科的十名在线和远程学习学生对虚拟AI数字助手（AIDA）设计的看法。在第一步中，我们通过采访捕捉了学生的看法，而第二步通过支持学生与同行分享、比较和对比看法的数据三角化。所有参与者都同意在学习时使用这样的AI工具的有效性。",
    "tldr": "通过两步法混合方法研究了十名在线和远程学习学生对虚拟AI数字助手设计的看法，结果显示所有参与者都认为这样的AI工具在学习时是有用的。",
    "en_tdlr": "Explored the perspectives of ten online and distance learning students on the design of a virtual AI digital assistant, with all participants agreeing on the tool's usefulness during studying."
}