{
    "title": "KGUF: Simple Knowledge-aware Graph-based Recommender with User-based Semantic Features Filtering",
    "abstract": "arXiv:2403.20095v1 Announce Type: new  Abstract: The recent integration of Graph Neural Networks (GNNs) into recommendation has led to a novel family of Collaborative Filtering (CF) approaches, namely Graph Collaborative Filtering (GCF). Following the same GNNs wave, recommender systems exploiting Knowledge Graphs (KGs) have also been successfully empowered by the GCF rationale to combine the representational power of GNNs with the semantics conveyed by KGs, giving rise to Knowledge-aware Graph Collaborative Filtering (KGCF), which use KGs to mine hidden user intent. Nevertheless, empirical evidence suggests that computing and combining user-level intent might not always be necessary, as simpler approaches can yield comparable or superior results while keeping explicit semantic features. Under this perspective, user historical preferences become essential to refine the KG and retain the most discriminating features, thus leading to concise item representation. Driven by the assumptions",
    "link": "https://arxiv.org/abs/2403.20095",
    "context": "Title: KGUF: Simple Knowledge-aware Graph-based Recommender with User-based Semantic Features Filtering\nAbstract: arXiv:2403.20095v1 Announce Type: new  Abstract: The recent integration of Graph Neural Networks (GNNs) into recommendation has led to a novel family of Collaborative Filtering (CF) approaches, namely Graph Collaborative Filtering (GCF). Following the same GNNs wave, recommender systems exploiting Knowledge Graphs (KGs) have also been successfully empowered by the GCF rationale to combine the representational power of GNNs with the semantics conveyed by KGs, giving rise to Knowledge-aware Graph Collaborative Filtering (KGCF), which use KGs to mine hidden user intent. Nevertheless, empirical evidence suggests that computing and combining user-level intent might not always be necessary, as simpler approaches can yield comparable or superior results while keeping explicit semantic features. Under this perspective, user historical preferences become essential to refine the KG and retain the most discriminating features, thus leading to concise item representation. Driven by the assumptions",
    "path": "papers/24/03/2403.20095.json",
    "total_tokens": 816,
    "translated_title": "KGUF: 带有基于用户的语义特征过滤的简单知识感知图推荐器",
    "translated_abstract": "最近将图神经网络（GNNs）整合到推荐系统中，引出了一种新颖的协作过滤（CF）方法家族，即图协作过滤（GCF）。顺应同样的GNNs浪潮，利用知识图谱（KGs）的推荐系统也成功地借助GCF原理来结合GNNs的表征能力和KGs传达的语义，从而产生了知识感知图协作过滤（KGCF），利用知识图谱挖掘隐藏的用户意图。然而，经验证据表明，计算和组合用户级意图并非始终必要，因为简单的方法也可以产生相当或优越的结果，同时保留明确的语义特征。在这个角度来看，用户的历史偏好对细化KG和保留最具区分性的特征至关重要，从而实现简洁的物品表示。",
    "tldr": "通过利用用户的历史偏好来精炼知识图谱，保留最具区分性的特征，从而实现简洁的物品表示。",
    "en_tdlr": "Refining the knowledge graph by leveraging user historical preferences to retain the most discriminating features, leading to concise item representation."
}