{
    "title": "Semi-Supervised Multimodal Multi-Instance Learning for Aortic Stenosis Diagnosis",
    "abstract": "arXiv:2403.06024v1 Announce Type: cross  Abstract: Automated interpretation of ultrasound imaging of the heart (echocardiograms) could improve the detection and treatment of aortic stenosis (AS), a deadly heart disease. However, existing deep learning pipelines for assessing AS from echocardiograms have two key limitations. First, most methods rely on limited 2D cineloops, thereby ignoring widely available Doppler imaging that contains important complementary information about pressure gradients and blood flow abnormalities associated with AS. Second, obtaining labeled data is difficult. There are often far more unlabeled echocardiogram recordings available, but these remain underutilized by existing methods. To overcome these limitations, we introduce Semi-supervised Multimodal Multiple-Instance Learning (SMMIL), a new deep learning framework for automatic interpretation for structural heart diseases like AS. When deployed, SMMIL can combine information from two input modalities, spec",
    "link": "https://arxiv.org/abs/2403.06024",
    "context": "Title: Semi-Supervised Multimodal Multi-Instance Learning for Aortic Stenosis Diagnosis\nAbstract: arXiv:2403.06024v1 Announce Type: cross  Abstract: Automated interpretation of ultrasound imaging of the heart (echocardiograms) could improve the detection and treatment of aortic stenosis (AS), a deadly heart disease. However, existing deep learning pipelines for assessing AS from echocardiograms have two key limitations. First, most methods rely on limited 2D cineloops, thereby ignoring widely available Doppler imaging that contains important complementary information about pressure gradients and blood flow abnormalities associated with AS. Second, obtaining labeled data is difficult. There are often far more unlabeled echocardiogram recordings available, but these remain underutilized by existing methods. To overcome these limitations, we introduce Semi-supervised Multimodal Multiple-Instance Learning (SMMIL), a new deep learning framework for automatic interpretation for structural heart diseases like AS. When deployed, SMMIL can combine information from two input modalities, spec",
    "path": "papers/24/03/2403.06024.json",
    "total_tokens": 930,
    "translated_title": "主动脉狭窄诊断的半监督多模态多实例学习",
    "translated_abstract": "arXiv:2403.06024v1 公告类型: 跨领域 自动解释心脏超声心动图心脏超声心动图(imaging of the heart (echocardiograms))可以改善主动脉瓣狭窄(aortic stenosis, AS)的检测和治疗，而目前用于评估AS的深度学习流程存在两个主要限制。首先，大多数方法依赖于有限的2D cineloops，因此忽略了包含与AS相关的压力梯度和血液流动异常等重要互补信息的广泛可用的多普勒(imaging)。其次，获得有标记的数据是困难的。通常存在大量未标记的心脏超声心动图录音可用，但这些数据被现有方法很少利用。为了克服这些限制，我们引入了半监督多模态多实例学习（Semi-supervised Multimodal Multiple-Instance Learning, SMMIL），这是一个新的深度学习框架，可用于自动解释AS等结构性心脏疾病。",
    "tldr": "引入了半监督多模态多实例学习（SMMIL）框架，用于结构性心脏疾病自动解释，克服了心脏超声心动图评估AS时对有限2D cineloops和难以获得标记数据的限制。",
    "en_tdlr": "Introduced the SMMIL framework for automatic interpretation of structural heart diseases, overcoming the limitations of limited 2D cineloops and difficulties in obtaining labeled data for assessing AS from echocardiograms."
}