{
    "title": "Spectral Initialization for High-Dimensional Phase Retrieval with Biased Spatial Directions",
    "abstract": "arXiv:2403.15548v1 Announce Type: cross  Abstract: We explore a spectral initialization method that plays a central role in contemporary research on signal estimation in nonconvex scenarios. In a noiseless phase retrieval framework, we precisely analyze the method's performance in the high-dimensional limit when sensing vectors follow a multivariate Gaussian distribution for two rotationally invariant models of the covariance matrix C. In the first model C is a projector on a lower dimensional space while in the second it is a Wishart matrix. Our analytical results extend the well-established case when C is the identity matrix. Our examination shows that the introduction of biased spatial directions leads to a substantial improvement in the spectral method's effectiveness, particularly when the number of measurements is less than the signal's dimension. This extension also consistently reveals a phase transition phenomenon dependent on the ratio between sample size and signal dimension",
    "link": "https://arxiv.org/abs/2403.15548",
    "context": "Title: Spectral Initialization for High-Dimensional Phase Retrieval with Biased Spatial Directions\nAbstract: arXiv:2403.15548v1 Announce Type: cross  Abstract: We explore a spectral initialization method that plays a central role in contemporary research on signal estimation in nonconvex scenarios. In a noiseless phase retrieval framework, we precisely analyze the method's performance in the high-dimensional limit when sensing vectors follow a multivariate Gaussian distribution for two rotationally invariant models of the covariance matrix C. In the first model C is a projector on a lower dimensional space while in the second it is a Wishart matrix. Our analytical results extend the well-established case when C is the identity matrix. Our examination shows that the introduction of biased spatial directions leads to a substantial improvement in the spectral method's effectiveness, particularly when the number of measurements is less than the signal's dimension. This extension also consistently reveals a phase transition phenomenon dependent on the ratio between sample size and signal dimension",
    "path": "papers/24/03/2403.15548.json",
    "total_tokens": 869,
    "translated_title": "具有偏向空间方向的高维相位恢复的光谱初始化",
    "translated_abstract": "我们探讨了一种在非凸场景中的信号估计的当代研究中起着核心作用的光谱初始化方法。在无噪声相位恢复框架中，我们精确分析了当感知向量遵循多元高斯分布时该方法在高维极限下的表现，适用于协方差矩阵C的两种旋转不变模型。第一种模型中的C是一个投影在一个低维空间上，而第二种模型中的C是一个Wishart矩阵。我们的分析结果扩展了C为单位矩阵时已经被充分确认的情况。我们的研究表明，引入偏向空间方向会显著提高光谱方法的效果，特别是当测量次数少于信号维数时。这一扩展还始终显示了依赖于样本大小与信号维数之间比率的相位转换现象。",
    "tldr": "引入偏向空间方向的方法在高维相位恢复中取得了显著改进，在测量次数少于信号维数时尤为有效，同时揭示了一个依赖于样本大小与信号维数比率的相位转换现象。"
}