{
    "title": "OverleafCopilot: Empowering Academic Writing in Overleaf with Large Language Models",
    "abstract": "arXiv:2403.09733v1 Announce Type: cross  Abstract: The rapid development of Large Language Models (LLMs) has facilitated a variety of applications from different domains. In this technical report, we explore the integration of LLMs and the popular academic writing tool, Overleaf, to enhance the efficiency and quality of academic writing. To achieve the above goal, there are three challenges: i) including seamless interaction between Overleaf and LLMs, ii) establishing reliable communication with the LLM provider, and iii) ensuring user privacy. To address these challenges, we present OverleafCopilot, the first-ever tool (i.e., a browser extension) that seamlessly integrates LLMs and Overleaf, enabling researchers to leverage the power of LLMs while writing papers. Specifically, we first propose an effective framework to bridge LLMs and Overleaf. Then, we developed PromptGenius, a website for researchers to easily find and share high-quality up-to-date prompts. Thirdly, we propose an ag",
    "link": "https://arxiv.org/abs/2403.09733",
    "context": "Title: OverleafCopilot: Empowering Academic Writing in Overleaf with Large Language Models\nAbstract: arXiv:2403.09733v1 Announce Type: cross  Abstract: The rapid development of Large Language Models (LLMs) has facilitated a variety of applications from different domains. In this technical report, we explore the integration of LLMs and the popular academic writing tool, Overleaf, to enhance the efficiency and quality of academic writing. To achieve the above goal, there are three challenges: i) including seamless interaction between Overleaf and LLMs, ii) establishing reliable communication with the LLM provider, and iii) ensuring user privacy. To address these challenges, we present OverleafCopilot, the first-ever tool (i.e., a browser extension) that seamlessly integrates LLMs and Overleaf, enabling researchers to leverage the power of LLMs while writing papers. Specifically, we first propose an effective framework to bridge LLMs and Overleaf. Then, we developed PromptGenius, a website for researchers to easily find and share high-quality up-to-date prompts. Thirdly, we propose an ag",
    "path": "papers/24/03/2403.09733.json",
    "total_tokens": 878,
    "translated_title": "OverleafCopilot：在Overleaf中利用大型语言模型增强学术写作能力",
    "translated_abstract": "大型语言模型（LLMs）的迅速发展促进了不同领域各种应用的实现。在本技术报告中，我们探讨了将LLMs和流行的学术写作工具Overleaf集成，以提高学术写作的效率和质量。为实现上述目标，我们面临三个挑战：i）在Overleaf和LLMs之间实现无缝交互，ii）与LLM提供者建立可靠通信，iii）确保用户隐私。为了解决这些挑战，我们提出了OverleafCopilot，这是第一个无缝集成LLMs和Overleaf的工具（即浏览器扩展程序），使研究人员在撰写论文时能够充分利用LLMs的能力。具体来说，我们首先提出了一个有效的框架来连接LLMs和Overleaf。然后，我们开发了PromptGenius网站，供研究人员轻松查找和共享高质量的最新提示。第三，我们提出了一种ag",
    "tldr": "OverleafCopilot是第一个无缝集成大型语言模型和Overleaf的工具，使研究人员能够在撰写论文时利用大型语言模型的能力。",
    "en_tdlr": "OverleafCopilot is the first tool that seamlessly integrates Large Language Models and Overleaf, enabling researchers to leverage the power of Large Language Models while writing papers."
}