{
    "title": "DNNLasso: Scalable Graph Learning for Matrix-Variate Data",
    "abstract": "arXiv:2403.02608v1 Announce Type: new  Abstract: We consider the problem of jointly learning row-wise and column-wise dependencies of matrix-variate observations, which are modelled separately by two precision matrices. Due to the complicated structure of Kronecker-product precision matrices in the commonly used matrix-variate Gaussian graphical models, a sparser Kronecker-sum structure was proposed recently based on the Cartesian product of graphs. However, existing methods for estimating Kronecker-sum structured precision matrices do not scale well to large scale datasets. In this paper, we introduce DNNLasso, a diagonally non-negative graphical lasso model for estimating the Kronecker-sum structured precision matrix, which outperforms the state-of-the-art methods by a large margin in both accuracy and computational time. Our code is available at https://github.com/YangjingZhang/DNNLasso.",
    "link": "https://arxiv.org/abs/2403.02608",
    "context": "Title: DNNLasso: Scalable Graph Learning for Matrix-Variate Data\nAbstract: arXiv:2403.02608v1 Announce Type: new  Abstract: We consider the problem of jointly learning row-wise and column-wise dependencies of matrix-variate observations, which are modelled separately by two precision matrices. Due to the complicated structure of Kronecker-product precision matrices in the commonly used matrix-variate Gaussian graphical models, a sparser Kronecker-sum structure was proposed recently based on the Cartesian product of graphs. However, existing methods for estimating Kronecker-sum structured precision matrices do not scale well to large scale datasets. In this paper, we introduce DNNLasso, a diagonally non-negative graphical lasso model for estimating the Kronecker-sum structured precision matrix, which outperforms the state-of-the-art methods by a large margin in both accuracy and computational time. Our code is available at https://github.com/YangjingZhang/DNNLasso.",
    "path": "papers/24/03/2403.02608.json",
    "total_tokens": 828,
    "translated_title": "DNNLasso：面向矩阵变量数据的可扩展图学习",
    "translated_abstract": "我们考虑了联合学习矩阵变量观测的行和列之间的依赖关系的问题，这些观测分别由两个精度矩阵单独建模。由于常用矩阵变量高斯图模型中Kronecker乘积精度矩阵的复杂结构，最近提出了一个更稀疏的Kronecker和结构，基于图的笛卡尔乘积。然而，现有的用于估计Kronecker和结构精度矩阵的方法在大规模数据集上的扩展性并不好。本文介绍了DNNLasso，一种用于估计Kronecker和结构精度矩阵的对角非负图形套索模型，它在准确性和计算时间方面都大幅优于最先进的方法。我们的代码可在https://github.com/YangjingZhang/DNNLasso找到。",
    "tldr": "DNNLasso是一种对角非负图形套索模型，用于估计Kronecker-和结构的精度矩阵，在准确性和计算时间方面优于现有方法。",
    "en_tdlr": "DNNLasso is a diagonally non-negative graphical lasso model for estimating the Kronecker-sum structured precision matrix, which outperforms the state-of-the-art methods in both accuracy and computational time."
}