{
    "title": "LabelAId: Just-in-time AI Interventions for Improving Human Labeling Quality and Domain Knowledge in Crowdsourcing Systems",
    "abstract": "arXiv:2403.09810v1 Announce Type: cross  Abstract: Crowdsourcing platforms have transformed distributed problem-solving, yet quality control remains a persistent challenge. Traditional quality control measures, such as prescreening workers and refining instructions, often focus solely on optimizing economic output. This paper explores just-in-time AI interventions to enhance both labeling quality and domain-specific knowledge among crowdworkers. We introduce LabelAId, an advanced inference model combining Programmatic Weak Supervision (PWS) with FT-Transformers to infer label correctness based on user behavior and domain knowledge. Our technical evaluation shows that our LabelAId pipeline consistently outperforms state-of-the-art ML baselines, improving mistake inference accuracy by 36.7% with 50 downstream samples. We then implemented LabelAId into Project Sidewalk, an open-source crowdsourcing platform for urban accessibility. A between-subjects study with 34 participants demonstrate",
    "link": "https://arxiv.org/abs/2403.09810",
    "context": "Title: LabelAId: Just-in-time AI Interventions for Improving Human Labeling Quality and Domain Knowledge in Crowdsourcing Systems\nAbstract: arXiv:2403.09810v1 Announce Type: cross  Abstract: Crowdsourcing platforms have transformed distributed problem-solving, yet quality control remains a persistent challenge. Traditional quality control measures, such as prescreening workers and refining instructions, often focus solely on optimizing economic output. This paper explores just-in-time AI interventions to enhance both labeling quality and domain-specific knowledge among crowdworkers. We introduce LabelAId, an advanced inference model combining Programmatic Weak Supervision (PWS) with FT-Transformers to infer label correctness based on user behavior and domain knowledge. Our technical evaluation shows that our LabelAId pipeline consistently outperforms state-of-the-art ML baselines, improving mistake inference accuracy by 36.7% with 50 downstream samples. We then implemented LabelAId into Project Sidewalk, an open-source crowdsourcing platform for urban accessibility. A between-subjects study with 34 participants demonstrate",
    "path": "papers/24/03/2403.09810.json",
    "total_tokens": 900,
    "translated_title": "LabelAId: 用于改善众包系统中人类标注质量和领域知识的及时AI干预",
    "translated_abstract": "众包平台已经改变了分布式问题解决，但质量控制仍然是一个持久的挑战。传统的质量控制措施，如对工作者进行预筛选和完善说明，通常只专注于优化经济产出。本文探讨了即时AI干预，以增强众包工作者的标注质量和领域特定知识。我们引入了LabelAId，一种先进的推断模型，它结合了程序化弱监督（PWS）和FT-Transformers，根据用户行为和领域知识推断标签的正确性。我们的技术评估显示，我们的LabelAId管道始终优于最先进的ML基线，使用50个下游样本提高了36.7%的错误推断准确性。然后，我们将LabelAId实现到Project Sidewalk中，这是一个面向城市可访问性的开源众包平台。一项涉及34名参与者的实验表明",
    "tldr": "该论文探讨了如何利用即时AI干预来提升众包平台中人类标注质量和领域知识，介绍了LabelAId模型，与传统方法相比，其能够显著提高错误推断准确性。",
    "en_tdlr": "This paper explores the use of just-in-time AI interventions to enhance both labeling quality and domain-specific knowledge in crowdsourcing systems, introducing the LabelAId model which significantly improves mistake inference accuracy compared to traditional methods."
}