{
    "title": "Locally Regular and Efficient Tests in Non-Regular Semiparametric Models",
    "abstract": "arXiv:2403.05999v1 Announce Type: new  Abstract: This paper considers hypothesis testing in semiparametric models which may be non-regular. I show that C($\\alpha$) style tests are locally regular under mild conditions, including in cases where locally regular estimators do not exist, such as models which are (semi-parametrically) weakly identified. I characterise the appropriate limit experiment in which to study local (asymptotic) optimality of tests in the non-regular case, permitting the generalisation of classical power bounds to this case. I give conditions under which these power bounds are attained by the proposed C($\\alpha$) style tests. The application of the theory to a single index model and an instrumental variables model is worked out in detail.",
    "link": "https://arxiv.org/abs/2403.05999",
    "context": "Title: Locally Regular and Efficient Tests in Non-Regular Semiparametric Models\nAbstract: arXiv:2403.05999v1 Announce Type: new  Abstract: This paper considers hypothesis testing in semiparametric models which may be non-regular. I show that C($\\alpha$) style tests are locally regular under mild conditions, including in cases where locally regular estimators do not exist, such as models which are (semi-parametrically) weakly identified. I characterise the appropriate limit experiment in which to study local (asymptotic) optimality of tests in the non-regular case, permitting the generalisation of classical power bounds to this case. I give conditions under which these power bounds are attained by the proposed C($\\alpha$) style tests. The application of the theory to a single index model and an instrumental variables model is worked out in detail.",
    "path": "papers/24/03/2403.05999.json",
    "total_tokens": 773,
    "translated_title": "非正则半参数模型中的局部正则和高效检验",
    "translated_abstract": "本文考虑了半参数模型中的假设检验，该模型可能是非正则的。在温和的条件下，我表明了C($\\alpha$)风格的检验在局部正则情况下，包括那些局部正则估计器不存在的情况，如（半参数）弱识别的模型。我描述了适当的极限实验，用于研究非正规情况下检验的本地（渐近）最优性，从而将经典功率边界推广到这种情况。我给出了这些功率边界被提出的C($\\alpha$)风格的检验达到的条件。将理论应用于单指数模型和工具变量模型，并进行了详细的讨论。",
    "tldr": "本文讨论了在可能是非正规的半参数模型中的假设检验，展示了C($\\alpha$)风格的检验在局部正则情况下的性质，并推广了经典功率边界到这种情况下。",
    "en_tdlr": "This paper discusses hypothesis testing in semiparametric models which may be non-regular, showing properties of C($\\alpha$) style tests under local regularity and extending classical power bounds to this case."
}