{
    "title": "Reshaping Free-Text Radiology Notes Into Structured Reports With Generative Transformers",
    "abstract": "arXiv:2403.18938v1 Announce Type: cross  Abstract: BACKGROUND: Radiology reports are typically written in a free-text format, making clinical information difficult to extract and use. Recently the adoption of structured reporting (SR) has been recommended by various medical societies thanks to the advantages it offers, e.g. standardization, completeness and information retrieval. We propose a pipeline to extract information from free-text radiology reports, that fits with the items of the reference SR registry proposed by a national society of interventional and medical radiology, focusing on CT staging of patients with lymphoma. METHODS: Our work aims to leverage the potential of Natural Language Processing (NLP) and Transformer-based models to deal with automatic SR registry filling. With the availability of 174 radiology reports, we investigate a rule-free generative Question Answering approach based on a domain-specific version of T5 (IT5). Two strategies (batch-truncation and ex-p",
    "link": "https://arxiv.org/abs/2403.18938",
    "context": "Title: Reshaping Free-Text Radiology Notes Into Structured Reports With Generative Transformers\nAbstract: arXiv:2403.18938v1 Announce Type: cross  Abstract: BACKGROUND: Radiology reports are typically written in a free-text format, making clinical information difficult to extract and use. Recently the adoption of structured reporting (SR) has been recommended by various medical societies thanks to the advantages it offers, e.g. standardization, completeness and information retrieval. We propose a pipeline to extract information from free-text radiology reports, that fits with the items of the reference SR registry proposed by a national society of interventional and medical radiology, focusing on CT staging of patients with lymphoma. METHODS: Our work aims to leverage the potential of Natural Language Processing (NLP) and Transformer-based models to deal with automatic SR registry filling. With the availability of 174 radiology reports, we investigate a rule-free generative Question Answering approach based on a domain-specific version of T5 (IT5). Two strategies (batch-truncation and ex-p",
    "path": "papers/24/03/2403.18938.json",
    "total_tokens": 740,
    "translated_title": "将自由文本放射学笔记转变为具有生成变换器的结构化报告",
    "translated_abstract": "背景：放射学报告通常以自由文本格式编写，使临床信息难以提取和使用。 最近，各种医学学会推荐采用结构化报告（SR），由于其提供的优势（如标准化、完整性和信息检索），结构化报告（SR）的采用得到了推荐。 我们提出了一个从自由文本放射学报告中提取信息的流程，与一个国家介入和医学放射学会提出的参考SR注册表项目相匹配，重点放在对具有淋巴瘤的患者进行CT分期上。",
    "tldr": "提出了一个从自由文本放射学报告中提取信息的流程，利用自然语言处理（NLP）和基于Transformer的模型来处理自动的SR注册表填写。"
}