{
    "title": "Visual Analytics for Fine-grained Text Classification Models and Datasets",
    "abstract": "arXiv:2403.15492v1 Announce Type: new  Abstract: In natural language processing (NLP), text classification tasks are increasingly fine-grained, as datasets are fragmented into a larger number of classes that are more difficult to differentiate from one another. As a consequence, the semantic structures of datasets have become more complex, and model decisions more difficult to explain. Existing tools, suited for coarse-grained classification, falter under these additional challenges. In response to this gap, we worked closely with NLP domain experts in an iterative design-and-evaluation process to characterize and tackle the growing requirements in their workflow of developing fine-grained text classification models. The result of this collaboration is the development of SemLa, a novel visual analytics system tailored for 1) dissecting complex semantic structures in a dataset when it is spatialized in model embedding space, and 2) visualizing fine-grained nuances in the meaning of text",
    "link": "https://arxiv.org/abs/2403.15492",
    "context": "Title: Visual Analytics for Fine-grained Text Classification Models and Datasets\nAbstract: arXiv:2403.15492v1 Announce Type: new  Abstract: In natural language processing (NLP), text classification tasks are increasingly fine-grained, as datasets are fragmented into a larger number of classes that are more difficult to differentiate from one another. As a consequence, the semantic structures of datasets have become more complex, and model decisions more difficult to explain. Existing tools, suited for coarse-grained classification, falter under these additional challenges. In response to this gap, we worked closely with NLP domain experts in an iterative design-and-evaluation process to characterize and tackle the growing requirements in their workflow of developing fine-grained text classification models. The result of this collaboration is the development of SemLa, a novel visual analytics system tailored for 1) dissecting complex semantic structures in a dataset when it is spatialized in model embedding space, and 2) visualizing fine-grained nuances in the meaning of text",
    "path": "papers/24/03/2403.15492.json",
    "total_tokens": 818,
    "translated_title": "面向细粒度文本分类模型和数据集的视觉分析",
    "translated_abstract": "在自然语言处理（NLP）中，文本分类任务变得越来越细粒度化，因为数据集被分成更多更难以区分的类别。因此，数据集的语义结构变得更复杂，模型决策也变得更加难以解释。在这种空缺的情况下，我们与NLP领域专家密切合作，通过设计和评估的迭代过程，表征和解决他们在开发细粒度文本分类模型工作流中不断增长的需求。这种合作的结果是开发出了SemLa，这是一个针对以下需求定制的新型视觉分析系统：1）在将数据集空间化到模型嵌入空间时分解复杂的语义结构，2）可视化文本意义中的细微差别。",
    "tldr": "发展了SemLa，一个针对细粒度文本分类模型开发工作流需求的新型视觉分析系统，用于分解数据集中的复杂语义结构和可视化文本含义中的细微差别",
    "en_tdlr": "Developed SemLa, a novel visual analytics system tailored for the growing requirements in developing fine-grained text classification models, aiming to dissect complex semantic structures in datasets when spatialized in model embedding space and visualize fine-grained nuances in text meanings."
}