{
    "title": "Enhancing Industrial Transfer Learning with Style Filter: Cost Reduction and Defect-Focus",
    "abstract": "arXiv:2403.16607v1 Announce Type: new  Abstract: Addressing the challenge of data scarcity in industrial domains, transfer learning emerges as a pivotal paradigm. This work introduces Style Filter, a tailored methodology for industrial contexts. By selectively filtering source domain data before knowledge transfer, Style Filter reduces the quantity of data while maintaining or even enhancing the performance of transfer learning strategy. Offering label-free operation, minimal reliance on prior knowledge, independence from specific models, and re-utilization, Style Filter is evaluated on authentic industrial datasets, highlighting its effectiveness when employed before conventional transfer strategies in the deep learning domain. The results underscore the effectiveness of Style Filter in real-world industrial applications.",
    "link": "https://arxiv.org/abs/2403.16607",
    "context": "Title: Enhancing Industrial Transfer Learning with Style Filter: Cost Reduction and Defect-Focus\nAbstract: arXiv:2403.16607v1 Announce Type: new  Abstract: Addressing the challenge of data scarcity in industrial domains, transfer learning emerges as a pivotal paradigm. This work introduces Style Filter, a tailored methodology for industrial contexts. By selectively filtering source domain data before knowledge transfer, Style Filter reduces the quantity of data while maintaining or even enhancing the performance of transfer learning strategy. Offering label-free operation, minimal reliance on prior knowledge, independence from specific models, and re-utilization, Style Filter is evaluated on authentic industrial datasets, highlighting its effectiveness when employed before conventional transfer strategies in the deep learning domain. The results underscore the effectiveness of Style Filter in real-world industrial applications.",
    "path": "papers/24/03/2403.16607.json",
    "total_tokens": 756,
    "translated_title": "通过风格滤波增强工业迁移学习：成本降低和缺陷聚焦",
    "translated_abstract": "在工业领域数据稀缺的挑战下，迁移学习作为一个关键范式应运而生。本研究引入了Style Filter，一种为工业环境量身定制的方法论。通过在知识转移之前有选择性地过滤源域数据，Style Filter减少了数据量，同时保持甚至提升了迁移学习策略的性能。Style Filter提供无需标签操作，最小化先前知识依赖，独立于特定模型，并可重复利用，本文在真实工业数据集上进行了评估，突显了其在深度学习领域中在常规迁移策略之前使用时的有效性。结果强调了Style Filter在真实工业应用中的有效性。",
    "tldr": "Style Filter是一种在工业领域中量身定制的方法，通过在知识转移之前选择性地过滤源域数据，在减少数据量的同时，保持或提升了迁移学习策略的性能。"
}