{
    "title": "Classification of the Fashion-MNIST Dataset on a Quantum Computer",
    "abstract": "arXiv:2403.02405v1 Announce Type: cross  Abstract: The potential impact of quantum machine learning algorithms on industrial applications remains an exciting open question. Conventional methods for encoding classical data into quantum computers are not only too costly for a potential quantum advantage in the algorithms but also severely limit the scale of feasible experiments on current hardware. Therefore, recent works, despite claiming the near-term suitability of their algorithms, do not provide experimental benchmarking on standard machine learning datasets. We attempt to solve the data encoding problem by improving a recently proposed variational algorithm [1] that approximately prepares the encoded data, using asymptotically shallow circuits that fit the native gate set and topology of currently available quantum computers. We apply the improved algorithm to encode the Fashion-MNIST dataset [2], which can be directly used in future empirical studies of quantum machine learning al",
    "link": "https://arxiv.org/abs/2403.02405",
    "context": "Title: Classification of the Fashion-MNIST Dataset on a Quantum Computer\nAbstract: arXiv:2403.02405v1 Announce Type: cross  Abstract: The potential impact of quantum machine learning algorithms on industrial applications remains an exciting open question. Conventional methods for encoding classical data into quantum computers are not only too costly for a potential quantum advantage in the algorithms but also severely limit the scale of feasible experiments on current hardware. Therefore, recent works, despite claiming the near-term suitability of their algorithms, do not provide experimental benchmarking on standard machine learning datasets. We attempt to solve the data encoding problem by improving a recently proposed variational algorithm [1] that approximately prepares the encoded data, using asymptotically shallow circuits that fit the native gate set and topology of currently available quantum computers. We apply the improved algorithm to encode the Fashion-MNIST dataset [2], which can be directly used in future empirical studies of quantum machine learning al",
    "path": "papers/24/03/2403.02405.json",
    "total_tokens": 828,
    "translated_title": "在量子计算机上对时尚-MNIST数据集进行分类",
    "translated_abstract": "arXiv:2403.02405v1 公告类型：交叉 摘要：量子机器学习算法对工业应用的潜在影响仍然是一个令人振奋的悬而未决的问题。将经典数据编码到量子计算机的常规方法不仅对算法的潜在量子优势成本过高，而且严重限制了当前硬件上可行实验的规模。因此，尽管最近的研究声称他们的算法适用于近期，但却没有在标准机器学习数据集上进行实验基准测试。我们尝试通过改进最近提出的一种变分算法[1]来解决数据编码问题，该算法近似准备编码数据，使用与当前可用量子计算机的本机门集和拓扑相适应的渐近浅层电路。我们将改进的算法应用于对Fashion-MNIST数据集[2]进行编码，可以直接在未来的量子机器学习实证研究中使用。",
    "tldr": "通过改进变分算法，使用渐近浅层电路对时尚-MNIST数据集进行编码，为未来的量子机器学习实证研究提供了新方法。"
}