{
    "title": "An ensemble of data-driven weather prediction models for operational sub-seasonal forecasting",
    "abstract": "arXiv:2403.15598v1 Announce Type: cross  Abstract: We present an operations-ready multi-model ensemble weather forecasting system which uses hybrid data-driven weather prediction models coupled with the European Centre for Medium-range Weather Forecasts (ECMWF) ocean model to predict global weather at 1-degree resolution for 4 weeks of lead time. For predictions of 2-meter temperature, our ensemble on average outperforms the raw ECMWF extended-range ensemble by 4-17%, depending on the lead time. However, after applying statistical bias corrections, the ECMWF ensemble is about 3% better at 4 weeks. For other surface parameters, our ensemble is also within a few percentage points of ECMWF's ensemble. We demonstrate that it is possible to achieve near-state-of-the-art subseasonal-to-seasonal forecasts using a multi-model ensembling approach with data-driven weather prediction models.",
    "link": "https://arxiv.org/abs/2403.15598",
    "context": "Title: An ensemble of data-driven weather prediction models for operational sub-seasonal forecasting\nAbstract: arXiv:2403.15598v1 Announce Type: cross  Abstract: We present an operations-ready multi-model ensemble weather forecasting system which uses hybrid data-driven weather prediction models coupled with the European Centre for Medium-range Weather Forecasts (ECMWF) ocean model to predict global weather at 1-degree resolution for 4 weeks of lead time. For predictions of 2-meter temperature, our ensemble on average outperforms the raw ECMWF extended-range ensemble by 4-17%, depending on the lead time. However, after applying statistical bias corrections, the ECMWF ensemble is about 3% better at 4 weeks. For other surface parameters, our ensemble is also within a few percentage points of ECMWF's ensemble. We demonstrate that it is possible to achieve near-state-of-the-art subseasonal-to-seasonal forecasts using a multi-model ensembling approach with data-driven weather prediction models.",
    "path": "papers/24/03/2403.15598.json",
    "total_tokens": 819,
    "translated_title": "一种用于运营亚季节天气预测的数据驱动天气预测模型集成",
    "translated_abstract": "我们提出了一个运维即推广的多模型集成天气预测系统，该系统使用混合数据驱动的天气预测模型与欧洲中期天气预报中心（ECMWF）海洋模型耦合，在1度分辨率下预测全球天气的4周前瞻。对于2米温度的预测，我们的集成平均优于原始的ECMWF扩展范围集成，优势为4-17%，具体取决于前瞻时长。然而，在应用统计偏差校正后，ECMWF集成在4周时较集成检验约好3%。对于其他地面参数，我们的集成也与ECMWF的集成相差不到几个百分点。我们展示了利用多模型集成方法和数据驱动的天气预测模型可以实现接近最新技术水平的次季节至季节预测。",
    "tldr": "通过使用数据驱动天气预测模型的多模型集成方法，可以实现接近最新技术水平的 sub-seasonal 至 seasonal 天气预测。",
    "en_tdlr": "Near-state-of-the-art sub-seasonal to seasonal weather forecasts can be achieved by using a multi-model ensembling approach with data-driven weather prediction models."
}