{
    "title": "Embedded Multi-label Feature Selection via Orthogonal Regression",
    "abstract": "arXiv:2403.00307v1 Announce Type: cross  Abstract: In the last decade, embedded multi-label feature selection methods, incorporating the search for feature subsets into model optimization, have attracted considerable attention in accurately evaluating the importance of features in multi-label classification tasks. Nevertheless, the state-of-the-art embedded multi-label feature selection algorithms based on least square regression usually cannot preserve sufficient discriminative information in multi-label data. To tackle the aforementioned challenge, a novel embedded multi-label feature selection method, termed global redundancy and relevance optimization in orthogonal regression (GRROOR), is proposed to facilitate the multi-label feature selection. The method employs orthogonal regression with feature weighting to retain sufficient statistical and structural information related to local label correlations of the multi-label data in the feature learning process. Additionally, both glob",
    "link": "https://arxiv.org/abs/2403.00307",
    "context": "Title: Embedded Multi-label Feature Selection via Orthogonal Regression\nAbstract: arXiv:2403.00307v1 Announce Type: cross  Abstract: In the last decade, embedded multi-label feature selection methods, incorporating the search for feature subsets into model optimization, have attracted considerable attention in accurately evaluating the importance of features in multi-label classification tasks. Nevertheless, the state-of-the-art embedded multi-label feature selection algorithms based on least square regression usually cannot preserve sufficient discriminative information in multi-label data. To tackle the aforementioned challenge, a novel embedded multi-label feature selection method, termed global redundancy and relevance optimization in orthogonal regression (GRROOR), is proposed to facilitate the multi-label feature selection. The method employs orthogonal regression with feature weighting to retain sufficient statistical and structural information related to local label correlations of the multi-label data in the feature learning process. Additionally, both glob",
    "path": "papers/24/03/2403.00307.json",
    "total_tokens": 820,
    "translated_title": "嵌入式多标签特征选择的正交回归方法",
    "translated_abstract": "在过去的十年里，嵌入式多标签特征选择方法吸引了相当大的关注，将特征子集的搜索纳入模型优化，以准确评估多标签分类任务中特征的重要性。然而，基于最小二乘回归的最先进的嵌入式多标签特征选择算法通常无法保留足够的多标签数据中的判别信息。为了解决上述挑战，提出了一种新的嵌入式多标签特征选择方法，称为正交回归中的全局冗余和相关性优化（GRROOR），以促进多标签特征选择。该方法利用具有特征加权的正交回归，在特征学习过程中保留与多标签数据的局部标签相关性相关的足够统计和结构信息。此外，既考虑了全局冗余，又考虑了相关性优化，以促进分类性能的进一步提高。",
    "tldr": "提出了一种新颖的嵌入式多标签特征选择方法，GRROOR，利用正交回归和特征加权以保留足够的统计和结构信息，进一步提高多标签数据的分类性能。"
}