{
    "title": "Extending Activation Steering to Broad Skills and Multiple Behaviours",
    "abstract": "arXiv:2403.05767v1 Announce Type: cross  Abstract: Current large language models have dangerous capabilities, which are likely to become more problematic in the future. Activation steering techniques can be used to reduce risks from these capabilities. In this paper, we investigate the efficacy of activation steering for broad skills and multiple behaviours. First, by comparing the effects of reducing performance on general coding ability and Python-specific ability, we find that steering broader skills is competitive to steering narrower skills. Second, we steer models to become more or less myopic and wealth-seeking, among other behaviours. In our experiments, combining steering vectors for multiple different behaviours into one steering vector is largely unsuccessful. On the other hand, injecting individual steering vectors at different places in a model simultaneously is promising.",
    "link": "https://arxiv.org/abs/2403.05767",
    "context": "Title: Extending Activation Steering to Broad Skills and Multiple Behaviours\nAbstract: arXiv:2403.05767v1 Announce Type: cross  Abstract: Current large language models have dangerous capabilities, which are likely to become more problematic in the future. Activation steering techniques can be used to reduce risks from these capabilities. In this paper, we investigate the efficacy of activation steering for broad skills and multiple behaviours. First, by comparing the effects of reducing performance on general coding ability and Python-specific ability, we find that steering broader skills is competitive to steering narrower skills. Second, we steer models to become more or less myopic and wealth-seeking, among other behaviours. In our experiments, combining steering vectors for multiple different behaviours into one steering vector is largely unsuccessful. On the other hand, injecting individual steering vectors at different places in a model simultaneously is promising.",
    "path": "papers/24/03/2403.05767.json",
    "total_tokens": 779,
    "translated_title": "将激活导向扩展到广泛技能与多种行为",
    "translated_abstract": "当前大型语言模型具有危险的能力，这很可能在未来变得更加棘手。激活导向技术可用于减少这些能力带来的风险。本文研究了激活导向在广泛技能和多种行为中的功效。通过比较减少对一般编码能力和Python特定能力表现的影响，我们发现导向更广泛技能与导向较窄技能竞争激烈。其次，我们引导模型变得更加或更少近视和寻求财富，以及其他行为。在实验中，将多种不同行为的导向向量组合为一个导向向量通常不成功。另一方面，同时在模型中不同位置注入个体导向向量是有前途的。",
    "tldr": "本文研究了将激活导向技术应用于广泛技能和多种行为的功效，并发现导向广泛技能具有竞争力，同时在模型中同时注入个体导向向量是一种有前途的方法。",
    "en_tdlr": "This paper investigates the efficacy of extending activation steering techniques to broad skills and multiple behaviours, finding competitive results when steering broader skills and promising outcomes when injecting individual steering vectors simultaneously in a model."
}