{
    "title": "Segmentation Re-thinking Uncertainty Estimation Metrics for Semantic Segmentation",
    "abstract": "arXiv:2403.19826v1 Announce Type: new  Abstract: In the domain of computer vision, semantic segmentation emerges as a fundamental application within machine learning, wherein individual pixels of an image are classified into distinct semantic categories. This task transcends traditional accuracy metrics by incorporating uncertainty quantification, a critical measure for assessing the reliability of each segmentation prediction. Such quantification is instrumental in facilitating informed decision-making, particularly in applications where precision is paramount. Within this nuanced framework, the metric known as PAvPU (Patch Accuracy versus Patch Uncertainty) has been developed as a specialized tool for evaluating entropy-based uncertainty in image segmentation tasks. However, our investigation identifies three core deficiencies within the PAvPU framework and proposes robust solutions aimed at refining the metric. By addressing these issues, we aim to enhance the reliability and applic",
    "link": "https://arxiv.org/abs/2403.19826",
    "context": "Title: Segmentation Re-thinking Uncertainty Estimation Metrics for Semantic Segmentation\nAbstract: arXiv:2403.19826v1 Announce Type: new  Abstract: In the domain of computer vision, semantic segmentation emerges as a fundamental application within machine learning, wherein individual pixels of an image are classified into distinct semantic categories. This task transcends traditional accuracy metrics by incorporating uncertainty quantification, a critical measure for assessing the reliability of each segmentation prediction. Such quantification is instrumental in facilitating informed decision-making, particularly in applications where precision is paramount. Within this nuanced framework, the metric known as PAvPU (Patch Accuracy versus Patch Uncertainty) has been developed as a specialized tool for evaluating entropy-based uncertainty in image segmentation tasks. However, our investigation identifies three core deficiencies within the PAvPU framework and proposes robust solutions aimed at refining the metric. By addressing these issues, we aim to enhance the reliability and applic",
    "path": "papers/24/03/2403.19826.json",
    "total_tokens": 683,
    "translated_title": "重新思考语义分割中的不确定性估计度量",
    "translated_abstract": "在计算机视觉领域中，语义分割作为机器学习中的一个基本应用，将图像的每个像素分类为不同的语义类别。这项任务通过包含不确定性量化来超越传统的准确度度量，不确定性量化是评估每个分割预测可靠性的关键指标。我们的研究识别出PAvPU（Patch Accuracy versus Patch Uncertainty）框架中的三个核心缺陷，并提出旨在改进该度量的强大解决方案。通过解决这些问题，我们旨在增强可靠性和适用性。",
    "tldr": "重新思考了语义分割中的不确定性估计度量，发现并改进了PAvPU框架中的核心缺陷。",
    "en_tdlr": "Rethinking uncertainty estimation metrics for semantic segmentation, identifying and addressing core deficiencies in the PAvPU framework."
}