{
    "title": "MedKP: Medical Dialogue with Knowledge Enhancement and Clinical Pathway Encoding",
    "abstract": "arXiv:2403.06611v1 Announce Type: cross  Abstract: With appropriate data selection and training techniques, Large Language Models (LLMs) have demonstrated exceptional success in various medical examinations and multiple-choice questions. However, the application of LLMs in medical dialogue generation-a task more closely aligned with actual medical practice-has been less explored. This gap is attributed to the insufficient medical knowledge of LLMs, which leads to inaccuracies and hallucinated information in the generated medical responses. In this work, we introduce the Medical dialogue with Knowledge enhancement and clinical Pathway encoding (MedKP) framework, which integrates an external knowledge enhancement module through a medical knowledge graph and an internal clinical pathway encoding via medical entities and physician actions. Evaluated with comprehensive metrics, our experiments on two large-scale, real-world online medical consultation datasets (MedDG and KaMed) demonstrate ",
    "link": "https://arxiv.org/abs/2403.06611",
    "context": "Title: MedKP: Medical Dialogue with Knowledge Enhancement and Clinical Pathway Encoding\nAbstract: arXiv:2403.06611v1 Announce Type: cross  Abstract: With appropriate data selection and training techniques, Large Language Models (LLMs) have demonstrated exceptional success in various medical examinations and multiple-choice questions. However, the application of LLMs in medical dialogue generation-a task more closely aligned with actual medical practice-has been less explored. This gap is attributed to the insufficient medical knowledge of LLMs, which leads to inaccuracies and hallucinated information in the generated medical responses. In this work, we introduce the Medical dialogue with Knowledge enhancement and clinical Pathway encoding (MedKP) framework, which integrates an external knowledge enhancement module through a medical knowledge graph and an internal clinical pathway encoding via medical entities and physician actions. Evaluated with comprehensive metrics, our experiments on two large-scale, real-world online medical consultation datasets (MedDG and KaMed) demonstrate ",
    "path": "papers/24/03/2403.06611.json",
    "total_tokens": 806,
    "translated_title": "MedKP：医学对话与知识增强与临床路径编码",
    "translated_abstract": "通过适当的数据选择和训练技术，大型语言模型（LLMs）在各种医学考试和多项选择问题中表现出色。 然而，LLMs在医学对话生成领域的应用--这个任务更加贴近实际医学实践--却鲜有探讨。 这一差距归因于LLMs医学知识不足，导致生成的医学回复出现不准确和幻觉信息。 在这项工作中，我们介绍了医学对话与知识增强和临床路径编码（MedKP）框架，通过医学知识图和医疗实体以及医师行动的内部临床路径编码，集成了外部知识增强模块。 通过全面指标进行评估，我们在两个大规模、真实世界的在线医学咨询数据集（MedDG和KaMed）上的实验表明",
    "tldr": "通过整合外部知识增强模块和内部临床路径编码，MedKP框架在医学对话生成中取得了显著进展。"
}