{
    "title": "HiRA-Pro: High resolution alignment of multimodal spatio-temporal data: a process physics driven approach",
    "abstract": "arXiv:2403.06888v1 Announce Type: cross  Abstract: We present HiRA-Pro, a novel procedure to align, at high spatio-temporal resolutions, multimodal signals from real-world processes and systems that exhibit diverse transient, nonlinear stochastic dynamics, such as manufacturing machines. It is based on discerning and synchronizing the process signatures of salient kinematic and dynamic events in these disparate signals. HiRA-Pro addresses the challenge of aligning data with sub-millisecond phenomena, where traditional timestamp, external trigger, or clock-based alignment methods fall short. The effectiveness of HiRA-Pro is demonstrated in a smart manufacturing context, where it aligns data from 13+ channels acquired during 3D-printing and milling operations on an Optomec-LENS MTS 500 hybrid machine. The aligned data is then voxelized to generate 0.25 second aligned data chunks that correspond to physical voxels on the produced part. The superiority of HiRA-Pro is further showcased thro",
    "link": "https://arxiv.org/abs/2403.06888",
    "context": "Title: HiRA-Pro: High resolution alignment of multimodal spatio-temporal data: a process physics driven approach\nAbstract: arXiv:2403.06888v1 Announce Type: cross  Abstract: We present HiRA-Pro, a novel procedure to align, at high spatio-temporal resolutions, multimodal signals from real-world processes and systems that exhibit diverse transient, nonlinear stochastic dynamics, such as manufacturing machines. It is based on discerning and synchronizing the process signatures of salient kinematic and dynamic events in these disparate signals. HiRA-Pro addresses the challenge of aligning data with sub-millisecond phenomena, where traditional timestamp, external trigger, or clock-based alignment methods fall short. The effectiveness of HiRA-Pro is demonstrated in a smart manufacturing context, where it aligns data from 13+ channels acquired during 3D-printing and milling operations on an Optomec-LENS MTS 500 hybrid machine. The aligned data is then voxelized to generate 0.25 second aligned data chunks that correspond to physical voxels on the produced part. The superiority of HiRA-Pro is further showcased thro",
    "path": "papers/24/03/2403.06888.json",
    "total_tokens": 914,
    "translated_title": "HiRA-Pro: 高分辨率对齐多模态时空数据的过程物理驱动方法",
    "translated_abstract": "我们提出了HiRA-Pro，一个新颖的程序，用于在高时空分辨率下对来自展示多样瞬态、非线性随机动态的真实世界过程和系统的多模态信号进行对齐，例如制造机器。它基于识别和同步这些不同信号中显著运动学和动力学事件的过程特征。HiRA-Pro解决了对齐具有亚毫秒现象的数据的挑战，而传统的时间戳、外部触发器或基于时钟的对齐方法则难以胜任。HiRA-Pro的有效性在智能制造环境中得到了展示，在这里，它对来自Optomec-LENS MTS 500混合机器进行3D打印和铣削操作期间获取的13+通道数据进行了对齐。然后，对齐数据被体素化，生成对应于所制造零件上的物理体素的0.25秒对齐数据块。HiRA-Pro的优越性通过以下方式进一步展示",
    "tldr": "HiRA-Pro是一个高分辨率对齐多模态时空数据的过程物理驱动方法，成功解决了对齐具有亚毫秒现象的数据的挑战，并在智能制造环境中取得了成功应用。",
    "en_tdlr": "HiRA-Pro is a process physics driven approach for high resolution alignment of multimodal spatio-temporal data, successfully addressing the challenge of aligning data with sub-millisecond phenomena, and demonstrating its effectiveness in a smart manufacturing context."
}