{
    "title": "ChatTracer: Large Language Model Powered Real-time Bluetooth Device Tracking System",
    "abstract": "arXiv:2403.19833v1 Announce Type: cross  Abstract: Large language models (LLMs), exemplified by OpenAI ChatGPT and Google Bard, have transformed the way we interact with cyber technologies. In this paper, we study the possibility of connecting LLM with wireless sensor networks (WSN). A successful design will not only extend LLM's knowledge landscape to the physical world but also revolutionize human interaction with WSN. To the end, we present ChatTracer, an LLM-powered real-time Bluetooth device tracking system. ChatTracer comprises three key components: an array of Bluetooth sniffing nodes, a database, and a fine-tuned LLM. ChatTracer was designed based on our experimental observation that commercial Apple/Android devices always broadcast hundreds of BLE packets per minute even in their idle status. Its novelties lie in two aspects: i) a reliable and efficient BLE packet grouping algorithm; and ii) an LLM fine-tuning strategy that combines both supervised fine-tuning (SFT) and reinfo",
    "link": "https://arxiv.org/abs/2403.19833",
    "context": "Title: ChatTracer: Large Language Model Powered Real-time Bluetooth Device Tracking System\nAbstract: arXiv:2403.19833v1 Announce Type: cross  Abstract: Large language models (LLMs), exemplified by OpenAI ChatGPT and Google Bard, have transformed the way we interact with cyber technologies. In this paper, we study the possibility of connecting LLM with wireless sensor networks (WSN). A successful design will not only extend LLM's knowledge landscape to the physical world but also revolutionize human interaction with WSN. To the end, we present ChatTracer, an LLM-powered real-time Bluetooth device tracking system. ChatTracer comprises three key components: an array of Bluetooth sniffing nodes, a database, and a fine-tuned LLM. ChatTracer was designed based on our experimental observation that commercial Apple/Android devices always broadcast hundreds of BLE packets per minute even in their idle status. Its novelties lie in two aspects: i) a reliable and efficient BLE packet grouping algorithm; and ii) an LLM fine-tuning strategy that combines both supervised fine-tuning (SFT) and reinfo",
    "path": "papers/24/03/2403.19833.json",
    "total_tokens": 929,
    "translated_title": "ChatTracer：大型语言模型驱动的实时蓝牙设备追踪系统",
    "translated_abstract": "大型语言模型（LLMs），如OpenAI ChatGPT和Google Bard所展示的，已经改变了我们与网络技术互动的方式。本文研究了将LLM与无线传感器网络（WSN）相连接的可能性。一个成功的设计不仅会将LLM的知识领域延伸到物理世界，而且将彻底革新人们与WSN的互动。为此，我们提出了ChatTracer，一个由LLM驱动的实时蓝牙设备追踪系统。ChatTracer由三个关键组件组成：一系列蓝牙嗅探节点、一个数据库和一个经过精调的LLM。ChatTracer的设计基于我们的实验观察，商用的苹果/安卓设备即使在空闲状态下也会每分钟广播数百个BLE数据包。它的创新之处在于：i）一个可靠高效的BLE数据包分组算法；和ii）一个结合了监督微调（SFT）和强化学习微调策略的LLM微调策略。",
    "tldr": "ChatTracer是一个由LLM驱动的实时蓝牙设备追踪系统，其创新之处在于可靠高效的BLE数据包分组算法和结合了监督微调和强化学习微调策略的LLM微调策略。",
    "en_tdlr": "ChatTracer is a real-time Bluetooth device tracking system powered by LLM, with innovations in reliable and efficient BLE packet grouping algorithm and a blending of supervised fine-tuning and reinforcement learning fine-tuning strategies."
}