{
    "title": "Generating Diverse Agricultural Data for Vision-Based Farming Applications",
    "abstract": "arXiv:2403.18351v1 Announce Type: cross  Abstract: We present a specialized procedural model for generating synthetic agricultural scenes, focusing on soybean crops, along with various weeds. This model is capable of simulating distinct growth stages of these plants, diverse soil conditions, and randomized field arrangements under varying lighting conditions. The integration of real-world textures and environmental factors into the procedural generation process enhances the photorealism and applicability of the synthetic data. Our dataset includes 12,000 images with semantic labels, offering a comprehensive resource for computer vision tasks in precision agriculture, such as semantic segmentation for autonomous weed control. We validate our model's effectiveness by comparing the synthetic data against real agricultural images, demonstrating its potential to significantly augment training data for machine learning models in agriculture. This approach not only provides a cost-effective s",
    "link": "https://arxiv.org/abs/2403.18351",
    "context": "Title: Generating Diverse Agricultural Data for Vision-Based Farming Applications\nAbstract: arXiv:2403.18351v1 Announce Type: cross  Abstract: We present a specialized procedural model for generating synthetic agricultural scenes, focusing on soybean crops, along with various weeds. This model is capable of simulating distinct growth stages of these plants, diverse soil conditions, and randomized field arrangements under varying lighting conditions. The integration of real-world textures and environmental factors into the procedural generation process enhances the photorealism and applicability of the synthetic data. Our dataset includes 12,000 images with semantic labels, offering a comprehensive resource for computer vision tasks in precision agriculture, such as semantic segmentation for autonomous weed control. We validate our model's effectiveness by comparing the synthetic data against real agricultural images, demonstrating its potential to significantly augment training data for machine learning models in agriculture. This approach not only provides a cost-effective s",
    "path": "papers/24/03/2403.18351.json",
    "total_tokens": 872,
    "translated_title": "生成用于基于视觉的农业应用的多样化农业数据",
    "translated_abstract": "我们提出了一个专门的程序化模型，用于生成合成的农业场景，重点是大豆作物以及各种杂草。该模型能够模拟这些植物的不同生长阶段、多样化的土壤条件，以及在不同光照条件下的随机田地布局。将现实世界的纹理和环境因素整合到程序化生成过程中，增强了合成数据的逼真度和适用性。我们的数据集包括带有语义标签的12,000张图像，为精准农业中的计算机视觉任务提供了全面的资源，如用于自主除草的语义分割。通过将合成数据与真实农业图像进行比较，我们验证了我们模型的有效性，展示了它在为农业中的机器学习模型提供训练数据方面的潜力。这种方法不仅提供了一种成本-effective的方式",
    "tldr": "提出了一种专门用于生成合成农业场景的程序化模型，能够模拟植物的生长阶段、土壤条件和光照变化，为精准农业中的计算机视觉任务提供了全面资源，验证了该模型在提供机器学习训练数据方面的潜力"
}