{
    "title": "Forest-ORE: Mining Optimal Rule Ensemble to interpret Random Forest models",
    "abstract": "arXiv:2403.17588v1 Announce Type: new  Abstract: Random Forest (RF) is well-known as an efficient ensemble learning method in terms of predictive performance. It is also considered a Black Box because of its hundreds of deep decision trees. This lack of interpretability can be a real drawback for acceptance of RF models in several real-world applications, especially those affecting one's lives, such as in healthcare, security, and law. In this work, we present Forest-ORE, a method that makes RF interpretable via an optimized rule ensemble (ORE) for local and global interpretation. Unlike other rule-based approaches aiming at interpreting the RF model, this method simultaneously considers several parameters that influence the choice of an interpretable rule ensemble. Existing methods often prioritize predictive performance over interpretability coverage and do not provide information about existing overlaps or interactions between rules. Forest-ORE uses a mixed-integer optimization prog",
    "link": "https://arxiv.org/abs/2403.17588",
    "context": "Title: Forest-ORE: Mining Optimal Rule Ensemble to interpret Random Forest models\nAbstract: arXiv:2403.17588v1 Announce Type: new  Abstract: Random Forest (RF) is well-known as an efficient ensemble learning method in terms of predictive performance. It is also considered a Black Box because of its hundreds of deep decision trees. This lack of interpretability can be a real drawback for acceptance of RF models in several real-world applications, especially those affecting one's lives, such as in healthcare, security, and law. In this work, we present Forest-ORE, a method that makes RF interpretable via an optimized rule ensemble (ORE) for local and global interpretation. Unlike other rule-based approaches aiming at interpreting the RF model, this method simultaneously considers several parameters that influence the choice of an interpretable rule ensemble. Existing methods often prioritize predictive performance over interpretability coverage and do not provide information about existing overlaps or interactions between rules. Forest-ORE uses a mixed-integer optimization prog",
    "path": "papers/24/03/2403.17588.json",
    "total_tokens": 883,
    "translated_title": "Forest-ORE: 挖掘最佳规则集以解释随机森林模型",
    "translated_abstract": "arXiv:2403.17588v1宣布类型：新  摘要：随机森林（RF）以其高预测性能而闻名，是一种有效的集成学习方法。 由于有数百个深层决策树，它也被认为是一个黑盒。 这种缺乏解释性可以成为RF模型在几种现实世界应用中被接受的一个真正缺点，特别是那些影响个人生活的领域，如医疗保健、安全和法律。 在这项工作中，我们提出Forest-ORE，一种通过优化的规则集（ORE）使RF具有可解释性，用于局部和全局解释。 不同于其他旨在解释RF模型的基于规则的方法，该方法同时考虑了几个影响选择可解释规则集的参数。 现有方法通常将预测性能置于可解释性覆盖范围之上，并且不提供有关现有规则之间的重叠或交互作用的信息。 Forest-ORE使用混合整数优化prog",
    "tldr": "Forest-ORE方法提出了一种通过优化规则集使随机森林具有可解释性的方法，可以应用于全局和局部解释，同时考虑了影响可解释规则集选择的多个参数。",
    "en_tdlr": "Forest-ORE proposes a method to make Random Forest interpretable through optimized rule ensemble for both global and local interpretations, considering multiple parameters influencing the choice of interpretable rule ensemble."
}