{
    "title": "Sharing the Cost of Success: A Game for Evaluating and Learning Collaborative Multi-Agent Instruction Giving and Following Policies",
    "abstract": "arXiv:2403.17497v1 Announce Type: new  Abstract: In collaborative goal-oriented settings, the participants are not only interested in achieving a successful outcome, but do also implicitly negotiate the effort they put into the interaction (by adapting to each other). In this work, we propose a challenging interactive reference game that requires two players to coordinate on vision and language observations. The learning signal in this game is a score (given after playing) that takes into account the achieved goal and the players' assumed efforts during the interaction. We show that a standard Proximal Policy Optimization (PPO) setup achieves a high success rate when bootstrapped with heuristic partner behaviors that implement insights from the analysis of human-human interactions. And we find that a pairing of neural partners indeed reduces the measured joint effort when playing together repeatedly. However, we observe that in comparison to a reasonable heuristic pairing there is stil",
    "link": "https://arxiv.org/abs/2403.17497",
    "context": "Title: Sharing the Cost of Success: A Game for Evaluating and Learning Collaborative Multi-Agent Instruction Giving and Following Policies\nAbstract: arXiv:2403.17497v1 Announce Type: new  Abstract: In collaborative goal-oriented settings, the participants are not only interested in achieving a successful outcome, but do also implicitly negotiate the effort they put into the interaction (by adapting to each other). In this work, we propose a challenging interactive reference game that requires two players to coordinate on vision and language observations. The learning signal in this game is a score (given after playing) that takes into account the achieved goal and the players' assumed efforts during the interaction. We show that a standard Proximal Policy Optimization (PPO) setup achieves a high success rate when bootstrapped with heuristic partner behaviors that implement insights from the analysis of human-human interactions. And we find that a pairing of neural partners indeed reduces the measured joint effort when playing together repeatedly. However, we observe that in comparison to a reasonable heuristic pairing there is stil",
    "path": "papers/24/03/2403.17497.json",
    "total_tokens": 973,
    "translated_title": "分担成功的成本：用于评估和学习协作多智能体指导和跟随策略的游戏",
    "translated_abstract": "在协作目标导向的环境中，参与者不仅对实现成功的结果感兴趣，而且还会隐式地协商他们在交互中投入的努力（通过相互适应）。在本研究中，我们提出了一种具有挑战性的交互式参考游戏，需要两名玩家在视觉和语言观察上进行协调。此游戏中的学习信号是一种分数（在游戏后给出），该分数考虑了实现的目标和玩家在交互过程中的假定努力。我们展示了当使用实现从人际交互分析中获得的见解的启发式合作行为来引导时，标准的近端策略优化（PPO）设置实现了很高的成功率。我们发现神经网络合作伙伴的配对确实在重复玩在一起时减少了测得的合作努力。然而，我们观察到与一个合理的启发式配对相比，仍然存在着...",
    "tldr": "该研究提出了一种协作多智能体指导和跟随策略的游戏，通过对视觉和语言观察进行协调来评估玩家之间的交互努力，实验发现标准的PPO设置配合启发式合作行为能取得高成功率，神经网络合作伙伴配对可减少重复游戏时的合作努力。",
    "en_tdlr": "This study presents a game for evaluating and learning collaborative multi-agent instruction giving and following policies, where players coordinate on vision and language observations to assess interaction efforts, demonstrating that a standard PPO setup with heuristic partner behaviors achieves high success rates and neural partner pairing reduces joint effort during repeated play."
}