{
    "title": "Towards Interpreting Multi-Objective Feature Associations",
    "abstract": "arXiv:2403.00017v1 Announce Type: cross  Abstract: Understanding how multiple features are associated and contribute to a specific objective is as important as understanding how each feature contributes to a particular outcome. Interpretability of a single feature in a prediction may be handled in multiple ways; however, in a multi-objective prediction, it is difficult to obtain interpretability of a combination of feature values. To address this issue, we propose an objective specific feature interaction design using multi-labels to find the optimal combination of features in agricultural settings. One of the novel aspects of this design is the identification of a method that integrates feature explanations with global sensitivity analysis in order to ensure combinatorial optimization in multi-objective settings. We have demonstrated in our preliminary experiments that an approximate combination of feature values can be found to achieve the desired outcome using two agricultural datas",
    "link": "https://arxiv.org/abs/2403.00017",
    "context": "Title: Towards Interpreting Multi-Objective Feature Associations\nAbstract: arXiv:2403.00017v1 Announce Type: cross  Abstract: Understanding how multiple features are associated and contribute to a specific objective is as important as understanding how each feature contributes to a particular outcome. Interpretability of a single feature in a prediction may be handled in multiple ways; however, in a multi-objective prediction, it is difficult to obtain interpretability of a combination of feature values. To address this issue, we propose an objective specific feature interaction design using multi-labels to find the optimal combination of features in agricultural settings. One of the novel aspects of this design is the identification of a method that integrates feature explanations with global sensitivity analysis in order to ensure combinatorial optimization in multi-objective settings. We have demonstrated in our preliminary experiments that an approximate combination of feature values can be found to achieve the desired outcome using two agricultural datas",
    "path": "papers/24/03/2403.00017.json",
    "total_tokens": 759,
    "translated_title": "朝着解释多目标特征关联的方向",
    "translated_abstract": "理解多个特征如何相关并对特定目标的贡献是与理解每个特征如何对特定结果贡献同等重要的。在预测中解释单个特征可以通过多种方式处理；然而，在多目标预测中，难以获得特征值组合的可解释性。为了解决这个问题，我们提出了一种使用多标签的客观特征交互设计，以找到农业环境中特征的最佳组合。该设计的一项新颖之处是确定了一种方法，该方法将特征解释与全局敏感性分析相结合，以确保在多目标环境中进行组合优化。我们在初步实验中证明，可以找到近似的特征值组合以实现期望的结果，该结果使用了两个农业数据集。",
    "tldr": "提出一种使用多标签的客观特征交互设计，结合全局敏感性分析，以在农业环境中找到最佳组合的新方法。",
    "en_tdlr": "Introducing a novel approach that utilizes multi-label objective feature interaction design combined with global sensitivity analysis to find optimal combinations in agricultural settings."
}