{
    "title": "Considerations in the use of ML interaction potentials for free energy calculations",
    "abstract": "arXiv:2403.13952v1 Announce Type: cross  Abstract: Machine learning potentials (MLPs) offer the potential to accurately model the energy and free energy landscapes of molecules with the precision of quantum mechanics and an efficiency similar to classical simulations. This research focuses on using equivariant graph neural networks MLPs due to their proven effectiveness in modeling equilibrium molecular trajectories. A key issue addressed is the capability of MLPs to accurately predict free energies and transition states by considering both the energy and the diversity of molecular configurations. We examined how the distribution of collective variables (CVs) in the training data affects MLP accuracy in determining the free energy surface (FES) of systems, using Metadynamics simulations for butane and alanine dipeptide (ADP). The study involved training forty-three MLPs, half based on classical molecular dynamics data and the rest on ab initio computed energies. The MLPs were trained u",
    "link": "https://arxiv.org/abs/2403.13952",
    "context": "Title: Considerations in the use of ML interaction potentials for free energy calculations\nAbstract: arXiv:2403.13952v1 Announce Type: cross  Abstract: Machine learning potentials (MLPs) offer the potential to accurately model the energy and free energy landscapes of molecules with the precision of quantum mechanics and an efficiency similar to classical simulations. This research focuses on using equivariant graph neural networks MLPs due to their proven effectiveness in modeling equilibrium molecular trajectories. A key issue addressed is the capability of MLPs to accurately predict free energies and transition states by considering both the energy and the diversity of molecular configurations. We examined how the distribution of collective variables (CVs) in the training data affects MLP accuracy in determining the free energy surface (FES) of systems, using Metadynamics simulations for butane and alanine dipeptide (ADP). The study involved training forty-three MLPs, half based on classical molecular dynamics data and the rest on ab initio computed energies. The MLPs were trained u",
    "path": "papers/24/03/2403.13952.json",
    "total_tokens": 878,
    "translated_title": "机器学习相互作用势在自由能计算中的应用考虑",
    "translated_abstract": "机器学习势（MLPs）具有准确建模分子能量和自由能景观的潜力，该准确性可媲美量子力学，并具有类似经典模拟的效率。本研究侧重于使用等变性图神经网络MLPs，因为它们在建模平衡分子轨迹中已被证明有效。一个关键问题是MLPs能否准确预测自由能和过渡态，要考虑分子构型的能量和多样性。我们检查了训练数据中集体变量（CVs）的分布如何影响MLP在确定系统自由能面（FES）时的准确性，使用Metadynamics模拟对丁烷和丙氨酸二肽（ADP）进行实验。该研究涉及对四十三个MLP进行训练，其中一半基于经典分子动力学数据，其余的基于从头计算的能量。这些MLPs进行了训练",
    "tldr": "该研究探讨了机器学习势在自由能计算中的应用，重点关注使用等变性图神经网络MLPs来准确预测自由能和过渡态，考虑到分子构型的能量和多样性。",
    "en_tdlr": "This research focuses on the application of machine learning potentials in free energy calculations, with a key emphasis on using equivariant graph neural networks MLPs to accurately predict free energies and transition states, considering both the energy and diversity of molecular configurations."
}