{
    "title": "TEI2GO: A Multilingual Approach for Fast Temporal Expression Identification",
    "abstract": "arXiv:2403.16804v1 Announce Type: new  Abstract: Temporal expression identification is crucial for understanding texts written in natural language. Although highly effective systems such as HeidelTime exist, their limited runtime performance hampers adoption in large-scale applications and production environments. In this paper, we introduce the TEI2GO models, matching HeidelTime's effectiveness but with significantly improved runtime, supporting six languages, and achieving state-of-the-art results in four of them. To train the TEI2GO models, we used a combination of manually annotated reference corpus and developed ``Professor HeidelTime'', a comprehensive weakly labeled corpus of news texts annotated with HeidelTime. This corpus comprises a total of $138,069$ documents (over six languages) with $1,050,921$ temporal expressions, the largest open-source annotated dataset for temporal expression identification to date. By describing how the models were produced, we aim to encourage the",
    "link": "https://arxiv.org/abs/2403.16804",
    "context": "Title: TEI2GO: A Multilingual Approach for Fast Temporal Expression Identification\nAbstract: arXiv:2403.16804v1 Announce Type: new  Abstract: Temporal expression identification is crucial for understanding texts written in natural language. Although highly effective systems such as HeidelTime exist, their limited runtime performance hampers adoption in large-scale applications and production environments. In this paper, we introduce the TEI2GO models, matching HeidelTime's effectiveness but with significantly improved runtime, supporting six languages, and achieving state-of-the-art results in four of them. To train the TEI2GO models, we used a combination of manually annotated reference corpus and developed ``Professor HeidelTime'', a comprehensive weakly labeled corpus of news texts annotated with HeidelTime. This corpus comprises a total of $138,069$ documents (over six languages) with $1,050,921$ temporal expressions, the largest open-source annotated dataset for temporal expression identification to date. By describing how the models were produced, we aim to encourage the",
    "path": "papers/24/03/2403.16804.json",
    "total_tokens": 846,
    "translated_title": "TEI2GO: 一种用于快速识别时间表达的多语言方法",
    "translated_abstract": "时间表达的识别对于理解自然语言写作的文本至关重要。尽管像HeidelTime这样高效的系统存在，但它们的有限运行性能阻碍了在大规模应用和生产环境中的采用。本文介绍了TEI2GO模型，它与HeidelTime的有效性相匹配，但运行时间显著改善，在支持六种语言的同时，在其中四种语言取得了最先进的结果。为了训练TEI2GO模型，我们使用了人工注释的参考语料库的组合，并开发了一个名为“Professor HeidelTime”的综合弱标记语料库，其中包含了用HeidelTime标记的新闻文本。该语料库包含了一共138,069篇文档(跨六种语言)，共1,050,921个时间表达，是迄今为止用于时间表达识别的最大开源标注数据集。通过描述模型的产生过程，我们旨在鼓励",
    "tldr": "本文介绍了TEI2GO模型，它在支持六种语言的同时，在其中四种语言取得了最先进的结果，并且具有显著改善的运行时间。",
    "en_tdlr": "This paper introduces the TEI2GO models, which achieve state-of-the-art results in four out of six supported languages, with significantly improved runtime performance."
}