{
    "title": "Uncovering the Sino-US dynamic risk spillovers effects: Evidence from agricultural futures markets",
    "abstract": "arXiv:2403.01745v1 Announce Type: new  Abstract: Agricultural products play a critical role in human development. With economic globalization and the financialization of agricultural products continuing to advance, the interconnections between different agricultural futures have become closer. We utilize a TVP-VAR-DY model combined with the quantile method to measure the risk spillover between 11 agricultural futures on the futures exchanges of US and China from July 9,2014, to December 31,2022. This study yielded several significant findings. Firstly, CBOT corn, soybean, and wheat were identified as the primary risk transmitters, with DCE corn and soybean as the main risk receivers. Secondly, sudden events or increased eco- nomic uncertainty can increase the overall risk spillovers. Thirdly, there is an aggregation of risk spillovers amongst agricultural futures based on the dynamic directional spillover results. Lastly, the central agricultural futures under the conditional mean are ",
    "link": "https://arxiv.org/abs/2403.01745",
    "context": "Title: Uncovering the Sino-US dynamic risk spillovers effects: Evidence from agricultural futures markets\nAbstract: arXiv:2403.01745v1 Announce Type: new  Abstract: Agricultural products play a critical role in human development. With economic globalization and the financialization of agricultural products continuing to advance, the interconnections between different agricultural futures have become closer. We utilize a TVP-VAR-DY model combined with the quantile method to measure the risk spillover between 11 agricultural futures on the futures exchanges of US and China from July 9,2014, to December 31,2022. This study yielded several significant findings. Firstly, CBOT corn, soybean, and wheat were identified as the primary risk transmitters, with DCE corn and soybean as the main risk receivers. Secondly, sudden events or increased eco- nomic uncertainty can increase the overall risk spillovers. Thirdly, there is an aggregation of risk spillovers amongst agricultural futures based on the dynamic directional spillover results. Lastly, the central agricultural futures under the conditional mean are ",
    "path": "papers/24/03/2403.01745.json",
    "total_tokens": 944,
    "translated_title": "揭示中美动态风险溢出效应：来自农业期货市场的证据",
    "translated_abstract": "农产品在人类发展中扮演着至关重要的角色。随着经济全球化和农产品金融化的不断推进，不同农产品期货之间的相互关联变得更加紧密。我们利用TVP-VAR-DY模型结合分位数方法，从2014年7月9日至2022年12月31日度量了美国和中国期货交易所的11种农产品期货之间的风险溢出情况。研究得出了几个重大发现。首先，CBOT玉米、大豆和小麦被确定为主要的风险传播者，DCE玉米和大豆则是主要的风险接受者。其次，突发事件或增加的经济不确定性可能会增加整体风险溢出。第三，基于动态方向溢出结果，农产品期货之间存在风险溢出的聚合情况。最后，中央农产品期货在条件均值下是",
    "tldr": "通过TVP-VAR-DY模型和分位数方法，研究发现CBOT玉米、大豆和小麦是主要的风险传播者，DCE玉米和大豆是主要的风险接受者，并且突发事件或增加的经济不确定性可能导致整体风险溢出。",
    "en_tdlr": "The study utilizes a TVP-VAR-DY model combined with the quantile method to find that CBOT corn, soybean, and wheat are primary risk transmitters, while DCE corn and soybean are main risk receivers, and sudden events or increased economic uncertainty can lead to overall risk spillovers."
}