{
    "title": "Change Point Detection with Copula Entropy based Two-Sample Test",
    "abstract": "arXiv:2403.07892v1 Announce Type: cross  Abstract: Change point detection is a typical task that aim to find changes in time series and can be tackled with two-sample test. Copula Entropy is a mathematical concept for measuring statistical independence and a two-sample test based on it was introduced recently. In this paper we propose a nonparametric multivariate method for multiple change point detection with the copula entropy-based two-sample test. The single change point detection is first proposed as a group of two-sample tests on every points of time series data and the change point is considered as with the maximum of the test statistics. The multiple change point detection is then proposed by combining the single change point detection method with binary segmentation strategy. We verified the effectiveness of our method and compared it with the other similar methods on the simulated univariate and multivariate data and the Nile data.",
    "link": "https://arxiv.org/abs/2403.07892",
    "context": "Title: Change Point Detection with Copula Entropy based Two-Sample Test\nAbstract: arXiv:2403.07892v1 Announce Type: cross  Abstract: Change point detection is a typical task that aim to find changes in time series and can be tackled with two-sample test. Copula Entropy is a mathematical concept for measuring statistical independence and a two-sample test based on it was introduced recently. In this paper we propose a nonparametric multivariate method for multiple change point detection with the copula entropy-based two-sample test. The single change point detection is first proposed as a group of two-sample tests on every points of time series data and the change point is considered as with the maximum of the test statistics. The multiple change point detection is then proposed by combining the single change point detection method with binary segmentation strategy. We verified the effectiveness of our method and compared it with the other similar methods on the simulated univariate and multivariate data and the Nile data.",
    "path": "papers/24/03/2403.07892.json",
    "total_tokens": 807,
    "translated_title": "基于Copula熵的双样本检验的变点检测",
    "translated_abstract": "变点检测是一种典型任务，旨在发现时间序列中的变化，并可以用双样本检验来解决。Copula熵是一个用于测量统计独立性的数学概念，最近引入了基于它的双样本检验。本文提出了一种基于Copula熵的双样本检验的非参数多元方法，用于多个变点检测。首先，将单一变点检测提出为时间序列数据每个点的一组双样本检验，并将变点视为具有最大检验统计量的点。然后，通过将单一变点检测方法与二叉分割策略相结合，提出了多变点检测。我们验证了我们方法的有效性，并将其与其他类似方法在模拟单变量和多变量数据以及Nile数据上进行了比较。",
    "tldr": "本文提出了一种基于Copula熵的双样本检验的非参数多元方法，用于多个变点检测，并结合了二叉分割策略，有效验证了其在不同数据集上的比较优势。",
    "en_tdlr": "This paper presents a nonparametric multivariate method for multiple change point detection based on Copula Entropy two-sample test, combined with binary segmentation strategy, effectively validating its superiority over other methods on various datasets."
}