{
    "title": "Enhancing Protein Predictive Models via Proteins Data Augmentation: A Benchmark and New Directions",
    "abstract": "arXiv:2403.00875v1 Announce Type: cross  Abstract: Augmentation is an effective alternative to utilize the small amount of labeled protein data. However, most of the existing work focuses on design-ing new architectures or pre-training tasks, and relatively little work has studied data augmentation for proteins. This paper extends data augmentation techniques previously used for images and texts to proteins and then benchmarks these techniques on a variety of protein-related tasks, providing the first comprehensive evaluation of protein augmentation. Furthermore, we propose two novel semantic-level protein augmentation methods, namely Integrated Gradients Substitution and Back Translation Substitution, which enable protein semantic-aware augmentation through saliency detection and biological knowledge. Finally, we integrate extended and proposed augmentations into an augmentation pool and propose a simple but effective framework, namely Automated Protein Augmentation (APA), which can a",
    "link": "https://arxiv.org/abs/2403.00875",
    "context": "Title: Enhancing Protein Predictive Models via Proteins Data Augmentation: A Benchmark and New Directions\nAbstract: arXiv:2403.00875v1 Announce Type: cross  Abstract: Augmentation is an effective alternative to utilize the small amount of labeled protein data. However, most of the existing work focuses on design-ing new architectures or pre-training tasks, and relatively little work has studied data augmentation for proteins. This paper extends data augmentation techniques previously used for images and texts to proteins and then benchmarks these techniques on a variety of protein-related tasks, providing the first comprehensive evaluation of protein augmentation. Furthermore, we propose two novel semantic-level protein augmentation methods, namely Integrated Gradients Substitution and Back Translation Substitution, which enable protein semantic-aware augmentation through saliency detection and biological knowledge. Finally, we integrate extended and proposed augmentations into an augmentation pool and propose a simple but effective framework, namely Automated Protein Augmentation (APA), which can a",
    "path": "papers/24/03/2403.00875.json",
    "total_tokens": 893,
    "translated_title": "通过蛋白数据增强增强蛋白预测模型：基准和新方向",
    "translated_abstract": "数据增强是利用少量标记蛋白数据的有效替代方法。然而，大多数现有工作侧重于设计新的架构或预训练任务，对于蛋白的数据增强研究相对较少。本文将先前用于图像和文本的数据增强技术扩展到蛋白，然后在各种与蛋白相关的任务上对这些技术进行基准测试，提供了对蛋白增强的首次全面评估。此外，我们提出两种新的语义级蛋白增强方法，即集成梯度替换和回译替换，通过显著性检测和生物知识实现蛋白语义感知增强。最后，我们将扩展和提出的增强集成到一个增强池中，并提出了一个简单但有效的框架，即自动蛋白增强（APA），可对蛋白进行自动增强。",
    "tldr": "本文将图片和文本的数据增强技术扩展到蛋白领域，提出了两种新的蛋白语义级增强方法，并将这些增强方法集成到一个增强池中，构建了一个名为自动蛋白增强（APA）的简单而有效的框架。",
    "en_tdlr": "This paper extends data augmentation techniques previously used for images and texts to proteins, proposes two novel semantic-level protein augmentation methods, and integrates these methods into an augmentation pool to construct a simple yet effective framework called Automated Protein Augmentation (APA)."
}