{
    "title": "Diffusion-based Negative Sampling on Graphs for Link Prediction",
    "abstract": "arXiv:2403.17259v1 Announce Type: new  Abstract: Link prediction is a fundamental task for graph analysis with important applications on the Web, such as social network analysis and recommendation systems, etc. Modern graph link prediction methods often employ a contrastive approach to learn robust node representations, where negative sampling is pivotal. Typical negative sampling methods aim to retrieve hard examples based on either predefined heuristics or automatic adversarial approaches, which might be inflexible or difficult to control. Furthermore, in the context of link prediction, most previous methods sample negative nodes from existing substructures of the graph, missing out on potentially more optimal samples in the latent space. To address these issues, we investigate a novel strategy of multi-level negative sampling that enables negative node generation with flexible and controllable ``hardness'' levels from the latent space. Our method, called Conditional Diffusion-based ",
    "link": "https://arxiv.org/abs/2403.17259",
    "context": "Title: Diffusion-based Negative Sampling on Graphs for Link Prediction\nAbstract: arXiv:2403.17259v1 Announce Type: new  Abstract: Link prediction is a fundamental task for graph analysis with important applications on the Web, such as social network analysis and recommendation systems, etc. Modern graph link prediction methods often employ a contrastive approach to learn robust node representations, where negative sampling is pivotal. Typical negative sampling methods aim to retrieve hard examples based on either predefined heuristics or automatic adversarial approaches, which might be inflexible or difficult to control. Furthermore, in the context of link prediction, most previous methods sample negative nodes from existing substructures of the graph, missing out on potentially more optimal samples in the latent space. To address these issues, we investigate a novel strategy of multi-level negative sampling that enables negative node generation with flexible and controllable ``hardness'' levels from the latent space. Our method, called Conditional Diffusion-based ",
    "path": "papers/24/03/2403.17259.json",
    "total_tokens": 815,
    "translated_title": "基于图的扩散负采样用于链接预测",
    "translated_abstract": "链接预测是图分析中的一个基础任务，在网络上具有重要的应用，如社交网络分析、推荐系统等。现代图链接预测方法通常采用对比方法来学习稳健的节点表示，其中负采样至关重要。典型的负采样方法旨在根据预定义的启发式或自动对抗方法检索困难示例，这可能不够灵活或难以控制。此外，在链接预测的背景下，大多数先前的方法从图的现有子结构中对负节点进行抽样，错过了潜在更优的潜在空间中的样本。为解决这些问题，我们研究了一种新颖的多级负采样策略，能够从潜在空间中以灵活且可控制的“难度”级别生成负节点。我们的方法名为有条件的基于扩散的...",
    "tldr": "提出了一种基于图的扩散负采样的新策略，能够从潜在空间中以多个灵活和可控的“难度”级别生成负节点。"
}