{
    "title": "CoroNetGAN: Controlled Pruning of GANs via Hypernetworks",
    "abstract": "arXiv:2403.08261v1 Announce Type: cross  Abstract: Generative Adversarial Networks (GANs) have proven to exhibit remarkable performance and are widely used across many generative computer vision applications. However, the unprecedented demand for the deployment of GANs on resource-constrained edge devices still poses a challenge due to huge number of parameters involved in the generation process. This has led to focused attention on the area of compressing GANs. Most of the existing works use knowledge distillation with the overhead of teacher dependency. Moreover, there is no ability to control the degree of compression in these methods. Hence, we propose CoroNet-GAN for compressing GAN using the combined strength of differentiable pruning method via hypernetworks. The proposed method provides the advantage of performing controllable compression while training along with reducing training time by a substantial factor. Experiments have been done on various conditional GAN architectures",
    "link": "https://arxiv.org/abs/2403.08261",
    "context": "Title: CoroNetGAN: Controlled Pruning of GANs via Hypernetworks\nAbstract: arXiv:2403.08261v1 Announce Type: cross  Abstract: Generative Adversarial Networks (GANs) have proven to exhibit remarkable performance and are widely used across many generative computer vision applications. However, the unprecedented demand for the deployment of GANs on resource-constrained edge devices still poses a challenge due to huge number of parameters involved in the generation process. This has led to focused attention on the area of compressing GANs. Most of the existing works use knowledge distillation with the overhead of teacher dependency. Moreover, there is no ability to control the degree of compression in these methods. Hence, we propose CoroNet-GAN for compressing GAN using the combined strength of differentiable pruning method via hypernetworks. The proposed method provides the advantage of performing controllable compression while training along with reducing training time by a substantial factor. Experiments have been done on various conditional GAN architectures",
    "path": "papers/24/03/2403.08261.json",
    "total_tokens": 817,
    "translated_title": "CoroNetGAN：通过超网络控制GAN的剪枝",
    "translated_abstract": "生成对抗网络（GANs）已被证明在许多生成计算机视觉应用中表现出卓越性能，并被广泛使用。然而，在资源受限的边缘设备上部署GAN的需求前所未有，这仍然是一个挑战，因为在生成过程中涉及了大量参数。这导致关注点集中在压缩GAN领域。大多数现有作品使用知识蒸馏，但存在着需要教师依赖的开销。此外，在这些方法中没有能力控制压缩程度。因此，我们提出了使用超网络通过可微剪枝方法压缩GAN的CoroNet-GAN。所提出的方法在训练过程中提供了可控制的压缩优势，并通过实验表现出显著减少训练时间的特点。在各种条件GAN架构上进行了实验。",
    "tldr": "CoroNetGAN通过超网络结合可微剪枝方法，提出了一种压缩GAN的方法，具有可控的压缩优势并显著减少训练时间"
}