{
    "title": "Safe Road-Crossing by Autonomous Wheelchairs: a Novel Dataset and its Experimental Evaluation",
    "abstract": "arXiv:2403.08984v1 Announce Type: cross  Abstract: Safe road-crossing by self-driving vehicles is a crucial problem to address in smart-cities. In this paper, we introduce a multi-sensor fusion approach to support road-crossing decisions in a system composed by an autonomous wheelchair and a flying drone featuring a robust sensory system made of diverse and redundant components. To that aim, we designed an analytical danger function based on explainable physical conditions evaluated by single sensors, including those using machine learning and artificial vision. As a proof-of-concept, we provide an experimental evaluation in a laboratory environment, showing the advantages of using multiple sensors, which can improve decision accuracy and effectively support safety assessment. We made the dataset available to the scientific community for further experimentation. The work has been developed in the context of an European project named REXASI-PRO, which aims to develop trustworthy artific",
    "link": "https://arxiv.org/abs/2403.08984",
    "context": "Title: Safe Road-Crossing by Autonomous Wheelchairs: a Novel Dataset and its Experimental Evaluation\nAbstract: arXiv:2403.08984v1 Announce Type: cross  Abstract: Safe road-crossing by self-driving vehicles is a crucial problem to address in smart-cities. In this paper, we introduce a multi-sensor fusion approach to support road-crossing decisions in a system composed by an autonomous wheelchair and a flying drone featuring a robust sensory system made of diverse and redundant components. To that aim, we designed an analytical danger function based on explainable physical conditions evaluated by single sensors, including those using machine learning and artificial vision. As a proof-of-concept, we provide an experimental evaluation in a laboratory environment, showing the advantages of using multiple sensors, which can improve decision accuracy and effectively support safety assessment. We made the dataset available to the scientific community for further experimentation. The work has been developed in the context of an European project named REXASI-PRO, which aims to develop trustworthy artific",
    "path": "papers/24/03/2403.08984.json",
    "total_tokens": 844,
    "translated_title": "自主轮椅的安全过马路：一个新颖的数据集及其实验评估",
    "translated_abstract": "安全地过马路是智能城市中需要解决的关键问题。本文介绍了一种多传感器融合方法，以支持自主轮椅和配备多样化和冗余组件的飞行无人机系统中的过马路决策。为此，我们设计了一种基于可解释物理条件的分析危险函数，通过单一传感器进行评估，包括使用机器学习和人工视觉的传感器。作为概念验证，我们在实验室环境中进行了实证评估，展示了使用多传感器的优势，可以提高决策准确性，有效支持安全评估。我们向科学界提供了该数据集以供进一步试验。这项工作是在一个名为REXASI-PRO的欧洲项目的框架下开发的，旨在开发值得信赖的艺术",
    "tldr": "提出了一种多传感器融合方法，支持自主轮椅和飞行无人机系统的安全过马路决策，实验结果表明使用多传感器可以提高决策准确性和有效支持安全评估",
    "en_tdlr": "Proposed a multi-sensor fusion approach to support safe road-crossing decisions for autonomous wheelchairs and flying drones, experimental results show that using multiple sensors can improve decision accuracy and effectively support safety assessment."
}