{
    "title": "DexDribbler: Learning Dexterous Soccer Manipulation via Dynamic Supervision",
    "abstract": "arXiv:2403.14300v1 Announce Type: cross  Abstract: Learning dexterous locomotion policy for legged robots is becoming increasingly popular due to its ability to handle diverse terrains and resemble intelligent behaviors. However, joint manipulation of moving objects and locomotion with legs, such as playing soccer, receive scant attention in the learning community, although it is natural for humans and smart animals. A key challenge to solve this multitask problem is to infer the objectives of locomotion from the states and targets of the manipulated objects. The implicit relation between the object states and robot locomotion can be hard to capture directly from the training experience. We propose adding a feedback control block to compute the necessary body-level movement accurately and using the outputs as dynamic joint-level locomotion supervision explicitly. We further utilize an improved ball dynamic model, an extended context-aided estimator, and a comprehensive ball observer to",
    "link": "https://arxiv.org/abs/2403.14300",
    "context": "Title: DexDribbler: Learning Dexterous Soccer Manipulation via Dynamic Supervision\nAbstract: arXiv:2403.14300v1 Announce Type: cross  Abstract: Learning dexterous locomotion policy for legged robots is becoming increasingly popular due to its ability to handle diverse terrains and resemble intelligent behaviors. However, joint manipulation of moving objects and locomotion with legs, such as playing soccer, receive scant attention in the learning community, although it is natural for humans and smart animals. A key challenge to solve this multitask problem is to infer the objectives of locomotion from the states and targets of the manipulated objects. The implicit relation between the object states and robot locomotion can be hard to capture directly from the training experience. We propose adding a feedback control block to compute the necessary body-level movement accurately and using the outputs as dynamic joint-level locomotion supervision explicitly. We further utilize an improved ball dynamic model, an extended context-aided estimator, and a comprehensive ball observer to",
    "path": "papers/24/03/2403.14300.json",
    "total_tokens": 894,
    "translated_title": "DexDribbler: 通过动态监督学习巧妙的足球操纵",
    "translated_abstract": "学习四肢机器人的灵巧运动策略因其处理多样化地形并类似于智能行为的能力而变得越来越流行。然而，在学习社区中，对于运动物体的关节操纵和足球等运动的关节操纵与足部运动的组合，接受的关注却很少，虽然这对于人类和聪明动物来说是自然的。解决这一多任务问题的一个关键挑战是从操纵物体的状态和目标中推断出运动目标。操纵物体状态与机器人运动之间的隐含关系可能很难直接从训练经验中捕捉。我们提出添加一个反馈控制模块来准确计算必要的整体运动，并将输出作为动态关节级运动监督。我们进一步利用改进的球体动态模型，扩展的上下文辅助估计器以及综合的球体观察器。",
    "tldr": "提出了一种通过动态监督学习巧妙的足球操纵方法，利用反馈控制模块来计算必要的整体运动并进行动态关节级运动监督，同时改进了球体动态模型和上下文-辅助估计器。",
    "en_tdlr": "Proposed a method for learning dexterous soccer manipulation via dynamic supervision, utilizing a feedback control block to compute necessary body-level movement and provide dynamic joint-level locomotion supervision, while improving the ball dynamic model and context-aided estimator."
}