{
    "title": "Large Language Multimodal Models for 5-Year Chronic Disease Cohort Prediction Using EHR Data",
    "abstract": "arXiv:2403.04785v1 Announce Type: cross  Abstract: Chronic diseases such as diabetes are the leading causes of morbidity and mortality worldwide. Numerous research studies have been attempted with various deep learning models in diagnosis. However, most previous studies had certain limitations, including using publicly available datasets (e.g. MIMIC), and imbalanced data. In this study, we collected five-year electronic health records (EHRs) from the Taiwan hospital database, including 1,420,596 clinical notes, 387,392 laboratory test results, and more than 1,505 laboratory test items, focusing on research pre-training large language models. We proposed a novel Large Language Multimodal Models (LLMMs) framework incorporating multimodal data from clinical notes and laboratory test results for the prediction of chronic disease risk. Our method combined a text embedding encoder and multi-head attention layer to learn laboratory test values, utilizing a deep neural network (DNN) module to ",
    "link": "https://arxiv.org/abs/2403.04785",
    "context": "Title: Large Language Multimodal Models for 5-Year Chronic Disease Cohort Prediction Using EHR Data\nAbstract: arXiv:2403.04785v1 Announce Type: cross  Abstract: Chronic diseases such as diabetes are the leading causes of morbidity and mortality worldwide. Numerous research studies have been attempted with various deep learning models in diagnosis. However, most previous studies had certain limitations, including using publicly available datasets (e.g. MIMIC), and imbalanced data. In this study, we collected five-year electronic health records (EHRs) from the Taiwan hospital database, including 1,420,596 clinical notes, 387,392 laboratory test results, and more than 1,505 laboratory test items, focusing on research pre-training large language models. We proposed a novel Large Language Multimodal Models (LLMMs) framework incorporating multimodal data from clinical notes and laboratory test results for the prediction of chronic disease risk. Our method combined a text embedding encoder and multi-head attention layer to learn laboratory test values, utilizing a deep neural network (DNN) module to ",
    "path": "papers/24/03/2403.04785.json",
    "total_tokens": 863,
    "translated_title": "使用电子健康记录数据预测5年慢性疾病队列的大型语言多模型",
    "translated_abstract": "慢性疾病如糖尿病是全球发病率和死亡率的主要原因。本研究从台湾医院数据库收集了五年的电子健康记录数据，包括1,420,596份临床笔记、387,392份实验室检验结果以及超过1,505种实验室检验项目，重点研究了用于研究预训练大型语言模型的方法。我们提出了一种新颖的大型语言多模型（LLMMs）框架，将临床笔记和实验室检验结果的多模态数据相结合，用于预测慢性疾病风险。我们的方法结合了文本嵌入编码器和多头注意力层来学习实验室检验数值，利用深度神经网络（DNN）模块进行预测。",
    "tldr": "本研究提出了一种大型语言多模型（LLMMs）框架，结合临床笔记和实验室检验结果的多模态数据，用于预测慢性疾病风险。",
    "en_tdlr": "This study introduces a novel Large Language Multimodal Models (LLMMs) framework that integrates multimodal data from clinical notes and laboratory test results for predicting chronic disease risk."
}