{
    "title": "Stochastic approach for elliptic problems in perforated domains",
    "abstract": "arXiv:2403.11385v1 Announce Type: cross  Abstract: A wide range of applications in science and engineering involve a PDE model in a domain with perforations, such as perforated metals or air filters. Solving such perforated domain problems suffers from computational challenges related to resolving the scale imposed by the geometries of perforations. We propose a neural network-based mesh-free approach for perforated domain problems. The method is robust and efficient in capturing various configuration scales, including the averaged macroscopic behavior of the solution that involves a multiscale nature induced by small perforations. The new approach incorporates the derivative-free loss method that uses a stochastic representation or the Feynman-Kac formulation. In particular, we implement the Neumann boundary condition for the derivative-free loss method to handle the interface between the domain and perforations. A suite of stringent numerical tests is provided to support the proposed",
    "link": "https://arxiv.org/abs/2403.11385",
    "context": "Title: Stochastic approach for elliptic problems in perforated domains\nAbstract: arXiv:2403.11385v1 Announce Type: cross  Abstract: A wide range of applications in science and engineering involve a PDE model in a domain with perforations, such as perforated metals or air filters. Solving such perforated domain problems suffers from computational challenges related to resolving the scale imposed by the geometries of perforations. We propose a neural network-based mesh-free approach for perforated domain problems. The method is robust and efficient in capturing various configuration scales, including the averaged macroscopic behavior of the solution that involves a multiscale nature induced by small perforations. The new approach incorporates the derivative-free loss method that uses a stochastic representation or the Feynman-Kac formulation. In particular, we implement the Neumann boundary condition for the derivative-free loss method to handle the interface between the domain and perforations. A suite of stringent numerical tests is provided to support the proposed",
    "path": "papers/24/03/2403.11385.json",
    "total_tokens": 833,
    "translated_title": "用于多孔域中椭圆问题的随机方法",
    "translated_abstract": "科学与工程中的广泛应用涉及带有孔隙的域中的PDE模型，例如多孔金属或空气过滤器。解决这类多孔域问题受到与解决孔隙几何尺度相关的计算挑战。我们提出了一种基于神经网络的无网格方法，用于处理多孔域问题。该方法在捕捉各种配置尺度方面具有鲁棒性和高效性，包括涉及由小孔引起的多尺度性质的解的平均宏观行为。新方法结合了使用随机表示或Feynman-Kac公式的无导数损失方法。特别地，我们实现了用于处理域与孔隙之间界面的无导数损失方法的Neumann边界条件。提供了一套严格的数值测试来支持所提出的方法。",
    "tldr": "提出了一种基于神经网络的无网格方法，用于解决多孔域中的椭圆问题，该方法结合了随机表示方法和Feynman-Kac公式，能够有效捕捉多尺度性质并处理界面条件。"
}