{
    "title": "More than words: Advancements and challenges in speech recognition for singing",
    "abstract": "arXiv:2403.09298v1 Announce Type: cross  Abstract: This paper addresses the challenges and advancements in speech recognition for singing, a domain distinctly different from standard speech recognition. Singing encompasses unique challenges, including extensive pitch variations, diverse vocal styles, and background music interference. We explore key areas such as phoneme recognition, language identification in songs, keyword spotting, and full lyrics transcription. I will describe some of my own experiences when performing research on these tasks just as they were starting to gain traction, but will also show how recent developments in deep learning and large-scale datasets have propelled progress in this field. My goal is to illuminate the complexities of applying speech recognition to singing, evaluate current capabilities, and outline future research directions.",
    "link": "https://arxiv.org/abs/2403.09298",
    "context": "Title: More than words: Advancements and challenges in speech recognition for singing\nAbstract: arXiv:2403.09298v1 Announce Type: cross  Abstract: This paper addresses the challenges and advancements in speech recognition for singing, a domain distinctly different from standard speech recognition. Singing encompasses unique challenges, including extensive pitch variations, diverse vocal styles, and background music interference. We explore key areas such as phoneme recognition, language identification in songs, keyword spotting, and full lyrics transcription. I will describe some of my own experiences when performing research on these tasks just as they were starting to gain traction, but will also show how recent developments in deep learning and large-scale datasets have propelled progress in this field. My goal is to illuminate the complexities of applying speech recognition to singing, evaluate current capabilities, and outline future research directions.",
    "path": "papers/24/03/2403.09298.json",
    "total_tokens": 858,
    "translated_title": "超越言语：歌唱语音识别中的进展与挑战",
    "translated_abstract": "本文讨论了歌唱语音识别中的挑战和进展，这是一个与标准语音识别完全不同的领域。歌唱包含独特的挑战，包括广泛的音高变化、多样化的声乐风格以及背景音乐干扰。我们探讨了诸如音素识别、歌曲中的语言识别、关键词识别和完整歌词转录等关键领域。我将描述一些我在这些任务上进行研究时的经历，就在它们开始崭露头角的时候，但也会展示深度学习和大规模数据集的最新进展如何推动了这一领域的进步。我的目标是阐明将语音识别应用于歌唱时的复杂性，评估当前的能力，并概述未来的研究方向。",
    "tldr": "本文讨论了歌唱语音识别中的挑战和进展，探索了音素识别、歌曲中的语言识别、关键词识别和完整歌词转录等关键领域，并介绍了深度学习和大规模数据集在该领域推动进展的最新发展。",
    "en_tdlr": "This paper discusses the challenges and advancements in speech recognition for singing, exploring key areas such as phoneme recognition, language identification in songs, keyword spotting, and full lyrics transcription, and introduces how recent developments in deep learning and large-scale datasets have propelled progress in this field."
}