{
    "title": "Pig aggression classification using CNN, Transformers and Recurrent Networks",
    "abstract": "arXiv:2403.08528v1 Announce Type: cross  Abstract: The development of techniques that can be used to analyze and detect animal behavior is a crucial activity for the livestock sector, as it is possible to monitor the stress and animal welfare and contributes to decision making in the farm. Thus, the development of applications can assist breeders in making decisions to improve production performance and reduce costs, once the animal behavior is analyzed by humans and this can lead to susceptible errors and time consumption. Aggressiveness in pigs is an example of behavior that is studied to reduce its impact through animal classification and identification. However, this process is laborious and susceptible to errors, which can be reduced through automation by visually classifying videos captured in controlled environment. The captured videos can be used for training and, as a result, for classification through computer vision and artificial intelligence, employing neural network techn",
    "link": "https://arxiv.org/abs/2403.08528",
    "context": "Title: Pig aggression classification using CNN, Transformers and Recurrent Networks\nAbstract: arXiv:2403.08528v1 Announce Type: cross  Abstract: The development of techniques that can be used to analyze and detect animal behavior is a crucial activity for the livestock sector, as it is possible to monitor the stress and animal welfare and contributes to decision making in the farm. Thus, the development of applications can assist breeders in making decisions to improve production performance and reduce costs, once the animal behavior is analyzed by humans and this can lead to susceptible errors and time consumption. Aggressiveness in pigs is an example of behavior that is studied to reduce its impact through animal classification and identification. However, this process is laborious and susceptible to errors, which can be reduced through automation by visually classifying videos captured in controlled environment. The captured videos can be used for training and, as a result, for classification through computer vision and artificial intelligence, employing neural network techn",
    "path": "papers/24/03/2403.08528.json",
    "total_tokens": 785,
    "translated_title": "使用CNN、Transformer和循环网络对猪的攻击性进行分类",
    "translated_abstract": "研发能用于分析和检测动物行为的技术是畜牧业的关键活动，可以监测压力和动物福利，并有助于农场决策。因此，开发应用程序可以帮助饲养员做出改善生产表现和降低成本的决策，因为动物行为由人类分析可能存在错误和耗时。猪的攻击性是一个被研究的行为样本，通过动物分类和识别来降低其影响。然而，这一过程繁琐、容易出错，可以通过自动化减少，通过在受控环境下捕捉视频进行视觉分类以实现。捕获的视频可用于训练，结果通过计算机视觉和人工智能进行分类，采用神经网络技术。",
    "tldr": "研究开发了使用CNN、Transformer和循环网络对猪的攻击性进行分类的技术，从而解决了人工分析动物行为可能存在的错误和耗时问题。"
}