{
    "title": "Causal knowledge engineering: A case study from COVID-19",
    "abstract": "arXiv:2403.14100v1 Announce Type: new  Abstract: COVID-19 appeared abruptly in early 2020, requiring a rapid response amid a context of great uncertainty. Good quality data and knowledge was initially lacking, and many early models had to be developed with causal assumptions and estimations built in to supplement limited data, often with no reliable approach for identifying, validating and documenting these causal assumptions. Our team embarked on a knowledge engineering process to develop a causal knowledge base consisting of several causal BNs for diverse aspects of COVID-19. The unique challenges of the setting lead to experiments with the elicitation approach, and what emerged was a knowledge engineering method we call Causal Knowledge Engineering (CKE). The CKE provides a structured approach for building a causal knowledge base that can support the development of a variety of application-specific models. Here we describe the CKE method, and use our COVID-19 work as a case study to",
    "link": "https://arxiv.org/abs/2403.14100",
    "context": "Title: Causal knowledge engineering: A case study from COVID-19\nAbstract: arXiv:2403.14100v1 Announce Type: new  Abstract: COVID-19 appeared abruptly in early 2020, requiring a rapid response amid a context of great uncertainty. Good quality data and knowledge was initially lacking, and many early models had to be developed with causal assumptions and estimations built in to supplement limited data, often with no reliable approach for identifying, validating and documenting these causal assumptions. Our team embarked on a knowledge engineering process to develop a causal knowledge base consisting of several causal BNs for diverse aspects of COVID-19. The unique challenges of the setting lead to experiments with the elicitation approach, and what emerged was a knowledge engineering method we call Causal Knowledge Engineering (CKE). The CKE provides a structured approach for building a causal knowledge base that can support the development of a variety of application-specific models. Here we describe the CKE method, and use our COVID-19 work as a case study to",
    "path": "papers/24/03/2403.14100.json",
    "total_tokens": 839,
    "translated_title": "因果知识工程：COVID-19的一个案例研究",
    "translated_abstract": "COVID-19在2020年初突然出现，需要在巨大不确定性的背景下迅速应对。最初缺乏高质量的数据和知识，许多早期模型必须建立在因果假设和估计的基础上，以补充有限的数据，通常没有可靠的方法来识别、验证和记录这些因果假设。我们的团队着手进行知识工程过程，开发了一个包含多个COVID-19不同方面因果贝叶斯网络的因果知识库。该环境的独特挑战导致对调查方法进行实验，结果形成了我们称之为因果知识工程（CKE）的知识工程方法。CKE提供了一种结构化方法来构建因果知识库，可以支持开发各种特定应用模型的工作。在这里，我们描述了CKE方法，并以我们的COVID-19工作作为案例研究。",
    "tldr": "该研究提出了一种名为因果知识工程（CKE）的方法，在COVID-19背景下开发了一个因果知识库，支持了各种特定应用模型的建立。"
}