{
    "title": "NusaBERT: Teaching IndoBERT to be Multilingual and Multicultural",
    "abstract": "arXiv:2403.01817v1 Announce Type: new  Abstract: Indonesia's linguistic landscape is remarkably diverse, encompassing over 700 languages and dialects, making it one of the world's most linguistically rich nations. This diversity, coupled with the widespread practice of code-switching and the presence of low-resource regional languages, presents unique challenges for modern pre-trained language models. In response to these challenges, we developed NusaBERT, building upon IndoBERT by incorporating vocabulary expansion and leveraging a diverse multilingual corpus that includes regional languages and dialects. Through rigorous evaluation across a range of benchmarks, NusaBERT demonstrates state-of-the-art performance in tasks involving multiple languages of Indonesia, paving the way for future natural language understanding research for under-represented languages.",
    "link": "https://arxiv.org/abs/2403.01817",
    "context": "Title: NusaBERT: Teaching IndoBERT to be Multilingual and Multicultural\nAbstract: arXiv:2403.01817v1 Announce Type: new  Abstract: Indonesia's linguistic landscape is remarkably diverse, encompassing over 700 languages and dialects, making it one of the world's most linguistically rich nations. This diversity, coupled with the widespread practice of code-switching and the presence of low-resource regional languages, presents unique challenges for modern pre-trained language models. In response to these challenges, we developed NusaBERT, building upon IndoBERT by incorporating vocabulary expansion and leveraging a diverse multilingual corpus that includes regional languages and dialects. Through rigorous evaluation across a range of benchmarks, NusaBERT demonstrates state-of-the-art performance in tasks involving multiple languages of Indonesia, paving the way for future natural language understanding research for under-represented languages.",
    "path": "papers/24/03/2403.01817.json",
    "total_tokens": 803,
    "translated_title": "NusaBERT：教授IndoBERT成为一种多语种和多文化的模型",
    "translated_abstract": "印度尼西亚的语言形态极其多样，包括700多种语言和方言，使其成为世界上语言最丰富的国家之一。这种多样性，加上广泛实践的代码切换和低资源区域语言的存在，为现代预训练语言模型提出了独特的挑战。为了应对这些挑战，我们开发了NusaBERT，通过扩展IndoBERT的词汇量并利用包括区域语言和方言在内的多样化多语种语料库。通过在各种基准测试中进行严格评估，NusaBERT在涉及印度尼西亚多种语言的任务中展现了最先进的性能，为未被充分代表的语言的未来自然语言理解研究铺平了道路。",
    "tldr": "NusaBERT通过将印度尼西亚的多样化语料库与IndoBERT相结合，实现了在涉及多种语言的任务中 state-of-the-art 的性能表现，为未被充分代表的语言的自然语言理解研究铺平了道路。",
    "en_tdlr": "NusaBERT achieves state-of-the-art performance in tasks involving multiple languages by combining a diverse multilingual corpus with IndoBERT, paving the way for natural language understanding research for under-represented languages."
}