{
    "title": "The Case for Globalizing Fairness: A Mixed Methods Study on Colonialism, AI, and Health in Africa",
    "abstract": "arXiv:2403.03357v1 Announce Type: new  Abstract: With growing application of machine learning (ML) technologies in healthcare, there have been calls for developing techniques to understand and mitigate biases these systems may exhibit. Fair-ness considerations in the development of ML-based solutions for health have particular implications for Africa, which already faces inequitable power imbalances between the Global North and South.This paper seeks to explore fairness for global health, with Africa as a case study. We conduct a scoping review to propose axes of disparities for fairness consideration in the African context and delineate where they may come into play in different ML-enabled medical modalities. We then conduct qualitative research studies with 672 general population study participants and 28 experts inML, health, and policy focused on Africa to obtain corroborative evidence on the proposed axes of disparities. Our analysis focuses on colonialism as the attribute of inte",
    "link": "https://arxiv.org/abs/2403.03357",
    "context": "Title: The Case for Globalizing Fairness: A Mixed Methods Study on Colonialism, AI, and Health in Africa\nAbstract: arXiv:2403.03357v1 Announce Type: new  Abstract: With growing application of machine learning (ML) technologies in healthcare, there have been calls for developing techniques to understand and mitigate biases these systems may exhibit. Fair-ness considerations in the development of ML-based solutions for health have particular implications for Africa, which already faces inequitable power imbalances between the Global North and South.This paper seeks to explore fairness for global health, with Africa as a case study. We conduct a scoping review to propose axes of disparities for fairness consideration in the African context and delineate where they may come into play in different ML-enabled medical modalities. We then conduct qualitative research studies with 672 general population study participants and 28 experts inML, health, and policy focused on Africa to obtain corroborative evidence on the proposed axes of disparities. Our analysis focuses on colonialism as the attribute of inte",
    "path": "papers/24/03/2403.03357.json",
    "total_tokens": 949,
    "translated_title": "全球推广公平性的理由：关于殖民主义、人工智能和非洲健康的混合方法研究",
    "translated_abstract": "随着机器学习（ML）技术在医疗保健中的应用日益增长，人们呼吁开发技术来理解和减轻这些系统可能表现出的偏见。 公平性在为健康开发基于ML的解决方案时具有特定对非洲有重要影响，非洲已经面临全球南北之间不公平的权力失衡。 本文旨在探讨全球健康的公平性，以非洲为案例研究。我们进行范围审查，提出在非洲环境中考虑公平性的差距轴，并勾画它们可能在不同ML启用的医疗模式中产生影响的区域。 然后，我们进行了对672名一般人口研究参与者和28名专家进行的定性研究，他们关注的是与非洲有关的ML、健康和政策，以获得关于已提出的差距轴的证实性证据。 我们的分析聚焦于殖民主义作为综合的特征。",
    "tldr": "该研究探讨了全球卫生公平性，以非洲为案例研究，通过范围审查和定性研究揭示了ML技术在非洲健康领域中可能出现的不公平现象，并特别关注殖民主义作为一个重要属性。",
    "en_tdlr": "This study examines global health fairness with Africa as a case study, revealing potential disparities in ML technology in African healthcare and focusing on colonialism as a key factor."
}