{
    "title": "State-Constrained Zero-Sum Differential Games with One-Sided Information",
    "abstract": "arXiv:2403.02741v1 Announce Type: cross  Abstract: We study zero-sum differential games with state constraints and one-sided information, where the informed player (Player 1) has a categorical payoff type unknown to the uninformed player (Player 2). The goal of Player 1 is to minimize his payoff without violating the constraints, while that of Player 2 is to either violate the state constraints, or otherwise, to maximize the payoff. One example of the game is a man-to-man matchup in football. Without state constraints, Cardaliaguet (2007) showed that the value of such a game exists and is convex to the common belief of players. Our theoretical contribution is an extension of this result to differential games with state constraints and the derivation of the primal and dual subdynamic principles necessary for computing the behavioral strategies. Compared with existing works on imperfect-information dynamic games that focus on scalability and generalization, our focus is instead on reveal",
    "link": "https://arxiv.org/abs/2403.02741",
    "context": "Title: State-Constrained Zero-Sum Differential Games with One-Sided Information\nAbstract: arXiv:2403.02741v1 Announce Type: cross  Abstract: We study zero-sum differential games with state constraints and one-sided information, where the informed player (Player 1) has a categorical payoff type unknown to the uninformed player (Player 2). The goal of Player 1 is to minimize his payoff without violating the constraints, while that of Player 2 is to either violate the state constraints, or otherwise, to maximize the payoff. One example of the game is a man-to-man matchup in football. Without state constraints, Cardaliaguet (2007) showed that the value of such a game exists and is convex to the common belief of players. Our theoretical contribution is an extension of this result to differential games with state constraints and the derivation of the primal and dual subdynamic principles necessary for computing the behavioral strategies. Compared with existing works on imperfect-information dynamic games that focus on scalability and generalization, our focus is instead on reveal",
    "path": "papers/24/03/2403.02741.json",
    "total_tokens": 757,
    "translated_title": "具有单边信息的状态约束零和微分博弈",
    "translated_abstract": "我们研究了具有状态约束和单边信息的零和微分博弈，其中知情玩家（玩家1）具有对于未知于不知情玩家（玩家2）的分类支付类型。玩家1的目标是在不违反约束的情况下最小化他的支付，而玩家2的目标是要么违反状态约束，要么最大化支付。我们的理论贡献是将Cardaliaguet（2007）对于没有状态约束的类似博弈价值存在性和对于玩家的共同信仰凸性的结果扩展到具有状态约束的微分博弈，并推导了用于计算行为策略的原始和对偶子动态原则。",
    "tldr": "我们将零和微分博弈的理论扩展到具有状态约束，并提出了计算行为策略所需的原始和对偶子动态原则。"
}