{
    "title": "Prompting ChatGPT for Translation: A Comparative Analysis of Translation Brief and Persona Prompts",
    "abstract": "arXiv:2403.00127v1 Announce Type: new  Abstract: Prompt engineering in LLMs has shown potential for improving translation quality. However, the potential of incorporating translation concepts in prompt design remains largely underexplored. Against this backdrop, this paper discusses the effectiveness of incorporating the conceptual tool of translation brief and the personas of translator and author into prompt design for translation tasks in ChatGPT. Findings suggest that, although certain elements are constructive in facilitating human to human communication for translation tasks, their effectiveness is limited for improving translation quality in ChatGPT. This accentuates the need for more explorative research on how translation theorists and practitioners can develop the current set of conceptual tools rooted in the human to human communication paradigm for translation purposes in this emerging workflow involving human machine interaction.",
    "link": "https://arxiv.org/abs/2403.00127",
    "context": "Title: Prompting ChatGPT for Translation: A Comparative Analysis of Translation Brief and Persona Prompts\nAbstract: arXiv:2403.00127v1 Announce Type: new  Abstract: Prompt engineering in LLMs has shown potential for improving translation quality. However, the potential of incorporating translation concepts in prompt design remains largely underexplored. Against this backdrop, this paper discusses the effectiveness of incorporating the conceptual tool of translation brief and the personas of translator and author into prompt design for translation tasks in ChatGPT. Findings suggest that, although certain elements are constructive in facilitating human to human communication for translation tasks, their effectiveness is limited for improving translation quality in ChatGPT. This accentuates the need for more explorative research on how translation theorists and practitioners can develop the current set of conceptual tools rooted in the human to human communication paradigm for translation purposes in this emerging workflow involving human machine interaction.",
    "path": "papers/24/03/2403.00127.json",
    "total_tokens": 853,
    "translated_title": "使用提示ChatGPT进行翻译：翻译简要和人物角色提示的比较分析",
    "translated_abstract": "LLMs中的提示工程已显示出改善翻译质量的潜力。然而，在提示设计中融入翻译概念的潜力仍未得到充分探讨。本文讨论了在ChatGPT中为翻译任务设计提示时将翻译简要概念和翻译者及作者的人物角色结合起来的有效性。研究结果表明，尽管某些元素有助于促进人与人之间的翻译通信，但它们在提高ChatGPT翻译质量方面的效果有限。这凸显了需要更多探索性研究，研究翻译理论家和实践者如何开发目前根植于人与人交流范式的概念工具集，以应用于涉及人机交互的新兴工作流中的翻译目的。",
    "tldr": "讨论在ChatGPT中将翻译简要和翻译者/作者人物角色融入提示设计的有效性，发现虽然有助于促进人类之间的翻译通信，但对于改善ChatGPT翻译质量的效果有限。"
}