{
    "title": "Optimal testing in a class of nonregular models",
    "abstract": "arXiv:2403.16413v1 Announce Type: cross  Abstract: This paper studies optimal hypothesis testing for nonregular statistical models with parameter-dependent support. We consider both one-sided and two-sided hypothesis testing and develop asymptotically uniformly most powerful tests based on the likelihood ratio process. The proposed one-sided test involves randomization to achieve asymptotic size control, some tuning constant to avoid discontinuities in the limiting likelihood ratio process, and a user-specified alternative hypothetical value to achieve the asymptotic optimality. Our two-sided test becomes asymptotically uniformly most powerful without imposing further restrictions such as unbiasedness. Simulation results illustrate desirable power properties of the proposed tests.",
    "link": "https://arxiv.org/abs/2403.16413",
    "context": "Title: Optimal testing in a class of nonregular models\nAbstract: arXiv:2403.16413v1 Announce Type: cross  Abstract: This paper studies optimal hypothesis testing for nonregular statistical models with parameter-dependent support. We consider both one-sided and two-sided hypothesis testing and develop asymptotically uniformly most powerful tests based on the likelihood ratio process. The proposed one-sided test involves randomization to achieve asymptotic size control, some tuning constant to avoid discontinuities in the limiting likelihood ratio process, and a user-specified alternative hypothetical value to achieve the asymptotic optimality. Our two-sided test becomes asymptotically uniformly most powerful without imposing further restrictions such as unbiasedness. Simulation results illustrate desirable power properties of the proposed tests.",
    "path": "papers/24/03/2403.16413.json",
    "total_tokens": 750,
    "translated_title": "一类非常规模型中的最优检验",
    "translated_abstract": "本文研究了参数依赖支持的非常规统计模型的最优假设检验。我们考虑了单侧和双侧假设检验，并基于似然比过程发展了渐近一致最强的检验。所提出的单侧检验涉及随机化以实现渐近尺寸控制，一些调节常数以避免在极限似然比过程中的不连续性，并一个用户指定的备择假设值以达到渐近最优性。我们的双侧检验在不施加进一步的限制（如无偏性）的情况下变为渐近一致最强。模拟结果展示了所提出检验的理想功效性质。",
    "tldr": "本文研究了一类非常规模型中的最优假设检验，提出了基于似然比过程的渐近一致最强测试方法，通过随机化、调节常数和用户指定备择假设值等方式实现渐近最优性。",
    "en_tdlr": "This paper investigates optimal hypothesis testing for nonregular statistical models with parameter-dependent support, proposing asymptotically uniformly most powerful tests based on the likelihood ratio process, achieving asymptotic optimality through randomization, tuning constants, and user-specified alternative hypothetical values."
}