{
    "title": "Robust SGLD algorithm for solving non-convex distributionally robust optimisation problems",
    "abstract": "arXiv:2403.09532v1 Announce Type: cross  Abstract: In this paper we develop a Stochastic Gradient Langevin Dynamics (SGLD) algorithm tailored for solving a certain class of non-convex distributionally robust optimisation problems. By deriving non-asymptotic convergence bounds, we build an algorithm which for any prescribed accuracy $\\varepsilon>0$ outputs an estimator whose expected excess risk is at most $\\varepsilon$. As a concrete application, we employ our robust SGLD algorithm to solve the (regularised) distributionally robust Mean-CVaR portfolio optimisation problem using real financial data. We empirically demonstrate that the trading strategy obtained by our robust SGLD algorithm outperforms the trading strategy obtained when solving the corresponding non-robust Mean-CVaR portfolio optimisation problem using, e.g., a classical SGLD algorithm. This highlights the practical relevance of incorporating model uncertainty when optimising portfolios in real financial markets.",
    "link": "https://arxiv.org/abs/2403.09532",
    "context": "Title: Robust SGLD algorithm for solving non-convex distributionally robust optimisation problems\nAbstract: arXiv:2403.09532v1 Announce Type: cross  Abstract: In this paper we develop a Stochastic Gradient Langevin Dynamics (SGLD) algorithm tailored for solving a certain class of non-convex distributionally robust optimisation problems. By deriving non-asymptotic convergence bounds, we build an algorithm which for any prescribed accuracy $\\varepsilon>0$ outputs an estimator whose expected excess risk is at most $\\varepsilon$. As a concrete application, we employ our robust SGLD algorithm to solve the (regularised) distributionally robust Mean-CVaR portfolio optimisation problem using real financial data. We empirically demonstrate that the trading strategy obtained by our robust SGLD algorithm outperforms the trading strategy obtained when solving the corresponding non-robust Mean-CVaR portfolio optimisation problem using, e.g., a classical SGLD algorithm. This highlights the practical relevance of incorporating model uncertainty when optimising portfolios in real financial markets.",
    "path": "papers/24/03/2403.09532.json",
    "total_tokens": 890,
    "translated_title": "用于解决非凸分布鲁棒优化问题的稳健SGLD算法",
    "translated_abstract": "在本文中，我们开发了一种特定类型的非凸分布鲁棒优化问题的随机梯度 Langevin 动力学（SGLD）算法。通过推导非渐近收敛界限，我们构建了一种算法，对于任何预先指定的精度$\\varepsilon>0$，该算法输出的估计值的期望超额风险最多为$\\varepsilon$。作为一个具体的应用，我们使用我们的稳健SGLD算法来解决（正则化的）分布鲁棒 Mean-CVaR 投资组合优化问题，并使用真实的金融数据。我们在经验上证明，通过我们的稳健SGLD算法获得的交易策略优于使用传统的 SGLD 算法解决相应的非鲁棒 Mean-CVaR 投资组合优化问题获得的交易策略。这突显了在优化实际金融市场投资组合时纳入模型不确定性的实际相关性。",
    "tldr": "本文开发了一种用于解决非凸分布鲁棒优化问题的稳健SGLD算法，并通过实证分析表明，该算法可以优于传统SGLD算法在金融投资组合优化中的应用。",
    "en_tdlr": "This paper develops a robust SGLD algorithm for solving non-convex distributionally robust optimization problems and empirically demonstrates its superiority in financial portfolio optimization over traditional SGLD algorithms."
}