{
    "title": "Effective anytime algorithm for multiobjective combinatorial optimization problems",
    "abstract": "arXiv:2403.08807v1 Announce Type: cross  Abstract: In multiobjective optimization, the result of an optimization algorithm is a set of efficient solutions from which the decision maker selects one. It is common that not all the efficient solutions can be computed in a short time and the search algorithm has to be stopped prematurely to analyze the solutions found so far. A set of efficient solutions that are well-spread in the objective space is preferred to provide the decision maker with a great variety of solutions. However, just a few exact algorithms in the literature exist with the ability to provide such a well-spread set of solutions at any moment: we call them anytime algorithms. We propose a new exact anytime algorithm for multiobjective combinatorial optimization combining three novel ideas to enhance the anytime behavior. We compare the proposed algorithm with those in the state-of-the-art for anytime multiobjective combinatorial optimization using a set of 480 instances fr",
    "link": "https://arxiv.org/abs/2403.08807",
    "context": "Title: Effective anytime algorithm for multiobjective combinatorial optimization problems\nAbstract: arXiv:2403.08807v1 Announce Type: cross  Abstract: In multiobjective optimization, the result of an optimization algorithm is a set of efficient solutions from which the decision maker selects one. It is common that not all the efficient solutions can be computed in a short time and the search algorithm has to be stopped prematurely to analyze the solutions found so far. A set of efficient solutions that are well-spread in the objective space is preferred to provide the decision maker with a great variety of solutions. However, just a few exact algorithms in the literature exist with the ability to provide such a well-spread set of solutions at any moment: we call them anytime algorithms. We propose a new exact anytime algorithm for multiobjective combinatorial optimization combining three novel ideas to enhance the anytime behavior. We compare the proposed algorithm with those in the state-of-the-art for anytime multiobjective combinatorial optimization using a set of 480 instances fr",
    "path": "papers/24/03/2403.08807.json",
    "total_tokens": 782,
    "translated_title": "多目标组合优化问题的有效即时算法",
    "translated_abstract": "在多目标优化中，优化算法的结果是一组有效解，决策者从中选择一个。常见情况是，并非所有有效解都能在短时间内计算出来，搜索算法必须过早停止以分析到目前为止找到的解。决策者更喜欢在客观空间中分布良好的一组有效解，以提供各种解决方案。然而，文献中只有少数几种确切的算法能够在任何时刻提供这样一组分布良好的解：我们称之为即时算法。我们提出了一种新的准确即时算法，用于多目标组合优化，结合了三种新颖的思想以增强即时性能。我们将所提出的算法与现有于当今最先进的即时多目标组合优化算法进行比较，使用一组480个实例。",
    "tldr": "提出了一种新的准确即时算法，用于多目标组合优化，结合了三种新颖的思想以增强即时性能",
    "en_tdlr": "A new exact anytime algorithm for multiobjective combinatorial optimization is proposed, combining three novel ideas to enhance the anytime behavior."
}