{
    "title": "LSTTN: A Long-Short Term Transformer-based Spatio-temporal Neural Network for Traffic Flow Forecasting",
    "abstract": "arXiv:2403.16495v1 Announce Type: cross  Abstract: Accurate traffic forecasting is a fundamental problem in intelligent transportation systems and learning long-range traffic representations with key information through spatiotemporal graph neural networks (STGNNs) is a basic assumption of current traffic flow prediction models. However, due to structural limitations, existing STGNNs can only utilize short-range traffic flow data; therefore, the models cannot adequately learn the complex trends and periodic features in traffic flow. Besides, it is challenging to extract the key temporal information from the long historical traffic series and obtain a compact representation. To solve the above problems, we propose a novel LSTTN (Long-Short Term Transformer-based Network) framework comprehensively considering the long- and short-term features in historical traffic flow. First, we employ a masked subseries Transformer to infer the content of masked subseries from a small portion of unmask",
    "link": "https://arxiv.org/abs/2403.16495",
    "context": "Title: LSTTN: A Long-Short Term Transformer-based Spatio-temporal Neural Network for Traffic Flow Forecasting\nAbstract: arXiv:2403.16495v1 Announce Type: cross  Abstract: Accurate traffic forecasting is a fundamental problem in intelligent transportation systems and learning long-range traffic representations with key information through spatiotemporal graph neural networks (STGNNs) is a basic assumption of current traffic flow prediction models. However, due to structural limitations, existing STGNNs can only utilize short-range traffic flow data; therefore, the models cannot adequately learn the complex trends and periodic features in traffic flow. Besides, it is challenging to extract the key temporal information from the long historical traffic series and obtain a compact representation. To solve the above problems, we propose a novel LSTTN (Long-Short Term Transformer-based Network) framework comprehensively considering the long- and short-term features in historical traffic flow. First, we employ a masked subseries Transformer to infer the content of masked subseries from a small portion of unmask",
    "path": "papers/24/03/2403.16495.json",
    "total_tokens": 890,
    "translated_title": "LSTTN：基于长短期Transformer的时空神经网络用于交通流量预测",
    "translated_abstract": "准确的交通预测是智能交通系统中一个基本问题，通过时空图神经网络（STGNNs）学习带关键信息的长程交通表示是当前交通流量预测模型的基本假设。然而，由于结构限制，现有的STGNNs只能利用短程交通流量数据；因此，这些模型无法充分学习交通流量中的复杂趋势和周期特征。此外，从长期历史交通系列中提取关键时间信息并获得紧凑表示也具有挑战性。为解决上述问题，我们提出了一种新颖的LSTTN（Long-Short Term Transformer-based Network）框架，全面考虑历史交通流量中的长期和短期特征。首先，我们利用一个掩码子序列Transformer来推断来自少量未被掩码的子序列的内容",
    "tldr": "LSTTN框架综合考虑历史交通流量中的长期和短期特征，通过掩码子序列Transformer解决了现有STGNNs模型只能利用短程交通流量数据的限制，实现了对交通流量复杂趋势和周期特征的充分学习",
    "en_tdlr": "LSTTN framework comprehensively considers the long- and short-term features in historical traffic flow, solving the limitation of existing STGNNs models in utilizing short-range traffic flow data through masked subseries Transformer, achieving sufficient learning of complex trends and periodic features in traffic flow."
}