{
    "title": "Ever-Evolving Memory by Blending and Refining the Past",
    "abstract": "arXiv:2403.04787v1 Announce Type: cross  Abstract: For a human-like chatbot, constructing a long-term memory is crucial. A naive approach for making a memory could be simply listing the summarized dialogue. However, this can lead to problems when the speaker's status change over time and contradictory information gets accumulated. It is important that the memory stays organized to lower the confusion for the response generator. In this paper, we propose a novel memory scheme for long-term conversation, CREEM. Unlike existing approaches that construct memory based solely on current sessions, our proposed model blending past memories during memory formation. Additionally, we introduce refining process to handle redundant or outdated information. This innovative approach seeks for overall improvement and coherence of chatbot responses by ensuring a more informed and dynamically evolving long-term memory.",
    "link": "https://arxiv.org/abs/2403.04787",
    "context": "Title: Ever-Evolving Memory by Blending and Refining the Past\nAbstract: arXiv:2403.04787v1 Announce Type: cross  Abstract: For a human-like chatbot, constructing a long-term memory is crucial. A naive approach for making a memory could be simply listing the summarized dialogue. However, this can lead to problems when the speaker's status change over time and contradictory information gets accumulated. It is important that the memory stays organized to lower the confusion for the response generator. In this paper, we propose a novel memory scheme for long-term conversation, CREEM. Unlike existing approaches that construct memory based solely on current sessions, our proposed model blending past memories during memory formation. Additionally, we introduce refining process to handle redundant or outdated information. This innovative approach seeks for overall improvement and coherence of chatbot responses by ensuring a more informed and dynamically evolving long-term memory.",
    "path": "papers/24/03/2403.04787.json",
    "total_tokens": 782,
    "translated_title": "通过混合和完善过去来不断演进记忆",
    "translated_abstract": "对于类似人类的聊天机器人，构建长期记忆至关重要。构建记忆的一个天真方法可能只是列出总结的对话。然而，当说话者的状态随时间变化时，这样做可能会导致问题，并积累矛盾信息。记忆保持有组织对于降低回应生成器的混乱很重要。在本文中，我们提出了一种新颖的长期对话记忆方案，CREEM。与仅基于当前对话构建记忆的现有方法不同，我们提出的模型在记忆形成过程中混合过去的记忆。此外，我们引入了完善过程来处理多余或过时信息。这种创新性方法通过确保一个更加知情和动态演变的长期记忆，旨在提高聊天机器人回应的整体改进和连贯性。",
    "tldr": "提出了一种新颖的长期对话记忆方案CREEM，通过混合过去记忆并引入完善过程来实现聊天机器人回应的整体改进和连贯性。",
    "en_tdlr": "Introduced a novel long-term conversation memory scheme CREEM, blending past memories and introducing a refining process to achieve overall improvement and coherence of chatbot responses."
}