{
    "title": "Spatial features of CO2 for occupancy detection in a naturally ventilated school building",
    "abstract": "arXiv:2403.06643v1 Announce Type: new  Abstract: Accurate occupancy information helps to improve building energy efficiency and occupant comfort. Occupancy detection methods based on CO2 sensors have received attention due to their low cost and low intrusiveness. In naturally ventilated buildings, the accuracy of CO2-based occupancy detection is generally low in related studies due to the complex ventilation behavior and the difficulty in measuring the actual air exchange through windows. In this study, we present two novel features for occupancy detection based on the spatial distribution of the CO2 concentration. After a quantitative analysis with Support Vector Machine (SVM) as classifier, it was found that the accuracy of occupancy state detection in naturally ventilated rooms could be improved by up to 14.8 percentage points compared to the baseline, reaching 83.2 % (F1 score 0.84) without any ventilation information. With ventilation information, the accuracy reached 87.6 % (F1 s",
    "link": "https://arxiv.org/abs/2403.06643",
    "context": "Title: Spatial features of CO2 for occupancy detection in a naturally ventilated school building\nAbstract: arXiv:2403.06643v1 Announce Type: new  Abstract: Accurate occupancy information helps to improve building energy efficiency and occupant comfort. Occupancy detection methods based on CO2 sensors have received attention due to their low cost and low intrusiveness. In naturally ventilated buildings, the accuracy of CO2-based occupancy detection is generally low in related studies due to the complex ventilation behavior and the difficulty in measuring the actual air exchange through windows. In this study, we present two novel features for occupancy detection based on the spatial distribution of the CO2 concentration. After a quantitative analysis with Support Vector Machine (SVM) as classifier, it was found that the accuracy of occupancy state detection in naturally ventilated rooms could be improved by up to 14.8 percentage points compared to the baseline, reaching 83.2 % (F1 score 0.84) without any ventilation information. With ventilation information, the accuracy reached 87.6 % (F1 s",
    "path": "papers/24/03/2403.06643.json",
    "total_tokens": 986,
    "translated_title": "CO2在自然通风学校建筑物中用于占用检测的空间特征",
    "translated_abstract": "精确的占用信息有助于提高建筑能源效率和居住者舒适度。基于CO2传感器的占用检测方法由于成本低、干扰小，受到关注。在自然通风建筑中，由于复杂的通风行为和测量窗户实际换气量的困难，基于CO2的占用检测准确性通常较低。本研究提出了基于CO2浓度的空间分布的两种新颖特征用于占用检测。通过使用支持向量机（SVM）作为分类器的量化分析，发现与基准相比，在没有任何通风信息的情况下，自然通风房间中的占用状态检测准确率可提高最多14.8个百分点，达到83.2％（F1分数0.84）。有通风信息的情况下，准确率达到87.6％（F1分数0. ．84）。",
    "tldr": "通过空间CO2浓度分布提出两种新特征，使用支持向量机进行量化分析后发现，与基准相比，在自然通风房间中的占用状态检测准确率最多可提高14.8个百分点，达到83.2％（F1分数0.84）。有通风信息的情况下，准确率达到87.6％。",
    "en_tdlr": "Two novel features based on the spatial distribution of CO2 concentration were proposed for occupancy detection, and after a quantitative analysis with Support Vector Machine, it was found that the accuracy of occupancy state detection in naturally ventilated rooms could be improved by up to 14.8 percentage points compared to the baseline, reaching 83.2% (F1 score 0.84) without any ventilation information. With ventilation information, the accuracy reached 87.6%."
}