{
    "title": "Learning on JPEG-LDPC Compressed Images: Classifying with Syndromes",
    "abstract": "arXiv:2403.10202v1 Announce Type: cross  Abstract: In goal-oriented communications, the objective of the receiver is often to apply a Deep-Learning model, rather than reconstructing the original data. In this context, direct learning over compressed data, without any prior decoding, holds promise for enhancing the time-efficient execution of inference models at the receiver. However, conventional entropic-coding methods like Huffman and Arithmetic break data structure, rendering them unsuitable for learning without decoding. In this paper, we propose an alternative approach in which entropic coding is realized with Low-Density Parity Check (LDPC) codes. We hypothesize that Deep Learning models can more effectively exploit the internal code structure of LDPC codes. At the receiver, we leverage a specific class of Recurrent Neural Networks (RNNs), specifically Gated Recurrent Unit (GRU), trained for image classification. Our numerical results indicate that classification based on LDPC-co",
    "link": "https://arxiv.org/abs/2403.10202",
    "context": "Title: Learning on JPEG-LDPC Compressed Images: Classifying with Syndromes\nAbstract: arXiv:2403.10202v1 Announce Type: cross  Abstract: In goal-oriented communications, the objective of the receiver is often to apply a Deep-Learning model, rather than reconstructing the original data. In this context, direct learning over compressed data, without any prior decoding, holds promise for enhancing the time-efficient execution of inference models at the receiver. However, conventional entropic-coding methods like Huffman and Arithmetic break data structure, rendering them unsuitable for learning without decoding. In this paper, we propose an alternative approach in which entropic coding is realized with Low-Density Parity Check (LDPC) codes. We hypothesize that Deep Learning models can more effectively exploit the internal code structure of LDPC codes. At the receiver, we leverage a specific class of Recurrent Neural Networks (RNNs), specifically Gated Recurrent Unit (GRU), trained for image classification. Our numerical results indicate that classification based on LDPC-co",
    "path": "papers/24/03/2403.10202.json",
    "total_tokens": 838,
    "translated_title": "在JPEG-LDPC压缩图像上学习：利用综合症状进行分类",
    "translated_abstract": "在面向目标的通信中，接收者的目标通常是应用深度学习模型，而不是重建原始数据。 在这种情况下，在接收器上无需进行任何先前解码即可直接对压缩数据进行学习，有望增强推断模型的时间效率。 本文提出了一种替代方法，其中经熵编码是用低密度奇偶校验（LDPC）码实现的。我们假设深度学习模型可以更有效地利用LDPC码的内部代码结构。 在接收器端，我们利用一种特定类型的循环神经网络（RNN），具体来说是用于图像分类的门控循环单元（GRU）进行训练。 我们的数值结果表明，基于LDPC的分类有望通过基于数据综合症状的图像分类明显地提高性能。",
    "tldr": "在这篇论文中，提出了一种在JPEG-LDPC压缩图像上进行分类的方法，通过利用LDPC码的内部代码结构，使用GRU进行训练，从而实现了高效的图像分类。",
    "en_tdlr": "This paper proposes a method for classifying images on JPEG-LDPC compressed images, leveraging the internal code structure of LDPC codes and training with GRU, achieving efficient image classification based on data syndromes."
}