{
    "title": "The evaluation of a code-switched Sepedi-English automatic speech recognition system",
    "abstract": "arXiv:2403.07947v1 Announce Type: cross  Abstract: Speech technology is a field that encompasses various techniques and tools used to enable machines to interact with speech, such as automatic speech recognition (ASR), spoken dialog systems, and others, allowing a device to capture spoken words through a microphone from a human speaker. End-to-end approaches such as Connectionist Temporal Classification (CTC) and attention-based methods are the most used for the development of ASR systems. However, these techniques were commonly used for research and development for many high-resourced languages with large amounts of speech data for training and evaluation, leaving low-resource languages relatively underdeveloped. While the CTC method has been successfully used for other languages, its effectiveness for the Sepedi language remains uncertain. In this study, we present the evaluation of the Sepedi-English code-switched automatic speech recognition system. This end-to-end system was devel",
    "link": "https://arxiv.org/abs/2403.07947",
    "context": "Title: The evaluation of a code-switched Sepedi-English automatic speech recognition system\nAbstract: arXiv:2403.07947v1 Announce Type: cross  Abstract: Speech technology is a field that encompasses various techniques and tools used to enable machines to interact with speech, such as automatic speech recognition (ASR), spoken dialog systems, and others, allowing a device to capture spoken words through a microphone from a human speaker. End-to-end approaches such as Connectionist Temporal Classification (CTC) and attention-based methods are the most used for the development of ASR systems. However, these techniques were commonly used for research and development for many high-resourced languages with large amounts of speech data for training and evaluation, leaving low-resource languages relatively underdeveloped. While the CTC method has been successfully used for other languages, its effectiveness for the Sepedi language remains uncertain. In this study, we present the evaluation of the Sepedi-English code-switched automatic speech recognition system. This end-to-end system was devel",
    "path": "papers/24/03/2403.07947.json",
    "total_tokens": 824,
    "translated_title": "评估一种混合使用Sepedi-英语的自动语音识别系统",
    "translated_abstract": "arXiv:2403.07947v1 发表类型: 跨领域  摘要: 语音技术是一个涵盖各种技术和工具的领域，用于使设备能够与语音进行交互，例如自动语音识别（ASR）、口语对话系统等，允许设备通过麦克风从说话者那里捕获说话的话语。端到端方法，如连接主义时间分类（CTC）和基于注意力的方法是开发ASR系统中使用最广泛的方法。然而，这些技术通常用于对具有大量语音数据进行训练和评估的高资源语言进行研究和开发，导致低资源语言相对较少发展。尽管CTC方法在其他语言中已成功使用，但它在Sepedi语言中的有效性仍存在不确定性。在这项研究中，我们介绍了混合使用Sepedi-英语的自动语音识别系统的评估。",
    "tldr": "评估了一种混合使用Sepedi-英语的自动语音识别系统，探讨了端到端方法在低资源语言中的有效性。"
}