{
    "title": "Forecasting Geoffective Events from Solar Wind Data and Evaluating the Most Predictive Features through Machine Learning Approaches",
    "abstract": "arXiv:2403.09847v1 Announce Type: cross  Abstract: This study addresses the prediction of geomagnetic disturbances by exploiting machine learning techniques. Specifically, the Long-Short Term Memory recurrent neural network, which is particularly suited for application over long time series, is employed in the analysis of in-situ measurements of solar wind plasma and magnetic field acquired over more than one solar cycle, from $2005$ to $2019$, at the Lagrangian point L$1$. The problem is approached as a binary classification aiming to predict one hour in advance a decrease in the SYM-H geomagnetic activity index below the threshold of $-50$ nT, which is generally regarded as indicative of magnetospheric perturbations. The strong class imbalance issue is tackled by using an appropriate loss function tailored to optimize appropriate skill scores in the training phase of the neural network. Beside classical skill scores, value-weighted skill scores are then employed to evaluate predictio",
    "link": "https://arxiv.org/abs/2403.09847",
    "context": "Title: Forecasting Geoffective Events from Solar Wind Data and Evaluating the Most Predictive Features through Machine Learning Approaches\nAbstract: arXiv:2403.09847v1 Announce Type: cross  Abstract: This study addresses the prediction of geomagnetic disturbances by exploiting machine learning techniques. Specifically, the Long-Short Term Memory recurrent neural network, which is particularly suited for application over long time series, is employed in the analysis of in-situ measurements of solar wind plasma and magnetic field acquired over more than one solar cycle, from $2005$ to $2019$, at the Lagrangian point L$1$. The problem is approached as a binary classification aiming to predict one hour in advance a decrease in the SYM-H geomagnetic activity index below the threshold of $-50$ nT, which is generally regarded as indicative of magnetospheric perturbations. The strong class imbalance issue is tackled by using an appropriate loss function tailored to optimize appropriate skill scores in the training phase of the neural network. Beside classical skill scores, value-weighted skill scores are then employed to evaluate predictio",
    "path": "papers/24/03/2403.09847.json",
    "total_tokens": 907,
    "translated_title": "利用太阳风数据预测地磁活跃事件并通过机器学习方法评估最具预测性的特征",
    "translated_abstract": "本研究利用机器学习技术解决地磁扰动的预测问题。具体来说，利用长短期记忆循环神经网络对逐点采集的太阳风等离子体和磁场的数据进行分析，时间跨度超过一个太阳周期，从2005年到2019年，在拉格朗日点L1处获取数据。该问题被看作是一个二元分类问题，旨在预测SYC-H地磁活动指数在一小时内下降到-50 nT以下的情况，这通常被认为是磁层扰动的指标。强类别不平衡问题通过使用适当的损失函数加以应对，该损失函数专门设计用于优化神经网络训练阶段的适当技能评分。除了传统的技能评分，还使用了价值加权技能评分来评估预测结果。",
    "tldr": "本研究利用机器学习技术预测地磁扰动，通过长短期记忆循环神经网络分析太阳风数据，针对强类别不平衡问题设计适当损失函数，并采用价值加权技能评分评估预测效果。",
    "en_tdlr": "This study utilizes machine learning techniques to forecast geomagnetic disturbances, analyzing solar wind data through Long-Short Term Memory recurrent neural network, addressing the strong class imbalance issue with tailored loss function, and evaluating predictions using value-weighted skill scores."
}