{
    "title": "Gabor-guided transformer for single image deraining",
    "abstract": "arXiv:2403.07380v1 Announce Type: cross  Abstract: Image deraining have have gained a great deal of attention in order to address the challenges posed by the effects of harsh weather conditions on visual tasks. While convolutional neural networks (CNNs) are popular, their limitations in capturing global information may result in ineffective rain removal. Transformer-based methods with self-attention mechanisms have improved, but they tend to distort high-frequency details that are crucial for image fidelity. To solve this problem, we propose the Gabor-guided tranformer (Gabformer) for single image deraining. The focus on local texture features is enhanced by incorporating the information processed by the Gabor filter into the query vector, which also improves the robustness of the model to noise due to the properties of the filter. Extensive experiments on the benchmarks demonstrate that our method outperforms state-of-the-art approaches.",
    "link": "https://arxiv.org/abs/2403.07380",
    "context": "Title: Gabor-guided transformer for single image deraining\nAbstract: arXiv:2403.07380v1 Announce Type: cross  Abstract: Image deraining have have gained a great deal of attention in order to address the challenges posed by the effects of harsh weather conditions on visual tasks. While convolutional neural networks (CNNs) are popular, their limitations in capturing global information may result in ineffective rain removal. Transformer-based methods with self-attention mechanisms have improved, but they tend to distort high-frequency details that are crucial for image fidelity. To solve this problem, we propose the Gabor-guided tranformer (Gabformer) for single image deraining. The focus on local texture features is enhanced by incorporating the information processed by the Gabor filter into the query vector, which also improves the robustness of the model to noise due to the properties of the filter. Extensive experiments on the benchmarks demonstrate that our method outperforms state-of-the-art approaches.",
    "path": "papers/24/03/2403.07380.json",
    "total_tokens": 731,
    "translated_title": "基于Gabor引导的变压器用于单幅图像去雨",
    "translated_abstract": "图像去雨已经引起了广泛关注，以应对恶劣天气条件对视觉任务造成的挑战。本文提出了一种基于Gabor引导的变压器（Gabformer）用于单幅图像去雨，通过将Gabor滤波器处理的信息融入查询向量来增强对局部纹理特征的关注，从而提高了模型对噪声的鲁棒性。实验结果表明，我们的方法优于当今最先进的方法。",
    "tldr": "本文提出了一种基于Gabor引导的变压器（Gabformer）用于单幅图像去雨，通过融入Gabor滤波器处理的信息提高了对局部纹理特征的关注，以及增强了模型对噪声的鲁棒性。",
    "en_tdlr": "This paper introduces a Gabor-guided transformer (Gabformer) for single image deraining, which enhances the focus on local texture features by incorporating information processed by the Gabor filter and improves the robustness of the model to noise."
}