{
    "title": "Representing Molecules as Random Walks Over Interpretable Grammars",
    "abstract": "arXiv:2403.08147v1 Announce Type: new  Abstract: Recent research in molecular discovery has primarily been devoted to small, drug-like molecules, leaving many similarly important applications in material design without adequate technology. These applications often rely on more complex molecular structures with fewer examples that are carefully designed using known substructures. We propose a data-efficient and interpretable model for representing and reasoning over such molecules in terms of graph grammars that explicitly describe the hierarchical design space featuring motifs to be the design basis. We present a novel representation in the form of random walks over the design space, which facilitates both molecule generation and property prediction. We demonstrate clear advantages over existing methods in terms of performance, efficiency, and synthesizability of predicted molecules, and we provide detailed insights into the method's chemical interpretability.",
    "link": "https://arxiv.org/abs/2403.08147",
    "context": "Title: Representing Molecules as Random Walks Over Interpretable Grammars\nAbstract: arXiv:2403.08147v1 Announce Type: new  Abstract: Recent research in molecular discovery has primarily been devoted to small, drug-like molecules, leaving many similarly important applications in material design without adequate technology. These applications often rely on more complex molecular structures with fewer examples that are carefully designed using known substructures. We propose a data-efficient and interpretable model for representing and reasoning over such molecules in terms of graph grammars that explicitly describe the hierarchical design space featuring motifs to be the design basis. We present a novel representation in the form of random walks over the design space, which facilitates both molecule generation and property prediction. We demonstrate clear advantages over existing methods in terms of performance, efficiency, and synthesizability of predicted molecules, and we provide detailed insights into the method's chemical interpretability.",
    "path": "papers/24/03/2403.08147.json",
    "total_tokens": 828,
    "translated_title": "将分子表示为可解释的文法上的随机游走",
    "translated_abstract": "最近分子探索领域的研究主要集中在小型、类似药物的分子上，导致许多在材料设计中同样重要的应用缺乏足够的技术支持。这些应用通常依赖于更复杂的分子结构，有更少的例子，是使用已知的亚结构精心设计的。我们提出了一种数据高效且可解释的模型，用于以图文法的形式表示和推理这些分子，明确描述了特征为设计基础的层次化设计空间。我们提出了一种新颖的表示形式，即在设计空间上进行随机游走，既有助于分子生成，又有助于属性预测。我们展示了相较于现有方法在性能、效率和预测分子可合成性方面的明显优势，并详细阐述了该方法的化学可解释性。",
    "tldr": "提出了一种新颖的分子表示模型，使用可解释的图文法描述分子的层次化设计空间，实现了在设计空间上的随机游走，从而提高了分子生成和属性预测的性能、效率和可合成性。",
    "en_tdlr": "A novel model for molecular representation was proposed, utilizing interpretable graph grammars to describe hierarchical design space of molecules, enabling random walks over the design space for improved performance, efficiency, and synthesizability in molecule generation and property prediction."
}