{
    "title": "Metamorpheus: Interactive, Affective, and Creative Dream Narration Through Metaphorical Visual Storytelling",
    "abstract": "arXiv:2403.00632v1 Announce Type: cross  Abstract: Human emotions are essentially molded by lived experiences, from which we construct personalised meaning. The engagement in such meaning-making process has been practiced as an intervention in various psychotherapies to promote wellness. Nevertheless, to support recollecting and recounting lived experiences in everyday life remains under explored in HCI. It also remains unknown how technologies such as generative AI models can facilitate the meaning making process, and ultimately support affective mindfulness. In this paper we present Metamorpheus, an affective interface that engages users in a creative visual storytelling of emotional experiences during dreams. Metamorpheus arranges the storyline based on a dream's emotional arc, and provokes self-reflection through the creation of metaphorical images and text depictions. The system provides metaphor suggestions, and generates visual metaphors and text depictions using generative AI m",
    "link": "https://arxiv.org/abs/2403.00632",
    "context": "Title: Metamorpheus: Interactive, Affective, and Creative Dream Narration Through Metaphorical Visual Storytelling\nAbstract: arXiv:2403.00632v1 Announce Type: cross  Abstract: Human emotions are essentially molded by lived experiences, from which we construct personalised meaning. The engagement in such meaning-making process has been practiced as an intervention in various psychotherapies to promote wellness. Nevertheless, to support recollecting and recounting lived experiences in everyday life remains under explored in HCI. It also remains unknown how technologies such as generative AI models can facilitate the meaning making process, and ultimately support affective mindfulness. In this paper we present Metamorpheus, an affective interface that engages users in a creative visual storytelling of emotional experiences during dreams. Metamorpheus arranges the storyline based on a dream's emotional arc, and provokes self-reflection through the creation of metaphorical images and text depictions. The system provides metaphor suggestions, and generates visual metaphors and text depictions using generative AI m",
    "path": "papers/24/03/2403.00632.json",
    "total_tokens": 919,
    "translated_title": "形态变异：通过隐喻视觉叙事进行互动、情感和创造性梦境叙述",
    "translated_abstract": "人类的情感基本上是由生活经验塑造的，我们从中构建个性化意义。参与这种意义塑造过程已经被作为各种心理治疗中的一种干预来促进健康。然而，支持在日常生活中回忆和叙述生活经验仍然在人机交互领域鲜有探讨。如何利用生成式人工智能模型等技术来促进意义塑造过程，最终支持情感正念仍然是未知的。在本文中，我们呈现了Metamorpheus，一种情感接口，通过创造性的视觉叙事来参与用户在梦境中的情感经历。Metamorpheus根据梦境的情感弧线排列故事情节，并通过创造隐喻图像和文本描绘来促使自我反思。该系统提供隐喻建议，并利用生成式人工智能生成视觉隐喻和文本描绘。",
    "tldr": "本研究提出了Metamorpheus，一种情感接口，通过创造性的视觉叙事来参与用户在梦境中的情感经历，利用生成式人工智能生成视觉隐喻和文本描绘，促使自我反思。",
    "en_tdlr": "This study introduces Metamorpheus, an affective interface that engages users in a creative visual storytelling of emotional experiences during dreams, utilizing generative AI to generate visual metaphors and text depictions to provoke self-reflection."
}