{
    "title": "Persian Slang Text Conversion to Formal and Deep Learning of Persian Short Texts on Social Media for Sentiment Classification",
    "abstract": "arXiv:2403.06023v1 Announce Type: new  Abstract: The lack of a suitable tool for the analysis of conversational texts in the Persian language has made various analyses of these texts, including Sentiment Analysis, difficult. In this research, we tried to make the understanding of these texts easier for the machine by providing PSC, Persian Slang Converter, a tool for converting conversational texts into formal ones, and by using the most up-to-date and best deep learning methods along with the PSC, the sentiment learning of short Persian language texts for the machine in a better way. be made More than 10 million unlabeled texts from various social networks and movie subtitles (as Conversational texts) and about 10 million news texts (as formal texts) have been used for training unsupervised models and formal implementation of the tool. 60,000 texts from the comments of Instagram social network users with positive, negative, and neutral labels are considered supervised data for trainin",
    "link": "https://arxiv.org/abs/2403.06023",
    "context": "Title: Persian Slang Text Conversion to Formal and Deep Learning of Persian Short Texts on Social Media for Sentiment Classification\nAbstract: arXiv:2403.06023v1 Announce Type: new  Abstract: The lack of a suitable tool for the analysis of conversational texts in the Persian language has made various analyses of these texts, including Sentiment Analysis, difficult. In this research, we tried to make the understanding of these texts easier for the machine by providing PSC, Persian Slang Converter, a tool for converting conversational texts into formal ones, and by using the most up-to-date and best deep learning methods along with the PSC, the sentiment learning of short Persian language texts for the machine in a better way. be made More than 10 million unlabeled texts from various social networks and movie subtitles (as Conversational texts) and about 10 million news texts (as formal texts) have been used for training unsupervised models and formal implementation of the tool. 60,000 texts from the comments of Instagram social network users with positive, negative, and neutral labels are considered supervised data for trainin",
    "path": "papers/24/03/2403.06023.json",
    "total_tokens": 727,
    "translated_title": "波斯语俚语文本转换为正式文本以及社交媒体上波斯语短文本的深度学习用于情感分类",
    "translated_abstract": "缺乏适合分析波斯语会话文本的工具使得对这些文本（包括情感分析）的各种分析变得困难。本研究尝试通过提供PSC（波斯语俚语转换器），将会话文本转换为正式文本，并结合最新和最佳的深度学习方法，使机器更容易理解这些文本，更好地进行波斯语短文本的情感学习。",
    "tldr": "通过提供PSC工具将波斯语俚语文本转换为正式文本，结合深度学习方法进行波斯语短文本的情感学习。",
    "en_tdlr": "Persian slang text is converted to formal text using PSC tool and sentiment learning of Persian short texts is enhanced through deep learning methods."
}