{
    "title": "Towards Effective Usage of Human-Centric Priors in Diffusion Models for Text-based Human Image Generation",
    "abstract": "arXiv:2403.05239v1 Announce Type: cross  Abstract: Vanilla text-to-image diffusion models struggle with generating accurate human images, commonly resulting in imperfect anatomies such as unnatural postures or disproportionate limbs.Existing methods address this issue mostly by fine-tuning the model with extra images or adding additional controls -- human-centric priors such as pose or depth maps -- during the image generation phase. This paper explores the integration of these human-centric priors directly into the model fine-tuning stage, essentially eliminating the need for extra conditions at the inference stage. We realize this idea by proposing a human-centric alignment loss to strengthen human-related information from the textual prompts within the cross-attention maps. To ensure semantic detail richness and human structural accuracy during fine-tuning, we introduce scale-aware and step-wise constraints within the diffusion process, according to an in-depth analysis of the cross",
    "link": "https://arxiv.org/abs/2403.05239",
    "context": "Title: Towards Effective Usage of Human-Centric Priors in Diffusion Models for Text-based Human Image Generation\nAbstract: arXiv:2403.05239v1 Announce Type: cross  Abstract: Vanilla text-to-image diffusion models struggle with generating accurate human images, commonly resulting in imperfect anatomies such as unnatural postures or disproportionate limbs.Existing methods address this issue mostly by fine-tuning the model with extra images or adding additional controls -- human-centric priors such as pose or depth maps -- during the image generation phase. This paper explores the integration of these human-centric priors directly into the model fine-tuning stage, essentially eliminating the need for extra conditions at the inference stage. We realize this idea by proposing a human-centric alignment loss to strengthen human-related information from the textual prompts within the cross-attention maps. To ensure semantic detail richness and human structural accuracy during fine-tuning, we introduce scale-aware and step-wise constraints within the diffusion process, according to an in-depth analysis of the cross",
    "path": "papers/24/03/2403.05239.json",
    "total_tokens": 849,
    "translated_title": "面向基于扩散模型的文本人体图像生成中人性先验有效利用",
    "translated_abstract": "Vanilla文本到图像的扩散模型在生成准确的人体图像方面存在困难，通常导致不完美的解剖结构，如不自然的姿势或肢体不成比例。现有方法主要通过对模型进行微调，使用额外图像或添加额外控制（如姿势或深度图）来解决这个问题，这些控制主要在图像生成阶段引入人性先验。本文探讨将这些人性先验直接集成到模型微调阶段，从而在推理阶段消除额外条件的可能性。我们通过提出人性对齐损失来实现这一想法，从文本提示中强化人体相关信息，并在扩散过程中引入具有规模感知和逐步约束的因素，以确保在微调过程中的语义细节丰富性和人体结构准确性。",
    "tldr": "本文提出了一种新方法，通过将人性先验直接融入模型微调阶段，强化文本提示中的人体相关信息，并引入规模感知和逐步约束，从而有效提升了基于扩散模型的文本人体图像生成质量",
    "en_tdlr": "This paper proposes a new method to enhance the quality of text-based human image generation using diffusion models by integrating human-centric priors directly into the model fine-tuning stage and introducing scale-aware and step-wise constraints."
}