{
    "title": "Deep learning with noisy labels in medical prediction problems: a scoping review",
    "abstract": "arXiv:2403.13111v1 Announce Type: new  Abstract: Objectives: Medical research faces substantial challenges from noisy labels attributed to factors like inter-expert variability and machine-extracted labels. Despite this, the adoption of label noise management remains limited, and label noise is largely ignored. To this end, there is a critical need to conduct a scoping review focusing on the problem space. This scoping review aims to comprehensively review label noise management in deep learning-based medical prediction problems, which includes label noise detection, label noise handling, and evaluation. Research involving label uncertainty is also included.   Methods: Our scoping review follows the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. We searched 4 databases, including PubMed, IEEE Xplore, Google Scholar, and Semantic Scholar. Our search terms include \"noisy label AND medical / healthcare / clinical\", \"un-certainty AND medical / healt",
    "link": "https://arxiv.org/abs/2403.13111",
    "context": "Title: Deep learning with noisy labels in medical prediction problems: a scoping review\nAbstract: arXiv:2403.13111v1 Announce Type: new  Abstract: Objectives: Medical research faces substantial challenges from noisy labels attributed to factors like inter-expert variability and machine-extracted labels. Despite this, the adoption of label noise management remains limited, and label noise is largely ignored. To this end, there is a critical need to conduct a scoping review focusing on the problem space. This scoping review aims to comprehensively review label noise management in deep learning-based medical prediction problems, which includes label noise detection, label noise handling, and evaluation. Research involving label uncertainty is also included.   Methods: Our scoping review follows the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. We searched 4 databases, including PubMed, IEEE Xplore, Google Scholar, and Semantic Scholar. Our search terms include \"noisy label AND medical / healthcare / clinical\", \"un-certainty AND medical / healt",
    "path": "papers/24/03/2403.13111.json",
    "total_tokens": 887,
    "translated_title": "医疗预测问题中带有噪声标签的深度学习：一项范围审阅",
    "translated_abstract": "目的：医疗研究面临来自因素如专家间变异和机器提取标签等噪声标签的重大挑战。尽管如此，噪声标签管理的采用仍然有限，噪声标签很大程度上被忽视。因此，迫切需要进行一项侧重于问题空间的范围审阅。本范围审阅旨在全面审查深度学习医疗预测问题中的标签噪声管理，其中包括标签噪声检测、标签噪声处理和评估。还包括涉及标签不确定性的研究。 方法：我们的范围审阅遵循首选报告项为系统性审查和Meta分析（PRISMA）指南。我们搜索了4个数据库，包括PubMed、IEEE Xplore、Google Scholar和Semantic Scholar。我们的搜索词包括“noisy label AND medical/healthcare/clinical”，“uncertainty AND medical/healthcare/clinical”。",
    "tldr": "该范围审阅全面审查了医疗预测问题中深度学习的标签噪声管理，包括标签噪声检测、标签噪声处理和评估，同时也包括研究标签不确定性。",
    "en_tdlr": "The scoping review comprehensively examines label noise management in deep learning for medical prediction problems, covering label noise detection, handling, evaluation, and research on label uncertainty."
}