{
    "title": "Debiasing Sentence Embedders through Contrastive Word Pairs",
    "abstract": "arXiv:2403.18555v1 Announce Type: new  Abstract: Over the last years, various sentence embedders have been an integral part in the success of current machine learning approaches to Natural Language Processing (NLP). Unfortunately, multiple sources have shown that the bias, inherent in the datasets upon which these embedding methods are trained, is learned by them. A variety of different approaches to remove biases in embeddings exists in the literature. Most of these approaches are applicable to word embeddings and in fewer cases to sentence embeddings. It is problematic that most debiasing approaches are directly transferred from word embeddings, therefore these approaches fail to take into account the nonlinear nature of sentence embedders and the embeddings they produce. It has been shown in literature that bias information is still present if sentence embeddings are debiased using such methods. In this contribution, we explore an approach to remove linear and nonlinear bias informa",
    "link": "https://arxiv.org/abs/2403.18555",
    "context": "Title: Debiasing Sentence Embedders through Contrastive Word Pairs\nAbstract: arXiv:2403.18555v1 Announce Type: new  Abstract: Over the last years, various sentence embedders have been an integral part in the success of current machine learning approaches to Natural Language Processing (NLP). Unfortunately, multiple sources have shown that the bias, inherent in the datasets upon which these embedding methods are trained, is learned by them. A variety of different approaches to remove biases in embeddings exists in the literature. Most of these approaches are applicable to word embeddings and in fewer cases to sentence embeddings. It is problematic that most debiasing approaches are directly transferred from word embeddings, therefore these approaches fail to take into account the nonlinear nature of sentence embedders and the embeddings they produce. It has been shown in literature that bias information is still present if sentence embeddings are debiased using such methods. In this contribution, we explore an approach to remove linear and nonlinear bias informa",
    "path": "papers/24/03/2403.18555.json",
    "total_tokens": 804,
    "translated_title": "通过对比词对消除句子嵌入器中的偏差",
    "translated_abstract": "在过去的几年中，各种句子嵌入器已成为目前自然语言处理（NLP）机器学习方法成功的重要组成部分。不幸的是，多个来源已经表明，这些嵌入方法所训练的数据集中固有的偏差是由它们学习到的。文献中存在许多不同的方法来消除嵌入中的偏差，大多数这些方法适用于词嵌入，更少的情况适用于句子嵌入。问题在于，大多数去偏方法直接从词嵌入转移而来，因此这些方法未能考虑到句子嵌入器的非线性特性及其产生的嵌入。文献中已经表明，如果使用这种方法去除语句嵌入中的偏差，则偏差信息仍然存在。在本文中，我们探索了一种方法来消除线性和非线性偏差信息。",
    "tldr": "本文探讨了一种通过对比词对消除句子嵌入器中线性和非线性偏差信息的方法",
    "en_tdlr": "This paper explores an approach to remove linear and nonlinear bias information in sentence embedders through contrastive word pairs."
}