{
    "title": "Deep Generative Design for Mass Production",
    "abstract": "arXiv:2403.12098v1 Announce Type: cross  Abstract: Generative Design (GD) has evolved as a transformative design approach, employing advanced algorithms and AI to create diverse and innovative solutions beyond traditional constraints. Despite its success, GD faces significant challenges regarding the manufacturability of complex designs, often necessitating extensive manual modifications due to limitations in standard manufacturing processes and the reliance on additive manufacturing, which is not ideal for mass production. Our research introduces an innovative framework addressing these manufacturability concerns by integrating constraints pertinent to die casting and injection molding into GD, through the utilization of 2D depth images. This method simplifies intricate 3D geometries into manufacturable profiles, removing unfeasible features such as non-manufacturable overhangs and allowing for the direct consideration of essential manufacturing aspects like thickness and rib design. ",
    "link": "https://arxiv.org/abs/2403.12098",
    "context": "Title: Deep Generative Design for Mass Production\nAbstract: arXiv:2403.12098v1 Announce Type: cross  Abstract: Generative Design (GD) has evolved as a transformative design approach, employing advanced algorithms and AI to create diverse and innovative solutions beyond traditional constraints. Despite its success, GD faces significant challenges regarding the manufacturability of complex designs, often necessitating extensive manual modifications due to limitations in standard manufacturing processes and the reliance on additive manufacturing, which is not ideal for mass production. Our research introduces an innovative framework addressing these manufacturability concerns by integrating constraints pertinent to die casting and injection molding into GD, through the utilization of 2D depth images. This method simplifies intricate 3D geometries into manufacturable profiles, removing unfeasible features such as non-manufacturable overhangs and allowing for the direct consideration of essential manufacturing aspects like thickness and rib design. ",
    "path": "papers/24/03/2403.12098.json",
    "total_tokens": 851,
    "translated_title": "深度生成设计用于大规模生产",
    "translated_abstract": "生成设计（GD）作为一种革命性的设计方法已经发展，采用先进的算法和人工智能来创造超越传统限制的多样化和创新性解决方案。尽管取得了成功，但生成设计在复杂设计的可制造性方面面临着重大挑战，通常需要进行大量手动修改，因为标准制造过程存在限制，并且依赖于并不适合大规模生产的增材制造技术。我们的研究通过将与压铸和注塑相关的约束集成到GD中，通过利用二维深度图像，引入了一种创新框架来解决这些可制造性问题。这种方法将复杂的三维几何形状简化为可制造的轮廓，去除不可制造的悬挑等不可行特性，并允许直接考虑厚度和肋设计等重要制造方面。",
    "tldr": "通过将与压铸和注塑相关的约束集成到生成设计中，利用二维深度图像将复杂的3D几何形状简化为可制造的轮廓，消除不可制造特性，将重点放在厚度和肋设计等制造重要方面。",
    "en_tdlr": "By integrating constraints relevant to die casting and injection molding into generative design and using 2D depth images to simplify complex 3D geometries into manufacturable profiles, unfeasible features are removed, allowing a focus on essential manufacturing aspects like thickness and rib design."
}