{
    "title": "A Survey on Temporal Knowledge Graph: Representation Learning and Applications",
    "abstract": "arXiv:2403.04782v1 Announce Type: cross  Abstract: Knowledge graphs have garnered significant research attention and are widely used to enhance downstream applications. However, most current studies mainly focus on static knowledge graphs, whose facts do not change with time, and disregard their dynamic evolution over time. As a result, temporal knowledge graphs have attracted more attention because a large amount of structured knowledge exists only within a specific period. Knowledge graph representation learning aims to learn low-dimensional vector embeddings for entities and relations in a knowledge graph. The representation learning of temporal knowledge graphs incorporates time information into the standard knowledge graph framework and can model the dynamics of entities and relations over time. In this paper, we conduct a comprehensive survey of temporal knowledge graph representation learning and its applications. We begin with an introduction to the definitions, datasets, and e",
    "link": "https://arxiv.org/abs/2403.04782",
    "context": "Title: A Survey on Temporal Knowledge Graph: Representation Learning and Applications\nAbstract: arXiv:2403.04782v1 Announce Type: cross  Abstract: Knowledge graphs have garnered significant research attention and are widely used to enhance downstream applications. However, most current studies mainly focus on static knowledge graphs, whose facts do not change with time, and disregard their dynamic evolution over time. As a result, temporal knowledge graphs have attracted more attention because a large amount of structured knowledge exists only within a specific period. Knowledge graph representation learning aims to learn low-dimensional vector embeddings for entities and relations in a knowledge graph. The representation learning of temporal knowledge graphs incorporates time information into the standard knowledge graph framework and can model the dynamics of entities and relations over time. In this paper, we conduct a comprehensive survey of temporal knowledge graph representation learning and its applications. We begin with an introduction to the definitions, datasets, and e",
    "path": "papers/24/03/2403.04782.json",
    "total_tokens": 755,
    "translated_title": "一项关于时间知识图的调查：表示学习与应用",
    "translated_abstract": "知识图引起了重要的研究关注，并被广泛用于增强下游应用。然而，大多数当前研究主要集中在静态知识图上，其事实不随时间而变化，并忽略了它们随时间的动态演变。因此，时间知识图受到更多关注，因为大量结构化知识仅存在于特定时期内。知识图表示学习旨在为知识图中的实体和关系学习低维向量嵌入。时态知识图的表示学习将时间信息融入标准知识图框架中，可以对实体和关系随时间的动态变化进行建模。本文对时态知识图表示学习及其应用进行了全面调查。我们从介绍定义、数据集和e",
    "tldr": "时间知识图表示学习将时间信息融入标准知识图框架，可以对实体和关系随时间的动态变化进行建模。",
    "en_tdlr": "Temporal knowledge graph representation learning incorporates time information into the standard knowledge graph framework to model the dynamics of entities and relations over time."
}