{
    "title": "Manifold Regularization Classification Model Based On Improved Diffusion Map",
    "abstract": "arXiv:2403.16059v1 Announce Type: cross  Abstract: Manifold regularization model is a semi-supervised learning model that leverages the geometric structure of a dataset, comprising a small number of labeled samples and a large number of unlabeled samples, to generate classifiers. However, the original manifold norm limits the performance of models to local regions. To address this limitation, this paper proposes an approach to improve manifold regularization based on a label propagation model. We initially enhance the probability transition matrix of the diffusion map algorithm, which can be used to estimate the Neumann heat kernel, enabling it to accurately depict the label propagation process on the manifold. Using this matrix, we establish a label propagation function on the dataset to describe the distribution of labels at different time steps. Subsequently, we extend the label propagation function to the entire data manifold. We prove that the extended label propagation function c",
    "link": "https://arxiv.org/abs/2403.16059",
    "context": "Title: Manifold Regularization Classification Model Based On Improved Diffusion Map\nAbstract: arXiv:2403.16059v1 Announce Type: cross  Abstract: Manifold regularization model is a semi-supervised learning model that leverages the geometric structure of a dataset, comprising a small number of labeled samples and a large number of unlabeled samples, to generate classifiers. However, the original manifold norm limits the performance of models to local regions. To address this limitation, this paper proposes an approach to improve manifold regularization based on a label propagation model. We initially enhance the probability transition matrix of the diffusion map algorithm, which can be used to estimate the Neumann heat kernel, enabling it to accurately depict the label propagation process on the manifold. Using this matrix, we establish a label propagation function on the dataset to describe the distribution of labels at different time steps. Subsequently, we extend the label propagation function to the entire data manifold. We prove that the extended label propagation function c",
    "path": "papers/24/03/2403.16059.json",
    "total_tokens": 800,
    "translated_title": "基于改进的扩散映射的流形正则化分类模型",
    "translated_abstract": "流形正则化模型是一种半监督学习模型，利用数据集的几何结构，包括少量有标签样本和大量无标签样本，生成分类器。然而，原始的流形范数限制了模型性能只局限于局部区域。为了克服这一局限，本文提出了一种改进流形正则化的方法，基于标签传播模型。我们首先增强扩散映射算法的概率转移矩阵，可用于估计Neumann热核，使其能够准确描述流形上的标签传播过程。利用该矩阵，在数据集上建立一个描述不同时间步骤下标签分布的标签传播函数。随后，我们将标签传播函数扩展到整个数据流形。我们证明了扩展的标签传播函数c",
    "tldr": "本文提出了基于改进扩散映射的流形正则化分类模型，通过改进标签传播模型，有效克服了原始流形正则化模型在局部区域性能上的限制。",
    "en_tdlr": "This paper proposes a manifold regularization classification model based on improved diffusion map, effectively overcoming the limitation of the original model to local regions by enhancing the label propagation model."
}