{
    "title": "Artificial Intelligence Exploring the Patent Field",
    "abstract": "arXiv:2403.04105v1 Announce Type: new  Abstract: Advanced language-processing and machine-learning techniques promise massive efficiency improvements in the previously widely manual field of patent and technical knowledge management. This field presents large-scale and complex data with very precise contents and language representation of those contents. Particularly, patent texts can differ from mundane texts in various aspects, which entails significant opportunities and challenges. This paper presents a systematic overview of patent-related tasks and popular methodologies with a special focus on evolving and promising techniques. Language processing and particularly large language models as well as the recent boost of general generative methods promise to become game changers in the patent field. The patent literature and the fact-based argumentative procedures around patents appear almost as an ideal use case. However, patents entail a number of difficulties with which existing mod",
    "link": "https://arxiv.org/abs/2403.04105",
    "context": "Title: Artificial Intelligence Exploring the Patent Field\nAbstract: arXiv:2403.04105v1 Announce Type: new  Abstract: Advanced language-processing and machine-learning techniques promise massive efficiency improvements in the previously widely manual field of patent and technical knowledge management. This field presents large-scale and complex data with very precise contents and language representation of those contents. Particularly, patent texts can differ from mundane texts in various aspects, which entails significant opportunities and challenges. This paper presents a systematic overview of patent-related tasks and popular methodologies with a special focus on evolving and promising techniques. Language processing and particularly large language models as well as the recent boost of general generative methods promise to become game changers in the patent field. The patent literature and the fact-based argumentative procedures around patents appear almost as an ideal use case. However, patents entail a number of difficulties with which existing mod",
    "path": "papers/24/03/2403.04105.json",
    "total_tokens": 845,
    "translated_title": "人工智能探索专利领域",
    "translated_abstract": "arXiv:2403.04105v1 公告类型：新的 摘要：先进的语言处理和机器学习技术承诺在以前广泛依赖手工操作的专利和技术知识管理领域带来巨大的效率改进。这个领域展示了大规模而复杂的数据，具有非常准确的内容和语言表达这些内容。特别是，专利文本在各个方面可能与平凡的文本有所不同，这带来了重大的机遇和挑战。本文系统概述了与专利有关的任务和流行的方法，特别关注不断演变和有前途的技术。语言处理，尤其是大型语言模型以及最近推动普通生成方法的提升，有望成为专利领域的变革者。专利文献以及围绕专利的基于事实的论证程序似乎几乎是一个理想的使用案例。然而，专利涉及许多现有模型很难处理的困难。",
    "tldr": "本文系统概述了专利领域的任务和方法，强调了语言处理和大型语言模型的重要性，并探讨了近期出现的通用生成方法在专利领域的潜力。",
    "en_tdlr": "This paper provides a systematic overview of tasks and methodologies in the field of patents, emphasizing the importance of language processing and large language models, while exploring the potential of recent advancements in generative methods in the patent field."
}