{
    "title": "Making Sentence Embeddings Robust to User-Generated Content",
    "abstract": "arXiv:2403.17220v1 Announce Type: new  Abstract: NLP models have been known to perform poorly on user-generated content (UGC), mainly because it presents a lot of lexical variations and deviates from the standard texts on which most of these models were trained. In this work, we focus on the robustness of LASER, a sentence embedding model, to UGC data. We evaluate this robustness by LASER's ability to represent non-standard sentences and their standard counterparts close to each other in the embedding space. Inspired by previous works extending LASER to other languages and modalities, we propose RoLASER, a robust English encoder trained using a teacher-student approach to reduce the distances between the representations of standard and UGC sentences. We show that with training only on standard and synthetic UGC-like data, RoLASER significantly improves LASER's robustness to both natural and artificial UGC data by achieving up to 2x and 11x better scores. We also perform a fine-grained ",
    "link": "https://arxiv.org/abs/2403.17220",
    "context": "Title: Making Sentence Embeddings Robust to User-Generated Content\nAbstract: arXiv:2403.17220v1 Announce Type: new  Abstract: NLP models have been known to perform poorly on user-generated content (UGC), mainly because it presents a lot of lexical variations and deviates from the standard texts on which most of these models were trained. In this work, we focus on the robustness of LASER, a sentence embedding model, to UGC data. We evaluate this robustness by LASER's ability to represent non-standard sentences and their standard counterparts close to each other in the embedding space. Inspired by previous works extending LASER to other languages and modalities, we propose RoLASER, a robust English encoder trained using a teacher-student approach to reduce the distances between the representations of standard and UGC sentences. We show that with training only on standard and synthetic UGC-like data, RoLASER significantly improves LASER's robustness to both natural and artificial UGC data by achieving up to 2x and 11x better scores. We also perform a fine-grained ",
    "path": "papers/24/03/2403.17220.json",
    "total_tokens": 903,
    "translated_title": "使句子嵌入对用户生成内容具有鲁棒性",
    "translated_abstract": "自然语言处理模型在用户生成内容（UGC）上表现不佳，主要是因为它呈现了大量词汇变化，并偏离了大多数这些模型训练的标准文本。本文关注LASER句子嵌入模型对UGC数据的鲁棒性。我们通过LASER在嵌入空间中表示非标准句子及其标准对应句子的能力来评估这种鲁棒性。受先前扩展LASER到其他语言和形式的工作的启发，我们提出RoLASER，一个使用师生方法进行训练的鲁棒英文编码器，以减少标准句子和UGC句子表示之间的距离。我们表明，仅通过在标准和合成UGC样本数据上进行训练，RoLASER可以显著提高LASER对自然和人工UGC数据的鲁棒性，最多可以实现2倍和11倍的改进分数。我们还进行了细粒度研究",
    "tldr": "RoLASER是一个通过师生方法训练的鲁棒英文编码器，通过减少标准句子和UGC句子在嵌入空间中的距离，显著提高了LASER对自然和人工UGC数据的鲁棒性。",
    "en_tdlr": "RoLASER is a robust English encoder trained using a teacher-student approach, which significantly improves LASER's robustness to both natural and artificial UGC data by reducing the distances between standard and UGC sentences in the embedding space."
}