{
    "title": "Dissecting Sample Hardness: A Fine-Grained Analysis of Hardness Characterization Methods for Data-Centric AI",
    "abstract": "arXiv:2403.04551v1 Announce Type: new  Abstract: Characterizing samples that are difficult to learn from is crucial to developing highly performant ML models. This has led to numerous Hardness Characterization Methods (HCMs) that aim to identify \"hard\" samples. However, there is a lack of consensus regarding the definition and evaluation of \"hardness\". Unfortunately, current HCMs have only been evaluated on specific types of hardness and often only qualitatively or with respect to downstream performance, overlooking the fundamental quantitative identification task. We address this gap by presenting a fine-grained taxonomy of hardness types. Additionally, we propose the Hardness Characterization Analysis Toolkit (H-CAT), which supports comprehensive and quantitative benchmarking of HCMs across the hardness taxonomy and can easily be extended to new HCMs, hardness types, and datasets. We use H-CAT to evaluate 13 different HCMs across 8 hardness types. This comprehensive evaluation encomp",
    "link": "https://arxiv.org/abs/2403.04551",
    "context": "Title: Dissecting Sample Hardness: A Fine-Grained Analysis of Hardness Characterization Methods for Data-Centric AI\nAbstract: arXiv:2403.04551v1 Announce Type: new  Abstract: Characterizing samples that are difficult to learn from is crucial to developing highly performant ML models. This has led to numerous Hardness Characterization Methods (HCMs) that aim to identify \"hard\" samples. However, there is a lack of consensus regarding the definition and evaluation of \"hardness\". Unfortunately, current HCMs have only been evaluated on specific types of hardness and often only qualitatively or with respect to downstream performance, overlooking the fundamental quantitative identification task. We address this gap by presenting a fine-grained taxonomy of hardness types. Additionally, we propose the Hardness Characterization Analysis Toolkit (H-CAT), which supports comprehensive and quantitative benchmarking of HCMs across the hardness taxonomy and can easily be extended to new HCMs, hardness types, and datasets. We use H-CAT to evaluate 13 different HCMs across 8 hardness types. This comprehensive evaluation encomp",
    "path": "papers/24/03/2403.04551.json",
    "total_tokens": 921,
    "translated_title": "细究样本难度: 针对数据中心人工智能的难度表征方法的精细分析",
    "translated_abstract": "对于难以学习的样本进行表征对于开发高性能机器学习模型至关重要。这导致了许多旨在识别“难”样本的难度表征方法（HCMs）。然而，关于“难度”的定义和评估缺乏共识。不幸的是，当前的HCMs仅在特定类型的难度上进行评估，通常仅在质量或下游性能方面定性地评估，忽视了基本的定量识别任务。我们通过提出一个细粒度的难度类型分类来解决这一问题。此外，我们提出了难度表征分析工具包（H-CAT），支持对难度分类下的HCMs进行全面和定量的基准评估，并可以轻松扩展到新的HCMs、难度类型和数据集。我们使用H-CAT来评估8种难度类型中的13种不同HCMs。",
    "tldr": "该论文提出了一个细致的难度类型分类系统，并引入了难度表征分析工具包（H-CAT），支持全面和定量评估不同难度类型下的HCMs，从而填补了当前对“难度”定义和评估的定量识别任务的空白。",
    "en_tdlr": "This paper introduces a fine-grained taxonomy of hardness types and proposes the Hardness Characterization Analysis Toolkit (H-CAT) to support comprehensive and quantitative benchmarking of different HCMs across various hardness types, addressing the lack of consensus in defining and evaluating \"hardness\" with quantitative identification tasks."
}