{
    "title": "Fair Distributed Cooperative Bandit Learning on Networks for Intelligent Internet of Things Systems (Technical Report)",
    "abstract": "arXiv:2403.11603v1 Announce Type: cross  Abstract: In intelligent Internet of Things (IoT) systems, edge servers within a network exchange information with their neighbors and collect data from sensors to complete delivered tasks. In this paper, we propose a multiplayer multi-armed bandit model for intelligent IoT systems to facilitate data collection and incorporate fairness considerations. In our model, we establish an effective communication protocol that helps servers cooperate with their neighbors. Then we design a distributed cooperative bandit algorithm, DC-ULCB, enabling servers to collaboratively select sensors to maximize data rates while maintaining fairness in their choices. We conduct an analysis of the reward regret and fairness regret of DC-ULCB, and prove that both regrets have logarithmic instance-dependent upper bounds. Additionally, through extensive simulations, we validate that DC-ULCB outperforms existing algorithms in maximizing reward and ensuring fairness.",
    "link": "https://arxiv.org/abs/2403.11603",
    "context": "Title: Fair Distributed Cooperative Bandit Learning on Networks for Intelligent Internet of Things Systems (Technical Report)\nAbstract: arXiv:2403.11603v1 Announce Type: cross  Abstract: In intelligent Internet of Things (IoT) systems, edge servers within a network exchange information with their neighbors and collect data from sensors to complete delivered tasks. In this paper, we propose a multiplayer multi-armed bandit model for intelligent IoT systems to facilitate data collection and incorporate fairness considerations. In our model, we establish an effective communication protocol that helps servers cooperate with their neighbors. Then we design a distributed cooperative bandit algorithm, DC-ULCB, enabling servers to collaboratively select sensors to maximize data rates while maintaining fairness in their choices. We conduct an analysis of the reward regret and fairness regret of DC-ULCB, and prove that both regrets have logarithmic instance-dependent upper bounds. Additionally, through extensive simulations, we validate that DC-ULCB outperforms existing algorithms in maximizing reward and ensuring fairness.",
    "path": "papers/24/03/2403.11603.json",
    "total_tokens": 895,
    "translated_title": "在智能物联网系统中针对网络的公平分布式合作赌博学习（技术报告）",
    "translated_abstract": "在智能物联网（IoT）系统中，网络内的边缘服务器与其邻居交换信息并从传感器收集数据以完成交付的任务。本文提出了一个多人多臂老虎机模型，旨在为智能IoT系统的数据收集提供便利，并纳入公平考虑。在我们的模型中，我们建立了一个有效的通信协议，帮助服务器与其邻居合作。然后我们设计了一个分布式合作赌博算法，DC-ULCB，使服务器能够协作选择传感器，以最大化数据速率同时保持选择的公平性。我们对DC-ULCB的奖励遗憾和公平遗憾进行了分析，并证明两种遗憾均具有对数实例相关的上界。此外，通过大量的模拟实验，我们验证了DC-ULCB在最大化奖励和确保公平性方面优于现有算法。",
    "tldr": "本文提出了针对智能物联网系统的多人合作多臂老虎机模型，设计了分布式合作赌博算法DC-ULCB，能够在最大化数据速率的同时保持选择的公平性，通过分析和验证，证明在奖励和公平性方面优于现有算法。",
    "en_tdlr": "This paper proposes a multiplayer multi-armed bandit model for intelligent IoT systems, designs a distributed cooperative bandit algorithm, DC-ULCB, which can maximize data rates while maintaining fairness in selection. Through analysis and validation, it is proven to outperform existing algorithms in terms of reward and fairness."
}