{
    "title": "GTAGCN: Generalized Topology Adaptive Graph Convolutional Networks",
    "abstract": "arXiv:2403.15077v1 Announce Type: new  Abstract: Graph Neural Networks (GNN) have emerged as a popular and standard approach for learning from graph-structured data. The literature on GNN highlights the potential of this evolving research area and its widespread adoption in real-life applications. However, most of the approaches are either new in concept or derived from specific techniques. Therefore, the potential of more than one approach in hybrid form has not been studied extensively, which can be well utilized for sequenced data or static data together. We derive a hybrid approach based on two established techniques as generalized aggregation networks and topology adaptive graph convolution networks that solve our purpose to apply on both types of sequenced and static nature of data, effectively. The proposed method applies to both node and graph classification. Our empirical analysis reveals that the results are at par with literature results and better for handwritten strokes as",
    "link": "https://arxiv.org/abs/2403.15077",
    "context": "Title: GTAGCN: Generalized Topology Adaptive Graph Convolutional Networks\nAbstract: arXiv:2403.15077v1 Announce Type: new  Abstract: Graph Neural Networks (GNN) have emerged as a popular and standard approach for learning from graph-structured data. The literature on GNN highlights the potential of this evolving research area and its widespread adoption in real-life applications. However, most of the approaches are either new in concept or derived from specific techniques. Therefore, the potential of more than one approach in hybrid form has not been studied extensively, which can be well utilized for sequenced data or static data together. We derive a hybrid approach based on two established techniques as generalized aggregation networks and topology adaptive graph convolution networks that solve our purpose to apply on both types of sequenced and static nature of data, effectively. The proposed method applies to both node and graph classification. Our empirical analysis reveals that the results are at par with literature results and better for handwritten strokes as",
    "path": "papers/24/03/2403.15077.json",
    "total_tokens": 861,
    "translated_title": "GTAGCN：广义拓扑自适应图卷积网络",
    "translated_abstract": "arXiv:2403.15077v1 公告类型：新摘要：图神经网络（GNN）已经成为学习图结构数据的常用和标准方法。 GNN的文献强调了这一不断发展的研究领域的潜力以及它在现实应用中的广泛应用。然而，大多数方法要么是概念上新颖的，要么是从特定技术派生出来的。因此，混合形式的多种方法的潜力尚未得到广泛研究，这可以很好地用于序列数据或静态数据。我们提出了一种基于两种成熟技术的混合方法，即广义聚合网络和拓扑自适应图卷积网络，这解决了我们在效果上可以应用于序列型和静态型数据的目的。所提出的方法适用于节点和图分类。我们的实证分析显示，结果与文献结果相当，并且对手写笔画更好。",
    "tldr": "GTAGCN提出了一种基于广义聚合网络和拓扑自适应图卷积网络的混合方法，可以有效应用于序列数据和静态数据，适用于节点和图分类，实证分析显示结果良好。",
    "en_tdlr": "GTAGCN proposes a hybrid approach based on generalized aggregation networks and topology adaptive graph convolution networks, which can effectively handle sequenced and static data for both node and graph classification, with empirical analysis showing promising results."
}