{
    "title": "Co-Occurring of Object Detection and Identification towards unlabeled object discovery",
    "abstract": "arXiv:2403.17223v1 Announce Type: cross  Abstract: In this paper, we propose a novel deep learning based approach for identifying co-occurring objects in conjunction with base objects in multilabel object categories. Nowadays, with the advancement in computer vision based techniques we need to know about co-occurring objects with respect to base object for various purposes. The pipeline of the proposed work is composed of two stages: in the first stage of the proposed model we detect all the bounding boxes present in the image and their corresponding labels, then in the second stage we perform co-occurrence matrix analysis. In co-occurrence matrix analysis, we set base classes based on the maximum occurrences of the labels and build association rules and generate frequent patterns. These frequent patterns will show base classes and their corresponding co-occurring classes. We performed our experiments on two publicly available datasets: Pascal VOC and MS-COCO. The experimental results ",
    "link": "https://arxiv.org/abs/2403.17223",
    "context": "Title: Co-Occurring of Object Detection and Identification towards unlabeled object discovery\nAbstract: arXiv:2403.17223v1 Announce Type: cross  Abstract: In this paper, we propose a novel deep learning based approach for identifying co-occurring objects in conjunction with base objects in multilabel object categories. Nowadays, with the advancement in computer vision based techniques we need to know about co-occurring objects with respect to base object for various purposes. The pipeline of the proposed work is composed of two stages: in the first stage of the proposed model we detect all the bounding boxes present in the image and their corresponding labels, then in the second stage we perform co-occurrence matrix analysis. In co-occurrence matrix analysis, we set base classes based on the maximum occurrences of the labels and build association rules and generate frequent patterns. These frequent patterns will show base classes and their corresponding co-occurring classes. We performed our experiments on two publicly available datasets: Pascal VOC and MS-COCO. The experimental results ",
    "path": "papers/24/03/2403.17223.json",
    "total_tokens": 790,
    "translated_title": "物体检测和识别的共存，以及未标记物体发现",
    "translated_abstract": "在本文中，我们提出了一种基于深度学习的新方法，用于识别多标签物体类别中与基础物体共存的物体。我们的工作流程由两个阶段组成：在提出模型的第一阶段中，我们检测图像中的所有边界框及其对应的标签，然后在第二阶段进行共存矩阵分析。在共存矩阵分析中，我们基于标签的最大出现次数设定基本类，并构建关联规则并生成频繁模式。这些频繁模式将显示基本类及其对应的共存类。我们在两个公开数据集上进行了实验：Pascal VOC和MS-COCO。实验结果显示我们的方法的有效性。",
    "tldr": "通过提出的深度学习方法，可以识别多标签物体类别中基础物体的共存物体，并通过共存矩阵分析生成频繁模式，从而实现未标记物体的发现。"
}