{
    "title": "DeepCSHAP: Utilizing Shapley Values to Explain Deep Complex-Valued Neural Networks",
    "abstract": "arXiv:2403.08428v1 Announce Type: new  Abstract: Deep Neural Networks are widely used in academy as well as corporate and public applications, including safety critical applications such as health care and autonomous driving. The ability to explain their output is critical for safety reasons as well as acceptance among applicants. A multitude of methods have been proposed to explain real-valued neural networks. Recently, complex-valued neural networks have emerged as a new class of neural networks dealing with complex-valued input data without the necessity of projecting them onto $\\mathbb{R}^2$. This brings up the need to develop explanation algorithms for this kind of neural networks. In this paper we provide these developments. While we focus on adapting the widely used DeepSHAP algorithm to the complex domain, we also present versions of four gradient based explanation methods suitable for use in complex-valued neural networks. We evaluate the explanation quality of all presented a",
    "link": "https://arxiv.org/abs/2403.08428",
    "context": "Title: DeepCSHAP: Utilizing Shapley Values to Explain Deep Complex-Valued Neural Networks\nAbstract: arXiv:2403.08428v1 Announce Type: new  Abstract: Deep Neural Networks are widely used in academy as well as corporate and public applications, including safety critical applications such as health care and autonomous driving. The ability to explain their output is critical for safety reasons as well as acceptance among applicants. A multitude of methods have been proposed to explain real-valued neural networks. Recently, complex-valued neural networks have emerged as a new class of neural networks dealing with complex-valued input data without the necessity of projecting them onto $\\mathbb{R}^2$. This brings up the need to develop explanation algorithms for this kind of neural networks. In this paper we provide these developments. While we focus on adapting the widely used DeepSHAP algorithm to the complex domain, we also present versions of four gradient based explanation methods suitable for use in complex-valued neural networks. We evaluate the explanation quality of all presented a",
    "path": "papers/24/03/2403.08428.json",
    "total_tokens": 845,
    "translated_title": "DeepCSHAP: 利用Shapley Values解释深度复数神经网络",
    "translated_abstract": "arXiv:2403.08428v1 公告类型：新 摘要：深度神经网络广泛应用于学术界以及企业和公共应用程序，包括诸如医疗保健和自动驾驶等安全关键应用。解释其输出的能力对于安全原因以及申请者的接受至关重要。已经提出了大量方法来解释实数神经网络。最近，复数神经网络作为一种新的神经网络类别出现，处理复数输入数据而无需将其投影到$\\mathbb{R}^2$。这带来了为这种神经网络开发解释算法的需求。在本文中，我们提供了这些发展。虽然我们专注于将广泛应用的DeepSHAP算法调整到复数域，但我们还提供了适用于复数神经网络的四种基于梯度的解释方法的版本。我们评估了所有提出的解释方法的解释质量。",
    "tldr": "本文提出了DeepCSHAP算法，通过利用Shapley Values解释复数神经网络的输出，填补了对于这种类型神经网络的解释算法的空白。",
    "en_tdlr": "This paper introduces the DeepCSHAP algorithm, which utilizes Shapley Values to explain the output of complex-valued neural networks, addressing the gap in explanation algorithms for this type of neural networks."
}