{
    "title": "Task2Morph: Differentiable Task-inspired Framework for Contact-Aware Robot Design",
    "abstract": "arXiv:2403.19093v1 Announce Type: cross  Abstract: Optimizing the morphologies and the controllers that adapt to various tasks is a critical issue in the field of robot design, aka. embodied intelligence. Previous works typically model it as a joint optimization problem and use search-based methods to find the optimal solution in the morphology space. However, they ignore the implicit knowledge of task-to-morphology mapping which can directly inspire robot design. For example, flipping heavier boxes tends to require more muscular robot arms. This paper proposes a novel and general differentiable task-inspired framework for contact-aware robot design called Task2Morph. We abstract task features highly related to task performance and use them to build a task-to-morphology mapping. Further, we embed the mapping into a differentiable robot design process, where the gradient information is leveraged for both the mapping learning and the whole optimization. The experiments are conducted on t",
    "link": "https://arxiv.org/abs/2403.19093",
    "context": "Title: Task2Morph: Differentiable Task-inspired Framework for Contact-Aware Robot Design\nAbstract: arXiv:2403.19093v1 Announce Type: cross  Abstract: Optimizing the morphologies and the controllers that adapt to various tasks is a critical issue in the field of robot design, aka. embodied intelligence. Previous works typically model it as a joint optimization problem and use search-based methods to find the optimal solution in the morphology space. However, they ignore the implicit knowledge of task-to-morphology mapping which can directly inspire robot design. For example, flipping heavier boxes tends to require more muscular robot arms. This paper proposes a novel and general differentiable task-inspired framework for contact-aware robot design called Task2Morph. We abstract task features highly related to task performance and use them to build a task-to-morphology mapping. Further, we embed the mapping into a differentiable robot design process, where the gradient information is leveraged for both the mapping learning and the whole optimization. The experiments are conducted on t",
    "path": "papers/24/03/2403.19093.json",
    "total_tokens": 764,
    "translated_title": "Task2Morph：可微分的基于任务启发的接触感知机器人设计框架",
    "translated_abstract": "优化适应各种任务的机器人形态和控制器是机器人设计领域中的关键问题，又称为具身智能。本文提出了一种新颖且通用的可微分任务启发式接触感知机器人设计框架Task2Morph。我们将与任务性能高度相关的任务特征抽象出来，用于构建任务到形态的映射。此外，我们将映射嵌入到一个可微分的机器人设计过程中，其中梯度信息被用于映射学习以及整体优化。实验在某一数据集上进行。",
    "tldr": "该论文提出了一个新颖的可微分的基于任务启发的接触感知机器人设计框架Task2Morph，通过将任务特征抽象到任务到形态的映射中，实现整体优化和映射学习。",
    "en_tdlr": "This paper introduces a novel differentiable task-inspired framework for contact-aware robot design called Task2Morph, which abstracts task features into a task-to-morphology mapping for optimization and learning."
}