{
    "title": "NaijaHate: Evaluating Hate Speech Detection on Nigerian Twitter Using Representative Data",
    "abstract": "arXiv:2403.19260v1 Announce Type: new  Abstract: To address the global issue of hateful content proliferating in online platforms, hate speech detection (HSD) models are typically developed on datasets collected in the United States, thereby failing to generalize to English dialects from the Majority World. Furthermore, HSD models are often evaluated on curated samples, raising concerns about overestimating model performance in real-world settings. In this work, we introduce NaijaHate, the first dataset annotated for HSD which contains a representative sample of Nigerian tweets. We demonstrate that HSD evaluated on biased datasets traditionally used in the literature largely overestimates real-world performance on representative data. We also propose NaijaXLM-T, a pretrained model tailored to the Nigerian Twitter context, and establish the key role played by domain-adaptive pretraining and finetuning in maximizing HSD performance. Finally, we show that in this context, a human-in-the-l",
    "link": "https://arxiv.org/abs/2403.19260",
    "context": "Title: NaijaHate: Evaluating Hate Speech Detection on Nigerian Twitter Using Representative Data\nAbstract: arXiv:2403.19260v1 Announce Type: new  Abstract: To address the global issue of hateful content proliferating in online platforms, hate speech detection (HSD) models are typically developed on datasets collected in the United States, thereby failing to generalize to English dialects from the Majority World. Furthermore, HSD models are often evaluated on curated samples, raising concerns about overestimating model performance in real-world settings. In this work, we introduce NaijaHate, the first dataset annotated for HSD which contains a representative sample of Nigerian tweets. We demonstrate that HSD evaluated on biased datasets traditionally used in the literature largely overestimates real-world performance on representative data. We also propose NaijaXLM-T, a pretrained model tailored to the Nigerian Twitter context, and establish the key role played by domain-adaptive pretraining and finetuning in maximizing HSD performance. Finally, we show that in this context, a human-in-the-l",
    "path": "papers/24/03/2403.19260.json",
    "total_tokens": 966,
    "translated_title": "NaijaHate: 使用代表性数据评估尼日利亚 Twitter 上的仇恨言论检测",
    "translated_abstract": "为了解决在线平台上恶意内容蔓延的全球问题，通常会在美国收集的数据集上开发仇恨言论检测（HSD）模型，从而无法推广到来自大多数世界的英语方言。此外，HSD模型通常在策划样本上进行评估，这引发了对在真实环境中高估模型性能的担忧。在这项工作中，我们引入了第一个用于HSD标注的 NaijaHate 数据集，其中包含尼日利亚推文的代表性样本。我们证明，HSD在传统文献中传统使用的有偏见数据集上评估，在代表性数据上很大程度上高估了真实世界的性能。我们还提出了 NaijaXLM-T，一个针对尼日利亚 Twitter 上下文量身定制的预训练模型，并建立了域自适应预训练和微调在最大化HSD性能方面的关键作用。最后，我们表明，在这种情况下，人-机混合方法发挥了关键作用。",
    "tldr": "首次引入 NaijaHate 数据集，在尼日利亚推特上评估 HSD，发现在代表性数据上评估的 HSD 性能高估了真实世界的表现，提出 NaijaXLM-T 模型，突出了域自适应预训练和微调在最大化 HSD 性能中的关键作用"
}