{
    "title": "On Cyclical MCMC Sampling",
    "abstract": "arXiv:2403.00230v1 Announce Type: cross  Abstract: Cyclical MCMC is a novel MCMC framework recently proposed by Zhang et al. (2019) to address the challenge posed by high-dimensional multimodal posterior distributions like those arising in deep learning. The algorithm works by generating a nonhomogeneous Markov chain that tracks -- cyclically in time -- tempered versions of the target distribution. We show in this work that cyclical MCMC converges to the desired probability distribution in settings where the Markov kernels used are fast mixing, and sufficiently long cycles are employed. However in the far more common settings of slow mixing kernels, the algorithm may fail to produce samples from the desired distribution. In particular, in a simple mixture example with unequal variance, we show by simulation that cyclical MCMC fails to converge to the desired limit. Finally, we show that cyclical MCMC typically estimates well the local shape of the target distribution around each mode, ",
    "link": "https://arxiv.org/abs/2403.00230",
    "context": "Title: On Cyclical MCMC Sampling\nAbstract: arXiv:2403.00230v1 Announce Type: cross  Abstract: Cyclical MCMC is a novel MCMC framework recently proposed by Zhang et al. (2019) to address the challenge posed by high-dimensional multimodal posterior distributions like those arising in deep learning. The algorithm works by generating a nonhomogeneous Markov chain that tracks -- cyclically in time -- tempered versions of the target distribution. We show in this work that cyclical MCMC converges to the desired probability distribution in settings where the Markov kernels used are fast mixing, and sufficiently long cycles are employed. However in the far more common settings of slow mixing kernels, the algorithm may fail to produce samples from the desired distribution. In particular, in a simple mixture example with unequal variance, we show by simulation that cyclical MCMC fails to converge to the desired limit. Finally, we show that cyclical MCMC typically estimates well the local shape of the target distribution around each mode, ",
    "path": "papers/24/03/2403.00230.json",
    "total_tokens": 857,
    "translated_title": "关于循环MCMC采样",
    "translated_abstract": "循环MCMC是张等人(2019年)最近提出的一种新的MCMC框架，旨在解决深度学习中出现的高维多模后验分布所带来的挑战。该算法通过生成一个非齐次马尔可夫链，以时间周期性地跟踪目标分布的温和版本来工作。我们在这项工作中展示了，在使用快混合的马尔可夫核和足够长的周期的设置下，循环MCMC会收敛到期望的概率分布。然而，在较常见的慢混合核设置下，该算法可能无法产生来自期望分布的样本。特别地，在一个具有不同方差的简单混合示例中，我们通过模拟显示循环MCMC无法收敛到期望极限。最后，我们展示了循环MCMC通常很好地估计了每个模式周围目标分布的局部形状。",
    "tldr": "循环MCMC是一种新的MCMC框架，可以很好地估计目标分布的局部形状，但在慢混合核的情况下可能无法产生来自期望分布的样本。",
    "en_tdlr": "Cyclical MCMC is a novel MCMC framework that can estimate the local shape of the target distribution well, but may fail to produce samples from the desired distribution in the case of slow mixing kernels."
}