{
    "title": "ARO: Large Language Model Supervised Robotics Text2Skill Autonomous Learning",
    "abstract": "arXiv:2403.15834v1 Announce Type: cross  Abstract: Robotics learning highly relies on human expertise and efforts, such as demonstrations, design of reward functions in reinforcement learning, performance evaluation using human feedback, etc. However, reliance on human assistance can lead to expensive learning costs and make skill learning difficult to scale. In this work, we introduce the Large Language Model Supervised Robotics Text2Skill Autonomous Learning (ARO) framework, which aims to replace human participation in the robot skill learning process with large-scale language models that incorporate reward function design and performance evaluation. We provide evidence that our approach enables fully autonomous robot skill learning, capable of completing partial tasks without human intervention. Furthermore, we also analyze the limitations of this approach in task understanding and optimization stability.",
    "link": "https://arxiv.org/abs/2403.15834",
    "context": "Title: ARO: Large Language Model Supervised Robotics Text2Skill Autonomous Learning\nAbstract: arXiv:2403.15834v1 Announce Type: cross  Abstract: Robotics learning highly relies on human expertise and efforts, such as demonstrations, design of reward functions in reinforcement learning, performance evaluation using human feedback, etc. However, reliance on human assistance can lead to expensive learning costs and make skill learning difficult to scale. In this work, we introduce the Large Language Model Supervised Robotics Text2Skill Autonomous Learning (ARO) framework, which aims to replace human participation in the robot skill learning process with large-scale language models that incorporate reward function design and performance evaluation. We provide evidence that our approach enables fully autonomous robot skill learning, capable of completing partial tasks without human intervention. Furthermore, we also analyze the limitations of this approach in task understanding and optimization stability.",
    "path": "papers/24/03/2403.15834.json",
    "total_tokens": 796,
    "translated_title": "ARO：大型语言模型监督机器人文本到技能自主学习",
    "translated_abstract": "机器人学习高度依赖于人类专业知识和努力，如演示，强化学习中奖励函数的设计，使用人类反馈进行性能评估等。然而，依赖人类协助可能导致昂贵的学习成本，并使技能学习难以扩展。在这项工作中，我们介绍了大型语言模型监督机器人文本到技能自主学习（ARO）框架，旨在用包含奖励函数设计和性能评估的大规模语言模型取代机器人技能学习过程中的人类参与。我们提供证据表明，我们的方法实现了完全自主的机器人技能学习，能够在无需人类干预的情况下完成部分任务。此外，我们还分析了该方法在任务理解和优化稳定性方面的局限性。",
    "tldr": "ARO框架旨在通过大型语言模型实现机器人技能的自主学习，使其能够在无需人类干预的情况下完成部分任务，同时还分析了该方法的局限性。",
    "en_tdlr": "The ARO framework aims to achieve autonomous robot skill learning through large language models, enabling the completion of partial tasks without human intervention, while also analyzing the limitations of this approach."
}