{
    "title": "Rank-Dependent Predictable Forward Performance Processes",
    "abstract": "arXiv:2403.16228v1 Announce Type: new  Abstract: Predictable forward performance processes (PFPPs) are stochastic optimal control frameworks for an agent who controls a randomly evolving system but can only prescribe the system dynamics for a short period ahead. This is a common scenario in which a controlling agent frequently re-calibrates her model. We introduce a new class of PFPPs based on rank-dependent utility, generalizing existing models that are based on expected utility theory (EUT). We establish existence of rank-dependent PFPPs under a conditionally complete market and exogenous probability distortion functions which are updated periodically. We show that their construction reduces to solving an integral equation that generalizes the integral equation obtained under EUT in previous studies. We then propose a new approach for solving the integral equation via theory of Volterra equations. We illustrate our result in the special case of conditionally complete Black-Scholes mo",
    "link": "https://arxiv.org/abs/2403.16228",
    "context": "Title: Rank-Dependent Predictable Forward Performance Processes\nAbstract: arXiv:2403.16228v1 Announce Type: new  Abstract: Predictable forward performance processes (PFPPs) are stochastic optimal control frameworks for an agent who controls a randomly evolving system but can only prescribe the system dynamics for a short period ahead. This is a common scenario in which a controlling agent frequently re-calibrates her model. We introduce a new class of PFPPs based on rank-dependent utility, generalizing existing models that are based on expected utility theory (EUT). We establish existence of rank-dependent PFPPs under a conditionally complete market and exogenous probability distortion functions which are updated periodically. We show that their construction reduces to solving an integral equation that generalizes the integral equation obtained under EUT in previous studies. We then propose a new approach for solving the integral equation via theory of Volterra equations. We illustrate our result in the special case of conditionally complete Black-Scholes mo",
    "path": "papers/24/03/2403.16228.json",
    "total_tokens": 871,
    "translated_title": "依赖排名的可预测前向表现过程",
    "translated_abstract": "可预测的前向表现过程(PFPPs)是针对一个代理人的随机最优控制框架，该代理人控制一个随机演变系统，但只能事先为一个短时期内规定系统动态。这是一个常见的场景，在这种场景下，控制代理人经常重新校准她的模型。我们介绍了一类基于排名依赖效用的PFPPs，这类模型推广了现有基于期望效用理论(EUT)的模型。在条件完全市场和外生概率失真函数的条件下，我们建立了排名依赖PFPPs的存在性，这些函数会定期更新。我们证明了它们的构造归结为解决一个积分方程，该积分方程推广了以前研究中在EUT下获得的积分方程。然后，我们提出了一种通过Volterra方程理论解决积分方程的新方法。我们在条件完全的Black-Scholes模型特例中说明了我们的结果。",
    "tldr": "提出了一种基于排名依赖效用的新型可预测前向表现过程，通过解决广义的积分方程来构造这些过程，并提出了一种用Volterra方程理论解决积分方程的新方法。",
    "en_tdlr": "Introduced a new class of Predictable Forward Performance Processes (PFPPs) based on rank-dependent utility, constructing them by solving a general integral equation and proposing a novel approach for solving it using the theory of Volterra equations."
}