{
    "title": "A task of anomaly detection for a smart satellite Internet of things system",
    "abstract": "arXiv:2403.14738v1 Announce Type: new  Abstract: When the equipment is working, real-time collection of environmental sensor data for anomaly detection is one of the key links to prevent industrial process accidents and network attacks and ensure system security. However, under the environment with specific real-time requirements, the anomaly detection for environmental sensors still faces the following difficulties: (1) The complex nonlinear correlation characteristics between environmental sensor data variables lack effective expression methods, and the distribution between the data is difficult to be captured. (2) it is difficult to ensure the real-time monitoring requirements by using complex machine learning models, and the equipment cost is too high. (3) Too little sample data leads to less labeled data in supervised learning. This paper proposes an unsupervised deep learning anomaly detection system. Based on the generative adversarial network and self-attention mechanism, consi",
    "link": "https://arxiv.org/abs/2403.14738",
    "context": "Title: A task of anomaly detection for a smart satellite Internet of things system\nAbstract: arXiv:2403.14738v1 Announce Type: new  Abstract: When the equipment is working, real-time collection of environmental sensor data for anomaly detection is one of the key links to prevent industrial process accidents and network attacks and ensure system security. However, under the environment with specific real-time requirements, the anomaly detection for environmental sensors still faces the following difficulties: (1) The complex nonlinear correlation characteristics between environmental sensor data variables lack effective expression methods, and the distribution between the data is difficult to be captured. (2) it is difficult to ensure the real-time monitoring requirements by using complex machine learning models, and the equipment cost is too high. (3) Too little sample data leads to less labeled data in supervised learning. This paper proposes an unsupervised deep learning anomaly detection system. Based on the generative adversarial network and self-attention mechanism, consi",
    "path": "papers/24/03/2403.14738.json",
    "total_tokens": 747,
    "translated_title": "一种用于智能卫星物联网系统的异常检测任务",
    "translated_abstract": "当设备工作时，实时收集环境传感器数据以进行异常检测是防止工业过程事故和网络攻击、确保系统安全的关键环节之一。然而，在具有特定实时需求的环境中，环境传感器的异常检测仍然面临以下困难：（1）环境传感器数据变量之间复杂的非线性相关特性缺乏有效的表达方法，数据之间的分布难以捕捉。（2）使用复杂的机器学习模型很难确保实时监控要求，并且设备成本过高。（3）样本数据太少导致监督学习中标记数据较少。本文提出了一种无监督深度学习异常检测系统。基于生成对抗网络和自注意机制，consi",
    "tldr": "提出了一种基于生成对抗网络和自注意机制的无监督深度学习异常检测系统",
    "en_tdlr": "Proposed an unsupervised deep learning anomaly detection system based on generative adversarial network and self-attention mechanism."
}