{
    "title": "Zero-Shot Cross-Lingual Document-Level Event Causality Identification with Heterogeneous Graph Contrastive Transfer Learning",
    "abstract": "arXiv:2403.02893v1 Announce Type: cross  Abstract: Event Causality Identification (ECI) refers to detect causal relations between events in texts. However, most existing studies focus on sentence-level ECI with high-resource language, leaving more challenging document-level ECI (DECI) with low-resource languages under-explored. In this paper, we propose a Heterogeneous Graph Interaction Model with Multi-granularity Contrastive Transfer Learning (GIMC) for zero-shot cross-lingual document-level ECI. Specifically, we introduce a heterogeneous graph interaction network to model the long-distance dependencies between events that are scattered over document. Then, to improve cross-lingual transferability of causal knowledge learned from source language, we propose a multi-granularity contrastive transfer learning module to align the causal representations across languages. Extensive experiments show our framework outperforms previous state-of-the-art model by 9.4% and 8.2% of average F1 sco",
    "link": "https://arxiv.org/abs/2403.02893",
    "context": "Title: Zero-Shot Cross-Lingual Document-Level Event Causality Identification with Heterogeneous Graph Contrastive Transfer Learning\nAbstract: arXiv:2403.02893v1 Announce Type: cross  Abstract: Event Causality Identification (ECI) refers to detect causal relations between events in texts. However, most existing studies focus on sentence-level ECI with high-resource language, leaving more challenging document-level ECI (DECI) with low-resource languages under-explored. In this paper, we propose a Heterogeneous Graph Interaction Model with Multi-granularity Contrastive Transfer Learning (GIMC) for zero-shot cross-lingual document-level ECI. Specifically, we introduce a heterogeneous graph interaction network to model the long-distance dependencies between events that are scattered over document. Then, to improve cross-lingual transferability of causal knowledge learned from source language, we propose a multi-granularity contrastive transfer learning module to align the causal representations across languages. Extensive experiments show our framework outperforms previous state-of-the-art model by 9.4% and 8.2% of average F1 sco",
    "path": "papers/24/03/2403.02893.json",
    "total_tokens": 914,
    "translated_title": "使用异构图对比迁移学习实现零样本跨语言文档级事件因果识别",
    "translated_abstract": "事件因果识别（ECI）指的是在文本中检测事件之间的因果关系。然而，大多数现有研究都集中在高资源语言下的句子级ECI，而对于低资源语言下更具挑战性的文档级ECI（DECI）却尚未得到充分探索。在本文中，我们提出了一种带有多粒度对比传递学习（GIMC）的异构图交互模型，用于实现零样本跨语言文档级ECI。具体来说，我们引入了一个异构图交互网络来建模文档中分散事件之间的远距离依赖关系。然后，为了提高从源语言学习到的因果知识的跨语言可转移性，我们提出了一个多粒度对比传递学习模块，以调整跨语言间的因果表示。大量实验证明，我们的框架在平均F1得分上优于之前的最先进模型约9.4%和8.2%。",
    "tldr": "提出了一种使用异构图对比迁移学习的方法，实现了零样本跨语言文档级事件因果识别，并在实验证明在F1得分上优于之前的最先进模型。",
    "en_tdlr": "Proposed a method using heterogeneous graph contrastive transfer learning to achieve zero-shot cross-lingual document-level event causality identification, which outperformed the previous state-of-the-art model in F1 score according to extensive experiments."
}