{
    "title": "Finding the Missing Data: A BERT-inspired Approach Against Package Loss in Wireless Sensing",
    "abstract": "arXiv:2403.12400v1 Announce Type: cross  Abstract: Despite the development of various deep learning methods for Wi-Fi sensing, package loss often results in noncontinuous estimation of the Channel State Information (CSI), which negatively impacts the performance of the learning models. To overcome this challenge, we propose a deep learning model based on Bidirectional Encoder Representations from Transformers (BERT) for CSI recovery, named CSI-BERT. CSI-BERT can be trained in an self-supervised manner on the target dataset without the need for additional data. Furthermore, unlike traditional interpolation methods that focus on one subcarrier at a time, CSI-BERT captures the sequential relationships across different subcarriers. Experimental results demonstrate that CSI-BERT achieves lower error rates and faster speed compared to traditional interpolation methods, even when facing with high loss rates. Moreover, by harnessing the recovered CSI obtained from CSI-BERT, other deep learning",
    "link": "https://arxiv.org/abs/2403.12400",
    "context": "Title: Finding the Missing Data: A BERT-inspired Approach Against Package Loss in Wireless Sensing\nAbstract: arXiv:2403.12400v1 Announce Type: cross  Abstract: Despite the development of various deep learning methods for Wi-Fi sensing, package loss often results in noncontinuous estimation of the Channel State Information (CSI), which negatively impacts the performance of the learning models. To overcome this challenge, we propose a deep learning model based on Bidirectional Encoder Representations from Transformers (BERT) for CSI recovery, named CSI-BERT. CSI-BERT can be trained in an self-supervised manner on the target dataset without the need for additional data. Furthermore, unlike traditional interpolation methods that focus on one subcarrier at a time, CSI-BERT captures the sequential relationships across different subcarriers. Experimental results demonstrate that CSI-BERT achieves lower error rates and faster speed compared to traditional interpolation methods, even when facing with high loss rates. Moreover, by harnessing the recovered CSI obtained from CSI-BERT, other deep learning",
    "path": "papers/24/03/2403.12400.json",
    "total_tokens": 901,
    "translated_title": "寻找丢失的数据：一种受BERT启发的方法应对无线传感中的数据包丢失",
    "translated_abstract": "尽管已经开发了各种用于Wi-Fi传感的深度学习方法，但数据包丢失常常导致信道状态信息（CSI）的非连续估计，从而对学习模型的性能产生负面影响。为了克服这一挑战，我们提出了一种基于双向编码器表示转换器（BERT）的CSI恢复深度学习模型，称为CSI-BERT。CSI-BERT可以在目标数据集上以自监督方式进行训练，而无需额外的数据。此外，与传统的插值方法不同，传统方法通常只关注一个子载波，CSI-BERT捕捉了不同子载波之间的顺序关系。实验结果表明，与传统插值方法相比，即使面对高丢包率，CSI-BERT实现了更低的错误率和更快的速度。此外，通过利用从CSI-BERT获得的恢复的CSI，其他深度学习方法能够更好地处理无线频谱感知问题。",
    "tldr": "提出了一种基于BERT的深度学习模型CSI-BERT，可以在目标数据集上以自监督方式进行训练，捕捉不同子载波之间的顺序关系，从而实现更低的错误率和更快的速度，即使面对高丢包率。"
}