{
    "title": "A Comparative Investigation of Compositional Syntax and Semantics in DALL-E 2",
    "abstract": "arXiv:2403.12294v1 Announce Type: new  Abstract: In this study we compared how well DALL-E 2 visually represented the meaning of linguistic prompts also given to young children in comprehension tests. Sentences representing fundamental components of grammatical knowledge were selected from assessment tests used with several hundred English-speaking children aged 2-7 years for whom we had collected original item-level data. DALL-E 2 was given these prompts five times to generate 20 cartoons per item, for 9 adult judges to score. Results revealed no conditions in which DALL-E 2-generated images that matched the semantic accuracy of children, even at the youngest age (2 years). DALL-E 2 failed to assign the appropriate roles in reversible forms; it failed on negation despite an easier contrastive prompt than the children received; it often assigned the adjective to the wrong noun; it ignored implicit agents in passives. This work points to a clear absence of compositional sentence represe",
    "link": "https://arxiv.org/abs/2403.12294",
    "context": "Title: A Comparative Investigation of Compositional Syntax and Semantics in DALL-E 2\nAbstract: arXiv:2403.12294v1 Announce Type: new  Abstract: In this study we compared how well DALL-E 2 visually represented the meaning of linguistic prompts also given to young children in comprehension tests. Sentences representing fundamental components of grammatical knowledge were selected from assessment tests used with several hundred English-speaking children aged 2-7 years for whom we had collected original item-level data. DALL-E 2 was given these prompts five times to generate 20 cartoons per item, for 9 adult judges to score. Results revealed no conditions in which DALL-E 2-generated images that matched the semantic accuracy of children, even at the youngest age (2 years). DALL-E 2 failed to assign the appropriate roles in reversible forms; it failed on negation despite an easier contrastive prompt than the children received; it often assigned the adjective to the wrong noun; it ignored implicit agents in passives. This work points to a clear absence of compositional sentence represe",
    "path": "papers/24/03/2403.12294.json",
    "total_tokens": 925,
    "translated_title": "DALL-E 2中组合语法和语义的比较调查",
    "translated_abstract": "在这项研究中，我们比较了DALL-E 2如何在视觉上代表给予年幼儿童进行理解测试的语言提示的含义。我们从用于数百名2-7岁英语母语儿童的评估测试中选择了代表语法知识基本组件的句子，我们收集了这些儿童的原始项目级数据。DALL-E 2被给予这些提示五次，以生成每个项目20幅卡通图片，供9名成年评委评分。结果显示，在没有一个条件下，DALL-E 2生成的图片与儿童的语义准确性相匹配，即使在最年幼的年龄（2岁）也是如此。DALL-E 2未能在可逆形式中分配适当的角色；在否定形式上失败，尽管提示比儿童接收到的对比提示更简单；它经常将形容词分配给错误的名词；它忽略了被动句中的隐含主语。这项工作指向了句子表达的组成性的明显缺失。",
    "tldr": "该研究比较了DALL-E 2在视觉上如何代表语言提示的含义，结果显示DALL-E 2未能生成与儿童语义准确性相匹配的图像，指向了句子表达的组成性的明显缺失。",
    "en_tdlr": "This study compared how well DALL-E 2 visually represented the meaning of linguistic prompts and found that DALL-E 2 failed to generate images matching the semantic accuracy of children, indicating a clear absence of compositional sentence representation."
}