{
    "title": "Density-based Isometric Mapping",
    "abstract": "arXiv:2403.02531v1 Announce Type: new  Abstract: The isometric mapping method employs the shortest path algorithm to estimate the Euclidean distance between points on High dimensional (HD) manifolds. This may not be sufficient for weakly uniformed HD data as it could lead to overestimating distances between far neighboring points, resulting in inconsistencies between the intrinsic (local) and extrinsic (global) distances during the projection. To address this issue, we modify the shortest path algorithm by adding a novel constraint inspired by the Parzen-Rosenblatt (PR) window, which helps to maintain the uniformity of the constructed shortest-path graph in Isomap. Multiple imaging datasets overall of 72,236 cases, 70,000 MINST data, 1596 from multiple Chest-XRay pneumonia datasets, and three NSCLC CT/PET datasets with a total of 640 lung cancer patients, were used to benchmark and validate PR-Isomap. 431 imaging biomarkers were extracted from each modality. Our results indicate that P",
    "link": "https://arxiv.org/abs/2403.02531",
    "context": "Title: Density-based Isometric Mapping\nAbstract: arXiv:2403.02531v1 Announce Type: new  Abstract: The isometric mapping method employs the shortest path algorithm to estimate the Euclidean distance between points on High dimensional (HD) manifolds. This may not be sufficient for weakly uniformed HD data as it could lead to overestimating distances between far neighboring points, resulting in inconsistencies between the intrinsic (local) and extrinsic (global) distances during the projection. To address this issue, we modify the shortest path algorithm by adding a novel constraint inspired by the Parzen-Rosenblatt (PR) window, which helps to maintain the uniformity of the constructed shortest-path graph in Isomap. Multiple imaging datasets overall of 72,236 cases, 70,000 MINST data, 1596 from multiple Chest-XRay pneumonia datasets, and three NSCLC CT/PET datasets with a total of 640 lung cancer patients, were used to benchmark and validate PR-Isomap. 431 imaging biomarkers were extracted from each modality. Our results indicate that P",
    "path": "papers/24/03/2403.02531.json",
    "total_tokens": 950,
    "translated_title": "基于密度的等距映射",
    "translated_abstract": "同位映射方法利用最短路径算法来估计高维流形上点的欧氏距离。这可能不足以处理弱均匀的高维数据，因为它可能导致估计远处相邻点之间的距离过高，在投影过程中导致本征（局部）和外显（全局）距离之间的不一致。为解决此问题，我们通过为最短路径算法添加了受 Parzen-Rosenblatt（PR）窗口启发的新约束来修改该算法，有助于在等距映射中保持构建的最短路径图的均匀性。我们使用了总共72,236个案例的多个成像数据集，其中包括70,000个MINST数据，来自多个胸部X射线肺炎数据集的1596个数据，以及三个NSCLC CT/PET数据集中共640名肺癌患者的数据，用于基准测试和验证PR-Isomap。每种模态从中提取了431个成像生物标志物。我们的结果表明P",
    "tldr": "该论文提出了一种基于密度的等距映射方法，通过修改最短路径算法，引入了受Parzen-Rosenblatt (PR)窗口启发的新约束，有助于处理高维数据中的不均匀性，使得构建的Isomap中最短路径图具有更好的均匀性。",
    "en_tdlr": "The paper introduces a density-based isometric mapping method that modifies the shortest path algorithm by adding a novel constraint inspired by the Parzen-Rosenblatt (PR) window, aiming to address the issue of handling weakly uniformed high-dimensional data and enhancing the uniformity of the constructed shortest-path graph in Isomap."
}