{
    "title": "Efficient Detection of Exchangeable Factors in Factor Graphs",
    "abstract": "arXiv:2403.10167v1 Announce Type: new  Abstract: To allow for tractable probabilistic inference with respect to domain sizes, lifted probabilistic inference exploits symmetries in probabilistic graphical models. However, checking whether two factors encode equivalent semantics and hence are exchangeable is computationally expensive. In this paper, we efficiently solve the problem of detecting exchangeable factors in a factor graph. In particular, we introduce the detection of exchangeable factors (DEFT) algorithm, which allows us to drastically reduce the computational effort for checking whether two factors are exchangeable in practice. While previous approaches iterate all $O(n!)$ permutations of a factor's argument list in the worst case (where $n$ is the number of arguments of the factor), we prove that DEFT efficiently identifies restrictions to drastically reduce the number of permutations and validate the efficiency of DEFT in our empirical evaluation.",
    "link": "https://arxiv.org/abs/2403.10167",
    "context": "Title: Efficient Detection of Exchangeable Factors in Factor Graphs\nAbstract: arXiv:2403.10167v1 Announce Type: new  Abstract: To allow for tractable probabilistic inference with respect to domain sizes, lifted probabilistic inference exploits symmetries in probabilistic graphical models. However, checking whether two factors encode equivalent semantics and hence are exchangeable is computationally expensive. In this paper, we efficiently solve the problem of detecting exchangeable factors in a factor graph. In particular, we introduce the detection of exchangeable factors (DEFT) algorithm, which allows us to drastically reduce the computational effort for checking whether two factors are exchangeable in practice. While previous approaches iterate all $O(n!)$ permutations of a factor's argument list in the worst case (where $n$ is the number of arguments of the factor), we prove that DEFT efficiently identifies restrictions to drastically reduce the number of permutations and validate the efficiency of DEFT in our empirical evaluation.",
    "path": "papers/24/03/2403.10167.json",
    "total_tokens": 691,
    "translated_title": "因子图中可交换因子的高效检测",
    "translated_abstract": "为了实现对领域大小的可计算概率推断，提出了提升式概率推断，利用概率图模型中的对称性。然而，检查两个因子是否编码等效语义从而是可交换的，在计算上是昂贵的。本文高效解决了在因子图中检测可交换因子的问题。具体来说，引入了检测可交换因子（DEFT）算法，可以大大减少实践中检查两个因子是否可交换的计算工作量。我们证明DEFT有效地识别限制以大幅减少排列数量，并在实证评估中验证了DEFT的效率。",
    "tldr": "提出了一种在因子图中高效检测可交换因子的算法，可以大大减少计算工作量。",
    "en_tdlr": "Proposed an efficient algorithm for detecting exchangeable factors in factor graphs, significantly reducing computational effort."
}