{
    "title": "Improving Android Malware Detection Through Data Augmentation Using Wasserstein Generative Adversarial Networks",
    "abstract": "arXiv:2403.00890v1 Announce Type: cross  Abstract: Generative Adversarial Networks (GANs) have demonstrated their versatility across various applications, including data augmentation and malware detection. This research explores the effectiveness of utilizing GAN-generated data to train a model for the detection of Android malware. Given the considerable storage requirements of Android applications, the study proposes a method to synthetically represent data using GANs, thereby reducing storage demands. The proposed methodology involves creating image representations of features extracted from an existing dataset. A GAN model is then employed to generate a more extensive dataset consisting of realistic synthetic grayscale images. Subsequently, this synthetic dataset is utilized to train a Convolutional Neural Network (CNN) designed to identify previously unseen Android malware applications. The study includes a comparative analysis of the CNN's performance when trained on real images v",
    "link": "https://arxiv.org/abs/2403.00890",
    "context": "Title: Improving Android Malware Detection Through Data Augmentation Using Wasserstein Generative Adversarial Networks\nAbstract: arXiv:2403.00890v1 Announce Type: cross  Abstract: Generative Adversarial Networks (GANs) have demonstrated their versatility across various applications, including data augmentation and malware detection. This research explores the effectiveness of utilizing GAN-generated data to train a model for the detection of Android malware. Given the considerable storage requirements of Android applications, the study proposes a method to synthetically represent data using GANs, thereby reducing storage demands. The proposed methodology involves creating image representations of features extracted from an existing dataset. A GAN model is then employed to generate a more extensive dataset consisting of realistic synthetic grayscale images. Subsequently, this synthetic dataset is utilized to train a Convolutional Neural Network (CNN) designed to identify previously unseen Android malware applications. The study includes a comparative analysis of the CNN's performance when trained on real images v",
    "path": "papers/24/03/2403.00890.json",
    "total_tokens": 866,
    "translated_title": "通过Wasserstein生成对抗网络使用数据增强改进Android恶意软件检测",
    "translated_abstract": "生成对抗网络（GANs）已经展示了它们在各种应用中的多功能性，包括数据增强和恶意软件检测。这项研究探讨了利用GAN生成的数据来训练一个用于检测Android恶意软件的模型的有效性。鉴于Android应用的存储需求相当大，该研究提出了一种使用GAN来合成表示数据的方法，从而降低存储需求。所提出的方法涉及创建从现有数据集中提取的特征的图像表示。然后，使用GAN模型生成由逼真的合成灰度图像组成的更广泛的数据集。随后，这个合成数据集被用来训练一个卷积神经网络（CNN），旨在识别以前看不到的Android恶意应用程序。该研究包括对当CNN在真实图像与GAN生成图像上进行训练时性能的比较分析。",
    "tldr": "通过使用Wasserstein生成对抗网络生成的数据进行数据增强，该研究提出了一种利用卷积神经网络识别未知Android恶意软件应用程序的方法，并通过降低存储需求来改进Android恶意软件检测的效果。",
    "en_tdlr": "By utilizing data generated through Wasserstein Generative Adversarial Networks for data augmentation, this research proposes a method to identify previously unseen Android malware applications using Convolutional Neural Networks, improving Android malware detection by reducing storage requirements."
}