{
    "title": "Will GPT-4 Run DOOM?",
    "abstract": "arXiv:2403.05468v1 Announce Type: cross  Abstract: We show that GPT-4's reasoning and planning capabilities extend to the 1993 first-person shooter Doom. This large language model (LLM) is able to run and play the game with only a few instructions, plus a textual description--generated by the model itself from screenshots--about the state of the game being observed. We find that GPT-4 can play the game to a passable degree: it is able to manipulate doors, combat enemies, and perform pathing. More complex prompting strategies involving multiple model calls provide better results. While further work is required to enable the LLM to play the game as well as its classical, reinforcement learning-based counterparts, we note that GPT-4 required no training, leaning instead on its own reasoning and observational capabilities. We hope our work pushes the boundaries on intelligent, LLM-based agents in video games. We conclude by discussing the ethical implications of our work.",
    "link": "https://arxiv.org/abs/2403.05468",
    "context": "Title: Will GPT-4 Run DOOM?\nAbstract: arXiv:2403.05468v1 Announce Type: cross  Abstract: We show that GPT-4's reasoning and planning capabilities extend to the 1993 first-person shooter Doom. This large language model (LLM) is able to run and play the game with only a few instructions, plus a textual description--generated by the model itself from screenshots--about the state of the game being observed. We find that GPT-4 can play the game to a passable degree: it is able to manipulate doors, combat enemies, and perform pathing. More complex prompting strategies involving multiple model calls provide better results. While further work is required to enable the LLM to play the game as well as its classical, reinforcement learning-based counterparts, we note that GPT-4 required no training, leaning instead on its own reasoning and observational capabilities. We hope our work pushes the boundaries on intelligent, LLM-based agents in video games. We conclude by discussing the ethical implications of our work.",
    "path": "papers/24/03/2403.05468.json",
    "total_tokens": 909,
    "translated_title": "GPT-4会运行《毁灭战士》吗？",
    "translated_abstract": "我们展示了GPT-4的推理和规划能力扩展到了1993年第一人称射击游戏《毁灭战士》。这个大型语言模型能够仅凭少数指令和来自屏幕截图的文本描述（由模型本身生成）来运行和玩游戏。我们发现GPT-4可以以及能够参与游戏：它能够操作门、与敌人作战并执行路径规划。涉及多次模型调用的更复杂提示策略提供了更好的结果。虽然需要进一步工作来让这个LLM玩得像其经典的基于强化学习的对应物一样出色，但我们注意到GPT-4不需要训练，而是依靠自身的推理和观察能力。我们希望我们的工作推动了基于智能LLM代理在视频游戏中的边界。我们最终讨论了我们工作的伦理影响。",
    "tldr": "GPT-4通过自身的推理和观察能力，可以运行并玩1993年的第一人称射击游戏《毁灭战士》，并且能够执行门操作、击败敌人和规划路径，这有望拓展基于LLM的智能代理在视频游戏领域的边界。",
    "en_tdlr": "GPT-4 can run and play the 1993 first-person shooter Doom using its own reasoning and observational capabilities, manipulating doors, combatting enemies, and pathing to push boundaries on intelligent, LLM-based agents in video games."
}