{
    "title": "FWin transformer for dengue prediction under climate and ocean influence",
    "abstract": "arXiv:2403.07027v1 Announce Type: new  Abstract: Dengue fever is one of the most deadly mosquito-born tropical infectious diseases. Detailed long range forecast model is vital in controlling the spread of disease and making mitigation efforts. In this study, we examine methods used to forecast dengue cases for long range predictions. The dataset consists of local climate/weather in addition to global climate indicators of Singapore from 2000 to 2019. We utilize newly developed deep neural networks to learn the intricate relationship between the features. The baseline models in this study are in the class of recent transformers for long sequence forecasting tasks. We found that a Fourier mixed window attention (FWin) based transformer performed the best in terms of both the mean square error and the maximum absolute error on the long range dengue forecast up to 60 weeks.",
    "link": "https://arxiv.org/abs/2403.07027",
    "context": "Title: FWin transformer for dengue prediction under climate and ocean influence\nAbstract: arXiv:2403.07027v1 Announce Type: new  Abstract: Dengue fever is one of the most deadly mosquito-born tropical infectious diseases. Detailed long range forecast model is vital in controlling the spread of disease and making mitigation efforts. In this study, we examine methods used to forecast dengue cases for long range predictions. The dataset consists of local climate/weather in addition to global climate indicators of Singapore from 2000 to 2019. We utilize newly developed deep neural networks to learn the intricate relationship between the features. The baseline models in this study are in the class of recent transformers for long sequence forecasting tasks. We found that a Fourier mixed window attention (FWin) based transformer performed the best in terms of both the mean square error and the maximum absolute error on the long range dengue forecast up to 60 weeks.",
    "path": "papers/24/03/2403.07027.json",
    "total_tokens": 822,
    "translated_title": "基于FWin转换器的登革热预测在气候和海洋影响下",
    "translated_abstract": "骨病热是最致命的蚊媒传染病之一。详细的长期预测模型对于控制疾病传播和进行缓解工作至关重要。本研究考察了用于长期预测骨病病例的方法。数据集包括2000年至2019年新加坡的本地气候/天气以及全球气候指标。我们利用新开发的深度神经网络来学习特征之间的复杂关系。本研究中的基准模型属于最近用于长序列预测任务的变压器类别。我们发现，基于傅里叶混合窗口注意力（FWin）的变压器在长达60周的登革热预测中，在均方误差和最大绝对误差上表现最佳。",
    "tldr": "本研究利用深度神经网络和FWin转换器对新加坡2000年至2019年气候数据进行长期登革病例预测，发现FWin表现最佳。",
    "en_tdlr": "This study utilized deep neural networks and FWin transformer to predict long-term dengue cases using climate data from Singapore between 2000 and 2019, with FWin showing the best performance."
}