{
    "title": "Data-driven local operator finding for reduced-order modelling of plasma systems: I. Concept and verifications",
    "abstract": "arXiv:2403.01523v1 Announce Type: cross  Abstract: Reduced-order plasma models that can efficiently predict plasma behavior across various settings and configurations are highly sought after yet elusive. The demand for such models has surged in the past decade due to their potential to facilitate scientific research and expedite the development of plasma technologies. In line with the advancements in computational power and data-driven methods, we introduce the \"Phi Method\" in this two-part article. Part I presents this novel algorithm, which employs constrained regression on a candidate term library informed by numerical discretization schemes to discover discretized systems of differential equations. We demonstrate Phi Method's efficacy in deriving reliable and robust reduced-order models (ROMs) for three test cases: the Lorenz attractor, flow past a cylinder, and a 1D Hall-thruster-representative plasma. Part II will delve into the method's application for parametric dynamics discov",
    "link": "https://arxiv.org/abs/2403.01523",
    "context": "Title: Data-driven local operator finding for reduced-order modelling of plasma systems: I. Concept and verifications\nAbstract: arXiv:2403.01523v1 Announce Type: cross  Abstract: Reduced-order plasma models that can efficiently predict plasma behavior across various settings and configurations are highly sought after yet elusive. The demand for such models has surged in the past decade due to their potential to facilitate scientific research and expedite the development of plasma technologies. In line with the advancements in computational power and data-driven methods, we introduce the \"Phi Method\" in this two-part article. Part I presents this novel algorithm, which employs constrained regression on a candidate term library informed by numerical discretization schemes to discover discretized systems of differential equations. We demonstrate Phi Method's efficacy in deriving reliable and robust reduced-order models (ROMs) for three test cases: the Lorenz attractor, flow past a cylinder, and a 1D Hall-thruster-representative plasma. Part II will delve into the method's application for parametric dynamics discov",
    "path": "papers/24/03/2403.01523.json",
    "total_tokens": 872,
    "translated_title": "基于数据驱动的等离子体系统简化建模中的本地算子查找：I. 概念和验证",
    "translated_abstract": "被广泛追求但难以找到的简化等离子体模型可以高效地预测不同设置和配置下的等离子体行为。由于其潜力促进科学研究并加快等离子体技术的发展，过去十年对这类模型的需求急剧增加。本文介绍了“Phi Method”，该方法结合了计算能力和数据驱动方法的进展。第一部分介绍了这一新颖算法，该算法利用受数值离散方案启发的候选项库上的约束回归来发现离散化的微分方程系统。我们展示了Phi Method在三个测试案例中（Lorenz吸引子、圆柱体流动以及代表性的一维Hall推进器等离子体）导出可靠且稳健的简化模型（ROMs）的有效性。第二部分将深入探讨该方法在参数动态发现中的应用。",
    "tldr": "引入了\"Phi Method\"，通过约束回归和候选项库发现离散化的微分方程系统，成功导出了可靠且稳健的简化等离子体模型，具有广泛的应用前景。",
    "en_tdlr": "Introduced the \"Phi Method\" which uses constrained regression on candidate term library to discover discretized systems of differential equations, successfully deriving reliable and robust reduced-order plasma models with great potential for various applications."
}