{
    "title": "Provably Secure Disambiguating Neural Linguistic Steganography",
    "abstract": "arXiv:2403.17524v1 Announce Type: cross  Abstract: Recent research in provably secure neural linguistic steganography has overlooked a crucial aspect: the sender must detokenize stegotexts to avoid raising suspicion from the eavesdropper. The segmentation ambiguity problem, which arises when using language models based on subwords, leads to occasional decoding failures in all neural language steganography implementations based on these models. Current solutions to this issue involve altering the probability distribution of candidate words, rendering them incompatible with provably secure steganography. We propose a novel secure disambiguation method named SyncPool, which effectively addresses the segmentation ambiguity problem. We group all tokens with prefix relationships in the candidate pool before the steganographic embedding algorithm runs to eliminate uncertainty among ambiguous tokens. To enable the receiver to synchronize the sampling process of the sender, a shared cryptograph",
    "link": "https://arxiv.org/abs/2403.17524",
    "context": "Title: Provably Secure Disambiguating Neural Linguistic Steganography\nAbstract: arXiv:2403.17524v1 Announce Type: cross  Abstract: Recent research in provably secure neural linguistic steganography has overlooked a crucial aspect: the sender must detokenize stegotexts to avoid raising suspicion from the eavesdropper. The segmentation ambiguity problem, which arises when using language models based on subwords, leads to occasional decoding failures in all neural language steganography implementations based on these models. Current solutions to this issue involve altering the probability distribution of candidate words, rendering them incompatible with provably secure steganography. We propose a novel secure disambiguation method named SyncPool, which effectively addresses the segmentation ambiguity problem. We group all tokens with prefix relationships in the candidate pool before the steganographic embedding algorithm runs to eliminate uncertainty among ambiguous tokens. To enable the receiver to synchronize the sampling process of the sender, a shared cryptograph",
    "path": "papers/24/03/2403.17524.json",
    "total_tokens": 815,
    "translated_title": "可证安全的神经语言隐写术消除方法",
    "translated_abstract": "最近的研究表明，可证安全的神经语言隐写术忽略了一个关键方面：发送方必须对隐写文本进行去记号化，以避免引起窃听者的怀疑。基于子词的语言模型会导致分词模糊问题，在所有基于这些模型的神经语言隐写术实现中偶尔会出现解码失败。目前解决此问题的方法包括更改候选词的概率分布，使其与可证安全的隐写术不相容。我们提出了一种名为SyncPool的新颖安全消除歧义方法，有效解决了分词模糊问题。我们在隐写嵌入算法运行之前将所有具有前缀关系的令牌分组在候选池中，以消除模糊令牌之间的不确定性。为使接收方能够同步发送方的采样过程，使用了一个共享密码术。",
    "tldr": "我们提出了一种名为SyncPool的新颖安全消除歧义方法，有效解决了神经语言隐写术中的分词模糊问题。"
}