{
    "title": "Domain Adaptation for Dense Retrieval and Conversational Dense Retrieval through Self-Supervision by Meticulous Pseudo-Relevance Labeling",
    "abstract": "arXiv:2403.08970v1 Announce Type: new  Abstract: Recent studies have demonstrated that the ability of dense retrieval models to generalize to target domains with different distributions is limited, which contrasts with the results obtained with interaction-based models. Prior attempts to mitigate this challenge involved leveraging adversarial learning and query generation approaches, but both approaches nevertheless resulted in limited improvements. In this paper, we propose to combine the query-generation approach with a self-supervision approach in which pseudo-relevance labels are automatically generated on the target domain. To accomplish this, a T5-3B model is utilized for pseudo-positive labeling, and meticulous hard negatives are chosen. We also apply this strategy on conversational dense retrieval model for conversational search. A similar pseudo-labeling approach is used, but with the addition of a query-rewriting module to rewrite conversational queries for subsequent labelin",
    "link": "https://arxiv.org/abs/2403.08970",
    "context": "Title: Domain Adaptation for Dense Retrieval and Conversational Dense Retrieval through Self-Supervision by Meticulous Pseudo-Relevance Labeling\nAbstract: arXiv:2403.08970v1 Announce Type: new  Abstract: Recent studies have demonstrated that the ability of dense retrieval models to generalize to target domains with different distributions is limited, which contrasts with the results obtained with interaction-based models. Prior attempts to mitigate this challenge involved leveraging adversarial learning and query generation approaches, but both approaches nevertheless resulted in limited improvements. In this paper, we propose to combine the query-generation approach with a self-supervision approach in which pseudo-relevance labels are automatically generated on the target domain. To accomplish this, a T5-3B model is utilized for pseudo-positive labeling, and meticulous hard negatives are chosen. We also apply this strategy on conversational dense retrieval model for conversational search. A similar pseudo-labeling approach is used, but with the addition of a query-rewriting module to rewrite conversational queries for subsequent labelin",
    "path": "papers/24/03/2403.08970.json",
    "total_tokens": 857,
    "translated_title": "通过细致的伪相关性标记实现自我监督的密集检索和对话密集检索的域自适应",
    "translated_abstract": "最近的研究表明，密集检索模型在将不同分布的目标域推广方面的能力是有限的，这与基于交互的模型的结果形成了对比。以前为了减轻这一挑战而尝试的方法涉及利用对抗性学习和查询生成方法，但这两种方法仍然带来了有限的改进。在本文中，我们提出将查询生成方法与自我监督方法相结合，其中在目标域上自动生成伪相关性标签。为了实现这一点，我们利用了一个T5-3B模型进行伪正标记，并选择了细致的硬负例。我们还将这种策略应用于用于对话搜索的对话密集检索模型。使用类似的伪标记方法，但增加了一个查询重写模块来重写对话查询以便后续标记。",
    "tldr": "本文提出了一种结合查询生成和自我监督方法的域自适应策略，通过在目标域上自动生成伪相关性标签，并应用于密集检索和对话密集检索模型，以实现更好的推广能力。",
    "en_tdlr": "This paper proposes a domain adaptation strategy that combines query generation and self-supervision methods to automatically generate pseudo-relevance labels on the target domain, applied to dense retrieval and conversational dense retrieval models for improved generalization capabilities."
}