{
    "title": "On the Roles of LLMs in Planning: Embedding LLMs into Planning Graphs",
    "abstract": "arXiv:2403.00783v1 Announce Type: new  Abstract: Plan synthesis aims to generate a course of actions or policies to transit given initial states to goal states, provided domain models that could be designed by experts or learnt from training data or interactions with the world. Intrigued by the claims of emergent planning capabilities in large language models (LLMs), works have been proposed to investigate the planning effectiveness of LLMs, without considering any utilization of off-the-shelf planning techniques in LLMs. In this paper, we aim to further study the insight of the planning capability of LLMs by investigating the roles of LLMs in off-the-shelf planning frameworks. To do this, we investigate the effectiveness of embedding LLMs into one of the well-known planning frameworks, graph-based planning, proposing a novel LLMs-based planning framework with LLMs embedded in two levels of planning graphs, i.e., mutual constraints generation level and constraints solving level. We emp",
    "link": "https://arxiv.org/abs/2403.00783",
    "context": "Title: On the Roles of LLMs in Planning: Embedding LLMs into Planning Graphs\nAbstract: arXiv:2403.00783v1 Announce Type: new  Abstract: Plan synthesis aims to generate a course of actions or policies to transit given initial states to goal states, provided domain models that could be designed by experts or learnt from training data or interactions with the world. Intrigued by the claims of emergent planning capabilities in large language models (LLMs), works have been proposed to investigate the planning effectiveness of LLMs, without considering any utilization of off-the-shelf planning techniques in LLMs. In this paper, we aim to further study the insight of the planning capability of LLMs by investigating the roles of LLMs in off-the-shelf planning frameworks. To do this, we investigate the effectiveness of embedding LLMs into one of the well-known planning frameworks, graph-based planning, proposing a novel LLMs-based planning framework with LLMs embedded in two levels of planning graphs, i.e., mutual constraints generation level and constraints solving level. We emp",
    "path": "papers/24/03/2403.00783.json",
    "total_tokens": 873,
    "translated_title": "论LLMs在规划中的作用：将LLMs嵌入规划图中",
    "translated_abstract": "计划合成旨在生成一系列动作或策略，将给定的初始状态转移到目标状态，提供的领域模型可以由专家设计或从训练数据或与世界的交互中学习。受大型语言模型（LLMs）的新兴规划能力的声称所吸引，提出了研究LLMs规划有效性的工作，而不考虑LLMs中现成规划技术的利用。本文旨在通过研究LLMs在现成规划框架中的作用进一步研究LLMs的规划能力洞察。为此，我们研究了将LLMs嵌入到众所周知的规划框架之一，基于图的规划中的有效性，提出了一种新颖的基于LLMs的规划框架，其中LLMs嵌入到两个级别的规划图中，即相互约束生成级别和约束解决级别。",
    "tldr": "通过将LLMs嵌入到图形规划中，本文研究了LLMs在现成规划框架中的作用，并提出了一种新颖的LLMs-based规划框架。",
    "en_tdlr": "This paper investigates the roles of LLMs in planning by embedding LLMs into planning graphs, proposing a novel LLMs-based planning framework in the context of off-the-shelf planning frameworks."
}