{
    "title": "Divide, Conquer, Combine Bayesian Decision Tree Sampling",
    "abstract": "arXiv:2403.18147v1 Announce Type: new  Abstract: Decision trees are commonly used predictive models due to their flexibility and interpretability. This paper is directed at quantifying the uncertainty of decision tree predictions by employing a Bayesian inference approach. This is challenging because these approaches need to explore both the tree structure space and the space of decision parameters associated with each tree structure. This has been handled by using Markov Chain Monte Carlo (MCMC) methods, where a Markov Chain is constructed to provide samples from the desired Bayesian estimate. Importantly, the structure and the decision parameters are tightly coupled; small changes in the tree structure can demand vastly different decision parameters to provide accurate predictions. A challenge for existing MCMC approaches is proposing joint changes in both the tree structure and the decision parameters that result in efficient sampling. This paper takes a different approach, where ea",
    "link": "https://arxiv.org/abs/2403.18147",
    "context": "Title: Divide, Conquer, Combine Bayesian Decision Tree Sampling\nAbstract: arXiv:2403.18147v1 Announce Type: new  Abstract: Decision trees are commonly used predictive models due to their flexibility and interpretability. This paper is directed at quantifying the uncertainty of decision tree predictions by employing a Bayesian inference approach. This is challenging because these approaches need to explore both the tree structure space and the space of decision parameters associated with each tree structure. This has been handled by using Markov Chain Monte Carlo (MCMC) methods, where a Markov Chain is constructed to provide samples from the desired Bayesian estimate. Importantly, the structure and the decision parameters are tightly coupled; small changes in the tree structure can demand vastly different decision parameters to provide accurate predictions. A challenge for existing MCMC approaches is proposing joint changes in both the tree structure and the decision parameters that result in efficient sampling. This paper takes a different approach, where ea",
    "path": "papers/24/03/2403.18147.json",
    "total_tokens": 800,
    "translated_title": "划分、征服、结合贝叶斯决策树抽样",
    "translated_abstract": "决策树是常用的预测模型，因其灵活性和解释性。本文旨在通过采用贝叶斯推断方法量化决策树预测的不确定性。这是具有挑战性的，因为这些方法需要探索树结构空间和与每个树结构相关联的决策参数空间。通过使用马尔可夫链蒙特卡洛（MCMC）方法来处理这一问题，其中构建马尔可夫链以提供所需的贝叶斯估计样本。重要的是，结构和决策参数紧密耦合；树结构的微小变化可能需要大不同的决策参数以提供准确的预测。现有MCMC方法面临的挑战是提出同时改变树结构和决策参数的建议，以实现高效抽样。本文采取了不同的方法，",
    "tldr": "该论文旨在通过贝叶斯推断方法量化决策树预测的不确定性，并提出了一种改变树结构和决策参数的新方法。",
    "en_tdlr": "This paper aims to quantify the uncertainty of decision tree predictions using a Bayesian inference approach, and proposes a new method for modifying tree structure and decision parameters."
}