{
    "title": "Advancing Additive Manufacturing through Deep Learning: A Comprehensive Review of Current Progress and Future Challenges",
    "abstract": "arXiv:2403.00669v1 Announce Type: new  Abstract: Additive manufacturing (AM) has already proved itself to be the potential alternative to widely-used subtractive manufacturing due to its extraordinary capacity of manufacturing highly customized products with minimum material wastage. Nevertheless, it is still not being considered as the primary choice for the industry due to some of its major inherent challenges, including complex and dynamic process interactions, which are sometimes difficult to fully understand even with traditional machine learning because of the involvement of high-dimensional data such as images, point clouds, and voxels. However, the recent emergence of deep learning (DL) is showing great promise in overcoming many of these challenges as DL can automatically capture complex relationships from high-dimensional data without hand-crafted feature extraction. Therefore, the volume of research in the intersection of AM and DL is exponentially growing each year which ma",
    "link": "https://arxiv.org/abs/2403.00669",
    "context": "Title: Advancing Additive Manufacturing through Deep Learning: A Comprehensive Review of Current Progress and Future Challenges\nAbstract: arXiv:2403.00669v1 Announce Type: new  Abstract: Additive manufacturing (AM) has already proved itself to be the potential alternative to widely-used subtractive manufacturing due to its extraordinary capacity of manufacturing highly customized products with minimum material wastage. Nevertheless, it is still not being considered as the primary choice for the industry due to some of its major inherent challenges, including complex and dynamic process interactions, which are sometimes difficult to fully understand even with traditional machine learning because of the involvement of high-dimensional data such as images, point clouds, and voxels. However, the recent emergence of deep learning (DL) is showing great promise in overcoming many of these challenges as DL can automatically capture complex relationships from high-dimensional data without hand-crafted feature extraction. Therefore, the volume of research in the intersection of AM and DL is exponentially growing each year which ma",
    "path": "papers/24/03/2403.00669.json",
    "total_tokens": 824,
    "translated_title": "通过深度学习推动增材制造：当前进展和未来挑战的综合评述",
    "translated_abstract": "增材制造（AM）已经被证明是广泛使用的减少制造的潜在替代品，因为其在最小材料浪费的情况下制造高度定制产品的能力。然而，由于包括复杂和动态过程相互作用在内的一些主要固有挑战，即使使用传统的机器学习，有时也难以完全理解，因为涉及到高维数据，如图像、点云和体素。然而，最近出现的深度学习（DL）在克服许多这些挑战方面显示出了巨大的潜力，因为DL能够自动从高维数据中捕捉复杂关系，而无需手工制作特征提取。因此，AM和DL交叉领域的研究量每年呈指数增长，这可能会将增材制造推向更广阔的应用领域。",
    "tldr": "深度学习在增材制造领域显示出巨大潜力，能够克服高维数据的复杂挑战，推动该领域不断发展。",
    "en_tdlr": "Deep learning shows great potential in the field of additive manufacturing, overcoming complex challenges of high-dimensional data and driving forward advancements in the field."
}