{
    "title": "Embracing the Generative AI Revolution: Advancing Tertiary Education in Cybersecurity with GPT",
    "abstract": "arXiv:2403.11402v1 Announce Type: cross  Abstract: The rapid advancement of generative Artificial Intelligence (AI) technologies, particularly Generative Pre-trained Transformer (GPT) models such as ChatGPT, has the potential to significantly impact cybersecurity. In this study, we investigated the impact of GPTs, specifically ChatGPT, on tertiary education in cybersecurity, and provided recommendations for universities to adapt their curricula to meet the evolving needs of the industry. Our research highlighted the importance of understanding the alignment between GPT's ``mental model'' and human cognition, as well as the enhancement of GPT capabilities to human skills based on Bloom's taxonomy. By analyzing current educational practices and the alignment of curricula with industry requirements, we concluded that universities providing practical degrees like cybersecurity should align closely with industry demand and embrace the inevitable generative AI revolution, while applying stri",
    "link": "https://arxiv.org/abs/2403.11402",
    "context": "Title: Embracing the Generative AI Revolution: Advancing Tertiary Education in Cybersecurity with GPT\nAbstract: arXiv:2403.11402v1 Announce Type: cross  Abstract: The rapid advancement of generative Artificial Intelligence (AI) technologies, particularly Generative Pre-trained Transformer (GPT) models such as ChatGPT, has the potential to significantly impact cybersecurity. In this study, we investigated the impact of GPTs, specifically ChatGPT, on tertiary education in cybersecurity, and provided recommendations for universities to adapt their curricula to meet the evolving needs of the industry. Our research highlighted the importance of understanding the alignment between GPT's ``mental model'' and human cognition, as well as the enhancement of GPT capabilities to human skills based on Bloom's taxonomy. By analyzing current educational practices and the alignment of curricula with industry requirements, we concluded that universities providing practical degrees like cybersecurity should align closely with industry demand and embrace the inevitable generative AI revolution, while applying stri",
    "path": "papers/24/03/2403.11402.json",
    "total_tokens": 815,
    "translated_title": "拥抱生成AI革命：用GPT推进网络安全的高等教育",
    "translated_abstract": "随着生成人工智能（AI）技术的快速发展，特别是如ChatGPT等Generative Pre-trained Transformer（GPT）模型，将对网络安全产生重大影响。本研究调查了GPT，特别是ChatGPT在网络安全高等教育中的影响，并就大学应如何调整课程内容以满足行业不断发展的需求提供建议。我们的研究强调了理解GPT的“心智模型”与人类认知之间的一致性的重要性，以及提高GPT能力以符合布鲁姆分类法中的人类技能。通过分析当前的教育实践以及课程内容与行业需求的一致性，我们得出结论：提供网络安全等实用学位的大学应与行业需求密切对接，拥抱不可避免的生成AI革命，并应用strik",
    "tldr": "生成AI技术如ChatGPT对网络安全教育具有重大影响，研究强调了大学应对课程进行调整以适应行业需求。",
    "en_tdlr": "The generative AI technology like ChatGPT has a significant impact on cybersecurity education, highlighting the need for universities to adapt their curriculum to meet industry demands."
}