{
    "title": "Learning the irreversible progression trajectory of Alzheimer's disease",
    "abstract": "arXiv:2403.06087v1 Announce Type: new  Abstract: Alzheimer's disease (AD) is a progressive and irreversible brain disorder that unfolds over the course of 30 years. Therefore, it is critical to capture the disease progression in an early stage such that intervention can be applied before the onset of symptoms. Machine learning (ML) models have been shown effective in predicting the onset of AD. Yet for subjects with follow-up visits, existing techniques for AD classification only aim for accurate group assignment, where the monotonically increasing risk across follow-up visits is usually ignored. Resulted fluctuating risk scores across visits violate the irreversibility of AD, hampering the trustworthiness of models and also providing little value to understanding the disease progression. To address this issue, we propose a novel regularization approach to predict AD longitudinally. Our technique aims to maintain the expected monotonicity of increasing disease risk during progression w",
    "link": "https://arxiv.org/abs/2403.06087",
    "context": "Title: Learning the irreversible progression trajectory of Alzheimer's disease\nAbstract: arXiv:2403.06087v1 Announce Type: new  Abstract: Alzheimer's disease (AD) is a progressive and irreversible brain disorder that unfolds over the course of 30 years. Therefore, it is critical to capture the disease progression in an early stage such that intervention can be applied before the onset of symptoms. Machine learning (ML) models have been shown effective in predicting the onset of AD. Yet for subjects with follow-up visits, existing techniques for AD classification only aim for accurate group assignment, where the monotonically increasing risk across follow-up visits is usually ignored. Resulted fluctuating risk scores across visits violate the irreversibility of AD, hampering the trustworthiness of models and also providing little value to understanding the disease progression. To address this issue, we propose a novel regularization approach to predict AD longitudinally. Our technique aims to maintain the expected monotonicity of increasing disease risk during progression w",
    "path": "papers/24/03/2403.06087.json",
    "total_tokens": 829,
    "translated_title": "学习阿尔茨海默病的不可逆进展轨迹",
    "translated_abstract": "阿尔茨海默病（AD）是一种随着30年时间逐渐展开的进行性不可逆脑部疾病。因此，关键是在早期捕获疾病的进展，以便在症状出现之前可以施加干预。机器学习（ML）模型已被证明在预测AD的发作方面有效。然而，对于有随访的受试者，现有的AD分类技术只针对准确的组分配，通常忽略了在随访过程中递增风险的单调增加。在随访间出现的波动风险评分违背了AD的不可逆性，影响了模型的可信度，也对理解疾病的进展提供了很少的价值。为了解决这个问题，我们提出了一种新的正则化方法来预测AD的纵向发展。我们的技术旨在在病情进展期间保持预期的单调增加疾病风险。",
    "tldr": "提出了一种正则化方法来预测阿尔茨海默病的不可逆进展轨迹",
    "en_tdlr": "Proposing a regularization approach to predict the irreversible progression trajectory of Alzheimer's disease."
}