{
    "title": "Structural Positional Encoding for knowledge integration in transformer-based medical process monitoring",
    "abstract": "arXiv:2403.08836v1 Announce Type: cross  Abstract: Predictive process monitoring is a process mining task aimed at forecasting information about a running process trace, such as the most correct next activity to be executed. In medical domains, predictive process monitoring can provide valuable decision support in atypical and nontrivial situations. Decision support and quality assessment in medicine cannot ignore domain knowledge, in order to be grounded on all the available information (which is not limited to data) and to be really acceptable by end users.   In this paper, we propose a predictive process monitoring approach relying on the use of a {\\em transformer}, a deep learning architecture based on the attention mechanism. A major contribution of our work lies in the incorporation of ontological domain-specific knowledge, carried out through a graph positional encoding technique. The paper presents and discusses the encouraging experimental result we are collecting in the domai",
    "link": "https://arxiv.org/abs/2403.08836",
    "context": "Title: Structural Positional Encoding for knowledge integration in transformer-based medical process monitoring\nAbstract: arXiv:2403.08836v1 Announce Type: cross  Abstract: Predictive process monitoring is a process mining task aimed at forecasting information about a running process trace, such as the most correct next activity to be executed. In medical domains, predictive process monitoring can provide valuable decision support in atypical and nontrivial situations. Decision support and quality assessment in medicine cannot ignore domain knowledge, in order to be grounded on all the available information (which is not limited to data) and to be really acceptable by end users.   In this paper, we propose a predictive process monitoring approach relying on the use of a {\\em transformer}, a deep learning architecture based on the attention mechanism. A major contribution of our work lies in the incorporation of ontological domain-specific knowledge, carried out through a graph positional encoding technique. The paper presents and discusses the encouraging experimental result we are collecting in the domai",
    "path": "papers/24/03/2403.08836.json",
    "total_tokens": 792,
    "translated_title": "基于结构位置编码的变压器在医疗过程监测中的知识整合",
    "translated_abstract": "预测性过程监测是一项旨在预测正在运行的过程跟踪信息的过程挖掘任务，例如最正确的下一个要执行的活动。在医学领域，预测性过程监测可以在非典型和非平凡情况下提供有价值的决策支持。本文提出了一种依赖于变压器的预测性过程监测方法，该方法基于注意机制的深度学习架构。我们的工作的一个重要贡献在于通过图形位置编码技术融入本体领域特定知识。文章介绍并讨论了我们在医学过程监测中正在收集的令人鼓舞的实验结果。",
    "tldr": "本文在医学过程监测中提出了一种基于变压器的预测性过程监测方法，通过图形位置编码技术融入本体领域特定知识，获得了令人鼓舞的实验结果。",
    "en_tdlr": "This paper introduces a predictive process monitoring approach based on transformer in medical process monitoring, incorporating domain-specific knowledge through graph positional encoding technique and achieving encouraging experimental results."
}