{
    "title": "Randomized Control in Performance Analysis and Empirical Asset Pricing",
    "abstract": "arXiv:2403.00009v1 Announce Type: new  Abstract: The present article explores the application of randomized control techniques in empirical asset pricing and performance evaluation. It introduces geometric random walks, a class of Markov chain Monte Carlo methods, to construct flexible control groups in the form of random portfolios adhering to investor constraints. The sampling-based methods enable an exploration of the relationship between academically studied factor premia and performance in a practical setting. In an empirical application, the study assesses the potential to capture premias associated with size, value, quality, and momentum within a strongly constrained setup, exemplified by the investor guidelines of the MSCI Diversified Multifactor index. Additionally, the article highlights issues with the more traditional use case of random portfolios for drawing inferences in performance evaluation, showcasing challenges related to the intricacies of high-dimensional geometry.",
    "link": "https://arxiv.org/abs/2403.00009",
    "context": "Title: Randomized Control in Performance Analysis and Empirical Asset Pricing\nAbstract: arXiv:2403.00009v1 Announce Type: new  Abstract: The present article explores the application of randomized control techniques in empirical asset pricing and performance evaluation. It introduces geometric random walks, a class of Markov chain Monte Carlo methods, to construct flexible control groups in the form of random portfolios adhering to investor constraints. The sampling-based methods enable an exploration of the relationship between academically studied factor premia and performance in a practical setting. In an empirical application, the study assesses the potential to capture premias associated with size, value, quality, and momentum within a strongly constrained setup, exemplified by the investor guidelines of the MSCI Diversified Multifactor index. Additionally, the article highlights issues with the more traditional use case of random portfolios for drawing inferences in performance evaluation, showcasing challenges related to the intricacies of high-dimensional geometry.",
    "path": "papers/24/03/2403.00009.json",
    "total_tokens": 846,
    "translated_title": "随机对照在绩效分析和实证资产定价中的应用",
    "translated_abstract": "本文探讨了随机对照技术在实证资产定价和绩效评估中的应用。它介绍了几何随机游走，一种马尔可夫链蒙特卡洛方法的范例，以构建灵活的控制组，即符合投资者约束条件的随机投资组合。基于抽样的方法使得能够在实践环境中探索学术研究的因子溢价与绩效之间的关系。在一个实证应用中，本研究评估了在强烈约束设置下捕获与MSCI Diversified Multifactor指数的投资者指南所示相对应的规模、价值、质量和动量溢价的潜力。此外，本文强调了传统随机投资组合在绩效评估中推断的问题，展示了与高维几何复杂性相关的挑战。",
    "tldr": "文章在实证资产定价和绩效评估中应用了随机对照技术，利用几何随机游走方法构建了符合投资者约束条件的随机投资组合，探索了因子溢价与绩效之间的关系。",
    "en_tdlr": "The paper applies randomized control techniques in empirical asset pricing and performance evaluation, utilizing geometric random walks to construct random portfolios adhering to investor constraints and exploring the relationship between factor premia and performance."
}