{
    "title": "CoRaiS: Lightweight Real-Time Scheduler for Multi-Edge Cooperative Computing",
    "abstract": "arXiv:2403.09671v1 Announce Type: cross  Abstract: Multi-edge cooperative computing that combines constrained resources of multiple edges into a powerful resource pool has the potential to deliver great benefits, such as a tremendous computing power, improved response time, more diversified services. However, the mass heterogeneous resources composition and lack of scheduling strategies make the modeling and cooperating of multi-edge computing system particularly complicated. This paper first proposes a system-level state evaluation model to shield the complex hardware configurations and redefine the different service capabilities at heterogeneous edges. Secondly, an integer linear programming model is designed to cater for optimally dispatching the distributed arriving requests. Finally, a learning-based lightweight real-time scheduler, CoRaiS, is proposed. CoRaiS embeds the real-time states of multi-edge system and requests information, and combines the embeddings with a policy netwo",
    "link": "https://arxiv.org/abs/2403.09671",
    "context": "Title: CoRaiS: Lightweight Real-Time Scheduler for Multi-Edge Cooperative Computing\nAbstract: arXiv:2403.09671v1 Announce Type: cross  Abstract: Multi-edge cooperative computing that combines constrained resources of multiple edges into a powerful resource pool has the potential to deliver great benefits, such as a tremendous computing power, improved response time, more diversified services. However, the mass heterogeneous resources composition and lack of scheduling strategies make the modeling and cooperating of multi-edge computing system particularly complicated. This paper first proposes a system-level state evaluation model to shield the complex hardware configurations and redefine the different service capabilities at heterogeneous edges. Secondly, an integer linear programming model is designed to cater for optimally dispatching the distributed arriving requests. Finally, a learning-based lightweight real-time scheduler, CoRaiS, is proposed. CoRaiS embeds the real-time states of multi-edge system and requests information, and combines the embeddings with a policy netwo",
    "path": "papers/24/03/2403.09671.json",
    "total_tokens": 819,
    "translated_title": "CoRaiS: 轻量级多边协作计算实时调度器",
    "translated_abstract": "多边协作计算将多个边缘的受限资源合并为一个强大的资源池，具有提供巨大计算能力、改进响应时间和更多样化服务等潜力带来巨大好处。然而，大量异构资源组成和缺乏调度策略使得多边计算系统的建模和协作变得特别复杂。本文首先提出了一个系统级状态评估模型，用于保护复杂的硬件配置并重新定义异构边缘的不同服务能力。其次，设计了一个整数线性规划模型，以便最优地调度分布式到达的请求。最后，提出了一个基于学习的轻量级实时调度器 CoRaiS。CoRaiS嵌入了多边系统的实时状态和请求信息，并将这些嵌入与策略网络相结合。",
    "tldr": "提出了一种基于系统级状态评估模型和整数线性规划模型的多边协作计算实时调度器 CoRaiS，以优化分发分布到达的请求，提高多边系统的协作效率。",
    "en_tdlr": "Proposed a lightweight real-time scheduler CoRaiS for multi-edge cooperative computing based on system-level state evaluation model and integer linear programming model, aiming to optimize dispatching distributed arriving requests and enhance the collaboration efficiency of multi-edge system."
}