{
    "title": "DeepSample: DNN sampling-based testing for operational accuracy assessment",
    "abstract": "arXiv:2403.19271v1 Announce Type: cross  Abstract: Deep Neural Networks (DNN) are core components for classification and regression tasks of many software systems. Companies incur in high costs for testing DNN with datasets representative of the inputs expected in operation, as these need to be manually labelled. The challenge is to select a representative set of test inputs as small as possible to reduce the labelling cost, while sufficing to yield unbiased high-confidence estimates of the expected DNN accuracy. At the same time, testers are interested in exposing as many DNN mispredictions as possible to improve the DNN, ending up in the need for techniques pursuing a threefold aim: small dataset size, trustworthy estimates, mispredictions exposure. This study presents DeepSample, a family of DNN testing techniques for cost-effective accuracy assessment based on probabilistic sampling. We investigate whether, to what extent, and under which conditions probabilistic sampling can help ",
    "link": "https://arxiv.org/abs/2403.19271",
    "context": "Title: DeepSample: DNN sampling-based testing for operational accuracy assessment\nAbstract: arXiv:2403.19271v1 Announce Type: cross  Abstract: Deep Neural Networks (DNN) are core components for classification and regression tasks of many software systems. Companies incur in high costs for testing DNN with datasets representative of the inputs expected in operation, as these need to be manually labelled. The challenge is to select a representative set of test inputs as small as possible to reduce the labelling cost, while sufficing to yield unbiased high-confidence estimates of the expected DNN accuracy. At the same time, testers are interested in exposing as many DNN mispredictions as possible to improve the DNN, ending up in the need for techniques pursuing a threefold aim: small dataset size, trustworthy estimates, mispredictions exposure. This study presents DeepSample, a family of DNN testing techniques for cost-effective accuracy assessment based on probabilistic sampling. We investigate whether, to what extent, and under which conditions probabilistic sampling can help ",
    "path": "papers/24/03/2403.19271.json",
    "total_tokens": 833,
    "translated_title": "DeepSample：基于DNN采样的测试用于操作准确度评估",
    "translated_abstract": "Deep Neural Networks（DNN）是许多软件系统分类和回归任务的核心组件。企业为使用代表操作中预期输入的数据集测试DNN而产生高成本，因为这些需要手动标记。挑战在于尽可能选择一组代表性的测试输入集，以减少标记成本，同时足以产生无偏高置信度的预期DNN准确性估计。同时，测试人员希望尽可能暴露出尽可能多的DNN误判，以改进DNN，因此需要追求三重目标的技术：小数据集大小、可信赖的估计和误判曝光。本研究提出了DeepSample，一种基于概率采样的用于成本效益的准确度评估的DNN测试技术系列。我们研究了概率采样在何种程度和在哪些条件下有助于",
    "tldr": "该研究基于概率采样提出了DeepSample，通过小数据集大小、可信赖的估计和误判曝光三方面的技术目标，实现了成本效益的DNN准确度评估。",
    "en_tdlr": "This study introduces DeepSample based on probabilistic sampling, achieving cost-effective DNN accuracy assessment through the threefold goals of small dataset size, trustworthy estimates, and mispredictions exposure."
}