{
    "title": "CapsF: Capsule Fusion for Extracting psychiatric stressors for suicide from twitter",
    "abstract": "arXiv:2403.15391v1 Announce Type: new  Abstract: Along with factors such as cancer, blood pressure, street accidents and stroke, suicide has been one of Iran main causes of death. One of the main reasons for suicide is psychological stressors. Identifying psychological stressors in an at risk population can help in the early prevention of suicidal and suicidal behaviours. In recent years, the widespread popularity and flow of real time information sharing of social media have allowed for potential early intervention in large scale and even small scale populations. However, some automated approaches to extract psychiatric stressors from Twitter have been presented, but most of this research has been for non Persian languages. This study aims to investigate the techniques of detecting psychological stress related to suicide from Persian tweets using learning based methods. The proposed capsule based approach achieved a binary classification accuracy of 0.83.",
    "link": "https://arxiv.org/abs/2403.15391",
    "context": "Title: CapsF: Capsule Fusion for Extracting psychiatric stressors for suicide from twitter\nAbstract: arXiv:2403.15391v1 Announce Type: new  Abstract: Along with factors such as cancer, blood pressure, street accidents and stroke, suicide has been one of Iran main causes of death. One of the main reasons for suicide is psychological stressors. Identifying psychological stressors in an at risk population can help in the early prevention of suicidal and suicidal behaviours. In recent years, the widespread popularity and flow of real time information sharing of social media have allowed for potential early intervention in large scale and even small scale populations. However, some automated approaches to extract psychiatric stressors from Twitter have been presented, but most of this research has been for non Persian languages. This study aims to investigate the techniques of detecting psychological stress related to suicide from Persian tweets using learning based methods. The proposed capsule based approach achieved a binary classification accuracy of 0.83.",
    "path": "papers/24/03/2403.15391.json",
    "total_tokens": 769,
    "translated_title": "CapsF: 用于从 Twitter 中提取自杀心理压力源的胶囊融合技术",
    "translated_abstract": "除癌症、血压、交通事故和中风等因素外，自杀一直是伊朗主要死因之一。自杀的主要原因之一是心理压力源。在处于风险人群中识别心理压力源有助于早期预防自杀和自杀行为。然而，一些自动化方法用于从 Twitter 提取心理压力源，但大多数研究都面向非波斯语言。本研究旨在利用基于学习的方法，从波斯语推文中检测与自杀相关的心理压力源技术。提出的基于胶囊的方法实现了0.83的二进制分级准确性。",
    "tldr": "该研究探索了一种基于胶囊的方法，用于从波斯语推文中检测与自杀相关的心理压力源，取得了不错的分类准确性。",
    "en_tdlr": "This study investigates a capsule-based approach for detecting psychological stressors related to suicide from Persian tweets, achieving a good classification accuracy of 0.83."
}