{
    "title": "Online Training of Large Language Models: Learn while chatting",
    "abstract": "arXiv:2403.04790v1 Announce Type: cross  Abstract: Large Language Models(LLMs) have dramatically revolutionized the field of Natural Language Processing(NLP), offering remarkable capabilities that have garnered widespread usage. However, existing interaction paradigms between LLMs and users are constrained by either inflexibility, limitations in customization, or a lack of persistent learning. This inflexibility is particularly evident as users, especially those without programming skills, have restricted avenues to enhance or personalize the model. Existing frameworks further complicate the model training and deployment process due to their computational inefficiencies and lack of user-friendly interfaces. To overcome these challenges, this paper introduces a novel interaction paradigm-'Online Training using External Interactions'-that merges the benefits of persistent, real-time model updates with the flexibility for individual customization through external interactions such as AI a",
    "link": "https://arxiv.org/abs/2403.04790",
    "context": "Title: Online Training of Large Language Models: Learn while chatting\nAbstract: arXiv:2403.04790v1 Announce Type: cross  Abstract: Large Language Models(LLMs) have dramatically revolutionized the field of Natural Language Processing(NLP), offering remarkable capabilities that have garnered widespread usage. However, existing interaction paradigms between LLMs and users are constrained by either inflexibility, limitations in customization, or a lack of persistent learning. This inflexibility is particularly evident as users, especially those without programming skills, have restricted avenues to enhance or personalize the model. Existing frameworks further complicate the model training and deployment process due to their computational inefficiencies and lack of user-friendly interfaces. To overcome these challenges, this paper introduces a novel interaction paradigm-'Online Training using External Interactions'-that merges the benefits of persistent, real-time model updates with the flexibility for individual customization through external interactions such as AI a",
    "path": "papers/24/03/2403.04790.json",
    "total_tokens": 715,
    "translated_title": "大型语言模型的在线训练：边聊天边学习",
    "translated_abstract": "大语言模型(LLMs)已经极大地改变了自然语言处理(NLP)领域，提供了引人注目的功能，受到了广泛的应用。然而，现有的LLMs与用户之间的互动范式受制于灵活性不足、定制化受限或缺乏持续性学习。为了克服这些挑战，本文引入了一种新的互动范式-“使用外部互动进行在线训练”，将持续、实时的模型更新与通过外部互动（如AI）进行个性化定制相结合。",
    "tldr": "本论文提出了一种新的互动范式，允许大型语言模型通过外部互动进行在线训练，实现了持续、实时的模型更新与个性化定制的灵活性。"
}