{
    "title": "EasyJailbreak: A Unified Framework for Jailbreaking Large Language Models",
    "abstract": "arXiv:2403.12171v1 Announce Type: cross  Abstract: Jailbreak attacks are crucial for identifying and mitigating the security vulnerabilities of Large Language Models (LLMs). They are designed to bypass safeguards and elicit prohibited outputs. However, due to significant differences among various jailbreak methods, there is no standard implementation framework available for the community, which limits comprehensive security evaluations. This paper introduces EasyJailbreak, a unified framework simplifying the construction and evaluation of jailbreak attacks against LLMs. It builds jailbreak attacks using four components: Selector, Mutator, Constraint, and Evaluator. This modular framework enables researchers to easily construct attacks from combinations of novel and existing components. So far, EasyJailbreak supports 11 distinct jailbreak methods and facilitates the security validation of a broad spectrum of LLMs. Our validation across 10 distinct LLMs reveals a significant vulnerabilit",
    "link": "https://arxiv.org/abs/2403.12171",
    "context": "Title: EasyJailbreak: A Unified Framework for Jailbreaking Large Language Models\nAbstract: arXiv:2403.12171v1 Announce Type: cross  Abstract: Jailbreak attacks are crucial for identifying and mitigating the security vulnerabilities of Large Language Models (LLMs). They are designed to bypass safeguards and elicit prohibited outputs. However, due to significant differences among various jailbreak methods, there is no standard implementation framework available for the community, which limits comprehensive security evaluations. This paper introduces EasyJailbreak, a unified framework simplifying the construction and evaluation of jailbreak attacks against LLMs. It builds jailbreak attacks using four components: Selector, Mutator, Constraint, and Evaluator. This modular framework enables researchers to easily construct attacks from combinations of novel and existing components. So far, EasyJailbreak supports 11 distinct jailbreak methods and facilitates the security validation of a broad spectrum of LLMs. Our validation across 10 distinct LLMs reveals a significant vulnerabilit",
    "path": "papers/24/03/2403.12171.json",
    "total_tokens": 889,
    "translated_title": "EasyJailbreak: 一个用于越狱大型语言模型的统一框架",
    "translated_abstract": "越狱攻击对于识别和减轻大型语言模型（LLMs）的安全漏洞至关重要。它们被设计用于绕过保障措施并引发被禁止的输出。然而，由于各种越狱方法之间存在显著差异，目前还没有针对社区提供标准实现框架，这限制了全面的安全评估。本文介绍了EasyJailbreak，一个统一框架，简化了针对LLMs进行越狱攻击的构建和评估。它使用四个组件来构建越狱攻击：选择器、变异器、约束器和评估器。这个模块化框架使研究人员可以轻松地从新的和现有组件的组合中构建攻击。到目前为止，EasyJailbreak支持11种不同的越狱方法，并促进了对广泛范围LLMs的安全验证。我们在10个不同的LLMs上的验证揭示了一个重要的漏洞。",
    "tldr": "EasyJailbreak是一个统一框架，简化了对LLMs进行越狱攻击的构建和评估，支持11种越狱方法，帮助进行广泛范围LLMs的安全验证。",
    "en_tdlr": "EasyJailbreak is a unified framework that simplifies the construction and evaluation of jailbreak attacks against LLMs, supporting 11 jailbreak methods to facilitate the security validation of a broad spectrum of LLMs."
}