{
    "title": "ChatCite: LLM Agent with Human Workflow Guidance for Comparative Literature Summary",
    "abstract": "arXiv:2403.02574v1 Announce Type: cross  Abstract: The literature review is an indispensable step in the research process. It provides the benefit of comprehending the research problem and understanding the current research situation while conducting a comparative analysis of prior works. However, literature summary is challenging and time consuming. The previous LLM-based studies on literature review mainly focused on the complete process, including literature retrieval, screening, and summarization. However, for the summarization step, simple CoT method often lacks the ability to provide extensive comparative summary. In this work, we firstly focus on the independent literature summarization step and introduce ChatCite, an LLM agent with human workflow guidance for comparative literature summary. This agent, by mimicking the human workflow, first extracts key elements from relevant literature and then generates summaries using a Reflective Incremental Mechanism. In order to better ev",
    "link": "https://arxiv.org/abs/2403.02574",
    "context": "Title: ChatCite: LLM Agent with Human Workflow Guidance for Comparative Literature Summary\nAbstract: arXiv:2403.02574v1 Announce Type: cross  Abstract: The literature review is an indispensable step in the research process. It provides the benefit of comprehending the research problem and understanding the current research situation while conducting a comparative analysis of prior works. However, literature summary is challenging and time consuming. The previous LLM-based studies on literature review mainly focused on the complete process, including literature retrieval, screening, and summarization. However, for the summarization step, simple CoT method often lacks the ability to provide extensive comparative summary. In this work, we firstly focus on the independent literature summarization step and introduce ChatCite, an LLM agent with human workflow guidance for comparative literature summary. This agent, by mimicking the human workflow, first extracts key elements from relevant literature and then generates summaries using a Reflective Incremental Mechanism. In order to better ev",
    "path": "papers/24/03/2403.02574.json",
    "total_tokens": 827,
    "translated_title": "ChatCite：LLM代理与人工工作流引导用于比较文学综述",
    "translated_abstract": "arXiv:2403.02574v1 公告类型：跨学科 摘要：文献综述是研究过程中不可或缺的一步。它有助于理解研究问题，并在进行以往作品比较分析时了解当前研究情况。然而，文献总结是具有挑战性和耗时的。先前基于LLM的文献综述研究主要集中在完整过程，包括文献检索、筛选和总结。然而，对于总结步骤，简单的CoT方法往往缺乏提供广泛比较总结的能力。在这项工作中，我们首先专注于独立文献总结步骤并引入ChatCite，一个具有人工工作流引导用于比较文学综述的LLM代理。该代理通过模仿人类工作流，首先从相关文献中提取关键要素，然后使用反思逐步机制生成摘要。",
    "tldr": "ChatCite是一个LLM代理，通过人工工作流引导进行比较文学综述，利用反思逐步机制生成摘要。",
    "en_tdlr": "ChatCite is an LLM agent guided by human workflow for comparative literature summary, utilizing a reflective incremental mechanism for generating summaries."
}