{
    "title": "Entropy is not Enough for Test-Time Adaptation: From the Perspective of Disentangled Factors",
    "abstract": "arXiv:2403.07366v1 Announce Type: cross  Abstract: Test-time adaptation (TTA) fine-tunes pre-trained deep neural networks for unseen test data. The primary challenge of TTA is limited access to the entire test dataset during online updates, causing error accumulation. To mitigate it, TTA methods have utilized the model output's entropy as a confidence metric that aims to determine which samples have a lower likelihood of causing error. Through experimental studies, however, we observed the unreliability of entropy as a confidence metric for TTA under biased scenarios and theoretically revealed that it stems from the neglect of the influence of latent disentangled factors of data on predictions. Building upon these findings, we introduce a novel TTA method named Destroy Your Object (DeYO), which leverages a newly proposed confidence metric named Pseudo-Label Probability Difference (PLPD). PLPD quantifies the influence of the shape of an object on prediction by measuring the difference b",
    "link": "https://arxiv.org/abs/2403.07366",
    "context": "Title: Entropy is not Enough for Test-Time Adaptation: From the Perspective of Disentangled Factors\nAbstract: arXiv:2403.07366v1 Announce Type: cross  Abstract: Test-time adaptation (TTA) fine-tunes pre-trained deep neural networks for unseen test data. The primary challenge of TTA is limited access to the entire test dataset during online updates, causing error accumulation. To mitigate it, TTA methods have utilized the model output's entropy as a confidence metric that aims to determine which samples have a lower likelihood of causing error. Through experimental studies, however, we observed the unreliability of entropy as a confidence metric for TTA under biased scenarios and theoretically revealed that it stems from the neglect of the influence of latent disentangled factors of data on predictions. Building upon these findings, we introduce a novel TTA method named Destroy Your Object (DeYO), which leverages a newly proposed confidence metric named Pseudo-Label Probability Difference (PLPD). PLPD quantifies the influence of the shape of an object on prediction by measuring the difference b",
    "path": "papers/24/03/2403.07366.json",
    "total_tokens": 897,
    "translated_title": "熵对于测试时适应性来说还不够：从解缠分因素的角度看",
    "translated_abstract": "测试时适应性（TTA）微调预训练的深度神经网络以适应未知的测试数据。TTA的主要挑战是在线更新过程中对整个测试数据集的有限访问，导致误差累积。为了减轻这种情况，TTA方法利用模型输出的熵作为置信度度量，旨在确定哪些样本更不可能导致错误。然而，通过实验研究，我们观察到在偏倚场景下熵作为TTA的置信度度量是不可靠的，理论上揭示了这种不可靠性源于忽视数据的潜在解缠分因素对预测的影响。基于这些发现，我们提出了一种名为Destroy Your Object（DeYO）的新型TTA方法，它利用了一种新提出的置信度度量，名为伪标签概率差（PLPD）。PLPD通过测量对象形状对预测的影响程度来量化。",
    "tldr": "研究显示熵作为测试时适应性的置信度度量在偏倚场景下不可靠，本文提出了一种新的测试时适应性方法DeYO，利用Pseudo-Label Probability Difference（PLPD）作为置信度度量",
    "en_tdlr": "The study demonstrates the unreliability of using entropy as a confidence metric for test-time adaptation under biased scenarios, and proposes a novel test-time adaptation method, DeYO, which leverages Pseudo-Label Probability Difference (PLPD) as a confidence metric."
}