{
    "title": "Touch the Core: Exploring Task Dependence Among Hybrid Targets for Recommendation",
    "abstract": "arXiv:2403.17442v1 Announce Type: new  Abstract: As user behaviors become complicated on business platforms, online recommendations focus more on how to touch the core conversions, which are highly related to the interests of platforms. These core conversions are usually continuous targets, such as \\textit{watch time}, \\textit{revenue}, and so on, whose predictions can be enhanced by previous discrete conversion actions. Therefore, multi-task learning (MTL) can be adopted as the paradigm to learn these hybrid targets. However, existing works mainly emphasize investigating the sequential dependence among discrete conversion actions, which neglects the complexity of dependence between discrete conversions and the final continuous conversion. Moreover, simultaneously optimizing hybrid tasks with stronger task dependence will suffer from volatile issues where the core regression task might have a larger influence on other tasks. In this paper, we study the MTL problem with hybrid targets f",
    "link": "https://arxiv.org/abs/2403.17442",
    "context": "Title: Touch the Core: Exploring Task Dependence Among Hybrid Targets for Recommendation\nAbstract: arXiv:2403.17442v1 Announce Type: new  Abstract: As user behaviors become complicated on business platforms, online recommendations focus more on how to touch the core conversions, which are highly related to the interests of platforms. These core conversions are usually continuous targets, such as \\textit{watch time}, \\textit{revenue}, and so on, whose predictions can be enhanced by previous discrete conversion actions. Therefore, multi-task learning (MTL) can be adopted as the paradigm to learn these hybrid targets. However, existing works mainly emphasize investigating the sequential dependence among discrete conversion actions, which neglects the complexity of dependence between discrete conversions and the final continuous conversion. Moreover, simultaneously optimizing hybrid tasks with stronger task dependence will suffer from volatile issues where the core regression task might have a larger influence on other tasks. In this paper, we study the MTL problem with hybrid targets f",
    "path": "papers/24/03/2403.17442.json",
    "total_tokens": 858,
    "translated_title": "触及核心：探索混合目标推荐中任务依赖关系",
    "translated_abstract": "随着用户行为在商业平台上变得复杂，在线推荐更加关注如何触及核心转化，这些转化与平台的兴趣密切相关。这些核心转化通常是连续的目标，如“观看时间”、“收入”等，它们的预测可以通过之前的离散转化行为来增强。因此，多任务学习（MTL）可以被采用作为学习这些混合目标的范 paradigm。然而，现有的工作主要强调研究离散转化行为之间的顺序依赖关系，而忽视了离散转化与最终连续转化之间的依赖复杂性。此外，同时优化具有更强任务依赖性的混合任务将面临不稳定的问题，其中核心回归任务可能对其他任务产生更大的影响。在本文中，我们研究了具有混合目标的MTL问题。",
    "tldr": "在混合目标推荐中，通过研究多任务学习问题，探讨了离散转化行为与连续转化之间的依赖关系，解决了核心回归任务对其他任务影响较大的问题。",
    "en_tdlr": "Investigating the dependence between discrete conversion actions and continuous conversion in hybrid target recommendation through multi-task learning, addressing the issue of core regression task having a larger influence on other tasks."
}