{
    "title": "Routing and Scheduling in Answer Set Programming applied to Multi-Agent Path Finding: Preliminary Report",
    "abstract": "arXiv:2403.12153v1 Announce Type: new  Abstract: We present alternative approaches to routing and scheduling in Answer Set Programming (ASP), and explore them in the context of Multi-agent Path Finding. The idea is to capture the flow of time in terms of partial orders rather than time steps attached to actions and fluents. This also abolishes the need for fixed upper bounds on the length of plans. The trade-off for this avoidance is that (parts of) temporal trajectories must be acyclic, since multiple occurrences of the same action or fluent cannot be distinguished anymore. While this approach provides an interesting alternative for modeling routing, it is without alternative for scheduling since fine-grained timings cannot be represented in ASP in a feasible way. This is different for partial orders that can be efficiently handled by external means such as acyclicity and difference constraints. We formally elaborate upon this idea and present several resulting ASP encodings. Finally,",
    "link": "https://arxiv.org/abs/2403.12153",
    "context": "Title: Routing and Scheduling in Answer Set Programming applied to Multi-Agent Path Finding: Preliminary Report\nAbstract: arXiv:2403.12153v1 Announce Type: new  Abstract: We present alternative approaches to routing and scheduling in Answer Set Programming (ASP), and explore them in the context of Multi-agent Path Finding. The idea is to capture the flow of time in terms of partial orders rather than time steps attached to actions and fluents. This also abolishes the need for fixed upper bounds on the length of plans. The trade-off for this avoidance is that (parts of) temporal trajectories must be acyclic, since multiple occurrences of the same action or fluent cannot be distinguished anymore. While this approach provides an interesting alternative for modeling routing, it is without alternative for scheduling since fine-grained timings cannot be represented in ASP in a feasible way. This is different for partial orders that can be efficiently handled by external means such as acyclicity and difference constraints. We formally elaborate upon this idea and present several resulting ASP encodings. Finally,",
    "path": "papers/24/03/2403.12153.json",
    "total_tokens": 802,
    "translated_title": "运用答案集编程的路由和调度在多智能体路径规划中的应用：初步报告",
    "translated_abstract": "我们提出了在答案集编程（ASP）中进行路由和调度的替代方法，并在多智能体路径规划的背景下探讨它们。这个想法是以偏序而不是与行动和事件相关的时间步来捕捉时间流逝。这也消除了计划长度的固定上界的需要。这种避免的代价是（部分）时间轨迹必须是无环的，因为无法再区分同一行动或事件的多次发生。虽然这种方法为建模路由提供了一个有趣的替代方案，但由于ASP无法以可行的方式表示细粒度的时间安排，因此它在调度方面无替代品。这与偏序不同，偏序可以通过外部手段（如无环和差异约束）高效处理。我们从理论上阐述了这个想法，并提出了几个由此产生的ASP编码。",
    "tldr": "提出了在答案集编程中捕捉时间流逝的替代方法，这在建模路由方面是一种有趣的选择，但在调度方面却是不存在替代方案的。"
}