{
    "title": "Reservoir Computing Using Measurement-Controlled Quantum Dynamics",
    "abstract": "arXiv:2403.01024v1 Announce Type: cross  Abstract: Physical reservoir computing (RC) is a machine learning algorithm that employs the dynamics of a physical system to forecast highly nonlinear and chaotic phenomena. In this paper, we introduce a quantum RC system that employs the dynamics of a probed atom in a cavity. The atom experiences coherent driving at a particular rate, leading to a measurement-controlled quantum evolution. The proposed quantum reservoir can make fast and reliable forecasts using a small number of artificial neurons compared with the traditional RC algorithm. We theoretically validate the operation of the reservoir, demonstrating its potential to be used in error-tolerant applications, where approximate computing approaches may be used to make feasible forecasts in conditions of limited computational and energy resources.",
    "link": "https://arxiv.org/abs/2403.01024",
    "context": "Title: Reservoir Computing Using Measurement-Controlled Quantum Dynamics\nAbstract: arXiv:2403.01024v1 Announce Type: cross  Abstract: Physical reservoir computing (RC) is a machine learning algorithm that employs the dynamics of a physical system to forecast highly nonlinear and chaotic phenomena. In this paper, we introduce a quantum RC system that employs the dynamics of a probed atom in a cavity. The atom experiences coherent driving at a particular rate, leading to a measurement-controlled quantum evolution. The proposed quantum reservoir can make fast and reliable forecasts using a small number of artificial neurons compared with the traditional RC algorithm. We theoretically validate the operation of the reservoir, demonstrating its potential to be used in error-tolerant applications, where approximate computing approaches may be used to make feasible forecasts in conditions of limited computational and energy resources.",
    "path": "papers/24/03/2403.01024.json",
    "total_tokens": 760,
    "translated_title": "利用测量控制的量子动力学的水库计算",
    "translated_abstract": "物理水库计算（RC）是一种机器学习算法，利用物理系统的动力学来预测高度非线性和混沌现象。本文介绍了一种利用腔中被探测原子的动力学的量子RC系统。原子以特定速率经历相干驱动，导致测量控制的量子演化。所提出的量子水库可以使用较少数量的人工神经元进行快速和可靠的预测，与传统RC算法相比。我们在理论上验证了水库的运作，展示了它在容错应用中的潜力，其中近似计算方法可用于在有限的计算和能源资源条件下进行可行的预测。",
    "tldr": "该研究介绍了一种利用测量控制的量子动力学的水库计算系统，相较于传统的水库计算算法，它可以使用少量人工神经元实现快速可靠的预测，有潜力在容错应用中使用。",
    "en_tdlr": "This paper introduces a quantum reservoir computing system based on measurement-controlled quantum dynamics, which can achieve fast and reliable predictions using a small number of artificial neurons compared to traditional reservoir computing algorithms, showing potential for error-tolerant applications."
}