{
    "title": "How Multimodal Integration Boost the Performance of LLM for Optimization: Case Study on Capacitated Vehicle Routing Problems",
    "abstract": "arXiv:2403.01757v1 Announce Type: new  Abstract: Recently, large language models (LLMs) have notably positioned them as capable tools for addressing complex optimization challenges. Despite this recognition, a predominant limitation of existing LLM-based optimization methods is their struggle to capture the relationships among decision variables when relying exclusively on numerical text prompts, especially in high-dimensional problems. Keeping this in mind, we first propose to enhance the optimization performance using multimodal LLM capable of processing both textual and visual prompts for deeper insights of the processed optimization problem. This integration allows for a more comprehensive understanding of optimization problems, akin to human cognitive processes. We have developed a multimodal LLM-based optimization framework that simulates human problem-solving workflows, thereby offering a more nuanced and effective analysis. The efficacy of this method is evaluated through exten",
    "link": "https://arxiv.org/abs/2403.01757",
    "context": "Title: How Multimodal Integration Boost the Performance of LLM for Optimization: Case Study on Capacitated Vehicle Routing Problems\nAbstract: arXiv:2403.01757v1 Announce Type: new  Abstract: Recently, large language models (LLMs) have notably positioned them as capable tools for addressing complex optimization challenges. Despite this recognition, a predominant limitation of existing LLM-based optimization methods is their struggle to capture the relationships among decision variables when relying exclusively on numerical text prompts, especially in high-dimensional problems. Keeping this in mind, we first propose to enhance the optimization performance using multimodal LLM capable of processing both textual and visual prompts for deeper insights of the processed optimization problem. This integration allows for a more comprehensive understanding of optimization problems, akin to human cognitive processes. We have developed a multimodal LLM-based optimization framework that simulates human problem-solving workflows, thereby offering a more nuanced and effective analysis. The efficacy of this method is evaluated through exten",
    "path": "papers/24/03/2403.01757.json",
    "total_tokens": 813,
    "translated_title": "多模态集成如何提升LLM在优化中的性能：以容量车辆路径问题为案例研究",
    "translated_abstract": "最近，大型语言模型（LLMs）已明显地将它们定位为解决复杂优化挑战的工具。尽管被认可，现有基于LLM的优化方法的一个主要限制是，在仅依赖于数字文本提示时，尤其是在高维问题中，难以捕捉决策变量之间的关系。鉴于此，我们首先提出使用多模态LLM来增强优化性能，它能够处理文本和视觉提示，深入了解处理的优化问题。这种集成允许更全面地理解优化问题，类似于人类认知过程。我们开发了一个基于多模态LLM的优化框架，模拟人类解决问题的工作流程，从而提供更细致和有效的分析。该方法的有效性通过扩展进行评估。",
    "tldr": "提出了一种使用多模态LLM进行优化的框架，能够更全面地理解优化问题，类似于人类认知过程，并且提供了更细致和有效的分析。",
    "en_tdlr": "Proposing a framework that utilizes multimodal LLM for optimization, allowing for a more comprehensive understanding of optimization problems akin to human cognitive processes, and offering a more nuanced and effective analysis."
}