{
    "title": "Enhancing Medical Support in the Arabic Language Through Personalized ChatGPT Assistance",
    "abstract": "arXiv:2403.15501v1 Announce Type: new  Abstract: This Paper discusses the growing popularity of online medical diagnosis as an alternative to traditional doctor visits. It highlights the limitations of existing tools and emphasizes the advantages of using ChatGPT, which provides real-time, personalized medical diagnosis at no cost. The paragraph summarizes a research study that evaluated the performance of ChatGPT in Arabic medical diagnosis. The study involved compiling a dataset of disease information and generating multiple messages for each disease using different prompting techniques. ChatGPT's performance was assessed by measuring the similarity between its responses and the actual diseases. The results showed promising performance, with average scores of around 76% for similarity measures. Various prompting techniques were used, and chain prompting demonstrated a relative advantage. The study also recorded an average response time of 6.12 seconds for the ChatGPT API, which is co",
    "link": "https://arxiv.org/abs/2403.15501",
    "context": "Title: Enhancing Medical Support in the Arabic Language Through Personalized ChatGPT Assistance\nAbstract: arXiv:2403.15501v1 Announce Type: new  Abstract: This Paper discusses the growing popularity of online medical diagnosis as an alternative to traditional doctor visits. It highlights the limitations of existing tools and emphasizes the advantages of using ChatGPT, which provides real-time, personalized medical diagnosis at no cost. The paragraph summarizes a research study that evaluated the performance of ChatGPT in Arabic medical diagnosis. The study involved compiling a dataset of disease information and generating multiple messages for each disease using different prompting techniques. ChatGPT's performance was assessed by measuring the similarity between its responses and the actual diseases. The results showed promising performance, with average scores of around 76% for similarity measures. Various prompting techniques were used, and chain prompting demonstrated a relative advantage. The study also recorded an average response time of 6.12 seconds for the ChatGPT API, which is co",
    "path": "papers/24/03/2403.15501.json",
    "total_tokens": 851,
    "translated_title": "通过个性化ChatGPT辅助增强阿拉伯语医疗支持",
    "translated_abstract": "这篇论文讨论了在线医疗诊断与传统看医生方式之间日益增长的受欢迎程度。它强调了现有工具的局限性，并强调了使用ChatGPT的优势，ChatGPT可以提供实时的个性化医疗诊断，而且是免费的。该段落总结了一项评估ChatGPT在阿拉伯语医疗诊断中性能的研究。该研究涉及编制疾病信息的数据集，并使用不同的提示技术为每种疾病生成多条消息。通过测量其响应与实际疾病之间的相似度来评估ChatGPT的性能。结果显示出令人鼓舞的表现，相似度评估的平均分数约为76%。使用了各种提示技术，链式提示展现出相对优势。该研究还记录了ChatGPT API的平均响应时间为6.12秒。",
    "tldr": "通过使用ChatGPT在阿拉伯语医疗诊断中取得了有希望的性能，平均相似度评分为76%，链式提示技术相对有优势。"
}