{
    "title": "Leveraging Large Language Models for Fuzzy String Matching in Political Science",
    "abstract": "arXiv:2403.18218v1 Announce Type: new  Abstract: Fuzzy string matching remains a key issue when political scientists combine data from different sources. Existing matching methods invariably rely on string distances, such as Levenshtein distance and cosine similarity. As such, they are inherently incapable of matching strings that refer to the same entity with different names such as ''JP Morgan'' and ''Chase Bank'', ''DPRK'' and ''North Korea'', ''Chuck Fleischmann (R)'' and ''Charles Fleischmann (R)''. In this letter, we propose to use large language models to entirely sidestep this problem in an easy and intuitive manner. Extensive experiments show that our proposed methods can improve the state of the art by as much as 39% in terms of average precision while being substantially easier and more intuitive to use by political scientists. Moreover, our results are robust against various temperatures. We further note that enhanced prompting can lead to additional performance improvement",
    "link": "https://arxiv.org/abs/2403.18218",
    "context": "Title: Leveraging Large Language Models for Fuzzy String Matching in Political Science\nAbstract: arXiv:2403.18218v1 Announce Type: new  Abstract: Fuzzy string matching remains a key issue when political scientists combine data from different sources. Existing matching methods invariably rely on string distances, such as Levenshtein distance and cosine similarity. As such, they are inherently incapable of matching strings that refer to the same entity with different names such as ''JP Morgan'' and ''Chase Bank'', ''DPRK'' and ''North Korea'', ''Chuck Fleischmann (R)'' and ''Charles Fleischmann (R)''. In this letter, we propose to use large language models to entirely sidestep this problem in an easy and intuitive manner. Extensive experiments show that our proposed methods can improve the state of the art by as much as 39% in terms of average precision while being substantially easier and more intuitive to use by political scientists. Moreover, our results are robust against various temperatures. We further note that enhanced prompting can lead to additional performance improvement",
    "path": "papers/24/03/2403.18218.json",
    "total_tokens": 839,
    "translated_title": "利用大型语言模型进行政治科学中模糊字符串匹配",
    "translated_abstract": "模糊字符串匹配在政治科学家从不同来源组合数据时仍然是一个关键问题。现有的匹配方法通常依赖于字符串距离，如Levenshtein距离和余弦相似度。因此，它们无法匹配那些用不同名称指代同一实体的字符串，比如“JP Morgan”和“Chase Bank”，“DPRK”和“北韩”，“Chuck Fleischmann（R）”和“Charles Fleischmann（R）”。在这封信中，我们提议使用大型语言模型完全规避这个问题，以一种简单直观的方式。大量实验证明，我们提出的方法可以在平均精度方面将业界水平提高多达39%，同时政治科学家使用起来更加简单直观。此外，我们的结果对各种温度变化具有鲁棒性。我们进一步注意到，更好的提示可以带来额外的性能提升。",
    "tldr": "提出利用大型语言模型来解决政治科学中模糊字符串匹配问题，可显著提高平均精度达39%，更易使用且具有鲁棒性",
    "en_tdlr": "Proposing to use large language models to address fuzzy string matching in political science, significantly improving average precision by up to 39%, being more user-friendly and robust."
}