{
    "title": "Knowledge Transfer across Multiple Principal Component Analysis Studies",
    "abstract": "arXiv:2403.07431v1 Announce Type: cross  Abstract: Transfer learning has aroused great interest in the statistical community. In this article, we focus on knowledge transfer for unsupervised learning tasks in contrast to the supervised learning tasks in the literature. Given the transferable source populations, we propose a two-step transfer learning algorithm to extract useful information from multiple source principal component analysis (PCA) studies, thereby enhancing estimation accuracy for the target PCA task. In the first step, we integrate the shared subspace information across multiple studies by a proposed method named as Grassmannian barycenter, instead of directly performing PCA on the pooled dataset. The proposed Grassmannian barycenter method enjoys robustness and computational advantages in more general cases. Then the resulting estimator for the shared subspace from the first step is further utilized to estimate the target private subspace in the second step. Our theoret",
    "link": "https://arxiv.org/abs/2403.07431",
    "context": "Title: Knowledge Transfer across Multiple Principal Component Analysis Studies\nAbstract: arXiv:2403.07431v1 Announce Type: cross  Abstract: Transfer learning has aroused great interest in the statistical community. In this article, we focus on knowledge transfer for unsupervised learning tasks in contrast to the supervised learning tasks in the literature. Given the transferable source populations, we propose a two-step transfer learning algorithm to extract useful information from multiple source principal component analysis (PCA) studies, thereby enhancing estimation accuracy for the target PCA task. In the first step, we integrate the shared subspace information across multiple studies by a proposed method named as Grassmannian barycenter, instead of directly performing PCA on the pooled dataset. The proposed Grassmannian barycenter method enjoys robustness and computational advantages in more general cases. Then the resulting estimator for the shared subspace from the first step is further utilized to estimate the target private subspace in the second step. Our theoret",
    "path": "papers/24/03/2403.07431.json",
    "total_tokens": 801,
    "translated_title": "跨多个主成分分析研究的知识转移",
    "translated_abstract": "Transfer learning在统计领域引起了极大兴趣。本文关注于无监督学习任务的知识转移，与文献中的监督学习任务相对比。在给定可转移的源人口的情况下，我们提出了一个两步的转移学习算法，从多个源主成分分析（PCA）研究中提取有用信息，从而增强目标PCA任务的估计准确性。第一步中，我们通过一种名为Grassmannian barycenter的方法，整合跨多个研究共享的子空间信息，而不是直接在汇总数据集上执行PCA。提出的Grassmannian barycenter方法在更一般的情况下具有鲁棒性和计算优势。然后，第一步得到的共享子空间的估计器进一步用于估计第二步中的目标私有子空间。",
    "tldr": "提出了一种跨多个主成分分析研究的知识转移算法，通过整合多个研究中共享的子空间信息来增强目标PCA任务的估计准确性。",
    "en_tdlr": "Proposed a knowledge transfer algorithm across multiple principal component analysis studies to enhance estimation accuracy for the target PCA task by integrating shared subspace information from multiple studies."
}