{
    "title": "RU22Fact: Optimizing Evidence for Multilingual Explainable Fact-Checking on Russia-Ukraine Conflict",
    "abstract": "arXiv:2403.16662v1 Announce Type: new  Abstract: Fact-checking is the task of verifying the factuality of a given claim by examining the available evidence. High-quality evidence plays a vital role in enhancing fact-checking systems and facilitating the generation of explanations that are understandable to humans. However, the provision of both sufficient and relevant evidence for explainable fact-checking systems poses a challenge. To tackle this challenge, we propose a method based on a Large Language Model to automatically retrieve and summarize evidence from the Web. Furthermore, we construct RU22Fact, a novel multilingual explainable fact-checking dataset on the Russia-Ukraine conflict in 2022 of 16K samples, each containing real-world claims, optimized evidence, and referenced explanation. To establish a baseline for our dataset, we also develop an end-to-end explainable fact-checking system to verify claims and generate explanations. Experimental results demonstrate the prospect",
    "link": "https://arxiv.org/abs/2403.16662",
    "context": "Title: RU22Fact: Optimizing Evidence for Multilingual Explainable Fact-Checking on Russia-Ukraine Conflict\nAbstract: arXiv:2403.16662v1 Announce Type: new  Abstract: Fact-checking is the task of verifying the factuality of a given claim by examining the available evidence. High-quality evidence plays a vital role in enhancing fact-checking systems and facilitating the generation of explanations that are understandable to humans. However, the provision of both sufficient and relevant evidence for explainable fact-checking systems poses a challenge. To tackle this challenge, we propose a method based on a Large Language Model to automatically retrieve and summarize evidence from the Web. Furthermore, we construct RU22Fact, a novel multilingual explainable fact-checking dataset on the Russia-Ukraine conflict in 2022 of 16K samples, each containing real-world claims, optimized evidence, and referenced explanation. To establish a baseline for our dataset, we also develop an end-to-end explainable fact-checking system to verify claims and generate explanations. Experimental results demonstrate the prospect",
    "path": "papers/24/03/2403.16662.json",
    "total_tokens": 891,
    "translated_title": "RU22Fact：优化多语言可解释事实核查中的证据",
    "translated_abstract": "事实核查是通过检查现有证据来验证给定声明的准确性的任务。高质量的证据在增强事实核查系统并促进生成可理解的解释方面发挥着至关重要的作用。然而，为可解释的事实核查系统提供足够和相关的证据是一项挑战。为了解决这一挑战，我们提出了一种基于大型语言模型的方法，可以自动从网络中检索和总结证据。此外，我们构建了RU22Fact，这是一个关于2022年俄乌冲突的新型多语言可解释事实核查数据集，包含1.6万个样本，每个样本都包含现实世界的声明、优化证据和引用的解释。为了为我们的数据集建立基准，我们还开发了一个端到端可解释的事实核查系统，用于核实声明并生成解释。实验结果显示了前景。",
    "tldr": "提出了一个基于大型语言模型的方法，用于自动检索和总结网络中的证据，构建了RU22Fact数据集，是关于2022年俄乌冲突的多语言可解释事实核查数据集，同时开发了端到端可解释的事实核查系统来验证声明并生成解释。",
    "en_tdlr": "Proposed a method based on a Large Language Model for automatically retrieving and summarizing evidence from the Web, constructed the RU22Fact dataset on the Russia-Ukraine conflict in 2022 for multilingual explainable fact-checking, and developed an end-to-end explainable fact-checking system to verify claims and generate explanations."
}