{
    "title": "Model-Based Data-Centric AI: Bridging the Divide Between Academic Ideals and Industrial Pragmatism",
    "abstract": "arXiv:2403.01832v1 Announce Type: new  Abstract: This paper delves into the contrasting roles of data within academic and industrial spheres, highlighting the divergence between Data-Centric AI and Model-Agnostic AI approaches. We argue that while Data-Centric AI focuses on the primacy of high-quality data for model performance, Model-Agnostic AI prioritizes algorithmic flexibility, often at the expense of data quality considerations. This distinction reveals that academic standards for data quality frequently do not meet the rigorous demands of industrial applications, leading to potential pitfalls in deploying academic models in real-world settings. Through a comprehensive analysis, we address these disparities, presenting both the challenges they pose and strategies for bridging the gap. Furthermore, we propose a novel paradigm: Model-Based Data-Centric AI, which aims to reconcile these differences by integrating model considerations into data optimization processes. This approach u",
    "link": "https://arxiv.org/abs/2403.01832",
    "context": "Title: Model-Based Data-Centric AI: Bridging the Divide Between Academic Ideals and Industrial Pragmatism\nAbstract: arXiv:2403.01832v1 Announce Type: new  Abstract: This paper delves into the contrasting roles of data within academic and industrial spheres, highlighting the divergence between Data-Centric AI and Model-Agnostic AI approaches. We argue that while Data-Centric AI focuses on the primacy of high-quality data for model performance, Model-Agnostic AI prioritizes algorithmic flexibility, often at the expense of data quality considerations. This distinction reveals that academic standards for data quality frequently do not meet the rigorous demands of industrial applications, leading to potential pitfalls in deploying academic models in real-world settings. Through a comprehensive analysis, we address these disparities, presenting both the challenges they pose and strategies for bridging the gap. Furthermore, we propose a novel paradigm: Model-Based Data-Centric AI, which aims to reconcile these differences by integrating model considerations into data optimization processes. This approach u",
    "path": "papers/24/03/2403.01832.json",
    "total_tokens": 886,
    "translated_title": "基于模型的数据中心人工智能：弥合学术理想与工业实用之间的鸿沟",
    "translated_abstract": "本文探讨了学术和工业领域内数据的对比角色，突出了数据中心人工智能和模型无关人工智能方法之间的分歧。我们认为，数据中心人工智能侧重于高质量数据对模型性能的首要性，而模型无关人工智能则优先考虑算法灵活性，往往以牺牲数据质量考虑为代价。这种区别显示，学术界对数据质量的标准往往不能满足工业应用的严格要求，从而导致在实际环境中部署学术模型的潜在问题。通过全面分析，我们解决了这些差异，提出了它们带来的挑战以及弥合差距的策略。此外，我们提出了一种新范式：基于模型的数据中心人工智能，旨在通过将模型考虑融入数据优化过程来调和这些差异。这种方法",
    "tldr": "本文提出了一种新的模型-Based Data-Centric AI 范式，旨在解决学术界数据质量和工业应用之间的差异，并提出了整合模型考虑到数据优化过程中的策略。"
}