{
    "title": "Discover and Mitigate Multiple Biased Subgroups in Image Classifiers",
    "abstract": "arXiv:2403.12777v1 Announce Type: cross  Abstract: Machine learning models can perform well on in-distribution data but often fail on biased subgroups that are underrepresented in the training data, hindering the robustness of models for reliable applications. Such subgroups are typically unknown due to the absence of subgroup labels. Discovering biased subgroups is the key to understanding models' failure modes and further improving models' robustness. Most previous works of subgroup discovery make an implicit assumption that models only underperform on a single biased subgroup, which does not hold on in-the-wild data where multiple biased subgroups exist.   In this work, we propose Decomposition, Interpretation, and Mitigation (DIM), a novel method to address a more challenging but also more practical problem of discovering multiple biased subgroups in image classifiers. Our approach decomposes the image features into multiple components that represent multiple subgroups. This decomp",
    "link": "https://arxiv.org/abs/2403.12777",
    "context": "Title: Discover and Mitigate Multiple Biased Subgroups in Image Classifiers\nAbstract: arXiv:2403.12777v1 Announce Type: cross  Abstract: Machine learning models can perform well on in-distribution data but often fail on biased subgroups that are underrepresented in the training data, hindering the robustness of models for reliable applications. Such subgroups are typically unknown due to the absence of subgroup labels. Discovering biased subgroups is the key to understanding models' failure modes and further improving models' robustness. Most previous works of subgroup discovery make an implicit assumption that models only underperform on a single biased subgroup, which does not hold on in-the-wild data where multiple biased subgroups exist.   In this work, we propose Decomposition, Interpretation, and Mitigation (DIM), a novel method to address a more challenging but also more practical problem of discovering multiple biased subgroups in image classifiers. Our approach decomposes the image features into multiple components that represent multiple subgroups. This decomp",
    "path": "papers/24/03/2403.12777.json",
    "total_tokens": 775,
    "translated_title": "在图像分类器中发现和减轻多个有偏子群体",
    "translated_abstract": "机器学习模型在分布数据上表现良好，但常常在训练数据中未充分代表的有偏子群体上失败，影响模型对可靠应用的抗干扰性。这些子群体通常由于缺乏子群体标签而未知。发现有偏子群体是理解模型失败模式并进一步提高模型鲁棒性的关键。本文提出了一种名为“分解、解释和减轻（DIM）”的新方法，以解决在图像分类器中发现多个有偏子群体这一更具挑战性但也更实际的问题。我们的方法将图像特征分解为代表多个子群体的多个组件。",
    "tldr": "提出了一种称为“分解、解释和减轻（DIM）”的新方法, 用于在图像分类器中发现和减轻多个有偏子群体，增强模型鲁棒性。"
}