{
    "title": "EXPLORA: A teacher-apprentice methodology for eliciting natural child-computer interactions",
    "abstract": "arXiv:2403.17264v1 Announce Type: cross  Abstract: Investigating child-computer interactions within their contexts is vital for designing technology that caters to children's needs. However, determining what aspects of context are relevant for designing child-centric technology remains a challenge. We introduce EXPLORA, a multimodal, multistage online methodology comprising three pivotal stages: (1) building a teacher-apprentice relationship,(2) learning from child-teachers, and (3) assessing and reinforcing researcher-apprentice learning. Central to EXPLORA is the collection of attitudinal data through pre-observation interviews, offering researchers a deeper understanding of children's characteristics and contexts. This informs subsequent online observations, allowing researchers to focus on frequent interactions. Furthermore, researchers can validate preliminary assumptions with children. A means-ends analysis framework aids in the systematic analysis of data, shedding light on cont",
    "link": "https://arxiv.org/abs/2403.17264",
    "context": "Title: EXPLORA: A teacher-apprentice methodology for eliciting natural child-computer interactions\nAbstract: arXiv:2403.17264v1 Announce Type: cross  Abstract: Investigating child-computer interactions within their contexts is vital for designing technology that caters to children's needs. However, determining what aspects of context are relevant for designing child-centric technology remains a challenge. We introduce EXPLORA, a multimodal, multistage online methodology comprising three pivotal stages: (1) building a teacher-apprentice relationship,(2) learning from child-teachers, and (3) assessing and reinforcing researcher-apprentice learning. Central to EXPLORA is the collection of attitudinal data through pre-observation interviews, offering researchers a deeper understanding of children's characteristics and contexts. This informs subsequent online observations, allowing researchers to focus on frequent interactions. Furthermore, researchers can validate preliminary assumptions with children. A means-ends analysis framework aids in the systematic analysis of data, shedding light on cont",
    "path": "papers/24/03/2403.17264.json",
    "total_tokens": 906,
    "translated_title": "EXPLORA：用于引发自然儿童-计算机交互的教师-学徒方法论",
    "translated_abstract": "调查儿童-计算机交互在其背景中的情况对于设计满足儿童需求的技术至关重要。然而，确定设计儿童为中心的技术的相关上下文方面仍然是一个挑战。我们介绍了EXPLORA，这是一个多模态、多阶段的在线方法，包括三个关键阶段：（1）建立教师-学徒关系，（2）向儿童教师学习，以及（3）评估和加强研究者-学徒学习。EXPLORA的核心是通过观前访谈收集态度数据，使研究人员更深入地了解儿童的特征和背景。这为随后的在线观察提供了信息，使研究人员可以关注频繁的互动。此外，研究人员可以与儿童验证初步假设。一种手段-目的分析框架有助于对数据进行系统分析，阐明...",
    "tldr": "EXPLORA是一个教师-学徒方法，通过预先观察访谈收集数据，帮助研究人员更深入地理解儿童特征和背景，从而设计出更符合儿童需求的技术。",
    "en_tdlr": "EXPLORA is a teacher-apprentice methodology that collects data through pre-observation interviews to help researchers gain a deeper understanding of children's characteristics and contexts for designing technology that better caters to children's needs."
}