{
    "title": "Thwarting Cybersecurity Attacks with Explainable Concept Drift",
    "abstract": "arXiv:2403.13023v1 Announce Type: cross  Abstract: Cyber-security attacks pose a significant threat to the operation of autonomous systems. Particularly impacted are the Heating, Ventilation, and Air Conditioning (HVAC) systems in smart buildings, which depend on data gathered by sensors and Machine Learning (ML) models using the captured data. As such, attacks that alter the readings of these sensors can severely affect the HVAC system operations impacting residents' comfort and energy reduction goals. Such attacks may induce changes in the online data distribution being fed to the ML models, violating the fundamental assumption of similarity in training and testing data distribution. This leads to a degradation in model prediction accuracy due to a phenomenon known as Concept Drift (CD) - the alteration in the relationship between input features and the target variable. Addressing CD requires identifying the source of drift to apply targeted mitigation strategies, a process termed dr",
    "link": "https://arxiv.org/abs/2403.13023",
    "context": "Title: Thwarting Cybersecurity Attacks with Explainable Concept Drift\nAbstract: arXiv:2403.13023v1 Announce Type: cross  Abstract: Cyber-security attacks pose a significant threat to the operation of autonomous systems. Particularly impacted are the Heating, Ventilation, and Air Conditioning (HVAC) systems in smart buildings, which depend on data gathered by sensors and Machine Learning (ML) models using the captured data. As such, attacks that alter the readings of these sensors can severely affect the HVAC system operations impacting residents' comfort and energy reduction goals. Such attacks may induce changes in the online data distribution being fed to the ML models, violating the fundamental assumption of similarity in training and testing data distribution. This leads to a degradation in model prediction accuracy due to a phenomenon known as Concept Drift (CD) - the alteration in the relationship between input features and the target variable. Addressing CD requires identifying the source of drift to apply targeted mitigation strategies, a process termed dr",
    "path": "papers/24/03/2403.13023.json",
    "total_tokens": 825,
    "translated_title": "用可解释的概念漂移防范网络安全攻击",
    "translated_abstract": "网络安全攻击对自主系统的运作构成重大威胁。特别受影响的是智能建筑中的暖通空调系统，其依赖于传感器和机器学习模型利用捕捉数据。攻击可能改变这些传感器的读数，严重影响暖通空调系统的运行，从而影响居民的舒适和节能目标。这种攻击可能导致在线数据分布的改变，违反了训练和测试数据分布相似性的基本假设。这导致模型预测准确性的下降，这是因为所谓的概念漂移（CD）–输入特征和目标变量之间关系的改变。解决CD需要识别漂移源并应用有针对性的缓解策略，这个过程被称为dr",
    "tldr": "该论文研究了如何利用可解释的概念漂移防范网络安全攻击，特别关注智能建筑中的暖通空调系统，通过识别漂移源来应用有针对性的缓解策略。",
    "en_tdlr": "This paper investigates how to thwart cybersecurity attacks using explainable concept drift, focusing on HVAC systems in smart buildings, by identifying the source of drift to apply targeted mitigation strategies."
}