{
    "title": "SeeGULL Multilingual: a Dataset of Geo-Culturally Situated Stereotypes",
    "abstract": "arXiv:2403.05696v1 Announce Type: new  Abstract: While generative multilingual models are rapidly being deployed, their safety and fairness evaluations are largely limited to resources collected in English. This is especially problematic for evaluations targeting inherently socio-cultural phenomena such as stereotyping, where it is important to build multi-lingual resources that reflect the stereotypes prevalent in respective language communities. However, gathering these resources, at scale, in varied languages and regions pose a significant challenge as it requires broad socio-cultural knowledge and can also be prohibitively expensive. To overcome this critical gap, we employ a recently introduced approach that couples LLM generations for scale with culturally situated validations for reliability, and build SeeGULL Multilingual, a global-scale multilingual dataset of social stereotypes, containing over 25K stereotypes, spanning 20 languages, with human annotations across 23 regions, ",
    "link": "https://arxiv.org/abs/2403.05696",
    "context": "Title: SeeGULL Multilingual: a Dataset of Geo-Culturally Situated Stereotypes\nAbstract: arXiv:2403.05696v1 Announce Type: new  Abstract: While generative multilingual models are rapidly being deployed, their safety and fairness evaluations are largely limited to resources collected in English. This is especially problematic for evaluations targeting inherently socio-cultural phenomena such as stereotyping, where it is important to build multi-lingual resources that reflect the stereotypes prevalent in respective language communities. However, gathering these resources, at scale, in varied languages and regions pose a significant challenge as it requires broad socio-cultural knowledge and can also be prohibitively expensive. To overcome this critical gap, we employ a recently introduced approach that couples LLM generations for scale with culturally situated validations for reliability, and build SeeGULL Multilingual, a global-scale multilingual dataset of social stereotypes, containing over 25K stereotypes, spanning 20 languages, with human annotations across 23 regions, ",
    "path": "papers/24/03/2403.05696.json",
    "total_tokens": 710,
    "translated_title": "SeeGULL Multilingual：一个地理文化定位的刻板印象数据集",
    "translated_abstract": "虽然生成式多语言模型正在迅速部署，但它们的安全性和公平性评估主要局限于英文资源。为了解决这一关键差距，我们采用了一种最近引入的方法，将LLM生成与文化定位验证相结合，构建了全球范围的多语言社会刻板印象数据集SeeGULL Multilingual，包含超过25K条刻板印象，涵盖20种语言，在23个地区进行了人类注释。",
    "tldr": "通过新方法，构建了全球范围的多语言社会刻板印象数据集SeeGULL Multilingual，有助于解决生成式多语言模型安全性和公平性评估中存在的英文资源限制问题。",
    "en_tdlr": "A global-scale multilingual dataset of social stereotypes, SeeGULL Multilingual, was constructed using a new approach to address the limitations of English resources in evaluating the safety and fairness of generative multilingual models."
}