{
    "title": "Learning How to Strategically Disclose Information",
    "abstract": "arXiv:2403.08741v1 Announce Type: cross  Abstract: Strategic information disclosure, in its simplest form, considers a game between an information provider (sender) who has access to some private information that an information receiver is interested in. While the receiver takes an action that affects the utilities of both players, the sender can design information (or modify beliefs) of the receiver through signal commitment, hence posing a Stackelberg game. However, obtaining a Stackelberg equilibrium for this game traditionally requires the sender to have access to the receiver's objective. In this work, we consider an online version of information design where a sender interacts with a receiver of an unknown type who is adversarially chosen at each round. Restricting attention to Gaussian prior and quadratic costs for the sender and the receiver, we show that $\\mathcal{O}(\\sqrt{T})$ regret is achievable with full information feedback, where $T$ is the total number of interactions b",
    "link": "https://arxiv.org/abs/2403.08741",
    "context": "Title: Learning How to Strategically Disclose Information\nAbstract: arXiv:2403.08741v1 Announce Type: cross  Abstract: Strategic information disclosure, in its simplest form, considers a game between an information provider (sender) who has access to some private information that an information receiver is interested in. While the receiver takes an action that affects the utilities of both players, the sender can design information (or modify beliefs) of the receiver through signal commitment, hence posing a Stackelberg game. However, obtaining a Stackelberg equilibrium for this game traditionally requires the sender to have access to the receiver's objective. In this work, we consider an online version of information design where a sender interacts with a receiver of an unknown type who is adversarially chosen at each round. Restricting attention to Gaussian prior and quadratic costs for the sender and the receiver, we show that $\\mathcal{O}(\\sqrt{T})$ regret is achievable with full information feedback, where $T$ is the total number of interactions b",
    "path": "papers/24/03/2403.08741.json",
    "total_tokens": 816,
    "translated_title": "学习如何策略性披露信息",
    "translated_abstract": "战略信息披露，简单来说，考虑了信息提供者（发送方）和对某些私人信息感兴趣的信息接收者之间的博弈。发件人可以通过信号承诺设计信息（或修改接收方的信念），从而构成一场斯塔克贝格博弈。然而，传统上，为了在这场比赛中获得斯塔克贝格均衡，发件人需要访问接收者的目标。在这项工作中，我们考虑了一种信息设计的在线版本，其中发件人与每一轮敌意选择的未知类型的接收者进行交互。在考虑了发件人和接收者的高斯先验和二次成本的情况下，我们证明了使用全信息反馈可以实现$O(\\sqrt{T})$的后悔，其中$T$是总交互次数。",
    "tldr": "本研究针对一个发送者与每一轮敌意选择的未知类型接收者之间的信息设计问题，证明了使用全信息反馈时可以实现$O(\\sqrt{T})$的后悔。",
    "en_tdlr": "This study addresses the problem of information design between a sender and an adversarially chosen receiver of unknown type each round, demonstrating that $O(\\sqrt{T})$ regret is achievable with full information feedback."
}