{
    "title": "Causal Discovery from Poisson Branching Structural Causal Model Using High-Order Cumulant with Path Analysis",
    "abstract": "arXiv:2403.16523v1 Announce Type: cross  Abstract: Count data naturally arise in many fields, such as finance, neuroscience, and epidemiology, and discovering causal structure among count data is a crucial task in various scientific and industrial scenarios. One of the most common characteristics of count data is the inherent branching structure described by a binomial thinning operator and an independent Poisson distribution that captures both branching and noise. For instance, in a population count scenario, mortality and immigration contribute to the count, where survival follows a Bernoulli distribution, and immigration follows a Poisson distribution. However, causal discovery from such data is challenging due to the non-identifiability issue: a single causal pair is Markov equivalent, i.e., $X\\rightarrow Y$ and $Y\\rightarrow X$ are distributed equivalent. Fortunately, in this work, we found that the causal order from $X$ to its child $Y$ is identifiable if $X$ is a root vertex and",
    "link": "https://arxiv.org/abs/2403.16523",
    "context": "Title: Causal Discovery from Poisson Branching Structural Causal Model Using High-Order Cumulant with Path Analysis\nAbstract: arXiv:2403.16523v1 Announce Type: cross  Abstract: Count data naturally arise in many fields, such as finance, neuroscience, and epidemiology, and discovering causal structure among count data is a crucial task in various scientific and industrial scenarios. One of the most common characteristics of count data is the inherent branching structure described by a binomial thinning operator and an independent Poisson distribution that captures both branching and noise. For instance, in a population count scenario, mortality and immigration contribute to the count, where survival follows a Bernoulli distribution, and immigration follows a Poisson distribution. However, causal discovery from such data is challenging due to the non-identifiability issue: a single causal pair is Markov equivalent, i.e., $X\\rightarrow Y$ and $Y\\rightarrow X$ are distributed equivalent. Fortunately, in this work, we found that the causal order from $X$ to its child $Y$ is identifiable if $X$ is a root vertex and",
    "path": "papers/24/03/2403.16523.json",
    "total_tokens": 945,
    "translated_title": "利用高阶累积量和路径分析从泊松分支结构因果模型中发现因果关系",
    "translated_abstract": "计数数据在金融、神经科学和流行病学等领域中自然产生，在各种科学和工业场景中发现计数数据之间的因果结构是一项关键任务。计数数据的一个最常见特征是由二项式稀疏运算符和独立的泊松分布描述的固有分支结构，该结构捕捉了分支和噪声。例如，在人口计数情景中，死亡和移民对计数有贡献，其中生存遵循伯努利分布，移民遵循泊松分布。然而，由于不可辨识性问题，从这些数据中发现因果关系具有挑战性：单一因果对是马尔可夫等价的，即$X\\rightarrow Y$和$Y\\rightarrow X$在分布上是等价的。幸运的是，在这项工作中，我们发现如果$X$是一个根顶点，那么从$X$到其子节点$Y$的因果顺序是可识别的。",
    "tldr": "从计数数据中发现因果结构的关键挑战在于非可辨识性问题，本研究发现在泊松分支结构因果模型中，如果根顶点$X$是已知的，则可以确定从$X$到其子节点$Y$的因果顺序。",
    "en_tdlr": "The key challenge in causal discovery from count data lies in the non-identifiability issue. This work reveals that in the Poisson branching structural causal model, the causal order from the root vertex $X$ to its child $Y$ can be determined if $X$ is known."
}