{
    "title": "MindEye2: Shared-Subject Models Enable fMRI-To-Image With 1 Hour of Data",
    "abstract": "arXiv:2403.11207v1 Announce Type: cross  Abstract: Reconstructions of visual perception from brain activity have improved tremendously, but the practical utility of such methods has been limited. This is because such models are trained independently per subject where each subject requires dozens of hours of expensive fMRI training data to attain high-quality results. The present work showcases high-quality reconstructions using only 1 hour of fMRI training data. We pretrain our model across 7 subjects and then fine-tune on minimal data from a new subject. Our novel functional alignment procedure linearly maps all brain data to a shared-subject latent space, followed by a shared non-linear mapping to CLIP image space. We then map from CLIP space to pixel space by fine-tuning Stable Diffusion XL to accept CLIP latents as inputs instead of text. This approach improves out-of-subject generalization with limited training data and also attains state-of-the-art image retrieval and reconstruct",
    "link": "https://arxiv.org/abs/2403.11207",
    "context": "Title: MindEye2: Shared-Subject Models Enable fMRI-To-Image With 1 Hour of Data\nAbstract: arXiv:2403.11207v1 Announce Type: cross  Abstract: Reconstructions of visual perception from brain activity have improved tremendously, but the practical utility of such methods has been limited. This is because such models are trained independently per subject where each subject requires dozens of hours of expensive fMRI training data to attain high-quality results. The present work showcases high-quality reconstructions using only 1 hour of fMRI training data. We pretrain our model across 7 subjects and then fine-tune on minimal data from a new subject. Our novel functional alignment procedure linearly maps all brain data to a shared-subject latent space, followed by a shared non-linear mapping to CLIP image space. We then map from CLIP space to pixel space by fine-tuning Stable Diffusion XL to accept CLIP latents as inputs instead of text. This approach improves out-of-subject generalization with limited training data and also attains state-of-the-art image retrieval and reconstruct",
    "path": "papers/24/03/2403.11207.json",
    "total_tokens": 879,
    "translated_title": "MindEye2：共享主题模型使得只需1小时数据即可实现fMRI到图像的转换",
    "translated_abstract": "视觉感知的重建已取得了巨大进步，但是这些方法的实际效用受到了限制。这是因为这些模型是针对每个受试者独立训练的，每个受试者需要数十小时昂贵的fMRI训练数据才能获得高质量的结果。这项研究展示了仅使用1小时fMRI训练数据实现高质量重建的方法。我们在7名受试者中预训练我们的模型，然后在新受试者的部分数据上微调。我们的新颖功能对齐程序将所有脑数据线性映射到一个共享的主题潜在空间，然后通过共享的非线性映射到CLIP图像空间。然后，我们通过微调稳定扩散XL来接受CLIP潜在作为输入而不是文本，将CLIP空间映射到像素空间。这种方法提高了在有限训练数据的情况下的跨受试者泛化能力，并且也达到了最先进的图像检索和重建技术。",
    "tldr": "MindEye2使用共享主题模型，通过仅使用1小时的fMRI训练数据，实现了高质量的fMRI到图像的转换。"
}