{
    "title": "Forward Direct Feedback Alignment for Online Gradient Estimates of Spiking Neural Networks",
    "abstract": "arXiv:2403.08804v1 Announce Type: cross  Abstract: There is an interest in finding energy efficient alternatives to current state of the art neural network training algorithms. Spiking neural network are a promising approach, because they can be simulated energy efficiently on neuromorphic hardware platforms. However, these platforms come with limitations on the design of the training algorithm. Most importantly, backpropagation cannot be implemented on those. We propose a novel neuromorphic algorithm, the \\textit{Spiking Forward Direct Feedback Alignment} (SFDFA) algorithm, an adaption of \\textit{Forward Direct Feedback Alignment} to train SNNs. SFDFA estimates the weights between output and hidden neurons as feedback connections. The main contribution of this paper is to describe how exact local gradients of spikes can be computed in an online manner while taking into account the intra-neuron dependencies between post-synaptic spikes and derive a dynamical system for neuromorphic har",
    "link": "https://arxiv.org/abs/2403.08804",
    "context": "Title: Forward Direct Feedback Alignment for Online Gradient Estimates of Spiking Neural Networks\nAbstract: arXiv:2403.08804v1 Announce Type: cross  Abstract: There is an interest in finding energy efficient alternatives to current state of the art neural network training algorithms. Spiking neural network are a promising approach, because they can be simulated energy efficiently on neuromorphic hardware platforms. However, these platforms come with limitations on the design of the training algorithm. Most importantly, backpropagation cannot be implemented on those. We propose a novel neuromorphic algorithm, the \\textit{Spiking Forward Direct Feedback Alignment} (SFDFA) algorithm, an adaption of \\textit{Forward Direct Feedback Alignment} to train SNNs. SFDFA estimates the weights between output and hidden neurons as feedback connections. The main contribution of this paper is to describe how exact local gradients of spikes can be computed in an online manner while taking into account the intra-neuron dependencies between post-synaptic spikes and derive a dynamical system for neuromorphic har",
    "path": "papers/24/03/2403.08804.json",
    "total_tokens": 875,
    "translated_title": "针对尖峰神经网络的在线梯度估计的前向直接反馈对齐",
    "translated_abstract": "存在一种找到比当前最先进的神经网络训练算法更节能选择的兴趣。尖峰神经网络是一种有前途的方法，因为它们可以在神经形态硬件平台上以高效节能的方式进行模拟。然而，这些平台在训练算法的设计上存在限制。最重要的是，反向传播不能在那些平台上实现。我们提出了一种新颖的神经形态算法，即\\textit{尖锐前向直接反馈对齐}（SFDFA）算法，这是对\\textit{前向直接反馈对齐}的改进，用于训练SNN。SFDFA将输出和隐藏神经元之间的权重估计为反馈连接。本文的主要贡献在于描述如何准确计算在线方式中的尖峰局部梯度，同时考虑到神经元内的后突触尖峰之间的依赖关系，并推导出神经形态硬件的动力系统。",
    "tldr": "提出了一种新颖的神经形态算法SFDFA，描述了如何在线计算准确的局部梯度，并推导出神经形态硬件的动力系统。",
    "en_tdlr": "Introduced a novel neuromorphic algorithm SFDFA, describing how to compute accurate local gradients online and deriving a dynamical system for neuromorphic hardware."
}