{
    "title": "Tokensome: Towards a Genetic Vision-Language GPT for Explainable and Cognitive Karyotyping",
    "abstract": "arXiv:2403.11073v1 Announce Type: cross  Abstract: Automatic karyotype analysis is often defined as a visual perception task focused solely on chromosomal object-level modeling. This definition has led most existing methods to overlook componential and holistic information, significantly constraining model performance. Moreover, the lack of interpretability in current technologies hinders clinical adoption. In this paper, we introduce Tokensome, a novel vision-language model based on chromosome tokenization for explainable and cognitive karyotyping. Tokensome elevates the method from the conventional visual perception layer to the cognitive decision-making layer. This elevation enables the integration of domain knowledge and cognitive reasoning via knowledge graphs and LLMs, markedly enhancing model's explainability and facilitating abnormality detection.",
    "link": "https://arxiv.org/abs/2403.11073",
    "context": "Title: Tokensome: Towards a Genetic Vision-Language GPT for Explainable and Cognitive Karyotyping\nAbstract: arXiv:2403.11073v1 Announce Type: cross  Abstract: Automatic karyotype analysis is often defined as a visual perception task focused solely on chromosomal object-level modeling. This definition has led most existing methods to overlook componential and holistic information, significantly constraining model performance. Moreover, the lack of interpretability in current technologies hinders clinical adoption. In this paper, we introduce Tokensome, a novel vision-language model based on chromosome tokenization for explainable and cognitive karyotyping. Tokensome elevates the method from the conventional visual perception layer to the cognitive decision-making layer. This elevation enables the integration of domain knowledge and cognitive reasoning via knowledge graphs and LLMs, markedly enhancing model's explainability and facilitating abnormality detection.",
    "path": "papers/24/03/2403.11073.json",
    "total_tokens": 808,
    "translated_title": "Tokensome：面向可解释和认知核型的基因视觉语言GPT",
    "translated_abstract": "自动核型分析通常被定义为一项专注于染色体对象级建模的视觉感知任务，该定义导致大多数现有方法忽视了组件和整体信息，显著限制了模型的性能。此外，当前技术缺乏可解释性阻碍了临床的采用。在本文中，我们介绍了Tokensome，这是一种基于染色体标记的新型视觉语言模型，用于可解释和认知核型。Tokensome将方法从传统的视觉感知层提升到认知决策层。这种提升通过知识图和LLM，使领域知识和认知推理整合在一起，显著增强了模型的可解释性并促进了异常检测。",
    "tldr": "Tokensome提出了一种基于染色体标记的创新视觉语言模型，将处理核型问题从传统的视觉感知层升级到认知决策层，通过整合知识图和LLM，显著提升模型的可解释性和促进异常检测。",
    "en_tdlr": "Tokensome proposes an innovative vision-language model based on chromosome tokenization, elevating the handling of karyotyping from the traditional visual perception layer to the cognitive decision-making layer, significantly improving model explainability and facilitating abnormality detection through the integration of knowledge graphs and LLMs."
}