{
    "title": "Enhancing Long-Term Person Re-Identification Using Global, Local Body Part, and Head Streams",
    "abstract": "arXiv:2403.02892v1 Announce Type: cross  Abstract: This work addresses the task of long-term person re-identification. Typically, person re-identification assumes that people do not change their clothes, which limits its applications to short-term scenarios. To overcome this limitation, we investigate long-term person re-identification, which considers both clothes-changing and clothes-consistent scenarios. In this paper, we propose a novel framework that effectively learns and utilizes both global and local information. The proposed framework consists of three streams: global, local body part, and head streams. The global and head streams encode identity-relevant information from an entire image and a cropped image of the head region, respectively. Both streams encode the most distinct, less distinct, and average features using the combinations of adversarial erasing, max pooling, and average pooling. The local body part stream extracts identity-related information for each body part,",
    "link": "https://arxiv.org/abs/2403.02892",
    "context": "Title: Enhancing Long-Term Person Re-Identification Using Global, Local Body Part, and Head Streams\nAbstract: arXiv:2403.02892v1 Announce Type: cross  Abstract: This work addresses the task of long-term person re-identification. Typically, person re-identification assumes that people do not change their clothes, which limits its applications to short-term scenarios. To overcome this limitation, we investigate long-term person re-identification, which considers both clothes-changing and clothes-consistent scenarios. In this paper, we propose a novel framework that effectively learns and utilizes both global and local information. The proposed framework consists of three streams: global, local body part, and head streams. The global and head streams encode identity-relevant information from an entire image and a cropped image of the head region, respectively. Both streams encode the most distinct, less distinct, and average features using the combinations of adversarial erasing, max pooling, and average pooling. The local body part stream extracts identity-related information for each body part,",
    "path": "papers/24/03/2403.02892.json",
    "total_tokens": 792,
    "translated_title": "利用全局，局部身体部位和头部流增强长期人员再识别",
    "translated_abstract": "本文研究长期人员再识别任务。通常，人员再识别假设人们不会更换衣服，这限制了其应用于短期场景。为了克服这一限制，我们研究了考虑换衣与一致着装两种情景的长期人员再识别。我们提出了一个有效学习和利用全局和局部信息的新框架。提出的框架包括三个流：全局、局部身体部位和头部流。全局和头部流分别编码来自整个图像和头部区域裁剪图像的与身份相关信息。两个流利用对抗性擦除，最大池化和平均池化的组合编码最明显的，不太明显的和平均特征。",
    "tldr": "提出了一个新框架，结合全局和局部信息，利用三个流（全局、局部身体部位和头部），用于增强长期人员再识别任务。",
    "en_tdlr": "Introducing a novel framework that integrates global and local information through three streams (global, local body part, and head) for enhancing long-term person re-identification task."
}