{
    "title": "Causal Graph ODE: Continuous Treatment Effect Modeling in Multi-agent Dynamical Systems",
    "abstract": "arXiv:2403.00178v1 Announce Type: cross  Abstract: Real-world multi-agent systems are often dynamic and continuous, where the agents co-evolve and undergo changes in their trajectories and interactions over time. For example, the COVID-19 transmission in the U.S. can be viewed as a multi-agent system, where states act as agents and daily population movements between them are interactions. Estimating the counterfactual outcomes in such systems enables accurate future predictions and effective decision-making, such as formulating COVID-19 policies. However, existing methods fail to model the continuous dynamic effects of treatments on the outcome, especially when multiple treatments (e.g., \"stay-at-home\" and \"get-vaccine\" policies) are applied simultaneously. To tackle this challenge, we propose Causal Graph Ordinary Differential Equations (CAG-ODE), a novel model that captures the continuous interaction among agents using a Graph Neural Network (GNN) as the ODE function. The key innovat",
    "link": "https://arxiv.org/abs/2403.00178",
    "context": "Title: Causal Graph ODE: Continuous Treatment Effect Modeling in Multi-agent Dynamical Systems\nAbstract: arXiv:2403.00178v1 Announce Type: cross  Abstract: Real-world multi-agent systems are often dynamic and continuous, where the agents co-evolve and undergo changes in their trajectories and interactions over time. For example, the COVID-19 transmission in the U.S. can be viewed as a multi-agent system, where states act as agents and daily population movements between them are interactions. Estimating the counterfactual outcomes in such systems enables accurate future predictions and effective decision-making, such as formulating COVID-19 policies. However, existing methods fail to model the continuous dynamic effects of treatments on the outcome, especially when multiple treatments (e.g., \"stay-at-home\" and \"get-vaccine\" policies) are applied simultaneously. To tackle this challenge, we propose Causal Graph Ordinary Differential Equations (CAG-ODE), a novel model that captures the continuous interaction among agents using a Graph Neural Network (GNN) as the ODE function. The key innovat",
    "path": "papers/24/03/2403.00178.json",
    "total_tokens": 866,
    "translated_title": "因果图ODE：多智能体动态系统中的连续处理效应建模",
    "translated_abstract": "实际世界中的多智能体系统通常是动态和连续的，其中智能体共同演化，并随时间改变其轨迹和相互作用。例如，美国的COVID-19传播可以看作是一个多智能体系统，其中各州充当智能体，它们之间的日常人口流动就是相互作用。在这种系统中估计反事实结果可以实现准确的未来预测和有效的决策制定，例如制定COVID-19政策。然而，现有方法未能有效地模拟处理对结果的连续动态影响，尤其是当同时应用多种处理（例如“居家隔离”和“接种疫苗”政策）时。为了解决这一挑战，我们提出了因果图普通微分方程（CAG-ODE），这是一种能够使用图神经网络（GNN）作为ODE函数捕捉智能体之间连续相互作用的新颖模型。",
    "tldr": "提出了Causal Graph Ordinary Differential Equations (CAG-ODE) 模型，能够捕捉多智能体系统中处理的连续动态影响，利用图神经网络作为ODE函数。",
    "en_tdlr": "Proposed the Causal Graph Ordinary Differential Equations (CAG-ODE) model, which captures the continuous dynamic effects of treatments in multi-agent systems, using a Graph Neural Network as the ODE function."
}