{
    "title": "Modeling Analog Dynamic Range Compressors using Deep Learning and State-space Models",
    "abstract": "arXiv:2403.16331v1 Announce Type: cross  Abstract: We describe a novel approach for developing realistic digital models of dynamic range compressors for digital audio production by analyzing their analog prototypes. While realistic digital dynamic compressors are potentially useful for many applications, the design process is challenging because the compressors operate nonlinearly over long time scales. Our approach is based on the structured state space sequence model (S4), as implementing the state-space model (SSM) has proven to be efficient at learning long-range dependencies and is promising for modeling dynamic range compressors. We present in this paper a deep learning model with S4 layers to model the Teletronix LA-2A analog dynamic range compressor. The model is causal, executes efficiently in real time, and achieves roughly the same quality as previous deep-learning models but with fewer parameters.",
    "link": "https://arxiv.org/abs/2403.16331",
    "context": "Title: Modeling Analog Dynamic Range Compressors using Deep Learning and State-space Models\nAbstract: arXiv:2403.16331v1 Announce Type: cross  Abstract: We describe a novel approach for developing realistic digital models of dynamic range compressors for digital audio production by analyzing their analog prototypes. While realistic digital dynamic compressors are potentially useful for many applications, the design process is challenging because the compressors operate nonlinearly over long time scales. Our approach is based on the structured state space sequence model (S4), as implementing the state-space model (SSM) has proven to be efficient at learning long-range dependencies and is promising for modeling dynamic range compressors. We present in this paper a deep learning model with S4 layers to model the Teletronix LA-2A analog dynamic range compressor. The model is causal, executes efficiently in real time, and achieves roughly the same quality as previous deep-learning models but with fewer parameters.",
    "path": "papers/24/03/2403.16331.json",
    "total_tokens": 847,
    "translated_title": "使用深度学习和状态空间模型对模拟模拟动态范围压缩器进行建模",
    "translated_abstract": "我们描述了一种开发数字音频生产中动态范围压缩器逼真数字模型的新方法，该方法通过分析其模拟原型进行。尽管逼真的数字动态压缩器在许多应用中都有潜在用途，但由于这些压缩器在长时间尺度上非线性运行，因此设计过程具有挑战性。我们的方法基于结构化状态空间序列模型（S4），由于状态空间模型（SSM）的实施已被证明在学习长程依赖性方面高效，并且有望用于建模动态范围压缩器。本文中我们提出了一个具有S4层的深度学习模型，用于建模Teletronix LA-2A模拟动态范围压缩器。该模型是因果的，在实时执行时效率高，并且在参数更少的情况下实现了与先前深度学习模型大致相同的质量。",
    "tldr": "通过分析模拟原型，使用深度学习和状态空间模型开发了模拟动态范围压缩器的逼真数字模型，具有更高的效率和更少的参数。",
    "en_tdlr": "This paper presents a novel approach for developing realistic digital models of dynamic range compressors by analyzing their analog prototypes, utilizing deep learning and state-space models, achieving higher efficiency and fewer parameters."
}