{
    "title": "Leveraging Internal Representations of Model for Magnetic Image Classification",
    "abstract": "arXiv:2403.06797v1 Announce Type: new  Abstract: Data generated by edge devices has the potential to train intelligent autonomous systems across various domains. Despite the emergence of diverse machine learning approaches addressing privacy concerns and utilizing distributed data, security issues persist due to the sensitive storage of data shards in disparate locations. This paper introduces a potentially groundbreaking paradigm for machine learning model training, specifically designed for scenarios with only a single magnetic image and its corresponding label image available. We harness the capabilities of Deep Learning to generate concise yet informative samples, aiming to overcome data scarcity. Through the utilization of deep learning's internal representations, our objective is to efficiently address data scarcity issues and produce meaningful results. This methodology presents a promising avenue for training machine learning models with minimal data.",
    "link": "https://arxiv.org/abs/2403.06797",
    "context": "Title: Leveraging Internal Representations of Model for Magnetic Image Classification\nAbstract: arXiv:2403.06797v1 Announce Type: new  Abstract: Data generated by edge devices has the potential to train intelligent autonomous systems across various domains. Despite the emergence of diverse machine learning approaches addressing privacy concerns and utilizing distributed data, security issues persist due to the sensitive storage of data shards in disparate locations. This paper introduces a potentially groundbreaking paradigm for machine learning model training, specifically designed for scenarios with only a single magnetic image and its corresponding label image available. We harness the capabilities of Deep Learning to generate concise yet informative samples, aiming to overcome data scarcity. Through the utilization of deep learning's internal representations, our objective is to efficiently address data scarcity issues and produce meaningful results. This methodology presents a promising avenue for training machine learning models with minimal data.",
    "path": "papers/24/03/2403.06797.json",
    "total_tokens": 796,
    "translated_title": "利用模型的内部表示进行磁图像分类",
    "translated_abstract": "由边缘设备生成的数据具有训练智能自主系统跨多个领域的潜力。尽管出现了各种解决隐私问题并利用分布式数据的机器学习方法，由于数据碎片在不同位置的敏感存储，安全问题仍然存在。本文介绍了一种潜在的颠覆性的机器学习模型训练范式，专门设计用于只有单个磁图像及其相应标签图像可用的情况。我们利用深度学习的能力生成简洁而富有信息的样本，旨在克服数据稀缺性。通过利用深度学习的内部表示，我们的目标是有效解决数据稀缺性问题并产生有意义的结果。这种方法为以最少数据进行机器学习模型训练提供了一个有前途的途径。",
    "tldr": "该研究利用深度学习内部表示，针对只有单个磁图像及其标签可用的情况，提出了一种新的机器学习模型训练范式，旨在解决数据稀缺性问题。",
    "en_tdlr": "This study introduces a new paradigm for machine learning model training, targeting scenarios with only a single magnetic image and its label available, using deep learning internal representations to address data scarcity."
}