{
    "title": "A mechanism-informed reinforcement learning framework for shape optimization of airfoils",
    "abstract": "arXiv:2403.04329v1 Announce Type: cross  Abstract: In this study, we present the mechanism-informed reinforcement learning framework for airfoil shape optimization. By leveraging the twin delayed deep deterministic policy gradient algorithm for its notable stability, our approach addresses the complexities of optimizing shapes governed by fluid dynamics. The PDEs-based solver is adopted for its accuracy even when the configurations and geometries are extraordinarily changed during the exploration. Dual-weighted residual-based mesh refinement strategy is applied to ensure the accurate calculation of target functionals. To streamline the iterative optimization process and handle geometric deformations, our approach integrates Laplacian smoothing, adaptive refinement, and a B\\'ezier fitting strategy. This combination not only remits mesh tangling but also guarantees a precise manipulation of the airfoil geometry. Our neural network architecture leverages B\\'ezier curves for efficient dime",
    "link": "https://arxiv.org/abs/2403.04329",
    "context": "Title: A mechanism-informed reinforcement learning framework for shape optimization of airfoils\nAbstract: arXiv:2403.04329v1 Announce Type: cross  Abstract: In this study, we present the mechanism-informed reinforcement learning framework for airfoil shape optimization. By leveraging the twin delayed deep deterministic policy gradient algorithm for its notable stability, our approach addresses the complexities of optimizing shapes governed by fluid dynamics. The PDEs-based solver is adopted for its accuracy even when the configurations and geometries are extraordinarily changed during the exploration. Dual-weighted residual-based mesh refinement strategy is applied to ensure the accurate calculation of target functionals. To streamline the iterative optimization process and handle geometric deformations, our approach integrates Laplacian smoothing, adaptive refinement, and a B\\'ezier fitting strategy. This combination not only remits mesh tangling but also guarantees a precise manipulation of the airfoil geometry. Our neural network architecture leverages B\\'ezier curves for efficient dime",
    "path": "papers/24/03/2403.04329.json",
    "total_tokens": 846,
    "translated_title": "一种基于机制的强化学习框架用于机翼气动外型优化",
    "translated_abstract": "在本研究中，我们提出了一种基于机制的强化学习框架，用于机翼气动外型优化。通过利用双延迟深度确定性策略梯度算法的显著稳定性，我们的方法解决了受流体动力学控制的外型优化的复杂性。采用基于PDEs的求解器以保证准确性，即使在探索过程中配置和几何形状发生了极大变化。我们采用双加权残差网格细化策略，以确保目标函数的精确计算。为了简化迭代优化过程并处理几何变形，我们的方法集成了拉普拉斯平滑、自适应细化和B\\'ezier拟合策略。这种组合不仅消除了网格纠缠，还保证了对机翼几何的精确操作。我们的神经网络架构利用B\\'ezier曲线实现了高效的表示。",
    "tldr": "提出了一种基于机制的强化学习框架，用于处理流体动力学控制下的气动外型优化，并整合了多种策略以保证精确性和高效性。",
    "en_tdlr": "Proposed a mechanism-informed reinforcement learning framework for aerodynamic shape optimization under fluid dynamics control, integrating multiple strategies for accuracy and efficiency."
}