{
    "title": "Large Language Model based Situational Dialogues for Second Language Learning",
    "abstract": "arXiv:2403.20005v1 Announce Type: new  Abstract: In second language learning, scenario-based conversation practice is important for language learners to achieve fluency in speaking, but students often lack sufficient opportunities to practice their conversational skills with qualified instructors or native speakers. To bridge this gap, we propose situational dialogue models for students to engage in conversational practice. Our situational dialogue models are fine-tuned on large language models (LLMs), with the aim of combining the engaging nature of an open-ended conversation with the focused practice of scenario-based tasks. Leveraging the generalization capabilities of LLMs, we demonstrate that our situational dialogue models perform effectively not only on training topics but also on topics not encountered during training. This offers a promising solution to support a wide range of conversational topics without extensive manual work. Additionally, research in the field of dialogue ",
    "link": "https://arxiv.org/abs/2403.20005",
    "context": "Title: Large Language Model based Situational Dialogues for Second Language Learning\nAbstract: arXiv:2403.20005v1 Announce Type: new  Abstract: In second language learning, scenario-based conversation practice is important for language learners to achieve fluency in speaking, but students often lack sufficient opportunities to practice their conversational skills with qualified instructors or native speakers. To bridge this gap, we propose situational dialogue models for students to engage in conversational practice. Our situational dialogue models are fine-tuned on large language models (LLMs), with the aim of combining the engaging nature of an open-ended conversation with the focused practice of scenario-based tasks. Leveraging the generalization capabilities of LLMs, we demonstrate that our situational dialogue models perform effectively not only on training topics but also on topics not encountered during training. This offers a promising solution to support a wide range of conversational topics without extensive manual work. Additionally, research in the field of dialogue ",
    "path": "papers/24/03/2403.20005.json",
    "total_tokens": 903,
    "translated_title": "基于大型语言模型的情境对话在第二语言学习中的应用",
    "translated_abstract": "在第二语言学习中，基于情境的对话练习对于语言学习者实现口语流利至关重要，但学生常常缺乏与合格教师或母语者练习会话技能的机会。为了弥补这一差距，我们提出了情境对话模型，供学生参与会话练习。我们的情境对话模型是在大型语言模型（LLM）上进行微调的，旨在结合开放式对话的吸引力和基于情境任务的专注练习。利用LLMs的泛化能力，我们证明我们的情境对话模型不仅在训练话题上表现出色，而且在训练中未遇到的话题上也表现出色。这为支持广泛的会话话题提供了一个有希望的解决方案，而不需要大量手动工作。此外，在对话领域的研究...",
    "tldr": "提出了基于大型语言模型的情境对话模型，旨在帮助语言学习者进行有效的会话练习，具有泛化能力，可以支持多样的会话话题，为解决学生缺乏合格教师或母语者练习会话技能的问题提供了一种可行的解决方案"
}