{
    "title": "Robust Emotion Recognition in Context Debiasing",
    "abstract": "arXiv:2403.05963v1 Announce Type: cross  Abstract: Context-aware emotion recognition (CAER) has recently boosted the practical applications of affective computing techniques in unconstrained environments. Mainstream CAER methods invariably extract ensemble representations from diverse contexts and subject-centred characteristics to perceive the target person's emotional state. Despite advancements, the biggest challenge remains due to context bias interference. The harmful bias forces the models to rely on spurious correlations between background contexts and emotion labels in likelihood estimation, causing severe performance bottlenecks and confounding valuable context priors. In this paper, we propose a counterfactual emotion inference (CLEF) framework to address the above issue. Specifically, we first formulate a generalized causal graph to decouple the causal relationships among the variables in CAER. Following the causal graph, CLEF introduces a non-invasive context branch to capt",
    "link": "https://arxiv.org/abs/2403.05963",
    "context": "Title: Robust Emotion Recognition in Context Debiasing\nAbstract: arXiv:2403.05963v1 Announce Type: cross  Abstract: Context-aware emotion recognition (CAER) has recently boosted the practical applications of affective computing techniques in unconstrained environments. Mainstream CAER methods invariably extract ensemble representations from diverse contexts and subject-centred characteristics to perceive the target person's emotional state. Despite advancements, the biggest challenge remains due to context bias interference. The harmful bias forces the models to rely on spurious correlations between background contexts and emotion labels in likelihood estimation, causing severe performance bottlenecks and confounding valuable context priors. In this paper, we propose a counterfactual emotion inference (CLEF) framework to address the above issue. Specifically, we first formulate a generalized causal graph to decouple the causal relationships among the variables in CAER. Following the causal graph, CLEF introduces a non-invasive context branch to capt",
    "path": "papers/24/03/2403.05963.json",
    "total_tokens": 808,
    "translated_title": "在上下文去偏的情绪识别中的鲁棒性",
    "translated_abstract": "上下文感知情绪识别（CAER）最近在无约束环境中推动了情感计算技术的实际应用。 主流的CAER方法总是从不同的上下文和以主体为中心的特征中提取集成表示，以感知目标人物的情绪状态。 尽管有所进展，但最大的挑战仍然是由于上下文偏差的干扰。 有害的偏见迫使模型依赖于背景上下文和情感标签之间的虚假相关性，在可能性估计中造成严重的性能瓶颈，并使有价值的上下文先验混淆。 在本文中，我们提出了一个反事实情绪推理（CLEF）框架来解决上述问题。 具体而言，我们首先制定了一个广义因果图，以解耦CAER中变量之间的因果关系。 遵循因果图，CLEF引入了一个非侵入式的上下文分支来获取",
    "tldr": "提出了一个反事实情绪推理（CLEF）框架来解决上下文偏差干扰的挑战",
    "en_tdlr": "Proposed a Counterfactual Emotion Inference (CLEF) framework to address the challenge of context bias interference in emotion recognition."
}