{
    "title": "Auditable Homomorphic-based Decentralized Collaborative AI with Attribute-based Differential Privacy",
    "abstract": "arXiv:2403.00023v1 Announce Type: cross  Abstract: In recent years, the notion of federated learning (FL) has led to the new paradigm of distributed artificial intelligence (AI) with privacy preservation. However, most current FL systems suffer from data privacy issues due to the requirement of a trusted third party. Although some previous works introduce differential privacy to protect the data, however, it may also significantly deteriorate the model performance. To address these issues, we propose a novel decentralized collaborative AI framework, named Auditable Homomorphic-based Decentralised Collaborative AI (AerisAI), to improve security with homomorphic encryption and fine-grained differential privacy. Our proposed AerisAI directly aggregates the encrypted parameters with a blockchain-based smart contract to get rid of the need of a trusted third party. We also propose a brand-new concept for eliminating the negative impacts of differential privacy for model performance. Moreove",
    "link": "https://arxiv.org/abs/2403.00023",
    "context": "Title: Auditable Homomorphic-based Decentralized Collaborative AI with Attribute-based Differential Privacy\nAbstract: arXiv:2403.00023v1 Announce Type: cross  Abstract: In recent years, the notion of federated learning (FL) has led to the new paradigm of distributed artificial intelligence (AI) with privacy preservation. However, most current FL systems suffer from data privacy issues due to the requirement of a trusted third party. Although some previous works introduce differential privacy to protect the data, however, it may also significantly deteriorate the model performance. To address these issues, we propose a novel decentralized collaborative AI framework, named Auditable Homomorphic-based Decentralised Collaborative AI (AerisAI), to improve security with homomorphic encryption and fine-grained differential privacy. Our proposed AerisAI directly aggregates the encrypted parameters with a blockchain-based smart contract to get rid of the need of a trusted third party. We also propose a brand-new concept for eliminating the negative impacts of differential privacy for model performance. Moreove",
    "path": "papers/24/03/2403.00023.json",
    "total_tokens": 886,
    "translated_title": "具有基于属性的差分隐私的可审计同态协作人工智能",
    "translated_abstract": "在最近几年，联邦学习（FL）的概念引领了具有隐私保护的分布式人工智能（AI）新范式。然而，大多数当前的FL系统因为需要受信任的第三方而存在数据隐私问题。尽管一些先前的工作引入差分隐私来保护数据，但这可能会显著恶化模型性能。为了解决这些问题，我们提出了一种新颖的去中心化协作AI框架，名为具有基于同态加密和细粒度差分隐私的可审计的分布式协作AI（AerisAI）。我们提出的AerisAI直接使用基于区块链的智能合约来聚合加密参数，摆脱了需要受信任的第三方的需求。我们还提出了一个全新的概念，用于消除差分隐私对于模型性能的负面影响。",
    "tldr": "提出了一种名为AerisAI的可审计同态协作人工智能框架，利用同态加密和细粒度差分隐私提高安全性，通过基于区块链的智能合约直接聚合加密参数，消除了对于模型性能的负面影响",
    "en_tdlr": "Introduced AerisAI, an auditable homomorphic-based decentralized collaborative AI framework, enhancing security with homomorphic encryption and fine-grained differential privacy, where encrypted parameters are aggregated directly using blockchain-based smart contracts, eliminating negative impacts on model performance."
}