{
    "title": "SumTra: A Differentiable Pipeline for Few-Shot Cross-Lingual Summarization",
    "abstract": "arXiv:2403.13240v1 Announce Type: new  Abstract: Cross-lingual summarization (XLS) generates summaries in a language different from that of the input documents (e.g., English to Spanish), allowing speakers of the target language to gain a concise view of their content. In the present day, the predominant approach to this task is to take a performing, pretrained multilingual language model (LM) and fine-tune it for XLS on the language pairs of interest. However, the scarcity of fine-tuning samples makes this approach challenging in some cases. For this reason, in this paper we propose revisiting the summarize-and-translate pipeline, where the summarization and translation tasks are performed in a sequence. This approach allows reusing the many, publicly-available resources for monolingual summarization and translation, obtaining a very competitive zero-shot performance. In addition, the proposed pipeline is completely differentiable end-to-end, allowing it to take advantage of few-shot ",
    "link": "https://arxiv.org/abs/2403.13240",
    "context": "Title: SumTra: A Differentiable Pipeline for Few-Shot Cross-Lingual Summarization\nAbstract: arXiv:2403.13240v1 Announce Type: new  Abstract: Cross-lingual summarization (XLS) generates summaries in a language different from that of the input documents (e.g., English to Spanish), allowing speakers of the target language to gain a concise view of their content. In the present day, the predominant approach to this task is to take a performing, pretrained multilingual language model (LM) and fine-tune it for XLS on the language pairs of interest. However, the scarcity of fine-tuning samples makes this approach challenging in some cases. For this reason, in this paper we propose revisiting the summarize-and-translate pipeline, where the summarization and translation tasks are performed in a sequence. This approach allows reusing the many, publicly-available resources for monolingual summarization and translation, obtaining a very competitive zero-shot performance. In addition, the proposed pipeline is completely differentiable end-to-end, allowing it to take advantage of few-shot ",
    "path": "papers/24/03/2403.13240.json",
    "total_tokens": 763,
    "translated_title": "SumTra：一种用于少样本跨语言摘要的可微分流水线",
    "translated_abstract": "跨语言摘要（XLS）在与输入文档语言不同的语言中生成摘要（例如，从英语到西班牙语），使目标语言的使用者能够简洁地了解内容。本文提出重新审视摘要和翻译流水线，其中摘要和翻译任务以序列方式执行。这种方法允许重复使用许多公开可用的资源进行单语摘要和翻译，获得非常具竞争力的零样本性能。此外，所提出的流水线是完全可微的端到端，使其能够充分利用少样本。",
    "tldr": "本文提出了一种用于少样本跨语言摘要的可微分流水线，通过重新审视摘要和翻译流程，实现了零样本性能和端到端的可微优势。",
    "en_tdlr": "This paper proposes a differentiable pipeline for few-shot cross-lingual summarization, which achieves zero-shot performance and end-to-end differentiable advantage by revisiting the summarize-and-translate pipeline."
}