{
    "title": "CODA: A COst-efficient Test-time Domain Adaptation Mechanism for HAR",
    "abstract": "arXiv:2403.14922v1 Announce Type: new  Abstract: In recent years, emerging research on mobile sensing has led to novel scenarios that enhance daily life for humans, but dynamic usage conditions often result in performance degradation when systems are deployed in real-world settings. Existing solutions typically employ one-off adaptation schemes based on neural networks, which struggle to ensure robustness against uncertain drifting conditions in human-centric sensing scenarios. In this paper, we propose CODA, a COst-efficient Domain Adaptation mechanism for mobile sensing that addresses real-time drifts from the data distribution perspective with active learning theory, ensuring cost-efficient adaptation directly on the device. By incorporating a clustering loss and importance-weighted active learning algorithm, CODA retains the relationship between different clusters during cost-effective instance-level updates, preserving meaningful structure within the data distribution. We also sho",
    "link": "https://arxiv.org/abs/2403.14922",
    "context": "Title: CODA: A COst-efficient Test-time Domain Adaptation Mechanism for HAR\nAbstract: arXiv:2403.14922v1 Announce Type: new  Abstract: In recent years, emerging research on mobile sensing has led to novel scenarios that enhance daily life for humans, but dynamic usage conditions often result in performance degradation when systems are deployed in real-world settings. Existing solutions typically employ one-off adaptation schemes based on neural networks, which struggle to ensure robustness against uncertain drifting conditions in human-centric sensing scenarios. In this paper, we propose CODA, a COst-efficient Domain Adaptation mechanism for mobile sensing that addresses real-time drifts from the data distribution perspective with active learning theory, ensuring cost-efficient adaptation directly on the device. By incorporating a clustering loss and importance-weighted active learning algorithm, CODA retains the relationship between different clusters during cost-effective instance-level updates, preserving meaningful structure within the data distribution. We also sho",
    "path": "papers/24/03/2403.14922.json",
    "total_tokens": 832,
    "translated_title": "CODA：一种用于HAR的节约成本的测试时域自适应机制",
    "translated_abstract": "近年来，移动感知的新兴研究导致了增强人类日常生活的新型场景，但是动态的使用条件经常导致系统在实际环境中部署时性能下降。现有的解决方案通常采用基于神经网络的一次性自适应方案，这些方案往往难以确保针对人类感知场景中不确定漂移条件的稳健性。本文提出了CODA，一种针对移动感知的节约成本域自适应机制，从数据分布角度利用主动学习理论解决实时漂移，以确保在设备上直接进行成本有效的自适应。通过结合聚类损失和重要性加权主动学习算法，CODA在成本效益的实例级更新过程中保留不同聚类之间的关系，保留数据分布中的有意义结构。",
    "tldr": "CODA 提出了一种节约成本的测试时域自适应机制，通过主动学习理论处理实时漂移，实现在设备上直接进行成本有效的自适应，并保留数据分布中的有意义结构。",
    "en_tdlr": "CODA introduces a cost-efficient test-time domain adaptation mechanism for Human Activity Recognition (HAR), addressing real-time drifts from the data distribution perspective with active learning theory while preserving meaningful structure within the data distribution."
}