{
    "title": "Efficient Knowledge Deletion from Trained Models through Layer-wise Partial Machine Unlearning",
    "abstract": "arXiv:2403.07611v1 Announce Type: cross  Abstract: Machine unlearning has garnered significant attention due to its ability to selectively erase knowledge obtained from specific training data samples in an already trained machine learning model. This capability enables data holders to adhere strictly to data protection regulations. However, existing unlearning techniques face practical constraints, often causing performance degradation, demanding brief fine-tuning post unlearning, and requiring significant storage. In response, this paper introduces a novel class of machine unlearning algorithms. First method is partial amnesiac unlearning, integration of layer-wise pruning with amnesiac unlearning. In this method, updates made to the model during training are pruned and stored, subsequently used to forget specific data from trained model. The second method assimilates layer-wise partial-updates into label-flipping and optimization-based unlearning to mitigate the adverse effects of da",
    "link": "https://arxiv.org/abs/2403.07611",
    "context": "Title: Efficient Knowledge Deletion from Trained Models through Layer-wise Partial Machine Unlearning\nAbstract: arXiv:2403.07611v1 Announce Type: cross  Abstract: Machine unlearning has garnered significant attention due to its ability to selectively erase knowledge obtained from specific training data samples in an already trained machine learning model. This capability enables data holders to adhere strictly to data protection regulations. However, existing unlearning techniques face practical constraints, often causing performance degradation, demanding brief fine-tuning post unlearning, and requiring significant storage. In response, this paper introduces a novel class of machine unlearning algorithms. First method is partial amnesiac unlearning, integration of layer-wise pruning with amnesiac unlearning. In this method, updates made to the model during training are pruned and stored, subsequently used to forget specific data from trained model. The second method assimilates layer-wise partial-updates into label-flipping and optimization-based unlearning to mitigate the adverse effects of da",
    "path": "papers/24/03/2403.07611.json",
    "total_tokens": 886,
    "translated_title": "通过逐层部分机器遗忘实现训练模型中的有效知识删除",
    "translated_abstract": "arXiv:2403.07611v1 发表类型：cross  摘要：机器遗忘因其能够有选择地擦除已经训练的机器学习模型中从特定训练数据样本获得的知识而受到广泛关注。这种能力使数据持有者能够严格遵守数据保护法规。然而，现有的遗忘技术面临实际约束，通常导致性能下降，需要遗忘后进行简短的微调，并需要大量存储空间。作为回应，本文引入了一种新颖的机器遗忘算法。第一种方法是部分失忆式遗忘，将逐层修剪与失忆式遗忘相结合。在这种方法中，训练过程中对模型进行的更新被修剪并存储，随后用于从训练模型中遗忘特定数据。第二种方法将逐层部分更新集成到标签翻转和基于优化的遗忘中，以减轻由于遗忘而产生的不利影响。",
    "tldr": "该论文介绍了一种新颖的机器遗忘算法，分别采用部分失忆式遗忘和逐层部分更新的方法，以更高效地在训练模型中删除知识。",
    "en_tdlr": "This paper introduces a novel machine unlearning algorithm that utilizes partial amnesiac unlearning and layer-wise partial updates to efficiently delete knowledge from trained models."
}