{
    "title": "AFDGCF: Adaptive Feature De-correlation Graph Collaborative Filtering for Recommendations",
    "abstract": "arXiv:2403.17416v1 Announce Type: new  Abstract: Collaborative filtering methods based on graph neural networks (GNNs) have witnessed significant success in recommender systems (RS), capitalizing on their ability to capture collaborative signals within intricate user-item relationships via message-passing mechanisms. However, these GNN-based RS inadvertently introduce excess linear correlation between user and item embeddings, contradicting the goal of providing personalized recommendations. While existing research predominantly ascribes this flaw to the over-smoothing problem, this paper underscores the critical, often overlooked role of the over-correlation issue in diminishing the effectiveness of GNN representations and subsequent recommendation performance. Up to now, the over-correlation issue remains unexplored in RS. Meanwhile, how to mitigate the impact of over-correlation while preserving collaborative filtering signals is a significant challenge. To this end, this paper aims",
    "link": "https://arxiv.org/abs/2403.17416",
    "context": "Title: AFDGCF: Adaptive Feature De-correlation Graph Collaborative Filtering for Recommendations\nAbstract: arXiv:2403.17416v1 Announce Type: new  Abstract: Collaborative filtering methods based on graph neural networks (GNNs) have witnessed significant success in recommender systems (RS), capitalizing on their ability to capture collaborative signals within intricate user-item relationships via message-passing mechanisms. However, these GNN-based RS inadvertently introduce excess linear correlation between user and item embeddings, contradicting the goal of providing personalized recommendations. While existing research predominantly ascribes this flaw to the over-smoothing problem, this paper underscores the critical, often overlooked role of the over-correlation issue in diminishing the effectiveness of GNN representations and subsequent recommendation performance. Up to now, the over-correlation issue remains unexplored in RS. Meanwhile, how to mitigate the impact of over-correlation while preserving collaborative filtering signals is a significant challenge. To this end, this paper aims",
    "path": "papers/24/03/2403.17416.json",
    "total_tokens": 857,
    "translated_title": "AFDGCF：自适应特征去相关图协同过滤推荐",
    "translated_abstract": "基于图神经网络（GNNs）的协同过滤方法在推荐系统（RS）中取得了显著的成功，利用了它们通过消息传递机制捕获复杂用户-物品关系中的协同信号的能力。然而，这些基于GNN的RS不经意地引入了用户和物品嵌入之间过多的线性相关性，违反了提供个性化推荐的目标。尽管现有研究主要将这一缺陷归因于过度平滑的问题，但本文强调了过度相关性问题在降低GNN表示和随后推荐性能的有效性中发挥着关键且常常被忽视的作用。到目前为止，在RS中对过度相关性问题尚未进行探讨。同时，如何减轻过度关联的影响同时保留协同过滤信号是一个重大挑战。为此，本文的目标是",
    "tldr": "本论文强调了过度相关性问题在降低GNN表示和推荐性能中的关键作用，并致力于解决如何减轻过度关联的影响同时保留协同过滤信号这一重大挑战。",
    "en_tdlr": "This paper highlights the critical role of the over-correlation issue in diminishing the effectiveness of GNN representations and recommendation performance, aiming to address the significant challenge of mitigating the impact of over-correlation while preserving collaborative filtering signals."
}