{
    "title": "Automated Efficient Estimation using Monte Carlo Efficient Influence Functions",
    "abstract": "arXiv:2403.00158v1 Announce Type: cross  Abstract: Many practical problems involve estimating low dimensional statistical quantities with high-dimensional models and datasets. Several approaches address these estimation tasks based on the theory of influence functions, such as debiased/double ML or targeted minimum loss estimation. This paper introduces \\textit{Monte Carlo Efficient Influence Functions} (MC-EIF), a fully automated technique for approximating efficient influence functions that integrates seamlessly with existing differentiable probabilistic programming systems. MC-EIF automates efficient statistical estimation for a broad class of models and target functionals that would previously require rigorous custom analysis. We prove that MC-EIF is consistent, and that estimators using MC-EIF achieve optimal $\\sqrt{N}$ convergence rates. We show empirically that estimators using MC-EIF are at parity with estimators using analytic EIFs. Finally, we demonstrate a novel capstone exa",
    "link": "https://arxiv.org/abs/2403.00158",
    "context": "Title: Automated Efficient Estimation using Monte Carlo Efficient Influence Functions\nAbstract: arXiv:2403.00158v1 Announce Type: cross  Abstract: Many practical problems involve estimating low dimensional statistical quantities with high-dimensional models and datasets. Several approaches address these estimation tasks based on the theory of influence functions, such as debiased/double ML or targeted minimum loss estimation. This paper introduces \\textit{Monte Carlo Efficient Influence Functions} (MC-EIF), a fully automated technique for approximating efficient influence functions that integrates seamlessly with existing differentiable probabilistic programming systems. MC-EIF automates efficient statistical estimation for a broad class of models and target functionals that would previously require rigorous custom analysis. We prove that MC-EIF is consistent, and that estimators using MC-EIF achieve optimal $\\sqrt{N}$ convergence rates. We show empirically that estimators using MC-EIF are at parity with estimators using analytic EIFs. Finally, we demonstrate a novel capstone exa",
    "path": "papers/24/03/2403.00158.json",
    "total_tokens": 874,
    "translated_title": "使用蒙特卡洛高效影响函数实现自动化高效估计",
    "translated_abstract": "许多实际问题涉及使用高维模型和数据集估计低维统计量。几种方法基于影响函数理论来解决这些估计任务，例如去偏/双重极大似然或有针对性最小损失估计。本文介绍了一种全自动的技术，即\\textit{蒙特卡洛高效影响函数} (MC-EIF)，用于逼近高效影响函数，与现有的可微概率编程系统无缝集成。MC-EIF可自动化广泛类别的模型和目标函数的高效统计估计，这些估计以前需要严格的自定义分析。我们证明MC-EIF是一致的，并且使用MC-EIF的估计器达到了最优的$\\sqrt{N}$收敛速度。我们经验性地展示，使用MC-EIF的估计器与使用解析EIF的估计器相当。最后，我们展示一个新颖的顶点示例",
    "tldr": "该论文提出了一种名为蒙特卡洛高效影响函数（MC-EIF）的全自动技术，用于近似高效影响函数，能够实现针对广泛类别的模型和目标函数的统计估计，达到最优的收敛速度。",
    "en_tdlr": "This paper introduces a fully automated technique called Monte Carlo Efficient Influence Functions (MC-EIF) for approximating efficient influence functions, enabling efficient statistical estimation for a broad class of models and target functionals with optimal convergence rates."
}