{
    "title": "Predicting Single-cell Drug Sensitivity by Adaptive Weighted Feature for Adversarial Multi-source Domain Adaptation",
    "abstract": "arXiv:2403.05260v1 Announce Type: new  Abstract: The development of single-cell sequencing technology had promoted the generation of a large amount of single-cell transcriptional profiles, providing valuable opportunities to explore drug-resistant cell subpopulations in a tumor. However, the drug sensitivity data in single-cell level is still scarce to date, pressing an urgent and highly challenging task for computational prediction of the drug sensitivity to individual cells. This paper proposed scAdaDrug, a multi-source adaptive weighting model to predict single-cell drug sensitivity. We used an autoencoder to extract domain-invariant features related to drug sensitivity from multiple source domains by exploiting adversarial domain adaptation. Especially, we introduced an adaptive weight generator to produce importance-aware and mutual independent weights, which could adaptively modulate the embedding of each sample in dimension-level for both source and target domains. Extensive exp",
    "link": "https://arxiv.org/abs/2403.05260",
    "context": "Title: Predicting Single-cell Drug Sensitivity by Adaptive Weighted Feature for Adversarial Multi-source Domain Adaptation\nAbstract: arXiv:2403.05260v1 Announce Type: new  Abstract: The development of single-cell sequencing technology had promoted the generation of a large amount of single-cell transcriptional profiles, providing valuable opportunities to explore drug-resistant cell subpopulations in a tumor. However, the drug sensitivity data in single-cell level is still scarce to date, pressing an urgent and highly challenging task for computational prediction of the drug sensitivity to individual cells. This paper proposed scAdaDrug, a multi-source adaptive weighting model to predict single-cell drug sensitivity. We used an autoencoder to extract domain-invariant features related to drug sensitivity from multiple source domains by exploiting adversarial domain adaptation. Especially, we introduced an adaptive weight generator to produce importance-aware and mutual independent weights, which could adaptively modulate the embedding of each sample in dimension-level for both source and target domains. Extensive exp",
    "path": "papers/24/03/2403.05260.json",
    "total_tokens": 953,
    "translated_title": "通过自适应加权特征进行对抗性多源领域自适应预测单细胞药物敏感性",
    "translated_abstract": "单细胞测序技术的发展推动了大量单细胞转录谱的生成，为探索肿瘤中耐药细胞亚群提供了宝贵机会。然而，迄今为止，单细胞水平的药物敏感性数据仍然稀缺，迫切需要对个体细胞的药物敏感性进行计算预测，这是一项紧迫且具有挑战性的任务。本文提出了一种名为scAdaDrug的多源自适应加权模型，用于预测单细胞药物敏感性。我们利用对抗领域自适应从多个源领域中提取与药物敏感性相关的域不变特征。特别地，我们引入了一种自适应权重生成器，用于产生重要性感知和相互独立的权重，可以自适应地调节每个样本在源和目标领域中的维度级别嵌入。大量实验证明了我们方法的有效性。",
    "tldr": "本文提出了一种名为scAdaDrug的多源自适应加权模型，通过对抗性领域自适应从多个源领域中提取药物敏感性相关的域不变特征，并引入自适应权重生成器来自适应地调节每个样本的嵌入，以预测单细胞药物敏感性。",
    "en_tdlr": "This paper proposed scAdaDrug, a multi-source adaptive weighting model to predict single-cell drug sensitivity by extracting domain-invariant features related to drug sensitivity from multiple source domains using adversarial domain adaptation, and introducing an adaptive weight generator to modulate the embedding of each sample adaptively."
}