{
    "title": "Using Domain Knowledge to Guide Dialog Structure Induction via Neural Probabilistic Soft Logic",
    "abstract": "arXiv:2403.17853v1 Announce Type: new  Abstract: Dialog Structure Induction (DSI) is the task of inferring the latent dialog structure (i.e., a set of dialog states and their temporal transitions) of a given goal-oriented dialog. It is a critical component for modern dialog system design and discourse analysis. Existing DSI approaches are often purely data-driven, deploy models that infer latent states without access to domain knowledge, underperform when the training corpus is limited/noisy, or have difficulty when test dialogs exhibit distributional shifts from the training domain. This work explores a neural-symbolic approach as a potential solution to these problems. We introduce Neural Probabilistic Soft Logic Dialogue Structure Induction (NEUPSL DSI), a principled approach that injects symbolic knowledge into the latent space of a generative neural model. We conduct a thorough empirical investigation on the effect of NEUPSL DSI learning on hidden representation quality, few-shot ",
    "link": "https://arxiv.org/abs/2403.17853",
    "context": "Title: Using Domain Knowledge to Guide Dialog Structure Induction via Neural Probabilistic Soft Logic\nAbstract: arXiv:2403.17853v1 Announce Type: new  Abstract: Dialog Structure Induction (DSI) is the task of inferring the latent dialog structure (i.e., a set of dialog states and their temporal transitions) of a given goal-oriented dialog. It is a critical component for modern dialog system design and discourse analysis. Existing DSI approaches are often purely data-driven, deploy models that infer latent states without access to domain knowledge, underperform when the training corpus is limited/noisy, or have difficulty when test dialogs exhibit distributional shifts from the training domain. This work explores a neural-symbolic approach as a potential solution to these problems. We introduce Neural Probabilistic Soft Logic Dialogue Structure Induction (NEUPSL DSI), a principled approach that injects symbolic knowledge into the latent space of a generative neural model. We conduct a thorough empirical investigation on the effect of NEUPSL DSI learning on hidden representation quality, few-shot ",
    "path": "papers/24/03/2403.17853.json",
    "total_tokens": 822,
    "translated_title": "利用领域知识通过神经概率软逻辑引导对话结构识别",
    "translated_abstract": "对话结构识别（DSI）是推断给定目标导向对话的潜在对话结构（即一组对话状态及其时间转换）的任务。这是现代对话系统设计和话语分析的关键组成部分。本文探讨了一种神经符号方法作为这些问题的潜在解决方案。我们介绍了一种称为神经概率软逻辑对话结构识别（NEUPSL DSI）的原则性方法，该方法将符号知识注入生成神经模型的潜在空间。我们进行了关于NEUPSL DSI学习对隐藏表示质量的影响的彻底实证调查。",
    "tldr": "通过将领域知识注入生成神经模型的潜在空间，提出了Neural Probabilistic Soft Logic Dialogue Structure Induction (NEUPSL DSI)方法，用于引导对话结构识别，应对训练语料有限/嘈杂以及测试对话领域分布转变等问题。",
    "en_tdlr": "By injecting domain knowledge into the latent space of a generative neural model, the proposed Neural Probabilistic Soft Logic Dialogue Structure Induction (NEUPSL DSI) method guides dialog structure induction to address issues with limited/noisy training corpus and distributional shifts in test dialogs."
}