{
    "title": "Authorship Style Transfer with Policy Optimization",
    "abstract": "arXiv:2403.08043v1 Announce Type: new  Abstract: Authorship style transfer aims to rewrite a given text into a specified target while preserving the original meaning in the source. Existing approaches rely on the availability of a large number of target style exemplars for model training. However, these overlook cases where a limited number of target style examples are available. The development of parameter-efficient transfer learning techniques and policy optimization (PO) approaches suggest lightweight PO is a feasible approach to low-resource style transfer. In this work, we propose a simple two step tune-and-optimize technique for low-resource textual style transfer. We apply our technique to authorship transfer as well as a larger-data native language style task and in both cases find it outperforms state-of-the-art baseline models.",
    "link": "https://arxiv.org/abs/2403.08043",
    "context": "Title: Authorship Style Transfer with Policy Optimization\nAbstract: arXiv:2403.08043v1 Announce Type: new  Abstract: Authorship style transfer aims to rewrite a given text into a specified target while preserving the original meaning in the source. Existing approaches rely on the availability of a large number of target style exemplars for model training. However, these overlook cases where a limited number of target style examples are available. The development of parameter-efficient transfer learning techniques and policy optimization (PO) approaches suggest lightweight PO is a feasible approach to low-resource style transfer. In this work, we propose a simple two step tune-and-optimize technique for low-resource textual style transfer. We apply our technique to authorship transfer as well as a larger-data native language style task and in both cases find it outperforms state-of-the-art baseline models.",
    "path": "papers/24/03/2403.08043.json",
    "total_tokens": 744,
    "translated_title": "基于策略优化的作者风格转移",
    "translated_abstract": "作者风格转移的目标是将给定的文本重写成指定的目标，同时保留原始文本的含义。现有方法依赖于大量目标风格示例进行模型训练。然而，这些方法忽视了目标风格示例数量有限的情况。参数高效的迁移学习技术和策略优化方法的发展表明，轻量级的策略优化是一种可行的低资源风格转移方法。在这项工作中，我们提出了一个简单的两步调整和优化技术，用于低资源文本风格转移。我们将该技术应用于作者转移以及更大数据的母语风格任务，在两种情况下都发现它优于最先进的基准模型。",
    "tldr": "提出了一种简单的两步调整和优化技术，用于低资源文本风格转移，在作者转移和母语风格任务方面均优于最先进的基准模型。",
    "en_tdlr": "Introducing a simple two-step tune-and-optimize technique for low-resource textual style transfer which outperforms state-of-the-art baseline models in authorship transfer and native language style tasks."
}