{
    "title": "IGANN Sparse: Bridging Sparsity and Interpretability with Non-linear Insight",
    "abstract": "arXiv:2403.11363v1 Announce Type: cross  Abstract: Feature selection is a critical component in predictive analytics that significantly affects the prediction accuracy and interpretability of models. Intrinsic methods for feature selection are built directly into model learning, providing a fast and attractive option for large amounts of data. Machine learning algorithms, such as penalized regression models (e.g., lasso) are the most common choice when it comes to in-built feature selection. However, they fail to capture non-linear relationships, which ultimately affects their ability to predict outcomes in intricate datasets. In this paper, we propose IGANN Sparse, a novel machine learning model from the family of generalized additive models, which promotes sparsity through a non-linear feature selection process during training. This ensures interpretability through improved model sparsity without sacrificing predictive performance. Moreover, IGANN Sparse serves as an exploratory tool",
    "link": "https://arxiv.org/abs/2403.11363",
    "context": "Title: IGANN Sparse: Bridging Sparsity and Interpretability with Non-linear Insight\nAbstract: arXiv:2403.11363v1 Announce Type: cross  Abstract: Feature selection is a critical component in predictive analytics that significantly affects the prediction accuracy and interpretability of models. Intrinsic methods for feature selection are built directly into model learning, providing a fast and attractive option for large amounts of data. Machine learning algorithms, such as penalized regression models (e.g., lasso) are the most common choice when it comes to in-built feature selection. However, they fail to capture non-linear relationships, which ultimately affects their ability to predict outcomes in intricate datasets. In this paper, we propose IGANN Sparse, a novel machine learning model from the family of generalized additive models, which promotes sparsity through a non-linear feature selection process during training. This ensures interpretability through improved model sparsity without sacrificing predictive performance. Moreover, IGANN Sparse serves as an exploratory tool",
    "path": "papers/24/03/2403.11363.json",
    "total_tokens": 661,
    "translated_title": "IGANN Sparse: 用非线性洞察力连接稀疏性和可解释性",
    "translated_abstract": "特征选择是预测性分析中的关键组成部分，显著影响模型的预测准确性和解释性。本文提出了IGANN Sparse，这是一种新颖的机器学习模型，它来自广义加法模型家族，通过训练过程中的非线性特征选择促进稀疏性，从而确保通过改进模型稀疏性来实现可解释性而不影响预测性能。",
    "tldr": "IGANN Sparse是一种新颖的机器学习模型，通过训练过程中的非线性特征选择促进稀疏性，确保在不影响预测性能的情况下提高模型的可解释性。"
}