{
    "title": "Active Deep Kernel Learning of Molecular Functionalities: Realizing Dynamic Structural Embeddings",
    "abstract": "arXiv:2403.01234v1 Announce Type: new  Abstract: Exploring molecular spaces is crucial for advancing our understanding of chemical properties and reactions, leading to groundbreaking innovations in materials science, medicine, and energy. This paper explores an approach for active learning in molecular discovery using Deep Kernel Learning (DKL), a novel approach surpassing the limits of classical Variational Autoencoders (VAEs). Employing the QM9 dataset, we contrast DKL with traditional VAEs, which analyze molecular structures based on similarity, revealing limitations due to sparse regularities in latent spaces. DKL, however, offers a more holistic perspective by correlating structure with properties, creating latent spaces that prioritize molecular functionality. This is achieved by recalculating embedding vectors iteratively, aligning with the experimental availability of target properties. The resulting latent spaces are not only better organized but also exhibit unique characteri",
    "link": "https://arxiv.org/abs/2403.01234",
    "context": "Title: Active Deep Kernel Learning of Molecular Functionalities: Realizing Dynamic Structural Embeddings\nAbstract: arXiv:2403.01234v1 Announce Type: new  Abstract: Exploring molecular spaces is crucial for advancing our understanding of chemical properties and reactions, leading to groundbreaking innovations in materials science, medicine, and energy. This paper explores an approach for active learning in molecular discovery using Deep Kernel Learning (DKL), a novel approach surpassing the limits of classical Variational Autoencoders (VAEs). Employing the QM9 dataset, we contrast DKL with traditional VAEs, which analyze molecular structures based on similarity, revealing limitations due to sparse regularities in latent spaces. DKL, however, offers a more holistic perspective by correlating structure with properties, creating latent spaces that prioritize molecular functionality. This is achieved by recalculating embedding vectors iteratively, aligning with the experimental availability of target properties. The resulting latent spaces are not only better organized but also exhibit unique characteri",
    "path": "papers/24/03/2403.01234.json",
    "total_tokens": 915,
    "translated_title": "活跃深度核学习分子功能性：实现动态结构嵌入",
    "translated_abstract": "探索分子空间对于推进我们对化学性质和反应的理解至关重要，从而在材料科学、医学和能源领域取得突破性创新。本文探讨了一种利用深度核学习（DKL）进行分子发现的主动学习方法，这是一种超越传统变分自动编码器（VAEs）限制的新方法。使用QM9数据集，我们将DKL与传统VAEs进行对比，后者基于相似性分析分子结构，揭示了由于潜在空间中的稀疏规律性而存在的局限性。然而，DKL通过将结构与性质相关联，创造了优先考虑分子功能性的潜在空间，提供了更全面的视角。这是通过迭代重新计算嵌入向量来实现的，与目标性质的实验可用性保持一致。由此产生的潜在空间不仅组织更好，而且具有独特特性。",
    "tldr": "本文提出了一种利用深度核学习（DKL）的活跃学习方法，通过与传统变分自动编码器（VAEs）的对比分析，创造了优先考虑分子功能性的潜在空间，并且通过迭代重新计算嵌入向量实现了更好组织的潜在空间。",
    "en_tdlr": "This paper presents an active learning approach using Deep Kernel Learning (DKL), which prioritizes molecular functionality in latent spaces by correlating structure with properties, achieved through iterative recalculation of embedding vectors compared to classical Variational Autoencoders (VAEs)."
}