{
    "title": "FMPAF: How Do Fed Chairs Affect the Financial Market? A Fine-grained Monetary Policy Analysis Framework on Their Language",
    "abstract": "arXiv:2403.06115v1 Announce Type: cross  Abstract: The effectiveness of central bank communication is a crucial aspect of monetary policy transmission. While recent research has examined the influence of policy communication by the chairs of the Federal Reserve on various financial variables, much of the literature relies on rule-based or dictionary-based methods in parsing the language of the chairs, leaving nuanced information about policy stance contained in nonverbal emotion out of the analysis. In the current study, we propose the Fine-Grained Monetary Policy Analysis Framework (FMPAF), a novel approach that integrates large language models (LLMs) with regression analysis to provide a comprehensive analysis of the impact of the press-conference communications of chairs of the Federal Reserve on financial markets. We conduct extensive comparisons of model performance under different levels of granularity, modalities, and communication scenarios. Based on our preferred specification",
    "link": "https://arxiv.org/abs/2403.06115",
    "context": "Title: FMPAF: How Do Fed Chairs Affect the Financial Market? A Fine-grained Monetary Policy Analysis Framework on Their Language\nAbstract: arXiv:2403.06115v1 Announce Type: cross  Abstract: The effectiveness of central bank communication is a crucial aspect of monetary policy transmission. While recent research has examined the influence of policy communication by the chairs of the Federal Reserve on various financial variables, much of the literature relies on rule-based or dictionary-based methods in parsing the language of the chairs, leaving nuanced information about policy stance contained in nonverbal emotion out of the analysis. In the current study, we propose the Fine-Grained Monetary Policy Analysis Framework (FMPAF), a novel approach that integrates large language models (LLMs) with regression analysis to provide a comprehensive analysis of the impact of the press-conference communications of chairs of the Federal Reserve on financial markets. We conduct extensive comparisons of model performance under different levels of granularity, modalities, and communication scenarios. Based on our preferred specification",
    "path": "papers/24/03/2403.06115.json",
    "total_tokens": 855,
    "translated_title": "FMPAF：联邦储备主席如何影响金融市场？关于他们语言的细粒度货币政策分析框架",
    "translated_abstract": "中央银行沟通的有效性是货币政策传导的一个关键方面。尽管最近的研究已经考察了美联储主席的政策沟通对各种金融变量的影响，但大部分文献依赖于基于规则或词典的方法来解析主席的语言，导致对包含在非言语情绪中的政策立场的微妙信息缺乏分析。在当前研究中，我们提出了细粒度货币政策分析框架（FMPAF），这是一种集成大型语言模型（LLMs）与回归分析的新方法，旨在全面分析美联储主席新闻发布会沟通对金融市场的影响。我们进行了模型性能在不同细粒度、模态和沟通场景下的广泛比较。",
    "tldr": "FMPAF是一个新颖的方法，通过整合大型语言模型和回归分析，提供了对美联储主席新闻发布会沟通对金融市场影响的全面分析。",
    "en_tdlr": "FMPAF is a novel approach that integrates large language models with regression analysis to provide a comprehensive analysis of the impact of the press-conference communications of chairs of the Federal Reserve on financial markets."
}