{
    "title": "On-Device Domain Learning for Keyword Spotting on Low-Power Extreme Edge Embedded Systems",
    "abstract": "arXiv:2403.10549v1 Announce Type: cross  Abstract: Keyword spotting accuracy degrades when neural networks are exposed to noisy environments. On-site adaptation to previously unseen noise is crucial to recovering accuracy loss, and on-device learning is required to ensure that the adaptation process happens entirely on the edge device. In this work, we propose a fully on-device domain adaptation system achieving up to 14% accuracy gains over already-robust keyword spotting models. We enable on-device learning with less than 10 kB of memory, using only 100 labeled utterances to recover 5% accuracy after adapting to the complex speech noise. We demonstrate that domain adaptation can be achieved on ultra-low-power microcontrollers with as little as 806 mJ in only 14 s on always-on, battery-operated devices.",
    "link": "https://arxiv.org/abs/2403.10549",
    "context": "Title: On-Device Domain Learning for Keyword Spotting on Low-Power Extreme Edge Embedded Systems\nAbstract: arXiv:2403.10549v1 Announce Type: cross  Abstract: Keyword spotting accuracy degrades when neural networks are exposed to noisy environments. On-site adaptation to previously unseen noise is crucial to recovering accuracy loss, and on-device learning is required to ensure that the adaptation process happens entirely on the edge device. In this work, we propose a fully on-device domain adaptation system achieving up to 14% accuracy gains over already-robust keyword spotting models. We enable on-device learning with less than 10 kB of memory, using only 100 labeled utterances to recover 5% accuracy after adapting to the complex speech noise. We demonstrate that domain adaptation can be achieved on ultra-low-power microcontrollers with as little as 806 mJ in only 14 s on always-on, battery-operated devices.",
    "path": "papers/24/03/2403.10549.json",
    "total_tokens": 885,
    "translated_title": "在低功耗极端边缘嵌入式系统上进行关键词检测的设备端域学习",
    "translated_abstract": "当神经网络暴露在嘈杂环境中时，关键词检测的准确性会下降。现场对之前未见噪声的自适应对于恢复准确性损失至关重要，并且需要设备端学习来确保自适应过程完全在边缘设备上进行。在这项工作中，我们提出了一个完全设备端域自适应系统，实现了高达14%的准确性增益，超过了已经稳健的关键词检测模型。我们使用不到10 kB的内存实现了设备端学习，仅使用100个标记的话语就能在适应复杂的语音噪声后提高5%的准确性。我们证明域自适应可以在超低功耗的微控制器上实现，仅需806 mJ，且在始终打开的、电池供电的设备上仅需14秒。",
    "tldr": "在低功耗极端边缘嵌入式系统上，提出了一个完全设备端域自适应系统，能够实现高达14%的准确性提升，仅需少于10 kB的内存和100个标记的话语，在适应复杂的语音噪声后能够恢复准确性。",
    "en_tdlr": "A fully on-device domain adaptation system is proposed for keyword spotting on low-power extreme edge embedded systems, achieving up to 14% accuracy gains with less than 10 kB of memory and 100 labeled utterances, enabling recovery in accuracy after adapting to complex speech noise."
}