{
    "title": "LEAD: Learning Decomposition for Source-free Universal Domain Adaptation",
    "abstract": "arXiv:2403.03421v1 Announce Type: cross  Abstract: Universal Domain Adaptation (UniDA) targets knowledge transfer in the presence of both covariate and label shifts. Recently, Source-free Universal Domain Adaptation (SF-UniDA) has emerged to achieve UniDA without access to source data, which tends to be more practical due to data protection policies. The main challenge lies in determining whether covariate-shifted samples belong to target-private unknown categories. Existing methods tackle this either through hand-crafted thresholding or by developing time-consuming iterative clustering strategies. In this paper, we propose a new idea of LEArning Decomposition (LEAD), which decouples features into source-known and -unknown components to identify target-private data. Technically, LEAD initially leverages the orthogonal decomposition analysis for feature decomposition. Then, LEAD builds instance-level decision boundaries to adaptively identify target-private data. Extensive experiments a",
    "link": "https://arxiv.org/abs/2403.03421",
    "context": "Title: LEAD: Learning Decomposition for Source-free Universal Domain Adaptation\nAbstract: arXiv:2403.03421v1 Announce Type: cross  Abstract: Universal Domain Adaptation (UniDA) targets knowledge transfer in the presence of both covariate and label shifts. Recently, Source-free Universal Domain Adaptation (SF-UniDA) has emerged to achieve UniDA without access to source data, which tends to be more practical due to data protection policies. The main challenge lies in determining whether covariate-shifted samples belong to target-private unknown categories. Existing methods tackle this either through hand-crafted thresholding or by developing time-consuming iterative clustering strategies. In this paper, we propose a new idea of LEArning Decomposition (LEAD), which decouples features into source-known and -unknown components to identify target-private data. Technically, LEAD initially leverages the orthogonal decomposition analysis for feature decomposition. Then, LEAD builds instance-level decision boundaries to adaptively identify target-private data. Extensive experiments a",
    "path": "papers/24/03/2403.03421.json",
    "total_tokens": 661,
    "translated_title": "LEAD：学习分解用于无源通用领域自适应",
    "translated_abstract": "通用领域自适应（UniDA）旨在实现在存在协变量和标签转移的情况下进行知识转移。 最近，无源通用领域自适应（SF-UniDA）已经出现，旨在实现UniDA而无需访问源数据，这更实用由于数据保护政策。 本文提出了一个新的LEArning Decomposition（LEAD）的想法，通过将特征分解为源已知和未知组件来识别目标私有数据。",
    "tldr": "提出了LEAD方法，通过将特征分解为源已知和未知组件来识别目标私有数据。",
    "en_tdlr": "Introduced LEAD method to decouple features into source-known and -unknown components for identifying target-private data."
}