{
    "title": "LLM^3:Large Language Model-based Task and Motion Planning with Motion Failure Reasoning",
    "abstract": "arXiv:2403.11552v1 Announce Type: cross  Abstract: Conventional Task and Motion Planning (TAMP) approaches rely on manually crafted interfaces connecting symbolic task planning with continuous motion generation. These domain-specific and labor-intensive modules are limited in addressing emerging tasks in real-world settings. Here, we present LLM^3, a novel Large Language Model (LLM)-based TAMP framework featuring a domain-independent interface. Specifically, we leverage the powerful reasoning and planning capabilities of pre-trained LLMs to propose symbolic action sequences and select continuous action parameters for motion planning. Crucially, LLM^3 incorporates motion planning feed- back through prompting, allowing the LLM to iteratively refine its proposals by reasoning about motion failure. Consequently, LLM^3 interfaces between task planning and motion planning, alleviating the intricate design process of handling domain- specific messages between them. Through a series of simulat",
    "link": "https://arxiv.org/abs/2403.11552",
    "context": "Title: LLM^3:Large Language Model-based Task and Motion Planning with Motion Failure Reasoning\nAbstract: arXiv:2403.11552v1 Announce Type: cross  Abstract: Conventional Task and Motion Planning (TAMP) approaches rely on manually crafted interfaces connecting symbolic task planning with continuous motion generation. These domain-specific and labor-intensive modules are limited in addressing emerging tasks in real-world settings. Here, we present LLM^3, a novel Large Language Model (LLM)-based TAMP framework featuring a domain-independent interface. Specifically, we leverage the powerful reasoning and planning capabilities of pre-trained LLMs to propose symbolic action sequences and select continuous action parameters for motion planning. Crucially, LLM^3 incorporates motion planning feed- back through prompting, allowing the LLM to iteratively refine its proposals by reasoning about motion failure. Consequently, LLM^3 interfaces between task planning and motion planning, alleviating the intricate design process of handling domain- specific messages between them. Through a series of simulat",
    "path": "papers/24/03/2403.11552.json",
    "total_tokens": 940,
    "translated_title": "LLM^3:基于大型语言模型的任务和运动规划以及运动失败推理",
    "translated_abstract": "传统任务和运动规划（TAMP）方法依赖于手工设计的界面，将符号任务规划与连续运动生成连接起来。这些特定领域的、劳动密集型的模块在处理现实世界设置中出现的新任务方面有限。在这里，我们提出了LLM^3，这是一个新颖的基于大型语言模型（LLM）的TAMP框架，具有领域无关的接口。具体来说，我们利用预训练的LLM的强大推理和规划能力来提出符号动作序列，并选择连续动作参数进行运动规划。关键是，LLM^3通过提示将运动规划反馈到其中，使得LLM能够通过对运动失败进行推理来迭代地优化其提议。因此，LLM^3在任务规划和运动规划之间建立接口，减轻了处理它们之间特定领域消息的复杂设计过程。通过一系列仿真",
    "tldr": "LLM^3是一个基于大型语言模型的任务和运动规划框架，利用预训练的LLM具备强大的推理和规划能力，通过接口提出符号动作序列和选择连续动作参数进行运动规划，并通过运动规划的反馈来迭代优化提议，从而简化了处理领域特定消息的设计过程。",
    "en_tdlr": "LLM^3 is a task and motion planning framework based on a large language model, leveraging the powerful reasoning and planning capabilities of pre-trained LLMs to propose symbolic action sequences, select continuous action parameters for motion planning, and iteratively optimize proposals through feedback, simplifying the design process of handling domain-specific messages."
}