{
    "title": "Doubly Calibrated Estimator for Recommendation on Data Missing Not At Random",
    "abstract": "arXiv:2403.00817v1 Announce Type: cross  Abstract: Recommender systems often suffer from selection bias as users tend to rate their preferred items. The datasets collected under such conditions exhibit entries missing not at random and thus are not randomized-controlled trials representing the target population. To address this challenge, a doubly robust estimator and its enhanced variants have been proposed as they ensure unbiasedness when accurate imputed errors or predicted propensities are provided. However, we argue that existing estimators rely on miscalibrated imputed errors and propensity scores as they depend on rudimentary models for estimation. We provide theoretical insights into how miscalibrated imputation and propensity models may limit the effectiveness of doubly robust estimators and validate our theorems using real-world datasets. On this basis, we propose a Doubly Calibrated Estimator that involves the calibration of both the imputation and propensity models. To achi",
    "link": "https://arxiv.org/abs/2403.00817",
    "context": "Title: Doubly Calibrated Estimator for Recommendation on Data Missing Not At Random\nAbstract: arXiv:2403.00817v1 Announce Type: cross  Abstract: Recommender systems often suffer from selection bias as users tend to rate their preferred items. The datasets collected under such conditions exhibit entries missing not at random and thus are not randomized-controlled trials representing the target population. To address this challenge, a doubly robust estimator and its enhanced variants have been proposed as they ensure unbiasedness when accurate imputed errors or predicted propensities are provided. However, we argue that existing estimators rely on miscalibrated imputed errors and propensity scores as they depend on rudimentary models for estimation. We provide theoretical insights into how miscalibrated imputation and propensity models may limit the effectiveness of doubly robust estimators and validate our theorems using real-world datasets. On this basis, we propose a Doubly Calibrated Estimator that involves the calibration of both the imputation and propensity models. To achi",
    "path": "papers/24/03/2403.00817.json",
    "total_tokens": 855,
    "translated_title": "双重校准估计器用于缺失数据不随机推荐",
    "translated_abstract": "推荐系统往往受到选择偏差的影响，因为用户倾向于评价他们喜欢的物品。在这种条件下收集的数据集表现出不随机缺失的条目，因此不是代表目标人群的随机对照试验。为了解决这一挑战，提出了双重稳健估计器及其增强型变体，因为它们确保在提供准确的插补误差或预测概率时无偏。然而，我们认为现有的估计器依赖于错误校准的插补误差和概率分数，因为它们依赖于估计的基本模型。我们提供理论洞察，说明错误校准的插补和概率模型可能限制双重稳健估计器的有效性，并利用真实世界数据集验证我们的定理。基于此，我们提出了一个包括对插补和概率模型进行校准的双重校准估计器。",
    "tldr": "提出了双重校准估计器，通过校准插补和概率模型来解决推荐系统中缺失数据不随机的挑战",
    "en_tdlr": "A Doubly Calibrated Estimator is proposed to address the challenge of missing data not at random in recommendation systems by calibrating both imputation and propensity models."
}