{
    "title": "BLADE: Enhancing Black-box Large Language Models with Small Domain-Specific Models",
    "abstract": "arXiv:2403.18365v1 Announce Type: new  Abstract: Large Language Models (LLMs) like ChatGPT and GPT-4 are versatile and capable of addressing a diverse range of tasks. However, general LLMs, which are developed on open-domain data, may lack the domain-specific knowledge essential for tasks in vertical domains, such as legal, medical, etc. To address this issue, previous approaches either conduct continuous pre-training with domain-specific data or employ retrieval augmentation to support general LLMs. Unfortunately, these strategies are either cost-intensive or unreliable in practical applications. To this end, we present a novel framework named BLADE, which enhances Black-box LArge language models with small Domain-spEcific models. BLADE consists of a black-box LLM and a small domain-specific LM. The small LM preserves domain-specific knowledge and offers specialized insights, while the general LLM contributes robust language comprehension and reasoning capabilities. Specifically, our ",
    "link": "https://arxiv.org/abs/2403.18365",
    "context": "Title: BLADE: Enhancing Black-box Large Language Models with Small Domain-Specific Models\nAbstract: arXiv:2403.18365v1 Announce Type: new  Abstract: Large Language Models (LLMs) like ChatGPT and GPT-4 are versatile and capable of addressing a diverse range of tasks. However, general LLMs, which are developed on open-domain data, may lack the domain-specific knowledge essential for tasks in vertical domains, such as legal, medical, etc. To address this issue, previous approaches either conduct continuous pre-training with domain-specific data or employ retrieval augmentation to support general LLMs. Unfortunately, these strategies are either cost-intensive or unreliable in practical applications. To this end, we present a novel framework named BLADE, which enhances Black-box LArge language models with small Domain-spEcific models. BLADE consists of a black-box LLM and a small domain-specific LM. The small LM preserves domain-specific knowledge and offers specialized insights, while the general LLM contributes robust language comprehension and reasoning capabilities. Specifically, our ",
    "path": "papers/24/03/2403.18365.json",
    "total_tokens": 800,
    "translated_title": "BLADE：利用小型领域特定模型增强黑盒大型语言模型",
    "translated_abstract": "大型语言模型（LLMs）如ChatGPT和GPT-4具有通用性和能够解决各种任务。然而，在开放域数据上开发的通用LLMs可能缺乏垂直领域（如法律、医学等）任务所需的领域特定知识。为了解决这一问题，先前的方法要么使用领域特定数据进行持续预训练，要么使用检索增强来支持通用LLMs。不幸的是，这些策略在实际应用中要么成本高昂，要么不可靠。因此，我们提出了一个名为BLADE的新颖框架，它增强了黑盒大型语言模型与小型领域特定模型。",
    "tldr": "BLADE框架将黑盒大型语言模型与小型领域特定模型结合，既保留了领域特定知识和专业见解，又提供了强大的语言理解和推理能力。"
}