{
    "title": "AutoDFP: Automatic Data-Free Pruning via Channel Similarity Reconstruction",
    "abstract": "arXiv:2403.08204v1 Announce Type: new  Abstract: Structured pruning methods are developed to bridge the gap between the massive scale of neural networks and the limited hardware resources. Most current structured pruning methods rely on training datasets to fine-tune the compressed model, resulting in high computational burdens and being inapplicable for scenarios with stringent requirements on privacy and security. As an alternative, some data-free methods have been proposed, however, these methods often require handcraft parameter tuning and can only achieve inflexible reconstruction. In this paper, we propose the Automatic Data-Free Pruning (AutoDFP) method that achieves automatic pruning and reconstruction without fine-tuning. Our approach is based on the assumption that the loss of information can be partially compensated by retaining focused information from similar channels. Specifically, We formulate data-free pruning as an optimization problem, which can be effectively address",
    "link": "https://arxiv.org/abs/2403.08204",
    "context": "Title: AutoDFP: Automatic Data-Free Pruning via Channel Similarity Reconstruction\nAbstract: arXiv:2403.08204v1 Announce Type: new  Abstract: Structured pruning methods are developed to bridge the gap between the massive scale of neural networks and the limited hardware resources. Most current structured pruning methods rely on training datasets to fine-tune the compressed model, resulting in high computational burdens and being inapplicable for scenarios with stringent requirements on privacy and security. As an alternative, some data-free methods have been proposed, however, these methods often require handcraft parameter tuning and can only achieve inflexible reconstruction. In this paper, we propose the Automatic Data-Free Pruning (AutoDFP) method that achieves automatic pruning and reconstruction without fine-tuning. Our approach is based on the assumption that the loss of information can be partially compensated by retaining focused information from similar channels. Specifically, We formulate data-free pruning as an optimization problem, which can be effectively address",
    "path": "papers/24/03/2403.08204.json",
    "total_tokens": 801,
    "translated_title": "AutoDFP: 通过通道相似性重建实现自动无数据剪枝",
    "translated_abstract": "结构化剪枝方法的发展填补了神经网络规模庞大和有限硬件资源之间的差距。大多数当前的结构化剪枝方法依赖于训练数据集来微调压缩模型，导致高计算负担，并在对隐私和安全性要求严格的场景中无法应用。作为替代，已经提出了一些无数据方法，然而，这些方法通常需要手工参数调整，仅能实现不灵活的重建。在本文中，我们提出了一种自动无数据剪枝(AutoDFP)方法，实现了自动剪枝和重建而无需微调。我们的方法基于这样的假设：信息的丢失可以通过保留来自相似通道的重点信息来部分补偿。具体来说，我们将无数据剪枝制定为一个优化问题，可以得到有效解决。",
    "tldr": "提出一种名为AutoDFP的自动无数据剪枝方法，通过保留相似通道的重点信息实现自动剪枝和重建，无需进行微调。",
    "en_tdlr": "Introducing AutoDFP, an automatic data-free pruning method that achieves automatic pruning and reconstruction by retaining crucial information from similar channels, eliminating the need for fine-tuning."
}