{
    "title": "A Framework for Portrait Stylization with Skin-Tone Awareness and Nudity Identification",
    "abstract": "arXiv:2403.14264v1 Announce Type: cross  Abstract: Portrait stylization is a challenging task involving the transformation of an input portrait image into a specific style while preserving its inherent characteristics. The recent introduction of Stable Diffusion (SD) has significantly improved the quality of outcomes in this field. However, a practical stylization framework that can effectively filter harmful input content and preserve the distinct characteristics of an input, such as skin-tone, while maintaining the quality of stylization remains lacking. These challenges have hindered the wide deployment of such a framework. To address these issues, this study proposes a portrait stylization framework that incorporates a nudity content identification module (NCIM) and a skin-tone-aware portrait stylization module (STAPSM). In experiments, NCIM showed good performance in enhancing explicit content filtering, and STAPSM accurately represented a diverse range of skin tones. Our proposed",
    "link": "https://arxiv.org/abs/2403.14264",
    "context": "Title: A Framework for Portrait Stylization with Skin-Tone Awareness and Nudity Identification\nAbstract: arXiv:2403.14264v1 Announce Type: cross  Abstract: Portrait stylization is a challenging task involving the transformation of an input portrait image into a specific style while preserving its inherent characteristics. The recent introduction of Stable Diffusion (SD) has significantly improved the quality of outcomes in this field. However, a practical stylization framework that can effectively filter harmful input content and preserve the distinct characteristics of an input, such as skin-tone, while maintaining the quality of stylization remains lacking. These challenges have hindered the wide deployment of such a framework. To address these issues, this study proposes a portrait stylization framework that incorporates a nudity content identification module (NCIM) and a skin-tone-aware portrait stylization module (STAPSM). In experiments, NCIM showed good performance in enhancing explicit content filtering, and STAPSM accurately represented a diverse range of skin tones. Our proposed",
    "path": "papers/24/03/2403.14264.json",
    "total_tokens": 875,
    "translated_title": "一种具有肤色意识和裸体识别的肖像风格化框架",
    "translated_abstract": "肖像风格化是一项具有挑战性的任务，涉及将输入的肖像图像转换为特定风格，同时保留其固有特征。最近引入的稳定扩散（SD）在该领域显著提高了结果的质量。然而，一个能够有效过滤有害输入内容并保留输入的独特特征（如肤色），同时保持风格化质量的实用风格化框架仍然缺乏。这些挑战阻碍了这种框架的广泛部署。为解决这些问题，本研究提出了一个肖像风格化框架，该框架融合了裸露内容识别模块（NCIM）和肤色感知肖像风格化模块（STAPSM）。在实验中，NCIM 在增强明确内容过滤方面表现良好，而 STAPSM 准确表现了各种肤色。我们的建议",
    "tldr": "提出了一种肖像风格化框架，结合了裸体内容识别模块和肤色感知肖像风格化模块，以解决过滤有害内容并保留肤色特征的挑战。",
    "en_tdlr": "A framework for portrait stylization is proposed, integrating a nudity content identification module and a skin-tone-aware portrait stylization module to address the challenges of filtering harmful content while preserving skin-tone characteristics."
}