{
    "title": "FhGenie: A Custom, Confidentiality-preserving Chat AI for Corporate and Scientific Use",
    "abstract": "arXiv:2403.00039v1 Announce Type: cross  Abstract: Since OpenAI's release of ChatGPT, generative AI has received significant attention across various domains. These AI-based chat systems have the potential to enhance the productivity of knowledge workers in diverse tasks. However, the use of free public services poses a risk of data leakage, as service providers may exploit user input for additional training and optimization without clear boundaries. Even subscription-based alternatives sometimes lack transparency in handling user data. To address these concerns and enable Fraunhofer staff to leverage this technology while ensuring confidentiality, we have designed and developed a customized chat AI called FhGenie (genie being a reference to a helpful spirit). Within few days of its release, thousands of Fraunhofer employees started using this service. As pioneers in implementing such a system, many other organizations have followed suit. Our solution builds upon commercial large langu",
    "link": "https://arxiv.org/abs/2403.00039",
    "context": "Title: FhGenie: A Custom, Confidentiality-preserving Chat AI for Corporate and Scientific Use\nAbstract: arXiv:2403.00039v1 Announce Type: cross  Abstract: Since OpenAI's release of ChatGPT, generative AI has received significant attention across various domains. These AI-based chat systems have the potential to enhance the productivity of knowledge workers in diverse tasks. However, the use of free public services poses a risk of data leakage, as service providers may exploit user input for additional training and optimization without clear boundaries. Even subscription-based alternatives sometimes lack transparency in handling user data. To address these concerns and enable Fraunhofer staff to leverage this technology while ensuring confidentiality, we have designed and developed a customized chat AI called FhGenie (genie being a reference to a helpful spirit). Within few days of its release, thousands of Fraunhofer employees started using this service. As pioneers in implementing such a system, many other organizations have followed suit. Our solution builds upon commercial large langu",
    "path": "papers/24/03/2403.00039.json",
    "total_tokens": 857,
    "translated_title": "FhGenie：一款专为公司和科研使用定制的保密聊天人工智能",
    "translated_abstract": "自从OpenAI发布了ChatGPT以来，生成式人工智能在各个领域受到了重视。这些基于AI的聊天系统有潜力提升知识工作者在各种任务中的生产力。然而，使用免费公共服务存在数据泄露的风险，因为服务提供商可能会在没有明确界限的情况下利用用户输入进行额外训练和优化。即使是基于订阅的替代方案有时也缺乏处理用户数据的透明度。为了解决这些问题并让Fraunhofer员工在确保保密性的同时利用这项技术，我们设计并开发了一款定制的聊天人工智能称为FhGenie（genie指的是一种有益的精灵）。在发布几天后，成千上万的Fraunhofer员工开始使用这项服务。作为在实施这样的系统方面的先驱，许多其他组织也纷纷效仿。我们的解决方案是基于商业大型语",
    "tldr": "FhGenie是一款专为确保保密性而定制的聊天人工智能，可以帮助知识工作者提高生产力，成为其他组织效仿的先驱。"
}