{
    "title": "Investigating Text Shortening Strategy in BERT: Truncation vs Summarization",
    "abstract": "arXiv:2403.12799v1 Announce Type: cross  Abstract: The parallelism of Transformer-based models comes at the cost of their input max-length. Some studies proposed methods to overcome this limitation, but none of them reported the effectiveness of summarization as an alternative. In this study, we investigate the performance of document truncation and summarization in text classification tasks. Each of the two was investigated with several variations. This study also investigated how close their performances are to the performance of full-text. We used a dataset of summarization tasks based on Indonesian news articles (IndoSum) to do classification tests. This study shows how the summaries outperform the majority of truncation method variations and lose to only one. The best strategy obtained in this study is taking the head of the document. The second is extractive summarization. This study explains what happened to the result, leading to further research in order to exploit the potenti",
    "link": "https://arxiv.org/abs/2403.12799",
    "context": "Title: Investigating Text Shortening Strategy in BERT: Truncation vs Summarization\nAbstract: arXiv:2403.12799v1 Announce Type: cross  Abstract: The parallelism of Transformer-based models comes at the cost of their input max-length. Some studies proposed methods to overcome this limitation, but none of them reported the effectiveness of summarization as an alternative. In this study, we investigate the performance of document truncation and summarization in text classification tasks. Each of the two was investigated with several variations. This study also investigated how close their performances are to the performance of full-text. We used a dataset of summarization tasks based on Indonesian news articles (IndoSum) to do classification tests. This study shows how the summaries outperform the majority of truncation method variations and lose to only one. The best strategy obtained in this study is taking the head of the document. The second is extractive summarization. This study explains what happened to the result, leading to further research in order to exploit the potenti",
    "path": "papers/24/03/2403.12799.json",
    "total_tokens": 867,
    "translated_title": "探究BERT中的文本缩短策略：截断 vs 摘要",
    "translated_abstract": "基于Transformer的模型的并行性以其输入最大长度为代价。一些研究提出了一些方法来克服这一限制，但其中未有报告摘要作为一种替代方法的有效性。本研究探讨了文档截断和摘要在文本分类任务中的表现。每种方法都得到了几种不同的变体的研究。本研究还探讨了它们的表现与全文表现之间的接近程度。我们使用了一个基于印尼新闻文章(IndoSum)的摘要任务数据集来进行分类测试。本研究显示出摘要胜过了大部分截断方法的变体，只输给了一个。本研究得到的最佳策略是取文档的开头。其次是抽取式摘要。本研究解释了结果的原因，引领着对于利用潜力进行进一步研究的开拓。",
    "tldr": "本研究调查了文本分类任务中文档截断和摘要的表现，发现摘要在大多数情况下胜过截断方法的变体，最佳策略为取文档的开头。"
}