{
    "title": "Evaluation Ethics of LLMs in Legal Domain",
    "abstract": "arXiv:2403.11152v1 Announce Type: cross  Abstract: In recent years, the utilization of large language models for natural language dialogue has gained momentum, leading to their widespread adoption across various domains. However, their universal competence in addressing challenges specific to specialized fields such as law remains a subject of scrutiny. The incorporation of legal ethics into the model has been overlooked by researchers. We asserts that rigorous ethic evaluation is essential to ensure the effective integration of large language models in legal domains, emphasizing the need to assess domain-specific proficiency and domain-specific ethic. To address this, we propose a novelty evaluation methodology, utilizing authentic legal cases to evaluate the fundamental language abilities, specialized legal knowledge and legal robustness of large language models (LLMs). The findings from our comprehensive evaluation contribute significantly to the academic discourse surrounding the s",
    "link": "https://arxiv.org/abs/2403.11152",
    "context": "Title: Evaluation Ethics of LLMs in Legal Domain\nAbstract: arXiv:2403.11152v1 Announce Type: cross  Abstract: In recent years, the utilization of large language models for natural language dialogue has gained momentum, leading to their widespread adoption across various domains. However, their universal competence in addressing challenges specific to specialized fields such as law remains a subject of scrutiny. The incorporation of legal ethics into the model has been overlooked by researchers. We asserts that rigorous ethic evaluation is essential to ensure the effective integration of large language models in legal domains, emphasizing the need to assess domain-specific proficiency and domain-specific ethic. To address this, we propose a novelty evaluation methodology, utilizing authentic legal cases to evaluate the fundamental language abilities, specialized legal knowledge and legal robustness of large language models (LLMs). The findings from our comprehensive evaluation contribute significantly to the academic discourse surrounding the s",
    "path": "papers/24/03/2403.11152.json",
    "total_tokens": 884,
    "translated_title": "法律领域中大型语言模型(LLMs)的评估伦理",
    "translated_abstract": "近年来，大型语言模型在自然语言对话中的应用日益增多，导致它们在各个领域被广泛采用。然而，它们在应对诸如法律等专业领域特定挑战方面的通用能力仍受到质疑。研究人员忽视了将法律伦理纳入模型的重要性。我们主张严格的伦理评估对于确保大型语言模型在法律领域有效整合至关重要，强调了评估领域特定能力和领域特定伦理的必要性。为解决这一问题，我们提出了一种创新的评估方法，利用真实法律案例来评估大型语言模型(LLMs)的基本语言能力、专业法律知识和法律稳健性。我们的全面评估结果对学术界围绕法律领域的讨论做出了重要贡献。",
    "tldr": "评估大型语言模型在法律领域的伦理层面的重要性以确保其有效整合，提出了一种基于法律案例的新颖评估方法，并对大型语言模型的基本语言能力、专业法律知识和法律稳健性进行了全面评估",
    "en_tdlr": "The paper emphasizes the importance of ethically evaluating large language models for effective integration in legal domains, proposes a novel evaluation methodology using legal cases, and provides a comprehensive assessment of the models' language abilities, legal knowledge, and robustness."
}