{
    "title": "Prediction of Translation Techniques for the Translation Process",
    "abstract": "arXiv:2403.14454v1 Announce Type: new  Abstract: Machine translation (MT) encompasses a variety of methodologies aimed at enhancing the accuracy of translations. In contrast, the process of human-generated translation relies on a wide range of translation techniques, which are crucial for ensuring linguistic adequacy and fluency. This study suggests that these translation techniques could further optimize machine translation if they are automatically identified before being applied to guide the translation process effectively. The study differentiates between two scenarios of the translation process: from-scratch translation and post-editing. For each scenario, a specific set of experiments has been designed to forecast the most appropriate translation techniques. The findings indicate that the predictive accuracy for from-scratch translation reaches 82%, while the post-editing process exhibits even greater potential, achieving an accuracy rate of 93%.",
    "link": "https://arxiv.org/abs/2403.14454",
    "context": "Title: Prediction of Translation Techniques for the Translation Process\nAbstract: arXiv:2403.14454v1 Announce Type: new  Abstract: Machine translation (MT) encompasses a variety of methodologies aimed at enhancing the accuracy of translations. In contrast, the process of human-generated translation relies on a wide range of translation techniques, which are crucial for ensuring linguistic adequacy and fluency. This study suggests that these translation techniques could further optimize machine translation if they are automatically identified before being applied to guide the translation process effectively. The study differentiates between two scenarios of the translation process: from-scratch translation and post-editing. For each scenario, a specific set of experiments has been designed to forecast the most appropriate translation techniques. The findings indicate that the predictive accuracy for from-scratch translation reaches 82%, while the post-editing process exhibits even greater potential, achieving an accuracy rate of 93%.",
    "path": "papers/24/03/2403.14454.json",
    "total_tokens": 858,
    "translated_title": "针对翻译过程的翻译技术预测",
    "translated_abstract": "机器翻译（MT）涵盖了一系列旨在提高翻译准确性的方法。相比之下，人工翻译的过程依赖于一系列翻译技术，这些技术对确保语言的充分性和流畅性至关重要。本研究表明，如果能在应用之前自动识别这些翻译技术，它们可能进一步优化机器翻译，以有效地引导翻译过程。研究区分了翻译过程的两种场景：从头开始翻译和后期编辑。针对每种场景，设计了一系列特定实验，以预测最适合的翻译技术。研究结果表明，从头开始翻译的预测准确率达到82％，而后期编辑过程表现出更大的潜力，实现了93％的准确率。",
    "tldr": "该研究探讨了针对翻译过程的翻译技术预测，发现在自动识别和应用适当的翻译技术方面，可以进一步优化机器翻译，取得了82%到93%的预测准确率。",
    "en_tdlr": "This study investigates the prediction of translation techniques for the translation process, revealing the potential to further optimize machine translation by automatically identifying and applying appropriate translation techniques, achieving predictive accuracy rates ranging from 82% to 93% for different scenarios."
}