{
    "title": "ILCiteR: Evidence-grounded Interpretable Local Citation Recommendation",
    "abstract": "arXiv:2403.08737v1 Announce Type: cross  Abstract: Existing Machine Learning approaches for local citation recommendation directly map or translate a query, which is typically a claim or an entity mention, to citation-worthy research papers. Within such a formulation, it is challenging to pinpoint why one should cite a specific research paper for a particular query, leading to limited recommendation interpretability. To alleviate this, we introduce the evidence-grounded local citation recommendation task, where the target latent space comprises evidence spans for recommending specific papers. Using a distantly-supervised evidence retrieval and multi-step re-ranking framework, our proposed system, ILCiteR, recommends papers to cite for a query grounded on similar evidence spans extracted from the existing research literature. Unlike past formulations that simply output recommendations, ILCiteR retrieves ranked lists of evidence span and recommended paper pairs. Secondly, previously prop",
    "link": "https://arxiv.org/abs/2403.08737",
    "context": "Title: ILCiteR: Evidence-grounded Interpretable Local Citation Recommendation\nAbstract: arXiv:2403.08737v1 Announce Type: cross  Abstract: Existing Machine Learning approaches for local citation recommendation directly map or translate a query, which is typically a claim or an entity mention, to citation-worthy research papers. Within such a formulation, it is challenging to pinpoint why one should cite a specific research paper for a particular query, leading to limited recommendation interpretability. To alleviate this, we introduce the evidence-grounded local citation recommendation task, where the target latent space comprises evidence spans for recommending specific papers. Using a distantly-supervised evidence retrieval and multi-step re-ranking framework, our proposed system, ILCiteR, recommends papers to cite for a query grounded on similar evidence spans extracted from the existing research literature. Unlike past formulations that simply output recommendations, ILCiteR retrieves ranked lists of evidence span and recommended paper pairs. Secondly, previously prop",
    "path": "papers/24/03/2403.08737.json",
    "total_tokens": 838,
    "translated_title": "ILCiteR：基于证据的可解释局部引文推荐",
    "translated_abstract": "现有的用于局部引文推荐的机器学习方法直接将查询（通常是声明或实体提及）映射或翻译为值得引用的研究论文。在这种表述中，很难确定为什么应该为特定查询引用特定研究论文，从而导致推荐的可解释性受限。为了缓解这一问题，我们引入了基于证据的局部引文推荐任务，其中目标潜在空间包括用于推荐特定论文的证据范围。通过使用远程监督证据检索和多步重新排序框架，我们提出的系统ILCiteR基于从现有研究文献中提取的相似证据范围向查询推荐应引用的论文。与过去简单输出推荐的形式不同，ILCiteR检索出经过排名的证据范围和推荐的论文对列表。",
    "tldr": "介绍了一个名为ILCiteR的系统，通过基于证据的局部引文推荐任务，从现有研究文献中提取相似证据范围来推荐引用的论文，提高了推荐的可解释性。",
    "en_tdlr": "Introduced a system called ILCiteR, which recommends citations based on evidence-grounded local citation recommendation task, extracting similar evidence spans from existing research literature to improve interpretability of recommendations."
}