{
    "title": "Uncertainty-Aware Relational Graph Neural Network for Few-Shot Knowledge Graph Completion",
    "abstract": "arXiv:2403.04521v1 Announce Type: new  Abstract: Few-shot knowledge graph completion (FKGC) aims to query the unseen facts of a relation given its few-shot reference entity pairs. The side effect of noises due to the uncertainty of entities and triples may limit the few-shot learning, but existing FKGC works neglect such uncertainty, which leads them more susceptible to limited reference samples with noises. In this paper, we propose a novel uncertainty-aware few-shot KG completion framework (UFKGC) to model uncertainty for a better understanding of the limited data by learning representations under Gaussian distribution. Uncertainty representation is first designed for estimating the uncertainty scope of the entity pairs after transferring feature representations into a Gaussian distribution. Further, to better integrate the neighbors with uncertainty characteristics for entity features, we design an uncertainty-aware relational graph neural network (UR-GNN) to conduct convolution ope",
    "link": "https://arxiv.org/abs/2403.04521",
    "context": "Title: Uncertainty-Aware Relational Graph Neural Network for Few-Shot Knowledge Graph Completion\nAbstract: arXiv:2403.04521v1 Announce Type: new  Abstract: Few-shot knowledge graph completion (FKGC) aims to query the unseen facts of a relation given its few-shot reference entity pairs. The side effect of noises due to the uncertainty of entities and triples may limit the few-shot learning, but existing FKGC works neglect such uncertainty, which leads them more susceptible to limited reference samples with noises. In this paper, we propose a novel uncertainty-aware few-shot KG completion framework (UFKGC) to model uncertainty for a better understanding of the limited data by learning representations under Gaussian distribution. Uncertainty representation is first designed for estimating the uncertainty scope of the entity pairs after transferring feature representations into a Gaussian distribution. Further, to better integrate the neighbors with uncertainty characteristics for entity features, we design an uncertainty-aware relational graph neural network (UR-GNN) to conduct convolution ope",
    "path": "papers/24/03/2403.04521.json",
    "total_tokens": 785,
    "translated_title": "不确定性感知关系图神经网络用于少样本知识图谱补全",
    "translated_abstract": "少样本知识图谱补全旨在在给定少量案例参考实体对的情况下查询某种关系的未知事实。本文提出了一种新颖的不确定性感知少样本知识图谱补全框架（UFKGC），以模拟不确定性，更好地理解有限数据，通过学习服从高斯分布的表示来避免由实体和三元组不确定性导致的噪声副作用，先为源实体对的不确定性范围设计不确定性表示，然后将特征表示转换为高斯分布。为了更好地整合具有不确定特征的邻居以用于实体特征，我们设计了一种不确定性感知的关系图神经网络（UR-GNN）进行卷积操作。",
    "tldr": "提出一种不确定性感知的少样本知识图谱补全框架以模拟实体和三元组不确定性，通过学习服从高斯分布的表示来更好地理解有限数据。",
    "en_tdlr": "Introducing an uncertainty-aware few-shot knowledge graph completion framework to model uncertainty of entities and triples, enabling better understanding of limited data through learning representations following Gaussian distribution."
}