{
    "title": "A Note on High-Probability Analysis of Algorithms with Exponential, Sub-Gaussian, and General Light Tails",
    "abstract": "arXiv:2403.02873v1 Announce Type: new  Abstract: This short note describes a simple technique for analyzing probabilistic algorithms that rely on a light-tailed (but not necessarily bounded) source of randomization. We show that the analysis of such an algorithm can be reduced, in a black-box manner and with only a small loss in logarithmic factors, to an analysis of a simpler variant of the same algorithm that uses bounded random variables and often easier to analyze. This approach simultaneously applies to any light-tailed randomization, including exponential, sub-Gaussian, and more general fast-decaying distributions, without needing to appeal to specialized concentration inequalities. Analyses of a generalized Azuma inequality and stochastic optimization with general light-tailed noise are provided to illustrate the technique.",
    "link": "https://arxiv.org/abs/2403.02873",
    "context": "Title: A Note on High-Probability Analysis of Algorithms with Exponential, Sub-Gaussian, and General Light Tails\nAbstract: arXiv:2403.02873v1 Announce Type: new  Abstract: This short note describes a simple technique for analyzing probabilistic algorithms that rely on a light-tailed (but not necessarily bounded) source of randomization. We show that the analysis of such an algorithm can be reduced, in a black-box manner and with only a small loss in logarithmic factors, to an analysis of a simpler variant of the same algorithm that uses bounded random variables and often easier to analyze. This approach simultaneously applies to any light-tailed randomization, including exponential, sub-Gaussian, and more general fast-decaying distributions, without needing to appeal to specialized concentration inequalities. Analyses of a generalized Azuma inequality and stochastic optimization with general light-tailed noise are provided to illustrate the technique.",
    "path": "papers/24/03/2403.02873.json",
    "total_tokens": 815,
    "translated_title": "关于具有指数、亚高斯和一般轻尾的高概率分析算法的注解",
    "translated_abstract": "这篇简短的注解描述了一种分析概率算法的简单技术，该算法依赖于一个轻尾（但不一定有界）的随机化来源。我们展示了这样一个算法的分析可以通过黑盒方式减少，只在对数因子中有小量损失，转化为分析同一算法的一个更简单变体，该变体使用有界随机变量，通常更容易分析。这种方法同时适用于任何轻尾随机化，包括指数、亚高斯和更一般的快速衰减分布，而不需要调用专门的集中不等式。提供了对一般化Azuma不等式和具有一般轻尾噪声的随机优化的分析，以说明该技术。",
    "tldr": "这种技术可以简化分析依赖轻尾随机源的算法，通过对较简单的算法变体进行分析，避免使用专门的集中不等式，并且适用于指数、亚高斯和更一般的快速衰减分布。",
    "en_tdlr": "This technique simplifies the analysis of algorithms relying on light-tailed random sources by analyzing a simpler variant of the algorithm, avoiding specialized concentration inequalities, and applies to exponential, sub-Gaussian, and more general fast-decaying distributions."
}