{
    "title": "Blue and Green-Mode Energy-Efficient Chemiresistive Sensor Array Realized by Rapid Ensemble Learning",
    "abstract": "arXiv:2403.01642v1 Announce Type: new  Abstract: The rapid advancement of Internet of Things (IoT) necessitates the development of optimized Chemiresistive Sensor (CRS) arrays that are both energy-efficient and capable. This study introduces a novel optimization strategy that employs a rapid ensemble learning-based model committee approach to achieve these goals. Utilizing machine learning models such as Elastic Net Regression, Random Forests, and XGBoost, among others, the strategy identifies the most impactful sensors in a CRS array for accurate classification: A weighted voting mechanism is introduced to aggregate the models' opinions in sensor selection, thereby setting up wo distinct working modes, termed \"Blue\" and \"Green\". The Blue mode operates with all sensors for maximum detection capability, while the Green mode selectively activates only key sensors, significantly reducing energy consumption without compromising detection accuracy. The strategy is validated through theoreti",
    "link": "https://arxiv.org/abs/2403.01642",
    "context": "Title: Blue and Green-Mode Energy-Efficient Chemiresistive Sensor Array Realized by Rapid Ensemble Learning\nAbstract: arXiv:2403.01642v1 Announce Type: new  Abstract: The rapid advancement of Internet of Things (IoT) necessitates the development of optimized Chemiresistive Sensor (CRS) arrays that are both energy-efficient and capable. This study introduces a novel optimization strategy that employs a rapid ensemble learning-based model committee approach to achieve these goals. Utilizing machine learning models such as Elastic Net Regression, Random Forests, and XGBoost, among others, the strategy identifies the most impactful sensors in a CRS array for accurate classification: A weighted voting mechanism is introduced to aggregate the models' opinions in sensor selection, thereby setting up wo distinct working modes, termed \"Blue\" and \"Green\". The Blue mode operates with all sensors for maximum detection capability, while the Green mode selectively activates only key sensors, significantly reducing energy consumption without compromising detection accuracy. The strategy is validated through theoreti",
    "path": "papers/24/03/2403.01642.json",
    "total_tokens": 909,
    "translated_title": "通过快速集成学习实现的蓝绿模式高能效化化学传感器阵列",
    "translated_abstract": "arXiv:2403.01642v1 公告类型: 新的 摘要: 物联网的快速发展需要开发既高效又能胜任的优化化学传感器阵列。本研究引入一种新颖的优化策略，采用快速集成学习模型委员会方法来实现这些目标。利用弹性网回归、随机森林、XGBoost等机器学习模型，该策略识别出在化学传感器阵列中对准确分类最具影响力的传感器：引入加权投票机制来聚合传感器选择中的模型意见，从而建立了两种不同的工作模式，称为“蓝色”和“绿色”。蓝色模式利用所有传感器进行最大检测能力，而绿色模式仅选择性激活关键传感器，从而显著降低能耗而不影响检测准确性。该策略通过理论验证。",
    "tldr": "该研究提出了一种通过快速集成学习优化化学传感器阵列的策略，引入了蓝色和绿色两种工作模式，通过选择性激活关键传感器显著降低能耗而不影响检测准确性。"
}