{
    "title": "Rethinking Low-quality Optical Flow in Unsupervised Surgical Instrument Segmentation",
    "abstract": "arXiv:2403.10039v1 Announce Type: cross  Abstract: Video-based surgical instrument segmentation plays an important role in robot-assisted surgeries. Unlike supervised settings, unsupervised segmentation relies heavily on motion cues, which are challenging to discern due to the typically lower quality of optical flow in surgical footage compared to natural scenes. This presents a considerable burden for the advancement of unsupervised segmentation techniques. In our work, we address the challenge of enhancing model performance despite the inherent limitations of low-quality optical flow. Our methodology employs a three-pronged approach: extracting boundaries directly from the optical flow, selectively discarding frames with inferior flow quality, and employing a fine-tuning process with variable frame rates. We thoroughly evaluate our strategy on the EndoVis2017 VOS dataset and Endovis2017 Challenge dataset, where our model demonstrates promising results, achieving a mean Intersection-o",
    "link": "https://arxiv.org/abs/2403.10039",
    "context": "Title: Rethinking Low-quality Optical Flow in Unsupervised Surgical Instrument Segmentation\nAbstract: arXiv:2403.10039v1 Announce Type: cross  Abstract: Video-based surgical instrument segmentation plays an important role in robot-assisted surgeries. Unlike supervised settings, unsupervised segmentation relies heavily on motion cues, which are challenging to discern due to the typically lower quality of optical flow in surgical footage compared to natural scenes. This presents a considerable burden for the advancement of unsupervised segmentation techniques. In our work, we address the challenge of enhancing model performance despite the inherent limitations of low-quality optical flow. Our methodology employs a three-pronged approach: extracting boundaries directly from the optical flow, selectively discarding frames with inferior flow quality, and employing a fine-tuning process with variable frame rates. We thoroughly evaluate our strategy on the EndoVis2017 VOS dataset and Endovis2017 Challenge dataset, where our model demonstrates promising results, achieving a mean Intersection-o",
    "path": "papers/24/03/2403.10039.json",
    "total_tokens": 916,
    "translated_title": "重新思考无监督手术器械分割中低质量光流问题",
    "translated_abstract": "视频的手术器械分割在机器人辅助手术中扮演着重要角色。与监督设置不同，无监督分割主要依赖于运动线索，然而由于手术镜头中光流通常比自然场景中的要低质量，这些运动线索很难识别。本研究致力于解决即使面对低质量光流固有限制，提高模型性能的挑战。我们的方法从三个方面入手：直接从光流中提取边界、有选择地丢弃质量较差的帧、以及利用可变帧率的微调过程。我们在EndoVis2017 VOS数据集和Endovis2017挑战数据集上对我们的策略进行了彻底评估，模型展现出有前景的结果，实现了均值交叉。",
    "tldr": "本研究在无监督手术器械分割中解决了由于低质量光流而引起的挑战，提出了一种三重策略：直接从光流中提取边界、选择性丢弃质量较差的帧、以及利用可变帧率进行微调。在数据集上进行了充分评估，展示出有前景的结果。",
    "en_tdlr": "This study addresses the challenge posed by low-quality optical flow in unsupervised surgical instrument segmentation by proposing a three-pronged strategy: extracting boundaries directly from the optical flow, selectively discarding frames with inferior quality, and employing fine-tuning with variable frame rates. The strategy is thoroughly evaluated on datasets, demonstrating promising results."
}