{
    "title": "Training Generative Adversarial Network-Based Vocoder with Limited Data Using Augmentation-Conditional Discriminator",
    "abstract": "arXiv:2403.16464v1 Announce Type: cross  Abstract: A generative adversarial network (GAN)-based vocoder trained with an adversarial discriminator is commonly used for speech synthesis because of its fast, lightweight, and high-quality characteristics. However, this data-driven model requires a large amount of training data incurring high data-collection costs. This fact motivates us to train a GAN-based vocoder on limited data. A promising solution is to augment the training data to avoid overfitting. However, a standard discriminator is unconditional and insensitive to distributional changes caused by data augmentation. Thus, augmented speech (which can be extraordinary) may be considered real speech. To address this issue, we propose an augmentation-conditional discriminator (AugCondD) that receives the augmentation state as input in addition to speech, thereby assessing the input speech according to the augmentation state, without inhibiting the learning of the original non-augmente",
    "link": "https://arxiv.org/abs/2403.16464",
    "context": "Title: Training Generative Adversarial Network-Based Vocoder with Limited Data Using Augmentation-Conditional Discriminator\nAbstract: arXiv:2403.16464v1 Announce Type: cross  Abstract: A generative adversarial network (GAN)-based vocoder trained with an adversarial discriminator is commonly used for speech synthesis because of its fast, lightweight, and high-quality characteristics. However, this data-driven model requires a large amount of training data incurring high data-collection costs. This fact motivates us to train a GAN-based vocoder on limited data. A promising solution is to augment the training data to avoid overfitting. However, a standard discriminator is unconditional and insensitive to distributional changes caused by data augmentation. Thus, augmented speech (which can be extraordinary) may be considered real speech. To address this issue, we propose an augmentation-conditional discriminator (AugCondD) that receives the augmentation state as input in addition to speech, thereby assessing the input speech according to the augmentation state, without inhibiting the learning of the original non-augmente",
    "path": "papers/24/03/2403.16464.json",
    "total_tokens": 878,
    "translated_title": "使用增强条件鉴别器在有限数据下训练生成对抗网络声码器",
    "translated_abstract": "生成对抗网络（GAN）声码器在语音合成中常用，因为它具有快速、轻量和高质量的特点。然而，这种数据驱动模型需要大量训练数据，导致高昂的数据采集成本。这促使我们在有限数据下训练GAN声码器。一种有前途的解决方案是增强训练数据以避免过拟合。然而，标准鉴别器是无条件的，对于由数据增强引起的分布变化不敏感。因此，增强后的语音（可能非常出色）可能被认为是真实语音。为了解决这个问题，我们提出了一种增强条件鉴别器（AugCondD），除了语音外，它还接收增强状态作为输入，从而根据增强状态评估输入语音，而不抑制原始的非增强学习。",
    "tldr": "本文提出使用增强条件鉴别器在有限数据下训练生成对抗网络声码器，以避免数据采集成本高的问题，解决了标准鉴别器对增强数据的不敏感性，提高了模型的泛化能力。",
    "en_tdlr": "This paper proposes training a Generative Adversarial Network-based vocoder with limited data using an augmentation-conditional discriminator to mitigate the high data collection costs, addressing the insensitivity of standard discriminator to augmented data, and improving the model's generalization ability."
}