{
    "title": "From Pixels to Predictions: Spectrogram and Vision Transformer for Better Time Series Forecasting",
    "abstract": "arXiv:2403.11047v1 Announce Type: cross  Abstract: Time series forecasting plays a crucial role in decision-making across various domains, but it presents significant challenges. Recent studies have explored image-driven approaches using computer vision models to address these challenges, often employing lineplots as the visual representation of time series data. In this paper, we propose a novel approach that uses time-frequency spectrograms as the visual representation of time series data. We introduce the use of a vision transformer for multimodal learning, showcasing the advantages of our approach across diverse datasets from different domains. To evaluate its effectiveness, we compare our method against statistical baselines (EMA and ARIMA), a state-of-the-art deep learning-based approach (DeepAR), other visual representations of time series data (lineplot images), and an ablation study on using only the time series as input. Our experiments demonstrate the benefits of utilizing s",
    "link": "https://arxiv.org/abs/2403.11047",
    "context": "Title: From Pixels to Predictions: Spectrogram and Vision Transformer for Better Time Series Forecasting\nAbstract: arXiv:2403.11047v1 Announce Type: cross  Abstract: Time series forecasting plays a crucial role in decision-making across various domains, but it presents significant challenges. Recent studies have explored image-driven approaches using computer vision models to address these challenges, often employing lineplots as the visual representation of time series data. In this paper, we propose a novel approach that uses time-frequency spectrograms as the visual representation of time series data. We introduce the use of a vision transformer for multimodal learning, showcasing the advantages of our approach across diverse datasets from different domains. To evaluate its effectiveness, we compare our method against statistical baselines (EMA and ARIMA), a state-of-the-art deep learning-based approach (DeepAR), other visual representations of time series data (lineplot images), and an ablation study on using only the time series as input. Our experiments demonstrate the benefits of utilizing s",
    "path": "papers/24/03/2403.11047.json",
    "total_tokens": 851,
    "translated_title": "从像素到预测：谱图和视觉变换器在更好的时间序列预测中的应用",
    "translated_abstract": "时间序列预测在各个领域的决策制定中起着至关重要的作用，但也存在重大挑战。最近的研究探索了使用计算机视觉模型的基于图像的方法来解决这些挑战，通常采用线图作为时间序列数据的视觉表示。本文提出了一种新颖方法，使用时间-频率谱图作为时间序列数据的视觉表示。我们引入了视觉变换器用于多模态学习，展示了我们方法在来自不同领域的多样数据集上的优势。为了评估其有效性，我们将我们的方法与统计基线（EMA和ARIMA）、最先进的基于深度学习的方法（DeepAR）、其他时间序列数据的视觉表示（线图像）以及仅使用时间序列作为输入的消融研究进行了比较。我们的实验表明利用谱图和视觉变换器技术在时间序列预测中具有重要优势。",
    "tldr": "提出了使用谱图作为时间序列数据的视觉表示，并引入了视觉变换器进行多模态学习，在多个领域的数据集上展示出明显优势。",
    "en_tdlr": "Proposed using spectrograms as visual representation of time series data and introduced vision transformer for multimodal learning, demonstrating significant advantages across datasets from different domains."
}