{
    "title": "Unleashing Graph Partitioning for Large-Scale Nearest Neighbor Search",
    "abstract": "arXiv:2403.01797v1 Announce Type: cross  Abstract: We consider the fundamental problem of decomposing a large-scale approximate nearest neighbor search (ANNS) problem into smaller sub-problems. The goal is to partition the input points into neighborhood-preserving shards, so that the nearest neighbors of any point are contained in only a few shards. When a query arrives, a routing algorithm is used to identify the shards which should be searched for its nearest neighbors. This approach forms the backbone of distributed ANNS, where the dataset is so large that it must be split across multiple machines.   In this paper, we design simple and highly efficient routing methods, and prove strong theoretical guarantees on their performance. A crucial characteristic of our routing algorithms is that they are inherently modular, and can be used with any partitioning method. This addresses a key drawback of prior approaches, where the routing algorithms are inextricably linked to their associated",
    "link": "https://arxiv.org/abs/2403.01797",
    "context": "Title: Unleashing Graph Partitioning for Large-Scale Nearest Neighbor Search\nAbstract: arXiv:2403.01797v1 Announce Type: cross  Abstract: We consider the fundamental problem of decomposing a large-scale approximate nearest neighbor search (ANNS) problem into smaller sub-problems. The goal is to partition the input points into neighborhood-preserving shards, so that the nearest neighbors of any point are contained in only a few shards. When a query arrives, a routing algorithm is used to identify the shards which should be searched for its nearest neighbors. This approach forms the backbone of distributed ANNS, where the dataset is so large that it must be split across multiple machines.   In this paper, we design simple and highly efficient routing methods, and prove strong theoretical guarantees on their performance. A crucial characteristic of our routing algorithms is that they are inherently modular, and can be used with any partitioning method. This addresses a key drawback of prior approaches, where the routing algorithms are inextricably linked to their associated",
    "path": "papers/24/03/2403.01797.json",
    "total_tokens": 779,
    "translated_title": "大规模最近邻搜索的图分区技术",
    "translated_abstract": "我们考虑将大规模近似最近邻搜索（ANNS）问题分解为较小子问题的基本问题。目标是将输入点分区为保留邻域的碎片，以便任何点的最近邻居仅包含在少数碎片中。当查询到达时，将使用路由算法识别应该搜索其最近邻居的碎片。这种方法构建了分布式ANNS的骨干，其中数据集非常庞大，必须跨多台机器进行拆分。本文设计了简单且高效的路由方法，并证明了它们性能的强大理论保证。我们的路由算法的一个关键特征是它们是固有模块化的，可以与任何分区方法一起使用。这解决了以往方法的一个关键缺点，即路由算法与其关联部分紧密相连。",
    "tldr": "本文设计了可与任何分区方法一起使用的简单有效的路由方法，并在性能上证明了强大的理论保证。",
    "en_tdlr": "This paper presents simple and efficient routing methods that can be used with any partitioning method, and provides strong theoretical guarantees on their performance."
}