{
    "title": "Iterative Forgetting: Online Data Stream Regression Using Database-Inspired Adaptive Granulation",
    "abstract": "arXiv:2403.09588v1 Announce Type: new  Abstract: Many modern systems, such as financial, transportation, and telecommunications systems, are time-sensitive in the sense that they demand low-latency predictions for real-time decision-making. Such systems often have to contend with continuous unbounded data streams as well as concept drift, which are challenging requirements that traditional regression techniques are unable to cater to. There exists a need to create novel data stream regression methods that can handle these scenarios. We present a database-inspired datastream regression model that (a) uses inspiration from R*-trees to create granules from incoming datastreams such that relevant information is retained, (b) iteratively forgets granules whose information is deemed to be outdated, thus maintaining a list of only recent, relevant granules, and (c) uses the recent data and granules to provide low-latency predictions. The R*-tree-inspired approach also makes the algorithm amen",
    "link": "https://arxiv.org/abs/2403.09588",
    "context": "Title: Iterative Forgetting: Online Data Stream Regression Using Database-Inspired Adaptive Granulation\nAbstract: arXiv:2403.09588v1 Announce Type: new  Abstract: Many modern systems, such as financial, transportation, and telecommunications systems, are time-sensitive in the sense that they demand low-latency predictions for real-time decision-making. Such systems often have to contend with continuous unbounded data streams as well as concept drift, which are challenging requirements that traditional regression techniques are unable to cater to. There exists a need to create novel data stream regression methods that can handle these scenarios. We present a database-inspired datastream regression model that (a) uses inspiration from R*-trees to create granules from incoming datastreams such that relevant information is retained, (b) iteratively forgets granules whose information is deemed to be outdated, thus maintaining a list of only recent, relevant granules, and (c) uses the recent data and granules to provide low-latency predictions. The R*-tree-inspired approach also makes the algorithm amen",
    "path": "papers/24/03/2403.09588.json",
    "total_tokens": 807,
    "translated_title": "迭代遗忘：使用数据库启发的自适应粒化进行在线数据流回归",
    "translated_abstract": "许多现代系统，如金融、交通和电信系统，在时间上敏感，要求实时决策需要低延迟的预测。这些系统通常必须处理连续的无界数据流以及概念漂移，这是传统回归技术无法解决的挑战性需求。我们提出了一种受数据库启发的数据流回归模型，它（a）借鉴了R*-树的灵感，从传入的数据流中创建粒子，以保留相关信息，（b）迭代性地遗忘被认为已过时的粒子，从而维护仅包含最近的相关粒子列表，（c）使用最近的数据和粒子提供低延迟预测。这种受R*-树启发的方法还使算法具有扩展性",
    "tldr": "提出了一种受数据库启发的在线数据流回归模型，通过迭代遗忘过时数据粒子，以保持只有最近的相关信息，从而实现低延迟预测。"
}