{
    "title": "ChatGPT4PCG 2 Competition: Prompt Engineering for Science Birds Level Generation",
    "abstract": "arXiv:2403.02610v1 Announce Type: new  Abstract: This paper presents the second ChatGPT4PCG competition at the 2024 IEEE Conference on Games. In this edition of the competition, we follow the first edition, but make several improvements and changes. We introduce a new evaluation metric along with allowing a more flexible format for participants' submissions and making several improvements to the evaluation pipeline. Continuing from the first edition, we aim to foster and explore the realm of prompt engineering (PE) for procedural content generation (PCG). While the first competition saw success, it was hindered by various limitations; we aim to mitigate these limitations in this edition. We introduce diversity as a new metric to discourage submissions aimed at producing repetitive structures. Furthermore, we allow submission of a Python program instead of a prompt text file for greater flexibility in implementing advanced PE approaches, which may require control flow, including conditi",
    "link": "https://arxiv.org/abs/2403.02610",
    "context": "Title: ChatGPT4PCG 2 Competition: Prompt Engineering for Science Birds Level Generation\nAbstract: arXiv:2403.02610v1 Announce Type: new  Abstract: This paper presents the second ChatGPT4PCG competition at the 2024 IEEE Conference on Games. In this edition of the competition, we follow the first edition, but make several improvements and changes. We introduce a new evaluation metric along with allowing a more flexible format for participants' submissions and making several improvements to the evaluation pipeline. Continuing from the first edition, we aim to foster and explore the realm of prompt engineering (PE) for procedural content generation (PCG). While the first competition saw success, it was hindered by various limitations; we aim to mitigate these limitations in this edition. We introduce diversity as a new metric to discourage submissions aimed at producing repetitive structures. Furthermore, we allow submission of a Python program instead of a prompt text file for greater flexibility in implementing advanced PE approaches, which may require control flow, including conditi",
    "path": "papers/24/03/2403.02610.json",
    "total_tokens": 861,
    "translated_title": "ChatGPT4PCG 2比赛：为科学鸟级别生成设计提示工程",
    "translated_abstract": "本文介绍了2024年IEEE游戏大会上第二届ChatGPT4PCG比赛。在这一届比赛中，我们沿袭第一届的基础上做出了几项改进和变化。我们引入了一个新的评估指标，并允许参与者以更灵活的格式提交作品，并对评估流程进行了几项改进。延续第一届比赛的精神，我们旨在促进和探索提示工程（PE）在程序内容生成（PCG）中的应用。虽然第一次比赛取得了成功，但也受到了各种限制的阻碍；我们旨在在这次比赛中缓解这些限制。我们引入了多样性作为一个新的指标，以阻止产生重复结构的作品。此外，为了更灵活地实现先进的PE方法，我们允许提交Python程序而不是提示文本文件，这些方法可能需要控制流，包括条件",
    "tldr": "本文介绍了2024年IEEE游戏大会上第二届ChatGPT4PCG比赛，引入多样性作为新的指标，允许提交Python程序以实现更灵活的先进提示工程方法。",
    "en_tdlr": "This paper presents the second ChatGPT4PCG competition at the 2024 IEEE Conference on Games, introducing diversity as a new metric and allowing submission of Python programs for more flexible implementation of advanced prompt engineering approaches."
}