{
    "title": "Absence of spurious solutions far from ground truth: A low-rank analysis with high-order losses",
    "abstract": "arXiv:2403.06056v1 Announce Type: cross  Abstract: Matrix sensing problems exhibit pervasive non-convexity, plaguing optimization with a proliferation of suboptimal spurious solutions. Avoiding convergence to these critical points poses a major challenge. This work provides new theoretical insights that help demystify the intricacies of the non-convex landscape. In this work, we prove that under certain conditions, critical points sufficiently distant from the ground truth matrix exhibit favorable geometry by being strict saddle points rather than troublesome local minima. Moreover, we introduce the notion of higher-order losses for the matrix sensing problem and show that the incorporation of such losses into the objective function amplifies the negative curvature around those distant critical points. This implies that increasing the complexity of the objective function via high-order losses accelerates the escape from such critical points and acts as a desirable alternative to increa",
    "link": "https://arxiv.org/abs/2403.06056",
    "context": "Title: Absence of spurious solutions far from ground truth: A low-rank analysis with high-order losses\nAbstract: arXiv:2403.06056v1 Announce Type: cross  Abstract: Matrix sensing problems exhibit pervasive non-convexity, plaguing optimization with a proliferation of suboptimal spurious solutions. Avoiding convergence to these critical points poses a major challenge. This work provides new theoretical insights that help demystify the intricacies of the non-convex landscape. In this work, we prove that under certain conditions, critical points sufficiently distant from the ground truth matrix exhibit favorable geometry by being strict saddle points rather than troublesome local minima. Moreover, we introduce the notion of higher-order losses for the matrix sensing problem and show that the incorporation of such losses into the objective function amplifies the negative curvature around those distant critical points. This implies that increasing the complexity of the objective function via high-order losses accelerates the escape from such critical points and acts as a desirable alternative to increa",
    "path": "papers/24/03/2403.06056.json",
    "total_tokens": 898,
    "translated_title": "远离真实解的虚假解析无：具有高阶损失的低秩分析",
    "translated_abstract": "矩阵感知问题展现出普遍的非凸性，困扰着优化过程中大量次优虚假解的蔓延。避免收敛到这些临界点构成了一项重大挑战。本文提供了有助于揭示非凸景观复杂性的新的理论见解。在这项工作中，我们证明在某些条件下，远离真实矩阵的临界点呈现出有利的几何特性，即严格鞍点，而非令人头疼的局部最小值。此外，我们引入了矩阵感知问题的高阶损失概念，并展示将这些损失纳入目标函数可以增大围绕这些远离临界点的负曲率。这意味着通过高阶损失增加目标函数的复杂性可以加速摆脱这些临界点，并且作为一种理想的替代方式。",
    "tldr": "本研究证明了在某些条件下，远离真实解的关键点表现出有利的严格鞍点几何结构，并介绍了高阶损失的概念，通过将其纳入目标函数增加负曲率，从而加速摆脱这些临界点。",
    "en_tdlr": "This study proves that under certain conditions, critical points far from the ground truth exhibit favorable geometry as strict saddle points, and introduces the concept of high-order losses to accelerate escaping from these critical points by increasing negative curvature."
}