{
    "title": "Memetic Differential Evolution Methods for Semi-Supervised Clustering",
    "abstract": "arXiv:2403.04322v1 Announce Type: cross  Abstract: In this paper, we deal with semi-supervised Minimum Sum-of-Squares Clustering (MSSC) problems where background knowledge is given in the form of instance-level constraints. In particular, we take into account \"must-link\" and \"cannot-link\" constraints, each of which indicates if two dataset points should be associated to the same or to a different cluster. The presence of such constraints makes the problem at least as hard as its unsupervised version: it is no more true that each point is associated to its nearest cluster center, thus requiring some modifications in crucial operations, such as the assignment step. In this scenario, we propose a novel memetic strategy based on the Differential Evolution paradigm, directly extending a state-of-the-art framework recently proposed in the unsupervised clustering literature. As far as we know, our contribution represents the first attempt to define a memetic methodology designed to generate a",
    "link": "https://arxiv.org/abs/2403.04322",
    "context": "Title: Memetic Differential Evolution Methods for Semi-Supervised Clustering\nAbstract: arXiv:2403.04322v1 Announce Type: cross  Abstract: In this paper, we deal with semi-supervised Minimum Sum-of-Squares Clustering (MSSC) problems where background knowledge is given in the form of instance-level constraints. In particular, we take into account \"must-link\" and \"cannot-link\" constraints, each of which indicates if two dataset points should be associated to the same or to a different cluster. The presence of such constraints makes the problem at least as hard as its unsupervised version: it is no more true that each point is associated to its nearest cluster center, thus requiring some modifications in crucial operations, such as the assignment step. In this scenario, we propose a novel memetic strategy based on the Differential Evolution paradigm, directly extending a state-of-the-art framework recently proposed in the unsupervised clustering literature. As far as we know, our contribution represents the first attempt to define a memetic methodology designed to generate a",
    "path": "papers/24/03/2403.04322.json",
    "total_tokens": 831,
    "translated_title": "基于遗传模拟的差分进化方法用于半监督聚类",
    "translated_abstract": "在本文中，我们处理半监督最小平方和聚类(MSSC)问题，其中背景知识以实例级约束的形式给定。我们特别考虑“必连接”和“非连接”约束，每个约束指示两个数据集点是否应该关联到同一个或不同的簇中。这些约束的存在使得问题至少与其无监督版本一样困难：不再每个点都关联到其最近的簇中心，因此需要在关键操作（如分配步骤）中进行一些修改。在这种情况下，我们提出了一种基于差分进化范式的新颖遗传模拟策略，直接扩展了最近在无监督聚类文献中提出的最新框架。据我们所知，我们的贡献代表了第一次尝试定义一个旨在生成一个",
    "tldr": "本文提出了一种基于差分进化范式的新颖遗传模拟策略，用于解决半监督聚类问题，是第一次在这个领域尝试定义这样的方法。",
    "en_tdlr": "This paper proposes a novel memetic strategy based on the Differential Evolution paradigm for addressing semi-supervised clustering problems, representing the first attempt in this domain to define such a method."
}