{
    "title": "Cooperative Classification and Rationalization for Graph Generalization",
    "abstract": "arXiv:2403.06239v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have achieved impressive results in graph classification tasks, but they struggle to generalize effectively when faced with out-of-distribution (OOD) data. Several approaches have been proposed to address this problem. Among them, one solution is to diversify training distributions in vanilla classification by modifying the data environment, yet accessing the environment information is complex. Besides, another promising approach involves rationalization, extracting invariant rationales for predictions. However, extracting rationales is difficult due to limited learning signals, resulting in less accurate rationales and diminished predictions. To address these challenges, in this paper, we propose a Cooperative Classification and Rationalization (C2R) method, consisting of the classification and the rationalization module. Specifically, we first assume that multiple environments are available in the classif",
    "link": "https://arxiv.org/abs/2403.06239",
    "context": "Title: Cooperative Classification and Rationalization for Graph Generalization\nAbstract: arXiv:2403.06239v1 Announce Type: cross  Abstract: Graph Neural Networks (GNNs) have achieved impressive results in graph classification tasks, but they struggle to generalize effectively when faced with out-of-distribution (OOD) data. Several approaches have been proposed to address this problem. Among them, one solution is to diversify training distributions in vanilla classification by modifying the data environment, yet accessing the environment information is complex. Besides, another promising approach involves rationalization, extracting invariant rationales for predictions. However, extracting rationales is difficult due to limited learning signals, resulting in less accurate rationales and diminished predictions. To address these challenges, in this paper, we propose a Cooperative Classification and Rationalization (C2R) method, consisting of the classification and the rationalization module. Specifically, we first assume that multiple environments are available in the classif",
    "path": "papers/24/03/2403.06239.json",
    "total_tokens": 847,
    "translated_title": "合作分类与理性化用于图泛化",
    "translated_abstract": "arXiv:2403.06239v1 公告类型: 跨界 摘要: 图神经网络（GNNs）在图分类任务中取得了令人印象深刻的结果，但面对分布之外的数据时很难有效泛化。已经提出了几种方法来解决这个问题。其中之一的解决方案是通过修改数据环境来使原始分类的训练分布多样化，但访问环境信息较为复杂。另一个有前途的方法涉及理性化，提取用于预测的不变原理。然而，由于学习信号有限，提取原理是困难的，导致较不准确的原理和减弱的预测。为了解决这些挑战，在本文中，我们提出了一种合作分类与理性化（C2R）方法，包括分类模块和理性化模块。具体地，我们首先假设分类中存在多个环境",
    "tldr": "本文提出了一种合作分类与理性化（C2R）方法，旨在解决图神经网络在泛化时面临的挑战，通过分类和理性化模块协同工作，改善对分布之外数据的泛化能力。",
    "en_tdlr": "This paper proposes a Cooperative Classification and Rationalization (C2R) method to address the challenges faced by Graph Neural Networks in generalization, aiming to enhance the generalization ability to out-of-distribution data through the collaboration of classification and rationalization modules."
}