{
    "title": "PCToolkit: A Unified Plug-and-Play Prompt Compression Toolkit of Large Language Models",
    "abstract": "arXiv:2403.17411v1 Announce Type: new  Abstract: Prompt compression is an innovative method for efficiently condensing input prompts while preserving essential information. To facilitate quick-start services, user-friendly interfaces, and compatibility with common datasets and metrics, we present the Prompt Compression Toolkit (PCToolkit). This toolkit is a unified plug-and-play solution for compressing prompts in Large Language Models (LLMs), featuring cutting-edge prompt compressors, diverse datasets, and metrics for comprehensive performance evaluation. PCToolkit boasts a modular design, allowing for easy integration of new datasets and metrics through portable and user-friendly interfaces. In this paper, we outline the key components and functionalities of PCToolkit. We conducted evaluations of the compressors within PCToolkit across various natural language tasks, including reconstruction, summarization, mathematical problem-solving, question answering, few-shot learning, syntheti",
    "link": "https://arxiv.org/abs/2403.17411",
    "context": "Title: PCToolkit: A Unified Plug-and-Play Prompt Compression Toolkit of Large Language Models\nAbstract: arXiv:2403.17411v1 Announce Type: new  Abstract: Prompt compression is an innovative method for efficiently condensing input prompts while preserving essential information. To facilitate quick-start services, user-friendly interfaces, and compatibility with common datasets and metrics, we present the Prompt Compression Toolkit (PCToolkit). This toolkit is a unified plug-and-play solution for compressing prompts in Large Language Models (LLMs), featuring cutting-edge prompt compressors, diverse datasets, and metrics for comprehensive performance evaluation. PCToolkit boasts a modular design, allowing for easy integration of new datasets and metrics through portable and user-friendly interfaces. In this paper, we outline the key components and functionalities of PCToolkit. We conducted evaluations of the compressors within PCToolkit across various natural language tasks, including reconstruction, summarization, mathematical problem-solving, question answering, few-shot learning, syntheti",
    "path": "papers/24/03/2403.17411.json",
    "total_tokens": 860,
    "translated_title": "PCToolkit：大型语言模型统一即插即用提示压缩工具包",
    "translated_abstract": "arXiv:2403.17411v1 公告类型: 新的 提取要点是一种创新方法，旨在高效压缩输入提示同时保留关键信息。为了促进快速启动服务、用户友好的界面，并与常见数据集和指标兼容，我们提出了提示压缩工具包（PCToolkit）。该工具包是用于在大型语言模型（LLMs）中压缩提示的统一即插即用解决方案，具有尖端的提示压缩器、多样的数据集和用于全面性能评估的指标。PCToolkit拥有模块化设计，通过便携和用户友好的界面，可以轻松集成新的数据集和指标。在本文中，我们概述了PCToolkit的关键组件和功能。我们对PCToolkit内的压缩器进行了评估，涵盖了各种自然语言任务，包括重建、摘要、数学问题解决、问答、少样本学习、合成等。",
    "tldr": "PCToolkit是一个统一的即插即用解决方案，用于在大型语言模型中压缩提示，包括尖端的压缩器、多样的数据集和综合性能评估指标。",
    "en_tdlr": "PCToolkit is a unified plug-and-play solution for prompt compression in Large Language Models (LLMs), featuring cutting-edge compressors, diverse datasets, and comprehensive performance evaluation metrics."
}