{
    "title": "Causality from Bottom to Top: A Survey",
    "abstract": "arXiv:2403.11219v1 Announce Type: new  Abstract: Causality has become a fundamental approach for explaining the relationships between events, phenomena, and outcomes in various fields of study. It has invaded various fields and applications, such as medicine, healthcare, economics, finance, fraud detection, cybersecurity, education, public policy, recommender systems, anomaly detection, robotics, control, sociology, marketing, and advertising. In this paper, we survey its development over the past five decades, shedding light on the differences between causality and other approaches, as well as the preconditions for using it. Furthermore, the paper illustrates how causality interacts with new approaches such as Artificial Intelligence (AI), Generative AI (GAI), Machine and Deep Learning, Reinforcement Learning (RL), and Fuzzy Logic. We study the impact of causality on various fields, its contribution, and its interaction with state-of-the-art approaches. Additionally, the paper exempli",
    "link": "https://arxiv.org/abs/2403.11219",
    "context": "Title: Causality from Bottom to Top: A Survey\nAbstract: arXiv:2403.11219v1 Announce Type: new  Abstract: Causality has become a fundamental approach for explaining the relationships between events, phenomena, and outcomes in various fields of study. It has invaded various fields and applications, such as medicine, healthcare, economics, finance, fraud detection, cybersecurity, education, public policy, recommender systems, anomaly detection, robotics, control, sociology, marketing, and advertising. In this paper, we survey its development over the past five decades, shedding light on the differences between causality and other approaches, as well as the preconditions for using it. Furthermore, the paper illustrates how causality interacts with new approaches such as Artificial Intelligence (AI), Generative AI (GAI), Machine and Deep Learning, Reinforcement Learning (RL), and Fuzzy Logic. We study the impact of causality on various fields, its contribution, and its interaction with state-of-the-art approaches. Additionally, the paper exempli",
    "path": "papers/24/03/2403.11219.json",
    "total_tokens": 888,
    "translated_title": "自底向上的因果关系：一项调查",
    "translated_abstract": "因果关系已经成为解释各个研究领域中事件、现象和结果之间关系的基本方法。它已经渗透到医学、保健、经济学、金融、欺诈检测、网络安全、教育、公共政策、推荐系统、异常检测、机器人学、控制、社会学、营销和广告等各个领域和应用中。本文调查了因果关系在过去五十年中的发展，揭示了因果关系与其他方法之间的区别，以及使用它的先决条件。此外，本文阐明了因果关系如何与新方法如人工智能（AI）、生成人工智能（GAI）、机器学习和深度学习、强化学习（RL）和模糊逻辑相互作用。我们研究了因果关系对各领域的影响、其贡献以及与最先进方法的互动。此外，本论文还举例...",
    "tldr": "本文调查了因果关系在过去五十年中的发展，探讨了因果关系与其他方法的区别，以及其与人工智能等新方法的互动，研究了因果关系对各领域的影响和贡献。",
    "en_tdlr": "This paper surveys the development of causality over the past five decades, explores the differences between causality and other approaches, its interaction with new methods like Artificial Intelligence, and studies the impact and contribution of causality to various fields."
}