{
    "title": "Structure Your Data: Towards Semantic Graph Counterfactuals",
    "abstract": "arXiv:2403.06514v1 Announce Type: cross  Abstract: Counterfactual explanations (CEs) based on concepts are explanations that consider alternative scenarios to understand which high-level semantic features contributed to particular model predictions. In this work, we propose CEs based on the semantic graphs accompanying input data to achieve more descriptive, accurate, and human-aligned explanations. Building upon state-of-the-art (SoTA) conceptual attempts, we adopt a model-agnostic edit-based approach and introduce leveraging GNNs for efficient Graph Edit Distance (GED) computation. With a focus on the visual domain, we represent images as scene graphs and obtain their GNN embeddings to bypass solving the NP-hard graph similarity problem for all input pairs, an integral part of the CE computation process. We apply our method to benchmark and real-world datasets with varying difficulty and availability of semantic annotations. Testing on diverse classifiers, we find that our CEs outper",
    "link": "https://arxiv.org/abs/2403.06514",
    "context": "Title: Structure Your Data: Towards Semantic Graph Counterfactuals\nAbstract: arXiv:2403.06514v1 Announce Type: cross  Abstract: Counterfactual explanations (CEs) based on concepts are explanations that consider alternative scenarios to understand which high-level semantic features contributed to particular model predictions. In this work, we propose CEs based on the semantic graphs accompanying input data to achieve more descriptive, accurate, and human-aligned explanations. Building upon state-of-the-art (SoTA) conceptual attempts, we adopt a model-agnostic edit-based approach and introduce leveraging GNNs for efficient Graph Edit Distance (GED) computation. With a focus on the visual domain, we represent images as scene graphs and obtain their GNN embeddings to bypass solving the NP-hard graph similarity problem for all input pairs, an integral part of the CE computation process. We apply our method to benchmark and real-world datasets with varying difficulty and availability of semantic annotations. Testing on diverse classifiers, we find that our CEs outper",
    "path": "papers/24/03/2403.06514.json",
    "total_tokens": 883,
    "translated_title": "构建数据结构：走向语义图因果关系",
    "translated_abstract": "基于概念的反事实解释（CEs）是考虑替代情景以了解哪些高级语义特征对特定模型预测做出了贡献的解释。在这项工作中，我们提出了基于伴随输入数据的语义图的CEs，以实现更具描述性、准确性和与人类对齐的解释。借鉴最先进的概念尝试，我们采用了一个基于模型的编辑方法，并引入了利用GNN来实现高效的图编辑距离（GED）计算。我们将图形结构用于视觉领域，将图像表示为场景图，并获得它们的GNN嵌入以绕过解决所有输入对的NP困难图相似性问题，这是CE计算过程的一个重要部分。我们将我们的方法应用于具有不同难度和语义注释可用性的基准和真实世界数据集上。在各种分类器上进行测试，我们发现我们的CEs表现优异。",
    "tldr": "提出了基于语义图的反事实解释方法，利用GNN来进行高效的图编辑距离计算，通过场景图形式，绕过NP困难的图相似性问题，实现更具描述性、准确性和与人类对齐的解释。",
    "en_tdlr": "Proposed a method for counterfactual explanations based on semantic graphs, utilizing GNNs for efficient graph edit distance calculation to achieve more descriptive, accurate, and human-aligned explanations by representing images as scene graphs and bypassing the NP-hard graph similarity problem."
}