{
    "title": "News Media as Suppliers of Narratives (and Information)",
    "abstract": "arXiv:2403.09155v1 Announce Type: new  Abstract: We present a model of news media that shape consumer beliefs by providing information (signals about an exogenous state) and narratives (models of what determines outcomes). To amplify consumers' engagement, media maximize consumers' anticipatory utility. Focusing on a class of separable consumer preferences, we show that a monopolistic media platform facing homogenous consumers provides a false \"empowering\" narrative coupled with an optimistically biased signal. Consumer heterogeneity gives rise to a novel menu-design problem due to a \"data externality\" among consumers. The optimal menu features multiple narratives and creates polarized beliefs. These effects also arise in a competitive media market model.",
    "link": "https://arxiv.org/abs/2403.09155",
    "context": "Title: News Media as Suppliers of Narratives (and Information)\nAbstract: arXiv:2403.09155v1 Announce Type: new  Abstract: We present a model of news media that shape consumer beliefs by providing information (signals about an exogenous state) and narratives (models of what determines outcomes). To amplify consumers' engagement, media maximize consumers' anticipatory utility. Focusing on a class of separable consumer preferences, we show that a monopolistic media platform facing homogenous consumers provides a false \"empowering\" narrative coupled with an optimistically biased signal. Consumer heterogeneity gives rise to a novel menu-design problem due to a \"data externality\" among consumers. The optimal menu features multiple narratives and creates polarized beliefs. These effects also arise in a competitive media market model.",
    "path": "papers/24/03/2403.09155.json",
    "total_tokens": 742,
    "translated_title": "新闻媒体作为叙事（和信息）的提供者",
    "translated_abstract": "我们提出了一个新闻媒体模型，通过提供信息（关于外生状态的信号）和叙事（决定结果的模型）塑造消费者的信念。为了放大消费者的参与度，媒体最大化了消费者的预期效用。针对一类可分离的消费者偏好，我们展示了一个面对同质化消费者的垄断媒体平台提供一个虚假“赋权”叙事，并带有乐观偏见信号。消费者异质性导致了一个由于消费者之间的“数据外部性”而产生的新颖菜单设计问题。最优菜单包含多个叙事并创造了极化的信念。这些效应也在一个竞争的媒体市场模型中出现。",
    "tldr": "通过提供信息和叙事，新闻媒体塑造消费者的信念，最大化消费者的参与度，并在面对消费者异质性时创造极化信念。",
    "en_tdlr": "News media shape consumer beliefs by providing information and narratives, maximizing consumer engagement, and creating polarized beliefs in the face of consumer heterogeneity."
}