{
    "title": "Spatial Clustering Approach for Vessel Path Identification",
    "abstract": "arXiv:2403.05778v1 Announce Type: new  Abstract: This paper addresses the challenge of identifying the paths for vessels with operating routes of repetitive paths, partially repetitive paths, and new paths. We propose a spatial clustering approach for labeling the vessel paths by using only position information. We develop a path clustering framework employing two methods: a distance-based path modeling and a likelihood estimation method. The former enhances the accuracy of path clustering through the integration of unsupervised machine learning techniques, while the latter focuses on likelihood-based path modeling and introduces segmentation for a more detailed analysis. The result findings highlight the superior performance and efficiency of the developed approach, as both methods for clustering vessel paths into five classes achieve a perfect F1-score. The approach aims to offer valuable insights for route planning, ultimately contributing to improving safety and efficiency in marit",
    "link": "https://arxiv.org/abs/2403.05778",
    "context": "Title: Spatial Clustering Approach for Vessel Path Identification\nAbstract: arXiv:2403.05778v1 Announce Type: new  Abstract: This paper addresses the challenge of identifying the paths for vessels with operating routes of repetitive paths, partially repetitive paths, and new paths. We propose a spatial clustering approach for labeling the vessel paths by using only position information. We develop a path clustering framework employing two methods: a distance-based path modeling and a likelihood estimation method. The former enhances the accuracy of path clustering through the integration of unsupervised machine learning techniques, while the latter focuses on likelihood-based path modeling and introduces segmentation for a more detailed analysis. The result findings highlight the superior performance and efficiency of the developed approach, as both methods for clustering vessel paths into five classes achieve a perfect F1-score. The approach aims to offer valuable insights for route planning, ultimately contributing to improving safety and efficiency in marit",
    "path": "papers/24/03/2403.05778.json",
    "total_tokens": 804,
    "translated_title": "船舶航迹识别的空间聚类方法",
    "translated_abstract": "本文针对识别具有重复路径、部分重复路径和新路径的船舶路径的挑战提出解决方案。我们提出了一种仅利用位置信息标记船舶路径的空间聚类方法。我们开发了一种路径聚类框架，采用两种方法：基于距离的路径建模和概似估计方法。前者通过整合无监督机器学习技术提高了路径聚类的准确性，而后者专注于基于概似的路径模型，并引入分割以进行更详细的分析。结果发现突出了所开发方法的卓越性能和效率，因为将船舶路径聚类为五类的两种方法均取得了完美的F1分数。该方法旨在为航线规划提供宝贵见解，最终有助于提高海运安全和效率。",
    "tldr": "该论文提出了一种仅利用位置信息的船舶路径的空间聚类方法，通过两种方法实现路径聚类，达到了完美的F1分数，为改善海运安全和效率提供了宝贵见解。",
    "en_tdlr": "This paper presents a spatial clustering approach for vessel path identification using only position information, achieving perfect F1 scores through two methods and offering valuable insights for improving maritime safety and efficiency."
}