{
    "title": "Modality-Aware and Shift Mixer for Multi-modal Brain Tumor Segmentation",
    "abstract": "arXiv:2403.02074v1 Announce Type: cross  Abstract: Combining images from multi-modalities is beneficial to explore various information in computer vision, especially in the medical domain. As an essential part of clinical diagnosis, multi-modal brain tumor segmentation aims to delineate the malignant entity involving multiple modalities. Although existing methods have shown remarkable performance in the task, the information exchange for cross-scale and high-level representations fusion in spatial and modality are limited in these methods. In this paper, we present a novel Modality Aware and Shift Mixer that integrates intra-modality and inter-modality dependencies of multi-modal images for effective and robust brain tumor segmentation. Specifically, we introduce a Modality-Aware module according to neuroimaging studies for modeling the specific modality pair relationships at low levels, and a Modality-Shift module with specific mosaic patterns is developed to explore the complex relat",
    "link": "https://arxiv.org/abs/2403.02074",
    "context": "Title: Modality-Aware and Shift Mixer for Multi-modal Brain Tumor Segmentation\nAbstract: arXiv:2403.02074v1 Announce Type: cross  Abstract: Combining images from multi-modalities is beneficial to explore various information in computer vision, especially in the medical domain. As an essential part of clinical diagnosis, multi-modal brain tumor segmentation aims to delineate the malignant entity involving multiple modalities. Although existing methods have shown remarkable performance in the task, the information exchange for cross-scale and high-level representations fusion in spatial and modality are limited in these methods. In this paper, we present a novel Modality Aware and Shift Mixer that integrates intra-modality and inter-modality dependencies of multi-modal images for effective and robust brain tumor segmentation. Specifically, we introduce a Modality-Aware module according to neuroimaging studies for modeling the specific modality pair relationships at low levels, and a Modality-Shift module with specific mosaic patterns is developed to explore the complex relat",
    "path": "papers/24/03/2403.02074.json",
    "total_tokens": 760,
    "translated_title": "模态感知和位移混合器用于多模态脑肿瘤分割",
    "translated_abstract": "将来自多种模态的图像进行组合有利于探索计算机视觉领域中的各种信息，尤其在医学领域。本文提出了一种新颖的模态感知和位移混合器，用于有效而稳健的脑肿瘤分割，该混合器整合了多模态图像的内模态和交叉模态依赖关系。具体地，我们引入了一个模态感知模块，根据神经影像研究来建模低层次的特定模态对关系，还开发了一个具有特定马赛克图案的模态位移模块，以探索复杂的关系。",
    "tldr": "本文提出了一种新颖的模态感知和位移混合器，用于融合多模态图像的依赖关系，以实现在脑肿瘤分割任务中的有效和稳健性。"
}