{
    "title": "DeepHeteroIoT: Deep Local and Global Learning over Heterogeneous IoT Sensor Data",
    "abstract": "arXiv:2403.19996v1 Announce Type: new  Abstract: Internet of Things (IoT) sensor data or readings evince variations in timestamp range, sampling frequency, geographical location, unit of measurement, etc. Such presented sequence data heterogeneity makes it difficult for traditional time series classification algorithms to perform well. Therefore, addressing the heterogeneity challenge demands learning not only the sub-patterns (local features) but also the overall pattern (global feature). To address the challenge of classifying heterogeneous IoT sensor data (e.g., categorizing sensor data types like temperature and humidity), we propose a novel deep learning model that incorporates both Convolutional Neural Network and Bi-directional Gated Recurrent Unit to learn local and global features respectively, in an end-to-end manner. Through rigorous experimentation on heterogeneous IoT sensor datasets, we validate the effectiveness of our proposed model, which outperforms recent state-of-th",
    "link": "https://arxiv.org/abs/2403.19996",
    "context": "Title: DeepHeteroIoT: Deep Local and Global Learning over Heterogeneous IoT Sensor Data\nAbstract: arXiv:2403.19996v1 Announce Type: new  Abstract: Internet of Things (IoT) sensor data or readings evince variations in timestamp range, sampling frequency, geographical location, unit of measurement, etc. Such presented sequence data heterogeneity makes it difficult for traditional time series classification algorithms to perform well. Therefore, addressing the heterogeneity challenge demands learning not only the sub-patterns (local features) but also the overall pattern (global feature). To address the challenge of classifying heterogeneous IoT sensor data (e.g., categorizing sensor data types like temperature and humidity), we propose a novel deep learning model that incorporates both Convolutional Neural Network and Bi-directional Gated Recurrent Unit to learn local and global features respectively, in an end-to-end manner. Through rigorous experimentation on heterogeneous IoT sensor datasets, we validate the effectiveness of our proposed model, which outperforms recent state-of-th",
    "path": "papers/24/03/2403.19996.json",
    "total_tokens": 875,
    "translated_title": "DeepHeteroIoT：基于异构IoT传感器数据的深度局部和全局学习",
    "translated_abstract": "互联网物联网（IoT）传感器数据或读数在时间戳范围、采样频率、地理位置、测量单位等方面表现出差异。这种呈现的序列数据异质性使传统时间序列分类算法难以表现良好。因此，解决异质性挑战需要学习不仅子模式（局部特征）而且总体模式（全局特征）。为了解决分类异构IoT传感器数据（例如，将传感器数据类型如温度和湿度进行分类）的挑战，我们提出了一种新颖的深度学习模型，该模型融合了卷积神经网络和双向门控循环单元，分别以端到端的方式学习局部和全局特征。通过对异构IoT传感器数据集的严格实验，我们验证了我们提出的模型的有效性，该模型优于最近的最先进技术。",
    "tldr": "提出了一个新颖的深度学习模型，结合了卷积神经网络和双向门控循环单元，以端到端的方式学习局部和全局特征，有效解决了异构IoT传感器数据分类的挑战。"
}