{
    "title": "Interactive Melody Generation System for Enhancing the Creativity of Musicians",
    "abstract": "arXiv:2403.03395v1 Announce Type: cross  Abstract: This study proposes a system designed to enumerate the process of collaborative composition among humans, using automatic music composition technology. By integrating multiple Recurrent Neural Network (RNN) models, the system provides an experience akin to collaborating with several composers, thereby fostering diverse creativity. Through dynamic adaptation to the user's creative intentions, based on feedback, the system enhances its capability to generate melodies that align with user preferences and creative needs. The system's effectiveness was evaluated through experiments with composers of varying backgrounds, revealing its potential to facilitate musical creativity and suggesting avenues for further refinement. The study underscores the importance of interaction between the composer and AI, aiming to make music composition more accessible and personalized. This system represents a step towards integrating AI into the creative pro",
    "link": "https://arxiv.org/abs/2403.03395",
    "context": "Title: Interactive Melody Generation System for Enhancing the Creativity of Musicians\nAbstract: arXiv:2403.03395v1 Announce Type: cross  Abstract: This study proposes a system designed to enumerate the process of collaborative composition among humans, using automatic music composition technology. By integrating multiple Recurrent Neural Network (RNN) models, the system provides an experience akin to collaborating with several composers, thereby fostering diverse creativity. Through dynamic adaptation to the user's creative intentions, based on feedback, the system enhances its capability to generate melodies that align with user preferences and creative needs. The system's effectiveness was evaluated through experiments with composers of varying backgrounds, revealing its potential to facilitate musical creativity and suggesting avenues for further refinement. The study underscores the importance of interaction between the composer and AI, aiming to make music composition more accessible and personalized. This system represents a step towards integrating AI into the creative pro",
    "path": "papers/24/03/2403.03395.json",
    "total_tokens": 840,
    "translated_title": "用于增强音乐家创造力的交互式旋律生成系统",
    "translated_abstract": "本研究提出了一个系统，旨在通过使用自动音乐作曲技术，列举人类协作创作的过程。通过整合多个循环神经网络（RNN）模型，该系统提供了一种类似与多位作曲家合作的体验，从而促进多样化的创造力。通过根据反馈动态适应用户的创意意图，系统增强了生成与用户喜好和创造需求一致的旋律的能力。通过对具有不同背景的作曲家进行实验评估了系统的有效性，揭示了该系统促进音乐创造力的潜力，并提出了进一步改进的途径。该研究强调了作曲家与人工智能之间的互动的重要性，旨在使音乐创作更具可访问性和个性化。这个系统代表了将人工智能整合到创造性过程的一步。",
    "tldr": "该系统通过整合多个循环神经网络模型，提供了一种类似与多位作曲家合作的体验，从而促进多样化的创造力，并通过动态适应用户创意意图来增强生成旋律的能力。",
    "en_tdlr": "The system integrates multiple Recurrent Neural Network models to provide an experience akin to collaborating with several composers, fostering diverse creativity and enhancing melody generation capability by dynamically adapting to user creative intentions."
}