{
    "title": "Reinforcement Learning for Online Testing of Autonomous Driving Systems: a Replication and Extension Study",
    "abstract": "arXiv:2403.13729v1 Announce Type: cross  Abstract: In a recent study, Reinforcement Learning (RL) used in combination with many-objective search, has been shown to outperform alternative techniques (random search and many-objective search) for online testing of Deep Neural Network-enabled systems. The empirical evaluation of these techniques was conducted on a state-of-the-art Autonomous Driving System (ADS). This work is a replication and extension of that empirical study. Our replication shows that RL does not outperform pure random test generation in a comparison conducted under the same settings of the original study, but with no confounding factor coming from the way collisions are measured. Our extension aims at eliminating some of the possible reasons for the poor performance of RL observed in our replication: (1) the presence of reward components providing contrasting or useless feedback to the RL agent; (2) the usage of an RL algorithm (Q-learning) which requires discretizatio",
    "link": "https://arxiv.org/abs/2403.13729",
    "context": "Title: Reinforcement Learning for Online Testing of Autonomous Driving Systems: a Replication and Extension Study\nAbstract: arXiv:2403.13729v1 Announce Type: cross  Abstract: In a recent study, Reinforcement Learning (RL) used in combination with many-objective search, has been shown to outperform alternative techniques (random search and many-objective search) for online testing of Deep Neural Network-enabled systems. The empirical evaluation of these techniques was conducted on a state-of-the-art Autonomous Driving System (ADS). This work is a replication and extension of that empirical study. Our replication shows that RL does not outperform pure random test generation in a comparison conducted under the same settings of the original study, but with no confounding factor coming from the way collisions are measured. Our extension aims at eliminating some of the possible reasons for the poor performance of RL observed in our replication: (1) the presence of reward components providing contrasting or useless feedback to the RL agent; (2) the usage of an RL algorithm (Q-learning) which requires discretizatio",
    "path": "papers/24/03/2403.13729.json",
    "total_tokens": 830,
    "translated_title": "强化学习用于自动驾驶系统在线测试：一项复制和拓展研究",
    "translated_abstract": "最近一项研究表明，结合多目标搜索的强化学习（RL）在Deep Neural Network-enabled系统的在线测试中优于随机搜索和多目标搜索等替代技术。这些技术的经验评估是在最先进的自动驾驶系统（ADS）上进行的。该工作是对该经验研究的复制和拓展。我们的复制表明，在与原研究相同设置下进行的对比中，RL并不比纯随机测试生成优秀，但没有碰撞测量方式带来的混杂因素。我们的拓展旨在消除造成RL性能不佳的一些可能原因：（1）奖励组件提供了与RL代理相矛盾或无用的反馈；（2）使用了需要离散化的RL算法（Q-learning）。",
    "tldr": "该研究复制和拓展了最近一项研究，发现强化学习在在线测试中并不比纯随机测试生成优秀，拓展工作旨在消除造成性能不佳的可能原因。",
    "en_tdlr": "This study replicated and extended a recent research, finding that reinforcement learning does not outperform pure random test generation in online testing, with the extension aiming to eliminate possible reasons for the poor performance."
}