{
    "title": "Cognition is All You Need - The Next Layer of AI Above Large Language Models",
    "abstract": "arXiv:2403.02164v1 Announce Type: new  Abstract: Recent studies of the applications of conversational AI tools, such as chatbots powered by large language models, to complex real-world knowledge work have shown limitations related to reasoning and multi-step problem solving. Specifically, while existing chatbots simulate shallow reasoning and understanding they are prone to errors as problem complexity increases. The failure of these systems to address complex knowledge work is due to the fact that they do not perform any actual cognition. In this position paper, we present Cognitive AI, a higher-level framework for implementing programmatically defined neuro-symbolic cognition above and outside of large language models. Specifically, we propose a dual-layer functional architecture for Cognitive AI that serves as a roadmap for AI systems that can perform complex multi-step knowledge work. We propose that Cognitive AI is a necessary precursor for the evolution of higher forms of AI, suc",
    "link": "https://arxiv.org/abs/2403.02164",
    "context": "Title: Cognition is All You Need - The Next Layer of AI Above Large Language Models\nAbstract: arXiv:2403.02164v1 Announce Type: new  Abstract: Recent studies of the applications of conversational AI tools, such as chatbots powered by large language models, to complex real-world knowledge work have shown limitations related to reasoning and multi-step problem solving. Specifically, while existing chatbots simulate shallow reasoning and understanding they are prone to errors as problem complexity increases. The failure of these systems to address complex knowledge work is due to the fact that they do not perform any actual cognition. In this position paper, we present Cognitive AI, a higher-level framework for implementing programmatically defined neuro-symbolic cognition above and outside of large language models. Specifically, we propose a dual-layer functional architecture for Cognitive AI that serves as a roadmap for AI systems that can perform complex multi-step knowledge work. We propose that Cognitive AI is a necessary precursor for the evolution of higher forms of AI, suc",
    "path": "papers/24/03/2403.02164.json",
    "total_tokens": 748,
    "translated_title": "认知就是你需要的一切 - 大语言模型之上的人工智能下一层",
    "translated_abstract": "最近对话式人工智能工具的研究，比如由大型语言模型驱动的聊天机器人在复杂的实际知识工作中的应用已经显示出了与推理和多步问题解决相关的局限性。我们提出认知人工智能，这是一个用于在大型语言模型之上和之外实现以程序定义的神经符号认知的高级框架。具体而言，我们提出了认知人工智能的双层功能架构，作为能够执行复杂多步知识工作的人工智能系统的路线图。",
    "tldr": "提出了认知人工智能，一个用于在大型语言模型之上实现以程序定义的神经符号认知的高级框架，为能够执行复杂多步知识工作的人工智能系统提供了路径。",
    "en_tdlr": "Introduced Cognitive AI, a high-level framework for programmatically defined neuro-symbolic cognition above large language models, serving as a roadmap for AI systems capable of performing complex multi-step knowledge work."
}