{
    "title": "Multiple Population Alternate Evolution Neural Architecture Search",
    "abstract": "arXiv:2403.07035v1 Announce Type: cross  Abstract: The effectiveness of Evolutionary Neural Architecture Search (ENAS) is influenced by the design of the search space. Nevertheless, common methods including the global search space, scalable search space and hierarchical search space have certain limitations. Specifically, the global search space requires a significant amount of computational resources and time, the scalable search space sacrifices the diversity of network structures and the hierarchical search space increases the search cost in exchange for network diversity. To address above limitation, we propose a novel paradigm of searching neural network architectures and design the Multiple Population Alternate Evolution Neural Architecture Search (MPAE), which can achieve module diversity with a smaller search cost. MPAE converts the search space into L interconnected units and sequentially searches the units, then the above search of the entire network be cycled several times t",
    "link": "https://arxiv.org/abs/2403.07035",
    "context": "Title: Multiple Population Alternate Evolution Neural Architecture Search\nAbstract: arXiv:2403.07035v1 Announce Type: cross  Abstract: The effectiveness of Evolutionary Neural Architecture Search (ENAS) is influenced by the design of the search space. Nevertheless, common methods including the global search space, scalable search space and hierarchical search space have certain limitations. Specifically, the global search space requires a significant amount of computational resources and time, the scalable search space sacrifices the diversity of network structures and the hierarchical search space increases the search cost in exchange for network diversity. To address above limitation, we propose a novel paradigm of searching neural network architectures and design the Multiple Population Alternate Evolution Neural Architecture Search (MPAE), which can achieve module diversity with a smaller search cost. MPAE converts the search space into L interconnected units and sequentially searches the units, then the above search of the entire network be cycled several times t",
    "path": "papers/24/03/2403.07035.json",
    "total_tokens": 777,
    "translated_title": "多种群交替进化神经架构搜索",
    "translated_abstract": "arXiv:2403.07035v1 公告类型: 跨领域 摘要: 进化神经架构搜索(ENAS)的有效性受到搜索空间设计的影响。然而，包括全局搜索空间、可扩展搜索空间和分层搜索空间在内的常见方法都存在一定局限性。特别是，全局搜索空间需要大量计算资源和时间，可扩展搜索空间牺牲了网络结构的多样性，而分层搜索空间则增加了搜索成本以换取网络多样性。为解决上述限制，我们提出了一种新颖的神经网络架构搜索范式，设计了多种群交替进化神经架构搜索（MPAE），可以在更小的搜索成本下实现模块多样性。MPAE将搜索空间转换为L个互连单元，并依次搜索这些单元，然后重复几次搜索整个网络。",
    "tldr": "提出了多种群交替进化神经架构搜索（MPAE）范式，能够在更小的搜索成本下实现神经网络结构的模块多样性。",
    "en_tdlr": "Proposed a novel paradigm of Multiple Population Alternate Evolution Neural Architecture Search (MPAE), which can achieve module diversity with a smaller search cost."
}