{
    "title": "Estimating Causal Effects of Discrete and Continuous Treatments with Binary Instruments",
    "abstract": "arXiv:2403.05850v1 Announce Type: new  Abstract: We propose an instrumental variable framework for identifying and estimating average and quantile effects of discrete and continuous treatments with binary instruments. The basis of our approach is a local copula representation of the joint distribution of the potential outcomes and unobservables determining treatment assignment. This representation allows us to introduce an identifying assumption, so-called copula invariance, that restricts the local dependence of the copula with respect to the treatment propensity. We show that copula invariance identifies treatment effects for the entire population and other subpopulations such as the treated. The identification results are constructive and lead to straightforward semiparametric estimation procedures based on distribution regression. An application to the effect of sleep on well-being uncovers interesting patterns of heterogeneity.",
    "link": "https://arxiv.org/abs/2403.05850",
    "context": "Title: Estimating Causal Effects of Discrete and Continuous Treatments with Binary Instruments\nAbstract: arXiv:2403.05850v1 Announce Type: new  Abstract: We propose an instrumental variable framework for identifying and estimating average and quantile effects of discrete and continuous treatments with binary instruments. The basis of our approach is a local copula representation of the joint distribution of the potential outcomes and unobservables determining treatment assignment. This representation allows us to introduce an identifying assumption, so-called copula invariance, that restricts the local dependence of the copula with respect to the treatment propensity. We show that copula invariance identifies treatment effects for the entire population and other subpopulations such as the treated. The identification results are constructive and lead to straightforward semiparametric estimation procedures based on distribution regression. An application to the effect of sleep on well-being uncovers interesting patterns of heterogeneity.",
    "path": "papers/24/03/2403.05850.json",
    "total_tokens": 861,
    "translated_title": "用二元工具估计离散和连续处理的因果效应",
    "translated_abstract": "我们提出了一个利用二元工具的工具变量框架，用于识别和估计离散和连续处理的平均效应和分位数效应。我们方法的基础是潜在结果和决定处理分配的不可观测变量的联合分布的局部Copula表示。这种表示使我们能够引入一个所谓的Copula不变性的识别假设，该假设限制了Copula关于处理倾向的局部依赖。我们展示Copula不变性识别了整个人群以及其他亚人群（如接受处理者）的处理效应。识别结果是构造性的，并导致基于分布回归的直接半参数估计过程。对睡眠对幸福感的影响的应用揭示了有趣的异质性模式。",
    "tldr": "提出了一个利用二元工具的工具变量框架，用于识别和估计离散和连续处理的平均效应和分位数效应，基于Copula不变性的识别假设，构造性识别了整个人群及其他子人群的处理效应，并提出了基于分布回归的直接半参数估计过程。",
    "en_tdlr": "A framework using binary instruments is proposed to identify and estimate average and quantile effects of discrete and continuous treatments, with identification based on copula invariance for the entire population and other subpopulations such as the treated, leading to constructive identification results and straightforward semiparametric estimation procedures based on distribution regression."
}