{
    "title": "AraPoemBERT: A Pretrained Language Model for Arabic Poetry Analysis",
    "abstract": "arXiv:2403.12392v1 Announce Type: cross  Abstract: Arabic poetry, with its rich linguistic features and profound cultural significance, presents a unique challenge to the Natural Language Processing (NLP) field. The complexity of its structure and context necessitates advanced computational models for accurate analysis. In this paper, we introduce AraPoemBERT, an Arabic language model pretrained exclusively on Arabic poetry text. To demonstrate the effectiveness of the proposed model, we compared AraPoemBERT with 5 different Arabic language models on various NLP tasks related to Arabic poetry. The new model outperformed all other models and achieved state-of-the-art results in most of the downstream tasks. AraPoemBERT achieved unprecedented accuracy in two out of three novel tasks: poet's gender classification (99.34\\% accuracy), and poetry sub-meter classification (97.79\\% accuracy). In addition, the model achieved an accuracy score in poems' rhyme classification (97.73\\% accuracy) wh",
    "link": "https://arxiv.org/abs/2403.12392",
    "context": "Title: AraPoemBERT: A Pretrained Language Model for Arabic Poetry Analysis\nAbstract: arXiv:2403.12392v1 Announce Type: cross  Abstract: Arabic poetry, with its rich linguistic features and profound cultural significance, presents a unique challenge to the Natural Language Processing (NLP) field. The complexity of its structure and context necessitates advanced computational models for accurate analysis. In this paper, we introduce AraPoemBERT, an Arabic language model pretrained exclusively on Arabic poetry text. To demonstrate the effectiveness of the proposed model, we compared AraPoemBERT with 5 different Arabic language models on various NLP tasks related to Arabic poetry. The new model outperformed all other models and achieved state-of-the-art results in most of the downstream tasks. AraPoemBERT achieved unprecedented accuracy in two out of three novel tasks: poet's gender classification (99.34\\% accuracy), and poetry sub-meter classification (97.79\\% accuracy). In addition, the model achieved an accuracy score in poems' rhyme classification (97.73\\% accuracy) wh",
    "path": "papers/24/03/2403.12392.json",
    "total_tokens": 930,
    "translated_title": "AraPoemBERT：一种用于阿拉伯诗歌分析的预训练语言模型",
    "translated_abstract": "阿拉伯诗歌以其丰富的语言特征和深刻的文化意义，为自然语言处理（NLP）领域提出了独特挑战。其结构和背景的复杂性需要先进的计算模型进行准确分析。本文介绍了AraPoemBERT，这是一种专门在阿拉伯诗歌文本上预训练的阿拉伯语言模型。为了展示所提出模型的有效性，我们将AraPoemBERT与5种不同的阿拉伯语言模型在与阿拉伯诗歌相关的各种NLP任务上进行了比较。这个新模型在绝大多数下游任务中表现优异，并取得了最新的技术成果。AraPoemBERT在三项新颖任务中的两项中取得了前所未有的准确率：诗人性别分类（99.34\\%的准确率）和诗歌节律分类（97.79\\%的准确率）。此外，模型在诗歌押韵分类（97.73\\%的准确率）中也取得了准确得分。",
    "tldr": "AraPoemBERT 是一种专门针对阿拉伯诗歌文本进行预训练的语言模型，在阿拉伯诗歌相关的NLP任务中表现出色，取得了两项新颖任务中的前所未有的高准确率。",
    "en_tdlr": "AraPoemBERT is a language model pretrained exclusively on Arabic poetry text, outperforming other Arabic language models in tasks related to Arabic poetry and achieving unprecedented high accuracy in two novel tasks."
}