{
    "title": "Empowering Sequential Recommendation from Collaborative Signals and Semantic Relatedness",
    "abstract": "arXiv:2403.07623v1 Announce Type: new  Abstract: Sequential recommender systems (SRS) could capture dynamic user preferences by modeling historical behaviors ordered in time. Despite effectiveness, focusing only on the \\textit{collaborative signals} from behaviors does not fully grasp user interests. It is also significant to model the \\textit{semantic relatedness} reflected in content features, e.g., images and text. Towards that end, in this paper, we aim to enhance the SRS tasks by effectively unifying collaborative signals and semantic relatedness together. Notably, we empirically point out that it is nontrivial to achieve such a goal due to semantic gap issues. Thus, we propose an end-to-end two-stream architecture for sequential recommendation, named TSSR, to learn user preferences from ID-based and content-based sequence. Specifically, we first present novel hierarchical contrasting module, including coarse user-grained and fine item-grained terms, to align the representations o",
    "link": "https://arxiv.org/abs/2403.07623",
    "context": "Title: Empowering Sequential Recommendation from Collaborative Signals and Semantic Relatedness\nAbstract: arXiv:2403.07623v1 Announce Type: new  Abstract: Sequential recommender systems (SRS) could capture dynamic user preferences by modeling historical behaviors ordered in time. Despite effectiveness, focusing only on the \\textit{collaborative signals} from behaviors does not fully grasp user interests. It is also significant to model the \\textit{semantic relatedness} reflected in content features, e.g., images and text. Towards that end, in this paper, we aim to enhance the SRS tasks by effectively unifying collaborative signals and semantic relatedness together. Notably, we empirically point out that it is nontrivial to achieve such a goal due to semantic gap issues. Thus, we propose an end-to-end two-stream architecture for sequential recommendation, named TSSR, to learn user preferences from ID-based and content-based sequence. Specifically, we first present novel hierarchical contrasting module, including coarse user-grained and fine item-grained terms, to align the representations o",
    "path": "papers/24/03/2403.07623.json",
    "total_tokens": 846,
    "translated_title": "从协作信号和语义相关性中增强顺序推荐",
    "translated_abstract": "顺序推荐系统(SRS)通过对按时间顺序排列的历史行为进行建模，能够捕捉到动态用户偏好。尽管有效，仅关注行为中的\\textit{协作信号}并不能充分把握用户兴趣。在内容特征中反映的\\textit{语义相关性}建模也是重要的，例如图片和文本。因此，本文旨在通过有效地将协作信号和语义相关性结合起来，增强SRS任务。值得注意的是，我们实证指出由于语义鸿沟问题，实现这一目标并不容易。因此，我们提出了一种用于顺序推荐的端到端两流架构，命名为TSSR，从基于ID和基于内容的序列中学习用户偏好。具体来说，我们首先提出了新颖的层次对比模块，包括粗用户粒度和细项粒度术语，以对齐表征。",
    "tldr": "该论文提出了一种端到端两流架构TSSR，旨在通过有效地将协作信号和语义相关性结合起来，增强顺序推荐任务。",
    "en_tdlr": "This paper introduces an end-to-end two-stream architecture, TSSR, aiming to enhance sequential recommendation tasks by effectively combining collaborative signals and semantic relatedness."
}