{
    "title": "FastPerson: Enhancing Video Learning through Effective Video Summarization that Preserves Linguistic and Visual Contexts",
    "abstract": "arXiv:2403.17727v1 Announce Type: cross  Abstract: Quickly understanding lengthy lecture videos is essential for learners with limited time and interest in various topics to improve their learning efficiency. To this end, video summarization has been actively researched to enable users to view only important scenes from a video. However, these studies focus on either the visual or audio information of a video and extract important segments in the video. Therefore, there is a risk of missing important information when both the teacher's speech and visual information on the blackboard or slides are important, such as in a lecture video. To tackle this issue, we propose FastPerson, a video summarization approach that considers both the visual and auditory information in lecture videos. FastPerson creates summary videos by utilizing audio transcriptions along with on-screen images and text, minimizing the risk of overlooking crucial information for learners. Further, it provides a feature ",
    "link": "https://arxiv.org/abs/2403.17727",
    "context": "Title: FastPerson: Enhancing Video Learning through Effective Video Summarization that Preserves Linguistic and Visual Contexts\nAbstract: arXiv:2403.17727v1 Announce Type: cross  Abstract: Quickly understanding lengthy lecture videos is essential for learners with limited time and interest in various topics to improve their learning efficiency. To this end, video summarization has been actively researched to enable users to view only important scenes from a video. However, these studies focus on either the visual or audio information of a video and extract important segments in the video. Therefore, there is a risk of missing important information when both the teacher's speech and visual information on the blackboard or slides are important, such as in a lecture video. To tackle this issue, we propose FastPerson, a video summarization approach that considers both the visual and auditory information in lecture videos. FastPerson creates summary videos by utilizing audio transcriptions along with on-screen images and text, minimizing the risk of overlooking crucial information for learners. Further, it provides a feature ",
    "path": "papers/24/03/2403.17727.json",
    "total_tokens": 889,
    "translated_title": "FastPerson: 通过保留语言和视觉内容增强视频学习的高效视频摘要化",
    "translated_abstract": "理解漫长的讲座视频对于时间有限并且对各种主题都感兴趣的学习者来说至关重要，以提高他们的学习效率。为此，视频摘要化一直受到积极研究，使用户只能查看视频中的重要场景。然而，这些研究集中在视频的视觉或音频信息，并提取视频中的重要片段。因此，在讲座视频中像老师的讲话和黑板或幻灯片上的视觉信息一样重要时，存在错过重要信息的风险。为解决这一问题，我们提出了FastPerson，一种考虑讲座视频中视觉和听觉信息的视频摘要化方法。FastPerson通过利用音频转录以及屏幕上的图片和文字创建摘要视频，最大程度地减少了对学习者来说遗漏重要信息的风险。此外，它提供了一个特征",
    "tldr": "FastPerson提出了一种视频摘要化方法，考虑了讲座视频中的视觉和听觉信息，通过利用音频转录和屏幕上的图片和文字创建摘要视频，从而最大程度地减少了对学习者来说遗漏重要信息的风险。",
    "en_tdlr": "FastPerson proposes a video summarization approach that considers both visual and auditory information in lecture videos, creating summary videos by utilizing audio transcriptions and on-screen images and text to minimize the risk of overlooking crucial information for learners."
}