{
    "title": "Scope of Large Language Models for Mining Emerging Opinions in Online Health Discourse",
    "abstract": "arXiv:2403.03336v1 Announce Type: new  Abstract: In this paper, we develop an LLM-powered framework for the curation and evaluation of emerging opinion mining in online health communities. We formulate emerging opinion mining as a pairwise stance detection problem between (title, comment) pairs sourced from Reddit, where post titles contain emerging health-related claims on a topic that is not predefined. The claims are either explicitly or implicitly expressed by the user. We detail (i) a method of claim identification -- the task of identifying if a post title contains a claim and (ii) an opinion mining-driven evaluation framework for stance detection using LLMs.   We facilitate our exploration by releasing a novel test dataset, Long COVID-Stance, or LC-stance, which can be used to evaluate LLMs on the tasks of claim identification and stance detection in online health communities. Long Covid is an emerging post-COVID disorder with uncertain and complex treatment guidelines, thus mak",
    "link": "https://arxiv.org/abs/2403.03336",
    "context": "Title: Scope of Large Language Models for Mining Emerging Opinions in Online Health Discourse\nAbstract: arXiv:2403.03336v1 Announce Type: new  Abstract: In this paper, we develop an LLM-powered framework for the curation and evaluation of emerging opinion mining in online health communities. We formulate emerging opinion mining as a pairwise stance detection problem between (title, comment) pairs sourced from Reddit, where post titles contain emerging health-related claims on a topic that is not predefined. The claims are either explicitly or implicitly expressed by the user. We detail (i) a method of claim identification -- the task of identifying if a post title contains a claim and (ii) an opinion mining-driven evaluation framework for stance detection using LLMs.   We facilitate our exploration by releasing a novel test dataset, Long COVID-Stance, or LC-stance, which can be used to evaluate LLMs on the tasks of claim identification and stance detection in online health communities. Long Covid is an emerging post-COVID disorder with uncertain and complex treatment guidelines, thus mak",
    "path": "papers/24/03/2403.03336.json",
    "total_tokens": 961,
    "translated_title": "大型语言模型在在线健康话语中挖掘新兴观点的范围",
    "translated_abstract": "在这篇论文中，我们开发了一个由LLM驱动的框架，用于在在线健康社区中策划和评估新兴观点的挖掘。我们将新兴观点挖掘定义为来自Reddit的（标题，评论）配对间的两两立场检测问题，其中帖子标题包含未预定义话题的新兴健康相关声明。宣称可以由用户明确或隐含地表达。我们详细介绍了（i）宣称识别的方法--识别帖子标题是否包含宣称的任务；以及（ii）使用LLMs进行立场检测的观点挖掘驱动的评估框架。我们通过发布一个新颖的测试数据集Long COVID-Stance，或LC-stance，来促进我们的探索，该数据集可用于评估LLMs在在线健康社区中宣称识别和立场检测任务上的表现。长期COVID是一种新兴的COVID后疾病，治疗指南不确定且复杂，因此构成了一个复杂的问题。",
    "tldr": "本论文开发了一个由LLM驱动的框架，用于在在线健康社区中进行新兴观点挖掘，提出了一种新颖的Claim识别方法和观点挖掘驱动的评估框架，并发布了用于评估LLMs在在线健康社区中宣称识别和立场检测任务的新测试数据集。"
}