{
    "title": "RADIA -- Radio Advertisement Detection with Intelligent Analytics",
    "abstract": "arXiv:2403.03538v1 Announce Type: cross  Abstract: Radio advertising remains an integral part of modern marketing strategies, with its appeal and potential for targeted reach undeniably effective. However, the dynamic nature of radio airtime and the rising trend of multiple radio spots necessitates an efficient system for monitoring advertisement broadcasts. This study investigates a novel automated radio advertisement detection technique incorporating advanced speech recognition and text classification algorithms. RadIA's approach surpasses traditional methods by eliminating the need for prior knowledge of the broadcast content. This contribution allows for detecting impromptu and newly introduced advertisements, providing a comprehensive solution for advertisement detection in radio broadcasting. Experimental results show that the resulting model, trained on carefully segmented and tagged text data, achieves an F1-macro score of 87.76 against a theoretical maximum of 89.33. This pape",
    "link": "https://arxiv.org/abs/2403.03538",
    "context": "Title: RADIA -- Radio Advertisement Detection with Intelligent Analytics\nAbstract: arXiv:2403.03538v1 Announce Type: cross  Abstract: Radio advertising remains an integral part of modern marketing strategies, with its appeal and potential for targeted reach undeniably effective. However, the dynamic nature of radio airtime and the rising trend of multiple radio spots necessitates an efficient system for monitoring advertisement broadcasts. This study investigates a novel automated radio advertisement detection technique incorporating advanced speech recognition and text classification algorithms. RadIA's approach surpasses traditional methods by eliminating the need for prior knowledge of the broadcast content. This contribution allows for detecting impromptu and newly introduced advertisements, providing a comprehensive solution for advertisement detection in radio broadcasting. Experimental results show that the resulting model, trained on carefully segmented and tagged text data, achieves an F1-macro score of 87.76 against a theoretical maximum of 89.33. This pape",
    "path": "papers/24/03/2403.03538.json",
    "total_tokens": 870,
    "translated_title": "RADIA -- 具有智能分析的广播广告检测",
    "translated_abstract": "广播广告仍然是现代营销策略中不可或缺的一部分，其吸引力和针对性传播的潜力不可否认。然而，广播播出时间的动态性和多个广播广告的日益增长趋势为监测广告播出的有效性提出了要求。本研究调查了一种结合先进语音识别和文本分类算法的新型自动广播广告检测技术。RADIA的方法通过消除对广播内容的先验知识的需求，超越了传统方法。这一贡献允许检测即兴和新引入的广告，为广播广告检测提供了全面的解决方案。实验结果表明，该模型在精心分割和标记的文本数据上训练，达到了F1-macro得分87.76，理论最大值为89.33。",
    "tldr": "本研究提出了一种新型自动广播广告检测技术RADIA，利用先进的语音识别和文本分类算法，能够在不需要先验知识的情况下检测广播中的即兴和新广告，为广播广告检测提供了全面的解决方案，并取得了较高的F1-macro得分。",
    "en_tdlr": "This study introduces a novel automated radio advertisement detection technique RADIA, which utilizes advanced speech recognition and text classification algorithms to detect impromptu and newly introduced advertisements in radio broadcasts without the need for prior knowledge, providing a comprehensive solution for advertisement detection and achieving a high F1-macro score."
}