{
    "title": "MESIA: Understanding and Leveraging Supplementary Nature of Method-level Comments for Automatic Comment Generation",
    "abstract": "arXiv:2403.17357v1 Announce Type: cross  Abstract: Code comments are important for developers in program comprehension. In scenarios of comprehending and reusing a method, developers expect code comments to provide supplementary information beyond the method signature. However, the extent of such supplementary information varies a lot in different code comments. In this paper, we raise the awareness of the supplementary nature of method-level comments and propose a new metric named MESIA (Mean Supplementary Information Amount) to assess the extent of supplementary information that a code comment can provide. With the MESIA metric, we conduct experiments on a popular code-comment dataset and three common types of neural approaches to generate method-level comments. Our experimental results demonstrate the value of our proposed work with a number of findings. (1) Small-MESIA comments occupy around 20% of the dataset and mostly fall into only the WHAT comment category. (2) Being able to p",
    "link": "https://arxiv.org/abs/2403.17357",
    "context": "Title: MESIA: Understanding and Leveraging Supplementary Nature of Method-level Comments for Automatic Comment Generation\nAbstract: arXiv:2403.17357v1 Announce Type: cross  Abstract: Code comments are important for developers in program comprehension. In scenarios of comprehending and reusing a method, developers expect code comments to provide supplementary information beyond the method signature. However, the extent of such supplementary information varies a lot in different code comments. In this paper, we raise the awareness of the supplementary nature of method-level comments and propose a new metric named MESIA (Mean Supplementary Information Amount) to assess the extent of supplementary information that a code comment can provide. With the MESIA metric, we conduct experiments on a popular code-comment dataset and three common types of neural approaches to generate method-level comments. Our experimental results demonstrate the value of our proposed work with a number of findings. (1) Small-MESIA comments occupy around 20% of the dataset and mostly fall into only the WHAT comment category. (2) Being able to p",
    "path": "papers/24/03/2403.17357.json",
    "total_tokens": 774,
    "translated_title": "MESIA: 理解和利用方法级注释的补充性质用于生成自动注释",
    "translated_abstract": "代码注释对于开发人员在程序理解中至关重要。在理解和重用方法的场景中，开发人员期望代码注释提供超出方法签名的补充信息。然而，不同代码注释中这种补充信息的程度差异很大。本文提出了方法级注释的补充性质的认识，并提出了一种名为MESIA（平均补充信息量）的新度量标准，用于评估代码注释提供的补充信息的程度。借助MESIA度量标准，我们在一个流行的代码注释数据集上进行了实验，并使用三种常见类型的神经方法生成方法级注释。我们的实验结果证明了我们提出的工作的价值，并得出了一些发现。",
    "tldr": "提出了一种新的度量标准MESIA，用于评估代码注释提供的补充信息的程度，实验证明了其在生成方法级注释时的价值。",
    "en_tdlr": "Introduced a new metric MESIA to assess the extent of supplementary information provided by code comments, with experimental results demonstrating its value in generating method-level comments."
}