{
    "title": "A Sophisticated Framework for the Accurate Detection of Phishing Websites",
    "abstract": "arXiv:2403.09735v1 Announce Type: cross  Abstract: Phishing is an increasingly sophisticated form of cyberattack that is inflicting huge financial damage to corporations throughout the globe while also jeopardizing individuals' privacy. Attackers are constantly devising new methods of launching such assaults and detecting them has become a daunting task. Many different techniques have been suggested, each with its own pros and cons. While machine learning-based techniques have been most successful in identifying such attacks, they continue to fall short in terms of performance and generalizability. This paper proposes a comprehensive methodology for detecting phishing websites. The goal is to design a system that is capable of accurately distinguishing phishing websites from legitimate ones and provides generalized performance over a broad variety of datasets. A combination of feature selection, greedy algorithm, cross-validation, and deep learning methods have been utilized to constru",
    "link": "https://arxiv.org/abs/2403.09735",
    "context": "Title: A Sophisticated Framework for the Accurate Detection of Phishing Websites\nAbstract: arXiv:2403.09735v1 Announce Type: cross  Abstract: Phishing is an increasingly sophisticated form of cyberattack that is inflicting huge financial damage to corporations throughout the globe while also jeopardizing individuals' privacy. Attackers are constantly devising new methods of launching such assaults and detecting them has become a daunting task. Many different techniques have been suggested, each with its own pros and cons. While machine learning-based techniques have been most successful in identifying such attacks, they continue to fall short in terms of performance and generalizability. This paper proposes a comprehensive methodology for detecting phishing websites. The goal is to design a system that is capable of accurately distinguishing phishing websites from legitimate ones and provides generalized performance over a broad variety of datasets. A combination of feature selection, greedy algorithm, cross-validation, and deep learning methods have been utilized to constru",
    "path": "papers/24/03/2403.09735.json",
    "total_tokens": 821,
    "translated_title": "一个用于准确检测网络钓鱼网站的复杂框架",
    "translated_abstract": "网络钓鱼是一种日益复杂的网络攻击形式，给全球企业带来巨大财务损失的同时，也危及个人隐私。攻击者不断设计新的发动攻击方法，检测这些攻击变得十分困难。许多不同的技术已被提出，各有利弊。虽然基于机器学习的技术在识别此类攻击方面最为成功，但在性能和泛化能力方面仍有不足。本文提出了一种全面的方法论来检测网络钓鱼网站。目标是设计出一个能够准确区分钓鱼网站和合法网站的系统，并在广泛的数据集上提供泛化性能。采用了特征选择、贪婪算法、交叉验证和深度学习方法的综合组合来构建该系统。",
    "tldr": "提出了一个用于准确检测网络钓鱼网站的综合方法论，旨在设计一个系统，能够准确区分钓鱼网站和合法网站，并在各种数据集上提供泛化性能。"
}