{
    "title": "DP-CRE: Continual Relation Extraction via Decoupled Contrastive Learning and Memory Structure Preservation",
    "abstract": "arXiv:2403.02718v1 Announce Type: new  Abstract: Continuous Relation Extraction (CRE) aims to incrementally learn relation knowledge from a non-stationary stream of data. Since the introduction of new relational tasks can overshadow previously learned information, catastrophic forgetting becomes a significant challenge in this domain. Current replay-based training paradigms prioritize all data uniformly and train memory samples through multiple rounds, which would result in overfitting old tasks and pronounced bias towards new tasks because of the imbalances of the replay set. To handle the problem, we introduce the DecouPled CRE (DP-CRE) framework that decouples the process of prior information preservation and new knowledge acquisition. This framework examines alterations in the embedding space as new relation classes emerge, distinctly managing the preservation and acquisition of knowledge. Extensive experiments show that DP-CRE significantly outperforms other CRE baselines across t",
    "link": "https://arxiv.org/abs/2403.02718",
    "context": "Title: DP-CRE: Continual Relation Extraction via Decoupled Contrastive Learning and Memory Structure Preservation\nAbstract: arXiv:2403.02718v1 Announce Type: new  Abstract: Continuous Relation Extraction (CRE) aims to incrementally learn relation knowledge from a non-stationary stream of data. Since the introduction of new relational tasks can overshadow previously learned information, catastrophic forgetting becomes a significant challenge in this domain. Current replay-based training paradigms prioritize all data uniformly and train memory samples through multiple rounds, which would result in overfitting old tasks and pronounced bias towards new tasks because of the imbalances of the replay set. To handle the problem, we introduce the DecouPled CRE (DP-CRE) framework that decouples the process of prior information preservation and new knowledge acquisition. This framework examines alterations in the embedding space as new relation classes emerge, distinctly managing the preservation and acquisition of knowledge. Extensive experiments show that DP-CRE significantly outperforms other CRE baselines across t",
    "path": "papers/24/03/2403.02718.json",
    "total_tokens": 852,
    "translated_title": "DP-CRE: 通过分离对比学习和记忆结构保留进行持续关系抽取",
    "translated_abstract": "持续关系抽取（CRE）旨在从非静态数据流中逐步学习关系知识。由于引入新的关系任务可能会掩盖先前学到的信息，灾难性遗忘成为该领域的一个重要挑战。当前基于重播的训练范式优先考虑所有数据，并通过多轮训练内存样本，这会导致过拟合老任务和对新任务的显着偏差，因为重播集合的不平衡性。为了解决这个问题，我们引入了DecouPled CRE（DP-CRE）框架，将先前信息保留和新知识获取的过程分离。该框架检查嵌入空间随着新关系类别的出现而发生的变化，明显管理知识的保存和获取。大量实验表明，DP-CRE在跨越t",
    "tldr": "DP-CRE框架通过分离对比学习和记忆结构保留的方式，显著优于其他持续关系抽取基线模型，在处理在持续学习过程中出现的灾难性遗忘挑战时表现出色。",
    "en_tdlr": "The DP-CRE framework performs significantly better than other continual relation extraction baseline models by decoupling contrastive learning and memory structure preservation, demonstrating outstanding performance in addressing catastrophic forgetting challenges in continual learning."
}