{
    "title": "Evaluating the Application of Large Language Models to Generate Feedback in Programming Education",
    "abstract": "arXiv:2403.09744v1 Announce Type: cross  Abstract: This study investigates the application of large language models, specifically GPT-4, to enhance programming education. The research outlines the design of a web application that uses GPT-4 to provide feedback on programming tasks, without giving away the solution. A web application for working on programming tasks was developed for the study and evaluated with 51 students over the course of one semester. The results show that most of the feedback generated by GPT-4 effectively addressed code errors. However, challenges with incorrect suggestions and hallucinated issues indicate the need for further improvements.",
    "link": "https://arxiv.org/abs/2403.09744",
    "context": "Title: Evaluating the Application of Large Language Models to Generate Feedback in Programming Education\nAbstract: arXiv:2403.09744v1 Announce Type: cross  Abstract: This study investigates the application of large language models, specifically GPT-4, to enhance programming education. The research outlines the design of a web application that uses GPT-4 to provide feedback on programming tasks, without giving away the solution. A web application for working on programming tasks was developed for the study and evaluated with 51 students over the course of one semester. The results show that most of the feedback generated by GPT-4 effectively addressed code errors. However, challenges with incorrect suggestions and hallucinated issues indicate the need for further improvements.",
    "path": "papers/24/03/2403.09744.json",
    "total_tokens": 677,
    "translated_title": "评估大型语言模型在编程教育中生成反馈的应用",
    "translated_abstract": "该研究调查了大型语言模型，特别是GPT-4，在提升编程教育中的应用。研究概述了一个利用GPT-4提供编程任务反馈但不提供解决方案的网页应用的设计。研究开发了一个用于进行编程任务的网页应用，并在一个学期内对51名学生进行了评估。结果显示，大多数由GPT-4生成的反馈有效地解决了代码错误。然而，存在不正确建议和虚构问题的挑战表明有进一步改进的必要。",
    "tldr": "评估了大型语言模型在编程教育中生成反馈的应用，结果显示大多数反馈有效地解决了代码错误，但存在不正确建议和虚构问题，需要进一步改进。"
}