{
    "title": "How to Understand Named Entities: Using Common Sense for News Captioning",
    "abstract": "arXiv:2403.06520v1 Announce Type: cross  Abstract: News captioning aims to describe an image with its news article body as input. It greatly relies on a set of detected named entities, including real-world people, organizations, and places. This paper exploits commonsense knowledge to understand named entities for news captioning. By ``understand'', we mean correlating the news content with common sense in the wild, which helps an agent to 1) distinguish semantically similar named entities and 2) describe named entities using words outside of training corpora. Our approach consists of three modules: (a) Filter Module aims to clarify the common sense concerning a named entity from two aspects: what does it mean? and what is it related to?, which divide the common sense into explanatory knowledge and relevant knowledge, respectively. (b) Distinguish Module aggregates explanatory knowledge from node-degree, dependency, and distinguish three aspects to distinguish semantically similar name",
    "link": "https://arxiv.org/abs/2403.06520",
    "context": "Title: How to Understand Named Entities: Using Common Sense for News Captioning\nAbstract: arXiv:2403.06520v1 Announce Type: cross  Abstract: News captioning aims to describe an image with its news article body as input. It greatly relies on a set of detected named entities, including real-world people, organizations, and places. This paper exploits commonsense knowledge to understand named entities for news captioning. By ``understand'', we mean correlating the news content with common sense in the wild, which helps an agent to 1) distinguish semantically similar named entities and 2) describe named entities using words outside of training corpora. Our approach consists of three modules: (a) Filter Module aims to clarify the common sense concerning a named entity from two aspects: what does it mean? and what is it related to?, which divide the common sense into explanatory knowledge and relevant knowledge, respectively. (b) Distinguish Module aggregates explanatory knowledge from node-degree, dependency, and distinguish three aspects to distinguish semantically similar name",
    "path": "papers/24/03/2403.06520.json",
    "total_tokens": 676,
    "translated_title": "如何理解命名实体：在新闻标题生成中使用常识",
    "translated_abstract": "新闻标题生成旨在使用新闻文章主体描述图像。它在很大程度上依赖于一组检测到的命名实体，包括真实世界的人物、组织和地点。本文利用常识知识来理解新闻标题生成中的命名实体。通过“理解”，我们指的是将新闻内容与常识联系起来，帮助代理人区分语义上相似的命名实体，并利用训练语料库之外的词语描述命名实体。",
    "tldr": "该论文利用常识知识来帮助新闻标题生成系统理解命名实体，从而更好地描述图像内容。",
    "en_tdlr": "This paper leverages common sense knowledge to help news captioning systems understand named entities for better image description."
}