{
    "title": "TrustAI at SemEval-2024 Task 8: A Comprehensive Analysis of Multi-domain Machine Generated Text Detection Techniques",
    "abstract": "arXiv:2403.16592v1 Announce Type: new  Abstract: The Large Language Models (LLMs) exhibit remarkable ability to generate fluent content across a wide spectrum of user queries. However, this capability has raised concerns regarding misinformation and personal information leakage. In this paper, we present our methods for the SemEval2024 Task8, aiming to detect machine-generated text across various domains in both mono-lingual and multi-lingual contexts. Our study comprehensively analyzes various methods to detect machine-generated text, including statistical, neural, and pre-trained model approaches. We also detail our experimental setup and perform a in-depth error analysis to evaluate the effectiveness of these methods. Our methods obtain an accuracy of 86.9\\% on the test set of subtask-A mono and 83.7\\% for subtask-B. Furthermore, we also highlight the challenges and essential factors for consideration in future studies.",
    "link": "https://arxiv.org/abs/2403.16592",
    "context": "Title: TrustAI at SemEval-2024 Task 8: A Comprehensive Analysis of Multi-domain Machine Generated Text Detection Techniques\nAbstract: arXiv:2403.16592v1 Announce Type: new  Abstract: The Large Language Models (LLMs) exhibit remarkable ability to generate fluent content across a wide spectrum of user queries. However, this capability has raised concerns regarding misinformation and personal information leakage. In this paper, we present our methods for the SemEval2024 Task8, aiming to detect machine-generated text across various domains in both mono-lingual and multi-lingual contexts. Our study comprehensively analyzes various methods to detect machine-generated text, including statistical, neural, and pre-trained model approaches. We also detail our experimental setup and perform a in-depth error analysis to evaluate the effectiveness of these methods. Our methods obtain an accuracy of 86.9\\% on the test set of subtask-A mono and 83.7\\% for subtask-B. Furthermore, we also highlight the challenges and essential factors for consideration in future studies.",
    "path": "papers/24/03/2403.16592.json",
    "total_tokens": 931,
    "translated_title": "TrustAI在SemEval-2024任务8中的应用：多领域机器生成文本检测技术的综合分析",
    "translated_abstract": "arXiv:2403.16592v1 公告类型: 新 随着大语言模型在各种用户查询中生成流畅内容的显著能力，对于产生的虚假信息和个人信息泄露引起了担忧。本文介绍了我们在SemEval2024 Task8中用于检测各种领域内机器生成文本的方法，旨在在单语和多语境下检测。我们全面分析了各种检测机器生成文本的方法，包括统计、神经和预训练模型方法。我们还详细描述了实验设置，并进行了深入的误差分析以评估这些方法的有效性。我们的方法在子任务-A单语测试集上获得86.9\\%的准确率，子任务-B上为83.7\\%。此外，我们还强调了未来研究中需要考虑的挑战和关键因素。",
    "tldr": "本文提出了针对SemEval2024 Task8的TrustAI方法，旨在在不同领域和语境下检测机器生成文本，研究综合分析了统计、神经和预训练模型等各种方法，并介绍了实验设置和深入的误差分析，取得了相当高的准确率，同时也突出了未来研究中需要考虑的挑战和关键因素。",
    "en_tdlr": "This paper presents TrustAI methods for detecting machine-generated text across different domains and contexts, comprehensively analyzing various detection techniques such as statistical, neural, and pre-trained models, achieving high accuracy rates and highlighting challenges and key factors for future studies."
}