{
    "title": "A Transformer-Based Framework for Payload Malware Detection and Classification",
    "abstract": "arXiv:2403.18223v1 Announce Type: cross  Abstract: As malicious cyber threats become more sophisticated in breaching computer networks, the need for effective intrusion detection systems (IDSs) becomes crucial. Techniques such as Deep Packet Inspection (DPI) have been introduced to allow IDSs analyze the content of network packets, providing more context for identifying potential threats. IDSs traditionally rely on using anomaly-based and signature-based detection techniques to detect unrecognized and suspicious activity. Deep learning techniques have shown great potential in DPI for IDSs due to their efficiency in learning intricate patterns from the packet content being transmitted through the network. In this paper, we propose a revolutionary DPI algorithm based on transformers adapted for the purpose of detecting malicious traffic with a classifier head. Transformers learn the complex content of sequence data and generalize them well to similar scenarios thanks to their self-attent",
    "link": "https://arxiv.org/abs/2403.18223",
    "context": "Title: A Transformer-Based Framework for Payload Malware Detection and Classification\nAbstract: arXiv:2403.18223v1 Announce Type: cross  Abstract: As malicious cyber threats become more sophisticated in breaching computer networks, the need for effective intrusion detection systems (IDSs) becomes crucial. Techniques such as Deep Packet Inspection (DPI) have been introduced to allow IDSs analyze the content of network packets, providing more context for identifying potential threats. IDSs traditionally rely on using anomaly-based and signature-based detection techniques to detect unrecognized and suspicious activity. Deep learning techniques have shown great potential in DPI for IDSs due to their efficiency in learning intricate patterns from the packet content being transmitted through the network. In this paper, we propose a revolutionary DPI algorithm based on transformers adapted for the purpose of detecting malicious traffic with a classifier head. Transformers learn the complex content of sequence data and generalize them well to similar scenarios thanks to their self-attent",
    "path": "papers/24/03/2403.18223.json",
    "total_tokens": 693,
    "translated_title": "基于Transformer的有效载荷恶意软件检测和分类框架",
    "translated_abstract": "随着恶意网络威胁在入侵计算机网络方面变得更加复杂，有效的入侵检测系统（IDSs）的需求变得至关重要。传统上，IDSs依赖于异常检测和基于特征库的检测技术来检测未识别和可疑活动。深度学习技术在DPI方面展现出了巨大潜力，因为它们能够从通过网络传输的数据包内容中学习复杂的模式。在本文中，我们提出了一种革命性的基于Transformer的DPI算法，旨在通过带有分类器头的转变器检测恶意流量。",
    "tldr": "本文提出了一种基于Transformer的DPI算法，旨在检测恶意流量，通过学习复杂的序列数据内容并推广到类似场景中。"
}