{
    "title": "S^2MVTC: a Simple yet Efficient Scalable Multi-View Tensor Clustering",
    "abstract": "arXiv:2403.09107v1 Announce Type: new  Abstract: Anchor-based large-scale multi-view clustering has attracted considerable attention for its effectiveness in handling massive datasets. However, current methods mainly seek the consensus embedding feature for clustering by exploring global correlations between anchor graphs or projection matrices.In this paper, we propose a simple yet efficient scalable multi-view tensor clustering (S^2MVTC) approach, where our focus is on learning correlations of embedding features within and across views. Specifically, we first construct the embedding feature tensor by stacking the embedding features of different views into a tensor and rotating it. Additionally, we build a novel tensor low-frequency approximation (TLFA) operator, which incorporates graph similarity into embedding feature learning, efficiently achieving smooth representation of embedding features within different views. Furthermore, consensus constraints are applied to embedding featur",
    "link": "https://arxiv.org/abs/2403.09107",
    "context": "Title: S^2MVTC: a Simple yet Efficient Scalable Multi-View Tensor Clustering\nAbstract: arXiv:2403.09107v1 Announce Type: new  Abstract: Anchor-based large-scale multi-view clustering has attracted considerable attention for its effectiveness in handling massive datasets. However, current methods mainly seek the consensus embedding feature for clustering by exploring global correlations between anchor graphs or projection matrices.In this paper, we propose a simple yet efficient scalable multi-view tensor clustering (S^2MVTC) approach, where our focus is on learning correlations of embedding features within and across views. Specifically, we first construct the embedding feature tensor by stacking the embedding features of different views into a tensor and rotating it. Additionally, we build a novel tensor low-frequency approximation (TLFA) operator, which incorporates graph similarity into embedding feature learning, efficiently achieving smooth representation of embedding features within different views. Furthermore, consensus constraints are applied to embedding featur",
    "path": "papers/24/03/2403.09107.json",
    "total_tokens": 857,
    "translated_title": "S^2MVTC：简单而高效的可扩展多视图张量聚类",
    "translated_abstract": "arXiv:2403.09107v1 公告类型：新摘要：基于锚点的大规模多视图聚类因其在处理海量数据集时的有效性而受到了广泛关注。然而，当前方法主要通过探索锚图或投影矩阵之间的全局相关性来寻求用于聚类的共识嵌入特征。在本文中，我们提出了一种简单而高效的可扩展多视图张量聚类（S^2MVTC）方法，我们的重点是学习跨视图内部和视图间的嵌入特征之间的相关性。具体来说，我们首先通过将不同视图的嵌入特征叠加成张量并对其进行旋转来构建嵌入特征张量。此外，我们构建了一种新颖的张量低频近似（TLFA）算子，将图相似性融入到嵌入特征学习中，高效地实现了不同视图内部嵌入特征的平滑表示。此外，一致性约束被应用于嵌入特征。",
    "tldr": "S^2MVTC提出了一种简单而高效的可扩展多视图张量聚类方法，重点是学习跨视图内部和视图间的嵌入特征之间的相关性。"
}