{
    "title": "Language and Speech Technology for Central Kurdish Varieties",
    "abstract": "arXiv:2403.01983v1 Announce Type: new  Abstract: Kurdish, an Indo-European language spoken by over 30 million speakers, is considered a dialect continuum and known for its diversity in language varieties. Previous studies addressing language and speech technology for Kurdish handle it in a monolithic way as a macro-language, resulting in disparities for dialects and varieties for which there are few resources and tools available. In this paper, we take a step towards developing resources for language and speech technology for varieties of Central Kurdish, creating a corpus by transcribing movies and TV series as an alternative to fieldwork. Additionally, we report the performance of machine translation, automatic speech recognition, and language identification as downstream tasks evaluated on Central Kurdish varieties. Data and models are publicly available under an open license at https://github.com/sinaahmadi/CORDI.",
    "link": "https://arxiv.org/abs/2403.01983",
    "context": "Title: Language and Speech Technology for Central Kurdish Varieties\nAbstract: arXiv:2403.01983v1 Announce Type: new  Abstract: Kurdish, an Indo-European language spoken by over 30 million speakers, is considered a dialect continuum and known for its diversity in language varieties. Previous studies addressing language and speech technology for Kurdish handle it in a monolithic way as a macro-language, resulting in disparities for dialects and varieties for which there are few resources and tools available. In this paper, we take a step towards developing resources for language and speech technology for varieties of Central Kurdish, creating a corpus by transcribing movies and TV series as an alternative to fieldwork. Additionally, we report the performance of machine translation, automatic speech recognition, and language identification as downstream tasks evaluated on Central Kurdish varieties. Data and models are publicly available under an open license at https://github.com/sinaahmadi/CORDI.",
    "path": "papers/24/03/2403.01983.json",
    "total_tokens": 805,
    "translated_title": "中央库尔德语种的语言和语音技术",
    "translated_abstract": "库尔德语是一种印欧语言，拥有超过3000万的使用者，被认为是一个方言连续体，以其多样性的语言变体而闻名。先前的研究将库尔德语的语言和语音技术视为宏语言进行处理，导致方言和变体之间存在资源和工具相对匮乏的差异。本文致力于为中央库尔德语种开发语言和语音技术资源迈出一步，通过记录电影和电视剧的转录作为野外工作的替代方式来创建语料库。此外，我们报告了在中央库尔德语种上评估的机器翻译、自动语音识别和语言识别性能作为下游任务。数据和模型已在https://github.com/sinaahmadi/CORDI以开放许可证公开提供。",
    "tldr": "本文针对中央库尔德语种开发语言和语音技术，通过电影和电视剧的转录创建语料库，并评估了机器翻译、自动语音识别和语言识别的性能。",
    "en_tdlr": "This paper focuses on developing language and speech technology for Central Kurdish varieties, creating a corpus by transcribing movies and TV series, and evaluating the performance of machine translation, automatic speech recognition, and language identification."
}