{
    "title": "Boarding for ISS: Imbalanced Self-Supervised: Discovery of a Scaled Autoencoder for Mixed Tabular Datasets",
    "abstract": "arXiv:2403.15790v1 Announce Type: new  Abstract: The field of imbalanced self-supervised learning, especially in the context of tabular data, has not been extensively studied. Existing research has predominantly focused on image datasets. This paper aims to fill this gap by examining the specific challenges posed by data imbalance in self-supervised learning in the domain of tabular data, with a primary focus on autoencoders. Autoencoders are widely employed for learning and constructing a new representation of a dataset, particularly for dimensionality reduction. They are also often used for generative model learning, as seen in variational autoencoders. When dealing with mixed tabular data, qualitative variables are often encoded using a one-hot encoder with a standard loss function (MSE or Cross Entropy). In this paper, we analyze the drawbacks of this approach, especially when categorical variables are imbalanced. We propose a novel metric to balance learning: a Multi-Supervised Ba",
    "link": "https://arxiv.org/abs/2403.15790",
    "context": "Title: Boarding for ISS: Imbalanced Self-Supervised: Discovery of a Scaled Autoencoder for Mixed Tabular Datasets\nAbstract: arXiv:2403.15790v1 Announce Type: new  Abstract: The field of imbalanced self-supervised learning, especially in the context of tabular data, has not been extensively studied. Existing research has predominantly focused on image datasets. This paper aims to fill this gap by examining the specific challenges posed by data imbalance in self-supervised learning in the domain of tabular data, with a primary focus on autoencoders. Autoencoders are widely employed for learning and constructing a new representation of a dataset, particularly for dimensionality reduction. They are also often used for generative model learning, as seen in variational autoencoders. When dealing with mixed tabular data, qualitative variables are often encoded using a one-hot encoder with a standard loss function (MSE or Cross Entropy). In this paper, we analyze the drawbacks of this approach, especially when categorical variables are imbalanced. We propose a novel metric to balance learning: a Multi-Supervised Ba",
    "path": "papers/24/03/2403.15790.json",
    "total_tokens": 927,
    "translated_title": "ISS登机：不平衡的自监督：发现用于混合表格数据集的缩放自动编码器",
    "translated_abstract": "arXiv:2403.15790v1公告类型：新摘要：自监督学习领域，特别是在表格数据领域，不太受到广泛关注。现有研究主要集中在图像数据集上。本文旨在填补这一空白，通过探讨自监督学习中数据不平衡在表格数据领域中所带来的具体挑战，重点放在自动编码器上。自动编码器广泛用于学习和构建数据集的新表示，特别是用于降维。它们也经常用于生成模型学习，如变分自动编码器中所见。在处理混合表格数据时，定性变量通常使用独热编码器与标准损失函数（均方误差或交叉熵）进行编码。在本文中，我们分析了这种方法的缺点，特别是当分类变量不平衡时。我们提出了一个新的度量以平衡学习：一个多监督的 Ba",
    "tldr": "这里是中文总结出的一句话要点: 本文针对表格数据领域中自监督学习中的数据不平衡挑战，提出了一种用于混合表格数据集的缩放自动编码器，填补了研究中的缺口。",
    "en_tdlr": "Here is the English summary sentence: This paper addresses the challenge of data imbalance in self-supervised learning in tabular data domain, proposing a scaled autoencoder for mixed tabular datasets to fill the research gap."
}