{
    "title": "A2DMN: Anatomy-Aware Dilated Multiscale Network for Breast Ultrasound Semantic Segmentation",
    "abstract": "arXiv:2403.15560v1 Announce Type: cross  Abstract: In recent years, convolutional neural networks for semantic segmentation of breast ultrasound (BUS) images have shown great success; however, two major challenges still exist. 1) Most current approaches inherently lack the ability to utilize tissue anatomy, resulting in misclassified image regions. 2) They struggle to produce accurate boundaries due to the repeated down-sampling operations. To address these issues, we propose a novel breast anatomy-aware network for capturing fine image details and a new smoothness term that encodes breast anatomy. It incorporates context information across multiple spatial scales to generate more accurate semantic boundaries. Extensive experiments are conducted to compare the proposed method and eight state-of-the-art approaches using a BUS dataset with 325 images. The results demonstrate the proposed method significantly improves the segmentation of the muscle, mammary, and tumor classes and produces",
    "link": "https://arxiv.org/abs/2403.15560",
    "context": "Title: A2DMN: Anatomy-Aware Dilated Multiscale Network for Breast Ultrasound Semantic Segmentation\nAbstract: arXiv:2403.15560v1 Announce Type: cross  Abstract: In recent years, convolutional neural networks for semantic segmentation of breast ultrasound (BUS) images have shown great success; however, two major challenges still exist. 1) Most current approaches inherently lack the ability to utilize tissue anatomy, resulting in misclassified image regions. 2) They struggle to produce accurate boundaries due to the repeated down-sampling operations. To address these issues, we propose a novel breast anatomy-aware network for capturing fine image details and a new smoothness term that encodes breast anatomy. It incorporates context information across multiple spatial scales to generate more accurate semantic boundaries. Extensive experiments are conducted to compare the proposed method and eight state-of-the-art approaches using a BUS dataset with 325 images. The results demonstrate the proposed method significantly improves the segmentation of the muscle, mammary, and tumor classes and produces",
    "path": "papers/24/03/2403.15560.json",
    "total_tokens": 900,
    "translated_title": "A2DMN：面向乳腺超声语义分割的解剖感知扩张多尺度网络",
    "translated_abstract": "最近，用于乳腺超声图像语义分割的卷积神经网络已经取得了巨大成功; 然而，仍然存在两个主要挑战。首先，大多数当前方法固有地缺乏利用组织解剖的能力，导致图像区域被错误分类。其次，它们由于不断下采样操作而难以产生准确的边界。为解决这些问题，我们提出了一种新颖的乳腺解剖感知网络，用于捕获精细图像细节，并提出了一个编码乳腺解剖的新平滑度项。它跨多个空间尺度合并上下文信息，以生成更准确的语义边界。我们进行了大量实验证明了所提方法与八种最先进方法在325幅乳腺超声图像数据集上的比较。结果表明，所提方法显著改善了肌肉、乳房和肿瘤类别的分割，并产生",
    "tldr": "提出了一种新颖的乳腺解剖感知网络，用于捕获细致图像细节和编码乳腺解剖的新平滑度项，有效改善了肌肉、乳房和肿瘤类别的分割准确性。",
    "en_tdlr": "Proposed a novel breast anatomy-aware network for capturing fine image details and a new smoothness term encoding breast anatomy, significantly improving the segmentation accuracy of muscle, mammary, and tumor classes."
}