{
    "title": "Deep polytopic autoencoders for low-dimensional linear parameter-varying approximations and nonlinear feedback design",
    "abstract": "arXiv:2403.18044v1 Announce Type: cross  Abstract: Polytopic autoencoders provide low-dimensional parametrizations of states in a polytope. For nonlinear PDEs, this is readily applied to low-dimensional linear parameter-varying (LPV) approximations as they have been exploited for efficient nonlinear controller design via series expansions of the solution to the state-dependent Riccati equation. In this work, we develop a polytopic autoencoder for control applications and show how it outperforms standard linear approaches in view of LPV approximations of nonlinear systems and how the particular architecture enables higher order series expansions at little extra computational effort. We illustrate the properties and potentials of this approach to computational nonlinear controller design for large-scale systems with a thorough numerical study.",
    "link": "https://arxiv.org/abs/2403.18044",
    "context": "Title: Deep polytopic autoencoders for low-dimensional linear parameter-varying approximations and nonlinear feedback design\nAbstract: arXiv:2403.18044v1 Announce Type: cross  Abstract: Polytopic autoencoders provide low-dimensional parametrizations of states in a polytope. For nonlinear PDEs, this is readily applied to low-dimensional linear parameter-varying (LPV) approximations as they have been exploited for efficient nonlinear controller design via series expansions of the solution to the state-dependent Riccati equation. In this work, we develop a polytopic autoencoder for control applications and show how it outperforms standard linear approaches in view of LPV approximations of nonlinear systems and how the particular architecture enables higher order series expansions at little extra computational effort. We illustrate the properties and potentials of this approach to computational nonlinear controller design for large-scale systems with a thorough numerical study.",
    "path": "papers/24/03/2403.18044.json",
    "total_tokens": 820,
    "translated_title": "深度多面体自编码器用于低维线性参数变化逼近和非线性反馈设计",
    "translated_abstract": "多面体自编码器提供了多面体中状态的低维参数化。对于非线性PDE，这很容易应用于低维线性参数变化(LPV)逼近，因为它们已被用于通过状态相关Riccati方程的级数展开实现有效的非线性控制器设计。在这项工作中，我们开发了一种用于控制应用的多面体自编码器，并展示了它如何在视图非线性系统的LPV逼近方面优于标准线性方法，以及特定架构如何在几乎没有额外计算的情况下实现更高阶级数展开。我们通过彻底的数值研究展示了该方法在大规模系统的计算非线性控制器设计中的性质和潜力。",
    "tldr": "该研究开发了一种用于控制应用的深度多面体自编码器，在大规模系统的计算非线性控制器设计中展现出比标准线性方法更好的性能，其特定架构使得实现更高阶级数展开几乎没有额外计算负担。",
    "en_tdlr": "This study presents a deep polytopic autoencoder for control applications, outperforming standard linear approaches in computational nonlinear controller design for large-scale systems, with the particular architecture enabling higher order series expansions at little extra computational effort."
}