{
    "title": "Unveil Conditional Diffusion Models with Classifier-free Guidance: A Sharp Statistical Theory",
    "abstract": "arXiv:2403.11968v1 Announce Type: new  Abstract: Conditional diffusion models serve as the foundation of modern image synthesis and find extensive application in fields like computational biology and reinforcement learning. In these applications, conditional diffusion models incorporate various conditional information, such as prompt input, to guide the sample generation towards desired properties. Despite the empirical success, theory of conditional diffusion models is largely missing. This paper bridges this gap by presenting a sharp statistical theory of distribution estimation using conditional diffusion models. Our analysis yields a sample complexity bound that adapts to the smoothness of the data distribution and matches the minimax lower bound. The key to our theoretical development lies in an approximation result for the conditional score function, which relies on a novel diffused Taylor approximation technique. Moreover, we demonstrate the utility of our statistical theory in ",
    "link": "https://arxiv.org/abs/2403.11968",
    "context": "Title: Unveil Conditional Diffusion Models with Classifier-free Guidance: A Sharp Statistical Theory\nAbstract: arXiv:2403.11968v1 Announce Type: new  Abstract: Conditional diffusion models serve as the foundation of modern image synthesis and find extensive application in fields like computational biology and reinforcement learning. In these applications, conditional diffusion models incorporate various conditional information, such as prompt input, to guide the sample generation towards desired properties. Despite the empirical success, theory of conditional diffusion models is largely missing. This paper bridges this gap by presenting a sharp statistical theory of distribution estimation using conditional diffusion models. Our analysis yields a sample complexity bound that adapts to the smoothness of the data distribution and matches the minimax lower bound. The key to our theoretical development lies in an approximation result for the conditional score function, which relies on a novel diffused Taylor approximation technique. Moreover, we demonstrate the utility of our statistical theory in ",
    "path": "papers/24/03/2403.11968.json",
    "total_tokens": 851,
    "translated_title": "揭示无分类器引导的条件扩散模型：一个尖锐的统计理论",
    "translated_abstract": "arXiv:2403.11968v1 公告类型: 新 具有分类条件的扩散模型是现代图像合成的基础，在计算生物学和强化学习等领域得到广泛应用。在这些应用中，条件扩散模型结合各种条件信息，如提示输入，以引导样本生成到所需的属性。尽管经验上取得成功，但条件扩散模型的理论在很大程度上尚不完备。本文通过展示使用条件扩散模型进行分布估计的尖锐统计理论来弥合这一差距。我们的分析得出一个适应数据分布平滑度并匹配极小极值下限的样本复杂度界限。我们理论发展的关键在于条件评分函数的逼近结果，依赖于一种新颖的扩散泰勒逼近技术。此外，我们展示了我们的统计理论在...",
    "tldr": "本文揭示了无分类器引导的条件扩散模型的尖锐统计理论，提出了适应数据分布平滑度的样本复杂度界限，并展示了新颖的扩散泰勒逼近技术在理论发展中的重要性。",
    "en_tdlr": "This paper unveils a sharp statistical theory of conditional diffusion models without classifier guidance, providing a sample complexity bound that adapts to data distribution smoothness and demonstrating the importance of a novel diffused Taylor approximation technique in theoretical development."
}