{
    "title": "MedAide: Leveraging Large Language Models for On-Premise Medical Assistance on Edge Devices",
    "abstract": "arXiv:2403.00830v1 Announce Type: new  Abstract: Large language models (LLMs) are revolutionizing various domains with their remarkable natural language processing (NLP) abilities. However, deploying LLMs in resource-constrained edge computing and embedded systems presents significant challenges. Another challenge lies in delivering medical assistance in remote areas with limited healthcare facilities and infrastructure. To address this, we introduce MedAide, an on-premise healthcare chatbot. It leverages tiny-LLMs integrated with LangChain, providing efficient edge-based preliminary medical diagnostics and support. MedAide employs model optimizations for minimal memory footprint and latency on embedded edge devices without server infrastructure. The training process is optimized using low-rank adaptation (LoRA). Additionally, the model is trained on diverse medical datasets, employing reinforcement learning from human feedback (RLHF) to enhance its domain-specific capabilities. The sy",
    "link": "https://arxiv.org/abs/2403.00830",
    "context": "Title: MedAide: Leveraging Large Language Models for On-Premise Medical Assistance on Edge Devices\nAbstract: arXiv:2403.00830v1 Announce Type: new  Abstract: Large language models (LLMs) are revolutionizing various domains with their remarkable natural language processing (NLP) abilities. However, deploying LLMs in resource-constrained edge computing and embedded systems presents significant challenges. Another challenge lies in delivering medical assistance in remote areas with limited healthcare facilities and infrastructure. To address this, we introduce MedAide, an on-premise healthcare chatbot. It leverages tiny-LLMs integrated with LangChain, providing efficient edge-based preliminary medical diagnostics and support. MedAide employs model optimizations for minimal memory footprint and latency on embedded edge devices without server infrastructure. The training process is optimized using low-rank adaptation (LoRA). Additionally, the model is trained on diverse medical datasets, employing reinforcement learning from human feedback (RLHF) to enhance its domain-specific capabilities. The sy",
    "path": "papers/24/03/2403.00830.json",
    "total_tokens": 945,
    "translated_title": "MedAide：利用大型语言模型为边缘设备提供现场医疗援助",
    "translated_abstract": "大型语言模型( LLMs )以其出色的自然语言处理( NLP )功能正在改变各个领域。然而，在资源受限的边缘计算和嵌入式系统中部署 LLMs 存在重大挑战。另一个挑战在于在医疗资源有限、基础设施不完备的偏远地区提供医疗援助。为解决这一问题，我们介绍了 MedAide，一款现场医疗聊天机器人。它利用与 LangChain 集成的微型 LLMs，提供高效的基于边缘的初步医疗诊断和支持。MedAide 通过模型优化在嵌入式边缘设备上实现最小内存占用和延迟，无需服务器基础设施。训练过程使用低秩适应 (LoRA ) 进行优化。此外，该模型在多样化的医疗数据集上进行训练，应用来自人类反馈的强化学习 (RLHF) 来增强其特定领域的能力。",
    "tldr": "MedAide是一款利用微型语言模型与LangChain集成，为资源受限的边缘设备提供高效医疗诊断和支持的现场医疗聊天机器人，通过模型优化和多样的医疗数据集训练来提升其领域特定能力。",
    "en_tdlr": "MedAide is an on-premise healthcare chatbot that leverages tiny language models integrated with LangChain to provide efficient medical diagnostics and support for resource-constrained edge devices, enhancing its domain-specific capabilities through model optimizations and training on diverse medical datasets."
}