{
    "title": "Engineering Safety Requirements for Autonomous Driving with Large Language Models",
    "abstract": "arXiv:2403.16289v1 Announce Type: new  Abstract: Changes and updates in the requirement artifacts, which can be frequent in the automotive domain, are a challenge for SafetyOps. Large Language Models (LLMs), with their impressive natural language understanding and generating capabilities, can play a key role in automatically refining and decomposing requirements after each update. In this study, we propose a prototype of a pipeline of prompts and LLMs that receives an item definition and outputs solutions in the form of safety requirements. This pipeline also performs a review of the requirement dataset and identifies redundant or contradictory requirements. We first identified the necessary characteristics for performing HARA and then defined tests to assess an LLM's capability in meeting these criteria. We used design science with multiple iterations and let experts from different companies evaluate each cycle quantitatively and qualitatively. Finally, the prototype was implemented a",
    "link": "https://arxiv.org/abs/2403.16289",
    "context": "Title: Engineering Safety Requirements for Autonomous Driving with Large Language Models\nAbstract: arXiv:2403.16289v1 Announce Type: new  Abstract: Changes and updates in the requirement artifacts, which can be frequent in the automotive domain, are a challenge for SafetyOps. Large Language Models (LLMs), with their impressive natural language understanding and generating capabilities, can play a key role in automatically refining and decomposing requirements after each update. In this study, we propose a prototype of a pipeline of prompts and LLMs that receives an item definition and outputs solutions in the form of safety requirements. This pipeline also performs a review of the requirement dataset and identifies redundant or contradictory requirements. We first identified the necessary characteristics for performing HARA and then defined tests to assess an LLM's capability in meeting these criteria. We used design science with multiple iterations and let experts from different companies evaluate each cycle quantitatively and qualitatively. Finally, the prototype was implemented a",
    "path": "papers/24/03/2403.16289.json",
    "total_tokens": 834,
    "translated_title": "利用大型语言模型工程化自动驾驶安全需求",
    "translated_abstract": "在汽车领域，需求文档的变更和更新频繁，这对安全运营构成挑战。大型语言模型（LLMs）以其出色的自然语言理解和生成能力，在每次更新后自动完善和拆分需求方面能发挥关键作用。在本研究中，我们提出了一个提示和LLMs管道的原型，接收项目定义并以安全需求的形式输出解决方案。该管道还对需求数据集进行审核，并识别多余或矛盾的需求。我们首先确定了执行HARA所需的特征，然后定义了用于评估LLMs是否符合这些标准的测试。我们采用设计科学方法进行多次迭代，并邀请来自不同公司的专家定量和定性评估每个周期。最后，实现了该原型。",
    "tldr": "该研究提出了利用大型语言模型自动优化和拆分安全需求的管道，通过评估LLMs的能力，并识别多余或矛盾的需求，为解决自动驾驶领域中需求变更频繁的挑战提供了新思路。",
    "en_tdlr": "This study presents a pipeline utilizing large language models for automatically refining and decomposing safety requirements, evaluating LLMs capabilities, and identifying redundant or contradictory requirements, offering a new approach to addressing the challenge of frequent requirement changes in autonomous driving domain."
}