{
    "title": "IB-Net: Initial Branch Network for Variable Decision in Boolean Satisfiability",
    "abstract": "arXiv:2403.03517v1 Announce Type: new  Abstract: Boolean Satisfiability problems are vital components in Electronic Design Automation, particularly within the Logic Equivalence Checking process. Currently, SAT solvers are employed for these problems and neural network is tried as assistance to solvers. However, as SAT problems in the LEC context are distinctive due to their predominantly unsatisfiability nature and a substantial proportion of UNSAT-core variables, existing neural network assistance has proven unsuccessful in this specialized domain. To tackle this challenge, we propose IB-Net, an innovative framework utilizing graph neural networks and novel graph encoding techniques to model unsatisfiable problems and interact with state-of-the-art solvers. Extensive evaluations across solvers and datasets demonstrate IB-Net's acceleration, achieving an average runtime speedup of 5.0% on industrial data and 8.3% on SAT competition data empirically. This breakthrough advances efficient",
    "link": "https://arxiv.org/abs/2403.03517",
    "context": "Title: IB-Net: Initial Branch Network for Variable Decision in Boolean Satisfiability\nAbstract: arXiv:2403.03517v1 Announce Type: new  Abstract: Boolean Satisfiability problems are vital components in Electronic Design Automation, particularly within the Logic Equivalence Checking process. Currently, SAT solvers are employed for these problems and neural network is tried as assistance to solvers. However, as SAT problems in the LEC context are distinctive due to their predominantly unsatisfiability nature and a substantial proportion of UNSAT-core variables, existing neural network assistance has proven unsuccessful in this specialized domain. To tackle this challenge, we propose IB-Net, an innovative framework utilizing graph neural networks and novel graph encoding techniques to model unsatisfiable problems and interact with state-of-the-art solvers. Extensive evaluations across solvers and datasets demonstrate IB-Net's acceleration, achieving an average runtime speedup of 5.0% on industrial data and 8.3% on SAT competition data empirically. This breakthrough advances efficient",
    "path": "papers/24/03/2403.03517.json",
    "total_tokens": 816,
    "translated_title": "IB-Net: 布尔可满足性中变量决策的初始分支网络",
    "translated_abstract": "布尔可满足性问题是电子设计自动化中的重要组成部分，特别是在逻辑等效检查过程中。目前，SAT求解器被用于这些问题，并尝试将神经网络作为求解器的辅助。然而，在LEC上下文中的SAT问题由于其主要为不可满足性质和大量UNSAT-core变量而与众不同，现有的神经网络辅助在这一专业领域中表现不佳。为了解决这一挑战，我们提出了IB-Net，一种创新框架，利用图神经网络和新颖的图编码技术来建模不可满足问题，并与最先进的求解器互动。对求解器和数据集进行全面评估表明，IB-Net在工业数据上的平均运行时间加速了5.0%，在SAT竞赛数据上加快了8.3% 的速度。",
    "tldr": "IB-Net 提出了一种创新的框架，利用图神经网络和新颖的图编码技术来加速布尔可满足性问题的求解。",
    "en_tdlr": "IB-Net proposes an innovative framework utilizing graph neural networks and novel graph encoding techniques to accelerate the solution of Boolean Satisfiability problems."
}