{
    "title": "Towards the Reusability and Compositionality of Causal Representations",
    "abstract": "arXiv:2403.09830v1 Announce Type: cross  Abstract: Causal Representation Learning (CRL) aims at identifying high-level causal factors and their relationships from high-dimensional observations, e.g., images. While most CRL works focus on learning causal representations in a single environment, in this work we instead propose a first step towards learning causal representations from temporal sequences of images that can be adapted in a new environment, or composed across multiple related environments. In particular, we introduce DECAF, a framework that detects which causal factors can be reused and which need to be adapted from previously learned causal representations. Our approach is based on the availability of intervention targets, that indicate which variables are perturbed at each time step. Experiments on three benchmark datasets show that integrating our framework with four state-of-the-art CRL approaches leads to accurate representations in a new environment with only a few sam",
    "link": "https://arxiv.org/abs/2403.09830",
    "context": "Title: Towards the Reusability and Compositionality of Causal Representations\nAbstract: arXiv:2403.09830v1 Announce Type: cross  Abstract: Causal Representation Learning (CRL) aims at identifying high-level causal factors and their relationships from high-dimensional observations, e.g., images. While most CRL works focus on learning causal representations in a single environment, in this work we instead propose a first step towards learning causal representations from temporal sequences of images that can be adapted in a new environment, or composed across multiple related environments. In particular, we introduce DECAF, a framework that detects which causal factors can be reused and which need to be adapted from previously learned causal representations. Our approach is based on the availability of intervention targets, that indicate which variables are perturbed at each time step. Experiments on three benchmark datasets show that integrating our framework with four state-of-the-art CRL approaches leads to accurate representations in a new environment with only a few sam",
    "path": "papers/24/03/2403.09830.json",
    "total_tokens": 879,
    "translated_title": "旨在实现因果表示的可重用性和可组合性",
    "translated_abstract": "Causal Representation Learning（CRL）旨在从高维观测中识别高级因果因素及其关系，例如图像。大多数CRL作品侧重于在单个环境中学习因果表示，而本研究提出了一个新方向，即从图像的时间序列中学习因果表示，可以在新环境中进行调整，或者跨多个相关环境进行组合。具体而言，我们介绍了DECAF，一个框架，用于检测哪些因果因素可以重复使用，哪些需要从先前学习的因果表示中进行调整。我们的方法基于干预目标的可用性，这些目标指示每个时间步骤上被扰动的变量。在三个基准数据集上的实验表明，将我们的框架与四种最先进的CRL方法结合使用，可以在新环境中仅使用少量样本即可获得准确的表示。",
    "tldr": "该研究提出了DECAF框架，旨在从时间序列图像中学习因果表示，使其能够在新环境中进行调整，并在多个相关环境中进行组合，通过与四种最先进的CRL方法结合，能够在新环境中使用少量样本即可获得准确的表示。",
    "en_tdlr": "This study introduces the DECAF framework to learn causal representations from temporal sequences of images, enabling adaptability in new environments and composability across multiple related environments, and when combined with four state-of-the-art CRL methods, accurate representations can be achieved in a new environment with only a few samples."
}