{
    "title": "Simple Full-Spectrum Correlated k-Distribution Model based on Multilayer Perceptron",
    "abstract": "arXiv:2403.12993v1 Announce Type: new  Abstract: While neural networks have been successfully applied to the full-spectrum k-distribution (FSCK) method at a large range of thermodynamics with k-values predicted by a trained multilayer perceptron (MLP) model, the required a-values still need to be calculated on-the-fly, which theoretically degrades the FSCK method and may lead to errors. On the other hand, too complicated structure of the current MLP model inevitably slows down the calculation efficiency. Therefore, to compensate among accuracy, efficiency and storage, the simple MLP designed based on the nature of FSCK method are developed, i.e., the simple FSCK MLP (SFM) model, from which those correlated k-values and corresponding ka-values can be efficiently obtained. Several test cases have been carried out to compare the developed SFM model and other FSCK tools including look-up tables and traditional FSCK MLP (TFM) model. Results show that the SFM model can achieve excellent accu",
    "link": "https://arxiv.org/abs/2403.12993",
    "context": "Title: Simple Full-Spectrum Correlated k-Distribution Model based on Multilayer Perceptron\nAbstract: arXiv:2403.12993v1 Announce Type: new  Abstract: While neural networks have been successfully applied to the full-spectrum k-distribution (FSCK) method at a large range of thermodynamics with k-values predicted by a trained multilayer perceptron (MLP) model, the required a-values still need to be calculated on-the-fly, which theoretically degrades the FSCK method and may lead to errors. On the other hand, too complicated structure of the current MLP model inevitably slows down the calculation efficiency. Therefore, to compensate among accuracy, efficiency and storage, the simple MLP designed based on the nature of FSCK method are developed, i.e., the simple FSCK MLP (SFM) model, from which those correlated k-values and corresponding ka-values can be efficiently obtained. Several test cases have been carried out to compare the developed SFM model and other FSCK tools including look-up tables and traditional FSCK MLP (TFM) model. Results show that the SFM model can achieve excellent accu",
    "path": "papers/24/03/2403.12993.json",
    "total_tokens": 868,
    "translated_title": "基于多层感知器的简单全光谱相关k-分布模型",
    "translated_abstract": "虽然神经网络已成功应用于全光谱k-分布（FSCK）方法在大范围的热力学中，但由训练的多层感知器（MLP）模型预测的k值，仍然需要即时计算a值，这在理论上会降低FSCK方法的效果，可能导致错误。与此同时，目前MLP模型的过于复杂结构不可避免地降低了计算效率。因此，为了在准确性、效率和存储之间进行补偿，基于FSCK方法的性质而设计的简单MLP被开发出来，即简单FSCK MLP（SFM）模型，从中可以高效地获取相关的k值和相应的ka值。进行了几个测试案例来比较开发的SFM模型和其他FSCK工具，包括查找表和传统FSCK MLP（TFM）模型。结果表明SFM模型可以实现优秀的准确性。",
    "tldr": "基于FSCK方法的性质设计的简单MLP模型（SFM）实现了在准确性、效率和存储之间的平衡，并能够高效地获取相关的k值和相应的ka值。",
    "en_tdlr": "The simple MLP model (SFM) designed based on the nature of FSCK method achieves a balance among accuracy, efficiency, and storage, efficiently obtaining correlated k-values and corresponding ka-values."
}