{
    "title": "Document Set Expansion with Positive-Unlabelled Learning Using Intractable Density Estimation",
    "abstract": "arXiv:2403.17473v1 Announce Type: new  Abstract: The Document Set Expansion (DSE) task involves identifying relevant documents from large collections based on a limited set of example documents. Previous research has highlighted Positive and Unlabeled (PU) learning as a promising approach for this task. However, most PU methods rely on the unrealistic assumption of knowing the class prior for positive samples in the collection. To address this limitation, this paper introduces a novel PU learning framework that utilizes intractable density estimation models. Experiments conducted on PubMed and Covid datasets in a transductive setting showcase the effectiveness of the proposed method for DSE. Code is available from https://github.com/Beautifuldog01/Document-set-expansion-puDE.",
    "link": "https://arxiv.org/abs/2403.17473",
    "context": "Title: Document Set Expansion with Positive-Unlabelled Learning Using Intractable Density Estimation\nAbstract: arXiv:2403.17473v1 Announce Type: new  Abstract: The Document Set Expansion (DSE) task involves identifying relevant documents from large collections based on a limited set of example documents. Previous research has highlighted Positive and Unlabeled (PU) learning as a promising approach for this task. However, most PU methods rely on the unrealistic assumption of knowing the class prior for positive samples in the collection. To address this limitation, this paper introduces a novel PU learning framework that utilizes intractable density estimation models. Experiments conducted on PubMed and Covid datasets in a transductive setting showcase the effectiveness of the proposed method for DSE. Code is available from https://github.com/Beautifuldog01/Document-set-expansion-puDE.",
    "path": "papers/24/03/2403.17473.json",
    "total_tokens": 767,
    "translated_title": "使用难以估计的密度估计进行正-未标记学习进行文档集扩展",
    "translated_abstract": "文档集扩展（DSE）任务涉及根据一组有限的示例文档从大型文档集合中识别相关文档。先前的研究强调了正向和未标记（PU）学习作为这一任务的一种有希望的方法。然而，大多数PU方法依赖于在集合中正样本的类先验的不切实际的假设。为了解决这一限制，本文介绍了一个利用难以估计的密度估计模型的新颖PU学习框架。在PubMed和Covid数据集上进行的转导设置实验展示了所提出方法在DSE中的有效性。代码可从 https://github.com/Beautifuldog01/Document-set-expansion-puDE 获取。",
    "tldr": "本文介绍了一种利用难以估计的密度估计模型的新颖PU学习框架，有效解决了文档集扩展任务中正-未标记学习面临的类先验假设不切实际的问题。",
    "en_tdlr": "This paper presents a novel PU learning framework that utilizes intractable density estimation models, effectively addressing the unrealistic assumption of knowing the class prior for positive samples in the Document Set Expansion task."
}