{
    "title": "Thermal Earth Model for the Conterminous United States Using an Interpolative Physics-Informed Graph Neural Network (InterPIGNN)",
    "abstract": "arXiv:2403.09961v1 Announce Type: cross  Abstract: This study presents a data-driven spatial interpolation algorithm based on physics-informed graph neural networks used to develop national temperature-at-depth maps for the conterminous United States. The model was trained to approximately satisfy the three-dimensional heat conduction law by simultaneously predicting subsurface temperature, surface heat flow, and rock thermal conductivity. In addition to bottomhole temperature measurements, we incorporated other physical quantities as model inputs, such as depth, geographic coordinates, elevation, sediment thickness, magnetic anomaly, gravity anomaly, gamma-ray flux of radioactive elements, seismicity, and electric conductivity. We constructed surface heat flow, and temperature and thermal conductivity predictions for depths of 0-7 km at an interval of 1 km with spatial resolution of 18 km$^2$ per grid cell. Our model showed superior temperature, surface heat flow and thermal conductiv",
    "link": "https://arxiv.org/abs/2403.09961",
    "context": "Title: Thermal Earth Model for the Conterminous United States Using an Interpolative Physics-Informed Graph Neural Network (InterPIGNN)\nAbstract: arXiv:2403.09961v1 Announce Type: cross  Abstract: This study presents a data-driven spatial interpolation algorithm based on physics-informed graph neural networks used to develop national temperature-at-depth maps for the conterminous United States. The model was trained to approximately satisfy the three-dimensional heat conduction law by simultaneously predicting subsurface temperature, surface heat flow, and rock thermal conductivity. In addition to bottomhole temperature measurements, we incorporated other physical quantities as model inputs, such as depth, geographic coordinates, elevation, sediment thickness, magnetic anomaly, gravity anomaly, gamma-ray flux of radioactive elements, seismicity, and electric conductivity. We constructed surface heat flow, and temperature and thermal conductivity predictions for depths of 0-7 km at an interval of 1 km with spatial resolution of 18 km$^2$ per grid cell. Our model showed superior temperature, surface heat flow and thermal conductiv",
    "path": "papers/24/03/2403.09961.json",
    "total_tokens": 906,
    "translated_title": "利用插值物理信息图神经网络（InterPIGNN）建立美国本土热地球模型",
    "translated_abstract": "这项研究提出了一种基于物理信息图神经网络的数据驱动空间插值算法，用于开发美国本土的温度-深度地图。该模型经过训练，同时预测地下温度、地表热流和岩石导热率，以近似满足三维传热定律。除了底孔温度测量值，我们还将其他物理量作为模型输入，例如深度、地理坐标、海拔、沉积物厚度、磁异常、重力异常、放射性元素的γ射线通量、地震活动和电导率。我们构建了深度为0-7公里，间隔为1公里，空间分辨率为每个18平方公里格网单元的地表热流、温度和导热率预测。我们的模型展现了卓越的温度、地表热流和导热率预测性能。",
    "tldr": "利用插值物理信息图神经网络，本研究开发出一种基于数据驱动的空间插值算法，构建了美国本土温度-深度地图，同时精确预测地下温度、地表热流和岩石导热率。",
    "en_tdlr": "Using an interpolative physics-informed graph neural network, this study developed a data-driven spatial interpolation algorithm to build temperature-at-depth maps for the conterminous United States, while accurately predicting subsurface temperature, surface heat flow, and rock thermal conductivity."
}