{
    "title": "Improving cross-domain brain tissue segmentation in fetal MRI with synthetic data",
    "abstract": "arXiv:2403.15103v1 Announce Type: cross  Abstract: Segmentation of fetal brain tissue from magnetic resonance imaging (MRI) plays a crucial role in the study of in utero neurodevelopment. However, automated tools face substantial domain shift challenges as they must be robust to highly heterogeneous clinical data, often limited in numbers and lacking annotations. Indeed, high variability of the fetal brain morphology, MRI acquisition parameters, and superresolution reconstruction (SR) algorithms adversely affect the model's performance when evaluated out-of-domain. In this work, we introduce FetalSynthSeg, a domain randomization method to segment fetal brain MRI, inspired by SynthSeg. Our results show that models trained solely on synthetic data outperform models trained on real data in out-ofdomain settings, validated on a 120-subject cross-domain dataset. Furthermore, we extend our evaluation to 40 subjects acquired using lowfield (0.55T) MRI and reconstructed with novel SR models, s",
    "link": "https://arxiv.org/abs/2403.15103",
    "context": "Title: Improving cross-domain brain tissue segmentation in fetal MRI with synthetic data\nAbstract: arXiv:2403.15103v1 Announce Type: cross  Abstract: Segmentation of fetal brain tissue from magnetic resonance imaging (MRI) plays a crucial role in the study of in utero neurodevelopment. However, automated tools face substantial domain shift challenges as they must be robust to highly heterogeneous clinical data, often limited in numbers and lacking annotations. Indeed, high variability of the fetal brain morphology, MRI acquisition parameters, and superresolution reconstruction (SR) algorithms adversely affect the model's performance when evaluated out-of-domain. In this work, we introduce FetalSynthSeg, a domain randomization method to segment fetal brain MRI, inspired by SynthSeg. Our results show that models trained solely on synthetic data outperform models trained on real data in out-ofdomain settings, validated on a 120-subject cross-domain dataset. Furthermore, we extend our evaluation to 40 subjects acquired using lowfield (0.55T) MRI and reconstructed with novel SR models, s",
    "path": "papers/24/03/2403.15103.json",
    "total_tokens": 855,
    "translated_title": "用合成数据改进胎儿MRI中跨领域脑组织分割",
    "translated_abstract": "胎儿脑组织在磁共振成像（MRI）中的分割对于子宫内神经发育的研究起着至关重要的作用。然而，自动化工具面临着重大的领域转移挑战，因为它们必须对高度异质的临床数据具有健壮性，这些数据通常数量有限且缺乏注释。本研究提出了一种灵感来源于SynthSeg的FetalSynthSeg领域随机化方法，用于分割胎儿脑MRI。我们的结果表明，仅在合成数据上训练的模型在跨领域数据集上的表现优于在真实数据上训练的模型，在一个包含120个对象的数据集上进行了验证。此外，我们将评估扩展到使用低磁场（0.55T）MRI采集并用新型SR模型重建的40个对象。",
    "tldr": "提出了FetalSynthSeg方法，用于改进胎儿MRI中的脑组织分割，通过领域随机化方法，模型在跨领域数据集上的效果优于传统模型。",
    "en_tdlr": "Introduced FetalSynthSeg method to improve brain tissue segmentation in fetal MRI, outperforming traditional models on cross-domain datasets through domain randomization."
}