{
    "title": "Topological Cycle Graph Attention Network for Brain Functional Connectivity",
    "abstract": "arXiv:2403.19149v1 Announce Type: new  Abstract: This study, we introduce a novel Topological Cycle Graph Attention Network (CycGAT), designed to delineate a functional backbone within brain functional graph--key pathways essential for signal transmissio--from non-essential, redundant connections that form cycles around this core structure. We first introduce a cycle incidence matrix that establishes an independent cycle basis within a graph, mapping its relationship with edges. We propose a cycle graph convolution that leverages a cycle adjacency matrix, derived from the cycle incidence matrix, to specifically filter edge signals in a domain of cycles. Additionally, we strengthen the representation power of the cycle graph convolution by adding an attention mechanism, which is further augmented by the introduction of edge positional encodings in cycles, to enhance the topological awareness of CycGAT. We demonstrate CycGAT's localization through simulation and its efficacy on an ABCD s",
    "link": "https://arxiv.org/abs/2403.19149",
    "context": "Title: Topological Cycle Graph Attention Network for Brain Functional Connectivity\nAbstract: arXiv:2403.19149v1 Announce Type: new  Abstract: This study, we introduce a novel Topological Cycle Graph Attention Network (CycGAT), designed to delineate a functional backbone within brain functional graph--key pathways essential for signal transmissio--from non-essential, redundant connections that form cycles around this core structure. We first introduce a cycle incidence matrix that establishes an independent cycle basis within a graph, mapping its relationship with edges. We propose a cycle graph convolution that leverages a cycle adjacency matrix, derived from the cycle incidence matrix, to specifically filter edge signals in a domain of cycles. Additionally, we strengthen the representation power of the cycle graph convolution by adding an attention mechanism, which is further augmented by the introduction of edge positional encodings in cycles, to enhance the topological awareness of CycGAT. We demonstrate CycGAT's localization through simulation and its efficacy on an ABCD s",
    "path": "papers/24/03/2403.19149.json",
    "total_tokens": 882,
    "translated_title": "基于拓扑循环图注意力网络的大脑功能连接研究",
    "translated_abstract": "在这项研究中，我们介绍了一种新颖的拓扑循环图注意力网络（CycGAT），旨在描绘大脑功能图中的功能骨干——信号传输的关键路径——与无关紧要的冗余连接（围绕该核心结构形成循环）之间的区别。我们首先引入了一个循环关联矩阵，建立了图中的独立循环基础，将其与边的关系进行映射。我们提出了一个循环图卷积，利用从循环关联矩阵导出的循环邻接矩阵，以特定地过滤循环域中的边信号。此外，我们通过引入边位置编码增强循环中的拓扑意识，进一步提高了循环图卷积的表示能力。我们通过模拟证明了CycGAT的定位能力，并在ABCD数据集上展示了其有效性。",
    "tldr": "提出了一种新型的拓扑循环图注意力网络（CycGAT），通过循环关联矩阵建立独立循环基础，结合循环图卷积和注意力机制，增强了对大脑功能连接中关键路径的定位能力。",
    "en_tdlr": "Introduced a novel Topological Cycle Graph Attention Network (CycGAT) that establishes an independent cycle basis using a cycle incidence matrix, combines cycle graph convolution and attention mechanism to enhance the localization of key pathways in brain functional connectivity."
}