{
    "title": "A cascaded deep network for automated tumor detection and segmentation in clinical PET imaging of diffuse large B-cell lymphoma",
    "abstract": "arXiv:2403.07092v1 Announce Type: cross  Abstract: Accurate detection and segmentation of diffuse large B-cell lymphoma (DLBCL) from PET images has important implications for estimation of total metabolic tumor volume, radiomics analysis, surgical intervention and radiotherapy. Manual segmentation of tumors in whole-body PET images is time-consuming, labor-intensive and operator-dependent. In this work, we develop and validate a fast and efficient three-step cascaded deep learning model for automated detection and segmentation of DLBCL tumors from PET images. As compared to a single end-to-end network for segmentation of tumors in whole-body PET images, our three-step model is more effective (improves 3D Dice score from 58.9% to 78.1%) since each of its specialized modules, namely the slice classifier, the tumor detector and the tumor segmentor, can be trained independently to a high degree of skill to carry out a specific task, rather than a single network with suboptimal performance ",
    "link": "https://arxiv.org/abs/2403.07092",
    "context": "Title: A cascaded deep network for automated tumor detection and segmentation in clinical PET imaging of diffuse large B-cell lymphoma\nAbstract: arXiv:2403.07092v1 Announce Type: cross  Abstract: Accurate detection and segmentation of diffuse large B-cell lymphoma (DLBCL) from PET images has important implications for estimation of total metabolic tumor volume, radiomics analysis, surgical intervention and radiotherapy. Manual segmentation of tumors in whole-body PET images is time-consuming, labor-intensive and operator-dependent. In this work, we develop and validate a fast and efficient three-step cascaded deep learning model for automated detection and segmentation of DLBCL tumors from PET images. As compared to a single end-to-end network for segmentation of tumors in whole-body PET images, our three-step model is more effective (improves 3D Dice score from 58.9% to 78.1%) since each of its specialized modules, namely the slice classifier, the tumor detector and the tumor segmentor, can be trained independently to a high degree of skill to carry out a specific task, rather than a single network with suboptimal performance ",
    "path": "papers/24/03/2403.07092.json",
    "total_tokens": 989,
    "translated_title": "用于临床PET成像中弥漫大B细胞淋巴瘤自动肿瘤检测和分割的级联深度网络",
    "translated_abstract": "精确检测和分割弥漫性大B细胞淋巴瘤(DLBCL) PET图像在总代谢性肿瘤体积估计，放射组织学分析，手术干预和放射治疗中具有重要意义。手动分割全身PET图像中的肿瘤是耗时、劳动密集和依赖操作员的。在这项工作中，我们开发并验证了一个快速有效的三步级联深度学习模型，用于从PET图像自动检测和分割DLBCL肿瘤。与用于全身PET图像中肿瘤分割的单一端到端网络相比，我们的三步模型更为有效（将3D Dice得分从58.9%提高到78.1%），因为它的各个专门模块，即切片分类器，肿瘤检测器和肿瘤分段器，可以独立训练到高技能水平以执行特定任务，而不是一个具有次优性能的单一网络。",
    "tldr": "该研究提出了一种快速高效的三步级联深度学习模型，用于自动检测和分割DLBCL PET图像中的肿瘤，相比于单一端到端网络，其能够显著提高分割准确性（将3D Dice得分从58.9%提高到78.1%）。",
    "en_tdlr": "This study introduces a fast and efficient three-step cascaded deep learning model for automated detection and segmentation of DLBCL tumors in PET images, which significantly improves segmentation accuracy (increases 3D Dice score from 58.9% to 78.1%) compared to a single end-to-end network."
}