{
    "title": "AltGraph: Redesigning Quantum Circuits Using Generative Graph Models for Efficient Optimization",
    "abstract": "arXiv:2403.12979v1 Announce Type: cross  Abstract: Quantum circuit transformation aims to produce equivalent circuits while optimizing for various aspects such as circuit depth, gate count, and compatibility with modern Noisy Intermediate Scale Quantum (NISQ) devices. There are two techniques for circuit transformation. The first is a rule-based approach that greedily cancels out pairs of gates that equate to the identity unitary operation. Rule-based approaches are used in quantum compilers such as Qiskit, tket, and Quilc. The second is a search-based approach that tries to find an equivalent quantum circuit by exploring the quantum circuits search space. Search-based approaches typically rely on machine learning techniques such as generative models and Reinforcement Learning (RL). In this work, we propose AltGraph, a novel search-based circuit transformation approach that generates equivalent quantum circuits using existing generative graph models. We use three main graph models: DAG",
    "link": "https://arxiv.org/abs/2403.12979",
    "context": "Title: AltGraph: Redesigning Quantum Circuits Using Generative Graph Models for Efficient Optimization\nAbstract: arXiv:2403.12979v1 Announce Type: cross  Abstract: Quantum circuit transformation aims to produce equivalent circuits while optimizing for various aspects such as circuit depth, gate count, and compatibility with modern Noisy Intermediate Scale Quantum (NISQ) devices. There are two techniques for circuit transformation. The first is a rule-based approach that greedily cancels out pairs of gates that equate to the identity unitary operation. Rule-based approaches are used in quantum compilers such as Qiskit, tket, and Quilc. The second is a search-based approach that tries to find an equivalent quantum circuit by exploring the quantum circuits search space. Search-based approaches typically rely on machine learning techniques such as generative models and Reinforcement Learning (RL). In this work, we propose AltGraph, a novel search-based circuit transformation approach that generates equivalent quantum circuits using existing generative graph models. We use three main graph models: DAG",
    "path": "papers/24/03/2403.12979.json",
    "total_tokens": 700,
    "translated_title": "AltGraph：利用生成图模型重新设计量子电路以进行高效优化",
    "translated_abstract": "量子电路转换旨在生成等效电路的同时优化各方面，如电路深度、门数量以及与现代嘈杂中间尺度量子（NISQ）设备的兼容性。本文提出了AltGraph，一种新颖的基于搜索的电路转换方法，利用现有的生成图模型生成等效的量子电路。我们使用了三个主要的图模型：DAG（有向无环图）、AND-OR图和蛋白质结构图，以在保持等效性的同时对电路进行优化。",
    "tldr": "该论文提出了AltGraph这一基于搜索的电路转换方法，利用生成图模型生成等效的量子电路，以在保持等效性的同时优化电路。",
    "en_tdlr": "This paper introduces AltGraph, a search-based circuit transformation approach that generates equivalent quantum circuits using generative graph models for optimizing circuits while maintaining equivalence."
}