{
    "title": "Design of an Open-Source Architecture for Neural Machine Translation",
    "abstract": "arXiv:2403.03582v1 Announce Type: cross  Abstract: adaptNMT is an open-source application that offers a streamlined approach to the development and deployment of Recurrent Neural Networks and Transformer models. This application is built upon the widely-adopted OpenNMT ecosystem, and is particularly useful for new entrants to the field, as it simplifies the setup of the development environment and creation of train, validation, and test splits. The application offers a graphing feature that illustrates the progress of model training, and employs SentencePiece for creating subword segmentation models. Furthermore, the application provides an intuitive user interface that facilitates hyperparameter customization. Notably, a single-click model development approach has been implemented, and models developed by adaptNMT can be evaluated using a range of metrics. To encourage eco-friendly research, adaptNMT incorporates a green report that flags the power consumption and kgCO${_2}$ emissions",
    "link": "https://arxiv.org/abs/2403.03582",
    "context": "Title: Design of an Open-Source Architecture for Neural Machine Translation\nAbstract: arXiv:2403.03582v1 Announce Type: cross  Abstract: adaptNMT is an open-source application that offers a streamlined approach to the development and deployment of Recurrent Neural Networks and Transformer models. This application is built upon the widely-adopted OpenNMT ecosystem, and is particularly useful for new entrants to the field, as it simplifies the setup of the development environment and creation of train, validation, and test splits. The application offers a graphing feature that illustrates the progress of model training, and employs SentencePiece for creating subword segmentation models. Furthermore, the application provides an intuitive user interface that facilitates hyperparameter customization. Notably, a single-click model development approach has been implemented, and models developed by adaptNMT can be evaluated using a range of metrics. To encourage eco-friendly research, adaptNMT incorporates a green report that flags the power consumption and kgCO${_2}$ emissions",
    "path": "papers/24/03/2403.03582.json",
    "total_tokens": 849,
    "translated_title": "为神经机器翻译设计的开源架构",
    "translated_abstract": "arXiv:2403.03582v1 公告类型: 跨领域 adaptNMT 是一个开源应用程序，提供了一种简化的方法来开发和部署循环神经网络和Transformer模型。该应用程序构建在广泛采用的OpenNMT生态系统之上，特别适用于该领域的新进入者，因为它简化了开发环境的设置以及训练、验证和测试数据集的创建。该应用程序提供了一个图形化功能，用于展示模型训练的进展，并采用SentencePiece来创建子词分割模型。此外，该应用程序提供了一个直观的用户界面，简化了超参数的定制。值得注意的是，该应用实现了一键式模型开发方法，通过adaptNMT开发的模型可以使用各种指标进行评估。为了鼓励环保研究，adaptNMT集成了一个环保报告，标志着能源消耗和二氧化碳排放量。",
    "tldr": "该开源应用程序 adaptNMT 简化了神经机器翻译模型的开发和部署，提供了图形化训练进展展示、子词分割模型和一键式模型开发方法。"
}