{
    "title": "Optimizing Retinal Prosthetic Stimuli with Conditional Invertible Neural Networks",
    "abstract": "arXiv:2403.04884v1 Announce Type: cross  Abstract: Implantable retinal prostheses offer a promising solution to restore partial vision by circumventing damaged photoreceptor cells in the retina and directly stimulating the remaining functional retinal cells. However, the information transmission between the camera and retinal cells is often limited by the low resolution of the electrode array and the lack of specificity for different ganglion cell types, resulting in suboptimal stimulations. In this work, we propose to utilize normalizing flow-based conditional invertible neural networks to optimize retinal implant stimulation in an unsupervised manner. The invertibility of these networks allows us to use them as a surrogate for the computational model of the visual system, while also encoding input camera signals into optimized electrical stimuli on the electrode array. Compared to other methods, such as trivial downsampling, linear models, and feed-forward convolutional neural networ",
    "link": "https://arxiv.org/abs/2403.04884",
    "context": "Title: Optimizing Retinal Prosthetic Stimuli with Conditional Invertible Neural Networks\nAbstract: arXiv:2403.04884v1 Announce Type: cross  Abstract: Implantable retinal prostheses offer a promising solution to restore partial vision by circumventing damaged photoreceptor cells in the retina and directly stimulating the remaining functional retinal cells. However, the information transmission between the camera and retinal cells is often limited by the low resolution of the electrode array and the lack of specificity for different ganglion cell types, resulting in suboptimal stimulations. In this work, we propose to utilize normalizing flow-based conditional invertible neural networks to optimize retinal implant stimulation in an unsupervised manner. The invertibility of these networks allows us to use them as a surrogate for the computational model of the visual system, while also encoding input camera signals into optimized electrical stimuli on the electrode array. Compared to other methods, such as trivial downsampling, linear models, and feed-forward convolutional neural networ",
    "path": "papers/24/03/2403.04884.json",
    "total_tokens": 842,
    "translated_title": "使用有条件可逆神经网络优化视网膜假体刺激",
    "translated_abstract": "可植入的视网膜假体为通过绕过视网膜中损坏的光感受细胞并直接刺激剩余功能性视网膜细胞来恢复部分视力提供了一个有希望的解决方案。然而，摄像头和视网膜细胞之间的信息传输通常受限于电极阵列的低分辨率和对不同节细胞类型的特异性不足，导致刺激效果不佳。在这项工作中，我们提出利用基于归一化流的有条件可逆神经网络以无监督的方式优化视网膜假体刺激。这些网络的可逆性使我们能够将它们用作视觉系统的计算模型的替代，并将输入摄像头信号编码为电极阵列上优化的电刺激。与其他方法相比，如简单的降采样、线性模型和前馈卷积神经网络",
    "tldr": "利用有条件可逆神经网络无监督优化视网膜假体刺激，提高了电极阵列的刺激效果。",
    "en_tdlr": "Unsupervised optimization of retinal implant stimulation using conditional invertible neural networks improves the efficacy of electrode array stimulation."
}