{
    "title": "Towards a Framework for Deep Learning Certification in Safety-Critical Applications Using Inherently Safe Design and Run-Time Error Detection",
    "abstract": "arXiv:2403.14678v1 Announce Type: new  Abstract: Although an ever-growing number of applications employ deep learning based systems for prediction, decision-making, or state estimation, almost no certification processes have been established that would allow such systems to be deployed in safety-critical applications. In this work we consider real-world problems arising in aviation and other safety-critical areas, and investigate their requirements for a certified model. To this end, we investigate methodologies from the machine learning research community aimed towards verifying robustness and reliability of deep learning systems, and evaluate these methodologies with regard to their applicability to real-world problems. Then, we establish a new framework towards deep learning certification based on (i) inherently safe design, and (ii) run-time error detection. Using a concrete use case from aviation, we show how deep learning models can recover disentangled variables through the use ",
    "link": "https://arxiv.org/abs/2403.14678",
    "context": "Title: Towards a Framework for Deep Learning Certification in Safety-Critical Applications Using Inherently Safe Design and Run-Time Error Detection\nAbstract: arXiv:2403.14678v1 Announce Type: new  Abstract: Although an ever-growing number of applications employ deep learning based systems for prediction, decision-making, or state estimation, almost no certification processes have been established that would allow such systems to be deployed in safety-critical applications. In this work we consider real-world problems arising in aviation and other safety-critical areas, and investigate their requirements for a certified model. To this end, we investigate methodologies from the machine learning research community aimed towards verifying robustness and reliability of deep learning systems, and evaluate these methodologies with regard to their applicability to real-world problems. Then, we establish a new framework towards deep learning certification based on (i) inherently safe design, and (ii) run-time error detection. Using a concrete use case from aviation, we show how deep learning models can recover disentangled variables through the use ",
    "path": "papers/24/03/2403.14678.json",
    "total_tokens": 830,
    "translated_title": "面向安全关键应用的深度学习认证框架：采用固有安全设计和运行时错误检测",
    "translated_abstract": "尽管越来越多的应用程序采用基于深度学习的系统进行预测、决策或状态估计，几乎没有建立证书流程，使得这样的系统能够应用于安全关键应用。本研究考虑了在航空和其他安全关键领域中出现的现实世界问题，并研究了认证模型的需求。为此，我们调查了机器学习研究社区针对验证深度学习系统稳健性和可靠性的方法，并评估了这些方法对现实世界问题的适用性。然后，我们建立了一个基于（i）固有安全设计和（ii）运行时错误检测的深度学习认证新框架。通过使用航空案例，我们展示了深度学习模型如何通过使用恢复解耦变量。",
    "tldr": "本研究构建了面向安全关键应用的深度学习认证框架，结合固有安全设计和运行时错误检测，以应对现实世界问题。",
    "en_tdlr": "This study establishes a framework for deep learning certification in safety-critical applications, incorporating inherently safe design and run-time error detection to address real-world problems."
}