{
    "title": "Document Author Classification Using Parsed Language Structure",
    "abstract": "arXiv:2403.13253v1 Announce Type: new  Abstract: Over the years there has been ongoing interest in detecting authorship of a text based on statistical properties of the text, such as by using occurrence rates of noncontextual words. In previous work, these techniques have been used, for example, to determine authorship of all of \\emph{The Federalist Papers}. Such methods may be useful in more modern times to detect fake or AI authorship. Progress in statistical natural language parsers introduces the possibility of using grammatical structure to detect authorship. In this paper we explore a new possibility for detecting authorship using grammatical structural information extracted using a statistical natural language parser. This paper provides a proof of concept, testing author classification based on grammatical structure on a set of \"proof texts,\" The Federalist Papers and Sanditon which have been as test cases in previous authorship detection studies. Several features extracted fro",
    "link": "https://arxiv.org/abs/2403.13253",
    "context": "Title: Document Author Classification Using Parsed Language Structure\nAbstract: arXiv:2403.13253v1 Announce Type: new  Abstract: Over the years there has been ongoing interest in detecting authorship of a text based on statistical properties of the text, such as by using occurrence rates of noncontextual words. In previous work, these techniques have been used, for example, to determine authorship of all of \\emph{The Federalist Papers}. Such methods may be useful in more modern times to detect fake or AI authorship. Progress in statistical natural language parsers introduces the possibility of using grammatical structure to detect authorship. In this paper we explore a new possibility for detecting authorship using grammatical structural information extracted using a statistical natural language parser. This paper provides a proof of concept, testing author classification based on grammatical structure on a set of \"proof texts,\" The Federalist Papers and Sanditon which have been as test cases in previous authorship detection studies. Several features extracted fro",
    "path": "papers/24/03/2403.13253.json",
    "total_tokens": 797,
    "translated_title": "使用解析语言结构进行文档作者分类",
    "translated_abstract": "多年来，人们一直对基于文本的统计属性来检测作者身份感兴趣，例如使用非情境词的出现率。在先前的研究中，这些技术已经被使用，例如确定《联邦党人文集》中所有文章的作者。这些方法在现代可能有助于检测伪造的或由AI创作的文章。统计自然语言解析器的进展引入了使用语法结构来检测作者身份的可能性。本文探讨了使用统计自然语言解析器提取的语法结构信息进行作者分类的新可能性。本文提供了一个概念验证，测试了基于语法结构的作者分类方法在一组“校样文本”上的效果，《联邦党人文集》和《桑迪顿》曾作为先前作者检测研究的测试案例。从中提取了几个特征。",
    "tldr": "本文研究了使用解析语言结构来检测文档作者身份的新方法，通过统计自然语言解析器提取的语法结构信息进行了实证验证。",
    "en_tdlr": "This paper explores a new approach for detecting document authorship using parsed language structure and provides empirical validation based on grammatical structural information extracted by a statistical natural language parser."
}