{
    "title": "Model, Analyze, and Comprehend User Interactions and Various Attributes within a Social Media Platform",
    "abstract": "arXiv:2403.15937v1 Announce Type: cross  Abstract: How can we effectively model, analyze, and comprehend user interactions and various attributes within a social media platform based on post-comment relationship? In this study, we propose a novel graph-based approach to model and analyze user interactions within a social media platform based on post-comment relationship. We construct a user interaction graph from social media data and analyze it to gain insights into community dynamics, user behavior, and content preferences. Our investigation reveals that while 56.05% of the active users are strongly connected within the community, only 0.8% of them significantly contribute to its dynamics. Moreover, we observe temporal variations in community activity, with certain periods experiencing heightened engagement. Additionally, our findings highlight a correlation between user activity and popularity showing that more active users are generally more popular. Alongside these, a preference f",
    "link": "https://arxiv.org/abs/2403.15937",
    "context": "Title: Model, Analyze, and Comprehend User Interactions and Various Attributes within a Social Media Platform\nAbstract: arXiv:2403.15937v1 Announce Type: cross  Abstract: How can we effectively model, analyze, and comprehend user interactions and various attributes within a social media platform based on post-comment relationship? In this study, we propose a novel graph-based approach to model and analyze user interactions within a social media platform based on post-comment relationship. We construct a user interaction graph from social media data and analyze it to gain insights into community dynamics, user behavior, and content preferences. Our investigation reveals that while 56.05% of the active users are strongly connected within the community, only 0.8% of them significantly contribute to its dynamics. Moreover, we observe temporal variations in community activity, with certain periods experiencing heightened engagement. Additionally, our findings highlight a correlation between user activity and popularity showing that more active users are generally more popular. Alongside these, a preference f",
    "path": "papers/24/03/2403.15937.json",
    "total_tokens": 810,
    "translated_title": "模型、分析和理解社交媒体平台内用户互动和各种属性",
    "translated_abstract": "本研究提出了一种基于帖子-评论关系的新颖基于图的方法，用于模型化和分析社交媒体平台内用户互动，构建用户互动图并分析以深入了解社区动态、用户行为和内容偏好。研究发现，社区内56.05%的活跃用户强连接在一起，但只有0.8%的用户对其动态有显著贡献。此外，我们观察到社区活动存在时间变化，某些时期经历了更高的参与度。此外，我们的发现强调了用户活动与受欢迎程度之间的相关性，表明更活跃的用户通常更受欢迎。",
    "tldr": "本研究提出了一种新颖的基于图的方法，用于模型化和分析社交媒体平台内用户互动，揭示了活跃用户之间的连接模式、对社区动态的贡献率以及用户活动与受欢迎程度之间的相关性。",
    "en_tdlr": "This study proposes a novel graph-based approach to model and analyze user interactions within a social media platform, revealing the connection patterns among active users, the contribution to community dynamics, and the correlation between user activity and popularity."
}