{
    "title": "Temporal Cross-Attention for Dynamic Embedding and Tokenization of Multimodal Electronic Health Records",
    "abstract": "arXiv:2403.04012v1 Announce Type: new  Abstract: The breadth, scale, and temporal granularity of modern electronic health records (EHR) systems offers great potential for estimating personalized and contextual patient health trajectories using sequential deep learning. However, learning useful representations of EHR data is challenging due to its high dimensionality, sparsity, multimodality, irregular and variable-specific recording frequency, and timestamp duplication when multiple measurements are recorded simultaneously. Although recent efforts to fuse structured EHR and unstructured clinical notes suggest the potential for more accurate prediction of clinical outcomes, less focus has been placed on EHR embedding approaches that directly address temporal EHR challenges by learning time-aware representations from multimodal patient time series. In this paper, we introduce a dynamic embedding and tokenization framework for precise representation of multimodal clinical time series that",
    "link": "https://arxiv.org/abs/2403.04012",
    "context": "Title: Temporal Cross-Attention for Dynamic Embedding and Tokenization of Multimodal Electronic Health Records\nAbstract: arXiv:2403.04012v1 Announce Type: new  Abstract: The breadth, scale, and temporal granularity of modern electronic health records (EHR) systems offers great potential for estimating personalized and contextual patient health trajectories using sequential deep learning. However, learning useful representations of EHR data is challenging due to its high dimensionality, sparsity, multimodality, irregular and variable-specific recording frequency, and timestamp duplication when multiple measurements are recorded simultaneously. Although recent efforts to fuse structured EHR and unstructured clinical notes suggest the potential for more accurate prediction of clinical outcomes, less focus has been placed on EHR embedding approaches that directly address temporal EHR challenges by learning time-aware representations from multimodal patient time series. In this paper, we introduce a dynamic embedding and tokenization framework for precise representation of multimodal clinical time series that",
    "path": "papers/24/03/2403.04012.json",
    "total_tokens": 796,
    "translated_title": "用于多模态电子健康记录动态嵌入和标记的时间交叉注意力",
    "translated_abstract": "现代电子健康记录（EHR）系统的广度、规模和时间粒度为使用顺序深度学习估计个性化和背景患者健康轨迹提供了巨大潜力。然而，由于其高维度、稀疏性、多模态性、不规则和变量特定的记录频率以及在同时记录多个测量时戳重复，学习有用的EHR数据表示具有挑战性。尽管最近的努力将结构化EHR和非结构化临床笔记融合，表明了更准确预测临床结果的潜力，但对直接解决时间EHR挑战的EHR嵌入方法的关注较少——即通过学习来自多模态患者时间序列的具有时间感知的表示。在本文中，我们介绍了一个用于精确表示多模态临床时间序列的动态嵌入和标记框架",
    "tldr": "提出了一种用于精确表示多模态临床时间序列的动态嵌入和标记框架",
    "en_tdlr": "Proposed a dynamic embedding and tokenization framework for precise representation of multimodal clinical time series."
}