{
    "title": "Search-based Optimisation of LLM Learning Shots for Story Point Estimation",
    "abstract": "arXiv:2403.08430v1 Announce Type: cross  Abstract: One of the ways Large Language Models (LLMs) are used to perform machine learning tasks is to provide them with a few examples before asking them to produce a prediction. This is a meta-learning process known as few-shot learning. In this paper, we use available Search-Based methods to optimise the number and combination of examples that can improve an LLM's estimation performance, when it is used to estimate story points for new agile tasks. Our preliminary results show that our SBSE technique improves the estimation performance of the LLM by 59.34% on average (in terms of mean absolute error of the estimation) over three datasets against a zero-shot setting.",
    "link": "https://arxiv.org/abs/2403.08430",
    "context": "Title: Search-based Optimisation of LLM Learning Shots for Story Point Estimation\nAbstract: arXiv:2403.08430v1 Announce Type: cross  Abstract: One of the ways Large Language Models (LLMs) are used to perform machine learning tasks is to provide them with a few examples before asking them to produce a prediction. This is a meta-learning process known as few-shot learning. In this paper, we use available Search-Based methods to optimise the number and combination of examples that can improve an LLM's estimation performance, when it is used to estimate story points for new agile tasks. Our preliminary results show that our SBSE technique improves the estimation performance of the LLM by 59.34% on average (in terms of mean absolute error of the estimation) over three datasets against a zero-shot setting.",
    "path": "papers/24/03/2403.08430.json",
    "total_tokens": 683,
    "translated_title": "基于搜索的对LLM学习样本进行优化以进行故事点估计",
    "translated_abstract": "大型语言模型（LLMs）用于执行机器学习任务的一种方式是在要求它们进行预测之前提供一些示例。这是一种称为少样本学习的元学习过程。本文使用可用的基于搜索的方法来优化数量和组合示例，可以提高LLM在用于估计新的敏捷任务的故事点时的估计性能。我们的初步结果显示，我们的SBSE技术在三个数据集上平均提高了59.34%的LLM估计性能（以估计的平均绝对误差为指标），相对于零样本设置。",
    "tldr": "使用搜索方法优化LLM在故事点估计中的表现，使其平均估计性能提高了59.34%。"
}