{
    "title": "Distributional Treatment Effect with Finite Mixture",
    "abstract": "arXiv:2403.18503v1 Announce Type: new  Abstract: Treatment effect heterogeneity is of a great concern when evaluating the treatment. However, even with a simple case of a binary treatment, the distribution of treatment effect is difficult to identify due to the fundamental limitation that we cannot observe both treated potential outcome and untreated potential outcome for a given individual. This paper assumes a finite mixture model on the potential outcomes and a vector of control covariates to address treatment endogeneity and imposes a Markov condition on the potential outcomes and covariates within each type to identify the treatment effect distribution. The mixture weights of the finite mixture model are consistently estimated with a nonnegative matrix factorization algorithm, thus allowing us to consistently estimate the component distribution parameters, including ones for the treatment effect distribution.",
    "link": "https://arxiv.org/abs/2403.18503",
    "context": "Title: Distributional Treatment Effect with Finite Mixture\nAbstract: arXiv:2403.18503v1 Announce Type: new  Abstract: Treatment effect heterogeneity is of a great concern when evaluating the treatment. However, even with a simple case of a binary treatment, the distribution of treatment effect is difficult to identify due to the fundamental limitation that we cannot observe both treated potential outcome and untreated potential outcome for a given individual. This paper assumes a finite mixture model on the potential outcomes and a vector of control covariates to address treatment endogeneity and imposes a Markov condition on the potential outcomes and covariates within each type to identify the treatment effect distribution. The mixture weights of the finite mixture model are consistently estimated with a nonnegative matrix factorization algorithm, thus allowing us to consistently estimate the component distribution parameters, including ones for the treatment effect distribution.",
    "path": "papers/24/03/2403.18503.json",
    "total_tokens": 705,
    "translated_title": "具有有限混合的分布式处理效应",
    "translated_abstract": "处理效应的异质性在评估治疗时非常重要。然而，即使在二元处理的简单情况下，由于我们无法观察到给定个体的已处理潜在结果和未处理潜在结果的基本限制，处理效应的分布也很难确定。本文在潜在结果上假设了一个有限混合模型和一个控制协变量向量，以解决处理内生性，并对每种类型的潜在结果和协变量施加了马尔可夫条件，以确定处理效应分布。有限混合模型的混合权重通过非负矩阵分解算法一致估计，从而使我们能够一致地估计组件分布参数，包括处理效应分布的参数。",
    "tldr": "本文提出了使用有限混合模型和控制协变量来处理处理效应分布的方法。",
    "en_tdlr": "This paper presents a method for handling the distribution of treatment effects using a finite mixture model and control covariates."
}