{
    "title": "Speeding up 6-DoF Grasp Sampling with Quality-Diversity",
    "abstract": "arXiv:2403.06173v1 Announce Type: cross  Abstract: Recent advances in AI have led to significant results in robotic learning, including natural language-conditioned planning and efficient optimization of controllers using generative models. However, the interaction data remains the bottleneck for generalization. Getting data for grasping is a critical challenge, as this skill is required to complete many manipulation tasks. Quality-Diversity (QD) algorithms optimize a set of solutions to get diverse, high-performing solutions to a given problem. This paper investigates how QD can be combined with priors to speed up the generation of diverse grasps poses in simulation compared to standard 6-DoF grasp sampling schemes. Experiments conducted on 4 grippers with 2-to-5 fingers on standard objects show that QD outperforms commonly used methods by a large margin. Further experiments show that QD optimization automatically finds some efficient priors that are usually hard coded. The deployment",
    "link": "https://arxiv.org/abs/2403.06173",
    "context": "Title: Speeding up 6-DoF Grasp Sampling with Quality-Diversity\nAbstract: arXiv:2403.06173v1 Announce Type: cross  Abstract: Recent advances in AI have led to significant results in robotic learning, including natural language-conditioned planning and efficient optimization of controllers using generative models. However, the interaction data remains the bottleneck for generalization. Getting data for grasping is a critical challenge, as this skill is required to complete many manipulation tasks. Quality-Diversity (QD) algorithms optimize a set of solutions to get diverse, high-performing solutions to a given problem. This paper investigates how QD can be combined with priors to speed up the generation of diverse grasps poses in simulation compared to standard 6-DoF grasp sampling schemes. Experiments conducted on 4 grippers with 2-to-5 fingers on standard objects show that QD outperforms commonly used methods by a large margin. Further experiments show that QD optimization automatically finds some efficient priors that are usually hard coded. The deployment",
    "path": "papers/24/03/2403.06173.json",
    "total_tokens": 905,
    "translated_title": "用质量多样性加速六自由度抓取采样",
    "translated_abstract": "最近人工智能的进步在机器人学习领域取得了显著成果，包括自然语言条件规划和利用生成模型高效优化控制器。然而，交互数据仍然是泛化的瓶颈。获取抓取数据是一个关键挑战，因为这项技能对完成许多操纵任务至关重要。质量多样性（QD）算法优化一组解以获得在给定问题上多样化、高性能的解决方案。本文研究了如何将QD与先验知识结合起来，以加速仿真中多样化抓取姿势的生成，相对于标准的六自由度抓取采样方案。在标准对象上对四个带有2至5个手指的夹爪进行的实验表明，QD的表现远远超过常用方法。进一步的实验表明，QD优化自动发现了一些通常难以编码的高效先验知识。",
    "tldr": "该论文研究了如何将质量多样性（QD）与先验知识结合，以加速在仿真中生成多样化抓取姿势，实验证明QD相比于标准的六自由度抓取采样方案有着显著的优势。",
    "en_tdlr": "This paper investigates how to combine Quality-Diversity (QD) with priors to speed up the generation of diverse grasp poses in simulation, and the experiments show that QD outperforms standard 6-DoF grasp sampling schemes significantly."
}