{
    "title": "Synthetic Medical Imaging Generation with Generative Adversarial Networks For Plain Radiographs",
    "abstract": "arXiv:2403.19107v1 Announce Type: cross  Abstract: In medical imaging, access to data is commonly limited due to patient privacy restrictions and the issue that it can be difficult to acquire enough data in the case of rare diseases.[1] The purpose of this investigation was to develop a reusable open-source synthetic image generation pipeline, the GAN Image Synthesis Tool (GIST), that is easy to use as well as easy to deploy. The pipeline helps to improve and standardize AI algorithms in the digital health space by generating high quality synthetic image data that is not linked to specific patients. Its image generation capabilities include the ability to generate imaging of pathologies or injuries with low incidence rates. This improvement of digital health AI algorithms could improve diagnostic accuracy, aid in patient care, decrease medicolegal claims, and ultimately decrease the overall cost of healthcare. The pipeline builds on existing Generative Adversarial Networks (GANs) algor",
    "link": "https://arxiv.org/abs/2403.19107",
    "context": "Title: Synthetic Medical Imaging Generation with Generative Adversarial Networks For Plain Radiographs\nAbstract: arXiv:2403.19107v1 Announce Type: cross  Abstract: In medical imaging, access to data is commonly limited due to patient privacy restrictions and the issue that it can be difficult to acquire enough data in the case of rare diseases.[1] The purpose of this investigation was to develop a reusable open-source synthetic image generation pipeline, the GAN Image Synthesis Tool (GIST), that is easy to use as well as easy to deploy. The pipeline helps to improve and standardize AI algorithms in the digital health space by generating high quality synthetic image data that is not linked to specific patients. Its image generation capabilities include the ability to generate imaging of pathologies or injuries with low incidence rates. This improvement of digital health AI algorithms could improve diagnostic accuracy, aid in patient care, decrease medicolegal claims, and ultimately decrease the overall cost of healthcare. The pipeline builds on existing Generative Adversarial Networks (GANs) algor",
    "path": "papers/24/03/2403.19107.json",
    "total_tokens": 900,
    "translated_title": "使用生成对抗网络生成用于普通X射线的合成医学图像",
    "translated_abstract": "在医学影像学中，由于患者隐私限制以及在罕见疾病情况下获取足够数据可能会困难，通常会限制对数据的访问。该研究的目的是开发一种可重复使用的开源合成图像生成工具（GAN Image Synthesis Tool，GIST），易于使用且易于部署。该工具通过生成高质量的与特定患者无关的合成图像数据，有助于改进和标准化数字健康领域的人工智能算法。其图像生成能力包括能够生成发病率较低的病变或受伤的影像。改善数字健康人工智能算法可以提高诊断准确性，帮助患者护理，减少医疗纠纷索赔，并最终降低整体医疗保健成本。该工具在现有的生成对抗网络（GANs）算法基础上构建。",
    "tldr": "开发了一种开源合成图像生成工具（GIST），利用生成对抗网络生成高质量合成图像数据，改进了数字健康AI算法，有助于提高诊断准确性、患者护理，并减少医疗纠纷索赔。",
    "en_tdlr": "Developed an open-source synthetic image generation tool (GIST) that utilizes Generative Adversarial Networks to generate high-quality synthetic image data, improving digital health AI algorithms to enhance diagnostic accuracy, patient care, and reduce medicolegal claims."
}