{
    "title": "Disambiguate Entity Matching through Relation Discovery with Large Language Models",
    "abstract": "arXiv:2403.17344v1 Announce Type: cross  Abstract: Entity matching is a critical challenge in data integration and cleaning, central to tasks like fuzzy joins and deduplication. Traditional approaches have focused on overcoming fuzzy term representations through methods such as edit distance, Jaccard similarity, and more recently, embeddings and deep neural networks, including advancements from large language models (LLMs) like GPT. However, the core challenge in entity matching extends beyond term fuzziness to the ambiguity in defining what constitutes a \"match,\" especially when integrating with external databases. This ambiguity arises due to varying levels of detail and granularity among entities, complicating exact matches. We propose a novel approach that shifts focus from purely identifying semantic similarities to understanding and defining the \"relations\" between entities as crucial for resolving ambiguities in matching. By predefining a set of relations relevant to the task at",
    "link": "https://arxiv.org/abs/2403.17344",
    "context": "Title: Disambiguate Entity Matching through Relation Discovery with Large Language Models\nAbstract: arXiv:2403.17344v1 Announce Type: cross  Abstract: Entity matching is a critical challenge in data integration and cleaning, central to tasks like fuzzy joins and deduplication. Traditional approaches have focused on overcoming fuzzy term representations through methods such as edit distance, Jaccard similarity, and more recently, embeddings and deep neural networks, including advancements from large language models (LLMs) like GPT. However, the core challenge in entity matching extends beyond term fuzziness to the ambiguity in defining what constitutes a \"match,\" especially when integrating with external databases. This ambiguity arises due to varying levels of detail and granularity among entities, complicating exact matches. We propose a novel approach that shifts focus from purely identifying semantic similarities to understanding and defining the \"relations\" between entities as crucial for resolving ambiguities in matching. By predefining a set of relations relevant to the task at",
    "path": "papers/24/03/2403.17344.json",
    "total_tokens": 797,
    "translated_title": "通过大型语言模型进行关系发现的实体匹配消歧",
    "translated_abstract": "实体匹配是数据集成和清洗中的一个关键挑战，对于模糊连接和数据重复消除等任务至关重要。传统方法集中在克服模糊术语表示，例如编辑距离、Jaccard相似性，以及最近的嵌入和深度神经网络，包括来自大型语言模型（LLMs）如GPT的进展。然而，实体匹配中的核心挑战超越了术语模糊性，而是在定义何为“匹配”时的歧义，特别是在与外部数据库集成时。这种歧义是由于实体之间在细节和粒度方面存在差异引起的，这使得确切匹配变得复杂。我们提出了一种新方法，将焦点从纯粹识别语义相似性转变为理解和定义实体之间的“关系”作为解决匹配中的歧义至关重要。通过预定义一组与任务相关的关系，可帮助解决匹配中的歧义。",
    "tldr": "通过定义实体之间的关系，解决实体匹配中的歧义问题",
    "en_tdlr": "Resolving ambiguity in entity matching by defining relationships between entities."
}