{
    "title": "Intent-aware Recommendation via Disentangled Graph Contrastive Learning",
    "abstract": "arXiv:2403.03714v1 Announce Type: new  Abstract: Graph neural network (GNN) based recommender systems have become one of the mainstream trends due to the powerful learning ability from user behavior data. Understanding the user intents from behavior data is the key to recommender systems, which poses two basic requirements for GNN-based recommender systems. One is how to learn complex and diverse intents especially when the user behavior is usually inadequate in reality. The other is different behaviors have different intent distributions, so how to establish their relations for a more explainable recommender system. In this paper, we present the Intent-aware Recommendation via Disentangled Graph Contrastive Learning (IDCL), which simultaneously learns interpretable intents and behavior distributions over those intents. Specifically, we first model the user behavior data as a user-item-concept graph, and design a GNN based behavior disentangling module to learn the different intents. T",
    "link": "https://arxiv.org/abs/2403.03714",
    "context": "Title: Intent-aware Recommendation via Disentangled Graph Contrastive Learning\nAbstract: arXiv:2403.03714v1 Announce Type: new  Abstract: Graph neural network (GNN) based recommender systems have become one of the mainstream trends due to the powerful learning ability from user behavior data. Understanding the user intents from behavior data is the key to recommender systems, which poses two basic requirements for GNN-based recommender systems. One is how to learn complex and diverse intents especially when the user behavior is usually inadequate in reality. The other is different behaviors have different intent distributions, so how to establish their relations for a more explainable recommender system. In this paper, we present the Intent-aware Recommendation via Disentangled Graph Contrastive Learning (IDCL), which simultaneously learns interpretable intents and behavior distributions over those intents. Specifically, we first model the user behavior data as a user-item-concept graph, and design a GNN based behavior disentangling module to learn the different intents. T",
    "path": "papers/24/03/2403.03714.json",
    "total_tokens": 840,
    "translated_title": "通过解缠结图对比学习实现意图感知推荐",
    "translated_abstract": "基于图神经网络（GNN）的推荐系统已经成为主流趋势之一，这是因为它能够从用户行为数据中强大地学习。从行为数据中理解用户意图是推荐系统的关键，这为基于GNN的推荐系统提出了两个基本要求。一个是在现实中用户行为通常是不足的情况下如何学习复杂而多样的意图。另一个是不同的行为具有不同的意图分布，因此如何建立它们之间的关系，以实现更有解释力的推荐系统。本文提出了一种通过解缠结图对比学习实现意图感知推荐（Intent-aware Recommendation via Disentangled Graph Contrastive Learning，IDCL），同时学习可解释的意图以及这些意图上的行为分布。具体而言，我们首先将用户行为数据建模为用户-物品-概念图，并设计了一个基于GNN的行为解缠结模块来学习不同的意图。",
    "tldr": "本文提出了一种通过解缠结图对比学习实现意图感知推荐的方法，可以同时学习可解释的意图以及这些意图上的行为分布",
    "en_tdlr": "This paper proposes a method for intent-aware recommendation via disentangled graph contrastive learning, which can simultaneously learn interpretable intents and behavior distributions over those intents."
}