{
    "title": "Predictive Clustering of Vessel Behavior Based on Hierarchical Trajectory Representation",
    "abstract": "arXiv:2403.08838v1 Announce Type: cross  Abstract: Vessel trajectory clustering, which aims to find similar trajectory patterns, has been widely leveraged in overwater applications. Most traditional methods use predefined rules and thresholds to identify discrete vessel behaviors. They aim for high-quality clustering and conduct clustering on entire sequences, whether the original trajectory or its sub-trajectories, failing to represent their evolution. To resolve this problem, we propose a Predictive Clustering of Hierarchical Vessel Behavior (PC-HiV). PC-HiV first uses hierarchical representations to transform every trajectory into a behavioral sequence. Then, it predicts evolution at each timestamp of the sequence based on the representations. By applying predictive clustering and latent encoding, PC-HiV improves clustering and predictions simultaneously. Experiments on real AIS datasets demonstrate PC-HiV's superiority over existing methods, showcasing its effectiveness in capturin",
    "link": "https://arxiv.org/abs/2403.08838",
    "context": "Title: Predictive Clustering of Vessel Behavior Based on Hierarchical Trajectory Representation\nAbstract: arXiv:2403.08838v1 Announce Type: cross  Abstract: Vessel trajectory clustering, which aims to find similar trajectory patterns, has been widely leveraged in overwater applications. Most traditional methods use predefined rules and thresholds to identify discrete vessel behaviors. They aim for high-quality clustering and conduct clustering on entire sequences, whether the original trajectory or its sub-trajectories, failing to represent their evolution. To resolve this problem, we propose a Predictive Clustering of Hierarchical Vessel Behavior (PC-HiV). PC-HiV first uses hierarchical representations to transform every trajectory into a behavioral sequence. Then, it predicts evolution at each timestamp of the sequence based on the representations. By applying predictive clustering and latent encoding, PC-HiV improves clustering and predictions simultaneously. Experiments on real AIS datasets demonstrate PC-HiV's superiority over existing methods, showcasing its effectiveness in capturin",
    "path": "papers/24/03/2403.08838.json",
    "total_tokens": 831,
    "translated_title": "基于分层轨迹表示的船舶行为预测聚类",
    "translated_abstract": "船舶轨迹聚类旨在寻找相似的轨迹模式，在海上应用中被广泛应用。大多数传统方法使用预定义的规则和阈值来识别离散的船舶行为，但存在无法表示演变过程的问题。为解决这一问题，本文提出了一种基于分层船舶行为预测聚类（PC-HiV）的方法。PC-HiV首先使用分层表示将每条轨迹转换为行为序列，然后基于这些表示在每个时间戳预测演化。通过应用预测聚类和潜在编码，PC-HiV可以同时改善聚类和预测。在真实AIS数据集上的实验证明了PC-HiV相对于现有方法的优越性，展示了其在捕捉船舶行为模式方面的有效性。",
    "tldr": "提出了一种基于分层轨迹表示的船舶行为预测聚类方法，通过使用预测聚类和潜在编码，可以同时改善聚类和预测，并在实验证明其相对于现有方法的优越性。"
}