{
    "title": "Grasp Anything: Combining Teacher-Augmented Policy Gradient Learning with Instance Segmentation to Grasp Arbitrary Objects",
    "abstract": "arXiv:2403.10187v1 Announce Type: cross  Abstract: Interactive grasping from clutter, akin to human dexterity, is one of the longest-standing problems in robot learning. Challenges stem from the intricacies of visual perception, the demand for precise motor skills, and the complex interplay between the two. In this work, we present Teacher-Augmented Policy Gradient (TAPG), a novel two-stage learning framework that synergizes reinforcement learning and policy distillation. After training a teacher policy to master the motor control based on object pose information, TAPG facilitates guided, yet adaptive, learning of a sensorimotor policy, based on object segmentation. We zero-shot transfer from simulation to a real robot by using Segment Anything Model for promptable object segmentation. Our trained policies adeptly grasp a wide variety of objects from cluttered scenarios in simulation and the real world based on human-understandable prompts. Furthermore, we show robust zero-shot transfe",
    "link": "https://arxiv.org/abs/2403.10187",
    "context": "Title: Grasp Anything: Combining Teacher-Augmented Policy Gradient Learning with Instance Segmentation to Grasp Arbitrary Objects\nAbstract: arXiv:2403.10187v1 Announce Type: cross  Abstract: Interactive grasping from clutter, akin to human dexterity, is one of the longest-standing problems in robot learning. Challenges stem from the intricacies of visual perception, the demand for precise motor skills, and the complex interplay between the two. In this work, we present Teacher-Augmented Policy Gradient (TAPG), a novel two-stage learning framework that synergizes reinforcement learning and policy distillation. After training a teacher policy to master the motor control based on object pose information, TAPG facilitates guided, yet adaptive, learning of a sensorimotor policy, based on object segmentation. We zero-shot transfer from simulation to a real robot by using Segment Anything Model for promptable object segmentation. Our trained policies adeptly grasp a wide variety of objects from cluttered scenarios in simulation and the real world based on human-understandable prompts. Furthermore, we show robust zero-shot transfe",
    "path": "papers/24/03/2403.10187.json",
    "total_tokens": 916,
    "translated_title": "抓住一切：将教师增强策略梯度学习与实例分割相结合，用于抓取任意物体",
    "translated_abstract": "交互式从混乱环境中抓取物体，类似于人类灵巧，是机器人学习中存在已久的问题之一。挑战源于视觉感知的复杂性，对精准运动技能的需求，以及两者之间的复杂相互作用。本文介绍了一种新颖的两阶段学习框架Teacher-Augmented Policy Gradient (TAPG)，该框架将强化学习和策略蒸馏相结合。通过训练一个教师策略来掌握基于物体位置信息的运动控制，TAPG促进了基于物体分割的感觉运动策略的指导性但自适应学习。我们通过使用Segment Anything模型进行零样本从仿真到实际机器人的传输，实现了对各种物体的熟练抓取。此外，我们展示了在仿真和真实世界中基于人类可理解提示的混乱场景中训练的策略能够熟练地抓取各种物体。",
    "tldr": "提出了一种新颖的两阶段学习框架TAPG，将强化学习和策略蒸馏相结合，在抓取任意物体时取得了良好表现。",
    "en_tdlr": "Introduced a novel two-stage learning framework TAPG that combines reinforcement learning and policy distillation, achieving good performance in grasping arbitrary objects."
}