{
    "title": "StyleCineGAN: Landscape Cinemagraph Generation using a Pre-trained StyleGAN",
    "abstract": "arXiv:2403.14186v1 Announce Type: cross  Abstract: We propose a method that can generate cinemagraphs automatically from a still landscape image using a pre-trained StyleGAN. Inspired by the success of recent unconditional video generation, we leverage a powerful pre-trained image generator to synthesize high-quality cinemagraphs. Unlike previous approaches that mainly utilize the latent space of a pre-trained StyleGAN, our approach utilizes its deep feature space for both GAN inversion and cinemagraph generation. Specifically, we propose multi-scale deep feature warping (MSDFW), which warps the intermediate features of a pre-trained StyleGAN at different resolutions. By using MSDFW, the generated cinemagraphs are of high resolution and exhibit plausible looping animation. We demonstrate the superiority of our method through user studies and quantitative comparisons with state-of-the-art cinemagraph generation methods and a video generation method that uses a pre-trained StyleGAN.",
    "link": "https://arxiv.org/abs/2403.14186",
    "context": "Title: StyleCineGAN: Landscape Cinemagraph Generation using a Pre-trained StyleGAN\nAbstract: arXiv:2403.14186v1 Announce Type: cross  Abstract: We propose a method that can generate cinemagraphs automatically from a still landscape image using a pre-trained StyleGAN. Inspired by the success of recent unconditional video generation, we leverage a powerful pre-trained image generator to synthesize high-quality cinemagraphs. Unlike previous approaches that mainly utilize the latent space of a pre-trained StyleGAN, our approach utilizes its deep feature space for both GAN inversion and cinemagraph generation. Specifically, we propose multi-scale deep feature warping (MSDFW), which warps the intermediate features of a pre-trained StyleGAN at different resolutions. By using MSDFW, the generated cinemagraphs are of high resolution and exhibit plausible looping animation. We demonstrate the superiority of our method through user studies and quantitative comparisons with state-of-the-art cinemagraph generation methods and a video generation method that uses a pre-trained StyleGAN.",
    "path": "papers/24/03/2403.14186.json",
    "total_tokens": 887,
    "translated_title": "使用预训练StyleGAN生成风格电影图景",
    "translated_abstract": "我们提出一种方法，可以使用预训练的StyleGAN自动生成静止风景图像的电影图景。受到最近无条件视频生成成功的启发，我们利用强大的预训练图像生成器来合成高质量的电影图景。与先前主要利用预训练StyleGAN的潜在空间的方法不同，我们的方法利用其深层特征空间进行GAN反演和电影图景生成。具体来说，我们提出了多尺度深度特征扭曲（MSDFW），它在不同分辨率下扭曲了预训练StyleGAN的中间特征。通过使用MSDFW，生成的电影图景具有高分辨率，并展示出合理的循环动画。通过用户研究和与最先进的电影图景生成方法以及使用预训练StyleGAN的视频生成方法的定量比较，我们证明了我们方法的优越性。",
    "tldr": "提出了一种利用预训练StyleGAN自动生成静止风景图像的电影图景方法，通过利用深层特征空间和多尺度深度特征扭曲（MSDFW）生成高分辨率且具有合理循环动画的电影图景，并证明了该方法的优越性"
}