{
    "title": "A Framework for Strategic Discovery of Credible Neural Network Surrogate Models under Uncertainty",
    "abstract": "arXiv:2403.08901v1 Announce Type: cross  Abstract: The widespread integration of deep neural networks in developing data-driven surrogate models for high-fidelity simulations of complex physical systems highlights the critical necessity for robust uncertainty quantification techniques and credibility assessment methodologies, ensuring the reliable deployment of surrogate models in consequential decision-making. This study presents the Occam Plausibility Algorithm for surrogate models (OPAL-surrogate), providing a systematic framework to uncover predictive neural network-based surrogate models within the large space of potential models, including various neural network classes and choices of architecture and hyperparameters. The framework is grounded in hierarchical Bayesian inferences and employs model validation tests to evaluate the credibility and prediction reliability of the surrogate models under uncertainty. Leveraging these principles, OPAL-surrogate introduces a systematic and",
    "link": "https://arxiv.org/abs/2403.08901",
    "context": "Title: A Framework for Strategic Discovery of Credible Neural Network Surrogate Models under Uncertainty\nAbstract: arXiv:2403.08901v1 Announce Type: cross  Abstract: The widespread integration of deep neural networks in developing data-driven surrogate models for high-fidelity simulations of complex physical systems highlights the critical necessity for robust uncertainty quantification techniques and credibility assessment methodologies, ensuring the reliable deployment of surrogate models in consequential decision-making. This study presents the Occam Plausibility Algorithm for surrogate models (OPAL-surrogate), providing a systematic framework to uncover predictive neural network-based surrogate models within the large space of potential models, including various neural network classes and choices of architecture and hyperparameters. The framework is grounded in hierarchical Bayesian inferences and employs model validation tests to evaluate the credibility and prediction reliability of the surrogate models under uncertainty. Leveraging these principles, OPAL-surrogate introduces a systematic and",
    "path": "papers/24/03/2403.08901.json",
    "total_tokens": 824,
    "translated_title": "一个用于在不确定性下发现可信神经网络代理模型的战略框架",
    "translated_abstract": "深度神经网络在开发复杂物理系统高保真仿真的数据驱动代理模型中的广泛整合，凸显了稳健不确定性量化技术和可信度评估方法的重要性，确保代理模型可可靠地用于重要决策。本研究提出了用于代理模型的Occam Plausibility Algorithm（OPAL-surrogate），提供了一个系统框架，以在大量潜在模型（包括各种神经网络类别以及架构和超参数选择）中揭示具有预测能力的基于神经网络的代理模型。框架基于层次贝叶斯推理，并采用模型验证测试来评估在不确定性下代理模型的可信度和预测可靠性。通过利用这些原则，OPAL-surrogate引入了一种系统性和",
    "tldr": "提出了一个名为Occam Plausibility Algorithm for surrogate models (OPAL-surrogate)的框架，通过基于神经网络的代理模型，采用层次贝叶斯推理和模型验证测试来评估代理模型的可信度和预测可靠性。"
}