{
    "title": "Nonparametric Regression under Cluster Sampling",
    "abstract": "arXiv:2403.04766v1 Announce Type: new  Abstract: This paper develops a general asymptotic theory for nonparametric kernel regression in the presence of cluster dependence. We examine nonparametric density estimation, Nadaraya-Watson kernel regression, and local linear estimation. Our theory accommodates growing and heterogeneous cluster sizes. We derive asymptotic conditional bias and variance, establish uniform consistency, and prove asymptotic normality. Our findings reveal that under heterogeneous cluster sizes, the asymptotic variance includes a new term reflecting within-cluster dependence, which is overlooked when cluster sizes are presumed to be bounded. We propose valid approaches for bandwidth selection and inference, introduce estimators of the asymptotic variance, and demonstrate their consistency. In simulations, we verify the effectiveness of the cluster-robust bandwidth selection and show that the derived cluster-robust confidence interval improves the coverage ratio. We ",
    "link": "https://arxiv.org/abs/2403.04766",
    "context": "Title: Nonparametric Regression under Cluster Sampling\nAbstract: arXiv:2403.04766v1 Announce Type: new  Abstract: This paper develops a general asymptotic theory for nonparametric kernel regression in the presence of cluster dependence. We examine nonparametric density estimation, Nadaraya-Watson kernel regression, and local linear estimation. Our theory accommodates growing and heterogeneous cluster sizes. We derive asymptotic conditional bias and variance, establish uniform consistency, and prove asymptotic normality. Our findings reveal that under heterogeneous cluster sizes, the asymptotic variance includes a new term reflecting within-cluster dependence, which is overlooked when cluster sizes are presumed to be bounded. We propose valid approaches for bandwidth selection and inference, introduce estimators of the asymptotic variance, and demonstrate their consistency. In simulations, we verify the effectiveness of the cluster-robust bandwidth selection and show that the derived cluster-robust confidence interval improves the coverage ratio. We ",
    "path": "papers/24/03/2403.04766.json",
    "total_tokens": 852,
    "translated_title": "集群抽样下的非参数回归",
    "translated_abstract": "本文在簇相关性存在的情况下为非参数核回归模型发展了一般渐近理论。我们研究了非参数密度估计、Nadaraya-Watson核回归和局部线性估计。我们的理论考虑了增长和异质的簇大小。我们推导了渐近条件偏差和方差，确立了一致收敛性，并证明了渐近正态性。我们的发现表明，在异质的簇大小下，渐近方差包括一个反映簇内相关性的新项，当假定簇大小有界时被忽略。我们提出了有效的带宽选择和推断方法，引入了渐近方差的估计量，并证明了它们的一致性。在模拟中，我们验证了集群稳健带宽选择的有效性，并展示了推导的集群稳健置信区间提高了覆盖率。",
    "tldr": "本文在簇相关性存在的情况下为非参数核回归模型发展了一般渐近理论，并提出了有效的带宽选择和推断方法，引入了渐近方差的估计量，并验证了集群稳健带宽选择的有效性。",
    "en_tdlr": "This paper develops a general asymptotic theory for nonparametric kernel regression in the presence of cluster dependence, proposes effective bandwidth selection and inference methods, introduces estimators of the asymptotic variance, and verifies the effectiveness of cluster-robust bandwidth selection."
}