{
    "title": "LexDrafter: Terminology Drafting for Legislative Documents using Retrieval Augmented Generation",
    "abstract": "arXiv:2403.16295v1 Announce Type: new  Abstract: With the increase in legislative documents at the EU, the number of new terms and their definitions is increasing as well. As per the Joint Practical Guide of the European Parliament, the Council and the Commission, terms used in legal documents shall be consistent, and identical concepts shall be expressed without departing from their meaning in ordinary, legal, or technical language. Thus, while drafting a new legislative document, having a framework that provides insights about existing definitions and helps define new terms based on a document's context will support such harmonized legal definitions across different regulations and thus avoid ambiguities. In this paper, we present LexDrafter, a framework that assists in drafting Definitions articles for legislative documents using retrieval augmented generation (RAG) and existing term definitions present in different legislative documents. For this, definition elements are built by e",
    "link": "https://arxiv.org/abs/2403.16295",
    "context": "Title: LexDrafter: Terminology Drafting for Legislative Documents using Retrieval Augmented Generation\nAbstract: arXiv:2403.16295v1 Announce Type: new  Abstract: With the increase in legislative documents at the EU, the number of new terms and their definitions is increasing as well. As per the Joint Practical Guide of the European Parliament, the Council and the Commission, terms used in legal documents shall be consistent, and identical concepts shall be expressed without departing from their meaning in ordinary, legal, or technical language. Thus, while drafting a new legislative document, having a framework that provides insights about existing definitions and helps define new terms based on a document's context will support such harmonized legal definitions across different regulations and thus avoid ambiguities. In this paper, we present LexDrafter, a framework that assists in drafting Definitions articles for legislative documents using retrieval augmented generation (RAG) and existing term definitions present in different legislative documents. For this, definition elements are built by e",
    "path": "papers/24/03/2403.16295.json",
    "total_tokens": 802,
    "translated_title": "LexDrafter: 利用检索增强生成为立法文件起草术语",
    "translated_abstract": "随着欧盟立法文件数量的增加，新术语及其定义的数量也在增加。按照欧洲议会、理事会和委员会的联合实用指南的规定，在法律文件中使用的术语应保持一致，相同概念应在不脱离其在普通、法律或技术语言中含义的前提下表达。因此，在起草新的立法文件时，拥有一个框架，能够提供有关现有定义的见解，并根据文件的上下文帮助定义新术语，将支持不同法规下的这种统一法律定义，并避免歧义。在本文中，我们提出了LexDrafter，一种利用检索增强生成(RAG)和不同立法文件中现有术语定义来协助起草立法文件的“Definitions”文章的框架。",
    "tldr": "LexDrafter是一种框架，利用检索增强生成和现有法律文件中的术语定义，帮助起草法规文件中的“Definitions”文章。",
    "en_tdlr": "LexDrafter is a framework that assists in drafting \"Definitions\" articles for legislative documents using retrieval augmented generation (RAG) and existing term definitions present in different legislative documents."
}