{
    "title": "Towards Non-Adversarial Algorithmic Recourse",
    "abstract": "arXiv:2403.10330v1 Announce Type: new  Abstract: The streams of research on adversarial examples and counterfactual explanations have largely been growing independently. This has led to several recent works trying to elucidate their similarities and differences. Most prominently, it has been argued that adversarial examples, as opposed to counterfactual explanations, have a unique characteristic in that they lead to a misclassification compared to the ground truth. However, the computational goals and methodologies employed in existing counterfactual explanation and adversarial example generation methods often lack alignment with this requirement. Using formal definitions of adversarial examples and counterfactual explanations, we introduce non-adversarial algorithmic recourse and outline why in high-stakes situations, it is imperative to obtain counterfactual explanations that do not exhibit adversarial characteristics. We subsequently investigate how different components in the objec",
    "link": "https://arxiv.org/abs/2403.10330",
    "context": "Title: Towards Non-Adversarial Algorithmic Recourse\nAbstract: arXiv:2403.10330v1 Announce Type: new  Abstract: The streams of research on adversarial examples and counterfactual explanations have largely been growing independently. This has led to several recent works trying to elucidate their similarities and differences. Most prominently, it has been argued that adversarial examples, as opposed to counterfactual explanations, have a unique characteristic in that they lead to a misclassification compared to the ground truth. However, the computational goals and methodologies employed in existing counterfactual explanation and adversarial example generation methods often lack alignment with this requirement. Using formal definitions of adversarial examples and counterfactual explanations, we introduce non-adversarial algorithmic recourse and outline why in high-stakes situations, it is imperative to obtain counterfactual explanations that do not exhibit adversarial characteristics. We subsequently investigate how different components in the objec",
    "path": "papers/24/03/2403.10330.json",
    "total_tokens": 760,
    "translated_title": "朝向非对抗性算法补偿",
    "translated_abstract": "对抗性样本和反事实解释的研究方向基本上是独立增长的。 这导致最近有几项研究试图阐明它们的相似之处和差异。 最重要的是，有人认为，与反事实解释相反，对抗性样本具有独特的特征，即与基本事实相比，它们会导致误分类。 但是，现有的反事实解释和对抗性样本生成方法中所使用的计算目标和方法往往缺乏与此要求的对齐。 使用对抗性样本和反事实解释的正式定义，我们介绍了非对抗性的算法补偿，并概述了在高风险情况下，获得不具有对抗性特征的反事实解释是至关重要的。 我们随后调查了客体中不同组件的行为。",
    "tldr": "在高风险情况下，重要性获得不具有对抗性特征的反事实解释。",
    "en_tdlr": "It is crucial to obtain counterfactual explanations that do not exhibit adversarial characteristics in high-stakes situations."
}