{
    "title": "Anomaly Detection Based on Isolation Mechanisms: A Survey",
    "abstract": "arXiv:2403.10802v1 Announce Type: new  Abstract: Anomaly detection is a longstanding and active research area that has many applications in domains such as finance, security, and manufacturing. However, the efficiency and performance of anomaly detection algorithms are challenged by the large-scale, high-dimensional, and heterogeneous data that are prevalent in the era of big data. Isolation-based unsupervised anomaly detection is a novel and effective approach for identifying anomalies in data. It relies on the idea that anomalies are few and different from normal instances, and thus can be easily isolated by random partitioning. Isolation-based methods have several advantages over existing methods, such as low computational complexity, low memory usage, high scalability, robustness to noise and irrelevant features, and no need for prior knowledge or heavy parameter tuning. In this survey, we review the state-of-the-art isolation-based anomaly detection methods, including their data p",
    "link": "https://arxiv.org/abs/2403.10802",
    "context": "Title: Anomaly Detection Based on Isolation Mechanisms: A Survey\nAbstract: arXiv:2403.10802v1 Announce Type: new  Abstract: Anomaly detection is a longstanding and active research area that has many applications in domains such as finance, security, and manufacturing. However, the efficiency and performance of anomaly detection algorithms are challenged by the large-scale, high-dimensional, and heterogeneous data that are prevalent in the era of big data. Isolation-based unsupervised anomaly detection is a novel and effective approach for identifying anomalies in data. It relies on the idea that anomalies are few and different from normal instances, and thus can be easily isolated by random partitioning. Isolation-based methods have several advantages over existing methods, such as low computational complexity, low memory usage, high scalability, robustness to noise and irrelevant features, and no need for prior knowledge or heavy parameter tuning. In this survey, we review the state-of-the-art isolation-based anomaly detection methods, including their data p",
    "path": "papers/24/03/2403.10802.json",
    "total_tokens": 869,
    "translated_title": "基于隔离机制的异常检测：一项调查",
    "translated_abstract": "异常检测是一个长期并且活跃的研究领域，在金融、安全和制造等领域有许多应用。然而，在大数据时代，异常检测算法的效率和性能受到大规模、高维和异构数据的挑战。基于隔离的无监督异常检测是一种识别数据中异常的新颖有效方法。该方法依赖于异常很少且与正常实例不同的理念，因此可以通过随机分区轻松隔离异常值。基于隔离的方法相对于现有方法具有一些优势，如低计算复杂性、低内存使用、高可伸缩性、对噪声和无关特征的稳健性，以及不需要先验知识或繁重参数调整。本调查中，我们回顾了最先进的基于隔离的异常检测方法，包括它们的数据p",
    "tldr": "基于隔离机制的异常检测是一种新颖有效的方法，具有低计算复杂性、低内存使用、高可伸缩性、对噪声和无关特征的稳健性，以及不需要先验知识或繁重参数调整。",
    "en_tdlr": "Anomaly detection based on isolation mechanisms is a novel and effective approach with advantages such as low computational complexity, low memory usage, high scalability, robustness to noise and irrelevant features, and no need for prior knowledge or heavy parameter tuning."
}