{
    "title": "Transformers-based architectures for stroke segmentation: A review",
    "abstract": "arXiv:2403.18637v1 Announce Type: cross  Abstract: Stroke remains a significant global health concern, necessitating precise and efficient diagnostic tools for timely intervention and improved patient outcomes. The emergence of deep learning methodologies has transformed the landscape of medical image analysis. Recently, Transformers, initially designed for natural language processing, have exhibited remarkable capabilities in various computer vision applications, including medical image analysis. This comprehensive review aims to provide an in-depth exploration of the cutting-edge Transformer-based architectures applied in the context of stroke segmentation. It commences with an exploration of stroke pathology, imaging modalities, and the challenges associated with accurate diagnosis and segmentation. Subsequently, the review delves into the fundamental ideas of Transformers, offering detailed insights into their architectural intricacies and the underlying mechanisms that empower the",
    "link": "https://arxiv.org/abs/2403.18637",
    "context": "Title: Transformers-based architectures for stroke segmentation: A review\nAbstract: arXiv:2403.18637v1 Announce Type: cross  Abstract: Stroke remains a significant global health concern, necessitating precise and efficient diagnostic tools for timely intervention and improved patient outcomes. The emergence of deep learning methodologies has transformed the landscape of medical image analysis. Recently, Transformers, initially designed for natural language processing, have exhibited remarkable capabilities in various computer vision applications, including medical image analysis. This comprehensive review aims to provide an in-depth exploration of the cutting-edge Transformer-based architectures applied in the context of stroke segmentation. It commences with an exploration of stroke pathology, imaging modalities, and the challenges associated with accurate diagnosis and segmentation. Subsequently, the review delves into the fundamental ideas of Transformers, offering detailed insights into their architectural intricacies and the underlying mechanisms that empower the",
    "path": "papers/24/03/2403.18637.json",
    "total_tokens": 764,
    "translated_title": "基于Transformer架构的卒中分割：综述",
    "translated_abstract": "卒中仍然是一个重要的全球健康问题，需要精确高效的诊断工具以便及时干预和改善患者预后。深度学习方法的出现改变了医学图像分析的格局。最近，最初设计用于自然语言处理的Transformer在各种计算机视觉应用中展现出卓越的能力，包括医学图像分析。本综述旨在深入探讨应用于卒中分割领域的最新Transformer架构。它首先探讨了卒中病理学、成像方法以及准确诊断和分割面临的挑战。随后，综述深入探讨了Transformer的基本思想，提供了关于它们架构复杂性和赋予其能力的基本机制的详细见解。",
    "tldr": "本综述深入探讨了基于Transformer的创新架构在卒中分割领域的应用，旨在改善卒中的诊断与分割准确性。",
    "en_tdlr": "This comprehensive review explores the innovative Transformer-based architectures applied in stroke segmentation to improve the accuracy of stroke diagnosis and segmentation."
}