{
    "title": "ConspEmoLLM: Conspiracy Theory Detection Using an Emotion-Based Large Language Model",
    "abstract": "arXiv:2403.06765v1 Announce Type: new  Abstract: The internet has brought both benefits and harms to society. A prime example of the latter is misinformation, including conspiracy theories, which flood the web. Recent advances in natural language processing, particularly the emergence of large language models (LLMs), have improved the prospects of accurate misinformation detection. However, most LLM-based approaches to conspiracy theory detection focus only on binary classification and fail to account for the important relationship between misinformation and affective features (i.e., sentiment and emotions). Driven by a comprehensive analysis of conspiracy text that reveals its distinctive affective features, we propose ConspEmoLLM, the first open-source LLM that integrates affective information and is able to perform diverse tasks relating to conspiracy theories. These tasks include not only conspiracy theory detection, but also classification of theory type and detection of related d",
    "link": "https://arxiv.org/abs/2403.06765",
    "context": "Title: ConspEmoLLM: Conspiracy Theory Detection Using an Emotion-Based Large Language Model\nAbstract: arXiv:2403.06765v1 Announce Type: new  Abstract: The internet has brought both benefits and harms to society. A prime example of the latter is misinformation, including conspiracy theories, which flood the web. Recent advances in natural language processing, particularly the emergence of large language models (LLMs), have improved the prospects of accurate misinformation detection. However, most LLM-based approaches to conspiracy theory detection focus only on binary classification and fail to account for the important relationship between misinformation and affective features (i.e., sentiment and emotions). Driven by a comprehensive analysis of conspiracy text that reveals its distinctive affective features, we propose ConspEmoLLM, the first open-source LLM that integrates affective information and is able to perform diverse tasks relating to conspiracy theories. These tasks include not only conspiracy theory detection, but also classification of theory type and detection of related d",
    "path": "papers/24/03/2403.06765.json",
    "total_tokens": 861,
    "translated_title": "使用基于情感的大型语言模型检测阴谋理论",
    "translated_abstract": "互联网给社会带来了好处和伤害。后者的一个主要例子是误导信息，包括充斥网络的阴谋理论。 自然语言处理的最新进展，特别是大型语言模型（LLMs）的出现，已经提高了准确检测误导信息的前景。然而，大多数基于LLM的阴谋理论检测方法仅专注于二元分类，并未考虑误导信息与情感特征（即情感和情绪）之间的重要关系。通过对揭示其独特情感特征的阴谋文本的全面分析，我们提出了ConspEmoLLM，这是第一个集成情感信息且能够执行涉及阴谋理论的多样任务的开源LLM。 这些任务不仅包括阴谋理论检测，还包括理论类型分类和相关文本检测。",
    "tldr": "本研究提出了ConspEmoLLM，这是第一个集成情感信息的大型语言模型，通过对阴谋理论文本的情感特征进行综合分析，能够执行多项任务，包括阴谋理论检测、理论类型分类和相关文本检测。"
}