{
    "title": "Procedural terrain generation with style transfer",
    "abstract": "arXiv:2403.08782v1 Announce Type: cross  Abstract: In this study we introduce a new technique for the generation of terrain maps, exploiting a combination of procedural generation and Neural Style Transfer. We consider our approach to be a viable alternative to competing generative models, with our technique achieving greater versatility, lower hardware requirements and greater integration in the creative process of designers and developers. Our method involves generating procedural noise maps using either multi-layered smoothed Gaussian noise or the Perlin algorithm. We then employ an enhanced Neural Style transfer technique, drawing style from real-world height maps. This fusion of algorithmic generation and neural processing holds the potential to produce terrains that are not only diverse but also closely aligned with the morphological characteristics of real-world landscapes, with our process yielding consistent terrain structures with low computational cost and offering the capab",
    "link": "https://arxiv.org/abs/2403.08782",
    "context": "Title: Procedural terrain generation with style transfer\nAbstract: arXiv:2403.08782v1 Announce Type: cross  Abstract: In this study we introduce a new technique for the generation of terrain maps, exploiting a combination of procedural generation and Neural Style Transfer. We consider our approach to be a viable alternative to competing generative models, with our technique achieving greater versatility, lower hardware requirements and greater integration in the creative process of designers and developers. Our method involves generating procedural noise maps using either multi-layered smoothed Gaussian noise or the Perlin algorithm. We then employ an enhanced Neural Style transfer technique, drawing style from real-world height maps. This fusion of algorithmic generation and neural processing holds the potential to produce terrains that are not only diverse but also closely aligned with the morphological characteristics of real-world landscapes, with our process yielding consistent terrain structures with low computational cost and offering the capab",
    "path": "papers/24/03/2403.08782.json",
    "total_tokens": 846,
    "translated_title": "利用风格转移实现程序化地形生成",
    "translated_abstract": "在本研究中，我们介绍了一种新的技术用于生成地形地图，利用了程序化生成和神经风格转移的组合。我们认为我们的方法是与竞争性生成模型的可行替代方案，我们的技术实现了更大的灵活性、更低的硬件需求，并在设计师和开发人员的创造过程中有更好的整合性。我们的方法涉及使用多层平滑的高斯噪声或Perlin算法生成程序化噪声地图。然后我们利用增强的神经风格转移技术，从现实世界的高度地图中提取风格。这种算法生成和神经处理的融合有潜力产生不仅多样化而且与现实世界景观形态特征密切相关的地形，我们的过程以低计算成本产生一致的地形结构并提供了的capab",
    "tldr": "介绍了一种结合程序化生成和神经风格转移的技术，用于生成地形地图，具有更大的灵活性、更低硬件需求和更好的整合性，在地形生成过程中能够产生与真实世界景观形态特征密切相关的地形结构。",
    "en_tdlr": "Introducing a technique combining procedural generation and Neural Style Transfer for terrain map generation, with greater flexibility, lower hardware requirements, and better integration, capable of producing terrains closely aligned with real-world landscape morphological characteristics."
}