{
    "title": "What Matters for Active Texture Recognition With Vision-Based Tactile Sensors",
    "abstract": "arXiv:2403.13701v1 Announce Type: cross  Abstract: This paper explores active sensing strategies that employ vision-based tactile sensors for robotic perception and classification of fabric textures. We formalize the active sampling problem in the context of tactile fabric recognition and provide an implementation of information-theoretic exploration strategies based on minimizing predictive entropy and variance of probabilistic models. Through ablation studies and human experiments, we investigate which components are crucial for quick and reliable texture recognition. Along with the active sampling strategies, we evaluate neural network architectures, representations of uncertainty, influence of data augmentation, and dataset variability. By evaluating our method on a previously published Active Clothing Perception Dataset and on a real robotic system, we establish that the choice of the active exploration strategy has only a minor influence on the recognition accuracy, whereas data ",
    "link": "https://arxiv.org/abs/2403.13701",
    "context": "Title: What Matters for Active Texture Recognition With Vision-Based Tactile Sensors\nAbstract: arXiv:2403.13701v1 Announce Type: cross  Abstract: This paper explores active sensing strategies that employ vision-based tactile sensors for robotic perception and classification of fabric textures. We formalize the active sampling problem in the context of tactile fabric recognition and provide an implementation of information-theoretic exploration strategies based on minimizing predictive entropy and variance of probabilistic models. Through ablation studies and human experiments, we investigate which components are crucial for quick and reliable texture recognition. Along with the active sampling strategies, we evaluate neural network architectures, representations of uncertainty, influence of data augmentation, and dataset variability. By evaluating our method on a previously published Active Clothing Perception Dataset and on a real robotic system, we establish that the choice of the active exploration strategy has only a minor influence on the recognition accuracy, whereas data ",
    "path": "papers/24/03/2403.13701.json",
    "total_tokens": 850,
    "translated_title": "使用基于视觉的触觉传感器进行活动纹理识别的关键因素",
    "translated_abstract": "本文探讨了利用基于视觉的触觉传感器进行机器人感知和分类织物纹理的活动传感策略。我们在触觉织物识别的背景下形式化了主动采样问题，并提供了基于最小化预测熵和概率模型方差的信息论探索策略的实现。通过消融研究和人类实验，我们调查了哪些组件对于快速和可靠的纹理识别至关重要。除了活动采样策略，我们还评估了神经网络架构、不确定性表示、数据增强的影响以及数据集变异性。通过在先前发布的主动服装感知数据集和真实机器人系统上评估我们的方法，我们确定主动探索策略的选择对识别准确性的影响仅很小，而数据",
    "tldr": "本文探讨了利用基于视觉的触觉传感器进行活动纹理识别的关键因素，通过实现信息论探索策略并进行消融研究和人类实验，发现主动采样策略对识别准确性的影响较小。",
    "en_tdlr": "This paper explores the key factors for active texture recognition using vision-based tactile sensors, implementing information-theoretic exploration strategies and conducting ablation studies and human experiments, finding that the choice of active sampling strategy has only a minor influence on recognition accuracy."
}