{
    "title": "Multi-criteria approach for selecting an explanation from the set of counterfactuals produced by an ensemble of explainers",
    "abstract": "arXiv:2403.13940v1 Announce Type: cross  Abstract: Counterfactuals are widely used to explain ML model predictions by providing alternative scenarios for obtaining the more desired predictions. They can be generated by a variety of methods that optimize different, sometimes conflicting, quality measures and produce quite different solutions. However, choosing the most appropriate explanation method and one of the generated counterfactuals is not an easy task. Instead of forcing the user to test many different explanation methods and analysing conflicting solutions, in this paper, we propose to use a multi-stage ensemble approach that will select single counterfactual based on the multiple-criteria analysis. It offers a compromise solution that scores well on several popular quality measures. This approach exploits the dominance relation and the ideal point decision aid method, which selects one counterfactual from the Pareto front. The conducted experiments demonstrated that the propos",
    "link": "https://arxiv.org/abs/2403.13940",
    "context": "Title: Multi-criteria approach for selecting an explanation from the set of counterfactuals produced by an ensemble of explainers\nAbstract: arXiv:2403.13940v1 Announce Type: cross  Abstract: Counterfactuals are widely used to explain ML model predictions by providing alternative scenarios for obtaining the more desired predictions. They can be generated by a variety of methods that optimize different, sometimes conflicting, quality measures and produce quite different solutions. However, choosing the most appropriate explanation method and one of the generated counterfactuals is not an easy task. Instead of forcing the user to test many different explanation methods and analysing conflicting solutions, in this paper, we propose to use a multi-stage ensemble approach that will select single counterfactual based on the multiple-criteria analysis. It offers a compromise solution that scores well on several popular quality measures. This approach exploits the dominance relation and the ideal point decision aid method, which selects one counterfactual from the Pareto front. The conducted experiments demonstrated that the propos",
    "path": "papers/24/03/2403.13940.json",
    "total_tokens": 860,
    "translated_title": "从解释器集合中选择反事实解释的多标准方法",
    "translated_abstract": "反事实被广泛用于解释机器学习模型的预测，提供获取更理想预测的替代场景。它们可以由多种方法生成，这些方法优化不同、有时是冲突的质量度量，并产生完全不同的解决方案。然而，选择最合适的解释方法和生成的反事实之一并不是一件容易的事情。本文提出使用多阶段集成方法，基于多标准分析来选择单个反事实，而不是强迫用户测试许多不同的解释方法并分析冲突的解决方案。它提供了一个妥协方案，在几个流行的质量度量上得分较高。这种方法利用支配关系和理想点决策辅助方法，从帕累托前沿中选择一个反事实。进行的实验证明了这种方法的有效性。",
    "tldr": "本文提出了一种多阶段集成方法，通过多标准分析选择单个反事实，避免了用户测试多种不同解释方法和分析冲突解决方案的困难，提供了一个在多个质量度量上得分很高的妥协方案。",
    "en_tdlr": "This paper proposes a multi-stage ensemble approach to select a single counterfactual based on multiple-criteria analysis, avoiding the difficulty of testing various explanation methods and analyzing conflicting solutions for users, providing a compromise solution that scores high on multiple quality measures."
}