{
    "title": "Information Extraction: An application to the domain of hyper-local financial data on developing countries",
    "abstract": "arXiv:2403.09077v1 Announce Type: new  Abstract: Despite the need for financial data on company activities in developing countries for development research and economic analysis, such data does not exist. In this project, we develop and evaluate two Natural Language Processing (NLP) based techniques to address this issue. First, we curate a custom dataset specific to the domain of financial text data on developing countries and explore multiple approaches for information extraction. We then explore a text-to-text approach with the transformer-based T5 model with the goal of undertaking simultaneous NER and relation extraction. We find that this model is able to learn the custom text structure output data corresponding to the entities and their relations, resulting in an accuracy of 92.44\\%, a precision of 68.25\\% and a recall of 54.20\\% from our best T5 model on the combined task. Secondly, we explore an approach with sequential NER and relation extration. For the NER, we run pre-train",
    "link": "https://arxiv.org/abs/2403.09077",
    "context": "Title: Information Extraction: An application to the domain of hyper-local financial data on developing countries\nAbstract: arXiv:2403.09077v1 Announce Type: new  Abstract: Despite the need for financial data on company activities in developing countries for development research and economic analysis, such data does not exist. In this project, we develop and evaluate two Natural Language Processing (NLP) based techniques to address this issue. First, we curate a custom dataset specific to the domain of financial text data on developing countries and explore multiple approaches for information extraction. We then explore a text-to-text approach with the transformer-based T5 model with the goal of undertaking simultaneous NER and relation extraction. We find that this model is able to learn the custom text structure output data corresponding to the entities and their relations, resulting in an accuracy of 92.44\\%, a precision of 68.25\\% and a recall of 54.20\\% from our best T5 model on the combined task. Secondly, we explore an approach with sequential NER and relation extration. For the NER, we run pre-train",
    "path": "papers/24/03/2403.09077.json",
    "total_tokens": 882,
    "translated_title": "信息提取：应用于发展中国家超本地金融数据领域的一项研究",
    "translated_abstract": "尽管发展研究和经济分析需要有关发展中国家公司活动的金融数据，但这样的数据并不存在。在本项目中，我们开发并评估了两种基于自然语言处理（NLP）的技术来解决这一问题。首先，我们整理了一个特定于发展中国家金融文本数据领域的自定义数据集，并探索了多种信息提取方法。然后，我们采用基于变压器的T5模型进行文本到文本的方法，旨在进行同时的命名实体识别和关系提取。我们发现该模型能够学习到定制文本结构输出数据，即实体及其关系，从而在合并任务上我们最佳的T5模型的准确率为92.44％，精度为68.25％，召回率为54.20％。其次，我们探索了一种顺序NER和关系提取方法。对于NER，我们运行了预训练模型",
    "tldr": "本研究开发并评估了两种基于自然语言处理的技术来提取发展中国家金融数据，其中采用文本到文本的T5模型实现了高准确率、精度和召回率。",
    "en_tdlr": "This study developed and evaluated two Natural Language Processing techniques for extracting financial data from developing countries, achieving high accuracy, precision, and recall using the text-to-text T5 model."
}