{
    "title": "Disentangling shared and private latent factors in multimodal Variational Autoencoders",
    "abstract": "arXiv:2403.06338v1 Announce Type: cross  Abstract: Generative models for multimodal data permit the identification of latent factors that may be associated with important determinants of observed data heterogeneity. Common or shared factors could be important for explaining variation across modalities whereas other factors may be private and important only for the explanation of a single modality. Multimodal Variational Autoencoders, such as MVAE and MMVAE, are a natural choice for inferring those underlying latent factors and separating shared variation from private. In this work, we investigate their capability to reliably perform this disentanglement. In particular, we highlight a challenging problem setting where modality-specific variation dominates the shared signal. Taking a cross-modal prediction perspective, we demonstrate limitations of existing models, and propose a modification how to make them more robust to modality-specific variation. Our findings are supported by experi",
    "link": "https://arxiv.org/abs/2403.06338",
    "context": "Title: Disentangling shared and private latent factors in multimodal Variational Autoencoders\nAbstract: arXiv:2403.06338v1 Announce Type: cross  Abstract: Generative models for multimodal data permit the identification of latent factors that may be associated with important determinants of observed data heterogeneity. Common or shared factors could be important for explaining variation across modalities whereas other factors may be private and important only for the explanation of a single modality. Multimodal Variational Autoencoders, such as MVAE and MMVAE, are a natural choice for inferring those underlying latent factors and separating shared variation from private. In this work, we investigate their capability to reliably perform this disentanglement. In particular, we highlight a challenging problem setting where modality-specific variation dominates the shared signal. Taking a cross-modal prediction perspective, we demonstrate limitations of existing models, and propose a modification how to make them more robust to modality-specific variation. Our findings are supported by experi",
    "path": "papers/24/03/2403.06338.json",
    "total_tokens": 824,
    "translated_title": "在多模式变分自动编码器中解开共享和私有潜在因素",
    "translated_abstract": "多模态数据的生成模型可以确定可能与观测数据异质性的重要决定因素相关联的潜在因素。共享因素可以用于解释跨模态的变化，而其他因素可能是私有的，仅用于解释单个模态。多模态变分自动编码器，如MVAE和MMVAE，是推断这些潜在潜因素并将共享变异与私有变异分离的自然选择。在这项工作中，我们研究它们可靠执行此解缠的能力。特别是，我们强调了一个具有挑战性的问题设置，其中特定于模态的变异支配了共享信号。采用交叉模态预测的视角，我们展示了现有模型的局限性，并提出了一种修改方法，使它们对特定于模态的变异更加稳健。我们的发现得到了实验证明。",
    "tldr": "多模态变分自动编码器在解开共享和私有潜在因素方面的能力进行了研究，并提出了改进的方法以增强对特定模态变化的鲁棒性。",
    "en_tdlr": "The paper investigates the capability of multimodal Variational Autoencoders to disentangle shared and private latent factors, proposing a modification to enhance robustness to modality-specific variation."
}