{
    "title": "Dealing with Imbalanced Classes in Bot-IoT Dataset",
    "abstract": "arXiv:2403.18989v1 Announce Type: cross  Abstract: With the rapidly spreading usage of Internet of Things (IoT) devices, a network intrusion detection system (NIDS) plays an important role in detecting and protecting various types of attacks in the IoT network. To evaluate the robustness of the NIDS in the IoT network, the existing work proposed a realistic botnet dataset in the IoT network (Bot-IoT dataset) and applied it to machine learning-based anomaly detection. This dataset contains imbalanced normal and attack packets because the number of normal packets is much smaller than that of attack ones. The nature of imbalanced data may make it difficult to identify the minority class correctly. In this thesis, to address the class imbalance problem in the Bot-IoT dataset, we propose a binary classification method with synthetic minority over-sampling techniques (SMOTE). The proposed classifier aims to detect attack packets and overcome the class imbalance problem using the SMOTE algori",
    "link": "https://arxiv.org/abs/2403.18989",
    "context": "Title: Dealing with Imbalanced Classes in Bot-IoT Dataset\nAbstract: arXiv:2403.18989v1 Announce Type: cross  Abstract: With the rapidly spreading usage of Internet of Things (IoT) devices, a network intrusion detection system (NIDS) plays an important role in detecting and protecting various types of attacks in the IoT network. To evaluate the robustness of the NIDS in the IoT network, the existing work proposed a realistic botnet dataset in the IoT network (Bot-IoT dataset) and applied it to machine learning-based anomaly detection. This dataset contains imbalanced normal and attack packets because the number of normal packets is much smaller than that of attack ones. The nature of imbalanced data may make it difficult to identify the minority class correctly. In this thesis, to address the class imbalance problem in the Bot-IoT dataset, we propose a binary classification method with synthetic minority over-sampling techniques (SMOTE). The proposed classifier aims to detect attack packets and overcome the class imbalance problem using the SMOTE algori",
    "path": "papers/24/03/2403.18989.json",
    "total_tokens": 833,
    "translated_title": "处理Bot-IoT数据集中的不平衡类问题",
    "translated_abstract": "随着物联网(IoT)设备的广泛使用，网络入侵检测系统(NIDS)在检测和保护物联网网络中各种类型的攻击中发挥着重要作用。为了评估NIDS在物联网网络中的鲁棒性，现有工作提出了一个现实的物联网网络中的僵尸网络数据集(Bot-IoT数据集)，并将其应用于基于机器学习的异常检测。该数据集包含不平衡的正常数据包和攻击数据包，因为正常数据包的数量远小于攻击数据包的数量。不平衡数据的性质可能会使辨识少数类别变得困难。在本论文中，为了解决Bot-IoT数据集中的类别不平衡问题，我们提出了一种利用合成少数类过抽样技术(SMOTE)的二元分类方法。所提出的分类器旨在检测攻击数据包并使用SMOTE算法克服类别不平衡问题。",
    "tldr": "提出了一种利用合成少数类过抽样技术(SMOTE)的二元分类方法，以解决Bot-IoT数据集中的类别不平衡问题。",
    "en_tdlr": "Proposed a binary classification method using Synthetic Minority Over-sampling Technique (SMOTE) to address the class imbalance problem in Bot-IoT dataset."
}