{
    "title": "RouteExplainer: An Explanation Framework for Vehicle Routing Problem",
    "abstract": "arXiv:2403.03585v1 Announce Type: cross  Abstract: The Vehicle Routing Problem (VRP) is a widely studied combinatorial optimization problem and has been applied to various practical problems. While the explainability for VRP is significant for improving the reliability and interactivity in practical VRP applications, it remains unexplored. In this paper, we propose RouteExplainer, a post-hoc explanation framework that explains the influence of each edge in a generated route. Our framework realizes this by rethinking a route as the sequence of actions and extending counterfactual explanations based on the action influence model to VRP. To enhance the explanation, we additionally propose an edge classifier that infers the intentions of each edge, a loss function to train the edge classifier, and explanation-text generation by Large Language Models (LLMs). We quantitatively evaluate our edge classifier on four different VRPs. The results demonstrate its rapid computation while maintaining",
    "link": "https://arxiv.org/abs/2403.03585",
    "context": "Title: RouteExplainer: An Explanation Framework for Vehicle Routing Problem\nAbstract: arXiv:2403.03585v1 Announce Type: cross  Abstract: The Vehicle Routing Problem (VRP) is a widely studied combinatorial optimization problem and has been applied to various practical problems. While the explainability for VRP is significant for improving the reliability and interactivity in practical VRP applications, it remains unexplored. In this paper, we propose RouteExplainer, a post-hoc explanation framework that explains the influence of each edge in a generated route. Our framework realizes this by rethinking a route as the sequence of actions and extending counterfactual explanations based on the action influence model to VRP. To enhance the explanation, we additionally propose an edge classifier that infers the intentions of each edge, a loss function to train the edge classifier, and explanation-text generation by Large Language Models (LLMs). We quantitatively evaluate our edge classifier on four different VRPs. The results demonstrate its rapid computation while maintaining",
    "path": "papers/24/03/2403.03585.json",
    "total_tokens": 847,
    "translated_title": "RouteExplainer：一种车辆路径问题的解释框架",
    "translated_abstract": "车辆路径问题（VRP）是一个广泛研究的组合优化问题，已应用于各种实际问题。尽管对VRP的可解释性对于改善实际VRP应用中的可靠性和互动性至关重要，但这个领域仍未被探索。本文提出了RouteExplainer，一种事后解释框架，用于解释在生成路径中每条边的影响。我们的框架通过重新思考路径为动作序列并基于动作影响模型扩展对VRP的反事实解释来实现这一点。为了增强解释，我们额外提出了一个边界分类器，推断每个边界的意图，一个用于训练边界分类器的损失函数，以及通过大型语言模型（LLMs）生成解释文本。我们在四种不同的VRP上定量评估了我们的边界分类器。结果表明，在保持计算速度的同时",
    "tldr": "提出了一种车辆路径问题的解释框架RouteExplainer，实现了边的影响解释和意图推断，通过大型语言模型生成解释文本，并在多个VRP上进行了量化评估",
    "en_tdlr": "Introduced RouteExplainer, an explanation framework for the Vehicle Routing Problem that explains the influence of edges, infers intentions, generates explanation texts using Large Language Models, and is quantitatively evaluated on multiple VRPs."
}