{
    "title": "Audio-Visual Segmentation via Unlabeled Frame Exploitation",
    "abstract": "arXiv:2403.11074v1 Announce Type: cross  Abstract: Audio-visual segmentation (AVS) aims to segment the sounding objects in video frames. Although great progress has been witnessed, we experimentally reveal that current methods reach marginal performance gain within the use of the unlabeled frames, leading to the underutilization issue. To fully explore the potential of the unlabeled frames for AVS, we explicitly divide them into two categories based on their temporal characteristics, i.e., neighboring frame (NF) and distant frame (DF). NFs, temporally adjacent to the labeled frame, often contain rich motion information that assists in the accurate localization of sounding objects. Contrary to NFs, DFs have long temporal distances from the labeled frame, which share semantic-similar objects with appearance variations. Considering their unique characteristics, we propose a versatile framework that effectively leverages them to tackle AVS. Specifically, for NFs, we exploit the motion cues",
    "link": "https://arxiv.org/abs/2403.11074",
    "context": "Title: Audio-Visual Segmentation via Unlabeled Frame Exploitation\nAbstract: arXiv:2403.11074v1 Announce Type: cross  Abstract: Audio-visual segmentation (AVS) aims to segment the sounding objects in video frames. Although great progress has been witnessed, we experimentally reveal that current methods reach marginal performance gain within the use of the unlabeled frames, leading to the underutilization issue. To fully explore the potential of the unlabeled frames for AVS, we explicitly divide them into two categories based on their temporal characteristics, i.e., neighboring frame (NF) and distant frame (DF). NFs, temporally adjacent to the labeled frame, often contain rich motion information that assists in the accurate localization of sounding objects. Contrary to NFs, DFs have long temporal distances from the labeled frame, which share semantic-similar objects with appearance variations. Considering their unique characteristics, we propose a versatile framework that effectively leverages them to tackle AVS. Specifically, for NFs, we exploit the motion cues",
    "path": "papers/24/03/2403.11074.json",
    "total_tokens": 817,
    "translated_title": "通过未标记帧利用实现音频-视觉分割",
    "translated_abstract": "音频-视觉分割（AVS）旨在分割视频帧中的发出声音的对象。尽管取得了很大进展，但我们通过实验证实当前方法在使用未标记帧时只实现了边际性能提升，导致了未充分利用的问题。为了充分挖掘未标记帧在AVS中的潜力，我们明确将它们基于其时间特征分为两类，即邻近帧（NF）和远距帧（DF）。NF，与标记帧在时间上相邻，通常包含丰富的运动信息，有助于准确定位发声对象。与NF相反，DF与标记帧之间存在很长的时间间隔，其具有外观变化但共享语义相似对象。考虑到它们独特的特点，我们提出了一种通用框架，有效利用它们来处理AVS。具体而言，对于NF，我们利用运动线索",
    "tldr": "该研究提出一种通用框架，有效利用邻近帧和远距帧来实现音频-视觉分割",
    "en_tdlr": "This study proposes a versatile framework that effectively leverages neighboring frames and distant frames to achieve audio-visual segmentation."
}