{
    "title": "Temporal Decisions: Leveraging Temporal Correlation for Efficient Decisions in Early Exit Neural Networks",
    "abstract": "arXiv:2403.07958v1 Announce Type: cross  Abstract: Deep Learning is becoming increasingly relevant in Embedded and Internet-of-things applications. However, deploying models on embedded devices poses a challenge due to their resource limitations. This can impact the model's inference accuracy and latency. One potential solution are Early Exit Neural Networks, which adjust model depth dynamically through additional classifiers attached between their hidden layers. However, the real-time termination decision mechanism is critical for the system's efficiency, latency, and sustained accuracy.   This paper introduces Difference Detection and Temporal Patience as decision mechanisms for Early Exit Neural Networks. They leverage the temporal correlation present in sensor data streams to efficiently terminate the inference. We evaluate their effectiveness in health monitoring, image classification, and wake-word detection tasks. Our novel contributions were able to reduce the computational foo",
    "link": "https://arxiv.org/abs/2403.07958",
    "context": "Title: Temporal Decisions: Leveraging Temporal Correlation for Efficient Decisions in Early Exit Neural Networks\nAbstract: arXiv:2403.07958v1 Announce Type: cross  Abstract: Deep Learning is becoming increasingly relevant in Embedded and Internet-of-things applications. However, deploying models on embedded devices poses a challenge due to their resource limitations. This can impact the model's inference accuracy and latency. One potential solution are Early Exit Neural Networks, which adjust model depth dynamically through additional classifiers attached between their hidden layers. However, the real-time termination decision mechanism is critical for the system's efficiency, latency, and sustained accuracy.   This paper introduces Difference Detection and Temporal Patience as decision mechanisms for Early Exit Neural Networks. They leverage the temporal correlation present in sensor data streams to efficiently terminate the inference. We evaluate their effectiveness in health monitoring, image classification, and wake-word detection tasks. Our novel contributions were able to reduce the computational foo",
    "path": "papers/24/03/2403.07958.json",
    "total_tokens": 820,
    "translated_title": "时间决策：利用早期退出神经网络中的时间相关性进行有效决策",
    "translated_abstract": "深度学习在嵌入式和物联网应用中变得越来越重要。但是，在嵌入式设备上部署模型面临资源限制的挑战，这可能影响模型的推断准确性和延迟。早期退出神经网络是一种潜在解决方案，它通过在隐藏层之间附加的额外分类器动态调整模型深度。然而，实时终止决策机制对系统的效率、延迟和持续准确性至关重要。本文引入了差异检测和时间耐心作为早期退出神经网络的决策机制。它们利用传感器数据流中存在的时间相关性来有效地终止推断。我们评估了它们在健康监测、图像分类和唤醒词检测任务中的有效性。我们的创新贡献能够减少计算负担。",
    "tldr": "该论文引入了差异检测和时间耐心作为早期退出神经网络的决策机制，利用传感器数据流中的时间相关性来有效终止推断。",
    "en_tdlr": "This paper introduces Difference Detection and Temporal Patience as decision mechanisms for Early Exit Neural Networks, leveraging the temporal correlation in sensor data streams to efficiently terminate the inference."
}