{
    "title": "WorldGPT: A Sora-Inspired Video AI Agent as Rich World Models from Text and Image Inputs",
    "abstract": "arXiv:2403.07944v1 Announce Type: cross  Abstract: Several text-to-video diffusion models have demonstrated commendable capabilities in synthesizing high-quality video content. However, it remains a formidable challenge pertaining to maintaining temporal consistency and ensuring action smoothness throughout the generated sequences. In this paper, we present an innovative video generation AI agent that harnesses the power of Sora-inspired multimodal learning to build skilled world models framework based on textual prompts and accompanying images. The framework includes two parts: prompt enhancer and full video translation. The first part employs the capabilities of ChatGPT to meticulously distill and proactively construct precise prompts for each subsequent step, thereby guaranteeing the utmost accuracy in prompt communication and accurate execution in following model operations. The second part employ compatible with existing advanced diffusion techniques to expansively generate and re",
    "link": "https://arxiv.org/abs/2403.07944",
    "context": "Title: WorldGPT: A Sora-Inspired Video AI Agent as Rich World Models from Text and Image Inputs\nAbstract: arXiv:2403.07944v1 Announce Type: cross  Abstract: Several text-to-video diffusion models have demonstrated commendable capabilities in synthesizing high-quality video content. However, it remains a formidable challenge pertaining to maintaining temporal consistency and ensuring action smoothness throughout the generated sequences. In this paper, we present an innovative video generation AI agent that harnesses the power of Sora-inspired multimodal learning to build skilled world models framework based on textual prompts and accompanying images. The framework includes two parts: prompt enhancer and full video translation. The first part employs the capabilities of ChatGPT to meticulously distill and proactively construct precise prompts for each subsequent step, thereby guaranteeing the utmost accuracy in prompt communication and accurate execution in following model operations. The second part employ compatible with existing advanced diffusion techniques to expansively generate and re",
    "path": "papers/24/03/2403.07944.json",
    "total_tokens": 746,
    "translated_title": "WorldGPT：受Sora启发的视频AI代理作为文本和图像输入的丰富世界模型",
    "translated_abstract": "几种文本到视频扩散模型展示了在合成高质量视频内容方面出色的能力。然而，保持生成序列中的时间一致性并确保动作平滑仍然是一个严峻的挑战。本文提出了一种创新的视频生成AI代理，利用受Sora启发的多模态学习的力量来基于文本提示和附带图像构建熟练的世界模型框架。该框架包括两部分：提示增强器和完整视频翻译。",
    "tldr": "本文提出了一种视频生成AI代理，通过结合文本提示和图像输入，利用Sora启发的多模态学习技术构建丰富的世界模型，有效解决了视频生成中的时间一致性和动作平滑性挑战。"
}