{
    "title": "Water-Based Metaheuristics: How Water Dynamics Can Help Us to Solve NP-Hard Problems",
    "abstract": "arXiv:2403.12058v1 Announce Type: cross  Abstract: Many water-based optimization metaheuristics have been introduced during the last decade, both for combinatorial and for continuous optimization. Despite the strong similarities of these methods in terms of their underlying natural metaphors (most of them emulate, in some way or another, how drops collaboratively form paths down to the sea), in general the resulting algorithms are quite different in terms of their searching approach or their solution construction approach. For instance, each entity may represent a solution by itself or, alternatively, entities may construct solutions by modifying the landscape while moving. A researcher or practitioner could assume that the degree of similarity between two water-based metaheuristics heavily depends on the similarity of the natural water mechanics they emulate, but this is not the case. In order to bring some clarity to this mosaic of apparently related metaheuristics, in this paper we ",
    "link": "https://arxiv.org/abs/2403.12058",
    "context": "Title: Water-Based Metaheuristics: How Water Dynamics Can Help Us to Solve NP-Hard Problems\nAbstract: arXiv:2403.12058v1 Announce Type: cross  Abstract: Many water-based optimization metaheuristics have been introduced during the last decade, both for combinatorial and for continuous optimization. Despite the strong similarities of these methods in terms of their underlying natural metaphors (most of them emulate, in some way or another, how drops collaboratively form paths down to the sea), in general the resulting algorithms are quite different in terms of their searching approach or their solution construction approach. For instance, each entity may represent a solution by itself or, alternatively, entities may construct solutions by modifying the landscape while moving. A researcher or practitioner could assume that the degree of similarity between two water-based metaheuristics heavily depends on the similarity of the natural water mechanics they emulate, but this is not the case. In order to bring some clarity to this mosaic of apparently related metaheuristics, in this paper we ",
    "path": "papers/24/03/2403.12058.json",
    "total_tokens": 774,
    "translated_title": "基于水的元启发式算法：水动力学如何帮助我们解决NP难题",
    "translated_abstract": "在过去的十年中，许多基于水的优化元启发式算法已被引入，旨在解决组合优化和连续优化问题。这些方法在其基础自然隐喻方面存在强烈相似性（大多数方法以某种方式模拟水滴协同形成通往大海的路径），但最终算法在搜索方式或解决方案构建方式上却有很大不同。研究人员或从业者可能会认为两种基于水的元启发式算法之间的相似度程度严重依赖于它们模拟的自然水动力学的相似性，但事实并非如此。",
    "tldr": "本论文旨在阐明基于水的元启发式算法之间看似相关但实际差异巨大的研究，探讨它们在搜索方式和解决方案构建方面的不同之处。",
    "en_tdlr": "This paper aims to clarify the seemingly related but significantly different research on water-based metaheuristics, exploring their variations in search approaches and solution construction methods."
}