{
    "title": "Curvature Augmented Manifold Embedding and Learning",
    "abstract": "arXiv:2403.14813v1 Announce Type: cross  Abstract: A new dimensional reduction (DR) and data visualization method, Curvature-Augmented Manifold Embedding and Learning (CAMEL), is proposed. The key novel contribution is to formulate the DR problem as a mechanistic/physics model, where the force field among nodes (data points) is used to find an n-dimensional manifold representation of the data sets. Compared with many existing attractive-repulsive force-based methods, one unique contribution of the proposed method is to include a non-pairwise force. A new force field model is introduced and discussed, inspired by the multi-body potential in lattice-particle physics and Riemann curvature in topology. A curvature-augmented force is included in CAMEL. Following this, CAMEL formulation for unsupervised learning, supervised learning, semi-supervised learning/metric learning, and inverse learning are provided. Next, CAMEL is applied to many benchmark datasets by comparing existing models, suc",
    "link": "https://arxiv.org/abs/2403.14813",
    "context": "Title: Curvature Augmented Manifold Embedding and Learning\nAbstract: arXiv:2403.14813v1 Announce Type: cross  Abstract: A new dimensional reduction (DR) and data visualization method, Curvature-Augmented Manifold Embedding and Learning (CAMEL), is proposed. The key novel contribution is to formulate the DR problem as a mechanistic/physics model, where the force field among nodes (data points) is used to find an n-dimensional manifold representation of the data sets. Compared with many existing attractive-repulsive force-based methods, one unique contribution of the proposed method is to include a non-pairwise force. A new force field model is introduced and discussed, inspired by the multi-body potential in lattice-particle physics and Riemann curvature in topology. A curvature-augmented force is included in CAMEL. Following this, CAMEL formulation for unsupervised learning, supervised learning, semi-supervised learning/metric learning, and inverse learning are provided. Next, CAMEL is applied to many benchmark datasets by comparing existing models, suc",
    "path": "papers/24/03/2403.14813.json",
    "total_tokens": 905,
    "translated_title": "曲率增强流形嵌入与学习",
    "translated_abstract": "发表于arXiv:2403.14813v1，其中提出了一种新的降维（DR）和数据可视化方法，称为曲率增强流形嵌入与学习（CAMEL）。其关键创新贡献在于将降维问题建模为一个机械/物理模型，其中节点（数据点）之间的力场被用来找到数据集的n维流形表示。与许多现有的吸引-排斥力方法相比，本方法的一个独特贡献是包含了一个非成对力。引入和讨论了一种新的力场模型，灵感来自于晶格粒子物理学中的多体势和拓扑学中的黎曼曲率。CAMEL中包含了一种曲率增强力。其次，提供了CAMEL用于无监督学习、监督学习、半监督学习/度量学习和逆向学习的公式。然后，通过与现有模型的比较，将CAMEL应用于许多基准数据集。",
    "tldr": "将降维问题建模为机械/物理模型，引入曲率增强力的曲率增强流形嵌入与学习（CAMEL）方法提供了一种新的方法来捕捉数据集的n维流形表示。",
    "en_tdlr": "Modeling the dimension reduction problem as a mechanistic/physics model, the Curvature-Augmented Manifold Embedding and Learning (CAMEL) method with curvature-enhanced force introduces a novel approach to capture the n-dimensional manifold representation of datasets."
}