{
    "title": "Large Language Model-Based Evolutionary Optimizer: Reasoning with elitism",
    "abstract": "arXiv:2403.02054v1 Announce Type: new  Abstract: Large Language Models (LLMs) have demonstrated remarkable reasoning abilities, prompting interest in their application as black-box optimizers. This paper asserts that LLMs possess the capability for zero-shot optimization across diverse scenarios, including multi-objective and high-dimensional problems. We introduce a novel population-based method for numerical optimization using LLMs called Language-Model-Based Evolutionary Optimizer (LEO). Our hypothesis is supported through numerical examples, spanning benchmark and industrial engineering problems such as supersonic nozzle shape optimization, heat transfer, and windfarm layout optimization. We compare our method to several gradient-based and gradient-free optimization approaches. While LLMs yield comparable results to state-of-the-art methods, their imaginative nature and propensity to hallucinate demand careful handling. We provide practical guidelines for obtaining reliable answers",
    "link": "https://arxiv.org/abs/2403.02054",
    "context": "Title: Large Language Model-Based Evolutionary Optimizer: Reasoning with elitism\nAbstract: arXiv:2403.02054v1 Announce Type: new  Abstract: Large Language Models (LLMs) have demonstrated remarkable reasoning abilities, prompting interest in their application as black-box optimizers. This paper asserts that LLMs possess the capability for zero-shot optimization across diverse scenarios, including multi-objective and high-dimensional problems. We introduce a novel population-based method for numerical optimization using LLMs called Language-Model-Based Evolutionary Optimizer (LEO). Our hypothesis is supported through numerical examples, spanning benchmark and industrial engineering problems such as supersonic nozzle shape optimization, heat transfer, and windfarm layout optimization. We compare our method to several gradient-based and gradient-free optimization approaches. While LLMs yield comparable results to state-of-the-art methods, their imaginative nature and propensity to hallucinate demand careful handling. We provide practical guidelines for obtaining reliable answers",
    "path": "papers/24/03/2403.02054.json",
    "total_tokens": 856,
    "translated_title": "基于大型语言模型的进化优化器：精英主义推理",
    "translated_abstract": "大型语言模型(LLMs)显示出出色的推理能力，引起人们对其作为黑盒优化器的应用的兴趣。本文声称LLMs具有在各种场景下进行零-shot优化的能力，包括多目标和高维问题。我们介绍了一种使用LLMs进行数值优化的新型基于种群的方法，称为基于语言模型的进化优化器(LEO)。通过跨基准和工业工程问题的数值示例，如超音速喷管形状优化、热传递和风场布局优化，支持了我们的假设。我们将我们的方法与几种基于梯度和无梯度的优化方法进行了比较。虽然LLMs产生的结果与最先进的方法相当，但它们的想像能力和产生幻觉的倾向需要谨慎处理。我们提供了获得可靠答案的实用指南。",
    "tldr": "LEO是一种基于大型语言模型的进化优化器，具有零-shot优化能力，在多目标和高维问题上表现出色，与最先进方法产生可比较的结果，但其想象力和幻觉倾向需要谨慎处理。"
}