{
    "title": "ECRC: Emotion-Causality Recognition in Korean Conversation for GCN",
    "abstract": "arXiv:2403.10764v1 Announce Type: cross  Abstract: In this multi-task learning study on simultaneous analysis of emotions and their underlying causes in conversational contexts, deep neural network methods were employed to effectively process and train large labeled datasets. However, these approaches are typically limited to conducting context analyses across the entire corpus because they rely on one of the two methods: word- or sentence-level embedding. The former struggles with polysemy and homonyms, whereas the latter causes information loss when processing long sentences. In this study, we overcome the limitations of previous embeddings by utilizing both word- and sentence-level embeddings. Furthermore, we propose the emotion-causality recognition in conversation (ECRC) model, which is based on a novel graph structure, thereby leveraging the strengths of both embedding methods. This model uniquely integrates the bidirectional long short-term memory (Bi-LSTM) and graph neural netw",
    "link": "https://arxiv.org/abs/2403.10764",
    "context": "Title: ECRC: Emotion-Causality Recognition in Korean Conversation for GCN\nAbstract: arXiv:2403.10764v1 Announce Type: cross  Abstract: In this multi-task learning study on simultaneous analysis of emotions and their underlying causes in conversational contexts, deep neural network methods were employed to effectively process and train large labeled datasets. However, these approaches are typically limited to conducting context analyses across the entire corpus because they rely on one of the two methods: word- or sentence-level embedding. The former struggles with polysemy and homonyms, whereas the latter causes information loss when processing long sentences. In this study, we overcome the limitations of previous embeddings by utilizing both word- and sentence-level embeddings. Furthermore, we propose the emotion-causality recognition in conversation (ECRC) model, which is based on a novel graph structure, thereby leveraging the strengths of both embedding methods. This model uniquely integrates the bidirectional long short-term memory (Bi-LSTM) and graph neural netw",
    "path": "papers/24/03/2403.10764.json",
    "total_tokens": 747,
    "translated_title": "韩国会话中情绪因果识别的图卷积网络研究",
    "translated_abstract": "在这项多任务学习研究中，我们同时分析了会话环境中的情感及其潜在原因，采用深度神经网络方法有效处理和训练大规模的标记数据集。我们克服了以往嵌入方法的局限性，利用了单词级和句子级嵌入。此外，我们提出了基于新颖图结构的情绪因果识别模型（ECRC），从而借鉴了两种嵌入方法的优势。该模型独特地集成了双向长短期记忆（Bi-LSTM）和图神经网络。",
    "tldr": "本研究提出了ECRC模型，通过结合单词级和句子级嵌入，以及基于新颖图结构的方法，在韩国会话环境中进行情绪因果识别研究。"
}