{
    "title": "Study of the Impact of the Big Data Era on Accounting and Auditing",
    "abstract": "arXiv:2403.07180v1 Announce Type: new  Abstract: Big data revolutionizes accounting and auditing, offering deep insights but also introducing challenges like data privacy and security. With data from IoT, social media, and transactions, traditional practices are evolving. Professionals must adapt to these changes, utilizing AI and machine learning for efficient data analysis and anomaly detection. Key to overcoming these challenges are enhanced analytics tools, continuous learning, and industry collaboration. By addressing these areas, the accounting and auditing fields can harness big data's potential while ensuring accuracy, transparency, and integrity in financial reporting. Keywords: Big Data, Accounting, Audit, Data Privacy, AI, Machine Learning, Transparency.",
    "link": "https://arxiv.org/abs/2403.07180",
    "context": "Title: Study of the Impact of the Big Data Era on Accounting and Auditing\nAbstract: arXiv:2403.07180v1 Announce Type: new  Abstract: Big data revolutionizes accounting and auditing, offering deep insights but also introducing challenges like data privacy and security. With data from IoT, social media, and transactions, traditional practices are evolving. Professionals must adapt to these changes, utilizing AI and machine learning for efficient data analysis and anomaly detection. Key to overcoming these challenges are enhanced analytics tools, continuous learning, and industry collaboration. By addressing these areas, the accounting and auditing fields can harness big data's potential while ensuring accuracy, transparency, and integrity in financial reporting. Keywords: Big Data, Accounting, Audit, Data Privacy, AI, Machine Learning, Transparency.",
    "path": "papers/24/03/2403.07180.json",
    "total_tokens": 717,
    "translated_title": "大数据时代对会计和审计的影响研究",
    "translated_abstract": "大数据革新了会计和审计，提供了深刻的见解，同时也带来了诸如数据隐私和安全等挑战。随着来自物联网、社交媒体和交易的数据，传统实践正在发生变化。专业人士必须适应这些变化，利用人工智能和机器学习进行高效的数据分析和异常检测。克服这些挑战的关键在于增强的分析工具、持续学习和行业合作。通过解决这些领域，会计和审计领域可以利用大数据的潜力，同时确保财务报告的准确性、透明度和完整性。",
    "tldr": "大数据革新了会计和审计领域，专业人士需要利用人工智能和机器学习进行数据分析和异常检测，以确保财务报告的准确性和透明度。",
    "en_tdlr": "The big data revolutionizes the fields of accounting and auditing, requiring professionals to utilize AI and machine learning for data analysis and anomaly detection to ensure accuracy and transparency in financial reporting."
}