{
    "title": "Large Language Models as Financial Data Annotators: A Study on Effectiveness and Efficiency",
    "abstract": "arXiv:2403.18152v1 Announce Type: new  Abstract: Collecting labeled datasets in finance is challenging due to scarcity of domain experts and higher cost of employing them. While Large Language Models (LLMs) have demonstrated remarkable performance in data annotation tasks on general domain datasets, their effectiveness on domain specific datasets remains underexplored. To address this gap, we investigate the potential of LLMs as efficient data annotators for extracting relations in financial documents. We compare the annotations produced by three LLMs (GPT-4, PaLM 2, and MPT Instruct) against expert annotators and crowdworkers. We demonstrate that the current state-of-the-art LLMs can be sufficient alternatives to non-expert crowdworkers. We analyze models using various prompts and parameter settings and find that customizing the prompts for each relation group by providing specific examples belonging to those groups is paramount. Furthermore, we introduce a reliability index (LLM-RelI",
    "link": "https://arxiv.org/abs/2403.18152",
    "context": "Title: Large Language Models as Financial Data Annotators: A Study on Effectiveness and Efficiency\nAbstract: arXiv:2403.18152v1 Announce Type: new  Abstract: Collecting labeled datasets in finance is challenging due to scarcity of domain experts and higher cost of employing them. While Large Language Models (LLMs) have demonstrated remarkable performance in data annotation tasks on general domain datasets, their effectiveness on domain specific datasets remains underexplored. To address this gap, we investigate the potential of LLMs as efficient data annotators for extracting relations in financial documents. We compare the annotations produced by three LLMs (GPT-4, PaLM 2, and MPT Instruct) against expert annotators and crowdworkers. We demonstrate that the current state-of-the-art LLMs can be sufficient alternatives to non-expert crowdworkers. We analyze models using various prompts and parameter settings and find that customizing the prompts for each relation group by providing specific examples belonging to those groups is paramount. Furthermore, we introduce a reliability index (LLM-RelI",
    "path": "papers/24/03/2403.18152.json",
    "total_tokens": 876,
    "translated_title": "大型语言模型作为金融数据标注员：有效性和效率研究",
    "translated_abstract": "在金融领域收集带标签的数据集具有挑战性，因为领域专家稀缺且雇佣他们的成本较高。尽管大型语言模型（LLMs）在一般领域数据集的数据标注任务中表现出色，但它们在特定领域数据集上的有效性仍未得到充分探讨。为了填补这一空白，我们研究了LLMs作为金融文档中提取关系的高效数据标注员的潜力。我们将三个LLMs（GPT-4、PaLM 2和MPT Instruct）生成的标注与专家标注员和众包工作者进行比较。我们证明当前最先进的LLMs可以作为非专家众包工作者的合适替代品。我们使用各种提示和参数设置对模型进行分析，并发现为每个关系组定制提示，通过提供属于那些组的具体示例是至关重要的。此外，我们引入了一个可靠性指数（LLM-RelI）。",
    "tldr": "大型语言模型在金融数据标注方面表现出显著的效率，可以作为非专家标注员的替代品，关键在于定制化提示和特定示例。",
    "en_tdlr": "Large language models show remarkable efficiency in financial data annotation, serving as viable alternatives to non-expert annotators, with a focus on customized prompts and specific examples."
}