{
    "title": "From Paper to Card: Transforming Design Implications with Generative AI",
    "abstract": "arXiv:2403.08137v1 Announce Type: cross  Abstract: Communicating design implications is common within the HCI community when publishing academic papers, yet these papers are rarely read and used by designers. One solution is to use design cards as a form of translational resource that communicates valuable insights from papers in a more digestible and accessible format to assist in design processes. However, creating design cards can be time-consuming, and authors may lack the resources/know-how to produce cards. Through an iterative design process, we built a system that helps create design cards from academic papers using an LLM and text-to-image model. Our evaluation with designers (N=21) and authors of selected papers (N=12) revealed that designers perceived the design implications from our design cards as more inspiring and generative, compared to reading original paper texts, and the authors viewed our system as an effective way of communicating their design implications. We also",
    "link": "https://arxiv.org/abs/2403.08137",
    "context": "Title: From Paper to Card: Transforming Design Implications with Generative AI\nAbstract: arXiv:2403.08137v1 Announce Type: cross  Abstract: Communicating design implications is common within the HCI community when publishing academic papers, yet these papers are rarely read and used by designers. One solution is to use design cards as a form of translational resource that communicates valuable insights from papers in a more digestible and accessible format to assist in design processes. However, creating design cards can be time-consuming, and authors may lack the resources/know-how to produce cards. Through an iterative design process, we built a system that helps create design cards from academic papers using an LLM and text-to-image model. Our evaluation with designers (N=21) and authors of selected papers (N=12) revealed that designers perceived the design implications from our design cards as more inspiring and generative, compared to reading original paper texts, and the authors viewed our system as an effective way of communicating their design implications. We also",
    "path": "papers/24/03/2403.08137.json",
    "total_tokens": 795,
    "translated_title": "从论文到卡片：利用生成人工智能改变设计启示",
    "translated_abstract": "交流设计启示在人机交互领域中发表学术论文时很常见，然而这些论文很少被设计师们阅读和使用。一种解决方案是使用设计卡片作为一种翻译资源，以更易消化和获取的方式传达论文中的有价值见解，以协助设计过程。然而，创建设计卡片可能耗时，而作者可能缺乏制作卡片的资源和知识。通过迭代设计过程，我们构建了一个系统，使用LLM和文本转图像模型从学术论文中帮助创建设计卡片。我们对设计师（N=21）和所选论文的作者（N=12）进行的评估显示，设计师认为我们设计卡片中的设计启示比阅读原始论文文本更具启发性和生成性，而作者则认为我们的系统是传达他们设计启示的有效方式。",
    "tldr": "使用生成人工智能构建系统，从学术论文中创建设计卡片，帮助设计师更好理解设计启示并提高沟通效率。"
}