{
    "title": "Computational Models to Study Language Processing in the Human Brain: A Survey",
    "abstract": "arXiv:2403.13368v1 Announce Type: new  Abstract: Despite differing from the human language processing mechanism in implementation and algorithms, current language models demonstrate remarkable human-like or surpassing language capabilities. Should computational language models be employed in studying the brain, and if so, when and how? To delve into this topic, this paper reviews efforts in using computational models for brain research, highlighting emerging trends. To ensure a fair comparison, the paper evaluates various computational models using consistent metrics on the same dataset. Our analysis reveals that no single model outperforms others on all datasets, underscoring the need for rich testing datasets and rigid experimental control to draw robust conclusions in studies involving computational models.",
    "link": "https://arxiv.org/abs/2403.13368",
    "context": "Title: Computational Models to Study Language Processing in the Human Brain: A Survey\nAbstract: arXiv:2403.13368v1 Announce Type: new  Abstract: Despite differing from the human language processing mechanism in implementation and algorithms, current language models demonstrate remarkable human-like or surpassing language capabilities. Should computational language models be employed in studying the brain, and if so, when and how? To delve into this topic, this paper reviews efforts in using computational models for brain research, highlighting emerging trends. To ensure a fair comparison, the paper evaluates various computational models using consistent metrics on the same dataset. Our analysis reveals that no single model outperforms others on all datasets, underscoring the need for rich testing datasets and rigid experimental control to draw robust conclusions in studies involving computational models.",
    "path": "papers/24/03/2403.13368.json",
    "total_tokens": 787,
    "translated_title": "用于研究人脑语言处理的计算模型：一项调研",
    "translated_abstract": "尽管在实现和算法上与人类语言处理机制存在差异，但当前的语言模型展示出引人入胜的人类化或超越人类的语言能力。计算语言模型是否应该用于研究大脑，如果是，则何时以及如何？为了深入探讨这个话题，本文回顾了利用计算模型进行大脑研究的努力，突显新兴趋势。为了确保公正比较，本文使用相同数据集上的一致度量评估了各种计算模型。我们的分析显示，没有一个单一模型在所有数据集上表现优于其他模型，强调了在涉及计算模型的研究中绘制健壮结论的需要使用丰富的测试数据集和严格的实验对照。",
    "tldr": "当前语言模型表现出人类化或超越人类的语言能力，研究发现没有一个单一模型在所有数据集上表现优于其他模型，强调了用于涉及计算模型的研究中绘制健壮结论的需要。",
    "en_tdlr": "Current language models demonstrate human-like or surpass language capabilities, and the research finds that no single model outperforms others on all datasets, highlighting the need for robust conclusions in studies involving computational models."
}