{
    "title": "LitSim: Conflict-aware Policy for Long-term Interactive Traffic Simulation",
    "abstract": "arXiv:2403.04299v1 Announce Type: cross  Abstract: Simulation is pivotal in evaluating the performance of autonomous driving systems due to the advantages in efficiency and cost compared to on-road testing. Realistic multi-agent behavior~(e.g., interactive and long-term) is needed to narrow the gap between the simulation and the reality. The existing work has the following shortcomings in achieving this goal:~(1) log replay offers realistic scenarios but leads to unrealistic collisions due to lacking dynamic interactions, and~(2) model-based and learning-based solutions encourage interactions but often deviate from real-world data in long horizons. In this work, we propose LitSim, a long-term interactive simulation approach that maximizes realism while avoiding unrealistic collisions. Specifically, we replay the log for most scenarios and intervene only when LitSim predicts unrealistic conflicts. We then encourage interactions among the agents and resolve the conflicts, thereby reducin",
    "link": "https://arxiv.org/abs/2403.04299",
    "context": "Title: LitSim: Conflict-aware Policy for Long-term Interactive Traffic Simulation\nAbstract: arXiv:2403.04299v1 Announce Type: cross  Abstract: Simulation is pivotal in evaluating the performance of autonomous driving systems due to the advantages in efficiency and cost compared to on-road testing. Realistic multi-agent behavior~(e.g., interactive and long-term) is needed to narrow the gap between the simulation and the reality. The existing work has the following shortcomings in achieving this goal:~(1) log replay offers realistic scenarios but leads to unrealistic collisions due to lacking dynamic interactions, and~(2) model-based and learning-based solutions encourage interactions but often deviate from real-world data in long horizons. In this work, we propose LitSim, a long-term interactive simulation approach that maximizes realism while avoiding unrealistic collisions. Specifically, we replay the log for most scenarios and intervene only when LitSim predicts unrealistic conflicts. We then encourage interactions among the agents and resolve the conflicts, thereby reducin",
    "path": "papers/24/03/2403.04299.json",
    "total_tokens": 897,
    "translated_title": "LitSim：长期交互式交通仿真的冲突感知策略",
    "translated_abstract": "模拟对于评估自动驾驶系统的性能至关重要，因为与在道路测试相比，模拟具有效率和成本优势。需要真实的多智能体行为（例如交互式和长期行为）来缩小模拟与现实之间的差距。现有工作在实现这一目标方面存在以下缺点：（1）日志重播提供了逼真的场景，但由于缺乏动态交互而导致了不真实的碰撞，以及（2）基于模型和基于学习的解决方案鼓励交互，但在长时间范围内往往偏离真实世界的数据。在这项工作中，我们提出了LitSim，一种长期交互式仿真方法，旨在最大程度地增加逼真性，同时避免不真实的碰撞。具体而言，我们为大多数情况重播日志，只有在LitSim预测到不真实冲突时才进行干预。然后我们鼓励智能体之间的交互并解决冲突，从而减少",
    "tldr": "LitSim提出了一种长期交互式仿真方法，重播日志以获得逼真场景，当出现不真实冲突时进行干预，从而提高仿真逼真度并避免碰撞",
    "en_tdlr": "LitSim proposes a long-term interactive simulation method that replays logs to obtain realistic scenarios, intervenes when unrealistic conflicts occur, thus improving simulation realism and avoiding collisions."
}