{
    "title": "Physics-informed generative model for drug-like molecule conformers",
    "abstract": "arXiv:2403.07925v1 Announce Type: cross  Abstract: We present a diffusion-based, generative model for conformer generation. Our model is focused on the reproduction of bonded structure and is constructed from the associated terms traditionally found in classical force fields to ensure a physically relevant representation. Techniques in deep learning are used to infer atom typing and geometric parameters from a training set. Conformer sampling is achieved by taking advantage of recent advancements in diffusion-based generation. By training on large, synthetic data sets of diverse, drug-like molecules optimized with the semiempirical GFN2-xTB method, high accuracy is achieved for bonded parameters, exceeding that of conventional, knowledge-based methods. Results are also compared to experimental structures from the Protein Databank (PDB) and Cambridge Structural Database (CSD).",
    "link": "https://arxiv.org/abs/2403.07925",
    "context": "Title: Physics-informed generative model for drug-like molecule conformers\nAbstract: arXiv:2403.07925v1 Announce Type: cross  Abstract: We present a diffusion-based, generative model for conformer generation. Our model is focused on the reproduction of bonded structure and is constructed from the associated terms traditionally found in classical force fields to ensure a physically relevant representation. Techniques in deep learning are used to infer atom typing and geometric parameters from a training set. Conformer sampling is achieved by taking advantage of recent advancements in diffusion-based generation. By training on large, synthetic data sets of diverse, drug-like molecules optimized with the semiempirical GFN2-xTB method, high accuracy is achieved for bonded parameters, exceeding that of conventional, knowledge-based methods. Results are also compared to experimental structures from the Protein Databank (PDB) and Cambridge Structural Database (CSD).",
    "path": "papers/24/03/2403.07925.json",
    "total_tokens": 762,
    "translated_title": "物理信息生成模型用于类药分子构象",
    "translated_abstract": "我们提出了一个基于扩散的生成模型，用于构象生成。我们的模型侧重于重现成键结构，并且是从传统力场中通常找到的相关项构建的，以确保物理相关性表示。深度学习技术被用来从训练集中推断出原子类型和几何参数。通过利用最近在扩散生成方面的进展实现构象采样。通过对大型的、多样化的、类药分子的合成数据集进行训练，优化了半经验GFN2-xTB方法，实现了对成键参数的高精度预测，超过了传统的基于知识的方法。结果还与蛋白质数据库（PDB）和剑桥结构数据库（CSD）中的实验结构进行了比较。",
    "tldr": "该模型基于扩散生成，结合深度学习技术从大型数据集中推断原子类型和几何参数，实现了类药分子构象的高精度生成，优于传统方法。",
    "en_tdlr": "The model utilizes diffusion-based generation and deep learning techniques to infer atomic types and geometric parameters from large datasets, achieving high-accuracy generation of drug-like molecule conformers, surpassing conventional methods."
}