{
    "title": "Simple Multigraph Convolution Networks",
    "abstract": "arXiv:2403.05014v1 Announce Type: cross  Abstract: Existing multigraph convolution methods either ignore the cross-view interaction among multiple graphs, or induce extremely high computational cost due to standard cross-view polynomial operators. To alleviate this problem, this paper proposes a Simple MultiGraph Convolution Networks (SMGCN) which first extracts consistent cross-view topology from multigraphs including edge-level and subgraph-level topology, then performs polynomial expansion based on raw multigraphs and consistent topologies. In theory, SMGCN utilizes the consistent topologies in polynomial expansion rather than standard cross-view polynomial expansion, which performs credible cross-view spatial message-passing, follows the spectral convolution paradigm, and effectively reduces the complexity of standard polynomial expansion. In the simulations, experimental results demonstrate that SMGCN achieves state-of-the-art performance on ACM and DBLP multigraph benchmark datas",
    "link": "https://arxiv.org/abs/2403.05014",
    "context": "Title: Simple Multigraph Convolution Networks\nAbstract: arXiv:2403.05014v1 Announce Type: cross  Abstract: Existing multigraph convolution methods either ignore the cross-view interaction among multiple graphs, or induce extremely high computational cost due to standard cross-view polynomial operators. To alleviate this problem, this paper proposes a Simple MultiGraph Convolution Networks (SMGCN) which first extracts consistent cross-view topology from multigraphs including edge-level and subgraph-level topology, then performs polynomial expansion based on raw multigraphs and consistent topologies. In theory, SMGCN utilizes the consistent topologies in polynomial expansion rather than standard cross-view polynomial expansion, which performs credible cross-view spatial message-passing, follows the spectral convolution paradigm, and effectively reduces the complexity of standard polynomial expansion. In the simulations, experimental results demonstrate that SMGCN achieves state-of-the-art performance on ACM and DBLP multigraph benchmark datas",
    "path": "papers/24/03/2403.05014.json",
    "total_tokens": 843,
    "translated_title": "简单多图卷积网络",
    "translated_abstract": "现有的多图卷积方法要么忽视多个图之间的交叉视图交互，要么由于标准的交叉视图多项式运算符而导致计算成本极高。为了缓解这个问题，本文提出了一种简单的多图卷积网络（SMGCN），它首先从多图中提取一致的交叉视图拓扑，包括边级和子图级拓扑，然后基于原始多图和一致的拓扑执行多项式展开。在理论上，SMGCN利用一致的拓扑进行多项式展开，而不是标准的交叉视图多项式展开，从而执行可信的交叉视图空间消息传递，遵循谱卷积范式，并有效降低标准多项式展开的复杂度。在模拟实验中，实验结果表明SMGCN在ACM和DBLP多图基准数据上实现了最先进的性能。",
    "tldr": "本文提出了一种简单的多图卷积网络（SMGCN），通过提取一致的交叉视图拓扑和执行多项式展开，有效降低了多图卷积的复杂度，实现了可信的交叉视图空间消息传递。",
    "en_tdlr": "This paper introduces a Simple Multigraph Convolution Network (SMGCN) that reduces the complexity of multigraph convolution by extracting consistent cross-view topology and performing polynomial expansion, achieving credible cross-view spatial message-passing."
}