{
    "title": "Slot Abstractors: Toward Scalable Abstract Visual Reasoning",
    "abstract": "arXiv:2403.03458v1 Announce Type: cross  Abstract: Abstract visual reasoning is a characteristically human ability, allowing the identification of relational patterns that are abstracted away from object features, and the systematic generalization of those patterns to unseen problems. Recent work has demonstrated strong systematic generalization in visual reasoning tasks involving multi-object inputs, through the integration of slot-based methods used for extracting object-centric representations coupled with strong inductive biases for relational abstraction. However, this approach was limited to problems containing a single rule, and was not scalable to visual reasoning problems containing a large number of objects. Other recent work proposed Abstractors, an extension of Transformers that incorporates strong relational inductive biases, thereby inheriting the Transformer's scalability and multi-head architecture, but it has yet to be demonstrated how this approach might be applied to",
    "link": "https://arxiv.org/abs/2403.03458",
    "context": "Title: Slot Abstractors: Toward Scalable Abstract Visual Reasoning\nAbstract: arXiv:2403.03458v1 Announce Type: cross  Abstract: Abstract visual reasoning is a characteristically human ability, allowing the identification of relational patterns that are abstracted away from object features, and the systematic generalization of those patterns to unseen problems. Recent work has demonstrated strong systematic generalization in visual reasoning tasks involving multi-object inputs, through the integration of slot-based methods used for extracting object-centric representations coupled with strong inductive biases for relational abstraction. However, this approach was limited to problems containing a single rule, and was not scalable to visual reasoning problems containing a large number of objects. Other recent work proposed Abstractors, an extension of Transformers that incorporates strong relational inductive biases, thereby inheriting the Transformer's scalability and multi-head architecture, but it has yet to be demonstrated how this approach might be applied to",
    "path": "papers/24/03/2403.03458.json",
    "total_tokens": 761,
    "translated_title": "槽抽象化器：迈向可扩展的抽象视觉推理",
    "translated_abstract": "抽象视觉推理是一种人类特有的能力，允许识别从对象特征中抽象出的关系模式，并将这些模式系统化地推广到未曾见过的问题。最近的研究表明，在涉及多个对象输入的视觉推理任务中，通过使用基于槽的方法提取以对象为中心的表示并具有强归纳偏见的关系抽象，实现了强大的系统化推广。然而，这种方法仅限于包含单一规则的问题，并且不适用于包含大量对象的视觉推理问题。其他最近的工作提出了抽象化器，这是Transformer的扩展，融合了强大的关系归纳偏见，从而继承了Transformer的可扩展性和多头架构，但尚未展示如何将此方法应用到",
    "tldr": "提出了槽抽象化器，结合槽方法和关系归纳偏见，实现了可扩展的抽象视觉推理。",
    "en_tdlr": "Introducing slot abstractors that combine slot-based methods and relational inductive biases to achieve scalable abstract visual reasoning."
}