{
    "title": "D-PAD: Deep-Shallow Multi-Frequency Patterns Disentangling for Time Series Forecasting",
    "abstract": "arXiv:2403.17814v1 Announce Type: new  Abstract: In time series forecasting, effectively disentangling intricate temporal patterns is crucial. While recent works endeavor to combine decomposition techniques with deep learning, multiple frequencies may still be mixed in the decomposed components, e.g., trend and seasonal. Furthermore, frequency domain analysis methods, e.g., Fourier and wavelet transforms, have limitations in resolution in the time domain and adaptability. In this paper, we propose D-PAD, a deep-shallow multi-frequency patterns disentangling neural network for time series forecasting. Specifically, a multi-component decomposing (MCD) block is introduced to decompose the series into components with different frequency ranges, corresponding to the \"shallow\" aspect. A decomposition-reconstruction-decomposition (D-R-D) module is proposed to progressively extract the information of frequencies mixed in the components, corresponding to the \"deep\" aspect. After that, an intera",
    "link": "https://arxiv.org/abs/2403.17814",
    "context": "Title: D-PAD: Deep-Shallow Multi-Frequency Patterns Disentangling for Time Series Forecasting\nAbstract: arXiv:2403.17814v1 Announce Type: new  Abstract: In time series forecasting, effectively disentangling intricate temporal patterns is crucial. While recent works endeavor to combine decomposition techniques with deep learning, multiple frequencies may still be mixed in the decomposed components, e.g., trend and seasonal. Furthermore, frequency domain analysis methods, e.g., Fourier and wavelet transforms, have limitations in resolution in the time domain and adaptability. In this paper, we propose D-PAD, a deep-shallow multi-frequency patterns disentangling neural network for time series forecasting. Specifically, a multi-component decomposing (MCD) block is introduced to decompose the series into components with different frequency ranges, corresponding to the \"shallow\" aspect. A decomposition-reconstruction-decomposition (D-R-D) module is proposed to progressively extract the information of frequencies mixed in the components, corresponding to the \"deep\" aspect. After that, an intera",
    "path": "papers/24/03/2403.17814.json",
    "total_tokens": 737,
    "translated_title": "D-PAD: 深浅层多频模式解缠用于时间序列预测",
    "translated_abstract": "在时间序列预测中，有效解缠复杂的时间模式至关重要。本文提出了D-PAD，这是一个用于时间序列预测的深浅层多频模式解缠神经网络。具体而言，引入了多分量分解（MCD）模块将时间序列分解为具有不同频率范围的组分，对应于“浅”方面。同时提出了一个分解-重构-分解（D-R-D）模块，逐渐提取组分中混合的频率信息，对应于“深”方面。",
    "tldr": "D-PAD 提出了一个深浅层多频模式解缠神经网络，通过多分量分解和分解-重构-分解模块，有效解缠时间序列中的复杂时间模式。",
    "en_tdlr": "D-PAD proposes a deep-shallow multi-frequency patterns disentangling neural network for time series forecasting, effectively untangling intricate temporal patterns through multi-component decomposition and decomposition-reconstruction-decomposition module."
}