{
    "title": "NLP for Counterspeech against Hate: A Survey and How-To Guide",
    "abstract": "arXiv:2403.20103v1 Announce Type: new  Abstract: In recent years, counterspeech has emerged as one of the most promising strategies to fight online hate. These non-escalatory responses tackle online abuse while preserving the freedom of speech of the users, and can have a tangible impact in reducing online and offline violence. Recently, there has been growing interest from the Natural Language Processing (NLP) community in addressing the challenges of analysing, collecting, classifying, and automatically generating counterspeech, to reduce the huge burden of manually producing it. In particular, researchers have taken different directions in addressing these challenges, thus providing a variety of related tasks and resources. In this paper, we provide a guide for doing research on counterspeech, by describing - with detailed examples - the steps to undertake, and providing best practices that can be learnt from the NLP studies on this topic. Finally, we discuss open challenges and fut",
    "link": "https://arxiv.org/abs/2403.20103",
    "context": "Title: NLP for Counterspeech against Hate: A Survey and How-To Guide\nAbstract: arXiv:2403.20103v1 Announce Type: new  Abstract: In recent years, counterspeech has emerged as one of the most promising strategies to fight online hate. These non-escalatory responses tackle online abuse while preserving the freedom of speech of the users, and can have a tangible impact in reducing online and offline violence. Recently, there has been growing interest from the Natural Language Processing (NLP) community in addressing the challenges of analysing, collecting, classifying, and automatically generating counterspeech, to reduce the huge burden of manually producing it. In particular, researchers have taken different directions in addressing these challenges, thus providing a variety of related tasks and resources. In this paper, we provide a guide for doing research on counterspeech, by describing - with detailed examples - the steps to undertake, and providing best practices that can be learnt from the NLP studies on this topic. Finally, we discuss open challenges and fut",
    "path": "papers/24/03/2403.20103.json",
    "total_tokens": 873,
    "translated_title": "NLP用于对抗仇恨的言论：调查与实用指南",
    "translated_abstract": "近年来，反言论已经成为打击网络仇恨的最有前途的策略之一。这些非升级回应处理在线虐待行为的同时保留用户的言论自由，并且在减少在线和离线暴力方面可以产生切实影响。最近，自然语言处理（NLP）社区对分析、收集、分类和自动生成反言论的挑战表现出越来越浓厚的兴趣，以减轻手动生产的巨大负担。特别是，研究人员在解决这些挑战方面采取了不同的方向，因此提供了各种相关任务和资源。在本文中，我们通过详细示例描述了研究反言论的步骤，并提供了可以从这个主题的NLP研究中学到的最佳实践，为研究反言论提供一个指南。最后，我们讨论了存在的挑战和未来。",
    "tldr": "反言论作为一种非升级回应策略，可以有效减少在线和离线暴力，最近NLP社区对于分析、收集、分类和自动生成反言论的挑战表现出越来越浓厚的兴趣。"
}