{
    "title": "Fast and Unified Path Gradient Estimators for Normalizing Flows",
    "abstract": "arXiv:2403.15881v1 Announce Type: new  Abstract: Recent work shows that path gradient estimators for normalizing flows have lower variance compared to standard estimators for variational inference, resulting in improved training. However, they are often prohibitively more expensive from a computational point of view and cannot be applied to maximum likelihood training in a scalable manner, which severely hinders their widespread adoption. In this work, we overcome these crucial limitations. Specifically, we propose a fast path gradient estimator which improves computational efficiency significantly and works for all normalizing flow architectures of practical relevance. We then show that this estimator can also be applied to maximum likelihood training for which it has a regularizing effect as it can take the form of a given target energy function into account. We empirically establish its superior performance and reduced variance for several natural sciences applications.",
    "link": "https://arxiv.org/abs/2403.15881",
    "context": "Title: Fast and Unified Path Gradient Estimators for Normalizing Flows\nAbstract: arXiv:2403.15881v1 Announce Type: new  Abstract: Recent work shows that path gradient estimators for normalizing flows have lower variance compared to standard estimators for variational inference, resulting in improved training. However, they are often prohibitively more expensive from a computational point of view and cannot be applied to maximum likelihood training in a scalable manner, which severely hinders their widespread adoption. In this work, we overcome these crucial limitations. Specifically, we propose a fast path gradient estimator which improves computational efficiency significantly and works for all normalizing flow architectures of practical relevance. We then show that this estimator can also be applied to maximum likelihood training for which it has a regularizing effect as it can take the form of a given target energy function into account. We empirically establish its superior performance and reduced variance for several natural sciences applications.",
    "path": "papers/24/03/2403.15881.json",
    "total_tokens": 822,
    "translated_title": "快速统一的路径梯度估计器用于归一化流",
    "translated_abstract": "最近的研究表明，归一化流的路径梯度估计器与变分推断的标准估计器相比具有更低的方差，从而改善了训练。然而，从计算角度看，它们往往昂贵且无法以可扩展的方式应用于最大似然训练，严重阻碍了它们的广泛采用。在这项工作中，我们克服了这些关键限制。具体来说，我们提出了一种快速路径梯度估计器，显著提高了计算效率，并适用于所有实用的归一化流架构。然后，我们证明该估计器也可以应用于最大似然训练，对此具有正则化效果，因为它可以考虑给定目标能量函数的形式。我们凭经验证明其在多个自然科学应用中表现卓越，并减小了方差。",
    "tldr": "提出了一种快速路径梯度估计器，显著提高了计算效率，并适用于所有实用的归一化流架构，具有正则化效果并减小了方差。"
}