{
    "title": "Path-GPTOmic: A Balanced Multi-modal Learning Framework for Survival Outcome Prediction",
    "abstract": "arXiv:2403.11375v1 Announce Type: cross  Abstract: For predicting cancer survival outcomes, standard approaches in clinical research are often based on two main modalities: pathology images for observing cell morphology features, and genomic (e.g., bulk RNA-seq) for quantifying gene expressions. However, existing pathology-genomic multi-modal algorithms face significant challenges: (1) Valuable biological insights regarding genes and gene-gene interactions are frequently overlooked; (2) one modality often dominates the optimization process, causing inadequate training for the other modality. In this paper, we introduce a new multi-modal ``Path-GPTOmic\" framework for cancer survival outcome prediction. First, to extract valuable biological insights, we regulate the embedding space of a foundation model, scGPT, initially trained on single-cell RNA-seq data, making it adaptable for bulk RNA-seq data. Second, to address the imbalance-between-modalities problem, we propose a gradient modula",
    "link": "https://arxiv.org/abs/2403.11375",
    "context": "Title: Path-GPTOmic: A Balanced Multi-modal Learning Framework for Survival Outcome Prediction\nAbstract: arXiv:2403.11375v1 Announce Type: cross  Abstract: For predicting cancer survival outcomes, standard approaches in clinical research are often based on two main modalities: pathology images for observing cell morphology features, and genomic (e.g., bulk RNA-seq) for quantifying gene expressions. However, existing pathology-genomic multi-modal algorithms face significant challenges: (1) Valuable biological insights regarding genes and gene-gene interactions are frequently overlooked; (2) one modality often dominates the optimization process, causing inadequate training for the other modality. In this paper, we introduce a new multi-modal ``Path-GPTOmic\" framework for cancer survival outcome prediction. First, to extract valuable biological insights, we regulate the embedding space of a foundation model, scGPT, initially trained on single-cell RNA-seq data, making it adaptable for bulk RNA-seq data. Second, to address the imbalance-between-modalities problem, we propose a gradient modula",
    "path": "papers/24/03/2403.11375.json",
    "total_tokens": 933,
    "translated_title": "Path-GPTOmic：一种用于生存结果预测的平衡多模态学习框架",
    "translated_abstract": "为了预测癌症生存结果，临床研究中的标准方法通常基于两种主要模态：用于观察细胞形态特征的病理图像，以及用于量化基因表达的基因组学（如批量RNA测序）。然而，现有的病理基因组多模态算法面临着重大挑战：（1）有价值的关于基因和基因间相互作用的生物学见解经常被忽视；（2）一个模态通常主导优化过程，导致对另一个模态的训练不足。在本文中，我们引入了一种新的多模态“Path-GPTOmic”框架用于癌症生存预测。首先，为了提取有价值的生物学见解，我们调节基础模型scGPT的嵌入空间，该模型最初是在单细胞RNA测序数据上训练的，使其适用于批量RNA测序数据。其次，为了解决模态间不平衡问题，我们提出了一个梯度调整模型提供更好的路径遗传学技术（一种转导技术）。",
    "tldr": "Path-GPTOmic框架通过调节模型嵌入空间和提出梯度调整模型，解决了癌症生存预测中存在的病理图像和基因组学数据不平衡的问题。",
    "en_tdlr": "Path-GPTOmic framework addresses the imbalance issue between pathology images and genomic data in cancer survival prediction by regulating the model embedding space and proposing a gradient modulation model."
}