{
    "title": "Diet-ODIN: A Novel Framework for Opioid Misuse Detection with Interpretable Dietary Patterns",
    "abstract": "arXiv:2403.08820v1 Announce Type: cross  Abstract: The opioid crisis has been one of the most critical society concerns in the United States. Although the medication assisted treatment (MAT) is recognized as the most effective treatment for opioid misuse and addiction, the various side effects can trigger opioid relapse. In addition to MAT, the dietary nutrition intervention has been demonstrated its importance in opioid misuse prevention and recovery. However, research on the alarming connections between dietary patterns and opioid misuse remain under-explored. In response to this gap, in this paper, we first establish a large-scale multifaceted dietary benchmark dataset related to opioid users at the first attempt and then develop a novel framework - i.e., namely Opioid Misuse Detection with Interpretable Dietary Patterns (Diet-ODIN) - to bridge heterogeneous graph (HG) and large language model (LLM) for the identification of users with opioid misuse and the interpretation of their a",
    "link": "https://arxiv.org/abs/2403.08820",
    "context": "Title: Diet-ODIN: A Novel Framework for Opioid Misuse Detection with Interpretable Dietary Patterns\nAbstract: arXiv:2403.08820v1 Announce Type: cross  Abstract: The opioid crisis has been one of the most critical society concerns in the United States. Although the medication assisted treatment (MAT) is recognized as the most effective treatment for opioid misuse and addiction, the various side effects can trigger opioid relapse. In addition to MAT, the dietary nutrition intervention has been demonstrated its importance in opioid misuse prevention and recovery. However, research on the alarming connections between dietary patterns and opioid misuse remain under-explored. In response to this gap, in this paper, we first establish a large-scale multifaceted dietary benchmark dataset related to opioid users at the first attempt and then develop a novel framework - i.e., namely Opioid Misuse Detection with Interpretable Dietary Patterns (Diet-ODIN) - to bridge heterogeneous graph (HG) and large language model (LLM) for the identification of users with opioid misuse and the interpretation of their a",
    "path": "papers/24/03/2403.08820.json",
    "total_tokens": 914,
    "translated_title": "Diet-ODIN：一种新型框架，用于解释性膳食模式下的阿片类药物误用检测",
    "translated_abstract": "阿片类药物危机一直是美国社会最关键的问题之一。尽管药物辅助治疗（MAT）被认为是阿片类药物误用和成瘾最有效的治疗方法，但各种副作用可能引发阿片类药物再次滥用。除MAT外，膳食营养干预在防止和康复阿片类药物误用中发挥了重要作用。然而，有关膳食模式与阿片类药物误用之间令人担忧的关联的研究仍未得到充分探讨。为弥补这一空白，本文首次建立了一个与阿片类药物使用者相关的大规模多方面膳食基准数据集，并开发了一个新颖框架，即解释性膳食模式下的阿片类药物误用检测（Diet-ODIN），用于连接异质图（HG）和大型语言模型（LLM），以识别阿片类药物误用者并解释其行为。",
    "tldr": "该研究建立了一个大规模多方面的膳食数据集，提出了Diet-ODIN框架，旨在探索膳食模式与阿片类药物误用之间的关联。",
    "en_tdlr": "This study established a large-scale multifaceted dietary dataset and proposed the Diet-ODIN framework to explore the connections between dietary patterns and opioid misuse."
}