{
    "title": "Deciphering diffuse scattering with machine learning and the equivariant foundation model: The case of molten FeO",
    "abstract": "arXiv:2403.00259v1 Announce Type: cross  Abstract: Bridging the gap between diffuse x-ray or neutron scattering measurements and predicted structures derived from atom-atom pair potentials in disordered materials, has been a longstanding challenge in condensed matter physics. This perspective gives a brief overview of the traditional approaches employed over the past several decades. Namely, the use of approximate interatomic pair potentials that relate 3-dimensional structural models to the measured structure factor and its associated pair distribution function. The use of machine learned interatomic potentials has grown in the past few years, and has been particularly successful in the cases of ionic and oxide systems. Recent advances in large scale sampling, along with a direct integration of scattering measurements into the model development, has provided improved agreement between experiments and large-scale models calculated with quantum mechanical accuracy. However, details of l",
    "link": "https://arxiv.org/abs/2403.00259",
    "context": "Title: Deciphering diffuse scattering with machine learning and the equivariant foundation model: The case of molten FeO\nAbstract: arXiv:2403.00259v1 Announce Type: cross  Abstract: Bridging the gap between diffuse x-ray or neutron scattering measurements and predicted structures derived from atom-atom pair potentials in disordered materials, has been a longstanding challenge in condensed matter physics. This perspective gives a brief overview of the traditional approaches employed over the past several decades. Namely, the use of approximate interatomic pair potentials that relate 3-dimensional structural models to the measured structure factor and its associated pair distribution function. The use of machine learned interatomic potentials has grown in the past few years, and has been particularly successful in the cases of ionic and oxide systems. Recent advances in large scale sampling, along with a direct integration of scattering measurements into the model development, has provided improved agreement between experiments and large-scale models calculated with quantum mechanical accuracy. However, details of l",
    "path": "papers/24/03/2403.00259.json",
    "total_tokens": 838,
    "translated_title": "用机器学习和等变基础模型解读弥散散射：以熔融FeO为例",
    "translated_abstract": "用机器学习和等变基础模型解读弥散散射的过程对于将弥散X射线或中子散射测量和原子-原子对势预测结构在无序材料中的衔接一直是凝聚态物理学中长期面临的挑战。本文概述了过去几十年来采用的传统方法，即使用将三维结构模型与测量的结构因子及其相关的原子对分布函数相关联的近似原子间对势。近年来，机器学习的原子间势的使用已经增长，并且在离子和氧化物系统的情况下取得了特别的成功。大规模采样的最新进展，以及将散射测量直接整合到模型开发中，为实验和用量子力学精度计算的大规模模型之间提供了改善的一致性。然而，关于l",
    "tldr": "用机器学习和等变基础模型成功地解读了熔融FeO的弥散散射，提供了实验和量子力学模型之间更好的一致性",
    "en_tdlr": "Successfully deciphered the diffuse scattering of molten FeO using machine learning and the equivariant foundation model, providing improved agreement between experiments and quantum mechanical models"
}