{
    "title": "AI Sustainability in Practice Part Two: Sustainability Throughout the AI Workflow",
    "abstract": "arXiv:2403.15404v1 Announce Type: cross  Abstract: The sustainability of AI systems depends on the capacity of project teams to proceed with a continuous sensitivity to their potential real-world impacts and transformative effects. Stakeholder Impact Assessments (SIAs) are governance mechanisms that enable this kind of responsiveness. They are tools that create a procedure for, and a means of documenting, the collaborative evaluation and reflective anticipation of the possible harms and benefits of AI innovation projects. SIAs are not one-off governance actions. They require project teams to pay continuous attention to the dynamic and changing character of AI production and use and to the shifting conditions of the real-world environments in which AI technologies are embedded. This workbook is part two of two workbooks on AI Sustainability. It provides a template of the SIA and activities that allow a deeper dive into crucial parts of it. It discusses methods for weighing values and co",
    "link": "https://arxiv.org/abs/2403.15404",
    "context": "Title: AI Sustainability in Practice Part Two: Sustainability Throughout the AI Workflow\nAbstract: arXiv:2403.15404v1 Announce Type: cross  Abstract: The sustainability of AI systems depends on the capacity of project teams to proceed with a continuous sensitivity to their potential real-world impacts and transformative effects. Stakeholder Impact Assessments (SIAs) are governance mechanisms that enable this kind of responsiveness. They are tools that create a procedure for, and a means of documenting, the collaborative evaluation and reflective anticipation of the possible harms and benefits of AI innovation projects. SIAs are not one-off governance actions. They require project teams to pay continuous attention to the dynamic and changing character of AI production and use and to the shifting conditions of the real-world environments in which AI technologies are embedded. This workbook is part two of two workbooks on AI Sustainability. It provides a template of the SIA and activities that allow a deeper dive into crucial parts of it. It discusses methods for weighing values and co",
    "path": "papers/24/03/2403.15404.json",
    "total_tokens": 820,
    "translated_title": "实践中的AI可持续性第二部分：AI工作流程中的可持续性",
    "translated_abstract": "AI系统的可持续性取决于项目团队能否持续关注其潜在的现实影响和转型效应。利益相关者影响评估（SIAs）是一种治理机制，使团队能够对这种响应能力进行持续性评估。它们是一种创建程序的工具，用来记录协作评估和反思未来可能的AI创新项目的危害和好处。SIAs不是一次性的治理行动。它们要求项目团队持续关注AI生产和使用的动态和变化性质，以及AI技术嵌入的现实世界环境的变化条件。这本工作手册是关于AI可持续性的两本工作手册中的第二本。它提供了SIAs的模板和允许深入研究其中关键部分的活动。它讨论了权衡价值和协同的方法。",
    "tldr": "SIAs是一种治理机制，可以帮助AI项目团队持续关注项目的潜在实际影响，这对于实现AI系统的可持续性至关重要。",
    "en_tdlr": "SIAs are governance mechanisms that enable project teams to continuously focus on the potential real-world impacts of their AI projects, which is crucial for the sustainability of AI systems."
}