{
    "title": "Machine Learning-based Layer-wise Detection of Overheating Anomaly in LPBF using Photodiode Data",
    "abstract": "arXiv:2403.13861v1 Announce Type: new  Abstract: Overheating anomaly detection is essential for the quality and reliability of parts produced by laser powder bed fusion (LPBF) additive manufacturing (AM). In this research, we focus on the detection of overheating anomalies using photodiode sensor data. Photodiode sensors can collect high-frequency data from the melt pool, reflecting the process dynamics and thermal history. Hence, the proposed method offers a machine learning (ML) framework to utilize photodiode sensor data for layer-wise detection of overheating anomalies. In doing so, three sets of features are extracted from the raw photodiode data: MSMM (mean, standard deviation, median, maximum), MSQ (mean, standard deviation, quartiles), and MSD (mean, standard deviation, deciles). These three datasets are used to train several ML classifiers. Cost-sensitive learning is used to handle the class imbalance between the \"anomalous\" layers (affected by overheating) and \"nominal\" layer",
    "link": "https://arxiv.org/abs/2403.13861",
    "context": "Title: Machine Learning-based Layer-wise Detection of Overheating Anomaly in LPBF using Photodiode Data\nAbstract: arXiv:2403.13861v1 Announce Type: new  Abstract: Overheating anomaly detection is essential for the quality and reliability of parts produced by laser powder bed fusion (LPBF) additive manufacturing (AM). In this research, we focus on the detection of overheating anomalies using photodiode sensor data. Photodiode sensors can collect high-frequency data from the melt pool, reflecting the process dynamics and thermal history. Hence, the proposed method offers a machine learning (ML) framework to utilize photodiode sensor data for layer-wise detection of overheating anomalies. In doing so, three sets of features are extracted from the raw photodiode data: MSMM (mean, standard deviation, median, maximum), MSQ (mean, standard deviation, quartiles), and MSD (mean, standard deviation, deciles). These three datasets are used to train several ML classifiers. Cost-sensitive learning is used to handle the class imbalance between the \"anomalous\" layers (affected by overheating) and \"nominal\" layer",
    "path": "papers/24/03/2403.13861.json",
    "total_tokens": 935,
    "translated_title": "基于机器学习的利用光电二极管数据在LPBF中逐层检测过热异常",
    "translated_abstract": "过热异常检测对于激光粉床熔化成形（LPBF）增材制造（AM）所生产零件的质量和可靠性至关重要。本研究侧重于利用光电二极管传感器数据检测过热异常。光电二极管传感器可以从熔池中收集高频数据，反映出过程动态和热历史。因此，所提出的方法提供了一个机器学习（ML）框架，利用光电二极管传感器数据进行逐层检测过热异常。为此，从原始光电二极管数据中提取了三组特征：MSMM（平均值、标准差、中位数、最大值）、MSQ（平均值、标准差、四分位数）和MSD（平均值、标准差、十分位数）。这三个数据集用于训练多个ML分类器。采用成本敏感学习来处理“异常”层（受过热影响）和“正常”层之间的类别不平衡问题。",
    "tldr": "本研究提出了一种利用光电二极管数据进行逐层检测LPBF中过热异常的机器学习框架，并通过成本敏感学习处理类别不平衡问题。",
    "en_tdlr": "This research presents a machine learning framework for layer-wise detection of overheating anomalies in LPBF using photodiode data, with the application of cost-sensitive learning to address class imbalance."
}