{
    "title": "Dynamic Gaussian Graph Operator: Learning parametric partial differential equations in arbitrary discrete mechanics problems",
    "abstract": "arXiv:2403.02810v1 Announce Type: cross  Abstract: Deep learning methods have access to be employed for solving physical systems governed by parametric partial differential equations (PDEs) due to massive scientific data. It has been refined to operator learning that focuses on learning non-linear mapping between infinite-dimensional function spaces, offering interface from observations to solutions. However, state-of-the-art neural operators are limited to constant and uniform discretization, thereby leading to deficiency in generalization on arbitrary discretization schemes for computational domain. In this work, we propose a novel operator learning algorithm, referred to as Dynamic Gaussian Graph Operator (DGGO) that expands neural operators to learning parametric PDEs in arbitrary discrete mechanics problems. The Dynamic Gaussian Graph (DGG) kernel learns to map the observation vectors defined in general Euclidean space to metric vectors defined in high-dimensional uniform metric s",
    "link": "https://arxiv.org/abs/2403.02810",
    "context": "Title: Dynamic Gaussian Graph Operator: Learning parametric partial differential equations in arbitrary discrete mechanics problems\nAbstract: arXiv:2403.02810v1 Announce Type: cross  Abstract: Deep learning methods have access to be employed for solving physical systems governed by parametric partial differential equations (PDEs) due to massive scientific data. It has been refined to operator learning that focuses on learning non-linear mapping between infinite-dimensional function spaces, offering interface from observations to solutions. However, state-of-the-art neural operators are limited to constant and uniform discretization, thereby leading to deficiency in generalization on arbitrary discretization schemes for computational domain. In this work, we propose a novel operator learning algorithm, referred to as Dynamic Gaussian Graph Operator (DGGO) that expands neural operators to learning parametric PDEs in arbitrary discrete mechanics problems. The Dynamic Gaussian Graph (DGG) kernel learns to map the observation vectors defined in general Euclidean space to metric vectors defined in high-dimensional uniform metric s",
    "path": "papers/24/03/2403.02810.json",
    "total_tokens": 832,
    "translated_title": "动态高斯图算子：在任意离散力学问题中学习参数化偏微分方程",
    "translated_abstract": "深度学习方法可以用于解决由参数化偏微分方程（PDEs）控制的物理系统，因为有大量科学数据可供使用。最近，已经发展了一种操作学习方法，专注于学习无限维函数空间之间的非线性映射，提供了从观测数据到解决方案的接口。然而，最先进的神经算子仅限于恒定和均匀离散化，从而导致在计算域的任意离散化方案上泛化不足。在这项工作中，我们提出了一种新颖的操作学习算法，称为动态高斯图算子（DGGO），将神经算子扩展到在任意离散力学问题中学习参数化PDEs。动态高斯图（DGG）核学习将在一般欧几里得空间中定义的观察向量映射到高维均匀度量中定义的度量向量。",
    "tldr": "提出了一种新颖的操作学习算法，称为动态高斯图算子（DGGO），可以在任意离散力学问题中学习参数化PDEs。",
    "en_tdlr": "A novel operator learning algorithm, Dynamic Gaussian Graph Operator (DGGO), is proposed to learn parametric PDEs in arbitrary discrete mechanics problems."
}