{
    "title": "ProIn: Learning to Predict Trajectory Based on Progressive Interactions for Autonomous Driving",
    "abstract": "arXiv:2403.16374v1 Announce Type: new  Abstract: Accurate motion prediction of pedestrians, cyclists, and other surrounding vehicles (all called agents) is very important for autonomous driving. Most existing works capture map information through an one-stage interaction with map by vector-based attention, to provide map constraints for social interaction and multi-modal differentiation. However, these methods have to encode all required map rules into the focal agent's feature, so as to retain all possible intentions' paths while at the meantime to adapt to potential social interaction. In this work, a progressive interaction network is proposed to enable the agent's feature to progressively focus on relevant maps, in order to better learn agents' feature representation capturing the relevant map constraints. The network progressively encode the complex influence of map constraints into the agent's feature through graph convolutions at the following three stages: after historical traj",
    "link": "https://arxiv.org/abs/2403.16374",
    "context": "Title: ProIn: Learning to Predict Trajectory Based on Progressive Interactions for Autonomous Driving\nAbstract: arXiv:2403.16374v1 Announce Type: new  Abstract: Accurate motion prediction of pedestrians, cyclists, and other surrounding vehicles (all called agents) is very important for autonomous driving. Most existing works capture map information through an one-stage interaction with map by vector-based attention, to provide map constraints for social interaction and multi-modal differentiation. However, these methods have to encode all required map rules into the focal agent's feature, so as to retain all possible intentions' paths while at the meantime to adapt to potential social interaction. In this work, a progressive interaction network is proposed to enable the agent's feature to progressively focus on relevant maps, in order to better learn agents' feature representation capturing the relevant map constraints. The network progressively encode the complex influence of map constraints into the agent's feature through graph convolutions at the following three stages: after historical traj",
    "path": "papers/24/03/2403.16374.json",
    "total_tokens": 640,
    "translated_title": "基于渐进交互学习的自动驾驶轨迹预测",
    "translated_abstract": "对于自动驾驶来说，准确预测行人、骑车者和其他周围车辆（统称为代理）的运动轨迹非常重要。本文提出了一种渐进交互网络，使代理的特征能够逐渐聚焦于相关地图，以更好地学习捕获相关地图约束的代理特征表示。",
    "tldr": "通过渐进交互网络，代理在学习中逐渐聚焦于相关地图，以更好地捕获相关地图约束的特征表示。",
    "en_tdlr": "Through progressive interaction network, agents progressively focus on relevant maps to better capture the feature representation capturing the relevant map constraints."
}