{
    "title": "Hard-label based Small Query Black-box Adversarial Attack",
    "abstract": "arXiv:2403.06014v1 Announce Type: cross  Abstract: We consider the hard label based black box adversarial attack setting which solely observes predicted classes from the target model. Most of the attack methods in this setting suffer from impractical number of queries required to achieve a successful attack. One approach to tackle this drawback is utilising the adversarial transferability between white box surrogate models and black box target model. However, the majority of the methods adopting this approach are soft label based to take the full advantage of zeroth order optimisation. Unlike mainstream methods, we propose a new practical setting of hard label based attack with an optimisation process guided by a pretrained surrogate model. Experiments show the proposed method significantly improves the query efficiency of the hard label based black-box attack across various target model architectures. We find the proposed method achieves approximately 5 times higher attack success rat",
    "link": "https://arxiv.org/abs/2403.06014",
    "context": "Title: Hard-label based Small Query Black-box Adversarial Attack\nAbstract: arXiv:2403.06014v1 Announce Type: cross  Abstract: We consider the hard label based black box adversarial attack setting which solely observes predicted classes from the target model. Most of the attack methods in this setting suffer from impractical number of queries required to achieve a successful attack. One approach to tackle this drawback is utilising the adversarial transferability between white box surrogate models and black box target model. However, the majority of the methods adopting this approach are soft label based to take the full advantage of zeroth order optimisation. Unlike mainstream methods, we propose a new practical setting of hard label based attack with an optimisation process guided by a pretrained surrogate model. Experiments show the proposed method significantly improves the query efficiency of the hard label based black-box attack across various target model architectures. We find the proposed method achieves approximately 5 times higher attack success rat",
    "path": "papers/24/03/2403.06014.json",
    "total_tokens": 815,
    "translated_title": "基于硬标签的小查询黑盒对抗攻击",
    "translated_abstract": "我们考虑了基于硬标签的黑盒对抗攻击设置，仅观察来自目标模型的预测类别。在这种设置中，大多数攻击方法都需要不切实际数量的查询才能实现成功攻击。解决这一缺点的一种方法是利用白盒替代模型与黑盒目标模型之间的对抗传递性。然而，采用这种方法的大多数方法都是基于软标签的，以充分利用零阶优化。与主流方法不同，我们提出了一种新的实用的基于硬标签的攻击设置，其优化过程由预训练的替代模型指导。实验证明，所提出的方法显著提高了在各种目标模型架构上的基于硬标签的黑盒攻击的查询效率。我们发现，所提出的方法实现了约5倍更高的攻击成功率。",
    "tldr": "提出了一种新的基于硬标签的黑盒对抗攻击方法，通过在优化过程中利用预训练替代模型的指导，显著提高了攻击的查询效率。",
    "en_tdlr": "Proposed a new hard-label based black-box adversarial attack method that significantly improves attack efficiency by utilizing guidance from a pretrained surrogate model during optimization."
}