{
    "title": "Space Group Informed Transformer for Crystalline Materials Generation",
    "abstract": "arXiv:2403.15734v1 Announce Type: cross  Abstract: We introduce CrystalFormer, a transformer-based autoregressive model specifically designed for space group-controlled generation of crystalline materials. The space group symmetry significantly simplifies the crystal space, which is crucial for data and compute efficient generative modeling of crystalline materials. Leveraging the prominent discrete and sequential nature of the Wyckoff positions, CrystalFormer learns to generate crystals by directly predicting the species and locations of symmetry-inequivalent atoms in the unit cell. Our results demonstrate that CrystalFormer matches state-of-the-art performance on standard benchmarks for both validity, novelty, and stability of the generated crystalline materials. Our analysis also shows that CrystalFormer ingests sensible solid-state chemistry information from data for generative modeling. The CrystalFormer unifies symmetry-based structure search and generative pre-training in the re",
    "link": "https://arxiv.org/abs/2403.15734",
    "context": "Title: Space Group Informed Transformer for Crystalline Materials Generation\nAbstract: arXiv:2403.15734v1 Announce Type: cross  Abstract: We introduce CrystalFormer, a transformer-based autoregressive model specifically designed for space group-controlled generation of crystalline materials. The space group symmetry significantly simplifies the crystal space, which is crucial for data and compute efficient generative modeling of crystalline materials. Leveraging the prominent discrete and sequential nature of the Wyckoff positions, CrystalFormer learns to generate crystals by directly predicting the species and locations of symmetry-inequivalent atoms in the unit cell. Our results demonstrate that CrystalFormer matches state-of-the-art performance on standard benchmarks for both validity, novelty, and stability of the generated crystalline materials. Our analysis also shows that CrystalFormer ingests sensible solid-state chemistry information from data for generative modeling. The CrystalFormer unifies symmetry-based structure search and generative pre-training in the re",
    "path": "papers/24/03/2403.15734.json",
    "total_tokens": 865,
    "translated_title": "基于空间群信息的晶体材料生成变压器",
    "translated_abstract": "我们引入了CrystalFormer，这是一种基于变压器的自回归模型，专门设计用于受空间群控制的晶体材料生成。空间群对称性显著简化了晶体空间，这对于数据和计算有效的晶体材料生成建模至关重要。通过利用Wyckoff位置的显著离散和顺序特性，CrystalFormer学会了通过直接预测单位胞中对称不等价原子的种类和位置来生成晶体。我们的结果表明，CrystalFormer在生成的晶体材料的有效性、新颖性和稳定性方面与标准基准上的最新性能相匹配。我们的分析还表明，CrystalFormer从数据中吸收了合理的固体化学信息用于生成建模。CrystalFormer统一了基于对称性的结构搜索和生成性预训练。",
    "tldr": "CrystalFormer是一种基于变压器的自回归模型，专门设计用于受空间群控制的晶体材料生成，它通过预测单位胞中对称不等价原子的种类和位置来生成晶体，并在有效性、新颖性和稳定性等方面达到了与最先进性能相匹配的水平。",
    "en_tdlr": "CrystalFormer is a transformer-based autoregressive model specifically designed for space group-controlled generation of crystalline materials, predicting the species and locations of symmetry-inequivalent atoms in the unit cell to match state-of-the-art performance on standard benchmarks for validity, novelty, and stability of the generated crystalline materials."
}