{
    "title": "Machina Economicus: A New Paradigm for Prosumers in the Energy Internet of Smart Cities",
    "abstract": "arXiv:2403.14660v1 Announce Type: cross  Abstract: Energy Internet (EI) is emerging as new share economy platform for flexible local energy supplies in smart cities. Empowered by the Internet-of-Things (IoT) and Artificial Intelligence (AI), EI aims to unlock peer-to-peer energy trading and sharing among prosumers, who can adeptly switch roles between providers and consumers in localized energy markets with rooftop photovoltaic panels, vehicle-to-everything technologies, packetized energy management, etc. The integration of prosumers in EI, however, will encounter many challenges in modelling, analyzing, and designing an efficient, economic, and social-optimal platform for energy sharing, calling for advanced AI/IoT-based solutions to resource optimization, information exchange, and interaction protocols in the context of the share economy. In this study, we aim to introduce a recently emerged paradigm, Machina Economicus, to investigate the economic rationality in modelling, analysis,",
    "link": "https://arxiv.org/abs/2403.14660",
    "context": "Title: Machina Economicus: A New Paradigm for Prosumers in the Energy Internet of Smart Cities\nAbstract: arXiv:2403.14660v1 Announce Type: cross  Abstract: Energy Internet (EI) is emerging as new share economy platform for flexible local energy supplies in smart cities. Empowered by the Internet-of-Things (IoT) and Artificial Intelligence (AI), EI aims to unlock peer-to-peer energy trading and sharing among prosumers, who can adeptly switch roles between providers and consumers in localized energy markets with rooftop photovoltaic panels, vehicle-to-everything technologies, packetized energy management, etc. The integration of prosumers in EI, however, will encounter many challenges in modelling, analyzing, and designing an efficient, economic, and social-optimal platform for energy sharing, calling for advanced AI/IoT-based solutions to resource optimization, information exchange, and interaction protocols in the context of the share economy. In this study, we aim to introduce a recently emerged paradigm, Machina Economicus, to investigate the economic rationality in modelling, analysis,",
    "path": "papers/24/03/2403.14660.json",
    "total_tokens": 858,
    "translated_title": "经济机器人：智能城市能源互联网中的新兴模式",
    "translated_abstract": "能源互联网（EI）作为新兴的共享经济平台，利用物联网（IoT）和人工智能（AI）为智能城市提供灵活的本地能源供应。EI旨在解锁在智能城市中基于屋顶光伏板、车联网技术、分组能源管理等的本地能源市场中，prosumers之间的点对点能源交易和分享，prosumers可以在此之间灵活切换提供者和消费者的角色。然而，将prosumers整合到EI中将面临许多挑战，需要在资源优化、信息交换和交互协议等方面提供基于AI/IoT的高级解决方案，以建立一个高效、经济、社会最优的能源分享平台。",
    "tldr": "在智能城市能源互联网中，提出了一个新的模式——经济机器人，旨在研究在资源优化、信息交换和交互协议等方面，实现prosumers的经济合理性，以建立一个高效、经济、社会最优的能源分享平台。",
    "en_tdlr": "A new paradigm, Machina Economicus, is introduced in the Energy Internet of Smart Cities to investigate the economic rationality for prosumers in resource optimization, information exchange, and interaction protocols, aiming to establish an efficient, economic, and socially optimal energy sharing platform."
}