{
    "title": "Open Knowledge Base Canonicalization with Multi-task Learning",
    "abstract": "arXiv:2403.14733v1 Announce Type: new  Abstract: The construction of large open knowledge bases (OKBs) is integral to many knowledge-driven applications on the world wide web such as web search. However, noun phrases and relational phrases in OKBs often suffer from redundancy and ambiguity, which calls for the investigation on OKB canonicalization. Current solutions address OKB canonicalization by devising advanced clustering algorithms and using knowledge graph embedding (KGE) to further facilitate the canonicalization process. Nevertheless, these works fail to fully exploit the synergy between clustering and KGE learning, and the methods designed for these subtasks are sub-optimal. To this end, we put forward a multi-task learning framework, namely MulCanon, to tackle OKB canonicalization. In addition, diffusion model is used in the soft clustering process to improve the noun phrase representations with neighboring information, which can lead to more accurate representations. MulCano",
    "link": "https://arxiv.org/abs/2403.14733",
    "context": "Title: Open Knowledge Base Canonicalization with Multi-task Learning\nAbstract: arXiv:2403.14733v1 Announce Type: new  Abstract: The construction of large open knowledge bases (OKBs) is integral to many knowledge-driven applications on the world wide web such as web search. However, noun phrases and relational phrases in OKBs often suffer from redundancy and ambiguity, which calls for the investigation on OKB canonicalization. Current solutions address OKB canonicalization by devising advanced clustering algorithms and using knowledge graph embedding (KGE) to further facilitate the canonicalization process. Nevertheless, these works fail to fully exploit the synergy between clustering and KGE learning, and the methods designed for these subtasks are sub-optimal. To this end, we put forward a multi-task learning framework, namely MulCanon, to tackle OKB canonicalization. In addition, diffusion model is used in the soft clustering process to improve the noun phrase representations with neighboring information, which can lead to more accurate representations. MulCano",
    "path": "papers/24/03/2403.14733.json",
    "total_tokens": 810,
    "translated_title": "用多任务学习进行开放知识库规范化",
    "translated_abstract": "大型开放知识库（OKB）的构建对于诸多基于知识的网络应用如网络搜索至关重要。然而，OKB中的名词短语和关系短语往往存在冗余和歧义，这需要对OKB进行规范化的研究。当前的解决方案通过设计先进的聚类算法，并使用知识图嵌入（KGE）进一步促进规范化过程。然而，这些工作未能充分利用聚类和KGE学习之间的协同作用，并且为这些子任务设计的方法是次优的。因此，我们提出了一个名为MulCanon的多任务学习框架来解决OKB的规范化问题。此外，在软聚类过程中使用扩散模型来改进名词短语的表示，带来更准确的表征。",
    "tldr": "提出了一个多任务学习框架MulCanon来处理开放知识库（OKB）规范化问题，并通过在软聚类过程中使用扩散模型来改进名词短语的表示。",
    "en_tdlr": "Introduced a multi-task learning framework MulCanon to tackle the canonicalization problem in Open Knowledge Bases (OKBs), and improved noun phrase representations by using a diffusion model in the soft clustering process."
}