{
    "title": "Loops On Retrieval Augmented Generation (LoRAG)",
    "abstract": "arXiv:2403.15450v1 Announce Type: new  Abstract: This paper presents Loops On Retrieval Augmented Generation (LoRAG), a new framework designed to enhance the quality of retrieval-augmented text generation through the incorporation of an iterative loop mechanism. The architecture integrates a generative model, a retrieval mechanism, and a dynamic loop module, allowing for iterative refinement of the generated text through interactions with relevant information retrieved from the input context. Experimental evaluations on benchmark datasets demonstrate that LoRAG surpasses existing state-of-the-art models in terms of BLEU score, ROUGE score, and perplexity, showcasing its effectiveness in achieving both coherence and relevance in generated text. The qualitative assessment further illustrates LoRAG's capability to produce contextually rich and coherent outputs. This research contributes valuable insights into the potential of iterative loops in mitigating challenges in text generation, po",
    "link": "https://arxiv.org/abs/2403.15450",
    "context": "Title: Loops On Retrieval Augmented Generation (LoRAG)\nAbstract: arXiv:2403.15450v1 Announce Type: new  Abstract: This paper presents Loops On Retrieval Augmented Generation (LoRAG), a new framework designed to enhance the quality of retrieval-augmented text generation through the incorporation of an iterative loop mechanism. The architecture integrates a generative model, a retrieval mechanism, and a dynamic loop module, allowing for iterative refinement of the generated text through interactions with relevant information retrieved from the input context. Experimental evaluations on benchmark datasets demonstrate that LoRAG surpasses existing state-of-the-art models in terms of BLEU score, ROUGE score, and perplexity, showcasing its effectiveness in achieving both coherence and relevance in generated text. The qualitative assessment further illustrates LoRAG's capability to produce contextually rich and coherent outputs. This research contributes valuable insights into the potential of iterative loops in mitigating challenges in text generation, po",
    "path": "papers/24/03/2403.15450.json",
    "total_tokens": 823,
    "translated_title": "Loops On Retrieval Augmented Generation (LoRAG)",
    "translated_abstract": "本文介绍了一种名为Loops On Retrieval Augmented Generation (LoRAG)的新框架，旨在通过引入迭代循环机制来提高检索增强型文本生成的质量。该架构集成了生成模型、检索机制和动态循环模块，允许通过与从输入上下文中检索的相关信息进行交互来对生成的文本进行迭代改进。对基准数据集的实证评估表明，LoRAG在BLEU分数、ROUGE分数和困惑度方面均超过了现有的最先进模型，展示了其在生成文本的连贯性和相关性方面的有效性。定性评估进一步说明了LoRAG产生上下文丰富且连贯的输出的能力。这项研究为迭代循环在缓解文本生成中的挑战方面的潜力提供了有价值的见解。",
    "tldr": "LoRAG是一种新框架，通过引入迭代循环机制提高了检索增强型文本生成的质量，在实验证明在生成的文本连贯性和相关性方面优于当前最先进模型。",
    "en_tdlr": "LoRAG is a new framework that enhances the quality of retrieval-augmented text generation through the incorporation of an iterative loop mechanism, outperforming existing state-of-the-art models in coherence and relevance of the generated text based on empirical evaluations."
}