{
    "title": "Physics-informed Neural Motion Planning on Constraint Manifolds",
    "abstract": "arXiv:2403.05765v1 Announce Type: cross  Abstract: Constrained Motion Planning (CMP) aims to find a collision-free path between the given start and goal configurations on the kinematic constraint manifolds. These problems appear in various scenarios ranging from object manipulation to legged-robot locomotion. However, the zero-volume nature of manifolds makes the CMP problem challenging, and the state-of-the-art methods still take several seconds to find a path and require a computationally expansive path dataset for imitation learning. Recently, physics-informed motion planning methods have emerged that directly solve the Eikonal equation through neural networks for motion planning and do not require expert demonstrations for learning. Inspired by these approaches, we propose the first physics-informed CMP framework that solves the Eikonal equation on the constraint manifolds and trains neural function for CMP without expert data. Our results show that the proposed approach efficientl",
    "link": "https://arxiv.org/abs/2403.05765",
    "context": "Title: Physics-informed Neural Motion Planning on Constraint Manifolds\nAbstract: arXiv:2403.05765v1 Announce Type: cross  Abstract: Constrained Motion Planning (CMP) aims to find a collision-free path between the given start and goal configurations on the kinematic constraint manifolds. These problems appear in various scenarios ranging from object manipulation to legged-robot locomotion. However, the zero-volume nature of manifolds makes the CMP problem challenging, and the state-of-the-art methods still take several seconds to find a path and require a computationally expansive path dataset for imitation learning. Recently, physics-informed motion planning methods have emerged that directly solve the Eikonal equation through neural networks for motion planning and do not require expert demonstrations for learning. Inspired by these approaches, we propose the first physics-informed CMP framework that solves the Eikonal equation on the constraint manifolds and trains neural function for CMP without expert data. Our results show that the proposed approach efficientl",
    "path": "papers/24/03/2403.05765.json",
    "total_tokens": 777,
    "translated_title": "物理信息神经运动规划在约束流形上的应用",
    "translated_abstract": "约束运动规划（CMP）旨在在运动约束流形上找到给定起始和目标配置之间的无碰路径。这些问题出现在各种场景中，从物体操纵到腿式机器人行走。然而，流形的零体积特性使得CMP问题具有挑战性，当前最先进的方法仍然需要几秒钟来找到路径，并且需要一个计算费力的路径数据集来进行模仿学习。最近，出现了直接通过神经网络解决Eikonal方程进行运动规划的物理信息运动规划方法，无需专家演示进行学习。受这些方法的启发，我们提出了第一个在约束流形上解决Eikonal方程的物理信息CMP框架，并训练神经函数进行CMP而无需专家数据。我们的结果表明，所提出的方法高效",
    "tldr": "提出了第一个在约束流形上解决Eikonal方程的物理信息CMP框架，无需专家数据，高效。",
    "en_tdlr": "Proposed the first physics-informed CMP framework that solves the Eikonal equation on constraint manifolds without expert data, showing efficiency."
}