{
    "title": "Pulling back symmetric Riemannian geometry for data analysis",
    "abstract": "arXiv:2403.06612v1 Announce Type: cross  Abstract: Data sets tend to live in low-dimensional non-linear subspaces. Ideal data analysis tools for such data sets should therefore account for such non-linear geometry. The symmetric Riemannian geometry setting can be suitable for a variety of reasons. First, it comes with a rich mathematical structure to account for a wide range of non-linear geometries that has been shown to be able to capture the data geometry through empirical evidence from classical non-linear embedding. Second, many standard data analysis tools initially developed for data in Euclidean space can also be generalised efficiently to data on a symmetric Riemannian manifold. A conceptual challenge comes from the lack of guidelines for constructing a symmetric Riemannian structure on the data space itself and the lack of guidelines for modifying successful algorithms on symmetric Riemannian manifolds for data analysis to this setting. This work considers these challenges in",
    "link": "https://arxiv.org/abs/2403.06612",
    "context": "Title: Pulling back symmetric Riemannian geometry for data analysis\nAbstract: arXiv:2403.06612v1 Announce Type: cross  Abstract: Data sets tend to live in low-dimensional non-linear subspaces. Ideal data analysis tools for such data sets should therefore account for such non-linear geometry. The symmetric Riemannian geometry setting can be suitable for a variety of reasons. First, it comes with a rich mathematical structure to account for a wide range of non-linear geometries that has been shown to be able to capture the data geometry through empirical evidence from classical non-linear embedding. Second, many standard data analysis tools initially developed for data in Euclidean space can also be generalised efficiently to data on a symmetric Riemannian manifold. A conceptual challenge comes from the lack of guidelines for constructing a symmetric Riemannian structure on the data space itself and the lack of guidelines for modifying successful algorithms on symmetric Riemannian manifolds for data analysis to this setting. This work considers these challenges in",
    "path": "papers/24/03/2403.06612.json",
    "total_tokens": 831,
    "translated_title": "将对称黎曼几何应用于数据分析",
    "translated_abstract": "数据集往往存在于低维非线性子空间中。针对这种数据集的理想数据分析工具应考虑这种非线性几何。对称黎曼几何设置因多种原因而适用。首先，它具有丰富的数学结构，可以解释广泛范围的非线性几何，从经典非线性嵌入的经验证据中已经显示可以捕捉数据几何。其次，许多最初为欧几里德空间中的数据开发的标准数据分析工具也可以有效地推广到对称黎曼流形上的数据。概念上的挑战源自于缺乏构建数据空间本身上的对称黎曼结构的指导方针以及缺乏修改成功的算法在对称黎曼流形上进行数据分析的指导方针到此设置的问题。本工作考虑了这些挑战。",
    "tldr": "对称黎曼几何可用于捕捉数据几何的非线性结构，并且能够将欧几里德空间上的数据分析工具有效推广到对称黎曼流形上。",
    "en_tdlr": "Symmetric Riemannian geometry can capture the nonlinear structure of data geometry, and efficiently generalize standard data analysis tools from Euclidean space to symmetric Riemannian manifolds."
}