{
    "title": "Electioneering the Network: Dynamic Multi-Step Adversarial Attacks for Community Canvassing",
    "abstract": "arXiv:2403.12399v1 Announce Type: new  Abstract: The problem of online social network manipulation for community canvassing is of real concern in today's world. Motivated by the study of voter models, opinion and polarization dynamics on networks, we model community canvassing as a dynamic process over a network enabled via gradient-based attacks on GNNs. Existing attacks on GNNs are all single-step and do not account for the dynamic cascading nature of information diffusion in networks. We consider the realistic scenario where an adversary uses a GNN as a proxy to predict and manipulate voter preferences, especially uncertain voters. Gradient-based attacks on the GNN inform the adversary of strategic manipulations that can be made to proselytize targeted voters. In particular, we explore $\\textit{minimum budget attacks for community canvassing}$ (MBACC). We show that the MBACC problem is NP-Hard and propose Dynamic Multi-Step Adversarial Community Canvassing (MAC) to address it. MAC m",
    "link": "https://arxiv.org/abs/2403.12399",
    "context": "Title: Electioneering the Network: Dynamic Multi-Step Adversarial Attacks for Community Canvassing\nAbstract: arXiv:2403.12399v1 Announce Type: new  Abstract: The problem of online social network manipulation for community canvassing is of real concern in today's world. Motivated by the study of voter models, opinion and polarization dynamics on networks, we model community canvassing as a dynamic process over a network enabled via gradient-based attacks on GNNs. Existing attacks on GNNs are all single-step and do not account for the dynamic cascading nature of information diffusion in networks. We consider the realistic scenario where an adversary uses a GNN as a proxy to predict and manipulate voter preferences, especially uncertain voters. Gradient-based attacks on the GNN inform the adversary of strategic manipulations that can be made to proselytize targeted voters. In particular, we explore $\\textit{minimum budget attacks for community canvassing}$ (MBACC). We show that the MBACC problem is NP-Hard and propose Dynamic Multi-Step Adversarial Community Canvassing (MAC) to address it. MAC m",
    "path": "papers/24/03/2403.12399.json",
    "total_tokens": 863,
    "translated_title": "将网络选举化：用于社区拉票的动态多步对抗性攻击",
    "translated_abstract": "在今天的世界中，对于社区拉票的在线社交网络操纵问题是一个真正关注的问题。受选民模型、网络上的观点和极化动态的研究启发，我们将社区拉票建模为一个通过对GNN进行基于梯度的攻击而在网络上进行的动态过程。现有的GNN攻击都是单步的，没有考虑网络中信息传播的动态级联特性。我们考虑了一个现实的场景，即对手使用GNN作为代理来预测和操纵选民偏好，特别是不确定的选民。对GNN的基于梯度的攻击通知对手可以进行战略操纵，以使得目标选民入教。具体而言，我们探讨了$\\textit{社区拉票的最小预算攻击}$（MBACC）。我们证明了MBACC问题是NP困难的，并提出了动态多步对抗性社区拉票（MAC）来解决这一问题。MAC m",
    "tldr": "本论文提出了用于社区拉票的动态多步对抗性攻击，使得对手能够利用基于梯度的攻击来策划目标选民的操纵。",
    "en_tdlr": "This paper introduces dynamic multi-step adversarial attacks for community canvassing, allowing adversaries to manipulate targeted voters through gradient-based attacks."
}