{
    "title": "Graph Language Model (GLM): A new graph-based approach to detect social instabilities",
    "abstract": "arXiv:2403.17816v1 Announce Type: new  Abstract: This scientific report presents a novel methodology for the early prediction of important political events using News datasets. The methodology leverages natural language processing, graph theory, clique analysis, and semantic relationships to uncover hidden predictive signals within the data. Initially, we designed a preliminary version of the method and tested it on a few events. This analysis revealed limitations in the initial research phase. We then enhanced the model in two key ways: first, we added a filtration step to only consider politically relevant news before further processing; second, we adjusted the input features to make the alert system more sensitive to significant spikes in the data. After finalizing the improved methodology, we tested it on eleven events including US protests, the Ukraine war, and French protests. Results demonstrate the superiority of our approach compared to baseline methods. Through targeted refin",
    "link": "https://arxiv.org/abs/2403.17816",
    "context": "Title: Graph Language Model (GLM): A new graph-based approach to detect social instabilities\nAbstract: arXiv:2403.17816v1 Announce Type: new  Abstract: This scientific report presents a novel methodology for the early prediction of important political events using News datasets. The methodology leverages natural language processing, graph theory, clique analysis, and semantic relationships to uncover hidden predictive signals within the data. Initially, we designed a preliminary version of the method and tested it on a few events. This analysis revealed limitations in the initial research phase. We then enhanced the model in two key ways: first, we added a filtration step to only consider politically relevant news before further processing; second, we adjusted the input features to make the alert system more sensitive to significant spikes in the data. After finalizing the improved methodology, we tested it on eleven events including US protests, the Ukraine war, and French protests. Results demonstrate the superiority of our approach compared to baseline methods. Through targeted refin",
    "path": "papers/24/03/2403.17816.json",
    "total_tokens": 842,
    "translated_title": "图语言模型（GLM）：一种新的基于图的方法来检测社会不稳定因素",
    "translated_abstract": "本科学报告提出了一种新的方法，旨在利用新闻数据集提前预测重要的政治事件。该方法利用自然语言处理，图论，团体分析和语义关系来发现数据中隐藏的预测信号。我们首先设计了该方法的初步版本，并在一些事件上进行了测试。这些分析揭示了初始研究阶段的局限性。我们接着以两种关键方式增强了模型：首先，我们添加了一个过滤步骤，以仅考虑在进一步处理之前具有政治相关性的新闻；其次，我们调整了输入特征，使警报系统对数据中的重大波动更加敏感。在完善改进的方法后，我们对包括美国抗议活动、乌克兰战争和法国抗议活动在内的十一个事件进行了测试。结果表明，我们的方法相比基线方法具有优势。通过有针对性的改进",
    "tldr": "提出了一种新的基于图的方法来提前预测重要的政治事件，通过自然语言处理、图论、团体分析和语义关系揭示数据中隐藏的预测信号",
    "en_tdlr": "A new graph-based approach was proposed for early prediction of important political events, leveraging natural language processing, graph theory, clique analysis, and semantic relationships to uncover hidden predictive signals in the data."
}