{
    "title": "ChroniclingAmericaQA: A Large-scale Question Answering Dataset based on Historical American Newspaper Pages",
    "abstract": "arXiv:2403.17859v1 Announce Type: new  Abstract: Question answering (QA) and Machine Reading Comprehension (MRC) tasks have significantly advanced in recent years due to the rapid development of deep learning techniques and, more recently, large language models. At the same time, many benchmark datasets have become available for QA and MRC tasks. However, most existing large-scale benchmark datasets have been created predominantly using synchronous document collections like Wikipedia or the Web. Archival document collections, such as historical newspapers, contain valuable information from the past that is still not widely used to train large language models. To further contribute to advancing QA and MRC tasks and to overcome the limitation of previous datasets, we introduce ChroniclingAmericaQA, a large-scale dataset with 485K question-answer pairs created based on the historical newspaper collection Chronicling America. Our dataset is constructed from a subset of the Chronicling Amer",
    "link": "https://arxiv.org/abs/2403.17859",
    "context": "Title: ChroniclingAmericaQA: A Large-scale Question Answering Dataset based on Historical American Newspaper Pages\nAbstract: arXiv:2403.17859v1 Announce Type: new  Abstract: Question answering (QA) and Machine Reading Comprehension (MRC) tasks have significantly advanced in recent years due to the rapid development of deep learning techniques and, more recently, large language models. At the same time, many benchmark datasets have become available for QA and MRC tasks. However, most existing large-scale benchmark datasets have been created predominantly using synchronous document collections like Wikipedia or the Web. Archival document collections, such as historical newspapers, contain valuable information from the past that is still not widely used to train large language models. To further contribute to advancing QA and MRC tasks and to overcome the limitation of previous datasets, we introduce ChroniclingAmericaQA, a large-scale dataset with 485K question-answer pairs created based on the historical newspaper collection Chronicling America. Our dataset is constructed from a subset of the Chronicling Amer",
    "path": "papers/24/03/2403.17859.json",
    "total_tokens": 822,
    "translated_title": "ChroniclingAmericaQA:基于历史美国报纸页面的大规模问答数据集",
    "translated_abstract": "arXiv:2403.17859v1公告类型：新问答（QA）和机器阅读理解（MRC）任务由于深度学习技术的快速发展以及最近的大语言模型而取得了显著进展。同时，许多基准数据集已经用于QA和MRC任务。然而，大多数现有的大规模基准数据集主要使用同步文档集合（如维基百科或网络）创建。档案文件集合，如历史报纸，包含过去的宝贵信息，但仍未被广泛用于训练大型语言模型。为了进一步推动QA和MRC任务的发展，并克服先前数据集的局限性，我们介绍了ChroniclingAmericaQA，这是一个基于历史报纸集Chronicling America创建的拥有485K问答对的大规模数据集。我们的数据集是从Chronicling Amer的子集构建的。",
    "tldr": "ChroniclingAmericaQA是一个基于历史美国报纸页面的大规模问答数据集，旨在推动QA和MRC任务的发展，并克服以往数据集的局限性。"
}