{
    "title": "Assessing the Efficacy of Heuristic-Based Address Clustering for Bitcoin",
    "abstract": "arXiv:2403.00523v1 Announce Type: new  Abstract: Exploring transactions within the Bitcoin blockchain entails examining the transfer of bitcoins among several hundred million entities. However, it is often impractical and resource-consuming to study such a vast number of entities. Consequently, entity clustering serves as an initial step in most analytical studies. This process often employs heuristics grounded in the practices and behaviors of these entities. In this research, we delve into the examination of two widely used heuristics, alongside the introduction of four novel ones. Our contribution includes the introduction of the \\textit{clustering ratio}, a metric designed to quantify the reduction in the number of entities achieved by a given heuristic. The assessment of this reduction ratio plays an important role in justifying the selection of a specific heuristic for analytical purposes. Given the dynamic nature of the Bitcoin system, characterized by a continuous increase in t",
    "link": "https://arxiv.org/abs/2403.00523",
    "context": "Title: Assessing the Efficacy of Heuristic-Based Address Clustering for Bitcoin\nAbstract: arXiv:2403.00523v1 Announce Type: new  Abstract: Exploring transactions within the Bitcoin blockchain entails examining the transfer of bitcoins among several hundred million entities. However, it is often impractical and resource-consuming to study such a vast number of entities. Consequently, entity clustering serves as an initial step in most analytical studies. This process often employs heuristics grounded in the practices and behaviors of these entities. In this research, we delve into the examination of two widely used heuristics, alongside the introduction of four novel ones. Our contribution includes the introduction of the \\textit{clustering ratio}, a metric designed to quantify the reduction in the number of entities achieved by a given heuristic. The assessment of this reduction ratio plays an important role in justifying the selection of a specific heuristic for analytical purposes. Given the dynamic nature of the Bitcoin system, characterized by a continuous increase in t",
    "path": "papers/24/03/2403.00523.json",
    "total_tokens": 866,
    "translated_title": "评估基于启发式地址聚类在比特币中的有效性",
    "translated_abstract": "在比特币区块链中探索交易涉及研究数亿个实体之间比特币的转移。然而，研究如此庞大数量的实体往往是不切实际且耗费资源的。因此，实体聚类往往是大多数分析研究的首要步骤。这一过程通常采用基于这些实体的实践和行为的启发式。在这项研究中，我们深入研究了两种广泛使用的启发式，同时介绍了四种新颖的启发式。我们的贡献包括引入“聚类比率”，这是一种旨在量化给定启发式所实现的实体数量减少的指标。评估这种减少比率在证明选择特定启发式进行分析目的时起着重要作用。鉴于比特币系统的动态性，其特点是不断增加",
    "tldr": "该研究评估了基于启发式的地址聚类在比特币中的有效性，介绍了一种“聚类比率”指标来量化启发式实现的实体数量减少，为分析目的选择特定启发式提供了重要依据。",
    "en_tdlr": "This study assesses the efficacy of heuristic-based address clustering for Bitcoin and introduces a \"clustering ratio\" metric to quantify the reduction in the number of entities achieved by a heuristic, providing important justification for selecting a specific heuristic for analytical purposes."
}