{
    "title": "A Geospatial Approach to Predicting Desert Locust Breeding Grounds in Africa",
    "abstract": "arXiv:2403.06860v1 Announce Type: new  Abstract: Desert locust swarms present a major threat to agriculture and food security. Addressing this challenge, our study develops an operationally-ready model for predicting locust breeding grounds, which has the potential to enhance early warning systems and targeted control measures. We curated a dataset from the United Nations Food and Agriculture Organization's (UN-FAO) locust observation records and analyzed it using two types of spatio-temporal input features: remotely-sensed environmental and climate data as well as multi-spectral earth observation images. Our approach employed custom deep learning models (three-dimensional and LSTM-based recurrent convolutional networks), along with the geospatial foundational model Prithvi recently released by Jakubik et al., 2023. These models notably outperformed existing baselines, with the Prithvi-based model, fine-tuned on multi-spectral images from NASA's Harmonized Landsat and Sentinel-2 (HLS) ",
    "link": "https://arxiv.org/abs/2403.06860",
    "context": "Title: A Geospatial Approach to Predicting Desert Locust Breeding Grounds in Africa\nAbstract: arXiv:2403.06860v1 Announce Type: new  Abstract: Desert locust swarms present a major threat to agriculture and food security. Addressing this challenge, our study develops an operationally-ready model for predicting locust breeding grounds, which has the potential to enhance early warning systems and targeted control measures. We curated a dataset from the United Nations Food and Agriculture Organization's (UN-FAO) locust observation records and analyzed it using two types of spatio-temporal input features: remotely-sensed environmental and climate data as well as multi-spectral earth observation images. Our approach employed custom deep learning models (three-dimensional and LSTM-based recurrent convolutional networks), along with the geospatial foundational model Prithvi recently released by Jakubik et al., 2023. These models notably outperformed existing baselines, with the Prithvi-based model, fine-tuned on multi-spectral images from NASA's Harmonized Landsat and Sentinel-2 (HLS) ",
    "path": "papers/24/03/2403.06860.json",
    "total_tokens": 901,
    "translated_title": "非洲沙漠蝗虫繁殖地预测的地理空间方法",
    "translated_abstract": "沙漠蝗虫成群成队对农业和食品安全构成重大威胁。本研究针对这一挑战，开发了一个可操作的模型，用于预测蝗虫的繁殖地，有望增强早期预警系统和有针对性的控制措施。我们从联合国粮食和农业组织(UN-FAO)的蝗虫观测记录中整理了一个数据集，并使用两种类型的时空输入特征进行分析：遥感环境和气候数据，以及多光谱地球观测图像。我们的方法采用定制的深度学习模型(三维和基于LSTM的循环卷积网络)，以及Jakubik等人于2023年最新发布的地理空间基础模型Prithvi。这些模型显著优于现有基准线，基于Prithvi的模型，通过对来自NASA的谐调Landsat和哨兵-2(HLS)多光谱图像进行微调而表现出色。",
    "tldr": "该研究开发了一个地理空间模型，用于预测沙漠蝗虫的繁殖地，有望提升早期预警系统和有针对性的控制措施。",
    "en_tdlr": "This study developed a geospatial model for predicting desert locust breeding grounds, aiming to enhance early warning systems and targeted control measures."
}