{
    "title": "BiVert: Bidirectional Vocabulary Evaluation using Relations for Machine Translation",
    "abstract": "arXiv:2403.03521v1 Announce Type: new  Abstract: Neural machine translation (NMT) has progressed rapidly in the past few years, promising improvements and quality translations for different languages. Evaluation of this task is crucial to determine the quality of the translation. Overall, insufficient emphasis is placed on the actual sense of the translation in traditional methods. We propose a bidirectional semantic-based evaluation method designed to assess the sense distance of the translation from the source text. This approach employs the comprehensive multilingual encyclopedic dictionary BabelNet. Through the calculation of the semantic distance between the source and its back translation of the output, our method introduces a quantifiable approach that empowers sentence comparison on the same linguistic level. Factual analysis shows a strong correlation between the average evaluation scores generated by our method and the human assessments across various machine translation syst",
    "link": "https://arxiv.org/abs/2403.03521",
    "context": "Title: BiVert: Bidirectional Vocabulary Evaluation using Relations for Machine Translation\nAbstract: arXiv:2403.03521v1 Announce Type: new  Abstract: Neural machine translation (NMT) has progressed rapidly in the past few years, promising improvements and quality translations for different languages. Evaluation of this task is crucial to determine the quality of the translation. Overall, insufficient emphasis is placed on the actual sense of the translation in traditional methods. We propose a bidirectional semantic-based evaluation method designed to assess the sense distance of the translation from the source text. This approach employs the comprehensive multilingual encyclopedic dictionary BabelNet. Through the calculation of the semantic distance between the source and its back translation of the output, our method introduces a quantifiable approach that empowers sentence comparison on the same linguistic level. Factual analysis shows a strong correlation between the average evaluation scores generated by our method and the human assessments across various machine translation syst",
    "path": "papers/24/03/2403.03521.json",
    "total_tokens": 865,
    "translated_title": "BiVert：使用关系进行双向词汇评估用于机器翻译",
    "translated_abstract": "arXiv：2403.03521v1 公告类型：新  摘要：神经机器翻译（NMT）在过去几年取得了快速进展，为不同语言的改进和质量翻译提供了希望。对这一任务的评估对于确定翻译的质量至关重要。总体而言，传统方法在翻译的实际含义方面没有足够的强调。我们提出了一种双向基于语义的评估方法，旨在评估翻译与源文本之间的语义距离。该方法采用了综合的多语言百科全书词典BabelNet。通过计算源文本及其输出的反向翻译之间的语义距离，我们的方法引入了一种可量化的方法，从而使句子在相同的语言水平上进行比较。事实分析显示，我们的方法生成的平均评估分数与各种机器翻译系统的人类评估之间存在较强的相关性。",
    "tldr": "提出了一种双向基于语义的评估方法，通过使用BabelNet词典计算源文本和反向翻译之间的语义距离，实现了在相同语言水平上的句子比较。"
}