{
    "title": "Machine Learning Optimized Approach for Parameter Selection in MESHFREE Simulations",
    "abstract": "arXiv:2403.13672v1 Announce Type: new  Abstract: Meshfree simulation methods are emerging as compelling alternatives to conventional mesh-based approaches, particularly in the fields of Computational Fluid Dynamics (CFD) and continuum mechanics. In this publication, we provide a comprehensive overview of our research combining Machine Learning (ML) and Fraunhofer's MESHFREE software (www.meshfree.eu), a powerful tool utilizing a numerical point cloud in a Generalized Finite Difference Method (GFDM). This tool enables the effective handling of complex flow domains, moving geometries, and free surfaces, while allowing users to finely tune local refinement and quality parameters for an optimal balance between computation time and results accuracy. However, manually determining the optimal parameter combination poses challenges, especially for less experienced users. We introduce a novel ML-optimized approach, using active learning, regression trees, and visualization on MESHFREE simulatio",
    "link": "https://arxiv.org/abs/2403.13672",
    "context": "Title: Machine Learning Optimized Approach for Parameter Selection in MESHFREE Simulations\nAbstract: arXiv:2403.13672v1 Announce Type: new  Abstract: Meshfree simulation methods are emerging as compelling alternatives to conventional mesh-based approaches, particularly in the fields of Computational Fluid Dynamics (CFD) and continuum mechanics. In this publication, we provide a comprehensive overview of our research combining Machine Learning (ML) and Fraunhofer's MESHFREE software (www.meshfree.eu), a powerful tool utilizing a numerical point cloud in a Generalized Finite Difference Method (GFDM). This tool enables the effective handling of complex flow domains, moving geometries, and free surfaces, while allowing users to finely tune local refinement and quality parameters for an optimal balance between computation time and results accuracy. However, manually determining the optimal parameter combination poses challenges, especially for less experienced users. We introduce a novel ML-optimized approach, using active learning, regression trees, and visualization on MESHFREE simulatio",
    "path": "papers/24/03/2403.13672.json",
    "total_tokens": 850,
    "translated_title": "机器学习优化的方法用于MESHFREE模拟中的参数选择",
    "translated_abstract": "Meshfree模拟方法正成为传统基于网格方法的引人注目的替代方案，特别在计算流体动力学（CFD）和连续介质力学领域。在本文中，我们提供了一个全面的研究概述，结合了机器学习（ML）和Fraunhofer的MESHFREE软件（www.meshfree.eu），这是一个利用数值点云进行广义有限差分法（GFDM）的强大工具。这个工具能有效处理复杂的流动领域、移动几何形状和自由表面，同时允许用户精细调整本地细化和质量参数，以实现计算时间和结果准确性之间的最佳平衡。然而，手动确定最佳参数组合对于经验较少的用户而言存在挑战。我们引入了一种新颖的ML优化方法，利用主动学习、回归树和可视化在MESHFREE模拟中。",
    "tldr": "该研究将机器学习与MESHFREE软件相结合，提出了一种新颖的ML优化方法，通过使用主动学习、回归树和可视化技术，在复杂流动领域中实现参数的自动选择。",
    "en_tdlr": "This study combines machine learning with MESHFREE software to propose a novel ML-optimized approach for automatic parameter selection in complex flow domains using active learning, regression tree, and visualization techniques."
}