{
    "title": "Decoy Effect In Search Interaction: Understanding User Behavior and Measuring System Vulnerability",
    "abstract": "arXiv:2403.18462v1 Announce Type: new  Abstract: This study examines the decoy effect's underexplored influence on user search interactions and methods for measuring information retrieval (IR) systems' vulnerability to this effect. It explores how decoy results alter users' interactions on search engine result pages, focusing on metrics like click-through likelihood, browsing time, and perceived document usefulness. By analyzing user interaction logs from multiple datasets, the study demonstrates that decoy results significantly affect users' behavior and perceptions. Furthermore, it investigates how different levels of task difficulty and user knowledge modify the decoy effect's impact, finding that easier tasks and lower knowledge levels lead to higher engagement with target documents. In terms of IR system evaluation, the study introduces the DEJA-VU metric to assess systems' susceptibility to the decoy effect, testing it on specific retrieval tasks. The results show differences in ",
    "link": "https://arxiv.org/abs/2403.18462",
    "context": "Title: Decoy Effect In Search Interaction: Understanding User Behavior and Measuring System Vulnerability\nAbstract: arXiv:2403.18462v1 Announce Type: new  Abstract: This study examines the decoy effect's underexplored influence on user search interactions and methods for measuring information retrieval (IR) systems' vulnerability to this effect. It explores how decoy results alter users' interactions on search engine result pages, focusing on metrics like click-through likelihood, browsing time, and perceived document usefulness. By analyzing user interaction logs from multiple datasets, the study demonstrates that decoy results significantly affect users' behavior and perceptions. Furthermore, it investigates how different levels of task difficulty and user knowledge modify the decoy effect's impact, finding that easier tasks and lower knowledge levels lead to higher engagement with target documents. In terms of IR system evaluation, the study introduces the DEJA-VU metric to assess systems' susceptibility to the decoy effect, testing it on specific retrieval tasks. The results show differences in ",
    "path": "papers/24/03/2403.18462.json",
    "total_tokens": 880,
    "translated_title": "搜索交互中的诱饵效应：理解用户行为和测量系统脆弱性",
    "translated_abstract": "本研究考察了诱饵效应对用户搜索交互的影响，以及衡量信息检索（IR）系统对这种影响的脆弱性的方法。它探讨了诱饵结果如何改变用户在搜索引擎结果页面上的交互，关注点击概率、浏览时间和感知文档有用性等指标。通过分析来自多个数据集的用户交互日志，研究表明诱饵结果显著影响用户行为和感知。此外，研究还调查了不同任务难度和用户知识水平如何修改诱饵效应的影响，发现更容易的任务和较低的知识水平会导致更高的目标文档参与度。在IR系统评估方面，研究引入了DEJA-VU指标来评估系统对诱饵效应的易感性，并在特定检索任务上进行测试。结果显示在系统上存在差异",
    "tldr": "该研究探讨了诱饵效应对用户搜索交互的影响，提出了新的衡量IR系统脆弱性的方法，并介绍了DEJA-VU指标来评估系统对诱饵效应的易感性。"
}