{
    "title": "Geometric Dynamics of Signal Propagation Predict Trainability of Transformers",
    "abstract": "arXiv:2403.02579v1 Announce Type: cross  Abstract: We investigate forward signal propagation and gradient back propagation in deep, randomly initialized transformers, yielding simple necessary and sufficient conditions on initialization hyperparameters that ensure trainability of deep transformers. Our approach treats the evolution of the representations of $n$ tokens as they propagate through the transformer layers in terms of a discrete time dynamical system of $n$ interacting particles. We derive simple update equations for the evolving geometry of this particle system, starting from a permutation symmetric simplex. Our update equations show that without MLP layers, this system will collapse to a line, consistent with prior work on rank collapse in transformers. However, unlike prior work, our evolution equations can quantitatively track particle geometry in the additional presence of nonlinear MLP layers, and it reveals an order-chaos phase transition as a function of initializatio",
    "link": "https://arxiv.org/abs/2403.02579",
    "context": "Title: Geometric Dynamics of Signal Propagation Predict Trainability of Transformers\nAbstract: arXiv:2403.02579v1 Announce Type: cross  Abstract: We investigate forward signal propagation and gradient back propagation in deep, randomly initialized transformers, yielding simple necessary and sufficient conditions on initialization hyperparameters that ensure trainability of deep transformers. Our approach treats the evolution of the representations of $n$ tokens as they propagate through the transformer layers in terms of a discrete time dynamical system of $n$ interacting particles. We derive simple update equations for the evolving geometry of this particle system, starting from a permutation symmetric simplex. Our update equations show that without MLP layers, this system will collapse to a line, consistent with prior work on rank collapse in transformers. However, unlike prior work, our evolution equations can quantitatively track particle geometry in the additional presence of nonlinear MLP layers, and it reveals an order-chaos phase transition as a function of initializatio",
    "path": "papers/24/03/2403.02579.json",
    "total_tokens": 889,
    "translated_title": "信号传播的几何动力学预测transformers的可训练性",
    "translated_abstract": "我们研究了深度、随机初始化的transformers中前向信号传播和梯度反向传播，得出了初始化超参数的简单必要和充分条件，确保深度transformers的可训练性。我们的方法将$n$个符号的表示随着它们通过transformer层传播视为$n$个相互作用粒子的离散时间动力系统。我们推导出这个粒子系统演化几何的简单更新方程，从一个置换对称单纯形开始。我们的更新方程表明，在没有MLP层的情况下，该系统将会坍缩成为一条线，与以前在transformers中秩坍缩的相关工作相一致。然而，不同于以往的研究，我们的演化方程能够定量跟踪粒子几何，包括非线性MLP层的额外存在，并且它揭示了作为初始化函数的有序-混沌相变。",
    "tldr": "研究探索了深度transformers中信号传播和梯度反向传播的动力学特性，提出了初始化超参数条件以确保训练的可行性，并发现了在有MLP层的情况下粒子几何的定量演化规律，揭示了初始化函数的有序-混沌相变。",
    "en_tdlr": "Investigate the geometric dynamics of signal propagation and gradient back propagation in deep transformers, establish conditions on initialization hyperparameters for ensuring trainability, and reveal quantitative evolution of particle geometry in the presence of MLP layers, unveiling an order-chaos phase transition as a function of initialization."
}