{
    "title": "Choose Your Own Adventure: Interactive E-Books to Improve Word Knowledge and Comprehension Skills",
    "abstract": "arXiv:2403.02496v1 Announce Type: new  Abstract: The purpose of this feasibility study was to examine the potential impact of reading digital interactive e-books on essential skills that support reading comprehension with third-fifth grade students. Students read two e-Books that taught word learning and comprehension monitoring strategies in the service of learning difficult vocabulary and targeted science concepts about hurricanes. We investigated whether specific comprehension strategies including word learning and strategies that supported general reading comprehension, summarization, and question generation, show promise of effectiveness in building vocabulary knowledge and comprehension skills in the e-Books. Students were assigned to read one of three versions of each of the e-Books, each version implemented one strategy. The books employed a choose-your-adventure format with embedded comprehension questions that provided students with immediate feedback on their responses. Pair",
    "link": "https://arxiv.org/abs/2403.02496",
    "context": "Title: Choose Your Own Adventure: Interactive E-Books to Improve Word Knowledge and Comprehension Skills\nAbstract: arXiv:2403.02496v1 Announce Type: new  Abstract: The purpose of this feasibility study was to examine the potential impact of reading digital interactive e-books on essential skills that support reading comprehension with third-fifth grade students. Students read two e-Books that taught word learning and comprehension monitoring strategies in the service of learning difficult vocabulary and targeted science concepts about hurricanes. We investigated whether specific comprehension strategies including word learning and strategies that supported general reading comprehension, summarization, and question generation, show promise of effectiveness in building vocabulary knowledge and comprehension skills in the e-Books. Students were assigned to read one of three versions of each of the e-Books, each version implemented one strategy. The books employed a choose-your-adventure format with embedded comprehension questions that provided students with immediate feedback on their responses. Pair",
    "path": "papers/24/03/2403.02496.json",
    "total_tokens": 851,
    "translated_title": "选择你的冒险：交互式电子书以提高词汇知识和理解能力",
    "translated_abstract": "这项可行性研究的目的是检查阅读数字交互式电子书对支持阅读理解的基本技能，特别是对三至五年级学生的潜在影响。学生阅读了两本电子书，教授单词学习和理解监控策略，以学习困难词汇和有关飓风的科学概念。我们调查了特定的理解策略，包括单词学习和支持一般阅读理解的策略，总结和问题生成，这些策略是否在电子书中在建立词汇知识和理解技能方面表现出有效性的潜力。学生被分配阅读三个版本中的一本电子书，每个版本实施一项策略。这些书采用了交互式选择冒险的格式，内嵌理解问题，提供即时反馈。",
    "tldr": "该研究检验了交互式电子书对三至五年级学生阅读理解和词汇知识的影响，通过采用选择冒险格式和内嵌理解问题的方式来教授单词学习和理解监控策略。",
    "en_tdlr": "This study examined the impact of interactive e-books on reading comprehension and vocabulary knowledge of third-fifth grade students, teaching word learning and comprehension monitoring strategies through a choose-your-adventure format with embedded comprehension questions."
}