{
    "title": "Data-Driven Distributionally Robust Safety Verification Using Barrier Certificates and Conditional Mean Embeddings",
    "abstract": "arXiv:2403.10497v1 Announce Type: cross  Abstract: Algorithmic verification of realistic systems to satisfy safety and other temporal requirements has suffered from poor scalability of the employed formal approaches. To design systems with rigorous guarantees, many approaches still rely on exact models of the underlying systems. Since this assumption can rarely be met in practice, models have to be inferred from measurement data or are bypassed completely. Whilst former usually requires the model structure to be known a-priori and immense amounts of data to be available, latter gives rise to a plethora of restrictive mathematical assumptions about the unknown dynamics. In a pursuit of developing scalable formal verification algorithms without shifting the problem to unrealistic assumptions, we employ the concept of barrier certificates, which can guarantee safety of the system, and learn the certificate directly from a compact set of system trajectories. We use conditional mean embeddi",
    "link": "https://arxiv.org/abs/2403.10497",
    "context": "Title: Data-Driven Distributionally Robust Safety Verification Using Barrier Certificates and Conditional Mean Embeddings\nAbstract: arXiv:2403.10497v1 Announce Type: cross  Abstract: Algorithmic verification of realistic systems to satisfy safety and other temporal requirements has suffered from poor scalability of the employed formal approaches. To design systems with rigorous guarantees, many approaches still rely on exact models of the underlying systems. Since this assumption can rarely be met in practice, models have to be inferred from measurement data or are bypassed completely. Whilst former usually requires the model structure to be known a-priori and immense amounts of data to be available, latter gives rise to a plethora of restrictive mathematical assumptions about the unknown dynamics. In a pursuit of developing scalable formal verification algorithms without shifting the problem to unrealistic assumptions, we employ the concept of barrier certificates, which can guarantee safety of the system, and learn the certificate directly from a compact set of system trajectories. We use conditional mean embeddi",
    "path": "papers/24/03/2403.10497.json",
    "total_tokens": 740,
    "translated_title": "使用屏障证明和条件均值嵌入的基于数据驱动的分布鲁棒安全验证",
    "translated_abstract": "实际系统的算法验证需要满足安全和其他时间要求，但所采用的形式方法的可扩展性较差。为设计具有严格保证的系统，许多方法仍依赖于底层系统的精确模型。由于这一假设在实践中很少能得到满足，因此必须从测量数据中推断模型或完全绕过模型。为了开发可扩展的形式验证算法而不将问题转移到不切实际的假设上，我们运用了屏障证明的概念，该证明可以保证系统的安全性，并直接从紧凑系统轨迹集中学习证明。",
    "tldr": "本研究采用屏障证明概念，并直接从系统轨迹集中学习证明，开发了可扩展的形式验证算法。",
    "en_tdlr": "This study develops scalable formal verification algorithms by using the concept of barrier certificates and directly learning certificates from a set of system trajectories."
}