{
    "title": "Graph Learning for Parameter Prediction of Quantum Approximate Optimization Algorithm",
    "abstract": "arXiv:2403.03310v1 Announce Type: cross  Abstract: In recent years, quantum computing has emerged as a transformative force in the field of combinatorial optimization, offering novel approaches to tackling complex problems that have long challenged classical computational methods. Among these, the Quantum Approximate Optimization Algorithm (QAOA) stands out for its potential to efficiently solve the Max-Cut problem, a quintessential example of combinatorial optimization. However, practical application faces challenges due to current limitations on quantum computational resource. Our work optimizes QAOA initialization, using Graph Neural Networks (GNN) as a warm-start technique. This sacrifices affordable computational resource on classical computer to reduce quantum computational resource overhead, enhancing QAOA's effectiveness. Experiments with various GNN architectures demonstrate the adaptability and stability of our framework, highlighting the synergy between quantum algorithms an",
    "link": "https://arxiv.org/abs/2403.03310",
    "context": "Title: Graph Learning for Parameter Prediction of Quantum Approximate Optimization Algorithm\nAbstract: arXiv:2403.03310v1 Announce Type: cross  Abstract: In recent years, quantum computing has emerged as a transformative force in the field of combinatorial optimization, offering novel approaches to tackling complex problems that have long challenged classical computational methods. Among these, the Quantum Approximate Optimization Algorithm (QAOA) stands out for its potential to efficiently solve the Max-Cut problem, a quintessential example of combinatorial optimization. However, practical application faces challenges due to current limitations on quantum computational resource. Our work optimizes QAOA initialization, using Graph Neural Networks (GNN) as a warm-start technique. This sacrifices affordable computational resource on classical computer to reduce quantum computational resource overhead, enhancing QAOA's effectiveness. Experiments with various GNN architectures demonstrate the adaptability and stability of our framework, highlighting the synergy between quantum algorithms an",
    "path": "papers/24/03/2403.03310.json",
    "total_tokens": 790,
    "translated_title": "图学习用于量子近似优化算法参数预测",
    "translated_abstract": "近年来，量子计算已经成为组合优化领域中的一股变革力量，提供了处理长期以来挑战经典计算方法的复杂问题的新方法。其中，量子近似优化算法（QAOA）以其潜力在高效解决Max-Cut问题上脱颖而出。然而，由于目前量子计算资源的限制，实际应用面临挑战。我们的工作优化了QAOA初始化，使用图神经网络（GNN）作为热启动技术。这牺牲了在经典计算机上的可负担的计算资源，以减少量子计算资源开销，增强了QAOA的效果。对各种GNN架构进行的实验表明了我们框架的适应性和稳定性，凸显了量子算法和GNN之间的协同作用。",
    "tldr": "本研究利用图神经网络为量子近似优化算法提供参数预测，实现了在减少量子计算资源开销的同时增强算法效果。",
    "en_tdlr": "Using Graph Neural Networks as warm-start technique, this study optimizes the initialization of Quantum Approximate Optimization Algorithm to reduce quantum computational resource overhead while enhancing algorithm effectiveness."
}