{
    "title": "Improved discrete particle swarm optimization using Bee Algorithm and multi-parent crossover method (Case study: Allocation problem and benchmark functions)",
    "abstract": "arXiv:2403.10684v1 Announce Type: cross  Abstract: Compared to other techniques, particle swarm optimization is more frequently utilized because of its ease of use and low variability. However, it is complicated to find the best possible solution in the search space in large-scale optimization problems. Moreover, changing algorithm variables does not influence algorithm convergence much. The PSO algorithm can be combined with other algorithms. It can use their advantages and operators to solve this problem. Therefore, this paper proposes the onlooker multi-parent crossover discrete particle swarm optimization (OMPCDPSO). To improve the efficiency of the DPSO algorithm, we utilized multi-parent crossover on the best solutions. We performed an independent and intensive neighborhood search using the onlooker bees of the bee algorithm. The algorithm uses onlooker bees and crossover. They do local search (exploitation) and global search (exploration). Each of these searches is among the bes",
    "link": "https://arxiv.org/abs/2403.10684",
    "context": "Title: Improved discrete particle swarm optimization using Bee Algorithm and multi-parent crossover method (Case study: Allocation problem and benchmark functions)\nAbstract: arXiv:2403.10684v1 Announce Type: cross  Abstract: Compared to other techniques, particle swarm optimization is more frequently utilized because of its ease of use and low variability. However, it is complicated to find the best possible solution in the search space in large-scale optimization problems. Moreover, changing algorithm variables does not influence algorithm convergence much. The PSO algorithm can be combined with other algorithms. It can use their advantages and operators to solve this problem. Therefore, this paper proposes the onlooker multi-parent crossover discrete particle swarm optimization (OMPCDPSO). To improve the efficiency of the DPSO algorithm, we utilized multi-parent crossover on the best solutions. We performed an independent and intensive neighborhood search using the onlooker bees of the bee algorithm. The algorithm uses onlooker bees and crossover. They do local search (exploitation) and global search (exploration). Each of these searches is among the bes",
    "path": "papers/24/03/2403.10684.json",
    "total_tokens": 905,
    "translated_title": "使用蜂群算法和多父代交叉方法改进的离散粒子群优化（案例研究：分配问题和基准函数）",
    "translated_abstract": "与其他技术相比，粒子群优化更常被使用，因为它易于使用且变异性低。然而，在大规模优化问题的搜索空间中找到最佳解决方案是复杂的。此外，改变算法变量并不会对算法的收敛产生很大影响。PSO算法可以与其他算法结合使用，利用它们的优势和运算符来解决问题。因此，本文提出了适用于观察者多父代交叉离散粒子群优化（OMPCDPSO）。为了改进DPSO算法的效率，我们在最佳解决方案上使用了多父代交叉。我们利用蜂群算法的观察者蜜蜂进行独立且密集的邻域搜索。该算法利用观察者蜜蜂和交叉。它们进行局部搜索（开发）和全局搜索（探索）。这些搜索中的每一个都是最佳的。",
    "tldr": "本文提出了一种结合了蜂群算法和多父代交叉的离散粒子群优化算法，通过利用观察者蜜蜂进行独立且密集的邻域搜索来改进算法效率。",
    "en_tdlr": "This paper proposes a discrete particle swarm optimization algorithm that combines Bee Algorithm and multi-parent crossover, aiming to improve algorithm efficiency by utilizing onlooker bees for independent and intensive neighborhood search."
}