{
    "title": "Text-Guided Variational Image Generation for Industrial Anomaly Detection and Segmentation",
    "abstract": "arXiv:2403.06247v1 Announce Type: cross  Abstract: We propose a text-guided variational image generation method to address the challenge of getting clean data for anomaly detection in industrial manufacturing. Our method utilizes text information about the target object, learned from extensive text library documents, to generate non-defective data images resembling the input image. The proposed framework ensures that the generated non-defective images align with anticipated distributions derived from textual and image-based knowledge, ensuring stability and generality. Experimental results demonstrate the effectiveness of our approach, surpassing previous methods even with limited non-defective data. Our approach is validated through generalization tests across four baseline models and three distinct datasets. We present an additional analysis to enhance the effectiveness of anomaly detection models by utilizing the generated images.",
    "link": "https://arxiv.org/abs/2403.06247",
    "context": "Title: Text-Guided Variational Image Generation for Industrial Anomaly Detection and Segmentation\nAbstract: arXiv:2403.06247v1 Announce Type: cross  Abstract: We propose a text-guided variational image generation method to address the challenge of getting clean data for anomaly detection in industrial manufacturing. Our method utilizes text information about the target object, learned from extensive text library documents, to generate non-defective data images resembling the input image. The proposed framework ensures that the generated non-defective images align with anticipated distributions derived from textual and image-based knowledge, ensuring stability and generality. Experimental results demonstrate the effectiveness of our approach, surpassing previous methods even with limited non-defective data. Our approach is validated through generalization tests across four baseline models and three distinct datasets. We present an additional analysis to enhance the effectiveness of anomaly detection models by utilizing the generated images.",
    "path": "papers/24/03/2403.06247.json",
    "total_tokens": 755,
    "translated_title": "基于文本引导的变分图像生成用于工业异常检测和分割",
    "translated_abstract": "我们提出了一种文本引导的变分图像生成方法，以解决工业制造中异常检测的干净数据获取挑战。我们的方法利用来自广泛文本库文档的关于目标对象的文本信息，生成类似输入图像的无缺陷数据图像。所提出的框架确保生成的无缺陷图像与来自文本和图像知识的预期分布保持一致，确保稳定性和普适性。实验结果表明了我们的方法的有效性，即使只有有限的无缺陷数据，也能超越先前的方法。我们的方法通过跨四个基准模型和三个不同数据集进行泛化测试进行了验证。我们提出了一种利用生成图像增强异常检测模型效果的额外分析。",
    "tldr": "该方法利用文本信息生成类似输入图像的无缺陷数据图像，确保生成的图像符合期望分布，稳定且具有普适性。",
    "en_tdlr": "The method utilizes text information to generate non-defective data images resembling the input image, ensuring the generated images align with anticipated distributions, stable and generalizable."
}