{
    "title": "DeepTraderX: Challenging Conventional Trading Strategies with Deep Learning in Multi-Threaded Market Simulations",
    "abstract": "arXiv:2403.18831v1 Announce Type: cross  Abstract: In this paper, we introduce DeepTraderX (DTX), a simple Deep Learning-based trader, and present results that demonstrate its performance in a multi-threaded market simulation. In a total of about 500 simulated market days, DTX has learned solely by watching the prices that other strategies produce. By doing this, it has successfully created a mapping from market data to quotes, either bid or ask orders, to place for an asset. Trained on historical Level-2 market data, i.e., the Limit Order Book (LOB) for specific tradable assets, DTX processes the market state $S$ at each timestep $T$ to determine a price $P$ for market orders. The market data used in both training and testing was generated from unique market schedules based on real historic stock market data. DTX was tested extensively against the best strategies in the literature, with its results validated by statistical analysis. Our findings underscore DTX's capability to rival, a",
    "link": "https://arxiv.org/abs/2403.18831",
    "context": "Title: DeepTraderX: Challenging Conventional Trading Strategies with Deep Learning in Multi-Threaded Market Simulations\nAbstract: arXiv:2403.18831v1 Announce Type: cross  Abstract: In this paper, we introduce DeepTraderX (DTX), a simple Deep Learning-based trader, and present results that demonstrate its performance in a multi-threaded market simulation. In a total of about 500 simulated market days, DTX has learned solely by watching the prices that other strategies produce. By doing this, it has successfully created a mapping from market data to quotes, either bid or ask orders, to place for an asset. Trained on historical Level-2 market data, i.e., the Limit Order Book (LOB) for specific tradable assets, DTX processes the market state $S$ at each timestep $T$ to determine a price $P$ for market orders. The market data used in both training and testing was generated from unique market schedules based on real historic stock market data. DTX was tested extensively against the best strategies in the literature, with its results validated by statistical analysis. Our findings underscore DTX's capability to rival, a",
    "path": "papers/24/03/2403.18831.json",
    "total_tokens": 893,
    "translated_title": "DeepTraderX: 使用深度学习挑战传统交易策略在多线程市场模拟中的表现",
    "translated_abstract": "在这篇论文中，我们介绍了DeepTraderX（DTX），这是一个简单基于深度学习的交易系统，并展示了它在多线程市场模拟中的表现。在大约500个模拟市场交易日中，DTX仅通过观察其他策略产生的价格进行学习。通过这样做，它成功地创建了一种从市场数据到要为某个资产下达的报价（买入或卖出订单）的映射关系。DTX在历史Level-2市场数据（即特定可交易资产的限价订单簿）上进行训练，处理每个时间步骤$T$的市场状态$S$，以确定市场订单的价格$P$。训练和测试中使用的市场数据是基于真实历史股票市场数据生成的独特市场时间表。DTX经过了与文献中最佳策略的大量测试，其结果经过了统计分析验证。我们的发现强调了DTX与最佳策略匹敌的能力。",
    "tldr": "DeepTraderX是一个使用深度学习的交易系统，在多线程市场模拟中表现出色，并且可以与文献中最佳策略匹敌。",
    "en_tdlr": "DeepTraderX is a trading system using deep learning that performs well in multi-threaded market simulations and can rival the best strategies in the literature."
}