{
    "title": "Mamba4Rec: Towards Efficient Sequential Recommendation with Selective State Space Models",
    "abstract": "arXiv:2403.03900v1 Announce Type: new  Abstract: Sequential recommendation aims to estimate the dynamic user preferences and sequential dependencies among historical user behaviors. Although Transformer-based models have proven to be effective for sequential recommendation, they suffer from the inference inefficiency problem stemming from the quadratic computational complexity of attention operators, especially for long-range behavior sequences. Inspired by the recent success of state space models (SSMs), we propose Mamba4Rec, which is the first work to explore the potential of selective SSMs for efficient sequential recommendation. Built upon the basic Mamba block which is a selective SSM with an efficient hardware-aware parallel algorithm, we incorporate a series of sequential modeling techniques to further promote the model performance and meanwhile maintain the inference efficiency. Experiments on two public datasets demonstrate that Mamba4Rec is able to well address the effectiven",
    "link": "https://arxiv.org/abs/2403.03900",
    "context": "Title: Mamba4Rec: Towards Efficient Sequential Recommendation with Selective State Space Models\nAbstract: arXiv:2403.03900v1 Announce Type: new  Abstract: Sequential recommendation aims to estimate the dynamic user preferences and sequential dependencies among historical user behaviors. Although Transformer-based models have proven to be effective for sequential recommendation, they suffer from the inference inefficiency problem stemming from the quadratic computational complexity of attention operators, especially for long-range behavior sequences. Inspired by the recent success of state space models (SSMs), we propose Mamba4Rec, which is the first work to explore the potential of selective SSMs for efficient sequential recommendation. Built upon the basic Mamba block which is a selective SSM with an efficient hardware-aware parallel algorithm, we incorporate a series of sequential modeling techniques to further promote the model performance and meanwhile maintain the inference efficiency. Experiments on two public datasets demonstrate that Mamba4Rec is able to well address the effectiven",
    "path": "papers/24/03/2403.03900.json",
    "total_tokens": 680,
    "translated_title": "Mamba4Rec：针对具有选择性状态空间模型的高效序列推荐",
    "translated_abstract": "序列推荐旨在估计动态用户偏好和历史用户行为之间的顺序依赖关系。本文提出了Mamba4Rec，这是首个探索选择性SSM潜力以实现高效序列推荐的工作。通过基本的Mamba块构建，结合一系列顺序建模技术，我们进一步提升了模型性能，同时保持了推断效率。实验证明，Mamba4Rec能够很好地处理序列推荐的有效性问题。",
    "tldr": "Mamba4Rec是首个探索选择性状态空间模型用于高效序列推荐的工作，能够在保持推断效率的同时提升模型性能。",
    "en_tdlr": "Mamba4Rec is the first work to explore the potential of selective state space models for efficient sequential recommendation, able to enhance model performance while maintaining inference efficiency."
}