{
    "title": "From Factor Models to Deep Learning: Machine Learning in Reshaping Empirical Asset Pricing",
    "abstract": "arXiv:2403.06779v1 Announce Type: new  Abstract: This paper comprehensively reviews the application of machine learning (ML) and AI in finance, specifically in the context of asset pricing. It starts by summarizing the traditional asset pricing models and examining their limitations in capturing the complexities of financial markets. It explores how 1) ML models, including supervised, unsupervised, semi-supervised, and reinforcement learning, provide versatile frameworks to address these complexities, and 2) the incorporation of advanced ML algorithms into traditional financial models enhances return prediction and portfolio optimization. These methods can adapt to changing market dynamics by modeling structural changes and incorporating heterogeneous data sources, such as text and images. In addition, this paper explores challenges in applying ML in asset pricing, addressing the growing demand for explainability in decision-making and mitigating overfitting in complex models. This pap",
    "link": "https://arxiv.org/abs/2403.06779",
    "context": "Title: From Factor Models to Deep Learning: Machine Learning in Reshaping Empirical Asset Pricing\nAbstract: arXiv:2403.06779v1 Announce Type: new  Abstract: This paper comprehensively reviews the application of machine learning (ML) and AI in finance, specifically in the context of asset pricing. It starts by summarizing the traditional asset pricing models and examining their limitations in capturing the complexities of financial markets. It explores how 1) ML models, including supervised, unsupervised, semi-supervised, and reinforcement learning, provide versatile frameworks to address these complexities, and 2) the incorporation of advanced ML algorithms into traditional financial models enhances return prediction and portfolio optimization. These methods can adapt to changing market dynamics by modeling structural changes and incorporating heterogeneous data sources, such as text and images. In addition, this paper explores challenges in applying ML in asset pricing, addressing the growing demand for explainability in decision-making and mitigating overfitting in complex models. This pap",
    "path": "papers/24/03/2403.06779.json",
    "total_tokens": 865,
    "translated_title": "从因子模型到深度学习：机器学习对实证资产定价的重塑",
    "translated_abstract": "本文全面回顾了机器学习（ML）和人工智能在金融领域，特别是在资产定价领域的应用。首先总结了传统的资产定价模型，并检验其在捕捉金融市场复杂性方面的局限性。文章探讨了1）ML模型（包括监督学习、无监督学习、半监督学习和强化学习）如何提供多功能框架来解决这些复杂性，并2）将先进的ML算法纳入传统金融模型中如何加强回报预测和组合优化。这些方法可以通过建模结构性变化和整合文本和图像等异构数据源适应不断变化的市场动态。此外，本文探讨了在资产定价中应用ML面临的挑战，涉及在决策中越来越多的解释需求以及在复杂模型中缓解过拟合问题。",
    "tldr": "本文全面回顾了机器学习和人工智能在金融领域应用，探讨了ML模型如何改善资产回报预测和组合优化，以及在应用ML中面临的挑战。",
    "en_tdlr": "This paper comprehensively reviews the application of machine learning and AI in finance, explores how ML models improve asset return prediction and portfolio optimization, and addresses challenges in applying ML."
}