{
    "title": "Backtracing: Retrieving the Cause of the Query",
    "abstract": "arXiv:2403.03956v1 Announce Type: cross  Abstract: Many online content portals allow users to ask questions to supplement their understanding (e.g., of lectures). While information retrieval (IR) systems may provide answers for such user queries, they do not directly assist content creators -- such as lecturers who want to improve their content -- identify segments that _caused_ a user to ask those questions. We introduce the task of backtracing, in which systems retrieve the text segment that most likely caused a user query. We formalize three real-world domains for which backtracing is important in improving content delivery and communication: understanding the cause of (a) student confusion in the Lecture domain, (b) reader curiosity in the News Article domain, and (c) user emotion in the Conversation domain. We evaluate the zero-shot performance of popular information retrieval methods and language modeling methods, including bi-encoder, re-ranking and likelihood-based methods and ",
    "link": "https://arxiv.org/abs/2403.03956",
    "context": "Title: Backtracing: Retrieving the Cause of the Query\nAbstract: arXiv:2403.03956v1 Announce Type: cross  Abstract: Many online content portals allow users to ask questions to supplement their understanding (e.g., of lectures). While information retrieval (IR) systems may provide answers for such user queries, they do not directly assist content creators -- such as lecturers who want to improve their content -- identify segments that _caused_ a user to ask those questions. We introduce the task of backtracing, in which systems retrieve the text segment that most likely caused a user query. We formalize three real-world domains for which backtracing is important in improving content delivery and communication: understanding the cause of (a) student confusion in the Lecture domain, (b) reader curiosity in the News Article domain, and (c) user emotion in the Conversation domain. We evaluate the zero-shot performance of popular information retrieval methods and language modeling methods, including bi-encoder, re-ranking and likelihood-based methods and ",
    "path": "papers/24/03/2403.03956.json",
    "total_tokens": 816,
    "translated_title": "回溯：检索查询原因",
    "translated_abstract": "许多在线内容门户允许用户提出问题以补充他们的理解（例如，对讲座的理解）。虽然信息检索（IR）系统可以为这类用户查询提供答案，但它们并不直接帮助内容创建者（如希望改进内容的讲师）识别引发用户提出这些问题的段落。我们引入了回溯任务，系统检索出最有可能引发用户查询的文本段。我们对提高内容传递和沟通中重要的回溯任务进行了三个现实世界领域的形式化：（a）讲座领域中学生困惑的原因，（b）新闻文章领域中读者好奇心的原因，以及（c）对话领域中用户情绪的原因。我们评估了流行的信息检索方法和语言建模方法的零次性能，包括双编码器、重新排序和基于可能性的方法。",
    "tldr": "引入了回溯任务，通过检索文本段来确定引发用户查询的原因，涉及到不同领域，包括讲座、新闻和对话，评估了零次性能。",
    "en_tdlr": "Introducing the backtracing task to retrieve text segments that likely caused user queries across various domains and evaluating zero-shot performance of popular methods."
}