{
    "title": "Investigating Changes of Water Quality in Reservoirs based on Flood and Inflow Fluctuations",
    "abstract": "arXiv:2403.05671v1 Announce Type: new  Abstract: Water temperature and dissolved oxygen are essential indicators of water quality and ecosystem sustainability. Lately, heavy rainfalls are happening frequently and forcefully affecting the thermal structure and mixing layers in depth by sharply increasing the volume of inflow entitled flash flood. It can occur by sudden intense precipitation and develop within minutes or hours. Because of heavy debris load and speedy water, this phenomenon has remarkable effects on water quality. A higher flow during floods may worsens water quality at lakes and reservoirs that are thermally stratified (with separate density layers) and decrease dissolved oxygen content. However, it is unclear how well these parameters represent the response of lakes to changes in volume discharge. To address this question, researchers simulate the thermal structure in two stratified reservoirs, considering the Rajae reservoir as a representative reservoir in the north o",
    "link": "https://arxiv.org/abs/2403.05671",
    "context": "Title: Investigating Changes of Water Quality in Reservoirs based on Flood and Inflow Fluctuations\nAbstract: arXiv:2403.05671v1 Announce Type: new  Abstract: Water temperature and dissolved oxygen are essential indicators of water quality and ecosystem sustainability. Lately, heavy rainfalls are happening frequently and forcefully affecting the thermal structure and mixing layers in depth by sharply increasing the volume of inflow entitled flash flood. It can occur by sudden intense precipitation and develop within minutes or hours. Because of heavy debris load and speedy water, this phenomenon has remarkable effects on water quality. A higher flow during floods may worsens water quality at lakes and reservoirs that are thermally stratified (with separate density layers) and decrease dissolved oxygen content. However, it is unclear how well these parameters represent the response of lakes to changes in volume discharge. To address this question, researchers simulate the thermal structure in two stratified reservoirs, considering the Rajae reservoir as a representative reservoir in the north o",
    "path": "papers/24/03/2403.05671.json",
    "total_tokens": 865,
    "translated_title": "基于洪水和入流波动的水库水质变化研究",
    "translated_abstract": "水温和溶解氧是水质和生态系统可持续性的重要指标。近年来，频繁且强烈的暴雨频繁发生，通过急剧增加称为暴洪的入流量，对水体的热结构和混合层深度产生影响。暴洪可以由突发的强降水事件在几分钟或几小时内发展而成。由于大量杂物和快速流动的水体，这种现象对水质有显着影响。洪水期间流量较大可能会恶化热层分层（具有不同密度层）的水体质量，并降低溶解氧含量。然而，目前尚不清楚这些参数能多好地代表湖泊对体量排放变化的响应。为解决这一问题，研究人员模拟了考虑拉贾涵养库为代表的两个分层水库的热结构。",
    "tldr": "研究者模拟了两个分层水库的热结构以探讨洪水时水质的变化，发现洪水期间流量增加可能造成水质恶化和溶解氧含量下降。"
}