{
    "title": "Book2Dial: Generating Teacher-Student Interactions from Textbooks for Cost-Effective Development of Educational Chatbots",
    "abstract": "arXiv:2403.03307v1 Announce Type: new  Abstract: Educational chatbots are a promising tool for assisting student learning. However, the development of effective chatbots in education has been challenging, as high-quality data is seldom available in this domain. In this paper, we propose a framework for generating synthetic teacher-student interactions grounded in a set of textbooks. Our approaches capture one aspect of learning interactions where curious students with partial knowledge interactively ask a teacher questions about the material in the textbook. We highlight various quality criteria that such dialogues should fulfill and compare several approaches relying on either prompting or fine-tuning large language models. We use synthetic dialogues to train educational chatbots and show benefits of further fine-tuning in different educational domains. However, human evaluation shows that our best data synthesis method still suffers from hallucinations and tends to reiterate informat",
    "link": "https://arxiv.org/abs/2403.03307",
    "context": "Title: Book2Dial: Generating Teacher-Student Interactions from Textbooks for Cost-Effective Development of Educational Chatbots\nAbstract: arXiv:2403.03307v1 Announce Type: new  Abstract: Educational chatbots are a promising tool for assisting student learning. However, the development of effective chatbots in education has been challenging, as high-quality data is seldom available in this domain. In this paper, we propose a framework for generating synthetic teacher-student interactions grounded in a set of textbooks. Our approaches capture one aspect of learning interactions where curious students with partial knowledge interactively ask a teacher questions about the material in the textbook. We highlight various quality criteria that such dialogues should fulfill and compare several approaches relying on either prompting or fine-tuning large language models. We use synthetic dialogues to train educational chatbots and show benefits of further fine-tuning in different educational domains. However, human evaluation shows that our best data synthesis method still suffers from hallucinations and tends to reiterate informat",
    "path": "papers/24/03/2403.03307.json",
    "total_tokens": 951,
    "translated_title": "Book2Dial:从教科书中生成教师-学生互动，以实现教育聊天机器人的成本效益开发",
    "translated_abstract": "教育聊天机器人是辅助学生学习的有前景的工具。然而，在教育领域，开发有效的聊天机器人一直是具有挑战性的，因为很少有高质量的数据可用。在本文中，我们提出了一个框架，用于生成基于一组教科书的合成教师-学生互动。我们的方法捕捉了学习互动的一个方面，即对材料产生兴趣的部分知识的学生与老师互动地向老师提出关于教科书中内容的问题。我们强调了这种对话应满足的各种质量标准，并比较了几种依赖于提示或对大型语言模型进行微调的方法。我们使用合成对话来训练教育聊天机器人，并展示了进一步在不同教育领域进行微调的好处。然而，人类评估表明，我们最佳的数据综合方法仍然存在幻觉，并且倾向于重复信息。",
    "tldr": "本文提出了一个基于教科书生成合成教师-学生互动的框架，用于开发教育聊天机器人，展示了使用合成对话训练教育聊天机器人的好处，并比较了几种方法，但最佳数据综合方法仍存在幻觉和重复信息问题。",
    "en_tdlr": "This paper introduces a framework for generating synthetic teacher-student interactions from textbooks for developing educational chatbots, showing the benefits of training educational chatbots using synthetic dialogues and comparing various methods, with the best data synthesis method still facing hallucination and repetition issues."
}