{
    "title": "SymboSLAM: Semantic Map Generation in a Multi-Agent System",
    "abstract": "arXiv:2403.15504v1 Announce Type: new  Abstract: Sub-symbolic artificial intelligence methods dominate the fields of environment-type classification and Simultaneous Localisation and Mapping. However, a significant area overlooked within these fields is solution transparency for the human-machine interaction space, as the sub-symbolic methods employed for map generation do not account for the explainability of the solutions generated. This paper proposes a novel approach to environment-type classification through Symbolic Simultaneous Localisation and Mapping, SymboSLAM, to bridge the explainability gap. Our method for environment-type classification observes ontological reasoning used to synthesise the context of an environment through the features found within. We achieve explainability within the model by presenting operators with environment-type classifications overlayed by a semantically labelled occupancy map of landmarks and features. We evaluate SymboSLAM with ground-truth map",
    "link": "https://arxiv.org/abs/2403.15504",
    "context": "Title: SymboSLAM: Semantic Map Generation in a Multi-Agent System\nAbstract: arXiv:2403.15504v1 Announce Type: new  Abstract: Sub-symbolic artificial intelligence methods dominate the fields of environment-type classification and Simultaneous Localisation and Mapping. However, a significant area overlooked within these fields is solution transparency for the human-machine interaction space, as the sub-symbolic methods employed for map generation do not account for the explainability of the solutions generated. This paper proposes a novel approach to environment-type classification through Symbolic Simultaneous Localisation and Mapping, SymboSLAM, to bridge the explainability gap. Our method for environment-type classification observes ontological reasoning used to synthesise the context of an environment through the features found within. We achieve explainability within the model by presenting operators with environment-type classifications overlayed by a semantically labelled occupancy map of landmarks and features. We evaluate SymboSLAM with ground-truth map",
    "path": "papers/24/03/2403.15504.json",
    "total_tokens": 763,
    "translated_title": "SymboSLAM: 多Agent系统中的语义地图生成",
    "translated_abstract": "Sub-symbolic人工智能方法在环境分类和同时定位与地图制图领域占主导地位。然而，在这些领域中被忽视的一个重要领域是解决方案透明性，因为用于地图生成的次符号方法并未考虑所生成解决方案的可解释性。本文提出了一种新颖的环境分类方法，通过符号同时定位与地图制图，即SymboSLAM，来弥补可解释性差距。我们的环境分类方法通过观察本体推理，以合成环境的上下文，通过所发现的特征。我们通过向操作员呈现叠加了语义标记的地标和特征的环境分类，实现了模型内的可解释性。我们通过地面实况评估了SymboSLAM。",
    "tldr": "SymboSLAM提出了一种新颖的方法，通过符号化同时定位和地图制图来实现环境分类，解决了解决方案的可解释性问题。",
    "en_tdlr": "SymboSLAM proposes a novel approach to environment-type classification through Symbolic Simultaneous Localisation and Mapping, addressing the issue of solution transparency."
}