{
    "title": "Establishing a leader in a pairwise comparisons method",
    "abstract": "arXiv:2403.14885v1 Announce Type: new  Abstract: Abstract Like electoral systems, decision-making methods are also vulnerable to manipulation by decision-makers. The ability to effectively defend against such threats can only come from thoroughly understanding the manipulation mechanisms. In the presented article, we show two algorithms that can be used to launch a manipulation attack. They allow for equating the weights of two selected alternatives in the pairwise comparison method and, consequently, choosing a leader. The theoretical considerations are accompanied by a Monte Carlo simulation showing the relationship between the size of the PC matrix, the degree of inconsistency, and the ease of manipulation. This work is a continuation of our previous research published in the paper (Szybowski et al., 2023)",
    "link": "https://arxiv.org/abs/2403.14885",
    "context": "Title: Establishing a leader in a pairwise comparisons method\nAbstract: arXiv:2403.14885v1 Announce Type: new  Abstract: Abstract Like electoral systems, decision-making methods are also vulnerable to manipulation by decision-makers. The ability to effectively defend against such threats can only come from thoroughly understanding the manipulation mechanisms. In the presented article, we show two algorithms that can be used to launch a manipulation attack. They allow for equating the weights of two selected alternatives in the pairwise comparison method and, consequently, choosing a leader. The theoretical considerations are accompanied by a Monte Carlo simulation showing the relationship between the size of the PC matrix, the degree of inconsistency, and the ease of manipulation. This work is a continuation of our previous research published in the paper (Szybowski et al., 2023)",
    "path": "papers/24/03/2403.14885.json",
    "total_tokens": 762,
    "translated_title": "在一种成对比较方法中建立领导者",
    "translated_abstract": "像选举制度一样，决策方法也容易受到决策者的操纵。有效防御这些威胁的能力只能来自对操纵机制的深入了解。在本文中，我们展示了两种可以用来发动操纵攻击的算法。它们可以在成对比较方法中使两个选择的替代方案的权重相等，并因此选择一个领导者。理论考虑与蒙特卡洛模拟相伴随，展示了PC矩阵的大小、不一致程度和操纵的轻松程度之间的关系。这项工作是我们之前研究的延续，发表在(Szybowski et al., 2023)的论文中。",
    "tldr": "该论文展示了两种算法，可以在成对比较方法中实现操纵攻击，进而选择领导者，并通过模拟分析展示了PC矩阵大小、不一致程度和操纵轻松程度之间的关系。",
    "en_tdlr": "This paper presents two algorithms that can manipulate the pairwise comparison method to choose a leader, accompanied by a simulation analysis on the relationship between the size of the PC matrix, the degree of inconsistency, and the ease of manipulation."
}