{
    "title": "Towards Single-System Illusion in Software-Defined Vehicles -- Automated, AI-Powered Workflow",
    "abstract": "arXiv:2403.14460v1 Announce Type: cross  Abstract: We propose a novel model- and feature-based approach to development of vehicle software systems, where the end architecture is not explicitly defined. Instead, it emerges from an iterative process of search and optimization given certain constraints, requirements and hardware architecture, while retaining the property of single-system illusion, where applications run in a logically uniform environment. One of the key points of the presented approach is the inclusion of modern generative AI, specifically Large Language Models (LLMs), in the loop. With the recent advances in the field, we expect that the LLMs will be able to assist in processing of requirements, generation of formal system models, as well as generation of software deployment specification and test code. The resulting pipeline is automated to a large extent, with feedback being generated at each step.",
    "link": "https://arxiv.org/abs/2403.14460",
    "context": "Title: Towards Single-System Illusion in Software-Defined Vehicles -- Automated, AI-Powered Workflow\nAbstract: arXiv:2403.14460v1 Announce Type: cross  Abstract: We propose a novel model- and feature-based approach to development of vehicle software systems, where the end architecture is not explicitly defined. Instead, it emerges from an iterative process of search and optimization given certain constraints, requirements and hardware architecture, while retaining the property of single-system illusion, where applications run in a logically uniform environment. One of the key points of the presented approach is the inclusion of modern generative AI, specifically Large Language Models (LLMs), in the loop. With the recent advances in the field, we expect that the LLMs will be able to assist in processing of requirements, generation of formal system models, as well as generation of software deployment specification and test code. The resulting pipeline is automated to a large extent, with feedback being generated at each step.",
    "path": "papers/24/03/2403.14460.json",
    "total_tokens": 833,
    "translated_title": "实现软件定义车辆中的单一系统错觉 -- 自动化、人工智能驱动的工作流程",
    "translated_abstract": "我们提出了一种基于模型和特征的新颖方法来开发车辆软件系统，其中最终架构并未明确定义。相反，它是从一系列搜索和优化的迭代过程中出现的，有特定的约束、需求和硬件架构，同时保持单一系统错觉的特性，其中应用在逻辑上统一的环境中运行。所提出的方法的一个关键点是在循环中包含现代生成式人工智能，特别是大型语言模型（LLMs）。随着该领域的最新进展，我们期望LLMs能够辅助处理需求、生成形式系统模型，以及生成软件部署规范和测试代码。结果管道在很大程度上是自动化的，每一步都会生成反馈。",
    "tldr": "提出了一种基于模型和特征的新方法，通过迭代搜索和优化的过程中出现最终架构，同时保持单一系统错觉特性，并将现代生成式人工智能引入其中，从而实现对车辆软件系统的自动化开发。",
    "en_tdlr": "A novel model- and feature-based approach is proposed to develop vehicle software systems, where the end architecture emerges from an iterative process of search and optimization, retaining the property of single-system illusion, and incorporating modern generative AI to achieve automated development of vehicle software systems."
}