{
    "title": "Imitation Learning Datasets: A Toolkit For Creating Datasets, Training Agents and Benchmarking",
    "abstract": "arXiv:2403.00550v1 Announce Type: cross  Abstract: Imitation learning field requires expert data to train agents in a task. Most often, this learning approach suffers from the absence of available data, which results in techniques being tested on its dataset. Creating datasets is a cumbersome process requiring researchers to train expert agents from scratch, record their interactions and test each benchmark method with newly created data. Moreover, creating new datasets for each new technique results in a lack of consistency in the evaluation process since each dataset can drastically vary in state and action distribution. In response, this work aims to address these issues by creating Imitation Learning Datasets, a toolkit that allows for: (i) curated expert policies with multithreaded support for faster dataset creation; (ii) readily available datasets and techniques with precise measurements; and (iii) sharing implementations of common imitation learning techniques. Demonstration li",
    "link": "https://arxiv.org/abs/2403.00550",
    "context": "Title: Imitation Learning Datasets: A Toolkit For Creating Datasets, Training Agents and Benchmarking\nAbstract: arXiv:2403.00550v1 Announce Type: cross  Abstract: Imitation learning field requires expert data to train agents in a task. Most often, this learning approach suffers from the absence of available data, which results in techniques being tested on its dataset. Creating datasets is a cumbersome process requiring researchers to train expert agents from scratch, record their interactions and test each benchmark method with newly created data. Moreover, creating new datasets for each new technique results in a lack of consistency in the evaluation process since each dataset can drastically vary in state and action distribution. In response, this work aims to address these issues by creating Imitation Learning Datasets, a toolkit that allows for: (i) curated expert policies with multithreaded support for faster dataset creation; (ii) readily available datasets and techniques with precise measurements; and (iii) sharing implementations of common imitation learning techniques. Demonstration li",
    "path": "papers/24/03/2403.00550.json",
    "total_tokens": 904,
    "translated_title": "模仿学习数据集：创建数据集、训练智能体和进行基准测试的工具包",
    "translated_abstract": "模仿学习领域需要专家数据来训练智能体完成任务。然而，这种学习方法常常因缺乏可用数据而备受困扰，导致技术测试都是基于自有数据。创建数据集是一个繁琐的过程，需要研究人员从头开始训练专家智能体、记录它们的交互并用新创建的数据测试每种基准方法。此外，为每种新技术创建新数据集会导致评估过程缺乏一致性，因为每个数据集在状态和动作分布上都可能大不相同。为了应对这些问题，本研究旨在创建模仿学习数据集，提供一个工具包，可以：(i) 提供经过精心策划的专家策略，并支持多线程以加快数据集的创建过程；(ii) 提供现成的数据集和技术以及精确的测量；以及(iii) 分享常用模仿学习技术的实现。",
    "tldr": "本研究提出了模仿学习数据集，通过专家政策的组织、现成数据集和技术的提供以及常见模仿学习技术实现的分享，解决了模仿学习中缺乏可用数据和评估一致性的问题。",
    "en_tdlr": "This work introduces Imitation Learning Datasets to address the issues of lack of available data and consistency in evaluation in imitation learning by organizing expert policies, providing ready datasets and techniques, and sharing implementations of common imitation learning techniques."
}