{
    "title": "Attempt Towards Stress Transfer in Speech-to-Speech Machine Translation",
    "abstract": "arXiv:2403.04178v1 Announce Type: new  Abstract: The language diversity in India's education sector poses a significant challenge, hindering inclusivity. Despite the democratization of knowledge through online educational content, the dominance of English, as the internet's lingua franca, limits accessibility, emphasizing the crucial need for translation into Indian languages. Despite existing Speech-to-Speech Machine Translation (SSMT) technologies, the lack of intonation in these systems gives monotonous translations, leading to a loss of audience interest and disengagement from the content. To address this, our paper introduces a dataset with stress annotations in Indian English and also a Text-to-Speech (TTS) architecture capable of incorporating stress into synthesized speech. This dataset is used for training a stress detection model, which is then used in the SSMT system for detecting stress in the source speech and transferring it into the target language speech. The TTS archit",
    "link": "https://arxiv.org/abs/2403.04178",
    "context": "Title: Attempt Towards Stress Transfer in Speech-to-Speech Machine Translation\nAbstract: arXiv:2403.04178v1 Announce Type: new  Abstract: The language diversity in India's education sector poses a significant challenge, hindering inclusivity. Despite the democratization of knowledge through online educational content, the dominance of English, as the internet's lingua franca, limits accessibility, emphasizing the crucial need for translation into Indian languages. Despite existing Speech-to-Speech Machine Translation (SSMT) technologies, the lack of intonation in these systems gives monotonous translations, leading to a loss of audience interest and disengagement from the content. To address this, our paper introduces a dataset with stress annotations in Indian English and also a Text-to-Speech (TTS) architecture capable of incorporating stress into synthesized speech. This dataset is used for training a stress detection model, which is then used in the SSMT system for detecting stress in the source speech and transferring it into the target language speech. The TTS archit",
    "path": "papers/24/03/2403.04178.json",
    "total_tokens": 899,
    "translated_title": "尝试在语音到语音机器翻译中实现应力传递",
    "translated_abstract": "arXiv:2403.04178v1 公告类型：新摘要：印度教育部门的语言多样性构成了一个重大挑战，妨碍了包容性。尽管通过在线教育内容实现了知识的民主化，但作为互联网通用语言的英语的主导地位限制了可访问性，强调了将内容翻译为印度语言的重要性。尽管现有的语音到语音机器翻译（SSMT）技术，但这些系统中缺乏语调导致翻译单调，导致观众失去兴趣并脱离内容。为了解决这一问题，我们的论文引入了一份带有印度英语重音注释的数据集，并且引入了一个能够将重音融入合成语音中的文本到语音（TTS）架构。该数据集用于训练重音检测模型，然后该模型用于SSMT系统中检测源语音中的重音并将其转移到目标语言语音中。TTS架构",
    "tldr": "该论文介绍了一个具有印度英语重音注释的数据集，以及一个能够将重音融入合成语音中的文本到语音架构，用于在语音到语音机器翻译中实现应力传递。",
    "en_tdlr": "This paper introduces a dataset with stress annotations in Indian English and a Text-to-Speech architecture capable of incorporating stress into synthesized speech, aiming to achieve stress transfer in Speech-to-Speech Machine Translation."
}