{
    "title": "Nonparametric Bellman Mappings for Reinforcement Learning: Application to Robust Adaptive Filtering",
    "abstract": "arXiv:2403.20020v1 Announce Type: cross  Abstract: This paper designs novel nonparametric Bellman mappings in reproducing kernel Hilbert spaces (RKHSs) for reinforcement learning (RL). The proposed mappings benefit from the rich approximating properties of RKHSs, adopt no assumptions on the statistics of the data owing to their nonparametric nature, require no knowledge on transition probabilities of Markov decision processes, and may operate without any training data. Moreover, they allow for sampling on-the-fly via the design of trajectory samples, re-use past test data via experience replay, effect dimensionality reduction by random Fourier features, and enable computationally lightweight operations to fit into efficient online or time-adaptive learning. The paper offers also a variational framework to design the free parameters of the proposed Bellman mappings, and shows that appropriate choices of those parameters yield several popular Bellman-mapping designs. As an application, t",
    "link": "https://arxiv.org/abs/2403.20020",
    "context": "Title: Nonparametric Bellman Mappings for Reinforcement Learning: Application to Robust Adaptive Filtering\nAbstract: arXiv:2403.20020v1 Announce Type: cross  Abstract: This paper designs novel nonparametric Bellman mappings in reproducing kernel Hilbert spaces (RKHSs) for reinforcement learning (RL). The proposed mappings benefit from the rich approximating properties of RKHSs, adopt no assumptions on the statistics of the data owing to their nonparametric nature, require no knowledge on transition probabilities of Markov decision processes, and may operate without any training data. Moreover, they allow for sampling on-the-fly via the design of trajectory samples, re-use past test data via experience replay, effect dimensionality reduction by random Fourier features, and enable computationally lightweight operations to fit into efficient online or time-adaptive learning. The paper offers also a variational framework to design the free parameters of the proposed Bellman mappings, and shows that appropriate choices of those parameters yield several popular Bellman-mapping designs. As an application, t",
    "path": "papers/24/03/2403.20020.json",
    "total_tokens": 956,
    "translated_title": "无参数贝尔曼映射用于强化学习：在鲁棒自适应滤波中的应用",
    "translated_abstract": "本文针对强化学习设计了新颖的在再现核希尔伯特空间（RKHSs）中的无参数贝尔曼映射。所提出的映射利用RKHSs的丰富逼近特性，由于它们的无参数特性，不对数据的统计性质作任何假设，也不需要对马尔可夫决策过程的转移概率有任何了解，并且可以在没有任何训练数据的情况下操作。此外，它们允许通过设计轨迹样本进行即时抽样，通过经验重放重复使用过去的测试数据，通过随机傅立叶特征实现维度降低，并实现计算轻量级操作以适应高效的在线或时间自适应学习。本文还提供了一个变分框架来设计所提出的贝尔曼映射的自由参数，并展示适当选择这些参数可以产生几种流行的贝尔曼映射设计。作为应用，",
    "tldr": "该论文设计了在再现核希尔伯特空间中的无参数贝尔曼映射，具有丰富的逼近特性，无需对数据的统计特性做任何假设，也不需要了解马尔可夫决策过程的转移概率，可以在没有训练数据的情况下运行，并支持多种操作和应用。"
}