{
    "title": "Distributed Multi-Objective Dynamic Offloading Scheduling for Air-Ground Cooperative MEC",
    "abstract": "arXiv:2403.10927v1 Announce Type: cross  Abstract: Utilizing unmanned aerial vehicles (UAVs) with edge server to assist terrestrial mobile edge computing (MEC) has attracted tremendous attention. Nevertheless, state-of-the-art schemes based on deterministic optimizations or single-objective reinforcement learning (RL) cannot reduce the backlog of task bits and simultaneously improve energy efficiency in highly dynamic network environments, where the design problem amounts to a sequential decision-making problem. In order to address the aforementioned problems, as well as the curses of dimensionality introduced by the growing number of terrestrial terrestrial users, this paper proposes a distributed multi-objective (MO) dynamic trajectory planning and offloading scheduling scheme, integrated with MORL and the kernel method. The design of n-step return is also applied to average fluctuations in the backlog. Numerical results reveal that the n-step return can benefit the proposed kernel-b",
    "link": "https://arxiv.org/abs/2403.10927",
    "context": "Title: Distributed Multi-Objective Dynamic Offloading Scheduling for Air-Ground Cooperative MEC\nAbstract: arXiv:2403.10927v1 Announce Type: cross  Abstract: Utilizing unmanned aerial vehicles (UAVs) with edge server to assist terrestrial mobile edge computing (MEC) has attracted tremendous attention. Nevertheless, state-of-the-art schemes based on deterministic optimizations or single-objective reinforcement learning (RL) cannot reduce the backlog of task bits and simultaneously improve energy efficiency in highly dynamic network environments, where the design problem amounts to a sequential decision-making problem. In order to address the aforementioned problems, as well as the curses of dimensionality introduced by the growing number of terrestrial terrestrial users, this paper proposes a distributed multi-objective (MO) dynamic trajectory planning and offloading scheduling scheme, integrated with MORL and the kernel method. The design of n-step return is also applied to average fluctuations in the backlog. Numerical results reveal that the n-step return can benefit the proposed kernel-b",
    "path": "papers/24/03/2403.10927.json",
    "total_tokens": 787,
    "translated_title": "分布式多目标动态卸载调度用于空地协同 MEC",
    "translated_abstract": "利用无人机（UAV）与边缘服务器协助地面移动边缘计算（MEC）已经引起了极大关注。然而，基于确定性优化或单目标强化学习（RL）的最先进方案无法在高度动态网络环境中减少任务比特的积压，并同时提高能效，设计问题等同于一个顺序决策问题。为了解决上述问题，并且处理增加的地面用户数量引入的维度诅咒，本文提出了一个分布式多目标（MO）动态轨迹规划和卸载调度方案，整合了MORL和核方法。n步回报的设计也被应用于减少积压中的波动。数值结果显示n步回报可以使得所提出的核方法受益。",
    "tldr": "提出了用于空地协同 MEC 的分布式多目标动态卸载调度方案，结合了MORL和核方法，通过使用n步回报来处理积压中的波动。",
    "en_tdlr": "Proposed a distributed multi-objective dynamic offloading scheduling scheme for air-ground cooperative MEC, integrated with MORL and kernel method, utilizing n-step return to address fluctuations in the backlog."
}