{
    "title": "A Novel Hybrid Feature Importance and Feature Interaction Detection Framework for Predictive Optimization in Industry 4.0 Applications",
    "abstract": "arXiv:2403.02368v1 Announce Type: cross  Abstract: Advanced machine learning algorithms are increasingly utilized to provide data-based prediction and decision-making support in Industry 4.0. However, the prediction accuracy achieved by the existing models is insufficient to warrant practical implementation in real-world applications. This is because not all features present in real-world datasets possess a direct relevance to the predictive analysis being conducted. Consequently, the careful incorporation of select features has the potential to yield a substantial positive impact on the outcome. To address the research gap, this paper proposes a novel hybrid framework that combines the feature importance detector - local interpretable model-agnostic explanations (LIME) and the feature interaction detector - neural interaction detection (NID), to improve prediction accuracy. By applying the proposed framework, unnecessary features can be eliminated, and interactions are encoded to gene",
    "link": "https://arxiv.org/abs/2403.02368",
    "context": "Title: A Novel Hybrid Feature Importance and Feature Interaction Detection Framework for Predictive Optimization in Industry 4.0 Applications\nAbstract: arXiv:2403.02368v1 Announce Type: cross  Abstract: Advanced machine learning algorithms are increasingly utilized to provide data-based prediction and decision-making support in Industry 4.0. However, the prediction accuracy achieved by the existing models is insufficient to warrant practical implementation in real-world applications. This is because not all features present in real-world datasets possess a direct relevance to the predictive analysis being conducted. Consequently, the careful incorporation of select features has the potential to yield a substantial positive impact on the outcome. To address the research gap, this paper proposes a novel hybrid framework that combines the feature importance detector - local interpretable model-agnostic explanations (LIME) and the feature interaction detector - neural interaction detection (NID), to improve prediction accuracy. By applying the proposed framework, unnecessary features can be eliminated, and interactions are encoded to gene",
    "path": "papers/24/03/2403.02368.json",
    "total_tokens": 846,
    "translated_title": "适用于工业4.0应用中预测优化的新型混合特征重要性和特征交互检测框架",
    "translated_abstract": "先进的机器学习算法越来越被广泛应用于工业4.0中提供基于数据的预测和决策支持。然而，现有模型所达到的预测准确性不足以保证在现实应用中的实际实施。这是因为现实世界数据集中并非所有特征都与正在进行的预测分析直接相关。因此，精心选择特征的结合有潜力对结果产生重大积极影响。为了填补研究空白，本文提出了一个新颖的混合框架，将特征重要性检测器——局部可解释的模型无关解释（LIME）和特征交互检测器——神经交互检测（NID）相结合，以提高预测准确性。通过应用所提出的框架，可以消除不必要的特征，并对交互作用进行编码以生成",
    "tldr": "该论文提出了一个新型混合框架，结合特征重要性检测和特征交互检测，以提高工业4.0应用中的预测优化准确性。",
    "en_tdlr": "This paper introduces a novel hybrid framework that combines feature importance detection and feature interaction detection to improve predictive optimization accuracy in Industry 4.0 applications."
}