{
    "title": "Multi-perspective Memory Enhanced Network for Identifying Key Nodes in Social Networks",
    "abstract": "arXiv:2403.15235v1 Announce Type: cross  Abstract: Identifying key nodes in social networks plays a crucial role in timely blocking false information. Existing key node identification methods usually consider node influence only from the propagation structure perspective and have insufficient generalization ability to unknown scenarios. In this paper, we propose a novel Multi-perspective Memory Enhanced Network (MMEN) for identifying key nodes in social networks, which mines key nodes from multiple perspectives and utilizes memory networks to store historical information. Specifically, MMEN first constructs two propagation networks from the perspectives of user attributes and propagation structure and updates node feature representations using graph attention networks. Meanwhile, the memory network is employed to store information of similar subgraphs, enhancing the model's generalization performance in unknown scenarios. Finally, MMEN applies adaptive weights to combine the node influ",
    "link": "https://arxiv.org/abs/2403.15235",
    "context": "Title: Multi-perspective Memory Enhanced Network for Identifying Key Nodes in Social Networks\nAbstract: arXiv:2403.15235v1 Announce Type: cross  Abstract: Identifying key nodes in social networks plays a crucial role in timely blocking false information. Existing key node identification methods usually consider node influence only from the propagation structure perspective and have insufficient generalization ability to unknown scenarios. In this paper, we propose a novel Multi-perspective Memory Enhanced Network (MMEN) for identifying key nodes in social networks, which mines key nodes from multiple perspectives and utilizes memory networks to store historical information. Specifically, MMEN first constructs two propagation networks from the perspectives of user attributes and propagation structure and updates node feature representations using graph attention networks. Meanwhile, the memory network is employed to store information of similar subgraphs, enhancing the model's generalization performance in unknown scenarios. Finally, MMEN applies adaptive weights to combine the node influ",
    "path": "papers/24/03/2403.15235.json",
    "total_tokens": 817,
    "translated_title": "多角度记忆增强网络用于在社交网络中识别关键节点",
    "translated_abstract": "在社交网络中识别关键节点在及时阻止虚假信息方面起着至关重要的作用。现有的关键节点识别方法通常仅从传播结构的角度考虑节点影响，并且对未知情境的泛化能力不足。本文提出了一种新颖的多角度记忆增强网络（MMEN），用于在社交网络中识别关键节点，该网络从多个角度挖掘关键节点并利用记忆网络存储历史信息。具体来说，MMEN首先从用户属性和传播结构的角度构建两个传播网络，并使用图注意力网络更新节点特征表示。同时，记忆网络用于存储类似子图的信息，增强模型在未知情境中的泛化性能。最后，MMEN应用自适应权重来结合节点的影响力。",
    "tldr": "提出了一个多角度记忆增强网络（MMEN），用于在社交网络中识别关键节点，通过多角度挖掘关键节点并利用记忆网络存储历史信息，以增强模型在未知情境中的泛化能力。",
    "en_tdlr": "Proposed a Multi-perspective Memory Enhanced Network (MMEN) for identifying key nodes in social networks, which mines key nodes from multiple perspectives and utilizes memory networks to store historical information, enhancing the model's generalization ability in unknown scenarios."
}