{
    "title": "Digital Twins and Civil Engineering Phases: Reorienting Adoption Strategies",
    "abstract": "arXiv:2403.02426v1 Announce Type: cross  Abstract: Digital twin (DT) technology has received immense attention over the years due to the promises it presents to various stakeholders in science and engineering. As a result, different thematic areas of DT have been explored. This is no different in specific fields such as manufacturing, automation, oil and gas, and civil engineering, leading to fragmented approaches for field-specific applications. The civil engineering industry is further disadvantaged in this regard as it relies on external techniques by other engineering fields for its DT adoption. A rising consequence of these extensions is a concentrated application of DT to the operations and maintenance phase. On another spectrum, Building Information Modeling (BIM) are pervasively utilized in the planning/design phase, and the transient nature of the construction phase remains a challenge for its DT adoption. In this paper, we present a phase-based development of DT in the Archit",
    "link": "https://arxiv.org/abs/2403.02426",
    "context": "Title: Digital Twins and Civil Engineering Phases: Reorienting Adoption Strategies\nAbstract: arXiv:2403.02426v1 Announce Type: cross  Abstract: Digital twin (DT) technology has received immense attention over the years due to the promises it presents to various stakeholders in science and engineering. As a result, different thematic areas of DT have been explored. This is no different in specific fields such as manufacturing, automation, oil and gas, and civil engineering, leading to fragmented approaches for field-specific applications. The civil engineering industry is further disadvantaged in this regard as it relies on external techniques by other engineering fields for its DT adoption. A rising consequence of these extensions is a concentrated application of DT to the operations and maintenance phase. On another spectrum, Building Information Modeling (BIM) are pervasively utilized in the planning/design phase, and the transient nature of the construction phase remains a challenge for its DT adoption. In this paper, we present a phase-based development of DT in the Archit",
    "path": "papers/24/03/2403.02426.json",
    "total_tokens": 821,
    "translated_title": "数字孪生和土木工程阶段：重新定位采用策略",
    "translated_abstract": "数字孪生（DT）技术多年来受到极大关注，因为它为科学和工程各利益相关者带来了许多承诺。因此，人们探讨了数字孪生的不同主题领域。土木工程等特定领域也不例外，导致了针对特定领域应用的碎片化方法。土木工程行业在这方面进一步处于不利地位，因为它依赖其他工程领域的外部技术来进行数字孪生的采用。这些扩展的一个不断增加的后果是将数字孪生集中应用于运营和维护阶段。另一方面，建筑信息建模（BIM）被广泛用于规划/设计阶段，而施工阶段的瞬变性质对于数字孪生的采用构成了挑战。在本文中，我们提出了数字孪生在建筑设计...",
    "tldr": "数字孪生技术在土木工程领域的采用策略需要重新定位，以解决不同阶段的挑战和应用分散性问题。"
}