{
    "title": "RFWave: Multi-band Rectified Flow for Audio Waveform Reconstruction",
    "abstract": "arXiv:2403.05010v1 Announce Type: cross  Abstract: Recent advancements in generative modeling have led to significant progress in audio waveform reconstruction from diverse representations. Although diffusion models have been used for reconstructing audio waveforms, they tend to exhibit latency issues because they operate at the level of individual sample points and require a relatively large number of sampling steps. In this study, we introduce RFWave, a novel multi-band Rectified Flow approach that reconstructs high-fidelity audio waveforms from Mel-spectrograms. RFWave is distinctive for generating complex spectrograms and operating at the frame level, processing all subbands concurrently to enhance efficiency. Thanks to Rectified Flow, which aims for a flat transport trajectory, RFWave requires only 10 sampling steps. Empirical evaluations demonstrate that RFWave achieves exceptional reconstruction quality and superior computational efficiency, capable of generating audio at a spee",
    "link": "https://arxiv.org/abs/2403.05010",
    "context": "Title: RFWave: Multi-band Rectified Flow for Audio Waveform Reconstruction\nAbstract: arXiv:2403.05010v1 Announce Type: cross  Abstract: Recent advancements in generative modeling have led to significant progress in audio waveform reconstruction from diverse representations. Although diffusion models have been used for reconstructing audio waveforms, they tend to exhibit latency issues because they operate at the level of individual sample points and require a relatively large number of sampling steps. In this study, we introduce RFWave, a novel multi-band Rectified Flow approach that reconstructs high-fidelity audio waveforms from Mel-spectrograms. RFWave is distinctive for generating complex spectrograms and operating at the frame level, processing all subbands concurrently to enhance efficiency. Thanks to Rectified Flow, which aims for a flat transport trajectory, RFWave requires only 10 sampling steps. Empirical evaluations demonstrate that RFWave achieves exceptional reconstruction quality and superior computational efficiency, capable of generating audio at a spee",
    "path": "papers/24/03/2403.05010.json",
    "total_tokens": 863,
    "translated_title": "RFWave：用于音频波形重建的多频带整流流动",
    "translated_abstract": "最近生成建模的进展在从不同表示中重建音频波形方面取得了显著进展。虽然扩散模型已被用于重建音频波形，但由于它们在个别样本点级别进行操作并且需要相对较大数量的采样步骤，因此它们往往会出现延迟问题。在本研究中，我们介绍了RFWave，一种新颖的多频带整流流动方法，它从Mel频谱图中重建高保真度音频波形。RFWave在生成复杂频谱图并在帧级别运行方面具有独特性，同时处理所有子带以增强效率。由于希望获得平缓传输轨迹的整流流动，RFWave仅需10个采样步骤。实证评估表明，RFWave实现了卓越的重建质量和优越的计算效率，能够以更快的速度生成音频。",
    "tldr": "RFWave是一种新颖的多频带整流流动方法，可以从Mel频谱图中重建高保真度音频波形，仅需10个采样步骤即可实现出色的重建质量和优越的计算效率。",
    "en_tdlr": "RFWave is a novel multi-band Rectified Flow approach for reconstructing high-fidelity audio waveforms from Mel-spectrograms, achieving exceptional reconstruction quality and superior computational efficiency with only 10 sampling steps."
}