{
    "title": "Multimodal Anomaly Detection based on Deep Auto-Encoder for Object Slip Perception of Mobile Manipulation Robots",
    "abstract": "arXiv:2403.03563v1 Announce Type: cross  Abstract: Object slip perception is essential for mobile manipulation robots to perform manipulation tasks reliably in the dynamic real-world. Traditional approaches to robot arms' slip perception use tactile or vision sensors. However, mobile robots still have to deal with noise in their sensor signals caused by the robot's movement in a changing environment. To solve this problem, we present an anomaly detection method that utilizes multisensory data based on a deep autoencoder model. The proposed framework integrates heterogeneous data streams collected from various robot sensors, including RGB and depth cameras, a microphone, and a force-torque sensor. The integrated data is used to train a deep autoencoder to construct latent representations of the multisensory data that indicate the normal status. Anomalies can then be identified by error scores measured by the difference between the trained encoder's latent values and the latent values of",
    "link": "https://arxiv.org/abs/2403.03563",
    "context": "Title: Multimodal Anomaly Detection based on Deep Auto-Encoder for Object Slip Perception of Mobile Manipulation Robots\nAbstract: arXiv:2403.03563v1 Announce Type: cross  Abstract: Object slip perception is essential for mobile manipulation robots to perform manipulation tasks reliably in the dynamic real-world. Traditional approaches to robot arms' slip perception use tactile or vision sensors. However, mobile robots still have to deal with noise in their sensor signals caused by the robot's movement in a changing environment. To solve this problem, we present an anomaly detection method that utilizes multisensory data based on a deep autoencoder model. The proposed framework integrates heterogeneous data streams collected from various robot sensors, including RGB and depth cameras, a microphone, and a force-torque sensor. The integrated data is used to train a deep autoencoder to construct latent representations of the multisensory data that indicate the normal status. Anomalies can then be identified by error scores measured by the difference between the trained encoder's latent values and the latent values of",
    "path": "papers/24/03/2403.03563.json",
    "total_tokens": 846,
    "translated_title": "基于深度自编码器的移动操作机器人物体滑移感知的多模态异常检测",
    "translated_abstract": "物体滑移感知对于移动操作机器人在动态实际环境中可靠执行操作任务至关重要。传统的机器臂滑移感知方法使用触觉或视觉传感器。然而，移动机器人仍然需要处理传感器信号中的噪声，这是由机器人在不断变化的环境中移动造成的。为了解决这一问题，我们提出了一种利用基于深度自编码器模型的多感知数据的异常检测方法。所提出的框架整合了从各种机器人传感器收集的异构数据流，包括RGB和深度摄像机、麦克风以及力矩传感器。综合数据用于训练深度自编码器，以构建表示多模态数据的隐变量，指示正常状态。通过测量训练编码器的隐变量值与输入值之间的差异来识别异常。",
    "tldr": "提出了一个基于深度自编码器的多模态异常检测方法，用于移动操作机器人的物体滑移感知，能够整合来自不同机器人传感器的数据流并识别异常。",
    "en_tdlr": "An anomaly detection method based on deep autoencoder is proposed for object slip perception of mobile manipulation robots, which integrates data from various robot sensors and identifies anomalies."
}