{
    "title": "Technical Report: Competition Solution For BetterMixture",
    "abstract": "arXiv:2403.13233v1 Announce Type: new  Abstract: In the era of flourishing large-scale models, the challenge of selecting and optimizing datasets from the vast and complex sea of data, to enhance the performance of large language models within the constraints of limited computational resources, has become paramount. This paper details our solution for the BetterMixture challenge, which focuses on the fine-tuning data mixing for large language models. Our approach, which secured third place, incorporates data deduplication, low-level and high-level quality filtering, and diversity selection. The foundation of our solution is Ke-Data-Juicer, an extension of Data-Juicer, demonstrating its robust capabilities in handling and optimizing data for large language models.",
    "link": "https://arxiv.org/abs/2403.13233",
    "context": "Title: Technical Report: Competition Solution For BetterMixture\nAbstract: arXiv:2403.13233v1 Announce Type: new  Abstract: In the era of flourishing large-scale models, the challenge of selecting and optimizing datasets from the vast and complex sea of data, to enhance the performance of large language models within the constraints of limited computational resources, has become paramount. This paper details our solution for the BetterMixture challenge, which focuses on the fine-tuning data mixing for large language models. Our approach, which secured third place, incorporates data deduplication, low-level and high-level quality filtering, and diversity selection. The foundation of our solution is Ke-Data-Juicer, an extension of Data-Juicer, demonstrating its robust capabilities in handling and optimizing data for large language models.",
    "path": "papers/24/03/2403.13233.json",
    "total_tokens": 773,
    "translated_title": "技术报告：BetterMixture竞赛解决方案",
    "translated_abstract": "在大规模模型蓬勃发展的时代，从庞大复杂的数据中选择和优化数据集，以提升大型语言模型性能，同时在有限的计算资源约束下，已成为一项重要挑战。本文详细介绍了我们针对BetterMixture挑战的解决方案，重点关注大型语言模型的微调数据混合。我们的方法获得第三名，包括数据去重、低级和高级质量过滤，以及多样性选择。我们解决方案的基础是Ke-Data-Juicer，是Data-Juicer的一个扩展，展示了其处理和优化大型语言模型数据的强大能力。",
    "tldr": "本文介绍了针对BetterMixture挑战的解决方案，采用数据去重、质量过滤和多样性选择等方法，最终获得第三名。Ke-Data-Juicer作为解决方案的基础，展现了其在处理和优化大型语言模型数据方面的强大能力。",
    "en_tdlr": "This paper presents a solution for the BetterMixture challenge, incorporating methods such as data deduplication, quality filtering, and diversity selection, securing third place. The foundation of the solution, Ke-Data-Juicer, demonstrates its robust capabilities in handling and optimizing data for large language models."
}