{
    "title": "Theoretical Bound-Guided Hierarchical VAE for Neural Image Codecs",
    "abstract": "arXiv:2403.18535v1 Announce Type: cross  Abstract: Recent studies reveal a significant theoretical link between variational autoencoders (VAEs) and rate-distortion theory, notably in utilizing VAEs to estimate the theoretical upper bound of the information rate-distortion function of images. Such estimated theoretical bounds substantially exceed the performance of existing neural image codecs (NICs). To narrow this gap, we propose a theoretical bound-guided hierarchical VAE (BG-VAE) for NIC. The proposed BG-VAE leverages the theoretical bound to guide the NIC model towards enhanced performance. We implement the BG-VAE using Hierarchical VAEs and demonstrate its effectiveness through extensive experiments. Along with advanced neural network blocks, we provide a versatile, variable-rate NIC that outperforms existing methods when considering both rate-distortion performance and computational complexity. The code is available at BG-VAE.",
    "link": "https://arxiv.org/abs/2403.18535",
    "context": "Title: Theoretical Bound-Guided Hierarchical VAE for Neural Image Codecs\nAbstract: arXiv:2403.18535v1 Announce Type: cross  Abstract: Recent studies reveal a significant theoretical link between variational autoencoders (VAEs) and rate-distortion theory, notably in utilizing VAEs to estimate the theoretical upper bound of the information rate-distortion function of images. Such estimated theoretical bounds substantially exceed the performance of existing neural image codecs (NICs). To narrow this gap, we propose a theoretical bound-guided hierarchical VAE (BG-VAE) for NIC. The proposed BG-VAE leverages the theoretical bound to guide the NIC model towards enhanced performance. We implement the BG-VAE using Hierarchical VAEs and demonstrate its effectiveness through extensive experiments. Along with advanced neural network blocks, we provide a versatile, variable-rate NIC that outperforms existing methods when considering both rate-distortion performance and computational complexity. The code is available at BG-VAE.",
    "path": "papers/24/03/2403.18535.json",
    "total_tokens": 830,
    "translated_title": "层次化VAE指导的理论界限用于神经图像编解码器",
    "translated_abstract": "最近的研究揭示了变分自动编码器（VAEs）与率失真理论之间的重要理论联系，特别是在利用VAEs来估计图像信息率失真函数的理论上限。这些估计的理论界限大大超过了现有神经图像编解码器（NICs）的性能。为了缩小这一差距，我们提出了一种理论界限引导的层次化VAE（BG-VAE）用于NIC。所提出的BG-VAE利用理论界限来指导NIC模型以提升性能。我们使用层次化VAE实现了BG-VAE，并通过大量实验证明了其有效性。除了先进的神经网络模块外，我们提供了一种性能优越的、可变速率的NIC，无论是在考虑率失真性能还是计算复杂性时都优于现有方法。代码可在BG-VAE中获得。",
    "tldr": "提出了一种理论界限指导的层次化VAE（BG-VAE），用于改善神经图像编解码器的性能，通过实验证明其优于现有方法，提供了可变速率NIC。",
    "en_tdlr": "Introducing a theoretical bound-guided hierarchical VAE (BG-VAE) to enhance the performance of neural image codecs, demonstrating its superiority over existing methods through experiments, and providing a variable-rate NIC."
}