{
    "title": "Investigation into the Potential of Parallel Quantum Annealing for Simultaneous Optimization of Multiple Problems: A Comprehensive Study",
    "abstract": "arXiv:2403.05764v1 Announce Type: cross  Abstract: Parallel Quantum Annealing is a technique to solve multiple optimization problems simultaneously. Parallel quantum annealing aims to optimize the utilization of available qubits on a quantum topology by addressing multiple independent problems in a single annealing cycle. This study provides insights into the potential and the limitations of this parallelization method. The experiments consisting of two different problems are integrated, and various problem dimensions are explored including normalization techniques using specific methods such as DWaveSampler with Default Embedding, DWaveSampler with Custom Embedding and LeapHybridSampler. This method minimizes idle qubits and holds promise for substantial speed-up, as indicated by the Time-to-Solution (TTS) metric, compared to traditional quantum annealing, which solves problems sequentially and may leave qubits unutilized.",
    "link": "https://arxiv.org/abs/2403.05764",
    "context": "Title: Investigation into the Potential of Parallel Quantum Annealing for Simultaneous Optimization of Multiple Problems: A Comprehensive Study\nAbstract: arXiv:2403.05764v1 Announce Type: cross  Abstract: Parallel Quantum Annealing is a technique to solve multiple optimization problems simultaneously. Parallel quantum annealing aims to optimize the utilization of available qubits on a quantum topology by addressing multiple independent problems in a single annealing cycle. This study provides insights into the potential and the limitations of this parallelization method. The experiments consisting of two different problems are integrated, and various problem dimensions are explored including normalization techniques using specific methods such as DWaveSampler with Default Embedding, DWaveSampler with Custom Embedding and LeapHybridSampler. This method minimizes idle qubits and holds promise for substantial speed-up, as indicated by the Time-to-Solution (TTS) metric, compared to traditional quantum annealing, which solves problems sequentially and may leave qubits unutilized.",
    "path": "papers/24/03/2403.05764.json",
    "total_tokens": 843,
    "translated_title": "探讨并行量子退火在同时优化多个问题方面的潜力：一项全面研究",
    "translated_abstract": "并行量子退火是一种解决多个优化问题的技术。它旨在通过在单个退火周期中处理多个独立问题来优化量子拓扑上可用量子位的利用。本研究深入探讨了这种并行化方法的潜力和局限性。实验包括两个不同问题，并探索了各种问题维度，包括使用特定方法进行标准化技术，如使用具有默认嵌入的DWaveSampler、使用自定义嵌入的DWaveSampler和LeapHybridSampler。这种方法最大程度地减少了闲置量子位，并在解决方案时间（TTS）度量标准方面显示出与传统量子退火相比的巨大加速潜力，传统量子退火解决问题的方法是顺序处理，可能导致未利用的量子位。",
    "tldr": "并行量子退火技术旨在通过在单个退火周期中解决多个独立问题来优化可用量子位的利用，相比传统的顺序处理方式，该方法最大程度地减少了闲置量子位，并显示出巨大的加速潜力。",
    "en_tdlr": "Parallel Quantum Annealing aims to optimize the utilization of available qubits on a quantum topology by addressing multiple independent problems in a single annealing cycle, minimizing idle qubits and showing great potential for speed-up compared to traditional sequential processing."
}