{
    "title": "High-Dimensional Mean-Variance Spanning Tests",
    "abstract": "arXiv:2403.17127v1 Announce Type: cross  Abstract: We introduce a new framework for the mean-variance spanning (MVS) hypothesis testing. The procedure can be applied to any test-asset dimension and only requires stationary asset returns and the number of benchmark assets to be smaller than the number of time periods. It involves individually testing moment conditions using a robust Student-t statistic based on the batch-mean method and combining the p-values using the Cauchy combination test. Simulations demonstrate the superior performance of the test compared to state-of-the-art approaches. For the empirical application, we look at the problem of domestic versus international diversification in equities. We find that the advantages of diversification are influenced by economic conditions and exhibit cross-country variation. We also highlight that the rejection of the MVS hypothesis originates from the potential to reduce variance within the domestic global minimum-variance portfolio.",
    "link": "https://arxiv.org/abs/2403.17127",
    "context": "Title: High-Dimensional Mean-Variance Spanning Tests\nAbstract: arXiv:2403.17127v1 Announce Type: cross  Abstract: We introduce a new framework for the mean-variance spanning (MVS) hypothesis testing. The procedure can be applied to any test-asset dimension and only requires stationary asset returns and the number of benchmark assets to be smaller than the number of time periods. It involves individually testing moment conditions using a robust Student-t statistic based on the batch-mean method and combining the p-values using the Cauchy combination test. Simulations demonstrate the superior performance of the test compared to state-of-the-art approaches. For the empirical application, we look at the problem of domestic versus international diversification in equities. We find that the advantages of diversification are influenced by economic conditions and exhibit cross-country variation. We also highlight that the rejection of the MVS hypothesis originates from the potential to reduce variance within the domestic global minimum-variance portfolio.",
    "path": "papers/24/03/2403.17127.json",
    "total_tokens": 931,
    "translated_title": "高维均值-方差跨度测试",
    "translated_abstract": "我们引入了一种新的均值-方差跨度（MVS）假设检验框架。该程序可应用于任何测试资产维度，只需要稳定的资产回报和基准资产数量小于时间周期数量。它涉及使用基于批量均值方法的稳健学生t统计量逐个测试矩条件，并使用柯西组合检验将p值组合在一起。模拟结果表明，该测试相对于最先进的方法表现出卓越性能。对于实证应用，我们研究了股票领域的国内与国际分散化问题。我们发现分散化的优势受经济状况影响，并呈现跨国家变化。我们还强调，拒绝MVS假设源于在国内全球最小方差组合中降低方差的潜力。",
    "tldr": "该研究提出了一种新的均值-方差跨度假设检验框架，能够在任意测试资产维度上应用，通过使用稳健的学生t统计基于批量均值方法逐个测试矩条件，然后使用柯西组合检验结合p值，证明了相对于现有方法的卓越性能，并在实证应用中探讨了股票分散化中国内与国际间的优势和影响因素。",
    "en_tdlr": "This study introduces a new framework for mean-variance spanning hypothesis testing that can be applied in any test-asset dimension, demonstrating superior performance compared to existing methods by robust testing moment conditions using a robust Student-t statistic based on the batch-mean method, combining p-values using the Cauchy combination test, and exploring advantages and influencing factors of domestic versus international diversification in equities in empirical applications."
}