{
    "title": "Study on Standardizing Working Time: A Case of XYZ Retail Store in Bandung, Indonesia",
    "abstract": "arXiv:2403.09138v1 Announce Type: new  Abstract: Work time standardization helps to find and reduce wasteful movements and time in the workplace, such as chatting, mobile phone use, insufficient rest, or unproductive tasks. This study aims to map the process of displaying products from the warehouse to the shelves and calculate and determine the standard working time of employees of the Operations Division of PT XYZ Branch who oversee displaying X Milk and Y Bread. The data was collected six times in three weeks, including interviews and observations, and took a sample of 20 pieces on each product to carry out data analysis such as data sufficiency tests and control charts. Several time deviations were found in the display process of X Milk products on all observation days in different activities. Whereas in the process of displaying Y Bread, only the deviation of working time was found on the 4th observation day, which proves that the process needs to have a standard working time so t",
    "link": "https://arxiv.org/abs/2403.09138",
    "context": "Title: Study on Standardizing Working Time: A Case of XYZ Retail Store in Bandung, Indonesia\nAbstract: arXiv:2403.09138v1 Announce Type: new  Abstract: Work time standardization helps to find and reduce wasteful movements and time in the workplace, such as chatting, mobile phone use, insufficient rest, or unproductive tasks. This study aims to map the process of displaying products from the warehouse to the shelves and calculate and determine the standard working time of employees of the Operations Division of PT XYZ Branch who oversee displaying X Milk and Y Bread. The data was collected six times in three weeks, including interviews and observations, and took a sample of 20 pieces on each product to carry out data analysis such as data sufficiency tests and control charts. Several time deviations were found in the display process of X Milk products on all observation days in different activities. Whereas in the process of displaying Y Bread, only the deviation of working time was found on the 4th observation day, which proves that the process needs to have a standard working time so t",
    "path": "papers/24/03/2403.09138.json",
    "total_tokens": 877,
    "translated_title": "标准化工作时间研究：印尼万隆市XYZ零售店的案例",
    "translated_abstract": "工作时间标准化有助于发现并减少工作场所中的浪费动作和时间，例如聊天、使用手机、休息不足或无效的任务。本研究旨在对从仓库到货架展示产品的流程进行规划，并计算和确定管理PT XYZ分公司运营部门负责展示X牛奶和Y面包的员工的标准工作时间。数据在三周内收集了六次，包括访谈和观察，并且对每种产品取样20个进行数据分析，例如数据充分性测试和控制图。发现了X牛奶产品展示流程中的几处时间偏差，几处观察日的不同活动中都有。而在展示Y面包的过程中，仅在第4个观察日发现了工作时间偏差，这证明该流程需要有一个标准的工作时间。",
    "tldr": "这项研究旨在通过标准化工作时间来找出和减少工作场所中的浪费动作和时间，通过实验发现X牛奶产品的展示流程存在多处时间偏差，而Y面包的展示过程也需要有一个标准的工作时间。",
    "en_tdlr": "This study aims to identify and reduce wasteful movements and time in the workplace through standardizing working time, revealing multiple time deviations in the X Milk product display process and the need for a standard working time for the Y Bread display process."
}