{
    "title": "Exploring Challenges in Deep Learning of Single-Station Ground Motion Records",
    "abstract": "arXiv:2403.07569v1 Announce Type: cross  Abstract: Contemporary deep learning models have demonstrated promising results across various applications within seismology and earthquake engineering. These models rely primarily on utilizing ground motion records for tasks such as earthquake event classification, localization, earthquake early warning systems, and structural health monitoring. However, the extent to which these models effectively learn from these complex time-series signals has not been thoroughly analyzed. In this study, our objective is to evaluate the degree to which auxiliary information, such as seismic phase arrival times or seismic station distribution within a network, dominates the process of deep learning from ground motion records, potentially hindering its effectiveness. We perform a hyperparameter search on two deep learning models to assess their effectiveness in deep learning from ground motion records while also examining the impact of auxiliary information o",
    "link": "https://arxiv.org/abs/2403.07569",
    "context": "Title: Exploring Challenges in Deep Learning of Single-Station Ground Motion Records\nAbstract: arXiv:2403.07569v1 Announce Type: cross  Abstract: Contemporary deep learning models have demonstrated promising results across various applications within seismology and earthquake engineering. These models rely primarily on utilizing ground motion records for tasks such as earthquake event classification, localization, earthquake early warning systems, and structural health monitoring. However, the extent to which these models effectively learn from these complex time-series signals has not been thoroughly analyzed. In this study, our objective is to evaluate the degree to which auxiliary information, such as seismic phase arrival times or seismic station distribution within a network, dominates the process of deep learning from ground motion records, potentially hindering its effectiveness. We perform a hyperparameter search on two deep learning models to assess their effectiveness in deep learning from ground motion records while also examining the impact of auxiliary information o",
    "path": "papers/24/03/2403.07569.json",
    "total_tokens": 772,
    "translated_title": "探究单台场地运动记录的深度学习挑战",
    "translated_abstract": "当代的深度学习模型在地震学和地震工程的各种应用中展现出了令人期待的结果。这些模型主要依赖利用场地运动记录进行地震事件分类、定位、地震早期预警系统和结构健康监测等任务。然而，这些模型从这些复杂的时间序列信号中有效学习的程度尚未得到彻底分析。本研究的目标是评估辅助信息（如地震相到达时间或网络内地震台站分布）在从场地运动记录中进行深度学习过程中的主导程度，可能会影响其有效性。我们对两种深度学习模型进行超参数搜索，评估它们在从场地运动记录中进行深度学习的有效性，同时检查辅助信息的影响。",
    "tldr": "本研究旨在评估深度学习模型从场地运动记录中学习的效果，并探讨辅助信息对此过程的影响。",
    "en_tdlr": "This study aims to evaluate the effectiveness of deep learning models in learning from ground motion records and investigate the impact of auxiliary information on this process."
}