{
    "title": "A Multi-population Integrated Approach for Capacitated Location Routing",
    "abstract": "arXiv:2403.09361v1 Announce Type: new  Abstract: The capacitated location-routing problem involves determining the depots from a set of candidate capacitated depot locations and finding the required routes from the selected depots to serve a set of customers whereas minimizing a cost function that includes the cost of opening the chosen depots, the fixed utilization cost per vehicle used, and the total cost (distance) of the routes. This paper presents a multi-population integrated framework in which a multi-depot edge assembly crossover generates promising offspring solutions from the perspective of both depot location and route edge assembly. The method includes an effective neighborhood-based local search, a feasibility-restoring procedure and a diversification-oriented mutation. Of particular interest is the multi-population scheme which organizes the population into multiple subpopulations based on depot configurations. Extensive experiments on 281 benchmark instances from the lit",
    "link": "https://arxiv.org/abs/2403.09361",
    "context": "Title: A Multi-population Integrated Approach for Capacitated Location Routing\nAbstract: arXiv:2403.09361v1 Announce Type: new  Abstract: The capacitated location-routing problem involves determining the depots from a set of candidate capacitated depot locations and finding the required routes from the selected depots to serve a set of customers whereas minimizing a cost function that includes the cost of opening the chosen depots, the fixed utilization cost per vehicle used, and the total cost (distance) of the routes. This paper presents a multi-population integrated framework in which a multi-depot edge assembly crossover generates promising offspring solutions from the perspective of both depot location and route edge assembly. The method includes an effective neighborhood-based local search, a feasibility-restoring procedure and a diversification-oriented mutation. Of particular interest is the multi-population scheme which organizes the population into multiple subpopulations based on depot configurations. Extensive experiments on 281 benchmark instances from the lit",
    "path": "papers/24/03/2403.09361.json",
    "total_tokens": 764,
    "translated_title": "一个用于容量位置路径问题的多种群综合方法",
    "translated_abstract": "容量位置路径问题涉及确定从一组候选容量配送中心位置中选取仓库，并找到从选定的仓库到一组客户的服务所需路径，同时最小化包括开设选定仓库的成本、每辆车固定利用成本和路径总成本（距离）在内的成本函数。本文提出了一个多种群综合框架，其中多仓库边装配交叉生成有前景的后代解决方案，从仓库位置和路径边缘组装的角度来看。该方法包括一个基于邻域的有效局部搜索、一个恢复可行性的程序和一个多样化导向的突变。特别有趣的是多种群方案，它根据仓库配置将人口组织成多个子人口。",
    "tldr": "该论文提出了一个多种群综合方法，通过多仓库边装配交叉和有效局部搜索等手段，实现了对容量位置路径问题的有效优化。",
    "en_tdlr": "The paper proposes a multi-population integrated approach that effectively optimizes the capacitated location-routing problem through methods like multi-depot edge assembly crossover and effective neighborhood-based local search."
}