{
    "title": "Task-Oriented GNNs Training on Large Knowledge Graphs for Accurate and Efficient Modeling",
    "abstract": "arXiv:2403.05752v1 Announce Type: cross  Abstract: A Knowledge Graph (KG) is a heterogeneous graph encompassing a diverse range of node and edge types. Heterogeneous Graph Neural Networks (HGNNs) are popular for training machine learning tasks like node classification and link prediction on KGs. However, HGNN methods exhibit excessive complexity influenced by the KG's size, density, and the number of node and edge types. AI practitioners handcraft a subgraph of a KG G relevant to a specific task. We refer to this subgraph as a task-oriented subgraph (TOSG), which contains a subset of task-related node and edge types in G. Training the task using TOSG instead of G alleviates the excessive computation required for a large KG. Crafting the TOSG demands a deep understanding of the KG's structure and the task's objectives. Hence, it is challenging and time-consuming. This paper proposes KG-TOSA, an approach to automate the TOSG extraction for task-oriented HGNN training on a large KG. In KG",
    "link": "https://arxiv.org/abs/2403.05752",
    "context": "Title: Task-Oriented GNNs Training on Large Knowledge Graphs for Accurate and Efficient Modeling\nAbstract: arXiv:2403.05752v1 Announce Type: cross  Abstract: A Knowledge Graph (KG) is a heterogeneous graph encompassing a diverse range of node and edge types. Heterogeneous Graph Neural Networks (HGNNs) are popular for training machine learning tasks like node classification and link prediction on KGs. However, HGNN methods exhibit excessive complexity influenced by the KG's size, density, and the number of node and edge types. AI practitioners handcraft a subgraph of a KG G relevant to a specific task. We refer to this subgraph as a task-oriented subgraph (TOSG), which contains a subset of task-related node and edge types in G. Training the task using TOSG instead of G alleviates the excessive computation required for a large KG. Crafting the TOSG demands a deep understanding of the KG's structure and the task's objectives. Hence, it is challenging and time-consuming. This paper proposes KG-TOSA, an approach to automate the TOSG extraction for task-oriented HGNN training on a large KG. In KG",
    "path": "papers/24/03/2403.05752.json",
    "total_tokens": 874,
    "translated_title": "在大型知识图上训练面向任务的图神经网络，实现准确高效建模",
    "translated_abstract": "知识图（KG）是一种包含各种节点和边类型的异构图。异构图神经网络（HGNNs）通常用于在KG上训练节点分类和链接预测等机器学习任务。然而，HGNN方法受KG的大小、密度以及节点和边类型数量的影响，表现出过多的复杂性。AI从业者手工设计出一个与特定任务相关的KG G的子图，我们称之为面向任务的子图（TOSG），其中包含G中与任务相关的节点和边类型的子集。使用TOSG而不是G来训练任务可以减轻对大型KG所需的过多计算。设计TOSG需要深入了解KG的结构和任务的目标，因此具有挑战性且耗时。本文提出了KG-TOSA，一种自动化TOSG提取的方法，用于在大型KG上进行面向任务的HGNN训练。",
    "tldr": "本文提出了一种自动化TOSG提取的方法KG-TOSA，用于在大型知识图上进行面向任务的图神经网络训练，以减轻对大型KG的过多计算负担。",
    "en_tdlr": "The paper introduces KG-TOSA, an automated approach for extracting task-oriented subgraphs (TOSG) for training task-oriented HGNN on large knowledge graphs to alleviate excessive computation burden."
}