{
    "title": "Bespoke Non-Stationary Solvers for Fast Sampling of Diffusion and Flow Models",
    "abstract": "arXiv:2403.01329v1 Announce Type: cross  Abstract: This paper introduces Bespoke Non-Stationary (BNS) Solvers, a solver distillation approach to improve sample efficiency of Diffusion and Flow models. BNS solvers are based on a family of non-stationary solvers that provably subsumes existing numerical ODE solvers and consequently demonstrate considerable improvement in sample approximation (PSNR) over these baselines. Compared to model distillation, BNS solvers benefit from a tiny parameter space ($<$200 parameters), fast optimization (two orders of magnitude faster), maintain diversity of samples, and in contrast to previous solver distillation approaches nearly close the gap from standard distillation methods such as Progressive Distillation in the low-medium NFE regime. For example, BNS solver achieves 45 PSNR / 1.76 FID using 16 NFE in class-conditional ImageNet-64. We experimented with BNS solvers for conditional image generation, text-to-image generation, and text-2-audio generat",
    "link": "https://arxiv.org/abs/2403.01329",
    "context": "Title: Bespoke Non-Stationary Solvers for Fast Sampling of Diffusion and Flow Models\nAbstract: arXiv:2403.01329v1 Announce Type: cross  Abstract: This paper introduces Bespoke Non-Stationary (BNS) Solvers, a solver distillation approach to improve sample efficiency of Diffusion and Flow models. BNS solvers are based on a family of non-stationary solvers that provably subsumes existing numerical ODE solvers and consequently demonstrate considerable improvement in sample approximation (PSNR) over these baselines. Compared to model distillation, BNS solvers benefit from a tiny parameter space ($<$200 parameters), fast optimization (two orders of magnitude faster), maintain diversity of samples, and in contrast to previous solver distillation approaches nearly close the gap from standard distillation methods such as Progressive Distillation in the low-medium NFE regime. For example, BNS solver achieves 45 PSNR / 1.76 FID using 16 NFE in class-conditional ImageNet-64. We experimented with BNS solvers for conditional image generation, text-to-image generation, and text-2-audio generat",
    "path": "papers/24/03/2403.01329.json",
    "total_tokens": 931,
    "translated_title": "为快速采样扩散和流动模型提供定制的非平稳求解器",
    "translated_abstract": "本文介绍了定制的非平稳（BNS）求解器，这是一种解算精髓方法，旨在提高扩散和流动模型的样本效率。BNS 求解器基于一系列可证明包含现有数值 ODE 求解器的非平稳求解器家族，随之显著改进样本逼近度（PSNR）超过这些基线。与模型精炼相比，BNS 求解器具有微小参数空间（<200 参数）、快速优化（快两个数量级）、保持样本多样性，并且与以前的求解器精炼方法相反，几乎能在低中 NFE 范围内接近标准精炼方法，如 Progressive Distillation。例如，BNS 求解器在 class-conditional ImageNet-64 中使用 16 NFE 实现 45 PSNR / 1.76 FID。我们尝试了 BNS 求解器来进行有条件图像生成、文本到图像生成和文本到音频生成。",
    "tldr": "该论文引入了定制的非平稳（BNS）求解器，提高了扩散和流动模型的采样效率，具有小参数空间、快速优化、样本多样性，并且在低中 NFE 范围内接近标准精炼方法。",
    "en_tdlr": "This paper introduces Bespoke Non-Stationary (BNS) Solvers to improve sample efficiency of Diffusion and Flow models, with a small parameter space, fast optimization, sample diversity, and nearing standard distillation methods in the low-medium NFE regime."
}