{
    "title": "Characteristic AI Agents via Large Language Models",
    "abstract": "arXiv:2403.12368v1 Announce Type: cross  Abstract: The advancement of Large Language Models (LLMs) has led to significant enhancements in the performance of chatbot systems. Many researchers have dedicated their efforts to the development of bringing characteristics to chatbots. While there have been commercial products for developing role-driven chatbots using LLMs, it is worth noting that academic research in this area remains relatively scarce. Our research focuses on investigating the performance of LLMs in constructing Characteristic AI Agents by simulating real-life individuals across different settings. Current investigations have primarily focused on act on roles with simple profiles. In response to this research gap, we create a benchmark for the characteristic AI agents task, including dataset, techniques, and evaluation metrics. A dataset called ``Character100'' is built for this benchmark, comprising the most-visited people on Wikipedia for language models to role-play. Wit",
    "link": "https://arxiv.org/abs/2403.12368",
    "context": "Title: Characteristic AI Agents via Large Language Models\nAbstract: arXiv:2403.12368v1 Announce Type: cross  Abstract: The advancement of Large Language Models (LLMs) has led to significant enhancements in the performance of chatbot systems. Many researchers have dedicated their efforts to the development of bringing characteristics to chatbots. While there have been commercial products for developing role-driven chatbots using LLMs, it is worth noting that academic research in this area remains relatively scarce. Our research focuses on investigating the performance of LLMs in constructing Characteristic AI Agents by simulating real-life individuals across different settings. Current investigations have primarily focused on act on roles with simple profiles. In response to this research gap, we create a benchmark for the characteristic AI agents task, including dataset, techniques, and evaluation metrics. A dataset called ``Character100'' is built for this benchmark, comprising the most-visited people on Wikipedia for language models to role-play. Wit",
    "path": "papers/24/03/2403.12368.json",
    "total_tokens": 828,
    "translated_title": "通过大型语言模型构建特征化AI代理",
    "translated_abstract": "大型语言模型（LLMs）的发展已极大增强了聊天机器人系统的性能。许多研究者致力于为聊天机器人赋予特征。尽管已有商业产品利用LLMs开发面向角色的聊天机器人，但值得注意的是，这一领域的学术研究相对较少。我们的研究旨在通过模拟不同情境下的现实个体，探讨LLMs构建特征化AI代理的性能。目前的研究主要集中在对具有简单配置文件的角色进行操作。针对这一研究空白，我们为特征化AI代理任务创建了一个基准，包括数据集、技术和评估指标。一个名为“Character100”的数据集被建立用于这一基准，包括维基百科上访问量最高的人物供语言模型扮演角色。",
    "tldr": "该研究通过模拟现实个体，探讨了大型语言模型在构建特征化AI代理方面的性能，为这一任务创建了新的基准数据集和评估指标。",
    "en_tdlr": "This research investigates the performance of Large Language Models (LLMs) in constructing Characteristic AI Agents by simulating real-life individuals, creating a benchmark dataset and evaluation metrics for this task."
}