{
    "title": "Tiny Graph Neural Networks for Radio Resource Management",
    "abstract": "arXiv:2403.19143v1 Announce Type: new  Abstract: The surge in demand for efficient radio resource management has necessitated the development of sophisticated yet compact neural network architectures. In this paper, we introduce a novel approach to Graph Neural Networks (GNNs) tailored for radio resource management by presenting a new architecture: the Low Rank Message Passing Graph Neural Network (LR-MPGNN). The cornerstone of LR-MPGNN is the implementation of a low-rank approximation technique that substitutes the conventional linear layers with their low-rank counterparts. This innovative design significantly reduces the model size and the number of parameters. We evaluate the performance of the proposed LR-MPGNN model based on several key metrics: model size, number of parameters, weighted sum rate of the communication system, and the distribution of eigenvalues of weight matrices. Our extensive evaluations demonstrate that the LR-MPGNN model achieves a sixtyfold decrease in model ",
    "link": "https://arxiv.org/abs/2403.19143",
    "context": "Title: Tiny Graph Neural Networks for Radio Resource Management\nAbstract: arXiv:2403.19143v1 Announce Type: new  Abstract: The surge in demand for efficient radio resource management has necessitated the development of sophisticated yet compact neural network architectures. In this paper, we introduce a novel approach to Graph Neural Networks (GNNs) tailored for radio resource management by presenting a new architecture: the Low Rank Message Passing Graph Neural Network (LR-MPGNN). The cornerstone of LR-MPGNN is the implementation of a low-rank approximation technique that substitutes the conventional linear layers with their low-rank counterparts. This innovative design significantly reduces the model size and the number of parameters. We evaluate the performance of the proposed LR-MPGNN model based on several key metrics: model size, number of parameters, weighted sum rate of the communication system, and the distribution of eigenvalues of weight matrices. Our extensive evaluations demonstrate that the LR-MPGNN model achieves a sixtyfold decrease in model ",
    "path": "papers/24/03/2403.19143.json",
    "total_tokens": 770,
    "translated_title": "用于无线资源管理的微型图神经网络",
    "translated_abstract": "高效的无线资源管理需求激增，迫使我们开发复杂而紧凑的神经网络架构。本文通过介绍一种针对无线资源管理定制的图神经网络（GNN）——低秩消息传递图神经网络（LR-MPGNN）来提出一种新方法。LR-MPGNN的核心是采用低秩近似技术，将传统的线性层替换为其低秩对应层。这种创新设计显著减少了模型大小和参数数量。我们通过几个关键指标对LR-MPGNN模型的性能进行评估：模型大小、参数数量、通信系统的加权总速率以及权重矩阵的特征值分布。我们的广泛评估表明，LR-MPGNN模型的模型大小减少了60倍",
    "tldr": "LR-MPGNN模型采用低秩近似技术，显著减少了模型大小和参数数量，取得了巨大的性能提升。",
    "en_tdlr": "The LR-MPGNN model significantly reduces the model size and the number of parameters by adopting low-rank approximation technique, leading to a significant performance improvement."
}