{
    "title": "Competitive Facility Location under Random Utilities and Routing Constraints",
    "abstract": "arXiv:2403.04264v1 Announce Type: new  Abstract: In this paper, we study a facility location problem within a competitive market context, where customer demand is predicted by a random utility choice model. Unlike prior research, which primarily focuses on simple constraints such as a cardinality constraint on the number of selected locations, we introduce routing constraints that necessitate the selection of locations in a manner that guarantees the existence of a tour visiting all chosen locations while adhering to a specified tour length upper bound. Such routing constraints find crucial applications in various real-world scenarios. The problem at hand features a non-linear objective function, resulting from the utilization of random utilities, together with complex routing constraints, making it computationally challenging. To tackle this problem, we explore three types of valid cuts, namely, outer-approximation and submodular cuts to handle the nonlinear objective function, as wel",
    "link": "https://arxiv.org/abs/2403.04264",
    "context": "Title: Competitive Facility Location under Random Utilities and Routing Constraints\nAbstract: arXiv:2403.04264v1 Announce Type: new  Abstract: In this paper, we study a facility location problem within a competitive market context, where customer demand is predicted by a random utility choice model. Unlike prior research, which primarily focuses on simple constraints such as a cardinality constraint on the number of selected locations, we introduce routing constraints that necessitate the selection of locations in a manner that guarantees the existence of a tour visiting all chosen locations while adhering to a specified tour length upper bound. Such routing constraints find crucial applications in various real-world scenarios. The problem at hand features a non-linear objective function, resulting from the utilization of random utilities, together with complex routing constraints, making it computationally challenging. To tackle this problem, we explore three types of valid cuts, namely, outer-approximation and submodular cuts to handle the nonlinear objective function, as wel",
    "path": "papers/24/03/2403.04264.json",
    "total_tokens": 780,
    "translated_title": "在随机效用和路径约束下的竞争设施选址问题",
    "translated_abstract": "本文研究了在竞争市场背景下的设施选址问题，其中顾客需求由随机效用选择模型预测。与以往主要关注简单约束（例如所选位置数量的基数约束）的研究不同，我们引入了路径约束，这些约束需要以一种方式选择位置，以保证存在访问所有选择位置的旅程，同时遵守指定的旅程长度上限。这种路径约束在各种现实场景中具有关键应用。所涉问题具有非线性目标函数，这是由于采用了随机效用，并且具有复杂的路径约束，使其在计算上具有挑战性。为了解决这个问题，我们探讨了三种有效割，即外估计和子模割，以处理非线性目标函数，以及",
    "tldr": "本文研究了在竞争市场背景下的设施选址问题，引入了路径约束，探讨了三种有效割以处理非线性目标函数。",
    "en_tdlr": "This paper studies the competitive facility location problem within a competitive market context, introduces routing constraints, and explores three types of valid cuts to handle the nonlinear objective function."
}