{
    "title": "GTA-HDR: A Large-Scale Synthetic Dataset for HDR Image Reconstruction",
    "abstract": "arXiv:2403.17837v1 Announce Type: cross  Abstract: High Dynamic Range (HDR) content (i.e., images and videos) has a broad range of applications. However, capturing HDR content from real-world scenes is expensive and time- consuming. Therefore, the challenging task of reconstructing visually accurate HDR images from their Low Dynamic Range (LDR) counterparts is gaining attention in the vision research community. A major challenge in this research problem is the lack of datasets, which capture diverse scene conditions (e.g., lighting, shadows, weather, locations, landscapes, objects, humans, buildings) and various image features (e.g., color, contrast, saturation, hue, luminance, brightness, radiance). To address this gap, in this paper, we introduce GTA-HDR, a large-scale synthetic dataset of photo-realistic HDR images sampled from the GTA-V video game. We perform thorough evaluation of the proposed dataset, which demonstrates significant qualitative and quantitative improvements of the",
    "link": "https://arxiv.org/abs/2403.17837",
    "context": "Title: GTA-HDR: A Large-Scale Synthetic Dataset for HDR Image Reconstruction\nAbstract: arXiv:2403.17837v1 Announce Type: cross  Abstract: High Dynamic Range (HDR) content (i.e., images and videos) has a broad range of applications. However, capturing HDR content from real-world scenes is expensive and time- consuming. Therefore, the challenging task of reconstructing visually accurate HDR images from their Low Dynamic Range (LDR) counterparts is gaining attention in the vision research community. A major challenge in this research problem is the lack of datasets, which capture diverse scene conditions (e.g., lighting, shadows, weather, locations, landscapes, objects, humans, buildings) and various image features (e.g., color, contrast, saturation, hue, luminance, brightness, radiance). To address this gap, in this paper, we introduce GTA-HDR, a large-scale synthetic dataset of photo-realistic HDR images sampled from the GTA-V video game. We perform thorough evaluation of the proposed dataset, which demonstrates significant qualitative and quantitative improvements of the",
    "path": "papers/24/03/2403.17837.json",
    "total_tokens": 888,
    "translated_title": "GTA-HDR：用于HDR图像重建的大规模合成数据集",
    "translated_abstract": "高动态范围（HDR）内容（即图像和视频）具有广泛的应用。然而，从现实场景中捕获HDR内容是昂贵且耗时的。因此，从其低动态范围（LDR）对应物中重建视觉精确的HDR图像的具有挑战性的任务引起了视觉研究社区的关注。在这个研究问题中的一个主要挑战是缺乏能够捕捉不同场景条件（如照明、阴影、天气、位置、景观、物体、人类、建筑）和各种图像特征（如颜色、对比度、饱和度、色调、亮度、辐射度）的数据集。为了填补这一差距，在本文中，我们介绍了GTA-HDR，这是一个从GTA-V视频游戏中采样的大规模逼真HDR图像的合成数据集。我们对所提出的数据集进行了彻底评估，结果显示了在定性和定量上的显著改进。",
    "tldr": "介绍了一个大规模合成的HDR图像数据集 GTA-HDR，从GTA-V视频游戏中采样，填补了现有数据集在捕捉不同场景条件和图像特征方面的不足",
    "en_tdlr": "Introducing GTA-HDR, a large-scale synthetic dataset of HDR images sampled from the GTA-V video game, addressing the lack of diversity in existing datasets in capturing different scene conditions and image features."
}