{
    "title": "DeepEclipse: How to Break White-Box DNN-Watermarking Schemes",
    "abstract": "arXiv:2403.03590v1 Announce Type: cross  Abstract: Deep Learning (DL) models have become crucial in digital transformation, thus raising concerns about their intellectual property rights. Different watermarking techniques have been developed to protect Deep Neural Networks (DNNs) from IP infringement, creating a competitive field for DNN watermarking and removal methods. The predominant watermarking schemes use white-box techniques, which involve modifying weights by adding a unique signature to specific DNN layers. On the other hand, existing attacks on white-box watermarking usually require knowledge of the specific deployed watermarking scheme or access to the underlying data for further training and fine-tuning. We propose DeepEclipse, a novel and unified framework designed to remove white-box watermarks. We present obfuscation techniques that significantly differ from the existing white-box watermarking removal schemes. DeepEclipse can evade watermark detection without prior knowl",
    "link": "https://arxiv.org/abs/2403.03590",
    "context": "Title: DeepEclipse: How to Break White-Box DNN-Watermarking Schemes\nAbstract: arXiv:2403.03590v1 Announce Type: cross  Abstract: Deep Learning (DL) models have become crucial in digital transformation, thus raising concerns about their intellectual property rights. Different watermarking techniques have been developed to protect Deep Neural Networks (DNNs) from IP infringement, creating a competitive field for DNN watermarking and removal methods. The predominant watermarking schemes use white-box techniques, which involve modifying weights by adding a unique signature to specific DNN layers. On the other hand, existing attacks on white-box watermarking usually require knowledge of the specific deployed watermarking scheme or access to the underlying data for further training and fine-tuning. We propose DeepEclipse, a novel and unified framework designed to remove white-box watermarks. We present obfuscation techniques that significantly differ from the existing white-box watermarking removal schemes. DeepEclipse can evade watermark detection without prior knowl",
    "path": "papers/24/03/2403.03590.json",
    "total_tokens": 848,
    "translated_title": "DeepEclipse: 如何破解白盒DNN水印方案",
    "translated_abstract": "深度学习（DL）模型在数字转型中变得至关重要，因此引起了对其知识产权的关注。不同的水印技术已被开发用于保护深度神经网络（DNNs）免受知识产权侵权，创造出一个竞争激烈的DNN水印和去水印方法领域。主要的水印方案使用白盒技术，涉及通过向特定DNN层添加唯一标识来修改权重。另一方面，对白盒水印的现有攻击通常需要了解特定部署的水印方案或访问基础数据以进行进一步训练和微调。我们提出DeepEclipse，一个新颖且统一的旨在移除白盒水印的框架。我们提出的混淆技术与现有白盒水印去除方案有显著区别。DeepEclipse可以在没有事先了解的情况下规避水印检测。",
    "tldr": "DeepEclipse提出了一种新颖统一的框架，用于移除白盒DNN水印，并采用与现有方法显著不同的混淆技术。",
    "en_tdlr": "DeepEclipse proposes a novel and unified framework for removing white-box DNN watermarks, employing obfuscation techniques significantly different from existing methods."
}