{
    "title": "\"Like a Nesting Doll\": Analyzing Recursion Analogies Generated by CS Students using Large Language Models",
    "abstract": "arXiv:2403.09409v1 Announce Type: cross  Abstract: Grasping complex computing concepts often poses a challenge for students who struggle to anchor these new ideas to familiar experiences and understandings. To help with this, a good analogy can bridge the gap between unfamiliar concepts and familiar ones, providing an engaging way to aid understanding. However, creating effective educational analogies is difficult even for experienced instructors. We investigate to what extent large language models (LLMs), specifically ChatGPT, can provide access to personally relevant analogies on demand. Focusing on recursion, a challenging threshold concept, we conducted an investigation analyzing the analogies generated by more than 350 first-year computing students. They were provided with a code snippet and tasked to generate their own recursion-based analogies using ChatGPT, optionally including personally relevant topics in their prompts. We observed a great deal of diversity in the analogies p",
    "link": "https://arxiv.org/abs/2403.09409",
    "context": "Title: \"Like a Nesting Doll\": Analyzing Recursion Analogies Generated by CS Students using Large Language Models\nAbstract: arXiv:2403.09409v1 Announce Type: cross  Abstract: Grasping complex computing concepts often poses a challenge for students who struggle to anchor these new ideas to familiar experiences and understandings. To help with this, a good analogy can bridge the gap between unfamiliar concepts and familiar ones, providing an engaging way to aid understanding. However, creating effective educational analogies is difficult even for experienced instructors. We investigate to what extent large language models (LLMs), specifically ChatGPT, can provide access to personally relevant analogies on demand. Focusing on recursion, a challenging threshold concept, we conducted an investigation analyzing the analogies generated by more than 350 first-year computing students. They were provided with a code snippet and tasked to generate their own recursion-based analogies using ChatGPT, optionally including personally relevant topics in their prompts. We observed a great deal of diversity in the analogies p",
    "path": "papers/24/03/2403.09409.json",
    "total_tokens": 920,
    "translated_title": "\"像套娃一样\"：利用大语言模型分析计算机科学学生生成的递归类比",
    "translated_abstract": "把复杂的计算概念融会贯通常常是学生面临的挑战，他们往往难以将这些新想法锚定在熟悉的经验和理解之上。为了帮助解决这一问题，一个好的类比可以弥合陌生概念与熟悉概念之间的鸿沟，提供了一种引人入胜的方式来帮助理解。然而，即使对于经验丰富的教师来说，创造有效的教育类比也是困难的。我们研究了大语言模型（LLMs），特别是ChatGPT，到底能够在多大程度上提供按需访问个人相关类比的可能性。我们专注于递归，这是一个具有挑战性的门槛概念，我们进行了一项调查，分析了350多名一年级计算机学生生成的类比。他们被要求使用ChatGPT生成基于递归的类比，其中可以选择在提示中包含个人相关主题。我们观察到生成的类比呈现出极大的多样性。",
    "tldr": "使用大语言模型ChatGPT，研究了超过350名一年级计算机学生生成的递归类比，探讨了如何利用这些类比帮助理解复杂的计算概念",
    "en_tdlr": "Investigated the recursion analogies generated by over 350 first-year computing students using the large language model ChatGPT to explore how these analogies can help in understanding complex computing concepts."
}