{
    "title": "GrINd: Grid Interpolation Network for Scattered Observations",
    "abstract": "arXiv:2403.19570v1 Announce Type: new  Abstract: Predicting the evolution of spatiotemporal physical systems from sparse and scattered observational data poses a significant challenge in various scientific domains. Traditional methods rely on dense grid-structured data, limiting their applicability in scenarios with sparse observations. To address this challenge, we introduce GrINd (Grid Interpolation Network for Scattered Observations), a novel network architecture that leverages the high-performance of grid-based models by mapping scattered observations onto a high-resolution grid using a Fourier Interpolation Layer. In the high-resolution space, a NeuralPDE-class model predicts the system's state at future timepoints using differentiable ODE solvers and fully convolutional neural networks parametrizing the system's dynamics. We empirically evaluate GrINd on the DynaBench benchmark dataset, comprising six different physical systems observed at scattered locations, demonstrating its s",
    "link": "https://arxiv.org/abs/2403.19570",
    "context": "Title: GrINd: Grid Interpolation Network for Scattered Observations\nAbstract: arXiv:2403.19570v1 Announce Type: new  Abstract: Predicting the evolution of spatiotemporal physical systems from sparse and scattered observational data poses a significant challenge in various scientific domains. Traditional methods rely on dense grid-structured data, limiting their applicability in scenarios with sparse observations. To address this challenge, we introduce GrINd (Grid Interpolation Network for Scattered Observations), a novel network architecture that leverages the high-performance of grid-based models by mapping scattered observations onto a high-resolution grid using a Fourier Interpolation Layer. In the high-resolution space, a NeuralPDE-class model predicts the system's state at future timepoints using differentiable ODE solvers and fully convolutional neural networks parametrizing the system's dynamics. We empirically evaluate GrINd on the DynaBench benchmark dataset, comprising six different physical systems observed at scattered locations, demonstrating its s",
    "path": "papers/24/03/2403.19570.json",
    "total_tokens": 886,
    "translated_title": "GrINd：网格插值网络用于离散观测",
    "translated_abstract": "从稀疏和分散的观测数据中预测时空物理系统的演变在各个科学领域中都是一个重要挑战。传统方法依赖于密集的网格结构数据，限制了它们在稀疏观测场景中的适用性。为了解决这一挑战，我们引入了GrINd（用于离散观测的网格插值网络），这是一种新颖的网络架构，通过使用傅立叶插值层将离散观测映射到高分辨率网格，发挥了基于网格的模型的高性能。在高分辨率空间中，一个NeuralPDE模型通过可微分的ODE求解器和完全卷积神经网络来参数化系统的动态，预测未来时间点的系统状态。我们在DynaBench基准数据集上对GrINd进行了实证评估，包括六种在分散位置观测到的不同物理系统，展示了其s。",
    "tldr": "GrINd是一种新颖的网络架构，通过傅立叶插值层将离散观测数据映射到高分辨率网格，实现了从稀疏和分散的观测数据中预测时空物理系统演变的能力。"
}