{
    "title": "Predictive Analysis of Tuberculosis Treatment Outcomes Using Machine Learning: A Karnataka TB Data Study at a Scale",
    "abstract": "arXiv:2403.08834v1 Announce Type: cross  Abstract: Tuberculosis (TB) remains a global health threat, ranking among the leading causes of mortality worldwide. In this context, machine learning (ML) has emerged as a transformative force, providing innovative solutions to the complexities associated with TB treatment.This study explores how machine learning, especially with tabular data, can be used to predict Tuberculosis (TB) treatment outcomes more accurately. It transforms this prediction task into a binary classification problem, generating risk scores from patient data sourced from NIKSHAY, India's national TB control program, which includes over 500,000 patient records.   Data preprocessing is a critical component of the study, and the model achieved an recall of 98% and an AUC-ROC score of 0.95 on the validation set, which includes 20,000 patient records.We also explore the use of Natural Language Processing (NLP) for improved model learning. Our results, corroborated by various m",
    "link": "https://arxiv.org/abs/2403.08834",
    "context": "Title: Predictive Analysis of Tuberculosis Treatment Outcomes Using Machine Learning: A Karnataka TB Data Study at a Scale\nAbstract: arXiv:2403.08834v1 Announce Type: cross  Abstract: Tuberculosis (TB) remains a global health threat, ranking among the leading causes of mortality worldwide. In this context, machine learning (ML) has emerged as a transformative force, providing innovative solutions to the complexities associated with TB treatment.This study explores how machine learning, especially with tabular data, can be used to predict Tuberculosis (TB) treatment outcomes more accurately. It transforms this prediction task into a binary classification problem, generating risk scores from patient data sourced from NIKSHAY, India's national TB control program, which includes over 500,000 patient records.   Data preprocessing is a critical component of the study, and the model achieved an recall of 98% and an AUC-ROC score of 0.95 on the validation set, which includes 20,000 patient records.We also explore the use of Natural Language Processing (NLP) for improved model learning. Our results, corroborated by various m",
    "path": "papers/24/03/2403.08834.json",
    "total_tokens": 905,
    "translated_title": "使用机器学习进行结核病治疗结果的预测分析：卡纳塔克邦规模的结核病数据研究",
    "translated_abstract": "结核病(TB)仍然是全球健康威胁之一，在全球致死原因中排名靠前。在这种背景下，机器学习(ML)已经成为一股变革性力量，为与TB治疗相关的复杂性提供创新解决方案。本研究探讨了如何利用机器学习，特别是利用表格数据，更准确地预测结核病(TB)治疗结果。它将这个预测任务转化为一个二元分类问题，从印度的国家结核病控制项目NIKSHAY中获取的患者数据生成风险分数，该项目包括超过50万患者记录。数据预处理是研究的关键组成部分，该模型在包含2万名患者记录的验证集上实现了98%的召回率和0.95的AUC-ROC分数。我们还探讨了自然语言处理(NLP)在改进模型学习中的应用。我们的结果经过了各种考虑，",
    "tldr": "该研究探索了如何利用机器学习和表格数据更准确地预测结核病治疗结果，并在验证集上取得了优异的性能。",
    "en_tdlr": "The study explores how to predict tuberculosis treatment outcomes more accurately using machine learning and tabular data, achieving excellent performance on the validation set."
}