{
    "title": "Machine Learning Techniques for Sensor-based Human Activity Recognition with Data Heterogeneity -- A Review",
    "abstract": "arXiv:2403.15422v1 Announce Type: cross  Abstract: Sensor-based Human Activity Recognition (HAR) is crucial in ubiquitous computing, analysing behaviours through multi-dimensional observations. Despite research progress, HAR confronts challenges, particularly in data distribution assumptions. Most studies often assume uniform data distributions across datasets, contrasting with the varied nature of practical sensor data in human activities. Addressing data heterogeneity issues can improve performance, reduce computational costs, and aid in developing personalized, adaptive models with less annotated data. This review investigates how machine learning addresses data heterogeneity in HAR, by categorizing data heterogeneity types, applying corresponding suitable machine learning methods, summarizing available datasets, and discussing future challenges.",
    "link": "https://arxiv.org/abs/2403.15422",
    "context": "Title: Machine Learning Techniques for Sensor-based Human Activity Recognition with Data Heterogeneity -- A Review\nAbstract: arXiv:2403.15422v1 Announce Type: cross  Abstract: Sensor-based Human Activity Recognition (HAR) is crucial in ubiquitous computing, analysing behaviours through multi-dimensional observations. Despite research progress, HAR confronts challenges, particularly in data distribution assumptions. Most studies often assume uniform data distributions across datasets, contrasting with the varied nature of practical sensor data in human activities. Addressing data heterogeneity issues can improve performance, reduce computational costs, and aid in developing personalized, adaptive models with less annotated data. This review investigates how machine learning addresses data heterogeneity in HAR, by categorizing data heterogeneity types, applying corresponding suitable machine learning methods, summarizing available datasets, and discussing future challenges.",
    "path": "papers/24/03/2403.15422.json",
    "total_tokens": 819,
    "translated_title": "基于传感器的人体活动识别中的数据异质性机器学习技术--综述",
    "translated_abstract": "arXiv:2403.15422v1 公告类型: 跨领域 摘要: 基于传感器的人体活动识别（HAR）在普适计算中至关重要，通过多维观察分析行为。 尽管研究取得了进展，HAR面临挑战，特别是在数据分布假设方面。 大多数研究通常假设各个数据集之间具有均匀的数据分布，与实际传感器数据在人类活动中的多样性相矛盾。 解决数据异质性问题可以提高性能，降低计算成本，并有助于开发个性化、自适应模型，减少标注数据。 本综述研究了机器学习如何处理HAR中的数据异质性，通过对数据异质性类型进行分类、应用相应的适当机器学习方法、总结可用数据集，并讨论未来挑战。",
    "tldr": "通过研究机器学习如何处理传感器数据异质性，能够改善人体活动识别系统的性能，降低计算成本，更快地开发出个性化的自适应模型。",
    "en_tdlr": "Exploring how machine learning techniques address data heterogeneity in sensor-based human activity recognition can enhance system performance, reduce computational costs, and expedite the development of personalized adaptive models."
}