{
    "title": "Symmetric Basis Convolutions for Learning Lagrangian Fluid Mechanics",
    "abstract": "arXiv:2403.16680v1 Announce Type: new  Abstract: Learning physical simulations has been an essential and central aspect of many recent research efforts in machine learning, particularly for Navier-Stokes-based fluid mechanics. Classic numerical solvers have traditionally been computationally expensive and challenging to use in inverse problems, whereas Neural solvers aim to address both concerns through machine learning. We propose a general formulation for continuous convolutions using separable basis functions as a superset of existing methods and evaluate a large set of basis functions in the context of (a) a compressible 1D SPH simulation, (b) a weakly compressible 2D SPH simulation, and (c) an incompressible 2D SPH Simulation. We demonstrate that even and odd symmetries included in the basis functions are key aspects of stability and accuracy. Our broad evaluation shows that Fourier-based continuous convolutions outperform all other architectures regarding accuracy and generalizat",
    "link": "https://arxiv.org/abs/2403.16680",
    "context": "Title: Symmetric Basis Convolutions for Learning Lagrangian Fluid Mechanics\nAbstract: arXiv:2403.16680v1 Announce Type: new  Abstract: Learning physical simulations has been an essential and central aspect of many recent research efforts in machine learning, particularly for Navier-Stokes-based fluid mechanics. Classic numerical solvers have traditionally been computationally expensive and challenging to use in inverse problems, whereas Neural solvers aim to address both concerns through machine learning. We propose a general formulation for continuous convolutions using separable basis functions as a superset of existing methods and evaluate a large set of basis functions in the context of (a) a compressible 1D SPH simulation, (b) a weakly compressible 2D SPH simulation, and (c) an incompressible 2D SPH Simulation. We demonstrate that even and odd symmetries included in the basis functions are key aspects of stability and accuracy. Our broad evaluation shows that Fourier-based continuous convolutions outperform all other architectures regarding accuracy and generalizat",
    "path": "papers/24/03/2403.16680.json",
    "total_tokens": 934,
    "translated_title": "对学习拉格朗日流体力学的对称基础卷积",
    "translated_abstract": "学习物理模拟已经成为机器学习领域许多最新研究工作的一个基本和核心方面，特别是针对纳维-斯托克斯基础的流体力学。经典数值求解器传统上在逆问题中计算昂贵且具有挑战性，而神经求解器旨在通过机器学习解决这两个问题。我们提出了使用可分离基础函数的连续卷积的通用公式作为现有方法的超集，并评估了大量基础函数在（a）可压缩1D SPH模拟，（b）弱可压缩2D SPH模拟和（c）不可压缩2D SPH模拟中的情况。我们展示了在基础函数中包括的偶对称性和奇对称性是稳定性和准确性的关键方面。我们广泛的评估显示，基于傅里叶的连续卷积在准确性和泛化性方面优于所有其他架构。",
    "tldr": "对称基础卷积提出了使用可分离基础函数的连续卷积的通用公式作为现有方法的超集，并评估了大量基础函数在不同流体模拟中的性能，结果表明偶数和奇数对称性是稳定性和准确性的关键因素。",
    "en_tdlr": "Symmetric Basis Convolutions propose a general formulation for continuous convolutions using separable basis functions as a superset of existing methods and evaluated a large set of basis functions in different fluid simulations, demonstrating that even and odd symmetries are key aspects of stability and accuracy."
}