{
    "title": "Neural Parameter Regression for Explicit Representations of PDE Solution Operators",
    "abstract": "arXiv:2403.12764v1 Announce Type: new  Abstract: We introduce Neural Parameter Regression (NPR), a novel framework specifically developed for learning solution operators in Partial Differential Equations (PDEs). Tailored for operator learning, this approach surpasses traditional DeepONets (Lu et al., 2021) by employing Physics-Informed Neural Network (PINN, Raissi et al., 2019) techniques to regress Neural Network (NN) parameters. By parametrizing each solution based on specific initial conditions, it effectively approximates a mapping between function spaces. Our method enhances parameter efficiency by incorporating low-rank matrices, thereby boosting computational efficiency and scalability. The framework shows remarkable adaptability to new initial and boundary conditions, allowing for rapid fine-tuning and inference, even in cases of out-of-distribution examples.",
    "link": "https://arxiv.org/abs/2403.12764",
    "context": "Title: Neural Parameter Regression for Explicit Representations of PDE Solution Operators\nAbstract: arXiv:2403.12764v1 Announce Type: new  Abstract: We introduce Neural Parameter Regression (NPR), a novel framework specifically developed for learning solution operators in Partial Differential Equations (PDEs). Tailored for operator learning, this approach surpasses traditional DeepONets (Lu et al., 2021) by employing Physics-Informed Neural Network (PINN, Raissi et al., 2019) techniques to regress Neural Network (NN) parameters. By parametrizing each solution based on specific initial conditions, it effectively approximates a mapping between function spaces. Our method enhances parameter efficiency by incorporating low-rank matrices, thereby boosting computational efficiency and scalability. The framework shows remarkable adaptability to new initial and boundary conditions, allowing for rapid fine-tuning and inference, even in cases of out-of-distribution examples.",
    "path": "papers/24/03/2403.12764.json",
    "total_tokens": 798,
    "translated_title": "神经参数回归用于PDE解算符的显式表示",
    "translated_abstract": "我们引入了神经参数回归（NPR），这是一个专门为学习偏微分方程（PDEs）中的解算符而开发的新颖框架。这种针对算子学习的方法通过采用物理信息神经网络（PINN，Raissi等，2019）技术来回归神经网络（NN）参数，超越了传统的DeepONets（Lu等，2021）。通过根据特定初始条件对每个解进行参数化，它有效地逼近了函数空间之间的映射。我们的方法通过合并低秩矩阵提高了参数效率，从而提高了计算效率和可扩展性。该框架表现出对新的初始和边界条件的出色适应性，允许快速微调和推理，甚至在分布之外的情况下也能实现。",
    "tldr": "神经参数回归框架在学习偏微分方程解算符方面利用物理信息神经网络技术，提高了参数效率和计算效率，具有出色的适应性和可扩展性。",
    "en_tdlr": "The Neural Parameter Regression framework, utilizing Physics-Informed Neural Network techniques for learning solution operators in Partial Differential Equations, enhances parameter efficiency, computational efficiency, and shows remarkable adaptability and scalability."
}