{
    "title": "Optimizing Risk-averse Human-AI Hybrid Teams",
    "abstract": "arXiv:2403.08386v1 Announce Type: new  Abstract: We anticipate increased instances of humans and AI systems working together in what we refer to as a hybrid team. The increase in collaboration is expected as AI systems gain proficiency and their adoption becomes more widespread. However, their behavior is not error-free, making hybrid teams a very suitable solution. As such, we consider methods for improving performance for these teams of humans and AI systems. For hybrid teams, we will refer to both the humans and AI systems as agents. To improve team performance over that seen for agents operating individually, we propose a manager which learns, through a standard Reinforcement Learning scheme, how to best delegate, over time, the responsibility of taking a decision to any of the agents. We further guide the manager's learning so they also minimize how many changes in delegation are made resulting from undesirable team behavior. We demonstrate the optimality of our manager's performa",
    "link": "https://arxiv.org/abs/2403.08386",
    "context": "Title: Optimizing Risk-averse Human-AI Hybrid Teams\nAbstract: arXiv:2403.08386v1 Announce Type: new  Abstract: We anticipate increased instances of humans and AI systems working together in what we refer to as a hybrid team. The increase in collaboration is expected as AI systems gain proficiency and their adoption becomes more widespread. However, their behavior is not error-free, making hybrid teams a very suitable solution. As such, we consider methods for improving performance for these teams of humans and AI systems. For hybrid teams, we will refer to both the humans and AI systems as agents. To improve team performance over that seen for agents operating individually, we propose a manager which learns, through a standard Reinforcement Learning scheme, how to best delegate, over time, the responsibility of taking a decision to any of the agents. We further guide the manager's learning so they also minimize how many changes in delegation are made resulting from undesirable team behavior. We demonstrate the optimality of our manager's performa",
    "path": "papers/24/03/2403.08386.json",
    "total_tokens": 872,
    "translated_title": "优化风险敏感的人工智能混合团队",
    "translated_abstract": "我们预计随着人类和人工智能系统在所谓的混合团队中合作的增加，这种合作的频率将增加。随着人工智能系统的熟练度提高和其采用变得更加广泛，预计协作将增加。但是，它们的行为并非无误，从而使混合团队成为一种非常合适的解决方案。因此，我们考虑了改进这些由人类和人工智能系统组成的团队的绩效的方法。对于混合团队，我们将人类和人工智能系统都称为代理。为了提高团队的表现，我们提出了一种经理，该经理通过标准的强化学习方案学习如何在一段时间内最好地委派决策责任给任何一个代理。我们进一步引导经理的学习，让他们最小化因不良团队行为而导致的委派变更次数。我们展示了管理者绩效的最优性。",
    "tldr": "提出了一种经理通过强化学习方案学习如何在混合人工智能团队中最佳分配决策责任，并最小化不良团队行为导致的委派变更次数。",
    "en_tdlr": "Proposed a manager that learns through a reinforcement learning scheme how to best delegate decision-making responsibilities in hybrid AI-human teams and minimizes changes in delegation due to undesirable team behavior."
}