{
    "title": "Design-Space Exploration of SNN Models using Application-Specific Multi-Core Architectures",
    "abstract": "arXiv:2403.12061v1 Announce Type: cross  Abstract: With the motivation and the difficulties that currently exist in comprehending and utilizing the promising features of SNNs, we proposed a novel run-time multi-core architecture-based simulator called \"RAVSim\" (Runtime Analysis and Visualization Simulator), a cutting-edge SNN simulator, developed using LabVIEW and it is publicly available on their website as an official module. RAVSim is a runtime virtual simulation environment tool that enables the user to interact with the model, observe its behavior of output concentration, and modify the set of parametric values at any time while the simulation is in execution. Recently some popular tools have been presented, but we believe that none of the tools allow users to interact with the model simulation in run time.",
    "link": "https://arxiv.org/abs/2403.12061",
    "context": "Title: Design-Space Exploration of SNN Models using Application-Specific Multi-Core Architectures\nAbstract: arXiv:2403.12061v1 Announce Type: cross  Abstract: With the motivation and the difficulties that currently exist in comprehending and utilizing the promising features of SNNs, we proposed a novel run-time multi-core architecture-based simulator called \"RAVSim\" (Runtime Analysis and Visualization Simulator), a cutting-edge SNN simulator, developed using LabVIEW and it is publicly available on their website as an official module. RAVSim is a runtime virtual simulation environment tool that enables the user to interact with the model, observe its behavior of output concentration, and modify the set of parametric values at any time while the simulation is in execution. Recently some popular tools have been presented, but we believe that none of the tools allow users to interact with the model simulation in run time.",
    "path": "papers/24/03/2403.12061.json",
    "total_tokens": 750,
    "translated_title": "使用应用特定多核架构设计SNN模型的设计空间探索",
    "translated_abstract": "鉴于当前理解和利用SNN的潜在特性存在的动机和困难，我们提出了一种名为“RAVSim”（运行时分析和可视化模拟器）的新型运行时多核架构模拟器，这是一款尖端的SNN模拟器，使用LabVIEW开发，并作为官方模块在其网站上公开提供。RAVSim是一种运行时虚拟仿真环境工具，使用户能够与模型互动，观察其输出浓度的行为，并在模拟执行过程中随时修改参数值集。最近已经提出了一些流行的工具，但我们认为这些工具都不允许用户与模型仿真进行实时交互。",
    "tldr": "提出了一种基于应用特定多核架构的新型运行时多核架构模拟器“RAVSim”，通过该模拟器，用户可以在执行过程中与模型交互并修改参数值集。",
    "en_tdlr": "Proposed a novel runtime multi-core architecture simulator \"RAVSim\" based on application-specific multi-core architectures, which allows users to interact with the model and modify parameter values set during execution."
}