{
    "title": "FARPLS: A Feature-Augmented Robot Trajectory Preference Labeling System to Assist Human Labelers' Preference Elicitation",
    "abstract": "arXiv:2403.06267v1 Announce Type: cross  Abstract: Preference-based learning aims to align robot task objectives with human values. One of the most common methods to infer human preferences is by pairwise comparisons of robot task trajectories. Traditional comparison-based preference labeling systems seldom support labelers to digest and identify critical differences between complex trajectories recorded in videos. Our formative study (N = 12) suggests that individuals may overlook non-salient task features and establish biased preference criteria during their preference elicitation process because of partial observations. In addition, they may experience mental fatigue when given many pairs to compare, causing their label quality to deteriorate. To mitigate these issues, we propose FARPLS, a Feature-Augmented Robot trajectory Preference Labeling System. FARPLS highlights potential outliers in a wide variety of task features that matter to humans and extracts the corresponding video ke",
    "link": "https://arxiv.org/abs/2403.06267",
    "context": "Title: FARPLS: A Feature-Augmented Robot Trajectory Preference Labeling System to Assist Human Labelers' Preference Elicitation\nAbstract: arXiv:2403.06267v1 Announce Type: cross  Abstract: Preference-based learning aims to align robot task objectives with human values. One of the most common methods to infer human preferences is by pairwise comparisons of robot task trajectories. Traditional comparison-based preference labeling systems seldom support labelers to digest and identify critical differences between complex trajectories recorded in videos. Our formative study (N = 12) suggests that individuals may overlook non-salient task features and establish biased preference criteria during their preference elicitation process because of partial observations. In addition, they may experience mental fatigue when given many pairs to compare, causing their label quality to deteriorate. To mitigate these issues, we propose FARPLS, a Feature-Augmented Robot trajectory Preference Labeling System. FARPLS highlights potential outliers in a wide variety of task features that matter to humans and extracts the corresponding video ke",
    "path": "papers/24/03/2403.06267.json",
    "total_tokens": 917,
    "translated_title": "FARPLS: 一个特征增强的机器人轨迹偏好标注系统，用于协助人类标注者的偏好获取",
    "translated_abstract": "基于偏好的学习旨在使机器人的任务目标与人类价值观保持一致。推断人类偏好的最常见方法之一是通过对机器人任务轨迹的两两比较。传统基于比较的偏好标注系统很少支持标注者消化和确定视频中记录的复杂轨迹之间的关键差异。我们的形成性研究（N = 12）表明，个体可能会忽视非显著的任务特征，并在偏好获取过程中建立有偏见的偏好标准，因为存在部分观察。此外，当给定许多配对进行比较时，他们可能会感到精神疲劳，导致标注质量下降。为了减轻这些问题，我们提出了FARPLS，一个特征增强的机器人轨迹偏好标注系统。FARPLS突出显示与人类相关的各种任务特征中的潜在异常值，并提取相应的视频关键帧。",
    "tldr": "FARPLS提出了一个特征增强的机器人轨迹偏好标注系统，用于帮助人类标注者在偏好获取过程中避免忽视重要特征、形成偏见标准和因比较过多而导致标注质量下降的问题。",
    "en_tdlr": "FARPLS introduces a feature-augmented robot trajectory preference labeling system to help human labelers avoid overlooking important features, forming biased criteria, and deteriorating label quality due to excessive comparisons."
}