{
    "title": "MG-TSD: Multi-Granularity Time Series Diffusion Models with Guided Learning Process",
    "abstract": "arXiv:2403.05751v1 Announce Type: cross  Abstract: Recently, diffusion probabilistic models have attracted attention in generative time series forecasting due to their remarkable capacity to generate high-fidelity samples. However, the effective utilization of their strong modeling ability in the probabilistic time series forecasting task remains an open question, partially due to the challenge of instability arising from their stochastic nature. To address this challenge, we introduce a novel Multi-Granularity Time Series Diffusion (MG-TSD) model, which achieves state-of-the-art predictive performance by leveraging the inherent granularity levels within the data as given targets at intermediate diffusion steps to guide the learning process of diffusion models. The way to construct the targets is motivated by the observation that the forward process of the diffusion model, which sequentially corrupts the data distribution to a standard normal distribution, intuitively aligns with the p",
    "link": "https://arxiv.org/abs/2403.05751",
    "context": "Title: MG-TSD: Multi-Granularity Time Series Diffusion Models with Guided Learning Process\nAbstract: arXiv:2403.05751v1 Announce Type: cross  Abstract: Recently, diffusion probabilistic models have attracted attention in generative time series forecasting due to their remarkable capacity to generate high-fidelity samples. However, the effective utilization of their strong modeling ability in the probabilistic time series forecasting task remains an open question, partially due to the challenge of instability arising from their stochastic nature. To address this challenge, we introduce a novel Multi-Granularity Time Series Diffusion (MG-TSD) model, which achieves state-of-the-art predictive performance by leveraging the inherent granularity levels within the data as given targets at intermediate diffusion steps to guide the learning process of diffusion models. The way to construct the targets is motivated by the observation that the forward process of the diffusion model, which sequentially corrupts the data distribution to a standard normal distribution, intuitively aligns with the p",
    "path": "papers/24/03/2403.05751.json",
    "total_tokens": 750,
    "translated_title": "MG-TSD：具有引导学习过程的多粒度时间序列扩散模型",
    "translated_abstract": "最近，扩散概率模型由于其生成高保真样本的显著能力而在生成式时间序列预测中引起关注。然而，由于其随机特性带来的不稳定性挑战，如何有效利用它们在概率时间序列预测任务中的强大建模能力仍然是一个悬而未决的问题。为了解决这一挑战，我们引入了一种新颖的多粒度时间序列扩散（MG-TSD）模型，通过利用数据内在的粒度水平作为中间扩散步骤的给定目标来指导扩散模型的学习过程，实现了最先进的预测性能。",
    "tldr": "提出了一种新颖的MG-TSD模型，利用数据内在粒度水平作为目标来引导学习过程，实现了状态-of-the-art的预测性能",
    "en_tdlr": "Introducing a novel MG-TSD model that leverages data granularity levels as targets to guide the learning process, achieving state-of-the-art predictive performance."
}