{
    "title": "Nonlinear shifts and dislocations in financial market structure and composition",
    "abstract": "arXiv:2403.15163v1 Announce Type: new  Abstract: This paper develops new mathematical techniques to identify temporal shifts among a collection of US equities partitioned into a new and more detailed set of market sectors. Although conceptually related, our three analyses reveal distinct insights about financial markets, with meaningful implications for investment managers. First, we explore a variety of methods to identify nonlinear shifts in market sector structure and describe the mathematical connection between the measure used and the captured phenomena. Second, we study network structure with respect to our new market sectors and identify meaningfully connected sector-to-sector mappings. Finally, we conduct a series of sampling experiments over different sample spaces and contrast the distribution of Sharpe ratios produced by long-only, long-short and short-only investment portfolios. In addition, we examine the sector composition of the top-performing portfolios for each of thes",
    "link": "https://arxiv.org/abs/2403.15163",
    "context": "Title: Nonlinear shifts and dislocations in financial market structure and composition\nAbstract: arXiv:2403.15163v1 Announce Type: new  Abstract: This paper develops new mathematical techniques to identify temporal shifts among a collection of US equities partitioned into a new and more detailed set of market sectors. Although conceptually related, our three analyses reveal distinct insights about financial markets, with meaningful implications for investment managers. First, we explore a variety of methods to identify nonlinear shifts in market sector structure and describe the mathematical connection between the measure used and the captured phenomena. Second, we study network structure with respect to our new market sectors and identify meaningfully connected sector-to-sector mappings. Finally, we conduct a series of sampling experiments over different sample spaces and contrast the distribution of Sharpe ratios produced by long-only, long-short and short-only investment portfolios. In addition, we examine the sector composition of the top-performing portfolios for each of thes",
    "path": "papers/24/03/2403.15163.json",
    "total_tokens": 839,
    "translated_title": "金融市场结构和构成中的非线性转变与错位",
    "translated_abstract": "本文开发了新的数学技术，以识别划分为新的、更详细的市场部门的一组美国股票之间的时间性转变。尽管在概念上相关，我们的三项分析揭示了关于金融市场的独特见解，对投资经理具有重要意义。首先，我们探讨了一系列方法来识别市场部门结构中的非线性转变，并描述了所使用的度量与捕获到的现象之间的数学联系。其次，我们研究了新市场部门的网络结构，并确定了有意义的部门与部门之间的映射关系。最后，我们对不同样本空间进行了一系列采样实验，并对只做多、做多做空和只做空投资组合产生的夏普比率分布进行了对比。此外，我们还研究了每个顶级投资组合的部门构成。",
    "tldr": "通过开发新的数学技术，识别金融市场中的非线性转变，研究新的市场部门的网络结构，以及分析不同投资组合产生的夏普比率分布。"
}