{
    "title": "R2D2 image reconstruction with model uncertainty quantification in radio astronomy",
    "abstract": "arXiv:2403.18052v1 Announce Type: cross  Abstract: The ``Residual-to-Residual DNN series for high-Dynamic range imaging'' (R2D2) approach was recently introduced for Radio-Interferometric (RI) imaging in astronomy. R2D2's reconstruction is formed as a series of residual images, iteratively estimated as outputs of Deep Neural Networks (DNNs) taking the previous iteration's image estimate and associated data residual as inputs. In this work, we investigate the robustness of the R2D2 image estimation process, by studying the uncertainty associated with its series of learned models. Adopting an ensemble averaging approach, multiple series can be trained, arising from different random DNN initializations of the training process at each iteration. The resulting multiple R2D2 instances can also be leveraged to generate ``R2D2 samples'', from which empirical mean and standard deviation endow the algorithm with a joint estimation and uncertainty quantification functionality. Focusing on RI imag",
    "link": "https://arxiv.org/abs/2403.18052",
    "context": "Title: R2D2 image reconstruction with model uncertainty quantification in radio astronomy\nAbstract: arXiv:2403.18052v1 Announce Type: cross  Abstract: The ``Residual-to-Residual DNN series for high-Dynamic range imaging'' (R2D2) approach was recently introduced for Radio-Interferometric (RI) imaging in astronomy. R2D2's reconstruction is formed as a series of residual images, iteratively estimated as outputs of Deep Neural Networks (DNNs) taking the previous iteration's image estimate and associated data residual as inputs. In this work, we investigate the robustness of the R2D2 image estimation process, by studying the uncertainty associated with its series of learned models. Adopting an ensemble averaging approach, multiple series can be trained, arising from different random DNN initializations of the training process at each iteration. The resulting multiple R2D2 instances can also be leveraged to generate ``R2D2 samples'', from which empirical mean and standard deviation endow the algorithm with a joint estimation and uncertainty quantification functionality. Focusing on RI imag",
    "path": "papers/24/03/2403.18052.json",
    "total_tokens": 867,
    "translated_title": "在射电天文学中量化模型不确定性的R2D2图像重建",
    "translated_abstract": "最近提出了用于天文学中射电干涉(RI)成像的“高动态范围成像的残差到残差DNN系列”(R2D2)方法。R2D2的重建形成为一系列残差图像，迭代地估计为以前迭代的图像估计和相关数据残差为输入的深度神经网络(DNN)的输出。在这项工作中，我们通过研究其学习模型系列的不确定性来研究R2D2图像估计过程的稳健性。采用集成平均方法，可以训练多个系列，来自在每次迭代过程中对训练过程进行不同随机DNN初始化。由此产生的多个R2D2实例也可用于产生“R2D2样本”，从中经验均值和标准差赋予算法联合估计和不确定性量化功能。重点放在RI imag",
    "tldr": "本论文研究了射电天文学中的R2D2图像重建方法，通过研究学习模型系列的不确定性，提出了一种使用集成平均方法进行不确定性量化的方式。",
    "en_tdlr": "This paper investigates the R2D2 image reconstruction method in radio astronomy, proposes a way to quantify uncertainty using ensemble averaging method by studying the uncertainty of the learned model series."
}