{
    "title": "A Continuous-Time Stochastic Model of the Fiscal Theory of the Price Level and Consistency of Its Critique",
    "abstract": "arXiv:2403.01593v1 Announce Type: new  Abstract: The paper tests the validity of the critique of the fiscal theory of the price level. A stochastic general equilibrium model with continuous time is constructed. An active fiscal policy and a passive monetary policy have been set. Monetary policy manages the interest rate through the Taylor rule. The stochastic default factor in the special form is introduced. A complete definite system of equations is obtained for the detection of equilibrium. It is asserted that the peculiarities of the approach to modeling are of critical importance for verifying the presence of certain hypotheses and formulating conclusions. The results of this work are in support of the fiscal theory of the price level.",
    "link": "https://arxiv.org/abs/2403.01593",
    "context": "Title: A Continuous-Time Stochastic Model of the Fiscal Theory of the Price Level and Consistency of Its Critique\nAbstract: arXiv:2403.01593v1 Announce Type: new  Abstract: The paper tests the validity of the critique of the fiscal theory of the price level. A stochastic general equilibrium model with continuous time is constructed. An active fiscal policy and a passive monetary policy have been set. Monetary policy manages the interest rate through the Taylor rule. The stochastic default factor in the special form is introduced. A complete definite system of equations is obtained for the detection of equilibrium. It is asserted that the peculiarities of the approach to modeling are of critical importance for verifying the presence of certain hypotheses and formulating conclusions. The results of this work are in support of the fiscal theory of the price level.",
    "path": "papers/24/03/2403.01593.json",
    "total_tokens": 688,
    "translated_title": "一种连续时间随机模型：物价水平财政理论及其批评的一致性",
    "translated_abstract": "本文测试了对物价水平财政理论批评的有效性。构建了一个连续时间的随机一般均衡模型。设定了积极的财政政策和消极的货币政策。货币政策通过泰勒规则管理利率。引入了特殊形式的随机违约因子。为检测均衡获得了一套完整确定的方程系统。该研究断言，对建模方法的特殊研究是验证特定假设存在以及得出结论的关键。本研究结果支持物价水平财政理论。",
    "tldr": "本研究构建了一种连续时间的随机模型，验证了物价水平财政理论的批评，支持该理论的存在。",
    "en_tdlr": "This study constructs a continuous-time stochastic model to test the critique of the fiscal theory of the price level and supports the theory's validity."
}