{
    "title": "Adaptive Learning Rate for Follow-the-Regularized-Leader: Competitive Ratio Analysis and Best-of-Both-Worlds",
    "abstract": "arXiv:2403.00715v1 Announce Type: new  Abstract: Follow-The-Regularized-Leader (FTRL) is known as an effective and versatile approach in online learning, where appropriate choice of the learning rate is crucial for smaller regret. To this end, we formulate the problem of adjusting FTRL's learning rate as a sequential decision-making problem and introduce the framework of competitive analysis. We establish a lower bound for the competitive ratio and propose update rules for learning rate that achieves an upper bound within a constant factor of this lower bound. Specifically, we illustrate that the optimal competitive ratio is characterized by the (approximate) monotonicity of components of the penalty term, showing that a constant competitive ratio is achievable if the components of the penalty term form a monotonically non-increasing sequence, and derive a tight competitive ratio when penalty terms are $\\xi$-approximately monotone non-increasing. Our proposed update rule, referred to a",
    "link": "https://arxiv.org/abs/2403.00715",
    "context": "Title: Adaptive Learning Rate for Follow-the-Regularized-Leader: Competitive Ratio Analysis and Best-of-Both-Worlds\nAbstract: arXiv:2403.00715v1 Announce Type: new  Abstract: Follow-The-Regularized-Leader (FTRL) is known as an effective and versatile approach in online learning, where appropriate choice of the learning rate is crucial for smaller regret. To this end, we formulate the problem of adjusting FTRL's learning rate as a sequential decision-making problem and introduce the framework of competitive analysis. We establish a lower bound for the competitive ratio and propose update rules for learning rate that achieves an upper bound within a constant factor of this lower bound. Specifically, we illustrate that the optimal competitive ratio is characterized by the (approximate) monotonicity of components of the penalty term, showing that a constant competitive ratio is achievable if the components of the penalty term form a monotonically non-increasing sequence, and derive a tight competitive ratio when penalty terms are $\\xi$-approximately monotone non-increasing. Our proposed update rule, referred to a",
    "path": "papers/24/03/2403.00715.json",
    "total_tokens": 862,
    "translated_title": "自适应学习率的FTRL算法的竞争比分析和最佳方案研究",
    "translated_abstract": "Follow-The-Regularized-Leader (FTRL)被认为是在线学习中一种有效且多功能的方法，其中学习率的恰当选择对于减小后悔是至关重要的。为此，我们将调整FTRL学习率的问题构建为一个顺序决策问题，并引入竞争分析框架。我们建立了竞争比的下界，并提出了学习率的更新规则，使其在一个常数因子内达到下界的上界。具体地，我们说明了最优竞争比是由惩罚项的组成部分的（近似）单调性所决定的，表明如果惩罚项的组成部分形成单调非增序列，则可以实现常数竞争比，并推导出了在惩罚项$\\xi$近似单调非增时的紧密竞争比。我们提出的更新规则被称为...",
    "tldr": "通过引入竞争分析框架，我们提出了调整FTRL学习率的更新规则，使其在常数因子内达到最佳竞争比，并且展示了当惩罚项具有近似单调性时的竞争比特性。",
    "en_tdlr": "By introducing the framework of competitive analysis, we propose update rules for adjusting the learning rate of FTRL that achieve the best competitive ratio within a constant factor, showing the competitive ratio characteristics when penalty terms have approximate monotonicity."
}