{
    "title": "Mathematical Foundation and Corrections for Full Range Head Pose Estimation",
    "abstract": "arXiv:2403.18104v1 Announce Type: cross  Abstract: Numerous works concerning head pose estimation (HPE) offer algorithms or proposed neural network-based approaches for extracting Euler angles from either facial key points or directly from images of the head region. However, many works failed to provide clear definitions of the coordinate systems and Euler or Tait-Bryan angles orders in use. It is a well-known fact that rotation matrices depend on coordinate systems, and yaw, roll, and pitch angles are sensitive to their application order. Without precise definitions, it becomes challenging to validate the correctness of the output head pose and drawing routines employed in prior works. In this paper, we thoroughly examined the Euler angles defined in the 300W-LP dataset, head pose estimation such as 3DDFA-v2, 6D-RepNet, WHENet, etc, and the validity of their drawing routines of the Euler angles. When necessary, we infer their coordinate system and sequence of yaw, roll, pitch from pro",
    "link": "https://arxiv.org/abs/2403.18104",
    "context": "Title: Mathematical Foundation and Corrections for Full Range Head Pose Estimation\nAbstract: arXiv:2403.18104v1 Announce Type: cross  Abstract: Numerous works concerning head pose estimation (HPE) offer algorithms or proposed neural network-based approaches for extracting Euler angles from either facial key points or directly from images of the head region. However, many works failed to provide clear definitions of the coordinate systems and Euler or Tait-Bryan angles orders in use. It is a well-known fact that rotation matrices depend on coordinate systems, and yaw, roll, and pitch angles are sensitive to their application order. Without precise definitions, it becomes challenging to validate the correctness of the output head pose and drawing routines employed in prior works. In this paper, we thoroughly examined the Euler angles defined in the 300W-LP dataset, head pose estimation such as 3DDFA-v2, 6D-RepNet, WHENet, etc, and the validity of their drawing routines of the Euler angles. When necessary, we infer their coordinate system and sequence of yaw, roll, pitch from pro",
    "path": "papers/24/03/2403.18104.json",
    "total_tokens": 774,
    "translated_title": "数学基础和完整头部姿势估计的修正",
    "translated_abstract": "许多有关头部姿势估计（HPE）的作品提供了用于从面部关键点或直接从头部区域图像中提取欧拉角的算法或基于神经网络的方法。然而，许多作品未提供所使用的坐标系和欧拉或Tait-Bryan角度顺序的清晰定义。本文彻底检查了300W-LP数据集中定义的欧拉角，头部姿势估计如3DDFA-v2、6D-RepNet、WHENet等，以及它们的欧拉角绘制例程的有效性。必要时，我们推断它们的坐标系和偏航、横滚、俯仰的顺序。",
    "tldr": "该论文研究了头部姿势估计中的坐标系和欧拉角顺序定义问题，验证了之前作品中使用的姿势输出的正确性和绘图例程的有效性。",
    "en_tdlr": "The paper investigates the issues of coordinate system and Euler angle order definitions in head pose estimation, validating the correctness of pose output and effectiveness of drawing routines used in prior works."
}