{
    "title": "Enhanced Detection of Transdermal Alcohol Levels Using Hyperdimensional Computing on Embedded Devices",
    "abstract": "arXiv:2403.12323v1 Announce Type: new  Abstract: Alcohol consumption has a significant impact on individuals' health, with even more pronounced consequences when consumption becomes excessive. One approach to promoting healthier drinking habits is implementing just-in-time interventions, where timely notifications indicating intoxication are sent during heavy drinking episodes. However, the complexity or invasiveness of an intervention mechanism may deter an individual from using them in practice. Previous research tackled this challenge using collected motion data and conventional Machine Learning (ML) algorithms to classify heavy drinking episodes, but with impractical accuracy and computational efficiency for mobile devices. Consequently, we have elected to use Hyperdimensional Computing (HDC) to design a just-in-time intervention approach that is practical for smartphones, smart wearables, and IoT deployment. HDC is a framework that has proven results in processing real-time sensor",
    "link": "https://arxiv.org/abs/2403.12323",
    "context": "Title: Enhanced Detection of Transdermal Alcohol Levels Using Hyperdimensional Computing on Embedded Devices\nAbstract: arXiv:2403.12323v1 Announce Type: new  Abstract: Alcohol consumption has a significant impact on individuals' health, with even more pronounced consequences when consumption becomes excessive. One approach to promoting healthier drinking habits is implementing just-in-time interventions, where timely notifications indicating intoxication are sent during heavy drinking episodes. However, the complexity or invasiveness of an intervention mechanism may deter an individual from using them in practice. Previous research tackled this challenge using collected motion data and conventional Machine Learning (ML) algorithms to classify heavy drinking episodes, but with impractical accuracy and computational efficiency for mobile devices. Consequently, we have elected to use Hyperdimensional Computing (HDC) to design a just-in-time intervention approach that is practical for smartphones, smart wearables, and IoT deployment. HDC is a framework that has proven results in processing real-time sensor",
    "path": "papers/24/03/2403.12323.json",
    "total_tokens": 829,
    "translated_title": "利用嵌入式设备上的超维计算增强皮下酒精水平检测",
    "translated_abstract": "酒精消费对个人健康有重要影响，过量饮酒会导致更严重后果。促进健康饮酒习惯的一种方法是实施及时干预，即在酗酒时段发送指示醉酒的及时通知。然而，干预机制的复杂性或侵入性可能会阻止个人在实践中使用它们。先前的研究使用收集的运动数据和传统机器学习（ML）算法来对酗酒时段进行分类，但对于移动设备来说，其准确性和计算效率并不实用。因此，我们选择使用超维计算（HDC）设计一个适用于智能手机、智能可穿戴设备和物联网部署的及时干预方法。HDC是一个在处理实时传感器数据方面取得验证结果的框架。",
    "tldr": "通过使用Hyperdimensional Computing（HDC）设计适用于智能手机、智能可穿戴设备和物联网的及时干预方法，增强了皮下酒精水平检测的效果。"
}