{
    "title": "On the Hull-White model with volatility smile for Valuation Adjustments",
    "abstract": "arXiv:2403.14841v1 Announce Type: new  Abstract: Affine Diffusion dynamics are frequently used for Valuation Adjustments (xVA) calculations due to their analytic tractability. However, these models cannot capture the market-implied skew and smile, which are relevant when computing xVA metrics. Hence, additional degrees of freedom are required to capture these market features. In this paper, we address this through an SDE with state-dependent coefficients. The SDE is consistent with the convex combination of a finite number of different AD dynamics. We combine Hull-White one-factor models where one model parameter is varied. We use the Randomized AD (RAnD) technique to parameterize the combination of dynamics. We refer to our SDE with state-dependent coefficients and the RAnD parametrization of the original models as the rHW model. The rHW model allows for efficient semi-analytic calibration to European swaptions through the analytic tractability of the Hull-White dynamics. We use a reg",
    "link": "https://arxiv.org/abs/2403.14841",
    "context": "Title: On the Hull-White model with volatility smile for Valuation Adjustments\nAbstract: arXiv:2403.14841v1 Announce Type: new  Abstract: Affine Diffusion dynamics are frequently used for Valuation Adjustments (xVA) calculations due to their analytic tractability. However, these models cannot capture the market-implied skew and smile, which are relevant when computing xVA metrics. Hence, additional degrees of freedom are required to capture these market features. In this paper, we address this through an SDE with state-dependent coefficients. The SDE is consistent with the convex combination of a finite number of different AD dynamics. We combine Hull-White one-factor models where one model parameter is varied. We use the Randomized AD (RAnD) technique to parameterize the combination of dynamics. We refer to our SDE with state-dependent coefficients and the RAnD parametrization of the original models as the rHW model. The rHW model allows for efficient semi-analytic calibration to European swaptions through the analytic tractability of the Hull-White dynamics. We use a reg",
    "path": "papers/24/03/2403.14841.json",
    "total_tokens": 841,
    "translated_title": "关于考虑波动率微笑的Hull-White模型用于估值调整",
    "translated_abstract": "Affine扩散动力学经常用于估值调整（xVA）计算，因为其具有解析易处理性。然而，这些模型无法捕捉市场隐含的偏斜和微笑，在计算xVA指标时这些是相关的。因此，需要额外的自由度来捕获这些市场特征。本文通过具有状态相关系数的SDE来解决这个问题。这个SDE与有限数量不同AD动态的凸组合一致。我们结合Hull-White一因素模型，其中一个模型参数被改变。我们使用随机AD（RAnD）技术来参数化动态的组合。我们将具有状态相关系数的SDE和原始模型的RAnD参数化称为rHW模型。rHW模型通过Hull-White动力学的解析易处理性实现对欧洲掉期的有效半解析校准。",
    "tldr": "通过引入具有状态相关系数的SDE和RAnD参数化原始模型，提出了能够有效半解析校准欧式掉期的rHW模型。",
    "en_tdlr": "The paper introduces the rHW model, which efficiently calibrates to European swaptions semi-analytically by introducing an SDE with state-dependent coefficients and RAnD parameterization of the original models to capture the market-implied skew and smile."
}