{
    "title": "Chain-of-Interaction: Enhancing Large Language Models for Psychiatric Behavior Understanding by Dyadic Contexts",
    "abstract": "arXiv:2403.13786v1 Announce Type: new  Abstract: Automatic coding patient behaviors is essential to support decision making for psychotherapists during the motivational interviewing (MI), a collaborative communication intervention approach to address psychiatric issues, such as alcohol and drug addiction. While the behavior coding task has rapidly adapted machine learning to predict patient states during the MI sessions, lacking of domain-specific knowledge and overlooking patient-therapist interactions are major challenges in developing and deploying those models in real practice. To encounter those challenges, we introduce the Chain-of-Interaction (CoI) prompting method aiming to contextualize large language models (LLMs) for psychiatric decision support by the dyadic interactions. The CoI prompting approach systematically breaks down the coding task into three key reasoning steps, extract patient engagement, learn therapist question strategies, and integrates dyadic interactions bet",
    "link": "https://arxiv.org/abs/2403.13786",
    "context": "Title: Chain-of-Interaction: Enhancing Large Language Models for Psychiatric Behavior Understanding by Dyadic Contexts\nAbstract: arXiv:2403.13786v1 Announce Type: new  Abstract: Automatic coding patient behaviors is essential to support decision making for psychotherapists during the motivational interviewing (MI), a collaborative communication intervention approach to address psychiatric issues, such as alcohol and drug addiction. While the behavior coding task has rapidly adapted machine learning to predict patient states during the MI sessions, lacking of domain-specific knowledge and overlooking patient-therapist interactions are major challenges in developing and deploying those models in real practice. To encounter those challenges, we introduce the Chain-of-Interaction (CoI) prompting method aiming to contextualize large language models (LLMs) for psychiatric decision support by the dyadic interactions. The CoI prompting approach systematically breaks down the coding task into three key reasoning steps, extract patient engagement, learn therapist question strategies, and integrates dyadic interactions bet",
    "path": "papers/24/03/2403.13786.json",
    "total_tokens": 930,
    "translated_title": "Chain-of-Interaction: 通过二元交互背景增强用于精神行为理解的大型语言模型",
    "translated_abstract": "自动编码患者行为对于支持精神治疗师在激励性面谈（MI）期间做出决策至关重要，MI是一种协作沟通干预方法，用于解决精神问题，如酒精和药物成瘾。尽管行为编码任务已迅速借助机器学习来预测MI会话期间患者状态，但缺乏领域专业知识并忽视患者-治疗师交互是在实际实践中开发和部署这些模型面临的主要挑战。为了解决这些挑战，我们提出了Chain-of-Interaction (CoI)提示方法，旨在通过二元交互情境来为精神决策支持上下文化大型语言模型(LLMs)。CoI提示方法系统地将编码任务分解为三个关键推理步骤，提取患者参与度，学习治疗师提问策略，并整合二元交互。",
    "tldr": "该论文引入了“Chain-of-Interaction (CoI)”提示方法，通过二元交互情境来为精神决策支持上下文化大型语言模型(LLMs)，以解决精神治疗中缺乏领域专业知识和忽视患者-治疗师交互的挑战。",
    "en_tdlr": "This paper introduces the \"Chain-of-Interaction (CoI)\" prompting method to contextualize large language models (LLMs) for psychiatric decision support by dyadic interactions, addressing the challenges of lacking domain-specific knowledge and overlooking patient-therapist interactions in psychiatric therapy."
}