{
    "title": "Hyperbolic Secant representation of the logistic function: Application to probabilistic Multiple Instance Learning for CT intracranial hemorrhage detection",
    "abstract": "arXiv:2403.14829v1 Announce Type: new  Abstract: Multiple Instance Learning (MIL) is a weakly supervised paradigm that has been successfully applied to many different scientific areas and is particularly well suited to medical imaging. Probabilistic MIL methods, and more specifically Gaussian Processes (GPs), have achieved excellent results due to their high expressiveness and uncertainty quantification capabilities. One of the most successful GP-based MIL methods, VGPMIL, resorts to a variational bound to handle the intractability of the logistic function. Here, we formulate VGPMIL using P\\'olya-Gamma random variables. This approach yields the same variational posterior approximations as the original VGPMIL, which is a consequence of the two representations that the Hyperbolic Secant distribution admits. This leads us to propose a general GP-based MIL method that takes different forms by simply leveraging distributions other than the Hyperbolic Secant one. Using the Gamma distribution",
    "link": "https://arxiv.org/abs/2403.14829",
    "context": "Title: Hyperbolic Secant representation of the logistic function: Application to probabilistic Multiple Instance Learning for CT intracranial hemorrhage detection\nAbstract: arXiv:2403.14829v1 Announce Type: new  Abstract: Multiple Instance Learning (MIL) is a weakly supervised paradigm that has been successfully applied to many different scientific areas and is particularly well suited to medical imaging. Probabilistic MIL methods, and more specifically Gaussian Processes (GPs), have achieved excellent results due to their high expressiveness and uncertainty quantification capabilities. One of the most successful GP-based MIL methods, VGPMIL, resorts to a variational bound to handle the intractability of the logistic function. Here, we formulate VGPMIL using P\\'olya-Gamma random variables. This approach yields the same variational posterior approximations as the original VGPMIL, which is a consequence of the two representations that the Hyperbolic Secant distribution admits. This leads us to propose a general GP-based MIL method that takes different forms by simply leveraging distributions other than the Hyperbolic Secant one. Using the Gamma distribution",
    "path": "papers/24/03/2403.14829.json",
    "total_tokens": 856,
    "translated_title": "逻辑函数的双曲正割表示：在CT颅内出血检测中的概率多示例学习应用",
    "translated_abstract": "多示例学习（MIL）是一种成功应用于许多不同科学领域的弱监督范式，特别适用于医学成像。概率MIL方法，尤其是高斯过程（GPs），由于其高表达性和不确定性量化能力已经取得了出色的结果。最成功的基于GP的MIL方法之一，VGPMIL，使用变分边界处理逻辑函数的不可解性。在这里，我们使用P\\'olya-Gamma随机变量来制定VGPMIL。这种方法产生与原始VGPMIL相同的变分后验近似，这是双曲正割分布所承认的两种表示的结果。这导致我们提出了一种通用的基于GP的MIL方法，通过简单利用除双曲正割以外的分布，可以采取不同形式。使用Gamma分布",
    "tldr": "通过使用P\\'olya-Gamma随机变量制定VGPMIL，该方法产生与原始VGPMIL相同的变分后验近似，这是双曲正割分布所承认的两种表示的结果。"
}