{
    "title": "User-friendly guarantees for the Langevin Monte Carlo with inaccurate gradient",
    "abstract": "arXiv:1710.00095v4 Announce Type: replace-cross  Abstract: In this paper, we study the problem of sampling from a given probability density function that is known to be smooth and strongly log-concave. We analyze several methods of approximate sampling based on discretizations of the (highly overdamped) Langevin diffusion and establish guarantees on its error measured in the Wasserstein-2 distance. Our guarantees improve or extend the state-of-the-art results in three directions. First, we provide an upper bound on the error of the first-order Langevin Monte Carlo (LMC) algorithm with optimized varying step-size. This result has the advantage of being horizon free (we do not need to know in advance the target precision) and to improve by a logarithmic factor the corresponding result for the constant step-size. Second, we study the case where accurate evaluations of the gradient of the log-density are unavailable, but one can have access to approximations of the aforementioned gradient.",
    "link": "https://arxiv.org/abs/1710.00095",
    "context": "Title: User-friendly guarantees for the Langevin Monte Carlo with inaccurate gradient\nAbstract: arXiv:1710.00095v4 Announce Type: replace-cross  Abstract: In this paper, we study the problem of sampling from a given probability density function that is known to be smooth and strongly log-concave. We analyze several methods of approximate sampling based on discretizations of the (highly overdamped) Langevin diffusion and establish guarantees on its error measured in the Wasserstein-2 distance. Our guarantees improve or extend the state-of-the-art results in three directions. First, we provide an upper bound on the error of the first-order Langevin Monte Carlo (LMC) algorithm with optimized varying step-size. This result has the advantage of being horizon free (we do not need to know in advance the target precision) and to improve by a logarithmic factor the corresponding result for the constant step-size. Second, we study the case where accurate evaluations of the gradient of the log-density are unavailable, but one can have access to approximations of the aforementioned gradient.",
    "path": "papers/17/10/1710.00095.json",
    "total_tokens": 806,
    "translated_title": "具有不准确梯度的 Langevin Monte Carlo 的用户友好保证",
    "translated_abstract": "在本文中，我们研究了从已知光滑且强对数凹函数的概率密度函数中采样的问题。我们分析了基于(高度过阻尼) Langevin 扩散的离散化的近似采样方法，并建立了在Wasserstein-2距离中测量的误差保证。我们在三个方向上改进或扩展了最新结果。首先，我们对优化的不定步长一阶 Langevin Monte Carlo(LMC)算法的误差给出了上界。这个结果的优点是不受时间限制(我们无需事先知道目标精度)，并且在对应的常数步长结果基础上提升了对数因子。其次，我们研究了当无法准确评估对数密度梯度，但可以获得前述梯度的近似时的情况。",
    "tldr": "该论文分析了具有不准确梯度的 Langevin Monte Carlo 算法的采样问题，并在Wasserstein-2距离中提出了改进的误差保证。",
    "en_tdlr": "The paper analyzes the sampling problem of Langevin Monte Carlo algorithm with inaccurate gradients and presents improved error guarantees in the Wasserstein-2 distance."
}