{
    "title": "Personalized Recommender System for Children's Book Recommendation with A Realtime Interactive Robot. (arXiv:1710.00310v3 [cs.IR] UPDATED)",
    "abstract": "In this paper we study the personalized book recommender system in a child-robot interactive environment. Firstly, we propose a novel text search algorithm using an inverse filtering mechanism that improves the efficiency. Secondly, we propose a user interest prediction method based on the Bayesian network and a novel feedback mechanism. According to children's fuzzy language input, the proposed method gives the predicted interests. Thirdly, the domain specific synonym association is proposed based on word vectorization, in order to improve the understanding of user intention. Experimental results show that the proposed recommender system has an improved performance and it can operate on embedded consumer devices with limited computational resources.",
    "link": "http://arxiv.org/abs/1710.00310",
    "context": "Title: Personalized Recommender System for Children's Book Recommendation with A Realtime Interactive Robot. (arXiv:1710.00310v3 [cs.IR] UPDATED)\nAbstract: In this paper we study the personalized book recommender system in a child-robot interactive environment. Firstly, we propose a novel text search algorithm using an inverse filtering mechanism that improves the efficiency. Secondly, we propose a user interest prediction method based on the Bayesian network and a novel feedback mechanism. According to children's fuzzy language input, the proposed method gives the predicted interests. Thirdly, the domain specific synonym association is proposed based on word vectorization, in order to improve the understanding of user intention. Experimental results show that the proposed recommender system has an improved performance and it can operate on embedded consumer devices with limited computational resources.",
    "path": "papers/17/10/1710.00310.json",
    "total_tokens": 796,
    "translated_title": "面向儿童图书推荐的个性化推荐系统及其与实时交互机器人集成",
    "translated_abstract": "本文研究了在儿童和机器人交互环境中的个性化图书推荐系统。首先，我们提出了一种新的文本搜索算法，使用反向过滤机制来提高效率。其次，我们提出了一种基于贝叶斯网络和新型反馈机制的用户兴趣预测方法。根据儿童模糊的语言输入，该方法给出了预测的兴趣。第三，基于词向量化，提出了领域特定的同义词关联，以提高理解用户意图。实验结果表明，该推荐系统性能得到了改进，并且可以在有限的计算资源下运行在嵌入式消费设备上。",
    "tldr": "本文研究了儿童和机器人交互环境下的个性化图书推荐系统，在搜索算法、用户兴趣预测和同义词关联方面进行了创新，提高了性能，适用于嵌入式消费设备。",
    "en_tdlr": "This paper proposes a personalized book recommender system for children, integrated with a real-time interactive robot. Innovative methods include a novel text search algorithm, a user interest prediction method based on Bayesian network and feedback mechanism, and domain specific synonym association based on word vectorization, resulting in improved performance and applicability to embedded consumer devices."
}