{
    "title": "Exploiting Neighbor Effect: Conv-Agnostic GNNs Framework for Graphs with Heterophily. (arXiv:2203.11200v3 [cs.LG] UPDATED)",
    "abstract": "Due to the homophily assumption in graph convolution networks (GNNs), a common consensus in the graph node classification task is that GNNs perform well on homophilic graphs but may fail on heterophilic graphs with many inter-class edges. However, the previous inter-class edges perspective and related homo-ratio metrics cannot well explain the GNNs performance under some heterophilic datasets, which implies that not all the inter-class edges are harmful to GNNs. In this work, we propose a new metric based on von Neumann entropy to re-examine the heterophily problem of GNNs and investigate the feature aggregation of inter-class edges from an entire neighbor identifiable perspective. Moreover, we propose a simple yet effective Conv-Agnostic GNN framework (CAGNNs) to enhance the performance of most GNNs on heterophily datasets by learning the neighbor effect for each node. Specifically, we first decouple the feature of each node into the discriminative feature for downstream tasks and the",
    "link": "http://arxiv.org/abs/2203.11200",
    "context": "Title: Exploiting Neighbor Effect: Conv-Agnostic GNNs Framework for Graphs with Heterophily. (arXiv:2203.11200v3 [cs.LG] UPDATED)\nAbstract: Due to the homophily assumption in graph convolution networks (GNNs), a common consensus in the graph node classification task is that GNNs perform well on homophilic graphs but may fail on heterophilic graphs with many inter-class edges. However, the previous inter-class edges perspective and related homo-ratio metrics cannot well explain the GNNs performance under some heterophilic datasets, which implies that not all the inter-class edges are harmful to GNNs. In this work, we propose a new metric based on von Neumann entropy to re-examine the heterophily problem of GNNs and investigate the feature aggregation of inter-class edges from an entire neighbor identifiable perspective. Moreover, we propose a simple yet effective Conv-Agnostic GNN framework (CAGNNs) to enhance the performance of most GNNs on heterophily datasets by learning the neighbor effect for each node. Specifically, we first decouple the feature of each node into the discriminative feature for downstream tasks and the",
    "path": "papers/22/03/2203.11200.json",
    "total_tokens": 1087,
    "translated_title": "利用邻居效应：适用于异质性图的Conv-Agnostic GNNs框架。",
    "translated_abstract": "由于图卷积网络（GNNs）中同质性假设的存在，图节点分类任务中的一个共识是GNNs在同质性图上表现良好，但在具有许多跨类边的异质性图上可能会失败。然而，以前的跨类边观点和相关的同质比指标不能很好地解释GNNs在某些异质性数据集下的表现，这意味着并非所有跨类边对GNNs都是有害的。在本研究中，我们提出了一种基于von Neumann熵的新指标，重新审视了GNNs的异质性问题，并从整个邻居可识别的角度研究了跨类边的特征聚合。此外，我们提出了一个简单而有效的Conv-Agnostic GNN框架（CAGNNs），通过为每个节点学习邻居效应，在异质性数据集上增强了大多数GNN的性能。具体而言，我们首先将每个节点的特征分解为用于下游任务的判别特征和邻居特征，然后提出了一种邻居特征聚合模块，在CAGNNs框架中自适应地聚合邻居特征。",
    "tldr": "该论文提出了一种基于von Neumann熵的新指标来重新审视GNNs的异质性问题，并从整个邻居可识别的角度研究跨类边的特征聚合。此外，还提出了一个Conv-Agnostic GNN框架，通过学习每个节点的邻居效应，在异质性数据集上增强了大多数GNN的性能。",
    "en_tdlr": "This paper proposes a new metric based on von Neumann entropy to re-examine the heterophily problem of GNNs and investigates the feature aggregation of inter-class edges from an entire neighbor identifiable perspective. Furthermore, a Conv-Agnostic GNN framework is presented, which enhances the performance of most GNNs on heterophily datasets by learning the neighbor effect for each node."
}