{
    "title": "A Trainable Approach to Zero-delay Smoothing Spline Interpolation. (arXiv:2203.03776v3 [cs.LG] UPDATED)",
    "abstract": "The task of reconstructing smooth signals from streamed data in the form of signal samples arises in various applications. This work addresses such a task subject to a zero-delay response; that is, the smooth signal must be reconstructed sequentially as soon as a data sample is available and without having access to subsequent data. State-of-the-art approaches solve this problem by interpolating consecutive data samples using splines. Here, each interpolation step yields a piece that ensures a smooth signal reconstruction while minimizing a cost metric, typically a weighted sum between the squared residual and a derivative-based measure of smoothness. As a result, a zero-delay interpolation is achieved in exchange for an almost certainly higher cumulative cost as compared to interpolating all data samples together. This paper presents a novel approach to further reduce this cumulative cost on average. First, we formulate a zero-delay smoothing spline interpolation problem from a sequen",
    "link": "http://arxiv.org/abs/2203.03776",
    "context": "Title: A Trainable Approach to Zero-delay Smoothing Spline Interpolation. (arXiv:2203.03776v3 [cs.LG] UPDATED)\nAbstract: The task of reconstructing smooth signals from streamed data in the form of signal samples arises in various applications. This work addresses such a task subject to a zero-delay response; that is, the smooth signal must be reconstructed sequentially as soon as a data sample is available and without having access to subsequent data. State-of-the-art approaches solve this problem by interpolating consecutive data samples using splines. Here, each interpolation step yields a piece that ensures a smooth signal reconstruction while minimizing a cost metric, typically a weighted sum between the squared residual and a derivative-based measure of smoothness. As a result, a zero-delay interpolation is achieved in exchange for an almost certainly higher cumulative cost as compared to interpolating all data samples together. This paper presents a novel approach to further reduce this cumulative cost on average. First, we formulate a zero-delay smoothing spline interpolation problem from a sequen",
    "path": "papers/22/03/2203.03776.json",
    "total_tokens": 869,
    "tldr": "本文提出了一种可学习的零延迟平滑样条插值方法，通过插值并最小化代价指标，以实现连续重建平滑信号，同时平均减少累计代价。",
    "en_tdlr": "This paper proposes a trainable approach to zero-delay smoothing spline interpolation, which enables continuous reconstruction of smooth signals by interpolating and minimizing cost metric, while reducing the cumulative cost on average."
}