{
    "title": "Automatic Identification of Chemical Moieties. (arXiv:2203.16205v2 [physics.chem-ph] UPDATED)",
    "abstract": "In recent years, the prediction of quantum mechanical observables with machine learning methods has become increasingly popular. Message-passing neural networks (MPNNs) solve this task by constructing atomic representations, from which the properties of interest are predicted. Here, we introduce a method to automatically identify chemical moieties (molecular building blocks) from such representations, enabling a variety of applications beyond property prediction, which otherwise rely on expert knowledge. The required representation can either be provided by a pretrained MPNN, or learned from scratch using only structural information. Beyond the data-driven design of molecular fingerprints, the versatility of our approach is demonstrated by enabling the selection of representative entries in chemical databases, the automatic construction of coarse-grained force fields, as well as the identification of reaction coordinates.",
    "link": "http://arxiv.org/abs/2203.16205",
    "context": "Title: Automatic Identification of Chemical Moieties. (arXiv:2203.16205v2 [physics.chem-ph] UPDATED)\nAbstract: In recent years, the prediction of quantum mechanical observables with machine learning methods has become increasingly popular. Message-passing neural networks (MPNNs) solve this task by constructing atomic representations, from which the properties of interest are predicted. Here, we introduce a method to automatically identify chemical moieties (molecular building blocks) from such representations, enabling a variety of applications beyond property prediction, which otherwise rely on expert knowledge. The required representation can either be provided by a pretrained MPNN, or learned from scratch using only structural information. Beyond the data-driven design of molecular fingerprints, the versatility of our approach is demonstrated by enabling the selection of representative entries in chemical databases, the automatic construction of coarse-grained force fields, as well as the identification of reaction coordinates.",
    "path": "papers/22/03/2203.16205.json",
    "total_tokens": 770,
    "translated_title": "化学基元的自动识别",
    "translated_abstract": "近年来，机器学习方法在预测量子力学可观测量方面越来越受欢迎。消息传递神经网络（MPNNs）通过构建原子表示来解决此任务，从中预测感兴趣的特性。在这里，我们介绍了一种方法来自动识别这些表示中的化学基元（分子建筑块），从而实现了多种应用，这些应用通常需要专业知识。所需的表示可以是预先训练好的MPNN提供，也可以仅使用结构信息从头学习。除了数据驱动的分子指纹设计之外，我们的方法的多功能性也通过使化学数据库中具有代表性的条目的选择、自动构建粗粒化力场以及识别反应坐标等方面得到了证明。",
    "tldr": "该论文介绍了一种自动识别化学基元的方法，使得在化学数据库中选择代表性条目、自动构建粗粒化力场以及识别反应坐标等应用成为可能。",
    "en_tdlr": "The paper introduces a method for automatic identification of chemical moieties, which enables a variety of applications including selecting representative entries in chemical databases, constructing coarse-grained force fields, and identifying reaction coordinates."
}