{
    "title": "SERA: Safe and Efficient Reactive Obstacle Avoidance for Collaborative Robotic Planning in Unstructured Environments. (arXiv:2203.13821v2 [cs.RO] UPDATED)",
    "abstract": "Safe and efficient collaboration among multiple robots in unstructured environments is increasingly critical in the era of Industry 4.0. However, achieving robust and autonomous collaboration among humans and other robots requires modern robotic systems to have effective proximity perception and reactive obstacle avoidance. In this paper, we propose a novel methodology for reactive whole-body obstacle avoidance that ensures conflict-free robot-robot interactions even in dynamic environment. Unlike existing approaches based on Jacobian-type, sampling based or geometric techniques, our methodology leverages the latest deep learning advances and topological manifold learning, enabling it to be readily generalized to other problem settings with high computing efficiency and fast graph traversal techniques. Our approach allows a robotic arm to proactively avoid obstacles of arbitrary 3D shapes without direct contact, a significant improvement over traditional industrial cobot settings. To v",
    "link": "http://arxiv.org/abs/2203.13821",
    "context": "Title: SERA: Safe and Efficient Reactive Obstacle Avoidance for Collaborative Robotic Planning in Unstructured Environments. (arXiv:2203.13821v2 [cs.RO] UPDATED)\nAbstract: Safe and efficient collaboration among multiple robots in unstructured environments is increasingly critical in the era of Industry 4.0. However, achieving robust and autonomous collaboration among humans and other robots requires modern robotic systems to have effective proximity perception and reactive obstacle avoidance. In this paper, we propose a novel methodology for reactive whole-body obstacle avoidance that ensures conflict-free robot-robot interactions even in dynamic environment. Unlike existing approaches based on Jacobian-type, sampling based or geometric techniques, our methodology leverages the latest deep learning advances and topological manifold learning, enabling it to be readily generalized to other problem settings with high computing efficiency and fast graph traversal techniques. Our approach allows a robotic arm to proactively avoid obstacles of arbitrary 3D shapes without direct contact, a significant improvement over traditional industrial cobot settings. To v",
    "path": "papers/22/03/2203.13821.json",
    "total_tokens": 941,
    "translated_title": "SERA: 用于协作机器人规划的安全高效反应式障碍物避免方法在非结构化环境中（arXiv:2203.13821v2 [cs.RO] UPDATED）",
    "translated_abstract": "在工业4.0时代, 多个机器人在非结构化环境中实现安全高效的协作日益关键。然而, 实现人类和其他机器人之间的强健自治协作需要现代机器人系统具备有效的邻近感知和反应式障碍物避免能力。在本文中，我们提出了一种新颖的反应式全身障碍物避免方法，即使在动态环境中也可以确保无冲突的机器人间互动。与现有的基于雅各比类型、采样或几何技术的方法不同，我们的方法利用了最新的深度学习进展和拓扑流形学习，使其能够轻松地推广到其他具有高计算效率和快速图遍历技术的问题设置中。我们的方法允许机械臂在没有直接接触的情况下主动避开任意3D形状的障碍物，这是传统工业协作机器人设置的重要改进。",
    "tldr": "提出了一种新的方法，利用最新的深度学习进展和拓扑流形学习，实现了反应式全身障碍物避免，可避开任意形状的障碍物，并能轻松地推广到其他问题设置中。",
    "en_tdlr": "A novel methodology for reactive whole-body obstacle avoidance is proposed, leveraging the latest deep learning advances and topological manifold learning. The approach allows a robotic arm to proactively avoid obstacles of arbitrary 3D shapes without direct contact, and can be readily generalized to other problem settings."
}