{
    "title": "Euler State Networks: Non-dissipative Reservoir Computing. (arXiv:2203.09382v3 [cs.LG] UPDATED)",
    "abstract": "Inspired by the numerical solution of ordinary differential equations, in this paper we propose a novel Reservoir Computing (RC) model, called the Euler State Network (EuSN). The presented approach makes use of forward Euler discretization and antisymmetric recurrent matrices to design reservoir dynamics that are both stable and non-dissipative by construction.  Our mathematical analysis shows that the resulting model is biased towards a unitary effective spectral radius and zero local Lyapunov exponents, intrinsically operating near to the edge of stability. Experiments on long-term memory tasks show the clear superiority of the proposed approach over standard RC models in problems requiring effective propagation of input information over multiple time-steps. Furthermore, results on time-series classification benchmarks indicate that EuSN is able to match (or even exceed) the accuracy of trainable Recurrent Neural Networks, while retaining the training efficiency of the RC family, res",
    "link": "http://arxiv.org/abs/2203.09382",
    "context": "Title: Euler State Networks: Non-dissipative Reservoir Computing. (arXiv:2203.09382v3 [cs.LG] UPDATED)\nAbstract: Inspired by the numerical solution of ordinary differential equations, in this paper we propose a novel Reservoir Computing (RC) model, called the Euler State Network (EuSN). The presented approach makes use of forward Euler discretization and antisymmetric recurrent matrices to design reservoir dynamics that are both stable and non-dissipative by construction.  Our mathematical analysis shows that the resulting model is biased towards a unitary effective spectral radius and zero local Lyapunov exponents, intrinsically operating near to the edge of stability. Experiments on long-term memory tasks show the clear superiority of the proposed approach over standard RC models in problems requiring effective propagation of input information over multiple time-steps. Furthermore, results on time-series classification benchmarks indicate that EuSN is able to match (or even exceed) the accuracy of trainable Recurrent Neural Networks, while retaining the training efficiency of the RC family, res",
    "path": "papers/22/03/2203.09382.json",
    "total_tokens": 897,
    "translated_title": "Euler State Networks: 非耗散性水库计算",
    "translated_abstract": "本文受到常微分方程的数值解启发，提出了一种新型水库计算(EuSN)模型，该方法利用前向欧拉离散化和反对称循环矩阵来设计水库动力学。该模型的数学分析表明，其具有接近稳定边缘的饱和有效谱半径和零局部李雅普诺夫指数。对长期记忆任务的实验表明，与标准水库计算模型相比，所提出的方法在需要多个时步有效传播输入信息的问题上具有明显的优势。此外，时间序列分类基准测试结果表明，EuSN能够匹配甚至超过可训练循环神经网络的准确性，同时保持水库计算家族的训练效率。",
    "tldr": "本文提出了一种新型水库计算模型EuSN，其利用前向欧拉离散化和反对称循环矩阵来设计水库动力学，具有接近稳定边缘的饱和有效谱半径和零局部李雅普诺夫指数。在长期记忆任务和时间序列分类基准测试中表现出了优异的性能。"
}