{
    "title": "Differential Privacy Amplification in Quantum and Quantum-inspired Algorithms. (arXiv:2203.03604v2 [quant-ph] UPDATED)",
    "abstract": "Differential privacy provides a theoretical framework for processing a dataset about $n$ users, in a way that the output reveals a minimal information about any single user. Such notion of privacy is usually ensured by noise-adding mechanisms and amplified by several processes, including subsampling, shuffling, iteration, mixing and diffusion. In this work, we provide privacy amplification bounds for quantum and quantum-inspired algorithms. In particular, we show for the first time, that algorithms running on quantum encoding of a classical dataset or the outcomes of quantum-inspired classical sampling, amplify differential privacy. Moreover, we prove that a quantum version of differential privacy is amplified by the composition of quantum channels, provided that they satisfy some mixing conditions.",
    "link": "http://arxiv.org/abs/2203.03604",
    "context": "Title: Differential Privacy Amplification in Quantum and Quantum-inspired Algorithms. (arXiv:2203.03604v2 [quant-ph] UPDATED)\nAbstract: Differential privacy provides a theoretical framework for processing a dataset about $n$ users, in a way that the output reveals a minimal information about any single user. Such notion of privacy is usually ensured by noise-adding mechanisms and amplified by several processes, including subsampling, shuffling, iteration, mixing and diffusion. In this work, we provide privacy amplification bounds for quantum and quantum-inspired algorithms. In particular, we show for the first time, that algorithms running on quantum encoding of a classical dataset or the outcomes of quantum-inspired classical sampling, amplify differential privacy. Moreover, we prove that a quantum version of differential privacy is amplified by the composition of quantum channels, provided that they satisfy some mixing conditions.",
    "path": "papers/22/03/2203.03604.json",
    "total_tokens": 827,
    "translated_title": "量子和量子启发式算法中的差分隐私放大",
    "translated_abstract": "差分隐私为处理关于n个用户的数据集提供了一个理论框架，以确保输出对任何单个用户的信息泄露最小化。通常，通过添加噪声和进行子采样、洗牌、迭代、混合和扩散等多个过程来实现这种隐私保护。本研究提供了量子和量子启发式算法的隐私放大界限。具体而言，我们首次展示了在量子编码的经典数据集上运行的算法或量子启发式经典采样的结果能够放大差分隐私。此外，我们证明了量子版本的差分隐私通过满足一些混合条件，可以通过量子通道的组合来放大。",
    "tldr": "本研究提供了量子和量子启发式算法的差分隐私放大界限。首次展示了通过量子编码的经典数据集的算法或量子启发式经典采样结果能够放大差分隐私。研究还证明了量子版本的差分隐私可以通过满足混合条件的量子通道组合来放大。",
    "en_tdlr": "This study provides privacy amplification bounds for quantum and quantum-inspired algorithms. It demonstrates for the first time that algorithms running on the quantum encoding of a classical dataset or the outcomes of quantum-inspired classical sampling can amplify differential privacy. The study also proves that a quantum version of differential privacy can be amplified by the composition of quantum channels satisfying mixing conditions."
}