{
    "title": "Non-Smooth Integrability Theory. (arXiv:2203.04770v3 [econ.TH] UPDATED)",
    "abstract": "We study a method for calculating the utility function from a candidate of a demand function that is not differentiable, but is locally Lipschitz. Using this method, we obtain two new necessary and sufficient conditions for a candidate of a demand function to be a demand function. The first is conditions for the Slutsky matrix, and the second is the existence of a concave solution to a partial differential equation. Moreover, we show that the upper semi-continuous weak order that corresponds to the demand function is unique, and that this weak order is represented by our calculated utility function. We provide applications of these results to econometric theory. First, we show that, under several requirements, if a sequence of demand functions converges to some function with respect to the metric of compact convergence, then the limit is also a demand function. Second, the space of demand functions that have uniform Lipschitz constants on any compact set is compact under the above metr",
    "link": "http://arxiv.org/abs/2203.04770",
    "context": "Title: Non-Smooth Integrability Theory. (arXiv:2203.04770v3 [econ.TH] UPDATED)\nAbstract: We study a method for calculating the utility function from a candidate of a demand function that is not differentiable, but is locally Lipschitz. Using this method, we obtain two new necessary and sufficient conditions for a candidate of a demand function to be a demand function. The first is conditions for the Slutsky matrix, and the second is the existence of a concave solution to a partial differential equation. Moreover, we show that the upper semi-continuous weak order that corresponds to the demand function is unique, and that this weak order is represented by our calculated utility function. We provide applications of these results to econometric theory. First, we show that, under several requirements, if a sequence of demand functions converges to some function with respect to the metric of compact convergence, then the limit is also a demand function. Second, the space of demand functions that have uniform Lipschitz constants on any compact set is compact under the above metr",
    "path": "papers/22/03/2203.04770.json",
    "total_tokens": 912,
    "translated_title": "非光滑可积理论",
    "translated_abstract": "我们研究了一种从一个不可微但局部利普希茨的需求函数候选中计算效用函数的方法。利用这种方法，我们得到了一个需求函数候选为需求函数的两个新的必要和充分条件。第一个是关于斯拉茨基矩阵的条件，第二个是关于偏微分方程的凹解的存在性。此外，我们还展示了对应于需求函数的上半连续弱序是唯一的，并且这个弱序可以用我们计算出的效用函数表示。我们将这些结果应用于计量经济理论。首先，我们证明了在一些要求下，如果一个需求函数序列相对于紧致收敛度量收敛到某个函数，那么极限函数也是一个需求函数。其次，对于在任何紧致集上具有均匀利普希茨常数的需求函数空间在上述度量下是紧致的。",
    "tldr": "本文研究了一种计算非可微需求函数的效用函数的方法，并得到了两个新的充分和必要条件。此外，我们还展示了唯一性和弱序的表示。我们将这些结果应用于计量经济理论，并得到了关于需求函数收敛性和具有均匀利普希茨常数的结果。"
}