{
    "title": "Disentangling speech from surroundings with neural embeddings. (arXiv:2203.15578v2 [cs.SD] UPDATED)",
    "abstract": "We present a method to separate speech signals from noisy environments in the embedding space of a neural audio codec. We introduce a new training procedure that allows our model to produce structured encodings of audio waveforms given by embedding vectors, where one part of the embedding vector represents the speech signal, and the rest represent the environment. We achieve this by partitioning the embeddings of different input waveforms and training the model to faithfully reconstruct audio from mixed partitions, thereby ensuring each partition encodes a separate audio attribute. As use cases, we demonstrate the separation of speech from background noise or from reverberation characteristics. Our method also allows for targeted adjustments of the audio output characteristics.",
    "link": "http://arxiv.org/abs/2203.15578",
    "context": "Title: Disentangling speech from surroundings with neural embeddings. (arXiv:2203.15578v2 [cs.SD] UPDATED)\nAbstract: We present a method to separate speech signals from noisy environments in the embedding space of a neural audio codec. We introduce a new training procedure that allows our model to produce structured encodings of audio waveforms given by embedding vectors, where one part of the embedding vector represents the speech signal, and the rest represent the environment. We achieve this by partitioning the embeddings of different input waveforms and training the model to faithfully reconstruct audio from mixed partitions, thereby ensuring each partition encodes a separate audio attribute. As use cases, we demonstrate the separation of speech from background noise or from reverberation characteristics. Our method also allows for targeted adjustments of the audio output characteristics.",
    "path": "papers/22/03/2203.15578.json",
    "total_tokens": 789,
    "translated_title": "利用神经嵌入将语音与环境分离",
    "translated_abstract": "本文介绍了一种利用神经音频编解码器中的嵌入空间将语音信号与嘈杂环境分离的方法。我们引入了一个新的训练过程，使得我们的模型能够产生结构化的音频波形编码向量，其中一部分编码向量表示语音信号，其余部分表示环境。我们通过对不同输入波形的嵌入进行分区，并训练模型来从混合分区中忠实地重建音频，从而确保每个分区编码了一个单独的音频属性。作为使用案例，我们演示了从噪声或混响特性中分离语音的能力。我们的方法还允许有目的地调整音频输出特性。",
    "tldr": "本文提出了一种方法，利用神经音频编解码器中的嵌入空间将语音信号与嘈杂环境分离，并演示了该方法在从噪声或混响中分离语音中的应用。",
    "en_tdlr": "This paper presents a method for separating speech signals from noisy environments using neural audio codec's embedding space. The training process partitions embeddings of different input waveforms to allow faithful reconstruction of audio from mixed partitions, enabling separate encoding of each audio attribute. The method is demonstrated to successfully separate speech from noise or reverberation and allows for targeted adjustments of the audio output characteristics."
}