{
    "title": "Learning Hidden Markov Models When the Locations of Missing Observations are Unknown. (arXiv:2203.06527v3 [stat.ML] UPDATED)",
    "abstract": "The Hidden Markov Model (HMM) is one of the most widely used statistical models for sequential data analysis. One of the key reasons for this versatility is the ability of HMM to deal with missing data. However, standard HMM learning algorithms rely crucially on the assumption that the positions of the missing observations \\emph{within the observation sequence} are known. In the natural sciences, where this assumption is often violated, special variants of HMM, commonly known as Silent-state HMMs (SHMMs), are used. Despite their widespread use, these algorithms strongly rely on specific structural assumptions of the underlying chain, such as acyclicity, thus limiting the applicability of these methods. Moreover, even in the acyclic case, it has been shown that these methods can lead to poor reconstruction. In this paper we consider the general problem of learning an HMM from data with unknown missing observation locations. We provide reconstruction algorithms that do not require any as",
    "link": "http://arxiv.org/abs/2203.06527",
    "context": "Title: Learning Hidden Markov Models When the Locations of Missing Observations are Unknown. (arXiv:2203.06527v3 [stat.ML] UPDATED)\nAbstract: The Hidden Markov Model (HMM) is one of the most widely used statistical models for sequential data analysis. One of the key reasons for this versatility is the ability of HMM to deal with missing data. However, standard HMM learning algorithms rely crucially on the assumption that the positions of the missing observations \\emph{within the observation sequence} are known. In the natural sciences, where this assumption is often violated, special variants of HMM, commonly known as Silent-state HMMs (SHMMs), are used. Despite their widespread use, these algorithms strongly rely on specific structural assumptions of the underlying chain, such as acyclicity, thus limiting the applicability of these methods. Moreover, even in the acyclic case, it has been shown that these methods can lead to poor reconstruction. In this paper we consider the general problem of learning an HMM from data with unknown missing observation locations. We provide reconstruction algorithms that do not require any as",
    "path": "papers/22/03/2203.06527.json",
    "total_tokens": 864,
    "translated_title": "当缺失观测的位置未知时学习隐马尔可夫模型",
    "translated_abstract": "隐马尔可夫模型（HMM）是用于序列数据分析的最常用的统计模型之一。HMM具有处理缺失数据的能力，这也是它具有通用性的关键之一。然而，标准的HMM学习算法基于缺失观测在观测序列中的位置已知的假设。在自然科学中，这种假设常常不成立，因此通常使用特殊变体的HMM，称为Silent-state HMMs（SHMMs）。尽管这些算法被广泛使用，但它们严重依赖于潜在链的特定结构假设，比如非循环性，这限制了这些方法的适用性。而且，即使在非循环情况下，已经证明这些方法可能导致重建效果差。本文研究了从具有未知缺失观测位置数据中学习HMM的一般问题。我们提供了不需要任何先验信息的重建算法。",
    "tldr": "本文研究了当缺失观测的位置未知时学习隐马尔可夫模型的问题，并提供了不需要先验信息的重建算法。"
}