{
    "title": "Discrepancy Modeling Framework: Learning missing physics, modeling systematic residuals, and disambiguating between deterministic and random effects. (arXiv:2203.05164v2 [stat.ML] UPDATED)",
    "abstract": "Physics-based and first-principles models pervade the engineering and physical sciences, allowing for the ability to model the dynamics of complex systems with a prescribed accuracy. The approximations used in deriving governing equations often result in discrepancies between the model and sensor-based measurements of the system, revealing the approximate nature of the equations and/or the signal-to-noise ratio of the sensor itself. In modern dynamical systems, such discrepancies between model and measurement can lead to poor quantification, often undermining the ability to produce accurate and precise control algorithms. We introduce a discrepancy modeling framework to identify the missing physics and resolve the model-measurement mismatch with two distinct approaches: (i) by learning a model for the evolution of systematic state-space residual, and (ii) by discovering a model for the deterministic dynamical error. Regardless of approach, a common suite of data-driven model discovery ",
    "link": "http://arxiv.org/abs/2203.05164",
    "context": "Title: Discrepancy Modeling Framework: Learning missing physics, modeling systematic residuals, and disambiguating between deterministic and random effects. (arXiv:2203.05164v2 [stat.ML] UPDATED)\nAbstract: Physics-based and first-principles models pervade the engineering and physical sciences, allowing for the ability to model the dynamics of complex systems with a prescribed accuracy. The approximations used in deriving governing equations often result in discrepancies between the model and sensor-based measurements of the system, revealing the approximate nature of the equations and/or the signal-to-noise ratio of the sensor itself. In modern dynamical systems, such discrepancies between model and measurement can lead to poor quantification, often undermining the ability to produce accurate and precise control algorithms. We introduce a discrepancy modeling framework to identify the missing physics and resolve the model-measurement mismatch with two distinct approaches: (i) by learning a model for the evolution of systematic state-space residual, and (ii) by discovering a model for the deterministic dynamical error. Regardless of approach, a common suite of data-driven model discovery ",
    "path": "papers/22/03/2203.05164.json",
    "total_tokens": 899,
    "translated_title": "缺失物理建模框架：学习缺失的物理、建模系统残差和区分确定性和随机效应",
    "translated_abstract": "基于物理和第一原理的模型在工程和物理科学中得到广泛应用，可以以指定的精度对复杂系统的动态进行建模。在推导控制方程时使用的近似方法通常会导致模型与基于传感器的系统测量结果之间存在差异，揭示了方程的近似性质和/或传感器本身的信噪比。在现代动力系统中，模型与测量之间的这种差异可能导致无法准确量化，常常削弱了产生精确和准确控制算法的能力。我们引入了一个缺失物理建模框架，通过两种不同的方法来识别缺失的物理并解决模型与测量不匹配的问题：（i）通过学习系统状态空间残差演化的模型，以及（ii）通过发现确定性动力误差的模型。无论采用哪种方法，都使用了一套常见的数据驱动模型发现技术。",
    "tldr": "这篇论文介绍了一个缺失物理建模框架，通过学习系统残差演化的模型和发现确定性动力误差的模型，来解决模型与测量不匹配的问题。",
    "en_tdlr": "This paper introduces a discrepancy modeling framework to address the model-measurement mismatch by learning a model for the evolution of systematic state-space residual and discovering a model for the deterministic dynamical error."
}