{
    "title": "CMGAN: Conformer-based Metric GAN for Speech Enhancement",
    "abstract": "arXiv:2203.15149v4 Announce Type: replace-cross  Abstract: Recently, convolution-augmented transformer (Conformer) has achieved promising performance in automatic speech recognition (ASR) and time-domain speech enhancement (SE), as it can capture both local and global dependencies in the speech signal. In this paper, we propose a conformer-based metric generative adversarial network (CMGAN) for SE in the time-frequency (TF) domain. In the generator, we utilize two-stage conformer blocks to aggregate all magnitude and complex spectrogram information by modeling both time and frequency dependencies. The estimation of magnitude and complex spectrogram is decoupled in the decoder stage and then jointly incorporated to reconstruct the enhanced speech. In addition, a metric discriminator is employed to further improve the quality of the enhanced estimated speech by optimizing the generator with respect to a corresponding evaluation score. Quantitative analysis on Voice Bank+DEMAND dataset in",
    "link": "https://arxiv.org/abs/2203.15149",
    "context": "Title: CMGAN: Conformer-based Metric GAN for Speech Enhancement\nAbstract: arXiv:2203.15149v4 Announce Type: replace-cross  Abstract: Recently, convolution-augmented transformer (Conformer) has achieved promising performance in automatic speech recognition (ASR) and time-domain speech enhancement (SE), as it can capture both local and global dependencies in the speech signal. In this paper, we propose a conformer-based metric generative adversarial network (CMGAN) for SE in the time-frequency (TF) domain. In the generator, we utilize two-stage conformer blocks to aggregate all magnitude and complex spectrogram information by modeling both time and frequency dependencies. The estimation of magnitude and complex spectrogram is decoupled in the decoder stage and then jointly incorporated to reconstruct the enhanced speech. In addition, a metric discriminator is employed to further improve the quality of the enhanced estimated speech by optimizing the generator with respect to a corresponding evaluation score. Quantitative analysis on Voice Bank+DEMAND dataset in",
    "path": "papers/22/03/2203.15149.json",
    "total_tokens": 853,
    "translated_title": "CMGAN：基于Conformer的度量GAN用于语音增强",
    "translated_abstract": "最近，卷积增强变压器（Conformer）在自动语音识别（ASR）和时域语音增强（SE）中取得了很好的表现，因为它可以捕捉语音信号中的局部和全局依赖关系。本文提出了一种基于Conformer的度量生成对抗网络（CMGAN）用于时频域的SE。在生成器中，我们利用两阶段的Conformer块通过对时间和频率依赖关系进行建模，聚合所有幅度和复数谱信息。在解码器阶段，幅度和复数谱的估计被解耦，然后一起合并以重构增强的语音。此外，引入了一个度量鉴别器，通过优化生成器以使得增强估计语音相对应的评估分数，进一步提高增强语音的质量。在Voice Bank+DEMAND数据集上进行了定量分析。",
    "tldr": "本文提出了一种基于Conformer的度量生成对抗网络（CMGAN）用于时频域的语音增强，通过优化生成器以使得增强估计语音相对应的评估分数来进一步提高增强语音的质量。",
    "en_tdlr": "This paper proposes a conformer-based metric generative adversarial network (CMGAN) for speech enhancement in the time-frequency domain, aiming to further improve the quality of the enhanced speech by optimizing the generator with respect to a corresponding evaluation score."
}