{
    "title": "On-the-Fly Feature Based Rapid Speaker Adaptation for Dysarthric and Elderly Speech Recognition. (arXiv:2203.14593v3 [eess.AS] UPDATED)",
    "abstract": "Accurate recognition of dysarthric and elderly speech remain challenging tasks to date. Speaker-level heterogeneity attributed to accent or gender, when aggregated with age and speech impairment, create large diversity among these speakers. Scarcity of speaker-level data limits the practical use of data-intensive model based speaker adaptation methods. To this end, this paper proposes two novel forms of data-efficient, feature-based on-the-fly speaker adaptation methods: variance-regularized spectral basis embedding (SVR) and spectral feature driven f-LHUC transforms. Experiments conducted on UASpeech dysarthric and DementiaBank Pitt elderly speech corpora suggest the proposed on-the-fly speaker adaptation approaches consistently outperform baseline iVector adapted hybrid DNN/TDNN and E2E Conformer systems by statistically significant WER reduction of 2.48%-2.85% absolute (7.92%-8.06% relative), and offline model based LHUC adaptation by 1.82% absolute (5.63% relative) respectively.",
    "link": "http://arxiv.org/abs/2203.14593",
    "context": "Title: On-the-Fly Feature Based Rapid Speaker Adaptation for Dysarthric and Elderly Speech Recognition. (arXiv:2203.14593v3 [eess.AS] UPDATED)\nAbstract: Accurate recognition of dysarthric and elderly speech remain challenging tasks to date. Speaker-level heterogeneity attributed to accent or gender, when aggregated with age and speech impairment, create large diversity among these speakers. Scarcity of speaker-level data limits the practical use of data-intensive model based speaker adaptation methods. To this end, this paper proposes two novel forms of data-efficient, feature-based on-the-fly speaker adaptation methods: variance-regularized spectral basis embedding (SVR) and spectral feature driven f-LHUC transforms. Experiments conducted on UASpeech dysarthric and DementiaBank Pitt elderly speech corpora suggest the proposed on-the-fly speaker adaptation approaches consistently outperform baseline iVector adapted hybrid DNN/TDNN and E2E Conformer systems by statistically significant WER reduction of 2.48%-2.85% absolute (7.92%-8.06% relative), and offline model based LHUC adaptation by 1.82% absolute (5.63% relative) respectively.",
    "path": "papers/22/03/2203.14593.json",
    "total_tokens": 949,
    "translated_title": "动态特征快速说话者适应在言语障碍和老年人语音识别中的应用",
    "translated_abstract": "目前，准确识别言语障碍和老年人的语音仍然是一个具有挑战性的任务。由口音或性别引起的说话者级别的异质性，与年龄和言语障碍相结合，使这些说话者之间的差异很大。说话者级别数据的稀缺限制了基于数据密集型模型的说话者适应方法的实际应用。因此，本文提出了两种新形式的数据有效、基于特征的动态说话者适应方法：方差正则化频谱基准嵌入（SVR）和谱特征驱动的f-LHUC转换。在UASpeech言语障碍和DementiaBank Pitt老年人语音语料库上进行的实验证明，所提出的动态说话者适应方法能够持续地优于基线iVector自适应混合DNN/TDNN和E2E Conformer系统，统计显著地减少WER 2.48%-2.85%（绝对值）（7.92%-8.06%相关），与离线模型基础LHUC适应分别减小1.82%（相对值）。",
    "tldr": "本文提出了两种新形式的数据有效、基于特征的动态说话者适应方法，能够显著提高言语障碍和老年人语音识别的准确率。",
    "en_tdlr": "This paper proposes two novel forms of data-efficient, feature-based on-the-fly speaker adaptation methods that significantly improve the accuracy of speech recognition for dysarthric and elderly speech."
}