{
    "title": "Test-time Adaptation with Slot-Centric Models. (arXiv:2203.11194v3 [cs.CV] UPDATED)",
    "abstract": "Current visual detectors, though impressive within their training distribution, often fail to parse out-of-distribution scenes into their constituent entities. Recent test-time adaptation methods use auxiliary self-supervised losses to adapt the network parameters to each test example independently and have shown promising results towards generalization outside the training distribution for the task of image classification. In our work, we find evidence that these losses are insufficient for the task of scene decomposition, without also considering architectural inductive biases. Recent slot-centric generative models attempt to decompose scenes into entities in a self-supervised manner by reconstructing pixels. Drawing upon these two lines of work, we propose Slot-TTA, a semi-supervised slot-centric scene decomposition model that at test time is adapted per scene through gradient descent on reconstruction or cross-view synthesis objectives. We evaluate Slot-TTA across multiple input mo",
    "link": "http://arxiv.org/abs/2203.11194",
    "context": "Title: Test-time Adaptation with Slot-Centric Models. (arXiv:2203.11194v3 [cs.CV] UPDATED)\nAbstract: Current visual detectors, though impressive within their training distribution, often fail to parse out-of-distribution scenes into their constituent entities. Recent test-time adaptation methods use auxiliary self-supervised losses to adapt the network parameters to each test example independently and have shown promising results towards generalization outside the training distribution for the task of image classification. In our work, we find evidence that these losses are insufficient for the task of scene decomposition, without also considering architectural inductive biases. Recent slot-centric generative models attempt to decompose scenes into entities in a self-supervised manner by reconstructing pixels. Drawing upon these two lines of work, we propose Slot-TTA, a semi-supervised slot-centric scene decomposition model that at test time is adapted per scene through gradient descent on reconstruction or cross-view synthesis objectives. We evaluate Slot-TTA across multiple input mo",
    "path": "papers/22/03/2203.11194.json",
    "total_tokens": 867,
    "translated_title": "以插槽为中心的模型在测试时的适应性",
    "translated_abstract": "当前的视觉检测器在训练分布内表现出色，但通常无法将分布外的场景解析为其组成实体。最近的测试时适应方法使用辅助的自监督损失来独立地调整网络参数，已经在图像分类任务中显示出在训练分布之外的泛化结果。在我们的研究中，我们发现这些损失对于场景分解任务来说是不足的，因为它们没有考虑到建模偏差。最近的以插槽为中心的生成模型尝试以自监督的方式将场景分解为实体，通过重建像素来实现。结合这两个工作线路，我们提出了一种半监督的插槽为中心的场景分解模型，即Slot-TTA，在测试时通过重建或交叉视图综合目标在每个场景上进行梯度下降适应。我们对Slot-TTA在多种输入模式上进行评估。",
    "tldr": "本论文提出了一种以插槽为中心的模型，用于解析分布外的场景，并通过测试时自适应来提高模型性能。通过结合自监督损失和建模偏差，该模型在场景分解任务上取得了良好的效果。",
    "en_tdlr": "This paper proposes a slot-centric model for parsing out-of-distribution scenes and improves model performance through test-time adaptation. By combining self-supervised losses and architectural biases, the model achieves good results in scene decomposition tasks."
}