{
    "title": "Intention Aware Robot Crowd Navigation with Attention-Based Interaction Graph. (arXiv:2203.01821v4 [cs.RO] UPDATED)",
    "abstract": "We study the problem of safe and intention-aware robot navigation in dense and interactive crowds. Most previous reinforcement learning (RL) based methods fail to consider different types of interactions among all agents or ignore the intentions of people, which results in performance degradation. To learn a safe and efficient robot policy, we propose a novel recurrent graph neural network with attention mechanisms to capture heterogeneous interactions among agents through space and time. To encourage longsighted robot behaviors, we infer the intentions of dynamic agents by predicting their future trajectories for several timesteps. The predictions are incorporated into a model-free RL framework to prevent the robot from intruding into the intended paths of other agents. We demonstrate that our method enables the robot to achieve good navigation performance and non-invasiveness in challenging crowd navigation scenarios. We successfully transfer the policy learned in simulation to a rea",
    "link": "http://arxiv.org/abs/2203.01821",
    "context": "Title: Intention Aware Robot Crowd Navigation with Attention-Based Interaction Graph. (arXiv:2203.01821v4 [cs.RO] UPDATED)\nAbstract: We study the problem of safe and intention-aware robot navigation in dense and interactive crowds. Most previous reinforcement learning (RL) based methods fail to consider different types of interactions among all agents or ignore the intentions of people, which results in performance degradation. To learn a safe and efficient robot policy, we propose a novel recurrent graph neural network with attention mechanisms to capture heterogeneous interactions among agents through space and time. To encourage longsighted robot behaviors, we infer the intentions of dynamic agents by predicting their future trajectories for several timesteps. The predictions are incorporated into a model-free RL framework to prevent the robot from intruding into the intended paths of other agents. We demonstrate that our method enables the robot to achieve good navigation performance and non-invasiveness in challenging crowd navigation scenarios. We successfully transfer the policy learned in simulation to a rea",
    "path": "papers/22/03/2203.01821.json",
    "total_tokens": 893,
    "translated_title": "注意力交互图中的意图感知机器人群体导航",
    "translated_abstract": "本研究探讨如何在密集且互动的人群中进行安全和意图感知的机器人导航。与大多数基于强化学习（RL）的方法不同，我们提出了一种新颖的循环图神经网络，利用注意力机制捕捉代理之间的异质性交互，以便在空间和时间上确定最优策略。我们根据未来多个时间步长的轨迹预测来推断动态代理的意图，并将这些预测结果纳入一个无模型RL框架中，以避免机器人侵入他人的预期路径。我们证明了我们的方法使机器人在具有挑战性的人群导航场景下能够以高效、安全和不干扰的方式完成任务。我们成功地将在仿真中学习的策略转移到了真实机器人环境中，并验证了该方法的鲁棒性。",
    "tldr": "提出了一种基于循环图神经网络与注意力机制的机器人导航方法，可以在复杂的人群场景中实现安全、高效和不干扰的导航，通过预测未来轨迹推断出动态代理的意图，避免侵入他人预期路径。",
    "en_tdlr": "This paper proposes a novel robot navigation method based on recurrent graph neural network and attention mechanisms, which achieves safe, efficient, and non-invasive navigation in complex crowd scenarios by predicting the future trajectories of dynamic agents to infer their intentions and avoid intruding into their intended paths."
}