{
    "title": "A Reproducing Kernel Hilbert Space approach to singular local stochastic volatility McKean-Vlasov models. (arXiv:2203.01160v2 [q-fin.CP] UPDATED)",
    "abstract": "Motivated by the challenges related to the calibration of financial models, we consider the problem of numerically solving a singular McKean-Vlasov equation $$ d X_t= \\sigma(t,X_t) X_t \\frac{\\sqrt v_t}{\\sqrt {E[v_t|X_t]}}dW_t, $$ where $W$ is a Brownian motion and $v$ is an adapted diffusion process. This equation can be considered as a singular local stochastic volatility model. Whilst such models are quite popular among practitioners, unfortunately, its well-posedness has not been fully understood yet and, in general, is possibly not guaranteed at all. We develop a novel regularization approach based on the reproducing kernel Hilbert space (RKHS) technique and show that the regularized model is well-posed. Furthermore, we prove propagation of chaos. We demonstrate numerically that a thus regularized model is able to perfectly replicate option prices due to typical local volatility models. Our results are also applicable to more general McKean--Vlasov equations.",
    "link": "http://arxiv.org/abs/2203.01160",
    "context": "Title: A Reproducing Kernel Hilbert Space approach to singular local stochastic volatility McKean-Vlasov models. (arXiv:2203.01160v2 [q-fin.CP] UPDATED)\nAbstract: Motivated by the challenges related to the calibration of financial models, we consider the problem of numerically solving a singular McKean-Vlasov equation $$ d X_t= \\sigma(t,X_t) X_t \\frac{\\sqrt v_t}{\\sqrt {E[v_t|X_t]}}dW_t, $$ where $W$ is a Brownian motion and $v$ is an adapted diffusion process. This equation can be considered as a singular local stochastic volatility model. Whilst such models are quite popular among practitioners, unfortunately, its well-posedness has not been fully understood yet and, in general, is possibly not guaranteed at all. We develop a novel regularization approach based on the reproducing kernel Hilbert space (RKHS) technique and show that the regularized model is well-posed. Furthermore, we prove propagation of chaos. We demonstrate numerically that a thus regularized model is able to perfectly replicate option prices due to typical local volatility models. Our results are also applicable to more general McKean--Vlasov equations.",
    "path": "papers/22/03/2203.01160.json",
    "total_tokens": 1014,
    "translated_title": "基于再生核希尔伯特空间的奇异局部随机波动率McKean-Vlasov模型的研究",
    "translated_abstract": "在金融模型校准的挑战下，我们考虑了数值求解奇异McKean-Vlasov方程的问题，其中方程形式为 $$ d X_t= \\sigma(t,X_t) X_t \\frac{\\sqrt v_t}{\\sqrt {E[v_t|X_t]}}dW_t, $$ 其中$W$是布朗运动，$v$是改进扩散过程。该方程可被看作奇异局部随机波动率模型。尽管这样的模型在实践中很受欢迎，但是很遗憾，其良态性还没有完全理解，一般情况下也可能无法保证。我们基于再生核希尔伯特空间(RKHS)技术开发了一种新的正则化方法，并证明了正则化模型的良态性。此外，我们还证明了混沌传播。我们通过数值实验证明，这个经过正则化的模型能够完美地复制典型的局部波动率模型的期权价格。我们的结果也适用于更一般的McKean-Vlasov方程。",
    "tldr": "本文研究了基于再生核希尔伯特空间的奇异局部随机波动率McKean-Vlasov模型。通过开发一种新的正则化方法，我们证明了正则化后的模型的良态性，并且通过数值实验展示了模型能够复制典型的局部波动率模型的期权价格。"
}