{
    "title": "Robust Multi-Task Learning and Online Refinement for Spacecraft Pose Estimation across Domain Gap. (arXiv:2203.04275v5 [cs.CV] UPDATED)",
    "abstract": "This work presents Spacecraft Pose Network v2 (SPNv2), a Convolutional Neural Network (CNN) for pose estimation of noncooperative spacecraft across domain gap. SPNv2 is a multi-scale, multi-task CNN which consists of a shared multi-scale feature encoder and multiple prediction heads that perform different tasks on a shared feature output. These tasks are all related to detection and pose estimation of a target spacecraft from an image, such as prediction of pre-defined satellite keypoints, direct pose regression, and binary segmentation of the satellite foreground. It is shown that by jointly training on different yet related tasks with extensive data augmentations on synthetic images only, the shared encoder learns features that are common across image domains that have fundamentally different visual characteristics compared to synthetic images. This work also introduces Online Domain Refinement (ODR) which refines the parameters of the normalization layers of SPNv2 on the target doma",
    "link": "http://arxiv.org/abs/2203.04275",
    "context": "Title: Robust Multi-Task Learning and Online Refinement for Spacecraft Pose Estimation across Domain Gap. (arXiv:2203.04275v5 [cs.CV] UPDATED)\nAbstract: This work presents Spacecraft Pose Network v2 (SPNv2), a Convolutional Neural Network (CNN) for pose estimation of noncooperative spacecraft across domain gap. SPNv2 is a multi-scale, multi-task CNN which consists of a shared multi-scale feature encoder and multiple prediction heads that perform different tasks on a shared feature output. These tasks are all related to detection and pose estimation of a target spacecraft from an image, such as prediction of pre-defined satellite keypoints, direct pose regression, and binary segmentation of the satellite foreground. It is shown that by jointly training on different yet related tasks with extensive data augmentations on synthetic images only, the shared encoder learns features that are common across image domains that have fundamentally different visual characteristics compared to synthetic images. This work also introduces Online Domain Refinement (ODR) which refines the parameters of the normalization layers of SPNv2 on the target doma",
    "path": "papers/22/03/2203.04275.json",
    "total_tokens": 949,
    "translated_title": "面向领域差异的航天器姿态估计的鲁棒性多任务学习和在线优化",
    "translated_abstract": "本文介绍了一种名为Spacecraft Pose Network v2（SPNv2）的卷积神经网络（CNN），用于跨领域差异的非合作航天器姿态估计。SPNv2是一个多尺度、多任务的CNN，由共享的多尺度特征编码器和多个预测头组成，这些预测头在共享特征输出上执行不同的任务。这些任务都与从图像中检测和估计目标航天器的姿态有关，例如预测预定义的卫星关键点、直接姿态回归和卫星前景的二元分割等。通过在合成图像上进行广泛的数据增强来共同训练不同但相关的任务，证明了共享编码器学习到的特征对具有基本不同视觉特性的图像域是通用的。本文还介绍了一种名为Online Domain Refinement（ODR）的方法，该方法在目标域上调整SPNv2的标准化层参数。",
    "tldr": "本文介绍了一种跨领域差异的非合作航天器姿态估计的多尺度、多任务CNN，通过在合成图像上进行数据增强训练共享编码器以学习通用特征。同时介绍了一种在线域优化方法，用于调整模型的标准化层参数。",
    "en_tdlr": "This paper presents a multi-scale, multi-task CNN for pose estimation of noncooperative spacecraft across domain gap, by training the shared encoder with data augmentations on synthetic images. It also introduces an online domain refinement method to adjust the normalization layer parameters of the model."
}