{
    "title": "Identifying Causal Effects using Instrumental Time Series: Nuisance IV and Correcting for the Past",
    "abstract": "arXiv:2203.06056v2 Announce Type: replace-cross  Abstract: Instrumental variable (IV) regression relies on instruments to infer causal effects from observational data with unobserved confounding. We consider IV regression in time series models, such as vector auto-regressive (VAR) processes. Direct applications of i.i.d. techniques are generally inconsistent as they do not correctly adjust for dependencies in the past. In this paper, we outline the difficulties that arise due to time structure and propose methodology for constructing identifying equations that can be used for consistent parametric estimation of causal effects in time series data. One method uses extra nuisance covariates to obtain identifiability (an idea that can be of interest even in the i.i.d. case). We further propose a graph marginalization framework that allows us to apply nuisance IV and other IV methods in a principled way to time series. Our methods make use of a version of the global Markov property, which w",
    "link": "https://arxiv.org/abs/2203.06056",
    "context": "Title: Identifying Causal Effects using Instrumental Time Series: Nuisance IV and Correcting for the Past\nAbstract: arXiv:2203.06056v2 Announce Type: replace-cross  Abstract: Instrumental variable (IV) regression relies on instruments to infer causal effects from observational data with unobserved confounding. We consider IV regression in time series models, such as vector auto-regressive (VAR) processes. Direct applications of i.i.d. techniques are generally inconsistent as they do not correctly adjust for dependencies in the past. In this paper, we outline the difficulties that arise due to time structure and propose methodology for constructing identifying equations that can be used for consistent parametric estimation of causal effects in time series data. One method uses extra nuisance covariates to obtain identifiability (an idea that can be of interest even in the i.i.d. case). We further propose a graph marginalization framework that allows us to apply nuisance IV and other IV methods in a principled way to time series. Our methods make use of a version of the global Markov property, which w",
    "path": "papers/22/03/2203.06056.json",
    "total_tokens": 863,
    "translated_title": "使用工具时间序列识别因果效应：无关 IV 和纠正历史",
    "translated_abstract": "仪器变量（IV）回归依赖于工具来推断观测数据中的因果效应，其中存在未观测的混淆因素。我们考虑在时间序列模型中进行 IV 回归，例如矢量自回归（VAR）过程。直接应用独立同分布技术通常不一致，因为它们不能正确调整过去的依赖关系。本文概述了由于时间结构而引起的困难，并提出了用于构建可用于时间序列数据中因果效应一致参数估计的确认方程的方法。一种方法使用额外的无关协变量来获得可识别性（即使在独立同分布情况下也是有趣的想法）。我们进一步提出了一个图边缘化框架，允许我们以原则性的方式对时间序列应用无关 IV 和其他 IV 方法。我们的方法利用了全局马尔可夫性质的一个版本。",
    "tldr": "本文考虑了在时间序列模型中进行 IV 回归的困难，提出了一种用于构建识别方程的方法，以实现对时间序列数据中因果效应的一致性参数估计。"
}