{
    "title": "Neural Message Passing for Objective-Based Uncertainty Quantification and Optimal Experimental Design. (arXiv:2203.07120v3 [cs.LG] UPDATED)",
    "abstract": "Various real-world scientific applications involve the mathematical modeling of complex uncertain systems with numerous unknown parameters. Accurate parameter estimation is often practically infeasible in such systems, as the available training data may be insufficient and the cost of acquiring additional data may be high. In such cases, based on a Bayesian paradigm, we can design robust operators retaining the best overall performance across all possible models and design optimal experiments that can effectively reduce uncertainty to enhance the performance of such operators maximally. While objective-based uncertainty quantification (objective-UQ) based on MOCU (mean objective cost of uncertainty) provides an effective means for quantifying uncertainty in complex systems, the high computational cost of estimating MOCU has been a challenge in applying it to real-world scientific/engineering problems. In this work, we propose a novel scheme to reduce the computational cost for objectiv",
    "link": "http://arxiv.org/abs/2203.07120",
    "context": "Title: Neural Message Passing for Objective-Based Uncertainty Quantification and Optimal Experimental Design. (arXiv:2203.07120v3 [cs.LG] UPDATED)\nAbstract: Various real-world scientific applications involve the mathematical modeling of complex uncertain systems with numerous unknown parameters. Accurate parameter estimation is often practically infeasible in such systems, as the available training data may be insufficient and the cost of acquiring additional data may be high. In such cases, based on a Bayesian paradigm, we can design robust operators retaining the best overall performance across all possible models and design optimal experiments that can effectively reduce uncertainty to enhance the performance of such operators maximally. While objective-based uncertainty quantification (objective-UQ) based on MOCU (mean objective cost of uncertainty) provides an effective means for quantifying uncertainty in complex systems, the high computational cost of estimating MOCU has been a challenge in applying it to real-world scientific/engineering problems. In this work, we propose a novel scheme to reduce the computational cost for objectiv",
    "path": "papers/22/03/2203.07120.json",
    "total_tokens": 680,
    "translated_title": "神经消息传递用于客观目标的不确定性量化和最优实验设计",
    "translated_abstract": "许多实际科学应用涉及对具有许多未知参数的复杂不确定系统进行数学建模。在这些系统中，准确的参数估计通常是不切实际的，因为可用的训练数据可能是不充分的，获取更多数据的成本可能很高。在这种情况下，我们可以基于贝叶斯模型设计强大的操作符，并设计最优实验来有效地减少不确定性，从而最大程度地提高这些操作符的性能表现。",
    "tldr": "本论文提出了一种降低计算成本实现客观目标不确定性量化和最优实验设计的新方案。"
}