{
    "title": "SMARAGD: Learning SMatch for Accurate and Rapid Approximate Graph Distance. (arXiv:2203.13226v2 [cs.CL] UPDATED)",
    "abstract": "The similarity of graph structures, such as Meaning Representations (MRs), is often assessed via structural matching algorithms, such as Smatch (Cai and Knight, 2013). However, Smatch involves a combinatorial problem that suffers from NP-completeness, making large-scale applications, e.g., graph clustering or search, infeasible. To alleviate this issue, we learn SMARAGD: Semantic Match for Accurate and Rapid Approximate Graph Distance. We show the potential of neural networks to approximate Smatch scores, i) in linear time using a machine translation framework to predict alignments, or ii) in constant time using a Siamese CNN to directly predict Smatch scores. We show that the approximation error can be substantially reduced through data augmentation and graph anonymization.",
    "link": "http://arxiv.org/abs/2203.13226",
    "context": "Title: SMARAGD: Learning SMatch for Accurate and Rapid Approximate Graph Distance. (arXiv:2203.13226v2 [cs.CL] UPDATED)\nAbstract: The similarity of graph structures, such as Meaning Representations (MRs), is often assessed via structural matching algorithms, such as Smatch (Cai and Knight, 2013). However, Smatch involves a combinatorial problem that suffers from NP-completeness, making large-scale applications, e.g., graph clustering or search, infeasible. To alleviate this issue, we learn SMARAGD: Semantic Match for Accurate and Rapid Approximate Graph Distance. We show the potential of neural networks to approximate Smatch scores, i) in linear time using a machine translation framework to predict alignments, or ii) in constant time using a Siamese CNN to directly predict Smatch scores. We show that the approximation error can be substantially reduced through data augmentation and graph anonymization.",
    "path": "papers/22/03/2203.13226.json",
    "total_tokens": 716,
    "translated_title": "SMARAGD: 学习SMATCH以获得准确快速的近似图距离",
    "translated_abstract": "常用结构匹配算法（如Smatch）来评估图像结构（如含义表示），但这些算法面临着NP完备问题，使得大规模应用不可行。为了解决这个问题，我们学习了SMARAGD，即用于准确快速近似图距离的语义匹配。我们表明，通过数据增强和图像匿名化可以大幅减少近似误差。",
    "tldr": "本文提出了SMARAGD算法，用于进行准确快速的近似图距离，并使用神经网络以线性时间或恒定时间近似Smatch分数，通过数据增强和图像匿名化，大幅减少了近似误差。",
    "en_tdlr": "This paper proposes the SMARAGD algorithm for accurate and rapid approximate graph distance, and uses neural networks to approximate Smatch scores in linear or constant time. Data augmentation and graph anonymization are employed to substantially reduce approximation error."
}