{
    "title": "Learning Resilient Radio Resource Management Policies with Graph Neural Networks. (arXiv:2203.11012v2 [eess.SP] UPDATED)",
    "abstract": "We consider the problems of user selection and power control in wireless interference networks, comprising multiple access points (APs) communicating with a group of user equipment devices (UEs) over a shared wireless medium. To achieve a high aggregate rate, while ensuring fairness across all users, we formulate a resilient radio resource management (RRM) policy optimization problem with per-user minimum-capacity constraints that adapt to the underlying network conditions via learnable slack variables. We reformulate the problem in the Lagrangian dual domain, and show that we can parameterize the RRM policies using a finite set of parameters, which can be trained alongside the slack and dual variables via an unsupervised primal-dual approach thanks to a provably small duality gap. We use a scalable and permutation-equivariant graph neural network (GNN) architecture to parameterize the RRM policies based on a graph topology derived from the instantaneous channel conditions. Through exp",
    "link": "http://arxiv.org/abs/2203.11012",
    "context": "Title: Learning Resilient Radio Resource Management Policies with Graph Neural Networks. (arXiv:2203.11012v2 [eess.SP] UPDATED)\nAbstract: We consider the problems of user selection and power control in wireless interference networks, comprising multiple access points (APs) communicating with a group of user equipment devices (UEs) over a shared wireless medium. To achieve a high aggregate rate, while ensuring fairness across all users, we formulate a resilient radio resource management (RRM) policy optimization problem with per-user minimum-capacity constraints that adapt to the underlying network conditions via learnable slack variables. We reformulate the problem in the Lagrangian dual domain, and show that we can parameterize the RRM policies using a finite set of parameters, which can be trained alongside the slack and dual variables via an unsupervised primal-dual approach thanks to a provably small duality gap. We use a scalable and permutation-equivariant graph neural network (GNN) architecture to parameterize the RRM policies based on a graph topology derived from the instantaneous channel conditions. Through exp",
    "path": "papers/22/03/2203.11012.json",
    "total_tokens": 906,
    "translated_title": "使用图神经网络学习具有弹性的无线电资源管理策略",
    "translated_abstract": "本文考虑在包含多个接入点和一组用户设备的无线干扰网络中，实现用户选择和功率控制，以实现高聚合速率并确保所有用户的公平性。我们通过可学习的松弛变量，将弹性无线电资源管理（RRM）策略优化问题与适应底层网络条件的每个用户最低容量约束相结合。我们在Lagrangian双重域中重新定义问题，并展示了我们可以使用有限的参数集来参数化RRM策略，通过一个经过证实的小偏差的无监督原始-双重方法进行训练。我们使用可扩展的置换等变图神经网络（GNN）架构来基于瞬时信道条件推导出的图形拓扑参数化RRM策略。",
    "tldr": "本文提出了一个使用图神经网络学习的具有弹性的无线电资源管理策略，以实现高聚合速率并确保所有用户的公平性，并使用可扩展的置换等变图神经网络（GNN）架构基于瞬时信道条件推导出的图形拓扑来参数化RRM策略"
}