{
    "title": "ADATIME: A Benchmarking Suite for Domain Adaptation on Time Series Data. (arXiv:2203.08321v2 [cs.LG] UPDATED)",
    "abstract": "Unsupervised domain adaptation methods aim to generalize well on unlabeled test data that may have a different (shifted) distribution from the training data. Such methods are typically developed on image data, and their application to time series data is less explored. Existing works on time series domain adaptation suffer from inconsistencies in evaluation schemes, datasets, and backbone neural network architectures. Moreover, labeled target data are often used for model selection, which violates the fundamental assumption of unsupervised domain adaptation. To address these issues, we develop a benchmarking evaluation suite (AdaTime) to systematically and fairly evaluate different domain adaptation methods on time series data. Specifically, we standardize the backbone neural network architectures and benchmarking datasets, while also exploring more realistic model selection approaches that can work with no labeled data or just a few labeled samples. Our evaluation includes adapting st",
    "link": "http://arxiv.org/abs/2203.08321",
    "context": "Title: ADATIME: A Benchmarking Suite for Domain Adaptation on Time Series Data. (arXiv:2203.08321v2 [cs.LG] UPDATED)\nAbstract: Unsupervised domain adaptation methods aim to generalize well on unlabeled test data that may have a different (shifted) distribution from the training data. Such methods are typically developed on image data, and their application to time series data is less explored. Existing works on time series domain adaptation suffer from inconsistencies in evaluation schemes, datasets, and backbone neural network architectures. Moreover, labeled target data are often used for model selection, which violates the fundamental assumption of unsupervised domain adaptation. To address these issues, we develop a benchmarking evaluation suite (AdaTime) to systematically and fairly evaluate different domain adaptation methods on time series data. Specifically, we standardize the backbone neural network architectures and benchmarking datasets, while also exploring more realistic model selection approaches that can work with no labeled data or just a few labeled samples. Our evaluation includes adapting st",
    "path": "papers/22/03/2203.08321.json",
    "total_tokens": 900,
    "translated_title": "ADATIME：针对时间序列数据的领域自适应基准测试套件",
    "translated_abstract": "无监督的领域自适应方法旨在针对可能与训练数据不同（转移）的未标记测试数据具有良好的泛化能力。这样的方法通常是在图像数据上开发的，它们在时间序列数据上的应用还不够深入。现有的时间序列领域自适应工作存在评估方案、数据集和骨干神经网络架构不一致的问题。此外，标记的目标数据经常用于模型选择，这违反了无监督领域自适应的基本假设。为解决这些问题，我们开发了一个评估套件（AdaTime）来系统地和公正地评估不同的时间序列领域自适应方法。具体而言，我们标准化了骨干神经网络架构和基准测试数据集，同时探索更现实的模型选择方法，可以在没有标记数据或仅有少量标记样本的情况下工作。我们的评估包括对不同领域自适应方法进行的适应性测试。",
    "tldr": "ADATIME是一个用于时间序列领域自适应的评估套件，其所提供的标准化骨干神经网络架构和数据集、现实的模型选择方法可以无监督地进行领域自适应。"
}