{
    "title": "E-detectors: a nonparametric framework for sequential change detection. (arXiv:2203.03532v2 [stat.ME] UPDATED)",
    "abstract": "Sequential change detection is a classical problem with a variety of applications. However, the majority of prior work has been parametric, for example, focusing on exponential families. We develop a fundamentally new and general framework for sequential change detection when the pre- and post-change distributions are nonparametrically specified (and thus composite). Our procedures come with clean, nonasymptotic bounds on the average run length (frequency of false alarms). In certain nonparametric cases (like sub-Gaussian or sub-exponential), we also provide near-optimal bounds on the detection delay following a changepoint. The primary technical tool that we introduce is called an \\emph{e-detector}, which is composed of sums of e-processes -- a fundamental generalization of nonnegative supermartingales -- that are started at consecutive times. We first introduce simple Shiryaev-Roberts and CUSUM-style e-detectors, and then show how to design their mixtures in order to achieve both sta",
    "link": "http://arxiv.org/abs/2203.03532",
    "context": "Title: E-detectors: a nonparametric framework for sequential change detection. (arXiv:2203.03532v2 [stat.ME] UPDATED)\nAbstract: Sequential change detection is a classical problem with a variety of applications. However, the majority of prior work has been parametric, for example, focusing on exponential families. We develop a fundamentally new and general framework for sequential change detection when the pre- and post-change distributions are nonparametrically specified (and thus composite). Our procedures come with clean, nonasymptotic bounds on the average run length (frequency of false alarms). In certain nonparametric cases (like sub-Gaussian or sub-exponential), we also provide near-optimal bounds on the detection delay following a changepoint. The primary technical tool that we introduce is called an \\emph{e-detector}, which is composed of sums of e-processes -- a fundamental generalization of nonnegative supermartingales -- that are started at consecutive times. We first introduce simple Shiryaev-Roberts and CUSUM-style e-detectors, and then show how to design their mixtures in order to achieve both sta",
    "path": "papers/22/03/2203.03532.json",
    "total_tokens": 989,
    "tldr": "提出一个新的、通用的非参数化框架，名为E-detectors，用于顺序变化检测，具有非渐近界限的虚警频率和优秀的检测延迟，主要技术工具是由E过程求和组成的E检测器。"
}