{
    "title": "AutoSDF: Shape Priors for 3D Completion, Reconstruction and Generation. (arXiv:2203.09516v3 [cs.CV] UPDATED)",
    "abstract": "Powerful priors allow us to perform inference with insufficient information. In this paper, we propose an autoregressive prior for 3D shapes to solve multimodal 3D tasks such as shape completion, reconstruction, and generation. We model the distribution over 3D shapes as a non-sequential autoregressive distribution over a discretized, low-dimensional, symbolic grid-like latent representation of 3D shapes. This enables us to represent distributions over 3D shapes conditioned on information from an arbitrary set of spatially anchored query locations and thus perform shape completion in such arbitrary settings (e.g., generating a complete chair given only a view of the back leg). We also show that the learned autoregressive prior can be leveraged for conditional tasks such as single-view reconstruction and language-based generation. This is achieved by learning task-specific naive conditionals which can be approximated by light-weight models trained on minimal paired data. We validate the",
    "link": "http://arxiv.org/abs/2203.09516",
    "context": "Title: AutoSDF: Shape Priors for 3D Completion, Reconstruction and Generation. (arXiv:2203.09516v3 [cs.CV] UPDATED)\nAbstract: Powerful priors allow us to perform inference with insufficient information. In this paper, we propose an autoregressive prior for 3D shapes to solve multimodal 3D tasks such as shape completion, reconstruction, and generation. We model the distribution over 3D shapes as a non-sequential autoregressive distribution over a discretized, low-dimensional, symbolic grid-like latent representation of 3D shapes. This enables us to represent distributions over 3D shapes conditioned on information from an arbitrary set of spatially anchored query locations and thus perform shape completion in such arbitrary settings (e.g., generating a complete chair given only a view of the back leg). We also show that the learned autoregressive prior can be leveraged for conditional tasks such as single-view reconstruction and language-based generation. This is achieved by learning task-specific naive conditionals which can be approximated by light-weight models trained on minimal paired data. We validate the",
    "path": "papers/22/03/2203.09516.json",
    "total_tokens": 934,
    "translated_title": "AutoSDF: 用于三维完成、重建和生成的形状先验",
    "translated_abstract": "强大的先验条件可以使我们在信息不充分的情况下进行推理。在本文中，我们提出了一种三维形状的自回归先验，以解决多模态的三维任务，如形状完成、重建和生成。我们将三维形状的分布建模为非连续自回归分布，通过对三维形状的离散化、低维、象征性的网格状潜在表示进行建模。这使我们能够表示在任意一组空间锚定查询位置的信息条件下，三维形状的分布，从而在这些任意设置中进行形状完成（例如，仅给出后腿的视图即可生成完整的椅子）。我们还展示了学习的自回归先验可以用于条件任务，如单视图重建和基于语言的生成。这通过学习任务特定的朴素条件概率实现，这些条件概率可以由在最小成对数据上训练的轻量级模型进行近似。我们通过实验证明了该模型的有效性。",
    "tldr": "本文提出了一种自回归先验模型，可以用于解决三维任务中的形状完成、重建和生成问题。该模型可以在任意空间锚点位置的信息条件下进行形状完成，同时还可以用于单视图重建和基于语义的形状生成。",
    "en_tdlr": "This paper proposes an autoregressive prior model that can be used to solve shape completion, reconstruction, and generation problems in 3D tasks. The model can perform shape completion under arbitrary spatial query locations, and can also be used for single-view reconstruction and language-based shape generation. Its effectiveness is validated through experiments."
}