{
    "title": "Constitutional Implementation of Affirmative Action Policies in India",
    "abstract": "arXiv:2203.01483v3 Announce Type: replace  Abstract: India is home to a comprehensive affirmative action program that reserves a fraction of positions at governmental institutions for various disadvantaged groups. While there is a Supreme Court-endorsed mechanism to implement these reservation policies when all positions are identical, courts have refrained from endorsing explicit mechanisms when positions are heterogeneous. This lacunae has resulted in widespread adoption of unconstitutional mechanisms, countless lawsuits, and inconsistent court rulings. Formulating mandates in the landmark Supreme Court judgment Saurav Yadav (2020) as technical axioms, we show that the 2SMH-DA mechanism is uniquely suited to overcome these challenges.",
    "link": "https://arxiv.org/abs/2203.01483",
    "context": "Title: Constitutional Implementation of Affirmative Action Policies in India\nAbstract: arXiv:2203.01483v3 Announce Type: replace  Abstract: India is home to a comprehensive affirmative action program that reserves a fraction of positions at governmental institutions for various disadvantaged groups. While there is a Supreme Court-endorsed mechanism to implement these reservation policies when all positions are identical, courts have refrained from endorsing explicit mechanisms when positions are heterogeneous. This lacunae has resulted in widespread adoption of unconstitutional mechanisms, countless lawsuits, and inconsistent court rulings. Formulating mandates in the landmark Supreme Court judgment Saurav Yadav (2020) as technical axioms, we show that the 2SMH-DA mechanism is uniquely suited to overcome these challenges.",
    "path": "papers/22/03/2203.01483.json",
    "total_tokens": 715,
    "translated_title": "印度实施正面行动政策的宪法性",
    "translated_abstract": "印度拥有一个全面的正面行动计划，为各种弱势群体在政府机构中储备了一部分职位。尽管在所有职位相同的情况下有一种得到最高法院认可的机制来实施这些预留政策，但在职位不同的情况下，法院却不愿意支持明确的机制。这一空白导致了广泛采用违宪机制，无数诉讼案件以及法院裁决的不一致性。通过将最高法院标志性判决Saurav Yadav（2020）中的命令制定为技术公理，我们展示了2SMH-DA机制如何独特地适用于克服这些挑战。",
    "tldr": "通过研究表明，2SMH-DA机制在解决印度在实施正面行动政策时面临的挑战方面具有独特优势。",
    "en_tdlr": "The study demonstrates that the 2SMH-DA mechanism has unique advantages in addressing the challenges faced by India in implementing affirmative action policies."
}