{
    "title": "Detection and treatment of outliers for multivariate robust loss reserving. (arXiv:2203.03874v3 [stat.ME] UPDATED)",
    "abstract": "Traditional techniques for calculating outstanding claim liabilities such as the chain ladder are notoriously at risk of being distorted by outliers in past claims data. Unfortunately, the literature in robust methods of reserving is scant, with notable exceptions such as Verdonck and Debruyne (2011) and Verdonck and Van Wouwe (2011). In this paper, we put forward two alternative robust bivariate chain-ladder techniques to extend the approach of Verdonck and Van Wouwe (2011). The first technique is based on Adjusted Outlyingness (Hubert and Van der Veeken, 2008) and explicitly incorporates skewness into the analysis whilst providing a unique measure of outlyingness for each observation. The second technique is based on bagdistance (Hubert et al., 2016) which is derived from the bagplot however is able to provide a unique measure of outlyingness and a means to adjust outlying observations based on this measure.  Furthermore, we extend our robust bivariate chain-ladder approach to an N-d",
    "link": "http://arxiv.org/abs/2203.03874",
    "context": "Title: Detection and treatment of outliers for multivariate robust loss reserving. (arXiv:2203.03874v3 [stat.ME] UPDATED)\nAbstract: Traditional techniques for calculating outstanding claim liabilities such as the chain ladder are notoriously at risk of being distorted by outliers in past claims data. Unfortunately, the literature in robust methods of reserving is scant, with notable exceptions such as Verdonck and Debruyne (2011) and Verdonck and Van Wouwe (2011). In this paper, we put forward two alternative robust bivariate chain-ladder techniques to extend the approach of Verdonck and Van Wouwe (2011). The first technique is based on Adjusted Outlyingness (Hubert and Van der Veeken, 2008) and explicitly incorporates skewness into the analysis whilst providing a unique measure of outlyingness for each observation. The second technique is based on bagdistance (Hubert et al., 2016) which is derived from the bagplot however is able to provide a unique measure of outlyingness and a means to adjust outlying observations based on this measure.  Furthermore, we extend our robust bivariate chain-ladder approach to an N-d",
    "path": "papers/22/03/2203.03874.json",
    "total_tokens": 1039,
    "translated_title": "多元鲁棒损失预备金的离群值检测和处理方法",
    "translated_abstract": "传统的未决赔款负债计算技术如链锁技术极易因历史索赔数据中的离群值而变得扭曲。不幸的是，目前鲁棒保留方法的文献较少，但Verdonck和Debruyne（2011）和Verdonck和Van Wouwe（2011）是明显的例外。本文提出了两种替代的鲁棒双变量链锁技术以扩展Verdonck和Van Wouwe（2011）的方法。第一种技术是基于调整的异常（Hubert和Van der Veeken，2008），它明确地将偏度纳入分析，并为每个观测值提供了独特的离群度度量。第二种技术基于bagdistance（Hubert等，2016），它来源于bagplot技术，能够提供一个独特的离群度度量，并提供一种根据此度量调整离群值的方法。此外，我们将我们的鲁棒双变量链锁方法扩展到N-维框架，并通过模拟研究表明，我们的技术能够比传统技术更好地预测未来的索赔成本，特别是在存在离群值的情况下。",
    "tldr": "本研究提出了两种鲁棒双变量链锁技术，用于检测和处理历史索赔数据中的离群值。这些技术能够更好地预测未来的索赔成本，特别是在存在离群值的情况下。",
    "en_tdlr": "This paper proposes two robust bivariate chain-ladder techniques to detect and treat outliers in historical claim data, which can better predict future claims costs, particularly in the presence of outliers."
}