{
    "title": "Self-Supervised Learning for Recommender Systems: A Survey. (arXiv:2203.15876v2 [cs.IR] UPDATED)",
    "abstract": "In recent years, neural architecture-based recommender systems have achieved tremendous success, but they still fall short of expectation when dealing with highly sparse data. Self-supervised learning (SSL), as an emerging technique for learning from unlabeled data, has attracted considerable attention as a potential solution to this issue. This survey paper presents a systematic and timely review of research efforts on self-supervised recommendation (SSR). Specifically, we propose an exclusive definition of SSR, on top of which we develop a comprehensive taxonomy to divide existing SSR methods into four categories: contrastive, generative, predictive, and hybrid. For each category, we elucidate its concept and formulation, the involved methods, as well as its pros and cons. Furthermore, to facilitate empirical comparison, we release an open-source library SELFRec (https://github.com/Coder-Yu/SELFRec), which incorporates a wide range of SSR models and benchmark datasets. Through rigoro",
    "link": "http://arxiv.org/abs/2203.15876",
    "context": "Title: Self-Supervised Learning for Recommender Systems: A Survey. (arXiv:2203.15876v2 [cs.IR] UPDATED)\nAbstract: In recent years, neural architecture-based recommender systems have achieved tremendous success, but they still fall short of expectation when dealing with highly sparse data. Self-supervised learning (SSL), as an emerging technique for learning from unlabeled data, has attracted considerable attention as a potential solution to this issue. This survey paper presents a systematic and timely review of research efforts on self-supervised recommendation (SSR). Specifically, we propose an exclusive definition of SSR, on top of which we develop a comprehensive taxonomy to divide existing SSR methods into four categories: contrastive, generative, predictive, and hybrid. For each category, we elucidate its concept and formulation, the involved methods, as well as its pros and cons. Furthermore, to facilitate empirical comparison, we release an open-source library SELFRec (https://github.com/Coder-Yu/SELFRec), which incorporates a wide range of SSR models and benchmark datasets. Through rigoro",
    "path": "papers/22/03/2203.15876.json",
    "total_tokens": 797,
    "translated_title": "自监督学习在推荐系统中的应用：综述",
    "translated_abstract": "近年来，基于神经网络的推荐系统取得了巨大的成功，但在处理高度稀疏的数据时仍不尽人意。自监督学习作为一种从无标签数据中学习的新兴技术，已经引起了广泛关注，被看作是解决这个问题的潜在方法。本文综述了自监督推荐的研究工作，提出了自监督推荐的定义和分类方法，并详细介绍了各种方法的优劣以及将来的研究方向。",
    "tldr": "本文综述了自监督推荐（SSR）的研究进展，提出了四种方法：对比、生成、预测和混合，并介绍了各种方法的优缺点及研究方向。",
    "en_tdlr": "This survey paper reviews the recent research efforts on self-supervised recommendation (SSR) and proposes a comprehensive taxonomy for existing SSR methods, including contrastive, generative, predictive, and hybrid. It identifies opportunities and challenges of employing SSL for recommendation and points out several promising directions for future research."
}