{
    "title": "Certified Symmetry and Dominance Breaking for Combinatorial Optimisation. (arXiv:2203.12275v3 [cs.AI] UPDATED)",
    "abstract": "Symmetry and dominance breaking can be crucial for solving hard combinatorial search and optimisation problems, but the correctness of these techniques sometimes relies on subtle arguments. For this reason, it is desirable to produce efficient, machine-verifiable certificates that solutions have been computed correctly. Building on the cutting planes proof system, we develop a certification method for optimisation problems in which symmetry and dominance breaking are easily expressible. Our experimental evaluation demonstrates that we can efficiently verify fully general symmetry breaking in Boolean satisfiability (SAT) solving, thus providing, for the first time, a unified method to certify a range of advanced SAT techniques that also includes XOR and cardinality reasoning. In addition, we apply our method to maximum clique solving and constraint programming as a proof of concept that the approach applies to a wider range of combinatorial problems.",
    "link": "http://arxiv.org/abs/2203.12275",
    "context": "Title: Certified Symmetry and Dominance Breaking for Combinatorial Optimisation. (arXiv:2203.12275v3 [cs.AI] UPDATED)\nAbstract: Symmetry and dominance breaking can be crucial for solving hard combinatorial search and optimisation problems, but the correctness of these techniques sometimes relies on subtle arguments. For this reason, it is desirable to produce efficient, machine-verifiable certificates that solutions have been computed correctly. Building on the cutting planes proof system, we develop a certification method for optimisation problems in which symmetry and dominance breaking are easily expressible. Our experimental evaluation demonstrates that we can efficiently verify fully general symmetry breaking in Boolean satisfiability (SAT) solving, thus providing, for the first time, a unified method to certify a range of advanced SAT techniques that also includes XOR and cardinality reasoning. In addition, we apply our method to maximum clique solving and constraint programming as a proof of concept that the approach applies to a wider range of combinatorial problems.",
    "path": "papers/22/03/2203.12275.json",
    "total_tokens": 841,
    "translated_title": "认证的对称性和优先级突破用于组合优化",
    "translated_abstract": "对称性和优先级突破对于解决困难的组合搜索和优化问题至关重要，但这些技术的正确性有时依赖于微妙的论证。因此，产生高效的机器可验证证书来证明解决方案的正确计算是可取的。我们基于切割平面证明系统，为可表达对称性和优先级突破的优化问题开发了一种认证方法。我们的实验评估表明，我们可以高效地验证布尔可满足性（SAT）求解中的完全一般对称性突破，从而首次提供了一种统一的方法来认证一系列高级SAT技术，包括异或和基数推理。此外，我们将我们的方法应用于最大团求解和约束编程，作为对这种方法适用于更广泛的组合问题的概念证明。",
    "tldr": "该论文介绍了一种用于认证对称性和优先级突破的方法，可以高效地验证布尔可满足性（SAT）求解中的一般对称性突破，还可以应用于最大团求解和约束编程等组合问题。",
    "en_tdlr": "This paper presents a certification method for symmetry and dominance breaking in combinatorial optimization problems. It efficiently verifies general symmetry breaking in Boolean satisfiability (SAT) solving and can be applied to maximum clique solving and constraint programming as well."
}