{
    "title": "How to Exploit Hyperspherical Embeddings for Out-of-Distribution Detection?. (arXiv:2203.04450v3 [cs.CV] UPDATED)",
    "abstract": "Out-of-distribution (OOD) detection is a critical task for reliable machine learning. Recent advances in representation learning give rise to distance-based OOD detection, where testing samples are detected as OOD if they are relatively far away from the centroids or prototypes of in-distribution (ID) classes. However, prior methods directly take off-the-shelf contrastive losses that suffice for classifying ID samples, but are not optimally designed when test inputs contain OOD samples. In this work, we propose CIDER, a novel representation learning framework that exploits hyperspherical embeddings for OOD detection. CIDER jointly optimizes two losses to promote strong ID-OOD separability: a dispersion loss that promotes large angular distances among different class prototypes, and a compactness loss that encourages samples to be close to their class prototypes. We analyze and establish the unexplored relationship between OOD detection performance and the embedding properties in the hy",
    "link": "http://arxiv.org/abs/2203.04450",
    "context": "Title: How to Exploit Hyperspherical Embeddings for Out-of-Distribution Detection?. (arXiv:2203.04450v3 [cs.CV] UPDATED)\nAbstract: Out-of-distribution (OOD) detection is a critical task for reliable machine learning. Recent advances in representation learning give rise to distance-based OOD detection, where testing samples are detected as OOD if they are relatively far away from the centroids or prototypes of in-distribution (ID) classes. However, prior methods directly take off-the-shelf contrastive losses that suffice for classifying ID samples, but are not optimally designed when test inputs contain OOD samples. In this work, we propose CIDER, a novel representation learning framework that exploits hyperspherical embeddings for OOD detection. CIDER jointly optimizes two losses to promote strong ID-OOD separability: a dispersion loss that promotes large angular distances among different class prototypes, and a compactness loss that encourages samples to be close to their class prototypes. We analyze and establish the unexplored relationship between OOD detection performance and the embedding properties in the hy",
    "path": "papers/22/03/2203.04450.json",
    "total_tokens": 994,
    "translated_title": "如何利用超球嵌入实现嵌入空间的OOV检测？",
    "translated_abstract": "对于可靠的机器学习任务，外部分布（OOD）检测至关重要。最近在表示学习方面的进展引发了基于距离的OOD检测，其中如果测试样本与内部分布（ID）类的质心或原型相对较远，则检测到这些样本为OOD。然而，以往的方法直接采用现成的对比损失来分类ID样本，但在测试输入包含OOD样本时，这些方法不具有最优设计。在这项工作中，我们提出了CIDER，一种利用超球嵌入进行OOD检测的新型表示学习框架。CIDER同时优化两个损失以促进强ID-OOD可分性：一种分散损失，促进不同类别原型之间的大角距离，以及一种紧凑损失，鼓励样本靠近其类别原型。我们分析并建立了超球空间嵌入属性与OOD检测性能之间尚未开发的关系。在基准数据集上进行的大量实验表明，CIDER优于现有最先进方法，并实现了OOD检测性能的新记录。",
    "tldr": "本论文提出了一种新型表示学习框架CIDER，可以利用超球嵌入实现外部分布（OOD）检测，该方法综合优化两个损失以促进强内部-外部类别可分性，并在基准数据集上取得了新的OOD检测性能记录。",
    "en_tdlr": "This paper proposes a new representation learning framework called CIDER which utilizes hyperspherical embeddings for out-of-distribution (OOD) detection. CIDER optimizes two losses to promote strong ID-OOD separability and achieves a new record of OOD detection performance on benchmark datasets."
}