{
    "title": "An Explainable Stacked Ensemble Model for Static Route-Free Estimation of Time of Arrival. (arXiv:2203.09438v2 [cs.LG] UPDATED)",
    "abstract": "To compare alternative taxi schedules and to compute them, as well as to provide insights into an upcoming taxi trip to drivers and passengers, the duration of a trip or its Estimated Time of Arrival (ETA) is predicted. To reach a high prediction precision, machine learning models for ETA are state of the art. One yet unexploited option to further increase prediction precision is to combine multiple ETA models into an ensemble. While an increase of prediction precision is likely, the main drawback is that the predictions made by such an ensemble become less transparent due to the sophisticated ensemble architecture. One option to remedy this drawback is to apply eXplainable Artificial Intelligence (XAI). The contribution of this paper is three-fold. First, we combine multiple machine learning models from our previous work for ETA into a two-level ensemble model - a stacked ensemble model - which on its own is novel; therefore, we can outperform previous state-of-the-art static route-fr",
    "link": "http://arxiv.org/abs/2203.09438",
    "context": "Title: An Explainable Stacked Ensemble Model for Static Route-Free Estimation of Time of Arrival. (arXiv:2203.09438v2 [cs.LG] UPDATED)\nAbstract: To compare alternative taxi schedules and to compute them, as well as to provide insights into an upcoming taxi trip to drivers and passengers, the duration of a trip or its Estimated Time of Arrival (ETA) is predicted. To reach a high prediction precision, machine learning models for ETA are state of the art. One yet unexploited option to further increase prediction precision is to combine multiple ETA models into an ensemble. While an increase of prediction precision is likely, the main drawback is that the predictions made by such an ensemble become less transparent due to the sophisticated ensemble architecture. One option to remedy this drawback is to apply eXplainable Artificial Intelligence (XAI). The contribution of this paper is three-fold. First, we combine multiple machine learning models from our previous work for ETA into a two-level ensemble model - a stacked ensemble model - which on its own is novel; therefore, we can outperform previous state-of-the-art static route-fr",
    "path": "papers/22/03/2203.09438.json",
    "total_tokens": 908,
    "translated_title": "一种用于静态无路径估计到达时间的可解释叠加集成模型",
    "translated_abstract": "为了比较备选的出租车行程并计算它们，以及为驾驶员和乘客提供关于即将到来的出租车行程的见解，需要预测行程的持续时间或其预计到达时间（ETA）。为了达到较高的预测精度，ETA的机器学习模型是目前的技术水平。进一步提高预测精度的一个尚未开发的选项是将多个ETA模型组合成一个集成模型。尽管预测精度可能会增加，但这种集成模型的预测结果由于复杂的集成结构而变得不够透明。解决这个问题的一种方法是应用可解释人工智能（XAI）。本文的贡献有三个方面。首先，我们将我们先前工作中的多个机器学习模型组合成一个两层的集成模型- 一个叠加集成模型- 这本身就是一种创新；因此，我们可以超越先前的静态路径无关最先进的模型。",
    "tldr": "本文提出了一种可解释的叠加集成模型，用于静态无路径估计到达时间。该模型将多个机器学习模型组合成一个新的集成结构，能够超越先前的最先进模型。"
}