{
    "title": "Quantum compiling with variational instruction set for accurate and fast quantum computing. (arXiv:2203.15574v3 [quant-ph] UPDATED)",
    "abstract": "The quantum instruction set (QIS) is defined as the quantum gates that are physically realizable by controlling the qubits in a quantum hardware. Compiling quantum circuits into the product of the gates in a properly-defined QIS is a fundamental step in quantum computing. We here propose the \\R{quantum variational instruction set (QuVIS)} formed by flexibly-designed multi-qubit gates for higher speed and accuracy of quantum computing. The controlling of qubits for realizing the gates in a QuVIS are variationally achieved using the fine-grained time optimization algorithm. Significant reductions on both the error accumulation and time cost are demonstrated in realizing the swaps of multiple qubits and quantum Fourier transformations, compared with the compiling by the standard QIS such as \\RR{the quantum microinstruction set} (QuMIS, formed by several one- and two-qubit gates including the one-qubit rotations and controlled-NOT gate). With the same requirement on quantum hardware, the t",
    "link": "http://arxiv.org/abs/2203.15574",
    "context": "Title: Quantum compiling with variational instruction set for accurate and fast quantum computing. (arXiv:2203.15574v3 [quant-ph] UPDATED)\nAbstract: The quantum instruction set (QIS) is defined as the quantum gates that are physically realizable by controlling the qubits in a quantum hardware. Compiling quantum circuits into the product of the gates in a properly-defined QIS is a fundamental step in quantum computing. We here propose the \\R{quantum variational instruction set (QuVIS)} formed by flexibly-designed multi-qubit gates for higher speed and accuracy of quantum computing. The controlling of qubits for realizing the gates in a QuVIS are variationally achieved using the fine-grained time optimization algorithm. Significant reductions on both the error accumulation and time cost are demonstrated in realizing the swaps of multiple qubits and quantum Fourier transformations, compared with the compiling by the standard QIS such as \\RR{the quantum microinstruction set} (QuMIS, formed by several one- and two-qubit gates including the one-qubit rotations and controlled-NOT gate). With the same requirement on quantum hardware, the t",
    "path": "papers/22/03/2203.15574.json",
    "total_tokens": 891,
    "translated_title": "基于变分指令集的量子编译优化：实现高精度与快速量子计算",
    "translated_abstract": "量子指令集(QIS)定义为在控制量子比特状态下可以物理实现的一系列量子门操作，其在量子计算中起着基础性作用。本文提出了基于灵活设计的多量子比特门操作的量子变分指令集(QuVIS)，通过细粒度的时间优化算法来变分实现量子比特的控制，从而实现快速和精确的量子计算。与标准QIS 如量子微指令集(QuMIS)相比，QuVIS 用于多量子比特交换和量子傅里叶变换等门操作具有更低的误差积累和时间成本。在相同量子硬件要求下，本文的方法可大幅提升量子计算的效率。",
    "tldr": "本文提出了基于灵活设计的多量子比特门操作的量子变分指令集(QuVIS)，通过细粒度的时间优化算法，实现了快速和精确的量子计算，并且通过实验展示出了更低的误差积累和时间成本。",
    "en_tdlr": "This paper proposes a quantum variational instruction set (QuVIS) formed by flexibly-designed multi-qubit gates for higher speed and accuracy of quantum computing, and demonstrates lower error accumulation and time cost in realizing multi-qubit swaps and quantum Fourier transformations compared to the standard quantum instruction set (QIS) such as the quantum microinstruction set (QuMIS) through experiments."
}