{
    "title": "Pedagogical Demonstrations and Pragmatic Learning in Artificial Tutor-Learner Interactions. (arXiv:2203.00111v2 [cs.LG] UPDATED)",
    "abstract": "When demonstrating a task, human tutors pedagogically modify their behavior by either \"showing\" the task rather than just \"doing\" it (exaggerating on relevant parts of the demonstration) or by giving demonstrations that best disambiguate the communicated goal. Analogously, human learners pragmatically infer the communicative intent of the tutor: they interpret what the tutor is trying to teach them and deduce relevant information for learning. Without such mechanisms, traditional Learning from Demonstration (LfD) algorithms will consider such demonstrations as sub-optimal. In this paper, we investigate the implementation of such mechanisms in a tutor-learner setup where both participants are artificial agents in an environment with multiple goals. Using pedagogy from the tutor and pragmatism from the learner, we show substantial improvements over standard learning from demonstrations.",
    "link": "http://arxiv.org/abs/2203.00111",
    "context": "Title: Pedagogical Demonstrations and Pragmatic Learning in Artificial Tutor-Learner Interactions. (arXiv:2203.00111v2 [cs.LG] UPDATED)\nAbstract: When demonstrating a task, human tutors pedagogically modify their behavior by either \"showing\" the task rather than just \"doing\" it (exaggerating on relevant parts of the demonstration) or by giving demonstrations that best disambiguate the communicated goal. Analogously, human learners pragmatically infer the communicative intent of the tutor: they interpret what the tutor is trying to teach them and deduce relevant information for learning. Without such mechanisms, traditional Learning from Demonstration (LfD) algorithms will consider such demonstrations as sub-optimal. In this paper, we investigate the implementation of such mechanisms in a tutor-learner setup where both participants are artificial agents in an environment with multiple goals. Using pedagogy from the tutor and pragmatism from the learner, we show substantial improvements over standard learning from demonstrations.",
    "path": "papers/22/03/2203.00111.json",
    "total_tokens": 875,
    "translated_title": "人工导师-学习者互动中的教学演示和实用学习",
    "translated_abstract": "在展示任务时，人类导师通过“展示”任务而不仅仅是“完成”任务（夸大演示的相关部分）或者给出能最清晰表达目标的演示来教学。类似地，人类学习者会推断导师的交际意图：他们解释导师试图教他们什么，并推断出学习所需的相关信息。如果没有这样的机制，传统的从演示中学习（Learning from Demonstration，LfD）算法将认为这样的演示是次优的。本文研究在一个多目标环境中，导师和学习者都是人工智能代理人的学习者-导师设置中实现这样的机制。通过导师的教学和学习者的实用推理，我们展示了相比标准的从演示中学习方法的大幅改进。",
    "tldr": "本文研究了人工智能导师-学习者互动中的教学演示和实用学习机制，并在一个多目标环境中实现。通过使用导师的教学和学习者的实用推理，相比传统的从演示中学习方法，我们实现了显著的改进。",
    "en_tdlr": "This paper investigates the mechanisms of pedagogical demonstrations and pragmatic learning in artificial tutor-learner interactions, and shows substantial improvements over traditional learning from demonstrations methods by utilizing pedagogy from the tutor and pragmatism from the learner in a multi-goal environment."
}