{
    "title": "Estimating Nonlinear Network Data Models with Fixed Effects. (arXiv:2203.15603v2 [econ.EM] UPDATED)",
    "abstract": "I introduce a new method for bias correction of dyadic models with agent-specific fixed-effects, including the dyadic link formation model with homophily and degree heterogeneity. The proposed approach uses a jackknife procedure to deal with the incidental parameters problem. The method can be applied to both directed and undirected networks, allows for non-binary outcome variables, and can be used to bias correct estimates of average effects and counterfactual outcomes. I also show how the jackknife can be used to bias-correct fixed effect averages over functions that depend on multiple nodes, e.g. triads or tetrads in the network. As an example, I implement specification tests for dependence across dyads, such as reciprocity or transitivity. Finally, I demonstrate the usefulness of the estimator in an application to a gravity model for import/export relationships across countries.",
    "link": "http://arxiv.org/abs/2203.15603",
    "context": "Title: Estimating Nonlinear Network Data Models with Fixed Effects. (arXiv:2203.15603v2 [econ.EM] UPDATED)\nAbstract: I introduce a new method for bias correction of dyadic models with agent-specific fixed-effects, including the dyadic link formation model with homophily and degree heterogeneity. The proposed approach uses a jackknife procedure to deal with the incidental parameters problem. The method can be applied to both directed and undirected networks, allows for non-binary outcome variables, and can be used to bias correct estimates of average effects and counterfactual outcomes. I also show how the jackknife can be used to bias-correct fixed effect averages over functions that depend on multiple nodes, e.g. triads or tetrads in the network. As an example, I implement specification tests for dependence across dyads, such as reciprocity or transitivity. Finally, I demonstrate the usefulness of the estimator in an application to a gravity model for import/export relationships across countries.",
    "path": "papers/22/03/2203.15603.json",
    "total_tokens": 855,
    "translated_title": "修正带有固定效应的非线性网络数据模型的估计方法",
    "translated_abstract": "本论文提出一种新的方法来修正带有特定个体的固定特征的二元模型——其中包括同质性和度异质性的二元链接形成模型的偏差。所提出的方法使用了杰克刀（jackknife）程序来处理关于偶然参数的问题。该方法可应用于有向和无向网络，并且允许使用非二元结果变量，并可用于修正平均效应和反事实结局的估计。作者还展示了如何使用杰克刀来纠正对多个节点的固定效应平均值的偏差，例如三元组或四元组。最后，作者在一个关于跨国进出口关系的引力模型的应用中展示了该估计器的实用性。",
    "tldr": "本文提出一种使用杰克刀程序修正带有个体固定效应的非线性网络数据模型偏差的新方法，可适用于有向和无向网络，对非二元结果变量进行估计，并可用于修正平均效应和反事实结局的估算。",
    "en_tdlr": "This paper proposes a new method for bias correction of nonlinear network data models with fixed effects, which uses a jackknife procedure to deal with incidental parameters problem, and can be applied to both directed and undirected networks, allowing for non-binary outcome variables, and bias correcting estimates of average effects and counterfactual outcomes. The usefulness of the estimator is demonstrated in an application to a gravity model for import/export relationships across countries."
}