{
    "title": "A Robust Framework of Chromosome Straightening with ViT-Patch GAN. (arXiv:2203.02901v2 [cs.CV] UPDATED)",
    "abstract": "Chromosomes carry the genetic information of humans. They exhibit non-rigid and non-articulated nature with varying degrees of curvature. Chromosome straightening is an important step for subsequent karyotype construction, pathological diagnosis and cytogenetic map development. However, robust chromosome straightening remains challenging, due to the unavailability of training images, distorted chromosome details and shapes after straightening, as well as poor generalization capability. In this paper, we propose a novel architecture, ViT-Patch GAN, consisting of a self-learned motion transformation generator and a Vision Transformer-based patch (ViT-Patch) discriminator. The generator learns the motion representation of chromosomes for straightening. With the help of the ViT-Patch discriminator, the straightened chromosomes retain more shape and banding pattern details. The experimental results show that the proposed method achieves better performance on Fr\\'echet Inception Distance (FI",
    "link": "http://arxiv.org/abs/2203.02901",
    "context": "Title: A Robust Framework of Chromosome Straightening with ViT-Patch GAN. (arXiv:2203.02901v2 [cs.CV] UPDATED)\nAbstract: Chromosomes carry the genetic information of humans. They exhibit non-rigid and non-articulated nature with varying degrees of curvature. Chromosome straightening is an important step for subsequent karyotype construction, pathological diagnosis and cytogenetic map development. However, robust chromosome straightening remains challenging, due to the unavailability of training images, distorted chromosome details and shapes after straightening, as well as poor generalization capability. In this paper, we propose a novel architecture, ViT-Patch GAN, consisting of a self-learned motion transformation generator and a Vision Transformer-based patch (ViT-Patch) discriminator. The generator learns the motion representation of chromosomes for straightening. With the help of the ViT-Patch discriminator, the straightened chromosomes retain more shape and banding pattern details. The experimental results show that the proposed method achieves better performance on Fr\\'echet Inception Distance (FI",
    "path": "papers/22/03/2203.02901.json",
    "total_tokens": 956,
    "translated_title": "一种基于ViT-Patch GAN的染色体修直鲁棒性框架",
    "translated_abstract": "染色体承载着人类的遗传信息。它们具有不规则的非刚性和非关节性，并且存在不同程度的弯曲。染色体修直是后续核型构建、病理诊断和细胞遗传图谱发展的重要步骤。然而，由于没有训练图像、修直后畸变的染色体细节和形状以及泛化能力差，鲁棒性染色体修直仍然具有挑战性。本文提出了一种新的架构ViT-Patch GAN，包括一个自学习的运动变换生成器和一个基于Vision Transformer的patch（ViT-Patch）鉴别器。生成器学习染色体的运动表示以进行修直。在ViT-Patch鉴别器的帮助下，修直的染色体保留更多的形状和斑带图案细节。实验结果表明，所提出的方法在Fr\\'echet Inception距离（FI",
    "tldr": "本文提出了一种新的ViT-Patch GAN架构，其包括一个自学习的运动变换生成器和基于Vision Transformer的patch（ViT-Patch）鉴别器。该生成器学习染色体的运动表示，以实现鲁棒性染色体修直，并且在保留形状和斑带图案细节方面具有更好的性能。",
    "en_tdlr": "This paper proposes a novel ViT-Patch GAN architecture, consisting of a self-learned motion transformation generator and a Vision Transformer-based patch (ViT-Patch) discriminator. The generator learns the motion representation of chromosomes for robust chromosome straightening, with better performance in retaining shape and banding pattern details."
}