{
    "title": "Spin-Dependent Graph Neural Network Potential for Magnetic Materials. (arXiv:2203.02853v2 [physics.comp-ph] UPDATED)",
    "abstract": "The development of machine learning interatomic potentials has immensely contributed to the accuracy of simulations of molecules and crystals. However, creating interatomic potentials for magnetic systems that account for both magnetic moments and structural degrees of freedom remains a challenge. This work introduces SpinGNN, a spin-dependent interatomic potential approach that employs the graph neural network (GNN) to describe magnetic systems. SpinGNN consists of two types of edge GNNs: Heisenberg edge GNN (HEGNN) and spin-distance edge GNN (SEGNN). HEGNN is tailored to capture Heisenberg-type spin-lattice interactions, while SEGNN accurately models multi-body and high-order spin-lattice coupling. The effectiveness of SpinGNN is demonstrated by its exceptional precision in fitting a high-order spin Hamiltonian and two complex spin-lattice Hamiltonians with great precision. Furthermore, it successfully models the subtle spin-lattice coupling in BiFeO3 and performs large-scale spin-la",
    "link": "http://arxiv.org/abs/2203.02853",
    "context": "Title: Spin-Dependent Graph Neural Network Potential for Magnetic Materials. (arXiv:2203.02853v2 [physics.comp-ph] UPDATED)\nAbstract: The development of machine learning interatomic potentials has immensely contributed to the accuracy of simulations of molecules and crystals. However, creating interatomic potentials for magnetic systems that account for both magnetic moments and structural degrees of freedom remains a challenge. This work introduces SpinGNN, a spin-dependent interatomic potential approach that employs the graph neural network (GNN) to describe magnetic systems. SpinGNN consists of two types of edge GNNs: Heisenberg edge GNN (HEGNN) and spin-distance edge GNN (SEGNN). HEGNN is tailored to capture Heisenberg-type spin-lattice interactions, while SEGNN accurately models multi-body and high-order spin-lattice coupling. The effectiveness of SpinGNN is demonstrated by its exceptional precision in fitting a high-order spin Hamiltonian and two complex spin-lattice Hamiltonians with great precision. Furthermore, it successfully models the subtle spin-lattice coupling in BiFeO3 and performs large-scale spin-la",
    "path": "papers/22/03/2203.02853.json",
    "total_tokens": 969,
    "translated_title": "自旋相关的图神经网络势用于磁性材料",
    "translated_abstract": "机器学习相互作用势的发展极大地提高了分子和晶体模拟的准确性。然而，为磁性系统创建既考虑磁矩又考虑结构自由度的相互作用势仍然是一个挑战。本文介绍SpinGNN，一种自旋相关的相互作用势方法，利用图神经网络（GNN）描述磁性系统。SpinGNN由两种类型的边缘GNN组成：海森堡边缘GNN（HEGNN）和自旋距离边缘GNN（SEGNN）。HEGNN旨在捕捉海森堡型自旋-晶格相互作用，而SEGNN则准确地模拟多体和高阶自旋-晶格耦合。SpinGNN的有效性通过其在高阶自旋哈密顿量和两个复杂自旋-晶格哈密顿量的拟合精度方面的卓越表现得到了证明。此外，它成功地模拟了BiFeO3中微妙的自旋-晶格耦合，并进行了大规模的自旋模拟。",
    "tldr": "SpinGNN是一种自旋相关的相互作用势方法，利用图神经网络描述磁性系统的海森堡型自旋-晶格相互作用和高阶自旋-晶格耦合，同时成功地模拟了BiFeO3中微妙的自旋-晶格耦合。",
    "en_tdlr": "SpinGNN is a spin-dependent interatomic potential approach that employs graph neural network to describe Heisenberg-type spin-lattice interactions and high-order spin-lattice coupling in magnetic systems, and successfully models the subtle spin-lattice coupling in BiFeO3."
}