{
    "title": "Structural invariants and semantic fingerprints in the \"ego network\" of words. (arXiv:2203.00588v2 [cs.SI] UPDATED)",
    "abstract": "Well-established cognitive models coming from anthropology have shown that, due to the cognitive constraints that limit our \"bandwidth\" for social interactions, humans organize their social relations according to a regular structure. In this work, we postulate that similar regularities can be found in other cognitive processes, such as those involving language production. In order to investigate this claim, we analyse a dataset containing tweets of a heterogeneous group of Twitter users (regular users and professional writers). Leveraging a methodology similar to the one used to uncover the well-established social cognitive constraints, we find regularities at both the structural and semantic level. At the former, we find that a concentric layered structure (which we call ego network of words, in analogy to the ego network of social relationships) very well captures how individuals organise the words they use. The size of the layers in this structure regularly grows (approximately 2-3 ",
    "link": "http://arxiv.org/abs/2203.00588",
    "context": "Title: Structural invariants and semantic fingerprints in the \"ego network\" of words. (arXiv:2203.00588v2 [cs.SI] UPDATED)\nAbstract: Well-established cognitive models coming from anthropology have shown that, due to the cognitive constraints that limit our \"bandwidth\" for social interactions, humans organize their social relations according to a regular structure. In this work, we postulate that similar regularities can be found in other cognitive processes, such as those involving language production. In order to investigate this claim, we analyse a dataset containing tweets of a heterogeneous group of Twitter users (regular users and professional writers). Leveraging a methodology similar to the one used to uncover the well-established social cognitive constraints, we find regularities at both the structural and semantic level. At the former, we find that a concentric layered structure (which we call ego network of words, in analogy to the ego network of social relationships) very well captures how individuals organise the words they use. The size of the layers in this structure regularly grows (approximately 2-3 ",
    "path": "papers/22/03/2203.00588.json",
    "total_tokens": 817,
    "translated_title": "词语的“自我网络”中的结构不变量与语义指纹",
    "translated_abstract": "人类社交行为的认知模型表明，由于认知限制，人类会按照一种规则的结构组织社交关系。本文假设类似的规则性也存在于其他涉及语言产生的认知过程中。为了探究这一假设，我们分析了一个包含Twitter用户的异构数据集（包括普通用户和专业写手）。通过利用一种类似于揭示社交认知限制的方法，我们在结构和语义层面上发现了规则性。在结构层面上，我们发现一种称为“词语自我网络”的同心圆层次结构可以很好地捕捉个体组织所使用的词汇。这种结构中各层大小呈规则性增长（约2-3）。",
    "tldr": "本文探究了词语的“自我网络”，通过分析Twitter上的异构数据集，发现词汇使用存在同心圆层次结构，各层大小呈规则性增长。",
    "en_tdlr": "This paper investigates the \"ego network\" of words and finds that a concentric layered structure (ego network of words) can well capture how individuals organize the words they use, with each layer exhibiting regular growth patterns. This is revealed through the analysis of a heterogeneous dataset of Twitter users."
}