{
    "title": "An Optimal Control Method to Compute the Most Likely Transition Path for Stochastic Dynamical Systems with Jumps. (arXiv:2203.16874v2 [math.NA] UPDATED)",
    "abstract": "Many complex real world phenomena exhibit abrupt, intermittent or jumping behaviors, which are more suitable to be described by stochastic differential equations under non-Gaussian L\\'evy noise. Among these complex phenomena, the most likely transition paths between metastable states are important since these rare events may have a high impact in certain scenarios. Based on the large deviation principle, the most likely transition path could be treated as the minimizer of the rate function upon paths that connect two points. One of the challenges to calculate the most likely transition path for stochastic dynamical systems under non-Gaussian L\\'evy noise is that the associated rate function can not be explicitly expressed by paths. For this reason, we formulate an optimal control problem to obtain the optimal state as the most likely transition path. We then develop a neural network method to solve this issue. Several experiments are investigated for both Gaussian and non-Gaussian case",
    "link": "http://arxiv.org/abs/2203.16874",
    "context": "Title: An Optimal Control Method to Compute the Most Likely Transition Path for Stochastic Dynamical Systems with Jumps. (arXiv:2203.16874v2 [math.NA] UPDATED)\nAbstract: Many complex real world phenomena exhibit abrupt, intermittent or jumping behaviors, which are more suitable to be described by stochastic differential equations under non-Gaussian L\\'evy noise. Among these complex phenomena, the most likely transition paths between metastable states are important since these rare events may have a high impact in certain scenarios. Based on the large deviation principle, the most likely transition path could be treated as the minimizer of the rate function upon paths that connect two points. One of the challenges to calculate the most likely transition path for stochastic dynamical systems under non-Gaussian L\\'evy noise is that the associated rate function can not be explicitly expressed by paths. For this reason, we formulate an optimal control problem to obtain the optimal state as the most likely transition path. We then develop a neural network method to solve this issue. Several experiments are investigated for both Gaussian and non-Gaussian case",
    "path": "papers/22/03/2203.16874.json",
    "total_tokens": 889,
    "translated_title": "用于计算具有跳跃性的随机动力学系统最可能转换路径的最优控制方法",
    "translated_abstract": "许多复杂的现实世界现象表现出突然、间歇或跳跃行为，更适合用非高斯L\\'evy噪声下的随机微分方程来描述。在这些复杂现象中，转变状态之间的最可能转换路径非常重要，因为这些稀有事件在某些情景下可能会产生很高的影响。基于大偏差原理，最可能的转换路径可以被视为连接两个点的路径上的速率函数的极小化。计算非高斯L\\'evy噪声下的随机动力学系统的最可能转换路径的挑战之一是相关的速率函数无法通过路径明确表示。出于这个原因，我们制定了一个最优控制问题，以获得最可能转换路径的最优状态。然后，我们开发了一种神经网络方法来解决这个问题。对高斯和非高斯情况进行了几个实验。",
    "tldr": "本论文提出了一种用于计算具有跳跃性的随机动力学系统最可能转换路径的最优控制方法，通过解决一个最优控制问题和运用神经网络方法来克服相关速率函数无法明确表示的挑战。"
}