{
    "title": "Importance Sampling CAMs for Weakly-Supervised Segmentation. (arXiv:2203.12459v3 [cs.CV] UPDATED)",
    "abstract": "Classification networks can be used to localize and segment objects in images by means of class activation maps (CAMs). However, without pixel-level annotations, classification networks are known to (1) mainly focus on discriminative regions, and (2) to produce diffuse CAMs without well-defined prediction contours. In this work, we approach both problems with two contributions for improving CAM learning. First, we incorporate importance sampling based on the class-wise probability mass function induced by the CAMs to produce stochastic image-level class predictions. This results in CAMs which activate over a larger extent of objects. Second, we formulate a feature similarity loss term which aims to match the prediction contours with edges in the image. As a third contribution, we conduct experiments on the PASCAL VOC 2012 benchmark dataset to demonstrate that these modifications significantly increase the performance in terms of contour accuracy, while being comparable to current state",
    "link": "http://arxiv.org/abs/2203.12459",
    "context": "Title: Importance Sampling CAMs for Weakly-Supervised Segmentation. (arXiv:2203.12459v3 [cs.CV] UPDATED)\nAbstract: Classification networks can be used to localize and segment objects in images by means of class activation maps (CAMs). However, without pixel-level annotations, classification networks are known to (1) mainly focus on discriminative regions, and (2) to produce diffuse CAMs without well-defined prediction contours. In this work, we approach both problems with two contributions for improving CAM learning. First, we incorporate importance sampling based on the class-wise probability mass function induced by the CAMs to produce stochastic image-level class predictions. This results in CAMs which activate over a larger extent of objects. Second, we formulate a feature similarity loss term which aims to match the prediction contours with edges in the image. As a third contribution, we conduct experiments on the PASCAL VOC 2012 benchmark dataset to demonstrate that these modifications significantly increase the performance in terms of contour accuracy, while being comparable to current state",
    "path": "papers/22/03/2203.12459.json",
    "total_tokens": 830,
    "translated_title": "弱监督分割的重要性采样CAM方法",
    "translated_abstract": "通过类激活图（CAM）可以利用分类神经网络对图像中的物体进行定位和分割。然而，在没有像素级标注的情况下，分类网络往往只关注区分性较强的区域，并且会产生模糊的CAM，没有明确的预测边缘。本文提出了两种改进CAM方法的贡献，以解决这两个问题。首先，我们基于CAM产生的类别概率质量函数，引入重要性采样，产生随机的图像级别的预测，从而使CAM覆盖更广泛的物体区域。其次，我们提出了一种特征相似性损失项，旨在将预测边缘与图像中的边缘匹配。第三，我们在PASCAL VOC 2012基准数据集上进行实验，证明这些改进显著提高了轮廓精度性能，同时与当前状态相当。",
    "tldr": "本文提出了基于重要性采样和特征相似性损失项的CAM改进方法，显著提高了弱监督分割的轮廓精度性能。",
    "en_tdlr": "This paper proposes Importance Sampling CAMs and Feature Similarity Loss for CAMs to significantly improve the contour accuracy performance of weakly-supervised segmentation."
}