{
    "title": "BBE-LSWCM: A Bootstrapped Ensemble of Long and Short Window Clickstream Models",
    "abstract": "arXiv:2203.16155v3 Announce Type: replace  Abstract: We consider the problem of developing a clickstream modeling framework for real-time customer event prediction problems in SaaS products like QBO. We develop a low-latency, cost-effective, and robust ensemble architecture (BBE-LSWCM), which combines both aggregated user behavior data from a longer historical window (e.g., over the last few weeks) as well as user activities over a short window in recent-past (e.g., in the current session). As compared to other baseline approaches, we demonstrate the superior performance of the proposed method for two important real-time event prediction problems: subscription cancellation and intended task detection for QBO subscribers. Finally, we present details of the live deployment and results from online experiments in QBO.",
    "link": "https://arxiv.org/abs/2203.16155",
    "context": "Title: BBE-LSWCM: A Bootstrapped Ensemble of Long and Short Window Clickstream Models\nAbstract: arXiv:2203.16155v3 Announce Type: replace  Abstract: We consider the problem of developing a clickstream modeling framework for real-time customer event prediction problems in SaaS products like QBO. We develop a low-latency, cost-effective, and robust ensemble architecture (BBE-LSWCM), which combines both aggregated user behavior data from a longer historical window (e.g., over the last few weeks) as well as user activities over a short window in recent-past (e.g., in the current session). As compared to other baseline approaches, we demonstrate the superior performance of the proposed method for two important real-time event prediction problems: subscription cancellation and intended task detection for QBO subscribers. Finally, we present details of the live deployment and results from online experiments in QBO.",
    "path": "papers/22/03/2203.16155.json",
    "total_tokens": 782,
    "translated_title": "BBE-LSWCM: 一种长短窗口点击流模型的自举集成",
    "translated_abstract": "我们考虑了为SaaS产品如QBO开发一个用于实时客户事件预测问题的点击流建模框架的问题。我们开发了一种低延迟、成本效益和鲁棒性的集成架构（BBE-LSWCM），它结合了长时间历史窗口中的用户行为数据（如过去几周内的数据）以及最近短窗口内的用户活动（如当前会话中的活动）。与其他基线方法相比，我们展示了所提出方法在两个重要的实时事件预测问题上的卓越性能：QBO订阅取消和有意任务检测。最后，我们呈现了在QBO中的在线部署细节和实验结果。",
    "tldr": "提出了一种融合长短窗口的点击流模型自举集成框架（BBE-LSWCM），在实时客户事件预测中表现出优越性能，特别适用于QBO订阅取消和有意任务检测。",
    "en_tdlr": "Introduced a bootstrapped ensemble framework (BBE-LSWCM) that combines long and short window clickstream models, demonstrating superior performance in real-time customer event prediction, especially for subscription cancellation and intended task detection in QBO."
}