{
    "title": "Spatial-Temporal Attention Fusion Network for short-term passenger flow prediction on holidays in urban rail transit systems. (arXiv:2203.00007v4 [cs.LG] UPDATED)",
    "abstract": "The short term passenger flow prediction of the urban rail transit system is of great significance for traffic operation and management. The emerging deep learning-based models provide effective methods to improve prediction accuracy. However, most of the existing models mainly predict the passenger flow on general weekdays or weekends. There are only few studies focusing on predicting the passenger flow on holidays, which is a significantly challenging task for traffic management because of its suddenness and irregularity. To this end, we propose a deep learning-based model named Spatial Temporal Attention Fusion Network comprising a novel Multi-Graph Attention Network, a Conv-Attention Block, and Feature Fusion Block for short-term passenger flow prediction on holidays. The multi-graph attention network is applied to extract the complex spatial dependencies of passenger flow dynamically and the conv-attention block is applied to extract the temporal dependencies of passenger flow fro",
    "link": "http://arxiv.org/abs/2203.00007",
    "context": "Title: Spatial-Temporal Attention Fusion Network for short-term passenger flow prediction on holidays in urban rail transit systems. (arXiv:2203.00007v4 [cs.LG] UPDATED)\nAbstract: The short term passenger flow prediction of the urban rail transit system is of great significance for traffic operation and management. The emerging deep learning-based models provide effective methods to improve prediction accuracy. However, most of the existing models mainly predict the passenger flow on general weekdays or weekends. There are only few studies focusing on predicting the passenger flow on holidays, which is a significantly challenging task for traffic management because of its suddenness and irregularity. To this end, we propose a deep learning-based model named Spatial Temporal Attention Fusion Network comprising a novel Multi-Graph Attention Network, a Conv-Attention Block, and Feature Fusion Block for short-term passenger flow prediction on holidays. The multi-graph attention network is applied to extract the complex spatial dependencies of passenger flow dynamically and the conv-attention block is applied to extract the temporal dependencies of passenger flow fro",
    "path": "papers/22/03/2203.00007.json",
    "total_tokens": 905,
    "translated_title": "基于空时注意力融合网络的城市轨道交通系统节假日短期客流预测",
    "translated_abstract": "对于城市轨道交通系统来说，短期客流预测对交通运营和管理至关重要。近年来，基于深度学习的模型提供了提高预测准确性的有效方法。然而，大部分现有模型主要预测普通工作日或周末的客流，很少有研究关注节假日客流的预测，而这是一个具有突发性和不规律性的重要挑战。为此，我们提出了一种基于深度学习的模型，命名为空时注意力融合网络，包括一个新颖的多图注意力网络、卷积-注意力块和特征融合块，用于节假日短期客流预测。",
    "tldr": "提出了一个基于深度学习的模型，利用空时注意力融合网络来预测城市轨道交通系统节假日短期客流。该模型通过多图注意力网络提取客流的复杂空间依赖性，通过卷积-注意力块提取客流的时间依赖性，并通过特征融合块进行信息融合。这个方法对于交通管理具有重要意义。"
}