{
    "title": "But that's not why: Inference adjustment by interactive prototype revision. (arXiv:2203.10087v2 [cs.LG] UPDATED)",
    "abstract": "Despite significant advances in machine learning, decision-making of artificial agents is still not perfect and often requires post-hoc human interventions. If the prediction of a model relies on unreasonable factors it is desirable to remove their effect. Deep interactive prototype adjustment enables the user to give hints and correct the model's reasoning. In this paper, we demonstrate that prototypical-part models are well suited for this task as their prediction is based on prototypical image patches that can be interpreted semantically by the user. It shows that even correct classifications can rely on unreasonable prototypes that result from confounding variables in a dataset. Hence, we propose simple yet effective interaction schemes for inference adjustment: The user is consulted interactively to identify faulty prototypes. Non-object prototypes can be removed by prototype masking or a custom mode of deselection training. Interactive prototype rejection allows machine learning ",
    "link": "http://arxiv.org/abs/2203.10087",
    "context": "Title: But that's not why: Inference adjustment by interactive prototype revision. (arXiv:2203.10087v2 [cs.LG] UPDATED)\nAbstract: Despite significant advances in machine learning, decision-making of artificial agents is still not perfect and often requires post-hoc human interventions. If the prediction of a model relies on unreasonable factors it is desirable to remove their effect. Deep interactive prototype adjustment enables the user to give hints and correct the model's reasoning. In this paper, we demonstrate that prototypical-part models are well suited for this task as their prediction is based on prototypical image patches that can be interpreted semantically by the user. It shows that even correct classifications can rely on unreasonable prototypes that result from confounding variables in a dataset. Hence, we propose simple yet effective interaction schemes for inference adjustment: The user is consulted interactively to identify faulty prototypes. Non-object prototypes can be removed by prototype masking or a custom mode of deselection training. Interactive prototype rejection allows machine learning ",
    "path": "papers/22/03/2203.10087.json",
    "total_tokens": 948,
    "translated_title": "但这并不是原因：通过交互式原型修订进行推理调整",
    "translated_abstract": "尽管机器学习取得了显著进展，但人工智能决策仍然不完善，通常需要人类后期干预。如果模型的预测依赖于不合理的因素，希望能够消除它们的影响。深度交互式原型调整使用户能够提供提示并纠正模型的推理过程。本文演示了原型部分模型非常适合这项任务，因为它们的预测基于可以由用户进行语义解释的原型图像块。结果表明，即使是正确的分类也可能依赖于数据集中的混淆变量导致的不合理原型。因此，我们提出了简单而有效的推理调整交互方案：用户可以交互地识别错误的原型。非目标原型可以通过原型遮罩或自定义的去选择训练模式进行删除。交互式原型拒绝使机器学习能够调整其推理结果。",
    "tldr": "本文研究了通过交互式原型修订进行推理调整的方法。通过用户提示和纠正模型的推理过程，可以消除模型预测的不合理因素。实验证明，即使是正确的分类也可能依赖于数据集中产生的混淆变量导致的不合理原型。我们提出了简单而有效的交互方案，可以交互地识别并删除错误的原型。",
    "en_tdlr": "This paper investigates the method of inference adjustment by interactive prototype revision. By providing hints and correcting the model's reasoning, it is possible to remove the effect of unreasonable factors in the model's predictions. The experiments demonstrate that even correct classifications can rely on unreasonable prototypes resulting from confounding variables in the dataset. Simple yet effective interaction schemes are proposed to identify and remove faulty prototypes interactively."
}