{
    "title": "Strong posterior contraction rates via Wasserstein dynamics. (arXiv:2203.10754v3 [math.ST] UPDATED)",
    "abstract": "In Bayesian statistics, posterior contraction rates (PCRs) quantify the speed at which the posterior distribution concentrates on arbitrarily small neighborhoods of a true model, in a suitable way, as the sample size goes to infinity. In this paper, we develop a new approach to PCRs, with respect to strong norm distances on parameter spaces of functions. Critical to our approach is the combination of a local Lipschitz-continuity for the posterior distribution with a dynamic formulation of the Wasserstein distance, which allows to set forth an interesting connection between PCRs and some classical problems arising in mathematical analysis, probability and statistics, e.g., Laplace methods for approximating integrals, Sanov's large deviation principles in the Wasserstein distance, rates of convergence of mean Glivenko-Cantelli theorems, and estimates of weighted Poincar\\'e-Wirtinger constants. We first present a theorem on PCRs for a model in the regular infinite-dimensional exponential ",
    "link": "http://arxiv.org/abs/2203.10754",
    "context": "Title: Strong posterior contraction rates via Wasserstein dynamics. (arXiv:2203.10754v3 [math.ST] UPDATED)\nAbstract: In Bayesian statistics, posterior contraction rates (PCRs) quantify the speed at which the posterior distribution concentrates on arbitrarily small neighborhoods of a true model, in a suitable way, as the sample size goes to infinity. In this paper, we develop a new approach to PCRs, with respect to strong norm distances on parameter spaces of functions. Critical to our approach is the combination of a local Lipschitz-continuity for the posterior distribution with a dynamic formulation of the Wasserstein distance, which allows to set forth an interesting connection between PCRs and some classical problems arising in mathematical analysis, probability and statistics, e.g., Laplace methods for approximating integrals, Sanov's large deviation principles in the Wasserstein distance, rates of convergence of mean Glivenko-Cantelli theorems, and estimates of weighted Poincar\\'e-Wirtinger constants. We first present a theorem on PCRs for a model in the regular infinite-dimensional exponential ",
    "path": "papers/22/03/2203.10754.json",
    "total_tokens": 880,
    "translated_title": "强强后验收缩速率的Wasserstein动力学翻译",
    "translated_abstract": "在贝叶斯统计学中，后验收缩速率（PCR）以适当的方式量化后验分布集中在真实模型的任意小邻域中的速度，当样本量趋于无穷时。在本文中，我们开发了一种新的PCR方法，其基于函数参数空间的强范数距离。我们的方法关键是将后验分布的局部Lipschitz连续性与Wasserstein距离的动态形式相结合，这使得PCR与数学分析、概率论和统计学中一些经典问题产生了有趣的联系，例如Laplace方法来近似积分，Wasserstein距离下的Sanov大偏差原理，均值Glivenko-Cantelli定理的收敛速率，以及加权Poincaré-Wirtinger常数的估计。我们首先给出了关于一个正则无限维指数模型的PCR的定理。",
    "tldr": "本文提出了一种新的方法来解决强强后验收缩速率的问题，在函数参数空间中使用动态的Wasserstein距离和后验分布的局部Lipschitz连续性，建立了PCR与数学分析、概率论和统计学中一些经典问题的联系。",
    "en_tdlr": "This paper introduces a new approach to tackling the problem of strong posterior contraction rates by utilizing dynamic Wasserstein distance and local Lipschitz continuity of the posterior distribution, establishing a connection between PCR and classical problems in mathematical analysis, probability theory, and statistics."
}