{
    "title": "Estimating Conditional Average Treatment Effects with Missing Treatment Information. (arXiv:2203.01422v2 [stat.ML] UPDATED)",
    "abstract": "Estimating conditional average treatment effects (CATE) is challenging, especially when treatment information is missing. Although this is a widespread problem in practice, CATE estimation with missing treatments has received little attention. In this paper, we analyze CATE estimation in the setting with missing treatments where unique challenges arise in the form of covariate shifts. We identify two covariate shifts in our setting: (i) a covariate shift between the treated and control population; and (ii) a covariate shift between the observed and missing treatment population. We first theoretically show the effect of these covariate shifts by deriving a generalization bound for estimating CATE in our setting with missing treatments. Then, motivated by our bound, we develop the missing treatment representation network (MTRNet), a novel CATE estimation algorithm that learns a balanced representation of covariates using domain adaptation. By using balanced representations, MTRNet provid",
    "link": "http://arxiv.org/abs/2203.01422",
    "context": "Title: Estimating Conditional Average Treatment Effects with Missing Treatment Information. (arXiv:2203.01422v2 [stat.ML] UPDATED)\nAbstract: Estimating conditional average treatment effects (CATE) is challenging, especially when treatment information is missing. Although this is a widespread problem in practice, CATE estimation with missing treatments has received little attention. In this paper, we analyze CATE estimation in the setting with missing treatments where unique challenges arise in the form of covariate shifts. We identify two covariate shifts in our setting: (i) a covariate shift between the treated and control population; and (ii) a covariate shift between the observed and missing treatment population. We first theoretically show the effect of these covariate shifts by deriving a generalization bound for estimating CATE in our setting with missing treatments. Then, motivated by our bound, we develop the missing treatment representation network (MTRNet), a novel CATE estimation algorithm that learns a balanced representation of covariates using domain adaptation. By using balanced representations, MTRNet provid",
    "path": "papers/22/03/2203.01422.json",
    "total_tokens": 970,
    "translated_title": "缺失治疗信息的条件平均处理效应估计",
    "translated_abstract": "估计条件平均处理效应 (CATE) 是具有挑战性的，特别是在治疗信息缺失的情况下。尽管在实践中这是一个普遍存在的问题，但缺失治疗的 CATE 估计却受到了很少关注。在本文中，我们分析了缺失治疗情况下的 CATE 估计，在这种情况下存在独特的挑战，例如协变量偏移。我们认定了我们的情况中存在两种协变量转移：(i) 治疗组和对照组之间的协变量转移，以及(ii) 观察到的治疗组和缺失治疗组之间的协变量转移。我们首先从理论上证明了这些协变量转移的影响，通过为我们的缺失治疗情况下的 CATE 估计导出一个泛化界限。然后，受到我们的界限的启发，我们开发了缺失治疗表示网络 (MTRNet)，这是一种新颖的 CATE 估计算法，它使用域自适应学习协变量的平衡表示。通过使用平衡的表示方法，MTRNet提供了",
    "tldr": "本文研究了条件平均处理效应 (CATE) 的估计问题，在缺失治疗信息的情况下，提出了缺失治疗表示网络 (MTRNet)，通过域自适应学习协变量的平衡表示来解决协变量转移问题。",
    "en_tdlr": "This paper addresses the challenging problem of estimating conditional average treatment effects (CATE) with missing treatment information, and proposes the missing treatment representation network (MTRNet), which learns a balanced representation of covariates using domain adaptation to overcome the issue of covariate shift."
}