{
    "title": "MetaDT: Meta Decision Tree with Class Hierarchy for Interpretable Few-Shot Learning. (arXiv:2203.01482v2 [cs.LG] UPDATED)",
    "abstract": "Few-Shot Learning (FSL) is a challenging task, which aims to recognize novel classes with few examples. Recently, lots of methods have been proposed from the perspective of meta-learning and representation learning. However, few works focus on the interpretability of FSL decision process. In this paper, we take a step towards the interpretable FSL by proposing a novel meta-learning based decision tree framework, namely, MetaDT. In particular, the FSL interpretability is achieved from two aspects, i.e., a concept aspect and a visual aspect. On the concept aspect, we first introduce a tree-like concept hierarchy as FSL prior. Then, resorting to the prior, we split each few-shot task to a set of subtasks with different concept levels and then perform class prediction via a model of decision tree. The advantage of such design is that a sequence of high-level concept decisions that lead up to a final class prediction can be obtained, which clarifies the FSL decision process. On the visual a",
    "link": "http://arxiv.org/abs/2203.01482",
    "context": "Title: MetaDT: Meta Decision Tree with Class Hierarchy for Interpretable Few-Shot Learning. (arXiv:2203.01482v2 [cs.LG] UPDATED)\nAbstract: Few-Shot Learning (FSL) is a challenging task, which aims to recognize novel classes with few examples. Recently, lots of methods have been proposed from the perspective of meta-learning and representation learning. However, few works focus on the interpretability of FSL decision process. In this paper, we take a step towards the interpretable FSL by proposing a novel meta-learning based decision tree framework, namely, MetaDT. In particular, the FSL interpretability is achieved from two aspects, i.e., a concept aspect and a visual aspect. On the concept aspect, we first introduce a tree-like concept hierarchy as FSL prior. Then, resorting to the prior, we split each few-shot task to a set of subtasks with different concept levels and then perform class prediction via a model of decision tree. The advantage of such design is that a sequence of high-level concept decisions that lead up to a final class prediction can be obtained, which clarifies the FSL decision process. On the visual a",
    "path": "papers/22/03/2203.01482.json",
    "total_tokens": 993,
    "translated_title": "MetaDT: 使用类层次结构的元决策树进行可解释的少样本学习",
    "translated_abstract": "少样本学习(FSL)是一个具有挑战性的任务，旨在使用少量示例识别新类别。最近，许多方法从元学习和表示学习的角度提出。然而，很少有研究关注FSL决策过程的可解释性。本文提出了一种新颖的基于元学习的决策树框架MetaDT，从可解释的FSL角度迈出了一步。具体而言，FSL的可解释性从概念和视觉两个方面实现。在概念方面，我们首先引入了类似树状的概念层次结构作为FSL的先验知识。然后，根据先验，我们将每个少样本任务分割为一组具有不同概念层次的子任务，然后通过决策树模型进行类别预测。这种设计的优势在于可以获得一系列导致最终类别预测的高级概念决策，从而明确FSL的决策过程。在视觉方面...",
    "tldr": "本论文提出了一种名为MetaDT的新颖元学习决策树框架，用于可解释的少样本学习任务。通过引入概念层次结构和决策树模型，实现了FSL决策过程的可解释性。从而在使用少量示例识别新类别时，提供了一个明确的决策过程。",
    "en_tdlr": "This paper proposes a novel meta-learning decision tree framework called MetaDT for interpretable few-shot learning tasks. The interpretability of FSL decision process is achieved by introducing concept hierarchy and decision tree model, providing a clear decision-making process in identifying new classes with few examples."
}