{
    "title": "Locally Adaptive Algorithms for Multiple Testing with Network Structure, with Application to Genome-Wide Association Studies. (arXiv:2203.11461v4 [stat.ME] UPDATED)",
    "abstract": "Linkage analysis has provided valuable insights to the GWAS studies, particularly in revealing that SNPs in linkage disequilibrium (LD) can jointly influence disease phenotypes. However, the potential of LD network data has often been overlooked or underutilized in the literature. In this paper, we propose a locally adaptive structure learning algorithm (LASLA) that provides a principled and generic framework for incorporating network data or multiple samples of auxiliary data from related source domains; possibly in different dimensions/structures and from diverse populations. LASLA employs a $p$-value weighting approach, utilizing structural insights to assign data-driven weights to individual test points. Theoretical analysis shows that LASLA can asymptotically control FDR with independent or weakly dependent primary statistics, and achieve higher power when the network data is informative. Efficiency again of LASLA is illustrated through various synthetic experiments and an applica",
    "link": "http://arxiv.org/abs/2203.11461",
    "context": "Title: Locally Adaptive Algorithms for Multiple Testing with Network Structure, with Application to Genome-Wide Association Studies. (arXiv:2203.11461v4 [stat.ME] UPDATED)\nAbstract: Linkage analysis has provided valuable insights to the GWAS studies, particularly in revealing that SNPs in linkage disequilibrium (LD) can jointly influence disease phenotypes. However, the potential of LD network data has often been overlooked or underutilized in the literature. In this paper, we propose a locally adaptive structure learning algorithm (LASLA) that provides a principled and generic framework for incorporating network data or multiple samples of auxiliary data from related source domains; possibly in different dimensions/structures and from diverse populations. LASLA employs a $p$-value weighting approach, utilizing structural insights to assign data-driven weights to individual test points. Theoretical analysis shows that LASLA can asymptotically control FDR with independent or weakly dependent primary statistics, and achieve higher power when the network data is informative. Efficiency again of LASLA is illustrated through various synthetic experiments and an applica",
    "path": "papers/22/03/2203.11461.json",
    "total_tokens": 916,
    "translated_title": "基于网络结构的局部自适应多重检验算法，及其在全基因组关联研究中的应用",
    "translated_abstract": "链接分析在全基因组关联研究中起着重要作用，特别是在揭示与疾病表型相关的连锁不平衡（LD）的SNP共同影响方面。然而，LD网络数据的潜力在文献中往往被忽视或未充分利用。在本文中，我们提出了一个局部自适应结构学习算法（LASLA），为整合网络数据或来自相关源域的多个样本的辅助数据提供了一个有原则且通用的框架；可能具有不同的维度/结构和不同的人群。LASLA采用$p$值加权方法，利用结构洞察力为各个检验点分配数据驱动的权重。理论分析表明，当主要统计量独立或弱相关时，LASLA可以渐近地控制FDR，并在网络数据具有信息量时实现更高的功效。通过各种合成实验和一个应用案例，展示了LASLA的效率。",
    "tldr": "本文提出了一种基于网络结构的局部自适应结构学习算法，可将LD网络数据和多个样本的辅助数据整合起来，通过数据驱动的权重分配方法实现对多重检验的控制，并在网络数据具有信息量时具有更高的功效。"
}