{
    "title": "Reactive Motion Generation on Learned Riemannian Manifolds. (arXiv:2203.07761v2 [cs.RO] UPDATED)",
    "abstract": "In recent decades, advancements in motion learning have enabled robots to acquire new skills and adapt to unseen conditions in both structured and unstructured environments. In practice, motion learning methods capture relevant patterns and adjust them to new conditions such as dynamic obstacle avoidance or variable targets. In this paper, we investigate the robot motion learning paradigm from a Riemannian manifold perspective. We argue that Riemannian manifolds may be learned via human demonstrations in which geodesics are natural motion skills. The geodesics are generated using a learned Riemannian metric produced by our novel variational autoencoder (VAE), which is especially intended to recover full-pose end-effector states and joint space configurations. In addition, we propose a technique for facilitating on-the-fly end-effector/multiple-limb obstacle avoidance by reshaping the learned manifold using an obstacle-aware ambient metric. The motion generated using these geodesics may",
    "link": "http://arxiv.org/abs/2203.07761",
    "context": "Title: Reactive Motion Generation on Learned Riemannian Manifolds. (arXiv:2203.07761v2 [cs.RO] UPDATED)\nAbstract: In recent decades, advancements in motion learning have enabled robots to acquire new skills and adapt to unseen conditions in both structured and unstructured environments. In practice, motion learning methods capture relevant patterns and adjust them to new conditions such as dynamic obstacle avoidance or variable targets. In this paper, we investigate the robot motion learning paradigm from a Riemannian manifold perspective. We argue that Riemannian manifolds may be learned via human demonstrations in which geodesics are natural motion skills. The geodesics are generated using a learned Riemannian metric produced by our novel variational autoencoder (VAE), which is especially intended to recover full-pose end-effector states and joint space configurations. In addition, we propose a technique for facilitating on-the-fly end-effector/multiple-limb obstacle avoidance by reshaping the learned manifold using an obstacle-aware ambient metric. The motion generated using these geodesics may",
    "path": "papers/22/03/2203.07761.json",
    "total_tokens": 904,
    "translated_title": "在学习的黎曼流形上进行反应式运动生成",
    "translated_abstract": "在最近几十年中，运动学习的进展使得机器人能够在结构化和非结构化环境中获得新的技能并适应未知条件。实践中，运动学习方法捕捉相关模式并调整它们以适应动态避障或可变目标等新条件。在本文中，我们从黎曼流形的角度研究机器人运动学习范式。我们认为通过人类示教可以学习到黎曼流形，其中测地线是自然的运动技能。通过我们的新型变分自编码器（VAE）生成使用学习到的黎曼度量产生的测地线，该自编码器特别用于恢复全位姿末端执行器状态和关节空间配置。此外，我们提出了一种通过重塑学习到的流形来促进末端执行器/多肢体避障的技术，该技术使用了一个能够感知障碍物的环境度量。使用这些测地线生成的运动可以...",
    "tldr": "本文从黎曼流形的角度研究了机器人运动学习，通过学习黎曼度量和使用测地线生成的运动能适应新的环境条件，并通过调整学习到的流形实现避障功能。",
    "en_tdlr": "This paper investigates robot motion learning from the perspective of Riemannian manifolds. The motion generated using the learned Riemannian metric and geodesics can adapt to new environmental conditions and achieve obstacle avoidance by reshaping the learned manifold."
}