{
    "title": "AI Autonomy : Self-Initiated Open-World Continual Learning and Adaptation. (arXiv:2203.08994v3 [cs.AI] UPDATED)",
    "abstract": "As more and more AI agents are used in practice, it is time to think about how to make these agents fully autonomous so that they can (1) learn by themselves continually in a self-motivated and self-initiated manner rather than being retrained offline periodically on the initiation of human engineers and (2) accommodate or adapt to unexpected or novel circumstances. As the real-world is an open environment that is full of unknowns or novelties, the capabilities of detecting novelties, characterizing them, accommodating/adapting to them, gathering ground-truth training data and incrementally learning the unknowns/novelties become critical in making the AI agent more and more knowledgeable, powerful and self-sustainable over time. The key challenge here is how to automate the process so that it is carried out continually on the agent's own initiative and through its own interactions with humans, other agents and the environment just like human on-the-job learning. This paper proposes a f",
    "link": "http://arxiv.org/abs/2203.08994",
    "context": "Title: AI Autonomy : Self-Initiated Open-World Continual Learning and Adaptation. (arXiv:2203.08994v3 [cs.AI] UPDATED)\nAbstract: As more and more AI agents are used in practice, it is time to think about how to make these agents fully autonomous so that they can (1) learn by themselves continually in a self-motivated and self-initiated manner rather than being retrained offline periodically on the initiation of human engineers and (2) accommodate or adapt to unexpected or novel circumstances. As the real-world is an open environment that is full of unknowns or novelties, the capabilities of detecting novelties, characterizing them, accommodating/adapting to them, gathering ground-truth training data and incrementally learning the unknowns/novelties become critical in making the AI agent more and more knowledgeable, powerful and self-sustainable over time. The key challenge here is how to automate the process so that it is carried out continually on the agent's own initiative and through its own interactions with humans, other agents and the environment just like human on-the-job learning. This paper proposes a f",
    "path": "papers/22/03/2203.08994.json",
    "total_tokens": 923,
    "tldr": "论文提出了自主人工智能的概念，旨在解决如何自发启动的开放世界持续学习和适应，使AI代理更加自我可持续和强大。"
}