{
    "title": "DeepAutoPIN: An automorphism orbits based deep neural network for characterizing the organizational diversity of protein interactomes across the tree of life. (arXiv:2203.00999v2 [q-bio.MN] UPDATED)",
    "abstract": "The enormous diversity of life forms thriving in drastically different environmental milieus involves a complex interplay among constituent proteins interacting with each other. However, the organizational principles characterizing the evolution of protein interaction networks (PINs) across the tree of life are largely unknown. Here we study 4,738 PINs belonging to 16 phyla to discover phyla-specific architectural features and examine if there are some evolutionary constraints imposed on the networks' topologies. We utilized positional information of a network's nodes by normalizing the frequencies of automorphism orbits appearing in graphlets of sizes 2-5. We report that orbit usage profiles (OUPs) of networks belonging to the three domains of life are contrastingly different not only at the domain level but also at the scale of phyla. Integrating the information related to protein families, domains, subcellular location, gene ontology, and pathways, our results indicate that wiring p",
    "link": "http://arxiv.org/abs/2203.00999",
    "context": "Title: DeepAutoPIN: An automorphism orbits based deep neural network for characterizing the organizational diversity of protein interactomes across the tree of life. (arXiv:2203.00999v2 [q-bio.MN] UPDATED)\nAbstract: The enormous diversity of life forms thriving in drastically different environmental milieus involves a complex interplay among constituent proteins interacting with each other. However, the organizational principles characterizing the evolution of protein interaction networks (PINs) across the tree of life are largely unknown. Here we study 4,738 PINs belonging to 16 phyla to discover phyla-specific architectural features and examine if there are some evolutionary constraints imposed on the networks' topologies. We utilized positional information of a network's nodes by normalizing the frequencies of automorphism orbits appearing in graphlets of sizes 2-5. We report that orbit usage profiles (OUPs) of networks belonging to the three domains of life are contrastingly different not only at the domain level but also at the scale of phyla. Integrating the information related to protein families, domains, subcellular location, gene ontology, and pathways, our results indicate that wiring p",
    "path": "papers/22/03/2203.00999.json",
    "total_tokens": 1034,
    "translated_title": "使用基于自同构轨道的深度神经网络对整个生命起源树中的蛋白互作组织多样性进行表征",
    "translated_abstract": "在极不同的环境中繁盛的生命形式的巨大多样性涉及到相互作用的组分蛋白之间的复杂相互作用。然而，表征蛋白质相互作用网络（PINs）在整个生命起源树中的演化的组织原则目前还大部分不明确。本文研究了属于16个门的4,738个PINs，以发现门特有的结构特征，并检查网络拓扑结构上是否存在一些演化约束。我们利用了网络节点的位置信息，通过对大小为2-5的图形中出现的自同构轨道的频率进行归一化来研究。我们报告，生命的三个域所属网络的轨道使用概况（OUPs）不仅在域层面上有明显差异，而且在门的规模上也有明显差异。通过整合与蛋白家族、结构域、亚细胞定位、基因本体论和通路相关的信息，我们的结果表明，连接模式可能是PINs在进化过程中的一个重要影响因素。",
    "tldr": "本研究利用基于自同构轨道的深度神经网络研究了整个生命起源树中的蛋白互作组织多样性，并发现不同生命域和门属网络的轨道使用概况存在明显差异。这一研究结果对于了解蛋白质相互作用网络的演化具有重要意义。",
    "en_tdlr": "This study used a deep neural network based on automorphism orbits to characterize the organizational diversity of protein interactomes across the tree of life and found significant differences in orbit usage profiles between networks belonging to different domains and phyla. These findings are important for understanding the evolution of protein interaction networks."
}