{
    "title": "Quantum Local Differential Privacy and Quantum Statistical Query Model. (arXiv:2203.03591v2 [quant-ph] UPDATED)",
    "abstract": "Quantum statistical queries provide a theoretical framework for investigating the computational power of a learner with limited quantum resources. This model is particularly relevant in the current context, where available quantum devices are subject to severe noise and have limited quantum memory. On the other hand, the framework of quantum differential privacy demonstrates that noise can, in some cases, benefit the computation, enhancing robustness and statistical security. In this work, we establish an equivalence between quantum statistical queries and quantum differential privacy in the local model, extending a celebrated classical result to the quantum setting. Furthermore, we derive strong data processing inequalities for the quantum relative entropy under local differential privacy and apply this result to the task of asymmetric hypothesis testing with restricted measurements. Finally, we consider the task of quantum multi-party computation under local differential privacy. As ",
    "link": "http://arxiv.org/abs/2203.03591",
    "context": "Title: Quantum Local Differential Privacy and Quantum Statistical Query Model. (arXiv:2203.03591v2 [quant-ph] UPDATED)\nAbstract: Quantum statistical queries provide a theoretical framework for investigating the computational power of a learner with limited quantum resources. This model is particularly relevant in the current context, where available quantum devices are subject to severe noise and have limited quantum memory. On the other hand, the framework of quantum differential privacy demonstrates that noise can, in some cases, benefit the computation, enhancing robustness and statistical security. In this work, we establish an equivalence between quantum statistical queries and quantum differential privacy in the local model, extending a celebrated classical result to the quantum setting. Furthermore, we derive strong data processing inequalities for the quantum relative entropy under local differential privacy and apply this result to the task of asymmetric hypothesis testing with restricted measurements. Finally, we consider the task of quantum multi-party computation under local differential privacy. As ",
    "path": "papers/22/03/2203.03591.json",
    "total_tokens": 908,
    "translated_title": "量子局部差分隐私和量子统计查询模型",
    "translated_abstract": "量子统计查询提供了一个理论框架，用于研究有限量子资源的学习者的计算能力。在当前的背景下，这个模型特别相关，因为可用的量子设备受到严重噪声和限制量子存储的影响。另一方面，量子差分隐私的框架表明，在某些情况下，噪声可能有益于计算，增强鲁棒性和统计安全性。在这项工作中，我们建立了量子统计查询和局部差分隐私之间的等价关系，将一个著名的经典结果推广到量子设置中。此外，我们在局部差分隐私下推导出了量子相对熵的强数据处理不等式，并将此结果应用于受限测量的不对称假设测试任务。最后，我们考虑了在局部差分隐私下的量子多方计算任务。",
    "tldr": "本文将量子统计查询和量子差分隐私在局部模型下进行了等价建立，扩展了经典结果到量子领域。在局部差分隐私下推导了量子相对熵的强数据处理不等式，并将其应用于受限测量的不对称假设测试任务。此外，还讨论了在局部差分隐私下的量子多方计算任务。",
    "en_tdlr": "This paper establishes an equivalence between quantum statistical queries and quantum differential privacy in the local model, extending a celebrated classical result to the quantum setting. Strong data processing inequalities for the quantum relative entropy under local differential privacy are derived and applied to asymmetric hypothesis testing with restricted measurements. Furthermore, the task of quantum multi-party computation under local differential privacy is considered."
}