{
    "title": "On the Fragility of the Basis on the Hamilton-Jacobi-Bellman Equation in Economic Dynamics. (arXiv:2203.10595v3 [econ.TH] UPDATED)",
    "abstract": "In this paper, we provide an example of the optimal growth model in which there exist infinitely many solutions to the Hamilton-Jacobi-Bellman equation but the value function does not satisfy this equation. We consider the cause of this phenomenon, and find that the lack of a solution to the original problem is crucial. We show that under several conditions, there exists a solution to the original problem if and only if the value function solves the Hamilton-Jacobi-Bellman equation. Moreover, in this case, the value function is the unique nondecreasing concave solution to the Hamilton-Jacobi-Bellman equation. We also show that without our conditions, this uniqueness result does not hold.",
    "link": "http://arxiv.org/abs/2203.10595",
    "context": "Title: On the Fragility of the Basis on the Hamilton-Jacobi-Bellman Equation in Economic Dynamics. (arXiv:2203.10595v3 [econ.TH] UPDATED)\nAbstract: In this paper, we provide an example of the optimal growth model in which there exist infinitely many solutions to the Hamilton-Jacobi-Bellman equation but the value function does not satisfy this equation. We consider the cause of this phenomenon, and find that the lack of a solution to the original problem is crucial. We show that under several conditions, there exists a solution to the original problem if and only if the value function solves the Hamilton-Jacobi-Bellman equation. Moreover, in this case, the value function is the unique nondecreasing concave solution to the Hamilton-Jacobi-Bellman equation. We also show that without our conditions, this uniqueness result does not hold.",
    "path": "papers/22/03/2203.10595.json",
    "total_tokens": 860,
    "translated_title": "关于经济动态中哈密顿-雅可比-贝尔曼方程基础脆弱性的探讨",
    "translated_abstract": "本文提供了一个最优增长模型的例子，其中存在无限多个哈密顿-雅可比-贝尔曼方程的解，但价值函数却不满足该方程。我们探究了这种现象的原因，并发现原问题无解是关键所在。我们证明了在若干条件下，原问题存在解当且仅当价值函数满足哈密顿-雅可比-贝尔曼方程。此外，在这种情况下，价值函数是哈密顿-雅可比-贝尔曼方程的唯一非降凹解。我们还证明了在没有我们条件的情况下，这种唯一性结果是不成立的。",
    "tldr": "本文讨论了经济动态中的哈密顿-雅可比-贝尔曼方程问题，发现当原问题无解时会出现价值函数不满足该方程的现象，并在特定条件下证明了原问题存在解当且仅当价值函数满足该方程。此外，价值函数是哈密顿-雅可比-贝尔曼方程的唯一非降凹解。",
    "en_tdlr": "This paper discusses the fragility of the basis on the Hamilton-Jacobi-Bellman equation in economic dynamics, showing that the lack of a solution to the original problem is crucial and that under specific conditions, the original problem exists if and only if the value function satisfies the Hamilton-Jacobi-Bellman equation. Additionally, the value function is the unique nondecreasing concave solution to the Hamilton-Jacobi-Bellman equation."
}