{
    "title": "Learning Group Importance using the Differentiable Hypergeometric Distribution. (arXiv:2203.01629v5 [cs.LG] UPDATED)",
    "abstract": "Partitioning a set of elements into subsets of a priori unknown sizes is essential in many applications. These subset sizes are rarely explicitly learned - be it the cluster sizes in clustering applications or the number of shared versus independent generative latent factors in weakly-supervised learning. Probability distributions over correct combinations of subset sizes are non-differentiable due to hard constraints, which prohibit gradient-based optimization. In this work, we propose the differentiable hypergeometric distribution. The hypergeometric distribution models the probability of different group sizes based on their relative importance. We introduce reparameterizable gradients to learn the importance between groups and highlight the advantage of explicitly learning the size of subsets in two typical applications: weakly-supervised learning and clustering. In both applications, we outperform previous approaches, which rely on suboptimal heuristics to model the unknown size of",
    "link": "http://arxiv.org/abs/2203.01629",
    "context": "Title: Learning Group Importance using the Differentiable Hypergeometric Distribution. (arXiv:2203.01629v5 [cs.LG] UPDATED)\nAbstract: Partitioning a set of elements into subsets of a priori unknown sizes is essential in many applications. These subset sizes are rarely explicitly learned - be it the cluster sizes in clustering applications or the number of shared versus independent generative latent factors in weakly-supervised learning. Probability distributions over correct combinations of subset sizes are non-differentiable due to hard constraints, which prohibit gradient-based optimization. In this work, we propose the differentiable hypergeometric distribution. The hypergeometric distribution models the probability of different group sizes based on their relative importance. We introduce reparameterizable gradients to learn the importance between groups and highlight the advantage of explicitly learning the size of subsets in two typical applications: weakly-supervised learning and clustering. In both applications, we outperform previous approaches, which rely on suboptimal heuristics to model the unknown size of",
    "path": "papers/22/03/2203.01629.json",
    "total_tokens": 867,
    "translated_title": "使用可微分超几何分布进行小组重要性学习",
    "translated_abstract": "在许多应用程序中，将一组元素划分为先验未知大小的子集是必要的。这些子集大小很少明确学习 - 无论是聚类应用程序中的簇大小还是弱监督学习中的共享与独立生成潜在因素的数量。由于硬性约束条件，正确子集大小的概率分布是不可微分的，这禁止了基于梯度的优化。在这项工作中，我们提出了可微分超几何分布。超几何分布基于它们的相对重要性模拟不同组大小的概率。我们引入可重参数化梯度来学习小组之间的重要性，并强调在两个典型应用程序中显式学习子集大小的优点：弱监督学习和聚类。在这两个应用程序中，我们优于依赖于次优启发式模拟未知大小的先前方法。",
    "tldr": "本文提出了不同iable hypergeometric distribution，使用重要性学习方法来解决在许多应用程序中将一组元素划分为先验未知大小的子集的问题，并在弱监督学习和聚类方面优于以前的方法。",
    "en_tdlr": "This paper proposes a differentiable hypergeometric distribution that uses importance learning to solve the problem of partitioning a set of elements into subsets of a priori unknown sizes in many applications, and outperforms previous methods in weakly-supervised learning and clustering by explicitly learning the size of subsets."
}