{
    "title": "Semantic-Fused Multi-Granularity Cross-City Traffic Prediction",
    "abstract": "arXiv:2302.11774v2 Announce Type: replace  Abstract: Accurate traffic prediction is essential for effective urban management and the improvement of transportation efficiency. Recently, data-driven traffic prediction methods have been widely adopted, with better performance than traditional approaches. However, they often require large amounts of data for effective training, which becomes challenging given the prevalence of data scarcity in regions with inadequate sensing infrastructures. To address this issue, we propose a Semantic-Fused Multi-Granularity Transfer Learning (SFMGTL) model to achieve knowledge transfer across cities with fused semantics at different granularities. In detail, we design a semantic fusion module to fuse various semantics while conserving static spatial dependencies via reconstruction losses. Then, a fused graph is constructed based on node features through graph structure learning. Afterwards, we implement hierarchical node clustering to generate graphs wit",
    "link": "https://arxiv.org/abs/2302.11774",
    "context": "Title: Semantic-Fused Multi-Granularity Cross-City Traffic Prediction\nAbstract: arXiv:2302.11774v2 Announce Type: replace  Abstract: Accurate traffic prediction is essential for effective urban management and the improvement of transportation efficiency. Recently, data-driven traffic prediction methods have been widely adopted, with better performance than traditional approaches. However, they often require large amounts of data for effective training, which becomes challenging given the prevalence of data scarcity in regions with inadequate sensing infrastructures. To address this issue, we propose a Semantic-Fused Multi-Granularity Transfer Learning (SFMGTL) model to achieve knowledge transfer across cities with fused semantics at different granularities. In detail, we design a semantic fusion module to fuse various semantics while conserving static spatial dependencies via reconstruction losses. Then, a fused graph is constructed based on node features through graph structure learning. Afterwards, we implement hierarchical node clustering to generate graphs wit",
    "path": "papers/23/02/2302.11774.json",
    "total_tokens": 798,
    "translated_title": "语义融合的多粒度跨城市交通预测",
    "translated_abstract": "精确的交通预测对有效城市管理和提高交通效率至关重要。最近，基于数据驱动的交通预测方法得到了广泛采用，表现优于传统方法。然而，它们通常需要大量数据进行有效训练，鉴于传感基础设施不足的地区普遍存在数据稀缺问题，这变得具有挑战性。为解决这一问题，我们提出了一种语义融合的多粒度迁移学习（SFMGTL）模型，实现在具有不同粒度的融合语义的城市之间进行知识转移。具体而言，我们设计了一个语义融合模块，通过重构损失融合各种语义，同时保留静态空间依赖性。然后，基于节点特征构建了一个融合图，并通过图结构学习实现层次节点聚类，生成图。",
    "tldr": "提出了一种语义融合的多粒度迁移学习模型，能够在具有不同粒度的城市之间实现交通预测知识转移",
    "en_tdlr": "Proposed a Semantic-Fused Multi-Granularity Transfer Learning model for transferring traffic prediction knowledge across cities with different granularities."
}