{
    "title": "Deep-OSG: Deep Learning of Operators in Semigroup. (arXiv:2302.03358v2 [cs.LG] UPDATED)",
    "abstract": "This paper proposes a novel deep learning approach for learning operators in semigroup, with applications to modeling unknown autonomous dynamical systems using time series data collected at varied time lags. It is a sequel to the previous flow map learning (FML) works [T. Qin, K. Wu, and D. Xiu, J. Comput. Phys., 395:620--635, 2019], [K. Wu and D. Xiu, J. Comput. Phys., 408:109307, 2020], and [Z. Chen, V. Churchill, K. Wu, and D. Xiu, J. Comput. Phys., 449:110782, 2022], which focused on learning single evolution operator with a fixed time step. This paper aims to learn a family of evolution operators with variable time steps, which constitute a semigroup for an autonomous system. The semigroup property is very crucial and links the system's evolutionary behaviors across varying time scales, but it was not considered in the previous works. We propose for the first time a framework of embedding the semigroup property into the data-driven learning process, through a novel neural network",
    "link": "http://arxiv.org/abs/2302.03358",
    "context": "Title: Deep-OSG: Deep Learning of Operators in Semigroup. (arXiv:2302.03358v2 [cs.LG] UPDATED)\nAbstract: This paper proposes a novel deep learning approach for learning operators in semigroup, with applications to modeling unknown autonomous dynamical systems using time series data collected at varied time lags. It is a sequel to the previous flow map learning (FML) works [T. Qin, K. Wu, and D. Xiu, J. Comput. Phys., 395:620--635, 2019], [K. Wu and D. Xiu, J. Comput. Phys., 408:109307, 2020], and [Z. Chen, V. Churchill, K. Wu, and D. Xiu, J. Comput. Phys., 449:110782, 2022], which focused on learning single evolution operator with a fixed time step. This paper aims to learn a family of evolution operators with variable time steps, which constitute a semigroup for an autonomous system. The semigroup property is very crucial and links the system's evolutionary behaviors across varying time scales, but it was not considered in the previous works. We propose for the first time a framework of embedding the semigroup property into the data-driven learning process, through a novel neural network",
    "path": "papers/23/02/2302.03358.json",
    "total_tokens": 914,
    "translated_title": "Deep-OSG：半群中的运算符的深度学习方法",
    "translated_abstract": "本文提出了一种新颖的深度学习方法，用于学习半群中的运算符，并应用于使用在不同时间滞后下收集的时间序列数据对未知自主动力系统进行建模。本文是之前流图学习(FML)工作的续集，该工作主要集中在学习具有固定时间步长的单一演化算符。本文旨在学习一族具有可变时间步长的演化算符，构成自主系统的半群。半群性质对于联系系统在不同时间尺度上的演化行为非常重要，但在以前的研究中没有考虑到这一点。我们首次提出了将半群性质嵌入数据驱动学习过程的框架，通过一种新颖的神经网络",
    "tldr": "本文提出了一种深度学习方法，用于学习半群中的运算符，可以将未知自主动力系统建模为时间序列数据，在不同时间滞后下收集。这种方法能够学习具有可变时间步长的演化算符，构成自主系统的半群。"
}