{
    "title": "Performance Limits of a Deep Learning-Enabled Text Semantic Communication under Interference. (arXiv:2302.14702v2 [eess.SP] UPDATED)",
    "abstract": "A deep learning (DL)-enabled semantic communication (SemCom) has emerged as a 6G enabler while promising to minimize power usage, bandwidth consumption, and transmission delay by minimizing irrelevant information transmission. However, the benefits of such a semantic-centric design can be limited by radio frequency interference (RFI) that causes substantial semantic noise. The impact of semantic noise due to interference can be alleviated using an interference-resistant and robust (IR$^2$) SemCom design. Nevertheless, no such design exists yet. To shed light on this knowledge gap and stimulate fundamental research on IR$^2$ SemCom, the performance limits of a text SemCom system named DeepSC are studied in the presence of (multi-interferer) RFI. By introducing a principled probabilistic framework for SemCom, we show that DeepSC produces semantically irrelevant sentences as the power of (multi-interferer) RFI gets very large. We also derive DeepSC's practical limits and a lower bound on ",
    "link": "http://arxiv.org/abs/2302.14702",
    "context": "Title: Performance Limits of a Deep Learning-Enabled Text Semantic Communication under Interference. (arXiv:2302.14702v2 [eess.SP] UPDATED)\nAbstract: A deep learning (DL)-enabled semantic communication (SemCom) has emerged as a 6G enabler while promising to minimize power usage, bandwidth consumption, and transmission delay by minimizing irrelevant information transmission. However, the benefits of such a semantic-centric design can be limited by radio frequency interference (RFI) that causes substantial semantic noise. The impact of semantic noise due to interference can be alleviated using an interference-resistant and robust (IR$^2$) SemCom design. Nevertheless, no such design exists yet. To shed light on this knowledge gap and stimulate fundamental research on IR$^2$ SemCom, the performance limits of a text SemCom system named DeepSC are studied in the presence of (multi-interferer) RFI. By introducing a principled probabilistic framework for SemCom, we show that DeepSC produces semantically irrelevant sentences as the power of (multi-interferer) RFI gets very large. We also derive DeepSC's practical limits and a lower bound on ",
    "path": "papers/23/02/2302.14702.json",
    "total_tokens": 890,
    "translated_title": "一个使用深度学习的文本语义通信在干扰环境下的性能限制",
    "translated_abstract": "深度学习(Deep Learning)技术在语义通信(SemCom)中的应用成为了6G的一种推动因素，并承诺通过最小化无关信息传输来降低功耗、带宽消耗和传输延迟。然而，这种以语义为中心的设计的好处可能受到无线电频率干扰(RFI)造成的显著语义噪声的限制。为了解决这一知识空白并促进关于干扰鲁棒性的SemCom基础研究，我们研究了一种名为DeepSC的文本SemCom系统在存在(多干扰源) RFI的情况下的性能限制。通过引入一个基于概率的框架来进行SemCom，我们发现DeepSC在(多干扰源) RFI功率变得非常大时产生语义上无关的句子。我们还推导出DeepSC的实际限制和一个下限。",
    "tldr": "这项研究探讨了在干扰环境下深度学习的文本语义通信系统的性能限制，发现当干扰信号强度增大时，该系统会产生语义上无关的句子。",
    "en_tdlr": "This study investigates the performance limits of a deep learning-based text semantic communication system under interference, revealing that the system generates semantically irrelevant sentences as the interference signal becomes stronger."
}