{
    "title": "Neural Insights for Digital Marketing Content Design. (arXiv:2302.01416v3 [cs.LG] UPDATED)",
    "abstract": "In digital marketing, experimenting with new website content is one of the key levers to improve customer engagement. However, creating successful marketing content is a manual and time-consuming process that lacks clear guiding principles. This paper seeks to close the loop between content creation and online experimentation by offering marketers AI-driven actionable insights based on historical data to improve their creative process. We present a neural-network-based system that scores and extracts insights from a marketing content design, namely, a multimodal neural network predicts the attractiveness of marketing contents, and a post-hoc attribution method generates actionable insights for marketers to improve their content in specific marketing locations. Our insights not only point out the advantages and drawbacks of a given current content, but also provide design recommendations based on historical data. We show that our scoring model and insights work well both quantitatively ",
    "link": "http://arxiv.org/abs/2302.01416",
    "context": "Title: Neural Insights for Digital Marketing Content Design. (arXiv:2302.01416v3 [cs.LG] UPDATED)\nAbstract: In digital marketing, experimenting with new website content is one of the key levers to improve customer engagement. However, creating successful marketing content is a manual and time-consuming process that lacks clear guiding principles. This paper seeks to close the loop between content creation and online experimentation by offering marketers AI-driven actionable insights based on historical data to improve their creative process. We present a neural-network-based system that scores and extracts insights from a marketing content design, namely, a multimodal neural network predicts the attractiveness of marketing contents, and a post-hoc attribution method generates actionable insights for marketers to improve their content in specific marketing locations. Our insights not only point out the advantages and drawbacks of a given current content, but also provide design recommendations based on historical data. We show that our scoring model and insights work well both quantitatively ",
    "path": "papers/23/02/2302.01416.json",
    "total_tokens": 880,
    "translated_title": "数字营销内容设计的神经洞察",
    "translated_abstract": "在数字营销中，尝试新的网站内容是提高客户参与度的关键杠杆之一。但是，创建成功的营销内容是一项手动且耗时的过程，缺乏明确的指导原则。本文旨在通过基于历史数据为营销人员提供基于AI驱动的可行性见解，以改进其创意过程，从而将内容创建和在线实验之间的循环闭合起来。我们提出了一个基于神经网络的系统，该系统对营销内容设计进行评分和提取见解，即多模态神经网络预测营销内容的吸引力，后处理归因方法为营销人员生成有针对性的见解，以改善特定营销位置的内容。我们的见解不仅指出了当前给定内容的优势和劣势，还根据历史数据提供了设计建议。我们表明，我们的评分模型和见解在数量和质量上均表现良好，并且可以显着提高真实网站上的客户参与度。",
    "tldr": "本文提出了一种基于神经网络的数字营销内容设计评分和提取见解系统，该系统可以为营销人员提供基于历史数据的见解和设计建议，以改善其创意过程并显着提高客户参与度。",
    "en_tdlr": "This paper presents a neural-network-based system for scoring and extracting insights from digital marketing content design to improve creative process and enhance customer engagement, offering marketers AI-driven actionable insights based on historical data."
}