{
    "title": "Mixed formulation of physics-informed neural networks for thermo-mechanically coupled systems and heterogeneous domains. (arXiv:2302.04954v2 [cs.CE] UPDATED)",
    "abstract": "Physics-informed neural networks (PINNs) are a new tool for solving boundary value problems by defining loss functions of neural networks based on governing equations, boundary conditions, and initial conditions. Recent investigations have shown that when designing loss functions for many engineering problems, using first-order derivatives and combining equations from both strong and weak forms can lead to much better accuracy, especially when there are heterogeneity and variable jumps in the domain. This new approach is called the mixed formulation for PINNs, which takes ideas from the mixed finite element method. In this method, the PDE is reformulated as a system of equations where the primary unknowns are the fluxes or gradients of the solution, and the secondary unknowns are the solution itself. In this work, we propose applying the mixed formulation to solve multi-physical problems, specifically a stationary thermo-mechanically coupled system of equations. Additionally, we discus",
    "link": "http://arxiv.org/abs/2302.04954",
    "context": "Title: Mixed formulation of physics-informed neural networks for thermo-mechanically coupled systems and heterogeneous domains. (arXiv:2302.04954v2 [cs.CE] UPDATED)\nAbstract: Physics-informed neural networks (PINNs) are a new tool for solving boundary value problems by defining loss functions of neural networks based on governing equations, boundary conditions, and initial conditions. Recent investigations have shown that when designing loss functions for many engineering problems, using first-order derivatives and combining equations from both strong and weak forms can lead to much better accuracy, especially when there are heterogeneity and variable jumps in the domain. This new approach is called the mixed formulation for PINNs, which takes ideas from the mixed finite element method. In this method, the PDE is reformulated as a system of equations where the primary unknowns are the fluxes or gradients of the solution, and the secondary unknowns are the solution itself. In this work, we propose applying the mixed formulation to solve multi-physical problems, specifically a stationary thermo-mechanically coupled system of equations. Additionally, we discus",
    "path": "papers/23/02/2302.04954.json",
    "total_tokens": 832,
    "translated_title": "物理信息神经网络多元素耦合系统和异质域的混合形式",
    "translated_abstract": "物理信息神经网络（PINNs）是一种通过定义神经网络的损失函数来解决边界值问题的新工具，该损失函数基于控制方程、边界条件和初始条件。最近的研究表明，当设计许多工程问题的损失函数时，使用一阶导数并结合强形式和弱形式的方程可以提高准确性，尤其是在领域中存在异质性和变量跳变的情况下。这种新方法被称为PINNs的混合形式，它借鉴了混合有限元方法的思想。在该方法中，PDE被重新表述为一个方程系统，其中主要未知量是解的通量或梯度，而次要未知量是解本身。在这项工作中，我们提出将混合形式应用于解决多物理问题，特别是稳态热力学耦合方程组。",
    "tldr": "本文提出了将混合形式应用于解决多物理问题，特别是稳态热力学耦合方程组的物理信息神经网络方法。"
}