{
    "title": "Optimal transmission expansion planning in the context of renewable energy integration policies. (arXiv:2302.10562v3 [math.OC] UPDATED)",
    "abstract": "This paper assesses the extent to which a renewables-driven expansion of the transmission system infrastructure impacts the total generation mix in the decentralised energy market. For that, we employ an optimisation bi-level model in which a welfare-maximizing transmission system operator makes investments in transmission lines at the upper level while considering power market dynamics at the lower level. To account for the deregulated energy market structure, we assume that the generation companies at the lower level make capacity investments as price-takers in perfect competition. Considering alternative transmission infrastructure expansion budgets, carbon emission taxes and monetary incentives for renewable generation capacity expansion, we study how alternative compositions of these factors affect the share of renewable generation in the generation mix. We apply the proposed modelling assessment to an illustrative three-node instance and a case study considering a simplified repr",
    "link": "http://arxiv.org/abs/2302.10562",
    "context": "Title: Optimal transmission expansion planning in the context of renewable energy integration policies. (arXiv:2302.10562v3 [math.OC] UPDATED)\nAbstract: This paper assesses the extent to which a renewables-driven expansion of the transmission system infrastructure impacts the total generation mix in the decentralised energy market. For that, we employ an optimisation bi-level model in which a welfare-maximizing transmission system operator makes investments in transmission lines at the upper level while considering power market dynamics at the lower level. To account for the deregulated energy market structure, we assume that the generation companies at the lower level make capacity investments as price-takers in perfect competition. Considering alternative transmission infrastructure expansion budgets, carbon emission taxes and monetary incentives for renewable generation capacity expansion, we study how alternative compositions of these factors affect the share of renewable generation in the generation mix. We apply the proposed modelling assessment to an illustrative three-node instance and a case study considering a simplified repr",
    "path": "papers/23/02/2302.10562.json",
    "total_tokens": 902,
    "translated_title": "在可再生能源整合政策背景下的最优输电扩建规划",
    "translated_abstract": "本文评估了可再生能源驱动的输电系统基础设施扩建对分散式能源市场总发电结构的影响程度。为此，我们使用了一个优化的双层模型，其中一个以最大化福利为目标的输电系统运营商在上层进行输电线路投资，并在下层考虑电力市场动态。为了考虑到自由化的能源市场结构，我们假设在下层的发电公司以完全竞争中的价格接受者身份进行容量投资。考虑到不同的输电基础设施扩展预算、碳排放税和可再生能源发电容量扩展的货币激励，我们研究了这些因素的不同组合如何影响可再生能源在发电结构中的份额。我们将提出的建模评估应用于一个具有三个节点的示例和一个考虑了简化repr的案例研究",
    "tldr": "本文研究了在可再生能源整合政策背景下，输电系统基础设施扩建对能源市场结构的影响。利用优化模型，我们考虑了投资运营商和发电公司在竞争市场中的决策，研究了不同因素对可再生能源份额的影响。"
}