{
    "title": "A Survey on Arabic Named Entity Recognition: Past, Recent Advances, and Future Trends. (arXiv:2302.03512v3 [cs.CL] UPDATED)",
    "abstract": "As more and more Arabic texts emerged on the Internet, extracting important information from these Arabic texts is especially useful. As a fundamental technology, Named entity recognition (NER) serves as the core component in information extraction technology, while also playing a critical role in many other Natural Language Processing (NLP) systems, such as question answering and knowledge graph building. In this paper, we provide a comprehensive review of the development of Arabic NER, especially the recent advances in deep learning and pre-trained language model. Specifically, we first introduce the background of Arabic NER, including the characteristics of Arabic and existing resources for Arabic NER. Then, we systematically review the development of Arabic NER methods. Traditional Arabic NER systems focus on feature engineering and designing domain-specific rules. In recent years, deep learning methods achieve significant progress by representing texts via continuous vector repres",
    "link": "http://arxiv.org/abs/2302.03512",
    "context": "Title: A Survey on Arabic Named Entity Recognition: Past, Recent Advances, and Future Trends. (arXiv:2302.03512v3 [cs.CL] UPDATED)\nAbstract: As more and more Arabic texts emerged on the Internet, extracting important information from these Arabic texts is especially useful. As a fundamental technology, Named entity recognition (NER) serves as the core component in information extraction technology, while also playing a critical role in many other Natural Language Processing (NLP) systems, such as question answering and knowledge graph building. In this paper, we provide a comprehensive review of the development of Arabic NER, especially the recent advances in deep learning and pre-trained language model. Specifically, we first introduce the background of Arabic NER, including the characteristics of Arabic and existing resources for Arabic NER. Then, we systematically review the development of Arabic NER methods. Traditional Arabic NER systems focus on feature engineering and designing domain-specific rules. In recent years, deep learning methods achieve significant progress by representing texts via continuous vector repres",
    "path": "papers/23/02/2302.03512.json",
    "total_tokens": 949,
    "translated_title": "对阿拉伯命名实体识别的调查：过去、近期进展和未来趋势",
    "translated_abstract": "随着越来越多的阿拉伯文本在互联网上出现，从这些阿拉伯文本中提取重要信息变得尤为有用。作为一项基本技术，命名实体识别（NER）在信息提取技术中充当核心组件，同时在许多其他自然语言处理（NLP）系统中起着至关重要的作用，如问答和知识图谱构建。在本文中，我们对阿拉伯NER的发展进行了全面回顾，特别是深度学习和预训练语言模型方面的最新进展。具体来说，我们首先介绍了阿拉伯NER的背景，包括阿拉伯语特点和现有的阿拉伯NER资源。然后，我们系统地回顾了阿拉伯NER方法的发展。传统的阿拉伯NER系统侧重于特征工程和设计特定领域的规则。近年来，通过连续向量表示文本的深度学习方法取得了显著的进展。",
    "tldr": "本研究对阿拉伯命名实体识别（NER）的发展进行了全面回顾，尤其关注深度学习和预训练语言模型方面的最新进展。该调查总结了传统的NER方法和近年来基于深度学习的方法，并介绍了阿拉伯NER的背景和现有资源。"
}