{
    "title": "Arena-Rosnav 2.0: A Development and Benchmarking Platform for Robot Navigation in Highly Dynamic Environments. (arXiv:2302.10023v2 [cs.RO] UPDATED)",
    "abstract": "Following up on our previous works, in this paper, we present Arena-Rosnav 2.0 an extension to our previous works Arena-Bench and Arena-Rosnav, which adds a variety of additional modules for developing and benchmarking robotic navigation approaches. The platform is fundamentally restructured and provides unified APIs to add additional functionalities such as planning algorithms, simulators, or evaluation functionalities. We have included more realistic simulation and pedestrian behavior and provide a profound documentation to lower the entry barrier. We evaluated our system by first, conducting a user study in which we asked experienced researchers as well as new practitioners and students to test our system. The feedback was mostly positive and a high number of participants are utilizing our system for other research endeavors. Finally, we demonstrate the feasibility of our system by integrating two new simulators and a variety of state of the art navigation approaches and benchmark t",
    "link": "http://arxiv.org/abs/2302.10023",
    "context": "Title: Arena-Rosnav 2.0: A Development and Benchmarking Platform for Robot Navigation in Highly Dynamic Environments. (arXiv:2302.10023v2 [cs.RO] UPDATED)\nAbstract: Following up on our previous works, in this paper, we present Arena-Rosnav 2.0 an extension to our previous works Arena-Bench and Arena-Rosnav, which adds a variety of additional modules for developing and benchmarking robotic navigation approaches. The platform is fundamentally restructured and provides unified APIs to add additional functionalities such as planning algorithms, simulators, or evaluation functionalities. We have included more realistic simulation and pedestrian behavior and provide a profound documentation to lower the entry barrier. We evaluated our system by first, conducting a user study in which we asked experienced researchers as well as new practitioners and students to test our system. The feedback was mostly positive and a high number of participants are utilizing our system for other research endeavors. Finally, we demonstrate the feasibility of our system by integrating two new simulators and a variety of state of the art navigation approaches and benchmark t",
    "path": "papers/23/02/2302.10023.json",
    "total_tokens": 895,
    "translated_title": "Arena-Rosnav 2.0：用于在高度动态环境中的机器人导航开发和基准测试的平台",
    "translated_abstract": "在本文中，我们在之前的工作基础上推出了Arena-Rosnav 2.0，这是我们之前的作品Arena-Bench和Arena-Rosnav的扩展版，增加了多种附加模块用于开发和基准测试机器人导航方法。该平台进行了根本重构，并提供了统一的API，用于添加额外的功能，如规划算法、模拟器或评估功能。我们增加了更加真实的模拟和行人行为，并提供了深入的文档以降低入门门槛。我们通过首先进行用户研究来评估我们的系统，在该研究中，我们要求有经验的研究者和新的从业者和学生测试我们的系统。反馈大多数是积极的，很多参与者正在将我们的系统用于其他研究项目。最后，我们通过整合两个新的模拟器和各种最先进的导航方法和基准测试验证了我们系统的可行性。",
    "tldr": "Arena-Rosnav 2.0是一个用于开发和基准测试机器人导航方法的平台，它提供了统一的API和更真实的模拟，通过用户研究和集成最新的导航方法验证了其可行性。",
    "en_tdlr": "Arena-Rosnav 2.0 is a platform for developing and benchmarking robotic navigation approaches, providing unified APIs and more realistic simulation. Its feasibility is validated through user studies and integration of state-of-the-art navigation methods."
}