{
    "title": "Leaving Reality to Imagination: Robust Classification via Generated Datasets. (arXiv:2302.02503v2 [cs.CV] UPDATED)",
    "abstract": "Recent research on robustness has revealed significant performance gaps between neural image classifiers trained on datasets that are similar to the test set, and those that are from a naturally shifted distribution, such as sketches, paintings, and animations of the object categories observed during training. Prior work focuses on reducing this gap by designing engineered augmentations of training data or through unsupervised pretraining of a single large model on massive in-the-wild training datasets scraped from the Internet. However, the notion of a dataset is also undergoing a paradigm shift in recent years. With drastic improvements in the quality, ease-of-use, and access to modern generative models, generated data is pervading the web. In this light, we study the question: How do these generated datasets influence the natural robustness of image classifiers? We find that Imagenet classifiers trained on real data augmented with generated data achieve higher accuracy and effective",
    "link": "http://arxiv.org/abs/2302.02503",
    "context": "Title: Leaving Reality to Imagination: Robust Classification via Generated Datasets. (arXiv:2302.02503v2 [cs.CV] UPDATED)\nAbstract: Recent research on robustness has revealed significant performance gaps between neural image classifiers trained on datasets that are similar to the test set, and those that are from a naturally shifted distribution, such as sketches, paintings, and animations of the object categories observed during training. Prior work focuses on reducing this gap by designing engineered augmentations of training data or through unsupervised pretraining of a single large model on massive in-the-wild training datasets scraped from the Internet. However, the notion of a dataset is also undergoing a paradigm shift in recent years. With drastic improvements in the quality, ease-of-use, and access to modern generative models, generated data is pervading the web. In this light, we study the question: How do these generated datasets influence the natural robustness of image classifiers? We find that Imagenet classifiers trained on real data augmented with generated data achieve higher accuracy and effective",
    "path": "papers/23/02/2302.02503.json",
    "total_tokens": 855,
    "tldr": "本文研究了使用生成的数据集对图像分类器的影响，发现使用真实数据附带进行训练的生成数据可实现更高的精确度和有效性。"
}