{
    "title": "Deep Imbalanced Time-series Forecasting via Local Discrepancy Density. (arXiv:2302.13563v2 [cs.LG] UPDATED)",
    "abstract": "Time-series forecasting models often encounter abrupt changes in a given period of time which generally occur due to unexpected or unknown events. Despite their scarce occurrences in the training set, abrupt changes incur loss that significantly contributes to the total loss. Therefore, they act as noisy training samples and prevent the model from learning generalizable patterns, namely the normal states. Based on our findings, we propose a reweighting framework that down-weights the losses incurred by abrupt changes and up-weights those by normal states. For the reweighting framework, we first define a measurement termed Local Discrepancy (LD) which measures the degree of abruptness of a change in a given period of time. Since a training set is mostly composed of normal states, we then consider how frequently the temporal changes appear in the training set based on LD. Our reweighting framework is applicable to existing time-series forecasting models regardless of the architectures. T",
    "link": "http://arxiv.org/abs/2302.13563",
    "context": "Title: Deep Imbalanced Time-series Forecasting via Local Discrepancy Density. (arXiv:2302.13563v2 [cs.LG] UPDATED)\nAbstract: Time-series forecasting models often encounter abrupt changes in a given period of time which generally occur due to unexpected or unknown events. Despite their scarce occurrences in the training set, abrupt changes incur loss that significantly contributes to the total loss. Therefore, they act as noisy training samples and prevent the model from learning generalizable patterns, namely the normal states. Based on our findings, we propose a reweighting framework that down-weights the losses incurred by abrupt changes and up-weights those by normal states. For the reweighting framework, we first define a measurement termed Local Discrepancy (LD) which measures the degree of abruptness of a change in a given period of time. Since a training set is mostly composed of normal states, we then consider how frequently the temporal changes appear in the training set based on LD. Our reweighting framework is applicable to existing time-series forecasting models regardless of the architectures. T",
    "path": "papers/23/02/2302.13563.json",
    "total_tokens": 943,
    "translated_title": "深度不平衡时间序列预测：基于局部差异密度的方法",
    "translated_abstract": "时间序列预测模型通常会遇到在某个时间段内的突发变化，这些变化通常是由意外事件或未知事件导致的。尽管在训练集中发生的次数很少，但突发变化引起的损失会显著影响总损失。因此，它们作为嘈杂的训练样本阻止了模型学习可推广的模式，即正常状态。基于我们的发现，我们提出了一个重新加权的框架，降低突发变化引起的损失，增加正常状态引起的损失。对于重新加权的框架，我们首先定义了一个称为局部差异度（LD）的度量，用于衡量在给定时间段内变化的突然程度。由于训练集主要由正常状态组成，我们进一步考虑了基于LD在训练集中出现的时间变化的频率。我们的重新加权框架适用于现有的时间序列预测模型，无论其架构如何。",
    "tldr": "该论文提出了一种基于局部差异密度的重新加权框架，用于解决时间序列预测中的深度不平衡问题。这个框架通过降低突发变化引起的损失，增加正常状态引起的损失，使模型能够学习可推广的模式。",
    "en_tdlr": "This paper proposes a reweighting framework based on local discrepancy density to address the issue of deep imbalanced time-series forecasting. The framework allows the model to learn generalizable patterns by down-weighting the losses incurred by abrupt changes and up-weighting those by normal states."
}