{
    "title": "Towards Model-Agnostic Federated Learning over Networks. (arXiv:2302.04363v2 [cs.LG] UPDATED)",
    "abstract": "We present a model-agnostic federated learning method for networks of heterogeneous data and models. The network structure reflects similarities between the (statistics of) local datasets and, in turn, their associated local(\"personal\") models. Our method is an instance of empirical risk minimization, with the regularization term derived from the network structure of data. In particular, we require well-connected local models, forming clusters, to yield similar predictions on a common test set. The proposed method allows for a wide range of local models. The only restriction on these local models is that they allow for efficient implementation of regularized empirical risk minimization (training). For a wide range of models, such implementations are available in high-level programming libraries including scikit-learn, Keras or PyTorch.",
    "link": "http://arxiv.org/abs/2302.04363",
    "context": "Title: Towards Model-Agnostic Federated Learning over Networks. (arXiv:2302.04363v2 [cs.LG] UPDATED)\nAbstract: We present a model-agnostic federated learning method for networks of heterogeneous data and models. The network structure reflects similarities between the (statistics of) local datasets and, in turn, their associated local(\"personal\") models. Our method is an instance of empirical risk minimization, with the regularization term derived from the network structure of data. In particular, we require well-connected local models, forming clusters, to yield similar predictions on a common test set. The proposed method allows for a wide range of local models. The only restriction on these local models is that they allow for efficient implementation of regularized empirical risk minimization (training). For a wide range of models, such implementations are available in high-level programming libraries including scikit-learn, Keras or PyTorch.",
    "path": "papers/23/02/2302.04363.json",
    "total_tokens": 825,
    "translated_title": "探索网络上的模型无关联合学习",
    "translated_abstract": "我们提出了一种适用于异构数据和模型网络的模型无关联合学习方法。网络结构反映了本地数据集（统计数据）和它们相关的本地模型之间的相似性。我们的方法是经验风险最小化的一种实例，其中正则化项是从数据的网络结构导出的。特别地，我们要求良好连接的本地模型形成聚类，在一个公共测试集上产生相似的预测结果。所提出的方法允许使用各种各样的本地模型。 对这些本地模型唯一的限制是它们允许有效实现正则化的经验风险最小化（训练）。对于各种模型，这样的实现都可以在高级编程库（包括scikit-learn、Keras或PyTorch）中找到。",
    "tldr": "该论文提出了一种适用于网络环境中多种数据和模型的模型无关关联学习方法，旨在通过网络结构反映本地数据集的相似性并保证本地模型产生一致的预测结果。",
    "en_tdlr": "This paper proposes a model-agnostic federated learning method for networks of heterogeneous data and models. The method aims to reflect the similarities between local datasets through the network structure and ensure that local models produce consistent predictions by forming well-connected clusters. The method allows for a range of local models as long as they allow for efficient implementation of regularized empirical risk minimization."
}