{
    "title": "Magnetohydrodynamics with Physics Informed Neural Operators. (arXiv:2302.08332v2 [physics.comp-ph] UPDATED)",
    "abstract": "The modeling of multi-scale and multi-physics complex systems typically involves the use of scientific software that can optimally leverage extreme scale computing. Despite major developments in recent years, these simulations continue to be computationally intensive and time consuming. Here we explore the use of AI to accelerate the modeling of complex systems at a fraction of the computational cost of classical methods, and present the first application of physics informed neural operators to model 2D incompressible magnetohydrodynamics simulations. Our AI models incorporate tensor Fourier neural operators as their backbone, which we implemented with the TensorLY package. Our results indicate that physics informed neural operators can accurately capture the physics of magnetohydrodynamics simulations that describe laminar flows with Reynolds numbers $Re\\leq250$. We also explore the applicability of our AI surrogates for turbulent flows, and discuss a variety of methodologies that may",
    "link": "http://arxiv.org/abs/2302.08332",
    "context": "Title: Magnetohydrodynamics with Physics Informed Neural Operators. (arXiv:2302.08332v2 [physics.comp-ph] UPDATED)\nAbstract: The modeling of multi-scale and multi-physics complex systems typically involves the use of scientific software that can optimally leverage extreme scale computing. Despite major developments in recent years, these simulations continue to be computationally intensive and time consuming. Here we explore the use of AI to accelerate the modeling of complex systems at a fraction of the computational cost of classical methods, and present the first application of physics informed neural operators to model 2D incompressible magnetohydrodynamics simulations. Our AI models incorporate tensor Fourier neural operators as their backbone, which we implemented with the TensorLY package. Our results indicate that physics informed neural operators can accurately capture the physics of magnetohydrodynamics simulations that describe laminar flows with Reynolds numbers $Re\\leq250$. We also explore the applicability of our AI surrogates for turbulent flows, and discuss a variety of methodologies that may",
    "path": "papers/23/02/2302.08332.json",
    "total_tokens": 868,
    "translated_title": "磁流体力学与物理信息神经算子",
    "translated_abstract": "对于建模多尺度和多物理复杂系统，通常需要使用能够充分发挥极端规模计算的科学软件。尽管近年来取得了重大进展，但这些模拟仍然需要大量计算和时间。在这里，我们探讨了使用人工智能来加速复杂系统建模的方法，其计算成本仅为传统方法的一小部分，并首次将物理信息神经算子应用于二维不可压缩磁流体力学模拟。我们的人工智能模型将张量傅里叶神经算子作为其基础，并使用TensorLY软件包进行实现。我们的结果表明，物理信息神经算子可以准确捕捉描述雷诺数$Re\\leq250$的层流磁流体力学模拟的物理特性。我们还探讨了将我们的人工智能代理用于湍流流动的适用性，并讨论了多种可能的方法论。",
    "tldr": "本文提出了一种使用物理信息神经算子模拟磁流体力学的方法，通过使用人工智能技术，在显著降低计算成本的同时，准确捕捉了磁流体力学模拟的物理特性。",
    "en_tdlr": "This paper proposes a method to simulate magnetohydrodynamics using physics informed neural operators. By utilizing artificial intelligence technology, the method accurately captures the physics of magnetohydrodynamics simulations while significantly reducing the computational cost."
}