{
    "title": "Designing binary social decisions. (arXiv:2302.09548v2 [econ.TH] UPDATED)",
    "abstract": "We design a mechanism, Majority voting with random checks (RC mechanism), that fully implements the majority rule for binary social decisions. A simultaneous vote over the two options is followed by a sequence of checks, where each agent (out of a random sample) can accept or reject the winner of the vote. If some agent in the sample accepts, the winner is implemented. If all agents reject the winner, one of the agents is selected randomly and the option she voted for initially wins. The implementation of the majority rule holds under both complete and incomplete information. We also extend the RC mechanism to accommodate for abstention and show that any supermajority rule is implementable via a modification of the RC mechanism. Finally, we introduce additional implementation mechanisms based on the concept of network formation.",
    "link": "http://arxiv.org/abs/2302.09548",
    "context": "Title: Designing binary social decisions. (arXiv:2302.09548v2 [econ.TH] UPDATED)\nAbstract: We design a mechanism, Majority voting with random checks (RC mechanism), that fully implements the majority rule for binary social decisions. A simultaneous vote over the two options is followed by a sequence of checks, where each agent (out of a random sample) can accept or reject the winner of the vote. If some agent in the sample accepts, the winner is implemented. If all agents reject the winner, one of the agents is selected randomly and the option she voted for initially wins. The implementation of the majority rule holds under both complete and incomplete information. We also extend the RC mechanism to accommodate for abstention and show that any supermajority rule is implementable via a modification of the RC mechanism. Finally, we introduce additional implementation mechanisms based on the concept of network formation.",
    "path": "papers/23/02/2302.09548.json",
    "total_tokens": 816,
    "translated_title": "设计二元社会决策机制",
    "translated_abstract": "我们设计了一种机制，即带有随机检查的多数票机制（RC 机制），完全实现了二元社会决策的多数原则。在两个选项的同时投票后，进行一系列检查，其中每个代理（随机抽样之一）可以接受或拒绝投票的获胜者。如果样本中的某个代理接受，则实现获胜者。如果所有代理都拒绝获胜者，则随机选择一个代理，其最初投票的选项获胜。多数规则的实施在完整和不完整信息下均保持不变。我们还扩展了 RC 机制以适应弃权，并表明可以通过修改 RC 机制来实现任何超级多数规则。最后，我们介绍了基于网络形成概念的其他实现机制。",
    "tldr": "设计了一种机制\"带有随机检查的多数票机制\"，可实现二元社会决策的多数原则，且适用于完整和不完整信息。同时还可通过修改实现任何超级多数规则，或基于网络形成概念进行实现。",
    "en_tdlr": "A mechanism called Majority voting with random checks (RC mechanism) was designed to implement the majority rule for binary social decisions, under both complete and incomplete information. The mechanism can also be modified to implement any supermajority rule, and additional implementation mechanisms based on the concept of network formation were introduced."
}