{
    "title": "Generative AI in the Wild: Prospects, Challenges, and Strategies",
    "abstract": "arXiv:2302.10827v2 Announce Type: replace-cross  Abstract: Propelled by their remarkable capabilities to generate novel and engaging content, Generative Artificial Intelligence (GenAI) technologies are disrupting traditional workflows in many industries. While prior research has examined GenAI from a techno-centric perspective, there is still a lack of understanding about how users perceive and utilize GenAI in real-world scenarios. To bridge this gap, we conducted semi-structured interviews with (N=18) GenAI users increative industries, investigating the human-GenAI co-creation process within a holistic LUA (Learning, Using and Assessing)framework. Our study uncovered an intriguingly complex landscape: Prospects-GenAI greatly fosters the co-creation between human expertise and GenAI capabilities, profoundly transforming creative workflows; Challenges-Meanwhile, users face substantial uncertainties and complexities arising from resource availability, tool usability, and regulatory comp",
    "link": "https://arxiv.org/abs/2302.10827",
    "context": "Title: Generative AI in the Wild: Prospects, Challenges, and Strategies\nAbstract: arXiv:2302.10827v2 Announce Type: replace-cross  Abstract: Propelled by their remarkable capabilities to generate novel and engaging content, Generative Artificial Intelligence (GenAI) technologies are disrupting traditional workflows in many industries. While prior research has examined GenAI from a techno-centric perspective, there is still a lack of understanding about how users perceive and utilize GenAI in real-world scenarios. To bridge this gap, we conducted semi-structured interviews with (N=18) GenAI users increative industries, investigating the human-GenAI co-creation process within a holistic LUA (Learning, Using and Assessing)framework. Our study uncovered an intriguingly complex landscape: Prospects-GenAI greatly fosters the co-creation between human expertise and GenAI capabilities, profoundly transforming creative workflows; Challenges-Meanwhile, users face substantial uncertainties and complexities arising from resource availability, tool usability, and regulatory comp",
    "path": "papers/23/02/2302.10827.json",
    "total_tokens": 872,
    "translated_title": "野外的生成人工智能：前景、挑战和策略",
    "translated_abstract": "驱动着生成人工智能（GenAI）技术以其出色的生成新颖和引人入胜的内容的能力，正在颠覆许多行业中的传统工作流。尽管先前的研究从技术中心的角度研究了GenAI，但人们对用户如何在现实场景中感知和利用GenAI仍然缺乏了解。为了弥合这一差距，我们对创意产业中的（N=18）GenAI用户进行了半结构化访谈，研究了在整体的LUA（学习、使用和评估）框架内人类和GenAI共同创作过程。我们的研究揭示了一个复杂而有趣的景观：前景-GenAI极大地促进了人类专业知识和GenAI能力之间的共同创作，深刻改变了创意工作流程；挑战-与此同时，用户面临着由资源可用性、工具可用性和监管复杂性引起的重大不确定性和复杂性。",
    "tldr": "GenAI技术在创意产业中推动人类专业知识和AI能力的共同创作过程，但用户同时面临着资源、工具和监管等方面带来的挑战。"
}