{
    "title": "SyreaNet: A Physically Guided Underwater Image Enhancement Framework Integrating Synthetic and Real Images. (arXiv:2302.08269v2 [cs.CV] UPDATED)",
    "abstract": "Underwater image enhancement (UIE) is vital for high-level vision-related underwater tasks. Although learning-based UIE methods have made remarkable achievements in recent years, it's still challenging for them to consistently deal with various underwater conditions, which could be caused by: 1) the use of the simplified atmospheric image formation model in UIE may result in severe errors; 2) the network trained solely with synthetic images might have difficulty in generalizing well to real underwater images. In this work, we, for the first time, propose a framework \\textit{SyreaNet} for UIE that integrates both synthetic and real data under the guidance of the revised underwater image formation model and novel domain adaptation (DA) strategies. First, an underwater image synthesis module based on the revised model is proposed. Then, a physically guided disentangled network is designed to predict the clear images by combining both synthetic and real underwater images. The intra- and in",
    "link": "http://arxiv.org/abs/2302.08269",
    "context": "Title: SyreaNet: A Physically Guided Underwater Image Enhancement Framework Integrating Synthetic and Real Images. (arXiv:2302.08269v2 [cs.CV] UPDATED)\nAbstract: Underwater image enhancement (UIE) is vital for high-level vision-related underwater tasks. Although learning-based UIE methods have made remarkable achievements in recent years, it's still challenging for them to consistently deal with various underwater conditions, which could be caused by: 1) the use of the simplified atmospheric image formation model in UIE may result in severe errors; 2) the network trained solely with synthetic images might have difficulty in generalizing well to real underwater images. In this work, we, for the first time, propose a framework \\textit{SyreaNet} for UIE that integrates both synthetic and real data under the guidance of the revised underwater image formation model and novel domain adaptation (DA) strategies. First, an underwater image synthesis module based on the revised model is proposed. Then, a physically guided disentangled network is designed to predict the clear images by combining both synthetic and real underwater images. The intra- and in",
    "path": "papers/23/02/2302.08269.json",
    "total_tokens": 994,
    "translated_title": "SyreaNet:一种物理引导下的水下图像增强框架，集成合成和真实图像",
    "translated_abstract": "水下图像增强（UIE）对于水下高级视觉相关任务至关重要。虽然基于学习的UIE方法在近年来取得了显著的成果，但它们仍然难以应对各种不同的水下条件，这可能是由以下原因引起的: 1) UIE中使用的简化大气图像形成模型可能会导致严重的误差。2) 只使用合成图像训练的网络可能难以很好地推广到真实的水下图像。本文首次提出了一种框架SyreaNet，以修订后的水下图像形成模型和新颖的域自适应（DA）策略为指导，集成了合成和真实数据的UIE方法。首先，提出了基于修订模型的水下图像合成模块。然后设计了一种物理引导的分解网络，通过结合合成水下图像和真实水下图像来预测清晰的图像。进一步采用内部和跨域适应技术来提高网络的推广能力。在各种水下数据集上的实验结果证明了我们提出的方法的有效性。",
    "tldr": "提出了一种名为SyreaNet的水下图像增强框架，通过集成合成和真实数据以及物理引导和新颖的域自适应策略，能够更好地处理各种水下条件，达到了较好的提升效果。",
    "en_tdlr": "SyreaNet is a physically guided underwater image enhancement framework that integrates synthetic and real data under the guidance of a revised underwater image formation model and novel domain adaptation strategies, achieving better enhancement results for various underwater conditions."
}