{
    "title": "Estimation of continuous environments by robot swarms: Correlated networks and decision-making. (arXiv:2302.13629v2 [cs.RO] UPDATED)",
    "abstract": "Collective decision-making is an essential capability of large-scale multi-robot systems to establish autonomy on the swarm level. A large portion of literature on collective decision-making in swarm robotics focuses on discrete decisions selecting from a limited number of options. Here we assign a decentralized robot system with the task of exploring an unbounded environment, finding consensus on the mean of a measurable environmental feature, and aggregating at areas where that value is measured (e.g., a contour line). A unique quality of this task is a causal loop between the robots' dynamic network topology and their decision-making. For example, the network's mean node degree influences time to convergence while the currently agreed-on mean value influences the swarm's aggregation location, hence, also the network structure as well as the precision error. We propose a control algorithm and study it in real-world robot swarm experiments in different environments. We show that our a",
    "link": "http://arxiv.org/abs/2302.13629",
    "context": "Title: Estimation of continuous environments by robot swarms: Correlated networks and decision-making. (arXiv:2302.13629v2 [cs.RO] UPDATED)\nAbstract: Collective decision-making is an essential capability of large-scale multi-robot systems to establish autonomy on the swarm level. A large portion of literature on collective decision-making in swarm robotics focuses on discrete decisions selecting from a limited number of options. Here we assign a decentralized robot system with the task of exploring an unbounded environment, finding consensus on the mean of a measurable environmental feature, and aggregating at areas where that value is measured (e.g., a contour line). A unique quality of this task is a causal loop between the robots' dynamic network topology and their decision-making. For example, the network's mean node degree influences time to convergence while the currently agreed-on mean value influences the swarm's aggregation location, hence, also the network structure as well as the precision error. We propose a control algorithm and study it in real-world robot swarm experiments in different environments. We show that our a",
    "path": "papers/23/02/2302.13629.json",
    "total_tokens": 891,
    "translated_title": "机器人群体对连续环境的估计：相关网络和决策制定",
    "translated_abstract": "集体决策是建立在群体层面上的大规模多机器人系统的关键能力。群体机器人集体决策的大部分文献都集中在从有限数量的选项中进行的离散决策上。在这里，我们将一个分散式机器人系统的任务分配为探索无界环境，找出可测环境特征的平均值并汇总至那个值被测量的区域（例如，等高线）。该任务的独特性在于机器人的动态网络拓扑和它们的决策制定之间存在因果循环。例如，网络的平均节点度数影响收敛时间，而当前已认同的平均值影响群体的汇聚位置，因此，也影响网络结构以及精度误差。我们提出了一种控制算法，并在不同环境中进行了实际机器人群体实验来研究它。",
    "tldr": "本论文研究了机器人群体对连续环境的估计任务，并提出了一种控制算法。其独特之处在于动态网络拓扑和决策制定之间存在因果循环，影响着精度和收敛时间。",
    "en_tdlr": "This paper studies the task of robot swarms estimating continuous environments and proposes a control algorithm. The unique aspect is the causal loop between dynamic network topology and decision-making, which affects accuracy and convergence time."
}