{
    "title": "A Cloud-based Deep Learning Framework for Early Detection of Pushing at Crowded Event Entrances. (arXiv:2302.08237v2 [cs.LG] UPDATED)",
    "abstract": "Crowding at the entrances of large events may lead to critical and life-threatening situations, particularly when people start pushing each other to reach the event faster. Automatic and timely identification of pushing behavior would help organizers and security forces to intervene early and mitigate dangerous situations. In this paper, we propose a cloud-based deep learning framework for automatic early detection of pushing in crowded event entrances. The proposed framework initially modifies and trains the EfficientNetV2B0 Convolutional Neural Network model. Subsequently, it integrates the adapted model with an accurate and fast pre-trained deep optical flow model with the color wheel method to analyze video streams and identify pushing patches in real-time. Moreover, the framework uses live capturing technology and a cloud-based environment to collect video streams of crowds in real-time and provide early-stage results. A novel dataset is generated based on five real-world experime",
    "link": "http://arxiv.org/abs/2302.08237",
    "context": "Title: A Cloud-based Deep Learning Framework for Early Detection of Pushing at Crowded Event Entrances. (arXiv:2302.08237v2 [cs.LG] UPDATED)\nAbstract: Crowding at the entrances of large events may lead to critical and life-threatening situations, particularly when people start pushing each other to reach the event faster. Automatic and timely identification of pushing behavior would help organizers and security forces to intervene early and mitigate dangerous situations. In this paper, we propose a cloud-based deep learning framework for automatic early detection of pushing in crowded event entrances. The proposed framework initially modifies and trains the EfficientNetV2B0 Convolutional Neural Network model. Subsequently, it integrates the adapted model with an accurate and fast pre-trained deep optical flow model with the color wheel method to analyze video streams and identify pushing patches in real-time. Moreover, the framework uses live capturing technology and a cloud-based environment to collect video streams of crowds in real-time and provide early-stage results. A novel dataset is generated based on five real-world experime",
    "path": "papers/23/02/2302.08237.json",
    "total_tokens": 1030,
    "translated_title": "一种基于云计算和深度学习框架的拥挤事件入口早期推测测深方法",
    "translated_abstract": "大型事件入口的拥挤可能导致危急和危及生命的情况，特别是当人们开始相互推挤以更快地到达目的地时。自动准确地识别推挤行为将有助于组织者和安保部队及时干预和减轻危险局面。本文提出了一种基于云计算和深度学习的自动早期推测测深框架，用于拥挤事件入口的推挤识别。该框架首先修改并训练EfficientNetV2B0卷积神经网络模型，接着将该模型与准确快速的深度光流模型及彩色环方法进行整合，实时分析视频流并识别推挤区域。此外，该框架使用现场采集技术和云计算环境实时收集人群视频流并提供早期结果。基于五个真实世界实验生成了一个新的数据集。",
    "tldr": "本文提出了一种基于云计算和深度学习的自动早期推测测深框架，可用于拥挤事件入口的推挤识别，包括修改和训练EfficientNetV2B0卷积神经网络模型、准确快速的深度光流模型及彩色环方法的整合以实时分析视频流并识别推挤区域，并使用现场采集技术和云计算环境实时收集人群视频流并提供早期结果。"
}