{
    "title": "Information Theory Inspired Pattern Analysis for Time-series Data. (arXiv:2302.11654v2 [cs.AI] UPDATED)",
    "abstract": "Current methods for pattern analysis in time series mainly rely on statistical features or probabilistic learning and inference methods to identify patterns and trends in the data. Such methods do not generalize well when applied to multivariate, multi-source, state-varying, and noisy time-series data. To address these issues, we propose a highly generalizable method that uses information theory-based features to identify and learn from patterns in multivariate time-series data. To demonstrate the proposed approach, we analyze pattern changes in human activity data. For applications with stochastic state transitions, features are developed based on Shannon's entropy of Markov chains, entropy rates of Markov chains, entropy production of Markov chains, and von Neumann entropy of Markov chains. For applications where state modeling is not applicable, we utilize five entropy variants, including approximate entropy, increment entropy, dispersion entropy, phase entropy, and slope entropy. T",
    "link": "http://arxiv.org/abs/2302.11654",
    "context": "Title: Information Theory Inspired Pattern Analysis for Time-series Data. (arXiv:2302.11654v2 [cs.AI] UPDATED)\nAbstract: Current methods for pattern analysis in time series mainly rely on statistical features or probabilistic learning and inference methods to identify patterns and trends in the data. Such methods do not generalize well when applied to multivariate, multi-source, state-varying, and noisy time-series data. To address these issues, we propose a highly generalizable method that uses information theory-based features to identify and learn from patterns in multivariate time-series data. To demonstrate the proposed approach, we analyze pattern changes in human activity data. For applications with stochastic state transitions, features are developed based on Shannon's entropy of Markov chains, entropy rates of Markov chains, entropy production of Markov chains, and von Neumann entropy of Markov chains. For applications where state modeling is not applicable, we utilize five entropy variants, including approximate entropy, increment entropy, dispersion entropy, phase entropy, and slope entropy. T",
    "path": "papers/23/02/2302.11654.json",
    "total_tokens": 847,
    "translated_abstract": "目前，对于时间序列中的模式分析，主要依赖于统计特征或概率学习和推断方法来识别数据中的模式和趋势。但这些方法在应用于多元、多来源、状态变化和嘈杂的时间序列数据时，很难得到泛化。因此，我们提出了一种高度泛化的方法，利用基于信息论的特征来发现并学习多元时间序列数据中的模式。为了证明这种方法，我们分析了人类活动数据中的模式变化。对于具有随机状态转换的应用，我们基于马尔可夫链的香农熵、马尔可夫链的熵率、马尔可夫链的熵产生量和马尔可夫链的冯·诺伊曼熵开发了特征。对于状态建模不适用的应用，我们利用了包括近似熵、增量熵、离散熵、相位熵和斜率熵在内的五种熵变体。",
    "tldr": "该研究提出了一种基于信息论的方法，用于多元时间序列数据中的模式分析，包括马尔可夫链和五种熵变体特征。",
    "en_tdlr": "This study proposes an information theory-based method for pattern analysis in multivariate time-series data, including features based on Markov chains and five entropy variants."
}