{
    "title": "Agile Modeling: From Concept to Classifier in Minutes. (arXiv:2302.12948v2 [cs.LG] UPDATED)",
    "abstract": "The application of computer vision to nuanced subjective use cases is growing. While crowdsourcing has served the vision community well for most objective tasks (such as labeling a \"zebra\"), it now falters on tasks where there is substantial subjectivity in the concept (such as identifying \"gourmet tuna\"). However, empowering any user to develop a classifier for their concept is technically difficult: users are neither machine learning experts, nor have the patience to label thousands of examples. In reaction, we introduce the problem of Agile Modeling: the process of turning any subjective visual concept into a computer vision model through a real-time user-in-the-loop interactions. We instantiate an Agile Modeling prototype for image classification and show through a user study (N=14) that users can create classifiers with minimal effort under 30 minutes. We compare this user driven process with the traditional crowdsourcing paradigm and find that the crowd's notion often differs fro",
    "link": "http://arxiv.org/abs/2302.12948",
    "context": "Title: Agile Modeling: From Concept to Classifier in Minutes. (arXiv:2302.12948v2 [cs.LG] UPDATED)\nAbstract: The application of computer vision to nuanced subjective use cases is growing. While crowdsourcing has served the vision community well for most objective tasks (such as labeling a \"zebra\"), it now falters on tasks where there is substantial subjectivity in the concept (such as identifying \"gourmet tuna\"). However, empowering any user to develop a classifier for their concept is technically difficult: users are neither machine learning experts, nor have the patience to label thousands of examples. In reaction, we introduce the problem of Agile Modeling: the process of turning any subjective visual concept into a computer vision model through a real-time user-in-the-loop interactions. We instantiate an Agile Modeling prototype for image classification and show through a user study (N=14) that users can create classifiers with minimal effort under 30 minutes. We compare this user driven process with the traditional crowdsourcing paradigm and find that the crowd's notion often differs fro",
    "path": "papers/23/02/2302.12948.json",
    "total_tokens": 910,
    "translated_title": "敏捷建模：从概念到分类器只需几分钟",
    "translated_abstract": "计算机视觉在主观细微应用方面的应用越来越多。虽然众包对于大多数客观任务（如标记“斑马”）已经为视觉社区服务得很好，但在概念具有实质性主观性的任务（例如识别“美食金枪鱼”）上，它现在面临失败。然而，让任何用户开发其概念的分类器在技术上是困难的：用户既不是机器学习专家，也没有耐心标记数千个示例。为此，我们提出了敏捷建模的问题：通过实时用户参与将任何主观视觉概念转化为计算机视觉模型的过程。我们为图像分类实例化了一个敏捷建模原型，并通过用户研究（N=14）表明，用户可以在30分钟内轻松创建分类器。我们将这个用户驱动的过程与传统的众包范式进行对比，并发现群体的观念常常与用户不同。",
    "tldr": "本文介绍了敏捷建模的概念，即将任何主观视觉概念转化为计算机视觉模型的过程，并通过用户研究表明，用户可以在30分钟内轻松创建分类器。",
    "en_tdlr": "This paper introduces the concept of Agile Modeling, which is the process of turning any subjective visual concept into a computer vision model through real-time user-in-the-loop interactions. It shows through a user study that users can easily create classifiers under 30 minutes and compares this user-driven process with the traditional crowdsourcing paradigm."
}