{
    "title": "Numerical Methods For PDEs Over Manifolds Using Spectral Physics Informed Neural Networks. (arXiv:2302.05322v2 [cs.LG] UPDATED)",
    "abstract": "We introduce an approach for solving PDEs over manifolds using physics informed neural networks whose architecture aligns with spectral methods. The networks are trained to take in as input samples of an initial condition, a time stamp and point(s) on the manifold and then output the solution's value at the given time and point(s). We provide proofs of our method for the heat equation on the interval and examples of unique network architectures that are adapted to nonlinear equations on the sphere and the torus. We also show that our spectral-inspired neural network architectures outperform the standard physics informed architectures. Our extensive experimental results include generalization studies where the testing dataset of initial conditions is randomly sampled from a significantly larger space than the training set.",
    "link": "http://arxiv.org/abs/2302.05322",
    "context": "Title: Numerical Methods For PDEs Over Manifolds Using Spectral Physics Informed Neural Networks. (arXiv:2302.05322v2 [cs.LG] UPDATED)\nAbstract: We introduce an approach for solving PDEs over manifolds using physics informed neural networks whose architecture aligns with spectral methods. The networks are trained to take in as input samples of an initial condition, a time stamp and point(s) on the manifold and then output the solution's value at the given time and point(s). We provide proofs of our method for the heat equation on the interval and examples of unique network architectures that are adapted to nonlinear equations on the sphere and the torus. We also show that our spectral-inspired neural network architectures outperform the standard physics informed architectures. Our extensive experimental results include generalization studies where the testing dataset of initial conditions is randomly sampled from a significantly larger space than the training set.",
    "path": "papers/23/02/2302.05322.json",
    "total_tokens": 748,
    "translated_title": "使用谱物理信息神经网络求解流形上的偏微分方程数值方法",
    "translated_abstract": "我们提出了一种使用谱方法对齐架构的物理信息神经网络方法，用于求解流形上的偏微分方程。这些网络被训练为将初始条件、时间戳和流形上的点作为输入，并输出给定时间和点处的解的值。我们证明了基于谱方法的神经网络方法在区间上的热方程、球面和环面非线性方程的解决中的有效性。同时，我们还展示了基于谱的神经网络架构优于标准物理信息架构的性能优势。我们广泛的实验结果包括对广泛的测试数据集进行的泛化研究。",
    "tldr": "本文提出了一种新方法，使用基于谱的物理信息神经网络求解流形上的偏微分方程，并在球面和环面上得到了成功应用。对比标准架构，本文的方法表现更好。",
    "en_tdlr": "This paper proposes a novel approach to solving PDEs over manifolds using spectral physics informed neural networks, showing successful applications on the sphere and torus, with better performance than standard architectures."
}