{
    "title": "Unreliable Partial Label Learning with Recursive Separation. (arXiv:2302.09891v2 [cs.AI] UPDATED)",
    "abstract": "Partial label learning (PLL) is a typical weakly supervised learning problem in which each instance is associated with a candidate label set, and among which only one is true. However, the assumption that the ground-truth label is always among the candidate label set would be unrealistic, as the reliability of the candidate label sets in real-world applications cannot be guaranteed by annotators. Therefore, a generalized PLL named Unreliable Partial Label Learning (UPLL) is proposed, in which the true label may not be in the candidate label set. Due to the challenges posed by unreliable labeling, previous PLL methods will experience a marked decline in performance when applied to UPLL. To address the issue, we propose a two-stage framework named Unreliable Partial Label Learning with Recursive Separation (UPLLRS). In the first stage, the self-adaptive recursive separation strategy is proposed to separate the training set into a reliable subset and an unreliable subset. In the second st",
    "link": "http://arxiv.org/abs/2302.09891",
    "context": "Title: Unreliable Partial Label Learning with Recursive Separation. (arXiv:2302.09891v2 [cs.AI] UPDATED)\nAbstract: Partial label learning (PLL) is a typical weakly supervised learning problem in which each instance is associated with a candidate label set, and among which only one is true. However, the assumption that the ground-truth label is always among the candidate label set would be unrealistic, as the reliability of the candidate label sets in real-world applications cannot be guaranteed by annotators. Therefore, a generalized PLL named Unreliable Partial Label Learning (UPLL) is proposed, in which the true label may not be in the candidate label set. Due to the challenges posed by unreliable labeling, previous PLL methods will experience a marked decline in performance when applied to UPLL. To address the issue, we propose a two-stage framework named Unreliable Partial Label Learning with Recursive Separation (UPLLRS). In the first stage, the self-adaptive recursive separation strategy is proposed to separate the training set into a reliable subset and an unreliable subset. In the second st",
    "path": "papers/23/02/2302.09891.json",
    "total_tokens": 997,
    "translated_title": "不可靠部分标签学习与递归分离",
    "translated_abstract": "部分标签学习（PLL）是一个典型的弱监督学习问题，即每个实例都与一个候选标签集相关，其中只有一个是真实的。然而，假设真实标签总是在候选标签集中是不现实的，在现实应用中，候选标签集的可靠性不能由注释者保证。因此，提出了一种名为Unreliable Partial Label Learning（UPLL）的广义PLL方法，其中真实标签可能不在候选标签集中。由于不可靠标注带来的挑战，先前的PLL方法在应用到UPLL时会遇到明显的性能下降。为了解决这个问题，我们提出了一个名为Unreliable Partial Label Learning with Recursive Separation（UPLLRS）的两阶段框架。在第一阶段，提出了自适应递归分离策略，将训练集分为可靠子集和不可靠子集。在第二个阶段中，我们提出了一种基于递归分离的UPLL学习算法，通过利用可信和不可信子集的信息，以解决不可靠标注问题。",
    "tldr": "本论文提出了一种名为Unreliable Partial Label Learning with Recursive Separation (UPLLRS)的两阶段框架来解决不可靠部分标签学习问题，在第一阶段采用自适应递归分离策略将训练集分为可靠子集和不可靠子集，在第二阶段利用这些子集的信息来提高学习效果。"
}