{
    "title": "Improving Interpretability of Deep Sequential Knowledge Tracing Models with Question-centric Cognitive Representations. (arXiv:2302.06885v3 [cs.LG] UPDATED)",
    "abstract": "Knowledge tracing (KT) is a crucial technique to predict students' future performance by observing their historical learning processes. Due to the powerful representation ability of deep neural networks, remarkable progress has been made by using deep learning techniques to solve the KT problem. The majority of existing approaches rely on the \\emph{homogeneous question} assumption that questions have equivalent contributions if they share the same set of knowledge components. Unfortunately, this assumption is inaccurate in real-world educational scenarios. Furthermore, it is very challenging to interpret the prediction results from the existing deep learning based KT models. Therefore, in this paper, we present QIKT, a question-centric interpretable KT model to address the above challenges. The proposed QIKT approach explicitly models students' knowledge state variations at a fine-grained level with question-sensitive cognitive representations that are jointly learned from a question-c",
    "link": "http://arxiv.org/abs/2302.06885",
    "context": "Title: Improving Interpretability of Deep Sequential Knowledge Tracing Models with Question-centric Cognitive Representations. (arXiv:2302.06885v3 [cs.LG] UPDATED)\nAbstract: Knowledge tracing (KT) is a crucial technique to predict students' future performance by observing their historical learning processes. Due to the powerful representation ability of deep neural networks, remarkable progress has been made by using deep learning techniques to solve the KT problem. The majority of existing approaches rely on the \\emph{homogeneous question} assumption that questions have equivalent contributions if they share the same set of knowledge components. Unfortunately, this assumption is inaccurate in real-world educational scenarios. Furthermore, it is very challenging to interpret the prediction results from the existing deep learning based KT models. Therefore, in this paper, we present QIKT, a question-centric interpretable KT model to address the above challenges. The proposed QIKT approach explicitly models students' knowledge state variations at a fine-grained level with question-sensitive cognitive representations that are jointly learned from a question-c",
    "path": "papers/23/02/2302.06885.json",
    "total_tokens": 983,
    "translated_title": "采用以问题为中心的认知表示改进深度序列知识追踪模型的可解释性",
    "translated_abstract": "知识追踪是预测学生未来表现的关键技术，通过观察他们的历史学习过程来实现。由于深度神经网络强大的表示能力，使用深度学习技术来解决知识追踪问题已取得了显著的进展。然而，现有方法中的大部分都依赖于“同质化问题”的假设，即如果问题具有相同的知识组件集，则它们的贡献是等价的。遗憾的是，这种假设在实际教育场景中是不准确的。此外，从现有的基于深度学习的知识追踪模型中解释预测结果非常具有挑战性。因此，在本文中，我们提出了一种名为QIKT的基于问题的可解释知识追踪模型来应对以上挑战。所提出的QIKT方法采用基于问题的认知表示，明确地模拟学生的知识状态变化，并从问题-答案交互中联合学习问题敏感的认知表示。",
    "tldr": "本文介绍了一种名为 QIKT 的基于问题的可解释知识追踪模型，通过采用以问题为中心的认知表示方法，明确地模拟学生的知识状态变化，解决了现有模型中同质化问题的假设对实际情况不准确以及解释预测结果具有挑战性的问题。",
    "en_tdlr": "This paper introduces a question-centric interpretable knowledge tracing (QIKT) model to address the inaccurate assumption of homogeneous questions in existing models and the challenge of interpreting prediction results. By adopting question-sensitive cognitive representations, the QIKT model explicitly models students' knowledge state variations and jointly learns from question-answer interactions."
}