{
    "title": "Machine Learning for QoS Prediction in Vehicular Communication: Challenges and Solution Approaches. (arXiv:2302.11966v2 [cs.NI] UPDATED)",
    "abstract": "As cellular networks evolve towards the 6th generation, machine learning is seen as a key enabling technology to improve the capabilities of the network. Machine learning provides a methodology for predictive systems, which can make networks become proactive. This proactive behavior of the network can be leveraged to sustain, for example, a specific quality of service requirement. With predictive quality of service, a wide variety of new use cases, both safety- and entertainment-related, are emerging, especially in the automotive sector. Therefore, in this work, we consider maximum throughput prediction enhancing, for example, streaming or high-definition mapping applications. We discuss the entire machine learning workflow highlighting less regarded aspects such as the detailed sampling procedures, the in-depth analysis of the dataset characteristics, the effects of splits in the provided results, and the data availability. Reliable machine learning models need to face a lot of challe",
    "link": "http://arxiv.org/abs/2302.11966",
    "context": "Title: Machine Learning for QoS Prediction in Vehicular Communication: Challenges and Solution Approaches. (arXiv:2302.11966v2 [cs.NI] UPDATED)\nAbstract: As cellular networks evolve towards the 6th generation, machine learning is seen as a key enabling technology to improve the capabilities of the network. Machine learning provides a methodology for predictive systems, which can make networks become proactive. This proactive behavior of the network can be leveraged to sustain, for example, a specific quality of service requirement. With predictive quality of service, a wide variety of new use cases, both safety- and entertainment-related, are emerging, especially in the automotive sector. Therefore, in this work, we consider maximum throughput prediction enhancing, for example, streaming or high-definition mapping applications. We discuss the entire machine learning workflow highlighting less regarded aspects such as the detailed sampling procedures, the in-depth analysis of the dataset characteristics, the effects of splits in the provided results, and the data availability. Reliable machine learning models need to face a lot of challe",
    "path": "papers/23/02/2302.11966.json",
    "total_tokens": 901,
    "translated_title": "机器学习在车联网通信中的QoS预测：挑战与解决方案的探讨",
    "translated_abstract": "随着蜂窝网络进化到第六代，机器学习被视为提升网络能力的关键技术。机器学习提供了一种预测系统的方法，可以使网络变得主动。网络的主动行为可以用于维持特定的服务质量要求。有了预测性的服务质量，出现了各种新的使用案例，尤其是在汽车行业中，涉及到安全和娱乐等方面。因此，在这项工作中，我们考虑了提高最大吞吐量的预测，如流媒体或高清地图应用。我们讨论了整个机器学习工作流程，强调了一些不太被关注的方面，如详细的采样过程、数据集特征的深入分析、提供结果时的数据拆分效果以及数据可用性。可靠的机器学习模型需要面对许多挑战。",
    "tldr": "本文探讨了机器学习在车联网通信中的QoS预测，重点讨论了采样过程、数据集特征分析、数据拆分效果和数据可用性等方面。这项研究对于提升最大吞吐量预测在汽车行业中的应用具有重要意义。"
}