{
    "title": "EvoTorch: Scalable Evolutionary Computation in Python. (arXiv:2302.12600v3 [cs.NE] UPDATED)",
    "abstract": "Evolutionary computation is an important component within various fields such as artificial intelligence research, reinforcement learning, robotics, industrial automation and/or optimization, engineering design, etc. Considering the increasing computational demands and the dimensionalities of modern optimization problems, the requirement for scalable, re-usable, and practical evolutionary algorithm implementations has been growing. To address this requirement, we present EvoTorch: an evolutionary computation library designed to work with high-dimensional optimization problems, with GPU support and with high parallelization capabilities. EvoTorch is based on and seamlessly works with the PyTorch library, and therefore, allows the users to define their optimization problems using a well-known API.",
    "link": "http://arxiv.org/abs/2302.12600",
    "context": "Title: EvoTorch: Scalable Evolutionary Computation in Python. (arXiv:2302.12600v3 [cs.NE] UPDATED)\nAbstract: Evolutionary computation is an important component within various fields such as artificial intelligence research, reinforcement learning, robotics, industrial automation and/or optimization, engineering design, etc. Considering the increasing computational demands and the dimensionalities of modern optimization problems, the requirement for scalable, re-usable, and practical evolutionary algorithm implementations has been growing. To address this requirement, we present EvoTorch: an evolutionary computation library designed to work with high-dimensional optimization problems, with GPU support and with high parallelization capabilities. EvoTorch is based on and seamlessly works with the PyTorch library, and therefore, allows the users to define their optimization problems using a well-known API.",
    "path": "papers/23/02/2302.12600.json",
    "total_tokens": 694,
    "translated_title": "EvoTorch：Python中可扩展的进化计算",
    "translated_abstract": "进化计算是人工智能研究、强化学习、机器人、工业自动化和优化、工程设计等各个领域中的重要组成部分。考虑到现代优化问题的计算需求和维度的增加，对可扩展、可重用和实用的进化算法实现的需求不断增加。为了解决这个问题，我们介绍了 EvoTorch：一个旨在处理高维优化问题、支持 GPU 和高并行性能的进化计算库。EvoTorch 基于 PyTorch 库，并能够无缝地与之配合，因此允许用户使用众所周知的 API 定义自己的优化问题。",
    "tldr": "EvoTorch是一个Python库，为高维优化问题提供可扩展、可重用和实用的进化算法实现，支持GPU和高并行性能。",
    "en_tdlr": "EvoTorch is a Python library that provides scalable, reusable, and practical evolutionary algorithm implementations for high-dimensional optimization problems with GPU support and high parallelization capabilities."
}