{
    "title": "The ADMM-PINNs Algorithmic Framework for Nonsmooth PDE-Constrained Optimization: A Deep Learning Approach. (arXiv:2302.08309v1 [math.OC] CROSS LISTED)",
    "abstract": "We study the combination of the alternating direction method of multipliers (ADMM) with physics-informed neural networks (PINNs) for a general class of nonsmooth partial differential equation (PDE)-constrained optimization problems, where additional regularization can be employed for constraints on the control or design variables. The resulting ADMM-PINNs algorithmic framework substantially enlarges the applicable range of PINNs to nonsmooth cases of PDE-constrained optimization problems. The application of the ADMM makes it possible to untie the PDE constraints and the nonsmooth regularization terms for iterations. Accordingly, at each iteration, one of the resulting subproblems is a smooth PDE-constrained optimization which can be efficiently solved by PINNs, and the other is a simple nonsmooth optimization problem which usually has a closed-form solution or can be efficiently solved by various standard optimization algorithms or pre-trained neural networks. The ADMM-PINNs algorithmi",
    "link": "http://arxiv.org/abs/2302.08309",
    "context": "Title: The ADMM-PINNs Algorithmic Framework for Nonsmooth PDE-Constrained Optimization: A Deep Learning Approach. (arXiv:2302.08309v1 [math.OC] CROSS LISTED)\nAbstract: We study the combination of the alternating direction method of multipliers (ADMM) with physics-informed neural networks (PINNs) for a general class of nonsmooth partial differential equation (PDE)-constrained optimization problems, where additional regularization can be employed for constraints on the control or design variables. The resulting ADMM-PINNs algorithmic framework substantially enlarges the applicable range of PINNs to nonsmooth cases of PDE-constrained optimization problems. The application of the ADMM makes it possible to untie the PDE constraints and the nonsmooth regularization terms for iterations. Accordingly, at each iteration, one of the resulting subproblems is a smooth PDE-constrained optimization which can be efficiently solved by PINNs, and the other is a simple nonsmooth optimization problem which usually has a closed-form solution or can be efficiently solved by various standard optimization algorithms or pre-trained neural networks. The ADMM-PINNs algorithmi",
    "path": "papers/23/02/2302.08309.json",
    "total_tokens": 1010,
    "translated_title": "针对非光滑偏微分方程约束的优化问题，使用ADMM-PINNs算法框架进行深度学习处理",
    "translated_abstract": "本文研究了使用多重乘数交替方向法(ADMM)和物理信息神经网络(PINNs)的组合来解决一般类别的非光滑偏微分方程(PDE)约束优化问题。当需要对控制或设计变量进行限制时，可以采用附加正则化方法。所得到的ADMM-PINNs算法框架极大地扩展了PINNs的适用范围，可以应用于非光滑的PDE约束的优化问题。采用ADMM可以将PDE约束和非光滑正则化项分离出来，使迭代更加高效。在每次迭代中，其中的一个子问题是平滑的PDE受约束优化问题，可以通过PINNs有效地解决，而另一个是简单的非光滑优化问题，通常有封闭形式解或可以通过多种标准优化算法或预训练的神经网络有效地解决。通过两个数值实验证明了ADMM-PINNs算法框架在解决PDE约束的非光滑约束优化问题方面的有效性和鲁棒性。",
    "tldr": "本论文提出了采用ADMM-PINNs算法框架解决非光滑PDE约束优化问题的方法，在迭代中采用ADMM将PDE约束和非光滑正则化项分离，使得可以高效地解决 PDE-constrained optimization problems。",
    "en_tdlr": "This paper proposes an ADMM-PINNs algorithmic framework for solving nonsmooth PDE-constrained optimization problems, which applies ADMM to separate PDE constraints and nonsmooth regularization terms for efficient iterations. Its effectiveness and robustness are verified by two numerical experiments."
}