{
    "title": "Randomized Kaczmarz in Adversarial Distributed Setting",
    "abstract": "arXiv:2302.14615v2 Announce Type: replace-cross  Abstract: Developing large-scale distributed methods that are robust to the presence of adversarial or corrupted workers is an important part of making such methods practical for real-world problems. In this paper, we propose an iterative approach that is adversary-tolerant for convex optimization problems. By leveraging simple statistics, our method ensures convergence and is capable of adapting to adversarial distributions. Additionally, the efficiency of the proposed methods for solving convex problems is shown in simulations with the presence of adversaries. Through simulations, we demonstrate the efficiency of our approach in the presence of adversaries and its ability to identify adversarial workers with high accuracy and tolerate varying levels of adversary rates.",
    "link": "https://arxiv.org/abs/2302.14615",
    "context": "Title: Randomized Kaczmarz in Adversarial Distributed Setting\nAbstract: arXiv:2302.14615v2 Announce Type: replace-cross  Abstract: Developing large-scale distributed methods that are robust to the presence of adversarial or corrupted workers is an important part of making such methods practical for real-world problems. In this paper, we propose an iterative approach that is adversary-tolerant for convex optimization problems. By leveraging simple statistics, our method ensures convergence and is capable of adapting to adversarial distributions. Additionally, the efficiency of the proposed methods for solving convex problems is shown in simulations with the presence of adversaries. Through simulations, we demonstrate the efficiency of our approach in the presence of adversaries and its ability to identify adversarial workers with high accuracy and tolerate varying levels of adversary rates.",
    "path": "papers/23/02/2302.14615.json",
    "total_tokens": 783,
    "translated_title": "在对抗性分布设置中的随机Kaczmarz",
    "translated_abstract": "开发大规模分布式方法，使其能够在存在对抗性或受损工作者的情况下保持稳健性，这是使这些方法在实际问题中变得实用的重要部分。在本文中，我们提出了一种针对凸优化问题具有对抗性的迭代方法。通过利用简单的统计信息，我们的方法确保收敛，并能够适应对抗性分布。此外，在存在对手的情况下，通过模拟展示了所提出的方法在解决凸问题上的效率。通过模拟，我们展示了我们方法在存在对手的情况下的高效性，并且它能够高度准确地识别对手工作者并容忍不同水平的对手率。",
    "tldr": "提出了一种在对抗性分布设置中具有对抗鲁棒性的迭代方法，通过简单的统计信息保证收敛，能够适应对抗性分布，在模拟中展示了解决凸问题的高效性，具有高准确性识别对手工作者和容忍不同对手率的能力。",
    "en_tdlr": "Introduced an iterative method with adversarial robustness in adversarial distributed setting, ensuring convergence through simple statistics, capable of adapting to adversarial distributions, demonstrated efficiency in solving convex problems in simulations, with high accuracy in identifying adversarial workers and tolerance to varying adversary rates."
}