{
    "title": "Graph Attention Multi-Agent Fleet Autonomy for Advanced Air Mobility. (arXiv:2302.07337v3 [cs.RO] UPDATED)",
    "abstract": "Autonomous mobility is emerging as a new disruptive mode of urban transportation for moving cargo and passengers. However, designing scalable autonomous fleet coordination schemes to accommodate fast-growing mobility systems is challenging primarily due to the increasing heterogeneity of the fleets, time-varying demand patterns, service area expansions, and communication limitations. We introduce the concept of partially observable advanced air mobility games to coordinate a fleet of aerial vehicles by accounting for the heterogeneity of the interacting agents and the self-interested nature inherent to commercial mobility fleets. To model the complex interactions among the agents and the observation uncertainty in the mobility networks, we propose a novel heterogeneous graph attention encoder-decoder (HetGAT Enc-Dec) neural network-based stochastic policy. We train the policy by leveraging deep multi-agent reinforcement learning, allowing decentralized decision-making for the agents us",
    "link": "http://arxiv.org/abs/2302.07337",
    "context": "Title: Graph Attention Multi-Agent Fleet Autonomy for Advanced Air Mobility. (arXiv:2302.07337v3 [cs.RO] UPDATED)\nAbstract: Autonomous mobility is emerging as a new disruptive mode of urban transportation for moving cargo and passengers. However, designing scalable autonomous fleet coordination schemes to accommodate fast-growing mobility systems is challenging primarily due to the increasing heterogeneity of the fleets, time-varying demand patterns, service area expansions, and communication limitations. We introduce the concept of partially observable advanced air mobility games to coordinate a fleet of aerial vehicles by accounting for the heterogeneity of the interacting agents and the self-interested nature inherent to commercial mobility fleets. To model the complex interactions among the agents and the observation uncertainty in the mobility networks, we propose a novel heterogeneous graph attention encoder-decoder (HetGAT Enc-Dec) neural network-based stochastic policy. We train the policy by leveraging deep multi-agent reinforcement learning, allowing decentralized decision-making for the agents us",
    "path": "papers/23/02/2302.07337.json",
    "total_tokens": 927,
    "translated_title": "图形注意力多智能体航空机队自治技术",
    "translated_abstract": "自主机动性正成为一种新的颠覆性城市交通模式，用于货物和乘客的移动。然而，设计可扩展的自主机动技术来适应快速增长的机动系统是具有挑战性的，主要是因为机动车队的异质性增加、时间变化的需求模式、服务区域的扩展和通信限制的增加。我们引入了部分可观察的先进航空机动协调游戏的概念，通过考虑互动代理的异质性和商业机动车队固有的自私性来协调一支空中飞行器机队。为了对机动网络中的代理之间的复杂相互作用和观察不确定性进行建模，我们提出了一种新颖的异质图形注意力编码器-解码器（HetGAT Enc-Dec）神经网络的随机策略。我们通过利用深度多智能体强化学习来训练该策略，实现了代理的分散决策。",
    "tldr": "这项研究介绍了图形注意力多智能体航空机队自治技术，通过使用新型的神经网络随机策略，考虑代理的异质性和自私性，实现了对机动网络中复杂相互作用和观察不确定性的建模。通过深度多智能体强化学习，实现了代理的分散决策。"
}