{
    "title": "Some asymptotics for short maturity Asian options. (arXiv:2302.05421v2 [q-fin.PR] UPDATED)",
    "abstract": "Most of the existing methods for pricing Asian options are less efficient in the limit of small maturities and small volatilities. In this paper, we use the large deviations theory for the analysis of short-maturity Asian options. We present a local volatility model for the underlying market that incorporates a jump term in addition to the drift and diffusion terms. We estimate the asymptotics for the out-of-the-money, in-the-money, and at-the-money short-maturity Asian call and put options. Under appropriate assumptions, we show that the asymptotics for out-of-the-money Asian call and put options are governed by rare events. For the at-the-money Asian options, the result is more involved and in that case, we find the upper and lower bounds of the asymptotics of the Asian option price.",
    "link": "http://arxiv.org/abs/2302.05421",
    "context": "Title: Some asymptotics for short maturity Asian options. (arXiv:2302.05421v2 [q-fin.PR] UPDATED)\nAbstract: Most of the existing methods for pricing Asian options are less efficient in the limit of small maturities and small volatilities. In this paper, we use the large deviations theory for the analysis of short-maturity Asian options. We present a local volatility model for the underlying market that incorporates a jump term in addition to the drift and diffusion terms. We estimate the asymptotics for the out-of-the-money, in-the-money, and at-the-money short-maturity Asian call and put options. Under appropriate assumptions, we show that the asymptotics for out-of-the-money Asian call and put options are governed by rare events. For the at-the-money Asian options, the result is more involved and in that case, we find the upper and lower bounds of the asymptotics of the Asian option price.",
    "path": "papers/23/02/2302.05421.json",
    "total_tokens": 893,
    "translated_title": "短期亚洲期权的一些渐近性质",
    "translated_abstract": "大多数现有的亚洲期权定价方法在短期和小波动率极限下效率较低。本文利用大偏离理论对短期亚洲期权进行分析。我们提出了一个局部波动率模型，该模型在漂移项和扩散项之外还包括一个跳跃项。我们估计了虚值、实值和平值短期亚洲认购期权和认沽期权的渐近性质。在适当的假设下，我们证明了虚值亚洲认购期权和认沽期权的渐近性质受到罕见事件的影响。对于平值亚洲期权，结果更为复杂，我们找到了亚洲期权价格的渐近性质的上界和下界。",
    "tldr": "本研究利用大偏离理论对短期亚洲期权进行渐近性质分析，提出了局部波动率模型，并估计了虚值、实值和平值短期亚洲认购期权和认沽期权的渐近性质。对于虚值期权，渐近性质受罕见事件的影响，而对于平值期权，我们找到了渐近性质的上界和下界。"
}