{
    "title": "Minimizing Dynamic Regret on Geodesic Metric Spaces. (arXiv:2302.08652v2 [cs.LG] UPDATED)",
    "abstract": "In this paper, we consider the sequential decision problem where the goal is to minimize the general dynamic regret on a complete Riemannian manifold. The task of offline optimization on such a domain, also known as a geodesic metric space, has recently received significant attention. The online setting has received significantly less attention, and it has remained an open question whether the body of results that hold in the Euclidean setting can be transplanted into the land of Riemannian manifolds where new challenges (e.g., curvature) come into play. In this paper, we show how to get optimistic regret bound on manifolds with non-positive curvature whenever improper learning is allowed and propose an array of adaptive no-regret algorithms. To the best of our knowledge, this is the first work that considers general dynamic regret and develops \"optimistic\" online learning algorithms which can be employed on geodesic metric spaces.",
    "link": "http://arxiv.org/abs/2302.08652",
    "context": "Title: Minimizing Dynamic Regret on Geodesic Metric Spaces. (arXiv:2302.08652v2 [cs.LG] UPDATED)\nAbstract: In this paper, we consider the sequential decision problem where the goal is to minimize the general dynamic regret on a complete Riemannian manifold. The task of offline optimization on such a domain, also known as a geodesic metric space, has recently received significant attention. The online setting has received significantly less attention, and it has remained an open question whether the body of results that hold in the Euclidean setting can be transplanted into the land of Riemannian manifolds where new challenges (e.g., curvature) come into play. In this paper, we show how to get optimistic regret bound on manifolds with non-positive curvature whenever improper learning is allowed and propose an array of adaptive no-regret algorithms. To the best of our knowledge, this is the first work that considers general dynamic regret and develops \"optimistic\" online learning algorithms which can be employed on geodesic metric spaces.",
    "path": "papers/23/02/2302.08652.json",
    "total_tokens": 840,
    "translated_title": "在测地度量空间上最小化动态遗憾",
    "translated_abstract": "本文探讨了在完备的黎曼流形上最小化一般动态遗憾的顺序决策问题。最近，离线优化在这样一个领域，也被称为测地度量空间，引起了相当大的关注。在线设置却引起了较少的关注，并且尚未确定在测地度量空间中是否可以复制欧几里德设定中的结论（例如曲率）所需的结果。本文展示了如何在具有非正曲率的流形上找到乐观的遗憾界限，只要允许不适当的学习，并提出了一系列的自适应无遗憾算法。据我们所知，这是第一篇考虑一般动态遗憾并开发可应用于测地度量空间的“乐观”在线学习算法的工作。",
    "tldr": "本文研究了在测地度量空间上最小化动态遗憾的顺序决策问题，并提出了乐观的在线学习算法，为该领域的研究做出了首次贡献。"
}