{
    "title": "Dimension Reduction and MARS. (arXiv:2302.05790v2 [stat.ME] UPDATED)",
    "abstract": "The multivariate adaptive regression spline (MARS) is one of the popular estimation methods for nonparametric multivariate regressions. However, as MARS is based on marginal splines, to incorporate interactions of covariates, products of the marginal splines must be used, which leads to an unmanageable number of basis functions when the order of interaction is high and results in low estimation efficiency. In this paper, we improve the performance of MARS by using linear combinations of the covariates which achieve sufficient dimension reduction. The special basis functions of MARS facilitate calculation of gradients of the regression function, and estimation of the linear combinations is obtained via eigen-analysis of the outer-product of the gradients. Under some technical conditions, the asymptotic theory is established for the proposed estimation method. Numerical studies including both simulation and empirical applications show its effectiveness in dimension reduction and improvem",
    "link": "http://arxiv.org/abs/2302.05790",
    "context": "Title: Dimension Reduction and MARS. (arXiv:2302.05790v2 [stat.ME] UPDATED)\nAbstract: The multivariate adaptive regression spline (MARS) is one of the popular estimation methods for nonparametric multivariate regressions. However, as MARS is based on marginal splines, to incorporate interactions of covariates, products of the marginal splines must be used, which leads to an unmanageable number of basis functions when the order of interaction is high and results in low estimation efficiency. In this paper, we improve the performance of MARS by using linear combinations of the covariates which achieve sufficient dimension reduction. The special basis functions of MARS facilitate calculation of gradients of the regression function, and estimation of the linear combinations is obtained via eigen-analysis of the outer-product of the gradients. Under some technical conditions, the asymptotic theory is established for the proposed estimation method. Numerical studies including both simulation and empirical applications show its effectiveness in dimension reduction and improvem",
    "path": "papers/23/02/2302.05790.json",
    "total_tokens": 818,
    "translated_title": "维度约减与MARS",
    "translated_abstract": "多元自适应回归样条（MARS）是非参数多元回归估计方法中的常用方法之一。然而，由于MARS基于边际样条，为了考虑协变量之间的交互作用，必须使用边际样条的乘积，这会导致基函数数量过多，当交互作用阶数很高时，估计效率会降低。本文通过使用协变量的线性组合来改进MARS的性能，实现了足够的维度约减。MARS的特殊基函数有助于计算回归函数的梯度，并且通过对梯度的外积进行特征分析来估计线性组合。在一些技术条件下，对所提出的估计方法建立了渐近理论。包括模拟和实证应用的数值研究表明了其在维度约减和改进估计效果上的有效性。",
    "tldr": "本文改进了多元自适应回归样条（MARS）的性能，通过使用协变量的线性组合来实现足够的维度约减，提高了估计效率。",
    "en_tdlr": "This paper improves the performance of the multivariate adaptive regression spline (MARS) by achieving sufficient dimension reduction through linear combinations of covariates, resulting in higher estimation efficiency."
}