{
    "title": "Computational Discovery of Microstructured Composites with Optimal Stiffness-Toughness Trade-Offs. (arXiv:2302.01078v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "The conflict between stiffness and toughness is a fundamental problem in engineering materials design. However, the systematic discovery of microstructured composites with optimal stiffness-toughness trade-offs has never been demonstrated, hindered by the discrepancies between simulation and reality and the lack of data-efficient exploration of the entire Pareto front. We introduce a generalizable pipeline that integrates physical experiments, numerical simulations, and artificial neural networks to address both challenges. Without any prescribed expert knowledge of material design, our approach implements a nested-loop proposal-validation workflow to bridge the simulation-to-reality gap and discover microstructured composites that are stiff and tough with high sample efficiency. Further analysis of Pareto-optimal designs allows us to automatically identify existing toughness enhancement mechanisms, which were previously discovered through trial-and-error or biomimicry. On a broader sc",
    "link": "http://arxiv.org/abs/2302.01078",
    "context": "Title: Computational Discovery of Microstructured Composites with Optimal Stiffness-Toughness Trade-Offs. (arXiv:2302.01078v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: The conflict between stiffness and toughness is a fundamental problem in engineering materials design. However, the systematic discovery of microstructured composites with optimal stiffness-toughness trade-offs has never been demonstrated, hindered by the discrepancies between simulation and reality and the lack of data-efficient exploration of the entire Pareto front. We introduce a generalizable pipeline that integrates physical experiments, numerical simulations, and artificial neural networks to address both challenges. Without any prescribed expert knowledge of material design, our approach implements a nested-loop proposal-validation workflow to bridge the simulation-to-reality gap and discover microstructured composites that are stiff and tough with high sample efficiency. Further analysis of Pareto-optimal designs allows us to automatically identify existing toughness enhancement mechanisms, which were previously discovered through trial-and-error or biomimicry. On a broader sc",
    "path": "papers/23/02/2302.01078.json",
    "total_tokens": 963,
    "translated_title": "计算发现具有最佳刚度-韧度权衡的微结构复合材料",
    "translated_abstract": "刚度和韧度之间的冲突是工程材料设计中的一个基本问题。然而，尚未演示使用整个帕累托前沿的数据高效探索来系统地发现具有最佳刚度-韧度权衡的微结构复合材料，这主要是由于模拟与现实之间的差异以及对整个帕累托前沿的数据高效探索的缺乏。我们引入了一种可推广的管道，将物理实验、数值模拟和人工神经网络相结合，以应对这两个挑战。在没有任何预设材料设计专家知识的情况下，我们的方法实施了一个嵌套循环的建议-验证工作流，以弥合模拟和现实之间的差距，并以高样本效率发现了既刚又韧的微结构复合材料。对帕累托最优设计的进一步分析使我们能够自动识别出现有的增加韧性机制，而这些机制以前是通过试验和生物模仿来发现的。",
    "tldr": "该论文介绍了一种结合了物理实验、数值模拟和人工神经网络的可推广管道，用于系统地发现具有最佳刚度-韧度权衡的微结构复合材料。这种方法通过嵌套循环的建议-验证工作流，成功弥合了模拟和现实之间的差距，并以高样本效率发现了刚度和韧度兼具的材料。进一步分析帕累托最优设计，可以自动识别出现有的增加韧性机制。"
}