{
    "title": "Graph Laplacians on Shared Nearest Neighbor graphs and graph Laplacians on $k$-Nearest Neighbor graphs having the same limit. (arXiv:2302.12399v2 [stat.ML] UPDATED)",
    "abstract": "A Shared Nearest Neighbor (SNN) graph is a type of graph construction using shared nearest neighbor information, which is a secondary similarity measure based on the rankings induced by a primary $k$-nearest neighbor ($k$-NN) measure. SNN measures have been touted as being less prone to the curse of dimensionality than conventional distance measures, and thus methods using SNN graphs have been widely used in applications, particularly in clustering high-dimensional data sets and in finding outliers in subspaces of high dimensional data. Despite this, the theoretical study of SNN graphs and graph Laplacians remains unexplored. In this pioneering work, we make the first contribution in this direction. We show that large scale asymptotics of an SNN graph Laplacian reach a consistent continuum limit; this limit is the same as that of a $k$-NN graph Laplacian. Moreover, we show that the pointwise convergence rate of the graph Laplacian is linear with respect to $(k/n)^{1/m}$ with high proba",
    "link": "http://arxiv.org/abs/2302.12399",
    "context": "Title: Graph Laplacians on Shared Nearest Neighbor graphs and graph Laplacians on $k$-Nearest Neighbor graphs having the same limit. (arXiv:2302.12399v2 [stat.ML] UPDATED)\nAbstract: A Shared Nearest Neighbor (SNN) graph is a type of graph construction using shared nearest neighbor information, which is a secondary similarity measure based on the rankings induced by a primary $k$-nearest neighbor ($k$-NN) measure. SNN measures have been touted as being less prone to the curse of dimensionality than conventional distance measures, and thus methods using SNN graphs have been widely used in applications, particularly in clustering high-dimensional data sets and in finding outliers in subspaces of high dimensional data. Despite this, the theoretical study of SNN graphs and graph Laplacians remains unexplored. In this pioneering work, we make the first contribution in this direction. We show that large scale asymptotics of an SNN graph Laplacian reach a consistent continuum limit; this limit is the same as that of a $k$-NN graph Laplacian. Moreover, we show that the pointwise convergence rate of the graph Laplacian is linear with respect to $(k/n)^{1/m}$ with high proba",
    "path": "papers/23/02/2302.12399.json",
    "total_tokens": 1077,
    "translated_title": "基于共享最近邻信息的图拉普拉斯算子和基于 k 近邻图的图拉普拉斯算子具有相同的极限",
    "translated_abstract": "共享最近邻图是一种使用共享最近邻信息构建的图形结构，其是一种基于主要的 k 近邻度量诱导的排名的二级相似度测量。SNN 测量被认为比传统距离测量法更不容易受到维数诅咒的影响，因此使用 SNN 图的方法已经被广泛应用于应用程序中，特别是在聚类高维数据集和在高维数据子空间中查找异常值中。尽管如此，仍未对 SNN 图和图拉普拉斯算子进行理论研究。在这项开创性工作中，我们首次在这个方向上做出了贡献。我们展示了 SNN 图拉普拉斯算子的大规模渐近性达到了一致的连续极限；这个极限与 k 近邻图拉普拉斯算子的极限相同。此外，我们证明了图拉普拉斯算子的逐点收敛速率与 $(k/n)^{1/m}$ 成线性关系，概率高。",
    "tldr": "本文开创性地研究了共享最近邻图和图拉普拉斯算子，证明了共享最近邻图拉普拉斯算子和 k 近邻图拉普拉斯算子具有相同的连续极限，同时发现它们的图拉普拉斯算子逐点收敛速率与 $(k/n)^{1/m}$ 成线性关系。",
    "en_tdlr": "This pioneering work explores the graph Laplacians on Shared Nearest Neighbor (SNN) graphs and k-Nearest Neighbor (k-NN) graphs, and shows that the large scale asymptotics of an SNN graph Laplacian reach a consistent continuum limit that is the same as that of a k-NN graph Laplacian. The paper also reveals a linear relationship between the pointwise convergence rate of the graph Laplacian and $(k/n)^{1/m}$."
}