{
    "title": "SLIM: Sparsified Late Interaction for Multi-Vector Retrieval with Inverted Indexes. (arXiv:2302.06587v2 [cs.IR] UPDATED)",
    "abstract": "This paper introduces Sparsified Late Interaction for Multi-vector (SLIM) retrieval with inverted indexes. Multi-vector retrieval methods have demonstrated their effectiveness on various retrieval datasets, and among them, ColBERT is the most established method based on the late interaction of contextualized token embeddings of pre-trained language models. However, efficient ColBERT implementations require complex engineering and cannot take advantage of off-the-shelf search libraries, impeding their practical use. To address this issue, SLIM first maps each contextualized token vector to a sparse, high-dimensional lexical space before performing late interaction between these sparse token embeddings. We then introduce an efficient two-stage retrieval architecture that includes inverted index retrieval followed by a score refinement module to approximate the sparsified late interaction, which is fully compatible with off-the-shelf lexical search libraries such as Lucene. SLIM achieves ",
    "link": "http://arxiv.org/abs/2302.06587",
    "context": "Title: SLIM: Sparsified Late Interaction for Multi-Vector Retrieval with Inverted Indexes. (arXiv:2302.06587v2 [cs.IR] UPDATED)\nAbstract: This paper introduces Sparsified Late Interaction for Multi-vector (SLIM) retrieval with inverted indexes. Multi-vector retrieval methods have demonstrated their effectiveness on various retrieval datasets, and among them, ColBERT is the most established method based on the late interaction of contextualized token embeddings of pre-trained language models. However, efficient ColBERT implementations require complex engineering and cannot take advantage of off-the-shelf search libraries, impeding their practical use. To address this issue, SLIM first maps each contextualized token vector to a sparse, high-dimensional lexical space before performing late interaction between these sparse token embeddings. We then introduce an efficient two-stage retrieval architecture that includes inverted index retrieval followed by a score refinement module to approximate the sparsified late interaction, which is fully compatible with off-the-shelf lexical search libraries such as Lucene. SLIM achieves ",
    "path": "papers/23/02/2302.06587.json",
    "total_tokens": 887,
    "translated_title": "SLIM: 带倒排索引的多向量检索中的稀疏化晚互动",
    "translated_abstract": "本文提出了一种带倒排索引的多向量( SLIM ) 检索方法。在多向量检索方法中，ColBERT是基于预训练语言模型的上下文化令牌嵌入的后期交互最成熟的方法。然而，有效实现ColBERT需要复杂的工程，不利于实际应用。为解决这个问题，SLIM首先将每个上下文化的令牌向量映射到一个稀疏的高维词汇空间，然后在这些稀疏的令牌嵌入之间执行晚期交互。然后，我们介绍了一种高效的两阶段检索体系结构，包括倒排索引检索和分数细化模块，以近似稀疏化的晚期交互，并与诸如Lucene这样的现成词库搜索库完全兼容。SLIM在各种检索数据集上实现了与ColBERT相当的性能，但具有更高的实用性和可扩展性。",
    "tldr": "SLIM是一种带倒排索引的多向量检索方法，通过对上下文化令牌嵌入进行稀疏化处理和晚期交互实现有效检索，且可与现成词库搜索库完全兼容。",
    "en_tdlr": "SLIM is a multi-vector retrieval method with inverted indexes that achieves efficient retrieval by sparsifying and late interacting contextualized token embeddings, and is fully compatible with off-the-shelf search libraries."
}