{
    "title": "MDF-Net for Abnormality Detection by Fusing X-Rays with Clinical Data. (arXiv:2302.13390v2 [eess.IV] UPDATED)",
    "abstract": "This study investigates the effects of including patients' clinical information on the performance of deep learning (DL) classifiers for disease location in chest X-ray images. Although current classifiers achieve high performance using chest X-ray images alone, our interviews with radiologists indicate that clinical data is highly informative and essential for interpreting images and making proper diagnoses.  In this work, we propose a novel architecture consisting of two fusion methods that enable the model to simultaneously process patients' clinical data (structured data) and chest X-rays (image data). Since these data modalities are in different dimensional spaces, we propose a spatial arrangement strategy, spatialization, to facilitate the multimodal learning process in a Mask R-CNN model. We performed an extensive experimental evaluation using MIMIC-Eye, a dataset comprising modalities: MIMIC-CXR (chest X-ray images), MIMIC IV-ED (patients' clinical data), and REFLACX (annotatio",
    "link": "http://arxiv.org/abs/2302.13390",
    "context": "Title: MDF-Net for Abnormality Detection by Fusing X-Rays with Clinical Data. (arXiv:2302.13390v2 [eess.IV] UPDATED)\nAbstract: This study investigates the effects of including patients' clinical information on the performance of deep learning (DL) classifiers for disease location in chest X-ray images. Although current classifiers achieve high performance using chest X-ray images alone, our interviews with radiologists indicate that clinical data is highly informative and essential for interpreting images and making proper diagnoses.  In this work, we propose a novel architecture consisting of two fusion methods that enable the model to simultaneously process patients' clinical data (structured data) and chest X-rays (image data). Since these data modalities are in different dimensional spaces, we propose a spatial arrangement strategy, spatialization, to facilitate the multimodal learning process in a Mask R-CNN model. We performed an extensive experimental evaluation using MIMIC-Eye, a dataset comprising modalities: MIMIC-CXR (chest X-ray images), MIMIC IV-ED (patients' clinical data), and REFLACX (annotatio",
    "path": "papers/23/02/2302.13390.json",
    "total_tokens": 977,
    "translated_title": "MDF-Net：结合X射线与临床数据用于异常检测的方法",
    "translated_abstract": "本研究探讨将患者的临床信息加入深度学习分类器以提高胸部X射线图像疾病定位性能的影响。当前的分类器在使用胸部X射线图像时具有高性能，但我们对放射科医生的访谈表明，临床数据对于解释图像和做出正确的诊断来说非常重要，并具有很高的信息量。我们提出了一种新颖的架构，该架构由两种融合方法组成，使得模型能够同时处理患者的临床数据（结构化数据）和胸部X射线（图像数据）。由于这两种数据模态在不同的维度空间中，因此我们提出了一种空间排列策略空间化，以便在Mask R-CNN模型中促进多模态学习过程。我们使用包含多种数据模态的MIMIC-Eye数据集进行了广泛的实验评估：MIMIC-CXR（胸部X射线图像）、MIMIC IV-ED（患者的临床数据）和REFLACX（评估注释）。实验结果表明，我们提出的MDF-Net相比当前最先进方法具有更优异的性能。",
    "tldr": "本研究提出了一种多模态融合方法MDF-Net，将临床数据与胸部X射线图像相结合，成功地提高了疾病定位的性能表现。",
    "en_tdlr": "This study proposes a multi-modal fusion method, MDF-Net, that combines clinical data with chest X-ray images, and successfully improves disease localization performance."
}