{
    "title": "Macroeconomic Forecasting using Dynamic Factor Models: The Case of Morocco. (arXiv:2302.14180v3 [econ.EM] UPDATED)",
    "abstract": "This article discusses the use of dynamic factor models in macroeconomic forecasting, with a focus on the Factor-Augmented Error Correction Model (FECM). The FECM combines the advantages of cointegration and dynamic factor models, providing a flexible and reliable approach to macroeconomic forecasting, especially for non-stationary variables. We evaluate the forecasting performance of the FECM model on a large dataset of 117 Moroccan economic series with quarterly frequency. Our study shows that FECM outperforms traditional econometric models in terms of forecasting accuracy and robustness. The inclusion of long-term information and common factors in FECM enhances its ability to capture economic dynamics and leads to better forecasting performance than other competing models. Our results suggest that FECM can be a valuable tool for macroeconomic forecasting in Morocco and other similar economies.",
    "link": "http://arxiv.org/abs/2302.14180",
    "context": "Title: Macroeconomic Forecasting using Dynamic Factor Models: The Case of Morocco. (arXiv:2302.14180v3 [econ.EM] UPDATED)\nAbstract: This article discusses the use of dynamic factor models in macroeconomic forecasting, with a focus on the Factor-Augmented Error Correction Model (FECM). The FECM combines the advantages of cointegration and dynamic factor models, providing a flexible and reliable approach to macroeconomic forecasting, especially for non-stationary variables. We evaluate the forecasting performance of the FECM model on a large dataset of 117 Moroccan economic series with quarterly frequency. Our study shows that FECM outperforms traditional econometric models in terms of forecasting accuracy and robustness. The inclusion of long-term information and common factors in FECM enhances its ability to capture economic dynamics and leads to better forecasting performance than other competing models. Our results suggest that FECM can be a valuable tool for macroeconomic forecasting in Morocco and other similar economies.",
    "path": "papers/23/02/2302.14180.json",
    "total_tokens": 992,
    "translated_title": "应用动态因子模型进行宏观经济预测：以摩洛哥为例",
    "translated_abstract": "本文讨论了在宏观经济预测中应用动态因子模型的方法，重点介绍了因子扩展误差纠正模型（FECM）。FECM将协整和动态因子模型的优势结合起来，为宏观经济预测提供了一种灵活可靠的方法，特别适合处理非平稳变量。本文在117个摩洛哥经济系列的大型数据集上评估了FECM模型的预测性能，研究表明FECM在预测准确性和鲁棒性方面优于传统计量经济模型。FECM在长期信息和共同因素的包括下，增强了其捕捉经济动态的能力，并导致比其他竞争模型更好的预测性能。我们的结果表明，FECM可以成为摩洛哥和其他类似经济体宏观经济预测中有价值的工具。",
    "tldr": "本文探讨了应用动态因子模型进行宏观经济预测的方法，重点介绍了因子扩展误差纠正模型（FECM）的优势，FECM将协整和动态因子模型的优势结合起来，能比传统计量经济模型更好地捕捉经济动态和提高预测准确性和鲁棒性，是在摩洛哥等类似经济体宏观经济预测中有价值的工具。",
    "en_tdlr": "This article discusses the advantages of the Factor-Augmented Error Correction Model (FECM) in using dynamic factor models for macroeconomic forecasting, showing that it can better capture economic dynamics and provide improved forecasting accuracy and robustness compared to traditional econometric models. The inclusion of long-term information and common factors enhances its performance, making FECM a valuable tool for macroeconomic forecasting in Morocco and other similar economies."
}