{
    "title": "Graph Adversarial Immunization for Certifiable Robustness. (arXiv:2302.08051v2 [cs.LG] UPDATED)",
    "abstract": "Despite achieving great success, graph neural networks (GNNs) are vulnerable to adversarial attacks. Existing defenses focus on developing adversarial training or model modification. In this paper, we propose and formulate graph adversarial immunization, i.e., vaccinating part of graph structure to improve certifiable robustness of graph against any admissible adversarial attack. We first propose edge-level immunization to vaccinate node pairs. Unfortunately, such edge-level immunization cannot defend against emerging node injection attacks, since it only immunizes existing node pairs. To this end, we further propose node-level immunization. To avoid computationally intensive combinatorial optimization associated with adversarial immunization, we develop AdvImmune-Edge and AdvImmune-Node algorithms to effectively obtain the immune node pairs or nodes. Extensive experiments demonstrate the superiority of AdvImmune methods. In particular, AdvImmune-Node remarkably improves the ratio of r",
    "link": "http://arxiv.org/abs/2302.08051",
    "context": "Title: Graph Adversarial Immunization for Certifiable Robustness. (arXiv:2302.08051v2 [cs.LG] UPDATED)\nAbstract: Despite achieving great success, graph neural networks (GNNs) are vulnerable to adversarial attacks. Existing defenses focus on developing adversarial training or model modification. In this paper, we propose and formulate graph adversarial immunization, i.e., vaccinating part of graph structure to improve certifiable robustness of graph against any admissible adversarial attack. We first propose edge-level immunization to vaccinate node pairs. Unfortunately, such edge-level immunization cannot defend against emerging node injection attacks, since it only immunizes existing node pairs. To this end, we further propose node-level immunization. To avoid computationally intensive combinatorial optimization associated with adversarial immunization, we develop AdvImmune-Edge and AdvImmune-Node algorithms to effectively obtain the immune node pairs or nodes. Extensive experiments demonstrate the superiority of AdvImmune methods. In particular, AdvImmune-Node remarkably improves the ratio of r",
    "path": "papers/23/02/2302.08051.json",
    "total_tokens": 953,
    "translated_title": "图对抗免疫以实现可证明的鲁棒性",
    "translated_abstract": "尽管图神经网络（GNNs）取得了巨大的成功，但它们对抗对抗性攻击是脆弱的。现有的防御方法集中在开发对抗性训练或模型修改。在本文中，我们提出并制定了图对抗免疫，即通过疫苗接种图结构的一部分来改善图的可证明鲁棒性对抗任何可接受的对抗性攻击。我们首先提出了基于边的免疫，来对节点对进行疫苗接种。不幸的是，这种基于边的免疫不能抵御新出现的节点注入攻击，因为它只对现有的节点对进行免疫。为此，我们进一步提出了基于节点的免疫。为了避免与对抗性免疫相关的计算密集的组合优化问题，我们开发了AdvImmune-Edge和AdvImmune-Node算法，以有效获取免疫节点对或节点。大量实验证明了AdvImmune方法的优越性。特别是，AdvImmune-Node显著提高了r的比例。",
    "tldr": "本文提出了图对抗免疫方法，通过疫苗接种一部分图结构来提高图的鲁棒性，避免对抗性攻击。通过边和节点两种免疫方式，可以有效地提高图的抵抗能力。"
}