{
    "title": "Market-Based Probability of Stock Returns",
    "abstract": "Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.",
    "link": "https://arxiv.org/abs/2302.07935",
    "context": "Title: Market-Based Probability of Stock Returns\nAbstract: Markets possess all available information on stock returns. The randomness of market trade determines the statistics of stock returns. This paper describes the dependence of the first four market-based statistical moments of stock returns on statistical moments and correlations of current and past trade values. The mean return of trades during the averaging period coincides with Markowitz's definition of portfolio value weighted return. We derive the market-based volatility of return and return-value correlations. We present approximations of the characteristic functions and probability measures of stock return by a finite number of market-based statistical moments. To forecast market-based average return or volatility of return, one should predict the statistical moments and correlations of current and past market trade values at the same time horizon.",
    "path": "papers/23/02/2302.07935.json",
    "total_tokens": 785,
    "translated_title": "基于市场的股票回报概率",
    "translated_abstract": "市场拥有关于股票回报的所有可用信息。市场交易的随机性决定了股票回报的统计学特征。本文描述了股票回报的前四个基于市场的统计学特征与当前和过去交易值的统计学特征和相关性之间的依赖关系。在加权平均期间进行交易的平均回报与马科威茨对投资组合价值加权回报的定义相吻合。我们推导了基于市场的回报波动率和回报-价值相关性。通过有限数量的基于市场的统计学特征的特征函数和概率度量，我们提出了对股票回报的近似预测方法。要预测基于市场的平均回报或回报波动率，必须同时预测当前和过去市场交易值的统计学特征和相关性，以相同的时间跨度。",
    "tldr": "本论文研究了基于市场的股票回报概率，发现市场拥有股票回报的所有信息，并探讨了回报的统计学特征与当前和过去交易值的统计学特征和相关性之间的关系。",
    "en_tdlr": "This paper investigates the market-based probability of stock returns, revealing that markets possess all available information on stock returns, and examines the relationship between the statistical moments and correlations of stock returns and current and past trade values."
}