{
    "title": "Natural Response Generation for Chinese Reading Comprehension. (arXiv:2302.08817v2 [cs.CL] UPDATED)",
    "abstract": "Machine reading comprehension (MRC) is an important area of conversation agents and draws a lot of attention. However, there is a notable limitation to current MRC benchmarks: The labeled answers are mostly either spans extracted from the target corpus or the choices of the given candidates, ignoring the natural aspect of high-quality responses. As a result, MRC models trained on these datasets can not generate human-like responses in real QA scenarios. To this end, we construct a new dataset called Penguin to promote the research of MRC, providing a training and test bed for natural response generation to real scenarios. Concretely, Penguin consists of 200k training data with high-quality fluent, and well-informed responses. Penguin is the first benchmark towards natural response generation in Chinese MRC on a relatively large scale. To address the challenges in Penguin, we develop two strong baselines: end-to-end and two-stage frameworks. Following that, we further design Prompt-BART",
    "link": "http://arxiv.org/abs/2302.08817",
    "context": "Title: Natural Response Generation for Chinese Reading Comprehension. (arXiv:2302.08817v2 [cs.CL] UPDATED)\nAbstract: Machine reading comprehension (MRC) is an important area of conversation agents and draws a lot of attention. However, there is a notable limitation to current MRC benchmarks: The labeled answers are mostly either spans extracted from the target corpus or the choices of the given candidates, ignoring the natural aspect of high-quality responses. As a result, MRC models trained on these datasets can not generate human-like responses in real QA scenarios. To this end, we construct a new dataset called Penguin to promote the research of MRC, providing a training and test bed for natural response generation to real scenarios. Concretely, Penguin consists of 200k training data with high-quality fluent, and well-informed responses. Penguin is the first benchmark towards natural response generation in Chinese MRC on a relatively large scale. To address the challenges in Penguin, we develop two strong baselines: end-to-end and two-stage frameworks. Following that, we further design Prompt-BART",
    "path": "papers/23/02/2302.08817.json",
    "total_tokens": 915,
    "translated_title": "中文阅读理解的自然响应生成",
    "translated_abstract": "机器阅读理解(MRC)是对话代理的重要领域，引起了很多关注。然而，当前MRC基准的一个明显限制是：标记的答案大多数是从目标语料库中提取的片段或给定候选项的选择，忽略了高质量响应的自然性。因此，在这些数据集上训练的MRC模型无法在真实的问答场景中生成类似人类的响应。为此，我们构建了一个名为Penguin的新数据集，以促进MRC研究，在真实场景中提供自然响应生成的训练和测试基础。具体而言，Penguin包含20万个训练数据，具备高质量、流畅、充分信息的响应。Penguin是相对规模较大的中文MRC领域自然响应生成的第一个基准。为了解决Penguin中的挑战，我们开发了两个强大的基准模型：端到端和两阶段框架。在此基础上，我们进一步设计出Prompt-BART。",
    "tldr": "本研究构建了一个新的数据集Penguin，旨在促进中文阅读理解中自然响应生成的研究，提供了一个相对较大的训练和测试平台。通过开发两个强大的基准模型，我们解决了Penguin中的挑战。"
}