{
    "title": "Memory-augmented Online Video Anomaly Detection. (arXiv:2302.10719v2 [cs.CV] UPDATED)",
    "abstract": "The ability to understand the surrounding scene is of paramount importance for Autonomous Vehicles (AVs). This paper presents a system capable to work in an online fashion, giving an immediate response to the arise of anomalies surrounding the AV, exploiting only the videos captured by a dash-mounted camera. Our architecture, called MOVAD, relies on two main modules: a Short-Term Memory Module to extract information related to the ongoing action, implemented by a Video Swin Transformer (VST), and a Long-Term Memory Module injected inside the classifier that considers also remote past information and action context thanks to the use of a Long-Short Term Memory (LSTM) network. The strengths of MOVAD are not only linked to its excellent performance, but also to its straightforward and modular architecture, trained in a end-to-end fashion with only RGB frames with as less assumptions as possible, which makes it easy to implement and play with. We evaluated the performance of our method on ",
    "link": "http://arxiv.org/abs/2302.10719",
    "context": "Title: Memory-augmented Online Video Anomaly Detection. (arXiv:2302.10719v2 [cs.CV] UPDATED)\nAbstract: The ability to understand the surrounding scene is of paramount importance for Autonomous Vehicles (AVs). This paper presents a system capable to work in an online fashion, giving an immediate response to the arise of anomalies surrounding the AV, exploiting only the videos captured by a dash-mounted camera. Our architecture, called MOVAD, relies on two main modules: a Short-Term Memory Module to extract information related to the ongoing action, implemented by a Video Swin Transformer (VST), and a Long-Term Memory Module injected inside the classifier that considers also remote past information and action context thanks to the use of a Long-Short Term Memory (LSTM) network. The strengths of MOVAD are not only linked to its excellent performance, but also to its straightforward and modular architecture, trained in a end-to-end fashion with only RGB frames with as less assumptions as possible, which makes it easy to implement and play with. We evaluated the performance of our method on ",
    "path": "papers/23/02/2302.10719.json",
    "total_tokens": 941,
    "translated_title": "基于记忆的在线视频异常检测",
    "translated_abstract": "对于自动驾驶汽车来说，理解周围环境的能力非常重要。本文介绍了一种能够在线工作的系统，以立即响应围绕自动驾驶汽车出现的异常情况，仅利用由仪表盘摄像头捕获的视频。我们的架构名为MOVAD，依赖于两个主要模块：短期记忆模块，用于提取与正在进行的操作相关的信息，由视频Swing Transformer (VST) 实现，以及嵌入在分类器内部的长期记忆模块，通过使用长短期记忆 (LSTM) 网络考虑远程过去的信息和操作背景。MOVAD的优势不仅在于其出色的性能，还在于其简单直观和模块化的架构，仅使用RGB帧以尽可能少的假设进行端到端训练，使其易于实施和应用。我们在...",
    "tldr": "本文提出了一种基于记忆的在线视频异常检测系统，能够在自动驾驶汽车周围的异常情况出现时迅速响应，利用仪表盘摄像头捕获的视频数据，并采用了短期和长期记忆模块来提取相关信息。该系统具有出色的性能和简单直观的架构，并且利用RGB帧进行了端到端训练。"
}