{
    "title": "Extreme Points and First-Order Stochastic Dominance: Theory and Applications. (arXiv:2302.03135v2 [econ.TH] UPDATED)",
    "abstract": "We characterize the extreme points of first-order stochastic dominance (FOSD) intervals and show how these intervals are at the heart of many topics in economics. Using these extreme points, we characterize the distributions of posterior quantiles, leading to an analog of a classical result regarding the distributions of posterior means. We apply this analog to various subjects, including the psychology of judgement, political economy, and Bayesian persuasion. In addition, FOSD intervals provide a common structure to security design. We use the extreme points to unify and generalize seminal results in that literature when either adverse selection or moral hazard pertains.",
    "link": "http://arxiv.org/abs/2302.03135",
    "context": "Title: Extreme Points and First-Order Stochastic Dominance: Theory and Applications. (arXiv:2302.03135v2 [econ.TH] UPDATED)\nAbstract: We characterize the extreme points of first-order stochastic dominance (FOSD) intervals and show how these intervals are at the heart of many topics in economics. Using these extreme points, we characterize the distributions of posterior quantiles, leading to an analog of a classical result regarding the distributions of posterior means. We apply this analog to various subjects, including the psychology of judgement, political economy, and Bayesian persuasion. In addition, FOSD intervals provide a common structure to security design. We use the extreme points to unify and generalize seminal results in that literature when either adverse selection or moral hazard pertains.",
    "path": "papers/23/02/2302.03135.json",
    "total_tokens": 813,
    "translated_title": "极值与一阶随机支配：理论与应用",
    "translated_abstract": "我们对一阶随机支配(FOSD)区间的极值进行了表征，并展示了这些区间在经济学中许多主题中的核心作用。利用这些极值，我们表征了后验分位数的分布，从而得到了关于后验均值分布的经典结果的类比。我们将这个类比应用于各种主题，包括判断心理学、政治经济学和贝叶斯说服。此外，FOSD区间提供了一个通用的证券设计结构。当涉及到不良选择或道德风险时，我们使用极值来统一和概括该文献中的重要结果。",
    "tldr": "该论文以一阶随机支配(FOSD)区间的极值为基础，研究了一些关于经济学中的重要问题，如心理判断、政治经济学和证券设计。其中，使用极值表征后验分位数的分布得到了关于后验均值分布的类比，并且还统一和概括了涉及不良选择或道德风险的重要结果及文献。",
    "en_tdlr": "This paper focuses on the extreme points of first-order stochastic dominance (FOSD) intervals and explores their importance in various economic topics such as judgment psychology, political economy, and security design. The paper characterizes the distributions of posterior quantiles using these extreme points and unifies and generalizes seminal results in literature concerning adverse selection or moral hazard."
}