{
    "title": "Multiobjective Evolutionary Pruning of Deep Neural Networks with Transfer Learning for improving their Performance and Robustness",
    "abstract": "Evolutionary Computation algorithms have been used to solve optimization problems in relation with architectural, hyper-parameter or training configuration, forging the field known today as Neural Architecture Search. These algorithms have been combined with other techniques such as the pruning of Neural Networks, which reduces the complexity of the network, and the Transfer Learning, which lets the import of knowledge from another problem related to the one at hand. The usage of several criteria to evaluate the quality of the evolutionary proposals is also a common case, in which the performance and complexity of the network are the most used criteria. This work proposes MO-EvoPruneDeepTL, a multi-objective evolutionary pruning algorithm. MO-EvoPruneDeepTL uses Transfer Learning to adapt the last layers of Deep Neural Networks, by replacing them with sparse layers evolved by a genetic algorithm, which guides the evolution based in the performance, complexity and robustness of the netw",
    "link": "https://arxiv.org/abs/2302.10253",
    "context": "Title: Multiobjective Evolutionary Pruning of Deep Neural Networks with Transfer Learning for improving their Performance and Robustness\nAbstract: Evolutionary Computation algorithms have been used to solve optimization problems in relation with architectural, hyper-parameter or training configuration, forging the field known today as Neural Architecture Search. These algorithms have been combined with other techniques such as the pruning of Neural Networks, which reduces the complexity of the network, and the Transfer Learning, which lets the import of knowledge from another problem related to the one at hand. The usage of several criteria to evaluate the quality of the evolutionary proposals is also a common case, in which the performance and complexity of the network are the most used criteria. This work proposes MO-EvoPruneDeepTL, a multi-objective evolutionary pruning algorithm. MO-EvoPruneDeepTL uses Transfer Learning to adapt the last layers of Deep Neural Networks, by replacing them with sparse layers evolved by a genetic algorithm, which guides the evolution based in the performance, complexity and robustness of the netw",
    "path": "papers/23/02/2302.10253.json",
    "total_tokens": 844,
    "translated_title": "使用迁移学习的多目标进化剪枝深度神经网络来提高其性能和鲁棒性",
    "translated_abstract": "进化计算算法已被用于解决与架构、超参数或训练配置相关的优化问题，形成了现在所称的神经架构搜索领域。这些算法已与神经网络剪枝等技术相结合，将网络的复杂性减小，以及迁移学习等技术相结合，使其能够从其他相关问题中导入知识。同时，使用多个准则来评估进化提议的质量也是常见的情况，其中网络的性能和复杂性是最常用的准则。本文提出了一种名为MO-EvoPruneDeepTL的多目标进化剪枝算法。MO-EvoPruneDeepTL使用迁移学习来调整深度神经网络的最后几层，通过用遗传算法进化出的稀疏层替换它们，从而指导基于性能、复杂性和鲁棒性的进化过程。",
    "tldr": "这项工作提出了一种名为MO-EvoPruneDeepTL的多目标进化剪枝算法，使用迁移学习来提高深度神经网络的性能和鲁棒性。en_tdlr: This work presents MO-EvoPruneDeepTL, a multi-objective evolutionary pruning algorithm that uses transfer learning to improve the performance and robustness of deep neural networks."
}