{
    "title": "A Review on Generative Adversarial Networks for Data Augmentation in Person Re-Identification Systems. (arXiv:2302.09119v3 [cs.CV] UPDATED)",
    "abstract": "Interest in automatic people re-identification systems has significantly grown in recent years, mainly for developing surveillance and smart shops software. Due to the variability in person posture, different lighting conditions, and occluded scenarios, together with the poor quality of the images obtained by different cameras, it is currently an unsolved problem. In machine learning-based computer vision applications with reduced data sets, one possibility to improve the performance of re-identification system is through the augmentation of the set of images or videos available for training the neural models. Currently, one of the most robust ways to generate synthetic information for data augmentation, whether it is video, images or text, are the generative adversarial networks. This article reviews the most relevant recent approaches to improve the performance of person re-identification models through data augmentation, using generative adversarial networks. We focus on three categ",
    "link": "http://arxiv.org/abs/2302.09119",
    "context": "Title: A Review on Generative Adversarial Networks for Data Augmentation in Person Re-Identification Systems. (arXiv:2302.09119v3 [cs.CV] UPDATED)\nAbstract: Interest in automatic people re-identification systems has significantly grown in recent years, mainly for developing surveillance and smart shops software. Due to the variability in person posture, different lighting conditions, and occluded scenarios, together with the poor quality of the images obtained by different cameras, it is currently an unsolved problem. In machine learning-based computer vision applications with reduced data sets, one possibility to improve the performance of re-identification system is through the augmentation of the set of images or videos available for training the neural models. Currently, one of the most robust ways to generate synthetic information for data augmentation, whether it is video, images or text, are the generative adversarial networks. This article reviews the most relevant recent approaches to improve the performance of person re-identification models through data augmentation, using generative adversarial networks. We focus on three categ",
    "path": "papers/23/02/2302.09119.json",
    "total_tokens": 850,
    "translated_title": "一项关于生成对抗网络在人员再识别系统数据增强中的综述",
    "translated_abstract": "近年来，自动人员再识别系统的兴趣显着增加，主要是为了开发监控和智能店铺软件。由于人员姿势的变化、不同的照明条件和遮挡情况，以及不同摄像头获得的图像质量较差，这是目前尚未解决的问题。在基于机器学习的计算机视觉应用中，通过扩展模型训练所需的图像或视频集合来改进再识别系统的性能是一种可能性。目前，生成对抗网络是生成合成信息进行数据增强的最强大方式之一，无论是视频、图像还是文本。本文综述了使用生成对抗网络通过数据增强来改进人员再识别模型性能的最新方法。我们关注三个分类：(1) 基于深度学习的生成对抗网络数据增强方法，(2) 基于生成对抗网络的时空数据扩展方法，(3) 基于生成对抗网络的跨摄像头域自适应方法。",
    "tldr": "本文综述了使用生成对抗网络通过数据增强来改进人员再识别模型性能的最新方法。",
    "en_tdlr": "This article reviews the latest approaches to improve the performance of person re-identification models through data augmentation using generative adversarial networks."
}