{
    "title": "Efficiently handling constraints with Metropolis-adjusted Langevin algorithm. (arXiv:2302.11971v2 [stat.CO] UPDATED)",
    "abstract": "In this study, we investigate the performance of the Metropolis-adjusted Langevin algorithm in a setting with constraints on the support of the target distribution. We provide a rigorous analysis of the resulting Markov chain, establishing its convergence and deriving an upper bound for its mixing time. Our results demonstrate that the Metropolis-adjusted Langevin algorithm is highly effective in handling this challenging situation: the mixing time bound we obtain is superior to the best known bounds for competing algorithms without an accept-reject step. Our numerical experiments support these theoretical findings, indicating that the Metropolis-adjusted Langevin algorithm shows promising performance when dealing with constraints on the support of the target distribution.",
    "link": "http://arxiv.org/abs/2302.11971",
    "context": "Title: Efficiently handling constraints with Metropolis-adjusted Langevin algorithm. (arXiv:2302.11971v2 [stat.CO] UPDATED)\nAbstract: In this study, we investigate the performance of the Metropolis-adjusted Langevin algorithm in a setting with constraints on the support of the target distribution. We provide a rigorous analysis of the resulting Markov chain, establishing its convergence and deriving an upper bound for its mixing time. Our results demonstrate that the Metropolis-adjusted Langevin algorithm is highly effective in handling this challenging situation: the mixing time bound we obtain is superior to the best known bounds for competing algorithms without an accept-reject step. Our numerical experiments support these theoretical findings, indicating that the Metropolis-adjusted Langevin algorithm shows promising performance when dealing with constraints on the support of the target distribution.",
    "path": "papers/23/02/2302.11971.json",
    "total_tokens": 715,
    "translated_title": "用Metropolis-adjusted Langevin算法高效处理约束条件",
    "translated_abstract": "本研究探讨了在目标分布支撑集上施加约束条件时，Metropolis-adjusted Langevin算法的性能。我们对其得出的马尔可夫链进行了严格分析，证明其收敛性并推导了其混合时间的上界。我们的结果表明，Metropolis-adjusted Langevin算法在处理这种具有挑战性的情况方面非常有效：我们得到的混合时间上界优于无接受-拒绝步骤的竞争算法的最佳已知上界。我们的数值实验支持这些理论发现，表明Metropolis-adjusted Langevin算法在处理目标分布支撑集约束时具有良好的性能。",
    "tldr": "本研究提出了Metropolis-adjusted Langevin算法来处理带有约束条件的目标分布，理论和实验结果表明该算法在处理这种情况时效果优于竞争算法。",
    "en_tdlr": "This paper presents the Metropolis-adjusted Langevin algorithm to handle constrained target distribution, and both theoretical and numerical results demonstrate its effectiveness over competing algorithms in this challenging situation."
}