{
    "title": "A Pre-training Framework for Knowledge Graph Completion. (arXiv:2302.02614v2 [cs.AI] UPDATED)",
    "abstract": "Knowledge graph completion (KGC) is one of the effective methods to identify new facts in knowledge graph. Except for a few methods based on graph network, most of KGC methods trend to be trained based on independent triples, while are difficult to take a full account of the information of global network connection contained in knowledge network. To address these issues, in this study, we propose a simple and effective Network-based Pre-training framework for knowledge graph completion (termed NetPeace), which takes into account the information of global network connection and local triple relationships in knowledge graph. Experiments show that in NetPeace framework, multiple KGC models yields consistent and significant improvements on benchmarks (e.g., 36.45% Hits@1 and 27.40% MRR improvements for TuckER on FB15k-237), especially dense knowledge graph. On the challenging low-resource task, NetPeace that benefits from the global features of KG achieves higher performance (104.03% MRR a",
    "link": "http://arxiv.org/abs/2302.02614",
    "context": "Title: A Pre-training Framework for Knowledge Graph Completion. (arXiv:2302.02614v2 [cs.AI] UPDATED)\nAbstract: Knowledge graph completion (KGC) is one of the effective methods to identify new facts in knowledge graph. Except for a few methods based on graph network, most of KGC methods trend to be trained based on independent triples, while are difficult to take a full account of the information of global network connection contained in knowledge network. To address these issues, in this study, we propose a simple and effective Network-based Pre-training framework for knowledge graph completion (termed NetPeace), which takes into account the information of global network connection and local triple relationships in knowledge graph. Experiments show that in NetPeace framework, multiple KGC models yields consistent and significant improvements on benchmarks (e.g., 36.45% Hits@1 and 27.40% MRR improvements for TuckER on FB15k-237), especially dense knowledge graph. On the challenging low-resource task, NetPeace that benefits from the global features of KG achieves higher performance (104.03% MRR a",
    "path": "papers/23/02/2302.02614.json",
    "total_tokens": 925,
    "translated_title": "知识图谱补全的预训练框架",
    "translated_abstract": "知识图谱补全(KGC)是确定知识图谱中新事实的有效方法之一。除了一些基于图网络的方法外，大部分KGC方法倾向于基于独立的三元组进行训练，很难考虑到知识网络中包含的全局网络连接信息。为了解决这些问题，本研究提出了一个简单有效的基于网络的预训练框架NetPeace，该框架考虑了知识图谱中全局网络连接信息和本地三元组关系的影响。实验表明，NetPeace框架中的多个KGC模型对基准测试中（例如，在FB15k-237数据集上，TuckER的Hits@1得分增加了36.45%，MRR得分增加了27.40%），特别是稠密知识图的提升持续且显著。在具有挑战性的低资源任务上，受益于KG的全局特征，NetPeace获得了更高的性能（104.03%的MRR增益）。",
    "tldr": "本研究提出了一个基于网络的预训练框架NetPeace，能够在知识图谱补全任务中获得显著提升，尤其是在稠密的知识图上表现更好。",
    "en_tdlr": "This study proposes a Network-based Pre-training framework, named NetPeace, for knowledge graph completion. By considering the global network connection and local triple relationships, NetPeace consistently and significantly improves multiple KGC models on benchmarks, particularly on dense knowledge graphs. It achieves higher performance on challenging low-resource tasks by benefiting from the global features of KG."
}