{
    "title": "Benchmarking Continuous Time Models for Predicting Multiple Sclerosis Progression. (arXiv:2302.07854v2 [cs.LG] UPDATED)",
    "abstract": "Multiple sclerosis is a disease that affects the brain and spinal cord, it can lead to severe disability and has no known cure. The majority of prior work in machine learning for multiple sclerosis has been centered around using Magnetic Resonance Imaging scans or laboratory tests; these modalities are both expensive to acquire and can be unreliable. In a recent paper it was shown that disease progression can be predicted effectively using performance outcome measures and demographic data. In our work we build on this to investigate the modeling side, using continuous time models to predict progression. We benchmark four continuous time models using a publicly available multiple sclerosis dataset. We find that the best continuous model is often able to outperform the best benchmarked discrete time model. We also carry out an extensive ablation to discover the sources of performance gains, we find that standardizing existing features leads to a larger performance increase than interpola",
    "link": "http://arxiv.org/abs/2302.07854",
    "context": "Title: Benchmarking Continuous Time Models for Predicting Multiple Sclerosis Progression. (arXiv:2302.07854v2 [cs.LG] UPDATED)\nAbstract: Multiple sclerosis is a disease that affects the brain and spinal cord, it can lead to severe disability and has no known cure. The majority of prior work in machine learning for multiple sclerosis has been centered around using Magnetic Resonance Imaging scans or laboratory tests; these modalities are both expensive to acquire and can be unreliable. In a recent paper it was shown that disease progression can be predicted effectively using performance outcome measures and demographic data. In our work we build on this to investigate the modeling side, using continuous time models to predict progression. We benchmark four continuous time models using a publicly available multiple sclerosis dataset. We find that the best continuous model is often able to outperform the best benchmarked discrete time model. We also carry out an extensive ablation to discover the sources of performance gains, we find that standardizing existing features leads to a larger performance increase than interpola",
    "path": "papers/23/02/2302.07854.json",
    "total_tokens": 904,
    "translated_title": "评估连续时间模型预测多发性硬化进展",
    "translated_abstract": "多发性硬化是一种影响大脑和脊髓的疾病，会导致严重残疾且没有已知的治愈方法。大多数关于多发性硬化的机器学习研究都集中在使用磁共振成像扫描或实验室测试，这些模态都昂贵且不可靠。最近的一项研究表明，使用性能结果和人口数据可以有效预测疾病进展。我们的工作在此基础上研究了建模方面，使用连续时间模型来预测进展。我们使用公开可用的多发性硬化数据集对四种连续时间模型进行了基准测试。我们发现最佳的连续模型通常能够优于最佳的离散时间模型。我们还进行了广泛的消融实验以发现性能提升的来源，结果显示，对现有特征进行标准化比插值处理能够带来更大的性能提升。",
    "tldr": "本研究评估了连续时间模型在预测多发性硬化进展方面的性能，发现最佳的连续模型通常能够胜过最佳的离散时间模型，并且标准化现有特征可以带来更大的性能提升。"
}