{
    "title": "MalProtect: Stateful Defense Against Adversarial Query Attacks in ML-based Malware Detection. (arXiv:2302.10739v2 [cs.LG] UPDATED)",
    "abstract": "ML models are known to be vulnerable to adversarial query attacks. In these attacks, queries are iteratively perturbed towards a particular class without any knowledge of the target model besides its output. The prevalence of remotely-hosted ML classification models and Machine-Learning-as-a-Service platforms means that query attacks pose a real threat to the security of these systems. To deal with this, stateful defenses have been proposed to detect query attacks and prevent the generation of adversarial examples by monitoring and analyzing the sequence of queries received by the system. Several stateful defenses have been proposed in recent years. However, these defenses rely solely on similarity or out-of-distribution detection methods that may be effective in other domains. In the malware detection domain, the methods to generate adversarial examples are inherently different, and therefore we find that such detection mechanisms are significantly less effective. Hence, in this paper",
    "link": "http://arxiv.org/abs/2302.10739",
    "context": "Title: MalProtect: Stateful Defense Against Adversarial Query Attacks in ML-based Malware Detection. (arXiv:2302.10739v2 [cs.LG] UPDATED)\nAbstract: ML models are known to be vulnerable to adversarial query attacks. In these attacks, queries are iteratively perturbed towards a particular class without any knowledge of the target model besides its output. The prevalence of remotely-hosted ML classification models and Machine-Learning-as-a-Service platforms means that query attacks pose a real threat to the security of these systems. To deal with this, stateful defenses have been proposed to detect query attacks and prevent the generation of adversarial examples by monitoring and analyzing the sequence of queries received by the system. Several stateful defenses have been proposed in recent years. However, these defenses rely solely on similarity or out-of-distribution detection methods that may be effective in other domains. In the malware detection domain, the methods to generate adversarial examples are inherently different, and therefore we find that such detection mechanisms are significantly less effective. Hence, in this paper",
    "path": "papers/23/02/2302.10739.json",
    "total_tokens": 1141,
    "translated_title": "MalProtect：针对机器学习恶意软件检测领域中的对抗查询攻击的状态防御",
    "translated_abstract": "众所周知，机器学习模型容易受到对抗性查询攻击的影响。在这些攻击中，查询会被不断扰动，以期达到特定的分类目的，而且没有关于目标模型的任何了解，仅凭其输出。远程托管的机器学习分类模型和面向服务的机器学习平台的普遍存在意味着查询攻击对这些系统的安全构成了真正的威胁。为了解决这个问题，已经提出了状态防御机制，通过监视和分析系统接收到的查询序列来检测查询攻击并防止生成对抗性样本。近年来已经提出了几种状态防御机制。但是，这些机制仅依赖于相似性或超出分布检测方法，这些方法可能在其他领域有效。在恶意软件检测领域，生成对抗性样本的方法本质上有所不同，因此我们发现这种检测机制的有效性明显较低。因此，在本文中，我们提出了MalProtect，这是一种专为恶意软件检测领域设计的状态防御技术。MalProtect实现了一种新颖的查询分类方法，利用关于恶意和良性查询分布的知识来检测查询攻击。我们在实际数据集上的实验表明，MalProtect有效地检测到了查询攻击，并提高了基于机器学习的恶意软件检测系统对对抗性攻击的抵抗力。",
    "tldr": "本文提出了一种专门为恶意软件检测领域设计的状态防御技术MalProtect，它通过实现一种新颖的查询分类方法来检测查询攻击，实验结果证明其有效性。",
    "en_tdlr": "MalProtect is a stateful defense technique designed for the malware detection domain that detects query attacks by implementing a novel query classification method. MalProtect effectively improves the resistance of ML-based malware detection systems to adversarial attacks, as demonstrated by experiments on real-world datasets."
}