{
    "title": "Communication-Efficient Federated Bilevel Optimization with Local and Global Lower Level Problems",
    "abstract": "arXiv:2302.06701v2 Announce Type: replace  Abstract: Bilevel Optimization has witnessed notable progress recently with new emerging efficient algorithms. However, its application in the Federated Learning setting remains relatively underexplored, and the impact of Federated Learning's inherent challenges on the convergence of bilevel algorithms remain obscure. In this work, we investigate Federated Bilevel Optimization problems and propose a communication-efficient algorithm, named FedBiOAcc. The algorithm leverages an efficient estimation of the hyper-gradient in the distributed setting and utilizes the momentum-based variance-reduction acceleration. Remarkably, FedBiOAcc achieves a communication complexity $O(\\epsilon^{-1})$, a sample complexity $O(\\epsilon^{-1.5})$ and the linear speed up with respect to the number of clients. We also analyze a special case of the Federated Bilevel Optimization problems, where lower level problems are locally managed by clients. We prove that FedBiO",
    "link": "https://arxiv.org/abs/2302.06701",
    "context": "Title: Communication-Efficient Federated Bilevel Optimization with Local and Global Lower Level Problems\nAbstract: arXiv:2302.06701v2 Announce Type: replace  Abstract: Bilevel Optimization has witnessed notable progress recently with new emerging efficient algorithms. However, its application in the Federated Learning setting remains relatively underexplored, and the impact of Federated Learning's inherent challenges on the convergence of bilevel algorithms remain obscure. In this work, we investigate Federated Bilevel Optimization problems and propose a communication-efficient algorithm, named FedBiOAcc. The algorithm leverages an efficient estimation of the hyper-gradient in the distributed setting and utilizes the momentum-based variance-reduction acceleration. Remarkably, FedBiOAcc achieves a communication complexity $O(\\epsilon^{-1})$, a sample complexity $O(\\epsilon^{-1.5})$ and the linear speed up with respect to the number of clients. We also analyze a special case of the Federated Bilevel Optimization problems, where lower level problems are locally managed by clients. We prove that FedBiO",
    "path": "papers/23/02/2302.06701.json",
    "total_tokens": 874,
    "translated_title": "具有本地和全局下层问题的通信高效联邦双层优化",
    "translated_abstract": "双层优化近年来取得了显著进展，新兴有效算法不断涌现。然而，在联邦学习环境中应用双层优化仍相对未被充分探索，以及联邦学习固有挑战对双层算法收敛的影响仍不清楚。本文研究了联邦双层优化问题，并提出了一种名为FedBiOAcc的通信高效算法。该算法利用分布式环境中对超梯度的高效估计，并利用基于动量的方差减少加速。值得注意的是，FedBiOAcc实现了通信复杂度$O(\\epsilon^{-1})$，样本复杂度$O(\\epsilon^{-1.5})$，并且随着客户端数量的增加而线性加速。我们还分析了联邦双层优化问题的一种特殊情况，即由客户端本地管理下层问题。",
    "tldr": "本文研究了联邦学习设置中的双层优化问题，并提出了一种通信高效的算法FedBiOAcc，实现了优秀的通信和样本复杂度，并且实现了与客户端数量线性加速。",
    "en_tdlr": "This work investigates Federated Bilevel Optimization problems and proposes a communication-efficient algorithm FedBiOAcc, achieving excellent communication and sample complexity, and linear speedup with respect to the number of clients."
}