{
    "title": "NL2CMD: An Updated Workflow for Natural Language to Bash Commands Translation. (arXiv:2302.07845v3 [cs.CL] UPDATED)",
    "abstract": "Translating natural language into Bash Commands is an emerging research field that has gained attention in recent years. Most efforts have focused on producing more accurate translation models. To the best of our knowledge, only two datasets are available, with one based on the other. Both datasets involve scraping through known data sources (through platforms like stack overflow, crowdsourcing, etc.) and hiring experts to validate and correct either the English text or Bash Commands. This paper provides two contributions to research on synthesizing Bash Commands from scratch. First, we describe a state-of-the-art translation model used to generate Bash Commands from the corresponding English text. Second, we introduce a new NL2CMD dataset that is automatically generated, involves minimal human intervention, and is over six times larger than prior datasets. Since the generation pipeline does not rely on existing Bash Commands, the distribution and types of commands can be custom adjust",
    "link": "http://arxiv.org/abs/2302.07845",
    "context": "Title: NL2CMD: An Updated Workflow for Natural Language to Bash Commands Translation. (arXiv:2302.07845v3 [cs.CL] UPDATED)\nAbstract: Translating natural language into Bash Commands is an emerging research field that has gained attention in recent years. Most efforts have focused on producing more accurate translation models. To the best of our knowledge, only two datasets are available, with one based on the other. Both datasets involve scraping through known data sources (through platforms like stack overflow, crowdsourcing, etc.) and hiring experts to validate and correct either the English text or Bash Commands. This paper provides two contributions to research on synthesizing Bash Commands from scratch. First, we describe a state-of-the-art translation model used to generate Bash Commands from the corresponding English text. Second, we introduce a new NL2CMD dataset that is automatically generated, involves minimal human intervention, and is over six times larger than prior datasets. Since the generation pipeline does not rely on existing Bash Commands, the distribution and types of commands can be custom adjust",
    "path": "papers/23/02/2302.07845.json",
    "total_tokens": 869,
    "tldr": "本文介绍了一种最先进的翻译模型，用于将自然语言转换为Bash命令，并提出了一个新的自动生成的数据集NL2CMD，比以前的数据集大六倍以上。"
}