{
    "title": "Effects of noise on the overparametrization of quantum neural networks",
    "abstract": "arXiv:2302.05059v2 Announce Type: replace-cross  Abstract: Overparametrization is one of the most surprising and notorious phenomena in machine learning. Recently, there have been several efforts to study if, and how, Quantum Neural Networks (QNNs) acting in the absence of hardware noise can be overparametrized. In particular, it has been proposed that a QNN can be defined as overparametrized if it has enough parameters to explore all available directions in state space. That is, if the rank of the Quantum Fisher Information Matrix (QFIM) for the QNN's output state is saturated. Here, we explore how the presence of noise affects the overparametrization phenomenon. Our results show that noise can \"turn on\" previously-zero eigenvalues of the QFIM. This enables the parametrized state to explore directions that were otherwise inaccessible, thus potentially turning an overparametrized QNN into an underparametrized one. For small noise levels, the QNN is quasi-overparametrized, as large eige",
    "link": "https://arxiv.org/abs/2302.05059",
    "context": "Title: Effects of noise on the overparametrization of quantum neural networks\nAbstract: arXiv:2302.05059v2 Announce Type: replace-cross  Abstract: Overparametrization is one of the most surprising and notorious phenomena in machine learning. Recently, there have been several efforts to study if, and how, Quantum Neural Networks (QNNs) acting in the absence of hardware noise can be overparametrized. In particular, it has been proposed that a QNN can be defined as overparametrized if it has enough parameters to explore all available directions in state space. That is, if the rank of the Quantum Fisher Information Matrix (QFIM) for the QNN's output state is saturated. Here, we explore how the presence of noise affects the overparametrization phenomenon. Our results show that noise can \"turn on\" previously-zero eigenvalues of the QFIM. This enables the parametrized state to explore directions that were otherwise inaccessible, thus potentially turning an overparametrized QNN into an underparametrized one. For small noise levels, the QNN is quasi-overparametrized, as large eige",
    "path": "papers/23/02/2302.05059.json",
    "total_tokens": 831,
    "translated_title": "噪音对量子神经网络过度参数化的影响",
    "translated_abstract": "过度参数化是机器学习中最令人惊讶和臭名昭著的现象之一。最近，有多次尝试研究在没有硬件噪音的情况下，量子神经网络（QNNs）是否以及如何被过度参数化。特别是，已经提出，如果QNN具有足够的参数来探索状态空间中的所有可用方向，则可以将其定义为过度参数化。也就是说，如果QNN的输出状态的量子费舍尔信息矩阵（QFIM）的秩得以饱和。在这里，我们探讨了噪音的存在如何影响过度参数化现象。我们的结果表明，噪音可以“打开”先前为零的QFIM特征值。这使得参数化状态可以探索原本无法访问的方向，从而潜在地将一个过度参数化的QNN转化为一个欠参数化的QNN。对于小噪音水平，QNN是准过度参数化的，因为存在大的特征值",
    "tldr": "噪音如何影响量子神经网络过度参数化的现象。"
}