{
    "title": "Two for One: Diffusion Models and Force Fields for Coarse-Grained Molecular Dynamics. (arXiv:2302.00600v2 [cs.LG] UPDATED)",
    "abstract": "Coarse-grained (CG) molecular dynamics enables the study of biological processes at temporal and spatial scales that would be intractable at an atomistic resolution. However, accurately learning a CG force field remains a challenge. In this work, we leverage connections between score-based generative models, force fields and molecular dynamics to learn a CG force field without requiring any force inputs during training. Specifically, we train a diffusion generative model on protein structures from molecular dynamics simulations, and we show that its score function approximates a force field that can directly be used to simulate CG molecular dynamics. While having a vastly simplified training setup compared to previous work, we demonstrate that our approach leads to improved performance across several small- to medium-sized protein simulations, reproducing the CG equilibrium distribution, and preserving dynamics of all-atom simulations such as protein folding events.",
    "link": "http://arxiv.org/abs/2302.00600",
    "context": "Title: Two for One: Diffusion Models and Force Fields for Coarse-Grained Molecular Dynamics. (arXiv:2302.00600v2 [cs.LG] UPDATED)\nAbstract: Coarse-grained (CG) molecular dynamics enables the study of biological processes at temporal and spatial scales that would be intractable at an atomistic resolution. However, accurately learning a CG force field remains a challenge. In this work, we leverage connections between score-based generative models, force fields and molecular dynamics to learn a CG force field without requiring any force inputs during training. Specifically, we train a diffusion generative model on protein structures from molecular dynamics simulations, and we show that its score function approximates a force field that can directly be used to simulate CG molecular dynamics. While having a vastly simplified training setup compared to previous work, we demonstrate that our approach leads to improved performance across several small- to medium-sized protein simulations, reproducing the CG equilibrium distribution, and preserving dynamics of all-atom simulations such as protein folding events.",
    "path": "papers/23/02/2302.00600.json",
    "total_tokens": 883,
    "translated_title": "一招两得：粗粒化分子动力学的扩散模型和力场",
    "translated_abstract": "粗粒化（CG）分子动力学使得在原子分辨率下无法解决的生物过程可以得以研究。然而，准确学习CG力场仍然是一个挑战。在本文中，我们利用基于评分的生成模型、力场和分子动力学之间的联系，学习了一个CG力场，而在训练过程中不需要任何力场输入。具体地，我们对来自分子动力学模拟的蛋白质结构进行了扩散生成模型的训练，我们展示了它的评分函数近似一个可以直接用于模拟CG分子动力学的力场。尽管相比以前的工作，我们的方法具有大大简化的训练设置，但我们证明了我们的方法在几个小型到中型蛋白质模拟中具有改进的性能，能够重现CG平衡分布，并保持蛋白质折叠等全原子模拟的动力学。",
    "tldr": "本文通过训练扩散生成模型来学习粗粒化分子动力学的力场，无需使用任何力场输入，从而实现了对生物过程的精确模拟，并展示了在多个蛋白质模拟中具有优越性能。"
}