{
    "title": "Unbinned Profiled Unfolding. (arXiv:2302.05390v3 [hep-ph] UPDATED)",
    "abstract": "Unfolding is an important procedure in particle physics experiments which corrects for detector effects and provides differential cross section measurements that can be used for a number of downstream tasks, such as extracting fundamental physics parameters. Traditionally, unfolding is done by discretizing the target phase space into a finite number of bins and is limited in the number of unfolded variables. Recently, there have been a number of proposals to perform unbinned unfolding with machine learning. However, none of these methods (like most unfolding methods) allow for simultaneously constraining (profiling) nuisance parameters. We propose a new machine learning-based unfolding method that results in an unbinned differential cross section and can profile nuisance parameters. The machine learning loss function is the full likelihood function, based on binned inputs at detector-level. We first demonstrate the method with simple Gaussian examples and then show the impact on a simu",
    "link": "http://arxiv.org/abs/2302.05390",
    "context": "Title: Unbinned Profiled Unfolding. (arXiv:2302.05390v3 [hep-ph] UPDATED)\nAbstract: Unfolding is an important procedure in particle physics experiments which corrects for detector effects and provides differential cross section measurements that can be used for a number of downstream tasks, such as extracting fundamental physics parameters. Traditionally, unfolding is done by discretizing the target phase space into a finite number of bins and is limited in the number of unfolded variables. Recently, there have been a number of proposals to perform unbinned unfolding with machine learning. However, none of these methods (like most unfolding methods) allow for simultaneously constraining (profiling) nuisance parameters. We propose a new machine learning-based unfolding method that results in an unbinned differential cross section and can profile nuisance parameters. The machine learning loss function is the full likelihood function, based on binned inputs at detector-level. We first demonstrate the method with simple Gaussian examples and then show the impact on a simu",
    "path": "papers/23/02/2302.05390.json",
    "total_tokens": 795,
    "translated_title": "无组合式概貌展开",
    "translated_abstract": "展开是粒子物理实验中的重要过程，它纠正了探测器效应，并提供了可用于提取基本物理参数等一系列后续任务的差分截面测量。传统上，展开是通过将目标相空间离散化为有限数量的区间来进行的，并且在展开变量的数量上存在局限性。最近，已经提出了一些使用机器学习进行无组合展开的方法。然而，这些方法（如大多数展开方法）都不允许同时约束（剖析）干扰参数。我们提出了一种新的基于机器学习的展开方法，可以得到无组合的差分截面并可以剖析干扰参数。机器学习损失函数是基于探测器级别的分区输入的全概率函数。我们首先用简单的高斯示例演示了该方法，然后展示了对模拟数据的影响。",
    "tldr": "本文提出了一种新的基于机器学习的展开方法，可以得到无组合的差分截面并且可以剖析干扰参数。",
    "en_tdlr": "This paper proposes a new machine learning-based unfolding method that results in an unbinned differential cross section and can profile nuisance parameters."
}