{
    "title": "A Definition of Non-Stationary Bandits. (arXiv:2302.12202v2 [cs.LG] UPDATED)",
    "abstract": "Despite the subject of non-stationary bandit learning having attracted much recent attention, we have yet to identify a formal definition of non-stationarity that can consistently distinguish non-stationary bandits from stationary ones. Prior work has characterized non-stationary bandits as bandits for which the reward distribution changes over time. We demonstrate that this definition can ambiguously classify the same bandit as both stationary and non-stationary; this ambiguity arises in the existing definition's dependence on the latent sequence of reward distributions. Moreover, the definition has given rise to two widely used notions of regret: the dynamic regret and the weak regret. These notions are not indicative of qualitative agent performance in some bandits. Additionally, this definition of non-stationary bandits has led to the design of agents that explore excessively. We introduce a formal definition of non-stationary bandits that resolves these issues. Our new definition ",
    "link": "http://arxiv.org/abs/2302.12202",
    "context": "Title: A Definition of Non-Stationary Bandits. (arXiv:2302.12202v2 [cs.LG] UPDATED)\nAbstract: Despite the subject of non-stationary bandit learning having attracted much recent attention, we have yet to identify a formal definition of non-stationarity that can consistently distinguish non-stationary bandits from stationary ones. Prior work has characterized non-stationary bandits as bandits for which the reward distribution changes over time. We demonstrate that this definition can ambiguously classify the same bandit as both stationary and non-stationary; this ambiguity arises in the existing definition's dependence on the latent sequence of reward distributions. Moreover, the definition has given rise to two widely used notions of regret: the dynamic regret and the weak regret. These notions are not indicative of qualitative agent performance in some bandits. Additionally, this definition of non-stationary bandits has led to the design of agents that explore excessively. We introduce a formal definition of non-stationary bandits that resolves these issues. Our new definition ",
    "path": "papers/23/02/2302.12202.json",
    "total_tokens": 851,
    "translated_title": "非稳态赌博机的定义",
    "translated_abstract": "尽管非稳态赌博机学习的课题吸引了最近的很多关注，但我们还没有找到一个能够区分非稳态赌博机和稳态赌博机的形式定义。之前的研究将非稳态赌博机定义为奖励分布随时间变化的赌博机。我们证明这个定义在将同一个赌博机同时分类为稳态和非稳态时存在歧义；这种歧义源于该定义对潜在奖励分布序列的依赖。此外，这个定义也导致了两种广泛使用的遗憾概念：动态遗憾和弱遗憾。这些概念在一些赌博机中并不能准确地反映代理的性能。此外，这个非稳态赌博机的定义还导致了探索过度的代理设计。我们引入了一个解决这些问题的非稳态赌博机的形式定义。",
    "tldr": "该论文提出了一个解决非稳态赌博机定义歧义的新定义，解决了之前定义中的问题并修复了代理设计中探索过度的情况。",
    "en_tdlr": "The paper introduces a new definition for non-stationary bandits that resolves the ambiguity in the existing definition, addresses issues in the previous definition, and fixes the problem of excessive exploration in agent design."
}