{
    "title": "Type-Aware Decomposed Framework for Few-Shot Named Entity Recognition. (arXiv:2302.06397v2 [cs.CL] UPDATED)",
    "abstract": "Despite the recent success achieved by several two-stage prototypical networks in few-shot named entity recognition (NER) task, the overdetected false spans at the span detection stage and the inaccurate and unstable prototypes at the type classification stage remain to be challenging problems. In this paper, we propose a novel Type-Aware Decomposed framework, namely TadNER, to solve these problems. We first present a type-aware span filtering strategy to filter out false spans by removing those semantically far away from type names. We then present a type-aware contrastive learning strategy to construct more accurate and stable prototypes by jointly exploiting support samples and type names as references. Extensive experiments on various benchmarks prove that our proposed TadNER framework yields a new state-of-the-art performance. Our code and data will be available at https://github.com/NLPWM-WHU/TadNER.",
    "link": "http://arxiv.org/abs/2302.06397",
    "context": "Title: Type-Aware Decomposed Framework for Few-Shot Named Entity Recognition. (arXiv:2302.06397v2 [cs.CL] UPDATED)\nAbstract: Despite the recent success achieved by several two-stage prototypical networks in few-shot named entity recognition (NER) task, the overdetected false spans at the span detection stage and the inaccurate and unstable prototypes at the type classification stage remain to be challenging problems. In this paper, we propose a novel Type-Aware Decomposed framework, namely TadNER, to solve these problems. We first present a type-aware span filtering strategy to filter out false spans by removing those semantically far away from type names. We then present a type-aware contrastive learning strategy to construct more accurate and stable prototypes by jointly exploiting support samples and type names as references. Extensive experiments on various benchmarks prove that our proposed TadNER framework yields a new state-of-the-art performance. Our code and data will be available at https://github.com/NLPWM-WHU/TadNER.",
    "path": "papers/23/02/2302.06397.json",
    "total_tokens": 908,
    "translated_title": "类型感知的分解框架用于少样本命名实体识别",
    "translated_abstract": "尽管在少样本命名实体识别任务中，几个两阶段原型网络取得了较好的结果，但在段检测阶段出现了过多的错误跨度，并且在类型分类阶段出现了不准确和不稳定的原型，这仍然是一个具有挑战性的问题。在本文中，我们提出了一种新颖的类型感知的分解框架，即TadNER，来解决这些问题。我们首先提出了一种类型感知的跨度过滤策略，通过移除那些与类型名称语义上相距较远的假跨度来过滤掉错误的跨度。然后，我们提出了一种类型感知的对比学习策略，通过联合利用支持样本和类型名称作为参考来构建更准确和稳定的原型。在各种基准测试上进行的大量实验证明，我们提出的TadNER框架取得了新的最先进性能。我们的代码和数据将在https://github.com/NLPWM-WHU/TadNER上提供。",
    "tldr": "本论文提出了一种名为TadNER的类型感知的分解框架，解决了少样本命名实体识别任务中的错误跨度和不准确和不稳定的原型的问题，并在各种基准测试中取得了新的最先进性能。"
}