{
    "title": "Real-World Deployment and Evaluation of Kwame for Science, An AI Teaching Assistant for Science Education in West Africa",
    "abstract": "Africa has a high student-to-teacher ratio which limits students' access to teachers for learning support such as educational question answering. In this work, we extended Kwame, a bilingual AI teaching assistant for coding education, adapted it for science education, and deployed it as a web app. Kwame for Science provides passages from well-curated knowledge sources and related past national exam questions as answers to questions from students based on the Integrated Science subject of the West African Senior Secondary Certificate Examination (WASSCE). Furthermore, students can view past national exam questions along with their answers and filter by year, question type, and topics that were automatically categorized by a topic detection model which we developed (91% unweighted average recall). We deployed Kwame for Science in the real world over 8 months and had 750 users across 32 countries (15 in Africa) and 1.5K questions asked. Our evaluation showed an 87.2% top 3 accuracy (n=109",
    "link": "https://arxiv.org/abs/2302.10786",
    "context": "Title: Real-World Deployment and Evaluation of Kwame for Science, An AI Teaching Assistant for Science Education in West Africa\nAbstract: Africa has a high student-to-teacher ratio which limits students' access to teachers for learning support such as educational question answering. In this work, we extended Kwame, a bilingual AI teaching assistant for coding education, adapted it for science education, and deployed it as a web app. Kwame for Science provides passages from well-curated knowledge sources and related past national exam questions as answers to questions from students based on the Integrated Science subject of the West African Senior Secondary Certificate Examination (WASSCE). Furthermore, students can view past national exam questions along with their answers and filter by year, question type, and topics that were automatically categorized by a topic detection model which we developed (91% unweighted average recall). We deployed Kwame for Science in the real world over 8 months and had 750 users across 32 countries (15 in Africa) and 1.5K questions asked. Our evaluation showed an 87.2% top 3 accuracy (n=109",
    "path": "papers/23/02/2302.10786.json",
    "total_tokens": 936,
    "translated_title": "面向西非科学教育的AI教辅Kwame的现实世界部署和评估",
    "translated_abstract": "非洲教师与学生的比例高，这限制了学生们获取教育问题解答等学习支持的机会。本研究将面向编码教育的AI教辅Kwame扩展为面向科学教育，并将其部署为一个网络应用程序。Kwame for Science通过提供来自精选知识来源的段落以及基于西非高级中学证书考试（WASSCE）的综合科学科目的相关过去的国家考试问题的答案来回答学生们的问题。此外，学生们还可以查看过去的国家考试问题及其答案，并通过我们开发的主题检测模型进行按年份、问题类型和主题的自动分类（91%非加权平均召回率）。我们在实际环境中部署了Kwame for Science超过8个月，有来自32个国家（其中15个在非洲）的750个用户，共提出了1.5K的问题。我们的评估结果显示，87.2%的前三名问题准确率（n=109）。",
    "tldr": "这项研究扩展了AI教辅Kwame，面向西非科学教育，并将其作为一个网络应用程序进行了实际部署和评估。结果显示，在实际环境中，Kwame for Science取得了很高的准确率，并且获得了广泛的用户和问题提问量。"
}