{
    "title": "An Empirical Analysis of Optimal Nonlinear Pricing. (arXiv:2302.11643v2 [econ.GN] UPDATED)",
    "abstract": "In continuous-choice settings, consumers decide not only on whether to purchase a product, but also on how much to purchase. Thus, firms optimize a full price schedule rather than a single price point. This paper provides a methodology to empirically estimate the optimal schedule under multi-dimensional consumer heterogeneity. We apply our method to novel data from an educational-services firm that contains purchase-size information not only for deals that materialized, but also for potential deals that eventually failed. We show that this data, combined with identifying assumptions, helps infer how price sensitivity varies with \"customer size\". Using our estimated model, we show that the optimal second-degree price discrimination (i.e., optimal nonlinear tariff) improves the firm's profit upon linear pricing by at least 5.5%. That said, this second-degree price discrimination scheme only recovers 5.1% of the gap between the profitability of linear pricing and that of infeasible first ",
    "link": "http://arxiv.org/abs/2302.11643",
    "context": "Title: An Empirical Analysis of Optimal Nonlinear Pricing. (arXiv:2302.11643v2 [econ.GN] UPDATED)\nAbstract: In continuous-choice settings, consumers decide not only on whether to purchase a product, but also on how much to purchase. Thus, firms optimize a full price schedule rather than a single price point. This paper provides a methodology to empirically estimate the optimal schedule under multi-dimensional consumer heterogeneity. We apply our method to novel data from an educational-services firm that contains purchase-size information not only for deals that materialized, but also for potential deals that eventually failed. We show that this data, combined with identifying assumptions, helps infer how price sensitivity varies with \"customer size\". Using our estimated model, we show that the optimal second-degree price discrimination (i.e., optimal nonlinear tariff) improves the firm's profit upon linear pricing by at least 5.5%. That said, this second-degree price discrimination scheme only recovers 5.1% of the gap between the profitability of linear pricing and that of infeasible first ",
    "path": "papers/23/02/2302.11643.json",
    "total_tokens": 895,
    "translated_title": "非线性定价的实证分析",
    "translated_abstract": "在连续选择的环境中，消费者不仅决定是否购买产品，还决定购买多少。因此，企业优化的是一个完整的价格方案，而不是单一价格点。本文提供了一种方法来实证估计多维消费者异质性下的最优价格方案。我们将该方法应用于一个教育服务公司的新型数据，该数据不仅包含实际发生的交易的购买量信息，还包括最终失败的潜在交易的购买量信息。我们展示了这些数据结合识别假设可以帮助推断价格敏感度如何随着“客户规模”而变化。利用我们估计的模型，我们证明最优的二次价格歧视（即最优非线性关税）相比线性定价可以使企业利润至少提高5.5%。然而，这种二次价格歧视方案只能弥补线性定价和不可行的第一种定价方法之间盈利能力差距的5.1%。",
    "tldr": "本文提供了一种方法来实证估计多维消费者异质性下的最优价格方案，并利用教育服务公司的数据展示了最优二次价格歧视相比线性定价能够提高至少5.5%的企业利润。",
    "en_tdlr": "This paper provides a method to empirically estimate the optimal pricing strategy for multi-dimensional consumer heterogeneity, and using data from an educational services company, demonstrates that optimal second-degree price discrimination improves firm profit by at least 5.5% compared to linear pricing."
}