{
    "title": "Learning Revenue Maximizing Menus of Lotteries and Two-Part Tariffs. (arXiv:2302.11700v2 [cs.GT] UPDATED)",
    "abstract": "We advance a recently flourishing line of work at the intersection of learning theory and computational economics by studying the learnability of two classes of mechanisms prominent in economics, namely menus of lotteries and two-part tariffs. The former is a family of randomized mechanisms designed for selling multiple items, known to achieve revenue beyond deterministic mechanisms, while the latter is designed for selling multiple units (copies) of a single item with applications in real-world scenarios such as car or bike-sharing services. We focus on learning high-revenue mechanisms of this form from buyer valuation data in both distributional settings, where we have access to buyers' valuation samples up-front, and the more challenging and less-studied online settings, where buyers arrive one-at-a-time and no distributional assumption is made about their values.  Our main contribution is proposing the first online learning algorithms for menus of lotteries and two-part tariffs wit",
    "link": "http://arxiv.org/abs/2302.11700",
    "context": "Title: Learning Revenue Maximizing Menus of Lotteries and Two-Part Tariffs. (arXiv:2302.11700v2 [cs.GT] UPDATED)\nAbstract: We advance a recently flourishing line of work at the intersection of learning theory and computational economics by studying the learnability of two classes of mechanisms prominent in economics, namely menus of lotteries and two-part tariffs. The former is a family of randomized mechanisms designed for selling multiple items, known to achieve revenue beyond deterministic mechanisms, while the latter is designed for selling multiple units (copies) of a single item with applications in real-world scenarios such as car or bike-sharing services. We focus on learning high-revenue mechanisms of this form from buyer valuation data in both distributional settings, where we have access to buyers' valuation samples up-front, and the more challenging and less-studied online settings, where buyers arrive one-at-a-time and no distributional assumption is made about their values.  Our main contribution is proposing the first online learning algorithms for menus of lotteries and two-part tariffs wit",
    "path": "papers/23/02/2302.11700.json",
    "total_tokens": 893,
    "translated_title": "学习最大化菜单抽奖和两部分票价的论文",
    "translated_abstract": "我们通过研究在学习理论和计算经济学交叉领域中近年来蓬勃发展的一系列工作，推进了经济学中两类机制的可学习性研究，分别是菜单抽奖和两部分票价。前者是一类旨在销售多个物品的随机机制，已知能够实现超出确定性机制的收益，而后者则是针对销售单个物品多个单位（副本）的设计，适用于现实世界中的场景，如汽车或自行车共享服务等。我们关注如何从买家估值数据中学习出高收益的这类机制，涵盖多种分布设置，既有直接获得买家估值样本的情况，也有更具挑战性、研究较少的在线设置，其中买家一个接一个到来，并且对他们的估值没有分布假设。我们的主要贡献是提出了第一个针对菜单抽奖和两部分票价的在线学习算法。",
    "tldr": "该论文研究了经济学中两种机制的可学习性：菜单抽奖和两部分票价。他们提出了第一个针对这两种机制的在线学习算法。",
    "en_tdlr": "This paper studies the learnability of two mechanisms in economics: menus of lotteries and two-part tariffs. It proposes the first online learning algorithms for these two mechanisms."
}