{
    "title": "READIN: A Chinese Multi-Task Benchmark with Realistic and Diverse Input Noises. (arXiv:2302.07324v2 [cs.CL] UPDATED)",
    "abstract": "For many real-world applications, the user-generated inputs usually contain various noises due to speech recognition errors caused by linguistic variations1 or typographical errors (typos). Thus, it is crucial to test model performance on data with realistic input noises to ensure robustness and fairness. However, little study has been done to construct such benchmarks for Chinese, where various language-specific input noises happen in the real world. In order to fill this important gap, we construct READIN: a Chinese multi-task benchmark with REalistic And Diverse Input Noises. READIN contains four diverse tasks and requests annotators to re-enter the original test data with two commonly used Chinese input methods: Pinyin input and speech input. We designed our annotation pipeline to maximize diversity, for example by instructing the annotators to use diverse input method editors (IMEs) for keyboard noises and recruiting speakers from diverse dialectical groups for speech noises. We e",
    "link": "http://arxiv.org/abs/2302.07324",
    "context": "Title: READIN: A Chinese Multi-Task Benchmark with Realistic and Diverse Input Noises. (arXiv:2302.07324v2 [cs.CL] UPDATED)\nAbstract: For many real-world applications, the user-generated inputs usually contain various noises due to speech recognition errors caused by linguistic variations1 or typographical errors (typos). Thus, it is crucial to test model performance on data with realistic input noises to ensure robustness and fairness. However, little study has been done to construct such benchmarks for Chinese, where various language-specific input noises happen in the real world. In order to fill this important gap, we construct READIN: a Chinese multi-task benchmark with REalistic And Diverse Input Noises. READIN contains four diverse tasks and requests annotators to re-enter the original test data with two commonly used Chinese input methods: Pinyin input and speech input. We designed our annotation pipeline to maximize diversity, for example by instructing the annotators to use diverse input method editors (IMEs) for keyboard noises and recruiting speakers from diverse dialectical groups for speech noises. We e",
    "path": "papers/23/02/2302.07324.json",
    "total_tokens": 902,
    "translated_title": "READIN：一个带有真实和多样化输入噪声的中文多任务基准数据集",
    "translated_abstract": "对于许多真实世界应用，用户生成的输入通常包含由于语言变体或打字错误引起的语音识别错误等各种噪声。因此，测试模型在带有真实输入噪声的数据上的性能以确保其鲁棒性和公平性非常重要。然而，在中文中构建这样的基准数据集的研究很少，而实际情况中各种与语言相关的输入噪声屡见不鲜。为了填补这一重要空白，我们构建了一个名为READIN的中文多任务基准数据集，其中包括四个不同的任务，并要求注释者使用两种常用的中文输入方法——拼音输入和语音输入，重新输入原始测试数据。我们设计了注释管道以最大化多样性，例如通过指示注释者使用多样化的输入法编辑器（IME）来获得键盘噪声，并招募来自不同方言组的演讲者获取语音噪声。",
    "tldr": "READIN是一个中文多任务基准数据集，它包含真实和多样化的输入噪声，旨在测试模型的鲁棒性和公平性。注释管道被设计来最大化多样性。",
    "en_tdlr": "READIN is a Chinese multi-task benchmark dataset that contains realistic and diverse input noises to test model's robustness and fairness. The annotation pipeline is designed to maximize diversity, such as instructing annotators to use diverse input method editors for keyboard noises and recruiting speakers from diverse dialectical groups for speech noises."
}