{
    "title": "90% F1 Score in Relational Triple Extraction: Is it Real ?. (arXiv:2302.09887v2 [cs.CL] UPDATED)",
    "abstract": "Extracting relational triples from text is a crucial task for constructing knowledge bases. Recent advancements in joint entity and relation extraction models have demonstrated remarkable F1 scores ($\\ge 90\\%$) in accurately extracting relational triples from free text. However, these models have been evaluated under restrictive experimental settings and unrealistic datasets. They overlook sentences with zero triples (zero-cardinality), thereby simplifying the task. In this paper, we present a benchmark study of state-of-the-art joint entity and relation extraction models under a more realistic setting. We include sentences that lack any triples in our experiments, providing a comprehensive evaluation. Our findings reveal a significant decline (approximately 10-15\\% in one dataset and 6-14\\% in another dataset) in the models' F1 scores within this realistic experimental setup. Furthermore, we propose a two-step modeling approach that utilizes a simple BERT-based classifier. This approa",
    "link": "http://arxiv.org/abs/2302.09887",
    "context": "Title: 90% F1 Score in Relational Triple Extraction: Is it Real ?. (arXiv:2302.09887v2 [cs.CL] UPDATED)\nAbstract: Extracting relational triples from text is a crucial task for constructing knowledge bases. Recent advancements in joint entity and relation extraction models have demonstrated remarkable F1 scores ($\\ge 90\\%$) in accurately extracting relational triples from free text. However, these models have been evaluated under restrictive experimental settings and unrealistic datasets. They overlook sentences with zero triples (zero-cardinality), thereby simplifying the task. In this paper, we present a benchmark study of state-of-the-art joint entity and relation extraction models under a more realistic setting. We include sentences that lack any triples in our experiments, providing a comprehensive evaluation. Our findings reveal a significant decline (approximately 10-15\\% in one dataset and 6-14\\% in another dataset) in the models' F1 scores within this realistic experimental setup. Furthermore, we propose a two-step modeling approach that utilizes a simple BERT-based classifier. This approa",
    "path": "papers/23/02/2302.09887.json",
    "total_tokens": 893,
    "translated_title": "从自由文本中提取关系三元组：90% F1得分是真实的吗？",
    "translated_abstract": "从文本中提取关系三元组是构建知识库的关键任务。最近，联合实体和关系提取模型的进展展示了在准确提取关系三元组方面达到的卓越F1得分（≥ 90%）。然而，这些模型在受限的实验设置和不真实的数据集下进行了评估。它们忽视了零三元组句子（零基数），从而简化了任务。在本文中，我们在更真实的设置下对最先进的联合实体和关系提取模型进行了基准研究。我们的实验中包括了缺乏任何三元组的句子，提供了综合性的评估。我们的研究结果显示，在这种更真实的实验设置中，模型的F1得分有显著下降（在一个数据集中约10-15%，在另一个数据集中6-14%）。此外，我们提出了一种利用简单的基于BERT的分类器的两步建模方法。",
    "tldr": "该论文对联合实体和关系提取模型进行了基准研究，发现在更真实的实验设置下，模型的F1得分显著下降。此外，提出了一种利用基于BERT的分类器的两步建模方法。"
}