{
    "title": "Enhanced Sampling of Configuration and Path Space in a Generalized Ensemble by Shooting Point Exchange. (arXiv:2302.08757v2 [physics.comp-ph] UPDATED)",
    "abstract": "The computer simulation of many molecular processes is complicated by long time scales caused by rare transitions between long-lived states. Here, we propose a new approach to simulate such rare events, which combines transition path sampling with enhanced exploration of configuration space. The method relies on exchange moves between configuration and trajectory space, carried out based on a generalized ensemble. This scheme substantially enhances the efficiency of the transition path sampling simulations, particularly for systems with multiple transition channels, and yields information on thermodynamics, kinetics and reaction coordinates of molecular processes without distorting their dynamics. The method is illustrated using the isomerization of proline in the KPTP tetrapeptide.",
    "link": "http://arxiv.org/abs/2302.08757",
    "context": "Title: Enhanced Sampling of Configuration and Path Space in a Generalized Ensemble by Shooting Point Exchange. (arXiv:2302.08757v2 [physics.comp-ph] UPDATED)\nAbstract: The computer simulation of many molecular processes is complicated by long time scales caused by rare transitions between long-lived states. Here, we propose a new approach to simulate such rare events, which combines transition path sampling with enhanced exploration of configuration space. The method relies on exchange moves between configuration and trajectory space, carried out based on a generalized ensemble. This scheme substantially enhances the efficiency of the transition path sampling simulations, particularly for systems with multiple transition channels, and yields information on thermodynamics, kinetics and reaction coordinates of molecular processes without distorting their dynamics. The method is illustrated using the isomerization of proline in the KPTP tetrapeptide.",
    "path": "papers/23/02/2302.08757.json",
    "total_tokens": 807,
    "translated_title": "通过着射点交换增强广义集合中配置和路径空间的采样",
    "translated_abstract": "计算机模拟许多分子过程的复杂性在于由长寿命状态之间的稀有转换引起的长时间尺度。本文提出了一种新方法来模拟这种稀有事件，它结合了转换路径采样和配置空间的增强探索。该方法依靠在广义集合上基于配置和轨迹空间之间的交换移动。这种方案显著增强了转换路径采样模拟的效率，特别是对于具有多个转换通道的系统，并且在不扭曲其动力学的情况下提供了有关分子过程的热力学、动力学和反应坐标的信息。该方法以KPTP四肽中脯氨酸的异构化为例进行了说明。",
    "tldr": "本文提出了一种用于模拟分子体系稀有事件的新方法，它结合了转换路径采样和配置空间的增强探索，并依靠广义集合上基于配置和轨迹空间之间的交换移动实现，该方法显著增强了转换路径采样模拟的效率。"
}