{
    "title": "3D-aware Conditional Image Synthesis. (arXiv:2302.08509v2 [cs.CV] UPDATED)",
    "abstract": "We propose pix2pix3D, a 3D-aware conditional generative model for controllable photorealistic image synthesis. Given a 2D label map, such as a segmentation or edge map, our model learns to synthesize a corresponding image from different viewpoints. To enable explicit 3D user control, we extend conditional generative models with neural radiance fields. Given widely-available monocular images and label map pairs, our model learns to assign a label to every 3D point in addition to color and density, which enables it to render the image and pixel-aligned label map simultaneously. Finally, we build an interactive system that allows users to edit the label map from any viewpoint and generate outputs accordingly.",
    "link": "http://arxiv.org/abs/2302.08509",
    "context": "Title: 3D-aware Conditional Image Synthesis. (arXiv:2302.08509v2 [cs.CV] UPDATED)\nAbstract: We propose pix2pix3D, a 3D-aware conditional generative model for controllable photorealistic image synthesis. Given a 2D label map, such as a segmentation or edge map, our model learns to synthesize a corresponding image from different viewpoints. To enable explicit 3D user control, we extend conditional generative models with neural radiance fields. Given widely-available monocular images and label map pairs, our model learns to assign a label to every 3D point in addition to color and density, which enables it to render the image and pixel-aligned label map simultaneously. Finally, we build an interactive system that allows users to edit the label map from any viewpoint and generate outputs accordingly.",
    "path": "papers/23/02/2302.08509.json",
    "total_tokens": 830,
    "translated_title": "三维感知的条件图像合成",
    "translated_abstract": "我们提出了pix2pix3D，这是一种三维感知的条件生成模型，用于可控的逼真图像合成。在给定2D标签图的情况下，如分割或边缘图，我们的模型学习从不同视角合成相应的图像。为了实现明确的三维用户控制，我们使用神经光辐射场扩展了条件生成模型。在给定普遍可用的单眼图像和标签映射对的情况下，我们的模型学习为每个三维点分配标签，除颜色和密度外，这使它能够同时呈现图像和像素对齐的标签映射。最后，我们构建了一个交互式系统，允许用户从任何视角编辑标签映射并相应生成输出。",
    "tldr": "我们提出了一个三维感知的条件生成模型，通过给定的2D标签图合成相应的图像，并扩展了条件生成模型来实现明确的三维用户控制；我们还建立了一个交互式系统，允许用户随意编辑标签图并生成输出。",
    "en_tdlr": "We propose a 3D-aware conditional generative model, pix2pix3D, for controllable photorealistic image synthesis from 2D label maps. Our model extends conditional generative models with neural radiance fields for explicit 3D user control and is able to simultaneously render the image and pixel-aligned label map. We also build an interactive system for users to edit the label map and generate outputs accordingly."
}