{
    "title": "On the Robustness of Randomized Ensembles to Adversarial Perturbations. (arXiv:2302.01375v3 [cs.LG] UPDATED)",
    "abstract": "Randomized ensemble classifiers (RECs), where one classifier is randomly selected during inference, have emerged as an attractive alternative to traditional ensembling methods for realizing adversarially robust classifiers with limited compute requirements. However, recent works have shown that existing methods for constructing RECs are more vulnerable than initially claimed, casting major doubts on their efficacy and prompting fundamental questions such as: \"When are RECs useful?\", \"What are their limits?\", and \"How do we train them?\". In this work, we first demystify RECs as we derive fundamental results regarding their theoretical limits, necessary and sufficient conditions for them to be useful, and more. Leveraging this new understanding, we propose a new boosting algorithm (BARRE) for training robust RECs, and empirically demonstrate its effectiveness at defending against strong $\\ell_\\infty$ norm-bounded adversaries across various network architectures and datasets. Our code can",
    "link": "http://arxiv.org/abs/2302.01375",
    "context": "Title: On the Robustness of Randomized Ensembles to Adversarial Perturbations. (arXiv:2302.01375v3 [cs.LG] UPDATED)\nAbstract: Randomized ensemble classifiers (RECs), where one classifier is randomly selected during inference, have emerged as an attractive alternative to traditional ensembling methods for realizing adversarially robust classifiers with limited compute requirements. However, recent works have shown that existing methods for constructing RECs are more vulnerable than initially claimed, casting major doubts on their efficacy and prompting fundamental questions such as: \"When are RECs useful?\", \"What are their limits?\", and \"How do we train them?\". In this work, we first demystify RECs as we derive fundamental results regarding their theoretical limits, necessary and sufficient conditions for them to be useful, and more. Leveraging this new understanding, we propose a new boosting algorithm (BARRE) for training robust RECs, and empirically demonstrate its effectiveness at defending against strong $\\ell_\\infty$ norm-bounded adversaries across various network architectures and datasets. Our code can",
    "path": "papers/23/02/2302.01375.json",
    "total_tokens": 907,
    "translated_title": "针对对抗扰动的随机集成算法的鲁棒性研究",
    "translated_abstract": "随机集成分类器 (Randomized ensemble classifiers, RECs) 已被证明是一种吸引人的替代传统集成方法的分类器，具有较小的计算需求。然而，最近的研究表明，现有的构造 RECs 的方法比最初声称的更脆弱，对其功效产生了重大怀疑，并引发了一些基本问题，例如：“RECs 何时有效？”，“它们的局限性是什么？”，“我们如何训练它们？”。在本文中，我们首先从理论上探索 RECs 并得出了一些基本结果，例如 RECs 的理论限制、使用它们必要且充分的条件等。在此基础上，我们提出了一种新的增强算法 (BARRE) 用于训练强鲁棒的 RECs，并在各种网络结构和数据集上进行了实证，证明了其对抗强 $\\ell_\\infty$ 范围内的攻击的有效性。",
    "tldr": "本文对随机集成算法在对抗攻击环境中的鲁棒性进行了研究，提出了新的训练算法 BARRE，能够有效地防御强大的 $\\ell_\\infty$ 范围内的攻击。",
    "en_tdlr": "This paper studies the robustness of randomized ensemble classifiers (RECs) under adversarial attacks, proposes a new training algorithm (BARRE) to defend against strong $\\ell_\\infty$ norm-bounded adversaries, and demonstrates its effectiveness on various network architectures and datasets."
}