{
    "title": "Generative Adversarial Symmetry Discovery. (arXiv:2302.00236v3 [cs.LG] UPDATED)",
    "abstract": "Despite the success of equivariant neural networks in scientific applications, they require knowing the symmetry group a priori. However, it may be difficult to know which symmetry to use as an inductive bias in practice. Enforcing the wrong symmetry could even hurt the performance. In this paper, we propose a framework, LieGAN, to automatically discover equivariances from a dataset using a paradigm akin to generative adversarial training. Specifically, a generator learns a group of transformations applied to the data, which preserve the original distribution and fool the discriminator. LieGAN represents symmetry as interpretable Lie algebra basis and can discover various symmetries such as the rotation group $\\mathrm{SO}(n)$, restricted Lorentz group $\\mathrm{SO}(1,3)^+$ in trajectory prediction and top-quark tagging tasks. The learned symmetry can also be readily used in several existing equivariant neural networks to improve accuracy and generalization in prediction.",
    "link": "http://arxiv.org/abs/2302.00236",
    "context": "Title: Generative Adversarial Symmetry Discovery. (arXiv:2302.00236v3 [cs.LG] UPDATED)\nAbstract: Despite the success of equivariant neural networks in scientific applications, they require knowing the symmetry group a priori. However, it may be difficult to know which symmetry to use as an inductive bias in practice. Enforcing the wrong symmetry could even hurt the performance. In this paper, we propose a framework, LieGAN, to automatically discover equivariances from a dataset using a paradigm akin to generative adversarial training. Specifically, a generator learns a group of transformations applied to the data, which preserve the original distribution and fool the discriminator. LieGAN represents symmetry as interpretable Lie algebra basis and can discover various symmetries such as the rotation group $\\mathrm{SO}(n)$, restricted Lorentz group $\\mathrm{SO}(1,3)^+$ in trajectory prediction and top-quark tagging tasks. The learned symmetry can also be readily used in several existing equivariant neural networks to improve accuracy and generalization in prediction.",
    "path": "papers/23/02/2302.00236.json",
    "total_tokens": 819,
    "translated_title": "对称生成对抗性发现",
    "translated_abstract": "尽管等变神经网络在科学应用中取得了成功，但它们需要事先知道对称群。然而在实践中，知道要使用哪个对称群作为归纳偏差可能很困难，错误地强制使用对称群甚至可能会损害性能。本文提出了一个LieGAN框架，通过类似生成对抗性训练的范式自动从数据集中发现等变性。生成器学习一组应用于数据的变换，这些变换保持原始分布并欺骗鉴别器。LieGAN使用可解释的李代数基表示对称性，并且可以在轨迹预测和顶夸克标记任务中发现各种对称性，例如旋转群$\\mathrm{SO}(n)$，限制Lorentz群$\\mathrm{SO}(1,3)^+$。所学习的对称性也可以轻松地应用于几个现有的等变神经网络，以提高预测的准确性和泛化能力。",
    "tldr": "使用LieGAN框架，可以自动发现数据集中的等变性，从而提高预测的准确性和泛化能力。",
    "en_tdlr": "LieGAN framework automatically discovers equivariances from the dataset to improve prediction accuracy and generalization."
}