{
    "title": "Deep Learning Predicts Prevalent and Incident Parkinson's Disease From UK Biobank Fundus Imaging",
    "abstract": "arXiv:2302.06727v3 Announce Type: replace  Abstract: Parkinson's disease is the world's fastest-growing neurological disorder. Research to elucidate the mechanisms of Parkinson's disease and automate diagnostics would greatly improve the treatment of patients with Parkinson's disease. Current diagnostic methods are expensive and have limited availability. Considering the insidious and preclinical onset and progression of the disease, a desirable screening should be diagnostically accurate even before the onset of symptoms to allow medical interventions. We highlight retinal fundus imaging, often termed a window to the brain, as a diagnostic screening modality for Parkinson's disease. We conducted a systematic evaluation of conventional machine learning and deep learning techniques to classify Parkinson's disease from UK Biobank fundus imaging. Our results show that Parkinson's disease individuals can be differentiated from age and gender-matched healthy subjects with an Area Under the ",
    "link": "https://arxiv.org/abs/2302.06727",
    "context": "Title: Deep Learning Predicts Prevalent and Incident Parkinson's Disease From UK Biobank Fundus Imaging\nAbstract: arXiv:2302.06727v3 Announce Type: replace  Abstract: Parkinson's disease is the world's fastest-growing neurological disorder. Research to elucidate the mechanisms of Parkinson's disease and automate diagnostics would greatly improve the treatment of patients with Parkinson's disease. Current diagnostic methods are expensive and have limited availability. Considering the insidious and preclinical onset and progression of the disease, a desirable screening should be diagnostically accurate even before the onset of symptoms to allow medical interventions. We highlight retinal fundus imaging, often termed a window to the brain, as a diagnostic screening modality for Parkinson's disease. We conducted a systematic evaluation of conventional machine learning and deep learning techniques to classify Parkinson's disease from UK Biobank fundus imaging. Our results show that Parkinson's disease individuals can be differentiated from age and gender-matched healthy subjects with an Area Under the ",
    "path": "papers/23/02/2302.06727.json",
    "total_tokens": 892,
    "translated_title": "深度学习从英国生物库眼底成像中预测帕金森病的现有和新发病例",
    "translated_abstract": "帕金森病是世界上增长最快的神经系统疾病。研究阐明帕金森病的机制并自动进行诊断将极大地改善帕金森病患者的治疗。当前的诊断方法昂贵且供应有限。考虑到疾病的隐匿性和临床前期的发展，理想的筛查应该具有诊断准确性，甚至在症状发作之前就能允许医学干预。我们强调视网膜眼底成像作为帕金森病的诊断筛查模式，通常被称为大脑之窗。我们对传统机器学习和深度学习技术进行了系统评估，以从英国生物库眼底成像中对帕金森病进行分类。我们的结果表明，帕金森病患者可以与年龄和性别匹配的健康受试者区分开来，面积在曲线下",
    "tldr": "深度学习技术在英国生物库眼底成像中被用于诊断帕金森病，可在疾病症状发作之前实现准确筛查。",
    "en_tdlr": "Deep learning techniques are used for diagnosing Parkinson's disease from UK Biobank fundus imaging, enabling accurate screening before the onset of symptoms."
}