{
    "title": "Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)",
    "abstract": "We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.",
    "link": "http://arxiv.org/abs/2302.13426",
    "context": "Title: Price Discovery for Derivatives. (arXiv:2302.13426v5 [econ.GN] UPDATED)\nAbstract: We obtain a basic theory of price discovery across derivative markets with respect to higher-order information, using a model where an agent with general private information regarding state probabilities is allowed to trade arbitrary portfolios of state-contingent claims. In an equivalent options formulation, the informed agent has private information regarding arbitrary aspects of the payoff distribution of an underlying asset and is allowed to trade arbitrary option portfolios. We characterize, in closed form, the informed demand, price impact, and information efficiency of prices. Our results offer a theory of insider trading on higher moments of the underlying payoff as a special case. The informed demand formula prescribes option strategies for trading on any given moment and extends those used in practice for, e.g. volatility trading.",
    "path": "papers/23/02/2302.13426.json",
    "total_tokens": 790,
    "translated_title": "期权的价格发现",
    "translated_abstract": "本文通过一个模型，考虑了私有信息和高阶信息对期权市场价格的影响。模型允许有私有信息的交易者在状态-索赔集市场上交易。等价的期权形式下，我们考虑了拥有关于基础资产收益的分布的私有信息，并允许交易任意期权组合的操纵者。我们得出了通货膨胀需求、价格冲击和信息效率的闭式解，这些解提供了关于内幕交易的高阶信息，如任何给定的时刻交易期权策略，并将这些策略泛化到了波动率交易等实践领域。",
    "tldr": "本研究提供了一个基本理论，研究了带有高阶信息的期权市场中价格的发现机制。与此同时，该研究还以内幕交易的形式呈现了其中的特例，给出了通货膨胀需求、价格冲击和信息效率的闭式解。",
    "en_tdlr": "This study presents a basic theory on how prices are discovered in the derivatives market, considering the impact of private and higher-order information. The results provide a formula for informed demand and price impact, characterizing the efficiency of prices. Additionally, the study presents the special case of insider trading on higher moments of the underlying payoff, with options strategies for trading on any given moment, including volatility trading."
}