{
    "title": "Towards Unbounded Machine Unlearning. (arXiv:2302.09880v2 [cs.LG] UPDATED)",
    "abstract": "Deep machine unlearning is the problem of `removing' from a trained neural network a subset of its training set. This problem is very timely and has many applications, including the key tasks of removing biases (RB), resolving confusion (RC) (caused by mislabelled data in trained models), as well as allowing users to exercise their `right to be forgotten' to protect User Privacy (UP). This paper is the first, to our knowledge, to study unlearning for different applications (RB, RC, UP), with the view that each has its own desiderata, definitions for `forgetting' and associated metrics for forget quality. For UP, we propose a novel adaptation of a strong Membership Inference Attack for unlearning. We also propose SCRUB, a novel unlearning algorithm, which is the only method that is consistently a top performer for forget quality across the different application-dependent metrics for RB, RC, and UP. At the same time, SCRUB is also consistently a top performer on metrics that measure mode",
    "link": "http://arxiv.org/abs/2302.09880",
    "context": "Title: Towards Unbounded Machine Unlearning. (arXiv:2302.09880v2 [cs.LG] UPDATED)\nAbstract: Deep machine unlearning is the problem of `removing' from a trained neural network a subset of its training set. This problem is very timely and has many applications, including the key tasks of removing biases (RB), resolving confusion (RC) (caused by mislabelled data in trained models), as well as allowing users to exercise their `right to be forgotten' to protect User Privacy (UP). This paper is the first, to our knowledge, to study unlearning for different applications (RB, RC, UP), with the view that each has its own desiderata, definitions for `forgetting' and associated metrics for forget quality. For UP, we propose a novel adaptation of a strong Membership Inference Attack for unlearning. We also propose SCRUB, a novel unlearning algorithm, which is the only method that is consistently a top performer for forget quality across the different application-dependent metrics for RB, RC, and UP. At the same time, SCRUB is also consistently a top performer on metrics that measure mode",
    "path": "papers/23/02/2302.09880.json",
    "total_tokens": 957,
    "translated_title": "迈向无界机器遗忘",
    "translated_abstract": "深度机器遗忘是指从训练好的神经网络中“移除”其训练集的一个子集的问题。这个问题非常及时，并且有许多应用，包括解除偏见（RB）、消除混淆（RC）（由训练模型中的错误标签数据引起），以及允许用户行使“被遗忘权”以保护用户隐私（UP）的关键任务。本文是我们所知的第一篇研究不同应用（RB、RC、UP）的遗忘问题的论文，我们认为每个应用都有自己的忘记需求、忘记定义和与忘记质量相关的指标。对于UP，我们提出了一种用于遗忘的新颖适应性强的成员推断攻击。我们还提出了SCRUB，一种新颖的遗忘算法，在RB、RC和UP的不同应用相关度量指标上始终是忘记质量的顶级表现者。同时，SCRUB还在衡量模式的度量指标上始终是顶级表现者。",
    "tldr": "本文是第一篇研究不同应用（偏见消除、混淆解决、隐私保护）遗忘问题的论文，提出了适用于不同应用的遗忘定义和指标，并提出了SCRUB，一种在不同应用的遗忘质量度量上始终是顶级表现者的算法。",
    "en_tdlr": "This paper is the first to study unlearning for different applications (removing biases, resolving confusion, protecting user privacy), proposing definitions and metrics for forget quality specific to each application. It introduces SCRUB, a top-performing algorithm for forget quality across different applications."
}