{
    "title": "Optimizing Floors in First Price Auctions: an Empirical Study of Yahoo Advertising",
    "abstract": "Floors (also known as reserve prices) help publishers to increase the expected revenue of their ad space, which is usually sold via auctions. Floors are defined as the minimum bid that a seller (it can be a publisher or an ad exchange) is willing to accept for the inventory opportunity. In this paper, we present a model to set floors in first price auctions, and discuss the impact of its implementation on Yahoo sites. The model captures important characteristics of the online advertising industry. For instance, some bidders impose restrictions on how ad exchanges can handle data from bidders, conditioning the model choice to set reserve prices. Our solution induces bidders to change their bidding behavior as a response to the floors enclosed in the bid request, helping online publishers to increase their ad revenue.   The outlined methodology has been implemented at Yahoo with remarkable results. The annualized incremental revenue is estimated at +1.3% on Yahoo display inventory, and +",
    "link": "https://arxiv.org/abs/2302.06018",
    "context": "Title: Optimizing Floors in First Price Auctions: an Empirical Study of Yahoo Advertising\nAbstract: Floors (also known as reserve prices) help publishers to increase the expected revenue of their ad space, which is usually sold via auctions. Floors are defined as the minimum bid that a seller (it can be a publisher or an ad exchange) is willing to accept for the inventory opportunity. In this paper, we present a model to set floors in first price auctions, and discuss the impact of its implementation on Yahoo sites. The model captures important characteristics of the online advertising industry. For instance, some bidders impose restrictions on how ad exchanges can handle data from bidders, conditioning the model choice to set reserve prices. Our solution induces bidders to change their bidding behavior as a response to the floors enclosed in the bid request, helping online publishers to increase their ad revenue.   The outlined methodology has been implemented at Yahoo with remarkable results. The annualized incremental revenue is estimated at +1.3% on Yahoo display inventory, and +",
    "path": "papers/23/02/2302.06018.json",
    "total_tokens": 838,
    "translated_title": "优化一级定价拍卖中的底价：雅虎广告的实证研究",
    "translated_abstract": "底价（也称为保留价格）帮助发布者增加其广告空间的预期收入，通常通过拍卖方式出售。底价被定义为卖方（可以是发布者或广告交易所）愿意接受的最低出价。本文提出了一个在一级定价拍卖中设定底价的模型，并讨论了其在雅虎网站上实施的影响。该模型捕捉了在线广告行业的重要特征。例如，一些竞标者对广告交易所如何处理竞标者的数据提出限制，这限制了设置保留价格的模型选择。我们的解决方案通过在竞标请求中加入底价来引导竞标者改变其竞标行为，帮助在线发布者增加其广告收入。该解决方案已在雅虎上实施，并取得了显著的成果。预计雅虎的展示广告存货增量年均收入为+1.3%。",
    "tldr": "本研究提出了一个在一级定价拍卖中设定底价的模型，并应用于雅虎广告，从而使得在线发布者能够增加广告收入。"
}