{
    "title": "Precursor recommendation for inorganic synthesis by machine learning materials similarity from scientific literature. (arXiv:2302.02303v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "Synthesis prediction is a key accelerator for the rapid design of advanced materials. However, determining synthesis variables such as the choice of precursor materials is challenging for inorganic materials because the sequence of reactions during heating is not well understood. In this work, we use a knowledge base of 29,900 solid-state synthesis recipes, text-mined from the scientific literature, to automatically learn which precursors to recommend for the synthesis of a novel target material. The data-driven approach learns chemical similarity of materials and refers the synthesis of a new target to precedent synthesis procedures of similar materials, mimicking human synthesis design. When proposing five precursor sets for each of 2,654 unseen test target materials, the recommendation strategy achieves a success rate of at least 82%. Our approach captures decades of heuristic synthesis data in a mathematical form, making it accessible for use in recommendation engines and autonomou",
    "link": "http://arxiv.org/abs/2302.02303",
    "context": "Title: Precursor recommendation for inorganic synthesis by machine learning materials similarity from scientific literature. (arXiv:2302.02303v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: Synthesis prediction is a key accelerator for the rapid design of advanced materials. However, determining synthesis variables such as the choice of precursor materials is challenging for inorganic materials because the sequence of reactions during heating is not well understood. In this work, we use a knowledge base of 29,900 solid-state synthesis recipes, text-mined from the scientific literature, to automatically learn which precursors to recommend for the synthesis of a novel target material. The data-driven approach learns chemical similarity of materials and refers the synthesis of a new target to precedent synthesis procedures of similar materials, mimicking human synthesis design. When proposing five precursor sets for each of 2,654 unseen test target materials, the recommendation strategy achieves a success rate of at least 82%. Our approach captures decades of heuristic synthesis data in a mathematical form, making it accessible for use in recommendation engines and autonomou",
    "path": "papers/23/02/2302.02303.json",
    "total_tokens": 922,
    "translated_title": "基于机器学习材料相似性从科学文献中推荐配方来促进无机合成前体预测",
    "translated_abstract": "合成预测是推动先进材料快速设计的关键因素。然而，对于无机材料来说，确定合成变量，如前体材料的选择，是具有挑战性的，因为在加热过程中反应顺序不是很清楚。本研究利用从科学文献中提取的29,900个固态合成配方的知识库，自动学习推荐新目标材料的前体材料。数据驱动方法通过学习材料化学相似性，并将新目标材料的合成参照类似材料的先前合成程序，模拟人类合成设计。当针对2,654个未见过的测试目标材料提出五种前体组合时，推荐策略的成功率至少为82％。我们的方法以数学形式捕捉了几十年的经验合成数据，使得它可以用于推荐引擎和自治。",
    "tldr": "本研究利用从科学文献中提取的合成配方的知识库，自动学习推荐新目标材料的前体材料，通过学习材料化学相似性并将新目标材料的合成参照类似材料的先前合成程序，成功率至少为82%。",
    "en_tdlr": "This research uses a knowledge base of synthesized recipes extracted from scientific literature to learn and recommend precursor materials for new target materials. By learning the chemical similarity of materials and using precedent synthesis procedures of similar materials, a success rate of at least 82% is achieved."
}