{
    "title": "Electricity price forecasting with Smoothing Quantile Regression Averaging: Quantifying economic benefits of probabilistic forecasts. (arXiv:2302.00411v2 [stat.AP] UPDATED)",
    "abstract": "In the world of the complex power market, accurate electricity price forecasting is essential for strategic bidding and affects both daily operations and long-term investments. This article introduce a new method dubbed Smoothing Quantile Regression (SQR) Averaging, that improves on well-performing schemes for probabilistic forecasting. To showcase its utility, a comprehensive study is conducted across four power markets, including recent data encompassing the COVID-19 pandemic and the Russian invasion on Ukraine. The performance of SQR Averaging is evaluated and compared to state-of-the-art benchmark methods in terms of the reliability and sharpness measures. Additionally, an evaluation scheme is introduced to quantify the economic benefits derived from SQR Averaging predictions. This scheme can be applied in any day-ahead electricity market and is based on a trading strategy that leverages battery storage and sets limit orders using selected quantiles of the predictive distribution. ",
    "link": "http://arxiv.org/abs/2302.00411",
    "context": "Title: Electricity price forecasting with Smoothing Quantile Regression Averaging: Quantifying economic benefits of probabilistic forecasts. (arXiv:2302.00411v2 [stat.AP] UPDATED)\nAbstract: In the world of the complex power market, accurate electricity price forecasting is essential for strategic bidding and affects both daily operations and long-term investments. This article introduce a new method dubbed Smoothing Quantile Regression (SQR) Averaging, that improves on well-performing schemes for probabilistic forecasting. To showcase its utility, a comprehensive study is conducted across four power markets, including recent data encompassing the COVID-19 pandemic and the Russian invasion on Ukraine. The performance of SQR Averaging is evaluated and compared to state-of-the-art benchmark methods in terms of the reliability and sharpness measures. Additionally, an evaluation scheme is introduced to quantify the economic benefits derived from SQR Averaging predictions. This scheme can be applied in any day-ahead electricity market and is based on a trading strategy that leverages battery storage and sets limit orders using selected quantiles of the predictive distribution. ",
    "path": "papers/23/02/2302.00411.json",
    "total_tokens": 961,
    "translated_title": "使用平滑分位数回归平均的电力价格预测：量化概率预测的经济效益",
    "translated_abstract": "在复杂的电力市场中，准确的电力价格预测对战略投标至关重要，影响着日常运营和长期投资。本文介绍了一种名为平滑分位数回归平均（SQR Averaging）的新方法，它改进了概率预测的高性能方案。为了展示其效用，我们在包括COVID-19疫情和俄罗斯对乌克兰的入侵的最新数据基础上，对四个电力市场进行了全面研究。通过可靠性和锐度指标，评估了SQR Averaging的性能，并将其与最先进的基准方法进行了比较。此外，还引入了一种评估方案，用于量化SQR Averaging预测所带来的经济效益。该方案可以应用于任何日前电力市场，并基于一种利用电池储存的交易策略，通过使用选定的预测分布分位数设定限价订单。",
    "tldr": "本文介绍了一种名为平滑分位数回归平均（SQR Averaging）的新方法，用于准确预测复杂电力市场的电力价格，通过评估可靠性和锐度指标表明其性能优于现有的基准方法，并引入了一种评估方案来量化预测所带来的经济效益。",
    "en_tdlr": "This paper introduces a new method called Smoothing Quantile Regression (SQR) Averaging for accurate electricity price forecasting in complex power markets. The performance evaluation shows its superiority over existing benchmark methods in terms of reliability and sharpness measures, and an evaluation scheme is developed to quantify the economic benefits of the predictions."
}