{
    "title": "Normalizing Flow Ensembles for Rich Aleatoric and Epistemic Uncertainty Modeling. (arXiv:2302.01312v2 [cs.LG] UPDATED)",
    "abstract": "In this work, we demonstrate how to reliably estimate epistemic uncertainty while maintaining the flexibility needed to capture complicated aleatoric distributions. To this end, we propose an ensemble of Normalizing Flows (NF), which are state-of-the-art in modeling aleatoric uncertainty. The ensembles are created via sets of fixed dropout masks, making them less expensive than creating separate NF models. We demonstrate how to leverage the unique structure of NFs, base distributions, to estimate aleatoric uncertainty without relying on samples, provide a comprehensive set of baselines, and derive unbiased estimates for differential entropy. The methods were applied to a variety of experiments, commonly used to benchmark aleatoric and epistemic uncertainty estimation: 1D sinusoidal data, 2D windy grid-world ($\\it{Wet Chicken}$), $\\it{Pendulum}$, and $\\it{Hopper}$. In these experiments, we setup an active learning framework and evaluate each model's capability at measuring aleatoric and",
    "link": "http://arxiv.org/abs/2302.01312",
    "context": "Title: Normalizing Flow Ensembles for Rich Aleatoric and Epistemic Uncertainty Modeling. (arXiv:2302.01312v2 [cs.LG] UPDATED)\nAbstract: In this work, we demonstrate how to reliably estimate epistemic uncertainty while maintaining the flexibility needed to capture complicated aleatoric distributions. To this end, we propose an ensemble of Normalizing Flows (NF), which are state-of-the-art in modeling aleatoric uncertainty. The ensembles are created via sets of fixed dropout masks, making them less expensive than creating separate NF models. We demonstrate how to leverage the unique structure of NFs, base distributions, to estimate aleatoric uncertainty without relying on samples, provide a comprehensive set of baselines, and derive unbiased estimates for differential entropy. The methods were applied to a variety of experiments, commonly used to benchmark aleatoric and epistemic uncertainty estimation: 1D sinusoidal data, 2D windy grid-world ($\\it{Wet Chicken}$), $\\it{Pendulum}$, and $\\it{Hopper}$. In these experiments, we setup an active learning framework and evaluate each model's capability at measuring aleatoric and",
    "path": "papers/23/02/2302.01312.json",
    "total_tokens": 922,
    "translated_title": "正则化流集合用于丰富的Aleatoric和Epistemic不确定性建模",
    "translated_abstract": "本文展示了如何可靠地估计Epistemic不确定性，同时保持捕捉复杂Aleatoric分布所需的灵活性。为此，我们提出了一个正则化流（NF）集合，这是建模Aleatoric不确定性的最先进技术。集合是通过固定的dropout掩码集合创建的，比创建单独的NF模型更加经济。我们演示了如何利用NF的独特结构——基础分布——来估计Aleatoric不确定性，而无需依赖样本，提供了全面的基准线，并推导出无偏的微分熵估计值。该方法被应用于各种用于基准测试Aleatoric和Epistemic不确定性估计的实验中：1D正弦数据，2D有风格网格世界（$\\it{Wet Chicken}$），$\\it{Pendulum}$和$\\it{Hopper}$。在这些实验中，我们建立了一个主动学习框架，并评估了每个模型在测量Aleatoric和Epistemic不确定性方面的能力。",
    "tldr": "本文提出了一个正则化流（NF）集合来估计Epistemic不确定性和Aleatoric不确定性，通过固定的dropout掩码来创建集合，运用于各种实验并可以提供全面的基准线。"
}