{
    "title": "Reducing the Prior Mismatch of Stochastic Differential Equations for Diffusion-based Speech Enhancement. (arXiv:2302.14748v2 [eess.AS] UPDATED)",
    "abstract": "Recently, score-based generative models have been successfully employed for the task of speech enhancement. A stochastic differential equation is used to model the iterative forward process, where at each step environmental noise and white Gaussian noise are added to the clean speech signal. While in limit the mean of the forward process ends at the noisy mixture, in practice it stops earlier and thus only at an approximation of the noisy mixture. This results in a discrepancy between the terminating distribution of the forward process and the prior used for solving the reverse process at inference. In this paper, we address this discrepancy and propose a forward process based on a Brownian bridge. We show that such a process leads to a reduction of the mismatch compared to previous diffusion processes. More importantly, we show that our approach improves in objective metrics over the baseline process with only half of the iteration steps and having one hyperparameter less to tune.",
    "link": "http://arxiv.org/abs/2302.14748",
    "context": "Title: Reducing the Prior Mismatch of Stochastic Differential Equations for Diffusion-based Speech Enhancement. (arXiv:2302.14748v2 [eess.AS] UPDATED)\nAbstract: Recently, score-based generative models have been successfully employed for the task of speech enhancement. A stochastic differential equation is used to model the iterative forward process, where at each step environmental noise and white Gaussian noise are added to the clean speech signal. While in limit the mean of the forward process ends at the noisy mixture, in practice it stops earlier and thus only at an approximation of the noisy mixture. This results in a discrepancy between the terminating distribution of the forward process and the prior used for solving the reverse process at inference. In this paper, we address this discrepancy and propose a forward process based on a Brownian bridge. We show that such a process leads to a reduction of the mismatch compared to previous diffusion processes. More importantly, we show that our approach improves in objective metrics over the baseline process with only half of the iteration steps and having one hyperparameter less to tune.",
    "path": "papers/23/02/2302.14748.json",
    "total_tokens": 924,
    "translated_title": "减少扩散型语音增强中随机微分方程先验不匹配问题",
    "translated_abstract": "最近，基于评分的生成模型被成功地用于语音增强任务。一种随机微分方程用于建模迭代向前过程，在每个步骤中，环境噪声和白噪声被添加到干净的语音信号中。虽然在极限情况下，向前过程的均值会结束于嘈杂混合信号，但在实践中，它会提前结束并以嘈杂混合信号的近似值结束。这导致向前过程的终止分布与用于推理反向过程的先验之间存在差异。本文解决了这个问题，并提出了一种基于布朗桥的前向过程。我们证明了这样的过程与以前的扩散过程相比，可以减少不匹配。更重要的是，我们表明，与基准处理过程相比，我们的方法在客观指标上提供了改进，仅使用一半的迭代步骤并具有一个可调的超参数。",
    "tldr": "研究提出了一种基于布朗桥的前向过程，以减少扩散型语音增强中由重建过程和先验之间的不匹配问题引起的误差，并提出的方法只需一半的迭代次数和一个可调的超参数即可改进处理过程。",
    "en_tdlr": "This paper proposes a forward process based on a Brownian bridge to reduce the error caused by the mismatch between the reconstruction process and the prior in diffusion-based speech enhancement. The proposed approach improves over the baseline process with only half of the iteration steps and having one tunable hyperparameter."
}