{
    "title": "Clustered Covariate Regression. (arXiv:2302.09255v2 [econ.EM] UPDATED)",
    "abstract": "High covariate dimensionality is increasingly occurrent in model estimation, and existing techniques to address this issue typically require sparsity or discrete heterogeneity of the unobservable parameter vector. However, neither restriction may be supported by economic theory in some empirical contexts, leading to severe bias and misleading inference. The clustering-based grouped parameter estimator (GPE) introduced in this paper drops both restrictions in favour of the natural one that the parameter support be compact. GPE exhibits robust large sample properties under standard conditions and accommodates both sparse and non-sparse parameters whose support can be bounded away from zero. Extensive Monte Carlo simulations demonstrate the excellent performance of GPE in terms of bias reduction and size control compared to competing estimators. An empirical application of GPE to estimating price and income elasticities of demand for gasoline highlights its practical utility.",
    "link": "http://arxiv.org/abs/2302.09255",
    "context": "Title: Clustered Covariate Regression. (arXiv:2302.09255v2 [econ.EM] UPDATED)\nAbstract: High covariate dimensionality is increasingly occurrent in model estimation, and existing techniques to address this issue typically require sparsity or discrete heterogeneity of the unobservable parameter vector. However, neither restriction may be supported by economic theory in some empirical contexts, leading to severe bias and misleading inference. The clustering-based grouped parameter estimator (GPE) introduced in this paper drops both restrictions in favour of the natural one that the parameter support be compact. GPE exhibits robust large sample properties under standard conditions and accommodates both sparse and non-sparse parameters whose support can be bounded away from zero. Extensive Monte Carlo simulations demonstrate the excellent performance of GPE in terms of bias reduction and size control compared to competing estimators. An empirical application of GPE to estimating price and income elasticities of demand for gasoline highlights its practical utility.",
    "path": "papers/23/02/2302.09255.json",
    "total_tokens": 908,
    "translated_title": "聚类协变量回归",
    "translated_abstract": "模型估计中协变量维度的高度增加，解决这个问题的现有技术通常需要无序性或不可观测参数向量的离散异质性。然而，在某些经验背景下，经济理论可能不支持任何限制，这可能导致严重的偏差和误导性推断。本文介绍的基于聚类的分组参数估计器（GPE）放弃这两个限制，而选择参数支持是紧凑的自然限制。在标准条件下，GPE具有稳健的大样本性质，并适应了支持可以远离零点的稀疏和非稀疏参数。广泛的蒙特卡洛模拟证明了与竞争估计器相比，GPE在偏差减小和尺寸控制方面的出色性能。对于估计汽油需求的价格和收入弹性的实证应用突显了GPE的实用性。",
    "tldr": "本文提出了一种聚类协变量回归方法，该方法通过使用聚类和紧凑参数支持的自然限制来解决高维度协变量问题。与竞争估计器相比，该方法在偏差减小和尺寸控制方面表现出色，并在估计汽油需求的价格和收入弹性方面具有实用性。",
    "en_tdlr": "This paper proposes a clustered covariate regression method that addresses the issue of high-dimensional covariates by using clustering and the natural restriction of compact parameter support. The method performs well in bias reduction and size control compared to competing estimators, and demonstrates practical utility in estimating price and income elasticities of gasoline demand."
}