{
    "title": "Out-of-Domain Robustness via Targeted Augmentations. (arXiv:2302.11861v2 [cs.LG] UPDATED)",
    "abstract": "Models trained on one set of domains often suffer performance drops on unseen domains, e.g., when wildlife monitoring models are deployed in new camera locations. In this work, we study principles for designing data augmentations for out-of-domain (OOD) generalization. In particular, we focus on real-world scenarios in which some domain-dependent features are robust, i.e., some features that vary across domains are predictive OOD. For example, in the wildlife monitoring application above, image backgrounds vary across camera locations but indicate habitat type, which helps predict the species of photographed animals. Motivated by theoretical analysis on a linear setting, we propose targeted augmentations, which selectively randomize spurious domain-dependent features while preserving robust ones. We prove that targeted augmentations improve OOD performance, allowing models to generalize better with fewer domains. In contrast, existing approaches such as generic augmentations, which fai",
    "link": "http://arxiv.org/abs/2302.11861",
    "context": "Title: Out-of-Domain Robustness via Targeted Augmentations. (arXiv:2302.11861v2 [cs.LG] UPDATED)\nAbstract: Models trained on one set of domains often suffer performance drops on unseen domains, e.g., when wildlife monitoring models are deployed in new camera locations. In this work, we study principles for designing data augmentations for out-of-domain (OOD) generalization. In particular, we focus on real-world scenarios in which some domain-dependent features are robust, i.e., some features that vary across domains are predictive OOD. For example, in the wildlife monitoring application above, image backgrounds vary across camera locations but indicate habitat type, which helps predict the species of photographed animals. Motivated by theoretical analysis on a linear setting, we propose targeted augmentations, which selectively randomize spurious domain-dependent features while preserving robust ones. We prove that targeted augmentations improve OOD performance, allowing models to generalize better with fewer domains. In contrast, existing approaches such as generic augmentations, which fai",
    "path": "papers/23/02/2302.11861.json",
    "total_tokens": 972,
    "translated_title": "通过有针对性的增强实现领域外的鲁棒性",
    "translated_abstract": "在一个领域上训练的模型往往在未见过的领域上表现下降，比如野生动物监测模型在新的摄像机位置上部署时会出现这种情况。在这项工作中，我们研究了为领域外泛化设计数据增强的原则。特别地，我们关注现实世界中的场景，在这些场景中，一些与领域相关的特征是鲁棒的，即一些在不同领域间变化的特征对泛化有预测能力。例如，在上述的野生动物监测应用中，图像背景在摄像机位置上不同，但可以指示栖息地类型，从而帮助预测被摄动物的物种。在对线性设置进行理论分析的基础上，我们提出了有针对性的增强方法，即有选择性地随机化虚假的领域相关特征，同时保留鲁棒的特征。我们证明了有针对性的增强可以提高领域外性能，使模型在较少领域上具有更好的泛化能力。相比之下，现有的通用增强方法未能实现领域外的鲁棒性。",
    "tldr": "本文研究了为领域外泛化设计数据增强的原则，通过有针对性的增强方法，在保留鲁棒特征的同时随机化虚假的领域相关特征，提高了领域外性能。",
    "en_tdlr": "This paper studies the principles for designing data augmentations for out-of-domain generalization. By using targeted augmentations, which selectively randomize spurious domain-dependent features while preserving robust ones, the paper improves the out-of-domain performance."
}