{
    "title": "Future Aware Pricing and Matching for Sustainable On-demand Ride Pooling. (arXiv:2302.10510v2 [cs.AI] UPDATED)",
    "abstract": "The popularity of on-demand ride pooling is owing to the benefits offered to customers (lower prices), taxi drivers (higher revenue), environment (lower carbon footprint due to fewer vehicles) and aggregation companies like Uber (higher revenue). To achieve these benefits, two key interlinked challenges have to be solved effectively: (a) pricing -- setting prices to customer requests for taxis; and (b) matching -- assignment of customers (that accepted the prices) to taxis/cars. Traditionally, both these challenges have been studied individually and using myopic approaches (considering only current requests), without considering the impact of current matching on addressing future requests. In this paper, we develop a novel framework that handles the pricing and matching problems together, while also considering the future impact of the pricing and matching decisions. In our experimental results on a real-world taxi dataset, we demonstrate that our framework can significantly improve re",
    "link": "http://arxiv.org/abs/2302.10510",
    "context": "Title: Future Aware Pricing and Matching for Sustainable On-demand Ride Pooling. (arXiv:2302.10510v2 [cs.AI] UPDATED)\nAbstract: The popularity of on-demand ride pooling is owing to the benefits offered to customers (lower prices), taxi drivers (higher revenue), environment (lower carbon footprint due to fewer vehicles) and aggregation companies like Uber (higher revenue). To achieve these benefits, two key interlinked challenges have to be solved effectively: (a) pricing -- setting prices to customer requests for taxis; and (b) matching -- assignment of customers (that accepted the prices) to taxis/cars. Traditionally, both these challenges have been studied individually and using myopic approaches (considering only current requests), without considering the impact of current matching on addressing future requests. In this paper, we develop a novel framework that handles the pricing and matching problems together, while also considering the future impact of the pricing and matching decisions. In our experimental results on a real-world taxi dataset, we demonstrate that our framework can significantly improve re",
    "path": "papers/23/02/2302.10510.json",
    "total_tokens": 892,
    "translated_title": "面向可持续性的即时拼车的未来感知定价和匹配",
    "translated_abstract": "即时拼车的受欢迎程度在于为顾客（更低的价格）、出租车司机（更高的收入）、环境（由于更少的车辆而减少碳排放量）和Uber等聚合公司（更高的收入）提供了好处。为了实现这些收益，必须有效地解决两个关键而相互关联的挑战：（a）定价——为出租车顾客请求设置价格；和（b）匹配——将接受价格的客户分配给出租车/汽车。传统上，这两个挑战都是单独研究的，并且使用短视的方法（只考虑当前请求），而不考虑当前匹配对解决未来请求的影响。在本文中，我们开发了一个新的框架，处理定价和匹配问题，同时考虑定价和匹配决策对未来影响的影响。在真实出租车数据集上的实验结果表明，我们的框架可以显著改善匹配和定价效果。",
    "tldr": "本论文提出了一个新的框架，同时处理定价和匹配问题，并考虑商业决策对未来的影响，实验结果表明该框架可以显著提高拼车的效率和效益。",
    "en_tdlr": "This paper proposes a novel framework that simultaneously addresses pricing and matching problems and considers future impact of the decisions. Experimental results demonstrate that it significantly improves the efficiency and benefits of ride pooling."
}