{
    "title": "Why Do Facial Deepfake Detectors Fail?. (arXiv:2302.13156v2 [cs.CR] UPDATED)",
    "abstract": "Recent rapid advancements in deepfake technology have allowed the creation of highly realistic fake media, such as video, image, and audio. These materials pose significant challenges to human authentication, such as impersonation, misinformation, or even a threat to national security. To keep pace with these rapid advancements, several deepfake detection algorithms have been proposed, leading to an ongoing arms race between deepfake creators and deepfake detectors. Nevertheless, these detectors are often unreliable and frequently fail to detect deepfakes. This study highlights the challenges they face in detecting deepfakes, including (1) the pre-processing pipeline of artifacts and (2) the fact that generators of new, unseen deepfake samples have not been considered when building the defense models. Our work sheds light on the need for further research and development in this field to create more robust and reliable detectors.",
    "link": "http://arxiv.org/abs/2302.13156",
    "context": "Title: Why Do Facial Deepfake Detectors Fail?. (arXiv:2302.13156v2 [cs.CR] UPDATED)\nAbstract: Recent rapid advancements in deepfake technology have allowed the creation of highly realistic fake media, such as video, image, and audio. These materials pose significant challenges to human authentication, such as impersonation, misinformation, or even a threat to national security. To keep pace with these rapid advancements, several deepfake detection algorithms have been proposed, leading to an ongoing arms race between deepfake creators and deepfake detectors. Nevertheless, these detectors are often unreliable and frequently fail to detect deepfakes. This study highlights the challenges they face in detecting deepfakes, including (1) the pre-processing pipeline of artifacts and (2) the fact that generators of new, unseen deepfake samples have not been considered when building the defense models. Our work sheds light on the need for further research and development in this field to create more robust and reliable detectors.",
    "path": "papers/23/02/2302.13156.json",
    "total_tokens": 1012,
    "translated_title": "为什么面部深度伪造检测器会失败？",
    "translated_abstract": "近年来，深度伪造技术快速发展，使得创建高度逼真的伪造媒体成为可能，包括视频、图像和音频。这些材料对人类身份验证提出了重大挑战，例如冒充、误导甚至对国家安全构成威胁。为了跟上这些快速发展，提出了多种深度伪造检测算法，从而引发了伪造者和检测器之间的持续博弈。然而，这些检测器经常存在不可靠性，并且经常无法检测到深度伪造的内容。本研究重点介绍了深度伪造检测器面临的挑战，包括（1）预处理流程中的伪造图像痕迹（artifact）和（2）在构建防御模型时未考虑到生成新的、未见过的深度伪造样本。我们的工作揭示了在这个领域需要进一步的研究和开发，以创建更为稳健可靠的检测器。",
    "tldr": "近年来快速发展的深度伪造技术对人类身份验证提出了重大挑战，已提出多种深度伪造检测算法，但检测器经常不可靠且无法检测到深度伪造内容。这项研究强调了检测器面临的挑战，包括预处理中的伪造痕迹和未考虑到新样本生成器。需要进一步研究和开发以创建更稳健可靠的深度伪造检测器。",
    "en_tdlr": "Recent rapid advancements in deepfake technology have posed significant challenges to human authentication. Although several deepfake detection algorithms have been proposed, they often fail to detect deepfakes. This study highlights the challenges faced by deepfake detectors, including preprocessing artifacts and the lack of consideration for new, unseen deepfake samples. Further research and development are needed to create more robust and reliable detectors."
}