{
    "title": "Efficient Graph Laplacian Estimation by Proximal Newton. (arXiv:2302.06434v2 [cs.LG] UPDATED)",
    "abstract": "The Laplacian-constrained Gaussian Markov Random Field (LGMRF) is a common multivariate statistical model for learning a weighted sparse dependency graph from given data. This graph learning problem can be formulated as a maximum likelihood estimation (MLE) of the precision matrix, subject to Laplacian structural constraints, with a sparsity-inducing penalty term. This paper aims to solve this learning problem accurately and efficiently. First, since the commonly used $\\ell_1$-norm penalty is inappropriate in this setting and may lead to a complete graph, we employ the nonconvex minimax concave penalty (MCP), which promotes sparse solutions with lower estimation bias. Second, as opposed to existing first-order methods for this problem, we develop a second-order proximal Newton approach to obtain an efficient solver, utilizing several algorithmic features, such as using Conjugate Gradients, preconditioning, and splitting to active/free sets. Numerical experiments demonstrate the advanta",
    "link": "http://arxiv.org/abs/2302.06434",
    "context": "Title: Efficient Graph Laplacian Estimation by Proximal Newton. (arXiv:2302.06434v2 [cs.LG] UPDATED)\nAbstract: The Laplacian-constrained Gaussian Markov Random Field (LGMRF) is a common multivariate statistical model for learning a weighted sparse dependency graph from given data. This graph learning problem can be formulated as a maximum likelihood estimation (MLE) of the precision matrix, subject to Laplacian structural constraints, with a sparsity-inducing penalty term. This paper aims to solve this learning problem accurately and efficiently. First, since the commonly used $\\ell_1$-norm penalty is inappropriate in this setting and may lead to a complete graph, we employ the nonconvex minimax concave penalty (MCP), which promotes sparse solutions with lower estimation bias. Second, as opposed to existing first-order methods for this problem, we develop a second-order proximal Newton approach to obtain an efficient solver, utilizing several algorithmic features, such as using Conjugate Gradients, preconditioning, and splitting to active/free sets. Numerical experiments demonstrate the advanta",
    "path": "papers/23/02/2302.06434.json",
    "total_tokens": 935,
    "translated_title": "Proximal Newton算法实现高效图拉普拉斯估计",
    "translated_abstract": "Laplacian约束的高斯马尔科夫随机场（LGMRF）是一种常见的多元统计模型，用于从给定数据中学习权重稀疏的依赖图。这个图学习问题可以被形式化为最大似然估计（MLE）的精度矩阵，受到Laplacian结构约束的限制，并带有稀疏性诱导的惩罚项。本论文旨在准确且高效地解决这个学习问题。首先，由于在这个设置中通常使用的$\\ell_1$-范数惩罚不适用并且可能导致完全图，所以我们采用了非凸的MCP（minimax concave penalty），它促进具有更低估计偏差的稀疏解。其次，与现有的该问题的一阶方法相反，我们开发了一种二阶proximal Newton方法来获得高效的求解器，利用了多种算法特性，如使用共轭梯度法、预条件化和分割到活动/自由集。数值实验证明了该算法的优点。",
    "tldr": "本文提出了一种基于Proximal Newton算法的高效图拉普拉斯估计方法，通过引入非凸minimax concave penalty，并利用二阶优化方法和几个算法技巧，实现了准确且高效的求解器。",
    "en_tdlr": "This paper proposes an efficient method for graph Laplacian estimation based on the Proximal Newton algorithm, which introduces a nonconvex minimax concave penalty and utilizes second-order optimization and several algorithmic features to achieve accurate and efficient solver."
}