{
    "title": "On discrete symmetries of robotics systems: A group-theoretic and data-driven analysis. (arXiv:2302.10433v2 [cs.RO] UPDATED)",
    "abstract": "We present a comprehensive study on discrete morphological symmetries of dynamical systems, which are commonly observed in biological and artificial locomoting systems, such as legged, swimming, and flying animals/robots/virtual characters. These symmetries arise from the presence of one or more planes/axis of symmetry in the system's morphology, resulting in harmonious duplication and distribution of body parts. Significantly, we characterize how morphological symmetries extend to symmetries in the system's dynamics, optimal control policies, and in all proprioceptive and exteroceptive measurements related to the system's dynamics evolution. In the context of data-driven methods, symmetry represents an inductive bias that justifies the use of data augmentation or symmetric function approximators. To tackle this, we present a theoretical and practical framework for identifying the system's morphological symmetry group $\\G$ and characterizing the symmetries in proprioceptive and exteroc",
    "link": "http://arxiv.org/abs/2302.10433",
    "context": "Title: On discrete symmetries of robotics systems: A group-theoretic and data-driven analysis. (arXiv:2302.10433v2 [cs.RO] UPDATED)\nAbstract: We present a comprehensive study on discrete morphological symmetries of dynamical systems, which are commonly observed in biological and artificial locomoting systems, such as legged, swimming, and flying animals/robots/virtual characters. These symmetries arise from the presence of one or more planes/axis of symmetry in the system's morphology, resulting in harmonious duplication and distribution of body parts. Significantly, we characterize how morphological symmetries extend to symmetries in the system's dynamics, optimal control policies, and in all proprioceptive and exteroceptive measurements related to the system's dynamics evolution. In the context of data-driven methods, symmetry represents an inductive bias that justifies the use of data augmentation or symmetric function approximators. To tackle this, we present a theoretical and practical framework for identifying the system's morphological symmetry group $\\G$ and characterizing the symmetries in proprioceptive and exteroc",
    "path": "papers/23/02/2302.10433.json",
    "total_tokens": 1059,
    "translated_title": "机器人系统的离散对称性: 基于群论和数据驱动分析的研究",
    "translated_abstract": "本文对运动系统的离散形态对称性进行了全面的研究，这在生物和人工运动系统中经常观察到，例如多腿、游泳和飞行的动物/机器人/虚拟角色。这些对称性源自系统形态中一个或多个平面/轴的对称性存在，导致身体部件的谐波复制和分布。我们阐述了形态对称性如何延伸到系统动力学、最优控制策略以及与系统动力学演化相关的所有本体感和外感测量中的对称性。在数据驱动方法的背景下，对称性代表一种归纳偏置，证明了数据增强或对称函数逼近器的使用。为了解决这个问题，我们提出了一个理论和实践框架，用于识别系统的形态对称群G并描述其在本体感和外感测量、最优控制策略以及系统动力学方面的对称性。该框架涉及到数据驱动和群论工具，例如主成分分析，置换测试和表示理论。提出的方法学通过确定一个仿生脊椎机器人的对称群并分析其对数据增强和控制设计的影响来进行说明。",
    "tldr": "本文研究了运动系统的离散形态对称性，并提出了一个理论和实践框架，用于识别系统的形态对称群，并分析对称性在数据增强和控制设计中的应用。",
    "en_tdlr": "This paper studies the discrete morphological symmetries of dynamical systems and proposes a theoretical and practical framework for identifying the system's morphological symmetry group and analyzing the application of symmetry in data augmentation and control design."
}