{
    "title": "A Human-Centered Safe Robot Reinforcement Learning Framework with Interactive Behaviors. (arXiv:2302.13137v3 [cs.RO] UPDATED)",
    "abstract": "Deployment of Reinforcement Learning (RL) algorithms for robotics applications in the real world requires ensuring the safety of the robot and its environment. Safe Robot RL (SRRL) is a crucial step towards achieving human-robot coexistence. In this paper, we envision a human-centered SRRL framework consisting of three stages: safe exploration, safety value alignment, and safe collaboration. We examine the research gaps in these areas and propose to leverage interactive behaviors for SRRL. Interactive behaviors enable bi-directional information transfer between humans and robots, such as conversational robot ChatGPT. We argue that interactive behaviors need further attention from the SRRL community. We discuss four open challenges related to the robustness, efficiency, transparency, and adaptability of SRRL with interactive behaviors.",
    "link": "http://arxiv.org/abs/2302.13137",
    "context": "Title: A Human-Centered Safe Robot Reinforcement Learning Framework with Interactive Behaviors. (arXiv:2302.13137v3 [cs.RO] UPDATED)\nAbstract: Deployment of Reinforcement Learning (RL) algorithms for robotics applications in the real world requires ensuring the safety of the robot and its environment. Safe Robot RL (SRRL) is a crucial step towards achieving human-robot coexistence. In this paper, we envision a human-centered SRRL framework consisting of three stages: safe exploration, safety value alignment, and safe collaboration. We examine the research gaps in these areas and propose to leverage interactive behaviors for SRRL. Interactive behaviors enable bi-directional information transfer between humans and robots, such as conversational robot ChatGPT. We argue that interactive behaviors need further attention from the SRRL community. We discuss four open challenges related to the robustness, efficiency, transparency, and adaptability of SRRL with interactive behaviors.",
    "path": "papers/23/02/2302.13137.json",
    "total_tokens": 845,
    "translated_title": "基于人机交互行为的安全机器人强化学习框架",
    "translated_abstract": "在现实世界中部署强化学习算法进行机器人应用需要确保机器人及其环境的安全。安全机器人强化学习(SRRL)是实现人机共存的关键一步。本文构建了一个以人为中心的SRRL框架，包括安全探索、安全价值对齐和安全协作三个阶段。我们研究了这些领域的研究空白，并提出利用人机交互行为进行SRRL的方法。人机交互行为实现了人与机器人之间的双向信息传递，例如对话型机器人ChatGPT。我们认为人机交互行为需要SRRL社区进一步关注。我们讨论了与人机交互行为的SRRL相关的四个开放挑战，包括鲁棒性、效率、透明度和适应性。",
    "tldr": "本文提出了一个以人为中心的安全机器人强化学习框架，其中关注人机交互行为对于实现安全探索、安全价值对齐和安全协作的重要性，并提出了与人机交互行为相关的四个开放挑战。",
    "en_tdlr": "This paper presents a human-centered safe robot reinforcement learning framework, highlighting the importance of interactive behaviors for achieving safe exploration, safety value alignment, and safe collaboration, and discussing four open challenges related to interactive behaviors in safe robot reinforcement learning."
}