{
    "title": "Residual Policy Learning for Vehicle Control of Autonomous Racing Cars. (arXiv:2302.07035v2 [cs.RO] UPDATED)",
    "abstract": "The development of vehicle controllers for autonomous racing is challenging because racing cars operate at their physical driving limit. Prompted by the demand for improved performance, autonomous racing research has seen the proliferation of machine learning-based controllers. While these approaches show competitive performance, their practical applicability is often limited. Residual policy learning promises to mitigate this drawback by combining classical controllers with learned residual controllers. The critical advantage of residual controllers is their high adaptability parallel to the classical controller's stable behavior. We propose a residual vehicle controller for autonomous racing cars that learns to amend a classical controller for the path-following of racing lines. In an extensive study, performance gains of our approach are evaluated for a simulated car of the F1TENTH autonomous racing series. The evaluation for twelve replicated real-world racetracks shows that the re",
    "link": "http://arxiv.org/abs/2302.07035",
    "context": "Title: Residual Policy Learning for Vehicle Control of Autonomous Racing Cars. (arXiv:2302.07035v2 [cs.RO] UPDATED)\nAbstract: The development of vehicle controllers for autonomous racing is challenging because racing cars operate at their physical driving limit. Prompted by the demand for improved performance, autonomous racing research has seen the proliferation of machine learning-based controllers. While these approaches show competitive performance, their practical applicability is often limited. Residual policy learning promises to mitigate this drawback by combining classical controllers with learned residual controllers. The critical advantage of residual controllers is their high adaptability parallel to the classical controller's stable behavior. We propose a residual vehicle controller for autonomous racing cars that learns to amend a classical controller for the path-following of racing lines. In an extensive study, performance gains of our approach are evaluated for a simulated car of the F1TENTH autonomous racing series. The evaluation for twelve replicated real-world racetracks shows that the re",
    "path": "papers/23/02/2302.07035.json",
    "total_tokens": 921,
    "translated_title": "自主驾驶赛车的残差策略学习车辆控制",
    "translated_abstract": "自主驾驶赛车控制器的开发具有挑战性，因为赛车运行在其物理驾驶极限上。受到对表现的需求的推动，基于机器学习的控制器开始广泛应用于自主驾驶赛车。虽然这些方法表现出竞争性能，但它们的实际可应用性常常受到限制。残差策略学习承诺通过将传统控制器与学习的残差控制器相结合来缓解此缺点，残余控制器的关键优势在于其高度适应性，与传统控制器的稳定行为并行。我们提出了一种自主驾驶赛车的残差车辆控制器，该控制器学习修正经典控制器以实现赛道线的路径跟踪。在广泛的研究中，我们的方法的性能提升被评估，并应用于F1TENTH自主驾驶赛车的仿真车辆上。对十二个复制的真实赛道的评估表明，我们的方法的实际应用效果得到了改善。",
    "tldr": "本论文提出了一种残差车辆控制器，可通过学习修正经典控制器以实现赛车的路径跟踪，并在十二个真实赛道上进行了评估。",
    "en_tdlr": "This paper proposes a residual vehicle controller for autonomous racing cars that learns to amend a classical controller for the path-following of racing lines, which has been evaluated on twelve replicated real-world racetracks with improved performance."
}