{
    "title": "Generative models for two-ground-truth partitions in networks. (arXiv:2302.02787v2 [cs.SI] UPDATED)",
    "abstract": "A myriad of approaches have been proposed to characterise the mesoscale structure of networks - most often as a partition based on patterns variously called communities, blocks, or clusters. Clearly, distinct methods designed to detect different types of patterns may provide a variety of answers to the network's mesoscale structure. Yet, even multiple runs of a given method can sometimes yield diverse and conflicting results, producing entire landscapes of partitions which potentially include multiple (locally optimal) mesoscale explanations of the network. Such ambiguity motivates a closer look at the ability of these methods to find multiple qualitatively different 'ground truth' partitions in a network. Here, we propose the stochastic cross-block model (SCBM), a generative model which allows for two distinct partitions to be built into the mesoscale structure of a single benchmark network. We demonstrate a use case of the benchmark model by appraising the power of stochastic block m",
    "link": "http://arxiv.org/abs/2302.02787",
    "context": "Title: Generative models for two-ground-truth partitions in networks. (arXiv:2302.02787v2 [cs.SI] UPDATED)\nAbstract: A myriad of approaches have been proposed to characterise the mesoscale structure of networks - most often as a partition based on patterns variously called communities, blocks, or clusters. Clearly, distinct methods designed to detect different types of patterns may provide a variety of answers to the network's mesoscale structure. Yet, even multiple runs of a given method can sometimes yield diverse and conflicting results, producing entire landscapes of partitions which potentially include multiple (locally optimal) mesoscale explanations of the network. Such ambiguity motivates a closer look at the ability of these methods to find multiple qualitatively different 'ground truth' partitions in a network. Here, we propose the stochastic cross-block model (SCBM), a generative model which allows for two distinct partitions to be built into the mesoscale structure of a single benchmark network. We demonstrate a use case of the benchmark model by appraising the power of stochastic block m",
    "path": "papers/23/02/2302.02787.json",
    "total_tokens": 680,
    "translated_title": "网络中的两种真实划分的生成模型",
    "translated_abstract": "提出了一种称为随机交叉块模型（SCBM）的生成模型，可以在单个基准网络的中尺度结构中同时构建两个不同的划分。通过评估随机块模型的性能，展示了基准模型的使用案例。",
    "tldr": "本研究提出了一种生成模型，称为随机交叉块模型（SCBM），可以在网络的中尺度结构中构建两个不同的划分。通过评估随机块模型的性能，展示了该模型的使用案例。",
    "en_tdlr": "This paper introduces a generative model called the stochastic cross-block model (SCBM), which can create two distinct partitions in the mesoscale structure of a network. A use case of the benchmark model is demonstrated by evaluating the performance of the stochastic block model."
}