{
    "title": "The Role of Semantic Parsing in Understanding Procedural Text. (arXiv:2302.06829v2 [cs.CL] UPDATED)",
    "abstract": "In this paper, we investigate whether symbolic semantic representations, extracted from deep semantic parsers, can help reasoning over the states of involved entities in a procedural text. We consider a deep semantic parser~(TRIPS) and semantic role labeling as two sources of semantic parsing knowledge. First, we propose PROPOLIS, a symbolic parsing-based procedural reasoning framework. Second, we integrate semantic parsing information into state-of-the-art neural models to conduct procedural reasoning. Our experiments indicate that explicitly incorporating such semantic knowledge improves procedural understanding. This paper presents new metrics for evaluating procedural reasoning tasks that clarify the challenges and identify differences among neural, symbolic, and integrated models.",
    "link": "http://arxiv.org/abs/2302.06829",
    "context": "Title: The Role of Semantic Parsing in Understanding Procedural Text. (arXiv:2302.06829v2 [cs.CL] UPDATED)\nAbstract: In this paper, we investigate whether symbolic semantic representations, extracted from deep semantic parsers, can help reasoning over the states of involved entities in a procedural text. We consider a deep semantic parser~(TRIPS) and semantic role labeling as two sources of semantic parsing knowledge. First, we propose PROPOLIS, a symbolic parsing-based procedural reasoning framework. Second, we integrate semantic parsing information into state-of-the-art neural models to conduct procedural reasoning. Our experiments indicate that explicitly incorporating such semantic knowledge improves procedural understanding. This paper presents new metrics for evaluating procedural reasoning tasks that clarify the challenges and identify differences among neural, symbolic, and integrated models.",
    "path": "papers/23/02/2302.06829.json",
    "total_tokens": 772,
    "translated_title": "语义解析在理解过程文本中的作用",
    "translated_abstract": "本文研究了从深度语义分析器中提取的符号语义表示是否有助于推理所涉及实体的状态。我们考虑TRIPS（一种深度语义分析器）和语义角色标记作为语义解析的两个来源。首先，我们提出了一个基于符号解析的过程推理框架PROPOLIS。其次，我们将语义解析信息集成到最先进的神经模型中进行过程推理。我们的实验表明，明确地融合这种语义知识可以提高过程理解能力。本文提出了用于评估过程推理任务的新指标，阐明了挑战并识别了神经、符号和集成模型之间的差异。",
    "tldr": "本文探究了通过语义解析获取的符号语义表示对于推理实体状态的作用，并提出了基于符号解析和语义解析信息的过程推理框架，实验结果表明融合语义知识可提高过程理解能力。",
    "en_tdlr": "This paper investigates the role of symbolic semantic representations extracted from deep semantic parsers in reasoning over entity states in procedural text. The authors propose a symbolic parsing-based framework and integrate semantic parsing information into neural models, demonstrating improved procedural understanding. New metrics for evaluating procedural reasoning tasks are presented, clarifying differences among neural, symbolic, and integrated models."
}