{
    "title": "See Your Heart: Psychological states Interpretation through Visual Creations. (arXiv:2302.10276v2 [cs.CV] UPDATED)",
    "abstract": "In psychoanalysis, generating interpretations to one's psychological state through visual creations is facing significant demands. The two main tasks of existing studies in the field of computer vision, sentiment/emotion classification and affective captioning, can hardly satisfy the requirement of psychological interpreting. To meet the demands for psychoanalysis, we introduce a challenging task, \\textbf{V}isual \\textbf{E}motion \\textbf{I}nterpretation \\textbf{T}ask (VEIT). VEIT requires AI to generate reasonable interpretations of creator's psychological state through visual creations. To support the task, we present a multimodal dataset termed SpyIn (\\textbf{S}and\\textbf{p}la\\textbf{y} \\textbf{In}terpretation Dataset), which is psychological theory supported and professional annotated. Dataset analysis illustrates that SpyIn is not only able to support VEIT, but also more challenging compared with other captioning datasets. Building on SpyIn, we conduct experiments of several image ",
    "link": "http://arxiv.org/abs/2302.10276",
    "context": "Title: See Your Heart: Psychological states Interpretation through Visual Creations. (arXiv:2302.10276v2 [cs.CV] UPDATED)\nAbstract: In psychoanalysis, generating interpretations to one's psychological state through visual creations is facing significant demands. The two main tasks of existing studies in the field of computer vision, sentiment/emotion classification and affective captioning, can hardly satisfy the requirement of psychological interpreting. To meet the demands for psychoanalysis, we introduce a challenging task, \\textbf{V}isual \\textbf{E}motion \\textbf{I}nterpretation \\textbf{T}ask (VEIT). VEIT requires AI to generate reasonable interpretations of creator's psychological state through visual creations. To support the task, we present a multimodal dataset termed SpyIn (\\textbf{S}and\\textbf{p}la\\textbf{y} \\textbf{In}terpretation Dataset), which is psychological theory supported and professional annotated. Dataset analysis illustrates that SpyIn is not only able to support VEIT, but also more challenging compared with other captioning datasets. Building on SpyIn, we conduct experiments of several image ",
    "path": "papers/23/02/2302.10276.json",
    "total_tokens": 979,
    "translated_title": "通过视觉创作解读心理状态：《看见你的内心》",
    "translated_abstract": "在精神分析领域中，通过视觉创作生成对个体心理状态的解释正面临着很大的需求。现有的计算机视觉研究主要包括情绪分类和影响标注两个任务，难以满足心理解释的需求。为了满足精神分析的需求，本文提出一项挑战性任务——视觉情感解读任务(VEIT)。VEIT要求人工智能通过视觉创作生成合理的创作者心理状态的解释。为支持该任务，我们提出了一个多模态数据集，称为Sandplay Interpretation Dataset (SpyIn)，该数据集得到了心理学理论的支持和专业的注释。数据集分析表明，SpyIn不仅能够支持VEIT，而且相对于其他字幕数据集更具挑战性。基于SpyIn，我们进行了几项图像生成任务的实验。",
    "tldr": "本文提出了一项挑战性任务——视觉情感解读任务(VEIT)，旨在通过AI对创作者的心理状态进行合理的解释。为此，本文提供了一个多模态数据集，该数据集得到了心理学理论的支持和专业的注释。据分析表明，该数据集不仅能够支持VEIT，而且相对于其他字幕数据集更具挑战性。"
}