{
    "title": "Knowledge Enhanced Semantic Communication Receiver. (arXiv:2302.07727v2 [cs.CL] UPDATED)",
    "abstract": "In recent years, with the rapid development of deep learning and natural language processing technologies, semantic communication has become a topic of great interest in the field of communication. Although existing deep learning-based semantic communication approaches have shown many advantages, they still do not make sufficient use of prior knowledge. Moreover, most existing semantic communication methods focus on the semantic encoding at the transmitter side, while we believe that the semantic decoding capability of the receiver should also be concerned. In this paper, we propose a knowledge enhanced semantic communication framework in which the receiver can more actively utilize the facts in the knowledge base for semantic reasoning and decoding, on the basis of only affecting the parameters rather than the structure of the neural networks at the transmitter side. Specifically, we design a transformer-based knowledge extractor to find relevant factual triples for the received noisy",
    "link": "http://arxiv.org/abs/2302.07727",
    "context": "Title: Knowledge Enhanced Semantic Communication Receiver. (arXiv:2302.07727v2 [cs.CL] UPDATED)\nAbstract: In recent years, with the rapid development of deep learning and natural language processing technologies, semantic communication has become a topic of great interest in the field of communication. Although existing deep learning-based semantic communication approaches have shown many advantages, they still do not make sufficient use of prior knowledge. Moreover, most existing semantic communication methods focus on the semantic encoding at the transmitter side, while we believe that the semantic decoding capability of the receiver should also be concerned. In this paper, we propose a knowledge enhanced semantic communication framework in which the receiver can more actively utilize the facts in the knowledge base for semantic reasoning and decoding, on the basis of only affecting the parameters rather than the structure of the neural networks at the transmitter side. Specifically, we design a transformer-based knowledge extractor to find relevant factual triples for the received noisy",
    "path": "papers/23/02/2302.07727.json",
    "total_tokens": 966,
    "translated_title": "知识增强的语义通信接收器",
    "translated_abstract": "近年来，随着深度学习和自然语言处理技术的快速发展，语义通信已成为通信领域的热门话题。尽管现有的基于深度学习的语义通信方法已经显示出许多优势，但它们仍然没有充分利用先前的知识。此外，大多数现有的语义通信方法侧重于发射端的语义编码，而我们认为，接收方的语义解码能力也应该受到关注。在本文中，我们提出了一个知识增强的语义通信框架，其中接收器可以更积极地利用知识库中的事实进行语义推理和解码，而不影响发射端的神经网络结构，仅影响其参数。具体来说，我们设计了基于transformer的知识提取器，以查找接收到的嘈杂数据中的相关事实三元组，并提出了基于图卷积网络（GCN）的语义解码器以更好地理解单词之间的语义关系。我们在两个常用数据集上评估了我们提出的框架，并实现了最先进的性能。",
    "tldr": "提出了一个知识增强的语义通信框架，其中接收器可以更积极地利用知识库中的事实进行语义推理和解码，并通过知识提取器和基于GCN的语义解码器实现了更好的性能，不影响发射端的神经网络结构。",
    "en_tdlr": "A knowledge enhanced semantic communication framework is proposed in which the receiver can actively utilize prior knowledge for semantic reasoning and decoding, achieving better performance through a transformer-based knowledge extractor and a GCN-based semantic decoder without affecting the neural network structure at the transmitter side."
}