{
    "title": "Metropolitan Segment Traffic Speeds from Massive Floating Car Data in 10 Cities. (arXiv:2302.08761v2 [cs.LG] UPDATED)",
    "abstract": "Traffic analysis is crucial for urban operations and planning, while the availability of dense urban traffic data beyond loop detectors is still scarce. We present a large-scale floating vehicle dataset of per-street segment traffic information, Metropolitan Segment Traffic Speeds from Massive Floating Car Data in 10 Cities (MeTS-10), available for 10 global cities with a 15-minute resolution for collection periods ranging between 108 and 361 days in 2019-2021 and covering more than 1500 square kilometers per metropolitan area. MeTS-10 features traffic speed information at all street levels from main arterials to local streets for Antwerp, Bangkok, Barcelona, Berlin, Chicago, Istanbul, London, Madrid, Melbourne and Moscow. The dataset leverages the industrial-scale floating vehicle Traffic4cast data with speeds and vehicle counts provided in a privacy-preserving spatio-temporal aggregation. We detail the efficient matching approach mapping the data to the OpenStreetMap road graph. We e",
    "link": "http://arxiv.org/abs/2302.08761",
    "context": "Title: Metropolitan Segment Traffic Speeds from Massive Floating Car Data in 10 Cities. (arXiv:2302.08761v2 [cs.LG] UPDATED)\nAbstract: Traffic analysis is crucial for urban operations and planning, while the availability of dense urban traffic data beyond loop detectors is still scarce. We present a large-scale floating vehicle dataset of per-street segment traffic information, Metropolitan Segment Traffic Speeds from Massive Floating Car Data in 10 Cities (MeTS-10), available for 10 global cities with a 15-minute resolution for collection periods ranging between 108 and 361 days in 2019-2021 and covering more than 1500 square kilometers per metropolitan area. MeTS-10 features traffic speed information at all street levels from main arterials to local streets for Antwerp, Bangkok, Barcelona, Berlin, Chicago, Istanbul, London, Madrid, Melbourne and Moscow. The dataset leverages the industrial-scale floating vehicle Traffic4cast data with speeds and vehicle counts provided in a privacy-preserving spatio-temporal aggregation. We detail the efficient matching approach mapping the data to the OpenStreetMap road graph. We e",
    "path": "papers/23/02/2302.08761.json",
    "total_tokens": 851,
    "translated_title": "基于大规模浮动车数据的10个城市都市路段交通速度数据",
    "translated_abstract": "交通分析对城市运营和规划至关重要，但超出环路检测器范围的城市交通密集数据仍然很少。我们提供了一个大规模浮动车辆数据集，即“10个城市的都市路段交通速度数据集”，可用于全球10个城市，并具有每个都市区域1500多平方公里的15分钟分辨率的收集周期，收集时间为2019-2021年，覆盖从主干道到当地街道的所有街道级别的交通信息。该数据集利用工业规模的浮动车辆Traffic4cast数据，通过隐私保护的时空聚合提供了速度和车辆计数。我们详细介绍了高效的匹配方法，将数据映射到OpenStreetMap路网图中。",
    "tldr": "本研究基于10个城市的大规模浮动车数据，提供了15分钟分辨率的交通速度信息，涵盖了从主干道到当地街道的所有街道级别，为城市交通运营和规划提供了重要数据。",
    "en_tdlr": "This study provides traffic speed information with 15-minute resolution based on massive floating car data from 10 cities, covering all street levels from main arterials to local streets, which provides important data for urban traffic operations and planning."
}