{
    "title": "Lorentz Equivariant Model for Knowledge-Enhanced Hyperbolic Collaborative Filtering. (arXiv:2302.04545v2 [cs.IR] UPDATED)",
    "abstract": "Introducing prior auxiliary information from the knowledge graph (KG) to assist the user-item graph can improve the comprehensive performance of the recommender system. Many recent studies show that the ensemble properties of hyperbolic spaces fit the scale-free and hierarchical characteristics exhibited in the above two types of graphs well. However, existing hyperbolic methods ignore the consideration of equivariance, thus they cannot generalize symmetric features under given transformations, which seriously limits the capability of the model. Moreover, they cannot balance preserving the heterogeneity and mining the high-order entity information to users across two graphs. To fill these gaps, we propose a rigorously Lorentz group equivariant knowledge-enhanced collaborative filtering model (LECF). Innovatively, we jointly update the attribute embeddings (containing the high-order entity signals from the KG) and hyperbolic embeddings (the distance between hyperbolic embeddings reveals",
    "link": "http://arxiv.org/abs/2302.04545",
    "context": "Title: Lorentz Equivariant Model for Knowledge-Enhanced Hyperbolic Collaborative Filtering. (arXiv:2302.04545v2 [cs.IR] UPDATED)\nAbstract: Introducing prior auxiliary information from the knowledge graph (KG) to assist the user-item graph can improve the comprehensive performance of the recommender system. Many recent studies show that the ensemble properties of hyperbolic spaces fit the scale-free and hierarchical characteristics exhibited in the above two types of graphs well. However, existing hyperbolic methods ignore the consideration of equivariance, thus they cannot generalize symmetric features under given transformations, which seriously limits the capability of the model. Moreover, they cannot balance preserving the heterogeneity and mining the high-order entity information to users across two graphs. To fill these gaps, we propose a rigorously Lorentz group equivariant knowledge-enhanced collaborative filtering model (LECF). Innovatively, we jointly update the attribute embeddings (containing the high-order entity signals from the KG) and hyperbolic embeddings (the distance between hyperbolic embeddings reveals",
    "path": "papers/23/02/2302.04545.json",
    "total_tokens": 932,
    "tldr": "该论文提出了一个知识增强的协同过滤模型，在两种不同的图表中平衡了异构性和高阶实体信息。它通过将属性嵌入和双曲嵌入结合起来实现了等变性，提高了模型的能力。"
}