{
    "title": "Dual Self-Awareness Value Decomposition Framework without Individual Global Max for Cooperative Multi-Agent Reinforcement Learning. (arXiv:2302.02180v2 [cs.MA] UPDATED)",
    "abstract": "Value decomposition methods have gained popularity in the field of cooperative multi-agent reinforcement learning. However, almost all existing methods follow the principle of Individual Global Max (IGM) or its variants, which limits their problem-solving capabilities. To address this, we propose a dual self-awareness value decomposition framework, inspired by the notion of dual self-awareness in psychology, that entirely rejects the IGM premise. Each agent consists of an ego policy for action selection and an alter ego value function to solve the credit assignment problem. The value function factorization can ignore the IGM assumption by utilizing an explicit search procedure. On the basis of the above, we also suggest a novel anti-ego exploration mechanism to avoid the algorithm becoming stuck in a local optimum. As the first fully IGM-free value decomposition method, our proposed framework achieves desirable performance in various cooperative tasks.",
    "link": "http://arxiv.org/abs/2302.02180",
    "context": "Title: Dual Self-Awareness Value Decomposition Framework without Individual Global Max for Cooperative Multi-Agent Reinforcement Learning. (arXiv:2302.02180v2 [cs.MA] UPDATED)\nAbstract: Value decomposition methods have gained popularity in the field of cooperative multi-agent reinforcement learning. However, almost all existing methods follow the principle of Individual Global Max (IGM) or its variants, which limits their problem-solving capabilities. To address this, we propose a dual self-awareness value decomposition framework, inspired by the notion of dual self-awareness in psychology, that entirely rejects the IGM premise. Each agent consists of an ego policy for action selection and an alter ego value function to solve the credit assignment problem. The value function factorization can ignore the IGM assumption by utilizing an explicit search procedure. On the basis of the above, we also suggest a novel anti-ego exploration mechanism to avoid the algorithm becoming stuck in a local optimum. As the first fully IGM-free value decomposition method, our proposed framework achieves desirable performance in various cooperative tasks.",
    "path": "papers/23/02/2302.02180.json",
    "total_tokens": 875,
    "translated_title": "基于双重自我意识价值分解框架的协作多智体强化学习",
    "translated_abstract": "在协作多智体强化学习领域，价值分解方法已经变得越来越流行。然而，几乎所有现有方法都遵循个体全局最大值（IGM）或其变体的原则，这限制了它们的问题解决能力。为了解决这个问题，我们提出了一个基于心理学中双重自我意识概念的双重自我意识价值分解框架，完全摒弃了IGM前提。每个智能体包括自我策略以进行动作选择和替身价值函数以解决信用分配问题。价值函数分解可以利用显式搜索过程忽略IGM假设。在此基础上，我们还提出了一种新颖的反自我探索机制，以避免算法陷入局部最优。作为第一个完全不用IGM的价值分解方法，我们提出的框架在各种协作任务中实现了期望的性能。",
    "tldr": "提出了一种基于双重自我意识价值分解框架的协作多智体强化学习方法，完全摒弃了个体全局最大值的前提，具有良好的性能表现。",
    "en_tdlr": "A cooperative multi-agent reinforcement learning method based on the dual self-awareness value decomposition framework, which entirely rejects the Individual Global Max premise and shows desirable performance in various scenarios."
}