{
    "title": "Im2Hands: Learning Attentive Implicit Representation of Interacting Two-Hand Shapes. (arXiv:2302.14348v3 [cs.CV] UPDATED)",
    "abstract": "We present Implicit Two Hands (Im2Hands), the first neural implicit representation of two interacting hands. Unlike existing methods on two-hand reconstruction that rely on a parametric hand model and/or low-resolution meshes, Im2Hands can produce fine-grained geometry of two hands with high hand-to-hand and hand-to-image coherency. To handle the shape complexity and interaction context between two hands, Im2Hands models the occupancy volume of two hands - conditioned on an RGB image and coarse 3D keypoints - by two novel attention-based modules responsible for (1) initial occupancy estimation and (2) context-aware occupancy refinement, respectively. Im2Hands first learns per-hand neural articulated occupancy in the canonical space designed for each hand using query-image attention. It then refines the initial two-hand occupancy in the posed space to enhance the coherency between the two hand shapes using query-anchor attention. In addition, we introduce an optional keypoint refinement",
    "link": "http://arxiv.org/abs/2302.14348",
    "context": "Title: Im2Hands: Learning Attentive Implicit Representation of Interacting Two-Hand Shapes. (arXiv:2302.14348v3 [cs.CV] UPDATED)\nAbstract: We present Implicit Two Hands (Im2Hands), the first neural implicit representation of two interacting hands. Unlike existing methods on two-hand reconstruction that rely on a parametric hand model and/or low-resolution meshes, Im2Hands can produce fine-grained geometry of two hands with high hand-to-hand and hand-to-image coherency. To handle the shape complexity and interaction context between two hands, Im2Hands models the occupancy volume of two hands - conditioned on an RGB image and coarse 3D keypoints - by two novel attention-based modules responsible for (1) initial occupancy estimation and (2) context-aware occupancy refinement, respectively. Im2Hands first learns per-hand neural articulated occupancy in the canonical space designed for each hand using query-image attention. It then refines the initial two-hand occupancy in the posed space to enhance the coherency between the two hand shapes using query-anchor attention. In addition, we introduce an optional keypoint refinement",
    "path": "papers/23/02/2302.14348.json",
    "total_tokens": 885,
    "translated_title": "Im2Hands: 学习交互双手形状的关注隐式表示",
    "translated_abstract": "我们提出了Implicit Two Hands (Im2Hands)，这是第一个用于表示两只交互手的神经隐式表示。 Im2Hands不同于现有的两只手重建方法，它们依赖于参数手模型和/或低分辨率网格，Im2Hands可以产生高手到手和手到图像一致性的两只手的细粒度几何形态。为了处理两只手的形态复杂性和交互上下文，Im2Hands通过两个新颖的基于注意力机制的模块来建模两只手的占用体积 - 一个负责初始占用估计，一个负责上下文感知的占用精化。Im2Hands首先使用查询-图像注意力在为每个手设计的规范空间中学习每只手的神经关节占用，然后使用查询-锚点注意力在姿势空间中优化两只手的初始占用以增强两只手形状之间的一致性。此外，我们引入一个可选的关键点精化步骤。",
    "tldr": "本文提出了Im2Hands，一个用于表示交互双手的神经隐式表示方法，可以产生高手到手和手到图像一致性的细粒度几何形态。",
    "en_tdlr": "This paper presents Im2Hands, the first neural implicit representation of two interacting hands that can produce fine-grained geometry of two hands with high hand-to-hand and hand-to-image coherency."
}