{
    "title": "RLTP: Reinforcement Learning to Pace for Delayed Impression Modeling in Preloaded Ads. (arXiv:2302.02592v2 [cs.IR] UPDATED)",
    "abstract": "To increase brand awareness, many advertisers conclude contracts with advertising platforms to purchase traffic and then deliver advertisements to target audiences. In a whole delivery period, advertisers usually desire a certain impression count for the ads, and they also expect that the delivery performance is as good as possible (e.g., obtaining high click-through rate). Advertising platforms employ pacing algorithms to satisfy the demands via adjusting the selection probabilities to traffic requests in real-time. However, the delivery procedure is also affected by the strategies from publishers, which cannot be controlled by advertising platforms. Preloading is a widely used strategy for many types of ads (e.g., video ads) to make sure that the response time for displaying after a traffic request is legitimate, which results in delayed impression phenomenon. Traditional pacing algorithms cannot handle the preloading nature well because they rely on immediate feedback signals, and m",
    "link": "http://arxiv.org/abs/2302.02592",
    "context": "Title: RLTP: Reinforcement Learning to Pace for Delayed Impression Modeling in Preloaded Ads. (arXiv:2302.02592v2 [cs.IR] UPDATED)\nAbstract: To increase brand awareness, many advertisers conclude contracts with advertising platforms to purchase traffic and then deliver advertisements to target audiences. In a whole delivery period, advertisers usually desire a certain impression count for the ads, and they also expect that the delivery performance is as good as possible (e.g., obtaining high click-through rate). Advertising platforms employ pacing algorithms to satisfy the demands via adjusting the selection probabilities to traffic requests in real-time. However, the delivery procedure is also affected by the strategies from publishers, which cannot be controlled by advertising platforms. Preloading is a widely used strategy for many types of ads (e.g., video ads) to make sure that the response time for displaying after a traffic request is legitimate, which results in delayed impression phenomenon. Traditional pacing algorithms cannot handle the preloading nature well because they rely on immediate feedback signals, and m",
    "path": "papers/23/02/2302.02592.json",
    "total_tokens": 799,
    "translated_title": "RLTP算法：用于预加载广告中的延迟印象建模的强化学习算法",
    "translated_abstract": "为了增加品牌知名度，许多广告商与广告平台签订合同购买广告流量，然后将广告投放到目标受众中。在整个广告投放期间，广告商通常希望广告获得特定的印象数，并期望广告展示的效果越好越好（如高点击率）。广告平台通过实时调整流量请求的选择概率来满足需求。然而，发布者的策略也会影响广告投放过程，这是广告平台无法控制的。预加载是许多类型广告（如视频广告）的常用策略，以确保在流量请求后显示的响应时间是合理的，这将导致延迟印象现象。传统的配速算法无法很好地处理预加载的特性，因为它们依赖于即时反馈信号。",
    "tldr": "RLTP算法是一个强化学习算法，用于解决广告预加载过程中的延迟印象现象。",
    "en_tdlr": "RLTP is a reinforcement learning algorithm designed to solve the delayed impression phenomenon in preloaded ads through adjusting selection probabilities to traffic requests in real-time."
}