{
    "title": "User-Centered Design (IX): A \"User Experience 3.0\" Paradigm Framework in the Intelligence Era. (arXiv:2302.06681v5 [cs.HC] UPDATED)",
    "abstract": "The field of user experience (UX) based on the design philosophy of \"user-centered design\" is moving towards the intelligence era. Still, the existing UX paradigm mainly aims at non-intelligent systems and lacks a systematic approach to UX for intelligent systems. Throughout the development of UX, the UX paradigm shows the evolution characteristics of the cross-technology era. At present, the intelligence era has put forward new demands on the UX paradigm. For this reason, this paper proposes a \"UX 3.0\" paradigm framework and the corresponding UX methodology system in the intelligence era. The \"UX 3.0\" paradigm framework includes five categories of UX methods: ecological experience, innovation-enabled experience, AI-enabled experience, human-AI interaction-based experience, and human-AI collaboration-based experience methods, each providing corresponding multiple UX paradigmatic orientations. The proposal of the \"UX 3.0\" paradigm helps improve the existing UX methods and provides metho",
    "link": "http://arxiv.org/abs/2302.06681",
    "context": "Title: User-Centered Design (IX): A \"User Experience 3.0\" Paradigm Framework in the Intelligence Era. (arXiv:2302.06681v5 [cs.HC] UPDATED)\nAbstract: The field of user experience (UX) based on the design philosophy of \"user-centered design\" is moving towards the intelligence era. Still, the existing UX paradigm mainly aims at non-intelligent systems and lacks a systematic approach to UX for intelligent systems. Throughout the development of UX, the UX paradigm shows the evolution characteristics of the cross-technology era. At present, the intelligence era has put forward new demands on the UX paradigm. For this reason, this paper proposes a \"UX 3.0\" paradigm framework and the corresponding UX methodology system in the intelligence era. The \"UX 3.0\" paradigm framework includes five categories of UX methods: ecological experience, innovation-enabled experience, AI-enabled experience, human-AI interaction-based experience, and human-AI collaboration-based experience methods, each providing corresponding multiple UX paradigmatic orientations. The proposal of the \"UX 3.0\" paradigm helps improve the existing UX methods and provides metho",
    "path": "papers/23/02/2302.06681.json",
    "total_tokens": 849,
    "translated_title": "用户中心设计 (IX): 情报时代下的“用户体验3.0”范式框架",
    "translated_abstract": "基于“用户中心设计”理念的用户体验（UX）领域正在向情报时代迈进。然而，现有的UX范式主要针对非智能系统，并缺乏针对智能系统的系统化方法。在UX的发展过程中，UX范式呈现出跨技术时代的演进特征。目前，情报时代对UX范式提出了新的要求。因此，本文提出了一种“UX 3.0”范式框架和相应的UX方法系统。 “UX 3.0”范式框架包括五类UX方法：生态体验，创新体验，AI体验，基于人工智能交互的体验，以及基于人工智能协作的体验方法，每个方法都提供相应的多重UX范式取向。提出“UX 3.0”范式的建议有助于改进现有的UX方法，并提供方法。",
    "tldr": "本文提出了一种“UX 3.0”范式框架和相应的UX方法系统，旨在满足情报时代对用户体验的新要求。",
    "en_tdlr": "This paper proposes a \"UX 3.0\" paradigm framework and corresponding UX methodology system to meet the new demands of user experience in the intelligence era."
}