{
    "title": "Spacerini: Plug-and-play Search Engines with Pyserini and Hugging Face",
    "abstract": "arXiv:2302.14534v2 Announce Type: replace-cross  Abstract: We present Spacerini, a tool that integrates the Pyserini toolkit for reproducible information retrieval research with Hugging Face to enable the seamless construction and deployment of interactive search engines. Spacerini makes state-of-the-art sparse and dense retrieval models more accessible to non-IR practitioners while minimizing deployment effort. This is useful for NLP researchers who want to better understand and validate their research by performing qualitative analyses of training corpora, for IR researchers who want to demonstrate new retrieval models integrated into the growing Pyserini ecosystem, and for third parties reproducing the work of other researchers. Spacerini is open source and includes utilities for loading, preprocessing, indexing, and deploying search engines locally and remotely. We demonstrate a portfolio of 13 search engines created with Spacerini for different use cases.",
    "link": "https://arxiv.org/abs/2302.14534",
    "context": "Title: Spacerini: Plug-and-play Search Engines with Pyserini and Hugging Face\nAbstract: arXiv:2302.14534v2 Announce Type: replace-cross  Abstract: We present Spacerini, a tool that integrates the Pyserini toolkit for reproducible information retrieval research with Hugging Face to enable the seamless construction and deployment of interactive search engines. Spacerini makes state-of-the-art sparse and dense retrieval models more accessible to non-IR practitioners while minimizing deployment effort. This is useful for NLP researchers who want to better understand and validate their research by performing qualitative analyses of training corpora, for IR researchers who want to demonstrate new retrieval models integrated into the growing Pyserini ecosystem, and for third parties reproducing the work of other researchers. Spacerini is open source and includes utilities for loading, preprocessing, indexing, and deploying search engines locally and remotely. We demonstrate a portfolio of 13 search engines created with Spacerini for different use cases.",
    "path": "papers/23/02/2302.14534.json",
    "total_tokens": 871,
    "translated_title": "Spacerini：使用Pyserini和Hugging Face实现即插即用的搜索引擎",
    "translated_abstract": "我们提出了Spacerini，这是一个集成了Pyserini工具包和Hugging Face的工具，可以无缝构建和部署交互式搜索引擎的工具。通过Spacerini，非IR从业者可以更轻松地使用最先进的稀疏和稠密检索模型，并最小化部署工作量。Spacerini对于希望通过对训练语料库进行定性分析来更好地理解和验证研究的NLP研究人员、希望在不断发展的Pyserini生态系统中展示新检索模型的IR研究人员以及复制其他研究人员工作的第三方来说都非常有用。Spacerini是开源的，并包括用于本地和远程加载、预处理、索引和部署搜索引擎的实用程序。我们展示了使用Spacerini创建的13个不同用例的搜索引擎组合。",
    "tldr": "Spacerini是一个集成了Pyserini和Hugging Face的工具，可以无缝构建和部署交互式搜索引擎，使得非IR从业者可以更轻松地使用最先进的检索模型，对NLP和IR研究人员以及第三方复制研究工作都非常有用。",
    "en_tdlr": "Spacerini is a tool that integrates Pyserini and Hugging Face to enable the seamless construction and deployment of interactive search engines, making it easier for non-IR practitioners to use state-of-the-art retrieval models, which is useful for NLP and IR researchers as well as third parties replicating research work."
}