{
    "title": "A Unifying Perspective on Multi-Calibration: Game Dynamics for Multi-Objective Learning. (arXiv:2302.10863v2 [cs.LG] UPDATED)",
    "abstract": "We provide a unifying framework for the design and analysis of multicalibrated predictors. By placing the multicalibration problem in the general setting of multi-objective learning -- where learning guarantees must hold simultaneously over a set of distributions and loss functions -- we exploit connections to game dynamics to achieve state-of-the-art guarantees for a diverse set of multicalibration learning problems. In addition to shedding light on existing multicalibration guarantees and greatly simplifying their analysis, our approach also yields improved guarantees, such as obtaining stronger multicalibration conditions that scale with the square-root of group size and improving the complexity of $k$-class multicalibration by an exponential factor of $k$. Beyond multicalibration, we use these game dynamics to address emerging considerations in the study of group fairness and multi-distribution learning.",
    "link": "http://arxiv.org/abs/2302.10863",
    "context": "Title: A Unifying Perspective on Multi-Calibration: Game Dynamics for Multi-Objective Learning. (arXiv:2302.10863v2 [cs.LG] UPDATED)\nAbstract: We provide a unifying framework for the design and analysis of multicalibrated predictors. By placing the multicalibration problem in the general setting of multi-objective learning -- where learning guarantees must hold simultaneously over a set of distributions and loss functions -- we exploit connections to game dynamics to achieve state-of-the-art guarantees for a diverse set of multicalibration learning problems. In addition to shedding light on existing multicalibration guarantees and greatly simplifying their analysis, our approach also yields improved guarantees, such as obtaining stronger multicalibration conditions that scale with the square-root of group size and improving the complexity of $k$-class multicalibration by an exponential factor of $k$. Beyond multicalibration, we use these game dynamics to address emerging considerations in the study of group fairness and multi-distribution learning.",
    "path": "papers/23/02/2302.10863.json",
    "total_tokens": 841,
    "translated_title": "多校准的统一视角: 多目标学习的游戏动力学",
    "translated_abstract": "我们提供了一个统一的框架，用于设计和分析多校准的预测器。将多校准问题放置在多目标学习的一般背景下，我们利用与游戏动力学的联系，在多样的多校准学习问题中实现了最先进的保证。除了阐明现有多校准保证并极大简化它们的分析，我们的方法还产生了改进的保证，例如获得随着群体规模的平方根缩放的强多校准条件，并将$ k $-类多校准的复杂性提高了$ k $的指数因子。除了多校准，我们还利用这些游戏动力学来解决在群体公平和多分布学习研究中出现的考虑问题。",
    "tldr": "本论文提出了一个统一的框架，通过将多校准问题放置在多目标学习的背景下，并利用游戏动力学的连接，实现了一系列多校准学习问题的最新保证，同时也改进了现有保证并简化了分析。"
}