{
    "title": "An Optical XNOR-Bitcount Based Accelerator for Efficient Inference of Binary Neural Networks. (arXiv:2302.06405v2 [cs.AR] UPDATED)",
    "abstract": "Binary Neural Networks (BNNs) are increasingly preferred over full-precision Convolutional Neural Networks(CNNs) to reduce the memory and computational requirements of inference processing with minimal accuracy drop. BNNs convert CNN model parameters to 1-bit precision, allowing inference of BNNs to be processed with simple XNOR and bitcount operations. This makes BNNs amenable to hardware acceleration. Several photonic integrated circuits (PICs) based BNN accelerators have been proposed. Although these accelerators provide remarkably higher throughput and energy efficiency than their electronic counterparts, the utilized XNOR and bitcount circuits in these accelerators need to be further enhanced to improve their area, energy efficiency, and throughput. This paper aims to fulfill this need. For that, we invent a single-MRR-based optical XNOR gate (OXG). Moreover, we present a novel design of bitcount circuit which we refer to as Photo-Charge Accumulator (PCA). We employ multiple OXGs ",
    "link": "http://arxiv.org/abs/2302.06405",
    "context": "Title: An Optical XNOR-Bitcount Based Accelerator for Efficient Inference of Binary Neural Networks. (arXiv:2302.06405v2 [cs.AR] UPDATED)\nAbstract: Binary Neural Networks (BNNs) are increasingly preferred over full-precision Convolutional Neural Networks(CNNs) to reduce the memory and computational requirements of inference processing with minimal accuracy drop. BNNs convert CNN model parameters to 1-bit precision, allowing inference of BNNs to be processed with simple XNOR and bitcount operations. This makes BNNs amenable to hardware acceleration. Several photonic integrated circuits (PICs) based BNN accelerators have been proposed. Although these accelerators provide remarkably higher throughput and energy efficiency than their electronic counterparts, the utilized XNOR and bitcount circuits in these accelerators need to be further enhanced to improve their area, energy efficiency, and throughput. This paper aims to fulfill this need. For that, we invent a single-MRR-based optical XNOR gate (OXG). Moreover, we present a novel design of bitcount circuit which we refer to as Photo-Charge Accumulator (PCA). We employ multiple OXGs ",
    "path": "papers/23/02/2302.06405.json",
    "total_tokens": 1015,
    "translated_title": "基于光学的XNOR位计数加速器用于二值神经网络的高效推断",
    "translated_abstract": "二值神经网络（BNN）越来越受欢迎，因为它们可将卷积神经网络（CNN）模型参数转换为1位精度，从而最小化推断时的存储和计算需求，并且几乎没有精度损失。并且它们使得基于XNOR和位计数的操作能够进行硬件加速。虽然已经提出了几种基于光电集成电路（PIC）的BNN加速器，它们提供的吞吐量和能效比其电子对应物更高，但这些加速器中使用的XNOR和位计数电路还需要进一步增强以提高它们的面积、能效和吞吐量。本文旨在满足这一需求，我们发明了一种基于单-MRR的光学XNOR门（OXG）。此外，我们提出了一种新的位计数电路设计，称为光电荷累加器（PCA）。我们使用多个OXGs来实现PCA。我们提出的加速器设计在面积、能效和吞吐量方面实现了显着的改进，比最先进的基于PIC的BNN加速器更加优越。",
    "tldr": "本论文提出了一种基于光学XNOR门和光电荷累加器的BNN加速器设计，相比现有的PICs加速器，该设计在面积、能效和吞吐量等方面获得了显着的改进。",
    "en_tdlr": "This paper proposes an optical XNOR gate and photo-charge accumulator based accelerator design for binary neural networks, which achieves significant improvements in terms of area, energy efficiency, and throughput compared to state-of-the-art photonic integrated circuit accelerators."
}