{
    "title": "SanskritShala: A Neural Sanskrit NLP Toolkit with Web-Based Interface for Pedagogical and Annotation Purposes. (arXiv:2302.09527v2 [cs.CL] UPDATED)",
    "abstract": "We present a neural Sanskrit Natural Language Processing (NLP) toolkit named SanskritShala (a school of Sanskrit) to facilitate computational linguistic analyses for several tasks such as word segmentation, morphological tagging, dependency parsing, and compound type identification. Our systems currently report state-of-the-art performance on available benchmark datasets for all tasks. SanskritShala is deployed as a web-based application, which allows a user to get real-time analysis for the given input. It is built with easy-to-use interactive data annotation features that allow annotators to correct the system predictions when it makes mistakes. We publicly release the source codes of the 4 modules included in the toolkit, 7 word embedding models that have been trained on publicly available Sanskrit corpora and multiple annotated datasets such as word similarity, relatedness, categorization, analogy prediction to assess intrinsic properties of word embeddings. So far as we know, this",
    "link": "http://arxiv.org/abs/2302.09527",
    "context": "Title: SanskritShala: A Neural Sanskrit NLP Toolkit with Web-Based Interface for Pedagogical and Annotation Purposes. (arXiv:2302.09527v2 [cs.CL] UPDATED)\nAbstract: We present a neural Sanskrit Natural Language Processing (NLP) toolkit named SanskritShala (a school of Sanskrit) to facilitate computational linguistic analyses for several tasks such as word segmentation, morphological tagging, dependency parsing, and compound type identification. Our systems currently report state-of-the-art performance on available benchmark datasets for all tasks. SanskritShala is deployed as a web-based application, which allows a user to get real-time analysis for the given input. It is built with easy-to-use interactive data annotation features that allow annotators to correct the system predictions when it makes mistakes. We publicly release the source codes of the 4 modules included in the toolkit, 7 word embedding models that have been trained on publicly available Sanskrit corpora and multiple annotated datasets such as word similarity, relatedness, categorization, analogy prediction to assess intrinsic properties of word embeddings. So far as we know, this",
    "path": "papers/23/02/2302.09527.json",
    "total_tokens": 1049,
    "translated_title": "SanskritShala：基于神经网络的梵文自然语言处理（NLP）工具包，带有基于Web的界面，用于教学和注释目的",
    "translated_abstract": "我们提出了一个名为SanskritShala的神经网络梵文自然语言处理（NLP）工具包，旨在为词语分割、形态标记、依赖解析和复合类型识别等多项任务提供计算语言学分析。我们的系统目前在所有任务可用的基准数据集上报告了最先进的结果。SanskritShala是一个基于Web的应用程序，允许用户为给定的输入获取实时分析。它具有易于使用的交互式数据注释功能，允许注释者在系统错误时纠正系统预测。我们公开发布了包含工具包中的4个模块、7个已经在公开可用的梵文语料库上训练的词嵌入模型以及多个经过注释的数据集（如单词相似性、相关性、类别化、比喻预测），以评估词嵌入的内在属性。据我们所知，这是第一个包含基于Web界面和交互式数据注释功能的神经梵文NLP工具包，为词语分割、形态标记、依赖解析和复合类型识别等多项任务实现了最新的性能。",
    "tldr": "SanskritShala是第一个使用基于Web界面和互动数据注释功能的神经梵文自然语言处理（NLP）工具包，为词语分割、形态标记、依赖解析和复合型识别等任务提供最先进的性能。",
    "en_tdlr": "SanskritShala is the first neural Sanskrit NLP toolkit with a web-based interface and interactive data annotation features, achieving state-of-the-art performance for various tasks including word segmentation, morphological tagging, dependency parsing, and compound type identification. It also includes 7 word embedding models and multiple annotated datasets for intrinsic properties evaluation."
}