{
    "title": "Recurrent Graph Convolutional Networks for Spatiotemporal Prediction of Snow Accumulation Using Airborne Radar. (arXiv:2302.00817v2 [cs.LG] UPDATED)",
    "abstract": "The accurate prediction and estimation of annual snow accumulation has grown in importance as we deal with the effects of climate change and the increase of global atmospheric temperatures. Airborne radar sensors, such as the Snow Radar, are able to measure accumulation rate patterns at a large-scale and monitor the effects of ongoing climate change on Greenland's precipitation and run-off. The Snow Radar's use of an ultra-wide bandwidth enables a fine vertical resolution that helps in capturing internal ice layers. Given the amount of snow accumulation in previous years using the radar data, in this paper, we propose a machine learning model based on recurrent graph convolutional networks to predict the snow accumulation in recent consecutive years at a certain location. We found that the model performs better and with more consistency than equivalent nongeometric and nontemporal models.",
    "link": "http://arxiv.org/abs/2302.00817",
    "context": "Title: Recurrent Graph Convolutional Networks for Spatiotemporal Prediction of Snow Accumulation Using Airborne Radar. (arXiv:2302.00817v2 [cs.LG] UPDATED)\nAbstract: The accurate prediction and estimation of annual snow accumulation has grown in importance as we deal with the effects of climate change and the increase of global atmospheric temperatures. Airborne radar sensors, such as the Snow Radar, are able to measure accumulation rate patterns at a large-scale and monitor the effects of ongoing climate change on Greenland's precipitation and run-off. The Snow Radar's use of an ultra-wide bandwidth enables a fine vertical resolution that helps in capturing internal ice layers. Given the amount of snow accumulation in previous years using the radar data, in this paper, we propose a machine learning model based on recurrent graph convolutional networks to predict the snow accumulation in recent consecutive years at a certain location. We found that the model performs better and with more consistency than equivalent nongeometric and nontemporal models.",
    "path": "papers/23/02/2302.00817.json",
    "total_tokens": 852,
    "translated_title": "基于循环图卷积网络的机载雷达时空降雪预测",
    "translated_abstract": "随着气候变化和全球大气温度的上升，准确预测和估计年度积雪积累变得越来越重要。机载雷达传感器，如雪地雷达，能够测量大尺度上的积雪积累速率分布图，监测气候变化对格陵兰降水和径流的影响。该雷达传感器使用超宽带增强了垂直分辨率，有助于捕捉内部内部冰层。本文提出一种基于循环图卷积网络的机器学习模型，针对此雷达数据中先前年份的积雪积累量，预测近年来某个位置的积雪积累量。实验结果表明，相较于等效的非几何和非时态模型，该模型表现更好且更具一致性。",
    "tldr": "本文基于循环图卷积网络，利用机载雷达数据预测特定位置最近连续年份的积雪积累，并且相较于其他模型表现更好且更具一致性。",
    "en_tdlr": "This paper proposes a machine learning model based on recurrent graph convolutional networks to predict the snow accumulation in recent consecutive years at a certain location using airborne radar data, which outperforms equivalent nongeometric and nontemporal models."
}