{
    "title": "Construction of Knowledge Graphs: State and Challenges. (arXiv:2302.11509v2 [cs.AI] UPDATED)",
    "abstract": "With knowledge graphs (KGs) at the center of numerous applications such as recommender systems and question answering, the need for generalized pipelines to construct and continuously update such KGs is increasing. While the individual steps that are necessary to create KGs from unstructured (e.g. text) and structured data sources (e.g. databases) are mostly well-researched for their one-shot execution, their adoption for incremental KG updates and the interplay of the individual steps have hardly been investigated in a systematic manner so far. In this work, we first discuss the main graph models for KGs and introduce the major requirement for future KG construction pipelines. Next, we provide an overview of the necessary steps to build high-quality KGs, including cross-cutting topics such as metadata management, ontology development, and quality assurance. We then evaluate the state of the art of KG construction w.r.t the introduced requirements for specific popular KGs as well as so",
    "link": "http://arxiv.org/abs/2302.11509",
    "context": "Title: Construction of Knowledge Graphs: State and Challenges. (arXiv:2302.11509v2 [cs.AI] UPDATED)\nAbstract: With knowledge graphs (KGs) at the center of numerous applications such as recommender systems and question answering, the need for generalized pipelines to construct and continuously update such KGs is increasing. While the individual steps that are necessary to create KGs from unstructured (e.g. text) and structured data sources (e.g. databases) are mostly well-researched for their one-shot execution, their adoption for incremental KG updates and the interplay of the individual steps have hardly been investigated in a systematic manner so far. In this work, we first discuss the main graph models for KGs and introduce the major requirement for future KG construction pipelines. Next, we provide an overview of the necessary steps to build high-quality KGs, including cross-cutting topics such as metadata management, ontology development, and quality assurance. We then evaluate the state of the art of KG construction w.r.t the introduced requirements for specific popular KGs as well as so",
    "path": "papers/23/02/2302.11509.json",
    "total_tokens": 918,
    "translated_title": "知识图谱的构建：现状和挑战",
    "translated_abstract": "随着知识图谱在诸多应用中扮演着重要角色，如推荐系统和问答系统，构建和持续更新知识图谱的通用流程的需求正在增加。虽然从非结构化数据（如文本）和结构化数据源（如数据库）创建知识图谱的各个步骤已经得到了广泛研究，但是目前对于增量更新知识图谱和各个步骤之间的相互作用的研究还很有限。本文首先讨论了知识图谱的主要图模型，并介绍了未来知识图谱构建流程的主要需求。然后，我们概述了构建高质量知识图谱所需的必要步骤，包括元数据管理、本体发展和质量保证等交叉主题。最后，我们评估了与已介绍的需求相一致的特定知识图谱的构建现状。",
    "tldr": "知识图谱构建面临着增量更新和步骤之间相互作用的挑战。本文讨论了主要图模型和构建流程需求，对构建高质量知识图谱的必要步骤进行了概述，并评估了现有知识图谱构建的研究现状。"
}