{
    "title": "Identification-robust inference for the LATE with high-dimensional covariates. (arXiv:2302.09756v2 [econ.EM] UPDATED)",
    "abstract": "This paper investigates the local average treatment effect (LATE) with high-dimensional covariates, irrespective of the strength of identification. We propose a novel test statistic for the high-dimensional LATE, demonstrating that our test has uniformly correct asymptotic size. By employing the double/debiased machine learning (DML) method to estimate nuisance parameters, we develop easy-to-implement algorithms for inference and confidence interval calculation of the high-dimensional LATE. Simulations indicate that our test is robust against both weak identification and high-dimensional setting concerning size control and power performance, outperforming other conventional tests. Applying the proposed test to railroad and population data to study the effect of railroad access on urban population growth, we observe the shorter length of confidence intervals and smaller point estimates for the railroad access coefficients compared to the conventional tests.",
    "link": "http://arxiv.org/abs/2302.09756",
    "context": "Title: Identification-robust inference for the LATE with high-dimensional covariates. (arXiv:2302.09756v2 [econ.EM] UPDATED)\nAbstract: This paper investigates the local average treatment effect (LATE) with high-dimensional covariates, irrespective of the strength of identification. We propose a novel test statistic for the high-dimensional LATE, demonstrating that our test has uniformly correct asymptotic size. By employing the double/debiased machine learning (DML) method to estimate nuisance parameters, we develop easy-to-implement algorithms for inference and confidence interval calculation of the high-dimensional LATE. Simulations indicate that our test is robust against both weak identification and high-dimensional setting concerning size control and power performance, outperforming other conventional tests. Applying the proposed test to railroad and population data to study the effect of railroad access on urban population growth, we observe the shorter length of confidence intervals and smaller point estimates for the railroad access coefficients compared to the conventional tests.",
    "path": "papers/23/02/2302.09756.json",
    "total_tokens": 975,
    "translated_title": "高维协变量下的局部平均处理效应鲁棒性推断",
    "translated_abstract": "本文研究了高维协变量下的局部平均处理效应(LATE)，不论识别力如何。我们提出了一种新的高维LATE检验统计量，并证明了我们的检验在渐进情况下具有统一正确的大小。通过采用双重/无偏机器学习(DML)方法来估计干扰参数，我们开发了简单易实施的算法来推断和计算高维LATE的置信区间。模拟结果表明，我们的检验对于识别力较弱和高维设置下的大小控制和功效表现具有鲁棒性，优于其他传统检验方法。将所提出的检验应用于铁路和人口数据，研究铁路通达对城市人口增长的影响，我们观察到与传统检验相比，铁路通达系数的置信区间长度更短，点估计更小。",
    "tldr": "本文提出了一种适用于高维协变量下的局部平均处理效应的检验统计量，证明其具有统一正确的大小，并通过双重/无偏机器学习方法实现了推断和置信区间计算。模拟结果表明，该检验具有鲁棒性，可以有效处理识别力较弱和高维设置下的数据。应用于实证研究中，该方法在铁路通达对城市人口增长的影响研究中表现出更短的置信区间和更小的点估计。",
    "en_tdlr": "This paper proposes a test statistic for the local average treatment effect (LATE) with high-dimensional covariates, demonstrating its uniform correct size. The test is robust against weak identification and high-dimensional settings, outperforming conventional tests. Applying the test to study the effect of railroad access on population growth, it shows shorter confidence intervals and smaller estimates compared to conventional tests."
}