{
    "title": "Grimm in Wonderland: Prompt Engineering with Midjourney to Illustrate Fairytales. (arXiv:2302.08961v2 [cs.CL] UPDATED)",
    "abstract": "The quality of text-to-image generation is continuously improving, yet the boundaries of its applicability are still unclear. In particular, refinement of the text input with the objective of achieving better results - commonly called prompt engineering - so far seems to have not been geared towards work with pre-existing texts. We investigate whether text-to-image generation and prompt engineering could be used to generate basic illustrations of popular fairytales. Using Midjourney v4, we engage in action research with a dual aim: to attempt to generate 5 believable illustrations for each of 5 popular fairytales, and to define a prompt engineering process that starts from a pre-existing text and arrives at an illustration of it. We arrive at a tentative 4-stage process: i) initial prompt, ii) composition adjustment, iii) style refinement, and iv) variation selection. We also discuss three reasons why the generation model struggles with certain illustrations: difficulties with counts, ",
    "link": "http://arxiv.org/abs/2302.08961",
    "context": "Title: Grimm in Wonderland: Prompt Engineering with Midjourney to Illustrate Fairytales. (arXiv:2302.08961v2 [cs.CL] UPDATED)\nAbstract: The quality of text-to-image generation is continuously improving, yet the boundaries of its applicability are still unclear. In particular, refinement of the text input with the objective of achieving better results - commonly called prompt engineering - so far seems to have not been geared towards work with pre-existing texts. We investigate whether text-to-image generation and prompt engineering could be used to generate basic illustrations of popular fairytales. Using Midjourney v4, we engage in action research with a dual aim: to attempt to generate 5 believable illustrations for each of 5 popular fairytales, and to define a prompt engineering process that starts from a pre-existing text and arrives at an illustration of it. We arrive at a tentative 4-stage process: i) initial prompt, ii) composition adjustment, iii) style refinement, and iv) variation selection. We also discuss three reasons why the generation model struggles with certain illustrations: difficulties with counts, ",
    "path": "papers/23/02/2302.08961.json",
    "total_tokens": 896,
    "translated_title": "在仙境与仙境之间的启示工程中插入格林童话：中途旅程来说明童话故事",
    "translated_abstract": "文本到图像生成的质量不断提高，但其适用范围的界限仍不清楚。特别是，以改进文本输入以实现更好结果为目标的启示工程，似乎尚未针对与现有文本一起工作进行研究。我们研究了文本到图像生成和启示工程是否可以用于生成流行童话的基本插图。使用Midjourney v4，我们进行了行动研究，旨在尝试为5个流行童话中的每个童话生成5个令人信服的插图，并确定一个从现有文本到插图的启示工程过程。我们得出了一个初步的4阶段过程：i）初始提示，ii）构图调整，iii）风格细化，和iv）变异选择。我们还讨论了生成模型在某些插图上遇到困难的三个原因：计数困难，",
    "tldr": "通过插入格林童话和基于现有文本的启示工程，我们探讨了文本到图像生成和启示工程的可行性，提出了一个4阶段的启示工程过程，并讨论了生成模型在某些插图上的困难。",
    "en_tdlr": "We explore the feasibility of text-to-image generation and prompt engineering by incorporating Grimm fairytales and pre-existing texts, proposing a 4-stage prompt engineering process and discussing the challenges faced by the generation model in certain illustrations."
}