{
    "title": "Decomposition and Interpretation of Treatment Effects in Settings with Delayed Outcomes. (arXiv:2302.11505v2 [econ.EM] UPDATED)",
    "abstract": "This paper studies settings where the analyst is interested in identifying and estimating the average causal effect of a binary treatment on an outcome. We consider a setup in which the outcome realization does not get immediately realized after the treatment assignment, a feature that is ubiquitous in empirical settings. The period between the treatment and the realization of the outcome allows other observed actions to occur and affect the outcome. In this context, we study several regression-based estimands routinely used in empirical work to capture the average treatment effect and shed light on interpreting them in terms of ceteris paribus effects, indirect causal effects, and selection terms. We obtain three main and related takeaways. First, the three most popular estimands do not generally satisfy what we call strong sign preservation, in the sense that these estimands may be negative even when the treatment positively affects the outcome conditional on any possible combination",
    "link": "http://arxiv.org/abs/2302.11505",
    "context": "Title: Decomposition and Interpretation of Treatment Effects in Settings with Delayed Outcomes. (arXiv:2302.11505v2 [econ.EM] UPDATED)\nAbstract: This paper studies settings where the analyst is interested in identifying and estimating the average causal effect of a binary treatment on an outcome. We consider a setup in which the outcome realization does not get immediately realized after the treatment assignment, a feature that is ubiquitous in empirical settings. The period between the treatment and the realization of the outcome allows other observed actions to occur and affect the outcome. In this context, we study several regression-based estimands routinely used in empirical work to capture the average treatment effect and shed light on interpreting them in terms of ceteris paribus effects, indirect causal effects, and selection terms. We obtain three main and related takeaways. First, the three most popular estimands do not generally satisfy what we call strong sign preservation, in the sense that these estimands may be negative even when the treatment positively affects the outcome conditional on any possible combination",
    "path": "papers/23/02/2302.11505.json",
    "total_tokens": 935,
    "translated_title": "延迟结果情形下的处理效果分解和解释",
    "translated_abstract": "本文研究识别和估计二进制处理对结果的平均因果效应。我们考虑一种情形，即处理分配后结果实现并非立即实现，这是实证研究中普遍存在的特征。处理和结果实现之间的这段时间允许其他观察到的行动发生并影响结果。在这种情况下，我们研究了几种经常用于捕捉平均处理效应的基于回归的估计标准，并阐明了它们在恒定其他因素效应、间接因果效应和选择项方面的解释。我们得出了三个主要且相关的结论。首先，三种最受欢迎的估计量通常不满足我们所说的强符号保留，在这种意义上，即使任何可能的组合条件下处理正效应影响结果，这些估计量也可能为负。",
    "tldr": "本文对处理对结果的平均因果效应进行了研究，考虑了结果实现不及时的情况，研究了经常用于估计平均处理效应的几种标准，并探讨了不同标准的解释方式。研究结果表明，三种最受欢迎的估计量通常不满足强符号保留。",
    "en_tdlr": "This paper studies the causal effect of a binary treatment on an outcome in settings where the outcome realization is not immediate, and explores several regression-based estimands used to capture the average treatment effect. The article sheds light on interpreting these estimands in terms of ceteris paribus effects, indirect causal effects, and selection terms. The study suggests that the three most popular estimands may not satisfy what is called strong sign preservation."
}