{
    "title": "Quantum Multi-Agent Actor-Critic Networks for Cooperative Mobile Access in Multi-UAV Systems. (arXiv:2302.04445v2 [cs.MA] UPDATED)",
    "abstract": "This paper proposes a novel algorithm, named quantum multi-agent actor-critic networks (QMACN) for autonomously constructing a robust mobile access system employing multiple unmanned aerial vehicles (UAVs). In the context of facilitating collaboration among multiple unmanned aerial vehicles (UAVs), the application of multi-agent reinforcement learning (MARL) techniques is regarded as a promising approach. These methods enable UAVs to learn collectively, optimizing their actions within a shared environment, ultimately leading to more efficient cooperative behavior. Furthermore, the principles of a quantum computing (QC) are employed in our study to enhance the training process and inference capabilities of the UAVs involved. By leveraging the unique computational advantages of quantum computing, our approach aims to boost the overall effectiveness of the UAV system. However, employing a QC introduces scalability challenges due to the near intermediate-scale quantum (NISQ) limitation ass",
    "link": "http://arxiv.org/abs/2302.04445",
    "context": "Title: Quantum Multi-Agent Actor-Critic Networks for Cooperative Mobile Access in Multi-UAV Systems. (arXiv:2302.04445v2 [cs.MA] UPDATED)\nAbstract: This paper proposes a novel algorithm, named quantum multi-agent actor-critic networks (QMACN) for autonomously constructing a robust mobile access system employing multiple unmanned aerial vehicles (UAVs). In the context of facilitating collaboration among multiple unmanned aerial vehicles (UAVs), the application of multi-agent reinforcement learning (MARL) techniques is regarded as a promising approach. These methods enable UAVs to learn collectively, optimizing their actions within a shared environment, ultimately leading to more efficient cooperative behavior. Furthermore, the principles of a quantum computing (QC) are employed in our study to enhance the training process and inference capabilities of the UAVs involved. By leveraging the unique computational advantages of quantum computing, our approach aims to boost the overall effectiveness of the UAV system. However, employing a QC introduces scalability challenges due to the near intermediate-scale quantum (NISQ) limitation ass",
    "path": "papers/23/02/2302.04445.json",
    "total_tokens": 879,
    "translated_title": "多无人机系统中的合作移动访问的量子多智能体演员-评论网络",
    "translated_abstract": "本文提出了一种名为量子多智能体演员-评论网络（QMACN）的新算法，用于自主构建一个强大的移动访问系统，利用多个无人机（UAV）。在促进多个无人机之间的协作方面，多智能体强化学习（MARL）技术的应用被认为是一种有前途的方法。这些方法使无人机能够集体学习，在共享环境中优化它们的行动，最终导致更有效的合作行为。此外，我们的研究运用了量子计算（QC）的原则，以增强涉及的无人机的训练过程和推理能力。通过利用量子计算的独特计算优势，我们的方法旨在提高无人机系统的整体有效性。然而，使用QC引入可扩展性挑战，因为近中间规模量子（NISQ）限制。",
    "tldr": "本文提出了一种名为量子多智能体演员-评论网络的新算法，用于自主构建一个强大的移动访问系统，利用多个无人机，并利用量子计算的原则以提高其训练过程和推理能力。",
    "en_tdlr": "This paper proposes a new algorithm called Quantum Multi-Agent Actor-Critic Networks (QMACN) for autonomously constructing a powerful mobile access system using multiple UAVs, and leverages the principles of quantum computing to enhance their training and inference capabilities."
}