{
    "title": "Completeness of Atomic Structure Representations. (arXiv:2302.14770v2 [physics.chem-ph] UPDATED)",
    "abstract": "In this paper, we address the challenge of obtaining a comprehensive and symmetric representation of point particle groups, such as atoms in a molecule, which is crucial in physics and theoretical chemistry. The problem has become even more important with the widespread adoption of machine-learning techniques in science, as it underpins the capacity of models to accurately reproduce physical relationships while being consistent with fundamental symmetries and conservation laws. However, the descriptors that are commonly used to represent point clouds -- most notably those adopted to describe matter at the atomic scale -- are unable to distinguish between special arrangements of particles. This makes it impossible to machine learn their properties. Frameworks that are provably complete exist but are only so in the limit in which they simultaneously describe the mutual relationship between all atoms, which is impractical. We present a novel approach to construct descriptors of finite cor",
    "link": "http://arxiv.org/abs/2302.14770",
    "context": "Title: Completeness of Atomic Structure Representations. (arXiv:2302.14770v2 [physics.chem-ph] UPDATED)\nAbstract: In this paper, we address the challenge of obtaining a comprehensive and symmetric representation of point particle groups, such as atoms in a molecule, which is crucial in physics and theoretical chemistry. The problem has become even more important with the widespread adoption of machine-learning techniques in science, as it underpins the capacity of models to accurately reproduce physical relationships while being consistent with fundamental symmetries and conservation laws. However, the descriptors that are commonly used to represent point clouds -- most notably those adopted to describe matter at the atomic scale -- are unable to distinguish between special arrangements of particles. This makes it impossible to machine learn their properties. Frameworks that are provably complete exist but are only so in the limit in which they simultaneously describe the mutual relationship between all atoms, which is impractical. We present a novel approach to construct descriptors of finite cor",
    "path": "papers/23/02/2302.14770.json",
    "total_tokens": 802,
    "translated_title": "原子结构表征的完备性",
    "translated_abstract": "在本文中，我们解决了获取全面对称的点粒子群体（如分子中的原子）表示的挑战，这在物理学和理论化学中非常重要。随着机器学习技术在科学中的广泛应用，这个问题变得更加重要，因为它支撑了模型准确复现物理关系并与基本对称性和守恒定律一致的能力。然而，通常用于表示点云的描述符（尤其是用于描述原子尺度上物质的描述符）无法区分特殊的粒子排列。这使得无法用机器学习来学习它们的属性。存在可证明完备性的框架，但仅在同时描述所有原子之间的相互关系的极限情况下才是如此，这在实践中是不可行的。我们提出了一种构造有限子集描述符的新方法。",
    "tldr": "本文解决了获取全面对称的点粒子群体（如分子中的原子）表示的挑战，并提出了一种构造有限子集描述符的新方法。",
    "en_tdlr": "This paper addresses the challenge of obtaining a comprehensive and symmetric representation of point particle groups, such as atoms in a molecule, and presents a novel approach to construct descriptors of finite subsets."
}