{
    "title": "Exploring and Exploiting Decision Boundary Dynamics for Adversarial Robustness. (arXiv:2302.03015v2 [cs.LG] UPDATED)",
    "abstract": "The robustness of a deep classifier can be characterized by its margins: the decision boundary's distances to natural data points. However, it is unclear whether existing robust training methods effectively increase the margin for each vulnerable point during training. To understand this, we propose a continuous-time framework for quantifying the relative speed of the decision boundary with respect to each individual point. Through visualizing the moving speed of the decision boundary under Adversarial Training, one of the most effective robust training algorithms, a surprising moving-behavior is revealed: the decision boundary moves away from some vulnerable points but simultaneously moves closer to others, decreasing their margins. To alleviate these conflicting dynamics of the decision boundary, we propose Dynamics-aware Robust Training (DyART), which encourages the decision boundary to engage in movement that prioritizes increasing smaller margins. In contrast to prior works, DyART",
    "link": "http://arxiv.org/abs/2302.03015",
    "context": "Title: Exploring and Exploiting Decision Boundary Dynamics for Adversarial Robustness. (arXiv:2302.03015v2 [cs.LG] UPDATED)\nAbstract: The robustness of a deep classifier can be characterized by its margins: the decision boundary's distances to natural data points. However, it is unclear whether existing robust training methods effectively increase the margin for each vulnerable point during training. To understand this, we propose a continuous-time framework for quantifying the relative speed of the decision boundary with respect to each individual point. Through visualizing the moving speed of the decision boundary under Adversarial Training, one of the most effective robust training algorithms, a surprising moving-behavior is revealed: the decision boundary moves away from some vulnerable points but simultaneously moves closer to others, decreasing their margins. To alleviate these conflicting dynamics of the decision boundary, we propose Dynamics-aware Robust Training (DyART), which encourages the decision boundary to engage in movement that prioritizes increasing smaller margins. In contrast to prior works, DyART",
    "path": "papers/23/02/2302.03015.json",
    "total_tokens": 956,
    "translated_title": "探究和利用决策边界动态的对抗鲁棒性",
    "translated_abstract": "深层分类器的鲁棒性可以由其边界与自然数据点之间的距离来衡量。然而，目前尚不清楚现有的鲁棒训练方法是否能够在训练过程中有效地增加每个易受攻击的点的边界距离。为了解决这个问题，我们提出了一个连续时间框架来量化决策边界相对于每个个体点的移动速度。通过可视化决策边界在最有效的鲁棒训练算法之一--对抗训练下的移动速度，揭示了一个惊人的移动行为：决策边界从某些易受攻击点移开，但同时也向其他点靠近，从而减小了它们的边界距离。为了缓解决策边界的这种冲突动态，我们提出了动态感知鲁棒训练（DyART），鼓励决策边界以增加较小边界距离为优先的移动。与以往的工作不同，DyART是一个关于决策边界动态的新思路。",
    "tldr": "本论文解决了深度学习模型在进行鲁棒训练时的边界动态问题，提出了动态感知鲁棒训练方法，通过优化边界增加较小边界距离为优先的移动来提升模型的鲁棒性。"
}