{
    "title": "How to Trust Your Diffusion Model: A Convex Optimization Approach to Conformal Risk Control. (arXiv:2302.03791v2 [stat.ML] UPDATED)",
    "abstract": "Score-based generative modeling, informally referred to as diffusion models, continue to grow in popularity across several important domains and tasks. While they provide high-quality and diverse samples from empirical distributions, important questions remain on the reliability and trustworthiness of these sampling procedures for their responsible use in critical scenarios. Conformal prediction is a modern tool to construct finite-sample, distribution-free uncertainty guarantees for any black-box predictor. In this work, we focus on image-to-image regression tasks and we present a generalization of the Risk-Controlling Prediction Sets (RCPS) procedure, that we term $K$-RCPS, which allows to $(i)$ provide entrywise calibrated intervals for future samples of any diffusion model, and $(ii)$ control a certain notion of risk with respect to a ground truth image with minimal mean interval length. Differently from existing conformal risk control procedures, ours relies on a novel convex opti",
    "link": "http://arxiv.org/abs/2302.03791",
    "context": "Title: How to Trust Your Diffusion Model: A Convex Optimization Approach to Conformal Risk Control. (arXiv:2302.03791v2 [stat.ML] UPDATED)\nAbstract: Score-based generative modeling, informally referred to as diffusion models, continue to grow in popularity across several important domains and tasks. While they provide high-quality and diverse samples from empirical distributions, important questions remain on the reliability and trustworthiness of these sampling procedures for their responsible use in critical scenarios. Conformal prediction is a modern tool to construct finite-sample, distribution-free uncertainty guarantees for any black-box predictor. In this work, we focus on image-to-image regression tasks and we present a generalization of the Risk-Controlling Prediction Sets (RCPS) procedure, that we term $K$-RCPS, which allows to $(i)$ provide entrywise calibrated intervals for future samples of any diffusion model, and $(ii)$ control a certain notion of risk with respect to a ground truth image with minimal mean interval length. Differently from existing conformal risk control procedures, ours relies on a novel convex opti",
    "path": "papers/23/02/2302.03791.json",
    "total_tokens": 1110,
    "translated_title": "如何信任您的扩散模型：一种凸优化方法应对符合风险控制的因式分解模型",
    "translated_abstract": "基于分数的生成建模方法，简称扩散模型，在多个重要领域和任务中继续增长。尽管它们提供了来自经验分布的高质量和多样化样本，但在其负责任地用于关键场景方面的可靠性和可信度仍存在重要问题。收敛预测是一种现代工具，用于为任何黑盒子预测器构建有限样本、分布自由的不确定性保证。在这项工作中，我们专注于图像到图像回归任务，并提出了一种风险控制预测集（RCPS）程序的推广，我们称之为$K$-RCPS，它允许$(i)$为任何扩散模型提供逐个校准的未来样本间隔，并$(ii)$控制相对于基准真实图像的某种风险概念，同时保持最小平均区间长度。与现有的收敛风险控制过程不同，我们的过程依靠一种新型的凸优化公式，使其具有计算效率和易于实现的特点。我们在几个图像到图像回归任务上使用得分为基础的生成建模方法来说明我们的程序的有效性，展示了高度校准和良好控制的预测间隔。",
    "tldr": "本文提出了一种风险控制预测集（RCPS）程序的推广，称为$K$-RCPS，它允许为任何扩散模型提供逐个校准的未来样本间隔，并控制相对于基准真实图像的某种风险概念，同时保持最小平均区间长度。",
    "en_tdlr": "This paper proposes a generalization of the Risk-Controlling Prediction Sets (RCPS) procedure, called $K$-RCPS, which allows for entrywise calibrated intervals for future samples of any diffusion model, and controls a certain notion of risk with respect to a ground truth image, while maintaining a minimum mean interval length."
}