{
    "title": "Augmenting Rule-based DNS Censorship Detection at Scale with Machine Learning. (arXiv:2302.02031v2 [cs.LG] UPDATED)",
    "abstract": "The proliferation of global censorship has led to the development of a plethora of measurement platforms to monitor and expose it. Censorship of the domain name system (DNS) is a key mechanism used across different countries. It is currently detected by applying heuristics to samples of DNS queries and responses (probes) for specific destinations. These heuristics, however, are both platform-specific and have been found to be brittle when censors change their blocking behavior, necessitating a more reliable automated process for detecting censorship.  In this paper, we explore how machine learning (ML) models can (1) help streamline the detection process, (2) improve the potential of using large-scale datasets for censorship detection, and (3) discover new censorship instances and blocking signatures missed by existing heuristic methods. Our study shows that supervised models, trained using expert-derived labels on instances of known anomalies and possible censorship, can learn the det",
    "link": "http://arxiv.org/abs/2302.02031",
    "context": "Title: Augmenting Rule-based DNS Censorship Detection at Scale with Machine Learning. (arXiv:2302.02031v2 [cs.LG] UPDATED)\nAbstract: The proliferation of global censorship has led to the development of a plethora of measurement platforms to monitor and expose it. Censorship of the domain name system (DNS) is a key mechanism used across different countries. It is currently detected by applying heuristics to samples of DNS queries and responses (probes) for specific destinations. These heuristics, however, are both platform-specific and have been found to be brittle when censors change their blocking behavior, necessitating a more reliable automated process for detecting censorship.  In this paper, we explore how machine learning (ML) models can (1) help streamline the detection process, (2) improve the potential of using large-scale datasets for censorship detection, and (3) discover new censorship instances and blocking signatures missed by existing heuristic methods. Our study shows that supervised models, trained using expert-derived labels on instances of known anomalies and possible censorship, can learn the det",
    "path": "papers/23/02/2302.02031.json",
    "total_tokens": 863,
    "translated_title": "用机器学习扩展规则型域名系统DNS审查检测的规模",
    "translated_abstract": "全球审查的增加导致了大量监测和曝光的测量平台的发展。域名系统（DNS）的审查是不同国家使用的关键机制，目前通过对特定目的地的DNS查询和响应（探针）样本应用启发式方法来检测。然而，这些启发式方法既与平台特定相关，也发现当审查者改变其阻止行为时的脆弱性，需要更可靠的自动化过程来检测审查。在本文中，我们探讨了机器学习（ML）模型如何（1）帮助简化检测过程，（2）提高使用大规模数据集进行审查检测的潜力，（3）发现现有启发式方法所错过的新审查实例和阻止标志。我们的研究表明，经过专家派生标签训练的监督模型可以学习检测审查和异常的已知实例。",
    "tldr": "本文探讨了如何使用机器学习模型来帮助简化DNS审查检测过程，提高检测的可靠性，并发现启发式方法所错过的新审查实例和阻止标志。"
}