{
    "title": "Attacking Cooperative Multi-Agent Reinforcement Learning by Adversarial Minority Influence. (arXiv:2302.03322v2 [cs.LG] UPDATED)",
    "abstract": "This study probes the vulnerabilities of cooperative multi-agent reinforcement learning (c-MARL) under adversarial attacks, a critical determinant of c-MARL's worst-case performance prior to real-world implementation. Current observation-based attacks, constrained by white-box assumptions, overlook c-MARL's complex multi-agent interactions and cooperative objectives, resulting in impractical and limited attack capabilities. To address these shortcomes, we propose Adversarial Minority Influence (AMI), a practical and strong for c-MARL. AMI is a practical black-box attack and can be launched without knowing victim parameters. AMI is also strong by considering the complex multi-agent interaction and the cooperative goal of agents, enabling a single adversarial agent to unilaterally misleads majority victims to form targeted worst-case cooperation. This mirrors minority influence phenomena in social psychology. To achieve maximum deviation in victim policies under complex agent-wise intera",
    "link": "http://arxiv.org/abs/2302.03322",
    "context": "Title: Attacking Cooperative Multi-Agent Reinforcement Learning by Adversarial Minority Influence. (arXiv:2302.03322v2 [cs.LG] UPDATED)\nAbstract: This study probes the vulnerabilities of cooperative multi-agent reinforcement learning (c-MARL) under adversarial attacks, a critical determinant of c-MARL's worst-case performance prior to real-world implementation. Current observation-based attacks, constrained by white-box assumptions, overlook c-MARL's complex multi-agent interactions and cooperative objectives, resulting in impractical and limited attack capabilities. To address these shortcomes, we propose Adversarial Minority Influence (AMI), a practical and strong for c-MARL. AMI is a practical black-box attack and can be launched without knowing victim parameters. AMI is also strong by considering the complex multi-agent interaction and the cooperative goal of agents, enabling a single adversarial agent to unilaterally misleads majority victims to form targeted worst-case cooperation. This mirrors minority influence phenomena in social psychology. To achieve maximum deviation in victim policies under complex agent-wise intera",
    "path": "papers/23/02/2302.03322.json",
    "total_tokens": 1105,
    "translated_title": "《通过对抗性少数派影响攻击合作多智能体强化学习》",
    "translated_abstract": "本研究探讨了合作多智能体强化学习(c-MARL)在对抗性攻击下的弱点，这是在实际实现之前c-MARL最坏情况下性能的重要决定因素。目前基于观察的攻击，受到白盒假设的限制，忽视了c-MARL的复杂多智能体交互和合作目标，导致攻击能力受到实际和限制。为了解决这些问题，我们提出了Adversarial Minority Influence (AMI)，这是一个实用而强大的针对c-MARL的黑盒攻击。AMI是一个实用的黑盒攻击，可以在不了解受害者参数的情况下发动攻击。AMI也是强大的，因为它考虑了复杂的多智能体互动和代理的合作目标，使单个对抗性代理能够单方面误导大多数受害者形成有针对性的最坏情况合作。这反映了社会心理学中的少数派影响现象。为了在复杂的代理方式交互下实现最大的受害者政策偏差，我们基于博弈理论分析推导出一种高效且可扩展的AMI优化算法。我们证明了AMI的有效性以及考虑多智能体交互的必要性，表明AMI可以实现比现有方法高出2.2倍的攻击成功率。",
    "tldr": "本研究提出了 Adversarial Minority Influence (AMI) 黑盒攻击，能够在考虑多智能体互动和合作目标下实现有针对性的最坏情况合作，攻击成功率比现有方法高出 2.2倍。",
    "en_tdlr": "This study proposes Adversarial Minority Influence (AMI) as a black-box attack that achieves targeted worst-case cooperation by considering complex multi-agent interactions and cooperative objectives, with a 2.2x higher attack success rate than existing methods."
}