{
    "title": "Deep Generative Symbolic Regression with Monte-Carlo-Tree-Search. (arXiv:2302.11223v2 [cs.LG] UPDATED)",
    "abstract": "Symbolic regression (SR) is the problem of learning a symbolic expression from numerical data. Recently, deep neural models trained on procedurally-generated synthetic datasets showed competitive performance compared to more classical Genetic Programming (GP) algorithms. Unlike their GP counterparts, these neural approaches are trained to generate expressions from datasets given as context. This allows them to produce accurate expressions in a single forward pass at test time. However, they usually do not benefit from search abilities, which result in low performance compared to GP on out-of-distribution datasets. In this paper, we propose a novel method which provides the best of both worlds, based on a Monte-Carlo Tree Search procedure using a context-aware neural mutation model, which is initially pre-trained to learn promising mutations, and further refined from successful experiences in an online fashion. The approach demonstrates state-of-the-art performance on the well-known \\te",
    "link": "http://arxiv.org/abs/2302.11223",
    "context": "Title: Deep Generative Symbolic Regression with Monte-Carlo-Tree-Search. (arXiv:2302.11223v2 [cs.LG] UPDATED)\nAbstract: Symbolic regression (SR) is the problem of learning a symbolic expression from numerical data. Recently, deep neural models trained on procedurally-generated synthetic datasets showed competitive performance compared to more classical Genetic Programming (GP) algorithms. Unlike their GP counterparts, these neural approaches are trained to generate expressions from datasets given as context. This allows them to produce accurate expressions in a single forward pass at test time. However, they usually do not benefit from search abilities, which result in low performance compared to GP on out-of-distribution datasets. In this paper, we propose a novel method which provides the best of both worlds, based on a Monte-Carlo Tree Search procedure using a context-aware neural mutation model, which is initially pre-trained to learn promising mutations, and further refined from successful experiences in an online fashion. The approach demonstrates state-of-the-art performance on the well-known \\te",
    "path": "papers/23/02/2302.11223.json",
    "total_tokens": 1197,
    "translated_title": "基于蒙特卡罗树搜索的深度生成式符号回归",
    "translated_abstract": "符号回归（SR）是从数值数据中学习符号表达式的问题。最近，在模拟生成的合成数据集上训练的深度神经模型表现出与更经典的遗传编程（GP）算法相媲美的性能。与其GP对应物不同，这些神经方法是针对给定上下文的数据集生成表达式的。本文介绍了一种新方法，它结合了两种方法的优点，基于使用上下文感知的神经突变模型的蒙特卡罗树搜索过程，该模型最初预先训练以学习有前途的突变，并且通过在线方式从成功的经验中进一步完善。该方法展示了在知名的数据集上最先进的性能。",
    "tldr": "本文提出了一种基于蒙特卡罗树搜索的深度生成式符号回归方法，结合了神经方法和遗传编程算法的优点，运用上下文感知的神经突变模型，并在知名数据集中展示出最先进的性能。",
    "en_tdlr": "This paper proposes a novel method of deep generative symbolic regression, which combines the advantages of neural methods and genetic programming algorithms, using a context-aware neural mutation model and a Monte-Carlo Tree Search procedure, and demonstrates state-of-the-art performance on well-known datasets."
}