{
    "title": "Q-Flow: Generative Modeling for Differential Equations of Open Quantum Dynamics with Normalizing Flows. (arXiv:2302.12235v2 [quant-ph] UPDATED)",
    "abstract": "Studying the dynamics of open quantum systems can enable breakthroughs both in fundamental physics and applications to quantum engineering and quantum computation. Since the density matrix $\\rho$, which is the fundamental description for the dynamics of such systems, is high-dimensional, customized deep generative neural networks have been instrumental in modeling $\\rho$. However, the complex-valued nature and normalization constraints of $\\rho$, as well as its complicated dynamics, prohibit a seamless connection between open quantum systems and the recent advances in deep generative modeling. Here we lift that limitation by utilizing a reformulation of open quantum system dynamics to a partial differential equation (PDE) for a corresponding probability distribution $Q$, the Husimi Q function. Thus, we model the Q function seamlessly with off-the-shelf deep generative models such as normalizing flows. Additionally, we develop novel methods for learning normalizing flow evolution govern",
    "link": "http://arxiv.org/abs/2302.12235",
    "context": "Title: Q-Flow: Generative Modeling for Differential Equations of Open Quantum Dynamics with Normalizing Flows. (arXiv:2302.12235v2 [quant-ph] UPDATED)\nAbstract: Studying the dynamics of open quantum systems can enable breakthroughs both in fundamental physics and applications to quantum engineering and quantum computation. Since the density matrix $\\rho$, which is the fundamental description for the dynamics of such systems, is high-dimensional, customized deep generative neural networks have been instrumental in modeling $\\rho$. However, the complex-valued nature and normalization constraints of $\\rho$, as well as its complicated dynamics, prohibit a seamless connection between open quantum systems and the recent advances in deep generative modeling. Here we lift that limitation by utilizing a reformulation of open quantum system dynamics to a partial differential equation (PDE) for a corresponding probability distribution $Q$, the Husimi Q function. Thus, we model the Q function seamlessly with off-the-shelf deep generative models such as normalizing flows. Additionally, we develop novel methods for learning normalizing flow evolution govern",
    "path": "papers/23/02/2302.12235.json",
    "total_tokens": 919,
    "translated_title": "Q-Flow：基于正则化流量的开放量子动力学微分方程生成建模",
    "translated_abstract": "研究开放量子系统动态可以在基础物理学以及应用于量子工程和量子计算方面实现突破。由于密度矩阵$\\rho$ 是描述此类系统动态的基本工具，其维数很高，因此定制的深度生成式神经网络对于建模$\\rho$至关重要。然而，$\\rho$的复数性质和正则化限制，以及其复杂的动态特性，阻碍了开放量子系统与深度生成式建模的最新进展之间的流畅连接。在本文中，我们通过将开放量子系统动力学重构为相应概率分布 $Q$ 的偏微分方程（PDE），即Husimi Q函数，从而解决了这一限制。因此，我们使用现成的深度生成式模型（如正则化流）无缝地对Q函数进行建模。此外，我们还开发了新方法来学习正则化流动演化控制。",
    "tldr": "本文研究如何通过将开放量子系统动力学重构为概率分布$Q$的偏微分方程（PDE）从而解决对正则化流的限制，在建模上实现无缝连接。通过此方法，我们可以使用现成的深度生成式模型（如正则化流）对Q函数进行建模。",
    "en_tdlr": "This paper explores how to overcome limitations in normalizing flow models by utilizing a reformulation of open quantum system dynamics to a partial differential equation (PDE) for the corresponding probability distribution Q, the Husimi Q function, enabling seamless modeling of quantum system dynamics with off-the-shelf deep generative models such as normalizing flows."
}