{
    "title": "Understanding Oversquashing in GNNs through the Lens of Effective Resistance. (arXiv:2302.06835v2 [cs.LG] UPDATED)",
    "abstract": "Message passing graph neural networks (GNNs) are a popular learning architectures for graph-structured data. However, one problem GNNs experience is oversquashing, where a GNN has difficulty sending information between distant nodes. Understanding and mitigating oversquashing has recently received significant attention from the research community. In this paper, we continue this line of work by analyzing oversquashing through the lens of the effective resistance between nodes in the input graph. Effective resistance intuitively captures the ``strength'' of connection between two nodes by paths in the graph, and has a rich literature spanning many areas of graph theory. We propose to use total effective resistance as a bound of the total amount of oversquashing in a graph and provide theoretical justification for its use. We further develop an algorithm to identify edges to be added to an input graph to minimize the total effective resistance, thereby alleviating oversquashing. We provi",
    "link": "http://arxiv.org/abs/2302.06835",
    "context": "Title: Understanding Oversquashing in GNNs through the Lens of Effective Resistance. (arXiv:2302.06835v2 [cs.LG] UPDATED)\nAbstract: Message passing graph neural networks (GNNs) are a popular learning architectures for graph-structured data. However, one problem GNNs experience is oversquashing, where a GNN has difficulty sending information between distant nodes. Understanding and mitigating oversquashing has recently received significant attention from the research community. In this paper, we continue this line of work by analyzing oversquashing through the lens of the effective resistance between nodes in the input graph. Effective resistance intuitively captures the ``strength'' of connection between two nodes by paths in the graph, and has a rich literature spanning many areas of graph theory. We propose to use total effective resistance as a bound of the total amount of oversquashing in a graph and provide theoretical justification for its use. We further develop an algorithm to identify edges to be added to an input graph to minimize the total effective resistance, thereby alleviating oversquashing. We provi",
    "path": "papers/23/02/2302.06835.json",
    "total_tokens": 927,
    "translated_title": "从有效电阻的角度理解GNN中的过度压缩",
    "translated_abstract": "消息传递图神经网络（GNN）是用于图结构数据的流行学习架构。然而，GNN所遇到的一个问题是过度压缩，即GNN在远距离节点之间传递信息时存在困难。最近，理解和缓解过度压缩引起了研究界的重视。本文通过分析输入图中节点之间的有效电阻来理解和减轻过度压缩。有效电阻直观地捕捉图中两个节点之间路径的“强度”，并在图理论的许多领域具有丰富的文献。我们建议使用总有效电阻作为图中过度压缩总量的限制，并为其使用提供理论验证。我们进一步开发了一种算法，以识别要添加到输入图中的边以最小化总有效电阻，从而减轻过度压缩。我们在合成和现实世界数据集上提供了实验，证明了我们方法的有效性。",
    "tldr": "本文提出了一种通过分析图中节点之间的有效电阻来理解和减轻GNN中过度压缩的方法，并提出了使用总有效电阻作为压缩总量限制的方法，进而开发了一种算法以减轻过度压缩。",
    "en_tdlr": "This paper proposes a method to understand and alleviate oversquashing in GNNs by analyzing the effective resistance between nodes in the input graph, and develops an algorithm to minimize the total effective resistance by identifying edges to be added to the graph, showing its effectiveness on synthetic and real-world datasets."
}