{
    "title": "Predicting the Silent Majority on Graphs: Knowledge Transferable Graph Neural Network. (arXiv:2302.00873v2 [cs.LG] UPDATED)",
    "abstract": "Graphs consisting of vocal nodes (\"the vocal minority\") and silent nodes (\"the silent majority\"), namely VS-Graph, are ubiquitous in the real world. The vocal nodes tend to have abundant features and labels. In contrast, silent nodes only have incomplete features and rare labels, e.g., the description and political tendency of politicians (vocal) are abundant while not for ordinary people (silent) on the twitter's social network. Predicting the silent majority remains a crucial yet challenging problem. However, most existing message-passing based GNNs assume that all nodes belong to the same domain, without considering the missing features and distribution-shift between domains, leading to poor ability to deal with VS-Graph. To combat the above challenges, we propose Knowledge Transferable Graph Neural Network (KT-GNN), which models distribution shifts during message passing and representation learning by transferring knowledge from vocal nodes to silent nodes. Specifically, we design ",
    "link": "http://arxiv.org/abs/2302.00873",
    "context": "Title: Predicting the Silent Majority on Graphs: Knowledge Transferable Graph Neural Network. (arXiv:2302.00873v2 [cs.LG] UPDATED)\nAbstract: Graphs consisting of vocal nodes (\"the vocal minority\") and silent nodes (\"the silent majority\"), namely VS-Graph, are ubiquitous in the real world. The vocal nodes tend to have abundant features and labels. In contrast, silent nodes only have incomplete features and rare labels, e.g., the description and political tendency of politicians (vocal) are abundant while not for ordinary people (silent) on the twitter's social network. Predicting the silent majority remains a crucial yet challenging problem. However, most existing message-passing based GNNs assume that all nodes belong to the same domain, without considering the missing features and distribution-shift between domains, leading to poor ability to deal with VS-Graph. To combat the above challenges, we propose Knowledge Transferable Graph Neural Network (KT-GNN), which models distribution shifts during message passing and representation learning by transferring knowledge from vocal nodes to silent nodes. Specifically, we design ",
    "path": "papers/23/02/2302.00873.json",
    "total_tokens": 952,
    "translated_title": "针对含有“沉默大多数”的图表进行抗差建模的知识可迁移图神经网络",
    "translated_abstract": "在现实世界中，存在由有声节点（“有声少数”）和无声节点（“沉默大多数”）组成的图表，即 VS-Graph，其中有声节点往往具有丰富的特征和标签，而无声节点仅具有不完整的特征和稀缺的标签。 预测沉默大多数仍然是一个至关重要且具有挑战性的问题。 为了解决这个问题，提出了一种称为知识可迁移图神经网络（KT-GNN）的方法，该方法通过将有声节点的知识转移给无声节点来实现消息传递和表征学习过程中的分布漂移建模。 实验结果表明，KT-GNN 在各种真实世界数据集上都具有有效性和优越性。",
    "tldr": "本文提出了一种新颖的知识可迁移模块和适应性学习机制，通过将有声节点的知识转移给无声节点，实现了针对含有“沉默大多数”的图表的抗差建模。实验证明，该方法在各种真实世界数据集上都具有有效性和优越性。",
    "en_tdlr": "This paper proposes a novel knowledge transfer module and adaptation learning mechanism to combat the challenge of predicting the silent majority on graphs consisting of vocal and silent nodes. The proposed method, called KT-GNN, transfers knowledge from vocal to silent nodes to model distribution shifts during message passing and representation learning, demonstrating its effectiveness and superiority on various real-world datasets."
}