{
    "title": "Quantum algorithms applied to satellite mission planning for Earth observation. (arXiv:2302.07181v2 [quant-ph] UPDATED)",
    "abstract": "Earth imaging satellites are a crucial part of our everyday lives that enable global tracking of industrial activities. Use cases span many applications, from weather forecasting to digital maps, carbon footprint tracking, and vegetation monitoring. However, there are limitations; satellites are difficult to manufacture, expensive to maintain, and tricky to launch into orbit. Therefore, satellites must be employed efficiently. This poses a challenge known as the satellite mission planning problem, which could be computationally prohibitive to solve on large scales. However, close-to-optimal algorithms, such as greedy reinforcement learning and optimization algorithms, can often provide satisfactory resolutions. This paper introduces a set of quantum algorithms to solve the mission planning problem and demonstrate an advantage over the classical algorithms implemented thus far. The problem is formulated as maximizing the number of high-priority tasks completed on real datasets containin",
    "link": "http://arxiv.org/abs/2302.07181",
    "context": "Title: Quantum algorithms applied to satellite mission planning for Earth observation. (arXiv:2302.07181v2 [quant-ph] UPDATED)\nAbstract: Earth imaging satellites are a crucial part of our everyday lives that enable global tracking of industrial activities. Use cases span many applications, from weather forecasting to digital maps, carbon footprint tracking, and vegetation monitoring. However, there are limitations; satellites are difficult to manufacture, expensive to maintain, and tricky to launch into orbit. Therefore, satellites must be employed efficiently. This poses a challenge known as the satellite mission planning problem, which could be computationally prohibitive to solve on large scales. However, close-to-optimal algorithms, such as greedy reinforcement learning and optimization algorithms, can often provide satisfactory resolutions. This paper introduces a set of quantum algorithms to solve the mission planning problem and demonstrate an advantage over the classical algorithms implemented thus far. The problem is formulated as maximizing the number of high-priority tasks completed on real datasets containin",
    "path": "papers/23/02/2302.07181.json",
    "total_tokens": 840,
    "translated_title": "量子算法在地球观测卫星任务规划中的应用",
    "translated_abstract": "地球成像卫星是我们日常生活中不可或缺的一部分，能够全球追踪工业活动。应用案例涵盖许多应用领域，从天气预报到数字地图、碳足迹追踪和植被监测等。然而，存在一些限制：卫星难以制造、维护成本高且发射进入轨道困难。因此，卫星必须被有效地利用。这带来了一个挑战，即卫星任务规划问题，该问题在大规模上可能具有计算上的限制。然而，近似最优算法，如贪婪强化学习和优化算法，通常可以提供令人满意的解决方案。本文提出了一组量子算法来解决任务规划问题，并证明了它们在结果优于迄今为止实现的经典算法方面的优势。该问题被建模为在包含实际数据集的情况下最大化完成高优先级任务的数量。",
    "tldr": "本文介绍了一组量子算法，用于解决地球观测卫星任务规划问题，并证明了它们在结果优于传统算法方面的优势。"
}