{
    "title": "PEPNet: Parameter and Embedding Personalized Network for Infusing with Personalized Prior Information. (arXiv:2302.01115v3 [cs.IR] UPDATED)",
    "abstract": "With the increase of content pages and interactive buttons in online services such as online-shopping and video-watching websites, industrial-scale recommender systems face challenges in multi-domain and multi-task recommendations. The core of multi-task and multi-domain recommendation is to accurately capture user interests in multiple scenarios given multiple user behaviors. In this paper, we propose a plug-and-play \\textit{\\textbf{P}arameter and \\textbf{E}mbedding \\textbf{P}ersonalized \\textbf{Net}work (\\textbf{PEPNet})} for multi-domain and multi-task recommendation. PEPNet takes personalized prior information as input and dynamically scales the bottom-level Embedding and top-level DNN hidden units through gate mechanisms. \\textit{Embedding Personalized Network (EPNet)} performs personalized selection on Embedding to fuse features with different importance for different users in multiple domains. \\textit{Parameter Personalized Network (PPNet)} executes personalized modification on ",
    "link": "http://arxiv.org/abs/2302.01115",
    "context": "Title: PEPNet: Parameter and Embedding Personalized Network for Infusing with Personalized Prior Information. (arXiv:2302.01115v3 [cs.IR] UPDATED)\nAbstract: With the increase of content pages and interactive buttons in online services such as online-shopping and video-watching websites, industrial-scale recommender systems face challenges in multi-domain and multi-task recommendations. The core of multi-task and multi-domain recommendation is to accurately capture user interests in multiple scenarios given multiple user behaviors. In this paper, we propose a plug-and-play \\textit{\\textbf{P}arameter and \\textbf{E}mbedding \\textbf{P}ersonalized \\textbf{Net}work (\\textbf{PEPNet})} for multi-domain and multi-task recommendation. PEPNet takes personalized prior information as input and dynamically scales the bottom-level Embedding and top-level DNN hidden units through gate mechanisms. \\textit{Embedding Personalized Network (EPNet)} performs personalized selection on Embedding to fuse features with different importance for different users in multiple domains. \\textit{Parameter Personalized Network (PPNet)} executes personalized modification on ",
    "path": "papers/23/02/2302.01115.json",
    "total_tokens": 899,
    "translated_title": "PEPNet：融入个性化先验信息的参数和嵌入式个性化网络",
    "translated_abstract": "随着在线服务如网购和视频观看网站中内容页面和交互按钮的增加，工业规模的推荐系统在多领域和多任务推荐方面面临挑战。多任务和多领域推荐的核心是在给定多个用户行为的多个场景中准确捕捉用户的兴趣。在本文中，我们提出了一种可插拔的“参数和嵌入式个性化网络（PEPNet）”，用于多领域和多任务推荐。PEPNet将个性化先验信息作为输入，并通过门机制动态调整底层嵌入和顶层DNN隐藏单元。嵌入个性化网络（EPNet）对嵌入执行个性化选择，以融合不同用户在多个领域中不同重要性的特征。参数个性化网络（PPNet）对参数执行个性化修改。",
    "tldr": "本文提出了一种融合个性化先验信息的可插拔网络（PEPNet），用于多领域和多任务推荐。该网络通过动态调整底层嵌入和顶层DNN隐藏单元，以准确捕捉用户在多个场景中的兴趣。",
    "en_tdlr": "This paper presents a plug-and-play network, PEPNet, for multi-domain and multi-task recommendation by infusing personalized prior information. The network dynamically adjusts the bottom-level embedding and top-level DNN hidden units to accurately capture user interests in multiple scenarios."
}