{
    "title": "Debiasing Recommendation by Learning Identifiable Latent Confounders. (arXiv:2302.05052v2 [cs.LG] UPDATED)",
    "abstract": "Recommendation systems aim to predict users' feedback on items not exposed to them.  Confounding bias arises due to the presence of unmeasured variables (e.g., the socio-economic status of a user) that can affect both a user's exposure and feedback. Existing methods either (1) make untenable assumptions about these unmeasured variables or (2) directly infer latent confounders from users' exposure. However, they cannot guarantee the identification of counterfactual feedback, which can lead to biased predictions. In this work, we propose a novel method, i.e., identifiable deconfounder (iDCF), which leverages a set of proxy variables (e.g., observed user features) to resolve the aforementioned non-identification issue. The proposed iDCF is a general deconfounded recommendation framework that applies proximal causal inference to infer the unmeasured confounders and identify the counterfactual feedback with theoretical guarantees. Extensive experiments on various real-world and synthetic da",
    "link": "http://arxiv.org/abs/2302.05052",
    "context": "Title: Debiasing Recommendation by Learning Identifiable Latent Confounders. (arXiv:2302.05052v2 [cs.LG] UPDATED)\nAbstract: Recommendation systems aim to predict users' feedback on items not exposed to them.  Confounding bias arises due to the presence of unmeasured variables (e.g., the socio-economic status of a user) that can affect both a user's exposure and feedback. Existing methods either (1) make untenable assumptions about these unmeasured variables or (2) directly infer latent confounders from users' exposure. However, they cannot guarantee the identification of counterfactual feedback, which can lead to biased predictions. In this work, we propose a novel method, i.e., identifiable deconfounder (iDCF), which leverages a set of proxy variables (e.g., observed user features) to resolve the aforementioned non-identification issue. The proposed iDCF is a general deconfounded recommendation framework that applies proximal causal inference to infer the unmeasured confounders and identify the counterfactual feedback with theoretical guarantees. Extensive experiments on various real-world and synthetic da",
    "path": "papers/23/02/2302.05052.json",
    "total_tokens": 1015,
    "translated_title": "通过学习可识别的潜在混淆因素消除推荐偏差",
    "translated_abstract": "推荐系统旨在预测用户对未被曝光的物品的反馈。混淆偏差是由于存在未测量的变量（例如，用户的社会经济状况）可能会影响用户的曝光和反馈。现有的方法要么对这些未测量变量做出不可行的假设，要么直接推断用户的潜在混淆因素。然而，它们无法保证识别出反事实的反馈，这可能导致预测带有偏见。在本文中，我们提出了一种新方法，即可识别的去混淆（iDCF），它利用一组代理变量（例如，观察到的用户特征）来解决上述的非识别问题。所提出的iDCF是一个通用的去混淆的推荐框架，它应用近端因果推断来推断未测量的混淆因素并识别反事实的反馈，具有理论保证。在各种真实世界和合成数据集上进行的广泛实验证明了我们所提出的方法在减少混淆偏差和提高推荐准确性方面的有效性。",
    "tldr": "本研究提出了一种新方法 iDCF，通过学习可识别的混淆因素来消除推荐偏差，该方法在真实和合成数据集上的实验表明有效性和理论保证。",
    "en_tdlr": "This study proposes a novel method, iDCF, which identifies identifiable latent confounders and leverages a set of proxy variables to resolve the non-identification issue in recommendation systems. The method applies proximal causal inference to infer unmeasured confounders and identify counterfactual feedback, with theoretical guarantees. Experiments on real-world and synthetic datasets demonstrate its effectiveness in reducing confounding bias and improving recommendation accuracy."
}