{
    "title": "Revisiting Modality Imbalance In Multimodal Pedestrian Detection. (arXiv:2302.12589v2 [cs.CV] UPDATED)",
    "abstract": "Multimodal learning, particularly for pedestrian detection, has recently received emphasis due to its capability to function equally well in several critical autonomous driving scenarios such as low-light, night-time, and adverse weather conditions. However, in most cases, the training distribution largely emphasizes the contribution of one specific input that makes the network biased towards one modality. Hence, the generalization of such models becomes a significant problem where the non-dominant input modality during training could be contributing more to the course of inference. Here, we introduce a novel training setup with regularizer in the multimodal architecture to resolve the problem of this disparity between the modalities. Specifically, our regularizer term helps to make the feature fusion method more robust by considering both the feature extractors equivalently important during the training to extract the multimodal distribution which is referred to as removing the imbala",
    "link": "http://arxiv.org/abs/2302.12589",
    "context": "Title: Revisiting Modality Imbalance In Multimodal Pedestrian Detection. (arXiv:2302.12589v2 [cs.CV] UPDATED)\nAbstract: Multimodal learning, particularly for pedestrian detection, has recently received emphasis due to its capability to function equally well in several critical autonomous driving scenarios such as low-light, night-time, and adverse weather conditions. However, in most cases, the training distribution largely emphasizes the contribution of one specific input that makes the network biased towards one modality. Hence, the generalization of such models becomes a significant problem where the non-dominant input modality during training could be contributing more to the course of inference. Here, we introduce a novel training setup with regularizer in the multimodal architecture to resolve the problem of this disparity between the modalities. Specifically, our regularizer term helps to make the feature fusion method more robust by considering both the feature extractors equivalently important during the training to extract the multimodal distribution which is referred to as removing the imbala",
    "path": "papers/23/02/2302.12589.json",
    "total_tokens": 877,
    "translated_title": "重新审视多模态行人检测中的模态不平衡问题",
    "translated_abstract": "多模态学习，特别是对于行人检测而言，近来受到关注，因为它能够在关键的自动驾驶场景中同样良好地运行，如弱光、夜间和恶劣天气条件。然而，在大多数情况下，训练分布极大地强调了某个特定输入的贡献，使网络对某种模态偏向。因此，这种模型的泛化成为一个重要问题，在推断过程中，在训练过程中非主导输入模态可能对推理过程做出更多贡献。在这里，我们引入了一种新的训练设置与多模态架构中的正则化器，以解决模态之间的这种不平衡问题。具体来说，我们的正则化项通过在训练过程中将特征提取器同等重要地考虑在内，使特征融合方法更具鲁棒性，从而提取多模态分布，这被称为移除不平衡性。",
    "tldr": "本文探讨了多模态行人检测中模态不平衡问题，并提出了一种新的训练设置，通过正则化器解决了模态之间的不平衡，使得特征融合更加鲁棒。",
    "en_tdlr": "This paper discusses the issue of modality imbalance in multimodal pedestrian detection and proposes a new training setup with a regularizer to address this imbalance, making the feature fusion more robust."
}