{
    "title": "Dish-TS: A General Paradigm for Alleviating Distribution Shift in Time Series Forecasting. (arXiv:2302.14829v3 [cs.LG] UPDATED)",
    "abstract": "The distribution shift in Time Series Forecasting (TSF), indicating series distribution changes over time, largely hinders the performance of TSF models. Existing works towards distribution shift in time series are mostly limited in the quantification of distribution and, more importantly, overlook the potential shift between lookback and horizon windows. To address above challenges, we systematically summarize the distribution shift in TSF into two categories. Regarding lookback windows as input-space and horizon windows as output-space, there exist (i) intra-space shift, that the distribution within the input-space keeps shifted over time, and (ii) inter-space shift, that the distribution is shifted between input-space and output-space. Then we introduce, Dish-TS, a general neural paradigm for alleviating distribution shift in TSF. Specifically, for better distribution estimation, we propose the coefficient net (CONET), which can be any neural architectures, to map input sequences in",
    "link": "http://arxiv.org/abs/2302.14829",
    "context": "Title: Dish-TS: A General Paradigm for Alleviating Distribution Shift in Time Series Forecasting. (arXiv:2302.14829v3 [cs.LG] UPDATED)\nAbstract: The distribution shift in Time Series Forecasting (TSF), indicating series distribution changes over time, largely hinders the performance of TSF models. Existing works towards distribution shift in time series are mostly limited in the quantification of distribution and, more importantly, overlook the potential shift between lookback and horizon windows. To address above challenges, we systematically summarize the distribution shift in TSF into two categories. Regarding lookback windows as input-space and horizon windows as output-space, there exist (i) intra-space shift, that the distribution within the input-space keeps shifted over time, and (ii) inter-space shift, that the distribution is shifted between input-space and output-space. Then we introduce, Dish-TS, a general neural paradigm for alleviating distribution shift in TSF. Specifically, for better distribution estimation, we propose the coefficient net (CONET), which can be any neural architectures, to map input sequences in",
    "path": "papers/23/02/2302.14829.json",
    "total_tokens": 1001,
    "translated_title": "Dish-TS: 一种缓解时间序列预测中分布偏移的通用范例",
    "translated_abstract": "时间序列预测中的分布偏移指的是时间序列在时间上分布的变化，它很大程度上阻碍了时间序列预测模型的性能。现有针对时间序列分布偏移的研究大多局限于分布量化，更重要的是，忽视了Lookback和Horizon之间的潜在偏移。为了解决上述问题，我们系统地将时间序列中的分布偏移总结为两类。将Lookback窗口视为输入空间，Horizon窗口视为输出空间，存在(i)内部空间偏移，即在输入空间内的分布随时间保持偏移，以及(ii)不同空间偏移，在输入空间和输出空间之间分布偏移。然后，我们引入了一种名为Dish-TS的通用神经模型来缓解时间序列中的分布偏移。具体而言，为了更好地估计分布，我们提出了系数网络（CONET），它可以是任何神经网络架构，用于映射输入序列。",
    "tldr": "Dish-TS是一种通用的神经网络模型，用于缓解时间序列预测中的分布偏移。该模型通过引入系数网络（CONET）来更好地估计分布。在时间序列预测任务中，将Lookback窗口作为输入空间，Horizon窗口作为输出空间，将分布偏移总结为内部空间偏移和不同空间偏移两类。",
    "en_tdlr": "Dish-TS is a general neural paradigm to alleviate distribution shift in Time Series Forecasting (TSF). It systematically divides the distribution shift into intra-space shift and inter-space shift. To better estimate distribution, Dish-TS introduces the coefficient net (CONET) as any neural architectures to map input sequences. By taking Lookback window as the input space and Horizon window as the output space, Dish-TS provides a comprehensive solution for handling distribution shift in TSF."
}