{
    "title": "PAC Prediction Sets for Large Language Models of Code. (arXiv:2302.08703v2 [cs.LG] UPDATED)",
    "abstract": "Prediction sets have recently been shown to be a promising strategy for quantifying the uncertainty of deep neural networks in a way that provides theoretical guarantees. However, existing techniques have largely targeted settings where the space of labels is simple, so prediction sets can be arbitrary subsets of labels. For structured prediction problems where the space of labels is exponential in size, even prediction sets containing a small fraction of all labels can be exponentially large. In the context of code generation, we propose a solution that considers a restricted set of prediction sets that can compactly be represented as partial programs, which are programs with portions replaced with holes. Given a trained code generation model, our algorithm leverages a programming language's abstract syntax tree to generate a set of programs such that the correct program is in the set with high-confidence. Valuable applications of our algorithm include a Codex-style code generator wit",
    "link": "http://arxiv.org/abs/2302.08703",
    "context": "Title: PAC Prediction Sets for Large Language Models of Code. (arXiv:2302.08703v2 [cs.LG] UPDATED)\nAbstract: Prediction sets have recently been shown to be a promising strategy for quantifying the uncertainty of deep neural networks in a way that provides theoretical guarantees. However, existing techniques have largely targeted settings where the space of labels is simple, so prediction sets can be arbitrary subsets of labels. For structured prediction problems where the space of labels is exponential in size, even prediction sets containing a small fraction of all labels can be exponentially large. In the context of code generation, we propose a solution that considers a restricted set of prediction sets that can compactly be represented as partial programs, which are programs with portions replaced with holes. Given a trained code generation model, our algorithm leverages a programming language's abstract syntax tree to generate a set of programs such that the correct program is in the set with high-confidence. Valuable applications of our algorithm include a Codex-style code generator wit",
    "path": "papers/23/02/2302.08703.json",
    "total_tokens": 922,
    "translated_title": "大型语言模型的PAC预测集",
    "translated_abstract": "预测集最近被证明是量化深度神经网络不确定性的一种有前途的策略，同时也提供了理论保证。然而，现有的技术大多针对标签空间简单的设置，因此预测集可以是任意子集。对于标签空间大小呈指数增长的结构化预测问题，即使包含所有标签的预测集也可能呈指数级增长。在代码生成的背景下，我们提出了一种解决方案，考虑到一组受限制的预测集，可以紧凑地表示为部分程序，这些部分程序中的部分已经被替换为占位符。鉴于训练好的代码生成模型，我们的算法利用了编程语言的抽象语法树来生成一组程序，以便正确的程序以高置信度出现在集合中。我们的算法有很多有价值的应用场景，包括Codex风格的代码生成器。",
    "tldr": "本文针对标签空间大小呈指数增长的结构化预测问题，提出了一种考虑到受限制的预测集的解决方案，可以紧凑地表示为部分程序，并利用了编程语言的抽象语法树，使得正确的程序以高置信度出现在集合中。应用方面包括Codex风格的代码生成器。"
}