{
    "title": "Enhancing Exploration in Latent Space Bayesian Optimization. (arXiv:2302.02399v2 [cs.LG] UPDATED)",
    "abstract": "Latent Space Bayesian Optimization (LSBO) combines generative models, typically Variational Autoencoders (VAE), with Bayesian Optimization (BO) to generate de novo objects of interest. However, LSBO faces challenges due to the mismatch between the objectives of BO and VAE, resulting in poor extrapolation capabilities. In this paper, we propose novel contributions to enhance LSBO efficiency and overcome this challenge. We first introduce the concept of latent consistency/inconsistency as a crucial problem in LSBO, arising from the BO-VAE mismatch. To address this, we propose the Latent Consistent Aware-Acquisition Function (LCA-AF) that leverages consistent regions in LSBO. Additionally, we present LCA-VAE, a novel VAE method that generates a latent space with increased consistent points, improving BO's extrapolation capabilities. Combining LCA-VAE and LCA-AF, we develop LCA-LSBO. Experimental evaluations validate the improved performance of LCA-LSBO in image generation and de-novo chem",
    "link": "http://arxiv.org/abs/2302.02399",
    "context": "Title: Enhancing Exploration in Latent Space Bayesian Optimization. (arXiv:2302.02399v2 [cs.LG] UPDATED)\nAbstract: Latent Space Bayesian Optimization (LSBO) combines generative models, typically Variational Autoencoders (VAE), with Bayesian Optimization (BO) to generate de novo objects of interest. However, LSBO faces challenges due to the mismatch between the objectives of BO and VAE, resulting in poor extrapolation capabilities. In this paper, we propose novel contributions to enhance LSBO efficiency and overcome this challenge. We first introduce the concept of latent consistency/inconsistency as a crucial problem in LSBO, arising from the BO-VAE mismatch. To address this, we propose the Latent Consistent Aware-Acquisition Function (LCA-AF) that leverages consistent regions in LSBO. Additionally, we present LCA-VAE, a novel VAE method that generates a latent space with increased consistent points, improving BO's extrapolation capabilities. Combining LCA-VAE and LCA-AF, we develop LCA-LSBO. Experimental evaluations validate the improved performance of LCA-LSBO in image generation and de-novo chem",
    "path": "papers/23/02/2302.02399.json",
    "total_tokens": 1087,
    "translated_title": "增强潜空间贝叶斯优化中的探索能力",
    "translated_abstract": "潜空间贝叶斯优化（LSBO）将生成模型（通常是变分自编码器）与贝叶斯优化相结合，以生成感兴趣的全新对象。然而，由于贝叶斯优化和变分自编码器之间的目标不匹配，导致了LSBO面临挑战和推广能力的减弱。本文提出了增强LSBO效率并克服这一挑战的新思路。首先，我们引入了潜在的一致性和不一致性的概念，这是LSBO中一个关键的问题，起源于BO-VAE之间的不匹配。为了解决这个问题，我们提出了潜在的一致意识获取函数（LCA-AF），利用LSBO中的一致性区域。此外，我们提出了LCA-VAE，一种新的VAE方法，它生成具有增加的一致性点的潜空间，提高了BO的推广能力。结合LCA-VAE和LCA-AF，我们发展了LCA-LSBO。实验评估证实了LCA-LSBO在图像生成和全新的化学设计任务中的改进性能。",
    "tldr": "本文提出了一种新的方法来提高潜空间贝叶斯优化（LSBO）的探索能力。方法包括潜在一致性感知获取函数（LCA-AF）和增加一致性点的潜空间生成方法（LCA-VAE），将它们结合起来形成了LCA-LSBO。实验证明LCA-LSBO在图像生成和全新的化学设计任务中表现出改进的性能。",
    "en_tdlr": "This paper proposes a novel method to enhance exploration in Latent Space Bayesian Optimization (LSBO), which combines generative models with Bayesian Optimization to generate new objects of interest. The method includes the Latent Consistent Aware-Acquisition Function (LCA-AF) and a novel VAE method (LCA-VAE) that generates a latent space with increased consistent points to improve BO's extrapolation capabilities. Experimental results validate the improved performance of LCA-LSBO in image generation and de-novo chemical design tasks."
}