{
    "title": "CHGNet: Pretrained universal neural network potential for charge-informed atomistic modeling. (arXiv:2302.14231v2 [cond-mat.mtrl-sci] UPDATED)",
    "abstract": "The simulation of large-scale systems with complex electron interactions remains one of the greatest challenges for the atomistic modeling of materials. Although classical force fields often fail to describe the coupling between electronic states and ionic rearrangements, the more accurate \\textit{ab-initio} molecular dynamics suffers from computational complexity that prevents long-time and large-scale simulations, which are essential to study many technologically relevant phenomena, such as reactions, ion migrations, phase transformations, and degradation.  In this work, we present the Crystal Hamiltonian Graph neural Network (CHGNet) as a novel machine-learning interatomic potential (MLIP), using a graph-neural-network-based force field to model a universal potential energy surface. CHGNet is pretrained on the energies, forces, stresses, and magnetic moments from the Materials Project Trajectory Dataset, which consists of over 10 years of density functional theory static and relaxat",
    "link": "http://arxiv.org/abs/2302.14231",
    "context": "Title: CHGNet: Pretrained universal neural network potential for charge-informed atomistic modeling. (arXiv:2302.14231v2 [cond-mat.mtrl-sci] UPDATED)\nAbstract: The simulation of large-scale systems with complex electron interactions remains one of the greatest challenges for the atomistic modeling of materials. Although classical force fields often fail to describe the coupling between electronic states and ionic rearrangements, the more accurate \\textit{ab-initio} molecular dynamics suffers from computational complexity that prevents long-time and large-scale simulations, which are essential to study many technologically relevant phenomena, such as reactions, ion migrations, phase transformations, and degradation.  In this work, we present the Crystal Hamiltonian Graph neural Network (CHGNet) as a novel machine-learning interatomic potential (MLIP), using a graph-neural-network-based force field to model a universal potential energy surface. CHGNet is pretrained on the energies, forces, stresses, and magnetic moments from the Materials Project Trajectory Dataset, which consists of over 10 years of density functional theory static and relaxat",
    "path": "papers/23/02/2302.14231.json",
    "total_tokens": 1231,
    "translated_title": "CHGNet：用于带电原子建模的预训练通用神经网络势",
    "translated_abstract": "复杂的电子相互作用大规模系统的模拟仍然是材料原子建模中最大的挑战之一。尽管经典力场通常无法描述电子状态和离子重排之间的耦合，但更准确的从头分子动力学由于计算复杂性而无法进行长时间和大规模的模拟，这对于研究许多技术相关现象非常重要，例如反应、离子迁移、相变和降解。在本文中，我们提出了Crystal Hamiltonian Graph神经网络（CHGNet）作为一种新的机器学习相互作用势（MLIP），使用基于图神经网络的力场来建模通用的势能面。 CHGNet以材料项目轨迹数据集中的能量、力、应力和磁矩为先验进行预训练，该数据集由超过10年的密度泛函理论静态和松弛计算组成，涵盖了超过86,000种材料，并因此能够准确预测不同化学组成和晶体结构的各种材料的属性。重要的是，CHGNet还将电荷信息并入原子表示中，使得描述带电系统中的复杂电子相互作用成为可能。我们通过将其应用于几个模型系统的相稳定性、表面松弛和表面分离的预测，并将其精度和效率与其他MLIP进行比较，展示了CHGNet的多功能性。我们的结果表明，CHGNet是用于带电原子建模的有希望的工具，可以加速新材料的设计和发现。",
    "tldr": "CHGNet是一种预训练的通用神经网络势，能够准确预测不同化学组成和晶体结构的各种材料的属性，并且将电荷信息并入原子表示中，能够用于描述带电系统中的复杂电子相互作用。",
    "en_tdlr": "CHGNet is a pre-trained universal neural network potential that can accurately predict the properties of diverse materials with various chemical compositions and crystal structures, and incorporate charge information into the atomic representation to enable the description of complex electronic interactions in charged systems."
}