{
    "title": "normflows: A PyTorch Package for Normalizing Flows. (arXiv:2302.12014v2 [cs.LG] UPDATED)",
    "abstract": "Normalizing flows model probability distributions through an expressive tractable density. They transform a simple base distribution, such as a Gaussian, through a sequence of invertible functions, which are referred to as layers. These layers typically use neural networks to become very expressive. Flows are ubiquitous in machine learning and have been applied to image generation, text modeling, variational inference, approximating Boltzmann distributions, and many other problems. Here, we present normflows, a Python package for normalizing flows. It allows to build normalizing flow models from a suite of base distributions, flow layers, and neural networks. The package is implemented in the popular deep learning framework PyTorch, which simplifies the integration of flows in larger machine learning models or pipelines. It supports most of the common normalizing flow architectures, such as Real NVP, Glow, Masked Autoregressive Flows, Neural Spline Flows, Residual Flows, and many more.",
    "link": "http://arxiv.org/abs/2302.12014",
    "context": "Title: normflows: A PyTorch Package for Normalizing Flows. (arXiv:2302.12014v2 [cs.LG] UPDATED)\nAbstract: Normalizing flows model probability distributions through an expressive tractable density. They transform a simple base distribution, such as a Gaussian, through a sequence of invertible functions, which are referred to as layers. These layers typically use neural networks to become very expressive. Flows are ubiquitous in machine learning and have been applied to image generation, text modeling, variational inference, approximating Boltzmann distributions, and many other problems. Here, we present normflows, a Python package for normalizing flows. It allows to build normalizing flow models from a suite of base distributions, flow layers, and neural networks. The package is implemented in the popular deep learning framework PyTorch, which simplifies the integration of flows in larger machine learning models or pipelines. It supports most of the common normalizing flow architectures, such as Real NVP, Glow, Masked Autoregressive Flows, Neural Spline Flows, Residual Flows, and many more.",
    "path": "papers/23/02/2302.12014.json",
    "total_tokens": 902,
    "translated_title": "normflows：一种用于正则化流的PyTorch包",
    "translated_abstract": "正则化流通过一个可表达的可解密度来建模概率分布。它们通过一系列可逆函数（称为图层）将简单的基础分布（如高斯分布）转换。这些图层通常使用神经网络进行实现，使它们具有很高的表达能力。正则化流在机器学习中无处不在，并已应用于图像生成、文本建模、变分推断、逼近玻尔兹曼分布等众多问题上。在本文中，我们提出了normflows，这是一个用于正则化流的Python包。它允许从一系列基本分布、流层和神经网络构建正则化流模型。该包采用了广受欢迎的深度学习框架PyTorch实现，这使得将流集成到更大的机器学习模型或流水线中变得更简单。它支持大部分常见的正则化流架构，如Real NVP、Glow、Masked Autoregressive Flows、Neural Spline Flows、Residual Flows等。",
    "tldr": "normflows是一个用于正则化流的PyTorch包，它允许使用基本分布、流层和神经网络构建正则化流模型，以建模概率分布。它在机器学习领域中应用广泛。",
    "en_tdlr": "normflows is a PyTorch package for normalizing flows, allowing the construction of normalizing flow models using base distributions, flow layers, and neural networks to model probability distributions. It is widely used in machine learning."
}