{
    "title": "Participatory Personalization in Classification. (arXiv:2302.03874v2 [cs.LG] UPDATED)",
    "abstract": "Machine learning models are often personalized with information that is protected, sensitive, self-reported, or costly to acquire. These models use information about people but do not facilitate nor inform their consent. Individuals cannot opt out of reporting personal information to a model, nor tell if they benefit from personalization in the first place. We introduce a family of classification models, called participatory systems, that let individuals opt into personalization at prediction time. We present a model-agnostic algorithm to learn participatory systems for personalization with categorical group attributes. We conduct a comprehensive empirical study of participatory systems in clinical prediction tasks, benchmarking them with common approaches for personalization and imputation. Our results demonstrate that participatory systems can facilitate and inform consent while improving performance and data use across all groups who report personal data.",
    "link": "http://arxiv.org/abs/2302.03874",
    "context": "Title: Participatory Personalization in Classification. (arXiv:2302.03874v2 [cs.LG] UPDATED)\nAbstract: Machine learning models are often personalized with information that is protected, sensitive, self-reported, or costly to acquire. These models use information about people but do not facilitate nor inform their consent. Individuals cannot opt out of reporting personal information to a model, nor tell if they benefit from personalization in the first place. We introduce a family of classification models, called participatory systems, that let individuals opt into personalization at prediction time. We present a model-agnostic algorithm to learn participatory systems for personalization with categorical group attributes. We conduct a comprehensive empirical study of participatory systems in clinical prediction tasks, benchmarking them with common approaches for personalization and imputation. Our results demonstrate that participatory systems can facilitate and inform consent while improving performance and data use across all groups who report personal data.",
    "path": "papers/23/02/2302.03874.json",
    "total_tokens": 769,
    "translated_title": "分类中的参与个性化",
    "translated_abstract": "机器学习模型通常使用受保护的、敏感的、自报告的或昂贵的信息进行个性化。这些模型使用关于人的信息，但不促进也不告知他们的同意。个体不能选择不将个人信息报告给模型，也无法确定他们是否从个性化中受益。我们引入了一类名为参与性系统的分类模型，在预测时允许个体选择个性化。我们提出了一个模型无关的算法来学习用于个性化的参与性系统，其中包含分类组属性。我们在临床预测任务中进行了全面的实证研究，将参与性系统与常用的个性化和补全方法进行了基准测试。我们的结果表明，参与性系统可以促进和知情同意，并在所有报告个人数据的群体中提高性能和数据使用。",
    "tldr": "本研究引入了一类名为参与性系统的分类模型，允许个体在预测时选择个性化，从而促进并知情同意、提高性能和数据使用。"
}