{
    "title": "Out of Sample Predictability in Predictive Regressions with Many Predictor Candidates. (arXiv:2302.02866v2 [econ.EM] UPDATED)",
    "abstract": "This paper is concerned with detecting the presence of out of sample predictability in linear predictive regressions with a potentially large set of candidate predictors. We propose a procedure based on out of sample MSE comparisons that is implemented in a pairwise manner using one predictor at a time and resulting in an aggregate test statistic that is standard normally distributed under the global null hypothesis of no linear predictability. Predictors can be highly persistent, purely stationary or a combination of both. Upon rejection of the null hypothesis we subsequently introduce a predictor screening procedure designed to identify the most active predictors. An empirical application to key predictors of US economic activity illustrates the usefulness of our methods and highlights the important forward looking role played by the series of manufacturing new orders.",
    "link": "http://arxiv.org/abs/2302.02866",
    "context": "Title: Out of Sample Predictability in Predictive Regressions with Many Predictor Candidates. (arXiv:2302.02866v2 [econ.EM] UPDATED)\nAbstract: This paper is concerned with detecting the presence of out of sample predictability in linear predictive regressions with a potentially large set of candidate predictors. We propose a procedure based on out of sample MSE comparisons that is implemented in a pairwise manner using one predictor at a time and resulting in an aggregate test statistic that is standard normally distributed under the global null hypothesis of no linear predictability. Predictors can be highly persistent, purely stationary or a combination of both. Upon rejection of the null hypothesis we subsequently introduce a predictor screening procedure designed to identify the most active predictors. An empirical application to key predictors of US economic activity illustrates the usefulness of our methods and highlights the important forward looking role played by the series of manufacturing new orders.",
    "path": "papers/23/02/2302.02866.json",
    "total_tokens": 860,
    "translated_title": "多候选预测因子的预测回归中的样本外可预测性",
    "translated_abstract": "本文研究了在线性预测回归中检测具有潜在大量候选预测因子的样本外可预测性。我们提出了一种基于样本外均方误差比较的程序，以逐对方式使用一个预测因子，得到一个标准正态分布的总体零假设下的聚合检验统计量，用于判断是否存在线性可预测性。预测因子可以高度持久、纯粹平稳或两者兼而有之。在拒绝零假设后，我们随后引入了一种预测因子筛选程序，旨在识别最活跃的预测因子。对美国经济活动主要预测因子的实证应用证明了我们方法的有用性，并突出了制造业新订单系列在前瞻性中所起的重要作用。",
    "tldr": "本文研究了在线性预测回归中如何检测具有大量候选预测因子的样本外可预测性，并提出了一种逐对比较的程序和预测因子筛选方法。通过对美国经济活动的实证应用，证明了制造业新订单系列在前瞻性中的重要作用。",
    "en_tdlr": "This paper examines the out of sample predictability in linear predictive regressions with a large set of candidate predictors, and proposes a pairwise procedure and predictor screening method. The empirical application on key predictors of US economic activity highlights the important role played by the series of manufacturing new orders in forecasting."
}