{
    "title": "Rather First in a Village than Second in Rome? The Effect of Students' Class Rank in Primary School on Subsequent Academic Achievements. (arXiv:2302.10026v2 [econ.GN] UPDATED)",
    "abstract": "Using panel data on Italian students from 2013 to 2019, we compare the effect of a student's class rank to the effect of class quality in primary school on subsequent academic outcomes. We propose a new strategy to identify the impact of rank while controlling for peer effects, by leveraging grades on class exams to construct the rank, and grades on national standardized tests to control for students' ability. Ranking first in primary school compared to last results in an improvement of 8.1 percentiles in the national standardized test grade distribution in middle school and 7.6 percentiles in high school. Despite the sizable impact of rank, our analysis highlights that a one standard deviation increase in class quality is five-fold greater than a similar increase in rank. Finally, using an extensive student survey, we establish that the rank effect is channeled through sorting into better high schools and psychological mechanisms.",
    "link": "http://arxiv.org/abs/2302.10026",
    "context": "Title: Rather First in a Village than Second in Rome? The Effect of Students' Class Rank in Primary School on Subsequent Academic Achievements. (arXiv:2302.10026v2 [econ.GN] UPDATED)\nAbstract: Using panel data on Italian students from 2013 to 2019, we compare the effect of a student's class rank to the effect of class quality in primary school on subsequent academic outcomes. We propose a new strategy to identify the impact of rank while controlling for peer effects, by leveraging grades on class exams to construct the rank, and grades on national standardized tests to control for students' ability. Ranking first in primary school compared to last results in an improvement of 8.1 percentiles in the national standardized test grade distribution in middle school and 7.6 percentiles in high school. Despite the sizable impact of rank, our analysis highlights that a one standard deviation increase in class quality is five-fold greater than a similar increase in rank. Finally, using an extensive student survey, we establish that the rank effect is channeled through sorting into better high schools and psychological mechanisms.",
    "path": "papers/23/02/2302.10026.json",
    "total_tokens": 913,
    "translated_title": "在村里当第一还是在罗马当第二？小学时学生的班级排名对后来的学业成就的影响。",
    "translated_abstract": "本文利用2013年至2019年间意大利学生的面板数据，比较了小学阶段学生的班级排名与班级质量对后续学业成果的影响。我们提出了一种新策略来确定排名的影响，同时控制同伴影响，即利用班级考试的成绩构建排名，并利用全国标准化考试的成绩来控制学生的能力。在小学时排名第一与最后相比，会使中学的全国标准化考试成绩分布提高8.1个百分点，高中提高7.6个百分点。尽管排名的影响很大，但我们的分析还强调了，班级质量一个标准差的提高对学业的影响是排名的五倍。最后，通过一项广泛的学生调查，我们确定了排名的影响是通过进入更好的高中和心理机制来发挥作用的。",
    "tldr": "本文研究了小学时学生的班级排名和班级质量对后续学业成果的影响，结果表明，排名对学生成绩的影响很大；与班级质量相比，班级排名的影响较小。",
    "en_tdlr": "This paper examines the effect of students' class rank and class quality in primary school on subsequent academic performance, showing that ranking has a considerable impact on students' grades, but the effect is smaller than that of class quality."
}