{
    "title": "Variable Selection for Kernel Two-Sample Tests. (arXiv:2302.07415v2 [stat.ML] UPDATED)",
    "abstract": "We consider the variable selection problem for two-sample tests, aiming to select the most informative variables to distinguish samples from two groups. To solve this problem, we propose a framework based on the kernel maximum mean discrepancy (MMD). Our approach seeks a group of variables with a pre-specified size that maximizes the variance-regularized MMD statistics. This formulation also corresponds to the minimization of asymptotic type-II error while controlling type-I error, as studied in the literature. We present mixed-integer programming formulations and offer exact and approximation algorithms with performance guarantees for linear and quadratic types of kernel functions. Experimental results demonstrate the superior performance of our framework.",
    "link": "http://arxiv.org/abs/2302.07415",
    "context": "Title: Variable Selection for Kernel Two-Sample Tests. (arXiv:2302.07415v2 [stat.ML] UPDATED)\nAbstract: We consider the variable selection problem for two-sample tests, aiming to select the most informative variables to distinguish samples from two groups. To solve this problem, we propose a framework based on the kernel maximum mean discrepancy (MMD). Our approach seeks a group of variables with a pre-specified size that maximizes the variance-regularized MMD statistics. This formulation also corresponds to the minimization of asymptotic type-II error while controlling type-I error, as studied in the literature. We present mixed-integer programming formulations and offer exact and approximation algorithms with performance guarantees for linear and quadratic types of kernel functions. Experimental results demonstrate the superior performance of our framework.",
    "path": "papers/23/02/2302.07415.json",
    "total_tokens": 756,
    "translated_title": "变量选择在核双样本检验中的应用",
    "translated_abstract": "本文考虑了两样本检验中的变量选择问题，旨在选择区分两组样本的最有信息变量。为了解决该问题，我们提出了一种基于核最大均值差异（MMD）的框架。我们的方法寻求一组变量，其预先确定的大小最大化方差正则化的MMD统计量。这种计算形式也对应于在文献中研究的控制类型I错误的同时最小化异质类型II错误。我们介绍了混合整数编程公式，并提供了线性和二次类型内核函数的精确和近似算法，并具有性能保证。实验结果证明了我们的框架的卓越性能。",
    "tldr": "本文提出了一种解决双样本检验中变量选择问题的框架，利用核最大均值差异统计量，以最大化方差正则化的MMD统计量。实验结果证明其超群表现。",
    "en_tdlr": "This paper proposes a framework for variable selection in two-sample tests using the kernel maximum mean discrepancy (MMD) to maximize the variance-regularized MMD statistics. The mixed-integer programming formulations and exact/approximation algorithms with performance guarantees for linear and quadratic types of kernel functions are also provided. Experimental results demonstrate superior performance."
}