{
    "title": "End-to-End Full-Atom Antibody Design. (arXiv:2302.00203v3 [q-bio.BM] UPDATED)",
    "abstract": "Antibody design is an essential yet challenging task in various domains like therapeutics and biology. There are two major defects in current learning-based methods: 1) tackling only a certain subtask of the whole antibody design pipeline, making them suboptimal or resource-intensive. 2) omitting either the framework regions or side chains, thus incapable of capturing the full-atom geometry. To address these pitfalls, we propose dynamic Multi-channel Equivariant grAph Network (dyMEAN), an end-to-end full-atom model for E(3)-equivariant antibody design given the epitope and the incomplete sequence of the antibody. Specifically, we first explore structural initialization as a knowledgeable guess of the antibody structure and then propose shadow paratope to bridge the epitope-antibody connections. Both 1D sequences and 3D structures are updated via an adaptive multi-channel equivariant encoder that is able to process protein residues of variable sizes when considering full atoms. Finally,",
    "link": "http://arxiv.org/abs/2302.00203",
    "context": "Title: End-to-End Full-Atom Antibody Design. (arXiv:2302.00203v3 [q-bio.BM] UPDATED)\nAbstract: Antibody design is an essential yet challenging task in various domains like therapeutics and biology. There are two major defects in current learning-based methods: 1) tackling only a certain subtask of the whole antibody design pipeline, making them suboptimal or resource-intensive. 2) omitting either the framework regions or side chains, thus incapable of capturing the full-atom geometry. To address these pitfalls, we propose dynamic Multi-channel Equivariant grAph Network (dyMEAN), an end-to-end full-atom model for E(3)-equivariant antibody design given the epitope and the incomplete sequence of the antibody. Specifically, we first explore structural initialization as a knowledgeable guess of the antibody structure and then propose shadow paratope to bridge the epitope-antibody connections. Both 1D sequences and 3D structures are updated via an adaptive multi-channel equivariant encoder that is able to process protein residues of variable sizes when considering full atoms. Finally,",
    "path": "papers/23/02/2302.00203.json",
    "total_tokens": 1019,
    "translated_title": "端到端全原子抗体设计",
    "translated_abstract": "抗体设计是药物治疗和生物学等领域中一个重要且具有挑战性的任务。当前的基于学习的方法有两个主要缺陷：1）只处理整个抗体设计流程中的某个子任务，使其次优或资源密集。2）忽略框架区域或侧链中的任一部分，因此无法捕捉全原子几何形状。为解决这些问题，我们提出了动态多通道等变图神经网络（dyMEAN），这是一个端到端全原子模型，用于根据表位和不完整的抗体序列进行 E（3）等变抗体设计。具体来说，我们首先探究结构初始化作为抗体结构的有知识猜测，然后提出影响表位-抗体相互作用的“shadow paratope”。通过自适应多通道等变编码器来更新1D序列和3D结构，该编码器可在考虑全原子时处理可变大小的蛋白残基。最后，我们证明了dyMEAN在多个基准测试中的有效性，这为完全自动化的抗体设计提供了新的可能性。",
    "tldr": "dyMEAN是一个端到端全原子模型，可以根据表位和不完整的抗体序列进行抗体设计，在处理全原子时能够处理可变大小的蛋白残基。旨在解决现有学习方法的两个主要问题：只处理抗体设计过程中的某个子任务和无法捕捉全原子几何形状。",
    "en_tdlr": "dyMEAN is an end-to-end full-atom model for antibody design that can process variable protein residues when considering full atoms, given the epitope and incomplete antibody sequence. It addresses the two major issues in current learning-based methods of only dealing with a certain subtask and not being able to capture full-atom geometry. Its effectiveness has been demonstrated in multiple benchmark tests, providing new possibilities for fully automated antibody design."
}