{
    "title": "Linear Optimal Partial Transport Embedding. (arXiv:2302.03232v3 [cs.LG] UPDATED)",
    "abstract": "Optimal transport (OT) has gained popularity due to its various applications in fields such as machine learning, statistics, and signal processing. However, the balanced mass requirement limits its performance in practical problems. To address these limitations, variants of the OT problem, including unbalanced OT, Optimal partial transport (OPT), and Hellinger Kantorovich (HK), have been proposed. In this paper, we propose the Linear optimal partial transport (LOPT) embedding, which extends the (local) linearization technique on OT and HK to the OPT problem. The proposed embedding allows for faster computation of OPT distance between pairs of positive measures. Besides our theoretical contributions, we demonstrate the LOPT embedding technique in point-cloud interpolation and PCA analysis.",
    "link": "http://arxiv.org/abs/2302.03232",
    "context": "Title: Linear Optimal Partial Transport Embedding. (arXiv:2302.03232v3 [cs.LG] UPDATED)\nAbstract: Optimal transport (OT) has gained popularity due to its various applications in fields such as machine learning, statistics, and signal processing. However, the balanced mass requirement limits its performance in practical problems. To address these limitations, variants of the OT problem, including unbalanced OT, Optimal partial transport (OPT), and Hellinger Kantorovich (HK), have been proposed. In this paper, we propose the Linear optimal partial transport (LOPT) embedding, which extends the (local) linearization technique on OT and HK to the OPT problem. The proposed embedding allows for faster computation of OPT distance between pairs of positive measures. Besides our theoretical contributions, we demonstrate the LOPT embedding technique in point-cloud interpolation and PCA analysis.",
    "path": "papers/23/02/2302.03232.json",
    "total_tokens": 828,
    "translated_title": "线性最优偏移嵌入",
    "translated_abstract": "最优传输（OT）由于在机器学习、统计学和信号处理等领域中的广泛应用而变得越来越受欢迎。然而，平衡质量限制了它在实际问题中的性能。为了解决这些问题，已经提出了OT问题的变体，包括不平衡OT，最优偏移传输（OPT）和Hellinger Kantorovich（HK）。在本文中，我们提出了线性最优偏移（LOPT）嵌入技术，它将OT和HK上的（局部）线性化技术扩展到OPT问题上。所提出的嵌入技术提高了正测度对之间的LOPT距离的计算速度。除了我们的理论贡献，我们还展示了LOPT嵌入技术在点云内插和PCA分析中的应用。",
    "tldr": "本文提出了线性最优偏移嵌入技术（LOPT），它扩展了（局部）线性化技术到OPT问题上，提高了正测度对之间的计算速度。并且在点云内插和PCA分析中进行了应用。",
    "en_tdlr": "This paper proposes the Linear Optimal Partial Transport (LOPT) embedding technique, which extends the (local) linearization technique on Optimal Transport (OT) and Hellinger Kantorovich (HK) to the Optimal Partial Transport (OPT) problem, improving the computation speed of OPT distance between pairs of positive measures. The LOPT embedding technique is demonstrated in point-cloud interpolation and PCA analysis."
}