{
    "title": "Defensive ML: Defending Architectural Side-channels with Adversarial Obfuscation. (arXiv:2302.01474v2 [cs.CR] UPDATED)",
    "abstract": "Side-channel attacks that use machine learning (ML) for signal analysis have become prominent threats to computer security, as ML models easily find patterns in signals. To address this problem, this paper explores using Adversarial Machine Learning (AML) methods as a defense at the computer architecture layer to obfuscate side channels. We call this approach Defensive ML, and the generator to obfuscate signals, defender. Defensive ML is a workflow to design, implement, train, and deploy defenders for different environments. First, we design a defender architecture given the physical characteristics and hardware constraints of the side-channel. Next, we use our DefenderGAN structure to train the defender. Finally, we apply defensive ML to thwart two side-channel attacks: one based on memory contention and the other on application power. The former uses a hardware defender with ns-level response time that attains a high level of security with half the performance impact of a traditional",
    "link": "http://arxiv.org/abs/2302.01474",
    "context": "Title: Defensive ML: Defending Architectural Side-channels with Adversarial Obfuscation. (arXiv:2302.01474v2 [cs.CR] UPDATED)\nAbstract: Side-channel attacks that use machine learning (ML) for signal analysis have become prominent threats to computer security, as ML models easily find patterns in signals. To address this problem, this paper explores using Adversarial Machine Learning (AML) methods as a defense at the computer architecture layer to obfuscate side channels. We call this approach Defensive ML, and the generator to obfuscate signals, defender. Defensive ML is a workflow to design, implement, train, and deploy defenders for different environments. First, we design a defender architecture given the physical characteristics and hardware constraints of the side-channel. Next, we use our DefenderGAN structure to train the defender. Finally, we apply defensive ML to thwart two side-channel attacks: one based on memory contention and the other on application power. The former uses a hardware defender with ns-level response time that attains a high level of security with half the performance impact of a traditional",
    "path": "papers/23/02/2302.01474.json",
    "total_tokens": 998,
    "translated_title": "防御性机器学习：用对抗性混淆来抵御架构侧信道攻击",
    "translated_abstract": "使用机器学习（ML）进行信号分析的侧信道攻击已经成为计算机安全的突出威胁，因为ML模型很容易找到信号中的模式。为了解决这个问题，本文探讨了在计算机架构层面上使用对抗性机器学习（AML）方法来对抗性侧信道的混淆。我们将这种方法称为防御性机器学习，将信号的混淆器称为防御器。防御性机器学习是一个工作流程，用于为不同环境设计、实现、训练和部署防御器。首先，我们根据侧信道的物理特性和硬件限制设计了一个防御器架构。接下来，我们使用我们的DefenderGAN结构来训练防御器。最后，我们应用防御性机器学习来阻止两种侧信道攻击：一种基于内存争用，另一种基于应用程序功耗。前者使用具有纳秒级响应时间的硬件防御器，以半正常性能影响获得较高的安全性。",
    "tldr": "本论文提出了一种防御性机器学习的方法，通过对抗性混淆来抵御计算机架构中的侧信道攻击。该方法可以设计、实现、训练和部署不同环境下的防御器，有效解决了使用机器学习进行信号分析的安全威胁。",
    "en_tdlr": "This paper proposes a defensive machine learning approach to mitigate side-channel attacks in computer architecture, using adversarial obfuscation. The method enables the design, implementation, training, and deployment of defenders in different environments, effectively addressing the security threat posed by machine learning-based signal analysis."
}