{
    "title": "A critical look at the evaluation of GNNs under heterophily: Are we really making progress?",
    "abstract": "arXiv:2302.11640v2 Announce Type: replace  Abstract: Node classification is a classical graph machine learning task on which Graph Neural Networks (GNNs) have recently achieved strong results. However, it is often believed that standard GNNs only work well for homophilous graphs, i.e., graphs where edges tend to connect nodes of the same class. Graphs without this property are called heterophilous, and it is typically assumed that specialized methods are required to achieve strong performance on such graphs. In this work, we challenge this assumption. First, we show that the standard datasets used for evaluating heterophily-specific models have serious drawbacks, making results obtained by using them unreliable. The most significant of these drawbacks is the presence of a large number of duplicate nodes in the datasets Squirrel and Chameleon, which leads to train-test data leakage. We show that removing duplicate nodes strongly affects GNN performance on these datasets. Then, we propos",
    "link": "https://arxiv.org/abs/2302.11640",
    "context": "Title: A critical look at the evaluation of GNNs under heterophily: Are we really making progress?\nAbstract: arXiv:2302.11640v2 Announce Type: replace  Abstract: Node classification is a classical graph machine learning task on which Graph Neural Networks (GNNs) have recently achieved strong results. However, it is often believed that standard GNNs only work well for homophilous graphs, i.e., graphs where edges tend to connect nodes of the same class. Graphs without this property are called heterophilous, and it is typically assumed that specialized methods are required to achieve strong performance on such graphs. In this work, we challenge this assumption. First, we show that the standard datasets used for evaluating heterophily-specific models have serious drawbacks, making results obtained by using them unreliable. The most significant of these drawbacks is the presence of a large number of duplicate nodes in the datasets Squirrel and Chameleon, which leads to train-test data leakage. We show that removing duplicate nodes strongly affects GNN performance on these datasets. Then, we propos",
    "path": "papers/23/02/2302.11640.json",
    "total_tokens": 847,
    "translated_title": "对异质性条件下GNN评估的批判性研究：我们真的在取得进展吗？",
    "translated_abstract": "节点分类是一种经典的图机器学习任务，最近图神经网络（GNNs）在这方面取得了很好的成绩。然而，人们通常认为标准GNNs只对同质图表现良好，即边倾向于连接相同类别的节点的图。没有这种属性的图称为异质图，通常认为需要专门的方法才能在这种图上获得很强的性能。在这项工作中，我们挑战了这一假设。首先，我们展示了用于评估异质性特定模型的标准数据集具有严重缺陷，使得使用它们获得的结果不可靠。这些缺陷中最重要的是数据集Squirrel和Chameleon中存在大量重复节点，导致训练-测试数据泄漏。我们表明，在这些数据集上移除重复节点会严重影响GNN的性能。",
    "tldr": "挑战了异质图上特定模型评估的假设，揭示了标准数据集存在严重缺陷，移除重复节点对GNN性能有重大影响"
}