{
    "title": "adSformers: Personalization from Short-Term Sequences and Diversity of Representations in Etsy Ads. (arXiv:2302.01255v2 [cs.LG] UPDATED)",
    "abstract": "In this article, we present a general approach to personalizing ads through encoding and learning from variable-length sequences of recent user actions and diverse representations. To this end we introduce a three-component module called the adSformer diversifiable personalization module (ADPM) that learns a dynamic user representation. We illustrate the module's effectiveness and flexibility by personalizing the Click-Through Rate (CTR) and Post-Click Conversion Rate (PCCVR) models used in sponsored search. The first component of the ADPM, the adSformer encoder, includes a novel adSformer block which learns the most salient sequence signals. ADPM's second component enriches the learned signal through visual, multimodal, and other pretrained representations. Lastly, the third ADPM \"learned on the fly\" component further diversifies the signal encoded in the dynamic user representation. The ADPM-personalized CTR and PCCVR models, henceforth referred to as adSformer CTR and adSformer PCCV",
    "link": "http://arxiv.org/abs/2302.01255",
    "context": "Title: adSformers: Personalization from Short-Term Sequences and Diversity of Representations in Etsy Ads. (arXiv:2302.01255v2 [cs.LG] UPDATED)\nAbstract: In this article, we present a general approach to personalizing ads through encoding and learning from variable-length sequences of recent user actions and diverse representations. To this end we introduce a three-component module called the adSformer diversifiable personalization module (ADPM) that learns a dynamic user representation. We illustrate the module's effectiveness and flexibility by personalizing the Click-Through Rate (CTR) and Post-Click Conversion Rate (PCCVR) models used in sponsored search. The first component of the ADPM, the adSformer encoder, includes a novel adSformer block which learns the most salient sequence signals. ADPM's second component enriches the learned signal through visual, multimodal, and other pretrained representations. Lastly, the third ADPM \"learned on the fly\" component further diversifies the signal encoded in the dynamic user representation. The ADPM-personalized CTR and PCCVR models, henceforth referred to as adSformer CTR and adSformer PCCV",
    "path": "papers/23/02/2302.01255.json",
    "total_tokens": 1049,
    "tldr": "本文介绍了一种个性化广告的通用方法，通过编码和学习最近用户行为的可变长度序列和采用多样化表示，并使用adSformer diversifiable personalization module（ADPM）进行实现。ADPM的三个组件分别为adSformer编码器、丰富学习信号的第二个组件和进一步多样化编码的第三个组件。模块的灵活性和有效性通过个性化用于赞助搜索的CTR和PCCVR模型的表现得到展示。",
    "en_tdlr": "This article presents a general approach to personalize ads through encoding and learning from variable-length sequences of recent user actions and diverse representations, using the adSformer diversifiable personalization module (ADPM) which learns a dynamic user representation. The ADPM consists of three components: adSformer encoder, which learns the most salient sequence signals, enrichment of learned signals through visual, multimodal, and other pretrained representations in the second component, and further diversification of encoded signals in the third component. The module's flexibility and effectiveness are demonstrated through personalizing the Click-Through Rate (CTR) and Post-Click Conversion Rate (PCCVR) models used in sponsored search."
}