{
    "title": "You Only Transfer What You Share: Intersection-Induced Graph Transfer Learning for Link Prediction. (arXiv:2302.14189v2 [cs.LG] UPDATED)",
    "abstract": "Link prediction is central to many real-world applications, but its performance may be hampered when the graph of interest is sparse. To alleviate issues caused by sparsity, we investigate a previously overlooked phenomenon: in many cases, a densely connected, complementary graph can be found for the original graph. The denser graph may share nodes with the original graph, which offers a natural bridge for transferring selective, meaningful knowledge. We identify this setting as Graph Intersection-induced Transfer Learning (GITL), which is motivated by practical applications in e-commerce or academic co-authorship predictions. We develop a framework to effectively leverage the structural prior in this setting. We first create an intersection subgraph using the shared nodes between the two graphs, then transfer knowledge from the source-enriched intersection subgraph to the full target graph. In the second step, we consider two approaches: a modified label propagation, and a multi-layer",
    "link": "http://arxiv.org/abs/2302.14189",
    "context": "Title: You Only Transfer What You Share: Intersection-Induced Graph Transfer Learning for Link Prediction. (arXiv:2302.14189v2 [cs.LG] UPDATED)\nAbstract: Link prediction is central to many real-world applications, but its performance may be hampered when the graph of interest is sparse. To alleviate issues caused by sparsity, we investigate a previously overlooked phenomenon: in many cases, a densely connected, complementary graph can be found for the original graph. The denser graph may share nodes with the original graph, which offers a natural bridge for transferring selective, meaningful knowledge. We identify this setting as Graph Intersection-induced Transfer Learning (GITL), which is motivated by practical applications in e-commerce or academic co-authorship predictions. We develop a framework to effectively leverage the structural prior in this setting. We first create an intersection subgraph using the shared nodes between the two graphs, then transfer knowledge from the source-enriched intersection subgraph to the full target graph. In the second step, we consider two approaches: a modified label propagation, and a multi-layer",
    "path": "papers/23/02/2302.14189.json",
    "total_tokens": 997,
    "translated_title": "你只转移你分享的内容：基于交集的图传递学习在链接预测中的应用",
    "translated_abstract": "链接预测是许多实际应用的核心，但当目标图非常稀疏时，预测的性能可能会受到影响。为了解决稀疏图造成的问题，我们研究了一个之前被忽视的现象：在许多情况下，原始图形可能会有一个密集相连、互补的图形。这个密集的图形可能会与原始图形共享节点，从而提供了一个将有意义的选择性知识转移的自然桥梁。我们将这种情况称为基于交集的图传递学习(GITL)，它受到了电子商务或学术合著预测等实际应用的启发。我们开发了一个框架来有效地利用这种情况下的结构性先验知识。我们首先使用两个图之间共享的节点创建一个交集子图，然后将来自源丰富的交集子图的知识传递到完整的目标图上。在第二步中，我们考虑了两种方法：一种是改进的标签传播方法，另一种是多层次的传输学习方法。",
    "tldr": "本文提出了一种称为图交集-诱导图传递学习的方法，旨在解决稀疏图在链接预测中的问题。在此方法中，通过创建一个交集子图，在源图上训练模型并将知识传递到目标图上进行预测。",
    "en_tdlr": "This paper proposes a method called Graph Intersection-Induced Transfer Learning (GITL) to address the issue of sparse graphs in link prediction. In this method, a subgraph is created using shared nodes and knowledge is transferred from the source graph to the target graph for prediction. The approach involves training the model on the intersection subgraph and propagating the knowledge to the target graph using a modified label propagation or a multi-layer transfer learning method."
}