{
    "title": "FR3D: Three-dimensional Flow Reconstruction and Force Estimation for Unsteady Flows Around Extruded Bluff Bodies via Conformal Mapping Aided Convolutional Autoencoders. (arXiv:2302.01802v2 [physics.flu-dyn] UPDATED)",
    "abstract": "In many practical fluid dynamics experiments, measuring variables such as velocity and pressure is possible only at a limited number of sensor locations, \\textcolor{black}{for a few two-dimensional planes, or for a small 3D domain in the flow}. However, knowledge of the full fields is necessary to understand the dynamics of many flows. Deep learning reconstruction of full flow fields from sparse measurements has recently garnered significant research interest, as a way of overcoming this limitation. This task is referred to as the flow reconstruction (FR) task. In the present study, we propose a convolutional autoencoder based neural network model, dubbed FR3D, which enables FR to be carried out for three-dimensional flows around extruded 3D objects with different cross-sections. An innovative mapping approach, whereby multiple fluid domains are mapped to an annulus, enables FR3D to generalize its performance to objects not encountered during training. We conclusively demonstrate this ",
    "link": "http://arxiv.org/abs/2302.01802",
    "context": "Title: FR3D: Three-dimensional Flow Reconstruction and Force Estimation for Unsteady Flows Around Extruded Bluff Bodies via Conformal Mapping Aided Convolutional Autoencoders. (arXiv:2302.01802v2 [physics.flu-dyn] UPDATED)\nAbstract: In many practical fluid dynamics experiments, measuring variables such as velocity and pressure is possible only at a limited number of sensor locations, \\textcolor{black}{for a few two-dimensional planes, or for a small 3D domain in the flow}. However, knowledge of the full fields is necessary to understand the dynamics of many flows. Deep learning reconstruction of full flow fields from sparse measurements has recently garnered significant research interest, as a way of overcoming this limitation. This task is referred to as the flow reconstruction (FR) task. In the present study, we propose a convolutional autoencoder based neural network model, dubbed FR3D, which enables FR to be carried out for three-dimensional flows around extruded 3D objects with different cross-sections. An innovative mapping approach, whereby multiple fluid domains are mapped to an annulus, enables FR3D to generalize its performance to objects not encountered during training. We conclusively demonstrate this ",
    "path": "papers/23/02/2302.01802.json",
    "total_tokens": 933,
    "translated_title": "FR3D: 通过协助共形映射的卷积自动编码器进行三维流场重构和力估计的研究",
    "translated_abstract": "在许多实际流体动力学实验中，只能在有限数量的传感器位置测量速度和压力等变量，对于一些二维平面或小型三维流场，知道完整的场是理解许多流动动力学的必要条件。深度学习重构稀疏测量得出的完整流场近年来引起了重要研究兴趣，作为克服这种限制的一种方法，这一任务被称为流场重构（FR）任务。在本研究中，我们提出了一种基于卷积自动编码器的神经网络模型FR3D，能够对不同横截面的拉出式三维物体周围的三维流场进行FR。创新的映射方法将多个流体域映射到一个环状区域，使得FR3D能够将其性能推广到在训练期间未遇到的物体。我们明确证明了这一点。",
    "tldr": "本研究提出了一种名为FR3D的卷积自动编码器模型，可以通过共形映射实现对不同横截面的拉出式三维物体周围的三维流场进行重构和力估计。"
}