{
    "title": "A Comprehensive Survey on Graph Summarization with Graph Neural Networks. (arXiv:2302.06114v2 [cs.LG] UPDATED)",
    "abstract": "As large-scale graphs become more widespread, more and more computational challenges with extracting, processing, and interpreting large graph data are being exposed. It is therefore natural to search for ways to summarize these expansive graphs while preserving their key characteristics. In the past, most graph summarization techniques sought to capture the most important part of a graph statistically. However, today, the high dimensionality and complexity of modern graph data are making deep learning techniques more popular. Hence, this paper presents a comprehensive survey of progress in deep learning summarization techniques that rely on graph neural networks (GNNs). Our investigation includes a review of the current state-of-the-art approaches, including recurrent GNNs, convolutional GNNs, graph autoencoders, and graph attention networks. A new burgeoning line of research is also discussed where graph reinforcement learning is being used to evaluate and improve the quality of grap",
    "link": "http://arxiv.org/abs/2302.06114",
    "context": "Title: A Comprehensive Survey on Graph Summarization with Graph Neural Networks. (arXiv:2302.06114v2 [cs.LG] UPDATED)\nAbstract: As large-scale graphs become more widespread, more and more computational challenges with extracting, processing, and interpreting large graph data are being exposed. It is therefore natural to search for ways to summarize these expansive graphs while preserving their key characteristics. In the past, most graph summarization techniques sought to capture the most important part of a graph statistically. However, today, the high dimensionality and complexity of modern graph data are making deep learning techniques more popular. Hence, this paper presents a comprehensive survey of progress in deep learning summarization techniques that rely on graph neural networks (GNNs). Our investigation includes a review of the current state-of-the-art approaches, including recurrent GNNs, convolutional GNNs, graph autoencoders, and graph attention networks. A new burgeoning line of research is also discussed where graph reinforcement learning is being used to evaluate and improve the quality of grap",
    "path": "papers/23/02/2302.06114.json",
    "total_tokens": 903,
    "translated_title": "基于图神经网络的图形概括综述",
    "translated_abstract": "随着大规模图形的普及，越来越多的计算挑战暴露出来，需要提取、处理和解释大型图形数据。因此，寻找一种能够总结这些广阔图形的方法，同时保留其关键特征是自然而然的。过去，大多数图形概括技术旨在从统计学角度捕捉图形的最重要部分。然而，今天，现代图形数据的高维度和复杂性使得深度学习技术更加流行。因此，本文介绍了基于图神经网络(GNNs)的深度学习概括技术进展的综述。我们的调查包括对当前最先进方法的回顾，包括循环GNNs、卷积GNNs、图形自编码器和图形注意力网络。同时还讨论了一条新兴的研究方向，即使用图形强化学习来评估和改进图形质量。",
    "tldr": "本文综述了基于图神经网络的深度学习概括技术，在保留图形关键特征的同时，对大规模、高维度和复杂的现代图形数据进行处理的方法，包括图神经网络、图形自编码器等。",
    "en_tdlr": "This paper presents a comprehensive survey of deep learning summarization techniques that rely on graph neural networks (GNNs), including recurrent GNNs, convolutional GNNs, graph autoencoders, and graph attention networks, that summarize large, high-dimensional, and complex modern graph data while preserving their key characteristics."
}