{
    "title": "Balanced Audiovisual Dataset for Imbalance Analysis. (arXiv:2302.10912v2 [cs.LG] UPDATED)",
    "abstract": "The imbalance problem is widespread in the field of machine learning, which also exists in multimodal learning areas caused by the intrinsic discrepancy between modalities of samples. Recent works have attempted to solve the modality imbalance problem from algorithm perspective, however, they do not fully analyze the influence of modality bias in datasets. Concretely, existing multimodal datasets are usually collected under specific tasks, where one modality tends to perform better than other ones in most conditions. In this work, to comprehensively explore the influence of modality bias, we first split existing datasets into different subsets by estimating sample-wise modality discrepancy. We surprisingly find that: the multimodal models with existing imbalance algorithms consistently perform worse than the unimodal one on specific subsets, in accordance with the modality bias. To further explore the influence of modality bias and analyze the effectiveness of existing imbalance algori",
    "link": "http://arxiv.org/abs/2302.10912",
    "context": "Title: Balanced Audiovisual Dataset for Imbalance Analysis. (arXiv:2302.10912v2 [cs.LG] UPDATED)\nAbstract: The imbalance problem is widespread in the field of machine learning, which also exists in multimodal learning areas caused by the intrinsic discrepancy between modalities of samples. Recent works have attempted to solve the modality imbalance problem from algorithm perspective, however, they do not fully analyze the influence of modality bias in datasets. Concretely, existing multimodal datasets are usually collected under specific tasks, where one modality tends to perform better than other ones in most conditions. In this work, to comprehensively explore the influence of modality bias, we first split existing datasets into different subsets by estimating sample-wise modality discrepancy. We surprisingly find that: the multimodal models with existing imbalance algorithms consistently perform worse than the unimodal one on specific subsets, in accordance with the modality bias. To further explore the influence of modality bias and analyze the effectiveness of existing imbalance algori",
    "path": "papers/23/02/2302.10912.json",
    "total_tokens": 900,
    "translated_title": "平衡的音频视觉数据集用于不平衡分析",
    "translated_abstract": "不平衡问题在机器学习领域广泛存在，多模态学习领域也存在由于样本模态间固有差异导致的不平衡问题。近期的工作尝试从算法角度解决模态不平衡问题，然而，它们没有完全分析数据集中模态偏差所产生的影响。具体地说，现有的多模态数据集通常是针对特定任务收集的，其中一个模态在大多数情况下往往比其他模态表现更好。在本文中，为了全面探索模态偏差的影响，我们首先通过估计样本级模态差异将现有数据集分成不同的子集。我们惊奇地发现：存在不平衡算法的多模态模型在特定子集上的表现一直比单模态的差，与模态偏差相一致。为了进一步探索模态偏差的影响，分析现有不平衡算法的有效性，",
    "tldr": "本文通过估计样本级模态差异将现有数据集分成不同的子集并探索了模态偏差的影响。结果发现，存在不平衡算法的多模态模型在特定子集上的表现一直比单模态的差，与模态偏差相一致。",
    "en_tdlr": "This paper explores the influence of modality bias by splitting existing datasets into different subsets based on sample-wise modality discrepancy estimation. It is found that multimodal models with existing imbalance algorithms have consistently performed worse than unimodal models on specific subsets, in accordance with modality bias."
}