{
    "title": "FTM: A Frame-level Timeline Modeling Method for Temporal Graph Representation Learning. (arXiv:2302.11814v2 [cs.LG] UPDATED)",
    "abstract": "Learning representations for graph-structured data is essential for graph analytical tasks. While remarkable progress has been made on static graphs, researches on temporal graphs are still in its beginning stage. The bottleneck of the temporal graph representation learning approach is the neighborhood aggregation strategy, based on which graph attributes share and gather information explicitly. Existing neighborhood aggregation strategies fail to capture either the short-term features or the long-term features of temporal graph attributes, leading to unsatisfactory model performance and even poor robustness and domain generality of the representation learning method. To address this problem, we propose a Frame-level Timeline Modeling (FTM) method that helps to capture both short-term and long-term features and thus learns more informative representations on temporal graphs. In particular, we present a novel link-based framing technique to preserve the short-term features and then inco",
    "link": "http://arxiv.org/abs/2302.11814",
    "context": "Title: FTM: A Frame-level Timeline Modeling Method for Temporal Graph Representation Learning. (arXiv:2302.11814v2 [cs.LG] UPDATED)\nAbstract: Learning representations for graph-structured data is essential for graph analytical tasks. While remarkable progress has been made on static graphs, researches on temporal graphs are still in its beginning stage. The bottleneck of the temporal graph representation learning approach is the neighborhood aggregation strategy, based on which graph attributes share and gather information explicitly. Existing neighborhood aggregation strategies fail to capture either the short-term features or the long-term features of temporal graph attributes, leading to unsatisfactory model performance and even poor robustness and domain generality of the representation learning method. To address this problem, we propose a Frame-level Timeline Modeling (FTM) method that helps to capture both short-term and long-term features and thus learns more informative representations on temporal graphs. In particular, we present a novel link-based framing technique to preserve the short-term features and then inco",
    "path": "papers/23/02/2302.11814.json",
    "total_tokens": 931,
    "translated_title": "FTM: 一种用于时间图表示学习的帧级时间线建模方法",
    "translated_abstract": "学习图形结构数据的表示对于图形分析任务至关重要。尽管静态图取得了显着进展，但对于临时图的研究仍处于初步阶段。时间图表示学习方法的 bottleneck 是邻域聚合策略，基于此图属性明确分享和收集信息。现有的邻域聚合策略无法捕获时间图属性的短期特征或长期特征，导致模型性能不容乐观，甚至影响表示学习方法的鲁棒性和领域通用性。为解决这个问题，我们提出了一种帧级时间线建模（FTM）方法，有助于捕获短期和长期特征，从而在时间图上学习更有信息的表示。具体来说，我们提出了一种新颖的基于链接的框架技术来保留短期特征，然后将其集成到时间线建模框架中以捕获长期模式。实验结果表明，我们提出的 FTM 方法在三个不同任务和两个基准数据集上优于其他最先进的方法。",
    "tldr": "FTM 是一种帧级时间线建模方法，可同时捕获时间图中的短期和长期特征，并在不同任务和数据集上表现出比其他现有方法更好的性能。",
    "en_tdlr": "FTM is a frame-level timeline modeling method that can capture both short-term and long-term features in temporal graphs, and outperforms other existing methods on different tasks and datasets."
}