{
    "title": "Stochastic optimal transport in Banach Spaces for regularized estimation of multivariate quantiles",
    "abstract": "arXiv:2302.00982v2 Announce Type: replace-cross  Abstract: We introduce a new stochastic algorithm for solving entropic optimal transport (EOT) between two absolutely continuous probability measures $\\mu$ and $\\nu$. Our work is motivated by the specific setting of Monge-Kantorovich quantiles where the source measure $\\mu$ is either the uniform distribution on the unit hypercube or the spherical uniform distribution. Using the knowledge of the source measure, we propose to parametrize a Kantorovich dual potential by its Fourier coefficients. In this way, each iteration of our stochastic algorithm reduces to two Fourier transforms that enables us to make use of the Fast Fourier Transform (FFT) in order to implement a fast numerical method to solve EOT. We study the almost sure convergence of our stochastic algorithm that takes its values in an infinite-dimensional Banach space. Then, using numerical experiments, we illustrate the performances of our approach on the computation of regular",
    "link": "https://arxiv.org/abs/2302.00982",
    "context": "Title: Stochastic optimal transport in Banach Spaces for regularized estimation of multivariate quantiles\nAbstract: arXiv:2302.00982v2 Announce Type: replace-cross  Abstract: We introduce a new stochastic algorithm for solving entropic optimal transport (EOT) between two absolutely continuous probability measures $\\mu$ and $\\nu$. Our work is motivated by the specific setting of Monge-Kantorovich quantiles where the source measure $\\mu$ is either the uniform distribution on the unit hypercube or the spherical uniform distribution. Using the knowledge of the source measure, we propose to parametrize a Kantorovich dual potential by its Fourier coefficients. In this way, each iteration of our stochastic algorithm reduces to two Fourier transforms that enables us to make use of the Fast Fourier Transform (FFT) in order to implement a fast numerical method to solve EOT. We study the almost sure convergence of our stochastic algorithm that takes its values in an infinite-dimensional Banach space. Then, using numerical experiments, we illustrate the performances of our approach on the computation of regular",
    "path": "papers/23/02/2302.00982.json",
    "total_tokens": 885,
    "translated_title": "在Banach空间中的随机最优输运用于多元分位数的正则化估计",
    "translated_abstract": "我们介绍了一种新的随机算法，用于解决两个绝对连续概率测度$\\mu$和$\\nu$之间的熵最优输运（EOT）。我们的工作受蒙日-坎托罗维奇分位数的特定设置启发，其中源测度$\\mu$要么是单位超立方体上的均匀分布，要么是球面均匀分布。利用源测度的知识，我们建议通过其傅里叶系数来参数化坎托罗维奇对偶势能。通过这种方式，我们的随机算法的每次迭代都会减少到两个傅里叶变换，使我们能够利用快速傅里叶变换（FFT）来实现求解EOT的快速数值方法。我们研究了我们的随机算法在取值于无限维Banach空间中的几乎肯定收敛性。然后，通过数值实验，我们展示了我们的方法在计算中的性能表现。",
    "tldr": "提出了一种新的随机算法，用于利用傅里叶系数解决熵最优输运问题，并研究了其在无限维Banach空间中的几乎肯定收敛性和性能表现。",
    "en_tdlr": "Introduced a new stochastic algorithm for solving entropic optimal transport using Fourier coefficients, studied its almost sure convergence in an infinite-dimensional Banach space, and demonstrated its performance through numerical experiments."
}