{
    "title": "Multi-channel Autobidding with Budget and ROI Constraints. (arXiv:2302.01523v3 [cs.GT] UPDATED)",
    "abstract": "In digital online advertising, advertisers procure ad impressions simultaneously on multiple platforms, or so-called channels, such as Google Ads, Meta Ads Manager, etc., each of which consists of numerous ad auctions. We study how an advertiser maximizes total conversion (e.g. ad clicks) while satisfying aggregate return-on-investment (ROI) and budget constraints across all channels. In practice, an advertiser does not have control over, and thus cannot globally optimize, which individual ad auctions she participates in for each channel, and instead authorizes a channel to procure impressions on her behalf: the advertiser can only utilize two levers on each channel, namely setting a per-channel budget and per-channel target ROI. In this work, we first analyze the effectiveness of each of these levers for solving the advertiser's global multi-channel problem. We show that when an advertiser only optimizes over per-channel ROIs, her total conversion can be arbitrarily worse than what sh",
    "link": "http://arxiv.org/abs/2302.01523",
    "context": "Title: Multi-channel Autobidding with Budget and ROI Constraints. (arXiv:2302.01523v3 [cs.GT] UPDATED)\nAbstract: In digital online advertising, advertisers procure ad impressions simultaneously on multiple platforms, or so-called channels, such as Google Ads, Meta Ads Manager, etc., each of which consists of numerous ad auctions. We study how an advertiser maximizes total conversion (e.g. ad clicks) while satisfying aggregate return-on-investment (ROI) and budget constraints across all channels. In practice, an advertiser does not have control over, and thus cannot globally optimize, which individual ad auctions she participates in for each channel, and instead authorizes a channel to procure impressions on her behalf: the advertiser can only utilize two levers on each channel, namely setting a per-channel budget and per-channel target ROI. In this work, we first analyze the effectiveness of each of these levers for solving the advertiser's global multi-channel problem. We show that when an advertiser only optimizes over per-channel ROIs, her total conversion can be arbitrarily worse than what sh",
    "path": "papers/23/02/2302.01523.json",
    "total_tokens": 741,
    "tldr": "本文研究在数字在线广告中，如何在满足ROI和整体预算的约束下，在多个平台中最大程度地提高转化率。作者设计了一个新颖的多通道自动出价算法Autobid，同时考虑每个通道的ROI和预算限制，并证明其能够在多项式对数时间内达到最优性的常数近似算法。"
}