{
    "title": "OpenHLS: High-Level Synthesis for Low-Latency Deep Neural Networks for Experimental Science. (arXiv:2302.06751v3 [cs.AR] UPDATED)",
    "abstract": "In many experiment-driven scientific domains, such as high-energy physics, material science, and cosmology, high data rate experiments impose hard constraints on data acquisition systems: collected data must either be indiscriminately stored for post-processing and analysis, thereby necessitating large storage capacity, or accurately filtered in real-time, thereby necessitating low-latency processing. Deep neural networks, effective in other filtering tasks, have not been widely employed in such data acquisition systems, due to design and deployment difficulties. We present an open source, lightweight, compiler framework, without any proprietary dependencies, OpenHLS, based on high-level synthesis techniques, for translating high-level representations of deep neural networks to low-level representations, suitable for deployment to near-sensor devices such as field-programmable gate arrays. We evaluate OpenHLS on various workloads and present a case-study implementation of a deep neural",
    "link": "http://arxiv.org/abs/2302.06751",
    "context": "Title: OpenHLS: High-Level Synthesis for Low-Latency Deep Neural Networks for Experimental Science. (arXiv:2302.06751v3 [cs.AR] UPDATED)\nAbstract: In many experiment-driven scientific domains, such as high-energy physics, material science, and cosmology, high data rate experiments impose hard constraints on data acquisition systems: collected data must either be indiscriminately stored for post-processing and analysis, thereby necessitating large storage capacity, or accurately filtered in real-time, thereby necessitating low-latency processing. Deep neural networks, effective in other filtering tasks, have not been widely employed in such data acquisition systems, due to design and deployment difficulties. We present an open source, lightweight, compiler framework, without any proprietary dependencies, OpenHLS, based on high-level synthesis techniques, for translating high-level representations of deep neural networks to low-level representations, suitable for deployment to near-sensor devices such as field-programmable gate arrays. We evaluate OpenHLS on various workloads and present a case-study implementation of a deep neural",
    "path": "papers/23/02/2302.06751.json",
    "total_tokens": 909,
    "translated_title": "OpenHLS：适用于实验科学的低延迟深度神经网络高级综合",
    "translated_abstract": "在许多实验驱动的科学领域，例如高能物理、材料科学和宇宙学中，高数据率实验对数据采集系统施加硬性约束：收集的数据必须无差别地存储以进行后处理和分析，从而需要大容量存储，或者在实时准确过滤时，从而需要低延迟处理。深度神经网络已被证明在其他过滤任务中非常有效，但由于设计和部署困难，尚未广泛应用于此类数据采集系统。我们提出了一个开源的、轻量级的编译器框架OpenHLS，基于高级综合技术，将深度神经网络的高级表示转换为适用于场可编程门阵列等近传感器设备的低级表示，其中没有任何专有依赖项。我们在各种工作负载上评估OpenHLS，并呈现了一个深度神经网络的案例研究实现。",
    "tldr": "OpenHLS是一个基于高级综合技术的开源编译器框架，将深度神经网络的高级表示转换为适用于近传感器设备的低级表示，解决了实验科学领域数据采集系统中低延迟处理问题。"
}