{
    "title": "Breaking the Communication-Privacy-Accuracy Tradeoff with $f$-Differential Privacy. (arXiv:2302.09624v2 [cs.CR] UPDATED)",
    "abstract": "We consider a federated data analytics problem in which a server coordinates the collaborative data analysis of multiple users with privacy concerns and limited communication capability. The commonly adopted compression schemes introduce information loss into local data while improving communication efficiency, and it remains an open problem whether such discrete-valued mechanisms provide any privacy protection. In this paper, we study the local differential privacy guarantees of discrete-valued mechanisms with finite output space through the lens of $f$-differential privacy (DP). More specifically, we advance the existing literature by deriving tight $f$-DP guarantees for a variety of discrete-valued mechanisms, including the binomial noise and the binomial mechanisms that are proposed for privacy preservation, and the sign-based methods that are proposed for data compression, in closed-form expressions. We further investigate the amplification in privacy by sparsification and propose",
    "link": "http://arxiv.org/abs/2302.09624",
    "context": "Title: Breaking the Communication-Privacy-Accuracy Tradeoff with $f$-Differential Privacy. (arXiv:2302.09624v2 [cs.CR] UPDATED)\nAbstract: We consider a federated data analytics problem in which a server coordinates the collaborative data analysis of multiple users with privacy concerns and limited communication capability. The commonly adopted compression schemes introduce information loss into local data while improving communication efficiency, and it remains an open problem whether such discrete-valued mechanisms provide any privacy protection. In this paper, we study the local differential privacy guarantees of discrete-valued mechanisms with finite output space through the lens of $f$-differential privacy (DP). More specifically, we advance the existing literature by deriving tight $f$-DP guarantees for a variety of discrete-valued mechanisms, including the binomial noise and the binomial mechanisms that are proposed for privacy preservation, and the sign-based methods that are proposed for data compression, in closed-form expressions. We further investigate the amplification in privacy by sparsification and propose",
    "path": "papers/23/02/2302.09624.json",
    "total_tokens": 881,
    "translated_title": "通过$f$-差分隐私打破通信-隐私-准确性的权衡",
    "translated_abstract": "本文考虑了一个联邦数据分析问题，其中服务器协调具有隐私问题和有限通信能力的多个用户的协作数据分析。通常采用的压缩方案在改善通信效率的同时引入了局部数据的信息损失，但这些离散值机制是否提供了任何隐私保护仍然是一个开放问题。在本文中，我们通过$f$-差分隐私（DP）的视角研究了具有有限输出空间的离散值机制的局部差分隐私保证。具体而言，我们通过推导出各种离散值机制的紧密$f$-差分隐私保证，包括用于隐私保护的二项噪声和二项机制以及用于数据压缩的基于符号的方法，进一步研究了稀疏化对隐私的放大，并提出了解决的方法。",
    "tldr": "本文研究了具有隐私问题和有限通信能力的多个用户的协作数据分析问题，在局部差分隐私保证的视角下，我们通过推导离散值机制的紧密$f$-差分隐私保证，进一步研究了隐私放大的稀疏化方法。",
    "en_tdlr": "This paper investigates a federated data analytics problem with privacy concerns and limited communication capability. It studies the local differential privacy guarantees of discrete-valued mechanisms and explores privacy amplification through sparsification."
}