{
    "title": "Asymptotically Optimal Fixed-Budget Best Arm Identification with Variance-Dependent Bounds. (arXiv:2302.02988v2 [cs.LG] UPDATED)",
    "abstract": "We investigate the problem of fixed-budget best arm identification (BAI) for minimizing expected simple regret. In an adaptive experiment, a decision maker draws one of multiple treatment arms based on past observations and observes the outcome of the drawn arm. After the experiment, the decision maker recommends the treatment arm with the highest expected outcome. We evaluate the decision based on the expected simple regret, which is the difference between the expected outcomes of the best arm and the recommended arm. Due to inherent uncertainty, we evaluate the regret using the minimax criterion. First, we derive asymptotic lower bounds for the worst-case expected simple regret, which are characterized by the variances of potential outcomes (leading factor). Based on the lower bounds, we propose the Two-Stage (TS)-Hirano-Imbens-Ridder (HIR) strategy, which utilizes the HIR estimator (Hirano et al., 2003) in recommending the best arm. Our theoretical analysis shows that the TS-HIR str",
    "link": "http://arxiv.org/abs/2302.02988",
    "context": "Title: Asymptotically Optimal Fixed-Budget Best Arm Identification with Variance-Dependent Bounds. (arXiv:2302.02988v2 [cs.LG] UPDATED)\nAbstract: We investigate the problem of fixed-budget best arm identification (BAI) for minimizing expected simple regret. In an adaptive experiment, a decision maker draws one of multiple treatment arms based on past observations and observes the outcome of the drawn arm. After the experiment, the decision maker recommends the treatment arm with the highest expected outcome. We evaluate the decision based on the expected simple regret, which is the difference between the expected outcomes of the best arm and the recommended arm. Due to inherent uncertainty, we evaluate the regret using the minimax criterion. First, we derive asymptotic lower bounds for the worst-case expected simple regret, which are characterized by the variances of potential outcomes (leading factor). Based on the lower bounds, we propose the Two-Stage (TS)-Hirano-Imbens-Ridder (HIR) strategy, which utilizes the HIR estimator (Hirano et al., 2003) in recommending the best arm. Our theoretical analysis shows that the TS-HIR str",
    "path": "papers/23/02/2302.02988.json",
    "total_tokens": 1010,
    "translated_title": "渐进最优的固定预算最优臂识别方法与方差相关界限",
    "translated_abstract": "本文研究了最小化期望简单遗憾的固定预算最优臂识别问题。在自适应实验中，决策者根据过去的观测结果选择多个处理臂之一，并观察所选择的臂的结果。实验结束后，决策者推荐期望结果最高的处理臂。我们基于期望简单遗憾评估决策的好坏，其定义为最优臂的期望结果与推荐臂的期望结果之差。由于固有的不确定性，我们使用极小极大准则评估遗憾。首先，我们推导了最坏情况期望简单遗憾的渐进下界，该下界由潜在结果的方差（主导因素）所确定。基于这些下界，我们提出了Two-Stage (TS)-Hirano-Imbens-Ridder (HIR)策略，在推荐最优臂时利用HIR估计（Hirano et al., 2003）。我们的理论分析表明，TS-HIR策略近似是最优的，并且在一定条件下能达到极小极大准则下的渐进最优性。",
    "tldr": "本文研究了最小化期望简单遗憾的固定预算最优臂识别问题。通过推导最坏情况期望简单遗憾的渐进下界，提出了基于HIR估计的TS-HIR策略，该策略在推荐最优臂时表现出近似最优性。",
    "en_tdlr": "This paper investigates the problem of fixed-budget best arm identification for minimizing expected simple regret. By deriving asymptotic lower bounds for the worst-case expected simple regret and proposing the TS-HIR strategy based on the HIR estimator, the paper achieves approximate optimality in recommending the best arm."
}