{
    "title": "Unleashing the Potential of Acquisition Functions in High-Dimensional Bayesian Optimization. (arXiv:2302.08298v2 [cs.LG] UPDATED)",
    "abstract": "Bayesian optimization (BO) is widely used to optimize expensive-to-evaluate black-box functions.BO first builds a surrogate model to represent the objective function and assesses its uncertainty. It then decides where to sample by maximizing an acquisition function (AF) based on the surrogate model. However, when dealing with high-dimensional problems, finding the global maximum of the AF becomes increasingly challenging. In such cases, the initialization of the AF maximizer plays a pivotal role, as an inadequate setup can severely hinder the effectiveness of the AF.  This paper investigates a largely understudied problem concerning the impact of AF maximizer initialization on exploiting AFs' capability. Our large-scale empirical study shows that the widely used random initialization strategy often fails to harness the potential of an AF. In light of this, we propose a better initialization approach by employing multiple heuristic optimizers to leverage the historical data of black-box",
    "link": "http://arxiv.org/abs/2302.08298",
    "context": "Title: Unleashing the Potential of Acquisition Functions in High-Dimensional Bayesian Optimization. (arXiv:2302.08298v2 [cs.LG] UPDATED)\nAbstract: Bayesian optimization (BO) is widely used to optimize expensive-to-evaluate black-box functions.BO first builds a surrogate model to represent the objective function and assesses its uncertainty. It then decides where to sample by maximizing an acquisition function (AF) based on the surrogate model. However, when dealing with high-dimensional problems, finding the global maximum of the AF becomes increasingly challenging. In such cases, the initialization of the AF maximizer plays a pivotal role, as an inadequate setup can severely hinder the effectiveness of the AF.  This paper investigates a largely understudied problem concerning the impact of AF maximizer initialization on exploiting AFs' capability. Our large-scale empirical study shows that the widely used random initialization strategy often fails to harness the potential of an AF. In light of this, we propose a better initialization approach by employing multiple heuristic optimizers to leverage the historical data of black-box",
    "path": "papers/23/02/2302.08298.json",
    "total_tokens": 905,
    "translated_title": "在高维贝叶斯优化中释放收购功能的潜力",
    "translated_abstract": "贝叶斯优化（BO）被广泛用于优化昂贵的黑盒函数。BO首先构建一个代理模型来表示目标函数并评估其不确定性。然后，它通过最大化基于代理模型的收购函数（AF）来决定采样位置。然而，在处理高维问题时，找到AF的全局最大值变得越来越具有挑战性。在这种情况下，AF最大化器的初始化发挥了关键作用，因为不恰当的设置可能严重影响AF的有效性。本文研究了一个很大程度上未被研究的问题，即AF最大化器初始化对利用AF能力的影响。我们的大规模实证研究表明，广泛使用的随机初始化策略往往无法充分发挥AF的潜力。基于此，我们提出了一种更好的初始化方法，通过使用多个启发式优化器来利用黑盒的历史数据。",
    "tldr": "该论文考察了在高维贝叶斯优化中，收购功能最大化器初始化对利用收购功能能力的影响。研究发现随机初始化方法不能充分发挥收购功能的潜力，因此提出了一种更好的初始化方法来利用历史数据。",
    "en_tdlr": "This paper investigates the impact of acquisition function (AF) maximizer initialization on exploiting the capability of AFs in high-dimensional Bayesian optimization. The study finds that the widely used random initialization strategy fails to harness the potential of an AF, and proposes a better initialization approach leveraging historical data."
}