{
    "title": "CECT: Controllable Ensemble CNN and Transformer for COVID-19 Image Classification. (arXiv:2302.02314v2 [eess.IV] UPDATED)",
    "abstract": "Most computer vision models are developed based on either convolutional neural network (CNN) or transformer, while the former (latter) method captures local (global) features. To relieve model performance limitations due to the lack of global (local) features, we develop a novel classification network CECT by controllable ensemble CNN and transformer. CECT is composed of a convolutional encoder block, a transposed-convolutional decoder block, and a transformer classification block. Different from conventional CNN- or transformer-based methods, our CECT can capture features at both multi-local and global scales. Besides, the contribution of local features at different scales can be controlled with the proposed ensemble coefficients. We evaluate CECT on two public COVID-19 datasets and it outperforms existing state-of-the-art methods on all evaluation metrics. With remarkable feature capture ability, we believe CECT can be extended to other medical image classification scenarios as a dia",
    "link": "http://arxiv.org/abs/2302.02314",
    "context": "Title: CECT: Controllable Ensemble CNN and Transformer for COVID-19 Image Classification. (arXiv:2302.02314v2 [eess.IV] UPDATED)\nAbstract: Most computer vision models are developed based on either convolutional neural network (CNN) or transformer, while the former (latter) method captures local (global) features. To relieve model performance limitations due to the lack of global (local) features, we develop a novel classification network CECT by controllable ensemble CNN and transformer. CECT is composed of a convolutional encoder block, a transposed-convolutional decoder block, and a transformer classification block. Different from conventional CNN- or transformer-based methods, our CECT can capture features at both multi-local and global scales. Besides, the contribution of local features at different scales can be controlled with the proposed ensemble coefficients. We evaluate CECT on two public COVID-19 datasets and it outperforms existing state-of-the-art methods on all evaluation metrics. With remarkable feature capture ability, we believe CECT can be extended to other medical image classification scenarios as a dia",
    "path": "papers/23/02/2302.02314.json",
    "total_tokens": 965,
    "translated_title": "CECT：可控的卷积神经网络和Transformer用于COVID-19图像分类",
    "translated_abstract": "大多数计算机视觉模型基于卷积神经网络（CNN）或Transformer开发，前者（后者）可以捕捉局部（全局）特征。为了减轻模型性能受局部（全局）特征缺乏的限制，我们开发了一种新的分类网络CECT，通过可控的卷积神经网络和Transformer进行组合。CECT由卷积编码块、转置卷积解码块和Transformer分类块组成。不同于传统的基于CNN或Transformer的方法，我们的CECT可以同时捕捉多个局部和全局尺度上的特征。此外，本文提出的集合系数可以控制不同尺度局部特征的贡献。我们在两个公共COVID-19数据集上评估了CECT，并且在所有评估指标上均优于现有的最先进方法。由于其卓越的特征捕捉能力，我们相信CECT可以作为一种通用而有效的工具扩展到其他医学图像分类场景中。",
    "tldr": "本研究提出了一种新的分类网络CECT，利用可控的卷积神经网络和Transformer进行组合，能同时捕捉多个局部和全局尺度上的特征。在两个公共COVID-19数据集上评估后表现优于现有的最先进方法。这一新方法在医学图像分类领域中有广泛的应用前景。",
    "en_tdlr": "This study proposes a novel classification network called CECT which combines controllable ensemble CNN and transformer to capture features at both multi-local and global scales. It outperforms existing state-of-the-art methods on two public COVID-19 datasets and can potentially be extended to other medical image classification scenarios."
}