{
    "title": "Bicriteria Multidimensional Mechanism Design with Side Information. (arXiv:2302.14234v3 [cs.GT] UPDATED)",
    "abstract": "We develop a versatile new methodology for multidimensional mechanism design that incorporates side information about agent types with the bicriteria goal of generating high social welfare and high revenue simultaneously. Side information can come from a variety of sources -- examples include advice from a domain expert, predictions from a machine-learning model trained on historical agent data, or even the mechanism designer's own gut instinct -- and in practice such sources are abundant. In this paper we adopt a prior-free perspective that makes no assumptions on the correctness, accuracy, or source of the side information. First, we design a meta-mechanism that integrates input side information with an improvement of the classical VCG mechanism. The welfare, revenue, and incentive properties of our meta-mechanism are characterized by a number of novel constructions we introduce based on the notion of a weakest competitor, which is an agent that has the smallest impact on welfare. We",
    "link": "http://arxiv.org/abs/2302.14234",
    "context": "Title: Bicriteria Multidimensional Mechanism Design with Side Information. (arXiv:2302.14234v3 [cs.GT] UPDATED)\nAbstract: We develop a versatile new methodology for multidimensional mechanism design that incorporates side information about agent types with the bicriteria goal of generating high social welfare and high revenue simultaneously. Side information can come from a variety of sources -- examples include advice from a domain expert, predictions from a machine-learning model trained on historical agent data, or even the mechanism designer's own gut instinct -- and in practice such sources are abundant. In this paper we adopt a prior-free perspective that makes no assumptions on the correctness, accuracy, or source of the side information. First, we design a meta-mechanism that integrates input side information with an improvement of the classical VCG mechanism. The welfare, revenue, and incentive properties of our meta-mechanism are characterized by a number of novel constructions we introduce based on the notion of a weakest competitor, which is an agent that has the smallest impact on welfare. We",
    "path": "papers/23/02/2302.14234.json",
    "total_tokens": 918,
    "translated_title": "具有侧面信息的双目标多维机制设计",
    "translated_abstract": "我们开发了一种适用于多维机制设计的通用新方法，该方法结合了有关代理类型的侧面信息，具有同时生成高社会福利和高收入的双目标要求。侧面信息可以来自各种来源----例如，来自领域专家的建议，历史代理数据训练的机器学习模型的预测，甚至是机制设计师自己的直觉----在实践中这类信息很丰富。本文采用不考虑侧面信息正确性、准确性或来源的先验视角。首先，我们设计了一个元机制，将输入的侧面信息与传统VCG机制的改进相结合。我们引入了一些新颖构造，以最弱竞争者的概念为基础，对我们的元机制的福利、收入和激励特性进行了描述，最弱竞争者是对福利影响最小的代理。",
    "tldr": "本文提出了一种通用的新方法，该方法结合了有关代理类型的侧面信息，并具有同时生成高社会福利和高收入的双目标要求，其中基于最弱竞争者概念的新颖构造描述了元机制的特性。"
}