{
    "title": "DeepVATS: Deep Visual Analytics for Time Series. (arXiv:2302.03858v2 [cs.LG] UPDATED)",
    "abstract": "The field of Deep Visual Analytics (DVA) has recently arisen from the idea of developing Visual Interactive Systems supported by deep learning, in order to provide them with large-scale data processing capabilities and to unify their implementation across different data and domains. In this paper we present DeepVATS, an open-source tool that brings the field of DVA into time series data. DeepVATS trains, in a self-supervised way, a masked time series autoencoder that reconstructs patches of a time series, and projects the knowledge contained in the embeddings of that model in an interactive plot, from which time series patterns and anomalies emerge and can be easily spotted. The tool includes a back-end for data processing pipeline and model training, as well as a front-end with a interactive user interface. We report on results that validate the utility of DeepVATS, running experiments on both synthetic and real datasets. The code is publicly available on https://github.com/vrodriguez",
    "link": "http://arxiv.org/abs/2302.03858",
    "context": "Title: DeepVATS: Deep Visual Analytics for Time Series. (arXiv:2302.03858v2 [cs.LG] UPDATED)\nAbstract: The field of Deep Visual Analytics (DVA) has recently arisen from the idea of developing Visual Interactive Systems supported by deep learning, in order to provide them with large-scale data processing capabilities and to unify their implementation across different data and domains. In this paper we present DeepVATS, an open-source tool that brings the field of DVA into time series data. DeepVATS trains, in a self-supervised way, a masked time series autoencoder that reconstructs patches of a time series, and projects the knowledge contained in the embeddings of that model in an interactive plot, from which time series patterns and anomalies emerge and can be easily spotted. The tool includes a back-end for data processing pipeline and model training, as well as a front-end with a interactive user interface. We report on results that validate the utility of DeepVATS, running experiments on both synthetic and real datasets. The code is publicly available on https://github.com/vrodriguez",
    "path": "papers/23/02/2302.03858.json",
    "total_tokens": 898,
    "translated_title": "DeepVATS：面向时间序列的深度视觉分析",
    "translated_abstract": "深度视觉分析（DVA）近来兴起，目的是通过深度学习支持可视交互系统，以提供大规模数据处理能力并在不同数据和领域中统一其实现。本文介绍了DeepVATS，这是一个开源工具，将DVA领域引入时间序列数据。DeepVATS以自监督方式训练掩码时间序列自编码器，重建时间序列的补丁，并将模型嵌入中所包含的知识投影到交互式图中，从而可以轻松识别时间序列的模式和异常。工具包括用于数据处理流水线和模型训练的后端以及带有交互式用户界面的前端。我们在合成和实际数据集上运行实验，证明了DeepVATS的实用价值。代码公开在https://github.com/vrodriguez上。",
    "tldr": "DeepVATS是一个开源的工具，用于对时间序列数据进行深度视觉分析，通过自监督的方式训练掩码时间序列自编码器，重建时间序列的补丁，并将模型嵌入中所包含的知识投影到交互式图中，从而可以轻松识别时间序列模式和异常。",
    "en_tdlr": "DeepVATS is an open-source tool that enables deep visual analytics for time series data through training a masked time series autoencoder in a self-supervised way to reconstruct patches of a time series and project the knowledge contained in the embeddings of that model, making it easy to identify patterns and anomalies in time series."
}