{
    "title": "Finding Heterophilic Neighbors via Confidence-based Subgraph Matching for Semi-supervised Node Classification. (arXiv:2302.09755v2 [cs.LG] UPDATED)",
    "abstract": "Graph Neural Networks (GNNs) have proven to be powerful in many graph-based applications. However, they fail to generalize well under heterophilic setups, where neighbor nodes have different labels. To address this challenge, we employ a confidence ratio as a hyper-parameter, assuming that some of the edges are disassortative (heterophilic). Here, we propose a two-phased algorithm. Firstly, we determine edge coefficients through subgraph matching using a supplementary module. Then, we apply GNNs with a modified label propagation mechanism to utilize the edge coefficients effectively. Specifically, our supplementary module identifies a certain proportion of task-irrelevant edges based on a given confidence ratio. Using the remaining edges, we employ the widely used optimal transport to measure the similarity between two nodes with their subgraphs. Finally, using the coefficients as supplementary information on GNNs, we improve the label propagation mechanism which can prevent two nodes ",
    "link": "http://arxiv.org/abs/2302.09755",
    "context": "Title: Finding Heterophilic Neighbors via Confidence-based Subgraph Matching for Semi-supervised Node Classification. (arXiv:2302.09755v2 [cs.LG] UPDATED)\nAbstract: Graph Neural Networks (GNNs) have proven to be powerful in many graph-based applications. However, they fail to generalize well under heterophilic setups, where neighbor nodes have different labels. To address this challenge, we employ a confidence ratio as a hyper-parameter, assuming that some of the edges are disassortative (heterophilic). Here, we propose a two-phased algorithm. Firstly, we determine edge coefficients through subgraph matching using a supplementary module. Then, we apply GNNs with a modified label propagation mechanism to utilize the edge coefficients effectively. Specifically, our supplementary module identifies a certain proportion of task-irrelevant edges based on a given confidence ratio. Using the remaining edges, we employ the widely used optimal transport to measure the similarity between two nodes with their subgraphs. Finally, using the coefficients as supplementary information on GNNs, we improve the label propagation mechanism which can prevent two nodes ",
    "path": "papers/23/02/2302.09755.json",
    "total_tokens": 863,
    "translated_title": "基于置信度子图匹配的异质结构邻居发现算法用于半监督节点分类",
    "translated_abstract": "图神经网络在许多基于图的应用中表现出了强大的能力。然而，在异质结构设置下（即邻居节点具有不同的标签），它们的泛化能力不佳。为了解决这一问题，本文提出了一种双阶段算法。首先，我们使用一个补充模块通过子图匹配来确定边缘系数。然后，我们采用具有修改标签传播机制的GNNs来有效利用边缘系数。具体来说，我们的补充模块根据给定的置信度比例确定某些任务不相关的边缘。使用剩余的边缘，我们采用广泛使用的最优运输来计算两个节点及其子图之间的相似度。最后，利用系数作为GNNs的补充信息，我们改善了标签传播机制，可以防止两个节点。",
    "tldr": "本论文提出了一种基于置信度子图匹配的双阶段算法，通过确定边权系数和改善标签传播机制来解决了异质结构邻居识别的问题。",
    "en_tdlr": "This paper proposes a two-phased algorithm based on confidence-based subgraph matching to address the challenge of identifying heterophilic neighbors, by determining edge coefficients and improving the label propagation mechanism."
}