{
    "title": "Enhancing SMT-based Weighted Model Integration by Structure Awareness. (arXiv:2302.06188v2 [cs.AI] UPDATED)",
    "abstract": "The development of efficient exact and approximate algorithms for probabilistic inference is a long-standing goal of artificial intelligence research. Whereas substantial progress has been made in dealing with purely discrete or purely continuous domains, adapting the developed solutions to tackle hybrid domains, characterised by discrete and continuous variables and their relationships, is highly non-trivial. Weighted Model Integration (WMI) recently emerged as a unifying formalism for probabilistic inference in hybrid domains. Despite a considerable amount of recent work, allowing WMI algorithms to scale with the complexity of the hybrid problem is still a challenge. In this paper we highlight some substantial limitations of existing state-of-the-art solutions, and develop an algorithm that combines SMT-based enumeration, an efficient technique in formal verification, with an effective encoding of the problem structure. This allows our algorithm to avoid generating redundant models, ",
    "link": "http://arxiv.org/abs/2302.06188",
    "context": "Title: Enhancing SMT-based Weighted Model Integration by Structure Awareness. (arXiv:2302.06188v2 [cs.AI] UPDATED)\nAbstract: The development of efficient exact and approximate algorithms for probabilistic inference is a long-standing goal of artificial intelligence research. Whereas substantial progress has been made in dealing with purely discrete or purely continuous domains, adapting the developed solutions to tackle hybrid domains, characterised by discrete and continuous variables and their relationships, is highly non-trivial. Weighted Model Integration (WMI) recently emerged as a unifying formalism for probabilistic inference in hybrid domains. Despite a considerable amount of recent work, allowing WMI algorithms to scale with the complexity of the hybrid problem is still a challenge. In this paper we highlight some substantial limitations of existing state-of-the-art solutions, and develop an algorithm that combines SMT-based enumeration, an efficient technique in formal verification, with an effective encoding of the problem structure. This allows our algorithm to avoid generating redundant models, ",
    "path": "papers/23/02/2302.06188.json",
    "total_tokens": 835,
    "translated_title": "基于结构感知的SMT加权模型集成的增强",
    "translated_abstract": "有效的精确和近似概率推断算法的开发是人工智能研究的一个长期目标。虽然在处理纯离散或纯连续领域方面取得了实质性进展，但将这些解决方案适应于离散和连续变量及其关系的混合领域是非常困难的。加权模型集成（WMI）最近成为混合领域概率推断的统一形式。尽管最近有相当数量的工作，但使WMI算法随着混合问题的复杂性而扩展仍然是一个挑战。在本文中，我们强调了现有最先进解决方案的一些重大局限性，并开发了一种算法，将基于SMT的枚举（一种形式验证中的有效技术）与问题结构的有效编码相结合。这使得我们的算法能够避免生成冗余模型。",
    "tldr": "本论文提出了一种基于结构感知的SMT加权模型集成算法，用于处理混合领域的概率推断问题，并能够避免生成冗余模型。",
    "en_tdlr": "This paper presents an algorithm for SMT-based weighted model integration that is aware of the problem's structure, allowing it to handle probabilistic inference in hybrid domains efficiently and avoid generating redundant models."
}