{
    "title": "Conformalized Semi-supervised Random Forest for Classification and Abnormality Detection",
    "abstract": "arXiv:2302.02237v2 Announce Type: replace  Abstract: The Random Forests classifier, a widely utilized off-the-shelf classification tool, assumes training and test samples come from the same distribution as other standard classifiers. However, in safety-critical scenarios like medical diagnosis and network attack detection, discrepancies between the training and test sets, including the potential presence of novel outlier samples not appearing during training, can pose significant challenges. To address this problem, we introduce the Conformalized Semi-Supervised Random Forest (CSForest), which couples the conformalization technique Jackknife+aB with semi-supervised tree ensembles to construct a set-valued prediction $C(x)$. Instead of optimizing over the training distribution, CSForest employs unlabeled test samples to enhance accuracy and flag unseen outliers by generating an empty set. Theoretically, we establish CSForest to cover true labels for previously observed inlier classes un",
    "link": "https://arxiv.org/abs/2302.02237",
    "context": "Title: Conformalized Semi-supervised Random Forest for Classification and Abnormality Detection\nAbstract: arXiv:2302.02237v2 Announce Type: replace  Abstract: The Random Forests classifier, a widely utilized off-the-shelf classification tool, assumes training and test samples come from the same distribution as other standard classifiers. However, in safety-critical scenarios like medical diagnosis and network attack detection, discrepancies between the training and test sets, including the potential presence of novel outlier samples not appearing during training, can pose significant challenges. To address this problem, we introduce the Conformalized Semi-Supervised Random Forest (CSForest), which couples the conformalization technique Jackknife+aB with semi-supervised tree ensembles to construct a set-valued prediction $C(x)$. Instead of optimizing over the training distribution, CSForest employs unlabeled test samples to enhance accuracy and flag unseen outliers by generating an empty set. Theoretically, we establish CSForest to cover true labels for previously observed inlier classes un",
    "path": "papers/23/02/2302.02237.json",
    "total_tokens": 863,
    "translated_title": "基于半监督随机森林的分类和异常检测的一致化方法",
    "translated_abstract": "随机森林分类器作为一种广泛使用的即插即用分类工具，假设训练和测试样本与其他标准分类器来自相同分布。然而，在诸如医学诊断和网络攻击检测等关键安全场景中，训练集和测试集之间的差异，包括潜在出现在训练期间未见的新离群样本，可能带来重大挑战。为解决这一问题，我们引入了一种称为Conformalized Semi-Supervised Random Forest (CSForest)的方法，该方法将一致化技术Jackknife+aB与半监督树集成相结合，构建一个集值预测 C(x)。CSForest不再优化训练分布，而是利用未标记的测试样本来提高准确性，并通过生成空集来标识未见的离群值。从理论上讲，我们建立了CSForest覆盖以前观察到的内群类的真实标签。",
    "tldr": "提出了一种名为CSForest的方法，利用Conformalized Semi-Supervised Random Forest技术来解决训练集和测试集之间的差异，提高准确性并标识未见的离群值。",
    "en_tdlr": "Introduced a method named CSForest, which utilizes Conformalized Semi-Supervised Random Forest technique to address the differences between training and test sets, improve accuracy, and identify unseen outliers."
}