{
    "title": "Quantiled conditional variance, skewness, and kurtosis by Cornish-Fisher expansion. (arXiv:2302.06799v2 [stat.ME] UPDATED)",
    "abstract": "The conditional variance, skewness, and kurtosis play a central role in time series analysis. These three conditional moments (CMs) are often studied by some parametric models but with two big issues: the risk of model mis-specification and the instability of model estimation. To avoid the above two issues, this paper proposes a novel method to estimate these three CMs by the so-called quantiled CMs (QCMs). The QCM method first adopts the idea of Cornish-Fisher expansion to construct a linear regression model, based on $n$ different estimated conditional quantiles. Next, it computes the QCMs simply and simultaneously by using the ordinary least squares estimator of this regression model, without any prior estimation of the conditional mean. Under certain conditions, the QCMs are shown to be consistent with the convergence rate $n^{-1/2}$. Simulation studies indicate that the QCMs perform well under different scenarios of Cornish-Fisher expansion errors and quantile estimation errors. I",
    "link": "http://arxiv.org/abs/2302.06799",
    "context": "Title: Quantiled conditional variance, skewness, and kurtosis by Cornish-Fisher expansion. (arXiv:2302.06799v2 [stat.ME] UPDATED)\nAbstract: The conditional variance, skewness, and kurtosis play a central role in time series analysis. These three conditional moments (CMs) are often studied by some parametric models but with two big issues: the risk of model mis-specification and the instability of model estimation. To avoid the above two issues, this paper proposes a novel method to estimate these three CMs by the so-called quantiled CMs (QCMs). The QCM method first adopts the idea of Cornish-Fisher expansion to construct a linear regression model, based on $n$ different estimated conditional quantiles. Next, it computes the QCMs simply and simultaneously by using the ordinary least squares estimator of this regression model, without any prior estimation of the conditional mean. Under certain conditions, the QCMs are shown to be consistent with the convergence rate $n^{-1/2}$. Simulation studies indicate that the QCMs perform well under different scenarios of Cornish-Fisher expansion errors and quantile estimation errors. I",
    "path": "papers/23/02/2302.06799.json",
    "total_tokens": 858,
    "translated_title": "Cornish-Fisher扩展的分位条件方差、偏度和峰度",
    "translated_abstract": "条件方差、偏度和峰度在时间序列分析中起着核心作用。这篇论文提出了一种利用Cornish-Fisher扩展来估计这三个条件矩的新方法——分位条件矩（QCMs）。该方法通过基于$n$个不同的估计条件分位数构建线性回归模型来计算QCMs，然后使用此回归模型的最小二乘估计量简单而同时地计算QCMs，而无需先前估计条件均值。在一定条件下，QCMs被证明是一致的，收敛速度为$n^{-1/2}$。模拟研究表明，QCMs在Cornish-Fisher扩展误差和分位数估计误差的不同情况下表现良好。",
    "tldr": "该论文提出了一种使用Cornish-Fisher扩展来估计条件方差、偏度和峰度的方法——QCMs，该方法不需要先前估计条件均值，并且在模拟研究中表现良好。",
    "en_tdlr": "This paper proposes a method called quantiled conditional moments (QCMs) to estimate the conditional variance, skewness, and kurtosis by utilizing Cornish-Fisher expansion, which does not require prior estimation of the conditional mean and shows good performance in simulation studies."
}