{
    "title": "The Past, Current, and Future of Neonatal Intensive Care Units with Artificial Intelligence. (arXiv:2302.00225v2 [cs.CV] UPDATED)",
    "abstract": "Machine learning and deep learning are two subsets of artificial intelligence that involve teaching computers to learn and make decisions from any sort of data. Most recent developments in artificial intelligence are coming from deep learning, which has proven revolutionary in almost all fields, from computer vision to health sciences. The effects of deep learning in medicine have changed the conventional ways of clinical application significantly. Although some sub-fields of medicine, such as pediatrics, have been relatively slow in receiving the critical benefits of deep learning, related research in pediatrics has started to accumulate to a significant level, too. Hence, in this paper, we review recently developed machine learning and deep learning-based solutions for neonatology applications. We systematically evaluate the roles of both classical machine learning and deep learning in neonatology applications, define the methodologies, including algorithmic developments, and describ",
    "link": "http://arxiv.org/abs/2302.00225",
    "context": "Title: The Past, Current, and Future of Neonatal Intensive Care Units with Artificial Intelligence. (arXiv:2302.00225v2 [cs.CV] UPDATED)\nAbstract: Machine learning and deep learning are two subsets of artificial intelligence that involve teaching computers to learn and make decisions from any sort of data. Most recent developments in artificial intelligence are coming from deep learning, which has proven revolutionary in almost all fields, from computer vision to health sciences. The effects of deep learning in medicine have changed the conventional ways of clinical application significantly. Although some sub-fields of medicine, such as pediatrics, have been relatively slow in receiving the critical benefits of deep learning, related research in pediatrics has started to accumulate to a significant level, too. Hence, in this paper, we review recently developed machine learning and deep learning-based solutions for neonatology applications. We systematically evaluate the roles of both classical machine learning and deep learning in neonatology applications, define the methodologies, including algorithmic developments, and describ",
    "path": "papers/23/02/2302.00225.json",
    "total_tokens": 909,
    "translated_title": "新生儿重症监护室与人工智能的过去、现在和未来",
    "translated_abstract": "机器学习和深度学习是人工智能的两个子领域，涉及教授计算机从各种数据中学习和做出决策。最近在人工智能领域的大部分发展来自深度学习，在计算机视觉到健康科学等几乎所有领域都被证明是革命性的。深度学习在医学中的影响已经显著改变了传统的临床应用方式。尽管一些医学的子领域，例如儿科学，相对较慢地接受了深度学习的重要好处，但相关的儿科研究也开始积累到了一个重要的水平。因此，在本文中，我们回顾了新生儿科学中最近发展的基于机器学习和深度学习的解决方案。我们对经典机器学习和深度学习在新生儿科应用中的角色进行了系统评估，定义了方法论，包括算法发展，并且描述了最新的研究进展。",
    "tldr": "本论文回顾了新生儿科学中最近发展的基于机器学习和深度学习的解决方案，系统评估了它们在新生儿科应用中的作用，并描述了最新的研究进展。",
    "en_tdlr": "This paper reviews the recently developed machine learning and deep learning-based solutions in neonatology, systematically evaluates their roles in neonatology applications, and describes the latest research advancements."
}