{
    "title": "Regularised neural networks mimic human insight. (arXiv:2302.11351v2 [cs.AI] UPDATED)",
    "abstract": "Humans sometimes show sudden improvements in task performance that have been linked to moments of insight. Such insight-related performance improvements appear special because they are preceded by an extended period of impasse, are unusually abrupt, and occur only in some, but not all, learners. Here, we ask whether insight-like behaviour also occurs in artificial neural networks trained with gradient descent algorithms. We compared learning dynamics in humans and regularised neural networks in a perceptual decision task that provided a hidden opportunity which allowed to solve the task more efficiently. We show that humans tend to discover this regularity through insight, rather than gradually. Notably, neural networks with regularised gate modulation closely mimicked behavioural characteristics of human insights, exhibiting delay of insight, suddenness and selective occurrence. Analyses of network learning dynamics revealed that insight-like behaviour crucially depended on noise adde",
    "link": "http://arxiv.org/abs/2302.11351",
    "context": "Title: Regularised neural networks mimic human insight. (arXiv:2302.11351v2 [cs.AI] UPDATED)\nAbstract: Humans sometimes show sudden improvements in task performance that have been linked to moments of insight. Such insight-related performance improvements appear special because they are preceded by an extended period of impasse, are unusually abrupt, and occur only in some, but not all, learners. Here, we ask whether insight-like behaviour also occurs in artificial neural networks trained with gradient descent algorithms. We compared learning dynamics in humans and regularised neural networks in a perceptual decision task that provided a hidden opportunity which allowed to solve the task more efficiently. We show that humans tend to discover this regularity through insight, rather than gradually. Notably, neural networks with regularised gate modulation closely mimicked behavioural characteristics of human insights, exhibiting delay of insight, suddenness and selective occurrence. Analyses of network learning dynamics revealed that insight-like behaviour crucially depended on noise adde",
    "path": "papers/23/02/2302.11351.json",
    "total_tokens": 929,
    "translated_title": "正则化神经网络模拟人类洞察力",
    "translated_abstract": "人类有时会展现出突然提高任务表现的情况，这与洞察力时刻相关。这种洞察力相关的性能提升似乎很特殊，因为它们前面有一个较长时间的僵局，变化异常突然，并且只发生在一部分学习者身上。本文探讨了使用梯度下降算法训练的人工神经网络中是否也存在类似洞察力行为。我们通过一项感知决策任务比较了人类和正则化神经网络的学习动态，该任务提供了一个隐藏的机会，可以更有效地解决任务。我们发现人类倾向于通过洞察力发现这种规律，而不是逐渐发现。值得注意的是，带有正则化门控调节的神经网络紧密模仿了人类洞察力的行为特征，表现出洞察力的延迟、突然性和选择性发生。网络学习动态的分析揭示了洞察力行为关键地取决于噪声添加。",
    "tldr": "本文研究了正则化神经网络是否具有类似于人类洞察力的行为。研究发现，正则化神经网络在学习动态和行为特征上密切模仿了人类的洞察力，表现出洞察力的延迟、突然性和选择性发生。",
    "en_tdlr": "This study investigates whether regularised neural networks exhibit behavior similar to human insight. The findings reveal that the neural networks closely mimic the delay, suddenness, and selective occurrence of human insights, providing evidence for the existence of insight-like behavior in artificial neural networks trained with gradient descent algorithms."
}