{
    "title": "Selective experience replay compression using coresets for lifelong deep reinforcement learning in medical imaging. (arXiv:2302.11510v3 [cs.LG] UPDATED)",
    "abstract": "Selective experience replay is a popular strategy for integrating lifelong learning with deep reinforcement learning. Selective experience replay aims to recount selected experiences from previous tasks to avoid catastrophic forgetting. Furthermore, selective experience replay based techniques are model agnostic and allow experiences to be shared across different models. However, storing experiences from all previous tasks make lifelong learning using selective experience replay computationally very expensive and impractical as the number of tasks increase. To that end, we propose a reward distribution-preserving coreset compression technique for compressing experience replay buffers stored for selective experience replay.  We evaluated the coreset compression technique on the brain tumor segmentation (BRATS) dataset for the task of ventricle localization and on the whole-body MRI for localization of left knee cap, left kidney, right trochanter, left lung, and spleen. The coreset lifel",
    "link": "http://arxiv.org/abs/2302.11510",
    "context": "Title: Selective experience replay compression using coresets for lifelong deep reinforcement learning in medical imaging. (arXiv:2302.11510v3 [cs.LG] UPDATED)\nAbstract: Selective experience replay is a popular strategy for integrating lifelong learning with deep reinforcement learning. Selective experience replay aims to recount selected experiences from previous tasks to avoid catastrophic forgetting. Furthermore, selective experience replay based techniques are model agnostic and allow experiences to be shared across different models. However, storing experiences from all previous tasks make lifelong learning using selective experience replay computationally very expensive and impractical as the number of tasks increase. To that end, we propose a reward distribution-preserving coreset compression technique for compressing experience replay buffers stored for selective experience replay.  We evaluated the coreset compression technique on the brain tumor segmentation (BRATS) dataset for the task of ventricle localization and on the whole-body MRI for localization of left knee cap, left kidney, right trochanter, left lung, and spleen. The coreset lifel",
    "path": "papers/23/02/2302.11510.json",
    "total_tokens": 887,
    "translated_title": "使用核心集的选择性经验回放压缩用于医学影像领域中的终身深度强化学习",
    "translated_abstract": "选择性经验回放是将深度强化学习与终身学习结合的一种流行策略。选择性经验回放旨在重述以前任务中的选择性经验，以避免灾难性遗忘。此外，基于选择性经验回放的技术是模型不可知的，并允许在不同模型之间共享经验。然而，存储所有以前任务的经验会使得使用选择性经验回放的终身学习变得计算上非常昂贵和不切实际，特别是随着任务数量的增加。",
    "tldr": "本文提出了一种使用核心集进行选择性经验回放压缩的技术，可以提升终身学习的效率，应用于医学影像领域。",
    "en_tdlr": "This paper proposes a coreset compression technique for selective experience replay, which improves the efficiency of lifelong learning and is applied to medical imaging."
}