{
    "title": "A Generalized Surface Loss for Reducing the Hausdorff Distance in Medical Imaging Segmentation. (arXiv:2302.03868v3 [eess.IV] UPDATED)",
    "abstract": "Within medical imaging segmentation, the Dice coefficient and Hausdorff-based metrics are standard measures of success for deep learning models. However, modern loss functions for medical image segmentation often only consider the Dice coefficient or similar region-based metrics during training. As a result, segmentation architectures trained over such loss functions run the risk of achieving high accuracy for the Dice coefficient but low accuracy for Hausdorff-based metrics. Low accuracy on Hausdorff-based metrics can be problematic for applications such as tumor segmentation, where such benchmarks are crucial. For example, high Dice scores accompanied by significant Hausdorff errors could indicate that the predictions fail to detect small tumors. We propose the Generalized Surface Loss function, a novel loss function to minimize Hausdorff-based metrics with more desirable numerical properties than current methods and with weighting terms for class imbalance. Our loss function outperf",
    "link": "http://arxiv.org/abs/2302.03868",
    "context": "Title: A Generalized Surface Loss for Reducing the Hausdorff Distance in Medical Imaging Segmentation. (arXiv:2302.03868v3 [eess.IV] UPDATED)\nAbstract: Within medical imaging segmentation, the Dice coefficient and Hausdorff-based metrics are standard measures of success for deep learning models. However, modern loss functions for medical image segmentation often only consider the Dice coefficient or similar region-based metrics during training. As a result, segmentation architectures trained over such loss functions run the risk of achieving high accuracy for the Dice coefficient but low accuracy for Hausdorff-based metrics. Low accuracy on Hausdorff-based metrics can be problematic for applications such as tumor segmentation, where such benchmarks are crucial. For example, high Dice scores accompanied by significant Hausdorff errors could indicate that the predictions fail to detect small tumors. We propose the Generalized Surface Loss function, a novel loss function to minimize Hausdorff-based metrics with more desirable numerical properties than current methods and with weighting terms for class imbalance. Our loss function outperf",
    "path": "papers/23/02/2302.03868.json",
    "total_tokens": 923,
    "translated_title": "降低医学成像分割中Hausdorff距离的广义表面损失函数",
    "translated_abstract": "在医学成像分割中，Dice系数和基于Hausdorff的度量是评估深度学习模型成功的标准。然而，现代医学图像分割的损失函数通常只考虑Dice系数或类似的基于区域的度量。因此，使用这些损失函数训练的分割结构在Dice系数上可能具有高准确度，但在基于Hausdorff的度量上准确度低。基于Hausdorff的度量准确度低可能会对肿瘤分割等应用造成问题，因为这些度量值至关重要。例如，高Dice评分伴随着显著的Hausdorff错误可能意味着预测未能检测到小的肿瘤。我们提出了广义表面损失函数，这是一种新颖的损失函数，用于最小化基于Hausdorff的度量，并具有比当前方法更理想的数值特性和用于处理类别不平衡的加权项。",
    "tldr": "该论文提出了一种名为广义表面损失函数的新方法，用于在医学图像分割中降低Hausdorff距离。该方法考虑了类别不平衡，并具有比现有方法更好的数值特性。该方法对于肿瘤分割等应用非常重要。"
}