{
    "title": "Product Question Answering in E-Commerce: A Survey. (arXiv:2302.08092v2 [cs.CL] UPDATED)",
    "abstract": "Product question answering (PQA), aiming to automatically provide instant responses to customer's questions in E-Commerce platforms, has drawn increasing attention in recent years. Compared with typical QA problems, PQA exhibits unique challenges such as the subjectivity and reliability of user-generated contents in E-commerce platforms. Therefore, various problem settings and novel methods have been proposed to capture these special characteristics. In this paper, we aim to systematically review existing research efforts on PQA. Specifically, we categorize PQA studies into four problem settings in terms of the form of provided answers. We analyze the pros and cons, as well as present existing datasets and evaluation protocols for each setting. We further summarize the most significant challenges that characterize PQA from general QA applications and discuss their corresponding solutions. Finally, we conclude this paper by providing the prospect on several future directions.",
    "link": "http://arxiv.org/abs/2302.08092",
    "context": "Title: Product Question Answering in E-Commerce: A Survey. (arXiv:2302.08092v2 [cs.CL] UPDATED)\nAbstract: Product question answering (PQA), aiming to automatically provide instant responses to customer's questions in E-Commerce platforms, has drawn increasing attention in recent years. Compared with typical QA problems, PQA exhibits unique challenges such as the subjectivity and reliability of user-generated contents in E-commerce platforms. Therefore, various problem settings and novel methods have been proposed to capture these special characteristics. In this paper, we aim to systematically review existing research efforts on PQA. Specifically, we categorize PQA studies into four problem settings in terms of the form of provided answers. We analyze the pros and cons, as well as present existing datasets and evaluation protocols for each setting. We further summarize the most significant challenges that characterize PQA from general QA applications and discuss their corresponding solutions. Finally, we conclude this paper by providing the prospect on several future directions.",
    "path": "papers/23/02/2302.08092.json",
    "total_tokens": 834,
    "translated_title": "电商产品问答：一项综述调查",
    "translated_abstract": "产品问答（PQA）致力于在电商平台上自动快速回复客户问题，近年来受到越来越多的关注。与典型的问答问题相比，PQA表现出了独特的挑战，例如电商平台上用户生成内容的主观性和可靠性。因此，各种问题设置和新方法已被提出来捕捉这些特殊特征。本文旨在系统地审查现有关于PQA的研究工作。具体而言，我们将PQA研究按提供的答案形式将其分类为四个问题设置。我们分析了每个设置的优缺点，并介绍了现有的数据集和评估协议。我们进一步总结了表征PQA与一般QA应用的最显著的挑战，并讨论了相应的解决方案。最后，我们通过提供几个未来方向来结束本文。",
    "tldr": "电商PQA的研究面临着问题多、数据难收集、答案不确定等特殊挑战。本文系统地综述了PQA研究的现状与未来方向。",
    "en_tdlr": "Product question answering is aimed at automatically providing instant responses to customer questions in e-commerce platforms. This paper systematically reviews existing research efforts on PQA and summarizes the most significant challenges that characterize PQA from general QA applications, as well as future directions."
}