{
    "title": "Towards a User Privacy-Aware Mobile Gaming App Installation Prediction Model. (arXiv:2302.03332v2 [cs.LG] UPDATED)",
    "abstract": "Over the past decade, programmatic advertising has received a great deal of attention in the online advertising industry. A real-time bidding (RTB) system is rapidly becoming the most popular method to buy and sell online advertising impressions. Within the RTB system, demand-side platforms (DSP) aim to spend advertisers' campaign budgets efficiently while maximizing profit, seeking impressions that result in high user responses, such as clicks or installs. In the current study, we investigate the process of predicting a mobile gaming app installation from the point of view of a particular DSP, while paying attention to user privacy, and exploring the trade-off between privacy preservation and model performance. There are multiple levels of potential threats to user privacy, depending on the privacy leaks associated with the data-sharing process, such as data transformation or de-anonymization. To address these concerns, privacy-preserving techniques were proposed, such as cryptographi",
    "link": "http://arxiv.org/abs/2302.03332",
    "context": "Title: Towards a User Privacy-Aware Mobile Gaming App Installation Prediction Model. (arXiv:2302.03332v2 [cs.LG] UPDATED)\nAbstract: Over the past decade, programmatic advertising has received a great deal of attention in the online advertising industry. A real-time bidding (RTB) system is rapidly becoming the most popular method to buy and sell online advertising impressions. Within the RTB system, demand-side platforms (DSP) aim to spend advertisers' campaign budgets efficiently while maximizing profit, seeking impressions that result in high user responses, such as clicks or installs. In the current study, we investigate the process of predicting a mobile gaming app installation from the point of view of a particular DSP, while paying attention to user privacy, and exploring the trade-off between privacy preservation and model performance. There are multiple levels of potential threats to user privacy, depending on the privacy leaks associated with the data-sharing process, such as data transformation or de-anonymization. To address these concerns, privacy-preserving techniques were proposed, such as cryptographi",
    "path": "papers/23/02/2302.03332.json",
    "total_tokens": 824,
    "translated_title": "一种针对用户隐私的移动游戏应用安装预测模型研究",
    "translated_abstract": "过去十年中，程序化广告在在线广告行业中备受关注。实时竞价系统正在迅速成为购买和出售在线广告展现量的最流行方法。在实时竞价系统中，需求方平台旨在有效地支配广告商的推广预算，同时最大化利润，寻求产生高用户响应（如点击或安装）的展示量。在当前研究中，我们从特定需求方平台的角度研究了预测移动游戏应用安装的过程，同时注意保护用户隐私并探讨隐私保护和模型性能之间的权衡。可能存在多个级别的潜在用户隐私威胁，这取决于与数据共享流程相关的隐私泄漏，例如数据转换或去匿名化。为应对这些问题，提出了隐私保护技术，例如密码学。",
    "tldr": "本文研究了一种针对用户隐私的移动游戏应用安装预测模型，探讨了隐私保护和模型性能之间的平衡。",
    "en_tdlr": "This paper investigates a user privacy-aware mobile gaming app installation prediction model, exploring the trade-off between privacy preservation and model performance."
}