{
    "title": "Unsupervised Hashing with Similarity Distribution Calibration. (arXiv:2302.07669v2 [cs.CV] UPDATED)",
    "abstract": "Unsupervised hashing methods typically aim to preserve the similarity between data points in a feature space by mapping them to binary hash codes. However, these methods often overlook the fact that the similarity between data points in the continuous feature space may not be preserved in the discrete hash code space, due to the limited similarity range of hash codes. The similarity range is bounded by the code length and can lead to a problem known as similarity collapse. That is, the positive and negative pairs of data points become less distinguishable from each other in the hash space. To alleviate this problem, in this paper a novel Similarity Distribution Calibration (SDC) method is introduced. SDC aligns the hash code similarity distribution towards a calibration distribution (e.g., beta distribution) with sufficient spread across the entire similarity range, thus alleviating the similarity collapse problem. Extensive experiments show that our SDC outperforms significantly the s",
    "link": "http://arxiv.org/abs/2302.07669",
    "context": "Title: Unsupervised Hashing with Similarity Distribution Calibration. (arXiv:2302.07669v2 [cs.CV] UPDATED)\nAbstract: Unsupervised hashing methods typically aim to preserve the similarity between data points in a feature space by mapping them to binary hash codes. However, these methods often overlook the fact that the similarity between data points in the continuous feature space may not be preserved in the discrete hash code space, due to the limited similarity range of hash codes. The similarity range is bounded by the code length and can lead to a problem known as similarity collapse. That is, the positive and negative pairs of data points become less distinguishable from each other in the hash space. To alleviate this problem, in this paper a novel Similarity Distribution Calibration (SDC) method is introduced. SDC aligns the hash code similarity distribution towards a calibration distribution (e.g., beta distribution) with sufficient spread across the entire similarity range, thus alleviating the similarity collapse problem. Extensive experiments show that our SDC outperforms significantly the s",
    "path": "papers/23/02/2302.07669.json",
    "total_tokens": 865,
    "translated_title": "无监督哈希与相似性分布校准",
    "translated_abstract": "无监督哈希方法通常旨在通过将数据映射到二进制哈希码来保留特征空间中数据点之间的相似性。然而，这些方法经常忽视一个事实，即在离散的哈希码空间中，连续特征空间中的数据点之间的相似性可能无法被保留，这是因为哈希码的相似性范围受到了限制。相似性范围受到哈希码长度的限制，可能导致一个称为相似性坍缩的问题。也就是说，正负数据点对在哈希空间中变得不太可区分。为了缓解这个问题，本文提出了一种新颖的相似性分布校准（SDC）方法。SDC将哈希码相似性分布对齐到一个校准分布（例如beta分布），使得整个相似性范围都有足够的分散，从而缓解了相似性坍缩问题。大量实验证明我们的SDC明显优于其他方法。",
    "tldr": "本文介绍了一种无监督哈希方法，使用相似性分布校准来解决在离散哈希码空间中的相似性坍缩问题。",
    "en_tdlr": "This paper proposes an unsupervised hashing method that addresses the issue of similarity collapse in the discrete hash code space by utilizing similarity distribution calibration."
}