{
    "title": "A Closer Look at the Intervention Procedure of Concept Bottleneck Models. (arXiv:2302.14260v2 [cs.LG] UPDATED)",
    "abstract": "Concept bottleneck models (CBMs) are a class of interpretable neural network models that predict the target response of a given input based on its high-level concepts. Unlike the standard end-to-end models, CBMs enable domain experts to intervene on the predicted concepts and rectify any mistakes at test time, so that more accurate task predictions can be made at the end. While such intervenability provides a powerful avenue of control, many aspects of the intervention procedure remain rather unexplored. In this work, we develop various ways of selecting intervening concepts to improve the intervention effectiveness and conduct an array of in-depth analyses as to how they evolve under different circumstances. Specifically, we find that an informed intervention strategy can reduce the task error more than ten times compared to the current baseline under the same amount of intervention counts in realistic settings, and yet, this can vary quite significantly when taking into account diffe",
    "link": "http://arxiv.org/abs/2302.14260",
    "context": "Title: A Closer Look at the Intervention Procedure of Concept Bottleneck Models. (arXiv:2302.14260v2 [cs.LG] UPDATED)\nAbstract: Concept bottleneck models (CBMs) are a class of interpretable neural network models that predict the target response of a given input based on its high-level concepts. Unlike the standard end-to-end models, CBMs enable domain experts to intervene on the predicted concepts and rectify any mistakes at test time, so that more accurate task predictions can be made at the end. While such intervenability provides a powerful avenue of control, many aspects of the intervention procedure remain rather unexplored. In this work, we develop various ways of selecting intervening concepts to improve the intervention effectiveness and conduct an array of in-depth analyses as to how they evolve under different circumstances. Specifically, we find that an informed intervention strategy can reduce the task error more than ten times compared to the current baseline under the same amount of intervention counts in realistic settings, and yet, this can vary quite significantly when taking into account diffe",
    "path": "papers/23/02/2302.14260.json",
    "total_tokens": 922,
    "translated_title": "对概念瓶颈模型介入程序的更深入研究",
    "translated_abstract": "概念瓶颈模型(CBMs)是一类可解释的神经网络模型，基于其高级概念预测给定输入的目标响应。与标准的端到端模型不同，CBMs使领域专家能够在测试时对预测的概念进行干预并纠正任何错误，以便在最终进行更准确的任务预测。尽管这种可干预性提供了一种强大的控制途径，但介入程序的许多方面仍然相当未知。在本研究中，我们开发了各种方式来选择介入概念以提高介入效果，并进行了各种深入的分析，以了解在不同情况下它们的演变方式。具体而言，我们发现在实际情况下，经过明智介入的策略可以将任务误差降低十倍以上，而与当前基线相比，在相同数量的干预次数下，这个差异可以相当明显。",
    "tldr": "本文研究了概念瓶颈模型介入程序的提高介入效果的方法，通过选择介入概念以及深入分析发现，在实际情况下，明智的介入策略可以将任务误差降低十倍以上，而且这个差异可相当明显。",
    "en_tdlr": "This paper investigates various ways of improving the intervention effectiveness of concept bottleneck models (CBMs) by selecting intervening concepts and analyzing their evolution under different circumstances. The authors find that informed intervention strategies can reduce task error more than ten times compared to the current baseline in realistic settings."
}