{
    "title": "Aligned Diffusion Schr\\\"odinger Bridges. (arXiv:2302.11419v2 [cs.LG] UPDATED)",
    "abstract": "Diffusion Schr\\\"odinger bridges (DSB) have recently emerged as a powerful framework for recovering stochastic dynamics via their marginal observations at different time points. Despite numerous successful applications, existing algorithms for solving DSBs have so far failed to utilize the structure of aligned data, which naturally arises in many biological phenomena. In this paper, we propose a novel algorithmic framework that, for the first time, solves DSBs while respecting the data alignment. Our approach hinges on a combination of two decades-old ideas: The classical Schr\\\"odinger bridge theory and Doob's $h$-transform. Compared to prior methods, our approach leads to a simpler training procedure with lower variance, which we further augment with principled regularization schemes. This ultimately leads to sizeable improvements across experiments on synthetic and real data, including the tasks of rigid protein docking and temporal evolution of cellular differentiation processes.",
    "link": "http://arxiv.org/abs/2302.11419",
    "context": "Title: Aligned Diffusion Schr\\\"odinger Bridges. (arXiv:2302.11419v2 [cs.LG] UPDATED)\nAbstract: Diffusion Schr\\\"odinger bridges (DSB) have recently emerged as a powerful framework for recovering stochastic dynamics via their marginal observations at different time points. Despite numerous successful applications, existing algorithms for solving DSBs have so far failed to utilize the structure of aligned data, which naturally arises in many biological phenomena. In this paper, we propose a novel algorithmic framework that, for the first time, solves DSBs while respecting the data alignment. Our approach hinges on a combination of two decades-old ideas: The classical Schr\\\"odinger bridge theory and Doob's $h$-transform. Compared to prior methods, our approach leads to a simpler training procedure with lower variance, which we further augment with principled regularization schemes. This ultimately leads to sizeable improvements across experiments on synthetic and real data, including the tasks of rigid protein docking and temporal evolution of cellular differentiation processes.",
    "path": "papers/23/02/2302.11419.json",
    "total_tokens": 950,
    "translated_title": "对齐扩散薛定谔桥",
    "translated_abstract": "最近，通过在不同时间点的边际观察恢复随机动态的扩散薛定谔桥(DSB)已经成为一个强大的框架。尽管有许多成功的应用，但现有算法尚未利用多种生物现象中自然出现的对齐数据结构来解决DSB。在本文中，我们提出了一个新的算法框架，首次在考虑对齐数据的同时解决了DSB问题。我们的方法依靠两个二十年历史的思想结合起来：经典的薛定谔桥理论和Doob的$h$-变换。相对于之前的方法，我们的方法导致训练过程更简单，方差更低，并且我们还使用了原则性的正则化方案。这最终在合成和真实数据的实验中导致了显着的改进，包括刚性蛋白质对接和细胞分化过程的时间演化等任务。",
    "tldr": "本文提出一种新的算法框架，首次能够在考虑对齐数据的同时解决扩散薛定谔桥问题，相对于之前的方法，有更简单、方差更低的训练过程，并使用原则性的正则化方案，在实验中取得了显着的改进。",
    "en_tdlr": "This paper proposes a novel algorithmic framework that, for the first time, solves Diffusion Schr\\\"odinger Bridges (DSBs) while respecting the data alignment. Compared to prior methods, our approach leads to a simpler training procedure with lower variance, which we further augment with principled regularization schemes. This ultimately leads to sizeable improvements across experiments on synthetic and real data, including the tasks of rigid protein docking and temporal evolution of cellular differentiation processes."
}