{
    "title": "Multi-View Clustering from the Perspective of Mutual Information. (arXiv:2302.08743v2 [cs.LG] UPDATED)",
    "abstract": "Exploring the complementary information of multi-view data to improve clustering effects is a crucial issue in multi-view clustering. In this paper, we propose a novel model based on information theory termed Informative Multi-View Clustering (IMVC), which extracts the common and view-specific information hidden in multi-view data and constructs a clustering-oriented comprehensive representation. More specifically, we concatenate multiple features into a unified feature representation, then pass it through a encoder to retrieve the common representation across views. Simultaneously, the features of each view are sent to a encoder to produce a compact view-specific representation, respectively. Thus, we constrain the mutual information between the common representation and view-specific representations to be minimal for obtaining multi-level information. Further, the common representation and view-specific representation are spliced to model the refined representation of each view, whic",
    "link": "http://arxiv.org/abs/2302.08743",
    "context": "Title: Multi-View Clustering from the Perspective of Mutual Information. (arXiv:2302.08743v2 [cs.LG] UPDATED)\nAbstract: Exploring the complementary information of multi-view data to improve clustering effects is a crucial issue in multi-view clustering. In this paper, we propose a novel model based on information theory termed Informative Multi-View Clustering (IMVC), which extracts the common and view-specific information hidden in multi-view data and constructs a clustering-oriented comprehensive representation. More specifically, we concatenate multiple features into a unified feature representation, then pass it through a encoder to retrieve the common representation across views. Simultaneously, the features of each view are sent to a encoder to produce a compact view-specific representation, respectively. Thus, we constrain the mutual information between the common representation and view-specific representations to be minimal for obtaining multi-level information. Further, the common representation and view-specific representation are spliced to model the refined representation of each view, whic",
    "path": "papers/23/02/2302.08743.json",
    "total_tokens": 786,
    "translated_title": "多视角互信息聚类方法",
    "translated_abstract": "探究多视角数据之间的互补信息以提高聚类效果是多视角聚类中的关键问题。本文提出了一种基于信息理论的新模型——信息性多视角聚类（IMVC），它提取多视角数据中隐藏的共同信息和特定视角信息，并构建面向聚类的综合表示。具体来说，我们将多个特征连接成一个统一特征表示，然后通过编码器将其传递以检索跨视图的共同表示。同时，每个视图的特征被发送到编码器以产生紧凑的视图特定表示。因此，我们约束共同表示和视图特定表示之间的互信息最小，以获得多层次信息。进一步地，我们将共同表示和视图特定表示拼接起来，建模每个视图的精细表示。",
    "tldr": "本文提出了一种信息性多视角聚类（IMVC）方法，通过约束共同表示和视图特定表示之间的互信息最小，提高多视角数据聚类效果。",
    "en_tdlr": "This paper proposes an Informative Multi-View Clustering (IMVC) method, which improves the multi-view data clustering effect by constraining the mutual information between the common representation and view-specific representations to be minimal."
}