{
    "title": "MFBE: Leveraging Multi-Field Information of FAQs for Efficient Dense Retrieval. (arXiv:2302.11953v2 [cs.IR] UPDATED)",
    "abstract": "In the domain of question-answering in NLP, the retrieval of Frequently Asked Questions (FAQ) is an important sub-area which is well researched and has been worked upon for many languages. Here, in response to a user query, a retrieval system typically returns the relevant FAQs from a knowledge-base. The efficacy of such a system depends on its ability to establish semantic match between the query and the FAQs in real-time. The task becomes challenging due to the inherent lexical gap between queries and FAQs, lack of sufficient context in FAQ titles, scarcity of labeled data and high retrieval latency. In this work, we propose a bi-encoder-based query-FAQ matching model that leverages multiple combinations of FAQ fields (like, question, answer, and category) both during model training and inference. Our proposed Multi-Field Bi-Encoder (MFBE) model benefits from the additional context resulting from multiple FAQ fields and performs well even with minimal labeled data. We empirically sup",
    "link": "http://arxiv.org/abs/2302.11953",
    "context": "Title: MFBE: Leveraging Multi-Field Information of FAQs for Efficient Dense Retrieval. (arXiv:2302.11953v2 [cs.IR] UPDATED)\nAbstract: In the domain of question-answering in NLP, the retrieval of Frequently Asked Questions (FAQ) is an important sub-area which is well researched and has been worked upon for many languages. Here, in response to a user query, a retrieval system typically returns the relevant FAQs from a knowledge-base. The efficacy of such a system depends on its ability to establish semantic match between the query and the FAQs in real-time. The task becomes challenging due to the inherent lexical gap between queries and FAQs, lack of sufficient context in FAQ titles, scarcity of labeled data and high retrieval latency. In this work, we propose a bi-encoder-based query-FAQ matching model that leverages multiple combinations of FAQ fields (like, question, answer, and category) both during model training and inference. Our proposed Multi-Field Bi-Encoder (MFBE) model benefits from the additional context resulting from multiple FAQ fields and performs well even with minimal labeled data. We empirically sup",
    "path": "papers/23/02/2302.11953.json",
    "total_tokens": 960,
    "translated_title": "MFBE：利用FAQ的多领域信息进行高效密集检索",
    "translated_abstract": "在自然语言处理的问答领域中，频繁询问问题（FAQ）的检索是一个被广泛研究的重要子领域。这里，在回应用户查询时，检索系统通常会从知识库返回相关的FAQ。这种系统的有效性取决于其在实时建立查询和FAQ之间的语义匹配的能力。由于查询和FAQ之间的固有词汇差距，FAQ标题中缺乏足够的上下文，标记数据稀缺和高检索延迟，这项任务变得具有挑战性。在这项工作中，我们提出了一个基于双编码器的查询-FAQ匹配模型，它在模型训练和推理过程中利用FAQ的多个领域组合（如问题、答案和类别）。我们提出的多领域双编码器（MFBE）模型从多个FAQ领域的额外上下文中获益，并且即使只有很少的标记数据也表现出色。我们通过实验证明了我们的方法的有效性。",
    "tldr": "本文提出了一个双编码器的查询-FAQ匹配模型，称为MFBE，利用FAQ的多个领域组合，在模型训练和推理过程中获益，解决了诸如固有词汇差距、FAQ标题中缺乏足够的上下文等问题，具有很好的实验结果。"
}