{
    "title": "A Complete Expressiveness Hierarchy for Subgraph GNNs via Subgraph Weisfeiler-Lehman Tests. (arXiv:2302.07090v2 [cs.LG] UPDATED)",
    "abstract": "Recently, subgraph GNNs have emerged as an important direction for developing expressive graph neural networks (GNNs). While numerous architectures have been proposed, so far there is still a limited understanding of how various design paradigms differ in terms of expressive power, nor is it clear what design principle achieves maximal expressiveness with minimal architectural complexity. To address these fundamental questions, this paper conducts a systematic study of general node-based subgraph GNNs through the lens of Subgraph Weisfeiler-Lehman Tests (SWL). Our central result is to build a complete hierarchy of SWL with strictly growing expressivity. Concretely, we prove that any node-based subgraph GNN falls into one of the six SWL equivalence classes, among which $\\mathsf{SSWL}$ achieves the maximal expressive power. We also study how these equivalence classes differ in terms of their practical expressiveness such as encoding graph distance and biconnectivity. Furthermore, we give",
    "link": "http://arxiv.org/abs/2302.07090",
    "context": "Title: A Complete Expressiveness Hierarchy for Subgraph GNNs via Subgraph Weisfeiler-Lehman Tests. (arXiv:2302.07090v2 [cs.LG] UPDATED)\nAbstract: Recently, subgraph GNNs have emerged as an important direction for developing expressive graph neural networks (GNNs). While numerous architectures have been proposed, so far there is still a limited understanding of how various design paradigms differ in terms of expressive power, nor is it clear what design principle achieves maximal expressiveness with minimal architectural complexity. To address these fundamental questions, this paper conducts a systematic study of general node-based subgraph GNNs through the lens of Subgraph Weisfeiler-Lehman Tests (SWL). Our central result is to build a complete hierarchy of SWL with strictly growing expressivity. Concretely, we prove that any node-based subgraph GNN falls into one of the six SWL equivalence classes, among which $\\mathsf{SSWL}$ achieves the maximal expressive power. We also study how these equivalence classes differ in terms of their practical expressiveness such as encoding graph distance and biconnectivity. Furthermore, we give",
    "path": "papers/23/02/2302.07090.json",
    "total_tokens": 1045,
    "translated_title": "基于子图Weisfeiler-Lehman Tests的子图GNN完整表达力层次结构",
    "translated_abstract": "最近，子图GNN已成为开发具有表达力的图神经网络的重要方向。虽然已经提出了许多架构，但目前对各种设计范例的表达能力差异仍存在有限的理解，也不清楚什么设计原则能以最小的架构复杂度实现最大的表达能力。为了回答这些基本问题，本文通过子图Weisfeiler-Lehman Tests（SWL）的视角对一般基于节点的子图GNN进行了系统研究。我们的核心结果是建立了一个SWL完整层次结构，其表达能力是严格增长的。具体来说，我们证明了任何基于节点的子图GNN都属于六个SWL等价类之一，其中 $\\mathsf{SSWL}$ 实现了最大的表达能力。我们还研究了这些等价类在编码图距离和双联通性等实际表达能力方面的差异。此外，我们提供了一个简单的方法来计算任何节点的SWL等价类以及整个图形的编码。",
    "tldr": "本文提出了一个通过子图Weisfeiler-Lehman Tests（SWL）的视角对一般基于节点的子图GNN进行系统研究的方法。其中，我们建立了一个严格增长的SWL完整表达力层次结构，证明了任何基于节点的子图GNN都属于六个SWL等价类之一，其中SSWL实现了最大的表达能力。",
    "en_tdlr": "The paper presents a systematic study of general node-based subgraph GNNs through the lens of Subgraph Weisfeiler-Lehman Tests (SWL) and builds a complete hierarchy of SWL with strictly growing expressivity. The authors prove that any node-based subgraph GNN falls into one of the six SWL equivalence classes and among them $\\mathsf{SSWL}$ achieves the maximal expressive power. Additionally, the authors study the practical expressiveness of these equivalence classes, such as encoding graph distance and biconnectivity."
}