{
    "title": "Towards Few-shot Inductive Link Prediction on Knowledge Graphs: A Relational Anonymous Walk-guided Neural Process Approach. (arXiv:2307.01204v1 [cs.AI])",
    "abstract": "Few-shot inductive link prediction on knowledge graphs (KGs) aims to predict missing links for unseen entities with few-shot links observed. Previous methods are limited to transductive scenarios, where entities exist in the knowledge graphs, so they are unable to handle unseen entities. Therefore, recent inductive methods utilize the sub-graphs around unseen entities to obtain the semantics and predict links inductively. However, in the few-shot setting, the sub-graphs are often sparse and cannot provide meaningful inductive patterns. In this paper, we propose a novel relational anonymous walk-guided neural process for few-shot inductive link prediction on knowledge graphs, denoted as RawNP. Specifically, we develop a neural process-based method to model a flexible distribution over link prediction functions. This enables the model to quickly adapt to new entities and estimate the uncertainty when making predictions. To capture general inductive patterns, we present a relational anony",
    "link": "http://arxiv.org/abs/2307.01204",
    "context": "Title: Towards Few-shot Inductive Link Prediction on Knowledge Graphs: A Relational Anonymous Walk-guided Neural Process Approach. (arXiv:2307.01204v1 [cs.AI])\nAbstract: Few-shot inductive link prediction on knowledge graphs (KGs) aims to predict missing links for unseen entities with few-shot links observed. Previous methods are limited to transductive scenarios, where entities exist in the knowledge graphs, so they are unable to handle unseen entities. Therefore, recent inductive methods utilize the sub-graphs around unseen entities to obtain the semantics and predict links inductively. However, in the few-shot setting, the sub-graphs are often sparse and cannot provide meaningful inductive patterns. In this paper, we propose a novel relational anonymous walk-guided neural process for few-shot inductive link prediction on knowledge graphs, denoted as RawNP. Specifically, we develop a neural process-based method to model a flexible distribution over link prediction functions. This enables the model to quickly adapt to new entities and estimate the uncertainty when making predictions. To capture general inductive patterns, we present a relational anony",
    "path": "papers/23/07/2307.01204.json",
    "total_tokens": 992,
    "translated_title": "面向知识图谱的少样本归纳链接预测：一种基于关系匿名漫步引导的神经过程方法",
    "translated_abstract": "知识图谱上的少样本归纳链接预测旨在用少样本的链接来预测未见实体的缺失链接。以往的方法仅限于传导场景，即在知识图谱中存在实体，因此无法处理未见实体。因此，近期的归纳方法利用未见实体周围的子图来获取语义并归纳地预测链接。然而，在少样本场景下，子图通常是稀疏的，无法提供有意义的归纳模式。本文提出了一种新颖的基于关系匿名漫步引导的神经过程，用于知识图谱上的少样本归纳链接预测，称为RawNP。具体而言，我们开发了一种基于神经过程的方法，对链接预测函数建模为灵活的分布。这使得模型能够快速适应新的实体并在进行预测时估计不确定性。为了捕捉一般的归纳模式，我们提出了一种关系匿名漫步方法。",
    "tldr": "本文提出了一种基于关系匿名漫步引导的神经过程方法，用于知识图谱上的少样本归纳链接预测。该方法利用未见实体周围的子图来获取语义并归纳地预测链接，在捕捉一般的归纳模式的同时，还能快速适应新的实体并估计预测的不确定性。"
}