{
    "title": "CorrFL: Correlation-Based Neural Network Architecture for Unavailability Concerns in a Heterogeneous IoT Environment. (arXiv:2307.12149v1 [cs.LG])",
    "abstract": "The Federated Learning (FL) paradigm faces several challenges that limit its application in real-world environments. These challenges include the local models' architecture heterogeneity and the unavailability of distributed Internet of Things (IoT) nodes due to connectivity problems. These factors posit the question of \"how can the available models fill the training gap of the unavailable models?\". This question is referred to as the \"Oblique Federated Learning\" problem. This problem is encountered in the studied environment that includes distributed IoT nodes responsible for predicting CO2 concentrations. This paper proposes the Correlation-based FL (CorrFL) approach influenced by the representational learning field to address this problem. CorrFL projects the various model weights to a common latent space to address the model heterogeneity. Its loss function minimizes the reconstruction loss when models are absent and maximizes the correlation between the generated models. The latte",
    "link": "http://arxiv.org/abs/2307.12149",
    "context": "Title: CorrFL: Correlation-Based Neural Network Architecture for Unavailability Concerns in a Heterogeneous IoT Environment. (arXiv:2307.12149v1 [cs.LG])\nAbstract: The Federated Learning (FL) paradigm faces several challenges that limit its application in real-world environments. These challenges include the local models' architecture heterogeneity and the unavailability of distributed Internet of Things (IoT) nodes due to connectivity problems. These factors posit the question of \"how can the available models fill the training gap of the unavailable models?\". This question is referred to as the \"Oblique Federated Learning\" problem. This problem is encountered in the studied environment that includes distributed IoT nodes responsible for predicting CO2 concentrations. This paper proposes the Correlation-based FL (CorrFL) approach influenced by the representational learning field to address this problem. CorrFL projects the various model weights to a common latent space to address the model heterogeneity. Its loss function minimizes the reconstruction loss when models are absent and maximizes the correlation between the generated models. The latte",
    "path": "papers/23/07/2307.12149.json",
    "total_tokens": 880,
    "translated_title": "CorrFL: 异质IoT环境中基于相关性的神经网络架构，用于处理不可用问题",
    "translated_abstract": "联邦学习(Federated Learning, FL)范式在现实环境中面临一些限制，包括本地模型架构的异质性以及由于连接问题导致分布式物联网(IoT)节点不可用的挑战。这些因素提出了一个问题：“如何填补不可用模型的训练差距？”这个问题被称为“斜线联合学习”问题。本文提出了受表征学习领域影响的基于相关性的FL (CorrFL)方法来解决这个问题。CorrFL将各种模型权重投影到一个共同的潜空间中，以解决模型的异质性问题。其损失函数在模型缺失时最小化重构损失，并最大化生成模型之间的相关性。",
    "tldr": "本论文提出了一种基于相关性的神经网络架构来解决联邦学习中的异质模型和不可用节点的问题，通过将模型权重投影到共同的潜空间，并通过最小化重构损失和最大化相关性来实现模型的填补和预测。"
}