{
    "title": "Anticipating Technical Expertise and Capability Evolution in Research Communities using Dynamic Graph Transformers. (arXiv:2307.09665v1 [cs.LG])",
    "abstract": "The ability to anticipate technical expertise and capability evolution trends globally is essential for national and global security, especially in safety-critical domains like nuclear nonproliferation (NN) and rapidly emerging fields like artificial intelligence (AI). In this work, we extend traditional statistical relational learning approaches (e.g., link prediction in collaboration networks) and formulate a problem of anticipating technical expertise and capability evolution using dynamic heterogeneous graph representations. We develop novel capabilities to forecast collaboration patterns, authorship behavior, and technical capability evolution at different granularities (e.g., scientist and institution levels) in two distinct research fields. We implement a dynamic graph transformer (DGT) neural architecture, which pushes the state-of-the-art graph neural network models by (a) forecasting heterogeneous (rather than homogeneous) nodes and edges, and (b) relying on both discrete -- ",
    "link": "http://arxiv.org/abs/2307.09665",
    "context": "Title: Anticipating Technical Expertise and Capability Evolution in Research Communities using Dynamic Graph Transformers. (arXiv:2307.09665v1 [cs.LG])\nAbstract: The ability to anticipate technical expertise and capability evolution trends globally is essential for national and global security, especially in safety-critical domains like nuclear nonproliferation (NN) and rapidly emerging fields like artificial intelligence (AI). In this work, we extend traditional statistical relational learning approaches (e.g., link prediction in collaboration networks) and formulate a problem of anticipating technical expertise and capability evolution using dynamic heterogeneous graph representations. We develop novel capabilities to forecast collaboration patterns, authorship behavior, and technical capability evolution at different granularities (e.g., scientist and institution levels) in two distinct research fields. We implement a dynamic graph transformer (DGT) neural architecture, which pushes the state-of-the-art graph neural network models by (a) forecasting heterogeneous (rather than homogeneous) nodes and edges, and (b) relying on both discrete -- ",
    "path": "papers/23/07/2307.09665.json",
    "total_tokens": 845,
    "translated_title": "使用动态图转换器预测研究社区中的技术专长和能力演进",
    "translated_abstract": "能够预测全球技术专长和能力演进趋势对国家和全球安全非常重要，特别是在核不扩散（NN）等安全关键领域和人工智能（AI）等快速兴起的领域。本研究扩展了传统的统计关系学习方法（例如，协作网络中的链接预测），并制定了使用动态异构图表示来预测技术专长和能力演进的问题。我们开发了新的能力来预测不同粒度（例如科学家和机构级别）的协作模式，作者行为和技术能力演进。我们实现了一种动态图转换器（DGT）神经架构，通过（a）预测异构（而不是同构）节点和边缘，并（b）依赖于离散和连续特征，推动了最先进的图神经网络模型的发展。",
    "tldr": "这项研究通过使用动态图转换器预测研究社区中的技术专长和能力演进，从而提高了全球安全和核不扩散等领域的预测能力。"
}