{
    "title": "Beyond the Snapshot: Brain Tokenized Graph Transformer for Longitudinal Brain Functional Connectome Embedding. (arXiv:2307.00858v2 [q-bio.NC] UPDATED)",
    "abstract": "Under the framework of network-based neurodegeneration, brain functional connectome (FC)-based Graph Neural Networks (GNN) have emerged as a valuable tool for the diagnosis and prognosis of neurodegenerative diseases such as Alzheimer's disease (AD). However, these models are tailored for brain FC at a single time point instead of characterizing FC trajectory. Discerning how FC evolves with disease progression, particularly at the predementia stages such as cognitively normal individuals with amyloid deposition or individuals with mild cognitive impairment (MCI), is crucial for delineating disease spreading patterns and developing effective strategies to slow down or even halt disease advancement. In this work, we proposed the first interpretable framework for brain FC trajectory embedding with application to neurodegenerative disease diagnosis and prognosis, namely Brain Tokenized Graph Transformer (Brain TokenGT). It consists of two modules: 1) Graph Invariant and Variant Embedding (",
    "link": "http://arxiv.org/abs/2307.00858",
    "context": "Title: Beyond the Snapshot: Brain Tokenized Graph Transformer for Longitudinal Brain Functional Connectome Embedding. (arXiv:2307.00858v2 [q-bio.NC] UPDATED)\nAbstract: Under the framework of network-based neurodegeneration, brain functional connectome (FC)-based Graph Neural Networks (GNN) have emerged as a valuable tool for the diagnosis and prognosis of neurodegenerative diseases such as Alzheimer's disease (AD). However, these models are tailored for brain FC at a single time point instead of characterizing FC trajectory. Discerning how FC evolves with disease progression, particularly at the predementia stages such as cognitively normal individuals with amyloid deposition or individuals with mild cognitive impairment (MCI), is crucial for delineating disease spreading patterns and developing effective strategies to slow down or even halt disease advancement. In this work, we proposed the first interpretable framework for brain FC trajectory embedding with application to neurodegenerative disease diagnosis and prognosis, namely Brain Tokenized Graph Transformer (Brain TokenGT). It consists of two modules: 1) Graph Invariant and Variant Embedding (",
    "path": "papers/23/07/2307.00858.json",
    "total_tokens": 1030,
    "translated_title": "超越快照：基于脑连接图的时间序列脑功能连接嵌入的神经网络翻译器",
    "translated_abstract": "在基于网络的神经退行性疾病框架下，基于脑功能连接图的图神经网络已成为诸如阿尔茨海默病等神经退行性疾病的诊断和预后的有价值工具。然而，这些模型专门针对单个时间点的脑功能连接而不是对脑功能连接的轨迹进行表征。辨明脑功能连接随疾病进展的演变方式，特别是在类似于认知正常的淀粉样沉积或轻度认知障碍的前痴呆阶段，对于描绘疾病传播模式并制定有效的减缓甚至阻止疾病进展策略至关重要。在这项工作中，我们提出了第一个适用于神经退行性疾病诊断和预后的脑功能连接轨迹嵌入的解释性框架，即脑连接图嵌入翻译器（Brain TokenGT）。它包含两个模块：1）图不变和变体嵌入（",
    "tldr": "本论文提出了一种新的解释性框架，用于将脑功能连接的轨迹嵌入神经退行性疾病的诊断和预后中，并且提出了脑连接图嵌入翻译器（Brain TokenGT）方法。该方法能够揭示脑功能连接随疾病进展的演变方式，对于制定有效的疾病干预策略具有重要意义。"
}