{
    "title": "Pruning Distorted Images in MNIST Handwritten Digits. (arXiv:2307.14343v1 [cs.CV])",
    "abstract": "Recognizing handwritten digits is a challenging task primarily due to the diversity of writing styles and the presence of noisy images. The widely used MNIST dataset, which is commonly employed as a benchmark for this task, includes distorted digits with irregular shapes, incomplete strokes, and varying skew in both the training and testing datasets. Consequently, these factors contribute to reduced accuracy in digit recognition. To overcome this challenge, we propose a two-stage deep learning approach. In the first stage, we create a simple neural network to identify distorted digits within the training set. This model serves to detect and filter out such distorted and ambiguous images. In the second stage, we exclude these identified images from the training dataset and proceed to retrain the model using the filtered dataset. This process aims to improve the classification accuracy and confidence levels while mitigating issues of underfitting and overfitting. Our experimental results",
    "link": "http://arxiv.org/abs/2307.14343",
    "context": "Title: Pruning Distorted Images in MNIST Handwritten Digits. (arXiv:2307.14343v1 [cs.CV])\nAbstract: Recognizing handwritten digits is a challenging task primarily due to the diversity of writing styles and the presence of noisy images. The widely used MNIST dataset, which is commonly employed as a benchmark for this task, includes distorted digits with irregular shapes, incomplete strokes, and varying skew in both the training and testing datasets. Consequently, these factors contribute to reduced accuracy in digit recognition. To overcome this challenge, we propose a two-stage deep learning approach. In the first stage, we create a simple neural network to identify distorted digits within the training set. This model serves to detect and filter out such distorted and ambiguous images. In the second stage, we exclude these identified images from the training dataset and proceed to retrain the model using the filtered dataset. This process aims to improve the classification accuracy and confidence levels while mitigating issues of underfitting and overfitting. Our experimental results",
    "path": "papers/23/07/2307.14343.json",
    "total_tokens": 876,
    "translated_title": "MNIST手写数字中的扭曲图像剪枝",
    "translated_abstract": "由于书写风格的多样性和噪声图像的存在，识别手写数字是一项具有挑战性的任务。广泛使用的MNIST数据集，作为这个任务的基准，包含具有不规则形状、不完整笔画和变异倾斜度的扭曲数字，同时存在于训练和测试数据集中。因此，这些因素导致了数字识别准确度的降低。为了克服这个挑战，我们提出了一个两阶段的深度学习方法。在第一阶段，我们使用一个简单的神经网络来识别训练集中的扭曲数字。这个模型用于检测和过滤出这些扭曲和模糊的图像。在第二阶段，我们将这些被识别出的图像从训练数据集中排除，并使用过滤后的数据集重新训练模型。这个过程旨在提高分类准确性和置信度，同时减轻欠拟合和过拟合的问题。我们的实验结果证明了这个方法的有效性。",
    "tldr": "本论文提出了一个两阶段的深度学习方法，通过识别和剔除扭曲和模糊图像，从而提高了MNIST数据集中手写数字的分类准确性和置信度。",
    "en_tdlr": "This paper proposes a two-stage deep learning approach that improves the classification accuracy and confidence levels of handwritten digits in the MNIST dataset by identifying and filtering out distorted and ambiguous images."
}