{
    "title": "Enhancing Job Recommendation through LLM-based Generative Adversarial Networks. (arXiv:2307.10747v1 [cs.IR])",
    "abstract": "Recommending suitable jobs to users is a critical task in online recruitment platforms, as it can enhance users' satisfaction and the platforms' profitability. While existing job recommendation methods encounter challenges such as the low quality of users' resumes, which hampers their accuracy and practical effectiveness. With the rapid development of large language models (LLMs), utilizing the rich external knowledge encapsulated within them, as well as their powerful capabilities of text processing and reasoning, is a promising way to complete users' resumes for more accurate recommendations. However, directly leveraging LLMs to enhance recommendation results is not a one-size-fits-all solution, as LLMs may suffer from fabricated generation and few-shot problems, which degrade the quality of resume completion. In this paper, we propose a novel LLM-based approach for job recommendation. To alleviate the limitation of fabricated generation for LLMs, we extract accurate and valuable inf",
    "link": "http://arxiv.org/abs/2307.10747",
    "context": "Title: Enhancing Job Recommendation through LLM-based Generative Adversarial Networks. (arXiv:2307.10747v1 [cs.IR])\nAbstract: Recommending suitable jobs to users is a critical task in online recruitment platforms, as it can enhance users' satisfaction and the platforms' profitability. While existing job recommendation methods encounter challenges such as the low quality of users' resumes, which hampers their accuracy and practical effectiveness. With the rapid development of large language models (LLMs), utilizing the rich external knowledge encapsulated within them, as well as their powerful capabilities of text processing and reasoning, is a promising way to complete users' resumes for more accurate recommendations. However, directly leveraging LLMs to enhance recommendation results is not a one-size-fits-all solution, as LLMs may suffer from fabricated generation and few-shot problems, which degrade the quality of resume completion. In this paper, we propose a novel LLM-based approach for job recommendation. To alleviate the limitation of fabricated generation for LLMs, we extract accurate and valuable inf",
    "path": "papers/23/07/2307.10747.json",
    "total_tokens": 873,
    "translated_title": "通过基于LLM的生成对抗网络增强工作推荐",
    "translated_abstract": "在线招聘平台上向用户推荐合适的工作是一个关键任务，可以提高用户满意度和平台的盈利能力。现有的工作推荐方法面临的挑战包括用户简历的低质量，影响了其准确性和实际效果。随着大型语言模型（LLMs）的快速发展，利用其中包含的丰富外部知识以及它们强大的文本处理和推理能力，是实现更准确的推荐的有希望的方法。然而，直接利用LLMs来增强推荐结果并非适用于所有情况，因为LLMs可能存在虚构生成和少样本问题，降低了简历完成的质量。本文提出了一种新的基于LLM的工作推荐方法。为了缓解LLMs虚构生成的限制，我们提取准确和有价值信息。",
    "tldr": "本论文提出一种基于LLM的生成对抗网络来增强工作推荐。通过利用LLMs丰富的外部知识和文本处理能力，可以提高推荐的准确性。然而，需要解决LLMs虚构生成和少样本问题。"
}