{
    "title": "PromptMagician: Interactive Prompt Engineering for Text-to-Image Creation. (arXiv:2307.09036v1 [cs.AI])",
    "abstract": "Generative text-to-image models have gained great popularity among the public for their powerful capability to generate high-quality images based on natural language prompts. However, developing effective prompts for desired images can be challenging due to the complexity and ambiguity of natural language. This research proposes PromptMagician, a visual analysis system that helps users explore the image results and refine the input prompts. The backbone of our system is a prompt recommendation model that takes user prompts as input, retrieves similar prompt-image pairs from DiffusionDB, and identifies special (important and relevant) prompt keywords. To facilitate interactive prompt refinement, PromptMagician introduces a multi-level visualization for the cross-modal embedding of the retrieved images and recommended keywords, and supports users in specifying multiple criteria for personalized exploration. Two usage scenarios, a user study, and expert interviews demonstrate the effectiv",
    "link": "http://arxiv.org/abs/2307.09036",
    "context": "Title: PromptMagician: Interactive Prompt Engineering for Text-to-Image Creation. (arXiv:2307.09036v1 [cs.AI])\nAbstract: Generative text-to-image models have gained great popularity among the public for their powerful capability to generate high-quality images based on natural language prompts. However, developing effective prompts for desired images can be challenging due to the complexity and ambiguity of natural language. This research proposes PromptMagician, a visual analysis system that helps users explore the image results and refine the input prompts. The backbone of our system is a prompt recommendation model that takes user prompts as input, retrieves similar prompt-image pairs from DiffusionDB, and identifies special (important and relevant) prompt keywords. To facilitate interactive prompt refinement, PromptMagician introduces a multi-level visualization for the cross-modal embedding of the retrieved images and recommended keywords, and supports users in specifying multiple criteria for personalized exploration. Two usage scenarios, a user study, and expert interviews demonstrate the effectiv",
    "path": "papers/23/07/2307.09036.json",
    "total_tokens": 804,
    "translated_title": "PromptMagician：用于文本到图像生成的交互式提示工程",
    "translated_abstract": "生成式文本到图像模型因其基于自然语言提示生成高质量图像的强大能力而受到大众的广泛关注。然而，由于自然语言的复杂性和歧义性，为期望的图像开发有效的提示可能具有挑战性。本研究提出了PromptMagician，一个视觉分析系统，可帮助用户探索图像结果并细化输入的提示。我们系统的主干是一个提示推荐模型，它以用户提示作为输入，从DiffusionDB中检索类似的提示-图像对，并识别出特殊的（重要的和相关的）提示关键词。为了促进交互式提示细化，PromptMagician引入了一个多级可视化，用于检索的图像和推荐的关键词的跨模态嵌入，并支持用户指定多个个性化探索的标准。通过两个使用场景、用户研究和专家访谈，证明了PromptMagician的有效性。",
    "tldr": "PromptMagician是一个交互式的提示工程系统，可以帮助用户针对文本到图像生成任务发展出高效的提示，并通过多级可视化和个性化探索支持用户在输入提示过程中的交互和迭代。"
}