{
    "title": "Towards Reliable Rare Category Analysis on Graphs via Individual Calibration. (arXiv:2307.09858v1 [cs.AI])",
    "abstract": "Rare categories abound in a number of real-world networks and play a pivotal role in a variety of high-stakes applications, including financial fraud detection, network intrusion detection, and rare disease diagnosis. Rare category analysis (RCA) refers to the task of detecting, characterizing, and comprehending the behaviors of minority classes in a highly-imbalanced data distribution. While the vast majority of existing work on RCA has focused on improving the prediction performance, a few fundamental research questions heretofore have received little attention and are less explored: How confident or uncertain is a prediction model in rare category analysis? How can we quantify the uncertainty in the learning process and enable reliable rare category analysis?  To answer these questions, we start by investigating miscalibration in existing RCA methods. Empirical results reveal that state-of-the-art RCA methods are mainly over-confident in predicting minority classes and under-confide",
    "link": "http://arxiv.org/abs/2307.09858",
    "context": "Title: Towards Reliable Rare Category Analysis on Graphs via Individual Calibration. (arXiv:2307.09858v1 [cs.AI])\nAbstract: Rare categories abound in a number of real-world networks and play a pivotal role in a variety of high-stakes applications, including financial fraud detection, network intrusion detection, and rare disease diagnosis. Rare category analysis (RCA) refers to the task of detecting, characterizing, and comprehending the behaviors of minority classes in a highly-imbalanced data distribution. While the vast majority of existing work on RCA has focused on improving the prediction performance, a few fundamental research questions heretofore have received little attention and are less explored: How confident or uncertain is a prediction model in rare category analysis? How can we quantify the uncertainty in the learning process and enable reliable rare category analysis?  To answer these questions, we start by investigating miscalibration in existing RCA methods. Empirical results reveal that state-of-the-art RCA methods are mainly over-confident in predicting minority classes and under-confide",
    "path": "papers/23/07/2307.09858.json",
    "total_tokens": 853,
    "translated_title": "通过个体校准实现图上可靠的稀有类别分析",
    "translated_abstract": "稀有类别在许多现实世界的网络中广泛存在，并在各种高风险应用中起着重要作用，包括金融欺诈检测，网络入侵检测和罕见疾病诊断。稀有类别分析(RCA)是指在高度不平衡的数据分布中检测、表征和理解少数类别行为的任务。虽然现有的RCA研究大多集中在提高预测性能上，但少数几个基础性的研究问题迄今为止受到较少关注和较少探索：在稀有类别分析中，预测模型有多自信或不确定？我们如何量化学习过程中的不确定性，并实现可靠的稀有类别分析？为了回答这些问题，我们首先调查了现有RCA方法中的不正确校准问题。实证结果表明，当前最先进的RCA方法主要在预测少数类别时过于自信且不够自信。",
    "tldr": "该论文研究了稀有类别分析中的不正确校准问题，发现现有的方法在预测少数类别时过于自信且不够自信。",
    "en_tdlr": "This paper investigates the issue of miscalibration in rare category analysis and finds that existing methods are over-confident and under-confident in predicting minority classes."
}