{
    "title": "SAMAug: Point Prompt Augmentation for Segment Anything Model. (arXiv:2307.01187v2 [cs.CV] UPDATED)",
    "abstract": "This paper introduces SAMAug, a novel visual point augmentation method for the Segment Anything Model (SAM) that enhances interactive image segmentation performance. SAMAug generates augmented point prompts to provide more information about the user's intention to SAM. Starting with an initial point prompt, SAM produces an initial mask, which is then fed into our proposed SAMAug to generate augmented point prompts. By incorporating these extra points, SAM can generate augmented segmentation masks based on both the augmented point prompts and the initial prompt, resulting in improved segmentation performance. We conducted evaluations using four different point augmentation strategies: random sampling, sampling based on maximum difference entropy, maximum distance, and saliency. Experiment results on the COCO, Fundus, COVID QUEx, and ISIC2018 datasets show that SAMAug can boost SAM's segmentation results, especially using the maximum distance and saliency. SAMAug demonstrates the potenti",
    "link": "http://arxiv.org/abs/2307.01187",
    "context": "Title: SAMAug: Point Prompt Augmentation for Segment Anything Model. (arXiv:2307.01187v2 [cs.CV] UPDATED)\nAbstract: This paper introduces SAMAug, a novel visual point augmentation method for the Segment Anything Model (SAM) that enhances interactive image segmentation performance. SAMAug generates augmented point prompts to provide more information about the user's intention to SAM. Starting with an initial point prompt, SAM produces an initial mask, which is then fed into our proposed SAMAug to generate augmented point prompts. By incorporating these extra points, SAM can generate augmented segmentation masks based on both the augmented point prompts and the initial prompt, resulting in improved segmentation performance. We conducted evaluations using four different point augmentation strategies: random sampling, sampling based on maximum difference entropy, maximum distance, and saliency. Experiment results on the COCO, Fundus, COVID QUEx, and ISIC2018 datasets show that SAMAug can boost SAM's segmentation results, especially using the maximum distance and saliency. SAMAug demonstrates the potenti",
    "path": "papers/23/07/2307.01187.json",
    "total_tokens": 814,
    "translated_title": "SAMAug: Segment Anything Model的点提示增强方法",
    "translated_abstract": "本文介绍了SAMAug，一种用于增强交互式图像分割性能的新型视觉点提示增强方法。SAMAug生成增强的点提示，以提供更多关于用户意图的信息给SAM。SAM从一个初始点提示开始生成一个初始掩码，然后将其输入我们提出的SAMAug来生成增强的点提示。通过结合这些额外的点，SAM可以基于增强的点提示和初始提示生成增强的分割掩码，从而提高分割性能。我们使用了四种不同的点增强策略进行评估：随机采样，基于最大差异熵的采样，最大距离和显著性。在COCO、Fundus、COVID QUEx和ISIC2018数据集上的实验证实了SAMAug可以提升SAM的分割结果，尤其是使用最大距离和显著性。SAMAug证明了其应用潜力。",
    "tldr": "SAMAug是一种用于增强交互式图像分割性能的方法，通过生成增强的点提示，结合初始提示，可以提高Segment Anything Model的分割结果。",
    "en_tdlr": "SAMAug is a method that enhances interactive image segmentation performance. By generating augmented point prompts and combining them with the initial prompts, it can improve the segmentation results of the Segment Anything Model."
}