{
    "title": "Using simulation to calibrate real data acquisition in veterinary medicine. (arXiv:2307.11695v1 [cs.LG])",
    "abstract": "This paper explores the innovative use of simulation environments to enhance data acquisition and diagnostics in veterinary medicine, focusing specifically on gait analysis in dogs. The study harnesses the power of Blender and the Blenderproc library to generate synthetic datasets that reflect diverse anatomical, environmental, and behavioral conditions. The generated data, represented in graph form and standardized for optimal analysis, is utilized to train machine learning algorithms for identifying normal and abnormal gaits. Two distinct datasets with varying degrees of camera angle granularity are created to further investigate the influence of camera perspective on model accuracy. Preliminary results suggest that this simulation-based approach holds promise for advancing veterinary diagnostics by enabling more precise data acquisition and more effective machine learning models. By integrating synthetic and real-world patient data, the study lays a robust foundation for improving o",
    "link": "http://arxiv.org/abs/2307.11695",
    "context": "Title: Using simulation to calibrate real data acquisition in veterinary medicine. (arXiv:2307.11695v1 [cs.LG])\nAbstract: This paper explores the innovative use of simulation environments to enhance data acquisition and diagnostics in veterinary medicine, focusing specifically on gait analysis in dogs. The study harnesses the power of Blender and the Blenderproc library to generate synthetic datasets that reflect diverse anatomical, environmental, and behavioral conditions. The generated data, represented in graph form and standardized for optimal analysis, is utilized to train machine learning algorithms for identifying normal and abnormal gaits. Two distinct datasets with varying degrees of camera angle granularity are created to further investigate the influence of camera perspective on model accuracy. Preliminary results suggest that this simulation-based approach holds promise for advancing veterinary diagnostics by enabling more precise data acquisition and more effective machine learning models. By integrating synthetic and real-world patient data, the study lays a robust foundation for improving o",
    "path": "papers/23/07/2307.11695.json",
    "total_tokens": 953,
    "translated_title": "使用仿真技术在兽医学中校准真实数据采集",
    "translated_abstract": "本文探讨了在兽医学中创新的使用仿真环境来增强数据采集和诊断的方法，特别关注了犬只的步态分析。研究利用Blender和Blenderproc库生成反映多样解剖、环境和行为条件的合成数据集。生成的数据以图形形式表示，并进行标准化以实现最佳分析效果，然后用于训练机器学习算法以识别正常和异常步态。创建了两个具有不同程度的摄像头角度粒度的数据集，以进一步研究摄像头视角对模型准确性的影响。初步结果表明，这种基于仿真的方法有望通过实现更精确的数据采集和更有效的机器学习模型，推动兽医诊断的进展。通过整合合成和真实世界的患者数据，该研究为改善兽医学的发展奠定了坚实的基础。",
    "tldr": "使用仿真环境来增强兽医学中的数据采集和诊断，特别关注犬只的步态分析。通过生成反映多样条件的合成数据集，训练机器学习算法来识别正常和异常步态，并探索了摄像头视角对模型准确性的影响。初步结果显示，这种仿真方法有望提高兽医诊断的精确性和机器学习模型的效果。"
}