{
    "title": "A stochastic optimization approach to minimize robust density power-based divergences for general parametric density models. (arXiv:2307.05251v1 [stat.ME])",
    "abstract": "Density power divergence (DPD) [Basu et al. (1998), Biometrika], designed to estimate the underlying distribution of the observations robustly, comprises an integral term of the power of the parametric density models to be estimated. While the explicit form of the integral term can be obtained for some specific densities (such as normal density and exponential density), its computational intractability has prohibited the application of DPD-based estimation to more general parametric densities, over a quarter of a century since the proposal of DPD. This study proposes a stochastic optimization approach to minimize DPD for general parametric density models and explains its adequacy by referring to conventional theories on stochastic optimization. The proposed approach also can be applied to the minimization of another density power-based $\\gamma$-divergence with the aid of unnormalized models [Kanamori and Fujisawa (2015), Biometrika].",
    "link": "http://arxiv.org/abs/2307.05251",
    "context": "Title: A stochastic optimization approach to minimize robust density power-based divergences for general parametric density models. (arXiv:2307.05251v1 [stat.ME])\nAbstract: Density power divergence (DPD) [Basu et al. (1998), Biometrika], designed to estimate the underlying distribution of the observations robustly, comprises an integral term of the power of the parametric density models to be estimated. While the explicit form of the integral term can be obtained for some specific densities (such as normal density and exponential density), its computational intractability has prohibited the application of DPD-based estimation to more general parametric densities, over a quarter of a century since the proposal of DPD. This study proposes a stochastic optimization approach to minimize DPD for general parametric density models and explains its adequacy by referring to conventional theories on stochastic optimization. The proposed approach also can be applied to the minimization of another density power-based $\\gamma$-divergence with the aid of unnormalized models [Kanamori and Fujisawa (2015), Biometrika].",
    "path": "papers/23/07/2307.05251.json",
    "total_tokens": 860,
    "translated_title": "用于一般参数密度模型的最小化稳健密度功率分歧的随机优化方法",
    "translated_abstract": "密度功率分歧（DPD）是一种用于稳健地估计观测数据潜在分布的方法，它包括一个要估计的参数密度模型的幂的积分项。虽然对于一些特定的密度（如正态密度和指数密度）可以得到积分项的显式形式，但DPD的计算复杂性使得其无法应用于更一般的参数密度模型，这已经超过了DPD提出的25年。本研究提出了一种用于一般参数密度模型最小化DPD的随机优化方法，并通过参考随机优化的传统理论说明了其适用性。所提出的方法还可以通过使用未归一化模型来最小化另一个基于密度功率的γ-离差[Kanamori和Fujisawa（2015），Biometrika]。",
    "tldr": "本研究提出了一种随机优化方法，用于解决稳健密度功率分歧（DPD）在一般参数密度模型中的计算复杂性问题，并通过应用传统的随机优化理论来验证其有效性。",
    "en_tdlr": "This study proposes a stochastic optimization approach to address the computational complexity issue of robust density power divergence (DPD) in general parametric density models, and validates its effectiveness by applying traditional theories of stochastic optimization."
}