{
    "title": "A Comprehensive Evaluation and Analysis Study for Chinese Spelling Check. (arXiv:2307.13655v1 [cs.CL])",
    "abstract": "With the development of pre-trained models and the incorporation of phonetic and graphic information, neural models have achieved high scores in Chinese Spelling Check (CSC). However, it does not provide a comprehensive reflection of the models' capability due to the limited test sets. In this study, we abstract the representative model paradigm, implement it with nine structures and experiment them on comprehensive test sets we constructed with different purposes. We perform a detailed analysis of the results and find that: 1) Fusing phonetic and graphic information reasonably is effective for CSC. 2) Models are sensitive to the error distribution of the test set, which reflects the shortcomings of models and reveals the direction we should work on. 3) Whether or not the errors and contexts have been seen has a significant impact on models. 4) The commonly used benchmark, SIGHAN, can not reliably evaluate models' performance.",
    "link": "http://arxiv.org/abs/2307.13655",
    "context": "Title: A Comprehensive Evaluation and Analysis Study for Chinese Spelling Check. (arXiv:2307.13655v1 [cs.CL])\nAbstract: With the development of pre-trained models and the incorporation of phonetic and graphic information, neural models have achieved high scores in Chinese Spelling Check (CSC). However, it does not provide a comprehensive reflection of the models' capability due to the limited test sets. In this study, we abstract the representative model paradigm, implement it with nine structures and experiment them on comprehensive test sets we constructed with different purposes. We perform a detailed analysis of the results and find that: 1) Fusing phonetic and graphic information reasonably is effective for CSC. 2) Models are sensitive to the error distribution of the test set, which reflects the shortcomings of models and reveals the direction we should work on. 3) Whether or not the errors and contexts have been seen has a significant impact on models. 4) The commonly used benchmark, SIGHAN, can not reliably evaluate models' performance.",
    "path": "papers/23/07/2307.13655.json",
    "total_tokens": 885,
    "translated_title": "对中文拼写检查的综合评估与分析研究",
    "translated_abstract": "随着预训练模型的发展和语音和图形信息的融合，神经模型在中文拼写检查方面取得了高分。然而，由于测试集的限制，它并没有全面反映模型的能力。在本研究中，我们提取了代表性的模型范例，用九种结构实现，并在我们构建的不同目的的综合测试集上进行了实验。我们对结果进行了详细分析，发现：1）合理地融合语音和图形信息对拼写检查是有效的。2）模型对于测试集的错误分布敏感，这反映了模型的缺点并揭示了我们应该努力的方向。3）错误和上下文的先前经验对模型有重要影响。4）常用的基准测试集SIGHAN无法可靠评估模型的性能。",
    "tldr": "本研究在中文拼写检查领域进行了综合评估与分析，发现合理融合语音和图形信息可以提高检查效果，模型对测试集的错误分布敏感，先前经验对模型有重要影响，常用的基准测试集无法可靠评估模型性能。",
    "en_tdlr": "This study conducted a comprehensive evaluation and analysis in the field of Chinese Spelling Check, and found that integrating phonetic and graphic information improves the checking efficiency, models are sensitive to the error distribution of the test set, prior experience has a significant impact on models, and the commonly used benchmark cannot reliably evaluate model performance."
}