{
    "title": "Trend patterns statistics for assessing irreversibility in cryptocurrencies: time-asymmetry versus inefficiency. (arXiv:2307.08612v1 [q-fin.ST])",
    "abstract": "In this paper, we present a measure of time irreversibility using trend pattern statistics. We define the irreversibility index as the Kullback-Leibler divergence between the distribution of uptrends subsequences (increasing trends) and the corresponding downtrends subsequences distribution (decreasing trends) in a time series. We use this index to analyze the degree of irreversibility in log return series over time, specifically focusing on five cryptocurrencies: Bitcoin, Ethereum, Ripple, Litecoin, and Bitcoin Cash. Our analysis reveals a strong indication of irreversibility in all these cryptocurrencies and the characteristic evolves over time. We additionally evaluate the market efficiency for these cryptocurrencies based on a recently proposed information-theoretic measure. By comparing inefficiency and irreversibility, we explore the relationship between these statistical features. This comparison provides insight into the non-trivial relationship between inefficiency and irrever",
    "link": "http://arxiv.org/abs/2307.08612",
    "context": "Title: Trend patterns statistics for assessing irreversibility in cryptocurrencies: time-asymmetry versus inefficiency. (arXiv:2307.08612v1 [q-fin.ST])\nAbstract: In this paper, we present a measure of time irreversibility using trend pattern statistics. We define the irreversibility index as the Kullback-Leibler divergence between the distribution of uptrends subsequences (increasing trends) and the corresponding downtrends subsequences distribution (decreasing trends) in a time series. We use this index to analyze the degree of irreversibility in log return series over time, specifically focusing on five cryptocurrencies: Bitcoin, Ethereum, Ripple, Litecoin, and Bitcoin Cash. Our analysis reveals a strong indication of irreversibility in all these cryptocurrencies and the characteristic evolves over time. We additionally evaluate the market efficiency for these cryptocurrencies based on a recently proposed information-theoretic measure. By comparing inefficiency and irreversibility, we explore the relationship between these statistical features. This comparison provides insight into the non-trivial relationship between inefficiency and irrever",
    "path": "papers/23/07/2307.08612.json",
    "total_tokens": 967,
    "translated_title": "用于评估加密货币不可逆性的趋势模式统计：时间不对称性与低效性对比",
    "translated_abstract": "本文提出了一种使用趋势模式统计的时间不可逆性度量方法。我们将不可逆性指数定义为时间序列中上涨子序列（增长趋势）和相应的下跌子序列（下降趋势）的分布之间的Kullback-Leibler散度。我们使用这个指数来分析随时间变化的对数收益序列中的不可逆性程度，特别关注比特币、以太坊、瑞波币、莱特币和比特币现金这五种加密货币。我们的分析显示，所有这些加密货币都显示出明显的不可逆性，并且特征随时间演变。我们还根据最近提出的信息论度量方法评估这些加密货币的市场效率。通过比较低效性和不可逆性，我们探讨了这些统计特征之间的关系。这种比较为我们提供了对低效性和不可逆性之间非平凡关系的洞见。",
    "tldr": "本文使用趋势模式统计提出了一种测量加密货币时间不可逆性的方法，并分析了比特币、以太坊、瑞波币、莱特币和比特币现金这五种加密货币的不可逆性程度。与此同时，通过比较低效性和不可逆性，揭示了它们之间的关系。",
    "en_tdlr": "This paper presents a method for measuring the time irreversibility of cryptocurrencies using trend pattern statistics, and analyzes the degree of irreversibility in Bitcoin, Ethereum, Ripple, Litecoin, and Bitcoin Cash. Additionally, the relationship between inefficiency and irreversibility is explored by comparing these statistical features."
}