{
    "title": "An Exploration Study of Mixed-initiative Query Reformulation in Conversational Passage Retrieval. (arXiv:2307.08803v1 [cs.IR])",
    "abstract": "In this paper, we report our methods and experiments for the TREC Conversational Assistance Track (CAsT) 2022. In this work, we aim to reproduce multi-stage retrieval pipelines and explore one of the potential benefits of involving mixed-initiative interaction in conversational passage retrieval scenarios: reformulating raw queries. Before the first ranking stage of a multi-stage retrieval pipeline, we propose a mixed-initiative query reformulation module, which achieves query reformulation based on the mixed-initiative interaction between the users and the system, as the replacement for the neural reformulation method. Specifically, we design an algorithm to generate appropriate questions related to the ambiguities in raw queries, and another algorithm to reformulate raw queries by parsing users' feedback and incorporating it into the raw query. For the first ranking stage of our multi-stage pipelines, we adopt a sparse ranking function: BM25, and a dense retrieval method: TCT-ColBERT",
    "link": "http://arxiv.org/abs/2307.08803",
    "context": "Title: An Exploration Study of Mixed-initiative Query Reformulation in Conversational Passage Retrieval. (arXiv:2307.08803v1 [cs.IR])\nAbstract: In this paper, we report our methods and experiments for the TREC Conversational Assistance Track (CAsT) 2022. In this work, we aim to reproduce multi-stage retrieval pipelines and explore one of the potential benefits of involving mixed-initiative interaction in conversational passage retrieval scenarios: reformulating raw queries. Before the first ranking stage of a multi-stage retrieval pipeline, we propose a mixed-initiative query reformulation module, which achieves query reformulation based on the mixed-initiative interaction between the users and the system, as the replacement for the neural reformulation method. Specifically, we design an algorithm to generate appropriate questions related to the ambiguities in raw queries, and another algorithm to reformulate raw queries by parsing users' feedback and incorporating it into the raw query. For the first ranking stage of our multi-stage pipelines, we adopt a sparse ranking function: BM25, and a dense retrieval method: TCT-ColBERT",
    "path": "papers/23/07/2307.08803.json",
    "total_tokens": 895,
    "translated_title": "《混合主动查询重构在对话式段落检索中的探索研究》的研究报告",
    "translated_abstract": "在本文中，我们报告了我们在TREC Conversational Assistance Track (CAsT) 2022中的方法和实验。我们的目标是复现多阶段的检索管线，并探索在对话式段落检索场景中涉及混合主动交互的潜在好处之一：对原始查询进行重构。在多阶段检索管线的第一个排名阶段之前，我们提出了一个混合主动查询重构模块，它通过用户与系统之间的混合主动交互实现查询重构，作为神经重构方法的替代品。具体而言，我们设计了一个算法来生成与原始查询中的歧义相关的适当问题，以及另一个算法来解析用户的反馈并将其融入到原始查询中以进行查询重构。对于我们的多阶段管线的第一个排名阶段，我们采用了一个稀疏排名函数：BM25和一个密集检索方法：TCT-ColBERT。",
    "tldr": "本文研究了对话式段落检索中混合主动查询重构的探索，并提出了一个混合主动查询重构模块，该模块能够基于用户与系统之间的混合主动交互对原始查询进行重构，以提高检索效果。",
    "en_tdlr": "This paper explores mixed-initiative query reformulation in conversational passage retrieval and proposes a module that can reformulate raw queries based on mixed-initiative interaction between users and the system, improving retrieval performance."
}