{
    "title": "Feature selection simultaneously preserving both class and cluster structures. (arXiv:2307.03902v1 [cs.LG])",
    "abstract": "When a data set has significant differences in its class and cluster structure, selecting features aiming only at the discrimination of classes would lead to poor clustering performance, and similarly, feature selection aiming only at preserving cluster structures would lead to poor classification performance. To the best of our knowledge, a feature selection method that simultaneously considers class discrimination and cluster structure preservation is not available in the literature. In this paper, we have tried to bridge this gap by proposing a neural network-based feature selection method that focuses both on class discrimination and structure preservation in an integrated manner. In addition to assessing typical classification problems, we have investigated its effectiveness on band selection in hyperspectral images. Based on the results of the experiments, we may claim that the proposed feature/band selection can select a subset of features that is good for both classification an",
    "link": "http://arxiv.org/abs/2307.03902",
    "context": "Title: Feature selection simultaneously preserving both class and cluster structures. (arXiv:2307.03902v1 [cs.LG])\nAbstract: When a data set has significant differences in its class and cluster structure, selecting features aiming only at the discrimination of classes would lead to poor clustering performance, and similarly, feature selection aiming only at preserving cluster structures would lead to poor classification performance. To the best of our knowledge, a feature selection method that simultaneously considers class discrimination and cluster structure preservation is not available in the literature. In this paper, we have tried to bridge this gap by proposing a neural network-based feature selection method that focuses both on class discrimination and structure preservation in an integrated manner. In addition to assessing typical classification problems, we have investigated its effectiveness on band selection in hyperspectral images. Based on the results of the experiments, we may claim that the proposed feature/band selection can select a subset of features that is good for both classification an",
    "path": "papers/23/07/2307.03902.json",
    "total_tokens": 824,
    "translated_title": "同时保留类别和聚类结构的特征选择方法",
    "translated_abstract": "当数据集的类别和聚类结构具有显著差异时，仅针对类别的特征选择会导致聚类性能不佳，同样地，仅考虑聚类结构的特征选择也会导致分类性能不佳。据我们所知，文献中尚无同时考虑类别判别和聚类结构保持的特征选择方法。本文通过提出一种基于神经网络的特征选择方法，旨在整合类别判别和结构保持两方面的目标来弥补这一空白。除了评估典型的分类问题外，我们还研究了该方法在高光谱图像中的波段选择方面的有效性。根据实验结果，我们可以声称，所提出的特征/波段选择方法可以选择适用于分类和聚类的特征子集。",
    "tldr": "本文提出了一种基于神经网络的特征选择方法，同时考虑了类别判别和聚类结构保持的目标。实验证明该方法可以在具有显著类别和聚类结构差异的数据集上取得良好的分类和聚类性能。",
    "en_tdlr": "This paper proposes a neural network-based feature selection method that simultaneously considers class discrimination and cluster structure preservation. Experimental results show that the method achieves good classification and clustering performance on datasets with significant differences in class and cluster structure."
}