{
    "title": "One-Nearest Neighborhood Guides Inlier Estimation for Unsupervised Point Cloud Registration. (arXiv:2307.14019v1 [cs.CV])",
    "abstract": "The precision of unsupervised point cloud registration methods is typically limited by the lack of reliable inlier estimation and self-supervised signal, especially in partially overlapping scenarios. In this paper, we propose an effective inlier estimation method for unsupervised point cloud registration by capturing geometric structure consistency between the source point cloud and its corresponding reference point cloud copy. Specifically, to obtain a high quality reference point cloud copy, an One-Nearest Neighborhood (1-NN) point cloud is generated by input point cloud. This facilitates matching map construction and allows for integrating dual neighborhood matching scores of 1-NN point cloud and input point cloud to improve matching confidence. Benefiting from the high quality reference copy, we argue that the neighborhood graph formed by inlier and its neighborhood should have consistency between source point cloud and its corresponding reference copy. Based on this observation, ",
    "link": "http://arxiv.org/abs/2307.14019",
    "context": "Title: One-Nearest Neighborhood Guides Inlier Estimation for Unsupervised Point Cloud Registration. (arXiv:2307.14019v1 [cs.CV])\nAbstract: The precision of unsupervised point cloud registration methods is typically limited by the lack of reliable inlier estimation and self-supervised signal, especially in partially overlapping scenarios. In this paper, we propose an effective inlier estimation method for unsupervised point cloud registration by capturing geometric structure consistency between the source point cloud and its corresponding reference point cloud copy. Specifically, to obtain a high quality reference point cloud copy, an One-Nearest Neighborhood (1-NN) point cloud is generated by input point cloud. This facilitates matching map construction and allows for integrating dual neighborhood matching scores of 1-NN point cloud and input point cloud to improve matching confidence. Benefiting from the high quality reference copy, we argue that the neighborhood graph formed by inlier and its neighborhood should have consistency between source point cloud and its corresponding reference copy. Based on this observation, ",
    "path": "papers/23/07/2307.14019.json",
    "total_tokens": 874,
    "translated_title": "无监督点云配准中的最近邻指导内点估计",
    "translated_abstract": "无监督点云配准方法的精度通常受可靠内点估计和自我监督信号的限制，尤其在部分重叠的情况下更为明显。本文提出了一种有效的无监督点云配准内点估计方法，通过捕捉源点云和其对应的参考点云副本之间的几何结构一致性来实现。具体而言，为了获得高质量的参考点云副本，我们使用输入点云生成一个最近邻（1-NN）点云。这有助于匹配图构建，并允许将1-NN点云和输入点云的双邻域匹配得分整合，以提高匹配置信度。基于高质量的参考副本，我们认为内点及其邻域形成的邻域图应该在源点云和对应的参考副本之间具有一致性。基于这一观察，我们提出了一种新的内点估计方法来提高无监督点云配准的精度。",
    "tldr": "本文提出了一种无监督点云配准方法，通过对几何结构一致性的捕捉和最近邻点云的生成来提高内点估计和匹配置信度。"
}