{
    "title": "SLMGAN: Exploiting Speech Language Model Representations for Unsupervised Zero-Shot Voice Conversion in GANs. (arXiv:2307.09435v1 [eess.AS])",
    "abstract": "In recent years, large-scale pre-trained speech language models (SLMs) have demonstrated remarkable advancements in various generative speech modeling applications, such as text-to-speech synthesis, voice conversion, and speech enhancement. These applications typically involve mapping text or speech inputs to pre-trained SLM representations, from which target speech is decoded. This paper introduces a new approach, SLMGAN, to leverage SLM representations for discriminative tasks within the generative adversarial network (GAN) framework, specifically for voice conversion. Building upon StarGANv2-VC, we add our novel SLM-based WavLM discriminators on top of the mel-based discriminators along with our newly designed SLM feature matching loss function, resulting in an unsupervised zero-shot voice conversion system that does not require text labels during training. Subjective evaluation results show that SLMGAN outperforms existing state-of-the-art zero-shot voice conversion models in terms",
    "link": "http://arxiv.org/abs/2307.09435",
    "context": "Title: SLMGAN: Exploiting Speech Language Model Representations for Unsupervised Zero-Shot Voice Conversion in GANs. (arXiv:2307.09435v1 [eess.AS])\nAbstract: In recent years, large-scale pre-trained speech language models (SLMs) have demonstrated remarkable advancements in various generative speech modeling applications, such as text-to-speech synthesis, voice conversion, and speech enhancement. These applications typically involve mapping text or speech inputs to pre-trained SLM representations, from which target speech is decoded. This paper introduces a new approach, SLMGAN, to leverage SLM representations for discriminative tasks within the generative adversarial network (GAN) framework, specifically for voice conversion. Building upon StarGANv2-VC, we add our novel SLM-based WavLM discriminators on top of the mel-based discriminators along with our newly designed SLM feature matching loss function, resulting in an unsupervised zero-shot voice conversion system that does not require text labels during training. Subjective evaluation results show that SLMGAN outperforms existing state-of-the-art zero-shot voice conversion models in terms",
    "path": "papers/23/07/2307.09435.json",
    "total_tokens": 881,
    "translated_title": "SLMGAN: 在GAN中利用语音语言模型表示进行无监督零样本语音转换",
    "translated_abstract": "近年来，大规模预训练的语音语言模型（SLMs）在各种生成式语音建模应用中展现出了显著的进展，如文本到语音合成、语音转换和语音增强。这些应用通常涉及将文本或语音输入映射到预训练SLM表示，然后解码目标语音。本文介绍了一种新方法SLMGAN，以利用SLM表示在生成对抗网络（GAN）框架中进行分类任务，特别是用于语音转换。在StarGANv2-VC的基础上，我们在基于mel的鉴别器上添加了我们的基于SLM的WavLM鉴别器，以及我们新设计的SLM特征匹配损失函数，从而实现了一种无监督的零样本语音转换系统，在训练过程中不需要文本标签。主观评估结果表明，SLMGAN在零样本语音转换模型方面优于现有的最先进模型。",
    "tldr": "SLMGAN提出了一种利用语音语言模型表示进行无监督零样本语音转换的新方法，在生成对抗网络框架中实现了优于现有模型的性能。"
}