{
    "title": "Widespread Flaws in Offline Evaluation of Recommender Systems. (arXiv:2307.14951v1 [cs.IR])",
    "abstract": "Even though offline evaluation is just an imperfect proxy of online performance -- due to the interactive nature of recommenders -- it will probably remain the primary way of evaluation in recommender systems research for the foreseeable future, since the proprietary nature of production recommenders prevents independent validation of A/B test setups and verification of online results. Therefore, it is imperative that offline evaluation setups are as realistic and as flawless as they can be. Unfortunately, evaluation flaws are quite common in recommender systems research nowadays, due to later works copying flawed evaluation setups from their predecessors without questioning their validity. In the hope of improving the quality of offline evaluation of recommender systems, we discuss four of these widespread flaws and why researchers should avoid them.",
    "link": "http://arxiv.org/abs/2307.14951",
    "context": "Title: Widespread Flaws in Offline Evaluation of Recommender Systems. (arXiv:2307.14951v1 [cs.IR])\nAbstract: Even though offline evaluation is just an imperfect proxy of online performance -- due to the interactive nature of recommenders -- it will probably remain the primary way of evaluation in recommender systems research for the foreseeable future, since the proprietary nature of production recommenders prevents independent validation of A/B test setups and verification of online results. Therefore, it is imperative that offline evaluation setups are as realistic and as flawless as they can be. Unfortunately, evaluation flaws are quite common in recommender systems research nowadays, due to later works copying flawed evaluation setups from their predecessors without questioning their validity. In the hope of improving the quality of offline evaluation of recommender systems, we discuss four of these widespread flaws and why researchers should avoid them.",
    "path": "papers/23/07/2307.14951.json",
    "total_tokens": 778,
    "translated_title": "离线评估中推荐系统存在广泛缺陷",
    "translated_abstract": "尽管离线评估只是在线性能的不完美代理，因为推荐系统的交互性质，但由于生产推荐系统的专有性质阻止了A/B测试设置的独立验证和在线结果的验证，离线评估可能仍然是可见的未来推荐系统研究中的主要评估方式。因此，离线评估设置必须尽可能真实和无瑕疵。不幸的是，由于后期作品复制了前辈们存在缺陷的评估设置而不质疑其有效性，所以在推荐系统研究中评估缺陷相当普遍。为了改善推荐系统的离线评估质量，我们讨论了其中四个广泛存在的缺陷以及研究人员应该避免它们的原因。",
    "tldr": "本文讨论了广泛存在的推荐系统离线评估中的四个缺陷，并说明了研究人员应该避免这些缺陷，以提高离线评估的质量。"
}