{
    "title": "Single and Multi-Speaker Cloned Voice Detection: From Perceptual to Learned Features. (arXiv:2307.07683v1 [cs.SD])",
    "abstract": "Synthetic-voice cloning technologies have seen significant advances in recent years, giving rise to a range of potential harms. From small- and large-scale financial fraud to disinformation campaigns, the need for reliable methods to differentiate real and synthesized voices is imperative. We describe three techniques for differentiating a real from a cloned voice designed to impersonate a specific person. These three approaches differ in their feature extraction stage with low-dimensional perceptual features offering high interpretability but lower accuracy, to generic spectral features, and end-to-end learned features offering less interpretability but higher accuracy. We show the efficacy of these approaches when trained on a single speaker's voice and when trained on multiple voices. The learned features consistently yield an equal error rate between $0\\%$ and $4\\%$, and are reasonably robust to adversarial laundering.",
    "link": "http://arxiv.org/abs/2307.07683",
    "context": "Title: Single and Multi-Speaker Cloned Voice Detection: From Perceptual to Learned Features. (arXiv:2307.07683v1 [cs.SD])\nAbstract: Synthetic-voice cloning technologies have seen significant advances in recent years, giving rise to a range of potential harms. From small- and large-scale financial fraud to disinformation campaigns, the need for reliable methods to differentiate real and synthesized voices is imperative. We describe three techniques for differentiating a real from a cloned voice designed to impersonate a specific person. These three approaches differ in their feature extraction stage with low-dimensional perceptual features offering high interpretability but lower accuracy, to generic spectral features, and end-to-end learned features offering less interpretability but higher accuracy. We show the efficacy of these approaches when trained on a single speaker's voice and when trained on multiple voices. The learned features consistently yield an equal error rate between $0\\%$ and $4\\%$, and are reasonably robust to adversarial laundering.",
    "path": "papers/23/07/2307.07683.json",
    "total_tokens": 936,
    "translated_title": "单声道和多声道克隆声音检测：从感知到学习特征",
    "translated_abstract": "近年来，合成语音克隆技术取得了显著进展，引发了一系列潜在的危害。从小规模和大规模的金融欺诈到虚假信息传播活动，需要可靠的方法来区分真实和合成声音是至关重要的。我们描述了三种区分真实声音和试图冒充特定人物声音的克隆声音的技术。这三种方法在特征提取阶段上有所不同，低维感知特征具有较高的可解释性但准确性较低，而通用的频谱特征和端到端学习特征具有较高的准确性但可解释性较低。我们展示了这些方法在单个说话人的声音上训练和在多个声音上训练时的有效性。学习特征始终保持着$0\\%$至$4\\%$之间的等错误率，并且对对抗性清洗具有相当的鲁棒性。",
    "tldr": "本论文介绍了三种区分真实声音和试图冒充特定人物声音的克隆声音的技术，分别采用不同的特征提取方法，并展示了在单个和多个声音上训练时的有效性。学习特征具有较高的准确性并且对对抗性清洗具有相当的鲁棒性。",
    "en_tdlr": "This paper presents three techniques for differentiating real voices from cloned voices designed to impersonate specific individuals, using different feature extraction methods, and demonstrates their effectiveness when trained on single and multiple voices. The learned features have high accuracy and are reasonably robust to adversarial laundering."
}