{
    "title": "Benchmarking and Analyzing Generative Data for Visual Recognition. (arXiv:2307.13697v1 [cs.CV])",
    "abstract": "Advancements in large pre-trained generative models have expanded their potential as effective data generators in visual recognition. This work delves into the impact of generative images, primarily comparing paradigms that harness external data (\\ie generative \\vs retrieval \\vs original).  Our key contributions are: \\textbf{1) GenBench Construction:} We devise \\textbf{GenBench}, a broad benchmark comprising 22 datasets with 2548 categories, to appraise generative data across various visual recognition tasks. \\textbf{2) CLER Score:} To address the insufficient correlation of existing metrics (\\eg, FID, CLIP score) with downstream recognition performance, we propose \\textbf{CLER}, a training-free metric indicating generative data's efficiency for recognition tasks prior to training. \\textbf{3) New Baselines:} Comparisons of generative data with retrieved data from the same external pool help to elucidate the unique traits of generative data. \\textbf{4) External Knowledge Injection:} By ",
    "link": "http://arxiv.org/abs/2307.13697",
    "context": "Title: Benchmarking and Analyzing Generative Data for Visual Recognition. (arXiv:2307.13697v1 [cs.CV])\nAbstract: Advancements in large pre-trained generative models have expanded their potential as effective data generators in visual recognition. This work delves into the impact of generative images, primarily comparing paradigms that harness external data (\\ie generative \\vs retrieval \\vs original).  Our key contributions are: \\textbf{1) GenBench Construction:} We devise \\textbf{GenBench}, a broad benchmark comprising 22 datasets with 2548 categories, to appraise generative data across various visual recognition tasks. \\textbf{2) CLER Score:} To address the insufficient correlation of existing metrics (\\eg, FID, CLIP score) with downstream recognition performance, we propose \\textbf{CLER}, a training-free metric indicating generative data's efficiency for recognition tasks prior to training. \\textbf{3) New Baselines:} Comparisons of generative data with retrieved data from the same external pool help to elucidate the unique traits of generative data. \\textbf{4) External Knowledge Injection:} By ",
    "path": "papers/23/07/2307.13697.json",
    "total_tokens": 964,
    "translated_title": "基于视觉识别的生成数据的基准测试与分析",
    "translated_abstract": "大型预训练生成模型的进步扩大了它们作为有效数据生成器在视觉识别中的潜力。本研究深入探讨了生成图像的影响，主要比较了利用外部数据（如生成数据、检索数据、原始数据）的范例。我们的主要贡献包括：1) GenBench构建：我们设计了GenBench，一个包含22个数据集和2548个类别的广泛基准，用于评估不同视觉识别任务中的生成数据。2) CLER分数：为了解决现有度量指标（如FID、CLIP分数）与下游识别性能之间的不足相关性问题，我们提出了CLER，一种无需训练的度量指标，用于指示识别任务训练之前生成数据的效率。3) 新的基准线：将生成数据与来自相同外部池的检索数据进行比较，有助于阐明生成数据的独特特征。4) 外部知识注入：通过注入外部知识，提高生成数据在视觉识别任务中的性能。",
    "tldr": "这篇论文通过实验研究了利用生成数据在视觉识别中的应用，并提出了一个用于评估生成数据的基准，一个训练-free的度量指标以及与检索数据进行比较揭示生成数据的独特特征的新方法。",
    "en_tdlr": "This paper investigates the application of generative data in visual recognition through experimental studies, and proposes a benchmark for evaluating generative data, a training-free metric, and a new approach to compare with retrieval data and reveal the unique characteristics of generative data."
}