{
    "title": "On the Computational Modeling of Meaning: Embodied Cognition Intertwined with Emotion. (arXiv:2307.04518v2 [cs.CL] UPDATED)",
    "abstract": "This document chronicles this author's attempt to explore how words come to mean what they do, with a particular focus on child language acquisition and what that means for models of language understanding.\\footnote{I say \\emph{historical} because I synthesize the ideas based on when I discovered them and how those ideas influenced my later thinking.} I explain the setting for child language learning, how embodiment -- being able to perceive and enact in the world, including knowledge of concrete and abstract concepts -- is crucial, and how emotion and cognition relate to each other and the language learning process. I end with what I think are some of the requirements for a language-learning agent that learns language in a setting similar to that of children. This paper can act as a potential guide for ongoing and future work in modeling language.",
    "link": "http://arxiv.org/abs/2307.04518",
    "context": "Title: On the Computational Modeling of Meaning: Embodied Cognition Intertwined with Emotion. (arXiv:2307.04518v2 [cs.CL] UPDATED)\nAbstract: This document chronicles this author's attempt to explore how words come to mean what they do, with a particular focus on child language acquisition and what that means for models of language understanding.\\footnote{I say \\emph{historical} because I synthesize the ideas based on when I discovered them and how those ideas influenced my later thinking.} I explain the setting for child language learning, how embodiment -- being able to perceive and enact in the world, including knowledge of concrete and abstract concepts -- is crucial, and how emotion and cognition relate to each other and the language learning process. I end with what I think are some of the requirements for a language-learning agent that learns language in a setting similar to that of children. This paper can act as a potential guide for ongoing and future work in modeling language.",
    "path": "papers/23/07/2307.04518.json",
    "total_tokens": 792,
    "translated_title": "论意义的计算建模：融合情感的体验认知",
    "translated_abstract": "本文记录了作者探索词汇产生意义的过程，重点关注儿童语言习得以及对语言理解模型的影响。文中解释了儿童语言习得的背景，说明了体验感知和实践在认知过程中的重要性，以及情感与认知如何相互关联以及与语言习得过程的关系。最后，阐述了作者对在类似儿童环境中学习语言的语言学习智能体的要求。本文可作为未来对语言建模工作的潜在指南。",
    "tldr": "本文探索了词汇产生意义的过程，重点研究了儿童语言习得和语言理解模型。作者强调了体验感知、情感和认知在语言习得中的重要性，并提出了对类似儿童环境中语言学习智能体的要求。",
    "en_tdlr": "This paper explores the process of how words come to mean what they do, with a focus on child language acquisition and language understanding models. The author emphasizes the importance of embodiment, emotion, and cognition in language learning, and proposes requirements for language-learning agents in a child-like environment."
}