{
    "title": "Differentiable Turbulence II. (arXiv:2307.13533v1 [physics.flu-dyn])",
    "abstract": "Differentiable fluid simulators are increasingly demonstrating value as useful tools for developing data-driven models in computational fluid dynamics (CFD). Differentiable turbulence, or the end-to-end training of machine learning (ML) models embedded in CFD solution algorithms, captures both the generalization power and limited upfront cost of physics-based simulations, and the flexibility and automated training of deep learning methods. We develop a framework for integrating deep learning models into a generic finite element numerical scheme for solving the Navier-Stokes equations, applying the technique to learn a sub-grid scale closure using a multi-scale graph neural network. We demonstrate the method on several realizations of flow over a backwards-facing step, testing on both unseen Reynolds numbers and new geometry. We show that the learned closure can achieve accuracy comparable to traditional large eddy simulation on a finer grid that amounts to an equivalent speedup of 10x.",
    "link": "http://arxiv.org/abs/2307.13533",
    "context": "Title: Differentiable Turbulence II. (arXiv:2307.13533v1 [physics.flu-dyn])\nAbstract: Differentiable fluid simulators are increasingly demonstrating value as useful tools for developing data-driven models in computational fluid dynamics (CFD). Differentiable turbulence, or the end-to-end training of machine learning (ML) models embedded in CFD solution algorithms, captures both the generalization power and limited upfront cost of physics-based simulations, and the flexibility and automated training of deep learning methods. We develop a framework for integrating deep learning models into a generic finite element numerical scheme for solving the Navier-Stokes equations, applying the technique to learn a sub-grid scale closure using a multi-scale graph neural network. We demonstrate the method on several realizations of flow over a backwards-facing step, testing on both unseen Reynolds numbers and new geometry. We show that the learned closure can achieve accuracy comparable to traditional large eddy simulation on a finer grid that amounts to an equivalent speedup of 10x.",
    "path": "papers/23/07/2307.13533.json",
    "total_tokens": 939,
    "translated_title": "可微湍流 II",
    "translated_abstract": "可微分流体模拟器越来越被证明是在计算流体力学（CFD）中开发数据驱动模型的有用工具。可微分湍流或者说机器学习（ML）模型嵌入CFD解算算法的端到端训练，既具备了基于物理模拟的泛化能力和有限的前期成本，又具备了深度学习方法的灵活性和自动化训练。我们开发了一个框架，将深度学习模型集成到通用有限元数值方案中，用于解Navier-Stokes方程，应用该技术学习多尺度图神经网络来进行子网格尺度闭合。我们在几种反向阶梯流的实现上演示了该方法，测试了不同雷诺数和新几何形状。我们展示了学到的闭合模型在相当于速度加快10倍的更细网格上可以达到与传统大涡模拟相当的精度。",
    "tldr": "该研究开发了一个框架，将深度学习模型嵌入到通用有限元数值方案中，用于解Navier-Stokes方程，并通过学习多尺度图神经网络实现了子网格尺度闭合。在实现多种流动情况时进行测试验证，结果表明学到的闭合模型在速度加快10倍的更细网格上能够达到与传统大涡模型相当的精度。",
    "en_tdlr": "This study develops a framework that integrates deep learning models into a generic finite element numerical scheme for solving the Navier-Stokes equations. By employing a multi-scale graph neural network, the method achieves sub-grid scale closure and demonstrates comparable accuracy to traditional large eddy simulations on a finer grid with a 10x speedup."
}