{
    "title": "Artificial Intelligence for Drug Discovery: Are We There Yet?. (arXiv:2307.06521v1 [cs.AI])",
    "abstract": "Drug discovery is adapting to novel technologies such as data science, informatics, and artificial intelligence (AI) to accelerate effective treatment development while reducing costs and animal experiments. AI is transforming drug discovery, as indicated by increasing interest from investors, industrial and academic scientists, and legislators. Successful drug discovery requires optimizing properties related to pharmacodynamics, pharmacokinetics, and clinical outcomes. This review discusses the use of AI in the three pillars of drug discovery: diseases, targets, and therapeutic modalities, with a focus on small molecule drugs. AI technologies, such as generative chemistry, machine learning, and multi-property optimization, have enabled several compounds to enter clinical trials. The scientific community must carefully vet known information to address the reproducibility crisis. The full potential of AI in drug discovery can only be realized with sufficient ground truth and appropriate",
    "link": "http://arxiv.org/abs/2307.06521",
    "context": "Title: Artificial Intelligence for Drug Discovery: Are We There Yet?. (arXiv:2307.06521v1 [cs.AI])\nAbstract: Drug discovery is adapting to novel technologies such as data science, informatics, and artificial intelligence (AI) to accelerate effective treatment development while reducing costs and animal experiments. AI is transforming drug discovery, as indicated by increasing interest from investors, industrial and academic scientists, and legislators. Successful drug discovery requires optimizing properties related to pharmacodynamics, pharmacokinetics, and clinical outcomes. This review discusses the use of AI in the three pillars of drug discovery: diseases, targets, and therapeutic modalities, with a focus on small molecule drugs. AI technologies, such as generative chemistry, machine learning, and multi-property optimization, have enabled several compounds to enter clinical trials. The scientific community must carefully vet known information to address the reproducibility crisis. The full potential of AI in drug discovery can only be realized with sufficient ground truth and appropriate",
    "path": "papers/23/07/2307.06521.json",
    "total_tokens": 998,
    "translated_title": "药物发现中的人工智能：我们已经到达了吗？",
    "translated_abstract": "药物发现正在适应数据科学、信息学和人工智能等新技术，以加快有效治疗的开发，同时降低成本和动物实验。人工智能正在改变药物发现，投资者、工业和学术科学家以及立法者对此越来越感兴趣。成功的药物发现需要优化与药理动力学、药代动力学和临床结果相关的性质。本综述讨论了人工智能在药物发现的三个支柱：疾病、靶点和治疗模式中的应用，重点关注小分子药物。生成化学、机器学习和多属性优化等人工智能技术使得多种化合物进入了临床试验。科学界必须仔细审查已知信息，以解决可重复性危机。只有具有足够的真实基准和适当的训练数据，才能实现人工智能在药物发现中的全部潜力。",
    "tldr": "本综述讨论了人工智能在药物发现中的应用，重点关注小分子药物。通过使用生成化学、机器学习和多属性优化等人工智能技术，已有多种化合物进入了临床试验。科学界必须仔细审查已知信息，以解决可重复性危机。只有具有足够的真实基准和适当的训练数据，才能实现人工智能在药物发现中的全部潜力。",
    "en_tdlr": "This review discusses the application of artificial intelligence in drug discovery, with a focus on small molecule drugs. The use of AI technologies such as generative chemistry, machine learning, and multi-property optimization has led to several compounds entering clinical trials. The scientific community must carefully vet known information to address the reproducibility crisis. The full potential of AI in drug discovery can only be realized with sufficient ground truth and appropriate training data."
}