{
    "title": "IR Design for Application-Specific Natural Language: A Case Study on Traffic Data. (arXiv:2307.06983v1 [cs.SE])",
    "abstract": "In the realm of software applications in the transportation industry, Domain-Specific Languages (DSLs) have enjoyed widespread adoption due to their ease of use and various other benefits. With the ceaseless progress in computer performance and the rapid development of large-scale models, the possibility of programming using natural language in specified applications - referred to as Application-Specific Natural Language (ASNL) - has emerged. ASNL exhibits greater flexibility and freedom, which, in turn, leads to an increase in computational complexity for parsing and a decrease in processing performance. To tackle this issue, our paper advances a design for an intermediate representation (IR) that caters to ASNL and can uniformly process transportation data into graph data format, improving data processing performance. Experimental comparisons reveal that in standard data query operations, our proposed IR design can achieve a speed improvement of over forty times compared to direct us",
    "link": "http://arxiv.org/abs/2307.06983",
    "context": "Title: IR Design for Application-Specific Natural Language: A Case Study on Traffic Data. (arXiv:2307.06983v1 [cs.SE])\nAbstract: In the realm of software applications in the transportation industry, Domain-Specific Languages (DSLs) have enjoyed widespread adoption due to their ease of use and various other benefits. With the ceaseless progress in computer performance and the rapid development of large-scale models, the possibility of programming using natural language in specified applications - referred to as Application-Specific Natural Language (ASNL) - has emerged. ASNL exhibits greater flexibility and freedom, which, in turn, leads to an increase in computational complexity for parsing and a decrease in processing performance. To tackle this issue, our paper advances a design for an intermediate representation (IR) that caters to ASNL and can uniformly process transportation data into graph data format, improving data processing performance. Experimental comparisons reveal that in standard data query operations, our proposed IR design can achieve a speed improvement of over forty times compared to direct us",
    "path": "papers/23/07/2307.06983.json",
    "total_tokens": 802,
    "translated_title": "面向特定应用自然语言的IR设计:以交通数据为例的案例研究",
    "translated_abstract": "在交通行业的软件应用领域，由于易于使用和其他各种好处，领域专用语言(DSLs)已经广泛应用。随着计算机性能的不断提升和大规模模型的快速发展，使用自然语言进行编程的可能性在特定应用中已经出现，被称为应用特定自然语言(ASNL)。ASNL具有更大的灵活性和自由度，从而导致解析的计算复杂度增加，处理性能降低。为了解决这个问题，我们的论文提出了一种针对ASNL的中间表示(IR)的设计，可以将交通数据统一处理成图形数据格式，提高数据处理性能。实验比较表明，在标准数据查询操作中，我们提出的IR设计可以实现超过四十倍的速度提升，与直接使用ASNL进行处理相比。",
    "tldr": "该论文提出了一种面向特定应用自然语言的IR设计，可将交通数据统一处理成图形数据格式，大大提高了数据处理性能。"
}