{
    "title": "Learning to simulate partially known spatio-temporal dynamics with trainable difference operators. (arXiv:2307.14395v1 [cs.LG])",
    "abstract": "Recently, using neural networks to simulate spatio-temporal dynamics has received a lot of attention. However, most existing methods adopt pure data-driven black-box models, which have limited accuracy and interpretability. By combining trainable difference operators with black-box models, we propose a new hybrid architecture explicitly embedded with partial prior knowledge of the underlying PDEs named PDE-Net++. Furthermore, we introduce two distinct options called the trainable flipping difference layer (TFDL) and the trainable dynamic difference layer (TDDL) for the difference operators. Numerous numerical experiments have demonstrated that PDE-Net++ has superior prediction accuracy and better extrapolation performance than black-box models.",
    "link": "http://arxiv.org/abs/2307.14395",
    "context": "Title: Learning to simulate partially known spatio-temporal dynamics with trainable difference operators. (arXiv:2307.14395v1 [cs.LG])\nAbstract: Recently, using neural networks to simulate spatio-temporal dynamics has received a lot of attention. However, most existing methods adopt pure data-driven black-box models, which have limited accuracy and interpretability. By combining trainable difference operators with black-box models, we propose a new hybrid architecture explicitly embedded with partial prior knowledge of the underlying PDEs named PDE-Net++. Furthermore, we introduce two distinct options called the trainable flipping difference layer (TFDL) and the trainable dynamic difference layer (TDDL) for the difference operators. Numerous numerical experiments have demonstrated that PDE-Net++ has superior prediction accuracy and better extrapolation performance than black-box models.",
    "path": "papers/23/07/2307.14395.json",
    "total_tokens": 816,
    "translated_title": "学习使用可训练差分算子模拟部分已知的时空动态",
    "translated_abstract": "最近，使用神经网络来模拟时空动态引起了很大的关注。然而，大多数现有的方法采用纯数据驱动的黑盒模型，其准确性和可解释性有限。通过将可训练的差分算子与黑盒模型相结合，我们提出了一种新的混合架构，将底层PDE的部分先验知识明确嵌入到PDE-Net++中。此外，我们引入了两种不同的选择，称为可训练翻转差分层（TFDL）和可训练动态差分层（TDDL），用于差分算子。大量的数值实验证明，PDE-Net++具有比黑盒模型更高的预测准确性和更好的外推性能。",
    "tldr": "本文提出了一种新的混合架构PDE-Net++，通过结合可训练差分算子和黑盒模型，明确嵌入了底层PDE的部分先验知识。数值实验证明，PDE-Net++具有比黑盒模型更高的预测准确性和更好的外推性能。",
    "en_tdlr": "This paper proposes a new hybrid architecture called PDE-Net++ by combining trainable difference operators with black-box models, explicitly embedding partial prior knowledge of the underlying PDEs. Numerical experiments have demonstrated that PDE-Net++ achieves higher prediction accuracy and better extrapolation performance than black-box models."
}