{
    "title": "Optimal and Efficient Binary Questioning for Human-in-the-Loop Annotation. (arXiv:2307.01578v1 [cs.LG])",
    "abstract": "Even though data annotation is extremely important for interpretability, research and development of artificial intelligence solutions, most research efforts such as active learning or few-shot learning focus on the sample efficiency problem. This paper studies the neglected complementary problem of getting annotated data given a predictor. For the simple binary classification setting, we present the spectrum ranging from optimal general solutions to practical efficient methods. The problem is framed as the full annotation of a binary classification dataset with the minimal number of yes/no questions when a predictor is available. For the case of general binary questions the solution is found in coding theory, where the optimal questioning strategy is given by the Huffman encoding of the possible labelings. However, this approach is computationally intractable even for small dataset sizes. We propose an alternative practical solution based on several heuristics and lookahead minimizati",
    "link": "http://arxiv.org/abs/2307.01578",
    "context": "Title: Optimal and Efficient Binary Questioning for Human-in-the-Loop Annotation. (arXiv:2307.01578v1 [cs.LG])\nAbstract: Even though data annotation is extremely important for interpretability, research and development of artificial intelligence solutions, most research efforts such as active learning or few-shot learning focus on the sample efficiency problem. This paper studies the neglected complementary problem of getting annotated data given a predictor. For the simple binary classification setting, we present the spectrum ranging from optimal general solutions to practical efficient methods. The problem is framed as the full annotation of a binary classification dataset with the minimal number of yes/no questions when a predictor is available. For the case of general binary questions the solution is found in coding theory, where the optimal questioning strategy is given by the Huffman encoding of the possible labelings. However, this approach is computationally intractable even for small dataset sizes. We propose an alternative practical solution based on several heuristics and lookahead minimizati",
    "path": "papers/23/07/2307.01578.json",
    "total_tokens": 966,
    "translated_title": "人机协作注释的最优高效二元问题研究",
    "translated_abstract": "尽管数据注释对解释能力、人工智能解决方案的研究和开发至关重要，但大多数研究如主动学习或少样本学习都集中在样本效率问题上。本文研究了另一个被忽视的问题，即在给定预测器的情况下如何获得带注释的数据。针对简单的二元分类设置，我们提出了从最优通用解决方案到实际高效方法的一系列解决方案。问题被构建为给定预测器情况下拥有最少的是/否问题来完全注释一个二元分类数据集。对于一般二元问题，解决方案可以在编码理论中找到，其中最优的提问策略由可能的标签编码的霍夫曼编码给出。然而，即使对于较小的数据集大小，这种方法的计算复杂度也是难以处理的。我们提出了一种基于多种启发式和前瞻性最小化的替代实际解决方案。",
    "tldr": "本文研究了人机协作注释中的二元问题，提出了从最优通用解决方案到实际高效方法的一系列解决方案。我们将问题构建为在给定预测器的情况下用最少的是/否问题来完全注释一个二元分类数据集。通过编码理论和启发式算法，我们提供了一个计算可行且高效的替代方案。",
    "en_tdlr": "The paper studies the problem of binary questioning in human-in-the-loop annotation and proposes a spectrum of solutions ranging from optimal general solutions to practical efficient methods. It frames the problem as fully annotating a binary classification dataset with the minimal number of yes/no questions when a predictor is available. The alternative practical solution is provided based on coding theory and heuristics algorithms, which is computationally feasible and efficient."
}