{
    "title": "A Federated learning model for Electric Energy management using Blockchain Technology. (arXiv:2307.09080v1 [cs.LG])",
    "abstract": "Energy shortfall and electricity load shedding are the main problems for developing countries. The main causes are lack of management in the energy sector and the use of non-renewable energy sources. The improved energy management and use of renewable sources can be significant to resolve energy crisis. It is necessary to increase the use of renewable energy sources (RESs) to meet the increasing energy demand due to high prices of fossil-fuel based energy. Federated learning (FL) is the most emerging technique in the field of artificial intelligence. Federated learning helps to generate global model at server side by ensemble locally trained models at remote edges sites while preserving data privacy. The global model used to predict energy demand to satisfy the needs of consumers. In this article, we have proposed Blockchain based safe distributed ledger technology for transaction of data between prosumer and consumer to ensure their transparency, traceability and security. Furthermore",
    "link": "http://arxiv.org/abs/2307.09080",
    "context": "Title: A Federated learning model for Electric Energy management using Blockchain Technology. (arXiv:2307.09080v1 [cs.LG])\nAbstract: Energy shortfall and electricity load shedding are the main problems for developing countries. The main causes are lack of management in the energy sector and the use of non-renewable energy sources. The improved energy management and use of renewable sources can be significant to resolve energy crisis. It is necessary to increase the use of renewable energy sources (RESs) to meet the increasing energy demand due to high prices of fossil-fuel based energy. Federated learning (FL) is the most emerging technique in the field of artificial intelligence. Federated learning helps to generate global model at server side by ensemble locally trained models at remote edges sites while preserving data privacy. The global model used to predict energy demand to satisfy the needs of consumers. In this article, we have proposed Blockchain based safe distributed ledger technology for transaction of data between prosumer and consumer to ensure their transparency, traceability and security. Furthermore",
    "path": "papers/23/07/2307.09080.json",
    "total_tokens": 958,
    "translated_title": "使用区块链技术的联邦学习模型用于电能管理",
    "translated_abstract": "能源短缺和电力负荷故障是发展中国家的主要问题。主要原因是能源部门管理不足和非可再生能源的使用。改善能源管理和利用可再生资源对解决能源危机至关重要。为了满足由于燃料价格高导致的不断增长的能源需求，有必要增加可再生能源（RESs）的使用。联邦学习（FL）是人工智能领域中最新兴的技术。联邦学习帮助在远程边缘站点集合本地训练的模型，生成服务器端的全局模型，同时保护数据隐私。全局模型用于预测能源需求，满足消费者的需求。本文提出了基于区块链的安全分布式账本技术，用于处理生产者和消费者之间的数据交易，以确保其透明性、可追溯性和安全性。",
    "tldr": "这项研究提出了一种使用区块链技术的联邦学习模型，以解决发展中国家面临的能源短缺和电力负荷故障问题。通过利用可再生能源并采用联邦学习技术，该模型可以预测能源需求并满足消费者的需求。该研究还使用区块链确保数据交易的透明性、可追溯性和安全性。"
}