{
    "title": "HUTFormer: Hierarchical U-Net Transformer for Long-Term Traffic Forecasting. (arXiv:2307.14596v1 [cs.LG])",
    "abstract": "Traffic forecasting, which aims to predict traffic conditions based on historical observations, has been an enduring research topic and is widely recognized as an essential component of intelligent transportation. Recent proposals on Spatial-Temporal Graph Neural Networks (STGNNs) have made significant progress by combining sequential models with graph convolution networks. However, due to high complexity issues, STGNNs only focus on short-term traffic forecasting, e.g., 1-hour forecasting, while ignoring more practical long-term forecasting. In this paper, we make the first attempt to explore long-term traffic forecasting, e.g., 1-day forecasting. To this end, we first reveal its unique challenges in exploiting multi-scale representations. Then, we propose a novel Hierarchical U-net TransFormer (HUTFormer) to address the issues of long-term traffic forecasting. HUTFormer consists of a hierarchical encoder and decoder to jointly generate and utilize multi-scale representations of traff",
    "link": "http://arxiv.org/abs/2307.14596",
    "context": "Title: HUTFormer: Hierarchical U-Net Transformer for Long-Term Traffic Forecasting. (arXiv:2307.14596v1 [cs.LG])\nAbstract: Traffic forecasting, which aims to predict traffic conditions based on historical observations, has been an enduring research topic and is widely recognized as an essential component of intelligent transportation. Recent proposals on Spatial-Temporal Graph Neural Networks (STGNNs) have made significant progress by combining sequential models with graph convolution networks. However, due to high complexity issues, STGNNs only focus on short-term traffic forecasting, e.g., 1-hour forecasting, while ignoring more practical long-term forecasting. In this paper, we make the first attempt to explore long-term traffic forecasting, e.g., 1-day forecasting. To this end, we first reveal its unique challenges in exploiting multi-scale representations. Then, we propose a novel Hierarchical U-net TransFormer (HUTFormer) to address the issues of long-term traffic forecasting. HUTFormer consists of a hierarchical encoder and decoder to jointly generate and utilize multi-scale representations of traff",
    "path": "papers/23/07/2307.14596.json",
    "total_tokens": 837,
    "translated_title": "HUTFormer：用于长期交通预测的分层U-Net Transformer",
    "translated_abstract": "交通预测旨在基于历史观测数据预测交通状况，是智能交通领域中的重要研究课题。最近的空间-时间图神经网络（STGNNs）通过将顺序模型与图卷积网络相结合取得了显著的进展。然而，由于复杂性问题，STGNNs仅聚焦于短期交通预测，如1小时预测，而忽视了更实际的长期预测。本文首次尝试探索长期交通预测，例如1天的预测。为此，我们首先揭示了在利用多尺度表示方面的独特挑战。然后，我们提出了一种新颖的分层U-Net TransFormer（HUTFormer）来解决长期交通预测的问题。HUTFormer由分层编码器和解码器组成，共同生成和利用交通的多尺度表示。",
    "tldr": "HUTFormer是一种用于长期交通预测的分层U-Net Transformer模型，通过利用多尺度表示来解决长期预测中的挑战和问题。"
}