{
    "title": "GRAN is superior to GraphRNN: node orderings, kernel- and graph embeddings-based metrics for graph generators. (arXiv:2307.06709v1 [cs.LG])",
    "abstract": "A wide variety of generative models for graphs have been proposed. They are used in drug discovery, road networks, neural architecture search, and program synthesis. Generating graphs has theoretical challenges, such as isomorphic representations -- evaluating how well a generative model performs is difficult. Which model to choose depending on the application domain?  We extensively study kernel-based metrics on distributions of graph invariants and manifold-based and kernel-based metrics in graph embedding space. Manifold-based metrics outperform kernel-based metrics in embedding space. We use these metrics to compare GraphRNN and GRAN, two well-known generative models for graphs, and unveil the influence of node orderings. It shows the superiority of GRAN over GraphRNN - further, our proposed adaptation of GraphRNN with a depth-first search ordering is effective for small-sized graphs.  A guideline on good practices regarding dataset selection and node feature initialization is prov",
    "link": "http://arxiv.org/abs/2307.06709",
    "context": "Title: GRAN is superior to GraphRNN: node orderings, kernel- and graph embeddings-based metrics for graph generators. (arXiv:2307.06709v1 [cs.LG])\nAbstract: A wide variety of generative models for graphs have been proposed. They are used in drug discovery, road networks, neural architecture search, and program synthesis. Generating graphs has theoretical challenges, such as isomorphic representations -- evaluating how well a generative model performs is difficult. Which model to choose depending on the application domain?  We extensively study kernel-based metrics on distributions of graph invariants and manifold-based and kernel-based metrics in graph embedding space. Manifold-based metrics outperform kernel-based metrics in embedding space. We use these metrics to compare GraphRNN and GRAN, two well-known generative models for graphs, and unveil the influence of node orderings. It shows the superiority of GRAN over GraphRNN - further, our proposed adaptation of GraphRNN with a depth-first search ordering is effective for small-sized graphs.  A guideline on good practices regarding dataset selection and node feature initialization is prov",
    "path": "papers/23/07/2307.06709.json",
    "total_tokens": 916,
    "translated_title": "GRAN优于GraphRNN：基于节点排序、核函数和图嵌入的度量用于图生成器",
    "translated_abstract": "针对图的生成模型已经被广泛提出，并在药物发现、道路网络、神经架构搜索和程序综合等领域得到应用。然而，生成图面临着理论上的挑战，如同构表示，评估生成模型的性能很困难。在应用领域中，如何选择合适的模型？我们对分布图不变量的核函数度量进行了广泛研究，并在图嵌入空间中研究了基于流形和基于核函数的度量。基于流形的度量在嵌入空间中表现出色。我们使用这些度量来比较两个著名的图生成模型GraphRNN和GRAN，并揭示了节点排序的影响。结果显示GRAN优于GraphRNN，而且我们提出的使用深度优先搜索排序的GraphRNN适用于小型图。我们提供了关于数据集选择和节点特征初始化的最佳实践指南。",
    "tldr": "本论文通过比较基于节点排序、核函数和图嵌入的度量，展示了GRAN优于GraphRNN的优势，并为小型图提供了有效的GraphRNN改进方法。此外，论文还提供了关于数据集选择和节点特征初始化的最佳实践指南。",
    "en_tdlr": "This paper demonstrates the superiority of GRAN over GraphRNN by comparing metrics based on node orderings, kernel functions, and graph embeddings. It also proposes an effective adaptation of GraphRNN for small-sized graphs with depth-first search ordering. Additionally, the paper provides guidelines for dataset selection and node feature initialization."
}