{
    "title": "Path Integral Method for Barrier Option Pricing Under Vasicek Model. (arXiv:2307.07103v1 [q-fin.PR])",
    "abstract": "Path integral method in quantum theory provides a new thinking for time dependent option pricing. For barrier options, the option price changing process is similar to the infinite high barrier scattering problem in quantum mechanics; for double barrier options, the option price changing process is analogous to a particle moving in a infinite square potential well. Using path integral method, the expressions of pricing kernel and option price under Vasicek stochastic interest rate model could be derived. Numerical results of options price as functions of underlying prices are also shown.",
    "link": "http://arxiv.org/abs/2307.07103",
    "context": "Title: Path Integral Method for Barrier Option Pricing Under Vasicek Model. (arXiv:2307.07103v1 [q-fin.PR])\nAbstract: Path integral method in quantum theory provides a new thinking for time dependent option pricing. For barrier options, the option price changing process is similar to the infinite high barrier scattering problem in quantum mechanics; for double barrier options, the option price changing process is analogous to a particle moving in a infinite square potential well. Using path integral method, the expressions of pricing kernel and option price under Vasicek stochastic interest rate model could be derived. Numerical results of options price as functions of underlying prices are also shown.",
    "path": "papers/23/07/2307.07103.json",
    "total_tokens": 704,
    "translated_title": "使用路径积分方法对Vasicek模型中的障碍期权定价",
    "translated_abstract": "量子理论中的路径积分方法为随时间变化的期权定价提供了一种新的思路。对于障碍期权，期权价格变化过程类似于量子力学中的无穷高势垒散射问题；对于双障碍期权，期权价格变化过程类似于粒子在一个无穷方势井中运动。利用路径积分方法，可以导出Vasicek随机利率模型下的定价核和期权价格表达式。同时还展示了期权价格随标的资产价格变化的数值结果。",
    "tldr": "该论文使用路径积分方法研究了Vasicek模型中的障碍期权定价问题，通过类比量子理论中的散射问题和方势井问题，导出了定价核和期权价格表达式，并给出了标的资产价格变化对期权价格的数值结果。",
    "en_tdlr": "This paper applies the path integral method to study the pricing problem of barrier options under the Vasicek model. By analogy to scattering problems and potential wells in quantum theory, the pricing kernel and option price expressions are derived, and numerical results of option prices as functions of underlying asset prices are presented."
}