{
    "title": "Capafoldable: self-tracking foldable smart textiles with capacitive sensing. (arXiv:2307.05370v1 [cs.HC])",
    "abstract": "Folding is an unique structural technique to enable planer materials with motion or 3D mechanical properties. Textile-based capacitive sensing has shown to be sensitive to the geometry deformation and relative motion of conductive textiles. In this work, we propose a novel self-tracking foldable smart textile by combining folded fabric structures and capacitive sensing to detect the structural motions using state-of-the-art sensing circuits and deep learning technologies. We created two folding patterns, Accordion and Chevron, each with two layouts of capacitive sensors in the form of thermobonded conductive textile patches. In an experiment of manually moving patches of the folding patterns, we developed deep neural network to learn and reconstruct the vision-tracked shape of the patches. Through our approach, the geometry primitives defining the patch shape can be reconstructed from the capacitive signals with R-squared value of up to 95\\% and tracking error of 1cm for 22.5cm long pa",
    "link": "http://arxiv.org/abs/2307.05370",
    "context": "Title: Capafoldable: self-tracking foldable smart textiles with capacitive sensing. (arXiv:2307.05370v1 [cs.HC])\nAbstract: Folding is an unique structural technique to enable planer materials with motion or 3D mechanical properties. Textile-based capacitive sensing has shown to be sensitive to the geometry deformation and relative motion of conductive textiles. In this work, we propose a novel self-tracking foldable smart textile by combining folded fabric structures and capacitive sensing to detect the structural motions using state-of-the-art sensing circuits and deep learning technologies. We created two folding patterns, Accordion and Chevron, each with two layouts of capacitive sensors in the form of thermobonded conductive textile patches. In an experiment of manually moving patches of the folding patterns, we developed deep neural network to learn and reconstruct the vision-tracked shape of the patches. Through our approach, the geometry primitives defining the patch shape can be reconstructed from the capacitive signals with R-squared value of up to 95\\% and tracking error of 1cm for 22.5cm long pa",
    "path": "papers/23/07/2307.05370.json",
    "total_tokens": 980,
    "translated_title": "Capafoldable: 具有电容传感能力的自追踪可折叠智能纺织品",
    "translated_abstract": "折叠是一种独特的结构技术，可以使平面材料具有运动或三维力学特性。基于纺织品的电容传感已经被证明对导电纺织品的几何形变和相对运动非常敏感。在这项工作中，我们提出了一种创新的自追踪可折叠智能纺织品，将折叠织物结构和电容传感相结合，利用先进的传感电路和深度学习技术来检测结构运动。我们创建了两种折叠模式，手风琴和齿形，每种模式中都有两种布局的电容传感器，以热粘附的导电纺织品片的形式存在。在手动移动折叠模式的片段的实验中，我们开发了深度神经网络来学习和重构片段的视觉跟踪形状。通过我们的方法，可以从电容信号中重构定义片段形状的几何原语，R-squared值可达95％，22.5cm长片段的追踪误差为1cm。",
    "tldr": "这项工作提出了一种创新的自追踪可折叠智能纺织品，通过结合折叠织物结构和电容传感，利用深度学习技术来检测结构运动。实验结果显示，我们的方法可以从电容信号中准确重构出片段的几何形状。",
    "en_tdlr": "This work proposes a novel self-tracking foldable smart textile that combines folded fabric structures and capacitive sensing to detect structural motions using deep learning technologies. Experimental results show that our method accurately reconstructs the geometric shape of the textile segments from capacitive signals."
}