{
    "title": "Generalized Action-based Ball Recovery Model using 360$^\\circ$ data. (arXiv:2307.04215v1 [stat.AP])",
    "abstract": "Even though having more possession does not necessarily lead to winning, teams like Manchester City, Liverpool, and Leeds United notably have tried to recover the ball quickly after they lost it over the past few years. Nowadays, some of the top managers in the world apply high-pressing styles, and concepts such as the five-second rule, usually credited to Guardiola, have been spreading out [9][10], becoming a fundamental part of how lots of teams have played over the recent years. Expressions like \"don't let them breathe\" and \"get the ball back as soon as possible\" are often heard in the media [4][5][6], but what are the actions that most lead to a change in possession? What is the influence of a team's positioning on the ball recovery? Which are the players that more often collapse when under pressure? Can we evaluate the defensive dynamics of teams that do not necessarily press the player in possession as intensely as those mentioned above? We try to answer those and other questions",
    "link": "http://arxiv.org/abs/2307.04215",
    "context": "Title: Generalized Action-based Ball Recovery Model using 360$^\\circ$ data. (arXiv:2307.04215v1 [stat.AP])\nAbstract: Even though having more possession does not necessarily lead to winning, teams like Manchester City, Liverpool, and Leeds United notably have tried to recover the ball quickly after they lost it over the past few years. Nowadays, some of the top managers in the world apply high-pressing styles, and concepts such as the five-second rule, usually credited to Guardiola, have been spreading out [9][10], becoming a fundamental part of how lots of teams have played over the recent years. Expressions like \"don't let them breathe\" and \"get the ball back as soon as possible\" are often heard in the media [4][5][6], but what are the actions that most lead to a change in possession? What is the influence of a team's positioning on the ball recovery? Which are the players that more often collapse when under pressure? Can we evaluate the defensive dynamics of teams that do not necessarily press the player in possession as intensely as those mentioned above? We try to answer those and other questions",
    "path": "papers/23/07/2307.04215.json",
    "total_tokens": 915,
    "translated_title": "广义的基于动作的球权恢复模型使用360度数据",
    "translated_abstract": "尽管拥有更多的控球并不一定导致胜利，但像曼城、利物浦和利兹联这样的球队在过去几年里一直试图在失去球后尽快恢复球权。现在，世界上一些顶级教练应用高位逼抢的风格，像“五秒规则”这样的概念通常归功于瓜迪奥拉，正在扩散开来，成为许多球队过去几年来打球的基本部分。媒体经常听到“不让他们喘息”和“尽快拿回球权”等说法，但是哪些动作最有可能改变球权？球队的位置对球权恢复有什么影响？哪些球员在压力下更容易失误？我们能否评估那些并不像上述球队一样强烈逼抢控球球员的球队的防守动态？我们试图回答这些问题和其他问题。",
    "tldr": "本研究通过使用360度数据，提出了一个广义的基于动作的球权恢复模型，探究球队在失去球权后如何尽快恢复球权，球队位置对球权恢复的影响以及在压力下更易失误的球员等问题。",
    "en_tdlr": "This study proposes a generalized action-based ball recovery model using 360° data to investigate how teams recover possession quickly after losing it, the influence of team positioning on ball recovery, and players who are more prone to mistakes under pressure."
}