{
    "title": "TREA: Tree-Structure Reasoning Schema for Conversational Recommendation. (arXiv:2307.10543v1 [cs.AI])",
    "abstract": "Conversational recommender systems (CRS) aim to timely trace the dynamic interests of users through dialogues and generate relevant responses for item recommendations. Recently, various external knowledge bases (especially knowledge graphs) are incorporated into CRS to enhance the understanding of conversation contexts. However, recent reasoning-based models heavily rely on simplified structures such as linear structures or fixed-hierarchical structures for causality reasoning, hence they cannot fully figure out sophisticated relationships among utterances with external knowledge. To address this, we propose a novel Tree structure Reasoning schEmA named TREA. TREA constructs a multi-hierarchical scalable tree as the reasoning structure to clarify the causal relationships between mentioned entities, and fully utilizes historical conversations to generate more reasonable and suitable responses for recommended results. Extensive experiments on two public CRS datasets have demonstrated the",
    "link": "http://arxiv.org/abs/2307.10543",
    "context": "Title: TREA: Tree-Structure Reasoning Schema for Conversational Recommendation. (arXiv:2307.10543v1 [cs.AI])\nAbstract: Conversational recommender systems (CRS) aim to timely trace the dynamic interests of users through dialogues and generate relevant responses for item recommendations. Recently, various external knowledge bases (especially knowledge graphs) are incorporated into CRS to enhance the understanding of conversation contexts. However, recent reasoning-based models heavily rely on simplified structures such as linear structures or fixed-hierarchical structures for causality reasoning, hence they cannot fully figure out sophisticated relationships among utterances with external knowledge. To address this, we propose a novel Tree structure Reasoning schEmA named TREA. TREA constructs a multi-hierarchical scalable tree as the reasoning structure to clarify the causal relationships between mentioned entities, and fully utilizes historical conversations to generate more reasonable and suitable responses for recommended results. Extensive experiments on two public CRS datasets have demonstrated the",
    "path": "papers/23/07/2307.10543.json",
    "total_tokens": 874,
    "translated_title": "TREA: 树状结构推理模式用于对话式推荐系统",
    "translated_abstract": "对话式推荐系统旨在通过对话追踪用户的动态兴趣，并生成与物品推荐相关的响应。最近，为了增强对话上下文的理解，各种外部知识库（特别是知识图谱）被纳入到对话式推荐系统中。然而，最近的基于推理的模型过于依赖简化的结构，如线性结构或固定的层次结构，无法完全理解与外部知识相关的对话之间的复杂关系。为了解决这个问题，我们提出了一个名为TREA的新颖的树状结构推理模式。TREA构建了一个多层次可扩展的树作为推理结构，以澄清所提及实体之间的因果关系，并充分利用历史对话生成更合理和适当的推荐结果响应。对两个公共对话式推荐系统数据集进行了广泛的实验证明了TREA的有效性。",
    "tldr": "TREA是一种树状结构推理模式，可用于对话式推荐系统。它通过构建一个多层次的可扩展树来澄清对话中提及实体之间的因果关系，并充分利用历史对话生成更合理和适当的推荐结果响应。",
    "en_tdlr": "TREA is a tree-structured reasoning schema for conversational recommendation systems. It clarifies the causal relationships between mentioned entities by constructing a multi-hierarchical scalable tree, and utilizes historical conversations to generate more reasonable and suitable responses for recommended results."
}