{
    "title": "Learning Nonlinear Projections for Reduced-Order Modeling of Dynamical Systems using Constrained Autoencoders. (arXiv:2307.15288v1 [math.DS])",
    "abstract": "Recently developed reduced-order modeling techniques aim to approximate nonlinear dynamical systems on low-dimensional manifolds learned from data. This is an effective approach for modeling dynamics in a post-transient regime where the effects of initial conditions and other disturbances have decayed. However, modeling transient dynamics near an underlying manifold, as needed for real-time control and forecasting applications, is complicated by the effects of fast dynamics and nonnormal sensitivity mechanisms. To begin to address these issues, we introduce a parametric class of nonlinear projections described by constrained autoencoder neural networks in which both the manifold and the projection fibers are learned from data. Our architecture uses invertible activation functions and biorthogonal weight matrices to ensure that the encoder is a left inverse of the decoder. We also introduce new dynamics-aware cost functions that promote learning of oblique projection fibers that account",
    "link": "http://arxiv.org/abs/2307.15288",
    "context": "Title: Learning Nonlinear Projections for Reduced-Order Modeling of Dynamical Systems using Constrained Autoencoders. (arXiv:2307.15288v1 [math.DS])\nAbstract: Recently developed reduced-order modeling techniques aim to approximate nonlinear dynamical systems on low-dimensional manifolds learned from data. This is an effective approach for modeling dynamics in a post-transient regime where the effects of initial conditions and other disturbances have decayed. However, modeling transient dynamics near an underlying manifold, as needed for real-time control and forecasting applications, is complicated by the effects of fast dynamics and nonnormal sensitivity mechanisms. To begin to address these issues, we introduce a parametric class of nonlinear projections described by constrained autoencoder neural networks in which both the manifold and the projection fibers are learned from data. Our architecture uses invertible activation functions and biorthogonal weight matrices to ensure that the encoder is a left inverse of the decoder. We also introduce new dynamics-aware cost functions that promote learning of oblique projection fibers that account",
    "path": "papers/23/07/2307.15288.json",
    "total_tokens": 871,
    "translated_title": "使用受约束的自编码器学习非线性投影，用于动态系统的降阶建模",
    "translated_abstract": "最近开发的降阶建模技术旨在通过从数据中学习的低维流形对非线性动态系统进行逼近。这是一种在过渡后条件中对动力学建模的有效方法，其中初始条件和其他干扰的效应已经衰减。然而，对于需要实时控制和预测应用的基于流形的瞬态动力学建模来说，快速动态和非正常敏感机制的影响使得问题变得复杂。为了开始解决这些问题，我们引入了由从数据中学习的约束自编码器神经网络描述的一种参数化非线性投影类。我们的架构使用可逆激活函数和对偶权重矩阵，以确保编码器是解码器的左逆。我们还引入了新的具有动态感知性的成本函数，以促进学习考虑斜投影纤维的能力。",
    "tldr": "该论文提出了一种使用受约束的自编码器学习非线性投影的方法，用于动态系统的降阶建模。这种方法可以有效地对非线性动力学系统进行逼近，并解决了在流形附近对瞬态动力学建模时所面临的问题。",
    "en_tdlr": "This paper introduces a method for learning nonlinear projections using constrained autoencoders for reduced-order modeling of dynamical systems. The approach effectively approximates nonlinear dynamics and addresses the challenges of modeling transient dynamics near a manifold."
}