{
    "title": "ARC-NLP at Multimodal Hate Speech Event Detection 2023: Multimodal Methods Boosted by Ensemble Learning, Syntactical and Entity Features. (arXiv:2307.13829v1 [cs.CL])",
    "abstract": "Text-embedded images can serve as a means of spreading hate speech, propaganda, and extremist beliefs. Throughout the Russia-Ukraine war, both opposing factions heavily relied on text-embedded images as a vehicle for spreading propaganda and hate speech. Ensuring the effective detection of hate speech and propaganda is of utmost importance to mitigate the negative effect of hate speech dissemination. In this paper, we outline our methodologies for two subtasks of Multimodal Hate Speech Event Detection 2023. For the first subtask, hate speech detection, we utilize multimodal deep learning models boosted by ensemble learning and syntactical text attributes. For the second subtask, target detection, we employ multimodal deep learning models boosted by named entity features. Through experimentation, we demonstrate the superior performance of our models compared to all textual, visual, and text-visual baselines employed in multimodal hate speech detection. Furthermore, our models achieve th",
    "link": "http://arxiv.org/abs/2307.13829",
    "context": "Title: ARC-NLP at Multimodal Hate Speech Event Detection 2023: Multimodal Methods Boosted by Ensemble Learning, Syntactical and Entity Features. (arXiv:2307.13829v1 [cs.CL])\nAbstract: Text-embedded images can serve as a means of spreading hate speech, propaganda, and extremist beliefs. Throughout the Russia-Ukraine war, both opposing factions heavily relied on text-embedded images as a vehicle for spreading propaganda and hate speech. Ensuring the effective detection of hate speech and propaganda is of utmost importance to mitigate the negative effect of hate speech dissemination. In this paper, we outline our methodologies for two subtasks of Multimodal Hate Speech Event Detection 2023. For the first subtask, hate speech detection, we utilize multimodal deep learning models boosted by ensemble learning and syntactical text attributes. For the second subtask, target detection, we employ multimodal deep learning models boosted by named entity features. Through experimentation, we demonstrate the superior performance of our models compared to all textual, visual, and text-visual baselines employed in multimodal hate speech detection. Furthermore, our models achieve th",
    "path": "papers/23/07/2307.13829.json",
    "total_tokens": 997,
    "translated_title": "《2023年多模态仇恨言论事件检测中的ARC-NLP: 通过集成学习、句法和实体特征提升的多模态方法》",
    "translated_abstract": "文本嵌入图片可以传播仇恨言论、宣传和极端主义信仰。在俄罗斯-乌克兰战争期间，双方都大量依赖文本嵌入图片传播宣传和仇恨言论。确保有效检测仇恨言论和宣传对于减轻仇恨言论传播的负面影响至关重要。本文概述了我们在《2023年多模态仇恨言论事件检测》两个子任务中的方法。对于第一个子任务，仇恨言论检测，我们采用了通过集成学习和句法文本属性提升的多模态深度学习模型。对于第二个子任务，目标检测，我们使用了通过命名实体特征提升的多模态深度学习模型。通过实验，我们证明了我们的模型相较于在多模态仇恨言论检测中使用的所有文本、视觉和文本-视觉基准线的卓越性能。",
    "tldr": "本文介绍了在《2023年多模态仇恨言论事件检测》中，我们利用多模态深度学习模型与集成学习和句法、实体特征相结合的方法来检测仇恨言论和宣传。通过实验证明，我们的模型在多模态仇恨言论检测中表现出优异的性能。",
    "en_tdlr": "This paper presents our methodologies for detecting hate speech and propaganda in the Multimodal Hate Speech Event Detection 2023 using multimodal deep learning models combined with ensemble learning, syntactical and entity features. Through experimentation, our models demonstrate superior performance compared to textual, visual, and text-visual baselines employed in multimodal hate speech detection."
}