{
    "title": "Dynamic Domain Discrepancy Adjustment for Active Multi-Domain Adaptation. (arXiv:2307.14068v1 [cs.LG])",
    "abstract": "Multi-source unsupervised domain adaptation (MUDA) aims to transfer knowledge from related source domains to an unlabeled target domain. While recent MUDA methods have shown promising results, most focus on aligning the overall feature distributions across source domains, which can lead to negative effects due to redundant features within each domain. Moreover, there is a significant performance gap between MUDA and supervised methods. To address these challenges, we propose a novel approach called Dynamic Domain Discrepancy Adjustment for Active Multi-Domain Adaptation (D3AAMDA). Firstly, we establish a multi-source dynamic modulation mechanism during the training process based on the degree of distribution differences between source and target domains. This mechanism controls the alignment level of features between each source domain and the target domain, effectively leveraging the local advantageous feature information within the source domains. Additionally, we propose a Multi-sou",
    "link": "http://arxiv.org/abs/2307.14068",
    "context": "Title: Dynamic Domain Discrepancy Adjustment for Active Multi-Domain Adaptation. (arXiv:2307.14068v1 [cs.LG])\nAbstract: Multi-source unsupervised domain adaptation (MUDA) aims to transfer knowledge from related source domains to an unlabeled target domain. While recent MUDA methods have shown promising results, most focus on aligning the overall feature distributions across source domains, which can lead to negative effects due to redundant features within each domain. Moreover, there is a significant performance gap between MUDA and supervised methods. To address these challenges, we propose a novel approach called Dynamic Domain Discrepancy Adjustment for Active Multi-Domain Adaptation (D3AAMDA). Firstly, we establish a multi-source dynamic modulation mechanism during the training process based on the degree of distribution differences between source and target domains. This mechanism controls the alignment level of features between each source domain and the target domain, effectively leveraging the local advantageous feature information within the source domains. Additionally, we propose a Multi-sou",
    "path": "papers/23/07/2307.14068.json",
    "total_tokens": 917,
    "translated_title": "动态域差异调整用于主动多领域适应的研究",
    "translated_abstract": "多源无监督领域适应（MUDA）旨在将相关源域的知识转移至无标签目标域。虽然最近的MUDA方法显示出了有希望的结果，但大部分方法都专注于对齐源域之间的整体特征分布，这可能会导致由于每个域内冗余特征而产生负面影响。此外，MUDA方法与监督方法之间存在明显的性能差距。为了解决这些挑战，我们提出了一种名为动态域差异调整用于主动多领域适应（D3AAMDA）的新方法。首先，我们在训练过程中建立了一个多源动态调制机制，该机制基于源域与目标域之间的分布差异程度。该机制控制每个源域与目标域之间特征的对齐程度，有效地利用源域内的局部有利特征信息。此外，我们还提出了一种多源的...",
    "tldr": "该论文提出了一种名为D3AAMDA的新方法，通过动态调整特征分布的对齐程度，有效地利用源域内的局部有利特征信息，以解决多源无监督领域适应中的性能差距和冗余特征的问题。"
}