{
    "title": "ADR-GNN: Advection-Diffusion-Reaction Graph Neural Networks. (arXiv:2307.16092v1 [cs.LG])",
    "abstract": "Graph neural networks (GNNs) have shown remarkable success in learning representations for graph-structured data. However, GNNs still face challenges in modeling complex phenomena that involve advection. In this paper, we propose a novel GNN architecture based on Advection-Diffusion-Reaction systems, called ADR-GNN. Advection models the directed transportation of information, diffusion captures the local smoothing of information, and reaction represents the non-linear transformation of information in channels. We provide an analysis of the qualitative behavior of ADR-GNN, that shows the benefit of combining advection, diffusion, and reaction. To demonstrate its efficacy, we evaluate ADR-GNN on real-world node classification and spatio-temporal datasets, and show that it improves or offers competitive performance compared to state-of-the-art networks.",
    "link": "http://arxiv.org/abs/2307.16092",
    "context": "Title: ADR-GNN: Advection-Diffusion-Reaction Graph Neural Networks. (arXiv:2307.16092v1 [cs.LG])\nAbstract: Graph neural networks (GNNs) have shown remarkable success in learning representations for graph-structured data. However, GNNs still face challenges in modeling complex phenomena that involve advection. In this paper, we propose a novel GNN architecture based on Advection-Diffusion-Reaction systems, called ADR-GNN. Advection models the directed transportation of information, diffusion captures the local smoothing of information, and reaction represents the non-linear transformation of information in channels. We provide an analysis of the qualitative behavior of ADR-GNN, that shows the benefit of combining advection, diffusion, and reaction. To demonstrate its efficacy, we evaluate ADR-GNN on real-world node classification and spatio-temporal datasets, and show that it improves or offers competitive performance compared to state-of-the-art networks.",
    "path": "papers/23/07/2307.16092.json",
    "total_tokens": 762,
    "translated_title": "ADR-GNN：平流-扩散-反应图神经网络",
    "translated_abstract": "图神经网络在学习图结构数据表示方面取得了显著的成功。然而，GNN在建模涉及平流的复杂现象方面仍面临挑战。本文提出了一种基于平流-扩散-反应系统的新型GNN架构，称为ADR-GNN。平流模式化了信息的有向传输，扩散捕捉了信息的局部平滑，反应代表了通道中信息的非线性转换。我们对ADR-GNN的定性行为进行了分析，显示了将平流、扩散和反应结合的好处。为了证明其有效性，我们在真实世界的节点分类和时空数据集上评估了ADR-GNN，并展示了它相对于最先进网络的改进或竞争性表现。",
    "tldr": "本文提出了ADR-GNN，一种基于平流-扩散-反应系统的图神经网络架构。ADR-GNN在涉及平流的复杂现象建模方面具有优势，并在节点分类和时空数据集上显示出与最先进网络相比的改进或竞争性表现。"
}