{
    "title": "Theoretically Principled Trade-off for Stateful Defenses against Query-Based Black-Box Attacks. (arXiv:2307.16331v1 [cs.LG])",
    "abstract": "Adversarial examples threaten the integrity of machine learning systems with alarming success rates even under constrained black-box conditions. Stateful defenses have emerged as an effective countermeasure, detecting potential attacks by maintaining a buffer of recent queries and detecting new queries that are too similar. However, these defenses fundamentally pose a trade-off between attack detection and false positive rates, and this trade-off is typically optimized by hand-picking feature extractors and similarity thresholds that empirically work well. There is little current understanding as to the formal limits of this trade-off and the exact properties of the feature extractors/underlying problem domain that influence it. This work aims to address this gap by offering a theoretical characterization of the trade-off between detection and false positive rates for stateful defenses. We provide upper bounds for detection rates of a general class of feature extractors and analyze the",
    "link": "http://arxiv.org/abs/2307.16331",
    "context": "Title: Theoretically Principled Trade-off for Stateful Defenses against Query-Based Black-Box Attacks. (arXiv:2307.16331v1 [cs.LG])\nAbstract: Adversarial examples threaten the integrity of machine learning systems with alarming success rates even under constrained black-box conditions. Stateful defenses have emerged as an effective countermeasure, detecting potential attacks by maintaining a buffer of recent queries and detecting new queries that are too similar. However, these defenses fundamentally pose a trade-off between attack detection and false positive rates, and this trade-off is typically optimized by hand-picking feature extractors and similarity thresholds that empirically work well. There is little current understanding as to the formal limits of this trade-off and the exact properties of the feature extractors/underlying problem domain that influence it. This work aims to address this gap by offering a theoretical characterization of the trade-off between detection and false positive rates for stateful defenses. We provide upper bounds for detection rates of a general class of feature extractors and analyze the",
    "path": "papers/23/07/2307.16331.json",
    "total_tokens": 868,
    "translated_title": "针对基于查询的黑盒攻击的有状态防御的理论权衡",
    "translated_abstract": "对抗性样本即使在受限的黑盒条件下也对机器学习系统的完整性构成威胁，取得了惊人的成功率。有状态防御已经成为一种有效的对策，通过维护最近查询的缓冲区并检测相似度过高的新查询来检测潜在的攻击。然而，这些防御在攻击检测和误报率之间存在基本的权衡，通常通过手动选择特征提取器和相似性阈值来优化此权衡，这些方法在实践中表现良好，但对于这个权衡的形式限制以及影响它的特征提取器和基础问题域的确切属性缺乏充分的理解。本文旨在通过提供对有状态防御的检测率和误报率之间的权衡的理论描述来填补这一差距。我们给出了一般类特征提取器检测率的上界，并分析了特征提取器和基本问题域的属性。",
    "tldr": "本文提供了一种针对有状态防御的检测率和误报率之间的权衡的理论描述，并给出了特征提取器检测率的上界。"
}