{
    "title": "Operator Guidance Informed by AI-Augmented Simulations. (arXiv:2307.08810v1 [cs.AI])",
    "abstract": "This paper will present a multi-fidelity, data-adaptive approach with a Long Short-Term Memory (LSTM) neural network to estimate ship response statistics in bimodal, bidirectional seas. The study will employ a fast low-fidelity, volume-based tool SimpleCode and a higher-fidelity tool known as the Large Amplitude Motion Program (LAMP). SimpleCode and LAMP data were generated by common bi-modal, bi-directional sea conditions in the North Atlantic as training data. After training an LSTM network with LAMP ship motion response data, a sample route was traversed and randomly sampled historical weather was input into SimpleCode and the LSTM network, and compared against the higher fidelity results.",
    "link": "http://arxiv.org/abs/2307.08810",
    "context": "Title: Operator Guidance Informed by AI-Augmented Simulations. (arXiv:2307.08810v1 [cs.AI])\nAbstract: This paper will present a multi-fidelity, data-adaptive approach with a Long Short-Term Memory (LSTM) neural network to estimate ship response statistics in bimodal, bidirectional seas. The study will employ a fast low-fidelity, volume-based tool SimpleCode and a higher-fidelity tool known as the Large Amplitude Motion Program (LAMP). SimpleCode and LAMP data were generated by common bi-modal, bi-directional sea conditions in the North Atlantic as training data. After training an LSTM network with LAMP ship motion response data, a sample route was traversed and randomly sampled historical weather was input into SimpleCode and the LSTM network, and compared against the higher fidelity results.",
    "path": "papers/23/07/2307.08810.json",
    "total_tokens": 771,
    "translated_title": "AI增强模拟指导的操作员指导方法",
    "translated_abstract": "本文将介绍一种基于多保真度和数据自适应的方法，利用长短期记忆神经网络(LSTM)来估计双峰双向海况下船舶响应统计量。研究将采用快速低保真度的基于体积的工具SimpleCode和更高保真度的工具Large Amplitude Motion Program (LAMP)。训练数据是通过常见的双峰双向海况在北大西洋生成的SimpleCode和LAMP数据。在用LAMP船舶运动响应数据训练LSTM网络后，样本路线被穿过，随机选取历史天气输入SimpleCode和LSTM网络，并与更高保真度的结果进行比较。",
    "tldr": "本文介绍了一种基于AI增强模拟指导的操作员指导方法，利用LSTM神经网络估计双峰双向海况下船舶响应统计量。通过对比低保真度和高保真度结果，证明了该方法的有效性。",
    "en_tdlr": "This paper presents an operator guidance method informed by AI-augmented simulations, using an LSTM neural network to estimate ship response statistics in bimodal, bidirectional seas. The effectiveness of the method is demonstrated by comparing the results of low-fidelity and high-fidelity simulations."
}