{
    "title": "ChiENN: Embracing Molecular Chirality with Graph Neural Networks. (arXiv:2307.02198v2 [cs.LG] UPDATED)",
    "abstract": "Graph Neural Networks (GNNs) play a fundamental role in many deep learning problems, in particular in cheminformatics. However, typical GNNs cannot capture the concept of chirality, which means they do not distinguish between the 3D graph of a chemical compound and its mirror image (enantiomer). The ability to distinguish between enantiomers is important especially in drug discovery because enantiomers can have very distinct biochemical properties. In this paper, we propose a theoretically justified message-passing scheme, which makes GNNs sensitive to the order of node neighbors. We apply that general concept in the context of molecular chirality to construct Chiral Edge Neural Network (ChiENN) layer which can be appended to any GNN model to enable chirality-awareness. Our experiments show that adding ChiENN layers to a GNN outperforms current state-of-the-art methods in chiral-sensitive molecular property prediction tasks.",
    "link": "http://arxiv.org/abs/2307.02198",
    "context": "Title: ChiENN: Embracing Molecular Chirality with Graph Neural Networks. (arXiv:2307.02198v2 [cs.LG] UPDATED)\nAbstract: Graph Neural Networks (GNNs) play a fundamental role in many deep learning problems, in particular in cheminformatics. However, typical GNNs cannot capture the concept of chirality, which means they do not distinguish between the 3D graph of a chemical compound and its mirror image (enantiomer). The ability to distinguish between enantiomers is important especially in drug discovery because enantiomers can have very distinct biochemical properties. In this paper, we propose a theoretically justified message-passing scheme, which makes GNNs sensitive to the order of node neighbors. We apply that general concept in the context of molecular chirality to construct Chiral Edge Neural Network (ChiENN) layer which can be appended to any GNN model to enable chirality-awareness. Our experiments show that adding ChiENN layers to a GNN outperforms current state-of-the-art methods in chiral-sensitive molecular property prediction tasks.",
    "path": "papers/23/07/2307.02198.json",
    "total_tokens": 981,
    "translated_title": "ChiENN: 用图神经网络实现对分子手性的拥抱",
    "translated_abstract": "图神经网络在许多深度学习问题中起着基础作用，尤其在化学信息学中。然而，典型的图神经网络不能捕捉手性的概念，这意味着它们无法区分化学化合物的3D图与其对映体（对映异构体）的差异。区分对映异构体的能力在药物发现中尤为重要，因为对映异构体可能具有非常不同的生物化学性质。在本文中，我们提出了一种在理论上得到了证明的信息传递方案，使得图神经网络对节点邻居的顺序敏感。我们将这个通用概念应用在分子手性的背景下，构建了可以附加到任何图神经网络模型的手性边缘神经网络（ChiENN）层，以实现对手性的意识。我们的实验证明，将ChiENN层添加到图神经网络中，优于当前最先进的方法，在对手性敏感的分子性质预测任务中表现出色。",
    "tldr": "这篇论文介绍了一种名为ChiENN的图神经网络层，通过引入对手性敏感的信息传递方案，使得图神经网络能够区分化学化合物和其对映体之间的差异。在化学信息学中，这种方法在药物发现领域的手性敏感分子性质预测任务中表现出超越当前最先进方法的优异性能。"
}