{
    "title": "Through the Fairness Lens: Experimental Analysis and Evaluation of Entity Matching. (arXiv:2307.02726v1 [cs.DB])",
    "abstract": "Entity matching (EM) is a challenging problem studied by different communities for over half a century. Algorithmic fairness has also become a timely topic to address machine bias and its societal impacts. Despite extensive research on these two topics, little attention has been paid to the fairness of entity matching.  Towards addressing this gap, we perform an extensive experimental evaluation of a variety of EM techniques in this paper. We generated two social datasets from publicly available datasets for the purpose of auditing EM through the lens of fairness. Our findings underscore potential unfairness under two common conditions in real-world societies: (i) when some demographic groups are overrepresented, and (ii) when names are more similar in some groups compared to others. Among our many findings, it is noteworthy to mention that while various fairness definitions are valuable for different settings, due to EM's class imbalance nature, measures such as positive predictive va",
    "link": "http://arxiv.org/abs/2307.02726",
    "context": "Title: Through the Fairness Lens: Experimental Analysis and Evaluation of Entity Matching. (arXiv:2307.02726v1 [cs.DB])\nAbstract: Entity matching (EM) is a challenging problem studied by different communities for over half a century. Algorithmic fairness has also become a timely topic to address machine bias and its societal impacts. Despite extensive research on these two topics, little attention has been paid to the fairness of entity matching.  Towards addressing this gap, we perform an extensive experimental evaluation of a variety of EM techniques in this paper. We generated two social datasets from publicly available datasets for the purpose of auditing EM through the lens of fairness. Our findings underscore potential unfairness under two common conditions in real-world societies: (i) when some demographic groups are overrepresented, and (ii) when names are more similar in some groups compared to others. Among our many findings, it is noteworthy to mention that while various fairness definitions are valuable for different settings, due to EM's class imbalance nature, measures such as positive predictive va",
    "path": "papers/23/07/2307.02726.json",
    "total_tokens": 944,
    "translated_title": "经过公平性角度的实验分析和评估实体匹配问题",
    "translated_abstract": "实体匹配是一个具有挑战性的问题，多个社区已经研究了半个多世纪。算法公平性也已经成为解决机器偏见及其社会影响的一个及时话题。尽管对这两个问题进行了广泛的研究，但对实体匹配的公平性关注甚少。为了解决这一差距，本文对多种实体匹配技术进行了广泛的实验评估。我们从公开可得的数据集中生成了两个社交数据集，以通过公平性的视角审查实体匹配。我们的研究结果强调了现实社会中两种常见情况下的潜在不公平性：（i）某些人口群体的过度代表和（ii）某些群体中的姓名相比其他群体更相似。在我们众多的研究发现中，值得一提的是，虽然各种公平性定义在不同环境中都是有价值的，但由于实体匹配具有类别不平衡的特点，例如正预测率等指标在这种情况下更有价值。",
    "tldr": "本文通过实验对多种实体匹配技术进行了广泛评估，发现实体匹配存在潜在的不公平性。研究结果表明，当某些人口群体过度代表或某些群体中的姓名更相似时，实体匹配可能存在公平性问题。",
    "en_tdlr": "This paper performs an extensive experimental evaluation of various entity matching techniques and finds potential fairness issues in entity matching. The study highlights that overrepresentation of certain demographic groups and similarity of names in certain groups can lead to fairness concerns in entity matching."
}