{
    "title": "Predicting Outcomes in Long COVID Patients with Spatiotemporal Attention. (arXiv:2307.04770v1 [cs.LG])",
    "abstract": "Long COVID is a general term of post-acute sequelae of COVID-19. Patients with long COVID can endure long-lasting symptoms including fatigue, headache, dyspnea and anosmia, etc. Identifying the cohorts with severe long-term complications in COVID-19 could benefit the treatment planning and resource arrangement. However, due to the heterogeneous phenotype presented in long COVID patients, it is difficult to predict their outcomes from their longitudinal data. In this study, we proposed a spatiotemporal attention mechanism to weigh feature importance jointly from the temporal dimension and feature space. Considering that medical examinations can have interchangeable orders in adjacent time points, we restricted the learning of short-term dependency with a Local-LSTM and the learning of long-term dependency with the joint spatiotemporal attention. We also compared the proposed method with several state-of-the-art methods and a method in clinical practice. The methods are evaluated on a ha",
    "link": "http://arxiv.org/abs/2307.04770",
    "context": "Title: Predicting Outcomes in Long COVID Patients with Spatiotemporal Attention. (arXiv:2307.04770v1 [cs.LG])\nAbstract: Long COVID is a general term of post-acute sequelae of COVID-19. Patients with long COVID can endure long-lasting symptoms including fatigue, headache, dyspnea and anosmia, etc. Identifying the cohorts with severe long-term complications in COVID-19 could benefit the treatment planning and resource arrangement. However, due to the heterogeneous phenotype presented in long COVID patients, it is difficult to predict their outcomes from their longitudinal data. In this study, we proposed a spatiotemporal attention mechanism to weigh feature importance jointly from the temporal dimension and feature space. Considering that medical examinations can have interchangeable orders in adjacent time points, we restricted the learning of short-term dependency with a Local-LSTM and the learning of long-term dependency with the joint spatiotemporal attention. We also compared the proposed method with several state-of-the-art methods and a method in clinical practice. The methods are evaluated on a ha",
    "path": "papers/23/07/2307.04770.json",
    "total_tokens": 889,
    "translated_title": "针对长期COVID病患者的时空关注机制预测结果的研究",
    "translated_abstract": "长期COVID是指COVID-19后出现的长期后遗症的一般术语。长期COVID患者可能经历持久的症状，包括疲劳、头痛、呼吸困难和嗅觉丧失等。从长期COVID患者的纵向数据中预测其结果是困难的，因为这些患者呈现出异质的表型。在本研究中，我们提出了一种时空关注机制，从时间维度和特征空间共同权衡特征的重要性。考虑到医学检查在相邻时间点可能有可互换的顺序，我们使用了本地LSTM限制短期依赖性的学习，并使用联合时空关注机制来学习长期依赖性。我们还将所提出的方法与几种最先进的方法和一种临床实践方法进行了比较。我们在一个研究中对这些方法进行了评估。",
    "tldr": "本研究提出了一种时空关注机制来预测长期COVID患者的结果，解决了其纵向数据预测的困难性，并通过与其他方法进行比较，证明了该方法的有效性。",
    "en_tdlr": "This study presents a spatiotemporal attention mechanism to predict outcomes in long COVID patients, addressing the difficulty of predicting from their longitudinal data. The proposed method is shown to be effective by comparing with other methods."
}