{
    "title": "Scaling machine learning-based chemical plant simulation: A method for fine-tuning a model to induce stable fixed points. (arXiv:2307.13621v1 [cs.LG])",
    "abstract": "Idealized first-principles models of chemical plants can be inaccurate. An alternative is to fit a Machine Learning (ML) model directly to plant sensor data. We use a structured approach: Each unit within the plant gets represented by one ML model. After fitting the models to the data, the models are connected into a flowsheet-like directed graph. We find that for smaller plants, this approach works well, but for larger plants, the complex dynamics arising from large and nested cycles in the flowsheet lead to instabilities in the cycle solver. We analyze this problem in depth and show that it is not merely a specialized concern but rather a more pervasive challenge that will likely occur whenever ML is applied to larger plants. To address this problem, we present a way to fine-tune ML models such that solving cycles with the usual methods becomes robust again.",
    "link": "http://arxiv.org/abs/2307.13621",
    "context": "Title: Scaling machine learning-based chemical plant simulation: A method for fine-tuning a model to induce stable fixed points. (arXiv:2307.13621v1 [cs.LG])\nAbstract: Idealized first-principles models of chemical plants can be inaccurate. An alternative is to fit a Machine Learning (ML) model directly to plant sensor data. We use a structured approach: Each unit within the plant gets represented by one ML model. After fitting the models to the data, the models are connected into a flowsheet-like directed graph. We find that for smaller plants, this approach works well, but for larger plants, the complex dynamics arising from large and nested cycles in the flowsheet lead to instabilities in the cycle solver. We analyze this problem in depth and show that it is not merely a specialized concern but rather a more pervasive challenge that will likely occur whenever ML is applied to larger plants. To address this problem, we present a way to fine-tune ML models such that solving cycles with the usual methods becomes robust again.",
    "path": "papers/23/07/2307.13621.json",
    "total_tokens": 879,
    "translated_title": "缩放基于机器学习的化工厂模拟：用于调整模型以诱导稳定固定点的方法",
    "translated_abstract": "理想化的化工厂基于第一原理的模型可能不准确。另一种方法是直接将机器学习（ML）模型拟合到工厂传感器数据上。我们采用一种结构化的方法：将工厂内的每个单元表示为一个ML模型。在将模型拟合到数据后，将模型连接成类似流程图的有向图。我们发现，对于较小的工厂，这种方法效果很好，但对于较大的工厂，由于流程图中存在大型和嵌套循环所导致的复杂动力学会导致循环求解器的不稳定性。我们对这个问题进行了深入分析，并表明这不仅仅是一个特殊关注点，而是一个更普遍的挑战，可能在应用于较大的工厂时会发生。为了解决这个问题，我们提出了一种方法，可以将ML模型进行微调，从而使得常规方法下的循环求解变得稳健。",
    "tldr": "本研究提出了一种缩放基于机器学习的化工厂模拟的方法，并通过微调模型解决了在应用于较大工厂时出现的循环求解不稳定的问题。",
    "en_tdlr": "This study presents a method for scaling machine learning-based chemical plant simulation and addresses the instability of cycle solver in larger plants by fine-tuning the models."
}