{
    "title": "Cross-Element Combinatorial Selection for Multi-Element Creative in Display Advertising. (arXiv:2307.01593v1 [cs.IR])",
    "abstract": "The effectiveness of ad creatives is greatly influenced by their visual appearance. Advertising platforms can generate ad creatives with different appearances by combining creative elements provided by advertisers. However, with the increasing number of ad creative elements, it becomes challenging to select a suitable combination from the countless possibilities. The industry's mainstream approach is to select individual creative elements independently, which often overlooks the importance of interaction between creative elements during the modeling process. In response, this paper proposes a Cross-Element Combinatorial Selection framework for multiple creative elements, termed CECS. In the encoder process, a cross-element interaction is adopted to dynamically adjust the expression of a single creative element based on the current candidate creatives. In the decoder process, the creative combination problem is transformed into a cascade selection problem of multiple creative elements. ",
    "link": "http://arxiv.org/abs/2307.01593",
    "context": "Title: Cross-Element Combinatorial Selection for Multi-Element Creative in Display Advertising. (arXiv:2307.01593v1 [cs.IR])\nAbstract: The effectiveness of ad creatives is greatly influenced by their visual appearance. Advertising platforms can generate ad creatives with different appearances by combining creative elements provided by advertisers. However, with the increasing number of ad creative elements, it becomes challenging to select a suitable combination from the countless possibilities. The industry's mainstream approach is to select individual creative elements independently, which often overlooks the importance of interaction between creative elements during the modeling process. In response, this paper proposes a Cross-Element Combinatorial Selection framework for multiple creative elements, termed CECS. In the encoder process, a cross-element interaction is adopted to dynamically adjust the expression of a single creative element based on the current candidate creatives. In the decoder process, the creative combination problem is transformed into a cascade selection problem of multiple creative elements. ",
    "path": "papers/23/07/2307.01593.json",
    "total_tokens": 857,
    "translated_title": "显示广告中多元素创意的跨元素组合选择",
    "translated_abstract": "广告创意的有效性很大程度上受其视觉外观的影响。广告平台可以通过组合广告创意中的不同元素来生成具有不同外观的广告创意。然而，随着广告创意元素数量的增加，从无数可能性中选择合适的组合变得具有挑战性。行业的主流方法是独立选择各个创意元素，这经常忽视了建模过程中创意元素之间相互作用的重要性。作为回应，本文提出了一个用于多个创意元素的跨元素组合选择框架，称为CECS。在编码器过程中，采用了跨元素交互，根据当前候选创意动态调整单个创意元素的表达。在解码器过程中，将创意组合问题转化为多个创意元素级联选择问题。",
    "tldr": "这篇论文提出了一个跨元素组合选择框架CECS，用于解决显示广告中多元素创意选择的问题，通过采用跨元素交互的方式进行编码，将创意组合问题转化为多个创意元素级联选择问题。",
    "en_tdlr": "This paper proposes a Cross-Element Combinatorial Selection framework (CECS) for selecting multiple creative elements in display advertising, addressing the challenge of selecting suitable combinations from numerous possibilities. CECS utilizes cross-element interaction in the encoding process and transforms the creative combination problem into a cascade selection problem of multiple creative elements."
}