{
    "title": "Unifying Token and Span Level Supervisions for Few-Shot Sequence Labeling. (arXiv:2307.07946v1 [cs.CL])",
    "abstract": "Few-shot sequence labeling aims to identify novel classes based on only a few labeled samples. Existing methods solve the data scarcity problem mainly by designing token-level or span-level labeling models based on metric learning. However, these methods are only trained at a single granularity (i.e., either token level or span level) and have some weaknesses of the corresponding granularity. In this paper, we first unify token and span level supervisions and propose a Consistent Dual Adaptive Prototypical (CDAP) network for few-shot sequence labeling. CDAP contains the token-level and span-level networks, jointly trained at different granularities. To align the outputs of two networks, we further propose a consistent loss to enable them to learn from each other. During the inference phase, we propose a consistent greedy inference algorithm that first adjusts the predicted probability and then greedily selects non-overlapping spans with maximum probability. Extensive experiments show t",
    "link": "http://arxiv.org/abs/2307.07946",
    "context": "Title: Unifying Token and Span Level Supervisions for Few-Shot Sequence Labeling. (arXiv:2307.07946v1 [cs.CL])\nAbstract: Few-shot sequence labeling aims to identify novel classes based on only a few labeled samples. Existing methods solve the data scarcity problem mainly by designing token-level or span-level labeling models based on metric learning. However, these methods are only trained at a single granularity (i.e., either token level or span level) and have some weaknesses of the corresponding granularity. In this paper, we first unify token and span level supervisions and propose a Consistent Dual Adaptive Prototypical (CDAP) network for few-shot sequence labeling. CDAP contains the token-level and span-level networks, jointly trained at different granularities. To align the outputs of two networks, we further propose a consistent loss to enable them to learn from each other. During the inference phase, we propose a consistent greedy inference algorithm that first adjusts the predicted probability and then greedily selects non-overlapping spans with maximum probability. Extensive experiments show t",
    "path": "papers/23/07/2307.07946.json",
    "total_tokens": 900,
    "translated_title": "联合令牌级别和跨度级别的监督用于少样本序列标注",
    "translated_abstract": "少样本序列标注旨在仅依据少量标注样本来识别新的类别。现有的方法主要通过设计基于度量学习的令牌级别或跨度级别标注模型来解决数据稀缺问题。然而，这些方法只在单一粒度上训练（即令牌级别或跨度级别），并且具有相应粒度的一些弱点。在本文中，我们首次统一了令牌级别和跨度级别的监督，并提出了一种一致双自适应原型网络（CDAP）用于少样本序列标注。CDAP包含令牌级别和跨度级别的网络，在不同粒度上进行联合训练。为了使两个网络的输出保持一致，我们进一步提出了一种一致损失，使它们可以互相学习。在推理阶段，我们提出了一种一致贪婪推理算法，首先调整预测概率，然后贪婪地选择具有最大概率的非重叠跨度。大量实验证明",
    "tldr": "本文提出了一种统一令牌级别和跨度级别监督的CDAP网络用于少样本序列标注，通过在不同粒度上进行联合训练和一致损失，实现了两个网络的协同学习，在推理阶段使用了一致贪婪推理算法来选择非重叠跨度。"
}