{
    "title": "Can Domain Adaptation Improve Accuracy and Fairness of Skin Lesion Classification?. (arXiv:2307.03157v1 [cs.CV])",
    "abstract": "Deep learning-based diagnostic system has demonstrated potential in classifying skin cancer conditions when labeled training example are abundant. However, skin lesion analysis often suffers from a scarcity of labeled data, hindering the development of an accurate and reliable diagnostic system. In this work, we leverage multiple skin lesion datasets and investigate the feasibility of various unsupervised domain adaptation (UDA) methods in binary and multi-class skin lesion classification. In particular, we assess three UDA training schemes: single-, combined-, and multi-source. Our experiment results show that UDA is effective in binary classification, with further improvement being observed when imbalance is mitigated. In multi-class task, its performance is less prominent, and imbalance problem again needs to be addressed to achieve above-baseline accuracy. Through our quantitative analysis, we find that the test error of multi-class tasks is strongly correlated with label shift, an",
    "link": "http://arxiv.org/abs/2307.03157",
    "context": "Title: Can Domain Adaptation Improve Accuracy and Fairness of Skin Lesion Classification?. (arXiv:2307.03157v1 [cs.CV])\nAbstract: Deep learning-based diagnostic system has demonstrated potential in classifying skin cancer conditions when labeled training example are abundant. However, skin lesion analysis often suffers from a scarcity of labeled data, hindering the development of an accurate and reliable diagnostic system. In this work, we leverage multiple skin lesion datasets and investigate the feasibility of various unsupervised domain adaptation (UDA) methods in binary and multi-class skin lesion classification. In particular, we assess three UDA training schemes: single-, combined-, and multi-source. Our experiment results show that UDA is effective in binary classification, with further improvement being observed when imbalance is mitigated. In multi-class task, its performance is less prominent, and imbalance problem again needs to be addressed to achieve above-baseline accuracy. Through our quantitative analysis, we find that the test error of multi-class tasks is strongly correlated with label shift, an",
    "path": "papers/23/07/2307.03157.json",
    "total_tokens": 895,
    "translated_title": "域适应能提高皮肤病变分类的准确性和公平性吗？",
    "translated_abstract": "深度学习诊断系统在分类皮肤癌症病变时表现出潜力，但缺乏标记数据会影响准确可靠的诊断系统的发展。在本研究中，我们利用多个皮肤病变数据集，研究了各种无监督域适应方法在二分类和多分类皮肤病变分类中的可行性。尤其是，我们评估了三种域适应训练方案：单源、综合和多源。实验结果表明，域适应在二分类中是有效的，在减少不平衡的情况下还能进一步提高。在多分类任务中，其性能不太明显，需要解决不平衡问题才能达到基准准确性。通过量化分析，我们发现多分类任务的测试错误与标签偏移强烈相关。",
    "tldr": "本研究利用多个皮肤病变数据集，研究了域适应方法在皮肤病变分类中的应用。结果表明，域适应在减少不平衡的情况下对于二分类任务有效，但在多分类任务中性能较差，需要解决不平衡问题以提高准确性。",
    "en_tdlr": "This study investigates the application of domain adaptation methods in skin lesion classification using multiple datasets. The results show that domain adaptation is effective in reducing imbalance and improving accuracy in binary classification, but its performance is less prominent in multi-class tasks, requiring the addressing of imbalance to achieve higher accuracy."
}