{
    "title": "Explainable Topic-Enhanced Argument Mining from Heterogeneous Sources. (arXiv:2307.12131v1 [cs.CL])",
    "abstract": "Given a controversial target such as ``nuclear energy'', argument mining aims to identify the argumentative text from heterogeneous sources. Current approaches focus on exploring better ways of integrating the target-associated semantic information with the argumentative text. Despite their empirical successes, two issues remain unsolved: (i) a target is represented by a word or a phrase, which is insufficient to cover a diverse set of target-related subtopics; (ii) the sentence-level topic information within an argument, which we believe is crucial for argument mining, is ignored. To tackle the above issues, we propose a novel explainable topic-enhanced argument mining approach. Specifically, with the use of the neural topic model and the language model, the target information is augmented by explainable topic representations. Moreover, the sentence-level topic information within the argument is captured by minimizing the distance between its latent topic distribution and its semantic",
    "link": "http://arxiv.org/abs/2307.12131",
    "context": "Title: Explainable Topic-Enhanced Argument Mining from Heterogeneous Sources. (arXiv:2307.12131v1 [cs.CL])\nAbstract: Given a controversial target such as ``nuclear energy'', argument mining aims to identify the argumentative text from heterogeneous sources. Current approaches focus on exploring better ways of integrating the target-associated semantic information with the argumentative text. Despite their empirical successes, two issues remain unsolved: (i) a target is represented by a word or a phrase, which is insufficient to cover a diverse set of target-related subtopics; (ii) the sentence-level topic information within an argument, which we believe is crucial for argument mining, is ignored. To tackle the above issues, we propose a novel explainable topic-enhanced argument mining approach. Specifically, with the use of the neural topic model and the language model, the target information is augmented by explainable topic representations. Moreover, the sentence-level topic information within the argument is captured by minimizing the distance between its latent topic distribution and its semantic",
    "path": "papers/23/07/2307.12131.json",
    "total_tokens": 810,
    "translated_title": "从异构数据源中可解释的主题增强的论点挖掘",
    "translated_abstract": "鉴于像“核能”这样的有争议的目标，论点挖掘旨在从异构数据源中识别论证性文本。目前的方法注重探索更好的方法将目标相关的语义信息与论证性文本相结合。尽管它们在经验上取得了成功，但仍然存在两个问题：(一)目标由一个词或短语表示，无法涵盖多样化的目标相关子主题；(二)在论证中忽略了句级主题信息，我们认为这对于论点挖掘至关重要。为解决上述问题，我们提出了一种新颖的可解释的主题增强的论点挖掘方法。具体而言，通过使用神经主题模型和语言模型，目标信息通过可解释的主题表示进行扩充。此外，通过最小化其潜在主题分布与其语义之间的距离来捕捉论证中的句级主题信息。",
    "tldr": "这项研究提出了一种可解释的主题增强的论点挖掘方法，通过使用神经主题模型和语言模型来处理多样化的目标相关子主题，并利用句级主题信息进行分析。"
}