{
    "title": "TriFormer: A Multi-modal Transformer Framework For Mild Cognitive Impairment Conversion Prediction. (arXiv:2307.07177v1 [cs.CV])",
    "abstract": "The prediction of mild cognitive impairment (MCI) conversion to Alzheimer's disease (AD) is important for early treatment to prevent or slow the progression of AD. To accurately predict the MCI conversion to stable MCI or progressive MCI, we propose Triformer, a novel transformer-based framework with three specialized transformers to incorporate multi-model data. Triformer uses I) an image transformer to extract multi-view image features from medical scans, II) a clinical transformer to embed and correlate multi-modal clinical data, and III) a modality fusion transformer that produces an accurate prediction based on fusing the outputs from the image and clinical transformers. Triformer is evaluated on the Alzheimer's Disease Neuroimaging Initiative (ANDI)1 and ADNI2 datasets and outperforms previous state-of-the-art single and multi-modal methods.",
    "link": "http://arxiv.org/abs/2307.07177",
    "context": "Title: TriFormer: A Multi-modal Transformer Framework For Mild Cognitive Impairment Conversion Prediction. (arXiv:2307.07177v1 [cs.CV])\nAbstract: The prediction of mild cognitive impairment (MCI) conversion to Alzheimer's disease (AD) is important for early treatment to prevent or slow the progression of AD. To accurately predict the MCI conversion to stable MCI or progressive MCI, we propose Triformer, a novel transformer-based framework with three specialized transformers to incorporate multi-model data. Triformer uses I) an image transformer to extract multi-view image features from medical scans, II) a clinical transformer to embed and correlate multi-modal clinical data, and III) a modality fusion transformer that produces an accurate prediction based on fusing the outputs from the image and clinical transformers. Triformer is evaluated on the Alzheimer's Disease Neuroimaging Initiative (ANDI)1 and ADNI2 datasets and outperforms previous state-of-the-art single and multi-modal methods.",
    "path": "papers/23/07/2307.07177.json",
    "total_tokens": 918,
    "translated_title": "TriFormer:一种用于轻度认知损害转化预测的多模态Transformer框架",
    "translated_abstract": "对于早期治疗以防止或减缓阿尔茨海默病（AD）进展，轻度认知损害（MCI）转化为AD的预测非常重要。为了准确预测MCI转化为稳定MCI或进展MCI，我们提出了一种新颖的基于Transformer的框架TriFormer，它包括三个专门的Transformer来整合多模态数据。TriFormer使用I）图像Transformer从医学扫描中提取多视图图像特征，II）临床Transformer嵌入和相关多模态临床数据， III）模态融合Transformer根据图像和临床Transformer的输出融合产生准确预测。TriFormer在阿尔茨海默病神经影像学计划（ANDI）1和ADNI2数据集上进行评估，并在先前最先进的单模态和多模态方法上表现出更好的性能。",
    "tldr": "TriFormer是一种基于Transformer的多模态框架，用于准确预测轻度认知损害转化为稳定MCI或进展MCI的情况。该框架包括图像Transformer、临床Transformer和模态融合Transformer，通过整合多模态数据来提高预测性能，并在实验中优于先前的单模态和多模态方法。",
    "en_tdlr": "TriFormer is a multi-modal framework based on Transformer for accurately predicting the conversion of mild cognitive impairment (MCI) to stable MCI or progressive MCI. The framework incorporates image Transformer, clinical Transformer, and modality fusion Transformer to enhance prediction performance by leveraging multi-modal data, and outperforms previous single and multi-modal methods in experiments."
}