{
    "title": "EigenTrajectory: Low-Rank Descriptors for Multi-Modal Trajectory Forecasting. (arXiv:2307.09306v1 [cs.CV])",
    "abstract": "Capturing high-dimensional social interactions and feasible futures is essential for predicting trajectories. To address this complex nature, several attempts have been devoted to reducing the dimensionality of the output variables via parametric curve fitting such as the B\\'ezier curve and B-spline function. However, these functions, which originate in computer graphics fields, are not suitable to account for socially acceptable human dynamics. In this paper, we present EigenTrajectory ($\\mathbb{ET}$), a trajectory prediction approach that uses a novel trajectory descriptor to form a compact space, known here as $\\mathbb{ET}$ space, in place of Euclidean space, for representing pedestrian movements. We first reduce the complexity of the trajectory descriptor via a low-rank approximation. We transform the pedestrians' history paths into our $\\mathbb{ET}$ space represented by spatio-temporal principle components, and feed them into off-the-shelf trajectory forecasting models. The inputs",
    "link": "http://arxiv.org/abs/2307.09306",
    "context": "Title: EigenTrajectory: Low-Rank Descriptors for Multi-Modal Trajectory Forecasting. (arXiv:2307.09306v1 [cs.CV])\nAbstract: Capturing high-dimensional social interactions and feasible futures is essential for predicting trajectories. To address this complex nature, several attempts have been devoted to reducing the dimensionality of the output variables via parametric curve fitting such as the B\\'ezier curve and B-spline function. However, these functions, which originate in computer graphics fields, are not suitable to account for socially acceptable human dynamics. In this paper, we present EigenTrajectory ($\\mathbb{ET}$), a trajectory prediction approach that uses a novel trajectory descriptor to form a compact space, known here as $\\mathbb{ET}$ space, in place of Euclidean space, for representing pedestrian movements. We first reduce the complexity of the trajectory descriptor via a low-rank approximation. We transform the pedestrians' history paths into our $\\mathbb{ET}$ space represented by spatio-temporal principle components, and feed them into off-the-shelf trajectory forecasting models. The inputs",
    "path": "papers/23/07/2307.09306.json",
    "total_tokens": 968,
    "translated_title": "EigenTrajectory：用于多模态轨迹预测的低秩描述符",
    "translated_abstract": "捕捉高维社交互动和可行的未来对于预测轨迹至关重要。为了解决这种复杂性，已经致力于通过参数曲线拟合来减少输出变量的维度，例如贝塞尔曲线和B样条函数。然而，这些函数并不适合考虑到社会可接受的人体动态。在本文中，我们提出了一种名为EigenTrajectory（$\\mathbb{ET}$）的轨迹预测方法，该方法使用一种新颖的轨迹描述符来形成一个紧凑的空间，即$\\mathbb{ET}$空间，以代替欧氏空间来表示行人的移动。我们首先通过低秩逼近降低轨迹描述符的复杂性。然后，我们将行人的历史路径转化为以空间-时间主成分表示的$\\mathbb{ET}$空间，并将其输入到现成的轨迹预测模型中。",
    "tldr": "EigenTrajectory是一种用于轨迹预测的方法，通过使用一种新颖的轨迹描述符来形成一个紧凑的空间，有效捕捉高维社交互动和可行的未来，以代替传统的参数曲线拟合方法。该方法经过低秩逼近降低了轨迹描述符的复杂性，并将行人的历史路径转化为以空间-时间主成分表示的新的轨迹空间。",
    "en_tdlr": "EigenTrajectory is a method for trajectory prediction that uses a novel trajectory descriptor to form a compact space, effectively capturing high-dimensional social interactions and feasible futures instead of traditional parametric curve fitting methods. This method reduces the complexity of the trajectory descriptor through low-rank approximation and transforms pedestrians' history paths into a new trajectory space represented by spatio-temporal principle components."
}