{
    "title": "Deep Inception Networks: A General End-to-End Framework for Multi-asset Quantitative Strategies. (arXiv:2307.05522v1 [q-fin.TR])",
    "abstract": "We introduce Deep Inception Networks (DINs), a family of Deep Learning models that provide a general framework for end-to-end systematic trading strategies. DINs extract time series (TS) and cross sectional (CS) features directly from daily price returns. This removes the need for handcrafted features, and allows the model to learn from TS and CS information simultaneously. DINs benefit from a fully data-driven approach to feature extraction, whilst avoiding overfitting. Extending prior work on Deep Momentum Networks, DIN models directly output position sizes that optimise Sharpe ratio, but for the entire portfolio instead of individual assets. We propose a novel loss term to balance turnover regularisation against increased systemic risk from high correlation to the overall market. Using futures data, we show that DIN models outperform traditional TS and CS benchmarks, are robust to a range of transaction costs and perform consistently across random seeds. To balance the general natur",
    "link": "http://arxiv.org/abs/2307.05522",
    "context": "Title: Deep Inception Networks: A General End-to-End Framework for Multi-asset Quantitative Strategies. (arXiv:2307.05522v1 [q-fin.TR])\nAbstract: We introduce Deep Inception Networks (DINs), a family of Deep Learning models that provide a general framework for end-to-end systematic trading strategies. DINs extract time series (TS) and cross sectional (CS) features directly from daily price returns. This removes the need for handcrafted features, and allows the model to learn from TS and CS information simultaneously. DINs benefit from a fully data-driven approach to feature extraction, whilst avoiding overfitting. Extending prior work on Deep Momentum Networks, DIN models directly output position sizes that optimise Sharpe ratio, but for the entire portfolio instead of individual assets. We propose a novel loss term to balance turnover regularisation against increased systemic risk from high correlation to the overall market. Using futures data, we show that DIN models outperform traditional TS and CS benchmarks, are robust to a range of transaction costs and perform consistently across random seeds. To balance the general natur",
    "path": "papers/23/07/2307.05522.json",
    "total_tokens": 985,
    "translated_title": "深度分支网络：多资产量化策略的通用端到端框架",
    "translated_abstract": "我们引入了深度分支网络（DINs），这是一类提供端到端系统化交易策略的深度学习模型。DINs直接从每日价格回报中提取时间序列（TS）和横截面（CS）特征，从而省去了手工特征的需求，并允许模型同时从TS和CS信息中学习。DINs采用全面的数据驱动方法进行特征提取，避免了过拟合。在基于深度动量网络的先前工作基础上，DIN模型直接输出整个投资组合的优化夏普比率的头寸大小，而不是个别资产。我们提出了一种新的损失项来平衡换手率规则化与与整体市场高相关性导致的系统性风险的增加。使用期货数据，我们展示了DIN模型优于传统的TS和CS基准，对于各种交易成本具有鲁棒性，并在不同的随机种子下保持一致性。",
    "tldr": "深度分支网络是一种通用的端到端框架，可以用于多资产量化策略。它通过直接提取时间序列和横截面特征，避免手工特征的需求，并通过输出整个投资组合的优化夏普比率的头寸大小来优化交易策略。在实验中表现出了优于传统基准的鲁棒性和一致性。",
    "en_tdlr": "Deep Inception Networks (DINs) are a general end-to-end framework for multi-asset quantitative strategies. They extract features directly from price returns, avoiding the need for handcrafted features, and optimize trading strategies by outputting position sizes that optimize the Sharpe ratio for the entire portfolio. Experimental results show that DINs outperform traditional benchmarks in terms of robustness and consistency."
}