{
    "title": "HistRED: A Historical Document-Level Relation Extraction Dataset. (arXiv:2307.04285v1 [cs.CL])",
    "abstract": "Despite the extensive applications of relation extraction (RE) tasks in various domains, little has been explored in the historical context, which contains promising data across hundreds and thousands of years. To promote the historical RE research, we present HistRED constructed from Yeonhaengnok. Yeonhaengnok is a collection of records originally written in Hanja, the classical Chinese writing, which has later been translated into Korean. HistRED provides bilingual annotations such that RE can be performed on Korean and Hanja texts. In addition, HistRED supports various self-contained subtexts with different lengths, from a sentence level to a document level, supporting diverse context settings for researchers to evaluate the robustness of their RE models. To demonstrate the usefulness of our dataset, we propose a bilingual RE model that leverages both Korean and Hanja contexts to predict relations between entities. Our model outperforms monolingual baselines on HistRED, showing that",
    "link": "http://arxiv.org/abs/2307.04285",
    "context": "Title: HistRED: A Historical Document-Level Relation Extraction Dataset. (arXiv:2307.04285v1 [cs.CL])\nAbstract: Despite the extensive applications of relation extraction (RE) tasks in various domains, little has been explored in the historical context, which contains promising data across hundreds and thousands of years. To promote the historical RE research, we present HistRED constructed from Yeonhaengnok. Yeonhaengnok is a collection of records originally written in Hanja, the classical Chinese writing, which has later been translated into Korean. HistRED provides bilingual annotations such that RE can be performed on Korean and Hanja texts. In addition, HistRED supports various self-contained subtexts with different lengths, from a sentence level to a document level, supporting diverse context settings for researchers to evaluate the robustness of their RE models. To demonstrate the usefulness of our dataset, we propose a bilingual RE model that leverages both Korean and Hanja contexts to predict relations between entities. Our model outperforms monolingual baselines on HistRED, showing that",
    "path": "papers/23/07/2307.04285.json",
    "total_tokens": 834,
    "translated_title": "HistRED：一个历史文档级别的关系抽取数据集",
    "translated_abstract": "尽管关系抽取（RE）任务在各个领域有广泛的应用，但在历史背景下的研究还很少。为了推动历史RE研究，我们从《延行錄》构建了HistRED。《延行錄》是最初用汉字写成的记录，后来被翻译成韩文。HistRED提供了双语标注，可以对韩文和汉字文本进行RE。此外，HistRED支持不同长度的自包含子文本，从句子级别到文档级别，为研究人员提供了多样的上下文设置来评估其RE模型的鲁棒性。为了展示我们数据集的有用性，我们提出了一个双语RE模型，利用韩文和汉字上下文来预测实体之间的关系。我们的模型在HistRED上表现优于单语基线模型，显示出其优势。",
    "tldr": "HistRED是一个历史文档级别的关系抽取数据集，提供双语标注，支持不同长度的子文本，并且我们的双语模型在该数据集上表现出色。",
    "en_tdlr": "HistRED is a historical document-level relation extraction dataset with bilingual annotations, supporting various subtexts of different lengths, and our bilingual model performs well on this dataset."
}