{
    "title": "A Bayesian Programming Approach to Car-following Model Calibration and Validation using Limited Data. (arXiv:2307.10437v1 [cs.LG])",
    "abstract": "Traffic simulation software is used by transportation researchers and engineers to design and evaluate changes to roadways. These simulators are driven by models of microscopic driver behavior from which macroscopic measures like flow and congestion can be derived. Many models are designed for a subset of possible traffic scenarios and roadway configurations, while others have no explicit constraints on their application. Work zones (WZs) are one scenario for which no model to date has reproduced realistic driving behavior. This makes it difficult to optimize for safety and other metrics when designing a WZ. The Federal Highway Administration commissioned the USDOT Volpe Center to develop a car-following (CF) model for use in microscopic simulators that can capture and reproduce driver behavior accurately within and outside of WZs. Volpe also performed a naturalistic driving study to collect telematics data from vehicles driven on roads with WZs for use in model calibration. During mod",
    "link": "http://arxiv.org/abs/2307.10437",
    "context": "Title: A Bayesian Programming Approach to Car-following Model Calibration and Validation using Limited Data. (arXiv:2307.10437v1 [cs.LG])\nAbstract: Traffic simulation software is used by transportation researchers and engineers to design and evaluate changes to roadways. These simulators are driven by models of microscopic driver behavior from which macroscopic measures like flow and congestion can be derived. Many models are designed for a subset of possible traffic scenarios and roadway configurations, while others have no explicit constraints on their application. Work zones (WZs) are one scenario for which no model to date has reproduced realistic driving behavior. This makes it difficult to optimize for safety and other metrics when designing a WZ. The Federal Highway Administration commissioned the USDOT Volpe Center to develop a car-following (CF) model for use in microscopic simulators that can capture and reproduce driver behavior accurately within and outside of WZs. Volpe also performed a naturalistic driving study to collect telematics data from vehicles driven on roads with WZs for use in model calibration. During mod",
    "path": "papers/23/07/2307.10437.json",
    "total_tokens": 872,
    "translated_title": "用有限数据进行贝叶斯编程方法的车辆跟随模型校准和验证",
    "translated_abstract": "交通仿真软件被交通研究人员和工程师用于设计和评估道路变化。这些仿真器由微观驾驶行为模型驱动，可以从中推导出宏观测量如流量和拥堵。许多模型设计用于可能的交通场景和道路配置的子集，而其他模型在应用上没有明确的限制。工作区（WZs）是一种到目前为止没有模型能够复现真实驾驶行为的场景。这使得在设计WZ时优化安全和其他指标变得困难。美国联邦公路管理局委托USDOT Volpe中心开发一种微观仿真器中能够准确捕捉和复制WZ内外的驾驶行为的车辆跟随（CF）模型。Volpe还进行了一项自然驾驶研究，收集了在具有WZ的道路上驾驶的车辆的遥测数据，用于模型校准。",
    "tldr": "这项研究提出了一种贝叶斯编程方法，用于校准和验证车辆跟随模型，以捕捉和复制工作区内外的驾驶行为。"
}