{
    "title": "Hypergraph Isomorphism Computation. (arXiv:2307.14394v1 [cs.DS])",
    "abstract": "The isomorphism problem is a fundamental problem in network analysis, which involves capturing both low-order and high-order structural information. In terms of extracting low-order structural information, graph isomorphism algorithms analyze the structural equivalence to reduce the solver space dimension, which demonstrates its power in many applications, such as protein design, chemical pathways, and community detection. For the more commonly occurring high-order relationships in real-life scenarios, the problem of hypergraph isomorphism, which effectively captures these high-order structural relationships, cannot be straightforwardly addressed using graph isomorphism methods. Besides, the existing hypergraph kernel methods may suffer from high memory consumption or inaccurate sub-structure identification, thus yielding sub-optimal performance. In this paper, to address the abovementioned problems, we first propose the hypergraph Weisfiler-Lehman test algorithm for the hypergraph iso",
    "link": "http://arxiv.org/abs/2307.14394",
    "context": "Title: Hypergraph Isomorphism Computation. (arXiv:2307.14394v1 [cs.DS])\nAbstract: The isomorphism problem is a fundamental problem in network analysis, which involves capturing both low-order and high-order structural information. In terms of extracting low-order structural information, graph isomorphism algorithms analyze the structural equivalence to reduce the solver space dimension, which demonstrates its power in many applications, such as protein design, chemical pathways, and community detection. For the more commonly occurring high-order relationships in real-life scenarios, the problem of hypergraph isomorphism, which effectively captures these high-order structural relationships, cannot be straightforwardly addressed using graph isomorphism methods. Besides, the existing hypergraph kernel methods may suffer from high memory consumption or inaccurate sub-structure identification, thus yielding sub-optimal performance. In this paper, to address the abovementioned problems, we first propose the hypergraph Weisfiler-Lehman test algorithm for the hypergraph iso",
    "path": "papers/23/07/2307.14394.json",
    "total_tokens": 768,
    "translated_title": "Hypergraph同构计算",
    "translated_abstract": "同构问题是网络分析中的一个基本问题，它涉及捕捉低阶和高阶结构信息。从提取低阶结构信息的角度来看，图同构算法分析结构等价性以降低求解空间的维度，在蛋白质设计、化学途径和社区检测等许多应用中展示其强大的能力。对于现实场景中更常见的高阶关系，使用图同构方法无法直接解决超图同构问题，后者有效地捕捉这些高阶结构关系。此外，现有的超图内核方法可能存在内存消耗高或子结构识别不准确等问题，因此性能不佳。本文针对上述问题，首先提出了超图Weisfiler-Lehman测试算法用于超图同构的解决。",
    "tldr": "本文提出了用于超图同构计算的超图Weisfiler-Lehman测试算法以解决现有方法无法直接处理的高阶结构关系问题。",
    "en_tdlr": "This paper proposes the hypergraph Weisfiler-Lehman test algorithm for hypergraph isomorphism computation to address the problem of handling high-order structural relationships that cannot be directly solved by existing methods."
}