{
    "title": "Learning locally dominant force balances in active particle systems. (arXiv:2307.14970v1 [cond-mat.soft])",
    "abstract": "We use a combination of unsupervised clustering and sparsity-promoting inference algorithms to learn locally dominant force balances that explain macroscopic pattern formation in self-organized active particle systems. The self-organized emergence of macroscopic patterns from microscopic interactions between self-propelled particles can be widely observed nature. Although hydrodynamic theories help us better understand the physical basis of this phenomenon, identifying a sufficient set of local interactions that shape, regulate, and sustain self-organized structures in active particle systems remains challenging. We investigate a classic hydrodynamic model of self-propelled particles that produces a wide variety of patterns, like asters and moving density bands. Our data-driven analysis shows that propagating bands are formed by local alignment interactions driven by density gradients, while steady-state asters are shaped by a mechanism of splay-induced negative compressibility arising",
    "link": "http://arxiv.org/abs/2307.14970",
    "context": "Title: Learning locally dominant force balances in active particle systems. (arXiv:2307.14970v1 [cond-mat.soft])\nAbstract: We use a combination of unsupervised clustering and sparsity-promoting inference algorithms to learn locally dominant force balances that explain macroscopic pattern formation in self-organized active particle systems. The self-organized emergence of macroscopic patterns from microscopic interactions between self-propelled particles can be widely observed nature. Although hydrodynamic theories help us better understand the physical basis of this phenomenon, identifying a sufficient set of local interactions that shape, regulate, and sustain self-organized structures in active particle systems remains challenging. We investigate a classic hydrodynamic model of self-propelled particles that produces a wide variety of patterns, like asters and moving density bands. Our data-driven analysis shows that propagating bands are formed by local alignment interactions driven by density gradients, while steady-state asters are shaped by a mechanism of splay-induced negative compressibility arising",
    "path": "papers/23/07/2307.14970.json",
    "total_tokens": 965,
    "translated_title": "学习自组织活动粒子系统中局部主导力平衡",
    "translated_abstract": "我们使用无监督聚类和稀疏推理算法的组合来学习解释自组织活动粒子系统中宏观模式形成的局部主导力平衡。自组织活动粒子系统中的宏观模式来自于自驱动粒子之间的微观相互作用，是一种广泛观察到的自然现象。尽管流体动力学理论帮助我们更好地理解这一现象的物理基础，但是在活动粒子系统中，识别出塑造、调节和维持自组织结构的局部相互作用的足够集合仍然具有挑战性。我们研究了一个经典的自驱动粒子流体动力学模型，它产生了各种各样的模式，如星环和移动密度带。我们的数据驱动分析显示，传播带是由密度梯度驱动的局部对齐相互作用形成的，而稳态星环是由一种扭曲引起的负压缩性机制塑造的。",
    "tldr": "通过无监督聚类和稀疏推理算法，我们学习了自组织活动粒子系统中解释宏观模式形成的局部主导力平衡。分析结果表明，传播带是由密度梯度驱动的局部对齐相互作用形成的，而稳态星环是由扭曲引起的负压缩性机制塑造的。"
}