{
    "title": "Ultrasound Image Reconstruction with Denoising Diffusion Restoration Models. (arXiv:2307.15990v1 [cs.CV])",
    "abstract": "Ultrasound image reconstruction can be approximately cast as a linear inverse problem that has traditionally been solved with penalized optimization using the $l_1$ or $l_2$ norm, or wavelet-based terms. However, such regularization functions often struggle to balance the sparsity and the smoothness. A promising alternative is using learned priors to make the prior knowledge closer to reality. In this paper, we rely on learned priors under the framework of Denoising Diffusion Restoration Models (DDRM), initially conceived for restoration tasks with natural images. We propose and test two adaptions of DDRM to ultrasound inverse problem models, DRUS and WDRUS. Our experiments on synthetic and PICMUS data show that from a single plane wave our method can achieve image quality comparable to or better than DAS and state-of-the-art methods. The code is available at: https://github.com/Yuxin-Zhang-Jasmine/DRUS-v1.",
    "link": "http://arxiv.org/abs/2307.15990",
    "context": "Title: Ultrasound Image Reconstruction with Denoising Diffusion Restoration Models. (arXiv:2307.15990v1 [cs.CV])\nAbstract: Ultrasound image reconstruction can be approximately cast as a linear inverse problem that has traditionally been solved with penalized optimization using the $l_1$ or $l_2$ norm, or wavelet-based terms. However, such regularization functions often struggle to balance the sparsity and the smoothness. A promising alternative is using learned priors to make the prior knowledge closer to reality. In this paper, we rely on learned priors under the framework of Denoising Diffusion Restoration Models (DDRM), initially conceived for restoration tasks with natural images. We propose and test two adaptions of DDRM to ultrasound inverse problem models, DRUS and WDRUS. Our experiments on synthetic and PICMUS data show that from a single plane wave our method can achieve image quality comparable to or better than DAS and state-of-the-art methods. The code is available at: https://github.com/Yuxin-Zhang-Jasmine/DRUS-v1.",
    "path": "papers/23/07/2307.15990.json",
    "total_tokens": 894,
    "translated_title": "利用去噪扩散重建模型进行超声图像重建",
    "translated_abstract": "超声图像重建可以近似看作是一个线性逆问题，传统上通过使用$l_1$或$l_2$范数或基于小波的项进行惩罚优化来解决。然而，这种正则化函数往往难以平衡稀疏性和平滑性。一种有前景的替代方法是使用学习先验使先前的知识更接近实际情况。在本文中，我们依靠学习先验的框架中的去噪扩散恢复模型(DDRM)对超声逆问题模型进行了两种改进，即DRUS和WDRUS。我们在合成和PICMUS数据上的实验表明，我们的方法从单个平面波中可以实现与DAS和最先进方法相媲美甚至更好的图像质量。代码可在以下链接获取: https://github.com/Yuxin-Zhang-Jasmine/DRUS-v1.",
    "tldr": "本论文提出了一种利用去噪扩散恢复模型进行超声图像重建的方法，并在合成和PICMUS数据上进行了实验验证。实验结果显示，该方法可以从单个平面波中实现与DAS和最先进方法相媲美甚至更好的图像质量。"
}