{
    "title": "GPT4 is Slightly Helpful for Peer-Review Assistance: A Pilot Study. (arXiv:2307.05492v1 [cs.HC])",
    "abstract": "In this pilot study, we investigate the use of GPT4 to assist in the peer-review process. Our key hypothesis was that GPT-generated reviews could achieve comparable helpfulness to human reviewers. By comparing reviews generated by both human reviewers and GPT models for academic papers submitted to a major machine learning conference, we provide initial evidence that artificial intelligence can contribute effectively to the peer-review process. We also perform robustness experiments with inserted errors to understand which parts of the paper the model tends to focus on. Our findings open new avenues for leveraging machine learning tools to address resource constraints in peer review. The results also shed light on potential enhancements to the review process and lay the groundwork for further research on scaling oversight in a domain where human-feedback is increasingly a scarce resource.",
    "link": "http://arxiv.org/abs/2307.05492",
    "context": "Title: GPT4 is Slightly Helpful for Peer-Review Assistance: A Pilot Study. (arXiv:2307.05492v1 [cs.HC])\nAbstract: In this pilot study, we investigate the use of GPT4 to assist in the peer-review process. Our key hypothesis was that GPT-generated reviews could achieve comparable helpfulness to human reviewers. By comparing reviews generated by both human reviewers and GPT models for academic papers submitted to a major machine learning conference, we provide initial evidence that artificial intelligence can contribute effectively to the peer-review process. We also perform robustness experiments with inserted errors to understand which parts of the paper the model tends to focus on. Our findings open new avenues for leveraging machine learning tools to address resource constraints in peer review. The results also shed light on potential enhancements to the review process and lay the groundwork for further research on scaling oversight in a domain where human-feedback is increasingly a scarce resource.",
    "path": "papers/23/07/2307.05492.json",
    "total_tokens": 818,
    "translated_title": "GPT4对同行评审存在一定帮助：一项实验性研究。",
    "translated_abstract": "在这项实验性研究中，我们调查了GPT4在同行评审过程中的应用。我们的主要假设是，通过与人类审稿人生成的评论进行比较，GPT所生成的评论可以达到相似的有用性。通过比较在一个重要的机器学习会议上提交的学术论文的人类审稿人和GPT模型生成的评论，我们提供了初步证据，表明人工智能可以有效地为同行评审过程做出贡献。我们还进行了对插入了错误的鲁棒性实验，以了解模型更倾向于关注论文的哪些部分。我们的研究结果为利用机器学习工具解决同行评审资源限制开辟了新途径。该结果还为改进评审过程提供了启示，并为在人类反馈资源稀缺的领域中进一步研究扩大监督打下了基础。",
    "tldr": "通过比较GPT和人类审稿人生成的评论，我们发现GPT在同行评审中具有一定的帮助性，为解决同行评审资源限制提供了新途径。"
}