{
    "title": "Turning Whisper into Real-Time Transcription System. (arXiv:2307.14743v1 [cs.CL])",
    "abstract": "Whisper is one of the recent state-of-the-art multilingual speech recognition and translation models, however, it is not designed for real time transcription. In this paper, we build on top of Whisper and create Whisper-Streaming, an implementation of real-time speech transcription and translation of Whisper-like models. Whisper-Streaming uses local agreement policy with self-adaptive latency to enable streaming transcription. We show that Whisper-Streaming achieves high quality and 3.3 seconds latency on unsegmented long-form speech transcription test set, and we demonstrate its robustness and practical usability as a component in live transcription service at a multilingual conference.",
    "link": "http://arxiv.org/abs/2307.14743",
    "context": "Title: Turning Whisper into Real-Time Transcription System. (arXiv:2307.14743v1 [cs.CL])\nAbstract: Whisper is one of the recent state-of-the-art multilingual speech recognition and translation models, however, it is not designed for real time transcription. In this paper, we build on top of Whisper and create Whisper-Streaming, an implementation of real-time speech transcription and translation of Whisper-like models. Whisper-Streaming uses local agreement policy with self-adaptive latency to enable streaming transcription. We show that Whisper-Streaming achieves high quality and 3.3 seconds latency on unsegmented long-form speech transcription test set, and we demonstrate its robustness and practical usability as a component in live transcription service at a multilingual conference.",
    "path": "papers/23/07/2307.14743.json",
    "total_tokens": 783,
    "translated_title": "将Whisper转化为实时转录系统",
    "translated_abstract": "Whisper是最近的一种最先进的多语种语音识别和翻译模型，然而，它并不适用于实时转录。在本文中，我们在Whisper的基础上构建了Whisper-Streaming，这是一个实时语音转录和翻译实现Whisper类模型的系统。Whisper-Streaming使用本地协议策略和自适应延迟，实现了流式转录。我们展示了Whisper-Streaming在未分割的长篇演讲转录测试集上达到了高质量和3.3秒的延迟，并展示了它作为一个多语种会议实时转录服务组件的鲁棒性和实用性。",
    "tldr": "本文介绍了一个基于Whisper的实时语音转录和翻译系统Whisper-Streaming，通过使用本地协议策略和自适应延迟，实现了流式转录。实验结果表明Whisper-Streaming在未分割的长篇演讲转录测试集上具有高质量和低延迟，并且在实际多语种会议中的应用也具有鲁棒性和实用性。",
    "en_tdlr": "This paper presents Whisper-Streaming, a real-time speech transcription and translation system based on Whisper. By using local agreement policy and self-adaptive latency, Whisper-Streaming achieves high quality and low latency on unsegmented long-form speech transcription and shows robustness and practical usability in live multilingual conferences."
}