{
    "title": "Predictive Maintenance of Armoured Vehicles using Machine Learning Approaches. (arXiv:2307.14453v1 [cs.LG])",
    "abstract": "Armoured vehicles are specialized and complex pieces of machinery designed to operate in high-stress environments, often in combat or tactical situations. This study proposes a predictive maintenance-based ensemble system that aids in predicting potential maintenance needs based on sensor data collected from these vehicles. The proposed model's architecture involves various models such as Light Gradient Boosting, Random Forest, Decision Tree, Extra Tree Classifier and Gradient Boosting to predict the maintenance requirements of the vehicles accurately. In addition, K-fold cross validation, along with TOPSIS analysis, is employed to evaluate the proposed ensemble model's stability. The results indicate that the proposed system achieves an accuracy of 98.93%, precision of 99.80% and recall of 99.03%. The algorithm can effectively predict maintenance needs, thereby reducing vehicle downtime and improving operational efficiency. Through comparisons between various algorithms and the sugges",
    "link": "http://arxiv.org/abs/2307.14453",
    "context": "Title: Predictive Maintenance of Armoured Vehicles using Machine Learning Approaches. (arXiv:2307.14453v1 [cs.LG])\nAbstract: Armoured vehicles are specialized and complex pieces of machinery designed to operate in high-stress environments, often in combat or tactical situations. This study proposes a predictive maintenance-based ensemble system that aids in predicting potential maintenance needs based on sensor data collected from these vehicles. The proposed model's architecture involves various models such as Light Gradient Boosting, Random Forest, Decision Tree, Extra Tree Classifier and Gradient Boosting to predict the maintenance requirements of the vehicles accurately. In addition, K-fold cross validation, along with TOPSIS analysis, is employed to evaluate the proposed ensemble model's stability. The results indicate that the proposed system achieves an accuracy of 98.93%, precision of 99.80% and recall of 99.03%. The algorithm can effectively predict maintenance needs, thereby reducing vehicle downtime and improving operational efficiency. Through comparisons between various algorithms and the sugges",
    "path": "papers/23/07/2307.14453.json",
    "total_tokens": 901,
    "translated_title": "使用机器学习方法进行装甲车辆的预测性维护",
    "translated_abstract": "装甲车辆是专业和复杂的机械设备，设计用于在高应力环境中运行，常常用于战斗或战术环境。本研究提出了一种基于预测性维护的集成系统，通过从这些车辆收集的传感器数据来预测潜在的维护需求。该模型的架构涉及各种模型，如轻梯度提升、随机森林、决策树、极端树分类器和梯度提升，以准确预测车辆的维护需求。此外，使用K折交叉验证和TOPSIS分析来评估提出的集成模型的稳定性。结果表明，该系统的准确率为98.93%，精确度为99.80%，召回率为99.03%。该算法可以有效预测维护需求，从而减少车辆停机时间，提高运营效率。通过对比各种算法和建议的比较",
    "tldr": "本研究提出了一种基于机器学习的预测性维护系统，通过分析传感器数据预测装甲车辆的维护需求，结果表明系统具有高准确率和稳定性。这种方法有助于减少车辆停机时间，提高运营效率。",
    "en_tdlr": "This study proposes a machine learning-based predictive maintenance system that accurately predicts the maintenance needs of armored vehicles using sensor data, achieving high accuracy and stability. This approach helps to reduce vehicle downtime and improve operational efficiency."
}