{
    "title": "StyleGAN2-based Out-of-Distribution Detection for Medical Imaging. (arXiv:2307.10193v1 [eess.IV])",
    "abstract": "One barrier to the clinical deployment of deep learning-based models is the presence of images at runtime that lie far outside the training distribution of a given model. We aim to detect these out-of-distribution (OOD) images with a generative adversarial network (GAN). Our training dataset was comprised of 3,234 liver-containing computed tomography (CT) scans from 456 patients. Our OOD test data consisted of CT images of the brain, head and neck, lung, cervix, and abnormal livers. A StyleGAN2-ADA architecture was employed to model the training distribution. Images were reconstructed using backpropagation. Reconstructions were evaluated using the Wasserstein distance, mean squared error, and the structural similarity index measure. OOD detection was evaluated with the area under the receiver operating characteristic curve (AUROC). Our paradigm distinguished between liver and non-liver CT with greater than 90% AUROC. It was also completely unable to reconstruct liver artifacts, such as",
    "link": "http://arxiv.org/abs/2307.10193",
    "context": "Title: StyleGAN2-based Out-of-Distribution Detection for Medical Imaging. (arXiv:2307.10193v1 [eess.IV])\nAbstract: One barrier to the clinical deployment of deep learning-based models is the presence of images at runtime that lie far outside the training distribution of a given model. We aim to detect these out-of-distribution (OOD) images with a generative adversarial network (GAN). Our training dataset was comprised of 3,234 liver-containing computed tomography (CT) scans from 456 patients. Our OOD test data consisted of CT images of the brain, head and neck, lung, cervix, and abnormal livers. A StyleGAN2-ADA architecture was employed to model the training distribution. Images were reconstructed using backpropagation. Reconstructions were evaluated using the Wasserstein distance, mean squared error, and the structural similarity index measure. OOD detection was evaluated with the area under the receiver operating characteristic curve (AUROC). Our paradigm distinguished between liver and non-liver CT with greater than 90% AUROC. It was also completely unable to reconstruct liver artifacts, such as",
    "path": "papers/23/07/2307.10193.json",
    "total_tokens": 868,
    "translated_title": "基于StyleGAN2的医学成像领域的异常检测",
    "translated_abstract": "深度学习模型在临床上的应用面临一个障碍，即运行时存在着训练分布之外的图像。本文旨在利用生成对抗网络（GAN）来检测这些训练分布之外的图像。我们的训练数据集包含来自456名患者的3234个含有肝脏的计算机断层扫描（CT）图像。我们的训练分布采用了StyleGAN2-ADA架构进行建模。使用反向传播重构图像，并利用Wasserstein距离、均方差和结构相似性指数来评估重构结果。异常检测效果通过接收者操作特征曲线下面积（AUROC）进行评估。我们的方法在肝脏和非肝脏CT之间实现了超过90%的AUROC，同时无法完全重构肝脏的异常部分，例如...（文章截断）",
    "tldr": "本文利用StyleGAN2的生成对抗网络（GAN）进行医学图像的异常检测，通过反向传播重构图像并利用评估指标进行异常检测，实现了超过90%的准确率。",
    "en_tdlr": "This paper utilizes StyleGAN2-based generative adversarial network (GAN) for out-of-distribution detection in medical imaging, achieving over 90% accuracy by reconstructing images using backpropagation and evaluating with specific metrics."
}