{
    "title": "Node-weighted Graph Convolutional Network for Depression Detection in Transcribed Clinical Interviews",
    "abstract": "arXiv:2307.00920v2 Announce Type: replace-cross  Abstract: We propose a simple approach for weighting self-connecting edges in a Graph Convolutional Network (GCN) and show its impact on depression detection from transcribed clinical interviews. To this end, we use a GCN for modeling non-consecutive and long-distance semantics to classify the transcriptions into depressed or control subjects. The proposed method aims to mitigate the limiting assumptions of locality and the equal importance of self-connections vs. edges to neighboring nodes in GCNs, while preserving attractive features such as low computational cost, data agnostic, and interpretability capabilities. We perform an exhaustive evaluation in two benchmark datasets. Results show that our approach consistently outperforms the vanilla GCN model as well as previously reported results, achieving an F1=0.84 on both datasets. Finally, a qualitative analysis illustrates the interpretability capabilities of the proposed approach and ",
    "link": "https://arxiv.org/abs/2307.00920",
    "context": "Title: Node-weighted Graph Convolutional Network for Depression Detection in Transcribed Clinical Interviews\nAbstract: arXiv:2307.00920v2 Announce Type: replace-cross  Abstract: We propose a simple approach for weighting self-connecting edges in a Graph Convolutional Network (GCN) and show its impact on depression detection from transcribed clinical interviews. To this end, we use a GCN for modeling non-consecutive and long-distance semantics to classify the transcriptions into depressed or control subjects. The proposed method aims to mitigate the limiting assumptions of locality and the equal importance of self-connections vs. edges to neighboring nodes in GCNs, while preserving attractive features such as low computational cost, data agnostic, and interpretability capabilities. We perform an exhaustive evaluation in two benchmark datasets. Results show that our approach consistently outperforms the vanilla GCN model as well as previously reported results, achieving an F1=0.84 on both datasets. Finally, a qualitative analysis illustrates the interpretability capabilities of the proposed approach and ",
    "path": "papers/23/07/2307.00920.json",
    "total_tokens": 843,
    "translated_title": "基于节点加权的图卷积网络用于分析转录的临床面谈中的抑郁症检测",
    "translated_abstract": "我们提出了一种简单的方法，用于在图卷积网络（GCN）中加权自连接边，并展示其对从转录的临床面谈中进行抑郁症检测的影响。为此，我们使用GCN来对转录进行建模，以将其分类为抑郁症患者或对照组。所提出的方法旨在减轻GCN中对局部性和自连接与相邻节点边的等重要性的限制性假设，同时保留了诸如低计算成本、数据不可知和可解释性能力等有吸引力的特征。我们在两个基准数据集上进行了详尽的评估。结果表明，我们的方法始终优于基准GCN模型以及先前报告的结果，在两个数据集上均达到了F1=0.84。最后，定性分析展示了所提出方法的可解释性能力。",
    "tldr": "提出了一种基于节点加权的图卷积网络方法，用于在临床面谈转录中检测抑郁症，相较于传统方法，在两个数据集上取得了更好的效果。",
    "en_tdlr": "Introduced a node-weighted graph convolutional network approach for depression detection in transcribed clinical interviews, which outperformed conventional methods on two datasets."
}