{
    "title": "Data-Driven Latency Probability Prediction for Wireless Networks: Focusing on Tail Probabilities. (arXiv:2307.10648v1 [cs.NI])",
    "abstract": "With the emergence of new application areas, such as cyber-physical systems and human-in-the-loop applications, there is a need to guarantee a certain level of end-to-end network latency with extremely high reliability, e.g., 99.999%. While mechanisms specified under IEEE 802.1as time-sensitive networking (TSN) can be used to achieve these requirements for switched Ethernet networks, implementing TSN mechanisms in wireless networks is challenging due to their stochastic nature. To conform the wireless link to a reliability level of 99.999%, the behavior of extremely rare outliers in the latency probability distribution, or the tail of the distribution, must be analyzed and controlled. This work proposes predicting the tail of the latency distribution using state-of-the-art data-driven approaches, such as mixture density networks (MDN) and extreme value mixture models, to estimate the likelihood of rare latencies conditioned on the network parameters, which can be used to make more info",
    "link": "http://arxiv.org/abs/2307.10648",
    "context": "Title: Data-Driven Latency Probability Prediction for Wireless Networks: Focusing on Tail Probabilities. (arXiv:2307.10648v1 [cs.NI])\nAbstract: With the emergence of new application areas, such as cyber-physical systems and human-in-the-loop applications, there is a need to guarantee a certain level of end-to-end network latency with extremely high reliability, e.g., 99.999%. While mechanisms specified under IEEE 802.1as time-sensitive networking (TSN) can be used to achieve these requirements for switched Ethernet networks, implementing TSN mechanisms in wireless networks is challenging due to their stochastic nature. To conform the wireless link to a reliability level of 99.999%, the behavior of extremely rare outliers in the latency probability distribution, or the tail of the distribution, must be analyzed and controlled. This work proposes predicting the tail of the latency distribution using state-of-the-art data-driven approaches, such as mixture density networks (MDN) and extreme value mixture models, to estimate the likelihood of rare latencies conditioned on the network parameters, which can be used to make more info",
    "path": "papers/23/07/2307.10648.json",
    "total_tokens": 914,
    "translated_title": "基于数据驱动的无线网络延迟概率预测：重点关注尾部概率",
    "translated_abstract": "随着新的应用领域的出现，例如网络物理系统和人机协作应用，需要以极高的可靠性保证一定水平的端到端网络延迟，例如99.999%。虽然IEEE 802.1as时敏网络（TSN）规范中的机制可以用来实现以太网交换网络的这些要求，但在无线网络中实现TSN机制具有挑战性，因为其具有随机性质。为了将无线链路合规到99.999%的可靠度水平，必须分析和控制延迟概率分布中极为罕见的异常值，即分布的尾部。本研究提出使用最先进的数据驱动方法，如混合密度网络（MDN）和极值混合模型，对延迟分布的尾部进行预测，以估计基于网络参数的罕见延迟的可能性，从而可以制定更加精确的网络资源配置策略。",
    "tldr": "本研究提出了基于数据驱动方法的无线网络延迟概率预测，重点关注尾部概率分布。该方法可用于准确估计罕见延迟的可能性，并制定网络资源配置策略。",
    "en_tdlr": "This paper proposes a data-driven approach for predicting wireless network latency probabilities, focusing on the tail probabilities. The approach utilizes state-of-the-art methods such as mixture density networks and extreme value mixture models to estimate the likelihood of rare latencies, which can be used to optimize network resource allocation."
}