{
    "title": "Robots That Ask For Help: Uncertainty Alignment for Large Language Model Planners. (arXiv:2307.01928v2 [cs.RO] UPDATED)",
    "abstract": "Large language models (LLMs) exhibit a wide range of promising capabilities -- from step-by-step planning to commonsense reasoning -- that may provide utility for robots, but remain prone to confidently hallucinated predictions. In this work, we present KnowNo, which is a framework for measuring and aligning the uncertainty of LLM-based planners such that they know when they don't know and ask for help when needed. KnowNo builds on the theory of conformal prediction to provide statistical guarantees on task completion while minimizing human help in complex multi-step planning settings. Experiments across a variety of simulated and real robot setups that involve tasks with different modes of ambiguity (e.g., from spatial to numeric uncertainties, from human preferences to Winograd schemas) show that KnowNo performs favorably over modern baselines (which may involve ensembles or extensive prompt tuning) in terms of improving efficiency and autonomy, while providing formal assurances. Kno",
    "link": "http://arxiv.org/abs/2307.01928",
    "context": "Title: Robots That Ask For Help: Uncertainty Alignment for Large Language Model Planners. (arXiv:2307.01928v2 [cs.RO] UPDATED)\nAbstract: Large language models (LLMs) exhibit a wide range of promising capabilities -- from step-by-step planning to commonsense reasoning -- that may provide utility for robots, but remain prone to confidently hallucinated predictions. In this work, we present KnowNo, which is a framework for measuring and aligning the uncertainty of LLM-based planners such that they know when they don't know and ask for help when needed. KnowNo builds on the theory of conformal prediction to provide statistical guarantees on task completion while minimizing human help in complex multi-step planning settings. Experiments across a variety of simulated and real robot setups that involve tasks with different modes of ambiguity (e.g., from spatial to numeric uncertainties, from human preferences to Winograd schemas) show that KnowNo performs favorably over modern baselines (which may involve ensembles or extensive prompt tuning) in terms of improving efficiency and autonomy, while providing formal assurances. Kno",
    "path": "papers/23/07/2307.01928.json",
    "total_tokens": 872,
    "translated_title": "机器人请求帮助：用于大型语言模型规划器的不确定性对齐",
    "translated_abstract": "大型语言模型（LLMs）展示了广泛的有前景的能力，从逐步规划到常识推理，这些能力可能为机器人提供效用，但仍然容易产生错误的预测。在这项工作中，我们提出了KnowNo，它是一种用于衡量和对齐基于LLM的规划器不确定性的框架，使其知道何时不知道并在需要时请求帮助。KnowNo基于符合预测理论，提供任务完成的统计保证，同时在复杂的多步规划环境中最大程度地减少人类帮助。在涉及不同模糊模式任务的各种模拟和实际机器人设置的实验中（例如从空间到数字的不确定性，从人类偏好到Winograd模式），结果表明KnowNo在提高效率和自治性方面相对于现代基线（可能涉及集合或广泛的提示调整）表现良好，同时提供正式的保证。",
    "tldr": "KnowNo is a framework that measures and aligns the uncertainty of LLM-based planners, enabling them to ask for help when they don't know. It performs favorably in improving efficiency and autonomy compared to baselines, while providing formal assurances.",
    "en_tdlr": "KnowNo is a framework that measures and aligns the uncertainty of LLM-based planners, enabling them to ask for help when they don't know. It outperforms baselines in terms of efficiency and autonomy, while providing formal assurances."
}