{
    "title": "Recognition of Mental Adjectives in An Efficient and Automatic Style. (arXiv:2307.11767v1 [cs.CL])",
    "abstract": "In recent years, commonsense reasoning has received more and more attention from academic community. We propose a new lexical inference task, Mental and Physical Classification (MPC), to handle commonsense reasoning in a reasoning graph. Mental words relate to mental activities, which fall into six categories: Emotion, Need, Perceiving, Reasoning, Planning and Personality. Physical words describe physical attributes of an object, like color, hardness, speed and malleability. A BERT model is fine-tuned for this task and active learning algorithm is adopted in the training framework to reduce the required annotation resources. The model using ENTROPY strategy achieves satisfactory accuracy and requires only about 300 labeled words. We also compare our result with SentiWordNet to check the difference between MPC and subjectivity classification task in sentiment analysis.",
    "link": "http://arxiv.org/abs/2307.11767",
    "context": "Title: Recognition of Mental Adjectives in An Efficient and Automatic Style. (arXiv:2307.11767v1 [cs.CL])\nAbstract: In recent years, commonsense reasoning has received more and more attention from academic community. We propose a new lexical inference task, Mental and Physical Classification (MPC), to handle commonsense reasoning in a reasoning graph. Mental words relate to mental activities, which fall into six categories: Emotion, Need, Perceiving, Reasoning, Planning and Personality. Physical words describe physical attributes of an object, like color, hardness, speed and malleability. A BERT model is fine-tuned for this task and active learning algorithm is adopted in the training framework to reduce the required annotation resources. The model using ENTROPY strategy achieves satisfactory accuracy and requires only about 300 labeled words. We also compare our result with SentiWordNet to check the difference between MPC and subjectivity classification task in sentiment analysis.",
    "path": "papers/23/07/2307.11767.json",
    "total_tokens": 848,
    "translated_title": "在高效自动化的风格中识别心理形容词",
    "translated_abstract": "最近几年，常识推理在学术界越来越受到关注。我们提出了一个新的词汇推理任务，心理与物理分类（MPC），以处理常识推理。心理词语与心理活动相关，可分为六个类别：情感、需求、感知、推理、规划和个性。物理词语描述物体的物理属性，如颜色、硬度、速度和可塑性。我们使用BERT模型对这个任务进行了微调，并在训练框架中采用主动学习算法来减少所需的注释资源。使用ENTROPY策略的模型达到了令人满意的准确性，仅需要约300个标注的词语。我们还将结果与SentiWordNet进行了比较，以检查MPC与情感分析中的主观性分类任务之间的差异。",
    "tldr": "本论文提出了一个新的词汇推理任务MPC，通过微调BERT模型和采用主动学习算法，在简化标注资源的同时达到了令人满意的准确性。通过与SentiWordNet的比较，还发现了MPC与情感分析中的主观性分类任务的差异。",
    "en_tdlr": "This paper proposes a new lexical inference task MPC and achieves satisfactory accuracy by fine-tuning BERT model and adopting active learning algorithm, while reducing the required annotation resources. The difference between MPC and subjectivity classification task in sentiment analysis is also explored by comparing with SentiWordNet."
}