{
    "title": "Multi-gauge Hydrological Variational Data Assimilation: Regionalization Learning with Spatial Gradients using Multilayer Perceptron and Bayesian-Guided Multivariate Regression. (arXiv:2307.02497v1 [cs.LG])",
    "abstract": "Tackling the difficult problem of estimating spatially distributed hydrological parameters, especially for floods on ungauged watercourses, this contribution presents a novel seamless regionalization technique for learning complex regional transfer functions designed for high-resolution hydrological models. The transfer functions rely on: (i) a multilayer perceptron enabling a seamless flow of gradient computation to employ machine learning optimization algorithms, or (ii) a multivariate regression mapping optimized by variational data assimilation algorithms and guided by Bayesian estimation, addressing the equifinality issue of feasible solutions. The approach involves incorporating the inferable regionalization mappings into a differentiable hydrological model and optimizing a cost function computed on multi-gauge data with accurate adjoint-based spatially distributed gradients.",
    "link": "http://arxiv.org/abs/2307.02497",
    "context": "Title: Multi-gauge Hydrological Variational Data Assimilation: Regionalization Learning with Spatial Gradients using Multilayer Perceptron and Bayesian-Guided Multivariate Regression. (arXiv:2307.02497v1 [cs.LG])\nAbstract: Tackling the difficult problem of estimating spatially distributed hydrological parameters, especially for floods on ungauged watercourses, this contribution presents a novel seamless regionalization technique for learning complex regional transfer functions designed for high-resolution hydrological models. The transfer functions rely on: (i) a multilayer perceptron enabling a seamless flow of gradient computation to employ machine learning optimization algorithms, or (ii) a multivariate regression mapping optimized by variational data assimilation algorithms and guided by Bayesian estimation, addressing the equifinality issue of feasible solutions. The approach involves incorporating the inferable regionalization mappings into a differentiable hydrological model and optimizing a cost function computed on multi-gauge data with accurate adjoint-based spatially distributed gradients.",
    "path": "papers/23/07/2307.02497.json",
    "total_tokens": 875,
    "translated_title": "多尺度水文变分数据同化：使用多层感知器和贝叶斯引导的多元回归进行区域化学习",
    "translated_abstract": "本研究针对估计空间分布的水文参数，特别是针对未测量水道上的洪水问题，提出了一个新颖的无缝区域化技术，用于学习高分辨率水文模型的复杂区域转移函数。该转移函数依赖于：（i）一个多层感知器，通过无缝的梯度计算流动来使用机器学习优化算法，或者（ii）一个多元回归，由变分数据同化算法优化并由贝叶斯估计引导，解决可行解的等似性问题。该方法涉及将可推断的区域化映射纳入到可微分的水文模型中，并利用精确的基于伴随的空间分布梯度计算的多测量数据上计算的代价函数进行优化。",
    "tldr": "本研究提出了一种新的水文数据同化方法，通过使用多层感知器和贝叶斯引导的多元回归，实现了无缝区域化学习。这种方法可以准确估计空间分布的水文参数，并且解决了可行解的等似性问题。",
    "en_tdlr": "This study presents a new hydrological data assimilation method that combines multilayer perceptron and Bayesian-guided multivariate regression to achieve seamless regionalization learning. It accurately estimates spatially distributed hydrological parameters and addresses the issue of equifinality in feasible solutions."
}