{
    "title": "Learning Large Margin Sparse Embeddings for Open Set Medical Diagnosis. (arXiv:2307.04541v2 [cs.CV] UPDATED)",
    "abstract": "Fueled by deep learning, computer-aided diagnosis achieves huge advances. However, out of controlled lab environments, algorithms could face multiple challenges. Open set recognition (OSR), as an important one, states that categories unseen in training could appear in testing. In medical fields, it could derive from incompletely collected training datasets and the constantly emerging new or rare diseases. OSR requires an algorithm to not only correctly classify known classes, but also recognize unknown classes and forward them to experts for further diagnosis. To tackle OSR, we assume that known classes could densely occupy small parts of the embedding space and the remaining sparse regions could be recognized as unknowns. Following it, we propose Open Margin Cosine Loss (OMCL) unifying two mechanisms. The former, called Margin Loss with Adaptive Scale (MLAS), introduces angular margin for reinforcing intra-class compactness and inter-class separability, together with an adaptive scali",
    "link": "http://arxiv.org/abs/2307.04541",
    "context": "Title: Learning Large Margin Sparse Embeddings for Open Set Medical Diagnosis. (arXiv:2307.04541v2 [cs.CV] UPDATED)\nAbstract: Fueled by deep learning, computer-aided diagnosis achieves huge advances. However, out of controlled lab environments, algorithms could face multiple challenges. Open set recognition (OSR), as an important one, states that categories unseen in training could appear in testing. In medical fields, it could derive from incompletely collected training datasets and the constantly emerging new or rare diseases. OSR requires an algorithm to not only correctly classify known classes, but also recognize unknown classes and forward them to experts for further diagnosis. To tackle OSR, we assume that known classes could densely occupy small parts of the embedding space and the remaining sparse regions could be recognized as unknowns. Following it, we propose Open Margin Cosine Loss (OMCL) unifying two mechanisms. The former, called Margin Loss with Adaptive Scale (MLAS), introduces angular margin for reinforcing intra-class compactness and inter-class separability, together with an adaptive scali",
    "path": "papers/23/07/2307.04541.json",
    "total_tokens": 912,
    "translated_title": "学习用于开放式医学诊断的大边缘稀疏嵌入",
    "translated_abstract": "在深度学习的推动下，计算机辅助诊断取得了巨大的进展。然而，在非受控的实验室环境中，算法可能面临多种挑战。开放式识别(OSR)作为一个重要问题，表示在训练中未见过的类别可能出现在测试中。在医学领域，这可能是由于训练数据集的不完全收集以及不断出现的新的或罕见的疾病。OSR需要一个算法不仅能正确分类已知类别，还能识别未知类别，并将其转发给专家进行进一步的诊断。为了解决OSR问题，我们假设已知类别可能密集地占据了嵌入空间的小部分，而其余的稀疏区域可能被识别为未知类别。基于此，我们提出了统一两种机制的开放边缘余弦损失(OMCL)。前者被称为具有自适应尺度的边缘损失(MLAS)，引入了角度边缘以增强类内紧密度和类间可分离性，并结合了自适应尺度。",
    "tldr": "本研究提出了一种用于开放式医学诊断的大边缘稀疏嵌入方法，通过引入角度边缘和自适应尺度，使算法能够正确分类已知类别并识别未知类别，以进一步支持医学诊断。"
}