{
    "title": "Multimodal Temporal Fusion Transformers Are Good Product Demand Forecasters. (arXiv:2307.02578v1 [cs.LG])",
    "abstract": "Multimodal demand forecasting aims at predicting product demand utilizing visual, textual, and contextual information. This paper proposes a method for multimodal product demand forecasting using convolutional, graph-based, and transformer-based architectures. Traditional approaches to demand forecasting rely on historical demand, product categories, and additional contextual information such as seasonality and events. However, these approaches have several shortcomings, such as the cold start problem making it difficult to predict product demand until sufficient historical data is available for a particular product, and their inability to properly deal with category dynamics. By incorporating multimodal information, such as product images and textual descriptions, our architecture aims to address the shortcomings of traditional approaches and outperform them. The experiments conducted on a large real-world dataset show that the proposed approach effectively predicts demand for a wide ",
    "link": "http://arxiv.org/abs/2307.02578",
    "context": "Title: Multimodal Temporal Fusion Transformers Are Good Product Demand Forecasters. (arXiv:2307.02578v1 [cs.LG])\nAbstract: Multimodal demand forecasting aims at predicting product demand utilizing visual, textual, and contextual information. This paper proposes a method for multimodal product demand forecasting using convolutional, graph-based, and transformer-based architectures. Traditional approaches to demand forecasting rely on historical demand, product categories, and additional contextual information such as seasonality and events. However, these approaches have several shortcomings, such as the cold start problem making it difficult to predict product demand until sufficient historical data is available for a particular product, and their inability to properly deal with category dynamics. By incorporating multimodal information, such as product images and textual descriptions, our architecture aims to address the shortcomings of traditional approaches and outperform them. The experiments conducted on a large real-world dataset show that the proposed approach effectively predicts demand for a wide ",
    "path": "papers/23/07/2307.02578.json",
    "total_tokens": 821,
    "translated_title": "多模态时间融合变压器是良好的产品需求预测器",
    "translated_abstract": "多模态需求预测旨在利用视觉、文本和上下文信息来预测产品需求。本文提出了一种使用卷积、基于图和基于变压器的体系结构进行多模态产品需求预测的方法。传统的需求预测方法依赖于历史需求、产品类别和其他上下文信息，如季节性和事件。然而，这些方法存在一些缺点，例如冷启动问题，使得在为特定产品提供足够的历史数据之前很难预测产品需求，以及它们无法妥善处理类别动态性。通过融合产品图像和文本描述等多模态信息，我们的体系结构旨在解决传统方法的缺点并超越它们。在一个大型实际数据集上进行的实验表明，所提出的方法有效地预测了各种产品的需求。",
    "tldr": "本文提出了一种使用多模态信息进行产品需求预测的方法，通过融合图像和文本描述等多种信息，有效地解决了传统方法的缺点，并在大型实际数据集上取得了较好的预测效果。",
    "en_tdlr": "This paper proposes a method for multimodal product demand forecasting by incorporating multiple types of information, effectively addressing the limitations of traditional approaches and achieving good prediction results on a large real-world dataset."
}