{
    "title": "Asymptotics for the Generalized Autoregressive Conditional Duration Model. (arXiv:2307.01779v1 [econ.EM])",
    "abstract": "Engle and Russell (1998, Econometrica, 66:1127--1162) apply results from the GARCH literature to prove consistency and asymptotic normality of the (exponential) QMLE for the generalized autoregressive conditional duration (ACD) model, the so-called ACD(1,1), under the assumption of strict stationarity and ergodicity. The GARCH results, however, do not account for the fact that the number of durations over a given observation period is random. Thus, in contrast with Engle and Russell (1998), we show that strict stationarity and ergodicity alone are not sufficient for consistency and asymptotic normality, and provide additional sufficient conditions to account for the random number of durations. In particular, we argue that the durations need to satisfy the stronger requirement that they have finite mean.",
    "link": "http://arxiv.org/abs/2307.01779",
    "context": "Title: Asymptotics for the Generalized Autoregressive Conditional Duration Model. (arXiv:2307.01779v1 [econ.EM])\nAbstract: Engle and Russell (1998, Econometrica, 66:1127--1162) apply results from the GARCH literature to prove consistency and asymptotic normality of the (exponential) QMLE for the generalized autoregressive conditional duration (ACD) model, the so-called ACD(1,1), under the assumption of strict stationarity and ergodicity. The GARCH results, however, do not account for the fact that the number of durations over a given observation period is random. Thus, in contrast with Engle and Russell (1998), we show that strict stationarity and ergodicity alone are not sufficient for consistency and asymptotic normality, and provide additional sufficient conditions to account for the random number of durations. In particular, we argue that the durations need to satisfy the stronger requirement that they have finite mean.",
    "path": "papers/23/07/2307.01779.json",
    "total_tokens": 795,
    "translated_title": "广义自回归条件持续时间模型的渐近性质",
    "translated_abstract": "Engle和Russell (1998, Econometrica, 66:1127-1162)将GARCH文献中的结果应用到广义自回归条件持续时间（ACD）模型的(指数) QMLE的一致性和渐近正态性的证明中，也就是所谓的ACD(1,1)，在严格平稳和遍历性的假设下。然而，GARCH的结果没有考虑到给定观测期内持续时间数量是随机的这一事实。因此，与Engle和Russell (1998)相反，我们展示了仅仅严格平稳和遍历性是不足以保证一致性和渐近正态性的，并提供了额外的充分条件来考虑持续时间的随机数量。特别是，我们认为持续时间需要满足有限均值的更强要求。",
    "tldr": "本文通过引入持续时间的随机数量和有限均值的要求，对广义自回归条件持续时间模型的渐近性质进行了分析。",
    "en_tdlr": "This paper analyzes the asymptotics of the generalized autoregressive conditional duration (ACD) model by introducing the random number of durations and the requirement of finite mean."
}