{
    "title": "Scenario Sampling for Large Supermodular Games. (arXiv:2307.11857v1 [econ.EM])",
    "abstract": "This paper introduces a simulation algorithm for evaluating the log-likelihood function of a large supermodular binary-action game. Covered examples include (certain types of) peer effect, technology adoption, strategic network formation, and multi-market entry games. More generally, the algorithm facilitates simulated maximum likelihood (SML) estimation of games with large numbers of players, $T$, and/or many binary actions per player, $M$ (e.g., games with tens of thousands of strategic actions, $TM=O(10^4)$). In such cases the likelihood of the observed pure strategy combination is typically (i) very small and (ii) a $TM$-fold integral who region of integration has a complicated geometry. Direct numerical integration, as well as accept-reject Monte Carlo integration, are computationally impractical in such settings. In contrast, we introduce a novel importance sampling algorithm which allows for accurate likelihood simulation with modest numbers of simulation draws.",
    "link": "http://arxiv.org/abs/2307.11857",
    "context": "Title: Scenario Sampling for Large Supermodular Games. (arXiv:2307.11857v1 [econ.EM])\nAbstract: This paper introduces a simulation algorithm for evaluating the log-likelihood function of a large supermodular binary-action game. Covered examples include (certain types of) peer effect, technology adoption, strategic network formation, and multi-market entry games. More generally, the algorithm facilitates simulated maximum likelihood (SML) estimation of games with large numbers of players, $T$, and/or many binary actions per player, $M$ (e.g., games with tens of thousands of strategic actions, $TM=O(10^4)$). In such cases the likelihood of the observed pure strategy combination is typically (i) very small and (ii) a $TM$-fold integral who region of integration has a complicated geometry. Direct numerical integration, as well as accept-reject Monte Carlo integration, are computationally impractical in such settings. In contrast, we introduce a novel importance sampling algorithm which allows for accurate likelihood simulation with modest numbers of simulation draws.",
    "path": "papers/23/07/2307.11857.json",
    "total_tokens": 945,
    "translated_title": "大规模超模型博弈的场景抽样",
    "translated_abstract": "本文介绍了一种用于评估大规模超模型二进制行动博弈的对数似然函数的模拟算法。涵盖的例子包括（某些类型的）同侪影响、技术采用、战略网络形成和多市场进入游戏。更一般地，该算法促进了对具有大量玩家、$T$和/或每个玩家有许多二进制行动、$M$的游戏进行模拟最大似然（SML）估计（例如，具有成千上万个战略行动、$TM=O(10^4)$的游戏）。在这种情况下，观察到的纯策略组合的似然性通常（i）非常小，（ii）一个$TM$倍的积分，其积分区域具有复杂的几何形状。在这样的设置中，直接数值积分和接受-拒绝蒙特卡洛积分在计算上是不实际的。相比之下，我们引入了一种新颖的重要抽样算法，允许使用适量的模拟抽样进行准确的似然模拟。",
    "tldr": "本文提出了一种用于评估大规模超模型博弈的对数似然函数的模拟算法，并引入了一种新颖的重要抽样算法，允许使用适量的模拟抽样进行准确的似然模拟。",
    "en_tdlr": "This paper introduces a simulation algorithm for evaluating the log-likelihood function of a large supermodular binary-action game. It also presents a novel importance sampling algorithm that allows for accurate likelihood simulation with modest numbers of simulation draws."
}