{
    "title": "Exploring MLOps Dynamics: An Experimental Analysis in a Real-World Machine Learning Project. (arXiv:2307.13473v1 [cs.SE])",
    "abstract": "This article presents an experiment focused on optimizing the MLOps (Machine Learning Operations) process, a crucial aspect of efficiently implementing machine learning projects. The objective is to identify patterns and insights to enhance the MLOps workflow, considering its iterative and interdependent nature in real-world model development scenarios.  The experiment involves a comprehensive MLOps workflow, covering essential phases like problem definition, data acquisition, data preparation, model development, model deployment, monitoring, management, scalability, and governance and compliance. Practical tips and recommendations are derived from the results, emphasizing proactive planning and continuous improvement for the MLOps workflow.  The experimental investigation was strategically integrated within a real-world ML project which followed essential phases of the MLOps process in a production environment, handling large-scale structured data. A systematic tracking approach was e",
    "link": "http://arxiv.org/abs/2307.13473",
    "context": "Title: Exploring MLOps Dynamics: An Experimental Analysis in a Real-World Machine Learning Project. (arXiv:2307.13473v1 [cs.SE])\nAbstract: This article presents an experiment focused on optimizing the MLOps (Machine Learning Operations) process, a crucial aspect of efficiently implementing machine learning projects. The objective is to identify patterns and insights to enhance the MLOps workflow, considering its iterative and interdependent nature in real-world model development scenarios.  The experiment involves a comprehensive MLOps workflow, covering essential phases like problem definition, data acquisition, data preparation, model development, model deployment, monitoring, management, scalability, and governance and compliance. Practical tips and recommendations are derived from the results, emphasizing proactive planning and continuous improvement for the MLOps workflow.  The experimental investigation was strategically integrated within a real-world ML project which followed essential phases of the MLOps process in a production environment, handling large-scale structured data. A systematic tracking approach was e",
    "path": "papers/23/07/2307.13473.json",
    "total_tokens": 855,
    "translated_title": "探索MLOps动态: 在真实世界的机器学习项目中的实验分析",
    "translated_abstract": "本文提出了一个实验，重点是优化MLOps（机器学习运营）过程，这是高效实施机器学习项目的关键方面。目标是识别模式和见解，以提升MLOps工作流程，考虑到其在真实世界模型开发场景中的迭代和相互依赖性。实验涵盖了完整的MLOps工作流程，涵盖了问题定义、数据获取、数据准备、模型开发、模型部署、监控、管理、可扩展性以及治理和合规性等关键阶段。实验结果得出了实用的提示和建议，强调了对MLOps工作流程的积极规划和持续改进。实验通过一个真实的机器学习项目有机地集成，该项目在生产环境中按照MLOps过程的关键阶段进行操作，处理大规模结构化数据。采用了系统化的跟踪方法。",
    "tldr": "本研究在真实机器学习项目中进行了实验分析，旨在优化MLOps工作流程并提供实用的提示和建议，强调积极规划和持续改进，以增强MLOps的效率。",
    "en_tdlr": "This study conducted an experimental analysis in a real-world machine learning project to optimize the MLOps workflow and provide practical tips and recommendations for enhancing efficiency through proactive planning and continuous improvement."
}