{
    "title": "Generative convective parametrization of dry atmospheric boundary layer. (arXiv:2307.14857v1 [physics.flu-dyn])",
    "abstract": "Turbulence parametrizations will remain a necessary building block in kilometer-scale Earth system models. In convective boundary layers, where the mean vertical gradients of conserved properties such as potential temperature and moisture are approximately zero, the standard ansatz which relates turbulent fluxes to mean vertical gradients via an eddy diffusivity has to be extended by mass flux parametrizations for the typically asymmetric up- and downdrafts in the atmospheric boundary layer. In this work, we present a parametrization for a dry convective boundary layer based on a generative adversarial network. The model incorporates the physics of self-similar layer growth following from the classical mixed layer theory by Deardorff. This enhances the training data base of the generative machine learning algorithm and thus significantly improves the predicted statistics of the synthetically generated turbulence fields at different heights inside the boundary layer. The algorithm train",
    "link": "http://arxiv.org/abs/2307.14857",
    "context": "Title: Generative convective parametrization of dry atmospheric boundary layer. (arXiv:2307.14857v1 [physics.flu-dyn])\nAbstract: Turbulence parametrizations will remain a necessary building block in kilometer-scale Earth system models. In convective boundary layers, where the mean vertical gradients of conserved properties such as potential temperature and moisture are approximately zero, the standard ansatz which relates turbulent fluxes to mean vertical gradients via an eddy diffusivity has to be extended by mass flux parametrizations for the typically asymmetric up- and downdrafts in the atmospheric boundary layer. In this work, we present a parametrization for a dry convective boundary layer based on a generative adversarial network. The model incorporates the physics of self-similar layer growth following from the classical mixed layer theory by Deardorff. This enhances the training data base of the generative machine learning algorithm and thus significantly improves the predicted statistics of the synthetically generated turbulence fields at different heights inside the boundary layer. The algorithm train",
    "path": "papers/23/07/2307.14857.json",
    "total_tokens": 889,
    "translated_title": "干燥大气边界层的生成对流参数化",
    "translated_abstract": "湍流参数化在公里尺度地球系统模型中仍然是必要的基础。在对流边界层中，平均垂直梯度的保守性质，如潜在温度和湿度，近似为零，标准的模型将湍流通量与平均垂直梯度之间的涡扩散系数延展为用质量通量参数化的模型， 用于大气边界层中的通常非对称的上升气流和下沉气流。在这项工作中，我们提出了基于生成对抗网络的干燥对流边界层参数化方案。该模型结合了Deardorff的经典混合层理论中的自相似层生长物理学，提高了生成机器学习算法的训练数据集，并显著改善了边界层内不同高度产生的合成湍流场的统计预测性能。",
    "tldr": "该研究提出了一种基于生成对抗网络的干燥对流边界层参数化方案，通过结合经典混合层理论中的自相似层生长物理学，显著改善了合成湍流场的统计预测性能。",
    "en_tdlr": "This study proposes a generative adversarial network-based parametrization for the dry convective boundary layer, which significantly improves the statistical prediction performance of the synthesized turbulent fields by incorporating the physics of self-similar layer growth from classical mixed layer theory."
}