{
    "title": "Non-Concave Utility Maximization with Transaction Costs. (arXiv:2307.02178v1 [q-fin.MF])",
    "abstract": "This paper studies a finite-horizon portfolio selection problem with non-concave terminal utility and proportional transaction costs. The commonly used concavification principle for terminal value is no longer valid here, and we establish a proper theoretical characterization of this problem. We first give the asymptotic terminal behavior of the value function, which implies any transaction close to maturity only provides a marginal contribution to the utility. After that, the theoretical foundation is established in terms of a novel definition of the viscosity solution incorporating our asymptotic terminal condition. Via numerical analyses, we find that the introduction of transaction costs into non-concave utility maximization problems can prevent the portfolio from unbounded leverage and make a large short position in stock optimal despite a positive risk premium and symmetric transaction costs.",
    "link": "http://arxiv.org/abs/2307.02178",
    "context": "Title: Non-Concave Utility Maximization with Transaction Costs. (arXiv:2307.02178v1 [q-fin.MF])\nAbstract: This paper studies a finite-horizon portfolio selection problem with non-concave terminal utility and proportional transaction costs. The commonly used concavification principle for terminal value is no longer valid here, and we establish a proper theoretical characterization of this problem. We first give the asymptotic terminal behavior of the value function, which implies any transaction close to maturity only provides a marginal contribution to the utility. After that, the theoretical foundation is established in terms of a novel definition of the viscosity solution incorporating our asymptotic terminal condition. Via numerical analyses, we find that the introduction of transaction costs into non-concave utility maximization problems can prevent the portfolio from unbounded leverage and make a large short position in stock optimal despite a positive risk premium and symmetric transaction costs.",
    "path": "papers/23/07/2307.02178.json",
    "total_tokens": 833,
    "translated_title": "具有交易成本的非凹效用最大化",
    "translated_abstract": "本文研究了具有非凹终值效用和比例交易成本的有限时间段内的投资组合选择问题。终值的常用凹化原理在此处不再有效，我们建立了对这个问题的适当的理论描述。我们首先给出了价值函数的渐近终值行为，这意味着任何接近到期的交易只为效用提供了边际贡献。在此之后，通过一个将我们的渐近终值条件合并的新定义的粘性解，我们建立了该问题的理论基础。通过数值分析，我们发现将交易成本引入非凹效用最大化问题可以防止投资组合过度杠杆化，并使大量的空头持仓在股票市场上成为最优决策，即使存在正的风险溢价和对称的交易成本。",
    "tldr": "本文研究了具有非凹终值效用和交易成本的有限时间段内的投资组合选择问题，提出了一种对此问题的适当的理论描述，并发现引入交易成本可以防止投资组合过度杠杆化，并使大量的空头持仓在股票市场上成为最优决策。"
}