{
    "title": "OpenGDA: Graph Domain Adaptation Benchmark for Cross-network Learning. (arXiv:2307.11341v1 [cs.AI])",
    "abstract": "Graph domain adaptation models are widely adopted in cross-network learning tasks, with the aim of transferring labeling or structural knowledge. Currently, there mainly exist two limitations in evaluating graph domain adaptation models. On one side, they are primarily tested for the specific cross-network node classification task, leaving tasks at edge-level and graph-level largely under-explored. Moreover, they are primarily tested in limited scenarios, such as social networks or citation networks, lacking validation of model's capability in richer scenarios. As comprehensively assessing models could enhance model practicality in real-world applications, we propose a benchmark, known as OpenGDA. It provides abundant pre-processed and unified datasets for different types of tasks (node, edge, graph). They originate from diverse scenarios, covering web information systems, urban systems and natural systems. Furthermore, it integrates state-of-the-art models with standardized and end-to",
    "link": "http://arxiv.org/abs/2307.11341",
    "context": "Title: OpenGDA: Graph Domain Adaptation Benchmark for Cross-network Learning. (arXiv:2307.11341v1 [cs.AI])\nAbstract: Graph domain adaptation models are widely adopted in cross-network learning tasks, with the aim of transferring labeling or structural knowledge. Currently, there mainly exist two limitations in evaluating graph domain adaptation models. On one side, they are primarily tested for the specific cross-network node classification task, leaving tasks at edge-level and graph-level largely under-explored. Moreover, they are primarily tested in limited scenarios, such as social networks or citation networks, lacking validation of model's capability in richer scenarios. As comprehensively assessing models could enhance model practicality in real-world applications, we propose a benchmark, known as OpenGDA. It provides abundant pre-processed and unified datasets for different types of tasks (node, edge, graph). They originate from diverse scenarios, covering web information systems, urban systems and natural systems. Furthermore, it integrates state-of-the-art models with standardized and end-to",
    "path": "papers/23/07/2307.11341.json",
    "total_tokens": 859,
    "translated_title": "OpenGDA:用于跨网络学习的图领域自适应基准",
    "translated_abstract": "图领域自适应模型在跨网络学习任务中被广泛采用，旨在传递标签或结构知识。目前，在评估图领域自适应模型时存在两个主要限制。一方面，它们主要用于特定的跨网络节点分类任务，对于边级和图级任务的讨论相对较少。另一方面，它们主要在有限的场景中进行测试，如社交网络或引用网络，缺乏在更丰富场景中测试模型能力的验证。为了全面评估模型，提高模型在实际应用中的实用性，我们提出了一个名为OpenGDA的基准。它提供了丰富的预处理和统一的数据集，用于不同类型的任务（节点，边，图）。这些数据集来自于不同的场景，涵盖了网络信息系统，城市系统和自然系统。此外，它还集成了最先进的模型，并提供了标准化的和最终的模型评估方法。",
    "tldr": "OpenGDA是一个用于跨网络学习的图领域自适应基准，提供了丰富的数据集和评估方法以全面评估模型在不同任务和场景中的性能。"
}