{
    "title": "On the Utility Gain of Iterative Bayesian Update for Locally Differentially Private Mechanisms. (arXiv:2307.07744v1 [cs.CR])",
    "abstract": "This paper investigates the utility gain of using Iterative Bayesian Update (IBU) for private discrete distribution estimation using data obfuscated with Locally Differentially Private (LDP) mechanisms. We compare the performance of IBU to Matrix Inversion (MI), a standard estimation technique, for seven LDP mechanisms designed for one-time data collection and for other seven LDP mechanisms designed for multiple data collections (e.g., RAPPOR). To broaden the scope of our study, we also varied the utility metric, the number of users n, the domain size k, and the privacy parameter {\\epsilon}, using both synthetic and real-world data. Our results suggest that IBU can be a useful post-processing tool for improving the utility of LDP mechanisms in different scenarios without any additional privacy cost. For instance, our experiments show that IBU can provide better utility than MI, especially in high privacy regimes (i.e., when {\\epsilon} is small). Our paper provides insights for practiti",
    "link": "http://arxiv.org/abs/2307.07744",
    "context": "Title: On the Utility Gain of Iterative Bayesian Update for Locally Differentially Private Mechanisms. (arXiv:2307.07744v1 [cs.CR])\nAbstract: This paper investigates the utility gain of using Iterative Bayesian Update (IBU) for private discrete distribution estimation using data obfuscated with Locally Differentially Private (LDP) mechanisms. We compare the performance of IBU to Matrix Inversion (MI), a standard estimation technique, for seven LDP mechanisms designed for one-time data collection and for other seven LDP mechanisms designed for multiple data collections (e.g., RAPPOR). To broaden the scope of our study, we also varied the utility metric, the number of users n, the domain size k, and the privacy parameter {\\epsilon}, using both synthetic and real-world data. Our results suggest that IBU can be a useful post-processing tool for improving the utility of LDP mechanisms in different scenarios without any additional privacy cost. For instance, our experiments show that IBU can provide better utility than MI, especially in high privacy regimes (i.e., when {\\epsilon} is small). Our paper provides insights for practiti",
    "path": "papers/23/07/2307.07744.json",
    "total_tokens": 948,
    "translated_title": "关于使用迭代贝叶斯更新对局部差分隐私机制的效用提升的研究",
    "translated_abstract": "本文研究了使用迭代贝叶斯更新（IBU）对使用局部差分隐私（LDP）机制模糊化的数据进行私有离散分布估计的效用提升。我们将IBU的性能与矩阵求逆（MI）进行比较，MI是一种标准的估计技术，用于七种用于一次数据收集的LDP机制和其他七种用于多次数据收集（例如RAPPOR）的LDP机制。为了扩大研究范围，我们还变化了效用度量标准、用户数n、域大小k和隐私参数ε，使用了合成数据和真实世界数据。我们的结果表明，IBU可以成为一种有用的后处理工具，可以在不增加额外隐私成本的情况下提高LDP机制的效用。例如，我们的实验表明，在高隐私情况下（即ε很小）IBU可以提供比MI更好的效用。我们的论文为实践者提供了一些见解。",
    "tldr": "本文研究了使用迭代贝叶斯更新对局部差分隐私机制进行数据估计时的效用提升，结果表明在不增加额外隐私成本的情况下，IBU可以提供比传统矩阵求逆更好的效果。",
    "en_tdlr": "This paper investigates the utility gain of using Iterative Bayesian Update (IBU) for private discrete distribution estimation using data obfuscated with Locally Differentially Private (LDP) mechanisms. Results suggest that IBU can provide better utility than traditional matrix inversion without adding additional privacy cost."
}