{
    "title": "Can LLMs be Good Financial Advisors?: An Initial Study in Personal Decision Making for Optimized Outcomes. (arXiv:2307.07422v1 [cs.CL])",
    "abstract": "Increasingly powerful Large Language Model (LLM) based chatbots, like ChatGPT and Bard, are becoming available to users that have the potential to revolutionize the quality of decision-making achieved by the public. In this context, we set out to investigate how such systems perform in the personal finance domain, where financial inclusion has been an overarching stated aim of banks for decades. We asked 13 questions representing banking products in personal finance: bank account, credit card, and certificate of deposits and their inter-product interactions, and decisions related to high-value purchases, payment of bank dues, and investment advice, and in different dialects and languages (English, African American Vernacular English, and Telugu). We find that although the outputs of the chatbots are fluent and plausible, there are still critical gaps in providing accurate and reliable financial information using LLM-based chatbots.",
    "link": "http://arxiv.org/abs/2307.07422",
    "context": "Title: Can LLMs be Good Financial Advisors?: An Initial Study in Personal Decision Making for Optimized Outcomes. (arXiv:2307.07422v1 [cs.CL])\nAbstract: Increasingly powerful Large Language Model (LLM) based chatbots, like ChatGPT and Bard, are becoming available to users that have the potential to revolutionize the quality of decision-making achieved by the public. In this context, we set out to investigate how such systems perform in the personal finance domain, where financial inclusion has been an overarching stated aim of banks for decades. We asked 13 questions representing banking products in personal finance: bank account, credit card, and certificate of deposits and their inter-product interactions, and decisions related to high-value purchases, payment of bank dues, and investment advice, and in different dialects and languages (English, African American Vernacular English, and Telugu). We find that although the outputs of the chatbots are fluent and plausible, there are still critical gaps in providing accurate and reliable financial information using LLM-based chatbots.",
    "path": "papers/23/07/2307.07422.json",
    "total_tokens": 889,
    "translated_title": "LLM能成为良好的财务顾问吗？：关于个人决策优化结果的初步研究",
    "translated_abstract": "越来越强大的基于大语言模型（LLM）的聊天机器人，如ChatGPT和Bard，正成为用户可用的，有潜力改变公众决策质量的工具。在这个背景下，我们旨在调查这些系统在个人财务领域的表现，而金融包容一直是银行的主要目标。我们提出了13个问题，代表个人财务中的银行产品，包括银行账户、信用卡、存款证书及其产品间的相互作用，以及与高价购买、支付银行费用和投资建议相关的决策，还包括不同的方言和语言（英语、非正式美国英语和泰卢固语）。我们发现，尽管聊天机器人的输出流利而且合理，但在使用基于LLM的聊天机器人提供准确可靠的财务信息方面仍存在重大差距。",
    "tldr": "这项研究调查了基于大语言模型的聊天机器人在个人财务领域的表现，发现虽然输出流利合理，但在提供准确可靠的财务信息方面仍存在重大差距。"
}