{
    "title": "Conformal Group Recommender System. (arXiv:2307.12034v1 [cs.IR])",
    "abstract": "Group recommender systems (GRS) are critical in discovering relevant items from a near-infinite inventory based on group preferences rather than individual preferences, like recommending a movie, restaurant, or tourist destination to a group of individuals. The traditional models of group recommendation are designed to act like a black box with a strict focus on improving recommendation accuracy, and most often, they place the onus on the users to interpret recommendations. In recent years, the focus of Recommender Systems (RS) research has shifted away from merely improving recommendation accuracy towards value additions such as confidence and explanation. In this work, we propose a conformal prediction framework that provides a measure of confidence with prediction in conjunction with a group recommender system to augment the system-generated plain recommendations. In the context of group recommender systems, we propose various nonconformity measures that play a vital role in the eff",
    "link": "http://arxiv.org/abs/2307.12034",
    "context": "Title: Conformal Group Recommender System. (arXiv:2307.12034v1 [cs.IR])\nAbstract: Group recommender systems (GRS) are critical in discovering relevant items from a near-infinite inventory based on group preferences rather than individual preferences, like recommending a movie, restaurant, or tourist destination to a group of individuals. The traditional models of group recommendation are designed to act like a black box with a strict focus on improving recommendation accuracy, and most often, they place the onus on the users to interpret recommendations. In recent years, the focus of Recommender Systems (RS) research has shifted away from merely improving recommendation accuracy towards value additions such as confidence and explanation. In this work, we propose a conformal prediction framework that provides a measure of confidence with prediction in conjunction with a group recommender system to augment the system-generated plain recommendations. In the context of group recommender systems, we propose various nonconformity measures that play a vital role in the eff",
    "path": "papers/23/07/2307.12034.json",
    "total_tokens": 810,
    "translated_title": "符合性群体推荐系统",
    "translated_abstract": "群体推荐系统（GRS）在基于群体偏好而不是个人偏好的情况下，从无尽的库存中发现相关物品至关重要，例如向一群人推荐电影、餐馆或旅游目的地。传统的群体推荐模型被设计为像一个黑盒子，严格关注提高推荐准确性，并且大多数情况下，它们将解释推荐的责任放在用户身上。近年来，推荐系统（RS）研究的重点已从仅仅提高推荐准确性转向增加自信度和解释等价值。在这项工作中，我们提出了一个符合性预测框架，它在群体推荐系统中提供了与预测一起的置信度度量，以增强系统生成的简单推荐。在群体推荐系统的背景下，我们提出了多种非符合度度量，它在提高推荐效果方面起着关键作用。",
    "tldr": "本文提出了一种符合性群体推荐系统，通过提供置信度度量和解释来增强系统生成的推荐结果。",
    "en_tdlr": "This paper proposes a conformal group recommender system that enhances system-generated recommendations by providing a measure of confidence and explanation."
}