{
    "title": "Separated RoadTopoFormer. (arXiv:2307.01557v1 [cs.CV])",
    "abstract": "Understanding driving scenarios is crucial to realizing autonomous driving. Previous works such as map learning and BEV lane detection neglect the connection relationship between lane instances, and traffic elements detection tasks usually neglect the relationship with lane lines. To address these issues, the task is presented which includes 4 sub-tasks, the detection of traffic elements, the detection of lane centerlines, reasoning connection relationships among lanes, and reasoning assignment relationships between lanes and traffic elements. We present Separated RoadTopoFormer to tackle the issues, which is an end-to-end framework that detects lane centerline and traffic elements with reasoning relationships among them. We optimize each module separately to prevent interaction with each other and aggregate them together with few finetunes. For two detection heads, we adopted a DETR-like architecture to detect objects, and for the relationship head, we concat two instance features fro",
    "link": "http://arxiv.org/abs/2307.01557",
    "context": "Title: Separated RoadTopoFormer. (arXiv:2307.01557v1 [cs.CV])\nAbstract: Understanding driving scenarios is crucial to realizing autonomous driving. Previous works such as map learning and BEV lane detection neglect the connection relationship between lane instances, and traffic elements detection tasks usually neglect the relationship with lane lines. To address these issues, the task is presented which includes 4 sub-tasks, the detection of traffic elements, the detection of lane centerlines, reasoning connection relationships among lanes, and reasoning assignment relationships between lanes and traffic elements. We present Separated RoadTopoFormer to tackle the issues, which is an end-to-end framework that detects lane centerline and traffic elements with reasoning relationships among them. We optimize each module separately to prevent interaction with each other and aggregate them together with few finetunes. For two detection heads, we adopted a DETR-like architecture to detect objects, and for the relationship head, we concat two instance features fro",
    "path": "papers/23/07/2307.01557.json",
    "total_tokens": 812,
    "translated_title": "分离的RoadTopoFormer",
    "translated_abstract": "理解驾驶场景对实现自动驾驶至关重要。以往的工作如地图学习和BEV车道检测忽视了车道实例之间的连接关系，交通元素检测任务通常忽视与车道线的关系。为了解决这些问题，提出了一个任务，包括4个子任务，即交通元素检测、车道中心线检测、推理车道之间的连接关系和推理车道与交通元素之间的关联关系。我们提出了分离的RoadTopoFormer来解决这些问题，这是一个端到端的框架，可以检测到车道中心线和交通元素，并推理它们之间的关系。我们分别优化每个模块，以防止它们之间的相互影响，并通过少量的微调将它们聚合在一起。对于两个检测头，我们采用了类似DETR的架构来检测物体，对于关系头，我们将两个实例特征连接在一起。",
    "tldr": "这篇论文提出了一种分离的RoadTopoFormer框架，用于检测车道中心线和交通元素，并推理它们之间的关系。",
    "en_tdlr": "This paper presents a separated RoadTopoFormer framework for detecting lane centerlines and traffic elements with reasoning relationships among them."
}