{
    "title": "IAdet: Simplest human-in-the-loop object detection. (arXiv:2307.01582v1 [cs.CV])",
    "abstract": "This work proposes a strategy for training models while annotating data named Intelligent Annotation (IA). IA involves three modules: (1) assisted data annotation, (2) background model training, and (3) active selection of the next datapoints. Under this framework, we open-source the IAdet tool, which is specific for single-class object detection. Additionally, we devise a method for automatically evaluating such a human-in-the-loop system. For the PASCAL VOC dataset, the IAdet tool reduces the database annotation time by $25\\%$ while providing a trained model for free. These results are obtained for a deliberately very simple IAdet design. As a consequence, IAdet is susceptible to multiple easy improvements, paving the way for powerful human-in-the-loop object detection systems.",
    "link": "http://arxiv.org/abs/2307.01582",
    "context": "Title: IAdet: Simplest human-in-the-loop object detection. (arXiv:2307.01582v1 [cs.CV])\nAbstract: This work proposes a strategy for training models while annotating data named Intelligent Annotation (IA). IA involves three modules: (1) assisted data annotation, (2) background model training, and (3) active selection of the next datapoints. Under this framework, we open-source the IAdet tool, which is specific for single-class object detection. Additionally, we devise a method for automatically evaluating such a human-in-the-loop system. For the PASCAL VOC dataset, the IAdet tool reduces the database annotation time by $25\\%$ while providing a trained model for free. These results are obtained for a deliberately very simple IAdet design. As a consequence, IAdet is susceptible to multiple easy improvements, paving the way for powerful human-in-the-loop object detection systems.",
    "path": "papers/23/07/2307.01582.json",
    "total_tokens": 855,
    "translated_title": "IAdet：最简单的人机交互目标检测",
    "translated_abstract": "本文提出了一种在标注数据的同时训练模型的策略，称为智能注释（IA）。IA包括三个模块：（1）辅助数据标注，（2）背景模型训练和（3）主动选择下一个数据点。在这个框架下，我们开源了特定于单类目标检测的IAdet工具。此外，我们设计了一种自动评估这种人机交互系统的方法。对于PASCAL VOC数据集，IAdet工具在减少数据库标注时间的同时提供了一个训练好的模型。这些结果是基于一个故意设计非常简单的IAdet系统。因此，IAdet易于改进，为强大的人机交互目标检测系统铺平了道路。",
    "tldr": "本文提出了一种最简单的人机交互目标检测方法，其中的关键创新是智能注释（IA）策略和开源的IAdet工具。对于PASCAL VOC数据集，IAdet工具能够减少数据库标注时间，并提供免费训练好的模型，为强大的人机交互目标检测系统提供了改进的可能。",
    "en_tdlr": "This paper proposes the simplest human-in-the-loop object detection method, with the key innovations being the Intelligent Annotation (IA) strategy and the open-source IAdet tool. For the PASCAL VOC dataset, the IAdet tool reduces the annotation time and provides a free trained model, paving the way for improved human-in-the-loop object detection systems."
}