{
    "title": "Model Reporting for Certifiable AI: A Proposal from Merging EU Regulation into AI Development. (arXiv:2307.11525v1 [cs.AI])",
    "abstract": "Despite large progress in Explainable and Safe AI, practitioners suffer from a lack of regulation and standards for AI safety. In this work we merge recent regulation efforts by the European Union and first proposals for AI guidelines with recent trends in research: data and model cards. We propose the use of standardized cards to document AI applications throughout the development process. Our main contribution is the introduction of use-case and operation cards, along with updates for data and model cards to cope with regulatory requirements. We reference both recent research as well as the source of the regulation in our cards and provide references to additional support material and toolboxes whenever possible. The goal is to design cards that help practitioners develop safe AI systems throughout the development process, while enabling efficient third-party auditing of AI applications, being easy to understand, and building trust in the system. Our work incorporates insights from i",
    "link": "http://arxiv.org/abs/2307.11525",
    "context": "Title: Model Reporting for Certifiable AI: A Proposal from Merging EU Regulation into AI Development. (arXiv:2307.11525v1 [cs.AI])\nAbstract: Despite large progress in Explainable and Safe AI, practitioners suffer from a lack of regulation and standards for AI safety. In this work we merge recent regulation efforts by the European Union and first proposals for AI guidelines with recent trends in research: data and model cards. We propose the use of standardized cards to document AI applications throughout the development process. Our main contribution is the introduction of use-case and operation cards, along with updates for data and model cards to cope with regulatory requirements. We reference both recent research as well as the source of the regulation in our cards and provide references to additional support material and toolboxes whenever possible. The goal is to design cards that help practitioners develop safe AI systems throughout the development process, while enabling efficient third-party auditing of AI applications, being easy to understand, and building trust in the system. Our work incorporates insights from i",
    "path": "papers/23/07/2307.11525.json",
    "total_tokens": 945,
    "translated_title": "可证明人工智能模型报告：将欧盟法规融入人工智能开发的建议",
    "translated_abstract": "尽管在可解释和安全的人工智能方面取得了很大进展，从业者仍然面临缺乏人工智能安全法规和标准的问题。在这项工作中，我们将欧盟最新的法规努力与最新的人工智能指南提出的建议与研究的最新趋势相结合：数据卡和模型卡。我们建议使用标准化的卡片来记录人工智能应用程序的开发过程。我们的主要贡献是引入了用例和操作卡，以及对数据和模型卡的更新以满足监管要求。我们在卡片中引用了最新的研究以及法规的来源，并尽可能提供了额外支持材料和工具箱的参考。我们的目标是设计出能够帮助从业者在开发过程中开发安全的人工智能系统的卡片，同时使第三方审计人工智能应用程序更加高效，易于理解，并建立对系统的信任。我们的工作结合了来自…（部分内容省略）",
    "tldr": "提出了结合欧盟法规与最新研究趋势的可证明人工智能模型报告的建议，通过使用标准化的卡片记录AI应用的开发过程，并引入用例和操作卡以满足监管要求，旨在开发安全可信的AI系统并支持第三方审计。"
}