{
    "title": "Towards the Better Ranking Consistency: A Multi-task Learning Framework for Early Stage Ads Ranking. (arXiv:2307.11096v1 [cs.IR])",
    "abstract": "Dividing ads ranking system into retrieval, early, and final stages is a common practice in large scale ads recommendation to balance the efficiency and accuracy. The early stage ranking often uses efficient models to generate candidates out of a set of retrieved ads. The candidates are then fed into a more computationally intensive but accurate final stage ranking system to produce the final ads recommendation. As the early and final stage ranking use different features and model architectures because of system constraints, a serious ranking consistency issue arises where the early stage has a low ads recall, i.e., top ads in the final stage are ranked low in the early stage. In order to pass better ads from the early to the final stage ranking, we propose a multi-task learning framework for early stage ranking to capture multiple final stage ranking components (i.e. ads clicks and ads quality events) and their task relations. With our multi-task learning framework, we can not only ac",
    "link": "http://arxiv.org/abs/2307.11096",
    "context": "Title: Towards the Better Ranking Consistency: A Multi-task Learning Framework for Early Stage Ads Ranking. (arXiv:2307.11096v1 [cs.IR])\nAbstract: Dividing ads ranking system into retrieval, early, and final stages is a common practice in large scale ads recommendation to balance the efficiency and accuracy. The early stage ranking often uses efficient models to generate candidates out of a set of retrieved ads. The candidates are then fed into a more computationally intensive but accurate final stage ranking system to produce the final ads recommendation. As the early and final stage ranking use different features and model architectures because of system constraints, a serious ranking consistency issue arises where the early stage has a low ads recall, i.e., top ads in the final stage are ranked low in the early stage. In order to pass better ads from the early to the final stage ranking, we propose a multi-task learning framework for early stage ranking to capture multiple final stage ranking components (i.e. ads clicks and ads quality events) and their task relations. With our multi-task learning framework, we can not only ac",
    "path": "papers/23/07/2307.11096.json",
    "total_tokens": 874,
    "translated_title": "为了更好的排序一致性：一种面向早期广告排序的多任务学习框架",
    "translated_abstract": "在大规模广告推荐中，将广告排序系统分为检索、早期和最终阶段是一种常见做法，以平衡效率和准确性。早期阶段的排序通常使用高效模型从一组检索到的广告中生成候选集。然后，将候选集馈送到计算密集且准确的最终阶段排序系统，生成最终的广告推荐。由于系统限制，早期和最终阶段的排序使用不同的特征和模型架构，导致了严重的排序一致性问题，即早期阶段的广告召回率较低，即最终阶段中排名靠前的广告在早期阶段排名较低。为了将更好的广告从早期阶段传递到最终阶段的排名，我们提出了一种面向早期阶段排序的多任务学习框架，以捕获多个最终阶段排序组件（即广告点击和广告质量事件）及其任务关系。",
    "tldr": "本论文提出了一种多任务学习框架，用于早期广告排序，以解决早期阶段和最终阶段排序之间的一致性问题。",
    "en_tdlr": "This paper proposes a multi-task learning framework for early stage ads ranking to address the ranking consistency issue between early and final stages."
}