{
    "title": "JAZZVAR: A Dataset of Variations found within Solo Piano Performances of Jazz Standards for Music Overpainting. (arXiv:2307.09670v1 [cs.SD])",
    "abstract": "Jazz pianists often uniquely interpret jazz standards. Passages from these interpretations can be viewed as sections of variation. We manually extracted such variations from solo jazz piano performances. The JAZZVAR dataset is a collection of 502 pairs of Variation and Original MIDI segments. Each Variation in the dataset is accompanied by a corresponding Original segment containing the melody and chords from the original jazz standard. Our approach differs from many existing jazz datasets in the music information retrieval (MIR) community, which often focus on improvisation sections within jazz performances. In this paper, we outline the curation process for obtaining and sorting the repertoire, the pipeline for creating the Original and Variation pairs, and our analysis of the dataset. We also introduce a new generative music task, Music Overpainting, and present a baseline Transformer model trained on the JAZZVAR dataset for this task. Other potential applications of our dataset inc",
    "link": "http://arxiv.org/abs/2307.09670",
    "context": "Title: JAZZVAR: A Dataset of Variations found within Solo Piano Performances of Jazz Standards for Music Overpainting. (arXiv:2307.09670v1 [cs.SD])\nAbstract: Jazz pianists often uniquely interpret jazz standards. Passages from these interpretations can be viewed as sections of variation. We manually extracted such variations from solo jazz piano performances. The JAZZVAR dataset is a collection of 502 pairs of Variation and Original MIDI segments. Each Variation in the dataset is accompanied by a corresponding Original segment containing the melody and chords from the original jazz standard. Our approach differs from many existing jazz datasets in the music information retrieval (MIR) community, which often focus on improvisation sections within jazz performances. In this paper, we outline the curation process for obtaining and sorting the repertoire, the pipeline for creating the Original and Variation pairs, and our analysis of the dataset. We also introduce a new generative music task, Music Overpainting, and present a baseline Transformer model trained on the JAZZVAR dataset for this task. Other potential applications of our dataset inc",
    "path": "papers/23/07/2307.09670.json",
    "total_tokens": 865,
    "translated_title": "JAZZVAR：一份包含爵士乐标准曲独奏中变奏的数据集，用于音乐重绘",
    "translated_abstract": "爵士钢琴家常常会以独特的方式演绎爵士乐标准曲。这些演绎中的片段可以被视为变奏的部分。我们从独奏爵士钢琴演奏中手动提取了这些变奏。JAZZVAR数据集是一组502个变奏和原始MIDI片段的集合。数据集中的每个变奏都有一个相应的原始片段，其中包含了原始爵士乐标准曲的旋律和和弦。我们的方法不同于许多现有的爵士乐数据集，这些数据集通常专注于爵士乐演奏中的即兴演奏部分。在本文中，我们介绍了获取和排序曲目的策划过程，创建原始片段和变奏对的流程，以及我们对数据集的分析。我们还引入了一项新的生成音乐任务——音乐重绘，并介绍了一个在JAZZVAR数据集上训练的基线Transformer模型用于这个任务。我们的数据集还有其他潜在的应用。",
    "tldr": "JAZZVAR是一份包含爵士乐标准曲独奏中变奏的数据集，为音乐重绘任务提供了基础。"
}