{
    "title": "An automated method for the ontological representation of security directives. (arXiv:2307.01211v1 [cs.AI])",
    "abstract": "Large documents written in juridical language are difficult to interpret, with long sentences leading to intricate and intertwined relations between the nouns. The present paper frames this problem in the context of recent European security directives. The complexity of their language is here thwarted by automating the extraction of the relevant information, namely of the parts of speech from each clause, through a specific tailoring of Natural Language Processing (NLP) techniques. These contribute, in combination with ontology development principles, to the design of our automated method for the representation of security directives as ontologies. The method is showcased on a practical problem, namely to derive an ontology representing the NIS 2 directive, which is the peak of cybersecurity prescripts at the European level. Although the NLP techniques adopted showed some limitations and had to be complemented by manual analysis, the overall results provide valid support for directive ",
    "link": "http://arxiv.org/abs/2307.01211",
    "context": "Title: An automated method for the ontological representation of security directives. (arXiv:2307.01211v1 [cs.AI])\nAbstract: Large documents written in juridical language are difficult to interpret, with long sentences leading to intricate and intertwined relations between the nouns. The present paper frames this problem in the context of recent European security directives. The complexity of their language is here thwarted by automating the extraction of the relevant information, namely of the parts of speech from each clause, through a specific tailoring of Natural Language Processing (NLP) techniques. These contribute, in combination with ontology development principles, to the design of our automated method for the representation of security directives as ontologies. The method is showcased on a practical problem, namely to derive an ontology representing the NIS 2 directive, which is the peak of cybersecurity prescripts at the European level. Although the NLP techniques adopted showed some limitations and had to be complemented by manual analysis, the overall results provide valid support for directive ",
    "path": "papers/23/07/2307.01211.json",
    "total_tokens": 784,
    "translated_title": "一个用于安全指令本体表示的自动化方法",
    "translated_abstract": "难以解释的大型法律文件，长句导致名词之间错综复杂的关系。本文将这个问题放在最近欧洲安全指令的背景下。通过对自然语言处理（NLP）技术的特定定制，自动化提取关键信息，即每个从句的词类。这些与本体发展原则相结合，设计了我们的安全指令本体表示的自动化方法。该方法在一个实际问题上展示，即推导出表示欧洲层面上网络和信息系统安全指令的本体。尽管采用的NLP技术存在一些限制，并且需要通过手动分析进行补充，但总体结果为指令提供了有效的支持。",
    "tldr": "本文提出了一种将大型法律文件自动转化为本体表示的方法，通过自然语言处理技术和本体发展原则的结合，展示了在欧洲网络和信息系统安全指令上的应用。",
    "en_tdlr": "This paper proposes an automated method for representing large legal documents as ontologies, using a combination of natural language processing techniques and ontology development principles. The method is demonstrated on European security directives, providing valuable support for the representation of cybersecurity regulations."
}