{
    "title": "Transformer-based Dual-domain Network for Few-view Dedicated Cardiac SPECT Image Reconstructions. (arXiv:2307.09624v1 [eess.IV])",
    "abstract": "Cardiovascular disease (CVD) is the leading cause of death worldwide, and myocardial perfusion imaging using SPECT has been widely used in the diagnosis of CVDs. The GE 530/570c dedicated cardiac SPECT scanners adopt a stationary geometry to simultaneously acquire 19 projections to increase sensitivity and achieve dynamic imaging. However, the limited amount of angular sampling negatively affects image quality. Deep learning methods can be implemented to produce higher-quality images from stationary data. This is essentially a few-view imaging problem. In this work, we propose a novel 3D transformer-based dual-domain network, called TIP-Net, for high-quality 3D cardiac SPECT image reconstructions. Our method aims to first reconstruct 3D cardiac SPECT images directly from projection data without the iterative reconstruction process by proposing a customized projection-to-image domain transformer. Then, given its reconstruction output and the original few-view reconstruction, we further ",
    "link": "http://arxiv.org/abs/2307.09624",
    "context": "Title: Transformer-based Dual-domain Network for Few-view Dedicated Cardiac SPECT Image Reconstructions. (arXiv:2307.09624v1 [eess.IV])\nAbstract: Cardiovascular disease (CVD) is the leading cause of death worldwide, and myocardial perfusion imaging using SPECT has been widely used in the diagnosis of CVDs. The GE 530/570c dedicated cardiac SPECT scanners adopt a stationary geometry to simultaneously acquire 19 projections to increase sensitivity and achieve dynamic imaging. However, the limited amount of angular sampling negatively affects image quality. Deep learning methods can be implemented to produce higher-quality images from stationary data. This is essentially a few-view imaging problem. In this work, we propose a novel 3D transformer-based dual-domain network, called TIP-Net, for high-quality 3D cardiac SPECT image reconstructions. Our method aims to first reconstruct 3D cardiac SPECT images directly from projection data without the iterative reconstruction process by proposing a customized projection-to-image domain transformer. Then, given its reconstruction output and the original few-view reconstruction, we further ",
    "path": "papers/23/07/2307.09624.json",
    "total_tokens": 907,
    "translated_title": "基于Transformer的双域网络用于少视角心脏SPECT图像重建",
    "translated_abstract": "心血管疾病(CVD)是全球死亡原因的主要因素，心肌灌注成像使用SPECT在CVD的诊断中被广泛应用。GE 530/570c专用心脏SPECT扫描仪采用静态几何形式，同时获取19个投影以提高灵敏度和实现动态成像。然而，有限的角度采样对图像质量产生负面影响。深度学习方法可以用于从静态数据中生成更高质量的图像。这本质上是一个少视角成像问题。在这项工作中，我们提出了一种名为TIP-Net的新型三维Transformer双域网络，用于高质量的三维心脏SPECT图像重建。我们的方法旨在通过提出一个定制的投影到图像域转换器，直接从投影数据中重建三维心脏SPECT图像，而不需要迭代重建过程。然后，给定其重建输出和原始的少视角重建，我们进一步",
    "tldr": "提出了一种基于Transformer的双域网络用于少视角心脏SPECT图像重建，通过定制的投影到图像域转换器直接从投影数据中重建三维心脏SPECT图像，以提高图像质量。"
}