{
    "title": "Conformal PID Control for Time Series Prediction. (arXiv:2307.16895v1 [cs.LG])",
    "abstract": "We study the problem of uncertainty quantification for time series prediction, with the goal of providing easy-to-use algorithms with formal guarantees. The algorithms we present build upon ideas from conformal prediction and control theory, are able to prospectively model conformal scores in an online setting, and adapt to the presence of systematic errors due to seasonality, trends, and general distribution shifts. Our theory both simplifies and strengthens existing analyses in online conformal prediction. Experiments on 4-week-ahead forecasting of statewide COVID-19 death counts in the U.S. show an improvement in coverage over the ensemble forecaster used in official CDC communications. We also run experiments on predicting electricity demand, market returns, and temperature using autoregressive, Theta, Prophet, and Transformer models. We provide an extendable codebase for testing our methods and for the integration of new algorithms, data sets, and forecasting rules.",
    "link": "http://arxiv.org/abs/2307.16895",
    "context": "Title: Conformal PID Control for Time Series Prediction. (arXiv:2307.16895v1 [cs.LG])\nAbstract: We study the problem of uncertainty quantification for time series prediction, with the goal of providing easy-to-use algorithms with formal guarantees. The algorithms we present build upon ideas from conformal prediction and control theory, are able to prospectively model conformal scores in an online setting, and adapt to the presence of systematic errors due to seasonality, trends, and general distribution shifts. Our theory both simplifies and strengthens existing analyses in online conformal prediction. Experiments on 4-week-ahead forecasting of statewide COVID-19 death counts in the U.S. show an improvement in coverage over the ensemble forecaster used in official CDC communications. We also run experiments on predicting electricity demand, market returns, and temperature using autoregressive, Theta, Prophet, and Transformer models. We provide an extendable codebase for testing our methods and for the integration of new algorithms, data sets, and forecasting rules.",
    "path": "papers/23/07/2307.16895.json",
    "total_tokens": 871,
    "translated_title": "时间序列预测的依从PID控制",
    "translated_abstract": "我们研究了时间序列预测的不确定性量化问题，目标是提供易于使用的算法并具备形式保证。我们提出的算法基于依从预测和控制理论的思想，能够在在线环境中前瞻性地建模依从得分，并适应由于季节性、趋势和总体分布变化而导致的系统误差。我们的理论简化并加强了在线依从预测中的现有分析。在美国州级COVID-19死亡人数的4周预测实验中，与官方CDC通信中使用的集成预测器相比，得到了更好的覆盖率。我们还对使用自回归、Theta、Prophet和Transformer模型进行电力需求、市场回报和温度预测的实验进行了运行。我们提供了一个可扩展的代码库，用于测试我们的方法并集成新的算法、数据集和预测规则。",
    "tldr": "这项研究提出了一种在时间序列预测中应用的新的依从PID控制算法，能够量化不确定性并适应不同的系统误差，并在COVID-19死亡人数、电力需求和市场回报等方面取得了更好的预测结果。"
}