{
    "title": "VampNet: Music Generation via Masked Acoustic Token Modeling. (arXiv:2307.04686v2 [cs.SD] UPDATED)",
    "abstract": "We introduce VampNet, a masked acoustic token modeling approach to music synthesis, compression, inpainting, and variation. We use a variable masking schedule during training which allows us to sample coherent music from the model by applying a variety of masking approaches (called prompts) during inference. VampNet is non-autoregressive, leveraging a bidirectional transformer architecture that attends to all tokens in a forward pass. With just 36 sampling passes, VampNet can generate coherent high-fidelity musical waveforms. We show that by prompting VampNet in various ways, we can apply it to tasks like music compression, inpainting, outpainting, continuation, and looping with variation (vamping). Appropriately prompted, VampNet is capable of maintaining style, genre, instrumentation, and other high-level aspects of the music. This flexible prompting capability makes VampNet a powerful music co-creation tool. Code and audio samples are available online.",
    "link": "http://arxiv.org/abs/2307.04686",
    "context": "Title: VampNet: Music Generation via Masked Acoustic Token Modeling. (arXiv:2307.04686v2 [cs.SD] UPDATED)\nAbstract: We introduce VampNet, a masked acoustic token modeling approach to music synthesis, compression, inpainting, and variation. We use a variable masking schedule during training which allows us to sample coherent music from the model by applying a variety of masking approaches (called prompts) during inference. VampNet is non-autoregressive, leveraging a bidirectional transformer architecture that attends to all tokens in a forward pass. With just 36 sampling passes, VampNet can generate coherent high-fidelity musical waveforms. We show that by prompting VampNet in various ways, we can apply it to tasks like music compression, inpainting, outpainting, continuation, and looping with variation (vamping). Appropriately prompted, VampNet is capable of maintaining style, genre, instrumentation, and other high-level aspects of the music. This flexible prompting capability makes VampNet a powerful music co-creation tool. Code and audio samples are available online.",
    "path": "papers/23/07/2307.04686.json",
    "total_tokens": 943,
    "translated_title": "VampNet：通过掩码声学令牌建模进行音乐生成",
    "translated_abstract": "我们引入了VampNet，一种通过掩码声学令牌建模方法进行音乐合成、压缩、修复和变异。我们在训练过程中使用可变的掩码计划，通过应用各种掩码方法（称为提示）进行推理来从模型中采样连贯的音乐。VampNet是非自回归的，利用双向Transformer架构，在正向传递中关注所有令牌。经过36次采样传递，VampNet可以生成连贯的高保真音乐波形。我们展示了通过以不同方式提示VampNet，我们可以将其应用于音乐压缩、修复、扩展、延续和循环变异（vamping）等任务。在适当的提示下，VampNet能够保持音乐的风格、流派、乐器和其他高层次方面。这种灵活的提示能力使VampNet成为一个强大的音乐共创工具。代码和音频样本可在网上获得。",
    "tldr": "本论文介绍了一种名为VampNet的音乐生成方法，通过掩码声学令牌建模实现生成、压缩、修复和变异。VampNet通过灵活的提示能力，能够保持音乐的风格、流派、乐器和其他高层次方面，是一个强大的音乐共创工具。",
    "en_tdlr": "This paper introduces VampNet, a music generation method using masked acoustic token modeling for synthesis, compression, inpainting, and variation. VampNet can maintain the style, genre, instrumentation, and other high-level aspects of the music through its flexible prompting capability, making it a powerful tool for music co-creation."
}