{
    "title": "Boosting Norwegian Automatic Speech Recognition. (arXiv:2307.01672v1 [cs.CL])",
    "abstract": "In this paper, we present several baselines for automatic speech recognition (ASR) models for the two official written languages in Norway: Bokm{\\aa}l and Nynorsk. We compare the performance of models of varying sizes and pre-training approaches on multiple Norwegian speech datasets. Additionally, we measure the performance of these models against previous state-of-the-art ASR models, as well as on out-of-domain datasets. We improve the state of the art on the Norwegian Parliamentary Speech Corpus (NPSC) from a word error rate (WER) of 17.10\\% to 7.60\\%, with models achieving 5.81\\% for Bokm{\\aa}l and 11.54\\% for Nynorsk. We also discuss the challenges and potential solutions for further improving ASR models for Norwegian.",
    "link": "http://arxiv.org/abs/2307.01672",
    "context": "Title: Boosting Norwegian Automatic Speech Recognition. (arXiv:2307.01672v1 [cs.CL])\nAbstract: In this paper, we present several baselines for automatic speech recognition (ASR) models for the two official written languages in Norway: Bokm{\\aa}l and Nynorsk. We compare the performance of models of varying sizes and pre-training approaches on multiple Norwegian speech datasets. Additionally, we measure the performance of these models against previous state-of-the-art ASR models, as well as on out-of-domain datasets. We improve the state of the art on the Norwegian Parliamentary Speech Corpus (NPSC) from a word error rate (WER) of 17.10\\% to 7.60\\%, with models achieving 5.81\\% for Bokm{\\aa}l and 11.54\\% for Nynorsk. We also discuss the challenges and potential solutions for further improving ASR models for Norwegian.",
    "path": "papers/23/07/2307.01672.json",
    "total_tokens": 844,
    "translated_title": "提升挪威自动语音识别的技术",
    "translated_abstract": "在本论文中，我们介绍了几种面向挪威两种官方书面语言（Bokmål和Nynorsk）的自动语音识别（ASR）模型的基准。我们比较了不同大小和预训练方法的模型在多个挪威语音数据集上的性能。另外，我们还将这些模型与之前的最新ASR模型以及不同领域的数据集进行了性能比较。我们将在挪威议会演讲语料库（NPSC）上的错误率（WER）从17.10％降低到7.60％，Bokmål和Nynorsk分别达到5.81％和11.54％。我们还讨论了进一步改进挪威语ASR模型的挑战和潜在解决方案。",
    "tldr": "该论文通过比较不同大小和预训练方法的模型在多个挪威语音数据集上的性能，提高了挪威自动语音识别的技术水平，并讨论了进一步改进挪威语ASR模型的挑战和潜在解决方案。",
    "en_tdlr": "This paper enhances Norwegian automatic speech recognition (ASR) technology by comparing performance of models of varying sizes and pre-training approaches on multiple Norwegian speech datasets, achieving significant improvements in word error rate (WER) on the Norwegian Parliamentary Speech Corpus (NPSC), and discussing challenges and potential solutions for further improving Norwegian ASR models."
}