{
    "title": "Assessing the Use of AutoML for Data-Driven Software Engineering. (arXiv:2307.10774v1 [cs.SE])",
    "abstract": "Background. Due to the widespread adoption of Artificial Intelligence (AI) and Machine Learning (ML) for building software applications, companies are struggling to recruit employees with a deep understanding of such technologies. In this scenario, AutoML is soaring as a promising solution to fill the AI/ML skills gap since it promises to automate the building of end-to-end AI/ML pipelines that would normally be engineered by specialized team members. Aims. Despite the growing interest and high expectations, there is a dearth of information about the extent to which AutoML is currently adopted by teams developing AI/ML-enabled systems and how it is perceived by practitioners and researchers. Method. To fill these gaps, in this paper, we present a mixed-method study comprising a benchmark of 12 end-to-end AutoML tools on two SE datasets and a user survey with follow-up interviews to further our understanding of AutoML adoption and perception. Results. We found that AutoML solutions can ",
    "link": "http://arxiv.org/abs/2307.10774",
    "context": "Title: Assessing the Use of AutoML for Data-Driven Software Engineering. (arXiv:2307.10774v1 [cs.SE])\nAbstract: Background. Due to the widespread adoption of Artificial Intelligence (AI) and Machine Learning (ML) for building software applications, companies are struggling to recruit employees with a deep understanding of such technologies. In this scenario, AutoML is soaring as a promising solution to fill the AI/ML skills gap since it promises to automate the building of end-to-end AI/ML pipelines that would normally be engineered by specialized team members. Aims. Despite the growing interest and high expectations, there is a dearth of information about the extent to which AutoML is currently adopted by teams developing AI/ML-enabled systems and how it is perceived by practitioners and researchers. Method. To fill these gaps, in this paper, we present a mixed-method study comprising a benchmark of 12 end-to-end AutoML tools on two SE datasets and a user survey with follow-up interviews to further our understanding of AutoML adoption and perception. Results. We found that AutoML solutions can ",
    "path": "papers/23/07/2307.10774.json",
    "total_tokens": 913,
    "translated_title": "评估AutoML在数据驱动软件工程中的应用",
    "translated_abstract": "背景：由于人工智能（AI）和机器学习（ML）在构建软件应用方面的广泛应用，公司正努力招聘具有深入了解这些技术的员工。在这种情况下，AutoML作为填补AI / ML技能缺口的有希望的解决方案大受欢迎，因为它承诺自动化构建端到端AI / ML流水线，这些流水线通常由专门的团队成员设计。目标：尽管受到越来越多的关注和高期望，但目前对于开发AI / ML系统的团队当前采用AutoML的程度以及从实践者和研究者的视角来看它的感知程度缺乏信息。方法：为了填补这些空白，本文提出了一项混合方法研究，包括对两个软件工程数据集中12个端到端AutoML工具的基准测试以及用户调查和后续访谈，以进一步了解AutoML的采用和感知。结果：我们发现AutoML解决方案可以",
    "tldr": "AutoML作为一种自动化构建端到端AI/ML流水线的解决方案被广泛关注，但目前对其在开发AI/ML系统的团队中的采用程度和感知程度缺乏信息。",
    "en_tdlr": "AutoML is being widely recognized as a solution for automating the building of end-to-end AI/ML pipelines, but there is a lack of information about its adoption and perception among teams developing AI/ML systems."
}