{
    "title": "Pricing European Options with Google AutoML, TensorFlow, and XGBoost. (arXiv:2307.00476v1 [q-fin.PR])",
    "abstract": "Researchers have been using Neural Networks and other related machine-learning techniques to price options since the early 1990s. After three decades of improvements in machine learning techniques, computational processing power, cloud computing, and data availability, this paper is able to provide a comparison of using Google Cloud's AutoML Regressor, TensorFlow Neural Networks, and XGBoost Gradient Boosting Decision Trees for pricing European Options. All three types of models were able to outperform the Black Scholes Model in terms of mean absolute error. These results showcase the potential of using historical data from an option's underlying asset for pricing European options, especially when using machine learning algorithms that learn complex patterns that traditional parametric models do not take into account.",
    "link": "http://arxiv.org/abs/2307.00476",
    "context": "Title: Pricing European Options with Google AutoML, TensorFlow, and XGBoost. (arXiv:2307.00476v1 [q-fin.PR])\nAbstract: Researchers have been using Neural Networks and other related machine-learning techniques to price options since the early 1990s. After three decades of improvements in machine learning techniques, computational processing power, cloud computing, and data availability, this paper is able to provide a comparison of using Google Cloud's AutoML Regressor, TensorFlow Neural Networks, and XGBoost Gradient Boosting Decision Trees for pricing European Options. All three types of models were able to outperform the Black Scholes Model in terms of mean absolute error. These results showcase the potential of using historical data from an option's underlying asset for pricing European options, especially when using machine learning algorithms that learn complex patterns that traditional parametric models do not take into account.",
    "path": "papers/23/07/2307.00476.json",
    "total_tokens": 893,
    "translated_title": "使用Google AutoML、TensorFlow和XGBoost定价欧式期权",
    "translated_abstract": "从20世纪90年代初以来，研究人员一直在使用神经网络和其他相关的机器学习技术来定价期权。经过三十年来机器学习技术、计算处理能力、云计算和数据可用性的改进，本文能够比较使用Google Cloud的AutoML回归器、TensorFlow神经网络和XGBoost梯度提升决策树来定价欧式期权。在平均绝对误差方面，这三种模型都能够超越Black Scholes模型。这些结果展示了使用期权基础资产的历史数据来定价欧式期权的潜力，尤其是当使用能够学习传统参数模型没有考虑到的复杂模式的机器学习算法时。",
    "tldr": "使用Google Cloud的AutoML Regressor、TensorFlow神经网络和XGBoost梯度提升决策树来定价欧式期权，这三种模型在平均绝对误差方面都能够超越Black Scholes模型。这些结果展示了使用期权基础资产的历史数据来定价欧式期权的潜力，尤其是当使用能够学习传统参数模型没有考虑到的复杂模式的机器学习算法时。",
    "en_tdlr": "The paper compares the performance of Google Cloud's AutoML Regressor, TensorFlow Neural Networks, and XGBoost Gradient Boosting Decision Trees in pricing European Options, and shows that all three models outperform the Black Scholes Model in terms of mean absolute error. These results highlight the potential of using historical data from an option's underlying asset for pricing European options, particularly when using machine learning algorithms that capture complex patterns ignored by traditional parametric models."
}