{
    "title": "Large Language Model-based System to Provide Immediate Feedback to Students in Flipped Classroom Preparation Learning. (arXiv:2307.11388v1 [cs.HC])",
    "abstract": "This paper proposes a system that uses large language models to provide immediate feedback to students in flipped classroom preparation learning. This study aimed to solve challenges in the flipped classroom model, such as ensuring that students are emotionally engaged and motivated to learn. Students often have questions about the content of lecture videos in the preparation of flipped classrooms, but it is difficult for teachers to answer them immediately. The proposed system was developed using the ChatGPT API on a video-watching support system for preparation learning that is being used in real practice. Answers from ChatGPT often do not align with the context of the student's question. Therefore, this paper also proposes a method to align the answer with the context. This paper also proposes a method to collect the teacher's answers to the students' questions and use them as additional guides for the students. This paper discusses the design and implementation of the proposed syst",
    "link": "http://arxiv.org/abs/2307.11388",
    "context": "Title: Large Language Model-based System to Provide Immediate Feedback to Students in Flipped Classroom Preparation Learning. (arXiv:2307.11388v1 [cs.HC])\nAbstract: This paper proposes a system that uses large language models to provide immediate feedback to students in flipped classroom preparation learning. This study aimed to solve challenges in the flipped classroom model, such as ensuring that students are emotionally engaged and motivated to learn. Students often have questions about the content of lecture videos in the preparation of flipped classrooms, but it is difficult for teachers to answer them immediately. The proposed system was developed using the ChatGPT API on a video-watching support system for preparation learning that is being used in real practice. Answers from ChatGPT often do not align with the context of the student's question. Therefore, this paper also proposes a method to align the answer with the context. This paper also proposes a method to collect the teacher's answers to the students' questions and use them as additional guides for the students. This paper discusses the design and implementation of the proposed syst",
    "path": "papers/23/07/2307.11388.json",
    "total_tokens": 934,
    "translated_title": "基于大型语言模型的系统为翻转课堂准备学习提供即时反馈",
    "translated_abstract": "本文提出了一种使用大型语言模型为翻转课堂准备学习中的学生提供即时反馈的系统。该研究旨在解决翻转课堂模式中的挑战，例如确保学生在情感上参与并保持学习积极性。在翻转课堂准备中，学生经常对课堂视频的内容有疑问，但教师很难立即回答这些问题。所提出的系统使用了ChatGPT API，在实际实践中用于准备学习的视频观看支持系统上进行开发。ChatGPT的回答往往与学生问题的上下文不一致。因此，本文还提出了一种将回答与上下文对齐的方法。本文还提出了一种方法来收集教师对学生问题的回答，并将其作为学生的额外指导。本文讨论了所提出系统的设计和实现。",
    "tldr": "本文提出了基于大型语言模型的系统，旨在为翻转课堂准备学习中的学生提供即时反馈。该系统不仅解决了学生在观看课堂视频时遇到的问题，还通过对回答与上下文的对齐和教师答案的收集，提供了额外的学习指导。"
}