{
    "title": "ContextLabeler Dataset: physical and virtual sensors data collected from smartphone usage in-the-wild. (arXiv:2307.03586v1 [cs.HC])",
    "abstract": "This paper describes a data collection campaign and the resulting dataset derived from smartphone sensors characterizing the daily life activities of 3 volunteers in a period of two weeks. The dataset is released as a collection of CSV files containing more than 45K data samples, where each sample is composed by 1332 features related to a heterogeneous set of physical and virtual sensors, including motion sensors, running applications, devices in proximity, and weather conditions. Moreover, each data sample is associated with a ground truth label that describes the user activity and the situation in which she was involved during the sensing experiment (e.g., working, at restaurant, and doing sport activity). To avoid introducing any bias during the data collection, we performed the sensing experiment in-the-wild, that is, by using the volunteers' devices, and without defining any constraint related to the user's behavior. For this reason, the collected dataset represents a useful sourc",
    "link": "http://arxiv.org/abs/2307.03586",
    "context": "Title: ContextLabeler Dataset: physical and virtual sensors data collected from smartphone usage in-the-wild. (arXiv:2307.03586v1 [cs.HC])\nAbstract: This paper describes a data collection campaign and the resulting dataset derived from smartphone sensors characterizing the daily life activities of 3 volunteers in a period of two weeks. The dataset is released as a collection of CSV files containing more than 45K data samples, where each sample is composed by 1332 features related to a heterogeneous set of physical and virtual sensors, including motion sensors, running applications, devices in proximity, and weather conditions. Moreover, each data sample is associated with a ground truth label that describes the user activity and the situation in which she was involved during the sensing experiment (e.g., working, at restaurant, and doing sport activity). To avoid introducing any bias during the data collection, we performed the sensing experiment in-the-wild, that is, by using the volunteers' devices, and without defining any constraint related to the user's behavior. For this reason, the collected dataset represents a useful sourc",
    "path": "papers/23/07/2307.03586.json",
    "total_tokens": 865,
    "translated_title": "ContextLabeler数据集: 在野外使用的智能手机传感器数据的物理和虚拟传感器数据收集",
    "translated_abstract": "本文描述了一项数据收集活动和由智能手机传感器衍生而来的数据集，该数据集表征了3名志愿者在两周内的日常生活活动。该数据集以一组CSV文件的形式发布，其中包含超过45K个数据样本，每个样本由1332个与各种物理和虚拟传感器相关的特征组成，包括动作传感器、运行应用程序、附近设备和天气条件等。此外，每个数据样本都带有一个与感知实验期间用户活动和情境相关的地面真值标签（例如，工作、在餐厅、做运动活动）。为了避免在数据收集过程中引入任何偏见，我们在野外进行了感知实验，即使用志愿者的设备，并且没有对用户行为定义任何约束。因此，收集到的数据集代表着一个有用的资源来源。",
    "tldr": "本研究介绍了一个数据收集活动和由智能手机传感器衍生而来的数据集，包含超过45K个样本，提供了关于用户日常活动的信息，并且采用了在野外实验的方式，消除了用户行为的偏见。",
    "en_tdlr": "This paper presents a dataset derived from smartphone sensors, collected in-the-wild, that provides information about users' daily activities without bias."
}