{
    "title": "Automatic Piano Transcription with Hierarchical Frequency-Time Transformer. (arXiv:2307.04305v1 [cs.SD])",
    "abstract": "Taking long-term spectral and temporal dependencies into account is essential for automatic piano transcription. This is especially helpful when determining the precise onset and offset for each note in the polyphonic piano content. In this case, we may rely on the capability of self-attention mechanism in Transformers to capture these long-term dependencies in the frequency and time axes. In this work, we propose hFT-Transformer, which is an automatic music transcription method that uses a two-level hierarchical frequency-time Transformer architecture. The first hierarchy includes a convolutional block in the time axis, a Transformer encoder in the frequency axis, and a Transformer decoder that converts the dimension in the frequency axis. The output is then fed into the second hierarchy which consists of another Transformer encoder in the time axis. We evaluated our method with the widely used MAPS and MAESTRO v3.0.0 datasets, and it demonstrated state-of-the-art performance on all t",
    "link": "http://arxiv.org/abs/2307.04305",
    "context": "Title: Automatic Piano Transcription with Hierarchical Frequency-Time Transformer. (arXiv:2307.04305v1 [cs.SD])\nAbstract: Taking long-term spectral and temporal dependencies into account is essential for automatic piano transcription. This is especially helpful when determining the precise onset and offset for each note in the polyphonic piano content. In this case, we may rely on the capability of self-attention mechanism in Transformers to capture these long-term dependencies in the frequency and time axes. In this work, we propose hFT-Transformer, which is an automatic music transcription method that uses a two-level hierarchical frequency-time Transformer architecture. The first hierarchy includes a convolutional block in the time axis, a Transformer encoder in the frequency axis, and a Transformer decoder that converts the dimension in the frequency axis. The output is then fed into the second hierarchy which consists of another Transformer encoder in the time axis. We evaluated our method with the widely used MAPS and MAESTRO v3.0.0 datasets, and it demonstrated state-of-the-art performance on all t",
    "path": "papers/23/07/2307.04305.json",
    "total_tokens": 865,
    "translated_title": "基于分层频率-时间Transformer的自动钢琴转录",
    "translated_abstract": "考虑到长期的频率和时间依赖关系对于自动钢琴转录至关重要，特别是在确定复音钢琴内容中每个音符的精确起始和结束时间时。在这种情况下，我们可以依靠Transformer中自注意力机制的能力来捕捉这些频率和时间轴上的长期依赖关系。在这项工作中，我们提出了hFT-Transformer，这是一种使用两级分层频率-时间Transformer架构的自动音乐转录方法。第一个层次结构包括时间轴上的卷积块，频率轴上的Transformer编码器以及将频率轴上的维度转换的Transformer解码器。然后将输出馈送到第二层次结构，其中包含另一个时间轴上的Transformer编码器。我们使用广泛使用的MAPS和MAESTRO v3.0.0数据集对我们的方法进行评估，结果表明在所有测试数据上都展现出了最先进的性能。",
    "tldr": "提出了一种名为hFT-Transformer的自动音乐转录方法，它采用了两级分层频率-时间Transformer架构，并在MAPS和MAESTRO v3.0.0数据集上展现出了最先进的性能。"
}