{
    "title": "The Co-12 Recipe for Evaluating Interpretable Part-Prototype Image Classifiers. (arXiv:2307.14517v1 [cs.CV])",
    "abstract": "Interpretable part-prototype models are computer vision models that are explainable by design. The models learn prototypical parts and recognise these components in an image, thereby combining classification and explanation. Despite the recent attention for intrinsically interpretable models, there is no comprehensive overview on evaluating the explanation quality of interpretable part-prototype models. Based on the Co-12 properties for explanation quality as introduced in arXiv:2201.08164 (e.g., correctness, completeness, compactness), we review existing work that evaluates part-prototype models, reveal research gaps and outline future approaches for evaluation of the explanation quality of part-prototype models. This paper, therefore, contributes to the progression and maturity of this relatively new research field on interpretable part-prototype models. We additionally provide a ``Co-12 cheat sheet'' that acts as a concise summary of our findings on evaluating part-prototype models.",
    "link": "http://arxiv.org/abs/2307.14517",
    "context": "Title: The Co-12 Recipe for Evaluating Interpretable Part-Prototype Image Classifiers. (arXiv:2307.14517v1 [cs.CV])\nAbstract: Interpretable part-prototype models are computer vision models that are explainable by design. The models learn prototypical parts and recognise these components in an image, thereby combining classification and explanation. Despite the recent attention for intrinsically interpretable models, there is no comprehensive overview on evaluating the explanation quality of interpretable part-prototype models. Based on the Co-12 properties for explanation quality as introduced in arXiv:2201.08164 (e.g., correctness, completeness, compactness), we review existing work that evaluates part-prototype models, reveal research gaps and outline future approaches for evaluation of the explanation quality of part-prototype models. This paper, therefore, contributes to the progression and maturity of this relatively new research field on interpretable part-prototype models. We additionally provide a ``Co-12 cheat sheet'' that acts as a concise summary of our findings on evaluating part-prototype models.",
    "path": "papers/23/07/2307.14517.json",
    "total_tokens": 934,
    "translated_title": "用于评估可解释的部件原型图像分类器的Co-12配方",
    "translated_abstract": "可解释的部件原型模型是设计上可以解释的计算机视觉模型。这些模型学习原型部件，并识别图像中的这些组件，从而结合分类和解释。尽管近年来可解释模型受到了关注，但对可解释的部件原型模型的解释质量评估缺乏全面的概述。基于在arXiv:2201.08164中引入的Co-12解释质量属性（例如正确性、完整性、紧凑性），我们回顾了评估部件原型模型的现有工作，揭示了研究的空白，并概述了评估部件原型模型解释质量的未来方法。因此，本文对可解释的部件原型模型这个相对较新的研究领域的进展和成熟做出了贡献。我们还提供了一个“Co-12备忘单”，它作为对评估部件原型模型结果的简明总结。",
    "tldr": "本文提出了一种用于评估可解释的部件原型图像分类器的Co-12配方，并回顾了现有工作，揭示了研究的空白，并概述了评估部件原型模型解释质量的未来方法。这对于这个相对较新的研究领域的进展和成熟具有重要意义。"
}