{
    "title": "Bayesian Time-Series Classifier for Decoding Simple Visual Stimuli from Intracranial Neural Activity. (arXiv:2307.15672v1 [cs.LG])",
    "abstract": "Understanding how external stimuli are encoded in distributed neural activity is of significant interest in clinical and basic neuroscience. To address this need, it is essential to develop analytical tools capable of handling limited data and the intrinsic stochasticity present in neural data. In this study, we propose a straightforward Bayesian time series classifier (BTsC) model that tackles these challenges whilst maintaining a high level of interpretability. We demonstrate the classification capabilities of this approach by utilizing neural data to decode colors in a visual task. The model exhibits consistent and reliable average performance of 75.55% on 4 patients' dataset, improving upon state-of-the-art machine learning techniques by about 3.0 percent. In addition to its high classification accuracy, the proposed BTsC model provides interpretable results, making the technique a valuable tool to study neural activity in various tasks and categories. The proposed solution can be ",
    "link": "http://arxiv.org/abs/2307.15672",
    "context": "Title: Bayesian Time-Series Classifier for Decoding Simple Visual Stimuli from Intracranial Neural Activity. (arXiv:2307.15672v1 [cs.LG])\nAbstract: Understanding how external stimuli are encoded in distributed neural activity is of significant interest in clinical and basic neuroscience. To address this need, it is essential to develop analytical tools capable of handling limited data and the intrinsic stochasticity present in neural data. In this study, we propose a straightforward Bayesian time series classifier (BTsC) model that tackles these challenges whilst maintaining a high level of interpretability. We demonstrate the classification capabilities of this approach by utilizing neural data to decode colors in a visual task. The model exhibits consistent and reliable average performance of 75.55% on 4 patients' dataset, improving upon state-of-the-art machine learning techniques by about 3.0 percent. In addition to its high classification accuracy, the proposed BTsC model provides interpretable results, making the technique a valuable tool to study neural activity in various tasks and categories. The proposed solution can be ",
    "path": "papers/23/07/2307.15672.json",
    "total_tokens": 1073,
    "translated_title": "基于贝叶斯的时间序列分类器用于从颅内神经活动中解码简单的视觉刺激",
    "translated_abstract": "在临床和基础神经科学中，了解外部刺激如何编码在分布式神经活动中具有重要意义。为了解决这个问题，需要开发能够处理有限数据和神经数据中固有的随机性的分析工具。在本研究中，我们提出了一个简单的贝叶斯时间序列分类器（BTsC）模型，以解决这些挑战，同时保持较高的可解释性水平。我们通过利用神经数据解码视觉任务中的颜色来展示该方法的分类能力。该模型在4名患者数据集上表现出一致可靠的平均性能，平均准确率为75.55％，比先进的机器学习技术提高了约3.0个百分点。除了高分类准确率外，所提出的BTsC模型提供了可解释的结果，使这种技术成为研究各种任务和类别的神经活动的有价值的工具。",
    "tldr": "本研究提出了一个基于贝叶斯的时间序列分类器模型，解决了处理有限数据和神经数据中随机性的问题，并在解码颅内神经活动中的简单视觉刺激方面取得了良好的分类结果。该模型在4名患者数据集上表现出75.55％的平均准确率，比先进的机器学习技术提高了约3.0个百分点。此外，该模型提供了可解释的结果，成为研究神经活动的有价值工具。",
    "en_tdlr": "This study proposes a Bayesian time series classifier model that addresses the challenges of handling limited data and stochasticity in neural data, and achieves good classification results in decoding simple visual stimuli from intracranial neural activity. The model demonstrates an average accuracy of 75.55% on 4 patients' dataset, improving upon state-of-the-art machine learning techniques by about 3.0 percent. In addition to its high classification accuracy, the proposed model provides interpretable results, making it a valuable tool for studying neural activity in various tasks and categories."
}