{
    "title": "Number Systems for Deep Neural Network Architectures: A Survey. (arXiv:2307.05035v1 [cs.NE])",
    "abstract": "Deep neural networks (DNNs) have become an enabling component for a myriad of artificial intelligence applications. DNNs have shown sometimes superior performance, even compared to humans, in cases such as self-driving, health applications, etc. Because of their computational complexity, deploying DNNs in resource-constrained devices still faces many challenges related to computing complexity, energy efficiency, latency, and cost. To this end, several research directions are being pursued by both academia and industry to accelerate and efficiently implement DNNs. One important direction is determining the appropriate data representation for the massive amount of data involved in DNN processing. Using conventional number systems has been found to be sub-optimal for DNNs. Alternatively, a great body of research focuses on exploring suitable number systems. This article aims to provide a comprehensive survey and discussion about alternative number systems for more efficient representation",
    "link": "http://arxiv.org/abs/2307.05035",
    "context": "Title: Number Systems for Deep Neural Network Architectures: A Survey. (arXiv:2307.05035v1 [cs.NE])\nAbstract: Deep neural networks (DNNs) have become an enabling component for a myriad of artificial intelligence applications. DNNs have shown sometimes superior performance, even compared to humans, in cases such as self-driving, health applications, etc. Because of their computational complexity, deploying DNNs in resource-constrained devices still faces many challenges related to computing complexity, energy efficiency, latency, and cost. To this end, several research directions are being pursued by both academia and industry to accelerate and efficiently implement DNNs. One important direction is determining the appropriate data representation for the massive amount of data involved in DNN processing. Using conventional number systems has been found to be sub-optimal for DNNs. Alternatively, a great body of research focuses on exploring suitable number systems. This article aims to provide a comprehensive survey and discussion about alternative number systems for more efficient representation",
    "path": "papers/23/07/2307.05035.json",
    "total_tokens": 767,
    "translated_title": "深度神经网络体系结构的数字系统：一项调查",
    "translated_abstract": "深度神经网络（DNN）已成为各种人工智能应用的关键组件。在自动驾驶、健康应用等方面，DNN在某些情况下甚至能比人类表现更好。然而，由于计算复杂性，将DNN部署到资源受限的设备上仍面临着许多挑战，如计算复杂性、能源效率、延迟和成本方面。因此，学术界和工业界正在追求几个研究方向，以加速和高效地实现DNNs。其中一个重要方向是确定适用于DNN处理中涉及的大量数据的适当数据表示。使用传统的数字系统被发现对DNNs来说不够优化。相反，许多研究将重点放在探索合适的数字系统上。本文旨在提供关于更有效表示的替代数字系统的全面调查和讨论。",
    "tldr": "这项论文调查了用于深度神经网络的替代数字系统，以提高计算效率和资源利用。"
}