{
    "title": "On the Well-posedness of Hamilton-Jacobi-Bellman Equations of the Equilibrium Type. (arXiv:2307.01986v1 [math.AP])",
    "abstract": "This paper studies the well-posedness of a class of nonlocal parabolic partial differential equations (PDEs), or equivalently equilibrium Hamilton-Jacobi-Bellman equations, which has a strong tie with the characterization of the equilibrium strategies and the associated value functions for time-inconsistent stochastic control problems. Specifically, we consider nonlocality in both time and space, which allows for modelling of the stochastic control problems with initial-time-and-state dependent objective functionals. We leverage the method of continuity to show the global well-posedness within our proposed Banach space with our established Schauder prior estimate for the linearized nonlocal PDE. Then, we adopt a linearization method and Banach's fixed point arguments to show the local well-posedness of the nonlocal fully nonlinear case, while the global well-posedness is attainable provided that a very sharp a-priori estimate is available. On top of the well-posedness results, we also ",
    "link": "http://arxiv.org/abs/2307.01986",
    "context": "Title: On the Well-posedness of Hamilton-Jacobi-Bellman Equations of the Equilibrium Type. (arXiv:2307.01986v1 [math.AP])\nAbstract: This paper studies the well-posedness of a class of nonlocal parabolic partial differential equations (PDEs), or equivalently equilibrium Hamilton-Jacobi-Bellman equations, which has a strong tie with the characterization of the equilibrium strategies and the associated value functions for time-inconsistent stochastic control problems. Specifically, we consider nonlocality in both time and space, which allows for modelling of the stochastic control problems with initial-time-and-state dependent objective functionals. We leverage the method of continuity to show the global well-posedness within our proposed Banach space with our established Schauder prior estimate for the linearized nonlocal PDE. Then, we adopt a linearization method and Banach's fixed point arguments to show the local well-posedness of the nonlocal fully nonlinear case, while the global well-posedness is attainable provided that a very sharp a-priori estimate is available. On top of the well-posedness results, we also ",
    "path": "papers/23/07/2307.01986.json",
    "total_tokens": 948,
    "translated_title": "关于平衡型哈密尔顿-雅可比-贝尔曼方程的良定性",
    "translated_abstract": "本文研究了一类非局部抛物型偏微分方程（PDEs）的良定性，或等效地说是平衡型哈密尔顿-雅可比-贝尔曼方程，它与时不变的随机控制问题中平衡策略和相关价值函数的表征有密切关系。具体而言，我们考虑了时间和空间上的非局部性，这允许对具有初始时间和状态依赖目标函数的随机控制问题进行建模。我们利用连续性方法，在我们提出的巴拿赫空间中展示了线性化的非局部PDE的全局良定性，同时建立了舒尔德尔先验估计。然后，我们采用线性化方法和巴拿赫的不动点论证明了非局部完全非线性情况的局部良定性，而全局良定性是可达到的，前提是有一个非常精确的先验估计。",
    "tldr": "本文研究了一类非局部抛物型偏微分方程的良定性，这与时不变的随机控制问题中平衡策略和相关价值函数的表征有关。通过连续性方法和线性化方法，证明了非局部非线性情况的局部和全局良定性。"
}