{
    "title": "Applied Bayesian Structural Health Monitoring: inclinometer data anomaly detection and forecasting. (arXiv:2307.00305v1 [cs.LG])",
    "abstract": "Inclinometer probes are devices that can be used to measure deformations within earthwork slopes. This paper demonstrates a novel application of Bayesian techniques to real-world inclinometer data, providing both anomaly detection and forecasting. Specifically, this paper details an analysis of data collected from inclinometer data across the entire UK rail network.  Practitioners have effectively two goals when processing monitoring data. The first is to identify any anomalous or dangerous movements, and the second is to predict potential future adverse scenarios by forecasting. In this paper we apply Uncertainty Quantification (UQ) techniques by implementing a Bayesian approach to anomaly detection and forecasting for inclinometer data. Subsequently, both costs and risks may be minimised by quantifying and evaluating the appropriate uncertainties. This framework may then act as an enabler for enhanced decision making and risk analysis.  We show that inclinometer data can be described",
    "link": "http://arxiv.org/abs/2307.00305",
    "context": "Title: Applied Bayesian Structural Health Monitoring: inclinometer data anomaly detection and forecasting. (arXiv:2307.00305v1 [cs.LG])\nAbstract: Inclinometer probes are devices that can be used to measure deformations within earthwork slopes. This paper demonstrates a novel application of Bayesian techniques to real-world inclinometer data, providing both anomaly detection and forecasting. Specifically, this paper details an analysis of data collected from inclinometer data across the entire UK rail network.  Practitioners have effectively two goals when processing monitoring data. The first is to identify any anomalous or dangerous movements, and the second is to predict potential future adverse scenarios by forecasting. In this paper we apply Uncertainty Quantification (UQ) techniques by implementing a Bayesian approach to anomaly detection and forecasting for inclinometer data. Subsequently, both costs and risks may be minimised by quantifying and evaluating the appropriate uncertainties. This framework may then act as an enabler for enhanced decision making and risk analysis.  We show that inclinometer data can be described",
    "path": "papers/23/07/2307.00305.json",
    "total_tokens": 881,
    "translated_title": "应用贝叶斯结构健康监测：测斜仪数据异常检测和预测",
    "translated_abstract": "测斜仪探头是一种可以用来测量土方坡体变形的设备。本文展示了将贝叶斯技术应用于实际测斜仪数据的新颖方法，可以提供异常检测和预测功能。具体来说，本文详细介绍了对整个英国铁路网络中收集的测斜仪数据进行分析的情况。监测数据处理过程中，从业人员通常有两个目标，一是识别任何异常或危险的运动，二是通过预测来预测潜在未来的不良情况。在本文中，我们应用了不确定性量化（UQ）技术，通过实施贝叶斯方法，对测斜仪数据进行异常检测和预测。通过量化和评估适当的不确定性，可以最小化成本和风险。这个框架可以促进增强的决策和风险分析。我们展示了测斜仪数据可以被描述为",
    "tldr": "本文介绍了将贝叶斯技术应用于测斜仪数据的异常检测和预测，并且展示了如何通过量化和评估不确定性来最小化成本和风险。",
    "en_tdlr": "This paper demonstrates the application of Bayesian techniques for anomaly detection and forecasting of inclinometer data, showing how costs and risks can be minimized by quantifying and evaluating uncertainties."
}