{
    "title": "Scale-aware Test-time Click Adaptation for Pulmonary Nodule and Mass Segmentation. (arXiv:2307.15645v1 [eess.IV])",
    "abstract": "Pulmonary nodules and masses are crucial imaging features in lung cancer screening that require careful management in clinical diagnosis. Despite the success of deep learning-based medical image segmentation, the robust performance on various sizes of lesions of nodule and mass is still challenging. In this paper, we propose a multi-scale neural network with scale-aware test-time adaptation to address this challenge. Specifically, we introduce an adaptive Scale-aware Test-time Click Adaptation method based on effortlessly obtainable lesion clicks as test-time cues to enhance segmentation performance, particularly for large lesions. The proposed method can be seamlessly integrated into existing networks. Extensive experiments on both open-source and in-house datasets consistently demonstrate the effectiveness of the proposed method over some CNN and Transformer-based segmentation methods. Our code is available at https://github.com/SplinterLi/SaTTCA",
    "link": "http://arxiv.org/abs/2307.15645",
    "context": "Title: Scale-aware Test-time Click Adaptation for Pulmonary Nodule and Mass Segmentation. (arXiv:2307.15645v1 [eess.IV])\nAbstract: Pulmonary nodules and masses are crucial imaging features in lung cancer screening that require careful management in clinical diagnosis. Despite the success of deep learning-based medical image segmentation, the robust performance on various sizes of lesions of nodule and mass is still challenging. In this paper, we propose a multi-scale neural network with scale-aware test-time adaptation to address this challenge. Specifically, we introduce an adaptive Scale-aware Test-time Click Adaptation method based on effortlessly obtainable lesion clicks as test-time cues to enhance segmentation performance, particularly for large lesions. The proposed method can be seamlessly integrated into existing networks. Extensive experiments on both open-source and in-house datasets consistently demonstrate the effectiveness of the proposed method over some CNN and Transformer-based segmentation methods. Our code is available at https://github.com/SplinterLi/SaTTCA",
    "path": "papers/23/07/2307.15645.json",
    "total_tokens": 867,
    "translated_title": "肺结节和肿块分割的尺度感知测试时点击自适应",
    "translated_abstract": "肺结节和肿块是肺癌筛查中需要仔细处理的关键影像特征。尽管基于深度学习的医学图像分割取得了成功，但对于不同大小的结节和肿块的鲁棒性仍然具有挑战性。在本文中，我们提出了一种多尺度神经网络和尺度感知测试时适应的方法来解决这一挑战。具体而言，我们引入了一种自适应的尺度感知测试时点击自适应方法，基于易获取的病变点击作为测试时的线索，以增强分割性能，特别是对于大的病变。所提出的方法可以无缝集成到现有的网络中。在开源数据集和内部数据集上进行的大量实验证明了所提出方法在一些基于CNN和Transformer的分割方法上的有效性。我们的代码可在https://github.com/SplinterLi/SaTTCA获取。",
    "tldr": "本文提出了一种尺度感知的测试时点击自适应方法，用于肺结节和肿块分割。该方法利用易获取的病变点击来增强分割性能，特别是对于大的病变，实验证明其有效性。",
    "en_tdlr": "This paper proposes a scale-aware test-time click adaptation method for pulmonary nodule and mass segmentation. The method utilizes effortlessly obtainable lesion clicks as test-time cues to enhance segmentation performance, particularly for large lesions, and has been proven effective through extensive experiments."
}