{
    "title": "Guided Bottom-Up Interactive Constraint Acquisition. (arXiv:2307.06126v1 [cs.AI])",
    "abstract": "Constraint Acquisition (CA) systems can be used to assist in the modeling of constraint satisfaction problems. In (inter)active CA, the system is given a set of candidate constraints and posts queries to the user with the goal of finding the right constraints among the candidates. Current interactive CA algorithms suffer from at least two major bottlenecks. First, in order to converge, they require a large number of queries to be asked to the user. Second, they cannot handle large sets of candidate constraints, since these lead to large waiting times for the user. For this reason, the user must have fairly precise knowledge about what constraints the system should consider. In this paper, we alleviate these bottlenecks by presenting two novel methods that improve the efficiency of CA. First, we introduce a bottom-up approach named GrowAcq that reduces the maximum waiting time for the user and allows the system to handle much larger sets of candidate constraints. It also reduces the tot",
    "link": "http://arxiv.org/abs/2307.06126",
    "context": "Title: Guided Bottom-Up Interactive Constraint Acquisition. (arXiv:2307.06126v1 [cs.AI])\nAbstract: Constraint Acquisition (CA) systems can be used to assist in the modeling of constraint satisfaction problems. In (inter)active CA, the system is given a set of candidate constraints and posts queries to the user with the goal of finding the right constraints among the candidates. Current interactive CA algorithms suffer from at least two major bottlenecks. First, in order to converge, they require a large number of queries to be asked to the user. Second, they cannot handle large sets of candidate constraints, since these lead to large waiting times for the user. For this reason, the user must have fairly precise knowledge about what constraints the system should consider. In this paper, we alleviate these bottlenecks by presenting two novel methods that improve the efficiency of CA. First, we introduce a bottom-up approach named GrowAcq that reduces the maximum waiting time for the user and allows the system to handle much larger sets of candidate constraints. It also reduces the tot",
    "path": "papers/23/07/2307.06126.json",
    "total_tokens": 863,
    "translated_title": "Guided Bottom-Up Interactive Constraint Acquisition（指导的自下而上交互式约束获取）",
    "translated_abstract": "约束获取系统可以用于辅助约束满足问题的建模。在交互式约束获取中，系统被给予一组候选约束，并向用户提问以找到候选约束中的正确约束。目前的交互式约束获取算法存在至少两个主要瓶颈。首先，为了收敛，它们需要向用户询问大量的查询。其次，它们无法处理大量的候选约束，因为这会导致用户等待时间较长。因此，用户必须对系统应考虑的约束有相当精确的知识。在本文中，我们通过提出两种改进CA效率的新方法来缓解这些瓶颈。首先，我们引入了一种名为GrowAcq的自下而上方法，它减少了用户的最大等待时间，并使系统能够处理更大的候选约束集。它还减少了总的查询次数，提高了交互式约束获取的效率。",
    "tldr": "该论文提出了两种改进约束获取系统效率的新方法，一种是自下而上的方法，名为GrowAcq，可以减少用户的等待时间和查询次数，提高交互式约束获取的效率。",
    "en_tdlr": "This paper presents two novel methods, including a bottom-up approach called GrowAcq, to improve the efficiency of constraint acquisition system. The new methods reduce the waiting time and query count for the user, significantly enhancing the effectiveness of interactive constraint acquisition."
}