{
    "title": "Abstracting Concept-Changing Rules for Solving Raven's Progressive Matrix Problems. (arXiv:2307.07734v1 [cs.AI])",
    "abstract": "The abstract visual reasoning ability in human intelligence benefits discovering underlying rules in the novel environment. Raven's Progressive Matrix (RPM) is a classic test to realize such ability in machine intelligence by selecting from candidates. Recent studies suggest that solving RPM in an answer-generation way boosts a more in-depth understanding of rules. However, existing generative solvers cannot discover the global concept-changing rules without auxiliary supervision (e.g., rule annotations and distractors in candidate sets). To this end, we propose a deep latent variable model for Concept-changing Rule ABstraction (CRAB) by learning interpretable concepts and parsing concept-changing rules in the latent space. With the iterative learning process, CRAB can automatically abstract global rules shared on the dataset on each concept and form the learnable prior knowledge of global rules. CRAB outperforms the baselines trained without auxiliary supervision in the arbitrary-posi",
    "link": "http://arxiv.org/abs/2307.07734",
    "context": "Title: Abstracting Concept-Changing Rules for Solving Raven's Progressive Matrix Problems. (arXiv:2307.07734v1 [cs.AI])\nAbstract: The abstract visual reasoning ability in human intelligence benefits discovering underlying rules in the novel environment. Raven's Progressive Matrix (RPM) is a classic test to realize such ability in machine intelligence by selecting from candidates. Recent studies suggest that solving RPM in an answer-generation way boosts a more in-depth understanding of rules. However, existing generative solvers cannot discover the global concept-changing rules without auxiliary supervision (e.g., rule annotations and distractors in candidate sets). To this end, we propose a deep latent variable model for Concept-changing Rule ABstraction (CRAB) by learning interpretable concepts and parsing concept-changing rules in the latent space. With the iterative learning process, CRAB can automatically abstract global rules shared on the dataset on each concept and form the learnable prior knowledge of global rules. CRAB outperforms the baselines trained without auxiliary supervision in the arbitrary-posi",
    "path": "papers/23/07/2307.07734.json",
    "total_tokens": 992,
    "translated_title": "用于解决Raven的渐进矩阵问题的概念变化规则提取",
    "translated_abstract": "人类智能中的抽象视觉推理能力有助于在新环境中发现潜在规则。 Raven的渐进矩阵（RPM）是一种经典的测试方法，通过从候选项中选择来实现机器智能中的这种能力。最近的研究表明，以生成答案的方式解决RPM可以增进对规则的更深入理解。然而，现有的生成求解器在没有辅助监督（例如，规则注释和候选项中的干扰项）的情况下无法发现全局的概念变化规则。为此，我们提出了一种用于概念变化规则提取的深度潜变量模型（Concept-changing Rule ABstraction，CRAB），通过学习可解释的概念并解析潜空间中的概念变化规则。通过迭代学习过程，CRAB可以自动提取每个概念上在数据集上共享的全局规则，并形成可学习的全局规则的先验知识。与无辅助监督训练的基线相比，CRAB在任意位置的规则发现和答案生成方面表现优异。",
    "tldr": "本论文提出了一个用于提取概念变化规则的深度模型CRAB，通过学习可解释的概念和解析潜空间中的规则，实现了在Raven的渐进矩阵问题中无需辅助监督的全局规则发现和答案生成，实验证明了该模型优于无监督训练的基线模型。"
}