{
    "title": "SegNetr: Rethinking the local-global interactions and skip connections in U-shaped networks. (arXiv:2307.02953v1 [eess.IV])",
    "abstract": "Recently, U-shaped networks have dominated the field of medical image segmentation due to their simple and easily tuned structure. However, existing U-shaped segmentation networks: 1) mostly focus on designing complex self-attention modules to compensate for the lack of long-term dependence based on convolution operation, which increases the overall number of parameters and computational complexity of the network; 2) simply fuse the features of encoder and decoder, ignoring the connection between their spatial locations. In this paper, we rethink the above problem and build a lightweight medical image segmentation network, called SegNetr. Specifically, we introduce a novel SegNetr block that can perform local-global interactions dynamically at any stage and with only linear complexity. At the same time, we design a general information retention skip connection (IRSC) to preserve the spatial location information of encoder features and achieve accurate fusion with the decoder features. ",
    "link": "http://arxiv.org/abs/2307.02953",
    "context": "Title: SegNetr: Rethinking the local-global interactions and skip connections in U-shaped networks. (arXiv:2307.02953v1 [eess.IV])\nAbstract: Recently, U-shaped networks have dominated the field of medical image segmentation due to their simple and easily tuned structure. However, existing U-shaped segmentation networks: 1) mostly focus on designing complex self-attention modules to compensate for the lack of long-term dependence based on convolution operation, which increases the overall number of parameters and computational complexity of the network; 2) simply fuse the features of encoder and decoder, ignoring the connection between their spatial locations. In this paper, we rethink the above problem and build a lightweight medical image segmentation network, called SegNetr. Specifically, we introduce a novel SegNetr block that can perform local-global interactions dynamically at any stage and with only linear complexity. At the same time, we design a general information retention skip connection (IRSC) to preserve the spatial location information of encoder features and achieve accurate fusion with the decoder features. ",
    "path": "papers/23/07/2307.02953.json",
    "total_tokens": 892,
    "translated_title": "SegNetr：重新思考U型网络中的局部-全局交互和跳跃连接",
    "translated_abstract": "最近，由于其简单且易于调整的结构，U型网络在医学图像分割领域占据主导地位。然而，现有的U型分割网络存在以下问题：1）主要关注设计复杂的自注意力模块，以弥补基于卷积操作的长期依赖性的缺失，从而增加了网络的总参数和计算复杂性；2）简单地融合编码器和解码器的特征，忽略了它们空间位置之间的连接。本文中，我们重新思考了上述问题，并构建了一种轻量级的医学图像分割网络，称为SegNetr。具体地，我们引入了一种新颖的SegNetr块，可以在任何阶段动态地进行局部-全局交互，并且具有线性复杂度。同时，我们设计了一个通用的信息保留跳跃连接（IRSC），以保留编码器特征的空间位置信息，并与解码器特征实现精确融合。",
    "tldr": "这个论文提出了一种轻量级的医学图像分割网络SegNetr，通过引入SegNetr块和信息保留跳跃连接实现了动态的局部-全局交互和编码器-解码器特征的精确融合。",
    "en_tdlr": "This paper proposes a lightweight medical image segmentation network called SegNetr, which achieves dynamic local-global interactions and accurate fusion of encoder-decoder features through the introduction of SegNetr blocks and information retention skip connections."
}