{
    "title": "Recovering high-quality FODs from a reduced number of diffusion-weighted images using a model-driven deep learning architecture. (arXiv:2307.15273v1 [cs.CV])",
    "abstract": "Fibre orientation distribution (FOD) reconstruction using deep learning has the potential to produce accurate FODs from a reduced number of diffusion-weighted images (DWIs), decreasing total imaging time. Diffusion acquisition invariant representations of the DWI signals are typically used as input to these methods to ensure that they can be applied flexibly to data with different b-vectors and b-values; however, this means the network cannot condition its output directly on the DWI signal. In this work, we propose a spherical deconvolution network, a model-driven deep learning FOD reconstruction architecture, that ensures intermediate and output FODs produced by the network are consistent with the input DWI signals. Furthermore, we implement a fixel classification penalty within our loss function, encouraging the network to produce FODs that can subsequently be segmented into the correct number of fixels and improve downstream fixel-based analysis. Our results show that the model-base",
    "link": "http://arxiv.org/abs/2307.15273",
    "context": "Title: Recovering high-quality FODs from a reduced number of diffusion-weighted images using a model-driven deep learning architecture. (arXiv:2307.15273v1 [cs.CV])\nAbstract: Fibre orientation distribution (FOD) reconstruction using deep learning has the potential to produce accurate FODs from a reduced number of diffusion-weighted images (DWIs), decreasing total imaging time. Diffusion acquisition invariant representations of the DWI signals are typically used as input to these methods to ensure that they can be applied flexibly to data with different b-vectors and b-values; however, this means the network cannot condition its output directly on the DWI signal. In this work, we propose a spherical deconvolution network, a model-driven deep learning FOD reconstruction architecture, that ensures intermediate and output FODs produced by the network are consistent with the input DWI signals. Furthermore, we implement a fixel classification penalty within our loss function, encouraging the network to produce FODs that can subsequently be segmented into the correct number of fixels and improve downstream fixel-based analysis. Our results show that the model-base",
    "path": "papers/23/07/2307.15273.json",
    "total_tokens": 827,
    "translated_title": "使用基于模型的深度学习架构从减少数量的扩散加权图像中恢复高质量的FOD",
    "translated_abstract": "使用深度学习对纤维定向分布（FOD）进行重建有可能从减少数量的扩散加权图像（DWI）中产生准确的FOD，从而减少总成像时间。本文提出了一种球形去卷积网络，即基于模型的深度学习的FOD重建架构，确保网络产生的中间和输出的FOD与输入的DWI信号一致。此外，我们在损失函数中实施了一项fixel分类惩罚，鼓励网络产生能够进一步分割为正确数量的fixel并改善下游fixel-based分析的FOD。结果显示，该模型基于...",
    "tldr": "本文提出了一种基于模型的深度学习架构，用于从减少数量的扩散加权图像中恢复高质量的纤维定向分布（FOD），并通过引入fixel分类惩罚来提高下游分析的准确性。",
    "en_tdlr": "The paper presents a model-driven deep learning architecture for recovering high-quality fiber orientation distributions (FODs) from a reduced number of diffusion-weighted images (DWIs). The proposed method incorporates a fixel classification penalty to improve downstream analysis accuracy."
}