{
    "title": "A Regional Analysis of Electric LDV Portfolio Choices by Vehicle Manufacturers. (arXiv:2307.03808v1 [econ.GN])",
    "abstract": "Global light duty electric vehicle (EV) sales exceeded 10.5 million units in 2022, with a year-on-year growth of 55%, but these trends differ regionally. Despite the robust growth, upfront purchase price remains a challenge for consumers in different regions, and thus, OEMs make technology choices to respond to market needs. This paper examines the electrification portfolio choices of three major automotive manufacturers (OEMs) in different regions of the world, including Europe, Americas, Asia Pacific, and Africa/Middle-East. The analysis focuses on trends in dominant segments for Battery Electric Vehicles (BEV) and Plug-in Hybrid Electric Vehicles (PHEV), as well as battery chemistry choices. Regional differences show a trend towards SUVs for both BEVs and PHEVs. Tesla's dominance in the BEV market influences battery chemistry choices. Average battery sizes for BEVs remain similar in Europe and Americas, but lower in Asia Pacific and Africa/Middle East.",
    "link": "http://arxiv.org/abs/2307.03808",
    "context": "Title: A Regional Analysis of Electric LDV Portfolio Choices by Vehicle Manufacturers. (arXiv:2307.03808v1 [econ.GN])\nAbstract: Global light duty electric vehicle (EV) sales exceeded 10.5 million units in 2022, with a year-on-year growth of 55%, but these trends differ regionally. Despite the robust growth, upfront purchase price remains a challenge for consumers in different regions, and thus, OEMs make technology choices to respond to market needs. This paper examines the electrification portfolio choices of three major automotive manufacturers (OEMs) in different regions of the world, including Europe, Americas, Asia Pacific, and Africa/Middle-East. The analysis focuses on trends in dominant segments for Battery Electric Vehicles (BEV) and Plug-in Hybrid Electric Vehicles (PHEV), as well as battery chemistry choices. Regional differences show a trend towards SUVs for both BEVs and PHEVs. Tesla's dominance in the BEV market influences battery chemistry choices. Average battery sizes for BEVs remain similar in Europe and Americas, but lower in Asia Pacific and Africa/Middle East.",
    "path": "papers/23/07/2307.03808.json",
    "total_tokens": 907,
    "translated_title": "电动轻型车辆制造商的区域性分析",
    "translated_abstract": "2022年，全球轻型电动车销量超过1050万辆，同比增长55％，但这些趋势在不同地区有所不同。尽管销量增长强劲，但前期购买价格仍然是消费者面临的挑战，因此汽车制造商会做出技术选择以满足市场需求。本文研究了三大汽车制造商在欧洲、美洲、亚太地区和非洲/中东地区不同地区的电动化产品系列选择。分析重点关注电池电动车（BEV）和插电混合动力车（PHEV）的主导市场趋势，以及电池化学选择。区域差异表明SUV成为BEV和PHEV的主流趋势。特斯拉在BEV市场的主导地位影响着电池化学选择。在欧洲和美洲，BEV的平均电池容量保持相似，而在亚太地区和非洲/中东地区较低。",
    "tldr": "本文通过研究三大汽车制造商在全球不同地区的电动化产品系列选择，发现区域间存在车型偏好差异，并且特斯拉在BEV市场的主导地位影响了电池化学的选择。",
    "en_tdlr": "This paper examines the electrification portfolio choices of three major automotive manufacturers in different regions of the world and finds regional differences in vehicle preferences, with Tesla's dominance in the BEV market influencing battery chemistry choices."
}