{
    "title": "Unraveling the Trade-off between Sustainability and Returns: A Multivariate Utility Analysis. (arXiv:2307.12161v1 [q-fin.PM])",
    "abstract": "This paper proposes an expected multivariate utility analysis for ESG investors in which green stocks, brown stocks, and a market index are modeled in a one-factor, CAPM-type structure. This setting allows investors to accommodate their preferences for green investments according to proper risk aversion levels. We find closed-form solutions for optimal allocations, wealth and value functions. As by-products, we first demonstrate that investors do not need to reduce their pecuniary satisfaction in order to increase green investments. Secondly, we propose a parameterization to capture investors' preferences for green assets over brown or market assets, independent of performance. The paper uses the RepRisk Rating of U.S. stocks from 2010 to 2020 to select companies that are representative of various ESG ratings. Our empirical analysis reveals drastic increases in wealth allocation toward high-rated ESG stocks for ESG-sensitive investors; this holds even as the overall level of pecuniary ",
    "link": "http://arxiv.org/abs/2307.12161",
    "context": "Title: Unraveling the Trade-off between Sustainability and Returns: A Multivariate Utility Analysis. (arXiv:2307.12161v1 [q-fin.PM])\nAbstract: This paper proposes an expected multivariate utility analysis for ESG investors in which green stocks, brown stocks, and a market index are modeled in a one-factor, CAPM-type structure. This setting allows investors to accommodate their preferences for green investments according to proper risk aversion levels. We find closed-form solutions for optimal allocations, wealth and value functions. As by-products, we first demonstrate that investors do not need to reduce their pecuniary satisfaction in order to increase green investments. Secondly, we propose a parameterization to capture investors' preferences for green assets over brown or market assets, independent of performance. The paper uses the RepRisk Rating of U.S. stocks from 2010 to 2020 to select companies that are representative of various ESG ratings. Our empirical analysis reveals drastic increases in wealth allocation toward high-rated ESG stocks for ESG-sensitive investors; this holds even as the overall level of pecuniary ",
    "path": "papers/23/07/2307.12161.json",
    "total_tokens": 958,
    "translated_title": "揭示可持续发展与回报之间的权衡：一种多元效用分析",
    "translated_abstract": "本文提出了一种针对ESG投资者的预期多元效用分析，其中将绿色股票、褐色股票和市场指数建模为单因素的CAPM结构。该模型允许投资者根据适当的风险规避水平适应其对绿色投资的偏好。我们找到了最优配置、财富和价值函数的封闭解。作为副产品，我们首先证明投资者不需要减少经济满意度以增加绿色投资。其次，我们提出了一种参数化方法来捕捉投资者对绿色资产的偏好，与绩效无关。本文使用2010年至2020年美国股票的RepRisk评级来选择代表各种ESG评级的公司。我们的实证分析显示，对于ESG敏感的投资者，向高评级ESG股票的财富配置出现了急剧增加；即使在经济满意度总体水平降低的情况下，这一趋势仍然持续。",
    "tldr": "本文提出了一种预期多元效用分析方法，允许ESG投资者根据风险规避水平适应其对绿色投资的偏好，并找到了最优配置和价值函数的解。实证分析表明，ESG敏感的投资者在选择高评级ESG股票时财富配置显著增加。"
}