{
    "title": "Real-time Workload Pattern Analysis for Large-scale Cloud Databases. (arXiv:2307.02626v1 [cs.DB])",
    "abstract": "Hosting database services on cloud systems has become a common practice. This has led to the increasing volume of database workloads, which provides the opportunity for pattern analysis. Discovering workload patterns from a business logic perspective is conducive to better understanding the trends and characteristics of the database system. However, existing workload pattern discovery systems are not suitable for large-scale cloud databases which are commonly employed by the industry. This is because the workload patterns of large-scale cloud databases are generally far more complicated than those of ordinary databases. In this paper, we propose Alibaba Workload Miner (AWM), a real-time system for discovering workload patterns in complicated large-scale workloads. AWM encodes and discovers the SQL query patterns logged from user requests and optimizes the querying processing based on the discovered patterns. First, Data Collection & Preprocessing Module collects streaming query logs an",
    "link": "http://arxiv.org/abs/2307.02626",
    "context": "Title: Real-time Workload Pattern Analysis for Large-scale Cloud Databases. (arXiv:2307.02626v1 [cs.DB])\nAbstract: Hosting database services on cloud systems has become a common practice. This has led to the increasing volume of database workloads, which provides the opportunity for pattern analysis. Discovering workload patterns from a business logic perspective is conducive to better understanding the trends and characteristics of the database system. However, existing workload pattern discovery systems are not suitable for large-scale cloud databases which are commonly employed by the industry. This is because the workload patterns of large-scale cloud databases are generally far more complicated than those of ordinary databases. In this paper, we propose Alibaba Workload Miner (AWM), a real-time system for discovering workload patterns in complicated large-scale workloads. AWM encodes and discovers the SQL query patterns logged from user requests and optimizes the querying processing based on the discovered patterns. First, Data Collection & Preprocessing Module collects streaming query logs an",
    "path": "papers/23/07/2307.02626.json",
    "total_tokens": 906,
    "translated_title": "大规模云数据库的实时工作负载模式分析",
    "translated_abstract": "在云系统上托管数据库服务已成为常见做法，这导致数据库工作负载的增加，为模式分析提供了机会。从商业逻辑的角度发现工作负载模式有助于更好地了解数据库系统的趋势和特征。然而，现有的工作负载模式发现系统不适用于通常由行业使用的大规模云数据库。这是因为大规模云数据库的工作负载模式通常比普通数据库复杂得多。在本文中，我们提出了阿里巴巴工作负载矿工(AWM)，这是一个用于在复杂大规模工作负载中发现工作负载模式的实时系统。AWM对用户请求的日志记录的SQL查询模式进行编码和发现，并基于发现的模式优化查询处理。首先，数据收集和预处理模块收集流式查询日志，并对日志数据进",
    "tldr": "该论文提出了阿里巴巴工作负载矿工(AWM)，一个实时系统，用于在复杂的大规模工作负载中发现工作负载模式。通过对用户请求的SQL查询模式进行编码和发现，并基于发现的模式优化查询处理。该系统适用于大规模云数据库，可以更好地理解数据库系统的趋势和特征。",
    "en_tdlr": "This paper proposes Alibaba Workload Miner (AWM), a real-time system for discovering workload patterns in complicated large-scale workloads. It encodes and discovers the SQL query patterns logged from user requests and optimizes the querying processing based on the discovered patterns. AWM is suitable for large-scale cloud databases and facilitates better understanding of the trends and characteristics of the database system."
}