{
    "title": "Adaptive Graph Convolution Networks for Traffic Flow Forecasting. (arXiv:2307.05517v1 [cs.LG])",
    "abstract": "Traffic flow forecasting is a highly challenging task due to the dynamic spatial-temporal road conditions. Graph neural networks (GNN) has been widely applied in this task. However, most of these GNNs ignore the effects of time-varying road conditions due to the fixed range of the convolution receptive field. In this paper, we propose a novel Adaptive Graph Convolution Networks (AGC-net) to address this issue in GNN. The AGC-net is constructed by the Adaptive Graph Convolution (AGC) based on a novel context attention mechanism, which consists of a set of graph wavelets with various learnable scales. The AGC transforms the spatial graph representations into time-sensitive features considering the temporal context. Moreover, a shifted graph convolution kernel is designed to enhance the AGC, which attempts to correct the deviations caused by inaccurate topology. Experimental results on two public traffic datasets demonstrate the effectiveness of the AGC-net\\footnote{Code is available at: ",
    "link": "http://arxiv.org/abs/2307.05517",
    "context": "Title: Adaptive Graph Convolution Networks for Traffic Flow Forecasting. (arXiv:2307.05517v1 [cs.LG])\nAbstract: Traffic flow forecasting is a highly challenging task due to the dynamic spatial-temporal road conditions. Graph neural networks (GNN) has been widely applied in this task. However, most of these GNNs ignore the effects of time-varying road conditions due to the fixed range of the convolution receptive field. In this paper, we propose a novel Adaptive Graph Convolution Networks (AGC-net) to address this issue in GNN. The AGC-net is constructed by the Adaptive Graph Convolution (AGC) based on a novel context attention mechanism, which consists of a set of graph wavelets with various learnable scales. The AGC transforms the spatial graph representations into time-sensitive features considering the temporal context. Moreover, a shifted graph convolution kernel is designed to enhance the AGC, which attempts to correct the deviations caused by inaccurate topology. Experimental results on two public traffic datasets demonstrate the effectiveness of the AGC-net\\footnote{Code is available at: ",
    "path": "papers/23/07/2307.05517.json",
    "total_tokens": 912,
    "translated_title": "自适应图卷积网络用于交通流量预测",
    "translated_abstract": "交通流量预测是一项非常具有挑战性的任务，由于动态的时空道路条件。图神经网络（GNN）已广泛应用于该任务。然而，大多数这些GNN忽略了时间变化的道路条件的影响，因为卷积感受野的范围是固定的。在本文中，我们提出了一种新颖的自适应图卷积网络（AGC-net）来解决GNN中的这个问题。AGC-net是通过基于新颖的上下文注意机制的自适应图卷积（AGC）构建的，该机制由一组具有各种可学习尺度的图小波组成。AGC将空间图表示转化为考虑时间上下文的时间敏感特征。此外，设计了一种偏移图卷积核以增强AGC，它试图纠正由不准确的拓扑引起的偏差。两个公共交通数据集上的实验结果证明了AGC-net的有效性。",
    "tldr": "本论文提出了一种自适应图卷积网络（AGC-net）用于解决交通流量预测中GNN的时间变化问题，通过自适应图卷积（AGC）和上下文注意机制来考虑时间上下文，以提高预测性能。",
    "en_tdlr": "This paper proposes an adaptive graph convolution network (AGC-net) to address the time-varying issue in traffic flow forecasting using GNN, by employing adaptive graph convolution (AGC) and context attention mechanism to consider the temporal context and improve prediction performance."
}