{
    "title": "NSA: Naturalistic Support Artifact to Boost Network Confidence. (arXiv:2307.14917v1 [cs.CV])",
    "abstract": "Visual AI systems are vulnerable to natural and synthetic physical corruption in the real-world. Such corruption often arises unexpectedly and alters the model's performance. In recent years, the primary focus has been on adversarial attacks. However, natural corruptions (e.g., snow, fog, dust) are an omnipresent threat to visual AI systems and should be considered equally important. Many existing works propose interesting solutions to train robust models against natural corruption. These works either leverage image augmentations, which come with the additional cost of model training, or place suspicious patches in the scene to design unadversarial examples. In this work, we propose the idea of naturalistic support artifacts (NSA) for robust prediction. The NSAs are shown to be beneficial in scenarios where model parameters are inaccessible and adding artifacts in the scene is feasible. The NSAs are natural looking objects generated through artifact training using DC-GAN to have high v",
    "link": "http://arxiv.org/abs/2307.14917",
    "context": "Title: NSA: Naturalistic Support Artifact to Boost Network Confidence. (arXiv:2307.14917v1 [cs.CV])\nAbstract: Visual AI systems are vulnerable to natural and synthetic physical corruption in the real-world. Such corruption often arises unexpectedly and alters the model's performance. In recent years, the primary focus has been on adversarial attacks. However, natural corruptions (e.g., snow, fog, dust) are an omnipresent threat to visual AI systems and should be considered equally important. Many existing works propose interesting solutions to train robust models against natural corruption. These works either leverage image augmentations, which come with the additional cost of model training, or place suspicious patches in the scene to design unadversarial examples. In this work, we propose the idea of naturalistic support artifacts (NSA) for robust prediction. The NSAs are shown to be beneficial in scenarios where model parameters are inaccessible and adding artifacts in the scene is feasible. The NSAs are natural looking objects generated through artifact training using DC-GAN to have high v",
    "path": "papers/23/07/2307.14917.json",
    "total_tokens": 927,
    "translated_title": "NSA: 自然支持性物件以提高网络的可信度",
    "translated_abstract": "视觉人工智能系统容易受到现实世界中自然和合成物理破坏的影响。这种破坏通常出现意外并改变模型的性能。近年来，主要关注的是对抗性攻击。然而，自然破坏（例如雪、雾、尘土）对于视觉人工智能系统来说是一个无处不在的威胁，同样应该被视为重要。许多现有的作品提出了有趣的解决方案，用于训练抗击自然破坏的强大模型。这些作品要么利用图像增强，这会增加模型培训的成本，要么在场景中放置可疑的补丁来设计非对抗性示例。在这项工作中，我们提出了自然支持性物件（NSA）的概念来进行稳健预测。NSAs在模型参数不可访问且在场景中添加物件可行的情况下显示出益处。NSAs是通过使用DC-GAN进行物件训练生成的自然外观物件，具有较高的可视真实性。",
    "tldr": "这项工作提出了自然支持性物件（NSA）的概念，用于训练稳健的视觉人工智能模型以抵御自然破坏。NSAs是通过使用DC-GAN进行物件训练生成的自然外观物件。",
    "en_tdlr": "This work proposes the concept of naturalistic support artifacts (NSAs) for training robust visual AI models against natural corruptions. NSAs are natural-looking objects generated through artifact training using DC-GAN."
}