{
    "title": "The Impacts of Registration Regime Implementation on IPO Pricing Efficiency. (arXiv:2307.09669v1 [q-fin.GN])",
    "abstract": "We study the impacts of regime changes and related rule implementations on IPOs initial return for China entrepreneurial boards (ChiNext and STAR). We propose that an initial return contains the issuer fair value and an investors overreaction and examine their magnitudes and determinants. Our findings reveal an evolution of IPO pricing in response to the progression of regulation changes along four dimensions: 1) governing regulation regime, 2) listing day trading restrictions, 3) listing rules for issuers, and 4) participation requirements for investors. We find that the most efficient regulation regime in Chinese IPO pricing has four characteristics: 1) registration system, 2) no hard return caps nor trading curbs that restrict the initial return; 3) more specific listing rules for issuers, and 4) more stringent participation requirements for investors. In all contexts, we show that the registration regime governing the STAR IPOs offers the most efficient pricing.",
    "link": "http://arxiv.org/abs/2307.09669",
    "context": "Title: The Impacts of Registration Regime Implementation on IPO Pricing Efficiency. (arXiv:2307.09669v1 [q-fin.GN])\nAbstract: We study the impacts of regime changes and related rule implementations on IPOs initial return for China entrepreneurial boards (ChiNext and STAR). We propose that an initial return contains the issuer fair value and an investors overreaction and examine their magnitudes and determinants. Our findings reveal an evolution of IPO pricing in response to the progression of regulation changes along four dimensions: 1) governing regulation regime, 2) listing day trading restrictions, 3) listing rules for issuers, and 4) participation requirements for investors. We find that the most efficient regulation regime in Chinese IPO pricing has four characteristics: 1) registration system, 2) no hard return caps nor trading curbs that restrict the initial return; 3) more specific listing rules for issuers, and 4) more stringent participation requirements for investors. In all contexts, we show that the registration regime governing the STAR IPOs offers the most efficient pricing.",
    "path": "papers/23/07/2307.09669.json",
    "total_tokens": 869,
    "translated_title": "注册制度实施对IPO定价效率的影响",
    "translated_abstract": "我们研究了制度变革和相关规则实施对中国创业板（创业板和科创板）IPO初始回报的影响。我们提出了初始回报包含发行人公允价值和投资者过度反应，并检验了它们的大小和决定因素。我们的发现揭示了IPO定价在四个维度上随着监管变革的推进而发生的演变：1）治理监管制度，2）上市日交易限制，3）发行人上市规则和4）投资者参与要求。我们发现，中国IPO定价中最有效的监管制度具有以下四个特点：1）注册制度，2）没有限制初始回报的硬性回报上限或交易限制；3）更具体的发行人上市规则，和4）更严格的投资者参与要求。在所有情况下，我们表明，治理科创板IPO的注册制度提供了最有效的定价。",
    "tldr": "本研究研究了中国科创板IPO定价的演变以及与制度变革和实施相关的影响。结果显示，在所有情况下，治理科创板IPO的注册制度提供了最有效的定价。",
    "en_tdlr": "This study examines the evolution of IPO pricing in the context of China's STAR board and the impact of regime changes and implementations. The findings suggest that the registration regime governing the STAR IPOs offers the most efficient pricing."
}