{
    "title": "A max-affine spline approximation of neural networks using the Legendre transform of a convex-concave representation. (arXiv:2307.09602v1 [cs.LG])",
    "abstract": "This work presents a novel algorithm for transforming a neural network into a spline representation. Unlike previous work that required convex and piecewise-affine network operators to create a max-affine spline alternate form, this work relaxes this constraint. The only constraint is that the function be bounded and possess a well-define second derivative, although this was shown experimentally to not be strictly necessary. It can also be performed over the whole network rather than on each layer independently. As in previous work, this bridges the gap between neural networks and approximation theory but also enables the visualisation of network feature maps. Mathematical proof and experimental investigation of the technique is performed with approximation error and feature maps being extracted from a range of architectures, including convolutional neural networks.",
    "link": "http://arxiv.org/abs/2307.09602",
    "context": "Title: A max-affine spline approximation of neural networks using the Legendre transform of a convex-concave representation. (arXiv:2307.09602v1 [cs.LG])\nAbstract: This work presents a novel algorithm for transforming a neural network into a spline representation. Unlike previous work that required convex and piecewise-affine network operators to create a max-affine spline alternate form, this work relaxes this constraint. The only constraint is that the function be bounded and possess a well-define second derivative, although this was shown experimentally to not be strictly necessary. It can also be performed over the whole network rather than on each layer independently. As in previous work, this bridges the gap between neural networks and approximation theory but also enables the visualisation of network feature maps. Mathematical proof and experimental investigation of the technique is performed with approximation error and feature maps being extracted from a range of architectures, including convolutional neural networks.",
    "path": "papers/23/07/2307.09602.json",
    "total_tokens": 833,
    "translated_title": "使用凸凹表示的Legendre变换将神经网络转化为max-affine样条近似",
    "translated_abstract": "本文提出了一种将神经网络转化为样条表示的新算法。与以前需要凸多边形和分段线性网络操作符来创建max-affine样条形式的方法不同，本文放宽了这个约束。唯一的约束是函数应该是有界的，并且具有明确定义的二阶导数，尽管通过实验表明这并不是严格必需的。这种方法也可以在整个网络上执行，而不是在每个层上独立执行。与以前的工作一样，这填补了神经网络和逼近理论之间的差距，同时也实现了网络特征图的可视化。通过从一系列架构中提取逼近误差和特征图进行数学证明和实验研究。",
    "tldr": "这项工作提出了一种将神经网络转化为样条表示的新算法，它不再需要凸多边形和分段线性网络操作符的限制，并且可以在整个网络上执行。这项工作不仅填补了神经网络和逼近理论之间的差距，还使得网络特征图的可视化成为可能。",
    "en_tdlr": "This work presents a novel algorithm for transforming a neural network into a spline representation without the need for convex polygons and piecewise-linear network operators. The algorithm can be applied to the entire network and bridges the gap between neural networks and approximation theory, while also enabling the visualization of network feature maps."
}