{
    "title": "Pluvio: Assembly Clone Search for Out-of-domain Architectures and Libraries through Transfer Learning and Conditional Variational Information Bottleneck. (arXiv:2307.10631v1 [cs.SE])",
    "abstract": "The practice of code reuse is crucial in software development for a faster and more efficient development lifecycle. In reality, however, code reuse practices lack proper control, resulting in issues such as vulnerability propagation and intellectual property infringements. Assembly clone search, a critical shift-right defence mechanism, has been effective in identifying vulnerable code resulting from reuse in released executables. Recent studies on assembly clone search demonstrate a trend towards using machine learning-based methods to match assembly code variants produced by different toolchains. However, these methods are limited to what they learn from a small number of toolchain variants used in training, rendering them inapplicable to unseen architectures and their corresponding compilation toolchain variants.  This paper presents the first study on the problem of assembly clone search with unseen architectures and libraries. We propose incorporating human common knowledge throu",
    "link": "http://arxiv.org/abs/2307.10631",
    "context": "Title: Pluvio: Assembly Clone Search for Out-of-domain Architectures and Libraries through Transfer Learning and Conditional Variational Information Bottleneck. (arXiv:2307.10631v1 [cs.SE])\nAbstract: The practice of code reuse is crucial in software development for a faster and more efficient development lifecycle. In reality, however, code reuse practices lack proper control, resulting in issues such as vulnerability propagation and intellectual property infringements. Assembly clone search, a critical shift-right defence mechanism, has been effective in identifying vulnerable code resulting from reuse in released executables. Recent studies on assembly clone search demonstrate a trend towards using machine learning-based methods to match assembly code variants produced by different toolchains. However, these methods are limited to what they learn from a small number of toolchain variants used in training, rendering them inapplicable to unseen architectures and their corresponding compilation toolchain variants.  This paper presents the first study on the problem of assembly clone search with unseen architectures and libraries. We propose incorporating human common knowledge throu",
    "path": "papers/23/07/2307.10631.json",
    "total_tokens": 945,
    "translated_title": "Pluvio:通过迁移学习和条件变分信息瓶颈实现对领域外结构和库的汇编克隆搜索",
    "translated_abstract": "代码重用在软件开发中至关重要，可以加快和提高开发生命周期的效率。然而，实际中，代码重用存在着控制不当的问题，导致漏洞传播和知识产权侵权等问题。汇编克隆搜索是一种重要的右移防御机制，已经在识别由已发布的可执行文件中的代码重用导致的漏洞方面取得了良好效果。最近关于汇编克隆搜索的研究表明，越来越多采用基于机器学习的方法来匹配由不同工具链生成的汇编代码变体。然而，这些方法仅限于从训练中学习到的少数工具链变体，无法应用于未见过的架构及其相应的编译工具链变体。本文首次研究了在未见过的架构和库中的汇编克隆搜索问题。我们提议通过人类共有知识来解决这个问题。",
    "tldr": "本论文介绍了一种通过迁移学习和条件变分信息瓶颈实现对领域外结构和库的汇编克隆搜索的方法。已有的方法往往限制于少数训练过的工具链变体，而本研究首次解决了未见过架构和库的情况，提出了一种新的解决方案。",
    "en_tdlr": "This paper presents a method for assembly clone search for out-of-domain architectures and libraries using transfer learning and conditional variational information bottleneck. Existing methods are limited to a small number of trained toolchain variants, while this research addresses previously unseen architectures and libraries, proposing a new solution."
}