{
    "title": "Space Engage: Collaborative Space Supervision for Contrastive-based Semi-Supervised Semantic Segmentation. (arXiv:2307.09755v1 [cs.CV])",
    "abstract": "Semi-Supervised Semantic Segmentation (S4) aims to train a segmentation model with limited labeled images and a substantial volume of unlabeled images. To improve the robustness of representations, powerful methods introduce a pixel-wise contrastive learning approach in latent space (i.e., representation space) that aggregates the representations to their prototypes in a fully supervised manner. However, previous contrastive-based S4 methods merely rely on the supervision from the model's output (logits) in logit space during unlabeled training. In contrast, we utilize the outputs in both logit space and representation space to obtain supervision in a collaborative way. The supervision from two spaces plays two roles: 1) reduces the risk of over-fitting to incorrect semantic information in logits with the help of representations; 2) enhances the knowledge exchange between the two spaces. Furthermore, unlike previous approaches, we use the similarity between representations and prototyp",
    "link": "http://arxiv.org/abs/2307.09755",
    "context": "Title: Space Engage: Collaborative Space Supervision for Contrastive-based Semi-Supervised Semantic Segmentation. (arXiv:2307.09755v1 [cs.CV])\nAbstract: Semi-Supervised Semantic Segmentation (S4) aims to train a segmentation model with limited labeled images and a substantial volume of unlabeled images. To improve the robustness of representations, powerful methods introduce a pixel-wise contrastive learning approach in latent space (i.e., representation space) that aggregates the representations to their prototypes in a fully supervised manner. However, previous contrastive-based S4 methods merely rely on the supervision from the model's output (logits) in logit space during unlabeled training. In contrast, we utilize the outputs in both logit space and representation space to obtain supervision in a collaborative way. The supervision from two spaces plays two roles: 1) reduces the risk of over-fitting to incorrect semantic information in logits with the help of representations; 2) enhances the knowledge exchange between the two spaces. Furthermore, unlike previous approaches, we use the similarity between representations and prototyp",
    "path": "papers/23/07/2307.09755.json",
    "total_tokens": 911,
    "translated_title": "Space Engage: 基于对比的半监督语义分割的协同空间监督",
    "translated_abstract": "半监督语义分割旨在利用有限的标记图像和大量的未标记图像训练分割模型。为了提高表示的鲁棒性，强大的方法在潜在空间（即表示空间）中引入了像素级的对比学习方法，以全监督的方式将表示聚合到其原型中。然而，先前基于对比的半监督方法仅依赖于未标记训练中模型输出（logits）在logit空间中的监督。相反，我们利用logit空间和表示空间中的输出来协同获得监督。两个空间的监督发挥两个作用：1）借助表示减少在logits中过度拟合错误的语义信息的风险；2）增强两个空间之间的知识交流。此外，与先前的方法不同，我们使用表示与原型之间的相似性来衡量对比学习的能力，从而提高模型的性能。",
    "tldr": "基于对比的半监督语义分割方法通常仅依赖于logit空间中的监督，而我们提出了一种协同空间监督方法，利用logit空间和表示空间的输出来提高模型性能和减少过拟合风险。",
    "en_tdlr": "Contrastive-based semi-supervised semantic segmentation methods typically only rely on supervision in logit space, while we propose a collaborative space supervision method that utilizes outputs in both logit space and representation space to improve model performance and reduce overfitting risk."
}