{
    "title": "ConFL: Constraint-guided Fuzzing for Machine Learning Framework. (arXiv:2307.05642v1 [cs.SE])",
    "abstract": "As machine learning gains prominence in various sectors of society for automated decision-making, concerns have risen regarding potential vulnerabilities in machine learning (ML) frameworks. Nevertheless, testing these frameworks is a daunting task due to their intricate implementation. Previous research on fuzzing ML frameworks has struggled to effectively extract input constraints and generate valid inputs, leading to extended fuzzing durations for deep execution or revealing the target crash.  In this paper, we propose ConFL, a constraint-guided fuzzer for ML frameworks. ConFL automatically extracting constraints from kernel codes without the need for any prior knowledge. Guided by the constraints, ConFL is able to generate valid inputs that can pass the verification and explore deeper paths of kernel codes. In addition, we design a grouping technique to boost the fuzzing efficiency.  To demonstrate the effectiveness of ConFL, we evaluated its performance mainly on Tensorflow. We fi",
    "link": "http://arxiv.org/abs/2307.05642",
    "context": "Title: ConFL: Constraint-guided Fuzzing for Machine Learning Framework. (arXiv:2307.05642v1 [cs.SE])\nAbstract: As machine learning gains prominence in various sectors of society for automated decision-making, concerns have risen regarding potential vulnerabilities in machine learning (ML) frameworks. Nevertheless, testing these frameworks is a daunting task due to their intricate implementation. Previous research on fuzzing ML frameworks has struggled to effectively extract input constraints and generate valid inputs, leading to extended fuzzing durations for deep execution or revealing the target crash.  In this paper, we propose ConFL, a constraint-guided fuzzer for ML frameworks. ConFL automatically extracting constraints from kernel codes without the need for any prior knowledge. Guided by the constraints, ConFL is able to generate valid inputs that can pass the verification and explore deeper paths of kernel codes. In addition, we design a grouping technique to boost the fuzzing efficiency.  To demonstrate the effectiveness of ConFL, we evaluated its performance mainly on Tensorflow. We fi",
    "path": "papers/23/07/2307.05642.json",
    "total_tokens": 882,
    "translated_title": "ConFL：用于机器学习框架的约束引导模糊测试",
    "translated_abstract": "随着机器学习在各个社会领域中自动决策的重要性不断增加，人们对机器学习（ML）框架的潜在漏洞产生了担忧。然而，由于这些框架的复杂实现，对它们进行测试是一项艰巨的任务。以往关于对ML框架进行模糊测试的研究一直面临着有效提取输入约束和生成有效输入的困难，导致深度执行的模糊测试持续时间过长或无法揭示目标崩溃。本文提出了一种称为ConFL的约束引导模糊器，用于ML框架。ConFL能够自动从内核代码中提取约束，而无需任何先前知识。在约束的指导下，ConFL能够生成能够通过验证并探索更深内核代码路径的有效输入。此外，我们设计了一种分组技术来提高模糊测试的效率。为了证明ConFL的有效性，我们主要在Tensorflow上评估了其性能。",
    "tldr": "本文介绍了一种约束引导模糊测试器ConFL，可以从机器学习框架中自动提取约束，并生成能够通过验证和探索更深路径的有效输入。",
    "en_tdlr": "This paper proposes ConFL, a constraint-guided fuzzer for machine learning frameworks. ConFL automatically extracts constraints from kernel codes and generates valid inputs that can pass verification and explore deeper paths."
}