{
    "title": "Causative Cyberattacks on Online Learning-based Automated Demand Response Systems. (arXiv:2307.15175v1 [eess.SY])",
    "abstract": "Power utilities are adopting Automated Demand Response (ADR) to replace the costly fuel-fired generators and to preempt congestion during peak electricity demand. Similarly, third-party Demand Response (DR) aggregators are leveraging controllable small-scale electrical loads to provide on-demand grid support services to the utilities. Some aggregators and utilities have started employing Artificial Intelligence (AI) to learn the energy usage patterns of electricity consumers and use this knowledge to design optimal DR incentives. Such AI frameworks use open communication channels between the utility/aggregator and the DR customers, which are vulnerable to \\textit{causative} data integrity cyberattacks. This paper explores vulnerabilities of AI-based DR learning and designs a data-driven attack strategy informed by DR data collected from the New York University (NYU) campus buildings. The case study demonstrates the feasibility and effects of maliciously tampering with (i) real-time DR ",
    "link": "http://arxiv.org/abs/2307.15175",
    "context": "Title: Causative Cyberattacks on Online Learning-based Automated Demand Response Systems. (arXiv:2307.15175v1 [eess.SY])\nAbstract: Power utilities are adopting Automated Demand Response (ADR) to replace the costly fuel-fired generators and to preempt congestion during peak electricity demand. Similarly, third-party Demand Response (DR) aggregators are leveraging controllable small-scale electrical loads to provide on-demand grid support services to the utilities. Some aggregators and utilities have started employing Artificial Intelligence (AI) to learn the energy usage patterns of electricity consumers and use this knowledge to design optimal DR incentives. Such AI frameworks use open communication channels between the utility/aggregator and the DR customers, which are vulnerable to \\textit{causative} data integrity cyberattacks. This paper explores vulnerabilities of AI-based DR learning and designs a data-driven attack strategy informed by DR data collected from the New York University (NYU) campus buildings. The case study demonstrates the feasibility and effects of maliciously tampering with (i) real-time DR ",
    "path": "papers/23/07/2307.15175.json",
    "total_tokens": 906,
    "translated_title": "在线学习型自动需求响应系统上的因果性网络攻击",
    "translated_abstract": "电力公用事业正在采用自动需求响应（ADR）来替代昂贵的燃煤发电机，并在电力需求高峰期预防拥塞。同样，第三方需求响应（DR）聚合器正在利用可控的小规模电力负荷为公用事业提供按需的电网支持服务。一些聚合器和公用事业开始应用人工智能（AI）来了解电力消费者的能源使用模式，并利用这一知识来设计最佳的DR激励措施。这样的AI框架使用了公用事业/聚合器和DR客户之间的开放通信渠道，这些通道容易受到\\textit{因果性}数据完整性网络攻击的威胁。本文探讨了基于AI的DR学习的漏洞，并设计了一种数据驱动的攻击策略，该策略利用从纽约大学（NYU）校园建筑中收集的DR数据进行了信息收集。该案例研究证明了恶意篡改（i）实时DR的可行性和效果",
    "tldr": "该论文研究了在线学习型自动需求响应系统存在的因果性网络攻击漏洞，并设计了一种数据驱动的攻击策略来模拟对实时需求响应的恶意篡改。",
    "en_tdlr": "This paper explores vulnerabilities in online learning-based automated demand response systems and designs a data-driven attack strategy to simulate malicious tampering with real-time demand response."
}