{
    "title": "Optimal Approximation of Zonoids and Uniform Approximation by Shallow Neural Networks. (arXiv:2307.15285v1 [stat.ML])",
    "abstract": "We study the following two related problems. The first is to determine to what error an arbitrary zonoid in $\\mathbb{R}^{d+1}$ can be approximated in the Hausdorff distance by a sum of $n$ line segments. The second is to determine optimal approximation rates in the uniform norm for shallow ReLU$^k$ neural networks on their variation spaces. The first of these problems has been solved for $d\\neq 2,3$, but when $d=2,3$ a logarithmic gap between the best upper and lower bounds remains. We close this gap, which completes the solution in all dimensions. For the second problem, our techniques significantly improve upon existing approximation rates when $k\\geq 1$, and enable uniform approximation of both the target function and its derivatives.",
    "link": "http://arxiv.org/abs/2307.15285",
    "context": "Title: Optimal Approximation of Zonoids and Uniform Approximation by Shallow Neural Networks. (arXiv:2307.15285v1 [stat.ML])\nAbstract: We study the following two related problems. The first is to determine to what error an arbitrary zonoid in $\\mathbb{R}^{d+1}$ can be approximated in the Hausdorff distance by a sum of $n$ line segments. The second is to determine optimal approximation rates in the uniform norm for shallow ReLU$^k$ neural networks on their variation spaces. The first of these problems has been solved for $d\\neq 2,3$, but when $d=2,3$ a logarithmic gap between the best upper and lower bounds remains. We close this gap, which completes the solution in all dimensions. For the second problem, our techniques significantly improve upon existing approximation rates when $k\\geq 1$, and enable uniform approximation of both the target function and its derivatives.",
    "path": "papers/23/07/2307.15285.json",
    "total_tokens": 929,
    "translated_title": "Zonoid的最优逼近和浅层神经网络的均匀逼近",
    "translated_abstract": "我们研究了以下两个相关问题。第一个问题是确定一个任意的在$\\mathbb{R}^{d+1}$空间中的Zonoid可以通过$n$个线段的Hausdorff距离来逼近的误差。第二个问题是确定浅层ReLU$^k$神经网络在其变分空间中的均匀范数的最优逼近率。第一个问题已经在$d \\neq 2, 3$时得到解决，但当$d = 2, 3$时，最优上界和最优下界之间仍存在一个对数差距。我们填补了这个差距，完成了所有维度上的解决方案。对于第二个问题，我们的技术在$k \\geq 1$时显著提高了现有的逼近率，并实现了目标函数及其导数的均匀逼近。",
    "tldr": "本论文解决了Zonoid的最优逼近和浅层神经网络的均匀逼近两个问题。对于Zonoid的逼近，我们填补了在$d=2,3$时的对数差距，实现了在所有维度上的解决方案。对于神经网络的逼近，我们的技术在$k \\geq 1$时显著提高了目前的逼近率，并能够均匀逼近目标函数及其导数。",
    "en_tdlr": "This paper addresses the optimal approximation of Zonoids and the uniform approximation by shallow neural networks. For the Zonoid approximation, the logarithmic gap in the best upper and lower bounds is closed in all dimensions. For the neural network approximation, the proposed techniques significantly improve the existing rates and allow for the uniform approximation of both the target function and its derivatives."
}