{
    "title": "Federated Multi-Agent Deep Reinforcement Learning for Dynamic and Flexible 3D Operation of 5G Multi-MAP Networks. (arXiv:2307.06842v1 [cs.NI])",
    "abstract": "This paper addresses the efficient management of Mobile Access Points (MAPs), which are Unmanned Aerial Vehicles (UAV), in 5G networks. We propose a two-level hierarchical architecture, which dynamically reconfigures the network while considering Integrated Access-Backhaul (IAB) constraints. The high-layer decision process determines the number of MAPs through consensus, and we develop a joint optimization process to account for co-dependence in network self-management. In the low-layer, MAPs manage their placement using a double-attention based Deep Reinforcement Learning (DRL) model that encourages cooperation without retraining. To improve generalization and reduce complexity, we propose a federated mechanism for training and sharing one placement model for every MAP in the low-layer. Additionally, we jointly optimize the placement and backhaul connectivity of MAPs using a multi-objective reward function, considering the impact of varying MAP placement on wireless backhaul connectiv",
    "link": "http://arxiv.org/abs/2307.06842",
    "context": "Title: Federated Multi-Agent Deep Reinforcement Learning for Dynamic and Flexible 3D Operation of 5G Multi-MAP Networks. (arXiv:2307.06842v1 [cs.NI])\nAbstract: This paper addresses the efficient management of Mobile Access Points (MAPs), which are Unmanned Aerial Vehicles (UAV), in 5G networks. We propose a two-level hierarchical architecture, which dynamically reconfigures the network while considering Integrated Access-Backhaul (IAB) constraints. The high-layer decision process determines the number of MAPs through consensus, and we develop a joint optimization process to account for co-dependence in network self-management. In the low-layer, MAPs manage their placement using a double-attention based Deep Reinforcement Learning (DRL) model that encourages cooperation without retraining. To improve generalization and reduce complexity, we propose a federated mechanism for training and sharing one placement model for every MAP in the low-layer. Additionally, we jointly optimize the placement and backhaul connectivity of MAPs using a multi-objective reward function, considering the impact of varying MAP placement on wireless backhaul connectiv",
    "path": "papers/23/07/2307.06842.json",
    "total_tokens": 1036,
    "translated_title": "面向动态和灵活的5G多MAP网络操作的联邦多智能体深度强化学习",
    "translated_abstract": "本文研究了在5G网络中高效管理移动接入点(MAPs)，MAPs是无人机(UAV)。我们提出了一个两级分层架构，通过考虑综合接入-回传(IAB)约束来动态重配置网络。高层决策过程通过共识确定MAPs的数量，我们开发了一个联合优化过程来考虑网络自管理中的相互依赖关系。在低层，MAPs使用基于双注意力的深度强化学习(DRL)模型进行位置管理，鼓励合作而无需重新训练。为了提高泛化能力和降低复杂性，我们提出了一种联邦机制，用于在低层训练和共享每个MAP的一个位置模型。此外，我们使用多目标奖励函数共同优化MAPs的位置和回传连接，考虑到不同MAP位置对无线回传的影响。",
    "tldr": "本文提出了一个联邦多智能体深度强化学习的架构，用于动态和灵活地操作5G多MAP网络。在高层决策中，通过共识确定MAPs的数量并考虑网络自管理的相互依赖关系。在低层，使用一个双注意力的DRL模型来管理MAPs的位置，同时提出了一个联邦机制来训练和共享每个MAP的位置模型。最后，通过多目标奖励函数共同优化MAPs的位置和回传连接。",
    "en_tdlr": "This paper proposes a federated multi-agent deep reinforcement learning architecture for dynamic and flexible operation of 5G multi-MAP networks. The high-level decision process determines the number of MAPs through consensus and considers the interdependency in network self-management. In the low-level, a double-attention based DRL model is used to manage the placement of MAPs, and a federated mechanism is proposed for training and sharing individual MAP's placement models. Finally, the placement and backhaul connectivity of MAPs are jointly optimized using a multi-objective reward function."
}