{
    "title": "Human Trajectory Forecasting with Explainable Behavioral Uncertainty. (arXiv:2307.01817v1 [cs.CV])",
    "abstract": "Human trajectory forecasting helps to understand and predict human behaviors, enabling applications from social robots to self-driving cars, and therefore has been heavily investigated. Most existing methods can be divided into model-free and model-based methods. Model-free methods offer superior prediction accuracy but lack explainability, while model-based methods provide explainability but cannot predict well. Combining both methodologies, we propose a new Bayesian Neural Stochastic Differential Equation model BNSP-SFM, where a behavior SDE model is combined with Bayesian neural networks (BNNs). While the NNs provide superior predictive power, the SDE offers strong explainability with quantifiable uncertainty in behavior and observation. We show that BNSP-SFM achieves up to a 50% improvement in prediction accuracy, compared with 11 state-of-the-art methods. BNSP-SFM also generalizes better to drastically different scenes with different environments and crowd densities (~ 20 times hi",
    "link": "http://arxiv.org/abs/2307.01817",
    "context": "Title: Human Trajectory Forecasting with Explainable Behavioral Uncertainty. (arXiv:2307.01817v1 [cs.CV])\nAbstract: Human trajectory forecasting helps to understand and predict human behaviors, enabling applications from social robots to self-driving cars, and therefore has been heavily investigated. Most existing methods can be divided into model-free and model-based methods. Model-free methods offer superior prediction accuracy but lack explainability, while model-based methods provide explainability but cannot predict well. Combining both methodologies, we propose a new Bayesian Neural Stochastic Differential Equation model BNSP-SFM, where a behavior SDE model is combined with Bayesian neural networks (BNNs). While the NNs provide superior predictive power, the SDE offers strong explainability with quantifiable uncertainty in behavior and observation. We show that BNSP-SFM achieves up to a 50% improvement in prediction accuracy, compared with 11 state-of-the-art methods. BNSP-SFM also generalizes better to drastically different scenes with different environments and crowd densities (~ 20 times hi",
    "path": "papers/23/07/2307.01817.json",
    "total_tokens": 1004,
    "translated_title": "具有可解释行为不确定性的人类轨迹预测",
    "translated_abstract": "人类轨迹预测有助于理解和预测人类行为，可以应用于社交机器人到自动驾驶汽车等各种场景，并且一直受到深入研究。现有方法可以分为基于模型和基于模型的方法。基于模型的方法提供了可解释性，但预测能力有限，而基于模型的方法提供了较好的预测能力，但缺乏可解释性。结合这两种方法，我们提出了一种新的贝叶斯神经随机微分方程模型BNSP-SFM，其中行为SDE模型与贝叶斯神经网络（BNNs）相结合。虽然神经网络提供了较好的预测能力，SDE提供了强大的可解释性和行为和观察的可量化不确定性。我们展示了BNSP-SFM相比于11种最先进的方法，预测精度提高了多达50％。BNSP-SFM还能更好地推广到不同环境和人群密度的截然不同场景中（约20倍）。",
    "tldr": "本研究提出了一种新的人类轨迹预测模型BNSP-SFM，将行为SDE模型与贝叶斯神经网络相结合，能够提供较好的预测能力和强大的可解释性。与11种最先进的方法相比，BNSP-SFM在预测精度上取得了多达50％的改进。这种模型在不同环境和人群密度的场景中也能够更好地推广。",
    "en_tdlr": "This study proposes a new model, BNSP-SFM, for human trajectory forecasting that combines a behavior SDE model and Bayesian neural networks. It achieves improved prediction accuracy by up to 50% compared to state-of-the-art methods and provides both strong explainability and predictive power. The model also generalizes well in different environments and crowd densities."
}