{
    "title": "When Dialects Collide: How Socioeconomic Mixing Affects Language Use. (arXiv:2307.10016v1 [physics.soc-ph] CROSS LISTED)",
    "abstract": "The socioeconomic background of people and how they use standard forms of language are not independent, as demonstrated in various sociolinguistic studies. However, the extent to which these correlations may be influenced by the mixing of people from different socioeconomic classes remains relatively unexplored from a quantitative perspective. In this work we leverage geotagged tweets and transferable computational methods to map deviations from standard English on a large scale, in seven thousand administrative areas of England and Wales. We combine these data with high-resolution income maps to assign a proxy socioeconomic indicator to home-located users. Strikingly, across eight metropolitan areas we find a consistent pattern suggesting that the more different socioeconomic classes mix, the less interdependent the frequency of their departures from standard grammar and their income become. Further, we propose an agent-based model of linguistic variety adoption that sheds light on th",
    "link": "http://arxiv.org/abs/2307.10016",
    "context": "Title: When Dialects Collide: How Socioeconomic Mixing Affects Language Use. (arXiv:2307.10016v1 [physics.soc-ph] CROSS LISTED)\nAbstract: The socioeconomic background of people and how they use standard forms of language are not independent, as demonstrated in various sociolinguistic studies. However, the extent to which these correlations may be influenced by the mixing of people from different socioeconomic classes remains relatively unexplored from a quantitative perspective. In this work we leverage geotagged tweets and transferable computational methods to map deviations from standard English on a large scale, in seven thousand administrative areas of England and Wales. We combine these data with high-resolution income maps to assign a proxy socioeconomic indicator to home-located users. Strikingly, across eight metropolitan areas we find a consistent pattern suggesting that the more different socioeconomic classes mix, the less interdependent the frequency of their departures from standard grammar and their income become. Further, we propose an agent-based model of linguistic variety adoption that sheds light on th",
    "path": "papers/23/07/2307.10016.json",
    "total_tokens": 885,
    "translated_title": "方言的碰撞：社会经济交叉对语言使用的影响",
    "translated_abstract": "人们的社会经济背景与他们使用标准语言的方式并不独立，这在各种社会语言学研究中已经得到证明。然而，不同社会经济阶层的人们交叉混合可能对这些相关性造成何种影响，在定量角度上尚未得到充分探索。在这项工作中，我们利用带地理标记的推特和可转移的计算方法，在英格兰和威尔士的七千个行政区域上对与标准英语偏离的情况进行大规模映射。我们将这些数据与高分辨率的收入地图结合起来，为居住地用户分配一个代理社会经济指标。令人惊讶的是，在八个大都市区域，我们发现一种一致的模式，表明不同社会经济阶层的人们混合得越多，其偏离标准语法和收入的频率就越不相互依存。",
    "tldr": "本研究使用地理标记的推特数据和计算方法，在英格兰和威尔士的七千个行政区域上进行了大规模映射，发现社会经济交叉影响了语言使用，混合不同社会经济阶层的人群频率偏离标准语法的程度越高，其收入关联越弱。"
}