{
    "title": "Modeling Inverse Demand Function with Explainable Dual Neural Networks. (arXiv:2307.14322v1 [q-fin.CP])",
    "abstract": "Financial contagion has been widely recognized as a fundamental risk to the financial system. Particularly potent is price-mediated contagion, wherein forced liquidations by firms depress asset prices and propagate financial stress, enabling crises to proliferate across a broad spectrum of seemingly unrelated entities. Price impacts are currently modeled via exogenous inverse demand functions. However, in real-world scenarios, only the initial shocks and the final equilibrium asset prices are typically observable, leaving actual asset liquidations largely obscured. This missing data presents significant limitations to calibrating the existing models. To address these challenges, we introduce a novel dual neural network structure that operates in two sequential stages: the first neural network maps initial shocks to predicted asset liquidations, and the second network utilizes these liquidations to derive resultant equilibrium prices. This data-driven approach can capture both linear an",
    "link": "http://arxiv.org/abs/2307.14322",
    "context": "Title: Modeling Inverse Demand Function with Explainable Dual Neural Networks. (arXiv:2307.14322v1 [q-fin.CP])\nAbstract: Financial contagion has been widely recognized as a fundamental risk to the financial system. Particularly potent is price-mediated contagion, wherein forced liquidations by firms depress asset prices and propagate financial stress, enabling crises to proliferate across a broad spectrum of seemingly unrelated entities. Price impacts are currently modeled via exogenous inverse demand functions. However, in real-world scenarios, only the initial shocks and the final equilibrium asset prices are typically observable, leaving actual asset liquidations largely obscured. This missing data presents significant limitations to calibrating the existing models. To address these challenges, we introduce a novel dual neural network structure that operates in two sequential stages: the first neural network maps initial shocks to predicted asset liquidations, and the second network utilizes these liquidations to derive resultant equilibrium prices. This data-driven approach can capture both linear an",
    "path": "papers/23/07/2307.14322.json",
    "total_tokens": 893,
    "translated_title": "用可解释的双重神经网络建模反向需求函数",
    "translated_abstract": "金融传染被广泛认为是金融系统的基本风险。特别强大的是基于价格的传染，其中公司的强制清算压低资产价格并传播金融压力，使危机能够在看似无关的实体之间广泛蔓延。目前，价格影响是通过外生的反向需求函数建模的。然而，在实际场景中，通常只能观察到初始冲击和最终的均衡资产价格，导致实际资产清算在很大程度上被隐藏。这些缺失的数据给校准现有模型带来了显著的局限性。为了解决这些挑战，我们引入了一种新的双重神经网络结构，它在两个连续的阶段中运作：第一个神经网络将初始冲击映射到预测的资产清算中，第二个网络利用这些清算来推导出结果均衡价格。这种数据驱动的方法可以捕捉线性和非线性程度更高的需求函数。",
    "tldr": "本研究提出了一种新的双重神经网络结构，用于建模金融传染中的反向需求函数。该方法能够通过预测资产清算和推导均衡价格来解决实际场景中的数据缺失问题。"
}