{
    "title": "Combinatorial Auctions and Graph Neural Networks for Local Energy Flexibility Markets. (arXiv:2307.13470v1 [cs.LG])",
    "abstract": "This paper proposes a new combinatorial auction framework for local energy flexibility markets, which addresses the issue of prosumers' inability to bundle multiple flexibility time intervals. To solve the underlying NP-complete winner determination problems, we present a simple yet powerful heterogeneous tri-partite graph representation and design graph neural network-based models. Our models achieve an average optimal value deviation of less than 5\\% from an off-the-shelf optimization tool and show linear inference time complexity compared to the exponential complexity of the commercial solver. Contributions and results demonstrate the potential of using machine learning to efficiently allocate energy flexibility resources in local markets and solving optimization problems in general.",
    "link": "http://arxiv.org/abs/2307.13470",
    "context": "Title: Combinatorial Auctions and Graph Neural Networks for Local Energy Flexibility Markets. (arXiv:2307.13470v1 [cs.LG])\nAbstract: This paper proposes a new combinatorial auction framework for local energy flexibility markets, which addresses the issue of prosumers' inability to bundle multiple flexibility time intervals. To solve the underlying NP-complete winner determination problems, we present a simple yet powerful heterogeneous tri-partite graph representation and design graph neural network-based models. Our models achieve an average optimal value deviation of less than 5\\% from an off-the-shelf optimization tool and show linear inference time complexity compared to the exponential complexity of the commercial solver. Contributions and results demonstrate the potential of using machine learning to efficiently allocate energy flexibility resources in local markets and solving optimization problems in general.",
    "path": "papers/23/07/2307.13470.json",
    "total_tokens": 771,
    "translated_title": "组合拍卖和图神经网络在本地能量灵活市场中的应用",
    "translated_abstract": "本文提出了一个新的组合拍卖框架用于本地能量灵活市场，解决了生产者无法打包多个灵活时间间隔的问题。为了解决底层的NP完全获胜者决定问题，我们提出了一个简单但强大的异构三部图表示，并设计了基于图神经网络的模型。我们的模型与现成的优化工具相比，平均最优值偏差小于5％，并且与商业求解器的指数复杂度相比，展现出线性推理时间复杂度。贡献和结果展示了在本地市场中使用机器学习来高效分配能量灵活资源以及解决优化问题的潜力。",
    "tldr": "本研究提出了一个新的组合拍卖框架用于本地能量灵活市场，通过设计图神经网络模型解决了NP完全的问题，实验结果显示了使用机器学习在本地市场中分配能量灵活资源的潜力。",
    "en_tdlr": "This study proposes a new combinatorial auction framework for local energy flexibility markets and solves the NP-complete problem by designing graph neural network models. The experimental results demonstrate the potential of using machine learning to allocate energy flexibility resources in local markets."
}