{
    "title": "Testing different Log Bases For Vector Model Weighting Technique. (arXiv:2307.06213v1 [cs.IR])",
    "abstract": "Information retrieval systems retrieves relevant documents based on a query submitted by the user. The documents are initially indexed and the words in the documents are assigned weights using a weighting technique called TFIDF which is the product of Term Frequency (TF) and Inverse Document Frequency (IDF). TF represents the number of occurrences of a term in a document. IDF measures whether the term is common or rare across all documents. It is computed by dividing the total number of documents in the system by the number of documents containing the term and then computing the logarithm of the quotient. By default, we use base 10 to calculate the logarithm. In this paper, we are going to test this weighting technique by using a range of log bases from 0.1 to 100.0 to calculate the IDF. Testing different log bases for vector model weighting technique is to highlight the importance of understanding the performance of the system at different weighting values. We use the documents of MED",
    "link": "http://arxiv.org/abs/2307.06213",
    "context": "Title: Testing different Log Bases For Vector Model Weighting Technique. (arXiv:2307.06213v1 [cs.IR])\nAbstract: Information retrieval systems retrieves relevant documents based on a query submitted by the user. The documents are initially indexed and the words in the documents are assigned weights using a weighting technique called TFIDF which is the product of Term Frequency (TF) and Inverse Document Frequency (IDF). TF represents the number of occurrences of a term in a document. IDF measures whether the term is common or rare across all documents. It is computed by dividing the total number of documents in the system by the number of documents containing the term and then computing the logarithm of the quotient. By default, we use base 10 to calculate the logarithm. In this paper, we are going to test this weighting technique by using a range of log bases from 0.1 to 100.0 to calculate the IDF. Testing different log bases for vector model weighting technique is to highlight the importance of understanding the performance of the system at different weighting values. We use the documents of MED",
    "path": "papers/23/07/2307.06213.json",
    "total_tokens": 826,
    "translated_title": "测试不同对数底数的向量模型加权技术",
    "translated_abstract": "信息检索系统根据用户提交的查询检索相关文档。文档首先被索引，文档中的词语使用称为TFIDF的加权技术被赋予权重，TFIDF是词频（TF）和逆文档频率（IDF）的乘积。TF代表词项在文档中出现的次数。IDF衡量词项在所有文档中的普遍程度。它通过将系统中的总文档数除以包含该词项的文档数，然后计算商的对数来计算。默认情况下，我们使用以10为底的对数计算。在本文中，我们将使用从0.1到100.0的一系列对数底数来计算IDF，以测试这种加权技术。测试不同对数底数的向量模型加权技术的目的是突出在不同加权数值下了解系统性能的重要性。我们使用MED的文档。",
    "tldr": "本论文测试了在向量模型加权技术中使用不同对数底数的效果，以突出在不同加权数值下了解系统性能的重要性。",
    "en_tdlr": "This paper tests the effectiveness of using different log bases in vector model weighting technique, highlighting the importance of understanding system performance at different weighting values."
}