{
    "title": "HIVA: Holographic Intellectual Voice Assistant. (arXiv:2307.05501v1 [cs.HC])",
    "abstract": "Holographic Intellectual Voice Assistant (HIVA) aims to facilitate human computer interaction using audiovisual effects and 3D avatar. HIVA provides complete information about the university, including requests of various nature: admission, study issues, fees, departments, university structure and history, canteen, human resources, library, student life and events, information about the country and the city, etc. There are other ways for receiving the data listed above: the university's official website and other supporting apps, HEI (Higher Education Institution) official social media, directly asking the HEI staff, and other channels. However, HIVA provides the unique experience of \"face-to-face\" interaction with an animated 3D mascot, helping to get a sense of 'real-life' communication. The system includes many sub-modules and connects a family of applications such as mobile applications, Telegram chatbot, suggestion categorization, and entertainment services. The Voice assistant us",
    "link": "http://arxiv.org/abs/2307.05501",
    "context": "Title: HIVA: Holographic Intellectual Voice Assistant. (arXiv:2307.05501v1 [cs.HC])\nAbstract: Holographic Intellectual Voice Assistant (HIVA) aims to facilitate human computer interaction using audiovisual effects and 3D avatar. HIVA provides complete information about the university, including requests of various nature: admission, study issues, fees, departments, university structure and history, canteen, human resources, library, student life and events, information about the country and the city, etc. There are other ways for receiving the data listed above: the university's official website and other supporting apps, HEI (Higher Education Institution) official social media, directly asking the HEI staff, and other channels. However, HIVA provides the unique experience of \"face-to-face\" interaction with an animated 3D mascot, helping to get a sense of 'real-life' communication. The system includes many sub-modules and connects a family of applications such as mobile applications, Telegram chatbot, suggestion categorization, and entertainment services. The Voice assistant us",
    "path": "papers/23/07/2307.05501.json",
    "total_tokens": 879,
    "translated_title": "HIVA: 全息智能语音助手",
    "translated_abstract": "全息智能语音助手（HIVA）旨在利用视听效果和3D动画来促进人机交互。HIVA提供有关大学的完整信息，包括各种自然请求：入学，学习问题，学费，院系，大学结构和历史，食堂，人力资源，图书馆，学生生活和活动，以及有关该国家和城市的信息等。获取上述数据的其他方式包括大学官方网站和其他支持应用程序，高等教育机构（HEI）官方社交媒体，直接向高等教育机构工作人员提问等。然而，HIVA提供了与动画3D吉祥物的“面对面”交互的独特体验，帮助人们获得“现实生活”交流的感觉。该系统包括许多子模块，并连接了一系列应用程序，如移动应用程序、Telegram聊天机器人、建议分类和娱乐服务。",
    "tldr": "HIVA 是一个全息智能语音助手，通过视听效果和3D动画促进人机交互。它提供大学的各种信息，支持\"面对面\"交流，并提供多个子模块和连接其他应用程序的功能。",
    "en_tdlr": "HIVA is a holographic intelligent voice assistant that facilitates human computer interaction through audiovisual effects and 3D animation. It provides various information about the university, supports \"face-to-face\" interaction, and includes multiple sub-modules and connections to other applications."
}