{
    "title": "Guideline for Trustworthy Artificial Intelligence -- AI Assessment Catalog. (arXiv:2307.03681v1 [cs.CY])",
    "abstract": "Artificial Intelligence (AI) has made impressive progress in recent years and represents a key technology that has a crucial impact on the economy and society. However, it is clear that AI and business models based on it can only reach their full potential if AI applications are developed according to high quality standards and are effectively protected against new AI risks. For instance, AI bears the risk of unfair treatment of individuals when processing personal data e.g., to support credit lending or staff recruitment decisions. The emergence of these new risks is closely linked to the fact that the behavior of AI applications, particularly those based on Machine Learning (ML), is essentially learned from large volumes of data and is not predetermined by fixed programmed rules.  Thus, the issue of the trustworthiness of AI applications is crucial and is the subject of numerous major publications by stakeholders in politics, business and society. In addition, there is mutual agreeme",
    "link": "http://arxiv.org/abs/2307.03681",
    "context": "Title: Guideline for Trustworthy Artificial Intelligence -- AI Assessment Catalog. (arXiv:2307.03681v1 [cs.CY])\nAbstract: Artificial Intelligence (AI) has made impressive progress in recent years and represents a key technology that has a crucial impact on the economy and society. However, it is clear that AI and business models based on it can only reach their full potential if AI applications are developed according to high quality standards and are effectively protected against new AI risks. For instance, AI bears the risk of unfair treatment of individuals when processing personal data e.g., to support credit lending or staff recruitment decisions. The emergence of these new risks is closely linked to the fact that the behavior of AI applications, particularly those based on Machine Learning (ML), is essentially learned from large volumes of data and is not predetermined by fixed programmed rules.  Thus, the issue of the trustworthiness of AI applications is crucial and is the subject of numerous major publications by stakeholders in politics, business and society. In addition, there is mutual agreeme",
    "path": "papers/23/07/2307.03681.json",
    "total_tokens": 881,
    "translated_title": "可信人工智能准则--AI评估目录",
    "translated_abstract": "人工智能（AI）近年来取得了令人瞩目的进展，并代表着一项对经济和社会具有重要影响的关键技术。然而，很明显，只有按照高质量标准开发AI应用并有效防范新的AI风险，AI和基于其的商业模式才能充分发挥其潜力。例如，当处理个人数据（例如，支持信贷借款或员工招聘决策）时，AI存在不公平对待个体的风险。这些新风险的出现与AI应用的行为密切相关，尤其是基于机器学习（ML）的应用，其行为基本上是从大量数据中学习而来，而不是由固定编程规则预先确定的。因此，AI应用的可信度问题至关重要，是政治、商业和社会利益相关者众多重要出版物的主题。",
    "tldr": "上述论文提出了一个可信人工智能准则--AI评估目录，旨在确保AI应用按照高质量标准开发，并有效防范新的AI风险，从而使AI发挥其潜力，减少不公平对待个体的风险。",
    "en_tdlr": "The paper introduces a guideline for trustworthy artificial intelligence - the AI assessment catalog, aiming to ensure the development of AI applications according to high quality standards and effectively mitigate new AI risks, thus allowing AI to reach its full potential and reduce the risk of unfair treatment of individuals."
}