{
    "title": "GHOST: A Graph Neural Network Accelerator using Silicon Photonics. (arXiv:2307.01782v1 [cs.AR])",
    "abstract": "Graph neural networks (GNNs) have emerged as a powerful approach for modelling and learning from graph-structured data. Multiple fields have since benefitted enormously from the capabilities of GNNs, such as recommendation systems, social network analysis, drug discovery, and robotics. However, accelerating and efficiently processing GNNs require a unique approach that goes beyond conventional artificial neural network accelerators, due to the substantial computational and memory requirements of GNNs. The slowdown of scaling in CMOS platforms also motivates a search for alternative implementation substrates. In this paper, we present GHOST, the first silicon-photonic hardware accelerator for GNNs. GHOST efficiently alleviates the costs associated with both vertex-centric and edge-centric operations. It implements separately the three main stages involved in running GNNs in the optical domain, allowing it to be used for the inference of various widely used GNN models and architectures, ",
    "link": "http://arxiv.org/abs/2307.01782",
    "context": "Title: GHOST: A Graph Neural Network Accelerator using Silicon Photonics. (arXiv:2307.01782v1 [cs.AR])\nAbstract: Graph neural networks (GNNs) have emerged as a powerful approach for modelling and learning from graph-structured data. Multiple fields have since benefitted enormously from the capabilities of GNNs, such as recommendation systems, social network analysis, drug discovery, and robotics. However, accelerating and efficiently processing GNNs require a unique approach that goes beyond conventional artificial neural network accelerators, due to the substantial computational and memory requirements of GNNs. The slowdown of scaling in CMOS platforms also motivates a search for alternative implementation substrates. In this paper, we present GHOST, the first silicon-photonic hardware accelerator for GNNs. GHOST efficiently alleviates the costs associated with both vertex-centric and edge-centric operations. It implements separately the three main stages involved in running GNNs in the optical domain, allowing it to be used for the inference of various widely used GNN models and architectures, ",
    "path": "papers/23/07/2307.01782.json",
    "total_tokens": 868,
    "translated_title": "GHOST:一种使用硅光子学的图神经网络加速器",
    "translated_abstract": "图神经网络（GNN）已经成为一种强大的建模和学习图结构数据的方法。GNN的能力已经在推荐系统、社交网络分析、药物发现和机器人领域等多个领域得到了巨大的益处。然而，加速和高效处理GNN需要一种超越传统人工神经网络加速器的独特方法，这是由于GNN具有巨大的计算和存储需求。CMOS平台缩放的减速也推动了对替代实现基体的寻求。在本文中，我们提出了GHOST，这是第一个用于GNN的硅光子硬件加速器。GHOST高效地减轻了与顶点和边操作相关的成本。它在光学领域中分别实现了运行GNN所涉及的三个主要阶段，使其可以用于各种广泛使用的GNN模型和架构的推理。",
    "tldr": "GHOST是第一个使用硅光子学的图神经网络加速器，高效地处理和加速GNN，克服了传统加速器的缺点，使得它可以应用于各种GNN模型和架构的推理。"
}