{
    "title": "Indicatori comuni del PNRR e framework SDGs: una proposta di indicatore composito. (arXiv:2307.11039v1 [econ.GN])",
    "abstract": "The main component of the NextGeneration EU (NGEU) program is the Recovery and Resilience Facility (RRF), spanning an implementation period between 2021 and 2026. The RRF also includes a monitoring system: every six months, each country is required to send an update on the progress of the plan against 14 common indicators, measured on specific quantitative scales. The aim of this paper is to present the first empirical evidence on this system, while, at the same time, emphasizing the potential of its integration with the sustainable development framework (SDGs). We propose to develop a first linkage between the 14 common indicators and the SDGs which allows us to produce a composite index (SDGs-RRF) for France, Germany, Italy, and Spain for the period 2014-2021. Over this time, widespread improvements in the composite index across the four countries led to a partial reduction of the divergence. The proposed approach represents a first step towards a wider use of the SDGs for the assess",
    "link": "http://arxiv.org/abs/2307.11039",
    "context": "Title: Indicatori comuni del PNRR e framework SDGs: una proposta di indicatore composito. (arXiv:2307.11039v1 [econ.GN])\nAbstract: The main component of the NextGeneration EU (NGEU) program is the Recovery and Resilience Facility (RRF), spanning an implementation period between 2021 and 2026. The RRF also includes a monitoring system: every six months, each country is required to send an update on the progress of the plan against 14 common indicators, measured on specific quantitative scales. The aim of this paper is to present the first empirical evidence on this system, while, at the same time, emphasizing the potential of its integration with the sustainable development framework (SDGs). We propose to develop a first linkage between the 14 common indicators and the SDGs which allows us to produce a composite index (SDGs-RRF) for France, Germany, Italy, and Spain for the period 2014-2021. Over this time, widespread improvements in the composite index across the four countries led to a partial reduction of the divergence. The proposed approach represents a first step towards a wider use of the SDGs for the assess",
    "path": "papers/23/07/2307.11039.json",
    "total_tokens": 990,
    "translated_title": "PNRR和SDGs的共同指标和框架：一个复合指标的提议",
    "translated_abstract": "欧盟下一代计划(NGEU)的主要组成部分是复苏和韧性设施(RRF)，实施期为2021年至2026年。RRF还包括一个监测系统：每六个月，每个国家都需要根据14个共同指标的进展情况发送更新，这些指标在特定的定量尺度上测量。本文旨在在强调可持续发展框架(SDGs)与RRF整合潜力的同时，提供该系统的第一组实证证据。我们建议将14个共同指标与SDGs建立联系，从而为法国、德国、意大利和西班牙在2014年至2021年期间生成一个组合指数(SDGs-RRF)。在这段时间内，这四个国家的组合指数普遍改善，部分减小了差距。所提出的方法是向更广泛地使用SDGs进行评估迈出的第一步。",
    "tldr": "本文研究了欧盟下一代计划(PNRR)中监测系统的14个共同指标与可持续发展框架(SDGs)的整合潜力，并提出了一个SDGs-RRF复合指数的方法。结果显示在2014年至2021年期间，法国、德国、意大利和西班牙的组合指数普遍改善，部分减小了差距。",
    "en_tdlr": "This paper investigates the integration potential of the 14 common indicators in the EU's NextGeneration EU program (PNRR) with the sustainable development framework (SDGs) and proposes a method for a composite index (SDGs-RRF). The results show widespread improvements in the composite index across France, Germany, Italy, and Spain from 2014 to 2021, partially reducing the divergence."
}