{
    "title": "Quantum Kernel Estimation With Neutral Atoms For Supervised Classification: A Gate-Based Approach. (arXiv:2307.15840v1 [quant-ph])",
    "abstract": "Quantum Kernel Estimation (QKE) is a technique based on leveraging a quantum computer to estimate a kernel function that is classically difficult to calculate, which is then used by a classical computer for training a Support Vector Machine (SVM). Given the high number of 2-local operators necessary for realizing a feature mapping hard to simulate classically, a high qubit connectivity is needed, which is not currently possible on superconducting devices. For this reason, neutral atom quantum computers can be used, since they allow to arrange the atoms with more freedom. Examples of neutral-atom-based QKE can be found in the literature, but they are focused on graph learning and use the analogue approach. In this paper, a general method based on the gate model is presented. After deriving 1-qubit and 2-qubit gates starting from laser pulses, a parameterized sequence for feature mapping on 3 qubits is realized. This sequence is then used to empirically compute the kernel matrix starting",
    "link": "http://arxiv.org/abs/2307.15840",
    "context": "Title: Quantum Kernel Estimation With Neutral Atoms For Supervised Classification: A Gate-Based Approach. (arXiv:2307.15840v1 [quant-ph])\nAbstract: Quantum Kernel Estimation (QKE) is a technique based on leveraging a quantum computer to estimate a kernel function that is classically difficult to calculate, which is then used by a classical computer for training a Support Vector Machine (SVM). Given the high number of 2-local operators necessary for realizing a feature mapping hard to simulate classically, a high qubit connectivity is needed, which is not currently possible on superconducting devices. For this reason, neutral atom quantum computers can be used, since they allow to arrange the atoms with more freedom. Examples of neutral-atom-based QKE can be found in the literature, but they are focused on graph learning and use the analogue approach. In this paper, a general method based on the gate model is presented. After deriving 1-qubit and 2-qubit gates starting from laser pulses, a parameterized sequence for feature mapping on 3 qubits is realized. This sequence is then used to empirically compute the kernel matrix starting",
    "path": "papers/23/07/2307.15840.json",
    "total_tokens": 874,
    "translated_title": "用中性原子进行量子核估计的监督分类：一种基于门的方法",
    "translated_abstract": "量子核估计（QKE）是一种基于利用量子计算机估计经典难以计算的核函数的技术，然后由经典计算机用于训练支持向量机（SVM）。由于实现难以经典模拟的特征映射所需的2-局部算子数量较高，需要较高的量子比特连接性，而目前超导设备上无法实现这一点。因此，可以利用中性原子量子计算机，因为它们允许更自由地安排原子。文献中可以找到基于中性原子的QKE示例，但它们侧重于图学习并使用类比方法。本文介绍了一种基于门模型的通用方法。在从激光脉冲开始推导1比特和2比特门之后，实现了一个用于3比特特征映射的参数化序列。然后，利用该序列从经验上计算核矩阵。",
    "tldr": "本文提出了一种用中性原子进行量子核估计的监督分类的基于门的方法，通过实现一种参数化序列来进行特征映射和核矩阵的计算。",
    "en_tdlr": "This paper presents a gate-based approach for supervised classification using neutral atoms for quantum kernel estimation, which involves implementing a parameterized sequence for feature mapping and computing the kernel matrix."
}