{
    "title": "ECSIC: Epipolar Cross Attention for Stereo Image Compression. (arXiv:2307.10284v1 [eess.IV])",
    "abstract": "In this paper, we present ECSIC, a novel learned method for stereo image compression. Our proposed method compresses the left and right images in a joint manner by exploiting the mutual information between the images of the stereo image pair using a novel stereo cross attention (SCA) module and two stereo context modules. The SCA module performs cross-attention restricted to the corresponding epipolar lines of the two images and processes them in parallel. The stereo context modules improve the entropy estimation of the second encoded image by using the first image as a context. We conduct an extensive ablation study demonstrating the effectiveness of the proposed modules and a comprehensive quantitative and qualitative comparison with existing methods. ECSIC achieves state-of-the-art performance among stereo image compression models on the two popular stereo image datasets Cityscapes and InStereo2k while allowing for fast encoding and decoding, making it highly practical for real-time",
    "link": "http://arxiv.org/abs/2307.10284",
    "context": "Title: ECSIC: Epipolar Cross Attention for Stereo Image Compression. (arXiv:2307.10284v1 [eess.IV])\nAbstract: In this paper, we present ECSIC, a novel learned method for stereo image compression. Our proposed method compresses the left and right images in a joint manner by exploiting the mutual information between the images of the stereo image pair using a novel stereo cross attention (SCA) module and two stereo context modules. The SCA module performs cross-attention restricted to the corresponding epipolar lines of the two images and processes them in parallel. The stereo context modules improve the entropy estimation of the second encoded image by using the first image as a context. We conduct an extensive ablation study demonstrating the effectiveness of the proposed modules and a comprehensive quantitative and qualitative comparison with existing methods. ECSIC achieves state-of-the-art performance among stereo image compression models on the two popular stereo image datasets Cityscapes and InStereo2k while allowing for fast encoding and decoding, making it highly practical for real-time",
    "path": "papers/23/07/2307.10284.json",
    "total_tokens": 945,
    "translated_title": "ECSIC: 用于立体图像压缩的极线交叉注意力技术",
    "translated_abstract": "在本文中，我们提出了一种新颖的学习方法ECSIC，用于立体图像压缩。我们的方法通过利用立体图像对左右图像之间的相互信息，采用一种新颖的立体交叉注意力（SCA）模块和两个立体上下文模块，以联合方式压缩左右图像。SCA模块在两个图像的对应极线范围内进行交叉注意力处理，并且并行处理它们。立体上下文模块通过使用第一个图像作为上下文来改善对第二个编码图像的熵估计。我们进行了大量的剔除实验，证明了所提出模块的有效性，并与现有方法进行了全面的定量和定性比较。ECSIC在两个常用的立体图像数据集Cityscapes和InStereo2k上达到了立体图像压缩模型中的最先进性能，同时允许快速编码和解码，非常适用于实时应用。",
    "tldr": "ECSIC是一种用于立体图像压缩的新方法，通过利用左右图像之间的相互信息进行联合压缩，并使用新颖的立体交叉注意力模块和立体上下文模块实现。与现有方法相比，ECSIC在两个流行的立体图像数据集上取得了最先进的性能，并且具有快速编码和解码的特性。",
    "en_tdlr": "ECSIC is a novel method for stereo image compression that performs joint compression of left and right images by exploiting the mutual information between them. It utilizes a novel stereo cross attention module and stereo context modules to improve compression performance. ECSIC achieves state-of-the-art results on popular stereo image datasets and allows for fast encoding and decoding."
}