{
    "title": "Digital Emotion Regulation on Social Media. (arXiv:2307.13187v1 [cs.HC])",
    "abstract": "Emotion regulation is the process of consciously altering one's affective state, that is the underlying emotional state such as happiness, confidence, guilt, anger etc. The ability to effectively regulate emotions is necessary for functioning efficiently in everyday life. Today, the pervasiveness of digital technology is being purposefully employed to modify our affective states, a process known as digital emotion regulation. Understanding digital emotion regulation can help support the rise of ethical technology design, development, and deployment. This article presents an overview of digital emotion regulation in social media applications, as well as a synthesis of recent research on emotion regulation interventions for social media. We share our findings from analysing state-of-the-art literature on how different social media applications are utilised at different stages in the process of emotion regulation.",
    "link": "http://arxiv.org/abs/2307.13187",
    "context": "Title: Digital Emotion Regulation on Social Media. (arXiv:2307.13187v1 [cs.HC])\nAbstract: Emotion regulation is the process of consciously altering one's affective state, that is the underlying emotional state such as happiness, confidence, guilt, anger etc. The ability to effectively regulate emotions is necessary for functioning efficiently in everyday life. Today, the pervasiveness of digital technology is being purposefully employed to modify our affective states, a process known as digital emotion regulation. Understanding digital emotion regulation can help support the rise of ethical technology design, development, and deployment. This article presents an overview of digital emotion regulation in social media applications, as well as a synthesis of recent research on emotion regulation interventions for social media. We share our findings from analysing state-of-the-art literature on how different social media applications are utilised at different stages in the process of emotion regulation.",
    "path": "papers/23/07/2307.13187.json",
    "total_tokens": 817,
    "translated_title": "社交媒体上的数字情绪调节",
    "translated_abstract": "情绪调节是有意识地改变自身情感状态的过程，即改变幸福、自信、内疚、愤怒等基本情绪状态。有效地调节情绪对于日常生活中的高效运作是必要的。如今，数字技术的普及正在被有目的地用来改变我们的情感状态，这一过程被称为数字情绪调节。理解数字情绪调节可以帮助支持道德科技设计、开发和部署的崛起。本文概述了社交媒体应用中的数字情绪调节，并综合了关于社交媒体情绪调节干预的最新研究。我们通过分析最新文献，分享了关于不同社交媒体应用在情绪调节过程的不同阶段中的使用情况的发现。",
    "tldr": "本文概述了社交媒体上的数字情绪调节，并综合了关于社交媒体情绪调节干预的最新研究。研究发现不同社交媒体应用在情绪调节过程的不同阶段中有不同的使用方式。",
    "en_tdlr": "This article provides an overview of digital emotion regulation on social media and synthesizes recent research on emotion regulation interventions in social media. The findings reveal different usage patterns of different social media applications at different stages of the emotion regulation process."
}