{
    "title": "ARC-NLP at PAN 2023: Transition-Focused Natural Language Inference for Writing Style Detection. (arXiv:2307.14913v1 [cs.CL])",
    "abstract": "The task of multi-author writing style detection aims at finding any positions of writing style change in a given text document. We formulate the task as a natural language inference problem where two consecutive paragraphs are paired. Our approach focuses on transitions between paragraphs while truncating input tokens for the task. As backbone models, we employ different Transformer-based encoders with warmup phase during training. We submit the model version that outperforms baselines and other proposed model versions in our experiments. For the easy and medium setups, we submit transition-focused natural language inference based on DeBERTa with warmup training, and the same model without transition for the hard setup.",
    "link": "http://arxiv.org/abs/2307.14913",
    "context": "Title: ARC-NLP at PAN 2023: Transition-Focused Natural Language Inference for Writing Style Detection. (arXiv:2307.14913v1 [cs.CL])\nAbstract: The task of multi-author writing style detection aims at finding any positions of writing style change in a given text document. We formulate the task as a natural language inference problem where two consecutive paragraphs are paired. Our approach focuses on transitions between paragraphs while truncating input tokens for the task. As backbone models, we employ different Transformer-based encoders with warmup phase during training. We submit the model version that outperforms baselines and other proposed model versions in our experiments. For the easy and medium setups, we submit transition-focused natural language inference based on DeBERTa with warmup training, and the same model without transition for the hard setup.",
    "path": "papers/23/07/2307.14913.json",
    "total_tokens": 784,
    "translated_title": "PAN 2023上的ARC-NLP：基于转换的自然语言推理用于写作风格检测",
    "translated_abstract": "多作者写作风格检测任务旨在发现给定文本中的写作风格变化位置。我们将任务形式化为一个自然语言推理问题，其中两个连续段落配对。我们的方法侧重于段落之间的过渡，并在任务中截断输入标记。作为主干模型，我们采用了基于Transformer的不同编码器，在训练期间使用预热阶段。我们提交的模型版本在实验中优于基线和其他提出的模型版本。对于简单和中等设置，我们提交了基于DeBERTa和预热训练的基于转换的自然语言推理，对于困难设置，使用相同模型但无过渡。",
    "tldr": "这篇论文介绍了一个基于转换的自然语言推理方法，用于多作者写作风格检测。作者将任务视为自然语言推理问题，重点关注段落之间的过渡。实验结果表明，该方法优于其他模型版本，并在不同设置下达到了良好的性能。",
    "en_tdlr": "This paper presents a transition-focused natural language inference approach for multi-author writing style detection. The authors formulate the task as a natural language inference problem, emphasizing transitions between paragraphs. Experimental results show that the proposed method outperforms other model versions and achieves good performance in different setups."
}