{
    "title": "Phoneme-retrieval; voice recognition; vowels recognition. (arXiv:2307.07407v1 [cs.CL])",
    "abstract": "A phoneme-retrieval technique is proposed, which is due to the particular way of the construction of the network. An initial set of neurons is given. The number of these neurons is approximately equal to the number of typical structures of the data. For example if the network is built for voice retrieval then the number of neurons must be equal to the number of characteristic phonemes of the alphabet of the language spoken by the social group to which the particular person belongs. Usually this task is very complicated and the network can depend critically on the samples used for the learning. If the network is built for image retrieval then it works only if the data to be retrieved belong to a particular set of images. If the network is built for voice recognition it works only for some particular set of words. A typical example is the words used for the flight of airplanes. For example a command like the \"airplane should make a turn of 120 degrees towards the east\" can be easily reco",
    "link": "http://arxiv.org/abs/2307.07407",
    "context": "Title: Phoneme-retrieval; voice recognition; vowels recognition. (arXiv:2307.07407v1 [cs.CL])\nAbstract: A phoneme-retrieval technique is proposed, which is due to the particular way of the construction of the network. An initial set of neurons is given. The number of these neurons is approximately equal to the number of typical structures of the data. For example if the network is built for voice retrieval then the number of neurons must be equal to the number of characteristic phonemes of the alphabet of the language spoken by the social group to which the particular person belongs. Usually this task is very complicated and the network can depend critically on the samples used for the learning. If the network is built for image retrieval then it works only if the data to be retrieved belong to a particular set of images. If the network is built for voice recognition it works only for some particular set of words. A typical example is the words used for the flight of airplanes. For example a command like the \"airplane should make a turn of 120 degrees towards the east\" can be easily reco",
    "path": "papers/23/07/2307.07407.json",
    "total_tokens": 820,
    "translated_title": "音素检索；语音识别；元音识别",
    "translated_abstract": "提出了一种音素检索技术，其特点是网络的构建方式。给出了一组初始神经元，这些神经元的数量大致等于数据的典型结构数量。例如，如果网络是用于语音检索，则神经元的数量必须等于特定人所属社会群体所讲语言的特征音素数量。通常，这是一项非常复杂的任务，网络的性能很大程度上依赖于用于学习的样本。如果网络是用于图像检索，则仅在要检索的数据属于特定的图像集合时起作用。如果网络是用于语音识别，则仅对某个特定的词汇集合起作用。一个典型的例子是用于飞机飞行的指令。例如，“飞机向东方转120度”这样的指令可以很容易地被识别出来。",
    "tldr": "音素检索技术通过特定的网络构建方式实现了语音和图像的准确检索，在特定的领域和词汇集合上表现出良好的性能。",
    "en_tdlr": "The proposed phoneme-retrieval technique achieves accurate retrieval of both speech and images through a specific network construction method, demonstrating good performance on specific domains and vocabulary sets."
}