{
    "title": "Can I say, now machines can think?. (arXiv:2307.07526v1 [cs.AI])",
    "abstract": "Generative AI techniques have opened the path for new generations of machines in diverse domains. These machines have various capabilities for example, they can produce images, generate answers or stories, and write codes based on the \"prompts\" only provided by users. These machines are considered 'thinking minds' because they have the ability to generate human-like responses. In this study, we have analyzed and explored the capabilities of artificial intelligence-enabled machines. We have revisited on Turing's concept of thinking machines and compared it with recent technological advancements. The objections and consequences of the thinking machines are also discussed in this study, along with available techniques to evaluate machines' cognitive capabilities. We have concluded that Turing Test is a critical aspect of evaluating machines' ability. However, there are other aspects of intelligence too, and AI machines exhibit most of these aspects.",
    "link": "http://arxiv.org/abs/2307.07526",
    "context": "Title: Can I say, now machines can think?. (arXiv:2307.07526v1 [cs.AI])\nAbstract: Generative AI techniques have opened the path for new generations of machines in diverse domains. These machines have various capabilities for example, they can produce images, generate answers or stories, and write codes based on the \"prompts\" only provided by users. These machines are considered 'thinking minds' because they have the ability to generate human-like responses. In this study, we have analyzed and explored the capabilities of artificial intelligence-enabled machines. We have revisited on Turing's concept of thinking machines and compared it with recent technological advancements. The objections and consequences of the thinking machines are also discussed in this study, along with available techniques to evaluate machines' cognitive capabilities. We have concluded that Turing Test is a critical aspect of evaluating machines' ability. However, there are other aspects of intelligence too, and AI machines exhibit most of these aspects.",
    "path": "papers/23/07/2307.07526.json",
    "total_tokens": 887,
    "translated_title": "现在可以说机器可以思考了吗？",
    "translated_abstract": "生成型人工智能技术在不同领域为新一代机器带来了机会。这些机器具有各种能力，例如可以生成图像、生成答案或故事，并根据用户提供的\"提示\"编写代码。这些机器被认为是'思考的思想'，因为它们具有生成人类化回应的能力。在这项研究中，我们分析和探究了人工智能支持的机器的能力。我们重新审视了图灵的思考机器概念，并将其与最新的技术进展进行了比较。本研究还讨论了思考机器的异议和后果，以及评估机器认知能力的可用技术。我们得出结论，图灵测试是评估机器能力的关键方面。然而，智能还有其他方面，而人工智能机器展示了其中大部分方面。",
    "tldr": "生成型人工智能技术使得机器具备了人类化的响应能力，这促使我们重新审视了图灵的思考机器概念，并对机器的认知能力进行了评估。我们发现，尽管图灵测试是评估机器能力的关键，但智能还有其他方面，而人工智能机器展示了其中大部分方面。",
    "en_tdlr": "Generative AI techniques have enabled machines to have human-like responses, prompting a reevaluation of Turing's concept of thinking machines and an assessment of machines' cognitive capabilities. While the Turing Test remains a critical aspect of evaluating machine intelligence, it is acknowledged that there are other aspects of intelligence, most of which are exhibited by AI machines."
}