{
    "title": "Forecasting Early with Meta Learning. (arXiv:2307.09796v1 [cs.LG])",
    "abstract": "In the early observation period of a time series, there might be only a few historic observations available to learn a model. However, in cases where an existing prior set of datasets is available, Meta learning methods can be applicable. In this paper, we devise a Meta learning method that exploits samples from additional datasets and learns to augment time series through adversarial learning as an auxiliary task for the target dataset. Our model (FEML), is equipped with a shared Convolutional backbone that learns features for varying length inputs from different datasets and has dataset specific heads to forecast for different output lengths. We show that FEML can meta learn across datasets and by additionally learning on adversarial generated samples as auxiliary samples for the target dataset, it can improve the forecasting performance compared to single task learning, and various solutions adapted from Joint learning, Multi-task learning and classic forecasting baselines.",
    "link": "http://arxiv.org/abs/2307.09796",
    "context": "Title: Forecasting Early with Meta Learning. (arXiv:2307.09796v1 [cs.LG])\nAbstract: In the early observation period of a time series, there might be only a few historic observations available to learn a model. However, in cases where an existing prior set of datasets is available, Meta learning methods can be applicable. In this paper, we devise a Meta learning method that exploits samples from additional datasets and learns to augment time series through adversarial learning as an auxiliary task for the target dataset. Our model (FEML), is equipped with a shared Convolutional backbone that learns features for varying length inputs from different datasets and has dataset specific heads to forecast for different output lengths. We show that FEML can meta learn across datasets and by additionally learning on adversarial generated samples as auxiliary samples for the target dataset, it can improve the forecasting performance compared to single task learning, and various solutions adapted from Joint learning, Multi-task learning and classic forecasting baselines.",
    "path": "papers/23/07/2307.09796.json",
    "total_tokens": 846,
    "translated_title": "预测早期时间序列的元学习方法",
    "translated_abstract": "在时间序列的早期观察期中，可能只有少量历史观察可用于学习模型。然而，在存在先前数据集的情况下，可以应用元学习方法。本文提出了一种利用额外数据集样本进行元学习的方法，通过对目标数据集进行对抗学习，学习增强时间序列的辅助任务。我们的模型(FEML)配备共享的卷积主干网络，可以学习来自不同数据集的不同长度输入的特征，并具有针对不同输出长度的数据集特定预测头。我们证明FEML可以在数据集之间进行元学习，并通过在对抗生成的样本上进行附加学习，提高与单任务学习、联合学习、多任务学习和经典预测基线方法相比的预测性能。",
    "tldr": "本文介绍了一种利用元学习方法预测早期时间序列的方法，通过对目标数据集进行对抗学习和利用额外样本增强时间序列，在多个数据集中进行元学习，并在预测性能上优于单任务学习、联合学习、多任务学习和经典预测基线方法。",
    "en_tdlr": "This paper proposes a meta learning method for forecasting early time series, which utilizes adversarial learning and additional samples to enhance the time series, and shows superior performance compared to single task learning, joint learning, multi-task learning, and classic forecasting baselines."
}