{
    "title": "Rank Your Summaries: Enhancing Bengali Text Summarization via Ranking-based Approach. (arXiv:2307.07392v1 [cs.CL])",
    "abstract": "With the increasing need for text summarization techniques that are both efficient and accurate, it becomes crucial to explore avenues that enhance the quality and precision of pre-trained models specifically tailored for summarizing Bengali texts. When it comes to text summarization tasks, there are numerous pre-trained transformer models at one's disposal. Consequently, it becomes quite a challenge to discern the most informative and relevant summary for a given text among the various options generated by these pre-trained summarization models. This paper aims to identify the most accurate and informative summary for a given text by utilizing a simple but effective ranking-based approach that compares the output of four different pre-trained Bengali text summarization models. The process begins by carrying out preprocessing of the input text that involves eliminating unnecessary elements such as special characters and punctuation marks. Next, we utilize four pre-trained summarization",
    "link": "http://arxiv.org/abs/2307.07392",
    "context": "Title: Rank Your Summaries: Enhancing Bengali Text Summarization via Ranking-based Approach. (arXiv:2307.07392v1 [cs.CL])\nAbstract: With the increasing need for text summarization techniques that are both efficient and accurate, it becomes crucial to explore avenues that enhance the quality and precision of pre-trained models specifically tailored for summarizing Bengali texts. When it comes to text summarization tasks, there are numerous pre-trained transformer models at one's disposal. Consequently, it becomes quite a challenge to discern the most informative and relevant summary for a given text among the various options generated by these pre-trained summarization models. This paper aims to identify the most accurate and informative summary for a given text by utilizing a simple but effective ranking-based approach that compares the output of four different pre-trained Bengali text summarization models. The process begins by carrying out preprocessing of the input text that involves eliminating unnecessary elements such as special characters and punctuation marks. Next, we utilize four pre-trained summarization",
    "path": "papers/23/07/2307.07392.json",
    "total_tokens": 839,
    "translated_title": "利用基于排名的方法增强孟加拉文本摘要的质量",
    "translated_abstract": "随着对既高效又准确的文本摘要技术的需求日益增加，探索能够增强专为孟加拉文本摘要而设计的预训练模型的质量和精确性变得至关重要。在文本摘要任务中，人们可以使用众多的预训练转换器模型。因此，在这些预训练摘要模型生成的各种选项中，确定给定文本的最具信息量和相关性的摘要变得非常具有挑战性。本文旨在通过利用一种简单而有效的基于排名的方法，比较四种不同的预训练孟加拉文本摘要模型的输出来确定给定文本的最准确和信息丰富的摘要。该过程首先对输入文本进行预处理，包括去除特殊字符和标点符号等不必要的元素。接下来，我们利用四个预训练的摘要模型。",
    "tldr": "该论文利用基于排名的方法，通过比较四种不同的预训练孟加拉文本摘要模型的输出来确定给定文本的最准确和信息丰富的摘要。"
}