{
    "title": "Reduced Kernel Dictionary Learning. (arXiv:2307.08798v1 [eess.SP])",
    "abstract": "In this paper we present new algorithms for training reduced-size nonlinear representations in the Kernel Dictionary Learning (KDL) problem. Standard KDL has the drawback of a large size of the kernel matrix when the data set is large. There are several ways of reducing the kernel size, notably Nystr\\\"om sampling. We propose here a method more in the spirit of dictionary learning, where the kernel vectors are obtained with a trained sparse representation of the input signals. Moreover, we optimize directly the kernel vectors in the KDL process, using gradient descent steps. We show with three data sets that our algorithms are able to provide better representations, despite using a small number of kernel vectors, and also decrease the execution time with respect to KDL.",
    "link": "http://arxiv.org/abs/2307.08798",
    "context": "Title: Reduced Kernel Dictionary Learning. (arXiv:2307.08798v1 [eess.SP])\nAbstract: In this paper we present new algorithms for training reduced-size nonlinear representations in the Kernel Dictionary Learning (KDL) problem. Standard KDL has the drawback of a large size of the kernel matrix when the data set is large. There are several ways of reducing the kernel size, notably Nystr\\\"om sampling. We propose here a method more in the spirit of dictionary learning, where the kernel vectors are obtained with a trained sparse representation of the input signals. Moreover, we optimize directly the kernel vectors in the KDL process, using gradient descent steps. We show with three data sets that our algorithms are able to provide better representations, despite using a small number of kernel vectors, and also decrease the execution time with respect to KDL.",
    "path": "papers/23/07/2307.08798.json",
    "total_tokens": 794,
    "translated_title": "降维核字典学习",
    "translated_abstract": "在本文中，我们提出了一种用于训练核字典学习(KDL)问题中的降维非线性表示的新算法。标准的KDL存在一个问题，那就是当数据集很大时，核矩阵的大小很大。有几种减小核大小的方法，尤其是Nyström抽样。我们在这里提出了一种更符合字典学习思想的方法，其中核向量是通过输入信号的训练稀疏表示来获得的。此外，我们还直接优化了KDL过程中的核向量，并使用梯度下降步骤。我们通过三个数据集展示了我们的算法能够提供更好的表示，尽管使用了少量的核向量，同时相对于KDL还减少了执行时间。",
    "tldr": "本文提出了一种降维核字典学习方法，通过输入信号的训练稀疏表示来获得核向量，并使用梯度下降步骤直接优化核向量，实验证明该方法能够在使用少量核向量的情况下提供更好的表示，并减少执行时间。",
    "en_tdlr": "This paper proposes a reduced kernel dictionary learning method, where kernel vectors are obtained through trained sparse representation of input signals and optimized directly using gradient descent steps. Experimental results show that this method can provide better representations with a small number of kernel vectors and reduce execution time."
}