{
    "title": "What do neural networks learn in image classification? A frequency shortcut perspective. (arXiv:2307.09829v1 [cs.LG])",
    "abstract": "Frequency analysis is useful for understanding the mechanisms of representation learning in neural networks (NNs). Most research in this area focuses on the learning dynamics of NNs for regression tasks, while little for classification. This study empirically investigates the latter and expands the understanding of frequency shortcuts. First, we perform experiments on synthetic datasets, designed to have a bias in different frequency bands. Our results demonstrate that NNs tend to find simple solutions for classification, and what they learn first during training depends on the most distinctive frequency characteristics, which can be either low- or high-frequencies. Second, we confirm this phenomenon on natural images. We propose a metric to measure class-wise frequency characteristics and a method to identify frequency shortcuts. The results show that frequency shortcuts can be texture-based or shape-based, depending on what best simplifies the objective. Third, we validate the transf",
    "link": "http://arxiv.org/abs/2307.09829",
    "context": "Title: What do neural networks learn in image classification? A frequency shortcut perspective. (arXiv:2307.09829v1 [cs.LG])\nAbstract: Frequency analysis is useful for understanding the mechanisms of representation learning in neural networks (NNs). Most research in this area focuses on the learning dynamics of NNs for regression tasks, while little for classification. This study empirically investigates the latter and expands the understanding of frequency shortcuts. First, we perform experiments on synthetic datasets, designed to have a bias in different frequency bands. Our results demonstrate that NNs tend to find simple solutions for classification, and what they learn first during training depends on the most distinctive frequency characteristics, which can be either low- or high-frequencies. Second, we confirm this phenomenon on natural images. We propose a metric to measure class-wise frequency characteristics and a method to identify frequency shortcuts. The results show that frequency shortcuts can be texture-based or shape-based, depending on what best simplifies the objective. Third, we validate the transf",
    "path": "papers/23/07/2307.09829.json",
    "total_tokens": 971,
    "translated_title": "神经网络在图像分类中学到了什么？基于频率的快捷路径视角",
    "translated_abstract": "频率分析对于理解神经网络（NNs）中的表示学习机制非常有用。大部分研究都集中在回归任务中NNs的学习动态上，而很少有关于分类任务的研究。本研究通过实证研究扩展了频率快捷路径的理解。首先，我们在合成数据集上进行实验，设计了在不同频段上具有偏差的数据集。实验结果表明，NNs倾向于找到分类的简单解决方案，而其在训练过程中首先学到的内容取决于最具有区分性的频率特征，可以是低频或高频。其次，我们通过自然图像验证了这一现象。我们提出了衡量类别频率特征的度量标准，并提出了一种识别频率快捷路径的方法。结果表明，频率快捷路径可以基于纹理或形状，具体取决于何种方式能够最好地简化目标。第三，我们验证了转移性。",
    "tldr": "本研究通过在合成数据集和自然图像上的实验，发现神经网络在图像分类中倾向于找到简单的解决方案，并且在训练过程中首先学到的内容取决于最具有区分性的频率特征，这可以是低频或高频。同时，研究也提出了一种度量标准和方法来识别频率快捷路径，并验证了其在不同类型的图像上的有效性。",
    "en_tdlr": "This study investigates what neural networks learn in image classification and finds that they tend to find simple solutions, with the learning process depending on the most distinctive frequency characteristics, whether low or high frequencies. The study also proposes a metric and method to identify frequency shortcuts, and validates their effectiveness on different types of images."
}