{
    "title": "Learning to Group Auxiliary Datasets for Molecule. (arXiv:2307.04052v1 [q-bio.BM])",
    "abstract": "The limited availability of annotations in small molecule datasets presents a challenge to machine learning models. To address this, one common strategy is to collaborate with additional auxiliary datasets. However, having more data does not always guarantee improvements. Negative transfer can occur when the knowledge in the target dataset differs or contradicts that of the auxiliary molecule datasets. In light of this, identifying the auxiliary molecule datasets that can benefit the target dataset when jointly trained remains a critical and unresolved problem. Through an empirical analysis, we observe that combining graph structure similarity and task similarity can serve as a more reliable indicator for identifying high-affinity auxiliary datasets. Motivated by this insight, we propose MolGroup, which separates the dataset affinity into task and structure affinity to predict the potential benefits of each auxiliary molecule dataset. MolGroup achieves this by utilizing a routing mecha",
    "link": "http://arxiv.org/abs/2307.04052",
    "context": "Title: Learning to Group Auxiliary Datasets for Molecule. (arXiv:2307.04052v1 [q-bio.BM])\nAbstract: The limited availability of annotations in small molecule datasets presents a challenge to machine learning models. To address this, one common strategy is to collaborate with additional auxiliary datasets. However, having more data does not always guarantee improvements. Negative transfer can occur when the knowledge in the target dataset differs or contradicts that of the auxiliary molecule datasets. In light of this, identifying the auxiliary molecule datasets that can benefit the target dataset when jointly trained remains a critical and unresolved problem. Through an empirical analysis, we observe that combining graph structure similarity and task similarity can serve as a more reliable indicator for identifying high-affinity auxiliary datasets. Motivated by this insight, we propose MolGroup, which separates the dataset affinity into task and structure affinity to predict the potential benefits of each auxiliary molecule dataset. MolGroup achieves this by utilizing a routing mecha",
    "path": "papers/23/07/2307.04052.json",
    "total_tokens": 866,
    "translated_title": "学习将辅助数据集分组用于分子问题",
    "translated_abstract": "小分子数据集中有限的注释可用性对机器学习模型提出了挑战。为了解决这个问题，一种常见的策略是与额外的辅助数据集合作。然而，拥有更多的数据并不总是能保证改进。当目标数据集中的知识与辅助分子数据集中的知识不同或相互矛盾时，负迁移可能会发生。鉴于此，当共同训练时，确定可以使目标数据集受益的辅助分子数据集仍然是一个关键而未解决的问题。通过经验分析，我们观察到将图结构相似性和任务相似性相结合可以作为确定高亲和性辅助数据集的更可靠指标。在此基础上，我们提出了MolGroup，它将数据集亲和性分为任务亲和性和结构亲和性，以预测每个辅助分子数据集的潜在好处。MolGroup通过利用路由机制来实现。",
    "tldr": "本文提出了一种名为MolGroup的方法，通过将图结构相似性和任务相似性相结合，预测每个辅助分子数据集的潜在好处，以解决合作使用辅助数据集时的负迁移问题。"
}