{
    "title": "Fast and Functional Structured Data Generators Rooted in Out-of-Equilibrium Physics. (arXiv:2307.06797v1 [cs.LG])",
    "abstract": "In this study, we address the challenge of using energy-based models to produce high-quality, label-specific data in complex structured datasets, such as population genetics, RNA or protein sequences data. Traditional training methods encounter difficulties due to inefficient Markov chain Monte Carlo mixing, which affects the diversity of synthetic data and increases generation times. To address these issues, we use a novel training algorithm that exploits non-equilibrium effects. This approach, applied on the Restricted Boltzmann Machine, improves the model's ability to correctly classify samples and generate high-quality synthetic data in only a few sampling steps. The effectiveness of this method is demonstrated by its successful application to four different types of data: handwritten digits, mutations of human genomes classified by continental origin, functionally characterized sequences of an enzyme protein family, and homologous RNA sequences from specific taxonomies.",
    "link": "http://arxiv.org/abs/2307.06797",
    "context": "Title: Fast and Functional Structured Data Generators Rooted in Out-of-Equilibrium Physics. (arXiv:2307.06797v1 [cs.LG])\nAbstract: In this study, we address the challenge of using energy-based models to produce high-quality, label-specific data in complex structured datasets, such as population genetics, RNA or protein sequences data. Traditional training methods encounter difficulties due to inefficient Markov chain Monte Carlo mixing, which affects the diversity of synthetic data and increases generation times. To address these issues, we use a novel training algorithm that exploits non-equilibrium effects. This approach, applied on the Restricted Boltzmann Machine, improves the model's ability to correctly classify samples and generate high-quality synthetic data in only a few sampling steps. The effectiveness of this method is demonstrated by its successful application to four different types of data: handwritten digits, mutations of human genomes classified by continental origin, functionally characterized sequences of an enzyme protein family, and homologous RNA sequences from specific taxonomies.",
    "path": "papers/23/07/2307.06797.json",
    "total_tokens": 887,
    "translated_title": "基于非平衡物理学的快速且功能性结构化数据生成器",
    "translated_abstract": "在这项研究中，我们解决了使用基于能量的模型在复杂结构化数据集（如人口基因组学、RNA或蛋白质序列数据）中生成高质量、标签特定数据的挑战。传统的训练方法由于马尔可夫链蒙特卡洛混合效率低下而遇到困难，这影响了合成数据的多样性并增加了生成时间。为了解决这些问题，我们使用了一种利用非平衡效应的新型训练算法。这种方法应用于受限玻尔兹曼机，提高了模型对样本的正确分类能力，并只需少数几个采样步骤即可生成高质量的合成数据。该方法的有效性通过其成功应用于四种不同类型的数据得到证明：手写数字，按大陆起源分类的人类基因组突变，酶蛋白家族的功能序列，以及特定分类法的同源RNA序列。",
    "tldr": "这项研究提出了一种基于非平衡物理学的训练算法，用于解决使用能量模型生成高质量结构化数据的挑战。该方法通过改善模型的分类能力和生成速度，在多个领域取得了成功应用。",
    "en_tdlr": "This study introduces a novel training algorithm rooted in out-of-equilibrium physics to address the challenge of generating high-quality structured data using energy-based models. The method significantly improves the model's classification ability and generation speed, demonstrating successful applications in various domains."
}