{
    "title": "Single Channel Speech Enhancement Using U-Net Spiking Neural Networks. (arXiv:2307.14464v1 [cs.SD])",
    "abstract": "Speech enhancement (SE) is crucial for reliable communication devices or robust speech recognition systems. Although conventional artificial neural networks (ANN) have demonstrated remarkable performance in SE, they require significant computational power, along with high energy costs. In this paper, we propose a novel approach to SE using a spiking neural network (SNN) based on a U-Net architecture. SNNs are suitable for processing data with a temporal dimension, such as speech, and are known for their energy-efficient implementation on neuromorphic hardware. As such, SNNs are thus interesting candidates for real-time applications on devices with limited resources. The primary objective of the current work is to develop an SNN-based model with comparable performance to a state-of-the-art ANN model for SE. We train a deep SNN using surrogate-gradient-based optimization and evaluate its performance using perceptual objective tests under different signal-to-noise ratios and real-world no",
    "link": "http://arxiv.org/abs/2307.14464",
    "context": "Title: Single Channel Speech Enhancement Using U-Net Spiking Neural Networks. (arXiv:2307.14464v1 [cs.SD])\nAbstract: Speech enhancement (SE) is crucial for reliable communication devices or robust speech recognition systems. Although conventional artificial neural networks (ANN) have demonstrated remarkable performance in SE, they require significant computational power, along with high energy costs. In this paper, we propose a novel approach to SE using a spiking neural network (SNN) based on a U-Net architecture. SNNs are suitable for processing data with a temporal dimension, such as speech, and are known for their energy-efficient implementation on neuromorphic hardware. As such, SNNs are thus interesting candidates for real-time applications on devices with limited resources. The primary objective of the current work is to develop an SNN-based model with comparable performance to a state-of-the-art ANN model for SE. We train a deep SNN using surrogate-gradient-based optimization and evaluate its performance using perceptual objective tests under different signal-to-noise ratios and real-world no",
    "path": "papers/23/07/2307.14464.json",
    "total_tokens": 855,
    "translated_title": "使用 U-Net 脉冲神经网络的单通道语音增强",
    "translated_abstract": "语音增强（SE）对于可靠的通信设备或稳健的语音识别系统至关重要。虽然常规的人工神经网络（ANN）在SE方面表现出色，但它们需要大量的计算能力和高能耗。在本文中，我们提出了一种基于U-Net结构的脉冲神经网络（SNN）来进行SE的新方法。SNN适用于处理具有时间维度的数据，如语音，并以其在神经形态硬件上的低能耗实现而闻名。因此，SNN是在资源有限的设备上进行实时应用的有趣候选。本工作的主要目标是开发一种基于SNN的模型，其性能可以与最先进的ANN模型相媲美。我们使用基于代理梯度的优化方法训练了一个深层SNN，并在不同信噪比和真实世界环境下使用感知客观测试来评估其性能。",
    "tldr": "本文提出了一种基于U-Net脉冲神经网络的单通道语音增强方法，该方法在提供可靠增强效果的同时，具有较低的计算能力和能耗需求。",
    "en_tdlr": "This paper proposes a single channel speech enhancement method based on U-Net spiking neural networks, which achieves reliable enhancement performance with lower computational power and energy costs."
}