{
    "title": "Uncertainty Guided Adaptive Warping for Robust and Efficient Stereo Matching. (arXiv:2307.14071v1 [cs.CV] CROSS LISTED)",
    "abstract": "Correlation based stereo matching has achieved outstanding performance, which pursues cost volume between two feature maps. Unfortunately, current methods with a fixed model do not work uniformly well across various datasets, greatly limiting their real-world applicability. To tackle this issue, this paper proposes a new perspective to dynamically calculate correlation for robust stereo matching. A novel Uncertainty Guided Adaptive Correlation (UGAC) module is introduced to robustly adapt the same model for different scenarios. Specifically, a variance-based uncertainty estimation is employed to adaptively adjust the sampling area during warping operation. Additionally, we improve the traditional non-parametric warping with learnable parameters, such that the position-specific weights can be learned. We show that by empowering the recurrent network with the UGAC module, stereo matching can be exploited more robustly and effectively. Extensive experiments demonstrate that our method ach",
    "link": "http://arxiv.org/abs/2307.14071",
    "context": "Title: Uncertainty Guided Adaptive Warping for Robust and Efficient Stereo Matching. (arXiv:2307.14071v1 [cs.CV] CROSS LISTED)\nAbstract: Correlation based stereo matching has achieved outstanding performance, which pursues cost volume between two feature maps. Unfortunately, current methods with a fixed model do not work uniformly well across various datasets, greatly limiting their real-world applicability. To tackle this issue, this paper proposes a new perspective to dynamically calculate correlation for robust stereo matching. A novel Uncertainty Guided Adaptive Correlation (UGAC) module is introduced to robustly adapt the same model for different scenarios. Specifically, a variance-based uncertainty estimation is employed to adaptively adjust the sampling area during warping operation. Additionally, we improve the traditional non-parametric warping with learnable parameters, such that the position-specific weights can be learned. We show that by empowering the recurrent network with the UGAC module, stereo matching can be exploited more robustly and effectively. Extensive experiments demonstrate that our method ach",
    "path": "papers/23/07/2307.14071.json",
    "total_tokens": 914,
    "translated_title": "用于鲁棒和高效的立体匹配的不确定性引导自适应变形",
    "translated_abstract": "基于相关的立体匹配取得了出色的性能，这是通过在两个特征图之间构建代价体来实现的。然而，当前的方法由于固定模型，在各种数据集上的表现并不一致，从而极大地限制了它们在实际应用中的适用性。为了解决这个问题，本文提出了一种动态计算相关性以用于鲁棒立体匹配的新视角。引入了一种新颖的不确定性引导自适应相关（UGAC）模块，以适应不同的场景。具体地，采用了基于方差的不确定性估计方法，在变形操作过程中自适应地调整采样区域。此外，我们改进了传统的非参数变形方法，引入可学习参数，从而可以学习位置特定的权重。实验证明，通过在循环网络中引入UGAC模块，可以更鲁棒和有效地利用立体匹配。广泛的实验证明了我们方法的性能。",
    "tldr": "本文提出了一种不确定性引导的自适应变形方法，用于鲁棒和高效的立体匹配。通过引入不确定性估计和可学习参数，可以在不同场景下适应性地调整采样区域，并实现更鲁棒和有效的立体匹配。",
    "en_tdlr": "This paper proposes an uncertainty-guided adaptive warping method for robust and efficient stereo matching. By introducing uncertainty estimation and learnable parameters, the sampling area can be adaptively adjusted in different scenarios, resulting in more robust and effective stereo matching."
}