{
    "title": "Complete and separate: Conditional separation with missing target source attribute completion. (arXiv:2307.14609v1 [cs.SD])",
    "abstract": "Recent approaches in source separation leverage semantic information about their input mixtures and constituent sources that when used in conditional separation models can achieve impressive performance. Most approaches along these lines have focused on simple descriptions, which are not always useful for varying types of input mixtures. In this work, we present an approach in which a model, given an input mixture and partial semantic information about a target source, is trained to extract additional semantic data. We then leverage this pre-trained model to improve the separation performance of an uncoupled multi-conditional separation network. Our experiments demonstrate that the separation performance of this multi-conditional model is significantly improved, approaching the performance of an oracle model with complete semantic information. Furthermore, our approach achieves performance levels that are comparable to those of the best performing specialized single conditional models,",
    "link": "http://arxiv.org/abs/2307.14609",
    "context": "Title: Complete and separate: Conditional separation with missing target source attribute completion. (arXiv:2307.14609v1 [cs.SD])\nAbstract: Recent approaches in source separation leverage semantic information about their input mixtures and constituent sources that when used in conditional separation models can achieve impressive performance. Most approaches along these lines have focused on simple descriptions, which are not always useful for varying types of input mixtures. In this work, we present an approach in which a model, given an input mixture and partial semantic information about a target source, is trained to extract additional semantic data. We then leverage this pre-trained model to improve the separation performance of an uncoupled multi-conditional separation network. Our experiments demonstrate that the separation performance of this multi-conditional model is significantly improved, approaching the performance of an oracle model with complete semantic information. Furthermore, our approach achieves performance levels that are comparable to those of the best performing specialized single conditional models,",
    "path": "papers/23/07/2307.14609.json",
    "total_tokens": 856,
    "translated_title": "完整且独立：具有缺失目标源属性补全的条件分离",
    "translated_abstract": "最近的源分离方法利用有关输入混合物和成分源的语义信息，在条件分离模型中使用可以实现令人印象深刻的性能。大多数这类方法专注于简单的描述，对于不同类型的输入混合物并不总是有用。在这项工作中，我们提出了一种方法，即给定输入混合物和有关目标源的部分语义信息，训练一个模型提取其他的语义数据。然后，我们利用这个预训练的模型来改进未耦合的多条件分离网络的分离性能。我们的实验证明，这个多条件模型的分离性能显著提高，接近具有完整语义信息的预设模型的性能。此外，我们的方法实现了与最佳性能的专门单条件模型相媲美的性能水平。",
    "tldr": "本论文提出了一种新的条件分离方法，通过训练一个模型来提取语义数据，然后利用这个模型来改进多条件分离网络的性能。实验证明，这个方法接近具有完整语义信息的预设模型的性能水平，并且与最佳性能的单条件模型相媲美。",
    "en_tdlr": "This paper presents a novel approach for conditional separation by training a model to extract semantic data and leveraging it to improve the performance of a multi-conditional separation network. Experiments show that this method achieves performance levels approaching those of an oracle model with complete semantic information and comparable to the best performing single conditional models."
}