{
    "title": "Data-driven Predictive Latency for 5G: A Theoretical and Experimental Analysis Using Network Measurements. (arXiv:2307.02329v2 [cs.NI] UPDATED)",
    "abstract": "The advent of novel 5G services and applications with binding latency requirements and guaranteed Quality of Service (QoS) hastened the need to incorporate autonomous and proactive decision-making in network management procedures. The objective of our study is to provide a thorough analysis of predictive latency within 5G networks by utilizing real-world network data that is accessible to mobile network operators (MNOs). In particular, (i) we present an analytical formulation of the user-plane latency as a Hypoexponential distribution, which is validated by means of a comparative analysis with empirical measurements, and (ii) we conduct experimental results of probabilistic regression, anomaly detection, and predictive forecasting leveraging on emerging domains in Machine Learning (ML), such as Bayesian Learning (BL) and Machine Learning on Graphs (GML). We test our predictive framework using data gathered from scenarios of vehicular mobility, dense-urban traffic, and social gathering ",
    "link": "http://arxiv.org/abs/2307.02329",
    "context": "Title: Data-driven Predictive Latency for 5G: A Theoretical and Experimental Analysis Using Network Measurements. (arXiv:2307.02329v2 [cs.NI] UPDATED)\nAbstract: The advent of novel 5G services and applications with binding latency requirements and guaranteed Quality of Service (QoS) hastened the need to incorporate autonomous and proactive decision-making in network management procedures. The objective of our study is to provide a thorough analysis of predictive latency within 5G networks by utilizing real-world network data that is accessible to mobile network operators (MNOs). In particular, (i) we present an analytical formulation of the user-plane latency as a Hypoexponential distribution, which is validated by means of a comparative analysis with empirical measurements, and (ii) we conduct experimental results of probabilistic regression, anomaly detection, and predictive forecasting leveraging on emerging domains in Machine Learning (ML), such as Bayesian Learning (BL) and Machine Learning on Graphs (GML). We test our predictive framework using data gathered from scenarios of vehicular mobility, dense-urban traffic, and social gathering ",
    "path": "papers/23/07/2307.02329.json",
    "total_tokens": 995,
    "translated_title": "基于数据驱动的预测性5G延迟：利用网络测量进行理论和实验分析",
    "translated_abstract": "随着5G服务和应用的出现，具有绑定延迟要求和保证服务质量（QoS）的需求迫使网络管理程序纳入自主和主动决策。我们研究的目标是利用移动网络运营商（MNOs）可以访问的真实网络数据，对5G网络中的预测性延迟进行全面分析。具体而言，（i）我们提出了作为Hypoexponential分布的用户面延迟的分析表达式，并通过与实证测量的比较分析进行验证，（ii）我们进行了概率回归、异常检测和预测性预测的实验结果，利用了机器学习领域中的新兴领域，如贝叶斯学习（BL）和图机器学习（GML）。我们使用从车辆移动、密集城区交通和社交聚会场景中收集的数据测试我们的预测框架。",
    "tldr": "本研究利用实际网络数据对5G网络中的预测性延迟进行了全面分析，并提出了以Hypoexponential分布为基础的用户面延迟的分析表达式。通过机器学习领域的贝叶斯学习和图机器学习技术，我们进行了概率回归、异常检测和预测性预测的实验。测试结果表明，该预测框架适用于不同情景下的移动性、城市交通和社交聚会。",
    "en_tdlr": "This study provides a comprehensive analysis of predictive latency in 5G networks using real-world network data and proposes an analytical formulation of user-plane latency based on the Hypoexponential distribution. Experimental results using Bayesian learning and graph machine learning techniques demonstrate the effectiveness of the predictive framework in scenarios of vehicular mobility, dense-urban traffic, and social gathering."
}