{
    "title": "DBFed: Debiasing Federated Learning Framework based on Domain-Independent. (arXiv:2307.05582v1 [cs.LG])",
    "abstract": "As digital transformation continues, enterprises are generating, managing, and storing vast amounts of data, while artificial intelligence technology is rapidly advancing. However, it brings challenges in information security and data security. Data security refers to the protection of digital information from unauthorized access, damage, theft, etc. throughout its entire life cycle. With the promulgation and implementation of data security laws and the emphasis on data security and data privacy by organizations and users, Privacy-preserving technology represented by federated learning has a wide range of application scenarios. Federated learning is a distributed machine learning computing framework that allows multiple subjects to train joint models without sharing data to protect data privacy and solve the problem of data islands. However, the data among multiple subjects are independent of each other, and the data differences in quality may cause fairness issues in federated learnin",
    "link": "http://arxiv.org/abs/2307.05582",
    "context": "Title: DBFed: Debiasing Federated Learning Framework based on Domain-Independent. (arXiv:2307.05582v1 [cs.LG])\nAbstract: As digital transformation continues, enterprises are generating, managing, and storing vast amounts of data, while artificial intelligence technology is rapidly advancing. However, it brings challenges in information security and data security. Data security refers to the protection of digital information from unauthorized access, damage, theft, etc. throughout its entire life cycle. With the promulgation and implementation of data security laws and the emphasis on data security and data privacy by organizations and users, Privacy-preserving technology represented by federated learning has a wide range of application scenarios. Federated learning is a distributed machine learning computing framework that allows multiple subjects to train joint models without sharing data to protect data privacy and solve the problem of data islands. However, the data among multiple subjects are independent of each other, and the data differences in quality may cause fairness issues in federated learnin",
    "path": "papers/23/07/2307.05582.json",
    "total_tokens": 853,
    "translated_title": "DBFed: 基于领域无关性的去偏差联邦学习框架",
    "translated_abstract": "随着数字化转型的持续进行，企业正在产生、管理和存储大量的数据，而人工智能技术也在迅速发展。然而，这也给信息安全和数据安全带来了挑战。数据安全是指在其整个生命周期内，保护数字信息免受未经授权的访问、损坏、盗窃等的损害。随着数据安全法的颁布和执行以及组织和用户对数据安全和数据隐私的重视，以联邦学习为代表的隐私保护技术在各种应用场景中有广泛的应用。联邦学习是一种分布式机器学习计算框架，允许多个主体在不共享数据的情况下进行共同模型训练，以保护数据隐私并解决数据孤岛问题。然而，多个主体之间的数据彼此独立，而质量上的差异可能导致联邦学习中的公平性问题。",
    "tldr": "DBFed是一个基于领域无关性的去偏差联邦学习框架，解决了在联邦学习中由数据质量差异引起的公平性问题。",
    "en_tdlr": "DBFed is a debiasing federated learning framework based on domain independence, addressing the fairness issues caused by data quality differences in federated learning."
}