{
    "title": "Latent Space Perspicacity and Interpretation Enhancement (LS-PIE) Framework. (arXiv:2307.05620v1 [stat.ML])",
    "abstract": "Linear latent variable models such as principal component analysis (PCA), independent component analysis (ICA), canonical correlation analysis (CCA), and factor analysis (FA) identify latent directions (or loadings) either ordered or unordered. The data is then projected onto the latent directions to obtain their projected representations (or scores). For example, PCA solvers usually rank the principal directions by explaining the most to least variance, while ICA solvers usually return independent directions unordered and often with single sources spread across multiple directions as multiple sub-sources, which is of severe detriment to their usability and interpretability.  This paper proposes a general framework to enhance latent space representations for improving the interpretability of linear latent spaces. Although the concepts in this paper are language agnostic, the framework is written in Python. This framework automates the clustering and ranking of latent vectors to enhance",
    "link": "http://arxiv.org/abs/2307.05620",
    "context": "Title: Latent Space Perspicacity and Interpretation Enhancement (LS-PIE) Framework. (arXiv:2307.05620v1 [stat.ML])\nAbstract: Linear latent variable models such as principal component analysis (PCA), independent component analysis (ICA), canonical correlation analysis (CCA), and factor analysis (FA) identify latent directions (or loadings) either ordered or unordered. The data is then projected onto the latent directions to obtain their projected representations (or scores). For example, PCA solvers usually rank the principal directions by explaining the most to least variance, while ICA solvers usually return independent directions unordered and often with single sources spread across multiple directions as multiple sub-sources, which is of severe detriment to their usability and interpretability.  This paper proposes a general framework to enhance latent space representations for improving the interpretability of linear latent spaces. Although the concepts in this paper are language agnostic, the framework is written in Python. This framework automates the clustering and ranking of latent vectors to enhance",
    "path": "papers/23/07/2307.05620.json",
    "total_tokens": 864,
    "translated_title": "潜在空间洞察力和解释增强（LS-PIE）框架",
    "translated_abstract": "线性潜变量模型如主成分分析（PCA）、独立成分分析（ICA）、典型相关分析（CCA）和因子分析（FA）通常会识别有序或无序的潜在方向（或载荷）。然后将数据投影到潜在方向上以获得它们的投影表示（或得分）。然而，ICA求解器通常无序地返回独立方向，并且往往将单一源分布在多个方向上作为多个子源，这对于其可用性和可解释性很不利。本文提出了一个通用框架，用于增强线性潜在空间的解释能力。尽管本文介绍的概念与语言无关，但该框架是用Python编写的。该框架自动化了潜在向量的聚类和排序，以增强解释能力。",
    "tldr": "本文提出了一个名为LS-PIE的框架，用于提高线性潜在空间的解释能力。该框架通过自动化潜在向量的聚类和排序，从而改善了主成分分析、独立成分分析等线性潜变量模型的可解释性。"
}