{
    "title": "Solving higher-order Lane-Emden-Fowler type equations using physics-informed neural networks: benchmark tests comparing soft and hard constraints. (arXiv:2307.07302v1 [physics.comp-ph])",
    "abstract": "In this paper, numerical methods using Physics-Informed Neural Networks (PINNs) are presented with the aim to solve higher-order ordinary differential equations (ODEs). Indeed, this deep-learning technique is successfully applied for solving different classes of singular ODEs, namely the well known second-order Lane-Emden equations, third order-order Emden-Fowler equations, and fourth-order Lane-Emden-Fowler equations. Two variants of PINNs technique are considered and compared. First, a minimization procedure is used to constrain the total loss function of the neural network, in which the equation residual is considered with some weight to form a physics-based loss and added to the training data loss that contains the initial/boundary conditions. Second, a specific choice of trial solutions ensuring these conditions as hard constraints is done in order to satisfy the differential equation, contrary to the first variant based on training data where the constraints appear as soft ones. ",
    "link": "http://arxiv.org/abs/2307.07302",
    "context": "Title: Solving higher-order Lane-Emden-Fowler type equations using physics-informed neural networks: benchmark tests comparing soft and hard constraints. (arXiv:2307.07302v1 [physics.comp-ph])\nAbstract: In this paper, numerical methods using Physics-Informed Neural Networks (PINNs) are presented with the aim to solve higher-order ordinary differential equations (ODEs). Indeed, this deep-learning technique is successfully applied for solving different classes of singular ODEs, namely the well known second-order Lane-Emden equations, third order-order Emden-Fowler equations, and fourth-order Lane-Emden-Fowler equations. Two variants of PINNs technique are considered and compared. First, a minimization procedure is used to constrain the total loss function of the neural network, in which the equation residual is considered with some weight to form a physics-based loss and added to the training data loss that contains the initial/boundary conditions. Second, a specific choice of trial solutions ensuring these conditions as hard constraints is done in order to satisfy the differential equation, contrary to the first variant based on training data where the constraints appear as soft ones. ",
    "path": "papers/23/07/2307.07302.json",
    "total_tokens": 876,
    "translated_title": "使用物理约束神经网络解决高阶Lane-Emden-Fowler类型方程：基准测试比较软约束和硬约束",
    "translated_abstract": "本文提出了使用物理约束神经网络（PINNs）解决高阶常微分方程（ODEs）的数值方法。事实上，这种深度学习技术成功地应用于解决不同类别的奇异ODEs，即着名的二阶Lane-Emden方程、三阶Emden-Fowler方程和四阶Lane-Emden-Fowler方程。对PINNs技术的两个变体进行了考虑和比较。首先，使用最小化过程来约束神经网络的总损失函数，在其中将方程残差考虑为具有一定权重的基于物理的损失，并添加到包含初始/边界条件的训练数据损失中。其次，为了满足微分方程，采用了一种特定的试验解选择，确保这些条件成为硬约束，与第一个变体基于训练数据的约束不同，约束以软约束形式出现。",
    "tldr": "本文使用物理约束神经网络（PINNs）成功解决了高阶Lane-Emden-Fowler类型方程，通过比较软约束和硬约束的变体，得出了有效的数值方法。",
    "en_tdlr": "This paper presents the successful application of Physics-Informed Neural Networks (PINNs) to solve higher-order Lane-Emden-Fowler type equations, comparing soft and hard constraints variants and providing effective numerical methods."
}