{
    "title": "Bio-Inspired Night Image Enhancement Based on Contrast Enhancement and Denoising. (arXiv:2307.05447v1 [cs.CV])",
    "abstract": "Due to the low accuracy of object detection and recognition in many intelligent surveillance systems at nighttime, the quality of night images is crucial. Compared with the corresponding daytime image, nighttime image is characterized as low brightness, low contrast and high noise. In this paper, a bio-inspired image enhancement algorithm is proposed to convert a low illuminance image to a brighter and clear one. Different from existing bio-inspired algorithm, the proposed method doesn't use any training sequences, we depend on a novel chain of contrast enhancement and denoising algorithms without using any forms of recursive functions. Our method can largely improve the brightness and contrast of night images, besides, suppress noise. Then we implement on real experiment, and simulation experiment to test our algorithms. Both results show the advantages of proposed algorithm over contrast pair, Meylan and Retinex.",
    "link": "http://arxiv.org/abs/2307.05447",
    "context": "Title: Bio-Inspired Night Image Enhancement Based on Contrast Enhancement and Denoising. (arXiv:2307.05447v1 [cs.CV])\nAbstract: Due to the low accuracy of object detection and recognition in many intelligent surveillance systems at nighttime, the quality of night images is crucial. Compared with the corresponding daytime image, nighttime image is characterized as low brightness, low contrast and high noise. In this paper, a bio-inspired image enhancement algorithm is proposed to convert a low illuminance image to a brighter and clear one. Different from existing bio-inspired algorithm, the proposed method doesn't use any training sequences, we depend on a novel chain of contrast enhancement and denoising algorithms without using any forms of recursive functions. Our method can largely improve the brightness and contrast of night images, besides, suppress noise. Then we implement on real experiment, and simulation experiment to test our algorithms. Both results show the advantages of proposed algorithm over contrast pair, Meylan and Retinex.",
    "path": "papers/23/07/2307.05447.json",
    "total_tokens": 895,
    "translated_title": "基于对比度增强和降噪的生物启发式夜间图像增强",
    "translated_abstract": "由于在许多智能监控系统中夜间目标检测和识别的准确性较低，夜间图像的质量至关重要。与相应的白天图像相比，夜间图像的特点是亮度低、对比度低和噪声高。本文提出了一种基于生物启发的图像增强算法，用于将低照度图像转换为更亮、更清晰的图像。与现有的生物启发式算法不同，所提出的方法不使用任何训练序列，而是依赖于一系列对比度增强和降噪算法的链条，而不使用任何形式的递归函数。我们的方法可以大大提高夜间图像的亮度和对比度，并抑制噪声。然后我们对真实实验和模拟实验进行了测试。两个结果都显示了提出的算法相对于对比度对、Meylan和Retinex的优势。",
    "tldr": "本文提出了一种基于对比度增强和降噪的生物启发式夜间图像增强算法，能够将低照度的夜间图像转换为更亮、更清晰的图像，同时能够抑制噪声。实验证明，该算法相对于其他算法具有明显优势。",
    "en_tdlr": "This paper proposes a bio-inspired night image enhancement algorithm based on contrast enhancement and denoising, which can convert low illuminance night images to brighter and clearer ones while suppressing noise. Experimental results demonstrate its significant advantages over other algorithms."
}