{
    "title": "Causal-learn: Causal Discovery in Python. (arXiv:2307.16405v1 [cs.LG])",
    "abstract": "Causal discovery aims at revealing causal relations from observational data, which is a fundamental task in science and engineering. We describe $\\textit{causal-learn}$, an open-source Python library for causal discovery. This library focuses on bringing a comprehensive collection of causal discovery methods to both practitioners and researchers. It provides easy-to-use APIs for non-specialists, modular building blocks for developers, detailed documentation for learners, and comprehensive methods for all. Different from previous packages in R or Java, $\\textit{causal-learn}$ is fully developed in Python, which could be more in tune with the recent preference shift in programming languages within related communities. The library is available at https://github.com/py-why/causal-learn.",
    "link": "http://arxiv.org/abs/2307.16405",
    "context": "Title: Causal-learn: Causal Discovery in Python. (arXiv:2307.16405v1 [cs.LG])\nAbstract: Causal discovery aims at revealing causal relations from observational data, which is a fundamental task in science and engineering. We describe $\\textit{causal-learn}$, an open-source Python library for causal discovery. This library focuses on bringing a comprehensive collection of causal discovery methods to both practitioners and researchers. It provides easy-to-use APIs for non-specialists, modular building blocks for developers, detailed documentation for learners, and comprehensive methods for all. Different from previous packages in R or Java, $\\textit{causal-learn}$ is fully developed in Python, which could be more in tune with the recent preference shift in programming languages within related communities. The library is available at https://github.com/py-why/causal-learn.",
    "path": "papers/23/07/2307.16405.json",
    "total_tokens": 733,
    "translated_title": "Causal-learn: Python中的因果发现",
    "translated_abstract": "因果发现旨在从观测数据中揭示因果关系，这是科学和工程中的一项基础任务。我们描述了$\\textit {causal-learn}$，一个用于因果发现的开源Python库。该库专注于为从业者和研究人员提供全面的因果发现方法。它为非专业人员提供易于使用的API，为开发人员提供模块化构建块，为学习者提供详细的文档，并提供全面的方法。与之前的R或Java包不同，$\\textit {causal-learn}$完全由Python开发，这更符合相关社区在编程语言方面的最近偏好转变。该库可在https://github.com/py-why/causal-learn上获得。",
    "tldr": "Causal-learn是一个Python库，提供了全面的因果发现方法，适用于从业者和研究人员。与其他语言开发的包不同，Causal-learn完全由Python开发。",
    "en_tdlr": "Causal-learn is a Python library that provides comprehensive causal discovery methods for both practitioners and researchers. Unlike packages developed in other languages, Causal-learn is fully developed in Python."
}