{
    "title": "New Interaction Paradigm for Complex EDA Software Leveraging GPT. (arXiv:2307.14740v1 [cs.SE])",
    "abstract": "In the rapidly growing field of electronic design automation (EDA), professional software such as KiCad, Cadence , and Altium Designer provide increasingly extensive design functionalities. However, the intricate command structure and high learning curve create a barrier, particularly for novice printed circuit board (PCB) designers. This results in difficulties in selecting appropriate functions or plugins for varying design purposes, compounded by the lack of intuitive learning methods beyond traditional documentation, videos, and online forums. To address this challenge, an artificial intelligence (AI) interaction assist plugin for EDA software named SmartonAl is developed here, also KiCad is taken as the first example. SmartonAI is inspired by the HuggingGPT framework and employs large language models, such as GPT and BERT, to facilitate task planning and execution. On receiving a designer request, SmartonAI conducts a task breakdown and efficiently executes relevant subtasks, such",
    "link": "http://arxiv.org/abs/2307.14740",
    "context": "Title: New Interaction Paradigm for Complex EDA Software Leveraging GPT. (arXiv:2307.14740v1 [cs.SE])\nAbstract: In the rapidly growing field of electronic design automation (EDA), professional software such as KiCad, Cadence , and Altium Designer provide increasingly extensive design functionalities. However, the intricate command structure and high learning curve create a barrier, particularly for novice printed circuit board (PCB) designers. This results in difficulties in selecting appropriate functions or plugins for varying design purposes, compounded by the lack of intuitive learning methods beyond traditional documentation, videos, and online forums. To address this challenge, an artificial intelligence (AI) interaction assist plugin for EDA software named SmartonAl is developed here, also KiCad is taken as the first example. SmartonAI is inspired by the HuggingGPT framework and employs large language models, such as GPT and BERT, to facilitate task planning and execution. On receiving a designer request, SmartonAI conducts a task breakdown and efficiently executes relevant subtasks, such",
    "path": "papers/23/07/2307.14740.json",
    "total_tokens": 869,
    "translated_title": "基于GPT的复杂EDA软件新交互范式",
    "translated_abstract": "在电子设计自动化（EDA）领域中，专业软件如KiCad、Cadence和Altium Designer提供越来越广泛的设计功能。然而，复杂的命令结构和较高的学习曲线对于初学者的印刷电路板（PCB）设计师来说造成了障碍。这导致难以选择适合不同设计目的的功能或插件，并且传统文档、视频和在线论坛之外缺乏直观的学习方法。为解决这一挑战，本研究开发了一个名为SmartonAI的EDA软件人工智能交互辅助插件，其中以KiCad作为第一个示例。SmartonAI受到HuggingGPT框架的启发，采用了GPT和BERT等大型语言模型，以促进任务规划和执行。当接收到设计师的请求时，SmartonAI会进行任务分解并高效执行相关的子任务，",
    "tldr": "本研究通过开发SmartonAI插件，基于GPT和BERT等大型语言模型，提供一种新的交互范式来解决EDA软件中初学者面临的复杂命令结构和高学习曲线问题。",
    "en_tdlr": "This research addresses the challenges of complex command structures and steep learning curve in EDA software for novice PCB designers by developing SmartonAI, an AI interaction assist plugin that utilizes large language models such as GPT and BERT to provide a new interaction paradigm."
}