{
    "title": "Multimodal Deep Learning for Personalized Renal Cell Carcinoma Prognosis: Integrating CT Imaging and Clinical Data. (arXiv:2307.03575v1 [cs.CV])",
    "abstract": "Renal cell carcinoma represents a significant global health challenge with a low survival rate. This research aimed to devise a comprehensive deep-learning model capable of predicting survival probabilities in patients with renal cell carcinoma by integrating CT imaging and clinical data and addressing the limitations observed in prior studies. The aim is to facilitate the identification of patients requiring urgent treatment. The proposed framework comprises three modules: a 3D image feature extractor, clinical variable selection, and survival prediction. The feature extractor module, based on the 3D CNN architecture, predicts the ISUP grade of renal cell carcinoma tumors linked to mortality rates from CT images. A selection of clinical variables is systematically chosen using the Spearman score and random forest importance score as criteria. A deep learning-based network, trained with discrete LogisticHazard-based loss, performs the survival prediction. Nine distinct experiments are ",
    "link": "http://arxiv.org/abs/2307.03575",
    "context": "Title: Multimodal Deep Learning for Personalized Renal Cell Carcinoma Prognosis: Integrating CT Imaging and Clinical Data. (arXiv:2307.03575v1 [cs.CV])\nAbstract: Renal cell carcinoma represents a significant global health challenge with a low survival rate. This research aimed to devise a comprehensive deep-learning model capable of predicting survival probabilities in patients with renal cell carcinoma by integrating CT imaging and clinical data and addressing the limitations observed in prior studies. The aim is to facilitate the identification of patients requiring urgent treatment. The proposed framework comprises three modules: a 3D image feature extractor, clinical variable selection, and survival prediction. The feature extractor module, based on the 3D CNN architecture, predicts the ISUP grade of renal cell carcinoma tumors linked to mortality rates from CT images. A selection of clinical variables is systematically chosen using the Spearman score and random forest importance score as criteria. A deep learning-based network, trained with discrete LogisticHazard-based loss, performs the survival prediction. Nine distinct experiments are ",
    "path": "papers/23/07/2307.03575.json",
    "total_tokens": 905,
    "translated_title": "多模态深度学习用于个性化肾细胞癌预后：整合CT成像和临床数据",
    "translated_abstract": "肾细胞癌是一个低生存率的重要全球健康挑战。本研究旨在设计一个综合的深度学习模型，通过整合CT成像和临床数据，解决以往研究中存在的限制，能够预测肾细胞癌患者的生存概率，以便辅助识别需要紧急治疗的患者。所提出的框架包括三个模块：3D图像特征提取器、临床变量选择和生存预测。基于3D CNN架构的特征提取器模块，通过CT图像预测与肾细胞癌病灶相关的死亡率的ISUP分级。通过使用Spearman分数和随机森林重要性分数作为标准，系统地选择一些临床变量。使用离散的LogisticHazard-based损失训练的基于深度学习的网络进行生存预测。进行了九个不同的实验。",
    "tldr": "本研究通过综合CT成像和临床数据，设计了一个深度学习模型，可以预测肾细胞癌患者的生存概率，并辅助识别需要紧急治疗的患者。",
    "en_tdlr": "This research presents a deep-learning model that integrates CT imaging and clinical data to predict survival probabilities in patients with renal cell carcinoma, helping to identify patients in need of urgent treatment."
}