{
    "title": "LightPath: Lightweight and Scalable Path Representation Learning. (arXiv:2307.10171v1 [cs.LG])",
    "abstract": "Movement paths are used widely in intelligent transportation and smart city applications. To serve such applications, path representation learning aims to provide compact representations of paths that enable efficient and accurate operations when used for different downstream tasks such as path ranking and travel cost estimation. In many cases, it is attractive that the path representation learning is lightweight and scalable; in resource-limited environments and under green computing limitations, it is essential. Yet, existing path representation learning studies focus on accuracy and pay at most secondary attention to resource consumption and scalability.  We propose a lightweight and scalable path representation learning framework, termed LightPath, that aims to reduce resource consumption and achieve scalability without affecting accuracy, thus enabling broader applicability. More specifically, we first propose a sparse auto-encoder that ensures that the framework achieves good sca",
    "link": "http://arxiv.org/abs/2307.10171",
    "context": "Title: LightPath: Lightweight and Scalable Path Representation Learning. (arXiv:2307.10171v1 [cs.LG])\nAbstract: Movement paths are used widely in intelligent transportation and smart city applications. To serve such applications, path representation learning aims to provide compact representations of paths that enable efficient and accurate operations when used for different downstream tasks such as path ranking and travel cost estimation. In many cases, it is attractive that the path representation learning is lightweight and scalable; in resource-limited environments and under green computing limitations, it is essential. Yet, existing path representation learning studies focus on accuracy and pay at most secondary attention to resource consumption and scalability.  We propose a lightweight and scalable path representation learning framework, termed LightPath, that aims to reduce resource consumption and achieve scalability without affecting accuracy, thus enabling broader applicability. More specifically, we first propose a sparse auto-encoder that ensures that the framework achieves good sca",
    "path": "papers/23/07/2307.10171.json",
    "total_tokens": 798,
    "translated_title": "LightPath: 轻量级和可伸缩的路径表示学习",
    "translated_abstract": "移动路径广泛应用于智能交通和智能城市应用中。为了服务这些应用，路径表示学习旨在提供路径的紧凑表示，以在不同的下游任务（如路径排序和旅行成本估计）中实现高效准确的操作。在资源受限的环境下和绿色计算限制下，路径表示学习的轻量级和可伸缩性非常重要。然而，现有的路径表示学习研究主要关注准确性，对资源消耗和可伸缩性次要关注。我们提出了一个轻量级和可伸缩的路径表示学习框架，命名为LightPath，旨在降低资源消耗，实现可伸缩性，同时不影响准确性，从而实现更广泛的适用性。",
    "tldr": "LightPath是一个轻量级和可伸缩的路径表示学习框架，旨在实现在资源受限的环境下降低资源消耗和实现可伸缩性，同时保持高准确性，从而实现更广泛的适用性。",
    "en_tdlr": "LightPath is a lightweight and scalable path representation learning framework, aiming to reduce resource consumption and achieve scalability in resource-limited environments, while maintaining high accuracy for broader applicability."
}