{
    "title": "Efficient Prediction of Peptide Self-assembly through Sequential and Graphical Encoding. (arXiv:2307.09169v1 [q-bio.BM])",
    "abstract": "In recent years, there has been an explosion of research on the application of deep learning to the prediction of various peptide properties, due to the significant development and market potential of peptides. Molecular dynamics has enabled the efficient collection of large peptide datasets, providing reliable training data for deep learning. However, the lack of systematic analysis of the peptide encoding, which is essential for AI-assisted peptide-related tasks, makes it an urgent problem to be solved for the improvement of prediction accuracy. To address this issue, we first collect a high-quality, colossal simulation dataset of peptide self-assembly containing over 62,000 samples generated by coarse-grained molecular dynamics (CGMD). Then, we systematically investigate the effect of peptide encoding of amino acids into sequences and molecular graphs using state-of-the-art sequential (i.e., RNN, LSTM, and Transformer) and structural deep learning models (i.e., GCN, GAT, and GraphSA",
    "link": "http://arxiv.org/abs/2307.09169",
    "context": "Title: Efficient Prediction of Peptide Self-assembly through Sequential and Graphical Encoding. (arXiv:2307.09169v1 [q-bio.BM])\nAbstract: In recent years, there has been an explosion of research on the application of deep learning to the prediction of various peptide properties, due to the significant development and market potential of peptides. Molecular dynamics has enabled the efficient collection of large peptide datasets, providing reliable training data for deep learning. However, the lack of systematic analysis of the peptide encoding, which is essential for AI-assisted peptide-related tasks, makes it an urgent problem to be solved for the improvement of prediction accuracy. To address this issue, we first collect a high-quality, colossal simulation dataset of peptide self-assembly containing over 62,000 samples generated by coarse-grained molecular dynamics (CGMD). Then, we systematically investigate the effect of peptide encoding of amino acids into sequences and molecular graphs using state-of-the-art sequential (i.e., RNN, LSTM, and Transformer) and structural deep learning models (i.e., GCN, GAT, and GraphSA",
    "path": "papers/23/07/2307.09169.json",
    "total_tokens": 859,
    "translated_title": "高效预测肽自组装的序列和图形编码",
    "translated_abstract": "最近几年，由于肽的重要发展和市场潜力，深度学习在预测各种肽属性方面的应用研究爆炸性增长。分子动力学使得收集大量肽数据集成为可能，为深度学习提供可靠的训练数据。然而，对于AI辅助肽相关任务至关重要的肽编码缺乏系统分析，这成为提高预测准确性的紧迫问题。为了解决这个问题，我们首先收集了一个高质量的巨大模拟肽自组装数据集，其中包含超过62,000个由粗粒度分子动力学（CGMD）生成的样本。然后，我们使用最先进的序列（RNN，LSTM和Transformer）和结构深度学习模型（GCN，GAT和GraphSA）系统地研究了将氨基酸编码为序列和分子图的效果。",
    "tldr": "本论文研究了肽自组装的预测问题，通过收集大量肽数据集，并使用序列和图形的编码方式进行深度学习模型的训练，对提高预测准确性进行了系统分析。",
    "en_tdlr": "This paper investigates the prediction of peptide self-assembly by collecting a large peptide dataset and training deep learning models using sequential and graphical encoding methods, systematically analyzing their effects on improving prediction accuracy."
}