{
    "title": "Machine Learning-powered Pricing of the Multidimensional Passport Option. (arXiv:2307.14887v1 [q-fin.PR])",
    "abstract": "Introduced in the late 90s, the passport option gives its holder the right to trade in a market and receive any positive gain in the resulting traded account at maturity. Pricing the option amounts to solving a stochastic control problem that for $d>1$ risky assets remains an open problem. Even in a correlated Black-Scholes (BS) market with $d=2$ risky assets, no optimal trading strategy has been derived in closed form. In this paper, we derive a discrete-time solution for multi-dimensional BS markets with uncorrelated assets. Moreover, inspired by the success of deep reinforcement learning in, e.g., board games, we propose two machine learning-powered approaches to pricing general options on a portfolio value in general markets. These approaches prove to be successful for pricing the passport option in one-dimensional and multi-dimensional uncorrelated BS markets.",
    "link": "http://arxiv.org/abs/2307.14887",
    "context": "Title: Machine Learning-powered Pricing of the Multidimensional Passport Option. (arXiv:2307.14887v1 [q-fin.PR])\nAbstract: Introduced in the late 90s, the passport option gives its holder the right to trade in a market and receive any positive gain in the resulting traded account at maturity. Pricing the option amounts to solving a stochastic control problem that for $d>1$ risky assets remains an open problem. Even in a correlated Black-Scholes (BS) market with $d=2$ risky assets, no optimal trading strategy has been derived in closed form. In this paper, we derive a discrete-time solution for multi-dimensional BS markets with uncorrelated assets. Moreover, inspired by the success of deep reinforcement learning in, e.g., board games, we propose two machine learning-powered approaches to pricing general options on a portfolio value in general markets. These approaches prove to be successful for pricing the passport option in one-dimensional and multi-dimensional uncorrelated BS markets.",
    "path": "papers/23/07/2307.14887.json",
    "total_tokens": 823,
    "translated_title": "机器学习推动的多维护照期权定价",
    "translated_abstract": "护照期权从90年代末开始引入，它给予持有人在市场上交易并在到期时获得任何正收益的权利。定价期权相当于解决一个随机控制问题，对于$d>1$个风险资产的情况仍然是一个未解决的问题。即使在具有$d=2$个风险资产的相关布莱克-斯科尔斯 (BS) 市场中，也没有得出闭合形式的最优交易策略。在本文中，我们推导了一个离散时间的解决方案，适用于具有不相关资产的多维BS市场。此外，受到深度强化学习在棋盘游戏等领域的成功启发，我们提出了两种机器学习推动的方法来定价一般市场上的组合价值的一般期权。这些方法在一维和多维不相关BS市场中证明了定价护照期权的成功。",
    "tldr": "本文通过机器学习的方法解决了多维布莱克-斯科尔斯市场中护照期权的定价问题，并证明了其有效性。",
    "en_tdlr": "This paper proposes machine learning-powered approaches to price passport options in multi-dimensional Black-Scholes markets, and demonstrates their effectiveness."
}