{
    "title": "Multitemporal SAR images change detection and visualization using RABASAR and simplified GLR. (arXiv:2307.07892v1 [cs.CV])",
    "abstract": "Understanding the state of changed areas requires that precise information be given about the changes. Thus, detecting different kinds of changes is important for land surface monitoring. SAR sensors are ideal to fulfil this task, because of their all-time and all-weather capabilities, with good accuracy of the acquisition geometry and without effects of atmospheric constituents for amplitude data. In this study, we propose a simplified generalized likelihood ratio ($S_{GLR}$) method assuming that corresponding temporal pixels have the same equivalent number of looks (ENL). Thanks to the denoised data provided by a ratio-based multitemporal SAR image denoising method (RABASAR), we successfully applied this similarity test approach to compute the change areas. A new change magnitude index method and an improved spectral clustering-based change classification method are also developed. In addition, we apply the simplified generalized likelihood ratio to detect the maximum change magnitud",
    "link": "http://arxiv.org/abs/2307.07892",
    "context": "Title: Multitemporal SAR images change detection and visualization using RABASAR and simplified GLR. (arXiv:2307.07892v1 [cs.CV])\nAbstract: Understanding the state of changed areas requires that precise information be given about the changes. Thus, detecting different kinds of changes is important for land surface monitoring. SAR sensors are ideal to fulfil this task, because of their all-time and all-weather capabilities, with good accuracy of the acquisition geometry and without effects of atmospheric constituents for amplitude data. In this study, we propose a simplified generalized likelihood ratio ($S_{GLR}$) method assuming that corresponding temporal pixels have the same equivalent number of looks (ENL). Thanks to the denoised data provided by a ratio-based multitemporal SAR image denoising method (RABASAR), we successfully applied this similarity test approach to compute the change areas. A new change magnitude index method and an improved spectral clustering-based change classification method are also developed. In addition, we apply the simplified generalized likelihood ratio to detect the maximum change magnitud",
    "path": "papers/23/07/2307.07892.json",
    "total_tokens": 865,
    "translated_title": "多时相SAR图像变化检测和可视化使用RABASAR和简化GLR",
    "translated_abstract": "了解变化区域的状态需要提供关于变化的精确信息。因此，检测不同类型的变化对于地表监测是重要的。SAR传感器非常适合完成这项任务，因为它们具有全天候和全天时间的能力，且在幅度数据中不受大气成分影响的准确的获取几何和等效样本数量。在本研究中，我们提出了一个简化的广义似然比 ($S_{GLR}$) 方法，假设相应的时域像素具有相同的等效样本数量 (ENL)。借助于由基于比率的多时相SAR图像去噪方法 (RABASAR) 提供的去噪数据，我们成功地应用了这种相似性测试方法来计算变化区域。还开发了一种新的变化幅度指数方法和改进的基于光谱聚类的变化分类方法。此外，我们将简化的广义似然比应用于检测最大变化幅度。",
    "tldr": "通过使用RABASAR和简化的GLR方法，在多时相SAR图像中进行变化检测和可视化，并开发了新的变化幅度指数方法和改进的变化分类方法。"
}