{
    "title": "Amortised Experimental Design and Parameter Estimation for User Models of Pointing. (arXiv:2307.09878v1 [cs.AI])",
    "abstract": "User models play an important role in interaction design, supporting automation of interaction design choices. In order to do so, model parameters must be estimated from user data. While very large amounts of user data are sometimes required, recent research has shown how experiments can be designed so as to gather data and infer parameters as efficiently as possible, thereby minimising the data requirement. In the current article, we investigate a variant of these methods that amortises the computational cost of designing experiments by training a policy for choosing experimental designs with simulated participants. Our solution learns which experiments provide the most useful data for parameter estimation by interacting with in-silico agents sampled from the model space thereby using synthetic data rather than vast amounts of human data. The approach is demonstrated for three progressively complex models of pointing.",
    "link": "http://arxiv.org/abs/2307.09878",
    "context": "Title: Amortised Experimental Design and Parameter Estimation for User Models of Pointing. (arXiv:2307.09878v1 [cs.AI])\nAbstract: User models play an important role in interaction design, supporting automation of interaction design choices. In order to do so, model parameters must be estimated from user data. While very large amounts of user data are sometimes required, recent research has shown how experiments can be designed so as to gather data and infer parameters as efficiently as possible, thereby minimising the data requirement. In the current article, we investigate a variant of these methods that amortises the computational cost of designing experiments by training a policy for choosing experimental designs with simulated participants. Our solution learns which experiments provide the most useful data for parameter estimation by interacting with in-silico agents sampled from the model space thereby using synthetic data rather than vast amounts of human data. The approach is demonstrated for three progressively complex models of pointing.",
    "path": "papers/23/07/2307.09878.json",
    "total_tokens": 771,
    "translated_title": "《用户指向的摊销实验设计和参数估计》",
    "translated_abstract": "用户模型在交互设计中起着重要的作用，支持自动化交互设计选择。为了实现这一目标，必须从用户数据中估计模型参数。虽然有时需要大量的用户数据，但最近的研究表明可以设计实验来尽可能高效地收集数据并推断参数，从而最小化数据需求。在本文中，我们研究了这些方法的一种变体，通过训练一个选择实验设计的策略来分摊实验设计的计算成本，使用模拟参与者来收集实验数据。我们的解决方案通过与模型空间中的模拟代理相互作用来学习哪些实验对参数估计提供最有用的数据，从而使用合成数据而不是大量的人类数据。该方法在三个日益复杂的指向模型上进行了演示。",
    "tldr": "本研究研究了一种通过训练策略选择实验设计，用模拟数据代替大量人类数据来分摊实验设计成本的方法，在交互设计中估计用户模型的参数，并且在三个不同的指向模型上进行了演示。"
}