{
    "title": "Information decomposition in complex systems via machine learning",
    "abstract": "arXiv:2307.04755v2 Announce Type: replace  Abstract: One of the fundamental steps toward understanding a complex system is identifying variation at the scale of the system's components that is most relevant to behavior on a macroscopic scale. Mutual information provides a natural means of linking variation across scales of a system due to its independence of functional relationship between observables. However, characterizing the manner in which information is distributed across a set of observables is computationally challenging and generally infeasible beyond a handful of measurements. Here we propose a practical and general methodology that uses machine learning to decompose the information contained in a set of measurements by jointly optimizing a lossy compression of each measurement. Guided by the distributed information bottleneck as a learning objective, the information decomposition identifies the variation in the measurements of the system state most relevant to specified mac",
    "link": "https://arxiv.org/abs/2307.04755",
    "context": "Title: Information decomposition in complex systems via machine learning\nAbstract: arXiv:2307.04755v2 Announce Type: replace  Abstract: One of the fundamental steps toward understanding a complex system is identifying variation at the scale of the system's components that is most relevant to behavior on a macroscopic scale. Mutual information provides a natural means of linking variation across scales of a system due to its independence of functional relationship between observables. However, characterizing the manner in which information is distributed across a set of observables is computationally challenging and generally infeasible beyond a handful of measurements. Here we propose a practical and general methodology that uses machine learning to decompose the information contained in a set of measurements by jointly optimizing a lossy compression of each measurement. Guided by the distributed information bottleneck as a learning objective, the information decomposition identifies the variation in the measurements of the system state most relevant to specified mac",
    "path": "papers/23/07/2307.04755.json",
    "total_tokens": 773,
    "translated_title": "通过机器学习在复杂系统中进行信息分解",
    "translated_abstract": "向理解复杂系统迈出的基本步骤之一是识别对宏观尺度行为最相关的系统组件尺度上的变化。互信息提供了将系统各个尺度上的变化联系起来的自然手段，因为它独立于可观测量之间的功能关系。然而，描述信息如何分布在一组可观测量之间的方式在计算上具有挑战性，并且通常除了少数几次测量外是不可行的。本文提出了一种实用且通用的方法，利用机器学习来分解一组测量中包含的信息，通过联合优化每个测量的有损压缩。在分布式信息瓶颈作为学习目标的引导下，信息分解识别了与指定的宏观尺度行为最相关的系统状态测量中的变化。",
    "tldr": "通过机器学习提出了一种实用且通用的方法，使用分布式信息瓶颈作为学习目标，来进行复杂系统中信息的分解"
}