{
    "title": "Conflict-free joint decision by lag and zero-lag synchronization in laser network. (arXiv:2307.15373v1 [physics.optics])",
    "abstract": "With the end of Moore's Law and the increasing demand for computing, photonic accelerators are garnering considerable attention. This is due to the physical characteristics of light, such as high bandwidth and multiplicity, and the various synchronization phenomena that emerge in the realm of laser physics. These factors come into play as computer performance approaches its limits. In this study, we explore the application of a laser network, acting as a photonic accelerator, to the competitive multi-armed bandit problem. In this context, conflict avoidance is key to maximizing environmental rewards. We experimentally demonstrate cooperative decision-making using zero-lag and lag synchronization within a network of four semiconductor lasers. Lag synchronization of chaos realizes effective decision-making and zero-delay synchronization is responsible for the realization of the collision avoidance function. We experimentally verified a low collision rate and high reward in a fundamental ",
    "link": "http://arxiv.org/abs/2307.15373",
    "context": "Title: Conflict-free joint decision by lag and zero-lag synchronization in laser network. (arXiv:2307.15373v1 [physics.optics])\nAbstract: With the end of Moore's Law and the increasing demand for computing, photonic accelerators are garnering considerable attention. This is due to the physical characteristics of light, such as high bandwidth and multiplicity, and the various synchronization phenomena that emerge in the realm of laser physics. These factors come into play as computer performance approaches its limits. In this study, we explore the application of a laser network, acting as a photonic accelerator, to the competitive multi-armed bandit problem. In this context, conflict avoidance is key to maximizing environmental rewards. We experimentally demonstrate cooperative decision-making using zero-lag and lag synchronization within a network of four semiconductor lasers. Lag synchronization of chaos realizes effective decision-making and zero-delay synchronization is responsible for the realization of the collision avoidance function. We experimentally verified a low collision rate and high reward in a fundamental ",
    "path": "papers/23/07/2307.15373.json",
    "total_tokens": 912,
    "translated_title": "激光网络中基于滞后和非滞后同步的无冲突联合决策",
    "translated_abstract": "随着摩尔定律的终结和对计算需求的增加，光子加速器引起了极大的关注。这是由于光的物理特性，如高带宽和复杂性，以及在激光物理领域中出现的各种同步现象。这些因素在计算机性能接近极限时发挥作用。在本研究中，我们探索了激光网络作为光子加速器应用于竞争性多臂赌博机问题。在这个背景下，冲突避免是最大化环境奖励的关键。我们在四个半导体激光器网络中实验验证了利用滞后和非滞后同步进行合作决策的效果。混沌的滞后同步实现了有效的决策，而零延迟的同步负责实现碰撞避免功能。我们在基本的冲突率低、奖励高的情况下进行了实验证实。",
    "tldr": "本研究在竞争性多臂赌博机问题中探索了激光网络作为光子加速器的应用，通过滞后和非滞后同步实现了无冲突的合作决策，实验证实了低冲突率和高奖励。",
    "en_tdlr": "This study explores the application of a laser network as a photonic accelerator in the competitive multi-armed bandit problem, achieving conflict-free cooperative decision-making through lag and zero-lag synchronization, and experimentally verifying low collision rate and high reward."
}