{
    "title": "Principal Component Analysis and Hidden Markov Model for Forecasting Stock Returns. (arXiv:2307.00459v1 [q-fin.ST])",
    "abstract": "This paper presents a method for predicting stock returns using principal component analysis (PCA) and the hidden Markov model (HMM) and tests the results of trading stocks based on this approach. Principal component analysis is applied to the covariance matrix of stock returns for companies listed in the S&P 500 index, and interpreting principal components as factor returns, we apply the HMM model on them. Then we use the transition probability matrix and state conditional means to forecast the factors returns. Reverting the factor returns forecasts to stock returns using eigenvectors, we obtain forecasts for the stock returns. We find that, with the right hyperparameters, our model yields a strategy that outperforms the buy-and-hold strategy in terms of the annualized Sharpe ratio.",
    "link": "http://arxiv.org/abs/2307.00459",
    "context": "Title: Principal Component Analysis and Hidden Markov Model for Forecasting Stock Returns. (arXiv:2307.00459v1 [q-fin.ST])\nAbstract: This paper presents a method for predicting stock returns using principal component analysis (PCA) and the hidden Markov model (HMM) and tests the results of trading stocks based on this approach. Principal component analysis is applied to the covariance matrix of stock returns for companies listed in the S&P 500 index, and interpreting principal components as factor returns, we apply the HMM model on them. Then we use the transition probability matrix and state conditional means to forecast the factors returns. Reverting the factor returns forecasts to stock returns using eigenvectors, we obtain forecasts for the stock returns. We find that, with the right hyperparameters, our model yields a strategy that outperforms the buy-and-hold strategy in terms of the annualized Sharpe ratio.",
    "path": "papers/23/07/2307.00459.json",
    "total_tokens": 774,
    "translated_title": "主成分分析和隐藏马尔可夫模型用于预测股票回报",
    "translated_abstract": "本文提出了一种使用主成分分析（PCA）和隐藏马尔可夫模型（HMM）来预测股票回报的方法，并测试了基于这种方法的股票交易结果。我们将主成分分析应用于S&P 500指数中上市公司的股票回报的协方差矩阵，并将主成分解释为因子回报，然后在它们上应用HMM模型。然后我们使用转换概率矩阵和状态条件均值来预测因子回报。通过使用特征向量将因子回报预测转换为股票回报，我们获得了股票回报的预测。我们发现，在正确的超参数下，我们的模型能够通过年化夏普比率在性能上超过持有策略。",
    "tldr": "本文提出了一种利用主成分分析和隐藏马尔可夫模型来预测股票回报的方法，在实验中发现，该方法在性能上优于传统的持有策略。",
    "en_tdlr": "This paper presents a method for predicting stock returns using principal component analysis (PCA) and the hidden Markov model (HMM), and it is found that this method outperforms traditional hold strategy in terms of performance."
}