{
    "title": "Linearized Relative Positional Encoding. (arXiv:2307.09270v1 [cs.CL])",
    "abstract": "Relative positional encoding is widely used in vanilla and linear transformers to represent positional information. However, existing encoding methods of a vanilla transformer are not always directly applicable to a linear transformer, because the latter requires a decomposition of the query and key representations into separate kernel functions. Nevertheless, principles for designing encoding methods suitable for linear transformers remain understudied. In this work, we put together a variety of existing linear relative positional encoding approaches under a canonical form and further propose a family of linear relative positional encoding algorithms via unitary transformation. Our formulation leads to a principled framework that can be used to develop new relative positional encoding methods that preserve linear space-time complexity. Equipped with different models, the proposed linearized relative positional encoding (LRPE) family derives effective encoding for various applications.",
    "link": "http://arxiv.org/abs/2307.09270",
    "context": "Title: Linearized Relative Positional Encoding. (arXiv:2307.09270v1 [cs.CL])\nAbstract: Relative positional encoding is widely used in vanilla and linear transformers to represent positional information. However, existing encoding methods of a vanilla transformer are not always directly applicable to a linear transformer, because the latter requires a decomposition of the query and key representations into separate kernel functions. Nevertheless, principles for designing encoding methods suitable for linear transformers remain understudied. In this work, we put together a variety of existing linear relative positional encoding approaches under a canonical form and further propose a family of linear relative positional encoding algorithms via unitary transformation. Our formulation leads to a principled framework that can be used to develop new relative positional encoding methods that preserve linear space-time complexity. Equipped with different models, the proposed linearized relative positional encoding (LRPE) family derives effective encoding for various applications.",
    "path": "papers/23/07/2307.09270.json",
    "total_tokens": 811,
    "translated_title": "线性化相对位置编码",
    "translated_abstract": "相对位置编码被广泛用于普通和线性 transformers 中以表示位置信息。然而，现有的编码方法对于线性 transformer 不一定直接适用，因为后者需要将查询和键表示分解为单独的核函数。尽管如此，设计适合线性 transformer 的编码方法的原则仍然研究甚少。在这项工作中，我们将各种现有的线性相对位置编码方法归结为一种规范形式，并进一步通过酉变换提出了一族线性相对位置编码算法。我们的公式推导出一个有原则的框架，可用于开发保留线性时空复杂度的新的相对位置编码方法。借助不同模型，提出的线性化相对位置编码（LRPE）家族为各种应用提供了有效的编码。",
    "tldr": "这项工作提出了一种线性化相对位置编码（LRPE）家族，通过规范形式和酉变换推导出了一种有原则的框架，该框架可用于开发保留线性时空复杂度的新的相对位置编码方法，并为各种应用提供有效的编码。",
    "en_tdlr": "This work proposes a family of linearized relative positional encoding (LRPE), derived through a canonical form and unitary transformation, providing a principled framework for developing new relative positional encoding methods that preserve linear space-time complexity and offering effective encoding for various applications."
}