{
    "title": "Ed-Fed: A generic federated learning framework with resource-aware client selection for edge devices. (arXiv:2307.07199v1 [cs.DC])",
    "abstract": "Federated learning (FL) has evolved as a prominent method for edge devices to cooperatively create a unified prediction model while securing their sensitive training data local to the device. Despite the existence of numerous research frameworks for simulating FL algorithms, they do not facilitate comprehensive deployment for automatic speech recognition tasks on heterogeneous edge devices. This is where Ed-Fed, a comprehensive and generic FL framework, comes in as a foundation for future practical FL system research. We also propose a novel resource-aware client selection algorithm to optimise the waiting time in the FL settings. We show that our approach can handle the straggler devices and dynamically set the training time for the selected devices in a round. Our evaluation has shown that the proposed approach significantly optimises waiting time in FL compared to conventional random client selection methods.",
    "link": "http://arxiv.org/abs/2307.07199",
    "context": "Title: Ed-Fed: A generic federated learning framework with resource-aware client selection for edge devices. (arXiv:2307.07199v1 [cs.DC])\nAbstract: Federated learning (FL) has evolved as a prominent method for edge devices to cooperatively create a unified prediction model while securing their sensitive training data local to the device. Despite the existence of numerous research frameworks for simulating FL algorithms, they do not facilitate comprehensive deployment for automatic speech recognition tasks on heterogeneous edge devices. This is where Ed-Fed, a comprehensive and generic FL framework, comes in as a foundation for future practical FL system research. We also propose a novel resource-aware client selection algorithm to optimise the waiting time in the FL settings. We show that our approach can handle the straggler devices and dynamically set the training time for the selected devices in a round. Our evaluation has shown that the proposed approach significantly optimises waiting time in FL compared to conventional random client selection methods.",
    "path": "papers/23/07/2307.07199.json",
    "total_tokens": 819,
    "translated_title": "Ed-Fed：一种通用的边缘设备资源感知客户端选择的联邦学习框架",
    "translated_abstract": "联邦学习已经成为边缘设备合作创建统一预测模型并保护其敏感训练数据的重要方法。尽管存在许多用于模拟联邦学习算法的研究框架，但它们不能在异构边缘设备上全面部署自动语音识别任务。因此，Ed-Fed作为一个综合且通用的联邦学习框架成为未来实际FL系统研究的基础。我们还提出一种新颖的资源感知客户端选择算法，在FL环境中优化等待时间。我们证明我们的方法可以处理慢速设备，并动态设置选定设备的训练时间。我们的评估表明，与传统的随机客户端选择方法相比，所提出的方法显著优化了FL中的等待时间。",
    "tldr": "Ed-Fed是一个通用的边缘设备资源感知客户端选择的联邦学习框架，可以优化等待时间，处理慢速设备，并且在FL中显著优化了等待时间。",
    "en_tdlr": "Ed-Fed is a generic federated learning framework with resource-aware client selection for edge devices, which optimizes waiting time, handles straggler devices, and significantly improves waiting time in FL."
}