{
    "title": "Adaptive Algorithms for Relaxed Pareto Set Identification. (arXiv:2307.00424v1 [stat.ML])",
    "abstract": "In this paper we revisit the fixed-confidence identification of the Pareto optimal set in a multi-objective multi-armed bandit model. As the sample complexity to identify the exact Pareto set can be very large, a relaxation allowing to output some additional near-optimal arms has been studied. In this work we also tackle alternative relaxations that allow instead to identify a relevant subset of the Pareto set. Notably, we propose a single sampling strategy, called Adaptive Pareto Exploration, that can be used in conjunction with different stopping rules to take into account different relaxations of the Pareto Set Identification problem. We analyze the sample complexity of these different combinations, quantifying in particular the reduction in sample complexity that occurs when one seeks to identify at most $k$ Pareto optimal arms. We showcase the good practical performance of Adaptive Pareto Exploration on a real-world scenario, in which we adaptively explore several vaccination stra",
    "link": "http://arxiv.org/abs/2307.00424",
    "context": "Title: Adaptive Algorithms for Relaxed Pareto Set Identification. (arXiv:2307.00424v1 [stat.ML])\nAbstract: In this paper we revisit the fixed-confidence identification of the Pareto optimal set in a multi-objective multi-armed bandit model. As the sample complexity to identify the exact Pareto set can be very large, a relaxation allowing to output some additional near-optimal arms has been studied. In this work we also tackle alternative relaxations that allow instead to identify a relevant subset of the Pareto set. Notably, we propose a single sampling strategy, called Adaptive Pareto Exploration, that can be used in conjunction with different stopping rules to take into account different relaxations of the Pareto Set Identification problem. We analyze the sample complexity of these different combinations, quantifying in particular the reduction in sample complexity that occurs when one seeks to identify at most $k$ Pareto optimal arms. We showcase the good practical performance of Adaptive Pareto Exploration on a real-world scenario, in which we adaptively explore several vaccination stra",
    "path": "papers/23/07/2307.00424.json",
    "total_tokens": 885,
    "translated_title": "宽松Pareto集识别的自适应算法",
    "translated_abstract": "本文重新审视了在多目标多臂赌博机模型中固定置信度下的Pareto最优集合的识别问题。由于准确识别Pareto集合的样本复杂度可能非常大，因此研究了允许输出一些额外近似最优臂的放松策略。在这项工作中，我们还解决了其他允许识别Pareto集合的相关子集的放松策略。值得注意的是，我们提出了一种称为自适应Pareto探索的单一抽样策略，可以与不同的停止规则结合使用，以考虑Pareto集合识别问题的不同放松策略。我们分析了这些不同组合的样本复杂度，并特别量化了在寻找识别最多$k$个Pareto最优臂时样本复杂度的减少。我们展示了自适应Pareto探索在一个真实场景中的良好实际性能，其中我们自适应地探索了几种疫苗接种策略。",
    "tldr": "本研究提出了一种自适应算法，用于宽松Pareto集的识别，通过放松策略来减少样本复杂度，并展示了在实际场景中的良好表现。",
    "en_tdlr": "This study proposes an adaptive algorithm for identifying relaxed Pareto sets, reducing sample complexity by incorporating relaxation strategies, and demonstrates good performance in real-world scenarios."
}