{
    "title": "Strategic Budget Selection in a Competitive Autobidding World. (arXiv:2307.07374v1 [cs.GT])",
    "abstract": "We study a game played between advertisers in an online ad platform. The platform sells ad impressions by first-price auction and provides autobidding algorithms that optimize bids on each advertiser's behalf. Each advertiser strategically declares a budget constraint (and possibly a maximum bid) to their autobidder. The chosen constraints define an \"inner\" budget-pacing game for the autobidders, who compete to maximize the total value received subject to the constraints. Advertiser payoffs in the constraint-choosing \"metagame\" are determined by the equilibrium reached by the autobidders.  Advertisers only specify budgets and linear values to their autobidders, but their true preferences can be more general: we assume only that they have weakly decreasing marginal value for clicks and weakly increasing marginal disutility for spending money. Our main result is that despite this gap between general preferences and simple autobidder constraints, the allocations at equilibrium are approxi",
    "link": "http://arxiv.org/abs/2307.07374",
    "context": "Title: Strategic Budget Selection in a Competitive Autobidding World. (arXiv:2307.07374v1 [cs.GT])\nAbstract: We study a game played between advertisers in an online ad platform. The platform sells ad impressions by first-price auction and provides autobidding algorithms that optimize bids on each advertiser's behalf. Each advertiser strategically declares a budget constraint (and possibly a maximum bid) to their autobidder. The chosen constraints define an \"inner\" budget-pacing game for the autobidders, who compete to maximize the total value received subject to the constraints. Advertiser payoffs in the constraint-choosing \"metagame\" are determined by the equilibrium reached by the autobidders.  Advertisers only specify budgets and linear values to their autobidders, but their true preferences can be more general: we assume only that they have weakly decreasing marginal value for clicks and weakly increasing marginal disutility for spending money. Our main result is that despite this gap between general preferences and simple autobidder constraints, the allocations at equilibrium are approxi",
    "path": "papers/23/07/2307.07374.json",
    "total_tokens": 943,
    "translated_title": "竞争性自动竞价世界中的战略预算选择",
    "translated_abstract": "我们研究了在线广告平台上广告商之间的一种游戏。该平台通过一次价格拍卖销售广告展示，并提供优化广告商投标的自动竞价算法。每个广告商都对其自动竞价器声明预算约束（可能还有最大竞价）。所选择的约束为自动竞价器定义了一个“内部”预算控制游戏，竞争者在竞争条件下最大化总价值。广告商在约束选择的“元游戏”中的获利取决于自动竞价器达到的均衡状态。广告商只向其自动竞价器指定预算和线性价值，但其真实偏好可以更加一般化：我们仅假设他们对点击具有递减边际价值并且对花费资金具有递增边际不便。我们的主要结果是，尽管存在广告商一般偏好和简单自动竞价器约束之间的差距，但在均衡状态下的分配是近似的。",
    "tldr": "该论文研究了在线广告平台上的广告商之间的战略预算选择问题。通过自动竞价算法，广告商根据预算和线性价值最大化其总价值。尽管广告商的真实偏好与自动竞价器的约束存在差距，但在均衡状态下的分配是近似的。",
    "en_tdlr": "This paper examines strategic budget selection among advertisers in an online ad platform. Through autobidding algorithms, advertisers maximize their total value based on budgets and linear values. Despite the gap between advertisers' true preferences and autobidder constraints, the allocations at equilibrium are approximations."
}