{
    "title": "Unpaired Multi-View Graph Clustering with Cross-View Structure Matching. (arXiv:2307.03476v1 [cs.LG])",
    "abstract": "Multi-view clustering (MVC), which effectively fuses information from multiple views for better performance, has received increasing attention. Most existing MVC methods assume that multi-view data are fully paired, which means that the mappings of all corresponding samples between views are pre-defined or given in advance. However, the data correspondence is often incomplete in real-world applications due to data corruption or sensor differences, referred as the data-unpaired problem (DUP) in multi-view literature. Although several attempts have been made to address the DUP issue, they suffer from the following drawbacks: 1) Most methods focus on the feature representation while ignoring the structural information of multi-view data, which is essential for clustering tasks; 2) Existing methods for partially unpaired problems rely on pre-given cross-view alignment information, resulting in their inability to handle fully unpaired problems; 3) Their inevitable parameters degrade the eff",
    "link": "http://arxiv.org/abs/2307.03476",
    "context": "Title: Unpaired Multi-View Graph Clustering with Cross-View Structure Matching. (arXiv:2307.03476v1 [cs.LG])\nAbstract: Multi-view clustering (MVC), which effectively fuses information from multiple views for better performance, has received increasing attention. Most existing MVC methods assume that multi-view data are fully paired, which means that the mappings of all corresponding samples between views are pre-defined or given in advance. However, the data correspondence is often incomplete in real-world applications due to data corruption or sensor differences, referred as the data-unpaired problem (DUP) in multi-view literature. Although several attempts have been made to address the DUP issue, they suffer from the following drawbacks: 1) Most methods focus on the feature representation while ignoring the structural information of multi-view data, which is essential for clustering tasks; 2) Existing methods for partially unpaired problems rely on pre-given cross-view alignment information, resulting in their inability to handle fully unpaired problems; 3) Their inevitable parameters degrade the eff",
    "path": "papers/23/07/2307.03476.json",
    "total_tokens": 818,
    "translated_title": "无配对多视图图聚类与跨视图结构匹配",
    "translated_abstract": "多视图聚类方法(MVC)通过有效地融合多个视图的信息以提高性能而受到越来越多的关注。大多数现有的MVC方法假设多视图数据是完全配对的，这意味着视图之间所有对应样本的映射是预先定义或提前给定的。然而，实际应用中的数据对应常常不完整，这是由于数据损坏或传感器差异引起的多视图文献中的数据未配对问题(DUP)。尽管已经尝试解决DUP问题，但存在以下问题：1）大多数方法关注特征表示而忽视了多视图数据的结构信息，而这对于聚类任务至关重要；2）现有的部分未配对问题的方法依赖于预先给定的跨视图对齐信息，导致它们无法处理完全未配对的问题；3）它们不可避免地存在参数降低了效率。",
    "tldr": "无配对多视图图聚类方法结合跨视图结构匹配，解决了多视图数据未配对问题，提高了聚类性能。"
}