{
    "title": "Non-invasive Diabetes Detection using Gabor Filter: A Comparative Analysis of Different Cameras. (arXiv:2307.15480v1 [cs.CV])",
    "abstract": "This paper compares and explores the performance of both mobile device camera and laptop camera as convenient tool for capturing images for non-invasive detection of Diabetes Mellitus (DM) using facial block texture features. Participants within age bracket 20 to 79 years old were chosen for the dataset. 12mp and 7mp mobile cameras, and a laptop camera were used to take the photo under normal lighting condition. Extracted facial blocks were classified using k-Nearest Neighbors (k-NN) and Support Vector Machine (SVM). 100 images were captured, preprocessed, filtered using Gabor, and iterated. Performance of the system was measured in terms of accuracy, specificity, and sensitivity. Best performance of 96.7% accuracy, 100% sensitivity, and 93% specificity were achieved from 12mp back camera using SVM with 100 images.",
    "link": "http://arxiv.org/abs/2307.15480",
    "context": "Title: Non-invasive Diabetes Detection using Gabor Filter: A Comparative Analysis of Different Cameras. (arXiv:2307.15480v1 [cs.CV])\nAbstract: This paper compares and explores the performance of both mobile device camera and laptop camera as convenient tool for capturing images for non-invasive detection of Diabetes Mellitus (DM) using facial block texture features. Participants within age bracket 20 to 79 years old were chosen for the dataset. 12mp and 7mp mobile cameras, and a laptop camera were used to take the photo under normal lighting condition. Extracted facial blocks were classified using k-Nearest Neighbors (k-NN) and Support Vector Machine (SVM). 100 images were captured, preprocessed, filtered using Gabor, and iterated. Performance of the system was measured in terms of accuracy, specificity, and sensitivity. Best performance of 96.7% accuracy, 100% sensitivity, and 93% specificity were achieved from 12mp back camera using SVM with 100 images.",
    "path": "papers/23/07/2307.15480.json",
    "total_tokens": 881,
    "translated_title": "使用Gabor滤波器的非侵入式糖尿病检测：对不同相机的比较分析",
    "translated_abstract": "本文比较和探索了移动设备相机和笔记本电脑相机作为用于非侵入性糖尿病检测的便利工具的性能，使用面部块纹理特征。选择20至79岁的参与者进行数据集。使用12mp和7mp移动相机以及笔记本电脑相机在正常照明条件下拍摄照片。提取的面部块被使用k-最近邻（k-NN）和支持向量机（SVM）进行分类。共捕获了100张图像，经过预处理、Gabor滤波和迭代处理。系统的性能以准确性、特异性和敏感性来衡量。在使用SVM和100张图像的12mp背面相机上，达到了96.7%的准确性、100%的敏感性和93%的特异性的最佳性能。",
    "tldr": "本文比较了移动设备相机和笔记本电脑相机在非侵入性糖尿病检测中的性能，使用了Gabor滤波器和面部块纹理特征，最终实现了96.7%的准确性、100%的敏感性和93%的特异性。"
}