{
    "title": "Persistent Ballistic Entanglement Spreading with Optimal Control in Quantum Spin Chains. (arXiv:2307.11609v1 [quant-ph])",
    "abstract": "Entanglement propagation provides a key routine to understand quantum many-body dynamics in and out of equilibrium. In this work, we uncover that the ``variational entanglement-enhancing'' field (VEEF) robustly induces a persistent ballistic spreading of entanglement in quantum spin chains. The VEEF is time dependent, and is optimally controlled to maximize the bipartite entanglement entropy (EE) of the final state. Such a linear growth persists till the EE reaches the genuine saturation $\\tilde{S} = - \\log_{2} 2^{-\\frac{N}{2}}=\\frac{N}{2}$ with $N$ the total number of spins. The EE satisfies $S(t) = v t$ for the time $t \\leq \\frac{N}{2v}$, with $v$ the velocity. These results are in sharp contrast with the behaviors without VEEF, where the EE generally approaches a sub-saturation known as the Page value $\\tilde{S}_{P} =\\tilde{S} - \\frac{1}{2\\ln{2}}$ in the long-time limit, and the entanglement growth deviates from being linear before the Page value is reached. The dependence between t",
    "link": "http://arxiv.org/abs/2307.11609",
    "context": "Title: Persistent Ballistic Entanglement Spreading with Optimal Control in Quantum Spin Chains. (arXiv:2307.11609v1 [quant-ph])\nAbstract: Entanglement propagation provides a key routine to understand quantum many-body dynamics in and out of equilibrium. In this work, we uncover that the ``variational entanglement-enhancing'' field (VEEF) robustly induces a persistent ballistic spreading of entanglement in quantum spin chains. The VEEF is time dependent, and is optimally controlled to maximize the bipartite entanglement entropy (EE) of the final state. Such a linear growth persists till the EE reaches the genuine saturation $\\tilde{S} = - \\log_{2} 2^{-\\frac{N}{2}}=\\frac{N}{2}$ with $N$ the total number of spins. The EE satisfies $S(t) = v t$ for the time $t \\leq \\frac{N}{2v}$, with $v$ the velocity. These results are in sharp contrast with the behaviors without VEEF, where the EE generally approaches a sub-saturation known as the Page value $\\tilde{S}_{P} =\\tilde{S} - \\frac{1}{2\\ln{2}}$ in the long-time limit, and the entanglement growth deviates from being linear before the Page value is reached. The dependence between t",
    "path": "papers/23/07/2307.11609.json",
    "total_tokens": 1068,
    "translated_title": "持续的弹道纠缠传播与量子自旋链中的最优控制研究",
    "translated_abstract": "纠缠传播是理解量子多体系统在平衡和非平衡状态下的关键方法。本研究发现，“变分纠缠增强”场（VEEF）可在量子自旋链中持续地诱导纠缠的弹道传播。VEEF是时间依赖的，通过最优控制以最大化最终态的二分纠缠熵（EE）。这种线性增长持续到EE达到真实饱和度$\\tilde{S} = - \\log_{2} 2^{-\\frac{N}{2}}=\\frac{N}{2}$，其中$N$是自旋总数。在时间$t \\leq \\frac{N}{2v}$时，EE满足$S(t) = v t$，其中$v$是速度。这些结果与没有VEEF的行为形成鲜明对比，没有VEEF时，EE通常在长时间极限下趋于一个次饱和值，即Page值$\\tilde{S}_{P} =\\tilde{S} - \\frac{1}{2\\ln{2}}$，且纠缠增长在达到Page值之前就偏离了线性增长。",
    "tldr": "本研究发现，在量子自旋链中，通过最优控制时间依赖的“变分纠缠增强”场（VEEF）可持续诱导纠缠的弹道传播，直到达到饱和。这与没有VEEF的情况形成鲜明对比，纠缠增长在达到饱和之前就偏离了线性增长。",
    "en_tdlr": "This work uncovers that the \"variational entanglement-enhancing\" field (VEEF) can robustly induce a persistent ballistic spreading of entanglement in quantum spin chains through optimal time-dependent control, until reaching saturation. This is in contrast to the case without VEEF, where entanglement growth deviates from being linear before saturation."
}