{
    "title": "Emotional Intelligence of Large Language Models. (arXiv:2307.09042v1 [cs.AI])",
    "abstract": "Large Language Models (LLMs) have demonstrated remarkable abilities across numerous disciplines, primarily assessed through tasks in language generation, knowledge utilization, and complex reasoning. However, their alignment with human emotions and values, which is critical for real-world applications, has not been systematically evaluated. Here, we assessed LLMs' Emotional Intelligence (EI), encompassing emotion recognition, interpretation, and understanding, which is necessary for effective communication and social interactions. Specifically, we first developed a novel psychometric assessment focusing on Emotion Understanding (EU), a core component of EI, suitable for both humans and LLMs. This test requires evaluating complex emotions (e.g., surprised, joyful, puzzled, proud) in realistic scenarios (e.g., despite feeling underperformed, John surprisingly achieved a top score). With a reference frame constructed from over 500 adults, we tested a variety of mainstream LLMs. Most achie",
    "link": "http://arxiv.org/abs/2307.09042",
    "context": "Title: Emotional Intelligence of Large Language Models. (arXiv:2307.09042v1 [cs.AI])\nAbstract: Large Language Models (LLMs) have demonstrated remarkable abilities across numerous disciplines, primarily assessed through tasks in language generation, knowledge utilization, and complex reasoning. However, their alignment with human emotions and values, which is critical for real-world applications, has not been systematically evaluated. Here, we assessed LLMs' Emotional Intelligence (EI), encompassing emotion recognition, interpretation, and understanding, which is necessary for effective communication and social interactions. Specifically, we first developed a novel psychometric assessment focusing on Emotion Understanding (EU), a core component of EI, suitable for both humans and LLMs. This test requires evaluating complex emotions (e.g., surprised, joyful, puzzled, proud) in realistic scenarios (e.g., despite feeling underperformed, John surprisingly achieved a top score). With a reference frame constructed from over 500 adults, we tested a variety of mainstream LLMs. Most achie",
    "path": "papers/23/07/2307.09042.json",
    "total_tokens": 901,
    "translated_title": "大型语言模型的情感智能",
    "translated_abstract": "大型语言模型（LLMs）在许多领域展示出了非凡的能力，主要通过语言生成、知识利用和复杂推理等任务进行评估。然而，它们与人类情感和价值观的一致性尚未得到系统评估，而这对于实际应用至关重要。在这里，我们评估了LLMs的情感智能（EI），包括情感识别、解释和理解，这对于有效的沟通和社交互动至关重要。具体而言，我们首先开发了一种新的心理测量评估，重点是情感理解（EU），这是EI的核心组成部分，适用于人类和LLMs。这个测试需要在现实场景中评估复杂的情感（例如，惊讶、愉快、困惑、自豪），如尽管感觉表现不佳，约翰却意外地获得了最高分。通过从500多名成年人构建的参考框架，我们测试了各种主流LLMs。",
    "tldr": "这项研究评估了大型语言模型（LLMs）的情感智能（EI），并提出了一种新的心理测量评估方法，该方法重点考察了情感理解（EU）能力。评估结果表明，大多数主流LLMs在情感理解方面表现良好。",
    "en_tdlr": "This study evaluates the emotional intelligence (EI) of large language models (LLMs) and presents a new psychometric assessment method focusing on emotion understanding (EU) ability. The results show that most mainstream LLMs perform well in emotion understanding."
}