{
    "title": "Improving Text Matching in E-Commerce Search with A Rationalizable, Intervenable and Fast Entity-Based Relevance Model. (arXiv:2307.00370v2 [cs.IR] UPDATED)",
    "abstract": "Discovering the intended items of user queries from a massive repository of items is one of the main goals of an e-commerce search system. Relevance prediction is essential to the search system since it helps improve performance. When online serving a relevance model, the model is required to perform fast and accurate inference. Currently, the widely used models such as Bi-encoder and Cross-encoder have their limitations in accuracy or inference speed respectively. In this work, we propose a novel model called the Entity-Based Relevance Model (EBRM). We identify the entities contained in an item and decompose the QI (query-item) relevance problem into multiple QE (query-entity) relevance problems; we then aggregate their results to form the QI prediction using a soft logic formulation. The decomposition allows us to use a Cross-encoder QE relevance module for high accuracy as well as cache QE predictions for fast online inference. Utilizing soft logic makes the prediction procedure int",
    "link": "http://arxiv.org/abs/2307.00370",
    "context": "Title: Improving Text Matching in E-Commerce Search with A Rationalizable, Intervenable and Fast Entity-Based Relevance Model. (arXiv:2307.00370v2 [cs.IR] UPDATED)\nAbstract: Discovering the intended items of user queries from a massive repository of items is one of the main goals of an e-commerce search system. Relevance prediction is essential to the search system since it helps improve performance. When online serving a relevance model, the model is required to perform fast and accurate inference. Currently, the widely used models such as Bi-encoder and Cross-encoder have their limitations in accuracy or inference speed respectively. In this work, we propose a novel model called the Entity-Based Relevance Model (EBRM). We identify the entities contained in an item and decompose the QI (query-item) relevance problem into multiple QE (query-entity) relevance problems; we then aggregate their results to form the QI prediction using a soft logic formulation. The decomposition allows us to use a Cross-encoder QE relevance module for high accuracy as well as cache QE predictions for fast online inference. Utilizing soft logic makes the prediction procedure int",
    "path": "papers/23/07/2307.00370.json",
    "total_tokens": 879,
    "translated_title": "提升电子商务搜索中的文本匹配能力：基于可理解、可干预和快速实体关联模型",
    "translated_abstract": "在电子商务搜索系统中，从大量商品中发现用户查询的目标商品是主要目标之一。关联预测对于搜索系统至关重要，因为它有助于提高性能。目前，广泛使用的模型如Bi-encoder和Cross-encoder分别在准确性或推理速度上存在局限性。在这项工作中，我们提出了一种新的模型，称为基于实体的关联模型（EBRM）。我们识别商品中包含的实体，并将QI（查询-商品）关联问题分解为多个QE（查询-实体）关联问题；然后使用软逻辑形式聚合其结果以形成QI的预测。分解允许我们使用Cross-encoder QE关联模块以获得高准确性，并为快速在线推理缓存QE预测。利用软逻辑使预测过程可解释性高并具有干预能力。",
    "tldr": "本研究提出了一种称为基于实体的关联模型（EBRM）的新模型，将查询-商品关联问题分解为多个查询-实体关联问题，并使用软逻辑聚合结果，以提高准确性和推理速度。",
    "en_tdlr": "This study proposes a novel model called the Entity-Based Relevance Model (EBRM) to decompose the query-item relevance problem into multiple query-entity relevance problems and aggregates their results using soft logic, improving accuracy and inference speed."
}