{
    "title": "DEFTri: A Few-Shot Label Fused Contextual Representation Learning For Product Defect Triage in e-Commerce. (arXiv:2307.11344v1 [cs.SE])",
    "abstract": "Defect Triage is a time-sensitive and critical process in a large-scale agile software development lifecycle for e-commerce. Inefficiencies arising from human and process dependencies in this domain have motivated research in automated approaches using machine learning to accurately assign defects to qualified teams. This work proposes a novel framework for automated defect triage (DEFTri) using fine-tuned state-of-the-art pre-trained BERT on labels fused text embeddings to improve contextual representations from human-generated product defects. For our multi-label text classification defect triage task, we also introduce a Walmart proprietary dataset of product defects using weak supervision and adversarial learning, in a few-shot setting.",
    "link": "http://arxiv.org/abs/2307.11344",
    "context": "Title: DEFTri: A Few-Shot Label Fused Contextual Representation Learning For Product Defect Triage in e-Commerce. (arXiv:2307.11344v1 [cs.SE])\nAbstract: Defect Triage is a time-sensitive and critical process in a large-scale agile software development lifecycle for e-commerce. Inefficiencies arising from human and process dependencies in this domain have motivated research in automated approaches using machine learning to accurately assign defects to qualified teams. This work proposes a novel framework for automated defect triage (DEFTri) using fine-tuned state-of-the-art pre-trained BERT on labels fused text embeddings to improve contextual representations from human-generated product defects. For our multi-label text classification defect triage task, we also introduce a Walmart proprietary dataset of product defects using weak supervision and adversarial learning, in a few-shot setting.",
    "path": "papers/23/07/2307.11344.json",
    "total_tokens": 806,
    "translated_title": "DEFTri: 电子商务中产品缺陷分类的少样本标签融合上下文表示学习",
    "translated_abstract": "在大规模敏捷软件开发生命周期的电子商务中，缺陷分类是一个时间敏感且关键的过程。该领域由于人为和流程依赖性而引起的低效性，已经激发了使用机器学习的自动化方法来准确地将缺陷分配给符合条件的团队的研究。本文提出了一个新的框架DEFTri，使用经过微调的先进预训练BERT模型在标签融合的文本嵌入中改进了人工生成的产品缺陷的上下文表示。对于我们的多标签文本分类缺陷分类任务，我们还在少样本设置下使用了沃尔玛的专有产品缺陷数据集，并使用了弱监督和对抗性学习。",
    "tldr": "本文提出了一个使用标签融合文本嵌入和优化上下文表示的DEFTri框架，以改进电子商务中的产品缺陷分类。同时，通过少样本训练和弱监督学习，引入了沃尔玛的专有数据集。",
    "en_tdlr": "This work proposes DEFTri, a framework for product defect triage in e-commerce that improves contextual representations using label fused text embeddings. It also introduces a proprietary dataset from Walmart using weak supervision and adversarial learning in a few-shot setting."
}