{
    "title": "Hierarchical Federated Learning Incentivization for Gas Usage Estimation. (arXiv:2307.00233v1 [cs.LG])",
    "abstract": "Accurately estimating gas usage is essential for the efficient functioning of gas distribution networks and saving operational costs. Traditional methods rely on centralized data processing, which poses privacy risks. Federated learning (FL) offers a solution to this problem by enabling local data processing on each participant, such as gas companies and heating stations. However, local training and communication overhead may discourage gas companies and heating stations from actively participating in the FL training process. To address this challenge, we propose a Hierarchical FL Incentive Mechanism for Gas Usage Estimation (HI-GAS), which has been testbedded in the ENN Group, one of the leading players in the natural gas and green energy industry. It is designed to support horizontal FL among gas companies, and vertical FL among each gas company and heating station within a hierarchical FL ecosystem, rewarding participants based on their contributions to FL. In addition, a hierarchic",
    "link": "http://arxiv.org/abs/2307.00233",
    "context": "Title: Hierarchical Federated Learning Incentivization for Gas Usage Estimation. (arXiv:2307.00233v1 [cs.LG])\nAbstract: Accurately estimating gas usage is essential for the efficient functioning of gas distribution networks and saving operational costs. Traditional methods rely on centralized data processing, which poses privacy risks. Federated learning (FL) offers a solution to this problem by enabling local data processing on each participant, such as gas companies and heating stations. However, local training and communication overhead may discourage gas companies and heating stations from actively participating in the FL training process. To address this challenge, we propose a Hierarchical FL Incentive Mechanism for Gas Usage Estimation (HI-GAS), which has been testbedded in the ENN Group, one of the leading players in the natural gas and green energy industry. It is designed to support horizontal FL among gas companies, and vertical FL among each gas company and heating station within a hierarchical FL ecosystem, rewarding participants based on their contributions to FL. In addition, a hierarchic",
    "path": "papers/23/07/2307.00233.json",
    "total_tokens": 967,
    "translated_title": "基于层次化联邦学习的气体使用估计激励机制",
    "translated_abstract": "准确估计气体使用量对于天然气配送网络的高效运行和节约运营成本至关重要。传统方法依赖于集中式数据处理，存在隐私风险。联邦学习通过使每个参与者（如燃气公司和供暖站）能够进行本地数据处理，为解决这个问题提供了解决方案。然而，本地训练和通信开销可能会使燃气公司和供暖站对联邦学习训练过程不太积极参与。为了解决这个挑战，我们提出了一个基于层次化联邦学习的气体使用估计激励机制（HI-GAS），它在天然气和绿色能源行业的领先企业之一——ENN集团中进行了实验验证。它旨在支持燃气公司之间的水平联邦学习，以及在层次化联邦学习生态系统中每个燃气公司和供暖站之间的垂直联邦学习，并根据他们对联邦学习的贡献对参与者进行奖励。",
    "tldr": "提出了一个基于层次化联邦学习的气体使用估计激励机制，旨在解决燃气公司和供暖站在联邦学习训练过程中的积极参与问题，并通过奖励参与者的贡献来支持水平和垂直的联邦学习。",
    "en_tdlr": "A hierarchical federated learning incentive mechanism is proposed to address the challenge of active participation of gas companies and heating stations in the federated learning process, supporting horizontal and vertical federated learning by rewarding participants based on their contributions."
}