{
    "title": "Multi-Valued Partial Order Plans in Numeric Planning. (arXiv:2307.14660v1 [cs.AI])",
    "abstract": "Many planning formalisms allow for mixing numeric with Boolean effects. However, most of these formalisms are undecidable. In this paper, we will analyze possible causes for this undecidability by studying the number of different occurrences of actions, an approach that proved useful for metric fluents before. We will start by reformulating a numeric planning problem known as restricted tasks as a search problem. We will then show how an NP-complete fragment of numeric planning can be found by using heuristics. To achieve this, we will develop the idea of multi-valued partial order plans, a least committing compact representation for (sequential and parallel) plans. Finally, we will study optimization techniques for this representation to incorporate soft preconditions.",
    "link": "http://arxiv.org/abs/2307.14660",
    "context": "Title: Multi-Valued Partial Order Plans in Numeric Planning. (arXiv:2307.14660v1 [cs.AI])\nAbstract: Many planning formalisms allow for mixing numeric with Boolean effects. However, most of these formalisms are undecidable. In this paper, we will analyze possible causes for this undecidability by studying the number of different occurrences of actions, an approach that proved useful for metric fluents before. We will start by reformulating a numeric planning problem known as restricted tasks as a search problem. We will then show how an NP-complete fragment of numeric planning can be found by using heuristics. To achieve this, we will develop the idea of multi-valued partial order plans, a least committing compact representation for (sequential and parallel) plans. Finally, we will study optimization techniques for this representation to incorporate soft preconditions.",
    "path": "papers/23/07/2307.14660.json",
    "total_tokens": 881,
    "translated_title": "数值规划中的多值偏序计划",
    "translated_abstract": "许多规划形式允许将数字与布尔效应混合使用，但大多数形式是不可判定的。本文将通过研究动作发生次数的不同情况来分析导致不可判定性的可能原因，这种方法在度量谓词之前已被证明是有用的。我们将从重新定义限制任务这个已知的数值规划问题为搜索问题开始。然后，我们将展示如何使用启发式方法找到数值规划的一个NP完全片段。为了实现这一点，我们将开发多值偏序计划的想法，这是一种最小承诺的紧凑表示方法（逐步和并行计划）。最后，我们将研究这种表示方法的优化技术，以纳入软先决条件。",
    "tldr": "本文研究了数值规划中的多值偏序计划，在分析可能导致不可判定性的原因时，通过研究动作发生次数的不同情况。通过重新定义限制任务为搜索问题，并使用启发式方法找到数值规划的一个NP完全片段。通过开发多值偏序计划的想法，实现了最小承诺的紧凑表示方法。该表示方法的优化技术能够纳入软先决条件。"
}