{
    "title": "Mask-guided Data Augmentation for Multiparametric MRI Generation with a Rare Hepatocellular Carcinoma. (arXiv:2307.16314v1 [eess.IV])",
    "abstract": "Data augmentation is classically used to improve the overall performance of deep learning models. It is, however, challenging in the case of medical applications, and in particular for multiparametric datasets. For example, traditional geometric transformations used in several applications to generate synthetic images can modify in a non-realistic manner the patients' anatomy. Therefore, dedicated image generation techniques are necessary in the medical field to, for example, mimic a given pathology realistically. This paper introduces a new data augmentation architecture that generates synthetic multiparametric (T1 arterial, T1 portal, and T2) magnetic resonance images (MRI) of massive macrotrabecular subtype hepatocellular carcinoma with their corresponding tumor masks through a generative deep learning approach. The proposed architecture creates liver tumor masks and abdominal edges used as input in a Pix2Pix network for synthetic data creation. The method's efficiency is demonstrat",
    "link": "http://arxiv.org/abs/2307.16314",
    "context": "Title: Mask-guided Data Augmentation for Multiparametric MRI Generation with a Rare Hepatocellular Carcinoma. (arXiv:2307.16314v1 [eess.IV])\nAbstract: Data augmentation is classically used to improve the overall performance of deep learning models. It is, however, challenging in the case of medical applications, and in particular for multiparametric datasets. For example, traditional geometric transformations used in several applications to generate synthetic images can modify in a non-realistic manner the patients' anatomy. Therefore, dedicated image generation techniques are necessary in the medical field to, for example, mimic a given pathology realistically. This paper introduces a new data augmentation architecture that generates synthetic multiparametric (T1 arterial, T1 portal, and T2) magnetic resonance images (MRI) of massive macrotrabecular subtype hepatocellular carcinoma with their corresponding tumor masks through a generative deep learning approach. The proposed architecture creates liver tumor masks and abdominal edges used as input in a Pix2Pix network for synthetic data creation. The method's efficiency is demonstrat",
    "path": "papers/23/07/2307.16314.json",
    "total_tokens": 894,
    "translated_title": "基于掩模的数据增强用于罕见肝细胞癌的多参数MRI生成",
    "translated_abstract": "数据增强被经典地用于提高深度学习模型的整体性能。然而，在医学应用中，特别是对于多参数数据集而言，这是具有挑战性的。例如，在生成合成图像的几个应用中使用的传统几何变换可能会以非现实的方式修改患者的解剖结构。因此，在医学领域需要专门的图像生成技术，例如逼真地模拟给定的病理。本文介绍了一种新的数据增强架构，通过生成式深度学习方法生成巨大细小肝细胞癌的合成多参数（T1动脉、T1门静脉和T2）磁共振图像（MRI）及其对应的肿瘤掩模。所提出的架构通过生成肝脏肿瘤掩模和腹部边缘，在Pix2Pix网络的输入中用于合成数据的创建。该方法的效率已经得到证明。",
    "tldr": "本文提出了一种基于掩模的数据增强架构，通过生成式深度学习方法合成具有巨大细小肝细胞癌的多参数MRI图像，并通过肿瘤掩模实现逼真的生成效果。",
    "en_tdlr": "This paper presents a mask-guided data augmentation architecture based on generative deep learning to generate synthetic multiparametric MRI images of massive macrotrabecular subtype hepatocellular carcinoma, producing realistic results through the tumor mask."
}