{
    "title": "Founding a mathematical diffusion model in linguistics. The case study of German syntactic features in the North-Eastern Italian dialects. (arXiv:2307.14291v1 [cs.CL])",
    "abstract": "We take as a case study the spread of Germanic syntactic features into Romance dialects of North-Eastern Italy, which occurred after the immigration of German people in the Tyrol during the High Middle Ages.  An interactive map is produced using tools of what is called Geographic Data Science. A smooth two-dimensional surface $\\mathcal{G}$ expresses locally which fraction of territory uses a given German language feature: it is obtained by interpolating a discrete function that says if at any surveyed locality that feature is used or not.\\newline  This surface $\\mathcal{G}$ is thought of as the value at the present time of a function describing a diffusion-convection phenomenon in two dimensions (here said \\emph{tidal} mode), which is subjected in a very natural way to the same equation, suitably contextualized, used in physics for a number of phenomenological facts like the heat diffusion. It is shown that solutions of this equation, evaluated at the present time, fit well with the da",
    "link": "http://arxiv.org/abs/2307.14291",
    "context": "Title: Founding a mathematical diffusion model in linguistics. The case study of German syntactic features in the North-Eastern Italian dialects. (arXiv:2307.14291v1 [cs.CL])\nAbstract: We take as a case study the spread of Germanic syntactic features into Romance dialects of North-Eastern Italy, which occurred after the immigration of German people in the Tyrol during the High Middle Ages.  An interactive map is produced using tools of what is called Geographic Data Science. A smooth two-dimensional surface $\\mathcal{G}$ expresses locally which fraction of territory uses a given German language feature: it is obtained by interpolating a discrete function that says if at any surveyed locality that feature is used or not.\\newline  This surface $\\mathcal{G}$ is thought of as the value at the present time of a function describing a diffusion-convection phenomenon in two dimensions (here said \\emph{tidal} mode), which is subjected in a very natural way to the same equation, suitably contextualized, used in physics for a number of phenomenological facts like the heat diffusion. It is shown that solutions of this equation, evaluated at the present time, fit well with the da",
    "path": "papers/23/07/2307.14291.json",
    "total_tokens": 780,
    "translated_title": "在语言学中创立一个数学扩散模型。北东意大利方言中德语句法特征的案例研究。",
    "translated_abstract": "我们以北东意大利罗曼方言中德语句法特征的传播为案例研究，该特征在中世纪高中世纪时期的蒂罗尔德国人移民后发生。使用地理数据科学工具绘制出一个交互式地图。一个平滑的二维曲面$\\mathcal{G}$表示当地使用给定德语语言特征的领土比例：通过对表示该特征在任何调查地点是否使用的离散函数进行插值得到。",
    "tldr": "该论文通过研究德语句法特征在北东意大利方言中的传播，建立了一个数学扩散模型，并通过地理数据科学工具生成了交互式地图。"
}