{
    "title": "MUSE: Multi-View Contrastive Learning for Heterophilic Graphs. (arXiv:2307.16026v1 [cs.LG])",
    "abstract": "In recent years, self-supervised learning has emerged as a promising approach in addressing the issues of label dependency and poor generalization performance in traditional GNNs. However, existing self-supervised methods have limited effectiveness on heterophilic graphs, due to the homophily assumption that results in similar node representations for connected nodes. In this work, we propose a multi-view contrastive learning model for heterophilic graphs, namely, MUSE. Specifically, we construct two views to capture the information of the ego node and its neighborhood by GNNs enhanced with contrastive learning, respectively. Then we integrate the information from these two views to fuse the node representations. Fusion contrast is utilized to enhance the effectiveness of fused node representations. Further, considering that the influence of neighboring contextual information on information fusion may vary across different ego nodes, we employ an information fusion controller to model ",
    "link": "http://arxiv.org/abs/2307.16026",
    "context": "Title: MUSE: Multi-View Contrastive Learning for Heterophilic Graphs. (arXiv:2307.16026v1 [cs.LG])\nAbstract: In recent years, self-supervised learning has emerged as a promising approach in addressing the issues of label dependency and poor generalization performance in traditional GNNs. However, existing self-supervised methods have limited effectiveness on heterophilic graphs, due to the homophily assumption that results in similar node representations for connected nodes. In this work, we propose a multi-view contrastive learning model for heterophilic graphs, namely, MUSE. Specifically, we construct two views to capture the information of the ego node and its neighborhood by GNNs enhanced with contrastive learning, respectively. Then we integrate the information from these two views to fuse the node representations. Fusion contrast is utilized to enhance the effectiveness of fused node representations. Further, considering that the influence of neighboring contextual information on information fusion may vary across different ego nodes, we employ an information fusion controller to model ",
    "path": "papers/23/07/2307.16026.json",
    "total_tokens": 839,
    "translated_title": "MUSE: 多视角对比学习用于异质图",
    "translated_abstract": "近年来，自监督学习已成为解决传统图神经网络中标签依赖和泛化性能差的问题的一种有希望的方法。然而，现有的自监督方法在异质图上的效果有限，这是由于同质性假设导致相邻节点具有类似的节点表示。本文提出了一种多视角对比学习模型MUSE用于异质图。具体而言，我们通过增强对比学习的GNN分别构建了两个视角来捕捉自我节点和邻居节点的信息。然后我们整合这两个视角的信息来融合节点表示。融合对比用于增强融合后的节点表示的效果。此外，考虑到邻域上下文信息对于信息融合的影响可能因不同的自我节点而异，我们使用信息融合控制器对其进行建模。",
    "tldr": "MUSE是一种用于异质图的多视角对比学习模型，通过构建两个视角来捕捉自我节点和邻居节点的信息，并整合融合后的节点表示，以增强图神经网络的效果。",
    "en_tdlr": "MUSE is a multi-view contrastive learning model for heterophilic graphs that captures information of ego nodes and neighboring nodes, integrates fused node representations, and enhances the effectiveness of graph neural networks."
}