{
    "title": "Machine Learning Applications In Healthcare: The State Of Knowledge and Future Directions. (arXiv:2307.14067v1 [cs.LG])",
    "abstract": "Detection of easily missed hidden patterns with fast processing power makes machine learning (ML) indispensable to today's healthcare system. Though many ML applications have already been discovered and many are still under investigation, only a few have been adopted by current healthcare systems. As a result, there exists an enormous opportunity in healthcare system for ML but distributed information, scarcity of properly arranged and easily explainable documentation in related sector are major impede which are making ML applications difficult to healthcare professionals. This study aimed to gather ML applications in different areas of healthcare concisely and more effectively so that necessary information can be accessed immediately with relevant references. We divided our study into five major groups: community level work, risk management/ preventive care, healthcare operation management, remote care, and early detection. Dividing these groups into subgroups, we provided relevant re",
    "link": "http://arxiv.org/abs/2307.14067",
    "context": "Title: Machine Learning Applications In Healthcare: The State Of Knowledge and Future Directions. (arXiv:2307.14067v1 [cs.LG])\nAbstract: Detection of easily missed hidden patterns with fast processing power makes machine learning (ML) indispensable to today's healthcare system. Though many ML applications have already been discovered and many are still under investigation, only a few have been adopted by current healthcare systems. As a result, there exists an enormous opportunity in healthcare system for ML but distributed information, scarcity of properly arranged and easily explainable documentation in related sector are major impede which are making ML applications difficult to healthcare professionals. This study aimed to gather ML applications in different areas of healthcare concisely and more effectively so that necessary information can be accessed immediately with relevant references. We divided our study into five major groups: community level work, risk management/ preventive care, healthcare operation management, remote care, and early detection. Dividing these groups into subgroups, we provided relevant re",
    "path": "papers/23/07/2307.14067.json",
    "total_tokens": 852,
    "translated_title": "机器学习在医疗领域的应用：现状和未来方向",
    "translated_abstract": "快速处理能力和对易被忽视的隐藏模式的检测使得机器学习（ML）对今天的医疗系统至关重要。尽管已经发现了许多ML应用程序，还有许多应用程序仍在研究中，但目前的医疗系统只有少数应用了这些技术。因此，在医疗系统中存在着巨大的机器学习机会，但分散的信息、缺乏适当安排和易于解释的相关文件是使机器学习应用难以使用的主要障碍。本研究旨在简洁、更有效地收集不同领域医疗保健中的机器学习应用，以便立即访问相关参考资料。我们将研究分为五大组：社区级工作、风险管理/预防保健、医疗运营管理、远程护理和早期检测。将这些组分为子组，我们提供了相关的参考文献。",
    "tldr": "机器学习在医疗领域有着巨大的应用潜力，但由于分散的信息和缺乏易于理解的文档，使得其应用受到了限制。"
}