{
    "title": "Does regional variation in wage levels identify the effects of a national minimum wage?. (arXiv:2307.01284v1 [econ.EM])",
    "abstract": "This paper examines the identification assumptions underlying estimators of the causal effects of national minimum wages on employment and wages, such as the \"fraction affected\" and \"effective minimum wage\" designs. Specifically, I conduct a series of simulation exercises to investigate whether these assumptions hold in the context of particular economic models used as data-generating processes. I find that, in many cases, the fraction affected design exhibits small biases that lead to inflated rejection rates of the true causal effect. These biases can be larger in the presence of either trends in the dispersion of wages within regions, equilibrium responses to the minimum wage, or violations of the parallel trends assumption. I propose two diagnostic exercises to complement the standard test for differential pre-trends commonly used to validate this design. For the effective minimum wage design, I show that while the identification assumptions emphasized by Lee (1999) are crucial, th",
    "link": "http://arxiv.org/abs/2307.01284",
    "context": "Title: Does regional variation in wage levels identify the effects of a national minimum wage?. (arXiv:2307.01284v1 [econ.EM])\nAbstract: This paper examines the identification assumptions underlying estimators of the causal effects of national minimum wages on employment and wages, such as the \"fraction affected\" and \"effective minimum wage\" designs. Specifically, I conduct a series of simulation exercises to investigate whether these assumptions hold in the context of particular economic models used as data-generating processes. I find that, in many cases, the fraction affected design exhibits small biases that lead to inflated rejection rates of the true causal effect. These biases can be larger in the presence of either trends in the dispersion of wages within regions, equilibrium responses to the minimum wage, or violations of the parallel trends assumption. I propose two diagnostic exercises to complement the standard test for differential pre-trends commonly used to validate this design. For the effective minimum wage design, I show that while the identification assumptions emphasized by Lee (1999) are crucial, th",
    "path": "papers/23/07/2307.01284.json",
    "total_tokens": 918,
    "translated_title": "区域工资水平的变化能否确定国家最低工资的影响？",
    "translated_abstract": "本文探讨了估计国家最低工资对就业和工资的因果效应的估计量所依赖的识别假设，例如“受影响比例”和“有效最低工资”设计。具体来说，我进行了一系列模拟实验，研究这些假设在特定经济模型下是否成立作为数据生成流程。我发现，在许多情况下，受影响比例设计显示出小的偏差，导致对真实因果效应的拒绝率过高。在工资差异在不同地区扩大、对最低工资的均衡反应或平行趋势假设的违反存在时，这些偏差可能更大。我提出了两种诊断方法，以补充常用于验证这种设计的差异预趋势的标准测试。对于有效最低工资设计，我表明Lee(1999)强调的识别假设至关重要。",
    "tldr": "本文研究了国家最低工资对就业和工资的因果效应，并发现受影响比例设计存在偏差，导致对真实因果效应的拒绝率过高。我还提出了两种诊断方法来验证这种设计，对于有效最低工资设计，Lee(1999)强调的识别假设至关重要。",
    "en_tdlr": "This paper examines the causal effects of national minimum wages on employment and wages, and finds that the \"fraction affected\" design exhibits biases that lead to inflated rejection rates of the true causal effect. It also proposes diagnostic exercises and emphasizes the crucial identification assumptions in the effective minimum wage design."
}