{
    "title": "Structural Balance and Random Walks on Complex Networks with Complex Weights. (arXiv:2307.01813v1 [cs.SI])",
    "abstract": "Complex numbers define the relationship between entities in many situations. A canonical example would be the off-diagonal terms in a Hamiltonian matrix in quantum physics. Recent years have seen an increasing interest to extend the tools of network science when the weight of edges are complex numbers. Here, we focus on the case when the weight matrix is Hermitian, a reasonable assumption in many applications, and investigate both structural and dynamical properties of the complex-weighted networks. Building on concepts from signed graphs, we introduce a classification of complex-weighted networks based on the notion of structural balance, and illustrate the shared spectral properties within each type. We then apply the results to characterise the dynamics of random walks on complex-weighted networks, where local consensus can be achieved asymptotically when the graph is structurally balanced, while global consensus will be obtained when it is strictly unbalanced. Finally, we explore p",
    "link": "http://arxiv.org/abs/2307.01813",
    "context": "Title: Structural Balance and Random Walks on Complex Networks with Complex Weights. (arXiv:2307.01813v1 [cs.SI])\nAbstract: Complex numbers define the relationship between entities in many situations. A canonical example would be the off-diagonal terms in a Hamiltonian matrix in quantum physics. Recent years have seen an increasing interest to extend the tools of network science when the weight of edges are complex numbers. Here, we focus on the case when the weight matrix is Hermitian, a reasonable assumption in many applications, and investigate both structural and dynamical properties of the complex-weighted networks. Building on concepts from signed graphs, we introduce a classification of complex-weighted networks based on the notion of structural balance, and illustrate the shared spectral properties within each type. We then apply the results to characterise the dynamics of random walks on complex-weighted networks, where local consensus can be achieved asymptotically when the graph is structurally balanced, while global consensus will be obtained when it is strictly unbalanced. Finally, we explore p",
    "path": "papers/23/07/2307.01813.json",
    "total_tokens": 968,
    "translated_title": "复杂网络中的结构平衡和随机游走与复数权重的研究",
    "translated_abstract": "复数在很多情况下定义了实体之间的关系。量子物理中的哈密顿矩阵的非对角项就是一个典型的例子。近年来，人们对在边的权重是复数时拓展网络科学工具的兴趣不断增加。在这里，我们专注于权重矩阵是厄米矩阵的情况，这在许多应用中是一个合理的假设，并研究了复数权重网络的结构和动态属性。基于有符号图的概念，我们引入了一种基于结构平衡的复数权重网络分类，并展示了每种类型中的共享谱属性。然后，我们将结果应用于对复数权重网络上的随机游走动力学的特征化，当图是结构平衡的时候，局部一致性可以渐近地实现，而当图严格不平衡时，全局一致性将被实现。最后，我们探索了p值....（原文未完成）",
    "tldr": "这篇论文研究了复杂网络中的结构平衡和随机游走，介绍了用于复数权重网络的结构平衡的分类方法，并研究了其动态属性。通过分析复数权重网络上的随机游走，发现当网络是结构平衡的时候，可以实现局部一致性，而当网络严格不平衡时，可以实现全局一致性。",
    "en_tdlr": "This paper explores structural balance and random walks on complex networks, introduces a classification method for structural balance in complex-weighted networks, and investigates their dynamic properties. By analyzing random walks on complex-weighted networks, it is found that local consensus can be achieved when the network is structurally balanced, while global consensus can be achieved when it is strictly unbalanced."
}