{
    "title": "Controlling dynamical systems to complex target states using machine learning: next-generation vs. classical reservoir computing. (arXiv:2307.07195v1 [cs.LG])",
    "abstract": "Controlling nonlinear dynamical systems using machine learning allows to not only drive systems into simple behavior like periodicity but also to more complex arbitrary dynamics. For this, it is crucial that a machine learning system can be trained to reproduce the target dynamics sufficiently well. On the example of forcing a chaotic parametrization of the Lorenz system into intermittent dynamics, we show first that classical reservoir computing excels at this task. In a next step, we compare those results based on different amounts of training data to an alternative setup, where next-generation reservoir computing is used instead. It turns out that while delivering comparable performance for usual amounts of training data, next-generation RC significantly outperforms in situations where only very limited data is available. This opens even further practical control applications in real world problems where data is restricted.",
    "link": "http://arxiv.org/abs/2307.07195",
    "context": "Title: Controlling dynamical systems to complex target states using machine learning: next-generation vs. classical reservoir computing. (arXiv:2307.07195v1 [cs.LG])\nAbstract: Controlling nonlinear dynamical systems using machine learning allows to not only drive systems into simple behavior like periodicity but also to more complex arbitrary dynamics. For this, it is crucial that a machine learning system can be trained to reproduce the target dynamics sufficiently well. On the example of forcing a chaotic parametrization of the Lorenz system into intermittent dynamics, we show first that classical reservoir computing excels at this task. In a next step, we compare those results based on different amounts of training data to an alternative setup, where next-generation reservoir computing is used instead. It turns out that while delivering comparable performance for usual amounts of training data, next-generation RC significantly outperforms in situations where only very limited data is available. This opens even further practical control applications in real world problems where data is restricted.",
    "path": "papers/23/07/2307.07195.json",
    "total_tokens": 875,
    "translated_title": "用机器学习控制动力系统到复杂的目标状态：下一代与传统储备计算的比较",
    "translated_abstract": "使用机器学习来控制非线性动力系统不仅可以使系统进入简单的周期行为，还可以实现更复杂的任意动态。为了实现这一点，关键在于训练一个机器学习系统能够很好地重现目标动力学。以将洛伦兹系统的混沌参数化驱动为例，我们首先展示了传统储备计算在这个任务上的出色表现。然后，我们比较了使用不同数量的训练数据的基于下一代储备计算的结果与另一种设置的结果。结果表明，尽管在通常的训练数据量上表现相当，但在只有非常有限的数据可用的情况下，下一代储备计算表现显著优于传统方法。这为在数据受限的实际控制应用中进一步提供了可能性。",
    "tldr": "用机器学习控制动力系统到复杂的目标状态，比较了下一代储备计算和传统储备计算。研究发现，在数据受限的情况下，下一代储备计算表现优于传统方法，为实际控制应用提供了更多可能性。",
    "en_tdlr": "This paper discusses the use of machine learning to control dynamical systems into complex target states and compares the performance of next-generation reservoir computing with classical reservoir computing. The study finds that next-generation reservoir computing outperforms in situations with limited data, providing new possibilities for practical control applications."
}