{
    "title": "An Evaluation of Zero-Cost Proxies -- from Neural Architecture Performance to Model Robustness. (arXiv:2307.09365v1 [cs.LG])",
    "abstract": "Zero-cost proxies are nowadays frequently studied and used to search for neural architectures. They show an impressive ability to predict the performance of architectures by making use of their untrained weights. These techniques allow for immense search speed-ups. So far the joint search for well-performing and robust architectures has received much less attention in the field of NAS. Therefore, the main focus of zero-cost proxies is the clean accuracy of architectures, whereas the model robustness should play an evenly important part. In this paper, we analyze the ability of common zero-cost proxies to serve as performance predictors for robustness in the popular NAS-Bench-201 search space. We are interested in the single prediction task for robustness and the joint multi-objective of clean and robust accuracy. We further analyze the feature importance of the proxies and show that predicting the robustness makes the prediction task from existing zero-cost proxies more challenging. As",
    "link": "http://arxiv.org/abs/2307.09365",
    "context": "Title: An Evaluation of Zero-Cost Proxies -- from Neural Architecture Performance to Model Robustness. (arXiv:2307.09365v1 [cs.LG])\nAbstract: Zero-cost proxies are nowadays frequently studied and used to search for neural architectures. They show an impressive ability to predict the performance of architectures by making use of their untrained weights. These techniques allow for immense search speed-ups. So far the joint search for well-performing and robust architectures has received much less attention in the field of NAS. Therefore, the main focus of zero-cost proxies is the clean accuracy of architectures, whereas the model robustness should play an evenly important part. In this paper, we analyze the ability of common zero-cost proxies to serve as performance predictors for robustness in the popular NAS-Bench-201 search space. We are interested in the single prediction task for robustness and the joint multi-objective of clean and robust accuracy. We further analyze the feature importance of the proxies and show that predicting the robustness makes the prediction task from existing zero-cost proxies more challenging. As",
    "path": "papers/23/07/2307.09365.json",
    "total_tokens": 923,
    "translated_title": "零成本代理的评估——从神经结构性能到模型的鲁棒性",
    "translated_abstract": "零成本代理现如今被广泛研究和应用于神经结构搜索中。它们通过利用未经训练的参数来预测结构的性能，展示出令人印象深刻的能力。这些技术大大加快了搜索速度。然而，至今在NAS领域中，很少有关于同时搜索性能和鲁棒性的研究。因此，零成本代理的主要关注点是结构的准确率，而模型的鲁棒性应该同样重要。本文分析了常见的零成本代理在流行的NAS-Bench-201搜索空间中作为性能预测器的能力。我们对鲁棒性的单一预测任务和干净准确率与鲁棒准确率的综合多目标进行了研究。我们进一步分析了代理的特征重要性，并展示了预测鲁棒性使得从现有的零成本代理进行预测变得更加具有挑战性。",
    "tldr": "这篇论文评估了常见的零成本代理在神经结构搜索中的作用，特别关注了性能预测和模型鲁棒性。研究发现预测鲁棒性使得从现有的零成本代理进行预测更加具有挑战性。"
}