{
    "title": "Beyond Single-Feature Importance with ICECREAM. (arXiv:2307.09779v1 [cs.LG])",
    "abstract": "Which set of features was responsible for a certain output of a machine learning model? Which components caused the failure of a cloud computing application? These are just two examples of questions we are addressing in this work by Identifying Coalition-based Explanations for Common and Rare Events in Any Model (ICECREAM). Specifically, we propose an information-theoretic quantitative measure for the influence of a coalition of variables on the distribution of a target variable. This allows us to identify which set of factors is essential to obtain a certain outcome, as opposed to well-established explainability and causal contribution analysis methods which can assign contributions only to individual factors and rank them by their importance. In experiments with synthetic and real-world data, we show that ICECREAM outperforms state-of-the-art methods for explainability and root cause analysis, and achieves impressive accuracy in both tasks.",
    "link": "http://arxiv.org/abs/2307.09779",
    "context": "Title: Beyond Single-Feature Importance with ICECREAM. (arXiv:2307.09779v1 [cs.LG])\nAbstract: Which set of features was responsible for a certain output of a machine learning model? Which components caused the failure of a cloud computing application? These are just two examples of questions we are addressing in this work by Identifying Coalition-based Explanations for Common and Rare Events in Any Model (ICECREAM). Specifically, we propose an information-theoretic quantitative measure for the influence of a coalition of variables on the distribution of a target variable. This allows us to identify which set of factors is essential to obtain a certain outcome, as opposed to well-established explainability and causal contribution analysis methods which can assign contributions only to individual factors and rank them by their importance. In experiments with synthetic and real-world data, we show that ICECREAM outperforms state-of-the-art methods for explainability and root cause analysis, and achieves impressive accuracy in both tasks.",
    "path": "papers/23/07/2307.09779.json",
    "total_tokens": 816,
    "translated_title": "超越单一特征重要性的新方法ICECREAM",
    "translated_abstract": "机器学习模型输出的确定特征集合是哪些？云计算应用失败的原因是哪些组件？本研究通过一种基于联合的可解释性方法ICECREAM，解答了这两个问题。具体来说，我们提出了一种信息论量化方法，用于衡量变量联合对目标变量分布的影响。相比于现有的解释性和因果贡献分析方法，该方法能够确定一个特定结果所需的关键因素集合，而不仅仅是对个体因素进行重要性排序。在合成数据和真实数据的实验中，我们展示了ICECREAM在解释性和根本原因分析方面超越了现有方法，并在两个任务上取得了令人印象深刻的准确性。",
    "tldr": "提出了一种名为ICECREAM的新方法，超越了单一特征重要性的统计方法。该方法利用信息论量化衡量了变量联合对目标变量分布的影响，能够确定一个特定结果所需的关键因素集合。",
    "en_tdlr": "A new method called ICECREAM is proposed, which goes beyond the single-feature importance statistical methods. This method quantifies the influence of a coalition of variables on the distribution of a target variable using information theory, allowing the identification of a critical set of factors necessary for a specific outcome."
}