{
    "title": "Dynamic Function Market Maker. (arXiv:2307.13624v1 [q-fin.GN])",
    "abstract": "Decentralised automated market makers (AMMs) have gained significant attention recently. We propose an adaptive and automated Dynamic Function Market Maker (DFMM) that addresses challenges in this space. Our DFMM protocol includes a data aggregator and an order routing mechanism. It synchronises price-sensitive market information, asserting the principle of one price, and ensuring market efficiency. The data aggregator includes a virtual order book, asserting efficient asset pricing by staying synchronised with information from external venues, including competitors. The protocol's rebalancing and order routing method optimises inventory risk through arbitrageurs, who are more likely to assist DFMM, enhancing protocol stability. DFMM incorporates protective buffers with non-linear derivative instruments to manage risk and mitigate losses caused by market volatility. The protocol employs an algorithmic accounting-asset, connecting all pools and resolving the issue of segregated pools an",
    "link": "http://arxiv.org/abs/2307.13624",
    "context": "Title: Dynamic Function Market Maker. (arXiv:2307.13624v1 [q-fin.GN])\nAbstract: Decentralised automated market makers (AMMs) have gained significant attention recently. We propose an adaptive and automated Dynamic Function Market Maker (DFMM) that addresses challenges in this space. Our DFMM protocol includes a data aggregator and an order routing mechanism. It synchronises price-sensitive market information, asserting the principle of one price, and ensuring market efficiency. The data aggregator includes a virtual order book, asserting efficient asset pricing by staying synchronised with information from external venues, including competitors. The protocol's rebalancing and order routing method optimises inventory risk through arbitrageurs, who are more likely to assist DFMM, enhancing protocol stability. DFMM incorporates protective buffers with non-linear derivative instruments to manage risk and mitigate losses caused by market volatility. The protocol employs an algorithmic accounting-asset, connecting all pools and resolving the issue of segregated pools an",
    "path": "papers/23/07/2307.13624.json",
    "total_tokens": 914,
    "translated_title": "动态函数市场制造商",
    "translated_abstract": "最近，去中心化的自动化市场制造商（AMMs）引起了极大的关注。我们提出了一种自适应自动化的动态函数市场制造商（DFMM），以解决这一领域的挑战。我们的DFMM协议包括一个数据聚合器和一个订单路由机制。它同步价格敏感的市场信息，并断言一个价格原则，确保市场效率。数据聚合器包括一个虚拟订单簿，通过与来自外部交易场所（包括竞争对手）的信息保持同步，断言有效的资产定价。协议的再平衡和订单路由方法通过仲裁者优化库存风险，仲裁者更有可能帮助DFMM，提高协议的稳定性。DFMM采用具有非线性衍生品工具的保护性缓冲区来管理风险，并减轻市场波动引起的损失。该协议采用算法会计资产，连接所有池，并解决了分隔池的问题",
    "tldr": "提出了一种自适应自动化的动态函数市场制造商（DFMM）协议，它包括数据聚合器和订单路由机制，能够同步价格敏感市场信息、实现一个价格原则、保证市场效率、优化库存风险，并减轻市场波动引起的损失。",
    "en_tdlr": "A proposed protocol called Dynamic Function Market Maker (DFMM) addresses challenges in the decentralized automated market maker (AMM) space. It includes a data aggregator and an order routing mechanism, synchronizes price-sensitive market information, asserts the principle of one price, ensures market efficiency, optimizes inventory risk, and mitigates losses caused by market volatility."
}