{
    "title": "Bayesian inference for data-efficient, explainable, and safe robotic motion planning: A review. (arXiv:2307.08024v1 [cs.AI])",
    "abstract": "Bayesian inference has many advantages in robotic motion planning over four perspectives: The uncertainty quantification of the policy, safety (risk-aware) and optimum guarantees of robot motions, data-efficiency in training of reinforcement learning, and reducing the sim2real gap when the robot is applied to real-world tasks. However, the application of Bayesian inference in robotic motion planning is lagging behind the comprehensive theory of Bayesian inference. Further, there are no comprehensive reviews to summarize the progress of Bayesian inference to give researchers a systematic understanding in robotic motion planning. This paper first provides the probabilistic theories of Bayesian inference which are the preliminary of Bayesian inference for complex cases. Second, the Bayesian estimation is given to estimate the posterior of policies or unknown functions which are used to compute the policy. Third, the classical model-based Bayesian RL and model-free Bayesian RL algorithms f",
    "link": "http://arxiv.org/abs/2307.08024",
    "context": "Title: Bayesian inference for data-efficient, explainable, and safe robotic motion planning: A review. (arXiv:2307.08024v1 [cs.AI])\nAbstract: Bayesian inference has many advantages in robotic motion planning over four perspectives: The uncertainty quantification of the policy, safety (risk-aware) and optimum guarantees of robot motions, data-efficiency in training of reinforcement learning, and reducing the sim2real gap when the robot is applied to real-world tasks. However, the application of Bayesian inference in robotic motion planning is lagging behind the comprehensive theory of Bayesian inference. Further, there are no comprehensive reviews to summarize the progress of Bayesian inference to give researchers a systematic understanding in robotic motion planning. This paper first provides the probabilistic theories of Bayesian inference which are the preliminary of Bayesian inference for complex cases. Second, the Bayesian estimation is given to estimate the posterior of policies or unknown functions which are used to compute the policy. Third, the classical model-based Bayesian RL and model-free Bayesian RL algorithms f",
    "path": "papers/23/07/2307.08024.json",
    "total_tokens": 1024,
    "translated_title": "贝叶斯推理在数据高效、可解释和安全的机器人运动规划中的应用：一项综述",
    "translated_abstract": "贝叶斯推理在机器人运动规划中具有许多优势，包括策略的不确定性量化、机器人运动的安全性和最佳性保证、强化学习训练的数据效率以及在机器人应用于真实世界任务时减小模拟到现实的差距。然而，贝叶斯推理在机器人运动规划中的应用滞后于贝叶斯推理的全面理论。此外，还没有综述来总结贝叶斯推理在机器人运动规划中的进展，以便给研究人员提供系统的理解。本文首先介绍了贝叶斯推理的概率理论，这些是解决复杂情况下贝叶斯推理的首要前提。其次，给出了贝叶斯估计用于估计策略或未知函数的后验概率，这些后验概率用于计算策略。第三，介绍了经典的基于模型的贝叶斯强化学习和无模型的贝叶斯强化学习算法。",
    "tldr": "这篇论文综述了贝叶斯推理在机器人运动规划中的应用优势，包括策略不确定性量化、机器人运动的安全性和最优性保证、数据效率以及模拟到现实的差距。该综述提供了贝叶斯推理的概率理论和估计方法，并介绍了经典的基于模型和无模型的贝叶斯强化学习算法。",
    "en_tdlr": "This review paper summarizes the advantages of Bayesian inference in robotic motion planning, including uncertainty quantification of policies, safety and optimality guarantees of robot motions, data efficiency, and reducing the sim2real gap. It provides the probability theory and estimation methods of Bayesian inference, and introduces classical model-based and model-free Bayesian reinforcement learning algorithms."
}