{
    "title": "DBGSA: A Novel Data Adaptive Bregman Clustering Algorithm. (arXiv:2307.14375v1 [cs.LG])",
    "abstract": "With the development of Big data technology, data analysis has become increasingly important. Traditional clustering algorithms such as K-means are highly sensitive to the initial centroid selection and perform poorly on non-convex datasets. In this paper, we address these problems by proposing a data-driven Bregman divergence parameter optimization clustering algorithm (DBGSA), which combines the Universal Gravitational Algorithm to bring similar points closer in the dataset. We construct a gravitational coefficient equation with a special property that gradually reduces the influence factor as the iteration progresses. Furthermore, we introduce the Bregman divergence generalized power mean information loss minimization to identify cluster centers and build a hyperparameter identification optimization model, which effectively solves the problems of manual adjustment and uncertainty in the improved dataset. Extensive experiments are conducted on four simulated datasets and six real dat",
    "link": "http://arxiv.org/abs/2307.14375",
    "context": "Title: DBGSA: A Novel Data Adaptive Bregman Clustering Algorithm. (arXiv:2307.14375v1 [cs.LG])\nAbstract: With the development of Big data technology, data analysis has become increasingly important. Traditional clustering algorithms such as K-means are highly sensitive to the initial centroid selection and perform poorly on non-convex datasets. In this paper, we address these problems by proposing a data-driven Bregman divergence parameter optimization clustering algorithm (DBGSA), which combines the Universal Gravitational Algorithm to bring similar points closer in the dataset. We construct a gravitational coefficient equation with a special property that gradually reduces the influence factor as the iteration progresses. Furthermore, we introduce the Bregman divergence generalized power mean information loss minimization to identify cluster centers and build a hyperparameter identification optimization model, which effectively solves the problems of manual adjustment and uncertainty in the improved dataset. Extensive experiments are conducted on four simulated datasets and six real dat",
    "path": "papers/23/07/2307.14375.json",
    "total_tokens": 915,
    "translated_title": "DBGSA:一种新颖的数据自适应Bregman聚类算法",
    "translated_abstract": "随着大数据技术的发展，数据分析变得越来越重要。传统的聚类算法（如K-means）对初始质心的选择非常敏感，在非凸数据集上表现不佳。本文通过提出一种数据驱动的Bregman分裂参数优化聚类算法（DBGSA），解决了这些问题。该算法结合了普适引力算法，将相似点在数据集中靠近。我们构建了一个具有特殊属性的引力系数方程，随着迭代的进行逐渐降低影响因素。此外，我们引入了Bregman分裂广义幂信息损失最小化方法来识别聚类中心，并构建了一个超参数识别优化模型，有效解决了改进数据集中的手动调整和不确定性问题。对四个模拟数据集和六个真实数据集进行了大量实验。",
    "tldr": "本研究提出了一种新颖的数据自适应Bregman聚类算法（DBGSA），通过结合普适引力算法、引入Bregman分裂广义幂信息损失最小化方法和构建超参数识别优化模型，有效解决了传统聚类算法在初始质心选择敏感和处理非凸数据集的问题。",
    "en_tdlr": "This paper proposes a novel data adaptive Bregman clustering algorithm (DBGSA), which addresses the problems of sensitive initial centroid selection and poor performance on non-convex datasets in traditional clustering algorithms. It combines the Universal Gravitational Algorithm, introduces the Bregman divergence generalized power mean information loss minimization method, and builds a hyperparameter identification optimization model. Extensive experiments are conducted to validate the effectiveness of the proposed algorithm on simulated and real datasets."
}