{
    "title": "How do software citation formats evolve over time? A longitudinal analysis of R programming language packages. (arXiv:2307.09390v1 [cs.DL])",
    "abstract": "Under the data-driven research paradigm, research software has come to play crucial roles in nearly every stage of scientific inquiry. Scholars are advocating for the formal citation of software in academic publications, treating it on par with traditional research outputs. However, software is hardly consistently cited: one software entity can be cited as different objects, and the citations can change over time. These issues, however, are largely overlooked in existing empirical research on software citation. To fill the above gaps, the present study compares and analyzes a longitudinal dataset of citation formats of all R packages collected in 2021 and 2022, in order to understand the citation formats of R-language packages, important members in the open-source software family, and how the citations evolve over time. In particular, we investigate the different document types underlying the citations and what metadata elements in the citation formats changed over time. Furthermore, w",
    "link": "http://arxiv.org/abs/2307.09390",
    "context": "Title: How do software citation formats evolve over time? A longitudinal analysis of R programming language packages. (arXiv:2307.09390v1 [cs.DL])\nAbstract: Under the data-driven research paradigm, research software has come to play crucial roles in nearly every stage of scientific inquiry. Scholars are advocating for the formal citation of software in academic publications, treating it on par with traditional research outputs. However, software is hardly consistently cited: one software entity can be cited as different objects, and the citations can change over time. These issues, however, are largely overlooked in existing empirical research on software citation. To fill the above gaps, the present study compares and analyzes a longitudinal dataset of citation formats of all R packages collected in 2021 and 2022, in order to understand the citation formats of R-language packages, important members in the open-source software family, and how the citations evolve over time. In particular, we investigate the different document types underlying the citations and what metadata elements in the citation formats changed over time. Furthermore, w",
    "path": "papers/23/07/2307.09390.json",
    "total_tokens": 975,
    "translated_title": "软件引用格式如何随时间演变？对R编程语言包的纵向分析",
    "translated_abstract": "在数据驱动的研究范式下，研究软件在科学探究的几乎每个阶段都发挥着关键作用。学者们呼吁在学术出版物中正式引用软件，将其视为传统研究成果的平等对象。然而，软件的引用并不一致：一个软件实体可以被引用为不同的对象，并且引用可能随时间而变化。然而，这些问题在现有的关于软件引用的经验性研究中很大程度上被忽视。为了填补上述空白，本研究通过比较和分析在2021年和2022年收集的所有R软件包的引用格式的纵向数据集，来了解R语言包的引用格式，这些包是开源软件家族中的重要成员，并研究引用格式如何随时间演变。特别地，我们研究了引用背后的不同文档类型，以及引用格式中的哪些元数据元素随时间发生了变化。",
    "tldr": "本研究通过对2021年和2022年收集的R语言包的引用格式的纵向数据集进行比较和分析，揭示了软件引用格式如何随时间演变。研究发现软件的引用存在不一致性，并且引用随时间而变化。这一发现对于理解科学研究中软件引用的重要性和演变具有重要意义。",
    "en_tdlr": "This study compares and analyzes a longitudinal dataset of citation formats of R packages collected in 2021 and 2022, revealing how software citation formats evolve over time. The study finds inconsistencies in software citations and that citations change over time. This finding has important implications for understanding the importance and evolution of software citation in scientific research."
}