{
    "title": "`It is currently hodgepodge'': Examining AI/ML Practitioners' Challenges during Co-production of Responsible AI Values. (arXiv:2307.10221v1 [cs.AI])",
    "abstract": "Recently, the AI/ML research community has indicated an urgent need to establish Responsible AI (RAI) values and practices as part of the AI/ML lifecycle. Several organizations and communities are responding to this call by sharing RAI guidelines. However, there are gaps in awareness, deliberation, and execution of such practices for multi-disciplinary ML practitioners. This work contributes to the discussion by unpacking co-production challenges faced by practitioners as they align their RAI values. We interviewed 23 individuals, across 10 organizations, tasked to ship AI/ML based products while upholding RAI norms and found that both top-down and bottom-up institutional structures create burden for different roles preventing them from upholding RAI values, a challenge that is further exacerbated when executing conflicted values. We share multiple value levers used as strategies by the practitioners to resolve their challenges. We end our paper with recommendations for inclusive and e",
    "link": "http://arxiv.org/abs/2307.10221",
    "context": "Title: `It is currently hodgepodge'': Examining AI/ML Practitioners' Challenges during Co-production of Responsible AI Values. (arXiv:2307.10221v1 [cs.AI])\nAbstract: Recently, the AI/ML research community has indicated an urgent need to establish Responsible AI (RAI) values and practices as part of the AI/ML lifecycle. Several organizations and communities are responding to this call by sharing RAI guidelines. However, there are gaps in awareness, deliberation, and execution of such practices for multi-disciplinary ML practitioners. This work contributes to the discussion by unpacking co-production challenges faced by practitioners as they align their RAI values. We interviewed 23 individuals, across 10 organizations, tasked to ship AI/ML based products while upholding RAI norms and found that both top-down and bottom-up institutional structures create burden for different roles preventing them from upholding RAI values, a challenge that is further exacerbated when executing conflicted values. We share multiple value levers used as strategies by the practitioners to resolve their challenges. We end our paper with recommendations for inclusive and e",
    "path": "papers/23/07/2307.10221.json",
    "total_tokens": 1016,
    "translated_title": "「目前是大杂烩」：探究人工智能/机器学习从业者在共同创造负责任人工智能价值观过程中面临的挑战",
    "translated_abstract": "最近，人工智能/机器学习研究界表示，在人工智能/机器学习生命周期的一部分建立负责任人工智能（RAI）的价值观和实践的迫切需要。一些组织和社区正在响应这一呼吁，分享RAI的指导原则。然而，多学科机器学习从业者在意识、讨论和执行此类实践方面存在差距。本研究通过解析从业者在对齐RAI价值观过程中遇到的共同创造挑战，为此讨论做出了贡献。我们对10个组织中的23名个体进行了访谈，这些个体负责发布基于人工智能/机器学习的产品，同时遵守RAI规范，发现自上而下和自下而上的组织结构为不同职责造成了负担，使其无法坚守RAI价值观，这一挑战在执行冲突的价值观时进一步加剧。我们分享了从业者用作解决挑战策略的多个价值杠杆。我们在论文的最后提出了包容和可行的建议。",
    "tldr": "该论文探究了人工智能/机器学习从业者在共同创造负责任人工智能价值观过程中面临的挑战，发现了上下结构和执行冲突价值观的问题，并提出了解决策略建议。",
    "en_tdlr": "This paper examines the challenges faced by AI/ML practitioners during the co-production of responsible AI values. It highlights issues with top-down and bottom-up institutional structures, as well as conflicting values, and provides recommendations for addressing these challenges."
}