{
    "title": "Classifying multilingual party manifestos: Domain transfer across country, time, and genre. (arXiv:2307.16511v1 [cs.CL])",
    "abstract": "Annotating costs of large corpora are still one of the main bottlenecks in empirical social science research. On the one hand, making use of the capabilities of domain transfer allows re-using annotated data sets and trained models. On the other hand, it is not clear how well domain transfer works and how reliable the results are for transfer across different dimensions. We explore the potential of domain transfer across geographical locations, languages, time, and genre in a large-scale database of political manifestos. First, we show the strong within-domain classification performance of fine-tuned transformer models. Second, we vary the genre of the test set across the aforementioned dimensions to test for the fine-tuned models' robustness and transferability. For switching genres, we use an external corpus of transcribed speeches from New Zealand politicians while for the other three dimensions, custom splits of the Manifesto database are used. While BERT achieves the best scores i",
    "link": "http://arxiv.org/abs/2307.16511",
    "context": "Title: Classifying multilingual party manifestos: Domain transfer across country, time, and genre. (arXiv:2307.16511v1 [cs.CL])\nAbstract: Annotating costs of large corpora are still one of the main bottlenecks in empirical social science research. On the one hand, making use of the capabilities of domain transfer allows re-using annotated data sets and trained models. On the other hand, it is not clear how well domain transfer works and how reliable the results are for transfer across different dimensions. We explore the potential of domain transfer across geographical locations, languages, time, and genre in a large-scale database of political manifestos. First, we show the strong within-domain classification performance of fine-tuned transformer models. Second, we vary the genre of the test set across the aforementioned dimensions to test for the fine-tuned models' robustness and transferability. For switching genres, we use an external corpus of transcribed speeches from New Zealand politicians while for the other three dimensions, custom splits of the Manifesto database are used. While BERT achieves the best scores i",
    "path": "papers/23/07/2307.16511.json",
    "total_tokens": 964,
    "translated_title": "对多语言政党纲领进行分类: 跨国家、时间和体裁的领域转移",
    "translated_abstract": "在实证社会科学研究中，标注大型语料库的成本仍然是主要的瓶颈之一。一方面，利用领域转移的能力可以重复使用标注数据集和训练模型。另一方面，领域转移的效果如何以及在不同维度之间的转移结果的可靠性还不清楚。我们在一个大型政治纲领数据库中探索了地理位置、语言、时间和体裁等领域转移的潜力。首先，我们展示了经过微调的Transformer模型在同一领域内的强大分类性能。其次，我们通过改变测试集的体裁来测试经过微调的模型在上述领域中的稳健性和可转移性。对于体裁切换，我们使用了一份来自新西兰政治家的录音演讲的外部语料库，而对于其他三个维度，我们使用了Manifesto数据库的自定义划分。虽然BERT取得了最好的得分，但我们还发现其它模型也具有很好的性能和可转移性。",
    "tldr": "本研究探索了对多语言政党纲领进行分类的领域转移，在大规模政治纲领数据库中展示了微调Transformer模型在同一领域内的强大性能，并测试了其在不同地理位置、语言、时间和体裁之间的稳健性和可转移性。",
    "en_tdlr": "This study explores domain transfer in classifying multilingual party manifestos, showcasing the strong performance of fine-tuned Transformer models within the same domain, and testing their robustness and transferability across different geographical locations, languages, time, and genre in a large-scale political manifestos database."
}