{
    "title": "CrysMMNet: Multimodal Representation for Crystal Property Prediction. (arXiv:2307.05390v1 [cond-mat.mtrl-sci])",
    "abstract": "Machine Learning models have emerged as a powerful tool for fast and accurate prediction of different crystalline properties. Exiting state-of-the-art models rely on a single modality of crystal data i.e. crystal graph structure, where they construct multi-graph by establishing edges between nearby atoms in 3D space and apply GNN to learn materials representation. Thereby, they encode local chemical semantics around the atoms successfully but fail to capture important global periodic structural information like space group number, crystal symmetry, rotational information, etc, which influence different crystal properties. In this work, we leverage textual descriptions of materials to model global structural information into graph structure and learn a more robust and enriched representation of crystalline materials. To this effect, we first curate a textual dataset for crystalline material databases containing descriptions of each material. Further, we propose CrysMMNet, a simple multi",
    "link": "http://arxiv.org/abs/2307.05390",
    "context": "Title: CrysMMNet: Multimodal Representation for Crystal Property Prediction. (arXiv:2307.05390v1 [cond-mat.mtrl-sci])\nAbstract: Machine Learning models have emerged as a powerful tool for fast and accurate prediction of different crystalline properties. Exiting state-of-the-art models rely on a single modality of crystal data i.e. crystal graph structure, where they construct multi-graph by establishing edges between nearby atoms in 3D space and apply GNN to learn materials representation. Thereby, they encode local chemical semantics around the atoms successfully but fail to capture important global periodic structural information like space group number, crystal symmetry, rotational information, etc, which influence different crystal properties. In this work, we leverage textual descriptions of materials to model global structural information into graph structure and learn a more robust and enriched representation of crystalline materials. To this effect, we first curate a textual dataset for crystalline material databases containing descriptions of each material. Further, we propose CrysMMNet, a simple multi",
    "path": "papers/23/07/2307.05390.json",
    "total_tokens": 763,
    "translated_title": "CrysMMNet: 多模态表示用于晶体属性预测",
    "translated_abstract": "机器学习模型已经成为快速准确预测不同晶体性质的强大工具。现有的最先进模型依赖于晶体数据的单一模态，即晶体图结构，在三维空间中建立相邻原子之间的边，并应用GNN学习材料表示。因此，它们成功地编码了原子周围的局部化学语义，但未能捕捉到影响不同晶体属性的重要的全局周期结构信息，如空间群数、晶体对称性、旋转信息等。在这项工作中，我们利用材料的文本描述将全局结构信息建模为图结构，并学习晶体材料更加稳健丰富的表示。为此，我们首先整理了一个包含每个材料描述的晶体材料数据库的文本数据集。此外，我们提出了CrysMMNet，一个简单的多模态表示方法。",
    "tldr": "CrysMMNet是一种多模态表示方法，通过使用文本描述建模全局结构信息来预测晶体属性。"
}