{
    "title": "Intelligent model for offshore China sea fog forecasting. (arXiv:2307.10580v1 [cs.LG])",
    "abstract": "Accurate and timely prediction of sea fog is very important for effectively managing maritime and coastal economic activities. Given the intricate nature and inherent variability of sea fog, traditional numerical and statistical forecasting methods are often proven inadequate. This study aims to develop an advanced sea fog forecasting method embedded in a numerical weather prediction model using the Yangtze River Estuary (YRE) coastal area as a case study. Prior to training our machine learning model, we employ a time-lagged correlation analysis technique to identify key predictors and decipher the underlying mechanisms driving sea fog occurrence. In addition, we implement ensemble learning and a focal loss function to address the issue of imbalanced data, thereby enhancing the predictive ability of our model. To verify the accuracy of our method, we evaluate its performance using a comprehensive dataset spanning one year, which encompasses both weather station observations and histori",
    "link": "http://arxiv.org/abs/2307.10580",
    "context": "Title: Intelligent model for offshore China sea fog forecasting. (arXiv:2307.10580v1 [cs.LG])\nAbstract: Accurate and timely prediction of sea fog is very important for effectively managing maritime and coastal economic activities. Given the intricate nature and inherent variability of sea fog, traditional numerical and statistical forecasting methods are often proven inadequate. This study aims to develop an advanced sea fog forecasting method embedded in a numerical weather prediction model using the Yangtze River Estuary (YRE) coastal area as a case study. Prior to training our machine learning model, we employ a time-lagged correlation analysis technique to identify key predictors and decipher the underlying mechanisms driving sea fog occurrence. In addition, we implement ensemble learning and a focal loss function to address the issue of imbalanced data, thereby enhancing the predictive ability of our model. To verify the accuracy of our method, we evaluate its performance using a comprehensive dataset spanning one year, which encompasses both weather station observations and histori",
    "path": "papers/23/07/2307.10580.json",
    "total_tokens": 855,
    "translated_title": "中国海上海雾预测的智能模型",
    "translated_abstract": "准确和及时地预测海上海雾对有效管理海上和沿岸经济活动非常重要。鉴于海上海雾的复杂性和固有变异性，传统的数值和统计预测方法往往不足以应对。本研究旨在开发一种高级海上海雾预测方法，将其嵌入数值天气预报模型中，并以长江口沿海地区为案例研究。在训练我们的机器学习模型之前，我们采用时滞相关分析技术来识别关键预测因子，并解析驱动海上海雾发生的基本机制。此外，我们采用集成学习和焦点损失函数来解决不平衡数据的问题，从而提升我们模型的预测能力。为了验证我们方法的准确性，我们使用包括气象站观测数据和历史数据的全面数据集进行性能评估。",
    "tldr": "本研究开发了一种嵌入数值天气预报模型的高级海上海雾预测方法，在解析驱动因素和处理不平衡数据的基础上，提升了海雾预测的准确性和预测能力。",
    "en_tdlr": "This study developed an advanced sea fog forecasting method embedded in a numerical weather prediction model, which improved the accuracy and predictive ability of sea fog prediction by deciphering the driving factors and addressing the issue of imbalanced data."
}