{
    "title": "Risk Preference Types, Limited Consideration, and Welfare. (arXiv:2307.09411v1 [econ.EM])",
    "abstract": "We provide sufficient conditions for semi-nonparametric point identification of a mixture model of decision making under risk, when agents make choices in multiple lines of insurance coverage (contexts) by purchasing a bundle. As a first departure from the related literature, the model allows for two preference types. In the first one, agents behave according to standard expected utility theory with CARA Bernoulli utility function, with an agent-specific coefficient of absolute risk aversion whose distribution is left completely unspecified. In the other, agents behave according to the dual theory of choice under risk(Yaari, 1987) combined with a one-parameter family distortion function, where the parameter is agent-specific and is drawn from a distribution that is left completely unspecified. Within each preference type, the model allows for unobserved heterogeneity in consideration sets, where the latter form at the bundle level -- a second departure from the related literature. Our ",
    "link": "http://arxiv.org/abs/2307.09411",
    "context": "Title: Risk Preference Types, Limited Consideration, and Welfare. (arXiv:2307.09411v1 [econ.EM])\nAbstract: We provide sufficient conditions for semi-nonparametric point identification of a mixture model of decision making under risk, when agents make choices in multiple lines of insurance coverage (contexts) by purchasing a bundle. As a first departure from the related literature, the model allows for two preference types. In the first one, agents behave according to standard expected utility theory with CARA Bernoulli utility function, with an agent-specific coefficient of absolute risk aversion whose distribution is left completely unspecified. In the other, agents behave according to the dual theory of choice under risk(Yaari, 1987) combined with a one-parameter family distortion function, where the parameter is agent-specific and is drawn from a distribution that is left completely unspecified. Within each preference type, the model allows for unobserved heterogeneity in consideration sets, where the latter form at the bundle level -- a second departure from the related literature. Our ",
    "path": "papers/23/07/2307.09411.json",
    "total_tokens": 902,
    "translated_title": "风险偏好类型、有限考虑和福利",
    "translated_abstract": "我们提供了一个风险决策混合模型的半非参数点识别的充分条件，当代理人通过购买捆绑商品在多个保险覆盖领域（环境）中做出选择。作为与相关文献的首次分歧，该模型允许两种偏好类型。在第一种类型中，代理人根据标准期望效用理论以CARA伯努利效用函数的方式行为，其绝对风险厌恶系数的分布完全未指定。在另一种类型中，代理人根据风险选择的对偶理论（Yaari，1987）和一个一参数家族失真函数的方式行为，其中参数是特定的代理人，并且其分布完全未指定。在每种偏好类型中，模型允许在考虑集中存在未观察到的异质性，而考虑集在捆绑水平上形成，这是与相关文献的第二个分歧处。",
    "tldr": "本研究提供了关于风险决策混合模型的半非参数点识别的充分条件，在多个保险覆盖领域中，代理人根据两种偏好类型做出选择，并允许考虑集中存在未观察到的异质性。"
}