{
    "title": "OLR-WA Online Regression with Weighted Average. (arXiv:2307.02804v1 [cs.LG])",
    "abstract": "Machine Learning requires a large amount of training data in order to build accurate models. Sometimes the data arrives over time, requiring significant storage space and recalculating the model to account for the new data. On-line learning addresses these issues by incrementally modifying the model as data is encountered, and then discarding the data. In this study we introduce a new online linear regression approach. Our approach combines newly arriving data with a previously existing model to create a new model. The introduced model, named OLR-WA (OnLine Regression with Weighted Average) uses user-defined weights to provide flexibility in the face of changing data to bias the results in favor of old or new data. We have conducted 2-D and 3-D experiments comparing OLR-WA to a static model using the entire data set. The results show that for consistent data, OLR-WA and the static batch model perform similarly and for varying data, the user can set the OLR-WA to adapt more quickly or t",
    "link": "http://arxiv.org/abs/2307.02804",
    "context": "Title: OLR-WA Online Regression with Weighted Average. (arXiv:2307.02804v1 [cs.LG])\nAbstract: Machine Learning requires a large amount of training data in order to build accurate models. Sometimes the data arrives over time, requiring significant storage space and recalculating the model to account for the new data. On-line learning addresses these issues by incrementally modifying the model as data is encountered, and then discarding the data. In this study we introduce a new online linear regression approach. Our approach combines newly arriving data with a previously existing model to create a new model. The introduced model, named OLR-WA (OnLine Regression with Weighted Average) uses user-defined weights to provide flexibility in the face of changing data to bias the results in favor of old or new data. We have conducted 2-D and 3-D experiments comparing OLR-WA to a static model using the entire data set. The results show that for consistent data, OLR-WA and the static batch model perform similarly and for varying data, the user can set the OLR-WA to adapt more quickly or t",
    "path": "papers/23/07/2307.02804.json",
    "total_tokens": 899,
    "translated_title": "OLR-WA 带加权平均的在线回归",
    "translated_abstract": "为了构建准确的模型，机器学习需要大量的训练数据。有时候数据是逐步到达的，需要大量的存储空间，并且需要重新计算模型以适应新的数据。在线学习通过在遇到数据时逐步修改模型，然后丢弃数据来解决这些问题。在本研究中，我们介绍了一种新的在线线性回归方法。我们的方法将新到达的数据与先前存在的模型相结合，创建一个新模型。引入的模型名为 OLR-WA（带加权平均的在线回归），使用用户定义的权重来在数据变化时提供灵活性，以偏向旧数据或新数据的结果。我们进行了2D和3D实验，将 OLR-WA 与使用整个数据集的静态模型进行了比较。结果显示，在数据一致的情况下，OLR-WA 和静态批处理模型的表现类似，而在数据变化的情况下，用户可以设置 OLR-WA 更快地适应新数据或旧数据的需求。",
    "tldr": "在线回归方法OLR-WA通过将新到达的数据与先前模型相结合，使用用户定义的权重进行加权平均，在遇到数据变化时提供灵活性，既能适应一致数据又能适应变化数据。"
}