{
    "title": "DeepGATGO: A Hierarchical Pretraining-Based Graph-Attention Model for Automatic Protein Function Prediction. (arXiv:2307.13004v1 [q-bio.QM])",
    "abstract": "Automatic protein function prediction (AFP) is classified as a large-scale multi-label classification problem aimed at automating protein enrichment analysis to eliminate the current reliance on labor-intensive wet-lab methods. Currently, popular methods primarily combine protein-related information and Gene Ontology (GO) terms to generate final functional predictions. For example, protein sequences, structural information, and protein-protein interaction networks are integrated as prior knowledge to fuse with GO term embeddings and generate the ultimate prediction results. However, these methods are limited by the difficulty in obtaining structural information or network topology information, as well as the accuracy of such data. Therefore, more and more methods that only use protein sequences for protein function prediction have been proposed, which is a more reliable and computationally cheaper approach. However, the existing methods fail to fully extract feature information from pr",
    "link": "http://arxiv.org/abs/2307.13004",
    "context": "Title: DeepGATGO: A Hierarchical Pretraining-Based Graph-Attention Model for Automatic Protein Function Prediction. (arXiv:2307.13004v1 [q-bio.QM])\nAbstract: Automatic protein function prediction (AFP) is classified as a large-scale multi-label classification problem aimed at automating protein enrichment analysis to eliminate the current reliance on labor-intensive wet-lab methods. Currently, popular methods primarily combine protein-related information and Gene Ontology (GO) terms to generate final functional predictions. For example, protein sequences, structural information, and protein-protein interaction networks are integrated as prior knowledge to fuse with GO term embeddings and generate the ultimate prediction results. However, these methods are limited by the difficulty in obtaining structural information or network topology information, as well as the accuracy of such data. Therefore, more and more methods that only use protein sequences for protein function prediction have been proposed, which is a more reliable and computationally cheaper approach. However, the existing methods fail to fully extract feature information from pr",
    "path": "papers/23/07/2307.13004.json",
    "total_tokens": 914,
    "translated_title": "DeepGATGO:一种基于分层预训练的图注意模型用于自动蛋白功能预测",
    "translated_abstract": "自动蛋白功能预测(AFP)是一个大规模多标签分类问题，旨在自动化蛋白质富集分析，以消除当前对劳动密集型湿实验方法的依赖。目前，主流方法主要结合蛋白质相关信息和基因本体(GO)术语，生成最终的功能预测结果。例如，蛋白质序列、结构信息和蛋白质相互作用网络被整合为先验知识，与GO术语嵌入融合，并生成最终的预测结果。然而，这些方法受到获取结构信息或网络拓扑信息的困难以及这些数据准确性的限制。因此，提出了越来越多只使用蛋白质序列进行蛋白质功能预测的方法，这是一种更可靠且计算成本更低的方法。然而，现有方法未能充分提取蛋白质序列的特征信息。",
    "tldr": "DeepGATGO是一种基于分层预训练的图注意模型，用于自动蛋白功能预测。它通过只使用蛋白质序列，而不需要蛋白质结构信息或网络拓扑信息，实现了可靠且计算成本更低的蛋白质功能预测。",
    "en_tdlr": "DeepGATGO is a hierarchical pretraining-based graph-attention model for automatic protein function prediction. It achieves reliable and computationally cheaper protein function prediction by only using protein sequences without the need for protein structural information or network topology information."
}