{
    "title": "An Efficient Shapley Value Computation for the Naive Bayes Classifier. (arXiv:2307.16718v1 [cs.LG])",
    "abstract": "Variable selection or importance measurement of input variables to a machine learning model has become the focus of much research. It is no longer enough to have a good model, one also must explain its decisions. This is why there are so many intelligibility algorithms available today. Among them, Shapley value estimation algorithms are intelligibility methods based on cooperative game theory. In the case of the naive Bayes classifier, and to our knowledge, there is no ``analytical\" formulation of Shapley values. This article proposes an exact analytic expression of Shapley values in the special case of the naive Bayes Classifier. We analytically compare this Shapley proposal, to another frequently used indicator, the Weight of Evidence (WoE) and provide an empirical comparison of our proposal with (i) the WoE and (ii) KernelShap results on real world datasets, discussing similar and dissimilar results. The results show that our Shapley proposal for the naive Bayes classifier provides ",
    "link": "http://arxiv.org/abs/2307.16718",
    "context": "Title: An Efficient Shapley Value Computation for the Naive Bayes Classifier. (arXiv:2307.16718v1 [cs.LG])\nAbstract: Variable selection or importance measurement of input variables to a machine learning model has become the focus of much research. It is no longer enough to have a good model, one also must explain its decisions. This is why there are so many intelligibility algorithms available today. Among them, Shapley value estimation algorithms are intelligibility methods based on cooperative game theory. In the case of the naive Bayes classifier, and to our knowledge, there is no ``analytical\" formulation of Shapley values. This article proposes an exact analytic expression of Shapley values in the special case of the naive Bayes Classifier. We analytically compare this Shapley proposal, to another frequently used indicator, the Weight of Evidence (WoE) and provide an empirical comparison of our proposal with (i) the WoE and (ii) KernelShap results on real world datasets, discussing similar and dissimilar results. The results show that our Shapley proposal for the naive Bayes classifier provides ",
    "path": "papers/23/07/2307.16718.json",
    "total_tokens": 865,
    "translated_title": "朴素贝叶斯分类器的高效Shapley Value计算",
    "translated_abstract": "变量选择或输入变量的重要性测量已经成为机器学习模型研究的重点。拥有一个好的模型已经不足够，还必须解释其决策。这就是为什么现在有很多可解释性算法。其中，Shapley值估计算法是一种基于合作博弈理论的可解释性方法。在朴素贝叶斯分类器的情况下，据我们所知，没有关于Shapley值的“分析性”公式。本文在朴素贝叶斯分类器的特殊情况下提出了Shapley值的精确分析表达式。我们对比了这个Shapley提议与另一个常用的指标，证据权重（Weight of Evidence，WoE），并在真实世界数据集上对我们的提议与WoE以及KernelShap的结果进行了实证比较，讨论了相似和不相似的结果。结果表明，我们对朴素贝叶斯分类器的Shapley提议提供了",
    "tldr": "这篇论文提出了在朴素贝叶斯分类器中计算Shapley值的新方法，并与Weight of Evidence和KernelShap进行了实证比较。"
}