{
    "title": "Assessment of the suitability of degradation models for the planning of CCTV inspections of sewer pipes. (arXiv:2307.06341v1 [cs.LG])",
    "abstract": "The degradation of sewer pipes poses significant economical, environmental and health concerns. The maintenance of such assets requires structured plans to perform inspections, which are more efficient when structural and environmental features are considered along with the results of previous inspection reports. The development of such plans requires degradation models that can be based on statistical and machine learning methods. This work proposes a methodology to assess their suitability to plan inspections considering three dimensions: accuracy metrics, ability to produce long-term degradation curves and explainability. Results suggest that although ensemble models yield the highest accuracy, they are unable to infer the long-term degradation of the pipes, whereas the Logistic Regression offers a slightly less accurate model that is able to produce consistent degradation curves with a high explainability. A use case is presented to demonstrate this methodology and the efficiency o",
    "link": "http://arxiv.org/abs/2307.06341",
    "context": "Title: Assessment of the suitability of degradation models for the planning of CCTV inspections of sewer pipes. (arXiv:2307.06341v1 [cs.LG])\nAbstract: The degradation of sewer pipes poses significant economical, environmental and health concerns. The maintenance of such assets requires structured plans to perform inspections, which are more efficient when structural and environmental features are considered along with the results of previous inspection reports. The development of such plans requires degradation models that can be based on statistical and machine learning methods. This work proposes a methodology to assess their suitability to plan inspections considering three dimensions: accuracy metrics, ability to produce long-term degradation curves and explainability. Results suggest that although ensemble models yield the highest accuracy, they are unable to infer the long-term degradation of the pipes, whereas the Logistic Regression offers a slightly less accurate model that is able to produce consistent degradation curves with a high explainability. A use case is presented to demonstrate this methodology and the efficiency o",
    "path": "papers/23/07/2307.06341.json",
    "total_tokens": 872,
    "translated_title": "评估降解模型在排污管道CCTV检查规划中的适用性",
    "translated_abstract": "排污管道的降解引起了重大的经济、环境和健康问题。这些资产的维护需要有结构化的计划来进行检查，考虑到结构和环境特征以及以前检查报告的结果，可以更高效地进行。这项工作提出了一种方法来评估降解模型在规划检查时的适用性，考虑了三个维度：准确度指标、能够产生长期降解曲线和可解释性。结果表明，虽然集成模型具有最高的准确度，但它们无法推测管道的长期降解，而逻辑回归则提供了略低准确度的模型，能够产生具有很高可解释性的一致的降解曲线。通过一个使用案例来演示该方法及其效果",
    "tldr": "该论文评估了降解模型在排污管道CCTV检查规划中的适用性。结果表明，虽然集成模型具有最高的准确度，但无法推测长期降解；与此相反，逻辑回归模型准确度稍低，但能够产生可解释性强且一致的降解曲线。",
    "en_tdlr": "This paper assesses the suitability of degradation models for the planning of CCTV inspections of sewer pipes. Results suggest that ensemble models have high accuracy but cannot infer long-term degradation, while logistic regression offers slightly lower accuracy but can produce consistent degradation curves with high explainability."
}