{
    "title": "BLUEX: A benchmark based on Brazilian Leading Universities Entrance eXams. (arXiv:2307.05410v1 [cs.CL])",
    "abstract": "One common trend in recent studies of language models (LMs) is the use of standardized tests for evaluation. However, despite being the fifth most spoken language worldwide, few such evaluations have been conducted in Portuguese. This is mainly due to the lack of high-quality datasets available to the community for carrying out evaluations in Portuguese. To address this gap, we introduce the Brazilian Leading Universities Entrance eXams (BLUEX), a dataset of entrance exams from the two leading universities in Brazil: UNICAMP and USP. The dataset includes annotated metadata for evaluating the performance of NLP models on a variety of subjects. Furthermore, BLUEX includes a collection of recently administered exams that are unlikely to be included in the training data of many popular LMs as of 2023. The dataset is also annotated to indicate the position of images in each question, providing a valuable resource for advancing the state-of-the-art in multimodal language understanding and re",
    "link": "http://arxiv.org/abs/2307.05410",
    "context": "Title: BLUEX: A benchmark based on Brazilian Leading Universities Entrance eXams. (arXiv:2307.05410v1 [cs.CL])\nAbstract: One common trend in recent studies of language models (LMs) is the use of standardized tests for evaluation. However, despite being the fifth most spoken language worldwide, few such evaluations have been conducted in Portuguese. This is mainly due to the lack of high-quality datasets available to the community for carrying out evaluations in Portuguese. To address this gap, we introduce the Brazilian Leading Universities Entrance eXams (BLUEX), a dataset of entrance exams from the two leading universities in Brazil: UNICAMP and USP. The dataset includes annotated metadata for evaluating the performance of NLP models on a variety of subjects. Furthermore, BLUEX includes a collection of recently administered exams that are unlikely to be included in the training data of many popular LMs as of 2023. The dataset is also annotated to indicate the position of images in each question, providing a valuable resource for advancing the state-of-the-art in multimodal language understanding and re",
    "path": "papers/23/07/2307.05410.json",
    "total_tokens": 925,
    "translated_title": "BLUEX:一种基于巴西顶尖大学入学考试的基准测试",
    "translated_abstract": "最近语言模型(LMs)的研究中一个常见的趋势是使用标准化测试进行评估。然而，尽管葡萄牙语是全球第五大使用语言，但在葡萄牙语中进行这样的评估的研究很少。这主要是由于缺乏高质量的数据集可供社区进行葡萄牙语评估。为了解决这个问题，我们引入了巴西领先的大学入学考试（BLUEX），这是巴西两所顶尖大学UNICAMP和USP的入学考试数据集。该数据集包含了用于评估自然语言处理模型在各种科目上性能的带注释的元数据。此外，BLUEX还包括一系列最近进行的考试，这些考试不太可能包含在2023年之前许多流行语言模型的训练数据中。该数据集还进行了注释，以指示每个问题中图像的位置，为推动多模态语言理解和检索技术的发展提供了宝贵资源。",
    "tldr": "BLUEX是一个基于巴西顶尖大学入学考试的基准测试数据集，为评估葡萄牙语自然语言处理模型的性能提供了高质量的数据，并通过注释图像位置，促进多模态语言理解和检索技术的发展。"
}