{
    "title": "Statistical Mechanics of Learning via Reverberation in Bidirectional Associative Memories. (arXiv:2307.08365v1 [cond-mat.dis-nn])",
    "abstract": "We study bi-directional associative neural networks that, exposed to noisy examples of an extensive number of random archetypes, learn the latter (with or without the presence of a teacher) when the supplied information is enough: in this setting, learning is heteroassociative -- involving couples of patterns -and it is achieved by reverberating the information depicted from the examples through the layers of the network. By adapting Guerra's interpolation technique, we provide a full statistical mechanical picture of supervised and unsupervised learning processes (at the replica symmetric level of description) obtaining analytically phase diagrams, thresholds for learning, a picture of the ground-state in plain agreement with Monte Carlo simulations and signal-to-noise outcomes. In the large dataset limit, the Kosko storage prescription as well as its statistical mechanical picture provided by Kurchan, Peliti, and Saber in the eighties is fully recovered. Computational advantages in",
    "link": "http://arxiv.org/abs/2307.08365",
    "context": "Title: Statistical Mechanics of Learning via Reverberation in Bidirectional Associative Memories. (arXiv:2307.08365v1 [cond-mat.dis-nn])\nAbstract: We study bi-directional associative neural networks that, exposed to noisy examples of an extensive number of random archetypes, learn the latter (with or without the presence of a teacher) when the supplied information is enough: in this setting, learning is heteroassociative -- involving couples of patterns -and it is achieved by reverberating the information depicted from the examples through the layers of the network. By adapting Guerra's interpolation technique, we provide a full statistical mechanical picture of supervised and unsupervised learning processes (at the replica symmetric level of description) obtaining analytically phase diagrams, thresholds for learning, a picture of the ground-state in plain agreement with Monte Carlo simulations and signal-to-noise outcomes. In the large dataset limit, the Kosko storage prescription as well as its statistical mechanical picture provided by Kurchan, Peliti, and Saber in the eighties is fully recovered. Computational advantages in",
    "path": "papers/23/07/2307.08365.json",
    "total_tokens": 829,
    "translated_title": "通过回声在双向关联记忆中学习的统计力学",
    "translated_abstract": "我们研究了双向关联神经网络，在暴露于大量随机原型的噪声示例时，学习这些原型（有或无教师的情况下）时，当提供的信息足够时：在这种设置中，学习是异联想的 - 包括模式对 - 并通过将从示例中描绘的信息通过网络的层次进行回声实现。通过调整Guerra的插值技术，我们在复制对称的描述级别上提供了一个完整的统计力学图像，获得了解析相图、学习的阈值、与Monte Carlo模拟和信噪比结果完全一致的基态图像。在大数据集限制下，Kosko的存储规则以及Kurchan、Peliti和Saber在80年代提供的统计力学图像得到了完全恢复。计算优势在...",
    "tldr": "通过回声实现异联想学习的统计力学图像，并提供了学习阈值和基态图像的解析相图，恢复了Kosko的存储规则的结果。",
    "en_tdlr": "A statistical mechanical picture of associative learning via reverberation is provided, with analytically obtained phase diagrams, learning thresholds, and ground-state images that recover the storage rule by Kosko."
}