{
    "title": "Interactive Spatiotemporal Token Attention Network for Skeleton-based General Interactive Action Recognition. (arXiv:2307.07469v1 [cs.CV])",
    "abstract": "Recognizing interactive action plays an important role in human-robot interaction and collaboration. Previous methods use late fusion and co-attention mechanism to capture interactive relations, which have limited learning capability or inefficiency to adapt to more interacting entities. With assumption that priors of each entity are already known, they also lack evaluations on a more general setting addressing the diversity of subjects. To address these problems, we propose an Interactive Spatiotemporal Token Attention Network (ISTA-Net), which simultaneously model spatial, temporal, and interactive relations. Specifically, our network contains a tokenizer to partition Interactive Spatiotemporal Tokens (ISTs), which is a unified way to represent motions of multiple diverse entities. By extending the entity dimension, ISTs provide better interactive representations. To jointly learn along three dimensions in ISTs, multi-head self-attention blocks integrated with 3D convolutions are des",
    "link": "http://arxiv.org/abs/2307.07469",
    "context": "Title: Interactive Spatiotemporal Token Attention Network for Skeleton-based General Interactive Action Recognition. (arXiv:2307.07469v1 [cs.CV])\nAbstract: Recognizing interactive action plays an important role in human-robot interaction and collaboration. Previous methods use late fusion and co-attention mechanism to capture interactive relations, which have limited learning capability or inefficiency to adapt to more interacting entities. With assumption that priors of each entity are already known, they also lack evaluations on a more general setting addressing the diversity of subjects. To address these problems, we propose an Interactive Spatiotemporal Token Attention Network (ISTA-Net), which simultaneously model spatial, temporal, and interactive relations. Specifically, our network contains a tokenizer to partition Interactive Spatiotemporal Tokens (ISTs), which is a unified way to represent motions of multiple diverse entities. By extending the entity dimension, ISTs provide better interactive representations. To jointly learn along three dimensions in ISTs, multi-head self-attention blocks integrated with 3D convolutions are des",
    "path": "papers/23/07/2307.07469.json",
    "total_tokens": 983,
    "translated_title": "基于骨骼的交互动作识别的交互式时空注意力网络",
    "translated_abstract": "在人机交互和协作中，识别交互动作起着重要作用。先前的方法使用后期融合和共同关注机制来捕捉交互关系，但学习能力有限，或者适应更多的交互实体效率低。基于每个实体的先验已知的假设，它们也缺乏对更一般设置的评估，以应对主体的多样性。为了解决这些问题，我们提出了一个交互式时空注意力网络(ISTA-Net)，同时建模空间、时间和交互关系。具体来说，我们的网络包含一个分段器，用于分割交互式时空令牌(ISTs)，这是一种统一的表示多个不同实体动作的方式。通过扩展实体维度，ISTs提供了更好的交互表示。为了在ISTs中的三个维度上联合学习，我们使用了与3D卷积集成的多头自注意力块。",
    "tldr": "本研究提出了一个交互式时空注意力网络(ISTA-Net)，通过同时建模空间、时间和交互关系，解决了以往方法在交互动作识别中的限制和不足。我们的网络利用分段器将多个不同实体的动作划分成交互式时空令牌(ISTs)，并通过多头自注意力块和3D卷积实现了在ISTs的三个维度上的联合学习。"
}