{
    "title": "Flight Contrail Segmentation via Augmented Transfer Learning with Novel SR Loss Function in Hough Space. (arXiv:2307.12032v1 [cs.CV])",
    "abstract": "Air transport poses significant environmental challenges, particularly the contribution of flight contrails to climate change due to their potential global warming impact. Detecting contrails from satellite images has been a long-standing challenge. Traditional computer vision techniques have limitations under varying image conditions, and machine learning approaches using typical convolutional neural networks are hindered by the scarcity of hand-labeled contrail datasets and contrail-tailored learning processes. In this paper, we introduce an innovative model based on augmented transfer learning that accurately detects contrails with minimal data. We also propose a novel loss function, SR Loss, which improves contrail line detection by transforming the image space into Hough space. Our research opens new avenues for machine learning-based contrail detection in aviation research, offering solutions to the lack of large hand-labeled datasets, and significantly enhancing contrail detecti",
    "link": "http://arxiv.org/abs/2307.12032",
    "context": "Title: Flight Contrail Segmentation via Augmented Transfer Learning with Novel SR Loss Function in Hough Space. (arXiv:2307.12032v1 [cs.CV])\nAbstract: Air transport poses significant environmental challenges, particularly the contribution of flight contrails to climate change due to their potential global warming impact. Detecting contrails from satellite images has been a long-standing challenge. Traditional computer vision techniques have limitations under varying image conditions, and machine learning approaches using typical convolutional neural networks are hindered by the scarcity of hand-labeled contrail datasets and contrail-tailored learning processes. In this paper, we introduce an innovative model based on augmented transfer learning that accurately detects contrails with minimal data. We also propose a novel loss function, SR Loss, which improves contrail line detection by transforming the image space into Hough space. Our research opens new avenues for machine learning-based contrail detection in aviation research, offering solutions to the lack of large hand-labeled datasets, and significantly enhancing contrail detecti",
    "path": "papers/23/07/2307.12032.json",
    "total_tokens": 1029,
    "translated_title": "通过在霍夫空间中采用新的SR损失函数进行增强的迁移学习的飞行轨迹划分",
    "translated_abstract": "空中交通对环境产生了重大挑战，特别是飞行轨迹造成的对气候变化的贡献，由于其潜在的全球变暖影响。从卫星图像中检测飞行轨迹一直以来都是一个长期存在的难题。传统的计算机视觉技术在不同的图像条件下存在局限性，而使用典型的卷积神经网络的机器学习方法受到手工标注的飞行轨迹数据集和专门的学习过程的限制。在本文中，我们引入了一种创新的模型，基于增强的迁移学习，能够准确地检测飞行轨迹，并且数据需求较少。我们还提出了一种新的损失函数，SR Loss，通过将图像空间转换为霍夫空间来改善飞行轨迹线的检测。我们的研究为基于机器学习的航空研究中的飞行轨迹检测打开了新的途径，提供了解决大型手工标注数据集缺乏问题，并显著增强了飞行轨迹检测能力。",
    "tldr": "本论文引入创新的增强迁移学习模型，以及通过在霍夫空间中使用新的SR损失函数改善飞行轨迹线检测的方法。这些方法能够准确地检测飞行轨迹并且对数据需求较少，为基于机器学习的航空研究中的飞行轨迹检测提供了新的解决方案。",
    "en_tdlr": "This paper introduces an innovative model using augmented transfer learning and a novel SR loss function in Hough space for accurate flight contrail detection with minimal data. It opens new avenues for machine learning-based contrail detection in aviation research and offers solutions to the lack of large hand-labeled datasets."
}