{
    "title": "Rumor Detection with Diverse Counterfactual Evidence. (arXiv:2307.09296v1 [cs.AI])",
    "abstract": "The growth in social media has exacerbated the threat of fake news to individuals and communities. This draws increasing attention to developing efficient and timely rumor detection methods. The prevailing approaches resort to graph neural networks (GNNs) to exploit the post-propagation patterns of the rumor-spreading process. However, these methods lack inherent interpretation of rumor detection due to the black-box nature of GNNs. Moreover, these methods suffer from less robust results as they employ all the propagation patterns for rumor detection. In this paper, we address the above issues with the proposed Diverse Counterfactual Evidence framework for Rumor Detection (DCE-RD). Our intuition is to exploit the diverse counterfactual evidence of an event graph to serve as multi-view interpretations, which are further aggregated for robust rumor detection results. Specifically, our method first designs a subgraph generation strategy to efficiently generate different subgraphs of the e",
    "link": "http://arxiv.org/abs/2307.09296",
    "context": "Title: Rumor Detection with Diverse Counterfactual Evidence. (arXiv:2307.09296v1 [cs.AI])\nAbstract: The growth in social media has exacerbated the threat of fake news to individuals and communities. This draws increasing attention to developing efficient and timely rumor detection methods. The prevailing approaches resort to graph neural networks (GNNs) to exploit the post-propagation patterns of the rumor-spreading process. However, these methods lack inherent interpretation of rumor detection due to the black-box nature of GNNs. Moreover, these methods suffer from less robust results as they employ all the propagation patterns for rumor detection. In this paper, we address the above issues with the proposed Diverse Counterfactual Evidence framework for Rumor Detection (DCE-RD). Our intuition is to exploit the diverse counterfactual evidence of an event graph to serve as multi-view interpretations, which are further aggregated for robust rumor detection results. Specifically, our method first designs a subgraph generation strategy to efficiently generate different subgraphs of the e",
    "path": "papers/23/07/2307.09296.json",
    "total_tokens": 872,
    "translated_title": "使用多样的反事实证据进行谣言检测",
    "translated_abstract": "社交媒体的增长加剧了虚假新闻对个人和社区的威胁。这对于开发高效和及时的谣言检测方法引起了越来越多的关注。现有的方法借助图神经网络(GNNs)来利用谣言传播过程的后传播模式。然而，由于GNNs的黑箱性质，这些方法缺乏对谣言检测的固有解释性。此外，这些方法由于采用了所有传播模式，结果缺乏鲁棒性。在本文中，我们提出了一种称为DCE-RD的多样逆事实证据框架，用于谣言检测，以解决上述问题。我们的核心思想是利用事件图的多样逆事实证据作为多视角解释，进而聚合以获得鲁棒的谣言检测结果。具体而言，我们的方法首先设计了一个子图生成策略，以高效生成事件图的不同子图。",
    "tldr": "本文提出了一种称为DCE-RD的多样逆事实证据框架，用于谣言检测，通过利用事件图的多样逆事实证据作为多视角解释，进一步聚合以获得鲁棒的谣言检测结果。"
}