{
    "title": "Few-shot Image Classification based on Gradual Machine Learning. (arXiv:2307.15524v1 [cs.CV])",
    "abstract": "Few-shot image classification aims to accurately classify unlabeled images using only a few labeled samples. The state-of-the-art solutions are built by deep learning, which focuses on designing increasingly complex deep backbones. Unfortunately, the task remains very challenging due to the difficulty of transferring the knowledge learned in training classes to new ones. In this paper, we propose a novel approach based on the non-i.i.d paradigm of gradual machine learning (GML). It begins with only a few labeled observations, and then gradually labels target images in the increasing order of hardness by iterative factor inference in a factor graph. Specifically, our proposed solution extracts indicative feature representations by deep backbones, and then constructs both unary and binary factors based on the extracted features to facilitate gradual learning. The unary factors are constructed based on class center distance in an embedding space, while the binary factors are constructed b",
    "link": "http://arxiv.org/abs/2307.15524",
    "context": "Title: Few-shot Image Classification based on Gradual Machine Learning. (arXiv:2307.15524v1 [cs.CV])\nAbstract: Few-shot image classification aims to accurately classify unlabeled images using only a few labeled samples. The state-of-the-art solutions are built by deep learning, which focuses on designing increasingly complex deep backbones. Unfortunately, the task remains very challenging due to the difficulty of transferring the knowledge learned in training classes to new ones. In this paper, we propose a novel approach based on the non-i.i.d paradigm of gradual machine learning (GML). It begins with only a few labeled observations, and then gradually labels target images in the increasing order of hardness by iterative factor inference in a factor graph. Specifically, our proposed solution extracts indicative feature representations by deep backbones, and then constructs both unary and binary factors based on the extracted features to facilitate gradual learning. The unary factors are constructed based on class center distance in an embedding space, while the binary factors are constructed b",
    "path": "papers/23/07/2307.15524.json",
    "total_tokens": 889,
    "translated_title": "基于渐进机器学习的小样本图像分类",
    "translated_abstract": "小样本图像分类旨在仅使用少量有标签样本准确地对未标记图像进行分类。现有的解决方案基于深度学习，主要关注设计越来越复杂的深度主干网络。然而，由于在训练类别中学到的知识难以迁移到新类别，该任务仍然非常具有挑战性。本文提出了一种基于逐渐机器学习（GML）非i.i.d范式的新方法。它从仅有少量有标签观测开始，然后逐渐按照难度增加的顺序通过迭代因子图中的因子推理来标记目标图像。具体而言，我们的解决方案通过深度主干网络提取具有指示性的特征表示，然后基于提取的特征构建一元因子和二元因子以促进渐进学习。一元因子基于嵌入空间中的类别中心距离构建，而二元因子基于...",
    "tldr": "该论文提出了一种基于逐渐机器学习的新方法来解决小样本图像分类问题。通过逐步标记目标图像，并利用深度主干网络提取的特征构建因子，该方法能够有效地处理知识迁移和分类挑战。"
}