{
    "title": "Power to the teens? A model of parents' and teens' collective labor supply. (arXiv:2307.09634v1 [econ.GN])",
    "abstract": "Teens make life-changing decisions while constrained by the needs and resources of the households they grow up in. Household behavior models frequently delegate decision-making to the teen or their parents, ignoring joint decision-making in the household. I show that teens and parents allocate time and income jointly by using data from the Costa Rican Encuesta Nacional de Hogares from 2011 to 2019 and a conditional cash transfer program. First, I present gender differences in household responses to the transfer using a marginal treatment effect framework. Second, I explain how the gender gap from the results is due to the bargaining process between parents and teens. I propose a collective household model and show that sons bargain cooperatively with their parents while daughters do not. This result implies that sons have a higher opportunity cost of attending school than daughters. Public policy targeting teens must account for this gender disparity to be effective.",
    "link": "http://arxiv.org/abs/2307.09634",
    "context": "Title: Power to the teens? A model of parents' and teens' collective labor supply. (arXiv:2307.09634v1 [econ.GN])\nAbstract: Teens make life-changing decisions while constrained by the needs and resources of the households they grow up in. Household behavior models frequently delegate decision-making to the teen or their parents, ignoring joint decision-making in the household. I show that teens and parents allocate time and income jointly by using data from the Costa Rican Encuesta Nacional de Hogares from 2011 to 2019 and a conditional cash transfer program. First, I present gender differences in household responses to the transfer using a marginal treatment effect framework. Second, I explain how the gender gap from the results is due to the bargaining process between parents and teens. I propose a collective household model and show that sons bargain cooperatively with their parents while daughters do not. This result implies that sons have a higher opportunity cost of attending school than daughters. Public policy targeting teens must account for this gender disparity to be effective.",
    "path": "papers/23/07/2307.09634.json",
    "total_tokens": 991,
    "translated_title": "青少年权力? 父母和青少年的共同劳动力供应模型",
    "translated_abstract": "青少年在成长环境中的需求和资源的限制下做出了改变一生的决策。家庭行为模型通常将决策权委托给青少年或他们的父母，忽略了家庭中的共同决策过程。本研究利用2011年至2019年的哥斯达黎加Encuesta Nacional de Hogares的数据和有条件的现金转移计划，展示了青少年和父母如何共同分配时间和收入。首先，通过边际处理效应框架，展示了家庭对转移的性别差异响应。其次，解释了结果中的性别差距是由父母和青少年之间的讨价还价过程导致的。研究提出了一个集体家庭模型，并显示儿子与父母合作讨价的，而女儿却不是。这一结果意味着儿子上学的机会成本比女儿高。针对青少年的公共政策必须考虑到这种性别差距才能有效果。",
    "tldr": "本研究探讨了青少年和父母在家庭决策过程中的共同作用，发现了父母和青少年之间的讨价还价过程导致了性别差距，并提出了一个集体家庭模型。这一结果表明，儿子参加学校的机会成本比女儿更高，公共政策必须考虑到这种性别差距。"
}