{
    "title": "Global Precipitation Nowcasting of Integrated Multi-satellitE Retrievals for GPM: A U-Net Convolutional LSTM Architecture. (arXiv:2307.10843v1 [cs.LG])",
    "abstract": "This paper presents a deep learning architecture for nowcasting of precipitation almost globally every 30 min with a 4-hour lead time. The architecture fuses a U-Net and a convolutional long short-term memory (LSTM) neural network and is trained using data from the Integrated MultisatellitE Retrievals for GPM (IMERG) and a few key precipitation drivers from the Global Forecast System (GFS). The impacts of different training loss functions, including the mean-squared error (regression) and the focal-loss (classification), on the quality of precipitation nowcasts are studied. The results indicate that the regression network performs well in capturing light precipitation (below 1.6 mm/hr), but the classification network can outperform the regression network for nowcasting of precipitation extremes (>8 mm/hr), in terms of the critical success index (CSI).. Using the Wasserstein distance, it is shown that the predicted precipitation by the classification network has a closer class probabili",
    "link": "http://arxiv.org/abs/2307.10843",
    "context": "Title: Global Precipitation Nowcasting of Integrated Multi-satellitE Retrievals for GPM: A U-Net Convolutional LSTM Architecture. (arXiv:2307.10843v1 [cs.LG])\nAbstract: This paper presents a deep learning architecture for nowcasting of precipitation almost globally every 30 min with a 4-hour lead time. The architecture fuses a U-Net and a convolutional long short-term memory (LSTM) neural network and is trained using data from the Integrated MultisatellitE Retrievals for GPM (IMERG) and a few key precipitation drivers from the Global Forecast System (GFS). The impacts of different training loss functions, including the mean-squared error (regression) and the focal-loss (classification), on the quality of precipitation nowcasts are studied. The results indicate that the regression network performs well in capturing light precipitation (below 1.6 mm/hr), but the classification network can outperform the regression network for nowcasting of precipitation extremes (>8 mm/hr), in terms of the critical success index (CSI).. Using the Wasserstein distance, it is shown that the predicted precipitation by the classification network has a closer class probabili",
    "path": "papers/23/07/2307.10843.json",
    "total_tokens": 904,
    "translated_title": "全球降水即时预测：基于GPM的集成多卫星检索的U-Net卷积LSTM架构",
    "translated_abstract": "本文提出了一种深度学习架构，用于每30分钟全球近4小时的降水即时预测。该架构融合了U-Net和卷积长短期记忆(LSTM)神经网络，并使用来自集成多卫星检索(GPM)和全球预测系统(GFS)的关键降水驱动数据进行训练。研究了不同训练损失函数（包括均方差回归和聚焦损失分类）对降水现在预测质量的影响。结果表明，回归网络在捕捉轻度降水（小于1.6 mm/hr）方面表现良好，但分类网络在极端降水（大于8 mm/hr）的预测方面，以关键成功指数(CSI)衡量，可以胜过回归网络。使用Wasserstein距离表明，分类网络预测的降水具有更接近的类别概率。",
    "tldr": "本文提出了一种基于U-Net和卷积LSTM的深度学习架构，能够准确预测全球降水的即时情况，尤其在极端降水方面的预测准确率更高。",
    "en_tdlr": "This paper presents a deep learning architecture based on U-Net and convolutional LSTM that accurately predicts global precipitation in real-time, with a higher accuracy in predicting extreme precipitation."
}