{
    "title": "Hidden Markov Models with Random Restarts vs Boosting for Malware Detection. (arXiv:2307.10256v1 [cs.CR])",
    "abstract": "Effective and efficient malware detection is at the forefront of research into building secure digital systems. As with many other fields, malware detection research has seen a dramatic increase in the application of machine learning algorithms. One machine learning technique that has been used widely in the field of pattern matching in general-and malware detection in particular-is hidden Markov models (HMMs). HMM training is based on a hill climb, and hence we can often improve a model by training multiple times with different initial values. In this research, we compare boosted HMMs (using AdaBoost) to HMMs trained with multiple random restarts, in the context of malware detection. These techniques are applied to a variety of challenging malware datasets. We find that random restarts perform surprisingly well in comparison to boosting. Only in the most difficult \"cold start\" cases (where training data is severely limited) does boosting appear to offer sufficient improvement to justi",
    "link": "http://arxiv.org/abs/2307.10256",
    "context": "Title: Hidden Markov Models with Random Restarts vs Boosting for Malware Detection. (arXiv:2307.10256v1 [cs.CR])\nAbstract: Effective and efficient malware detection is at the forefront of research into building secure digital systems. As with many other fields, malware detection research has seen a dramatic increase in the application of machine learning algorithms. One machine learning technique that has been used widely in the field of pattern matching in general-and malware detection in particular-is hidden Markov models (HMMs). HMM training is based on a hill climb, and hence we can often improve a model by training multiple times with different initial values. In this research, we compare boosted HMMs (using AdaBoost) to HMMs trained with multiple random restarts, in the context of malware detection. These techniques are applied to a variety of challenging malware datasets. We find that random restarts perform surprisingly well in comparison to boosting. Only in the most difficult \"cold start\" cases (where training data is severely limited) does boosting appear to offer sufficient improvement to justi",
    "path": "papers/23/07/2307.10256.json",
    "total_tokens": 998,
    "translated_title": "随机重启隐藏马尔可夫模型与Boosting在恶意软件检测中的比较",
    "translated_abstract": "有效和高效的恶意软件检测是构建安全数字系统的研究前沿。与许多其他领域一样，恶意软件检测研究在应用机器学习算法方面有了显著增长。在模式匹配和恶意软件检测领域中，一种被广泛使用的机器学习技术是隐藏马尔可夫模型（HMMs）。HMM的训练基于爬山算法，因此我们通常可以通过多次使用不同的初始值进行训练来改善模型。在本研究中，我们在恶意软件检测的背景下，比较了使用AdaBoost进行增强的HMM与使用多次随机重启训练的HMM。这些技术被应用于各种具有挑战性的恶意软件数据集。我们发现，在与增强相比下，随机重启表现出令人惊讶的好。只有在最困难的“冷启动”情况下（训练数据严重有限），增强似乎提供足够的改进来使其有正当的价值。",
    "tldr": "本研究比较了在恶意软件检测中使用AdaBoost增强的HMM和使用多次随机重启训练的HMM，并发现随机重启对于大部分情况表现出令人惊喜的效果。只有在训练数据严重有限的最困难的情况下，增强才提供了足够的改进。",
    "en_tdlr": "This research compares boosted HMMs using AdaBoost and HMMs trained with multiple random restarts in malware detection, and finds that random restarts perform surprisingly well in most cases. Only in the most difficult situations with severely limited training data does boosting offer significant improvements."
}