{
    "title": "Company2Vec -- German Company Embeddings based on Corporate Websites. (arXiv:2307.09332v1 [cs.AI])",
    "abstract": "With Company2Vec, the paper proposes a novel application in representation learning. The model analyzes business activities from unstructured company website data using Word2Vec and dimensionality reduction. Company2Vec maintains semantic language structures and thus creates efficient company embeddings in fine-granular industries. These semantic embeddings can be used for various applications in banking. Direct relations between companies and words allow semantic business analytics (e.g. top-n words for a company). Furthermore, industry prediction is presented as a supervised learning application and evaluation method. The vectorized structure of the embeddings allows measuring companies similarities with the cosine distance. Company2Vec hence offers a more fine-grained comparison of companies than the standard industry labels (NACE). This property is relevant for unsupervised learning tasks, such as clustering. An alternative industry segmentation is shown with k-means clustering on ",
    "link": "http://arxiv.org/abs/2307.09332",
    "context": "Title: Company2Vec -- German Company Embeddings based on Corporate Websites. (arXiv:2307.09332v1 [cs.AI])\nAbstract: With Company2Vec, the paper proposes a novel application in representation learning. The model analyzes business activities from unstructured company website data using Word2Vec and dimensionality reduction. Company2Vec maintains semantic language structures and thus creates efficient company embeddings in fine-granular industries. These semantic embeddings can be used for various applications in banking. Direct relations between companies and words allow semantic business analytics (e.g. top-n words for a company). Furthermore, industry prediction is presented as a supervised learning application and evaluation method. The vectorized structure of the embeddings allows measuring companies similarities with the cosine distance. Company2Vec hence offers a more fine-grained comparison of companies than the standard industry labels (NACE). This property is relevant for unsupervised learning tasks, such as clustering. An alternative industry segmentation is shown with k-means clustering on ",
    "path": "papers/23/07/2307.09332.json",
    "total_tokens": 871,
    "translated_title": "基于企业网站的德国企业嵌入Company2Vec",
    "translated_abstract": "本论文提出了一种新颖的表示学习应用，即Company2Vec。该模型利用Word2Vec和降维技术从非结构化的企业网站数据中分析企业活动。Company2Vec保持语义语言结构，从而在细粒度行业中创建高效的企业嵌入。这些语义嵌入可以在银行业的各种应用中使用。公司和单词之间的直接关系可以进行语义商业分析（例如某公司的前n个单词）。此外，还提出了一种监督学习应用和评估方法，即行业预测。嵌入的向量结构可以通过余弦距离来测量公司之间的相似性。因此，与标准行业标签（NACE）相比，Company2Vec可以更精细地比较公司。这一特性对于无监督学习任务（如聚类）是相关的。还展示了基于k-means聚类的替代行业细分。",
    "tldr": "Company2Vec是一种基于企业网站数据的表示学习模型，通过分析企业活动并保持语义结构，生成细粒度的企业嵌入。这些嵌入可以用于语义商业分析、行业预测和无监督学习任务。",
    "en_tdlr": "Company2Vec is a representation learning model based on corporate website data that generates fine-grained company embeddings by analyzing business activities and preserving semantic structures. These embeddings can be used for semantic business analytics, industry prediction, and unsupervised learning tasks."
}