{
    "title": "The Effect of Balancing Methods on Model Behavior in Imbalanced Classification Problems. (arXiv:2307.00157v1 [cs.LG])",
    "abstract": "Imbalanced data poses a significant challenge in classification as model performance is affected by insufficient learning from minority classes. Balancing methods are often used to address this problem. However, such techniques can lead to problems such as overfitting or loss of information. This study addresses a more challenging aspect of balancing methods - their impact on model behavior. To capture these changes, Explainable Artificial Intelligence tools are used to compare models trained on datasets before and after balancing. In addition to the variable importance method, this study uses the partial dependence profile and accumulated local effects techniques. Real and simulated datasets are tested, and an open-source Python package edgaro is developed to facilitate this analysis. The results obtained show significant changes in model behavior due to balancing methods, which can lead to biased models toward a balanced distribution. These findings confirm that balancing analysis sh",
    "link": "http://arxiv.org/abs/2307.00157",
    "context": "Title: The Effect of Balancing Methods on Model Behavior in Imbalanced Classification Problems. (arXiv:2307.00157v1 [cs.LG])\nAbstract: Imbalanced data poses a significant challenge in classification as model performance is affected by insufficient learning from minority classes. Balancing methods are often used to address this problem. However, such techniques can lead to problems such as overfitting or loss of information. This study addresses a more challenging aspect of balancing methods - their impact on model behavior. To capture these changes, Explainable Artificial Intelligence tools are used to compare models trained on datasets before and after balancing. In addition to the variable importance method, this study uses the partial dependence profile and accumulated local effects techniques. Real and simulated datasets are tested, and an open-source Python package edgaro is developed to facilitate this analysis. The results obtained show significant changes in model behavior due to balancing methods, which can lead to biased models toward a balanced distribution. These findings confirm that balancing analysis sh",
    "path": "papers/23/07/2307.00157.json",
    "total_tokens": 857,
    "translated_title": "平衡方法对不平衡分类问题中模型行为的影响",
    "translated_abstract": "不平衡数据对分类问题构成了重要的挑战，因为模型性能受到对少数类别学习不足的影响。平衡方法通常被用来解决这个问题。然而，这些技术可能会导致过拟合或者信息丢失等问题。本研究探讨了平衡方法更具挑战性的方面——它们对模型行为的影响。为了捕捉这些变化，本研究使用了可解释人工智能工具来比较在平衡前后训练的模型。除了变量重要性方法外，本研究还使用了部分依赖轮廓和累积局部影响技术。进行了真实和模拟数据集的测试，并开发了一个开源Python包edgaro来方便进行这种分析。所得到的结果显示，由于平衡方法的影响，模型行为发生了显著变化，可能会使模型对平衡分布产生偏见。这些发现证实了平衡分析对模型行为有重要影响。",
    "tldr": "平衡方法对不平衡分类问题中模型行为产生显著影响。这些发现强调了平衡分析在模型训练中的重要性。",
    "en_tdlr": "Balancing methods have a significant impact on model behavior in imbalanced classification problems. These findings emphasize the importance of balancing analysis in model training."
}