{
    "title": "Knowledge-Aware Audio-Grounded Generative Slot Filling for Limited Annotated Data. (arXiv:2307.01764v1 [cs.CL])",
    "abstract": "Manually annotating fine-grained slot-value labels for task-oriented dialogue (ToD) systems is an expensive and time-consuming endeavour. This motivates research into slot-filling methods that operate with limited amounts of labelled data. Moreover, the majority of current work on ToD is based solely on text as the input modality, neglecting the additional challenges of imperfect automatic speech recognition (ASR) when working with spoken language. In this work, we propose a Knowledge-Aware Audio-Grounded generative slot-filling framework, termed KA2G, that focuses on few-shot and zero-shot slot filling for ToD with speech input. KA2G achieves robust and data-efficient slot filling for speech-based ToD by 1) framing it as a text generation task, 2) grounding text generation additionally in the audio modality, and 3) conditioning on available external knowledge (e.g. a predefined list of possible slot values). We show that combining both modalities within the KA2G framework improves the",
    "link": "http://arxiv.org/abs/2307.01764",
    "context": "Title: Knowledge-Aware Audio-Grounded Generative Slot Filling for Limited Annotated Data. (arXiv:2307.01764v1 [cs.CL])\nAbstract: Manually annotating fine-grained slot-value labels for task-oriented dialogue (ToD) systems is an expensive and time-consuming endeavour. This motivates research into slot-filling methods that operate with limited amounts of labelled data. Moreover, the majority of current work on ToD is based solely on text as the input modality, neglecting the additional challenges of imperfect automatic speech recognition (ASR) when working with spoken language. In this work, we propose a Knowledge-Aware Audio-Grounded generative slot-filling framework, termed KA2G, that focuses on few-shot and zero-shot slot filling for ToD with speech input. KA2G achieves robust and data-efficient slot filling for speech-based ToD by 1) framing it as a text generation task, 2) grounding text generation additionally in the audio modality, and 3) conditioning on available external knowledge (e.g. a predefined list of possible slot values). We show that combining both modalities within the KA2G framework improves the",
    "path": "papers/23/07/2307.01764.json",
    "total_tokens": 986,
    "translated_title": "有限已标注数据下基于知识感知的音频引导生成式插槽填充方法",
    "translated_abstract": "为任务导向对话系统手动注释细粒度插槽-值标签是一项昂贵且耗时的工作。这促使研究仅使用有限标注数据进行插槽填充的方法。此外，当前关于任务导向对话系统的大部分研究仅基于文本作为输入形式，忽视了在处理口语时的不完美自动语音识别（ASR）所带来的额外挑战。在本研究中，我们提出了一种名为KA2G的基于知识感知的音频引导生成式插槽填充框架，专注于有语音输入的少样本和零样本插槽填充。KA2G通过以下方式实现了语音导向任务导向对话系统的稳健和数据高效的插槽填充：1）将其构造为文本生成任务，2）在文本生成中额外使用音频形式，3）在外部可用的知识条件下（例如，预定义的可能插槽值列表）。我们证明在KA2G框架内结合两种形式可以改善插槽填充效果。",
    "tldr": "在有限的标注数据下，我们提出了一种基于知识感知的音频引导生成式插槽填充方法，KA2G，它通过将文本生成任务与音频形式相结合，并依赖于外部知识来实现对语音导向对话系统的稳健和数据高效的插槽填充。"
}