{
    "title": "Enhancing Network Slicing Architectures with Machine Learning, Security, Sustainability and Experimental Networks Integration. (arXiv:2307.09151v1 [cs.NI])",
    "abstract": "Network Slicing (NS) is an essential technique extensively used in 5G networks computing strategies, mobile edge computing, mobile cloud computing, and verticals like the Internet of Vehicles and industrial IoT, among others. NS is foreseen as one of the leading enablers for 6G futuristic and highly demanding applications since it allows the optimization and customization of scarce and disputed resources among dynamic, demanding clients with highly distinct application requirements. Various standardization organizations, like 3GPP's proposal for new generation networks and state-of-the-art 5G/6G research projects, are proposing new NS architectures. However, new NS architectures have to deal with an extensive range of requirements that inherently result in having NS architecture proposals typically fulfilling the needs of specific sets of domains with commonalities. The Slicing Future Internet Infrastructures (SFI2) architecture proposal explores the gap resulting from the diversity of",
    "link": "http://arxiv.org/abs/2307.09151",
    "context": "Title: Enhancing Network Slicing Architectures with Machine Learning, Security, Sustainability and Experimental Networks Integration. (arXiv:2307.09151v1 [cs.NI])\nAbstract: Network Slicing (NS) is an essential technique extensively used in 5G networks computing strategies, mobile edge computing, mobile cloud computing, and verticals like the Internet of Vehicles and industrial IoT, among others. NS is foreseen as one of the leading enablers for 6G futuristic and highly demanding applications since it allows the optimization and customization of scarce and disputed resources among dynamic, demanding clients with highly distinct application requirements. Various standardization organizations, like 3GPP's proposal for new generation networks and state-of-the-art 5G/6G research projects, are proposing new NS architectures. However, new NS architectures have to deal with an extensive range of requirements that inherently result in having NS architecture proposals typically fulfilling the needs of specific sets of domains with commonalities. The Slicing Future Internet Infrastructures (SFI2) architecture proposal explores the gap resulting from the diversity of",
    "path": "papers/23/07/2307.09151.json",
    "total_tokens": 883,
    "translated_title": "通过机器学习，安全性，可持续性和实验网络集成增强网络切片架构",
    "translated_abstract": "网络切片是一种在5G网络计算策略，移动边缘计算，移动云计算以及物联网车辆互联网和工业物联网等领域广泛使用的关键技术。网络切片被视为6G未来和高度需要的应用的主要支持者之一，因为它可以优化和定制动态、需求高、具有高度不同应用需求的客户之间争夺的有限资源。各种标准化组织，如3GPP的新一代网络提案和最新的5G/6G研究项目，正在提出新的网络切片架构。然而，新的网络切片架构必须处理广泛的需求范围，这导致了通常只满足具有共性域集合需求的网络切片架构提议。切片未来互联网基础设施(SFI2)架构提议探讨了由多样性导致的差距。",
    "tldr": "本论文介绍了通过机器学习、安全性、可持续性和实验网络集成来增强网络切片架构，在满足不同领域需求的同时，推进6G高度需求的应用。",
    "en_tdlr": "This paper presents the enhancement of network slicing architectures through the integration of machine learning, security, sustainability, and experimental networks, aiming to advance 6G applications while meeting the needs of diverse domains."
}