{
    "title": "Graph Embedded Intuitionistic Fuzzy RVFL for Class Imbalance Learning. (arXiv:2307.07881v1 [cs.LG])",
    "abstract": "The domain of machine learning is confronted with a crucial research area known as class imbalance learning, which presents considerable hurdles in the precise classification of minority classes. This issue can result in biased models where the majority class takes precedence in the training process, leading to the underrepresentation of the minority class. The random vector functional link (RVFL) network is a widely-used and effective learning model for classification due to its speed and efficiency. However, it suffers from low accuracy when dealing with imbalanced datasets. To overcome this limitation, we propose a novel graph embedded intuitionistic fuzzy RVFL for class imbalance learning (GE-IFRVFL-CIL) model incorporating a weighting mechanism to handle imbalanced datasets. The proposed GE-IFRVFL-CIL model has a plethora of benefits, such as $(i)$ it leverages graph embedding to extract semantically rich information from the dataset, $(ii)$ it uses intuitionistic fuzzy sets to ha",
    "link": "http://arxiv.org/abs/2307.07881",
    "context": "Title: Graph Embedded Intuitionistic Fuzzy RVFL for Class Imbalance Learning. (arXiv:2307.07881v1 [cs.LG])\nAbstract: The domain of machine learning is confronted with a crucial research area known as class imbalance learning, which presents considerable hurdles in the precise classification of minority classes. This issue can result in biased models where the majority class takes precedence in the training process, leading to the underrepresentation of the minority class. The random vector functional link (RVFL) network is a widely-used and effective learning model for classification due to its speed and efficiency. However, it suffers from low accuracy when dealing with imbalanced datasets. To overcome this limitation, we propose a novel graph embedded intuitionistic fuzzy RVFL for class imbalance learning (GE-IFRVFL-CIL) model incorporating a weighting mechanism to handle imbalanced datasets. The proposed GE-IFRVFL-CIL model has a plethora of benefits, such as $(i)$ it leverages graph embedding to extract semantically rich information from the dataset, $(ii)$ it uses intuitionistic fuzzy sets to ha",
    "path": "papers/23/07/2307.07881.json",
    "total_tokens": 966,
    "translated_title": "嵌入图的直觉模糊RVFL用于类别不平衡学习",
    "translated_abstract": "机器学习领域面临一个关键的研究领域，即类别不平衡学习，在对少数类别进行准确分类方面存在很大的困难。这个问题可能导致偏向于多数类别的模型在训练过程中优先考虑，从而导致少数类别的代表不足。随机向量函数链接（RVFL）网络是一种广泛使用且有效的分类学习模型，因其速度和效率高而受到广泛应用。然而，当处理不平衡的数据集时，它的准确性较低。为了克服这个局限性，我们提出了一种新颖的嵌入图的直觉模糊RVFL用于类别不平衡学习（GE-IFRVFL-CIL）模型，该模型采用加权机制来处理不平衡的数据集。所提出的GE-IFRVFL-CIL模型具有许多优点，例如：（i）它利用图嵌入从数据集中提取语义丰富的信息，（ii）它使用直觉模糊集来进行类别不平衡学习。",
    "tldr": "提出了一种嵌入图的直觉模糊RVFL模型，用于解决类别不平衡学习的问题。该模型通过采用加权机制处理不平衡的数据集，并利用图嵌入提取语义丰富的信息。该模型在类别不平衡学习中具有较高的准确性。",
    "en_tdlr": "A novel graph embedded intuitionistic fuzzy RVFL model is proposed to address the issue of class imbalance learning. The model handles imbalanced datasets using a weighting mechanism and extracts semantically rich information using graph embedding. It achieves high accuracy in class imbalance learning."
}