{
    "title": "EVIL: Evidential Inference Learning for Trustworthy Semi-supervised Medical Image Segmentation. (arXiv:2307.08988v1 [cs.CV])",
    "abstract": "Recently, uncertainty-aware methods have attracted increasing attention in semi-supervised medical image segmentation. However, current methods usually suffer from the drawback that it is difficult to balance the computational cost, estimation accuracy, and theoretical support in a unified framework. To alleviate this problem, we introduce the Dempster-Shafer Theory of Evidence (DST) into semi-supervised medical image segmentation, dubbed Evidential Inference Learning (EVIL). EVIL provides a theoretically guaranteed solution to infer accurate uncertainty quantification in a single forward pass. Trustworthy pseudo labels on unlabeled data are generated after uncertainty estimation. The recently proposed consistency regularization-based training paradigm is adopted in our framework, which enforces the consistency on the perturbed predictions to enhance the generalization with few labeled data. Experimental results show that EVIL achieves competitive performance in comparison with several",
    "link": "http://arxiv.org/abs/2307.08988",
    "context": "Title: EVIL: Evidential Inference Learning for Trustworthy Semi-supervised Medical Image Segmentation. (arXiv:2307.08988v1 [cs.CV])\nAbstract: Recently, uncertainty-aware methods have attracted increasing attention in semi-supervised medical image segmentation. However, current methods usually suffer from the drawback that it is difficult to balance the computational cost, estimation accuracy, and theoretical support in a unified framework. To alleviate this problem, we introduce the Dempster-Shafer Theory of Evidence (DST) into semi-supervised medical image segmentation, dubbed Evidential Inference Learning (EVIL). EVIL provides a theoretically guaranteed solution to infer accurate uncertainty quantification in a single forward pass. Trustworthy pseudo labels on unlabeled data are generated after uncertainty estimation. The recently proposed consistency regularization-based training paradigm is adopted in our framework, which enforces the consistency on the perturbed predictions to enhance the generalization with few labeled data. Experimental results show that EVIL achieves competitive performance in comparison with several",
    "path": "papers/23/07/2307.08988.json",
    "total_tokens": 868,
    "translated_title": "EVIL: 用于可信半监督医学图像分割的证据推理学习",
    "translated_abstract": "最近，针对半监督医学图像分割，基于不确定性的方法引起了越来越多的关注。然而，目前的方法通常存在一个难以在统一框架中平衡计算成本、估计精度和理论支持的缺点。为了缓解这个问题，我们将证据理论引入半监督医学图像分割中，称之为证据推理学习（EVIL）。EVIL在单次前向传递中提供了一个在理论上保证的解决方案，用于推断准确的不确定性量化。在不确定性估计后，根据未标记数据生成可信的伪标签。我们的框架采用了最近提出的一致性正则化训练范式，通过强制对扰动预测进行一致性约束来增强少量标记数据的泛化能力。实验结果表明，EVIL在与几种方法的比较中取得了竞争性能。",
    "tldr": "EVIL是一种用于半监督医学图像分割的方法，通过引入证据推理学习，可以在单次前向传递中推断准确的不确定性量化，生成可信的伪标签，并取得竞争性能。"
}