{
    "title": "An Analysis of Dialogue Repair in Virtual Voice Assistants. (arXiv:2307.07076v1 [cs.HC])",
    "abstract": "Language speakers often use what are known as repair initiators to mend fundamental disconnects that occur between them during verbal communication. Previous research in this field has mainly focused on the human-to-human use of repair initiator. We proposed an examination of dialogue repair structure wherein the dialogue initiator is human and the party that initiates or responds to the repair is a virtual assistant. This study examined the use of repair initiators in both English and Spanish with two popular assistants, Google Assistant and Apple's Siri. Our aim was to codify the differences, if any, in responses by voice assistants to dialogues in need of repair as compared to human-human dialogues also in need of repair. Ultimately the data demonstrated that not only were there differences between human-assistant and human-human dialogue repair strategies, but that there were likewise differences among the assistants and the languages studied.",
    "link": "http://arxiv.org/abs/2307.07076",
    "context": "Title: An Analysis of Dialogue Repair in Virtual Voice Assistants. (arXiv:2307.07076v1 [cs.HC])\nAbstract: Language speakers often use what are known as repair initiators to mend fundamental disconnects that occur between them during verbal communication. Previous research in this field has mainly focused on the human-to-human use of repair initiator. We proposed an examination of dialogue repair structure wherein the dialogue initiator is human and the party that initiates or responds to the repair is a virtual assistant. This study examined the use of repair initiators in both English and Spanish with two popular assistants, Google Assistant and Apple's Siri. Our aim was to codify the differences, if any, in responses by voice assistants to dialogues in need of repair as compared to human-human dialogues also in need of repair. Ultimately the data demonstrated that not only were there differences between human-assistant and human-human dialogue repair strategies, but that there were likewise differences among the assistants and the languages studied.",
    "path": "papers/23/07/2307.07076.json",
    "total_tokens": 768,
    "translated_title": "虚拟语音助手中的对话修复分析",
    "translated_abstract": "语言使用者通常使用修复启动器来修复他们在口头交流过程中发生的基本断开。以前的研究主要集中在人对人使用修复启动器的领域。我们提出了一种对话修复结构的研究，其中对话启动器是人类，发起或响应修复的一方是虚拟助手。本研究使用两种流行的助手，Google Assistant和Apple的Siri，检查了英语和西班牙语中的修复启动器的使用情况。我们的目标是比较语音助手对需要修复的对话和人对人对话的回应之间的差异，最终的数据表明，不仅在人助手和人对人对话修复策略之间存在差异，而且在助手和所研究的语言之间也存在差异。",
    "tldr": "该研究分析了虚拟语音助手中对话修复的特点，指出了人助手和人对人对话修复策略的差异，以及不同语言和助手之间的差异。"
}