{
    "title": "Steel Surface Roughness Parameter Calculations Using Lasers and Machine Learning Models. (arXiv:2307.03723v1 [cs.LG])",
    "abstract": "Control of surface texture in strip steel is essential to meet customer requirements during galvanizing and temper rolling processes. Traditional methods rely on post-production stylus measurements, while on-line techniques offer non-contact and real-time measurements of the entire strip. However, ensuring accurate measurement is imperative for their effective utilization in the manufacturing pipeline. Moreover, accurate on-line measurements enable real-time adjustments of manufacturing processing parameters during production, ensuring consistent quality and the possibility of closed-loop control of the temper mill. In this study, we leverage state-of-the-art machine learning models to enhance the transformation of on-line measurements into significantly a more accurate Ra surface roughness metric. By comparing a selection of data-driven approaches, including both deep learning and non-deep learning methods, to the close-form transformation, we evaluate their potential for improving su",
    "link": "http://arxiv.org/abs/2307.03723",
    "context": "Title: Steel Surface Roughness Parameter Calculations Using Lasers and Machine Learning Models. (arXiv:2307.03723v1 [cs.LG])\nAbstract: Control of surface texture in strip steel is essential to meet customer requirements during galvanizing and temper rolling processes. Traditional methods rely on post-production stylus measurements, while on-line techniques offer non-contact and real-time measurements of the entire strip. However, ensuring accurate measurement is imperative for their effective utilization in the manufacturing pipeline. Moreover, accurate on-line measurements enable real-time adjustments of manufacturing processing parameters during production, ensuring consistent quality and the possibility of closed-loop control of the temper mill. In this study, we leverage state-of-the-art machine learning models to enhance the transformation of on-line measurements into significantly a more accurate Ra surface roughness metric. By comparing a selection of data-driven approaches, including both deep learning and non-deep learning methods, to the close-form transformation, we evaluate their potential for improving su",
    "path": "papers/23/07/2307.03723.json",
    "total_tokens": 838,
    "translated_title": "使用激光和机器学习模型进行钢铁表面粗糙度参数计算",
    "translated_abstract": "控制带钢表面纹理对于满足镀锌和轧制工艺中客户要求至关重要。传统方法依赖于生产后的测针测量，而在线技术则提供了对整个带钢进行非接触和实时测量的能力。然而，确保准确测量对于其在制造流程中的有效利用至关重要。此外，准确的在线测量使得在生产过程中能够实时调整制造加工参数，确保产品质量的一致性和轧机的闭环控制的可能性。本研究利用最先进的机器学习模型改进在线测量转化为更准确的Ra表面粗糙度指标。通过比较包括深度学习和非深度学习方法在内的一系列数据驱动方法与闭合形式转化，我们评估了它们提高表面粗糙度参数计算的潜力。",
    "tldr": "本研究利用机器学习模型提高了钢铁表面粗糙度参数的计算准确性，通过对比不同方法，评估了在线测量转化的潜力。",
    "en_tdlr": "This study leverages machine learning models to enhance the accuracy of calculating steel surface roughness parameters, evaluating the potential of online measurement transformation by comparing different methods."
}