{
    "title": "Compact Twice Fusion Network for Edge Detection. (arXiv:2307.04952v1 [cs.CV])",
    "abstract": "The significance of multi-scale features has been gradually recognized by the edge detection community. However, the fusion of multi-scale features increases the complexity of the model, which is not friendly to practical application. In this work, we propose a Compact Twice Fusion Network (CTFN) to fully integrate multi-scale features while maintaining the compactness of the model. CTFN includes two lightweight multi-scale feature fusion modules: a Semantic Enhancement Module (SEM) that can utilize the semantic information contained in coarse-scale features to guide the learning of fine-scale features, and a Pseudo Pixel-level Weighting (PPW) module that aggregate the complementary merits of multi-scale features by assigning weights to all features. Notwithstanding all this, the interference of texture noise makes the correct classification of some pixels still a challenge. For these hard samples, we propose a novel loss function, coined Dynamic Focal Loss, which reshapes the standard",
    "link": "http://arxiv.org/abs/2307.04952",
    "context": "Title: Compact Twice Fusion Network for Edge Detection. (arXiv:2307.04952v1 [cs.CV])\nAbstract: The significance of multi-scale features has been gradually recognized by the edge detection community. However, the fusion of multi-scale features increases the complexity of the model, which is not friendly to practical application. In this work, we propose a Compact Twice Fusion Network (CTFN) to fully integrate multi-scale features while maintaining the compactness of the model. CTFN includes two lightweight multi-scale feature fusion modules: a Semantic Enhancement Module (SEM) that can utilize the semantic information contained in coarse-scale features to guide the learning of fine-scale features, and a Pseudo Pixel-level Weighting (PPW) module that aggregate the complementary merits of multi-scale features by assigning weights to all features. Notwithstanding all this, the interference of texture noise makes the correct classification of some pixels still a challenge. For these hard samples, we propose a novel loss function, coined Dynamic Focal Loss, which reshapes the standard",
    "path": "papers/23/07/2307.04952.json",
    "total_tokens": 952,
    "translated_title": "紧凑型双重融合网络用于边缘检测",
    "translated_abstract": "边缘检测社区逐渐认识到多尺度特征的重要性。然而，多尺度特征的融合增加了模型的复杂性，对实际应用不友好。本文提出了一种紧凑型双重融合网络（CTFN），以完全整合多尺度特征并保持模型的紧凑性。CTFN包括两个轻量级多尺度特征融合模块：语义增强模块（SEM），可以利用粗尺度特征中包含的语义信息来引导细尺度特征的学习；伪像素级加权（PPW）模块，通过给所有特征分配权重来聚合多尺度特征的互补优点。尽管如此，纹理噪声的干扰仍然使得一些像素的正确分类成为挑战。对于这些难样本，我们提出了一种新的损失函数，称为动态焦点损失，它重新塑造了标准的损失函数以解决这个问题。",
    "tldr": "本文提出了一种紧凑型双重融合网络（CTFN），用于边缘检测，在保持模型紧凑性的同时完全整合多尺度特征。其中包括语义增强模块和伪像素级加权模块，还使用动态焦点损失函数处理纹理噪声带来的挑战。",
    "en_tdlr": "The paper proposes a Compact Twice Fusion Network (CTFN) for edge detection, which fully integrates multi-scale features while maintaining model compactness. It includes a Semantic Enhancement Module and a Pseudo Pixel-level Weighting module, and utilizes a Dynamic Focal Loss function to handle the challenge of texture noise interference."
}