{
    "title": "Transfer Learning for Portfolio Optimization. (arXiv:2307.13546v1 [q-fin.PM])",
    "abstract": "In this work, we explore the possibility of utilizing transfer learning techniques to address the financial portfolio optimization problem. We introduce a novel concept called \"transfer risk\", within the optimization framework of transfer learning. A series of numerical experiments are conducted from three categories: cross-continent transfer, cross-sector transfer, and cross-frequency transfer. In particular, 1. a strong correlation between the transfer risk and the overall performance of transfer learning methods is established, underscoring the significance of transfer risk as a viable indicator of \"transferability\"; 2. transfer risk is shown to provide a computationally efficient way to identify appropriate source tasks in transfer learning, enhancing the efficiency and effectiveness of the transfer learning approach; 3. additionally, the numerical experiments offer valuable new insights for portfolio management across these different settings.",
    "link": "http://arxiv.org/abs/2307.13546",
    "context": "Title: Transfer Learning for Portfolio Optimization. (arXiv:2307.13546v1 [q-fin.PM])\nAbstract: In this work, we explore the possibility of utilizing transfer learning techniques to address the financial portfolio optimization problem. We introduce a novel concept called \"transfer risk\", within the optimization framework of transfer learning. A series of numerical experiments are conducted from three categories: cross-continent transfer, cross-sector transfer, and cross-frequency transfer. In particular, 1. a strong correlation between the transfer risk and the overall performance of transfer learning methods is established, underscoring the significance of transfer risk as a viable indicator of \"transferability\"; 2. transfer risk is shown to provide a computationally efficient way to identify appropriate source tasks in transfer learning, enhancing the efficiency and effectiveness of the transfer learning approach; 3. additionally, the numerical experiments offer valuable new insights for portfolio management across these different settings.",
    "path": "papers/23/07/2307.13546.json",
    "total_tokens": 926,
    "translated_title": "为组合优化问题应用迁移学习技术",
    "translated_abstract": "在这项工作中，我们探索了利用迁移学习技术解决金融组合优化问题的可能性。我们引入了一个新的概念，即“迁移风险”，在迁移学习的优化框架中。通过一系列数值实验，我们从跨洲别迁移、跨行业迁移和跨频率迁移三个类别进行了探究。具体而言：1. 建立了迁移风险与迁移学习方法整体性能之间的强相关性，强调了迁移风险作为可行指标的重要性；2. 发现迁移风险提供了一种计算效率高的方法，用于在迁移学习中识别适当的源任务，从而提高了迁移学习方法的效率和效果；3. 此外，数值实验为不同设置下的投资组合管理提供了有价值的新见解。",
    "tldr": "本文研究了如何利用迁移学习技术解决金融组合优化问题，并引入了新概念\"迁移风险\"，通过实验证明了迁移风险与迁移学习方法整体性能之间的强相关性，并提出了通过迁移风险识别适当的源任务来提高迁移学习方法效率和效果的方法。数值实验还为不同设置下的投资组合管理提供了有价值的新见解。",
    "en_tdlr": "This paper explores the use of transfer learning techniques for financial portfolio optimization, introducing the concept of \"transfer risk\" and demonstrating its strong correlation with the overall performance of transfer learning methods. The study highlights the effectiveness of using transfer risk as an indicator to identify appropriate source tasks and provides valuable insights for portfolio management in different settings."
}