{
    "title": "Federated Learning-Empowered AI-Generated Content in Wireless Networks. (arXiv:2307.07146v1 [cs.DC])",
    "abstract": "Artificial intelligence generated content (AIGC) has emerged as a promising technology to improve the efficiency, quality, diversity and flexibility of the content creation process by adopting a variety of generative AI models. Deploying AIGC services in wireless networks has been expected to enhance the user experience. However, the existing AIGC service provision suffers from several limitations, e.g., the centralized training in the pre-training, fine-tuning and inference processes, especially their implementations in wireless networks with privacy preservation. Federated learning (FL), as a collaborative learning framework where the model training is distributed to cooperative data owners without the need for data sharing, can be leveraged to simultaneously improve learning efficiency and achieve privacy protection for AIGC. To this end, we present FL-based techniques for empowering AIGC, and aim to enable users to generate diverse, personalized, and high-quality content. Furthermo",
    "link": "http://arxiv.org/abs/2307.07146",
    "context": "Title: Federated Learning-Empowered AI-Generated Content in Wireless Networks. (arXiv:2307.07146v1 [cs.DC])\nAbstract: Artificial intelligence generated content (AIGC) has emerged as a promising technology to improve the efficiency, quality, diversity and flexibility of the content creation process by adopting a variety of generative AI models. Deploying AIGC services in wireless networks has been expected to enhance the user experience. However, the existing AIGC service provision suffers from several limitations, e.g., the centralized training in the pre-training, fine-tuning and inference processes, especially their implementations in wireless networks with privacy preservation. Federated learning (FL), as a collaborative learning framework where the model training is distributed to cooperative data owners without the need for data sharing, can be leveraged to simultaneously improve learning efficiency and achieve privacy protection for AIGC. To this end, we present FL-based techniques for empowering AIGC, and aim to enable users to generate diverse, personalized, and high-quality content. Furthermo",
    "path": "papers/23/07/2307.07146.json",
    "total_tokens": 813,
    "translated_title": "在无线网络中使用联邦学习增强人工智能生成的内容",
    "translated_abstract": "人工智能生成的内容（AIGC）已经成为一种有前景的技术，通过采用各种生成型人工智能模型，它可以提高内容创建过程的效率、质量、多样性和灵活性。在无线网络中部署AIGC服务被期望可以提升用户体验。然而，现有的AIGC服务在预训练、微调和推理过程中存在一些限制，特别是在隐私保护的无线网络中的实现。联邦学习（FL）作为一种协作学习框架，可以将模型训练分布到协作数据所有者，无需共享数据，可以同时提高学习效率并实现对AIGC的隐私保护。为此，我们提出了基于FL的技术，以增强AIGC，并旨在使用户能够生成多样化、个性化和高质量的内容。",
    "tldr": "本论文研究了在无线网络中使用联邦学习来增强人工智能生成的内容，以提供多样化、个性化和高质量的内容。"
}