{
    "title": "Exploiting FPGA Capabilities for Accelerated Biomedical Computing. (arXiv:2307.07914v1 [cs.AR])",
    "abstract": "This study presents advanced neural network architectures including Convolutional Neural Networks (CNN), Recurrent Neural Networks (RNN), Long Short-Term Memory Networks (LSTMs), and Deep Belief Networks (DBNs) for enhanced ECG signal analysis using Field Programmable Gate Arrays (FPGAs). We utilize the MIT-BIH Arrhythmia Database for training and validation, introducing Gaussian noise to improve algorithm robustness. The implemented models feature various layers for distinct processing and classification tasks and techniques like EarlyStopping callback and Dropout layer are used to mitigate overfitting. Our work also explores the development of a custom Tensor Compute Unit (TCU) accelerator for the PYNQ Z1 board, offering comprehensive steps for FPGA-based machine learning, including setting up the Tensil toolchain in Docker, selecting architecture, configuring PS-PL, and compiling and executing models. Performance metrics such as latency and throughput are calculated for practical in",
    "link": "http://arxiv.org/abs/2307.07914",
    "context": "Title: Exploiting FPGA Capabilities for Accelerated Biomedical Computing. (arXiv:2307.07914v1 [cs.AR])\nAbstract: This study presents advanced neural network architectures including Convolutional Neural Networks (CNN), Recurrent Neural Networks (RNN), Long Short-Term Memory Networks (LSTMs), and Deep Belief Networks (DBNs) for enhanced ECG signal analysis using Field Programmable Gate Arrays (FPGAs). We utilize the MIT-BIH Arrhythmia Database for training and validation, introducing Gaussian noise to improve algorithm robustness. The implemented models feature various layers for distinct processing and classification tasks and techniques like EarlyStopping callback and Dropout layer are used to mitigate overfitting. Our work also explores the development of a custom Tensor Compute Unit (TCU) accelerator for the PYNQ Z1 board, offering comprehensive steps for FPGA-based machine learning, including setting up the Tensil toolchain in Docker, selecting architecture, configuring PS-PL, and compiling and executing models. Performance metrics such as latency and throughput are calculated for practical in",
    "path": "papers/23/07/2307.07914.json",
    "total_tokens": 877,
    "translated_title": "利用FPGA加速技术的生物医学计算研究",
    "translated_abstract": "本研究提出了先进的神经网络架构，包括卷积神经网络（CNN）、循环神经网络（RNN）、长短期记忆网络（LSTM）和深度置信网络（DBN），利用可编程门阵列（FPGA）来增强心电图信号分析。我们利用MIT-BIH心律失常数据库进行训练和验证，并引入高斯噪声来提高算法的鲁棒性。所实现的模型具有各种层，用于不同的处理和分类任务，同时采用了早停和丢弃层等技术来减轻过拟合问题。我们的工作还探索了为PYNQ Z1板研发自定义的张量计算单元（TCU）加速器，提供了基于FPGA的机器学习的全面步骤，包括在Docker中设置Tensil开发工具链，选择构架，配置PS-PL以及编译和执行模型。性能指标如延迟和吞吐量也得到了计算，以进行实际的研究评估。",
    "tldr": "本研究利用FPGA技术提出了高级神经网络架构，并利用自定义的张量计算单元加速器对生物医学的心电图信号进行分析。研究的重点是提高算法的鲁棒性和实际应用的性能指标。"
}