{
    "title": "MCPA: Multi-scale Cross Perceptron Attention Network for 2D Medical Image Segmentation. (arXiv:2307.14588v1 [eess.IV])",
    "abstract": "The UNet architecture, based on Convolutional Neural Networks (CNN), has demonstrated its remarkable performance in medical image analysis. However, it faces challenges in capturing long-range dependencies due to the limited receptive fields and inherent bias of convolutional operations. Recently, numerous transformer-based techniques have been incorporated into the UNet architecture to overcome this limitation by effectively capturing global feature correlations. However, the integration of the Transformer modules may result in the loss of local contextual information during the global feature fusion process. To overcome these challenges, we propose a 2D medical image segmentation model called Multi-scale Cross Perceptron Attention Network (MCPA). The MCPA consists of three main components: an encoder, a decoder, and a Cross Perceptron. The Cross Perceptron first captures the local correlations using multiple Multi-scale Cross Perceptron modules, facilitating the fusion of features ac",
    "link": "http://arxiv.org/abs/2307.14588",
    "context": "Title: MCPA: Multi-scale Cross Perceptron Attention Network for 2D Medical Image Segmentation. (arXiv:2307.14588v1 [eess.IV])\nAbstract: The UNet architecture, based on Convolutional Neural Networks (CNN), has demonstrated its remarkable performance in medical image analysis. However, it faces challenges in capturing long-range dependencies due to the limited receptive fields and inherent bias of convolutional operations. Recently, numerous transformer-based techniques have been incorporated into the UNet architecture to overcome this limitation by effectively capturing global feature correlations. However, the integration of the Transformer modules may result in the loss of local contextual information during the global feature fusion process. To overcome these challenges, we propose a 2D medical image segmentation model called Multi-scale Cross Perceptron Attention Network (MCPA). The MCPA consists of three main components: an encoder, a decoder, and a Cross Perceptron. The Cross Perceptron first captures the local correlations using multiple Multi-scale Cross Perceptron modules, facilitating the fusion of features ac",
    "path": "papers/23/07/2307.14588.json",
    "total_tokens": 910,
    "translated_title": "MCPA: 多尺度交叉感知器注意力网络用于二维医学图像分割",
    "translated_abstract": "基于卷积神经网络（CNN）的UNet架构在医学图像分析中显示出了卓越的性能。然而，由于有限的感受野和卷积操作固有的偏见，在捕捉长程依赖性方面面临挑战。最近，许多基于Transformer的技术已经被整合到UNet架构中，通过有效地捕捉全局特征相关性来克服这一限制。然而，Transformer模块的整合可能导致在全局特征融合过程中丢失局部上下文信息。为了克服这些挑战，我们提出了一种名为Multi-scale Cross Perceptron Attention Network（MCPA）的二维医学图像分割模型。MCPA由三个主要组件组成：编码器、解码器和交叉感知器。交叉感知器首先使用多个多尺度交叉感知器模块捕捉局部相关性，促进特征融合。",
    "tldr": "提出了一种名为MCPA的多尺度交叉感知器注意力网络，用于二维医学图像分割。该网络通过多尺度交叉感知器模块捕捉局部相关性，并有效地融合全局特征，以克服UNet架构的局限性。"
}