{
    "title": "Learning Difference Equations with Structured Grammatical Evolution for Postprandial Glycaemia Prediction. (arXiv:2307.01238v1 [cs.LG])",
    "abstract": "People with diabetes must carefully monitor their blood glucose levels, especially after eating. Blood glucose regulation requires a proper combination of food intake and insulin boluses. Glucose prediction is vital to avoid dangerous post-meal complications in treating individuals with diabetes. Although traditional methods, such as artificial neural networks, have shown high accuracy rates, sometimes they are not suitable for developing personalised treatments by physicians due to their lack of interpretability. In this study, we propose a novel glucose prediction method emphasising interpretability: Interpretable Sparse Identification by Grammatical Evolution. Combined with a previous clustering stage, our approach provides finite difference equations to predict postprandial glucose levels up to two hours after meals. We divide the dataset into four-hour segments and perform clustering based on blood glucose values for the twohour window before the meal. Prediction models are traine",
    "link": "http://arxiv.org/abs/2307.01238",
    "context": "Title: Learning Difference Equations with Structured Grammatical Evolution for Postprandial Glycaemia Prediction. (arXiv:2307.01238v1 [cs.LG])\nAbstract: People with diabetes must carefully monitor their blood glucose levels, especially after eating. Blood glucose regulation requires a proper combination of food intake and insulin boluses. Glucose prediction is vital to avoid dangerous post-meal complications in treating individuals with diabetes. Although traditional methods, such as artificial neural networks, have shown high accuracy rates, sometimes they are not suitable for developing personalised treatments by physicians due to their lack of interpretability. In this study, we propose a novel glucose prediction method emphasising interpretability: Interpretable Sparse Identification by Grammatical Evolution. Combined with a previous clustering stage, our approach provides finite difference equations to predict postprandial glucose levels up to two hours after meals. We divide the dataset into four-hour segments and perform clustering based on blood glucose values for the twohour window before the meal. Prediction models are traine",
    "path": "papers/23/07/2307.01238.json",
    "total_tokens": 892,
    "translated_title": "用结构化语法演化学习差分方程用于餐后血糖预测",
    "translated_abstract": "糖尿病患者必须密切监测他们的血糖水平，尤其是进餐后。血糖调节需要正确组合的食物摄入和胰岛素注射。血糖预测对于避免治疗糖尿病患者餐后并发症非常重要。虽然传统的方法，如人工神经网络，显示出很高的准确率，但由于其缺乏可解释性，有时不适用于医生开发个性化治疗。在本研究中，我们提出了一种强调可解释性的新型血糖预测方法：可解释稀疏识别通过语法演化。结合先前的聚类阶段，我们的方法提供了有限差分方程来预测餐后两小时内的血糖水平。我们将数据集分为四小时的段，根据进餐前两小时的血糖值进行聚类。预测模型被训练。",
    "tldr": "本研究提出了一种用于餐后血糖预测的新方法，通过结构化语法演化学习差分方程，并结合聚类分析提供可解释性强的预测模型。"
}