{
    "title": "Serving Graph Neural Networks With Distributed Fog Servers For Smart IoT Services. (arXiv:2307.01684v1 [cs.DC])",
    "abstract": "Graph Neural Networks (GNNs) have gained growing interest in miscellaneous applications owing to their outstanding ability in extracting latent representation on graph structures. To render GNN-based service for IoT-driven smart applications, traditional model serving paradigms usually resort to the cloud by fully uploading geo-distributed input data to remote datacenters. However, our empirical measurements reveal the significant communication overhead of such cloud-based serving and highlight the profound potential in applying the emerging fog computing. To maximize the architectural benefits brought by fog computing, in this paper, we present Fograph, a novel distributed real-time GNN inference framework that leverages diverse and dynamic resources of multiple fog nodes in proximity to IoT data sources. By introducing heterogeneity-aware execution planning and GNN-specific compression techniques, Fograph tailors its design to well accommodate the unique characteristics of GNN servin",
    "link": "http://arxiv.org/abs/2307.01684",
    "context": "Title: Serving Graph Neural Networks With Distributed Fog Servers For Smart IoT Services. (arXiv:2307.01684v1 [cs.DC])\nAbstract: Graph Neural Networks (GNNs) have gained growing interest in miscellaneous applications owing to their outstanding ability in extracting latent representation on graph structures. To render GNN-based service for IoT-driven smart applications, traditional model serving paradigms usually resort to the cloud by fully uploading geo-distributed input data to remote datacenters. However, our empirical measurements reveal the significant communication overhead of such cloud-based serving and highlight the profound potential in applying the emerging fog computing. To maximize the architectural benefits brought by fog computing, in this paper, we present Fograph, a novel distributed real-time GNN inference framework that leverages diverse and dynamic resources of multiple fog nodes in proximity to IoT data sources. By introducing heterogeneity-aware execution planning and GNN-specific compression techniques, Fograph tailors its design to well accommodate the unique characteristics of GNN servin",
    "path": "papers/23/07/2307.01684.json",
    "total_tokens": 905,
    "translated_title": "使用分布式雾服务器为智能物联网服务提供图神经网络支持",
    "translated_abstract": "由于其在图结构上提取潜在表示能力的突出优势，图神经网络（GNN）在各种应用中引起了越来越多的关注。为了为物联网驱动的智能应用提供基于GNN的服务，传统的模型服务范例通常通过完全上传地理分布的输入数据到远程数据中心来依赖云。然而，我们的实证测量显示这种基于云的服务存在显著的通信开销，并且强调了应用新兴的雾计算的潜在巨大潜力。为了最大限度地发挥雾计算带来的架构优势，本文提出了一种新颖的分布式实时GNN推断框架Fograph，该框架利用了靠近物联网数据源的多个雾节点的多样性和动态资源。通过引入异构感知执行规划和GNN特定的压缩技术，Fograph的设计与GNN服务的独特特征相契合。",
    "tldr": "本文提出了一种分布式实时GNN推断框架Fograph，该框架利用了靠近物联网数据源的多个雾节点的资源，通过引入异构感知执行规划和GNN特定的压缩技术，以最大限度地发挥雾计算的架构优势。",
    "en_tdlr": "This paper presents Fograph, a distributed real-time GNN inference framework that utilizes the resources of multiple fog nodes near IoT data sources. By introducing heterogeneity-aware execution planning and GNN-specific compression techniques, it maximizes the architectural benefits of fog computing."
}