{
    "title": "Semantic Image Completion and Enhancement using GANs. (arXiv:2307.14748v1 [cs.CV])",
    "abstract": "Semantic inpainting or image completion alludes to the task of inferring arbitrary large missing regions in images based on image semantics. Since the prediction of image pixels requires an indication of high-level context, this makes it significantly tougher than image completion, which is often more concerned with correcting data corruption and removing entire objects from the input image. On the other hand, image enhancement attempts to eliminate unwanted noise and blur from the image, along with sustaining most of the image details. Efficient image completion and enhancement model should be able to recover the corrupted and masked regions in images and then refine the image further to increase the quality of the output image. Generative Adversarial Networks (GAN), have turned out to be helpful in picture completion tasks. In this chapter, we will discuss the underlying GAN architecture and how they can be used used for image completion tasks.",
    "link": "http://arxiv.org/abs/2307.14748",
    "context": "Title: Semantic Image Completion and Enhancement using GANs. (arXiv:2307.14748v1 [cs.CV])\nAbstract: Semantic inpainting or image completion alludes to the task of inferring arbitrary large missing regions in images based on image semantics. Since the prediction of image pixels requires an indication of high-level context, this makes it significantly tougher than image completion, which is often more concerned with correcting data corruption and removing entire objects from the input image. On the other hand, image enhancement attempts to eliminate unwanted noise and blur from the image, along with sustaining most of the image details. Efficient image completion and enhancement model should be able to recover the corrupted and masked regions in images and then refine the image further to increase the quality of the output image. Generative Adversarial Networks (GAN), have turned out to be helpful in picture completion tasks. In this chapter, we will discuss the underlying GAN architecture and how they can be used used for image completion tasks.",
    "path": "papers/23/07/2307.14748.json",
    "total_tokens": 758,
    "translated_title": "使用GAN进行语义图像补全和增强",
    "translated_abstract": "语义修复或图像补全是指根据图像语义推断出图像中任意大小的缺失区域的任务。由于预测图像像素需要高级上下文的指示，这使得它比图像补全更困难，后者通常更关注数据损坏的纠正和从输入图像中删除整个对象。另一方面，图像增强旨在消除图像中的噪声和模糊，并保留大部分图像细节。高效的图像补全和增强模型应能够恢复图像中的损坏和掩盖区域，然后进一步改善图像，提高输出图像的质量。生成对抗网络（GAN）在图像补全任务中已被证明是有用的。在本章中，我们将讨论底层的GAN架构以及它们如何用于图像补全任务。",
    "tldr": "本文介绍了使用生成对抗网络（GAN）进行语义图像补全和增强的方法。",
    "en_tdlr": "This paper presents a method for semantic image completion and enhancement using Generative Adversarial Networks (GAN)."
}