{
    "title": "This is not correct! Negation-aware Evaluation of Language Generation Systems. (arXiv:2307.13989v1 [cs.CL])",
    "abstract": "Large language models underestimate the impact of negations on how much they change the meaning of a sentence. Therefore, learned evaluation metrics based on these models are insensitive to negations. In this paper, we propose NegBLEURT, a negation-aware version of the BLEURT evaluation metric. For that, we designed a rule-based sentence negation tool and used it to create the CANNOT negation evaluation dataset. Based on this dataset, we fine-tuned a sentence transformer and an evaluation metric to improve their negation sensitivity. Evaluating these models on existing benchmarks shows that our fine-tuned models outperform existing metrics on the negated sentences by far while preserving their base models' performances on other perturbations.",
    "link": "http://arxiv.org/abs/2307.13989",
    "context": "Title: This is not correct! Negation-aware Evaluation of Language Generation Systems. (arXiv:2307.13989v1 [cs.CL])\nAbstract: Large language models underestimate the impact of negations on how much they change the meaning of a sentence. Therefore, learned evaluation metrics based on these models are insensitive to negations. In this paper, we propose NegBLEURT, a negation-aware version of the BLEURT evaluation metric. For that, we designed a rule-based sentence negation tool and used it to create the CANNOT negation evaluation dataset. Based on this dataset, we fine-tuned a sentence transformer and an evaluation metric to improve their negation sensitivity. Evaluating these models on existing benchmarks shows that our fine-tuned models outperform existing metrics on the negated sentences by far while preserving their base models' performances on other perturbations.",
    "path": "papers/23/07/2307.13989.json",
    "total_tokens": 798,
    "translated_title": "这是不正确的！对语言生成系统进行否定感知的评估",
    "translated_abstract": "大型语言模型低估了否定对句子含义变化的影响。因此，基于这些模型的学习评估指标对否定不敏感。在本文中，我们提出了NegBLEURT，一种针对否定感知的BLEURT评估指标的改进版本。为此，我们设计了一种基于规则的句子否定工具，并用它来创建了CANNOT否定评估数据集。基于这个数据集，我们对句子转换器和评估指标进行了微调，以提高它们对否定的敏感性。在现有的基准测试中评估这些模型表明，我们微调后的模型在否定句上的表现远远优于现有的指标，同时保持了它们基础模型在其他扰动上的性能。",
    "tldr": "本文提出了一种对语言生成系统进行否定感知的评估方法，并开发了NegBLEURT评估指标以提高对否定的敏感性。实验结果表明，该方法在否定句上的表现优于现有指标，并且在其他扰动上保持了性能。",
    "en_tdlr": "This paper proposes a negation-aware evaluation method for language generation systems and develops the NegBLEURT evaluation metric to improve sensitivity to negations. Experimental results demonstrate that this approach outperforms existing metrics on negated sentences while maintaining performance on other perturbations."
}