{
    "title": "LEO: Learning Efficient Orderings for Multiobjective Binary Decision Diagrams. (arXiv:2307.03171v1 [cs.AI])",
    "abstract": "Approaches based on Binary decision diagrams (BDDs) have recently achieved state-of-the-art results for multiobjective integer programming problems. The variable ordering used in constructing BDDs can have a significant impact on their size and on the quality of bounds derived from relaxed or restricted BDDs for single-objective optimization problems. We first showcase a similar impact of variable ordering on the Pareto frontier (PF) enumeration time for the multiobjective knapsack problem, suggesting the need for deriving variable ordering methods that improve the scalability of the multiobjective BDD approach. To that end, we derive a novel parameter configuration space based on variable scoring functions which are linear in a small set of interpretable and easy-to-compute variable features. We show how the configuration space can be efficiently explored using black-box optimization, circumventing the curse of dimensionality (in the number of variables and objectives), and finding go",
    "link": "http://arxiv.org/abs/2307.03171",
    "context": "Title: LEO: Learning Efficient Orderings for Multiobjective Binary Decision Diagrams. (arXiv:2307.03171v1 [cs.AI])\nAbstract: Approaches based on Binary decision diagrams (BDDs) have recently achieved state-of-the-art results for multiobjective integer programming problems. The variable ordering used in constructing BDDs can have a significant impact on their size and on the quality of bounds derived from relaxed or restricted BDDs for single-objective optimization problems. We first showcase a similar impact of variable ordering on the Pareto frontier (PF) enumeration time for the multiobjective knapsack problem, suggesting the need for deriving variable ordering methods that improve the scalability of the multiobjective BDD approach. To that end, we derive a novel parameter configuration space based on variable scoring functions which are linear in a small set of interpretable and easy-to-compute variable features. We show how the configuration space can be efficiently explored using black-box optimization, circumventing the curse of dimensionality (in the number of variables and objectives), and finding go",
    "path": "papers/23/07/2307.03171.json",
    "total_tokens": 846,
    "translated_title": "LEO：学习高效有序的多目标二进制决策图",
    "translated_abstract": "基于二进制决策图（BDD）的方法近年来在多目标整数规划问题中取得了最先进的结果。构建BDD时使用的变量排序对其大小以及由放松或限制的BDD导出的界限质量有重要影响，本文首先展示了变量排序对多目标背包问题的帕累托前沿（PF）枚举时间的类似影响，表明有必要推导出可提高多目标BDD方法可扩展性的变量排序方法。为此，我们推导出一个基于变量评分函数的新的参数配置空间，该评分函数在一小组可解释且易于计算的变量特征上是线性的。我们展示了如何使用黑箱优化高效地探索配置空间，避免了维度的诅咒（变量和目标的数量），并找到了良好的解。",
    "tldr": "本论文研究了多目标BDD方法中变量排序的问题。通过推导出基于变量评分函数的参数配置空间，提高了多目标BDD方法的可扩展性，并使用黑箱优化技术高效地寻找解。"
}