{
    "title": "Panel Data Models with Time-Varying Latent Group Structures. (arXiv:2307.15863v1 [econ.EM])",
    "abstract": "This paper considers a linear panel model with interactive fixed effects and unobserved individual and time heterogeneities that are captured by some latent group structures and an unknown structural break, respectively. To enhance realism the model may have different numbers of groups and/or different group memberships before and after the break. With the preliminary nuclear-norm-regularized estimation followed by row- and column-wise linear regressions, we estimate the break point based on the idea of binary segmentation and the latent group structures together with the number of groups before and after the break by sequential testing K-means algorithm simultaneously. It is shown that the break point, the number of groups and the group memberships can each be estimated correctly with probability approaching one. Asymptotic distributions of the estimators of the slope coefficients are established. Monte Carlo simulations demonstrate excellent finite sample performance for the proposed",
    "link": "http://arxiv.org/abs/2307.15863",
    "context": "Title: Panel Data Models with Time-Varying Latent Group Structures. (arXiv:2307.15863v1 [econ.EM])\nAbstract: This paper considers a linear panel model with interactive fixed effects and unobserved individual and time heterogeneities that are captured by some latent group structures and an unknown structural break, respectively. To enhance realism the model may have different numbers of groups and/or different group memberships before and after the break. With the preliminary nuclear-norm-regularized estimation followed by row- and column-wise linear regressions, we estimate the break point based on the idea of binary segmentation and the latent group structures together with the number of groups before and after the break by sequential testing K-means algorithm simultaneously. It is shown that the break point, the number of groups and the group memberships can each be estimated correctly with probability approaching one. Asymptotic distributions of the estimators of the slope coefficients are established. Monte Carlo simulations demonstrate excellent finite sample performance for the proposed",
    "path": "papers/23/07/2307.15863.json",
    "total_tokens": 863,
    "translated_title": "具有时间变动潜在群组结构的面板数据模型",
    "translated_abstract": "本文考虑了一个包含交互固定效应和未观测到的个体和时间异质性的线性面板模型，这些异质性分别由一些潜在的群组结构和一个未知的结构性突变捕捉。为了增加现实性，模型在突变前后可能有不同数量的群组和/或不同的群组成员资格。通过初步的核范数正则估计，然后进行逐行和逐列线性回归，我们利用二分分割和潜在群组结构的想法，同时使用顺序测试的K均值算法来估计突变点以及突变前后的群组数量。实验证明，突变点、群组数量和群组成员资格都可以以接近1的概率被正确估计。建立了斜率系数估计量的渐近分布。蒙特卡洛模拟展示了该方法在有限样本下的优异性能。",
    "tldr": "本文提出了一个具有时间变动潜在群组结构的面板数据模型，通过核范数正则估计和K均值算法，可以正确估计突变点、群组数量和群组成员资格。",
    "en_tdlr": "This paper introduces a panel data model with time-varying latent group structures, and proposes a method combining nuclear-norm-regularized estimation and K-means algorithm to correctly estimate the break point, the number of groups, and the group memberships."
}