{
    "title": "Properties of Discrete Sliced Wasserstein Losses. (arXiv:2307.10352v1 [stat.ML])",
    "abstract": "The Sliced Wasserstein (SW) distance has become a popular alternative to the Wasserstein distance for comparing probability measures. Widespread applications include image processing, domain adaptation and generative modelling, where it is common to optimise some parameters in order to minimise SW, which serves as a loss function between discrete probability measures (since measures admitting densities are numerically unattainable). All these optimisation problems bear the same sub-problem, which is minimising the Sliced Wasserstein energy. In this paper we study the properties of $\\mathcal{E}: Y \\longmapsto \\mathrm{SW}_2^2(\\gamma_Y, \\gamma_Z)$, i.e. the SW distance between two uniform discrete measures with the same amount of points as a function of the support $Y \\in \\mathbb{R}^{n \\times d}$ of one of the measures. We investigate the regularity and optimisation properties of this energy, as well as its Monte-Carlo approximation $\\mathcal{E}_p$ (estimating the expectation in SW using ",
    "link": "http://arxiv.org/abs/2307.10352",
    "context": "Title: Properties of Discrete Sliced Wasserstein Losses. (arXiv:2307.10352v1 [stat.ML])\nAbstract: The Sliced Wasserstein (SW) distance has become a popular alternative to the Wasserstein distance for comparing probability measures. Widespread applications include image processing, domain adaptation and generative modelling, where it is common to optimise some parameters in order to minimise SW, which serves as a loss function between discrete probability measures (since measures admitting densities are numerically unattainable). All these optimisation problems bear the same sub-problem, which is minimising the Sliced Wasserstein energy. In this paper we study the properties of $\\mathcal{E}: Y \\longmapsto \\mathrm{SW}_2^2(\\gamma_Y, \\gamma_Z)$, i.e. the SW distance between two uniform discrete measures with the same amount of points as a function of the support $Y \\in \\mathbb{R}^{n \\times d}$ of one of the measures. We investigate the regularity and optimisation properties of this energy, as well as its Monte-Carlo approximation $\\mathcal{E}_p$ (estimating the expectation in SW using ",
    "path": "papers/23/07/2307.10352.json",
    "total_tokens": 904,
    "translated_title": "离散切割Wasserstein损失的性质",
    "translated_abstract": "切割Wasserstein（SW）距离已成为比较概率测度的Wasserstein距离的一种流行替代方法。广泛应用包括图像处理、领域自适应和生成建模，常常需要优化一些参数以最小化SW，该参数充当离散概率测度之间的损失函数（因为具有密度的测度在数值上是无法实现的）。所有这些优化问题都存在相同的子问题，即最小化切割Wasserstein能量。在本文中，我们研究了$\\mathcal{E}: Y \\longmapsto \\mathrm{SW}_2^2(\\gamma_Y, \\gamma_Z)$的属性，即两个具有与一个测度的支撑相同数量的离散均匀测度之间的SW距离作为支撑$Y \\in \\mathbb{R}^{n \\times d}$函数的能量。我们研究了这个能量的正则性和优化性质，以及其通过蒙特卡洛近似$\\mathcal{E}_p$（使用SW中的期望估计）。",
    "tldr": "本文研究了离散切割Wasserstein损失的性质，并探讨了其正则性和优化性质以及通过蒙特卡洛近似的方法。",
    "en_tdlr": "This paper studies the properties of discrete sliced Wasserstein losses, explores their regularity and optimization properties, and investigates Monte-Carlo approximation methods."
}