{
    "title": "Topology-aware Robust Optimization for Out-of-distribution Generalization. (arXiv:2307.13943v1 [cs.LG])",
    "abstract": "Out-of-distribution (OOD) generalization is a challenging machine learning problem yet highly desirable in many high-stake applications. Existing methods suffer from overly pessimistic modeling with low generalization confidence. As generalizing to arbitrary test distributions is impossible, we hypothesize that further structure on the topology of distributions is crucial in developing strong OOD resilience. To this end, we propose topology-aware robust optimization (TRO) that seamlessly integrates distributional topology in a principled optimization framework. More specifically, TRO solves two optimization objectives: (1) Topology Learning which explores data manifold to uncover the distributional topology; (2) Learning on Topology which exploits the topology to constrain robust optimization for tightly-bounded generalization risks. We theoretically demonstrate the effectiveness of our approach and empirically show that it significantly outperforms the state of the arts in a wide rang",
    "link": "http://arxiv.org/abs/2307.13943",
    "context": "Title: Topology-aware Robust Optimization for Out-of-distribution Generalization. (arXiv:2307.13943v1 [cs.LG])\nAbstract: Out-of-distribution (OOD) generalization is a challenging machine learning problem yet highly desirable in many high-stake applications. Existing methods suffer from overly pessimistic modeling with low generalization confidence. As generalizing to arbitrary test distributions is impossible, we hypothesize that further structure on the topology of distributions is crucial in developing strong OOD resilience. To this end, we propose topology-aware robust optimization (TRO) that seamlessly integrates distributional topology in a principled optimization framework. More specifically, TRO solves two optimization objectives: (1) Topology Learning which explores data manifold to uncover the distributional topology; (2) Learning on Topology which exploits the topology to constrain robust optimization for tightly-bounded generalization risks. We theoretically demonstrate the effectiveness of our approach and empirically show that it significantly outperforms the state of the arts in a wide rang",
    "path": "papers/23/07/2307.13943.json",
    "total_tokens": 941,
    "translated_title": "基于拓扑感知的鲁棒优化方法用于越界泛化问题",
    "translated_abstract": "越界泛化是一个具有挑战性的机器学习问题，在许多高风险应用中非常有价值。现有方法在泛化置信度低的情况下受到过于悲观的建模。由于不可能对任意测试分布进行泛化，我们假设在开发强大的越界泛化能力时，分布的拓扑结构至关重要。为此，我们提出了一种拓扑感知的鲁棒优化方法（TRO），将分布的拓扑无缝地整合到一个合理的优化框架中。具体而言，TRO解决了两个优化目标：（1）拓扑学习，探索数据流形以揭示分布的拓扑结构；（2）拓扑学习，利用拓扑结构对鲁棒优化进行约束，以实现紧密边界的泛化风险。理论上证明了我们方法的有效性，并经验证明它在广泛范围内明显优于现有技术水平。",
    "tldr": "本文提出了一种基于拓扑感知的鲁棒优化方法，用于解决越界泛化问题。该方法通过整合分布的拓扑结构来约束优化过程，实现高泛化置信度。理论和实证结果表明，该方法在越界泛化任务中明显优于现有方法。",
    "en_tdlr": "This paper proposes a topology-aware robust optimization method for addressing the out-of-distribution generalization problem. The method integrates the topology of distributions to constrain the optimization process and achieve high generalization confidence. Theoretical and empirical results demonstrate the superiority of this method over existing approaches in the out-of-distribution generalization task."
}