{
    "title": "Adjusting the nuclear reactor's neutron transport and diffusion theory for an alternative description and modelling of postage or supplies delivery processes. (arXiv:2307.07867v1 [q-fin.GN])",
    "abstract": "There seems to exist significant similarities between a reactor system and a supply chain from collection to delivery. In the reactor case, neutrons are continuously produced and absorbed in nuclear fuel. In a supply system case, items are continuously collected and continuously delivered to destinations. Stable reactor operation is ensured by keeping the ratio of neutrons produced to neutrons absorbed in the reactor equal to one. Profitable and qualitative supply operation is ensured by keeping the ratio of items delivered to items collected as close to unity as possible. The analogy between the two systems is obvious. This text, which is provided as is and has not undergone any peer review process, proposes transferring parts of the nuclear reactor's neutron transport and diffusion theory to deterministically model supply processes. To this end a set of assumptions and definitions are provided as needed along with the introduction of reactions or interactions like collections, delive",
    "link": "http://arxiv.org/abs/2307.07867",
    "context": "Title: Adjusting the nuclear reactor's neutron transport and diffusion theory for an alternative description and modelling of postage or supplies delivery processes. (arXiv:2307.07867v1 [q-fin.GN])\nAbstract: There seems to exist significant similarities between a reactor system and a supply chain from collection to delivery. In the reactor case, neutrons are continuously produced and absorbed in nuclear fuel. In a supply system case, items are continuously collected and continuously delivered to destinations. Stable reactor operation is ensured by keeping the ratio of neutrons produced to neutrons absorbed in the reactor equal to one. Profitable and qualitative supply operation is ensured by keeping the ratio of items delivered to items collected as close to unity as possible. The analogy between the two systems is obvious. This text, which is provided as is and has not undergone any peer review process, proposes transferring parts of the nuclear reactor's neutron transport and diffusion theory to deterministically model supply processes. To this end a set of assumptions and definitions are provided as needed along with the introduction of reactions or interactions like collections, delive",
    "path": "papers/23/07/2307.07867.json",
    "total_tokens": 799,
    "translated_title": "调整核反应堆的中子输运和扩散理论以供邮递或供应过程的替代描述和建模",
    "translated_abstract": "反应堆系统与供应链从收集到交付之间存在显著的相似之处。在反应堆案例中，中子在核燃料中不断产生和吸收。在供应系统案例中，物品不断被收集并不断交付到目的地。稳定的反应堆运行通过保持在反应堆中产生中子与吸收中子的比率相等来确保。利润丰厚且质量优良的供应操作通过保持交付物品与收集物品的比率尽可能接近于统一来确保。这两个系统之间的类比是显而易见的。本文提出了将核反应堆的部分中子输运和扩散理论转移到确定性地模拟供应过程的想法。为此，提供了所需的一系列假设和定义，以及介绍了类似收集、交付等反应或相互作用。",
    "tldr": "该论文提出了将核反应堆的中子输运和扩散理论应用于确定性地模拟供应过程，以解决供应链中的问题。"
}