{
    "title": "Fast but multi-partisan: Bursts of communication increase opinion diversity in the temporal Deffuant model. (arXiv:2307.15614v1 [physics.soc-ph])",
    "abstract": "Human interactions create social networks forming the backbone of societies. Individuals adjust their opinions by exchanging information through social interactions. Two recurrent questions are whether social structures promote opinion polarisation or consensus in societies and whether polarisation can be avoided, particularly on social media. In this paper, we hypothesise that not only network structure but also the timings of social interactions regulate the emergence of opinion clusters. We devise a temporal version of the Deffuant opinion model where pairwise interactions follow temporal patterns and show that burstiness alone is sufficient to refrain from consensus and polarisation by promoting the reinforcement of local opinions. Individuals self-organise into a multi-partisan society due to network clustering, but the diversity of opinion clusters further increases with burstiness, particularly when individuals have low tolerance and prefer to adjust to similar peers. The emerge",
    "link": "http://arxiv.org/abs/2307.15614",
    "context": "Title: Fast but multi-partisan: Bursts of communication increase opinion diversity in the temporal Deffuant model. (arXiv:2307.15614v1 [physics.soc-ph])\nAbstract: Human interactions create social networks forming the backbone of societies. Individuals adjust their opinions by exchanging information through social interactions. Two recurrent questions are whether social structures promote opinion polarisation or consensus in societies and whether polarisation can be avoided, particularly on social media. In this paper, we hypothesise that not only network structure but also the timings of social interactions regulate the emergence of opinion clusters. We devise a temporal version of the Deffuant opinion model where pairwise interactions follow temporal patterns and show that burstiness alone is sufficient to refrain from consensus and polarisation by promoting the reinforcement of local opinions. Individuals self-organise into a multi-partisan society due to network clustering, but the diversity of opinion clusters further increases with burstiness, particularly when individuals have low tolerance and prefer to adjust to similar peers. The emerge",
    "path": "papers/23/07/2307.15614.json",
    "total_tokens": 921,
    "translated_title": "快速而多派系的：沟通突发增加时间Deffuant模型中的观点多样性",
    "translated_abstract": "人类互动创建了社会网络，形成社会的骨干。个体通过社交互动交换信息来调整观点。两个经常出现的问题是社会结构是否促进了观点极化或共识以及是否可以避免极化，尤其是在社交媒体上。在本文中，我们假设社交互动的时间结构不仅调节观点集群的形成，而且定时性本身足以阻止达成共识和极化，通过促进本地观点的强化。我们设计了一种Deffuant观点模型的时间版本，其中双方交互遵循时间模式，并表明仅仅靠突发性就足以通过促进本地意见的加强来避免共识和极化。由于网络聚类，个体自组织成为一个多派系的社会，但在突发性的情况下，意见集群的多样性进一步增加，特别是当个体的容忍度较低且更喜欢调整给相似的同伴时。",
    "tldr": "本文研究了沟通突发如何影响观点多样性，发现突发性可以通过促进本地意见的加强来阻止达成共识和极化，特别是在个体容忍度较低且更喜欢调整给相似的同伴时。"
}