{
    "title": "DreaMR: Diffusion-driven Counterfactual Explanation for Functional MRI. (arXiv:2307.09547v1 [eess.SP])",
    "abstract": "Deep learning analyses have offered sensitivity leaps in detection of cognitive states from functional MRI (fMRI) measurements across the brain. Yet, as deep models perform hierarchical nonlinear transformations on their input, interpreting the association between brain responses and cognitive states is challenging. Among common explanation approaches for deep fMRI classifiers, attribution methods show poor specificity and perturbation methods show limited plausibility. While counterfactual generation promises to address these limitations, previous methods use variational or adversarial priors that yield suboptimal sample fidelity. Here, we introduce the first diffusion-driven counterfactual method, DreaMR, to enable fMRI interpretation with high specificity, plausibility and fidelity. DreaMR performs diffusion-based resampling of an input fMRI sample to alter the decision of a downstream classifier, and then computes the minimal difference between the original and counterfactual sampl",
    "link": "http://arxiv.org/abs/2307.09547",
    "context": "Title: DreaMR: Diffusion-driven Counterfactual Explanation for Functional MRI. (arXiv:2307.09547v1 [eess.SP])\nAbstract: Deep learning analyses have offered sensitivity leaps in detection of cognitive states from functional MRI (fMRI) measurements across the brain. Yet, as deep models perform hierarchical nonlinear transformations on their input, interpreting the association between brain responses and cognitive states is challenging. Among common explanation approaches for deep fMRI classifiers, attribution methods show poor specificity and perturbation methods show limited plausibility. While counterfactual generation promises to address these limitations, previous methods use variational or adversarial priors that yield suboptimal sample fidelity. Here, we introduce the first diffusion-driven counterfactual method, DreaMR, to enable fMRI interpretation with high specificity, plausibility and fidelity. DreaMR performs diffusion-based resampling of an input fMRI sample to alter the decision of a downstream classifier, and then computes the minimal difference between the original and counterfactual sampl",
    "path": "papers/23/07/2307.09547.json",
    "total_tokens": 798,
    "translated_title": "DreaMR: 基于扩散的反事实解释的功能性磁共振成像翻译",
    "translated_abstract": "深度学习分析在从功能性磁共振成像（fMRI）测量中检测认知状态方面提供了敏感性的飞跃。然而，由于深度模型对其输入进行层次非线性变换，解释脑部响应和认知状态之间的关联是具有挑战性的。在深度fMRI分类器的常见解释方法中，归因方法显示出较差的特异性，扰动方法显示出有限的合理性。虽然反事实生成承诺解决了这些限制，但以往的方法使用变分或对抗性先验，导致样本一致性不佳。在这里，我们引入了第一个基于扩散的反事实方法DreaMR，以实现具有高特异性，合理性和一致性的fMRI解释。",
    "tldr": "DreaMR 是基于扩散的反事实解释方法，用于高特异性、合理性和一致性的解释功能性磁共振成像（fMRI）数据。"
}