{
    "title": "Prototypical Contrastive Transfer Learning for Multimodal Language Understanding. (arXiv:2307.05942v1 [cs.RO])",
    "abstract": "Although domestic service robots are expected to assist individuals who require support, they cannot currently interact smoothly with people through natural language. For example, given the instruction \"Bring me a bottle from the kitchen,\" it is difficult for such robots to specify the bottle in an indoor environment. Most conventional models have been trained on real-world datasets that are labor-intensive to collect, and they have not fully leveraged simulation data through a transfer learning framework. In this study, we propose a novel transfer learning approach for multimodal language understanding called Prototypical Contrastive Transfer Learning (PCTL), which uses a new contrastive loss called Dual ProtoNCE. We introduce PCTL to the task of identifying target objects in domestic environments according to free-form natural language instructions. To validate PCTL, we built new real-world and simulation datasets. Our experiment demonstrated that PCTL outperformed existing methods. ",
    "link": "http://arxiv.org/abs/2307.05942",
    "context": "Title: Prototypical Contrastive Transfer Learning for Multimodal Language Understanding. (arXiv:2307.05942v1 [cs.RO])\nAbstract: Although domestic service robots are expected to assist individuals who require support, they cannot currently interact smoothly with people through natural language. For example, given the instruction \"Bring me a bottle from the kitchen,\" it is difficult for such robots to specify the bottle in an indoor environment. Most conventional models have been trained on real-world datasets that are labor-intensive to collect, and they have not fully leveraged simulation data through a transfer learning framework. In this study, we propose a novel transfer learning approach for multimodal language understanding called Prototypical Contrastive Transfer Learning (PCTL), which uses a new contrastive loss called Dual ProtoNCE. We introduce PCTL to the task of identifying target objects in domestic environments according to free-form natural language instructions. To validate PCTL, we built new real-world and simulation datasets. Our experiment demonstrated that PCTL outperformed existing methods. ",
    "path": "papers/23/07/2307.05942.json",
    "total_tokens": 927,
    "translated_title": "对于多模态语言理解的原型对比迁移学习",
    "translated_abstract": "尽管国内服务机器人被期望能够帮助需要支持的个人，但他们目前无法通过自然语言与人们平滑地进行交互。例如，对于指令“从厨房给我拿一个瓶子”，这些机器人很难在室内环境中明确指定瓶子。大多数传统模型都是通过耗费大量人力来收集真实世界数据进行训练的，并且它们尚未充分利用通过迁移学习框架的模拟数据。在本研究中，我们提出了一种新颖的多模态语言理解的迁移学习方法，称为原型对比迁移学习（PCTL），它使用了一种新的对比损失函数——双重原型例外。我们将PCTL引入到根据自由形式的自然语言指令识别家庭环境中的目标物体的任务中。为了验证PCTL，我们构建了新的真实世界和模拟数据集。我们的实验证明了PCTL的性能优于现有方法。",
    "tldr": "提出了一种用于多模态语言理解的原型对比迁移学习方法PCTL，通过引入双重原型例外损失函数，在家庭环境中根据自由形式的自然语言指令识别目标物体的任务中取得了优于现有方法的性能。"
}