{
    "title": "Emerging Statistical Machine Learning Techniques for Extreme Temperature Forecasting in U.S. Cities. (arXiv:2307.14285v1 [stat.AP])",
    "abstract": "In this paper, we present a comprehensive analysis of extreme temperature patterns using emerging statistical machine learning techniques. Our research focuses on exploring and comparing the effectiveness of various statistical models for climate time series forecasting. The models considered include Auto-Regressive Integrated Moving Average, Exponential Smoothing, Multilayer Perceptrons, and Gaussian Processes. We apply these methods to climate time series data from five most populated U.S. cities, utilizing Python and Julia to demonstrate the role of statistical computing in understanding climate change and its impacts. Our findings highlight the differences between the statistical methods and identify Multilayer Perceptrons as the most effective approach. Additionally, we project extreme temperatures using this best-performing method, up to 2030, and examine whether the temperature changes are greater than zero, thereby testing a hypothesis.",
    "link": "http://arxiv.org/abs/2307.14285",
    "context": "Title: Emerging Statistical Machine Learning Techniques for Extreme Temperature Forecasting in U.S. Cities. (arXiv:2307.14285v1 [stat.AP])\nAbstract: In this paper, we present a comprehensive analysis of extreme temperature patterns using emerging statistical machine learning techniques. Our research focuses on exploring and comparing the effectiveness of various statistical models for climate time series forecasting. The models considered include Auto-Regressive Integrated Moving Average, Exponential Smoothing, Multilayer Perceptrons, and Gaussian Processes. We apply these methods to climate time series data from five most populated U.S. cities, utilizing Python and Julia to demonstrate the role of statistical computing in understanding climate change and its impacts. Our findings highlight the differences between the statistical methods and identify Multilayer Perceptrons as the most effective approach. Additionally, we project extreme temperatures using this best-performing method, up to 2030, and examine whether the temperature changes are greater than zero, thereby testing a hypothesis.",
    "path": "papers/23/07/2307.14285.json",
    "total_tokens": 859,
    "translated_title": "新兴的统计机器学习技术在美国城市的极端气温预测中的应用",
    "translated_abstract": "本文使用新兴的统计机器学习技术对极端气温模式进行了全面分析。我们的研究重点是探索和比较各种统计模型在气候时间序列预测中的有效性。所考虑的模型包括自回归综合移动平均、指数平滑、多层感知器和高斯过程。我们应用这些方法于美国五个人口最多的城市的气候时间序列数据，利用Python和Julia来展示统计计算在理解气候变化及其影响中的作用。我们的研究结果突出了统计方法之间的差异，并确定了多层感知器作为最有效的方法。此外，我们使用这个最佳方法对未来的极端气温进行了预测，考察温度变化是否大于零，从而测试了一个假设。",
    "tldr": "本文使用新兴的统计机器学习技术对美国城市的极端气温进行了全面分析，发现多层感知器是最有效的方法，并使用该方法对未来极端气温进行了预测和假设测试。",
    "en_tdlr": "This paper presents a comprehensive analysis of extreme temperature patterns in U.S. cities using emerging statistical machine learning techniques. Among the methods considered, Multilayer Perceptrons are identified as the most effective approach. The study also includes projections of future extreme temperatures and testing of a hypothesis."
}