{
    "title": "Smart filter aided domain adversarial neural network: An unsupervised domain adaptation method for fault diagnosis in noisy industrial scenarios. (arXiv:2307.01429v1 [eess.SP])",
    "abstract": "The application of unsupervised domain adaptation (UDA)-based fault diagnosis methods has shown significant efficacy in industrial settings, facilitating the transfer of operational experience and fault signatures between different operating conditions, different units of a fleet or between simulated and real data. However, in real industrial scenarios, unknown levels and types of noise can amplify the difficulty of domain alignment, thus severely affecting the diagnostic performance of deep learning models. To address this issue, we propose an UDA method called Smart Filter-Aided Domain Adversarial Neural Network (SFDANN) for fault diagnosis in noisy industrial scenarios. The proposed methodology comprises two steps. In the first step, we develop a smart filter that dynamically enforces similarity between the source and target domain data in the time-frequency domain. This is achieved by combining a learnable wavelet packet transform network (LWPT) and a traditional wavelet packet tra",
    "link": "http://arxiv.org/abs/2307.01429",
    "context": "Title: Smart filter aided domain adversarial neural network: An unsupervised domain adaptation method for fault diagnosis in noisy industrial scenarios. (arXiv:2307.01429v1 [eess.SP])\nAbstract: The application of unsupervised domain adaptation (UDA)-based fault diagnosis methods has shown significant efficacy in industrial settings, facilitating the transfer of operational experience and fault signatures between different operating conditions, different units of a fleet or between simulated and real data. However, in real industrial scenarios, unknown levels and types of noise can amplify the difficulty of domain alignment, thus severely affecting the diagnostic performance of deep learning models. To address this issue, we propose an UDA method called Smart Filter-Aided Domain Adversarial Neural Network (SFDANN) for fault diagnosis in noisy industrial scenarios. The proposed methodology comprises two steps. In the first step, we develop a smart filter that dynamically enforces similarity between the source and target domain data in the time-frequency domain. This is achieved by combining a learnable wavelet packet transform network (LWPT) and a traditional wavelet packet tra",
    "path": "papers/23/07/2307.01429.json",
    "total_tokens": 1044,
    "translated_title": "智能滤波器辅助的领域对抗神经网络：一种用于嘈杂工业场景中故障诊断的无监督领域自适应方法",
    "translated_abstract": "无监督领域自适应（UDA）故障诊断方法在工业环境中显示出显著的功效，有助于在不同的工况、不同的单位之间或模拟数据和真实数据之间转移运行经验和故障特征。然而，在真实的工业场景中，未知的噪声水平和类型会加剧领域对齐的困难，从而严重影响深度学习模型的诊断性能。为了解决这个问题，我们提出了一种称为智能滤波器辅助领域对抗神经网络（SFDANN）的UDA方法，用于嘈杂的工业场景中的故障诊断。所提出的方法包括两个步骤。在第一步中，我们开发了一个智能滤波器，通过在时频域中将源域和目标域数据之间的相似性动态地加强，实现领域对齐。这是通过将可学习的小波包变换网络（LWPT）和传统的小波包变换相结合来实现的。",
    "tldr": "本文提出了一种称为智能滤波器辅助领域对抗神经网络（SFDANN）的无监督领域自适应方法，用于嘈杂的工业场景中的故障诊断。该方法通过引入智能滤波器，在时频域中动态加强源域和目标域数据之间的相似性，以实现领域对齐。",
    "en_tdlr": "This paper proposes an unsupervised domain adaptation method called Smart Filter-Aided Domain Adversarial Neural Network (SFDANN) for fault diagnosis in noisy industrial scenarios. The method addresses the challenge of domain alignment in real industrial scenarios by introducing a smart filter that dynamically enforces similarity between the source and target domain data in the time-frequency domain."
}