{
    "title": "Several categories of Large Language Models (LLMs): A Short Survey. (arXiv:2307.10188v1 [cs.CL])",
    "abstract": "Large Language Models(LLMs)have become effective tools for natural language processing and have been used in many different fields. This essay offers a succinct summary of various LLM subcategories. The survey emphasizes recent developments and efforts made for various LLM kinds, including task-based financial LLMs, multilingual language LLMs, biomedical and clinical LLMs, vision language LLMs, and code language models. The survey gives a general summary of the methods, attributes, datasets, transformer models, and comparison metrics applied in each category of LLMs. Furthermore, it highlights unresolved problems in the field of developing chatbots and virtual assistants, such as boosting natural language processing, enhancing chatbot intelligence, and resolving moral and legal dilemmas. The purpose of this study is to provide readers, developers, academics, and users interested in LLM-based chatbots and virtual intelligent assistant technologies with useful information and future dire",
    "link": "http://arxiv.org/abs/2307.10188",
    "context": "Title: Several categories of Large Language Models (LLMs): A Short Survey. (arXiv:2307.10188v1 [cs.CL])\nAbstract: Large Language Models(LLMs)have become effective tools for natural language processing and have been used in many different fields. This essay offers a succinct summary of various LLM subcategories. The survey emphasizes recent developments and efforts made for various LLM kinds, including task-based financial LLMs, multilingual language LLMs, biomedical and clinical LLMs, vision language LLMs, and code language models. The survey gives a general summary of the methods, attributes, datasets, transformer models, and comparison metrics applied in each category of LLMs. Furthermore, it highlights unresolved problems in the field of developing chatbots and virtual assistants, such as boosting natural language processing, enhancing chatbot intelligence, and resolving moral and legal dilemmas. The purpose of this study is to provide readers, developers, academics, and users interested in LLM-based chatbots and virtual intelligent assistant technologies with useful information and future dire",
    "path": "papers/23/07/2307.10188.json",
    "total_tokens": 918,
    "translated_title": "大型语言模型（LLMs）的几个类别：简短调查",
    "translated_abstract": "大型语言模型（LLMs）已成为自然语言处理的有效工具，并在许多不同领域中得到应用。本文对各种LLM子类进行了简洁的总结。该调查强调了各种LLM类型的最新发展和努力，包括基于任务的金融LLM，多语言LLM，生物医学和临床LLM，视觉语言LLM和代码语言模型。该调查对每个LLM类别中应用的方法、属性、数据集、变压器模型和比较指标进行了概述。此外，它还突出了在开发聊天机器人和虚拟助手领域存在的未解决问题，如提升自然语言处理能力，增强聊天机器人智能性以及解决道德和法律困境。本研究旨在为对基于LLM的聊天机器人和虚拟智能助手技术感兴趣的读者、开发人员、学术界人士和用户提供有用的信息和未来的方向。",
    "tldr": "本文是对大型语言模型（LLMs）的几个类别进行的简短调查，提供了各类LLM的最新发展和努力的概述，包括多语言LLMs、视觉语言LLMs和代码语言模型等。同时，还突出了在聊天机器人和虚拟助手领域存在的问题，如提升自然语言处理能力和解决道德和法律困境。"
}