{
    "title": "Mood Classification of Bangla Songs Based on Lyrics. (arXiv:2307.10314v1 [cs.IR])",
    "abstract": "Music can evoke various emotions, and with the advancement of technology, it has become more accessible to people. Bangla music, which portrays different human emotions, lacks sufficient research. The authors of this article aim to analyze Bangla songs and classify their moods based on the lyrics. To achieve this, this research has compiled a dataset of 4000 Bangla song lyrics, genres, and used Natural Language Processing and the Bert Algorithm to analyze the data. Among the 4000 songs, 1513 songs are represented for the sad mood, 1362 for the romantic mood, 886 for happiness, and the rest 239 are classified as relaxation. By embedding the lyrics of the songs, the authors have classified the songs into four moods: Happy, Sad, Romantic, and Relaxed. This research is crucial as it enables a multi-class classification of songs' moods, making the music more relatable to people's emotions. The article presents the automated result of the four moods accurately derived from the song lyrics.",
    "link": "http://arxiv.org/abs/2307.10314",
    "context": "Title: Mood Classification of Bangla Songs Based on Lyrics. (arXiv:2307.10314v1 [cs.IR])\nAbstract: Music can evoke various emotions, and with the advancement of technology, it has become more accessible to people. Bangla music, which portrays different human emotions, lacks sufficient research. The authors of this article aim to analyze Bangla songs and classify their moods based on the lyrics. To achieve this, this research has compiled a dataset of 4000 Bangla song lyrics, genres, and used Natural Language Processing and the Bert Algorithm to analyze the data. Among the 4000 songs, 1513 songs are represented for the sad mood, 1362 for the romantic mood, 886 for happiness, and the rest 239 are classified as relaxation. By embedding the lyrics of the songs, the authors have classified the songs into four moods: Happy, Sad, Romantic, and Relaxed. This research is crucial as it enables a multi-class classification of songs' moods, making the music more relatable to people's emotions. The article presents the automated result of the four moods accurately derived from the song lyrics.",
    "path": "papers/23/07/2307.10314.json",
    "total_tokens": 975,
    "translated_title": "基于歌词的孟加拉歌曲情绪分类",
    "translated_abstract": "音乐能唤起各种情绪，随着技术的进步，人们对音乐的接触也越来越多。然而对于展现不同人类情感的孟加拉音乐，相关的研究尚不足够。本文的作者旨在通过分析孟加拉歌曲的歌词来分类其情绪。为实现这一目标，研究人员收集了4000首孟加拉歌曲的歌词和流派，并运用自然语言处理和BERT算法来分析数据。在这4000首歌曲中，1513首代表悲伤情绪，1362首代表浪漫情绪，886首代表快乐，其余的239首被归类为放松。通过嵌入歌词，作者将这些歌曲分为四种情绪：快乐、悲伤、浪漫和放松。该研究对于实现音乐的多类情绪分类至关重要，使音乐更能与人们的情感产生共鸣。该文章详细描述了通过歌词准确推导出的四种情绪的自动化结果。",
    "tldr": "本研究通过分析孟加拉歌曲的歌词，成功实现了对这些歌曲的情绪进行多类分类，包括快乐、悲伤、浪漫和放松，为使音乐更贴近人们的情感做出了重要贡献。",
    "en_tdlr": "This research successfully achieved multi-class classification of the moods of Bangla songs, including happiness, sadness, romantic, and relaxation, by analyzing their lyrics, thus making a significant contribution to making the music more relatable to people's emotions."
}