{
    "title": "MMSD2.0: Towards a Reliable Multi-modal Sarcasm Detection System. (arXiv:2307.07135v1 [cs.CL])",
    "abstract": "Multi-modal sarcasm detection has attracted much recent attention. Nevertheless, the existing benchmark (MMSD) has some shortcomings that hinder the development of reliable multi-modal sarcasm detection system: (1) There are some spurious cues in MMSD, leading to the model bias learning; (2) The negative samples in MMSD are not always reasonable. To solve the aforementioned issues, we introduce MMSD2.0, a correction dataset that fixes the shortcomings of MMSD, by removing the spurious cues and re-annotating the unreasonable samples. Meanwhile, we present a novel framework called multi-view CLIP that is capable of leveraging multi-grained cues from multiple perspectives (i.e., text, image, and text-image interaction view) for multi-modal sarcasm detection. Extensive experiments show that MMSD2.0 is a valuable benchmark for building reliable multi-modal sarcasm detection systems and multi-view CLIP can significantly outperform the previous best baselines.",
    "link": "http://arxiv.org/abs/2307.07135",
    "context": "Title: MMSD2.0: Towards a Reliable Multi-modal Sarcasm Detection System. (arXiv:2307.07135v1 [cs.CL])\nAbstract: Multi-modal sarcasm detection has attracted much recent attention. Nevertheless, the existing benchmark (MMSD) has some shortcomings that hinder the development of reliable multi-modal sarcasm detection system: (1) There are some spurious cues in MMSD, leading to the model bias learning; (2) The negative samples in MMSD are not always reasonable. To solve the aforementioned issues, we introduce MMSD2.0, a correction dataset that fixes the shortcomings of MMSD, by removing the spurious cues and re-annotating the unreasonable samples. Meanwhile, we present a novel framework called multi-view CLIP that is capable of leveraging multi-grained cues from multiple perspectives (i.e., text, image, and text-image interaction view) for multi-modal sarcasm detection. Extensive experiments show that MMSD2.0 is a valuable benchmark for building reliable multi-modal sarcasm detection systems and multi-view CLIP can significantly outperform the previous best baselines.",
    "path": "papers/23/07/2307.07135.json",
    "total_tokens": 942,
    "translated_title": "MMSD2.0：面向可靠的多模式讽刺检测系统",
    "translated_abstract": "多模式讽刺检测引起了近期的广泛关注。然而，现有的基准数据集（MMSD）存在一些缺点，阻碍了可靠的多模式讽刺检测系统的发展：（1）MMSD中存在一些虚假线索，导致模型学习偏差；（2）MMSD中的负样本并不总是合理的。为了解决上述问题，我们引入了MMSD2.0，一个纠正了MMSD缺陷的纠正数据集，通过去除虚假线索和重新注释不合理样本来完成。同时，我们提出了一种称为多视图CLIP的新颖框架，能够从多个角度（文本、图像和文本-图像交互视图）利用多粒度线索进行多模式讽刺检测。大量实验证明，MMSD2.0是构建可靠的多模式讽刺检测系统的有价值的基准数据集，而多视图CLIP能够显著优于以前的最佳基准算法。",
    "tldr": "MMSD2.0是一个修正了MMSD缺陷的数据集，提出了多视图CLIP框架，能够从多个角度利用多粒度线索进行多模式讽刺检测，显著优于以前最好的基准算法。",
    "en_tdlr": "MMSD2.0 is a dataset that corrects the shortcomings of MMSD and introduces the multi-view CLIP framework, which leverages multi-grained cues from multiple perspectives for multi-modal sarcasm detection, significantly outperforming previous best baselines."
}