{
    "title": "PseudoCell: Hard Negative Mining as Pseudo Labeling for Deep Learning-Based Centroblast Cell Detection. (arXiv:2307.03211v1 [q-bio.QM])",
    "abstract": "Patch classification models based on deep learning have been utilized in whole-slide images (WSI) of H&E-stained tissue samples to assist pathologists in grading follicular lymphoma patients. However, these approaches still require pathologists to manually identify centroblast cells and provide refined labels for optimal performance. To address this, we propose PseudoCell, an object detection framework to automate centroblast detection in WSI (source code is available at https://github.com/IoBT-VISTEC/PseudoCell.git). This framework incorporates centroblast labels from pathologists and combines them with pseudo-negative labels obtained from undersampled false-positive predictions using the cell's morphological features. By employing PseudoCell, pathologists' workload can be reduced as it accurately narrows down the areas requiring their attention during examining tissue. Depending on the confidence threshold, PseudoCell can eliminate 58.18-99.35% of non-centroblasts tissue areas on WSI",
    "link": "http://arxiv.org/abs/2307.03211",
    "context": "Title: PseudoCell: Hard Negative Mining as Pseudo Labeling for Deep Learning-Based Centroblast Cell Detection. (arXiv:2307.03211v1 [q-bio.QM])\nAbstract: Patch classification models based on deep learning have been utilized in whole-slide images (WSI) of H&E-stained tissue samples to assist pathologists in grading follicular lymphoma patients. However, these approaches still require pathologists to manually identify centroblast cells and provide refined labels for optimal performance. To address this, we propose PseudoCell, an object detection framework to automate centroblast detection in WSI (source code is available at https://github.com/IoBT-VISTEC/PseudoCell.git). This framework incorporates centroblast labels from pathologists and combines them with pseudo-negative labels obtained from undersampled false-positive predictions using the cell's morphological features. By employing PseudoCell, pathologists' workload can be reduced as it accurately narrows down the areas requiring their attention during examining tissue. Depending on the confidence threshold, PseudoCell can eliminate 58.18-99.35% of non-centroblasts tissue areas on WSI",
    "path": "papers/23/07/2307.03211.json",
    "total_tokens": 1028,
    "translated_title": "PseudoCell: 将硬负样本挖掘作为伪标签用于基于深度学习的中心母细胞检测",
    "translated_abstract": "基于深度学习的补丁分类模型已被应用于H&E染色组织样本的整个切片图像中，以帮助病理学家对滤泡性淋巴瘤患者进行评级。然而，这些方法仍然需要病理学家手动识别中心母细胞并提供精细化标签以实现最佳性能。为了解决这个问题，我们提出了PseudoCell，一种用于自动化中心母细胞检测的目标检测框架（源代码可在https://github.com/IoBT-VISTEC/PseudoCell.git找到）。该框架通过将病理学家的中心母细胞标签与使用细胞形态特征对低采样假阳性预测得到的伪阴性标签相结合。通过使用PseudoCell，可以减轻病理学家的工作负担，因为它准确地缩小了需要检查组织的区域。根据置信阈值，PseudoCell可以在WSI上消除58.18-99.35%的非中心母细胞组织区域。",
    "tldr": "PseudoCell是一种基于深度学习的目标检测框架，用于自动化中心母细胞检测。它通过将病理学家的中心母细胞标签与使用细胞形态特征对低采样假阳性预测得到的伪阴性标签相结合，可以准确地缩小需要检查组织的区域。",
    "en_tdlr": "PseudoCell is a deep learning-based object detection framework for automated centroblast cell detection. By combining centroblast labels from pathologists with pseudo-negative labels obtained from undersampled false-positive predictions using the cell's morphological features, it accurately narrows down the areas requiring examination."
}