{
    "title": "balance -- a Python package for balancing biased data samples. (arXiv:2307.06024v1 [stat.CO])",
    "abstract": "Surveys are an important research tool, providing unique measurements on subjective experiences such as sentiment and opinions that cannot be measured by other means. However, because survey data is collected from a self-selected group of participants, directly inferring insights from it to a population of interest, or training ML models on such data, can lead to erroneous estimates or under-performing models. In this paper we present balance, an open-source Python package by Meta, offering a simple workflow for analyzing and adjusting biased data samples with respect to a population of interest.  The balance workflow includes three steps: understanding the initial bias in the data relative to a target we would like to infer, adjusting the data to correct for the bias by producing weights for each unit in the sample based on propensity scores, and evaluating the final biases and the variance inflation after applying the fitted weights. The package provides a simple API that can be used",
    "link": "http://arxiv.org/abs/2307.06024",
    "context": "Title: balance -- a Python package for balancing biased data samples. (arXiv:2307.06024v1 [stat.CO])\nAbstract: Surveys are an important research tool, providing unique measurements on subjective experiences such as sentiment and opinions that cannot be measured by other means. However, because survey data is collected from a self-selected group of participants, directly inferring insights from it to a population of interest, or training ML models on such data, can lead to erroneous estimates or under-performing models. In this paper we present balance, an open-source Python package by Meta, offering a simple workflow for analyzing and adjusting biased data samples with respect to a population of interest.  The balance workflow includes three steps: understanding the initial bias in the data relative to a target we would like to infer, adjusting the data to correct for the bias by producing weights for each unit in the sample based on propensity scores, and evaluating the final biases and the variance inflation after applying the fitted weights. The package provides a simple API that can be used",
    "path": "papers/23/07/2307.06024.json",
    "total_tokens": 873,
    "translated_title": "balance -- 一个用于平衡有偏数据样本的Python软件包",
    "translated_abstract": "调查是一种重要的研究工具，可以提供关于情感和意见等主观体验的独特测量，这些测量无法通过其他方式进行。然而，由于调查数据是从自愿参与的人群中收集的，直接从中推断出对所关注的人群或者训练机器学习模型，可能会导致错误的估计或者性能下降的模型。本文介绍了一个开源的Python软件包balance，它由Meta开发，提供一个简单的工作流程来分析和校正有偏数据样本，使其相对于所关注的人群具有平衡性。balance工作流程包括三个步骤：了解数据的初始偏差，根据倾向分数为样本中的每个单位产生权重以校正偏差，以及在应用拟合权重后评估最终偏差和方差膨胀。该软件包提供了一个简单的API，可以用于...",
    "tldr": "balance是一个用于分析和调整有偏数据样本的Python软件包，通过评估初始偏差、根据倾向分数产生权重校正数据以及评估拟合权重后的偏差和方差膨胀来提供功能。",
    "en_tdlr": "balance is a Python package for analyzing and adjusting biased data samples, providing functionality by evaluating initial bias, correcting data based on propensity scores, and evaluating bias and variance inflation after applying fitted weights."
}