{
    "title": "Resume Evaluation through Latent Dirichlet Allocation and Natural Language Processing for Effective Candidate Selection. (arXiv:2307.15752v1 [cs.CL])",
    "abstract": "In this paper, we propose a method for resume rating using Latent Dirichlet Allocation (LDA) and entity detection with SpaCy. The proposed method first extracts relevant entities such as education, experience, and skills from the resume using SpaCy's Named Entity Recognition (NER). The LDA model then uses these entities to rate the resume by assigning topic probabilities to each entity. Furthermore, we conduct a detailed analysis of the entity detection using SpaCy's NER and report its evaluation metrics. Using LDA, our proposed system breaks down resumes into latent topics and extracts meaningful semantic representations. With a vision to define our resume score to be more content-driven rather than a structure and keyword match driven, our model has achieved 77% accuracy with respect to only skills in consideration and an overall 82% accuracy with all attributes in consideration. (like college name, work experience, degree and skills)",
    "link": "http://arxiv.org/abs/2307.15752",
    "context": "Title: Resume Evaluation through Latent Dirichlet Allocation and Natural Language Processing for Effective Candidate Selection. (arXiv:2307.15752v1 [cs.CL])\nAbstract: In this paper, we propose a method for resume rating using Latent Dirichlet Allocation (LDA) and entity detection with SpaCy. The proposed method first extracts relevant entities such as education, experience, and skills from the resume using SpaCy's Named Entity Recognition (NER). The LDA model then uses these entities to rate the resume by assigning topic probabilities to each entity. Furthermore, we conduct a detailed analysis of the entity detection using SpaCy's NER and report its evaluation metrics. Using LDA, our proposed system breaks down resumes into latent topics and extracts meaningful semantic representations. With a vision to define our resume score to be more content-driven rather than a structure and keyword match driven, our model has achieved 77% accuracy with respect to only skills in consideration and an overall 82% accuracy with all attributes in consideration. (like college name, work experience, degree and skills)",
    "path": "papers/23/07/2307.15752.json",
    "total_tokens": 855,
    "translated_title": "通过潜在狄利克雷分配和自然语言处理对简历进行评估，以实现有效的候选人选择",
    "translated_abstract": "本文提出了一种使用潜在狄利克雷分配（LDA）和使用SpaCy进行实体检测的简历评分方法。所提出的方法首先使用SpaCy的命名实体识别（NER）从简历中提取相关实体，如教育背景、工作经历和技能。然后，LDA模型使用这些实体为简历评分，为每个实体分配主题概率。此外，我们使用SpaCy的NER进行实体检测的详细分析，并报告其评估指标。使用LDA，我们提出的系统将简历分解为潜在主题，并提取有意义的语义表示。我们的模型实现了77%的准确率，只考虑技能，在考虑所有属性（如学院名称、工作经历、学位和技能）的情况下，总体准确率达到82%。",
    "tldr": "本文提出了一种使用LDA和自然语言处理的方法，通过提取简历中的实体并将其用于评分，从而实现有效的候选人选择。该方法在考虑所有属性的情况下达到了82%的准确率。"
}