{
    "title": "Confidence intervals for performance estimates in 3D medical image segmentation. (arXiv:2307.10926v2 [eess.IV] UPDATED)",
    "abstract": "Medical segmentation models are evaluated empirically. As such an evaluation is based on a limited set of example images, it is unavoidably noisy. Beyond a mean performance measure, reporting confidence intervals is thus crucial. However, this is rarely done in medical image segmentation. The width of the confidence interval depends on the test set size and on the spread of the performance measure (its standard-deviation across of the test set). For classification, many test images are needed to avoid wide confidence intervals. Segmentation, however, has not been studied, and it differs by the amount of information brought by a given test image. In this paper, we study the typical confidence intervals in medical image segmentation. We carry experiments on 3D image segmentation using the standard nnU-net framework, two datasets from the Medical Decathlon challenge and two performance measures: the Dice accuracy and the Hausdorff distance. We show that the parametric confidence intervals",
    "link": "http://arxiv.org/abs/2307.10926",
    "context": "Title: Confidence intervals for performance estimates in 3D medical image segmentation. (arXiv:2307.10926v2 [eess.IV] UPDATED)\nAbstract: Medical segmentation models are evaluated empirically. As such an evaluation is based on a limited set of example images, it is unavoidably noisy. Beyond a mean performance measure, reporting confidence intervals is thus crucial. However, this is rarely done in medical image segmentation. The width of the confidence interval depends on the test set size and on the spread of the performance measure (its standard-deviation across of the test set). For classification, many test images are needed to avoid wide confidence intervals. Segmentation, however, has not been studied, and it differs by the amount of information brought by a given test image. In this paper, we study the typical confidence intervals in medical image segmentation. We carry experiments on 3D image segmentation using the standard nnU-net framework, two datasets from the Medical Decathlon challenge and two performance measures: the Dice accuracy and the Hausdorff distance. We show that the parametric confidence intervals",
    "path": "papers/23/07/2307.10926.json",
    "total_tokens": 890,
    "translated_title": "对3D医学图像分割性能估计的置信区间研究",
    "translated_abstract": "医学分割模型的评估是基于有限的例图像，因此评估结果存在噪声。除了报告平均性能指标外，报告置信区间也是非常重要的。然而，在医学图像分割中，很少有人这样做。置信区间的宽度取决于测试集大小和性能指标的散布程度（即测试集上的标准差）。对于分类问题，需要许多测试图像以避免宽泛的置信区间。然而，对于分割问题，这个情况尚未研究，因为给定的测试图像所提供的信息量不同。本文研究了医学图像分割中典型的置信区间。我们使用标准的nnU-net框架在两个来自Medical Decathlon挑战赛的数据集上进行了3D图像分割的实验，并使用Dice准确度和Hausdorff距离两个性能指标。我们发现参数置信区间的宽度与分割问题的特点有关，需要更多的研究才能得到更准确的结果。",
    "tldr": "本文研究了医学图像分割中性能估计的置信区间，通过实验发现参数置信区间的宽度与分割问题的特点有关。",
    "en_tdlr": "This paper investigates confidence intervals for performance estimates in medical image segmentation and finds that the width of the parameter confidence intervals is related to the characteristics of the segmentation problem."
}