{
    "title": "The Double-Edged Sword of Big Data and Information Technology for the Disadvantaged: A Cautionary Tale from Open Banking. (arXiv:2307.13408v1 [cs.LG])",
    "abstract": "This research article analyses and demonstrates the hidden implications for fairness of seemingly neutral data coupled with powerful technology, such as machine learning (ML), using Open Banking as an example. Open Banking has ignited a revolution in financial services, opening new opportunities for customer acquisition, management, retention, and risk assessment. However, the granularity of transaction data holds potential for harm where unnoticed proxies for sensitive and prohibited characteristics may lead to indirect discrimination. Against this backdrop, we investigate the dimensions of financial vulnerability (FV), a global concern resulting from COVID-19 and rising inflation. Specifically, we look to understand the behavioral elements leading up to FV and its impact on at-risk, disadvantaged groups through the lens of fair interpretation. Using a unique dataset from a UK FinTech lender, we demonstrate the power of fine-grained transaction data while simultaneously cautioning its",
    "link": "http://arxiv.org/abs/2307.13408",
    "context": "Title: The Double-Edged Sword of Big Data and Information Technology for the Disadvantaged: A Cautionary Tale from Open Banking. (arXiv:2307.13408v1 [cs.LG])\nAbstract: This research article analyses and demonstrates the hidden implications for fairness of seemingly neutral data coupled with powerful technology, such as machine learning (ML), using Open Banking as an example. Open Banking has ignited a revolution in financial services, opening new opportunities for customer acquisition, management, retention, and risk assessment. However, the granularity of transaction data holds potential for harm where unnoticed proxies for sensitive and prohibited characteristics may lead to indirect discrimination. Against this backdrop, we investigate the dimensions of financial vulnerability (FV), a global concern resulting from COVID-19 and rising inflation. Specifically, we look to understand the behavioral elements leading up to FV and its impact on at-risk, disadvantaged groups through the lens of fair interpretation. Using a unique dataset from a UK FinTech lender, we demonstrate the power of fine-grained transaction data while simultaneously cautioning its",
    "path": "papers/23/07/2307.13408.json",
    "total_tokens": 987,
    "translated_title": "大数据和信息技术对弱势群体的双刃剑：开放银行的一个警示故事",
    "translated_abstract": "本研究分析和展示了看似中立的数据和强大的技术（如机器学习）在开放银行等领域对公平性的隐藏影响。开放银行在金融服务领域引发了一场革命，为客户获取、管理、保留和风险评估打开了新的机会。然而，交易数据的细致程度可能会带来潜在的危害，未被注意的敏感和禁止性特征的代理可能导致间接歧视。在这个背景下，我们通过公平解释的视角，研究了金融脆弱性（FV）的维度，这是COVID-19和通胀上升带来的全球关注点。具体而言，我们试图了解导致FV的行为因素，以及它如何影响处于风险群体中的弱势群体。使用来自英国一家金融科技借贷公司的独特数据集，我们展示了细粒度交易数据的能力，同时也对其提出了警告。",
    "tldr": "本研究利用开放银行作为例子，分析了大数据和强大的信息技术（如机器学习）所带来的公平性隐患。通过研究金融脆弱性的维度，我们展示了细致交易数据的能力，并提醒对其应当谨慎使用以避免潜在的歧视问题。",
    "en_tdlr": "This research analyzes the hidden fairness implications of seemingly neutral data and powerful technology, such as machine learning, using Open Banking as an example. It demonstrates the power of fine-grained transaction data while cautioning against potential indirect discrimination and emphasizes the need for careful usage to avoid biases."
}