{
    "title": "Safe Screening for Unbalanced Optimal Transport. (arXiv:2307.00247v1 [math.OC])",
    "abstract": "This paper introduces a framework that utilizes the Safe Screening technique to accelerate the optimization process of the Unbalanced Optimal Transport (UOT) problem by proactively identifying and eliminating zero elements in the sparse solutions. We demonstrate the feasibility of applying Safe Screening to the UOT problem with $\\ell_2$-penalty and KL-penalty by conducting an analysis of the solution's bounds and considering the local strong convexity of the dual problem. Considering the specific structural characteristics of the UOT in comparison to general Lasso problems on the index matrix, we specifically propose a novel approximate projection, an elliptical safe region construction, and a two-hyperplane relaxation method. These enhancements significantly improve the screening efficiency for the UOT's without altering the algorithm's complexity.",
    "link": "http://arxiv.org/abs/2307.00247",
    "context": "Title: Safe Screening for Unbalanced Optimal Transport. (arXiv:2307.00247v1 [math.OC])\nAbstract: This paper introduces a framework that utilizes the Safe Screening technique to accelerate the optimization process of the Unbalanced Optimal Transport (UOT) problem by proactively identifying and eliminating zero elements in the sparse solutions. We demonstrate the feasibility of applying Safe Screening to the UOT problem with $\\ell_2$-penalty and KL-penalty by conducting an analysis of the solution's bounds and considering the local strong convexity of the dual problem. Considering the specific structural characteristics of the UOT in comparison to general Lasso problems on the index matrix, we specifically propose a novel approximate projection, an elliptical safe region construction, and a two-hyperplane relaxation method. These enhancements significantly improve the screening efficiency for the UOT's without altering the algorithm's complexity.",
    "path": "papers/23/07/2307.00247.json",
    "total_tokens": 803,
    "translated_title": "安全筛选不平衡最优传输的方法",
    "translated_abstract": "本文介绍了一种利用安全筛选技术来加速优化过程的不平衡最优传输问题的框架，通过主动识别和消除稀疏解中的零元素。我们通过分析解的上界、考虑对偶问题的局部强凸性，证明了将安全筛选应用于具有$\\ell_2$-惩罚和KL-惩罚的不平衡最优传输问题的可行性。考虑到不平衡最优传输相对于一般索引矩阵上的Lasso问题的特定结构特征，我们特别提出了一种新的近似投影、椭圆安全区域构造和两个超平面松弛方法。这些改进显著提高了不平衡最优传输问题的筛选效率，而不改变算法的复杂性。",
    "tldr": "本文介绍了一种利用安全筛选技术来加速不平衡最优传输问题优化过程的框架，通过识别和消除稀疏解中的零元素，显著提高了筛选效率。",
    "en_tdlr": "This paper introduces a framework that utilizes the Safe Screening technique to accelerate the optimization process of the Unbalanced Optimal Transport (UOT) problem by proactively identifying and eliminating zero elements in the sparse solutions, significantly improving the screening efficiency."
}