{
    "title": "Player-optimal Stable Regret for Bandit Learning in Matching Markets. (arXiv:2307.10890v1 [cs.LG])",
    "abstract": "The problem of matching markets has been studied for a long time in the literature due to its wide range of applications. Finding a stable matching is a common equilibrium objective in this problem. Since market participants are usually uncertain of their preferences, a rich line of recent works study the online setting where one-side participants (players) learn their unknown preferences from iterative interactions with the other side (arms). Most previous works in this line are only able to derive theoretical guarantees for player-pessimal stable regret, which is defined compared with the players' least-preferred stable matching. However, under the pessimal stable matching, players only obtain the least reward among all stable matchings. To maximize players' profits, player-optimal stable matching would be the most desirable. Though \\citet{basu21beyond} successfully bring an upper bound for player-optimal stable regret, their result can be exponentially large if players' preference g",
    "link": "http://arxiv.org/abs/2307.10890",
    "context": "Title: Player-optimal Stable Regret for Bandit Learning in Matching Markets. (arXiv:2307.10890v1 [cs.LG])\nAbstract: The problem of matching markets has been studied for a long time in the literature due to its wide range of applications. Finding a stable matching is a common equilibrium objective in this problem. Since market participants are usually uncertain of their preferences, a rich line of recent works study the online setting where one-side participants (players) learn their unknown preferences from iterative interactions with the other side (arms). Most previous works in this line are only able to derive theoretical guarantees for player-pessimal stable regret, which is defined compared with the players' least-preferred stable matching. However, under the pessimal stable matching, players only obtain the least reward among all stable matchings. To maximize players' profits, player-optimal stable matching would be the most desirable. Though \\citet{basu21beyond} successfully bring an upper bound for player-optimal stable regret, their result can be exponentially large if players' preference g",
    "path": "papers/23/07/2307.10890.json",
    "total_tokens": 889,
    "translated_title": "在匹配市场中的赌博学习中的玩家最优稳定遗憾",
    "translated_abstract": "由于其广泛的应用范围，匹配市场的问题已经在文献中研究了很长时间。在这个问题中，找到一个稳定的匹配是一个常见的均衡目标。由于市场参与者通常对他们的偏好感到不确定，最近有许多研究探讨了在线设置，其中单方参与者（玩家）通过与另一方（对手）的迭代交互来学习他们未知的偏好。在这一领域的大多数先前的工作只能推导出玩家最差稳定遗憾的理论保证，这是相对于玩家最不喜欢的稳定匹配定义的。然而，在最差稳定匹配下，玩家只能获得所有稳定匹配中的最低奖励。为了最大化玩家的利润，玩家最优稳定匹配将是最理想的。然而，尽管Basu等人成功地提供了玩家最优稳定遗憾的上界，但他们的结果在玩家偏好很大的情况下可能是指数级别的。",
    "tldr": "在匹配市场中，通过在线学习，玩家可以实现玩家最优稳定匹配，从而最大化他们的利润。",
    "en_tdlr": "In matching markets, through online learning, players can achieve player-optimal stable matching to maximize their profits."
}