{
    "title": "A Machine Learning based Empirical Evaluation of Cyber Threat Actors High Level Attack Patterns over Low level Attack Patterns in Attributing Attacks. (arXiv:2307.10252v1 [cs.CR])",
    "abstract": "Cyber threat attribution is the process of identifying the actor of an attack incident in cyberspace. An accurate and timely threat attribution plays an important role in deterring future attacks by applying appropriate and timely defense mechanisms. Manual analysis of attack patterns gathered by honeypot deployments, intrusion detection systems, firewalls, and via trace-back procedures is still the preferred method of security analysts for cyber threat attribution. Such attack patterns are low-level Indicators of Compromise (IOC). They represent Tactics, Techniques, Procedures (TTP), and software tools used by the adversaries in their campaigns. The adversaries rarely re-use them. They can also be manipulated, resulting in false and unfair attribution. To empirically evaluate and compare the effectiveness of both kinds of IOC, there are two problems that need to be addressed. The first problem is that in recent research works, the ineffectiveness of low-level IOC for cyber threat attr",
    "link": "http://arxiv.org/abs/2307.10252",
    "context": "Title: A Machine Learning based Empirical Evaluation of Cyber Threat Actors High Level Attack Patterns over Low level Attack Patterns in Attributing Attacks. (arXiv:2307.10252v1 [cs.CR])\nAbstract: Cyber threat attribution is the process of identifying the actor of an attack incident in cyberspace. An accurate and timely threat attribution plays an important role in deterring future attacks by applying appropriate and timely defense mechanisms. Manual analysis of attack patterns gathered by honeypot deployments, intrusion detection systems, firewalls, and via trace-back procedures is still the preferred method of security analysts for cyber threat attribution. Such attack patterns are low-level Indicators of Compromise (IOC). They represent Tactics, Techniques, Procedures (TTP), and software tools used by the adversaries in their campaigns. The adversaries rarely re-use them. They can also be manipulated, resulting in false and unfair attribution. To empirically evaluate and compare the effectiveness of both kinds of IOC, there are two problems that need to be addressed. The first problem is that in recent research works, the ineffectiveness of low-level IOC for cyber threat attr",
    "path": "papers/23/07/2307.10252.json",
    "total_tokens": 924,
    "translated_title": "一个基于机器学习的实证评估：在归因攻击中，对于低级攻击模式和高级攻击模式来说，威胁行为者的高层攻击模式效果更好。",
    "translated_abstract": "网络威胁归因是在网络空间中识别攻击事件的行为者的过程。准确和及时的威胁归因在应用适当和及时的防御机制上起到重要作用。对于网络安全分析人员来说，通过蜜罐部署、入侵检测系统、防火墙和溯源程序收集攻击模式的手动分析仍然是首选的威胁归因方法。这些攻击模式是低级威胁迹象（IOC），它们代表了对手在他们的攻击中使用的策略、技术、程序（TTP）和软件工具。攻击者很少重复使用它们，它们也可以被篡改，导致错误和不公正的归因。为了实证评估和比较这两种IOC的有效性，有两个问题需要解决。第一个问题是，在最近的研究工作中，低级IOC对于网络威胁归因的效果不佳。",
    "tldr": "通过基于机器学习的实证评估，本研究表明，在网络威胁归因中，高级攻击模式表现出更好的效果，相比于低级攻击模式。",
    "en_tdlr": "Through an empirical evaluation based on machine learning, this study demonstrates that high-level attack patterns exhibit better effectiveness in cyber threat attribution compared to low-level attack patterns."
}