{
    "title": "Spectral Normalized-Cut Graph Partitioning with Fairness Constraints. (arXiv:2307.12065v1 [cs.LG])",
    "abstract": "Normalized-cut graph partitioning aims to divide the set of nodes in a graph into $k$ disjoint clusters to minimize the fraction of the total edges between any cluster and all other clusters. In this paper, we consider a fair variant of the partitioning problem wherein nodes are characterized by a categorical sensitive attribute (e.g., gender or race) indicating membership to different demographic groups. Our goal is to ensure that each group is approximately proportionally represented in each cluster while minimizing the normalized cut value. To resolve this problem, we propose a two-phase spectral algorithm called FNM. In the first phase, we add an augmented Lagrangian term based on our fairness criteria to the objective function for obtaining a fairer spectral node embedding. Then, in the second phase, we design a rounding scheme to produce $k$ clusters from the fair embedding that effectively trades off fairness and partition quality. Through comprehensive experiments on nine bench",
    "link": "http://arxiv.org/abs/2307.12065",
    "context": "Title: Spectral Normalized-Cut Graph Partitioning with Fairness Constraints. (arXiv:2307.12065v1 [cs.LG])\nAbstract: Normalized-cut graph partitioning aims to divide the set of nodes in a graph into $k$ disjoint clusters to minimize the fraction of the total edges between any cluster and all other clusters. In this paper, we consider a fair variant of the partitioning problem wherein nodes are characterized by a categorical sensitive attribute (e.g., gender or race) indicating membership to different demographic groups. Our goal is to ensure that each group is approximately proportionally represented in each cluster while minimizing the normalized cut value. To resolve this problem, we propose a two-phase spectral algorithm called FNM. In the first phase, we add an augmented Lagrangian term based on our fairness criteria to the objective function for obtaining a fairer spectral node embedding. Then, in the second phase, we design a rounding scheme to produce $k$ clusters from the fair embedding that effectively trades off fairness and partition quality. Through comprehensive experiments on nine bench",
    "path": "papers/23/07/2307.12065.json",
    "total_tokens": 895,
    "translated_title": "具有公平约束的谱归一化切图分割",
    "translated_abstract": "归一化切图分割的目标是将图中的节点集合划分为$k$个不相交的聚类，以最小化任意聚类与其他聚类之间的总边数占比。本文考虑了一种公平的划分问题变种，在此问题中，节点由一个分类敏感属性（例如性别或种族）表征，指示其属于不同人口群体。我们的目标是在最小化归一化切值的同时，确保每个群体在每个聚类中近似按比例表示。为了解决这个问题，我们提出了一种称为FNM的两阶段谱算法。在第一阶段，我们根据公平标准向目标函数中添加了一个增广Lagrangian项，以获得更公平的谱节点嵌入。然后，在第二阶段，我们设计了一个舍入方案，从公平嵌入中生成$k$个聚类，有效地权衡了公平性和划分质量。通过对九个基准数据集的全面实验",
    "tldr": "本文提出了一种谱归一化切图分割的公平约束变种问题，通过两阶段的谱算法FNM，实现了在最小化归一化切值的同时保证每个聚类中各个人口群体的近似比例。",
    "en_tdlr": "This paper presents a fair variant of the normalized-cut graph partitioning problem, and proposes a two-phase spectral algorithm, FNM, which achieves approximately proportional representation of each demographic group in each cluster while minimizing the normalized cut value."
}