{
    "title": "Exploring acceptance of autonomous vehicle policies using KeyBERT and SNA: Targeting engineering students. (arXiv:2307.09014v1 [cs.SI])",
    "abstract": "This study aims to explore user acceptance of Autonomous Vehicle (AV) policies with improved text-mining methods. Recently, South Korean policymakers have viewed Autonomous Driving Car (ADC) and Autonomous Driving Robot (ADR) as next-generation means of transportation that will reduce the cost of transporting passengers and goods. They support the construction of V2I and V2V communication infrastructures for ADC and recognize that ADR is equivalent to pedestrians to promote its deployment into sidewalks. To fill the gap where end-user acceptance of these policies is not well considered, this study applied two text-mining methods to the comments of graduate students in the fields of Industrial, Mechanical, and Electronics-Electrical-Computer. One is the Co-occurrence Network Analysis (CNA) based on TF-IWF and Dice coefficient, and the other is the Contextual Semantic Network Analysis (C-SNA) based on both KeyBERT, which extracts keywords that contextually represent the comments, and dou",
    "link": "http://arxiv.org/abs/2307.09014",
    "context": "Title: Exploring acceptance of autonomous vehicle policies using KeyBERT and SNA: Targeting engineering students. (arXiv:2307.09014v1 [cs.SI])\nAbstract: This study aims to explore user acceptance of Autonomous Vehicle (AV) policies with improved text-mining methods. Recently, South Korean policymakers have viewed Autonomous Driving Car (ADC) and Autonomous Driving Robot (ADR) as next-generation means of transportation that will reduce the cost of transporting passengers and goods. They support the construction of V2I and V2V communication infrastructures for ADC and recognize that ADR is equivalent to pedestrians to promote its deployment into sidewalks. To fill the gap where end-user acceptance of these policies is not well considered, this study applied two text-mining methods to the comments of graduate students in the fields of Industrial, Mechanical, and Electronics-Electrical-Computer. One is the Co-occurrence Network Analysis (CNA) based on TF-IWF and Dice coefficient, and the other is the Contextual Semantic Network Analysis (C-SNA) based on both KeyBERT, which extracts keywords that contextually represent the comments, and dou",
    "path": "papers/23/07/2307.09014.json",
    "total_tokens": 937,
    "translated_title": "使用KeyBERT和SNA探索针对工程学生的自动驾驶车辆政策接受度",
    "translated_abstract": "本研究旨在利用改进的文本挖掘方法，探索用户对自动驾驶车辆政策的接受度。近年来，韩国政策制定者将自动驾驶汽车（ADC）和自动驾驶机器人（ADR）视为下一代交通工具，可以降低乘客和货物运输成本。他们支持为ADC建设V2I和V2V通信基础设施，并认识到ADR等同于行人，以促进其在人行道上的部署。为了填补终端用户对这些政策接受度没有充分考虑的空白，本研究将两种文本挖掘方法应用于工业、机械和电子-电气-计算机领域的研究生意见。一种是基于TF-IWF和Dice系数的共现网络分析（CNA），另一种是基于能够以上下文方式表示意见的关键词提取工具KeyBERT的上下文语义网络分析（C-SNA）。",
    "tldr": "本研究利用KeyBERT和SNA方法，探索工程学生对自动驾驶车辆政策的接受度。通过文本挖掘分析研究生的意见，从而填补了终端用户对这些政策接受度的分析空白。",
    "en_tdlr": "This study explores the acceptance of autonomous vehicle policies among engineering students using KeyBERT and SNA methods. By analyzing the comments of graduate students through text mining, the study fills the gap in understanding the acceptance of these policies among end-users."
}