{
    "title": "CycleIK: Neuro-inspired Inverse Kinematics. (arXiv:2307.11554v1 [cs.RO])",
    "abstract": "The paper introduces CycleIK, a neuro-robotic approach that wraps two novel neuro-inspired methods for the inverse kinematics (IK) task, a Generative Adversarial Network (GAN), and a Multi-Layer Perceptron architecture. These methods can be used in a standalone fashion, but we also show how embedding these into a hybrid neuro-genetic IK pipeline allows for further optimization via sequential least-squares programming (SLSQP) or a genetic algorithm (GA). The models are trained and tested on dense datasets that were collected from random robot configurations of the new Neuro-Inspired COLlaborator (NICOL), a semi-humanoid robot with two redundant 8-DoF manipulators. We utilize the weighted multi-objective function from the state-of-the-art BioIK method to support the training process and our hybrid neuro-genetic architecture. We show that the neural models can compete with state-of-the-art IK approaches, which allows for deployment directly to robotic hardware. Additionally, it is shown t",
    "link": "http://arxiv.org/abs/2307.11554",
    "context": "Title: CycleIK: Neuro-inspired Inverse Kinematics. (arXiv:2307.11554v1 [cs.RO])\nAbstract: The paper introduces CycleIK, a neuro-robotic approach that wraps two novel neuro-inspired methods for the inverse kinematics (IK) task, a Generative Adversarial Network (GAN), and a Multi-Layer Perceptron architecture. These methods can be used in a standalone fashion, but we also show how embedding these into a hybrid neuro-genetic IK pipeline allows for further optimization via sequential least-squares programming (SLSQP) or a genetic algorithm (GA). The models are trained and tested on dense datasets that were collected from random robot configurations of the new Neuro-Inspired COLlaborator (NICOL), a semi-humanoid robot with two redundant 8-DoF manipulators. We utilize the weighted multi-objective function from the state-of-the-art BioIK method to support the training process and our hybrid neuro-genetic architecture. We show that the neural models can compete with state-of-the-art IK approaches, which allows for deployment directly to robotic hardware. Additionally, it is shown t",
    "path": "papers/23/07/2307.11554.json",
    "total_tokens": 982,
    "translated_title": "CycleIK：脑神经启发的逆运动学",
    "translated_abstract": "本文介绍了CycleIK，一种神经机器人逆运动学方法，该方法包括生成对抗网络（GAN）和多层感知器（MLP）架构两种新颖的神经启发方法。这些方法可以单独应用，但我们还展示了如何将它们嵌入混合神经遗传逆运动学流水线，通过顺序最小二乘规划（SLSQP）或遗传算法（GA）进行进一步优化。我们使用从新型脑神经启发协作机器人（NICOL）的随机机器人配置收集的稠密数据集来训练和测试模型，该机器人具有两个冗余的8自由度操作器。我们利用最先进的BioIK方法中的加权多目标函数来支持训练过程和混合神经遗传架构。我们验证了神经模型可以与最先进的逆运动学方法竞争，从而可以直接部署到机器人硬件上。",
    "tldr": "本文介绍了CycleIK，一种神经机器人逆运动学方法，它包括生成对抗网络（GAN）和多层感知器（MLP）架构。通过嵌入混合神经遗传逆运动学流水线并使用稠密数据集进行训练和测试，我们展示了该方法在逆运动学上的优越性能。这使得CycleIK可以直接部署到机器人硬件上。",
    "en_tdlr": "The paper introduces CycleIK, a neuro-robotic inverse kinematics method that combines a Generative Adversarial Network (GAN) and a Multi-Layer Perceptron architecture. By embedding these methods into a hybrid neuro-genetic IK pipeline and training and testing on dense datasets, the paper demonstrates the superiority of CycleIK in inverse kinematics and its potential for deployment on robotic hardware."
}