{
    "title": "Intelligent Robotic Sonographer: Mutual Information-based Disentangled Reward Learning from Few Demonstrations. (arXiv:2307.03705v1 [cs.RO])",
    "abstract": "Ultrasound (US) imaging is widely used for biometric measurement and diagnosis of internal organs due to the advantages of being real-time and radiation-free. However, due to high inter-operator variability, resulting images highly depend on operators' experience. In this work, an intelligent robotic sonographer is proposed to autonomously \"explore\" target anatomies and navigate a US probe to a relevant 2D plane by learning from expert. The underlying high-level physiological knowledge from experts is inferred by a neural reward function, using a ranked pairwise image comparisons approach in a self-supervised fashion. This process can be referred to as understanding the \"language of sonography\". Considering the generalization capability to overcome inter-patient variations, mutual information is estimated by a network to explicitly extract the task-related and domain features in latent space. Besides, a Gaussian distribution-based filter is developed to automatically evaluate and take ",
    "link": "http://arxiv.org/abs/2307.03705",
    "context": "Title: Intelligent Robotic Sonographer: Mutual Information-based Disentangled Reward Learning from Few Demonstrations. (arXiv:2307.03705v1 [cs.RO])\nAbstract: Ultrasound (US) imaging is widely used for biometric measurement and diagnosis of internal organs due to the advantages of being real-time and radiation-free. However, due to high inter-operator variability, resulting images highly depend on operators' experience. In this work, an intelligent robotic sonographer is proposed to autonomously \"explore\" target anatomies and navigate a US probe to a relevant 2D plane by learning from expert. The underlying high-level physiological knowledge from experts is inferred by a neural reward function, using a ranked pairwise image comparisons approach in a self-supervised fashion. This process can be referred to as understanding the \"language of sonography\". Considering the generalization capability to overcome inter-patient variations, mutual information is estimated by a network to explicitly extract the task-related and domain features in latent space. Besides, a Gaussian distribution-based filter is developed to automatically evaluate and take ",
    "path": "papers/23/07/2307.03705.json",
    "total_tokens": 864,
    "translated_title": "智能机器人超声医生：基于互信息的少示范解耦奖励学习",
    "translated_abstract": "超声（US）成像由于实时性和无辐射的优势而广泛用于生物测量和内部器官诊断。然而，由于高水平的操作者可变性，结果图像很大程度上取决于操作者的经验。本文提出了一种智能机器人超声医生，通过从专家那里学习，自主地“探索”目标解剖学并将超声探头导航到相关的2D平面。专家的底层高级生理知识通过神经奖励函数推断出来，使用自监督方式进行排名对比图像。这个过程可以称为理解 “声学语言”。考虑到克服患者间变异性的泛化能力，网络通过估计互信息来显式提取潜在空间中与任务相关和领域特征。此外，开发了基于高斯分布的滤波器，用于自动评估和采取措施。",
    "tldr": "本研究提出了一种智能机器人超声医生，通过学习专家的经验，自主地控制超声探头来进行生物测量和内部器官诊断。使用互信息来提取任务相关和领域特征，并通过神经奖励函数推断出专家的生理知识。"
}