{
    "title": "AnyTeleop: A General Vision-Based Dexterous Robot Arm-Hand Teleoperation System. (arXiv:2307.04577v2 [cs.RO] UPDATED)",
    "abstract": "Vision-based teleoperation offers the possibility to endow robots with human-level intelligence to physically interact with the environment, while only requiring low-cost camera sensors. However, current vision-based teleoperation systems are designed and engineered towards a particular robot model and deploy environment, which scales poorly as the pool of the robot models expands and the variety of the operating environment increases. In this paper, we propose AnyTeleop, a unified and general teleoperation system to support multiple different arms, hands, realities, and camera configurations within a single system. Although being designed to provide great flexibility to the choice of simulators and real hardware, our system can still achieve great performance. For real-world experiments, AnyTeleop can outperform a previous system that was designed for a specific robot hardware with a higher success rate, using the same robot. For teleoperation in simulation, AnyTeleop leads to better ",
    "link": "http://arxiv.org/abs/2307.04577",
    "context": "Title: AnyTeleop: A General Vision-Based Dexterous Robot Arm-Hand Teleoperation System. (arXiv:2307.04577v2 [cs.RO] UPDATED)\nAbstract: Vision-based teleoperation offers the possibility to endow robots with human-level intelligence to physically interact with the environment, while only requiring low-cost camera sensors. However, current vision-based teleoperation systems are designed and engineered towards a particular robot model and deploy environment, which scales poorly as the pool of the robot models expands and the variety of the operating environment increases. In this paper, we propose AnyTeleop, a unified and general teleoperation system to support multiple different arms, hands, realities, and camera configurations within a single system. Although being designed to provide great flexibility to the choice of simulators and real hardware, our system can still achieve great performance. For real-world experiments, AnyTeleop can outperform a previous system that was designed for a specific robot hardware with a higher success rate, using the same robot. For teleoperation in simulation, AnyTeleop leads to better ",
    "path": "papers/23/07/2307.04577.json",
    "total_tokens": 861,
    "translated_title": "AnyTeleop: 通用视觉导向的灵巧机械臂手操作系统",
    "translated_abstract": "基于视觉的远程操作为机器人提供了与环境进行物理交互的可能性，同时只需要低成本的摄像头传感器。然而，目前的基于视觉的远程操作系统是针对特定机器人模型和部署环境进行设计和工程化的，随着机器人模型的增加和操作环境的多样化，其扩展性较差。本文提出了AnyTeleop，一个统一和通用的远程操作系统，支持在单个系统中使用多个不同的机械臂、手部、现实环境和摄像头配置。尽管设计具有选择模拟器和真实硬件的灵活性，我们的系统仍然可以实现出色的性能。在实际实验中，AnyTeleop可以以更高的成功率击败为特定机器人硬件设计的以前系统，使用相同的机器人。在模拟中进行远程操作时，AnyTeleop可以实现更好的效果。",
    "tldr": "AnyTeleop是一个通用的视觉导向的远程操作系统，支持多个不同的机械臂、手部、环境和摄像头配置，在实际实验和模拟中表现出色。",
    "en_tdlr": "AnyTeleop is a general vision-based teleoperation system that supports multiple different robot arms, hands, environments, and camera configurations. It outperforms previous systems in both real-world experiments and simulation scenarios."
}