{
    "title": "Unveiling the Potential of Knowledge-Prompted ChatGPT for Enhancing Drug Trafficking Detection on Social Media. (arXiv:2307.03699v1 [cs.CL])",
    "abstract": "Social media platforms such as Instagram and Twitter have emerged as critical channels for drug marketing and illegal sale. Detecting and labeling online illicit drug trafficking activities becomes important in addressing this issue. However, the effectiveness of conventional supervised learning methods in detecting drug trafficking heavily relies on having access to substantial amounts of labeled data, while data annotation is time-consuming and resource-intensive. Furthermore, these models often face challenges in accurately identifying trafficking activities when drug dealers use deceptive language and euphemisms to avoid detection. To overcome this limitation, we conduct the first systematic study on leveraging large language models (LLMs), such as ChatGPT, to detect illicit drug trafficking activities on social media. We propose an analytical framework to compose \\emph{knowledge-informed prompts}, which serve as the interface that humans can interact with and use LLMs to perform t",
    "link": "http://arxiv.org/abs/2307.03699",
    "context": "Title: Unveiling the Potential of Knowledge-Prompted ChatGPT for Enhancing Drug Trafficking Detection on Social Media. (arXiv:2307.03699v1 [cs.CL])\nAbstract: Social media platforms such as Instagram and Twitter have emerged as critical channels for drug marketing and illegal sale. Detecting and labeling online illicit drug trafficking activities becomes important in addressing this issue. However, the effectiveness of conventional supervised learning methods in detecting drug trafficking heavily relies on having access to substantial amounts of labeled data, while data annotation is time-consuming and resource-intensive. Furthermore, these models often face challenges in accurately identifying trafficking activities when drug dealers use deceptive language and euphemisms to avoid detection. To overcome this limitation, we conduct the first systematic study on leveraging large language models (LLMs), such as ChatGPT, to detect illicit drug trafficking activities on social media. We propose an analytical framework to compose \\emph{knowledge-informed prompts}, which serve as the interface that humans can interact with and use LLMs to perform t",
    "path": "papers/23/07/2307.03699.json",
    "total_tokens": 934,
    "translated_title": "揭示知识激发的ChatGPT在增强社交媒体上的毒品贩运检测中的潜力",
    "translated_abstract": "社交媒体平台如Instagram和Twitter已经成为毒品营销和非法销售的关键渠道。检测和标记在线非法毒品贩运活动对解决这个问题至关重要。然而，传统的监督学习方法在检测毒品贩运方面的有效性在很大程度上依赖于获得大量标记数据，而数据注释是耗时且资源密集的过程。此外，当毒贩使用欺骗性语言和委婉语避免被检测时，这些模型通常面临着准确识别贩运活动的挑战。为了克服这个限制，我们进行了第一次系统研究，利用ChatGPT等大型语言模型(LLMs)来检测社交媒体上的非法毒品贩运活动。我们提出了一个分析框架，用于组成知识驱动的提示，这些提示作为人类与LLMs交互的接口来执行检测任务。",
    "tldr": "这项研究首次系统地利用大型语言模型(ChatGPT)检测社交媒体上的非法毒品贩运活动。通过利用知识驱动的提示，该方法能够解决传统监督学习方法在数据获取和识别欺骗性语言方面的限制。",
    "en_tdlr": "This study systematically utilizes large language models (LLMs), such as ChatGPT, to detect illicit drug trafficking activities on social media. By leveraging knowledge-informed prompts, the proposed method overcomes the limitations of conventional supervised learning methods in data acquisition and identification of deceptive language."
}