{
    "title": "Identifying document similarity using a fast estimation of the Levenshtein Distance based on compression and signatures. (arXiv:2307.11496v1 [cs.IR])",
    "abstract": "Identifying document similarity has many applications, e.g., source code analysis or plagiarism detection. However, identifying similarities is not trivial and can be time complex. For instance, the Levenshtein Distance is a common metric to define the similarity between two documents but has quadratic runtime which makes it impractical for large documents where large starts with a few hundred kilobytes. In this paper, we present a novel concept that allows estimating the Levenshtein Distance: the algorithm first compresses documents to signatures (similar to hash values) using a user-defined compression ratio. Signatures can then be compared against each other (some constrains apply) where the outcome is the estimated Levenshtein Distance. Our evaluation shows promising results in terms of runtime efficiency and accuracy. In addition, we introduce a significance score allowing examiners to set a threshold and identify related documents.",
    "link": "http://arxiv.org/abs/2307.11496",
    "context": "Title: Identifying document similarity using a fast estimation of the Levenshtein Distance based on compression and signatures. (arXiv:2307.11496v1 [cs.IR])\nAbstract: Identifying document similarity has many applications, e.g., source code analysis or plagiarism detection. However, identifying similarities is not trivial and can be time complex. For instance, the Levenshtein Distance is a common metric to define the similarity between two documents but has quadratic runtime which makes it impractical for large documents where large starts with a few hundred kilobytes. In this paper, we present a novel concept that allows estimating the Levenshtein Distance: the algorithm first compresses documents to signatures (similar to hash values) using a user-defined compression ratio. Signatures can then be compared against each other (some constrains apply) where the outcome is the estimated Levenshtein Distance. Our evaluation shows promising results in terms of runtime efficiency and accuracy. In addition, we introduce a significance score allowing examiners to set a threshold and identify related documents.",
    "path": "papers/23/07/2307.11496.json",
    "total_tokens": 906,
    "translated_title": "使用基于压缩和签名的Levenshtein距离快速估计方法识别文档相似性",
    "translated_abstract": "识别文档相似性在诸如源代码分析或抄袭检测等应用中有许多应用。然而，识别相似性并非易事，可能具有复杂的时间复杂度。例如，Levenshtein距离是定义两个文档相似性的常见度量标准，但它具有二次运行时间，使其在大文档（以几百千字节开头的大文档）中不适用。在本文中，我们提出了一个新颖的概念，允许估计Levenshtein距离：算法首先使用用户定义的压缩比对文档进行签名（类似于哈希值）压缩。然后可以将签名相互比较（应用一些约束条件），结果就是估计的Levenshtein距离。我们的评估结果显示在运行时间效率和准确性方面都有令人期待的结果。此外，我们引入了一个显著度评分，允许评估人员设定阈值并识别相关文档。",
    "tldr": "该论文提出了一种通过压缩和签名快速估计Levenshtein距离的方法，用于识别文档相似性。实验结果表明，在运行时间效率和准确性方面具有很大的潜力。",
    "en_tdlr": "This paper presents a method for identifying document similarity by estimating the Levenshtein Distance using compression and signatures. The approach shows promising results in terms of runtime efficiency and accuracy."
}