{
    "title": "Multiobjective Hydropower Reservoir Operation Optimization with Transformer-Based Deep Reinforcement Learning. (arXiv:2307.05643v1 [cs.LG])",
    "abstract": "Due to shortage of water resources and increasing water demands, the joint operation of multireservoir systems for balancing power generation, ecological protection, and the residential water supply has become a critical issue in hydropower management. However, the numerous constraints and nonlinearity of multiple reservoirs make solving this problem time-consuming. To address this challenge, a deep reinforcement learning approach that incorporates a transformer framework is proposed. The multihead attention mechanism of the encoder effectively extracts information from reservoirs and residential areas, and the multireservoir attention network of the decoder generates suitable operational decisions. The proposed method is applied to Lake Mead and Lake Powell in the Colorado River Basin. The experimental results demonstrate that the transformer-based deep reinforcement learning approach can produce appropriate operational outcomes. Compared to a state-of-the-art method, the operation st",
    "link": "http://arxiv.org/abs/2307.05643",
    "context": "Title: Multiobjective Hydropower Reservoir Operation Optimization with Transformer-Based Deep Reinforcement Learning. (arXiv:2307.05643v1 [cs.LG])\nAbstract: Due to shortage of water resources and increasing water demands, the joint operation of multireservoir systems for balancing power generation, ecological protection, and the residential water supply has become a critical issue in hydropower management. However, the numerous constraints and nonlinearity of multiple reservoirs make solving this problem time-consuming. To address this challenge, a deep reinforcement learning approach that incorporates a transformer framework is proposed. The multihead attention mechanism of the encoder effectively extracts information from reservoirs and residential areas, and the multireservoir attention network of the decoder generates suitable operational decisions. The proposed method is applied to Lake Mead and Lake Powell in the Colorado River Basin. The experimental results demonstrate that the transformer-based deep reinforcement learning approach can produce appropriate operational outcomes. Compared to a state-of-the-art method, the operation st",
    "path": "papers/23/07/2307.05643.json",
    "total_tokens": 811,
    "translated_title": "使用基于Transformer的深度强化学习进行多目标水电站水库调度优化",
    "translated_abstract": "由于水资源短缺和水需求增加，多水库系统的联合运行以平衡发电、生态保护和居民用水供应已成为水电管理中的关键问题。然而，多个水库的众多约束和非线性性使得解决这个问题非常耗时。为了应对这一挑战，提出了一种融合Transformer框架的深度强化学习方法。编码器的多头注意力机制有效地从水库和居民区提取信息，解码器的多水库注意网络生成适当的运行决策。将该方法应用于科罗拉多河流域的梅德湖和鲍威尔湖。实验结果表明，基于Transformer的深度强化学习方法能够产生合适的运营结果。与最先进的方法相比，该方法的运行效果更好。",
    "tldr": "提出了一种使用基于Transformer的深度强化学习方法来优化多目标水电站水库调度问题。实验结果表明，该方法相较于最先进的方法具有更好的运行效果。",
    "en_tdlr": "A transformer-based deep reinforcement learning method is proposed for optimizing multiobjective hydropower reservoir operation. Experimental results demonstrate that this method outperforms state-of-the-art methods."
}