{
    "title": "Policy Expectation Counts? The Impact of Delayed Retirement Announcement on Urban Households Savings Rates. (arXiv:2307.02455v1 [econ.GN])",
    "abstract": "This article examines the effects of a delayed retirement announcement on households' savings behavior using data from China Family Panel Studies (CFPS). The article finds that treated households, on average, experience an 8% increase in savings rates as a result of the policy announcement. This estimation is both significant and robust. Different types of households exhibit varying degrees of responsiveness to the policy announcement, with higher-income households showing a greater impact. The increase in household savings can be attributed to negative perceptions about future pension income.",
    "link": "http://arxiv.org/abs/2307.02455",
    "context": "Title: Policy Expectation Counts? The Impact of Delayed Retirement Announcement on Urban Households Savings Rates. (arXiv:2307.02455v1 [econ.GN])\nAbstract: This article examines the effects of a delayed retirement announcement on households' savings behavior using data from China Family Panel Studies (CFPS). The article finds that treated households, on average, experience an 8% increase in savings rates as a result of the policy announcement. This estimation is both significant and robust. Different types of households exhibit varying degrees of responsiveness to the policy announcement, with higher-income households showing a greater impact. The increase in household savings can be attributed to negative perceptions about future pension income.",
    "path": "papers/23/07/2307.02455.json",
    "total_tokens": 683,
    "translated_title": "政策预期有关吗？延迟退休公告对城市家庭储蓄率的影响",
    "translated_abstract": "本文利用中国家庭追踪调查数据，研究了延迟退休公告对家庭储蓄行为的影响。研究发现，受到政策公告影响的家庭的储蓄率平均增加了8%。这个估计结果显著且稳健。不同类型的家庭对政策公告的响应程度不同，高收入家庭的影响更大。家庭储蓄的增加可以归因于对未来养老金收入的负面预期。",
    "tldr": "延迟退休公告对中国家庭的储蓄率产生了显著的影响，特别是对高收入家庭。这种影响与人们对未来养老金收入的负面预期有关。",
    "en_tdlr": "The delayed retirement announcement has a significant impact on households' savings rates in China, especially for higher-income households, which is attributed to negative perceptions about future pension income."
}