{
    "title": "DAPrompt: Deterministic Assumption Prompt Learning for Event Causality Identification. (arXiv:2307.09813v1 [cs.CL])",
    "abstract": "Event Causality Identification (ECI) aims at determining whether there is a causal relation between two event mentions. Conventional prompt learning designs a prompt template to first predict an answer word and then maps it to the final decision. Unlike conventional prompts, we argue that predicting an answer word may not be a necessary prerequisite for the ECI task. Instead, we can first make a deterministic assumption on the existence of causal relation between two events and then evaluate its rationality to either accept or reject the assumption. The design motivation is to try the most utilization of the encyclopedia-like knowledge embedded in a pre-trained language model. In light of such considerations, we propose a deterministic assumption prompt learning model, called DAPrompt, for the ECI task. In particular, we design a simple deterministic assumption template concatenating with the input event pair, which includes two masks as predicted events' tokens. We use the probabiliti",
    "link": "http://arxiv.org/abs/2307.09813",
    "context": "Title: DAPrompt: Deterministic Assumption Prompt Learning for Event Causality Identification. (arXiv:2307.09813v1 [cs.CL])\nAbstract: Event Causality Identification (ECI) aims at determining whether there is a causal relation between two event mentions. Conventional prompt learning designs a prompt template to first predict an answer word and then maps it to the final decision. Unlike conventional prompts, we argue that predicting an answer word may not be a necessary prerequisite for the ECI task. Instead, we can first make a deterministic assumption on the existence of causal relation between two events and then evaluate its rationality to either accept or reject the assumption. The design motivation is to try the most utilization of the encyclopedia-like knowledge embedded in a pre-trained language model. In light of such considerations, we propose a deterministic assumption prompt learning model, called DAPrompt, for the ECI task. In particular, we design a simple deterministic assumption template concatenating with the input event pair, which includes two masks as predicted events' tokens. We use the probabiliti",
    "path": "papers/23/07/2307.09813.json",
    "total_tokens": 958,
    "translated_title": "DAPrompt: 事件因果关系识别的确定性假设提示学习",
    "translated_abstract": "事件因果关系识别（ECI）旨在确定两个事件提及之间是否存在因果关系。传统的提示学习设计了一个提示模板，首先预测一个答案词，然后将其映射到最终的决策。与传统提示不同，我们认为预测一个答案词可能不是ECI任务的必要先决条件。相反，我们可以首先对两个事件之间是否存在因果关系进行确定性假设，然后评估其合理性，接受或拒绝该假设。设计的动机是尽可能地利用预训练语言模型中嵌入的类百科知识。基于这些考虑，我们提出了一种确定性假设提示学习模型，称为DAPrompt，用于ECI任务。特别地，我们设计了一个简单的确定性假设模板，该模板与输入的事件对进行连接，其中包括两个掩码作为预测事件的标记。我们使用概率来衡量确定性假设的合理性。",
    "tldr": "这篇论文提出了一个名为DAPrompt的确定性假设提示学习模型，用于事件因果关系识别任务。与传统提示学习不同，该模型首先基于确定性假设对事件之间的因果关系进行评估，而不是预测答案词。通过利用预训练语言模型中的类百科知识，该模型可以更好地解决ECI任务。",
    "en_tdlr": "This paper introduces a deterministic assumption prompt learning model called DAPrompt for event causality identification. Unlike conventional prompt learning, this model first evaluates the causal relation between events based on deterministic assumptions instead of predicting answer words. By leveraging the encyclopedia-like knowledge embedded in pre-trained language models, this model improves the performance of ECI task."
}