{
    "title": "Complying with the EU AI Act. (arXiv:2307.10458v1 [cs.AI])",
    "abstract": "The EU AI Act is the proposed EU legislation concerning AI systems. This paper identifies several categories of the AI Act. Based on this categorization, a questionnaire is developed that serves as a tool to offer insights by creating quantitative data. Analysis of the data shows various challenges for organizations in different compliance categories. The influence of organization characteristics, such as size and sector, is examined to determine the impact on compliance. The paper will also share qualitative data on which questions were prevalent among respondents, both on the content of the AI Act as the application. The paper concludes by stating that there is still room for improvement in terms of compliance with the AIA and refers to a related project that examines a solution to help these organizations.",
    "link": "http://arxiv.org/abs/2307.10458",
    "context": "Title: Complying with the EU AI Act. (arXiv:2307.10458v1 [cs.AI])\nAbstract: The EU AI Act is the proposed EU legislation concerning AI systems. This paper identifies several categories of the AI Act. Based on this categorization, a questionnaire is developed that serves as a tool to offer insights by creating quantitative data. Analysis of the data shows various challenges for organizations in different compliance categories. The influence of organization characteristics, such as size and sector, is examined to determine the impact on compliance. The paper will also share qualitative data on which questions were prevalent among respondents, both on the content of the AI Act as the application. The paper concludes by stating that there is still room for improvement in terms of compliance with the AIA and refers to a related project that examines a solution to help these organizations.",
    "path": "papers/23/07/2307.10458.json",
    "total_tokens": 799,
    "translated_title": "遵守欧盟AI法案",
    "translated_abstract": "欧盟AI法案是关于AI系统的欧盟拟议立法。本文识别了几个AI法案的类别，并基于此分类制定了一份问卷作为提供见解的工具，通过创建定量数据。数据分析显示了不同合规类别下组织面临的各种挑战。还考察了组织特征（如规模和行业）对合规的影响，并分享了关于被调查者普遍关注的问题的定性数据，包括AI法案的内容和应用。文章得出结论，认为在遵守欧盟AI法案方面仍有改进空间，并提到了一个相关项目，该项目研究了帮助这些组织的解决方案。",
    "tldr": "本文识别了欧盟AI法案的不同类别，并开发了一份问卷来提供定量数据，分析发现不同合规类别下组织面临的挑战，同时考察了组织特征对合规的影响，旨在改进遵守欧盟AI法案，并提出了一个相关解决方案的项目。",
    "en_tdlr": "This paper identifies different categories of the proposed EU AI Act and develops a questionnaire to provide quantitative data. It analyzes the challenges faced by organizations in different compliance categories and examines the impact of organizational characteristics on compliance. The paper aims to improve compliance with the EU AI Act and refers to a related project that offers a solution."
}