{
    "title": "A Self-Supervised Algorithm for Denoising Photoplethysmography Signals for Heart Rate Estimation from Wearables. (arXiv:2307.05339v1 [eess.SP])",
    "abstract": "Smart watches and other wearable devices are equipped with photoplethysmography (PPG) sensors for monitoring heart rate and other aspects of cardiovascular health. However, PPG signals collected from such devices are susceptible to corruption from noise and motion artifacts, which cause errors in heart rate estimation. Typical denoising approaches filter or reconstruct the signal in ways that eliminate much of the morphological information, even from the clean parts of the signal that would be useful to preserve. In this work, we develop an algorithm for denoising PPG signals that reconstructs the corrupted parts of the signal, while preserving the clean parts of the PPG signal. Our novel framework relies on self-supervised training, where we leverage a large database of clean PPG signals to train a denoising autoencoder. As we show, our reconstructed signals provide better estimates of heart rate from PPG signals than the leading heart rate estimation methods. Further experiments show",
    "link": "http://arxiv.org/abs/2307.05339",
    "context": "Title: A Self-Supervised Algorithm for Denoising Photoplethysmography Signals for Heart Rate Estimation from Wearables. (arXiv:2307.05339v1 [eess.SP])\nAbstract: Smart watches and other wearable devices are equipped with photoplethysmography (PPG) sensors for monitoring heart rate and other aspects of cardiovascular health. However, PPG signals collected from such devices are susceptible to corruption from noise and motion artifacts, which cause errors in heart rate estimation. Typical denoising approaches filter or reconstruct the signal in ways that eliminate much of the morphological information, even from the clean parts of the signal that would be useful to preserve. In this work, we develop an algorithm for denoising PPG signals that reconstructs the corrupted parts of the signal, while preserving the clean parts of the PPG signal. Our novel framework relies on self-supervised training, where we leverage a large database of clean PPG signals to train a denoising autoencoder. As we show, our reconstructed signals provide better estimates of heart rate from PPG signals than the leading heart rate estimation methods. Further experiments show",
    "path": "papers/23/07/2307.05339.json",
    "total_tokens": 1049,
    "translated_title": "用于从可穿戴设备中去噪光电容/容积描记信号以估计心率的自监督算法",
    "translated_abstract": "智能手表和其他可穿戴设备配备了光电容/容积描记（PPG）传感器，用于监测心率和其他心血管健康指标。然而，从这些设备收集的PPG信号容易受到噪声和运动伪迹的干扰，导致心率估计误差。传统的去噪方法往往会以过滤或重构的方式处理信号，这样会导致信号的形态信息丢失，即使是对于原本干净的信号部分而言，也会有用的信息被丢失。在这项工作中，我们开发了一种用于去噪PPG信号的算法，可以重构受损信号的部分，同时保留PPG信号的干净部分。我们的创新框架基于自监督训练，利用大量的干净PPG信号数据库来训练去噪自动编码器。正如我们所展示的，我们重构的信号提供了比领先的心率估计方法更好的PPG信号心率估计结果。进一步的实验显示...",
    "tldr": "提出了一种自监督算法，用于从可穿戴设备收集的PPG信号中去噪以估计心率。该算法通过重构受损信号部分和保留干净信号部分的方式进行去噪，并通过利用干净PPG信号训练自动编码器来实现。实验结果表明我们的算法在PPG信号心率估计方面优于传统方法。",
    "en_tdlr": "A self-supervised algorithm is proposed to denoise photoplethysmography (PPG) signals collected from wearables for heart rate estimation. The algorithm reconstructs the corrupted parts and preserves the clean parts of the signal, utilizing a denoising autoencoder trained on a large database of clean PPG signals. Experimental results show that our algorithm outperforms traditional methods in heart rate estimation from PPG signals."
}