{
    "title": "Stochastic Step-wise Feature Selection for Exponential Random Graph Models (ERGMs). (arXiv:2307.12862v1 [cs.SI])",
    "abstract": "Statistical analysis of social networks provides valuable insights into complex network interactions across various scientific disciplines. However, accurate modeling of networks remains challenging due to the heavy computational burden and the need to account for observed network dependencies. Exponential Random Graph Models (ERGMs) have emerged as a promising technique used in social network modeling to capture network dependencies by incorporating endogenous variables. Nevertheless, using ERGMs poses multiple challenges, including the occurrence of ERGM degeneracy, which generates unrealistic and meaningless network structures. To address these challenges and enhance the modeling of collaboration networks, we propose and test a novel approach that focuses on endogenous variable selection within ERGMs. Our method aims to overcome the computational burden and improve the accommodation of observed network dependencies, thereby facilitating more accurate and meaningful interpretations o",
    "link": "http://arxiv.org/abs/2307.12862",
    "context": "Title: Stochastic Step-wise Feature Selection for Exponential Random Graph Models (ERGMs). (arXiv:2307.12862v1 [cs.SI])\nAbstract: Statistical analysis of social networks provides valuable insights into complex network interactions across various scientific disciplines. However, accurate modeling of networks remains challenging due to the heavy computational burden and the need to account for observed network dependencies. Exponential Random Graph Models (ERGMs) have emerged as a promising technique used in social network modeling to capture network dependencies by incorporating endogenous variables. Nevertheless, using ERGMs poses multiple challenges, including the occurrence of ERGM degeneracy, which generates unrealistic and meaningless network structures. To address these challenges and enhance the modeling of collaboration networks, we propose and test a novel approach that focuses on endogenous variable selection within ERGMs. Our method aims to overcome the computational burden and improve the accommodation of observed network dependencies, thereby facilitating more accurate and meaningful interpretations o",
    "path": "papers/23/07/2307.12862.json",
    "total_tokens": 829,
    "translated_title": "Stochastic Step-wise Feature Selection for Exponential Random Graph Models (ERGMs)",
    "translated_abstract": "社交网络的统计分析为各个科学领域提供了宝贵的见解，然而，由于计算负担沉重且需要考虑观察到的网络依赖关系，准确建模网络仍具有挑战性。指数随机图模型（ERGM）作为一种有前景的技术，在社交网络建模中应用于捕捉通过整合内生变量来体现网络依赖关系。然而，使用ERGM存在多个挑战，包括ERGM退化问题，从而生成不现实且毫无意义的网络结构。为了解决这些挑战并增强协作网络的建模能力，我们提出并测试了一种新方法，该方法专注于ERGM内生变量的选择。我们的方法旨在应对计算负担，并改善对观察到的网络依赖关系的适应性，从而促进更准确和有意义的解释。",
    "tldr": "该论文提出了一种基于随机步进特征选择的指数随机图模型 (ERGMs) 方法，用于解决社交网络建模中的多个挑战并增强模型的准确性和可解释性。",
    "en_tdlr": "This paper proposes a novel approach based on stochastic step-wise feature selection for Exponential Random Graph Models (ERGMs) to address challenges in social network modeling and improve model accuracy and interpretability."
}