{
    "title": "Modeling Tag Prediction based on Question Tagging Behavior Analysis of CommunityQA Platform Users. (arXiv:2307.01420v1 [cs.CL])",
    "abstract": "In community question-answering platforms, tags play essential roles in effective information organization and retrieval, better question routing, faster response to questions, and assessment of topic popularity. Hence, automatic assistance for predicting and suggesting tags for posts is of high utility to users of such platforms. To develop better tag prediction across diverse communities and domains, we performed a thorough analysis of users' tagging behavior in 17 StackExchange communities. We found various common inherent properties of this behavior in those diverse domains. We used the findings to develop a flexible neural tag prediction architecture, which predicts both popular tags and more granular tags for each question. Our extensive experiments and obtained performance show the effectiveness of our model",
    "link": "http://arxiv.org/abs/2307.01420",
    "context": "Title: Modeling Tag Prediction based on Question Tagging Behavior Analysis of CommunityQA Platform Users. (arXiv:2307.01420v1 [cs.CL])\nAbstract: In community question-answering platforms, tags play essential roles in effective information organization and retrieval, better question routing, faster response to questions, and assessment of topic popularity. Hence, automatic assistance for predicting and suggesting tags for posts is of high utility to users of such platforms. To develop better tag prediction across diverse communities and domains, we performed a thorough analysis of users' tagging behavior in 17 StackExchange communities. We found various common inherent properties of this behavior in those diverse domains. We used the findings to develop a flexible neural tag prediction architecture, which predicts both popular tags and more granular tags for each question. Our extensive experiments and obtained performance show the effectiveness of our model",
    "path": "papers/23/07/2307.01420.json",
    "total_tokens": 787,
    "translated_title": "基于社区问答平台用户标签行为分析的标签预测模型",
    "translated_abstract": "在社区问答平台中，标签在有效的信息组织和检索、更好的问题路由、更快的问题响应以及话题热度评估方面都起着重要作用。因此，对于这类平台的用户来说，预测和建议帖子的标签是非常有用的自动辅助功能。为了在不同的社区和领域中开发更好的标签预测模型，我们对17个StackExchange社区的用户标签行为进行了深入分析。我们发现了这些不同领域中用户标签行为的一些共同属性。我们利用这些发现开发了一个灵活的神经网络标签预测架构，可以预测每个问题的热门标签和更细粒度的标签。我们的大量实验和获得的性能表明了我们模型的有效性。",
    "tldr": "本研究通过对17个StackExchange社区用户的标签行为进行分析，开发了一个灵活的神经网络标签预测架构，可以预测每个问题的热门标签和更细粒度的标签。"
}