{
    "title": "TMPNN: High-Order Polynomial Regression Based on Taylor Map Factorization. (arXiv:2307.16105v1 [cs.LG])",
    "abstract": "Polynomial regression is widely used and can help to express nonlinear patterns. However, considering very high polynomial orders may lead to overfitting and poor extrapolation ability for unseen data. The paper presents a method for constructing a high-order polynomial regression based on the Taylor map factorization. This method naturally implements multi-target regression and can capture internal relationships between targets. Additionally, we introduce an approach for model interpretation in the form of systems of differential equations. By benchmarking on UCI open access datasets, Feynman symbolic regression datasets, and Friedman-1 datasets, we demonstrate that the proposed method performs comparable to the state-of-the-art regression methods and outperforms them on specific tasks.",
    "link": "http://arxiv.org/abs/2307.16105",
    "context": "Title: TMPNN: High-Order Polynomial Regression Based on Taylor Map Factorization. (arXiv:2307.16105v1 [cs.LG])\nAbstract: Polynomial regression is widely used and can help to express nonlinear patterns. However, considering very high polynomial orders may lead to overfitting and poor extrapolation ability for unseen data. The paper presents a method for constructing a high-order polynomial regression based on the Taylor map factorization. This method naturally implements multi-target regression and can capture internal relationships between targets. Additionally, we introduce an approach for model interpretation in the form of systems of differential equations. By benchmarking on UCI open access datasets, Feynman symbolic regression datasets, and Friedman-1 datasets, we demonstrate that the proposed method performs comparable to the state-of-the-art regression methods and outperforms them on specific tasks.",
    "path": "papers/23/07/2307.16105.json",
    "total_tokens": 783,
    "translated_title": "TMPNN: 基于Taylor映射因式分解的高阶多项式回归",
    "translated_abstract": "多项式回归被广泛应用于表达非线性模式。然而，考虑到很高的多项式阶数可能导致过拟合和对未见数据的拟合能力差。本文提出了一种基于Taylor映射因式分解构建高阶多项式回归的方法。该方法自然地实现了多目标回归，并能捕捉目标之间的内在关系。此外，我们介绍了一种模型解释方法，以微分方程系统的形式呈现。通过在UCI开放数据集，Feynman象征回归数据集和Friedman-1数据集上进行基准测试，我们证明了提出的方法与最先进的回归方法相当，并在特定任务上表现出色。",
    "tldr": "本文提出了一种基于Taylor映射因式分解的高阶多项式回归方法，可以实现多目标回归和捕捉目标之间的内在关系。通过在不同的数据集上进行基准测试，表明该方法在特定任务上优于其他回归方法。"
}