{
    "title": "PyTAG: Challenges and Opportunities for Reinforcement Learning in Tabletop Games. (arXiv:2307.09905v1 [cs.AI])",
    "abstract": "In recent years, Game AI research has made important breakthroughs using Reinforcement Learning (RL). Despite this, RL for modern tabletop games has gained little to no attention, even when they offer a range of unique challenges compared to video games. To bridge this gap, we introduce PyTAG, a Python API for interacting with the Tabletop Games framework (TAG). TAG contains a growing set of more than 20 modern tabletop games, with a common API for AI agents. We present techniques for training RL agents in these games and introduce baseline results after training Proximal Policy Optimisation algorithms on a subset of games. Finally, we discuss the unique challenges complex modern tabletop games provide, now open to RL research through PyTAG.",
    "link": "http://arxiv.org/abs/2307.09905",
    "context": "Title: PyTAG: Challenges and Opportunities for Reinforcement Learning in Tabletop Games. (arXiv:2307.09905v1 [cs.AI])\nAbstract: In recent years, Game AI research has made important breakthroughs using Reinforcement Learning (RL). Despite this, RL for modern tabletop games has gained little to no attention, even when they offer a range of unique challenges compared to video games. To bridge this gap, we introduce PyTAG, a Python API for interacting with the Tabletop Games framework (TAG). TAG contains a growing set of more than 20 modern tabletop games, with a common API for AI agents. We present techniques for training RL agents in these games and introduce baseline results after training Proximal Policy Optimisation algorithms on a subset of games. Finally, we discuss the unique challenges complex modern tabletop games provide, now open to RL research through PyTAG.",
    "path": "papers/23/07/2307.09905.json",
    "total_tokens": 837,
    "translated_title": "PyTAG：强化学习在桌面游戏中的挑战与机遇",
    "translated_abstract": "近年来，游戏人工智能研究使用强化学习取得了重要突破。然而，相比视频游戏，现代桌面游戏在强化学习方面鲜有关注，尽管它们提供了一系列与众不同的挑战。为了弥补这一差距，我们介绍了PyTAG，该Python API用于与Tabletop Games framework (TAG)进行交互。TAG包含了超过20个现代桌面游戏，并提供了一个公共API供AI代理使用。我们介绍了在这些游戏中训练强化学习代理的技术，并在部分游戏上使用Proximal Policy Optimisation算法进行基准结果的训练。最后，我们讨论了复杂现代桌面游戏提供的独特挑战，并介绍了通过PyTAG进行强化学习研究的机会。",
    "tldr": "PyTAG是一个用于在桌面游戏中进行强化学习研究的Python API。它提供了与Tabletop Games framework (TAG)进行交互的功能，并介绍了在现代桌面游戏中训练强化学习代理的技术和基准结果。",
    "en_tdlr": "PyTAG is a Python API for conducting reinforcement learning research in tabletop games. It provides the capability to interact with the Tabletop Games framework (TAG) and introduces techniques and baseline results for training RL agents in modern tabletop games."
}