{
    "title": "Probabilistic Modeling of Inter- and Intra-observer Variability in Medical Image Segmentation. (arXiv:2307.11397v1 [eess.IV])",
    "abstract": "Medical image segmentation is a challenging task, particularly due to interand intra-observer variability, even between medical experts. In this paper, we propose a novel model, called Probabilistic Inter-Observer and iNtra-Observer variation NetwOrk (Pionono). It captures the labeling behavior of each rater with a multidimensional probability distribution and integrates this information with the feature maps of the image to produce probabilistic segmentation predictions. The model is optimized by variational inference and can be trained end-to-end. It outperforms state-of-the-art models such as STAPLE, Probabilistic U-Net, and models based on confusion matrices. Additionally, Pionono predicts multiple coherent segmentation maps that mimic the rater's expert opinion, which provides additional valuable information for the diagnostic process. Experiments on real-world cancer segmentation datasets demonstrate the high accuracy and efficiency of Pionono, making it a powerful tool for med",
    "link": "http://arxiv.org/abs/2307.11397",
    "context": "Title: Probabilistic Modeling of Inter- and Intra-observer Variability in Medical Image Segmentation. (arXiv:2307.11397v1 [eess.IV])\nAbstract: Medical image segmentation is a challenging task, particularly due to interand intra-observer variability, even between medical experts. In this paper, we propose a novel model, called Probabilistic Inter-Observer and iNtra-Observer variation NetwOrk (Pionono). It captures the labeling behavior of each rater with a multidimensional probability distribution and integrates this information with the feature maps of the image to produce probabilistic segmentation predictions. The model is optimized by variational inference and can be trained end-to-end. It outperforms state-of-the-art models such as STAPLE, Probabilistic U-Net, and models based on confusion matrices. Additionally, Pionono predicts multiple coherent segmentation maps that mimic the rater's expert opinion, which provides additional valuable information for the diagnostic process. Experiments on real-world cancer segmentation datasets demonstrate the high accuracy and efficiency of Pionono, making it a powerful tool for med",
    "path": "papers/23/07/2307.11397.json",
    "total_tokens": 1035,
    "translated_title": "医学图像分割中的观察者间和观察者内变异的概率建模",
    "translated_abstract": "医学图像分割是一项具有挑战性的任务，特别是由于观察者间和观察者内的变异性，即使是在医学专家之间也存在。在本文中，我们提出了一种新颖的模型，称为概率观察者间和观察者内变异网络（Pionono）。它通过多维概率分布捕捉每个标记者的标记行为，并将此信息与图像的特征图集成起来，产生概率分割预测。该模型通过变分推断进行优化，并可以端到端地进行训练。它在STAPLE、概率U-Net和基于混淆矩阵的模型等最先进的模型上表现出色。此外，Pionono预测多个一致的分割图，模拟了评分者的专业意见，为诊断过程提供了额外的有价值信息。在真实的癌症分割数据集上的实验证明了Pionono的高准确性和效率，使其成为一种强大的医学工具。",
    "tldr": "本文提出了一种新颖的概率模型Pionono，用于医学图像分割中的观察者间和观察者内变异。该模型通过捕捉每个标记者的标记行为并将其与图像特征集成，产生概率分割预测。实验证明Pionono在准确性和效率上优于现有模型，并且可以预测多个一致的分割图，为诊断过程提供了宝贵的信息。",
    "en_tdlr": "This paper proposes a novel probabilistic model, Pionono, for the inter- and intra-observer variability in medical image segmentation. The model captures the labeling behavior of each rater and integrates it with image features to generate probabilistic segmentation predictions. Experiments demonstrate that Pionono outperforms state-of-the-art models and provides valuable information for the diagnostic process by predicting multiple coherent segmentation maps."
}