{
    "title": "Entity Identifier: A Natural Text Parsing-based Framework For Entity Relation Extraction. (arXiv:2307.04892v1 [cs.CL])",
    "abstract": "The field of programming has a diversity of paradigms that are used according to the working framework. While current neural code generation methods are able to learn and generate code directly from text, we believe that this approach is not optimal for certain code tasks, particularly the generation of classes in an object-oriented project. Specifically, we use natural language processing techniques to extract structured information from requirements descriptions, in order to automate the generation of CRUD (Create, Read, Update, Delete) class code. To facilitate this process, we introduce a pipeline for extracting entity and relation information, as well as a representation called an \"Entity Tree\" to model this information. We also create a dataset to evaluate the effectiveness of our approach.",
    "link": "http://arxiv.org/abs/2307.04892",
    "context": "Title: Entity Identifier: A Natural Text Parsing-based Framework For Entity Relation Extraction. (arXiv:2307.04892v1 [cs.CL])\nAbstract: The field of programming has a diversity of paradigms that are used according to the working framework. While current neural code generation methods are able to learn and generate code directly from text, we believe that this approach is not optimal for certain code tasks, particularly the generation of classes in an object-oriented project. Specifically, we use natural language processing techniques to extract structured information from requirements descriptions, in order to automate the generation of CRUD (Create, Read, Update, Delete) class code. To facilitate this process, we introduce a pipeline for extracting entity and relation information, as well as a representation called an \"Entity Tree\" to model this information. We also create a dataset to evaluate the effectiveness of our approach.",
    "path": "papers/23/07/2307.04892.json",
    "total_tokens": 762,
    "translated_title": "实体标识符：基于自然文本解析的实体关系提取框架",
    "translated_abstract": "编程领域有多种范式，根据工作框架使用不同的范式。虽然当前的神经代码生成方法能够直接从文本中学习和生成代码，但我们认为这种方法对某些代码任务并不是最优的，特别是面向对象项目中的类生成。具体而言，我们使用自然语言处理技术从需求描述中提取结构化信息，以自动化生成CRUD（创建、读取、更新、删除）类代码。为了简化这个过程，我们引入了提取实体和关系信息的流水线，以及一种称为“实体树”的表示形式来建模这些信息。我们还创建了一个数据集来评估我们方法的效果。",
    "tldr": "本研究提出了一种基于自然文本解析的实体关系提取框架，通过使用自然语言处理技术从需求描述中提取结构化信息，并使用实体树来建模这些信息，实现了自动化生成CRUD类代码的目标。"
}