{
    "title": "Spectrum-guided Multi-granularity Referring Video Object Segmentation. (arXiv:2307.13537v1 [cs.CV])",
    "abstract": "Current referring video object segmentation (R-VOS) techniques extract conditional kernels from encoded (low-resolution) vision-language features to segment the decoded high-resolution features. We discovered that this causes significant feature drift, which the segmentation kernels struggle to perceive during the forward computation. This negatively affects the ability of segmentation kernels. To address the drift problem, we propose a Spectrum-guided Multi-granularity (SgMg) approach, which performs direct segmentation on the encoded features and employs visual details to further optimize the masks. In addition, we propose Spectrum-guided Cross-modal Fusion (SCF) to perform intra-frame global interactions in the spectral domain for effective multimodal representation. Finally, we extend SgMg to perform multi-object R-VOS, a new paradigm that enables simultaneous segmentation of multiple referred objects in a video. This not only makes R-VOS faster, but also more practical. Extensive ",
    "link": "http://arxiv.org/abs/2307.13537",
    "context": "Title: Spectrum-guided Multi-granularity Referring Video Object Segmentation. (arXiv:2307.13537v1 [cs.CV])\nAbstract: Current referring video object segmentation (R-VOS) techniques extract conditional kernels from encoded (low-resolution) vision-language features to segment the decoded high-resolution features. We discovered that this causes significant feature drift, which the segmentation kernels struggle to perceive during the forward computation. This negatively affects the ability of segmentation kernels. To address the drift problem, we propose a Spectrum-guided Multi-granularity (SgMg) approach, which performs direct segmentation on the encoded features and employs visual details to further optimize the masks. In addition, we propose Spectrum-guided Cross-modal Fusion (SCF) to perform intra-frame global interactions in the spectral domain for effective multimodal representation. Finally, we extend SgMg to perform multi-object R-VOS, a new paradigm that enables simultaneous segmentation of multiple referred objects in a video. This not only makes R-VOS faster, but also more practical. Extensive ",
    "path": "papers/23/07/2307.13537.json",
    "total_tokens": 1017,
    "translated_title": "光谱引导的多粒度参考视频对象分割",
    "translated_abstract": "当前的参考视频对象分割（R-VOS）技术从编码（低分辨率）的视觉-语言特征中提取条件核，用于分割解码后的高分辨率特征。我们发现这会导致显著的特征漂移，使得分割核在正向计算过程中难以察觉。这对分割核的能力产生了负面影响。为了解决漂移问题，我们提出了一种光谱引导的多粒度（SgMg）方法，该方法对编码特征进行直接分割，并使用视觉细节进一步优化掩膜。此外，我们提出了光谱引导的跨模态融合（SCF），在频谱域中执行帧内全局交互，实现有效的多模态表示。最后，我们将SgMg扩展到执行多对象R-VOS，这是一种新的范式，可以同时分割视频中的多个参考对象。这不仅使R-VOS变得更快，而且更实用。",
    "tldr": "本论文提出了一种光谱引导的多粒度参考视频对象分割方法，用于解决当前参考视频对象分割中的特征漂移问题。通过直接分割编码特征，并利用视觉细节优化掩膜，以及在频谱域中进行跨模态融合，实现了更有效的多模态表示。最终，将该方法扩展到多对象R-VOS，实现了同时分割视频中多个参考对象的功能，使得R-VOS更快速、更实用。",
    "en_tdlr": "This paper proposes a spectrum-guided multi-granularity approach for referring video object segmentation, addressing the feature drift problem. By directly segmenting the encoded features, optimizing the masks with visual details, and performing cross-modal fusion in the spectral domain, it achieves more effective multimodal representation. Furthermore, it extends to multi-object R-VOS, enabling simultaneous segmentation of multiple referred objects in videos, making R-VOS faster and more practical."
}