{
    "title": "Unlocking Carbon Reduction Potential with Reinforcement Learning for the Three-Dimensional Loading Capacitated Vehicle Routing Problem. (arXiv:2307.12136v1 [cs.LG])",
    "abstract": "Heavy goods vehicles are vital backbones of the supply chain delivery system but also contribute significantly to carbon emissions with only 60% loading efficiency in the United Kingdom. Collaborative vehicle routing has been proposed as a solution to increase efficiency, but challenges remain to make this a possibility. One key challenge is the efficient computation of viable solutions for co-loading and routing. Current operations research methods suffer from non-linear scaling with increasing problem size and are therefore bound to limited geographic areas to compute results in time for day-to-day operations. This only allows for local optima in routing and leaves global optimisation potential untouched. We develop a reinforcement learning model to solve the three-dimensional loading capacitated vehicle routing problem in approximately linear time. While this problem has been studied extensively in operations research, no publications on solving it with reinforcement learning exist.",
    "link": "http://arxiv.org/abs/2307.12136",
    "context": "Title: Unlocking Carbon Reduction Potential with Reinforcement Learning for the Three-Dimensional Loading Capacitated Vehicle Routing Problem. (arXiv:2307.12136v1 [cs.LG])\nAbstract: Heavy goods vehicles are vital backbones of the supply chain delivery system but also contribute significantly to carbon emissions with only 60% loading efficiency in the United Kingdom. Collaborative vehicle routing has been proposed as a solution to increase efficiency, but challenges remain to make this a possibility. One key challenge is the efficient computation of viable solutions for co-loading and routing. Current operations research methods suffer from non-linear scaling with increasing problem size and are therefore bound to limited geographic areas to compute results in time for day-to-day operations. This only allows for local optima in routing and leaves global optimisation potential untouched. We develop a reinforcement learning model to solve the three-dimensional loading capacitated vehicle routing problem in approximately linear time. While this problem has been studied extensively in operations research, no publications on solving it with reinforcement learning exist.",
    "path": "papers/23/07/2307.12136.json",
    "total_tokens": 875,
    "translated_title": "利用强化学习释放三维装载有限车辆路径问题的碳减排潜力",
    "translated_abstract": "重型货车是供应链交付系统的重要支柱，但在英国仅具有60％的装载效率，对碳排放有显著贡献。协同车辆路径规划被提出作为提高效率的解决方案，但仍面临挑战。一个关键挑战是有效计算共载和路径的可行解决方案。当前的运筹学方法在问题规模增大时存在非线性扩展，因此只能限于在有限的地理范围内计算结果以满足日常运营的时间要求。这仅允许在路径规划上寻找局部最优解，无法实现全局优化潜力。我们开发了一个强化学习模型来近线性时间解决三维装载有限车辆路径问题。虽然此问题在运筹学中得到了广泛研究，但没有关于用强化学习解决该问题的出版物存在。",
    "tldr": "该论文提出了一个利用强化学习方法解决三维装载有限车辆路径问题的模型，该方法能够在线性时间内有效计算共载和路径的可行解决方案，从而释放了碳减排的潜力。",
    "en_tdlr": "This paper presents a model that utilizes reinforcement learning to solve the three-dimensional loading capacitated vehicle routing problem, allowing for efficient computation of viable solutions for co-loading and routing in linear time, thus unlocking the potential for carbon reduction."
}