{
    "title": "CohortGPT: An Enhanced GPT for Participant Recruitment in Clinical Study. (arXiv:2307.11346v1 [cs.CL])",
    "abstract": "Participant recruitment based on unstructured medical texts such as clinical notes and radiology reports has been a challenging yet important task for the cohort establishment in clinical research. Recently, Large Language Models (LLMs) such as ChatGPT have achieved tremendous success in various downstream tasks thanks to their promising performance in language understanding, inference, and generation. It is then natural to test their feasibility in solving the cohort recruitment task, which involves the classification of a given paragraph of medical text into disease label(s). However, when applied to knowledge-intensive problem settings such as medical text classification, where the LLMs are expected to understand the decision made by human experts and accurately identify the implied disease labels, the LLMs show a mediocre performance. A possible explanation is that, by only using the medical text, the LLMs neglect to use the rich context of additional information that languages aff",
    "link": "http://arxiv.org/abs/2307.11346",
    "context": "Title: CohortGPT: An Enhanced GPT for Participant Recruitment in Clinical Study. (arXiv:2307.11346v1 [cs.CL])\nAbstract: Participant recruitment based on unstructured medical texts such as clinical notes and radiology reports has been a challenging yet important task for the cohort establishment in clinical research. Recently, Large Language Models (LLMs) such as ChatGPT have achieved tremendous success in various downstream tasks thanks to their promising performance in language understanding, inference, and generation. It is then natural to test their feasibility in solving the cohort recruitment task, which involves the classification of a given paragraph of medical text into disease label(s). However, when applied to knowledge-intensive problem settings such as medical text classification, where the LLMs are expected to understand the decision made by human experts and accurately identify the implied disease labels, the LLMs show a mediocre performance. A possible explanation is that, by only using the medical text, the LLMs neglect to use the rich context of additional information that languages aff",
    "path": "papers/23/07/2307.11346.json",
    "total_tokens": 818,
    "translated_title": "CohortGPT：一种用于临床研究参与者招募的增强型GPT",
    "translated_abstract": "基于非结构化医疗文本（如临床记录和放射学报告）进行参与者招募是临床研究中具有挑战性但重要的任务。最近，大型语言模型（LLMs）如ChatGPT在语言理解、推理和生成方面取得了巨大成功。因此，有必要测试它们在解决临床研究中的参与者招募任务中的可行性。然而，当应用于知识密集型问题设置（如医疗文本分类）时，LLMs的性能一般。可能的解释是LLMs仅使用医疗文本，忽略了语言中丰富的上下文信息。",
    "tldr": "CohortGPT是一种增强型GPT，用于解决临床研究中的参与者招募任务。此研究发现传统的大型语言模型在医疗文本分类中的性能一般，这可能是由于它们忽略了语言中的上下文信息。"
}