{
    "title": "Random Walk on Multiple Networks. (arXiv:2307.01637v1 [cs.SI])",
    "abstract": "Random Walk is a basic algorithm to explore the structure of networks, which can be used in many tasks, such as local community detection and network embedding. Existing random walk methods are based on single networks that contain limited information. In contrast, real data often contain entities with different types or/and from different sources, which are comprehensive and can be better modeled by multiple networks. To take advantage of rich information in multiple networks and make better inferences on entities, in this study, we propose random walk on multiple networks, RWM. RWM is flexible and supports both multiplex networks and general multiple networks, which may form many-to-many node mappings between networks. RWM sends a random walker on each network to obtain the local proximity (i.e., node visiting probabilities) w.r.t. the starting nodes. Walkers with similar visiting probabilities reinforce each other. We theoretically analyze the convergence properties of RWM. Two appr",
    "link": "http://arxiv.org/abs/2307.01637",
    "context": "Title: Random Walk on Multiple Networks. (arXiv:2307.01637v1 [cs.SI])\nAbstract: Random Walk is a basic algorithm to explore the structure of networks, which can be used in many tasks, such as local community detection and network embedding. Existing random walk methods are based on single networks that contain limited information. In contrast, real data often contain entities with different types or/and from different sources, which are comprehensive and can be better modeled by multiple networks. To take advantage of rich information in multiple networks and make better inferences on entities, in this study, we propose random walk on multiple networks, RWM. RWM is flexible and supports both multiplex networks and general multiple networks, which may form many-to-many node mappings between networks. RWM sends a random walker on each network to obtain the local proximity (i.e., node visiting probabilities) w.r.t. the starting nodes. Walkers with similar visiting probabilities reinforce each other. We theoretically analyze the convergence properties of RWM. Two appr",
    "path": "papers/23/07/2307.01637.json",
    "total_tokens": 851,
    "translated_title": "多网络上的随机游走",
    "translated_abstract": "随机游走是一种探索网络结构的基本算法，可以用于许多任务，如局部社区检测和网络嵌入。现有的随机游走方法基于包含有限信息的单个网络。相比之下，实际数据通常包含不同类型或来源的实体，这些实体是全面的，并且可以通过多个网络更好地建模。为了充分利用多个网络中的丰富信息，并对实体进行更好的推断，在本研究中，我们提出了多网络上的随机游走（RWM）。RWM是灵活的，支持多重网络和一般的多网络，可以在网络之间形成多对多的节点映射。RWM在每个网络上发送一个随机行者以获得与起始节点相关的局部接近度（即节点访问概率）。具有相似访问概率的行者相互强化。我们从理论上分析了RWM的收敛性质。",
    "tldr": "本论文提出了一种在多个网络上进行随机游走的方法，通过充分利用多个网络中的信息来进行更好的实体推断和分析。该方法支持多重网络和一般多网络，并且在理论上具有收敛性质。",
    "en_tdlr": "This paper proposes a method for random walk on multiple networks to improve entity inference and analysis by leveraging information from multiple networks. The method supports both multiplex networks and general multiple networks, and has convergence properties."
}