{
    "title": "Recent neutrino oscillation result with the IceCube experiment. (arXiv:2307.15855v1 [hep-ex])",
    "abstract": "The IceCube South Pole Neutrino Observatory is a Cherenkov detector instrumented in a cubic kilometer of ice at the South Pole. IceCube's primary scientific goal is the detection of TeV neutrino emissions from astrophysical sources. At the lower center of the IceCube array, there is a subdetector called DeepCore, which has a denser configuration that makes it possible to lower the energy threshold of IceCube and observe GeV-scale neutrinos, opening the window to atmospheric neutrino oscillations studies. Advances in physics sensitivity have recently been achieved by employing Convolutional Neural Networks to reconstruct neutrino interactions in the DeepCore detector. In this contribution, the recent IceCube result from the atmospheric muon neutrino disappearance analysis using the CNN-reconstructed neutrino sample is presented and compared to the existing worldwide measurements.",
    "link": "http://arxiv.org/abs/2307.15855",
    "context": "Title: Recent neutrino oscillation result with the IceCube experiment. (arXiv:2307.15855v1 [hep-ex])\nAbstract: The IceCube South Pole Neutrino Observatory is a Cherenkov detector instrumented in a cubic kilometer of ice at the South Pole. IceCube's primary scientific goal is the detection of TeV neutrino emissions from astrophysical sources. At the lower center of the IceCube array, there is a subdetector called DeepCore, which has a denser configuration that makes it possible to lower the energy threshold of IceCube and observe GeV-scale neutrinos, opening the window to atmospheric neutrino oscillations studies. Advances in physics sensitivity have recently been achieved by employing Convolutional Neural Networks to reconstruct neutrino interactions in the DeepCore detector. In this contribution, the recent IceCube result from the atmospheric muon neutrino disappearance analysis using the CNN-reconstructed neutrino sample is presented and compared to the existing worldwide measurements.",
    "path": "papers/23/07/2307.15855.json",
    "total_tokens": 813,
    "translated_title": "冰立方实验中最近的中微子振荡结果",
    "translated_abstract": "冰立方南极中微子观测站是一个仪器化的切伦科夫探测器，覆盖了南极的一个立方公里的冰。冰立方的主要科学目标是探测来自天体源的TeV中微子发射。在冰立方阵列的下方中心，有一个名为DeepCore的子探测器，该子探测器具有较高密度的配置，可以降低冰立方的能量阈值，并观测到GeV尺度的中微子，为大气中微子振荡研究打开了窗口。最近，在DeepCore探测器中使用卷积神经网络重建中微子相互作用，取得了物理灵敏度的进展。本文介绍了使用CNN重建的中微子样本进行大气μ中微子消失分析的最新冰立方结果，并与现有的全球测量结果进行了比较。",
    "tldr": "冰立方实验使用卷积神经网络重建了中微子相互作用，取得了物理灵敏度的进展，并展示了中微子振荡的最新结果。"
}