{
    "title": "Mathematical Modeling of BCG-based Bladder Cancer Treatment Using Socio-Demographics. (arXiv:2307.15084v1 [cs.LG])",
    "abstract": "Cancer is one of the most widespread diseases around the world with millions of new patients each year. Bladder cancer is one of the most prevalent types of cancer affecting all individuals alike with no obvious prototypical patient. The current standard treatment for BC follows a routine weekly Bacillus Calmette-Guerin (BCG) immunotherapy-based therapy protocol which is applied to all patients alike. The clinical outcomes associated with BCG treatment vary significantly among patients due to the biological and clinical complexity of the interaction between the immune system, treatments, and cancer cells. In this study, we take advantage of the patient's socio-demographics to offer a personalized mathematical model that describes the clinical dynamics associated with BCG-based treatment. To this end, we adopt a well-established BCG treatment model and integrate a machine learning component to temporally adjust and reconfigure key parameters within the model thus promoting its personali",
    "link": "http://arxiv.org/abs/2307.15084",
    "context": "Title: Mathematical Modeling of BCG-based Bladder Cancer Treatment Using Socio-Demographics. (arXiv:2307.15084v1 [cs.LG])\nAbstract: Cancer is one of the most widespread diseases around the world with millions of new patients each year. Bladder cancer is one of the most prevalent types of cancer affecting all individuals alike with no obvious prototypical patient. The current standard treatment for BC follows a routine weekly Bacillus Calmette-Guerin (BCG) immunotherapy-based therapy protocol which is applied to all patients alike. The clinical outcomes associated with BCG treatment vary significantly among patients due to the biological and clinical complexity of the interaction between the immune system, treatments, and cancer cells. In this study, we take advantage of the patient's socio-demographics to offer a personalized mathematical model that describes the clinical dynamics associated with BCG-based treatment. To this end, we adopt a well-established BCG treatment model and integrate a machine learning component to temporally adjust and reconfigure key parameters within the model thus promoting its personali",
    "path": "papers/23/07/2307.15084.json",
    "total_tokens": 868,
    "translated_title": "使用社会人口统计数据对基于BCG的膀胱癌治疗进行数学建模",
    "translated_abstract": "癌症是世界上最常见的疾病之一，每年都有数百万新患者。膀胱癌是一种最普遍的癌症类型，影响所有人，并没有明显的典型患者。目前，BCG免疫治疗是膀胱癌的标准治疗方法，所有患者都会进行每周例行的BCG治疗。由于免疫系统、治疗和癌细胞之间的生物和临床复杂性，BCG治疗的临床结果在患者之间存在显著差异。在本研究中，我们利用患者的社会人口统计数据提供个性化的数学模型，以描述与基于BCG的治疗相关的临床动态。为此，我们采用了一种成熟的BCG治疗模型，并整合了机器学习组件，以在模型内部即时调整和重新配置关键参数，从而促进其个性化。",
    "tldr": "本研究利用患者的社会人口统计数据提供个性化的数学模型，以描述基于BCG的膀胱癌治疗的临床动态。"
}