{
    "title": "Zero-Shot Neural Architecture Search: Challenges, Solutions, and Opportunities. (arXiv:2307.01998v2 [cs.LG] UPDATED)",
    "abstract": "Recently, zero-shot (or training-free) Neural Architecture Search (NAS) approaches have been proposed to liberate NAS from the expensive training process. The key idea behind zero-shot NAS approaches is to design proxies that can predict the accuracy of some given networks without training the network parameters. The proxies proposed so far are usually inspired by recent progress in theoretical understanding of deep learning and have shown great potential on several datasets and NAS benchmarks. This paper aims to comprehensively review and compare the state-of-the-art (SOTA) zero-shot NAS approaches, with an emphasis on their hardware awareness. To this end, we first review the mainstream zero-shot proxies and discuss their theoretical underpinnings. We then compare these zero-shot proxies through large-scale experiments and demonstrate their effectiveness in both hardware-aware and hardware-oblivious NAS scenarios. Finally, we point out several promising ideas to design better proxies",
    "link": "http://arxiv.org/abs/2307.01998",
    "context": "Title: Zero-Shot Neural Architecture Search: Challenges, Solutions, and Opportunities. (arXiv:2307.01998v2 [cs.LG] UPDATED)\nAbstract: Recently, zero-shot (or training-free) Neural Architecture Search (NAS) approaches have been proposed to liberate NAS from the expensive training process. The key idea behind zero-shot NAS approaches is to design proxies that can predict the accuracy of some given networks without training the network parameters. The proxies proposed so far are usually inspired by recent progress in theoretical understanding of deep learning and have shown great potential on several datasets and NAS benchmarks. This paper aims to comprehensively review and compare the state-of-the-art (SOTA) zero-shot NAS approaches, with an emphasis on their hardware awareness. To this end, we first review the mainstream zero-shot proxies and discuss their theoretical underpinnings. We then compare these zero-shot proxies through large-scale experiments and demonstrate their effectiveness in both hardware-aware and hardware-oblivious NAS scenarios. Finally, we point out several promising ideas to design better proxies",
    "path": "papers/23/07/2307.01998.json",
    "total_tokens": 907,
    "translated_title": "零代价神经架构搜索：挑战、解决方案和机遇",
    "translated_abstract": "最近，零代价（或无需训练）神经架构搜索（NAS）方法被提出来将NAS从昂贵的训练过程中解放出来。零代价NAS方法的关键思想是设计能够预测某些给定网络精确度的代理，而无需训练网络参数。到目前为止，已经提出的代理通常受到深度学习的理论理解的最新进展的启发，并在几个数据集和NAS基准测试上显示出了巨大潜力。本文旨在全面审查和比较最先进的零代价NAS方法，重点关注它们对硬件的意识。为此，我们首先回顾主流的零代价代理并讨论它们的理论基础。然后，我们通过大规模实验比较这些零代价代理，并展示它们在硬件感知和硬件无感知的NAS场景中的有效性。最后，我们指出了设计更好的代理的几个有前途的思路。",
    "tldr": "零代价神经架构搜索是一种不需要训练的方法，其核心思想是设计能够预测网络精确度的代理。本文综述了最新的零代价神经架构搜索方法，并在硬件感知和硬件无感知的NAS场景中展示了其有效性。"
}