{
    "title": "LEAT: Towards Robust Deepfake Disruption in Real-World Scenarios via Latent Ensemble Attack. (arXiv:2307.01520v1 [cs.CV])",
    "abstract": "Deepfakes, malicious visual contents created by generative models, pose an increasingly harmful threat to society. To proactively mitigate deepfake damages, recent studies have employed adversarial perturbation to disrupt deepfake model outputs. However, previous approaches primarily focus on generating distorted outputs based on only predetermined target attributes, leading to a lack of robustness in real-world scenarios where target attributes are unknown. Additionally, the transferability of perturbations between two prominent generative models, Generative Adversarial Networks (GANs) and Diffusion Models, remains unexplored. In this paper, we emphasize the importance of target attribute-transferability and model-transferability for achieving robust deepfake disruption. To address this challenge, we propose a simple yet effective disruption method called Latent Ensemble ATtack (LEAT), which attacks the independent latent encoding process. By disrupting the latent encoding process, it",
    "link": "http://arxiv.org/abs/2307.01520",
    "context": "Title: LEAT: Towards Robust Deepfake Disruption in Real-World Scenarios via Latent Ensemble Attack. (arXiv:2307.01520v1 [cs.CV])\nAbstract: Deepfakes, malicious visual contents created by generative models, pose an increasingly harmful threat to society. To proactively mitigate deepfake damages, recent studies have employed adversarial perturbation to disrupt deepfake model outputs. However, previous approaches primarily focus on generating distorted outputs based on only predetermined target attributes, leading to a lack of robustness in real-world scenarios where target attributes are unknown. Additionally, the transferability of perturbations between two prominent generative models, Generative Adversarial Networks (GANs) and Diffusion Models, remains unexplored. In this paper, we emphasize the importance of target attribute-transferability and model-transferability for achieving robust deepfake disruption. To address this challenge, we propose a simple yet effective disruption method called Latent Ensemble ATtack (LEAT), which attacks the independent latent encoding process. By disrupting the latent encoding process, it",
    "path": "papers/23/07/2307.01520.json",
    "total_tokens": 948,
    "translated_title": "LEAT: 通过潜在编码集成攻击，实现对真实场景中深度伪造的可靠干扰",
    "translated_abstract": "深度伪造是由生成模型创建的恶意视觉内容，对社会造成越来越大的威胁。为了主动减轻深度伪造的损害，最近的研究采用了对抗扰动来干扰深度伪造模型的输出。然而，之前的方法主要集中在基于预定目标属性生成扭曲输出，导致在目标属性未知的真实场景中缺乏鲁棒性。此外，两种主要生成模型——生成对抗网络（GAN）和扩散模型之间的扰动可转移性仍然未被探索。在本文中，我们强调了目标属性可转移性和模型可转移性在实现对深度伪造的可靠干扰方面的重要性。为了解决这一挑战，我们提出了一种简单而有效的干扰方法，即潜在编码集成攻击（LEAT），它攻击了独立的潜在编码过程。通过干扰潜在编码过程，它可以提高在真实场景中的鲁棒性。",
    "tldr": "这项研究通过一种名为LEAT的方法，在真实场景中实现了对深度伪造的可靠干扰。LEAT通过攻击独立的潜在编码过程来干扰深度伪造，提高了鲁棒性。",
    "en_tdlr": "This research achieved robust disruption of deepfakes in real-world scenarios through a method called LEAT. LEAT disrupts deepfakes by attacking the independent latent encoding process, increasing robustness."
}