{
    "title": "Aeolus Ocean -- A simulation environment for the autonomous COLREG-compliant navigation of Unmanned Surface Vehicles using Deep Reinforcement Learning and Maritime Object Detection. (arXiv:2307.06688v1 [cs.RO])",
    "abstract": "Heading towards navigational autonomy in unmanned surface vehicles (USVs) in the maritime sector can fundamentally lead towards safer waters as well as reduced operating costs, while also providing a range of exciting new capabilities for oceanic research, exploration and monitoring. However, achieving such a goal is challenging. USV control systems must, safely and reliably, be able to adhere to the international regulations for preventing collisions at sea (COLREGs) in encounters with other vessels as they navigate to a given waypoint while being affected by realistic weather conditions, either during the day or at night. To deal with the multitude of possible scenarios, it is critical to have a virtual environment that is able to replicate the realistic operating conditions USVs will encounter, before they can be implemented in the real world. Such \"digital twins\" form the foundations upon which Deep Reinforcement Learning (DRL) and Computer Vision (CV) algorithms can be used to dev",
    "link": "http://arxiv.org/abs/2307.06688",
    "context": "Title: Aeolus Ocean -- A simulation environment for the autonomous COLREG-compliant navigation of Unmanned Surface Vehicles using Deep Reinforcement Learning and Maritime Object Detection. (arXiv:2307.06688v1 [cs.RO])\nAbstract: Heading towards navigational autonomy in unmanned surface vehicles (USVs) in the maritime sector can fundamentally lead towards safer waters as well as reduced operating costs, while also providing a range of exciting new capabilities for oceanic research, exploration and monitoring. However, achieving such a goal is challenging. USV control systems must, safely and reliably, be able to adhere to the international regulations for preventing collisions at sea (COLREGs) in encounters with other vessels as they navigate to a given waypoint while being affected by realistic weather conditions, either during the day or at night. To deal with the multitude of possible scenarios, it is critical to have a virtual environment that is able to replicate the realistic operating conditions USVs will encounter, before they can be implemented in the real world. Such \"digital twins\" form the foundations upon which Deep Reinforcement Learning (DRL) and Computer Vision (CV) algorithms can be used to dev",
    "path": "papers/23/07/2307.06688.json",
    "total_tokens": 925,
    "translated_title": "Aeolus Ocean -- 使用深度强化学习和海洋物体检测的无人水面航行器自主COLREG合规导航的仿真环境",
    "translated_abstract": "在海运领域，朝着无人水面航行器（USV）的航行自主化发展，不仅可以有效提高安全性并减少运营成本，还可以为海洋研究、探索和监测提供一系列令人兴奋的新能力。然而，实现这一目标具有挑战性。 USV 控制系统必须能够安全可靠地遵守海上避碰国际规定（COLREGs），在与其他船只相遇时按给定航点航行，同时受到白天或夜间的真实天气条件的影响。为了应对可能的多种场景，必须有一个能够复制USVs将遇到的真实操作条件的虚拟环境，在实际应用之前进行模拟。这种“数字孪生”是将深度强化学习（DRL）和计算机视觉（CV）算法用于开发的基础。",
    "tldr": "本文提出了Aeolus Ocean，这是一个用于无人水面航行器自主COLREG合规导航的仿真环境。通过在虚拟环境中复制真实的操作条件，可以为DRL和CV算法的开发提供基础。"
}