{
    "title": "On the hierarchical Bayesian modelling of frequency response functions. (arXiv:2307.06263v1 [cs.LG])",
    "abstract": "Population-based structural health monitoring (PBSHM) aims to share valuable information among members of a population, such as normal- and damage-condition data, to improve inferences regarding the health states of the members. Even when the population is comprised of nominally-identical structures, benign variations among the members will exist as a result of slight differences in material properties, geometry, boundary conditions, or environmental effects (e.g., temperature changes). These discrepancies can affect modal properties and present as changes in the characteristics of the resonance peaks of the frequency response function (FRF). Many SHM strategies depend on monitoring the dynamic properties of structures, so benign variations can be challenging for the practical implementation of these systems. Another common challenge with vibration-based SHM is data loss, which may result from transmission issues, sensor failure, a sample-rate mismatch between sensors, and other causes",
    "link": "http://arxiv.org/abs/2307.06263",
    "context": "Title: On the hierarchical Bayesian modelling of frequency response functions. (arXiv:2307.06263v1 [cs.LG])\nAbstract: Population-based structural health monitoring (PBSHM) aims to share valuable information among members of a population, such as normal- and damage-condition data, to improve inferences regarding the health states of the members. Even when the population is comprised of nominally-identical structures, benign variations among the members will exist as a result of slight differences in material properties, geometry, boundary conditions, or environmental effects (e.g., temperature changes). These discrepancies can affect modal properties and present as changes in the characteristics of the resonance peaks of the frequency response function (FRF). Many SHM strategies depend on monitoring the dynamic properties of structures, so benign variations can be challenging for the practical implementation of these systems. Another common challenge with vibration-based SHM is data loss, which may result from transmission issues, sensor failure, a sample-rate mismatch between sensors, and other causes",
    "path": "papers/23/07/2307.06263.json",
    "total_tokens": 832,
    "translated_title": "关于频率响应函数的分层贝叶斯建模",
    "translated_abstract": "基于人群的结构健康监测(PBSHM)旨在在人群成员之间共享有价值的信息，例如正常和损伤状态的数据，以改进对成员健康状态的推断。即使人群由名义上相同的结构组成，由于材料性质、几何形状、边界条件或环境影响(例如温度变化)的细微差异产生了 benign variations。这些差异可以影响模态性质，并表现为频率响应函数(FRF)的共振峰特征的变化。许多SHM策略依赖于对结构的动态特性进行监测，因此 benign variations 对这些系统的实际实施是具有挑战性的。振动式SHM的另一个常见挑战是数据丢失，可能是由于传输问题、传感器故障、传感器之间的采样率不匹配等原因引起的。",
    "tldr": "结构健康监测(PBSHM)旨在在人群成员之间共享信息以改善健康状态的推断。由于差异和数据丢失所带来的挑战需要解决。"
}