{
    "title": "Seeing is not Believing: Robust Reinforcement Learning against Spurious Correlation. (arXiv:2307.07907v1 [cs.LG])",
    "abstract": "Robustness has been extensively studied in reinforcement learning (RL) to handle various forms of uncertainty such as random perturbations, rare events, and malicious attacks. In this work, we consider one critical type of robustness against spurious correlation, where different portions of the state do not have causality but have correlations induced by unobserved confounders. These spurious correlations are ubiquitous in real-world tasks, for instance, a self-driving car usually observes heavy traffic in the daytime and light traffic at night due to unobservable human activity. A model that learns such useless or even harmful correlation could catastrophically fail when the confounder in the test case deviates from the training one. Although motivated, enabling robustness against spurious correlation poses significant challenges since the uncertainty set, shaped by the unobserved confounder and sequential structure of RL, is difficult to characterize and identify. Existing robust alg",
    "link": "http://arxiv.org/abs/2307.07907",
    "context": "Title: Seeing is not Believing: Robust Reinforcement Learning against Spurious Correlation. (arXiv:2307.07907v1 [cs.LG])\nAbstract: Robustness has been extensively studied in reinforcement learning (RL) to handle various forms of uncertainty such as random perturbations, rare events, and malicious attacks. In this work, we consider one critical type of robustness against spurious correlation, where different portions of the state do not have causality but have correlations induced by unobserved confounders. These spurious correlations are ubiquitous in real-world tasks, for instance, a self-driving car usually observes heavy traffic in the daytime and light traffic at night due to unobservable human activity. A model that learns such useless or even harmful correlation could catastrophically fail when the confounder in the test case deviates from the training one. Although motivated, enabling robustness against spurious correlation poses significant challenges since the uncertainty set, shaped by the unobserved confounder and sequential structure of RL, is difficult to characterize and identify. Existing robust alg",
    "path": "papers/23/07/2307.07907.json",
    "total_tokens": 931,
    "translated_title": "视而不见：针对虚假相关性的鲁棒强化学习",
    "translated_abstract": "鲁棒性在强化学习中得到了广泛研究，用于处理各种不确定性形式，如随机扰动、罕见事件和恶意攻击。本文研究一种关键类型的鲁棒性，即对虚假相关性的鲁棒性，其中状态的不同部分没有因果关系，但却存在由不可观察的混杂因素引起的相关性。这些虚假相关性在现实世界的任务中很普遍，例如，自动驾驶汽车通常在白天观察到交通拥堵，夜晚观察到交通轻松，原因是不可观察的人类活动。模型在学习这种无用甚至有害相关性时，当测试案例的混杂因素偏离训练时，可能会造成灾难性的失败。尽管如此，使模型对虚假相关性具有鲁棒性仍面临重要挑战，因为由不可观察的混杂因素和强化学习的顺序结构形成的不确定性集很难进行表征和识别。现有的鲁棒算法往往无法应对这一挑战。",
    "tldr": "本文研究了如何在强化学习中使模型具有对虚假相关性的鲁棒性，这种虚假相关性是由于不可观察的混杂因素引起的，并且普遍存在于现实世界的任务中。"
}