{
    "title": "Towards spoken dialect identification of Irish. (arXiv:2307.07436v1 [cs.CL])",
    "abstract": "The Irish language is rich in its diversity of dialects and accents. This compounds the difficulty of creating a speech recognition system for the low-resource language, as such a system must contend with a high degree of variability with limited corpora. A recent study investigating dialect bias in Irish ASR found that balanced training corpora gave rise to unequal dialect performance, with performance for the Ulster dialect being consistently worse than for the Connacht or Munster dialects. Motivated by this, the present experiments investigate spoken dialect identification of Irish, with a view to incorporating such a system into the speech recognition pipeline. Two acoustic classification models are tested, XLS-R and ECAPA-TDNN, in conjunction with a text-based classifier using a pretrained Irish-language BERT model. The ECAPA-TDNN, particularly a model pretrained for language identification on the VoxLingua107 dataset, performed best overall, with an accuracy of 73%. This was furt",
    "link": "http://arxiv.org/abs/2307.07436",
    "context": "Title: Towards spoken dialect identification of Irish. (arXiv:2307.07436v1 [cs.CL])\nAbstract: The Irish language is rich in its diversity of dialects and accents. This compounds the difficulty of creating a speech recognition system for the low-resource language, as such a system must contend with a high degree of variability with limited corpora. A recent study investigating dialect bias in Irish ASR found that balanced training corpora gave rise to unequal dialect performance, with performance for the Ulster dialect being consistently worse than for the Connacht or Munster dialects. Motivated by this, the present experiments investigate spoken dialect identification of Irish, with a view to incorporating such a system into the speech recognition pipeline. Two acoustic classification models are tested, XLS-R and ECAPA-TDNN, in conjunction with a text-based classifier using a pretrained Irish-language BERT model. The ECAPA-TDNN, particularly a model pretrained for language identification on the VoxLingua107 dataset, performed best overall, with an accuracy of 73%. This was furt",
    "path": "papers/23/07/2307.07436.json",
    "total_tokens": 889,
    "translated_title": "对爱尔兰口音方言的语音识别研究",
    "translated_abstract": "爱尔兰语在方言和口音上非常丰富，这使得为这种资源匮乏的语言创建语音识别系统变得困难，因为这样的系统必须应对有限的语料库中的高度变异性。最近一项对爱尔兰语ASR中方言偏见的研究发现，平衡的训练语料库导致了不平等的方言性能，阿尔斯特方言的表现始终比康诺特或蒙斯特方言要差。受此启发，本实验研究了对爱尔兰口音方言的语音识别，旨在将这样的系统纳入语音识别流水线中。实验中测试了两个声学分类模型，XLS-R和ECAPA-TDNN，和一个使用预训练爱尔兰语BERT模型的基于文本的分类器。ECAPA-TDNN表现最好，特别是在VoxLingua107数据集上进行了语言识别预训练的模型，整体准确率达到73%。",
    "tldr": "本研究针对爱尔兰语方言的变异性问题，通过实验探索了爱尔兰口音方言的语音识别，并成功搭建出一个准确率为73%的语音识别系统。",
    "en_tdlr": "This study investigates spoken dialect identification of Irish language, and successfully builds a speech recognition system with an accuracy of 73% to address the variability issue caused by the rich diversity of dialects and accents in Irish."
}