{
    "title": "GrammarGPT: Exploring Open-Source LLMs for Native Chinese Grammatical Error Correction with Supervised Fine-Tuning. (arXiv:2307.13923v1 [cs.CL])",
    "abstract": "Grammatical error correction aims to correct ungrammatical sentences automatically. Recently, some work has demonstrated the excellent capabilities of closed-source Large Language Models (LLMs, e.g., ChatGPT) in grammatical error correction. However, the potential of open-source LLMs remains unexplored. In this paper, we introduced GrammarGPT, an open-source LLM, to preliminary explore its potential for native Chinese grammatical error correction. The core recipe of GrammarGPT is to leverage the hybrid dataset of ChatGPT-generated and human-annotated. For grammatical errors with clues, we proposed a heuristic method to guide ChatGPT to generate ungrammatical sentences by providing those clues. For grammatical errors without clues, we collected ungrammatical sentences from publicly available websites and manually corrected them. In addition, we employed an error-invariant augmentation method to enhance the ability of the model to correct native Chinese grammatical errors. We ultimately ",
    "link": "http://arxiv.org/abs/2307.13923",
    "context": "Title: GrammarGPT: Exploring Open-Source LLMs for Native Chinese Grammatical Error Correction with Supervised Fine-Tuning. (arXiv:2307.13923v1 [cs.CL])\nAbstract: Grammatical error correction aims to correct ungrammatical sentences automatically. Recently, some work has demonstrated the excellent capabilities of closed-source Large Language Models (LLMs, e.g., ChatGPT) in grammatical error correction. However, the potential of open-source LLMs remains unexplored. In this paper, we introduced GrammarGPT, an open-source LLM, to preliminary explore its potential for native Chinese grammatical error correction. The core recipe of GrammarGPT is to leverage the hybrid dataset of ChatGPT-generated and human-annotated. For grammatical errors with clues, we proposed a heuristic method to guide ChatGPT to generate ungrammatical sentences by providing those clues. For grammatical errors without clues, we collected ungrammatical sentences from publicly available websites and manually corrected them. In addition, we employed an error-invariant augmentation method to enhance the ability of the model to correct native Chinese grammatical errors. We ultimately ",
    "path": "papers/23/07/2307.13923.json",
    "total_tokens": 884,
    "translated_title": "GrammarGPT: 使用有监督微调的开源LLM探索母语汉语语法错误修正",
    "translated_abstract": "语法错误修正旨在自动修正不符合语法的句子。最近的一些研究表明，闭源大型语言模型（LLM，例如ChatGPT）在语法错误修正方面具有出色的能力。然而，开源LLM的潜力仍未被探索。本文介绍了一个名为GrammarGPT的开源LLM，旨在初步探索其在母语汉语语法错误修正方面的潜力。GrammarGPT的核心方法是利用ChatGPT生成的数据和人工标注的混合数据集。对于带有提示信息的语法错误，我们提出了一种启发式方法来指导ChatGPT通过提供这些提示信息生成不符合语法的句子。对于没有提示信息的语法错误，我们从公开可用的网站收集了不符合语法的句子，并进行手动修正。此外，我们还采用了一种错误不变增强方法，以增强该模型纠正母语汉语语法错误的能力。",
    "tldr": "本文介绍了GrammarGPT，一个开源LLM用于母语汉语语法错误修正，通过混合数据集和启发式方法，提高了模型的修正能力。",
    "en_tdlr": "This paper introduces GrammarGPT, an open-source LLM for native Chinese grammatical error correction. By leveraging a hybrid dataset and employing a heuristic method, the model's correction ability is improved."
}