{
    "title": "Some Preliminary Steps Towards Metaverse Logic. (arXiv:2307.05574v1 [cs.LO])",
    "abstract": "Assuming that the term 'metaverse' could be understood as a computer-based implementation of multiverse applications, we started to look in the present work for a logic that would be powerful enough to handle the situations arising both in the real and in the fictional underlying application domains. Realizing that first-order logic fails to account for the unstable behavior of even the most simpleminded information system domains, we resorted to non-conventional extensions, in an attempt to sketch a minimal composite logic strategy. The discussion was kept at a rather informal level, always trying to convey the intuition behind the theoretical notions in natural language terms, and appealing to an AI agent, namely ChatGPT, in the hope that algorithmic and common-sense approaches can be usefully combined.",
    "link": "http://arxiv.org/abs/2307.05574",
    "context": "Title: Some Preliminary Steps Towards Metaverse Logic. (arXiv:2307.05574v1 [cs.LO])\nAbstract: Assuming that the term 'metaverse' could be understood as a computer-based implementation of multiverse applications, we started to look in the present work for a logic that would be powerful enough to handle the situations arising both in the real and in the fictional underlying application domains. Realizing that first-order logic fails to account for the unstable behavior of even the most simpleminded information system domains, we resorted to non-conventional extensions, in an attempt to sketch a minimal composite logic strategy. The discussion was kept at a rather informal level, always trying to convey the intuition behind the theoretical notions in natural language terms, and appealing to an AI agent, namely ChatGPT, in the hope that algorithmic and common-sense approaches can be usefully combined.",
    "path": "papers/23/07/2307.05574.json",
    "total_tokens": 802,
    "translated_title": "关于元宇宙逻辑的一些初步步骤",
    "translated_abstract": "假设“元宇宙”一词可以理解为多元宇宙应用的基于计算机的实现，我们在本工作中开始寻找一个足够强大的逻辑来处理现实和虚构的基础应用领域中出现的情况。意识到一阶逻辑无法解释甚至最简单信息系统领域的不稳定行为，我们采用了非常规扩展，试图勾勒出一种最小复合逻辑策略。讨论保持在相当非正式的水平上，始终试图用自然语言的术语传达理论概念背后的直觉，并借助AI代理ChatGPT，希望算法和常识方法可以有用地结合起来。",
    "tldr": "本研究探寻了一种能够处理现实和虚构应用领域中出现情况的强大逻辑，采用非常规扩展，试图勾勒出一种最小复合逻辑策略，并通过ChatGPT AI代理传递理论概念背后的直觉。",
    "en_tdlr": "This study explores a powerful logic that can handle situations in both real and fictional application domains, using non-conventional extensions to outline a minimal composite logic strategy, while conveying the intuition behind theoretical concepts using the AI agent ChatGPT."
}