{
    "title": "Rough PDEs for local stochastic volatility models. (arXiv:2307.09216v1 [q-fin.MF])",
    "abstract": "In this work, we introduce a novel pricing methodology in general, possibly non-Markovian local stochastic volatility (LSV) models. We observe that by conditioning the LSV dynamics on the Brownian motion that drives the volatility, one obtains a time-inhomogeneous Markov process. Using tools from rough path theory, we describe how to precisely understand the conditional LSV dynamics and reveal their Markovian nature. The latter allows us to connect the conditional dynamics to so-called rough partial differential equations (RPDEs), through a Feynman-Kac type of formula. In terms of European pricing, conditional on realizations of one Brownian motion, we can compute conditional option prices by solving the corresponding linear RPDEs, and then average over all samples to find unconditional prices. Our approach depends only minimally on the specification of the volatility, making it applicable for a wide range of classical and rough LSV models, and it establishes a PDE pricing method for n",
    "link": "http://arxiv.org/abs/2307.09216",
    "context": "Title: Rough PDEs for local stochastic volatility models. (arXiv:2307.09216v1 [q-fin.MF])\nAbstract: In this work, we introduce a novel pricing methodology in general, possibly non-Markovian local stochastic volatility (LSV) models. We observe that by conditioning the LSV dynamics on the Brownian motion that drives the volatility, one obtains a time-inhomogeneous Markov process. Using tools from rough path theory, we describe how to precisely understand the conditional LSV dynamics and reveal their Markovian nature. The latter allows us to connect the conditional dynamics to so-called rough partial differential equations (RPDEs), through a Feynman-Kac type of formula. In terms of European pricing, conditional on realizations of one Brownian motion, we can compute conditional option prices by solving the corresponding linear RPDEs, and then average over all samples to find unconditional prices. Our approach depends only minimally on the specification of the volatility, making it applicable for a wide range of classical and rough LSV models, and it establishes a PDE pricing method for n",
    "path": "papers/23/07/2307.09216.json",
    "total_tokens": 907,
    "translated_title": "局部随机波动模型的粗糙PDE方法",
    "translated_abstract": "在这项工作中，我们引入了一种新的定价方法，适用于一般性的、可能是非马尔可夫的局部随机波动(LSV)模型。通过在驱动波动率的布朗运动上对LSV动态进行条件约束，我们得到了一个时间不齐的马尔可夫过程。利用粗糙路径理论的工具，我们描述了如何精确理解条件LSV动态并揭示其马尔可夫性质。后者使我们能够将条件动态与所谓的粗糙偏微分方程(RPDEs)通过一种费曼-卡克类型的公式相连接。在欧式期权定价方面，对于一个布朗运动实现的条件下，我们可以通过求解相应的线性RPDEs来计算条件期权价格，然后对所有样本进行平均以找到无条件价格。我们的方法对波动率的规范只有最小的依赖性，使其适用于广泛的经典和粗糙LSV模型，并为数值PDE定价方法奠定了基础。",
    "tldr": "本文介绍了一种适用于局部随机波动模型的粗糙PDE定价方法，通过条件约束LSV动态，将其与粗糙偏微分方程相连接，从而实现了欧式期权的定价。"
}