{
    "title": "Better Handling Coreference Resolution in Aspect Level Sentiment Classification by Fine-Tuning Language Models. (arXiv:2307.05646v1 [cs.CL])",
    "abstract": "Customer feedback is invaluable to companies as they refine their products. Monitoring customer feedback can be automated with Aspect Level Sentiment Classification (ALSC) which allows us to analyse specific aspects of the products in reviews. Large Language Models (LLMs) are the heart of many state-of-the-art ALSC solutions, but they perform poorly in some scenarios requiring Coreference Resolution (CR). In this work, we propose a framework to improve an LLM's performance on CR-containing reviews by fine tuning on highly inferential tasks. We show that the performance improvement is likely attributed to the improved model CR ability. We also release a new dataset that focuses on CR in ALSC.",
    "link": "http://arxiv.org/abs/2307.05646",
    "context": "Title: Better Handling Coreference Resolution in Aspect Level Sentiment Classification by Fine-Tuning Language Models. (arXiv:2307.05646v1 [cs.CL])\nAbstract: Customer feedback is invaluable to companies as they refine their products. Monitoring customer feedback can be automated with Aspect Level Sentiment Classification (ALSC) which allows us to analyse specific aspects of the products in reviews. Large Language Models (LLMs) are the heart of many state-of-the-art ALSC solutions, but they perform poorly in some scenarios requiring Coreference Resolution (CR). In this work, we propose a framework to improve an LLM's performance on CR-containing reviews by fine tuning on highly inferential tasks. We show that the performance improvement is likely attributed to the improved model CR ability. We also release a new dataset that focuses on CR in ALSC.",
    "path": "papers/23/07/2307.05646.json",
    "total_tokens": 777,
    "translated_title": "通过微调语言模型改进方面级情感分类中的共指消解处理",
    "translated_abstract": "对于公司来说，客户反馈是非常宝贵的，因为它们可以优化产品。通过方面级情感分类(ALSC)可以自动监测客户反馈，从而分析评论中的具体方面。大型语言模型(LLMs)是许多最先进的ALSC解决方案的核心，但在某些需要共指消解(CR)的场景中表现较差。在本研究中，我们提出了一个框架，通过在高推断任务上进行微调，来改善LLM在具有CR的评论中的性能。我们表明，性能的改进很可能归因于改善了模型的CR能力。我们还发布了一个关于ALSC中CR的新数据集。",
    "tldr": "本研究提出了一个框架，通过在高推断任务上进行微调，来改善方面级情感分类中共指消解的处理。研究表明，该框架可以显著提高模型的共指消解能力，从而改善在具有共指消解的评论中的性能。",
    "en_tdlr": "This paper proposes a framework to improve coreference resolution in aspect level sentiment classification by fine-tuning language models on highly inferential tasks. The results show that the framework significantly enhances the model's coreference resolution ability, leading to improved performance on reviews with coreference resolution."
}