{
    "title": "EdgeConvEns: Convolutional Ensemble Learning for Edge Intelligence. (arXiv:2307.14381v1 [cs.LG])",
    "abstract": "Deep edge intelligence aims to deploy deep learning models that demand computationally expensive training in the edge network with limited computational power. Moreover, many deep edge intelligence applications require handling distributed data that cannot be transferred to a central server due to privacy concerns. Decentralized learning methods, such as federated learning, offer solutions where models are learned collectively by exchanging learned weights. However, they often require complex models that edge devices may not handle and multiple rounds of network communication to achieve state-of-the-art performances. This study proposes a convolutional ensemble learning approach, coined EdgeConvEns, that facilitates training heterogeneous weak models on edge and learning to ensemble them where data on edge are heterogeneously distributed. Edge models are implemented and trained independently on Field-Programmable Gate Array (FPGA) devices with various computational capacities. Learned ",
    "link": "http://arxiv.org/abs/2307.14381",
    "context": "Title: EdgeConvEns: Convolutional Ensemble Learning for Edge Intelligence. (arXiv:2307.14381v1 [cs.LG])\nAbstract: Deep edge intelligence aims to deploy deep learning models that demand computationally expensive training in the edge network with limited computational power. Moreover, many deep edge intelligence applications require handling distributed data that cannot be transferred to a central server due to privacy concerns. Decentralized learning methods, such as federated learning, offer solutions where models are learned collectively by exchanging learned weights. However, they often require complex models that edge devices may not handle and multiple rounds of network communication to achieve state-of-the-art performances. This study proposes a convolutional ensemble learning approach, coined EdgeConvEns, that facilitates training heterogeneous weak models on edge and learning to ensemble them where data on edge are heterogeneously distributed. Edge models are implemented and trained independently on Field-Programmable Gate Array (FPGA) devices with various computational capacities. Learned ",
    "path": "papers/23/07/2307.14381.json",
    "total_tokens": 845,
    "translated_title": "EdgeConvEns: 基于卷积集成学习的边缘智能",
    "translated_abstract": "深度边缘智能旨在在计算能力有限的边缘网络上部署需要消耗计算资源的深度学习模型。此外，许多深度边缘智能应用程序需要处理分布式数据，由于隐私问题无法将其传输到中央服务器。分散式学习方法，如联邦学习，可以通过交换学到的权重来以集体方式学习模型。然而，它们通常需要复杂的模型，边缘设备可能无法处理，并且需要多轮网络通信才能达到最先进的性能。本研究提出了一种卷积集成学习方法，命名为EdgeConvEns，它可以在边缘上训练异构的弱模型，并学会将它们集成起来，在边缘上数据分布呈异质性。边缘模型采用不同计算能力的现场可编程门阵列（FPGA）设备进行独立实现和训练。",
    "tldr": "EdgeConvEns是一种卷积集成学习方法，用于在边缘网络上训练和集成异构的弱模型，以满足计算能力有限和分布式数据处理的需求。",
    "en_tdlr": "EdgeConvEns is a convolutional ensemble learning approach for training and ensembling heterogeneous weak models on the edge network to meet the demands of limited computational power and distributed data processing."
}