{
    "title": "LakeBench: Benchmarks for Data Discovery over Data Lakes. (arXiv:2307.04217v1 [cs.DB])",
    "abstract": "Within enterprises, there is a growing need to intelligently navigate data lakes, specifically focusing on data discovery. Of particular importance to enterprises is the ability to find related tables in data repositories. These tables can be unionable, joinable, or subsets of each other. There is a dearth of benchmarks for these tasks in the public domain, with related work targeting private datasets. In LakeBench, we develop multiple benchmarks for these tasks by using the tables that are drawn from a diverse set of data sources such as government data from CKAN, Socrata, and the European Central Bank. We compare the performance of 4 publicly available tabular foundational models on these tasks. None of the existing models had been trained on the data discovery tasks that we developed for this benchmark; not surprisingly, their performance shows significant room for improvement. The results suggest that the establishment of such benchmarks may be useful to the community to build tabu",
    "link": "http://arxiv.org/abs/2307.04217",
    "context": "Title: LakeBench: Benchmarks for Data Discovery over Data Lakes. (arXiv:2307.04217v1 [cs.DB])\nAbstract: Within enterprises, there is a growing need to intelligently navigate data lakes, specifically focusing on data discovery. Of particular importance to enterprises is the ability to find related tables in data repositories. These tables can be unionable, joinable, or subsets of each other. There is a dearth of benchmarks for these tasks in the public domain, with related work targeting private datasets. In LakeBench, we develop multiple benchmarks for these tasks by using the tables that are drawn from a diverse set of data sources such as government data from CKAN, Socrata, and the European Central Bank. We compare the performance of 4 publicly available tabular foundational models on these tasks. None of the existing models had been trained on the data discovery tasks that we developed for this benchmark; not surprisingly, their performance shows significant room for improvement. The results suggest that the establishment of such benchmarks may be useful to the community to build tabu",
    "path": "papers/23/07/2307.04217.json",
    "total_tokens": 902,
    "translated_title": "LakeBench: 用于数据湖上的数据发现的基准测试",
    "translated_abstract": "在企业中，智能导航数据湖的需求越来越大，特别关注数据发现。对企业来说，能够找到数据仓库中相关的表格非常重要。这些表格可以是可联接的、可合并的，或者是彼此的子集。目前公共领域中缺乏针对这些任务的基准测试，相关工作主要针对私有数据集。在LakeBench中，我们使用来自CKAN、Socrata和欧洲中央银行等各种数据源的表格，开发了多个用于这些任务的基准测试。我们比较了4个公开可用的表格基准模型在这些任务上的性能。现有模型没有在我们为这个基准测试开发的数据发现任务上进行过训练，因此其性能仍有很大的改进空间。结果表明，建立这样的基准测试可能对社区构建标准数据发现模型是有用的。",
    "tldr": "LakeBench是一个用于数据湖上数据发现的基准测试，通过使用来自不同数据源的表格，它为企业在寻找相关表格的任务提供了有效的性能比较。目前公共领域中缺乏这样的基准测试，而已有模型在这个任务上的性能还有很大改进空间。"
}