{
    "title": "A Matrix Ensemble Kalman Filter-based Multi-arm Neural Network to Adequately Approximate Deep Neural Networks. (arXiv:2307.10436v1 [stat.ML])",
    "abstract": "Deep Learners (DLs) are the state-of-art predictive mechanism with applications in many fields requiring complex high dimensional data processing. Although conventional DLs get trained via gradient descent with back-propagation, Kalman Filter (KF)-based techniques that do not need gradient computation have been developed to approximate DLs. We propose a multi-arm extension of a KF-based DL approximator that can mimic DL when the sample size is too small to train a multi-arm DL. The proposed Matrix Ensemble Kalman Filter-based multi-arm ANN (MEnKF-ANN) also performs explicit model stacking that becomes relevant when the training sample has an unequal-size feature set. Our proposed technique can approximate Long Short-term Memory (LSTM) Networks and attach uncertainty to the predictions obtained from these LSTMs with desirable coverage. We demonstrate how MEnKF-ANN can \"adequately\" approximate an LSTM network trained to classify what carbohydrate substrates are digested and utilized by a",
    "link": "http://arxiv.org/abs/2307.10436",
    "context": "Title: A Matrix Ensemble Kalman Filter-based Multi-arm Neural Network to Adequately Approximate Deep Neural Networks. (arXiv:2307.10436v1 [stat.ML])\nAbstract: Deep Learners (DLs) are the state-of-art predictive mechanism with applications in many fields requiring complex high dimensional data processing. Although conventional DLs get trained via gradient descent with back-propagation, Kalman Filter (KF)-based techniques that do not need gradient computation have been developed to approximate DLs. We propose a multi-arm extension of a KF-based DL approximator that can mimic DL when the sample size is too small to train a multi-arm DL. The proposed Matrix Ensemble Kalman Filter-based multi-arm ANN (MEnKF-ANN) also performs explicit model stacking that becomes relevant when the training sample has an unequal-size feature set. Our proposed technique can approximate Long Short-term Memory (LSTM) Networks and attach uncertainty to the predictions obtained from these LSTMs with desirable coverage. We demonstrate how MEnKF-ANN can \"adequately\" approximate an LSTM network trained to classify what carbohydrate substrates are digested and utilized by a",
    "path": "papers/23/07/2307.10436.json",
    "total_tokens": 1025,
    "translated_title": "基于矩阵集合卡尔曼滤波器的多臂神经网络，以充分近似深度神经网络",
    "translated_abstract": "深度学习者（DLs）是最先进的预测机制，在许多需要复杂高维数据处理的领域中有广泛应用。虽然传统的DLs通过梯度下降和反向传播进行训练，但已经开发出了不需要梯度计算的基于卡尔曼滤波器（KF）的技术来近似DLs。我们提出了一种基于KF的DL近似器的多臂扩展，当样本量太小无法训练多臂DL时，可以模仿DL。我们提出的矩阵集合卡尔曼滤波器多臂ANN（MEnKF-ANN）还执行显式的模型堆叠，在训练样本具有不等尺寸特征集时具有相关性。我们提出的技术可以近似长短期记忆（LSTM）网络，并给出从这些LSTM预测中获得的值加上不确定性的理想覆盖范围。我们展示了MEnKF-ANN如何“充分”近似一个训练用于分类哪些碳水化合物基质被消化和利用的LSTM网络。",
    "tldr": "我们提出了一种基于矩阵集合卡尔曼滤波器的多臂神经网络，可以在样本量太小无法训练多臂神经网络时充分近似深度神经网络。该方法还可以对从长短期记忆网络（LSTM）获得的预测赋予不确定性，具有良好的覆盖范围。",
    "en_tdlr": "We propose a multi-arm neural network based on matrix ensemble Kalman filter to adequately approximate deep neural networks when the sample size is too small. The proposed method also adds uncertainty to the predictions obtained from long short-term memory networks (LSTMs) with desirable coverage."
}