{
    "title": "Autonomy 2.0: The Quest for Economies of Scale. (arXiv:2307.03973v1 [cs.RO])",
    "abstract": "With the advancement of robotics and AI technologies in the past decade, we have now entered the age of autonomous machines. In this new age of information technology, autonomous machines, such as service robots, autonomous drones, delivery robots, and autonomous vehicles, rather than humans, will provide services. In this article, through examining the technical challenges and economic impact of the digital economy, we argue that scalability is both highly necessary from a technical perspective and significantly advantageous from an economic perspective, thus is the key for the autonomy industry to achieve its full potential. Nonetheless, the current development paradigm, dubbed Autonomy 1.0, scales with the number of engineers, instead of with the amount of data or compute resources, hence preventing the autonomy industry to fully benefit from the economies of scale, especially the exponentially cheapening compute cost and the explosion of available data. We further analyze the key s",
    "link": "http://arxiv.org/abs/2307.03973",
    "context": "Title: Autonomy 2.0: The Quest for Economies of Scale. (arXiv:2307.03973v1 [cs.RO])\nAbstract: With the advancement of robotics and AI technologies in the past decade, we have now entered the age of autonomous machines. In this new age of information technology, autonomous machines, such as service robots, autonomous drones, delivery robots, and autonomous vehicles, rather than humans, will provide services. In this article, through examining the technical challenges and economic impact of the digital economy, we argue that scalability is both highly necessary from a technical perspective and significantly advantageous from an economic perspective, thus is the key for the autonomy industry to achieve its full potential. Nonetheless, the current development paradigm, dubbed Autonomy 1.0, scales with the number of engineers, instead of with the amount of data or compute resources, hence preventing the autonomy industry to fully benefit from the economies of scale, especially the exponentially cheapening compute cost and the explosion of available data. We further analyze the key s",
    "path": "papers/23/07/2307.03973.json",
    "total_tokens": 941,
    "translated_title": "自主2.0：规模经济的追求",
    "translated_abstract": "随着过去十年中机器人技术和人工智能技术的进步，我们现在已经进入了自主机器时代。在这个新的信息技术时代，自主机器，如服务机器人、自主无人机、送货机器人和自动驾驶车辆，将提供服务，而不是人类。在本文中，通过检验数字经济的技术挑战和经济影响，我们认为可扩展性在技术层面上是非常必要的，并且在经济层面上具有显著的优势，因此是实现自主产业充分潜力的关键。尽管如此，当前的发展范式，被称为自主1.0，是与工程师数量成比例而不是与数据量或计算资源成比例发展的，因此阻止了自主产业充分从规模经济中受益，尤其是计算成本的指数级降低和可用数据爆炸。我们进一步分析了实现自主2.0所面临的关键挑战和可能解决方案。",
    "tldr": "自主2.0对于自主产业实现规模经济至关重要，当前的自主1.0发展范式限制了其充分从计算成本和可用数据的规模经济中受益。为了实现自主2.0，需要解决技术和经济层面上的挑战。"
}