{
    "title": "Review of Deep Learning-based Malware Detection for Android and Windows System. (arXiv:2307.01494v1 [cs.LG])",
    "abstract": "Differentiating malware is important to determine their behaviors and level of threat; as well as to devise defensive strategy against them. In response, various anti-malware systems have been developed to distinguish between different malwares. However, most of the recent malware families are Artificial Intelligence (AI) enable and can deceive traditional anti-malware systems using different obfuscation techniques. Therefore, only AI-enabled anti-malware system is robust against these techniques and can detect different features in the malware files that aid in malicious activities. In this study we review two AI-enabled techniques for detecting malware in Windows and Android operating system, respectively. Both the techniques achieved perfect accuracy in detecting various malware families.",
    "link": "http://arxiv.org/abs/2307.01494",
    "context": "Title: Review of Deep Learning-based Malware Detection for Android and Windows System. (arXiv:2307.01494v1 [cs.LG])\nAbstract: Differentiating malware is important to determine their behaviors and level of threat; as well as to devise defensive strategy against them. In response, various anti-malware systems have been developed to distinguish between different malwares. However, most of the recent malware families are Artificial Intelligence (AI) enable and can deceive traditional anti-malware systems using different obfuscation techniques. Therefore, only AI-enabled anti-malware system is robust against these techniques and can detect different features in the malware files that aid in malicious activities. In this study we review two AI-enabled techniques for detecting malware in Windows and Android operating system, respectively. Both the techniques achieved perfect accuracy in detecting various malware families.",
    "path": "papers/23/07/2307.01494.json",
    "total_tokens": 788,
    "translated_title": "基于深度学习的安卓和Windows系统恶意软件检测综述",
    "translated_abstract": "分辨恶意软件的行为和威胁级别对于制定防御策略至关重要。为此，各种反恶意软件系统已经开发出来用于区分不同的恶意软件。然而，大部分最近的恶意软件都具备人工智能能力，并且可以使用不同的混淆技术欺骗传统的反恶意软件系统。因此，只有基于人工智能的反恶意软件系统对抗这些技术更加强大，并且能够检测到恶意活动所涉及的恶意软件文件中的不同特征。本研究回顾了两种基于人工智能的技术，分别用于在Windows和安卓操作系统中检测恶意软件。这两种技术在检测各种恶意软件家族时均实现了完美的准确性。",
    "tldr": "本文综述了基于深度学习的安卓和Windows系统恶意软件检测技术，这些技术在检测不同恶意软件家族上均取得了完美的准确性。"
}