{
    "title": "A Neural-Symbolic Approach Towards Identifying Grammatically Correct Sentences. (arXiv:2307.08036v1 [cs.CL])",
    "abstract": "Textual content around us is growing on a daily basis. Numerous articles are being written as we speak on online newspapers, blogs, or social media. Similarly, recent advances in the AI field, like language models or traditional classic AI approaches, are utilizing all the above to improve their learned representation to tackle NLP challenges with human-like accuracy. It is commonly accepted that it is crucial to have access to well-written text from valid sources to tackle challenges like text summarization, question-answering, machine translation, or even pronoun resolution. For instance, to summarize well, one needs to select the most important sentences in order to concatenate them to form the summary. However, what happens if we do not have access to well-formed English sentences or even non-valid sentences? Despite the importance of having access to well-written sentences, figuring out ways to validate them is still an open area of research. To address this problem, we present a ",
    "link": "http://arxiv.org/abs/2307.08036",
    "context": "Title: A Neural-Symbolic Approach Towards Identifying Grammatically Correct Sentences. (arXiv:2307.08036v1 [cs.CL])\nAbstract: Textual content around us is growing on a daily basis. Numerous articles are being written as we speak on online newspapers, blogs, or social media. Similarly, recent advances in the AI field, like language models or traditional classic AI approaches, are utilizing all the above to improve their learned representation to tackle NLP challenges with human-like accuracy. It is commonly accepted that it is crucial to have access to well-written text from valid sources to tackle challenges like text summarization, question-answering, machine translation, or even pronoun resolution. For instance, to summarize well, one needs to select the most important sentences in order to concatenate them to form the summary. However, what happens if we do not have access to well-formed English sentences or even non-valid sentences? Despite the importance of having access to well-written sentences, figuring out ways to validate them is still an open area of research. To address this problem, we present a ",
    "path": "papers/23/07/2307.08036.json",
    "total_tokens": 858,
    "translated_title": "一种神经符号方法实现对语法正确句子的识别",
    "translated_abstract": "我们身边的文本内容每天都在增长。在网上报纸、博客或社交媒体上，我们正在撰写大量的文章。类似地，人工智能领域的最新进展，如语言模型或传统的经典人工智能方法，正在利用以上所有内容，提高他们学习的表示能力，以实现类似人类的准确性来应对自然语言处理挑战。众所周知，获取来自有效来源的写作文本对于应对文本摘要、问答、机器翻译甚至代词消解等挑战至关重要。例如，要进行良好的摘要，需要选择最重要的句子，然后将它们连接起来形成摘要。然而，如果我们没有获取到写得好的英文句子甚至非有效的句子会怎么样呢？尽管获得写得好的句子的重要性被广泛认可，但找出验证它们的方法仍然是一个开放的研究领域。为了解决这个问题，我们提出了一种神经符号方法。",
    "tldr": "这项研究介绍了一种神经符号方法来解决验证语法正确句子的问题。",
    "en_tdlr": "This research introduces a neural-symbolic approach to address the problem of validating grammatically correct sentences."
}