{
    "title": "ContainerGym: A Real-World Reinforcement Learning Benchmark for Resource Allocation. (arXiv:2307.02991v1 [cs.LG])",
    "abstract": "We present ContainerGym, a benchmark for reinforcement learning inspired by a real-world industrial resource allocation task. The proposed benchmark encodes a range of challenges commonly encountered in real-world sequential decision making problems, such as uncertainty. It can be configured to instantiate problems of varying degrees of difficulty, e.g., in terms of variable dimensionality. Our benchmark differs from other reinforcement learning benchmarks, including the ones aiming to encode real-world difficulties, in that it is directly derived from a real-world industrial problem, which underwent minimal simplification and streamlining. It is sufficiently versatile to evaluate reinforcement learning algorithms on any real-world problem that fits our resource allocation framework. We provide results of standard baseline methods. Going beyond the usual training reward curves, our results and the statistical tools used to interpret them allow to highlight interesting limitations of we",
    "link": "http://arxiv.org/abs/2307.02991",
    "context": "Title: ContainerGym: A Real-World Reinforcement Learning Benchmark for Resource Allocation. (arXiv:2307.02991v1 [cs.LG])\nAbstract: We present ContainerGym, a benchmark for reinforcement learning inspired by a real-world industrial resource allocation task. The proposed benchmark encodes a range of challenges commonly encountered in real-world sequential decision making problems, such as uncertainty. It can be configured to instantiate problems of varying degrees of difficulty, e.g., in terms of variable dimensionality. Our benchmark differs from other reinforcement learning benchmarks, including the ones aiming to encode real-world difficulties, in that it is directly derived from a real-world industrial problem, which underwent minimal simplification and streamlining. It is sufficiently versatile to evaluate reinforcement learning algorithms on any real-world problem that fits our resource allocation framework. We provide results of standard baseline methods. Going beyond the usual training reward curves, our results and the statistical tools used to interpret them allow to highlight interesting limitations of we",
    "path": "papers/23/07/2307.02991.json",
    "total_tokens": 852,
    "translated_title": "ContainerGym: 一种针对资源分配的现实强化学习基准",
    "translated_abstract": "我们提出了ContainerGym，一种受到真实世界工业资源分配任务启发的强化学习基准。所提出的基准编码了一系列常见的真实世界顺序决策问题中遇到的挑战，如不确定性。它可以配置成不同难度的问题，例如变量维度。与其他针对编码真实世界困难的强化学习基准不同的是，我们的基准直接来源于一个经过最小化简和精简的真实世界工业问题。它足够灵活，可以在适用于我们资源分配框架的任何真实世界问题上评估强化学习算法。我们提供了标准基准方法的结果。除了通常的训练奖励曲线，我们的结果和用于解释它们的统计工具允许突出显示我们的所提算法的一些有趣局限性。",
    "tldr": "ContainerGym是一个受到真实世界工业资源分配任务启发的强化学习基准，将一系列常见的真实世界挑战编码进去，从而在任何真实世界问题上评估强化学习算法。",
    "en_tdlr": "ContainerGym is a reinforcement learning benchmark inspired by a real-world industrial resource allocation task, encoding a range of challenges commonly encountered in real-world problems, aiming to evaluate reinforcement learning algorithms on any real-world problem."
}