{
    "title": "Origin-Destination Travel Time Oracle for Map-based Services. (arXiv:2307.03048v1 [cs.LG])",
    "abstract": "Given an origin (O), a destination (D), and a departure time (T), an Origin-Destination (OD) travel time oracle~(ODT-Oracle) returns an estimate of the time it takes to travel from O to D when departing at T. ODT-Oracles serve important purposes in map-based services. To enable the construction of such oracles, we provide a travel-time estimation (TTE) solution that leverages historical trajectories to estimate time-varying travel times for OD pairs.  The problem is complicated by the fact that multiple historical trajectories with different travel times may connect an OD pair, while trajectories may vary from one another. To solve the problem, it is crucial to remove outlier trajectories when doing travel time estimation for future queries.  We propose a novel, two-stage framework called Diffusion-based Origin-destination Travel Time Estimation (DOT), that solves the problem. First, DOT employs a conditioned Pixelated Trajectories (PiT) denoiser that enables building a diffusion-based",
    "link": "http://arxiv.org/abs/2307.03048",
    "context": "Title: Origin-Destination Travel Time Oracle for Map-based Services. (arXiv:2307.03048v1 [cs.LG])\nAbstract: Given an origin (O), a destination (D), and a departure time (T), an Origin-Destination (OD) travel time oracle~(ODT-Oracle) returns an estimate of the time it takes to travel from O to D when departing at T. ODT-Oracles serve important purposes in map-based services. To enable the construction of such oracles, we provide a travel-time estimation (TTE) solution that leverages historical trajectories to estimate time-varying travel times for OD pairs.  The problem is complicated by the fact that multiple historical trajectories with different travel times may connect an OD pair, while trajectories may vary from one another. To solve the problem, it is crucial to remove outlier trajectories when doing travel time estimation for future queries.  We propose a novel, two-stage framework called Diffusion-based Origin-destination Travel Time Estimation (DOT), that solves the problem. First, DOT employs a conditioned Pixelated Trajectories (PiT) denoiser that enables building a diffusion-based",
    "path": "papers/23/07/2307.03048.json",
    "total_tokens": 905,
    "translated_title": "基于地图服务的起点-终点出行时间预测系统",
    "translated_abstract": "给定一个起点(O)，一个终点(D)和一个出发时间(T)，起点-终点出行时间预测系统(ODT-Oracle)会返回在T时间出发从O到D所需的时间估计。ODT-Oracle在基于地图的服务中起着重要作用。为了构建这样的预测系统，我们提供了一种利用历史轨迹估计OD对的时间变化的出行时间估计(TTE)方法。由于连接OD对的多个历史轨迹可能有不同的旅行时间，而且轨迹可能互不相同，因此解决这个问题时去除异常轨迹至关重要。我们提出了一种新颖的两阶段框架Diffusion-based Origin-destination Travel Time Estimation (DOT)来解决这个问题。首先，DOT使用Pixelated Trajectories (PiT)去噪器来建立基于扩散的轨迹估计模型来预测未来查询的出行时间。",
    "tldr": "本论文提出了一种基于地图服务的起点-终点出行时间预测系统，通过利用历史轨迹估计OD对的时间变化，解决了多个历史轨迹与异常轨迹之间的复杂性问题。",
    "en_tdlr": "This paper proposes an origin-destination travel time prediction system for map-based services, which estimates the time-varying travel times for OD pairs by leveraging historical trajectories. It addresses the challenge of multiple historical trajectories and outlier trajectories, and introduces a novel two-stage framework called Diffusion-based Origin-destination Travel Time Estimation (DOT)."
}