{
    "title": "The Evolution of Substance Use Coverage in the Philadelphia Inquirer. (arXiv:2307.01299v1 [cs.CL])",
    "abstract": "The media's representation of illicit substance use can lead to harmful stereotypes and stigmatization for individuals struggling with addiction, ultimately influencing public perception, policy, and public health outcomes. To explore how the discourse and coverage of illicit drug use changed over time, this study analyzes 157,476 articles published in the Philadelphia Inquirer over a decade. Specifically, the study focuses on articles that mentioned at least one commonly abused substance, resulting in a sample of 3,903 articles. Our analysis shows that cannabis and narcotics are the most frequently discussed classes of drugs. Hallucinogenic drugs are portrayed more positively than other categories, whereas narcotics are portrayed the most negatively. Our research aims to highlight the need for accurate and inclusive portrayals of substance use and addiction in the media.",
    "link": "http://arxiv.org/abs/2307.01299",
    "context": "Title: The Evolution of Substance Use Coverage in the Philadelphia Inquirer. (arXiv:2307.01299v1 [cs.CL])\nAbstract: The media's representation of illicit substance use can lead to harmful stereotypes and stigmatization for individuals struggling with addiction, ultimately influencing public perception, policy, and public health outcomes. To explore how the discourse and coverage of illicit drug use changed over time, this study analyzes 157,476 articles published in the Philadelphia Inquirer over a decade. Specifically, the study focuses on articles that mentioned at least one commonly abused substance, resulting in a sample of 3,903 articles. Our analysis shows that cannabis and narcotics are the most frequently discussed classes of drugs. Hallucinogenic drugs are portrayed more positively than other categories, whereas narcotics are portrayed the most negatively. Our research aims to highlight the need for accurate and inclusive portrayals of substance use and addiction in the media.",
    "path": "papers/23/07/2307.01299.json",
    "total_tokens": 809,
    "translated_title": "费城查问报中物质使用报道的演变",
    "translated_abstract": "媒体对非法物质使用的表述可能导致对与成瘾斗争的个体产生有害的刻板印象和污名化，最终影响公众对待成瘾问题的看法、政策和公共卫生结果。为了探索非法药物使用的言论和报道如何随时间变化，该研究分析了费城查问报在十年间发表的157,476篇文章。具体而言，该研究聚焦于提及至少一种常见滥用物质的文章，得到了3,903篇文章的样本。我们的分析显示，大麻和麻醉药是最经常被讨论的毒品类别。幻觉药物比其他类别更正面地呈现，而麻醉药则是最负面的。我们的研究旨在突出媒体对物质使用和成瘾的准确和包容性描述的必要性。",
    "tldr": "该研究分析了费城查问报十年间发表的157,476篇文章，突出了对物质使用和成瘾的准确和包容性描述的重要性。"
}