{
    "title": "Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])",
    "abstract": "I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.",
    "link": "http://arxiv.org/abs/2307.14203",
    "context": "Title: Dynamic Regression Discontinuity: A Within-Design Approach. (arXiv:2307.14203v1 [econ.EM])\nAbstract: I propose a novel argument to point identify economically interpretable intertemporal treatment effects in dynamic regression discontinuity designs (RDDs). Specifically, I develop a dynamic potential outcomes model and specialize two assumptions of the difference-in-differences literature, the no anticipation and common trends restrictions, to point identify cutoff-specific impulse responses. The estimand associated with each target parameter can be expressed as the sum of two static RDD outcome contrasts, thereby allowing for estimation via standard local polynomial tools. I leverage a limited path independence assumption to reduce the dimensionality of the problem.",
    "path": "papers/23/07/2307.14203.json",
    "total_tokens": 776,
    "translated_title": "动态回归不连续性：一种内部设计方法。",
    "translated_abstract": "我提出了一种新颖的论证方法，用来在动态回归不连续性设计中确定经济可解释的时间间隔处理效应。具体而言，我发展了一个动态潜在结果模型，并特地对差异-in-differences文献中的两个假设进行了专门化处理，即无预期和共同趋势限制，以确定指定切点的冲击反应。与每个目标参数相关的估计量可以表示为两个静态回归不连续性设计结果对比的和，从而可以通过标准的局部多项式工具进行估计。我利用有限路径独立性假设来降低问题的维度。",
    "tldr": "该论文提出了一种动态回归不连续性设计方法，用于确定经济可解释的时间间隔处理效应。研究采用了动态潜在结果模型，并特别对无预期和共同趋势限制进行了处理，以确定指定切点的冲击反应。估计量可以通过标准的局部多项式方法进行计算。"
}