{
    "title": "Exploring Perspectives on the Impact of Artificial Intelligence on the Creativity of Knowledge Work: Beyond Mechanised Plagiarism and Stochastic Parrots. (arXiv:2307.10751v1 [cs.HC])",
    "abstract": "Artificial Intelligence (AI), and in particular generative models, are transformative tools for knowledge work. They problematise notions of creativity, originality, plagiarism, the attribution of credit, and copyright ownership. Critics of generative models emphasise the reliance on large amounts of training data, and view the output of these models as no more than randomised plagiarism, remix, or collage of the source data. On these grounds, many have argued for stronger regulations on the deployment, use, and attribution of the output of these models. However, these issues are not new or unique to artificial intelligence. In this position paper, using examples from literary criticism, the history of art, and copyright law, I show how creativity and originality resist definition as a notatable or information-theoretic property of an object, and instead can be seen as the property of a process, an author, or a viewer. Further alternative views hold that all creative work is essentiall",
    "link": "http://arxiv.org/abs/2307.10751",
    "context": "Title: Exploring Perspectives on the Impact of Artificial Intelligence on the Creativity of Knowledge Work: Beyond Mechanised Plagiarism and Stochastic Parrots. (arXiv:2307.10751v1 [cs.HC])\nAbstract: Artificial Intelligence (AI), and in particular generative models, are transformative tools for knowledge work. They problematise notions of creativity, originality, plagiarism, the attribution of credit, and copyright ownership. Critics of generative models emphasise the reliance on large amounts of training data, and view the output of these models as no more than randomised plagiarism, remix, or collage of the source data. On these grounds, many have argued for stronger regulations on the deployment, use, and attribution of the output of these models. However, these issues are not new or unique to artificial intelligence. In this position paper, using examples from literary criticism, the history of art, and copyright law, I show how creativity and originality resist definition as a notatable or information-theoretic property of an object, and instead can be seen as the property of a process, an author, or a viewer. Further alternative views hold that all creative work is essentiall",
    "path": "papers/23/07/2307.10751.json",
    "total_tokens": 989,
    "translated_title": "探讨人工智能对知识工作创造力的影响：超越机械化抄袭和随机鹦鹉的视角",
    "translated_abstract": "人工智能（AI），尤其是生成模型，是知识工作的变革性工具。它们问题化了创造力、原创性、抄袭、归属权和版权所有权的概念。对生成模型的批评者强调其依赖大量的训练数据，并将这些模型的输出视为随机的抄袭、混搭或者拼贴源数据。基于这些理由，许多人主张对这些模型的部署、使用和输出的归属加强监管。然而，这些问题并不是人工智能独有的，也不是新问题。在这篇立场论文中，我使用文学批评、艺术史和版权法的例子，展示了创造力和原创性如何抵抗被定义为一个对象的可注释或信息论属性，而可见为一个过程、一个作者或一个观看者的属性。一些替代观点认为创造性工作实质上是一种需求一定程度的模仿、颠倒和重新组合。",
    "tldr": "人工智能对知识工作的创造力有着深远的影响，但是对生成模型的批评者认为其输出只是随机的抄袭和混搭。然而，创造力和原创性的定义是复杂的，可能是一个过程、一个作者或一个观看者的属性。"
}