{
    "title": "Only-child matching penalty in the marriage market. (arXiv:2307.15336v1 [econ.GN])",
    "abstract": "This study explores the marriage matching of only-child individuals and its outcome. Specifically, we analyze two aspects. First, we investigate how marital status (i.e., marriage with an only child, that with a non-only child and remaining single) differs between only children and non-only children. This analysis allows us to know whether people choose mates in a positive or a negative assortative manner regarding only-child status, and to predict whether only-child individuals benefit from marriage matching premiums or are subject to penalties regarding partner attractiveness. Second, we measure the premium/penalty by the size of the gap in partner's socio economic status (SES, here, years of schooling) between only-child and non--only-child individuals. The conventional economic theory and the observed marriage patterns of positive assortative mating on only-child status predict that only-child individuals are subject to a matching penalty in the marriage market, especially when the",
    "link": "http://arxiv.org/abs/2307.15336",
    "context": "Title: Only-child matching penalty in the marriage market. (arXiv:2307.15336v1 [econ.GN])\nAbstract: This study explores the marriage matching of only-child individuals and its outcome. Specifically, we analyze two aspects. First, we investigate how marital status (i.e., marriage with an only child, that with a non-only child and remaining single) differs between only children and non-only children. This analysis allows us to know whether people choose mates in a positive or a negative assortative manner regarding only-child status, and to predict whether only-child individuals benefit from marriage matching premiums or are subject to penalties regarding partner attractiveness. Second, we measure the premium/penalty by the size of the gap in partner's socio economic status (SES, here, years of schooling) between only-child and non--only-child individuals. The conventional economic theory and the observed marriage patterns of positive assortative mating on only-child status predict that only-child individuals are subject to a matching penalty in the marriage market, especially when the",
    "path": "papers/23/07/2307.15336.json",
    "total_tokens": 893,
    "translated_title": "独生子女在婚姻市场中的配对惩罚",
    "translated_abstract": "本研究探讨了独生子女的婚姻配对及其结果。具体而言，我们分析了两个方面。首先，我们调查了独生子女和非独生子女之间的婚姻状况（即与独生子女、非独生子女结婚或保持单身）。这个分析让我们了解人们在选择配偶时是否根据独生子女身份采用正相关配对方式，以及独生子女是否从婚姻配对中获益或受到伴侣吸引力的惩罚。其次，我们通过独生子女和非独生子女之间伴侣社会经济地位（在这里，指受教育年限）差距的大小来衡量配对溢价/惩罚。传统的经济理论和对独生子女身份的正相关配对的观察到的婚姻模式预测，在婚姻市场上，独生子女会受到配对惩罚，尤其是当",
    "tldr": "本研究探讨了独生子女在婚姻市场中的匹配情况，并发现独生子女在配对时受到了惩罚，尤其是在伴侣的社会经济地位方面。"
}