{
    "title": "Fairness of ChatGPT and the Role Of Explainable-Guided Prompts. (arXiv:2307.11761v1 [cs.CL])",
    "abstract": "Our research investigates the potential of Large-scale Language Models (LLMs), specifically OpenAI's GPT, in credit risk assessment-a binary classification task. Our findings suggest that LLMs, when directed by judiciously designed prompts and supplemented with domain-specific knowledge, can parallel the performance of traditional Machine Learning (ML) models. Intriguingly, they achieve this with significantly less data-40 times less, utilizing merely 20 data points compared to the ML's 800. LLMs particularly excel in minimizing false positives and enhancing fairness, both being vital aspects of risk analysis. While our results did not surpass those of classical ML models, they underscore the potential of LLMs in analogous tasks, laying a groundwork for future explorations into harnessing the capabilities of LLMs in diverse ML tasks.",
    "link": "http://arxiv.org/abs/2307.11761",
    "context": "Title: Fairness of ChatGPT and the Role Of Explainable-Guided Prompts. (arXiv:2307.11761v1 [cs.CL])\nAbstract: Our research investigates the potential of Large-scale Language Models (LLMs), specifically OpenAI's GPT, in credit risk assessment-a binary classification task. Our findings suggest that LLMs, when directed by judiciously designed prompts and supplemented with domain-specific knowledge, can parallel the performance of traditional Machine Learning (ML) models. Intriguingly, they achieve this with significantly less data-40 times less, utilizing merely 20 data points compared to the ML's 800. LLMs particularly excel in minimizing false positives and enhancing fairness, both being vital aspects of risk analysis. While our results did not surpass those of classical ML models, they underscore the potential of LLMs in analogous tasks, laying a groundwork for future explorations into harnessing the capabilities of LLMs in diverse ML tasks.",
    "path": "papers/23/07/2307.11761.json",
    "total_tokens": 949,
    "translated_title": "ChatGPT的公平性及可解释引导提示的作用",
    "translated_abstract": "我们的研究探讨了大规模语言模型（LLMs）在信用风险评估中的潜力，具体来说是OpenAI的GPT，在一个二分类任务中。我们的发现表明，当LLMs受到精心设计的提示指导并补充领域特定知识时，其表现可以与传统的机器学习模型相媲美。有趣的是，他们只使用了少得多的数据-仅仅20个数据点，而传统机器学习模型需要800个数据点，从而实现了与传统模型相当的性能。LLMs在减小误报提升公平性方面表现出色，这两个方面在风险分析中至关重要。尽管我们的结果没有超过传统的机器学习模型，但它们强调了LLMs在类似任务中的潜力，为未来在多样化的机器学习任务中利用LLMs的能力奠定基础。",
    "tldr": "本研究调查了ChatGPT在信用风险评估中的潜力，发现通过精心设计的提示指导和领域特定知识的补充，ChatGPT能够与传统机器学习模型相媲美，使用的数据量少至传统模型的1/40，表现优异，尤其擅长减小误报并提升公平性。这为未来在其他类似任务中充分利用ChatGPT的能力奠定了基础。"
}