{
    "title": "Learning minimal representations of stochastic processes with variational autoencoders. (arXiv:2307.11608v1 [cond-mat.soft])",
    "abstract": "Stochastic processes have found numerous applications in science, as they are broadly used to model a variety of natural phenomena. Due to their intrinsic randomness and uncertainty, they are however difficult to characterize. Here, we introduce an unsupervised machine learning approach to determine the minimal set of parameters required to effectively describe the dynamics of a stochastic process. Our method builds upon an extended $\\beta$-variational autoencoder architecture. By means of simulated datasets corresponding to paradigmatic diffusion models, we showcase its effectiveness in extracting the minimal relevant parameters that accurately describe these dynamics. Furthermore, the method enables the generation of new trajectories that faithfully replicate the expected stochastic behavior. Overall, our approach enables for the autonomous discovery of unknown parameters describing stochastic processes, hence enhancing our comprehension of complex phenomena across various fields.",
    "link": "http://arxiv.org/abs/2307.11608",
    "context": "Title: Learning minimal representations of stochastic processes with variational autoencoders. (arXiv:2307.11608v1 [cond-mat.soft])\nAbstract: Stochastic processes have found numerous applications in science, as they are broadly used to model a variety of natural phenomena. Due to their intrinsic randomness and uncertainty, they are however difficult to characterize. Here, we introduce an unsupervised machine learning approach to determine the minimal set of parameters required to effectively describe the dynamics of a stochastic process. Our method builds upon an extended $\\beta$-variational autoencoder architecture. By means of simulated datasets corresponding to paradigmatic diffusion models, we showcase its effectiveness in extracting the minimal relevant parameters that accurately describe these dynamics. Furthermore, the method enables the generation of new trajectories that faithfully replicate the expected stochastic behavior. Overall, our approach enables for the autonomous discovery of unknown parameters describing stochastic processes, hence enhancing our comprehension of complex phenomena across various fields.",
    "path": "papers/23/07/2307.11608.json",
    "total_tokens": 807,
    "translated_title": "使用变分自动编码器学习随机过程的最小表示",
    "translated_abstract": "随机过程在科学中有许多应用，因为它们广泛用于模拟各种自然现象。由于其固有的随机性和不确定性，它们很难进行表征。在这里，我们引入了一种无监督机器学习方法，用于确定有效描述随机过程动力学所需的最小参数集。我们的方法建立在扩展的β-变分自动编码器架构上。通过与典型扩散模型相对应的模拟数据集，我们展示了它在提取能准确描述这些动力学的最小相关参数方面的有效性。此外，该方法可以生成忠实复制预期随机行为的新轨迹。总体而言，我们的方法使得能够自动发现描述随机过程的未知参数，从而增进对各个领域中复杂现象的理解。",
    "tldr": "本文引入了一种无监督机器学习方法，使用变分自动编码器确定最小参数集，有效描述随机过程动力学，并生成能准确复制预期随机行为的新轨迹。",
    "en_tdlr": "This paper introduces an unsupervised machine learning approach using variational autoencoders to determine the minimal set of parameters that effectively describe the dynamics of stochastic processes, and generates new trajectories that accurately replicate the expected stochastic behavior."
}