{
    "title": "SpreadNUTS -- Moderate Dynamic Extension of Paths for No-U-Turn Sampling & Partitioning Visited Regions. (arXiv:2307.06279v1 [stat.CO])",
    "abstract": "Markov chain Monte Carlo (MCMC) methods have existed for a long time and the field is well-explored. The purpose of MCMC methods is to approximate a distribution through repeated sampling; most MCMC algorithms exhibit asymptotically optimal behavior in that they converge to the true distribution at the limit. However, what differentiates these algorithms are their practical convergence guarantees and efficiency. While a sampler may eventually approximate a distribution well, because it is used in the real world it is necessary that the point at which the sampler yields a good estimate of the distribution is reachable in a reasonable amount of time. Similarly, if it is computationally difficult or intractable to produce good samples from a distribution for use in estimation, then there is no real-world utility afforded by the sampler. Thus, most MCMC methods these days focus on improving efficiency and speeding up convergence. However, many MCMC algorithms suffer from random walk behavi",
    "link": "http://arxiv.org/abs/2307.06279",
    "context": "Title: SpreadNUTS -- Moderate Dynamic Extension of Paths for No-U-Turn Sampling & Partitioning Visited Regions. (arXiv:2307.06279v1 [stat.CO])\nAbstract: Markov chain Monte Carlo (MCMC) methods have existed for a long time and the field is well-explored. The purpose of MCMC methods is to approximate a distribution through repeated sampling; most MCMC algorithms exhibit asymptotically optimal behavior in that they converge to the true distribution at the limit. However, what differentiates these algorithms are their practical convergence guarantees and efficiency. While a sampler may eventually approximate a distribution well, because it is used in the real world it is necessary that the point at which the sampler yields a good estimate of the distribution is reachable in a reasonable amount of time. Similarly, if it is computationally difficult or intractable to produce good samples from a distribution for use in estimation, then there is no real-world utility afforded by the sampler. Thus, most MCMC methods these days focus on improving efficiency and speeding up convergence. However, many MCMC algorithms suffer from random walk behavi",
    "path": "papers/23/07/2307.06279.json",
    "total_tokens": 877,
    "translated_title": "SpreadNUTS -- 适度动态路径扩展的逆转采样和划分访问区域",
    "translated_abstract": "马尔可夫链蒙特卡罗（MCMC）方法存在已久，该领域已经深入研究。MCMC方法的目的是通过重复采样来近似一个分布；大多数MCMC算法在渐进时都表现出最优行为，即在极限下收敛于真实分布。然而，这些算法的区别在于它们的实际收敛保证和效率。虽然采样器可能最终很好地近似了一个分布，但因为它在现实世界中使用，在合理的时间内达到采样器产生良好分布估计的点是必要的。同样，如果从一个分布中产生良好的样本用于估计在计算上很困难或无法操作，则采样器没有提供现实世界的实用性。因此，现在的大多数MCMC方法都集中于提高效率和加速收敛。然而，许多MCMC算法都受到随机游走行为的影响。",
    "tldr": "SpreadNUTS是一个逆转采样和划分访问区域的方法，旨在改善MCMC算法的效率和收敛速度。"
}