{
    "title": "Efficiency Pentathlon: A Standardized Arena for Efficiency Evaluation. (arXiv:2307.09701v1 [cs.CL])",
    "abstract": "Rising computational demands of modern natural language processing (NLP) systems have increased the barrier to entry for cutting-edge research while posing serious environmental concerns. Yet, progress on model efficiency has been impeded by practical challenges in model evaluation and comparison. For example, hardware is challenging to control due to disparate levels of accessibility across different institutions. Moreover, improvements in metrics such as FLOPs often fail to translate to progress in real-world applications. In response, we introduce Pentathlon, a benchmark for holistic and realistic evaluation of model efficiency. Pentathlon focuses on inference, which accounts for a majority of the compute in a model's lifecycle. It offers a strictly-controlled hardware platform, and is designed to mirror real-world applications scenarios. It incorporates a suite of metrics that target different aspects of efficiency, including latency, throughput, memory overhead, and energy consump",
    "link": "http://arxiv.org/abs/2307.09701",
    "context": "Title: Efficiency Pentathlon: A Standardized Arena for Efficiency Evaluation. (arXiv:2307.09701v1 [cs.CL])\nAbstract: Rising computational demands of modern natural language processing (NLP) systems have increased the barrier to entry for cutting-edge research while posing serious environmental concerns. Yet, progress on model efficiency has been impeded by practical challenges in model evaluation and comparison. For example, hardware is challenging to control due to disparate levels of accessibility across different institutions. Moreover, improvements in metrics such as FLOPs often fail to translate to progress in real-world applications. In response, we introduce Pentathlon, a benchmark for holistic and realistic evaluation of model efficiency. Pentathlon focuses on inference, which accounts for a majority of the compute in a model's lifecycle. It offers a strictly-controlled hardware platform, and is designed to mirror real-world applications scenarios. It incorporates a suite of metrics that target different aspects of efficiency, including latency, throughput, memory overhead, and energy consump",
    "path": "papers/23/07/2307.09701.json",
    "total_tokens": 926,
    "translated_title": "Efficiency Pentathlon: 一项用于效率评估的标准竞技场",
    "translated_abstract": "现代自然语言处理（NLP）系统的计算需求不断增加，增加了最前沿研究的准入门槛，同时引发了严重的环境问题。然而，模型效率的进展受到了模型评估和比较中的实际挑战的阻碍。例如，由于不同机构之间的可访问性差异，硬件控制具有挑战性。此外，FLOP等指标的改进通常无法转化为现实世界应用的进展。作为回应，我们引入了Pentathlon，这是一个用于整体和真实评估模型效率的基准测试。Pentathlon专注于推理，这在模型生命周期中占大多数计算。它提供了一个严格控制的硬件平台，并设计为模拟现实世界的应用场景。它包含了一套针对效率不同方面的度量标准，包括延迟、吞吐量、内存开销和能量消耗。",
    "tldr": "一项名为Pentathlon的效率评估竞技场被引入，旨在解决现代自然语言处理系统在模型效率评估和比较方面面临的挑战。该竞技场提供了严格控制的硬件平台，能够模拟现实世界的应用场景，同时集成了多个指标来评测不同方面的效率表现。"
}