{
    "title": "Quantum Neural Estimation of Entropies",
    "abstract": "Entropy measures quantify the amount of information and correlation present in a quantum system. In practice, when the quantum state is unknown and only copies thereof are available, one must resort to the estimation of such entropy measures. Here we propose a variational quantum algorithm for estimating the von Neumann and R\\'enyi entropies, as well as the measured relative entropy and measured R\\'enyi relative entropy. Our approach first parameterizes a variational formula for the measure of interest by a quantum circuit and a classical neural network, and then optimizes the resulting objective over parameter space. Numerical simulations of our quantum algorithm are provided, using a noiseless quantum simulator. The algorithm provides accurate estimates of the various entropy measures for the examples tested, which renders it as a promising approach for usage in downstream tasks.",
    "link": "https://arxiv.org/abs/2307.01171",
    "context": "Title: Quantum Neural Estimation of Entropies\nAbstract: Entropy measures quantify the amount of information and correlation present in a quantum system. In practice, when the quantum state is unknown and only copies thereof are available, one must resort to the estimation of such entropy measures. Here we propose a variational quantum algorithm for estimating the von Neumann and R\\'enyi entropies, as well as the measured relative entropy and measured R\\'enyi relative entropy. Our approach first parameterizes a variational formula for the measure of interest by a quantum circuit and a classical neural network, and then optimizes the resulting objective over parameter space. Numerical simulations of our quantum algorithm are provided, using a noiseless quantum simulator. The algorithm provides accurate estimates of the various entropy measures for the examples tested, which renders it as a promising approach for usage in downstream tasks.",
    "path": "papers/23/07/2307.01171.json",
    "total_tokens": 717,
    "translated_title": "量子神经熵估计",
    "translated_abstract": "熵度量量子系统中信息和相关性的量。在实践中，当量子态未知且仅有其副本可用时，必须进行熵度量的估计。本文提出了一种用于估计冯诺依曼熵、R\\'enyi熵、测量相对熵和测量R\\'enyi相对熵的变分量子算法。我们的方法首先通过一个量子电路和一个经典神经网络对感兴趣的度量进行参数化，然后在参数空间上优化得到的目标。我们使用无噪声量子模拟器进行了数值模拟。该算法对所测试的各种熵度量提供了准确的估计，表明它是在下游任务中使用的一种有希望的方法。",
    "tldr": "本文提出了一种量子神经网络算法，可以准确估计量子系统中的熵度量，并表明其在下游任务中有潜在应用价值。"
}