{
    "title": "A numerical algorithm for attaining the Chebyshev bound in optimal learning. (arXiv:2307.01304v1 [math.OC])",
    "abstract": "Given a compact subset of a Banach space, the Chebyshev center problem consists of finding a minimal circumscribing ball containing the set. In this article we establish a numerically tractable algorithm for solving the Chebyshev center problem in the context of optimal learning from a finite set of data points. For a hypothesis space realized as a compact but not necessarily convex subset of a finite-dimensional subspace of some underlying Banach space, this algorithm computes the Chebyshev radius and the Chebyshev center of the hypothesis space, thereby solving the problem of optimal recovery of functions from data. The algorithm itself is based on, and significantly extends, recent results for near-optimal solutions of convex semi-infinite problems by means of targeted sampling, and it is of independent interest. Several examples of numerical computations of Chebyshev centers are included in order to illustrate the effectiveness of the algorithm.",
    "link": "http://arxiv.org/abs/2307.01304",
    "context": "Title: A numerical algorithm for attaining the Chebyshev bound in optimal learning. (arXiv:2307.01304v1 [math.OC])\nAbstract: Given a compact subset of a Banach space, the Chebyshev center problem consists of finding a minimal circumscribing ball containing the set. In this article we establish a numerically tractable algorithm for solving the Chebyshev center problem in the context of optimal learning from a finite set of data points. For a hypothesis space realized as a compact but not necessarily convex subset of a finite-dimensional subspace of some underlying Banach space, this algorithm computes the Chebyshev radius and the Chebyshev center of the hypothesis space, thereby solving the problem of optimal recovery of functions from data. The algorithm itself is based on, and significantly extends, recent results for near-optimal solutions of convex semi-infinite problems by means of targeted sampling, and it is of independent interest. Several examples of numerical computations of Chebyshev centers are included in order to illustrate the effectiveness of the algorithm.",
    "path": "papers/23/07/2307.01304.json",
    "total_tokens": 917,
    "translated_title": "一个求解优化学习中Chebyshev边界的数值算法",
    "translated_abstract": "给定Banach空间中的一个紧致子集，Chebyshev中心问题是找到一个最小的包围子集的球。本文在有限数据点的最优学习环境中建立了一个可计算的数值算法，用于解决Chebyshev中心问题。对于一个假设空间，它被实现为一个紧致但不一定是凸集的有限维子空间的子集，在此算法中计算了假设空间的Chebyshev半径和Chebyshev中心，从而解决了从数据中最优恢复函数的问题。该算法本身基于最近通过有针对性抽样实现的函数近似问题的近似最优解的结果，并且具有独立的兴趣。为了说明算法的有效性，本文还包括了几个数值计算Chebyshev中心的示例。",
    "tldr": "本文提出了一个数值算法，用于从有限数据点中解决优化学习中的Chebyshev边界问题。算法能够计算出假设空间的Chebyshev半径和Chebyshev中心，从而实现了从数据中最优恢复函数的目标。算法基于有针对性抽样的近似最优解，具有独立的兴趣，并通过示例展示了算法的有效性。"
}