{
    "title": "AI and Non AI Assessments for Dementia. (arXiv:2307.01210v1 [q-bio.OT])",
    "abstract": "Current progress in the artificial intelligence domain has led to the development of various types of AI-powered dementia assessments, which can be employed to identify patients at the early stage of dementia. It can revolutionize the dementia care settings. It is essential that the medical community be aware of various AI assessments and choose them considering their degrees of validity, efficiency, practicality, reliability, and accuracy concerning the early identification of patients with dementia (PwD). On the other hand, AI developers should be informed about various non-AI assessments as well as recently developed AI assessments. Thus, this paper, which can be readable by both clinicians and AI engineers, fills the gap in the literature in explaining the existing solutions for the recognition of dementia to clinicians, as well as the techniques used and the most widespread dementia datasets to AI engineers. It follows a review of papers on AI and non-AI assessments for dementia t",
    "link": "http://arxiv.org/abs/2307.01210",
    "context": "Title: AI and Non AI Assessments for Dementia. (arXiv:2307.01210v1 [q-bio.OT])\nAbstract: Current progress in the artificial intelligence domain has led to the development of various types of AI-powered dementia assessments, which can be employed to identify patients at the early stage of dementia. It can revolutionize the dementia care settings. It is essential that the medical community be aware of various AI assessments and choose them considering their degrees of validity, efficiency, practicality, reliability, and accuracy concerning the early identification of patients with dementia (PwD). On the other hand, AI developers should be informed about various non-AI assessments as well as recently developed AI assessments. Thus, this paper, which can be readable by both clinicians and AI engineers, fills the gap in the literature in explaining the existing solutions for the recognition of dementia to clinicians, as well as the techniques used and the most widespread dementia datasets to AI engineers. It follows a review of papers on AI and non-AI assessments for dementia t",
    "path": "papers/23/07/2307.01210.json",
    "total_tokens": 860,
    "translated_title": "人工智能和非人工智能评估老年痴呆",
    "translated_abstract": "当前人工智能领域的进展已经导致了各种类型的AI驱动的老年痴呆评估方法的发展，可以用于识别早期老年痴呆患者。它有可能对老年痴呆的护理模式进行革命性的改变。医疗界必须了解各种AI评估方法，并根据其在早期识别老年痴呆患者方面的准确性、效率、实用性、可靠性和准确性选择适合的方法。另一方面，AI开发人员也应了解各种非AI评估方法以及最近开发的AI评估方法。因此，本文填补了文献中对老年痴呆识别现有解决方案向医生解释的空白，同时也向AI工程师介绍了使用的技术和最普遍的老年痴呆数据集。它对医生和AI工程师都具有可读性。",
    "tldr": "本论文总结了人工智能和非人工智能评估老年痴呆的现有解决方案，并为医生和AI工程师提供了相关的技术和数据集。",
    "en_tdlr": "This paper summarizes the existing solutions for assessing dementia using both artificial intelligence and non-artificial intelligence methods, providing insights for both clinicians and AI engineers on the techniques and datasets used in this field."
}