{
    "title": "Feasibility of Universal Anomaly Detection without Knowing the Abnormality in Medical Images. (arXiv:2307.00750v2 [cs.CV] UPDATED)",
    "abstract": "Many anomaly detection approaches, especially deep learning methods, have been recently developed to identify abnormal image morphology by only employing normal images during training. Unfortunately, many prior anomaly detection methods were optimized for a specific \"known\" abnormality (e.g., brain tumor, bone fraction, cell types). Moreover, even though only the normal images were used in the training process, the abnormal images were often employed during the validation process (e.g., epoch selection, hyper-parameter tuning), which might leak the supposed ``unknown\" abnormality unintentionally. In this study, we investigated these two essential aspects regarding universal anomaly detection in medical images by (1) comparing various anomaly detection methods across four medical datasets, (2) investigating the inevitable but often neglected issues on how to unbiasedly select the optimal anomaly detection model during the validation phase using only normal images, and (3) proposing a si",
    "link": "http://arxiv.org/abs/2307.00750",
    "context": "Title: Feasibility of Universal Anomaly Detection without Knowing the Abnormality in Medical Images. (arXiv:2307.00750v2 [cs.CV] UPDATED)\nAbstract: Many anomaly detection approaches, especially deep learning methods, have been recently developed to identify abnormal image morphology by only employing normal images during training. Unfortunately, many prior anomaly detection methods were optimized for a specific \"known\" abnormality (e.g., brain tumor, bone fraction, cell types). Moreover, even though only the normal images were used in the training process, the abnormal images were often employed during the validation process (e.g., epoch selection, hyper-parameter tuning), which might leak the supposed ``unknown\" abnormality unintentionally. In this study, we investigated these two essential aspects regarding universal anomaly detection in medical images by (1) comparing various anomaly detection methods across four medical datasets, (2) investigating the inevitable but often neglected issues on how to unbiasedly select the optimal anomaly detection model during the validation phase using only normal images, and (3) proposing a si",
    "path": "papers/23/07/2307.00750.json",
    "total_tokens": 862,
    "translated_title": "不知道异常情况的情况下，医学图像的通用异常检测的可行性",
    "translated_abstract": "近年来，许多异常检测方法，特别是深度学习方法，已经被开发出来，通过仅使用正常图像进行训练，来识别异常图像形态。不幸的是，许多先前的异常检测方法是为特定的“已知”异常（例如，脑肿瘤、骨折、细胞类型）进行优化的。此外，即使在训练过程中只使用正常图像，异常图像通常也在验证过程中使用（例如，时期选择、超参数调整），这可能会意外地泄漏“未知”异常。在本研究中，我们通过（1）比较四个医学数据集上的各种异常检测方法，（2）研究在验证阶段如何公正地选择仅使用正常图像来选择最佳异常检测模型时 inevitable but often neglected 问题，以及 （3）提出了一种在医学图像中进行通用异常检测的方法。",
    "tldr": "本研究探讨了医学图像中通用异常检测的两个关键方面：比较不同的异常检测方法，解决使用正常图像进行验证过程中的偏差问题，并提出了一种通用异常检测方法。",
    "en_tdlr": "This study investigates the feasibility of universal anomaly detection in medical images by comparing different methods, addressing bias issues in validation using only normal images, and proposing a universal approach."
}