{
    "title": "The Yule-Frisch-Waugh-Lovell Theorem. (arXiv:2307.00369v1 [econ.EM])",
    "abstract": "This paper traces the historical and analytical development of what is known in the econometrics literature as the Frisch-Waugh-Lovell theorem. This theorem demonstrates that the coefficients on any subset of covariates in a multiple regression is equal to the coefficients in a regression of the residualized outcome variable on the residualized subset of covariates, where residualization uses the complement of the subset of covariates of interest. In this paper, I suggest that the theorem should be renamed as the Yule-Frisch-Waugh-Lovell (YFWL) theorem to recognize the pioneering contribution of the statistician G. Udny Yule in its development. Second, I highlight recent work by the statistician, P. Ding, which has extended the YFWL theorem to a comparison of estimated covariance matrices of coefficients from multiple and partial, i.e. residualized regressions. Third, I show that, in cases where Ding's results do not apply, one can still resort to a computational method to conduct stat",
    "link": "http://arxiv.org/abs/2307.00369",
    "context": "Title: The Yule-Frisch-Waugh-Lovell Theorem. (arXiv:2307.00369v1 [econ.EM])\nAbstract: This paper traces the historical and analytical development of what is known in the econometrics literature as the Frisch-Waugh-Lovell theorem. This theorem demonstrates that the coefficients on any subset of covariates in a multiple regression is equal to the coefficients in a regression of the residualized outcome variable on the residualized subset of covariates, where residualization uses the complement of the subset of covariates of interest. In this paper, I suggest that the theorem should be renamed as the Yule-Frisch-Waugh-Lovell (YFWL) theorem to recognize the pioneering contribution of the statistician G. Udny Yule in its development. Second, I highlight recent work by the statistician, P. Ding, which has extended the YFWL theorem to a comparison of estimated covariance matrices of coefficients from multiple and partial, i.e. residualized regressions. Third, I show that, in cases where Ding's results do not apply, one can still resort to a computational method to conduct stat",
    "path": "papers/23/07/2307.00369.json",
    "total_tokens": 959,
    "translated_title": "Yule-Frisch-Waugh-Lovell定理的发展历程和分析",
    "translated_abstract": "本文追溯了经济计量学文献中被称为Frisch-Waugh-Lovell定理的历史和分析发展。该定理证明了在多元回归中任意子集的系数等于在残差化的因变量和残差化的子集上的回归中的系数，其中残差化使用感兴趣的子集的补集。本文建议将该定理更名为Yule-Frisch-Waugh-Lovell（YFWL）定理，以承认统计学家G. Udny Yule在其发展中的开创性贡献。其次，我强调了统计学家P. Ding的最新工作，该工作将YFWL定理扩展到多个和部分（即残差化）回归的系数的估计协方差矩阵的比较。第三，我展示了在Ding的结果不适用的情况下，仍然可以使用计算方法进行统计推断。",
    "tldr": "Yule-Frisch-Waugh-Lovell定理的发展历程和分析，将该定理更名为YFWL定理以承认Yule的贡献，将该定理扩展到比较多个和部分回归的系数的估计协方差矩阵，并提供了在Ding结果不适用情况下的推断方法。"
}