{
    "title": "Joint Service Caching, Communication and Computing Resource Allocation in Collaborative MEC Systems: A DRL-based Two-timescale Approach. (arXiv:2307.09691v1 [cs.NI])",
    "abstract": "Meeting the strict Quality of Service (QoS) requirements of terminals has imposed a signiffcant challenge on Multiaccess Edge Computing (MEC) systems, due to the limited multidimensional resources. To address this challenge, we propose a collaborative MEC framework that facilitates resource sharing between the edge servers, and with the aim to maximize the long-term QoS and reduce the cache switching cost through joint optimization of service caching, collaborative offfoading, and computation and communication resource allocation. The dual timescale feature and temporal recurrence relationship between service caching and other resource allocation make solving the problem even more challenging. To solve it, we propose a deep reinforcement learning (DRL)-based dual timescale scheme, called DGL-DDPG, which is composed of a short-term genetic algorithm (GA) and a long short-term memory network-based deep deterministic policy gradient (LSTM-DDPG). In doing so, we reformulate the optimizatio",
    "link": "http://arxiv.org/abs/2307.09691",
    "context": "Title: Joint Service Caching, Communication and Computing Resource Allocation in Collaborative MEC Systems: A DRL-based Two-timescale Approach. (arXiv:2307.09691v1 [cs.NI])\nAbstract: Meeting the strict Quality of Service (QoS) requirements of terminals has imposed a signiffcant challenge on Multiaccess Edge Computing (MEC) systems, due to the limited multidimensional resources. To address this challenge, we propose a collaborative MEC framework that facilitates resource sharing between the edge servers, and with the aim to maximize the long-term QoS and reduce the cache switching cost through joint optimization of service caching, collaborative offfoading, and computation and communication resource allocation. The dual timescale feature and temporal recurrence relationship between service caching and other resource allocation make solving the problem even more challenging. To solve it, we propose a deep reinforcement learning (DRL)-based dual timescale scheme, called DGL-DDPG, which is composed of a short-term genetic algorithm (GA) and a long short-term memory network-based deep deterministic policy gradient (LSTM-DDPG). In doing so, we reformulate the optimizatio",
    "path": "papers/23/07/2307.09691.json",
    "total_tokens": 904,
    "translated_title": "在协作式MEC系统中的联合服务缓存、通信和计算资源分配：基于DRL的双时间尺度方法",
    "translated_abstract": "由于多维资源的限制，满足终端的严格服务质量要求对多接入边缘计算（MEC）系统构成了重要挑战。为了应对这个挑战，我们提出了一个协作式MEC框架，促进边缘服务器之间的资源共享，并通过联合优化服务缓存、协作卸载、计算和通信资源分配来最大化长期的服务质量和降低缓存切换成本。服务缓存和其他资源分配之间的双时间尺度特性和时间回归关系使解决问题变得更加困难。为了解决这个问题，我们提出了一种基于深度强化学习（DRL）的双时间尺度方案，称为DGL-DDPG，它由短期遗传算法（GA）和基于长短期记忆网络的深度确定性策略梯度（LSTM-DDPG）组成。",
    "tldr": "该论文提出了一个基于DRL的双时间尺度方案，旨在通过联合优化服务缓存、协作卸载和计算通信资源分配来提高MEC系统中的长期服务质量并降低缓存切换成本。",
    "en_tdlr": "This paper proposes a DRL-based dual timescale approach to improve long-term QoS and reduce cache switching cost in MEC systems by jointly optimizing service caching, collaborative offloading, and computation and communication resource allocation."
}