{
    "title": "Accurate deep learning sub-grid scale models for large eddy simulations. (arXiv:2307.10060v1 [physics.flu-dyn])",
    "abstract": "We present two families of sub-grid scale (SGS) turbulence models developed for large-eddy simulation (LES) purposes. Their development required the formulation of physics-informed robust and efficient Deep Learning (DL) algorithms which, unlike state-of-the-art analytical modeling techniques can produce high-order complex non-linear relations between inputs and outputs. Explicit filtering of data from direct simulations of the canonical channel flow at two friction Reynolds numbers $Re_\\tau\\approx 395$ and 590 provided accurate data for training and testing. The two sets of models use different network architectures. One of the architectures uses tensor basis neural networks (TBNN) and embeds the simplified analytical model form of the general effective-viscosity hypothesis, thus incorporating the Galilean, rotational and reflectional invariances. The other architecture is that of a relatively simple network, that is able to incorporate the Galilean invariance only. However, this simp",
    "link": "http://arxiv.org/abs/2307.10060",
    "context": "Title: Accurate deep learning sub-grid scale models for large eddy simulations. (arXiv:2307.10060v1 [physics.flu-dyn])\nAbstract: We present two families of sub-grid scale (SGS) turbulence models developed for large-eddy simulation (LES) purposes. Their development required the formulation of physics-informed robust and efficient Deep Learning (DL) algorithms which, unlike state-of-the-art analytical modeling techniques can produce high-order complex non-linear relations between inputs and outputs. Explicit filtering of data from direct simulations of the canonical channel flow at two friction Reynolds numbers $Re_\\tau\\approx 395$ and 590 provided accurate data for training and testing. The two sets of models use different network architectures. One of the architectures uses tensor basis neural networks (TBNN) and embeds the simplified analytical model form of the general effective-viscosity hypothesis, thus incorporating the Galilean, rotational and reflectional invariances. The other architecture is that of a relatively simple network, that is able to incorporate the Galilean invariance only. However, this simp",
    "path": "papers/23/07/2307.10060.json",
    "total_tokens": 848,
    "translated_title": "准确的深度学习子网格尺度模型用于大涡模拟",
    "translated_abstract": "我们提出了两个用于大涡模拟的子网格尺度（SGS）湍流模型系列。它们的开发需要制定经过物理验证的强大而高效的深度学习（DL）算法，与最先进的分析建模技术不同，这些算法可以产生输入和输出之间的高阶复杂非线性关系。通过从两个摩擦雷诺数约为395和590的典型通道流的直接模拟数据进行显式滤波，提供了用于训练和测试的准确数据。这两组模型使用不同的网络架构。其中一种架构使用张量基神经网络（TBNN），嵌入了简化的分析模型形式的一般有效粘性假设，从而融入了伽利略、旋转和反射不变性。而另一种架构是一个相对简单的网络，它只能融入伽利略不变性。",
    "tldr": "本文提出了两个用于大涡模拟的子网格尺度模型，采用深度学习算法并与分析模型相比能够处理更复杂的非线性关系。其中一个模型融入了多个不变性，另一个只融入了伽利略不变性。"
}