{
    "title": "Basal-Bolus Advisor for Type 1 Diabetes (T1D) Patients Using Multi-Agent Reinforcement Learning (RL) Methodology. (arXiv:2307.08897v1 [cs.LG])",
    "abstract": "This paper presents a novel multi-agent reinforcement learning (RL) approach for personalized glucose control in individuals with type 1 diabetes (T1D). The method employs a closed-loop system consisting of a blood glucose (BG) metabolic model and a multi-agent soft actor-critic RL model acting as the basal-bolus advisor. Performance evaluation is conducted in three scenarios, comparing the RL agents to conventional therapy. Evaluation metrics include glucose levels (minimum, maximum, and mean), time spent in different BG ranges, and average daily bolus and basal insulin dosages. Results demonstrate that the RL-based basal-bolus advisor significantly improves glucose control, reducing glycemic variability and increasing time spent within the target range (70-180 mg/dL). Hypoglycemia events are effectively prevented, and severe hyperglycemia events are reduced. The RL approach also leads to a statistically significant reduction in average daily basal insulin dosage compared to conventio",
    "link": "http://arxiv.org/abs/2307.08897",
    "context": "Title: Basal-Bolus Advisor for Type 1 Diabetes (T1D) Patients Using Multi-Agent Reinforcement Learning (RL) Methodology. (arXiv:2307.08897v1 [cs.LG])\nAbstract: This paper presents a novel multi-agent reinforcement learning (RL) approach for personalized glucose control in individuals with type 1 diabetes (T1D). The method employs a closed-loop system consisting of a blood glucose (BG) metabolic model and a multi-agent soft actor-critic RL model acting as the basal-bolus advisor. Performance evaluation is conducted in three scenarios, comparing the RL agents to conventional therapy. Evaluation metrics include glucose levels (minimum, maximum, and mean), time spent in different BG ranges, and average daily bolus and basal insulin dosages. Results demonstrate that the RL-based basal-bolus advisor significantly improves glucose control, reducing glycemic variability and increasing time spent within the target range (70-180 mg/dL). Hypoglycemia events are effectively prevented, and severe hyperglycemia events are reduced. The RL approach also leads to a statistically significant reduction in average daily basal insulin dosage compared to conventio",
    "path": "papers/23/07/2307.08897.json",
    "total_tokens": 1038,
    "translated_title": "基于多智能体强化学习方法的一型糖尿病（T1D）患者基础-推荐剂量顾问",
    "translated_abstract": "本文提出了一种针对一型糖尿病（T1D）患者个性化血糖控制的新型多智能体强化学习（RL）方法。该方法采用闭环系统，包括血糖代谢模型和作为基础-推荐剂量顾问的多智能体软性演员-评论家RL模型。通过比较RL代理与传统治疗在三个场景下的性能评估，评估指标包括血糖水平（最低、最高和平均），在不同血糖范围内的时间，以及平均每日推荐剂量和基础胰岛素剂量。结果表明，基于RL的基础-推荐剂量顾问显著改善了血糖控制，减小了血糖变异性，增加了在目标范围（70-180 mg/dL）内的时间。低血糖事件得到有效预防，严重高血糖事件得到减少。RL方法还导致与传统方法相比，平均每日基础胰岛素剂量有统计学显著减少。",
    "tldr": "本文提出了一种基于多智能体强化学习方法的一型糖尿病患者个性化血糖控制系统，通过显著改善血糖控制、减少血糖变异性以及预防低血糖事件等，该方法具有潜力成为一种有效的治疗方法。",
    "en_tdlr": "This paper proposes a personalized glucose control system for type 1 diabetes patients using a novel multi-agent reinforcement learning approach. The method significantly improves glucose control, reduces glycemic variability, and prevents hypoglycemic events, making it a promising treatment."
}