{
    "title": "A comparison of machine learning surrogate models of street-scale flooding in Norfolk, Virginia. (arXiv:2307.14185v1 [cs.LG])",
    "abstract": "Low-lying coastal cities, exemplified by Norfolk, Virginia, face the challenge of street flooding caused by rainfall and tides, which strain transportation and sewer systems and can lead to property damage. While high-fidelity, physics-based simulations provide accurate predictions of urban pluvial flooding, their computational complexity renders them unsuitable for real-time applications. Using data from Norfolk rainfall events between 2016 and 2018, this study compares the performance of a previous surrogate model based on a random forest algorithm with two deep learning models: Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU). This investigation underscores the importance of using a model architecture that supports the communication of prediction uncertainty and the effective integration of relevant, multi-modal features.",
    "link": "http://arxiv.org/abs/2307.14185",
    "context": "Title: A comparison of machine learning surrogate models of street-scale flooding in Norfolk, Virginia. (arXiv:2307.14185v1 [cs.LG])\nAbstract: Low-lying coastal cities, exemplified by Norfolk, Virginia, face the challenge of street flooding caused by rainfall and tides, which strain transportation and sewer systems and can lead to property damage. While high-fidelity, physics-based simulations provide accurate predictions of urban pluvial flooding, their computational complexity renders them unsuitable for real-time applications. Using data from Norfolk rainfall events between 2016 and 2018, this study compares the performance of a previous surrogate model based on a random forest algorithm with two deep learning models: Long Short-Term Memory (LSTM) and Gated Recurrent Unit (GRU). This investigation underscores the importance of using a model architecture that supports the communication of prediction uncertainty and the effective integration of relevant, multi-modal features.",
    "path": "papers/23/07/2307.14185.json",
    "total_tokens": 920,
    "translated_title": "《弗吉尼亚诺福克市街道洪水的机器学习替代模型比较》",
    "translated_abstract": "低洼的沿海城市，如弗吉尼亚诺福克市，面临着由降雨和潮汐引起的街道洪水的挑战，这给交通和下水道系统造成了压力，并可能导致财产损失。虽然高保真的基于物理的模拟能够准确预测城市暴雨洪水，但它们的计算复杂性使它们不适用于实时应用。本研究利用2016年至2018年间弗吉尼亚诺福克市暴雨事件的数据，比较了基于随机森林算法的先前替代模型与两个深度学习模型（长短时记忆LSTM和门式循环单元GRU）的性能。这项研究强调了使用支持预测不确定性传达和有效集成相关多模态特征的模型架构的重要性。",
    "tldr": "本研究比较了基于随机森林算法的先前替代模型与两个深度学习模型（LSTM和GRU）在弗吉尼亚诺福克市街道洪水的性能。结果表明，选择支持预测不确定性传达和有效集成多模态特征的模型架构十分重要。",
    "en_tdlr": "This study compares the performance of a previous surrogate model based on a random forest algorithm with two deep learning models (LSTM and GRU) in street-scale flooding in Norfolk, Virginia. The results emphasize the importance of choosing a model architecture that supports the communication of prediction uncertainty and the effective integration of relevant, multi-modal features."
}