{
    "title": "Yelp Reviews and Food Types: A Comparative Analysis of Ratings, Sentiments, and Topics. (arXiv:2307.10826v1 [cs.CL])",
    "abstract": "This study examines the relationship between Yelp reviews and food types, investigating how ratings, sentiments, and topics vary across different types of food. Specifically, we analyze how ratings and sentiments of reviews vary across food types, cluster food types based on ratings and sentiments, infer review topics using machine learning models, and compare topic distributions among different food types. Our analyses reveal that some food types have similar ratings, sentiments, and topics distributions, while others have distinct patterns. We identify four clusters of food types based on ratings and sentiments and find that reviewers tend to focus on different topics when reviewing certain food types. These findings have important implications for understanding user behavior and cultural influence on digital media platforms and promoting cross-cultural understanding and appreciation.",
    "link": "http://arxiv.org/abs/2307.10826",
    "context": "Title: Yelp Reviews and Food Types: A Comparative Analysis of Ratings, Sentiments, and Topics. (arXiv:2307.10826v1 [cs.CL])\nAbstract: This study examines the relationship between Yelp reviews and food types, investigating how ratings, sentiments, and topics vary across different types of food. Specifically, we analyze how ratings and sentiments of reviews vary across food types, cluster food types based on ratings and sentiments, infer review topics using machine learning models, and compare topic distributions among different food types. Our analyses reveal that some food types have similar ratings, sentiments, and topics distributions, while others have distinct patterns. We identify four clusters of food types based on ratings and sentiments and find that reviewers tend to focus on different topics when reviewing certain food types. These findings have important implications for understanding user behavior and cultural influence on digital media platforms and promoting cross-cultural understanding and appreciation.",
    "path": "papers/23/07/2307.10826.json",
    "total_tokens": 851,
    "translated_title": "Yelp评论和食物类型: 对评分、情感和主题进行比较分析",
    "translated_abstract": "本研究考察了Yelp评论和食物类型之间的关系，研究了评分、情感和主题在不同类型食物之间的变化。具体而言，我们分析了评论评分和情感在不同食物类型中的变化，基于评分和情感对食物类型进行聚类，使用机器学习模型推断评论主题，并比较不同食物类型的主题分布。我们的分析揭示了一些食物类型具有相似的评分、情感和主题分布，而其他类型具有不同的模式。我们基于评分和情感鉴别出了四类食物类型，并发现评论者在评论某些食物类型时倾向于关注不同的主题。这些发现对于了解用户行为、文化对数字媒体平台的影响以及促进跨文化理解和欣赏具有重要意义。",
    "tldr": "本研究比较分析了Yelp评论和食物类型之间的关系，发现不同类型的食物在评分、情感和主题上有不同的变化和分布。研究还提出了四类食物类型，并发现评论者在评论不同类型的食物时倾向于关注不同的主题。",
    "en_tdlr": "This study provides a comparative analysis of the relationship between Yelp reviews and food types, revealing that different types of food have varying ratings, sentiments, and topic distributions. The study also identifies four clusters of food types and highlights that reviewers tend to focus on different topics when reviewing different types of food."
}