{
    "title": "A Classical Model of Speculative Asset Price Dynamics. (arXiv:2307.00410v1 [q-fin.GN])",
    "abstract": "In retrospect, the experimental findings on competitive market behavior called for a revival of the old, classical, view of competition as a collective higgling and bargaining process (as opposed to price-taking behaviors) founded on reservation prices (in place of the utility function). In this paper, we specialize the classical methodology to deal with speculation, an important impediment to price stability. The model involves typical features of a field or lab asset market setup and lends itself to an experimental test of its specific predictions; here we use the model to explain three general stylized facts, well established both empirically and experimentally: the excess, fat-tailed, and clustered volatility of speculative asset prices. The fat tails emerge in the model from the amplifying nature of speculation, leading to a random-coefficient autoregressive return process (and power-law tails); the volatility clustering is due to the traders' long memory of news; bubbles are a pe",
    "link": "http://arxiv.org/abs/2307.00410",
    "context": "Title: A Classical Model of Speculative Asset Price Dynamics. (arXiv:2307.00410v1 [q-fin.GN])\nAbstract: In retrospect, the experimental findings on competitive market behavior called for a revival of the old, classical, view of competition as a collective higgling and bargaining process (as opposed to price-taking behaviors) founded on reservation prices (in place of the utility function). In this paper, we specialize the classical methodology to deal with speculation, an important impediment to price stability. The model involves typical features of a field or lab asset market setup and lends itself to an experimental test of its specific predictions; here we use the model to explain three general stylized facts, well established both empirically and experimentally: the excess, fat-tailed, and clustered volatility of speculative asset prices. The fat tails emerge in the model from the amplifying nature of speculation, leading to a random-coefficient autoregressive return process (and power-law tails); the volatility clustering is due to the traders' long memory of news; bubbles are a pe",
    "path": "papers/23/07/2307.00410.json",
    "total_tokens": 1252,
    "translated_title": "回顾性地，对于竞争市场行为的实验发现呼唤了旧的、经典的竞争观点的复兴，将竞争视为一个集体讨价还价过程（而不是价格接受行为），该过程基于预定价格（而非效用函数）。在本文中，我们将经典方法特化以处理价格稳定性的一个重要阻碍——投机行为。该模型涉及到一个现场或实验室资产市场设置的典型特征，并可用于对其特定预测进行实验证明；在这里，我们使用该模型来解释三个一般的特征事实，这些事实在经验和实验上都被充分验证：投机性资产价格的过度波动、尾部厚尾和聚类波动。尾部厚尾在模型中由于投机性质的放大导致，产生了一个随机系数自回归收益过程（以及幂律尾部）；波动的聚类性质是由交易者对新闻的长期记忆所引起的；泡沫是一种",
    "translated_abstract": "回顾性地，对竞争市场行为的实验发现引发了对经典竞争观点的复兴，将竞争视为基于预定价格的集体讨价还价过程，而不是价格接受行为。本文将经典方法应用于处理价格稳定性的重要障碍之一——投机行为。该模型是基于现场或实验室资产市场设置的典型特征，并可用于实验验证其具体预测。本文利用该模型解释了投机性资产价格的三个经验和实验上已经充分验证的一般特征：过度波动、尾部厚尾和聚类波动。模型中的尾部厚尾是由于投机性质的放大造成的，从而产生了随机系数自回归的收益过程（以及幂律尾部）；波动的聚类性质是由交易者对新闻的长期记忆所引起的；而泡沫是市场的短期偏离预期的结果，产生了不可持续的资产价格上涨。",
    "tldr": "该论文通过引入经典观点，将竞争视为基于预定价格的集体讨价还价过程，并将其应用于解释投机性资产价格的波动特征。通过实验验证，该模型成功解释了过度波动、尾部厚尾和聚类波动等现象。",
    "en_tdlr": "This paper revives the classical view of competition as a collective bargaining process based on reservation prices, and applies it to explain the volatility features of speculative asset prices. By experimental validation, the model successfully explains phenomena such as excess volatility, fat tails, and volatility clustering."
}