{
    "title": "A comparative analysis of SR-GAN models. (arXiv:2307.09456v1 [cs.CV])",
    "abstract": "In this study, we evaluate the performance of multiple state-of-the-art SR GAN (Super Resolution Generative Adversarial Network) models, ESRGAN, Real-ESRGAN and EDSR, on a benchmark dataset of real-world images which undergo degradation using a pipeline. Our results show that some models seem to significantly increase the resolution of the input images while preserving their visual quality, this is assessed using Tesseract OCR engine. We observe that EDSR-BASE model from huggingface outperforms the remaining candidate models in terms of both quantitative metrics and subjective visual quality assessments with least compute overhead. Specifically, EDSR generates images with higher peak signal-to-noise ratio (PSNR) and structural similarity index (SSIM) values and are seen to return high quality OCR results with Tesseract OCR engine. These findings suggest that EDSR is a robust and effective approach for single-image super-resolution and may be particularly well-suited for applications wh",
    "link": "http://arxiv.org/abs/2307.09456",
    "context": "Title: A comparative analysis of SR-GAN models. (arXiv:2307.09456v1 [cs.CV])\nAbstract: In this study, we evaluate the performance of multiple state-of-the-art SR GAN (Super Resolution Generative Adversarial Network) models, ESRGAN, Real-ESRGAN and EDSR, on a benchmark dataset of real-world images which undergo degradation using a pipeline. Our results show that some models seem to significantly increase the resolution of the input images while preserving their visual quality, this is assessed using Tesseract OCR engine. We observe that EDSR-BASE model from huggingface outperforms the remaining candidate models in terms of both quantitative metrics and subjective visual quality assessments with least compute overhead. Specifically, EDSR generates images with higher peak signal-to-noise ratio (PSNR) and structural similarity index (SSIM) values and are seen to return high quality OCR results with Tesseract OCR engine. These findings suggest that EDSR is a robust and effective approach for single-image super-resolution and may be particularly well-suited for applications wh",
    "path": "papers/23/07/2307.09456.json",
    "total_tokens": 933,
    "translated_title": "SR-GAN模型的比较分析",
    "translated_abstract": "在这项研究中，我们评估了多个最先进的超分辨率生成对抗网络（SR GAN）模型，包括ESRGAN，Real-ESRGAN和EDSR，在一个标准数据集上以及经过降级处理的真实世界图像上的性能。我们的结果表明，一些模型似乎在保持视觉质量的同时显著提高了输入图像的分辨率，这是通过使用Tesseract OCR引擎评估的。我们观察到，来自huggingface的EDSR-BASE模型在定量指标和主观视觉质量评估方面表现优于其余候选模型，并且计算开销最小。具体而言，EDSR生成具有较高峰值信噪比（PSNR）和结构相似性指数（SSIM）值的图像，并在Tesseract OCR引擎下返回高质量的OCR结果。这些发现表明，EDSR是一种稳健有效的单图像超分辨率方法，特别适合于需要OCR的应用场景。",
    "tldr": "本研究比较分析了多个最先进的SR-GAN模型，结果发现EDSR模型在保持视觉质量的同时显著提高了输入图像的分辨率，具有较高的PSNR和SSIM值，并且返回高质量的OCR结果，这表明EDSR是一种有效的超分辨率方法。",
    "en_tdlr": "This study compares multiple state-of-the-art SR-GAN models and finds that the EDSR model significantly increases the resolution of input images while preserving their visual quality. It generates images with higher PSNR and SSIM values and returns high-quality OCR results, indicating that EDSR is an effective super-resolution approach."
}