{
    "title": "Comparison between transformers and convolutional models for fine-grained classification of insects. (arXiv:2307.11112v1 [cs.CV])",
    "abstract": "Fine-grained classification is challenging due to the difficulty of finding discriminatory features. This problem is exacerbated when applied to identifying species within the same taxonomical class. This is because species are often sharing morphological characteristics that make them difficult to differentiate. We consider the taxonomical class of Insecta. The identification of insects is essential in biodiversity monitoring as they are one of the inhabitants at the base of many ecosystems. Citizen science is doing brilliant work of collecting images of insects in the wild giving the possibility to experts to create improved distribution maps in all countries. We have billions of images that need to be automatically classified and deep neural network algorithms are one of the main techniques explored for fine-grained tasks. At the SOTA, the field of deep learning algorithms is extremely fruitful, so how to identify the algorithm to use? We focus on Odonata and Coleoptera orders, and ",
    "link": "http://arxiv.org/abs/2307.11112",
    "context": "Title: Comparison between transformers and convolutional models for fine-grained classification of insects. (arXiv:2307.11112v1 [cs.CV])\nAbstract: Fine-grained classification is challenging due to the difficulty of finding discriminatory features. This problem is exacerbated when applied to identifying species within the same taxonomical class. This is because species are often sharing morphological characteristics that make them difficult to differentiate. We consider the taxonomical class of Insecta. The identification of insects is essential in biodiversity monitoring as they are one of the inhabitants at the base of many ecosystems. Citizen science is doing brilliant work of collecting images of insects in the wild giving the possibility to experts to create improved distribution maps in all countries. We have billions of images that need to be automatically classified and deep neural network algorithms are one of the main techniques explored for fine-grained tasks. At the SOTA, the field of deep learning algorithms is extremely fruitful, so how to identify the algorithm to use? We focus on Odonata and Coleoptera orders, and ",
    "path": "papers/23/07/2307.11112.json",
    "total_tokens": 883,
    "translated_title": "变压器和卷积模型在昆虫细粒度分类中的比较",
    "translated_abstract": "由于找到具有鉴别能力的特征的困难，细粒度分类是具有挑战性的。当应用于同一分类类别中的物种识别时，这个问题会变得更加复杂。这是因为物种通常共享使它们难以区分的形态特征。我们考虑了昆虫纲。昆虫的鉴定对生物多样性监测至关重要，因为它们是许多生态系统中的基础生物之一。公众科学正在收集野外昆虫图像的杰出工作，为专家在所有国家制作改进的分布图提供了可能性。我们有数十亿需要自动分类的图像，深度神经网络算法是细粒度任务的主要技术之一。在最先进的技术中，深度学习算法领域非常丰富，那么如何确定要使用的算法？我们专注于蜻蜓目和甲虫目。",
    "tldr": "本文对比了变压器和卷积模型在昆虫细粒度分类中的应用。这项研究对于解决物种鉴定中的困难非常有帮助，并为自动图像分类提供了新的洞见。",
    "en_tdlr": "This paper compares the application of transformers and convolutional models for fine-grained classification of insects. The research is helpful in addressing the challenges of species identification and provides new insights for automatic image classification."
}