{
    "title": "Quality Assessment of Photoplethysmography Signals For Cardiovascular Biomarkers Monitoring Using Wearable Devices. (arXiv:2307.08766v1 [cs.LG])",
    "abstract": "Photoplethysmography (PPG) is a non-invasive technology that measures changes in blood volume in the microvascular bed of tissue. It is commonly used in medical devices such as pulse oximeters and wrist worn heart rate monitors to monitor cardiovascular hemodynamics. PPG allows for the assessment of parameters (e.g., heart rate, pulse waveform, and peripheral perfusion) that can indicate conditions such as vasoconstriction or vasodilation, and provides information about microvascular blood flow, making it a valuable tool for monitoring cardiovascular health. However, PPG is subject to a number of sources of variations that can impact its accuracy and reliability, especially when using a wearable device for continuous monitoring, such as motion artifacts, skin pigmentation, and vasomotion. In this study, we extracted 27 statistical features from the PPG signal for training machine-learning models based on gradient boosting (XGBoost and CatBoost) and Random Forest (RF) algorithms to asse",
    "link": "http://arxiv.org/abs/2307.08766",
    "context": "Title: Quality Assessment of Photoplethysmography Signals For Cardiovascular Biomarkers Monitoring Using Wearable Devices. (arXiv:2307.08766v1 [cs.LG])\nAbstract: Photoplethysmography (PPG) is a non-invasive technology that measures changes in blood volume in the microvascular bed of tissue. It is commonly used in medical devices such as pulse oximeters and wrist worn heart rate monitors to monitor cardiovascular hemodynamics. PPG allows for the assessment of parameters (e.g., heart rate, pulse waveform, and peripheral perfusion) that can indicate conditions such as vasoconstriction or vasodilation, and provides information about microvascular blood flow, making it a valuable tool for monitoring cardiovascular health. However, PPG is subject to a number of sources of variations that can impact its accuracy and reliability, especially when using a wearable device for continuous monitoring, such as motion artifacts, skin pigmentation, and vasomotion. In this study, we extracted 27 statistical features from the PPG signal for training machine-learning models based on gradient boosting (XGBoost and CatBoost) and Random Forest (RF) algorithms to asse",
    "path": "papers/23/07/2307.08766.json",
    "total_tokens": 950,
    "translated_title": "使用可穿戴设备监测心血管生物标志物的光电容抗信号质量评估",
    "translated_abstract": "光电容抗（PPG）是一种非侵入性技术，用于测量微血管组织中的血容量变化。它常被用于医疗设备，如脉搏血氧仪和手腕式心率监测器，用于监测心血管血液动力学。PPG可以评估心率、脉搏波形和外周灌注等参数，以指示血管收缩或扩张等情况，并提供有关微血管血流的信息，是监测心血管健康的宝贵工具。然而，PPG受到多种变化源的影响，尤其在使用可穿戴设备进行连续监测时，如运动伪影、皮肤色素和血管运动。在这项研究中，我们从PPG信号中提取了27个统计特征，用基于梯度提升（XGBoost和CatBoost）和随机森林（RF）算法的机器学习模型进行训练，以评估其准确性和可靠性。",
    "tldr": "该研究基于机器学习模型对光电容抗（PPG）信号进行训练，评估了使用可穿戴设备进行连续监测时的准确性和可靠性，并提出了解决干扰因素的方法。"
}