{
    "title": "Stochastic automatic differentiation for Monte Carlo processes. (arXiv:2307.15406v1 [hep-lat])",
    "abstract": "Monte Carlo methods represent a cornerstone of computer science. They allow to sample high dimensional distribution functions in an efficient way. In this paper we consider the extension of Automatic Differentiation (AD) techniques to Monte Carlo process, addressing the problem of obtaining derivatives (and in general, the Taylor series) of expectation values. Borrowing ideas from the lattice field theory community, we examine two approaches. One is based on reweighting while the other represents an extension of the Hamiltonian approach typically used by the Hybrid Monte Carlo (HMC) and similar algorithms. We show that the Hamiltonian approach can be understood as a change of variables of the reweighting approach, resulting in much reduced variances of the coefficients of the Taylor series. This work opens the door to find other variance reduction techniques for derivatives of expectation values.",
    "link": "http://arxiv.org/abs/2307.15406",
    "context": "Title: Stochastic automatic differentiation for Monte Carlo processes. (arXiv:2307.15406v1 [hep-lat])\nAbstract: Monte Carlo methods represent a cornerstone of computer science. They allow to sample high dimensional distribution functions in an efficient way. In this paper we consider the extension of Automatic Differentiation (AD) techniques to Monte Carlo process, addressing the problem of obtaining derivatives (and in general, the Taylor series) of expectation values. Borrowing ideas from the lattice field theory community, we examine two approaches. One is based on reweighting while the other represents an extension of the Hamiltonian approach typically used by the Hybrid Monte Carlo (HMC) and similar algorithms. We show that the Hamiltonian approach can be understood as a change of variables of the reweighting approach, resulting in much reduced variances of the coefficients of the Taylor series. This work opens the door to find other variance reduction techniques for derivatives of expectation values.",
    "path": "papers/23/07/2307.15406.json",
    "total_tokens": 828,
    "translated_title": "蒙特卡洛过程的随机自动微分",
    "translated_abstract": "蒙特卡洛方法是计算机科学的一个基石，它们能够高效地采样高维分布函数。本文考虑将自动微分（AD）技术扩展到蒙特卡洛过程，解决获取期望值的导数（以及泰勒级数）的问题。借鉴晶格场论社区的思想，我们考察了两种方法。一种是基于重加权的方法，另一种是扩展了混合蒙特卡洛（HMC）和类似算法中通常使用的哈密顿方法。我们展示了哈密顿方法可以被理解为重加权方法的变量变换，从而大大减小了泰勒级数的系数的方差。这项工作为获取期望值导数的其他方差减小技术开辟了新的思路。",
    "tldr": "本文将自动微分技术扩展到蒙特卡洛过程中，通过使用哈密顿方法代替重加权方法，实现了对期望值的导数的方差减小，为发现其他期望值导数方差减小技术提供了新思路。",
    "en_tdlr": "This paper extends the automatic differentiation techniques to Monte Carlo processes, reducing the variance of the derivatives of expectation values by using the Hamiltonian approach instead of the reweighting approach, opening up new possibilities for variance reduction techniques in obtaining derivatives of expectation values."
}