{
    "title": "Alleviating the Long-Tail Problem in Conversational Recommender Systems. (arXiv:2307.11650v1 [cs.IR])",
    "abstract": "Conversational recommender systems (CRS) aim to provide the recommendation service via natural language conversations. To develop an effective CRS, high-quality CRS datasets are very crucial. However, existing CRS datasets suffer from the long-tail issue, \\ie a large proportion of items are rarely (or even never) mentioned in the conversations, which are called long-tail items. As a result, the CRSs trained on these datasets tend to recommend frequent items, and the diversity of the recommended items would be largely reduced, making users easier to get bored.  To address this issue, this paper presents \\textbf{LOT-CRS}, a novel framework that focuses on simulating and utilizing a balanced CRS dataset (\\ie covering all the items evenly) for improving \\textbf{LO}ng-\\textbf{T}ail recommendation performance of CRSs. In our approach, we design two pre-training tasks to enhance the understanding of simulated conversation for long-tail items, and adopt retrieval-augmented fine-tuning with lab",
    "link": "http://arxiv.org/abs/2307.11650",
    "context": "Title: Alleviating the Long-Tail Problem in Conversational Recommender Systems. (arXiv:2307.11650v1 [cs.IR])\nAbstract: Conversational recommender systems (CRS) aim to provide the recommendation service via natural language conversations. To develop an effective CRS, high-quality CRS datasets are very crucial. However, existing CRS datasets suffer from the long-tail issue, \\ie a large proportion of items are rarely (or even never) mentioned in the conversations, which are called long-tail items. As a result, the CRSs trained on these datasets tend to recommend frequent items, and the diversity of the recommended items would be largely reduced, making users easier to get bored.  To address this issue, this paper presents \\textbf{LOT-CRS}, a novel framework that focuses on simulating and utilizing a balanced CRS dataset (\\ie covering all the items evenly) for improving \\textbf{LO}ng-\\textbf{T}ail recommendation performance of CRSs. In our approach, we design two pre-training tasks to enhance the understanding of simulated conversation for long-tail items, and adopt retrieval-augmented fine-tuning with lab",
    "path": "papers/23/07/2307.11650.json",
    "total_tokens": 896,
    "translated_title": "缓解对话式推荐系统中的长尾问题",
    "translated_abstract": "对话式推荐系统（CRS）旨在通过自然语言对话提供推荐服务。为了开发有效的CRS，高质量的CRS数据集非常关键。然而，现有的CRS数据集存在长尾问题，即在对话中很少（甚至从未）提到的项目占较大比例，这些被称为长尾项目。因此，基于这些数据集训练的CRS倾向于推荐频繁出现的项目，并且推荐项目的多样性会大大降低，使用户更容易感到厌倦。为了解决这个问题，本文提出了一种新颖的框架LOT-CRS，该框架专注于模拟和利用平衡的CRS数据集（即均匀涵盖所有项目）来改善CRS的长尾推荐性能。在我们的方法中，我们设计了两个预训练任务，以增强对长尾项目的模拟对话的理解，并采用检索增强的微调与实验室",
    "tldr": "本文提出了一种名为LOT-CRS的新框架，核心是通过模拟和利用均衡的CRS数据集来改善长尾推荐性能，以解决现有CRS数据集中长尾问题。",
    "en_tdlr": "This paper presents a novel framework called LOT-CRS to improve long-tail recommendation performance in conversational recommender systems by simulating and utilizing a balanced CRS dataset, addressing the long-tail issue in existing CRS datasets."
}