{
    "title": "Over-the-Air Computation in OFDM Systems with Imperfect Channel State Information. (arXiv:2307.05357v1 [eess.SP])",
    "abstract": "This paper studies the over-the-air computation (AirComp) in an orthogonal frequency division multiplexing (OFDM) system with imperfect channel state information (CSI), in which multiple single-antenna wireless devices (WDs) simultaneously send uncoded signals to a multi-antenna access point (AP) for distributed functional computation over multiple subcarriers. In particular, we consider two scenarios with best-effort and error-constrained computation tasks, with the objectives of minimizing the average computation mean squared error (MSE) and the computation outage probability over the multiple subcarriers, respectively. Towards this end, we jointly optimize the transmit coefficients at the WDs and the receive beamforming vectors at the AP over subcarriers, subject to the maximum transmit power constraints at individual WDs. First, for the special case with a single receive antenna at the AP, we propose the semi-closed-form globally optimal solutions to the two problems using the Lagr",
    "link": "http://arxiv.org/abs/2307.05357",
    "context": "Title: Over-the-Air Computation in OFDM Systems with Imperfect Channel State Information. (arXiv:2307.05357v1 [eess.SP])\nAbstract: This paper studies the over-the-air computation (AirComp) in an orthogonal frequency division multiplexing (OFDM) system with imperfect channel state information (CSI), in which multiple single-antenna wireless devices (WDs) simultaneously send uncoded signals to a multi-antenna access point (AP) for distributed functional computation over multiple subcarriers. In particular, we consider two scenarios with best-effort and error-constrained computation tasks, with the objectives of minimizing the average computation mean squared error (MSE) and the computation outage probability over the multiple subcarriers, respectively. Towards this end, we jointly optimize the transmit coefficients at the WDs and the receive beamforming vectors at the AP over subcarriers, subject to the maximum transmit power constraints at individual WDs. First, for the special case with a single receive antenna at the AP, we propose the semi-closed-form globally optimal solutions to the two problems using the Lagr",
    "path": "papers/23/07/2307.05357.json",
    "total_tokens": 865,
    "translated_title": "在具有不完美信道状态信息的OFDM系统中的空中计算",
    "translated_abstract": "本文研究了在具有不完美信道状态信息的正交频分复用（OFDM）系统中的空中计算（AirComp）。在该系统中，多个单天线无线设备（WDs）同时向多天线接入点（AP）发送未编码信号，用于在多个子载波上进行分布式功能计算。我们考虑了两种情景，即最大努力计算任务和误差约束计算任务，目标分别是最小化多个子载波上的平均计算均方误差（MSE）和计算失效概率。为此，我们联合优化了WDs的发送系数和AP的接收波束形成向量，同时考虑了单个WD的最大发送功率限制。首先，针对AP仅具有一个接收天线的特殊情况，我们提出了使用Lagr的半闭式全局最优解来解决这两个问题。",
    "tldr": "本文研究了在具有不完美信道状态信息的OFDM系统中的空中计算（AirComp），提出了针对最大努力计算任务和误差约束计算任务的优化方法，以最小化计算均方误差和计算失效概率。",
    "en_tdlr": "This paper studies over-the-air computation (AirComp) in OFDM systems with imperfect channel state information. It proposes optimization methods for best-effort and error-constrained computation tasks to minimize computation mean squared error and computation outage probability."
}