{
    "title": "Enhancing Super-Resolution Networks through Realistic Thick-Slice CT Simulation. (arXiv:2307.10182v1 [eess.IV])",
    "abstract": "This study aims to develop and evaluate an innovative simulation algorithm for generating thick-slice CT images that closely resemble actual images in the AAPM-Mayo's 2016 Low Dose CT Grand Challenge dataset. The proposed method was evaluated using Peak Signal-to-Noise Ratio (PSNR) and Root Mean Square Error (RMSE) metrics, with the hypothesis that our simulation would produce images more congruent with their real counterparts. Our proposed method demonstrated substantial enhancements in terms of both PSNR and RMSE over other simulation methods. The highest PSNR values were obtained with the proposed method, yielding 49.7369 $\\pm$ 2.5223 and 48.5801 $\\pm$ 7.3271 for D45 and B30 reconstruction kernels, respectively. The proposed method also registered the lowest RMSE with values of 0.0068 $\\pm$ 0.0020 and 0.0108 $\\pm$ 0.0099 for D45 and B30, respectively, indicating a distribution more closely aligned with the authentic thick-slice image. Further validation of the proposed simulation al",
    "link": "http://arxiv.org/abs/2307.10182",
    "context": "Title: Enhancing Super-Resolution Networks through Realistic Thick-Slice CT Simulation. (arXiv:2307.10182v1 [eess.IV])\nAbstract: This study aims to develop and evaluate an innovative simulation algorithm for generating thick-slice CT images that closely resemble actual images in the AAPM-Mayo's 2016 Low Dose CT Grand Challenge dataset. The proposed method was evaluated using Peak Signal-to-Noise Ratio (PSNR) and Root Mean Square Error (RMSE) metrics, with the hypothesis that our simulation would produce images more congruent with their real counterparts. Our proposed method demonstrated substantial enhancements in terms of both PSNR and RMSE over other simulation methods. The highest PSNR values were obtained with the proposed method, yielding 49.7369 $\\pm$ 2.5223 and 48.5801 $\\pm$ 7.3271 for D45 and B30 reconstruction kernels, respectively. The proposed method also registered the lowest RMSE with values of 0.0068 $\\pm$ 0.0020 and 0.0108 $\\pm$ 0.0099 for D45 and B30, respectively, indicating a distribution more closely aligned with the authentic thick-slice image. Further validation of the proposed simulation al",
    "path": "papers/23/07/2307.10182.json",
    "total_tokens": 889,
    "translated_title": "通过真实厚切片CT模拟改进超分辨网络",
    "translated_abstract": "该研究旨在开发和评估一种创新的模拟算法，用于生成与AAPM-Mayo's 2016低剂量CT大挑战数据集中的实际图像密切相似的厚切片CT图像。提出的方法使用峰值信噪比（PSNR）和均方根误差（RMSE）指标进行评估，假设我们的模拟将产生与真实图像更一致的图像。我们提出的方法在PSNR和RMSE方面显示出显著的改进，最高PSNR值为D45和B30重建核分别为49.7369±2.5223和48.5801±7.3271。提出的方法还以0.0068±0.0020和0.0108±0.0099的RMSE值注册最低的误差，表明其分布更接近于真实的厚切片图像。",
    "tldr": "本研究通过开发一种创新的模拟算法，成功生成与实际图像非常相似的厚切片CT图像，并证明该方法在峰值信噪比和均方根误差方面明显优于其他模拟方法。",
    "en_tdlr": "This study develops an innovative simulation algorithm that generates thick-slice CT images closely resembling actual images and demonstrates its superiority over other simulation methods in terms of peak signal-to-noise ratio and root mean square error."
}