{
    "title": "Context-Aware Configuration and Management of WiFi Direct Groups for Real Opportunistic Networks. (arXiv:2307.03126v1 [cs.NI])",
    "abstract": "Wi-Fi Direct is a promising technology for the support of device-to-device communications (D2D) on commercial mobile devices. However, the standard as-it-is is not sufficient to support the real deployment of networking solutions entirely based on D2D such as opportunistic networks. In fact, WiFi Direct presents some characteristics that could limit the autonomous creation of D2D connections among users' personal devices. Specifically, the standard explicitly requires the user's authorization to establish a connection between two or more devices, and it provides a limited support for inter-group communication. In some cases, this might lead to the creation of isolated groups of nodes which cannot communicate among each other. In this paper, we propose a novel middleware-layer protocol for the efficient configuration and management of WiFi Direct groups (WiFi Direct Group Manager, WFD-GM) to enable autonomous connections and inter-group communication. This enables opportunistic networks",
    "link": "http://arxiv.org/abs/2307.03126",
    "context": "Title: Context-Aware Configuration and Management of WiFi Direct Groups for Real Opportunistic Networks. (arXiv:2307.03126v1 [cs.NI])\nAbstract: Wi-Fi Direct is a promising technology for the support of device-to-device communications (D2D) on commercial mobile devices. However, the standard as-it-is is not sufficient to support the real deployment of networking solutions entirely based on D2D such as opportunistic networks. In fact, WiFi Direct presents some characteristics that could limit the autonomous creation of D2D connections among users' personal devices. Specifically, the standard explicitly requires the user's authorization to establish a connection between two or more devices, and it provides a limited support for inter-group communication. In some cases, this might lead to the creation of isolated groups of nodes which cannot communicate among each other. In this paper, we propose a novel middleware-layer protocol for the efficient configuration and management of WiFi Direct groups (WiFi Direct Group Manager, WFD-GM) to enable autonomous connections and inter-group communication. This enables opportunistic networks",
    "path": "papers/23/07/2307.03126.json",
    "total_tokens": 785,
    "translated_title": "实时机会网络的上下文感知WiFi Direct组配置和管理",
    "translated_abstract": "WiFi Direct是一种在商用移动设备上支持设备对设备通信（D2D）的有前途的技术。然而，现有的标准不足以完全支持基于D2D的机会网络等网络解决方案的实际部署。实际上，WiFi Direct具有一些特征，可能限制用户个人设备之间自主创建D2D连接。具体而言，标准明确要求用户授权才能建立两个或多个设备之间的连接，并且对组间通信提供有限支持。在某些情况下，这可能导致孤立的节点组的创建，节点组之间无法相互通信。本文提出了一种新的中间件层协议，用于高效配置和管理WiFi Direct组（WiFi Direct Group Manager，WFD-GM），以实现自主连接和组间通信。这使得机会网络得以实现。",
    "tldr": "本文提出了一种WiFi Direct组管理协议（WFD-GM），用于实现在实时机会网络中自主连接和组间通信。"
}