{
    "title": "The Applicability of Federated Learning to Official Statistics. (arXiv:2307.15503v1 [cs.LG])",
    "abstract": "This work investigates the potential of Federated Learning (FL) for official statistics and shows how well the performance of FL models can keep up with centralized learning methods. At the same time, its utilization can safeguard the privacy of data holders, thus facilitating access to a broader range of data and ultimately enhancing official statistics. By simulating three different use cases, important insights on the applicability of the technology are gained. The use cases are based on a medical insurance data set, a fine dust pollution data set and a mobile radio coverage data set - all of which are from domains close to official statistics. We provide a detailed analysis of the results, including a comparison of centralized and FL algorithm performances for each simulation. In all three use cases, we were able to train models via FL which reach a performance very close to the centralized model benchmarks. Our key observations and their implications for transferring the simulatio",
    "link": "http://arxiv.org/abs/2307.15503",
    "context": "Title: The Applicability of Federated Learning to Official Statistics. (arXiv:2307.15503v1 [cs.LG])\nAbstract: This work investigates the potential of Federated Learning (FL) for official statistics and shows how well the performance of FL models can keep up with centralized learning methods. At the same time, its utilization can safeguard the privacy of data holders, thus facilitating access to a broader range of data and ultimately enhancing official statistics. By simulating three different use cases, important insights on the applicability of the technology are gained. The use cases are based on a medical insurance data set, a fine dust pollution data set and a mobile radio coverage data set - all of which are from domains close to official statistics. We provide a detailed analysis of the results, including a comparison of centralized and FL algorithm performances for each simulation. In all three use cases, we were able to train models via FL which reach a performance very close to the centralized model benchmarks. Our key observations and their implications for transferring the simulatio",
    "path": "papers/23/07/2307.15503.json",
    "total_tokens": 801,
    "translated_title": "Federated Learning在官方统计中的适用性",
    "translated_abstract": "本研究调查了Federated Learning（FL）在官方统计中的潜力，并展示了FL模型性能与集中式学习方法的匹配程度。同时，利用FL可以保护数据持有者的隐私，从而便于获取更广泛的数据并最终提升官方统计数据。通过模拟三种不同的使用案例，我们对这种技术的适用性获得了重要的见解。这些使用案例基于医疗保险数据集、细颗粒物污染数据集和移动无线信号覆盖数据集，这些数据集与官方统计密切相关。我们详细分析了结果，包括对每个模拟中集中式和FL算法性能的比较。在这三个使用案例中，我们能够通过FL训练模型，其性能与集中式模型基准非常接近。我们的关键观察和它们对模拟转移的影响。",
    "tldr": "Federated Learning（FL）在官方统计中具有潜力，可以保护数据隐私并提升数据质量。",
    "en_tdlr": "Federated Learning (FL) has the potential to enhance official statistics by safeguarding data privacy and improving data quality."
}