{
    "title": "Conformalization of Sparse Generalized Linear Models. (arXiv:2307.05109v1 [cs.LG])",
    "abstract": "Given a sequence of observable variables $\\{(x_1, y_1), \\ldots, (x_n, y_n)\\}$, the conformal prediction method estimates a confidence set for $y_{n+1}$ given $x_{n+1}$ that is valid for any finite sample size by merely assuming that the joint distribution of the data is permutation invariant. Although attractive, computing such a set is computationally infeasible in most regression problems. Indeed, in these cases, the unknown variable $y_{n+1}$ can take an infinite number of possible candidate values, and generating conformal sets requires retraining a predictive model for each candidate. In this paper, we focus on a sparse linear model with only a subset of variables for prediction and use numerical continuation techniques to approximate the solution path efficiently. The critical property we exploit is that the set of selected variables is invariant under a small perturbation of the input data. Therefore, it is sufficient to enumerate and refit the model only at the change points of",
    "link": "http://arxiv.org/abs/2307.05109",
    "context": "Title: Conformalization of Sparse Generalized Linear Models. (arXiv:2307.05109v1 [cs.LG])\nAbstract: Given a sequence of observable variables $\\{(x_1, y_1), \\ldots, (x_n, y_n)\\}$, the conformal prediction method estimates a confidence set for $y_{n+1}$ given $x_{n+1}$ that is valid for any finite sample size by merely assuming that the joint distribution of the data is permutation invariant. Although attractive, computing such a set is computationally infeasible in most regression problems. Indeed, in these cases, the unknown variable $y_{n+1}$ can take an infinite number of possible candidate values, and generating conformal sets requires retraining a predictive model for each candidate. In this paper, we focus on a sparse linear model with only a subset of variables for prediction and use numerical continuation techniques to approximate the solution path efficiently. The critical property we exploit is that the set of selected variables is invariant under a small perturbation of the input data. Therefore, it is sufficient to enumerate and refit the model only at the change points of",
    "path": "papers/23/07/2307.05109.json",
    "total_tokens": 929,
    "translated_title": "稀疏广义线性模型的合规化",
    "translated_abstract": "给定一系列可观测变量{(x1，y1)，…，(xn，yn)}，合规化预测方法通过仅假设数据的联合分布是置换不变的，为给定x_{n+1}估计y_{n+1}的置信区间，这个置信区间对于任何有限样本量都是有效的。尽管有吸引力，在大多数回归问题中计算这样的置信区间在计算上是不可行的。事实上，在这些情况下，未知变量y_{n+1}可以取无限多个可能的候选值，并且生成合规化集合需要为每个候选重新训练预测模型。在本文中，我们专注于仅使用子集变量进行预测的稀疏线性模型，并使用数值延拓技术高效逼近解决方案路径。我们利用的关键特性是所选变量集在输入数据的微小扰动下是不变的。因此，只需要在变化点枚举和重新拟合模型即可。",
    "tldr": "本文研究了稀疏广义线性模型的合规化问题。通过利用选择变量在输入数据微小扰动下的不变性，我们使用数值延拓技术高效逼近解决方案路径，从而减少计算合规化集合的复杂度。",
    "en_tdlr": "This paper investigates the conformalization problem of sparse generalized linear models. By exploiting the invariance of selected variables under small perturbations of the input data, the paper proposes the use of numerical continuation techniques to efficiently approximate the solution path, reducing the computational complexity of generating conformal sets."
}