{
    "title": "Self2Self+: Single-Image Denoising with Self-Supervised Learning and Image Quality Assessment Loss. (arXiv:2307.10695v1 [cs.CV])",
    "abstract": "Recently, denoising methods based on supervised learning have exhibited promising performance. However, their reliance on external datasets containing noisy-clean image pairs restricts their applicability. To address this limitation, researchers have focused on training denoising networks using solely a set of noisy inputs. To improve the feasibility of denoising procedures, in this study, we proposed a single-image self-supervised learning method in which only the noisy input image is used for network training. Gated convolution was used for feature extraction and no-reference image quality assessment was used for guiding the training process. Moreover, the proposed method sampled instances from the input image dataset using Bernoulli sampling with a certain dropout rate for training. The corresponding result was produced by averaging the generated predictions from various instances of the trained network with dropouts. The experimental results indicated that the proposed method achie",
    "link": "http://arxiv.org/abs/2307.10695",
    "context": "Title: Self2Self+: Single-Image Denoising with Self-Supervised Learning and Image Quality Assessment Loss. (arXiv:2307.10695v1 [cs.CV])\nAbstract: Recently, denoising methods based on supervised learning have exhibited promising performance. However, their reliance on external datasets containing noisy-clean image pairs restricts their applicability. To address this limitation, researchers have focused on training denoising networks using solely a set of noisy inputs. To improve the feasibility of denoising procedures, in this study, we proposed a single-image self-supervised learning method in which only the noisy input image is used for network training. Gated convolution was used for feature extraction and no-reference image quality assessment was used for guiding the training process. Moreover, the proposed method sampled instances from the input image dataset using Bernoulli sampling with a certain dropout rate for training. The corresponding result was produced by averaging the generated predictions from various instances of the trained network with dropouts. The experimental results indicated that the proposed method achie",
    "path": "papers/23/07/2307.10695.json",
    "total_tokens": 895,
    "translated_title": "自我自我+: 利用自监督学习和图像质量评估损失的单图像去噪方法",
    "translated_abstract": "最近，基于监督学习的去噪方法展现了令人期待的性能。然而，它们对包含噪声-干净图像对的外部数据集的依赖限制了它们的适用性。为了解决这个限制，研究人员开始关注使用仅包含噪声输入的一组输入来训练去噪网络。为了改善去噪过程的可行性，在本研究中，我们提出了一种单图像自监督学习方法，只使用噪声输入图像进行网络训练。使用门控卷积进行特征提取，使用无参考图像质量评估来指导训练过程。此外，我们提出的方法使用伯努利采样从输入图像数据集中选择实例进行训练，采用一定的dropout率。通过对训练过的网络的不同实例进行预测，并进行平均，生成相应的结果。实验结果表明，提出的方法取得了较好的性能。",
    "tldr": "该论文提出了一种新的单图像去噪方法，利用自监督学习和图像质量评估损失，只使用噪声输入进行网络训练，并通过平均不同实例的预测结果提高性能。",
    "en_tdlr": "This paper proposes a novel single-image denoising method that utilizes self-supervised learning and image quality assessment loss, using only the noisy input for network training, and improves performance by averaging predictions from different instances."
}