{
    "title": "Introduction to Facial Micro Expressions Analysis Using Color and Depth Images: A Matlab Coding Approach (Second Edition, 2023). (arXiv:2307.06396v1 [cs.CV])",
    "abstract": "The book attempts to introduce a gentle introduction to the field of Facial Micro Expressions Recognition (FMER) using Color and Depth images, with the aid of MATLAB programming environment. FMER is a subset of image processing and it is a multidisciplinary topic to analysis. So, it requires familiarity with other topics of Artifactual Intelligence (AI) such as machine learning, digital image processing, psychology and more. So, it is a great opportunity to write a book which covers all of these topics for beginner to professional readers in the field of AI and even without having background of AI. Our goal is to provide a standalone introduction in the field of MFER analysis in the form of theorical descriptions for readers with no background in image processing with reproducible Matlab practical examples. Also, we describe any basic definitions for FMER analysis and MATLAB library which is used in the text, that helps final reader to apply the experiments in the real-world applicatio",
    "link": "http://arxiv.org/abs/2307.06396",
    "context": "Title: Introduction to Facial Micro Expressions Analysis Using Color and Depth Images: A Matlab Coding Approach (Second Edition, 2023). (arXiv:2307.06396v1 [cs.CV])\nAbstract: The book attempts to introduce a gentle introduction to the field of Facial Micro Expressions Recognition (FMER) using Color and Depth images, with the aid of MATLAB programming environment. FMER is a subset of image processing and it is a multidisciplinary topic to analysis. So, it requires familiarity with other topics of Artifactual Intelligence (AI) such as machine learning, digital image processing, psychology and more. So, it is a great opportunity to write a book which covers all of these topics for beginner to professional readers in the field of AI and even without having background of AI. Our goal is to provide a standalone introduction in the field of MFER analysis in the form of theorical descriptions for readers with no background in image processing with reproducible Matlab practical examples. Also, we describe any basic definitions for FMER analysis and MATLAB library which is used in the text, that helps final reader to apply the experiments in the real-world applicatio",
    "path": "papers/23/07/2307.06396.json",
    "total_tokens": 900,
    "translated_title": "用颜色和深度图像进行面部微表情分析的介绍：Matlab编程方法（第二版，2023）",
    "translated_abstract": "该书试图通过MATLAB编程环境引入颜色和深度图像在面部微表情识别（FMER）领域的温和介绍。FMER是图像处理的一个子集，是一个跨学科的分析主题。因此，它需要熟悉人工智能（AI）的其他主题，如机器学习、数字图像处理、心理学等。所以，为AI领域的初学者到专业读者编写一本涵盖所有这些主题的书籍是一个很好的机会，甚至没有AI背景的读者也可以从中受益。我们的目标是提供一本独立的介绍性书籍，以理论描述的形式介绍MFER分析领域，供没有图像处理背景的读者参考，并附有可重现的Matlab实际示例。此外，我们还描述了FMER分析和在文本中使用的MATLAB库的任何基本定义，以帮助读者将实验应用于真实世界应用。",
    "tldr": "该书介绍了用颜色和深度图像进行面部微表情分析的方法，通过MATLAB编程实现。它适用于初学者到专业读者，并提供了理论描述和可重现的实例。"
}