{
    "title": "Time-limited Metaheuristics for Cardinality-constrained Portfolio Optimisation. (arXiv:2307.04045v1 [cs.CE])",
    "abstract": "A financial portfolio contains assets that offer a return with a certain level of risk. To maximise returns or minimise risk, the portfolio must be optimised - the ideal combination of optimal quantities of assets must be found. The number of possible combinations is vast. Furthermore, to make the problem realistic, constraints can be imposed on the number of assets held in the portfolio and the maximum proportion of the portfolio that can be allocated to an asset. This problem is unsolvable using quadratic programming, which means that the optimal solution cannot be calculated. A group of algorithms, called metaheuristics, can find near-optimal solutions in a practical computing time. These algorithms have been successfully used in constrained portfolio optimisation. However, in past studies the computation time of metaheuristics is not limited, which means that the results differ in both quality and computation time, and cannot be easily compared. This study proposes a different way ",
    "link": "http://arxiv.org/abs/2307.04045",
    "context": "Title: Time-limited Metaheuristics for Cardinality-constrained Portfolio Optimisation. (arXiv:2307.04045v1 [cs.CE])\nAbstract: A financial portfolio contains assets that offer a return with a certain level of risk. To maximise returns or minimise risk, the portfolio must be optimised - the ideal combination of optimal quantities of assets must be found. The number of possible combinations is vast. Furthermore, to make the problem realistic, constraints can be imposed on the number of assets held in the portfolio and the maximum proportion of the portfolio that can be allocated to an asset. This problem is unsolvable using quadratic programming, which means that the optimal solution cannot be calculated. A group of algorithms, called metaheuristics, can find near-optimal solutions in a practical computing time. These algorithms have been successfully used in constrained portfolio optimisation. However, in past studies the computation time of metaheuristics is not limited, which means that the results differ in both quality and computation time, and cannot be easily compared. This study proposes a different way ",
    "path": "papers/23/07/2307.04045.json",
    "total_tokens": 866,
    "translated_title": "有时间限制的元启发式算法用于受基数约束的投资组合优化",
    "translated_abstract": "金融投资组合包含以一定风险水平提供回报的资产。为了最大化回报或最小化风险，必须优化投资组合 - 找到最佳资产数量的理想组合。可能的组合数量非常多。此外，为了使问题变得现实，可以对投资组合中持有的资产数量和可以分配给某个资产的投资组合最大比例施加约束。这个问题无法通过二次规划求解，即无法计算出最优解。一组称为元启发式算法的算法可以在实际计算时间内找到接近最优的解决方案。这些算法已成功应用于受约束的投资组合优化。然而，在过去的研究中，元启发式算法的计算时间没有限制，这意味着结果在质量和计算时间上存在差异，难以进行比较。本研究提出了一种不同的方法，",
    "tldr": "该研究提出了一种有时间限制的元启发式算法用于受基数约束的投资组合优化问题，以解决现有研究中计算时间不受限制导致结果无法比较的问题。",
    "en_tdlr": "This study proposes time-limited metaheuristics for cardinality-constrained portfolio optimization, aiming to address the issue of uncomparable results due to unrestricted computation time in previous studies."
}