{
    "title": "CIDER: Context sensitive sentiment analysis for short-form text. (arXiv:2307.07864v1 [cs.CL])",
    "abstract": "Researchers commonly perform sentiment analysis on large collections of short texts like tweets, Reddit posts or newspaper headlines that are all focused on a specific topic, theme or event. Usually, general purpose sentiment analysis methods are used which perform well on average but miss the variation in meaning that happens across different contexts, for example, the word \"active\" has a very different intention and valence in the phrase \"active lifestyle\" versus \"active volcano\". This work presents a new approach, CIDER (Context Informed Dictionary and sEntiment Reasoner), which performs context sensitive sentiment analysis, where the valence of sentiment laden terms is inferred from the whole corpus before being used to score the individual texts. In this paper we detail the CIDER algorithm and demonstrate that it outperforms state-of-the-art generalist sentiment analysis on a large collection of tweets about the weather. We have made our implementation of CIDER available as a pyth",
    "link": "http://arxiv.org/abs/2307.07864",
    "context": "Title: CIDER: Context sensitive sentiment analysis for short-form text. (arXiv:2307.07864v1 [cs.CL])\nAbstract: Researchers commonly perform sentiment analysis on large collections of short texts like tweets, Reddit posts or newspaper headlines that are all focused on a specific topic, theme or event. Usually, general purpose sentiment analysis methods are used which perform well on average but miss the variation in meaning that happens across different contexts, for example, the word \"active\" has a very different intention and valence in the phrase \"active lifestyle\" versus \"active volcano\". This work presents a new approach, CIDER (Context Informed Dictionary and sEntiment Reasoner), which performs context sensitive sentiment analysis, where the valence of sentiment laden terms is inferred from the whole corpus before being used to score the individual texts. In this paper we detail the CIDER algorithm and demonstrate that it outperforms state-of-the-art generalist sentiment analysis on a large collection of tweets about the weather. We have made our implementation of CIDER available as a pyth",
    "path": "papers/23/07/2307.07864.json",
    "total_tokens": 802,
    "translated_title": "CIDER: 上下文感知的短文本情感分析",
    "translated_abstract": "研究人员通常对大量关于特定主题、主题或事件的短文本进行情感分析，如推文、Reddit帖子或报纸头条。通常使用通用情感分析方法，这些方法在平均意义上表现良好，但会忽略不同上下文中发生的意义变化，例如，“active”一词在“active lifestyle”和“active volcano”中具有非常不同的意图和倾向。本研究提出了一种新的方法，即CIDER（上下文感知词典和情感推理器），它进行上下文感知的情感分析，其中从整个语料库中推断出情感词的倾向，然后再用于评分个别文本。在本文中，我们详细介绍了CIDER算法，并证明它在大量关于天气的推文集合上优于最先进的通用情感分析方法。我们已将CIDER的实现以python代码的形式提供。",
    "tldr": "CIDER是一种上下文感知的短文本情感分析方法，通过从整个语料库中推断出情感词的倾向来评分个别文本，相比通用方法在天气推文集合上表现更优。"
}