{
    "title": "HVDetFusion: A Simple and Robust Camera-Radar Fusion Framework. (arXiv:2307.11323v1 [cs.CV])",
    "abstract": "In the field of autonomous driving, 3D object detection is a very important perception module. Although the current SOTA algorithm combines Camera and Lidar sensors, limited by the high price of Lidar, the current mainstream landing schemes are pure Camera sensors or Camera+Radar sensors. In this study, we propose a new detection algorithm called HVDetFusion, which is a multi-modal detection algorithm that not only supports pure camera data as input for detection, but also can perform fusion input of radar data and camera data. The camera stream does not depend on the input of Radar data, thus addressing the downside of previous methods. In the pure camera stream, we modify the framework of Bevdet4D for better perception and more efficient inference, and this stream has the whole 3D detection output. Further, to incorporate the benefits of Radar signals, we use the prior information of different object positions to filter the false positive information of the original radar data, accor",
    "link": "http://arxiv.org/abs/2307.11323",
    "context": "Title: HVDetFusion: A Simple and Robust Camera-Radar Fusion Framework. (arXiv:2307.11323v1 [cs.CV])\nAbstract: In the field of autonomous driving, 3D object detection is a very important perception module. Although the current SOTA algorithm combines Camera and Lidar sensors, limited by the high price of Lidar, the current mainstream landing schemes are pure Camera sensors or Camera+Radar sensors. In this study, we propose a new detection algorithm called HVDetFusion, which is a multi-modal detection algorithm that not only supports pure camera data as input for detection, but also can perform fusion input of radar data and camera data. The camera stream does not depend on the input of Radar data, thus addressing the downside of previous methods. In the pure camera stream, we modify the framework of Bevdet4D for better perception and more efficient inference, and this stream has the whole 3D detection output. Further, to incorporate the benefits of Radar signals, we use the prior information of different object positions to filter the false positive information of the original radar data, accor",
    "path": "papers/23/07/2307.11323.json",
    "total_tokens": 915,
    "translated_title": "HVDetFusion：一种简单而强大的相机-雷达融合框架",
    "translated_abstract": "在自动驾驶领域，3D目标检测是非常重要的感知模块。尽管当前的SOTA算法结合了相机和激光雷达传感器，但受到昂贵的激光雷达价格的限制，当前主流的方案是纯相机传感器或相机+雷达传感器。本研究提出了一种新的检测算法HVDetFusion，它是一种多模态检测算法，不仅支持纯相机数据作为检测输入，还可以将雷达数据和相机数据进行融合输入。相机数据流不依赖于雷达数据的输入，从而解决了之前方法的缺点。在纯相机数据流中，我们修改了Bevdet4D框架以提高感知效果和更高效的推断，并且该数据流有完整的3D检测输出。此外，为了融合雷达信号的优势，我们利用不同物体位置的先验信息来过滤原始雷达数据的误报信息。",
    "tldr": "HVDetFusion是一种简单而强大的相机-雷达融合框架，支持纯相机数据和相机+雷达数据的多模态检测，通过修改框架和利用先验信息实现更好的感知和过滤误报信息。"
}