{
    "title": "A Hybrid End-to-End Spatio-Temporal Attention Neural Network with Graph-Smooth Signals for EEG Emotion Recognition. (arXiv:2307.03068v1 [cs.LG])",
    "abstract": "Recently, physiological data such as electroencephalography (EEG) signals have attracted significant attention in affective computing. In this context, the main goal is to design an automated model that can assess emotional states. Lately, deep neural networks have shown promising performance in emotion recognition tasks. However, designing a deep architecture that can extract practical information from raw data is still a challenge. Here, we introduce a deep neural network that acquires interpretable physiological representations by a hybrid structure of spatio-temporal encoding and recurrent attention network blocks. Furthermore, a preprocessing step is applied to the raw data using graph signal processing tools to perform graph smoothing in the spatial domain. We demonstrate that our proposed architecture exceeds state-of-the-art results for emotion classification on the publicly available DEAP dataset. To explore the generality of the learned model, we also evaluate the performance",
    "link": "http://arxiv.org/abs/2307.03068",
    "context": "Title: A Hybrid End-to-End Spatio-Temporal Attention Neural Network with Graph-Smooth Signals for EEG Emotion Recognition. (arXiv:2307.03068v1 [cs.LG])\nAbstract: Recently, physiological data such as electroencephalography (EEG) signals have attracted significant attention in affective computing. In this context, the main goal is to design an automated model that can assess emotional states. Lately, deep neural networks have shown promising performance in emotion recognition tasks. However, designing a deep architecture that can extract practical information from raw data is still a challenge. Here, we introduce a deep neural network that acquires interpretable physiological representations by a hybrid structure of spatio-temporal encoding and recurrent attention network blocks. Furthermore, a preprocessing step is applied to the raw data using graph signal processing tools to perform graph smoothing in the spatial domain. We demonstrate that our proposed architecture exceeds state-of-the-art results for emotion classification on the publicly available DEAP dataset. To explore the generality of the learned model, we also evaluate the performance",
    "path": "papers/23/07/2307.03068.json",
    "total_tokens": 868,
    "translated_title": "一种融合时空注意力神经网络和图信号平滑的EEG情绪识别模型",
    "translated_abstract": "最近，生理数据如脑电图（EEG）信号在情感计算中引起了极大关注。在这个背景下，主要目标是设计一个可以评估情绪状态的自动化模型。近年来，深度神经网络在情绪识别任务中表现出了很好的性能。然而，设计一个可以从原始数据中提取实际信息的深度架构仍然是一个挑战。在这里，我们引入了一种深度神经网络，通过时空编码和循环注意力网络块的混合结构获得可解释的生理表示。此外，还使用图信号处理工具对原始数据进行预处理，以在空间域中进行图信号平滑处理。我们证明了我们提出的架构在公开可用的DEAP数据集上超过了现有技术的情绪分类结果。为了探索学习模型的普遍性，我们还评估了在其他数据集上的性能。",
    "tldr": "一种融合时空注意力神经网络和图信号平滑的EEG情绪识别模型，通过深度架构和图信号处理技术，实现了在情感计算中的出色表现。"
}