{
    "title": "Staging E-Commerce Products for Online Advertising using Retrieval Assisted Image Generation. (arXiv:2307.15326v1 [cs.CV])",
    "abstract": "Online ads showing e-commerce products typically rely on the product images in a catalog sent to the advertising platform by an e-commerce platform. In the broader ads industry such ads are called dynamic product ads (DPA). It is common for DPA catalogs to be in the scale of millions (corresponding to the scale of products which can be bought from the e-commerce platform). However, not all product images in the catalog may be appealing when directly re-purposed as an ad image, and this may lead to lower click-through rates (CTRs). In particular, products just placed against a solid background may not be as enticing and realistic as a product staged in a natural environment. To address such shortcomings of DPA images at scale, we propose a generative adversarial network (GAN) based approach to generate staged backgrounds for un-staged product images. Generating the entire staged background is a challenging task susceptible to hallucinations. To get around this, we introduce a simpler ap",
    "link": "http://arxiv.org/abs/2307.15326",
    "context": "Title: Staging E-Commerce Products for Online Advertising using Retrieval Assisted Image Generation. (arXiv:2307.15326v1 [cs.CV])\nAbstract: Online ads showing e-commerce products typically rely on the product images in a catalog sent to the advertising platform by an e-commerce platform. In the broader ads industry such ads are called dynamic product ads (DPA). It is common for DPA catalogs to be in the scale of millions (corresponding to the scale of products which can be bought from the e-commerce platform). However, not all product images in the catalog may be appealing when directly re-purposed as an ad image, and this may lead to lower click-through rates (CTRs). In particular, products just placed against a solid background may not be as enticing and realistic as a product staged in a natural environment. To address such shortcomings of DPA images at scale, we propose a generative adversarial network (GAN) based approach to generate staged backgrounds for un-staged product images. Generating the entire staged background is a challenging task susceptible to hallucinations. To get around this, we introduce a simpler ap",
    "path": "papers/23/07/2307.15326.json",
    "total_tokens": 869,
    "translated_title": "使用检索辅助图像生成为电子商务产品进行在线广告展示",
    "translated_abstract": "在线广告通常依赖电子商务平台通过目录将产品的图像发送给广告平台。在广告行业中，这样的广告通常被称为动态产品广告(DPA)。 DPA目录通常包含数百万个产品图像（与可以从电子商务平台购买的产品数量相对应）。然而，并非目录中的所有产品图像在直接重新定位为广告图像时都会吸引人，这可能会导致较低的点击率(CTR)。特别地，只放置在纯色背景上的产品可能不如在自然环境中布置的产品吸引人和逼真。为了解决DPA图像在大规模上的这些缺点，我们提出了一种基于生成对抗网络（GAN）的方法来为未布置产品图像生成舞台背景。生成整个布置的背景是一个具有挑战性的任务，容易产生幻觉。为了解决这个问题，我们引入了一个更简单的方法来生成隐含的框架。",
    "tldr": "提出了使用检索辅助图像生成的方法来为未布置的电子商务产品图像生成吸引人和逼真的舞台背景，以提高在线广告的点击率。"
}