{
    "title": "FITS: Modeling Time Series with $10k$ Parameters. (arXiv:2307.03756v1 [cs.LG])",
    "abstract": "In this paper, we introduce FITS, a lightweight yet powerful model for time series analysis. Unlike existing models that directly process raw time-domain data, FITS operates on the principle that time series can be manipulated through interpolation in the complex frequency domain. By discarding high-frequency components with negligible impact on time series data, FITS achieves performance comparable to state-of-the-art models for time series forecasting and anomaly detection tasks, while having a remarkably compact size of only approximately $10k$ parameters. Such a lightweight model can be easily trained and deployed in edge devices, creating opportunities for various applications. The anonymous code repo is available in: \\url{https://anonymous.4open.science/r/FITS}",
    "link": "http://arxiv.org/abs/2307.03756",
    "context": "Title: FITS: Modeling Time Series with $10k$ Parameters. (arXiv:2307.03756v1 [cs.LG])\nAbstract: In this paper, we introduce FITS, a lightweight yet powerful model for time series analysis. Unlike existing models that directly process raw time-domain data, FITS operates on the principle that time series can be manipulated through interpolation in the complex frequency domain. By discarding high-frequency components with negligible impact on time series data, FITS achieves performance comparable to state-of-the-art models for time series forecasting and anomaly detection tasks, while having a remarkably compact size of only approximately $10k$ parameters. Such a lightweight model can be easily trained and deployed in edge devices, creating opportunities for various applications. The anonymous code repo is available in: \\url{https://anonymous.4open.science/r/FITS}",
    "path": "papers/23/07/2307.03756.json",
    "total_tokens": 765,
    "translated_title": "FITS：模拟具有10k个参数的时间序列",
    "translated_abstract": "本文介绍了FITS，一种轻量而强大的时间序列分析模型。与直接处理原始时间域数据的现有模型不同，FITS基于在复杂频率域中进行插值的原理操作时间序列。通过丢弃对时间序列数据影响微小的高频分量，FITS在时间序列预测和异常检测任务中实现了与最先进模型相当的性能，同时具有近似10k个参数的显著紧凑大小。这种轻量级模型可以轻松地在边缘设备上进行训练和部署，为各种应用创造了机会。",
    "tldr": "FITS是一种轻量而强大的时间序列分析模型，通过在复杂频率域中进行插值操作，丢弃对时间序列数据影响微小的高频分量，实现了与最先进模型相当的性能，并且具有较小的模型参数数量，适用于边缘设备。",
    "en_tdlr": "FITS is a lightweight and powerful model for time series analysis. By manipulating time series through interpolation in the complex frequency domain and discarding high-frequency components with negligible impact, it achieves comparable performance to state-of-the-art models while having a small number of parameters, making it suitable for edge devices."
}