{
    "title": "Privately Policing Dark Patterns. (arXiv:2307.07888v1 [cs.CY])",
    "abstract": "Lawmakers around the country are crafting new laws to target \"dark patterns\" -- user interface designs that trick or coerce users into enabling cell phone location tracking, sharing browsing data, initiating automatic billing, or making whatever other choices their designers prefer. Dark patterns pose a serious problem. In their most aggressive forms, they interfere with human autonomy, undermine customers' evaluation and selection of products, and distort online markets for goods and services. Yet crafting legislation is a major challenge: Persuasion and deception are difficult to distinguish, and shifting tech trends present an ever-moving target. To address these challenges, this Article proposes leveraging state private law to define and track dark patterns as they evolve. Judge-crafted decisional law can respond quickly to new techniques, flexibly define the boundary between permissible and impermissible designs, and bolster state and federal regulatory enforcement efforts by quic",
    "link": "http://arxiv.org/abs/2307.07888",
    "context": "Title: Privately Policing Dark Patterns. (arXiv:2307.07888v1 [cs.CY])\nAbstract: Lawmakers around the country are crafting new laws to target \"dark patterns\" -- user interface designs that trick or coerce users into enabling cell phone location tracking, sharing browsing data, initiating automatic billing, or making whatever other choices their designers prefer. Dark patterns pose a serious problem. In their most aggressive forms, they interfere with human autonomy, undermine customers' evaluation and selection of products, and distort online markets for goods and services. Yet crafting legislation is a major challenge: Persuasion and deception are difficult to distinguish, and shifting tech trends present an ever-moving target. To address these challenges, this Article proposes leveraging state private law to define and track dark patterns as they evolve. Judge-crafted decisional law can respond quickly to new techniques, flexibly define the boundary between permissible and impermissible designs, and bolster state and federal regulatory enforcement efforts by quic",
    "path": "papers/23/07/2307.07888.json",
    "total_tokens": 841,
    "translated_title": "私下监管黑暗模式",
    "translated_abstract": "全国各地的立法者正在制定新的法律来针对“黑暗模式”——用户界面设计，用于欺骗或迫使用户启用手机位置跟踪，共享浏览数据，自动计费或进行其他设计师prefer的选择。黑暗模式带来了严重的问题。在最激进的形式中，它们干扰人类自主权，破坏了客户对产品的评估和选择，并扭曲了商品和服务的在线市场。然而，制定立法是一个重大挑战：诱导和欺骗很难区分，不断变化的技术趋势是一个不断移动的目标。为了解决这些挑战，本文提出利用州私人法来定义和跟踪黑暗模式的发展。法官制定的案例法可以迅速应对新的技术，灵活定义可容许和不可容许的设计边界，并通过迅速采取行动来加强州和联邦的监管执法工作。",
    "tldr": "这篇论文提出利用州私人法来定义和跟踪黑暗模式的发展，以解决黑暗模式带来的自主权干扰和市场扭曲等问题。"
}