{
    "title": "Hierarchical Neural Coding for Controllable CAD Model Generation. (arXiv:2307.00149v1 [cs.CV])",
    "abstract": "This paper presents a novel generative model for Computer Aided Design (CAD) that 1) represents high-level design concepts of a CAD model as a three-level hierarchical tree of neural codes, from global part arrangement down to local curve geometry; and 2) controls the generation or completion of CAD models by specifying the target design using a code tree. Concretely, a novel variant of a vector quantized VAE with \"masked skip connection\" extracts design variations as neural codebooks at three levels. Two-stage cascaded auto-regressive transformers learn to generate code trees from incomplete CAD models and then complete CAD models following the intended design. Extensive experiments demonstrate superior performance on conventional tasks such as random generation while enabling novel interaction capabilities on conditional generation tasks. The code is available at https://github.com/samxuxiang/hnc-cad.",
    "link": "http://arxiv.org/abs/2307.00149",
    "context": "Title: Hierarchical Neural Coding for Controllable CAD Model Generation. (arXiv:2307.00149v1 [cs.CV])\nAbstract: This paper presents a novel generative model for Computer Aided Design (CAD) that 1) represents high-level design concepts of a CAD model as a three-level hierarchical tree of neural codes, from global part arrangement down to local curve geometry; and 2) controls the generation or completion of CAD models by specifying the target design using a code tree. Concretely, a novel variant of a vector quantized VAE with \"masked skip connection\" extracts design variations as neural codebooks at three levels. Two-stage cascaded auto-regressive transformers learn to generate code trees from incomplete CAD models and then complete CAD models following the intended design. Extensive experiments demonstrate superior performance on conventional tasks such as random generation while enabling novel interaction capabilities on conditional generation tasks. The code is available at https://github.com/samxuxiang/hnc-cad.",
    "path": "papers/23/07/2307.00149.json",
    "total_tokens": 815,
    "translated_title": "可控的CAD模型生成的分层神经编码",
    "translated_abstract": "本文提出了一种新颖的计算机辅助设计（CAD）生成模型，它通过将CAD模型的高级设计概念表示为三层神经编码的层次树，从全局部件排列到局部曲线几何，同时通过使用代码树指定目标设计来控制CAD模型的生成或完成。具体地说，一种新颖的带有“掩码跳跃连接”的矢量量化VAE变体将设计变化提取为三个层次的神经代码簿。两阶段级联自回归变压器学习从不完整的CAD模型生成代码树，然后根据预期的设计完成CAD模型。大量实验证明了在传统任务（如随机生成）上的卓越性能，同时在条件生成任务上实现了新颖的交互能力。代码可在https://github.com/samxuxiang/hnc-cad找到。",
    "tldr": "本文提出了一种可控的CAD模型生成方法，通过分层神经编码和代码树来表示设计概念和控制生成过程，并在传统任务和条件生成任务上展示了优越性能。"
}