{
    "title": "Culture, Gender, and Labor Force Participation: Evidence from Colombia. (arXiv:2307.08869v1 [econ.GN])",
    "abstract": "This study investigates the impact of integrating gender equality into the Colombian constitution of 1991 on attitudes towards gender equality, experiences of gender-based discrimination, and labor market participation. Using a difference-in-discontinuities framework, we compare individuals exposed to mandatory high school courses on the Constitution with those who were not exposed. Our findings show a significant increase in labor market participation, primarily driven by women. Exposure to these courses also shapes attitudes towards gender equality, with men demonstrating greater support. Women report experiencing less gender-based discrimination. Importantly, our results suggest that women's increased labor market participation is unlikely due to reduced barriers from male partners. A disparity in opinions regarding traditional gender norms concerning household domains is observed between men and women, highlighting an ongoing power struggle within the home. However, the presence of",
    "link": "http://arxiv.org/abs/2307.08869",
    "context": "Title: Culture, Gender, and Labor Force Participation: Evidence from Colombia. (arXiv:2307.08869v1 [econ.GN])\nAbstract: This study investigates the impact of integrating gender equality into the Colombian constitution of 1991 on attitudes towards gender equality, experiences of gender-based discrimination, and labor market participation. Using a difference-in-discontinuities framework, we compare individuals exposed to mandatory high school courses on the Constitution with those who were not exposed. Our findings show a significant increase in labor market participation, primarily driven by women. Exposure to these courses also shapes attitudes towards gender equality, with men demonstrating greater support. Women report experiencing less gender-based discrimination. Importantly, our results suggest that women's increased labor market participation is unlikely due to reduced barriers from male partners. A disparity in opinions regarding traditional gender norms concerning household domains is observed between men and women, highlighting an ongoing power struggle within the home. However, the presence of",
    "path": "papers/23/07/2307.08869.json",
    "total_tokens": 930,
    "translated_title": "文化、性别和劳动力参与：来自哥伦比亚的证据",
    "translated_abstract": "该研究调查了将性别平等纳入1991年哥伦比亚宪法对性别平等态度、基于性别的歧视经历和劳动力市场参与的影响。使用差异研究方法，我们比较了接受义务高中课程《宪法》的个体与未接受的个体。我们的发现显示，劳动力市场参与显著增加，主要由女性推动。接受这些课程也影响了性别平等的态度，男性表现出更大的支持。女性报告称经历的基于性别的歧视较少。重要的是，我们的结果表明，女性增加的劳动力市场参与不太可能是由于男性伴侣减少了障碍。男性和女性对于家庭领域的传统性别规范的意见存在差异，突显了家庭内部的权力斗争。",
    "tldr": "该研究调查了将性别平等纳入哥伦比亚宪法对性别平等态度、性别歧视经历和劳动力市场参与的影响。研究发现，女性的劳动力市场参与显著增加，同时男性对性别平等持更大的支持，女性经历的性别歧视减少。这表明在家庭中存在持续的权力斗争。"
}