{
    "title": "Graph Representation of the Magnetic Field Topology in High-Fidelity Plasma Simulations for Machine Learning Applications. (arXiv:2307.09469v1 [physics.plasm-ph])",
    "abstract": "Topological analysis of the magnetic field in simulated plasmas allows the study of various physical phenomena in a wide range of settings. One such application is magnetic reconnection, a phenomenon related to the dynamics of the magnetic field topology, which is difficult to detect and characterize in three dimensions. We propose a scalable pipeline for topological data analysis and spatiotemporal graph representation of three-dimensional magnetic vector fields. We demonstrate our methods on simulations of the Earth's magnetosphere produced by Vlasiator, a supercomputer-scale Vlasov theory-based simulation for near-Earth space. The purpose of this work is to challenge the machine learning community to explore graph-based machine learning approaches to address a largely open scientific problem with wide-ranging potential impact.",
    "link": "http://arxiv.org/abs/2307.09469",
    "context": "Title: Graph Representation of the Magnetic Field Topology in High-Fidelity Plasma Simulations for Machine Learning Applications. (arXiv:2307.09469v1 [physics.plasm-ph])\nAbstract: Topological analysis of the magnetic field in simulated plasmas allows the study of various physical phenomena in a wide range of settings. One such application is magnetic reconnection, a phenomenon related to the dynamics of the magnetic field topology, which is difficult to detect and characterize in three dimensions. We propose a scalable pipeline for topological data analysis and spatiotemporal graph representation of three-dimensional magnetic vector fields. We demonstrate our methods on simulations of the Earth's magnetosphere produced by Vlasiator, a supercomputer-scale Vlasov theory-based simulation for near-Earth space. The purpose of this work is to challenge the machine learning community to explore graph-based machine learning approaches to address a largely open scientific problem with wide-ranging potential impact.",
    "path": "papers/23/07/2307.09469.json",
    "total_tokens": 854,
    "translated_title": "对机器学习应用中高保真度等离子体模拟中磁场拓扑的图表示",
    "translated_abstract": "通过对模拟等离子体中的磁场进行拓扑分析，可以在各种不同的场景下研究多种物理现象。其中一个应用是磁重新连接，这是与磁场拓扑动力学相关的一种现象，在三维空间中很难检测和描述。我们提出了一个可扩展的流程，用于对三维磁场矢量场进行拓扑数据分析和时空图表示。我们在地球磁层的模拟中演示了我们的方法，这是由Vlasiator产生的，Vlasiator是一个基于Vlasov理论的超级计算机规模的近地空间模拟。这项工作的目的是挑战机器学习社区采用基于图的机器学习方法来解决一个在科学上具有广泛潜力影响的问题。",
    "tldr": "该论文提出了一种对高保真度等离子体模拟中的磁场拓扑进行图表示的方法，并应用于地球磁层模拟中，旨在挑战机器学习社区通过图机器学习方法解决具有广泛潜力影响的科学问题。",
    "en_tdlr": "This paper proposes a method for graph representation of magnetic field topology in high-fidelity plasma simulations. It is applied to simulations of the Earth's magnetosphere and aims to challenge the machine learning community to address open scientific problems using graph-based machine learning approaches."
}