{
    "title": "Tapestry of Time and Actions: Modeling Human Activity Sequences using Temporal Point Process Flows. (arXiv:2307.10305v1 [cs.CV])",
    "abstract": "Human beings always engage in a vast range of activities and tasks that demonstrate their ability to adapt to different scenarios. Any human activity can be represented as a temporal sequence of actions performed to achieve a certain goal. Unlike the time series datasets extracted from electronics or machines, these action sequences are highly disparate in their nature -- the time to finish a sequence of actions can vary between different persons. Therefore, understanding the dynamics of these sequences is essential for many downstream tasks such as activity length prediction, goal prediction, next action recommendation, etc. Existing neural network-based approaches that learn a continuous-time activity sequence (or CTAS) are limited to the presence of only visual data or are designed specifically for a particular task, i.e., limited to next action or goal prediction. In this paper, we present ProActive, a neural marked temporal point process (MTPP) framework for modeling the continuou",
    "link": "http://arxiv.org/abs/2307.10305",
    "context": "Title: Tapestry of Time and Actions: Modeling Human Activity Sequences using Temporal Point Process Flows. (arXiv:2307.10305v1 [cs.CV])\nAbstract: Human beings always engage in a vast range of activities and tasks that demonstrate their ability to adapt to different scenarios. Any human activity can be represented as a temporal sequence of actions performed to achieve a certain goal. Unlike the time series datasets extracted from electronics or machines, these action sequences are highly disparate in their nature -- the time to finish a sequence of actions can vary between different persons. Therefore, understanding the dynamics of these sequences is essential for many downstream tasks such as activity length prediction, goal prediction, next action recommendation, etc. Existing neural network-based approaches that learn a continuous-time activity sequence (or CTAS) are limited to the presence of only visual data or are designed specifically for a particular task, i.e., limited to next action or goal prediction. In this paper, we present ProActive, a neural marked temporal point process (MTPP) framework for modeling the continuou",
    "path": "papers/23/07/2307.10305.json",
    "total_tokens": 900,
    "translated_title": "时光与行动之织：使用时间点过程流建模人类活动序列",
    "translated_abstract": "人类始终参与各种各样的活动和任务，展示了他们适应不同场景的能力。任何人类活动都可以被表示为实现特定目标而执行的行动的时间序列。与从电子设备或机器中提取的时间序列数据不同，这些行动序列在其性质上高度不同 - 完成行动序列的时间可能会因不同个体而异。因此，理解这些序列的动态对于许多下游任务（如活动持续时间预测，目标预测，下一步行动推荐等）至关重要。现有的基于神经网络的学习连续时间活动序列（Continuous-Time Activity Sequence，CTAS）的方法仅限于仅有视觉数据存在或仅适用于特定任务，即仅限于下一步行动或目标预测。在本文中，我们提出了ProActive，一种神经标记的时间点过程（Marked Temporal Point Process，MTPP）框架，用于建模连续的人类活动序列。",
    "tldr": "本文介绍了ProActive，一种神经标记的时间点过程（MTPP）框架，用于建模人类活动序列的动态。这种方法有助于活动持续时间预测、目标预测和下一步行动推荐等下游任务。"
}