{
    "title": "Economic Analysis of Smart Roadside Infrastructure Sensors for Connected and Automated Mobility. (arXiv:2307.12893v1 [econ.GN])",
    "abstract": "Smart roadside infrastructure sensors in the form of intelligent transportation system stations (ITS-Ss) are increasingly deployed worldwide at relevant traffic nodes. The resulting digital twins of the real environment are suitable for developing and validating connected and automated driving functions and for increasing the operational safety of intelligent vehicles by providing ITS-S real-time data. However, ITS-Ss are very costly to establish and operate. The choice of sensor technology also has an impact on the overall costs as well as on the data quality. So far, there is only insufficient knowledge about the concrete expenses that arise with the construction of different ITS-S setups. Within this work, multiple modular infrastructure sensor setups are investigated with the help of a life cycle cost analysis (LCCA). Their economic efficiency, different user requirements and sensor data qualities are considered. Based on the static cost model, a Monte Carlo simulation is performed",
    "link": "http://arxiv.org/abs/2307.12893",
    "context": "Title: Economic Analysis of Smart Roadside Infrastructure Sensors for Connected and Automated Mobility. (arXiv:2307.12893v1 [econ.GN])\nAbstract: Smart roadside infrastructure sensors in the form of intelligent transportation system stations (ITS-Ss) are increasingly deployed worldwide at relevant traffic nodes. The resulting digital twins of the real environment are suitable for developing and validating connected and automated driving functions and for increasing the operational safety of intelligent vehicles by providing ITS-S real-time data. However, ITS-Ss are very costly to establish and operate. The choice of sensor technology also has an impact on the overall costs as well as on the data quality. So far, there is only insufficient knowledge about the concrete expenses that arise with the construction of different ITS-S setups. Within this work, multiple modular infrastructure sensor setups are investigated with the help of a life cycle cost analysis (LCCA). Their economic efficiency, different user requirements and sensor data qualities are considered. Based on the static cost model, a Monte Carlo simulation is performed",
    "path": "papers/23/07/2307.12893.json",
    "total_tokens": 797,
    "translated_title": "智能道路边缘基础设施传感器对连通和自动驾驶的经济分析",
    "translated_abstract": "智能道路边缘基础设施传感器以智能交通系统站（ITS-Ss）的形式在全球范围内越来越多地部署在相关交通节点上。实时数据，但是ITS-Ss的建立和运营成本非常高昂。传感器技术的选择也对总体成本和数据质量产生影响。到目前为止，对于不同ITS-S 搭建的具体费用了解不足。本研究使用寿命周期成本分析（LCCA）研究了多个模块化基础设施传感器设置。结合静态成本模型，进行蒙特卡罗模拟以考虑其经济效益，不同用户需求和传感器数据质量。",
    "tldr": "这项研究通过生命周期成本分析，研究了智能道路边缘基础设施传感器对连通和自动驾驶的经济效益，不同用户需求和传感器数据质量。",
    "en_tdlr": "This research investigates the economic efficiency, different user requirements, and sensor data quality of smart roadside infrastructure sensors for connected and automated mobility using life cycle cost analysis."
}