{
    "title": "Gammatonegram Representation for End-to-End Dysarthric Speech Processing Tasks: Speech Recognition, Speaker Identification, and Intelligibility Assessment. (arXiv:2307.03296v1 [eess.AS])",
    "abstract": "Dysarthria is a disability that causes a disturbance in the human speech system and reduces the quality and intelligibility of a person's speech. Because of this effect, the normal speech processing systems can not work properly on impaired speech. This disability is usually associated with physical disabilities. Therefore, designing a system that can perform some tasks by receiving voice commands in the smart home can be a significant achievement. In this work, we introduce gammatonegram as an effective method to represent audio files with discriminative details, which is used as input for the convolutional neural network. On the other word, we convert each speech file into an image and propose image recognition system to classify speech in different scenarios. Proposed CNN is based on the transfer learning method on the pre-trained Alexnet. In this research, the efficiency of the proposed system for speech recognition, speaker identification, and intelligibility assessment is evaluat",
    "link": "http://arxiv.org/abs/2307.03296",
    "context": "Title: Gammatonegram Representation for End-to-End Dysarthric Speech Processing Tasks: Speech Recognition, Speaker Identification, and Intelligibility Assessment. (arXiv:2307.03296v1 [eess.AS])\nAbstract: Dysarthria is a disability that causes a disturbance in the human speech system and reduces the quality and intelligibility of a person's speech. Because of this effect, the normal speech processing systems can not work properly on impaired speech. This disability is usually associated with physical disabilities. Therefore, designing a system that can perform some tasks by receiving voice commands in the smart home can be a significant achievement. In this work, we introduce gammatonegram as an effective method to represent audio files with discriminative details, which is used as input for the convolutional neural network. On the other word, we convert each speech file into an image and propose image recognition system to classify speech in different scenarios. Proposed CNN is based on the transfer learning method on the pre-trained Alexnet. In this research, the efficiency of the proposed system for speech recognition, speaker identification, and intelligibility assessment is evaluat",
    "path": "papers/23/07/2307.03296.json",
    "total_tokens": 888,
    "translated_title": "用于端到端功能性言语处理任务的Gamma音图表示：语音识别、说话人识别和可理解性评估",
    "translated_abstract": "发音障碍是一种影响人类言语系统并降低个人发音质量和可理解性的残疾。由于这种影响，常规的言语处理系统无法在受损的言语上正常工作。这种残疾通常与身体残疾相关。因此，设计一个能够通过接收语音命令在智能家居中执行一些任务的系统，将是一个重要的成就。在这项工作中，我们引入了Gamma音图作为一种有效的方法来表示具有区分性细节的音频文件，该方法用作卷积神经网络的输入。换句话说，我们将每个语音文件转换成图像，并提出了图像识别系统来对不同场景下的语音进行分类。所提出的卷积神经网络基于预训练的Alexnet的迁移学习方法。在这项研究中，评估了所提出系统在语音识别、说话人识别和可理解性评估方面的效率。",
    "tldr": "该研究提出了一种使用Gamma音图表示语音的方法，通过卷积神经网络实现了语音识别、说话人识别和可理解性评估的功能。"
}