{
    "title": "Influential Simplices Mining via Simplicial Convolutional Network. (arXiv:2307.05841v1 [cs.SI])",
    "abstract": "Simplicial complexes have recently been in the limelight of higher-order network analysis, where a minority of simplices play crucial roles in structures and functions due to network heterogeneity. We find a significant inconsistency between identifying influential nodes and simplices. Therefore, it remains elusive how to characterize simplices' influence and identify influential simplices, despite the relative maturity of research on influential nodes (0-simplices) identification. Meanwhile, graph neural networks (GNNs) are potent tools that can exploit network topology and node features simultaneously, but they struggle to tackle higher-order tasks. In this paper, we propose a higher-order graph learning model, named influential simplices mining neural network (ISMnet), to identify vital h-simplices in simplicial complexes. It can tackle higher-order tasks by leveraging novel higher-order presentations: hierarchical bipartite graphs and higher-order hierarchical (HoH) Laplacians, whe",
    "link": "http://arxiv.org/abs/2307.05841",
    "context": "Title: Influential Simplices Mining via Simplicial Convolutional Network. (arXiv:2307.05841v1 [cs.SI])\nAbstract: Simplicial complexes have recently been in the limelight of higher-order network analysis, where a minority of simplices play crucial roles in structures and functions due to network heterogeneity. We find a significant inconsistency between identifying influential nodes and simplices. Therefore, it remains elusive how to characterize simplices' influence and identify influential simplices, despite the relative maturity of research on influential nodes (0-simplices) identification. Meanwhile, graph neural networks (GNNs) are potent tools that can exploit network topology and node features simultaneously, but they struggle to tackle higher-order tasks. In this paper, we propose a higher-order graph learning model, named influential simplices mining neural network (ISMnet), to identify vital h-simplices in simplicial complexes. It can tackle higher-order tasks by leveraging novel higher-order presentations: hierarchical bipartite graphs and higher-order hierarchical (HoH) Laplacians, whe",
    "path": "papers/23/07/2307.05841.json",
    "total_tokens": 910,
    "translated_title": "通过简单卷积网络挖掘具有影响力的简单形体",
    "translated_abstract": "简单复合体近年来在高阶网络分析中备受关注，其中少数简单形体由于网络异质性在结构和功能中起着关键作用。我们发现了识别有影响力节点和简单形体之间存在显著不一致。因此，尽管有关有影响力节点（0-简单形体）的研究相对成熟，但如何表征简单形体的影响力并识别有影响力的简单形体仍然难以解决。与此同时，图神经网络（GNNs）是一种强大的工具，可以同时利用网络拓扑和节点特征，但它们在处理高阶任务时面临困难。本文提出了一种名为有影响力简单形体挖掘神经网络（ISMnet）的高阶图学习模型，用于识别简单复合体中重要的h-简单形体。它可以通过利用新颖的高阶表达：分层二部图和高阶分层（HoH）拉普拉斯矩阵来处理高阶任务。",
    "tldr": "本文提出了一种名为ISMnet的高阶图学习模型，通过利用分层二部图和高阶分层拉普拉斯矩阵，来识别简单复合体中的重要简单形体。",
    "en_tdlr": "This paper proposes a higher-order graph learning model named ISMnet, which uses hierarchical bipartite graphs and higher-order hierarchical Laplacians to identify important simplices in simplicial complexes."
}