{
    "title": "Arbitrageurs' profits, LVR, and sandwich attacks: batch trading as an AMM design response. (arXiv:2307.02074v1 [cs.DC])",
    "abstract": "We consider an automated market maker (AMM) in which all trades are batched and executed at a price equal to the marginal price (i.e., the price of an arbitrary small trade) after the batch trades. We show that such an AMM is a function maximizing AMM (or FM-AMM): for given prices, it trades to reach the highest possible value of a given function. Also, competition between arbitrageurs guarantees that an FM-AMM always trades at a fair, equilibrium price, and arbitrage profits (also known as LVR) are eliminated. Sandwich attacks are also eliminated because all trades occur at the exogenously-determined equilibrium price. We use Binance price data to simulate a lower bound to the return of providing liquidity to an FM-AMM and show that, at least for the token pairs and the period we consider, such lower bound is very close to the empirical returns of providing liquidity on Uniswap v3.",
    "link": "http://arxiv.org/abs/2307.02074",
    "context": "Title: Arbitrageurs' profits, LVR, and sandwich attacks: batch trading as an AMM design response. (arXiv:2307.02074v1 [cs.DC])\nAbstract: We consider an automated market maker (AMM) in which all trades are batched and executed at a price equal to the marginal price (i.e., the price of an arbitrary small trade) after the batch trades. We show that such an AMM is a function maximizing AMM (or FM-AMM): for given prices, it trades to reach the highest possible value of a given function. Also, competition between arbitrageurs guarantees that an FM-AMM always trades at a fair, equilibrium price, and arbitrage profits (also known as LVR) are eliminated. Sandwich attacks are also eliminated because all trades occur at the exogenously-determined equilibrium price. We use Binance price data to simulate a lower bound to the return of providing liquidity to an FM-AMM and show that, at least for the token pairs and the period we consider, such lower bound is very close to the empirical returns of providing liquidity on Uniswap v3.",
    "path": "papers/23/07/2307.02074.json",
    "total_tokens": 998,
    "translated_title": "算法交易员的利润、LVR和夹心攻击：批量交易作为AMM设计的响应",
    "translated_abstract": "我们考虑了一种自动化市场制造商（AMM），其中所有交易都以批量方式执行，并在批量交易后以边际价格（即任意小额交易的价格）进行交易。我们表明，这种AMM是最大化AMM功能（或FM-AMM）的函数：对于给定的价格，它交易以达到给定函数的最高可能价值。此外，算法交易员之间的竞争保证了FM-AMM始终以公平、均衡的价格进行交易，并消除了套利利润（也称为LVR）。夹心攻击也被消除，因为所有交易发生在外生确定的均衡价格上。我们使用币安价格数据模拟提供流动性给FM-AMM的收益下限，并表明，至少对于我们考虑的代币对和时间段来说，这种下限非常接近在Uniswap v3上提供流动性的实证收益。",
    "tldr": "本研究介绍了一种自动化市场制造商（AMM）的设计响应——使用批量交易。通过批量交易以边际价格进行交易，使得AMM能够最大化其功能，并消除套利利润和夹心攻击的问题。研究使用币安价格数据进行模拟，结果显示，提供流动性给AMM的收益下限与在Uniswap v3上提供流动性的实际收益非常接近。"
}