{
    "title": "Test-takers have a say: understanding the implications of the use of AI in language tests. (arXiv:2307.09885v1 [cs.CY])",
    "abstract": "Language tests measure a person's ability to use a language in terms of listening, speaking, reading, or writing. Such tests play an integral role in academic, professional, and immigration domains, with entities such as educational institutions, professional accreditation bodies, and governments using them to assess candidate language proficiency. Recent advances in Artificial Intelligence (AI) and the discipline of Natural Language Processing have prompted language test providers to explore AI's potential applicability within language testing, leading to transformative activity patterns surrounding language instruction and learning. However, with concerns over AI's trustworthiness, it is imperative to understand the implications of integrating AI into language testing. This knowledge will enable stakeholders to make well-informed decisions, thus safeguarding community well-being and testing integrity. To understand the concerns and effects of AI usage in language tests, we conducted ",
    "link": "http://arxiv.org/abs/2307.09885",
    "context": "Title: Test-takers have a say: understanding the implications of the use of AI in language tests. (arXiv:2307.09885v1 [cs.CY])\nAbstract: Language tests measure a person's ability to use a language in terms of listening, speaking, reading, or writing. Such tests play an integral role in academic, professional, and immigration domains, with entities such as educational institutions, professional accreditation bodies, and governments using them to assess candidate language proficiency. Recent advances in Artificial Intelligence (AI) and the discipline of Natural Language Processing have prompted language test providers to explore AI's potential applicability within language testing, leading to transformative activity patterns surrounding language instruction and learning. However, with concerns over AI's trustworthiness, it is imperative to understand the implications of integrating AI into language testing. This knowledge will enable stakeholders to make well-informed decisions, thus safeguarding community well-being and testing integrity. To understand the concerns and effects of AI usage in language tests, we conducted ",
    "path": "papers/23/07/2307.09885.json",
    "total_tokens": 847,
    "translated_title": "考试者有话说：理解在语言测试中使用人工智能的影响",
    "translated_abstract": "语言测试衡量一个人在听、说、读、写方面使用某种语言的能力。这类测试在学术、职业和移民领域发挥着重要作用，教育机构、专业认证机构和政府等实体机构使用它们来评估候选人的语言熟练程度。人工智能和自然语言处理学科的最新进展促使语言测试提供者探索将人工智能应用于语言测试的潜在可能性，从而引发了围绕语言教学和学习的变革性活动模式。然而，在对人工智能信任性存在担忧的情况下，必须了解将人工智能整合到语言测试中的影响。这样的知识将使利益相关者能够做出明智的决策，从而保护社区的福祉和测试的完整性。为了了解在语言测试中使用人工智能的关切和影响，我们进行了...",
    "tldr": "深入了解在语言测试中使用人工智能的影响和担忧，有助于利益相关者做出明智决策，确保社区福祉和测试完整性。",
    "en_tdlr": "Understanding the effects and concerns of using artificial intelligence in language tests can help stakeholders make informed decisions to safeguard community well-being and testing integrity."
}