{
    "title": "The Radon Signed Cumulative Distribution Transform and its applications in classification of Signed Images. (arXiv:2307.15339v1 [cs.IT])",
    "abstract": "Here we describe a new image representation technique based on the mathematics of transport and optimal transport. The method relies on the combination of the well-known Radon transform for images and a recent signal representation method called the Signed Cumulative Distribution Transform. The newly proposed method generalizes previous transport-related image representation methods to arbitrary functions (images), and thus can be used in more applications. We describe the new transform, and some of its mathematical properties and demonstrate its ability to partition image classes with real and simulated data. In comparison to existing transport transform methods, as well as deep learning-based classification methods, the new transform more accurately represents the information content of signed images, and thus can be used to obtain higher classification accuracies. The implementation of the proposed method in Python language is integrated as a part of the software package PyTransKit,",
    "link": "http://arxiv.org/abs/2307.15339",
    "context": "Title: The Radon Signed Cumulative Distribution Transform and its applications in classification of Signed Images. (arXiv:2307.15339v1 [cs.IT])\nAbstract: Here we describe a new image representation technique based on the mathematics of transport and optimal transport. The method relies on the combination of the well-known Radon transform for images and a recent signal representation method called the Signed Cumulative Distribution Transform. The newly proposed method generalizes previous transport-related image representation methods to arbitrary functions (images), and thus can be used in more applications. We describe the new transform, and some of its mathematical properties and demonstrate its ability to partition image classes with real and simulated data. In comparison to existing transport transform methods, as well as deep learning-based classification methods, the new transform more accurately represents the information content of signed images, and thus can be used to obtain higher classification accuracies. The implementation of the proposed method in Python language is integrated as a part of the software package PyTransKit,",
    "path": "papers/23/07/2307.15339.json",
    "total_tokens": 812,
    "translated_title": "Radon符号累积分布变换及其在有符号图像分类中的应用",
    "translated_abstract": "在这里，我们介绍了一种基于运输和最优运输数学的新图像表示技术。该方法依赖于图像的著名Radon变换和最近的信号表示方法——符号累积分布变换的组合。新提出的方法将以前与运输相关的图像表示方法推广到任意函数（图像），因此可以在更多应用中使用。我们描述了这种新的变换，以及它的一些数学性质，并展示了它在实际和模拟数据上划分图像类别的能力。与现有的运输变换方法以及基于深度学习的分类方法相比，这种新的变换更准确地表示了有符号图像的信息内容，因此可以获得更高的分类准确性。所提出的方法在Python语言中的实现已作为PyTransKit软件包的一部分集成在内。",
    "tldr": "该论文介绍了一种基于Radon变换和符号累积分布变换的图像表示方法，可以更准确地表示有符号图像的信息内容，并在图像分类中获得更高的准确性。",
    "en_tdlr": "This paper presents a new image representation method based on the combination of Radon transform and Signed Cumulative Distribution Transform, which accurately represents the information content of signed images and achieves higher classification accuracy in image classification."
}