{
    "title": "Comparing Forward and Inverse Design Paradigms: A Case Study on Refractory High-Entropy Alloys. (arXiv:2307.13581v1 [cond-mat.mtrl-sci])",
    "abstract": "The rapid design of advanced materials is a topic of great scientific interest. The conventional, ``forward'' paradigm of materials design involves evaluating multiple candidates to determine the best candidate that matches the target properties. However, recent advances in the field of deep learning have given rise to the possibility of an ``inverse'' design paradigm for advanced materials, wherein a model provided with the target properties is able to find the best candidate. Being a relatively new concept, there remains a need to systematically evaluate how these two paradigms perform in practical applications. Therefore, the objective of this study is to directly, quantitatively compare the forward and inverse design modeling paradigms. We do so by considering two case studies of refractory high-entropy alloy design with different objectives and constraints and comparing the inverse design method to other forward schemes like localized forward search, high throughput screening, and",
    "link": "http://arxiv.org/abs/2307.13581",
    "context": "Title: Comparing Forward and Inverse Design Paradigms: A Case Study on Refractory High-Entropy Alloys. (arXiv:2307.13581v1 [cond-mat.mtrl-sci])\nAbstract: The rapid design of advanced materials is a topic of great scientific interest. The conventional, ``forward'' paradigm of materials design involves evaluating multiple candidates to determine the best candidate that matches the target properties. However, recent advances in the field of deep learning have given rise to the possibility of an ``inverse'' design paradigm for advanced materials, wherein a model provided with the target properties is able to find the best candidate. Being a relatively new concept, there remains a need to systematically evaluate how these two paradigms perform in practical applications. Therefore, the objective of this study is to directly, quantitatively compare the forward and inverse design modeling paradigms. We do so by considering two case studies of refractory high-entropy alloy design with different objectives and constraints and comparing the inverse design method to other forward schemes like localized forward search, high throughput screening, and",
    "path": "papers/23/07/2307.13581.json",
    "total_tokens": 861,
    "translated_title": "比较正向和逆向设计范式：耐火高熵合金案例研究",
    "translated_abstract": "快速设计先进材料是一个非常重要的科学问题。传统的“正向”材料设计范式涉及评估多个候选材料以确定与目标特性最匹配的候选材料。然而，深度学习在先进材料领域的最新进展使得“逆向”设计范式成为可能，即通过提供目标特性，模型能够找到最优的候选材料。由于这个概念相对较新，有必要系统地评估这两种范式在实际应用中的性能。因此，本研究的目标是直接、定量地比较正向和逆向设计建模范式。我们通过考虑两个耐火高熵合金设计的案例研究，并将逆向设计方法与其他正向方案（如局部正向搜索、高通量筛选等）进行比较来实现这一目标。",
    "tldr": "本研究比较了正向和逆向设计范式在耐火高熵合金设计中的表现，并通过两个案例研究定量比较了逆向设计方法与其他正向方案的差异。",
    "en_tdlr": "This study compares the performance of forward and inverse design paradigms in the design of refractory high-entropy alloys, and quantitatively compares the inverse design method to other forward schemes using two case studies."
}