{
    "title": "Restricted Generative Projection for One-Class Classification and Anomaly Detection. (arXiv:2307.04097v1 [cs.LG])",
    "abstract": "We present a simple framework for one-class classification and anomaly detection. The core idea is to learn a mapping to transform the unknown distribution of training (normal) data to a known target distribution. Crucially, the target distribution should be sufficiently simple, compact, and informative. The simplicity is to ensure that we can sample from the distribution easily, the compactness is to ensure that the decision boundary between normal data and abnormal data is clear and reliable, and the informativeness is to ensure that the transformed data preserve the important information of the original data. Therefore, we propose to use truncated Gaussian, uniform in hypersphere, uniform on hypersphere, or uniform between hyperspheres, as the target distribution. We then minimize the distance between the transformed data distribution and the target distribution while keeping the reconstruction error for the original data small enough. Comparative studies on multiple benchmark datas",
    "link": "http://arxiv.org/abs/2307.04097",
    "context": "Title: Restricted Generative Projection for One-Class Classification and Anomaly Detection. (arXiv:2307.04097v1 [cs.LG])\nAbstract: We present a simple framework for one-class classification and anomaly detection. The core idea is to learn a mapping to transform the unknown distribution of training (normal) data to a known target distribution. Crucially, the target distribution should be sufficiently simple, compact, and informative. The simplicity is to ensure that we can sample from the distribution easily, the compactness is to ensure that the decision boundary between normal data and abnormal data is clear and reliable, and the informativeness is to ensure that the transformed data preserve the important information of the original data. Therefore, we propose to use truncated Gaussian, uniform in hypersphere, uniform on hypersphere, or uniform between hyperspheres, as the target distribution. We then minimize the distance between the transformed data distribution and the target distribution while keeping the reconstruction error for the original data small enough. Comparative studies on multiple benchmark datas",
    "path": "papers/23/07/2307.04097.json",
    "total_tokens": 856,
    "translated_title": "限制生成投影在单类分类和异常检测中的应用",
    "translated_abstract": "我们提出了一个简单的框架用于单类分类和异常检测。核心思想是通过学习一种映射来将训练（正常）数据的未知分布转化为已知目标分布。目标分布应该足够简单、紧凑和信息丰富。简洁性是为了确保我们可以轻松地从分布中进行取样，紧凑性是为了确保正常数据和异常数据之间的决策边界清晰可靠，信息丰富性是为了确保转换后的数据保留原始数据的重要信息。因此，我们提出将截断高斯分布、超球面上的均匀分布、超球面之间的均匀分布作为目标分布。我们同时使得转换后的数据分布与目标分布之间的距离最小化，同时保持原始数据的重建误差足够小。在多个基准数据集上进行了比较研究。",
    "tldr": "该论文提出了一种简单的框架，用于单类分类和异常检测。作者通过学习一种映射，将训练数据的未知分布转化为已知目标分布，以实现对异常数据的可靠区分。",
    "en_tdlr": "This paper proposes a simple framework for one-class classification and anomaly detection. The authors learn a mapping to transform the unknown distribution of training data to a known target distribution, in order to achieve reliable discrimination of abnormal data."
}