{
    "title": "Systemic risk indicator based on implied and realized volatility. (arXiv:2307.05719v1 [q-fin.RM])",
    "abstract": "We propose a new measure of systemic risk to analyze the impact of the major financial market turmoils in the stock markets from 2000 to 2023 in the USA, Europe, Brazil, and Japan. Our Implied Volatility Realized Volatility Systemic Risk Indicator (IVRVSRI) shows that the reaction of stock markets varies across different geographical locations and the persistence of the shocks depends on the historical volatility and long-term average volatility level in a given market. The methodology applied is based on the logic that the simpler is always better than the more complex if it leads to the same results. Such an approach significantly limits model risk and substantially decreases computational burden. Robustness checks show that IVRVSRI is a precise and valid measure of the current systemic risk in the stock markets. Moreover, it can be used for other types of assets and high-frequency data. The forecasting ability of various SRIs (including CATFIN, CISS, IVRVSRI, SRISK, and Cleveland FE",
    "link": "http://arxiv.org/abs/2307.05719",
    "context": "Title: Systemic risk indicator based on implied and realized volatility. (arXiv:2307.05719v1 [q-fin.RM])\nAbstract: We propose a new measure of systemic risk to analyze the impact of the major financial market turmoils in the stock markets from 2000 to 2023 in the USA, Europe, Brazil, and Japan. Our Implied Volatility Realized Volatility Systemic Risk Indicator (IVRVSRI) shows that the reaction of stock markets varies across different geographical locations and the persistence of the shocks depends on the historical volatility and long-term average volatility level in a given market. The methodology applied is based on the logic that the simpler is always better than the more complex if it leads to the same results. Such an approach significantly limits model risk and substantially decreases computational burden. Robustness checks show that IVRVSRI is a precise and valid measure of the current systemic risk in the stock markets. Moreover, it can be used for other types of assets and high-frequency data. The forecasting ability of various SRIs (including CATFIN, CISS, IVRVSRI, SRISK, and Cleveland FE",
    "path": "papers/23/07/2307.05719.json",
    "total_tokens": 1081,
    "translated_title": "基于隐含波动率和实现波动率的系统风险指标",
    "translated_abstract": "我们提出了一种新的系统风险度量方法，用于分析2000年至2023年期间美国、欧洲、巴西和日本股票市场的主要金融市场动荡对其的影响。我们的隐含波动率实现波动率系统风险指标（IVRVSRI）显示，不同地理位置的股票市场对市场动荡的反应有所不同，并且冲击的持续性取决于给定市场的历史波动率和长期平均波动率水平。所应用的方法基于简单即优于复杂的逻辑，只要能得到相同的结果。这种方法显著限制了模型风险并大大减少了计算负担。鲁棒性检验表明，IVRVSRI是股票市场当前系统风险的准确有效的度量指标。此外，它还可以用于其他类型的资产和高频数据。各种系统风险指标（包括CATFIN、CISS、IVRVSRI、SRISK和Cleveland FE）的预测能力也得到了验证。",
    "tldr": "提出了一种基于隐含波动率和实现波动率的系统风险指标（IVRVSRI），通过分析2000年至2023年期间全球股票市场的主要金融市场动荡，发现不同地理位置的股票市场对市场动荡有不同的反应，并且冲击的持续性取决于历史波动率和长期平均波动率水平。这种简单而有效的方法可以准确度量股票市场的当前系统风险，并且可以适用于其他类型的资产和高频数据。",
    "en_tdlr": "A systemic risk indicator, called IVRVSRI, is proposed based on implied and realized volatility to analyze the impact of major financial market turmoils in global stock markets from 2000 to 2023. The indicator reveals that the reaction of stock markets varies geographically and the persistence of shocks depends on historical and average volatility levels. This simple and effective approach accurately measures current systemic risk in stock markets and can be applied to other asset classes and high-frequency data."
}