{
    "title": "Tackling the Problem of State Dependent Execution Probability: Empirical Evidence and Order Placement. (arXiv:2307.04863v1 [q-fin.TR])",
    "abstract": "Order placement tactics play a crucial role in high-frequency trading algorithms and their design is based on understanding the dynamics of the order book. Using high quality high-frequency data and survival analysis, we exhibit strong state dependence properties of the fill probability function. We define a set of microstructure features and train a multi-layer perceptron to infer the fill probability function. A weighting method is applied to the loss function such that the model learns from censored data. By comparing numerical results obtained on both digital asset centralized exchanges (CEXs) and stock markets, we are able to analyze dissimilarities between the fill probability of small tick crypto pairs and large tick assets -- large, relative to cryptos. The practical use of this model is illustrated with a fixed time horizon execution problem in which both the decision to post a limit order or to immediately execute and the optimal distance of placement are characterized. We di",
    "link": "http://arxiv.org/abs/2307.04863",
    "context": "Title: Tackling the Problem of State Dependent Execution Probability: Empirical Evidence and Order Placement. (arXiv:2307.04863v1 [q-fin.TR])\nAbstract: Order placement tactics play a crucial role in high-frequency trading algorithms and their design is based on understanding the dynamics of the order book. Using high quality high-frequency data and survival analysis, we exhibit strong state dependence properties of the fill probability function. We define a set of microstructure features and train a multi-layer perceptron to infer the fill probability function. A weighting method is applied to the loss function such that the model learns from censored data. By comparing numerical results obtained on both digital asset centralized exchanges (CEXs) and stock markets, we are able to analyze dissimilarities between the fill probability of small tick crypto pairs and large tick assets -- large, relative to cryptos. The practical use of this model is illustrated with a fixed time horizon execution problem in which both the decision to post a limit order or to immediately execute and the optimal distance of placement are characterized. We di",
    "path": "papers/23/07/2307.04863.json",
    "total_tokens": 950,
    "translated_title": "解决状态依赖执行概率问题：经验证据和订单放置策略",
    "translated_abstract": "订单放置策略在高频交易算法中起着至关重要的作用，其设计基于对订单簿动态的理解。利用高质量的高频数据和生存分析，我们展示了充分概率函数具有强烈的状态依赖性质。我们定义了一组微观结构特征，并训练了一个多层感知机来推断填充概率函数。我们应用了一种加权方法到损失函数中，使得模型能够从被审查数据中学习。通过比较在数字资产中心化交易所（CEXs）和股票市场上获得的数值结果，我们能够分析小tick加密货币对和大tick资产（与加密货币相对较大）的填充概率之间的差异。我们用一个固定时间周期的执行问题来说明这个模型的实际用途，其中包括是否发布限价订单或立即执行的决策，以及最优放置距离的特征。",
    "tldr": "本研究使用高频数据和生存分析展示了填充概率函数具有强烈的状态依赖性质。通过对比数字资产交易所和股票市场的结果，我们分析了小tick加密货币对和大tick资产之间的填充概率差异。研究还得出了在固定时间周期内执行问题中的最优策略。"
}