{
    "title": "Robust Visual Sim-to-Real Transfer for Robotic Manipulation. (arXiv:2307.15320v1 [cs.RO])",
    "abstract": "Learning visuomotor policies in simulation is much safer and cheaper than in the real world. However, due to discrepancies between the simulated and real data, simulator-trained policies often fail when transferred to real robots. One common approach to bridge the visual sim-to-real domain gap is domain randomization (DR). While previous work mainly evaluates DR for disembodied tasks, such as pose estimation and object detection, here we systematically explore visual domain randomization methods and benchmark them on a rich set of challenging robotic manipulation tasks. In particular, we propose an off-line proxy task of cube localization to select DR parameters for texture randomization, lighting randomization, variations of object colors and camera parameters. Notably, we demonstrate that DR parameters have similar impact on our off-line proxy task and on-line policies. We, hence, use off-line optimized DR parameters to train visuomotor policies in simulation and directly apply such ",
    "link": "http://arxiv.org/abs/2307.15320",
    "context": "Title: Robust Visual Sim-to-Real Transfer for Robotic Manipulation. (arXiv:2307.15320v1 [cs.RO])\nAbstract: Learning visuomotor policies in simulation is much safer and cheaper than in the real world. However, due to discrepancies between the simulated and real data, simulator-trained policies often fail when transferred to real robots. One common approach to bridge the visual sim-to-real domain gap is domain randomization (DR). While previous work mainly evaluates DR for disembodied tasks, such as pose estimation and object detection, here we systematically explore visual domain randomization methods and benchmark them on a rich set of challenging robotic manipulation tasks. In particular, we propose an off-line proxy task of cube localization to select DR parameters for texture randomization, lighting randomization, variations of object colors and camera parameters. Notably, we demonstrate that DR parameters have similar impact on our off-line proxy task and on-line policies. We, hence, use off-line optimized DR parameters to train visuomotor policies in simulation and directly apply such ",
    "path": "papers/23/07/2307.15320.json",
    "total_tokens": 981,
    "translated_title": "强大的视觉模拟与实际机器人操作的跨界迁移",
    "translated_abstract": "在模拟环境中学习视觉动作策略比在真实世界中更安全且更便宜。然而，由于模拟和真实数据之间的差异，经过模拟训练的策略在转移到真实机器人时经常失败。为了弥合视觉模拟与实际领域的差距，常用的方法是域随机化(domain randomization, DR)。然而，过去的研究主要评估了DR在姿态估计和物体检测等脱离力的任务上的表现，在这里，我们系统地探索了视觉域随机化方法，并在一系列具有挑战性的机器人操作任务上对其进行了基准测试。我们提出了一个离线代理任务，用于选择纹理随机化、光照随机化、物体颜色变化和相机参数等DR参数。特别值得注意的是，我们证明了DR参数对于离线代理任务和在线策略具有类似的影响。因此，我们使用经过离线优化的DR参数在模拟环境中训练视觉动作策略，并直接应用这些策略到实际机器人上。",
    "tldr": "该论文研究了视觉模拟与实际机器人操作的跨界迁移问题，并提出了域随机化方法来弥合这一差距。通过离线代理任务和模拟训练，成功地优化了域随机化参数，从而实现了在真实机器人上的有效应用。",
    "en_tdlr": "This paper investigates the challenge of transferring visual sim-to-real policies in robotic manipulation tasks and proposes domain randomization as a solution. The authors optimize domain randomization parameters using an offline proxy task, enabling successful application of the trained policies on real robots."
}