{
    "title": "On Imperfect Recall in Multi-Agent Influence Diagrams. (arXiv:2307.05059v1 [cs.GT])",
    "abstract": "Multi-agent influence diagrams (MAIDs) are a popular game-theoretic model based on Bayesian networks. In some settings, MAIDs offer significant advantages over extensive-form game representations. Previous work on MAIDs has assumed that agents employ behavioural policies, which set independent conditional probability distributions over actions for each of their decisions. In settings with imperfect recall, however, a Nash equilibrium in behavioural policies may not exist. We overcome this by showing how to solve MAIDs with forgetful and absent-minded agents using mixed policies and two types of correlated equilibrium. We also analyse the computational complexity of key decision problems in MAIDs, and explore tractable cases. Finally, we describe applications of MAIDs to Markov games and team situations, where imperfect recall is often unavoidable.",
    "link": "http://arxiv.org/abs/2307.05059",
    "context": "Title: On Imperfect Recall in Multi-Agent Influence Diagrams. (arXiv:2307.05059v1 [cs.GT])\nAbstract: Multi-agent influence diagrams (MAIDs) are a popular game-theoretic model based on Bayesian networks. In some settings, MAIDs offer significant advantages over extensive-form game representations. Previous work on MAIDs has assumed that agents employ behavioural policies, which set independent conditional probability distributions over actions for each of their decisions. In settings with imperfect recall, however, a Nash equilibrium in behavioural policies may not exist. We overcome this by showing how to solve MAIDs with forgetful and absent-minded agents using mixed policies and two types of correlated equilibrium. We also analyse the computational complexity of key decision problems in MAIDs, and explore tractable cases. Finally, we describe applications of MAIDs to Markov games and team situations, where imperfect recall is often unavoidable.",
    "path": "papers/23/07/2307.05059.json",
    "total_tokens": 890,
    "translated_title": "关于多智能体影响图中的记忆缺失问题",
    "translated_abstract": "多智能体影响图（MAIDs）是一种基于贝叶斯网络的流行博弈论模型。在某些情况下，MAIDs相比扩展博弈表示法具有显著优势。以往的研究假设智能体采用行为策略，为每个决策设置独立的条件概率分布来选择动作。然而，在存在记忆缺失的情况下，行为策略的纳什均衡可能不存在。我们通过展示如何利用混合策略和两种类型的相关均衡来解决带有健忘和疏忽智能体的MAIDs。我们还分析了MAIDs中关键决策问题的计算复杂性，并探索了可计算的情况。最后，我们描述了将MAIDs应用于马尔可夫博弈和团队情境的情况，这些情境中的记忆缺失通常是不可避免的。",
    "tldr": "本论文研究了多智能体影响图中的记忆缺失问题，提出了利用混合策略和两种类型的相关均衡来解决带有健忘和疏忽智能体的方法，并分析了关键决策问题的计算复杂性和可计算的情况。",
    "en_tdlr": "This paper investigates the issue of imperfect recall in multi-agent influence diagrams (MAIDs) and proposes a method using mixed policies and two types of correlated equilibrium to address the problem of forgetful and absent-minded agents. It also analyzes the computational complexity of key decision problems and explores tractable cases in MAIDs."
}