{
    "title": "Towards Deep Network Steganography: From Networks to Networks. (arXiv:2307.03444v1 [cs.CR])",
    "abstract": "With the widespread applications of the deep neural network (DNN), how to covertly transmit the DNN models in public channels brings us the attention, especially for those trained for secret-learning tasks. In this paper, we propose deep network steganography for the covert communication of DNN models. Unlike the existing steganography schemes which focus on the subtle modification of the cover data to accommodate the secrets, our scheme is learning task oriented, where the learning task of the secret DNN model (termed as secret-learning task) is disguised into another ordinary learning task conducted in a stego DNN model (termed as stego-learning task). To this end, we propose a gradient-based filter insertion scheme to insert interference filters into the important positions in the secret DNN model to form a stego DNN model. These positions are then embedded into the stego DNN model using a key by side information hiding. Finally, we activate the interference filters by a partial opt",
    "link": "http://arxiv.org/abs/2307.03444",
    "context": "Title: Towards Deep Network Steganography: From Networks to Networks. (arXiv:2307.03444v1 [cs.CR])\nAbstract: With the widespread applications of the deep neural network (DNN), how to covertly transmit the DNN models in public channels brings us the attention, especially for those trained for secret-learning tasks. In this paper, we propose deep network steganography for the covert communication of DNN models. Unlike the existing steganography schemes which focus on the subtle modification of the cover data to accommodate the secrets, our scheme is learning task oriented, where the learning task of the secret DNN model (termed as secret-learning task) is disguised into another ordinary learning task conducted in a stego DNN model (termed as stego-learning task). To this end, we propose a gradient-based filter insertion scheme to insert interference filters into the important positions in the secret DNN model to form a stego DNN model. These positions are then embedded into the stego DNN model using a key by side information hiding. Finally, we activate the interference filters by a partial opt",
    "path": "papers/23/07/2307.03444.json",
    "total_tokens": 855,
    "translated_title": "从网络到网络的深度网络隐写术",
    "translated_abstract": "随着深度神经网络(DNN)的广泛应用，如何在公共信道中秘密传输DNN模型引起了我们的关注，特别是针对那些用于秘密学习任务的模型。本文提出了一种用于DNN模型秘密传输的深度网络隐写术。与现有的隐写方案不同，其重点是通过对封面数据进行细微修改以适应秘密，我们的方案是以学习任务为导向的，将秘密DNN模型(称为秘密学习任务)伪装成另一个在隐写DNN模型(称为隐写学习任务)中进行的普通学习任务。为此，我们提出了一种基于梯度的滤波器插入方案，将干扰滤波器插入到秘密DNN模型的重要位置，形成一个隐写DNN模型。然后，我们使用密钥和附加信息隐藏将这些位置嵌入到隐写DNN模型中。最后，通过部分优化激活干扰滤波器。",
    "tldr": "本论文提出了一种新的深度网络隐写术，通过将秘密DNN模型伪装成另一个普通学习任务的隐写DNN模型，实现了DNN模型的秘密传输。"
}