{
    "title": "Using Random Effects Machine Learning Algorithms to Identify Vulnerability to Depression. (arXiv:2307.02023v1 [stat.ML])",
    "abstract": "Background: Reliable prediction of clinical progression over time can improve the outcomes of depression. Little work has been done integrating various risk factors for depression, to determine the combinations of factors with the greatest utility for identifying which individuals are at the greatest risk. Method: This study demonstrates that data-driven machine learning (ML) methods such as RE-EM (Random Effects/Expectation Maximization) trees and MERF (Mixed Effects Random Forest) can be applied to reliably identify variables that have the greatest utility for classifying subgroups at greatest risk for depression. 185 young adults completed measures of depression risk, including rumination, worry, negative cognitive styles, cognitive and coping flexibilities, and negative life events, along with symptoms of depression. We trained RE-EM trees and MERF algorithms and compared them to traditional linear mixed models (LMMs) predicting depressive symptoms prospectively and concurrently wi",
    "link": "http://arxiv.org/abs/2307.02023",
    "context": "Title: Using Random Effects Machine Learning Algorithms to Identify Vulnerability to Depression. (arXiv:2307.02023v1 [stat.ML])\nAbstract: Background: Reliable prediction of clinical progression over time can improve the outcomes of depression. Little work has been done integrating various risk factors for depression, to determine the combinations of factors with the greatest utility for identifying which individuals are at the greatest risk. Method: This study demonstrates that data-driven machine learning (ML) methods such as RE-EM (Random Effects/Expectation Maximization) trees and MERF (Mixed Effects Random Forest) can be applied to reliably identify variables that have the greatest utility for classifying subgroups at greatest risk for depression. 185 young adults completed measures of depression risk, including rumination, worry, negative cognitive styles, cognitive and coping flexibilities, and negative life events, along with symptoms of depression. We trained RE-EM trees and MERF algorithms and compared them to traditional linear mixed models (LMMs) predicting depressive symptoms prospectively and concurrently wi",
    "path": "papers/23/07/2307.02023.json",
    "total_tokens": 934,
    "translated_title": "使用随机效应机器学习算法识别抑郁的易感性",
    "translated_abstract": "背景：可靠地预测抑郁症的临床进展可以改善治疗效果。目前很少有研究将不同的抑郁症风险因素整合起来，以确定哪些因素的组合对于确定哪些个体最具风险具有最大效用。方法：本研究证明了数据驱动的机器学习（ML）方法，如RE-EM（随机效应/最大期望）树和MERF（混合效应随机森林）可以应用于可靠地识别在抑郁风险最大的亚组中具有最大效用的变量。185名年轻成人参与了关于抑郁风险的测量，包括反刍、担忧、消极认知风格、认知和应对灵活性以及消极生活事件，以及抑郁症状。我们训练了RE-EM树和MERF算法，并将它们与传统的线性混合模型（LMMs）进行了比较，用于预测抑郁症状的前瞻性和同时性。",
    "tldr": "本研究使用随机效应机器学习算法成功识别出在抑郁风险最大的亚组中具有最大效用的变量，并提出了相关的预测模型，可以改善抑郁症的临床预测和治疗效果。",
    "en_tdlr": "This study successfully identified variables with the greatest utility for classifying subgroups at greatest risk for depression using random effects machine learning algorithms, and proposed predictive models to improve clinical prediction and treatment of depression."
}