{
    "title": "We are all Individuals: The Role of Robot Personality and Human Traits in Trustworthy Interaction. (arXiv:2307.15568v1 [cs.RO])",
    "abstract": "As robots take on roles in our society, it is important that their appearance, behaviour and personality are appropriate for the job they are given and are perceived favourably by the people with whom they interact. Here, we provide an extensive quantitative and qualitative study exploring robot personality but, importantly, with respect to individual human traits. Firstly, we show that we can accurately portray personality in a social robot, in terms of extroversion-introversion using vocal cues and linguistic features. Secondly, through garnering preferences and trust ratings for these different robot personalities, we establish that, for a Robo-Barista, an extrovert robot is preferred and trusted more than an introvert robot, regardless of the subject's own personality. Thirdly, we find that individual attitudes and predispositions towards robots do impact trust in the Robo-Baristas, and are therefore important considerations in addition to robot personality, roles and interaction c",
    "link": "http://arxiv.org/abs/2307.15568",
    "context": "Title: We are all Individuals: The Role of Robot Personality and Human Traits in Trustworthy Interaction. (arXiv:2307.15568v1 [cs.RO])\nAbstract: As robots take on roles in our society, it is important that their appearance, behaviour and personality are appropriate for the job they are given and are perceived favourably by the people with whom they interact. Here, we provide an extensive quantitative and qualitative study exploring robot personality but, importantly, with respect to individual human traits. Firstly, we show that we can accurately portray personality in a social robot, in terms of extroversion-introversion using vocal cues and linguistic features. Secondly, through garnering preferences and trust ratings for these different robot personalities, we establish that, for a Robo-Barista, an extrovert robot is preferred and trusted more than an introvert robot, regardless of the subject's own personality. Thirdly, we find that individual attitudes and predispositions towards robots do impact trust in the Robo-Baristas, and are therefore important considerations in addition to robot personality, roles and interaction c",
    "path": "papers/23/07/2307.15568.json",
    "total_tokens": 960,
    "translated_title": "我们都是个体：机器人个性和人类特质在可信互动中的作用",
    "translated_abstract": "随着机器人在我们社会中扮演角色，重要的是它们的外观、行为和个性是否适合其工作，并且是否受到与其互动的人们的喜爱。在这里，我们提供了一个广泛的定量和定性研究，探讨了机器人个性与个体人类特质之间的关系。首先，我们通过声音提示和语言特征来准确描绘社交机器人的个性，即外向性和内向性。其次，通过获取对这些不同机器人个性的偏好和信任评级，我们确定对于一名机器人咖啡师而言，外向个性的机器人比内向个性的机器人更受欢迎和被信任，不论受试者自身的个性如何。第三，我们发现个体对机器人的态度和偏好确实会影响对机器人咖啡师的信任，因此除了机器人个性、角色和互动之外，它们也是重要的考虑因素。",
    "tldr": "本文通过定量和定性研究，探讨了机器人个性与个体人类特质之间的关系，并发现外向个性的机器人在人们对机器人咖啡师的信任中更受欢迎和被信任，同时发现个体对机器人的态度和偏好对信任也有影响。",
    "en_tdlr": "This paper provides a comprehensive study on the relationship between robot personality and individual human traits, revealing that extrovert robots are preferred and trusted more than introvert robots by individuals, regardless of their own personality. It also highlights the importance of individual attitudes and predispositions towards robots in determining trust in robot-Baristas."
}