{
    "title": "Assisting Clinical Decisions for Scarcely Available Treatment via Disentangled Latent Representation. (arXiv:2307.03315v1 [cs.LG])",
    "abstract": "Extracorporeal membrane oxygenation (ECMO) is an essential life-supporting modality for COVID-19 patients who are refractory to conventional therapies. However, the proper treatment decision has been the subject of significant debate and it remains controversial about who benefits from this scarcely available and technically complex treatment option. To support clinical decisions, it is a critical need to predict the treatment need and the potential treatment and no-treatment responses. Targeting this clinical challenge, we propose Treatment Variational AutoEncoder (TVAE), a novel approach for individualized treatment analysis. TVAE is specifically designed to address the modeling challenges like ECMO with strong treatment selection bias and scarce treatment cases. TVAE conceptualizes the treatment decision as a multi-scale problem. We model a patient's potential treatment assignment and the factual and counterfactual outcomes as part of their intrinsic characteristics that can be repr",
    "link": "http://arxiv.org/abs/2307.03315",
    "context": "Title: Assisting Clinical Decisions for Scarcely Available Treatment via Disentangled Latent Representation. (arXiv:2307.03315v1 [cs.LG])\nAbstract: Extracorporeal membrane oxygenation (ECMO) is an essential life-supporting modality for COVID-19 patients who are refractory to conventional therapies. However, the proper treatment decision has been the subject of significant debate and it remains controversial about who benefits from this scarcely available and technically complex treatment option. To support clinical decisions, it is a critical need to predict the treatment need and the potential treatment and no-treatment responses. Targeting this clinical challenge, we propose Treatment Variational AutoEncoder (TVAE), a novel approach for individualized treatment analysis. TVAE is specifically designed to address the modeling challenges like ECMO with strong treatment selection bias and scarce treatment cases. TVAE conceptualizes the treatment decision as a multi-scale problem. We model a patient's potential treatment assignment and the factual and counterfactual outcomes as part of their intrinsic characteristics that can be repr",
    "path": "papers/23/07/2307.03315.json",
    "total_tokens": 950,
    "translated_title": "通过解缠的潜在表示辅助临床决策以获取可用治疗",
    "translated_abstract": "体外膜肺氧合(ECMO)是对于COVID-19患者的重要的生命支持方式，这些患者对传统治疗方法无效。然而，对于这种稀缺且技术复杂的治疗选择，适当的治疗决策一直备受争议，对于谁会从中受益仍然存在争议。为了支持临床决策，预测治疗需求和潜在的治疗与非治疗反应是至关重要的。针对这一临床挑战，我们提出了Treatment Variational AutoEncoder (TVAE)，一种用于个体化治疗分析的新方法。TVAE专门设计来解决像ECMO这样具有强烈治疗选择偏差和治疗案例稀缺的建模挑战。TVAE将治疗决策视为一个多尺度问题。我们将患者的潜在治疗分配以及事实和反事实结果作为他们固有特征的一部分进行建模，这些特征可以被表征，",
    "tldr": "通过解决体外膜肺氧合(ECMO)治疗选择偏差和稀缺治疗案例的挑战，我们提出了一种名为Treatment Variational AutoEncoder (TVAE)的方法，用于个体化治疗分析，以支持临床决策。"
}