{
    "title": "Temporal Difference Learning for High-Dimensional PIDEs with Jumps. (arXiv:2307.02766v1 [math.NA])",
    "abstract": "In this paper, we propose a deep learning framework for solving high-dimensional partial integro-differential equations (PIDEs) based on the temporal difference learning. We introduce a set of Levy processes and construct a corresponding reinforcement learning model. To simulate the entire process, we use deep neural networks to represent the solutions and non-local terms of the equations. Subsequently, we train the networks using the temporal difference error, termination condition, and properties of the non-local terms as the loss function. The relative error of the method reaches O(10^{-3}) in 100-dimensional experiments and O(10^{-4}) in one-dimensional pure jump problems. Additionally, our method demonstrates the advantages of low computational cost and robustness, making it well-suited for addressing problems with different forms and intensities of jumps.",
    "link": "http://arxiv.org/abs/2307.02766",
    "context": "Title: Temporal Difference Learning for High-Dimensional PIDEs with Jumps. (arXiv:2307.02766v1 [math.NA])\nAbstract: In this paper, we propose a deep learning framework for solving high-dimensional partial integro-differential equations (PIDEs) based on the temporal difference learning. We introduce a set of Levy processes and construct a corresponding reinforcement learning model. To simulate the entire process, we use deep neural networks to represent the solutions and non-local terms of the equations. Subsequently, we train the networks using the temporal difference error, termination condition, and properties of the non-local terms as the loss function. The relative error of the method reaches O(10^{-3}) in 100-dimensional experiments and O(10^{-4}) in one-dimensional pure jump problems. Additionally, our method demonstrates the advantages of low computational cost and robustness, making it well-suited for addressing problems with different forms and intensities of jumps.",
    "path": "papers/23/07/2307.02766.json",
    "total_tokens": 825,
    "translated_title": "高维度跳跃偏微分方程的时差学习",
    "translated_abstract": "在本文中，我们提出了基于时差学习的深度学习框架，用于解决高维度的偏积分微分方程（PIDEs）。我们引入了一组Levy过程，并构建了一个相应的强化学习模型。为了模拟整个过程，我们使用深度神经网络来表示方程的解和非局部项。随后，我们使用时差误差、终止条件和非局部项的属性作为损失函数来训练网络。该方法在100维的实验中相对误差达到了O(10^{-3})，在一维纯跳跃问题中达到了O(10^{-4})。此外，我们的方法具有低计算成本和稳健性的优势，适用于解决具有不同形式和强度跳跃的问题。",
    "tldr": "本文提出了一种用于解决高维度跳跃偏微分方程的时差学习深度学习框架，该方法具有低计算成本和稳健性的优势，可以有效地处理具有不同形式和强度跳跃的问题。",
    "en_tdlr": "This paper proposes a temporal difference learning framework for solving high-dimensional PIDEs with jumps, which has the advantages of low computational cost and robustness, and is well-suited for addressing problems with different forms and intensities of jumps"
}