{
    "title": "Conceptual Cognitive Maps Formation with Neural Successor Networks and Word Embeddings. (arXiv:2307.01577v1 [cs.AI])",
    "abstract": "The human brain possesses the extraordinary capability to contextualize the information it receives from our environment. The entorhinal-hippocampal plays a critical role in this function, as it is deeply engaged in memory processing and constructing cognitive maps using place and grid cells. Comprehending and leveraging this ability could significantly augment the field of artificial intelligence. The multi-scale successor representation serves as a good model for the functionality of place and grid cells and has already shown promise in this role. Here, we introduce a model that employs successor representations and neural networks, along with word embedding vectors, to construct a cognitive map of three separate concepts. The network adeptly learns two different scaled maps and situates new information in proximity to related pre-existing representations. The dispersion of information across the cognitive map varies according to its scale - either being heavily concentrated, resulti",
    "link": "http://arxiv.org/abs/2307.01577",
    "context": "Title: Conceptual Cognitive Maps Formation with Neural Successor Networks and Word Embeddings. (arXiv:2307.01577v1 [cs.AI])\nAbstract: The human brain possesses the extraordinary capability to contextualize the information it receives from our environment. The entorhinal-hippocampal plays a critical role in this function, as it is deeply engaged in memory processing and constructing cognitive maps using place and grid cells. Comprehending and leveraging this ability could significantly augment the field of artificial intelligence. The multi-scale successor representation serves as a good model for the functionality of place and grid cells and has already shown promise in this role. Here, we introduce a model that employs successor representations and neural networks, along with word embedding vectors, to construct a cognitive map of three separate concepts. The network adeptly learns two different scaled maps and situates new information in proximity to related pre-existing representations. The dispersion of information across the cognitive map varies according to its scale - either being heavily concentrated, resulti",
    "path": "papers/23/07/2307.01577.json",
    "total_tokens": 837,
    "translated_title": "使用神经后继网络和词嵌入形成概念认知地图",
    "translated_abstract": "人脑具有从环境中接收信息并进行上下文处理的非凡能力。侧隔核-海马在这一功能中起着关键作用，它深度参与记忆处理和使用地点和网格细胞构建认知地图。理解和利用这种能力可以极大地增强人工智能领域。多尺度后续表示作为地点和网格细胞功能的良好模型，并已显示出潜力。在这里，我们介绍了一个模型，该模型利用后续表示、神经网络以及词嵌入向量来构建三个独立概念的认知地图。该网络能够灵活学习两种不同的尺度地图，并将新信息放置在相关的既有表示附近。信息在认知地图上的分布根据尺度的不同而变化，可以是高度集中的，导致...",
    "tldr": "本研究通过使用神经后继网络和词嵌入向量构建了一个概念认知地图，该地图能够根据不同的尺度学习并将新信息与相关的既有表示相连接。",
    "en_tdlr": "This study introduces a model that utilizes neural successor networks and word embeddings to construct a conceptual cognitive map, which is capable of learning and connecting new information with related pre-existing representations at different scales."
}