{
    "title": "GOOSE Algorithm: A Powerful Optimization Tool for Real-World Engineering Challenges and Beyond. (arXiv:2307.10420v1 [cs.AI])",
    "abstract": "This study proposes the GOOSE algorithm as a novel metaheuristic algorithm based on the goose's behavior during rest and foraging. The goose stands on one leg and keeps his balance to guard and protect other individuals in the flock. The GOOSE algorithm is benchmarked on 19 well-known benchmark test functions, and the results are verified by a comparative study with genetic algorithm (GA), particle swarm optimization (PSO), dragonfly algorithm (DA), and fitness dependent optimizer (FDO). In addition, the proposed algorithm is tested on 10 modern benchmark functions, and the gained results are compared with three recent algorithms, such as the dragonfly algorithm, whale optimization algorithm (WOA), and salp swarm algorithm (SSA). Moreover, the GOOSE algorithm is tested on 5 classical benchmark functions, and the obtained results are evaluated with six algorithms, such as fitness dependent optimizer (FDO), FOX optimizer, butterfly optimization algorithm (BOA), whale optimization algorit",
    "link": "http://arxiv.org/abs/2307.10420",
    "context": "Title: GOOSE Algorithm: A Powerful Optimization Tool for Real-World Engineering Challenges and Beyond. (arXiv:2307.10420v1 [cs.AI])\nAbstract: This study proposes the GOOSE algorithm as a novel metaheuristic algorithm based on the goose's behavior during rest and foraging. The goose stands on one leg and keeps his balance to guard and protect other individuals in the flock. The GOOSE algorithm is benchmarked on 19 well-known benchmark test functions, and the results are verified by a comparative study with genetic algorithm (GA), particle swarm optimization (PSO), dragonfly algorithm (DA), and fitness dependent optimizer (FDO). In addition, the proposed algorithm is tested on 10 modern benchmark functions, and the gained results are compared with three recent algorithms, such as the dragonfly algorithm, whale optimization algorithm (WOA), and salp swarm algorithm (SSA). Moreover, the GOOSE algorithm is tested on 5 classical benchmark functions, and the obtained results are evaluated with six algorithms, such as fitness dependent optimizer (FDO), FOX optimizer, butterfly optimization algorithm (BOA), whale optimization algorit",
    "path": "papers/23/07/2307.10420.json",
    "total_tokens": 939,
    "translated_title": "GOOSE算法: 一个强大的优化工具用于现实世界的工程挑战及更多。",
    "translated_abstract": "该研究提出了GOOSE算法，它是一种基于鹅在休息和觅食时的行为的元启发式算法。鹅靠着一只腿保持平衡，以守护和保护群体中的其他个体。GOOSE算法在19个知名的基准测试函数上进行基准测试，并通过与遗传算法(GA)、粒子群优化(PSO)、蜻蜓算法(DA)和适应性依赖优化器(FDO)的比较研究来验证结果。此外，该算法还在10个现代基准函数上进行了测试，并将结果与蜻蜓算法、鲸鱼优化算法(WOA)和鳐鱼群算法(SSA)等三个最近的算法进行了比较。此外，GOOSE算法还在5个经典基准函数上进行了测试，并将所得结果与适应性依赖优化器(FDO)、FOX优化器、蝶优化算法(BOA)、鲸鱼优化算法、人工蜂群算法和差分进化算法等六种算法进行了评估。",
    "tldr": "GOOSE算法是一种基于鹅的行为的元启发式算法，它在多个基准测试函数上进行了验证和比较，证明其在解决现实世界的工程挑战中的有效性。",
    "en_tdlr": "The GOOSE algorithm is a metaheuristic algorithm based on the behavior of geese, and it has been validated and compared on multiple benchmark test functions, demonstrating its effectiveness in addressing real-world engineering challenges."
}