{
    "title": "Evaluating and Enhancing Robustness of Deep Recommendation Systems Against Hardware Errors. (arXiv:2307.10244v1 [cs.IR])",
    "abstract": "Deep recommendation systems (DRS) heavily depend on specialized HPC hardware and accelerators to optimize energy, efficiency, and recommendation quality. Despite the growing number of hardware errors observed in large-scale fleet systems where DRS are deployed, the robustness of DRS has been largely overlooked. This paper presents the first systematic study of DRS robustness against hardware errors. We develop Terrorch, a user-friendly, efficient and flexible error injection framework on top of the widely-used PyTorch. We evaluate a wide range of models and datasets and observe that the DRS robustness against hardware errors is influenced by various factors from model parameters to input characteristics. We also explore 3 error mitigation methods including algorithm based fault tolerance (ABFT), activation clipping and selective bit protection (SBP). We find that applying activation clipping can recover up to 30% of the degraded AUC-ROC score, making it a promising mitigation method.",
    "link": "http://arxiv.org/abs/2307.10244",
    "context": "Title: Evaluating and Enhancing Robustness of Deep Recommendation Systems Against Hardware Errors. (arXiv:2307.10244v1 [cs.IR])\nAbstract: Deep recommendation systems (DRS) heavily depend on specialized HPC hardware and accelerators to optimize energy, efficiency, and recommendation quality. Despite the growing number of hardware errors observed in large-scale fleet systems where DRS are deployed, the robustness of DRS has been largely overlooked. This paper presents the first systematic study of DRS robustness against hardware errors. We develop Terrorch, a user-friendly, efficient and flexible error injection framework on top of the widely-used PyTorch. We evaluate a wide range of models and datasets and observe that the DRS robustness against hardware errors is influenced by various factors from model parameters to input characteristics. We also explore 3 error mitigation methods including algorithm based fault tolerance (ABFT), activation clipping and selective bit protection (SBP). We find that applying activation clipping can recover up to 30% of the degraded AUC-ROC score, making it a promising mitigation method.",
    "path": "papers/23/07/2307.10244.json",
    "total_tokens": 948,
    "translated_title": "对深度推荐系统抗硬件错误能力的评估和增强",
    "translated_abstract": "深度推荐系统（DRS）严重依赖于专用的高性能计算硬件和加速器，以优化能源、效率和推荐质量。尽管目前在部署DRS的大规模系统中观察到硬件错误的增加，但DRS的健壮性一直未受到重视。本文首次系统地研究了DRS在面对硬件错误时的健壮性。我们开发了一个名为Terrorch的用户友好、高效灵活的错误注入框架，基于广泛使用的PyTorch。我们评估了广泛的模型和数据集，观察到DRS的健壮性受到多种因素的影响，包括模型参数和输入特征。我们还探索了3种错误缓解方法，包括基于算法的容错（ABFT）、激活剪裁和选择性位保护（SBP）。我们发现应用激活剪裁可以恢复被降低的AUC-ROC得分高达30%，这使其成为一种有希望的缓解方法。",
    "tldr": "本研究对深度推荐系统在面对硬件错误时的健壮性进行了系统研究，开发了一个错误注入框架Terrorch，发现激活剪裁是一种有希望的错误缓解方法，可以恢复高达30%的被降低的AUC-ROC得分。",
    "en_tdlr": "This study systematically investigates the robustness of deep recommendation systems against hardware errors, develops an error injection framework called Terrorch, and finds that activation clipping is a promising error mitigation method that can recover up to 30% of the degraded AUC-ROC score."
}