{
    "title": "DWReCO at CheckThat! 2023: Enhancing Subjectivity Detection through Style-based Data Sampling. (arXiv:2307.03550v1 [cs.CL])",
    "abstract": "This paper describes our submission for the subjectivity detection task at the CheckThat! Lab. To tackle class imbalances in the task, we have generated additional training materials with GPT-3 models using prompts of different styles from a subjectivity checklist based on journalistic perspective. We used the extended training set to fine-tune language-specific transformer models. Our experiments in English, German and Turkish demonstrate that different subjective styles are effective across all languages. In addition, we observe that the style-based oversampling is better than paraphrasing in Turkish and English. Lastly, the GPT-3 models sometimes produce lacklustre results when generating style-based texts in non-English languages.",
    "link": "http://arxiv.org/abs/2307.03550",
    "context": "Title: DWReCO at CheckThat! 2023: Enhancing Subjectivity Detection through Style-based Data Sampling. (arXiv:2307.03550v1 [cs.CL])\nAbstract: This paper describes our submission for the subjectivity detection task at the CheckThat! Lab. To tackle class imbalances in the task, we have generated additional training materials with GPT-3 models using prompts of different styles from a subjectivity checklist based on journalistic perspective. We used the extended training set to fine-tune language-specific transformer models. Our experiments in English, German and Turkish demonstrate that different subjective styles are effective across all languages. In addition, we observe that the style-based oversampling is better than paraphrasing in Turkish and English. Lastly, the GPT-3 models sometimes produce lacklustre results when generating style-based texts in non-English languages.",
    "path": "papers/23/07/2307.03550.json",
    "total_tokens": 942,
    "translated_title": "DWReCO在CheckThat! 2023中通过基于风格的数据采样增强客观性检测",
    "translated_abstract": "本文描述了我们在CheckThat!实验室主观性检测任务中的提交。为了解决任务中的类别不平衡问题，我们使用基于新闻记者视角的主观性检查清单，使用不同风格的提示来生成额外的训练材料，使用GPT-3模型。我们使用扩展的训练集来微调语言特定的变形器模型。我们在英语、德语和土耳其语上的实验表明，不同的主观风格在所有语言中都是有效的。此外，我们观察到，在土耳其语和英语中，基于风格的过采样比改写更好。最后，我们发现在非英语语言中，GPT-3模型有时会生成乏味的结果。",
    "tldr": "本文介绍了我们通过基于风格的数据采样来增强主观性检测任务的方法。我们使用GPT-3模型根据新闻记者视角的主观性检查清单生成额外的训练材料，并使用扩展的训练集微调语言特定的变形器模型。我们的实验结果表明，不同主观风格在所有语言中都是有效的，并且基于风格的过采样在土耳其语和英语中的效果优于改写方法。然而，在非英语语言中，GPT-3模型有时会生成乏味的结果。",
    "en_tdlr": "This paper presents a method to enhance subjectivity detection through style-based data sampling. The authors generated additional training materials using GPT-3 models and prompts based on a journalistic perspective. The language-specific transformer models were fine-tuned using the extended training set. Experimental results show that different subjective styles are effective in all languages, and style-based oversampling outperforms paraphrasing in Turkish and English. However, the GPT-3 models sometimes produce lacklustre results when generating non-English style-based texts."
}