{
    "title": "Worth of knowledge in deep learning. (arXiv:2307.00712v1 [cs.LG])",
    "abstract": "Knowledge constitutes the accumulated understanding and experience that humans use to gain insight into the world. In deep learning, prior knowledge is essential for mitigating shortcomings of data-driven models, such as data dependence, generalization ability, and compliance with constraints. To enable efficient evaluation of the worth of knowledge, we present a framework inspired by interpretable machine learning. Through quantitative experiments, we assess the influence of data volume and estimation range on the worth of knowledge. Our findings elucidate the complex relationship between data and knowledge, including dependence, synergistic, and substitution effects. Our model-agnostic framework can be applied to a variety of common network architectures, providing a comprehensive understanding of the role of prior knowledge in deep learning models. It can also be used to improve the performance of informed machine learning, as well as distinguish improper prior knowledge.",
    "link": "http://arxiv.org/abs/2307.00712",
    "context": "Title: Worth of knowledge in deep learning. (arXiv:2307.00712v1 [cs.LG])\nAbstract: Knowledge constitutes the accumulated understanding and experience that humans use to gain insight into the world. In deep learning, prior knowledge is essential for mitigating shortcomings of data-driven models, such as data dependence, generalization ability, and compliance with constraints. To enable efficient evaluation of the worth of knowledge, we present a framework inspired by interpretable machine learning. Through quantitative experiments, we assess the influence of data volume and estimation range on the worth of knowledge. Our findings elucidate the complex relationship between data and knowledge, including dependence, synergistic, and substitution effects. Our model-agnostic framework can be applied to a variety of common network architectures, providing a comprehensive understanding of the role of prior knowledge in deep learning models. It can also be used to improve the performance of informed machine learning, as well as distinguish improper prior knowledge.",
    "path": "papers/23/07/2307.00712.json",
    "total_tokens": 879,
    "translated_title": "深度学习中知识的价值",
    "translated_abstract": "知识是人类用来洞察世界的累积理解和经验。在深度学习中，先前的知识对于弥补数据驱动模型的缺点非常重要，例如数据依赖性、泛化能力和遵守约束。为了能够有效评估知识的价值，我们提出了一个受可解释机器学习启发的框架。通过定量实验，我们评估了数据量和估计范围对知识的价值的影响。我们的发现阐明了数据和知识之间的复杂关系，包括依赖、协同和替代效应。我们的模型无关框架可以应用于各种常见的网络架构，提供对深度学习模型中先前知识作用的全面理解。它还可以用于改进知情机器学习的性能，以及区分不适当的先前知识。",
    "tldr": "该论文提出了一个模型-不可知框架，通过定量实验评估了数据量和估计范围对知识的价值的影响，阐明了数据和知识之间的复杂关系，并可应用于不同网络架构，提供对深度学习模型中先前知识作用的全面理解。"
}