{
    "title": "Towards Video Anomaly Retrieval from Video Anomaly Detection: New Benchmarks and Model",
    "abstract": "arXiv:2307.12545v2 Announce Type: replace-cross  Abstract: Video anomaly detection (VAD) has been paid increasing attention due to its potential applications, its current dominant tasks focus on online detecting anomalies% at the frame level, which can be roughly interpreted as the binary or multiple event classification. However, such a setup that builds relationships between complicated anomalous events and single labels, e.g., ``vandalism'', is superficial, since single labels are deficient to characterize anomalous events. In reality, users tend to search a specific video rather than a series of approximate videos. Therefore, retrieving anomalous events using detailed descriptions is practical and positive but few researches focus on this. In this context, we propose a novel task called Video Anomaly Retrieval (VAR), which aims to pragmatically retrieve relevant anomalous videos by cross-modalities, e.g., language descriptions and synchronous audios. Unlike the current video retrie",
    "link": "https://arxiv.org/abs/2307.12545",
    "context": "Title: Towards Video Anomaly Retrieval from Video Anomaly Detection: New Benchmarks and Model\nAbstract: arXiv:2307.12545v2 Announce Type: replace-cross  Abstract: Video anomaly detection (VAD) has been paid increasing attention due to its potential applications, its current dominant tasks focus on online detecting anomalies% at the frame level, which can be roughly interpreted as the binary or multiple event classification. However, such a setup that builds relationships between complicated anomalous events and single labels, e.g., ``vandalism'', is superficial, since single labels are deficient to characterize anomalous events. In reality, users tend to search a specific video rather than a series of approximate videos. Therefore, retrieving anomalous events using detailed descriptions is practical and positive but few researches focus on this. In this context, we propose a novel task called Video Anomaly Retrieval (VAR), which aims to pragmatically retrieve relevant anomalous videos by cross-modalities, e.g., language descriptions and synchronous audios. Unlike the current video retrie",
    "path": "papers/23/07/2307.12545.json",
    "total_tokens": 643,
    "translated_title": "从视频异常检测走向视频异常检索：新的基准和模型",
    "translated_abstract": "视频异常检测(VAD)因其潜在应用而受到越来越多的关注，目前的主要任务集中在在线检测帧级别的异常，这可以粗略地解释为二进制或多类事件分类。与此类似，我们提出了一个称为视频异常检索(VAR)的新任务，旨在通过跨模态，例如语言描述和同步音频，实现实用的检索相关异常视频。",
    "tldr": "提出了视频异常检索(VAR)任务，旨在通过跨模态检索相关异常视频。",
    "en_tdlr": "Introducing the Video Anomaly Retrieval (VAR) task, which aims to retrieve relevant anomalous videos through cross-modalities."
}