{
    "title": "DiffFlow: A Unified SDE Framework for Score-Based Diffusion Models and Generative Adversarial Networks. (arXiv:2307.02159v1 [stat.ML])",
    "abstract": "Generative models can be categorized into two types: explicit generative models that define explicit density forms and allow exact likelihood inference, such as score-based diffusion models (SDMs) and normalizing flows; implicit generative models that directly learn a transformation from the prior to the data distribution, such as generative adversarial nets (GANs). While these two types of models have shown great success, they suffer from respective limitations that hinder them from achieving fast sampling and high sample quality simultaneously. In this paper, we propose a unified theoretic framework for SDMs and GANs. We shown that: i) the learning dynamics of both SDMs and GANs can be described as a novel SDE named Discriminator Denoising Diffusion Flow (DiffFlow) where the drift can be determined by some weighted combinations of scores of the real data and the generated data; ii) By adjusting the relative weights between different score terms, we can obtain a smooth transition betw",
    "link": "http://arxiv.org/abs/2307.02159",
    "context": "Title: DiffFlow: A Unified SDE Framework for Score-Based Diffusion Models and Generative Adversarial Networks. (arXiv:2307.02159v1 [stat.ML])\nAbstract: Generative models can be categorized into two types: explicit generative models that define explicit density forms and allow exact likelihood inference, such as score-based diffusion models (SDMs) and normalizing flows; implicit generative models that directly learn a transformation from the prior to the data distribution, such as generative adversarial nets (GANs). While these two types of models have shown great success, they suffer from respective limitations that hinder them from achieving fast sampling and high sample quality simultaneously. In this paper, we propose a unified theoretic framework for SDMs and GANs. We shown that: i) the learning dynamics of both SDMs and GANs can be described as a novel SDE named Discriminator Denoising Diffusion Flow (DiffFlow) where the drift can be determined by some weighted combinations of scores of the real data and the generated data; ii) By adjusting the relative weights between different score terms, we can obtain a smooth transition betw",
    "path": "papers/23/07/2307.02159.json",
    "total_tokens": 860,
    "translated_title": "DiffFlow:一种用于基于分数的扩散模型和生成对抗网络的统一SDE框架",
    "translated_abstract": "生成模型可以分为两种类型：显式生成模型（如基于分数的扩散模型和归一化流）和隐式生成模型（如生成对抗网络）。尽管这两种模型都取得了很大的成功，但它们各自存在限制，无法同时实现快速采样和高质量样本。在本文中，我们提出了一个统一的理论框架，用于处理基于分数的扩散模型和生成对抗网络。我们证明了以下两点：i）SDM和GAN的学习动态可以归结为一个称为鉴别器降噪扩散流（DiffFlow）的新型SDE，其中漂移可以通过真实数据和生成数据的分数的加权组合来确定；ii）通过调整不同分数项之间的权重，我们可以实现平滑过渡。",
    "tldr": "本论文提出了一种名为DiffFlow的统一SDE框架，用于处理基于分数的扩散模型和生成对抗网络。通过调整权重，可以实现快速采样和高质量样本之间的平滑过渡。",
    "en_tdlr": "This paper presents a unified SDE framework called DiffFlow for handling score-based diffusion models and generative adversarial networks. By adjusting weights, it enables a smooth transition between fast sampling and high sample quality."
}