{
    "title": "MaGNAS: A Mapping-Aware Graph Neural Architecture Search Framework for Heterogeneous MPSoC Deployment. (arXiv:2307.08065v1 [cs.DC])",
    "abstract": "Graph Neural Networks (GNNs) are becoming increasingly popular for vision-based applications due to their intrinsic capacity in modeling structural and contextual relations between various parts of an image frame. On another front, the rising popularity of deep vision-based applications at the edge has been facilitated by the recent advancements in heterogeneous multi-processor Systems on Chips (MPSoCs) that enable inference under real-time, stringent execution requirements. By extension, GNNs employed for vision-based applications must adhere to the same execution requirements. Yet contrary to typical deep neural networks, the irregular flow of graph learning operations poses a challenge to running GNNs on such heterogeneous MPSoC platforms. In this paper, we propose a novel unified design-mapping approach for efficient processing of vision GNN workloads on heterogeneous MPSoC platforms. Particularly, we develop MaGNAS, a mapping-aware Graph Neural Architecture Search framework. MaGNA",
    "link": "http://arxiv.org/abs/2307.08065",
    "context": "Title: MaGNAS: A Mapping-Aware Graph Neural Architecture Search Framework for Heterogeneous MPSoC Deployment. (arXiv:2307.08065v1 [cs.DC])\nAbstract: Graph Neural Networks (GNNs) are becoming increasingly popular for vision-based applications due to their intrinsic capacity in modeling structural and contextual relations between various parts of an image frame. On another front, the rising popularity of deep vision-based applications at the edge has been facilitated by the recent advancements in heterogeneous multi-processor Systems on Chips (MPSoCs) that enable inference under real-time, stringent execution requirements. By extension, GNNs employed for vision-based applications must adhere to the same execution requirements. Yet contrary to typical deep neural networks, the irregular flow of graph learning operations poses a challenge to running GNNs on such heterogeneous MPSoC platforms. In this paper, we propose a novel unified design-mapping approach for efficient processing of vision GNN workloads on heterogeneous MPSoC platforms. Particularly, we develop MaGNAS, a mapping-aware Graph Neural Architecture Search framework. MaGNA",
    "path": "papers/23/07/2307.08065.json",
    "total_tokens": 899,
    "translated_title": "MaGNAS:一种面向异构MPSoC部署的映射感知图神经架构搜索框架",
    "translated_abstract": "随着图神经网络在视觉应用中的日益普及，由于其在对图像帧的各个部分之间建模结构和上下文关系方面的内在能力，因此它们变得越来越受欢迎。另一方面，异构多处理器芯片系统（MPSoCs）的最新进展使得边缘上的深度视觉应用越来越受欢迎，并且能够根据实时严格的执行要求进行推理。扩展而言，用于视觉应用的图神经网络必须遵守同样的执行要求。然而，与典型的深度神经网络相反，图学习操作的不规则流程对在这种异构MPSoC平台上运行图神经网络构成了挑战。在本文中，我们提出了一种新颖的统一设计映射方法，用于在异构MPSoC平台上高效处理视觉图神经网络工作负载。 特别地，我们开发了一个映射感知的图神经架构搜索框架MaGNAS。",
    "tldr": "MaGNAS是一种面向异构MPSoC部署的映射感知图神经架构搜索框架，能够高效处理视觉图神经网络工作负载。",
    "en_tdlr": "MaGNAS is a mapping-aware graph neural architecture search framework for heterogeneous MPSoC deployment, which can efficiently handle vision graph neural network workloads."
}