{
    "title": "RObotic MAnipulation Network (ROMAN) -- Hybrid Hierarchical Learning for Solving Complex Sequential Tasks. (arXiv:2307.00125v1 [cs.RO])",
    "abstract": "Solving long sequential tasks poses a significant challenge in embodied artificial intelligence. Enabling a robotic system to perform diverse sequential tasks with a broad range of manipulation skills is an active area of research. In this work, we present a Hybrid Hierarchical Learning framework, the Robotic Manipulation Network (ROMAN), to address the challenge of solving multiple complex tasks over long time horizons in robotic manipulation. ROMAN achieves task versatility and robust failure recovery by integrating behavioural cloning, imitation learning, and reinforcement learning. It consists of a central manipulation network that coordinates an ensemble of various neural networks, each specialising in distinct re-combinable sub-tasks to generate their correct in-sequence actions for solving complex long-horizon manipulation tasks. Experimental results show that by orchestrating and activating these specialised manipulation experts, ROMAN generates correct sequential activations f",
    "link": "http://arxiv.org/abs/2307.00125",
    "context": "Title: RObotic MAnipulation Network (ROMAN) -- Hybrid Hierarchical Learning for Solving Complex Sequential Tasks. (arXiv:2307.00125v1 [cs.RO])\nAbstract: Solving long sequential tasks poses a significant challenge in embodied artificial intelligence. Enabling a robotic system to perform diverse sequential tasks with a broad range of manipulation skills is an active area of research. In this work, we present a Hybrid Hierarchical Learning framework, the Robotic Manipulation Network (ROMAN), to address the challenge of solving multiple complex tasks over long time horizons in robotic manipulation. ROMAN achieves task versatility and robust failure recovery by integrating behavioural cloning, imitation learning, and reinforcement learning. It consists of a central manipulation network that coordinates an ensemble of various neural networks, each specialising in distinct re-combinable sub-tasks to generate their correct in-sequence actions for solving complex long-horizon manipulation tasks. Experimental results show that by orchestrating and activating these specialised manipulation experts, ROMAN generates correct sequential activations f",
    "path": "papers/23/07/2307.00125.json",
    "total_tokens": 842,
    "translated_title": "RObotic MAnipulation Network（ROMAN）--混合层次学习解决复杂的连续任务",
    "translated_abstract": "在实体人工智能中，解决长序列任务面临着重大挑战。使机器人系统能够执行多样化的连续任务，并具备广泛的操作技能是一个活跃的研究领域。在本文中，我们提出了一种混合层次学习框架，即ROBOTIC Manipulation Network（ROMAN），以解决机器人操作中的多个复杂任务的长时间任务。ROMAN通过集成行为克隆、模仿学习和强化学习来实现任务的多样性以及鲁棒的失败恢复。它包括一个中央操作网络，协调一组不同的神经网络，每个网络专注于不同的可重组子任务，生成它们在复杂的长时间操作任务中的正确连续动作。实验结果表明，通过协调和激活这些专门的操作专家，ROMAN生成了正确的顺序激活。",
    "tldr": "RObotic MAnipulation Network（ROMAN）通过混合层次学习框架解决复杂的连续操作任务，实现了任务多样性和鲁棒的失败恢复。",
    "en_tdlr": "RObotic MAnipulation Network (ROMAN) addresses the challenge of solving complex sequential tasks by using a hybrid hierarchical learning framework, achieving task versatility and robust failure recovery."
}