{
    "title": "Responses of Unemployment to Productivity Changes for a General Matching Technology. (arXiv:2307.05843v1 [econ.GN])",
    "abstract": "Workers separate from jobs, search for jobs, accept jobs, and fund consumption with their wages. Firms recruit workers to fill vacancies, but search frictions prevent firms from instantly hiring available workers. Unemployment persists. These features are described by the Diamond--Mortensen--Pissarides modeling framework. In this class of models, how unemployment responds to productivity changes depends on resources that can be allocated to job creation. Yet, this characterization has been made when matching is parameterized by a Cobb--Douglas technology. For a canonical DMP model, I (1) demonstrate that a unique steady-state equilibrium will exist as long as the initial vacancy yields a positive surplus; (2) characterize responses of unemployment to productivity changes for a general matching technology; and (3) show how a matching technology that is not Cobb--Douglas implies unemployment responds more to productivity changes, which is independent of resources available for job creati",
    "link": "http://arxiv.org/abs/2307.05843",
    "context": "Title: Responses of Unemployment to Productivity Changes for a General Matching Technology. (arXiv:2307.05843v1 [econ.GN])\nAbstract: Workers separate from jobs, search for jobs, accept jobs, and fund consumption with their wages. Firms recruit workers to fill vacancies, but search frictions prevent firms from instantly hiring available workers. Unemployment persists. These features are described by the Diamond--Mortensen--Pissarides modeling framework. In this class of models, how unemployment responds to productivity changes depends on resources that can be allocated to job creation. Yet, this characterization has been made when matching is parameterized by a Cobb--Douglas technology. For a canonical DMP model, I (1) demonstrate that a unique steady-state equilibrium will exist as long as the initial vacancy yields a positive surplus; (2) characterize responses of unemployment to productivity changes for a general matching technology; and (3) show how a matching technology that is not Cobb--Douglas implies unemployment responds more to productivity changes, which is independent of resources available for job creati",
    "path": "papers/23/07/2307.05843.json",
    "total_tokens": 899,
    "translated_title": "对于一般匹配技术的生产力变化的失业响应",
    "translated_abstract": "工人离职、寻找工作、接受工作并用工资支付消费。公司招聘工人来填补职位空缺，但搜索摩擦使得公司无法立即雇佣可用工人。失业持续存在。这些特征由Diamond-Mortensen-Pissarides建模框架描述。在这类模型中，失业对生产力变化的响应取决于可用于创造就业机会的资源。然而，这种特征是在匹配被Cobb-Douglas技术参数化时得出的。对于一个典型的DMP模型，我(1)证明只要初始职位空缺产生正的余额，就会存在唯一的稳态平衡;(2)对一般匹配技术的失业对生产力变化的响应进行了描述;(3)展示了一个不是Cobb-Douglas的匹配技术意味着失业对生产力变化的响应更大，这与可用于就业创造的资源无关。",
    "tldr": "这篇论文探讨了一般匹配技术下失业对生产力变化的响应。研究表明，失业对生产力变化的响应取决于可用于创造就业机会的资源，而不是匹配技术本身的类型。",
    "en_tdlr": "This paper investigates the response of unemployment to productivity changes for a general matching technology. The study shows that the response of unemployment to productivity changes depends on the resources available for job creation, rather than the specific type of matching technology."
}