{
    "title": "Chit-Chat or Deep Talk: Prompt Engineering for Process Mining. (arXiv:2307.09909v1 [cs.AI])",
    "abstract": "This research investigates the application of Large Language Models (LLMs) to augment conversational agents in process mining, aiming to tackle its inherent complexity and diverse skill requirements. While LLM advancements present novel opportunities for conversational process mining, generating efficient outputs is still a hurdle. We propose an innovative approach that amend many issues in existing solutions, informed by prior research on Natural Language Processing (NLP) for conversational agents. Leveraging LLMs, our framework improves both accessibility and agent performance, as demonstrated by experiments on public question and data sets. Our research sets the stage for future explorations into LLMs' role in process mining and concludes with propositions for enhancing LLM memory, implementing real-time user testing, and examining diverse data sets.",
    "link": "http://arxiv.org/abs/2307.09909",
    "context": "Title: Chit-Chat or Deep Talk: Prompt Engineering for Process Mining. (arXiv:2307.09909v1 [cs.AI])\nAbstract: This research investigates the application of Large Language Models (LLMs) to augment conversational agents in process mining, aiming to tackle its inherent complexity and diverse skill requirements. While LLM advancements present novel opportunities for conversational process mining, generating efficient outputs is still a hurdle. We propose an innovative approach that amend many issues in existing solutions, informed by prior research on Natural Language Processing (NLP) for conversational agents. Leveraging LLMs, our framework improves both accessibility and agent performance, as demonstrated by experiments on public question and data sets. Our research sets the stage for future explorations into LLMs' role in process mining and concludes with propositions for enhancing LLM memory, implementing real-time user testing, and examining diverse data sets.",
    "path": "papers/23/07/2307.09909.json",
    "total_tokens": 805,
    "translated_title": "Chit-Chat或者Deep Talk：用于过程挖掘的提示工程",
    "translated_abstract": "该研究探讨了大型语言模型(LLM)在过程挖掘中增强对话代理的应用，旨在应对其固有的复杂性和多样化的技能要求。虽然LLM的进展为对话式过程挖掘提供了新的机遇，但生成高效的输出仍然是一个障碍。我们提出了一种创新的方法，通过对自然语言处理(NLP)为对话代理进行的先前研究的了解，改善了现有解决方案中的许多问题。利用LLM，我们的框架改善了可访问性和代理性能，通过对公共问题和数据集的实验进行验证。我们的研究为进一步探索LLM在过程挖掘中的作用奠定了基础，并提出了增强LLM记忆、实施实时用户测试以及检查多样化数据集的建议。",
    "tldr": "这项研究通过应用大型语言模型(LLM)来增强对话代理在过程挖掘中的应用，改善了现有解决方案中的问题，并提出了未来的研究建议。",
    "en_tdlr": "This study investigates the application of Large Language Models (LLMs) to enhance conversational agents in process mining, addressing existing issues and proposing future research directions."
}