{
    "title": "Large Language Models (GPT) for automating feedback on programming assignments. (arXiv:2307.00150v1 [cs.HC])",
    "abstract": "Addressing the challenge of generating personalized feedback for programming assignments is demanding due to several factors, like the complexity of code syntax or different ways to correctly solve a task. In this experimental study, we automated the process of feedback generation by employing OpenAI's GPT-3.5 model to generate personalized hints for students solving programming assignments on an automated assessment platform. Students rated the usefulness of GPT-generated hints positively. The experimental group (with GPT hints enabled) relied less on the platform's regular feedback but performed better in terms of percentage of successful submissions across consecutive attempts for tasks, where GPT hints were enabled. For tasks where the GPT feedback was made unavailable, the experimental group needed significantly less time to solve assignments. Furthermore, when GPT hints were unavailable, students in the experimental condition were initially less likely to solve the assignment cor",
    "link": "http://arxiv.org/abs/2307.00150",
    "context": "Title: Large Language Models (GPT) for automating feedback on programming assignments. (arXiv:2307.00150v1 [cs.HC])\nAbstract: Addressing the challenge of generating personalized feedback for programming assignments is demanding due to several factors, like the complexity of code syntax or different ways to correctly solve a task. In this experimental study, we automated the process of feedback generation by employing OpenAI's GPT-3.5 model to generate personalized hints for students solving programming assignments on an automated assessment platform. Students rated the usefulness of GPT-generated hints positively. The experimental group (with GPT hints enabled) relied less on the platform's regular feedback but performed better in terms of percentage of successful submissions across consecutive attempts for tasks, where GPT hints were enabled. For tasks where the GPT feedback was made unavailable, the experimental group needed significantly less time to solve assignments. Furthermore, when GPT hints were unavailable, students in the experimental condition were initially less likely to solve the assignment cor",
    "path": "papers/23/07/2307.00150.json",
    "total_tokens": 891,
    "translated_title": "用于自动化编程作业反馈的大型语言模型（GPT）",
    "translated_abstract": "针对生成个性化编程作业反馈的挑战，由于代码语法的复杂性和正确解决任务的不同方法等多个因素，要求很高。在这个实验研究中，我们使用OpenAI的GPT-3.5模型自动化了反馈生成的过程，为学生在一个自动评估平台上解决编程作业生成个性化提示。学生对GPT生成的提示的有用性进行了积极评价。实验组（启用了GPT提示）在任务中的连续尝试中，提交成功的百分比表现更好，但对平台的常规反馈依赖较少。对于不可用GPT反馈的任务，实验组解决作业所需的时间显著较少。此外，当GPT提示不可用时，实验组学生初始对解决作业的可能性较低。",
    "tldr": "本研究使用OpenAI的GPT-3.5模型自动生成编程作业的个性化提示，该提示被学生们评价为有用。实验组在启用GPT提示的任务中表现出更好的提交成功率，同时减少对平台常规反馈的依赖。对于无法使用GPT提示的任务，实验组学生解决作业所需的时间也较少。",
    "en_tdlr": "This study utilizes OpenAI's GPT-3.5 model to generate personalized hints for programming assignments, which were rated positively by students. The experimental group showed better submission success rates and reduced reliance on regular feedback when using GPT hints. Additionally, they required less time to solve assignments when GPT hints were unavailable."
}