{
    "title": "Efficient Task Offloading Algorithm for Digital Twin in Edge/Cloud Computing Environment. (arXiv:2307.05888v1 [cs.LG])",
    "abstract": "In the era of Internet of Things (IoT), Digital Twin (DT) is envisioned to empower various areas as a bridge between physical objects and the digital world. Through virtualization and simulation techniques, multiple functions can be achieved by leveraging computing resources. In this process, Mobile Cloud Computing (MCC) and Mobile Edge Computing (MEC) have become two of the key factors to achieve real-time feedback. However, current works only considered edge servers or cloud servers in the DT system models. Besides, The models ignore the DT with not only one data resource. In this paper, we propose a new DT system model considering a heterogeneous MEC/MCC environment. Each DT in the model is maintained in one of the servers via multiple data collection devices. The offloading decision-making problem is also considered and a new offloading scheme is proposed based on Distributed Deep Learning (DDL). Simulation results demonstrate that our proposed algorithm can effectively and efficie",
    "link": "http://arxiv.org/abs/2307.05888",
    "context": "Title: Efficient Task Offloading Algorithm for Digital Twin in Edge/Cloud Computing Environment. (arXiv:2307.05888v1 [cs.LG])\nAbstract: In the era of Internet of Things (IoT), Digital Twin (DT) is envisioned to empower various areas as a bridge between physical objects and the digital world. Through virtualization and simulation techniques, multiple functions can be achieved by leveraging computing resources. In this process, Mobile Cloud Computing (MCC) and Mobile Edge Computing (MEC) have become two of the key factors to achieve real-time feedback. However, current works only considered edge servers or cloud servers in the DT system models. Besides, The models ignore the DT with not only one data resource. In this paper, we propose a new DT system model considering a heterogeneous MEC/MCC environment. Each DT in the model is maintained in one of the servers via multiple data collection devices. The offloading decision-making problem is also considered and a new offloading scheme is proposed based on Distributed Deep Learning (DDL). Simulation results demonstrate that our proposed algorithm can effectively and efficie",
    "path": "papers/23/07/2307.05888.json",
    "total_tokens": 860,
    "translated_title": "针对边缘/云计算环境中数字孪生的高效任务卸载算法",
    "translated_abstract": "在物联网时代，数字孪生被视为连接实物对象和数字世界之间的桥梁，通过虚拟化和模拟技术，可以利用计算资源实现多种功能。在这个过程中，移动云计算和移动边缘计算已成为实现实时反馈的关键因素。然而，当前的研究只考虑了数字孪生系统模型中的边缘服务器或云服务器，同时忽略了具有多个数据资源的数字孪生。本文提出了一种考虑异构MEC/MCC环境的新的数字孪生系统模型，模型中的每个数字孪生都通过多个数据采集设备在服务器中维护。还考虑了卸载决策问题，并基于分布式深度学习提出了一种新的卸载方案。仿真结果表明，我们提出的算法可以有效且高效地解决这个问题。",
    "tldr": "本论文提出了一种新的数字孪生系统模型，考虑了异构MEC/MCC环境，并基于分布式深度学习提出了一种新的任务卸载方案，实现了高效的实时反馈。",
    "en_tdlr": "This paper proposes a new digital twin system model considering heterogeneous MEC/MCC environment and introduces a new task offloading scheme based on distributed deep learning, achieving efficient real-time feedback."
}