{
    "title": "On Loop Formulas with Variables. (arXiv:2307.10226v1 [cs.AI])",
    "abstract": "Recently Ferraris, Lee and Lifschitz proposed a new definition of stable models that does not refer to grounding, which applies to the syntax of arbitrary first-order sentences. We show its relation to the idea of loop formulas with variables by Chen, Lin, Wang and Zhang, and generalize their loop formulas to disjunctive programs and to arbitrary first-order sentences. We also extend the syntax of logic programs to allow explicit quantifiers, and define its semantics as a subclass of the new language of stable models by Ferraris et al. Such programs inherit from the general language the ability to handle nonmonotonic reasoning under the stable model semantics even in the absence of the unique name and the domain closure assumptions, while yielding more succinct loop formulas than the general language due to the restricted syntax. We also show certain syntactic conditions under which query answering for an extended program can be reduced to entailment checking in first-order logic, prov",
    "link": "http://arxiv.org/abs/2307.10226",
    "context": "Title: On Loop Formulas with Variables. (arXiv:2307.10226v1 [cs.AI])\nAbstract: Recently Ferraris, Lee and Lifschitz proposed a new definition of stable models that does not refer to grounding, which applies to the syntax of arbitrary first-order sentences. We show its relation to the idea of loop formulas with variables by Chen, Lin, Wang and Zhang, and generalize their loop formulas to disjunctive programs and to arbitrary first-order sentences. We also extend the syntax of logic programs to allow explicit quantifiers, and define its semantics as a subclass of the new language of stable models by Ferraris et al. Such programs inherit from the general language the ability to handle nonmonotonic reasoning under the stable model semantics even in the absence of the unique name and the domain closure assumptions, while yielding more succinct loop formulas than the general language due to the restricted syntax. We also show certain syntactic conditions under which query answering for an extended program can be reduced to entailment checking in first-order logic, prov",
    "path": "papers/23/07/2307.10226.json",
    "total_tokens": 940,
    "translated_title": "关于带变量的循环公式",
    "translated_abstract": "最近，Ferraris，Lee和Lifschitz提出了一种新的稳定模型定义，不涉及grounding，适用于任意一阶句子的语法。我们展示了它与陈，林，王和张提出的带有变量的循环公式的关系，并将他们的循环公式推广到了含有或的程序和任意一阶句子。我们还扩展了逻辑程序的语法，允许显式量词，并将其语义定义为Ferraris等人的稳定模型新语言的子类。这样的程序继承了一般语言的能力，即即使在没有唯一名称和域闭包假设的情况下，在稳定模型语义下处理非单调推理，同时由于受限的语法而产生更简洁的循环公式。我们还展示了一定的句法条件，使得扩展程序的查询回答可以简化为一阶逻辑的蕴涵检查。",
    "tldr": "这项研究提出了一种新的定义稳定模型的方法，它不依赖于grounding，并可以适用于任意一阶句子的语法。通过扩展循环公式的概念，并将其推广到含有或的程序和任意一阶句子，研究表明这种方法可以在处理非单调推理时产生更简洁的结果，并简化查询回答的过程。",
    "en_tdlr": "This research proposes a new method for defining stable models that does not rely on grounding and can be applied to the syntax of arbitrary first-order sentences. By extending the concept of loop formulas and generalizing them to disjunctive programs and arbitrary first-order sentences, the study shows that this approach can yield more concise results in handling nonmonotonic reasoning and simplify the process of query answering."
}