{
    "title": "DPM-OT: A New Diffusion Probabilistic Model Based on Optimal Transport. (arXiv:2307.11308v1 [cs.CV])",
    "abstract": "Sampling from diffusion probabilistic models (DPMs) can be viewed as a piecewise distribution transformation, which generally requires hundreds or thousands of steps of the inverse diffusion trajectory to get a high-quality image. Recent progress in designing fast samplers for DPMs achieves a trade-off between sampling speed and sample quality by knowledge distillation or adjusting the variance schedule or the denoising equation. However, it can't be optimal in both aspects and often suffer from mode mixture in short steps. To tackle this problem, we innovatively regard inverse diffusion as an optimal transport (OT) problem between latents at different stages and propose the DPM-OT, a unified learning framework for fast DPMs with a direct expressway represented by OT map, which can generate high-quality samples within around 10 function evaluations. By calculating the semi-discrete optimal transport map between the data latents and the white noise, we obtain an expressway from the prio",
    "link": "http://arxiv.org/abs/2307.11308",
    "context": "Title: DPM-OT: A New Diffusion Probabilistic Model Based on Optimal Transport. (arXiv:2307.11308v1 [cs.CV])\nAbstract: Sampling from diffusion probabilistic models (DPMs) can be viewed as a piecewise distribution transformation, which generally requires hundreds or thousands of steps of the inverse diffusion trajectory to get a high-quality image. Recent progress in designing fast samplers for DPMs achieves a trade-off between sampling speed and sample quality by knowledge distillation or adjusting the variance schedule or the denoising equation. However, it can't be optimal in both aspects and often suffer from mode mixture in short steps. To tackle this problem, we innovatively regard inverse diffusion as an optimal transport (OT) problem between latents at different stages and propose the DPM-OT, a unified learning framework for fast DPMs with a direct expressway represented by OT map, which can generate high-quality samples within around 10 function evaluations. By calculating the semi-discrete optimal transport map between the data latents and the white noise, we obtain an expressway from the prio",
    "path": "papers/23/07/2307.11308.json",
    "total_tokens": 962,
    "translated_title": "DPM-OT:一种基于最优传输的新型扩散概率模型",
    "translated_abstract": "从扩散概率模型(DPMs)中采样可以看作是一个分段分布变换，通常需要几百或几千个逆扩散轨迹步骤，才能得到高质量的图像。最近在设计DPMs的快速取样器方面取得了一些进展，通过知识蒸馏或调整方差进化曲线或降噪方程，实现了在取样速度和样本质量之间的平衡。然而，这种方法在两个方面都不能达到最佳效果，并且在短距离上经常遇到模式混合问题。为了解决这个问题，我们创新地将逆扩散视为在不同阶段的潜变量之间的最优传输问题，并提出了DPM-OT，这是一种用OT映射表示的高速DPMs的统一学习框架，可以在约10个函数评估内生成高质量的样本。通过计算数据潜变量和白噪声之间的半离散最优传输映射，我们获得了一条从前至后的快速捷径。",
    "tldr": "DPM-OT是一种基于最优传输的新型扩散概率模型，通过在不同阶段的潜变量之间进行最优传输，提出了一个快速DPMs的统一学习框架，可以在约10个函数评估内生成高质量的样本。"
}