{
    "title": "Harnessing Synthetic Active Particles for Physical Reservoir Computing. (arXiv:2307.15010v1 [cond-mat.soft])",
    "abstract": "The processing of information is an indispensable property of living systems realized by networks of active processes with enormous complexity. They have inspired many variants of modern machine learning one of them being reservoir computing, in which stimulating a network of nodes with fading memory enables computations and complex predictions. Reservoirs are implemented on computer hardware, but also on unconventional physical substrates such as mechanical oscillators, spins, or bacteria often summarized as physical reservoir computing. Here we demonstrate physical reservoir computing with a synthetic active microparticle system that self-organizes from an active and passive component into inherently noisy nonlinear dynamical units. The self-organization and dynamical response of the unit is the result of a delayed propulsion of the microswimmer to a passive target. A reservoir of such units with a self-coupling via the delayed response can perform predictive tasks despite the strong",
    "link": "http://arxiv.org/abs/2307.15010",
    "context": "Title: Harnessing Synthetic Active Particles for Physical Reservoir Computing. (arXiv:2307.15010v1 [cond-mat.soft])\nAbstract: The processing of information is an indispensable property of living systems realized by networks of active processes with enormous complexity. They have inspired many variants of modern machine learning one of them being reservoir computing, in which stimulating a network of nodes with fading memory enables computations and complex predictions. Reservoirs are implemented on computer hardware, but also on unconventional physical substrates such as mechanical oscillators, spins, or bacteria often summarized as physical reservoir computing. Here we demonstrate physical reservoir computing with a synthetic active microparticle system that self-organizes from an active and passive component into inherently noisy nonlinear dynamical units. The self-organization and dynamical response of the unit is the result of a delayed propulsion of the microswimmer to a passive target. A reservoir of such units with a self-coupling via the delayed response can perform predictive tasks despite the strong",
    "path": "papers/23/07/2307.15010.json",
    "total_tokens": 867,
    "translated_title": "利用合成活性粒子进行物理储层计算",
    "translated_abstract": "信息处理是生物系统不可或缺的特性，由具有巨大复杂性的活动过程网络实现。这些网络激发了许多现代机器学习的变体之一，即储层计算。通过在具有衰落记忆的节点网络中实现储层计算，可以进行计算和复杂预测。储层可在计算机硬件上实现，也可以在非传统的物理基质上实现，如机械振子、自旋或细菌，通常被称为物理储层计算。在这里，我们展示了一个自组织的合成活性微粒系统进行物理储层计算，该系统由活性和被动组成的成分形成固有的噪声非线性动力学单元。单元的自组织和动力响应是通过微游动器对被动目标的延迟推进来实现的。通过延迟响应的自耦合，这样的单元储层可以执行预测任务，尽管存在强烈的噪声和非线性特性。",
    "tldr": "本研究展示了利用合成活性微粒系统进行物理储层计算，通过自组织和自耦合的特性，实现了具有噪声非线性动力学的预测任务。",
    "en_tdlr": "This study demonstrates physical reservoir computing using a synthetic active particle system, achieving predictive tasks with noise and nonlinear dynamics through self-organization and self-coupling."
}