{
    "title": "Full-resolution Lung Nodule Segmentation from Chest X-ray Images using Residual Encoder-Decoder Networks. (arXiv:2307.06547v1 [eess.IV])",
    "abstract": "Lung cancer is the leading cause of cancer death and early diagnosis is associated with a positive prognosis. Chest X-ray (CXR) provides an inexpensive imaging mode for lung cancer diagnosis. Suspicious nodules are difficult to distinguish from vascular and bone structures using CXR. Computer vision has previously been proposed to assist human radiologists in this task, however, leading studies use down-sampled images and computationally expensive methods with unproven generalization. Instead, this study localizes lung nodules using efficient encoder-decoder neural networks that process full resolution images to avoid any signal loss resulting from down-sampling. Encoder-decoder networks are trained and tested using the JSRT lung nodule dataset. The networks are used to localize lung nodules from an independent external CXR dataset. Sensitivity and false positive rates are measured using an automated framework to eliminate any observer subjectivity. These experiments allow for the dete",
    "link": "http://arxiv.org/abs/2307.06547",
    "context": "Title: Full-resolution Lung Nodule Segmentation from Chest X-ray Images using Residual Encoder-Decoder Networks. (arXiv:2307.06547v1 [eess.IV])\nAbstract: Lung cancer is the leading cause of cancer death and early diagnosis is associated with a positive prognosis. Chest X-ray (CXR) provides an inexpensive imaging mode for lung cancer diagnosis. Suspicious nodules are difficult to distinguish from vascular and bone structures using CXR. Computer vision has previously been proposed to assist human radiologists in this task, however, leading studies use down-sampled images and computationally expensive methods with unproven generalization. Instead, this study localizes lung nodules using efficient encoder-decoder neural networks that process full resolution images to avoid any signal loss resulting from down-sampling. Encoder-decoder networks are trained and tested using the JSRT lung nodule dataset. The networks are used to localize lung nodules from an independent external CXR dataset. Sensitivity and false positive rates are measured using an automated framework to eliminate any observer subjectivity. These experiments allow for the dete",
    "path": "papers/23/07/2307.06547.json",
    "total_tokens": 949,
    "translated_title": "使用残差编码-解码网络从胸部X射线图像中进行全分辨率肺结节分割",
    "translated_abstract": "肺癌是癌症死亡的主要原因，早期诊断与良好的预后相关。胸部X射线（CXR）提供了一种廉价的肺癌诊断成像方式。使用CXR很难区分可疑结节与血管和骨结构。先前的计算机视觉研究提出了辅助人类放射科医师进行该任务的方法，但是主要的研究使用了降采样图像和计算成本高昂、未经证实的泛化方法。相反，本研究使用高效的编码-解码神经网络来定位肺结节，该神经网络处理全分辨率图像以避免因降采样而导致的信号丢失。编码-解码网络使用JSRT肺结节数据集进行训练和测试，并用于定位来自独立的外部CXR数据集的肺结节。使用自动化框架测量了灵敏度和假阳性率，以消除任何观察者主观性。这些实验可以实现肺结节的检测。",
    "tldr": "本研究使用高效的编码-解码神经网络处理全分辨率图像，实现从胸部X射线图像中定位肺结节的目标，避免了降采样导致的信号丢失，并通过自动化框架对其进行了评估。",
    "en_tdlr": "This study achieves lung nodule localization from chest X-ray images using efficient encoder-decoder neural networks that process full resolution images, avoiding signal loss caused by downsampling, and evaluates them through an automated framework."
}