{
    "title": "A Comparative Analysis of Machine Learning Methods for Lane Change Intention Recognition Using Vehicle Trajectory Data. (arXiv:2307.15625v1 [stat.ML])",
    "abstract": "Accurately detecting and predicting lane change (LC)processes can help autonomous vehicles better understand their surrounding environment, recognize potential safety hazards, and improve traffic safety. This paper focuses on LC processes and compares different machine learning methods' performance to recognize LC intention from high-dimensionality time series data. To validate the performance of the proposed models, a total number of 1023 vehicle trajectories is extracted from the CitySim dataset. For LC intention recognition issues, the results indicate that with ninety-eight percent of classification accuracy, ensemble methods reduce the impact of Type II and Type III classification errors. Without sacrificing recognition accuracy, the LightGBM demonstrates a sixfold improvement in model training efficiency than the XGBoost algorithm.",
    "link": "http://arxiv.org/abs/2307.15625",
    "context": "Title: A Comparative Analysis of Machine Learning Methods for Lane Change Intention Recognition Using Vehicle Trajectory Data. (arXiv:2307.15625v1 [stat.ML])\nAbstract: Accurately detecting and predicting lane change (LC)processes can help autonomous vehicles better understand their surrounding environment, recognize potential safety hazards, and improve traffic safety. This paper focuses on LC processes and compares different machine learning methods' performance to recognize LC intention from high-dimensionality time series data. To validate the performance of the proposed models, a total number of 1023 vehicle trajectories is extracted from the CitySim dataset. For LC intention recognition issues, the results indicate that with ninety-eight percent of classification accuracy, ensemble methods reduce the impact of Type II and Type III classification errors. Without sacrificing recognition accuracy, the LightGBM demonstrates a sixfold improvement in model training efficiency than the XGBoost algorithm.",
    "path": "papers/23/07/2307.15625.json",
    "total_tokens": 803,
    "translated_title": "通过车辆轨迹数据进行车道改变意图识别的机器学习方法的比较分析",
    "translated_abstract": "准确地检测和预测车道改变过程可以帮助自动驾驶汽车更好地理解周围环境，识别潜在的安全隐患，并提高交通安全性。本文主要研究车道改变过程，并比较不同机器学习方法在从高维时间序列数据中识别车道改变意图方面的性能。为了验证所提模型的性能，从CitySim数据集中提取了总共1023个车辆轨迹。对于车道改变意图识别问题，结果表明，集成方法可以将II型和III型分类错误的影响降低到98%的分类准确率。在不损失识别准确率的情况下，LightGBM相比XGBoost算法在模型训练效率上提高了6倍。",
    "tldr": "本文比较了不同机器学习方法在车道改变意图识别中的性能，结果表明集成方法能降低分类错误的影响，而LightGBM相比XGBoost算法在模型训练效率上有显著提升。",
    "en_tdlr": "This paper compares the performance of different machine learning methods for lane change intention recognition, showing that ensemble methods reduce classification errors and LightGBM improves model training efficiency significantly compared to XGBoost."
}