{
    "title": "LogitMat : Zeroshot Learning Algorithm for Recommender Systems without Transfer Learning or Pretrained Models. (arXiv:2307.05680v1 [cs.IR])",
    "abstract": "Recommender system is adored in the internet industry as one of the most profitable technologies. Unlike other sectors such as fraud detection in the Fintech industry, recommender system is both deep and broad. In recent years, many researchers start to focus on the cold-start problem of recommender systems. In spite of the large volume of research literature, the majority of the research utilizes transfer learning / meta learning and pretrained model to solve the problem. Although the researchers claim the effectiveness of the approaches, everyone of them does rely on extra input data from other sources. In 2021 and 2022, several zeroshot learning algorithm for recommender system such as ZeroMat, DotMat, PoissonMat and PowerMat were invented. They are the first batch of the algorithms that rely on no transfer learning or pretrained models to tackle the problem. In this paper, we follow this line and invent a new zeroshot learning algorithm named LogitMat. We take advantage of the Zipf",
    "link": "http://arxiv.org/abs/2307.05680",
    "context": "Title: LogitMat : Zeroshot Learning Algorithm for Recommender Systems without Transfer Learning or Pretrained Models. (arXiv:2307.05680v1 [cs.IR])\nAbstract: Recommender system is adored in the internet industry as one of the most profitable technologies. Unlike other sectors such as fraud detection in the Fintech industry, recommender system is both deep and broad. In recent years, many researchers start to focus on the cold-start problem of recommender systems. In spite of the large volume of research literature, the majority of the research utilizes transfer learning / meta learning and pretrained model to solve the problem. Although the researchers claim the effectiveness of the approaches, everyone of them does rely on extra input data from other sources. In 2021 and 2022, several zeroshot learning algorithm for recommender system such as ZeroMat, DotMat, PoissonMat and PowerMat were invented. They are the first batch of the algorithms that rely on no transfer learning or pretrained models to tackle the problem. In this paper, we follow this line and invent a new zeroshot learning algorithm named LogitMat. We take advantage of the Zipf",
    "path": "papers/23/07/2307.05680.json",
    "total_tokens": 927,
    "translated_title": "LogitMat：零模型迁移或预训练模型的零射击学习算法，用于推荐系统",
    "translated_abstract": "推荐系统被互联网行业认为是最有利可图的技术之一。与金融科技行业的欺诈检测等其他领域不同，推荐系统既深又广。近年来，许多研究人员开始关注推荐系统的冷启动问题。尽管有大量的研究文献，但大多数研究利用迁移学习/元学习和预训练模型来解决这个问题。虽然研究人员声称这些方法的有效性，但每个方法都依赖于来自其他来源的额外输入数据。在2021年和2022年，诸如ZeroMat、DotMat、PoissonMat和PowerMat等几个零模型迁移或预训练模型的零射击学习算法被发明出来。它们是第一批无需模型迁移或预训练模型来解决问题的算法。在本文中，我们沿用此思路，并发明了一种新的零射击学习算法，命名为LogitMat。我们利用Zipf分布特性",
    "tldr": "本文介绍了一种名为LogitMat的零模型迁移或预训练模型的零射击学习算法，用于解决推荐系统的冷启动问题。",
    "en_tdlr": "This paper introduces a zero-shot learning algorithm called LogitMat, which does not rely on transfer learning or pretrained models, to solve the cold-start problem in recommender systems."
}