{
    "title": "Assessing the role of small farmers and households in agriculture and the rural economy and measures to support their sustainable development. (arXiv:2307.11683v1 [econ.GN])",
    "abstract": "The Ministry of Economy has an interest and demand in exploring how to increase the set of [legally registered] small family farmers in Ukraine and to examine more in details measures that could reduce the scale of the shadow agricultural market in Ukraine. Building upon the above political economy background and demand, we will be undertaking the analysis along the two separate but not totally independents streams of analysis, i.e. sustainable small scale (family) farming development and exploring the scale and measures for reducing the shadow agricultural market in Ukraine",
    "link": "http://arxiv.org/abs/2307.11683",
    "context": "Title: Assessing the role of small farmers and households in agriculture and the rural economy and measures to support their sustainable development. (arXiv:2307.11683v1 [econ.GN])\nAbstract: The Ministry of Economy has an interest and demand in exploring how to increase the set of [legally registered] small family farmers in Ukraine and to examine more in details measures that could reduce the scale of the shadow agricultural market in Ukraine. Building upon the above political economy background and demand, we will be undertaking the analysis along the two separate but not totally independents streams of analysis, i.e. sustainable small scale (family) farming development and exploring the scale and measures for reducing the shadow agricultural market in Ukraine",
    "path": "papers/23/07/2307.11683.json",
    "total_tokens": 712,
    "translated_title": "评估小农户和家庭在农业和农村经济中的角色以及支持其可持续发展的措施",
    "translated_abstract": "经济部对于如何增加乌克兰合法登记的小型家庭农民的数量以及研究能够减少乌克兰影子农业市场规模的措施有兴趣和需求。在以上政治经济背景和需求的基础上，我们将分别进行可持续小规模（家庭）农业发展和探索减少乌克兰影子农业市场规模和措施的分析。",
    "tldr": "该论文旨在评估小农户和家庭在农业和农村经济中的作用，以及提出支持其可持续发展的措施。同时，它还研究了如何减少乌克兰影子农业市场的规模和采取何种措施。",
    "en_tdlr": "This paper aims to assess the role of small farmers and households in agriculture and the rural economy, as well as propose measures to support their sustainable development. It also explores how to reduce the scale of the shadow agricultural market in Ukraine and the measures to be taken."
}