{
    "title": "Automated identification and quantification of myocardial inflammatory infiltration in digital histological images to diagnose myocarditis. (arXiv:2307.01098v1 [physics.med-ph] CROSS LISTED)",
    "abstract": "This study aims to develop a new computational pathology approach that automates the identification and quantification of myocardial inflammatory infiltration in digital HE-stained images to provide a quantitative histological diagnosis of myocarditis.898 HE-stained whole slide images (WSIs) of myocardium from 154 heart transplant patients diagnosed with myocarditis or dilated cardiomyopathy (DCM) were included in this study. An automated DL-based computational pathology approach was developed to identify nuclei and detect myocardial inflammatory infiltration, enabling the quantification of the lymphocyte nuclear density (LND) on myocardial WSIs. A cutoff value based on the quantification of LND was proposed to determine if the myocardial inflammatory infiltration was present. The performance of our approach was evaluated with a five-fold cross-validation experiment, tested with an internal test set from the myocarditis group, and confirmed by an external test from a double-blind trial",
    "link": "http://arxiv.org/abs/2307.01098",
    "context": "Title: Automated identification and quantification of myocardial inflammatory infiltration in digital histological images to diagnose myocarditis. (arXiv:2307.01098v1 [physics.med-ph] CROSS LISTED)\nAbstract: This study aims to develop a new computational pathology approach that automates the identification and quantification of myocardial inflammatory infiltration in digital HE-stained images to provide a quantitative histological diagnosis of myocarditis.898 HE-stained whole slide images (WSIs) of myocardium from 154 heart transplant patients diagnosed with myocarditis or dilated cardiomyopathy (DCM) were included in this study. An automated DL-based computational pathology approach was developed to identify nuclei and detect myocardial inflammatory infiltration, enabling the quantification of the lymphocyte nuclear density (LND) on myocardial WSIs. A cutoff value based on the quantification of LND was proposed to determine if the myocardial inflammatory infiltration was present. The performance of our approach was evaluated with a five-fold cross-validation experiment, tested with an internal test set from the myocarditis group, and confirmed by an external test from a double-blind trial",
    "path": "papers/23/07/2307.01098.json",
    "total_tokens": 978,
    "translated_title": "自动识别和定量心肌组织炎症浸润在数字组织切片图像中以诊断心肌炎",
    "translated_abstract": "本研究旨在开发一种新的计算病理学方法，自动识别和定量心肌组织炎症浸润在数字HE染色图像中，以提供心肌炎的定量组织学诊断。本研究包括154名心脏移植病人诊断为心肌炎或扩张型心肌病的898个HE染色全切片图像。我们开发了一种基于DL的自动计算病理学方法，用于识别细胞核并检测心肌组织炎症浸润，使得可以定量测量心肌全切片图像上的淋巴细胞核密度（LND）。提出了一个基于LND定量的截断值来确定是否存在心肌炎症浸润。我们的方法通过五折交叉验证实验评估性能，使用来自心肌炎组的内部测试集进行测试，并通过双盲试验的外部测试进行确认。",
    "tldr": "本研究开发了一种新的计算病理学方法，用于自动识别和定量心肌组织炎症浸润在数字HE染色图像中，为心肌炎提供定量组织学诊断。该方法通过指标LND的定量来判断是否存在心肌炎症浸润。"
}