{
    "title": "Fault Monitoring in Passive Optical Networks using Machine Learning Techniques. (arXiv:2307.03945v1 [cs.LG])",
    "abstract": "Passive optical network (PON) systems are vulnerable to a variety of failures, including fiber cuts and optical network unit (ONU) transmitter/receiver failures. Any service interruption caused by a fiber cut can result in huge financial losses for service providers or operators. Identifying the faulty ONU becomes difficult in the case of nearly equidistant branch terminations because the reflections from the branches overlap, making it difficult to distinguish the faulty branch given the global backscattering signal. With increasing network size, the complexity of fault monitoring in PON systems increases, resulting in less reliable monitoring. To address these challenges, we propose in this paper various machine learning (ML) approaches for fault monitoring in PON systems, and we validate them using experimental optical time domain reflectometry (OTDR) data.",
    "link": "http://arxiv.org/abs/2307.03945",
    "context": "Title: Fault Monitoring in Passive Optical Networks using Machine Learning Techniques. (arXiv:2307.03945v1 [cs.LG])\nAbstract: Passive optical network (PON) systems are vulnerable to a variety of failures, including fiber cuts and optical network unit (ONU) transmitter/receiver failures. Any service interruption caused by a fiber cut can result in huge financial losses for service providers or operators. Identifying the faulty ONU becomes difficult in the case of nearly equidistant branch terminations because the reflections from the branches overlap, making it difficult to distinguish the faulty branch given the global backscattering signal. With increasing network size, the complexity of fault monitoring in PON systems increases, resulting in less reliable monitoring. To address these challenges, we propose in this paper various machine learning (ML) approaches for fault monitoring in PON systems, and we validate them using experimental optical time domain reflectometry (OTDR) data.",
    "path": "papers/23/07/2307.03945.json",
    "total_tokens": 784,
    "translated_title": "无源光网络中基于机器学习技术的故障监测",
    "translated_abstract": "无源光网络系统容易出现多种故障，包括光纤切断和光网络单元（ONU）的发射机/接收机故障。光纤切断造成的任何服务中断都可能给服务提供商或运营商带来巨大的经济损失。在几乎等距离的分支终止情况下，识别故障ONU变得困难，因为分支的反射重叠，很难根据全局反射信号区别出故障的分支。随着网络规模的增加，无源光网络系统中故障监测的复杂性增加，导致监测不够可靠。为了解决这些挑战，我们在本文中提出了各种机器学习（ML）方法用于无源光网络系统的故障监测，并使用实验光时域反射计（OTDR）数据进行验证。",
    "tldr": "本文提出了基于机器学习技术的无源光网络故障监测方法，并使用实验数据进行了验证。"
}