{
    "title": "Visualizing Overlapping Biclusterings and Boolean Matrix Factorizations. (arXiv:2307.07396v1 [cs.LG])",
    "abstract": "Finding (bi-)clusters in bipartite graphs is a popular data analysis approach. Analysts typically want to visualize the clusters, which is simple as long as the clusters are disjoint. However, many modern algorithms find overlapping clusters, making visualization more complicated. In this paper, we study the problem of visualizing \\emph{a given clustering} of overlapping clusters in bipartite graphs and the related problem of visualizing Boolean Matrix Factorizations. We conceptualize three different objectives that any good visualization should satisfy: (1) proximity of cluster elements, (2) large consecutive areas of elements from the same cluster, and (3) large uninterrupted areas in the visualization, regardless of the cluster membership. We provide objective functions that capture these goals and algorithms that optimize these objective functions. Interestingly, in experiments on real-world datasets, we find that the best trade-off between these competing goals is achieved by a no",
    "link": "http://arxiv.org/abs/2307.07396",
    "context": "Title: Visualizing Overlapping Biclusterings and Boolean Matrix Factorizations. (arXiv:2307.07396v1 [cs.LG])\nAbstract: Finding (bi-)clusters in bipartite graphs is a popular data analysis approach. Analysts typically want to visualize the clusters, which is simple as long as the clusters are disjoint. However, many modern algorithms find overlapping clusters, making visualization more complicated. In this paper, we study the problem of visualizing \\emph{a given clustering} of overlapping clusters in bipartite graphs and the related problem of visualizing Boolean Matrix Factorizations. We conceptualize three different objectives that any good visualization should satisfy: (1) proximity of cluster elements, (2) large consecutive areas of elements from the same cluster, and (3) large uninterrupted areas in the visualization, regardless of the cluster membership. We provide objective functions that capture these goals and algorithms that optimize these objective functions. Interestingly, in experiments on real-world datasets, we find that the best trade-off between these competing goals is achieved by a no",
    "path": "papers/23/07/2307.07396.json",
    "total_tokens": 916,
    "translated_title": "可视化重叠双聚类和布尔矩阵分解",
    "translated_abstract": "在双分图中寻找（双）聚类是一种流行的数据分析方法。分析人员通常希望可视化这些聚类，只要聚类不重叠，这是简单的。然而，许多现代算法发现重叠的聚类，使可视化变得更加复杂。在本文中，我们研究了在双分图中可视化重叠聚类和相关问题的问题，以及可视化布尔矩阵分解的问题。我们概念化了任何好的可视化应该满足的三个不同目标：（1）聚类元素的接近性，（2）相同聚类的元素的大连续区域，以及（3）可视化中的大连续区域，无论聚类成员如何。我们提供了捕捉这些目标的目标函数和优化这些目标函数的算法。有趣的是，在对真实数据集进行的实验中，我们发现在这些竞争目标之间的最佳平衡是通过一种没有重叠的聚类解决方法得到的。",
    "tldr": "本论文研究了在双分图中可视化重叠聚类和相关问题的方法，并提供了能满足多个目标的算法，结果表明在真实数据集中最佳平衡是通过一种没有重叠的聚类解决方法得到的。",
    "en_tdlr": "This paper investigates methods for visualizing overlapping clusters and related problems in bipartite graphs, providing algorithms that satisfy multiple objectives. The results show that the best trade-off among these objectives is achieved by an approach that does not have overlapping clusters."
}