{
    "title": "Scalable Multi-agent Skill Discovery based on Kronecker Graphs. (arXiv:2307.11629v1 [cs.LG])",
    "abstract": "Covering skill (a.k.a., option) discovery has been developed to improve the exploration of RL in single-agent scenarios with sparse reward signals, through connecting the most distant states in the embedding space provided by the Fiedler vector of the state transition graph. Given that joint state space grows exponentially with the number of agents in multi-agent systems, existing researches still relying on single-agent option discovery either become prohibitive or fail to directly discover joint options that improve the connectivity of the joint state space. In this paper, we show how to directly compute multi-agent options with collaborative exploratory behaviors while still enjoying the ease of decomposition. Our key idea is to approximate the joint state space as a Kronecker graph, based on which we can directly estimate its Fiedler vector using the Laplacian spectrum of individual agents' transition graphs. Further, considering that directly computing the Laplacian spectrum is in",
    "link": "http://arxiv.org/abs/2307.11629",
    "context": "Title: Scalable Multi-agent Skill Discovery based on Kronecker Graphs. (arXiv:2307.11629v1 [cs.LG])\nAbstract: Covering skill (a.k.a., option) discovery has been developed to improve the exploration of RL in single-agent scenarios with sparse reward signals, through connecting the most distant states in the embedding space provided by the Fiedler vector of the state transition graph. Given that joint state space grows exponentially with the number of agents in multi-agent systems, existing researches still relying on single-agent option discovery either become prohibitive or fail to directly discover joint options that improve the connectivity of the joint state space. In this paper, we show how to directly compute multi-agent options with collaborative exploratory behaviors while still enjoying the ease of decomposition. Our key idea is to approximate the joint state space as a Kronecker graph, based on which we can directly estimate its Fiedler vector using the Laplacian spectrum of individual agents' transition graphs. Further, considering that directly computing the Laplacian spectrum is in",
    "path": "papers/23/07/2307.11629.json",
    "total_tokens": 865,
    "translated_title": "基于Kronecker图的可扩展多智能体技能发现",
    "translated_abstract": "技能发现在强化学习中已经用于改善单智能体场景下稀疏奖励信号的探索，通过连接状态转换图的Fiedler向量所提供的嵌入空间中最远的状态。然而，在多智能体系统中，由于联合状态空间的指数增长，现有研究仍依赖于单智能体技能发现，要么变得难以实现，要么无法直接发现改善联合状态空间连通性的联合技能。本文展示了如何直接计算具有协作探索行为的多智能体技能，同时享受到分解的便利性。我们的关键思想是将联合状态空间近似为一个Kronecker图，基于此我们可以使用各个智能体的转换图的拉普拉斯谱直接估计其Fiedler向量。进一步地，考虑到直接计算拉普拉斯谱在计算上的复杂性，",
    "tldr": "本文提出了一种基于Kronecker图的可扩展多智能体技能发现方法，通过连接状态转换图的Fiedler向量，直接计算具有协作探索行为的多智能体技能。",
    "en_tdlr": "This paper proposes a scalable multi-agent skill discovery method based on Kronecker graphs, which directly computes collaborative exploratory behaviors for multi-agent systems by connecting the Fiedler vector of the state transition graph."
}