{
    "title": "Commitment and the Dynamics of Household Labor Supply. (arXiv:2307.10983v1 [econ.GN])",
    "abstract": "The extent to which individuals commit to their partner for life has important implications. This paper develops a lifecycle collective model of the household, through which it characterizes behavior in three prominent alternative types of commitment: full, limited, and no commitment. We propose a test that distinguishes between all three types based on how contemporaneous and historical news affect household behavior. Our test permits heterogeneity in the degree of commitment across households. Using recent data from the Panel Study of Income Dynamics, we reject full and no commitment, while we find strong evidence for limited commitment.",
    "link": "http://arxiv.org/abs/2307.10983",
    "context": "Title: Commitment and the Dynamics of Household Labor Supply. (arXiv:2307.10983v1 [econ.GN])\nAbstract: The extent to which individuals commit to their partner for life has important implications. This paper develops a lifecycle collective model of the household, through which it characterizes behavior in three prominent alternative types of commitment: full, limited, and no commitment. We propose a test that distinguishes between all three types based on how contemporaneous and historical news affect household behavior. Our test permits heterogeneity in the degree of commitment across households. Using recent data from the Panel Study of Income Dynamics, we reject full and no commitment, while we find strong evidence for limited commitment.",
    "path": "papers/23/07/2307.10983.json",
    "total_tokens": 711,
    "translated_title": "承诺与家庭劳动力供给的动态。 (arXiv:2307.10983v1 [econ.GN])",
    "translated_abstract": "个体对伴侣的承诺程度对社会有重要影响。本文通过发展一个家庭的生命周期集体模型，描述了三种不同类型的承诺：全面承诺、有限承诺和无承诺。我们提出了一种测试方法，通过观察当下和历史消息对家庭行为的影响来区分这三种类型。我们的测试允许家庭之间承诺程度的异质性。使用最近的“收入动态面板研究”数据，我们拒绝了全面承诺和无承诺，同时找到了有限承诺的强有力证据。",
    "tldr": "本文发展了一个家庭生命周期集体模型，研究了三种承诺类型的家庭行为，并通过测试方法确定了家庭承诺程度的异质性。使用最新数据，研究发现有限承诺是最普遍的类型。",
    "en_tdlr": "This paper develops a lifecycle collective model of the household to examine three types of commitment and finds strong evidence for limited commitment using recent data."
}