{
    "title": "The Heterogeneous Earnings Impact of Job Loss Across Workers, Establishments, and Markets. (arXiv:2307.06684v1 [econ.GN])",
    "abstract": "Using generalized random forests and rich Swedish administrative data, we show that the earnings effects of job displacement due to establishment closures are extremely heterogeneous across workers, establishments, and markets. The decile of workers with the largest predicted effects lose 50 percent of annual earnings the year after displacement and accumulated losses amount to 250 percent during a decade. In contrast, workers in the least affected decile experience only marginal losses of less than 6 percent in the year after displacement. Workers in the most affected decile tend to be lower paid workers on negative earnings trajectories. This implies that the economic value of (lost) jobs is greatest for workers with low earnings. The reason is that many of these workers fail to find new employment after displacement. Overall, the effects are heterogeneous both within and across establishments and combinations of important individual characteristics such as age and schooling. Adverse",
    "link": "http://arxiv.org/abs/2307.06684",
    "context": "Title: The Heterogeneous Earnings Impact of Job Loss Across Workers, Establishments, and Markets. (arXiv:2307.06684v1 [econ.GN])\nAbstract: Using generalized random forests and rich Swedish administrative data, we show that the earnings effects of job displacement due to establishment closures are extremely heterogeneous across workers, establishments, and markets. The decile of workers with the largest predicted effects lose 50 percent of annual earnings the year after displacement and accumulated losses amount to 250 percent during a decade. In contrast, workers in the least affected decile experience only marginal losses of less than 6 percent in the year after displacement. Workers in the most affected decile tend to be lower paid workers on negative earnings trajectories. This implies that the economic value of (lost) jobs is greatest for workers with low earnings. The reason is that many of these workers fail to find new employment after displacement. Overall, the effects are heterogeneous both within and across establishments and combinations of important individual characteristics such as age and schooling. Adverse",
    "path": "papers/23/07/2307.06684.json",
    "total_tokens": 1074,
    "translated_title": "工作丧失对不同工人、企业和市场的收入影响异质性研究",
    "translated_abstract": "使用广义随机森林和丰富的瑞典行政数据，我们发现由于企业关闭而导致的工作失去的收入影响在工人、企业和市场之间存在极大的异质性。受影响程度最大的十分位工人在失业后的一年内会损失50%的年收入，并且在十年期间累计损失达到250%。相反，受影响程度最小的十分位工人在失业后的一年内只会遭受不到6%的边际损失。受影响程度最大的十分位工人往往是低薪工人且薪资出现负增长趋势。这意味着对于低收入工人而言，（失去的）就业的经济价值是最大的。原因是许多这些工人在失业后未能找到新的工作。总体而言，这些影响在企业内部和不同重要个体特征（如年龄和受教育程度）之间都存在异质性。",
    "tldr": "这项研究利用广义随机森林和瑞典行政数据发现，工作丧失对不同工人、企业和市场的收入影响具有极大的异质性。对受影响程度最大的工人而言，失去的工作使其每年收入损失50%，十年期间累计损失达到250%。对受影响程度最小的工人而言，仅遭受边际损失不到6%。总体而言，这些影响在企业内部和不同个体特征之间都存在差异。",
    "en_tdlr": "Using generalized random forests and rich Swedish administrative data, this study finds that the earnings effects of job displacement due to establishment closures are extremely heterogeneous across workers, establishments, and markets. Workers with the largest predicted effects lose 50 percent of annual earnings the year after displacement and accumulated losses amount to 250 percent during a decade. Workers in the least affected decile experience only marginal losses of less than 6 percent in the year after displacement. Overall, these effects are heterogeneous within and across establishments and combinations of important individual characteristics such as age and schooling."
}