{
    "title": "Reconciling the accuracy-diversity trade-off in recommendations. (arXiv:2307.15142v1 [cs.IR])",
    "abstract": "In recommendation settings, there is an apparent trade-off between the goals of accuracy (to recommend items a user is most likely to want) and diversity (to recommend items representing a range of categories). As such, real-world recommender systems often explicitly incorporate diversity separately from accuracy. This approach, however, leaves a basic question unanswered: Why is there a trade-off in the first place?  We show how the trade-off can be explained via a user's consumption constraints -- users typically only consume a few of the items they are recommended. In a stylized model we introduce, objectives that account for this constraint induce diverse recommendations, while objectives that do not account for this constraint induce homogeneous recommendations. This suggests that accuracy and diversity appear misaligned because standard accuracy metrics do not consider consumption constraints. Our model yields precise and interpretable characterizations of diversity in different ",
    "link": "http://arxiv.org/abs/2307.15142",
    "context": "Title: Reconciling the accuracy-diversity trade-off in recommendations. (arXiv:2307.15142v1 [cs.IR])\nAbstract: In recommendation settings, there is an apparent trade-off between the goals of accuracy (to recommend items a user is most likely to want) and diversity (to recommend items representing a range of categories). As such, real-world recommender systems often explicitly incorporate diversity separately from accuracy. This approach, however, leaves a basic question unanswered: Why is there a trade-off in the first place?  We show how the trade-off can be explained via a user's consumption constraints -- users typically only consume a few of the items they are recommended. In a stylized model we introduce, objectives that account for this constraint induce diverse recommendations, while objectives that do not account for this constraint induce homogeneous recommendations. This suggests that accuracy and diversity appear misaligned because standard accuracy metrics do not consider consumption constraints. Our model yields precise and interpretable characterizations of diversity in different ",
    "path": "papers/23/07/2307.15142.json",
    "total_tokens": 822,
    "translated_title": "在推荐系统中权衡准确性和多样性的方法",
    "translated_abstract": "在推荐系统中，准确性（推荐用户最有可能想要的物品）和多样性（推荐代表不同类别的物品）之间存在明显的权衡。因此，在实际的推荐系统中，多样性常常被单独考虑，而不是与准确性一起考虑。然而，这种方法没有回答一个基本问题：为什么首先存在这种权衡？我们通过用户的消费约束解释了这种权衡，用户通常只会消费其中几个被推荐的物品。在我们引入的简化模型中，考虑了这种约束的目标可以产生多样的推荐结果，而不考虑这种约束的目标则产生同质的推荐结果。这表明准确性和多样性之间看起来不协调，是因为标准的准确性度量没有考虑消费约束。我们的模型对不同的多样性有精确且可解释的描述。",
    "tldr": "本论文解释了在推荐系统中准确性和多样性之间的权衡，通过考虑用户的消费约束，提出了一种能够产生多样推荐结果的模型。"
}