{
    "title": "How far is Language Model from 100% Few-shot Named Entity Recognition in Medical Domain. (arXiv:2307.00186v1 [cs.CL])",
    "abstract": "Recent advancements in language models (LMs) have led to the emergence of powerful models such as Small LMs (e.g., T5) and Large LMs (e.g., GPT-4). These models have demonstrated exceptional capabilities across a wide range of tasks, such as name entity recognition (NER) in the general domain. (We define SLMs as pre-trained models with fewer parameters compared to models like GPT-3/3.5/4, such as T5, BERT, and others.) Nevertheless, their efficacy in the medical section remains uncertain and the performance of medical NER always needs high accuracy because of the particularity of the field. This paper aims to provide a thorough investigation to compare the performance of LMs in medical few-shot NER and answer How far is LMs from 100\\% Few-shot NER in Medical Domain, and moreover to explore an effective entity recognizer to help improve the NER performance. Based on our extensive experiments conducted on 16 NER models spanning from 2018 to 2023, our findings clearly indicate that LLMs o",
    "link": "http://arxiv.org/abs/2307.00186",
    "context": "Title: How far is Language Model from 100% Few-shot Named Entity Recognition in Medical Domain. (arXiv:2307.00186v1 [cs.CL])\nAbstract: Recent advancements in language models (LMs) have led to the emergence of powerful models such as Small LMs (e.g., T5) and Large LMs (e.g., GPT-4). These models have demonstrated exceptional capabilities across a wide range of tasks, such as name entity recognition (NER) in the general domain. (We define SLMs as pre-trained models with fewer parameters compared to models like GPT-3/3.5/4, such as T5, BERT, and others.) Nevertheless, their efficacy in the medical section remains uncertain and the performance of medical NER always needs high accuracy because of the particularity of the field. This paper aims to provide a thorough investigation to compare the performance of LMs in medical few-shot NER and answer How far is LMs from 100\\% Few-shot NER in Medical Domain, and moreover to explore an effective entity recognizer to help improve the NER performance. Based on our extensive experiments conducted on 16 NER models spanning from 2018 to 2023, our findings clearly indicate that LLMs o",
    "path": "papers/23/07/2307.00186.json",
    "total_tokens": 883,
    "translated_title": "从语言模型到医学领域百分之百的少样本命名实体识别有多远",
    "translated_abstract": "最近语言模型的发展引发了强大模型的出现，如小型语言模型（如T5）和大型语言模型（如GPT-4）。这些模型在广泛的任务中表现出卓越的能力，如通用领域中的命名实体识别（NER）。然而，它们在医学领域的效果仍然不确定，由于该领域的特殊性，医学NER的性能总是需要高精度。本文旨在对医学少样本NER中的LMs的性能进行彻底调查，并回答从100％百分比中LMs与医学领域的少样本NER有多远的问题，同时探索一种有效的实体识别器以提高NER的性能。根据我们在2018年到2023年期间进行的广泛实验，我们的研究结果明确表明，LLMs o",
    "tldr": "本文对语言模型在医学领域少样本命名实体识别中的性能进行了调查研究，并探索了提高NER性能的有效实体识别器。",
    "en_tdlr": "This paper provides a thorough investigation of the performance of language models in few-shot named entity recognition (NER) in the medical domain and explores an effective entity recognizer to improve NER performance."
}