{
    "title": "Exploring the Bitcoin Mesoscale. (arXiv:2307.14409v1 [q-fin.ST])",
    "abstract": "The open availability of the entire history of the Bitcoin transactions opens up the possibility to study this system at an unprecedented level of detail. This contribution is devoted to the analysis of the mesoscale structural properties of the Bitcoin User Network (BUN), across its entire history (i.e. from 2009 to 2017). What emerges from our analysis is that the BUN is characterized by a core-periphery structure a deeper analysis of which reveals a certain degree of bow-tieness (i.e. the presence of a Strongly-Connected Component, an IN- and an OUT-component together with some tendrils attached to the IN-component). Interestingly, the evolution of the BUN structural organization experiences fluctuations that seem to be correlated with the presence of bubbles, i.e. periods of price surge and decline observed throughout the entire Bitcoin history: our results, thus, further confirm the interplay between structural quantities and price movements observed in previous analyses.",
    "link": "http://arxiv.org/abs/2307.14409",
    "context": "Title: Exploring the Bitcoin Mesoscale. (arXiv:2307.14409v1 [q-fin.ST])\nAbstract: The open availability of the entire history of the Bitcoin transactions opens up the possibility to study this system at an unprecedented level of detail. This contribution is devoted to the analysis of the mesoscale structural properties of the Bitcoin User Network (BUN), across its entire history (i.e. from 2009 to 2017). What emerges from our analysis is that the BUN is characterized by a core-periphery structure a deeper analysis of which reveals a certain degree of bow-tieness (i.e. the presence of a Strongly-Connected Component, an IN- and an OUT-component together with some tendrils attached to the IN-component). Interestingly, the evolution of the BUN structural organization experiences fluctuations that seem to be correlated with the presence of bubbles, i.e. periods of price surge and decline observed throughout the entire Bitcoin history: our results, thus, further confirm the interplay between structural quantities and price movements observed in previous analyses.",
    "path": "papers/23/07/2307.14409.json",
    "total_tokens": 918,
    "translated_title": "探索比特币的中小尺度结构",
    "translated_abstract": "比特币交易历史的开放可用性为以前所未有的细节水平研究该系统提供了可能性。本文致力于分析比特币用户网络（BUN）在其整个历史（即从2009年到2017年）中的中小尺度结构属性。从我们的分析中可以看出，BUN具有核心-外围结构，更深入的分析揭示了一定程度的蝴蝶结构（即具有强连通分量、IN分量和OUT分量以及一些附着在IN分量上的触须）。有趣的是，BUN结构组织的演化经历了与泡沫存在相关的波动，即在整个比特币历史上观察到的价格激增和下跌阶段：因此，我们的结果进一步证实了先前分析中观察到的结构量和价格变动之间的相互作用。",
    "tldr": "本文研究了比特币用户网络的中小尺度结构特性，并发现其具有核心-外围结构和蝴蝶结构。此外，我们的研究还发现，BUN结构组织的演化与泡沫存在相关的波动有关，进一步证实了结构量与价格变动之间的相互作用。",
    "en_tdlr": "This paper explores the mesoscale structural properties of the Bitcoin User Network (BUN) and finds that it exhibits a core-periphery structure and bow-tie structure. Additionally, the study reveals that the evolution of BUN's structural organization is correlated with fluctuations related to the presence of bubbles, further confirming the interplay between structural quantities and price movements."
}