{
    "title": "Adam Smith's Theory of Value: A Reappraisal of Classical Price Discovery. (arXiv:2307.00412v1 [econ.GN])",
    "abstract": "The relevance of Adam Smith for understanding human morality and sociality is recognized in the growing interest in his work on moral sentiments among scholars of various academic backgrounds. But, paradoxically, Adam Smith's theory of economic value enjoys a less prominent stature today among economists, who, while they view him as the 'father of modern economics', considered him more as having had the right intuitions about a market economy than as having developed the right concepts and the technical tools for studying it. Yet the neoclassical tradition, which replaced the classical school around 1870, failed to provide a satisfactory theory of market price formation. Adam Smith's sketch of market price formation (Ch. VII, Book I, Wealth of Nations), and more generally the classical view of competition as a collective higgling and bargaining process, as this paper argues, offers a helpful foundation on which to build a modern theory of market price formation, despite any shortcoming",
    "link": "http://arxiv.org/abs/2307.00412",
    "context": "Title: Adam Smith's Theory of Value: A Reappraisal of Classical Price Discovery. (arXiv:2307.00412v1 [econ.GN])\nAbstract: The relevance of Adam Smith for understanding human morality and sociality is recognized in the growing interest in his work on moral sentiments among scholars of various academic backgrounds. But, paradoxically, Adam Smith's theory of economic value enjoys a less prominent stature today among economists, who, while they view him as the 'father of modern economics', considered him more as having had the right intuitions about a market economy than as having developed the right concepts and the technical tools for studying it. Yet the neoclassical tradition, which replaced the classical school around 1870, failed to provide a satisfactory theory of market price formation. Adam Smith's sketch of market price formation (Ch. VII, Book I, Wealth of Nations), and more generally the classical view of competition as a collective higgling and bargaining process, as this paper argues, offers a helpful foundation on which to build a modern theory of market price formation, despite any shortcoming",
    "path": "papers/23/07/2307.00412.json",
    "total_tokens": 722,
    "translated_title": "亚当·斯密的价值理论：对古典价格发现的重新评估",
    "translated_abstract": "亚当·斯密在理解人类道德和社会性方面的相关性在各个学科背景的学者中得到了承认，而在经济学家中，亚当·斯密的经济价值理论的重要性却不如前。然而，本文认为，亚当·斯密关于市场价格形成的概述以及更一般来说，古典学派将竞争视为一个集体讨价还价的过程，为构建现代市场价格形成理论提供了有益的基础。",
    "tldr": "本文重新评估了亚当·斯密的价值理论，认为其对于现代市场价格形成理论的建设提供了有益的基础。",
    "en_tdlr": "This paper reappraises Adam Smith's theory of value and argues that it provides a helpful foundation for the modern theory of market price formation."
}