{
    "title": "Exploiting Field Dependencies for Learning on Categorical Data. (arXiv:2307.09321v1 [cs.LG])",
    "abstract": "Traditional approaches for learning on categorical data underexploit the dependencies between columns (\\aka fields) in a dataset because they rely on the embedding of data points driven alone by the classification/regression loss. In contrast, we propose a novel method for learning on categorical data with the goal of exploiting dependencies between fields. Instead of modelling statistics of features globally (i.e., by the covariance matrix of features), we learn a global field dependency matrix that captures dependencies between fields and then we refine the global field dependency matrix at the instance-wise level with different weights (so-called local dependency modelling) w.r.t. each field to improve the modelling of the field dependencies. Our algorithm exploits the meta-learning paradigm, i.e., the dependency matrices are refined in the inner loop of the meta-learning algorithm without the use of labels, whereas the outer loop intertwines the updates of the embedding matrix (the",
    "link": "http://arxiv.org/abs/2307.09321",
    "context": "Title: Exploiting Field Dependencies for Learning on Categorical Data. (arXiv:2307.09321v1 [cs.LG])\nAbstract: Traditional approaches for learning on categorical data underexploit the dependencies between columns (\\aka fields) in a dataset because they rely on the embedding of data points driven alone by the classification/regression loss. In contrast, we propose a novel method for learning on categorical data with the goal of exploiting dependencies between fields. Instead of modelling statistics of features globally (i.e., by the covariance matrix of features), we learn a global field dependency matrix that captures dependencies between fields and then we refine the global field dependency matrix at the instance-wise level with different weights (so-called local dependency modelling) w.r.t. each field to improve the modelling of the field dependencies. Our algorithm exploits the meta-learning paradigm, i.e., the dependency matrices are refined in the inner loop of the meta-learning algorithm without the use of labels, whereas the outer loop intertwines the updates of the embedding matrix (the",
    "path": "papers/23/07/2307.09321.json",
    "total_tokens": 883,
    "translated_title": "利用字段依赖性进行分类数据的学习",
    "translated_abstract": "传统的分类数据学习方法往往忽视了数据集中字段（也称为特征）之间的依赖关系，因为它们仅依赖于数据点嵌入的分类/回归损失。相比之下，我们提出了一种新的分类数据学习方法，旨在利用字段之间的依赖关系。我们不是全局建模特征的统计信息（如特征的协方差矩阵），而是学习一个捕捉字段之间依赖关系的全局字段依赖矩阵，并利用不同权重（称为局部依赖建模）在实例级别上改进全局字段依赖矩阵的建模。我们的算法利用元学习范式，即在元学习算法的内部循环中无需使用标签就可以细化依赖矩阵，而外部循环则交织了嵌入矩阵和依赖矩阵的更新。",
    "tldr": "传统的分类数据学习方法忽视了字段间的依赖关系，我们提出了一种利用字段依赖关系进行学习的方法，通过学习全局字段依赖矩阵并在实例级别上细化依赖矩阵，改进了字段之间的建模效果。"
}