{
    "title": "You Shall not Pass: the Zero-Gradient Problem in Predict and Optimize for Convex Optimization. (arXiv:2307.16304v1 [cs.LG])",
    "abstract": "Predict and optimize is an increasingly popular decision-making paradigm that employs machine learning to predict unknown parameters of optimization problems. Instead of minimizing the prediction error of the parameters, it trains predictive models using task performance as a loss function. In the convex optimization domain, predict and optimize has seen significant progress due to recently developed methods for differentiating optimization problem solutions over the problem parameters. This paper identifies a yet unnoticed drawback of this approach -- the zero-gradient problem -- and introduces a method to solve it. The suggested method is based on the mathematical properties of differential optimization and is verified using two real-world benchmarks.",
    "link": "http://arxiv.org/abs/2307.16304",
    "context": "Title: You Shall not Pass: the Zero-Gradient Problem in Predict and Optimize for Convex Optimization. (arXiv:2307.16304v1 [cs.LG])\nAbstract: Predict and optimize is an increasingly popular decision-making paradigm that employs machine learning to predict unknown parameters of optimization problems. Instead of minimizing the prediction error of the parameters, it trains predictive models using task performance as a loss function. In the convex optimization domain, predict and optimize has seen significant progress due to recently developed methods for differentiating optimization problem solutions over the problem parameters. This paper identifies a yet unnoticed drawback of this approach -- the zero-gradient problem -- and introduces a method to solve it. The suggested method is based on the mathematical properties of differential optimization and is verified using two real-world benchmarks.",
    "path": "papers/23/07/2307.16304.json",
    "total_tokens": 726,
    "translated_title": "《你不得通过：凸优化中的零梯度问题》",
    "translated_abstract": "预测和优化是一种越来越受欢迎的决策模式，它利用机器学习来预测优化问题中的未知参数。与最小化参数预测误差不同，它使用任务性能作为损失函数来训练预测模型。在凸优化领域，预测和优化由于最近开发的方法能够对问题参数进行微分，取得了显著进展。本文发现了这种方法的一个迄今未被注意到的缺点——零梯度问题，并提出了一种解决方法。建议的方法基于微分优化的数学特性，并使用两个真实世界的基准进行验证。",
    "tldr": "这篇论文介绍了预测和优化中的一个问题——零梯度问题，并提出了解决方法。通过利用微分优化的数学特性和真实世界基准的验证，该方法解决了这个问题。",
    "en_tdlr": "This paper identifies and solves a problem - the zero-gradient problem - in the field of predict and optimize. It introduces a method based on the mathematical properties of differential optimization and verifies it using real-world benchmarks."
}