{
    "title": "Fluorescent Neuronal Cells v2: Multi-Task, Multi-Format Annotations for Deep Learning in Microscopy. (arXiv:2307.14243v1 [cs.CV])",
    "abstract": "Fluorescent Neuronal Cells v2 is a collection of fluorescence microscopy images and the corresponding ground-truth annotations, designed to foster innovative research in the domains of Life Sciences and Deep Learning. This dataset encompasses three image collections in which rodent neuronal cells' nuclei and cytoplasm are stained with diverse markers to highlight their anatomical or functional characteristics. Alongside the images, we provide ground-truth annotations for several learning tasks, including semantic segmentation, object detection, and counting. The contribution is two-fold. First, given the variety of annotations and their accessible formats, we envision our work facilitating methodological advancements in computer vision approaches for segmentation, detection, feature learning, unsupervised and self-supervised learning, transfer learning, and related areas. Second, by enabling extensive exploration and benchmarking, we hope Fluorescent Neuronal Cells v2 will catalyze bre",
    "link": "http://arxiv.org/abs/2307.14243",
    "context": "Title: Fluorescent Neuronal Cells v2: Multi-Task, Multi-Format Annotations for Deep Learning in Microscopy. (arXiv:2307.14243v1 [cs.CV])\nAbstract: Fluorescent Neuronal Cells v2 is a collection of fluorescence microscopy images and the corresponding ground-truth annotations, designed to foster innovative research in the domains of Life Sciences and Deep Learning. This dataset encompasses three image collections in which rodent neuronal cells' nuclei and cytoplasm are stained with diverse markers to highlight their anatomical or functional characteristics. Alongside the images, we provide ground-truth annotations for several learning tasks, including semantic segmentation, object detection, and counting. The contribution is two-fold. First, given the variety of annotations and their accessible formats, we envision our work facilitating methodological advancements in computer vision approaches for segmentation, detection, feature learning, unsupervised and self-supervised learning, transfer learning, and related areas. Second, by enabling extensive exploration and benchmarking, we hope Fluorescent Neuronal Cells v2 will catalyze bre",
    "path": "papers/23/07/2307.14243.json",
    "total_tokens": 917,
    "translated_title": "荧光神经细胞v2：深度学习显微镜中的多任务、多格式注释",
    "translated_abstract": "荧光神经细胞v2是一组荧光显微镜图像及其相应的真实注释，旨在促进生命科学和深度学习领域的创新研究。该数据集涵盖了三个图像收集，其中啮齿类神经细胞的细胞核和细胞质使用不同的标记染色以突出其解剖或功能特征。除图像外，我们还提供了多个学习任务的真实注释，包括语义分割、目标检测和计数。该研究成果有两个方面的贡献。首先，鉴于注释的多样性和其可访问的格式，我们希望我们的工作有助于计算机视觉方法在分割、检测、特征学习、无监督和自监督学习、迁移学习和相关领域的方法论进展。其次，通过促进广泛探索和评估，我们希望荧光神经细胞v2能够催化研究领域的发展。",
    "tldr": "荧光神经细胞v2是一组荧光显微镜图像及其真实注释，提供了多个学习任务的注释，并有助于计算机视觉方法的进展。",
    "en_tdlr": "Fluorescent Neuronal Cells v2 is a collection of fluorescence microscopy images and corresponding annotations that support multiple learning tasks and advancements in computer vision methods."
}