{
    "title": "BiRP: Learning Robot Generalized Bimanual Coordination using Relative Parameterization Method on Human Demonstration. (arXiv:2307.05933v1 [cs.RO])",
    "abstract": "Human bimanual manipulation can perform more complex tasks than a simple combination of two single arms, which is credited to the spatio-temporal coordination between the arms. However, the description of bimanual coordination is still an open topic in robotics. This makes it difficult to give an explainable coordination paradigm, let alone applied to robotics. In this work, we divide the main bimanual tasks in human daily activities into two types: leader-follower and synergistic coordination. Then we propose a relative parameterization method to learn these types of coordination from human demonstration. It represents coordination as Gaussian mixture models from bimanual demonstration to describe the change in the importance of coordination throughout the motions by probability. The learned coordinated representation can be generalized to new task parameters while ensuring spatio-temporal coordination. We demonstrate the method using synthetic motions and human demonstration data and",
    "link": "http://arxiv.org/abs/2307.05933",
    "context": "Title: BiRP: Learning Robot Generalized Bimanual Coordination using Relative Parameterization Method on Human Demonstration. (arXiv:2307.05933v1 [cs.RO])\nAbstract: Human bimanual manipulation can perform more complex tasks than a simple combination of two single arms, which is credited to the spatio-temporal coordination between the arms. However, the description of bimanual coordination is still an open topic in robotics. This makes it difficult to give an explainable coordination paradigm, let alone applied to robotics. In this work, we divide the main bimanual tasks in human daily activities into two types: leader-follower and synergistic coordination. Then we propose a relative parameterization method to learn these types of coordination from human demonstration. It represents coordination as Gaussian mixture models from bimanual demonstration to describe the change in the importance of coordination throughout the motions by probability. The learned coordinated representation can be generalized to new task parameters while ensuring spatio-temporal coordination. We demonstrate the method using synthetic motions and human demonstration data and",
    "path": "papers/23/07/2307.05933.json",
    "total_tokens": 911,
    "translated_title": "BiRP：使用相对参数化方法学习机器人广义双臂协调-基于人体演示",
    "translated_abstract": "人类的双臂操纵可以执行比简单组合两只单臂更复杂的任务，这要归功于双臂之间的时空协调。然而，双臂协调的描述仍然是机器人领域中的一个开放性问题。这使得很难提供一个可解释的协调范例，更不用说应用到机器人中了。在这项工作中，我们将人类日常活动中的主要双臂任务分为两种类型：领导者-追随者协调和协同协调。然后我们提出了一种相对参数化方法，通过从双臂演示中将协调表示为高斯混合模型，以概率描述协调在运动过程中的重要性变化。学习到的协调表示可以推广到新的任务参数，同时确保时空协调。我们使用合成动作和人体演示数据演示了这种方法。",
    "tldr": "本文提出了一种相对参数化方法，通过从人体演示中学习双臂协调，将双臂任务分为领导者-追随者协调和协同协调两种类型，并将协调表示为高斯混合模型以描述协调的重要性变化，从而实现了对新任务参数的广义协调。",
    "en_tdlr": "This paper proposes a relative parameterization method for learning bimanual coordination from human demonstration, dividing bimanual tasks into leader-follower and synergistic coordination, and representing coordination as Gaussian mixture models to describe the change in importance, thus achieving generalized coordination for new task parameters."
}