{
    "title": "Explaining Full-disk Deep Learning Model for Solar Flare Prediction using Attribution Methods. (arXiv:2307.15878v1 [cs.LG])",
    "abstract": "This paper contributes to the growing body of research on deep learning methods for solar flare prediction, primarily focusing on highly overlooked near-limb flares and utilizing the attribution methods to provide a post hoc qualitative explanation of the model's predictions. We present a solar flare prediction model, which is trained using hourly full-disk line-of-sight magnetogram images and employs a binary prediction mode to forecast $\\geq$M-class flares that may occur within the following 24-hour period. To address the class imbalance, we employ a fusion of data augmentation and class weighting techniques; and evaluate the overall performance of our model using the true skill statistic (TSS) and Heidke skill score (HSS). Moreover, we applied three attribution methods, namely Guided Gradient-weighted Class Activation Mapping, Integrated Gradients, and Deep Shapley Additive Explanations, to interpret and cross-validate our model's predictions with the explanations. Our analysis reve",
    "link": "http://arxiv.org/abs/2307.15878",
    "context": "Title: Explaining Full-disk Deep Learning Model for Solar Flare Prediction using Attribution Methods. (arXiv:2307.15878v1 [cs.LG])\nAbstract: This paper contributes to the growing body of research on deep learning methods for solar flare prediction, primarily focusing on highly overlooked near-limb flares and utilizing the attribution methods to provide a post hoc qualitative explanation of the model's predictions. We present a solar flare prediction model, which is trained using hourly full-disk line-of-sight magnetogram images and employs a binary prediction mode to forecast $\\geq$M-class flares that may occur within the following 24-hour period. To address the class imbalance, we employ a fusion of data augmentation and class weighting techniques; and evaluate the overall performance of our model using the true skill statistic (TSS) and Heidke skill score (HSS). Moreover, we applied three attribution methods, namely Guided Gradient-weighted Class Activation Mapping, Integrated Gradients, and Deep Shapley Additive Explanations, to interpret and cross-validate our model's predictions with the explanations. Our analysis reve",
    "path": "papers/23/07/2307.15878.json",
    "total_tokens": 960,
    "translated_title": "使用归因方法解释全盘深度学习模型在太阳耀斑预测中的应用",
    "translated_abstract": "本文对于太阳耀斑预测的深度学习方法进行了研究，主要关注被忽视的近边耀斑，并利用归因方法对模型预测结果进行了后期定性解释。我们提出了一个太阳耀斑预测模型，使用每小时的全盘线磁图像进行训练，并采用二进制预测模式来预测在接下来的24小时内可能发生的大于等于M级耀斑。为了解决类别不平衡问题，我们采用了数据增强和类别加权技术的融合，并使用真实技能统计量（TSS）和海德克技能得分（HSS）来评估模型的整体性能。此外，我们还应用了三种归因方法，分别是引导梯度加权类激活映射、综合梯度和深层Shapley可加解释，对模型的预测结果进行了解释和交叉验证。我们的分析揭示了...",
    "tldr": "本文研究了太阳耀斑预测的深度学习方法，并使用归因方法解释模型的预测结果。通过使用全盘线磁图像和类别加权技术，我们提出了一个预测模型，并评估了其性能。我们还应用了三种归因方法对模型的预测结果进行解释和验证。"
}