{
    "title": "KoBBQ: Korean Bias Benchmark for Question Answering. (arXiv:2307.16778v2 [cs.CL] UPDATED)",
    "abstract": "The Bias Benchmark for Question Answering (BBQ) is designed to evaluate social biases of language models (LMs), but it is not simple to adapt this benchmark to cultural contexts other than the US because social biases depend heavily on the cultural context. In this paper, we present KoBBQ, a Korean bias benchmark dataset, and we propose a general framework that addresses considerations for cultural adaptation of a dataset. Our framework includes partitioning the BBQ dataset into three classes--Simply-Transferred (can be used directly after cultural translation), Target-Modified (requires localization in target groups), and Sample-Removed (does not fit Korean culture)-- and adding four new categories of bias specific to Korean culture. We conduct a large-scale survey to collect and validate the social biases and the targets of the biases that reflect the stereotypes in Korean culture. The resulting KoBBQ dataset comprises 268 templates and 76,048 samples across 12 categories of social b",
    "link": "http://arxiv.org/abs/2307.16778",
    "context": "Title: KoBBQ: Korean Bias Benchmark for Question Answering. (arXiv:2307.16778v2 [cs.CL] UPDATED)\nAbstract: The Bias Benchmark for Question Answering (BBQ) is designed to evaluate social biases of language models (LMs), but it is not simple to adapt this benchmark to cultural contexts other than the US because social biases depend heavily on the cultural context. In this paper, we present KoBBQ, a Korean bias benchmark dataset, and we propose a general framework that addresses considerations for cultural adaptation of a dataset. Our framework includes partitioning the BBQ dataset into three classes--Simply-Transferred (can be used directly after cultural translation), Target-Modified (requires localization in target groups), and Sample-Removed (does not fit Korean culture)-- and adding four new categories of bias specific to Korean culture. We conduct a large-scale survey to collect and validate the social biases and the targets of the biases that reflect the stereotypes in Korean culture. The resulting KoBBQ dataset comprises 268 templates and 76,048 samples across 12 categories of social b",
    "path": "papers/23/07/2307.16778.json",
    "total_tokens": 922,
    "translated_title": "KoBBQ: 针对问答的韩国偏见基准",
    "translated_abstract": "偏见问答的基准（BBQ）旨在评估语言模型（LMs）的社会偏见，但是将此基准适应于美国以外的文化背景并不简单，因为社会偏见在很大程度上取决于文化背景。本文介绍了KoBBQ，一个韩国偏见基准数据集，并提出了一个通用框架来解决数据集的文化适应性问题。我们的框架将BBQ数据集分为三类——简单转换（可以在文化翻译后直接使用）、目标修改（需要在目标群体中进行本地化）和样本删除（不适合韩国文化），并添加了四个针对韩国文化特定的偏见类别。我们进行了大规模调查，收集和验证了反映韩国文化刻板印象的社会偏见和偏见目标。最终的KoBBQ数据集包含了268个模板和76,048个样本，涵盖了12个社会分类。",
    "tldr": "本文介绍了KoBBQ，一个针对韩国文化的偏见基准数据集，提出了一个通用框架来解决数据集的文化适应性问题，并通过大规模调查收集和验证了反映韩国文化刻板印象的社会偏见和偏见目标。",
    "en_tdlr": "This paper presents KoBBQ, a bias benchmark dataset for Korean culture, proposes a general framework to address the cultural adaptation of datasets, and collects and validates social biases and bias targets reflecting stereotypes in Korean culture through a large-scale survey."
}