{
    "title": "Policy Gradient Optimal Correlation Search for Variance Reduction in Monte Carlo simulation and Maximum Optimal Transport. (arXiv:2307.12703v1 [stat.ML])",
    "abstract": "We propose a new algorithm for variance reduction when estimating $f(X_T)$ where $X$ is the solution to some stochastic differential equation and $f$ is a test function. The new estimator is $(f(X^1_T) + f(X^2_T))/2$, where $X^1$ and $X^2$ have same marginal law as $X$ but are pathwise correlated so that to reduce the variance. The optimal correlation function $\\rho$ is approximated by a deep neural network and is calibrated along the trajectories of $(X^1, X^2)$ by policy gradient and reinforcement learning techniques. Finding an optimal coupling given marginal laws has links with maximum optimal transport.",
    "link": "http://arxiv.org/abs/2307.12703",
    "context": "Title: Policy Gradient Optimal Correlation Search for Variance Reduction in Monte Carlo simulation and Maximum Optimal Transport. (arXiv:2307.12703v1 [stat.ML])\nAbstract: We propose a new algorithm for variance reduction when estimating $f(X_T)$ where $X$ is the solution to some stochastic differential equation and $f$ is a test function. The new estimator is $(f(X^1_T) + f(X^2_T))/2$, where $X^1$ and $X^2$ have same marginal law as $X$ but are pathwise correlated so that to reduce the variance. The optimal correlation function $\\rho$ is approximated by a deep neural network and is calibrated along the trajectories of $(X^1, X^2)$ by policy gradient and reinforcement learning techniques. Finding an optimal coupling given marginal laws has links with maximum optimal transport.",
    "path": "papers/23/07/2307.12703.json",
    "total_tokens": 836,
    "translated_title": "政策梯度最优相关搜索用于蒙特卡洛模拟和最大最优传输中的方差降低",
    "translated_abstract": "我们提出了一种用于估计$f(X_T)$的方差降低算法，其中$X$是某个随机微分方程的解，$f$是一个测试函数。新的估计器是$(f(X^1_T) + f(X^2_T))/2$，其中$X^1$和$X^2$具有与$X$相同的边际分布，但路径上存在相关性，以降低方差。最优相关函数$\\rho$由深度神经网络近似，并通过政策梯度和强化学习技术在$(X^1, X^2)$的轨迹上进行校准。在给定边际分布的情况下找到最优耦合与最大最优传输有关联。",
    "tldr": "该论文提出了一种新的算法，通过引入相关路径来降低蒙特卡洛模拟中的方差，从而估计随机微分方程解的函数。通过政策梯度和强化学习技术，使用深度神经网络近似最优相关函数并进行校准。这与最大最优传输问题有关。",
    "en_tdlr": "This paper proposes a new algorithm for variance reduction in estimating the function of a stochastic differential equation solution by introducing correlated paths in Monte Carlo simulation. The optimal correlation function is approximated using a deep neural network and calibrated using policy gradient and reinforcement learning techniques. It is related to the problem of maximum optimal transport."
}