{
    "title": "A CNN regression model to estimate buildings height maps using Sentinel-1 SAR and Sentinel-2 MSI time series. (arXiv:2307.01378v1 [cs.CV])",
    "abstract": "Accurate estimation of building heights is essential for urban planning, infrastructure management, and environmental analysis. In this study, we propose a supervised Multimodal Building Height Regression Network (MBHR-Net) for estimating building heights at 10m spatial resolution using Sentinel-1 (S1) and Sentinel-2 (S2) satellite time series. S1 provides Synthetic Aperture Radar (SAR) data that offers valuable information on building structures, while S2 provides multispectral data that is sensitive to different land cover types, vegetation phenology, and building shadows. Our MBHR-Net aims to extract meaningful features from the S1 and S2 images to learn complex spatio-temporal relationships between image patterns and building heights. The model is trained and tested in 10 cities in the Netherlands. Root Mean Squared Error (RMSE), Intersection over Union (IOU), and R-squared (R2) score metrics are used to evaluate the performance of the model. The preliminary results (3.73m RMSE, 0.",
    "link": "http://arxiv.org/abs/2307.01378",
    "context": "Title: A CNN regression model to estimate buildings height maps using Sentinel-1 SAR and Sentinel-2 MSI time series. (arXiv:2307.01378v1 [cs.CV])\nAbstract: Accurate estimation of building heights is essential for urban planning, infrastructure management, and environmental analysis. In this study, we propose a supervised Multimodal Building Height Regression Network (MBHR-Net) for estimating building heights at 10m spatial resolution using Sentinel-1 (S1) and Sentinel-2 (S2) satellite time series. S1 provides Synthetic Aperture Radar (SAR) data that offers valuable information on building structures, while S2 provides multispectral data that is sensitive to different land cover types, vegetation phenology, and building shadows. Our MBHR-Net aims to extract meaningful features from the S1 and S2 images to learn complex spatio-temporal relationships between image patterns and building heights. The model is trained and tested in 10 cities in the Netherlands. Root Mean Squared Error (RMSE), Intersection over Union (IOU), and R-squared (R2) score metrics are used to evaluate the performance of the model. The preliminary results (3.73m RMSE, 0.",
    "path": "papers/23/07/2307.01378.json",
    "total_tokens": 904,
    "translated_title": "使用Sentinel-1 SAR和Sentinel-2 MSI时间序列的CNN回归模型估计建筑物高度图",
    "translated_abstract": "准确估计建筑物高度对于城市规划、基础设施管理和环境分析至关重要。在本研究中，我们提出了一种监督式多模态建筑物高度回归网络（MBHR-Net），用于使用Sentinel-1（S1）和Sentinel-2（S2）卫星时间序列估计10m空间分辨率的建筑物高度。S1提供合成孔径雷达（SAR）数据，对建筑结构提供了有价值的信息，而S2提供了对不同土地覆盖类型、植被季节性和建筑阴影敏感的多光谱数据。我们的MBHR-Net旨在从S1和S2图像中提取有意义的特征，学习图像模式与建筑物高度之间的复杂时空关系。该模型在荷兰的10个城市进行训练和测试。采用均方根误差（RMSE）、交并比（IOU）和R平方（R2）分数指标评估模型的性能。初步结果显示（3.73m RMSE, 0.）",
    "tldr": "本研究提出了一种使用Sentinel-1 SAR和Sentinel-2 MSI时间序列的CNN回归模型，能够准确估计建筑物的高度，并在荷兰的10个城市进行了测试。"
}