{
    "title": "Perturbing a Neural Network to Infer Effective Connectivity: Evidence from Synthetic EEG Data. (arXiv:2307.09770v1 [eess.SP])",
    "abstract": "Identifying causal relationships among distinct brain areas, known as effective connectivity, holds key insights into the brain's information processing and cognitive functions. Electroencephalogram (EEG) signals exhibit intricate dynamics and inter-areal interactions within the brain. However, methods for characterizing nonlinear causal interactions among multiple brain regions remain relatively underdeveloped. In this study, we proposed a data-driven framework to infer effective connectivity by perturbing the trained neural networks. Specifically, we trained neural networks (i.e., CNN, vanilla RNN, GRU, LSTM, and Transformer) to predict future EEG signals according to historical data and perturbed the networks' input to obtain effective connectivity (EC) between the perturbed EEG channel and the rest of the channels. The EC reflects the causal impact of perturbing one node on others. The performance was tested on the synthetic EEG generated by a biological-plausible Jansen-Rit model.",
    "link": "http://arxiv.org/abs/2307.09770",
    "context": "Title: Perturbing a Neural Network to Infer Effective Connectivity: Evidence from Synthetic EEG Data. (arXiv:2307.09770v1 [eess.SP])\nAbstract: Identifying causal relationships among distinct brain areas, known as effective connectivity, holds key insights into the brain's information processing and cognitive functions. Electroencephalogram (EEG) signals exhibit intricate dynamics and inter-areal interactions within the brain. However, methods for characterizing nonlinear causal interactions among multiple brain regions remain relatively underdeveloped. In this study, we proposed a data-driven framework to infer effective connectivity by perturbing the trained neural networks. Specifically, we trained neural networks (i.e., CNN, vanilla RNN, GRU, LSTM, and Transformer) to predict future EEG signals according to historical data and perturbed the networks' input to obtain effective connectivity (EC) between the perturbed EEG channel and the rest of the channels. The EC reflects the causal impact of perturbing one node on others. The performance was tested on the synthetic EEG generated by a biological-plausible Jansen-Rit model.",
    "path": "papers/23/07/2307.09770.json",
    "total_tokens": 966,
    "translated_title": "通过扰动神经网络推断有效连接性：来自合成脑电数据的证据",
    "translated_abstract": "识别大脑不同区域之间的因果关系，即有效连接性，对于了解大脑的信息处理和认知功能具有重要洞见。脑电图（EEG）信号显示出脑内复杂的动力学和区域间相互作用。然而，对于表征多个脑区之间非线性因果关系的方法仍相对不够发展。在本研究中，我们提出了一个数据驱动的框架，通过扰动经过训练的神经网络来推断有效连接性。具体而言，我们训练了神经网络（如CNN、vanilla RNN、GRU、LSTM和Transformer），根据历史数据预测未来的EEG信号，然后扰动网络的输入以获取扰动的EEG通道与其他通道之间的有效连接性（EC）。EC反映了扰动一个节点对其他节点的因果影响。性能测试是在由生物合理的Jansen-Rit模型生成的合成EEG上进行的。",
    "tldr": "该研究提出了一种通过扰动神经网络推断脑内有效连接性的方法。研究使用数据驱动的框架，在经过训练的神经网络中，通过扰动输入信号来计算扰动之后对其他脑区的因果影响，从而揭示了脑区之间的非线性因果关系。测试结果在合成的脑电数据上表现出良好的性能。",
    "en_tdlr": "This study proposes a method to infer effective connectivity within the brain by perturbing neural networks. Using a data-driven framework, the study perturbs input signals in trained neural networks to calculate the causal effects on other brain regions, revealing nonlinear causal relationships. Performance tests on synthetic EEG data show promising results."
}