{
    "title": "Cascaded Cross-Modal Transformer for Request and Complaint Detection. (arXiv:2307.15097v1 [cs.CL])",
    "abstract": "We propose a novel cascaded cross-modal transformer (CCMT) that combines speech and text transcripts to detect customer requests and complaints in phone conversations. Our approach leverages a multimodal paradigm by transcribing the speech using automatic speech recognition (ASR) models and translating the transcripts into different languages. Subsequently, we combine language-specific BERT-based models with Wav2Vec2.0 audio features in a novel cascaded cross-attention transformer model. We apply our system to the Requests Sub-Challenge of the ACM Multimedia 2023 Computational Paralinguistics Challenge, reaching unweighted average recalls (UAR) of 65.41% and 85.87% for the complaint and request classes, respectively.",
    "link": "http://arxiv.org/abs/2307.15097",
    "context": "Title: Cascaded Cross-Modal Transformer for Request and Complaint Detection. (arXiv:2307.15097v1 [cs.CL])\nAbstract: We propose a novel cascaded cross-modal transformer (CCMT) that combines speech and text transcripts to detect customer requests and complaints in phone conversations. Our approach leverages a multimodal paradigm by transcribing the speech using automatic speech recognition (ASR) models and translating the transcripts into different languages. Subsequently, we combine language-specific BERT-based models with Wav2Vec2.0 audio features in a novel cascaded cross-attention transformer model. We apply our system to the Requests Sub-Challenge of the ACM Multimedia 2023 Computational Paralinguistics Challenge, reaching unweighted average recalls (UAR) of 65.41% and 85.87% for the complaint and request classes, respectively.",
    "path": "papers/23/07/2307.15097.json",
    "total_tokens": 836,
    "translated_title": "级联跨模态Transformer用于请求和投诉检测",
    "translated_abstract": "我们提出了一种新颖的级联跨模态Transformer（CCMT），将语音和文本转录结合起来，以检测电话对话中的客户请求和投诉。我们的方法通过使用自动语音识别（ASR）模型转录语音，并将转录件翻译成不同语言来利用多模态范式。随后，我们将语言特定的基于BERT的模型与Wav2Vec2.0音频特征在一个新颖的级联交叉注意力Transformer模型中相结合。我们将我们的系统应用于ACM Multimedia 2023计算语言学挑战赛的请求子挑战中，在投诉和请求类别中分别达到了65.41%和85.87%的不平衡平均召回率（UAR）。",
    "tldr": "本文提出了一种级联跨模态Transformer模型，结合语音和文本转录，用于检测电话对话中的客户请求和投诉。在ACM Multimedia 2023计算语言学挑战赛的请求子挑战中，我们的系统在投诉和请求类别中达到了65.41%和85.87%的不平衡平均召回率。",
    "en_tdlr": "This paper proposes a cascaded cross-modal Transformer model that combines speech and text transcripts to detect customer requests and complaints in phone conversations. The system achieves unweighted average recalls (UAR) of 65.41% and 85.87% for the complaint and request classes, respectively, in the Requests Sub-Challenge of the ACM Multimedia 2023 Computational Paralinguistics Challenge."
}