{
    "title": "Words That Stick: Predicting Decision Making and Synonym Engagement Using Cognitive Biases and Computational Linguistics. (arXiv:2307.14511v1 [cs.HC])",
    "abstract": "This research draws upon cognitive psychology and information systems studies to anticipate user engagement and decision-making on digital platforms. By employing natural language processing (NLP) techniques and insights from cognitive bias research, we delve into user interactions with synonyms within digital content. Our methodology synthesizes four cognitive biasesRepresentativeness, Ease-of-use, Affect, and Distributioninto the READ model. Through a comprehensive user survey, we assess the model's ability to predict user engagement, discovering that synonyms that accurately represent core ideas, are easy to understand, elicit emotional responses, and are commonly encountered, promote greater user engagement. Crucially, our work offers a fresh lens on human-computer interaction, digital behaviors, and decision-making processes. Our results highlight the promise of cognitive biases as potent indicators of user engagement, underscoring their significance in designing effective digital",
    "link": "http://arxiv.org/abs/2307.14511",
    "context": "Title: Words That Stick: Predicting Decision Making and Synonym Engagement Using Cognitive Biases and Computational Linguistics. (arXiv:2307.14511v1 [cs.HC])\nAbstract: This research draws upon cognitive psychology and information systems studies to anticipate user engagement and decision-making on digital platforms. By employing natural language processing (NLP) techniques and insights from cognitive bias research, we delve into user interactions with synonyms within digital content. Our methodology synthesizes four cognitive biasesRepresentativeness, Ease-of-use, Affect, and Distributioninto the READ model. Through a comprehensive user survey, we assess the model's ability to predict user engagement, discovering that synonyms that accurately represent core ideas, are easy to understand, elicit emotional responses, and are commonly encountered, promote greater user engagement. Crucially, our work offers a fresh lens on human-computer interaction, digital behaviors, and decision-making processes. Our results highlight the promise of cognitive biases as potent indicators of user engagement, underscoring their significance in designing effective digital",
    "path": "papers/23/07/2307.14511.json",
    "total_tokens": 917,
    "translated_title": "词语的留存：使用认知偏差和计算语言学预测决策和同义词吸引力。",
    "translated_abstract": "这项研究借鉴了认知心理学和信息系统研究的成果，旨在预测数字平台上的用户参与和决策过程。通过运用自然语言处理技术和认知偏差研究的见解，我们深入探讨了用户与数字内容中的同义词的交互。我们的方法将代表性、易用性、情感和分布这四种认知偏差融合到了READ模型中。通过进行综合性的用户调查，我们评估了该模型预测用户参与的能力，发现准确代表核心思想、易于理解、能够引发情感反应并且常见的同义词能够促进更高的用户参与度。至关重要的是，我们的工作为人机交互、数字行为和决策过程提供了全新的视角。我们的结果突显了认知偏差作为用户参与度的有力指标的潜力，凸显了它们在设计有效的数字平台中的重要性。",
    "tldr": "这项研究使用认知偏差和计算语言学预测用户参与度和决策过程，发现准确代表核心思想、易于理解、能够引发情感反应并且常见的同义词能够促进更高的用户参与度。",
    "en_tdlr": "This research predicts user engagement and decision-making processes using cognitive biases and computational linguistics. It finds that synonyms accurately representing core ideas, being easy to understand, eliciting emotional responses, and being commonly encountered promote greater user engagement."
}