{
    "title": "RCDN -- Robust X-Corner Detection Algorithm based on Advanced CNN Model. (arXiv:2307.03505v1 [cs.CV])",
    "abstract": "Accurate detection and localization of X-corner on both planar and non-planar patterns is a core step in robotics and machine vision. However, previous works could not make a good balance between accuracy and robustness, which are both crucial criteria to evaluate the detectors performance. To address this problem, in this paper we present a novel detection algorithm which can maintain high sub-pixel precision on inputs under multiple interference, such as lens distortion, extreme poses and noise. The whole algorithm, adopting a coarse-to-fine strategy, contains a X-corner detection network and three post-processing techniques to distinguish the correct corner candidates, as well as a mixed sub-pixel refinement technique and an improved region growth strategy to recover the checkerboard pattern partially visible or occluded automatically. Evaluations on real and synthetic images indicate that the presented algorithm has the higher detection rate, sub-pixel accuracy and robustness than ",
    "link": "http://arxiv.org/abs/2307.03505",
    "context": "Title: RCDN -- Robust X-Corner Detection Algorithm based on Advanced CNN Model. (arXiv:2307.03505v1 [cs.CV])\nAbstract: Accurate detection and localization of X-corner on both planar and non-planar patterns is a core step in robotics and machine vision. However, previous works could not make a good balance between accuracy and robustness, which are both crucial criteria to evaluate the detectors performance. To address this problem, in this paper we present a novel detection algorithm which can maintain high sub-pixel precision on inputs under multiple interference, such as lens distortion, extreme poses and noise. The whole algorithm, adopting a coarse-to-fine strategy, contains a X-corner detection network and three post-processing techniques to distinguish the correct corner candidates, as well as a mixed sub-pixel refinement technique and an improved region growth strategy to recover the checkerboard pattern partially visible or occluded automatically. Evaluations on real and synthetic images indicate that the presented algorithm has the higher detection rate, sub-pixel accuracy and robustness than ",
    "path": "papers/23/07/2307.03505.json",
    "total_tokens": 920,
    "translated_title": "RCDN -- 基于先进CNN模型的鲁棒X角点检测算法",
    "translated_abstract": "准确检测和定位平面和非平面模式上的X角点是机器人和机器视觉中的核心步骤。然而，先前的工作在准确性和鲁棒性之间无法达到良好的平衡，这两个标准都是评估检测器性能的关键要素。为了解决这个问题，本文提出了一种新颖的检测算法，可以在多种干扰下保持对输入的高亚像素精度，例如镜头畸变、极端姿态和噪声。整个算法采用从粗到细的策略，包括X角点检测网络和三个后处理技术来区分正确的角点候选，以及混合亚像素细化技术和改进的区域增长策略来自动恢复部分可见或遮挡的棋盘格纹样。对真实和合成图像的评估结果表明，所提出的算法具有比先前方法更高的检测率、亚像素精度和鲁棒性。",
    "tldr": "本研究提出了一种新颖的鲁棒X角点检测算法，能够在多种干扰下保持高亚像素精度，并采用了粗到细的策略和多种后处理技术来提高检测性能和准确度。",
    "en_tdlr": "This paper presents a novel robust X-corner detection algorithm that maintains high sub-pixel precision under multiple interferences, and adopts a coarse-to-fine strategy and various post-processing techniques to enhance detection performance and accuracy."
}