{
    "title": "Exploring Linguistic Style Matching in Online Communities: The Role of Social Context and Conversation Dynamics. (arXiv:2307.02758v1 [cs.CL])",
    "abstract": "Linguistic style matching (LSM) in conversations can be reflective of several aspects of social influence such as power or persuasion. However, how LSM relates to the outcomes of online communication on platforms such as Reddit is an unknown question. In this study, we analyze a large corpus of two-party conversation threads in Reddit where we identify all occurrences of LSM using two types of style: the use of function words and formality. Using this framework, we examine how levels of LSM differ in conversations depending on several social factors within Reddit: post and subreddit features, conversation depth, user tenure, and the controversiality of a comment. Finally, we measure the change of LSM following loss of status after community banning. Our findings reveal the interplay of LSM in Reddit conversations with several community metrics, suggesting the importance of understanding conversation engagement when understanding community dynamics.",
    "link": "http://arxiv.org/abs/2307.02758",
    "context": "Title: Exploring Linguistic Style Matching in Online Communities: The Role of Social Context and Conversation Dynamics. (arXiv:2307.02758v1 [cs.CL])\nAbstract: Linguistic style matching (LSM) in conversations can be reflective of several aspects of social influence such as power or persuasion. However, how LSM relates to the outcomes of online communication on platforms such as Reddit is an unknown question. In this study, we analyze a large corpus of two-party conversation threads in Reddit where we identify all occurrences of LSM using two types of style: the use of function words and formality. Using this framework, we examine how levels of LSM differ in conversations depending on several social factors within Reddit: post and subreddit features, conversation depth, user tenure, and the controversiality of a comment. Finally, we measure the change of LSM following loss of status after community banning. Our findings reveal the interplay of LSM in Reddit conversations with several community metrics, suggesting the importance of understanding conversation engagement when understanding community dynamics.",
    "path": "papers/23/07/2307.02758.json",
    "total_tokens": 832,
    "translated_title": "在在线社区中探索语言风格匹配：社会背景和对话动态的作用",
    "translated_abstract": "在对话中的语言风格匹配可以反映出社会影响的多个方面，如权力或说服力。然而，在类似Reddit等平台上，LSM与在线沟通结果的关系尚不清楚。在这项研究中，我们分析了Reddit中两方对话主题的大量语料库，并使用两种类型的风格：功能词的使用和形式化。使用这个框架，我们研究了不同社交因素在Reddit对话中LSM水平的差异：帖子和子社区特征、对话深度、用户资历和评论的争议性。最后，我们测量了社区禁令后失去地位后LSM的变化。我们的发现揭示了LSM在Reddit对话中与几个社区指标的相互作用，暗示了在了解社区动态时理解对话参与的重要性。",
    "tldr": "本研究在Reddit上分析了两方对话主题的大量语料库，研究了LSM在对话中的差异以及与社区指标的关系，揭示了理解社区动态时对话参与的重要性。",
    "en_tdlr": "This study analyzed a large corpus of two-party conversation threads in Reddit, investigating the differences in LSM and its relation to community metrics, highlighting the importance of understanding conversation engagement in community dynamics."
}