{
    "title": "Filling time-series gaps using image techniques: Multidimensional context autoencoder approach for building energy data imputation. (arXiv:2307.05926v1 [cs.LG])",
    "abstract": "Building energy prediction and management has become increasingly important in recent decades, driven by the growth of Internet of Things (IoT) devices and the availability of more energy data. However, energy data is often collected from multiple sources and can be incomplete or inconsistent, which can hinder accurate predictions and management of energy systems and limit the usefulness of the data for decision-making and research. To address this issue, past studies have focused on imputing missing gaps in energy data, including random and continuous gaps. One of the main challenges in this area is the lack of validation on a benchmark dataset with various building and meter types, making it difficult to accurately evaluate the performance of different imputation methods. Another challenge is the lack of application of state-of-the-art imputation methods for missing gaps in energy data. Contemporary image-inpainting methods, such as Partial Convolution (PConv), have been widely used ",
    "link": "http://arxiv.org/abs/2307.05926",
    "context": "Title: Filling time-series gaps using image techniques: Multidimensional context autoencoder approach for building energy data imputation. (arXiv:2307.05926v1 [cs.LG])\nAbstract: Building energy prediction and management has become increasingly important in recent decades, driven by the growth of Internet of Things (IoT) devices and the availability of more energy data. However, energy data is often collected from multiple sources and can be incomplete or inconsistent, which can hinder accurate predictions and management of energy systems and limit the usefulness of the data for decision-making and research. To address this issue, past studies have focused on imputing missing gaps in energy data, including random and continuous gaps. One of the main challenges in this area is the lack of validation on a benchmark dataset with various building and meter types, making it difficult to accurately evaluate the performance of different imputation methods. Another challenge is the lack of application of state-of-the-art imputation methods for missing gaps in energy data. Contemporary image-inpainting methods, such as Partial Convolution (PConv), have been widely used ",
    "path": "papers/23/07/2307.05926.json",
    "total_tokens": 914,
    "translated_title": "使用图像技术填补时间序列间隙的方法：基于多维环境自编码器的建筑能源数据填补",
    "translated_abstract": "建筑能源预测和管理在最近几十年中变得越来越重要，受到物联网设备的增长和更多能源数据的可用性的推动。然而，能源数据经常来自多个来源，可能不完整或不一致，这可能阻碍能源系统的准确预测和管理，并限制数据在决策和研究中的用途。为了解决这个问题，过去的研究集中于填补能源数据中的缺失间隙，包括随机间隙和连续间隙。这一领域的主要挑战之一是缺乏在各种建筑和仪表类型的基准数据集上进行验证，这使得难以准确评估不同填补方法的性能。另一个挑战是缺乏将最先进的填补方法应用于能源数据中的缺失间隙。现代图像修复方法，如部分卷积(PConv)，已经广泛应用",
    "tldr": "本论文提出了一种使用多维环境自编码器的方法来填补能源数据中的缺失间隙。这个方法可以解决能源系统准确预测和管理的问题，并提高数据在决策和研究中的可用性。",
    "en_tdlr": "This paper proposes an approach using a multidimensional context autoencoder to fill the missing gaps in energy data. This method can address the issue of accurate prediction and management of energy systems and improve the usability of data for decision-making and research."
}