{
    "title": "Towards dialect-inclusive recognition in a low-resource language: are balanced corpora the answer?. (arXiv:2307.07295v1 [cs.CL])",
    "abstract": "ASR systems are generally built for the spoken 'standard', and their performance declines for non-standard dialects/varieties. This is a problem for a language like Irish, where there is no single spoken standard, but rather three major dialects: Ulster (Ul), Connacht (Co) and Munster (Mu). As a diagnostic to quantify the effect of the speaker's dialect on recognition performance, 12 ASR systems were trained, firstly using baseline dialect-balanced training corpora, and then using modified versions of the baseline corpora, where dialect-specific materials were either subtracted or added. Results indicate that dialect-balanced corpora do not yield a similar performance across the dialects: the Ul dialect consistently underperforms, whereas Mu yields lowest WERs. There is a close relationship between Co and Mu dialects, but one that is not symmetrical. These results will guide future corpus collection and system building strategies to optimise for cross-dialect performance equity.",
    "link": "http://arxiv.org/abs/2307.07295",
    "context": "Title: Towards dialect-inclusive recognition in a low-resource language: are balanced corpora the answer?. (arXiv:2307.07295v1 [cs.CL])\nAbstract: ASR systems are generally built for the spoken 'standard', and their performance declines for non-standard dialects/varieties. This is a problem for a language like Irish, where there is no single spoken standard, but rather three major dialects: Ulster (Ul), Connacht (Co) and Munster (Mu). As a diagnostic to quantify the effect of the speaker's dialect on recognition performance, 12 ASR systems were trained, firstly using baseline dialect-balanced training corpora, and then using modified versions of the baseline corpora, where dialect-specific materials were either subtracted or added. Results indicate that dialect-balanced corpora do not yield a similar performance across the dialects: the Ul dialect consistently underperforms, whereas Mu yields lowest WERs. There is a close relationship between Co and Mu dialects, but one that is not symmetrical. These results will guide future corpus collection and system building strategies to optimise for cross-dialect performance equity.",
    "path": "papers/23/07/2307.07295.json",
    "total_tokens": 1061,
    "translated_title": "在低资源语言中实现方言包容性识别：平衡语料库是否是答案？",
    "translated_abstract": "ASR系统通常是为口头的“标准”语言构建的，对于非标准的方言/变体的性能会下降。对于像爱尔兰这样的语言来说，这是一个问题，因为它没有一个口头的标准语，而是有三个主要的方言：阿尔斯特方言（Ul），康纳赫特方言（Co）和蒙斯特方言（Mu）。为了量化说话者方言对识别性能的影响，训练了12个ASR系统，首先使用基线方言平衡的训练语料库，然后使用修改过的基线语料库，其中方言特定的材料被减去或添加。结果表明，方言平衡的语料库在不同方言之间没有相似的性能：阿尔斯特方言一直表现较差，而蒙斯特方言得到了最低的错误率。康纳赫特方言和蒙斯特方言之间存在着紧密的关系，但不对称。这些结果将指导未来的语料库收集和系统构建策略，以优化跨方言的性能公平性。",
    "tldr": "研究发现，对于低资源语言中的方言识别，平衡的语料库无法在不同方言之间产生相似的性能。蒙斯特方言具有最低的错误率，而阿尔斯特方言一直表现较差。康纳赫特方言和蒙斯特方言之间存在紧密的关系，但不对称。这些结果将指导未来的语料库收集和系统构建策略，以优化跨方言的性能公平性。"
}