{
    "title": "Chain of Thought Prompting Elicits Knowledge Augmentation. (arXiv:2307.01640v1 [cs.CL])",
    "abstract": "The knowledge-augmented deep learning paradigm refers to a paradigm in which domain knowledge is identified and integrated into deep models. Conventional methods typically employ task-specific approaches to gather external knowledge from various sources. In contrast, large language models are extensively pre-trained and can serve as a comprehensive source of external knowledge. In this paper, we propose CoT-KA, a Chain-of-Thought-based method that augments knowledge for deep learning. CoT-KA avoids the need for additional knowledge retrieval or knowledge reasoning models, as required in conventional augmentation methods. Our results demonstrate that CoT-KA outperforms both pure CoT-based methods and the non-augmented method across the majority of eleven publicly available benchmarks for various reasoning tasks.",
    "link": "http://arxiv.org/abs/2307.01640",
    "context": "Title: Chain of Thought Prompting Elicits Knowledge Augmentation. (arXiv:2307.01640v1 [cs.CL])\nAbstract: The knowledge-augmented deep learning paradigm refers to a paradigm in which domain knowledge is identified and integrated into deep models. Conventional methods typically employ task-specific approaches to gather external knowledge from various sources. In contrast, large language models are extensively pre-trained and can serve as a comprehensive source of external knowledge. In this paper, we propose CoT-KA, a Chain-of-Thought-based method that augments knowledge for deep learning. CoT-KA avoids the need for additional knowledge retrieval or knowledge reasoning models, as required in conventional augmentation methods. Our results demonstrate that CoT-KA outperforms both pure CoT-based methods and the non-augmented method across the majority of eleven publicly available benchmarks for various reasoning tasks.",
    "path": "papers/23/07/2307.01640.json",
    "total_tokens": 802,
    "translated_title": "链式思维启发促进了知识增强",
    "translated_abstract": "知识增强的深度学习范式是指将领域知识识别并整合到深度模型中的一种范式。传统方法通常采用任务特定的方法从各种来源收集外部知识。相比之下，大型语言模型通过广泛的预训练可以作为全面的外部知识来源。在本文中，我们提出了一种基于链式思维的CoT-KA方法，用于深度学习的知识增强。CoT-KA避免了传统增强方法中所需的额外知识检索或知识推理模型。我们的结果表明，在多个公开可用的各种推理任务的十一个基准测试中，CoT-KA在纯CoT方法和非增强方法之上表现出更好的效果。",
    "tldr": "本文提出了一种Chain-of-Thought-based的方法，名为CoT-KA，用于深度学习的知识增强。该方法避免了传统增强方法中需要额外的知识检索或知识推理模型的需求，并在多个基准测试中显示出优于其他方法的表现。",
    "en_tdlr": "This paper proposes a Chain-of-Thought-based method, called CoT-KA, for knowledge augmentation in deep learning. The method avoids the need for additional knowledge retrieval or reasoning models, outperforming other methods in multiple benchmarks."
}