{
    "title": "Adaptive debiased machine learning using data-driven model selection techniques. (arXiv:2307.12544v1 [stat.ME])",
    "abstract": "Debiased machine learning estimators for nonparametric inference of smooth functionals of the data-generating distribution can suffer from excessive variability and instability. For this reason, practitioners may resort to simpler models based on parametric or semiparametric assumptions. However, such simplifying assumptions may fail to hold, and estimates may then be biased due to model misspecification. To address this problem, we propose Adaptive Debiased Machine Learning (ADML), a nonparametric framework that combines data-driven model selection and debiased machine learning techniques to construct asymptotically linear, adaptive, and superefficient estimators for pathwise differentiable functionals. By learning model structure directly from data, ADML avoids the bias introduced by model misspecification and remains free from the restrictions of parametric and semiparametric models. While they may exhibit irregular behavior for the target parameter in a nonparametric statistical mo",
    "link": "http://arxiv.org/abs/2307.12544",
    "context": "Title: Adaptive debiased machine learning using data-driven model selection techniques. (arXiv:2307.12544v1 [stat.ME])\nAbstract: Debiased machine learning estimators for nonparametric inference of smooth functionals of the data-generating distribution can suffer from excessive variability and instability. For this reason, practitioners may resort to simpler models based on parametric or semiparametric assumptions. However, such simplifying assumptions may fail to hold, and estimates may then be biased due to model misspecification. To address this problem, we propose Adaptive Debiased Machine Learning (ADML), a nonparametric framework that combines data-driven model selection and debiased machine learning techniques to construct asymptotically linear, adaptive, and superefficient estimators for pathwise differentiable functionals. By learning model structure directly from data, ADML avoids the bias introduced by model misspecification and remains free from the restrictions of parametric and semiparametric models. While they may exhibit irregular behavior for the target parameter in a nonparametric statistical mo",
    "path": "papers/23/07/2307.12544.json",
    "total_tokens": 770,
    "translated_title": "自适应去偏机器学习方法及数据驱动模型选择技术",
    "translated_abstract": "非参数推断中的去偏机器学习估计器可能存在过高的变异性和不稳定性。为了解决这个问题，我们提出了自适应去偏机器学习（ADML）框架，通过结合数据驱动的模型选择和去偏机器学习技术，构建渐进线性、自适应和超效率的路径可微的功能估计器。通过从数据中直接学习模型结构，ADML避免了模型规范错误引入的偏差，并摆脱了参数化和半参数化模型的限制。",
    "tldr": "提出了一种自适应去偏机器学习（ADML）框架，通过结合数据驱动的模型选择和去偏机器学习技术，构建了渐进线性、自适应和超效率的路径可微的功能估计器。"
}