{
    "title": "ForestMonkey: Toolkit for Reasoning with AI-based Defect Detection and Classification Models. (arXiv:2307.13815v1 [cs.AI])",
    "abstract": "Artificial intelligence (AI) reasoning and explainable AI (XAI) tasks have gained popularity recently, enabling users to explain the predictions or decision processes of AI models. This paper introduces Forest Monkey (FM), a toolkit designed to reason the outputs of any AI-based defect detection and/or classification model with data explainability. Implemented as a Python package, FM takes input in the form of dataset folder paths (including original images, ground truth labels, and predicted labels) and provides a set of charts and a text file to illustrate the reasoning results and suggest possible improvements. The FM toolkit consists of processes such as feature extraction from predictions to reasoning targets, feature extraction from images to defect characteristics, and a decision tree-based AI-Reasoner. Additionally, this paper investigates the time performance of the FM toolkit when applied to four AI models with different datasets. Lastly, a tutorial is provided to guide users",
    "link": "http://arxiv.org/abs/2307.13815",
    "context": "Title: ForestMonkey: Toolkit for Reasoning with AI-based Defect Detection and Classification Models. (arXiv:2307.13815v1 [cs.AI])\nAbstract: Artificial intelligence (AI) reasoning and explainable AI (XAI) tasks have gained popularity recently, enabling users to explain the predictions or decision processes of AI models. This paper introduces Forest Monkey (FM), a toolkit designed to reason the outputs of any AI-based defect detection and/or classification model with data explainability. Implemented as a Python package, FM takes input in the form of dataset folder paths (including original images, ground truth labels, and predicted labels) and provides a set of charts and a text file to illustrate the reasoning results and suggest possible improvements. The FM toolkit consists of processes such as feature extraction from predictions to reasoning targets, feature extraction from images to defect characteristics, and a decision tree-based AI-Reasoner. Additionally, this paper investigates the time performance of the FM toolkit when applied to four AI models with different datasets. Lastly, a tutorial is provided to guide users",
    "path": "papers/23/07/2307.13815.json",
    "total_tokens": 893,
    "translated_title": "ForestMonkey：基于人工智能的缺陷检测和分类模型推理工具包的设计",
    "translated_abstract": "最近人工智能（AI）推理和可解释AI（XAI）任务越来越受欢迎，使用户能够解释AI模型的预测或决策过程。本文介绍了Forest Monkey（FM）工具包，它是为了推理任何基于AI的缺陷检测和/或分类模型的输出而设计的，并具备数据可解释性。作为一个Python软件包实现，FM以数据集文件夹路径的形式作为输入（包括原始图像、真实标签和预测标签），并提供一组图表和文本文件以说明推理结果，并提出可能的改进。FM工具包包括从预测提取特征到推理目标、从图像提取特征到缺陷特征以及基于决策树的AI推理器等过程。此外，本文还研究了FM工具包在应用于四个不同数据集的AI模型时的时间性能。最后，还提供了一个教程来指导用户。",
    "tldr": "本文介绍了Forest Monkey（FM）工具包，它是一个用于推理任何基于AI的缺陷检测和/或分类模型输出结果的工具包。该工具包提供了可解释性的数据和图表，以帮助用户理解推理结果并提出改进建议。"
}