{
    "title": "Soft Gripping: Specifying for Trustworthiness. (arXiv:2307.01159v2 [cs.RO] UPDATED)",
    "abstract": "Soft robotics is an emerging technology in which engineers create flexible devices for use in a variety of applications. In order to advance the wide adoption of soft robots, ensuring their trustworthiness is essential; if soft robots are not trusted, they will not be used to their full potential. In order to demonstrate trustworthiness, a specification needs to be formulated to define what is trustworthy. However, even for soft robotic grippers, which is one of the most mature areas in soft robotics, the soft robotics community has so far given very little attention to formulating specifications. In this work, we discuss the importance of developing specifications during development of soft robotic systems, and present an extensive example specification for a soft gripper for pick-and-place tasks for grocery items. The proposed specification covers both functional and non-functional requirements, such as reliability, safety, adaptability, predictability, ethics, and regulations. We al",
    "link": "http://arxiv.org/abs/2307.01159",
    "context": "Title: Soft Gripping: Specifying for Trustworthiness. (arXiv:2307.01159v2 [cs.RO] UPDATED)\nAbstract: Soft robotics is an emerging technology in which engineers create flexible devices for use in a variety of applications. In order to advance the wide adoption of soft robots, ensuring their trustworthiness is essential; if soft robots are not trusted, they will not be used to their full potential. In order to demonstrate trustworthiness, a specification needs to be formulated to define what is trustworthy. However, even for soft robotic grippers, which is one of the most mature areas in soft robotics, the soft robotics community has so far given very little attention to formulating specifications. In this work, we discuss the importance of developing specifications during development of soft robotic systems, and present an extensive example specification for a soft gripper for pick-and-place tasks for grocery items. The proposed specification covers both functional and non-functional requirements, such as reliability, safety, adaptability, predictability, ethics, and regulations. We al",
    "path": "papers/23/07/2307.01159.json",
    "total_tokens": 915,
    "translated_title": "软抓取：针对可信度的规范化要求",
    "translated_abstract": "软机器人技术是一种新兴技术，工程师用来制造各种应用的灵活设备。为了推动软机器人的广泛应用，确保它们的可信度至关重要；如果软机器人不可信，它们就无法发挥其全部潜力。为了证明可信度，需要制定一个规范来定义什么是可信的。然而，即使对于软机器人夹持器这样的软机器人领域中最成熟的领域之一，软机器人社区在制定规范方面的关注度仍然很少。在这项工作中，我们讨论了在开发软机器人系统期间开发规范的重要性，并提出了一个用于购物杂货拾取任务的软夹持器的广泛示例规范。所提议的规范涵盖了功能和非功能要求，如可靠性，安全性，适应性，可预测性，伦理和法规。",
    "tldr": "本研究讨论了在开发软机器人系统时制定规范的重要性，并针对购物杂货拾取任务的软夹持器提出了一个广泛的示例规范，涵盖了可靠性、安全性、适应性、可预测性、伦理和法规等功能和非功能要求。"
}