{
    "title": "Named Entity Resolution in Personal Knowledge Graphs. (arXiv:2307.12173v1 [cs.AI])",
    "abstract": "Entity Resolution (ER) is the problem of determining when two entities refer to the same underlying entity. The problem has been studied for over 50 years, and most recently, has taken on new importance in an era of large, heterogeneous 'knowledge graphs' published on the Web and used widely in domains as wide ranging as social media, e-commerce and search. This chapter will discuss the specific problem of named ER in the context of personal knowledge graphs (PKGs). We begin with a formal definition of the problem, and the components necessary for doing high-quality and efficient ER. We also discuss some challenges that are expected to arise for Web-scale data. Next, we provide a brief literature review, with a special focus on how existing techniques can potentially apply to PKGs. We conclude the chapter by covering some applications, as well as promising directions for future research.",
    "link": "http://arxiv.org/abs/2307.12173",
    "context": "Title: Named Entity Resolution in Personal Knowledge Graphs. (arXiv:2307.12173v1 [cs.AI])\nAbstract: Entity Resolution (ER) is the problem of determining when two entities refer to the same underlying entity. The problem has been studied for over 50 years, and most recently, has taken on new importance in an era of large, heterogeneous 'knowledge graphs' published on the Web and used widely in domains as wide ranging as social media, e-commerce and search. This chapter will discuss the specific problem of named ER in the context of personal knowledge graphs (PKGs). We begin with a formal definition of the problem, and the components necessary for doing high-quality and efficient ER. We also discuss some challenges that are expected to arise for Web-scale data. Next, we provide a brief literature review, with a special focus on how existing techniques can potentially apply to PKGs. We conclude the chapter by covering some applications, as well as promising directions for future research.",
    "path": "papers/23/07/2307.12173.json",
    "total_tokens": 798,
    "translated_title": "个人知识图谱中的命名实体消解",
    "translated_abstract": "实体消解（ER）是确定两个实体是否指向相同底层实体的问题。这个问题已经研究了50多年，最近在互联网上发布并在社交媒体、电子商务和搜索等广泛领域中广泛使用的大规模异构的“知识图谱”时代变得更加重要。本章将讨论个人知识图谱（PKG）背景下命名实体消解的具体问题。我们首先提供了问题的形式化定义以及进行高质量和高效率的实体消解所需的组件。我们还讨论了在Web规模数据中预计会出现的一些挑战。接下来，我们对现有技术如何潜在地应用于PKG进行了简要的文献综述。最后，我们覆盖了一些应用，并展望了未来研究的方向。",
    "tldr": "本文讨论了个人知识图谱中命名实体消解的问题，包括形式化定义、高质量和高效率的解决组件以及应用和未来研究方向。"
}