{
    "title": "Automatic Coding at Scale: Design and Deployment of a Nationwide System for Normalizing Referrals in the Chilean Public Healthcare System. (arXiv:2307.05560v1 [cs.CL])",
    "abstract": "The disease coding task involves assigning a unique identifier from a controlled vocabulary to each disease mentioned in a clinical document. This task is relevant since it allows information extraction from unstructured data to perform, for example, epidemiological studies about the incidence and prevalence of diseases in a determined context. However, the manual coding process is subject to errors as it requires medical personnel to be competent in coding rules and terminology. In addition, this process consumes a lot of time and energy, which could be allocated to more clinically relevant tasks. These difficulties can be addressed by developing computational systems that automatically assign codes to diseases. In this way, we propose a two-step system for automatically coding diseases in referrals from the Chilean public healthcare system. Specifically, our model uses a state-of-the-art NER model for recognizing disease mentions and a search engine system based on Elasticsearch for ",
    "link": "http://arxiv.org/abs/2307.05560",
    "context": "Title: Automatic Coding at Scale: Design and Deployment of a Nationwide System for Normalizing Referrals in the Chilean Public Healthcare System. (arXiv:2307.05560v1 [cs.CL])\nAbstract: The disease coding task involves assigning a unique identifier from a controlled vocabulary to each disease mentioned in a clinical document. This task is relevant since it allows information extraction from unstructured data to perform, for example, epidemiological studies about the incidence and prevalence of diseases in a determined context. However, the manual coding process is subject to errors as it requires medical personnel to be competent in coding rules and terminology. In addition, this process consumes a lot of time and energy, which could be allocated to more clinically relevant tasks. These difficulties can be addressed by developing computational systems that automatically assign codes to diseases. In this way, we propose a two-step system for automatically coding diseases in referrals from the Chilean public healthcare system. Specifically, our model uses a state-of-the-art NER model for recognizing disease mentions and a search engine system based on Elasticsearch for ",
    "path": "papers/23/07/2307.05560.json",
    "total_tokens": 905,
    "translated_title": "在智利公共医疗系统中设计和部署一个用于规范转诊的全国范围内自动编码系统",
    "translated_abstract": "疾病编码任务涉及为临床文档中提到的每种疾病分配一个受控词汇中的唯一标识符。这个任务很重要，因为它允许从非结构化数据中提取信息，例如在特定背景下进行流行病学研究。然而，手动编码过程容易出错，要求医务人员精通编码规则和术语。此外，这个过程耗费大量时间和精力，这些资源可以用于更具临床意义的任务。这些困难可以通过开发能够自动为疾病分配代码的计算系统来解决。因此，我们提出了一个两步法的系统，用于自动编码智利公共医疗系统中的转诊疾病。具体而言，我们的模型使用了最先进的NER模型来识别疾病提及，并基于Elasticsearch的搜索引擎系统来进行编码。",
    "tldr": "该论文描述了在智利公共医疗系统中设计和部署的一个用于自动编码转诊疾病的系统。该系统使用最先进的NER模型识别疾病提及，并基于Elasticsearch的搜索引擎系统进行编码。",
    "en_tdlr": "This paper presents the design and deployment of a system for automatically coding referral diseases in the Chilean public healthcare system. The system utilizes state-of-the-art NER model for disease mention recognition and Elasticsearch-based search engine system for coding."
}