{
    "title": "Publish for Public: Improving Access of Public Libraries Users to Research Findings through Plain Language Summaries. (arXiv:2307.16192v1 [cs.IR])",
    "abstract": "Public libraries play a crucial role in disseminating knowledge to society. However, most of their users do not have the specialized knowledge to understand the new research findings. Providing plain language summaries (PLSs) in public libraries is a way to make the new research findings more accessible and understandable for the public. This article proposes a framework for providing PLSs as a new service in public libraries. Drawing from the literature on science and society, PLSs, and public libraries, a theoretical framework is developed. The findings suggest that public libraries can collect PLSs through different methods, such as professional teams, researchers, crowdsourcing, etc. Library newsletters, special publications, brochures, independent online databases, and social networks are among the most effective for making PLSs accessible to users. By proposing a framework for providing PLSs in public libraries, this study helps to bridge the gap between scientific research and t",
    "link": "http://arxiv.org/abs/2307.16192",
    "context": "Title: Publish for Public: Improving Access of Public Libraries Users to Research Findings through Plain Language Summaries. (arXiv:2307.16192v1 [cs.IR])\nAbstract: Public libraries play a crucial role in disseminating knowledge to society. However, most of their users do not have the specialized knowledge to understand the new research findings. Providing plain language summaries (PLSs) in public libraries is a way to make the new research findings more accessible and understandable for the public. This article proposes a framework for providing PLSs as a new service in public libraries. Drawing from the literature on science and society, PLSs, and public libraries, a theoretical framework is developed. The findings suggest that public libraries can collect PLSs through different methods, such as professional teams, researchers, crowdsourcing, etc. Library newsletters, special publications, brochures, independent online databases, and social networks are among the most effective for making PLSs accessible to users. By proposing a framework for providing PLSs in public libraries, this study helps to bridge the gap between scientific research and t",
    "path": "papers/23/07/2307.16192.json",
    "total_tokens": 888,
    "translated_title": "为公众出版：通过简明语言总结提高公共图书馆用户对研究成果的获取",
    "translated_abstract": "公共图书馆在向社会传播知识方面发挥着关键作用。然而，大多数用户没有专业知识来理解新的研究发现。在公共图书馆提供简明语言总结（PLS）是使新的研究发现更加可获取和容易理解的方法。本文提出了一个在公共图书馆提供PLS作为新服务的框架。从科学与社会、PLS和公共图书馆的文献中，发展了一个理论框架。研究发现，公共图书馆可以通过专业团队、研究人员、众包等多种方式收集PLS。图书馆通讯、特刊、宣传册、独立在线数据库和社交网络是使PLS对用户可获取最有效的方式之一。通过提出公共图书馆提供PLS的框架，本研究有助于弥合科学研究和公众之间的鸿沟。",
    "tldr": "本文提出了在公共图书馆提供简明语言总结（PLS）作为一项新服务的框架，并探讨了PLS收集的方法以及使之对用户可获取的最有效途径。"
}