{
    "title": "Exploring the Sharpened Cosine Similarity. (arXiv:2307.13855v1 [cs.CV])",
    "abstract": "Convolutional layers have long served as the primary workhorse for image classification. Recently, an alternative to convolution was proposed using the Sharpened Cosine Similarity (SCS), which in theory may serve as a better feature detector. While multiple sources report promising results, there has not been to date a full-scale empirical analysis of neural network performance using these new layers. In our work, we explore SCS's parameter behavior and potential as a drop-in replacement for convolutions in multiple CNN architectures benchmarked on CIFAR-10. We find that while SCS may not yield significant increases in accuracy, it may learn more interpretable representations. We also find that, in some circumstances, SCS may confer a slight increase in adversarial robustness.",
    "link": "http://arxiv.org/abs/2307.13855",
    "context": "Title: Exploring the Sharpened Cosine Similarity. (arXiv:2307.13855v1 [cs.CV])\nAbstract: Convolutional layers have long served as the primary workhorse for image classification. Recently, an alternative to convolution was proposed using the Sharpened Cosine Similarity (SCS), which in theory may serve as a better feature detector. While multiple sources report promising results, there has not been to date a full-scale empirical analysis of neural network performance using these new layers. In our work, we explore SCS's parameter behavior and potential as a drop-in replacement for convolutions in multiple CNN architectures benchmarked on CIFAR-10. We find that while SCS may not yield significant increases in accuracy, it may learn more interpretable representations. We also find that, in some circumstances, SCS may confer a slight increase in adversarial robustness.",
    "path": "papers/23/07/2307.13855.json",
    "total_tokens": 833,
    "translated_title": "探索锐化余弦相似度",
    "translated_abstract": "卷积层长期以来一直是图像分类的主要工具。最近，提出了一种替代卷积的方法，使用锐化余弦相似度（SCS），据理论上认为可能作为更好的特征检测器。虽然多个来源报道了有希望的结果，但迄今为止还没有进行全面的经验分析，评估这些新层在神经网络性能方面。在我们的工作中，我们探索了SCS的参数行为和在CIFAR-10上多个CNN架构中作为卷积的替代品的潜力。我们发现，虽然SCS可能不会显著提高准确性，但可能学习到更可解释的表示。我们还发现，在某些情况下，SCS可能会稍微增加对抗性的鲁棒性。",
    "tldr": "该论文研究了锐化余弦相似度(SCS)在神经网络中作为卷积的替代品的可能性。研究发现，虽然SCS可能不会提高准确性，但可能学习到更可解释的表示，并在某些情况下稍微增加对抗性的鲁棒性。",
    "en_tdlr": "This paper explores the potential of using Sharpened Cosine Similarity (SCS) as a replacement for convolutions in neural networks. The study finds that while SCS may not improve accuracy significantly, it may learn more interpretable representations and slightly increase adversarial robustness in certain cases."
}