{
    "title": "Handwritten Text Recognition Using Convolutional Neural Network. (arXiv:2307.05396v1 [cs.CV])",
    "abstract": "OCR (Optical Character Recognition) is a technology that offers comprehensive alphanumeric recognition of handwritten and printed characters at electronic speed by merely scanning the document. Recently, the understanding of visual data has been termed Intelligent Character Recognition (ICR). Intelligent Character Recognition (ICR) is the OCR module that can convert scans of handwritten or printed characters into ASCII text. ASCII data is the standard format for data encoding in electronic communication. ASCII assigns standard numeric values to letters, numeral, symbols, white-spaces and other characters. In more technical terms, OCR is the process of using an electronic device to transform 2-Dimensional textual information into machine-encoded text. Anything that contains text both machine written or handwritten can be scanned either through a scanner or just simply a picture of the text is enough for the recognition system to distinguish the text. The goal of this papers is to show t",
    "link": "http://arxiv.org/abs/2307.05396",
    "context": "Title: Handwritten Text Recognition Using Convolutional Neural Network. (arXiv:2307.05396v1 [cs.CV])\nAbstract: OCR (Optical Character Recognition) is a technology that offers comprehensive alphanumeric recognition of handwritten and printed characters at electronic speed by merely scanning the document. Recently, the understanding of visual data has been termed Intelligent Character Recognition (ICR). Intelligent Character Recognition (ICR) is the OCR module that can convert scans of handwritten or printed characters into ASCII text. ASCII data is the standard format for data encoding in electronic communication. ASCII assigns standard numeric values to letters, numeral, symbols, white-spaces and other characters. In more technical terms, OCR is the process of using an electronic device to transform 2-Dimensional textual information into machine-encoded text. Anything that contains text both machine written or handwritten can be scanned either through a scanner or just simply a picture of the text is enough for the recognition system to distinguish the text. The goal of this papers is to show t",
    "path": "papers/23/07/2307.05396.json",
    "total_tokens": 761,
    "translated_title": "使用卷积神经网络的手写文本识别",
    "translated_abstract": "OCR（光学字符识别）是一种技术，通过仅仅扫描文档，以电子速度全面识别手写和打印字符的字母数字识别。最近，对视觉数据的理解被称为智能字符识别（ICR）。智能字符识别（ICR）是可以将手写或打印字符的扫描转换为ASCII文本的OCR模块。ASCII数据是电子通信中数据编码的标准格式。ASCII为字母、数字、符号、空格和其他字符分配标准数值。更技术性地说，OCR是使用电子设备将二维文本信息转换为机器编码文本的过程。任何包含文字的机器书写或手写物体都可以通过扫描仪或只是文字的图片来识别。",
    "tldr": "这篇论文介绍了使用卷积神经网络进行手写文本识别的技术，并讨论了OCR和智能字符识别的概念和应用。",
    "en_tdlr": "This paper describes the use of convolutional neural networks for handwritten text recognition, discussing the concepts and applications of OCR and intelligent character recognition."
}