{
    "title": "Unsupervised Learning of Distributional Properties can Supplement Human Labeling and Increase Active Learning Efficiency in Anomaly Detection. (arXiv:2307.08782v1 [cs.LG])",
    "abstract": "Exfiltration of data via email is a serious cybersecurity threat for many organizations. Detecting data exfiltration (anomaly) patterns typically requires labeling, most often done by a human annotator, to reduce the high number of false alarms. Active Learning (AL) is a promising approach for labeling data efficiently, but it needs to choose an efficient order in which cases are to be labeled, and there are uncertainties as to what scoring procedure should be used to prioritize cases for labeling, especially when detecting rare cases of interest is crucial. We propose an adaptive AL sampling strategy that leverages the underlying prior data distribution, as well as model uncertainty, to produce batches of cases to be labeled that contain instances of rare anomalies. We show that (1) the classifier benefits from a batch of representative and informative instances of both normal and anomalous examples, (2) unsupervised anomaly detection plays a useful role in building the classifier in ",
    "link": "http://arxiv.org/abs/2307.08782",
    "context": "Title: Unsupervised Learning of Distributional Properties can Supplement Human Labeling and Increase Active Learning Efficiency in Anomaly Detection. (arXiv:2307.08782v1 [cs.LG])\nAbstract: Exfiltration of data via email is a serious cybersecurity threat for many organizations. Detecting data exfiltration (anomaly) patterns typically requires labeling, most often done by a human annotator, to reduce the high number of false alarms. Active Learning (AL) is a promising approach for labeling data efficiently, but it needs to choose an efficient order in which cases are to be labeled, and there are uncertainties as to what scoring procedure should be used to prioritize cases for labeling, especially when detecting rare cases of interest is crucial. We propose an adaptive AL sampling strategy that leverages the underlying prior data distribution, as well as model uncertainty, to produce batches of cases to be labeled that contain instances of rare anomalies. We show that (1) the classifier benefits from a batch of representative and informative instances of both normal and anomalous examples, (2) unsupervised anomaly detection plays a useful role in building the classifier in ",
    "path": "papers/23/07/2307.08782.json",
    "total_tokens": 833,
    "translated_title": "无监督学习分布特性可以辅助人工标注并提高异常检测中的主动学习效率",
    "translated_abstract": "数据通过电子邮件的泄露对许多组织来说是一个严重的网络安全威胁。检测数据泄露（异常）模式通常需要人工标注来减少虚警的数量。主动学习是一种能够有效标注数据的方法，但它需要选择一个有效的顺序来标注案例，并且在确定用于优先标注案例的评分过程时存在不确定性，特别是在关键时刻检测罕见的案例的情况下。我们提出了一种自适应主动学习采样策略，利用基础先前数据分布和模型的不确定性，产生批次的案例以进行标注，其中包含罕见异常的实例。我们证明了：（1）分类器从具有代表性和信息丰富的正常与异常实例的批次中受益，（2）无监督异常检测在构建分类器中发挥了有用的作用。",
    "tldr": "通过无监督学习分布特性进行主动学习可以提高异常检测的效率，并辅助人工标注来减少虚警数量，特别是在罕见案例的检测中。"
}