{
    "title": "A Dual Stealthy Backdoor: From Both Spatial and Frequency Perspectives. (arXiv:2307.10184v1 [cs.CR])",
    "abstract": "Backdoor attacks pose serious security threats to deep neural networks (DNNs). Backdoored models make arbitrarily (targeted) incorrect predictions on inputs embedded with well-designed triggers while behaving normally on clean inputs. Many works have explored the invisibility of backdoor triggers to improve attack stealthiness. However, most of them only consider the invisibility in the spatial domain without explicitly accounting for the generation of invisible triggers in the frequency domain, making the generated poisoned images be easily detected by recent defense methods. To address this issue, in this paper, we propose a DUal stealthy BAckdoor attack method named DUBA, which simultaneously considers the invisibility of triggers in both the spatial and frequency domains, to achieve desirable attack performance, while ensuring strong stealthiness. Specifically, we first use Discrete Wavelet Transform to embed the high-frequency information of the trigger image into the clean image ",
    "link": "http://arxiv.org/abs/2307.10184",
    "context": "Title: A Dual Stealthy Backdoor: From Both Spatial and Frequency Perspectives. (arXiv:2307.10184v1 [cs.CR])\nAbstract: Backdoor attacks pose serious security threats to deep neural networks (DNNs). Backdoored models make arbitrarily (targeted) incorrect predictions on inputs embedded with well-designed triggers while behaving normally on clean inputs. Many works have explored the invisibility of backdoor triggers to improve attack stealthiness. However, most of them only consider the invisibility in the spatial domain without explicitly accounting for the generation of invisible triggers in the frequency domain, making the generated poisoned images be easily detected by recent defense methods. To address this issue, in this paper, we propose a DUal stealthy BAckdoor attack method named DUBA, which simultaneously considers the invisibility of triggers in both the spatial and frequency domains, to achieve desirable attack performance, while ensuring strong stealthiness. Specifically, we first use Discrete Wavelet Transform to embed the high-frequency information of the trigger image into the clean image ",
    "path": "papers/23/07/2307.10184.json",
    "total_tokens": 907,
    "translated_title": "一种双重隐秘后门攻击：从空间和频率角度来看",
    "translated_abstract": "后门攻击对深度神经网络(DNNs)构成严重的安全威胁。后门模型在带有精心设计的触发器的输入上会任意（有针对性地）出现错误预测，而在干净的输入上表现正常。许多研究探索了后门触发器的隐匿性以提高攻击的隐秘性。然而，其中大部分只考虑了空间域中的隐匿性，没有明确考虑在频率域中生成隐匿触发器，使生成的毒害图像容易被最近的防御方法检测到。为了解决这个问题，本文提出了一种名为DUBA的DUal隐秘后门攻击方法，该方法同时考虑了触发器在空间和频率域中的隐匿性，以实现良好的攻击性能，同时确保强大的隐匿性。具体地，我们首先使用离散小波变换将触发器图像的高频信息嵌入干净图像中。",
    "tldr": "该论文提出了一种名为DUBA的双重隐秘后门攻击方法，该方法同时考虑了触发器在空间和频率域中的隐匿性，以实现良好的攻击性能和强大的隐匿性。",
    "en_tdlr": "This paper proposes a dual stealthy backdoor attack method named DUBA, which considers the invisibility of triggers in both the spatial and frequency domains, achieving good attack performance and strong stealthiness."
}