{
    "title": "Bayesian Spike Train Inference via Non-Local Priors. (arXiv:2307.10177v1 [q-bio.NC])",
    "abstract": "Advances in neuroscience have enabled researchers to measure the activities of large numbers of neurons simultaneously in behaving animals. We have access to the fluorescence of each of the neurons which provides a first-order approximation of the neural activity over time. Determining the exact spike of a neuron from this fluorescence trace constitutes an active area of research within the field of computational neuroscience. We propose a novel Bayesian approach based on a mixture of half-non-local prior densities and point masses for this task. Instead of a computationally expensive MCMC algorithm, we adopt a stochastic search-based approach that is capable of taking advantage of modern computing environments often equipped with multiple processors, to explore all possible arrangements of spikes and lack thereof in an observed spike train. It then reports the highest posterior probability arrangement of spikes and posterior probability for a spike at each location of the spike train.",
    "link": "http://arxiv.org/abs/2307.10177",
    "context": "Title: Bayesian Spike Train Inference via Non-Local Priors. (arXiv:2307.10177v1 [q-bio.NC])\nAbstract: Advances in neuroscience have enabled researchers to measure the activities of large numbers of neurons simultaneously in behaving animals. We have access to the fluorescence of each of the neurons which provides a first-order approximation of the neural activity over time. Determining the exact spike of a neuron from this fluorescence trace constitutes an active area of research within the field of computational neuroscience. We propose a novel Bayesian approach based on a mixture of half-non-local prior densities and point masses for this task. Instead of a computationally expensive MCMC algorithm, we adopt a stochastic search-based approach that is capable of taking advantage of modern computing environments often equipped with multiple processors, to explore all possible arrangements of spikes and lack thereof in an observed spike train. It then reports the highest posterior probability arrangement of spikes and posterior probability for a spike at each location of the spike train.",
    "path": "papers/23/07/2307.10177.json",
    "total_tokens": 941,
    "translated_title": "基于非局部先验的贝叶斯脉冲序列推断",
    "translated_abstract": "神经科学的进展使研究人员能够同时测量行为动物中大量神经元的活动。我们可以获得每个神经元的荧光信号，这提供了神经活动随时间的一阶近似。根据这个荧光信号确定神经元的确切脉冲是计算神经科学领域的一个活跃研究领域。我们提出了一种基于混合半非局部先验密度和点质量的新颖贝叶斯方法来解决这个任务。我们采用了一种基于随机搜索的方法，而不是计算复杂的MCMC算法。这种方法能够利用现代计算环境（通常配备有多个处理器）的优势，探索观察到的脉冲序列中所有可能的脉冲排列和缺失情况。然后报告脉冲排列的最高后验概率和每个脉冲位置的后验概率。",
    "tldr": "使用基于混合半非局部先验密度和点质量的贝叶斯方法，提出一种基于随机搜索的方法，用于从荧光信号中确定神经元的脉冲序列，该方法能够高效地探索所有可能的脉冲排列并报告最高后验概率的脉冲排列和每个脉冲位置的后验概率。"
}