{
    "title": "Advertiser Learning in Direct Advertising Markets. (arXiv:2307.07015v1 [econ.GN])",
    "abstract": "Direct buy advertisers procure advertising inventory at fixed rates from publishers and ad networks. Such advertisers face the complex task of choosing ads amongst myriad new publisher sites. We offer evidence that advertisers do not excel at making these choices. Instead, they try many sites before settling on a favored set, consistent with advertiser learning. We subsequently model advertiser demand for publisher inventory wherein advertisers learn about advertising efficacy across publishers' sites. Results suggest that advertisers spend considerable resources advertising on sites they eventually abandon -- in part because their prior beliefs about advertising efficacy on those sites are too optimistic. The median advertiser's expected CTR at a new site is 0.23%, five times higher than the true median CTR of 0.045%.  We consider how pooling advertiser information remediates this problem. Specifically, we show that ads with similar visual elements garner similar CTRs, enabling advert",
    "link": "http://arxiv.org/abs/2307.07015",
    "context": "Title: Advertiser Learning in Direct Advertising Markets. (arXiv:2307.07015v1 [econ.GN])\nAbstract: Direct buy advertisers procure advertising inventory at fixed rates from publishers and ad networks. Such advertisers face the complex task of choosing ads amongst myriad new publisher sites. We offer evidence that advertisers do not excel at making these choices. Instead, they try many sites before settling on a favored set, consistent with advertiser learning. We subsequently model advertiser demand for publisher inventory wherein advertisers learn about advertising efficacy across publishers' sites. Results suggest that advertisers spend considerable resources advertising on sites they eventually abandon -- in part because their prior beliefs about advertising efficacy on those sites are too optimistic. The median advertiser's expected CTR at a new site is 0.23%, five times higher than the true median CTR of 0.045%.  We consider how pooling advertiser information remediates this problem. Specifically, we show that ads with similar visual elements garner similar CTRs, enabling advert",
    "path": "papers/23/07/2307.07015.json",
    "total_tokens": 845,
    "translated_title": "广告商在直接广告市场中的学习",
    "translated_abstract": "直接购买广告的广告商以固定价格从发布者和广告网络手中购买广告库存。这些广告商面临着在众多新的发布者网站中选择广告的复杂任务。我们提供证据表明广告商在做出这些选择时并不出色。相反，他们会在选择一个偏爱的集合之前尝试许多网站，与广告商学习相一致。随后，我们对广告商对发布者库存的需求进行建模，广告商可以在发布者的网站上了解广告效果。结果表明，广告商在以后放弃的网站上花费了大量资源进行广告投放，部分原因是他们对这些网站的广告效果存在过于乐观的先验信念。新网站上的广告商的预期点击率中位数为0.23%，比真实的中位数点击率0.045%高五倍。我们考虑了如何通过集合广告商信息来解决这个问题。具体而言，我们展示了具有类似视觉元素的广告可以获得类似的点击率。",
    "tldr": "广告商在直接广告市场中学习如何选择网站上的广告，调整他们的先验信念，并通过集合广告商信息来提高广告效果。"
}