{
    "title": "Worrisome Properties of Neural Network Controllers and Their Symbolic Representations. (arXiv:2307.15456v1 [cs.LG])",
    "abstract": "We raise concerns about controllers' robustness in simple reinforcement learning benchmark problems. We focus on neural network controllers and their low neuron and symbolic abstractions. A typical controller reaching high mean return values still generates an abundance of persistent low-return solutions, which is a highly undesirable property, easily exploitable by an adversary. We find that the simpler controllers admit more persistent bad solutions. We provide an algorithm for a systematic robustness study and prove existence of persistent solutions and, in some cases, periodic orbits, using a computer-assisted proof methodology.",
    "link": "http://arxiv.org/abs/2307.15456",
    "context": "Title: Worrisome Properties of Neural Network Controllers and Their Symbolic Representations. (arXiv:2307.15456v1 [cs.LG])\nAbstract: We raise concerns about controllers' robustness in simple reinforcement learning benchmark problems. We focus on neural network controllers and their low neuron and symbolic abstractions. A typical controller reaching high mean return values still generates an abundance of persistent low-return solutions, which is a highly undesirable property, easily exploitable by an adversary. We find that the simpler controllers admit more persistent bad solutions. We provide an algorithm for a systematic robustness study and prove existence of persistent solutions and, in some cases, periodic orbits, using a computer-assisted proof methodology.",
    "path": "papers/23/07/2307.15456.json",
    "total_tokens": 835,
    "translated_title": "神经网络控制器及其符号表示的令人担忧的特性",
    "translated_abstract": "我们对简单的强化学习基准问题中控制器的稳健性提出了一些关切。我们关注神经网络控制器及其低神经元和符号抽象。一个典型的控制器可以达到很高的平均回报值，但仍会生成大量持久的低回报解决方案，这是一个非常不可取的特性，容易被对手利用。我们发现，简单的控制器会产生更多持久的不良解决方案。我们提供了一个系统稳健性研究的算法，并使用计算机辅助证明方法证明了持久解决方案的存在性，以及在某些情况下的周期轨道。",
    "tldr": "本论文对神经网络控制器在简单强化学习问题中的稳健性产生了担忧，通过对低神经元和符号抽象的探究，发现即使控制器达到高回报，仍会产生大量持久低回报解决方案，对手可以轻易利用。论文提供了一个系统稳健性研究的算法，并证明了持久解决方案的存在性以及周期轨道的存在。",
    "en_tdlr": "This paper raises concerns about the robustness of neural network controllers in simple reinforcement learning problems. It explores the phenomenon where even high-performing controllers generate a significant number of persistently low-return solutions, which can be easily exploited by adversaries. The study provides an algorithm for systematic robustness analysis and proves the existence of persistent solutions and periodic orbits using a computer-assisted proof methodology."
}