{
    "title": "Forecasting Battery Electric Vehicle Charging Behavior: A Deep Learning Approach Equipped with Micro-Clustering and SMOTE Techniques. (arXiv:2307.10588v1 [cs.LG])",
    "abstract": "Energy systems, climate change, and public health are among the primary reasons for moving toward electrification in transportation. Transportation electrification is being promoted worldwide to reduce emissions. As a result, many automakers will soon start making only battery electric vehicles (BEVs). BEV adoption rates are rising in California, mainly due to climate change and air pollution concerns. While great for climate and pollution goals, improperly managed BEV charging can lead to insufficient charging infrastructure and power outages. This study develops a novel Micro Clustering Deep Neural Network (MCDNN), an artificial neural network algorithm that is highly effective at learning BEVs trip and charging data to forecast BEV charging events, information that is essential for electricity load aggregators and utility managers to provide charging stations and electricity capacity effectively. The MCDNN is configured using a robust dataset of trips and charges that occurred in Ca",
    "link": "http://arxiv.org/abs/2307.10588",
    "context": "Title: Forecasting Battery Electric Vehicle Charging Behavior: A Deep Learning Approach Equipped with Micro-Clustering and SMOTE Techniques. (arXiv:2307.10588v1 [cs.LG])\nAbstract: Energy systems, climate change, and public health are among the primary reasons for moving toward electrification in transportation. Transportation electrification is being promoted worldwide to reduce emissions. As a result, many automakers will soon start making only battery electric vehicles (BEVs). BEV adoption rates are rising in California, mainly due to climate change and air pollution concerns. While great for climate and pollution goals, improperly managed BEV charging can lead to insufficient charging infrastructure and power outages. This study develops a novel Micro Clustering Deep Neural Network (MCDNN), an artificial neural network algorithm that is highly effective at learning BEVs trip and charging data to forecast BEV charging events, information that is essential for electricity load aggregators and utility managers to provide charging stations and electricity capacity effectively. The MCDNN is configured using a robust dataset of trips and charges that occurred in Ca",
    "path": "papers/23/07/2307.10588.json",
    "total_tokens": 933,
    "translated_title": "预测电动汽车充电行为：采用微聚类和SMOTE技术的深度学习方法",
    "translated_abstract": "能源系统、气候变化和公共健康是推动交通电气化的主要原因。全球范围内正在推广交通电气化以减少排放。因此，许多汽车制造商将很快开始只生产电池电动汽车（BEV）。由于气候变化和空气污染的担忧，加利福尼亚的BEV采用率正在上升。虽然这对于气候和污染目标来说很好，但未妥善管理的BEV充电可能导致充电基础设施不足和停电。本研究开发了一种新颖的微聚类深度神经网络（MCDNN），该算法在学习BEV行程和充电数据以预测BEV充电事件方面非常有效，这对于电力负荷聚合器和电力管理人员有效提供充电站和电力容量的信息至关重要。MCDNN使用加利福尼亚发生的行程和充电的稳健数据集进行配置。",
    "tldr": "本研究开发了一种使用微聚类和SMOTE技术的深度学习方法，能够准确预测电动汽车充电事件，为电力负荷聚合器和电力管理人员提供提供充电站和电力容量的信息。",
    "en_tdlr": "This study proposes a deep learning approach equipped with micro-clustering and SMOTE techniques to accurately forecast battery electric vehicle (BEV) charging events, providing essential information for electricity load aggregators and utility managers to effectively provide charging stations and electricity capacity."
}