{
    "title": "Ageing Analysis of Embedded SRAM on a Large-Scale Testbed Using Machine Learning. (arXiv:2307.06693v1 [cs.AR])",
    "abstract": "Ageing detection and failure prediction are essential in many Internet of Things (IoT) deployments, which operate huge quantities of embedded devices unattended in the field for years. In this paper, we present a large-scale empirical analysis of natural SRAM wear-out using 154 boards from a general-purpose testbed. Starting from SRAM initialization bias, which each node can easily collect at startup, we apply various metrics for feature extraction and experiment with common machine learning methods to predict the age of operation for this node. Our findings indicate that even though ageing impacts are subtle, our indicators can well estimate usage times with an $R^2$ score of 0.77 and a mean error of 24% using regressors, and with an F1 score above 0.6 for classifiers applying a six-months resolution.",
    "link": "http://arxiv.org/abs/2307.06693",
    "context": "Title: Ageing Analysis of Embedded SRAM on a Large-Scale Testbed Using Machine Learning. (arXiv:2307.06693v1 [cs.AR])\nAbstract: Ageing detection and failure prediction are essential in many Internet of Things (IoT) deployments, which operate huge quantities of embedded devices unattended in the field for years. In this paper, we present a large-scale empirical analysis of natural SRAM wear-out using 154 boards from a general-purpose testbed. Starting from SRAM initialization bias, which each node can easily collect at startup, we apply various metrics for feature extraction and experiment with common machine learning methods to predict the age of operation for this node. Our findings indicate that even though ageing impacts are subtle, our indicators can well estimate usage times with an $R^2$ score of 0.77 and a mean error of 24% using regressors, and with an F1 score above 0.6 for classifiers applying a six-months resolution.",
    "path": "papers/23/07/2307.06693.json",
    "total_tokens": 826,
    "translated_title": "使用机器学习在大规模测试平台上进行嵌入式SRAM老化分析",
    "translated_abstract": "老化检测和故障预测在许多物联网（IoT）部署中至关重要，这些部署在野外无人看管地运行多年的嵌入式设备数量巨大。本文针对一般用途测试平台上的154个板进行了大规模的SRAM老化实证分析。从每个节点在启动时容易收集到的SRAM初始化偏差出发，我们应用各种特征提取指标，并尝试使用常见的机器学习方法来预测该节点的运行时间。我们的研究结果表明，尽管老化影响是微妙的，但我们的指标可以很好地估计使用时间，回归器的R2分数为0.77，平均误差为24%，应用六个月分辨率的分类器的F1分数超过0.6。",
    "tldr": "使用机器学习在大规模测试平台上进行嵌入式SRAM老化分析，发现通过SRAM初始化偏差和各种特征提取指标可以准确估计嵌入式设备的使用时间。"
}