{
    "title": "A reinforcement learning approach for VQA validation: an application to diabetic macular edema grading. (arXiv:2307.09886v1 [cs.CV])",
    "abstract": "Recent advances in machine learning models have greatly increased the performance of automated methods in medical image analysis. However, the internal functioning of such models is largely hidden, which hinders their integration in clinical practice. Explainability and trust are viewed as important aspects of modern methods, for the latter's widespread use in clinical communities. As such, validation of machine learning models represents an important aspect and yet, most methods are only validated in a limited way. In this work, we focus on providing a richer and more appropriate validation approach for highly powerful Visual Question Answering (VQA) algorithms. To better understand the performance of these methods, which answer arbitrary questions related to images, this work focuses on an automatic visual Turing test (VTT). That is, we propose an automatic adaptive questioning method, that aims to expose the reasoning behavior of a VQA algorithm. Specifically, we introduce a reinfor",
    "link": "http://arxiv.org/abs/2307.09886",
    "context": "Title: A reinforcement learning approach for VQA validation: an application to diabetic macular edema grading. (arXiv:2307.09886v1 [cs.CV])\nAbstract: Recent advances in machine learning models have greatly increased the performance of automated methods in medical image analysis. However, the internal functioning of such models is largely hidden, which hinders their integration in clinical practice. Explainability and trust are viewed as important aspects of modern methods, for the latter's widespread use in clinical communities. As such, validation of machine learning models represents an important aspect and yet, most methods are only validated in a limited way. In this work, we focus on providing a richer and more appropriate validation approach for highly powerful Visual Question Answering (VQA) algorithms. To better understand the performance of these methods, which answer arbitrary questions related to images, this work focuses on an automatic visual Turing test (VTT). That is, we propose an automatic adaptive questioning method, that aims to expose the reasoning behavior of a VQA algorithm. Specifically, we introduce a reinfor",
    "path": "papers/23/07/2307.09886.json",
    "total_tokens": 872,
    "translated_title": "VQA验证的强化学习方法：应用于糖尿病黄斑水肿分级",
    "translated_abstract": "最近的机器学习模型的进展极大地提高了医学图像分析自动化方法的性能。然而，这些模型的内部功能很大程度上是隐藏的，这妨碍了它们在临床实践中的整合。可解释性和信任被视为现代方法的重要方面，以便在临床社区中广泛应用。因此，机器学习模型的验证代表了一个重要方面，然而大多数方法仅在有限的方式下进行验证。在这项工作中，我们专注于为功能强大的视觉问答（VQA）算法提供更丰富和更适当的验证方法。为了更好地了解这些方法的性能，这项工作关注于自动视觉图灵测试（VTT）。也就是说，我们提出了一种自适应问答方法，旨在暴露VQA算法的推理行为。具体而言，我们引入了一种强化学习方法。",
    "tldr": "本论文提出了一种基于强化学习的方法，用于验证VQA算法在医学图像分析中的应用，旨在提供更丰富和更适当的验证方法，以揭示算法的推理行为。",
    "en_tdlr": "This paper proposes a reinforcement learning approach for validating VQA algorithms in medical image analysis, aiming to provide a richer and more appropriate validation method to uncover the reasoning behavior of the algorithms."
}