{
    "title": "The fiscal implications of stringent climate policy. (arXiv:2307.16554v1 [econ.GN])",
    "abstract": "Stringent climate policy compatible with the targets of the 2015 Paris Agreement would pose a substantial fiscal challenge. Reducing carbon dioxide emissions by 95% or more by 2050 would raise 7% (1-17%) of GDP in carbon tax revenue, half of current, global tax revenue. Revenues are relatively larger in poorer regions. Subsidies for carbon dioxide sequestration would amount to 6.6% (0.3-7.1%) of GDP. These numbers are conservative as they were estimated using models that assume first-best climate policy implementation and ignore the costs of raising revenue. The fiscal challenge rapidly shrinks if emission targets are relaxed.",
    "link": "http://arxiv.org/abs/2307.16554",
    "context": "Title: The fiscal implications of stringent climate policy. (arXiv:2307.16554v1 [econ.GN])\nAbstract: Stringent climate policy compatible with the targets of the 2015 Paris Agreement would pose a substantial fiscal challenge. Reducing carbon dioxide emissions by 95% or more by 2050 would raise 7% (1-17%) of GDP in carbon tax revenue, half of current, global tax revenue. Revenues are relatively larger in poorer regions. Subsidies for carbon dioxide sequestration would amount to 6.6% (0.3-7.1%) of GDP. These numbers are conservative as they were estimated using models that assume first-best climate policy implementation and ignore the costs of raising revenue. The fiscal challenge rapidly shrinks if emission targets are relaxed.",
    "path": "papers/23/07/2307.16554.json",
    "total_tokens": 752,
    "translated_title": "严格的气候政策的财政影响",
    "translated_abstract": "符合2015年巴黎协议目标的严格的气候政策将带来巨大的财政挑战。到2050年将二氧化碳排放量降低95%或更多将使碳税收入占GDP的7%（1-17%），仅为当前全球税收的一半。贫困地区的税收收入相对较大。二氧化碳封存的补贴金额将占GDP的6.6%（0.3-7.1%）。这些数字是保守估计的，因为它们是使用假设实施最佳气候政策并忽略增加收入成本的模型得出的。如果放松排放目标，财政挑战将迅速缩小。",
    "tldr": "严格的气候政策对财政构成巨大挑战，尤其在减少碳排放和补贴碳封存方面。如果排放目标放松，财政挑战将会缩小。",
    "en_tdlr": "Stringent climate policies, aimed at reducing carbon emissions and subsidizing carbon sequestration, pose a substantial fiscal challenge. However, this challenge can be mitigated if emission targets are relaxed."
}