{
    "title": "Quarl: A Learning-Based Quantum Circuit Optimizer. (arXiv:2307.10120v1 [quant-ph])",
    "abstract": "Optimizing quantum circuits is challenging due to the very large search space of functionally equivalent circuits and the necessity of applying transformations that temporarily decrease performance to achieve a final performance improvement. This paper presents Quarl, a learning-based quantum circuit optimizer. Applying reinforcement learning (RL) to quantum circuit optimization raises two main challenges: the large and varying action space and the non-uniform state representation. Quarl addresses these issues with a novel neural architecture and RL-training procedure. Our neural architecture decomposes the action space into two parts and leverages graph neural networks in its state representation, both of which are guided by the intuition that optimization decisions can be mostly guided by local reasoning while allowing global circuit-wide reasoning. Our evaluation shows that Quarl significantly outperforms existing circuit optimizers on almost all benchmark circuits. Surprisingly, Qu",
    "link": "http://arxiv.org/abs/2307.10120",
    "context": "Title: Quarl: A Learning-Based Quantum Circuit Optimizer. (arXiv:2307.10120v1 [quant-ph])\nAbstract: Optimizing quantum circuits is challenging due to the very large search space of functionally equivalent circuits and the necessity of applying transformations that temporarily decrease performance to achieve a final performance improvement. This paper presents Quarl, a learning-based quantum circuit optimizer. Applying reinforcement learning (RL) to quantum circuit optimization raises two main challenges: the large and varying action space and the non-uniform state representation. Quarl addresses these issues with a novel neural architecture and RL-training procedure. Our neural architecture decomposes the action space into two parts and leverages graph neural networks in its state representation, both of which are guided by the intuition that optimization decisions can be mostly guided by local reasoning while allowing global circuit-wide reasoning. Our evaluation shows that Quarl significantly outperforms existing circuit optimizers on almost all benchmark circuits. Surprisingly, Qu",
    "path": "papers/23/07/2307.10120.json",
    "total_tokens": 917,
    "translated_title": "Quarl: 一种基于学习的量子电路优化器",
    "translated_abstract": "量子电路优化具有挑战性，因为功能等效的电路搜索空间非常大，并且必须应用暂时降低性能的转换来实现最终的性能改进。本文提出了一种名为Quarl的基于学习的量子电路优化器。将强化学习应用于量子电路优化面临两个主要挑战：庞大且变化的动作空间以及不均匀的状态表示。Quarl通过一种新颖的神经架构和强化学习训练过程来解决这些问题。我们的神经架构将动作空间分解为两个部分，并在其状态表示中利用图神经网络，这两个部分都受到本地推理主导全局电路推理的直觉指导。我们的评估表明，Quarl在几乎所有基准电路上明显优于现有的电路优化器。令人惊讶的是，Quarl不仅达到了此前的最佳水平，并且在速度上也比其他优化器更快。",
    "tldr": "Quarl是一种基于学习的量子电路优化器，通过引入新颖的神经架构和强化学习训练过程，解决了量子电路优化中的动作空间较大和非均匀状态表示的挑战。实验证明，Quarl在几乎所有基准电路上表现显著优于其他优化器，并且在速度上更快。",
    "en_tdlr": "Quarl is a learning-based quantum circuit optimizer that addresses the challenges of large action space and non-uniform state representation. It significantly outperforms existing optimizers on benchmark circuits and achieves faster performance."
}