{
    "title": "Ord2Seq: Regard Ordinal Regression as Label Sequence Prediction. (arXiv:2307.09004v1 [cs.AI])",
    "abstract": "Ordinal regression refers to classifying object instances into ordinal categories. It has been widely studied in many scenarios, such as medical disease grading, movie rating, etc. Known methods focused only on learning inter-class ordinal relationships, but still incur limitations in distinguishing adjacent categories thus far. In this paper, we propose a simple sequence prediction framework for ordinal regression called Ord2Seq, which, for the first time, transforms each ordinal category label into a special label sequence and thus regards an ordinal regression task as a sequence prediction process. In this way, we decompose an ordinal regression task into a series of recursive binary classification steps, so as to subtly distinguish adjacent categories. Comprehensive experiments show the effectiveness of distinguishing adjacent categories for performance improvement and our new approach exceeds state-of-the-art performances in four different scenarios. Codes will be available upon a",
    "link": "http://arxiv.org/abs/2307.09004",
    "context": "Title: Ord2Seq: Regard Ordinal Regression as Label Sequence Prediction. (arXiv:2307.09004v1 [cs.AI])\nAbstract: Ordinal regression refers to classifying object instances into ordinal categories. It has been widely studied in many scenarios, such as medical disease grading, movie rating, etc. Known methods focused only on learning inter-class ordinal relationships, but still incur limitations in distinguishing adjacent categories thus far. In this paper, we propose a simple sequence prediction framework for ordinal regression called Ord2Seq, which, for the first time, transforms each ordinal category label into a special label sequence and thus regards an ordinal regression task as a sequence prediction process. In this way, we decompose an ordinal regression task into a series of recursive binary classification steps, so as to subtly distinguish adjacent categories. Comprehensive experiments show the effectiveness of distinguishing adjacent categories for performance improvement and our new approach exceeds state-of-the-art performances in four different scenarios. Codes will be available upon a",
    "path": "papers/23/07/2307.09004.json",
    "total_tokens": 826,
    "translated_title": "Ord2Seq: 将序回归视为标签序列预测",
    "translated_abstract": "序回归是将对象实例分为序列类别的分类问题。在许多情况下，如医疗疾病分级、电影评分等方面已得到广泛研究。现有方法仅关注学习类间序关系，但在区分相邻类别方面仍存在局限性。本文中，我们提出了一种简单的序列预测框架，称为Ord2Seq，它首次将每个序类别标签转化为特殊的标签序列，从而将序回归任务视为序列预测过程。通过这种方式，我们将序回归任务分解为一系列递归的二元分类步骤，以微妙地区分相邻类别。全面的实验证明了区分相邻类别对性能改进的有效性，并且我们的新方法在四种不同的场景中超过了现有最先进性能。代码将在完成后提供。",
    "tldr": "Ord2Seq是一种将序回归问题转化为标签序列预测的方法，通过递归的二元分类步骤微妙地区分相邻类别，在不同场景中达到优于现有方法的性能表现。"
}