{
    "title": "Deep Cross-Modal Steganography Using Neural Representations. (arXiv:2307.08671v2 [cs.CR] UPDATED)",
    "abstract": "Steganography is the process of embedding secret data into another message or data, in such a way that it is not easily noticeable. With the advancement of deep learning, Deep Neural Networks (DNNs) have recently been utilized in steganography. However, existing deep steganography techniques are limited in scope, as they focus on specific data types and are not effective for cross-modal steganography. Therefore, We propose a deep cross-modal steganography framework using Implicit Neural Representations (INRs) to hide secret data of various formats in cover images. The proposed framework employs INRs to represent the secret data, which can handle data of various modalities and resolutions. Experiments on various secret datasets of diverse types demonstrate that the proposed approach is expandable and capable of accommodating different modalities.",
    "link": "http://arxiv.org/abs/2307.08671",
    "context": "Title: Deep Cross-Modal Steganography Using Neural Representations. (arXiv:2307.08671v2 [cs.CR] UPDATED)\nAbstract: Steganography is the process of embedding secret data into another message or data, in such a way that it is not easily noticeable. With the advancement of deep learning, Deep Neural Networks (DNNs) have recently been utilized in steganography. However, existing deep steganography techniques are limited in scope, as they focus on specific data types and are not effective for cross-modal steganography. Therefore, We propose a deep cross-modal steganography framework using Implicit Neural Representations (INRs) to hide secret data of various formats in cover images. The proposed framework employs INRs to represent the secret data, which can handle data of various modalities and resolutions. Experiments on various secret datasets of diverse types demonstrate that the proposed approach is expandable and capable of accommodating different modalities.",
    "path": "papers/23/07/2307.08671.json",
    "total_tokens": 814,
    "translated_title": "利用神经表示的深度跨模态隐写术",
    "translated_abstract": "隐写术是将秘密数据嵌入到另一条消息或数据中，以不容易被察觉的方式。随着深度学习的进步，最近在隐写术中开始利用深度神经网络（DNNs）。然而，现有的深度隐写术技术在范围上有限，因为它们只针对特定的数据类型，并且对于跨模态隐写术不够有效。因此，我们提出了一种利用隐式神经表示（INRs）进行深度跨模态隐写术的框架，可以在覆盖图像中隐藏各种格式的秘密数据。所提出的框架利用INRs来表示秘密数据，可以处理不同形式和分辨率的数据。对不同类型的秘密数据集进行的实验表明，所提出的方法是可扩展的，可以适应不同的模态。",
    "tldr": "本文提出了一种利用隐式神经表示进行深度跨模态隐写术的框架，可以隐藏各种格式的秘密数据，在实验中证明了其可扩展性和适应性。",
    "en_tdlr": "This paper proposes a framework for deep cross-modal steganography using implicit neural representations, which can hide secret data of various formats. Experimental results demonstrate its scalability and adaptability."
}