{
    "title": "RCS-YOLO: A Fast and High-Accuracy Object Detector for Brain Tumor Detection. (arXiv:2307.16412v1 [cs.CV])",
    "abstract": "With an excellent balance between speed and accuracy, cutting-edge YOLO frameworks have become one of the most efficient algorithms for object detection. However, the performance of using YOLO networks is scarcely investigated in brain tumor detection. We propose a novel YOLO architecture with Reparameterized Convolution based on channel Shuffle (RCS-YOLO). We present RCS and a One-Shot Aggregation of RCS (RCS-OSA), which link feature cascade and computation efficiency to extract richer information and reduce time consumption. Experimental results on the brain tumor dataset Br35H show that the proposed model surpasses YOLOv6, YOLOv7, and YOLOv8 in speed and accuracy. Notably, compared with YOLOv7, the precision of RCS-YOLO improves by 2.6%, and the inference speed by 60% at 114.8 images detected per second (FPS). Our proposed RCS-YOLO achieves state-of-the-art performance on the brain tumor detection task. The code is available at https://github.com/mkang315/RCS-YOLO.",
    "link": "http://arxiv.org/abs/2307.16412",
    "context": "Title: RCS-YOLO: A Fast and High-Accuracy Object Detector for Brain Tumor Detection. (arXiv:2307.16412v1 [cs.CV])\nAbstract: With an excellent balance between speed and accuracy, cutting-edge YOLO frameworks have become one of the most efficient algorithms for object detection. However, the performance of using YOLO networks is scarcely investigated in brain tumor detection. We propose a novel YOLO architecture with Reparameterized Convolution based on channel Shuffle (RCS-YOLO). We present RCS and a One-Shot Aggregation of RCS (RCS-OSA), which link feature cascade and computation efficiency to extract richer information and reduce time consumption. Experimental results on the brain tumor dataset Br35H show that the proposed model surpasses YOLOv6, YOLOv7, and YOLOv8 in speed and accuracy. Notably, compared with YOLOv7, the precision of RCS-YOLO improves by 2.6%, and the inference speed by 60% at 114.8 images detected per second (FPS). Our proposed RCS-YOLO achieves state-of-the-art performance on the brain tumor detection task. The code is available at https://github.com/mkang315/RCS-YOLO.",
    "path": "papers/23/07/2307.16412.json",
    "total_tokens": 1010,
    "translated_title": "RCS-YOLO: 一种快速且高准确性的脑肿瘤检测物体检测器",
    "translated_abstract": "随着速度和准确性之间的出色平衡，先进的YOLO框架已成为最高效的物体检测算法之一。然而，在脑肿瘤检测中，使用YOLO网络的性能很少受到研究。我们提出了一种基于Reparameterized Convolution的RCS-YOLO的新型YOLO架构。我们提出了RCS和RCS的一次性聚合(RCS-OSA)，它将特征级联和计算效率相结合，以提取更丰富的信息并减少时间消耗。在脑肿瘤数据集Br35H上的实验结果表明，所提出的模型在速度和准确性上超过了YOLOv6，YOLOv7和YOLOv8。值得注意的是，与YOLOv7相比，RCS-YOLO的精度提高了2.6％，推断速度提高了60％，达到每秒114.8张图像检测（FPS）。我们提出的RCS-YOLO在脑肿瘤检测任务上取得了最先进的性能。代码可在https://github.com/mkang315/RCS-YOLO获取。",
    "tldr": "RCS-YOLO是一种快速且高准确性的脑肿瘤检测物体检测器，通过引入Reparameterized Convolution和RCS-OSA技术，提高了YOLO框架在处理脑肿瘤检测中的性能，达到了最先进水平。",
    "en_tdlr": "RCS-YOLO is a fast and high-accuracy object detector for brain tumor detection, which improves the performance of YOLO frameworks in handling brain tumor detection by introducing Reparameterized Convolution and RCS-OSA techniques, achieving state-of-the-art performance."
}