{
    "title": "Spatio-Temporal Surrogates for Interaction of a Jet with High Explosives: Part II -- Clustering Extremely High-Dimensional Grid-Based Data. (arXiv:2307.01400v1 [cs.LG])",
    "abstract": "Building an accurate surrogate model for the spatio-temporal outputs of a computer simulation is a challenging task. A simple approach to improve the accuracy of the surrogate is to cluster the outputs based on similarity and build a separate surrogate model for each cluster. This clustering is relatively straightforward when the output at each time step is of moderate size. However, when the spatial domain is represented by a large number of grid points, numbering in the millions, the clustering of the data becomes more challenging. In this report, we consider output data from simulations of a jet interacting with high explosives. These data are available on spatial domains of different sizes, at grid points that vary in their spatial coordinates, and in a format that distributes the output across multiple files at each time step of the simulation. We first describe how we bring these data into a consistent format prior to clustering. Borrowing the idea of random projections from data",
    "link": "http://arxiv.org/abs/2307.01400",
    "context": "Title: Spatio-Temporal Surrogates for Interaction of a Jet with High Explosives: Part II -- Clustering Extremely High-Dimensional Grid-Based Data. (arXiv:2307.01400v1 [cs.LG])\nAbstract: Building an accurate surrogate model for the spatio-temporal outputs of a computer simulation is a challenging task. A simple approach to improve the accuracy of the surrogate is to cluster the outputs based on similarity and build a separate surrogate model for each cluster. This clustering is relatively straightforward when the output at each time step is of moderate size. However, when the spatial domain is represented by a large number of grid points, numbering in the millions, the clustering of the data becomes more challenging. In this report, we consider output data from simulations of a jet interacting with high explosives. These data are available on spatial domains of different sizes, at grid points that vary in their spatial coordinates, and in a format that distributes the output across multiple files at each time step of the simulation. We first describe how we bring these data into a consistent format prior to clustering. Borrowing the idea of random projections from data",
    "path": "papers/23/07/2307.01400.json",
    "total_tokens": 973,
    "translated_title": "与高爆炸物相互作用的喷气的时空替代物：第二部分--对高维栅格数据进行聚类",
    "translated_abstract": "构建一个准确的计算机模拟时空输出的替代模型是一项具有挑战性的任务。改进替代模型准确性的一种简单方法是基于相似性将输出进行聚类，并为每个聚类构建一个独立的替代模型。当每个时间步骤的输出具有中等大小时，这种聚类相对简单。然而，当空间域由数以百万计的栅格点表示时，数据的聚类变得更加困难。在本报告中，我们考虑了与高爆炸物相互作用的喷流的输出数据。这些数据在不同大小的空间域中可用，在空间坐标上变化，并以每个模拟时间步骤在多个文件中分布输出。我们首先描述了在聚类之前如何将这些数据统一为一致的格式。从数据的随机投影中借鉴了随机投影的想法",
    "tldr": "这项研究致力于解决构建喷气与高爆炸物相互作用计算机模拟的准确空间输出替代模型的挑战。通过将输出数据聚类并为每个聚类构建独立的替代模型，可以提高精度。当空间域由数百万个栅格点表示时，数据的聚类变得更加困难。",
    "en_tdlr": "This research addresses the challenge of constructing an accurate surrogate model for spatio-temporal outputs of a computer simulation of a jet interacting with high explosives. The accuracy of the surrogate is improved by clustering the output data and building separate surrogate models for each cluster. Clustering becomes more challenging when the spatial domain is represented by millions of grid points."
}