{
    "title": "Multiply Robust Estimator Circumvents Hyperparameter Tuning of Neural Network Models in Causal Inference. (arXiv:2307.10536v1 [stat.ME])",
    "abstract": "Estimation of the Average Treatment Effect (ATE) is often carried out in 2 steps, wherein the first step, the treatment and outcome are modeled, and in the second step the predictions are inserted into the ATE estimator. In the first steps, numerous models can be fit to the treatment and outcome, including using machine learning algorithms. However, it is a difficult task to choose among the hyperparameter sets which will result in the best causal effect estimation and inference. Multiply Robust (MR) estimator allows us to leverage all the first-step models in a single estimator. We show that MR estimator is $n^r$ consistent if one of the first-step treatment or outcome models is $n^r$ consistent. We also show that MR is the solution to a broad class of estimating equations, and is asymptotically normal if one of the treatment models is $\\sqrt{n}$-consistent. The standard error of MR is also calculated which does not require a knowledge of the true models in the first step. Our simulat",
    "link": "http://arxiv.org/abs/2307.10536",
    "context": "Title: Multiply Robust Estimator Circumvents Hyperparameter Tuning of Neural Network Models in Causal Inference. (arXiv:2307.10536v1 [stat.ME])\nAbstract: Estimation of the Average Treatment Effect (ATE) is often carried out in 2 steps, wherein the first step, the treatment and outcome are modeled, and in the second step the predictions are inserted into the ATE estimator. In the first steps, numerous models can be fit to the treatment and outcome, including using machine learning algorithms. However, it is a difficult task to choose among the hyperparameter sets which will result in the best causal effect estimation and inference. Multiply Robust (MR) estimator allows us to leverage all the first-step models in a single estimator. We show that MR estimator is $n^r$ consistent if one of the first-step treatment or outcome models is $n^r$ consistent. We also show that MR is the solution to a broad class of estimating equations, and is asymptotically normal if one of the treatment models is $\\sqrt{n}$-consistent. The standard error of MR is also calculated which does not require a knowledge of the true models in the first step. Our simulat",
    "path": "papers/23/07/2307.10536.json",
    "total_tokens": 938,
    "translated_title": "《在因果推断中，多重稳健估计器绕过神经网络模型的超参数调整》",
    "translated_abstract": "平均处理效应（ATE）的估计通常分为两步进行，第一步是建立处理和结果模型，第二步将预测结果插入ATE估计器。在第一步中，可以使用多种模型来拟合处理和结果，包括使用机器学习算法。然而，选择哪个超参数组会导致最佳的因果效应估计和推断是一项困难的任务。多重稳健（MR）估计器允许我们在一个单一的估计器中利用所有第一步模型。我们证明，如果其中一个第一步处理或结果模型是$n^r$一致的，MR估计器就是$n^r$一致的。我们还证明，MR是一类广义估计方程的解，并且如果其中一个处理模型是$\\sqrt{n}$-一致的话，MR是渐近正态的。计算了MR的标准错误，它不需要对第一步的真实模型有所了解。我们的模拟结果表明。。。",
    "tldr": "这项研究展示了一种名为多重稳健估计器的方法，通过在一个单一的估计器中利用多个模型，解决了选择神经网络模型中最佳超参数集的困难，以实现在因果推断中的平均处理效应估计。",
    "en_tdlr": "This research presents a method called Multiply Robust (MR) estimator, which leverages multiple models in a single estimator to address the challenge of choosing the best hyperparameter set in neural network models for estimating the Average Treatment Effect (ATE) in causal inference."
}