{
    "title": "How Curvature Enhance the Adaptation Power of Framelet GCNs. (arXiv:2307.09768v1 [cs.LG])",
    "abstract": "Graph neural network (GNN) has been demonstrated powerful in modeling graph-structured data. However, despite many successful cases of applying GNNs to various graph classification and prediction tasks, whether the graph geometrical information has been fully exploited to enhance the learning performance of GNNs is not yet well understood. This paper introduces a new approach to enhance GNN by discrete graph Ricci curvature. Specifically, the graph Ricci curvature defined on the edges of a graph measures how difficult the information transits on one edge from one node to another based on their neighborhoods. Motivated by the geometric analogy of Ricci curvature in the graph setting, we prove that by inserting the curvature information with different carefully designed transformation function $\\zeta$, several known computational issues in GNN such as over-smoothing can be alleviated in our proposed model. Furthermore, we verified that edges with very positive Ricci curvature (i.e., $\\ka",
    "link": "http://arxiv.org/abs/2307.09768",
    "context": "Title: How Curvature Enhance the Adaptation Power of Framelet GCNs. (arXiv:2307.09768v1 [cs.LG])\nAbstract: Graph neural network (GNN) has been demonstrated powerful in modeling graph-structured data. However, despite many successful cases of applying GNNs to various graph classification and prediction tasks, whether the graph geometrical information has been fully exploited to enhance the learning performance of GNNs is not yet well understood. This paper introduces a new approach to enhance GNN by discrete graph Ricci curvature. Specifically, the graph Ricci curvature defined on the edges of a graph measures how difficult the information transits on one edge from one node to another based on their neighborhoods. Motivated by the geometric analogy of Ricci curvature in the graph setting, we prove that by inserting the curvature information with different carefully designed transformation function $\\zeta$, several known computational issues in GNN such as over-smoothing can be alleviated in our proposed model. Furthermore, we verified that edges with very positive Ricci curvature (i.e., $\\ka",
    "path": "papers/23/07/2307.09768.json",
    "total_tokens": 870,
    "translated_title": "曲率如何增强Framelet图卷积网络的适应能力",
    "translated_abstract": "图神经网络（GNN）在建模图结构数据方面展示了强大的能力。然而，尽管将GNN应用于各种图分类和预测任务取得了许多成功案例，但是否完全利用了图的几何信息来提高GNN的学习性能尚不明确。本文通过离散图黎曲率引入了一种增强GNN的新方法。具体而言，定义在图边上的图黎曲率测量了信息从一个节点到另一个节点在其邻域中的传递难度。受图黎曲率在图设置中的几何类比启发，我们证明，通过插入不同的、经过精心设计的变换函数$\\zeta$的曲率信息，我们提出的模型可以缓解GNN中出现的一些已知的计算问题，例如过度平滑。此外，我们验证了具有非常正的图黎曲率（即$\\ka",
    "tldr": "本文介绍了一种通过离散图黎曲率增强图卷积网络（GNN）的新方法。通过插入经过精心设计的变换函数的曲率信息，该模型可以缓解GNN中的过度平滑等计算问题。",
    "en_tdlr": "This paper introduces a new approach to enhancing graph neural networks (GNNs) by incorporating discrete graph Ricci curvature. By inserting curvature information with carefully designed transformation functions, the proposed model addresses computational issues such as oversmoothing in GNNs."
}