{
    "title": "On the (In)Effectiveness of Large Language Models for Chinese Text Correction. (arXiv:2307.09007v1 [cs.CL])",
    "abstract": "Recently, the development and progress of Large Language Models (LLMs) have amazed the entire Artificial Intelligence community. As an outstanding representative of LLMs and the foundation model that set off this wave of research on LLMs, ChatGPT has attracted more and more researchers to study its capabilities and performance on various downstream Natural Language Processing (NLP) tasks. While marveling at ChatGPT's incredible performance on kinds of tasks, we notice that ChatGPT also has excellent multilingual processing capabilities, such as Chinese. To explore the Chinese processing ability of ChatGPT, we focus on Chinese Text Correction, a fundamental and challenging Chinese NLP task. Specifically, we evaluate ChatGPT on the Chinese Grammatical Error Correction (CGEC) and Chinese Spelling Check (CSC) tasks, which are two main Chinese Text Correction scenarios. From extensive analyses and comparisons with previous state-of-the-art fine-tuned models, we empirically find that the Cha",
    "link": "http://arxiv.org/abs/2307.09007",
    "context": "Title: On the (In)Effectiveness of Large Language Models for Chinese Text Correction. (arXiv:2307.09007v1 [cs.CL])\nAbstract: Recently, the development and progress of Large Language Models (LLMs) have amazed the entire Artificial Intelligence community. As an outstanding representative of LLMs and the foundation model that set off this wave of research on LLMs, ChatGPT has attracted more and more researchers to study its capabilities and performance on various downstream Natural Language Processing (NLP) tasks. While marveling at ChatGPT's incredible performance on kinds of tasks, we notice that ChatGPT also has excellent multilingual processing capabilities, such as Chinese. To explore the Chinese processing ability of ChatGPT, we focus on Chinese Text Correction, a fundamental and challenging Chinese NLP task. Specifically, we evaluate ChatGPT on the Chinese Grammatical Error Correction (CGEC) and Chinese Spelling Check (CSC) tasks, which are two main Chinese Text Correction scenarios. From extensive analyses and comparisons with previous state-of-the-art fine-tuned models, we empirically find that the Cha",
    "path": "papers/23/07/2307.09007.json",
    "total_tokens": 898,
    "translated_title": "关于大语言模型在中文文本纠错中的（无）效性研究",
    "translated_abstract": "最近，大语言模型（LLMs）的发展和进步令整个人工智能社区惊叹不已。作为LLMs的杰出代表和引发了对LLMs研究热潮的基础模型，ChatGPT吸引了越来越多的研究人员来研究其在各种下游自然语言处理（NLP）任务上的能力和性能。在对ChatGPT在各种任务上的惊人表现感到惊叹的同时，我们注意到ChatGPT还具有出色的多语言处理能力，例如中文。为了探索ChatGPT的中文处理能力，我们专注于中文文本纠错这个基础且具有挑战性的中文NLP任务。具体而言，我们在中文语法错误纠正（CGEC）和中文拼写检查（CSC）这两个主要的中文文本纠错场景上评估ChatGPT。通过广泛的分析和与之前最先进的微调模型的比较，我们在实证上发现ChatGPT的性能不尽如人意。",
    "tldr": "本文研究了大语言模型在中文文本纠错任务中的效果，并发现ChatGPT在中文语法错误纠正和拼写检查方面的性能表现并不理想。"
}