{
    "title": "Deep Learning with Passive Optical Nonlinear Mapping. (arXiv:2307.08558v2 [physics.optics] UPDATED)",
    "abstract": "Deep learning has fundamentally transformed artificial intelligence, but the ever-increasing complexity in deep learning models calls for specialized hardware accelerators. Optical accelerators can potentially offer enhanced performance, scalability, and energy efficiency. However, achieving nonlinear mapping, a critical component of neural networks, remains challenging optically. Here, we introduce a design that leverages multiple scattering in a reverberating cavity to passively induce optical nonlinear random mapping, without the need for additional laser power. A key advantage emerging from our work is that we show we can perform optical data compression, facilitated by multiple scattering in the cavity, to efficiently compress and retain vital information while also decreasing data dimensionality. This allows rapid optical information processing and generation of low dimensional mixtures of highly nonlinear features. These are particularly useful for applications demanding high-sp",
    "link": "http://arxiv.org/abs/2307.08558",
    "context": "Title: Deep Learning with Passive Optical Nonlinear Mapping. (arXiv:2307.08558v2 [physics.optics] UPDATED)\nAbstract: Deep learning has fundamentally transformed artificial intelligence, but the ever-increasing complexity in deep learning models calls for specialized hardware accelerators. Optical accelerators can potentially offer enhanced performance, scalability, and energy efficiency. However, achieving nonlinear mapping, a critical component of neural networks, remains challenging optically. Here, we introduce a design that leverages multiple scattering in a reverberating cavity to passively induce optical nonlinear random mapping, without the need for additional laser power. A key advantage emerging from our work is that we show we can perform optical data compression, facilitated by multiple scattering in the cavity, to efficiently compress and retain vital information while also decreasing data dimensionality. This allows rapid optical information processing and generation of low dimensional mixtures of highly nonlinear features. These are particularly useful for applications demanding high-sp",
    "path": "papers/23/07/2307.08558.json",
    "total_tokens": 850,
    "translated_title": "具有被动光学非线性映射的深度学习",
    "translated_abstract": "深度学习已经从根本上改变了人工智能，但是日益复杂的深度学习模型需要专门的硬件加速器。光学加速器可以提供增强的性能、可扩展性和能量效率。然而，实现光学中的非线性映射，这是神经网络的重要组成部分，仍然具有挑战性。在这里，我们介绍了一种设计，利用一个反射腔中的多次散射来被动诱导光学非线性随机映射，而无需额外的激光功率。我们工作的一个重要优势是我们展示了可以通过反射腔中的多次散射来进行光学数据压缩，以高效地压缩和保留重要信息，同时降低数据的维度。这使得快速的光学信息处理和生成高度非线性特征的低维混合成分成为可能。这对于需要高效处理的应用特别有用。",
    "tldr": "这项研究介绍了一种利用反射腔中的多次散射通过被动诱导光学非线性映射的设计，实现了光学数据压缩和高效处理的能力。",
    "en_tdlr": "This research introduces a design that utilizes multiple scattering in a reverberating cavity to passively induce optical nonlinear random mapping, allowing for optical data compression and efficient processing."
}