{
    "title": "Emotion Analysis on EEG Signal Using Machine Learning and Neural Network. (arXiv:2307.05375v1 [eess.SP])",
    "abstract": "Emotion has a significant influence on how one thinks and interacts with others. It serves as a link between how a person feels and the actions one takes, or it could be said that it influences one's life decisions on occasion. Since the patterns of emotions and their reflections vary from person to person, their inquiry must be based on approaches that are effective over a wide range of population regions. To extract features and enhance accuracy, emotion recognition using brain waves or EEG signals requires the implementation of efficient signal processing techniques. Various approaches to human-machine interaction technologies have been ongoing for a long time, and in recent years, researchers have had great success in automatically understanding emotion using brain signals. In our research, several emotional states were classified and tested on EEG signals collected from a well-known publicly available dataset, the DEAP Dataset, using SVM (Support Vector Machine), KNN (K-Nearest Ne",
    "link": "http://arxiv.org/abs/2307.05375",
    "context": "Title: Emotion Analysis on EEG Signal Using Machine Learning and Neural Network. (arXiv:2307.05375v1 [eess.SP])\nAbstract: Emotion has a significant influence on how one thinks and interacts with others. It serves as a link between how a person feels and the actions one takes, or it could be said that it influences one's life decisions on occasion. Since the patterns of emotions and their reflections vary from person to person, their inquiry must be based on approaches that are effective over a wide range of population regions. To extract features and enhance accuracy, emotion recognition using brain waves or EEG signals requires the implementation of efficient signal processing techniques. Various approaches to human-machine interaction technologies have been ongoing for a long time, and in recent years, researchers have had great success in automatically understanding emotion using brain signals. In our research, several emotional states were classified and tested on EEG signals collected from a well-known publicly available dataset, the DEAP Dataset, using SVM (Support Vector Machine), KNN (K-Nearest Ne",
    "path": "papers/23/07/2307.05375.json",
    "total_tokens": 880,
    "translated_title": "使用机器学习和神经网络对EEG信号进行情绪分析",
    "translated_abstract": "情绪对一个人的思考和与他人互动有着显著影响。它连接着一个人的感受和其行为，可以说它在某种程度上影响着一个人的生活决策。由于情绪的模式和反应因人而异，对其进行研究需要采用适用于广泛人群的有效方法。为了提取特征和提高准确性，情绪识别使用脑电波或EEG信号需要实施高效的信号处理技术。多种人机交互技术的方法一直在进行中，近年来，研究者们在利用脑信号自动理解情绪方面取得了巨大成功。在我们的研究中，我们使用支持向量机（SVM）和K最近邻（KNN）对从一个广为人知的公开数据集DEAP Dataset收集到的EEG信号进行了几种情感状态的分类和测试。",
    "tldr": "本研究利用机器学习和神经网络对EEG信号进行情绪分析，通过高效的信号处理技术提取特征和提高准确性，并使用支持向量机和K最近邻算法在DEAP Dataset上进行了情感状态的分类和测试。"
}