{
    "title": "CLAIMED -- the open source framework for building coarse-grained operators for accelerated discovery in science. (arXiv:2307.06824v1 [cs.AI])",
    "abstract": "In modern data-driven science, reproducibility and reusability are key challenges. Scientists are well skilled in the process from data to publication. Although some publication channels require source code and data to be made accessible, rerunning and verifying experiments is usually hard due to a lack of standards. Therefore, reusing existing scientific data processing code from state-of-the-art research is hard as well. This is why we introduce CLAIMED, which has a proven track record in scientific research for addressing the repeatability and reusability issues in modern data-driven science. CLAIMED is a framework to build reusable operators and scalable scientific workflows by supporting the scientist to draw from previous work by re-composing workflows from existing libraries of coarse-grained scientific operators. Although various implementations exist, CLAIMED is programming language, scientific library, and execution environment agnostic.",
    "link": "http://arxiv.org/abs/2307.06824",
    "context": "Title: CLAIMED -- the open source framework for building coarse-grained operators for accelerated discovery in science. (arXiv:2307.06824v1 [cs.AI])\nAbstract: In modern data-driven science, reproducibility and reusability are key challenges. Scientists are well skilled in the process from data to publication. Although some publication channels require source code and data to be made accessible, rerunning and verifying experiments is usually hard due to a lack of standards. Therefore, reusing existing scientific data processing code from state-of-the-art research is hard as well. This is why we introduce CLAIMED, which has a proven track record in scientific research for addressing the repeatability and reusability issues in modern data-driven science. CLAIMED is a framework to build reusable operators and scalable scientific workflows by supporting the scientist to draw from previous work by re-composing workflows from existing libraries of coarse-grained scientific operators. Although various implementations exist, CLAIMED is programming language, scientific library, and execution environment agnostic.",
    "path": "papers/23/07/2307.06824.json",
    "total_tokens": 836,
    "translated_title": "CLAIMED -- 在科学加速发现中构建粗粒度运算符的开放源代码框架",
    "translated_abstract": "在现代数据驱动的科学中，重复性和重用性是关键挑战。科学家在从数据到出版的过程中有着丰富的经验。尽管一些出版渠道要求源代码和数据可获得，但重新运行和验证实验通常很困难，原因是缺乏标准。因此，重用现有的科学数据处理代码来自最新研究是困难的。这就是为什么我们引入CLAIMED，它在现代数据驱动的科学中解决了重复性和可重用性问题的科学研究实践。CLAIMED是一个框架，通过支持科学家从现有的粗粒度科学运算符库中重新组合工作流程，来构建可重用的运算符和可扩展的科学工作流程。尽管有各种实现，但CLAIMED是编程语言、科学库和执行环境无关的。",
    "tldr": "CLAIMED是一个开放源代码框架，用于在现代数据驱动的科学中构建可重用的运算符和可扩展的科学工作流程，从而解决了重复性和可重用性问题。",
    "en_tdlr": "CLAIMED is an open source framework for building reusable operators and scalable scientific workflows in modern data-driven science, addressing the challenges of reproducibility and reusability."
}