{
    "title": "The Ethical Implications of Generative Audio Models: A Systematic Literature Review. (arXiv:2307.05527v1 [cs.CY])",
    "abstract": "Generative audio models typically focus their applications in music and speech generation, with recent models having human-like quality in their audio output. This paper conducts a systematic literature review of 884 papers in the area of generative audio models in order to both quantify the degree to which researchers in the field are considering potential negative impacts and identify the types of ethical implications researchers in this area need to consider. Though 65% of generative audio research papers note positive potential impacts of their work, less than 10% discuss any negative impacts. This jarringly small percentage of papers considering negative impact is particularly worrying because the issues brought to light by the few papers doing so are raising serious ethical implications and concerns relevant to the broader field such as the potential for fraud, deep-fakes, and copyright infringement. By quantifying this lack of ethical consideration in generative audio research a",
    "link": "http://arxiv.org/abs/2307.05527",
    "context": "Title: The Ethical Implications of Generative Audio Models: A Systematic Literature Review. (arXiv:2307.05527v1 [cs.CY])\nAbstract: Generative audio models typically focus their applications in music and speech generation, with recent models having human-like quality in their audio output. This paper conducts a systematic literature review of 884 papers in the area of generative audio models in order to both quantify the degree to which researchers in the field are considering potential negative impacts and identify the types of ethical implications researchers in this area need to consider. Though 65% of generative audio research papers note positive potential impacts of their work, less than 10% discuss any negative impacts. This jarringly small percentage of papers considering negative impact is particularly worrying because the issues brought to light by the few papers doing so are raising serious ethical implications and concerns relevant to the broader field such as the potential for fraud, deep-fakes, and copyright infringement. By quantifying this lack of ethical consideration in generative audio research a",
    "path": "papers/23/07/2307.05527.json",
    "total_tokens": 936,
    "translated_title": "生成音频模型的伦理影响：一项系统文献综述",
    "translated_abstract": "生成音频模型通常将其应用集中在音乐和语音生成上，近期的模型在音频输出方面具有类似人类的质量。本文对884篇生成音频模型领域的论文进行了系统性文献综述，旨在量化领域内研究者考虑潜在负面影响的程度，并确定研究者在这个领域需要考虑的伦理影响类型。虽然65%的生成音频研究论文提到了他们工作的积极潜力，但不到10%的论文讨论了任何负面影响。这个惊人的小比例使人担忧，因为少数提到负面影响的论文揭示了在更大范围领域内相关的严重伦理问题和关切，如欺诈、假脸和侵权潜能。通过量化生成音频研究中缺乏伦理考虑的现状，这篇论文呼吁研究者在格外关注这些伦理问题上做出努力。",
    "tldr": "这项研究对生成音频模型的伦理影响进行了系统文献综述，发现当前有较少论文讨论负面影响，但其中引发了重大的伦理问题，如欺诈、假脸和侵权潜能。"
}