{
    "title": "Event Extraction as Question Generation and Answering. (arXiv:2307.05567v1 [cs.CL])",
    "abstract": "Recent work on Event Extraction has reframed the task as Question Answering (QA), with promising results. The advantage of this approach is that it addresses the error propagation issue found in traditional token-based classification approaches by directly predicting event arguments without extracting candidates first. However, the questions are typically based on fixed templates and they rarely leverage contextual information such as relevant arguments. In addition, prior QA-based approaches have difficulty handling cases where there are multiple arguments for the same role. In this paper, we propose QGA-EE, which enables a Question Generation (QG) model to generate questions that incorporate rich contextual information instead of using fixed templates. We also propose dynamic templates to assist the training of QG model. Experiments show that QGA-EE outperforms all prior single-task-based models on the ACE05 English dataset.",
    "link": "http://arxiv.org/abs/2307.05567",
    "context": "Title: Event Extraction as Question Generation and Answering. (arXiv:2307.05567v1 [cs.CL])\nAbstract: Recent work on Event Extraction has reframed the task as Question Answering (QA), with promising results. The advantage of this approach is that it addresses the error propagation issue found in traditional token-based classification approaches by directly predicting event arguments without extracting candidates first. However, the questions are typically based on fixed templates and they rarely leverage contextual information such as relevant arguments. In addition, prior QA-based approaches have difficulty handling cases where there are multiple arguments for the same role. In this paper, we propose QGA-EE, which enables a Question Generation (QG) model to generate questions that incorporate rich contextual information instead of using fixed templates. We also propose dynamic templates to assist the training of QG model. Experiments show that QGA-EE outperforms all prior single-task-based models on the ACE05 English dataset.",
    "path": "papers/23/07/2307.05567.json",
    "total_tokens": 802,
    "translated_title": "事件提取作为问题生成和回答的方法",
    "translated_abstract": "近期对于事件提取的研究将任务重新定义为问题回答 (QA)，并取得了有望的结果。这种方法的优势在于它通过直接预测事件参数而不是先提取候选项，从而解决了传统基于标记的分类方法中的错误传播问题。然而，这些问题通常基于固定模板，并且很少利用相关参数等语境信息。此外，现有的QA方法在处理同一角色有多个参数的情况下存在困难。在本文中，我们提出了一种名为QGA-EE的方法，它使问题生成模型能够生成包含丰富上下文信息而不是使用固定模板的问题。我们还提出了动态模板来辅助问题生成模型的训练。实验证明，QGA-EE在ACE05英文数据集上优于所有之前单任务模型。",
    "tldr": "本文提出了一种名为QGA-EE的方法，该方法通过问题生成和回答的方式进行事件提取，解决了传统方法中的错误传播问题，并且在预测事件参数上取得了更好的表现。"
}