{
    "title": "A Novel Truncated Norm Regularization Method for Multi-channel Color Image Denoising. (arXiv:2307.07932v1 [eess.IV])",
    "abstract": "Due to the high flexibility and remarkable performance, low-rank approximation methods has been widely studied for color image denoising. However, those methods mostly ignore either the cross-channel difference or the spatial variation of noise, which limits their capacity in real world color image denoising. To overcome those drawbacks, this paper is proposed to denoise color images with a double-weighted truncated nuclear norm minus truncated Frobenius norm minimization (DtNFM) method. Through exploiting the nonlocal self-similarity of the noisy image, the similar structures are gathered and a series of similar patch matrices are constructed. For each group, the DtNFM model is conducted for estimating its denoised version. The denoised image would be obtained by concatenating all the denoised patch matrices. The proposed DtNFM model has two merits. First, it models and utilizes both the cross-channel difference and the spatial variation of noise. This provides sufficient flexibility ",
    "link": "http://arxiv.org/abs/2307.07932",
    "context": "Title: A Novel Truncated Norm Regularization Method for Multi-channel Color Image Denoising. (arXiv:2307.07932v1 [eess.IV])\nAbstract: Due to the high flexibility and remarkable performance, low-rank approximation methods has been widely studied for color image denoising. However, those methods mostly ignore either the cross-channel difference or the spatial variation of noise, which limits their capacity in real world color image denoising. To overcome those drawbacks, this paper is proposed to denoise color images with a double-weighted truncated nuclear norm minus truncated Frobenius norm minimization (DtNFM) method. Through exploiting the nonlocal self-similarity of the noisy image, the similar structures are gathered and a series of similar patch matrices are constructed. For each group, the DtNFM model is conducted for estimating its denoised version. The denoised image would be obtained by concatenating all the denoised patch matrices. The proposed DtNFM model has two merits. First, it models and utilizes both the cross-channel difference and the spatial variation of noise. This provides sufficient flexibility ",
    "path": "papers/23/07/2307.07932.json",
    "total_tokens": 917,
    "translated_title": "一种新颖的多通道彩色图像去噪的截断范数正则化方法",
    "translated_abstract": "鉴于低秩逼近方法具有高度的灵活性和显著的性能，在彩色图像去噪方面得到了广泛的研究。然而，这些方法大多忽略了跨通道差异或噪声的空间变化，这限制了它们在实际彩色图像去噪中的能力。为了克服这些缺点，本文提出了一种双加权截断核范数减去截断Frobenius范数最小化（DtNFM）的方法来去噪彩色图像。通过利用噪声图像的非局部自相似性，相似结构被收集并构造了一系列相似的块矩阵。对于每个分组，对其进行DtNFM模型来估计其去噪版本。通过连接所有去噪块矩阵，得到去噪图像。这种提出的DtNFM模型有两个优点。首先，它对跨通道差异和噪声的空间变化进行了建模和利用。这提供了足够的灵活性。",
    "tldr": "一种新颖的多通道彩色图像去噪方法，通过双加权截断核范数减去截断Frobenius范数最小化，利用非局部自相似性来提取相似的结构进行去噪，模型兼顾了跨通道差异和噪声的空间变化。"
}