{
    "title": "SAHAAYAK 2023 -- the Multi Domain Bilingual Parallel Corpus of Sanskrit to Hindi for Machine Translation. (arXiv:2307.00021v1 [cs.CL])",
    "abstract": "The data article presents the large bilingual parallel corpus of low-resourced language pair Sanskrit-Hindi, named SAHAAYAK 2023. The corpus contains total of 1.5M sentence pairs between Sanskrit and Hindi. To make the universal usability of the corpus and to make it balanced, data from multiple domain has been incorporated into the corpus that includes, News, Daily conversations, Politics, History, Sport, and Ancient Indian Literature. The multifaceted approach has been adapted to make a sizable multi-domain corpus of low-resourced languages like Sanskrit. Our development approach is spanned from creating a small hand-crafted dataset to applying a wide range of mining, cleaning, and verification. We have used the three-fold process of mining: mining from machine-readable sources, mining from non-machine readable sources, and collation from existing corpora sources. Post mining, the dedicated pipeline for normalization, alignment, and corpus cleaning is developed and applied to the cor",
    "link": "http://arxiv.org/abs/2307.00021",
    "context": "Title: SAHAAYAK 2023 -- the Multi Domain Bilingual Parallel Corpus of Sanskrit to Hindi for Machine Translation. (arXiv:2307.00021v1 [cs.CL])\nAbstract: The data article presents the large bilingual parallel corpus of low-resourced language pair Sanskrit-Hindi, named SAHAAYAK 2023. The corpus contains total of 1.5M sentence pairs between Sanskrit and Hindi. To make the universal usability of the corpus and to make it balanced, data from multiple domain has been incorporated into the corpus that includes, News, Daily conversations, Politics, History, Sport, and Ancient Indian Literature. The multifaceted approach has been adapted to make a sizable multi-domain corpus of low-resourced languages like Sanskrit. Our development approach is spanned from creating a small hand-crafted dataset to applying a wide range of mining, cleaning, and verification. We have used the three-fold process of mining: mining from machine-readable sources, mining from non-machine readable sources, and collation from existing corpora sources. Post mining, the dedicated pipeline for normalization, alignment, and corpus cleaning is developed and applied to the cor",
    "path": "papers/23/07/2307.00021.json",
    "total_tokens": 957,
    "translated_title": "SAHAAYAK 2023 -- 多领域梵语到印地语机器翻译平行语料库",
    "translated_abstract": "该数据文章介绍了一种大型稀缺语言对梵语-印地语的双语平行语料库，名为SAHAAYAK 2023。该语料库包含了150万个梵语和印地语之间的句子对。为了使该语料库具有普适性并保持平衡，我们将来自多个领域的数据纳入了该语料库中，包括新闻、日常对话、政治、历史、体育和古代印度文学。我们采用了多方面的方法，以制作一种规模可观的梵语等稀缺语言的多领域语料库。我们的开发方法从创建一个小型手工数据集开始，然后应用了广泛的挖掘、清洗和验证技术。我们使用了三重挖掘过程：从机器可读源中挖掘、从非机器可读源中挖掘以及从现有语料库源中整理。在挖掘后，我们开发了专用的标准化、对齐和语料库清洗流程，并将其应用于该语料库。",
    "tldr": "SAHAAYAK 2023是一个包含多个领域数据的梵语到印地语的大规模双语平行语料库，该语料库通过多方面的方法制作，将具有普适性和平衡性的数据纳入其中，并应用了广泛的挖掘和清洗技术。",
    "en_tdlr": "SAHAAYAK 2023 is a large bilingual parallel corpus of Sanskrit to Hindi, which incorporates data from multiple domains and utilizes various mining and cleaning techniques to ensure universal usability and balance."
}