{
    "title": "TimeTuner: Diagnosing Time Representations for Time-Series Forecasting with Counterfactual Explanations. (arXiv:2307.09916v1 [cs.HC])",
    "abstract": "Deep learning (DL) approaches are being increasingly used for time-series forecasting, with many efforts devoted to designing complex DL models. Recent studies have shown that the DL success is often attributed to effective data representations, fostering the fields of feature engineering and representation learning. However, automated approaches for feature learning are typically limited with respect to incorporating prior knowledge, identifying interactions among variables, and choosing evaluation metrics to ensure that the models are reliable. To improve on these limitations, this paper contributes a novel visual analytics framework, namely TimeTuner, designed to help analysts understand how model behaviors are associated with localized correlations, stationarity, and granularity of time-series representations. The system mainly consists of the following two-stage technique: We first leverage counterfactual explanations to connect the relationships among time-series representations,",
    "link": "http://arxiv.org/abs/2307.09916",
    "context": "Title: TimeTuner: Diagnosing Time Representations for Time-Series Forecasting with Counterfactual Explanations. (arXiv:2307.09916v1 [cs.HC])\nAbstract: Deep learning (DL) approaches are being increasingly used for time-series forecasting, with many efforts devoted to designing complex DL models. Recent studies have shown that the DL success is often attributed to effective data representations, fostering the fields of feature engineering and representation learning. However, automated approaches for feature learning are typically limited with respect to incorporating prior knowledge, identifying interactions among variables, and choosing evaluation metrics to ensure that the models are reliable. To improve on these limitations, this paper contributes a novel visual analytics framework, namely TimeTuner, designed to help analysts understand how model behaviors are associated with localized correlations, stationarity, and granularity of time-series representations. The system mainly consists of the following two-stage technique: We first leverage counterfactual explanations to connect the relationships among time-series representations,",
    "path": "papers/23/07/2307.09916.json",
    "total_tokens": 838,
    "translated_title": "TimeTuner: 诊断时间序列预测中的时间表示的对照解释",
    "translated_abstract": "深度学习方法在时间序列预测中的应用越来越多，许多努力致力于设计复杂的深度学习模型。最近的研究表明，深度学习的成功往往归因于有效的数据表示，促进了特征工程和表示学习领域的发展。然而，自动化特征学习方法通常在融入先验知识、识别变量间相互作用和选择评估指标以确保模型可靠性方面存在局限性。为了改善这些限制，本文提出了一种新颖的可视化分析框架，即TimeTuner，旨在帮助分析人员理解模型行为与时间序列表示的局部相关性、平稳性和粒度之间的关联。该系统主要包括以下两个阶段技术：我们首先利用对照解释来建立时间序列表示之间的关系，",
    "tldr": "TimeTuner是一个新颖的可视化分析框架，旨在帮助分析人员理解时间序列预测中模型行为与时间表示的关系，并解决自动化特征学习方法的局限性。",
    "en_tdlr": "TimeTuner is a novel visual analytics framework designed to help analysts understand the relationship between model behavior and time representations in time-series forecasting, addressing the limitations of automated feature learning methods."
}