{
    "title": "randomHAR: Improving Ensemble Deep Learners for Human Activity Recognition with Sensor Selection and Reinforcement Learning. (arXiv:2307.07770v1 [cs.LG])",
    "abstract": "Deep learning has proven to be an effective approach in the field of Human activity recognition (HAR), outperforming other architectures that require manual feature engineering. Despite recent advancements, challenges inherent to HAR data, such as noisy data, intra-class variability and inter-class similarity, remain. To address these challenges, we propose an ensemble method, called randomHAR. The general idea behind randomHAR is training a series of deep learning models with the same architecture on randomly selected sensor data from the given dataset. Besides, an agent is trained with the reinforcement learning algorithm to identify the optimal subset of the trained models that are utilized for runtime prediction. In contrast to existing work, this approach optimizes the ensemble process rather than the architecture of the constituent models. To assess the performance of the approach, we compare it against two HAR algorithms, including the current state of the art, on six HAR benchm",
    "link": "http://arxiv.org/abs/2307.07770",
    "context": "Title: randomHAR: Improving Ensemble Deep Learners for Human Activity Recognition with Sensor Selection and Reinforcement Learning. (arXiv:2307.07770v1 [cs.LG])\nAbstract: Deep learning has proven to be an effective approach in the field of Human activity recognition (HAR), outperforming other architectures that require manual feature engineering. Despite recent advancements, challenges inherent to HAR data, such as noisy data, intra-class variability and inter-class similarity, remain. To address these challenges, we propose an ensemble method, called randomHAR. The general idea behind randomHAR is training a series of deep learning models with the same architecture on randomly selected sensor data from the given dataset. Besides, an agent is trained with the reinforcement learning algorithm to identify the optimal subset of the trained models that are utilized for runtime prediction. In contrast to existing work, this approach optimizes the ensemble process rather than the architecture of the constituent models. To assess the performance of the approach, we compare it against two HAR algorithms, including the current state of the art, on six HAR benchm",
    "path": "papers/23/07/2307.07770.json",
    "total_tokens": 861,
    "translated_title": "randomHAR：利用传感器选择和强化学习改进人体活动识别的集成深度学习方法",
    "translated_abstract": "深度学习已经证明是人体活动识别（HAR）领域中一种有效的方法，优于其他需要手动特征工程的架构。尽管近年来取得了一些进展，但HAR数据固有的挑战，如噪声数据、类内变异性和类间相似性仍然存在。为了解决这些挑战，我们提出了一种集成方法，称为randomHAR。randomHAR的主要思想是，在给定数据集上从随机选择的传感器数据上训练一系列具有相同架构的深度学习模型。此外，我们还使用强化学习算法训练一个Agent来确定在运行时预测中使用的最优子模型集。与现有的工作相比，该方法优化的是集成过程而不是组成模型的架构。为了评估该方法的性能，我们将其与两种HAR算法进行了比较，包括当前的最新技术，在六个HAR基准数据集上进行评估。",
    "tldr": "randomHAR是一种集成深度学习方法，利用传感器选择和强化学习优化了人体活动识别，提高了性能。",
    "en_tdlr": "randomHAR is an ensemble deep learning method that improves human activity recognition with sensor selection and reinforcement learning, achieving better performance."
}