{
    "title": "A Survey From Distributed Machine Learning to Distributed Deep Learning. (arXiv:2307.05232v1 [cs.LG])",
    "abstract": "Artificial intelligence has achieved significant success in handling complex tasks in recent years. This success is due to advances in machine learning algorithms and hardware acceleration. In order to obtain more accurate results and solve more complex problems, algorithms must be trained with more data. This huge amount of data could be time-consuming to process and require a great deal of computation. This solution could be achieved by distributing the data and algorithm across several machines, which is known as distributed machine learning. There has been considerable effort put into distributed machine learning algorithms, and different methods have been proposed so far. In this article, we present a comprehensive summary of the current state-of-the-art in the field through the review of these algorithms. We divide this algorithms in classification and clustering (traditional machine learning), deep learning and deep reinforcement learning groups. Distributed deep learning has ga",
    "link": "http://arxiv.org/abs/2307.05232",
    "context": "Title: A Survey From Distributed Machine Learning to Distributed Deep Learning. (arXiv:2307.05232v1 [cs.LG])\nAbstract: Artificial intelligence has achieved significant success in handling complex tasks in recent years. This success is due to advances in machine learning algorithms and hardware acceleration. In order to obtain more accurate results and solve more complex problems, algorithms must be trained with more data. This huge amount of data could be time-consuming to process and require a great deal of computation. This solution could be achieved by distributing the data and algorithm across several machines, which is known as distributed machine learning. There has been considerable effort put into distributed machine learning algorithms, and different methods have been proposed so far. In this article, we present a comprehensive summary of the current state-of-the-art in the field through the review of these algorithms. We divide this algorithms in classification and clustering (traditional machine learning), deep learning and deep reinforcement learning groups. Distributed deep learning has ga",
    "path": "papers/23/07/2307.05232.json",
    "total_tokens": 842,
    "translated_title": "从分布式机器学习到分布式深度学习的调查",
    "translated_abstract": "近年来，人工智能在处理复杂任务方面取得了重大成功。这一成功归功于机器学习算法和硬件加速的进步。为了获得更准确的结果和解决更复杂的问题，算法必须用更多的数据进行训练。这么大量的数据可能需要消耗大量的时间和计算资源来处理。通过将数据和算法分布在多台机器上，可以实现这个解决方案，这被称为分布式机器学习。在分布式机器学习算法方面，已经投入了相当多的努力，目前已经提出了不同的方法。本文通过对这些算法的综述，对该领域的最新状态进行全面总结。我们将这些算法分成分类和聚类（传统机器学习）、深度学习和深度强化学习几组。分布式深度学习的研究也取得了显著的进展。",
    "tldr": "这篇综述论文介绍了分布式机器学习和分布式深度学习的研究现状和方法，强调了分布式深度学习在解决复杂问题方面取得的重要进展。"
}