{
    "title": "Many-objective Optimization via Voting for Elites. (arXiv:2307.02661v1 [cs.NE])",
    "abstract": "Real-world problems are often comprised of many objectives and require solutions that carefully trade-off between them. Current approaches to many-objective optimization often require challenging assumptions, like knowledge of the importance/difficulty of objectives in a weighted-sum single-objective paradigm, or enormous populations to overcome the curse of dimensionality in multi-objective Pareto optimization. Combining elements from Many-Objective Evolutionary Algorithms and Quality Diversity algorithms like MAP-Elites, we propose Many-objective Optimization via Voting for Elites (MOVE). MOVE maintains a map of elites that perform well on different subsets of the objective functions. On a 14-objective image-neuroevolution problem, we demonstrate that MOVE is viable with a population of as few as 50 elites and outperforms a naive single-objective baseline. We find that the algorithm's performance relies on solutions jumping across bins (for a parent to produce a child that is elite f",
    "link": "http://arxiv.org/abs/2307.02661",
    "context": "Title: Many-objective Optimization via Voting for Elites. (arXiv:2307.02661v1 [cs.NE])\nAbstract: Real-world problems are often comprised of many objectives and require solutions that carefully trade-off between them. Current approaches to many-objective optimization often require challenging assumptions, like knowledge of the importance/difficulty of objectives in a weighted-sum single-objective paradigm, or enormous populations to overcome the curse of dimensionality in multi-objective Pareto optimization. Combining elements from Many-Objective Evolutionary Algorithms and Quality Diversity algorithms like MAP-Elites, we propose Many-objective Optimization via Voting for Elites (MOVE). MOVE maintains a map of elites that perform well on different subsets of the objective functions. On a 14-objective image-neuroevolution problem, we demonstrate that MOVE is viable with a population of as few as 50 elites and outperforms a naive single-objective baseline. We find that the algorithm's performance relies on solutions jumping across bins (for a parent to produce a child that is elite f",
    "path": "papers/23/07/2307.02661.json",
    "total_tokens": 904,
    "translated_title": "多目标优化通过对精英进行投票",
    "translated_abstract": "实际问题通常由多个目标组成，并且需要在这些目标之间进行权衡的解决方案。目前的多目标优化方法通常需要具备挑战性的假设，如对目标的重要性/难度在加权求和的单目标范式中进行了解，或通过庞大的种群来克服多目标帕累托优化中的维度灾难。结合多目标进化算法和MAP-Elites等质量多样性算法的元素，我们提出了多目标优化通过对精英进行投票（MOVE）的方法。MOVE通过维护在不同目标函数子集上表现良好的精英映射来解决问题。在一个包含14个目标的图像神经演化问题上，我们证明MOVE在只具有50个精英的种群情况下是可行的，并且优于一个简单的单目标基线。我们发现算法的性能依赖于解决方案在不同桶之间跳转（以使一个父代产生一个属于精英集合的子代）。",
    "tldr": "创新点：提出了多目标优化通过对精英进行投票（MOVE）的方法，结合多目标进化算法和质量多样性算法的元素，在解决多目标优化问题时具有较好的性能表现。",
    "en_tdlr": "Innovation: Proposed a method called Many-objective Optimization via Voting for Elites (MOVE) that combines elements from Many-Objective Evolutionary Algorithms and Quality Diversity algorithms. MOVE performs well in solving many-objective optimization problems by maintaining a map of elites that perform well on different subsets of the objective functions."
}