{
    "title": "Stochastic Delay Differential Games: Financial Modeling and Machine Learning Algorithms. (arXiv:2307.06450v1 [math.OC])",
    "abstract": "In this paper, we propose a numerical methodology for finding the closed-loop Nash equilibrium of stochastic delay differential games through deep learning. These games are prevalent in finance and economics where multi-agent interaction and delayed effects are often desired features in a model, but are introduced at the expense of increased dimensionality of the problem. This increased dimensionality is especially significant as that arising from the number of players is coupled with the potential infinite dimensionality caused by the delay. Our approach involves parameterizing the controls of each player using distinct recurrent neural networks. These recurrent neural network-based controls are then trained using a modified version of Brown's fictitious play, incorporating deep learning techniques. To evaluate the effectiveness of our methodology, we test it on finance-related problems with known solutions. Furthermore, we also develop new problems and derive their analytical Nash eq",
    "link": "http://arxiv.org/abs/2307.06450",
    "context": "Title: Stochastic Delay Differential Games: Financial Modeling and Machine Learning Algorithms. (arXiv:2307.06450v1 [math.OC])\nAbstract: In this paper, we propose a numerical methodology for finding the closed-loop Nash equilibrium of stochastic delay differential games through deep learning. These games are prevalent in finance and economics where multi-agent interaction and delayed effects are often desired features in a model, but are introduced at the expense of increased dimensionality of the problem. This increased dimensionality is especially significant as that arising from the number of players is coupled with the potential infinite dimensionality caused by the delay. Our approach involves parameterizing the controls of each player using distinct recurrent neural networks. These recurrent neural network-based controls are then trained using a modified version of Brown's fictitious play, incorporating deep learning techniques. To evaluate the effectiveness of our methodology, we test it on finance-related problems with known solutions. Furthermore, we also develop new problems and derive their analytical Nash eq",
    "path": "papers/23/07/2307.06450.json",
    "total_tokens": 867,
    "translated_title": "随机时滞微分博弈：金融模型和机器学习算法",
    "translated_abstract": "本文提出了一种通过深度学习方法找到随机时滞微分博弈闭环纳什均衡的数值方法。这些博弈在金融和经济学中很常见，多智能体相互作用和延迟效应往往是模型中希望的特征，但这也会增加问题的维度。我们的方法涉及使用不同的循环神经网络对每个玩家的控制进行参数化。然后，我们使用修改后的布朗虚拟博弈结合深度学习技术对这些循环神经网络控制进行训练。为了评估我们方法的有效性，我们在已知解的金融相关问题上进行了测试。此外，我们还开发了新的问题并推导出它们的分析纳什均衡。",
    "tldr": "本文提出了一种使用深度学习方法找到随机时滞微分博弈闭环纳什均衡的数值方法，通过循环神经网络对每个玩家的控制进行参数化并使用修改后的布朗虚拟博弈结合深度学习技术进行训练。"
}