{
    "title": "Self-Supervised Learning for Improved Synthetic Aperture Sonar Target Recognition. (arXiv:2307.15098v1 [cs.CV])",
    "abstract": "This study explores the application of self-supervised learning (SSL) for improved target recognition in synthetic aperture sonar (SAS) imagery. The unique challenges of underwater environments make traditional computer vision techniques, which rely heavily on optical camera imagery, less effective. SAS, with its ability to generate high-resolution imagery, emerges as a preferred choice for underwater imaging. However, the voluminous high-resolution SAS data presents a significant challenge for labeling; a crucial step for training deep neural networks (DNNs).  SSL, which enables models to learn features in data without the need for labels, is proposed as a potential solution to the data labeling challenge in SAS. The study evaluates the performance of two prominent SSL algorithms, MoCov2 and BYOL, against the well-regarded supervised learning model, ResNet18, for binary image classification tasks. The findings suggest that while both SSL models can outperform a fully supervised model ",
    "link": "http://arxiv.org/abs/2307.15098",
    "context": "Title: Self-Supervised Learning for Improved Synthetic Aperture Sonar Target Recognition. (arXiv:2307.15098v1 [cs.CV])\nAbstract: This study explores the application of self-supervised learning (SSL) for improved target recognition in synthetic aperture sonar (SAS) imagery. The unique challenges of underwater environments make traditional computer vision techniques, which rely heavily on optical camera imagery, less effective. SAS, with its ability to generate high-resolution imagery, emerges as a preferred choice for underwater imaging. However, the voluminous high-resolution SAS data presents a significant challenge for labeling; a crucial step for training deep neural networks (DNNs).  SSL, which enables models to learn features in data without the need for labels, is proposed as a potential solution to the data labeling challenge in SAS. The study evaluates the performance of two prominent SSL algorithms, MoCov2 and BYOL, against the well-regarded supervised learning model, ResNet18, for binary image classification tasks. The findings suggest that while both SSL models can outperform a fully supervised model ",
    "path": "papers/23/07/2307.15098.json",
    "total_tokens": 963,
    "translated_title": "提高合成孔径声纳目标识别的自监督学习",
    "translated_abstract": "本研究探讨了在合成孔径声纳（SAS）图像中应用自监督学习（SSL）以提高目标识别的应用。水下环境的独特挑战使得传统的依赖于光学相机图像的计算机视觉技术效果较差。SAS凭借其生成高分辨率图像的能力成为水下成像的首选。然而，庞大的高分辨率SAS数据对于标注来说是一个重要挑战，而标注是训练深度神经网络（DNNs）的关键步骤。自监督学习（SSL）被提出作为解决SAS数据标注挑战的潜在解决方案，它使得模型能够在没有标签的数据中学习特征。本研究评估了两种主要的自监督学习算法MoCov2和BYOL在二进制图像分类任务中与备受认可的有监督学习模型ResNet18的性能。研究结果表明，两种SSL模型都能胜过完全有监督的模型。",
    "tldr": "本研究探索了在合成孔径声纳（SAS）图像中应用自监督学习（SSL）进行目标识别的方法，并评估了两种自监督学习算法的性能。研究结果表明，SSL模型可以在没有标签的数据中学习特征，提高目标识别的效果。",
    "en_tdlr": "This study explores the application of self-supervised learning (SSL) for improved target recognition in synthetic aperture sonar (SAS) imagery. The findings suggest that SSL models can learn features in unlabeled data and improve target recognition performance."
}