{
    "title": "FIS-ONE: Floor Identification System with One Label for Crowdsourced RF Signals. (arXiv:2307.05914v1 [cs.NI])",
    "abstract": "Floor labels of crowdsourced RF signals are crucial for many smart-city applications, such as multi-floor indoor localization, geofencing, and robot surveillance. To build a prediction model to identify the floor number of a new RF signal upon its measurement, conventional approaches using the crowdsourced RF signals assume that at least few labeled signal samples are available on each floor. In this work, we push the envelope further and demonstrate that it is technically feasible to enable such floor identification with only one floor-labeled signal sample on the bottom floor while having the rest of signal samples unlabeled.  We propose FIS-ONE, a novel floor identification system with only one labeled sample. FIS-ONE consists of two steps, namely signal clustering and cluster indexing. We first build a bipartite graph to model the RF signal samples and obtain a latent representation of each node (each signal sample) using our attention-based graph neural network model so that the R",
    "link": "http://arxiv.org/abs/2307.05914",
    "context": "Title: FIS-ONE: Floor Identification System with One Label for Crowdsourced RF Signals. (arXiv:2307.05914v1 [cs.NI])\nAbstract: Floor labels of crowdsourced RF signals are crucial for many smart-city applications, such as multi-floor indoor localization, geofencing, and robot surveillance. To build a prediction model to identify the floor number of a new RF signal upon its measurement, conventional approaches using the crowdsourced RF signals assume that at least few labeled signal samples are available on each floor. In this work, we push the envelope further and demonstrate that it is technically feasible to enable such floor identification with only one floor-labeled signal sample on the bottom floor while having the rest of signal samples unlabeled.  We propose FIS-ONE, a novel floor identification system with only one labeled sample. FIS-ONE consists of two steps, namely signal clustering and cluster indexing. We first build a bipartite graph to model the RF signal samples and obtain a latent representation of each node (each signal sample) using our attention-based graph neural network model so that the R",
    "path": "papers/23/07/2307.05914.json",
    "total_tokens": 949,
    "translated_title": "FIS-ONE: 使用一个标签的众包RF信号楼层识别系统",
    "translated_abstract": "众包RF信号的楼层标签对于许多智慧城市应用非常重要，例如多楼层室内定位、地理围栏和机器人监控。传统方法使用众包RF信号进行楼层号码的识别模型建设时，假设每个楼层至少有几个带有标签的信号样本。在这项工作中，我们进一步突破界限，并且证明只需要一个带有标签的底层信号样本以及其余的信号样本不带标签也可以实现楼层识别。我们提出了一种新颖的FIS-ONE楼层识别系统，只使用一个带有标签的样本。FIS-ONE包括两个步骤，即信号聚类和聚类索引。我们首先构建一个二分图来建模RF信号样本，并使用基于注意力的图神经网络模型获得每个节点（每个信号样本）的潜在表示，以便实现楼层识别。",
    "tldr": "这项研究提出了FIS-ONE，一种使用一个标签的众包RF信号楼层识别系统。通过信号聚类和聚类索引的步骤，我们证明了仅使用一个底层带有标签的信号样本，以及其余的样本不带标签，也能实现有效的楼层识别。",
    "en_tdlr": "This research proposes FIS-ONE, a floor identification system for crowdsourced RF signals with only one labeled sample. Through the steps of signal clustering and cluster indexing, we demonstrate that effective floor identification can be achieved with just one labeled sample on the bottom floor and the rest of the samples unlabeled."
}