{
    "title": "Towards Ubiquitous Semantic Metaverse: Challenges, Approaches, and Opportunities. (arXiv:2307.06687v1 [cs.HC])",
    "abstract": "In recent years, ubiquitous semantic Metaverse has been studied to revolutionize immersive cyber-virtual experiences for augmented reality (AR) and virtual reality (VR) users, which leverages advanced semantic understanding and representation to enable seamless, context-aware interactions within mixed-reality environments. This survey focuses on the intelligence and spatio-temporal characteristics of four fundamental system components in ubiquitous semantic Metaverse, i.e., artificial intelligence (AI), spatio-temporal data representation (STDR), semantic Internet of Things (SIoT), and semantic-enhanced digital twin (SDT). We thoroughly survey the representative techniques of the four fundamental system components that enable intelligent, personalized, and context-aware interactions with typical use cases of the ubiquitous semantic Metaverse, such as remote education, work and collaboration, entertainment and socialization, healthcare, and e-commerce marketing. Furthermore, we outline ",
    "link": "http://arxiv.org/abs/2307.06687",
    "context": "Title: Towards Ubiquitous Semantic Metaverse: Challenges, Approaches, and Opportunities. (arXiv:2307.06687v1 [cs.HC])\nAbstract: In recent years, ubiquitous semantic Metaverse has been studied to revolutionize immersive cyber-virtual experiences for augmented reality (AR) and virtual reality (VR) users, which leverages advanced semantic understanding and representation to enable seamless, context-aware interactions within mixed-reality environments. This survey focuses on the intelligence and spatio-temporal characteristics of four fundamental system components in ubiquitous semantic Metaverse, i.e., artificial intelligence (AI), spatio-temporal data representation (STDR), semantic Internet of Things (SIoT), and semantic-enhanced digital twin (SDT). We thoroughly survey the representative techniques of the four fundamental system components that enable intelligent, personalized, and context-aware interactions with typical use cases of the ubiquitous semantic Metaverse, such as remote education, work and collaboration, entertainment and socialization, healthcare, and e-commerce marketing. Furthermore, we outline ",
    "path": "papers/23/07/2307.06687.json",
    "total_tokens": 933,
    "translated_title": "走向普遍的语义元宇宙：挑战、方法和机遇",
    "translated_abstract": "近年来，普遍的语义元宇宙被研究用来革新增强现实（AR）和虚拟现实（VR）用户的沉浸式网络虚拟体验，利用先进的语义理解与表示来实现在混合现实环境中的无缝、上下文感知的交互。本调查重点关注普遍的语义元宇宙中四个基本系统组件的智能和时空特征，即人工智能（AI）、时空数据表示（STDR）、语义物联网（SIoT）和语义增强数字孪生（SDT）。我们全面调查了这四个基本系统组件的典型技术，使得在普遍的语义元宇宙中能够进行智能、个性化、上下文感知的交互，并给出了典型的使用案例，如远程教育、工作与协作、娱乐与社交、医疗保健和电子商务营销等。",
    "tldr": "走向普遍的语义元宇宙：通过人工智能、时空数据表示、语义物联网和语义增强数字孪生实现的智能、上下文感知的交互技术，在远程教育、工作与协作、娱乐与社交、医疗保健和电子商务营销等领域具有重要应用价值。"
}