{
    "title": "Predictive modeling of brain tumor: A Deep learning approach. (arXiv:1911.02265v6 [cs.CV] UPDATED)",
    "abstract": "Image processing concepts can visualize the different anatomy structure of the human body. Recent advancements in the field of deep learning have made it possible to detect the growth of cancerous tissue just by a patient's brain Magnetic Resonance Imaging (MRI) scans. These methods require very high accuracy and meager false negative rates to be of any practical use. This paper presents a Convolutional Neural Network (CNN) based transfer learning approach to classify the brain MRI scans into two classes using three pre-trained models. The performances of these models are compared with each other. Experimental results show that the Resnet-50 model achieves the highest accuracy and least false negative rates as 95% and zero respectively. It is followed by VGG-16 and Inception-V3 model with an accuracy of 90% and 55% respectively.",
    "link": "http://arxiv.org/abs/1911.02265",
    "context": "Title: Predictive modeling of brain tumor: A Deep learning approach. (arXiv:1911.02265v6 [cs.CV] UPDATED)\nAbstract: Image processing concepts can visualize the different anatomy structure of the human body. Recent advancements in the field of deep learning have made it possible to detect the growth of cancerous tissue just by a patient's brain Magnetic Resonance Imaging (MRI) scans. These methods require very high accuracy and meager false negative rates to be of any practical use. This paper presents a Convolutional Neural Network (CNN) based transfer learning approach to classify the brain MRI scans into two classes using three pre-trained models. The performances of these models are compared with each other. Experimental results show that the Resnet-50 model achieves the highest accuracy and least false negative rates as 95% and zero respectively. It is followed by VGG-16 and Inception-V3 model with an accuracy of 90% and 55% respectively.",
    "path": "papers/19/11/1911.02265.json",
    "total_tokens": 798,
    "translated_title": "预测脑肿瘤的深度学习方法",
    "translated_abstract": "图像处理技术可以可视化人体不同的解剖结构。深度学习在脑部磁共振成像（MRI）扫描中检测癌组织生长方面取得了重要进展。本文提出了基于卷积神经网络（CNN）的迁移学习方法，使用三个预训练模型将脑MRI扫描分类为两类。将这些模型的性能进行了比较。实验结果显示，Resnet-50模型的准确率最高，假阴性率最低，分别为95％和零。其次是VGG-16模型和Inception-V3模型，准确率分别为90％和55％。",
    "tldr": "这篇论文介绍了一种基于卷积神经网络的深度学习方法，通过脑部MRI扫描将脑肿瘤进行分类，并比较了不同预训练模型的性能。实验结果表明，Resnet-50模型具有最高的准确率和最低的假阴性率。",
    "en_tdlr": "This paper presents a deep learning approach using a Convolutional Neural Network (CNN) to classify brain tumors through MRI scans, with the Resnet-50 model achieving the highest accuracy and least false negative rates."
}