{
    "title": "Aggregative Efficiency of Bayesian Learning in Networks. (arXiv:1911.10116v8 [econ.TH] UPDATED)",
    "abstract": "When individuals in a social network learn about an unknown state from private signals and neighbors' actions, the network structure often causes information loss. We consider rational agents and Gaussian signals in the canonical sequential social-learning problem and ask how the network changes the efficiency of signal aggregation. Rational actions in our model are log-linear functions of observations and admit a signal-counting interpretation of accuracy. Networks where agents observe multiple neighbors but not their common predecessors confound information, and even a small amount of confounding can lead to much lower accuracy. In a class of networks where agents move in generations and observe the previous generation, we quantify the information loss with an aggregative efficiency index. Aggregative efficiency is a simple function of network parameters: increasing in observations and decreasing in confounding. Later generations contribute little additional information, even with ar",
    "link": "http://arxiv.org/abs/1911.10116",
    "context": "Title: Aggregative Efficiency of Bayesian Learning in Networks. (arXiv:1911.10116v8 [econ.TH] UPDATED)\nAbstract: When individuals in a social network learn about an unknown state from private signals and neighbors' actions, the network structure often causes information loss. We consider rational agents and Gaussian signals in the canonical sequential social-learning problem and ask how the network changes the efficiency of signal aggregation. Rational actions in our model are log-linear functions of observations and admit a signal-counting interpretation of accuracy. Networks where agents observe multiple neighbors but not their common predecessors confound information, and even a small amount of confounding can lead to much lower accuracy. In a class of networks where agents move in generations and observe the previous generation, we quantify the information loss with an aggregative efficiency index. Aggregative efficiency is a simple function of network parameters: increasing in observations and decreasing in confounding. Later generations contribute little additional information, even with ar",
    "path": "papers/19/11/1911.10116.json",
    "total_tokens": 909,
    "translated_title": "Bayesian学习在网络中的聚合效率",
    "translated_abstract": "在社交网络中，当个体通过私有信号和邻居的行为来学习未知状态时，网络结构常常导致信息损失。我们在经典的顺序社交学习问题中考虑理性代理和高斯信号，并询问网络如何改变信号聚合的效率。在我们的模型中，理性行为是观察的对数线性函数，并且具有准确性的信号计数解释。在代理人观察多个邻居但不观察它们的共同前代的网络中，信息被混淆，即使有少量的混淆也会导致较低的准确性。在代理人按照世代移动并观察前一个世代的一类网络中，我们使用聚合效率指数来量化信息损失。聚合效率是网络参数的简单函数：观察增加，混淆减少。即使在后续世代，额外的信息贡献也很少，即使有大量的观察。",
    "tldr": "本论文研究了在社交网络中，个体通过私有信号和邻居的行为来学习未知状态时，网络结构对信号聚合效率的影响。研究发现，网络中的信息混淆会导致准确性降低，而增加观察和减少混淆可以提高聚合效率。",
    "en_tdlr": "This paper investigates the impact of network structure on the efficiency of signal aggregation when individuals learn about an unknown state through private signals and neighbors' actions in a social network. The study finds that information confounding in the network leads to lower accuracy, while increasing observations and reducing confounding can improve aggregative efficiency."
}