{
    "title": "The Threat of Adversarial Attacks on Machine Learning in Network Security -- A Survey. (arXiv:1911.02621v3 [cs.CR] UPDATED)",
    "abstract": "Machine learning models have made many decision support systems to be faster, more accurate, and more efficient. However, applications of machine learning in network security face a more disproportionate threat of active adversarial attacks compared to other domains. This is because machine learning applications in network security such as malware detection, intrusion detection, and spam filtering are by themselves adversarial in nature. In what could be considered an arm's race between attackers and defenders, adversaries constantly probe machine learning systems with inputs that are explicitly designed to bypass the system and induce a wrong prediction. In this survey, we first provide a taxonomy of machine learning techniques, tasks, and depth. We then introduce a classification of machine learning in network security applications. Next, we examine various adversarial attacks against machine learning in network security and introduce two classification approaches for adversarial att",
    "link": "http://arxiv.org/abs/1911.02621",
    "context": "Title: The Threat of Adversarial Attacks on Machine Learning in Network Security -- A Survey. (arXiv:1911.02621v3 [cs.CR] UPDATED)\nAbstract: Machine learning models have made many decision support systems to be faster, more accurate, and more efficient. However, applications of machine learning in network security face a more disproportionate threat of active adversarial attacks compared to other domains. This is because machine learning applications in network security such as malware detection, intrusion detection, and spam filtering are by themselves adversarial in nature. In what could be considered an arm's race between attackers and defenders, adversaries constantly probe machine learning systems with inputs that are explicitly designed to bypass the system and induce a wrong prediction. In this survey, we first provide a taxonomy of machine learning techniques, tasks, and depth. We then introduce a classification of machine learning in network security applications. Next, we examine various adversarial attacks against machine learning in network security and introduce two classification approaches for adversarial att",
    "path": "papers/19/11/1911.02621.json",
    "total_tokens": 984,
    "translated_title": "机器学习在网络安全中的对抗攻击威胁--调查",
    "translated_abstract": "机器学习模型使许多决策支持系统更快、更准确、更高效。然而，在网络安全中应用机器学习面临比其他领域更不成比例的对抗攻击威胁。这是因为网络安全中的机器学习应用，如恶意软件检测、入侵检测和垃圾邮件过滤本身就是对抗性的。在攻击者和防御者之间可能可以被视为一场军备竞赛的过程中，攻击者不断地用专门设计来绕过系统的输入来探测机器学习系统并诱导错误的预测。在这项调查中，我们首先提供了机器学习技术，任务和深度的分类法。然后，我们介绍了网络安全应用中机器学习的分类方法。接下来，我们研究了针对机器学习在网络安全中的各种对抗攻击，并介绍了两种对抗攻击的分类方法。最后，我们讨论了当前对对抗攻击的防御，并强调了这个领域中的开放问题。",
    "tldr": "机器学习在网络安全领域应用面临对抗攻击威胁，攻击者通过专门设计的输入来绕过系统引导错误预测，文章提供机器学习和网络安全应用的分类法，并介绍了各种对抗攻击和防御方法。",
    "en_tdlr": "Machine learning applications in network security face a disproportionate threat of adversarial attacks compared to other domains, and attackers constantly probe machine learning systems with inputs designed to induce wrong predictions. This survey provides a taxonomy of machine learning techniques and introduces a classification of machine learning applications in network security, examines various adversarial attacks and defenses, and highlights open problems in the field."
}