{
    "title": "Selective machine learning of doubly robust functionals. (arXiv:1911.02029v6 [stat.ME] UPDATED)",
    "abstract": "While model selection is a well-studied topic in parametric and nonparametric regression or density estimation, selection of possibly high-dimensional nuisance parameters in semiparametric problems is far less developed. In this paper, we propose a selective machine learning framework for making inferences about a finite-dimensional functional defined on a semiparametric model, when the latter admits a doubly robust estimating function and several candidate machine learning algorithms are available for estimating the nuisance parameters. We introduce a new selection criterion aimed at bias reduction in estimating the functional of interest based on a novel definition of pseudo-risk inspired by the double robustness property. Intuitively, the proposed criterion selects a pair of learners with the smallest pseudo-risk, so that the estimated functional is least sensitive to perturbations of a nuisance parameter. We establish an oracle property for a multi-fold cross-validation version of ",
    "link": "http://arxiv.org/abs/1911.02029",
    "context": "Title: Selective machine learning of doubly robust functionals. (arXiv:1911.02029v6 [stat.ME] UPDATED)\nAbstract: While model selection is a well-studied topic in parametric and nonparametric regression or density estimation, selection of possibly high-dimensional nuisance parameters in semiparametric problems is far less developed. In this paper, we propose a selective machine learning framework for making inferences about a finite-dimensional functional defined on a semiparametric model, when the latter admits a doubly robust estimating function and several candidate machine learning algorithms are available for estimating the nuisance parameters. We introduce a new selection criterion aimed at bias reduction in estimating the functional of interest based on a novel definition of pseudo-risk inspired by the double robustness property. Intuitively, the proposed criterion selects a pair of learners with the smallest pseudo-risk, so that the estimated functional is least sensitive to perturbations of a nuisance parameter. We establish an oracle property for a multi-fold cross-validation version of ",
    "path": "papers/19/11/1911.02029.json",
    "total_tokens": 908,
    "translated_title": "双重鲁棒性函数的选择性机器学习研究",
    "translated_abstract": "虽然参数和非参数回归或密度估计中的模型选择是一个研究充分的主题，但在半参数问题中选择可能高维的干扰参数则较少研究。本文提出了一种选择性机器学习框架，用于对一个半参数模型上定义的有限维函数进行推断，当后者具有双重鲁棒的估计函数，并有多个候选的机器学习算法可用于估计干扰参数。我们引入了一种新的选择标准，旨在通过一种新颖的伪风险定义来降低估计所提函数中的偏差，该定义受到双重鲁棒性质的启发。直观地说，所提出的标准选择了具有最小伪风险的一对学习器，以使估计的函数对干扰参数的扰动最不敏感。我们为多重交叉验证版本的方法证明了理想性质。",
    "tldr": "本文提出了一种选择性机器学习框架，用于在半参数问题中选择可能高维的干扰参数，并对双重鲁棒性函数进行推断。通过引入新的选择标准和伪风险定义，降低了估计所提函数中的偏差，并且具有理想性质。"
}