{
    "title": "Estimating uncertainty of earthquake rupture using Bayesian neural network. (arXiv:1911.09660v2 [stat.ML] UPDATED)",
    "abstract": "Bayesian neural networks (BNN) are the probabilistic model that combines the strengths of both neural network (NN) and stochastic processes. As a result, BNN can combat overfitting and perform well in applications where data is limited. Earthquake rupture study is such a problem where data is insufficient, and scientists have to rely on many trial and error numerical or physical models. Lack of resources and computational expenses, often, it becomes hard to determine the reasons behind the earthquake rupture. In this work, a BNN has been used (1) to combat the small data problem and (2) to find out the parameter combinations responsible for earthquake rupture and (3) to estimate the uncertainty associated with earthquake rupture. Two thousand rupture simulations are used to train and test the model. A simple 2D rupture geometry is considered where the fault has a Gaussian geometric heterogeneity at the center, and eight parameters vary in each simulation. The test F1-score of BNN (0.83",
    "link": "http://arxiv.org/abs/1911.09660",
    "context": "Title: Estimating uncertainty of earthquake rupture using Bayesian neural network. (arXiv:1911.09660v2 [stat.ML] UPDATED)\nAbstract: Bayesian neural networks (BNN) are the probabilistic model that combines the strengths of both neural network (NN) and stochastic processes. As a result, BNN can combat overfitting and perform well in applications where data is limited. Earthquake rupture study is such a problem where data is insufficient, and scientists have to rely on many trial and error numerical or physical models. Lack of resources and computational expenses, often, it becomes hard to determine the reasons behind the earthquake rupture. In this work, a BNN has been used (1) to combat the small data problem and (2) to find out the parameter combinations responsible for earthquake rupture and (3) to estimate the uncertainty associated with earthquake rupture. Two thousand rupture simulations are used to train and test the model. A simple 2D rupture geometry is considered where the fault has a Gaussian geometric heterogeneity at the center, and eight parameters vary in each simulation. The test F1-score of BNN (0.83",
    "path": "papers/19/11/1911.09660.json",
    "total_tokens": 900,
    "translated_title": "使用贝叶斯神经网络估计地震断层的不确定性",
    "translated_abstract": "贝叶斯神经网络（BNN）是一种结合了神经网络（NN）和随机过程优势的概率模型。因此，BNN可以解决过度拟合问题，并在数据有限的应用中表现良好。地震断层研究就是这样一个数据不足的问题，科学家必须依靠许多试验和错误的数值或物理模型来进行研究。在这项工作中，使用BNN，（1）解决数据问题，（2）找出导致地震断裂的参数组合，（3）估计地震断层的不确定性。使用了两千次的断层模拟来训练和测试模型，在每个模拟中，一个简单的2D断层结构被考虑，在中心处具有高斯几何异质性，8个参数在每次模拟中变化。BNN的测试F1得分为0.83。",
    "tldr": "本文使用贝叶斯神经网络估计地震断层不确定性，通过解决数据不足问题和确定导致断层的参数组合，并使用两千次的断层模拟来训练和测试模型，最终得分0.83。",
    "en_tdlr": "This paper uses Bayesian neural networks to estimate the uncertainty associated with earthquake rupture and identify the parameter combinations responsible for it, by training and testing the model with 2,000 rupture simulations. The approach combats the problem of limited data and achieves a test F1-score of 0.83."
}