{
    "title": "Nearest Neighbor Sampling of Point Sets using Rays. (arXiv:1911.10737v4 [cs.CV] UPDATED)",
    "abstract": "We propose a new framework for the sampling, compression, and analysis of distributions of point sets and other geometric objects embedded in Euclidean spaces. Our approach involves the construction of a tensor called the RaySense sketch, which captures the nearest neighbors from the underlying geometry of points along a set of rays. We explore various operations that can be performed on the RaySense sketch, leading to different properties and potential applications. Statistical information about the data set can be extracted from the sketch, independent of the ray set. Line integrals on point sets can be efficiently computed using the sketch. We also present several examples illustrating applications of the proposed strategy in practical scenarios.",
    "link": "http://arxiv.org/abs/1911.10737",
    "context": "Title: Nearest Neighbor Sampling of Point Sets using Rays. (arXiv:1911.10737v4 [cs.CV] UPDATED)\nAbstract: We propose a new framework for the sampling, compression, and analysis of distributions of point sets and other geometric objects embedded in Euclidean spaces. Our approach involves the construction of a tensor called the RaySense sketch, which captures the nearest neighbors from the underlying geometry of points along a set of rays. We explore various operations that can be performed on the RaySense sketch, leading to different properties and potential applications. Statistical information about the data set can be extracted from the sketch, independent of the ray set. Line integrals on point sets can be efficiently computed using the sketch. We also present several examples illustrating applications of the proposed strategy in practical scenarios.",
    "path": "papers/19/11/1911.10737.json",
    "total_tokens": 768,
    "translated_title": "用射线进行最近邻点集抽样",
    "translated_abstract": "我们提出了一个新的框架，用于抽样、压缩和分析欧几里得空间中嵌入的点集和其他几何对象的分布。我们的方法涉及构建一种称为RaySense草图的张量，该张量捕捉沿着一组射线的点的基本几何形态的最近邻居。我们探讨了可以在RaySense草图上执行的各种操作，从而导致不同的属性和潜在的应用。可以在不考虑射线集的情况下从草图中提取有关数据集的统计信息。使用草图可以高效地计算点集上的线积分。我们还提供了几个示例，说明了所提出策略在实际情况下的应用。",
    "tldr": "本论文提出了一种新的框架用于最近邻的点集抽样，所涉及的RaySense草图可以捕捉点的基本几何形态以及提取与之相关的统计信息，且可高效地进行点集上的线积分计算。",
    "en_tdlr": "This paper proposes a new framework for nearest neighbor sampling of point sets using the constructed RaySense sketch, which can capture the basic geometric shapes of the points and extract statistical information from the sketch. The sketch can also efficiently calculate line integrals on point sets."
}