{
    "title": "Equivariant online predictions of non-stationary time series. (arXiv:1911.08662v5 [math.ST] UPDATED)",
    "abstract": "We discuss the finite sample theoretical properties of online predictions in non-stationary time series under model misspecification. To analyze the theoretical predictive properties of statistical methods under this setting, we first define the Kullback-Leibler risk, in order to place the problem within a decision theoretic framework. Under this framework, we show that a specific class of dynamic models -- random walk dynamic linear models -- produce exact minimax predictive densities. We first show this result under Gaussian assumptions, then relax this assumption using semi-martingale processes. This result provides a theoretical baseline, under both non-stationary and stationary time series data, for which other models can be compared against. We extend the result to the synthesis of multiple predictive densities. Three topical applications in epidemiology, climatology, and economics, confirm and highlight our theoretical results.",
    "link": "http://arxiv.org/abs/1911.08662",
    "context": "Title: Equivariant online predictions of non-stationary time series. (arXiv:1911.08662v5 [math.ST] UPDATED)\nAbstract: We discuss the finite sample theoretical properties of online predictions in non-stationary time series under model misspecification. To analyze the theoretical predictive properties of statistical methods under this setting, we first define the Kullback-Leibler risk, in order to place the problem within a decision theoretic framework. Under this framework, we show that a specific class of dynamic models -- random walk dynamic linear models -- produce exact minimax predictive densities. We first show this result under Gaussian assumptions, then relax this assumption using semi-martingale processes. This result provides a theoretical baseline, under both non-stationary and stationary time series data, for which other models can be compared against. We extend the result to the synthesis of multiple predictive densities. Three topical applications in epidemiology, climatology, and economics, confirm and highlight our theoretical results.",
    "path": "papers/19/11/1911.08662.json",
    "total_tokens": 887,
    "translated_title": "非平稳时间序列等变在线预测",
    "translated_abstract": "我们讨论了模型错误下非平稳时间序列在线预测的有限样本理论性质。为了分析决策论框架下统计方法在这种情况下的理论预测性能，我们首先定义了Kullback-Leibler风险。在这个框架下，我们展示了一类特定的动态模型--随机游走动态线性模型--产生了精确的极小化预测密度。我们首先在高斯假设下展示了这个结果，然后使用半鞅过程放松了这个假设。该结果为非平稳和平稳时间序列数据提供了一个理论基线，可以用来与其他模型进行比较。我们将结果扩展到多个预测密度的综合。在流行病学、气候学和经济学中的三个主题应用，证实并凸显了我们的理论结果。",
    "tldr": "本文讨论了模型错误下的非平稳时间序列在线预测问题，并且证明了随机游走动态线性模型可以产生精确的极小化预测密度。这个结果为其他模型提供了理论基线，并且在流行病学、气候学和经济学中得到了应用。",
    "en_tdlr": "This paper discusses the problem of online predictions in non-stationary time series under model misspecification, and proves that a specific class of dynamic models, the random walk dynamic linear models, can produce exact minimax predictive densities. The result provides a theoretical baseline for other models and is applied in epidemiology, climatology, and economics."
}