{
    "title": "ParaDime: A Framework for Parametric Dimensionality Reduction. (arXiv:2210.04582v3 [cs.LG] UPDATED)",
    "abstract": "ParaDime is a framework for parametric dimensionality reduction (DR). In parametric DR, neural networks are trained to embed high-dimensional data items in a low-dimensional space while minimizing an objective function. ParaDime builds on the idea that the objective functions of several modern DR techniques result from transformed inter-item relationships. It provides a common interface for specifying these relations and transformations and for defining how they are used within the losses that govern the training process. Through this interface, ParaDime unifies parametric versions of DR techniques such as metric MDS, t-SNE, and UMAP. It allows users to fully customize all aspects of the DR process. We show how this ease of customization makes ParaDime suitable for experimenting with interesting techniques such as hybrid classification/embedding models and supervised DR. This way, ParaDime opens up new possibilities for visualizing high-dimensional data.",
    "link": "http://arxiv.org/abs/2210.04582",
    "context": "Title: ParaDime: A Framework for Parametric Dimensionality Reduction. (arXiv:2210.04582v3 [cs.LG] UPDATED)\nAbstract: ParaDime is a framework for parametric dimensionality reduction (DR). In parametric DR, neural networks are trained to embed high-dimensional data items in a low-dimensional space while minimizing an objective function. ParaDime builds on the idea that the objective functions of several modern DR techniques result from transformed inter-item relationships. It provides a common interface for specifying these relations and transformations and for defining how they are used within the losses that govern the training process. Through this interface, ParaDime unifies parametric versions of DR techniques such as metric MDS, t-SNE, and UMAP. It allows users to fully customize all aspects of the DR process. We show how this ease of customization makes ParaDime suitable for experimenting with interesting techniques such as hybrid classification/embedding models and supervised DR. This way, ParaDime opens up new possibilities for visualizing high-dimensional data.",
    "path": "papers/22/10/2210.04582.json",
    "total_tokens": 904,
    "translated_title": "ParaDime：参数化降维框架",
    "translated_abstract": "ParaDime 是一个参数化降维（DR）框架。在参数化 DR 中，神经网络被训练成将高维数据点嵌入到低维空间中，同时最小化一个目标函数。ParaDime 建立在一些现代 DR 技术的目标函数是基于转换过的数据之间的关系的思想上，为这些关系和转换提供了统一的接口，定义了它们如何被用于规范训练过程中的损失。通过这个接口，ParaDime 统一了度量 MDS、t-SNE 和 UMAP 等 DR 技术的参数化版本。它允许用户完全自定义 DR 过程的所有方面。我们展示了这种易于定制的特点使 ParaDime 适用于实验性技术，例如混合分类 / 嵌入模型和监督 DR。通过 ParaDime，打开了可视化高维数据的新可能性。",
    "tldr": "ParaDime 是一个参数化降维框架，通过提供统一的接口，允许用户自定义数据之间的关系和转换，从而将多个现代 DR 技术统一起来。借助 ParaDime，用户可以方便地实验各种 DR 技术，如混合分类 / 嵌入模型和监督 DR，为高维数据的可视化打开新的可能性。",
    "en_tdlr": "ParaDime is a framework for parametric dimensionality reduction that unites multiple modern DR techniques through a common interface for customizable relationships and transformations. This allows for experimentation with techniques such as hybrid classification/embedding models and supervised DR, opening up new possibilities for visualizing high-dimensional data."
}