{
    "title": "Probability of Causation with Sample Selection: A Reanalysis of the Impacts of J\\'ovenes en Acci\\'on on Formality. (arXiv:2210.01938v4 [econ.EM] UPDATED)",
    "abstract": "This paper identifies the probability of causation when there is sample selection. We show that the probability of causation is partially identified for individuals who are always observed regardless of treatment status and derive sharp bounds under three increasingly restrictive sets of assumptions. The first set imposes an exogenous treatment and a monotone sample selection mechanism. To tighten these bounds, the second set also imposes the monotone treatment response assumption, while the third set additionally imposes a stochastic dominance assumption. Finally, we use experimental data from the Colombian job training program J\\'ovenes en Acci\\'on to empirically illustrate our approach's usefulness. We find that, among always-employed women, at least 18% and at most 24% transitioned to the formal labor market because of the program.",
    "link": "http://arxiv.org/abs/2210.01938",
    "context": "Title: Probability of Causation with Sample Selection: A Reanalysis of the Impacts of J\\'ovenes en Acci\\'on on Formality. (arXiv:2210.01938v4 [econ.EM] UPDATED)\nAbstract: This paper identifies the probability of causation when there is sample selection. We show that the probability of causation is partially identified for individuals who are always observed regardless of treatment status and derive sharp bounds under three increasingly restrictive sets of assumptions. The first set imposes an exogenous treatment and a monotone sample selection mechanism. To tighten these bounds, the second set also imposes the monotone treatment response assumption, while the third set additionally imposes a stochastic dominance assumption. Finally, we use experimental data from the Colombian job training program J\\'ovenes en Acci\\'on to empirically illustrate our approach's usefulness. We find that, among always-employed women, at least 18% and at most 24% transitioned to the formal labor market because of the program.",
    "path": "papers/22/10/2210.01938.json",
    "total_tokens": 916,
    "translated_title": "在样本选择条件下的因果概率：对J\\'ovenes en Acci\\'on对形式化的影响的重新分析",
    "translated_abstract": "本文在存在样本选择条件下识别了因果概率。我们表明对于那些无论接受治疗与否都始终被观察到的个体，因果概率部分被确定，并在三组逐渐严格的假设下得出了尖锐的边界。第一组假设了外生的治疗和单调的样本选择机制。为了收紧这些边界，第二组还假设了单调的治疗反应，而第三组另外还假设了随机优势。最后，我们使用来自哥伦比亚职业培训项目J\\'ovenes en Acci\\'on的实验数据，实证说明了我们方法的实用性。我们发现，对于始终就业的女性，最少有18%至多24%的人因该项目过渡到了正式劳动力市场。",
    "tldr": "本文通过对样本选择条件下的因果概率进行重新分析，确定了因果概率的部分界限。在考虑了不同假设的情况下得到了有力的结果，并且在哥伦比亚的J\\'ovenes en Acci\\'on项目中实证发现，该项目使至少18%至多24%的始终就业的女性转向了正式劳动力市场。",
    "en_tdlr": "This paper reanalyzes the probability of causation with sample selection and concludes that the probability of causation is partially identified. They derive sharp bounds under different assumptions and empirically find that the Colombian job training program J\\'ovenes en Acci\\'on caused a transition to the formal labor market for at least 18% and at most 24% of always-employed women."
}