{
    "title": "Towards Explaining Distribution Shifts. (arXiv:2210.10275v2 [cs.LG] UPDATED)",
    "abstract": "A distribution shift can have fundamental consequences such as signaling a change in the operating environment or significantly reducing the accuracy of downstream models. Thus, understanding distribution shifts is critical for examining and hopefully mitigating the effect of such a shift. Most prior work focuses on merely detecting if a shift has occurred and assumes any detected shift can be understood and handled appropriately by a human operator. We hope to aid in these manual mitigation tasks by explaining the distribution shift using interpretable transportation maps from the original distribution to the shifted one. We derive our interpretable mappings from a relaxation of optimal transport, where the candidate mappings are restricted to a set of interpretable mappings. We then inspect multiple quintessential use-cases of distribution shift in real-world tabular, text, and image datasets to showcase how our explanatory mappings provide a better balance between detail and interpr",
    "link": "http://arxiv.org/abs/2210.10275",
    "context": "Title: Towards Explaining Distribution Shifts. (arXiv:2210.10275v2 [cs.LG] UPDATED)\nAbstract: A distribution shift can have fundamental consequences such as signaling a change in the operating environment or significantly reducing the accuracy of downstream models. Thus, understanding distribution shifts is critical for examining and hopefully mitigating the effect of such a shift. Most prior work focuses on merely detecting if a shift has occurred and assumes any detected shift can be understood and handled appropriately by a human operator. We hope to aid in these manual mitigation tasks by explaining the distribution shift using interpretable transportation maps from the original distribution to the shifted one. We derive our interpretable mappings from a relaxation of optimal transport, where the candidate mappings are restricted to a set of interpretable mappings. We then inspect multiple quintessential use-cases of distribution shift in real-world tabular, text, and image datasets to showcase how our explanatory mappings provide a better balance between detail and interpr",
    "path": "papers/22/10/2210.10275.json",
    "total_tokens": 834,
    "translated_title": "探究分布变化的解释方法",
    "translated_abstract": "分布的改变可能会对下游模型的准确性产生重大影响，因此理解分布的变化对于研究和减轻其影响至关重要。大多数先前的工作仅关注于检测是否发生了分布变化，并假设任何检测到的变化均可以被运营者正确地理解和处理。本文旨在通过可解释的转运图来解释分布变化，从而帮助人工进行减轻影响的任务。我们将可解释的映射从最优输运的松弛中推导出来，在候选映射限制为可解释映射的集合中。我们检查了多个现实中表格、文本和图像数据集中的分布变化，并展示了我们的解释性映射如何在详细性和可解释性之间提供更好的平衡。",
    "tldr": "本文介绍了一种通过可解释的转运图来解释分布变化的方法，以帮助人工进行减轻影响的任务。通过许多现实数据集的例子，展示了解释性映射提供了更好的详细性和可解释性之间的平衡。"
}