{
    "title": "FocusedCleaner: Sanitizing Poisoned Graphs for Robust GNN-based Node Classification. (arXiv:2210.13815v2 [cs.LG] UPDATED)",
    "abstract": "Graph Neural Networks (GNNs) are vulnerable to data poisoning attacks, which will generate a poisoned graph as the input to the GNN models. We present FocusedCleaner as a poisoned graph sanitizer to effectively identify the poison injected by attackers. Specifically, FocusedCleaner provides a sanitation framework consisting of two modules: bi-level structural learning and victim node detection. In particular, the structural learning module will reverse the attack process to steadily sanitize the graph while the detection module provides ``the focus\" -- a narrowed and more accurate search region -- to structural learning. These two modules will operate in iterations and reinforce each other to sanitize a poisoned graph step by step. As an important application, we show that the adversarial robustness of GNNs trained over the sanitized graph for the node classification task is significantly improved. Extensive experiments demonstrate that FocusedCleaner outperforms the state-of-the-art b",
    "link": "http://arxiv.org/abs/2210.13815",
    "context": "Title: FocusedCleaner: Sanitizing Poisoned Graphs for Robust GNN-based Node Classification. (arXiv:2210.13815v2 [cs.LG] UPDATED)\nAbstract: Graph Neural Networks (GNNs) are vulnerable to data poisoning attacks, which will generate a poisoned graph as the input to the GNN models. We present FocusedCleaner as a poisoned graph sanitizer to effectively identify the poison injected by attackers. Specifically, FocusedCleaner provides a sanitation framework consisting of two modules: bi-level structural learning and victim node detection. In particular, the structural learning module will reverse the attack process to steadily sanitize the graph while the detection module provides ``the focus\" -- a narrowed and more accurate search region -- to structural learning. These two modules will operate in iterations and reinforce each other to sanitize a poisoned graph step by step. As an important application, we show that the adversarial robustness of GNNs trained over the sanitized graph for the node classification task is significantly improved. Extensive experiments demonstrate that FocusedCleaner outperforms the state-of-the-art b",
    "path": "papers/22/10/2210.13815.json",
    "total_tokens": 914,
    "translated_title": "FocusedCleaner：用于稳健GNN节点分类的清理受污染图形",
    "translated_abstract": "图神经网络（GNN）易受数据投毒攻击的影响，这会生成一个被污染的图形作为GNN模型的输入。我们提出FocusedCleaner作为一种污染图形清理器，能够有效识别攻击者注入的毒素。具体而言，FocusedCleaner提供了一个清理框架，包括两个模块：双层结构学习和受害节点检测。其中，结构学习模块将逆转攻击过程，稳定地清理图形，而检测模块提供了“焦点”——一个更窄、更准确的搜索区域——给结构学习模块使用。这两个模块将迭代运行，并相互增强，逐步清理被污染的图形。作为一个重要应用，我们展示了在清理后的图上训练的GNN对于节点分类任务的对抗鲁棒性显著提高。广泛的实验表明，FocusedCleaner优于最先进的方法。",
    "tldr": "FocusedCleaner是一种针对数据投毒攻击的清理器，通过逆转攻击过程并提供更准确的搜索区域，逐步清理受污染的图形，显著提高了GNN在节点分类任务上的对抗鲁棒性。"
}