{
    "title": "A Systematic Survey of Chemical Pre-trained Models. (arXiv:2210.16484v3 [cs.LG] UPDATED)",
    "abstract": "Deep learning has achieved remarkable success in learning representations for molecules, which is crucial for various biochemical applications, ranging from property prediction to drug design. However, training Deep Neural Networks (DNNs) from scratch often requires abundant labeled molecules, which are expensive to acquire in the real world. To alleviate this issue, tremendous efforts have been devoted to Molecular Pre-trained Models (CPMs), where DNNs are pre-trained using large-scale unlabeled molecular databases and then fine-tuned over specific downstream tasks. Despite the prosperity, there lacks a systematic review of this fast-growing field. In this paper, we present the first survey that summarizes the current progress of CPMs. We first highlight the limitations of training molecular representation models from scratch to motivate CPM studies. Next, we systematically review recent advances on this topic from several key perspectives, including molecular descriptors, encoder arc",
    "link": "http://arxiv.org/abs/2210.16484",
    "context": "Title: A Systematic Survey of Chemical Pre-trained Models. (arXiv:2210.16484v3 [cs.LG] UPDATED)\nAbstract: Deep learning has achieved remarkable success in learning representations for molecules, which is crucial for various biochemical applications, ranging from property prediction to drug design. However, training Deep Neural Networks (DNNs) from scratch often requires abundant labeled molecules, which are expensive to acquire in the real world. To alleviate this issue, tremendous efforts have been devoted to Molecular Pre-trained Models (CPMs), where DNNs are pre-trained using large-scale unlabeled molecular databases and then fine-tuned over specific downstream tasks. Despite the prosperity, there lacks a systematic review of this fast-growing field. In this paper, we present the first survey that summarizes the current progress of CPMs. We first highlight the limitations of training molecular representation models from scratch to motivate CPM studies. Next, we systematically review recent advances on this topic from several key perspectives, including molecular descriptors, encoder arc",
    "path": "papers/22/10/2210.16484.json",
    "total_tokens": 861,
    "translated_title": "化学预训练模型的系统调查",
    "translated_abstract": "深度学习在学习分子表示方面取得了显著的成功，这对于各种生化应用，从属性预测到药物设计，都至关重要。然而，从头开始训练深度神经网络通常需要大量标记分子，在现实世界中获取这些标记通常很昂贵。为了缓解这个问题，已经付出了巨大的努力在使用大规模无标记分子数据库预训练深度神经网络，并针对特定的下游任务进行微调。尽管物有所值，但这个快速增长的领域缺乏系统的回顾。在本文中，我们提出了第一个总结CPMs进展的综述。我们首先强调从头训练分子表示模型的局限性，以推动CPM的研究。接下来，我们从几个关键角度系统地回顾了这个主题的最新进展，包括分子描述符，编码器架构。",
    "tldr": "本文是对化学预训练模型领域的第一次系统回顾，提出了从头训练分子表示模型的局限性，总结了最新的进展和几个关键角度，包括分子描述符和编码器架构。"
}