{
    "title": "CPS-MEBR: Click Feedback-Aware Web Page Summarization for Multi-Embedding-Based Retrieval. (arXiv:2210.09787v3 [cs.IR] UPDATED)",
    "abstract": "Embedding-based retrieval (EBR) is a technique to use embeddings to represent query and document, and then convert the retrieval problem into a nearest neighbor search problem in the embedding space. Some previous works have mainly focused on representing the web page with a single embedding, but in real web search scenarios, it is difficult to represent all the information of a long and complex structured web page as a single embedding. To address this issue, we design a click feedback-aware web page summarization for multi-embedding-based retrieval (CPS-MEBR) framework which is able to generate multiple embeddings for web pages to match different potential queries. Specifically, we use the click data of users in search logs to train a summary model to extract those sentences in web pages that are frequently clicked by users, which are more likely to answer those potential queries. Meanwhile, we introduce sentence-level semantic interaction to design a multi-embedding-based retrieval ",
    "link": "http://arxiv.org/abs/2210.09787",
    "context": "Title: CPS-MEBR: Click Feedback-Aware Web Page Summarization for Multi-Embedding-Based Retrieval. (arXiv:2210.09787v3 [cs.IR] UPDATED)\nAbstract: Embedding-based retrieval (EBR) is a technique to use embeddings to represent query and document, and then convert the retrieval problem into a nearest neighbor search problem in the embedding space. Some previous works have mainly focused on representing the web page with a single embedding, but in real web search scenarios, it is difficult to represent all the information of a long and complex structured web page as a single embedding. To address this issue, we design a click feedback-aware web page summarization for multi-embedding-based retrieval (CPS-MEBR) framework which is able to generate multiple embeddings for web pages to match different potential queries. Specifically, we use the click data of users in search logs to train a summary model to extract those sentences in web pages that are frequently clicked by users, which are more likely to answer those potential queries. Meanwhile, we introduce sentence-level semantic interaction to design a multi-embedding-based retrieval ",
    "path": "papers/22/10/2210.09787.json",
    "total_tokens": 733,
    "translated_title": "CPS-MEBR: 基于点击反馈的多嵌入式检索的网页摘要",
    "translated_abstract": "嵌入式检索是将嵌入用于表示查询和文档，然后将检索问题转换为嵌入空间中的最近邻搜索问题的技术。本文提出了一种基于点击反馈的适用于多嵌入式检索（CPS-MEBR）的网页摘要框架，以解决在真实网络搜索场景中难以将长且结构复杂的网页的所有信息表示为单个嵌入的问题。",
    "tldr": "CPS-MEBR框架利用用户的点击数据训练一个摘要模型，提取那些被用户频繁点击的句子，并为网页生成多个嵌入以匹配不同的潜在查询。"
}