{
    "title": "ScionFL: Efficient and Robust Secure Quantized Aggregation. (arXiv:2210.07376v2 [cs.CR] UPDATED)",
    "abstract": "Secure aggregation is commonly used in federated learning (FL) to alleviate privacy concerns related to the central aggregator seeing all parameter updates in the clear. Unfortunately, most existing secure aggregation schemes ignore two critical orthogonal research directions that aim to (i) significantly reduce client-server communication and (ii) mitigate the impact of malicious clients. However, both of these additional properties are essential to facilitate cross-device FL with thousands or even millions of (mobile) participants. In this paper, we unite both research directions by introducing ScionFL, the first secure aggregation framework for FL that operates efficiently on quantized inputs and simultaneously provides robustness against malicious clients. Our framework leverages (novel) multi-party computation (MPC) techniques and supports multiple linear (1-bit) quantization schemes, including ones that utilize the randomized Hadamard transform and Kashin's representation. Our th",
    "link": "http://arxiv.org/abs/2210.07376",
    "context": "Title: ScionFL: Efficient and Robust Secure Quantized Aggregation. (arXiv:2210.07376v2 [cs.CR] UPDATED)\nAbstract: Secure aggregation is commonly used in federated learning (FL) to alleviate privacy concerns related to the central aggregator seeing all parameter updates in the clear. Unfortunately, most existing secure aggregation schemes ignore two critical orthogonal research directions that aim to (i) significantly reduce client-server communication and (ii) mitigate the impact of malicious clients. However, both of these additional properties are essential to facilitate cross-device FL with thousands or even millions of (mobile) participants. In this paper, we unite both research directions by introducing ScionFL, the first secure aggregation framework for FL that operates efficiently on quantized inputs and simultaneously provides robustness against malicious clients. Our framework leverages (novel) multi-party computation (MPC) techniques and supports multiple linear (1-bit) quantization schemes, including ones that utilize the randomized Hadamard transform and Kashin's representation. Our th",
    "path": "papers/22/10/2210.07376.json",
    "total_tokens": 860,
    "translated_title": "ScionFL: 高效且强健的安全量化聚合",
    "translated_abstract": "安全聚合在联邦学习中被广泛应用，以减轻与中央聚合器看到所有参数更新有关的隐私问题。不幸的是，大多数现有的安全聚合方案忽略了两个关键的正交研究方向，旨在（i）显着减少客户端-服务器通信和（ii）减轻恶意客户端的影响。然而，这两个额外的属性对于实现跨设备的联邦学习与成千上万甚至百万（移动）参与者至关重要。在本文中，我们通过引入ScionFL，联合了两个研究方向，这是FL的第一个安全聚合框架，可以在量化输入上有效运行，同时提供对恶意客户端的强健性。我们的框架利用（新颖的）多方计算（MPC）技术，并支持多个线性（1比特）量化方案，包括利用随机哈达玛变换和卡申表示的方案。",
    "tldr": "本文介绍了ScionFL，这是第一个在联邦学习中高效运行在量化输入上并同时提供对恶意客户端强健性的安全聚合框架。",
    "en_tdlr": "This paper introduces ScionFL, the first secure aggregation framework for federated learning that operates efficiently on quantized inputs and provides robustness against malicious clients."
}