{
    "title": "Combining datasets to increase the number of samples and improve model fitting. (arXiv:2210.05165v2 [stat.ML] UPDATED)",
    "abstract": "For many use cases, combining information from different datasets can be of interest to improve a machine learning model's performance, especially when the number of samples from at least one of the datasets is small. However, a potential challenge in such cases is that the features from these datasets are not identical, even though there are some commonly shared features among the datasets. To tackle this challenge, we propose a novel framework called Combine datasets based on Imputation (ComImp). In addition, we propose a variant of ComImp that uses Principle Component Analysis (PCA), PCA-ComImp in order to reduce dimension before combining datasets. This is useful when the datasets have a large number of features that are not shared between them. Furthermore, our framework can also be utilized for data preprocessing by imputing missing data, i.e., filling in the missing entries while combining different datasets. To illustrate the power of the proposed methods and their potential us",
    "link": "http://arxiv.org/abs/2210.05165",
    "context": "Title: Combining datasets to increase the number of samples and improve model fitting. (arXiv:2210.05165v2 [stat.ML] UPDATED)\nAbstract: For many use cases, combining information from different datasets can be of interest to improve a machine learning model's performance, especially when the number of samples from at least one of the datasets is small. However, a potential challenge in such cases is that the features from these datasets are not identical, even though there are some commonly shared features among the datasets. To tackle this challenge, we propose a novel framework called Combine datasets based on Imputation (ComImp). In addition, we propose a variant of ComImp that uses Principle Component Analysis (PCA), PCA-ComImp in order to reduce dimension before combining datasets. This is useful when the datasets have a large number of features that are not shared between them. Furthermore, our framework can also be utilized for data preprocessing by imputing missing data, i.e., filling in the missing entries while combining different datasets. To illustrate the power of the proposed methods and their potential us",
    "path": "papers/22/10/2210.05165.json",
    "total_tokens": 980,
    "translated_title": "合并数据集以增加样本数量并提高模型拟合",
    "translated_abstract": "在许多使用情况下，将来自不同数据集的信息组合起来可以提高机器学习模型的性能，特别是当至少一个数据集的样本数量很少时。然而，在这种情况下可能存在一个潜在的挑战，即这些数据集的特征不完全相同，尽管它们中有一些共同的特征。为了解决这个挑战，我们提出了一种新的框架，称为基于插补的数据集组合（ComImp）。此外，我们提出了一种ComImp的变体，使用主成分分析（PCA），即PCA-ComImp，以在组合数据集之前降低维数。当数据集拥有大量不共享特征时，这非常有用。此外，我们的框架还可以用于数据预处理，即通过在组合不同数据集时填补缺失的条目来插补缺失数据。为了说明所提出的方法的能力和潜在用途，我们在多个真实世界的数据集上进行了广泛实验。",
    "tldr": "本文提出了一种组合数据集的新框架ComImp，可以处理不同数据集之间存在不同特征的挑战，并利用PCA-ComImp进行维数降低。此外，此框架还可以用于数据预处理，填补缺失数据的条目。该方法在多个真实世界的数据集上得到了验证。",
    "en_tdlr": "This paper proposes a new framework called ComImp for combining datasets to improve model performance, especially when one of the datasets has a small sample size. The framework addresses the challenge of non-identical features among datasets and utilizes PCA-ComImp for dimension reduction. Additionally, it can be used for data preprocessing to impute missing data. The proposed methods are validated on multiple real-world datasets."
}