{
    "title": "DALL-E-Bot: Introducing Web-Scale Diffusion Models to Robotics. (arXiv:2210.02438v3 [cs.RO] UPDATED)",
    "abstract": "We introduce the first work to explore web-scale diffusion models for robotics. DALL-E-Bot enables a robot to rearrange objects in a scene, by first inferring a text description of those objects, then generating an image representing a natural, human-like arrangement of those objects, and finally physically arranging the objects according to that goal image. We show that this is possible zero-shot using DALL-E, without needing any further example arrangements, data collection, or training. DALL-E-Bot is fully autonomous and is not restricted to a pre-defined set of objects or scenes, thanks to DALL-E's web-scale pre-training. Encouraging real-world results, with both human studies and objective metrics, show that integrating web-scale diffusion models into robotics pipelines is a promising direction for scalable, unsupervised robot learning.",
    "link": "http://arxiv.org/abs/2210.02438",
    "context": "Title: DALL-E-Bot: Introducing Web-Scale Diffusion Models to Robotics. (arXiv:2210.02438v3 [cs.RO] UPDATED)\nAbstract: We introduce the first work to explore web-scale diffusion models for robotics. DALL-E-Bot enables a robot to rearrange objects in a scene, by first inferring a text description of those objects, then generating an image representing a natural, human-like arrangement of those objects, and finally physically arranging the objects according to that goal image. We show that this is possible zero-shot using DALL-E, without needing any further example arrangements, data collection, or training. DALL-E-Bot is fully autonomous and is not restricted to a pre-defined set of objects or scenes, thanks to DALL-E's web-scale pre-training. Encouraging real-world results, with both human studies and objective metrics, show that integrating web-scale diffusion models into robotics pipelines is a promising direction for scalable, unsupervised robot learning.",
    "path": "papers/22/10/2210.02438.json",
    "total_tokens": 887,
    "translated_title": "DALL-E-Bot：将Web规模的扩散模型引入到机器人学中",
    "translated_abstract": "我们首次探索了将Web规模的扩散模型应用于机器人学的工作。DALL-E-Bot使机器人能够重新排列场景中的物体，首先推断出这些物体的文本描述，然后生成代表这些物体的自然、类人的排列图像，并最终根据目标图像物理地排列这些物体。我们展示了这是使用DALL-E实现的零-shot方式，不需要任何进一步的示例排列、数据收集或训练。由于DALL-E的Web规模预训练，在不受限于预定义的物体或场景情况下，DALL-E-Bot是完全自主的。鼓励真实世界的结果，包括人类研究和客观指标，表明将Web规模扩散模型集成到机器人管道中是一个有前途的方向，可实现可扩展的、无监督的机器人学习。",
    "tldr": "DALL-E-Bot是第一个将Web规模扩散模型引入到机器人学中的工作，可以在没有任何额外示例或训练的情况下零-shot地推断并重新排列场景中的物体，具有可行性和可扩展性，这为机器人学习提供了一个有前途的方向。",
    "en_tdlr": "DALL-E-Bot is the first work to explore web-scale diffusion model for robotics, which is capable of inferring and rearranging objects in a scene zero-shot without any further examples or training. It has shown promising direction for scalable and unsupervised robot learning."
}