{
    "title": "Dense-ATOMIC: Towards Densely-connected ATOMIC with High Knowledge Coverage and Massive Multi-hop Paths. (arXiv:2210.07621v2 [cs.CL] UPDATED)",
    "abstract": "ATOMIC is a large-scale commonsense knowledge graph (CSKG) containing everyday if-then knowledge triplets, i.e., {head event, relation, tail event}. The one-hop annotation manner made ATOMIC a set of independent bipartite graphs, which ignored the numerous links between events in different bipartite graphs and consequently caused shortages in knowledge coverage and multi-hop paths. In this work, we aim to construct Dense-ATOMIC with high knowledge coverage and massive multi-hop paths. The events in ATOMIC are normalized to a consistent pattern at first. We then propose a CSKG completion method called Rel-CSKGC to predict the relation given the head event and the tail event of a triplet, and train a CSKG completion model based on existing triplets in ATOMIC. We finally utilize the model to complete the missing links in ATOMIC and accordingly construct Dense-ATOMIC. Both automatic and human evaluation on an annotated subgraph of ATOMIC demonstrate the advantage of Rel-CSKGC over strong b",
    "link": "http://arxiv.org/abs/2210.07621",
    "context": "Title: Dense-ATOMIC: Towards Densely-connected ATOMIC with High Knowledge Coverage and Massive Multi-hop Paths. (arXiv:2210.07621v2 [cs.CL] UPDATED)\nAbstract: ATOMIC is a large-scale commonsense knowledge graph (CSKG) containing everyday if-then knowledge triplets, i.e., {head event, relation, tail event}. The one-hop annotation manner made ATOMIC a set of independent bipartite graphs, which ignored the numerous links between events in different bipartite graphs and consequently caused shortages in knowledge coverage and multi-hop paths. In this work, we aim to construct Dense-ATOMIC with high knowledge coverage and massive multi-hop paths. The events in ATOMIC are normalized to a consistent pattern at first. We then propose a CSKG completion method called Rel-CSKGC to predict the relation given the head event and the tail event of a triplet, and train a CSKG completion model based on existing triplets in ATOMIC. We finally utilize the model to complete the missing links in ATOMIC and accordingly construct Dense-ATOMIC. Both automatic and human evaluation on an annotated subgraph of ATOMIC demonstrate the advantage of Rel-CSKGC over strong b",
    "path": "papers/22/10/2210.07621.json",
    "total_tokens": 972,
    "translated_title": "Dense-ATOMIC：向具有高知识覆盖率和大规模多跳路径的密集连接ATOMIC迈进",
    "translated_abstract": "ATOMIC是一个包含常识知识三元组（即{头事件、关系、尾事件}）的大规模常识知识图谱（CSKG）。ATOMIC的单跳注释方式使其成为独立的二分图集合，忽略了不同二分图中事件之间的许多链接，从而导致了知识覆盖和多跳路径方面的不足。本文旨在构建具有高知识覆盖率和大规模多跳路径的Dense-ATOMIC。首先，将ATOMIC中的事件标准化为一致的模式。然后，我们提出了一种名为Rel-CSKGC的CSKG完成方法，用于预测三元组的头事件和尾事件后的关系，并基于ATOMIC中现有的三元组训练一个CSKG完成模型。最后，我们利用该模型来完善ATOMIC中的缺失链接，并相应构建Dense-ATOMIC。在ATOMIC的注释子图上的自动和人工评估表明，Rel-CSKGC相对于强基线方法具有优势。",
    "tldr": "本文旨在构建具有高知识覆盖率和大规模多跳路径的Dense-ATOMIC。我们提出了一种名为Rel-CSKGC的CSKG完成方法，用于预测三元组的头事件和尾事件后的关系，并相应构建Dense-ATOMIC，这相对于强基线方法具有优势。",
    "en_tdlr": "This paper aims to construct Dense-ATOMIC with high knowledge coverage and massive multi-hop paths. We propose a CSKG completion method called Rel-CSKGC to predict the relation given the head event and tail event of a triplet, and accordingly build Dense-ATOMIC, which has advantages over strong baselines."
}