{
    "title": "One does not fit all! On the Complementarity of Vision Encoders for Vision and Language Tasks. (arXiv:2210.06379v2 [cs.CV] UPDATED)",
    "abstract": "Current multimodal models, aimed at solving Vision and Language (V+L) tasks, predominantly repurpose Vision Encoders (VE) as feature extractors. While many VEs -- of different architectures, trained on different data and objectives -are publicly available, they are not designed for the downstream V+L tasks. Nonetheless, most current work assumes that a \\textit{single} pre-trained VE can serve as a general-purpose encoder. In this work, we focus on analysis and aim to understand whether the information stored within different VEs is complementary, i.e. if providing the model with features from multiple VEs can improve the performance on a target task, and how they are combined. We exhaustively experiment with three popular VEs on six downstream V+L tasks and analyze the attention and VE-dropout patterns. Our analyses suggest that diverse VEs complement each other, resulting in improved downstream V+L task performance, where the improvements are not due to simple ensemble effects (i.e.",
    "link": "http://arxiv.org/abs/2210.06379",
    "context": "Title: One does not fit all! On the Complementarity of Vision Encoders for Vision and Language Tasks. (arXiv:2210.06379v2 [cs.CV] UPDATED)\nAbstract: Current multimodal models, aimed at solving Vision and Language (V+L) tasks, predominantly repurpose Vision Encoders (VE) as feature extractors. While many VEs -- of different architectures, trained on different data and objectives -are publicly available, they are not designed for the downstream V+L tasks. Nonetheless, most current work assumes that a \\textit{single} pre-trained VE can serve as a general-purpose encoder. In this work, we focus on analysis and aim to understand whether the information stored within different VEs is complementary, i.e. if providing the model with features from multiple VEs can improve the performance on a target task, and how they are combined. We exhaustively experiment with three popular VEs on six downstream V+L tasks and analyze the attention and VE-dropout patterns. Our analyses suggest that diverse VEs complement each other, resulting in improved downstream V+L task performance, where the improvements are not due to simple ensemble effects (i.e.",
    "path": "papers/22/10/2210.06379.json",
    "total_tokens": 881,
    "tldr": "本文研究了不同的视觉编码器之间的互补性，并发现使用多个编码器能够提高视觉和语言任务的性能。"
}