{
    "title": "Characterizing and Detecting State-Sponsored Troll Activity on Social Media. (arXiv:2210.08786v5 [cs.SI] UPDATED)",
    "abstract": "The detection of state-sponsored trolls operating in influence campaigns is a critical and unsolved challenge for the research community, which has significant implications beyond the online realm. To address this challenge, we propose a new AI-based solution that identifies state-sponsored troll accounts by analyzing their sharing activity sequences, or trajectories, through a two-step process. First, we classify accounts' trajectories using an LSTM-based classifier as belonging to either a state-sponsored troll or an organic, legitimate user. Second, we utilize the classified trajectories to compute a metric, named ``Troll Score'', to quantify the extent to which an account behaves like a state-sponsored troll. To evaluate our approach, we examine the Russian interference campaign during the 2016 U.S. Presidential election. The results of our experiments show that our method can identify account trajectories with an AUC close to 99% and accurately classify Russian trolls and organic ",
    "link": "http://arxiv.org/abs/2210.08786",
    "context": "Title: Characterizing and Detecting State-Sponsored Troll Activity on Social Media. (arXiv:2210.08786v5 [cs.SI] UPDATED)\nAbstract: The detection of state-sponsored trolls operating in influence campaigns is a critical and unsolved challenge for the research community, which has significant implications beyond the online realm. To address this challenge, we propose a new AI-based solution that identifies state-sponsored troll accounts by analyzing their sharing activity sequences, or trajectories, through a two-step process. First, we classify accounts' trajectories using an LSTM-based classifier as belonging to either a state-sponsored troll or an organic, legitimate user. Second, we utilize the classified trajectories to compute a metric, named ``Troll Score'', to quantify the extent to which an account behaves like a state-sponsored troll. To evaluate our approach, we examine the Russian interference campaign during the 2016 U.S. Presidential election. The results of our experiments show that our method can identify account trajectories with an AUC close to 99% and accurately classify Russian trolls and organic ",
    "path": "papers/22/10/2210.08786.json",
    "total_tokens": 1075,
    "translated_title": "在社交媒体上表征和检测国家赞助的喷子活动",
    "translated_abstract": "检测在影响活动中运营的国家赞助的喷子是研究社区的一个关键而未解决的挑战，其影响超出了在线领域。为了解决这个挑战，我们提出了一种新的基于AI的解决方案，通过分析喷子的分享活动序列或轨迹，通过两个步骤识别国家赞助的喷子帐户。首先，我们使用基于LSTM的分类器将帐户的轨迹分类为国家赞助的喷子或有机的合法用户。其次，我们利用分类后的轨迹计算一种指标，称为“喷子评分”，来量化帐户的行为与国家赞助的喷子的相似程度。为了评估我们的方法，我们研究了2016年美国总统大选期间的俄罗斯干预活动。我们实验结果表明，我们的方法可以识别帐户轨迹，AUC接近99％，并准确分类俄罗斯喷子和有机用户，F1分数分别为0.95和0.91。我们的解决方案可以集成到现有系统中，提供国家赞助影响活动的早期警报，并对保护民主进程做出贡献。",
    "tldr": "该研究提出了一种基于AI的新解决方案，通过分析喷子的轨迹，识别国家赞助的喷子帐户。该方法可以准确识别俄罗斯喷子与有机用户，可提供国家赞助影响活动的早期警报，并对保护民主进程做出贡献。",
    "en_tdlr": "This study proposes a new AI-based solution that identifies state-sponsored troll accounts by analyzing their sharing activity sequences, or trajectories, through a two-step process. The method can accurately detect Russian trolls and provide early warning of state-sponsored influence campaigns to contribute to the protection of democratic processes."
}