{
    "title": "Terminology-aware Medical Dialogue Generation. (arXiv:2210.15551v2 [cs.CL] UPDATED)",
    "abstract": "Medical dialogue generation aims to generate responses according to a history of dialogue turns between doctors and patients. Unlike open-domain dialogue generation, this requires background knowledge specific to the medical domain. Existing generative frameworks for medical dialogue generation fall short of incorporating domain-specific knowledge, especially with regard to medical terminology. In this paper, we propose a novel framework to improve medical dialogue generation by considering features centered on domain-specific terminology. We leverage an attention mechanism to incorporate terminologically centred features, and fill in the semantic gap between medical background knowledge and common utterances by enforcing language models to learn terminology representations with an auxiliary terminology recognition task. Experimental results demonstrate the effectiveness of our approach, in which our proposed framework outperforms SOTA language models. Additionally, we provide a new da",
    "link": "http://arxiv.org/abs/2210.15551",
    "context": "Title: Terminology-aware Medical Dialogue Generation. (arXiv:2210.15551v2 [cs.CL] UPDATED)\nAbstract: Medical dialogue generation aims to generate responses according to a history of dialogue turns between doctors and patients. Unlike open-domain dialogue generation, this requires background knowledge specific to the medical domain. Existing generative frameworks for medical dialogue generation fall short of incorporating domain-specific knowledge, especially with regard to medical terminology. In this paper, we propose a novel framework to improve medical dialogue generation by considering features centered on domain-specific terminology. We leverage an attention mechanism to incorporate terminologically centred features, and fill in the semantic gap between medical background knowledge and common utterances by enforcing language models to learn terminology representations with an auxiliary terminology recognition task. Experimental results demonstrate the effectiveness of our approach, in which our proposed framework outperforms SOTA language models. Additionally, we provide a new da",
    "path": "papers/22/10/2210.15551.json",
    "total_tokens": 813,
    "translated_title": "术语感知医学对话生成",
    "translated_abstract": "医学对话生成旨在根据医生和患者之间的对话历史记录生成响应。与面向开放领域的对话生成不同，这要求具有医学领域特定的背景知识。现有的医学对话生成生成框架未能纳入特定于领域的知识，尤其是涉及医学术语。在本文中，我们提出了一种新的框架，通过考虑以术语为中心的特征来改进医学对话生成。我们利用注意机制来纳入术语居中的特征，并通过强制语言模型通过辅助术语识别任务学习术语表示来填补医学背景知识和常用话语之间的语义差距。实验结果证明了我们的方法的有效性，其中我们提出的框架优于SOTA语言模型。此外，我们提供了一个新的数据集。",
    "tldr": "本研究提出了一种新的医学对话生成框架，通过考虑以术语为中心的特征改进医学对话生成。实验结果表明，我们的框架比现有的最先进语言模型表现更好。",
    "en_tdlr": "This paper proposes a novel framework for medical dialogue generation, improving it by considering terminology-centered features. Results show that this outperforms current state-of-the-art models."
}