{
    "title": "A Semi-supervised Approach for a Better Translation of Sentiment in Dialectical Arabic UGT. (arXiv:2210.11899v2 [cs.CL] UPDATED)",
    "abstract": "In the online world, Machine Translation (MT) systems are extensively used to translate User-Generated Text (UGT) such as reviews, tweets, and social media posts, where the main message is often the author's positive or negative attitude towards the topic of the text. However, MT systems still lack accuracy in some low-resource languages and sometimes make critical translation errors that completely flip the sentiment polarity of the target word or phrase and hence delivers a wrong affect message. This is particularly noticeable in texts that do not follow common lexico-grammatical standards such as the dialectical Arabic (DA) used on online platforms. In this research, we aim to improve the translation of sentiment in UGT written in the dialectical versions of the Arabic language to English. Given the scarcity of gold-standard parallel data for DA-EN in the UGT domain, we introduce a semi-supervised approach that exploits both monolingual and parallel data for training an NMT system i",
    "link": "http://arxiv.org/abs/2210.11899",
    "context": "Title: A Semi-supervised Approach for a Better Translation of Sentiment in Dialectical Arabic UGT. (arXiv:2210.11899v2 [cs.CL] UPDATED)\nAbstract: In the online world, Machine Translation (MT) systems are extensively used to translate User-Generated Text (UGT) such as reviews, tweets, and social media posts, where the main message is often the author's positive or negative attitude towards the topic of the text. However, MT systems still lack accuracy in some low-resource languages and sometimes make critical translation errors that completely flip the sentiment polarity of the target word or phrase and hence delivers a wrong affect message. This is particularly noticeable in texts that do not follow common lexico-grammatical standards such as the dialectical Arabic (DA) used on online platforms. In this research, we aim to improve the translation of sentiment in UGT written in the dialectical versions of the Arabic language to English. Given the scarcity of gold-standard parallel data for DA-EN in the UGT domain, we introduce a semi-supervised approach that exploits both monolingual and parallel data for training an NMT system i",
    "path": "papers/22/10/2210.11899.json",
    "total_tokens": 908,
    "translated_title": "一种半监督方法以更好地翻译方言阿拉伯语的情感",
    "translated_abstract": "在线世界中，机器翻译系统被广泛用于翻译用户生成的文本（如评论、推文和社交媒体帖子），其中主要信息通常是作者对文本主题的积极或消极态度。然而，MT系统在某些低资源语言中仍然缺乏准确性，并且有时会出现重大的翻译错误，完全翻转目标单词或短语的情感极性，从而传递错误的情感信息。这在不遵循通用词汇和语法标准的文本中特别明显，例如在线平台上使用的阿拉伯方言（DA）。在这项研究中，我们旨在改善用方言版本的阿拉伯语撰写的UGT到英语中的情感翻译。鉴于UGT领域的DA-EN黄金标准并行数据稀缺，我们引入了一种半监督方法，利用单语和平行数据来训练NMT系统。",
    "tldr": "研究旨在提高方言阿拉伯语的情感翻译。使用半监督方法，利用单语和平行数据来训练NMT系统，以提高在低资源语言中MT系统的准确性。",
    "en_tdlr": "The research aims to improve sentiment translation in dialectical Arabic using a semi-supervised approach that trains an NMT system with both monolingual and parallel data, to improve accuracy in low-resource languages."
}