{
    "title": "DisenPOI: Disentangling Sequential and Geographical Influence for Point-of-Interest Recommendation. (arXiv:2210.16591v2 [cs.IR] UPDATED)",
    "abstract": "Point-of-Interest (POI) recommendation plays a vital role in various location-aware services. It has been observed that POI recommendation is driven by both sequential and geographical influences. However, since there is no annotated label of the dominant influence during recommendation, existing methods tend to entangle these two influences, which may lead to sub-optimal recommendation performance and poor interpretability. In this paper, we address the above challenge by proposing DisenPOI, a novel Disentangled dual-graph framework for POI recommendation, which jointly utilizes sequential and geographical relationships on two separate graphs and disentangles the two influences with self-supervision. The key novelty of our model compared with existing approaches is to extract disentangled representations of both sequential and geographical influences with contrastive learning. To be specific, we construct a geographical graph and a sequential graph based on the check-in sequence of a ",
    "link": "http://arxiv.org/abs/2210.16591",
    "context": "Title: DisenPOI: Disentangling Sequential and Geographical Influence for Point-of-Interest Recommendation. (arXiv:2210.16591v2 [cs.IR] UPDATED)\nAbstract: Point-of-Interest (POI) recommendation plays a vital role in various location-aware services. It has been observed that POI recommendation is driven by both sequential and geographical influences. However, since there is no annotated label of the dominant influence during recommendation, existing methods tend to entangle these two influences, which may lead to sub-optimal recommendation performance and poor interpretability. In this paper, we address the above challenge by proposing DisenPOI, a novel Disentangled dual-graph framework for POI recommendation, which jointly utilizes sequential and geographical relationships on two separate graphs and disentangles the two influences with self-supervision. The key novelty of our model compared with existing approaches is to extract disentangled representations of both sequential and geographical influences with contrastive learning. To be specific, we construct a geographical graph and a sequential graph based on the check-in sequence of a ",
    "path": "papers/22/10/2210.16591.json",
    "total_tokens": 873,
    "translated_title": "DisenPOI: 解开顺序和地理影响的POI推荐",
    "translated_abstract": "POI（兴趣点）推荐在各种位置感知服务中起着至关重要的作用。已经观察到POI推荐受到顺序和地理影响的驱动。然而，由于在推荐过程中没有明确指定主导影响的注释标签，现有方法往往会混淆这两种影响，这可能导致次优的推荐性能和差的可解释性。本文通过提出DisenPOI，一个新颖的基于双图的POI推荐解开框架，来解决上述挑战。DisenPOI在两个独立的图上同时利用顺序和地理关系，并通过自我监督解开这两种影响。与现有方法相比，我们的模型的关键创新之处在于使用对比学习提取顺序和地理影响的解开表示。具体而言，我们根据签到序列构建了一个地理图和一个顺序图。",
    "tldr": "本文提出了DisenPOI，一个新颖的基于双图的POI推荐解开框架，通过利用顺序和地理关系并使用自我监督解开这两种影响，以提高推荐性能和可解释性。"
}