{
    "title": "Less is More: SlimG for Accurate, Robust, and Interpretable Graph Mining. (arXiv:2210.04081v4 [cs.LG] UPDATED)",
    "abstract": "How can we solve semi-supervised node classification in various graphs possibly with noisy features and structures? Graph neural networks (GNNs) have succeeded in many graph mining tasks, but their generalizability to various graph scenarios is limited due to the difficulty of training, hyperparameter tuning, and the selection of a model itself. Einstein said that we should \"make everything as simple as possible, but not simpler.\" We rephrase it into the careful simplicity principle: a carefully-designed simple model can surpass sophisticated ones in real-world graphs. Based on the principle, we propose SlimG for semi-supervised node classification, which exhibits four desirable properties: It is (a) accurate, winning or tying on 10 out of 13 real-world datasets; (b) robust, being the only one that handles all scenarios of graph data (homophily, heterophily, random structure, noisy features, etc.); (c) fast and scalable, showing up to 18 times faster training in million-scale graphs; a",
    "link": "http://arxiv.org/abs/2210.04081",
    "context": "Title: Less is More: SlimG for Accurate, Robust, and Interpretable Graph Mining. (arXiv:2210.04081v4 [cs.LG] UPDATED)\nAbstract: How can we solve semi-supervised node classification in various graphs possibly with noisy features and structures? Graph neural networks (GNNs) have succeeded in many graph mining tasks, but their generalizability to various graph scenarios is limited due to the difficulty of training, hyperparameter tuning, and the selection of a model itself. Einstein said that we should \"make everything as simple as possible, but not simpler.\" We rephrase it into the careful simplicity principle: a carefully-designed simple model can surpass sophisticated ones in real-world graphs. Based on the principle, we propose SlimG for semi-supervised node classification, which exhibits four desirable properties: It is (a) accurate, winning or tying on 10 out of 13 real-world datasets; (b) robust, being the only one that handles all scenarios of graph data (homophily, heterophily, random structure, noisy features, etc.); (c) fast and scalable, showing up to 18 times faster training in million-scale graphs; a",
    "path": "papers/22/10/2210.04081.json",
    "total_tokens": 1174,
    "translated_title": "简即是美：针对准确、鲁棒和可解释的图挖掘的SlimG算法",
    "translated_abstract": "在各种可能带有噪声特征和结构的图中，我们如何解决半监督节点分类问题？图神经网络（GNNs）在许多图挖掘任务中取得了成功，但由于训练难度、超参数调整和模型自身选择的困难，它们对于各种图方案的普适性有限。爱因斯坦说过：“让一切尽可能简单，但不要过于简单。”我们重新诠释了这个原则，提出了“小心的简单原则”：一个精心设计的简单模型可以在现实世界的图中超越复杂的模型。基于这一原则，我们提出了SlimG算法，用于半监督节点分类，表现出四个理想的性质：（a）准确，在13个真实数据集中赢得或并列第一；（b）鲁棒，在处理所有图数据场景（同质性、异质性、随机结构、噪声特征等）方面是唯一的；（c）快速可扩展，在百万级图中训练速度最快18倍；（d）可解释，提供它是如何工作的洞察。SlimG算法简单而有效，因为它基于一个直观的归纳偏置，但具有精心设计的消息传递机制。实验结果表明，在各种图场景中，SlimG算法优于最先进的GNN算法，是一个有前途的实用候选算法。",
    "tldr": "SlimG算法是一个简单而有效的图挖掘算法，它基于小心的简单原则，能够在准确性、鲁棒性、可扩展性和可解释性等方面都表现出色，在各种图场景中优于最先进的GNN算法，是一个有前途的实用算法。",
    "en_tdlr": "SlimG is a simple yet effective algorithm for graph mining based on the careful simplicity principle, which exhibits superior performance in accuracy, robustness, scalability, and interpretability compared to state-of-the-art GNNs in various graph scenarios. It shows promising potential for practical use."
}