{
    "title": "Spontaneous emergence of groups and signaling diversity in dynamic networks. (arXiv:2210.17309v2 [cs.SI] UPDATED)",
    "abstract": "We study the coevolution of network structure and signaling behavior. We model agents who can preferentially associate with others in a dynamic network while they also learn to play a simple sender-receiver game. We have four major findings. First, signaling interactions in dynamic networks are sufficient to cause the endogenous formation of distinct signaling groups, even in an initially homogeneous population. Second, dynamic networks allow the emergence of novel {\\em hybrid} signaling groups that do not converge on a single common signaling system but are instead composed of different yet complementary signaling strategies. We show that the presence of these hybrid groups promotes stable diversity in signaling among other groups in the population. Third, we find important distinctions in information processing capacity of different groups: hybrid groups diffuse information more quickly initially but at the cost of taking longer to reach all group members. Fourth, our findings pertai",
    "link": "http://arxiv.org/abs/2210.17309",
    "context": "Title: Spontaneous emergence of groups and signaling diversity in dynamic networks. (arXiv:2210.17309v2 [cs.SI] UPDATED)\nAbstract: We study the coevolution of network structure and signaling behavior. We model agents who can preferentially associate with others in a dynamic network while they also learn to play a simple sender-receiver game. We have four major findings. First, signaling interactions in dynamic networks are sufficient to cause the endogenous formation of distinct signaling groups, even in an initially homogeneous population. Second, dynamic networks allow the emergence of novel {\\em hybrid} signaling groups that do not converge on a single common signaling system but are instead composed of different yet complementary signaling strategies. We show that the presence of these hybrid groups promotes stable diversity in signaling among other groups in the population. Third, we find important distinctions in information processing capacity of different groups: hybrid groups diffuse information more quickly initially but at the cost of taking longer to reach all group members. Fourth, our findings pertai",
    "path": "papers/22/10/2210.17309.json",
    "total_tokens": 949,
    "translated_title": "动态网络中群体和信号多样性的自发出现",
    "translated_abstract": "我们研究了网络结构和信号行为的共同演化。我们模拟了一个动态网络中的代理人，他们可以偏好地与其他人关联，同时学习玩一个简单的发送者-接收者游戏。我们得到了四个主要发现。首先，在动态网络中的信号交互足以导致不同信号群体的内生形成，即使在最初是同质的人口中也可以。其次，动态网络允许出现新型的“混合”信号群体，它们不会趋于一个单一的共同信号系统，而是由不同但互补的信号策略组成。我们发现，这些混合群体的存在促进了人口中其他群体之间信号的稳定多样性。第三，我们发现不同群体的信息处理能力存在重要差别：混合群体在最初传播信息更快，但需要更长时间才能覆盖所有群体成员。第四，我们的发现与网络动态性质以及不同策略在维持和扩散上的影响有关。",
    "tldr": "本研究通过模拟动态网络中的代理人，发现信号交互足以导致不同信号群体的自发形成，并出现了特殊的混合信号群体，这种多样性的存在促进了信号在人口中的稳定分布。",
    "en_tdlr": "This study investigates the coevolution of network structure and signaling behavior in dynamic networks. The findings highlight that signaling interactions can lead to the spontaneous emergence of distinct signaling groups, including the formation of hybrid groups that consist of different yet complementary signaling strategies. The presence of these hybrid groups promotes stable diversity in signaling among other groups in the population. The study also reveals important distinctions in information processing capacity among different groups."
}