{
    "title": "On the Forward Invariance of Neural ODEs. (arXiv:2210.04763v2 [cs.LG] UPDATED)",
    "abstract": "We propose a new method to ensure neural ordinary differential equations (ODEs) satisfy output specifications by using invariance set propagation. Our approach uses a class of control barrier functions to transform output specifications into constraints on the parameters and inputs of the learning system. This setup allows us to achieve output specification guarantees simply by changing the constrained parameters/inputs both during training and inference. Moreover, we demonstrate that our invariance set propagation through data-controlled neural ODEs not only maintains generalization performance but also creates an additional degree of robustness by enabling causal manipulation of the system's parameters/inputs. We test our method on a series of representation learning tasks, including modeling physical dynamics and convexity portraits, as well as safe collision avoidance for autonomous vehicles.",
    "link": "http://arxiv.org/abs/2210.04763",
    "context": "Title: On the Forward Invariance of Neural ODEs. (arXiv:2210.04763v2 [cs.LG] UPDATED)\nAbstract: We propose a new method to ensure neural ordinary differential equations (ODEs) satisfy output specifications by using invariance set propagation. Our approach uses a class of control barrier functions to transform output specifications into constraints on the parameters and inputs of the learning system. This setup allows us to achieve output specification guarantees simply by changing the constrained parameters/inputs both during training and inference. Moreover, we demonstrate that our invariance set propagation through data-controlled neural ODEs not only maintains generalization performance but also creates an additional degree of robustness by enabling causal manipulation of the system's parameters/inputs. We test our method on a series of representation learning tasks, including modeling physical dynamics and convexity portraits, as well as safe collision avoidance for autonomous vehicles.",
    "path": "papers/22/10/2210.04763.json",
    "total_tokens": 803,
    "translated_title": "关于神经ODE的正向不变性",
    "translated_abstract": "我们提出了一种新的方法，通过使用不变集传播来确保神经常微分方程(ODE)满足输出规范。 我们的方法使用一类控制障碍函数将输出规范转换为对学习系统的参数和输入的约束条件。 这个设置使我们能够通过在训练和推理过程中改变受限参数/输入来实现输出规范保证。 此外，我们证明我们通过数据控制的神经ODE的不变集传播不仅保持了概括性能，而且通过启用对系统参数/输入的因果操作创造了额外的鲁棒性。 我们在一系列表示学习任务上测试了我们的方法，包括物理动力学和凸性画像，以及自主车辆的安全避碰。",
    "tldr": "该论文提出了一种利用控制障碍函数使神经ODE满足输出规范的方法，该方法保证了输出规范，且在训练和推理过程中可以通过改变受限参数/输入进行操作，此外，该方法还创造了额外的鲁棒性。",
    "en_tdlr": "This paper proposes a method to ensure neural ODEs satisfy output specifications by using control barrier functions, which not only guarantees output specifications but also creates additional robustness by enabling causal manipulation of the system's parameters/inputs through data-controlled neural ODEs."
}