{
    "title": "Anticipatory Fleet Repositioning for Shared-use Autonomous Mobility Services: An Optimization and Learning-Based Approach. (arXiv:2210.08659v2 [eess.SY] UPDATED)",
    "abstract": "The development of mobility-on-demand services, rich transportation data sources, and autonomous vehicles (AVs) creates significant opportunities for shared-use AV mobility services (SAMSs) to provide accessible and demand-responsive personal mobility. SAMS fleet operation involves multiple interrelated decisions, with a primary focus on efficiently fulfilling passenger ride requests with a high level of service quality. This paper focuses on improving the efficiency and service quality of a SAMS vehicle fleet via anticipatory repositioning of idle vehicles. The rebalancing problem is formulated as a Markov Decision Process, which we propose solving using an advantage actor critic (A2C) reinforcement learning-based method. The proposed approach learns a rebalancing policy that anticipates future demand and cooperates with an optimization-based assignment strategy. The approach allows for centralized repositioning decisions and can handle large vehicle fleets since the problem size does",
    "link": "http://arxiv.org/abs/2210.08659",
    "context": "Title: Anticipatory Fleet Repositioning for Shared-use Autonomous Mobility Services: An Optimization and Learning-Based Approach. (arXiv:2210.08659v2 [eess.SY] UPDATED)\nAbstract: The development of mobility-on-demand services, rich transportation data sources, and autonomous vehicles (AVs) creates significant opportunities for shared-use AV mobility services (SAMSs) to provide accessible and demand-responsive personal mobility. SAMS fleet operation involves multiple interrelated decisions, with a primary focus on efficiently fulfilling passenger ride requests with a high level of service quality. This paper focuses on improving the efficiency and service quality of a SAMS vehicle fleet via anticipatory repositioning of idle vehicles. The rebalancing problem is formulated as a Markov Decision Process, which we propose solving using an advantage actor critic (A2C) reinforcement learning-based method. The proposed approach learns a rebalancing policy that anticipates future demand and cooperates with an optimization-based assignment strategy. The approach allows for centralized repositioning decisions and can handle large vehicle fleets since the problem size does",
    "path": "papers/22/10/2210.08659.json",
    "total_tokens": 993,
    "translated_title": "面向共享自动驾驶出行服务的预测式车队调度：一种基于优化和学习的方法",
    "translated_abstract": "移动出行服务、丰富的交通数据和自动驾驶汽车的发展为共享自动驾驶出行服务（SAMS）提供了重要机遇，以提供可访问和需求响应性的个人出行。本文旨在通过预测性地重新调度空闲的车辆，提高SAMS车队的效率和服务质量。把再平衡问题作为马可夫决策过程进行建模，并提出使用基于优势的演员-评论家（A2C）强化学习方法来解决该问题。所提出的方法学习了一种重新平衡策略，它预测未来需求并与基于优化的分配策略合作。该方法允许集中式的重新定位决策，并且可以处理大型汽车车队，因为问题大小不超过Fleetsize^2。",
    "tldr": "本文提出一种基于优化和学习的方法，通过预测未来需求和合作优化基于分配策略的重新平衡策略，从而改善SAMS车队的服务质量和效率，并在真实数据集上进行的数值实验表明该方法较传统启发式方法具有更好的性能和可靠性。",
    "en_tdlr": "This paper proposes an optimization and learning-based approach for anticipatory fleet repositioning in shared-use autonomous mobility services. The approach learns a rebalancing policy that anticipates future demand and cooperates with an optimization-based assignment strategy to improve fleet efficiency and service quality. Numerical experiments on real datasets show that the approach outperforms traditional heuristic methods in terms of performance and reliability."
}