{
    "title": "Inference on Extreme Quantiles of Unobserved Individual Heterogeneity. (arXiv:2210.08524v2 [econ.EM] UPDATED)",
    "abstract": "We develop a methodology for conducting inference on extreme quantiles of unobserved individual heterogeneity (heterogeneous coefficients, heterogeneous treatment effects, etc.) in a panel data or meta-analysis setting. Inference in such settings is challenging: only noisy estimates of unobserved heterogeneity are available, and approximations based on the central limit theorem work poorly for extreme quantiles. For this situation, under weak assumptions we derive an extreme value theorem and an intermediate order theorem for noisy estimates and appropriate rate and moment conditions. Both theorems are then used to construct confidence intervals for extremal quantiles. The intervals are simple to construct and require no optimization. Inference based on the intermediate order theorem involves a novel self-normalized intermediate order theorem. In simulations, our extremal confidence intervals have favorable coverage properties in the tail. Our methodology is illustrated with an applica",
    "link": "http://arxiv.org/abs/2210.08524",
    "context": "Title: Inference on Extreme Quantiles of Unobserved Individual Heterogeneity. (arXiv:2210.08524v2 [econ.EM] UPDATED)\nAbstract: We develop a methodology for conducting inference on extreme quantiles of unobserved individual heterogeneity (heterogeneous coefficients, heterogeneous treatment effects, etc.) in a panel data or meta-analysis setting. Inference in such settings is challenging: only noisy estimates of unobserved heterogeneity are available, and approximations based on the central limit theorem work poorly for extreme quantiles. For this situation, under weak assumptions we derive an extreme value theorem and an intermediate order theorem for noisy estimates and appropriate rate and moment conditions. Both theorems are then used to construct confidence intervals for extremal quantiles. The intervals are simple to construct and require no optimization. Inference based on the intermediate order theorem involves a novel self-normalized intermediate order theorem. In simulations, our extremal confidence intervals have favorable coverage properties in the tail. Our methodology is illustrated with an applica",
    "path": "papers/22/10/2210.08524.json",
    "total_tokens": 978,
    "translated_title": "论个体异质性极值分位数推断",
    "translated_abstract": "在面板数据或元分析设置中，我们提出了一种方法，用于推断个体异质性（异质性系数、异质性处理效应等）的极值分位数。在这样的设置中，推断是具有挑战性的：只有关于未观测异质性的带有噪声的估计可用，而基于中心极限定理的逼近在极值分位数上效果不佳。针对这种情况，我们在弱假设下推导出噪声估计的极值定理和中间阶定理，以及适当的速率和动量条件。然后，我们使用这两个定理构造极值分位数的置信区间。这些区间易于构造，无需进行优化。基于中间阶定理的推断涉及一种新颖的自标准化中间阶定理。在模拟中，我们的极值置信区间在尾部具有良好的覆盖性质。我们的方法是通过使用来自1979年国家纵向青年调查的数据，对教育回报率分布的估计进行演示。",
    "tldr": "本文提出了一种可计算个体异质性极值分位数置信区间的方法，该方法通过构造极值定理和中间阶定理，以及适当的速率和动量条件来解决只有带有噪声的估计可用的情况下，推断个体异质性的极值分位数的问题。",
    "en_tdlr": "This paper proposes a method for computing confidence intervals for extreme quantiles of unobserved individual heterogeneity, which solves the problem of inferring the extreme quantiles of individual heterogeneity when only estimates with noise are available, by constructing an extreme value theorem and an intermediate order theorem, and appropriate rate and moment conditions."
}