{
    "title": "Law Article-Enhanced Legal Case Matching: a Causal Learning Approach. (arXiv:2210.11012v2 [cs.IR] UPDATED)",
    "abstract": "Legal case matching, which automatically constructs a model to estimate the similarities between the source and target cases, has played an essential role in intelligent legal systems. Semantic text matching models have been applied to the task where the source and target legal cases are considered as long-form text documents. These general-purpose matching models make the predictions solely based on the texts in the legal cases, overlooking the essential role of the law articles in legal case matching. In the real world, the matching results (e.g., relevance labels) are dramatically affected by the law articles because the contents and the judgments of a legal case are radically formed on the basis of law. From the causal sense, a matching decision is affected by the mediation effect from the cited law articles by the legal cases, and the direct effect of the key circumstances (e.g., detailed fact descriptions) in the legal cases. In light of the observation, this paper proposes a mod",
    "link": "http://arxiv.org/abs/2210.11012",
    "context": "Title: Law Article-Enhanced Legal Case Matching: a Causal Learning Approach. (arXiv:2210.11012v2 [cs.IR] UPDATED)\nAbstract: Legal case matching, which automatically constructs a model to estimate the similarities between the source and target cases, has played an essential role in intelligent legal systems. Semantic text matching models have been applied to the task where the source and target legal cases are considered as long-form text documents. These general-purpose matching models make the predictions solely based on the texts in the legal cases, overlooking the essential role of the law articles in legal case matching. In the real world, the matching results (e.g., relevance labels) are dramatically affected by the law articles because the contents and the judgments of a legal case are radically formed on the basis of law. From the causal sense, a matching decision is affected by the mediation effect from the cited law articles by the legal cases, and the direct effect of the key circumstances (e.g., detailed fact descriptions) in the legal cases. In light of the observation, this paper proposes a mod",
    "path": "papers/22/10/2210.11012.json",
    "total_tokens": 759,
    "translated_title": "增强法律案件匹配的法律条款：因果学习方法",
    "translated_abstract": "法律案例匹配在智能法律系统中发挥着重要作用，然而目前的语义文本匹配模型只考虑案件文本的相似度，忽略了法律条款在匹配结果中的作用。本文提出了一种法律条款的因果学习方法来改善匹配结果，实验结果表明我们的方法优于现有的基准方法。",
    "tldr": "本文提出了一种因果学习方法，将法律条款考虑在内以改善法律案件匹配的结果，实验证明该方法优于现有基准方法。",
    "en_tdlr": "This paper proposes a causal learning approach to take the law articles into account for legal case matching, leading to improved relevance labels. Experimental results demonstrate that this method outperforms existing baselines."
}