{
    "title": "Unifying Data Perspectivism and Personalization: An Application to Social Norms. (arXiv:2210.14531v3 [cs.CL] UPDATED)",
    "abstract": "Instead of using a single ground truth for language processing tasks, several recent studies have examined how to represent and predict the labels of the set of annotators. However, often little or no information about annotators is known, or the set of annotators is small. In this work, we examine a corpus of social media posts about conflict from a set of 13k annotators and 210k judgements of social norms. We provide a novel experimental setup that applies personalization methods to the modeling of annotators and compare their effectiveness for predicting the perception of social norms. We further provide an analysis of performance across subsets of social situations that vary by the closeness of the relationship between parties in conflict, and assess where personalization helps the most.",
    "link": "http://arxiv.org/abs/2210.14531",
    "context": "Title: Unifying Data Perspectivism and Personalization: An Application to Social Norms. (arXiv:2210.14531v3 [cs.CL] UPDATED)\nAbstract: Instead of using a single ground truth for language processing tasks, several recent studies have examined how to represent and predict the labels of the set of annotators. However, often little or no information about annotators is known, or the set of annotators is small. In this work, we examine a corpus of social media posts about conflict from a set of 13k annotators and 210k judgements of social norms. We provide a novel experimental setup that applies personalization methods to the modeling of annotators and compare their effectiveness for predicting the perception of social norms. We further provide an analysis of performance across subsets of social situations that vary by the closeness of the relationship between parties in conflict, and assess where personalization helps the most.",
    "path": "papers/22/10/2210.14531.json",
    "total_tokens": 831,
    "translated_title": "统一数据观点和个性化: 应用于社会规范的研究",
    "translated_abstract": "在语言处理任务中，不再使用单一的真实标签，近期研究着重于如何表示和预测一组标注者的标签。然而，对于标注者的信息往往很少或没有了解，或者标注者的数量很少。本研究分析了一组13k标注者对210k项社会规范的评价，并提供了一种将个性化方法应用于标注者建模的实验设计，比较了个性化方法对预测社会规范认知的有效性。我们进一步对不同社交情境的子集进行表现分析，这些情境根据冲突各方之间关系的亲密度而异，评估个性化方法在哪些方面的效果最好。",
    "tldr": "本研究提出了一种应用于社会规范的个性化方法，通过分析一组标注者对社交媒体帖子的评价来预测社会规范的认知。实验证明，个性化方法在预测社会规范认知方面具有较好的效果，并在不同社交情境的子集中的表现有所差异。"
}