{
    "title": "Diffusion Models for Graphs Benefit From Discrete State Spaces. (arXiv:2210.01549v4 [cs.LG] UPDATED)",
    "abstract": "Denoising diffusion probabilistic models and score-matching models have proven to be very powerful for generative tasks. While these approaches have also been applied to the generation of discrete graphs, they have, so far, relied on continuous Gaussian perturbations. Instead, in this work, we suggest using discrete noise for the forward Markov process. This ensures that in every intermediate step the graph remains discrete. Compared to the previous approach, our experimental results on four datasets and multiple architectures show that using a discrete noising process results in higher quality generated samples indicated with an average MMDs reduced by a factor of 1.5. Furthermore, the number of denoising steps is reduced from 1000 to 32 steps, leading to a 30 times faster sampling procedure.",
    "link": "http://arxiv.org/abs/2210.01549",
    "context": "Title: Diffusion Models for Graphs Benefit From Discrete State Spaces. (arXiv:2210.01549v4 [cs.LG] UPDATED)\nAbstract: Denoising diffusion probabilistic models and score-matching models have proven to be very powerful for generative tasks. While these approaches have also been applied to the generation of discrete graphs, they have, so far, relied on continuous Gaussian perturbations. Instead, in this work, we suggest using discrete noise for the forward Markov process. This ensures that in every intermediate step the graph remains discrete. Compared to the previous approach, our experimental results on four datasets and multiple architectures show that using a discrete noising process results in higher quality generated samples indicated with an average MMDs reduced by a factor of 1.5. Furthermore, the number of denoising steps is reduced from 1000 to 32 steps, leading to a 30 times faster sampling procedure.",
    "path": "papers/22/10/2210.01549.json",
    "total_tokens": 805,
    "translated_title": "图的扩散模型受益于离散状态空间",
    "translated_abstract": "去噪扩散概率模型和评分匹配模型已被证明在生成任务中非常强大。虽然这些方法也被应用于离散图的生成，但迄今为止，它们仍依赖于连续高斯扰动。相反，在本研究中，我们建议使用离散噪声进行前向马尔可夫过程。这确保在每个中间步骤中，图保持离散。与先前的方法相比，我们在四个数据集和多个架构上的实验结果显示，使用离散噪声处理过程生成的样本质量更高，平均 MMDs 降低了1.5倍。此外，去噪步骤的数量从1000减少到32步，导致采样过程速度提高了30倍。",
    "tldr": "本论文提出了一种在生成离散图时使用离散噪声的方法，相比于之前的方法，实验证明使用离散噪声可以生成更高质量的样本，同时采样过程速度提高了30倍。",
    "en_tdlr": "This paper proposes a method to use discrete noise for generating discrete graphs, and experimental results show that using discrete noise improves the quality of generated samples and speeds up the sampling process by 30 times compared to previous methods."
}