{
    "title": "Online LiDAR-Camera Extrinsic Parameters Self-checking. (arXiv:2210.10537v2 [cs.CV] UPDATED)",
    "abstract": "With the development of neural networks and the increasing popularity of automatic driving, the calibration of the LiDAR and the camera has attracted more and more attention. This calibration task is multi-modal, where the rich color and texture information captured by the camera and the accurate three-dimensional spatial information from the LiDAR is incredibly significant for downstream tasks. Current research interests mainly focus on obtaining accurate calibration results through information fusion. However, they seldom analyze whether the calibrated results are correct or not, which could be of significant importance in real-world applications. For example, in large-scale production, the LiDARs and the cameras of each smart car have to get well-calibrated as the car leaves the production line, while in the rest of the car life period, the poses of the LiDARs and cameras should also get continually supervised to ensure the security. To this end, this paper proposes a self-checking ",
    "link": "http://arxiv.org/abs/2210.10537",
    "context": "Title: Online LiDAR-Camera Extrinsic Parameters Self-checking. (arXiv:2210.10537v2 [cs.CV] UPDATED)\nAbstract: With the development of neural networks and the increasing popularity of automatic driving, the calibration of the LiDAR and the camera has attracted more and more attention. This calibration task is multi-modal, where the rich color and texture information captured by the camera and the accurate three-dimensional spatial information from the LiDAR is incredibly significant for downstream tasks. Current research interests mainly focus on obtaining accurate calibration results through information fusion. However, they seldom analyze whether the calibrated results are correct or not, which could be of significant importance in real-world applications. For example, in large-scale production, the LiDARs and the cameras of each smart car have to get well-calibrated as the car leaves the production line, while in the rest of the car life period, the poses of the LiDARs and cameras should also get continually supervised to ensure the security. To this end, this paper proposes a self-checking ",
    "path": "papers/22/10/2210.10537.json",
    "total_tokens": 795,
    "translated_title": "在线LiDAR-相机外参自检",
    "translated_abstract": "随着神经网络的发展和自动驾驶的普及，LiDAR和相机的标定越来越受到关注。这个标定任务是多模态的，相机捕捉到的丰富的颜色和纹理信息以及LiDAR获取到的精确的三维空间信息对于下游任务非常重要。目前的研究主要集中在通过信息融合获得准确的标定结果。然而，他们很少分析标定结果是否正确，这在实际应用中非常重要。例如，在大规模生产中，每辆智能车的LiDAR和相机在离开生产线时必须获得良好的校准，而在车辆使用期间，LiDAR和相机的位姿也应该持续受到监督以确保安全。为此，本文提出了一种自检算法。",
    "tldr": "本文提出了一种在线LiDAR-相机外参自检算法，解决了当前标定研究忽视标定结果正确性的问题。"
}