{
    "title": "SMiLE: Schema-augmented Multi-level Contrastive Learning for Knowledge Graph Link Prediction",
    "abstract": "arXiv:2210.04870v3 Announce Type: replace-cross  Abstract: Link prediction is the task of inferring missing links between entities in knowledge graphs. Embedding-based methods have shown effectiveness in addressing this problem by modeling relational patterns in triples. However, the link prediction task often requires contextual information in entity neighborhoods, while most existing embedding-based methods fail to capture it. Additionally, little attention is paid to the diversity of entity representations in different contexts, which often leads to false prediction results. In this situation, we consider that the schema of knowledge graph contains the specific contextual information, and it is beneficial for preserving the consistency of entities across contexts. In this paper, we propose a novel Schema-augmented Multi-level contrastive LEarning framework (SMiLE) to conduct knowledge graph link prediction. Specifically, we first exploit network schema as the prior constraint to sam",
    "link": "https://arxiv.org/abs/2210.04870",
    "context": "Title: SMiLE: Schema-augmented Multi-level Contrastive Learning for Knowledge Graph Link Prediction\nAbstract: arXiv:2210.04870v3 Announce Type: replace-cross  Abstract: Link prediction is the task of inferring missing links between entities in knowledge graphs. Embedding-based methods have shown effectiveness in addressing this problem by modeling relational patterns in triples. However, the link prediction task often requires contextual information in entity neighborhoods, while most existing embedding-based methods fail to capture it. Additionally, little attention is paid to the diversity of entity representations in different contexts, which often leads to false prediction results. In this situation, we consider that the schema of knowledge graph contains the specific contextual information, and it is beneficial for preserving the consistency of entities across contexts. In this paper, we propose a novel Schema-augmented Multi-level contrastive LEarning framework (SMiLE) to conduct knowledge graph link prediction. Specifically, we first exploit network schema as the prior constraint to sam",
    "path": "papers/22/10/2210.04870.json",
    "total_tokens": 835,
    "translated_title": "SMiLE：基于模式增强的多层对比学习用于知识图谱链接预测",
    "translated_abstract": "链接预测是推断知识图谱中实体之间缺失链接的任务。基于嵌入的方法通过建模三元组中的关系模式在解决此问题方面表现出有效性。然而，链接预测任务通常需要实体邻域中的上下文信息，而大多数现有的基于嵌入的方法未能捕捉到它。此外，很少有关注不同上下文中实体表示的多样性，这经常导致错误的预测结果。在这种情况下，我们认为知识图谱的模式包含特定的上下文信息，并且有助于保持实体在不同上下文中的一致性。在本文中，我们提出了一种新颖的基于模式增强的多层对比学习框架（SMiLE）来进行知识图谱链接预测。",
    "tldr": "提出了一种新颖的基于模式增强的多层对比学习框架（SMiLE），用于知识图谱链接预测，通过利用网络模式作为先验约束来提高链接预测的准确性和上下文一致性。",
    "en_tdlr": "Introduced a novel Schema-augmented Multi-level contrastive LEarning framework (SMiLE) for knowledge graph link prediction, which leverages network schema as prior constraint to enhance prediction accuracy and context consistency."
}