{
    "title": "Finite-time analysis of single-timescale actor-critic. (arXiv:2210.09921v3 [cs.LG] UPDATED)",
    "abstract": "Actor-critic methods have achieved significant success in many challenging applications. However, its finite-time convergence is still poorly understood in the most practical single-timescale form. Existing works on analyzing single-timescale actor-critic have been limited to i.i.d. sampling or tabular setting for simplicity. We investigate the more practical online single-timescale actor-critic algorithm on continuous state space, where the critic assumes linear function approximation and updates with a single Markovian sample per actor step. Previous analysis has been unable to establish the convergence for such a challenging scenario. We demonstrate that the online single-timescale actor-critic method provably finds an $\\epsilon$-approximate stationary point with $\\widetilde{\\mathcal{O}}(\\epsilon^{-2})$ sample complexity under standard assumptions, which can be further improved to $\\mathcal{O}(\\epsilon^{-2})$ under the i.i.d. sampling. Our novel framework systematically evaluates an",
    "link": "http://arxiv.org/abs/2210.09921",
    "context": "Title: Finite-time analysis of single-timescale actor-critic. (arXiv:2210.09921v3 [cs.LG] UPDATED)\nAbstract: Actor-critic methods have achieved significant success in many challenging applications. However, its finite-time convergence is still poorly understood in the most practical single-timescale form. Existing works on analyzing single-timescale actor-critic have been limited to i.i.d. sampling or tabular setting for simplicity. We investigate the more practical online single-timescale actor-critic algorithm on continuous state space, where the critic assumes linear function approximation and updates with a single Markovian sample per actor step. Previous analysis has been unable to establish the convergence for such a challenging scenario. We demonstrate that the online single-timescale actor-critic method provably finds an $\\epsilon$-approximate stationary point with $\\widetilde{\\mathcal{O}}(\\epsilon^{-2})$ sample complexity under standard assumptions, which can be further improved to $\\mathcal{O}(\\epsilon^{-2})$ under the i.i.d. sampling. Our novel framework systematically evaluates an",
    "path": "papers/22/10/2210.09921.json",
    "total_tokens": 979,
    "translated_title": "单时间尺度演员-评论家法的有限时间分析",
    "translated_abstract": "在许多具有挑战性的应用中，演员-评论家方法取得了显着的成功。然而，在最实际的单时间尺度形式下，其有限时间收敛性仍然不够理解。现有的单时间尺度演员-评论家分析工作仅限于简化的i.i.d.采样或表格设置。我们研究了更实际的在线单时间尺度演员-评论家算法，该算法在连续状态空间中，评论家采用线性函数逼近，并在每个演员步骤中使用单个马尔可夫样本进行更新。先前的分析无法在这种具有挑战性的场景中实现收敛。我们证明，在标准假设下，在线单时间尺度演员-评论家方法能够在样本复杂度为$\\widetilde{\\mathcal{O}}(\\epsilon^{-2})$的情况下找到一个$\\epsilon$-近似的稳定点，而在i.i.d.采样下，这个复杂度可以进一步改进为$\\mathcal{O}(\\epsilon^{-2})$。我们的新框架系统地评估了一个",
    "tldr": "这项研究提出了一种在线单时间尺度演员-评论家方法，通过线性函数逼近和马尔可夫样本更新，在连续状态空间中找到了一个$\\epsilon$-近似的稳定点，并且在样本复杂度为$\\widetilde{\\mathcal{O}}(\\epsilon^{-2})$的情况下证明了其收敛性。",
    "en_tdlr": "This research proposes an online single-timescale actor-critic method that uses linear function approximation and Markovian sample updates to find an $\\epsilon$-approximate stationary point in continuous state space. The convergence of the method is proven with a sample complexity of $\\widetilde{\\mathcal{O}}(\\epsilon^{-2})$."
}