{
    "title": "Exploration Policies for On-the-Fly Controller Synthesis: A Reinforcement Learning Approach. (arXiv:2210.05393v2 [cs.LG] UPDATED)",
    "abstract": "Controller synthesis is in essence a case of model-based planning for non-deterministic environments in which plans (actually ''strategies'') are meant to preserve system goals indefinitely. In the case of supervisory control environments are specified as the parallel composition of state machines and valid strategies are required to be ''non-blocking'' (i.e., always enabling the environment to reach certain marked states) in addition to safe (i.e., keep the system within a safe zone). Recently, On-the-fly Directed Controller Synthesis techniques were proposed to avoid the exploration of the entire -and exponentially large-environment space, at the cost of non-maximal permissiveness, to either find a strategy or conclude that there is none. The incremental exploration of the plant is currently guided by a domain-independent human-designed heuristic. In this work, we propose a new method for obtaining heuristics based on Reinforcement Learning (RL). The synthesis algorithm is thus frame",
    "link": "http://arxiv.org/abs/2210.05393",
    "context": "Title: Exploration Policies for On-the-Fly Controller Synthesis: A Reinforcement Learning Approach. (arXiv:2210.05393v2 [cs.LG] UPDATED)\nAbstract: Controller synthesis is in essence a case of model-based planning for non-deterministic environments in which plans (actually ''strategies'') are meant to preserve system goals indefinitely. In the case of supervisory control environments are specified as the parallel composition of state machines and valid strategies are required to be ''non-blocking'' (i.e., always enabling the environment to reach certain marked states) in addition to safe (i.e., keep the system within a safe zone). Recently, On-the-fly Directed Controller Synthesis techniques were proposed to avoid the exploration of the entire -and exponentially large-environment space, at the cost of non-maximal permissiveness, to either find a strategy or conclude that there is none. The incremental exploration of the plant is currently guided by a domain-independent human-designed heuristic. In this work, we propose a new method for obtaining heuristics based on Reinforcement Learning (RL). The synthesis algorithm is thus frame",
    "path": "papers/22/10/2210.05393.json",
    "total_tokens": 958,
    "translated_title": "基于强化学习的即兴控制器合成策略探索算法研究",
    "translated_abstract": "控制器合成是基于模型的规划的一种，本文提出一种基于强化学习方法获得启发式来进行有向控制器合成的算法研究。此算法的增量探索由与领域无关的人工设计引导。",
    "tldr": "本文提出了一种基于强化学习的方法，用于产生启发式来指导有向控制器合成算法的增量探索过程。",
    "en_tdlr": "This paper proposes a reinforcement learning-based method for generating heuristics to guide the incremental exploration process in on-the-fly directed controller synthesis algorithm."
}