{
    "title": "Syntactic Surprisal From Neural Models Predicts, But Underestimates, Human Processing Difficulty From Syntactic Ambiguities. (arXiv:2210.12187v2 [cs.CL] UPDATED)",
    "abstract": "Humans exhibit garden path effects: When reading sentences that are temporarily structurally ambiguous, they slow down when the structure is disambiguated in favor of the less preferred alternative. Surprisal theory (Hale, 2001; Levy, 2008), a prominent explanation of this finding, proposes that these slowdowns are due to the unpredictability of each of the words that occur in these sentences. Challenging this hypothesis, van Schijndel & Linzen (2021) find that estimates of the cost of word predictability derived from language models severely underestimate the magnitude of human garden path effects. In this work, we consider whether this underestimation is due to the fact that humans weight syntactic factors in their predictions more highly than language models do. We propose a method for estimating syntactic predictability from a language model, allowing us to weigh the cost of lexical and syntactic predictability independently. We find that treating syntactic predictability independe",
    "link": "http://arxiv.org/abs/2210.12187",
    "context": "Title: Syntactic Surprisal From Neural Models Predicts, But Underestimates, Human Processing Difficulty From Syntactic Ambiguities. (arXiv:2210.12187v2 [cs.CL] UPDATED)\nAbstract: Humans exhibit garden path effects: When reading sentences that are temporarily structurally ambiguous, they slow down when the structure is disambiguated in favor of the less preferred alternative. Surprisal theory (Hale, 2001; Levy, 2008), a prominent explanation of this finding, proposes that these slowdowns are due to the unpredictability of each of the words that occur in these sentences. Challenging this hypothesis, van Schijndel & Linzen (2021) find that estimates of the cost of word predictability derived from language models severely underestimate the magnitude of human garden path effects. In this work, we consider whether this underestimation is due to the fact that humans weight syntactic factors in their predictions more highly than language models do. We propose a method for estimating syntactic predictability from a language model, allowing us to weigh the cost of lexical and syntactic predictability independently. We find that treating syntactic predictability independe",
    "path": "papers/22/10/2210.12187.json",
    "total_tokens": 1019,
    "translated_title": "从神经模型中的句法意外感知预测人类在句法歧义中的处理困难，但低估了其程度",
    "translated_abstract": "人类在阅读暂时具有结构歧义的句子时表现出花园小径效应，当结构被消除歧义为不太受欢迎的选择时，他们会放慢阅读速度。Surprisal理论（Hale, 2001; Levy, 2008）作为对此现象的一个重要解释，认为这种放慢是由这些句子中每个单词的不可预测性引起的。van Schijndel和Linzen（2021）对此假设提出了质疑，他们发现从语言模型中获取的单词可预测性代价估计严重低估了人类花园小径效应的程度。本研究考虑了这种低估是否是因为人类在预测中更高地权衡了句法因素，而语言模型并未如此。我们提出了一种从语言模型中估计句法预测性的方法，使我们能够独立评估词汇和句法预测性的代价。我们发现独立考虑句法预测性会产生更准确的估计结果。",
    "tldr": "人类在阅读句法歧义句子时会放慢阅读速度，Surprisal理论认为这是由于句子中每个单词的不可预测性，但这种理论低估了人类的效应。本研究通过独立考虑句法预测性，提出了一种更准确的估计方法。",
    "en_tdlr": "Humans slow down when reading structurally ambiguous sentences due to the unpredictability of each word, but Surprisal theory underestimates this effect. This study proposes a more accurate estimation method by considering syntactic predictability independently."
}