{
    "title": "E3Bind: An End-to-End Equivariant Network for Protein-Ligand Docking. (arXiv:2210.06069v2 [q-bio.BM] UPDATED)",
    "abstract": "In silico prediction of the ligand binding pose to a given protein target is a crucial but challenging task in drug discovery. This work focuses on blind flexible selfdocking, where we aim to predict the positions, orientations and conformations of docked molecules. Traditional physics-based methods usually suffer from inaccurate scoring functions and high inference cost. Recently, data-driven methods based on deep learning techniques are attracting growing interest thanks to their efficiency during inference and promising performance. These methods usually either adopt a two-stage approach by first predicting the distances between proteins and ligands and then generating the final coordinates based on the predicted distances, or directly predicting the global roto-translation of ligands. In this paper, we take a different route. Inspired by the resounding success of AlphaFold2 for protein structure prediction, we propose E3Bind, an end-to-end equivariant network that iteratively updat",
    "link": "http://arxiv.org/abs/2210.06069",
    "context": "Title: E3Bind: An End-to-End Equivariant Network for Protein-Ligand Docking. (arXiv:2210.06069v2 [q-bio.BM] UPDATED)\nAbstract: In silico prediction of the ligand binding pose to a given protein target is a crucial but challenging task in drug discovery. This work focuses on blind flexible selfdocking, where we aim to predict the positions, orientations and conformations of docked molecules. Traditional physics-based methods usually suffer from inaccurate scoring functions and high inference cost. Recently, data-driven methods based on deep learning techniques are attracting growing interest thanks to their efficiency during inference and promising performance. These methods usually either adopt a two-stage approach by first predicting the distances between proteins and ligands and then generating the final coordinates based on the predicted distances, or directly predicting the global roto-translation of ligands. In this paper, we take a different route. Inspired by the resounding success of AlphaFold2 for protein structure prediction, we propose E3Bind, an end-to-end equivariant network that iteratively updat",
    "path": "papers/22/10/2210.06069.json",
    "total_tokens": 948,
    "translated_title": "E3Bind: 一种用于蛋白质-配体对接的端到端等变网络",
    "translated_abstract": "在药物发现中，对于给定的蛋白质靶点，预测配体结合位姿是一项至关重要但具有挑战性的任务。本文针对盲目柔性自对接进行了研究，旨在预测被对接分子的位置、方向和构象。传统的基于物理的方法通常受到评分函数不准确和推断成本高的困扰。而最近，基于深度学习技术的数据驱动方法由于其推断效率高和性能优异而越来越受到关注。这些方法通常采用两阶段方法，首先预测蛋白质和配体之间的距离，然后根据预测的距离生成最终的坐标，或者直接预测配体的全局旋转平移。本文提出了一种不同的方法。受到 AlphaFold2 在蛋白质结构预测方面的巨大成功的启发，我们提出了 E3Bind，一种端到端的等变网络，通过迭代更新来预测蛋白质和配体之间的相互作用。",
    "tldr": "本研究提出了一种新的方法，利用E3Bind这一端到端等变网络来预测蛋白质与配体之间的相互作用，以达到在药物发现中更为准确和高效的配体结合位点预测。",
    "en_tdlr": "This research proposes a novel method that utilizes the end-to-end equivariant network called E3Bind to predict the interaction between proteins and ligands, with the aim of achieving more accurate and efficient prediction of binding sites in drug discovery."
}