{
    "title": "Inference in conditioned dynamics through causality restoration. (arXiv:2210.10179v2 [physics.data-an] UPDATED)",
    "abstract": "Computing observables from conditioned dynamics is typically computationally hard, because, although obtaining independent samples efficiently from the unconditioned dynamics is usually feasible, generally most of the samples must be discarded (in a form of importance sampling) because they do not satisfy the imposed conditions. Sampling directly from the conditioned distribution is non-trivial, as conditioning breaks the causal properties of the dynamics which ultimately renders the sampling procedure efficient. One standard way of achieving it is through a Metropolis Monte-Carlo procedure, but this procedure is normally slow and a very large number of Monte-Carlo steps is needed to obtain a small number of statistically independent samples. In this work, we propose an alternative method to produce independent samples from a conditioned distribution. The method learns the parameters of a generalized dynamical model that optimally describe the conditioned distribution in a variational ",
    "link": "http://arxiv.org/abs/2210.10179",
    "context": "Title: Inference in conditioned dynamics through causality restoration. (arXiv:2210.10179v2 [physics.data-an] UPDATED)\nAbstract: Computing observables from conditioned dynamics is typically computationally hard, because, although obtaining independent samples efficiently from the unconditioned dynamics is usually feasible, generally most of the samples must be discarded (in a form of importance sampling) because they do not satisfy the imposed conditions. Sampling directly from the conditioned distribution is non-trivial, as conditioning breaks the causal properties of the dynamics which ultimately renders the sampling procedure efficient. One standard way of achieving it is through a Metropolis Monte-Carlo procedure, but this procedure is normally slow and a very large number of Monte-Carlo steps is needed to obtain a small number of statistically independent samples. In this work, we propose an alternative method to produce independent samples from a conditioned distribution. The method learns the parameters of a generalized dynamical model that optimally describe the conditioned distribution in a variational ",
    "path": "papers/22/10/2210.10179.json",
    "total_tokens": 776,
    "translated_title": "经由因果性恢复在条件动力学中进行推断",
    "translated_abstract": "从有条件的动力学中计算可观测量通常是计算上困难的，因为虽然从非条件的动力学中高效地获取独立样本通常是可行的，但通常必须丢弃大部分样本(以一种重要性抽样的形式)因为它们不满足所施加的条件。直接从有条件的分布中抽样是不易的，因为条件打破了动力学的因果特性，最终使抽样过程变得低效。一种标准的方法是通过Metropolis Monte-Carlo过程实现，但这个过程通常很慢，需要大量的Monte-Carlo步骤来获得少量的统计独立样本。我们提出了一种替代方法，用于从有条件的分布中产生独立的样本。该方法学习一个广义动力学模型的参数，该模型最优地描述了条件分布的变分。",
    "tldr": "本文提出了一种经由因果性恢复的方式来产生条件分布下的独立样本。",
    "en_tdlr": "This paper proposes an alternative method to produce independent samples from a conditioned distribution through causality restoration."
}