{
    "title": "Online Learning Models for Vehicle Usage Prediction During COVID-19",
    "abstract": "arXiv:2210.16002v2 Announce Type: replace  Abstract: Today, there is an ongoing transition to more sustainable transportation, for which an essential part is the switch from combustion engine vehicles to battery electric vehicles (BEVs). BEVs have many advantages from a sustainability perspective, but issues such as limited driving range and long recharge times slow down the transition from combustion engines. One way to mitigate these issues is by performing battery thermal preconditioning, which increases the energy efficiency of the battery. However, to optimally perform battery thermal preconditioning, the vehicle usage pattern needs to be known, i.e., how and when the vehicle will be used. This study attempts to predict the departure time and distance of the first drive each day using online machine learning models. The online machine learning models are trained and evaluated on historical driving data collected from a fleet of BEVs during the COVID-19 pandemic. Additionally, the ",
    "link": "https://arxiv.org/abs/2210.16002",
    "context": "Title: Online Learning Models for Vehicle Usage Prediction During COVID-19\nAbstract: arXiv:2210.16002v2 Announce Type: replace  Abstract: Today, there is an ongoing transition to more sustainable transportation, for which an essential part is the switch from combustion engine vehicles to battery electric vehicles (BEVs). BEVs have many advantages from a sustainability perspective, but issues such as limited driving range and long recharge times slow down the transition from combustion engines. One way to mitigate these issues is by performing battery thermal preconditioning, which increases the energy efficiency of the battery. However, to optimally perform battery thermal preconditioning, the vehicle usage pattern needs to be known, i.e., how and when the vehicle will be used. This study attempts to predict the departure time and distance of the first drive each day using online machine learning models. The online machine learning models are trained and evaluated on historical driving data collected from a fleet of BEVs during the COVID-19 pandemic. Additionally, the ",
    "path": "papers/22/10/2210.16002.json",
    "total_tokens": 801,
    "translated_title": "COVID-19期间车辆使用预测的在线学习模型",
    "translated_abstract": "今天，可持续交通正处于持续转型阶段，其中关键部分是从内燃机车辆转向电池电动车辆（BEVs）。 BEVs在可持续性角度具有许多优势，但诸如有限的行驶里程和长充电时间等问题减缓了从燃烧发动机向电池电动车辆的转变。缓解这些问题的一种方法是通过执行电池热预调条件，从而提高电池的能源效率。然而，为了最佳执行电池热预调条件，需要了解车辆的使用模式，即车辆将如何以及何时使用。本研究尝试使用在线机器学习模型来预测每天第一次行驶的出发时间和距离。在线机器学习模型是在收集自COVID-19大流行期间一队BEVs的历史驾驶数据上进行训练和评估的。",
    "tldr": "该研究尝试使用在线机器学习模型预测COVID-19期间一队BEVs的出发时间和距离。",
    "en_tdlr": "This study aims to predict the departure time and distance of a fleet of BEVs during COVID-19 using online machine learning models."
}