{
    "title": "Autoencoded sparse Bayesian in-IRT factorization, calibration, and amortized inference for the Work Disability Functional Assessment Battery. (arXiv:2210.10952v4 [stat.ME] UPDATED)",
    "abstract": "The Work Disability Functional Assessment Battery (WD-FAB) is a multidimensional item response theory (IRT) instrument designed for assessing work-related mental and physical function based on responses to an item bank. In prior iterations it was developed using traditional means -- linear factorization and null hypothesis statistical testing for item partitioning/selection, and finally, posthoc calibration of disjoint unidimensional IRT models. As a result, the WD-FAB, like many other IRT instruments, is a posthoc model. Its item partitioning, based on exploratory factor analysis, is blind to the final nonlinear IRT model and is not performed in a manner consistent with goodness of fit to the final model. In this manuscript, we develop a Bayesian hierarchical model for self-consistently performing the following simultaneous tasks: scale factorization, item selection, parameter identification, and response scoring. This method uses sparsity-based shrinkage to obviate the linear factori",
    "link": "http://arxiv.org/abs/2210.10952",
    "context": "Title: Autoencoded sparse Bayesian in-IRT factorization, calibration, and amortized inference for the Work Disability Functional Assessment Battery. (arXiv:2210.10952v4 [stat.ME] UPDATED)\nAbstract: The Work Disability Functional Assessment Battery (WD-FAB) is a multidimensional item response theory (IRT) instrument designed for assessing work-related mental and physical function based on responses to an item bank. In prior iterations it was developed using traditional means -- linear factorization and null hypothesis statistical testing for item partitioning/selection, and finally, posthoc calibration of disjoint unidimensional IRT models. As a result, the WD-FAB, like many other IRT instruments, is a posthoc model. Its item partitioning, based on exploratory factor analysis, is blind to the final nonlinear IRT model and is not performed in a manner consistent with goodness of fit to the final model. In this manuscript, we develop a Bayesian hierarchical model for self-consistently performing the following simultaneous tasks: scale factorization, item selection, parameter identification, and response scoring. This method uses sparsity-based shrinkage to obviate the linear factori",
    "path": "papers/22/10/2210.10952.json",
    "total_tokens": 963,
    "translated_title": "自编码稀疏贝叶斯的IRT因子分解，校准，和摩尔滋互反推断：以工作残障功能评估电池 (WD-FAB) 为例",
    "translated_abstract": "工作残障功能评估电池 (WD-FAB) 是一种基于条目库的，用于评估职业相关的心理和身体功能的多维物品反应理论 (IRT) 工具。本文开发了一种贝叶斯层级模型，实现以下同时任务：尺度分解，条目选择，参数识别和响应评分。这种方法利用基于稀疏性的收缩，消除了线性因子化/IRT模型的高度参数化问题，而后用自动编码器进行摩尔滋互反推断计算。我们证明这一方法在WD-FAB中的应用，以及与传统方法的比较表明了其显著的提高。",
    "tldr": "本文开发了一种贝叶斯层级模型，利用基于稀疏性的收缩和自编码器，实现了工作残障功能评估电池的尺度分解、条目选择、参数识别和响应评分，并取得了显著的提高。"
}