{
    "title": "Multi-mode fiber reservoir computing overcomes shallow neural networks classifiers. (arXiv:2210.04745v2 [physics.optics] UPDATED)",
    "abstract": "In the field of disordered photonics, a common objective is to characterize optically opaque materials for controlling light delivery or performing imaging. Among various complex devices, multi-mode optical fibers stand out as cost-effective and easy-to-handle tools, making them attractive for several tasks. In this context, we leverage the reservoir computing paradigm to recast these fibers into random hardware projectors, transforming an input dataset into a higher dimensional speckled image set. The goal of our study is to demonstrate that using such randomized data for classification by training a single logistic regression layer improves accuracy compared to training on direct raw images. Interestingly, we found that the classification accuracy achieved using the reservoir is also higher than that obtained with the standard transmission matrix model, a widely accepted tool for describing light transmission through disordered devices. We find that the reason for such improved perfo",
    "link": "http://arxiv.org/abs/2210.04745",
    "context": "Title: Multi-mode fiber reservoir computing overcomes shallow neural networks classifiers. (arXiv:2210.04745v2 [physics.optics] UPDATED)\nAbstract: In the field of disordered photonics, a common objective is to characterize optically opaque materials for controlling light delivery or performing imaging. Among various complex devices, multi-mode optical fibers stand out as cost-effective and easy-to-handle tools, making them attractive for several tasks. In this context, we leverage the reservoir computing paradigm to recast these fibers into random hardware projectors, transforming an input dataset into a higher dimensional speckled image set. The goal of our study is to demonstrate that using such randomized data for classification by training a single logistic regression layer improves accuracy compared to training on direct raw images. Interestingly, we found that the classification accuracy achieved using the reservoir is also higher than that obtained with the standard transmission matrix model, a widely accepted tool for describing light transmission through disordered devices. We find that the reason for such improved perfo",
    "path": "papers/22/10/2210.04745.json",
    "total_tokens": 911,
    "translated_title": "多模光纤水库计算克服了浅层神经网络分类器",
    "translated_abstract": "在无序光子学领域中，常见的目标是对不透明材料进行表征，以控制光的传递或执行成像。在各种复杂的器件中，多模光纤以其成本效益高、易于操作的特点脱颖而出，使其在几个任务中具有吸引力。在这个背景下，我们利用水库计算范例，将这些光纤转化为随机硬件投影仪，将输入数据集转化为高维斑点图像集。我们的研究目标是证明，通过训练单个逻辑回归层对这些随机数据进行分类，可以提高精度，相比之下直接训练原始图像要更为准确。有趣的是，我们发现使用水库所达到的分类准确性也高于采用传统的传输矩阵模型，后者是描述通过无序器件传递光的广泛接受工具。我们发现，这种改进性能的原因在于水库的动力学具有更高的容量来捕捉复杂的输入输出映射，相对于传输矩阵的线性映射。",
    "tldr": "多模光纤利用水库计算范例进行分类，精度高于直接训练原始图像和传统的传输矩阵模型。",
    "en_tdlr": "Multi-mode fiber classification using reservoir computing achieves higher accuracy than direct training on raw images and the traditional transmission matrix model."
}