{
    "title": "Experimental observations of fractal landscape dynamics in a dense emulsion. (arXiv:2210.13667v2 [cond-mat.soft] UPDATED)",
    "abstract": "Many soft and biological materials display so-called 'soft glassy' dynamics; their constituents undergo anomalous random motions and complex cooperative rearrangements. A recent simulation model of one soft glassy material, a coarsening foam, suggested that the random motions of its bubbles are due to the system configuration moving over a fractal energy landscape in high-dimensional space. Here we show that the salient geometrical features of such high-dimensional fractal landscapes can be explored and reliably quantified, using empirical trajectory data from many degrees of freedom, in a model-free manner. For a mayonnaise-like dense emulsion, analysis of the observed trajectories of oil droplets quantitatively reproduces the high-dimensional fractal geometry of the configuration path and its associated energy minima generated using a computational model. That geometry in turn drives the droplets' complex random motion observed in real space. Our results indicate that experimental st",
    "link": "http://arxiv.org/abs/2210.13667",
    "context": "Title: Experimental observations of fractal landscape dynamics in a dense emulsion. (arXiv:2210.13667v2 [cond-mat.soft] UPDATED)\nAbstract: Many soft and biological materials display so-called 'soft glassy' dynamics; their constituents undergo anomalous random motions and complex cooperative rearrangements. A recent simulation model of one soft glassy material, a coarsening foam, suggested that the random motions of its bubbles are due to the system configuration moving over a fractal energy landscape in high-dimensional space. Here we show that the salient geometrical features of such high-dimensional fractal landscapes can be explored and reliably quantified, using empirical trajectory data from many degrees of freedom, in a model-free manner. For a mayonnaise-like dense emulsion, analysis of the observed trajectories of oil droplets quantitatively reproduces the high-dimensional fractal geometry of the configuration path and its associated energy minima generated using a computational model. That geometry in turn drives the droplets' complex random motion observed in real space. Our results indicate that experimental st",
    "path": "papers/22/10/2210.13667.json",
    "total_tokens": 942,
    "translated_title": "密集乳化液中分形景观动力学的实验观察",
    "translated_abstract": "许多软性和生物材料显示出所谓的“软玻璃”动力学；它们的成分经历异常的随机运动和复杂的合作重排。最近一个软玻璃材料的模拟模型，即一个成核泡沫，暗示它的泡沫的随机运动是由系统配置在高维空间中移动形成的分形能量景观。在这里我们展示了这样高维分形景观的显著几何特征可以通过多自由度的经验轨迹数据以无模型的方式进行探索和可靠量化。对于类似蛋黄酱的密集乳化液，通过分析获得的油滴轨迹定量地再现了使用计算模型生成的配置路径和其关联的能量极值的高维分形几何。这种几何结构反过来驱动了在实空间中观察到的油滴的复杂随机运动。我们的结果表明实验观测到的消解过程可以通过分形景观的几何特征来解释并可靠地量化。",
    "tldr": "本研究通过分析密集乳化液中的油滴轨迹数据，展示了高维分形景观的几何特征可以以无模型的方式进行可靠量化，并揭示这种几何结构驱动了油滴的复杂随机运动。",
    "en_tdlr": "This study demonstrates that the geometric features of high-dimensional fractal landscapes can be reliably quantified in a model-free manner using trajectory data from dense emulsion droplets, revealing that this geometric structure drives the droplets' complex random motion."
}