{
    "title": "Variance reduced Shapley value estimation for trustworthy data valuation. (arXiv:2210.16835v5 [stat.ML] UPDATED)",
    "abstract": "Data valuation, especially quantifying data value in algorithmic prediction and decision-making, is a fundamental problem in data trading scenarios. The most widely used method is to define the data Shapley and approximate it by means of the permutation sampling algorithm. To make up for the large estimation variance of the permutation sampling that hinders the development of the data marketplace, we propose a more robust data valuation method using stratified sampling, named variance reduced data Shapley (VRDS for short). We theoretically show how to stratify, how many samples are taken at each stratum, and the sample complexity analysis of VRDS. Finally, the effectiveness of VRDS is illustrated in different types of datasets and data removal applications.",
    "link": "http://arxiv.org/abs/2210.16835",
    "context": "Title: Variance reduced Shapley value estimation for trustworthy data valuation. (arXiv:2210.16835v5 [stat.ML] UPDATED)\nAbstract: Data valuation, especially quantifying data value in algorithmic prediction and decision-making, is a fundamental problem in data trading scenarios. The most widely used method is to define the data Shapley and approximate it by means of the permutation sampling algorithm. To make up for the large estimation variance of the permutation sampling that hinders the development of the data marketplace, we propose a more robust data valuation method using stratified sampling, named variance reduced data Shapley (VRDS for short). We theoretically show how to stratify, how many samples are taken at each stratum, and the sample complexity analysis of VRDS. Finally, the effectiveness of VRDS is illustrated in different types of datasets and data removal applications.",
    "path": "papers/22/10/2210.16835.json",
    "total_tokens": 754,
    "translated_title": "可信数据价值评估的方差缩小Shapley值估计",
    "translated_abstract": "数据价值评估，特别是在算法预测和决策中量化数据价值，是数据交易场景中的一个基本问题。目前最广泛使用的方法是定义数据Shapley值，然后通过排序抽样算法进行近似计算。为了弥补排列抽样算法的大估计方差，我们提出了一种更稳健的数据估价方法，使用分层抽样，并命名为方差缩小数据Shapley值（VRDS）。我们理论上展示了如何进行分层抽样，每个层抽多少样本，以及VRDS的样本复杂度分析。最后，我们在不同类型的数据集和数据删除应用程序中说明了VRDS的有效性。",
    "tldr": "本文提出了一种名为VRDS的分层抽样方法，用于评估数据价值，以缩小排列抽样方法的估计方差，并在不同类型的数据集和数据删除应用程序中得到验证。",
    "en_tdlr": "This paper proposes a variance reduced data Shapley (VRDS) method using stratified sampling to evaluate data value, which makes up for the large estimation variance of permutation sampling and is validated in different types of datasets and data removal applications."
}