{
    "title": "Multi-Task Learning based Video Anomaly Detection with Attention. (arXiv:2210.07697v2 [cs.CV] UPDATED)",
    "abstract": "Multi-task learning based video anomaly detection methods combine multiple proxy tasks in different branches to detect video anomalies in different situations. Most existing methods either do not combine complementary tasks to effectively cover all motion patterns, or the class of the objects is not explicitly considered. To address the aforementioned shortcomings, we propose a novel multi-task learning based method that combines complementary proxy tasks to better consider the motion and appearance features. We combine the semantic segmentation and future frame prediction tasks in a single branch to learn the object class and consistent motion patterns, and to detect respective anomalies simultaneously. In the second branch, we added several attention mechanisms to detect motion anomalies with attention to object parts, the direction of motion, and the distance of the objects from the camera. Our qualitative results show that the proposed method considers the object class effectively ",
    "link": "http://arxiv.org/abs/2210.07697",
    "context": "Title: Multi-Task Learning based Video Anomaly Detection with Attention. (arXiv:2210.07697v2 [cs.CV] UPDATED)\nAbstract: Multi-task learning based video anomaly detection methods combine multiple proxy tasks in different branches to detect video anomalies in different situations. Most existing methods either do not combine complementary tasks to effectively cover all motion patterns, or the class of the objects is not explicitly considered. To address the aforementioned shortcomings, we propose a novel multi-task learning based method that combines complementary proxy tasks to better consider the motion and appearance features. We combine the semantic segmentation and future frame prediction tasks in a single branch to learn the object class and consistent motion patterns, and to detect respective anomalies simultaneously. In the second branch, we added several attention mechanisms to detect motion anomalies with attention to object parts, the direction of motion, and the distance of the objects from the camera. Our qualitative results show that the proposed method considers the object class effectively ",
    "path": "papers/22/10/2210.07697.json",
    "total_tokens": 796,
    "translated_title": "基于多任务学习和注意力机制的视频异常检测",
    "translated_abstract": "基于多任务学习的视频异常检测方法通过将多个代理任务组合在不同的分支中，以便在不同的情况下检测视频异常。本文提出了一种新颖的基于多任务学习的方法，将互补的代理任务组合起来以更好地考虑运动和外观特征。我们将语义分割和未来帧预测任务结合在一个单一的分支中，以学习物体类别和一致的运动模式，并同时检测各自的异常。在第二个分支中，我们添加了几个注意力机制来检测动态异常，包括对物体部分的注意力、运动方向的注意力和物体与摄像机之间距离的注意力。我们的定性结果表明，所提出的方法有效考虑了物体分类。",
    "tldr": "本文提出了一种新颖的视频异常检测方法，通过将互补的代理任务结合在一起以更好地考虑运动和外观特征，同时考虑物体分类，并添加了多个注意力机制以检测动态异常。",
    "en_tdlr": "This paper proposes a novel video anomaly detection method by combining complementary proxy tasks to better consider motion and appearance features, and considering object classification, and adding multiple attention mechanisms to detect motion anomalies."
}