{
    "title": "Party On: The Labor Market Returns to Social Networks in Adolescence. (arXiv:2210.09426v3 [econ.EM] UPDATED)",
    "abstract": "We investigate the returns to adolescent friendships on earnings in adulthood. Using data from the National Longitudinal Study of Adolescent to Adult Health, we document that individuals make investments to accumulate friends in addition to educational investments. Because both education and friendships are jointly determined in adolescence, OLS estimates of their returns are biased. To estimate the causal returns to friendships, we implement a novel procedure that assumes the returns to schooling range from 5 to 15% (as the literature has documented), and instrument for friendships using homophily (similarity) measures among peers to obtain bounds on the returns to friendships. We find that having one more friend in adolescence increases earnings between 7 and 14%, which is substantially larger than the OLS estimates: measurement error and omitted variables lead to significant downward bias.",
    "link": "http://arxiv.org/abs/2210.09426",
    "context": "Title: Party On: The Labor Market Returns to Social Networks in Adolescence. (arXiv:2210.09426v3 [econ.EM] UPDATED)\nAbstract: We investigate the returns to adolescent friendships on earnings in adulthood. Using data from the National Longitudinal Study of Adolescent to Adult Health, we document that individuals make investments to accumulate friends in addition to educational investments. Because both education and friendships are jointly determined in adolescence, OLS estimates of their returns are biased. To estimate the causal returns to friendships, we implement a novel procedure that assumes the returns to schooling range from 5 to 15% (as the literature has documented), and instrument for friendships using homophily (similarity) measures among peers to obtain bounds on the returns to friendships. We find that having one more friend in adolescence increases earnings between 7 and 14%, which is substantially larger than the OLS estimates: measurement error and omitted variables lead to significant downward bias.",
    "path": "papers/22/10/2210.09426.json",
    "total_tokens": 908,
    "translated_title": "开派对：青少年社交网络对劳动力市场的回报",
    "translated_abstract": "我们调查了青少年友谊对成年期收入的回报。利用美国国家青少年到成人健康的长期研究数据，我们发现个体在青少年时期不仅进行教育投资，还进行友谊积累的投资。由于教育和友谊在青少年时期是同时形成的，因此使用OLS方法估计它们的回报会有偏差。为了估计友谊的因果回报，我们采用了一种新方法，假设教育回报率在5%到15%之间（如已有文献所述），并使用同伴之间的相似度测量作为友谊的工具来获得回报的下界。我们发现，在青少年时期多交一个朋友可以使收入增长7%到14%，这远大于OLS估计值：测量误差和遗漏变量导致了显著的向下偏误。",
    "tldr": "本研究调查了青少年时期与成年期收入之间的友谊回报。通过采用一种新的方法，文中发现青少年时期多交一个朋友可以使收入增加7%到14%。这个结果远大于传统方法的估计值，传统方法会因为测量误差和遗漏变量导致显著的向下偏误。",
    "en_tdlr": "This study investigates the returns of friendships during adolescence on earnings in adulthood. Using a novel procedure, it is found that having one more friend during adolescence increases earnings by 7% to 14%, which is substantially larger than estimates using traditional methods, which suffer from measurement error and omitted variables bias."
}