{
    "title": "Baby Physical Safety Monitoring in Smart Home Using Action Recognition System. (arXiv:2210.12527v2 [cs.CV] UPDATED)",
    "abstract": "Humans are able to intuitively deduce actions that took place between two states in observations via deductive reasoning. This is because the brain operates on a bidirectional communication model, which has radically improved the accuracy of recognition and prediction based on features connected to previous experiences. During the past decade, deep learning models for action recognition have significantly improved. However, deep neural networks struggle with these tasks on a smaller dataset for specific Action Recognition (AR) tasks. As with most action recognition tasks, the ambiguity of accurately describing activities in spatial-temporal data is a drawback that can be overcome by curating suitable datasets, including careful annotations and preprocessing of video data for analyzing various recognition tasks. In this study, we present a novel lightweight framework combining transfer learning techniques with a Conv2D LSTM layer to extract features from the pre-trained I3D model on the",
    "link": "http://arxiv.org/abs/2210.12527",
    "context": "Title: Baby Physical Safety Monitoring in Smart Home Using Action Recognition System. (arXiv:2210.12527v2 [cs.CV] UPDATED)\nAbstract: Humans are able to intuitively deduce actions that took place between two states in observations via deductive reasoning. This is because the brain operates on a bidirectional communication model, which has radically improved the accuracy of recognition and prediction based on features connected to previous experiences. During the past decade, deep learning models for action recognition have significantly improved. However, deep neural networks struggle with these tasks on a smaller dataset for specific Action Recognition (AR) tasks. As with most action recognition tasks, the ambiguity of accurately describing activities in spatial-temporal data is a drawback that can be overcome by curating suitable datasets, including careful annotations and preprocessing of video data for analyzing various recognition tasks. In this study, we present a novel lightweight framework combining transfer learning techniques with a Conv2D LSTM layer to extract features from the pre-trained I3D model on the",
    "path": "papers/22/10/2210.12527.json",
    "total_tokens": 874,
    "translated_title": "智能家居中婴儿物理安全监测使用动作识别系统",
    "translated_abstract": "人类能够通过演绎推理直观地推断出两个状态之间发生的行为，这是因为大脑操作在双向通信模型上，这显著提高了基于与以往经验相关的特征的识别和预测的准确性。在过去的十年中，动作识别的深度学习模型有了显著的进展。然而，深度神经网络在特定的动作识别任务中面临着小型数据集的问题。与大多数动作识别任务一样，在空间-时间数据中准确描述活动的模糊性是一个缺点，可以通过策划适当的数据集来克服，包括对视频数据进行细致的注释和预处理，以分析各种识别任务。在本研究中，我们提出了一种新的轻量级框架，将迁移学习技术与Conv2D LSTM层相结合，从预训练的I3D模型中提取特征，用于婴儿物理安全监测的行为识别。",
    "tldr": "本文提出了一种新的轻量级框架，将迁移学习技术与Conv2D LSTM层相结合，用于婴儿物理安全监测的行为识别。",
    "en_tdlr": "This paper proposes a novel lightweight framework that combines transfer learning techniques with a Conv2D LSTM layer for behavior recognition in infant physical safety monitoring."
}