{
    "title": "Planning with Spatial-Temporal Abstraction from Point Clouds for Deformable Object Manipulation. (arXiv:2210.15751v2 [cs.RO] UPDATED)",
    "abstract": "Effective planning of long-horizon deformable object manipulation requires suitable abstractions at both the spatial and temporal levels. Previous methods typically either focus on short-horizon tasks or make strong assumptions that full-state information is available, which prevents their use on deformable objects. In this paper, we propose PlAnning with Spatial-Temporal Abstraction (PASTA), which incorporates both spatial abstraction (reasoning about objects and their relations to each other) and temporal abstraction (reasoning over skills instead of low-level actions). Our framework maps high-dimension 3D observations such as point clouds into a set of latent vectors and plans over skill sequences on top of the latent set representation. We show that our method can effectively perform challenging sequential deformable object manipulation tasks in the real world, which require combining multiple tool-use skills such as cutting with a knife, pushing with a pusher, and spreading the do",
    "link": "http://arxiv.org/abs/2210.15751",
    "context": "Title: Planning with Spatial-Temporal Abstraction from Point Clouds for Deformable Object Manipulation. (arXiv:2210.15751v2 [cs.RO] UPDATED)\nAbstract: Effective planning of long-horizon deformable object manipulation requires suitable abstractions at both the spatial and temporal levels. Previous methods typically either focus on short-horizon tasks or make strong assumptions that full-state information is available, which prevents their use on deformable objects. In this paper, we propose PlAnning with Spatial-Temporal Abstraction (PASTA), which incorporates both spatial abstraction (reasoning about objects and their relations to each other) and temporal abstraction (reasoning over skills instead of low-level actions). Our framework maps high-dimension 3D observations such as point clouds into a set of latent vectors and plans over skill sequences on top of the latent set representation. We show that our method can effectively perform challenging sequential deformable object manipulation tasks in the real world, which require combining multiple tool-use skills such as cutting with a knife, pushing with a pusher, and spreading the do",
    "path": "papers/22/10/2210.15751.json",
    "total_tokens": 865,
    "translated_title": "基于点云的变形物体操作中的时空抽象规划",
    "translated_abstract": "在长期视野下有效地规划变形物体操作需要适当的空间和时间抽象。以前的方法通常要么专注于短期任务，要么做出强烈的假设，认为完整的状态信息是可用的，这阻止了它们在变形对象上的使用。在本文中，我们提出了一种名为PASTA的基于时空抽象的规划框架，它结合了空间抽象（对物体及其相互关系的推理）和时间抽象（对技能而不是低级行为的推理）。我们的框架将高维的3D观测，如点云，映射到一组潜在向量，并在潜在集表示的基础上规划技能序列。我们展示了我们的方法在现实世界中可以有效地执行具有挑战性的顺序变形物体操作任务，这需要结合多个工具使用技能，如用刀切割、用推子推动和铺展。",
    "tldr": "本文介绍了一种基于点云的规划框架PASTA，通过结合空间和时间抽象的概念，实现了对长期变形物体操作的有效规划。",
    "en_tdlr": "This paper proposes a planning framework called PASTA, which is based on point clouds and incorporates spatial and temporal abstraction for effective long-horizon deformable object manipulation."
}