{
    "title": "Optimal Mechanism Design for Agents with DSL Strategies: The Case of Sybil Attacks in Combinatorial Auctions. (arXiv:2210.15181v3 [econ.TH] UPDATED)",
    "abstract": "In robust decision making under uncertainty, a natural choice is to go with safety (aka security) level strategies. However, in many important cases, most notably auctions, there is a large multitude of safety level strategies, thus making the choice unclear. We consider two refined notions:  (i) a term we call DSL (distinguishable safety level), and is based on the notion of ``discrimin'', which uses a pairwise comparison of actions while removing trivial equivalencies. This captures the fact that when comparing two actions an agent should not care about payoffs in situations where they lead to identical payoffs.  (ii) The well-known Leximin notion from social choice theory, which we apply for robust decision-making. In particular, the leximin is always DSL but not vice-versa.  We study the relations of these notions to other robust notions, and illustrate the results of their use in auctions and other settings. Economic design aims to maximize social welfare when facing self-motivate",
    "link": "http://arxiv.org/abs/2210.15181",
    "context": "Title: Optimal Mechanism Design for Agents with DSL Strategies: The Case of Sybil Attacks in Combinatorial Auctions. (arXiv:2210.15181v3 [econ.TH] UPDATED)\nAbstract: In robust decision making under uncertainty, a natural choice is to go with safety (aka security) level strategies. However, in many important cases, most notably auctions, there is a large multitude of safety level strategies, thus making the choice unclear. We consider two refined notions:  (i) a term we call DSL (distinguishable safety level), and is based on the notion of ``discrimin'', which uses a pairwise comparison of actions while removing trivial equivalencies. This captures the fact that when comparing two actions an agent should not care about payoffs in situations where they lead to identical payoffs.  (ii) The well-known Leximin notion from social choice theory, which we apply for robust decision-making. In particular, the leximin is always DSL but not vice-versa.  We study the relations of these notions to other robust notions, and illustrate the results of their use in auctions and other settings. Economic design aims to maximize social welfare when facing self-motivate",
    "path": "papers/22/10/2210.15181.json",
    "total_tokens": 998,
    "translated_title": "基于DSL策略的代理人优化机制设计：组合拍卖中的Sybil攻击案例",
    "translated_abstract": "在不确定性下的鲁棒决策中，一个自然的选择是采用安全（或称为安全性）级别的策略。然而，在许多重要情况下，特别是拍卖中，存在大量的安全级别策略，因此选择变得不明确。我们考虑了两个细化的概念：（i）我们称之为DSL（可区分安全级别），它基于“区分”概念，使用一对一比较来去除平凡的等价性。这捕捉到了当比较两种行为时，代理人不应关心导致相同回报的情况下的回报情况。（ii）社会选择理论中众所周知的Leximin概念，我们将其应用于鲁棒决策。特别是，leximin总是DSL，但反之不成立。我们研究了这些概念与其他鲁棒概念的关系，并展示了它们在拍卖和其他场景中的应用结果。经济设计旨在在面对自我激励的情况下最大化社会福利。",
    "tldr": "本论文考虑了基于DSL策略的代理人优化机制设计，并在组合拍卖中的Sybil攻击案例中进行了研究。我们引入了DSL和Leximin概念，探讨了它们与其他鲁棒概念的关系，并展示了它们在拍卖和其他场景中的应用结果。",
    "en_tdlr": "This paper investigates optimal mechanism design for agents with DSL strategies and studies the case of Sybil attacks in combinatorial auctions. We introduce the concepts of DSL and Leximin, explore their relations with other robust notions, and illustrate their applications in auctions and other settings."
}