{
    "title": "Rethinking Annotation: Can Language Learners Contribute?. (arXiv:2210.06828v2 [cs.CL] UPDATED)",
    "abstract": "Researchers have traditionally recruited native speakers to provide annotations for widely used benchmark datasets. However, there are languages for which recruiting native speakers can be difficult, and it would help to find learners of those languages to annotate the data. In this paper, we investigate whether language learners can contribute annotations to benchmark datasets. In a carefully controlled annotation experiment, we recruit 36 language learners, provide two types of additional resources (dictionaries and machine-translated sentences), and perform mini-tests to measure their language proficiency. We target three languages, English, Korean, and Indonesian, and the four NLP tasks of sentiment analysis, natural language inference, named entity recognition, and machine reading comprehension. We find that language learners, especially those with intermediate or advanced levels of language proficiency, are able to provide fairly accurate labels with the help of additional resour",
    "link": "http://arxiv.org/abs/2210.06828",
    "context": "Title: Rethinking Annotation: Can Language Learners Contribute?. (arXiv:2210.06828v2 [cs.CL] UPDATED)\nAbstract: Researchers have traditionally recruited native speakers to provide annotations for widely used benchmark datasets. However, there are languages for which recruiting native speakers can be difficult, and it would help to find learners of those languages to annotate the data. In this paper, we investigate whether language learners can contribute annotations to benchmark datasets. In a carefully controlled annotation experiment, we recruit 36 language learners, provide two types of additional resources (dictionaries and machine-translated sentences), and perform mini-tests to measure their language proficiency. We target three languages, English, Korean, and Indonesian, and the four NLP tasks of sentiment analysis, natural language inference, named entity recognition, and machine reading comprehension. We find that language learners, especially those with intermediate or advanced levels of language proficiency, are able to provide fairly accurate labels with the help of additional resour",
    "path": "papers/22/10/2210.06828.json",
    "total_tokens": 869,
    "translated_title": "重新考虑标注：语言学习者能做出贡献吗？",
    "translated_abstract": "研究者们传统上会招募母语为目标语言的人为广泛使用的基准数据集提供注释。然而，有些语言很难找到母语人士，因此找到学习这些语言的人为数据集提供注释有着一定的帮助性。在本文中，我们研究了语言学习者是否可以为基准数据集提供注释。在一个精心设计的注释实验中，我们招募了36名语言学习者，提供了两种额外资源（词典和机器翻译的句子），并进行了迷你测试来测试他们的语言能力。我们针对英语、韩语和印尼语这三种语言以及情感分析、自然语言推理、命名实体识别和机器阅读理解这四个NLP任务。我们发现，语言学习者，尤其是那些具有中级或高级语言能力的人，在额外资源的帮助下可以提供相当准确的标签。",
    "tldr": "研究探究了语言学习者是否可以为标注基准数据集做出贡献，发现在提供额外资源的帮助下，具有中高级语言能力的学习者能够提供准确的标签。",
    "en_tdlr": "This paper investigates whether language learners can contribute to annotating benchmark datasets and finds that with the help of additional resources, intermediate or advanced language learners can provide accurate labels."
}