{
    "title": "Solving Coupled Differential Equation Groups Using PINO-CDE. (arXiv:2210.00222v2 [cs.LG] UPDATED)",
    "abstract": "As a fundamental mathmatical tool in many engineering disciplines, coupled differential equation groups are being widely used to model complex structures containing multiple physical quantities. Engineers constantly adjust structural parameters at the design stage, which requires a highly efficient solver. The rise of deep learning technologies has offered new perspectives on this task. Unfortunately, existing black-box models suffer from poor accuracy and robustness, while the advanced methodologies of single-output operator regression cannot deal with multiple quantities simultaneously. To address these challenges, we propose PINO-CDE, a deep learning framework for solving coupled differential equation groups (CDEs) along with an equation normalization algorithm for performance enhancing. Based on the theory of physics-informed neural operator (PINO), PINO-CDE uses a single network for all quantities in a CDEs, instead of training dozens, or even hundreds of networks as in the existi",
    "link": "http://arxiv.org/abs/2210.00222",
    "context": "Title: Solving Coupled Differential Equation Groups Using PINO-CDE. (arXiv:2210.00222v2 [cs.LG] UPDATED)\nAbstract: As a fundamental mathmatical tool in many engineering disciplines, coupled differential equation groups are being widely used to model complex structures containing multiple physical quantities. Engineers constantly adjust structural parameters at the design stage, which requires a highly efficient solver. The rise of deep learning technologies has offered new perspectives on this task. Unfortunately, existing black-box models suffer from poor accuracy and robustness, while the advanced methodologies of single-output operator regression cannot deal with multiple quantities simultaneously. To address these challenges, we propose PINO-CDE, a deep learning framework for solving coupled differential equation groups (CDEs) along with an equation normalization algorithm for performance enhancing. Based on the theory of physics-informed neural operator (PINO), PINO-CDE uses a single network for all quantities in a CDEs, instead of training dozens, or even hundreds of networks as in the existi",
    "path": "papers/22/10/2210.00222.json",
    "total_tokens": 949,
    "translated_title": "使用PINO-CDE求解耦合微分方程组",
    "translated_abstract": "耦合微分方程组是许多工程学科中的基本数学工具，用于建模包含多个物理量的复杂结构。在设计阶段，工程师不断调整结构参数，需要高效的求解器。深度学习技术的兴起为这项任务提供了新的视角。然而，现有的黑盒模型精度和鲁棒性较差，而单输出算符回归的先进方法无法同时处理多个量。为了应对这些挑战，我们提出了PINO-CDE，这是一种用于解决耦合微分方程组(CDEs)的深度学习框架，并配备了一个方程归一化算法来提高性能。基于物理-知情的神经算符(PINO)理论，PINO-CDE使用单个网络处理CDEs中的所有量，而不是训练数十个甚至数百个网络。实验结果表明，PINO-CDE在保持快速计算速度的同时，实现了高精度和鲁棒性，成为解决复杂CDEs的一种有前途的方法。",
    "tldr": "PINO-CDE是一种用于解决耦合微分方程组的深度学习框架，通过物理-知情的神经算符理论，使用单个网络处理所有量的CDEs，实现了高精度、鲁棒性和快速计算速度。",
    "en_tdlr": "PINO-CDE is a deep learning framework for solving coupled differential equation groups, which achieves high accuracy, robustness, and fast computation speed by using the theory of physics-informed neural operator and a single network to handle all quantities in CDEs."
}