{
    "title": "CausalBench: A Large-scale Benchmark for Network Inference from Single-cell Perturbation Data. (arXiv:2210.17283v2 [cs.LG] UPDATED)",
    "abstract": "Causal inference is a vital aspect of multiple scientific disciplines and is routinely applied to high-impact applications such as medicine. However, evaluating the performance of causal inference methods in real-world environments is challenging due to the need for observations under both interventional and control conditions. Traditional evaluations conducted on synthetic datasets do not reflect the performance in real-world systems. To address this, we introduce CausalBench, a benchmark suite for evaluating network inference methods on real-world interventional data from large-scale single-cell perturbation experiments. CausalBench incorporates biologically-motivated performance metrics, including new distribution-based interventional metrics. A systematic evaluation of state-of-the-art causal inference methods using our CausalBench suite highlights how poor scalability of current methods limits performance. Moreover, methods that use interventional information do not outperform tho",
    "link": "http://arxiv.org/abs/2210.17283",
    "context": "Title: CausalBench: A Large-scale Benchmark for Network Inference from Single-cell Perturbation Data. (arXiv:2210.17283v2 [cs.LG] UPDATED)\nAbstract: Causal inference is a vital aspect of multiple scientific disciplines and is routinely applied to high-impact applications such as medicine. However, evaluating the performance of causal inference methods in real-world environments is challenging due to the need for observations under both interventional and control conditions. Traditional evaluations conducted on synthetic datasets do not reflect the performance in real-world systems. To address this, we introduce CausalBench, a benchmark suite for evaluating network inference methods on real-world interventional data from large-scale single-cell perturbation experiments. CausalBench incorporates biologically-motivated performance metrics, including new distribution-based interventional metrics. A systematic evaluation of state-of-the-art causal inference methods using our CausalBench suite highlights how poor scalability of current methods limits performance. Moreover, methods that use interventional information do not outperform tho",
    "path": "papers/22/10/2210.17283.json",
    "total_tokens": 905,
    "translated_title": "CausalBench：基于单细胞干扰数据的网络推断大规模基准测试",
    "translated_abstract": "因果推断是多个科学学科的重要方面，并经常应用于医学等高影响应用中。然而，在真实世界环境中评估因果推断方法的性能具有挑战性，因为需要在干预和对照条件下观察。在合成数据集上进行的传统评估不能反映真实世界系统中的性能。为了解决这个问题，我们引入了CausalBench，这是一个基准测试套件，用于评估基于大规模单细胞干扰实验的真实世界干预数据上的网络推断方法。CausalBench包括生物学动机的性能度量，包括新的基于分布的干预度量。使用我们的CausalBench套件对最先进的因果推断方法进行系统评估，突出了当前方法的可扩展性差，从而限制了性能。此外，使用干预信息的方法并没有超越那些不使用干预信息的方法",
    "tldr": "CausalBench是一个用于评估基于单细胞干扰实验的真实世界干预数据上的网络推断方法的基准测试套件。通过系统评估，发现当前的方法可扩展性差，限制了性能。使用干预信息的方法并没有超越那些不使用干预信息的方法。",
    "en_tdlr": "CausalBench is a benchmark suite for evaluating network inference methods on real-world interventional data from large-scale single-cell perturbation experiments. The evaluation reveals poor scalability of current methods, limiting their performance. Methods using interventional information do not outperform methods without it."
}