{
    "title": "Improving Hyperspectral Adversarial Robustness Under Multiple Attacks. (arXiv:2210.16346v3 [cs.LG] UPDATED)",
    "abstract": "Semantic segmentation models classifying hyperspectral images (HSI) are vulnerable to adversarial examples. Traditional approaches to adversarial robustness focus on training or retraining a single network on attacked data, however, in the presence of multiple attacks these approaches decrease in performance compared to networks trained individually on each attack. To combat this issue we propose an Adversarial Discriminator Ensemble Network (ADE-Net) which focuses on attack type detection and adversarial robustness under a unified model to preserve per data-type weight optimally while robustifiying the overall network. In the proposed method, a discriminator network is used to separate data by attack type into their specific attack-expert ensemble network.",
    "link": "http://arxiv.org/abs/2210.16346",
    "context": "Title: Improving Hyperspectral Adversarial Robustness Under Multiple Attacks. (arXiv:2210.16346v3 [cs.LG] UPDATED)\nAbstract: Semantic segmentation models classifying hyperspectral images (HSI) are vulnerable to adversarial examples. Traditional approaches to adversarial robustness focus on training or retraining a single network on attacked data, however, in the presence of multiple attacks these approaches decrease in performance compared to networks trained individually on each attack. To combat this issue we propose an Adversarial Discriminator Ensemble Network (ADE-Net) which focuses on attack type detection and adversarial robustness under a unified model to preserve per data-type weight optimally while robustifiying the overall network. In the proposed method, a discriminator network is used to separate data by attack type into their specific attack-expert ensemble network.",
    "path": "papers/22/10/2210.16346.json",
    "total_tokens": 775,
    "translated_title": "在多次攻击下提高高光谱对抗鲁棒性",
    "translated_abstract": "对高光谱图像进行语义分割的模型容易受到对抗样本的攻击。传统的对抗鲁棒性方法主要集中在对单个网络进行训练或重新训练，但是在遇到多种攻击时，这些方法的性能会下降，比单独训练每个网络都要差。为了解决这个问题，我们提出了一种Adversarial Discriminator Ensemble Network（ADE-Net），该网络专注于攻击类型检测和鲁棒性，在一个统一的模型下保留最佳的每个数据类型权重，同时增强整个网络的鲁棒性。在所提出的方法中，使用鉴别器网络将数据按攻击类型进行分离，进而针对特定攻击类型使用相应的攻击专家集合网络。",
    "tldr": "该论文提出了一种Adversarial Discriminator Ensemble Network（ADE-Net）来增强高光谱图像模型的鲁棒性，针对不同攻击类型使用相应的攻击专家集合网络。",
    "en_tdlr": "The paper proposes an Adversarial Discriminator Ensemble Network (ADE-Net) to improve the robustness of hyperspectral image models under adversarial attacks, using attack-expert ensemble networks specific to each attack type."
}