{
    "title": "Particle clustering in turbulence: Prediction of spatial and statistical properties with deep learning. (arXiv:2210.02339v2 [astro-ph.EP] UPDATED)",
    "abstract": "We investigate the utility of deep learning for modeling the clustering of particles that are aerodynamically coupled to turbulent fluids. Using a Lagrangian particle module within the Athena++ hydrodynamics code, we simulate the dynamics of particles in the Epstein drag regime within a periodic domain of isotropic forced hydrodynamic turbulence. This setup is an idealized model relevant to the collisional growth of micron to mm-sized dust particles in early stage planet formation. The simulation data are used to train a U-Net deep learning model to predict gridded three-dimensional representations of the particle density and velocity fields, given as input the corresponding fluid fields. The trained model qualitatively captures the filamentary structure of clustered particles in a highly non-linear regime. We assess model fidelity by calculating metrics of the density field (the radial distribution function) and of the velocity field (the relative velocity and the relative radial velo",
    "link": "http://arxiv.org/abs/2210.02339",
    "context": "Title: Particle clustering in turbulence: Prediction of spatial and statistical properties with deep learning. (arXiv:2210.02339v2 [astro-ph.EP] UPDATED)\nAbstract: We investigate the utility of deep learning for modeling the clustering of particles that are aerodynamically coupled to turbulent fluids. Using a Lagrangian particle module within the Athena++ hydrodynamics code, we simulate the dynamics of particles in the Epstein drag regime within a periodic domain of isotropic forced hydrodynamic turbulence. This setup is an idealized model relevant to the collisional growth of micron to mm-sized dust particles in early stage planet formation. The simulation data are used to train a U-Net deep learning model to predict gridded three-dimensional representations of the particle density and velocity fields, given as input the corresponding fluid fields. The trained model qualitatively captures the filamentary structure of clustered particles in a highly non-linear regime. We assess model fidelity by calculating metrics of the density field (the radial distribution function) and of the velocity field (the relative velocity and the relative radial velo",
    "path": "papers/22/10/2210.02339.json",
    "total_tokens": 882,
    "translated_title": "湍流中的粒子聚集：利用深度学习预测空间和统计特性",
    "translated_abstract": "本文研究了利用深度学习模拟与湍流流体气动耦合的粒子聚集。我们使用Athena++流体动力学代码中的拉格朗日粒子模块，在各向同性强迫型水动力湍流的周期域内模拟了在爱普斯坦阻力区的粒子动力学。这一设置是一个理想化模型，与早期行星形成中微米到毫米尺寸的尘埃粒子的碰撞生长相关。我们使用模拟数据训练了一个U-Net深度学习模型，以预测基于相应流体场输入的粒子密度和速度场的三维网格表示。经过训练的模型在高度非线性区捕捉到了聚集粒子的纤维结构。我们通过计算密度场（径向分布函数）和速度场（相对速度和相对径向速度）的指标来评估模型的准确性。",
    "tldr": "本研究利用深度学习模型成功预测了湍流中粒子聚集的空间和统计特性，为早期行星形成中尘埃粒子的碰撞生长提供了理论支持。",
    "en_tdlr": "This study successfully predicted the spatial and statistical properties of particle clustering in turbulence using a deep learning model, providing theoretical support for the collisional growth of dust particles in early stage planet formation."
}