{
    "title": "Experiencer-Specific Emotion and Appraisal Prediction. (arXiv:2210.12078v2 [cs.CL] UPDATED)",
    "abstract": "Emotion classification in NLP assigns emotions to texts, such as sentences or paragraphs. With texts like \"I felt guilty when he cried\", focusing on the sentence level disregards the standpoint of each participant in the situation: the writer (\"I\") and the other entity (\"he\") could in fact have different affective states. The emotions of different entities have been considered only partially in emotion semantic role labeling, a task that relates semantic roles to emotion cue words. Proposing a related task, we narrow the focus on the experiencers of events, and assign an emotion (if any holds) to each of them. To this end, we represent each emotion both categorically and with appraisal variables, as a psychological access to explaining why a person develops a particular emotion. On an event description corpus, our experiencer-aware models of emotions and appraisals outperform the experiencer-agnostic baselines, showing that disregarding event participants is an oversimplification for t",
    "link": "http://arxiv.org/abs/2210.12078",
    "context": "Title: Experiencer-Specific Emotion and Appraisal Prediction. (arXiv:2210.12078v2 [cs.CL] UPDATED)\nAbstract: Emotion classification in NLP assigns emotions to texts, such as sentences or paragraphs. With texts like \"I felt guilty when he cried\", focusing on the sentence level disregards the standpoint of each participant in the situation: the writer (\"I\") and the other entity (\"he\") could in fact have different affective states. The emotions of different entities have been considered only partially in emotion semantic role labeling, a task that relates semantic roles to emotion cue words. Proposing a related task, we narrow the focus on the experiencers of events, and assign an emotion (if any holds) to each of them. To this end, we represent each emotion both categorically and with appraisal variables, as a psychological access to explaining why a person develops a particular emotion. On an event description corpus, our experiencer-aware models of emotions and appraisals outperform the experiencer-agnostic baselines, showing that disregarding event participants is an oversimplification for t",
    "path": "papers/22/10/2210.12078.json",
    "total_tokens": 882,
    "translated_title": "情感和评价的预测与个体经历有关",
    "translated_abstract": "自然语言处理中的情感分类是为文本（如句子或段落）分配情感。对于像“当他哭泣时，我感到内疚”这样的文本，关注句子级别忽略了每个参与者的立场：作者（“我”）和另一个实体（“他”）实际上可能具有不同的情感状态。不同实体的情感只在情感语义角色标注等任务中部分考虑。我们提出一个相关的任务，将焦点缩小到事件的经历者，将情感（如果有）分配给每个经历者。为此，我们将每种情感分类和评价变量都表示出来，作为解释人们为什么会产生特定情感的心理途径。在事件描述语料库上，我们对经历者感知的情感和评价模型优于经历者无关的基线，表明忽略事件参与者是在语言中传达情感的一种过度简化。",
    "tldr": "本研究提出了一种新的任务，将焦点缩小到事件的经历者，将情感（如果有）分配给每个经历者，提出了表示每种情感分类的心理评价变量，从而使得情感分类更为准确。",
    "en_tdlr": "This study proposes a new task that assigns emotions to each entity in a sentence, considering their individual experiences. By introducing psychological appraisal variables, the classification of emotions is more accurate and outperforms baseline models that disregard the experiencers of events."
}