{
    "title": "Extreme Measures in Continuous Time Conic Finace. (arXiv:2210.13671v2 [q-fin.RM] UPDATED)",
    "abstract": "Dynamic spectral risk measures define a claim's valuation bounds as supremum and infimum of expectations of the claim's payoff over a dominated set of measures. The measures at which such extrema are attained are called extreme measures. We determine explicit expressions for their Radon-Nykodim derivatives with respect to the common dominating measure. Based on the formulas found, we estimate the extreme measures in two cases. First, the dominating measure is calibrated to mid prices of options and valuation bounds are given by options bid and ask prices. Second, the dominating measure is estimated from historical mid equity prices and valuation bounds are given by historical 5-day high and low prices. In both experiments, we find that the market determines upper bounds by testing scenarios in which losses are significantly lower than expected under the dominating measure, while lower bounds by ones in which gains are only slightly lower than in the base case.",
    "link": "http://arxiv.org/abs/2210.13671",
    "context": "Title: Extreme Measures in Continuous Time Conic Finace. (arXiv:2210.13671v2 [q-fin.RM] UPDATED)\nAbstract: Dynamic spectral risk measures define a claim's valuation bounds as supremum and infimum of expectations of the claim's payoff over a dominated set of measures. The measures at which such extrema are attained are called extreme measures. We determine explicit expressions for their Radon-Nykodim derivatives with respect to the common dominating measure. Based on the formulas found, we estimate the extreme measures in two cases. First, the dominating measure is calibrated to mid prices of options and valuation bounds are given by options bid and ask prices. Second, the dominating measure is estimated from historical mid equity prices and valuation bounds are given by historical 5-day high and low prices. In both experiments, we find that the market determines upper bounds by testing scenarios in which losses are significantly lower than expected under the dominating measure, while lower bounds by ones in which gains are only slightly lower than in the base case.",
    "path": "papers/22/10/2210.13671.json",
    "total_tokens": 1028,
    "translated_title": "连续时间锥形金融中的极端措施",
    "translated_abstract": "动态谱风险度量将索赔的估价边界定义为在一组受控制的度量上，对索赔回报的期望值的最高值和最低值。在这些极值被达到的度量中，被称为极端措施。我们确定了它们相对于共同的控制度量的Radon-Nykodim导数的显式表达式。基于所找到的公式，我们估计了两种情况下的极端措施。首先，控制度量校准为期权的中间价格，并且估价边界由期权的买入和卖出价格给出。其次，控制度量是从历史中的股票中间价格估计而来，估价边界由历史的5天最高价和最低价给出。在两个实验中，我们发现市场通过测试场景来确定上限边界，在这些场景中，损失明显低于在控制度量下预期的损失，在确定下限边界时，市场只考虑了与基准案例中的收益略有降低的情况。",
    "tldr": "本文研究了连续时间锥形金融中的极端措施。我们确定了这些极端措施相对于共同的控制度量的Radon-Nykodim导数的显式表达式，并通过实验估计了两种情况下的极端措施。结果表明，市场通过测试不同情景来确定估价边界，上限边界与预期损失明显下降相关，而下限边界则考虑了与基准情况下收益略有降低的情况。"
}