{
    "title": "Transfer Learning for Individual Treatment Effect Estimation. (arXiv:2210.00380v3 [cs.LG] UPDATED)",
    "abstract": "This work considers the problem of transferring causal knowledge between tasks for Individual Treatment Effect (ITE) estimation. To this end, we theoretically assess the feasibility of transferring ITE knowledge and present a practical framework for efficient transfer. A lower bound is introduced on the ITE error of the target task to demonstrate that ITE knowledge transfer is challenging due to the absence of counterfactual information. Nevertheless, we establish generalization upper bounds on the counterfactual loss and ITE error of the target task, demonstrating the feasibility of ITE knowledge transfer. Subsequently, we introduce a framework with a new Causal Inference Task Affinity (CITA) measure for ITE knowledge transfer. Specifically, we use CITA to find the closest source task to the target task and utilize it for ITE knowledge transfer. Empirical studies are provided, demonstrating the efficacy of the proposed method. We observe that ITE knowledge transfer can significantly (",
    "link": "http://arxiv.org/abs/2210.00380",
    "context": "Title: Transfer Learning for Individual Treatment Effect Estimation. (arXiv:2210.00380v3 [cs.LG] UPDATED)\nAbstract: This work considers the problem of transferring causal knowledge between tasks for Individual Treatment Effect (ITE) estimation. To this end, we theoretically assess the feasibility of transferring ITE knowledge and present a practical framework for efficient transfer. A lower bound is introduced on the ITE error of the target task to demonstrate that ITE knowledge transfer is challenging due to the absence of counterfactual information. Nevertheless, we establish generalization upper bounds on the counterfactual loss and ITE error of the target task, demonstrating the feasibility of ITE knowledge transfer. Subsequently, we introduce a framework with a new Causal Inference Task Affinity (CITA) measure for ITE knowledge transfer. Specifically, we use CITA to find the closest source task to the target task and utilize it for ITE knowledge transfer. Empirical studies are provided, demonstrating the efficacy of the proposed method. We observe that ITE knowledge transfer can significantly (",
    "path": "papers/22/10/2210.00380.json",
    "total_tokens": 878,
    "translated_title": "个体治疗效果估计的迁移学习",
    "translated_abstract": "本研究探讨了在个体治疗效果估计中通过任务之间转移因果知识的问题。我们从理论上评估了转移个体治疗效果知识的可行性，并提出了一个实用的框架来实现有效的转移。我们引入了一个下界来说明目标任务的个体治疗效果误差存在挑战，因为缺乏反事实信息。尽管如此，我们建立了目标任务反事实损失和个体治疗效果误差的泛化上界，证明了个体治疗效果知识转移的可行性。随后，我们引入了一个框架，其中使用新的因果推断任务亲和度（CITA）度量进行ITE知识转移。具体而言，我们使用CITA来找到最接近目标任务的源任务，并利用它来进行ITE知识转移。我们提供了实证研究，证明了所提出方法的有效性。我们观察到，ITE知识转移可以显著（",
    "tldr": "本论文探讨了个体治疗效果估计中迁移因果知识的问题，并提出了一个使用CITA度量进行ITE知识转移的框架，实验证明该方法的有效性。"
}