{
    "title": "FINDE: Neural Differential Equations for Finding and Preserving Invariant Quantities. (arXiv:2210.00272v2 [cs.LG] UPDATED)",
    "abstract": "Many real-world dynamical systems are associated with first integrals (a.k.a. invariant quantities), which are quantities that remain unchanged over time. The discovery and understanding of first integrals are fundamental and important topics both in the natural sciences and in industrial applications. First integrals arise from the conservation laws of system energy, momentum, and mass, and from constraints on states; these are typically related to specific geometric structures of the governing equations. Existing neural networks designed to ensure such first integrals have shown excellent accuracy in modeling from data. However, these models incorporate the underlying structures, and in most situations where neural networks learn unknown systems, these structures are also unknown. This limitation needs to be overcome for scientific discovery and modeling of unknown systems. To this end, we propose first integral-preserving neural differential equation (FINDE). By leveraging the proje",
    "link": "http://arxiv.org/abs/2210.00272",
    "context": "Title: FINDE: Neural Differential Equations for Finding and Preserving Invariant Quantities. (arXiv:2210.00272v2 [cs.LG] UPDATED)\nAbstract: Many real-world dynamical systems are associated with first integrals (a.k.a. invariant quantities), which are quantities that remain unchanged over time. The discovery and understanding of first integrals are fundamental and important topics both in the natural sciences and in industrial applications. First integrals arise from the conservation laws of system energy, momentum, and mass, and from constraints on states; these are typically related to specific geometric structures of the governing equations. Existing neural networks designed to ensure such first integrals have shown excellent accuracy in modeling from data. However, these models incorporate the underlying structures, and in most situations where neural networks learn unknown systems, these structures are also unknown. This limitation needs to be overcome for scientific discovery and modeling of unknown systems. To this end, we propose first integral-preserving neural differential equation (FINDE). By leveraging the proje",
    "path": "papers/22/10/2210.00272.json",
    "total_tokens": 1005,
    "translated_title": "FINDE: 基于神经微分方程的不变量发现与保持",
    "translated_abstract": "许多实际动力学系统都与首次积分（也称为不变量）相关联，它们是随时间保持不变的量。首次积分的发现和理解是自然科学和工业应用中基本和重要的主题。首次积分源自系统能量、动量和质量的守恒定律以及对状态的限制；这些通常与控制方程的特定几何结构相关。现有的设计用于确保这些首次积分的神经网络在建模数据方面表现出色。然而，这些模型包含了潜在的结构，在神经网络学习未知系统的大多数情况下，这些结构也是未知的。为了科学发现和未知系统建模，需要克服这种限制。为此，我们提出了一种首次积分保持的神经微分方程（FINDE）。通过利用神经常微分方程中的投射方法，FINDE可以在不需要先验知识的情况下自动发现和保持首次积分。我们证明了FINDE有效地学习了几个经典示例的潜在动态和不变量，包括Duffing和van der Pol振荡器，并提供有关首次积分发现和动态系统深度学习的见解。",
    "tldr": "FINDE是一种基于神经微分方程的方法，可以在不需要先验知识的情况下自动发现和保持动力系统的不变量，有助于科学发现和未知系统建模。"
}