{
    "title": "Mean-field neural networks: learning mappings on Wasserstein space. (arXiv:2210.15179v2 [math.OC] UPDATED)",
    "abstract": "We study the machine learning task for models with operators mapping between the Wasserstein space of probability measures and a space of functions, like e.g. in mean-field games/control problems. Two classes of neural networks, based on bin density and on cylindrical approximation, are proposed to learn these so-called mean-field functions, and are theoretically supported by universal approximation theorems. We perform several numerical experiments for training these two mean-field neural networks, and show their accuracy and efficiency in the generalization error with various test distributions. Finally, we present different algorithms relying on mean-field neural networks for solving time-dependent mean-field problems, and illustrate our results with numerical tests for the example of a semi-linear partial differential equation in the Wasserstein space of probability measures.",
    "link": "http://arxiv.org/abs/2210.15179",
    "context": "Title: Mean-field neural networks: learning mappings on Wasserstein space. (arXiv:2210.15179v2 [math.OC] UPDATED)\nAbstract: We study the machine learning task for models with operators mapping between the Wasserstein space of probability measures and a space of functions, like e.g. in mean-field games/control problems. Two classes of neural networks, based on bin density and on cylindrical approximation, are proposed to learn these so-called mean-field functions, and are theoretically supported by universal approximation theorems. We perform several numerical experiments for training these two mean-field neural networks, and show their accuracy and efficiency in the generalization error with various test distributions. Finally, we present different algorithms relying on mean-field neural networks for solving time-dependent mean-field problems, and illustrate our results with numerical tests for the example of a semi-linear partial differential equation in the Wasserstein space of probability measures.",
    "path": "papers/22/10/2210.15179.json",
    "total_tokens": 804,
    "translated_title": "均场神经网络：学习Wasserstein空间上的映射",
    "translated_abstract": "我们研究了在概率测度的Wasserstein空间和函数空间之间进行映射的模型的机器学习任务，例如在均场博弈/控制问题中。提出了两类基于二进制密度和圆柱逼近的神经网络，用于学习这些所谓的均场函数，并在理论上获得了通用逼近定理的支持。我们进行了几个数值实验来训练这两个均场神经网络，并展示了它们在各种测试分布中的准确性和效率以及泛化误差。最后，我们提出了依赖于均场神经网络的不同算法来解决时间相关的均场问题，并通过数值测试在概率测度的Wasserstein空间中的半线性偏微分方程的例子来说明我们的结果。",
    "tldr": "本文研究了均场神经网络在学习概率测度的Wasserstein空间和函数空间之间的映射中的应用。提出了两类神经网络，通过通用逼近定理理论支持，并通过数值实验展示了其准确性和效率。此外，还提出了依赖于均场神经网络的算法来解决时间相关的均场问题。"
}