{
    "title": "Iterative Teaching by Data Hallucination. (arXiv:2210.17467v2 [cs.LG] UPDATED)",
    "abstract": "We consider the problem of iterative machine teaching, where a teacher sequentially provides examples based on the status of a learner under a discrete input space (i.e., a pool of finite samples), which greatly limits the teacher's capability. To address this issue, we study iterative teaching under a continuous input space where the input example (i.e., image) can be either generated by solving an optimization problem or drawn directly from a continuous distribution. Specifically, we propose data hallucination teaching (DHT) where the teacher can generate input data intelligently based on labels, the learner's status and the target concept. We study a number of challenging teaching setups (e.g., linear/neural learners in omniscient and black-box settings). Extensive empirical results verify the effectiveness of DHT.",
    "link": "http://arxiv.org/abs/2210.17467",
    "context": "Title: Iterative Teaching by Data Hallucination. (arXiv:2210.17467v2 [cs.LG] UPDATED)\nAbstract: We consider the problem of iterative machine teaching, where a teacher sequentially provides examples based on the status of a learner under a discrete input space (i.e., a pool of finite samples), which greatly limits the teacher's capability. To address this issue, we study iterative teaching under a continuous input space where the input example (i.e., image) can be either generated by solving an optimization problem or drawn directly from a continuous distribution. Specifically, we propose data hallucination teaching (DHT) where the teacher can generate input data intelligently based on labels, the learner's status and the target concept. We study a number of challenging teaching setups (e.g., linear/neural learners in omniscient and black-box settings). Extensive empirical results verify the effectiveness of DHT.",
    "path": "papers/22/10/2210.17467.json",
    "total_tokens": 711,
    "translated_title": "基于数据幻象的迭代式教学",
    "translated_abstract": "本文研究了在连续输入空间下迭代教学的问题，即教师根据学习者的状态和目标概念提供示例。我们提出了数据幻象教学（DHT）方法，在有限的样本空间内，通过智能地生成输入数据，解决了教师提供示例的能力问题。我们考虑了许多挑战性的教学设置，并进行了广泛的实证研究，验证了DHT的有效性。",
    "tldr": "本文提出了基于数据幻象教学（DHT）的迭代式教学方法，解决了在连续输入空间下教师提供示例的能力问题，并在多个挑战性的教学设置中验证了DHT的有效性。",
    "en_tdlr": "This paper proposes an iterative teaching method based on data hallucination (DHT), which solves the problem of teacher's capability to provide examples in a continuous input space by intelligently generating input data, and verifies the effectiveness of DHT in various challenging teaching settings through extensive empirical studies."
}