{
    "title": "Ollivier-Ricci Curvature for Hypergraphs: A Unified Framework. (arXiv:2210.12048v3 [cs.LG] UPDATED)",
    "abstract": "Bridging geometry and topology, curvature is a powerful and expressive invariant. While the utility of curvature has been theoretically and empirically confirmed in the context of manifolds and graphs, its generalization to the emerging domain of hypergraphs has remained largely unexplored. On graphs, the Ollivier-Ricci curvature measures differences between random walks via Wasserstein distances, thus grounding a geometric concept in ideas from probability theory and optimal transport. We develop ORCHID, a flexible framework generalizing Ollivier-Ricci curvature to hypergraphs, and prove that the resulting curvatures have favorable theoretical properties. Through extensive experiments on synthetic and real-world hypergraphs from different domains, we demonstrate that ORCHID curvatures are both scalable and useful to perform a variety of hypergraph tasks in practice.",
    "link": "http://arxiv.org/abs/2210.12048",
    "context": "Title: Ollivier-Ricci Curvature for Hypergraphs: A Unified Framework. (arXiv:2210.12048v3 [cs.LG] UPDATED)\nAbstract: Bridging geometry and topology, curvature is a powerful and expressive invariant. While the utility of curvature has been theoretically and empirically confirmed in the context of manifolds and graphs, its generalization to the emerging domain of hypergraphs has remained largely unexplored. On graphs, the Ollivier-Ricci curvature measures differences between random walks via Wasserstein distances, thus grounding a geometric concept in ideas from probability theory and optimal transport. We develop ORCHID, a flexible framework generalizing Ollivier-Ricci curvature to hypergraphs, and prove that the resulting curvatures have favorable theoretical properties. Through extensive experiments on synthetic and real-world hypergraphs from different domains, we demonstrate that ORCHID curvatures are both scalable and useful to perform a variety of hypergraph tasks in practice.",
    "path": "papers/22/10/2210.12048.json",
    "total_tokens": 886,
    "translated_title": "超图的Ollivier-Ricci曲率：一个统一的框架",
    "translated_abstract": "曲率是一种强大而富有表现力的不变量，连接了几何和拓扑。虽然在流形和图的背景下，曲率的效用已经在理论和实证上得到了证实，但其在新兴的超图领域的推广仍然是一个未被充分探索的问题。在图上，Ollivier-Ricci曲率通过Wasserstein距离度量随机游走之间的不同，从而将几何概念落实到概率论和最优输运的思想中。我们开发了ORCHID，一个将Ollivier-Ricci曲率推广到超图的灵活框架，并证明了所得曲率具有良好的理论属性。通过对来自不同领域的合成和真实超图的广泛实验，我们证明ORCHID曲率既具有可扩展性，也有用于进行各种超图任务的实用性。",
    "tldr": "本论文提出了ORCHID框架，将Ollivier-Ricci曲率推广到超图领域，并证明了其具有良好的理论特性。实验结果表明ORCHID曲率对于超图任务有很好的应用性。",
    "en_tdlr": "This paper proposes the ORCHID framework, which generalizes the Ollivier-Ricci curvature to the hypergraph field and proves that the resulting curvatures have favorable theoretical properties. Extensive experiments on synthetic and real-world hypergraphs from different domains demonstrate that ORCHID curvatures are both scalable and useful for a variety of hypergraph tasks in practice."
}