{
    "title": "Hierarchical quantum circuit representations for neural architecture search. (arXiv:2210.15073v3 [quant-ph] UPDATED)",
    "abstract": "Machine learning with hierarchical quantum circuits, usually referred to as Quantum Convolutional Neural Networks (QCNNs), is a promising prospect for near-term quantum computing. The QCNN is a circuit model inspired by the architecture of Convolutional Neural Networks (CNNs). CNNs are successful because they do not need manual feature design and can learn high-level features from raw data. Neural Architecture Search (NAS) builds on this success by learning network architecture and achieves state-of-the-art performance. However, applying NAS to QCNNs presents unique challenges due to the lack of a well-defined search space. In this work, we propose a novel framework for representing QCNN architectures using techniques from NAS, which enables search space design and architecture search. Using this framework, we generate a family of popular QCNNs, those resembling reverse binary trees. We then evaluate this family of models on a music genre classification dataset, GTZAN, to justify the i",
    "link": "http://arxiv.org/abs/2210.15073",
    "context": "Title: Hierarchical quantum circuit representations for neural architecture search. (arXiv:2210.15073v3 [quant-ph] UPDATED)\nAbstract: Machine learning with hierarchical quantum circuits, usually referred to as Quantum Convolutional Neural Networks (QCNNs), is a promising prospect for near-term quantum computing. The QCNN is a circuit model inspired by the architecture of Convolutional Neural Networks (CNNs). CNNs are successful because they do not need manual feature design and can learn high-level features from raw data. Neural Architecture Search (NAS) builds on this success by learning network architecture and achieves state-of-the-art performance. However, applying NAS to QCNNs presents unique challenges due to the lack of a well-defined search space. In this work, we propose a novel framework for representing QCNN architectures using techniques from NAS, which enables search space design and architecture search. Using this framework, we generate a family of popular QCNNs, those resembling reverse binary trees. We then evaluate this family of models on a music genre classification dataset, GTZAN, to justify the i",
    "path": "papers/22/10/2210.15073.json",
    "total_tokens": 952,
    "tldr": "本文提出了一种新颖的框架，利用神经结构搜索技术表示QCNN的体系结构，使搜索空间的设计和架构搜索成为可能，生成一系列流行的QCNN模型并在音乐流派分类数据集上进行了评估。",
    "en_tdlr": "This paper proposes a novel framework using Neural Architecture Search (NAS) techniques to represent the architecture of Quantum Convolutional Neural Networks (QCNNs), enabling search space design and architecture search. A family of popular QCNN models resembling reverse binary trees is generated and evaluated on a music genre classification dataset, GTZAN, demonstrating the innovation."
}