{
    "title": "Transformer-based Text Classification on Unified Bangla Multi-class Emotion Corpus. (arXiv:2210.06405v2 [cs.CL] UPDATED)",
    "abstract": "Because of its importance in studying people's thoughts on various Web 2.0 services, emotion classification (EC) is an important undertaking. Existing research, on the other hand, is mostly focused on the English language, with little work on low-resource languages. Though sentiment analysis, particularly the EC in English, has received a lot of attention in recent years, little study has been done in the context of Bangla, one of the world's most widely spoken languages. We propose a complete set of approaches for identifying and extracting emotions from Bangla texts in this research. We provide a Bangla emotion classifier for six classes (anger, disgust, fear, joy, sadness, and surprise) from Bangla words, using transformer-based models which exhibit phenomenal results in recent days, especially for high resource languages. The \"Unified Bangla Multi-class Emotion Corpus (UBMEC)\" is used to assess the performance of our models. UBMEC was created by combining two previously released ma",
    "link": "http://arxiv.org/abs/2210.06405",
    "context": "Title: Transformer-based Text Classification on Unified Bangla Multi-class Emotion Corpus. (arXiv:2210.06405v2 [cs.CL] UPDATED)\nAbstract: Because of its importance in studying people's thoughts on various Web 2.0 services, emotion classification (EC) is an important undertaking. Existing research, on the other hand, is mostly focused on the English language, with little work on low-resource languages. Though sentiment analysis, particularly the EC in English, has received a lot of attention in recent years, little study has been done in the context of Bangla, one of the world's most widely spoken languages. We propose a complete set of approaches for identifying and extracting emotions from Bangla texts in this research. We provide a Bangla emotion classifier for six classes (anger, disgust, fear, joy, sadness, and surprise) from Bangla words, using transformer-based models which exhibit phenomenal results in recent days, especially for high resource languages. The \"Unified Bangla Multi-class Emotion Corpus (UBMEC)\" is used to assess the performance of our models. UBMEC was created by combining two previously released ma",
    "path": "papers/22/10/2210.06405.json",
    "total_tokens": 1042,
    "translated_title": "基于Transformer的统一孟加拉多分类情感语料库文本分类",
    "translated_abstract": "情感分类在研究人们对各种Web 2.0服务的想法方面非常重要。现有研究主要集中在英语上，对低资源语言的研究较少。虽然近年来情感分析，特别是英语中的情感分类已经受到了很多关注，但在孟加拉语这样世界上最流行的语言的情况下却没有进行太多的研究。我们提出了一套完整的方法来识别和提取孟加拉语文本中的情感。我们使用基于Transformer的模型从孟加拉语词汇中构建了一个六类（愤怒、厌恶、害怕、喜悦、悲伤和惊讶）的情感分类器，在最近取得了惊人的结果，尤其是对于高资源语言。我们使用“统一孟加拉多分类情感语料库（UBMEC）”来评估我们模型的性能。UBMEC通过结合两个先前发布的基于机器学习的孟加拉语情感语料库而创建，其中包含超过16,000个孟加拉文本样本。我们提出的模型在准确度、精确度、召回率和F1分数方面优于多个最先进的模型。",
    "tldr": "该论文针对孟加拉语这一低资源语言，提出了基于Transformer的模型进行情感分类的方法。该模型在统一孟加拉多分类情感语料库（UBMEC）上的表现优于多个最先进的模型。",
    "en_tdlr": "This paper proposes a method for Bangla emotion classification using transformer-based models, which outperforms several state-of-the-art models on the Unified Bangla Multi-class Emotion Corpus (UBMEC). The approach fills the gap of emotion classification in low-resource languages, particularly for Bangla."
}