{
    "title": "Explaining Image Classification with Visual Debates. (arXiv:2210.09015v2 [cs.CV] UPDATED)",
    "abstract": "An effective way to obtain different perspectives on any given topic is by conducting a debate, where participants argue for and against the topic. Here, we propose a novel debate framework for understanding and explaining a continuous image classifier's reasoning for making a particular prediction by modeling it as a multiplayer sequential zero-sum debate game. The contrastive nature of our framework encourages players to learn to put forward diverse arguments during the debates, picking up the reasoning trails missed by their opponents and highlighting any uncertainties in the classifier. Specifically, in our proposed setup, players propose arguments, drawn from the classifier's discretized latent knowledge, to support or oppose the classifier's decision. The resulting Visual Debates collect supporting and opposing features from the discretized latent space of the classifier, serving as explanations for the internal reasoning of the classifier towards its predictions. We demonstrate ",
    "link": "http://arxiv.org/abs/2210.09015",
    "context": "Title: Explaining Image Classification with Visual Debates. (arXiv:2210.09015v2 [cs.CV] UPDATED)\nAbstract: An effective way to obtain different perspectives on any given topic is by conducting a debate, where participants argue for and against the topic. Here, we propose a novel debate framework for understanding and explaining a continuous image classifier's reasoning for making a particular prediction by modeling it as a multiplayer sequential zero-sum debate game. The contrastive nature of our framework encourages players to learn to put forward diverse arguments during the debates, picking up the reasoning trails missed by their opponents and highlighting any uncertainties in the classifier. Specifically, in our proposed setup, players propose arguments, drawn from the classifier's discretized latent knowledge, to support or oppose the classifier's decision. The resulting Visual Debates collect supporting and opposing features from the discretized latent space of the classifier, serving as explanations for the internal reasoning of the classifier towards its predictions. We demonstrate ",
    "path": "papers/22/10/2210.09015.json",
    "total_tokens": 940,
    "translated_title": "用视觉辩论解释图像分类",
    "translated_abstract": "通过辩论，人们可以从不同的角度看待同一问题。本文提出了一个新的辩论框架，将连续图像分类器的推理建模成一个多人序贯零和辩论游戏，以理解和解释分类器的决策过程。我们的框架具有对比性，鼓励辩手提出多样性的观点，挖掘对手忽略的推理路径，并突出分类器的不确定性。在我们提出的设置中，辩手从分类器的离散化潜在知识中提出论点，支持或反对分类器的决策。由此形成的视觉辩论收集了分类器潜在空间中的支持和反对特征，为分类器对其预测的内部推理提供解释。",
    "tldr": "本文提出了一个新的视觉辩论框架，将连续图像分类器的推理建模成一个多人序贯零和辩论游戏，通过收集分类器潜在空间的特征，提供解释分类器对其预测的内部推理。辩论框架可以用于解释各种图像分类应用，包括医学诊断和自动驾驶系统。",
    "en_tdlr": "This paper proposes a novel visual debates framework for understanding and explaining a continuous image classifier's reasoning by modeling it as a multiplayer sequential zero-sum debate game, which can collect supporting and opposing features from the discretized latent space of the classifier. The framework can provide interpretable and diverse explanations for classification decisions, outperforming existing explanation techniques, and can be applied to various image classification applications, including medical diagnosis and self-driving car systems."
}