{
    "title": "Shortest Edit Path Crossover: A Theory-driven Solution to the Permutation Problem in Evolutionary Neural Architecture Search. (arXiv:2210.14016v4 [cs.NE] UPDATED)",
    "abstract": "Population-based search has recently emerged as a possible alternative to Reinforcement Learning (RL) for black-box neural architecture search (NAS). It performs well in practice even though it is not theoretically well understood. In particular, whereas traditional population-based search methods such as evolutionary algorithms (EAs) draw much power from crossover operations, it is difficult to take advantage of them in NAS. The main obstacle is believed to be the permutation problem: The mapping between genotype and phenotype in traditional graph representations is many-to-one, leading to a disruptive effect of standard crossover. This paper presents the first theoretical analysis of the behaviors of mutation, crossover and RL in black-box NAS, and proposes a new crossover operator based on the shortest edit path (SEP) in graph space. The SEP crossover is shown theoretically to overcome the permutation problem, and as a result, have a better expected improvement compared to mutation,",
    "link": "http://arxiv.org/abs/2210.14016",
    "context": "Title: Shortest Edit Path Crossover: A Theory-driven Solution to the Permutation Problem in Evolutionary Neural Architecture Search. (arXiv:2210.14016v4 [cs.NE] UPDATED)\nAbstract: Population-based search has recently emerged as a possible alternative to Reinforcement Learning (RL) for black-box neural architecture search (NAS). It performs well in practice even though it is not theoretically well understood. In particular, whereas traditional population-based search methods such as evolutionary algorithms (EAs) draw much power from crossover operations, it is difficult to take advantage of them in NAS. The main obstacle is believed to be the permutation problem: The mapping between genotype and phenotype in traditional graph representations is many-to-one, leading to a disruptive effect of standard crossover. This paper presents the first theoretical analysis of the behaviors of mutation, crossover and RL in black-box NAS, and proposes a new crossover operator based on the shortest edit path (SEP) in graph space. The SEP crossover is shown theoretically to overcome the permutation problem, and as a result, have a better expected improvement compared to mutation,",
    "path": "papers/22/10/2210.14016.json",
    "total_tokens": 879,
    "translated_title": "最短编辑路径交叉：演化神经网络结构搜索排列问题的理论驱动解决方案",
    "translated_abstract": "最近，基于种群的搜索已经成为黑盒神经网络结构搜索（NAS）中可能替代强化学习（RL）的一个选择。尽管它在实践中表现良好，但它在理论上尚未被很好地理解。特别地，虽然传统的基于种群的搜索方法如演化算法（EAs）从交叉操作中汲取了很多力量，但在NAS中很难利用它们。主要障碍被认为是排列问题：在传统的图表示中，基因型和表现型之间的映射是一对多的，导致标准交叉产生破坏性影响。本文首次提出了对黑盒NAS中突变、交叉和RL行为进行理论分析，并基于图空间中的最短编辑路径（SEP）提出了一种新的交叉操作符。理论上表明，SEP交叉可以克服排列问题，因此与突变相比，具有更好的期望改进。",
    "tldr": "本文提出了一种基于最短编辑路径的交叉操作符，用以解决黑盒神经网络结构搜索中的排列问题，并在理论上证明了其优于突变的期望改进。",
    "en_tdlr": "This paper proposes a crossover operator based on shortest edit path and theoretically demonstrates its superiority over mutation for solving the permutation problem in black-box neural architecture search."
}