{
    "title": "Testing predictions of representation cost theory with CNNs. (arXiv:2210.01257v3 [cs.LG] UPDATED)",
    "abstract": "It is widely acknowledged that trained convolutional neural networks (CNNs) have different levels of sensitivity to signals of different frequency. In particular, a number of empirical studies have documented CNNs sensitivity to low-frequency signals. In this work we show with theory and experiments that this observed sensitivity is a consequence of the frequency distribution of natural images, which is known to have most of its power concentrated in low-to-mid frequencies. Our theoretical analysis relies on representations of the layers of a CNN in frequency space, an idea that has previously been used to accelerate computations and study implicit bias of network training algorithms, but to the best of our knowledge has not been applied in the domain of model robustness.",
    "link": "http://arxiv.org/abs/2210.01257",
    "context": "Title: Testing predictions of representation cost theory with CNNs. (arXiv:2210.01257v3 [cs.LG] UPDATED)\nAbstract: It is widely acknowledged that trained convolutional neural networks (CNNs) have different levels of sensitivity to signals of different frequency. In particular, a number of empirical studies have documented CNNs sensitivity to low-frequency signals. In this work we show with theory and experiments that this observed sensitivity is a consequence of the frequency distribution of natural images, which is known to have most of its power concentrated in low-to-mid frequencies. Our theoretical analysis relies on representations of the layers of a CNN in frequency space, an idea that has previously been used to accelerate computations and study implicit bias of network training algorithms, but to the best of our knowledge has not been applied in the domain of model robustness.",
    "path": "papers/22/10/2210.01257.json",
    "total_tokens": 749,
    "translated_title": "使用CNN来测试表示成本理论的预测",
    "translated_abstract": "众所周知，经过训练的卷积神经网络（CNNs）对不同频率的信号具有不同的敏感性。特别是，许多实证研究已经记录了CNNs对低频信号的敏感性。在这项工作中，我们通过理论和实验证明，这种观察到的敏感性是自然图像频率分布的结果，已知大部分能量集中在低到中频。我们的理论分析依赖于CNN的层次在频率空间中的表示，这个想法之前曾被用来加速计算和研究网络训练算法的隐式偏差，但据我们所知，尚未在模型鲁棒性领域应用过。",
    "tldr": "通过理论和实验证明，训练的卷积神经网络（CNNs）对低频信号具有敏感性，这是因为自然图像的频率分布使大部分能量集中在低到中频。",
    "en_tdlr": "Through theory and experiments, it has been demonstrated that trained convolutional neural networks (CNNs) exhibit sensitivity to low-frequency signals, which is attributed to the frequency distribution of natural images concentrating most of its power in the low to mid frequencies."
}