{
    "title": "Revisiting Le Cam's Equation: Exact Minimax Rates over Convex Density Classes. (arXiv:2210.11436v2 [math.ST] UPDATED)",
    "abstract": "We study the classical problem of deriving minimax rates for density estimation over convex density classes. Building on the pioneering work of Le Cam (1973), Birge (1983, 1986), Wong and Shen (1995), Yang and Barron (1999), we determine the exact (up to constants) minimax rate over any convex density class. This work thus extends these known results by demonstrating that the local metric entropy of the density class always captures the minimax optimal rates under such settings. Our bounds provide a unifying perspective across both parametric and nonparametric convex density classes, under weaker assumptions on the richness of the density class than previously considered. Our proposed `multistage sieve' MLE applies to any such convex density class. We further demonstrate that this estimator is also adaptive to the true underlying density of interest. We apply our risk bounds to rederive known minimax rates including bounded total variation, and Holder density classes. We further illust",
    "link": "http://arxiv.org/abs/2210.11436",
    "context": "Title: Revisiting Le Cam's Equation: Exact Minimax Rates over Convex Density Classes. (arXiv:2210.11436v2 [math.ST] UPDATED)\nAbstract: We study the classical problem of deriving minimax rates for density estimation over convex density classes. Building on the pioneering work of Le Cam (1973), Birge (1983, 1986), Wong and Shen (1995), Yang and Barron (1999), we determine the exact (up to constants) minimax rate over any convex density class. This work thus extends these known results by demonstrating that the local metric entropy of the density class always captures the minimax optimal rates under such settings. Our bounds provide a unifying perspective across both parametric and nonparametric convex density classes, under weaker assumptions on the richness of the density class than previously considered. Our proposed `multistage sieve' MLE applies to any such convex density class. We further demonstrate that this estimator is also adaptive to the true underlying density of interest. We apply our risk bounds to rederive known minimax rates including bounded total variation, and Holder density classes. We further illust",
    "path": "papers/22/10/2210.11436.json",
    "total_tokens": 911,
    "translated_title": "重新考虑Le Cam方程：凸密度类的精确极小极大速率",
    "translated_abstract": "我们研究了在凸密度类上进行密度估计的极小极大速率的经典问题。在Le Cam（1973）、Birge（1983, 1986）、Wong和Shen（1995）以及Yang和Barron（1999）的开创性工作基础上，我们确定了任何凸密度类的精确（仅与常数相关）极小极大速率。这项工作通过证明密度类的局部度量熵总是捕捉到这些设置下的极小极大最优速率，从而扩展了这些已知结果。我们的界限在比以前考虑的密度类的丰富性方面提供了统一的视角，适用于参数化和非参数化的凸密度类。我们提出的“多阶段筛”MLE适用于任何这样的凸密度类。我们进一步证明了这个估计器对真实的潜在密度是自适应的。我们将我们的风险界应用于重新导出已知的极小极大速率，包括有界总变差和Holder密度类。",
    "tldr": "本文通过研究在凸密度类上进行密度估计的极小极大速率，扩展了已有结果，确定了任何凸密度类的精确极小极大速率，并且提出了自适应估计器。",
    "en_tdlr": "This paper extends existing results by determining the exact minimax rates over any convex density class for density estimation and proposed an adaptive estimator."
}