{
    "title": "On The Relative Error of Random Fourier Features for Preserving Kernel Distance. (arXiv:2210.00244v2 [cs.LG] UPDATED)",
    "abstract": "The method of random Fourier features (RFF), proposed in a seminal paper by Rahimi and Recht (NIPS'07), is a powerful technique to find approximate low-dimensional representations of points in (high-dimensional) kernel space, for shift-invariant kernels. While RFF has been analyzed under various notions of error guarantee, the ability to preserve the kernel distance with \\emph{relative} error is less understood. We show that for a significant range of kernels, including the well-known Laplacian kernels, RFF cannot approximate the kernel distance with small relative error using low dimensions. We complement this by showing as long as the shift-invariant kernel is analytic, RFF with $\\mathrm{poly}(\\epsilon^{-1} \\log n)$ dimensions achieves $\\epsilon$-relative error for pairwise kernel distance of $n$ points, and the dimension bound is improved to $\\mathrm{poly}(\\epsilon^{-1}\\log k)$ for the specific application of kernel $k$-means. Finally, going beyond RFF, we make the first step toward",
    "link": "http://arxiv.org/abs/2210.00244",
    "context": "Title: On The Relative Error of Random Fourier Features for Preserving Kernel Distance. (arXiv:2210.00244v2 [cs.LG] UPDATED)\nAbstract: The method of random Fourier features (RFF), proposed in a seminal paper by Rahimi and Recht (NIPS'07), is a powerful technique to find approximate low-dimensional representations of points in (high-dimensional) kernel space, for shift-invariant kernels. While RFF has been analyzed under various notions of error guarantee, the ability to preserve the kernel distance with \\emph{relative} error is less understood. We show that for a significant range of kernels, including the well-known Laplacian kernels, RFF cannot approximate the kernel distance with small relative error using low dimensions. We complement this by showing as long as the shift-invariant kernel is analytic, RFF with $\\mathrm{poly}(\\epsilon^{-1} \\log n)$ dimensions achieves $\\epsilon$-relative error for pairwise kernel distance of $n$ points, and the dimension bound is improved to $\\mathrm{poly}(\\epsilon^{-1}\\log k)$ for the specific application of kernel $k$-means. Finally, going beyond RFF, we make the first step toward",
    "path": "papers/22/10/2210.00244.json",
    "total_tokens": 995,
    "translated_title": "关于随机傅里叶特征相对误差保持核距离的研究",
    "translated_abstract": "随机傅里叶特征（RFF）是一种强大的技术，针对平移不变核，在（高维）核空间中找到点的近似低维表示。尽管在各种误差保证概念下分析了RFF，但以“相对误差”保持核距离的能力较少被理解。我们发现，在包括著名的拉普拉斯核在内的大多数核范围内，RFF不能使用低维近似核距离并保持小的相对误差。当平移不变核是“解析”的时候，RFF可以使用$\\mathrm{poly}(\\epsilon^{-1}\\log n)$维度来实现对于$n$点的配对核距离的$\\epsilon$-相对误差，并且在对于特定的“核$k$-means”的应用中，维度边界得到了改进，变为$\\mathrm{poly}(\\epsilon^{-1}\\log k)$。最后，我们超越了RFF，迈出了第一步。",
    "tldr": "研究发现，对于大多数核，包括著名的拉普拉斯核，RFF不能使用低维近似核距离并保持小的相对误差。当核是解析的时候，RFF可以使用多项式维度实现$\\epsilon$-相对误差，并且在特定应用中，维度边界得到了改进。",
    "en_tdlr": "For most kernels, including the well-known Laplacian kernels, it is not possible for RFF to approximate the kernel distance with small relative error using low dimensions. However, when the shift-invariant kernel is analytic, RFF can achieve $\\epsilon$-relative error using polynomial dimensions, and the dimension bound is improved for the specific application of kernel k-means."
}