{
    "title": "Protocols for classically training quantum generative models on probability distributions. (arXiv:2210.13442v2 [quant-ph] UPDATED)",
    "abstract": "Quantum Generative Modelling (QGM) relies on preparing quantum states and generating samples from these states as hidden - or known - probability distributions. As distributions from some classes of quantum states (circuits) are inherently hard to sample classically, QGM represents an excellent testbed for quantum supremacy experiments. Furthermore, generative tasks are increasingly relevant for industrial machine learning applications, and thus QGM is a strong candidate for demonstrating a practical quantum advantage. However, this requires that quantum circuits are trained to represent industrially relevant distributions, and the corresponding training stage has an extensive training cost for current quantum hardware in practice. In this work, we propose protocols for classical training of QGMs based on circuits of the specific type that admit an efficient gradient computation, while remaining hard to sample. In particular, we consider Instantaneous Quantum Polynomial (IQP) circuits ",
    "link": "http://arxiv.org/abs/2210.13442",
    "context": "Title: Protocols for classically training quantum generative models on probability distributions. (arXiv:2210.13442v2 [quant-ph] UPDATED)\nAbstract: Quantum Generative Modelling (QGM) relies on preparing quantum states and generating samples from these states as hidden - or known - probability distributions. As distributions from some classes of quantum states (circuits) are inherently hard to sample classically, QGM represents an excellent testbed for quantum supremacy experiments. Furthermore, generative tasks are increasingly relevant for industrial machine learning applications, and thus QGM is a strong candidate for demonstrating a practical quantum advantage. However, this requires that quantum circuits are trained to represent industrially relevant distributions, and the corresponding training stage has an extensive training cost for current quantum hardware in practice. In this work, we propose protocols for classical training of QGMs based on circuits of the specific type that admit an efficient gradient computation, while remaining hard to sample. In particular, we consider Instantaneous Quantum Polynomial (IQP) circuits ",
    "path": "papers/22/10/2210.13442.json",
    "total_tokens": 815,
    "translated_title": "在概率分布上进行经典训练的量子生成模型的协议",
    "translated_abstract": "量子生成建模(QGM)依赖于准备量子态并从这些态中生成样本作为隐藏 - 或已知 - 概率分布。由于某些类别的量子态(电路)的分布在经典情况下很难采样，QGM成为量子统治实验的理想平台。此外，生成任务对于工业机器学习应用越来越重要，因此QGM是展示实际量子优势的一个强有力的候选方案。然而，这要求量子电路要经过训练以表示与工业相关的分布，并且目前的量子硬件在实践中对训练阶段具有极高的训练成本。在这项工作中，我们提出了一种基于特定类型电路的QGM的经典训练协议，该协议允许有效计算梯度，同时保持采样困难。",
    "tldr": "本文提出了一种基于可计算梯度的特定类型电路的经典训练协议，用于在概率分布上训练量子生成模型。"
}