{
    "title": "Multi-view Multi-label Anomaly Network Traffic Classification based on MLP-Mixer Neural Network. (arXiv:2210.16719v3 [cs.LG] UPDATED)",
    "abstract": "Network traffic classification is the basis of many network security applications and has attracted enough attention in the field of cyberspace security. Existing network traffic classification based on convolutional neural networks (CNNs) often emphasizes local patterns of traffic data while ignoring global information associations. In this paper, we propose an MLP-Mixer based multi-view multi-label neural network for network traffic classification. Compared with the existing CNN-based methods, our method adopts the MLP-Mixer structure, which is more in line with the structure of the packet than the conventional convolution operation. In our method, one packet is divided into the packet header and the packet body, together with the flow features of the packet as input from different views. We utilize a multi-label setting to learn different scenarios simultaneously to improve the classification performance by exploiting the correlations between different scenarios. Taking advantage of",
    "link": "http://arxiv.org/abs/2210.16719",
    "context": "Title: Multi-view Multi-label Anomaly Network Traffic Classification based on MLP-Mixer Neural Network. (arXiv:2210.16719v3 [cs.LG] UPDATED)\nAbstract: Network traffic classification is the basis of many network security applications and has attracted enough attention in the field of cyberspace security. Existing network traffic classification based on convolutional neural networks (CNNs) often emphasizes local patterns of traffic data while ignoring global information associations. In this paper, we propose an MLP-Mixer based multi-view multi-label neural network for network traffic classification. Compared with the existing CNN-based methods, our method adopts the MLP-Mixer structure, which is more in line with the structure of the packet than the conventional convolution operation. In our method, one packet is divided into the packet header and the packet body, together with the flow features of the packet as input from different views. We utilize a multi-label setting to learn different scenarios simultaneously to improve the classification performance by exploiting the correlations between different scenarios. Taking advantage of",
    "path": "papers/22/10/2210.16719.json",
    "total_tokens": 809,
    "translated_title": "基于MLP-Mixer神经网络的多视图多标签异常网络流量分类",
    "translated_abstract": "网络流量分类是许多网络安全应用的基础，已经在网络安全领域引起了足够的关注。现有基于卷积神经网络（CNN）的网络流量分类通常强调流量数据的局部模式，而忽视了全局信息的关联。本文提出了一种基于MLP-Mixer的多视图多标签神经网络用于网络流量分类。与现有的基于CNN的方法相比，我们的方法采用了MLP-Mixer结构，这与数据包的结构更加符合。在我们的方法中，一个数据包被分为数据包头和数据包主体，加上不同视图下的流特征作为输入。我们利用多标签设置同时学习不同场景，通过利用不同场景之间的相关性来提高分类性能。借助于",
    "tldr": "本文提出了一种基于MLP-Mixer的多视图多标签神经网络用于网络流量分类，该方法能够更好地捕捉流量数据的全局信息关联，通过利用不同场景之间的相关性来提高分类性能。"
}