{
    "title": "Neural Extended Kalman Filters for Learning and Predicting Dynamics of Structural Systems. (arXiv:2210.04165v2 [cs.LG] UPDATED)",
    "abstract": "Accurate structural response prediction forms a main driver for structural health monitoring and control applications. This often requires the proposed model to adequately capture the underlying dynamics of complex structural systems. In this work, we utilize a learnable Extended Kalman Filter (EKF), named the Neural Extended Kalman Filter (Neural EKF) throughout this paper, for learning the latent evolution dynamics of complex physical systems. The Neural EKF is a generalized version of the conventional EKF, where the modeling of process dynamics and sensory observations can be parameterized by neural networks, therefore learned by end-to-end training. The method is implemented under the variational inference framework with the EKF conducting inference from sensing measurements. Typically, conventional variational inference models are parameterized by neural networks independent of the latent dynamics models. This characteristic makes the inference and reconstruction accuracy weakly b",
    "link": "http://arxiv.org/abs/2210.04165",
    "context": "Title: Neural Extended Kalman Filters for Learning and Predicting Dynamics of Structural Systems. (arXiv:2210.04165v2 [cs.LG] UPDATED)\nAbstract: Accurate structural response prediction forms a main driver for structural health monitoring and control applications. This often requires the proposed model to adequately capture the underlying dynamics of complex structural systems. In this work, we utilize a learnable Extended Kalman Filter (EKF), named the Neural Extended Kalman Filter (Neural EKF) throughout this paper, for learning the latent evolution dynamics of complex physical systems. The Neural EKF is a generalized version of the conventional EKF, where the modeling of process dynamics and sensory observations can be parameterized by neural networks, therefore learned by end-to-end training. The method is implemented under the variational inference framework with the EKF conducting inference from sensing measurements. Typically, conventional variational inference models are parameterized by neural networks independent of the latent dynamics models. This characteristic makes the inference and reconstruction accuracy weakly b",
    "path": "papers/22/10/2210.04165.json",
    "total_tokens": 961,
    "translated_title": "神经扩展卡尔曼滤波器用于学习和预测结构系统的动力学",
    "translated_abstract": "准确的结构响应预测是结构健康监测和控制应用的主要驱动力。这往往需要所提出的模型充分捕捉复杂结构系统的基本动力学。在这项工作中，我们利用可学习的扩展卡尔曼滤波器（称为神经扩展卡尔曼滤波器）来学习复杂物理系统的潜在演化动力学。神经扩展卡尔曼滤波器是传统卡尔曼滤波器的广义版本，其中过程动力学和传感观测的建模可以通过神经网络来参数化，因此可以通过端到端训练来学习。该方法在变分推理框架下实现，卡尔曼滤波器通过感知测量进行推理。通常，传统的变分推理模型的参数是独立于潜在动力学模型的神经网络参数化的。这种特点使得推理和重构的准确性相对较弱。",
    "tldr": "本论文提出了一种称为神经扩展卡尔曼滤波器（Neural EKF）的可学习卡尔曼滤波方法，用于学习复杂物理系统的潜在演化动力学。这种方法可以通过端到端训练来学习过程动力学和传感观测的建模，提高结构响应预测的准确性。"
}