{
    "title": "Semantic Framework based Query Generation for Temporal Question Answering over Knowledge Graphs. (arXiv:2210.04490v3 [cs.CL] UPDATED)",
    "abstract": "Answering factual questions with temporal intent over knowledge graphs (temporal KGQA) attracts rising attention in recent years. In the generation of temporal queries, existing KGQA methods ignore the fact that some intrinsic connections between events can make them temporally related, which may limit their capability. We systematically analyze the possible interpretation of temporal constraints and conclude the interpretation structures as the Semantic Framework of Temporal Constraints, SF-TCons. Based on the semantic framework, we propose a temporal question answering method, SF-TQA, which generates query graphs by exploring the relevant facts of mentioned entities, where the exploring process is restricted by SF-TCons. Our evaluations show that SF-TQA significantly outperforms existing methods on two benchmarks over different knowledge graphs.",
    "link": "http://arxiv.org/abs/2210.04490",
    "context": "Title: Semantic Framework based Query Generation for Temporal Question Answering over Knowledge Graphs. (arXiv:2210.04490v3 [cs.CL] UPDATED)\nAbstract: Answering factual questions with temporal intent over knowledge graphs (temporal KGQA) attracts rising attention in recent years. In the generation of temporal queries, existing KGQA methods ignore the fact that some intrinsic connections between events can make them temporally related, which may limit their capability. We systematically analyze the possible interpretation of temporal constraints and conclude the interpretation structures as the Semantic Framework of Temporal Constraints, SF-TCons. Based on the semantic framework, we propose a temporal question answering method, SF-TQA, which generates query graphs by exploring the relevant facts of mentioned entities, where the exploring process is restricted by SF-TCons. Our evaluations show that SF-TQA significantly outperforms existing methods on two benchmarks over different knowledge graphs.",
    "path": "papers/22/10/2210.04490.json",
    "total_tokens": 740,
    "translated_title": "基于语义框架的知识图谱时间问答查询生成",
    "translated_abstract": "最近，知识图谱上关于时间的事实问答引起越来越多的关注。在生成时间查询时，现有的知识图谱问答方法忽略了一些内在的事件联系，这些联系使事件在时间上相关，可能限制了它们的能力。我们系统地分析了时间约束的可能解释，并将解释结构归纳为时间约束的语义框架（SF-TCons）。基于语义框架，我们提出了一种时间问答方法，SF-TQA，通过探索所提及实体的相关事实来生成查询图，探索过程受到SF-TCons的限制。我们的评估表明，SF-TQA在不同知识图谱上的两个基准测试中明显优于现有方法。",
    "tldr": "本论文提出了一种基于语义框架的知识图谱时间问答查询生成方法，受到时间约束的限制，有效地提高了问答能力。",
    "en_tdlr": "This paper proposes a semantic framework based method for generating temporal queries for knowledge graph question answering, which is restricted by temporal constraints and significantly improves the answering capability."
}