{
    "title": "Adaptive patch foraging in deep reinforcement learning agents. (arXiv:2210.08085v2 [cs.AI] UPDATED)",
    "abstract": "Patch foraging is one of the most heavily studied behavioral optimization challenges in biology. However, despite its importance to biological intelligence, this behavioral optimization problem is understudied in artificial intelligence research. Patch foraging is especially amenable to study given that it has a known optimal solution, which may be difficult to discover given current techniques in deep reinforcement learning. Here, we investigate deep reinforcement learning agents in an ecological patch foraging task. For the first time, we show that machine learning agents can learn to patch forage adaptively in patterns similar to biological foragers, and approach optimal patch foraging behavior when accounting for temporal discounting. Finally, we show emergent internal dynamics in these agents that resemble single-cell recordings from foraging non-human primates, which complements experimental and theoretical work on the neural mechanisms of biological foraging. This work suggests ",
    "link": "http://arxiv.org/abs/2210.08085",
    "context": "Title: Adaptive patch foraging in deep reinforcement learning agents. (arXiv:2210.08085v2 [cs.AI] UPDATED)\nAbstract: Patch foraging is one of the most heavily studied behavioral optimization challenges in biology. However, despite its importance to biological intelligence, this behavioral optimization problem is understudied in artificial intelligence research. Patch foraging is especially amenable to study given that it has a known optimal solution, which may be difficult to discover given current techniques in deep reinforcement learning. Here, we investigate deep reinforcement learning agents in an ecological patch foraging task. For the first time, we show that machine learning agents can learn to patch forage adaptively in patterns similar to biological foragers, and approach optimal patch foraging behavior when accounting for temporal discounting. Finally, we show emergent internal dynamics in these agents that resemble single-cell recordings from foraging non-human primates, which complements experimental and theoretical work on the neural mechanisms of biological foraging. This work suggests ",
    "path": "papers/22/10/2210.08085.json",
    "total_tokens": 891,
    "translated_title": "深度强化学习智能体的自适应补丁觅食行为研究",
    "translated_abstract": "补丁觅食是生物学中研究最广泛的行为优化挑战之一。然而，尽管这种行为优化问题对于生物智能至关重要，但在人工智能研究中被忽视。本文研究了生态补丁觅食任务中的深度强化学习智能体。本文首次表明，机器学习智能体可以学习自适应地进行补丁觅食，并逼近最优的补丁觅食行为，同时考虑时间折现。最后，我们展示了这些智能体内部出现了类似于非人类灵长类动物觅食的单细胞记录的新现象，这对于生物觅食的神经机制的实验和理论研究具有补充作用。",
    "tldr": "本文针对深度强化学习智能体的生态补丁觅食任务，首次证明机器学习智能体可以学习自适应地进行补丁觅食，并且逼近最优行为，并在智能体的内部出现了类似于非人类灵长类动物觅食的单细胞记录的新现象。",
    "en_tdlr": "This paper demonstrates for the first time that machine learning agents can adaptively learn to patch forage in an ecological setting, approximating optimal behavior and showing emergent dynamics resembling those of non-human primates during foraging, adding to the understanding of biological foraging mechanisms."
}