{
    "title": "Multi-Target Tracking with Transferable Convolutional Neural Networks. (arXiv:2210.15539v3 [eess.SP] UPDATED)",
    "abstract": "Multi-target tracking (MTT) is a classical signal processing task, where the goal is to estimate the states of an unknown number of moving targets from noisy sensor measurements. In this paper, we revisit MTT from a deep learning perspective and propose a convolutional neural network (CNN) architecture to tackle it. We represent the target states and sensor measurements as images and recast the problem as an image-to-image prediction task. Then we train a fully convolutional model at small tracking areas and transfer it to much larger areas with numerous targets and sensors. This transfer learning approach enables MTT at a large scale and is also theoretically supported by our novel analysis that bounds the generalization error. In practice, the proposed transferable CNN architecture outperforms random finite set filters on the MTT task with 10 targets and transfers without re-training to a larger MTT task with 250 targets with a 29% performance improvement.",
    "link": "http://arxiv.org/abs/2210.15539",
    "context": "Title: Multi-Target Tracking with Transferable Convolutional Neural Networks. (arXiv:2210.15539v3 [eess.SP] UPDATED)\nAbstract: Multi-target tracking (MTT) is a classical signal processing task, where the goal is to estimate the states of an unknown number of moving targets from noisy sensor measurements. In this paper, we revisit MTT from a deep learning perspective and propose a convolutional neural network (CNN) architecture to tackle it. We represent the target states and sensor measurements as images and recast the problem as an image-to-image prediction task. Then we train a fully convolutional model at small tracking areas and transfer it to much larger areas with numerous targets and sensors. This transfer learning approach enables MTT at a large scale and is also theoretically supported by our novel analysis that bounds the generalization error. In practice, the proposed transferable CNN architecture outperforms random finite set filters on the MTT task with 10 targets and transfers without re-training to a larger MTT task with 250 targets with a 29% performance improvement.",
    "path": "papers/22/10/2210.15539.json",
    "total_tokens": 989,
    "translated_title": "使用可迁移的卷积神经网络进行多目标跟踪",
    "translated_abstract": "多目标跟踪（MTT）是一个经典的信号处理任务，目标是从噪声传感器测量中估计出未知数量的移动目标的状态。在本文中，我们从深度学习的角度重新审视了MTT，并提出了一种卷积神经网络（CNN）架构来解决该问题。我们将目标状态和传感器测量表示为图像，并将问题重新定义为图像到图像的预测任务。然后，我们在小范围的跟踪区域训练了一个完全卷积模型，并将其迁移到具有大量目标和传感器的更大范围。这种迁移学习方法使得MTT能够在大规模上实现，并且在理论上得到了我们的新颖分析的支持，该分析限制了泛化误差。在实践中，所提出的可迁移CNN架构在具有10个目标的MTT任务上优于随机有限集滤波器，并且在不重新训练的情况下将其迁移到具有250个目标的更大的MTT任务中，性能提高了29%。",
    "tldr": "本论文提出了一种使用可迁移的卷积神经网络进行多目标跟踪的方法。该方法利用图像表示目标状态和传感器测量，并通过迁移学习实现了在大规模上进行MTT，并在10个目标的MTT任务中表现优于传统方法，在250个目标的更大MTT任务中性能提高了29%。",
    "en_tdlr": "This paper proposes a method for multi-target tracking using transferable convolutional neural networks. The method represents target states and sensor measurements as images and achieves MTT at a large scale through transfer learning. It outperforms traditional methods in a 10-target MTT task and improves the performance by 29% in a larger MTT task with 250 targets."
}