{
    "title": "Highly Efficient Real-Time Streaming and Fully On-Device Speaker Diarization with Multi-Stage Clustering. (arXiv:2210.13690v3 [eess.AS] UPDATED)",
    "abstract": "While recent research advances in speaker diarization mostly focus on improving the quality of diarization results, there is also an increasing interest in improving the efficiency of diarization systems. In this paper, we demonstrate that a multi-stage clustering strategy that uses different clustering algorithms for input of different lengths can address multi-faceted challenges of on-device speaker diarization applications. Specifically, a fallback clusterer is used to handle short-form inputs; a main clusterer is used to handle medium-length inputs; and a pre-clusterer is used to compress long-form inputs before they are processed by the main clusterer. Both the main clusterer and the pre-clusterer can be configured with an upper bound of the computational complexity to adapt to devices with different resource constraints. This multi-stage clustering strategy is critical for streaming on-device speaker diarization systems, where the budgets of CPU, memory and battery are tight.",
    "link": "http://arxiv.org/abs/2210.13690",
    "context": "Title: Highly Efficient Real-Time Streaming and Fully On-Device Speaker Diarization with Multi-Stage Clustering. (arXiv:2210.13690v3 [eess.AS] UPDATED)\nAbstract: While recent research advances in speaker diarization mostly focus on improving the quality of diarization results, there is also an increasing interest in improving the efficiency of diarization systems. In this paper, we demonstrate that a multi-stage clustering strategy that uses different clustering algorithms for input of different lengths can address multi-faceted challenges of on-device speaker diarization applications. Specifically, a fallback clusterer is used to handle short-form inputs; a main clusterer is used to handle medium-length inputs; and a pre-clusterer is used to compress long-form inputs before they are processed by the main clusterer. Both the main clusterer and the pre-clusterer can be configured with an upper bound of the computational complexity to adapt to devices with different resource constraints. This multi-stage clustering strategy is critical for streaming on-device speaker diarization systems, where the budgets of CPU, memory and battery are tight.",
    "path": "papers/22/10/2210.13690.json",
    "total_tokens": 906,
    "translated_title": "高效的多阶段聚类实时流式嵌入式演讲人分离",
    "translated_abstract": "在说话者分离方面，最近的研究进展主要集中于提高分离结果的质量，但同时也越来越关注提高分离系统的效率。本文证明了一种多阶段聚类策略——对于不同长度的输入使用不同的聚类算法，从而解决了嵌入式演讲人分离应用的多方面挑战。具体而言，采用后备聚类器来处理短形式输入；主聚类器用于处理中等长度的输入；在经过主聚类器之前，采用预处理聚类器来压缩长形式输入。主聚类器和预处理聚类器都可以配置为计算复杂度上界，以适应不同资源约束的设备。该多阶段聚类策略对于CPU、内存和电池预算紧张的流式嵌入式演讲者分离系统至关重要。",
    "tldr": "本文提出了一种多阶段聚类策略，可以解决流式嵌入式演讲者分离系统的多方面挑战，从而提高效率。此策略使用不同的聚类算法处理不同长度的输入，并可适应不同资源约束的设备。",
    "en_tdlr": "This paper presents a multi-stage clustering strategy to improve the efficiency of streaming on-device speaker diarization systems. Using different clustering algorithms for input of different lengths, this strategy can address multi-faceted challenges and adapt to devices with different resource constraints, leading to higher efficiency."
}