{
    "title": "StyLEx: Explaining Style Using Human Lexical Annotations. (arXiv:2210.07469v2 [cs.CL] UPDATED)",
    "abstract": "Large pre-trained language models have achieved impressive results on various style classification tasks, but they often learn spurious domain-specific words to make predictions (Hayati et al., 2021). While human explanation highlights stylistic tokens as important features for this task, we observe that model explanations often do not align with them. To tackle this issue, we introduce StyLEx, a model that learns from human-annotated explanations of stylistic features and jointly learns to perform the task and predict these features as model explanations. Our experiments show that StyLEx can provide human-like stylistic lexical explanations without sacrificing the performance of sentence-level style prediction on both in-domain and out-of-domain datasets. Explanations from StyLEx show significant improvements in explanation metrics (sufficiency, plausibility) and when evaluated with human annotations. They are also more understandable by human judges compared to the widely-used salien",
    "link": "http://arxiv.org/abs/2210.07469",
    "context": "Title: StyLEx: Explaining Style Using Human Lexical Annotations. (arXiv:2210.07469v2 [cs.CL] UPDATED)\nAbstract: Large pre-trained language models have achieved impressive results on various style classification tasks, but they often learn spurious domain-specific words to make predictions (Hayati et al., 2021). While human explanation highlights stylistic tokens as important features for this task, we observe that model explanations often do not align with them. To tackle this issue, we introduce StyLEx, a model that learns from human-annotated explanations of stylistic features and jointly learns to perform the task and predict these features as model explanations. Our experiments show that StyLEx can provide human-like stylistic lexical explanations without sacrificing the performance of sentence-level style prediction on both in-domain and out-of-domain datasets. Explanations from StyLEx show significant improvements in explanation metrics (sufficiency, plausibility) and when evaluated with human annotations. They are also more understandable by human judges compared to the widely-used salien",
    "path": "papers/22/10/2210.07469.json",
    "total_tokens": 852,
    "translated_title": "StyLEx：使用人类词汇注释解释语言风格",
    "translated_abstract": "大型预训练语言模型在各种风格分类任务中取得了令人印象深刻的成果，但它们经常学习到虚假的特定领域词汇以进行预测。为了解决这个问题，我们介绍了StyLEx，这是一种模型，它从人工注释的语言风格特征解释中学习，并联合学习执行任务并预测这些特征作为模型解释。我们的实验证明，StyLEx可以在不牺牲任务性能的情况下，提供类似于人类的风格词汇解释的句子级风格预测，包括域内和域外数据集。与广泛使用的显著性图形可视化方法相比，StyLEx的解释在解释指标（充分性，可信度）和人类评注评估时均有显着提升，并且更容易被人类评判者理解。",
    "tldr": "StyLEx是一种可以从人工注释的语言风格特征解释中学习，提供句子级风格预测以及人类-like的风格词汇解释的模型。",
    "en_tdlr": "StyLEx is a model that learns from human-annotated explanations of stylistic features, providing sentence-level style prediction and human-like stylistic lexical explanations."
}