{
    "title": "Finding and Exploring Promising Search Space for the 0-1 Multidimensional Knapsack Problem. (arXiv:2210.03918v2 [cs.AI] UPDATED)",
    "abstract": "The 0-1 Multidimensional Knapsack Problem (MKP) is a classical NP-hard combinatorial optimization problem with many engineering applications. In this paper, we propose a novel algorithm combining evolutionary computation with exact algorithm to solve the 0-1 MKP. It maintains a set of solutions and utilizes the information from the population to extract good partial assignments. To find high-quality solutions, an exact algorithm is applied to explore the promising search space specified by the good partial assignments. The new solutions are used to update the population. Thus, the good partial assignments evolve towards a better direction with the improvement of the population. Extensive experimentation with commonly used benchmark sets shows that our algorithm outperforms the state of the art heuristic algorithms, TPTEA and DQPSO. It finds better solutions than the existing algorithms and provides new lower bounds for 8 large and hard instances.",
    "link": "http://arxiv.org/abs/2210.03918",
    "context": "Title: Finding and Exploring Promising Search Space for the 0-1 Multidimensional Knapsack Problem. (arXiv:2210.03918v2 [cs.AI] UPDATED)\nAbstract: The 0-1 Multidimensional Knapsack Problem (MKP) is a classical NP-hard combinatorial optimization problem with many engineering applications. In this paper, we propose a novel algorithm combining evolutionary computation with exact algorithm to solve the 0-1 MKP. It maintains a set of solutions and utilizes the information from the population to extract good partial assignments. To find high-quality solutions, an exact algorithm is applied to explore the promising search space specified by the good partial assignments. The new solutions are used to update the population. Thus, the good partial assignments evolve towards a better direction with the improvement of the population. Extensive experimentation with commonly used benchmark sets shows that our algorithm outperforms the state of the art heuristic algorithms, TPTEA and DQPSO. It finds better solutions than the existing algorithms and provides new lower bounds for 8 large and hard instances.",
    "path": "papers/22/10/2210.03918.json",
    "total_tokens": 869,
    "translated_title": "寻找和探索0-1多维背包问题的有前途的搜索空间",
    "translated_abstract": "0-1多维背包问题是一个经典的NP困难组合优化问题，具有许多工程应用。本文提出了一种新的算法，将进化计算与精确算法相结合，用于解决0-1多维背包问题。它维护一组解，并利用来自群体的信息提取良好的部分分配。为了找到高质量的解，应用精确算法来探索由良好部分分配指定的有前途的搜索空间。新的解用于更新群体。因此，随着群体的改进，良好的部分分配朝着更好的方向演化。广泛的实验表明，我们的算法优于现有的启发式算法TPTEA和DQPSO。它找到了比现有算法更好的解，并为8个大规模和困难的实例提供了新的下界。",
    "tldr": "本文提出了一种将进化计算与精确算法相结合的新算法来解决0-1多维背包问题，通过探索有前途的搜索空间，找到了比现有算法更好的解，并提供了新的下界。",
    "en_tdlr": "This paper proposes a novel algorithm that combines evolutionary computation with an exact algorithm to solve the 0-1 Multidimensional Knapsack Problem. By exploring a promising search space, it finds better solutions than existing algorithms and provides new lower bounds."
}