{
    "title": "Approximation analysis of CNNs from a feature extraction view. (arXiv:2210.09041v2 [cs.LG] UPDATED)",
    "abstract": "Deep learning based on deep neural networks has been very successful in many practical applications, but it lacks enough theoretical understanding due to the network architectures and structures. In this paper we establish some analysis for linear feature extraction by a deep multi-channel convolutional neural networks (CNNs), which demonstrates the power of deep learning over traditional linear transformations, like Fourier, wavelets, redundant dictionary coding methods. Moreover, we give an exact construction presenting how linear features extraction can be conducted efficiently with multi-channel CNNs. It can be applied to lower the essential dimension for approximating a high dimensional function. Rates of function approximation by such deep networks implemented with channels and followed by fully-connected layers are investigated as well. Harmonic analysis for factorizing linear features into multi-resolution convolutions plays an essential role in our work. Nevertheless, a dedica",
    "link": "http://arxiv.org/abs/2210.09041",
    "context": "Title: Approximation analysis of CNNs from a feature extraction view. (arXiv:2210.09041v2 [cs.LG] UPDATED)\nAbstract: Deep learning based on deep neural networks has been very successful in many practical applications, but it lacks enough theoretical understanding due to the network architectures and structures. In this paper we establish some analysis for linear feature extraction by a deep multi-channel convolutional neural networks (CNNs), which demonstrates the power of deep learning over traditional linear transformations, like Fourier, wavelets, redundant dictionary coding methods. Moreover, we give an exact construction presenting how linear features extraction can be conducted efficiently with multi-channel CNNs. It can be applied to lower the essential dimension for approximating a high dimensional function. Rates of function approximation by such deep networks implemented with channels and followed by fully-connected layers are investigated as well. Harmonic analysis for factorizing linear features into multi-resolution convolutions plays an essential role in our work. Nevertheless, a dedica",
    "path": "papers/22/10/2210.09041.json",
    "total_tokens": 936,
    "translated_title": "从特征提取角度的CNN近似分析",
    "translated_abstract": "基于深度神经网络的深度学习在许多实际应用中取得了非常成功的结果，但由于网络架构和结构的限制，它缺乏足够的理论理解。在本文中，我们通过深度多通道卷积神经网络(CNNs)建立了一些线性特征提取的分析，这证明了深度学习在传统线性变换（如傅里叶变换、小波变换、冗余字典编码方法）上的强大能力。此外，我们给出了一个精确的构造，展示了如何利用多通道CNNs高效地进行线性特征提取。它可以用于降低逼近高维函数所需的基本维度。我们还研究了使用通道实现的深层网络和全连接层的函数逼近速率。将线性特征因子分解为多分辨卷积在我们的工作中起着重要作用。",
    "tldr": "本文通过深度卷积神经网络对线性特征提取进行了近似分析，并展示了深度学习相对于传统线性变换的强大能力。通过创造性的构造，我们有效地实现了线性特征提取，并且探究了深层网络的函数逼近速度。线性特征的多分辨卷积分解在我们的工作中起着核心作用。",
    "en_tdlr": "This paper provides an approximation analysis of linear feature extraction using deep multi-channel convolutional neural networks (CNNs), demonstrating the superior capabilities of deep learning compared to traditional linear transformations. The authors also present an efficient construction for linear feature extraction and investigate the function approximation rates of deep networks. The factorization of linear features into multi-resolution convolutions plays a crucial role in their work."
}