{
    "title": "LP-BFGS attack: An adversarial attack based on the Hessian with limited pixels. (arXiv:2210.15446v2 [cs.CR] UPDATED)",
    "abstract": "Deep neural networks are vulnerable to adversarial attacks. Most $L_{0}$-norm based white-box attacks craft perturbations by the gradient of models to the input. Since the computation cost and memory limitation of calculating the Hessian matrix, the application of Hessian or approximate Hessian in white-box attacks is gradually shelved. In this work, we note that the sparsity requirement on perturbations naturally lends itself to the usage of Hessian information. We study the attack performance and computation cost of the attack method based on the Hessian with a limited number of perturbation pixels. Specifically, we propose the Limited Pixel BFGS (LP-BFGS) attack method by incorporating the perturbation pixel selection strategy and the BFGS algorithm. Pixels with top-k attribution scores calculated by the Integrated Gradient method are regarded as optimization variables of the LP-BFGS attack. Experimental results across different networks and datasets demonstrate that our approach ha",
    "link": "http://arxiv.org/abs/2210.15446",
    "context": "Title: LP-BFGS attack: An adversarial attack based on the Hessian with limited pixels. (arXiv:2210.15446v2 [cs.CR] UPDATED)\nAbstract: Deep neural networks are vulnerable to adversarial attacks. Most $L_{0}$-norm based white-box attacks craft perturbations by the gradient of models to the input. Since the computation cost and memory limitation of calculating the Hessian matrix, the application of Hessian or approximate Hessian in white-box attacks is gradually shelved. In this work, we note that the sparsity requirement on perturbations naturally lends itself to the usage of Hessian information. We study the attack performance and computation cost of the attack method based on the Hessian with a limited number of perturbation pixels. Specifically, we propose the Limited Pixel BFGS (LP-BFGS) attack method by incorporating the perturbation pixel selection strategy and the BFGS algorithm. Pixels with top-k attribution scores calculated by the Integrated Gradient method are regarded as optimization variables of the LP-BFGS attack. Experimental results across different networks and datasets demonstrate that our approach ha",
    "path": "papers/22/10/2210.15446.json",
    "total_tokens": 933,
    "translated_title": "LP-BFGS攻击：基于Hessian矩阵的有限像素敌对样本攻击",
    "translated_abstract": "深度神经网络容易遭受对抗攻击。大多数基于$L_0$-norm的白盒攻击是通过计算模型对输入的梯度来构造扰动。由于计算Hessian矩阵的计算成本和内存限制，Hessian或近似Hessian在白盒攻击中的应用逐渐被搁置。本文注意到$L_0$-norm条件自然也要求扰动是稀疏的，因此可以利用Hessian矩阵的信息。我们研究了基于有限扰动像素的Hessian矩阵攻击方法的攻击性能和计算成本。具体而言，我们提出了Limited Pixel BFGS (LP-BFGS)攻击算法，该算法结合了扰动像素选择策略和BFGS算法，将由Integrated Gradient方法计算的前k个像素的表示分数视为优化变量。在不同网络和数据集上的实验结果表明，我们的方法在攻击成功率方面具有竞争优势。",
    "tldr": "本文针对深度神经网络的对抗攻击，基于有限像素的Hessian矩阵信息，提出了Limited Pixel BFGS（LP-BFGS）攻击方法，该方法在攻击成功率和计算成本方面具有竞争优势。",
    "en_tdlr": "This paper proposes the Limited Pixel BFGS (LP-BFGS) attack method based on the Hessian matrix with a limited number of perturbation pixels for adversarial attacks on deep neural networks, which has a competitive advantage in attack success rate and computation cost across different networks and datasets."
}