{
    "title": "STAP: Sequencing Task-Agnostic Policies. (arXiv:2210.12250v2 [cs.RO] UPDATED)",
    "abstract": "Advances in robotic skill acquisition have made it possible to build general-purpose libraries of learned skills for downstream manipulation tasks. However, naively executing these skills one after the other is unlikely to succeed without accounting for dependencies between actions prevalent in long-horizon plans. We present Sequencing Task-Agnostic Policies (STAP), a scalable framework for training manipulation skills and coordinating their geometric dependencies at planning time to solve long-horizon tasks never seen by any skill during training. Given that Q-functions encode a measure of skill feasibility, we formulate an optimization problem to maximize the joint success of all skills sequenced in a plan, which we estimate by the product of their Q-values. Our experiments indicate that this objective function approximates ground truth plan feasibility and, when used as a planning objective, reduces myopic behavior and thereby promotes long-horizon task success. We further demonstra",
    "link": "http://arxiv.org/abs/2210.12250",
    "raw_ret": "{\n    \"translated_title\": \"STAP:无任务序列政策的测序. (arXiv:2210.12250v2 [cs.RO] 更新)\",\n    \"translated_abstract\": \"机器人技能学习的进步使得构建通用的学习技能库用于下游操作任务成为可能。然而，简单地一次执行这些技能不太可能成功，除非考虑到长期计划中普遍存在的动作依赖关系。我们提出了Sequencing Task-Agnostic Policies (STAP)，这是一个可扩展的框架，用于训练操作技能并在规划时协调它们的几何依赖关系，以解决在训练期间任何技能都没有看到的长期任务。鉴于Q函数编码了技能可行性的度量，我们制定了一个优化问题，以最大化计划中所有技能的联合成功，我们通过它们的Q值的乘积来估计。我们的实验表明，这个目标函数近似于地面真实计划的可行性，并且，当用作规划目标时，减少了目光短浅的行为，从而促进了长期的任务成功。我们进一步证明\",\n    \"tldr\": \"STAP是一个训练操作技能的框架，可以协调它们的几何依赖关系以解决长期任务。优化问题以最大化所有技能的联合成功，近似于地面真实计划的可行性，并促进长期任务成功。\"\n}",
    "total_tokens": 879,
    "ret": {
        "translated_title": "STAP:无任务序列政策的测序. (arXiv:2210.12250v2 [cs.RO] 更新)",
        "translated_abstract": "机器人技能学习的进步使得构建通用的学习技能库用于下游操作任务成为可能。然而，简单地一次执行这些技能不太可能成功，除非考虑到长期计划中普遍存在的动作依赖关系。我们提出了Sequencing Task-Agnostic Policies (STAP)，这是一个可扩展的框架，用于训练操作技能并在规划时协调它们的几何依赖关系，以解决在训练期间任何技能都没有看到的长期任务。鉴于Q函数编码了技能可行性的度量，我们制定了一个优化问题，以最大化计划中所有技能的联合成功，我们通过它们的Q值的乘积来估计。我们的实验表明，这个目标函数近似于地面真实计划的可行性，并且，当用作规划目标时，减少了目光短浅的行为，从而促进了长期的任务成功。我们进一步证明",
        "tldr": "STAP是一个训练操作技能的框架，可以协调它们的几何依赖关系以解决长期任务。优化问题以最大化所有技能的联合成功，近似于地面真实计划的可行性，并促进长期任务成功。"
    }
}