{
    "title": "Towards trustworthy multi-modal motion prediction: Holistic evaluation and interpretability of outputs. (arXiv:2210.16144v2 [cs.RO] UPDATED)",
    "abstract": "Predicting the motion of other road agents enables autonomous vehicles to perform safe and efficient path planning. This task is very complex, as the behaviour of road agents depends on many factors and the number of possible future trajectories can be considerable (multi-modal). Most prior approaches proposed to address multi-modal motion prediction are based on complex machine learning systems that have limited interpretability. Moreover, the metrics used in current benchmarks do not evaluate all aspects of the problem, such as the diversity and admissibility of the output. In this work, we aim to advance towards the design of trustworthy motion prediction systems, based on some of the requirements for the design of Trustworthy Artificial Intelligence. We focus on evaluation criteria, robustness, and interpretability of outputs. First, we comprehensively analyse the evaluation metrics, identify the main gaps of current benchmarks, and propose a new holistic evaluation framework. We t",
    "link": "http://arxiv.org/abs/2210.16144",
    "context": "Title: Towards trustworthy multi-modal motion prediction: Holistic evaluation and interpretability of outputs. (arXiv:2210.16144v2 [cs.RO] UPDATED)\nAbstract: Predicting the motion of other road agents enables autonomous vehicles to perform safe and efficient path planning. This task is very complex, as the behaviour of road agents depends on many factors and the number of possible future trajectories can be considerable (multi-modal). Most prior approaches proposed to address multi-modal motion prediction are based on complex machine learning systems that have limited interpretability. Moreover, the metrics used in current benchmarks do not evaluate all aspects of the problem, such as the diversity and admissibility of the output. In this work, we aim to advance towards the design of trustworthy motion prediction systems, based on some of the requirements for the design of Trustworthy Artificial Intelligence. We focus on evaluation criteria, robustness, and interpretability of outputs. First, we comprehensively analyse the evaluation metrics, identify the main gaps of current benchmarks, and propose a new holistic evaluation framework. We t",
    "path": "papers/22/10/2210.16144.json",
    "total_tokens": 858,
    "translated_title": "迈向可信多模态运动预测: 输出的整体评估和可解释性",
    "translated_abstract": "预测其他道路参与者的运动能使自动驾驶车辆执行安全高效的路径规划。这个任务非常复杂，因为道路参与者的行为取决于许多因素，并且可能的未来轨迹数量可观（多模态）。大多数先前的方法旨在解决多模态运动预测问题的复杂机器学习系统解释性有限。此外，当前基准所使用的指标不评估问题的所有方面，例如输出的多样性和可接受性。在这项工作中，我们旨在根据“可信人工智能设计”的一些要求，推动可信运动预测系统的设计。我们关注评估标准、鲁棒性和输出可解释性。首先，我们全面分析评估指标，确定当前基准的主要缺陷，并提出一个新的整体评估框架。",
    "tldr": "本研究旨在设计可信赖的运动预测系统，通过综合评估指标、提高鲁棒性和输出的可解释性。研究分析了当前基准的主要缺陷，并提出了新的整体评估框架。"
}