{
    "title": "Learning Transfer Operators by Kernel Density Estimation. (arXiv:2210.03124v3 [cs.LG] UPDATED)",
    "abstract": "Inference of transfer operators from data is often formulated as a classical problem that hinges on the Ulam method. The conventional description, known as the Ulam-Galerkin method, involves projecting onto basis functions represented as characteristic functions supported over a fine grid of rectangles. From this perspective, the Ulam-Galerkin approach can be interpreted as density estimation using the histogram method. In this study, we recast the problem within the framework of statistical density estimation. This alternative perspective allows for an explicit and rigorous analysis of bias and variance, thereby facilitating a discussion on the mean square error. Through comprehensive examples utilizing the logistic map and a Markov map, we demonstrate the validity and effectiveness of this approach in estimating the eigenvectors of the Frobenius-Perron operator. We compare the performance of Histogram Density Estimation(HDE) and Kernel Density Estimation(KDE) methods and find that KD",
    "link": "http://arxiv.org/abs/2210.03124",
    "context": "Title: Learning Transfer Operators by Kernel Density Estimation. (arXiv:2210.03124v3 [cs.LG] UPDATED)\nAbstract: Inference of transfer operators from data is often formulated as a classical problem that hinges on the Ulam method. The conventional description, known as the Ulam-Galerkin method, involves projecting onto basis functions represented as characteristic functions supported over a fine grid of rectangles. From this perspective, the Ulam-Galerkin approach can be interpreted as density estimation using the histogram method. In this study, we recast the problem within the framework of statistical density estimation. This alternative perspective allows for an explicit and rigorous analysis of bias and variance, thereby facilitating a discussion on the mean square error. Through comprehensive examples utilizing the logistic map and a Markov map, we demonstrate the validity and effectiveness of this approach in estimating the eigenvectors of the Frobenius-Perron operator. We compare the performance of Histogram Density Estimation(HDE) and Kernel Density Estimation(KDE) methods and find that KD",
    "path": "papers/22/10/2210.03124.json",
    "total_tokens": 860,
    "translated_title": "通过核密度估计学习传递算子",
    "translated_abstract": "从数据中推断传递算子经常被看作是一个基于乌拉姆方法的经典问题。传统描述中的乌拉姆-加勒金方法涉及到将基函数投影到以细网格的矩形支持的特征函数上。从这个角度来看，乌拉姆-加勒金方法可以被解释为使用直方图方法进行密度估计。在本研究中，我们把这个问题重新放到了统计密度估计的框架中。这种替代的观点允许对偏差和方差进行明确和严格的分析，从而促进对均方误差的讨论。通过使用逻辑映射和马尔可夫映射的综合示例，我们证明了该方法在估计Frobenius-Perron算子的特征向量上的有效性和有效性。我们比较了直方图密度估计（HDE）和核密度估计（KDE）方法的性能，并发现KDE方法在该问题上表现更好。",
    "tldr": "本研究通过核密度估计方法，重新解释了传递算子的推断问题，并通过实例表明了该方法在估计Frobenius-Perron算子的特征向量上的有效性和有效性。"
}