{
    "title": "AI-Assisted Discovery of Quantitative and Formal Models in Social Science. (arXiv:2210.00563v3 [cs.SC] UPDATED)",
    "abstract": "In social science, formal and quantitative models, such as ones describing economic growth and collective action, are used to formulate mechanistic explanations, provide predictions, and uncover questions about observed phenomena. Here, we demonstrate the use of a machine learning system to aid the discovery of symbolic models that capture nonlinear and dynamical relationships in social science datasets. By extending neuro-symbolic methods to find compact functions and differential equations in noisy and longitudinal data, we show that our system can be used to discover interpretable models from real-world data in economics and sociology. Augmenting existing workflows with symbolic regression can help uncover novel relationships and explore counterfactual models during the scientific process. We propose that this AI-assisted framework can bridge parametric and non-parametric models commonly employed in social science research by systematically exploring the space of nonlinear models an",
    "link": "http://arxiv.org/abs/2210.00563",
    "context": "Title: AI-Assisted Discovery of Quantitative and Formal Models in Social Science. (arXiv:2210.00563v3 [cs.SC] UPDATED)\nAbstract: In social science, formal and quantitative models, such as ones describing economic growth and collective action, are used to formulate mechanistic explanations, provide predictions, and uncover questions about observed phenomena. Here, we demonstrate the use of a machine learning system to aid the discovery of symbolic models that capture nonlinear and dynamical relationships in social science datasets. By extending neuro-symbolic methods to find compact functions and differential equations in noisy and longitudinal data, we show that our system can be used to discover interpretable models from real-world data in economics and sociology. Augmenting existing workflows with symbolic regression can help uncover novel relationships and explore counterfactual models during the scientific process. We propose that this AI-assisted framework can bridge parametric and non-parametric models commonly employed in social science research by systematically exploring the space of nonlinear models an",
    "path": "papers/22/10/2210.00563.json",
    "total_tokens": 892,
    "translated_title": "在社会科学中辅助AI发现定量和形式模型",
    "translated_abstract": "在社会科学中，使用形式和定量模型，如描述经济增长和集体行动的模型，以制定机械解释，提供预测，并揭示有关观察到现象的问题。在这里，我们展示了使用机器学习系统辅助发现能够捕捉社会科学数据集中的非线性和动态关系的符号模型的方法。通过将神经符号方法扩展到嘈杂和纵向数据中找到简洁函数和微分方程，我们展示了我们的系统可以从经济学和社会学的真实数据中发现可解释的模型。通过将符号回归与现有工作流相结合，可以帮助发现新的关系，并在科学过程中探索对照模型。我们提出，这种AI辅助框架可以通过系统地探索非线性模型空间来桥接社会科学研究中常用的参数化和非参数化模型。",
    "tldr": "该论文介绍了在社会科学研究中辅助AI发现定量和形式模型的方法。通过扩展神经符号方法，该系统能够从真实数据中发现可解释的非线性和动态关系，帮助科学家在研究过程中揭示新的关系和探索对照模型。",
    "en_tdlr": "This paper presents a method for AI-assisted discovery of quantitative and formal models in social science research. By extending neuro-symbolic methods, the system can discover interpretable nonlinear and dynamic relationships from real-world data, enabling scientists to uncover new relationships and explore counterfactual models during the research process."
}