{
    "title": "Random Utterance Concatenation Based Data Augmentation for Improving Short-video Speech Recognition. (arXiv:2210.15876v2 [eess.AS] UPDATED)",
    "abstract": "One of limitations in end-to-end automatic speech recognition (ASR) framework is its performance would be compromised if train-test utterance lengths are mismatched. In this paper, we propose an on-the-fly random utterance concatenation (RUC) based data augmentation method to alleviate train-test utterance length mismatch issue for short-video ASR task. Specifically, we are motivated by observations that our human-transcribed training utterances tend to be much shorter for short-video spontaneous speech (~3 seconds on average), while our test utterance generated from voice activity detection front-end is much longer (~10 seconds on average). Such a mismatch can lead to suboptimal performance. Empirically, it's observed the proposed RUC method significantly improves long utterance recognition without performance drop on short one. Overall, it achieves 5.72% word error rate reduction on average for 15 languages and improved robustness to various utterance length.",
    "link": "http://arxiv.org/abs/2210.15876",
    "context": "Title: Random Utterance Concatenation Based Data Augmentation for Improving Short-video Speech Recognition. (arXiv:2210.15876v2 [eess.AS] UPDATED)\nAbstract: One of limitations in end-to-end automatic speech recognition (ASR) framework is its performance would be compromised if train-test utterance lengths are mismatched. In this paper, we propose an on-the-fly random utterance concatenation (RUC) based data augmentation method to alleviate train-test utterance length mismatch issue for short-video ASR task. Specifically, we are motivated by observations that our human-transcribed training utterances tend to be much shorter for short-video spontaneous speech (~3 seconds on average), while our test utterance generated from voice activity detection front-end is much longer (~10 seconds on average). Such a mismatch can lead to suboptimal performance. Empirically, it's observed the proposed RUC method significantly improves long utterance recognition without performance drop on short one. Overall, it achieves 5.72% word error rate reduction on average for 15 languages and improved robustness to various utterance length.",
    "path": "papers/22/10/2210.15876.json",
    "total_tokens": 982,
    "translated_title": "基于随机话语拼接的数据增强用于提高短视频语音识别",
    "translated_abstract": "端到端自动语音识别框架的局限性之一是在训练和测试话语长度不匹配时，其性能会受到影响。本文提出了一种即时基于随机话语拼接的数据增强方法，用于缓解短视频语音识别任务中的训练和测试话语长度不匹配问题。具体来说，我们针对观察到的人类转录的训练话语往往对于短视频自发语音（平均约3秒）要短得多的情况，而由语音活动检测前端生成的测试话语则要长得多（平均约10秒）。这种不匹配可能导致表现次优。实证表明，所提出的RUC方法显著提高了长话语的识别率，而对短话语的性能没有下降。总体而言，对于15种语言，该方法平均实现了5.72％的词错误率降低，并提高了对各种话语长度的稳健性。",
    "tldr": "本文提出了一种基于随机话语拼接的数据增强方法，用于提高短视频语音识别任务的训练和测试话语长度不匹配问题。该方法可显著提高长话语的识别率，同时对短话语的性能没有下降，并取得了5.72%的词错误率降低。",
    "en_tdlr": "This paper proposes a data augmentation method based on random utterance concatenation to address the issue of train-test utterance length mismatch in short-video speech recognition tasks. The proposed method significantly improves recognition performance for long utterances without deteriorating performance for short utterances, achieving an average word error rate reduction of 5.72% for 15 languages and increased robustness to varying utterance length."
}