{
    "title": "Conditional Feature Importance for Mixed Data. (arXiv:2210.03047v3 [stat.ML] UPDATED)",
    "abstract": "Despite the popularity of feature importance (FI) measures in interpretable machine learning, the statistical adequacy of these methods is rarely discussed. From a statistical perspective, a major distinction is between analyzing a variable's importance before and after adjusting for covariates i.e., between $\\textit{marginal}$ and $\\textit{conditional}$ measures. Our work draws attention to this rarely acknowledged, yet crucial distinction and showcases its implications. Further, we reveal that for testing conditional FI, only few methods are available and practitioners have hitherto been severely restricted in method application due to mismatching data requirements. Most real-world data exhibits complex feature dependencies and incorporates both continuous and categorical data (mixed data). Both properties are oftentimes neglected by conditional FI measures. To fill this gap, we propose to combine the conditional predictive impact (CPI) framework with sequential knockoff sampling. ",
    "link": "http://arxiv.org/abs/2210.03047",
    "context": "Title: Conditional Feature Importance for Mixed Data. (arXiv:2210.03047v3 [stat.ML] UPDATED)\nAbstract: Despite the popularity of feature importance (FI) measures in interpretable machine learning, the statistical adequacy of these methods is rarely discussed. From a statistical perspective, a major distinction is between analyzing a variable's importance before and after adjusting for covariates i.e., between $\\textit{marginal}$ and $\\textit{conditional}$ measures. Our work draws attention to this rarely acknowledged, yet crucial distinction and showcases its implications. Further, we reveal that for testing conditional FI, only few methods are available and practitioners have hitherto been severely restricted in method application due to mismatching data requirements. Most real-world data exhibits complex feature dependencies and incorporates both continuous and categorical data (mixed data). Both properties are oftentimes neglected by conditional FI measures. To fill this gap, we propose to combine the conditional predictive impact (CPI) framework with sequential knockoff sampling. ",
    "path": "papers/22/10/2210.03047.json",
    "total_tokens": 919,
    "translated_title": "混合数据的条件特征重要性",
    "translated_abstract": "尽管特征重要性（FI）在可解释的机器学习中很受欢迎，但这些方法的统计充分性很少被讨论。从统计角度看，一个主要区别是在调整协变量之前和之后分析变量的重要性，即“边缘”和“条件”度量之间。我们的工作引起了这种很少被承认但至关重要的区别的注意，并展示了其影响。此外，我们揭示了测试条件FI时只有少数方法可用，而从业者过去由于数据要求不匹配而受到严重限制。大多数现实世界的数据都表现出复杂的特征依赖性，并包含连续和分类数据（混合数据）。这些属性通常被条件FI度量所忽略。为了填补这一空白，我们提出将条件预测影响（CPI）框架与顺序knockoff抽样相结合。",
    "tldr": "本研究提出了一种针对混合数据的条件特征重要性框架，使用条件预测影响和顺序knockoff抽样结合，以解决很少讨论的条件和边缘度量之间的重要区别，并揭示出为测试条件FI，目前只有少数方法可用且过去从业者由于数据要求不匹配而受到严重限制。",
    "en_tdlr": "This study proposes a framework for conditional feature importance in mixed data, which combines conditional predictive impact and sequential knockoff sampling to address the rarely discussed important distinction between conditional and marginal measures, and reveals the limited availability of methods for testing conditional FI with complex feature dependencies and mixed data often neglected by current measures."
}