{
    "title": "Counter-Adversarial Learning with Inverse Unscented Kalman Filter. (arXiv:2210.00359v2 [math.OC] UPDATED)",
    "abstract": "In counter-adversarial systems, to infer the strategy of an intelligent adversarial agent, the defender agent needs to cognitively sense the information that the adversary has gathered about the latter. Prior works on the problem employ linear Gaussian state-space models and solve this inverse cognition problem by designing inverse stochastic filters. However, in practice, counter-adversarial systems are generally highly nonlinear. In this paper, we address this scenario by formulating inverse cognition as a nonlinear Gaussian state-space model, wherein the adversary employs an unscented Kalman filter (UKF) to estimate the defender's state with reduced linearization errors. To estimate the adversary's estimate of the defender, we propose and develop an inverse UKF (IUKF) system. We then derive theoretical guarantees for the stochastic stability of IUKF in the mean-squared boundedness sense. Numerical experiments for multiple practical applications show that the estimation error of IUKF",
    "link": "http://arxiv.org/abs/2210.00359",
    "context": "Title: Counter-Adversarial Learning with Inverse Unscented Kalman Filter. (arXiv:2210.00359v2 [math.OC] UPDATED)\nAbstract: In counter-adversarial systems, to infer the strategy of an intelligent adversarial agent, the defender agent needs to cognitively sense the information that the adversary has gathered about the latter. Prior works on the problem employ linear Gaussian state-space models and solve this inverse cognition problem by designing inverse stochastic filters. However, in practice, counter-adversarial systems are generally highly nonlinear. In this paper, we address this scenario by formulating inverse cognition as a nonlinear Gaussian state-space model, wherein the adversary employs an unscented Kalman filter (UKF) to estimate the defender's state with reduced linearization errors. To estimate the adversary's estimate of the defender, we propose and develop an inverse UKF (IUKF) system. We then derive theoretical guarantees for the stochastic stability of IUKF in the mean-squared boundedness sense. Numerical experiments for multiple practical applications show that the estimation error of IUKF",
    "path": "papers/22/10/2210.00359.json",
    "total_tokens": 840,
    "translated_title": "对抗学习中的反向无味卡尔曼滤波器",
    "translated_abstract": "在对抗学习系统中，为了推断出智能对手的策略，防御者代理需要认知地感知对手已经收集到的关于自己的信息。先前的研究使用线性高斯状态空间模型，并通过设计反向随机过滤器来解决这个反向认知问题。然而，在实践中，对抗性系统通常是高度非线性的。本文通过将反向认知作为一种非线性高斯状态空间模型进行了研究，并提出了一种逆无味卡尔曼滤波器（IUKF）系统来估计对手对防御者的估计。然后，我们推导了IUKF在均方有界的意义下的随机稳定性的理论保证。多个实际应用的数值实验表明，IUKF的估计误差",
    "tldr": "本文提出了逆无味卡尔曼滤波器系统，用于解决对抗学习中的反向认知问题。实验证明，此系统具有良好的估计精度和稳定性。",
    "en_tdlr": "This paper proposes an inverse Unscented Kalman Filter system to address the problem of inverse cognition in counter-adversarial systems. Numerical experiments demonstrate that the system has good estimation accuracy and stability."
}