{
    "title": "Time-aware Metapath Feature Augmentation for Ponzi Detection in Ethereum",
    "abstract": "arXiv:2210.16863v2 Announce Type: replace  Abstract: With the development of Web 3.0 which emphasizes decentralization, blockchain technology ushers in its revolution and also brings numerous challenges, particularly in the field of cryptocurrency. Recently, a large number of criminal behaviors continuously emerge on blockchain, such as Ponzi schemes and phishing scams, which severely endanger decentralized finance. Existing graph-based abnormal behavior detection methods on blockchain usually focus on constructing homogeneous transaction graphs without distinguishing the heterogeneity of nodes and edges, resulting in partial loss of transaction pattern information. Although existing heterogeneous modeling methods can depict richer information through metapaths, the extracted metapaths generally neglect temporal dependencies between entities and do not reflect real behavior. In this paper, we introduce Time-aware Metapath Feature Augmentation (TMFAug) as a plug-and-play module to captu",
    "link": "https://arxiv.org/abs/2210.16863",
    "context": "Title: Time-aware Metapath Feature Augmentation for Ponzi Detection in Ethereum\nAbstract: arXiv:2210.16863v2 Announce Type: replace  Abstract: With the development of Web 3.0 which emphasizes decentralization, blockchain technology ushers in its revolution and also brings numerous challenges, particularly in the field of cryptocurrency. Recently, a large number of criminal behaviors continuously emerge on blockchain, such as Ponzi schemes and phishing scams, which severely endanger decentralized finance. Existing graph-based abnormal behavior detection methods on blockchain usually focus on constructing homogeneous transaction graphs without distinguishing the heterogeneity of nodes and edges, resulting in partial loss of transaction pattern information. Although existing heterogeneous modeling methods can depict richer information through metapaths, the extracted metapaths generally neglect temporal dependencies between entities and do not reflect real behavior. In this paper, we introduce Time-aware Metapath Feature Augmentation (TMFAug) as a plug-and-play module to captu",
    "path": "papers/22/10/2210.16863.json",
    "total_tokens": 833,
    "translated_title": "以太坊Ponzi检测的时序元路径特征增强",
    "translated_abstract": "随着强调去中心化的Web 3.0的发展，区块链技术迎来了自己的革命，并带来了许多挑战，特别是在加密货币领域。最近，大量的犯罪行为不断在区块链上出现，如庞氏骗局和钓鱼欺诈，这严重危害了去中心化金融。现有基于图的区块链异常行为检测方法通常侧重于构建同质交易图，而没有区分节点和边的异质性，导致交易模式信息的部分丢失。尽管现有的异质建模方法可以通过元路径描述更丰富的信息，但提取的元路径通常忽视实体之间的时间依赖性，并且不反映真实行为。本文引入了时间感知元路径特征增强（TMFAug）作为一种即插即用模块，用于捕获",
    "tldr": "该研究介绍了一种用于以太坊Ponzi检测的时序元路径特征增强方法，旨在捕获交易模式信息中的时间依赖性。",
    "en_tdlr": "This paper introduces a Time-aware Metapath Feature Augmentation (TMFAug) method for Ponzi detection in Ethereum, aiming to capture the temporal dependencies in transaction pattern information."
}