{
    "title": "An out-of-distribution discriminator based on Bayesian neural network epistemic uncertainty. (arXiv:2210.10780v2 [cs.LG] UPDATED)",
    "abstract": "Neural networks have revolutionized the field of machine learning with increased predictive capability. In addition to improving the predictions of neural networks, there is a simultaneous demand for reliable uncertainty quantification on estimates made by machine learning methods such as neural networks. Bayesian neural networks (BNNs) are an important type of neural network with built-in capability for quantifying uncertainty. This paper discusses aleatoric and epistemic uncertainty in BNNs and how they can be calculated. With an example dataset of images where the goal is to identify the amplitude of an event in the image, it is shown that epistemic uncertainty tends to be lower in images which are well-represented in the training dataset and tends to be high in images which are not well-represented. An algorithm for out-of-distribution (OoD) detection with BNN epistemic uncertainty is introduced along with various experiments demonstrating factors influencing the OoD detection capa",
    "link": "http://arxiv.org/abs/2210.10780",
    "context": "Title: An out-of-distribution discriminator based on Bayesian neural network epistemic uncertainty. (arXiv:2210.10780v2 [cs.LG] UPDATED)\nAbstract: Neural networks have revolutionized the field of machine learning with increased predictive capability. In addition to improving the predictions of neural networks, there is a simultaneous demand for reliable uncertainty quantification on estimates made by machine learning methods such as neural networks. Bayesian neural networks (BNNs) are an important type of neural network with built-in capability for quantifying uncertainty. This paper discusses aleatoric and epistemic uncertainty in BNNs and how they can be calculated. With an example dataset of images where the goal is to identify the amplitude of an event in the image, it is shown that epistemic uncertainty tends to be lower in images which are well-represented in the training dataset and tends to be high in images which are not well-represented. An algorithm for out-of-distribution (OoD) detection with BNN epistemic uncertainty is introduced along with various experiments demonstrating factors influencing the OoD detection capa",
    "path": "papers/22/10/2210.10780.json",
    "total_tokens": 950,
    "translated_title": "基于贝叶斯神经网络先验不确定性的越域鉴别器",
    "translated_abstract": "神经网络在机器学习领域中具有增强的预测能力，但同时也需要可靠的不确定性量化。贝叶斯神经网络（BNN）是一种重要的神经网络类型，具有内建的不确定性量化能力。本文讨论了BNN中的不确定性类型以及如何计算。通过对一个图像数据集的例子进行实验，其中目标是识别图像中事件的幅度，结果表明在训练数据集中有很好表示的图像的先验不确定性较低，而在训练数据集中很差表示的图像中先验不确定性较高。文章介绍了一种基于BNN先验不确定性的越域检测算法，并通过多个实验展示了影响越域检测能力的因素。",
    "tldr": "本文研究了基于贝叶斯神经网络的越域鉴别器，并探讨了BNN中的不确定性类型以及如何计算。实验证明在训练数据集中较好表示的图像的先验不确定性较低，而在训练数据集中较差表示的图像中先验不确定性较高。文章还提出了一种基于BNN先验不确定性的越域检测算法，并通过实验证明了其有效性。",
    "en_tdlr": "This paper presents an out-of-distribution discriminator based on Bayesian neural networks, discusses different types of uncertainty in BNNs and their calculation, and shows that well-represented images have lower epistemic uncertainty while poorly-represented images have higher epistemic uncertainty. The paper also introduces an algorithm for out-of-distribution detection using BNN epistemic uncertainty and demonstrates its effectiveness through experiments."
}