{
    "title": "EraseNet: A Recurrent Residual Network for Supervised Document Cleaning. (arXiv:2210.00708v2 [cs.CV] UPDATED)",
    "abstract": "Document denoising is considered one of the most challenging tasks in computer vision. There exist millions of documents that are still to be digitized, but problems like document degradation due to natural and man-made factors make this task very difficult. This paper introduces a supervised approach for cleaning dirty documents using a new fully convolutional auto-encoder architecture. This paper focuses on restoring documents with discrepancies like deformities caused due to aging of a document, creases left on the pages that were xeroxed, random black patches, lightly visible text, etc., and also improving the quality of the image for better optical character recognition system (OCR) performance. Removing noise from scanned documents is a very important step before the documents as this noise can severely affect the performance of an OCR system. The experiments in this paper have shown promising results as the model is able to learn a variety of ordinary as well as unusual noises a",
    "link": "http://arxiv.org/abs/2210.00708",
    "context": "Title: EraseNet: A Recurrent Residual Network for Supervised Document Cleaning. (arXiv:2210.00708v2 [cs.CV] UPDATED)\nAbstract: Document denoising is considered one of the most challenging tasks in computer vision. There exist millions of documents that are still to be digitized, but problems like document degradation due to natural and man-made factors make this task very difficult. This paper introduces a supervised approach for cleaning dirty documents using a new fully convolutional auto-encoder architecture. This paper focuses on restoring documents with discrepancies like deformities caused due to aging of a document, creases left on the pages that were xeroxed, random black patches, lightly visible text, etc., and also improving the quality of the image for better optical character recognition system (OCR) performance. Removing noise from scanned documents is a very important step before the documents as this noise can severely affect the performance of an OCR system. The experiments in this paper have shown promising results as the model is able to learn a variety of ordinary as well as unusual noises a",
    "path": "papers/22/10/2210.00708.json",
    "total_tokens": 922,
    "translated_title": "EraseNet: 一种用于监督文档清洗的循环残差网络",
    "translated_abstract": "文档去噪被认为是计算机视觉中最具挑战性的任务之一。仍有数百万份待数字化的文档，但是由于自然和人为因素引起的文档退化等问题使得这一任务非常困难。本文介绍了一种使用全新的全卷积自编码器架构来清洗脏乱文档的监督方法。本文重点恢复具有缺陷的文档，例如由于文档老化引起的变形、复印时留下的折痕、随机的黑色斑点、轻微可见的文本等，并且提高图像质量以获得更好的光学字符识别系统(OCR)性能。在文档成为OCR系统的输入之前，从扫描文档中去除噪声是非常重要的一步，因为噪声可能严重影响OCR系统的性能。本文的实验结果表明，该模型能够学习各种常见和不寻常的噪声。",
    "tldr": "本文介绍了一种名为EraseNet的循环残差网络，用于监督文档清洗。该方法利用全卷积自编码器架构来清洗脏乱文档，并能够恢复具有缺陷的文档以提高光学字符识别系统的性能。",
    "en_tdlr": "This paper introduces EraseNet, a recurrent residual network for supervised document cleaning. It utilizes a fully convolutional auto-encoder architecture to clean dirty documents and restore documents with discrepancies, improving the performance of optical character recognition system."
}