{
    "title": "Assessing the difference between integrated quantiles and integrated cumulative distribution functions. (arXiv:2210.16880v3 [q-fin.RM] UPDATED)",
    "abstract": "This paper offers a mathematical invention that shows how to convert integrated quantiles, which often appear in risk measures, into integrated cumulative distribution functions, which are technically more tractable from various perspectives. The invention helps to avoid a number of technical assumptions that have been traditionally imposed when working with quantities containing quantiles. In particular it helps to completely avoid the requirement of the existence of a probability density function. The developed results explain and illustrate the invention, whose byproducts include the assessment of model uncertainty and misspecification, and the derivation of statistical inference results.",
    "link": "http://arxiv.org/abs/2210.16880",
    "context": "Title: Assessing the difference between integrated quantiles and integrated cumulative distribution functions. (arXiv:2210.16880v3 [q-fin.RM] UPDATED)\nAbstract: This paper offers a mathematical invention that shows how to convert integrated quantiles, which often appear in risk measures, into integrated cumulative distribution functions, which are technically more tractable from various perspectives. The invention helps to avoid a number of technical assumptions that have been traditionally imposed when working with quantities containing quantiles. In particular it helps to completely avoid the requirement of the existence of a probability density function. The developed results explain and illustrate the invention, whose byproducts include the assessment of model uncertainty and misspecification, and the derivation of statistical inference results.",
    "path": "papers/22/10/2210.16880.json",
    "total_tokens": 719,
    "translated_title": "综合分位数与综合累积分布函数之间的差异评估",
    "translated_abstract": "本文提供了一种数学发明，展示了如何将常常在风险度量中出现的综合分位数转化为技术上更易处理的综合累积分布函数。该发明有助于避免在处理包含分位数的量时通常需要强加的一些技术假设。特别地，它可以完全避免要求存在概率密度函数的要求。本文阐释和说明了这一发明，其副产品包括模型不确定性和错误设置的评估，以及统计推断结果的推导。",
    "tldr": "本文提供一种数学发明，将经常在风险度量中出现的综合分位数转化为更易处理的综合累积分布函数，避免了存在概率密度函数的要求，可评估模型不确定性和错误设置，以及推导统计推断结果。",
    "en_tdlr": "This paper presents a mathematical invention that converts integrated quantiles, commonly found in risk measures, into integrated cumulative distribution functions, making them easier to work with and avoiding the need for a probability density function. The invention has applications in evaluating model uncertainty and misspecification, and deriving statistical inference results."
}