{
    "title": "The Vendi Score: A Diversity Evaluation Metric for Machine Learning. (arXiv:2210.02410v2 [cs.LG] UPDATED)",
    "abstract": "Diversity is an important criterion for many areas of machine learning (ML), including generative modeling and dataset curation. However, existing metrics for measuring diversity are often domain-specific and limited in flexibility. In this paper, we address the diversity evaluation problem by proposing the Vendi Score, which connects and extends ideas from ecology and quantum statistical mechanics to ML. The Vendi Score is defined as the exponential of the Shannon entropy of the eigenvalues of a similarity matrix. This matrix is induced by a user-defined similarity function applied to the sample to be evaluated for diversity. In taking a similarity function as input, the Vendi Score enables its user to specify any desired form of diversity. Importantly, unlike many existing metrics in ML, the Vendi Score does not require a reference dataset or distribution over samples or labels, it is therefore general and applicable to any generative model, decoding algorithm, and dataset from any d",
    "link": "http://arxiv.org/abs/2210.02410",
    "context": "Title: The Vendi Score: A Diversity Evaluation Metric for Machine Learning. (arXiv:2210.02410v2 [cs.LG] UPDATED)\nAbstract: Diversity is an important criterion for many areas of machine learning (ML), including generative modeling and dataset curation. However, existing metrics for measuring diversity are often domain-specific and limited in flexibility. In this paper, we address the diversity evaluation problem by proposing the Vendi Score, which connects and extends ideas from ecology and quantum statistical mechanics to ML. The Vendi Score is defined as the exponential of the Shannon entropy of the eigenvalues of a similarity matrix. This matrix is induced by a user-defined similarity function applied to the sample to be evaluated for diversity. In taking a similarity function as input, the Vendi Score enables its user to specify any desired form of diversity. Importantly, unlike many existing metrics in ML, the Vendi Score does not require a reference dataset or distribution over samples or labels, it is therefore general and applicable to any generative model, decoding algorithm, and dataset from any d",
    "path": "papers/22/10/2210.02410.json",
    "total_tokens": 890,
    "translated_title": "The Vendi分数: 一种用于机器学习的多样性评估指标",
    "translated_abstract": "多样性是机器学习（ML）中许多领域的重要标准，包括生成建模和数据集策划。然而，现有的衡量多样性的指标往往是针对特定领域的，并且灵活性有限。本文通过提出Vendi分数来解决多样性评估问题，该指标将生态学和量子统计力学的思想与ML相结合并进行扩展。Vendi分数定义为相似性矩阵的特征值的香农熵的指数函数。这个矩阵是由用户定义的相似性函数应用于要评估多样性的样本而诱导出的。通过使用相似性函数作为输入，Vendi分数使用户能够指定任何所需的多样性形式。与ML中的许多现有指标不同，Vendi分数不需要参考数据集或样本或标签的分布，因此它通用且适用于任何生成模型、解码算法和来自任何领域的数据集。",
    "tldr": "本文提出了一种用于机器学习的多样性评估指标Vendi分数，它能够灵活地衡量不同形式的多样性，而且不需要参考数据集，适用于任何生成模型和数据集。"
}