{
    "title": "Convolutive Block-Matching Segmentation Algorithm with Application to Music Structure Analysis. (arXiv:2210.15356v2 [cs.SD] UPDATED)",
    "abstract": "Music Structure Analysis (MSA) consists of representing a song in sections (such as ``chorus'', ``verse'', ``solo'' etc), and can be seen as the retrieval of a simplified organization of the song. This work presents a new algorithm, called Convolutive Block-Matching (CBM) algorithm, devoted to MSA. In particular, the CBM algorithm is a dynamic programming algorithm, applying on autosimilarity matrices, a standard tool in MSA. In this work, autosimilarity matrices are computed from the feature representation of an audio signal, and time is sampled on the barscale. We study three different similarity functions for the computation of autosimilarity matrices. We report that the proposed algorithm achieves a level of performance competitive to that of supervised State-of-the-Art methods on 3 among 4 metrics, while being unsupervised.",
    "link": "http://arxiv.org/abs/2210.15356",
    "context": "Title: Convolutive Block-Matching Segmentation Algorithm with Application to Music Structure Analysis. (arXiv:2210.15356v2 [cs.SD] UPDATED)\nAbstract: Music Structure Analysis (MSA) consists of representing a song in sections (such as ``chorus'', ``verse'', ``solo'' etc), and can be seen as the retrieval of a simplified organization of the song. This work presents a new algorithm, called Convolutive Block-Matching (CBM) algorithm, devoted to MSA. In particular, the CBM algorithm is a dynamic programming algorithm, applying on autosimilarity matrices, a standard tool in MSA. In this work, autosimilarity matrices are computed from the feature representation of an audio signal, and time is sampled on the barscale. We study three different similarity functions for the computation of autosimilarity matrices. We report that the proposed algorithm achieves a level of performance competitive to that of supervised State-of-the-Art methods on 3 among 4 metrics, while being unsupervised.",
    "path": "papers/22/10/2210.15356.json",
    "total_tokens": 841,
    "translated_title": "使用卷积块匹配分割算法进行音乐结构分析的应用",
    "translated_abstract": "音乐结构分析（MSA）包括将一首歌曲划分为不同的部分（如“副歌”，“诗歌”，“独奏”等），可以看作是寻找歌曲的简化组织。本文提出了一种新的算法，称为卷积块匹配（CBM）算法，专门用于MSA。具体而言，CBM算法是一种动态规划算法，应用于自相似矩阵，这是MSA中的一种标准工具。在这项工作中，自相似矩阵是从音频信号的特征表示中计算出来的，时间根据小节刻度进行采样。我们研究了三种不同的相似度函数来计算自相似矩阵。我们报告了所提出的算法在4个指标中有3个指标上的性能与有监督的最先进方法相当，同时它是无监督的。",
    "tldr": "本文介绍了一种新的卷积块匹配算法，用于音乐结构分析，通过计算自相似矩阵来达到与有监督方法相当的性能。",
    "en_tdlr": "This paper presents a new Convolutuve Block-Matching algorithm for music structure analysis, achieving performance competitive to supervised methods by computing autosimilarity matrices."
}