{
    "title": "Multi-Objective GFlowNets. (arXiv:2210.12765v2 [cs.LG] UPDATED)",
    "abstract": "We study the problem of generating diverse candidates in the context of Multi-Objective Optimization. In many applications of machine learning such as drug discovery and material design, the goal is to generate candidates which simultaneously optimize a set of potentially conflicting objectives. Moreover, these objectives are often imperfect evaluations of some underlying property of interest, making it important to generate diverse candidates to have multiple options for expensive downstream evaluations. We propose Multi-Objective GFlowNets (MOGFNs), a novel method for generating diverse Pareto optimal solutions, based on GFlowNets. We introduce two variants of MOGFNs: MOGFN-PC, which models a family of independent sub-problems defined by a scalarization function, with reward-conditional GFlowNets, and MOGFN-AL, which solves a sequence of sub-problems defined by an acquisition function in an active learning loop. Our experiments on wide variety of synthetic and benchmark tasks demonst",
    "link": "http://arxiv.org/abs/2210.12765",
    "context": "Title: Multi-Objective GFlowNets. (arXiv:2210.12765v2 [cs.LG] UPDATED)\nAbstract: We study the problem of generating diverse candidates in the context of Multi-Objective Optimization. In many applications of machine learning such as drug discovery and material design, the goal is to generate candidates which simultaneously optimize a set of potentially conflicting objectives. Moreover, these objectives are often imperfect evaluations of some underlying property of interest, making it important to generate diverse candidates to have multiple options for expensive downstream evaluations. We propose Multi-Objective GFlowNets (MOGFNs), a novel method for generating diverse Pareto optimal solutions, based on GFlowNets. We introduce two variants of MOGFNs: MOGFN-PC, which models a family of independent sub-problems defined by a scalarization function, with reward-conditional GFlowNets, and MOGFN-AL, which solves a sequence of sub-problems defined by an acquisition function in an active learning loop. Our experiments on wide variety of synthetic and benchmark tasks demonst",
    "path": "papers/22/10/2210.12765.json",
    "total_tokens": 933,
    "translated_title": "多目标GFlowNets",
    "translated_abstract": "我们研究了在多目标优化的背景下生成多样候选解的问题。在许多机器学习应用中，如药物发现和材料设计，目标是生成同时优化一组潜在冲突目标的候选解。此外，这些目标往往是对某个感兴趣属性的不完善评估，因此生成多样候选解对于进行昂贵的下游评估来说是重要的。我们提出了一种新方法，称为多目标GFlowNets（MOGFNs），用于生成多样的Pareto最优解，基于GFlowNets。我们介绍了两个MOGFNs的变体：MOGFN-PC，它通过特定标量化函数定义了一个独立子问题的系列，并使用奖励条件的GFlowNets进行建模；以及MOGFN-AL，它在主动学习循环中解决了一系列由收购函数定义的子问题。我们在各种合成和基准任务上进行了实验，证明了MOGFNs的有效性。",
    "tldr": "本论文提出了一种名为多目标GFlowNets (MOGFNs) 的方法，用于在多目标优化问题中生成多样的Pareto最优解。该方法基于GFlowNets，并引入了两种变体：MOGFN-PC和MOGFN-AL。实验结果表明，MOGFNs在各种任务中都表现出了很好的效果。",
    "en_tdlr": "This paper proposes a method called Multi-Objective GFlowNets (MOGFNs) for generating diverse Pareto optimal solutions in multi-objective optimization problems. The method is based on GFlowNets and introduces two variants: MOGFN-PC and MOGFN-AL. Experimental results demonstrate the effectiveness of MOGFNs in various tasks."
}