{
    "title": "Improving Medical Predictions by Irregular Multimodal Electronic Health Records Modeling. (arXiv:2210.12156v2 [cs.LG] UPDATED)",
    "abstract": "Health conditions among patients in intensive care units (ICUs) are monitored via electronic health records (EHRs), composed of numerical time series and lengthy clinical note sequences, both taken at irregular time intervals. Dealing with such irregularity in every modality, and integrating irregularity into multimodal representations to improve medical predictions, is a challenging problem. Our method first addresses irregularity in each single modality by (1) modeling irregular time series by dynamically incorporating hand-crafted imputation embeddings into learned interpolation embeddings via a gating mechanism, and (2) casting a series of clinical note representations as multivariate irregular time series and tackling irregularity via a time attention mechanism. We further integrate irregularity in multimodal fusion with an interleaved attention mechanism across temporal steps. To the best of our knowledge, this is the first work to thoroughly model irregularity in multimodalities",
    "link": "http://arxiv.org/abs/2210.12156",
    "context": "Title: Improving Medical Predictions by Irregular Multimodal Electronic Health Records Modeling. (arXiv:2210.12156v2 [cs.LG] UPDATED)\nAbstract: Health conditions among patients in intensive care units (ICUs) are monitored via electronic health records (EHRs), composed of numerical time series and lengthy clinical note sequences, both taken at irregular time intervals. Dealing with such irregularity in every modality, and integrating irregularity into multimodal representations to improve medical predictions, is a challenging problem. Our method first addresses irregularity in each single modality by (1) modeling irregular time series by dynamically incorporating hand-crafted imputation embeddings into learned interpolation embeddings via a gating mechanism, and (2) casting a series of clinical note representations as multivariate irregular time series and tackling irregularity via a time attention mechanism. We further integrate irregularity in multimodal fusion with an interleaved attention mechanism across temporal steps. To the best of our knowledge, this is the first work to thoroughly model irregularity in multimodalities",
    "path": "papers/22/10/2210.12156.json",
    "total_tokens": 902,
    "translated_title": "通过建模不规则多模态电子健康记录，改进医疗预测",
    "translated_abstract": "电子健康记录 (EHRs) 通常包含数字时间序列和长的临床笔记序列，这些数据都是在不规则时间间隔内采集的。如何处理每个模态中的不规则性，并将其整合到多模态表示中以改进医疗预测，是一个具有挑战性的问题。本文提出的方法首先通过以下两种方式处理单个模态中的不规则性：(1)通过门控机制动态地将手工制作的填充嵌入式表征与学习到的插值嵌入式表征相结合来建模不规则时间序列，(2)通过时间注意力机制将一系列临床笔记表征转换成多变量不规则时间序列，并解决不规则性。对于多模态融合中的不规则性，本文提出了一种交替注意力机制，该机制跨越时间步长进行。据我们所知，这是第一篇彻底对多模态不规则性进行建模的工作。",
    "tldr": "本文利用门控机制和时间注意力机制分别建模不规则时间序列和临床笔记表征，进而通过交替注意力机制整合多模态信息，从而改进医疗预测。",
    "en_tdlr": "This paper presents a challenging problem of dealing with irregularity in every modality in electronic health records (EHRs) and introduces a method that models irregular time series and clinical note representations using gating and time attention mechanisms, and integrates multimodal fusion with an interleaved attention mechanism to improve medical predictions."
}