{
    "title": "Query Rewriting for Effective Misinformation Discovery. (arXiv:2210.07467v2 [cs.CL] UPDATED)",
    "abstract": "We propose a novel system to help fact-checkers formulate search queries for known misinformation claims and effectively search across multiple social media platforms. We introduce an adaptable rewriting strategy, where editing actions for queries containing claims (e.g., swap a word with its synonym; change verb tense into present simple) are automatically learned through offline reinforcement learning. Our model uses a decision transformer to learn a sequence of editing actions that maximizes query retrieval metrics such as mean average precision. We conduct a series of experiments showing that our query rewriting system achieves a relative increase in the effectiveness of the queries of up to 42%, while producing editing action sequences that are human interpretable.",
    "link": "http://arxiv.org/abs/2210.07467",
    "context": "Title: Query Rewriting for Effective Misinformation Discovery. (arXiv:2210.07467v2 [cs.CL] UPDATED)\nAbstract: We propose a novel system to help fact-checkers formulate search queries for known misinformation claims and effectively search across multiple social media platforms. We introduce an adaptable rewriting strategy, where editing actions for queries containing claims (e.g., swap a word with its synonym; change verb tense into present simple) are automatically learned through offline reinforcement learning. Our model uses a decision transformer to learn a sequence of editing actions that maximizes query retrieval metrics such as mean average precision. We conduct a series of experiments showing that our query rewriting system achieves a relative increase in the effectiveness of the queries of up to 42%, while producing editing action sequences that are human interpretable.",
    "path": "papers/22/10/2210.07467.json",
    "total_tokens": 723,
    "translated_title": "用于有效发现错误信息的查询重写",
    "translated_abstract": "我们提出了一个新颖的系统，帮助事实核查者制定已知错误信息主张的搜索查询，并在多个社交媒体平台上进行有效搜索。我们引入了一种适应性重写策略，通过离线强化学习自动学习包含主张的查询的编辑操作（例如，用同义词替换一个词；将动词时态改为一般现在时）。我们的模型使用决策转换器学习一系列编辑操作，以最大化查询检索指标，例如平均精确度。我们进行了一系列实验，表明我们的查询重写系统相对于查询的有效性增加了多达42%，同时产生的编辑操作序列是可人工解释的。",
    "tldr": "我们提出了一个新的查询重写系统，通过使用离线强化学习来自动学习编辑操作，以提高已知误传主张的查询效果，实验结果显示我们的系统可使查询有效性增加多达42%。",
    "en_tdlr": "We propose a new query rewriting system that improves the effectiveness of search queries for known misinformation claims by using offline reinforcement learning to automatically learn editing actions. Experimental results show that our system can increase the effectiveness of queries by up to 42%."
}