{
    "title": "Efficient probabilistic reconciliation of forecasts for real-valued and count time series. (arXiv:2210.02286v3 [stat.ML] UPDATED)",
    "abstract": "Hierarchical time series are common in several applied fields. The forecasts for these time series are required to be coherent, that is, to satisfy the constraints given by the hierarchy. The most popular technique to enforce coherence is called reconciliation, which adjusts the base forecasts computed for each time series. However, recent works on probabilistic reconciliation present several limitations. In this paper, we propose a new approach based on conditioning to reconcile any type of forecast distribution. We then introduce a new algorithm, called Bottom-Up Importance Sampling, to efficiently sample from the reconciled distribution. It can be used for any base forecast distribution: discrete, continuous, or in the form of samples, providing a major speedup compared to the current methods. Experiments on several temporal hierarchies show a significant improvement over base probabilistic forecasts.",
    "link": "http://arxiv.org/abs/2210.02286",
    "context": "Title: Efficient probabilistic reconciliation of forecasts for real-valued and count time series. (arXiv:2210.02286v3 [stat.ML] UPDATED)\nAbstract: Hierarchical time series are common in several applied fields. The forecasts for these time series are required to be coherent, that is, to satisfy the constraints given by the hierarchy. The most popular technique to enforce coherence is called reconciliation, which adjusts the base forecasts computed for each time series. However, recent works on probabilistic reconciliation present several limitations. In this paper, we propose a new approach based on conditioning to reconcile any type of forecast distribution. We then introduce a new algorithm, called Bottom-Up Importance Sampling, to efficiently sample from the reconciled distribution. It can be used for any base forecast distribution: discrete, continuous, or in the form of samples, providing a major speedup compared to the current methods. Experiments on several temporal hierarchies show a significant improvement over base probabilistic forecasts.",
    "path": "papers/22/10/2210.02286.json",
    "total_tokens": 875,
    "translated_title": "实数值和计数时间序列的高效概率调和预测",
    "translated_abstract": "层次时间序列在许多应用领域中很常见。这些时间序列的预测需要是一致的，也就是满足层次结构的约束条件。强制一致性的最流行技术被称为调和，它调整了为每个时间序列计算的基本预测。然而，最近关于概率调和的研究存在几个局限性。在本文中，我们提出了一种新的基于条件方法来调和任何类型的预测分布。然后，我们引入了一种名为“自下而上重要性抽样”的新算法，来高效地从调和后的分布中进行抽样。它可以用于任何基本预测分布：离散的、连续的，或者以样本形式提供的，相对于当前方法，它提供了很大的速度提升。在几个时间层次的实验中，显示出与基本概率预测相比的显著改进。",
    "tldr": "本论文提出了一种基于条件方法来调和任何类型的预测分布的新方法，并引入了一种名为“自下而上重要性抽样”的高效抽样算法。这种方法在多个时间层次的实验中显示出与基本概率预测相比的显著改进。"
}