{
    "title": "Data-driven low-dimensional dynamic model of Kolmogorov flow. (arXiv:2210.16708v2 [cs.LG] UPDATED)",
    "abstract": "Reduced order models (ROMs) that capture flow dynamics are of interest for decreasing computational costs for simulation as well as for model-based control approaches. This work presents a data-driven framework for minimal-dimensional models that effectively capture the dynamics and properties of the flow. We apply this to Kolmogorov flow in a regime consisting of chaotic and intermittent behavior, which is common in many flows processes and is challenging to model. The trajectory of the flow travels near relative periodic orbits (RPOs), interspersed with sporadic bursting events corresponding to excursions between the regions containing the RPOs. The first step in development of the models is use of an undercomplete autoencoder to map from the full state data down to a latent space of dramatically lower dimension. Then models of the discrete-time evolution of the dynamics in the latent space are developed. By analyzing the model performance as a function of latent space dimension we c",
    "link": "http://arxiv.org/abs/2210.16708",
    "context": "Title: Data-driven low-dimensional dynamic model of Kolmogorov flow. (arXiv:2210.16708v2 [cs.LG] UPDATED)\nAbstract: Reduced order models (ROMs) that capture flow dynamics are of interest for decreasing computational costs for simulation as well as for model-based control approaches. This work presents a data-driven framework for minimal-dimensional models that effectively capture the dynamics and properties of the flow. We apply this to Kolmogorov flow in a regime consisting of chaotic and intermittent behavior, which is common in many flows processes and is challenging to model. The trajectory of the flow travels near relative periodic orbits (RPOs), interspersed with sporadic bursting events corresponding to excursions between the regions containing the RPOs. The first step in development of the models is use of an undercomplete autoencoder to map from the full state data down to a latent space of dramatically lower dimension. Then models of the discrete-time evolution of the dynamics in the latent space are developed. By analyzing the model performance as a function of latent space dimension we c",
    "path": "papers/22/10/2210.16708.json",
    "total_tokens": 938,
    "translated_title": "数据驱动的Kolmogorov流低维动力学模型",
    "translated_abstract": "减少计算成本以模拟流动动力学、并用于模型控制方法的降维模型是具有吸引力的。本研究提出了一种数据驱动的框架，用于有效捕捉流动的动力学和性质的最小维度模型。我们将其应用于在混沌和间歇行为中的Kolmogorov流，这在许多流程中很常见且难以建模。流动的轨迹接近于相对周期轨道(RPOs)，并夹杂着与包含RPOs的区域之间的偶发爆发事件相对应的远足。模型开发的第一步是使用一个欠完备的自编码器将完整状态数据映射到维度显著较低的潜在空间。然后，我们开发了潜在空间动力学的离散时间演化模型。通过分析模型在潜在空间维度上的性能，我们可以确定最佳的维度选择。",
    "tldr": "该论文提出了一种数据驱动的低维动力学模型方法，用于捕捉Kolmogorov流的流动动力学和属性。通过使用欠完备自编码器进行维度降低和潜在空间的离散时间模型开发，我们可以有效地建模具有挑战性的混沌和间歇行为。"
}