{
    "title": "A Framework for Large Scale Synthetic Graph Dataset Generation. (arXiv:2210.01944v4 [cs.LG] UPDATED)",
    "abstract": "Recently there has been increasing interest in developing and deploying deep graph learning algorithms for many tasks, such as fraud detection and recommender systems. Albeit, there is a limited number of publicly available graph-structured datasets, most of which are tiny compared to production-sized applications or are limited in their application domain. This work tackles this shortcoming by proposing a scalable synthetic graph generation tool to scale the datasets to production-size graphs with trillions of edges and billions of nodes. The tool learns a series of parametric models from proprietary datasets that can be released to researchers to study various graph methods on the synthetic data increasing prototype development and novel applications. We demonstrate the generalizability of the framework across a series of datasets, mimicking structural and feature distributions as well as the ability to scale them across varying sizes demonstrating their usefulness for benchmarking a",
    "link": "http://arxiv.org/abs/2210.01944",
    "context": "Title: A Framework for Large Scale Synthetic Graph Dataset Generation. (arXiv:2210.01944v4 [cs.LG] UPDATED)\nAbstract: Recently there has been increasing interest in developing and deploying deep graph learning algorithms for many tasks, such as fraud detection and recommender systems. Albeit, there is a limited number of publicly available graph-structured datasets, most of which are tiny compared to production-sized applications or are limited in their application domain. This work tackles this shortcoming by proposing a scalable synthetic graph generation tool to scale the datasets to production-size graphs with trillions of edges and billions of nodes. The tool learns a series of parametric models from proprietary datasets that can be released to researchers to study various graph methods on the synthetic data increasing prototype development and novel applications. We demonstrate the generalizability of the framework across a series of datasets, mimicking structural and feature distributions as well as the ability to scale them across varying sizes demonstrating their usefulness for benchmarking a",
    "path": "papers/22/10/2210.01944.json",
    "total_tokens": 942,
    "translated_title": "大规模合成图数据集生成框架",
    "translated_abstract": "最近，人们对于开发和应用深度图学习算法在欺诈检测和推荐系统等任务中表现出了越来越高的兴趣。然而，公开可用的图结构数据集数量有限，大多数相对于实际应用来说都很小，或者在应用领域上有限。本研究通过提出一个可扩展的合成图生成工具来解决这个问题，将数据集扩展到具有万亿条边和数十亿个节点的规模。该工具从专有数据集中学习一系列参数模型，可以释放给研究人员使用，在合成数据上研究各种图方法，推动原型开发和新应用的发展。我们通过一系列数据集的示例展示了该框架的泛化能力，可以模拟结构和特征分布，并且能够扩展到不同规模，从而证明了其在基准测试中的实用性。",
    "tldr": "本论文提出了一个可扩展的合成图生成工具，将图数据集扩展到规模为万亿条边和数十亿个节点的级别。通过从专有数据集学习参数模型，可以为研究人员提供用于研究各种图方法的合成数据，加快原型开发和新应用的进展。该框架在模拟结构和特征分布，并能够在不同规模上扩展表现出了良好的泛化能力。",
    "en_tdlr": "This paper proposes a scalable synthetic graph generation tool that scales graph datasets to trillions of edges and billions of nodes. It learns parametric models from proprietary datasets to provide synthetic data for researchers to study various graph methods, accelerating prototype development and novel applications. The framework demonstrates good generalizability by mimicking structural and feature distributions and scaling across different sizes."
}