{
    "title": "NVIDIA FLARE: Federated Learning from Simulation to Real-World. (arXiv:2210.13291v3 [cs.LG] UPDATED)",
    "abstract": "Federated learning (FL) enables building robust and generalizable AI models by leveraging diverse datasets from multiple collaborators without centralizing the data. We created NVIDIA FLARE as an open-source software development kit (SDK) to make it easier for data scientists to use FL in their research and real-world applications. The SDK includes solutions for state-of-the-art FL algorithms and federated machine learning approaches, which facilitate building workflows for distributed learning across enterprises and enable platform developers to create a secure, privacy-preserving offering for multiparty collaboration utilizing homomorphic encryption or differential privacy. The SDK is a lightweight, flexible, and scalable Python package. It allows researchers to apply their data science workflows in any training libraries (PyTorch, TensorFlow, XGBoost, or even NumPy) in real-world FL settings. This paper introduces the key design principles of NVFlare and illustrates some use cases (",
    "link": "http://arxiv.org/abs/2210.13291",
    "context": "Title: NVIDIA FLARE: Federated Learning from Simulation to Real-World. (arXiv:2210.13291v3 [cs.LG] UPDATED)\nAbstract: Federated learning (FL) enables building robust and generalizable AI models by leveraging diverse datasets from multiple collaborators without centralizing the data. We created NVIDIA FLARE as an open-source software development kit (SDK) to make it easier for data scientists to use FL in their research and real-world applications. The SDK includes solutions for state-of-the-art FL algorithms and federated machine learning approaches, which facilitate building workflows for distributed learning across enterprises and enable platform developers to create a secure, privacy-preserving offering for multiparty collaboration utilizing homomorphic encryption or differential privacy. The SDK is a lightweight, flexible, and scalable Python package. It allows researchers to apply their data science workflows in any training libraries (PyTorch, TensorFlow, XGBoost, or even NumPy) in real-world FL settings. This paper introduces the key design principles of NVFlare and illustrates some use cases (",
    "path": "papers/22/10/2210.13291.json",
    "total_tokens": 934,
    "translated_title": "NVIDIA FLARE: 从模拟到实际世界的联合学习",
    "translated_abstract": "联合学习（FL）通过利用来自多个合作者的多样数据集而不集中数据，实现构建强健和具有普适性的人工智能模型。我们创建了NVIDIA FLARE，作为开源软件开发工具包（SDK），使数据科学家可以更轻松地在其研究和实际应用中使用FL。该SDK包括最先进的FL算法和联合机器学习方法的解决方案，有助于在企业中构建分布式学习工作流，并使平台开发人员能够使用同态加密或差分隐私创建安全的、保护隐私的多方合作产品。该SDK是一个轻量级的、灵活的、可扩展的Python包。它允许研究人员在任何培训库（PyTorch、TensorFlow、XGBoost，甚至NumPy）中应用其数据科学工作流，在真实的FL环境中进行学习。",
    "tldr": "NVIDIA FLARE是一个开源软件开发工具包（SDK），使数据科学家能够更轻松地在其研究和实际应用中使用FL，包括最先进的FL算法和联合机器学习方法。该SDK可用于构建分布式学习工作流并使用同态加密或差分隐私创建安全且保护隐私的多方合作产品。"
}