{
    "title": "Language Model Decoding as Likelihood-Utility Alignment. (arXiv:2210.07228v2 [cs.CL] UPDATED)",
    "abstract": "A critical component of a successful language generation pipeline is the decoding algorithm. However, the general principles that should guide the choice of a decoding algorithm remain unclear. Previous works only compare decoding algorithms in narrow scenarios, and their findings do not generalize across tasks. We argue that the misalignment between the model's likelihood and the task-specific notion of utility is the key factor to understanding the effectiveness of decoding algorithms. To structure the discussion, we introduce a taxonomy of misalignment mitigation strategies (MMSs), providing a unifying view of decoding as a tool for alignment. The MMS taxonomy groups decoding algorithms based on their implicit assumptions about likelihood--utility misalignment, yielding general statements about their applicability across tasks. Specifically, by analyzing the correlation between the likelihood and the utility of predictions across a diverse set of tasks, we provide empirical evidence",
    "link": "http://arxiv.org/abs/2210.07228",
    "context": "Title: Language Model Decoding as Likelihood-Utility Alignment. (arXiv:2210.07228v2 [cs.CL] UPDATED)\nAbstract: A critical component of a successful language generation pipeline is the decoding algorithm. However, the general principles that should guide the choice of a decoding algorithm remain unclear. Previous works only compare decoding algorithms in narrow scenarios, and their findings do not generalize across tasks. We argue that the misalignment between the model's likelihood and the task-specific notion of utility is the key factor to understanding the effectiveness of decoding algorithms. To structure the discussion, we introduce a taxonomy of misalignment mitigation strategies (MMSs), providing a unifying view of decoding as a tool for alignment. The MMS taxonomy groups decoding algorithms based on their implicit assumptions about likelihood--utility misalignment, yielding general statements about their applicability across tasks. Specifically, by analyzing the correlation between the likelihood and the utility of predictions across a diverse set of tasks, we provide empirical evidence",
    "path": "papers/22/10/2210.07228.json",
    "total_tokens": 830,
    "translated_title": "语言模型解码作为似然度-效用对齐",
    "translated_abstract": "成功的语言生成流程中的关键组件是解码算法。然而，应该指导选择解码算法的一般原则仍不清楚。以前的研究仅在狭窄的情况下比较解码算法，他们的发现不能推广到跨任务。我们认为模型的似然和任务特定效用的不匹配是理解解码算法有效性的关键因素。为了结构化讨论，我们引入一种不匹配缓解策略（MMS）的分类法，提供解码作为对齐工具的统一视角。这个MMS分类法根据解码算法对似然度-效用不匹配的隐含假设对其进行分组，产生关于它们跨任务适用性的一般性声明。具体而言，通过分析跨多个任务的预测的似然度和效用之间的相关性，我们提供了实证证据",
    "tldr": "解码算法的选择需要考虑模型似然度和任务效用的匹配度问题，通过分类不匹配缓解策略（MMS）的视角，可以提高解码算法的通用性",
    "en_tdlr": "The choice of decoding algorithm needs to consider the degree of match between the model's likelihood and the task-specific notion of utility. By introducing a taxonomy of misalignment mitigation strategies (MMSs), we can improve the generality of decoding algorithms."
}