{
    "title": "Experimental Design for Multi-Channel Imaging via Task-Driven Feature Selection",
    "abstract": "arXiv:2210.06891v3 Announce Type: replace-cross  Abstract: This paper presents a data-driven, task-specific paradigm for experimental design, to shorten acquisition time, reduce costs, and accelerate the deployment of imaging devices. Current approaches in experimental design focus on model-parameter estimation and require specification of a particular model, whereas in imaging, other tasks may drive the design. Furthermore, such approaches often lead to intractable optimization problems in real-world imaging applications. Here we present a new paradigm for experimental design that simultaneously optimizes the design (set of image channels) and trains a machine-learning model to execute a user-specified image-analysis task. The approach obtains data densely-sampled over the measurement space (many image channels) for a small number of acquisitions, then identifies a subset of channels of prespecified size that best supports the task. We propose a method: TADRED for TAsk-DRiven Experime",
    "link": "https://arxiv.org/abs/2210.06891",
    "context": "Title: Experimental Design for Multi-Channel Imaging via Task-Driven Feature Selection\nAbstract: arXiv:2210.06891v3 Announce Type: replace-cross  Abstract: This paper presents a data-driven, task-specific paradigm for experimental design, to shorten acquisition time, reduce costs, and accelerate the deployment of imaging devices. Current approaches in experimental design focus on model-parameter estimation and require specification of a particular model, whereas in imaging, other tasks may drive the design. Furthermore, such approaches often lead to intractable optimization problems in real-world imaging applications. Here we present a new paradigm for experimental design that simultaneously optimizes the design (set of image channels) and trains a machine-learning model to execute a user-specified image-analysis task. The approach obtains data densely-sampled over the measurement space (many image channels) for a small number of acquisitions, then identifies a subset of channels of prespecified size that best supports the task. We propose a method: TADRED for TAsk-DRiven Experime",
    "path": "papers/22/10/2210.06891.json",
    "total_tokens": 788,
    "translated_title": "基于任务驱动特征选择的多通道成像实验设计",
    "translated_abstract": "本文提出了一种数据驱动的、任务特定的实验设计范式，旨在缩短采集时间、降低成本、加速成像设备的部署。当前实验设计方法主要集中在模型参数估计上，并要求对特定模型进行规范，而在成像领域，其他任务可能驱动设计。此外，这种方法常常在真实世界的成像应用中导致难以求解的优化问题。本文提出了一种新的实验设计范式，同时优化设计（图像通道集）并训练一个机器学习模型来执行用户指定的图像分析任务。该方法在测量空间上密集采样数据（许多图像通道）进行了少量采集，然后识别一个预先指定尺寸的最佳支持任务的通道子集。",
    "tldr": "提出了一种基于任务驱动特征选择的多通道成像实验设计方法，通过优化设计和训练机器学习模型执行用户指定的图像分析任务。",
    "en_tdlr": "Proposed a method of experimental design for multi-channel imaging via task-driven feature selection, optimizing design and training machine-learning model for user-specified image-analysis task."
}