{
    "title": "Homotopy-based training of NeuralODEs for accurate dynamics discovery. (arXiv:2210.01407v5 [cs.LG] UPDATED)",
    "abstract": "Neural Ordinary Differential Equations (NeuralODEs) present an attractive way to extract dynamical laws from time series data, as they bridge neural networks with the differential equation-based modeling paradigm of the physical sciences. However, these models often display long training times and suboptimal results, especially for longer duration data. While a common strategy in the literature imposes strong constraints to the NeuralODE architecture to inherently promote stable model dynamics, such methods are ill-suited for dynamics discovery as the unknown governing equation is not guaranteed to satisfy the assumed constraints. In this paper, we develop a new training method for NeuralODEs, based on synchronization and homotopy optimization, that does not require changes to the model architecture. We show that synchronizing the model dynamics and the training data tames the originally irregular loss landscape, which homotopy optimization can then leverage to enhance training. Throug",
    "link": "http://arxiv.org/abs/2210.01407",
    "context": "Title: Homotopy-based training of NeuralODEs for accurate dynamics discovery. (arXiv:2210.01407v5 [cs.LG] UPDATED)\nAbstract: Neural Ordinary Differential Equations (NeuralODEs) present an attractive way to extract dynamical laws from time series data, as they bridge neural networks with the differential equation-based modeling paradigm of the physical sciences. However, these models often display long training times and suboptimal results, especially for longer duration data. While a common strategy in the literature imposes strong constraints to the NeuralODE architecture to inherently promote stable model dynamics, such methods are ill-suited for dynamics discovery as the unknown governing equation is not guaranteed to satisfy the assumed constraints. In this paper, we develop a new training method for NeuralODEs, based on synchronization and homotopy optimization, that does not require changes to the model architecture. We show that synchronizing the model dynamics and the training data tames the originally irregular loss landscape, which homotopy optimization can then leverage to enhance training. Throug",
    "path": "papers/22/10/2210.01407.json",
    "total_tokens": 797,
    "translated_title": "基于同步和同伦优化的神经常微分方程训练方法用于精确动力学发现",
    "translated_abstract": "神经常微分方程（NeuralODEs）作为神经网络和物理科学基于微分方程的建模范式之间的桥梁，是从时间序列数据中提取动力学规律的一种有吸引力的方式。然而，这些模型通常表现出长时间的训练和次优的结果，特别是对于更长时间段的数据。本文提出了一种基于同步和同伦优化的神经常微分方程训练方法，不需要对模型架构进行改变。我们展示了将模型动力学和训练数据同步可以驯服原本不规则的损失和的景象，同伦优化可以利用这一点来增强训练。",
    "tldr": "本论文提出了一种新的神经常微分方程训练方法，基于同步和同伦优化，可以用于从时间序列数据中提取动力学规律，而无需对模型架构进行修改。"
}