{
    "title": "Hypergraph Artificial Benchmark for Community Detection (h-ABCD). (arXiv:2210.15009v3 [cs.SI] UPDATED)",
    "abstract": "The Artificial Benchmark for Community Detection (ABCD) graph is a recently introduced random graph model with community structure and power-law distribution for both degrees and community sizes. The model generates graphs with similar properties as the well-known LFR one, and its main parameter can be tuned to mimic its counterpart in the LFR model, the mixing parameter. In this paper, we introduce hypergraph counterpart of the ABCD model, h-ABCD, which produces random hypergraph with distributions of ground-truth community sizes and degrees following power-law. As in the original ABCD, the new model h-ABCD can produce hypergraphs with various levels of noise. More importantly, the model is flexible and can mimic any desired level of homogeneity of hyperedges that fall into one community. As a result, it can be used as a suitable, synthetic playground for analyzing and tuning hypergraph community detection algorithms.",
    "link": "http://arxiv.org/abs/2210.15009",
    "context": "Title: Hypergraph Artificial Benchmark for Community Detection (h-ABCD). (arXiv:2210.15009v3 [cs.SI] UPDATED)\nAbstract: The Artificial Benchmark for Community Detection (ABCD) graph is a recently introduced random graph model with community structure and power-law distribution for both degrees and community sizes. The model generates graphs with similar properties as the well-known LFR one, and its main parameter can be tuned to mimic its counterpart in the LFR model, the mixing parameter. In this paper, we introduce hypergraph counterpart of the ABCD model, h-ABCD, which produces random hypergraph with distributions of ground-truth community sizes and degrees following power-law. As in the original ABCD, the new model h-ABCD can produce hypergraphs with various levels of noise. More importantly, the model is flexible and can mimic any desired level of homogeneity of hyperedges that fall into one community. As a result, it can be used as a suitable, synthetic playground for analyzing and tuning hypergraph community detection algorithms.",
    "path": "papers/22/10/2210.15009.json",
    "total_tokens": 879,
    "translated_title": "基于超图的社区检测人工基准 (h-ABCD)",
    "translated_abstract": "人工基准社区检测(ABCD)图是一种最近引入的带有社区结构和度和社区大小的幂律分布的随机图模型。该模型生成与众所周知的LFR模型具有类似特性的图形，其主要参数可以调节以模仿LFR模型中的混合参数。在本文中，我们介绍ABCD模型的超图对应物h-ABCD，它生成符合幂律分布的基础真实社区大小和度数的随机超图。与原始ABCD一样，新模型h-ABCD可以产生各种噪声水平的超图。更重要的是，该模型具有灵活性，并且可以模仿超边落入一个社区的任何所需均匀性水平。因此，它可以用作适当的合成“游乐场”，以分析和调整超图社区检测算法。",
    "tldr": "本研究提出了基于超图的人工基准社区检测模型h-ABCD，并且可以灵活地模拟不同社区的均匀性水平，是分析和调整超图社区检测算法的合成平台。",
    "en_tdlr": "The paper introduces the hypergraph artificial benchmark model h-ABCD, which can be used as a suitable synthetic platform for analyzing and tuning hypergraph community detection algorithms, by generating random hypergraphs with power-law distribution for both ground-truth community sizes and degrees, and flexible mimicry of desired levels of homogeneity among hyperedges falling into one community."
}