{
    "title": "Bayesian Model Selection of Lithium-Ion Battery Models via Bayesian Quadrature. (arXiv:2210.17299v4 [stat.ME] UPDATED)",
    "abstract": "A wide variety of battery models are available, and it is not always obvious which model `best' describes a dataset. This paper presents a Bayesian model selection approach using Bayesian quadrature. The model evidence is adopted as the selection metric, choosing the simplest model that describes the data, in the spirit of Occam's razor. However, estimating this requires integral computations over parameter space, which is usually prohibitively expensive. Bayesian quadrature offers sample-efficient integration via model-based inference that minimises the number of battery model evaluations. The posterior distribution of model parameters can also be inferred as a byproduct without further computation. Here, the simplest lithium-ion battery models, equivalent circuit models, were used to analyse the sensitivity of the selection criterion to given different datasets and model configurations. We show that popular model selection criteria, such as root-mean-square error and Bayesian informa",
    "link": "http://arxiv.org/abs/2210.17299",
    "context": "Title: Bayesian Model Selection of Lithium-Ion Battery Models via Bayesian Quadrature. (arXiv:2210.17299v4 [stat.ME] UPDATED)\nAbstract: A wide variety of battery models are available, and it is not always obvious which model `best' describes a dataset. This paper presents a Bayesian model selection approach using Bayesian quadrature. The model evidence is adopted as the selection metric, choosing the simplest model that describes the data, in the spirit of Occam's razor. However, estimating this requires integral computations over parameter space, which is usually prohibitively expensive. Bayesian quadrature offers sample-efficient integration via model-based inference that minimises the number of battery model evaluations. The posterior distribution of model parameters can also be inferred as a byproduct without further computation. Here, the simplest lithium-ion battery models, equivalent circuit models, were used to analyse the sensitivity of the selection criterion to given different datasets and model configurations. We show that popular model selection criteria, such as root-mean-square error and Bayesian informa",
    "path": "papers/22/10/2210.17299.json",
    "total_tokens": 908,
    "translated_title": "基于贝叶斯四元数的锂离子电池模型的贝叶斯模型选择",
    "translated_abstract": "存在大量电池模型，不总是明显哪个模型最好地描述了数据集。本文提出了一种使用贝叶斯四元数的贝叶斯模型选择方法。采用模型证据作为选择标准，选择最简单的描述数据的模型，符合奥卡姆剃刀精神。但是，估计这个需要参数空间上的积分计算，这通常是无法承受的。贝叶斯四元数通过基于模型的推理提供了样本有效的积分，从而最大程度地减少了电池模型评估的数量。还可以作为副产品推断出模型参数的后验分布，无需进一步计算。本文使用最简单的锂离子电池模型，等效电路模型，分析了给定不同数据集和模型配置的选择标准的灵敏度。结果表明，流行的模型选择标准，例如均方根误差和贝叶斯信息",
    "tldr": "本文介绍了一种使用贝叶斯四元数的贝叶斯模型选择方法来分析锂离子电池模型，以选择最简单的模型来描述数据集。使用样本有效的积分技术减少了电池模型评估的数量，并推断出模型参数的后验分布。",
    "en_tdlr": "This paper presents a Bayesian model selection approach using Bayesian quadrature to analyze lithium-ion battery models, selecting the simplest model to describe the dataset. Sample-efficient integration techniques reduce the number of battery model evaluations and infer the posterior distribution of model parameters."
}