{
    "title": "Differential Privacy has Bounded Impact on Fairness in Classification. (arXiv:2210.16242v3 [cs.LG] UPDATED)",
    "abstract": "We theoretically study the impact of differential privacy on fairness in classification. We prove that, given a class of models, popular group fairness measures are pointwise Lipschitz-continuous with respect to the parameters of the model. This result is a consequence of a more general statement on accuracy conditioned on an arbitrary event (such as membership to a sensitive group), which may be of independent interest. We use this Lipschitz property to prove a non-asymptotic bound showing that, as the number of samples increases, the fairness level of private models gets closer to the one of their non-private counterparts. This bound also highlights the importance of the confidence margin of a model on the disparate impact of differential privacy.",
    "link": "http://arxiv.org/abs/2210.16242",
    "context": "Title: Differential Privacy has Bounded Impact on Fairness in Classification. (arXiv:2210.16242v3 [cs.LG] UPDATED)\nAbstract: We theoretically study the impact of differential privacy on fairness in classification. We prove that, given a class of models, popular group fairness measures are pointwise Lipschitz-continuous with respect to the parameters of the model. This result is a consequence of a more general statement on accuracy conditioned on an arbitrary event (such as membership to a sensitive group), which may be of independent interest. We use this Lipschitz property to prove a non-asymptotic bound showing that, as the number of samples increases, the fairness level of private models gets closer to the one of their non-private counterparts. This bound also highlights the importance of the confidence margin of a model on the disparate impact of differential privacy.",
    "path": "papers/22/10/2210.16242.json",
    "total_tokens": 900,
    "translated_title": "差分隐私对分类公平性的影响有限",
    "translated_abstract": "我们在理论上研究了差分隐私对分类公平性的影响。我们证明，在给定模型类的情况下，流行的群体公平度量是关于模型参数点值利普希茨连续的。这个结果是一个更一般的关于在任意事件条件下（比如属于敏感群体）准确性的声明的结果，可能有独立的兴趣。我们利用这个利普希茨性质证明了一个非渐近界限，它表明随着样本数量的增加，私有模型的公平度越来越接近于非私有模型的公平度。这个界限还突显了模型的置信边界对差分隐私的不对等影响的重要性。",
    "tldr": "本文理论上研究了差分隐私对分类公平性的影响。证明了在给定模型类的情况下，流行的群体公平度量是关于模型参数点值利普希茨连续的。非渐近界限表明，随着样本数量的增加，私有模型的公平度越来越接近于非私有模型的公平度，也突显了模型的置信边界对差分隐私的不对等影响的重要性。",
    "en_tdlr": "This paper theoretically studies the impact of differential privacy on fairness in classification. It proves that, given a class of models, popular group fairness measures are pointwise Lipschitz-continuous with respect to the parameters of the model. The non-asymptotic bound shows that, as the number of samples increases, the fairness level of private models gets closer to the one of their non-private counterparts, highlighting the importance of the confidence margin of a model on the disparate impact of differential privacy."
}