{
    "title": "Axioms for Automated Market Makers: A Mathematical Framework in FinTech and Decentralized Finance. (arXiv:2210.01227v2 [q-fin.MF] UPDATED)",
    "abstract": "Within this work we consider an axiomatic framework for Automated Market Makers (AMMs). By imposing reasonable axioms on the underlying utility function, we are able to characterize the properties of the swap size of the assets and of the resulting pricing oracle. In providing these general AMM axioms, we define a novel measure of price impacts that can be used to quantify those costs between different constructions. We have analyzed many existing AMMs and shown that the vast majority of them satisfy our axioms. We have also considered the question of fees and divergence loss. In doing so, we have proposed a new fee structure so as to make the AMM indifferent to transaction splitting. Finally, we have proposed a novel AMM that has nice analytical properties and provides a large range over which there is no divergence loss.",
    "link": "http://arxiv.org/abs/2210.01227",
    "context": "Title: Axioms for Automated Market Makers: A Mathematical Framework in FinTech and Decentralized Finance. (arXiv:2210.01227v2 [q-fin.MF] UPDATED)\nAbstract: Within this work we consider an axiomatic framework for Automated Market Makers (AMMs). By imposing reasonable axioms on the underlying utility function, we are able to characterize the properties of the swap size of the assets and of the resulting pricing oracle. In providing these general AMM axioms, we define a novel measure of price impacts that can be used to quantify those costs between different constructions. We have analyzed many existing AMMs and shown that the vast majority of them satisfy our axioms. We have also considered the question of fees and divergence loss. In doing so, we have proposed a new fee structure so as to make the AMM indifferent to transaction splitting. Finally, we have proposed a novel AMM that has nice analytical properties and provides a large range over which there is no divergence loss.",
    "path": "papers/22/10/2210.01227.json",
    "total_tokens": 972,
    "translated_title": "自动市场制造商的公理：金融科技和去中心化金融领域的数学框架",
    "translated_abstract": "在这项工作中，我们考虑了自动市场制造商（AMMs）的公理框架。通过对底层效用函数施加合理的公理，我们能够描述资产互换的规模和结果定价预测的特性。通过提供这些通用的AMM公理，我们定义了一种新的价格影响度量方法，可以用来量化不同构造之间的成本。我们分析了许多现有的AMMs，并证明了其中大多数满足我们的公理。我们还考虑了费用和发散损失的问题。在此过程中，我们提出了一种新的费用结构，使得AMM对交易拆分不敏感。最后，我们提出了一种具有良好分析特性并提供较大范围内无发散损失的新型AMM。",
    "tldr": "本文提出了一个自动市场制造商（AMMs）的公理框架，通过对底层效用函数施加合理的公理，描述了资产互换规模和结果定价预测的特性，并定义了一种新的价格影响度量方法。分析表明，大多数现有的AMMs满足这些公理。此外，还提出了一种新的费用结构，使得AMM对交易拆分不敏感，并提出了一种具有良好分析特性并提供较大范围内无发散损失的新型AMM。"
}