{
    "title": "Machine Generated Text: A Comprehensive Survey of Threat Models and Detection Methods. (arXiv:2210.07321v4 [cs.CL] UPDATED)",
    "abstract": "Machine generated text is increasingly difficult to distinguish from human authored text. Powerful open-source models are freely available, and user-friendly tools that democratize access to generative models are proliferating. ChatGPT, which was released shortly after the first edition of this survey, epitomizes these trends. The great potential of state-of-the-art natural language generation (NLG) systems is tempered by the multitude of avenues for abuse. Detection of machine generated text is a key countermeasure for reducing abuse of NLG models, with significant technical challenges and numerous open problems. We provide a survey that includes both 1) an extensive analysis of threat models posed by contemporary NLG systems, and 2) the most complete review of machine generated text detection methods to date. This survey places machine generated text within its cybersecurity and social context, and provides strong guidance for future work addressing the most critical threat models, a",
    "link": "http://arxiv.org/abs/2210.07321",
    "context": "Title: Machine Generated Text: A Comprehensive Survey of Threat Models and Detection Methods. (arXiv:2210.07321v4 [cs.CL] UPDATED)\nAbstract: Machine generated text is increasingly difficult to distinguish from human authored text. Powerful open-source models are freely available, and user-friendly tools that democratize access to generative models are proliferating. ChatGPT, which was released shortly after the first edition of this survey, epitomizes these trends. The great potential of state-of-the-art natural language generation (NLG) systems is tempered by the multitude of avenues for abuse. Detection of machine generated text is a key countermeasure for reducing abuse of NLG models, with significant technical challenges and numerous open problems. We provide a survey that includes both 1) an extensive analysis of threat models posed by contemporary NLG systems, and 2) the most complete review of machine generated text detection methods to date. This survey places machine generated text within its cybersecurity and social context, and provides strong guidance for future work addressing the most critical threat models, a",
    "path": "papers/22/10/2210.07321.json",
    "total_tokens": 930,
    "translated_title": "机器生成文本：威胁模型和检测方法的综合调查",
    "translated_abstract": "机器生成的文本越来越难以与人类撰写的文本区分开来。功能强大的开源模型可以免费使用，可民主化访问生成模型的用户友好工具正在迅速增多。本次调查的第一版面世后不久，发布了ChatGPT，这一趋势被彰显出来。最先进的自然语言生成（NLG）系统的巨大潜力被各种滥用途径所抑制。检测机器生成文本是减少NLG模型滥用的主要对策，但也面临着重大技术挑战和众多未解决问题。我们提供了一份综合调查，包括1）对当代NLG系统造成威胁模型的广泛分析和2）截至目前为止关于机器生成文本检测方法的最完整的综述。这份调查将机器生成文本置于其网络安全和社会背景之中，并为未来解决最重要威胁模型提供了强有力的指导，并概述了最有前途的检测方法。",
    "tldr": "本文主要调查了机器生成文本对社会和网络安全所带来的威胁，提供了最完整的机器生成文本检测方法评估，为应对威胁模型和解决检测问题提供了强有力的指导。",
    "en_tdlr": "This paper provides a comprehensive survey of the threats posed by machine generated text to society and cybersecurity, offering a complete review of detection methods and offering guidance for addressing threat models and detecting machine generated text."
}