{
    "title": "Graphemic Normalization of the Perso-Arabic Script. (arXiv:2210.12273v3 [cs.CL] UPDATED)",
    "abstract": "Since its original appearance in 1991, the Perso-Arabic script representation in Unicode has grown from 169 to over 440 atomic isolated characters spread over several code pages representing standard letters, various diacritics and punctuation for the original Arabic and numerous other regional orthographic traditions. This paper documents the challenges that Perso-Arabic presents beyond the best-documented languages, such as Arabic and Persian, building on earlier work by the expert community. We particularly focus on the situation in natural language processing (NLP), which is affected by multiple, often neglected, issues such as the use of visually ambiguous yet canonically nonequivalent letters and the mixing of letters from different orthographies. Among the contributing conflating factors are the lack of input methods, the instability of modern orthographies, insufficient literacy, and loss or lack of orthographic tradition. We evaluate the effects of script normalization on eigh",
    "link": "http://arxiv.org/abs/2210.12273",
    "context": "Title: Graphemic Normalization of the Perso-Arabic Script. (arXiv:2210.12273v3 [cs.CL] UPDATED)\nAbstract: Since its original appearance in 1991, the Perso-Arabic script representation in Unicode has grown from 169 to over 440 atomic isolated characters spread over several code pages representing standard letters, various diacritics and punctuation for the original Arabic and numerous other regional orthographic traditions. This paper documents the challenges that Perso-Arabic presents beyond the best-documented languages, such as Arabic and Persian, building on earlier work by the expert community. We particularly focus on the situation in natural language processing (NLP), which is affected by multiple, often neglected, issues such as the use of visually ambiguous yet canonically nonequivalent letters and the mixing of letters from different orthographies. Among the contributing conflating factors are the lack of input methods, the instability of modern orthographies, insufficient literacy, and loss or lack of orthographic tradition. We evaluate the effects of script normalization on eigh",
    "path": "papers/22/10/2210.12273.json",
    "total_tokens": 948,
    "translated_title": "波斯-阿拉伯文字的字形规范化",
    "translated_abstract": "自1991年首次出现以来，Unicode中的波斯-阿拉伯文字表示已经从169个扩展到了超过440个原子孤立字符，分布在多个代码页中，代表了原始阿拉伯语和许多其他地区正字法传统的标准字母、各种变音符号和标点符号。本文记录了波斯-阿拉伯文字在自然语言处理（NLP）中的挑战，这些挑战超出了阿拉伯语和波斯语等最受研究的语言。我们尤其关注NLP中的情况，该问题受到多个常常被忽视的问题的影响，如使用外观上模糊但规范上不等价的字母以及混合使用来自不同正字法的字母。造成这种混淆的因素包括缺乏输入方法、现代正字法的不稳定性、识字能力不足以及正字传统的丢失或缺乏。我们评估了字形规范化对八个方面的影响。",
    "tldr": "本文记录了波斯-阿拉伯文字在自然语言处理中的挑战，包括使用外观上相似但规范上不等价的字母以及混合使用来自不同正字法的字母。对于这些挑战，本文提供了字形规范化的解决方案，并评估了其对不同方面的影响。",
    "en_tdlr": "This paper documents the challenges of the Perso-Arabic script in natural language processing, such as visually ambiguous yet canonically nonequivalent letters and mixing letters from different orthographies. It provides a solution of script normalization and evaluates its effects on different aspects."
}