{
    "title": "Efficient Learning of Mesh-Based Physical Simulation with BSMS-GNN. (arXiv:2210.02573v3 [cs.LG] UPDATED)",
    "abstract": "Learning the physical simulation on large-scale meshes with flat Graph Neural Networks (GNNs) and stacking Message Passings (MPs) is challenging due to the scaling complexity w.r.t. the number of nodes and over-smoothing. There has been growing interest in the community to introduce \\textit{multi-scale} structures to GNNs for physical simulation. However, current state-of-the-art methods are limited by their reliance on the labor-intensive drawing of coarser meshes or building coarser levels based on spatial proximity, which can introduce wrong edges across geometry boundaries. Inspired by the bipartite graph determination, we propose a novel pooling strategy, \\textit{bi-stride} to tackle the aforementioned limitations. Bi-stride pools nodes on every other frontier of the breadth-first search (BFS), without the need for the manual drawing of coarser meshes and avoiding the wrong edges by spatial proximity. Additionally, it enables a one-MP scheme per level and non-parametrized pooling ",
    "link": "http://arxiv.org/abs/2210.02573",
    "context": "Title: Efficient Learning of Mesh-Based Physical Simulation with BSMS-GNN. (arXiv:2210.02573v3 [cs.LG] UPDATED)\nAbstract: Learning the physical simulation on large-scale meshes with flat Graph Neural Networks (GNNs) and stacking Message Passings (MPs) is challenging due to the scaling complexity w.r.t. the number of nodes and over-smoothing. There has been growing interest in the community to introduce \\textit{multi-scale} structures to GNNs for physical simulation. However, current state-of-the-art methods are limited by their reliance on the labor-intensive drawing of coarser meshes or building coarser levels based on spatial proximity, which can introduce wrong edges across geometry boundaries. Inspired by the bipartite graph determination, we propose a novel pooling strategy, \\textit{bi-stride} to tackle the aforementioned limitations. Bi-stride pools nodes on every other frontier of the breadth-first search (BFS), without the need for the manual drawing of coarser meshes and avoiding the wrong edges by spatial proximity. Additionally, it enables a one-MP scheme per level and non-parametrized pooling ",
    "path": "papers/22/10/2210.02573.json",
    "total_tokens": 936,
    "translated_title": "用BSMS-GNN高效学习基于网格的物理仿真",
    "translated_abstract": "基于平面图神经网络（GNNs）和堆叠的消息传递（MPs）学习大规模网格上的物理仿真具有与节点数量相关的缩放复杂度和过度平滑的挑战。引入“多尺度”结构到GNNs以进行物理仿真引起了社区的越来越多的兴趣。然而，当前最先进的方法受到依赖于繁琐的绘制粗网格或基于空间邻近性构建粗略级别的限制，这可能在几何边界处引入错误的边缘。受到二部图决策的启发，我们提出了一种新的汇集策略——双步跨（bi-stride），以解决上述限制。当进行广度优先搜索（BFS）时，双步跨在每个其他前沿的节点上进行池化，而无需手动绘制较粗的网格，并通过空间邻近性避免错误的边缘。此外，它还实现了每层的单一MP方案和无参数的池化。",
    "tldr": "该论文提出了一种名为bi-stride的新型池化策略，利用二部图决策实现高效的基于网格的物理仿真，无需手动绘制粗网格，并避免了空间接近性带来的错误边缘。",
    "en_tdlr": "This paper proposes a new pooling strategy called bi-stride, which achieves efficient mesh-based physical simulation using bipartite graph determination without the need for manual drawing of coarser meshes and avoiding wrong edges caused by spatial proximity."
}