{
    "title": "Multi-Object Navigation with dynamically learned neural implicit representations. (arXiv:2210.05129v2 [cs.CV] UPDATED)",
    "abstract": "Understanding and mapping a new environment are core abilities of any autonomously navigating agent. While classical robotics usually estimates maps in a stand-alone manner with SLAM variants, which maintain a topological or metric representation, end-to-end learning of navigation keeps some form of memory in a neural network. Networks are typically imbued with inductive biases, which can range from vectorial representations to birds-eye metric tensors or topological structures. In this work, we propose to structure neural networks with two neural implicit representations, which are learned dynamically during each episode and map the content of the scene: (i) the Semantic Finder predicts the position of a previously seen queried object; (ii) the Occupancy and Exploration Implicit Representation encapsulates information about explored area and obstacles, and is queried with a novel global read mechanism which directly maps from function space to a usable embedding space. Both representa",
    "link": "http://arxiv.org/abs/2210.05129",
    "context": "Title: Multi-Object Navigation with dynamically learned neural implicit representations. (arXiv:2210.05129v2 [cs.CV] UPDATED)\nAbstract: Understanding and mapping a new environment are core abilities of any autonomously navigating agent. While classical robotics usually estimates maps in a stand-alone manner with SLAM variants, which maintain a topological or metric representation, end-to-end learning of navigation keeps some form of memory in a neural network. Networks are typically imbued with inductive biases, which can range from vectorial representations to birds-eye metric tensors or topological structures. In this work, we propose to structure neural networks with two neural implicit representations, which are learned dynamically during each episode and map the content of the scene: (i) the Semantic Finder predicts the position of a previously seen queried object; (ii) the Occupancy and Exploration Implicit Representation encapsulates information about explored area and obstacles, and is queried with a novel global read mechanism which directly maps from function space to a usable embedding space. Both representa",
    "path": "papers/22/10/2210.05129.json",
    "total_tokens": 845,
    "translated_title": "动态学习的神经隐性表示的多目标导航",
    "translated_abstract": "理解和映射新环境是任何自主导航代理的核心能力。传统的机器人学通常使用SLAM变体以独立的方式估计地图，这些变体维护了拓扑或度量表示，而端到端学习的导航则在神经网络中保持了某种形式的记忆。网络通常具有归纳偏差，可以从矢量表示到鸟瞰度量张量或拓扑结构。在这项工作中，我们提出使用两个神经隐性表示来构造神经网络，在每个episode期间动态学习并映射场景内容：(i) 语义定位器预测先前看到的查询对象的位置；(ii) 占用和探索隐性表示封装了已探索区域和障碍物的信息，并通过新颖的全局读取机制进行查询，该机制直接从函数空间映射到可用的嵌入空间。",
    "tldr": "本研究提出了一种结构化神经网络的方法，利用动态学习的神经隐性表示对多目标导航进行建模和映射，其中包括语义定位和占用探索隐性表示。",
    "en_tdlr": "This paper proposes a structured neural network approach for modeling and mapping multi-object navigation using dynamically learned neural implicit representations, including semantic localization and occupancy exploration implicit representations."
}