{
    "title": "Artificial intelligence in government: Concepts, standards, and a unified framework. (arXiv:2210.17218v2 [cs.CY] UPDATED)",
    "abstract": "Recent advances in artificial intelligence (AI), especially in generative language modelling, hold the promise of transforming government. Given the advanced capabilities of new AI systems, it is critical that these are embedded using standard operational procedures, clear epistemic criteria, and behave in alignment with the normative expectations of society. Scholars in multiple domains have subsequently begun to conceptualize the different forms that AI applications may take, highlighting both their potential benefits and pitfalls. However, the literature remains fragmented, with researchers in social science disciplines like public administration and political science, and the fast-moving fields of AI, ML, and robotics, all developing concepts in relative isolation. Although there are calls to formalize the emerging study of AI in government, a balanced account that captures the full depth of theoretical perspectives needed to understand the consequences of embedding AI into a publi",
    "link": "http://arxiv.org/abs/2210.17218",
    "context": "Title: Artificial intelligence in government: Concepts, standards, and a unified framework. (arXiv:2210.17218v2 [cs.CY] UPDATED)\nAbstract: Recent advances in artificial intelligence (AI), especially in generative language modelling, hold the promise of transforming government. Given the advanced capabilities of new AI systems, it is critical that these are embedded using standard operational procedures, clear epistemic criteria, and behave in alignment with the normative expectations of society. Scholars in multiple domains have subsequently begun to conceptualize the different forms that AI applications may take, highlighting both their potential benefits and pitfalls. However, the literature remains fragmented, with researchers in social science disciplines like public administration and political science, and the fast-moving fields of AI, ML, and robotics, all developing concepts in relative isolation. Although there are calls to formalize the emerging study of AI in government, a balanced account that captures the full depth of theoretical perspectives needed to understand the consequences of embedding AI into a publi",
    "path": "papers/22/10/2210.17218.json",
    "total_tokens": 865,
    "translated_title": "政府中的人工智能：概念，标准和统一框架",
    "translated_abstract": "最近人工智能特别是生成式语言模型的进展使政府改变的希望变得能够实现。鉴于新型人工智能系统的先进能力，至关重要的是使用标准操作程序将其嵌入，并符合社会的规范期望。多个领域的学者开始概念化人工智能应用的不同形式，强调其潜在的好处和风险。然而，文献仍然碎片化，社会科学领域的研究者如公共管理和政治科学，以及快速发展的人工智能，机器学习和机器人技术领域都在相对孤立的情况下发展概念。虽然有呼吁对政府中的人工智能进行形式化研究，但对于理解将人工智能嵌入公共领域的后果所需的理论观点的全面综合描述仍然缺乏。",
    "tldr": "本论文研究了人工智能在政府中的应用，强调了标准化操作程序和符合社会规范期望的重要性，并指出了多学科研究者在概念上的碎片化问题。"
}