{
    "title": "Exploring Segmentation Approaches for Neural Machine Translation of Code-Switched Egyptian Arabic-English Text. (arXiv:2210.06990v3 [cs.CL] UPDATED)",
    "abstract": "Data sparsity is one of the main challenges posed by code-switching (CS), which is further exacerbated in the case of morphologically rich languages. For the task of machine translation (MT), morphological segmentation has proven successful in alleviating data sparsity in monolingual contexts; however, it has not been investigated for CS settings. In this paper, we study the effectiveness of different segmentation approaches on MT performance, covering morphology-based and frequency-based segmentation techniques. We experiment on MT from code-switched Arabic-English to English. We provide detailed analysis, examining a variety of conditions, such as data size and sentences with different degrees of CS. Empirical results show that morphology-aware segmenters perform the best in segmentation tasks but under-perform in MT. Nevertheless, we find that the choice of the segmentation setup to use for MT is highly dependent on the data size. For extreme low-resource scenarios, a combination of",
    "link": "http://arxiv.org/abs/2210.06990",
    "context": "Title: Exploring Segmentation Approaches for Neural Machine Translation of Code-Switched Egyptian Arabic-English Text. (arXiv:2210.06990v3 [cs.CL] UPDATED)\nAbstract: Data sparsity is one of the main challenges posed by code-switching (CS), which is further exacerbated in the case of morphologically rich languages. For the task of machine translation (MT), morphological segmentation has proven successful in alleviating data sparsity in monolingual contexts; however, it has not been investigated for CS settings. In this paper, we study the effectiveness of different segmentation approaches on MT performance, covering morphology-based and frequency-based segmentation techniques. We experiment on MT from code-switched Arabic-English to English. We provide detailed analysis, examining a variety of conditions, such as data size and sentences with different degrees of CS. Empirical results show that morphology-aware segmenters perform the best in segmentation tasks but under-perform in MT. Nevertheless, we find that the choice of the segmentation setup to use for MT is highly dependent on the data size. For extreme low-resource scenarios, a combination of",
    "path": "papers/22/10/2210.06990.json",
    "total_tokens": 964,
    "translated_title": "探索分割方法对Egyptian Arabic-English代码转换神经机器翻译的影响",
    "translated_abstract": "数据稀疏性是代码转换（CS）中的主要挑战之一，尤其是对于形态丰富的语言。对于机器翻译（MT）任务，在单语境中，形态学分割已经被证明可以缓解数据稀疏性，但是它尚未被用于CS环境中。本文研究不同分割方法对MT性能的影响，包括基于形态和基于频率的分割技术。我们在从代码转换的阿拉伯语-英语到英语的MT上进行实验，并进行详细分析，考虑了各种条件，例如数据大小和具有不同程度CS的句子。实证结果表明，形态学感知分段器在分段任务中表现最佳，但在MT任务中表现欠佳。然而，我们发现选择用于MT的分割设置高度依赖于数据大小。对于极低资源情形，形态学感知分段器和频率分割结合使用可以获得最佳结果。",
    "tldr": "本文研究了不同分割方法对Egyptian Arabic-English代码转换神经机器翻译的影响，实验结果表明形态学感知分段器在分段任务上表现最佳，但在MT任务中表现欠佳。但对于极低资源情形，形态学感知分段器和频率分割结合使用可以获得最佳结果。",
    "en_tdlr": "This paper explores the impact of different segmentation approaches on neural machine translation of code-switched Egyptian Arabic-English text. Morphology-aware segmenters perform the best in segmentation tasks but under-perform in machine translation. However, a combination of morphology-aware segmentation and frequency-based segmentation can achieve the best results in extremely low-resource scenarios."
}