{
    "title": "Mars: Modeling Context & State Representations with Contrastive Learning for End-to-End Task-Oriented Dialog. (arXiv:2210.08917v2 [cs.CL] UPDATED)",
    "abstract": "Traditional end-to-end task-oriented dialog systems first convert dialog context into belief state and action state before generating the system response. The system response performance is significantly affected by the quality of the belief state and action state. We first explore what dialog context representation is beneficial to improving the quality of the belief state and action state, which further enhances the generated response quality. To tackle our exploration, we propose Mars, an end-to-end task-oriented dialog system with two contrastive learning strategies to model the relationship between dialog context and belief/action state representations. Empirical results show dialog context representations, which are more different from semantic state representations, are more conducive to multi-turn task-oriented dialog. Moreover, our proposed Mars achieves state-of-the-art performance on the MultiWOZ 2.0, CamRest676, and CrossWOZ.",
    "link": "http://arxiv.org/abs/2210.08917",
    "context": "Title: Mars: Modeling Context & State Representations with Contrastive Learning for End-to-End Task-Oriented Dialog. (arXiv:2210.08917v2 [cs.CL] UPDATED)\nAbstract: Traditional end-to-end task-oriented dialog systems first convert dialog context into belief state and action state before generating the system response. The system response performance is significantly affected by the quality of the belief state and action state. We first explore what dialog context representation is beneficial to improving the quality of the belief state and action state, which further enhances the generated response quality. To tackle our exploration, we propose Mars, an end-to-end task-oriented dialog system with two contrastive learning strategies to model the relationship between dialog context and belief/action state representations. Empirical results show dialog context representations, which are more different from semantic state representations, are more conducive to multi-turn task-oriented dialog. Moreover, our proposed Mars achieves state-of-the-art performance on the MultiWOZ 2.0, CamRest676, and CrossWOZ.",
    "path": "papers/22/10/2210.08917.json",
    "total_tokens": 877,
    "translated_title": "Mars: 使用对比学习建模上下文和状态表示的端到端任务导向对话系统",
    "translated_abstract": "传统的端到端任务导向对话系统将对话上下文转换为信念状态和动作状态，然后生成系统响应。系统响应的性能显著受到信念状态和动作状态质量的影响。本文首先探索了对话上下文表示对提高信念状态和动作状态质量的益处，从而进一步增强生成的响应质量。为了解决这个问题，我们提出了Mars，一种端到端任务导向对话系统，利用两种对比学习策略来建模对话上下文和信念/动作状态表示之间的关系。实证结果表明，与语义状态表示更不同的对话上下文表示对多轮任务导向对话更有益。此外，我们提出的Mars在MultiWOZ 2.0、CamRest676和CrossWOZ上达到了最先进的性能。",
    "tldr": "本文提出了Mars，一种使用对比学习建模上下文和状态表示的端到端任务导向对话系统。研究结果表明，与语义状态表示不同的对话上下文表示对于多轮任务导向对话更为有益，且Mars在常用评测数据集上取得了最先进的性能。",
    "en_tdlr": "This paper proposes Mars, an end-to-end task-oriented dialog system that models context and state representations using contrastive learning. The results show that dialog context representations that are different from semantic state representations are more beneficial for multi-turn task-oriented dialog, and Mars achieves state-of-the-art performance on popular evaluation datasets."
}