{
    "title": "Explanations as Programs in Probabilistic Logic Programming. (arXiv:2210.03021v2 [cs.AI] UPDATED)",
    "abstract": "The generation of comprehensible explanations is an essential feature of modern artificial intelligence systems. In this work, we consider probabilistic logic programming, an extension of logic programming which can be useful to model domains with relational structure and uncertainty. Essentially, a program specifies a probability distribution over possible worlds (i.e., sets of facts). The notion of explanation is typically associated with that of a world, so that one often looks for the most probable world as well as for the worlds where the query is true. Unfortunately, such explanations exhibit no causal structure. In particular, the chain of inferences required for a specific prediction (represented by a query) is not shown. In this paper, we propose a novel approach where explanations are represented as programs that are generated from a given query by a number of unfolding-like transformations. Here, the chain of inferences that proves a given query is made explicit. Furthermore",
    "link": "http://arxiv.org/abs/2210.03021",
    "context": "Title: Explanations as Programs in Probabilistic Logic Programming. (arXiv:2210.03021v2 [cs.AI] UPDATED)\nAbstract: The generation of comprehensible explanations is an essential feature of modern artificial intelligence systems. In this work, we consider probabilistic logic programming, an extension of logic programming which can be useful to model domains with relational structure and uncertainty. Essentially, a program specifies a probability distribution over possible worlds (i.e., sets of facts). The notion of explanation is typically associated with that of a world, so that one often looks for the most probable world as well as for the worlds where the query is true. Unfortunately, such explanations exhibit no causal structure. In particular, the chain of inferences required for a specific prediction (represented by a query) is not shown. In this paper, we propose a novel approach where explanations are represented as programs that are generated from a given query by a number of unfolding-like transformations. Here, the chain of inferences that proves a given query is made explicit. Furthermore",
    "path": "papers/22/10/2210.03021.json",
    "total_tokens": 686,
    "translated_title": "概率逻辑编程中作为程序的解释",
    "translated_abstract": "可以生成易理解的解释是现代人工智能系统的一项重要功能。在本研究中，我们考虑了概率逻辑编程，这是一种扩展了逻辑编程的方法，可以用于建模具有关系结构和不确定性的领域。本文提出了一种新的方法，将解释表示为从给定查询生成的程序，通过多次展开类变换来生成程序。这样，证明给定查询的推理链被显式地展示出来。",
    "tldr": "本文提出了一种新的方法，将解释表示为从给定查询生成的程序，通过多次展开类变换来生成程序，从而显式展示出证明给定查询的推理链。"
}