{
    "title": "Convergence of Dirichlet Forms for MCMC Optimal Scaling with Dependent Target Distributions on Large Graphs. (arXiv:2210.17042v2 [math.ST] UPDATED)",
    "abstract": "Markov chain Monte Carlo (MCMC) algorithms have played a significant role in statistics, physics, machine learning and others, and they are the only known general and efficient approach for some high-dimensional problems. The random walk Metropolis (RWM) algorithm as the most classical MCMC algorithm, has had a great influence on the development and practice of science and engineering. The behavior of the RWM algorithm in high-dimensional problems is typically investigated through a weak convergence result of diffusion processes. In this paper, we utilize the Mosco convergence of Dirichlet forms in analyzing the RWM algorithm on large graphs, whose target distribution is the Gibbs measure that includes any probability measure satisfying a Markov property. The abstract and powerful theory of Dirichlet forms allows us to work directly and naturally on the infinite-dimensional space, and our notion of Mosco convergence allows Dirichlet forms associated with the RWM chains to lie on changi",
    "link": "http://arxiv.org/abs/2210.17042",
    "context": "Title: Convergence of Dirichlet Forms for MCMC Optimal Scaling with Dependent Target Distributions on Large Graphs. (arXiv:2210.17042v2 [math.ST] UPDATED)\nAbstract: Markov chain Monte Carlo (MCMC) algorithms have played a significant role in statistics, physics, machine learning and others, and they are the only known general and efficient approach for some high-dimensional problems. The random walk Metropolis (RWM) algorithm as the most classical MCMC algorithm, has had a great influence on the development and practice of science and engineering. The behavior of the RWM algorithm in high-dimensional problems is typically investigated through a weak convergence result of diffusion processes. In this paper, we utilize the Mosco convergence of Dirichlet forms in analyzing the RWM algorithm on large graphs, whose target distribution is the Gibbs measure that includes any probability measure satisfying a Markov property. The abstract and powerful theory of Dirichlet forms allows us to work directly and naturally on the infinite-dimensional space, and our notion of Mosco convergence allows Dirichlet forms associated with the RWM chains to lie on changi",
    "path": "papers/22/10/2210.17042.json",
    "total_tokens": 1096,
    "translated_title": "依赖于大图的MCMC最优比例缩放的Dirichlet形式的收敛性",
    "translated_abstract": "Markov Chain Monte Carlo (MCMC)算法在统计学、物理学、机器学习等方面发挥了重要作用，并且对于一些高维问题，它们是唯一已知的通用和有效的方法。本文利用Dirichlet形式的Mosco收敛性分析了在大图上的随机游走Metropolis（RWM）算法，其目标分布是包括任何满足Markov性质的概率测度的Gibbs测度。Dirichlet形式的抽象且强大的理论使我们能够直接和自然地在无限维空间上工作，我们的Mosco收敛性概念允许与RWM链相关联的Dirichlet形式位于变化的图序列上，其中图的大小可以是无界的，图可以是相关的。我们证明了在强空间依赖性存在的情况下，RWM算法的最优比例缩放具有收敛性。我们的结果将已知的几个结果推广到了大图上的依赖目标分布的情况，并为大图上的MCMC算法开辟了许多新的可能性。",
    "tldr": "本文利用Dirichlet形式的Mosco收敛性分析了在大图上的随机游走Metropolis（RWM）算法，证明了RWM算法的最优比例缩放具有收敛性，将已知的几个结果推广到了大图上的依赖目标分布的情况，并为大图上的MCMC算法开辟了许多新的可能性。",
    "en_tdlr": "This paper analyzes the random walk Metropolis (RWM) algorithm on large graphs using the Mosco convergence of Dirichlet forms and proves the convergence of the optimal scaling of the RWM algorithm with a Metropolis acceptance probability in the presence of strong spatial dependence. Their results generalize known results to the context of dependent target distributions on large graphs and open up new possibilities for MCMC algorithms on large graphs."
}