{
    "title": "Compressed Sensing MRI Reconstruction Regularized by VAEs with Structured Image Covariance. (arXiv:2210.14586v2 [eess.IV] UPDATED)",
    "abstract": "Objective: This paper investigates how generative models, trained on ground-truth images, can be used \\changes{as} priors for inverse problems, penalizing reconstructions far from images the generator can produce. The aim is that learned regularization will provide complex data-driven priors to inverse problems while still retaining the control and insight of a variational regularization method. Moreover, unsupervised learning, without paired training data, allows the learned regularizer to remain flexible to changes in the forward problem such as noise level, sampling pattern or coil sensitivities in MRI.  Approach: We utilize variational autoencoders (VAEs) that generate not only an image but also a covariance uncertainty matrix for each image. The covariance can model changing uncertainty dependencies caused by structure in the image, such as edges or objects, and provides a new distance metric from the manifold of learned images.  Main results: We evaluate these novel generative re",
    "link": "http://arxiv.org/abs/2210.14586",
    "context": "Title: Compressed Sensing MRI Reconstruction Regularized by VAEs with Structured Image Covariance. (arXiv:2210.14586v2 [eess.IV] UPDATED)\nAbstract: Objective: This paper investigates how generative models, trained on ground-truth images, can be used \\changes{as} priors for inverse problems, penalizing reconstructions far from images the generator can produce. The aim is that learned regularization will provide complex data-driven priors to inverse problems while still retaining the control and insight of a variational regularization method. Moreover, unsupervised learning, without paired training data, allows the learned regularizer to remain flexible to changes in the forward problem such as noise level, sampling pattern or coil sensitivities in MRI.  Approach: We utilize variational autoencoders (VAEs) that generate not only an image but also a covariance uncertainty matrix for each image. The covariance can model changing uncertainty dependencies caused by structure in the image, such as edges or objects, and provides a new distance metric from the manifold of learned images.  Main results: We evaluate these novel generative re",
    "path": "papers/22/10/2210.14586.json",
    "total_tokens": 1059,
    "translated_title": "带有结构图像协方差的VAE正则化的压缩感知MRI重建",
    "translated_abstract": "本文研究了如何利用基于真实图像训练的生成模型作为反问题的先验知识，惩罚与生成器无法产生的图像之间的重建差异，旨在实现学习的正则化先验适应于复杂反问题，同时仍保留变分正则方法的控制和洞察力。我们利用变分自编码器（VAE）生成不仅包含图像信息，还包含每个图像的协方差信息。协方差可以建模图像中的结构变化引起的不确定性依赖关系，并提供了从学习图像流形中产生新距离度量的方法。我们将这种方法应用于MRI重建任务，对采样稀疏和有噪声的k空间数据进行了评估。实验结果表明，该方法实现了最先进的重建性能，同时提供了可解释的协方差矩阵，改善了重建质量并突出了解剖结构。此外，我们学习的协方差矩阵可以用于生成数据增强的真实感扰动。",
    "tldr": "该论文提出了一种利用生成模型作为反问题先验知识、利用变分自编码器生成包括协方差信息在内的图像并提供新距离度量的方法来解决采样稀疏和有噪声的MRI重建问题，实现了最先进的重建性能并突出了解剖结构。",
    "en_tdlr": "This paper proposes using generative models as prior knowledge for inverse problems, achieving state-of-the-art MRI reconstruction performance with undersampled and noisy k-space data. The approach utilizes VAEs to generate structured image covariances and a new distance metric, providing interpretable covariances that improve reconstruction quality and highlight anatomical structures."
}