{
    "title": "SDA: Simple Discrete Augmentation for Contrastive Sentence Representation Learning",
    "abstract": "arXiv:2210.03963v2 Announce Type: replace  Abstract: Contrastive learning has recently achieved compelling performance in unsupervised sentence representation. As an essential element, data augmentation protocols, however, have not been well explored. The pioneering work SimCSE resorting to a simple dropout mechanism (viewed as continuous augmentation) surprisingly dominates discrete augmentations such as cropping, word deletion, and synonym replacement as reported. To understand the underlying rationales, we revisit existing approaches and attempt to hypothesize the desiderata of reasonable data augmentation methods: balance of semantic consistency and expression diversity. We then develop three simple yet effective discrete sentence augmentation schemes: punctuation insertion, modal verbs, and double negation. They act as minimal noises at lexical level to produce diverse forms of sentences. Furthermore, standard negation is capitalized on to generate negative samples for alleviating",
    "link": "https://arxiv.org/abs/2210.03963",
    "context": "Title: SDA: Simple Discrete Augmentation for Contrastive Sentence Representation Learning\nAbstract: arXiv:2210.03963v2 Announce Type: replace  Abstract: Contrastive learning has recently achieved compelling performance in unsupervised sentence representation. As an essential element, data augmentation protocols, however, have not been well explored. The pioneering work SimCSE resorting to a simple dropout mechanism (viewed as continuous augmentation) surprisingly dominates discrete augmentations such as cropping, word deletion, and synonym replacement as reported. To understand the underlying rationales, we revisit existing approaches and attempt to hypothesize the desiderata of reasonable data augmentation methods: balance of semantic consistency and expression diversity. We then develop three simple yet effective discrete sentence augmentation schemes: punctuation insertion, modal verbs, and double negation. They act as minimal noises at lexical level to produce diverse forms of sentences. Furthermore, standard negation is capitalized on to generate negative samples for alleviating",
    "path": "papers/22/10/2210.03963.json",
    "total_tokens": 658,
    "translated_title": "SDA：用于对比句子表示学习的简单离散增强",
    "translated_abstract": "对比学习最近在无监督句子表示中取得了令人满意的性能。然而，作为一个基本要素，数据增强协议尚未得到充分探讨。本文通过重新审视现有方法，并尝试假设合理数据增强方法的期望，提出了三种简单而有效的离散句子增强方案：标点插入、情态动词和双重否定。",
    "tldr": "提出了三种简单而有效的离散句子增强方案：标点插入、情态动词和双重否定，用于对比句子表示学习。",
    "en_tdlr": "Introduced three simple yet effective discrete sentence augmentation schemes – punctuation insertion, modal verbs, and double negation – for contrastive sentence representation learning."
}