{
    "title": "Convergence of the Backward Deep BSDE Method with Applications to Optimal Stopping Problems. (arXiv:2210.04118v3 [math.PR] UPDATED)",
    "abstract": "The optimal stopping problem is one of the core problems in financial markets, with broad applications such as pricing American and Bermudan options. The deep BSDE method [Han, Jentzen and E, PNAS, 115(34):8505-8510, 2018] has shown great power in solving high-dimensional forward-backward stochastic differential equations (FBSDEs), and inspired many applications. However, the method solves backward stochastic differential equations (BSDEs) in a forward manner, which can not be used for optimal stopping problems that in general require running BSDE backwardly. To overcome this difficulty, a recent paper [Wang, Chen, Sudjianto, Liu and Shen, arXiv:1807.06622, 2018] proposed the backward deep BSDE method to solve the optimal stopping problem. In this paper, we provide the rigorous theory for the backward deep BSDE method. Specifically, 1. We derive the a posteriori error estimation, i.e., the error of the numerical solution can be bounded by the training loss function; and; 2. We give an ",
    "link": "http://arxiv.org/abs/2210.04118",
    "context": "Title: Convergence of the Backward Deep BSDE Method with Applications to Optimal Stopping Problems. (arXiv:2210.04118v3 [math.PR] UPDATED)\nAbstract: The optimal stopping problem is one of the core problems in financial markets, with broad applications such as pricing American and Bermudan options. The deep BSDE method [Han, Jentzen and E, PNAS, 115(34):8505-8510, 2018] has shown great power in solving high-dimensional forward-backward stochastic differential equations (FBSDEs), and inspired many applications. However, the method solves backward stochastic differential equations (BSDEs) in a forward manner, which can not be used for optimal stopping problems that in general require running BSDE backwardly. To overcome this difficulty, a recent paper [Wang, Chen, Sudjianto, Liu and Shen, arXiv:1807.06622, 2018] proposed the backward deep BSDE method to solve the optimal stopping problem. In this paper, we provide the rigorous theory for the backward deep BSDE method. Specifically, 1. We derive the a posteriori error estimation, i.e., the error of the numerical solution can be bounded by the training loss function; and; 2. We give an ",
    "path": "papers/22/10/2210.04118.json",
    "total_tokens": 855,
    "translated_title": "倒向深度BSDE方法的收敛性及其在最优停止问题中的应用",
    "translated_abstract": "最优停止问题是金融市场中的核心问题之一，具有广泛的应用，如定价美式和百慕达期权。深度BSDE方法在解决高维前后向随机微分方程（FBSDEs）方面展现出了强大的能力，并且激发了许多应用。然而，该方法以正向方式解决倒向随机微分方程（BSDEs），不能用于通常需要向后运行BSDE的最优停止问题。为了克服这一困难，一篇最近的论文提出了倒向深度BSDE方法来解决最优停止问题。在本文中，我们提供了倒向深度BSDE方法的严格理论。具体来说，我们推导了后验误差估计，即通过训练损失函数可以限制数值解的误差；并且我们提供了一-",
    "tldr": "本文提出了倒向深度BSDE方法用于解决最优停止问题，并给出了相应的理论分析和误差估计方法。",
    "en_tdlr": "This paper proposes the backward deep BSDE method for solving optimal stopping problems and provides theoretical analysis and error estimation methods."
}