{
    "title": "GLS under Monotone Heteroskedasticity. (arXiv:2210.13843v2 [econ.EM] UPDATED)",
    "abstract": "The generalized least square (GLS) is one of the most basic tools in regression analyses. A major issue in implementing the GLS is estimation of the conditional variance function of the error term, which typically requires a restrictive functional form assumption for parametric estimation or smoothing parameters for nonparametric estimation. In this paper, we propose an alternative approach to estimate the conditional variance function under nonparametric monotonicity constraints by utilizing the isotonic regression method. Our GLS estimator is shown to be asymptotically equivalent to the infeasible GLS estimator with knowledge of the conditional error variance, and involves only some tuning to trim boundary observations, not only for point estimation but also for interval estimation or hypothesis testing. Our analysis extends the scope of the isotonic regression method by showing that the isotonic estimates, possibly with generated variables, can be employed as first stage estimates t",
    "link": "http://arxiv.org/abs/2210.13843",
    "context": "Title: GLS under Monotone Heteroskedasticity. (arXiv:2210.13843v2 [econ.EM] UPDATED)\nAbstract: The generalized least square (GLS) is one of the most basic tools in regression analyses. A major issue in implementing the GLS is estimation of the conditional variance function of the error term, which typically requires a restrictive functional form assumption for parametric estimation or smoothing parameters for nonparametric estimation. In this paper, we propose an alternative approach to estimate the conditional variance function under nonparametric monotonicity constraints by utilizing the isotonic regression method. Our GLS estimator is shown to be asymptotically equivalent to the infeasible GLS estimator with knowledge of the conditional error variance, and involves only some tuning to trim boundary observations, not only for point estimation but also for interval estimation or hypothesis testing. Our analysis extends the scope of the isotonic regression method by showing that the isotonic estimates, possibly with generated variables, can be employed as first stage estimates t",
    "path": "papers/22/10/2210.13843.json",
    "total_tokens": 867,
    "translated_title": "基于单调异方差的GLS方法",
    "translated_abstract": "广义最小二乘法 (GLS) 是回归分析中最基本的工具之一。实施GLS的一个主要问题是估计误差项的条件方差函数，这通常需要对参数估计进行限制性的函数形式假设，或者对非参数估计进行平滑参数。在本文中，我们提出了一种利用保序回归方法估计条件方差函数的替代方法。我们的GLS估计量在非参数单调性约束下被证明渐近等效于具有条件误差方差知识的不可行GLS估计量，并且只涉及调整边界观测值的一些调整，不仅适用于点估计，而且适用于区间估计或假设检验。我们的分析通过显示保序估计可以用作第一阶段估计扩展了保序回归方法的范围，可能还包括生成变量。",
    "tldr": "本文提出了一种基于保序回归方法的GLS估计量，可以在非参数单调异方差条件下对条件方差函数进行估计，并提供了一种不仅适用于点估计，而且适用于区间估计或假设检验的方法。"
}