{
    "title": "TILDE-Q: A Transformation Invariant Loss Function for Time-Series Forecasting",
    "abstract": "arXiv:2210.15050v2 Announce Type: replace  Abstract: Time-series forecasting has gained increasing attention in the field of artificial intelligence due to its potential to address real-world problems across various domains, including energy, weather, traffic, and economy. While time-series forecasting is a well-researched field, predicting complex temporal patterns such as sudden changes in sequential data still poses a challenge with current models. This difficulty stems from minimizing Lp norm distances as loss functions, such as mean absolute error (MAE) or mean square error (MSE), which are susceptible to both intricate temporal dynamics modeling and signal shape capturing. Furthermore, these functions often cause models to behave aberrantly and generate uncorrelated results with the original time-series. Consequently, developing a shape-aware loss function that goes beyond mere point-wise comparison is essential. In this paper, we examine the definition of shape and distortions, ",
    "link": "https://arxiv.org/abs/2210.15050",
    "context": "Title: TILDE-Q: A Transformation Invariant Loss Function for Time-Series Forecasting\nAbstract: arXiv:2210.15050v2 Announce Type: replace  Abstract: Time-series forecasting has gained increasing attention in the field of artificial intelligence due to its potential to address real-world problems across various domains, including energy, weather, traffic, and economy. While time-series forecasting is a well-researched field, predicting complex temporal patterns such as sudden changes in sequential data still poses a challenge with current models. This difficulty stems from minimizing Lp norm distances as loss functions, such as mean absolute error (MAE) or mean square error (MSE), which are susceptible to both intricate temporal dynamics modeling and signal shape capturing. Furthermore, these functions often cause models to behave aberrantly and generate uncorrelated results with the original time-series. Consequently, developing a shape-aware loss function that goes beyond mere point-wise comparison is essential. In this paper, we examine the definition of shape and distortions, ",
    "path": "papers/22/10/2210.15050.json",
    "total_tokens": 873,
    "translated_title": "TILDE-Q：一种用于时间序列预测的变换不变损失函数",
    "translated_abstract": "时间序列预测在人工智能领域越来越受到关注，因为它有潜力解决能源、天气、交通和经济等各领域的实际问题。然而，尽管时间序列预测是一个经过深入研究的领域，但对于预测复杂的时间模式，如顺序数据中的突变，目前的模型仍然面临挑战。这种困难源于将Lp范数距离最小化作为损失函数，例如平均绝对误差（MAE）或均方误差（MSE），这些函数容易受到复杂时间动态建模和信号形状捕获的影响。此外，这些函数通常会导致模型行为异常，生成与原始时间序列不相关的结果。因此，开发一种超越点对点比较的形状感知损失函数至关重要。在本文中，我们研究了形状和失真的定义，",
    "tldr": "本文提出了一种对时间序列预测中复杂时间模式进行建模的变换不变损失函数TILDE-Q，解决了当前模型在捕获信号形状和模拟细微时间动态上的挑战。",
    "en_tdlr": "This paper introduces a transformation invariant loss function TILDE-Q for modeling complex temporal patterns in time-series forecasting, addressing the challenge current models face in capturing signal shapes and simulating intricate temporal dynamics."
}