{
    "title": "CRISP: Curriculum based Sequential Neural Decoders for Polar Code Family. (arXiv:2210.00313v3 [cs.IT] UPDATED)",
    "abstract": "Polar codes are widely used state-of-the-art codes for reliable communication that have recently been included in the 5th generation wireless standards (5G). However, there remains room for the design of polar decoders that are both efficient and reliable in the short blocklength regime. Motivated by recent successes of data-driven channel decoders, we introduce a novel $\\textbf{C}$ur$\\textbf{RI}$culum based $\\textbf{S}$equential neural decoder for $\\textbf{P}$olar codes (CRISP). We design a principled curriculum, guided by information-theoretic insights, to train CRISP and show that it outperforms the successive-cancellation (SC) decoder and attains near-optimal reliability performance on the Polar(32,16) and Polar(64,22) codes. The choice of the proposed curriculum is critical in achieving the accuracy gains of CRISP, as we show by comparing against other curricula. More notably, CRISP can be readily extended to Polarization-Adjusted-Convolutional (PAC) codes, where existing SC decod",
    "link": "http://arxiv.org/abs/2210.00313",
    "context": "Title: CRISP: Curriculum based Sequential Neural Decoders for Polar Code Family. (arXiv:2210.00313v3 [cs.IT] UPDATED)\nAbstract: Polar codes are widely used state-of-the-art codes for reliable communication that have recently been included in the 5th generation wireless standards (5G). However, there remains room for the design of polar decoders that are both efficient and reliable in the short blocklength regime. Motivated by recent successes of data-driven channel decoders, we introduce a novel $\\textbf{C}$ur$\\textbf{RI}$culum based $\\textbf{S}$equential neural decoder for $\\textbf{P}$olar codes (CRISP). We design a principled curriculum, guided by information-theoretic insights, to train CRISP and show that it outperforms the successive-cancellation (SC) decoder and attains near-optimal reliability performance on the Polar(32,16) and Polar(64,22) codes. The choice of the proposed curriculum is critical in achieving the accuracy gains of CRISP, as we show by comparing against other curricula. More notably, CRISP can be readily extended to Polarization-Adjusted-Convolutional (PAC) codes, where existing SC decod",
    "path": "papers/22/10/2210.00313.json",
    "total_tokens": 995,
    "translated_title": "基于课程的序列神经解码器用于极化编码族的研究",
    "translated_abstract": "极化编码是可靠通信的最新规范（5G）中广泛使用的最先进的编码，但在短块长度范围内设计既高效又可靠的极化译码器仍有空间。受数据驱动信道译码成功的启发，我们引入了一种新颖的基于课程的序列神经解码器，用于极化编码（CRISP）。我们设计了一种受信息理论启发的有原则的课程来训练CRISP，并表明它在Polar（32,16）和Polar（64,22）代码上优于连续取消(SC)译码器并达到接近最优的 可靠性能。所提议的课程选择对于实现CRISP的准确性增益至关重要，正如我们通过与其他课程的比较所示。值得注意的是，CRISP可以轻松地扩展到极化调整卷积（PAC）代码，其中现有SC解码器性能损失很大。",
    "tldr": "该研究提出了一种新颖的基于课程的序列神经解码器CRISP，可以用于极化编码族，相比连续取消(SC)译码器，CRISP具有更高的准确性和可靠性，并可轻松地拓展至极化调整卷积（PAC）代码。",
    "en_tdlr": "This study proposes a novel curriculum-based sequential neural decoder, CRISP, for polar codes which outperforms the traditional successive-cancellation decoder and achieves near-optimal reliability performance on Polar(32,16) and Polar(64,22) codes. The proposed curriculum is critical in achieving the accuracy gains of CRISP, which can also be extended to Polarization-Adjusted-Convolutional (PAC) codes."
}