{
    "title": "Development of Hybrid ASR Systems for Low Resource Medical Domain Conversational Telephone Speech. (arXiv:2210.13397v3 [cs.CL] UPDATED)",
    "abstract": "Language barriers present a great challenge in our increasingly connected and global world. Especially within the medical domain, e.g. hospital or emergency room, communication difficulties and delays may lead to malpractice and non-optimal patient care. In the HYKIST project, we consider patient-physician communication, more specifically between a German-speaking physician and an Arabic- or Vietnamese-speaking patient. Currently, a doctor can call the Triaphon service to get assistance from an interpreter in order to help facilitate communication. The HYKIST goal is to support the usually non-professional bilingual interpreter with an automatic speech translation system to improve patient care and help overcome language barriers. In this work, we present our ASR system development efforts for this conversational telephone speech translation task in the medical domain for two languages pairs, data collection, various acoustic model architectures and dialect-induced difficulties.",
    "link": "http://arxiv.org/abs/2210.13397",
    "context": "Title: Development of Hybrid ASR Systems for Low Resource Medical Domain Conversational Telephone Speech. (arXiv:2210.13397v3 [cs.CL] UPDATED)\nAbstract: Language barriers present a great challenge in our increasingly connected and global world. Especially within the medical domain, e.g. hospital or emergency room, communication difficulties and delays may lead to malpractice and non-optimal patient care. In the HYKIST project, we consider patient-physician communication, more specifically between a German-speaking physician and an Arabic- or Vietnamese-speaking patient. Currently, a doctor can call the Triaphon service to get assistance from an interpreter in order to help facilitate communication. The HYKIST goal is to support the usually non-professional bilingual interpreter with an automatic speech translation system to improve patient care and help overcome language barriers. In this work, we present our ASR system development efforts for this conversational telephone speech translation task in the medical domain for two languages pairs, data collection, various acoustic model architectures and dialect-induced difficulties.",
    "path": "papers/22/10/2210.13397.json",
    "total_tokens": 890,
    "translated_title": "低资源医疗领域会话电话语音的混合ASR系统的开发",
    "translated_abstract": "语言障碍在我们日益连接和全球化的世界中带来了巨大的挑战。尤其在医疗领域，如医院或急诊室，沟通困难和延误可能导致医疗失误和非最佳的患者护理。在HYKIST项目中，我们考虑患者和医生之间的交流，具体来说是德语医生和阿拉伯语或越南语患者之间的交流。目前，医生可以打电话给Triaphon服务以获得来自翻译员的帮助，以促进沟通。HYKIST的目标是为通常没有专业背景的双语翻译员提供自动语音翻译系统，以改进患者护理并解决语言障碍。在这项工作中，我们介绍了针对医疗领域会话电话语音翻译任务的ASR系统开发工作，涉及两种语言对的数据收集、各种声学模型架构和方言引起的困难。",
    "tldr": "本研究开发了针对低资源医疗领域会话电话语音的混合ASR系统，旨在改善患者护理并克服语言障碍。",
    "en_tdlr": "This paper presents the development of hybrid ASR systems for low resource medical domain conversational telephone speech, aiming to improve patient care and overcome language barriers."
}