{
    "title": "Learning low-rank latent mesoscale structures in networks. (arXiv:2102.06984v5 [cs.SI] UPDATED)",
    "abstract": "It is common to use networks to encode the architecture of interactions between entities in complex systems in the physical, biological, social, and information sciences. To study the large-scale behavior of complex systems, it is useful to examine mesoscale structures in networks as building blocks that influence such behavior. We present a new approach for describing low-rank mesoscale structures in networks, and we illustrate our approach using several synthetic network models and empirical friendship, collaboration, and protein--protein interaction (PPI) networks. We find that these networks possess a relatively small number of `latent motifs' that together can successfully approximate most subgraphs of a network at a fixed mesoscale. We use an algorithm for `network dictionary learning' (NDL), which combines a network-sampling method and nonnegative matrix factorization, to learn the latent motifs of a given network. The ability to encode a network using a set of latent motifs has",
    "link": "http://arxiv.org/abs/2102.06984",
    "context": "Title: Learning low-rank latent mesoscale structures in networks. (arXiv:2102.06984v5 [cs.SI] UPDATED)\nAbstract: It is common to use networks to encode the architecture of interactions between entities in complex systems in the physical, biological, social, and information sciences. To study the large-scale behavior of complex systems, it is useful to examine mesoscale structures in networks as building blocks that influence such behavior. We present a new approach for describing low-rank mesoscale structures in networks, and we illustrate our approach using several synthetic network models and empirical friendship, collaboration, and protein--protein interaction (PPI) networks. We find that these networks possess a relatively small number of `latent motifs' that together can successfully approximate most subgraphs of a network at a fixed mesoscale. We use an algorithm for `network dictionary learning' (NDL), which combines a network-sampling method and nonnegative matrix factorization, to learn the latent motifs of a given network. The ability to encode a network using a set of latent motifs has",
    "path": "papers/21/02/2102.06984.json",
    "total_tokens": 920,
    "translated_title": "在网络中学习低秩潜在中尺度结构",
    "translated_abstract": "在复杂系统中，常常使用网络来编码实体之间的相互作用的体系结构，包括物理、生物、社会和信息科学。为了研究复杂系统的大规模行为，有必要研究网络中的中尺度结构作为影响这种行为的构建块。我们提出了一种描述网络中低秩潜在中尺度结构的新方法，并且通过使用几个合成网络模型和实证友谊、合作和蛋白质相互作用（PPI）网络来说明我们的方法。我们发现，这些网络具有一个相对较小数量的“潜在模式”，这些模式共同可以成功地近似网络的大多数子图在固定的中尺度上。我们使用了一种“网络字典学习”（NDL）的算法，该算法结合了网络采样方法和非负矩阵分解，以学习给定网络的潜在模式。",
    "tldr": "这项研究提出了一种学习网络中低秩潜在中尺度结构的新方法，并通过合成网络模型和实际网络验证了其有效性。通过利用少量的“潜在模式”，可以成功地近似网络的大多数子图。这项研究对于理解复杂系统的行为具有重要意义。",
    "en_tdlr": "This research proposes a new method for learning low-rank latent mesoscale structures in networks and validates its effectiveness through synthetic network models and empirical networks. By utilizing a small number of latent motifs, it can effectively approximate most subgraphs of a network. This research is significant for understanding the behavior of complex systems."
}