{
    "title": "CLNet: Complex Input Lightweight Neural Network designed for Massive MIMO CSI Feedback. (arXiv:2102.07507v3 [cs.IT] UPDATED)",
    "abstract": "Unleashing the full potential of massive MIMO in FDD mode by reducing the overhead of CSI feedback has recently garnered attention. Numerous deep learning for massive MIMO CSI feedback approaches have demonstrated their efficiency and potential. However, most existing methods improve accuracy at the cost of computational complexity and the accuracy decreases significantly as the CSI compression rate increases. This paper presents a novel neural network CLNet tailored for CSI feedback problem based on the intrinsic properties of CSI. CLNet proposes a forge complex-valued input layer to process signals and utilizes attention mechanism to enhance the performance of the network. The experiment result shows that CLNet outperforms the state-of-the-art method by average accuracy improvement of 5.41\\% in both outdoor and indoor scenarios with average 24.1\\% less computational overhead. Codes for deep learning-based CSI feedback CLNet are available at GitHub.",
    "link": "http://arxiv.org/abs/2102.07507",
    "context": "Title: CLNet: Complex Input Lightweight Neural Network designed for Massive MIMO CSI Feedback. (arXiv:2102.07507v3 [cs.IT] UPDATED)\nAbstract: Unleashing the full potential of massive MIMO in FDD mode by reducing the overhead of CSI feedback has recently garnered attention. Numerous deep learning for massive MIMO CSI feedback approaches have demonstrated their efficiency and potential. However, most existing methods improve accuracy at the cost of computational complexity and the accuracy decreases significantly as the CSI compression rate increases. This paper presents a novel neural network CLNet tailored for CSI feedback problem based on the intrinsic properties of CSI. CLNet proposes a forge complex-valued input layer to process signals and utilizes attention mechanism to enhance the performance of the network. The experiment result shows that CLNet outperforms the state-of-the-art method by average accuracy improvement of 5.41\\% in both outdoor and indoor scenarios with average 24.1\\% less computational overhead. Codes for deep learning-based CSI feedback CLNet are available at GitHub.",
    "path": "papers/21/02/2102.07507.json",
    "total_tokens": 931,
    "translated_title": "CLNet：用于大规模MIMO CSI反馈的复杂输入轻量神经网络",
    "translated_abstract": "最近，通过减少CSI反馈的开销来发挥大规模MIMO在FDD模式下的全部潜力已经引起了人们的关注。许多用于大规模MIMO CSI反馈的深度学习方法已经展示了它们的效率和潜力。然而，大多数现有方法提高了准确性，但计算复杂度也随之增加，而且随着CSI压缩率的增加，准确性显著降低。本文提出了一种新颖的神经网络CLNet，针对CSI反馈问题，基于CSI的内在属性，CLNet提出了一个锻造的复杂值输入层来处理信号，并利用注意机制来提高网络的性能。实验结果显示，CLNet在室内外场景中的平均准确度提高了5.41％，计算开销平均减少了24.1％，优于目前的最新方法。深度学习CSI反馈CLNet的代码可在GitHub上获得。",
    "tldr": "本文提出了一种名为CLNet的神经网络，可以在大规模MIMO CSI反馈中提高准确性，减少计算开销，同时遵循CSI的内在属性。在室内外场景中，CLNet平均准确度提高了5.41％，计算开销减少了24.1％。",
    "en_tdlr": "This paper proposes a neural network, named CLNet, that can improve the accuracy and reduce computational overhead in massive MIMO CSI feedback, while following the intrinsic properties of CSI. CLNet outperforms existing methods with an average accuracy improvement of 5.41% and 24.1% less computational overhead in both indoor and outdoor scenarios."
}