{
    "title": "On-Demand Transit User Preference Analysis using Hybrid Choice Models. (arXiv:2102.08256v2 [econ.EM] UPDATED)",
    "abstract": "In light of the increasing interest to transform the fixed-route public transit (FRT) services into on-demand transit (ODT) services, there exists a strong need for a comprehensive evaluation of the effects of this shift on the users. Such an analysis can help the municipalities and service providers to design and operate more convenient, attractive, and sustainable transit solutions. To understand the user preferences, we developed three hybrid choice models: integrated choice and latent variable (ICLV), latent class (LC), and latent class integrated choice and latent variable (LC-ICLV) models. We used these models to analyze the public transit user's preferences in Belleville, Ontario, Canada. Hybrid choice models were estimated using a rich dataset that combined the actual level of service attributes obtained from Belleville's ODT service and self-reported usage behaviour obtained from a revealed preference survey of the ODT users. The latent class models divided the users into two ",
    "link": "http://arxiv.org/abs/2102.08256",
    "context": "Title: On-Demand Transit User Preference Analysis using Hybrid Choice Models. (arXiv:2102.08256v2 [econ.EM] UPDATED)\nAbstract: In light of the increasing interest to transform the fixed-route public transit (FRT) services into on-demand transit (ODT) services, there exists a strong need for a comprehensive evaluation of the effects of this shift on the users. Such an analysis can help the municipalities and service providers to design and operate more convenient, attractive, and sustainable transit solutions. To understand the user preferences, we developed three hybrid choice models: integrated choice and latent variable (ICLV), latent class (LC), and latent class integrated choice and latent variable (LC-ICLV) models. We used these models to analyze the public transit user's preferences in Belleville, Ontario, Canada. Hybrid choice models were estimated using a rich dataset that combined the actual level of service attributes obtained from Belleville's ODT service and self-reported usage behaviour obtained from a revealed preference survey of the ODT users. The latent class models divided the users into two ",
    "path": "papers/21/02/2102.08256.json",
    "total_tokens": 885,
    "translated_title": "使用混合选择模型进行按需公交用户偏好分析",
    "translated_abstract": "随着将固定路线公共交通服务转变为按需交通服务的兴趣日益增长，对用户对此转变的影响进行全面评估变得非常必要。这样的分析可以帮助市政府和服务提供商设计和运营更便利、有吸引力和可持续的交通解决方案。为了了解用户的偏好，我们开发了三种混合选择模型：集成选择和潜变量（ICLV），潜类（LC）和潜类集成选择和潜变量（LC-ICLV）模型。我们使用这些模型分析了加拿大安大略省贝尔维尔市的公共交通用户的偏好。混合选择模型使用了一个丰富的数据集，结合了从贝尔维尔市的按需交通服务中获得的实际服务水平属性以及从按需交通用户的问卷调查中获得的自报使用行为。潜类模型将用户分为两类。",
    "tldr": "通过使用混合选择模型，该研究分析了加拿大贝尔维尔市公共交通用户在转变为按需交通服务时的偏好，为市政府和服务提供商设计和运营更好的交通解决方案提供了指导。",
    "en_tdlr": "This study analyzes the preferences of public transit users in Belleville, Canada, when transitioning to on-demand transit services using hybrid choice models, providing guidance for the design and operation of better transportation solutions for municipalities and service providers."
}