{
    "title": "Spike and slab Bayesian sparse principal component analysis. (arXiv:2102.00305v2 [stat.ME] UPDATED)",
    "abstract": "Sparse principal component analysis (SPCA) is a popular tool for dimensionality reduction in high-dimensional data. However, there is still a lack of theoretically justified Bayesian SPCA methods that can scale well computationally. One of the major challenges in Bayesian SPCA is selecting an appropriate prior for the loadings matrix, considering that principal components are mutually orthogonal. We propose a novel parameter-expanded coordinate ascent variational inference (PX-CAVI) algorithm. This algorithm utilizes a spike and slab prior, which incorporates parameter expansion to cope with the orthogonality constraint. Besides comparing to two popular SPCA approaches, we introduce the PX-EM algorithm as an EM analogue to the PX-CAVI algorithm for comparison. Through extensive numerical simulations, we demonstrate that the PX-CAVI algorithm outperforms these SPCA approaches, showcasing its superiority in terms of performance. We study the posterior contraction rate of the variational ",
    "link": "http://arxiv.org/abs/2102.00305",
    "context": "Title: Spike and slab Bayesian sparse principal component analysis. (arXiv:2102.00305v2 [stat.ME] UPDATED)\nAbstract: Sparse principal component analysis (SPCA) is a popular tool for dimensionality reduction in high-dimensional data. However, there is still a lack of theoretically justified Bayesian SPCA methods that can scale well computationally. One of the major challenges in Bayesian SPCA is selecting an appropriate prior for the loadings matrix, considering that principal components are mutually orthogonal. We propose a novel parameter-expanded coordinate ascent variational inference (PX-CAVI) algorithm. This algorithm utilizes a spike and slab prior, which incorporates parameter expansion to cope with the orthogonality constraint. Besides comparing to two popular SPCA approaches, we introduce the PX-EM algorithm as an EM analogue to the PX-CAVI algorithm for comparison. Through extensive numerical simulations, we demonstrate that the PX-CAVI algorithm outperforms these SPCA approaches, showcasing its superiority in terms of performance. We study the posterior contraction rate of the variational ",
    "path": "papers/21/02/2102.00305.json",
    "total_tokens": 924,
    "translated_title": "峰值和板条贝叶斯稀疏主成分分析",
    "translated_abstract": "稀疏主成分分析（SPCA）是高维数据降维的常用工具。然而，目前仍缺乏理论上合理且具有良好计算可扩展性的贝叶斯SPCA方法。贝叶斯SPCA面临的主要挑战之一是选择适当的先验分布用于载荷矩阵，考虑到主成分之间相互正交。我们提出了一种新颖的参数扩展坐标上升变分推断（PX-CAVI）算法。该算法利用峰值和板条先验分布，通过参数扩展来处理正交性约束。除了与两种流行的SPCA方法进行比较外，我们还介绍了PX-EM算法作为PX-CAVI算法的EM类比进行比较。通过广泛的数值模拟，我们证明了PX-CAVI算法胜过这些SPCA方法，展示了其在性能方面的优越性。我们研究了变分后验收缩速度。",
    "tldr": "本论文提出了一种采用峰值和板条先验的参数扩展坐标上升变分推断算法，用于解决贝叶斯稀疏主成分分析中的正交性约束问题。通过广泛的数值模拟，证明了该算法在性能上优于其他SPCA方法。"
}