{
    "title": "Emerging Trends in Federated Learning: From Model Fusion to Federated X Learning",
    "abstract": "arXiv:2102.12920v4 Announce Type: replace  Abstract: Federated learning is a new learning paradigm that decouples data collection and model training via multi-party computation and model aggregation. As a flexible learning setting, federated learning has the potential to integrate with other learning frameworks. We conduct a focused survey of federated learning in conjunction with other learning algorithms. Specifically, we explore various learning algorithms to improve the vanilla federated averaging algorithm and review model fusion methods such as adaptive aggregation, regularization, clustered methods, and Bayesian methods. Following the emerging trends, we also discuss federated learning in the intersection with other learning paradigms, termed federated X learning, where X includes multitask learning, meta-learning, transfer learning, unsupervised learning, and reinforcement learning. This survey reviews the state of the art, challenges, and future directions.",
    "link": "https://arxiv.org/abs/2102.12920",
    "context": "Title: Emerging Trends in Federated Learning: From Model Fusion to Federated X Learning\nAbstract: arXiv:2102.12920v4 Announce Type: replace  Abstract: Federated learning is a new learning paradigm that decouples data collection and model training via multi-party computation and model aggregation. As a flexible learning setting, federated learning has the potential to integrate with other learning frameworks. We conduct a focused survey of federated learning in conjunction with other learning algorithms. Specifically, we explore various learning algorithms to improve the vanilla federated averaging algorithm and review model fusion methods such as adaptive aggregation, regularization, clustered methods, and Bayesian methods. Following the emerging trends, we also discuss federated learning in the intersection with other learning paradigms, termed federated X learning, where X includes multitask learning, meta-learning, transfer learning, unsupervised learning, and reinforcement learning. This survey reviews the state of the art, challenges, and future directions.",
    "path": "papers/21/02/2102.12920.json",
    "total_tokens": 906,
    "translated_title": "新兴趋势：从模型融合到联邦 X 学习的研究",
    "translated_abstract": "联邦学习是一种新的学习范式，通过多方计算和模型聚合来解耦数据收集与模型训练。作为一种灵活的学习设置，联邦学习有潜力与其他学习框架整合。本文针对联邦学习与其他学习算法的结合进行了重点调查。具体来说，我们探索了各种学习算法以改进原始的联邦平均算法，并回顾了模型融合方法，例如自适应聚合、正则化、聚类方法和贝叶斯方法。根据新兴趋势，我们还讨论了联邦学习与其他学习范式的交集，称为联邦 X 学习，其中 X 包括多任务学习、元学习、迁移学习、无监督学习和强化学习。这项调查回顾了现状、挑战和未来方向。",
    "tldr": "联邦学习作为一种新的学习范式，不仅有助于改进算法和模型融合方法，还展示了与其他学习框架相结合的潜力，特别是在联邦 X 学习中，为多任务学习、元学习、迁移学习等提供了新的研究视角。",
    "en_tdlr": "Federated learning, as a new learning paradigm, not only helps improve algorithms and model fusion methods but also demonstrates the potential of integrating with other learning frameworks, especially in federated X learning, providing new research perspectives for multitask learning, meta-learning, transfer learning, etc."
}