{
    "title": "Causal Collaborative Filtering. (arXiv:2102.01868v5 [cs.IR] UPDATED)",
    "abstract": "Many of the traditional recommendation algorithms are designed based on the fundamental idea of mining or learning correlative patterns from data to estimate the user-item correlative preference. However, pure correlative learning may lead to Simpson's paradox in predictions, and thus results in sacrificed recommendation performance. Simpson's paradox is a well-known statistical phenomenon, which causes confusions in statistical conclusions and ignoring the paradox may result in inaccurate decisions. Fortunately, causal and counterfactual modeling can help us to think outside of the observational data for user modeling and personalization so as to tackle such issues. In this paper, we propose Causal Collaborative Filtering (CCF) -- a general framework for modeling causality in collaborative filtering and recommendation. We provide a unified causal view of CF and mathematically show that many of the traditional CF algorithms are actually special cases of CCF under simplified causal grap",
    "link": "http://arxiv.org/abs/2102.01868",
    "context": "Title: Causal Collaborative Filtering. (arXiv:2102.01868v5 [cs.IR] UPDATED)\nAbstract: Many of the traditional recommendation algorithms are designed based on the fundamental idea of mining or learning correlative patterns from data to estimate the user-item correlative preference. However, pure correlative learning may lead to Simpson's paradox in predictions, and thus results in sacrificed recommendation performance. Simpson's paradox is a well-known statistical phenomenon, which causes confusions in statistical conclusions and ignoring the paradox may result in inaccurate decisions. Fortunately, causal and counterfactual modeling can help us to think outside of the observational data for user modeling and personalization so as to tackle such issues. In this paper, we propose Causal Collaborative Filtering (CCF) -- a general framework for modeling causality in collaborative filtering and recommendation. We provide a unified causal view of CF and mathematically show that many of the traditional CF algorithms are actually special cases of CCF under simplified causal grap",
    "path": "papers/21/02/2102.01868.json",
    "total_tokens": 896,
    "translated_title": "因果协同过滤",
    "translated_abstract": "许多传统的推荐算法基于从数据中挖掘或学习相关模式来估计用户-项目的相关偏好的基本思想设计。然而，纯粹的相关学习可能导致预测中的辛普森悖论，从而导致推荐性能的损失。辛普森悖论是一个众所周知的统计现象，它会导致统计结论的混淆，忽视这个悖论可能导致不准确的决策。幸运的是，因果和反事实建模可以帮助我们超越观察数据进行用户建模和个性化，以解决这些问题。在本文中，我们提出了一种名为因果协同过滤（CCF）的通用框架，用于对协同过滤和推荐中的因果关系进行建模。我们提供了一个统一的因果视图，并从数学上证明了许多传统的协同过滤算法实际上是简化因果图下CCF的特殊情况。",
    "tldr": "本论文提出了一种名为因果协同过滤（CCF）的通用框架，用于对协同过滤和推荐中的因果关系进行建模。这种方法可以解决纯粹相关学习导致的预测中的辛普森悖论问题，提高推荐性能。",
    "en_tdlr": "This paper proposes a general framework called Causal Collaborative Filtering (CCF) for modeling causality in collaborative filtering and recommendation. It addresses the issue of Simpson's paradox caused by pure correlative learning in predictions, which improves recommendation performance."
}