{
    "title": "Time-Series Imputation with Wasserstein Interpolation for Optimal Look-Ahead-Bias and Variance Tradeoff. (arXiv:2102.12736v2 [stat.ML] UPDATED)",
    "abstract": "Missing time-series data is a prevalent practical problem. Imputation methods in time-series data often are applied to the full panel data with the purpose of training a model for a downstream out-of-sample task. For example, in finance, imputation of missing returns may be applied prior to training a portfolio optimization model. Unfortunately, this practice may result in a look-ahead-bias in the future performance on the downstream task. There is an inherent trade-off between the look-ahead-bias of using the full data set for imputation and the larger variance in the imputation from using only the training data. By connecting layers of information revealed in time, we propose a Bayesian posterior consensus distribution which optimally controls the variance and look-ahead-bias trade-off in the imputation. We demonstrate the benefit of our methodology both in synthetic and real financial data.",
    "link": "http://arxiv.org/abs/2102.12736",
    "context": "Title: Time-Series Imputation with Wasserstein Interpolation for Optimal Look-Ahead-Bias and Variance Tradeoff. (arXiv:2102.12736v2 [stat.ML] UPDATED)\nAbstract: Missing time-series data is a prevalent practical problem. Imputation methods in time-series data often are applied to the full panel data with the purpose of training a model for a downstream out-of-sample task. For example, in finance, imputation of missing returns may be applied prior to training a portfolio optimization model. Unfortunately, this practice may result in a look-ahead-bias in the future performance on the downstream task. There is an inherent trade-off between the look-ahead-bias of using the full data set for imputation and the larger variance in the imputation from using only the training data. By connecting layers of information revealed in time, we propose a Bayesian posterior consensus distribution which optimally controls the variance and look-ahead-bias trade-off in the imputation. We demonstrate the benefit of our methodology both in synthetic and real financial data.",
    "path": "papers/21/02/2102.12736.json",
    "total_tokens": 860,
    "translated_title": "用Wasserstein插值进行时间序列插补以达到最佳远期偏差和方差平衡",
    "translated_abstract": "缺失的时间序列数据是一个普遍存在的实际问题。时间序列数据中的插补方法通常被应用于完整的面板数据，目的是为了训练一个用于下游样本外任务的模型。例如，在金融中，缺失收益的插补可能被应用于在训练组合优化模型之前。然而，这种做法可能会导致未来性能上的前瞻性偏差。使用完整数据集进行插补存在使用只训练数据的插补中较大的方差之间的固有权衡。通过连接时间中显示的信息层次，我们提出了一个贝叶斯后验共识分布，它在插补中最优地控制了方差和前瞻性偏差的权衡。我们展示了我们的方法在合成和真实金融数据中的优点。",
    "tldr": "该论文提出了一种基于贝叶斯后验共识分布的插补方法，可以在控制方差和前瞻性偏差权衡的同时进行时间序列插补，适用于金融等领域。",
    "en_tdlr": "This paper proposes a Bayesian posterior consensus distribution for time-series imputation, which can control the trade-off between variance and look-ahead bias. The method can be applied in various fields, such as finance."
}