{
    "title": "Necessary and sufficient graphical conditions for optimal adjustment sets in causal graphical models with hidden variables. (arXiv:2102.10324v4 [cs.LG] UPDATED)",
    "abstract": "The problem of selecting optimal backdoor adjustment sets to estimate causal effects in graphical models with hidden and conditioned variables is addressed. Previous work has defined optimality as achieving the smallest asymptotic estimation variance and derived an optimal set for the case without hidden variables. For the case with hidden variables there can be settings where no optimal set exists and currently only a sufficient graphical optimality criterion of limited applicability has been derived. In the present work optimality is characterized as maximizing a certain adjustment information which allows to derive a necessary and sufficient graphical criterion for the existence of an optimal adjustment set and a definition and algorithm to construct it. Further, the optimal set is valid if and only if a valid adjustment set exists and has higher (or equal) adjustment information than the Adjust-set proposed in Perkovi{\\'c} et al. [Journal of Machine Learning Research, 18: 1--62, 20",
    "link": "http://arxiv.org/abs/2102.10324",
    "context": "Title: Necessary and sufficient graphical conditions for optimal adjustment sets in causal graphical models with hidden variables. (arXiv:2102.10324v4 [cs.LG] UPDATED)\nAbstract: The problem of selecting optimal backdoor adjustment sets to estimate causal effects in graphical models with hidden and conditioned variables is addressed. Previous work has defined optimality as achieving the smallest asymptotic estimation variance and derived an optimal set for the case without hidden variables. For the case with hidden variables there can be settings where no optimal set exists and currently only a sufficient graphical optimality criterion of limited applicability has been derived. In the present work optimality is characterized as maximizing a certain adjustment information which allows to derive a necessary and sufficient graphical criterion for the existence of an optimal adjustment set and a definition and algorithm to construct it. Further, the optimal set is valid if and only if a valid adjustment set exists and has higher (or equal) adjustment information than the Adjust-set proposed in Perkovi{\\'c} et al. [Journal of Machine Learning Research, 18: 1--62, 20",
    "path": "papers/21/02/2102.10324.json",
    "total_tokens": 836,
    "translated_title": "带有隐藏变量的因果图模型中最优调整集的必要和充分图条件",
    "translated_abstract": "本文解决了在具有隐藏和条件变量的图形模型中选择最优反向门控调整集以估计因果效应的问题。先前的工作将最优定义为实现最小渐近估计方差，并推导了无隐藏变量情况下的最优集。对于存在隐藏变量的情况，可能存在没有最优集的设置，并且目前仅推导出了受限应用的充分图优化标准。在本文中，最优性被表征为最大化某种调整信息，这允许导出关于存在最优调整集的必要和充分图准则以及一个定义和构造它的算法。此外，当且仅当存在有效的调整集且其调整信息高于等于Perkovi{\\'c}等提出的Adjust-set时，最优集才有效。",
    "tldr": "本文提出了关于在带有隐藏变量的因果图模型中选择最优反向门控调整集以估计因果效应问题的必要和充分图条件及其算法，解决了此类图模型中可能存在没有最优集的情况。"
}