{
    "title": "Using Multiple RDF Knowledge Graphs for Enriching ChatGPT Responses. (arXiv:2304.05774v1 [cs.DB])",
    "abstract": "There is a recent trend for using the novel Artificial Intelligence ChatGPT chatbox, which provides detailed responses and articulate answers across many domains of knowledge. However, in many cases it returns plausible-sounding but incorrect or inaccurate responses, whereas it does not provide evidence. Therefore, any user has to further search for checking the accuracy of the answer or/and for finding more information about the entities of the response. At the same time there is a high proliferation of RDF Knowledge Graphs (KGs) over any real domain, that offer high quality structured data. For enabling the combination of ChatGPT and RDF KGs, we present a research prototype, called GPToLODS, which is able to enrich any ChatGPT response with more information from hundreds of RDF KGs. In particular, it identifies and annotates each entity of the response with statistics and hyperlinks to LODsyndesis KG (which contains integrated data from 400 RDF KGs and over 412 million entities). In ",
    "link": "http://arxiv.org/abs/2304.05774",
    "context": "Title: Using Multiple RDF Knowledge Graphs for Enriching ChatGPT Responses. (arXiv:2304.05774v1 [cs.DB])\nAbstract: There is a recent trend for using the novel Artificial Intelligence ChatGPT chatbox, which provides detailed responses and articulate answers across many domains of knowledge. However, in many cases it returns plausible-sounding but incorrect or inaccurate responses, whereas it does not provide evidence. Therefore, any user has to further search for checking the accuracy of the answer or/and for finding more information about the entities of the response. At the same time there is a high proliferation of RDF Knowledge Graphs (KGs) over any real domain, that offer high quality structured data. For enabling the combination of ChatGPT and RDF KGs, we present a research prototype, called GPToLODS, which is able to enrich any ChatGPT response with more information from hundreds of RDF KGs. In particular, it identifies and annotates each entity of the response with statistics and hyperlinks to LODsyndesis KG (which contains integrated data from 400 RDF KGs and over 412 million entities). In ",
    "path": "papers/23/04/2304.05774.json",
    "total_tokens": 881,
    "translated_title": "使用多个RDF知识图谱丰富ChatGPT回复",
    "translated_abstract": "最近越来越流行使用人工智能ChatGPT聊天框，它可以提供跨多个领域的详细回复和明确答案。然而，在很多情况下，它返回听起来很合理但是不正确或不准确的回复，并且它不提供证据。因此，任何用户都必须进一步搜索以检查答案的准确性和/或查找有关响应实体的更多信息。同时，在任何实际领域都存在大量的RDF知识图谱（KG），提供高质量的结构化数据。为了实现ChatGPT和RDF KG的结合，我们提出了一个名为GPToLODS的研究原型，能够从数百个RDF KG中为任何ChatGPT响应添加更多信息。特别地，它识别并注释每个响应实体的统计数据和指向LODsyndesis KG（包含来自400多个RDF KG和超过412百万实体的集成数据）的超链接。",
    "tldr": "本研究提出了一个名为GPToLODS的原型系统，可以使用数百个RDF知识图谱为ChatGPT提供更多信息和证据，丰富ChatGPT的回复。"
}