{
    "title": "Detection and Estimation of Structural Breaks in High-Dimensional Functional Time Series. (arXiv:2304.07003v1 [stat.ME])",
    "abstract": "In this paper, we consider detecting and estimating breaks in heterogeneous mean functions of high-dimensional functional time series which are allowed to be cross-sectionally correlated and temporally dependent. A new test statistic combining the functional CUSUM statistic and power enhancement component is proposed with asymptotic null distribution theory comparable to the conventional CUSUM theory derived for a single functional time series. In particular, the extra power enhancement component enlarges the region where the proposed test has power, and results in stable power performance when breaks are sparse in the alternative hypothesis. Furthermore, we impose a latent group structure on the subjects with heterogeneous break points and introduce an easy-to-implement clustering algorithm with an information criterion to consistently estimate the unknown group number and membership. The estimated group structure can subsequently improve the convergence property of the post-clusterin",
    "link": "http://arxiv.org/abs/2304.07003",
    "context": "Title: Detection and Estimation of Structural Breaks in High-Dimensional Functional Time Series. (arXiv:2304.07003v1 [stat.ME])\nAbstract: In this paper, we consider detecting and estimating breaks in heterogeneous mean functions of high-dimensional functional time series which are allowed to be cross-sectionally correlated and temporally dependent. A new test statistic combining the functional CUSUM statistic and power enhancement component is proposed with asymptotic null distribution theory comparable to the conventional CUSUM theory derived for a single functional time series. In particular, the extra power enhancement component enlarges the region where the proposed test has power, and results in stable power performance when breaks are sparse in the alternative hypothesis. Furthermore, we impose a latent group structure on the subjects with heterogeneous break points and introduce an easy-to-implement clustering algorithm with an information criterion to consistently estimate the unknown group number and membership. The estimated group structure can subsequently improve the convergence property of the post-clusterin",
    "path": "papers/23/04/2304.07003.json",
    "total_tokens": 910,
    "translated_title": "高维函数时间序列中结构性突变的检测和估计",
    "translated_abstract": "本文考虑检测和估计高维函数时间序列的异质均值函数中的突变，允许横向相关和时间依赖关系。提出了一种新的检验统计量，结合了函数CUSUM统计量和功率增强组件，其渐近零分布理论可与单个函数时间序列的传统CUSUM理论相媲美。特别地，额外的功率增强组件扩大了所提出的检验具备功率的区域，当替代假设中的突变稀疏时，结果具有稳定的功率性能。此外，我们针对具有异质突变点的对象施加潜在的组结构，并引入一种易于实现的聚类算法和信息准则，以一致地估计未知组数和成员资格。随后，估计的组结构可以改善后聚类的收敛性质。",
    "tldr": "本文提出了一种新的高维函数时间序列突变检验统计量，又保证功率性能，又扩大了具备功率的区域；同时，引入了一种易于实现的聚类算法和信息准则，以一致地估计未知组数和成员资格，以改善后聚类的收敛性质。",
    "en_tdlr": "This paper proposes a new test statistic for detecting structural breaks in the mean functions of high-dimensional functional time series, and introduces a clustering algorithm with an information criterion to estimate the unknown group number and membership, in order to improve the convergence property of post-clustering. The proposed test has both power enhancement and a wider region of power, and the results show stable power performance in case of sparse alternative hypotheses."
}