{
    "title": "A Survey on Approximate Edge AI for Energy Efficient Autonomous Driving Services. (arXiv:2304.14271v1 [cs.RO])",
    "abstract": "Autonomous driving services rely heavily on sensors such as cameras, LiDAR, radar, and communication modules. A common practice of processing the sensed data is using a high-performance computing unit placed inside the vehicle, which deploys AI models and algorithms to act as the brain or administrator of the vehicle. The vehicular data generated from average hours of driving can be up to 20 Terabytes depending on the data rate and specification of the sensors. Given the scale and fast growth of services for autonomous driving, it is essential to improve the overall energy and environmental efficiency, especially in the trend towards vehicular electrification (e.g., battery-powered). Although the areas have seen significant advancements in sensor technologies, wireless communications, computing and AI/ML algorithms, the challenge still exists in how to apply and integrate those technology innovations to achieve energy efficiency. This survey reviews and compares the connected vehicular",
    "link": "http://arxiv.org/abs/2304.14271",
    "context": "Title: A Survey on Approximate Edge AI for Energy Efficient Autonomous Driving Services. (arXiv:2304.14271v1 [cs.RO])\nAbstract: Autonomous driving services rely heavily on sensors such as cameras, LiDAR, radar, and communication modules. A common practice of processing the sensed data is using a high-performance computing unit placed inside the vehicle, which deploys AI models and algorithms to act as the brain or administrator of the vehicle. The vehicular data generated from average hours of driving can be up to 20 Terabytes depending on the data rate and specification of the sensors. Given the scale and fast growth of services for autonomous driving, it is essential to improve the overall energy and environmental efficiency, especially in the trend towards vehicular electrification (e.g., battery-powered). Although the areas have seen significant advancements in sensor technologies, wireless communications, computing and AI/ML algorithms, the challenge still exists in how to apply and integrate those technology innovations to achieve energy efficiency. This survey reviews and compares the connected vehicular",
    "path": "papers/23/04/2304.14271.json",
    "total_tokens": 888,
    "translated_title": "自主驾驶能源高效近似边缘人工智能概述调查",
    "translated_abstract": "自主驾驶服务极大地依赖于传感器，如摄像机、激光雷达、雷达和通信模块。处理传感数据的通常做法是在车辆内部放置高性能计算单元，部署人工智能模型和算法，作为车辆的大脑或管理员。从平均行驶时间生成的车辆数据可以高达20TB，具体取决于传感器的数据速率和规格。鉴于自主驾驶服务的规模和快速增长，尤其是在向车辆电气化（例如，电池驱动）的趋势中，提高总体能源和环境效率至关重要。 虽然这些领域的传感器技术、无线通信、计算和AI / ML算法已经取得了显着进展，但如何应用和整合这些技术创新以实现能源效率仍然是一个挑战。本调查回顾并比较了连接的车辆",
    "tldr": "这篇论文概述了自主驾驶服务中的传感和数据处理现状，及其对能源和环境带来的挑战，进一步调查和比较了如何应用和整合现有技术创新以实现能源效率。",
    "en_tdlr": "This paper provides an overview of the current situation of sensors and data processing in autonomous driving services, the challenges they pose to energy and environment, and further investigates and compares how to apply and integrate existing technological innovations to achieve energy efficiency."
}