{
    "title": "Label-free timing analysis of modularized nuclear detectors with physics-constrained deep learning. (arXiv:2304.11930v2 [physics.ins-det] UPDATED)",
    "abstract": "Pulse timing is an important topic in nuclear instrumentation, with far-reaching applications from high energy physics to radiation imaging. While high-speed analog-to-digital converters become more and more developed and accessible, their potential uses and merits in nuclear detector signal processing are still uncertain, partially due to associated timing algorithms which are not fully understood and utilized. In this paper, we propose a novel method based on deep learning for timing analysis of modularized nuclear detectors without explicit needs of labelling event data. By taking advantage of the inner time correlation of individual detectors, a label-free loss function with a specially designed regularizer is formed to supervise the training of neural networks towards a meaningful and accurate mapping function. We mathematically demonstrate the existence of the optimal function desired by the method, and give a systematic algorithm for training and calibration of the model. The pr",
    "link": "http://arxiv.org/abs/2304.11930",
    "context": "Title: Label-free timing analysis of modularized nuclear detectors with physics-constrained deep learning. (arXiv:2304.11930v2 [physics.ins-det] UPDATED)\nAbstract: Pulse timing is an important topic in nuclear instrumentation, with far-reaching applications from high energy physics to radiation imaging. While high-speed analog-to-digital converters become more and more developed and accessible, their potential uses and merits in nuclear detector signal processing are still uncertain, partially due to associated timing algorithms which are not fully understood and utilized. In this paper, we propose a novel method based on deep learning for timing analysis of modularized nuclear detectors without explicit needs of labelling event data. By taking advantage of the inner time correlation of individual detectors, a label-free loss function with a specially designed regularizer is formed to supervise the training of neural networks towards a meaningful and accurate mapping function. We mathematically demonstrate the existence of the optimal function desired by the method, and give a systematic algorithm for training and calibration of the model. The pr",
    "path": "papers/23/04/2304.11930.json",
    "total_tokens": 902,
    "translated_title": "无标记时间分析模块化核探测器的物理约束深度学习方法",
    "translated_abstract": "脉冲时间是核仪器学中重要的话题，具有从高能物理到辐射成像的广泛应用。尽管高速模数转换器越来越发展和易于使用，但它们在核探测器信号处理中的潜在用途和优点仍不确定，部分原因是相关的时间算法还没有得到充分理解和利用。在本文中，我们提出了一种基于深度学习的新方法，用于模块化核探测器的时间分析，无需对事件数据进行显式的标记。通过利用单个探测器内部时间相关性，形成一个无标记损失函数和一个经过特殊设计的正则化器，以监督神经网络的训练，以获得有意义和准确的映射函数。我们从数学上证明了所需方法的最优函数的存在，并提供了一个系统的算法来训练和校准模型。该方法的应用在核能谱学中表现出较好的效果。",
    "tldr": "该研究描述了一种基于深度学习的新方法，用于模块化核探测器的无标记时间分析，其能够利用单个探测器内部时间相关性，实现有意义和准确的映射函数。",
    "en_tdlr": "This paper proposes a new deep learning method for label-free timing analysis of modularized nuclear detectors that takes advantage of the internal time correlation of individual detectors, and demonstrates mathematical proof of the existence of an optimal function. The approach achieves accurate and meaningful mapping functions without explicit labeling of event data."
}