{
    "title": "MG-ShopDial: A Multi-Goal Conversational Dataset for e-Commerce. (arXiv:2304.12636v1 [cs.IR])",
    "abstract": "Conversational systems can be particularly effective in supporting complex information seeking scenarios with evolving information needs. Finding the right products on an e-commerce platform is one such scenario, where a conversational agent would need to be able to provide search capabilities over the item catalog, understand and make recommendations based on the user's preferences, and answer a range of questions related to items and their usage. Yet, existing conversational datasets do not fully support the idea of mixing different conversational goals (i.e., search, recommendation, and question answering) and instead focus on a single goal. To address this, we introduce MG-ShopDial: a dataset of conversations mixing different goals in the domain of e-commerce. Specifically, we make the following contributions. First, we develop a coached human-human data collection protocol where each dialogue participant is given a set of instructions, instead of a specific script or answers to ch",
    "link": "http://arxiv.org/abs/2304.12636",
    "context": "Title: MG-ShopDial: A Multi-Goal Conversational Dataset for e-Commerce. (arXiv:2304.12636v1 [cs.IR])\nAbstract: Conversational systems can be particularly effective in supporting complex information seeking scenarios with evolving information needs. Finding the right products on an e-commerce platform is one such scenario, where a conversational agent would need to be able to provide search capabilities over the item catalog, understand and make recommendations based on the user's preferences, and answer a range of questions related to items and their usage. Yet, existing conversational datasets do not fully support the idea of mixing different conversational goals (i.e., search, recommendation, and question answering) and instead focus on a single goal. To address this, we introduce MG-ShopDial: a dataset of conversations mixing different goals in the domain of e-commerce. Specifically, we make the following contributions. First, we develop a coached human-human data collection protocol where each dialogue participant is given a set of instructions, instead of a specific script or answers to ch",
    "path": "papers/23/04/2304.12636.json",
    "total_tokens": 795,
    "translated_title": "MG-ShopDial：一种用于电子商务的多目标对话数据集",
    "translated_abstract": "在电子商务平台上寻找合适的产品需要一个能够提供搜索功能、理解用户偏好、提供推荐及回答与商品有关的各种问题的交互式对话系统。然而，已有的对话数据集并没有充分支持混合不同的对话目标（例如搜索、推荐和问答），而是聚焦于单一目标。因此，我们推出了MG-ShopDial：一种电子商务领域混合不同目标对话的数据集。",
    "tldr": "MG-ShopDial是一个用于电子商务的多目标对话数据集，包含超过17k个涉及搜索、推荐及商品相关问题的对话，具有很高的复杂性和多样性。",
    "en_tdlr": "MG-ShopDial is a multi-goal conversational dataset for e-commerce consisting over 17k conversations that involve searching, recommending, and asking questions related to items, contributing to the development of more effective conversational systems in the domain."
}