{
    "title": "DiscoGen: Learning to Discover Gene Regulatory Networks. (arXiv:2304.05823v1 [q-bio.MN])",
    "abstract": "Accurately inferring Gene Regulatory Networks (GRNs) is a critical and challenging task in biology. GRNs model the activatory and inhibitory interactions between genes and are inherently causal in nature. To accurately identify GRNs, perturbational data is required. However, most GRN discovery methods only operate on observational data. Recent advances in neural network-based causal discovery methods have significantly improved causal discovery, including handling interventional data, improvements in performance and scalability. However, applying state-of-the-art (SOTA) causal discovery methods in biology poses challenges, such as noisy data and a large number of samples. Thus, adapting the causal discovery methods is necessary to handle these challenges. In this paper, we introduce DiscoGen, a neural network-based GRN discovery method that can denoise gene expression measurements and handle interventional data. We demonstrate that our model outperforms SOTA neural network-based causal",
    "link": "http://arxiv.org/abs/2304.05823",
    "context": "Title: DiscoGen: Learning to Discover Gene Regulatory Networks. (arXiv:2304.05823v1 [q-bio.MN])\nAbstract: Accurately inferring Gene Regulatory Networks (GRNs) is a critical and challenging task in biology. GRNs model the activatory and inhibitory interactions between genes and are inherently causal in nature. To accurately identify GRNs, perturbational data is required. However, most GRN discovery methods only operate on observational data. Recent advances in neural network-based causal discovery methods have significantly improved causal discovery, including handling interventional data, improvements in performance and scalability. However, applying state-of-the-art (SOTA) causal discovery methods in biology poses challenges, such as noisy data and a large number of samples. Thus, adapting the causal discovery methods is necessary to handle these challenges. In this paper, we introduce DiscoGen, a neural network-based GRN discovery method that can denoise gene expression measurements and handle interventional data. We demonstrate that our model outperforms SOTA neural network-based causal",
    "path": "papers/23/04/2304.05823.json",
    "total_tokens": 865,
    "translated_title": "DiscoGen: 学习发现基因调控网络",
    "translated_abstract": "准确地推断基因调控网络（GRN）是生物学中关键且具有挑战性的任务。GRN模型描述了基因之间的促进和抑制作用，并天然地具有因果关系。为了准确地识别GRN，需要进行干预数据。然而，大多数GRN发现方法只是基于观察数据。最近，基于神经网络的因果发现方法的进步显著改善了因果发现的准确性，包括处理干预数据、改善性能和可伸缩性。然而，在生物学中应用最先进（SOTA）的因果发现方法存在着挑战，例如嘈杂的数据和大量的样本。因此，必须改进因果发现方法来处理这些挑战。在本文中，我们介绍了DiscoGen，它是一种基于神经网络的GRN发现方法，可以去噪基因表达测量数据并处理干预数据。我们证明了我们的模型优于最先进的神经网络因果发现方法。",
    "tldr": "本文中介绍了DiscoGen，它是一种神经网络-based GRN发现方法，可以处理嘈杂的基因表达测量数据并处理干预数据，能够更准确地识别GRN。",
    "en_tdlr": "DiscoGen is a neural network-based gene regulatory network discovery method that can denoise gene expression measurements and handle interventional data, offering improved accuracy in identifying GRNs."
}