{
    "title": "Always Strengthen Your Strengths: A Drift-Aware Incremental Learning Framework for CTR Prediction. (arXiv:2304.09062v1 [cs.IR])",
    "abstract": "Click-through rate (CTR) prediction is of great importance in recommendation systems and online advertising platforms. When served in industrial scenarios, the user-generated data observed by the CTR model typically arrives as a stream. Streaming data has the characteristic that the underlying distribution drifts over time and may recur. This can lead to catastrophic forgetting if the model simply adapts to new data distribution all the time. Also, it's inefficient to relearn distribution that has been occurred. Due to memory constraints and diversity of data distributions in large-scale industrial applications, conventional strategies for catastrophic forgetting such as replay, parameter isolation, and knowledge distillation are difficult to be deployed. In this work, we design a novel drift-aware incremental learning framework based on ensemble learning to address catastrophic forgetting in CTR prediction. With explicit error-based drift detection on streaming data, the framework fur",
    "link": "http://arxiv.org/abs/2304.09062",
    "context": "Title: Always Strengthen Your Strengths: A Drift-Aware Incremental Learning Framework for CTR Prediction. (arXiv:2304.09062v1 [cs.IR])\nAbstract: Click-through rate (CTR) prediction is of great importance in recommendation systems and online advertising platforms. When served in industrial scenarios, the user-generated data observed by the CTR model typically arrives as a stream. Streaming data has the characteristic that the underlying distribution drifts over time and may recur. This can lead to catastrophic forgetting if the model simply adapts to new data distribution all the time. Also, it's inefficient to relearn distribution that has been occurred. Due to memory constraints and diversity of data distributions in large-scale industrial applications, conventional strategies for catastrophic forgetting such as replay, parameter isolation, and knowledge distillation are difficult to be deployed. In this work, we design a novel drift-aware incremental learning framework based on ensemble learning to address catastrophic forgetting in CTR prediction. With explicit error-based drift detection on streaming data, the framework fur",
    "path": "papers/23/04/2304.09062.json",
    "total_tokens": 903,
    "translated_title": "总是增强你的优势: 一种面向CTR预测的漂移感知增量学习框架",
    "translated_abstract": "点击率 (CTR) 预测在推荐系统和在线广告平台中非常重要。在工业场景中使用时，CTR 模型观察到的用户生成数据通常以流的形式到达。流式数据具有随着时间而漂移并可能重现的特性。如果模型仅适应于新数据分布，这可能会导致灾难性遗忘。此外，重复学习已经出现的分布是低效的。由于内存限制和大规模工业应用中数据分布的多样性，传统的灾难性遗忘策略（如重放、参数隔离和知识蒸馏）难以部署。在本研究中，我们基于集成学习设计了一种新的漂移感知增量学习框架，用于解决CTR预测中的灾难性遗忘。通过对流数据进行显式基于误差的漂移检测，该框架可以发现分布漂移并有针对性地学习数据分布漂移。",
    "tldr": "本文提出了一种面向CTR预测的漂移感知增量学习框架。该框架基于集成学习，通过显式的基于误差的漂移检测来解决CTR预测中的灾难性遗忘问题。",
    "en_tdlr": "This paper proposes a drift-aware incremental learning framework for CTR prediction. With explicit error-based drift detection, the framework based on ensemble learning can address catastrophic forgetting in CTR prediction."
}