{
    "title": "Knowledge-refined Denoising Network for Robust Recommendation. (arXiv:2304.14987v1 [cs.IR])",
    "abstract": "Knowledge graph (KG), which contains rich side information, becomes an essential part to boost the recommendation performance and improve its explainability. However, existing knowledge-aware recommendation methods directly perform information propagation on KG and user-item bipartite graph, ignoring the impacts of \\textit{task-irrelevant knowledge propagation} and \\textit{vulnerability to interaction noise}, which limits their performance. To solve these issues, we propose a robust knowledge-aware recommendation framework, called \\textit{Knowledge-refined Denoising Network} (KRDN), to prune the task-irrelevant knowledge associations and noisy implicit feedback simultaneously. KRDN consists of an adaptive knowledge refining strategy and a contrastive denoising mechanism, which are able to automatically distill high-quality KG triplets for aggregation and prune noisy implicit feedback respectively. Besides, we also design the self-adapted loss function and the gradient estimator for mod",
    "link": "http://arxiv.org/abs/2304.14987",
    "context": "Title: Knowledge-refined Denoising Network for Robust Recommendation. (arXiv:2304.14987v1 [cs.IR])\nAbstract: Knowledge graph (KG), which contains rich side information, becomes an essential part to boost the recommendation performance and improve its explainability. However, existing knowledge-aware recommendation methods directly perform information propagation on KG and user-item bipartite graph, ignoring the impacts of \\textit{task-irrelevant knowledge propagation} and \\textit{vulnerability to interaction noise}, which limits their performance. To solve these issues, we propose a robust knowledge-aware recommendation framework, called \\textit{Knowledge-refined Denoising Network} (KRDN), to prune the task-irrelevant knowledge associations and noisy implicit feedback simultaneously. KRDN consists of an adaptive knowledge refining strategy and a contrastive denoising mechanism, which are able to automatically distill high-quality KG triplets for aggregation and prune noisy implicit feedback respectively. Besides, we also design the self-adapted loss function and the gradient estimator for mod",
    "path": "papers/23/04/2304.14987.json",
    "total_tokens": 871,
    "translated_title": "知识精炼去噪网络用于强健推荐",
    "translated_abstract": "知识图谱作为丰富的辅助信息，成为了提升推荐性能和改善可解释性的重要组成部分。然而，现有的知识感知推荐方法直接在知识图谱和用户-物品二分图上执行信息传递，忽略了任务无关知识传播和交互噪声的影响，限制了其性能。为了解决这些问题，我们提出了一个强健的知识感知推荐框架，称为知识精炼去噪网络（KRDN），以同时修剪任务无关的知识关联和噪声隐式反馈。KRDN包括自适应知识精炼策略和对比去噪机制，能够自动收集高质量的知识图谱三元组，并裁剪噪声隐式反馈。此外，我们还设计了自适应损失函数和梯度估计器，用于模型训练。",
    "tldr": "本文提出了一个名为知识精炼去噪网络（KRDN）的强健知识感知推荐框架，可以同时修剪任务无关的知识关联和噪声隐式反馈。"
}