{
    "title": "Temporal Aggregation and Propagation Graph Neural Networks for Dynamic Representation. (arXiv:2304.07503v1 [cs.LG])",
    "abstract": "Temporal graphs exhibit dynamic interactions between nodes over continuous time, whose topologies evolve with time elapsing.  The whole temporal neighborhood of nodes reveals the varying preferences of nodes.  However, previous works usually generate dynamic representation with limited neighbors for simplicity, which results in both inferior performance and high latency of online inference.  Therefore, in this paper, we propose a novel method of temporal graph convolution with the whole neighborhood, namely Temporal Aggregation and Propagation Graph Neural Networks (TAP-GNN).  Specifically, we firstly analyze the computational complexity of the dynamic representation problem by unfolding the temporal graph in a message-passing paradigm.  The expensive complexity motivates us to design the AP (aggregation and propagation) block, which significantly reduces the repeated computation of historical neighbors.  The final TAP-GNN supports online inference in the graph stream scenario, which i",
    "link": "http://arxiv.org/abs/2304.07503",
    "context": "Title: Temporal Aggregation and Propagation Graph Neural Networks for Dynamic Representation. (arXiv:2304.07503v1 [cs.LG])\nAbstract: Temporal graphs exhibit dynamic interactions between nodes over continuous time, whose topologies evolve with time elapsing.  The whole temporal neighborhood of nodes reveals the varying preferences of nodes.  However, previous works usually generate dynamic representation with limited neighbors for simplicity, which results in both inferior performance and high latency of online inference.  Therefore, in this paper, we propose a novel method of temporal graph convolution with the whole neighborhood, namely Temporal Aggregation and Propagation Graph Neural Networks (TAP-GNN).  Specifically, we firstly analyze the computational complexity of the dynamic representation problem by unfolding the temporal graph in a message-passing paradigm.  The expensive complexity motivates us to design the AP (aggregation and propagation) block, which significantly reduces the repeated computation of historical neighbors.  The final TAP-GNN supports online inference in the graph stream scenario, which i",
    "path": "papers/23/04/2304.07503.json",
    "total_tokens": 820,
    "translated_title": "动态表示的时间聚合和传播图神经网络",
    "translated_abstract": "时间图展示了节点之间在连续时间内的动态交互，其拓扑随时间流逝而演变。节点的整个时间邻域显示了节点的变化偏好。然而，为了简化起见，先前的工作通常使用有限的邻居生成动态表示，这导致性能不佳和在线推理延迟高。因此，在本文中，我们提出了一种基于整个邻域的时间图卷积的新方法，即时间聚合和传播图神经网络（TAP-GNN）。具体而言，我们首先通过展开时间图来分析动态表示问题的计算复杂度，使用聚合和传播（AP）块来显著减少历史邻居的重复计算。最终，TAP-GNN支持在图流场景中进行在线推理，既高效又有效地建模动态图中的时间关系。",
    "tldr": "本文提出了 TAP-GNN，通过整个邻域的时间聚合和传播来有效地建模动态图中的时间关系，从而在图流场景中支持高效的在线推理。"
}