{
    "title": "CNN-Assisted Steganography -- Integrating Machine Learning with Established Steganographic Techniques. (arXiv:2304.12503v1 [cs.CR])",
    "abstract": "We propose a method to improve steganography by increasing the resilience of stego-media to discovery through steganalysis. Our approach enhances a class of steganographic approaches through the inclusion of a steganographic assistant convolutional neural network (SA-CNN). Previous research showed success in discovering the presence of hidden information within stego-images using trained neural networks as steganalyzers that are applied to stego-images. Our results show that such steganalyzers are less effective when SA-CNN is employed during the generation of a stego-image. We also explore the advantages and disadvantages of representing all the possible outputs of our SA-CNN within a smaller, discrete space, rather than a continuous space. Our SA-CNN enables certain classes of parametric steganographic algorithms to be customized based on characteristics of the cover media in which information is to be embedded. Thus, SA-CNN is adaptive in the sense that it enables the core steganogr",
    "link": "http://arxiv.org/abs/2304.12503",
    "context": "Title: CNN-Assisted Steganography -- Integrating Machine Learning with Established Steganographic Techniques. (arXiv:2304.12503v1 [cs.CR])\nAbstract: We propose a method to improve steganography by increasing the resilience of stego-media to discovery through steganalysis. Our approach enhances a class of steganographic approaches through the inclusion of a steganographic assistant convolutional neural network (SA-CNN). Previous research showed success in discovering the presence of hidden information within stego-images using trained neural networks as steganalyzers that are applied to stego-images. Our results show that such steganalyzers are less effective when SA-CNN is employed during the generation of a stego-image. We also explore the advantages and disadvantages of representing all the possible outputs of our SA-CNN within a smaller, discrete space, rather than a continuous space. Our SA-CNN enables certain classes of parametric steganographic algorithms to be customized based on characteristics of the cover media in which information is to be embedded. Thus, SA-CNN is adaptive in the sense that it enables the core steganogr",
    "path": "papers/23/04/2304.12503.json",
    "total_tokens": 917,
    "translated_title": "基于CNN的隐写术--将机器学习与传统的隐写技术相结合",
    "translated_abstract": "我们提出一种通过增加隐写分析中的稳健性来提高隐写术的方法。我们的方法通过引入一个隐写辅助卷积神经网络（SA-CNN）来增强一类隐写方法。先前的研究表明，使用训练有素的神经网络作为隐写分析器来发现隐秘信息的存在是成功的，而使用SA-CNN在生成隐写图像时能使这样的隐写分析器的效果不那么明显。我们还探讨了将SA-CNN的所有可能输出表示为较小的离散空间而不是连续空间的优缺点。我们的SA-CNN使得某些参数化隐写算法能够根据要嵌入信息的载体媒体的特征进行定制。因此，SA-CNN是自适应的，它使得核心隐写算法能够根据隐写载体的特性进行自定义。",
    "tldr": "本文提出了一种基于隐写辅助卷积神经网络的隐写方法，能够提高隐写分析的稳健性，并通过SA-CNN的自适应性能够进行核心隐写算法的自定义。",
    "en_tdlr": "This paper proposes a steganographic method utilizing a steganographic assistant convolutional neural network (SA-CNN) to increase the resilience of stego-media to discovery through steganalysis. The SA-CNN allows for parametric steganographic algorithms to be customized based on characteristics of the cover media, and has shown to be less detectable by steganalyzers."
}