{
    "title": "DiscoVars: A New Data Analysis Perspective -- Application in Variable Selection for Clustering. (arXiv:2304.03983v1 [cs.LG])",
    "abstract": "We present a new data analysis perspective to determine variable importance regardless of the underlying learning task. Traditionally, variable selection is considered an important step in supervised learning for both classification and regression problems. The variable selection also becomes critical when costs associated with the data collection and storage are considerably high for cases like remote sensing. Therefore, we propose a new methodology to select important variables from the data by first creating dependency networks among all variables and then ranking them (i.e. nodes) by graph centrality measures. Selecting Top-$n$ variables according to preferred centrality measure will yield a strong candidate subset of variables for further learning tasks e.g. clustering. We present our tool as a Shiny app which is a user-friendly interface development environment. We also extend the user interface for two well-known unsupervised variable selection methods from literature for compar",
    "link": "http://arxiv.org/abs/2304.03983",
    "context": "Title: DiscoVars: A New Data Analysis Perspective -- Application in Variable Selection for Clustering. (arXiv:2304.03983v1 [cs.LG])\nAbstract: We present a new data analysis perspective to determine variable importance regardless of the underlying learning task. Traditionally, variable selection is considered an important step in supervised learning for both classification and regression problems. The variable selection also becomes critical when costs associated with the data collection and storage are considerably high for cases like remote sensing. Therefore, we propose a new methodology to select important variables from the data by first creating dependency networks among all variables and then ranking them (i.e. nodes) by graph centrality measures. Selecting Top-$n$ variables according to preferred centrality measure will yield a strong candidate subset of variables for further learning tasks e.g. clustering. We present our tool as a Shiny app which is a user-friendly interface development environment. We also extend the user interface for two well-known unsupervised variable selection methods from literature for compar",
    "path": "papers/23/04/2304.03983.json",
    "total_tokens": 842,
    "translated_title": "DiscoVars: 一种新的数据分析视角-应用于聚类变量选择",
    "translated_abstract": "我们提出了一种新的数据分析视角来确定变量的重要性，而不考虑底层的学习任务。传统上，无论是分类问题还是回归问题，变量选择都被认为是监督学习的重要步骤。当与数据收集和存储相关的成本相当高时，如遥感数据，变量选择也变得至关重要。因此，我们提出了一种新的方法，通过首先创建所有变量之间的依赖网络，然后通过图中心性度量来排名它们（即节点），从而从数据中选择重要变量。根据首选中心度量选择前n个变量将得到一个强有力的候选变量子集，供进一步学习任务使用，例如聚类。我们将我们的工具展示为Shiny应用程序，这是一个用户友好的接口开发环境。我们还扩展了用户界面，用于两种文献中知名的无监督变量选择方法的比较。",
    "tldr": "DiscoVars是一种新的变量选择方法，它通过创建变量之间的依赖网络并根据图中心性度量排名它们来确定变量的重要性，适用于聚类等学习任务。"
}