{
    "title": "What Does the Indian Parliament Discuss? An Exploratory Analysis of the Question Hour in the Lok Sabha. (arXiv:2304.00235v1 [cs.CL])",
    "abstract": "The TCPD-IPD dataset is a collection of questions and answers discussed in the Lower House of the Parliament of India during the Question Hour between 1999 and 2019. Although it is difficult to analyze such a huge collection manually, modern text analysis tools can provide a powerful means to navigate it. In this paper, we perform an exploratory analysis of the dataset. In particular, we present insightful corpus-level statistics and a detailed analysis of three subsets of the dataset. In the latter analysis, the focus is on understanding the temporal evolution of topics using a dynamic topic model. We observe that the parliamentary conversation indeed mirrors the political and socio-economic tensions of each period.",
    "link": "http://arxiv.org/abs/2304.00235",
    "context": "Title: What Does the Indian Parliament Discuss? An Exploratory Analysis of the Question Hour in the Lok Sabha. (arXiv:2304.00235v1 [cs.CL])\nAbstract: The TCPD-IPD dataset is a collection of questions and answers discussed in the Lower House of the Parliament of India during the Question Hour between 1999 and 2019. Although it is difficult to analyze such a huge collection manually, modern text analysis tools can provide a powerful means to navigate it. In this paper, we perform an exploratory analysis of the dataset. In particular, we present insightful corpus-level statistics and a detailed analysis of three subsets of the dataset. In the latter analysis, the focus is on understanding the temporal evolution of topics using a dynamic topic model. We observe that the parliamentary conversation indeed mirrors the political and socio-economic tensions of each period.",
    "path": "papers/23/04/2304.00235.json",
    "total_tokens": 799,
    "translated_title": "印度议会讨论了什么？Lok Sabha中问题时间的探索性分析。(arXiv:2304.00235v1 [cs.CL])",
    "translated_abstract": "TCPD-IPD数据集是收集了1999年至2019年期间在印度议会下议院问题时间中讨论的问题和答案。虽然手动分析这么庞大的数据集很困难，但现代文本分析工具可以提供有效的导航手段。 在本文中，我们对数据集进行了探究性分析。具体而言，我们提供了有见地的语料库水平统计数据和对数据集的三个子集进行的详细分析。 在后一项分析中，重点是使用动态主题模型理解话题的时间演变。 我们观察到，议会对话确实反映了每个时期的政治和社会经济紧张局势。",
    "tldr": "本文对收集了1999年至2019年期间在印度议会下议院问题时间中讨论的问题和答案的数据集进行了探究性分析，并通过分析显示议会对话反映了不同时期的政治和社会经济紧张局势。",
    "en_tdlr": "This paper performs an exploratory analysis of the TCPD-IPD dataset, which collects questions and answers discussed in the Lower House of the Parliament of India during the Question Hour between 1999 and 2019. The analysis shows that parliamentary conversations indeed mirror the political and socio-economic tensions of each period."
}