{
    "title": "GPT4Rec: A Generative Framework for Personalized Recommendation and User Interests Interpretation. (arXiv:2304.03879v1 [cs.IR])",
    "abstract": "Recent advancements in Natural Language Processing (NLP) have led to the development of NLP-based recommender systems that have shown superior performance. However, current models commonly treat items as mere IDs and adopt discriminative modeling, resulting in limitations of (1) fully leveraging the content information of items and the language modeling capabilities of NLP models; (2) interpreting user interests to improve relevance and diversity; and (3) adapting practical circumstances such as growing item inventories. To address these limitations, we present GPT4Rec, a novel and flexible generative framework inspired by search engines. It first generates hypothetical \"search queries\" given item titles in a user's history, and then retrieves items for recommendation by searching these queries. The framework overcomes previous limitations by learning both user and item embeddings in the language space. To well-capture user interests with different aspects and granularity for improving",
    "link": "http://arxiv.org/abs/2304.03879",
    "context": "Title: GPT4Rec: A Generative Framework for Personalized Recommendation and User Interests Interpretation. (arXiv:2304.03879v1 [cs.IR])\nAbstract: Recent advancements in Natural Language Processing (NLP) have led to the development of NLP-based recommender systems that have shown superior performance. However, current models commonly treat items as mere IDs and adopt discriminative modeling, resulting in limitations of (1) fully leveraging the content information of items and the language modeling capabilities of NLP models; (2) interpreting user interests to improve relevance and diversity; and (3) adapting practical circumstances such as growing item inventories. To address these limitations, we present GPT4Rec, a novel and flexible generative framework inspired by search engines. It first generates hypothetical \"search queries\" given item titles in a user's history, and then retrieves items for recommendation by searching these queries. The framework overcomes previous limitations by learning both user and item embeddings in the language space. To well-capture user interests with different aspects and granularity for improving",
    "path": "papers/23/04/2304.03879.json",
    "total_tokens": 1096,
    "translated_title": "GPT4Rec：一个用于个性化推荐和用户兴趣解释的生成式框架",
    "translated_abstract": "自然语言处理(NLP)的最新进展已经导致了NLP基于推荐系统的发展，已经表现出了优越的性能。然而，目前的模型通常将物品仅视为ID并采用判别性建模，导致了以下限制:(1)无法充分利用物品内容信息和NLP模型的语言建模能力;(2)理解用户兴趣以提高相关性和多样性;(3)适应不断增长的物品库存的实际情况。为了解决这些限制，我们提出了GPT4Rec，这是一个新颖灵活的生成框架，启发自搜索引擎。 它首先生成基于用户历史中物品标题的假设“搜索查询”，然后通过搜索这些查询来检索推荐项。该框架通过在语言空间中学习用户和物品嵌入来克服以前的限制。为了很好地捕捉用户利益的不同方面和粒度以改进个性化推荐，我们引入了一个层次潜在变量模型来解释用户兴趣。 GPT4Rec还通过使用served期间看到的项目标题动态扩展词汇表来适应不断增长的项目库存。 在三个基准数据集上的实验结果证明了GPT4Rec在推荐性能和可解释性方面的有效性。",
    "tldr": "GPT4Rec是一个生成式框架，用于个性化推荐和用户兴趣解释，它通过生成“搜索查询”来充分利用物品内容信息和语言建模能力，并使用层次潜在变量模型来提高个性化推荐的相关性和多样性。",
    "en_tdlr": "GPT4Rec is a generative framework for personalized recommendation and user interests interpretation. It generates \"search queries\" to leverage item content information and language modeling capabilities, and adopts a hierarchical latent variable model to improve recommendations' relevance and diversity based on user interests. The framework also dynamically expands the vocabulary with item titles seen during serving, adapting to growing item inventories."
}