{
    "title": "High Accuracy Uncertainty-Aware Interatomic Force Modeling with Equivariant Bayesian Neural Networks. (arXiv:2304.03694v1 [physics.chem-ph])",
    "abstract": "Even though Bayesian neural networks offer a promising framework for modeling uncertainty, active learning and incorporating prior physical knowledge, few applications of them can be found in the context of interatomic force modeling. One of the main challenges in their application to learning interatomic forces is the lack of suitable Monte Carlo Markov chain sampling algorithms for the posterior density, as the commonly used algorithms do not converge in a practical amount of time for many of the state-of-the-art architectures. As a response to this challenge, we introduce a new Monte Carlo Markov chain sampling algorithm in this paper which can circumvent the problems of the existing sampling methods. In addition, we introduce a new stochastic neural network model based on the NequIP architecture and demonstrate that, when combined with our novel sampling algorithm, we obtain predictions with state-of-the-art accuracy as well as a good measure of uncertainty.",
    "link": "http://arxiv.org/abs/2304.03694",
    "context": "Title: High Accuracy Uncertainty-Aware Interatomic Force Modeling with Equivariant Bayesian Neural Networks. (arXiv:2304.03694v1 [physics.chem-ph])\nAbstract: Even though Bayesian neural networks offer a promising framework for modeling uncertainty, active learning and incorporating prior physical knowledge, few applications of them can be found in the context of interatomic force modeling. One of the main challenges in their application to learning interatomic forces is the lack of suitable Monte Carlo Markov chain sampling algorithms for the posterior density, as the commonly used algorithms do not converge in a practical amount of time for many of the state-of-the-art architectures. As a response to this challenge, we introduce a new Monte Carlo Markov chain sampling algorithm in this paper which can circumvent the problems of the existing sampling methods. In addition, we introduce a new stochastic neural network model based on the NequIP architecture and demonstrate that, when combined with our novel sampling algorithm, we obtain predictions with state-of-the-art accuracy as well as a good measure of uncertainty.",
    "path": "papers/23/04/2304.03694.json",
    "total_tokens": 859,
    "translated_title": "基于等变贝叶斯神经网络的高精度不确定性感知分子间力建模",
    "translated_abstract": "尽管贝叶斯神经网络为建模不确定性、主动学习和结合先前的物理知识提供了一个有前途的框架，但很少有应用于分子间力建模的情况得到发现。其中主要的挑战之一是缺乏适合的MCMC抽样算法来取得后验密度，因为常用算法对许多最先进的架构在实际时间内无法收敛。作为应对这一挑战，我们在本文中引入了一种新的MCMC抽样算法，该算法可以绕过现有抽样方法的问题。此外，我们还介绍了一种基于NequIP体系结构的新型随机神经网络模型，并展示了当其与我们的新型抽样算法结合时，我们可以获得具有最先进的精度和好的不确定度度量的预测。",
    "tldr": "本文引入了一种新的Monte Carlo Markov Chain抽样算法以解决常用算法无法收敛的问题，同时结合了新型随机神经网络模型，可以实现高精度不确定性感知的分子间力建模。",
    "en_tdlr": "This paper introduces a new Monte Carlo Markov chain sampling algorithm to address the convergence issues of commonly used methods in interatomic force modeling, and combines it with a new stochastic neural network model to achieve high accuracy uncertainty-aware interatomic force modeling."
}