{
    "title": "Towards Self-Explainability of Deep Neural Networks with Heatmap Captioning and Large-Language Models. (arXiv:2304.02202v1 [cs.CV])",
    "abstract": "Heatmaps are widely used to interpret deep neural networks, particularly for computer vision tasks, and the heatmap-based explainable AI (XAI) techniques are a well-researched topic. However, most studies concentrate on enhancing the quality of the generated heatmap or discovering alternate heatmap generation techniques, and little effort has been devoted to making heatmap-based XAI automatic, interactive, scalable, and accessible. To address this gap, we propose a framework that includes two modules: (1) context modelling and (2) reasoning. We proposed a template-based image captioning approach for context modelling to create text-based contextual information from the heatmap and input data. The reasoning module leverages a large language model to provide explanations in combination with specialised knowledge. Our qualitative experiments demonstrate the effectiveness of our framework and heatmap captioning approach. The code for the proposed template-based heatmap captioning approach ",
    "link": "http://arxiv.org/abs/2304.02202",
    "context": "Title: Towards Self-Explainability of Deep Neural Networks with Heatmap Captioning and Large-Language Models. (arXiv:2304.02202v1 [cs.CV])\nAbstract: Heatmaps are widely used to interpret deep neural networks, particularly for computer vision tasks, and the heatmap-based explainable AI (XAI) techniques are a well-researched topic. However, most studies concentrate on enhancing the quality of the generated heatmap or discovering alternate heatmap generation techniques, and little effort has been devoted to making heatmap-based XAI automatic, interactive, scalable, and accessible. To address this gap, we propose a framework that includes two modules: (1) context modelling and (2) reasoning. We proposed a template-based image captioning approach for context modelling to create text-based contextual information from the heatmap and input data. The reasoning module leverages a large language model to provide explanations in combination with specialised knowledge. Our qualitative experiments demonstrate the effectiveness of our framework and heatmap captioning approach. The code for the proposed template-based heatmap captioning approach ",
    "path": "papers/23/04/2304.02202.json",
    "total_tokens": 943,
    "translated_title": "用热力图字幕和大语言模型实现深度神经网络自解释性的探索",
    "translated_abstract": "热力图在解释深度神经网络中得到了广泛应用，特别是在计算机视觉任务中，基于热力图的可解释AI技术是一个经过深入研究的课题。然而，大多数研究都集中于提高生成热力图的质量或发现替代热力图生成技术，而很少有人付出努力使基于热力图的可解释AI自动化、交互式、可扩展、易于访问。为了填补这一空白，我们提出了一个包括两个模块的框架：(1) 上下文建模和(2) 推理。我们提出了一种基于模板的图像字幕方法来进行上下文建模，从热力图和输入数据生成基于文本的上下文信息。推理模块利用大型语言模型结合专业知识提供解释。我们的定性实验证明了我们框架和热力图字幕方法的有效性。所提出的基于模板的热力图字幕方法的代码已在网上公开。",
    "tldr": "本文提出了一个框架，结合模板图像字幕技术和大型语言模型，实现了深度神经网络的自解释性，填补了基于热力图的可解释AI自动化、交互式、可扩展、易于访问的空白。",
    "en_tdlr": "This paper proposes a framework that combines template-based image captioning and large-language models to achieve self-explainability of deep neural networks, filling the gap in automated, interactive, scalable, and accessible heatmap-based explainable AI."
}