{
    "title": "An embedding for EEG signals learned using a triplet loss. (arXiv:2304.06495v1 [eess.SP])",
    "abstract": "Neurophysiological time series recordings like the electroencephalogram (EEG) or local field potentials are obtained from multiple sensors. They can be decoded by machine learning models in order to estimate the ongoing brain state of a patient or healthy user. In a brain-computer interface (BCI), this decoded brain state information can be used with minimal time delay to either control an application, e.g., for communication or for rehabilitation after stroke, or to passively monitor the ongoing brain state of the subject, e.g., in a demanding work environment. A specific challenge in such decoding tasks is posed by the small dataset sizes in BCI compared to other domains of machine learning like computer vision or natural language processing. A possibility to tackle classification or regression problems in BCI despite small training data sets is through transfer learning, which utilizes data from other sessions, subjects or even datasets to train a model. In this exploratory study, w",
    "link": "http://arxiv.org/abs/2304.06495",
    "context": "Title: An embedding for EEG signals learned using a triplet loss. (arXiv:2304.06495v1 [eess.SP])\nAbstract: Neurophysiological time series recordings like the electroencephalogram (EEG) or local field potentials are obtained from multiple sensors. They can be decoded by machine learning models in order to estimate the ongoing brain state of a patient or healthy user. In a brain-computer interface (BCI), this decoded brain state information can be used with minimal time delay to either control an application, e.g., for communication or for rehabilitation after stroke, or to passively monitor the ongoing brain state of the subject, e.g., in a demanding work environment. A specific challenge in such decoding tasks is posed by the small dataset sizes in BCI compared to other domains of machine learning like computer vision or natural language processing. A possibility to tackle classification or regression problems in BCI despite small training data sets is through transfer learning, which utilizes data from other sessions, subjects or even datasets to train a model. In this exploratory study, w",
    "path": "papers/23/04/2304.06495.json",
    "total_tokens": 1151,
    "translated_title": "一种使用三元组损失学习的EEG信号嵌入",
    "translated_abstract": "类似于脑电图（EEG）或局部场电位的神经生理时间序列记录来自多个传感器。它们可以被机器学习模型解码，以估计患者或健康用户的正在进行的脑状态。在脑机接口（BCI）中，这种解码的脑状态信息可以用于控制应用程序，例如通信或中风后康复，或者被动监测受试者的正在进行的脑状态，例如在苛刻的工作环境中。这种解码任务所面临的一个特殊挑战是BCI中相对于计算机视觉或自然语言处理等其他机器学习领域的小数据集大小。在BCI中解决分类或回归问题的一种可能性是通过迁移学习，该方法利用来自其他会话、主题甚至数据集的数据来训练模型。在这项探索性研究中，为了使脑机接口中的神经生理时间序列数据具备迁移学习的能力，我们提出了一种基于三元组损失的神经嵌入学习方法用于EEG信号。我们的方法利用无监督学习直接学习EEG信号的低维度和可转移表示。我们在公开可用的EEG数据集上评估了我们的方法，并表明我们学习的嵌入可以在不同的患者、同一患者的不同会话甚至不同EEG数据集之间转移，在基准方法上表现优异。",
    "tldr": "本文提出了一种使用三元组损失学习的EEG信号嵌入方法，通过无监督学习直接学习EEG信号的低维度和可转移表示，并在公开的EEG数据集上表现出优异的迁移能力。",
    "en_tdlr": "This article proposes an approach called triplet loss-based neural embedding learning to learn low-dimensional and transferable representation of EEG signals using unsupervised learning. The study shows that the learned embeddings are transferable across different patients, even different EEG datasets, and outperform baseline methods."
}