{
    "title": "WYTIWYR: A User Intent-Aware Framework with Multi-modal Inputs for Visualization Retrieval. (arXiv:2304.06991v1 [cs.IR])",
    "abstract": "Retrieving charts from a large corpus is a fundamental task that can benefit numerous applications such as visualization recommendations.The retrieved results are expected to conform to both explicit visual attributes (e.g., chart type, colormap) and implicit user intents (e.g., design style, context information) that vary upon application scenarios. However, existing example-based chart retrieval methods are built upon non-decoupled and low-level visual features that are hard to interpret, while definition-based ones are constrained to pre-defined attributes that are hard to extend. In this work, we propose a new framework, namely WYTIWYR (What-You-Think-Is-What-You-Retrieve), that integrates user intents into the chart retrieval process. The framework consists of two stages: first, the Annotation stage disentangles the visual attributes within the bitmap query chart; and second, the Retrieval stage embeds the user's intent with customized text prompt as well as query chart, to recall",
    "link": "http://arxiv.org/abs/2304.06991",
    "context": "Title: WYTIWYR: A User Intent-Aware Framework with Multi-modal Inputs for Visualization Retrieval. (arXiv:2304.06991v1 [cs.IR])\nAbstract: Retrieving charts from a large corpus is a fundamental task that can benefit numerous applications such as visualization recommendations.The retrieved results are expected to conform to both explicit visual attributes (e.g., chart type, colormap) and implicit user intents (e.g., design style, context information) that vary upon application scenarios. However, existing example-based chart retrieval methods are built upon non-decoupled and low-level visual features that are hard to interpret, while definition-based ones are constrained to pre-defined attributes that are hard to extend. In this work, we propose a new framework, namely WYTIWYR (What-You-Think-Is-What-You-Retrieve), that integrates user intents into the chart retrieval process. The framework consists of two stages: first, the Annotation stage disentangles the visual attributes within the bitmap query chart; and second, the Retrieval stage embeds the user's intent with customized text prompt as well as query chart, to recall",
    "path": "papers/23/04/2304.06991.json",
    "total_tokens": 908,
    "translated_title": "WYTIWYR:一种基于多模态输入和用户意图感知的可视化检索框架",
    "translated_abstract": "在大量语料库中检索图表是一项基本任务，可以惠及众多应用，如可视化推荐。检索结果应符合显式的视觉属性（例如图表类型、色图）和隐含的用户意图（例如设计风格、上下文信息），这些意图根据应用场景而异。然而，现有的基于示例的图表检索方法是建立在难以解释的非解耦合和低级别视觉特征上的，而基于定义的方法受到预定义属性的限制，难以扩展。在本文中，我们提出了一种新的框架，即WYTIWYR（What-You-Think-Is-What-You-Retrieve），将用户意图整合到图表检索过程中。该框架分为两个阶段：首先，注释阶段将位图查询图表中的视觉属性进行解耦；其次，检索阶段通过定制的文本提示和查询图表嵌入用户的意图，以提取图表。",
    "tldr": "WYTIWYR框架是一个基于多模态输入和用户意图感知的可视化检索工具，通过分为两阶段——解耦视觉属性和嵌入用户意图——来实现图表的个性化检索。",
    "en_tdlr": "WYTIWYR is a visualization retrieval framework that integrates user intents into the process, using multi-modal inputs and a two-stage approach of disentangling visual attributes and embedding user intent with text prompts and query charts, enabling personalized chart retrieval."
}