{
    "title": "Activity Classification Using Unsupervised Domain Transfer from Body Worn Sensors. (arXiv:2304.10643v1 [cs.LG])",
    "abstract": "Activity classification has become a vital feature of wearable health tracking devices. As innovation in this field grows, wearable devices worn on different parts of the body are emerging. To perform activity classification on a new body location, labeled data corresponding to the new locations are generally required, but this is expensive to acquire. In this work, we present an innovative method to leverage an existing activity classifier, trained on Inertial Measurement Unit (IMU) data from a reference body location (the source domain), in order to perform activity classification on a new body location (the target domain) in an unsupervised way, i.e. without the need for classification labels at the new location. Specifically, given an IMU embedding model trained to perform activity classification at the source domain, we train an embedding model to perform activity classification at the target domain by replicating the embeddings at the source domain. This is achieved using simulta",
    "link": "http://arxiv.org/abs/2304.10643",
    "context": "Title: Activity Classification Using Unsupervised Domain Transfer from Body Worn Sensors. (arXiv:2304.10643v1 [cs.LG])\nAbstract: Activity classification has become a vital feature of wearable health tracking devices. As innovation in this field grows, wearable devices worn on different parts of the body are emerging. To perform activity classification on a new body location, labeled data corresponding to the new locations are generally required, but this is expensive to acquire. In this work, we present an innovative method to leverage an existing activity classifier, trained on Inertial Measurement Unit (IMU) data from a reference body location (the source domain), in order to perform activity classification on a new body location (the target domain) in an unsupervised way, i.e. without the need for classification labels at the new location. Specifically, given an IMU embedding model trained to perform activity classification at the source domain, we train an embedding model to perform activity classification at the target domain by replicating the embeddings at the source domain. This is achieved using simulta",
    "path": "papers/23/04/2304.10643.json",
    "total_tokens": 818,
    "translated_title": "通过无监督域转移从体戴式传感器中进行活动分类",
    "translated_abstract": "活动分类已经成为可穿戴健康追踪设备的重要特征。随着这个领域的创新不断增长，佩戴在身体不同部位的可穿戴设备正在出现。要对新的身体部位进行活动分类，通常需要相应新位置的标记数据，但这样做的成本很高。在这项工作中，我们提出了一种创新的方法，利用已经在参考身体位置（源域）上从惯性测量单元（IMU）数据训练好的活动分类器，以无监督的方式在新的身体位置（目标域）上进行活动分类，即无需在新位置使用分类标签。具体而言，通过复制源域的嵌入，我们训练一个嵌入模型，以在目标域执行活动分类。",
    "tldr": "该论文提出了一种从已有分类模型转移学习的方法，在无需标记数据的情况下在新的身体部位上实现活动分类。",
    "en_tdlr": "This paper proposes an innovative unsupervised domain transfer method to perform activity classification on a new body location without the need for classification labels, by leveraging the existing activity classifier trained on IMU data from a reference body location and replicating the embeddings at the source domain."
}