{
    "title": "Anomalous Sound Detection using Audio Representation with Machine ID based Contrastive Learning Pretraining. (arXiv:2304.03588v1 [cs.SD])",
    "abstract": "Existing contrastive learning methods for anomalous sound detection refine the audio representation of each audio sample by using the contrast between the samples' augmentations (e.g., with time or frequency masking). However, they might be biased by the augmented data, due to the lack of physical properties of machine sound, thereby limiting the detection performance. This paper uses contrastive learning to refine audio representations for each machine ID, rather than for each audio sample. The proposed two-stage method uses contrastive learning to pretrain the audio representation model by incorporating machine ID and a self-supervised ID classifier to fine-tune the learnt model, while enhancing the relation between audio features from the same ID. Experiments show that our method outperforms the state-of-the-art methods using contrastive learning or self-supervised classification in overall anomaly detection performance and stability on DCASE 2020 Challenge Task2 dataset.",
    "link": "http://arxiv.org/abs/2304.03588",
    "context": "Title: Anomalous Sound Detection using Audio Representation with Machine ID based Contrastive Learning Pretraining. (arXiv:2304.03588v1 [cs.SD])\nAbstract: Existing contrastive learning methods for anomalous sound detection refine the audio representation of each audio sample by using the contrast between the samples' augmentations (e.g., with time or frequency masking). However, they might be biased by the augmented data, due to the lack of physical properties of machine sound, thereby limiting the detection performance. This paper uses contrastive learning to refine audio representations for each machine ID, rather than for each audio sample. The proposed two-stage method uses contrastive learning to pretrain the audio representation model by incorporating machine ID and a self-supervised ID classifier to fine-tune the learnt model, while enhancing the relation between audio features from the same ID. Experiments show that our method outperforms the state-of-the-art methods using contrastive learning or self-supervised classification in overall anomaly detection performance and stability on DCASE 2020 Challenge Task2 dataset.",
    "path": "papers/23/04/2304.03588.json",
    "total_tokens": 872,
    "translated_title": "使用基于机器ID的对比学习预训练的音频表示进行异常声音检测",
    "translated_abstract": "现有的用于异常声音检测的对比学习方法通过利用样本增强的对比来精炼每个音频样本的音频表示。然而，由于缺乏机器声音的物理特性，它们可能会受到增强数据的偏差，从而限制检测性能。本文使用对比学习来精炼每个机器ID的音频表示，而不是每个音频样本。提出的两阶段方法使用对比学习来预训练音频表示模型，通过融入机器ID和自监督ID分类器来对学习的模型进行微调，同时增强来自相同ID的音频特征之间的关系。实验证明，我们的方法在DCASE 2020挑战任务2数据集上的整体异常检测性能和稳定性方面优于基于对比学习或自监督分类的最先进方法。",
    "tldr": "本文提出了一种使用基于机器ID的对比学习预训练的音频表示来进行异常声音检测的方法，在DCASE 2020 Challenge Task2 数据集上表现优于目前最先进的基于对比学习或自监督分类的方法。"
}