{
    "title": "Goal-oriented Uncertainty Quantification for Inverse Problems via Variational Encoder-Decoder Networks. (arXiv:2304.08324v2 [math.NA] UPDATED)",
    "abstract": "In this work, we describe a new approach that uses variational encoder-decoder (VED) networks for efficient goal-oriented uncertainty quantification for inverse problems. Contrary to standard inverse problems, these approaches are \\emph{goal-oriented} in that the goal is to estimate some quantities of interest (QoI) that are functions of the solution of an inverse problem, rather than the solution itself. Moreover, we are interested in computing uncertainty metrics associated with the QoI, thus utilizing a Bayesian approach for inverse problems that incorporates the prediction operator and techniques for exploring the posterior. This may be particularly challenging, especially for nonlinear, possibly unknown, operators and nonstandard prior assumptions. We harness recent advances in machine learning, i.e., VED networks, to describe a data-driven approach to large-scale inverse problems. This enables a real-time goal-oriented uncertainty quantification for the QoI. One of the advantages",
    "link": "http://arxiv.org/abs/2304.08324",
    "context": "Title: Goal-oriented Uncertainty Quantification for Inverse Problems via Variational Encoder-Decoder Networks. (arXiv:2304.08324v2 [math.NA] UPDATED)\nAbstract: In this work, we describe a new approach that uses variational encoder-decoder (VED) networks for efficient goal-oriented uncertainty quantification for inverse problems. Contrary to standard inverse problems, these approaches are \\emph{goal-oriented} in that the goal is to estimate some quantities of interest (QoI) that are functions of the solution of an inverse problem, rather than the solution itself. Moreover, we are interested in computing uncertainty metrics associated with the QoI, thus utilizing a Bayesian approach for inverse problems that incorporates the prediction operator and techniques for exploring the posterior. This may be particularly challenging, especially for nonlinear, possibly unknown, operators and nonstandard prior assumptions. We harness recent advances in machine learning, i.e., VED networks, to describe a data-driven approach to large-scale inverse problems. This enables a real-time goal-oriented uncertainty quantification for the QoI. One of the advantages",
    "path": "papers/23/04/2304.08324.json",
    "total_tokens": 870,
    "translated_title": "目标导向变分编码器-解码器网络用于反问题的不确定性量化方法",
    "translated_abstract": "在这项工作中，我们描述了一种使用变分编码器-解码器（VED）网络的新方法，用于高效的目标导向反问题不确定性量化。与标准的逆问题不同，这些方法是“目标导向”的，目标是估计与逆问题的解的函数有关的一些感兴趣量（QoI），而不是解本身。此外，我们对计算与QoI相关的不确定性指标感兴趣，因此利用基于贝叶斯的逆问题方法，包括预测算子和探索后验的技术。这可能特别具有挑战性，尤其是对于非线性、可能未知的算子和非标准的先验假设。我们利用机器学习的最新进展，即VED网络，来描述基于数据驱动的大规模逆问题方法。这使得对QoI进行实时的目标导向不确定性量化成为可能。",
    "tldr": "本文提出了一种使用变分编码器-解码器网络进行目标导向反问题不确定性量化的新方法。通过利用数据驱动的方式，可以实时估计和计算与逆问题解相关的感兴趣量的不确定性指标。",
    "en_tdlr": "This paper proposes a new approach, using variational encoder-decoder networks, for goal-oriented uncertainty quantification in inverse problems. By utilizing a data-driven method, it enables real-time estimation and computation of uncertainty metrics associated with the solution of the inverse problem."
}