{
    "title": "Differentiate ChatGPT-generated and Human-written Medical Texts. (arXiv:2304.11567v1 [cs.CL])",
    "abstract": "Background: Large language models such as ChatGPT are capable of generating grammatically perfect and human-like text content, and a large number of ChatGPT-generated texts have appeared on the Internet. However, medical texts such as clinical notes and diagnoses require rigorous validation, and erroneous medical content generated by ChatGPT could potentially lead to disinformation that poses significant harm to healthcare and the general public.  Objective: This research is among the first studies on responsible and ethical AIGC (Artificial Intelligence Generated Content) in medicine. We focus on analyzing the differences between medical texts written by human experts and generated by ChatGPT, and designing machine learning workflows to effectively detect and differentiate medical texts generated by ChatGPT.  Methods: We first construct a suite of datasets containing medical texts written by human experts and generated by ChatGPT. In the next step, we analyze the linguistic features o",
    "link": "http://arxiv.org/abs/2304.11567",
    "context": "Title: Differentiate ChatGPT-generated and Human-written Medical Texts. (arXiv:2304.11567v1 [cs.CL])\nAbstract: Background: Large language models such as ChatGPT are capable of generating grammatically perfect and human-like text content, and a large number of ChatGPT-generated texts have appeared on the Internet. However, medical texts such as clinical notes and diagnoses require rigorous validation, and erroneous medical content generated by ChatGPT could potentially lead to disinformation that poses significant harm to healthcare and the general public.  Objective: This research is among the first studies on responsible and ethical AIGC (Artificial Intelligence Generated Content) in medicine. We focus on analyzing the differences between medical texts written by human experts and generated by ChatGPT, and designing machine learning workflows to effectively detect and differentiate medical texts generated by ChatGPT.  Methods: We first construct a suite of datasets containing medical texts written by human experts and generated by ChatGPT. In the next step, we analyze the linguistic features o",
    "path": "papers/23/04/2304.11567.json",
    "total_tokens": 868,
    "translated_title": "区分ChatGPT生成和人写的医学文本",
    "translated_abstract": "背景：像ChatGPT这样的大型语言模型可以生成语法完美、类似人类文本内容的大量文本。然而，临床病历和诊断等医学文本需要严格的验证，由ChatGPT生成的错误医学内容可能导致假消息，从而对医疗保健和公众造成重大危害。目的：本研究是关于医疗领域负责和道德的人工智能生成内容的第一项研究。我们专注于分析由人类专家撰写的医学文本和由ChatGPT生成的文本之间的差异，并设计机器学习工作流来有效地检测和区分由ChatGPT生成的医学文本。方法：我们首先构建了一套包含人类专家撰写和由ChatGPT生成的医学文本的数据集合。接着，我们分析了这些文本的语言特征。",
    "tldr": "本研究旨在区分由ChatGPT生成和人类撰写的医学文本，并通过设计机器学习工作流来有效检测医学领域的人工智能生成内容，以避免可能导致的假消息和对公众造成的损害。",
    "en_tdlr": "This research aims to differentiate medical texts generated by ChatGPT and those written by human experts, and to effectively detect AI-generated content in the medical field through machine learning workflows to avoid potential disinformation and harm to the public."
}