{
    "title": "Inductive Graph Unlearning. (arXiv:2304.03093v1 [cs.LG])",
    "abstract": "As a way to implement the \"right to be forgotten\" in machine learning, \\textit{machine unlearning} aims to completely remove the contributions and information of the samples to be deleted from a trained model without affecting the contributions of other samples. Recently, many frameworks for machine unlearning have been proposed, and most of them focus on image and text data. To extend machine unlearning to graph data, \\textit{GraphEraser} has been proposed. However, a critical issue is that \\textit{GraphEraser} is specifically designed for the transductive graph setting, where the graph is static and attributes and edges of test nodes are visible during training. It is unsuitable for the inductive setting, where the graph could be dynamic and the test graph information is invisible in advance. Such inductive capability is essential for production machine learning systems with evolving graphs like social media and transaction networks. To fill this gap, we propose the \\underline{{\\bf G",
    "link": "http://arxiv.org/abs/2304.03093",
    "context": "Title: Inductive Graph Unlearning. (arXiv:2304.03093v1 [cs.LG])\nAbstract: As a way to implement the \"right to be forgotten\" in machine learning, \\textit{machine unlearning} aims to completely remove the contributions and information of the samples to be deleted from a trained model without affecting the contributions of other samples. Recently, many frameworks for machine unlearning have been proposed, and most of them focus on image and text data. To extend machine unlearning to graph data, \\textit{GraphEraser} has been proposed. However, a critical issue is that \\textit{GraphEraser} is specifically designed for the transductive graph setting, where the graph is static and attributes and edges of test nodes are visible during training. It is unsuitable for the inductive setting, where the graph could be dynamic and the test graph information is invisible in advance. Such inductive capability is essential for production machine learning systems with evolving graphs like social media and transaction networks. To fill this gap, we propose the \\underline{{\\bf G",
    "path": "papers/23/04/2304.03093.json",
    "total_tokens": 918,
    "translated_title": "归纳式图形反学习",
    "translated_abstract": "“机器反学习”是机器学习实现“被遗忘权”的方法，旨在完全删除要删除的样本对经过训练的模型的贡献和信息，同时不影响其他样本的贡献。近年来，许多反学习框架已被提出，其中大部分专注于图像和文本数据。为了将反学习扩展到图形数据，已经提出了GraphEraser。然而，一个关键的问题是GraphEraser专门针对转移图设定进行设计，在该设定下，图形是静态的，测试节点的属性和边缘在训练期间是可见的。对于归纳式的设置是不合适的，在此设置中，图形可以是动态的，测试图形信息事先是不可见的。这种归纳能力对于具有不断发展的图形（如社交媒体和交易网络）的生产机器学习系统至关重要。为了填补这一空白，我们提出了G...",
    "tldr": "本论文介绍了针对图形数据的反学习，旨在实现机器学习中的“被遗忘权”，与其他框架相比，提出了一个新颖的归纳式框架。这个框架可以让机器学习系统在处理动态改变的图形时更具有适应性。"
}