{
    "title": "Meta-causal Learning for Single Domain Generalization. (arXiv:2304.03709v1 [cs.CV])",
    "abstract": "Single domain generalization aims to learn a model from a single training domain (source domain) and apply it to multiple unseen test domains (target domains). Existing methods focus on expanding the distribution of the training domain to cover the target domains, but without estimating the domain shift between the source and target domains. In this paper, we propose a new learning paradigm, namely simulate-analyze-reduce, which first simulates the domain shift by building an auxiliary domain as the target domain, then learns to analyze the causes of domain shift, and finally learns to reduce the domain shift for model adaptation. Under this paradigm, we propose a meta-causal learning method to learn meta-knowledge, that is, how to infer the causes of domain shift between the auxiliary and source domains during training. We use the meta-knowledge to analyze the shift between the target and source domains during testing. Specifically, we perform multiple transformations on source data t",
    "link": "http://arxiv.org/abs/2304.03709",
    "context": "Title: Meta-causal Learning for Single Domain Generalization. (arXiv:2304.03709v1 [cs.CV])\nAbstract: Single domain generalization aims to learn a model from a single training domain (source domain) and apply it to multiple unseen test domains (target domains). Existing methods focus on expanding the distribution of the training domain to cover the target domains, but without estimating the domain shift between the source and target domains. In this paper, we propose a new learning paradigm, namely simulate-analyze-reduce, which first simulates the domain shift by building an auxiliary domain as the target domain, then learns to analyze the causes of domain shift, and finally learns to reduce the domain shift for model adaptation. Under this paradigm, we propose a meta-causal learning method to learn meta-knowledge, that is, how to infer the causes of domain shift between the auxiliary and source domains during training. We use the meta-knowledge to analyze the shift between the target and source domains during testing. Specifically, we perform multiple transformations on source data t",
    "path": "papers/23/04/2304.03709.json",
    "total_tokens": 940,
    "translated_abstract": "单域泛化旨在从单个训练域（源域）学习模型，并将其应用于多个未见过的测试域（目标域）。现有方法着重于扩展训练域的分布以覆盖目标域，但未估计源域和目标域之间的领域偏移。在本文中，我们提出了一种新的学习范式，即模拟-分析-减少，首先通过构建辅助域为目标域模拟领域偏移，然后学习分析领域偏移的原因，最后学习减少领域偏移以进行模型自适应。在这个范式下，我们提出了一种元因果学习方法来学习元知识，即如何在训练期间推断辅助和源域之间的领域偏移原因。我们使用元知识在测试期间分析目标域和源域之间的偏移。具体而言，我们对源数据进行多个转换来实现域适应。",
    "tldr": "本文提出了一种新的单域泛化学习范式，通过构建辅助域模拟领域偏移，学习分析领域偏移的原因，最后学习减少领域偏移以进行模型自适应，使用元因果学习方法推断领域偏移原因，实现域适应。",
    "en_tdlr": "This paper proposes a new learning paradigm for single domain generalization, which simulates domain shift, analyzes causes of domain shift, and reduces domain shift for model adaptation. The meta-causal learning method is used to infer the causes of domain shift and achieve domain adaptation."
}