{
    "title": "A Self-attention Knowledge Domain Adaptation Network for Commercial Lithium-ion Batteries State-of-health Estimation under Shallow Cycles. (arXiv:2304.05084v1 [cs.LG])",
    "abstract": "Accurate state-of-health (SOH) estimation is critical to guarantee the safety, efficiency and reliability of battery-powered applications. Most SOH estimation methods focus on the 0-100\\% full state-of-charge (SOC) range that has similar distributions. However, the batteries in real-world applications usually work in the partial SOC range under shallow-cycle conditions and follow different degradation profiles with no labeled data available, thus making SOH estimation challenging. To estimate shallow-cycle battery SOH, a novel unsupervised deep transfer learning method is proposed to bridge different domains using self-attention distillation module and multi-kernel maximum mean discrepancy technique. The proposed method automatically extracts domain-variant features from charge curves to transfer knowledge from the large-scale labeled full cycles to the unlabeled shallow cycles. The CALCE and SNL battery datasets are employed to verify the effectiveness of the proposed method to estima",
    "link": "http://arxiv.org/abs/2304.05084",
    "context": "Title: A Self-attention Knowledge Domain Adaptation Network for Commercial Lithium-ion Batteries State-of-health Estimation under Shallow Cycles. (arXiv:2304.05084v1 [cs.LG])\nAbstract: Accurate state-of-health (SOH) estimation is critical to guarantee the safety, efficiency and reliability of battery-powered applications. Most SOH estimation methods focus on the 0-100\\% full state-of-charge (SOC) range that has similar distributions. However, the batteries in real-world applications usually work in the partial SOC range under shallow-cycle conditions and follow different degradation profiles with no labeled data available, thus making SOH estimation challenging. To estimate shallow-cycle battery SOH, a novel unsupervised deep transfer learning method is proposed to bridge different domains using self-attention distillation module and multi-kernel maximum mean discrepancy technique. The proposed method automatically extracts domain-variant features from charge curves to transfer knowledge from the large-scale labeled full cycles to the unlabeled shallow cycles. The CALCE and SNL battery datasets are employed to verify the effectiveness of the proposed method to estima",
    "path": "papers/23/04/2304.05084.json",
    "total_tokens": 1051,
    "translated_title": "自我关注知识领域适应网络：浅循环下商用锂离子电池健康状态估计 (arXiv:2304.05084v1 [cs.LG])",
    "translated_abstract": "准确的健康状态（SOH）估计对于确保电池供电应用的安全性，效率和可靠性至关重要。大多数SOH估计方法关注具有相似分布的0-100％满充状态（SOC）范围。然而，在现实世界的应用中，电池通常在部分SOC范围内在浅循环条件下工作，并遵循不同的退化曲线，没有可用的标记数据，因此使SOH估计变得具有挑战性。为了估计浅循环电池的SOH，提出了一种新颖的无监督深度迁移学习方法，使用自我关注蒸馏模块和多核最大均值差异技术来跨越不同领域的鸿沟。本方法自动从充电曲线中提取领域特定功能，以将知识从大规模标记的完整循环转移到未标记的浅循环。使用CALCE和SNL电池数据集验证了所提出的方法估计浅循环电池SOH的有效性。",
    "tldr": "提出了一种无监督深度迁移学习方法，使用自我关注蒸馏模块和多核最大均值差异技术来跨越不同领域的鸿沟，自动从充电曲线中提取领域特定功能，并成功地将知识从大规模标记的完整循环转移到未标记的浅循环，实现了对商用锂离子电池健康状态的准确估计。"
}