{
    "title": "Controlling keywords and their positions in text generation. (arXiv:2304.09516v1 [cs.CL])",
    "abstract": "One of the challenges in text generation is to control generation as intended by a user. Previous studies have proposed to specify the keywords that should be included in the generated text. However, this is insufficient to generate text which reflect the user intent. For example, placing the important keyword beginning of the text would helps attract the reader's attention, but existing methods do not enable such flexible control. In this paper, we tackle a novel task of controlling not only keywords but also the position of each keyword in the text generation. To this end, we show that a method using special tokens can control the relative position of keywords. Experimental results on summarization and story generation tasks show that the proposed method can control keywords and their positions. We also demonstrate that controlling the keyword positions can generate summary texts that are closer to the user's intent than baseline. We release our code.",
    "link": "http://arxiv.org/abs/2304.09516",
    "context": "Title: Controlling keywords and their positions in text generation. (arXiv:2304.09516v1 [cs.CL])\nAbstract: One of the challenges in text generation is to control generation as intended by a user. Previous studies have proposed to specify the keywords that should be included in the generated text. However, this is insufficient to generate text which reflect the user intent. For example, placing the important keyword beginning of the text would helps attract the reader's attention, but existing methods do not enable such flexible control. In this paper, we tackle a novel task of controlling not only keywords but also the position of each keyword in the text generation. To this end, we show that a method using special tokens can control the relative position of keywords. Experimental results on summarization and story generation tasks show that the proposed method can control keywords and their positions. We also demonstrate that controlling the keyword positions can generate summary texts that are closer to the user's intent than baseline. We release our code.",
    "path": "papers/23/04/2304.09516.json",
    "total_tokens": 805,
    "translated_title": "控制文本生成中的关键词和位置",
    "translated_abstract": "文本生成中的挑战之一是按照用户意图控制生成结果。之前的研究提出了指定应包含在生成文本中的关键词的方法。然而，这还不足以生成反映用户意图的文本。例如，将重要关键词放在文本开头有助于吸引读者的注意力，但现有方法不允许这种灵活的控制。在本文中，我们解决了控制文本生成中关键词和其位置的新任务。为此，我们展示了一种使用特殊标记的方法，可以控制关键词的相对位置。摘要生成和故事生成实验结果表明，所提出的方法可以控制关键词及其位置。我们还证明，控制关键词位置可以生成比基线更符合用户意图的摘要文本。我们公开了我们的代码。",
    "tldr": "本文研究了一种控制文本生成中关键词及其位置的新方法，通过使用特殊标记控制关键词相对位置，可以生成更符合用户意图的文本。",
    "en_tdlr": "This paper proposes a novel method to control both the keywords and their positions in text generation, which is achieved by using special tokens. Experimental results on summarization and story generation tasks show that the proposed method can generate text that better reflects the user's intent."
}