{
    "title": "Multi model LSTM architecture for Track Association based on Automatic Identification System Data. (arXiv:2304.01491v1 [cs.LG])",
    "abstract": "For decades, track association has been a challenging problem in marine surveillance, which involves the identification and association of vessel observations over time. However, the Automatic Identification System (AIS) has provided a new opportunity for researchers to tackle this problem by offering a large database of dynamic and geo-spatial information of marine vessels. With the availability of such large databases, researchers can now develop sophisticated models and algorithms that leverage the increased availability of data to address the track association challenge effectively. Furthermore, with the advent of deep learning, track association can now be approached as a data-intensive problem. In this study, we propose a Long Short-Term Memory (LSTM) based multi-model framework for track association. LSTM is a recurrent neural network architecture that is capable of processing multivariate temporal data collected over time in a sequential manner, enabling it to predict current v",
    "link": "http://arxiv.org/abs/2304.01491",
    "context": "Title: Multi model LSTM architecture for Track Association based on Automatic Identification System Data. (arXiv:2304.01491v1 [cs.LG])\nAbstract: For decades, track association has been a challenging problem in marine surveillance, which involves the identification and association of vessel observations over time. However, the Automatic Identification System (AIS) has provided a new opportunity for researchers to tackle this problem by offering a large database of dynamic and geo-spatial information of marine vessels. With the availability of such large databases, researchers can now develop sophisticated models and algorithms that leverage the increased availability of data to address the track association challenge effectively. Furthermore, with the advent of deep learning, track association can now be approached as a data-intensive problem. In this study, we propose a Long Short-Term Memory (LSTM) based multi-model framework for track association. LSTM is a recurrent neural network architecture that is capable of processing multivariate temporal data collected over time in a sequential manner, enabling it to predict current v",
    "path": "papers/23/04/2304.01491.json",
    "total_tokens": 1042,
    "translated_title": "基于自动识别系统数据的轨迹关联的多模型LSTM架构",
    "translated_abstract": "几十年来，航迹关联一直是海洋监视中的一个具有挑战性的问题，涉及到对船只观测数据的识别和关联。然而，自动识别系统（AIS）通过提供大量的船只动态和地理空间信息，为研究人员提供了一个新的解决该问题的机会。随着如此大型数据库的可用性，研究人员现在可以开发复杂模型和算法，利用数据的增加，有效地解决轨迹关联挑战。此外，随着深度学习的出现，轨迹关联现在可以被视为是一个数据密集型的问题。在这项研究中，我们提出了一种基于长短期记忆（LSTM）的多模型框架来进行轨迹关联。 LSTM是一种递归神经网络结构，能够以顺序方式处理多元时间数据，从而预测船只的当前轨迹。我们提出的框架集成了多个模型，捕捉了船只轨迹的不同模式和特征，例如船只的方向，速度和位置，从而提高了轨迹关联的准确性和鲁棒性。我们在实际的AIS数据集上评估了我们的方法，并在准确性和效率方面取得了良好的结果。",
    "tldr": "本文提出了基于LSTM的多模型框架来进行轨迹关联，能够更好的捕捉船只轨迹的不同模式和特征，提高了关联准确性和鲁棒性。",
    "en_tdlr": "This paper proposes a multi-model LSTM framework for track association, which can better capture different patterns and features of vessel trajectories, improving the accuracy and robustness of the association."
}