{
    "title": "First-order methods for Stochastic Variational Inequality problems with Function Constraints. (arXiv:2304.04778v1 [math.OC])",
    "abstract": "The monotone Variational Inequality (VI) is an important problem in machine learning. In numerous instances, the VI problems are accompanied by function constraints which can possibly be data-driven, making the projection operator challenging to compute. In this paper, we present novel first-order methods for function constrained VI (FCVI) problem under various settings, including smooth or nonsmooth problems with a stochastic operator and/or stochastic constraints. First, we introduce the~{\\texttt{OpConEx}} method and its stochastic variants, which employ extrapolation of the operator and constraint evaluations to update the variables and the Lagrangian multipliers. These methods achieve optimal operator or sample complexities when the FCVI problem is either (i) deterministic nonsmooth, or (ii) stochastic, including smooth or nonsmooth stochastic constraints. Notably, our algorithms are simple single-loop procedures and do not require the knowledge of Lagrange multipliers to attain th",
    "link": "http://arxiv.org/abs/2304.04778",
    "context": "Title: First-order methods for Stochastic Variational Inequality problems with Function Constraints. (arXiv:2304.04778v1 [math.OC])\nAbstract: The monotone Variational Inequality (VI) is an important problem in machine learning. In numerous instances, the VI problems are accompanied by function constraints which can possibly be data-driven, making the projection operator challenging to compute. In this paper, we present novel first-order methods for function constrained VI (FCVI) problem under various settings, including smooth or nonsmooth problems with a stochastic operator and/or stochastic constraints. First, we introduce the~{\\texttt{OpConEx}} method and its stochastic variants, which employ extrapolation of the operator and constraint evaluations to update the variables and the Lagrangian multipliers. These methods achieve optimal operator or sample complexities when the FCVI problem is either (i) deterministic nonsmooth, or (ii) stochastic, including smooth or nonsmooth stochastic constraints. Notably, our algorithms are simple single-loop procedures and do not require the knowledge of Lagrange multipliers to attain th",
    "path": "papers/23/04/2304.04778.json",
    "total_tokens": 910,
    "translated_title": "带函数约束的随机变分不等式问题的一阶方法",
    "translated_abstract": "在机器学习中，单调变分不等式是一个重要的问题。许多情况下，变分不等式问题伴随着可能是数据驱动的函数约束，这使得投影算子的计算变得具有挑战性。本文针对各种情况下的带函数约束的变分不等式问题，包括具有随机算子和/或随机约束的光滑或非光滑问题，提出了新的一阶方法。首先，我们介绍了{\\texttt{OpConEx}}方法及其随机变体，它们采用算子和限制评估的外推来更新变量和Lagrangian乘数。当FCVI问题是确定性非光滑的或随机的（包括光滑或非光滑的随机约束）时，这些方法可以实现最优算子或样本复杂性。值得注意的是，我们的算法是简单的单循环程序，不需要知道拉格朗日乘数就可以达到最优性。",
    "tldr": "本文提出了一种新的一阶方法，适用于具有随机算子和/或随机约束的带函数约束的变分不等式问题，当FCVI问题是确定性非光滑的或随机的时，这些方法可以实现最优算子或样本复杂性。",
    "en_tdlr": "This paper proposes novel first-order methods for function constrained variational inequality (FCVI) problem with stochastic operator and/or stochastic constraints, achieving optimal operator or sample complexities. The algorithms are simple single-loop procedures and do not require knowledge of Lagrange multipliers to attain optimality."
}