{
    "title": "Neural Operator Learning for Ultrasound Tomography Inversion. (arXiv:2304.03297v1 [eess.IV])",
    "abstract": "Neural operator learning as a means of mapping between complex function spaces has garnered significant attention in the field of computational science and engineering (CS&E). In this paper, we apply Neural operator learning to the time-of-flight ultrasound computed tomography (USCT) problem. We learn the mapping between time-of-flight (TOF) data and the heterogeneous sound speed field using a full-wave solver to generate the training data. This novel application of operator learning circumnavigates the need to solve the computationally intensive iterative inverse problem. The operator learns the non-linear mapping offline and predicts the heterogeneous sound field with a single forward pass through the model. This is the first time operator learning has been used for ultrasound tomography and is the first step in potential real-time predictions of soft tissue distribution for tumor identification in beast imaging.",
    "link": "http://arxiv.org/abs/2304.03297",
    "context": "Title: Neural Operator Learning for Ultrasound Tomography Inversion. (arXiv:2304.03297v1 [eess.IV])\nAbstract: Neural operator learning as a means of mapping between complex function spaces has garnered significant attention in the field of computational science and engineering (CS&E). In this paper, we apply Neural operator learning to the time-of-flight ultrasound computed tomography (USCT) problem. We learn the mapping between time-of-flight (TOF) data and the heterogeneous sound speed field using a full-wave solver to generate the training data. This novel application of operator learning circumnavigates the need to solve the computationally intensive iterative inverse problem. The operator learns the non-linear mapping offline and predicts the heterogeneous sound field with a single forward pass through the model. This is the first time operator learning has been used for ultrasound tomography and is the first step in potential real-time predictions of soft tissue distribution for tumor identification in beast imaging.",
    "path": "papers/23/04/2304.03297.json",
    "total_tokens": 902,
    "translated_title": "超声断层成像反演的神经操作符学习",
    "translated_abstract": "神经操作符学习作为在计算科学和工程领域中进行复杂函数空间映射的一种手段已经引起了重视。在本文中，我们将神经操作符学习应用于飞行时间超声计算层析成像问题。我们使用全波求解器生成训练数据来学习时间飞行（TOF）数据和异质声速场之间的映射。该操作符学习的新颖应用规避了需要解决计算密集型迭代反问题的需求。该操作符学习在离线模式下学习非线性映射，并通过模型的单次前向通过来预测异质声场。这是第一次将操作符学习用于超声断层成像，也是潜在的实时预测乳腺成像中的软组织分布以进行肿瘤识别的第一步。",
    "tldr": "本文首次将神经操作符学习应用于超声断层成像反演，通过学习时间飞行数据和异质声速场之间的映射，实现了可避免计算密集型反演过程的预测异质声场模型。该模型有潜在的在乳腺成像中进行软组织分布预测和肿瘤识别的实时应用。",
    "en_tdlr": "This paper presents the first application of neural operator learning to ultrasound tomography inversion, where the model predicts the heterogeneous sound field by learning the mapping between time-of-flight data and sound speed field, circumventing the need for computationally intensive iterative inverse problem. This has potential for real-time prediction of soft tissue distribution for tumor identification in breast imaging."
}