{
    "title": "Discrepancy-Guided Reconstruction Learning for Image Forgery Detection. (arXiv:2304.13349v1 [cs.CV])",
    "abstract": "In this paper, we propose a novel image forgery detection paradigm for boosting the model learning capacity on both forgery-sensitive and genuine compact visual patterns. Compared to the existing methods that only focus on the discrepant-specific patterns (\\eg, noises, textures, and frequencies), our method has a greater generalization. Specifically, we first propose a Discrepancy-Guided Encoder (DisGE) to extract forgery-sensitive visual patterns. DisGE consists of two branches, where the mainstream backbone branch is used to extract general semantic features, and the accessorial discrepant external attention branch is used to extract explicit forgery cues. Besides, a Double-Head Reconstruction (DouHR) module is proposed to enhance genuine compact visual patterns in different granular spaces. Under DouHR, we further introduce a Discrepancy-Aggregation Detector (DisAD) to aggregate these genuine compact visual patterns, such that the forgery detection capability on unknown patterns can",
    "link": "http://arxiv.org/abs/2304.13349",
    "context": "Title: Discrepancy-Guided Reconstruction Learning for Image Forgery Detection. (arXiv:2304.13349v1 [cs.CV])\nAbstract: In this paper, we propose a novel image forgery detection paradigm for boosting the model learning capacity on both forgery-sensitive and genuine compact visual patterns. Compared to the existing methods that only focus on the discrepant-specific patterns (\\eg, noises, textures, and frequencies), our method has a greater generalization. Specifically, we first propose a Discrepancy-Guided Encoder (DisGE) to extract forgery-sensitive visual patterns. DisGE consists of two branches, where the mainstream backbone branch is used to extract general semantic features, and the accessorial discrepant external attention branch is used to extract explicit forgery cues. Besides, a Double-Head Reconstruction (DouHR) module is proposed to enhance genuine compact visual patterns in different granular spaces. Under DouHR, we further introduce a Discrepancy-Aggregation Detector (DisAD) to aggregate these genuine compact visual patterns, such that the forgery detection capability on unknown patterns can",
    "path": "papers/23/04/2304.13349.json",
    "total_tokens": 964,
    "translated_title": "基于差异引导重建学习的图像篡改检测方法",
    "translated_abstract": "本论文提出了一种新的图像篡改检测范式，旨在提高模型对于既敏感于篡改又具有紧凑视觉模式的学习能力。相对于现有方法仅关注篡改特定模式（例如噪声、纹理和频率）的问题，我们的方法更具有广泛的推广性。具体而言，我们首先提出了一个差异引导编码器（DisGE）来提取敏感于篡改的视觉模式。DisGE由两个分支组成，其中主流的骨干分支用于提取一般语义特征，而辅助的差异性外部注意力分支用于提取明确的篡改提示。此外，还提出了一个双头重建（DouHR）模块，用于增强不同颗粒空间中的真实紧凑视觉模式。在DouHR下，我们进一步引入了一种差异聚合检测器（DisAD）来聚合这些真实紧凑的视觉模式，从而提高对未知模式的篡改检测能力。",
    "tldr": "本论文提出了一种基于差异引导的图像篡改检测方法，能够提升模型对篡改敏感且具有紧凑视觉模式的学习能力，具有较广泛的推广性。",
    "en_tdlr": "This paper proposes a discrepancy-guided image forgery detection method, which enhances the model's learning capacity on both forgery-sensitive and genuine compact visual patterns with greater generalization. The method includes a Discrepancy-Guided Encoder, a Double-Head Reconstruction module, and a Discrepancy-Aggregation Detector to extract, enhance, and aggregate visual patterns for better detection capability on unknown patterns."
}