{
    "title": "Querying Large Language Models with SQL. (arXiv:2304.00472v2 [cs.DB] UPDATED)",
    "abstract": "In many use-cases, information is stored in text but not available in structured data. However, extracting data from natural language text to precisely fit a schema, and thus enable querying, is a challenging task. With the rise of pre-trained Large Language Models (LLMs), there is now an effective solution to store and use information extracted from massive corpora of text documents. Thus, we envision the use of SQL queries to cover a broad range of data that is not captured by traditional databases by tapping the information in LLMs. To ground this vision, we present Galois, a prototype based on a traditional database architecture, but with new physical operators for querying the underlying LLM. The main idea is to execute some operators of the the query plan with prompts that retrieve data from the LLM. For a large class of SQL queries, querying LLMs returns well structured relations, with encouraging qualitative results. Preliminary experimental results make pre-trained LLMs a prom",
    "link": "http://arxiv.org/abs/2304.00472",
    "context": "Title: Querying Large Language Models with SQL. (arXiv:2304.00472v2 [cs.DB] UPDATED)\nAbstract: In many use-cases, information is stored in text but not available in structured data. However, extracting data from natural language text to precisely fit a schema, and thus enable querying, is a challenging task. With the rise of pre-trained Large Language Models (LLMs), there is now an effective solution to store and use information extracted from massive corpora of text documents. Thus, we envision the use of SQL queries to cover a broad range of data that is not captured by traditional databases by tapping the information in LLMs. To ground this vision, we present Galois, a prototype based on a traditional database architecture, but with new physical operators for querying the underlying LLM. The main idea is to execute some operators of the the query plan with prompts that retrieve data from the LLM. For a large class of SQL queries, querying LLMs returns well structured relations, with encouraging qualitative results. Preliminary experimental results make pre-trained LLMs a prom",
    "path": "papers/23/04/2304.00472.json",
    "total_tokens": 901,
    "translated_title": "使用SQL查询大型语言模型",
    "translated_abstract": "在许多使用场景中，信息存储在文本中，但无法在结构化数据中获取。然而，从自然语言文本中提取数据以精确适配模式，并实现查询，是一项具有挑战性的任务。随着预训练的大型语言模型（LLMs）的兴起，现在有了有效的解决方案，可以存储和使用从大规模文本文档中提取的信息。因此，我们设想使用SQL查询来涵盖传统数据库无法提取的广泛数据，通过利用LLMs中的信息。为了支撑这个愿景，我们提出了基于传统数据库体系结构的Galois原型，但具有用于查询底层LLM的新物理算子。主要思想是使用提示符执行查询计划中的某些操作符，从LLM中检索数据。对于大类别的SQL查询，查询LLMs返回结构良好的关系，取得了令人鼓舞的定性结果。初步实验结果使预训练的LLMs成为一个有前景的方法。",
    "tldr": "该论文介绍了使用SQL查询大型语言模型的方法，通过利用预训练的LLMs中的信息，可以从非结构化文本中提取数据并进行查询。通过Galois原型实现了查询LLMs的新物理运算符，并取得了令人鼓舞的结果。",
    "en_tdlr": "This paper presents a method for querying large language models using SQL, allowing data extraction and querying from unstructured text. By leveraging pre-trained LLMs, Galois prototype introduces new physical operators for querying LLMs and achieves encouraging results."
}