{
    "title": "Measuring Gender Bias in West Slavic Language Models. (arXiv:2304.05783v1 [cs.CL])",
    "abstract": "Pre-trained language models have been known to perpetuate biases from the underlying datasets to downstream tasks. However, these findings are predominantly based on monolingual language models for English, whereas there are few investigative studies of biases encoded in language models for languages beyond English. In this paper, we fill this gap by analysing gender bias in West Slavic language models. We introduce the first template-based dataset in Czech, Polish, and Slovak for measuring gender bias towards male, female and non-binary subjects. We complete the sentences using both mono- and multilingual language models and assess their suitability for the masked language modelling objective. Next, we measure gender bias encoded in West Slavic language models by quantifying the toxicity and genderness of the generated words. We find that these language models produce hurtful completions that depend on the subject's gender. Perhaps surprisingly, Czech, Slovak, and Polish language mode",
    "link": "http://arxiv.org/abs/2304.05783",
    "context": "Title: Measuring Gender Bias in West Slavic Language Models. (arXiv:2304.05783v1 [cs.CL])\nAbstract: Pre-trained language models have been known to perpetuate biases from the underlying datasets to downstream tasks. However, these findings are predominantly based on monolingual language models for English, whereas there are few investigative studies of biases encoded in language models for languages beyond English. In this paper, we fill this gap by analysing gender bias in West Slavic language models. We introduce the first template-based dataset in Czech, Polish, and Slovak for measuring gender bias towards male, female and non-binary subjects. We complete the sentences using both mono- and multilingual language models and assess their suitability for the masked language modelling objective. Next, we measure gender bias encoded in West Slavic language models by quantifying the toxicity and genderness of the generated words. We find that these language models produce hurtful completions that depend on the subject's gender. Perhaps surprisingly, Czech, Slovak, and Polish language mode",
    "path": "papers/23/04/2304.05783.json",
    "total_tokens": 1091,
    "translated_title": "捷克语、波兰语和斯洛伐克语中的性别偏见量化研究",
    "translated_abstract": "预训练模型会将基础数据集中的偏见延续到下游任务。然而，这些研究大多基于英语的单语言模型，而针对扩展到英语以外的语言的语言模型中的偏见的研究很少。本文通过分析西斯拉夫语言模型中的性别偏差来填补这一空白。我们首次引入了基于模板的数据集（包括捷克语、波兰语和斯洛伐克语），以测量针对男性、女性和非二进制主体的性别偏见。我们使用单语和多语言模型来完成这些句子，并评估它们是否适合于被遮盖的语言建模任务。接下来，我们通过量化生成单词的有毒性和性别特征来测量西斯拉夫语言模型中的性别偏见。我们发现这些语言模型生成的语句会因主体的性别而产生伤害性的完成度。令人惊讶的是，捷克语、斯洛伐克语和波兰语均显示出相似程度的性别偏见。本研究对于关于语言模型中存在的偏见的日益增长的研究体系做出贡献，并为评估和减少西斯拉夫语言中的性别偏见奠定了基础。",
    "tldr": "本研究分析了西斯拉夫语言模型中的性别偏差，发现捷克语、波兰语和斯洛伐克语均存在相似程度的性别偏见。这一研究填补了研究非英语语言模型性别偏见的空白。"
}