{
    "title": "Few-shot Fine-tuning is All You Need for Source-free Domain Adaptation. (arXiv:2304.00792v2 [cs.CV] UPDATED)",
    "abstract": "Recently, source-free unsupervised domain adaptation (SFUDA) has emerged as a more practical and feasible approach compared to unsupervised domain adaptation (UDA) which assumes that labeled source data are always accessible. However, significant limitations associated with SFUDA approaches are often overlooked, which limits their practicality in real-world applications. These limitations include a lack of principled ways to determine optimal hyperparameters and performance degradation when the unlabeled target data fail to meet certain requirements such as a closed-set and identical label distribution to the source data. All these limitations stem from the fact that SFUDA entirely relies on unlabeled target data. We empirically demonstrate the limitations of existing SFUDA methods in real-world scenarios including out-of-distribution and label distribution shifts in target data, and verify that none of these methods can be safely applied to real-world settings. Based on our experiment",
    "link": "http://arxiv.org/abs/2304.00792",
    "context": "Title: Few-shot Fine-tuning is All You Need for Source-free Domain Adaptation. (arXiv:2304.00792v2 [cs.CV] UPDATED)\nAbstract: Recently, source-free unsupervised domain adaptation (SFUDA) has emerged as a more practical and feasible approach compared to unsupervised domain adaptation (UDA) which assumes that labeled source data are always accessible. However, significant limitations associated with SFUDA approaches are often overlooked, which limits their practicality in real-world applications. These limitations include a lack of principled ways to determine optimal hyperparameters and performance degradation when the unlabeled target data fail to meet certain requirements such as a closed-set and identical label distribution to the source data. All these limitations stem from the fact that SFUDA entirely relies on unlabeled target data. We empirically demonstrate the limitations of existing SFUDA methods in real-world scenarios including out-of-distribution and label distribution shifts in target data, and verify that none of these methods can be safely applied to real-world settings. Based on our experiment",
    "path": "papers/23/04/2304.00792.json",
    "total_tokens": 817,
    "tldr": "该论文提出了一种新的无源域自适应方法，能够克服现有SFUDA方法存在的局限性，具有更实用性。"
}