{
    "title": "A Lightweight Recurrent Learning Network for Sustainable Compressed Sensing. (arXiv:2304.11674v1 [cs.CV])",
    "abstract": "Recently, deep learning-based compressed sensing (CS) has achieved great success in reducing the sampling and computational cost of sensing systems and improving the reconstruction quality. These approaches, however, largely overlook the issue of the computational cost; they rely on complex structures and task-specific operator designs, resulting in extensive storage and high energy consumption in CS imaging systems. In this paper, we propose a lightweight but effective deep neural network based on recurrent learning to achieve a sustainable CS system; it requires a smaller number of parameters but obtains high-quality reconstructions. Specifically, our proposed network consists of an initial reconstruction sub-network and a residual reconstruction sub-network. While the initial reconstruction sub-network has a hierarchical structure to progressively recover the image, reducing the number of parameters, the residual reconstruction sub-network facilitates recurrent residual feature extr",
    "link": "http://arxiv.org/abs/2304.11674",
    "context": "Title: A Lightweight Recurrent Learning Network for Sustainable Compressed Sensing. (arXiv:2304.11674v1 [cs.CV])\nAbstract: Recently, deep learning-based compressed sensing (CS) has achieved great success in reducing the sampling and computational cost of sensing systems and improving the reconstruction quality. These approaches, however, largely overlook the issue of the computational cost; they rely on complex structures and task-specific operator designs, resulting in extensive storage and high energy consumption in CS imaging systems. In this paper, we propose a lightweight but effective deep neural network based on recurrent learning to achieve a sustainable CS system; it requires a smaller number of parameters but obtains high-quality reconstructions. Specifically, our proposed network consists of an initial reconstruction sub-network and a residual reconstruction sub-network. While the initial reconstruction sub-network has a hierarchical structure to progressively recover the image, reducing the number of parameters, the residual reconstruction sub-network facilitates recurrent residual feature extr",
    "path": "papers/23/04/2304.11674.json",
    "total_tokens": 978,
    "translated_title": "一种轻量级循环学习网络用于可持续压缩感知",
    "translated_abstract": "最近，基于深度学习的压缩感知（CS）在减少传感系统的采样和计算成本以及提高重构质量方面取得了巨大成功。但是这些方法在很大程度上忽视了计算成本这一问题，它们依赖于复杂的结构和任务特定运算符设计，导致 CS 成像系统具有广泛的存储要求和高能耗。在本文中，我们提出了一种轻量级但高效的深度神经网络，基于循环学习来实现可持续的 CS 系统；它需要更少的参数，但可以获得高质量的重构结果。具体而言，我们提出的网络由初始重构子网络和残差重构子网络组成。初始重构子网络具有分层结构，逐步恢复图像，减少参数数量；而残差重构子网络则有助于从中间估计中提取循环残差特征，使网络对底层结构的捕捉更加有效。实验结果表明，所提出的网络在重构质量方面取得了最先进的性能，同时与现有方法相比，需要更少的参数和计算量。",
    "tldr": "本文提出了一种轻量级但高效的深度神经网络，基于循环学习来实现可持续的压缩感知系统；它需要更少的参数，但可以获得高质量的重构结果。",
    "en_tdlr": "This paper proposes a lightweight yet effective deep neural network based on recurrent learning for sustainable compressed sensing, requiring fewer parameters but achieving high-quality reconstruction results. The network consists of an initial reconstruction sub-network and a residual reconstruction sub-network, and it outperforms existing methods in terms of reconstruction quality while consuming less energy."
}