{
    "title": "Domain Adaptation for Inertial Measurement Unit-based Human Activity Recognition: A Survey. (arXiv:2304.06489v1 [eess.SP])",
    "abstract": "Machine learning-based wearable human activity recognition (WHAR) models enable the development of various smart and connected community applications such as sleep pattern monitoring, medication reminders, cognitive health assessment, sports analytics, etc. However, the widespread adoption of these WHAR models is impeded by their degraded performance in the presence of data distribution heterogeneities caused by the sensor placement at different body positions, inherent biases and heterogeneities across devices, and personal and environmental diversities. Various traditional machine learning algorithms and transfer learning techniques have been proposed in the literature to address the underpinning challenges of handling such data heterogeneities. Domain adaptation is one such transfer learning techniques that has gained significant popularity in recent literature. In this paper, we survey the recent progress of domain adaptation techniques in the Inertial Measurement Unit (IMU)-based ",
    "link": "http://arxiv.org/abs/2304.06489",
    "context": "Title: Domain Adaptation for Inertial Measurement Unit-based Human Activity Recognition: A Survey. (arXiv:2304.06489v1 [eess.SP])\nAbstract: Machine learning-based wearable human activity recognition (WHAR) models enable the development of various smart and connected community applications such as sleep pattern monitoring, medication reminders, cognitive health assessment, sports analytics, etc. However, the widespread adoption of these WHAR models is impeded by their degraded performance in the presence of data distribution heterogeneities caused by the sensor placement at different body positions, inherent biases and heterogeneities across devices, and personal and environmental diversities. Various traditional machine learning algorithms and transfer learning techniques have been proposed in the literature to address the underpinning challenges of handling such data heterogeneities. Domain adaptation is one such transfer learning techniques that has gained significant popularity in recent literature. In this paper, we survey the recent progress of domain adaptation techniques in the Inertial Measurement Unit (IMU)-based ",
    "path": "papers/23/04/2304.06489.json",
    "total_tokens": 932,
    "translated_title": "惯性测量单元人体活动识别的领域自适应: 一项综述",
    "translated_abstract": "基于机器学习的可穿戴式人体活动识别模型，可以开发各种智能社区应用，如睡眠模式监测、药物提醒、认知健康评估、运动分析等。但是，由于传感器放置在不同的身体位置、设备固有偏差和异质性，以及个人和环境的差异等造成的数据分布异质性，这些WHAR模型的性能受到了影响。文献中提出了各种传统的机器学习算法和迁移学习技术来解决处理这种数据异质性的挑战。领域自适应是近年来广受欢迎的一种迁移学习技术之一。本文对惯性测量单元(IMU)人体活动识别中的领域自适应技术的最新进展进行了调查。",
    "tldr": "本文综述了惯性测量单元人体活动识别中利用领域自适应技术解决数据分布异质性问题的最新进展。",
    "en_tdlr": "This paper surveys recent progress in domain adaptation techniques for addressing data distribution heterogeneities in Inertial Measurement Unit (IMU)-based human activity recognition, aiming to solve the performance degradation caused by sensor placement, inherent biases and heterogeneities across devices, and personal and environmental diversities."
}