{
    "title": "Robust Non-Linear Feedback Coding via Power-Constrained Deep Learning. (arXiv:2304.13178v1 [cs.IT])",
    "abstract": "The design of codes for feedback-enabled communications has been a long-standing open problem. Recent research on non-linear, deep learning-based coding schemes have demonstrated significant improvements in communication reliability over linear codes, but are still vulnerable to the presence of forward and feedback noise over the channel. In this paper, we develop a new family of non-linear feedback codes that greatly enhance robustness to channel noise. Our autoencoder-based architecture is designed to learn codes based on consecutive blocks of bits, which obtains de-noising advantages over bit-by-bit processing to help overcome the physical separation between the encoder and decoder over a noisy channel. Moreover, we develop a power control layer at the encoder to explicitly incorporate hardware constraints into the learning optimization, and prove that the resulting average power constraint is satisfied asymptotically. Numerical experiments demonstrate that our scheme outperforms st",
    "link": "http://arxiv.org/abs/2304.13178",
    "context": "Title: Robust Non-Linear Feedback Coding via Power-Constrained Deep Learning. (arXiv:2304.13178v1 [cs.IT])\nAbstract: The design of codes for feedback-enabled communications has been a long-standing open problem. Recent research on non-linear, deep learning-based coding schemes have demonstrated significant improvements in communication reliability over linear codes, but are still vulnerable to the presence of forward and feedback noise over the channel. In this paper, we develop a new family of non-linear feedback codes that greatly enhance robustness to channel noise. Our autoencoder-based architecture is designed to learn codes based on consecutive blocks of bits, which obtains de-noising advantages over bit-by-bit processing to help overcome the physical separation between the encoder and decoder over a noisy channel. Moreover, we develop a power control layer at the encoder to explicitly incorporate hardware constraints into the learning optimization, and prove that the resulting average power constraint is satisfied asymptotically. Numerical experiments demonstrate that our scheme outperforms st",
    "path": "papers/23/04/2304.13178.json",
    "total_tokens": 889,
    "translated_abstract": "反馈通信编码的设计一直是一个长期存在的问题。最近，基于非线性、深度学习的编码方案在通信可靠性方面表现出了显著的改进，但仍然容易受到信道前向和反馈噪声的影响。本文提出了一种新的非线性反馈编码系列，大大增强了对信道噪声的鲁棒性。我们基于自编码器的架构设计是基于连续的比特块学习编码，与逐比特处理相比具有去噪的优势，有助于克服在嘈杂信道上编码器和解码器之间的物理隔离。此外，我们在编码器中开发了一个功率控制层，将硬件约束明确地纳入学习优化中，并证明所得到的平均功率约束在渐近意义下得到满足。数值实验表明，我们的方案优于所有已知方法。",
    "tldr": "本文提出了一种基于深度学习和自编码器的非线性反馈编码系列，通过对连续比特块的学习和硬件约束的控制来大幅提高在嘈杂信道上的鲁棒性，优于已知方法。",
    "en_tdlr": "This paper proposes a new family of non-linear feedback codes based on deep learning and autoencoders, which greatly enhance robustness to channel noise through learning consecutive blocks of bits and controlling hardware constraints, and outperforms existing methods in numerical experiments."
}