{
    "title": "Delta Denoising Score. (arXiv:2304.07090v1 [cs.CV])",
    "abstract": "We introduce Delta Denoising Score (DDS), a novel scoring function for text-based image editing that guides minimal modifications of an input image towards the content described in a target prompt. DDS leverages the rich generative prior of text-to-image diffusion models and can be used as a loss term in an optimization problem to steer an image towards a desired direction dictated by a text. DDS utilizes the Score Distillation Sampling (SDS) mechanism for the purpose of image editing. We show that using only SDS often produces non-detailed and blurry outputs due to noisy gradients. To address this issue, DDS uses a prompt that matches the input image to identify and remove undesired erroneous directions of SDS. Our key premise is that SDS should be zero when calculated on pairs of matched prompts and images, meaning that if the score is non-zero, its gradients can be attributed to the erroneous component of SDS. Our analysis demonstrates the competence of DDS for text based image-to-i",
    "link": "http://arxiv.org/abs/2304.07090",
    "context": "Title: Delta Denoising Score. (arXiv:2304.07090v1 [cs.CV])\nAbstract: We introduce Delta Denoising Score (DDS), a novel scoring function for text-based image editing that guides minimal modifications of an input image towards the content described in a target prompt. DDS leverages the rich generative prior of text-to-image diffusion models and can be used as a loss term in an optimization problem to steer an image towards a desired direction dictated by a text. DDS utilizes the Score Distillation Sampling (SDS) mechanism for the purpose of image editing. We show that using only SDS often produces non-detailed and blurry outputs due to noisy gradients. To address this issue, DDS uses a prompt that matches the input image to identify and remove undesired erroneous directions of SDS. Our key premise is that SDS should be zero when calculated on pairs of matched prompts and images, meaning that if the score is non-zero, its gradients can be attributed to the erroneous component of SDS. Our analysis demonstrates the competence of DDS for text based image-to-i",
    "path": "papers/23/04/2304.07090.json",
    "total_tokens": 967,
    "translated_title": "Delta去噪分数",
    "translated_abstract": "本论文提出了Delta去噪分数（DDS），这是一种新颖的评分函数，用于基于文本的图像编辑，可以引导最小修改输入图像，使其朝向目标提示所描述的内容。DDS利用了文本到图像扩散模型的丰富生成先验知识，并可用作优化问题中的损失项，以便将图像朝着由文本指定的所需方向引导。DDS利用了分数蒸馏采样（SDS）机制来进行图像编辑。我们发现，仅使用SDS通常会产生非详细和模糊的输出，因为存在噪声梯度的问题。为了解决这个问题，DDS使用一个与输入图像匹配的提示来识别和去除不希望的SDS错误方向。我们的主要前提是，当计算匹配提示和图像的对时，SDS应为零，这意味着如果分数非零，则其梯度可以归因于SDS的错误组成部分。我们的分析证明了DDS在基于文本的图像到图像编辑上的竞争力。",
    "tldr": "本文提出了一种新颖的Delta去噪分数（DDS）方法，可以用作基于文本的图像编辑、优化问题中的损失项，通过使用分数蒸馏采样（SDS）机制进行图像编辑，并通过匹配提示和图像来去除不希望的SDS错误方向，提高了图像编辑的精度和清晰度。",
    "en_tdlr": "The paper proposes a novel method called Delta Denoising Score (DDS) as a scoring function for text-based image editing, which utilizes text-to-image diffusion models and can be used as a loss term in an optimization problem. By using Score Distillation Sampling (SDS) mechanism for image editing and removing undesired SDS directions through matched prompts and images, DDS can improve the accuracy and clarity of the image editing process."
}