{
    "title": "Stochastic Subgraph Neighborhood Pooling for Subgraph Classification. (arXiv:2304.08556v1 [cs.LG])",
    "abstract": "Subgraph classification is an emerging field in graph representation learning where the task is to classify a group of nodes (i.e., a subgraph) within a graph. Subgraph classification has applications such as predicting the cellular function of a group of proteins or identifying rare diseases given a collection of phenotypes. Graph neural networks (GNNs) are the de facto solution for node, link, and graph-level tasks but fail to perform well on subgraph classification tasks. Even GNNs tailored for graph classification are not directly transferable to subgraph classification as they ignore the external topology of the subgraph, thus failing to capture how the subgraph is located within the larger graph. The current state-of-the-art models for subgraph classification address this shortcoming through either labeling tricks or multiple message-passing channels, both of which impose a computation burden and are not scalable to large graphs. To address the scalability issue while maintaining",
    "link": "http://arxiv.org/abs/2304.08556",
    "context": "Title: Stochastic Subgraph Neighborhood Pooling for Subgraph Classification. (arXiv:2304.08556v1 [cs.LG])\nAbstract: Subgraph classification is an emerging field in graph representation learning where the task is to classify a group of nodes (i.e., a subgraph) within a graph. Subgraph classification has applications such as predicting the cellular function of a group of proteins or identifying rare diseases given a collection of phenotypes. Graph neural networks (GNNs) are the de facto solution for node, link, and graph-level tasks but fail to perform well on subgraph classification tasks. Even GNNs tailored for graph classification are not directly transferable to subgraph classification as they ignore the external topology of the subgraph, thus failing to capture how the subgraph is located within the larger graph. The current state-of-the-art models for subgraph classification address this shortcoming through either labeling tricks or multiple message-passing channels, both of which impose a computation burden and are not scalable to large graphs. To address the scalability issue while maintaining",
    "path": "papers/23/04/2304.08556.json",
    "total_tokens": 982,
    "translated_title": "随机子图邻域汇聚用于子图分类",
    "translated_abstract": "子图分类是图表征学习中的新兴领域，其任务是对图中的一组节点（即子图）进行分类。子图分类具有预测一组蛋白质的细胞功能或在给定表型集合的情况下识别罕见疾病等应用。图神经网络是节点、链和图级任务的事实解决方案，但在子图分类任务上表现不佳。即使是为图分类量身定制的图神经网络也不能直接转化为子图分类，因为它们忽略了子图的外部拓扑结构，从而无法捕捉子图在大图中的位置。目前用于子图分类的最先进模型通过标签技巧或多个消息传递通道来解决这个缺陷，但这两种方法都会对计算机造成负担，不适用于大型图。为了解决可扩展性问题并保持精度，我们提出了一种随机子图邻域汇聚 (SSNP)方法，该方法通过随机汇聚子图邻域来利用图的结构特性。SSNP在几个子图分类基准数据集上实现了最先进的性能，同时具有计算效率。",
    "tldr": "该论文提出了一种随机子图邻域汇聚方法，可以在保持精度的情况下解决子图分类问题的可扩展性问题，并实现了最先进的性能。",
    "en_tdlr": "This paper proposes a stochastic subgraph neighborhood pooling method that solves the scalability issue of subgraph classification while maintaining accuracy, achieving state-of-the-art performance on several benchmark datasets."
}