{
    "title": "Constructing a meta-learner for unsupervised anomaly detection. (arXiv:2304.11438v1 [cs.LG])",
    "abstract": "Unsupervised anomaly detection (AD) is critical for a wide range of practical applications, from network security to health and medical tools. Due to the diversity of problems, no single algorithm has been found to be superior for all AD tasks. Choosing an algorithm, otherwise known as the Algorithm Selection Problem (ASP), has been extensively examined in supervised classification problems, through the use of meta-learning and AutoML, however, it has received little attention in unsupervised AD tasks. This research proposes a new meta-learning approach that identifies an appropriate unsupervised AD algorithm given a set of meta-features generated from the unlabelled input dataset. The performance of the proposed meta-learner is superior to the current state of the art solution. In addition, a mixed model statistical analysis has been conducted to examine the impact of the meta-learner components: the meta-model, meta-features, and the base set of AD algorithms, on the overall performa",
    "link": "http://arxiv.org/abs/2304.11438",
    "context": "Title: Constructing a meta-learner for unsupervised anomaly detection. (arXiv:2304.11438v1 [cs.LG])\nAbstract: Unsupervised anomaly detection (AD) is critical for a wide range of practical applications, from network security to health and medical tools. Due to the diversity of problems, no single algorithm has been found to be superior for all AD tasks. Choosing an algorithm, otherwise known as the Algorithm Selection Problem (ASP), has been extensively examined in supervised classification problems, through the use of meta-learning and AutoML, however, it has received little attention in unsupervised AD tasks. This research proposes a new meta-learning approach that identifies an appropriate unsupervised AD algorithm given a set of meta-features generated from the unlabelled input dataset. The performance of the proposed meta-learner is superior to the current state of the art solution. In addition, a mixed model statistical analysis has been conducted to examine the impact of the meta-learner components: the meta-model, meta-features, and the base set of AD algorithms, on the overall performa",
    "path": "papers/23/04/2304.11438.json",
    "total_tokens": 817,
    "translated_title": "构建元学习器进行无监督异常检测",
    "translated_abstract": "无监督异常检测（AD）对于从网络安全到医疗工具等一系列实际应用至关重要。由于问题的多样性，没有单一算法被发现在所有AD任务中都优越。在有监督分类问题中，通过使用元学习和AutoML，选择算法（也称为算法选择问题（ASP））得到了广泛的研究，但对无监督AD任务却少有关注。本研究提出了一种新的元学习方法，通过给定从未标记的输入数据集生成的元特征，识别出适当的无监督AD算法。所提出的元学习器的表现优于当前的最优解决方案。此外，还进行了混合模型统计分析，以检验元学习器的组成部分：元模型、元特征和基础AD算法集合对整体性能的影响。",
    "tldr": "构建了一种新的元学习方法来选择适当的无监督AD算法。元学习器的表现优于当前的最优解决方案。",
    "en_tdlr": "A new meta-learning approach is proposed to select appropriate unsupervised AD algorithms, and the performance of the proposed meta-learner is superior to the current state of the art solution."
}