{
    "title": "Improving Few-Shot Inductive Learning on Temporal Knowledge Graphs using Confidence-Augmented Reinforcement Learning. (arXiv:2304.00613v2 [cs.LG] UPDATED)",
    "abstract": "Temporal knowledge graph completion (TKGC) aims to predict the missing links among the entities in a temporal knwoledge graph (TKG). Most previous TKGC methods only consider predicting the missing links among the entities seen in the training set, while they are unable to achieve great performance in link prediction concerning newly-emerged unseen entities. Recently, a new task, i.e., TKG few-shot out-of-graph (OOG) link prediction, is proposed, where TKGC models are required to achieve great link prediction performance concerning newly-emerged entities that only have few-shot observed examples. In this work, we propose a TKGC method FITCARL that combines few-shot learning with reinforcement learning to solve this task. In FITCARL, an agent traverses through the whole TKG to search for the prediction answer. A policy network is designed to guide the search process based on the traversed path. To better address the data scarcity problem in the few-shot setting, we introduce a module tha",
    "link": "http://arxiv.org/abs/2304.00613",
    "context": "Title: Improving Few-Shot Inductive Learning on Temporal Knowledge Graphs using Confidence-Augmented Reinforcement Learning. (arXiv:2304.00613v2 [cs.LG] UPDATED)\nAbstract: Temporal knowledge graph completion (TKGC) aims to predict the missing links among the entities in a temporal knwoledge graph (TKG). Most previous TKGC methods only consider predicting the missing links among the entities seen in the training set, while they are unable to achieve great performance in link prediction concerning newly-emerged unseen entities. Recently, a new task, i.e., TKG few-shot out-of-graph (OOG) link prediction, is proposed, where TKGC models are required to achieve great link prediction performance concerning newly-emerged entities that only have few-shot observed examples. In this work, we propose a TKGC method FITCARL that combines few-shot learning with reinforcement learning to solve this task. In FITCARL, an agent traverses through the whole TKG to search for the prediction answer. A policy network is designed to guide the search process based on the traversed path. To better address the data scarcity problem in the few-shot setting, we introduce a module tha",
    "path": "papers/23/04/2304.00613.json",
    "total_tokens": 1129,
    "translated_title": "使用置信度增强强化学习在时间知识图上改进少样本归纳学习",
    "translated_abstract": "时间知识图补全（TKGC）旨在预测时间知识图（TKG）中实体之间缺失的联系。大多数先前的TKGC方法仅考虑在训练集中看到的实体之间预测缺失的联系，而无法在关于新出现的未见实体的链接预测方面达到良好的性能。最近，提出了一种新的任务，即TKG少样本场景外链接预测，其中TKGC模型需要在关于仅有少量观察样本的新出现实体方面实现良好的链接预测性能。在这项工作中，我们提出了一种名为FITCARL的TKGC方法，该方法将少样本学习与强化学习相结合来解决这个问题。在FITCARL中，一个智能体跨越整个TKG寻找预测答案。我们设计了一个策略网络，根据遍历的路径指导搜索过程。为了更好地解决少样本设置中的数据稀缺问题，我们引入了一个模块，生成合成样本来增加训练集。通过在真实世界数据集上进行广泛实验，我们证明FITCARL在少样本场景外链接预测和传统TKGC任务上均取得了最新的结果。",
    "tldr": "本论文介绍了一种名为FITCARL的TKGC方法，它将少样本学习与强化学习相结合，以实现在时间知识图上进行少样本归纳学习和预测。在FITCARL中，一个智能体通过策略网络来指导搜索过程，通过引入合成样本的模块来解决数据稀缺性，在真实世界数据上取得了最新的结果。",
    "en_tdlr": "This paper introduces a TKGC method named FITCARL, which combines few-shot learning with reinforcement learning to achieve few-shot inductive learning and prediction on temporal knowledge graphs. In FITCARL, an agent is guided by a policy network during the search process, and a module generating synthetic examples is introduced to address the data scarcity problem. Extensive experiments on real-world datasets demonstrate state-of-the-art results."
}