{
    "title": "Localized Region Contrast for Enhancing Self-Supervised Learning in Medical Image Segmentation. (arXiv:2304.03406v1 [cs.CV])",
    "abstract": "Recent advancements in self-supervised learning have demonstrated that effective visual representations can be learned from unlabeled images. This has led to increased interest in applying self-supervised learning to the medical domain, where unlabeled images are abundant and labeled images are difficult to obtain. However, most self-supervised learning approaches are modeled as image level discriminative or generative proxy tasks, which may not capture the finer level representations necessary for dense prediction tasks like multi-organ segmentation. In this paper, we propose a novel contrastive learning framework that integrates Localized Region Contrast (LRC) to enhance existing self-supervised pre-training methods for medical image segmentation. Our approach involves identifying Super-pixels by Felzenszwalb's algorithm and performing local contrastive learning using a novel contrastive sampling loss. Through extensive experiments on three multi-organ segmentation datasets, we demon",
    "link": "http://arxiv.org/abs/2304.03406",
    "context": "Title: Localized Region Contrast for Enhancing Self-Supervised Learning in Medical Image Segmentation. (arXiv:2304.03406v1 [cs.CV])\nAbstract: Recent advancements in self-supervised learning have demonstrated that effective visual representations can be learned from unlabeled images. This has led to increased interest in applying self-supervised learning to the medical domain, where unlabeled images are abundant and labeled images are difficult to obtain. However, most self-supervised learning approaches are modeled as image level discriminative or generative proxy tasks, which may not capture the finer level representations necessary for dense prediction tasks like multi-organ segmentation. In this paper, we propose a novel contrastive learning framework that integrates Localized Region Contrast (LRC) to enhance existing self-supervised pre-training methods for medical image segmentation. Our approach involves identifying Super-pixels by Felzenszwalb's algorithm and performing local contrastive learning using a novel contrastive sampling loss. Through extensive experiments on three multi-organ segmentation datasets, we demon",
    "path": "papers/23/04/2304.03406.json",
    "total_tokens": 962,
    "translated_title": "基于局部区域对比的医学图像自监督学习增强技术",
    "translated_abstract": "最近自监督学习取得了很大的进展，表明可以从无标签图像中学习有效的视觉表示。这导致人们对将自监督学习应用于医学领域的兴趣增加了，因为无标签图像丰富而有标签图像很难获得。然而，大多数自监督学习方法被建模为图像级别的判别或生成代理任务，这可能无法捕捉多器官分割等密集预测任务所需的更细致级别的表示。本文提出了一种新颖的对比学习框架，它集成了局部区域对比（LRC）以增强现有的医学图像分割自监督预训练方法。我们的方法涉及使用Felzenszwalb算法识别超像素，并使用新的对比采样损失进行局部对比学习。通过在三个多器官分割数据集上进行广泛实验，我们证明了我们的方法可以提高分割性能并超越最先进的自监督学习方法。",
    "tldr": "本文提出了一种基于局部区域对比的医学图像自监督学习增强框架，以提高多器官分割等密集预测任务的性能，实验结果表明该方法可以超越最先进的自监督学习方法。"
}