{
    "title": "Introducing Construct Theory as a Standard Methodology for Inclusive AI Models. (arXiv:2304.09867v1 [cs.CV])",
    "abstract": "Construct theory in social psychology, developed by George Kelly are mental constructs to predict and anticipate events. Constructs are how humans interpret, curate, predict and validate data; information. AI today is biased because it is trained with a narrow construct as defined by the training data labels. Machine Learning algorithms for facial recognition discriminate against darker skin colors and in the ground breaking research papers (Buolamwini, Joy and Timnit Gebru. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. FAT (2018), the inclusion of phenotypic labeling is proposed as a viable solution. In Construct theory, phenotype is just one of the many subelements that make up the construct of a face. In this paper, we present 15 main elements of the construct of face, with 50 subelements and tested Google Cloud Vision API and Microsoft Cognitive Services API using FairFace dataset that currently has data for 7 races, genders and ages, and w",
    "link": "http://arxiv.org/abs/2304.09867",
    "context": "Title: Introducing Construct Theory as a Standard Methodology for Inclusive AI Models. (arXiv:2304.09867v1 [cs.CV])\nAbstract: Construct theory in social psychology, developed by George Kelly are mental constructs to predict and anticipate events. Constructs are how humans interpret, curate, predict and validate data; information. AI today is biased because it is trained with a narrow construct as defined by the training data labels. Machine Learning algorithms for facial recognition discriminate against darker skin colors and in the ground breaking research papers (Buolamwini, Joy and Timnit Gebru. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. FAT (2018), the inclusion of phenotypic labeling is proposed as a viable solution. In Construct theory, phenotype is just one of the many subelements that make up the construct of a face. In this paper, we present 15 main elements of the construct of face, with 50 subelements and tested Google Cloud Vision API and Microsoft Cognitive Services API using FairFace dataset that currently has data for 7 races, genders and ages, and w",
    "path": "papers/23/04/2304.09867.json",
    "total_tokens": 842,
    "translated_title": "引入构建论作为包容型人工智能模型的标准方法论",
    "translated_abstract": "社会心理学家George Kelly开发的构建论是一种用来预测和预期事件的心理构建。构建是人类解释、筛选、预测和验证数据和信息的方式。目前AI存在偏见，因为它是根据训练数据标签所定义的狭窄构建来进行训练的。目前人脸识别的机器学习算法存在着对较暗肤色的人的歧视，并且在Buolamwini、Joy 和 Timnit Gebru的开创性研究论文《Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification》中，提出了采用表型标签作为有效解决方案。在构建论中，表型只是构建出脸部特征的许多子元素之一。本文介绍了脸部构建的15个主要元素，50个子元素，并使用目前包括7个种族、性别和年龄数据的FairFace数据集测试了Google Cloud Vision API和Microsoft Cognitive Services API。",
    "tldr": "构建论为人工智能模型的建构提供了更全面多元的视角，可有效解决现有模型中存在的偏见与歧视问题。"
}