{
    "title": "Best Arm Identification with Fairness Constraints on Subpopulations. (arXiv:2304.04091v1 [cs.LG])",
    "abstract": "We formulate, analyze and solve the problem of best arm identification with fairness constraints on subpopulations (BAICS). Standard best arm identification problems aim at selecting an arm that has the largest expected reward where the expectation is taken over the entire population. The BAICS problem requires that an selected arm must be fair to all subpopulations (e.g., different ethnic groups, age groups, or customer types) by satisfying constraints that the expected reward conditional on every subpopulation needs to be larger than some thresholds. The BAICS problem aims at correctly identify, with high confidence, the arm with the largest expected reward from all arms that satisfy subpopulation constraints. We analyze the complexity of the BAICS problem by proving a best achievable lower bound on the sample complexity with closed-form representation. We then design an algorithm and prove that the algorithm's sample complexity matches with the lower bound in terms of order. A brief",
    "link": "http://arxiv.org/abs/2304.04091",
    "context": "Title: Best Arm Identification with Fairness Constraints on Subpopulations. (arXiv:2304.04091v1 [cs.LG])\nAbstract: We formulate, analyze and solve the problem of best arm identification with fairness constraints on subpopulations (BAICS). Standard best arm identification problems aim at selecting an arm that has the largest expected reward where the expectation is taken over the entire population. The BAICS problem requires that an selected arm must be fair to all subpopulations (e.g., different ethnic groups, age groups, or customer types) by satisfying constraints that the expected reward conditional on every subpopulation needs to be larger than some thresholds. The BAICS problem aims at correctly identify, with high confidence, the arm with the largest expected reward from all arms that satisfy subpopulation constraints. We analyze the complexity of the BAICS problem by proving a best achievable lower bound on the sample complexity with closed-form representation. We then design an algorithm and prove that the algorithm's sample complexity matches with the lower bound in terms of order. A brief",
    "path": "papers/23/04/2304.04091.json",
    "total_tokens": 843,
    "translated_title": "具有亚群公平性约束的最优臂识别",
    "translated_abstract": "我们提出、分析和解决了一个具有亚群公平性约束的最优臂识别问题（BAICS）。标准的最优臂识别问题旨在选择一个期望奖励最大的臂，其中期望是针对整个人群计算的。BAICS问题要求所选臂必须对所有亚群（例如，不同的族群、年龄组或客户类型）都公平，通过满足每个亚群条件下的期望奖励大于一些阈值的约束条件。BAICS问题旨在以高置信度正确鉴定出所有符合亚群约束条件的臂中期望奖励最大的臂。我们通过证明最小样本复杂度的最佳实现下界的闭式表示来分析BAICS问题的复杂度。然后，我们设计了一种算法，并证明该算法的样本复杂度与下界的阶数匹配。",
    "tldr": "本文解决了一个有关最优臂识别的问题，该问题要求所选臂必须对所有亚群都公平。我们提出了一个算法并证明其样本复杂度。"
}