{
    "title": "GIF: A General Graph Unlearning Strategy via Influence Function. (arXiv:2304.02835v1 [cs.LG])",
    "abstract": "With the greater emphasis on privacy and security in our society, the problem of graph unlearning -- revoking the influence of specific data on the trained GNN model, is drawing increasing attention. However, ranging from machine unlearning to recently emerged graph unlearning methods, existing efforts either resort to retraining paradigm, or perform approximate erasure that fails to consider the inter-dependency between connected neighbors or imposes constraints on GNN structure, therefore hard to achieve satisfying performance-complexity trade-offs.  In this work, we explore the influence function tailored for graph unlearning, so as to improve the unlearning efficacy and efficiency for graph unlearning. We first present a unified problem formulation of diverse graph unlearning tasks \\wrt node, edge, and feature. Then, we recognize the crux to the inability of traditional influence function for graph unlearning, and devise Graph Influence Function (GIF), a model-agnostic unlearning m",
    "link": "http://arxiv.org/abs/2304.02835",
    "context": "Title: GIF: A General Graph Unlearning Strategy via Influence Function. (arXiv:2304.02835v1 [cs.LG])\nAbstract: With the greater emphasis on privacy and security in our society, the problem of graph unlearning -- revoking the influence of specific data on the trained GNN model, is drawing increasing attention. However, ranging from machine unlearning to recently emerged graph unlearning methods, existing efforts either resort to retraining paradigm, or perform approximate erasure that fails to consider the inter-dependency between connected neighbors or imposes constraints on GNN structure, therefore hard to achieve satisfying performance-complexity trade-offs.  In this work, we explore the influence function tailored for graph unlearning, so as to improve the unlearning efficacy and efficiency for graph unlearning. We first present a unified problem formulation of diverse graph unlearning tasks \\wrt node, edge, and feature. Then, we recognize the crux to the inability of traditional influence function for graph unlearning, and devise Graph Influence Function (GIF), a model-agnostic unlearning m",
    "path": "papers/23/04/2304.02835.json",
    "total_tokens": 1099,
    "translated_title": "GIF：一种基于影响函数的通用图神经网络遗忘策略",
    "translated_abstract": "随着隐私和安全问题在我们的社会中受到越来越多的关注，在训练过的图神经网络模型中撤销特定数据的影响的图神经网络遗忘问题变得越来越重要。然而，现有的机器遗忘到最近出现的图神经网络遗忘方法，要么采用重新训练的范式，要么执行近似抹消，而这种方法未能考虑到连接邻居之间的相互依赖关系或对GNN结构施加限制，因此很难实现令人满意的性能 - 复杂性平衡。在这项工作中，我们探索了针对图神经网络遗忘量身定制的影响函数，以提高图神经网络遗忘的效果和效率。我们首先提出了各种图神经网络遗忘任务的统一问题表述（节点、边、特征）。然后，我们认识到传统影响函数用于图神经网络遗忘无能为力的关键所在，并设计了图影响函数(GIF)，这是一种模型无关的遗忘机器，利用基于梯度的影响函数从模型中移除特定节点、边或特征的影响，而无需重新训练整个模型。各种数据集上的实验结果表明，与现有基线相比，GIF在效率和效果上均达到了最先进的水平。",
    "tldr": "本文提出了一种模型无关的图神经网络遗忘方法GIF，采用影响函数来移除模型中特定节点、边或特征的影响，在性能和复杂度的平衡上取得了最新的最佳表现。",
    "en_tdlr": "This work proposes a model-agnostic graph unlearning method, GIF, which utilizes an influence function to remove the influence of specific nodes, edges or features without the need to retrain the whole model. Experimental results show that GIF achieves state-of-the-art performance in both effectiveness and efficiency."
}