{
    "title": "MARS: Model-agnostic Biased Object Removal without Additional Supervision for Weakly-Supervised Semantic Segmentation. (arXiv:2304.09913v1 [cs.CV])",
    "abstract": "Weakly-supervised semantic segmentation aims to reduce labeling costs by training semantic segmentation models using weak supervision, such as image-level class labels. However, most approaches struggle to produce accurate localization maps and suffer from false predictions in class-related backgrounds (i.e., biased objects), such as detecting a railroad with the train class. Recent methods that remove biased objects require additional supervision for manually identifying biased objects for each problematic class and collecting their datasets by reviewing predictions, limiting their applicability to the real-world dataset with multiple labels and complex relationships for biasing. Following the first observation that biased features can be separated and eliminated by matching biased objects with backgrounds in the same dataset, we propose a fully-automatic/model-agnostic biased removal framework called MARS (Model-Agnostic biased object Removal without additional Supervision), which ut",
    "link": "http://arxiv.org/abs/2304.09913",
    "context": "Title: MARS: Model-agnostic Biased Object Removal without Additional Supervision for Weakly-Supervised Semantic Segmentation. (arXiv:2304.09913v1 [cs.CV])\nAbstract: Weakly-supervised semantic segmentation aims to reduce labeling costs by training semantic segmentation models using weak supervision, such as image-level class labels. However, most approaches struggle to produce accurate localization maps and suffer from false predictions in class-related backgrounds (i.e., biased objects), such as detecting a railroad with the train class. Recent methods that remove biased objects require additional supervision for manually identifying biased objects for each problematic class and collecting their datasets by reviewing predictions, limiting their applicability to the real-world dataset with multiple labels and complex relationships for biasing. Following the first observation that biased features can be separated and eliminated by matching biased objects with backgrounds in the same dataset, we propose a fully-automatic/model-agnostic biased removal framework called MARS (Model-Agnostic biased object Removal without additional Supervision), which ut",
    "path": "papers/23/04/2304.09913.json",
    "total_tokens": 904,
    "translated_title": "MARS: 无需额外监督进行模型无关的有偏对象去除，用于弱监督语义分割",
    "translated_abstract": "弱监督语义分割旨在通过使用弱监督（如图像级别类别标签）训练语义分割模型来降低标签成本。然而，大多数方法在产生准确的定位图和在类相关背景（如检测具有火车类的铁路）中遭受假预测的有偏对象方面存在困难。 最近的去除偏见对象的方法需要额外的监督以手动识别每个有问题的类的有偏对象并通过审查预测收集它们的数据集，这限制了它们在具有多个标签和复杂关系以偏倚的真实数据集中的适用性。在第一个观察到偏见特征可以通过将偏见对象与相同数据集中的背景匹配来分离和消除的观察之后，我们提出了一个完全自动化/模型无关的有偏去除框架MARS（无需额外监督的模型无关的有偏对象去除），它利用弱监督数据中固有的偏倚模式以有效去除有偏对象，无需任何额外的监督。",
    "tldr": "该论文提出了一种名为MARS的方法，可以在弱监督数据中自动去除有偏对象，而无需额外的监督。",
    "en_tdlr": "This paper proposes a model-agnostic framework called MARS for automatic biased object removal in weakly-supervised data without requiring additional supervision."
}