{
    "title": "Source-free Domain Adaptation Requires Penalized Diversity. (arXiv:2304.02798v1 [cs.LG])",
    "abstract": "While neural networks are capable of achieving human-like performance in many tasks such as image classification, the impressive performance of each model is limited to its own dataset. Source-free domain adaptation (SFDA) was introduced to address knowledge transfer between different domains in the absence of source data, thus, increasing data privacy. Diversity in representation space can be vital to a model`s adaptability in varied and difficult domains. In unsupervised SFDA, the diversity is limited to learning a single hypothesis on the source or learning multiple hypotheses with a shared feature extractor. Motivated by the improved predictive performance of ensembles, we propose a novel unsupervised SFDA algorithm that promotes representational diversity through the use of separate feature extractors with Distinct Backbone Architectures (DBA). Although diversity in feature space is increased, the unconstrained mutual information (MI) maximization may potentially introduce amplifi",
    "link": "http://arxiv.org/abs/2304.02798",
    "context": "Title: Source-free Domain Adaptation Requires Penalized Diversity. (arXiv:2304.02798v1 [cs.LG])\nAbstract: While neural networks are capable of achieving human-like performance in many tasks such as image classification, the impressive performance of each model is limited to its own dataset. Source-free domain adaptation (SFDA) was introduced to address knowledge transfer between different domains in the absence of source data, thus, increasing data privacy. Diversity in representation space can be vital to a model`s adaptability in varied and difficult domains. In unsupervised SFDA, the diversity is limited to learning a single hypothesis on the source or learning multiple hypotheses with a shared feature extractor. Motivated by the improved predictive performance of ensembles, we propose a novel unsupervised SFDA algorithm that promotes representational diversity through the use of separate feature extractors with Distinct Backbone Architectures (DBA). Although diversity in feature space is increased, the unconstrained mutual information (MI) maximization may potentially introduce amplifi",
    "path": "papers/23/04/2304.02798.json",
    "total_tokens": 559,
    "tldr": "这篇论文研究了在没有源数据的情况下，如何通过惩罚多样性来实现源自由的领域适应，并提出一种新的算法，该算法通过使用具有不同骨干架构的独立特征提取器来促进表示多样性。"
}