{
    "title": "Instance Segmentation in the Dark. (arXiv:2304.14298v1 [cs.CV])",
    "abstract": "Existing instance segmentation techniques are primarily tailored for high-visibility inputs, but their performance significantly deteriorates in extremely low-light environments. In this work, we take a deep look at instance segmentation in the dark and introduce several techniques that substantially boost the low-light inference accuracy. The proposed method is motivated by the observation that noise in low-light images introduces high-frequency disturbances to the feature maps of neural networks, thereby significantly degrading performance. To suppress this ``feature noise\", we propose a novel learning method that relies on an adaptive weighted downsampling layer, a smooth-oriented convolutional block, and disturbance suppression learning. These components effectively reduce feature noise during downsampling and convolution operations, enabling the model to learn disturbance-invariant features. Furthermore, we discover that high-bit-depth RAW images can better preserve richer scene i",
    "link": "http://arxiv.org/abs/2304.14298",
    "context": "Title: Instance Segmentation in the Dark. (arXiv:2304.14298v1 [cs.CV])\nAbstract: Existing instance segmentation techniques are primarily tailored for high-visibility inputs, but their performance significantly deteriorates in extremely low-light environments. In this work, we take a deep look at instance segmentation in the dark and introduce several techniques that substantially boost the low-light inference accuracy. The proposed method is motivated by the observation that noise in low-light images introduces high-frequency disturbances to the feature maps of neural networks, thereby significantly degrading performance. To suppress this ``feature noise\", we propose a novel learning method that relies on an adaptive weighted downsampling layer, a smooth-oriented convolutional block, and disturbance suppression learning. These components effectively reduce feature noise during downsampling and convolution operations, enabling the model to learn disturbance-invariant features. Furthermore, we discover that high-bit-depth RAW images can better preserve richer scene i",
    "path": "papers/23/04/2304.14298.json",
    "total_tokens": 924,
    "translated_title": "黑暗环境下的实例分割",
    "translated_abstract": "现有的实例分割技术主要适用于高可见度的输入，但在极低光环境下，它们的性能显著下降。本文深入研究了在黑暗中进行实例分割，并介绍了几种可以显著提高低光推断准确性的技术。所提出的方法是基于这样的观察：低光图像中的噪声会引入高频扰动到神经网络的特征图中，从而显著降低性能。为了抑制这种“特征噪声”，我们提出了一种新的学习方法，它依赖于自适应加权下采样层、平滑定向卷积块和扰动抑制学习。这些组件有效地减少了下采样和卷积操作中的特征噪声，使模型能够学习抗扰动的特征。此外，我们发现高位深的RAW图像可以更好地保留更丰富的场景信息，",
    "tldr": "本文提出了在黑暗环境下的实例分割方法。为了抑制低光图像中的特征噪声，该方法采用了自适应加权下采样层、平滑定向卷积块和扰动抑制学习等技术，同时发现高位深的RAW图像可以更好地保留更丰富的场景信息。",
    "en_tdlr": "This paper proposes a method for instance segmentation in dark environments. To suppress feature noise in low-light images, this method uses adaptive weighted downsampling, smooth-oriented convolutional blocks, and disturbance suppression learning. In addition, the paper discovers that high-bit-depth RAW images can preserve richer scene information."
}