{
    "title": "Bridging the Language Gap: Knowledge Injected Multilingual Question Answering. (arXiv:2304.03159v1 [cs.CL])",
    "abstract": "Question Answering (QA) is the task of automatically answering questions posed by humans in natural languages. There are different settings to answer a question, such as abstractive, extractive, boolean, and multiple-choice QA. As a popular topic in natural language processing tasks, extractive question answering task (extractive QA) has gained extensive attention in the past few years. With the continuous evolvement of the world, generalized cross-lingual transfer (G-XLT), where question and answer context are in different languages, poses some unique challenges over cross-lingual transfer (XLT), where question and answer context are in the same language. With the boost of corresponding development of related benchmarks, many works have been done to improve the performance of various language QA tasks. However, only a few works are dedicated to the G-XLT task. In this work, we propose a generalized cross-lingual transfer framework to enhance the model's ability to understand different",
    "link": "http://arxiv.org/abs/2304.03159",
    "context": "Title: Bridging the Language Gap: Knowledge Injected Multilingual Question Answering. (arXiv:2304.03159v1 [cs.CL])\nAbstract: Question Answering (QA) is the task of automatically answering questions posed by humans in natural languages. There are different settings to answer a question, such as abstractive, extractive, boolean, and multiple-choice QA. As a popular topic in natural language processing tasks, extractive question answering task (extractive QA) has gained extensive attention in the past few years. With the continuous evolvement of the world, generalized cross-lingual transfer (G-XLT), where question and answer context are in different languages, poses some unique challenges over cross-lingual transfer (XLT), where question and answer context are in the same language. With the boost of corresponding development of related benchmarks, many works have been done to improve the performance of various language QA tasks. However, only a few works are dedicated to the G-XLT task. In this work, we propose a generalized cross-lingual transfer framework to enhance the model's ability to understand different",
    "path": "papers/23/04/2304.03159.json",
    "total_tokens": 890,
    "translated_title": "跨越语言鸿沟：注入知识的多语言问答",
    "translated_abstract": "问答（QA）是一种自动回答人类自然语言问题的任务。提取式问答任务（Extractive QA）已经成为自然语言处理任务中备受关注的一个重要方向。与此同时，随着世界的不断发展，不同语言间的通用跨语言转移（G-XLT）带来了跨语言转移（XLT）无法解决的一些独特挑战。本文提出了一个通用的G-XLT框架，通过知识注入的方式，丰富模型对不同语言问答中的知识迁移的理解，从而为实现跨语言的QA任务提供了一些新思路。",
    "tldr": "本文提出了一个跨越语言鸿沟的通用问答框架，通过知识注入帮助模型更好地理解不同语言问答之间的知识迁移。",
    "en_tdlr": "This paper proposes a generalized question answering framework that spans the language gap and enhances cross-lingual transfer through knowledge injection, providing new insights for achieving cross-lingual QA tasks."
}