{
    "title": "MCPrioQ: A lock-free algorithm for online sparse markov-chains. (arXiv:2304.14801v1 [cs.LG])",
    "abstract": "In high performance systems it is sometimes hard to build very large graphs that are efficient both with respect to memory and compute. This paper proposes a data structure called Markov-chain-priority-queue (MCPrioQ), which is a lock-free sparse markov-chain that enables online and continuous learning with time-complexity of $O(1)$ for updates and $O(CDF^{-1}(t))$ inference. MCPrioQ is especially suitable for recommender-systems for lookups of $n$-items in descending probability order. The concurrent updates are achieved using hash-tables and atomic instructions and the lookups are achieved through a novel priority-queue which allows for approximately correct results even during concurrent updates. The approximatly correct and lock-free property is maintained by a read-copy-update scheme, but where the semantics have been slightly updated to allow for swap of elements rather than the traditional pop-insert scheme.",
    "link": "http://arxiv.org/abs/2304.14801",
    "context": "Title: MCPrioQ: A lock-free algorithm for online sparse markov-chains. (arXiv:2304.14801v1 [cs.LG])\nAbstract: In high performance systems it is sometimes hard to build very large graphs that are efficient both with respect to memory and compute. This paper proposes a data structure called Markov-chain-priority-queue (MCPrioQ), which is a lock-free sparse markov-chain that enables online and continuous learning with time-complexity of $O(1)$ for updates and $O(CDF^{-1}(t))$ inference. MCPrioQ is especially suitable for recommender-systems for lookups of $n$-items in descending probability order. The concurrent updates are achieved using hash-tables and atomic instructions and the lookups are achieved through a novel priority-queue which allows for approximately correct results even during concurrent updates. The approximatly correct and lock-free property is maintained by a read-copy-update scheme, but where the semantics have been slightly updated to allow for swap of elements rather than the traditional pop-insert scheme.",
    "path": "papers/23/04/2304.14801.json",
    "total_tokens": 881,
    "translated_title": "MCPrioQ: 一种用于在线稀疏Markov链的无锁算法",
    "translated_abstract": "在高性能系统中，构建内存和计算效率高的大型图形有时很困难。本文提出了一种名为Markov-chain-priority-queue(MCPrioQ)的数据结构，它是一种无锁稀疏Markov链，可以实现在线和连续学习，时间复杂度为$O（1）$用于更新和$O(CDF^{-1}(t))$用于推理。MCPrioQ特别适用于推荐系统，以降序概率顺序查找n个项目。并发更新是通过哈希表和原子指令实现的，查找是通过一种新颖的优先级队列实现的，即使在并发更新期间，也可以得到近似正确的结果。近似正确和无锁定属性由读取-复制-更新方案维护，但语义已略微更新，以允许元素的交换而不是传统的弹出-插入方案。",
    "tldr": "本文提出了MCPrioQ算法，一种无锁稀疏Markov链数据结构，用于在线和连续学习，特别适用于推荐系统，时间复杂度为$O(1)$用于更新和$O(CDF^{-1}(t))$用于推理。",
    "en_tdlr": "This paper proposes MCPrioQ, a lock-free sparse Markov-chain data structure that enables online and continuous learning, especially suitable for recommender systems, with time-complexity of $O(1)$ for updates and $O(CDF^{-1}(t))$ for inference."
}