{
    "title": "Causal Repair of Learning-enabled Cyber-physical Systems. (arXiv:2304.02813v1 [eess.SY])",
    "abstract": "Models of actual causality leverage domain knowledge to generate convincing diagnoses of events that caused an outcome. It is promising to apply these models to diagnose and repair run-time property violations in cyber-physical systems (CPS) with learning-enabled components (LEC). However, given the high diversity and complexity of LECs, it is challenging to encode domain knowledge (e.g., the CPS dynamics) in a scalable actual causality model that could generate useful repair suggestions. In this paper, we focus causal diagnosis on the input/output behaviors of LECs. Specifically, we aim to identify which subset of I/O behaviors of the LEC is an actual cause for a property violation. An important by-product is a counterfactual version of the LEC that repairs the run-time property by fixing the identified problematic behaviors. Based on this insights, we design a two-step diagnostic pipeline: (1) construct and Halpern-Pearl causality model that reflects the dependency of property outcom",
    "link": "http://arxiv.org/abs/2304.02813",
    "context": "Title: Causal Repair of Learning-enabled Cyber-physical Systems. (arXiv:2304.02813v1 [eess.SY])\nAbstract: Models of actual causality leverage domain knowledge to generate convincing diagnoses of events that caused an outcome. It is promising to apply these models to diagnose and repair run-time property violations in cyber-physical systems (CPS) with learning-enabled components (LEC). However, given the high diversity and complexity of LECs, it is challenging to encode domain knowledge (e.g., the CPS dynamics) in a scalable actual causality model that could generate useful repair suggestions. In this paper, we focus causal diagnosis on the input/output behaviors of LECs. Specifically, we aim to identify which subset of I/O behaviors of the LEC is an actual cause for a property violation. An important by-product is a counterfactual version of the LEC that repairs the run-time property by fixing the identified problematic behaviors. Based on this insights, we design a two-step diagnostic pipeline: (1) construct and Halpern-Pearl causality model that reflects the dependency of property outcom",
    "path": "papers/23/04/2304.02813.json",
    "total_tokens": 874,
    "translated_title": "学习增强型物联网系统的因果修复",
    "translated_abstract": "实际因果模型使用领域知识生成导致结果的事件的令人信服的诊断。将这些模型应用于具有学习增强组件（LEC）的物联网系统（CPS）中诊断和修复运行时属性违规是有希望的。然而，鉴于LEC的高多样性和复杂性，将领域知识（例如CPS动态）编码成可生成有用修复建议的可扩展实际因果模型是具有挑战性的。在本文中，我们将因果诊断集中于LEC的输入/输出行为。具体而言，我们的目标是确定LEC的哪个输入/输出行为子集是导致属性违规的真正原因。一个重要的副产品是矫正识别出有问题的行为来修复运行时属性的LEC的反事实版本。基于这些结果，我们设计了一个两步诊断流程：（1）构建Halpern-Pearl因果模型以反映属性结果的依赖关系。",
    "tldr": "本文提出了一种学习增强型物联网系统的因果诊断和修复方法，通过矫正有问题的输入/输出行为子集，识别真正的属性违规原因并修复。",
    "en_tdlr": "This paper proposes a causal diagnosis and repair method for learning-enabled cyber-physical systems, which identifies the true cause of property violations and repairs by correcting problematic subsets of input/output behavior of LEC."
}