{
    "title": "Evolving Three Dimension (3D) Abstract Art: Fitting Concepts by Language. (arXiv:2304.12932v1 [cs.CV])",
    "abstract": "Computational creativity has contributed heavily to abstract art in modern era, allowing artists to create high quality, abstract two dimension (2D) arts with a high level of controllability and expressibility. However, even with computational approaches that have promising result in making concrete 3D art, computationally addressing abstract 3D art with high-quality and controllability remains an open question. To fill this gap, we propose to explore computational creativity in making abstract 3D art by bridging evolution strategies (ES) and 3D rendering through customizable parameterization of scenes. We demonstrate that our approach is capable of placing semi-transparent triangles in 3D scenes that, when viewed from specified angles, render into films that look like artists' specification expressed in natural language. This provides a new way for the artist to easily express creativity ideas for abstract 3D art. The supplementary material, which contains code, animation for all figu",
    "link": "http://arxiv.org/abs/2304.12932",
    "context": "Title: Evolving Three Dimension (3D) Abstract Art: Fitting Concepts by Language. (arXiv:2304.12932v1 [cs.CV])\nAbstract: Computational creativity has contributed heavily to abstract art in modern era, allowing artists to create high quality, abstract two dimension (2D) arts with a high level of controllability and expressibility. However, even with computational approaches that have promising result in making concrete 3D art, computationally addressing abstract 3D art with high-quality and controllability remains an open question. To fill this gap, we propose to explore computational creativity in making abstract 3D art by bridging evolution strategies (ES) and 3D rendering through customizable parameterization of scenes. We demonstrate that our approach is capable of placing semi-transparent triangles in 3D scenes that, when viewed from specified angles, render into films that look like artists' specification expressed in natural language. This provides a new way for the artist to easily express creativity ideas for abstract 3D art. The supplementary material, which contains code, animation for all figu",
    "path": "papers/23/04/2304.12932.json",
    "total_tokens": 923,
    "translated_title": "进化三维抽象艺术：通过语言匹配概念",
    "translated_abstract": "计算创意在现代抽象艺术中发挥了重要作用，使艺术家能够创建高质量、抽象的二维艺术，具有高度的可控性和表现力。然而，即使是具有良好结果的计算方法在创作具体的三维艺术方面，处理高质量、可控性的抽象三维艺术仍然是一个悬而未决的问题。为了填补这一空白，我们建议通过场景的可自定义参数化，将进化策略（ES）和3D渲染相结合，探索在制作抽象三维艺术方面的计算创意。我们展示了我们的方法能够在3D场景中放置半透明三角形，在从指定角度查看时，呈现出看起来像艺术家使用自然语言表达的规格说明的影片。这为艺术家提供了一个新的方式，方便地表达抽象三维艺术的创意想法。",
    "tldr": "本论文介绍了一种通过进化策略和3D渲染相结合的方法，使艺术家能够使用自然语言表达抽象三维艺术的创意想法。",
    "en_tdlr": "This paper proposes a method of exploring computational creativity in making abstract 3D art by bridging evolution strategies (ES) and 3D rendering through customizable parameterization of scenes, providing a new way for the artist to easily express creative ideas for abstract 3D art."
}