{
    "title": "Denoising Cosine Similarity: A Theory-Driven Approach for Efficient Representation Learning. (arXiv:2304.09552v1 [stat.ML])",
    "abstract": "Representation learning has been increasing its impact on the research and practice of machine learning, since it enables to learn representations that can apply to various downstream tasks efficiently. However, recent works pay little attention to the fact that real-world datasets used during the stage of representation learning are commonly contaminated by noise, which can degrade the quality of learned representations. This paper tackles the problem to learn robust representations against noise in a raw dataset. To this end, inspired by recent works on denoising and the success of the cosine-similarity-based objective functions in representation learning, we propose the denoising Cosine-Similarity (dCS) loss. The dCS loss is a modified cosine-similarity loss and incorporates a denoising property, which is supported by both our theoretical and empirical findings. To make the dCS loss implementable, we also construct the estimators of the dCS loss with statistical guarantees. Finally,",
    "link": "http://arxiv.org/abs/2304.09552",
    "context": "Title: Denoising Cosine Similarity: A Theory-Driven Approach for Efficient Representation Learning. (arXiv:2304.09552v1 [stat.ML])\nAbstract: Representation learning has been increasing its impact on the research and practice of machine learning, since it enables to learn representations that can apply to various downstream tasks efficiently. However, recent works pay little attention to the fact that real-world datasets used during the stage of representation learning are commonly contaminated by noise, which can degrade the quality of learned representations. This paper tackles the problem to learn robust representations against noise in a raw dataset. To this end, inspired by recent works on denoising and the success of the cosine-similarity-based objective functions in representation learning, we propose the denoising Cosine-Similarity (dCS) loss. The dCS loss is a modified cosine-similarity loss and incorporates a denoising property, which is supported by both our theoretical and empirical findings. To make the dCS loss implementable, we also construct the estimators of the dCS loss with statistical guarantees. Finally,",
    "path": "papers/23/04/2304.09552.json",
    "total_tokens": 883,
    "translated_title": "去噪余弦相似度：一种理论驱动的有效表示学习方法",
    "translated_abstract": "表示学习已经在机器学习的研究和实践中发挥着越来越大的影响，因为它能够学习出可以有效应用于各种下游任务的表示形式。然而，最近的研究很少关注到表示学习阶段中使用的真实数据集通常会受到噪声污染，这可能会降低学习出的表示形式的质量。本文解决了在原始数据集中学习鲁棒表示形式的问题。为此，受到最近去噪相关工作和基于余弦相似度目标函数在表示学习中的成功的启发，我们提出了去噪余弦相似度（dCS）损失函数。dCS损失是一种修改过的余弦相似度损失函数，具有去噪属性，这一点得到了我们的理论和实证研究的支持。为了使dCS损失可实现，我们还构建了具有统计保证的dCS损失估计器。",
    "tldr": "本文提出了一种去噪余弦相似度（dCS）损失函数， 可以用于在原始数据集中学习鲁棒的表示形式。",
    "en_tdlr": "This paper proposes a denoising cosine-similarity (dCS) loss function for learning robust representations against noise in raw datasets, which incorporates the denoising property and has both theoretical and empirical support."
}