{
    "title": "Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN) for Travel Demand Forecasting During Wildfires. (arXiv:2304.06233v1 [cs.LG])",
    "abstract": "Real-time forecasting of travel demand during wildfire evacuations is crucial for emergency managers and transportation planners to make timely and better-informed decisions. However, few studies focus on accurate travel demand forecasting in large-scale emergency evacuations. Therefore, this study develops and tests a new methodological framework for modeling trip generation in wildfire evacuations by using (a) large-scale GPS data generated by mobile devices and (b) state-of-the-art AI technologies. The proposed methodology aims at forecasting evacuation trips and other types of trips. Based on the travel demand inferred from the GPS data, we develop a new deep learning model, i.e., Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN), along with a model updating scheme to achieve real-time forecasting of travel demand during wildfire evacuations. The proposed methodological framework is tested in this study for a real-world case study: the 2019 Kincade Fire in So",
    "link": "http://arxiv.org/abs/2304.06233",
    "context": "Title: Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN) for Travel Demand Forecasting During Wildfires. (arXiv:2304.06233v1 [cs.LG])\nAbstract: Real-time forecasting of travel demand during wildfire evacuations is crucial for emergency managers and transportation planners to make timely and better-informed decisions. However, few studies focus on accurate travel demand forecasting in large-scale emergency evacuations. Therefore, this study develops and tests a new methodological framework for modeling trip generation in wildfire evacuations by using (a) large-scale GPS data generated by mobile devices and (b) state-of-the-art AI technologies. The proposed methodology aims at forecasting evacuation trips and other types of trips. Based on the travel demand inferred from the GPS data, we develop a new deep learning model, i.e., Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN), along with a model updating scheme to achieve real-time forecasting of travel demand during wildfire evacuations. The proposed methodological framework is tested in this study for a real-world case study: the 2019 Kincade Fire in So",
    "path": "papers/23/04/2304.06233.json",
    "total_tokens": 1011,
    "translated_title": "基于SA-MGCRN的野火疏散情况下交通需求预测方法研究",
    "translated_abstract": "在野火疏散期间实时准确地预测交通需求对于应急管理人员和交通规划者做出及时和明智的决策至关重要。然而，目前很少有研究关注大规模紧急疏散情况下的准确交通需求预测。因此，本研究提出并测试了一种新的方法框架，利用大规模移动设备生成的GPS数据和最先进的人工智能技术，建立了采用多种数据源的出行生成模型，并开展了交通需求预测。基于GPS数据推断出的交通需求，本研究提出了一种新的深度学习模型——基于SA-MGCRN的情境感知多图卷积递归网络，并提出了一种模型更新方案以实现野火疏散期间交通需求的实时预测。本研究在真实案例——加利福尼亚州索诺玛县2019年Kincade火灾中对提出的方法框架进行了测试。",
    "tldr": "本研究提出一种新的方法框架，利用大规模GPS数据和最先进的人工智能技术，建立了采用多种数据源的出行生成模型，并提出了基于SA-MGCRN的情境感知多图卷积递归网络以实现野火疏散时交通需求的实时预测。",
    "en_tdlr": "This study proposes a new methodology for modeling trip generation in wildfire evacuations using large-scale GPS data and state-of-the-art AI technologies, and proposes a Situational-Aware Multi-Graph Convolutional Recurrent Network (SA-MGCRN) to achieve real-time forecasting of travel demand during wildfire evacuations."
}