{
    "title": "Predicting multiple sclerosis disease severity with multimodal deep neural networks. (arXiv:2304.04062v1 [cs.LG])",
    "abstract": "Multiple Sclerosis (MS) is a chronic disease developed in human brain and spinal cord, which can cause permanent damage or deterioration of the nerves. The severity of MS disease is monitored by the Expanded Disability Status Scale (EDSS), composed of several functional sub-scores. Early and accurate classification of MS disease severity is critical for slowing down or preventing disease progression via applying early therapeutic intervention strategies. Recent advances in deep learning and the wide use of Electronic Health Records (EHR) creates opportunities to apply data-driven and predictive modeling tools for this goal. Previous studies focusing on using single-modal machine learning and deep learning algorithms were limited in terms of prediction accuracy due to the data insufficiency or model simplicity. In this paper, we proposed an idea of using patients' multimodal longitudinal and longitudinal EHR data to predict multiple sclerosis disease severity at the hospital visit. This",
    "link": "http://arxiv.org/abs/2304.04062",
    "context": "Title: Predicting multiple sclerosis disease severity with multimodal deep neural networks. (arXiv:2304.04062v1 [cs.LG])\nAbstract: Multiple Sclerosis (MS) is a chronic disease developed in human brain and spinal cord, which can cause permanent damage or deterioration of the nerves. The severity of MS disease is monitored by the Expanded Disability Status Scale (EDSS), composed of several functional sub-scores. Early and accurate classification of MS disease severity is critical for slowing down or preventing disease progression via applying early therapeutic intervention strategies. Recent advances in deep learning and the wide use of Electronic Health Records (EHR) creates opportunities to apply data-driven and predictive modeling tools for this goal. Previous studies focusing on using single-modal machine learning and deep learning algorithms were limited in terms of prediction accuracy due to the data insufficiency or model simplicity. In this paper, we proposed an idea of using patients' multimodal longitudinal and longitudinal EHR data to predict multiple sclerosis disease severity at the hospital visit. This",
    "path": "papers/23/04/2304.04062.json",
    "total_tokens": 933,
    "translated_title": "利用多模态深度神经网络预测多发性硬化症疾病严重程度",
    "translated_abstract": "多发性硬化症（MS）是一种发展在人类大脑和脊髓中的慢性疾病，可能会导致神经永久性损伤或恶化。MS病情的严重程度是通过扩展残疾状态评分（EDSS）来监测的，该评分由几个功能子分数组成。早期和准确的MS疾病严重程度分类对于通过应用早期治疗干预策略来减缓或预防疾病进展至关重要。 近年来深度学习的进展和电子健康记录（EHR）的广泛应用为应用数据驱动和预测建模工具提供了机会。以往专注于利用单模态机器学习和深度学习算法的研究由于数据不足或模型简单而限制了预测准确性。在本文中，我们提出了使用患者的多模态纵向和横向EHR数据预测医院访问时的多发性硬化症疾病严重程度的想法。",
    "tldr": "本研究提出使用患者的多模态EHR数据预测多发性硬化症疾病严重程度，以便实现早期干预和治疗。提高了预测准确性和模型复杂度。",
    "en_tdlr": "This study proposes using patients' multimodal EHR data to predict multiple sclerosis disease severity for early intervention and treatment, with an improvement in prediction accuracy and model complexity."
}