{
    "title": "Matched Machine Learning: A Generalized Framework for Treatment Effect Inference With Learned Metrics. (arXiv:2304.01316v1 [stat.ME])",
    "abstract": "We introduce Matched Machine Learning, a framework that combines the flexibility of machine learning black boxes with the interpretability of matching, a longstanding tool in observational causal inference. Interpretability is paramount in many high-stakes application of causal inference. Current tools for nonparametric estimation of both average and individualized treatment effects are black-boxes that do not allow for human auditing of estimates. Our framework uses machine learning to learn an optimal metric for matching units and estimating outcomes, thus achieving the performance of machine learning black-boxes, while being interpretable. Our general framework encompasses several published works as special cases. We provide asymptotic inference theory for our proposed framework, enabling users to construct approximate confidence intervals around estimates of both individualized and average treatment effects. We show empirically that instances of Matched Machine Learning perform on ",
    "link": "http://arxiv.org/abs/2304.01316",
    "context": "Title: Matched Machine Learning: A Generalized Framework for Treatment Effect Inference With Learned Metrics. (arXiv:2304.01316v1 [stat.ME])\nAbstract: We introduce Matched Machine Learning, a framework that combines the flexibility of machine learning black boxes with the interpretability of matching, a longstanding tool in observational causal inference. Interpretability is paramount in many high-stakes application of causal inference. Current tools for nonparametric estimation of both average and individualized treatment effects are black-boxes that do not allow for human auditing of estimates. Our framework uses machine learning to learn an optimal metric for matching units and estimating outcomes, thus achieving the performance of machine learning black-boxes, while being interpretable. Our general framework encompasses several published works as special cases. We provide asymptotic inference theory for our proposed framework, enabling users to construct approximate confidence intervals around estimates of both individualized and average treatment effects. We show empirically that instances of Matched Machine Learning perform on ",
    "path": "papers/23/04/2304.01316.json",
    "total_tokens": 935,
    "translated_title": "匹配机器学习：基于学习度量的治疗效果推断的广义框架",
    "translated_abstract": "我们介绍了匹配机器学习，这是一种将机器学习黑盒的灵活性与匹配的可解释性相结合的框架，匹配是观察性因果推断中长期以来的一种工具。在许多高风险的因果推断应用中，可解释性是至关重要的。当前非参数估计平均和个性化治疗效果的工具都是黑盒子，不允许人类审计估计结果。我们的框架使用机器学习来学习用于匹配单位和估计结果的最佳度量，从而实现了机器学习黑盒子的性能，同时保持可解释性。我们的广义框架包含多个已发表作品作为特殊情况。我们为我们提出的框架提供渐近推断理论，使用户能够在个性化和平均治疗效果估计的结果周围构建近似置信区间。我们实证表明匹配机器学习的实例具有极高的表现。",
    "tldr": "匹配机器学习结合了机器学习的灵活性和匹配的可解释性，通过学习最佳度量用于匹配单位和估计结果，旨在实现机器学习黑盒子的性能，同时可解释结果，并具有广泛的应用前景。",
    "en_tdlr": "Matched machine learning combines the flexibility of black-box machine learning with the interpretability of matching for causal inference. This framework uses machine learning to learn optimal metrics for matching and outcome estimation, maintaining interpretability while achieving the performance of black-box methods. As a result, matched machine learning has broad application potential in high-stakes causal inference tasks."
}