{
    "title": "A few-shot graph Laplacian-based approach for improving the accuracy of low-fidelity data. (arXiv:2304.04862v1 [cs.LG])",
    "abstract": "Low-fidelity data is typically inexpensive to generate but inaccurate. On the other hand, high-fidelity data is accurate but expensive to obtain. Multi-fidelity methods use a small set of high-fidelity data to enhance the accuracy of a large set of low-fidelity data. In the approach described in this paper, this is accomplished by constructing a graph Laplacian using the low-fidelity data and computing its low-lying spectrum. This spectrum is then used to cluster the data and identify points that are closest to the centroids of the clusters. High-fidelity data is then acquired for these key points. Thereafter, a transformation that maps every low-fidelity data point to its bi-fidelity counterpart is determined by minimizing the discrepancy between the bi- and high-fidelity data at the key points, and to preserve the underlying structure of the low-fidelity data distribution. The latter objective is achieved by relying, once again, on the spectral properties of the graph Laplacian. This",
    "link": "http://arxiv.org/abs/2304.04862",
    "context": "Title: A few-shot graph Laplacian-based approach for improving the accuracy of low-fidelity data. (arXiv:2304.04862v1 [cs.LG])\nAbstract: Low-fidelity data is typically inexpensive to generate but inaccurate. On the other hand, high-fidelity data is accurate but expensive to obtain. Multi-fidelity methods use a small set of high-fidelity data to enhance the accuracy of a large set of low-fidelity data. In the approach described in this paper, this is accomplished by constructing a graph Laplacian using the low-fidelity data and computing its low-lying spectrum. This spectrum is then used to cluster the data and identify points that are closest to the centroids of the clusters. High-fidelity data is then acquired for these key points. Thereafter, a transformation that maps every low-fidelity data point to its bi-fidelity counterpart is determined by minimizing the discrepancy between the bi- and high-fidelity data at the key points, and to preserve the underlying structure of the low-fidelity data distribution. The latter objective is achieved by relying, once again, on the spectral properties of the graph Laplacian. This",
    "path": "papers/23/04/2304.04862.json",
    "total_tokens": 903,
    "translated_title": "一种用于提高低保真数据准确性的少样本图拉普拉斯方法",
    "translated_abstract": "低保真数据通常产生成本低廉，但不准确。相反，高保真数据准确但获取成本昂贵。多保真度方法使用一小组高保真数据来增强大量低保真数据的准确性。本文所描述的方法是通过使用低保真数据构建图拉普拉斯并计算其低能量谱来实现的。然后，利用此谱来对数据进行聚类并识别与聚类重心最近的数据点。随后，为这些关键点获取高保真数据。然后通过最小化关键点处的双保真数据与高保真数据之间的差异，并保持低保真数据分布的基础结构来确定将每个低保真数据点映射到其双保真数据对应物的转换。后一个目标再次是通过依赖图拉普拉斯的谱特性来实现的。",
    "tldr": "本文提出的方法利用少量高保真数据来提高大量低保真数据的准确性，方法包括构建图拉普拉斯和计算其低能量谱来将数据聚类，并获取关键点的高保真数据进行转换。",
    "en_tdlr": "This paper proposes a few-shot graph Laplacian-based approach to enhance the accuracy of low-fidelity data by using a small set of high-fidelity data, which involves constructing graph Laplacian, computing its low-lying spectrum, clustering data, acquiring high-fidelity data for key points, and determining a transformation to map low-fidelity data to its bi-fidelity counterpart."
}