{
    "title": "Adaptive Failure Search Using Critical States from Domain Experts. (arXiv:2304.00365v1 [cs.RO])",
    "abstract": "Uncovering potential failure cases is a crucial step in the validation of safety critical systems such as autonomous vehicles. Failure search may be done through logging substantial vehicle miles in either simulation or real world testing. Due to the sparsity of failure events, naive random search approaches require significant amounts of vehicle operation hours to find potential system weaknesses. As a result, adaptive searching techniques have been proposed to efficiently explore and uncover failure trajectories of an autonomous policy in simulation. Adaptive Stress Testing (AST) is one such method that poses the problem of failure search as a Markov decision process and uses reinforcement learning techniques to find high probability failures. However, this formulation requires a probability model for the actions of all agents in the environment. In systems where the environment actions are discrete and dependencies among agents exist, it may be infeasible to fully characterize the d",
    "link": "http://arxiv.org/abs/2304.00365",
    "context": "Title: Adaptive Failure Search Using Critical States from Domain Experts. (arXiv:2304.00365v1 [cs.RO])\nAbstract: Uncovering potential failure cases is a crucial step in the validation of safety critical systems such as autonomous vehicles. Failure search may be done through logging substantial vehicle miles in either simulation or real world testing. Due to the sparsity of failure events, naive random search approaches require significant amounts of vehicle operation hours to find potential system weaknesses. As a result, adaptive searching techniques have been proposed to efficiently explore and uncover failure trajectories of an autonomous policy in simulation. Adaptive Stress Testing (AST) is one such method that poses the problem of failure search as a Markov decision process and uses reinforcement learning techniques to find high probability failures. However, this formulation requires a probability model for the actions of all agents in the environment. In systems where the environment actions are discrete and dependencies among agents exist, it may be infeasible to fully characterize the d",
    "path": "papers/23/04/2304.00365.json",
    "total_tokens": 668,
    "translated_title": "领域专家关键状态自适应失效搜索法",
    "translated_abstract": "发现潜在故障是验证安全关键系统（如自动驾驶汽车）的重要步骤。由于故障事件的稀少性，使用随机搜索方法需要耗费大量的时间来找到潜在的系统弱点。因此，提出了自适应搜索技术来有效地探索和发现自主策略在仿真中的失效轨迹。本文提出了一种基于领域专家的自适应失效搜索方法。",
    "tldr": "本文提出了一种基于领域专家的自适应失效搜索方法，用于有效地探索和发现自主策略在仿真中的失效轨迹。"
}