{
    "title": "Combining Generators of Adversarial Malware Examples to Increase Evasion Rate. (arXiv:2304.07360v1 [cs.CR])",
    "abstract": "Antivirus developers are increasingly embracing machine learning as a key component of malware defense. While machine learning achieves cutting-edge outcomes in many fields, it also has weaknesses that are exploited by several adversarial attack techniques. Many authors have presented both white-box and black-box generators of adversarial malware examples capable of bypassing malware detectors with varying success. We propose to combine contemporary generators in order to increase their potential. Combining different generators can create more sophisticated adversarial examples that are more likely to evade anti-malware tools. We demonstrated this technique on five well-known generators and recorded promising results. The best-performing combination of AMG-random and MAB-Malware generators achieved an average evasion rate of 15.9% against top-tier antivirus products. This represents an average improvement of more than 36% and 627% over using only the AMG-random and MAB-Malware generato",
    "link": "http://arxiv.org/abs/2304.07360",
    "context": "Title: Combining Generators of Adversarial Malware Examples to Increase Evasion Rate. (arXiv:2304.07360v1 [cs.CR])\nAbstract: Antivirus developers are increasingly embracing machine learning as a key component of malware defense. While machine learning achieves cutting-edge outcomes in many fields, it also has weaknesses that are exploited by several adversarial attack techniques. Many authors have presented both white-box and black-box generators of adversarial malware examples capable of bypassing malware detectors with varying success. We propose to combine contemporary generators in order to increase their potential. Combining different generators can create more sophisticated adversarial examples that are more likely to evade anti-malware tools. We demonstrated this technique on five well-known generators and recorded promising results. The best-performing combination of AMG-random and MAB-Malware generators achieved an average evasion rate of 15.9% against top-tier antivirus products. This represents an average improvement of more than 36% and 627% over using only the AMG-random and MAB-Malware generato",
    "path": "papers/23/04/2304.07360.json",
    "total_tokens": 928,
    "translated_title": "结合对抗性恶意软件示例的生成器以增加规避率。",
    "translated_abstract": "杀毒软件开发人员越来越多地拥抱机器学习作为恶意软件防御的关键组成部分。虽然机器学习在许多领域取得了尖端的成果，但它也有弱点，被几种对抗性攻击技术所利用。许多作者提出了能够绕过恶意软件检测器的白盒和黑盒生成器的对抗性恶意软件示例，其成功率有所不同。我们建议将现代生成器结合起来，以增加它们的潜力。结合不同的生成器可以创建更复杂的对抗性示例，这些示例更有可能逃避反恶意软件工具的检测。我们在五个知名的生成器上演示了这种技术，并记录了有希望的结果。AMG-random和MAB-Malware生成器的最佳组合对顶尖杀毒产品的平均规避率为15.9%。这代表了使用仅AMG-random和MAB-Malware生成器的结果平均提高了超过36%和627%。",
    "tldr": "本文介绍了一种结合不同生成器的技术，以创建更复杂的对抗性示例，从而大幅提高逃避反恶意软件工具的检测的成功率。"
}