{
    "title": "USNID: A Framework for Unsupervised and Semi-supervised New Intent Discovery. (arXiv:2304.07699v1 [cs.CL])",
    "abstract": "New intent discovery is of great value to natural language processing, allowing for a better understanding of user needs and providing friendly services. However, most existing methods struggle to capture the complicated semantics of discrete text representations when limited or no prior knowledge of labeled data is available. To tackle this problem, we propose a novel framework called USNID for unsupervised and semi-supervised new intent discovery, which has three key technologies. First, it takes full use of unsupervised or semi-supervised data to mine shallow semantic similarity relations and provide well-initialized representations for clustering. Second, it designs a centroid-guided clustering mechanism to address the issue of cluster allocation inconsistency and provide high-quality self-supervised targets for representation learning. Third, it captures high-level semantics in unsupervised or semi-supervised data to discover fine-grained intent-wise clusters by optimizing both cl",
    "link": "http://arxiv.org/abs/2304.07699",
    "context": "Title: USNID: A Framework for Unsupervised and Semi-supervised New Intent Discovery. (arXiv:2304.07699v1 [cs.CL])\nAbstract: New intent discovery is of great value to natural language processing, allowing for a better understanding of user needs and providing friendly services. However, most existing methods struggle to capture the complicated semantics of discrete text representations when limited or no prior knowledge of labeled data is available. To tackle this problem, we propose a novel framework called USNID for unsupervised and semi-supervised new intent discovery, which has three key technologies. First, it takes full use of unsupervised or semi-supervised data to mine shallow semantic similarity relations and provide well-initialized representations for clustering. Second, it designs a centroid-guided clustering mechanism to address the issue of cluster allocation inconsistency and provide high-quality self-supervised targets for representation learning. Third, it captures high-level semantics in unsupervised or semi-supervised data to discover fine-grained intent-wise clusters by optimizing both cl",
    "path": "papers/23/04/2304.07699.json",
    "total_tokens": 911,
    "translated_title": "USNID: 无监督和半监督新意图发现的框架",
    "translated_abstract": "新意图发现对自然语言处理非常有价值，使我们更好地理解用户需求并提供友好的服务。然而，在有限或没有标记数据的情况下，大多数现有方法难以捕捉离散文本表示的复杂语义。为了解决这个问题，我们提出了一种名为USNID的新框架，用于无监督和半监督新意图发现，具有三个关键技术：充分利用无监督或半监督数据挖掘浅层语义相似性关系；设计聚类机制解决簇分配不一致的问题；捕获无监督或半监督数据中的高级语义，通过同时优化聚类和自我监督来发现细粒度的意图簇。",
    "tldr": "该论文提出了一个名为USNID的框架，用于无监督和半监督的新意图发现，解决了利用有限或无标记数据时难以捕捉复杂语义的问题，并设计了聚类机制来提高自我监督目标的质量，从而发现细粒度的意图簇。",
    "en_tdlr": "This paper proposes a framework called USNID for unsupervised and semi-supervised new intent discovery, which addresses the issue of capturing complicated semantics with limited or no prior knowledge of labeled data, by utilizing unsupervised or semi-supervised data to mine shallow semantic similarity relations and designing a centroid-guided clustering mechanism to improve self-supervised targets for representation learning, and captures high-level semantics in unsupervised or semi-supervised data to discover fine-grained intent-wise clusters through optimizing both clustering and self-supervision."
}