{
    "title": "Dialogue-Contextualized Re-ranking for Medical History-Taking. (arXiv:2304.01974v1 [cs.CL])",
    "abstract": "AI-driven medical history-taking is an important component in symptom checking, automated patient intake, triage, and other AI virtual care applications. As history-taking is extremely varied, machine learning models require a significant amount of data to train. To overcome this challenge, existing systems are developed using indirect data or expert knowledge. This leads to a training-inference gap as models are trained on different kinds of data than what they observe at inference time. In this work, we present a two-stage re-ranking approach that helps close the training-inference gap by re-ranking the first-stage question candidates using a dialogue-contextualized model. For this, we propose a new model, global re-ranker, which cross-encodes the dialogue with all questions simultaneously, and compare it with several existing neural baselines. We test both transformer and S4-based language model backbones. We find that relative to the expert system, the best performance is achieved ",
    "link": "http://arxiv.org/abs/2304.01974",
    "context": "Title: Dialogue-Contextualized Re-ranking for Medical History-Taking. (arXiv:2304.01974v1 [cs.CL])\nAbstract: AI-driven medical history-taking is an important component in symptom checking, automated patient intake, triage, and other AI virtual care applications. As history-taking is extremely varied, machine learning models require a significant amount of data to train. To overcome this challenge, existing systems are developed using indirect data or expert knowledge. This leads to a training-inference gap as models are trained on different kinds of data than what they observe at inference time. In this work, we present a two-stage re-ranking approach that helps close the training-inference gap by re-ranking the first-stage question candidates using a dialogue-contextualized model. For this, we propose a new model, global re-ranker, which cross-encodes the dialogue with all questions simultaneously, and compare it with several existing neural baselines. We test both transformer and S4-based language model backbones. We find that relative to the expert system, the best performance is achieved ",
    "path": "papers/23/04/2304.01974.json",
    "total_tokens": 927,
    "translated_title": "医学史采集的对话情境重排序",
    "translated_abstract": "基于人工智能的医学史采集是症状检查、自动患者接待、分诊和其他人工智能虚拟护理应用的重要组成部分。由于病史采集方式的多样性，机器学习模型需要大量的数据进行训练。为了克服这个挑战，现有的系统使用间接数据或专家知识进行开发。这导致了训练和推断之间的差距，因为模型是在不同类型的数据上进行训练，而不是在推断时观察到的数据上进行训练。在本文中，我们提出了一个两阶段的重排序方法，通过使用对话情境下的模型重新对第一阶段的问题候选者进行排序，帮助缩小训练和推断之间的差距。为此，我们提出了一种新模型——全局重排序器，该模型同时将所有问题与对话进行交叉编码，并将其与几种现有的神经线路进行比较。我们测试了transformer和S4语言模型背景下的性能。我们发现，相对于专家系统，最佳表现是实现的。",
    "tldr": "本文提出了一种采用对话情境下的模型进行重排序的方法，帮助机器学习模型缩小训练和推断之间的差距，以改进人工智能医学史采集。",
    "en_tdlr": "This paper proposes a two-stage re-ranking approach that uses a dialogue-contextualized model to improve AI-driven medical history-taking, and closes the gap between training and inference of machine learning models."
}