{
    "title": "Effective control of two-dimensional Rayleigh--B\\'enard convection: invariant multi-agent reinforcement learning is all you need. (arXiv:2304.02370v1 [physics.flu-dyn])",
    "abstract": "Rayleigh-B\\'enard convection (RBC) is a recurrent phenomenon in several industrial and geoscience flows and a well-studied system from a fundamental fluid-mechanics viewpoint. However, controlling RBC, for example by modulating the spatial distribution of the bottom-plate heating in the canonical RBC configuration, remains a challenging topic for classical control-theory methods. In the present work, we apply deep reinforcement learning (DRL) for controlling RBC. We show that effective RBC control can be obtained by leveraging invariant multi-agent reinforcement learning (MARL), which takes advantage of the locality and translational invariance inherent to RBC flows inside wide channels. The MARL framework applied to RBC allows for an increase in the number of control segments without encountering the curse of dimensionality that would result from a naive increase in the DRL action-size dimension. This is made possible by the MARL ability for re-using the knowledge generated in differe",
    "link": "http://arxiv.org/abs/2304.02370",
    "context": "Title: Effective control of two-dimensional Rayleigh--B\\'enard convection: invariant multi-agent reinforcement learning is all you need. (arXiv:2304.02370v1 [physics.flu-dyn])\nAbstract: Rayleigh-B\\'enard convection (RBC) is a recurrent phenomenon in several industrial and geoscience flows and a well-studied system from a fundamental fluid-mechanics viewpoint. However, controlling RBC, for example by modulating the spatial distribution of the bottom-plate heating in the canonical RBC configuration, remains a challenging topic for classical control-theory methods. In the present work, we apply deep reinforcement learning (DRL) for controlling RBC. We show that effective RBC control can be obtained by leveraging invariant multi-agent reinforcement learning (MARL), which takes advantage of the locality and translational invariance inherent to RBC flows inside wide channels. The MARL framework applied to RBC allows for an increase in the number of control segments without encountering the curse of dimensionality that would result from a naive increase in the DRL action-size dimension. This is made possible by the MARL ability for re-using the knowledge generated in differe",
    "path": "papers/23/04/2304.02370.json",
    "total_tokens": 1204,
    "translated_title": "二维瑞利-贝纳德对流的有效控制：仅需不变的多智能体强化学习方法。",
    "translated_abstract": "瑞利-贝纳德对流是几种工业和地球科学流动中的一个常见现象，从基本流体力学的角度也是一个研究充分的系统。然而，通过传统的控制理论方法控制瑞利-贝纳德对流，例如通过调节规范瑞利-贝纳德对流形态下底板加热的空间分布，仍然是一个具有挑战性的主题。在本研究中，我们应用深度强化学习（DRL）来控制瑞利-贝纳德对流。我们展示了通过利用内在于宽通道内的瑞利-贝纳德对流的局部性和平移不变性的多智能体不变性强化学习（MARL）来获取有效的瑞利-贝纳德对流控制。应用于瑞利-贝纳德对流的MARL框架允许增加控制段的数量，而不会遇到因naive DRL动作尺寸维数增加而导致的维度灾难。这得益于MARL能够重复使用在不同区域生成的知识，从而大大减少训练时间，并形成有效收敛的控制策略。我们的结果表明了所提出的MARL方法在瑞利-贝纳德对流控制中的有效性，为在工业和地球科学流动中的潜在应用铺平了道路。",
    "tldr": "本论文应用基于不变多智能体强化学习（MARL）的深度强化学习（DRL）方法，实现了对二维瑞利-贝纳德对流的有效控制。通过利用局部性和平移不变性，MARL所获得的控制法则不仅具有较好的性能，而且具有良好的应用前景。",
    "en_tdlr": "This paper proposes using deep reinforcement learning (DRL) with invariant multi-agent reinforcement learning (MARL) to effectively control two-dimensional Rayleigh-B\\'enard convection. The results demonstrate the advantages of leveraging the locality and translational invariance inherent to RBC flows, paving the way for potential applications in industrial and geoscience flows."
}