{
    "title": "Bayesian Inference for Jump-Diffusion Approximations of Biochemical Reaction Networks. (arXiv:2304.06592v1 [q-bio.QM])",
    "abstract": "Biochemical reaction networks are an amalgamation of reactions where each reaction represents the interaction of different species. Generally, these networks exhibit a multi-scale behavior caused by the high variability in reaction rates and abundances of species. The so-called jump-diffusion approximation is a valuable tool in the modeling of such systems. The approximation is constructed by partitioning the reaction network into a fast and slow subgroup of fast and slow reactions, respectively. This enables the modeling of the dynamics using a Langevin equation for the fast group, while a Markov jump process model is kept for the dynamics of the slow group. Most often biochemical processes are poorly characterized in terms of parameters and population states. As a result of this, methods for estimating hidden quantities are of significant interest. In this paper, we develop a tractable Bayesian inference algorithm based on Markov chain Monte Carlo. The presented blocked Gibbs particl",
    "link": "http://arxiv.org/abs/2304.06592",
    "context": "Title: Bayesian Inference for Jump-Diffusion Approximations of Biochemical Reaction Networks. (arXiv:2304.06592v1 [q-bio.QM])\nAbstract: Biochemical reaction networks are an amalgamation of reactions where each reaction represents the interaction of different species. Generally, these networks exhibit a multi-scale behavior caused by the high variability in reaction rates and abundances of species. The so-called jump-diffusion approximation is a valuable tool in the modeling of such systems. The approximation is constructed by partitioning the reaction network into a fast and slow subgroup of fast and slow reactions, respectively. This enables the modeling of the dynamics using a Langevin equation for the fast group, while a Markov jump process model is kept for the dynamics of the slow group. Most often biochemical processes are poorly characterized in terms of parameters and population states. As a result of this, methods for estimating hidden quantities are of significant interest. In this paper, we develop a tractable Bayesian inference algorithm based on Markov chain Monte Carlo. The presented blocked Gibbs particl",
    "path": "papers/23/04/2304.06592.json",
    "total_tokens": 861,
    "translated_title": "生化反应网络的跳跃扩散逼近的贝叶斯推断",
    "translated_abstract": "生化反应网络是由多个不同物种之间相互作用的反应组成的。通常情况下，由于反应速率和物种丰度的高度变化，这些网络会表现出多尺度行为。所谓的跳跃扩散逼近是这种系统建模的有价值工具。该逼近通过将反应网络分为快反应和慢反应的快和慢子组来构建。这使得可以使用 Langevin 方程模拟快组的动态，同时为慢组的动态保留马尔可夫跳跃过程模型。由于大多数生化过程在参数和种群状态方面都很难表征，因此估计隐藏变量的方法非常重要。在本文中，我们基于马尔可夫链蒙特卡罗方法开发了一种易于处理的贝叶斯推断算法。所提出的阻塞 Gibbs 粒子",
    "tldr": "本文提出了一种基于贝叶斯推断算法的跳跃扩散模型，该模型可以很好地模拟生化反应网络的动态，尤其是在参数和种群状态方面难以表征的情况下。"
}