{
    "title": "Road Network Representation Learning: A Dual Graph based Approach. (arXiv:2304.07298v1 [cs.LG])",
    "abstract": "Road network is a critical infrastructure powering many applications including transportation, mobility and logistics in real life. To leverage the input of a road network across these different applications, it is necessary to learn the representations of the roads in the form of vectors, which is named \\emph{road network representation learning} (RNRL). While several models have been proposed for RNRL, they capture the pairwise relationships/connections among roads only (i.e., as a simple graph), and fail to capture among roads the high-order relationships (e.g., those roads that jointly form a local region usually have similar features such as speed limit) and long-range relationships (e.g., some roads that are far apart may have similar semantics such as being roads in residential areas). Motivated by this, we propose to construct a \\emph{hypergraph}, where each hyperedge corresponds to a set of multiple roads forming a region. The constructed hypergraph would naturally capture the",
    "link": "http://arxiv.org/abs/2304.07298",
    "context": "Title: Road Network Representation Learning: A Dual Graph based Approach. (arXiv:2304.07298v1 [cs.LG])\nAbstract: Road network is a critical infrastructure powering many applications including transportation, mobility and logistics in real life. To leverage the input of a road network across these different applications, it is necessary to learn the representations of the roads in the form of vectors, which is named \\emph{road network representation learning} (RNRL). While several models have been proposed for RNRL, they capture the pairwise relationships/connections among roads only (i.e., as a simple graph), and fail to capture among roads the high-order relationships (e.g., those roads that jointly form a local region usually have similar features such as speed limit) and long-range relationships (e.g., some roads that are far apart may have similar semantics such as being roads in residential areas). Motivated by this, we propose to construct a \\emph{hypergraph}, where each hyperedge corresponds to a set of multiple roads forming a region. The constructed hypergraph would naturally capture the",
    "path": "papers/23/04/2304.07298.json",
    "total_tokens": 849,
    "translated_title": "道路网络表示学习：一种基于双重图的方法",
    "translated_abstract": "道路网络是支撑许多实际应用，包括交通、移动性和物流的关键基础设施。为了利用道路网络在这些不同的应用中的输入，有必要学习道路的向量表示形式，称为道路网络表示学习（RNRL）。虽然已经提出了几种 RNRL 模型，但它们只捕捉道路之间的成对关系 / 连接（即作为简单图），无法捕捉道路之间的高阶关系（例如，那些共同形成本地区域的道路通常具有类似的特征，例如速度限制）和远程关系（例如，一些相距较远的道路可能具有类似的语义，例如是住宅区道路）。出于这个原因，我们提出构建一个“超图”，其中每个超边对应于构成区域的多条道路的集合。构建的超图会自然地捕捉到道路之间的高阶关系和远程关系。",
    "tldr": "提出了一种基于双重图的方法来解决传统道路网络表示学习模型无法捕捉道路之间高阶和远程关系的问题。",
    "en_tdlr": "Proposed a dual graph based approach to tackle the problem of traditional road network representation learning models failing to capture high-order and long-range relationships among roads."
}