{
    "title": "Approaches to Corpus Creation for Low-Resource Language Technology: the Case of Southern Kurdish and Laki. (arXiv:2304.01319v1 [cs.CL])",
    "abstract": "One of the major challenges that under-represented and endangered language communities face in language technology is the lack or paucity of language data. This is also the case of the Southern varieties of the Kurdish and Laki languages for which very limited resources are available with insubstantial progress in tools. To tackle this, we provide a few approaches that rely on the content of local news websites, a local radio station that broadcasts content in Southern Kurdish and fieldwork for Laki. In this paper, we describe some of the challenges of such under-represented languages, particularly in writing and standardization, and also, in retrieving sources of data and retro-digitizing handwritten content to create a corpus for Southern Kurdish and Laki. In addition, we study the task of language identification in light of the other variants of Kurdish and Zaza-Gorani languages.",
    "link": "http://arxiv.org/abs/2304.01319",
    "context": "Title: Approaches to Corpus Creation for Low-Resource Language Technology: the Case of Southern Kurdish and Laki. (arXiv:2304.01319v1 [cs.CL])\nAbstract: One of the major challenges that under-represented and endangered language communities face in language technology is the lack or paucity of language data. This is also the case of the Southern varieties of the Kurdish and Laki languages for which very limited resources are available with insubstantial progress in tools. To tackle this, we provide a few approaches that rely on the content of local news websites, a local radio station that broadcasts content in Southern Kurdish and fieldwork for Laki. In this paper, we describe some of the challenges of such under-represented languages, particularly in writing and standardization, and also, in retrieving sources of data and retro-digitizing handwritten content to create a corpus for Southern Kurdish and Laki. In addition, we study the task of language identification in light of the other variants of Kurdish and Zaza-Gorani languages.",
    "path": "papers/23/04/2304.01319.json",
    "total_tokens": 844,
    "translated_title": "低资源语言技术中的语料库创建方法：以南部库尔德语和拉基语为例",
    "translated_abstract": "受低资源和濒危语言社区中语言数据缺乏的困扰，南部库尔德语和拉基语缺乏有效工具，仅有极少量的资源可供使用。本文提出通过利用当地新闻网站内容、播放南部库尔德语内容的当地电台以及Laki的田野调查等方法以解决这一问题。本文讨论了这些低资源语言所面临的挑战，尤其是在书写和标准化方面以及在检索数据来源和数字化手写内容以创建南部库尔德语和拉基语的语料库方面的挑战。此外，我们还分析了在库尔德语和扎扎格腊尼语的其他变体环境下进行语言识别的任务。",
    "tldr": "本文介绍了通过当地新闻网站、电台和田野调查等方法解决南部库尔德语和拉基语缺乏数据的问题，并探讨了在库尔德语和扎扎格腊尼语的其他变体环境下进行语言识别的任务。",
    "en_tdlr": "This paper presents approaches to address the lack of data in Southern Kurdish and Laki by utilizing local news websites, radio station, and fieldwork, and investigates language identification tasks in the context of other variants of Kurdish and Zaza-Gorani languages."
}