{
    "title": "A Bibliometric Review of Large Language Models Research from 2017 to 2023. (arXiv:2304.02020v1 [cs.DL])",
    "abstract": "Large language models (LLMs) are a class of language models that have demonstrated outstanding performance across a range of natural language processing (NLP) tasks and have become a highly sought-after research area, because of their ability to generate human-like language and their potential to revolutionize science and technology. In this study, we conduct bibliometric and discourse analyses of scholarly literature on LLMs. Synthesizing over 5,000 publications, this paper serves as a roadmap for researchers, practitioners, and policymakers to navigate the current landscape of LLMs research. We present the research trends from 2017 to early 2023, identifying patterns in research paradigms and collaborations. We start with analyzing the core algorithm developments and NLP tasks that are fundamental in LLMs research. We then investigate the applications of LLMs in various fields and domains including medicine, engineering, social science, and humanities. Our review also reveals the dyn",
    "link": "http://arxiv.org/abs/2304.02020",
    "context": "Title: A Bibliometric Review of Large Language Models Research from 2017 to 2023. (arXiv:2304.02020v1 [cs.DL])\nAbstract: Large language models (LLMs) are a class of language models that have demonstrated outstanding performance across a range of natural language processing (NLP) tasks and have become a highly sought-after research area, because of their ability to generate human-like language and their potential to revolutionize science and technology. In this study, we conduct bibliometric and discourse analyses of scholarly literature on LLMs. Synthesizing over 5,000 publications, this paper serves as a roadmap for researchers, practitioners, and policymakers to navigate the current landscape of LLMs research. We present the research trends from 2017 to early 2023, identifying patterns in research paradigms and collaborations. We start with analyzing the core algorithm developments and NLP tasks that are fundamental in LLMs research. We then investigate the applications of LLMs in various fields and domains including medicine, engineering, social science, and humanities. Our review also reveals the dyn",
    "path": "papers/23/04/2304.02020.json",
    "total_tokens": 973,
    "translated_title": "2017年至2023年大型语言模型研究的文献计量学综述",
    "translated_abstract": "大型语言模型(LLMs)是一类语言模型，在自然语言处理(NLP)任务的多个领域中表现出色，因其生成人类化语言的能力和革命性的科技潜力，已成为学术研究领域中备受关注的热门课题。本研究通过对学术文献的计量学和话语分析，综合了超过5000篇文章，为研究者、实践者和决策者提供了LMMs研究领域的最新进展，是当前LMMs研究领域的一份路线图。我们提出了2017年至2023年的研究趋势及研究模式与合作模式的特点，分析了LMMs研究中的核心算法开发和NLP任务。我们还调查了LLMs在医学、工程、社会科学和人文学科等不同领域和应用方面的研究成果。同时，我们的综述还揭示了LMMs研究领域的动态变化。",
    "tldr": "该研究进行了大量LMMs学术文献的计量学和话语分析，为研究者、实践者和决策者提供了LMMs研究领域的最新进展和研究趋势，为未来的研究提供了路线图。",
    "en_tdlr": "This study provides a bibliometric and discourse analysis of scholarly literature on Large Language Models (LLMs) from 2017 to 2023, which serves as a roadmap for researchers, practitioners, and policymakers to navigate the current landscape of LLMs research and identifies research trends, patterns, and collaborations."
}