{
    "title": "Adapting to Disruptions: Flexibility as a Pillar of Supply Chain Resilience. (arXiv:2304.05290v1 [econ.GN])",
    "abstract": "Supply chain disruptions cause shortages of raw material and products. To increase resilience, i.e., the ability to cope with shocks, substituting goods in established supply chains can become an effective alternative to creating new distribution links. We demonstrate its impact on supply deficits through a detailed analysis of the US opioid distribution system. Reconstructing 40 billion empirical distribution paths, our data-driven model allows a unique inspection of policies that increase the substitution flexibility. Our approach enables policymakers to quantify the trade-off between increasing flexibility, i.e., reduced supply deficits, and increasing complexity of the supply chain, which could make it more expensive to operate.",
    "link": "http://arxiv.org/abs/2304.05290",
    "context": "Title: Adapting to Disruptions: Flexibility as a Pillar of Supply Chain Resilience. (arXiv:2304.05290v1 [econ.GN])\nAbstract: Supply chain disruptions cause shortages of raw material and products. To increase resilience, i.e., the ability to cope with shocks, substituting goods in established supply chains can become an effective alternative to creating new distribution links. We demonstrate its impact on supply deficits through a detailed analysis of the US opioid distribution system. Reconstructing 40 billion empirical distribution paths, our data-driven model allows a unique inspection of policies that increase the substitution flexibility. Our approach enables policymakers to quantify the trade-off between increasing flexibility, i.e., reduced supply deficits, and increasing complexity of the supply chain, which could make it more expensive to operate.",
    "path": "papers/23/04/2304.05290.json",
    "total_tokens": 802,
    "translated_title": "适应中断：灵活性作为供应链弹性的支柱。",
    "translated_abstract": "供应链中的中断会导致原材料和产品的短缺。为了增强弹性，即应对冲击的能力，替代已建立的供应链中的货物可以成为创建新的分配环节的有效替代方案。我们通过对美国阿片类药物分配系统进行详细分析，展示了其对供应短缺的影响。重构了400亿个实证分配路径，我们的数据驱动模型允许对增加替代灵活性的政策进行独特的检验。我们的方法使决策者能够量化增加灵活性的权衡，即减少供应短缺和增加供应链复杂性之间的权衡，后者可能会使其更昂贵。",
    "tldr": "研究分析了在供应链中替代货物可以提高弹性以应对中断，通过对美国阿片类药物分配系统的详细分析，得出了增加替代灵活性的政策对减少供应短缺的作用，并可量化供应链复杂性与弹性的权衡。",
    "en_tdlr": "The study analyzes the use of substitute goods in established supply chains to increase resilience against disruptions. Through analysis of the US opioid distribution system, it concludes that implementing policies to increase substitution flexibility can reduce supply deficits, while also quantifying the trade-off between supply chain complexity and resilience."
}