{
    "title": "B2Opt: Learning to Optimize Black-box Optimization with Little Budget. (arXiv:2304.11787v2 [cs.LG] UPDATED)",
    "abstract": "The core challenge of high-dimensional and expensive black-box optimization (BBO) is how to obtain better performance faster with little function evaluation cost. The essence of the problem is how to design an efficient optimization strategy tailored to the target task. This paper designs a powerful optimization framework to automatically learn the optimization strategies from the target or cheap surrogate task without human intervention. However, current methods are weak for this due to poor representation of optimization strategy. To achieve this, 1) drawing on the mechanism of genetic algorithm, we propose a deep neural network framework called B2Opt, which has a stronger representation of optimization strategies based on survival of the fittest; 2) B2Opt can utilize the cheap surrogate functions of the target task to guide the design of the efficient optimization strategies. Compared to the state-of-the-art BBO baselines, B2Opt can achieve multiple orders of magnitude performance i",
    "link": "http://arxiv.org/abs/2304.11787",
    "context": "Title: B2Opt: Learning to Optimize Black-box Optimization with Little Budget. (arXiv:2304.11787v2 [cs.LG] UPDATED)\nAbstract: The core challenge of high-dimensional and expensive black-box optimization (BBO) is how to obtain better performance faster with little function evaluation cost. The essence of the problem is how to design an efficient optimization strategy tailored to the target task. This paper designs a powerful optimization framework to automatically learn the optimization strategies from the target or cheap surrogate task without human intervention. However, current methods are weak for this due to poor representation of optimization strategy. To achieve this, 1) drawing on the mechanism of genetic algorithm, we propose a deep neural network framework called B2Opt, which has a stronger representation of optimization strategies based on survival of the fittest; 2) B2Opt can utilize the cheap surrogate functions of the target task to guide the design of the efficient optimization strategies. Compared to the state-of-the-art BBO baselines, B2Opt can achieve multiple orders of magnitude performance i",
    "path": "papers/23/04/2304.11787.json",
    "total_tokens": 959,
    "translated_title": "B2Opt: 用少量预算学习优化黑箱优化",
    "translated_abstract": "高维昂贵黑箱优化（BBO）的核心挑战在于如何以较少的函数评估成本更快地获得更好的性能。问题的本质在于如何设计一种针对目标任务的高效优化策略。本文设计了一个强大的优化框架，可以在无人干预的情况下从目标或廉价代理任务中自动学习优化策略。然而，目前的方法在优化策略的表示方面存在缺陷。为了实现这一点，1）借鉴遗传算法的机制，我们提出了一种名为B2Opt的深度神经网络框架，它基于适者生存选择原理，具有更强的优化策略表示能力；2）B2Opt可以利用目标任务的廉价代理函数指导高效优化策略的设计。与最先进的BBO基准相比，B2Opt可以实现几个数量级的性能提升。",
    "tldr": "B2Opt是一种学习优化黑箱优化的方法，可以在少量预算下实现更快而更好的性能提升。它通过设计一个强大的优化框架，自动学习并利用目标任务的廉价代理函数指导高效优化策略的设计。与现有方法相比，B2Opt具有更强的优化策略表示能力并能实现多个数量级的性能提升。",
    "en_tdlr": "B2Opt is a method for learning to optimize black-box optimization with little budget, achieving faster and better performance. It designs a powerful optimization framework to automatically learn and utilize cheap surrogate functions of the target task to guide the design of efficient optimization strategies. Compared to existing methods, B2Opt has a stronger representation of optimization strategies and can achieve multiple orders of magnitude performance improvement."
}