{
    "title": "The CAMELS project: Expanding the galaxy formation model space with new ASTRID and 28-parameter TNG and SIMBA suites. (arXiv:2304.02096v1 [astro-ph.CO])",
    "abstract": "We present CAMELS-ASTRID, the third suite of hydrodynamical simulations in the Cosmology and Astrophysics with MachinE Learning (CAMELS) project, along with new simulation sets that extend the model parameter space based on the previous frameworks of CAMELS-TNG and CAMELS-SIMBA, to provide broader training sets and testing grounds for machine-learning algorithms designed for cosmological studies. CAMELS-ASTRID employs the galaxy formation model following the ASTRID simulation and contains 2,124 hydrodynamic simulation runs that vary 3 cosmological parameters ($\\Omega_m$, $\\sigma_8$, $\\Omega_b$) and 4 parameters controlling stellar and AGN feedback. Compared to the existing TNG and SIMBA simulation suites in CAMELS, the fiducial model of ASTRID features the mildest AGN feedback and predicts the least baryonic effect on the matter power spectrum. The training set of ASTRID covers a broader variation in the galaxy populations and the baryonic impact on the matter power spectrum compared t",
    "link": "http://arxiv.org/abs/2304.02096",
    "context": "Title: The CAMELS project: Expanding the galaxy formation model space with new ASTRID and 28-parameter TNG and SIMBA suites. (arXiv:2304.02096v1 [astro-ph.CO])\nAbstract: We present CAMELS-ASTRID, the third suite of hydrodynamical simulations in the Cosmology and Astrophysics with MachinE Learning (CAMELS) project, along with new simulation sets that extend the model parameter space based on the previous frameworks of CAMELS-TNG and CAMELS-SIMBA, to provide broader training sets and testing grounds for machine-learning algorithms designed for cosmological studies. CAMELS-ASTRID employs the galaxy formation model following the ASTRID simulation and contains 2,124 hydrodynamic simulation runs that vary 3 cosmological parameters ($\\Omega_m$, $\\sigma_8$, $\\Omega_b$) and 4 parameters controlling stellar and AGN feedback. Compared to the existing TNG and SIMBA simulation suites in CAMELS, the fiducial model of ASTRID features the mildest AGN feedback and predicts the least baryonic effect on the matter power spectrum. The training set of ASTRID covers a broader variation in the galaxy populations and the baryonic impact on the matter power spectrum compared t",
    "path": "papers/23/04/2304.02096.json",
    "total_tokens": 976,
    "translated_title": "CAMELS项目：使用新的ASTRID和28个参数的TNG和SIMBA套件扩展星系形成模型空间",
    "translated_abstract": "我们提出了CAMELS-ASTRID，这是Cosmology and Astrophysics with MachinE Learning（CAMELS）项目中的第三个流体力学模拟套件，以及基于之前的CAMELS-TNG和CAMELS-SIMBA框架扩展模型参数空间的新模拟套件，为设计用于宇宙学研究的机器学习算法提供更广泛的训练和测试环境。与CAMELS中现有的TNG和SIMBA模拟套件相比，ASTRID的基准模型具有最温和的AGN反馈，并且预测对物质功率谱的影响最小。ASTRID的训练集涵盖了更广泛的星系群体和对物质功率谱的重要影响。",
    "tldr": "CAMELS项目扩展了星系形成的模型空间，提供了更广泛的训练和测试环境，其中最新的CAMELS-ASTRID模拟套件通过多样的模拟涵盖了不同的星系群体和重要影响, 训练集覆盖不同宇宙学参数和星系反馈参数的变化， 加深了我们对星系形成的理解并为宇宙学研究提供了基础。",
    "en_tdlr": "The CAMELS project expands the model space of galaxy formation, providing broader environments for training and testing machine-learning algorithms for cosmological studies. The latest CAMELS-ASTRID simulation suite covers different galaxy populations and important effects through diverse simulations, broadening our understanding of galaxy formation and providing a foundation for cosmological research by covering variations in cosmological and feedback parameters."
}