{
    "title": "Neural Diffeomorphic Non-uniform B-spline Flows. (arXiv:2304.04555v2 [cs.LG] UPDATED)",
    "abstract": "Normalizing flows have been successfully modeling a complex probability distribution as an invertible transformation of a simple base distribution. However, there are often applications that require more than invertibility. For instance, the computation of energies and forces in physics requires the second derivatives of the transformation to be well-defined and continuous. Smooth normalizing flows employ infinitely differentiable transformation, but with the price of slow non-analytic inverse transforms. In this work, we propose diffeomorphic non-uniform B-spline flows that are at least twice continuously differentiable while bi-Lipschitz continuous, enabling efficient parametrization while retaining analytic inverse transforms based on a sufficient condition for diffeomorphism. Firstly, we investigate the sufficient condition for Ck-2-diffeomorphic non-uniform kth-order B-spline transformations. Then, we derive an analytic inverse transformation of the non-uniform cubic B-spline tran",
    "link": "http://arxiv.org/abs/2304.04555",
    "context": "Title: Neural Diffeomorphic Non-uniform B-spline Flows. (arXiv:2304.04555v2 [cs.LG] UPDATED)\nAbstract: Normalizing flows have been successfully modeling a complex probability distribution as an invertible transformation of a simple base distribution. However, there are often applications that require more than invertibility. For instance, the computation of energies and forces in physics requires the second derivatives of the transformation to be well-defined and continuous. Smooth normalizing flows employ infinitely differentiable transformation, but with the price of slow non-analytic inverse transforms. In this work, we propose diffeomorphic non-uniform B-spline flows that are at least twice continuously differentiable while bi-Lipschitz continuous, enabling efficient parametrization while retaining analytic inverse transforms based on a sufficient condition for diffeomorphism. Firstly, we investigate the sufficient condition for Ck-2-diffeomorphic non-uniform kth-order B-spline transformations. Then, we derive an analytic inverse transformation of the non-uniform cubic B-spline tran",
    "path": "papers/23/04/2304.04555.json",
    "total_tokens": 936,
    "translated_title": "神经流形非均匀B样条流",
    "translated_abstract": "正则化流成功地将复杂的概率分布建模为简单基本分布的可逆变换。然而，有时候需要更多。在物理中计算能量和力要求变换的二阶导数是良好定义和连续的，平滑正则化流采用无限可微变换，但以缓慢的非解析逆变换的代价。本文提出了至少二次连续可微且双Lipschitz连续的非均匀B样条流形，实现了高效的参数化和基于微分同胚的解析逆变换。首先，我们研究了Ck-2微分同胚的非均匀k阶B样条变换的充分条件。然后，我们推导了符合充分条件的非均匀立方B样条变换的解析逆变换。实验表明，与现有最先进的方法相比，所提出的方法在密度估计和图像生成任务上获得了具有竞争力的结果。",
    "tldr": "提出了一种具有高效参数化和解析逆变换的至少二次连续可微、双Lipschitz连续的非均匀B样条流形，能够在密度估计和图像生成任务中表现出具有竞争力的结果。",
    "en_tdlr": "This paper proposes diffeomorphic non-uniform B-spline flows that are at least twice continuously differentiable while bi-Lipschitz continuous, enabling efficient parametrization while retaining analytic inverse transforms based on a sufficient condition for diffeomorphism, which achieve competitive results in density estimation and image generation tasks compared to existing state-of-the-art methods."
}