{
    "title": "Edge-cloud Collaborative Learning with Federated and Centralized Features. (arXiv:2304.05871v1 [cs.LG])",
    "abstract": "Federated learning (FL) is a popular way of edge computing that doesn't compromise users' privacy. Current FL paradigms assume that data only resides on the edge, while cloud servers only perform model averaging. However, in real-life situations such as recommender systems, the cloud server has the ability to store historical and interactive features. In this paper, our proposed Edge-Cloud Collaborative Knowledge Transfer Framework (ECCT) bridges the gap between the edge and cloud, enabling bi-directional knowledge transfer between both, sharing feature embeddings and prediction logits. ECCT consolidates various benefits, including enhancing personalization, enabling model heterogeneity, tolerating training asynchronization, and relieving communication burdens. Extensive experiments on public and industrial datasets demonstrate ECCT's effectiveness and potential for use in academia and industry.",
    "link": "http://arxiv.org/abs/2304.05871",
    "context": "Title: Edge-cloud Collaborative Learning with Federated and Centralized Features. (arXiv:2304.05871v1 [cs.LG])\nAbstract: Federated learning (FL) is a popular way of edge computing that doesn't compromise users' privacy. Current FL paradigms assume that data only resides on the edge, while cloud servers only perform model averaging. However, in real-life situations such as recommender systems, the cloud server has the ability to store historical and interactive features. In this paper, our proposed Edge-Cloud Collaborative Knowledge Transfer Framework (ECCT) bridges the gap between the edge and cloud, enabling bi-directional knowledge transfer between both, sharing feature embeddings and prediction logits. ECCT consolidates various benefits, including enhancing personalization, enabling model heterogeneity, tolerating training asynchronization, and relieving communication burdens. Extensive experiments on public and industrial datasets demonstrate ECCT's effectiveness and potential for use in academia and industry.",
    "path": "papers/23/04/2304.05871.json",
    "total_tokens": 917,
    "translated_title": "带有联邦和集中特征的边缘云协作学习",
    "translated_abstract": "联邦学习（FL）是一种受欢迎的边缘计算方式，不会危及用户的隐私。目前的FL范例假定数据仅驻留在边缘，而云服务器仅执行模型平均。但是，在诸如推荐系统之类的实际情况下，云服务器具有存储历史和交互特征的能力。本文提出的Edge-Cloud Collaborative Knowledge Transfer Framework（ECCT）弥合了边缘和云之间的差距，使其能够在两者之间进行双向知识传输，共享特征嵌入和预测日志。 ECCT巩固了各种好处，包括增强个性化，实现模型异构性，容忍培训异步性和缓解通信负担。对公共和工业数据集的广泛实验表明ECCT的有效性和学术和工业使用的潜力。",
    "tldr": "本文提出了一种边缘云协作知识转移框架（ECCT），使得共享特征嵌入和预测日志的双向知识传输成为可能，从而实现了个性化增强、模型的异构性、容忍训练的异步性和缓解通信负担的功能。",
    "en_tdlr": "This paper proposes an Edge-Cloud Collaborative Knowledge Transfer Framework (ECCT) that enables bidirectional knowledge transfer between the edge and cloud, sharing feature embeddings and prediction logits, consolidating various benefits such as enhancing personalization, enabling model heterogeneity, tolerating training asynchronization, and relieving communication burdens. Extensive experiments on public and industrial datasets demonstrate ECCT's effectiveness and potential for use in academia and industry."
}