{
    "title": "BS-GAT Behavior Similarity Based Graph Attention Network for Network Intrusion Detection. (arXiv:2304.07226v1 [cs.CR])",
    "abstract": "With the development of the Internet of Things (IoT), network intrusion detection is becoming more complex and extensive. It is essential to investigate an intelligent, automated, and robust network intrusion detection method. Graph neural networks based network intrusion detection methods have been proposed. However, it still needs further studies because the graph construction method of the existing methods does not fully adapt to the characteristics of the practical network intrusion datasets. To address the above issue, this paper proposes a graph neural network algorithm based on behavior similarity (BS-GAT) using graph attention network. First, a novel graph construction method is developed using the behavior similarity by analyzing the characteristics of the practical datasets. The data flows are treated as nodes in the graph, and the behavior rules of nodes are used as edges in the graph, constructing a graph with a relatively uniform number of neighbors for each node. Then, th",
    "link": "http://arxiv.org/abs/2304.07226",
    "context": "Title: BS-GAT Behavior Similarity Based Graph Attention Network for Network Intrusion Detection. (arXiv:2304.07226v1 [cs.CR])\nAbstract: With the development of the Internet of Things (IoT), network intrusion detection is becoming more complex and extensive. It is essential to investigate an intelligent, automated, and robust network intrusion detection method. Graph neural networks based network intrusion detection methods have been proposed. However, it still needs further studies because the graph construction method of the existing methods does not fully adapt to the characteristics of the practical network intrusion datasets. To address the above issue, this paper proposes a graph neural network algorithm based on behavior similarity (BS-GAT) using graph attention network. First, a novel graph construction method is developed using the behavior similarity by analyzing the characteristics of the practical datasets. The data flows are treated as nodes in the graph, and the behavior rules of nodes are used as edges in the graph, constructing a graph with a relatively uniform number of neighbors for each node. Then, th",
    "path": "papers/23/04/2304.07226.json",
    "total_tokens": 991,
    "translated_title": "基于行为相似性的图注意力网络的网络入侵检测方法（arXiv：2304.07226v1 [cs.CR]）",
    "translated_abstract": "随着物联网（IoT）的发展，网络入侵检测变得越来越复杂和广泛。研究智能、自动化和稳健的网络入侵检测方法至关重要。基于图神经网络的网络入侵检测方法已被提出。然而，由于现有方法的图构建方法并不完全适应实际网络入侵数据集的特征，因此仍需要进一步研究。为了解决上述问题，本文提出了一种基于行为相似性的图神经网络算法（BS-GAT），利用图注意力网络。首先，通过分析实际数据集的特征，开发了一种新的基于行为相似性的图构建方法。以数据流为节点，在图中使用节点的行为规则作为边缘，构建一个邻居节点数量相对平均的图。然后，所提出的BS-GAT算法利用图注意力网络来学习构建图的表示，利用行为相似性捕捉网络流量的判别特征。在三个基准数据集上的实验结果表明，该方法优于现有的最先进方法。",
    "tldr": "本文提出了一种基于行为相似性的图神经网络算法（BS-GAT），利用图注意力网络来学习构建图的表示，实现网络入侵检测，该方法优于现有的最先进方法。",
    "en_tdlr": "This paper proposes a graph neural network algorithm based on behavior similarity (BS-GAT) using graph attention network to learn the representation of the constructed graph, achieving network intrusion detection, and outperforming existing state-of-the-art methods."
}