{
    "title": "BERT Based Clinical Knowledge Extraction for Biomedical Knowledge Graph Construction and Analysis. (arXiv:2304.10996v1 [cs.CL])",
    "abstract": "Background : Knowledge is evolving over time, often as a result of new discoveries or changes in the adopted methods of reasoning. Also, new facts or evidence may become available, leading to new understandings of complex phenomena. This is particularly true in the biomedical field, where scientists and physicians are constantly striving to find new methods of diagnosis, treatment and eventually cure. Knowledge Graphs (KGs) offer a real way of organizing and retrieving the massive and growing amount of biomedical knowledge.  Objective : We propose an end-to-end approach for knowledge extraction and analysis from biomedical clinical notes using the Bidirectional Encoder Representations from Transformers (BERT) model and Conditional Random Field (CRF) layer.  Methods : The approach is based on knowledge graphs, which can effectively process abstract biomedical concepts such as relationships and interactions between medical entities. Besides offering an intuitive way to visualize these co",
    "link": "http://arxiv.org/abs/2304.10996",
    "context": "Title: BERT Based Clinical Knowledge Extraction for Biomedical Knowledge Graph Construction and Analysis. (arXiv:2304.10996v1 [cs.CL])\nAbstract: Background : Knowledge is evolving over time, often as a result of new discoveries or changes in the adopted methods of reasoning. Also, new facts or evidence may become available, leading to new understandings of complex phenomena. This is particularly true in the biomedical field, where scientists and physicians are constantly striving to find new methods of diagnosis, treatment and eventually cure. Knowledge Graphs (KGs) offer a real way of organizing and retrieving the massive and growing amount of biomedical knowledge.  Objective : We propose an end-to-end approach for knowledge extraction and analysis from biomedical clinical notes using the Bidirectional Encoder Representations from Transformers (BERT) model and Conditional Random Field (CRF) layer.  Methods : The approach is based on knowledge graphs, which can effectively process abstract biomedical concepts such as relationships and interactions between medical entities. Besides offering an intuitive way to visualize these co",
    "path": "papers/23/04/2304.10996.json",
    "total_tokens": 898,
    "translated_title": "基于BERT的临床知识提取用于生物医学知识图谱构建和分析",
    "translated_abstract": "背景：知识随时间而演变，往往是由于新的发现或推理方法的变化导致。此外，可能会有新的事实或证据出现，导致对复杂现象的新理解。这在生物医学领域尤为真实，科学家和医生不断努力寻找新的诊断、治疗方法和最终的治愈。知识图谱（KG）提供了一种真实的方法来组织和检索大量增长的生物医学知识。",
    "tldr": "本文提出了一种基于BERT和CRF技术的生物医学临床笔记知识提取和分析的端到端方法，用于构建和分析生物医学知识图谱。",
    "en_tdlr": "This paper proposes an end-to-end approach for knowledge extraction and analysis from biomedical clinical notes using BERT and CRF technologies, for the construction and analysis of a biomedical knowledge graph."
}