{
    "title": "Max-Plus Synchronization in Decentralized Trading Systems. (arXiv:2304.00210v1 [cs.GT])",
    "abstract": "We introduce a decentralized mechanism for pricing and exchanging alternatives constrained by transaction costs. We characterize the time-invariant solutions of a heat equation involving a (weighted) Tarski Laplacian operator, defined for max-plus matrix-weighted graphs, as approximate equilibria of the trading system. We study algebraic properties of the solution sets as well as convergence behavior of the dynamical system. We apply these tools to the ``economic problem'' of allocating scarce resources among competing uses. Our theory suggests differences in competitive equilibrium, bargaining, or cost-benefit analysis, depending on the context, are largely due to differences in the way that transaction costs are incorporated into the decision-making process. We present numerical simulations of the synchronization algorithm (RRAggU), demonstrating our theoretical findings.",
    "link": "http://arxiv.org/abs/2304.00210",
    "context": "Title: Max-Plus Synchronization in Decentralized Trading Systems. (arXiv:2304.00210v1 [cs.GT])\nAbstract: We introduce a decentralized mechanism for pricing and exchanging alternatives constrained by transaction costs. We characterize the time-invariant solutions of a heat equation involving a (weighted) Tarski Laplacian operator, defined for max-plus matrix-weighted graphs, as approximate equilibria of the trading system. We study algebraic properties of the solution sets as well as convergence behavior of the dynamical system. We apply these tools to the ``economic problem'' of allocating scarce resources among competing uses. Our theory suggests differences in competitive equilibrium, bargaining, or cost-benefit analysis, depending on the context, are largely due to differences in the way that transaction costs are incorporated into the decision-making process. We present numerical simulations of the synchronization algorithm (RRAggU), demonstrating our theoretical findings.",
    "path": "papers/23/04/2304.00210.json",
    "total_tokens": 881,
    "translated_title": "基于最大加法同步的分散交易系统",
    "translated_abstract": "我们引入了一种去中心化机制，用于定价和交换受交易成本约束的替代品。我们将一个(加权)塔斯基拉普拉斯算子涉及的热方程的时不变解，定义为最大加法矩阵加权图的近似均衡状态，并研究解集的代数性质和动态系统的收敛行为。我们将这些工具应用于将稀缺资源分配给竞争用途的“经济问题”。我们的理论表明，竞争均衡、谈判或成本效益分析在不同情境中的差异，很大程度上取决于交易成本在决策过程中的差异。我们展示了同步算法(RRAggU)的数值模拟，证明了我们理论上的发现。",
    "tldr": "本文提出了一个基于最大加法同步的去中心化机制，用于交易成本约束的替代品定价和交换，将涉及的热方程的时不变解定义为近似均衡状态，并研究解集的代数性质和动态系统的收敛行为。文中的RRAggU算法在数值模拟中证明了理论的正确性。",
    "en_tdlr": "This paper proposes a decentralized mechanism for pricing and exchanging alternatives constrained by transaction costs. The time-invariant solutions of a heat equation involving a (weighted) Tarski Laplacian operator, defined for max-plus matrix-weighted graphs, are characterized as approximate equilibria of the trading system. The paper also presents numerical simulations of the synchronization algorithm (RRAggU) demonstrating the theoretical findings."
}