{
    "title": "Framing the News:From Human Perception to Large Language Model Inferences. (arXiv:2304.14456v1 [cs.CL])",
    "abstract": "Identifying the frames of news is important to understand the articles' vision, intention, message to be conveyed, and which aspects of the news are emphasized. Framing is a widely studied concept in journalism, and has emerged as a new topic in computing, with the potential to automate processes and facilitate the work of journalism professionals. In this paper, we study this issue with articles related to the Covid-19 anti-vaccine movement. First, to understand the perspectives used to treat this theme, we developed a protocol for human labeling of frames for 1786 headlines of No-Vax movement articles of European newspapers from 5 countries. Headlines are key units in the written press, and worth of analysis as many people only read headlines (or use them to guide their decision for further reading.) Second, considering advances in Natural Language Processing (NLP) with large language models, we investigated two approaches for frame inference of news headlines: first with a GPT-3.5 f",
    "link": "http://arxiv.org/abs/2304.14456",
    "context": "Title: Framing the News:From Human Perception to Large Language Model Inferences. (arXiv:2304.14456v1 [cs.CL])\nAbstract: Identifying the frames of news is important to understand the articles' vision, intention, message to be conveyed, and which aspects of the news are emphasized. Framing is a widely studied concept in journalism, and has emerged as a new topic in computing, with the potential to automate processes and facilitate the work of journalism professionals. In this paper, we study this issue with articles related to the Covid-19 anti-vaccine movement. First, to understand the perspectives used to treat this theme, we developed a protocol for human labeling of frames for 1786 headlines of No-Vax movement articles of European newspapers from 5 countries. Headlines are key units in the written press, and worth of analysis as many people only read headlines (or use them to guide their decision for further reading.) Second, considering advances in Natural Language Processing (NLP) with large language models, we investigated two approaches for frame inference of news headlines: first with a GPT-3.5 f",
    "path": "papers/23/04/2304.14456.json",
    "total_tokens": 1143,
    "translated_title": "新闻框架：从人类感知到大型语言模型推断",
    "translated_abstract": "辨别新闻框架对于了解文章的视角、意图、传递的信息以及哪些方面的新闻得到了强调是非常重要的。框架是新闻学中广泛研究的概念，并已成为计算领域中的新话题，具有自动化流程和方便新闻从业者工作的潜力。本文针对与 Covid-19 反疫苗运动相关的文章进行了研究。首先，为了理解处理这一主题所使用的视角，我们开发了一个人类标注框架的协议，对来自 5 个国家的欧洲报纸的 1786 个 No-Vax 运动文章的标题进行标注，因为标题是书面新闻中的关键单元，有分析价值，因为很多人只读标题（或用它们来指导他们进一步阅读的决策）。其次，考虑到大型语言模型在自然语言处理中的进展，我们研究了两种新闻标题框架推断方法：一种是使用 GPT-3.5 框架，另一种是基于 BERT 的分析。我们的实验表明，GPT-3.5 提高了分类任务的性能，F1 分数达到了 68.13%。基于 BERT 的方法提供了更低但仍有合理结果，F1 分数为 57.43%。这些结果有助于不断扩大的工作，展示了在 NLP 任务中使用大型语言模型的潜力。",
    "tldr": "本文研究了新闻标题的框架辨别问题，并使用大型语言模型进行了实验，结果表明使用 GPT-3.5 方法可以提高分类任务的性能，达到了 68.13% 的 F1 分数。",
    "en_tdlr": "This paper studies the issue of identifying news frames and conducts experiments using large language models. The results show that using the GPT-3.5 method can improve the performance of the classification task, with an F1 score of 68.13%."
}