{
    "title": "An innovative Deep Learning Based Approach for Accurate Agricultural Crop Price Prediction. (arXiv:2304.09761v1 [cs.LG])",
    "abstract": "Accurate prediction of agricultural crop prices is a crucial input for decision-making by various stakeholders in agriculture: farmers, consumers, retailers, wholesalers, and the Government. These decisions have significant implications including, most importantly, the economic well-being of the farmers. In this paper, our objective is to accurately predict crop prices using historical price information, climate conditions, soil type, location, and other key determinants of crop prices. This is a technically challenging problem, which has been attempted before. In this paper, we propose an innovative deep learning based approach to achieve increased accuracy in price prediction. The proposed approach uses graph neural networks (GNNs) in conjunction with a standard convolutional neural network (CNN) model to exploit geospatial dependencies in prices. Our approach works well with noisy legacy data and produces a performance that is at least 20% better than the results available in the li",
    "link": "http://arxiv.org/abs/2304.09761",
    "context": "Title: An innovative Deep Learning Based Approach for Accurate Agricultural Crop Price Prediction. (arXiv:2304.09761v1 [cs.LG])\nAbstract: Accurate prediction of agricultural crop prices is a crucial input for decision-making by various stakeholders in agriculture: farmers, consumers, retailers, wholesalers, and the Government. These decisions have significant implications including, most importantly, the economic well-being of the farmers. In this paper, our objective is to accurately predict crop prices using historical price information, climate conditions, soil type, location, and other key determinants of crop prices. This is a technically challenging problem, which has been attempted before. In this paper, we propose an innovative deep learning based approach to achieve increased accuracy in price prediction. The proposed approach uses graph neural networks (GNNs) in conjunction with a standard convolutional neural network (CNN) model to exploit geospatial dependencies in prices. Our approach works well with noisy legacy data and produces a performance that is at least 20% better than the results available in the li",
    "path": "papers/23/04/2304.09761.json",
    "total_tokens": 941,
    "translated_title": "一种基于深度学习的创新方法用于准确的农产品价格预测",
    "translated_abstract": "农产品价格的准确预测对于农业各利益相关者（农民、消费者、零售商、批发商和政府）的决策至关重要，特别是对农民的经济福祉产生重要影响。本文的目标是利用历史价格信息、气候条件、土壤类型、地理位置和其他关键决策因素，精确预测农产品价格。这是一个技术挑战，以前也曾被尝试过。本文提出了一种创新的基于深度学习的方法，以实现在价格预测中的提高准确性。所提出的方法使用图神经网络（GNNs）与标准卷积神经网络（CNN）模型相结合，利用价格的地理空间相关性。我们的方法适用于有噪声的历史数据，并且表现至少比现有文献中的结果好20%。",
    "tldr": "本文提出了一种基于深度学习的方法，利用历史价格信息、气候条件、土壤类型、地理位置和其他关键决策因素，精确预测农产品价格。该方法使用图神经网络和卷积神经网络相结合，适用于有噪声的历史数据，并且表现至少比现有文献中的结果好20%。",
    "en_tdlr": "This paper proposes an innovative deep learning based approach for accurately predicting agricultural crop prices using historical price information, climate conditions, soil type, location, and other key determinants. The approach combines graph neural networks with a convolutional neural network model to exploit geospatial dependencies in prices, and performs at least 20% better than previous results on noisy legacy data."
}