{
    "title": "DeePLT: Personalized Lighting Facilitates by Trajectory Prediction of Recognized Residents in the Smart Home. (arXiv:2304.08027v2 [cs.CV] UPDATED)",
    "abstract": "In recent years, the intelligence of various parts of the home has become one of the essential features of any modern home. One of these parts is the intelligence lighting system that personalizes the light for each person. This paper proposes an intelligent system based on machine learning that personalizes lighting in the instant future location of a recognized user, inferred by trajectory prediction. Our proposed system consists of the following modules: (I) human detection to detect and localize the person in each given video frame, (II) face recognition to identify the detected person, (III) human tracking to track the person in the sequence of video frames and (IV) trajectory prediction to forecast the future location of the user in the environment using Inverse Reinforcement Learning. The proposed method provides a unique profile for each person, including specifications, face images, and custom lighting settings. This profile is used in the lighting adjustment process. Unlike o",
    "link": "http://arxiv.org/abs/2304.08027",
    "context": "Title: DeePLT: Personalized Lighting Facilitates by Trajectory Prediction of Recognized Residents in the Smart Home. (arXiv:2304.08027v2 [cs.CV] UPDATED)\nAbstract: In recent years, the intelligence of various parts of the home has become one of the essential features of any modern home. One of these parts is the intelligence lighting system that personalizes the light for each person. This paper proposes an intelligent system based on machine learning that personalizes lighting in the instant future location of a recognized user, inferred by trajectory prediction. Our proposed system consists of the following modules: (I) human detection to detect and localize the person in each given video frame, (II) face recognition to identify the detected person, (III) human tracking to track the person in the sequence of video frames and (IV) trajectory prediction to forecast the future location of the user in the environment using Inverse Reinforcement Learning. The proposed method provides a unique profile for each person, including specifications, face images, and custom lighting settings. This profile is used in the lighting adjustment process. Unlike o",
    "path": "papers/23/04/2304.08027.json",
    "total_tokens": 947,
    "translated_title": "DeePLT：基于轨迹预测实现智能家居中的个性化照明系统",
    "translated_abstract": "近年来，家居各部分的智能化已成为现代家居的重要特征之一。其中之一便是智能照明系统，可为每个人定制个性化光照。本文提出了一种基于机器学习的智能系统，通过轨迹预测个性化照明系统即时调整家中灯光。所提出的系统包括以下模块：（I）人体检测，用于检测和定位每个给定视频帧中的人物，（II）人脸识别，用于识别检测到的人物，（III）人体跟踪，用于跟踪视频序列中的人物，以及（IV）轨迹预测，使用逆强化学习方法预测用户在未来的位置。该方法为每个人提供一个独特的个人资料，包括规格、人脸图像和自定义照明设置，而该个人资料用于照明调整过程。与其他照明系统不同，本提出的系统可根据每个人的轨迹自动调整灯光。",
    "tldr": "本论文提出了一种基于机器学习的智能照明系统DeePLT，其通过轨迹预测实现智能家居中的个性化照明调整，给每个人定制独特的个人资料并根据其轨迹自动调整灯光。"
}