{
    "title": "Local object crop collision network for efficient simulation of non-convex objects in GPU-based simulators. (arXiv:2304.09439v1 [cs.RO])",
    "abstract": "Our goal is to develop an efficient contact detection algorithm for large-scale GPU-based simulation of non-convex objects. Current GPU-based simulators such as IsaacGym and Brax must trade-off speed with fidelity, generality, or both when simulating non-convex objects. Their main issue lies in contact detection (CD): existing CD algorithms, such as Gilbert-Johnson-Keerthi (GJK), must trade off their computational speed with accuracy which becomes expensive as the number of collisions among non-convex objects increases. We propose a data-driven approach for CD, whose accuracy depends only on the quality and quantity of offline dataset rather than online computation time. Unlike GJK, our method inherently has a uniform computational flow, which facilitates efficient GPU usage based on advanced compilers such as XLA (Accelerated Linear Algebra). Further, we offer a data-efficient solution by learning the patterns of colliding local crop object shapes, rather than global object shapes whi",
    "link": "http://arxiv.org/abs/2304.09439",
    "context": "Title: Local object crop collision network for efficient simulation of non-convex objects in GPU-based simulators. (arXiv:2304.09439v1 [cs.RO])\nAbstract: Our goal is to develop an efficient contact detection algorithm for large-scale GPU-based simulation of non-convex objects. Current GPU-based simulators such as IsaacGym and Brax must trade-off speed with fidelity, generality, or both when simulating non-convex objects. Their main issue lies in contact detection (CD): existing CD algorithms, such as Gilbert-Johnson-Keerthi (GJK), must trade off their computational speed with accuracy which becomes expensive as the number of collisions among non-convex objects increases. We propose a data-driven approach for CD, whose accuracy depends only on the quality and quantity of offline dataset rather than online computation time. Unlike GJK, our method inherently has a uniform computational flow, which facilitates efficient GPU usage based on advanced compilers such as XLA (Accelerated Linear Algebra). Further, we offer a data-efficient solution by learning the patterns of colliding local crop object shapes, rather than global object shapes whi",
    "path": "papers/23/04/2304.09439.json",
    "total_tokens": 787,
    "translated_title": "用于GPU模拟非凸物体的本地物体裁剪碰撞网络的高效碰撞检测算法",
    "translated_abstract": "本文旨在开发一种用于GPU模拟非凸物体的高效碰撞检测算法。目前GPU模拟器在模拟非凸物体时需要在速度、通用性和精度之间做出权衡，主要问题在于现有的碰撞检测算法需要在计算速度和准确性之间进行权衡。我们提出了一种数据驱动的碰撞检测方法，其中精度仅取决于离线数据集的质量和数量，而不是在线计算时间。",
    "tldr": "提出了一种数据驱动的碰撞检测方法，用于高效模拟非凸物体，不需要在计算速度和准确性之间进行权衡，具有较小的在线计算时间和更好的GPU利用率。",
    "en_tdlr": "A data-driven collision detection method is proposed for efficient simulation of non-convex objects on GPU without trade-offs between computational speed and accuracy, which depends on the quality and quantity of offline dataset instead of online computation time, and facilitates better GPU utilization with smaller online computation time."
}