{
    "title": "Rough Randomness and its Application. (arXiv:2304.00005v1 [cs.AI])",
    "abstract": "A number of generalizations of stochastic and information-theoretic randomness are known in the literature. However, they are not compatible with handling meaning in vague and dynamic contexts of rough reasoning (and therefore explainable artificial intelligence and machine learning). In this research, new concepts of rough randomness that are neither stochastic nor based on properties of strings are introduced by the present author. Her concepts are intended to capture a wide variety of rough processes (applicable to both static and dynamic data), construct related models, and explore the validity of other machine learning algorithms. The last mentioned is restricted to soft/hard clustering algorithms in this paper. Two new computationally efficient algebraically-justified algorithms for soft and hard cluster validation that involve rough random functions are additionally proposed in this research. A class of rough random functions termed large-minded reasoners have a central role in ",
    "link": "http://arxiv.org/abs/2304.00005",
    "context": "Title: Rough Randomness and its Application. (arXiv:2304.00005v1 [cs.AI])\nAbstract: A number of generalizations of stochastic and information-theoretic randomness are known in the literature. However, they are not compatible with handling meaning in vague and dynamic contexts of rough reasoning (and therefore explainable artificial intelligence and machine learning). In this research, new concepts of rough randomness that are neither stochastic nor based on properties of strings are introduced by the present author. Her concepts are intended to capture a wide variety of rough processes (applicable to both static and dynamic data), construct related models, and explore the validity of other machine learning algorithms. The last mentioned is restricted to soft/hard clustering algorithms in this paper. Two new computationally efficient algebraically-justified algorithms for soft and hard cluster validation that involve rough random functions are additionally proposed in this research. A class of rough random functions termed large-minded reasoners have a central role in ",
    "path": "papers/23/04/2304.00005.json",
    "total_tokens": 1001,
    "translated_title": "粗糙随机性及其应用",
    "translated_abstract": "文献中已有多种随机性和信息论随机性的推广。然而，它们不能很好地处理粗糙推理（因此不能很好地应用于可解释的人工智能和机器学习的模糊和动态背景）。本研究由作者引入了粗糙随机性的新概念，它们既不是随机的，也不基于字符串的属性。这些概念旨在捕捉各种粗糙过程（适用于静态和动态数据），构建相关模型，并探索其他机器学习算法的有效性。本文中，最后提到的是软/硬聚类算法。此外，本研究还提出了两种计算有效的代数证明算法，用于软集群和硬集群验证，这些算法都涉及到了粗糙随机函数。一类名为“大思想者”的粗糙随机函数在本文中起着核心作用，并通过示例展示了它们在构建粗糙模型中的应用。",
    "tldr": "本研究引入了新的粗糙随机性概念，用于捕捉静态和动态数据的各种粗糙过程，尤其是在构建粗糙模型方面具有重要作用，同时也探索了软/硬聚类算法的有效性。其中，大思想者粗糙随机函数是核心，本文还提出了两个计算有效的代数证明算法，用于软/硬集群验证。"
}