{
    "title": "GCNH: A Simple Method For Representation Learning On Heterophilous Graphs. (arXiv:2304.10896v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) are well-suited for learning on homophilous graphs, i.e., graphs in which edges tend to connect nodes of the same type. Yet, achievement of consistent GNN performance on heterophilous graphs remains an open research problem. Recent works have proposed extensions to standard GNN architectures to improve performance on heterophilous graphs, trading off model simplicity for prediction accuracy. However, these models fail to capture basic graph properties, such as neighborhood label distribution, which are fundamental for learning. In this work, we propose GCN for Heterophily (GCNH), a simple yet effective GNN architecture applicable to both heterophilous and homophilous scenarios. GCNH learns and combines separate representations for a node and its neighbors, using one learned importance coefficient per layer to balance the contributions of center nodes and neighborhoods. We conduct extensive experiments on eight real-world graphs and a set of synthetic graphs",
    "link": "http://arxiv.org/abs/2304.10896",
    "context": "Title: GCNH: A Simple Method For Representation Learning On Heterophilous Graphs. (arXiv:2304.10896v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) are well-suited for learning on homophilous graphs, i.e., graphs in which edges tend to connect nodes of the same type. Yet, achievement of consistent GNN performance on heterophilous graphs remains an open research problem. Recent works have proposed extensions to standard GNN architectures to improve performance on heterophilous graphs, trading off model simplicity for prediction accuracy. However, these models fail to capture basic graph properties, such as neighborhood label distribution, which are fundamental for learning. In this work, we propose GCN for Heterophily (GCNH), a simple yet effective GNN architecture applicable to both heterophilous and homophilous scenarios. GCNH learns and combines separate representations for a node and its neighbors, using one learned importance coefficient per layer to balance the contributions of center nodes and neighborhoods. We conduct extensive experiments on eight real-world graphs and a set of synthetic graphs",
    "path": "papers/23/04/2304.10896.json",
    "total_tokens": 862,
    "translated_title": "GCNH：一种用于异构图上表示学习的简单方法",
    "translated_abstract": "图神经网络（GNN）很适合在同质图上学习，即在这种图中，边往往连接同一类型的节点。然而，在异构图上实现一致的GNN性能仍然是一个开放的研究问题。最近的研究提出了扩展标准GNN架构的方法，以改善在异构图上的性能，但是这些模型无法捕捉到基本的图形属性，例如邻居标签分布，这是学习的基础。在这项工作中，我们提出了GCN for Heterophily（GCNH），这是一种简单但有效的GNN架构，适用于异构和同质情况。GCNH学习并组合了节点和其邻居的分离表示，使用每层学习的一个重要系数来平衡中心节点和邻域的贡献。我们在八个真实世界的图和一组人造图上进行了广泛的实验。",
    "tldr": "本文提出了一种简单而有效的GNN架构GCNH，适用于异构和同质情况，并通过学习重要系数来平衡中心节点和邻域的贡献。"
}