{
    "title": "The impact of the AI revolution on asset management. (arXiv:2304.10212v1 [q-fin.GN])",
    "abstract": "Recent progress in deep learning, a special form of machine learning, has led to remarkable capabilities machines can now be endowed with: they can read and understand free flowing text, reason and bargain with human counterparts, translate texts between languages, learn how to take decisions to maximize certain outcomes, etc. Today, machines have revolutionized the detection of cancer, the prediction of protein structures, the design of drugs, the control of nuclear fusion reactors etc. Although these capabilities are still in their infancy, it seems clear that their continued refinement and application will result in a technological impact on nearly all social and economic areas of human activity, the likes of which we have not seen before. In this article, I will share my view as to how AI will likely impact asset management in general and I will provide a mental framework that will equip readers with a simple criterion to assess whether and to what degree a given fund really exploi",
    "link": "http://arxiv.org/abs/2304.10212",
    "context": "Title: The impact of the AI revolution on asset management. (arXiv:2304.10212v1 [q-fin.GN])\nAbstract: Recent progress in deep learning, a special form of machine learning, has led to remarkable capabilities machines can now be endowed with: they can read and understand free flowing text, reason and bargain with human counterparts, translate texts between languages, learn how to take decisions to maximize certain outcomes, etc. Today, machines have revolutionized the detection of cancer, the prediction of protein structures, the design of drugs, the control of nuclear fusion reactors etc. Although these capabilities are still in their infancy, it seems clear that their continued refinement and application will result in a technological impact on nearly all social and economic areas of human activity, the likes of which we have not seen before. In this article, I will share my view as to how AI will likely impact asset management in general and I will provide a mental framework that will equip readers with a simple criterion to assess whether and to what degree a given fund really exploi",
    "path": "papers/23/04/2304.10212.json",
    "total_tokens": 844,
    "translated_title": "人工智能革命对资产管理的影响",
    "translated_abstract": "深度学习的最新进展使得机器具备了杰出的能力：它们可以阅读和理解自由流动的文本，与人类进行推理和交涉，翻译不同语言的文本，学习如何做出最优决策等等。如今，机器已经在癌症检测、蛋白质结构预测、药物设计、核聚变反应堆控制等方面实现了革命性突破。虽然这些能力仍处于萌芽阶段，但它们在持续完善和应用中的技术影响几乎将在人类活动的几乎所有社会和经济领域中发挥作用，这是我们以前从未见过的。本文将分享我的观点，即人工智能如何影响资产管理，我将提供一个思维框架，使读者可以用一个简单的标准来评估一个特定基金是否真正开发",
    "tldr": "本论文分享了作者关于人工智能可能对资产管理产生影响的观点，同时提供了一个衡量特定基金是否真正开发了AI的简单标准。",
    "en_tdlr": "This paper shares the author's perspective on how AI is likely to impact asset management, and provides a simple criterion to evaluate whether a given fund truly leverages AI."
}