{
    "title": "Copula-Based Density Estimation Models for Multivariate Zero-Inflated Continuous Data. (arXiv:2304.00537v1 [stat.ME])",
    "abstract": "Zero-inflated continuous data ubiquitously appear in many fields, in which lots of exactly zero-valued data are observed while others distribute continuously. Due to the mixed structure of discreteness and continuity in its distribution, statistical analysis is challenging especially for multivariate case. In this paper, we propose two copula-based density estimation models that can cope with multivariate correlation among zero-inflated continuous variables. In order to overcome the difficulty in the use of copulas due to the tied-data problem in zero-inflated data, we propose a new type of copula, rectified Gaussian copula, and present efficient methods for parameter estimation and likelihood computation. Numerical experiments demonstrates the superiority of our proposals compared to conventional density estimation methods.",
    "link": "http://arxiv.org/abs/2304.00537",
    "context": "Title: Copula-Based Density Estimation Models for Multivariate Zero-Inflated Continuous Data. (arXiv:2304.00537v1 [stat.ME])\nAbstract: Zero-inflated continuous data ubiquitously appear in many fields, in which lots of exactly zero-valued data are observed while others distribute continuously. Due to the mixed structure of discreteness and continuity in its distribution, statistical analysis is challenging especially for multivariate case. In this paper, we propose two copula-based density estimation models that can cope with multivariate correlation among zero-inflated continuous variables. In order to overcome the difficulty in the use of copulas due to the tied-data problem in zero-inflated data, we propose a new type of copula, rectified Gaussian copula, and present efficient methods for parameter estimation and likelihood computation. Numerical experiments demonstrates the superiority of our proposals compared to conventional density estimation methods.",
    "path": "papers/23/04/2304.00537.json",
    "total_tokens": 812,
    "translated_title": "基于Copula的多元零膨胀连续数据密度估计模型",
    "translated_abstract": "零膨胀连续数据在许多领域中普遍出现，其中观察到许多完全为零值数据，而其他数据则以连续方式分布。由于其分布中离散和连续的混合结构，多元情况下的统计分析非常具有挑战性。本文提出了两种基于copula的密度估计模型，可以处理零膨胀连续变量之间的多元相关性。为了克服由于零膨胀数据中的绑定数据问题使用copulas的困难，我们提出了一种新类型的copula，即矫正高斯copula，并提出了参数估计和可能性计算的高效方法。数值实验证明了我们的提议相对于传统密度估计方法的优越性。",
    "tldr": "本文提出了两种基于copula的密度估计模型，可以处理多元相关性的零膨胀连续变量，引入矫正高斯copula以应对绑定数据问题，并提出高效的方法进行参数估计和可能性计算。",
    "en_tdlr": "This paper proposes two copula-based density estimation models that can handle multivariate correlation among zero-inflated continuous variables, introduces a rectified Gaussian copula to deal with the tied-data problem, and presents efficient methods for parameter estimation and likelihood computation."
}