{
    "title": "Generating robust counterfactual explanations. (arXiv:2304.12943v1 [cs.LG])",
    "abstract": "Counterfactual explanations have become a mainstay of the XAI field. This particularly intuitive statement allows the user to understand what small but necessary changes would have to be made to a given situation in order to change a model prediction. The quality of a counterfactual depends on several criteria: realism, actionability, validity, robustness, etc. In this paper, we are interested in the notion of robustness of a counterfactual. More precisely, we focus on robustness to counterfactual input changes. This form of robustness is particularly challenging as it involves a trade-off between the robustness of the counterfactual and the proximity with the example to explain. We propose a new framework, CROCO, that generates robust counterfactuals while managing effectively this trade-off, and guarantees the user a minimal robustness. An empirical evaluation on tabular datasets confirms the relevance and effectiveness of our approach.",
    "link": "http://arxiv.org/abs/2304.12943",
    "context": "Title: Generating robust counterfactual explanations. (arXiv:2304.12943v1 [cs.LG])\nAbstract: Counterfactual explanations have become a mainstay of the XAI field. This particularly intuitive statement allows the user to understand what small but necessary changes would have to be made to a given situation in order to change a model prediction. The quality of a counterfactual depends on several criteria: realism, actionability, validity, robustness, etc. In this paper, we are interested in the notion of robustness of a counterfactual. More precisely, we focus on robustness to counterfactual input changes. This form of robustness is particularly challenging as it involves a trade-off between the robustness of the counterfactual and the proximity with the example to explain. We propose a new framework, CROCO, that generates robust counterfactuals while managing effectively this trade-off, and guarantees the user a minimal robustness. An empirical evaluation on tabular datasets confirms the relevance and effectiveness of our approach.",
    "path": "papers/23/04/2304.12943.json",
    "total_tokens": 865,
    "translated_title": "生成强鲁棒性的反事实解释",
    "translated_abstract": "反事实的解释已经成为可解释人工智能领域的主流。这一直观的陈述让用户理解在给定情况下，为改变模型预测而必须进行的小但必要的更改。反事实的质量取决于多个标准：真实性、可行性、有效性、鲁棒性等等。本文关注反事实的鲁棒性概念，更具体地，关注反事实输入变化的鲁棒性。这种鲁棒性尤其具有挑战性，因为它涉及到反事实的鲁棒性和与要解释的示例的接近度之间的权衡。我们提出了一个新的框架CROCO，它能够有效地管理这种权衡，生成具有强鲁棒性的反事实解释，并保证用户具有最小的鲁棒性。在表格数据集上的实证评估确认了我们方法的相关性和有效性。",
    "tldr": "本论文提出了一个新的反事实解释框架CROCO，能够生成强鲁棒性的解释，同时有效地平衡了鲁棒性和解释示例的接近度之间的权衡。",
    "en_tdlr": "This paper proposes a new framework, CROCO, that generates robust counterfactual explanations by effectively managing the trade-off between robustness and proximity with the example to explain. The framework was evaluated on tabular datasets and confirmed to be effective."
}