{
    "title": "A dynamic Bayesian optimized active recommender system for curiosity-driven Human-in-the-loop automated experiments. (arXiv:2304.02484v1 [cs.LG])",
    "abstract": "Optimization of experimental materials synthesis and characterization through active learning methods has been growing over the last decade, with examples ranging from measurements of diffraction on combinatorial alloys at synchrotrons, to searches through chemical space with automated synthesis robots for perovskites. In virtually all cases, the target property of interest for optimization is defined apriori with limited human feedback during operation. In contrast, here we present the development of a new type of human in the loop experimental workflow, via a Bayesian optimized active recommender system (BOARS), to shape targets on the fly, employing human feedback. We showcase examples of this framework applied to pre-acquired piezoresponse force spectroscopy of a ferroelectric thin film, and then implement this in real time on an atomic force microscope, where the optimization proceeds to find symmetric piezoresponse amplitude hysteresis loops. It is found that such features appear",
    "link": "http://arxiv.org/abs/2304.02484",
    "context": "Title: A dynamic Bayesian optimized active recommender system for curiosity-driven Human-in-the-loop automated experiments. (arXiv:2304.02484v1 [cs.LG])\nAbstract: Optimization of experimental materials synthesis and characterization through active learning methods has been growing over the last decade, with examples ranging from measurements of diffraction on combinatorial alloys at synchrotrons, to searches through chemical space with automated synthesis robots for perovskites. In virtually all cases, the target property of interest for optimization is defined apriori with limited human feedback during operation. In contrast, here we present the development of a new type of human in the loop experimental workflow, via a Bayesian optimized active recommender system (BOARS), to shape targets on the fly, employing human feedback. We showcase examples of this framework applied to pre-acquired piezoresponse force spectroscopy of a ferroelectric thin film, and then implement this in real time on an atomic force microscope, where the optimization proceeds to find symmetric piezoresponse amplitude hysteresis loops. It is found that such features appear",
    "path": "papers/23/04/2304.02484.json",
    "total_tokens": 931,
    "translated_title": "一种基于动态贝叶斯优化的积极推荐人机交互实验系统",
    "translated_abstract": "过去十年中，利用积极学习方法优化实验材料的合成和表征已经越来越流行，例如通过在同步辐射下对组合合金进行衍射测量，或者利用自动化合成机器人在化学空间中搜索钙钛矿。在几乎所有情况下，优化的目标物性是事先定义好的，操作期间的人类反馈有限。与此相反，我们提出了一种新型的人机交互实验流程，通过基于贝叶斯优化的积极推荐系统（BOARS）实时塑造目标，并且利用人类反馈。我们展示了这种框架在铁电薄膜的压电响应力谱预先获取数据和原子力显微镜实时优化对称压电响应幅度滞回特征寻找中的应用实例。发现这样的特征出现了。",
    "tldr": "本文开发了一种基于贝叶斯优化的积极推荐人机交互实验系统，利用人类反馈实时塑造目标，并以铁电薄膜的压电响应力谱为例展示了该框架的应用。"
}