{
    "title": "Counterfactual Explanation with Missing Values. (arXiv:2304.14606v1 [cs.LG])",
    "abstract": "Counterfactual Explanation (CE) is a post-hoc explanation method that provides a perturbation for altering the prediction result of a classifier. Users can interpret the perturbation as an \"action\" to obtain their desired decision results. Existing CE methods require complete information on the features of an input instance. However, we often encounter missing values in a given instance, and the previous methods do not work in such a practical situation. In this paper, we first empirically and theoretically show the risk that missing value imputation methods affect the validity of an action, as well as the features that the action suggests changing. Then, we propose a new framework of CE, named Counterfactual Explanation by Pairs of Imputation and Action (CEPIA), that enables users to obtain valid actions even with missing values and clarifies how actions are affected by imputation of the missing values. Specifically, our CEPIA provides a representative set of pairs of an imputation ca",
    "link": "http://arxiv.org/abs/2304.14606",
    "context": "Title: Counterfactual Explanation with Missing Values. (arXiv:2304.14606v1 [cs.LG])\nAbstract: Counterfactual Explanation (CE) is a post-hoc explanation method that provides a perturbation for altering the prediction result of a classifier. Users can interpret the perturbation as an \"action\" to obtain their desired decision results. Existing CE methods require complete information on the features of an input instance. However, we often encounter missing values in a given instance, and the previous methods do not work in such a practical situation. In this paper, we first empirically and theoretically show the risk that missing value imputation methods affect the validity of an action, as well as the features that the action suggests changing. Then, we propose a new framework of CE, named Counterfactual Explanation by Pairs of Imputation and Action (CEPIA), that enables users to obtain valid actions even with missing values and clarifies how actions are affected by imputation of the missing values. Specifically, our CEPIA provides a representative set of pairs of an imputation ca",
    "path": "papers/23/04/2304.14606.json",
    "total_tokens": 679,
    "translated_title": "缺失值下的反事实解释方法",
    "translated_abstract": "反事实解释是一种提供扰动以改变分类器预测结果的事后解释方法。现有方法需要完整信息的输入，但实际情况中往往会有缺失值。本文提出一种新的CE框架（称为CEPIA），使用户可以在有缺失值的情况下获得有效的操作，并阐明缺失值对操作的影响。",
    "tldr": "本论文提出了一种新的反事实解释方法（CEPIA），可以处理数据中的缺失值，使得用户可以获得有效的行动建议并了解缺失值对建议的影响。",
    "en_tdlr": "This paper proposes a new counterfactual explanation method (CEPIA) that can handle missing values in data, enabling users to obtain valid action suggestions and understand the impact of missing values on those suggestions."
}