{
    "title": "Temporal Knowledge Sharing enable Spiking Neural Network Learning from Past and Future. (arXiv:2304.06540v1 [cs.NE])",
    "abstract": "Spiking neural networks have attracted extensive attention from researchers in many fields due to their brain-like information processing mechanism. The proposal of surrogate gradient enables the spiking neural networks to migrate to more complex tasks, and gradually close the gap with the conventional artificial neural networks. Current spiking neural networks utilize the output of all moments to produce the final prediction, which compromises their temporal characteristics and causes a reduction in performance and efficiency. We propose a temporal knowledge sharing approach (TKS) that enables the interaction of information between different moments, by selecting the output of specific moments to compose teacher signals to guide the training of the network along with the real labels. We have validated TKS on both static datasets CIFAR10, CIFAR100, ImageNet-1k and neuromorphic datasets DVS-CIFAR10, NCALTECH101. Our experimental results indicate that we have achieved the current optimal",
    "link": "http://arxiv.org/abs/2304.06540",
    "context": "Title: Temporal Knowledge Sharing enable Spiking Neural Network Learning from Past and Future. (arXiv:2304.06540v1 [cs.NE])\nAbstract: Spiking neural networks have attracted extensive attention from researchers in many fields due to their brain-like information processing mechanism. The proposal of surrogate gradient enables the spiking neural networks to migrate to more complex tasks, and gradually close the gap with the conventional artificial neural networks. Current spiking neural networks utilize the output of all moments to produce the final prediction, which compromises their temporal characteristics and causes a reduction in performance and efficiency. We propose a temporal knowledge sharing approach (TKS) that enables the interaction of information between different moments, by selecting the output of specific moments to compose teacher signals to guide the training of the network along with the real labels. We have validated TKS on both static datasets CIFAR10, CIFAR100, ImageNet-1k and neuromorphic datasets DVS-CIFAR10, NCALTECH101. Our experimental results indicate that we have achieved the current optimal",
    "path": "papers/23/04/2304.06540.json",
    "total_tokens": 1006,
    "translated_title": "使用时间知识共享实现脉冲神经网络对过去和未来的学习",
    "translated_abstract": "脉冲神经网络因其类似于大脑信息处理机制而吸引了许多领域的研究人员的广泛关注。替代梯度的提出使得脉冲神经网络能够迁移到更复杂的任务，并逐步缩小与传统人工神经网络之间的差距。目前的脉冲神经网络利用所有时刻的输出来产生最终的预测，这牺牲了它们的时间特性，导致性能和效率降低。我们提出了一种时间知识共享方法（TKS），它通过选择特定时刻的输出来构成教师信号，使得信息可以在不同时刻之间交互，辅助真实标签引导网络训练。我们在静态数据集CIFAR10、CIFAR100、ImageNet-1k以及神经形态学数据集DVS-CIFAR10、NCALTECH101上验证了TKS。我们的实验结果表明，使用TKS，我们已经在CIFAR10和CIFAR100上取得了当前最优的性能，并且使用TKS的NCALTECH101超过了现有最先进的结果。",
    "tldr": "本文提出了一种时间知识共享方法（TKS），在不同时刻之间交互信息，并辅助真实标签引导脉冲神经网络（SNN）的训练，以实现SNN对过去和未来的学习。实验证明，在多个数据集上使用TKS可以获得当前最优的性能。",
    "en_tdlr": "This paper proposes a temporal knowledge sharing approach (TKS) that enables spiking neural networks (SNNs) to interact information between different moments and guide the training of SNNs using real labels. Experimental results indicate that using TKS can achieve the current optimal performance on multiple datasets."
}