{
    "title": "A Method for Classifying Snow Using Ski-Mounted Strain Sensors. (arXiv:2304.14307v1 [physics.geo-ph])",
    "abstract": "Understanding the structure, quantity, and type of snow in mountain landscapes is crucial for assessing avalanche safety, interpreting satellite imagery, building accurate hydrology models, and choosing the right pair of skis for your weekend trip. Currently, such characteristics of snowpack are measured using a combination of remote satellite imagery, weather stations, and laborious point measurements and descriptions provided by local forecasters, guides, and backcountry users. Here, we explore how characteristics of the top layer of snowpack could be estimated while skiing using strain sensors mounted to the top surface of an alpine ski. We show that with two strain gauges and an inertial measurement unit it is feasible to correctly assign one of three qualitative labels (powder, slushy, or icy/groomed snow) to each 10 second segment of a trajectory with 97% accuracy, independent of skiing style. Our algorithm uses a combination of a data-driven linear model of the ski-snow interact",
    "link": "http://arxiv.org/abs/2304.14307",
    "context": "Title: A Method for Classifying Snow Using Ski-Mounted Strain Sensors. (arXiv:2304.14307v1 [physics.geo-ph])\nAbstract: Understanding the structure, quantity, and type of snow in mountain landscapes is crucial for assessing avalanche safety, interpreting satellite imagery, building accurate hydrology models, and choosing the right pair of skis for your weekend trip. Currently, such characteristics of snowpack are measured using a combination of remote satellite imagery, weather stations, and laborious point measurements and descriptions provided by local forecasters, guides, and backcountry users. Here, we explore how characteristics of the top layer of snowpack could be estimated while skiing using strain sensors mounted to the top surface of an alpine ski. We show that with two strain gauges and an inertial measurement unit it is feasible to correctly assign one of three qualitative labels (powder, slushy, or icy/groomed snow) to each 10 second segment of a trajectory with 97% accuracy, independent of skiing style. Our algorithm uses a combination of a data-driven linear model of the ski-snow interact",
    "path": "papers/23/04/2304.14307.json",
    "total_tokens": 907,
    "translated_title": "利用滑雪装置应变传感器对雪进行分类的方法",
    "translated_abstract": "理解山区景观中雪的结构，数量和类型对于评估雪崩安全性、解释卫星图像、构建准确的水文模型以及选择适合你周末旅行的滑雪板至关重要。本文探讨了如何使用安装在阿尔卑斯滑雪板顶部表面的应变传感器，在滑雪时估算雪面顶层的特征。我们展示了利用两个应变计和一个惯性测量单元可以在每个10秒的轨迹段中正确地分配三个定性标签（粉雪，泥泞的，或冰雪/修剪过的雪），而且独立于滑雪风格，准确率高达97%。我们的算法使用了一种数据驱动的线性模型来描述滑雪板和雪的相互作用。",
    "tldr": "本文介绍了一种利用滑雪板装置应变传感器对雪进行分类的方法，该方法可以通过对每个10秒的轨迹段进行数据处理，独立于滑雪风格，准确地分配三个定性标签。"
}