{
    "title": "An end-to-end, interactive Deep Learning based Annotation system for cursive and print English handwritten text. (arXiv:2304.08670v1 [cs.CV])",
    "abstract": "With the surging inclination towards carrying out tasks on computational devices and digital mediums, any method that converts a task that was previously carried out manually, to a digitized version, is always welcome. Irrespective of the various documentation tasks that can be done online today, there are still many applications and domains where handwritten text is inevitable, which makes the digitization of handwritten documents a very essential task. Over the past decades, there has been extensive research on offline handwritten text recognition. In the recent past, most of these attempts have shifted to Machine learning and Deep learning based approaches. In order to design more complex and deeper networks, and ensure stellar performances, it is essential to have larger quantities of annotated data. Most of the databases present for offline handwritten text recognition today, have either been manually annotated or semi automatically annotated with a lot of manual involvement. Thes",
    "link": "http://arxiv.org/abs/2304.08670",
    "context": "Title: An end-to-end, interactive Deep Learning based Annotation system for cursive and print English handwritten text. (arXiv:2304.08670v1 [cs.CV])\nAbstract: With the surging inclination towards carrying out tasks on computational devices and digital mediums, any method that converts a task that was previously carried out manually, to a digitized version, is always welcome. Irrespective of the various documentation tasks that can be done online today, there are still many applications and domains where handwritten text is inevitable, which makes the digitization of handwritten documents a very essential task. Over the past decades, there has been extensive research on offline handwritten text recognition. In the recent past, most of these attempts have shifted to Machine learning and Deep learning based approaches. In order to design more complex and deeper networks, and ensure stellar performances, it is essential to have larger quantities of annotated data. Most of the databases present for offline handwritten text recognition today, have either been manually annotated or semi automatically annotated with a lot of manual involvement. Thes",
    "path": "papers/23/04/2304.08670.json",
    "total_tokens": 1140,
    "translated_title": "一种端到端的、交互式的基于深度学习的手写英文文本注释系统",
    "translated_abstract": "随着人们越来越倾向于使用计算设备和数字媒介进行任务，将以前手动完成的任务转换为数字化版本的任何方法都会受到欢迎。尽管今天可以在线完成许多文档任务，但仍有许多应用和领域无法避免手写文本，这使手写文档的数字化成为一项非常重要的任务。过去几十年来，离线手写文本识别得到了广泛的研究。最近，大部分的尝试已经转向了基于机器学习和深度学习的方法。为了设计更复杂和更深入的网络，并保证出色的性能，有更多的注释数据是必不可少的。今天用于离线手写文本识别的大部分数据库都是手动或半自动注释的。这些数据库通常规模较小，无法满足当前基于深度学习的方法的要求。在本文中，我们提出了一种端到端的、交互式的注释系统，以解决手写文本数据的稀缺问题。我们的系统包括三个模块：数据管理模块、注释模块和模型训练模块。注释模块用户友好，允许交互式注释草写和印刷英语手写文本。所提出的系统还可以处理大量数据，具有合理的注释时间。实验结果表明，该系统可以有效地提高手写文本识别模型的识别准确率。",
    "tldr": "本文提出了一个端到端、交互式的手写英文文本注释系统，解决了手写文本数据稀缺的问题，并能够有效提高手写文本识别模型的识别准确率。"
}