{
    "title": "FashionSAP: Symbols and Attributes Prompt for Fine-grained Fashion Vision-Language Pre-training. (arXiv:2304.05051v1 [cs.CV])",
    "abstract": "Fashion vision-language pre-training models have shown efficacy for a wide range of downstream tasks. However, general vision-language pre-training models pay less attention to fine-grained domain features, while these features are important in distinguishing the specific domain tasks from general tasks. We propose a method for fine-grained fashion vision-language pre-training based on fashion Symbols and Attributes Prompt (FashionSAP) to model fine-grained multi-modalities fashion attributes and characteristics. Firstly, we propose the fashion symbols, a novel abstract fashion concept layer, to represent different fashion items and to generalize various kinds of fine-grained fashion features, making modelling fine-grained attributes more effective. Secondly, the attributes prompt method is proposed to make the model learn specific attributes of fashion items explicitly. We design proper prompt templates according to the format of fashion data. Comprehensive experiments are conducted o",
    "link": "http://arxiv.org/abs/2304.05051",
    "context": "Title: FashionSAP: Symbols and Attributes Prompt for Fine-grained Fashion Vision-Language Pre-training. (arXiv:2304.05051v1 [cs.CV])\nAbstract: Fashion vision-language pre-training models have shown efficacy for a wide range of downstream tasks. However, general vision-language pre-training models pay less attention to fine-grained domain features, while these features are important in distinguishing the specific domain tasks from general tasks. We propose a method for fine-grained fashion vision-language pre-training based on fashion Symbols and Attributes Prompt (FashionSAP) to model fine-grained multi-modalities fashion attributes and characteristics. Firstly, we propose the fashion symbols, a novel abstract fashion concept layer, to represent different fashion items and to generalize various kinds of fine-grained fashion features, making modelling fine-grained attributes more effective. Secondly, the attributes prompt method is proposed to make the model learn specific attributes of fashion items explicitly. We design proper prompt templates according to the format of fashion data. Comprehensive experiments are conducted o",
    "path": "papers/23/04/2304.05051.json",
    "total_tokens": 869,
    "translated_title": "FashionSAP: 基于符号和特征提示的细粒度时尚视觉语言预训练方法",
    "translated_abstract": "时尚视觉语言预训练模型已被证明在多种下游任务中非常有效。然而，通用的视觉语言预训练模型往往忽略了细粒度领域特征，而这些特征在区分特定领域任务和常规任务中非常重要。为了建模细粒度多模态时尚属性和特征，我们提出了一种基于时尚符号和特征提示（FashionSAP）的细粒度时尚视觉语言预训练方法。首先，我们提出了时尚符号，一种新的抽象时尚概念层，用于表示不同的时尚物品，并概括各种细粒度时尚特征，从而使建模细粒度属性更加有效。其次，我们提出属性提示方法，明确让模型学习时尚物品的具体属性。我们根据时尚数据的格式设计适当的提示模板。进行了全面的实验验证。",
    "tldr": "基于时尚符号和特征提示的细粒度时尚视觉语言预训练方法，可以更好地建模时尚属性和特征，有效提高多种下游任务的表现。",
    "en_tdlr": "A fine-grained fashion vision-language pre-training method based on fashion Symbols and Attributes Prompt (FashionSAP) is proposed to better model fashion attributes and characteristics, effectively improving the performance of various downstream tasks."
}