{
    "title": "Connected and Automated Vehicles in Mixed-Traffic: Learning Human Driver Behavior for Effective On-Ramp Merging. (arXiv:2304.00397v1 [cs.LG])",
    "abstract": "Highway merging scenarios featuring mixed traffic conditions pose significant modeling and control challenges for connected and automated vehicles (CAVs) interacting with incoming on-ramp human-driven vehicles (HDVs). In this paper, we present an approach to learn an approximate information state model of CAV-HDV interactions for a CAV to maneuver safely during highway merging. In our approach, the CAV learns the behavior of an incoming HDV using approximate information states before generating a control strategy to facilitate merging. First, we validate the efficacy of this framework on real-world data by using it to predict the behavior of an HDV in mixed traffic situations extracted from the Next-Generation Simulation repository. Then, we generate simulation data for HDV-CAV interactions in a highway merging scenario using a standard inverse reinforcement learning approach. Without assuming a prior knowledge of the generating model, we show that our approximate information state mod",
    "link": "http://arxiv.org/abs/2304.00397",
    "context": "Title: Connected and Automated Vehicles in Mixed-Traffic: Learning Human Driver Behavior for Effective On-Ramp Merging. (arXiv:2304.00397v1 [cs.LG])\nAbstract: Highway merging scenarios featuring mixed traffic conditions pose significant modeling and control challenges for connected and automated vehicles (CAVs) interacting with incoming on-ramp human-driven vehicles (HDVs). In this paper, we present an approach to learn an approximate information state model of CAV-HDV interactions for a CAV to maneuver safely during highway merging. In our approach, the CAV learns the behavior of an incoming HDV using approximate information states before generating a control strategy to facilitate merging. First, we validate the efficacy of this framework on real-world data by using it to predict the behavior of an HDV in mixed traffic situations extracted from the Next-Generation Simulation repository. Then, we generate simulation data for HDV-CAV interactions in a highway merging scenario using a standard inverse reinforcement learning approach. Without assuming a prior knowledge of the generating model, we show that our approximate information state mod",
    "path": "papers/23/04/2304.00397.json",
    "total_tokens": 954,
    "translated_title": "混合交通中的连接自动汽车：学习人类驾驶员行为以实现出入匝道的有效合并",
    "translated_abstract": "混合交通条件下的公路合流场景对于与进入出入口的人类驾驶车辆（HDV）交互的连接自动汽车（CAV）而言，存在着显着的建模和控制挑战。本文提出了一种方法，通过学习CAV和HDV互动的近似信息状态模型，使CAV在公路合流时安全驾驶。在我们的方法中，CAV会在生成控制策略来促进合并之前，使用近似信息状态学习进入HDV的行为。首先，我们使用实际世界数据验证了这种框架的功效，通过在从Next-Generation Simulation存储库中提取的混合交通情况下预测HDV的行为。然后，我们使用标准的反强化学习方法为公路合流场景生成HDV-CAV交互的模拟数据。在不假设生成模型的先验知识的情况下，我们展示了我们的近似信息状态模型使得在混合交通条件下实现安全且高效的合并。",
    "tldr": "本文介绍了一种学习人类驾驶员行为以实现出入匝道的有效合并的方法，通过学习CAV和HDV互动的近似信息状态模型，使得在混合交通条件下实现安全且高效的合并。",
    "en_tdlr": "This paper proposes an approach to safe and efficient merging for connected and automated vehicles (CAVs) interacting with human-driven vehicles (HDVs) in mixed-traffic conditions by learning an approximate information state model of CAV-HDV interactions to predict HDV behavior and generate a control strategy."
}