{
    "title": "Impossibility of Characterizing Distribution Learning -- a simple solution to a long-standing problem. (arXiv:2304.08712v1 [cs.LG])",
    "abstract": "We consider the long-standing question of finding a parameter of a class of probability distributions that characterizes its PAC learnability. We provide a rather surprising answer - no such parameter exists. Our techniques allow us to show similar results for several general notions of characterizing learnability and for several learning tasks. We show that there is no notion of dimension that characterizes the sample complexity of learning distribution classes. We then consider the weaker requirement of only characterizing learnability (rather than the quantitative sample complexity function). We propose some natural requirements for such a characterization and go on to show that there exists no characterization of learnability that satisfies these requirements for classes of distributions. Furthermore, we show that our results hold for various other learning problems. In particular, we show that there is no notion of dimension characterizing (or characterization of learnability) for",
    "link": "http://arxiv.org/abs/2304.08712",
    "context": "Title: Impossibility of Characterizing Distribution Learning -- a simple solution to a long-standing problem. (arXiv:2304.08712v1 [cs.LG])\nAbstract: We consider the long-standing question of finding a parameter of a class of probability distributions that characterizes its PAC learnability. We provide a rather surprising answer - no such parameter exists. Our techniques allow us to show similar results for several general notions of characterizing learnability and for several learning tasks. We show that there is no notion of dimension that characterizes the sample complexity of learning distribution classes. We then consider the weaker requirement of only characterizing learnability (rather than the quantitative sample complexity function). We propose some natural requirements for such a characterization and go on to show that there exists no characterization of learnability that satisfies these requirements for classes of distributions. Furthermore, we show that our results hold for various other learning problems. In particular, we show that there is no notion of dimension characterizing (or characterization of learnability) for",
    "path": "papers/23/04/2304.08712.json",
    "total_tokens": 919,
    "translated_title": "不可能刻画分布学习--一个长期问题的简单解决方案",
    "translated_abstract": "本文考虑了长期以来存在的一个问题：寻找一类概率分布的参数，以刻画它的PAC可学习性。我们提出了一个相当令人惊讶的答案——没有这样的参数存在。我们的技术使我们能够展示类似结果的几个概念，以及几个学习任务。我们展示了没有任何维度可以刻画学习分布类的样本复杂度。然后，我们考虑了只刻画可学习性（而不是量化样本复杂度函数）的较弱要求。我们提出了一些自然的要求，以便对这样一个刻画进行更好的理解，并进一步展示了不存在一种刻画性质，以满足这些要求，对于分布类的。此外，我们展示了我们的结果适用于各种其他学习问题。特别是，我们展示了没有任何维度可以刻画（或刻画可学习性）的概念，适用于...",
    "tldr": "本文解答了长期存在的问题：没有一种参数可以刻画分布类的PAC可学习性。同时，我们还展示了不存在一种刻画可学习性的性质来满足分布类以及其他学习问题的要求。"
}