{
    "title": "Self-Supervised Multi-Modal Sequential Recommendation. (arXiv:2304.13277v1 [cs.IR])",
    "abstract": "With the increasing development of e-commerce and online services, personalized recommendation systems have become crucial for enhancing user satisfaction and driving business revenue. Traditional sequential recommendation methods that rely on explicit item IDs encounter challenges in handling item cold start and domain transfer problems. Recent approaches have attempted to use modal features associated with items as a replacement for item IDs, enabling the transfer of learned knowledge across different datasets. However, these methods typically calculate the correlation between the model's output and item embeddings, which may suffer from inconsistencies between high-level feature vectors and low-level feature embeddings, thereby hindering further model learning. To address this issue, we propose a dual-tower retrieval architecture for sequence recommendation. In this architecture, the predicted embedding from the user encoder is used to retrieve the generated embedding from the item ",
    "link": "http://arxiv.org/abs/2304.13277",
    "context": "Title: Self-Supervised Multi-Modal Sequential Recommendation. (arXiv:2304.13277v1 [cs.IR])\nAbstract: With the increasing development of e-commerce and online services, personalized recommendation systems have become crucial for enhancing user satisfaction and driving business revenue. Traditional sequential recommendation methods that rely on explicit item IDs encounter challenges in handling item cold start and domain transfer problems. Recent approaches have attempted to use modal features associated with items as a replacement for item IDs, enabling the transfer of learned knowledge across different datasets. However, these methods typically calculate the correlation between the model's output and item embeddings, which may suffer from inconsistencies between high-level feature vectors and low-level feature embeddings, thereby hindering further model learning. To address this issue, we propose a dual-tower retrieval architecture for sequence recommendation. In this architecture, the predicted embedding from the user encoder is used to retrieve the generated embedding from the item ",
    "path": "papers/23/04/2304.13277.json",
    "total_tokens": 963,
    "translated_title": "自监督的多模态顺序推荐",
    "translated_abstract": "随着电子商务和在线服务的不断发展，个性化推荐系统已成为提高用户满意度和推动业务收入的关键。传统的基于显式物品ID的顺序推荐方法在处理项目冷启动和域转移问题方面面临挑战。最近的方法尝试使用与物品关联的模态特征替代物品ID，使学习的知识能够在不同数据集之间传递。然而，这些方法通常计算模型输出与物品嵌入之间的相关性，可能受到高级特征向量和低级特征嵌入之间不一致的影响，从而阻碍进一步的模型学习。为了解决这个问题，我们提出了一种用于顺序推荐的双塔检索架构。在这个架构中，从用户编码器预测的嵌入被用于检索从物品编码器生成的嵌入，可以与额外的模态嵌入相结合，实现推荐模型的自监督学习。所提出的方法在几个基准数据集上取得了最先进的性能，证明它在处理项目冷启动和域转移问题方面是有效的。",
    "tldr": "本文提出了一种自监督的多模态顺序推荐方法，采用双塔检索架构和模态特征，能够有效处理项目冷启动和域转移问题，并在多个基准数据集上取得了最优结果。"
}