{
    "title": "A physics-informed neural network framework for modeling obstacle-related equations. (arXiv:2304.03552v1 [cs.LG])",
    "abstract": "Deep learning has been highly successful in some applications. Nevertheless, its use for solving partial differential equations (PDEs) has only been of recent interest with current state-of-the-art machine learning libraries, e.g., TensorFlow or PyTorch. Physics-informed neural networks (PINNs) are an attractive tool for solving partial differential equations based on sparse and noisy data. Here extend PINNs to solve obstacle-related PDEs which present a great computational challenge because they necessitate numerical methods that can yield an accurate approximation of the solution that lies above a given obstacle. The performance of the proposed PINNs is demonstrated in multiple scenarios for linear and nonlinear PDEs subject to regular and irregular obstacles.",
    "link": "http://arxiv.org/abs/2304.03552",
    "context": "Title: A physics-informed neural network framework for modeling obstacle-related equations. (arXiv:2304.03552v1 [cs.LG])\nAbstract: Deep learning has been highly successful in some applications. Nevertheless, its use for solving partial differential equations (PDEs) has only been of recent interest with current state-of-the-art machine learning libraries, e.g., TensorFlow or PyTorch. Physics-informed neural networks (PINNs) are an attractive tool for solving partial differential equations based on sparse and noisy data. Here extend PINNs to solve obstacle-related PDEs which present a great computational challenge because they necessitate numerical methods that can yield an accurate approximation of the solution that lies above a given obstacle. The performance of the proposed PINNs is demonstrated in multiple scenarios for linear and nonlinear PDEs subject to regular and irregular obstacles.",
    "path": "papers/23/04/2304.03552.json",
    "total_tokens": 818,
    "translated_title": "基于物理知识的神经网络模型求解障碍物相关方程",
    "translated_abstract": "深度学习在一些应用中取得了很大成功，但将其用于求解偏微分方程(PDE)　的研究则是近年来的热点，尤其在目前的机器学习库（如TensorFlow或PyTorch）的支持下取得了重大进展。基于物理知识的神经网络（PINN）可通过解析稀疏且噪声数据来求解偏微分方程，是一种有吸引力的工具。本文将拓展PINN来求解障碍物相关PDE，这类方程难度较大，需要可以得到准确解的数值方法。作者在正常和不规则的障碍情况下，对线性和非线性PDE的多个场景进行了演示，证明了所提出的PINNs性能的有效性。",
    "tldr": "本文拓展了基于物理知识的神经网络(PINN) 来解决求解障碍物相关的偏微分方程问题，这种类型的问题需要解决数值方法的难度较大，但作者通过对多种情况的研究证明了PINN的有效性。",
    "en_tdlr": "This paper extends physics-informed neural networks (PINNs) to solve obstacle-related partial differential equations (PDEs), which require numerical methods to overcome significant computational challenges. The authors demonstrate the effectiveness of PINNs in various scenarios for both linear and nonlinear PDEs subject to regular and irregular obstacles."
}