{
    "title": "X-TIME: An in-memory engine for accelerating machine learning on tabular data with CAMs. (arXiv:2304.01285v1 [cs.LG])",
    "abstract": "Structured, or tabular, data is the most common format in data science. While deep learning models have proven formidable in learning from unstructured data such as images or speech, they are less accurate than simpler approaches when learning from tabular data. In contrast, modern tree-based Machine Learning (ML) models shine in extracting relevant information from structured data. An essential requirement in data science is to reduce model inference latency in cases where, for example, models are used in a closed loop with simulation to accelerate scientific discovery. However, the hardware acceleration community has mostly focused on deep neural networks and largely ignored other forms of machine learning. Previous work has described the use of an analog content addressable memory (CAM) component for efficiently mapping random forests. In this work, we focus on an overall analog-digital architecture implementing a novel increased precision analog CAM and a programmable network on ch",
    "link": "http://arxiv.org/abs/2304.01285",
    "context": "Title: X-TIME: An in-memory engine for accelerating machine learning on tabular data with CAMs. (arXiv:2304.01285v1 [cs.LG])\nAbstract: Structured, or tabular, data is the most common format in data science. While deep learning models have proven formidable in learning from unstructured data such as images or speech, they are less accurate than simpler approaches when learning from tabular data. In contrast, modern tree-based Machine Learning (ML) models shine in extracting relevant information from structured data. An essential requirement in data science is to reduce model inference latency in cases where, for example, models are used in a closed loop with simulation to accelerate scientific discovery. However, the hardware acceleration community has mostly focused on deep neural networks and largely ignored other forms of machine learning. Previous work has described the use of an analog content addressable memory (CAM) component for efficiently mapping random forests. In this work, we focus on an overall analog-digital architecture implementing a novel increased precision analog CAM and a programmable network on ch",
    "path": "papers/23/04/2304.01285.json",
    "total_tokens": 841,
    "tldr": "X-TIME提出了一种增加模拟内容寻址内存和可编程网络的模拟数字结构，以加速结构化数据的机器学习任务。"
}