{
    "title": "Prediction of solar wind speed by applying convolutional neural network to potential field source surface (PFSS) magnetograms. (arXiv:2304.01234v1 [astro-ph.SR])",
    "abstract": "An accurate solar wind speed model is important for space weather predictions, catastrophic event warnings, and other issues concerning solar wind - magnetosphere interaction. In this work, we construct a model based on convolutional neural network (CNN) and Potential Field Source Surface (PFSS) magnetograms, considering a solar wind source surface of $R_{\\rm SS}=2.5R_\\odot$, aiming to predict the solar wind speed at the Lagrange 1 (L1) point of the Sun-Earth system. The input of our model consists of four Potential Field Source Surface (PFSS) magnetograms at $R_{\\rm SS}$, which are 7, 6, 5, and 4 days before the target epoch. Reduced magnetograms are used to promote the model's efficiency. We use the Global Oscillation Network Group (GONG) photospheric magnetograms and the potential field extrapolation model to generate PFSS magnetograms at the source surface. The model provides predictions of the continuous test dataset with an averaged correlation coefficient (CC) of 0.52 and a root",
    "link": "http://arxiv.org/abs/2304.01234",
    "context": "Title: Prediction of solar wind speed by applying convolutional neural network to potential field source surface (PFSS) magnetograms. (arXiv:2304.01234v1 [astro-ph.SR])\nAbstract: An accurate solar wind speed model is important for space weather predictions, catastrophic event warnings, and other issues concerning solar wind - magnetosphere interaction. In this work, we construct a model based on convolutional neural network (CNN) and Potential Field Source Surface (PFSS) magnetograms, considering a solar wind source surface of $R_{\\rm SS}=2.5R_\\odot$, aiming to predict the solar wind speed at the Lagrange 1 (L1) point of the Sun-Earth system. The input of our model consists of four Potential Field Source Surface (PFSS) magnetograms at $R_{\\rm SS}$, which are 7, 6, 5, and 4 days before the target epoch. Reduced magnetograms are used to promote the model's efficiency. We use the Global Oscillation Network Group (GONG) photospheric magnetograms and the potential field extrapolation model to generate PFSS magnetograms at the source surface. The model provides predictions of the continuous test dataset with an averaged correlation coefficient (CC) of 0.52 and a root",
    "path": "papers/23/04/2304.01234.json",
    "total_tokens": 956,
    "translated_title": "应用卷积神经网络对潜在场源面磁图预测太阳风速度",
    "translated_abstract": "准确的太阳风速模型对于太空天气预测、灾难性事件警告和其他与太阳风-磁层相互作用有关的问题非常重要。本研究基于卷积神经网络（CNN）和潜在场源表面（PFSS）磁图构建一个模型，考虑太阳风源表面$R_{\\rm SS}=2.5R_\\odot$，旨在预测太阳-地球系统的Lagrange 1（L1）点的太阳风速。我们的模型输入由$R_{\\rm SS}$处的四张PFSS磁图组成，这些磁图距目标时刻分别为7、6、5和4天。为提高模型效率，我们使用了归一化磁图。我们使用全球振荡网络组（GONG）光球磁图和潜在场外推模型生成PFSS磁图。该模型对连续测试数据集的预测平均相关系数（CC）为0.52，均方根误差为...",
    "tldr": "本研究通过卷积神经网络和潜在场源表面磁图构建了一个模型，能够预测太阳风速度，并且在连续测试数据集上的平均相关系数为0.52。",
    "en_tdlr": "A model is constructed using convolutional neural networks and potential field source surface (PFSS) magnetograms to predict solar wind speeds. The model achieved an average correlation coefficient of 0.52 on the continuous test dataset."
}