{
    "title": "Towards Realistic Ultrasound Fetal Brain Imaging Synthesis. (arXiv:2304.03941v1 [eess.IV])",
    "abstract": "Prenatal ultrasound imaging is the first-choice modality to assess fetal health. Medical image datasets for AI and ML methods must be diverse (i.e. diagnoses, diseases, pathologies, scanners, demographics, etc), however there are few public ultrasound fetal imaging datasets due to insufficient amounts of clinical data, patient privacy, rare occurrence of abnormalities in general practice, and limited experts for data collection and validation. To address such data scarcity, we proposed generative adversarial networks (GAN)-based models, diffusion-super-resolution-GAN and transformer-based-GAN, to synthesise images of fetal ultrasound brain planes from one public dataset. We reported that GAN-based methods can generate 256x256 pixel size of fetal ultrasound trans-cerebellum brain image plane with stable training losses, resulting in lower FID values for diffusion-super-resolution-GAN (average 7.04 and lower FID 5.09 at epoch 10) than the FID values of transformer-based-GAN (average 36.0",
    "link": "http://arxiv.org/abs/2304.03941",
    "context": "Title: Towards Realistic Ultrasound Fetal Brain Imaging Synthesis. (arXiv:2304.03941v1 [eess.IV])\nAbstract: Prenatal ultrasound imaging is the first-choice modality to assess fetal health. Medical image datasets for AI and ML methods must be diverse (i.e. diagnoses, diseases, pathologies, scanners, demographics, etc), however there are few public ultrasound fetal imaging datasets due to insufficient amounts of clinical data, patient privacy, rare occurrence of abnormalities in general practice, and limited experts for data collection and validation. To address such data scarcity, we proposed generative adversarial networks (GAN)-based models, diffusion-super-resolution-GAN and transformer-based-GAN, to synthesise images of fetal ultrasound brain planes from one public dataset. We reported that GAN-based methods can generate 256x256 pixel size of fetal ultrasound trans-cerebellum brain image plane with stable training losses, resulting in lower FID values for diffusion-super-resolution-GAN (average 7.04 and lower FID 5.09 at epoch 10) than the FID values of transformer-based-GAN (average 36.0",
    "path": "papers/23/04/2304.03941.json",
    "total_tokens": 888,
    "translated_title": "实现逼真的胎儿脑部超声成像合成",
    "translated_abstract": "产前超声成像是评估胎儿健康的首选方法。然而，由于临床数据量不足、患者隐私、病变罕见和数据收集和验证的专家有限等原因，公共的超声胎儿成像数据集很少。为了解决这种数据稀缺性，我们提出了基于生成式对抗网络（GAN）的模型，包括扩散超分辨率GAN和基于变形器的GAN，用来合成来自一个公共数据集的胎儿超声脑平面图像。我们报告了GAN-based方法可以产生256x256像素大小的胎儿超声经小脑脑图像平面，并且训练稳定损失，其中，扩散超分辨率GAN（平均7.04，FID值低于5.09 at epoch 10）的FID值低于变形器GAN（平均36.0）。",
    "tldr": "本文使用GAN合成胎儿脑部超声图像，解决了数据稀缺性问题，并证明了GAN-based方法可以生成稳定、逼真的超声图像，为医学AI和ML方法提供了可靠的数据集。",
    "en_tdlr": "This paper proposes GAN-based models to synthesize ultrasound fetal brain planes due to the scarcity of public ultrasound fetal imaging datasets, and the results show that GAN-based methods can generate stable and realistic ultrasound images, providing reliable datasets for medical AI and ML methods."
}