{
    "title": "MProtoNet: A Case-Based Interpretable Model for Brain Tumor Classification with 3D Multi-parametric Magnetic Resonance Imaging. (arXiv:2304.06258v1 [cs.CV])",
    "abstract": "Recent applications of deep convolutional neural networks in medical imaging raise concerns about their interpretability. While most explainable deep learning applications use post hoc methods (such as GradCAM) to generate feature attribution maps, there is a new type of case-based reasoning models, namely ProtoPNet and its variants, which identify prototypes during training and compare input image patches with those prototypes. We propose the first medical prototype network (MProtoNet) to extend ProtoPNet to brain tumor classification with 3D multi-parametric magnetic resonance imaging (mpMRI) data. To address different requirements between 2D natural images and 3D mpMRIs especially in terms of localizing attention regions, a new attention module with soft masking and online-CAM loss is introduced. Soft masking helps sharpen attention maps, while online-CAM loss directly utilizes image-level labels when training the attention module. MProtoNet achieves statistically significant improv",
    "link": "http://arxiv.org/abs/2304.06258",
    "context": "Title: MProtoNet: A Case-Based Interpretable Model for Brain Tumor Classification with 3D Multi-parametric Magnetic Resonance Imaging. (arXiv:2304.06258v1 [cs.CV])\nAbstract: Recent applications of deep convolutional neural networks in medical imaging raise concerns about their interpretability. While most explainable deep learning applications use post hoc methods (such as GradCAM) to generate feature attribution maps, there is a new type of case-based reasoning models, namely ProtoPNet and its variants, which identify prototypes during training and compare input image patches with those prototypes. We propose the first medical prototype network (MProtoNet) to extend ProtoPNet to brain tumor classification with 3D multi-parametric magnetic resonance imaging (mpMRI) data. To address different requirements between 2D natural images and 3D mpMRIs especially in terms of localizing attention regions, a new attention module with soft masking and online-CAM loss is introduced. Soft masking helps sharpen attention maps, while online-CAM loss directly utilizes image-level labels when training the attention module. MProtoNet achieves statistically significant improv",
    "path": "papers/23/04/2304.06258.json",
    "total_tokens": 921,
    "translated_title": "MProtoNet：一种基于案例的可解释性模型，用于带有3D多参数磁共振成像的脑肿瘤分类",
    "translated_abstract": "近年来，深度卷积神经网络在医学影像中的应用引发了人们对其可解释性的担忧。我们提出了第一个医疗原型网络（MProtoNet），用于将ProtoPNet扩展到使用3D多参数磁共振成像数据进行脑肿瘤分类。为了解决2D自然图像和3D mpMRI之间在本地化注意区域方面的不同要求，引入了一种使用软掩膜和在线CAM损失的新型注意模块。MProtoNet通过注意力映射和原型可视化维持解释性，并在一个包含脑胶质瘤和脑膜瘤的mpMRI数据集上取得了显著的分类性能提高。",
    "tldr": "本论文提出了一种基于案例的可解释性模型MProtoNet，用于带有3D多参数磁共振成像的脑肿瘤分类，通过引入新型的注意模块，比四个状态-of-the-art深度学习模型在解释性和分类性能上有所提高。",
    "en_tdlr": "This paper proposes an interpretable case-based model, MProtoNet, for brain tumor classification with 3D multi-parametric magnetic resonance imaging (mpMRI) data, which achieves improved classification performance compared to four state-of-the-art deep learning models while maintaining interpretability through attention maps and prototype visualization."
}