{
    "title": "Learning Optimal Fair Scoring Systems for Multi-Class Classification. (arXiv:2304.05023v1 [cs.LG])",
    "abstract": "Machine Learning models are increasingly used for decision making, in particular in high-stakes applications such as credit scoring, medicine or recidivism prediction. However, there are growing concerns about these models with respect to their lack of interpretability and the undesirable biases they can generate or reproduce. While the concepts of interpretability and fairness have been extensively studied by the scientific community in recent years, few works have tackled the general multi-class classification problem under fairness constraints, and none of them proposes to generate fair and interpretable models for multi-class classification. In this paper, we use Mixed-Integer Linear Programming (MILP) techniques to produce inherently interpretable scoring systems under sparsity and fairness constraints, for the general multi-class classification setup. Our work generalizes the SLIM (Supersparse Linear Integer Models) framework that was proposed by Rudin and Ustun to learn optimal ",
    "link": "http://arxiv.org/abs/2304.05023",
    "context": "Title: Learning Optimal Fair Scoring Systems for Multi-Class Classification. (arXiv:2304.05023v1 [cs.LG])\nAbstract: Machine Learning models are increasingly used for decision making, in particular in high-stakes applications such as credit scoring, medicine or recidivism prediction. However, there are growing concerns about these models with respect to their lack of interpretability and the undesirable biases they can generate or reproduce. While the concepts of interpretability and fairness have been extensively studied by the scientific community in recent years, few works have tackled the general multi-class classification problem under fairness constraints, and none of them proposes to generate fair and interpretable models for multi-class classification. In this paper, we use Mixed-Integer Linear Programming (MILP) techniques to produce inherently interpretable scoring systems under sparsity and fairness constraints, for the general multi-class classification setup. Our work generalizes the SLIM (Supersparse Linear Integer Models) framework that was proposed by Rudin and Ustun to learn optimal ",
    "path": "papers/23/04/2304.05023.json",
    "total_tokens": 985,
    "translated_title": "学习用于多类分类的最优公平评分系统",
    "translated_abstract": "机器学习模型在决策制定中越来越被广泛应用，特别是在信用评分、医学或累犯预测等高风险应用中。然而，人们越来越关注这些模型在解释性和它们可能产生或再现的不良偏差方面的问题。虽然解释性和公平性的概念近年来得到了科学界的广泛研究，但很少有研究探讨在公平性约束下的一般多类分类问题，并且没有提出为多类分类生成公平且可解释的模型。在本文中，我们利用混合整数线性规划（MILP）技术，在稀疏性和公平性约束下，为一般的多类分类设置生成本质上可解释的评分系统。我们的工作推广了 Rudin 和 Ustun 提出的 SLIM（Supersparse Linear Integer Models）框架，以学习二元分类的最优公平评分系统。我们在合成和真实数据集上进行了广泛的实验，比较了我们的方法与现有最先进和基准方法。结果表明，我们提出的方法可以生成具有竞争性预测性能的公平且可解释的模型。",
    "tldr": "本文使用 MIP 技术生成公平且可解释的评分系统解决一般多类分类问题，扩展了 SLIM 框架，实验证明该方法可产生与现有方法竞争性相当的预测性能。",
    "en_tdlr": "This paper proposes using MIP techniques to generate fair and interpretable scoring systems for general multi-class classification, extending the SLIM framework and demonstrating competitive predictive performance in comparison to existing methods."
}