{
    "title": "Ericson: An Interactive Open-Domain Conversational Search Agent. (arXiv:2304.02233v1 [cs.CL])",
    "abstract": "Open-domain conversational search (ODCS) aims to provide valuable, up-to-date information, while maintaining natural conversations to help users refine and ultimately answer information needs. However, creating an effective and robust ODCS agent is challenging. In this paper, we present a fully functional ODCS system, Ericson, which includes state-of-the-art question answering and information retrieval components, as well as intent inference and dialogue management models for proactive question refinement and recommendations. Our system was stress-tested in the Amazon Alexa Prize, by engaging in live conversations with thousands of Alexa users, thus providing empirical basis for the analysis of the ODCS system in real settings. Our interaction data analysis revealed that accurate intent classification, encouraging user engagement, and careful proactive recommendations contribute most to the users satisfaction. Our study further identifies limitations of the existing search techniques, ",
    "link": "http://arxiv.org/abs/2304.02233",
    "context": "Title: Ericson: An Interactive Open-Domain Conversational Search Agent. (arXiv:2304.02233v1 [cs.CL])\nAbstract: Open-domain conversational search (ODCS) aims to provide valuable, up-to-date information, while maintaining natural conversations to help users refine and ultimately answer information needs. However, creating an effective and robust ODCS agent is challenging. In this paper, we present a fully functional ODCS system, Ericson, which includes state-of-the-art question answering and information retrieval components, as well as intent inference and dialogue management models for proactive question refinement and recommendations. Our system was stress-tested in the Amazon Alexa Prize, by engaging in live conversations with thousands of Alexa users, thus providing empirical basis for the analysis of the ODCS system in real settings. Our interaction data analysis revealed that accurate intent classification, encouraging user engagement, and careful proactive recommendations contribute most to the users satisfaction. Our study further identifies limitations of the existing search techniques, ",
    "path": "papers/23/04/2304.02233.json",
    "total_tokens": 908,
    "translated_title": "Ericson: 一个交互式的开放领域会话搜索代理人",
    "translated_abstract": "开放式领域会话搜索（ODCS）旨在提供有价值的、最新的信息，同时保持自然的对话，以帮助用户细化并最终回答信息需求。然而，创建一个有效和强大的ODCS代理人是具有挑战性的。在本文中，我们介绍了一个完全功能的ODCS系统Ericson，其中包括最先进的问答和信息检索组件，以及用于主动问题细化和推荐的意图推断和对话管理模型。我们的系统在亚马逊Alexa Prize中经过了压力测试，与数千名Alexa用户进行了实时对话，从而为分析ODCS系统在真实环境中的基础提供了经验依据。我们的交互数据分析表明，精确的意图分类、鼓励用户参与和仔细的主动推荐对用户满意度做出了最大的贡献。我们的研究进一步确定了现有搜索技术的局限性。",
    "tldr": "本文介绍了Ericson，一个交互式的开放领域会话搜索代理人，其中包括最先进的问答和信息检索组件，以及用于主动问题细化和推荐的意图推断和对话管理模型，在Alexa Prize中经过了压力测试，并发现了现有搜索技术的局限性。",
    "en_tdlr": "This paper introduces Ericson, an interactive open-domain conversational search agent equipped with state-of-the-art question answering and information retrieval components, and intent inference and dialogue management models for proactive question refinement and recommendations. Empirical data from stress-testing Ericson in the Amazon Alexa Prize reveals limitations in existing search techniques."
}