{
    "title": "GARCIA: Powering Representations of Long-tail Query with Multi-granularity Contrastive Learning. (arXiv:2304.12537v1 [cs.LG])",
    "abstract": "Recently, the growth of service platforms brings great convenience to both users and merchants, where the service search engine plays a vital role in improving the user experience by quickly obtaining desirable results via textual queries. Unfortunately, users' uncontrollable search customs usually bring vast amounts of long-tail queries, which severely threaten the capability of search models. Inspired by recently emerging graph neural networks (GNNs) and contrastive learning (CL), several efforts have been made in alleviating the long-tail issue and achieve considerable performance. Nevertheless, they still face a few major weaknesses. Most importantly, they do not explicitly utilize the contextual structure between heads and tails for effective knowledge transfer, and intention-level information is commonly ignored for more generalized representations.  To this end, we develop a novel framework GARCIA, which exploits the graph based knowledge transfer and intention based representat",
    "link": "http://arxiv.org/abs/2304.12537",
    "context": "Title: GARCIA: Powering Representations of Long-tail Query with Multi-granularity Contrastive Learning. (arXiv:2304.12537v1 [cs.LG])\nAbstract: Recently, the growth of service platforms brings great convenience to both users and merchants, where the service search engine plays a vital role in improving the user experience by quickly obtaining desirable results via textual queries. Unfortunately, users' uncontrollable search customs usually bring vast amounts of long-tail queries, which severely threaten the capability of search models. Inspired by recently emerging graph neural networks (GNNs) and contrastive learning (CL), several efforts have been made in alleviating the long-tail issue and achieve considerable performance. Nevertheless, they still face a few major weaknesses. Most importantly, they do not explicitly utilize the contextual structure between heads and tails for effective knowledge transfer, and intention-level information is commonly ignored for more generalized representations.  To this end, we develop a novel framework GARCIA, which exploits the graph based knowledge transfer and intention based representat",
    "path": "papers/23/04/2304.12537.json",
    "total_tokens": 694,
    "translated_title": "GARCIA：利用多粒度对比学习提高长尾查询表示能力",
    "translated_abstract": "最近，服务平台的发展为用户和商家带来了巨大的便利，服务搜索引擎通过文本查询在改善用户体验方面发挥着重要作用。然而，用户的不可控制的搜索习惯通常带来大量的长尾查询，这严重威胁到搜索模型的能力。针对这个问题，我们开发了一个新的框架GARCIA，利用基于图的知识转移和基于意图的表示来提高长尾查询表示能力。",
    "tldr": "GARCIA利用多粒度对比学习，基于图的知识转移和基于意图的表示，提高了长尾查询表示能力。",
    "en_tdlr": "GARCIA utilizes multi-granularity contrastive learning, graph-based knowledge transfer and intention-based representation to improve the representation ability of long-tail queries."
}