{
    "title": "Let the Chart Spark: Embedding Semantic Context into Chart with Text-to-Image Generative Model. (arXiv:2304.14630v1 [cs.AI])",
    "abstract": "Pictorial visualization seamlessly integrates data and semantic context into visual representation, conveying complex information in a manner that is both engaging and informative. Extensive studies have been devoted to developing authoring tools to simplify the creation of pictorial visualizations. However, mainstream works mostly follow a retrieving-and-editing pipeline that heavily relies on retrieved visual elements from a dedicated corpus, which often compromise the data integrity. Text-guided generation methods are emerging, but may have limited applicability due to its predefined recognized entities. In this work, we propose ChartSpark, a novel system that embeds semantic context into chart based on text-to-image generative model. ChartSpark generates pictorial visualizations conditioned on both semantic context conveyed in textual inputs and data information embedded in plain charts. The method is generic for both foreground and background pictorial generation, satisfying the d",
    "link": "http://arxiv.org/abs/2304.14630",
    "context": "Title: Let the Chart Spark: Embedding Semantic Context into Chart with Text-to-Image Generative Model. (arXiv:2304.14630v1 [cs.AI])\nAbstract: Pictorial visualization seamlessly integrates data and semantic context into visual representation, conveying complex information in a manner that is both engaging and informative. Extensive studies have been devoted to developing authoring tools to simplify the creation of pictorial visualizations. However, mainstream works mostly follow a retrieving-and-editing pipeline that heavily relies on retrieved visual elements from a dedicated corpus, which often compromise the data integrity. Text-guided generation methods are emerging, but may have limited applicability due to its predefined recognized entities. In this work, we propose ChartSpark, a novel system that embeds semantic context into chart based on text-to-image generative model. ChartSpark generates pictorial visualizations conditioned on both semantic context conveyed in textual inputs and data information embedded in plain charts. The method is generic for both foreground and background pictorial generation, satisfying the d",
    "path": "papers/23/04/2304.14630.json",
    "total_tokens": 719,
    "translated_title": "让图表闪亮起来：利用文本到图像生成模型将语义上下文嵌入到图表中",
    "translated_abstract": "图示可视化将数据和语义上下文良好地整合到视觉表现中，以一种既引人又信息量大的方式传达复杂信息。本文提出了一个新系统ChartSpark，它基于文本到图像生成模型将语义上下文嵌入在图表中生成图示化的可视化。该方法适用于前景和背景的图示生成，旨在创造具有语义上下文的高质量图示可视化。",
    "tldr": "本文提出了一个新的系统ChartSpark，利用文本到图像生成模型将语义上下文嵌入到图表中，以生成具有高质量语义上下文的图示可视化。",
    "en_tdlr": "This paper proposes a novel system, ChartSpark, that embeds semantic context into charts using a text-to-image generative model to generate high-quality pictorial visualizations with semantic context."
}