{
    "title": "Towards Realizing the Value of Labeled Target Samples: a Two-Stage Approach for Semi-Supervised Domain Adaptation. (arXiv:2304.10762v1 [cs.CV])",
    "abstract": "Semi-Supervised Domain Adaptation (SSDA) is a recently emerging research topic that extends from the widely-investigated Unsupervised Domain Adaptation (UDA) by further having a few target samples labeled, i.e., the model is trained with labeled source samples, unlabeled target samples as well as a few labeled target samples. Compared with UDA, the key to SSDA lies how to most effectively utilize the few labeled target samples. Existing SSDA approaches simply merge the few precious labeled target samples into vast labeled source samples or further align them, which dilutes the value of labeled target samples and thus still obtains a biased model. To remedy this, in this paper, we propose to decouple SSDA as an UDA problem and a semi-supervised learning problem where we first learn an UDA model using labeled source and unlabeled target samples and then adapt the learned UDA model in a semi-supervised way using labeled and unlabeled target samples. By utilizing the labeled source samples",
    "link": "http://arxiv.org/abs/2304.10762",
    "context": "Title: Towards Realizing the Value of Labeled Target Samples: a Two-Stage Approach for Semi-Supervised Domain Adaptation. (arXiv:2304.10762v1 [cs.CV])\nAbstract: Semi-Supervised Domain Adaptation (SSDA) is a recently emerging research topic that extends from the widely-investigated Unsupervised Domain Adaptation (UDA) by further having a few target samples labeled, i.e., the model is trained with labeled source samples, unlabeled target samples as well as a few labeled target samples. Compared with UDA, the key to SSDA lies how to most effectively utilize the few labeled target samples. Existing SSDA approaches simply merge the few precious labeled target samples into vast labeled source samples or further align them, which dilutes the value of labeled target samples and thus still obtains a biased model. To remedy this, in this paper, we propose to decouple SSDA as an UDA problem and a semi-supervised learning problem where we first learn an UDA model using labeled source and unlabeled target samples and then adapt the learned UDA model in a semi-supervised way using labeled and unlabeled target samples. By utilizing the labeled source samples",
    "path": "papers/23/04/2304.10762.json",
    "total_tokens": 984,
    "translated_title": "半监督领域自适应的双阶段方法：实现标记目标样本价值的方法",
    "translated_abstract": "半监督领域自适应（SSDA）是一个新兴的研究主题，它是从广泛研究的无监督领域适应（UDA）扩展而来，通过进一步标记一些目标样本来训练模型，即使用标记的源样本、未标记的目标样本以及少量标记的目标样本进行训练。与UDA相比，SSDA的关键在于如何最有效地利用一些有限的标记目标样本。现有的SSDA方法将少数宝贵的标记目标样本简单合并到大量的标记源样本中或进一步对齐它们，这会削弱标记目标样本的价值，因此仍然会得到有偏差的模型。为了解决这个问题，本文提出了将SSDA分解为UDA问题和半监督学习问题的方法，我们首先使用标记源和未标记目标样本学习UDA模型，然后再使用标记和未标记目标样本以半监督的方式调整所学的UDA模型。通过利用标记源样本，我们在几个基准数据集上实现了最先进的半监督领域自适应性能。",
    "tldr": "该论文提出了一种基于双阶段方法的半监督领域自适应方法，成功利用了少量有限的标记目标样本，相对于其他方法取得了更好的性能表现。",
    "en_tdlr": "This paper proposes a two-stage approach for semi-supervised domain adaptation, which successfully utilizes a limited number of labeled target samples and achieves better performance than other methods."
}