{
    "title": "Controllable Data Augmentation for Context-Dependent Text-to-SQL. (arXiv:2304.13902v1 [cs.CL])",
    "abstract": "The limited scale of annotated data constraints existing context-dependent text-to-SQL models because of the complexity of labeling. The data augmentation method is a commonly used method to solve this problem. However, the data generated by current augmentation methods often lack diversity. In this paper, we introduce ConDA, which generates interactive questions and corresponding SQL results. We designed the SQL dialogue state to enhance the data diversity through the state transition. Meanwhile, we also present a filter method to ensure the data quality by a grounding model. Additionally, we utilize a grounding model to identify and filter low-quality questions that mismatch the state information. Experimental results on the SParC and CoSQL datasets show that ConDA boosts the baseline model to achieve an average improvement of $3.3\\%$ on complex questions. Moreover, we analyze the augmented data, which reveals that the data generated by ConDA are of high quality in both SQL template ",
    "link": "http://arxiv.org/abs/2304.13902",
    "context": "Title: Controllable Data Augmentation for Context-Dependent Text-to-SQL. (arXiv:2304.13902v1 [cs.CL])\nAbstract: The limited scale of annotated data constraints existing context-dependent text-to-SQL models because of the complexity of labeling. The data augmentation method is a commonly used method to solve this problem. However, the data generated by current augmentation methods often lack diversity. In this paper, we introduce ConDA, which generates interactive questions and corresponding SQL results. We designed the SQL dialogue state to enhance the data diversity through the state transition. Meanwhile, we also present a filter method to ensure the data quality by a grounding model. Additionally, we utilize a grounding model to identify and filter low-quality questions that mismatch the state information. Experimental results on the SParC and CoSQL datasets show that ConDA boosts the baseline model to achieve an average improvement of $3.3\\%$ on complex questions. Moreover, we analyze the augmented data, which reveals that the data generated by ConDA are of high quality in both SQL template ",
    "path": "papers/23/04/2304.13902.json",
    "total_tokens": 842,
    "translated_title": "可控的数据增强方法用于上下文相关的文本到SQL转换",
    "translated_abstract": "由于标注数据数量有限，标注复杂度高，限制了现有的上下文相关的文本到SQL转换模型的规模。数据增强是解决这个问题的常用方法。然而，当前增强方法产生的数据往往缺乏多样性。在本文中，我们介绍了ConDA，可以生成交互式的问题和相应的SQL结果，设计了SQL对话状态以通过状态转移增强数据多样性，同时，我们还提供了一种基于grounding模型的过滤器方法来确保数据质量。此外，我们利用grounding模型来识别和过滤与状态信息不匹配的低质量问题。在SParC和CoSQL数据集上的实验结果表明，ConDA将基线模型提高了平均 $3.3\\%$ 的复杂问题的性能。此外，我们分析了增强数据，发现ConDA生成的数据在SQL模板匹配和语义正确性方面具有高质量。",
    "tldr": "提出了ConDA方法，可以生成交互式问题和相应的SQL结果，并设计了SQL对话状态和过滤方法来增强数据多样性和质量，能够提高复杂问题的性能。",
    "en_tdlr": "ConDA is presented to generate interactive questions and corresponding SQL results, and designed SQL dialogue state and filter method to enhance data diversity and quality, which can improve the performance of complex questions."
}