{
    "title": "The quality of school track assignment decisions by teachers. (arXiv:2304.10636v1 [econ.GN])",
    "abstract": "We study the quality of secondary school track assignment decisions in the Netherlands, using a regression discontinuity design. In 6th grade, primary school teachers assign each student to a secondary school track. If a student scores above a track-specific cutoff on the standardized end-of-primary education test, the teacher can upwardly revise this assignment. By comparing students just left and right of these cutoffs, we find that between 50-90% of the students are \"trapped in track\": these students are on the high track after four years, only if they started on the high track in first year. The remaining (minority of) students are \"always low\": they are always on the low track after four years, independently of where they started. These proportions hold for students near the cutoffs that shift from the low to the high track in first year by scoring above the cutoff. Hence, for a majority of these students the initial (unrevised) track assignment decision is too low. The results re",
    "link": "http://arxiv.org/abs/2304.10636",
    "context": "Title: The quality of school track assignment decisions by teachers. (arXiv:2304.10636v1 [econ.GN])\nAbstract: We study the quality of secondary school track assignment decisions in the Netherlands, using a regression discontinuity design. In 6th grade, primary school teachers assign each student to a secondary school track. If a student scores above a track-specific cutoff on the standardized end-of-primary education test, the teacher can upwardly revise this assignment. By comparing students just left and right of these cutoffs, we find that between 50-90% of the students are \"trapped in track\": these students are on the high track after four years, only if they started on the high track in first year. The remaining (minority of) students are \"always low\": they are always on the low track after four years, independently of where they started. These proportions hold for students near the cutoffs that shift from the low to the high track in first year by scoring above the cutoff. Hence, for a majority of these students the initial (unrevised) track assignment decision is too low. The results re",
    "path": "papers/23/04/2304.10636.json",
    "total_tokens": 962,
    "translated_title": "教师作出学校分班决策的质量研究——以荷兰为例",
    "translated_abstract": "本文使用回归不连续设计研究了荷兰中学阶段分班决策的质量。在小学六年级，小学教师将每个学生分配到中学阶段的一个学习轨迹上。如果学生在小学教育的标准化结束测试中的得分高于特定的轨迹分数线，教师可以向上修改这个分配决策。通过比较这些分数线两侧的学生，发现在四年后，有50-90％的学生“被困在轨迹中”，意味着他们只有在第一年就开始在高轨迹上的情况下，才能在四年后在高轨迹上。其他（少数）学生则“始终处于低水平”，无论他们最初位于哪个水平，四年后都会一直在低水平上。这些比例适用于在第一年通过得分超过分数线而从低轨迹转到高轨迹的接近分数线的学生。因此，对于大多数这些学生来说，最初（未修改的）分班决策太低了。研究结果表明，教师作出的分班决策质量值得关注。",
    "tldr": "本文研究了荷兰中学阶段分班决策的质量，发现教师的初始分班决策对于大多数学生来说太低了。",
    "en_tdlr": "This paper examines the quality of secondary school track assignment decisions in the Netherlands, showing that initial track assignments by teachers are too low for the majority of students."
}