{
    "title": "chatIPCC: Grounding Conversational AI in Climate Science. (arXiv:2304.05510v1 [cs.CL])",
    "abstract": "Large Language Models (LLMs) have made significant progress in recent years, achieving remarkable results in question-answering tasks (QA). However, they still face two major challenges: hallucination and outdated information after the training phase. These challenges take center stage in critical domains like climate change, where obtaining accurate and up-to-date information from reliable sources in a limited time is essential and difficult. To overcome these barriers, one potential solution is to provide LLMs with access to external, scientifically accurate, and robust sources (long-term memory) to continuously update their knowledge and prevent the propagation of inaccurate, incorrect, or outdated information. In this study, we enhanced GPT-4 by integrating the information from the Sixth Assessment Report of the Intergovernmental (IPCC AR6), the most comprehensive, up-to-date, and reliable source in this domain. We present our conversational AI prototype, available at www.chatclima",
    "link": "http://arxiv.org/abs/2304.05510",
    "context": "Title: chatIPCC: Grounding Conversational AI in Climate Science. (arXiv:2304.05510v1 [cs.CL])\nAbstract: Large Language Models (LLMs) have made significant progress in recent years, achieving remarkable results in question-answering tasks (QA). However, they still face two major challenges: hallucination and outdated information after the training phase. These challenges take center stage in critical domains like climate change, where obtaining accurate and up-to-date information from reliable sources in a limited time is essential and difficult. To overcome these barriers, one potential solution is to provide LLMs with access to external, scientifically accurate, and robust sources (long-term memory) to continuously update their knowledge and prevent the propagation of inaccurate, incorrect, or outdated information. In this study, we enhanced GPT-4 by integrating the information from the Sixth Assessment Report of the Intergovernmental (IPCC AR6), the most comprehensive, up-to-date, and reliable source in this domain. We present our conversational AI prototype, available at www.chatclima",
    "path": "papers/23/04/2304.05510.json",
    "total_tokens": 907,
    "translated_title": "chatIPCC: 基于气候科学的对话型人工智能系统",
    "translated_abstract": "大型语言模型在近年来在问答任务方面取得了显着进展。然而，它们仍面临两个主要挑战：幻觉和训练后信息过时。在关键领域，如气候变化，快速从可靠来源获取准确和最新信息是至关重要且困难的。为了克服这些障碍，一个潜在的解决方案是为大型语言模型提供外部科学准确且可靠的来源（长期记忆），以持续更新其知识并防止不准确、不正确或过时信息的传播。在本研究中，我们通过整合联合政府间气候变化专门委员会第六次评估报告（IPCC AR6）中的信息来增强GPT-4。我们展示了我们的对话型人工智能原型，可以在www.chatclima.com上提问与气候科学相关的问题并获得基于IPCC AR6报告的科学准确答案。",
    "tldr": "chatIPCC是一个基于气候科学的对话型人工智能系统，通过整合IPCC AR6中的信息来增强GPT-4模型，并提供可靠、科学准确的答案。",
    "en_tdlr": "chatIPCC is a conversational AI system based on climate science, which enhances GPT-4 model by integrating information from IPCC AR6 report, and provides reliable and scientifically accurate answers."
}