{
    "title": "Expectations over Unspoken Alternatives Predict Pragmatic Inferences. (arXiv:2304.04758v1 [cs.CL])",
    "abstract": "Scalar inferences (SI) are a signature example of how humans interpret language based on unspoken alternatives. While empirical studies have demonstrated that human SI rates are highly variable -- both within instances of a single scale, and across different scales -- there have been few proposals that quantitatively explain both cross- and within-scale variation. Furthermore, while it is generally assumed that SIs arise through reasoning about unspoken alternatives, it remains debated whether humans reason about alternatives as linguistic forms, or at the level of concepts. Here, we test a shared mechanism explaining SI rates within and across scales: context-driven expectations about the unspoken alternatives. Using neural language models to approximate human predictive distributions, we find that SI rates are captured by the expectedness of the strong scalemate as an alternative. Crucially, however, expectedness robustly predicts cross-scale variation only under a meaning-based view",
    "link": "http://arxiv.org/abs/2304.04758",
    "context": "Title: Expectations over Unspoken Alternatives Predict Pragmatic Inferences. (arXiv:2304.04758v1 [cs.CL])\nAbstract: Scalar inferences (SI) are a signature example of how humans interpret language based on unspoken alternatives. While empirical studies have demonstrated that human SI rates are highly variable -- both within instances of a single scale, and across different scales -- there have been few proposals that quantitatively explain both cross- and within-scale variation. Furthermore, while it is generally assumed that SIs arise through reasoning about unspoken alternatives, it remains debated whether humans reason about alternatives as linguistic forms, or at the level of concepts. Here, we test a shared mechanism explaining SI rates within and across scales: context-driven expectations about the unspoken alternatives. Using neural language models to approximate human predictive distributions, we find that SI rates are captured by the expectedness of the strong scalemate as an alternative. Crucially, however, expectedness robustly predicts cross-scale variation only under a meaning-based view",
    "path": "papers/23/04/2304.04758.json",
    "total_tokens": 899,
    "translated_title": "无言的选择对期望的影响及其对语用推理的预测",
    "translated_abstract": "标度推理是人类基于无言的选择解释语言的一个典型例子。虽然实证研究表明人类的标度推理率变化很大，既在单个标度的实例内，也在不同标度之间，但很少有综合解释能够定量解释跨标度和单一标度内的变异。此外，虽然通常认为标度推理是通过思考无言的选择而产生的，但人们仍在争论人类是在语言形式层面还是在概念层面上推理无言的选择。在本文中，我们测试了一个共享的机制，解释了标度推理率在标度内部和跨标度内的变异：关于无言的选择的上下文驱动的期望。使用神经语言模型来近似人类的预测分布，我们发现标度推理率可以通过中性标度作为替代方案的预期程度来捕获。 然而，值得注意的是，在基于含义的观点下，期望显著地只预测跨标度的变异。",
    "tldr": "研究表明，人们在理解语言时会根据上下文中未明说的替代方案的期望来做出标度推理，该机制解释了标度推理内部和跨标度变化的原因。",
    "en_tdlr": "This study shows that humans make scalar inferences based on the expectation of unspoken alternatives in the context, which explains both within and across-scale variation. It also suggests that the mechanism operates at the level of concepts rather than language forms."
}