{
    "title": "SC-ML: Self-supervised Counterfactual Metric Learning for Debiased Visual Question Answering. (arXiv:2304.01647v1 [cs.CV])",
    "abstract": "Visual question answering (VQA) is a critical multimodal task in which an agent must answer questions according to the visual cue. Unfortunately, language bias is a common problem in VQA, which refers to the model generating answers only by associating with the questions while ignoring the visual content, resulting in biased results. We tackle the language bias problem by proposing a self-supervised counterfactual metric learning (SC-ML) method to focus the image features better. SC-ML can adaptively select the question-relevant visual features to answer the question, reducing the negative influence of question-irrelevant visual features on inferring answers. In addition, question-irrelevant visual features can be seamlessly incorporated into counterfactual training schemes to further boost robustness. Extensive experiments have proved the effectiveness of our method with improved results on the VQA-CP dataset. Our code will be made publicly available.",
    "link": "http://arxiv.org/abs/2304.01647",
    "context": "Title: SC-ML: Self-supervised Counterfactual Metric Learning for Debiased Visual Question Answering. (arXiv:2304.01647v1 [cs.CV])\nAbstract: Visual question answering (VQA) is a critical multimodal task in which an agent must answer questions according to the visual cue. Unfortunately, language bias is a common problem in VQA, which refers to the model generating answers only by associating with the questions while ignoring the visual content, resulting in biased results. We tackle the language bias problem by proposing a self-supervised counterfactual metric learning (SC-ML) method to focus the image features better. SC-ML can adaptively select the question-relevant visual features to answer the question, reducing the negative influence of question-irrelevant visual features on inferring answers. In addition, question-irrelevant visual features can be seamlessly incorporated into counterfactual training schemes to further boost robustness. Extensive experiments have proved the effectiveness of our method with improved results on the VQA-CP dataset. Our code will be made publicly available.",
    "path": "papers/23/04/2304.01647.json",
    "total_tokens": 917,
    "translated_title": "SC-ML：自监督对抗度量学习降低视觉问答偏差",
    "translated_abstract": "视觉问答是一项重要的多模态任务，需要模型根据视觉提示回答问题。然而，语言偏差是视觉问答中常见的问题，模型只是通过将问题与答案相关联而忽略了视觉内容，导致结果不准确。我们通过提出自监督对抗度量学习（SC-ML）方法来解决语言偏差问题，以更好地聚焦图像特征。SC-ML可以自适应地选择与问题相关的视觉特征来回答问题，减少无关视觉特征对推断答案的负面影响。此外，无关的视觉特征还可以无缝地融入反事实训练方案，进一步提高鲁棒性。大量实验证明了我们的方法的有效性，并在VQA-CP数据集上获得了改进的结果。我们的代码将公开提供。",
    "tldr": "本论文提出自监督对抗度量学习（SC-ML）方法来解决视觉问答中的语言偏差问题，可以自适应地选择与问题相关的视觉特征来回答问题，有效地降低了无关视觉特征对推断答案的负面影响，获得了比以往更好的结果。",
    "en_tdlr": "This paper proposes a self-supervised counterfactual metric learning (SC-ML) method to tackle language bias problem in visual question answering by adaptively selecting question-relevant visual features to infer answers, reducing the negative influence of question-irrelevant visual features, and achieving improved results."
}