{
    "title": "Online Learning for Scheduling MIP Heuristics. (arXiv:2304.03755v1 [math.OC])",
    "abstract": "Mixed Integer Programming (MIP) is NP-hard, and yet modern solvers often solve large real-world problems within minutes. This success can partially be attributed to heuristics. Since their behavior is highly instance-dependent, relying on hard-coded rules derived from empirical testing on a large heterogeneous corpora of benchmark instances might lead to sub-optimal performance. In this work, we propose an online learning approach that adapts the application of heuristics towards the single instance at hand. We replace the commonly used static heuristic handling with an adaptive framework exploiting past observations about the heuristic's behavior to make future decisions. In particular, we model the problem of controlling Large Neighborhood Search and Diving - two broad and complex classes of heuristics as a multi-armed bandit problem. Going beyond existing work in the literature, we control two different classes of heuristics simultaneously by a single learning agent. We verify our",
    "link": "http://arxiv.org/abs/2304.03755",
    "context": "Title: Online Learning for Scheduling MIP Heuristics. (arXiv:2304.03755v1 [math.OC])\nAbstract: Mixed Integer Programming (MIP) is NP-hard, and yet modern solvers often solve large real-world problems within minutes. This success can partially be attributed to heuristics. Since their behavior is highly instance-dependent, relying on hard-coded rules derived from empirical testing on a large heterogeneous corpora of benchmark instances might lead to sub-optimal performance. In this work, we propose an online learning approach that adapts the application of heuristics towards the single instance at hand. We replace the commonly used static heuristic handling with an adaptive framework exploiting past observations about the heuristic's behavior to make future decisions. In particular, we model the problem of controlling Large Neighborhood Search and Diving - two broad and complex classes of heuristics as a multi-armed bandit problem. Going beyond existing work in the literature, we control two different classes of heuristics simultaneously by a single learning agent. We verify our",
    "path": "papers/23/04/2304.03755.json",
    "total_tokens": 1002,
    "translated_title": "基于在线学习的混合整数规划启发式调度方法",
    "translated_abstract": "混合整数规划(MIP)是NP难问题，但现代求解器通常可以在几分钟内解决大型实际问题。这种成功部分归功于启发式方法。由于它们的行为高度依赖于实例，因此依赖于从大型异构基准实例的经验测试推导出的硬编码规则可能会导致次优性能。在这项工作中，我们提出了一种基于在线学习的方法，使启发式方法能够适应当前问题实例。我们用一个适应性框架取代了通常使用的静态启发式处理方法，该框架利用关于启发式方法行为的过去观察结果来做出未来决策。特别地，我们将控制大邻域搜索和潜水 - 两个广泛且复杂的启发式方法的问题建模为多臂赌博机问题。超越了现有文献中的工作，我们通过单个学习代理同时控制了两个不同类别的启发式方法。我们在MIPLIB 2017基准集上验证了我们的方法，并表明我们的方法优于最先进的启发式处理技术。",
    "tldr": "本文介绍了一种基于在线学习的启发式方法调度技术，针对单个问题实例采用适应性框架，超越现有文献中的工作，同时控制两个不同类型的启发式方法，经过基准测试表明该方法能有效提高性能。",
    "en_tdlr": "This paper introduces an online learning approach for scheduling MIP heuristics, which adaptively applies heuristics to individual problem instances. By modeling Large Neighborhood Search and Diving as a multi-armed bandit problem, the approach controls two different classes of heuristics simultaneously, outperforming state-of-the-art heuristic handling techniques in benchmark tests."
}