{
    "title": "Optimized EEG based mood detection with signal processing and deep neural networks for brain-computer interface. (arXiv:2304.01349v1 [q-bio.NC])",
    "abstract": "Electroencephalogram (EEG) is a very promising and widely implemented procedure to study brain signals and activities by amplifying and measuring the post-synaptical potential arising from electrical impulses produced by neurons and detected by specialized electrodes attached to specific points in the scalp. It can be studied for detecting brain abnormalities, headaches, and other conditions. However, there are limited studies performed to establish a smart decision-making model to identify EEG's relation with the mood of the subject. In this experiment, EEG signals of 28 healthy human subjects have been observed with consent and attempts have been made to study and recognise moods. Savitzky-Golay band-pass filtering and Independent Component Analysis have been used for data filtration.Different neural network algorithms have been implemented to analyze and classify the EEG data based on the mood of the subject. The model is further optimised by the usage of Blackman window-based Fouri",
    "link": "http://arxiv.org/abs/2304.01349",
    "context": "Title: Optimized EEG based mood detection with signal processing and deep neural networks for brain-computer interface. (arXiv:2304.01349v1 [q-bio.NC])\nAbstract: Electroencephalogram (EEG) is a very promising and widely implemented procedure to study brain signals and activities by amplifying and measuring the post-synaptical potential arising from electrical impulses produced by neurons and detected by specialized electrodes attached to specific points in the scalp. It can be studied for detecting brain abnormalities, headaches, and other conditions. However, there are limited studies performed to establish a smart decision-making model to identify EEG's relation with the mood of the subject. In this experiment, EEG signals of 28 healthy human subjects have been observed with consent and attempts have been made to study and recognise moods. Savitzky-Golay band-pass filtering and Independent Component Analysis have been used for data filtration.Different neural network algorithms have been implemented to analyze and classify the EEG data based on the mood of the subject. The model is further optimised by the usage of Blackman window-based Fouri",
    "path": "papers/23/04/2304.01349.json",
    "total_tokens": 1067,
    "translated_title": "采用信号处理和深度神经网络的优化EEG情绪检测模型用于脑机接口",
    "translated_abstract": "电子脑图（EEG）是一种非常有前途且广泛应用的程序，通过放大并测量神经元产生的电脉冲并由特殊电极检测头皮上特定点产生的电位来研究大脑信号和活动。它可以用于检测脑部异常、头痛和其他疾病。然而，目前尚有限的研究用于建立智能决策模型以确定EEG与被试情绪的关系。在这项实验中，对28名健康人类被试的EEG信号进行了观察，并试图研究和识别情绪。采用Savitzky-Golay带通滤波和独立成分分析对数据进行了过滤。实现了不同的神经网络算法来分析和分类基于被试情绪的EEG数据。通过使用基于Blackman窗口的傅里叶变换算法，对数据不太重要的权重进行降低以提高分类的准确性。实验表明，新开发的模型在情绪检测的准确性方面胜过现有模型。",
    "tldr": "本论文研究了优化EEG情绪检测模型，通过信号处理和深度神经网络进行脑机接口，通过Savitzky-Golay滤波和独立成分分析对EEG信号进行预处理，实现了 Blackman窗口的傅里叶变换算法，创新提高了分类的准确性。",
    "en_tdlr": "This paper researches an optimized EEG mood detection model with signal processing and deep neural networks for brain-computer interface. A new model is developed by pre-processing EEG signals with Savitzky-Golay band-pass filtering and Independent Component Analysis, and implementing different neural network algorithms for mood classification. The model is further optimized with a Blackman window-based Fourier Transform algorithm to increase the accuracy of classification."
}