{
    "title": "Towards an Hybrid Hodgkin-Huxley Action Potential Generation Model. (arXiv:2304.01346v1 [q-bio.NC])",
    "abstract": "Mathematical models for the generation of the action potential can improve the understanding of physiological mechanisms that are consequence of the electrical activity in neurons. In such models, some equations involving empirically obtained functions of the membrane potential are usually defined. The best known of these models, the Hodgkin-Huxley model, is an example of this paradigm since it defines the conductances of ion channels in terms of the opening and closing rates of each type of gate present in the channels. These functions need to be derived from laboratory measurements that are often very expensive and produce little data because they involve a time-space-independent measurement of the voltage in a single channel of the cell membrane. In this work, we investigate the possibility of finding the Hodgkin-Huxley model's parametric functions using only two simple measurements (the membrane voltage as a function of time and the injected current that triggered that voltage) and",
    "link": "http://arxiv.org/abs/2304.01346",
    "context": "Title: Towards an Hybrid Hodgkin-Huxley Action Potential Generation Model. (arXiv:2304.01346v1 [q-bio.NC])\nAbstract: Mathematical models for the generation of the action potential can improve the understanding of physiological mechanisms that are consequence of the electrical activity in neurons. In such models, some equations involving empirically obtained functions of the membrane potential are usually defined. The best known of these models, the Hodgkin-Huxley model, is an example of this paradigm since it defines the conductances of ion channels in terms of the opening and closing rates of each type of gate present in the channels. These functions need to be derived from laboratory measurements that are often very expensive and produce little data because they involve a time-space-independent measurement of the voltage in a single channel of the cell membrane. In this work, we investigate the possibility of finding the Hodgkin-Huxley model's parametric functions using only two simple measurements (the membrane voltage as a function of time and the injected current that triggered that voltage) and",
    "path": "papers/23/04/2304.01346.json",
    "total_tokens": 1021,
    "translated_title": "一种混合型霍奇金-赫胥黎动作电位生成模型的研究",
    "translated_abstract": "通过数学模型对于神经元电活动引起生理机制的理解得到了提高。其中，一些包括膜电位经验函数的方程被定义。最常见的霍奇金-赫胥黎模型是这种范例的一个例子，因为它将离子通道的电导定义为通道中的每种门打开和关闭速率。这些函数需要从实验室测量中获得，而这些实验通常非常昂贵，又因为涉及单个细胞膜通道电压的时间空间独立测量，因此产生的数据有限。在这项工作中，我们探讨了仅使用两个简单的测量（时间的膜电压函数和触发该电压的注入电流）以及将霍奇金-赫胥黎模型与简单等效电路组合而成的简化模型来寻找霍奇金-赫胥黎模型参数函数的可能性。我们的结果表明，这种混合模型能够以非常高的准确性表示动作电位，并且所需的测量量显著减少，这使得它成为研究神经元电活动的有前途的途径。",
    "tldr": "本文提出了一种使用简单测量和简化模型构建混合型霍奇金-赫胥黎模型的方法，可以在显著减少测量量的情况下准确地表示神经元动作电位。",
    "en_tdlr": "This paper proposes a method for building a hybrid Hodgkin-Huxley model using simple measurements and a simplified model, which can accurately represent the action potential with significantly reduced required measurements for the study of the electrical activity in neurons."
}