{
    "title": "Autonomic Architecture for Big Data Performance Optimization. (arXiv:2304.10503v1 [cs.DC])",
    "abstract": "The big data software stack based on Apache Spark and Hadoop has become mission critical in many enterprises. Performance of Spark and Hadoop jobs depends on a large number of configuration settings. Manual tuning is expensive and brittle. There have been prior efforts to develop on-line and off-line automatic tuning approaches to make the big data stack less dependent on manual tuning. These, however, demonstrated only modest performance improvements with very simple, single-user workloads on small data sets. This paper presents KERMIT - the autonomic architecture for big data capable of automatically tuning Apache Spark and Hadoop on-line, and achieving performance results 30% faster than rule-of-thumb tuning by a human administrator and up to 92% as fast as the fastest possible tuning established by performing an exhaustive search of the tuning parameter space. KERMIT can detect important workload changes with up to 99% accuracy, and predict future workload types with up to 96% accu",
    "link": "http://arxiv.org/abs/2304.10503",
    "context": "Title: Autonomic Architecture for Big Data Performance Optimization. (arXiv:2304.10503v1 [cs.DC])\nAbstract: The big data software stack based on Apache Spark and Hadoop has become mission critical in many enterprises. Performance of Spark and Hadoop jobs depends on a large number of configuration settings. Manual tuning is expensive and brittle. There have been prior efforts to develop on-line and off-line automatic tuning approaches to make the big data stack less dependent on manual tuning. These, however, demonstrated only modest performance improvements with very simple, single-user workloads on small data sets. This paper presents KERMIT - the autonomic architecture for big data capable of automatically tuning Apache Spark and Hadoop on-line, and achieving performance results 30% faster than rule-of-thumb tuning by a human administrator and up to 92% as fast as the fastest possible tuning established by performing an exhaustive search of the tuning parameter space. KERMIT can detect important workload changes with up to 99% accuracy, and predict future workload types with up to 96% accu",
    "path": "papers/23/04/2304.10503.json",
    "total_tokens": 947,
    "translated_title": "大数据性能优化的自主架构",
    "translated_abstract": "基于Apache Spark和Hadoop开发的大数据软件栈已成为许多企业的重要任务。Spark和Hadoop作业的性能取决于许多配置设置。手动调整是昂贵且易碎的。过去已经努力开发在线和离线自动调优方法，使大数据栈不再依赖于手动调优。然而，这些方法只能在小数据集上进行非常简单的单用户工作负载，合理性能优化方面贡献有限。本文提出了KERMIT - 大数据自主架构系统，能够自动调优Apache Spark和Hadoop，并实现比人工管理员的经验优化效果快30%，与执行调优参数空间的穷举搜索的性能优化方法相比，可实现高达92%的速度提升。KERMIT能够高达99%的准确率检测重要的工作负载变化，并预测未来工作负载类型的准确率高达96%。",
    "tldr": "本文提出了KERMIT，一种大数据自主架构系统。KERMIT能够自动调优Apache Spark和Hadoop，并在人工经验优化上达到快30%的速度提升，与穷举搜索的性能优化方法相比快92%。KERMIT能够高达99%的准确率检测重要的工作负载变化，并预测未来工作负载类型的准确率高达96%。",
    "en_tdlr": "This paper proposes KERMIT, an autonomic architecture system for big data, which can automatically tune Apache Spark and Hadoop with a 30% faster speed compared to human administrator's experience optimization and up to 92% faster than the exhaustive search method. KERMIT can detect important workload changes with up to 99% accuracy, and predict the future workload types with up to 96% accuracy."
}