{
    "title": "PEGA: Personality-Guided Preference Aggregator for Ephemeral Group Recommendation. (arXiv:2304.08851v1 [cs.IR])",
    "abstract": "Recently, making recommendations for ephemeral groups which contain dynamic users and few historic interactions have received an increasing number of attention. The main challenge of ephemeral group recommender is how to aggregate individual preferences to represent the group's overall preference. Score aggregation and preference aggregation are two commonly-used methods that adopt hand-craft predefined strategies and data-driven strategies, respectively. However, they neglect to take into account the importance of the individual inherent factors such as personality in the group. In addition, they fail to work well due to a small number of interactive records. To address these issues, we propose a Personality-Guided Preference Aggregator (PEGA) for ephemeral group recommendation. Concretely, we first adopt hyper-rectangle to define the concept of Group Personality. We then use the personality attention mechanism to aggregate group preferences. The role of personality in our approach is",
    "link": "http://arxiv.org/abs/2304.08851",
    "context": "Title: PEGA: Personality-Guided Preference Aggregator for Ephemeral Group Recommendation. (arXiv:2304.08851v1 [cs.IR])\nAbstract: Recently, making recommendations for ephemeral groups which contain dynamic users and few historic interactions have received an increasing number of attention. The main challenge of ephemeral group recommender is how to aggregate individual preferences to represent the group's overall preference. Score aggregation and preference aggregation are two commonly-used methods that adopt hand-craft predefined strategies and data-driven strategies, respectively. However, they neglect to take into account the importance of the individual inherent factors such as personality in the group. In addition, they fail to work well due to a small number of interactive records. To address these issues, we propose a Personality-Guided Preference Aggregator (PEGA) for ephemeral group recommendation. Concretely, we first adopt hyper-rectangle to define the concept of Group Personality. We then use the personality attention mechanism to aggregate group preferences. The role of personality in our approach is",
    "path": "papers/23/04/2304.08851.json",
    "total_tokens": 942,
    "tldr": "本研究提出了一种基于个性化引导的瞬时群体推荐偏好聚合器(PEGA)，以解决它们无法很好地发挥作用的问题。我们采用超矩形来定义群体个性的概念，并使用个性化注意机制来聚合群体偏好。"
}