{
    "title": "Parcel3D: Shape Reconstruction from Single RGB Images for Applications in Transportation Logistics. (arXiv:2304.08994v1 [cs.CV])",
    "abstract": "We focus on enabling damage and tampering detection in logistics and tackle the problem of 3D shape reconstruction of potentially damaged parcels. As input we utilize single RGB images, which corresponds to use-cases where only simple handheld devices are available, e.g. for postmen during delivery or clients on delivery. We present a novel synthetic dataset, named Parcel3D, that is based on the Google Scanned Objects (GSO) dataset and consists of more than 13,000 images of parcels with full 3D annotations. The dataset contains intact, i.e. cuboid-shaped, parcels and damaged parcels, which were generated in simulations. We work towards detecting mishandling of parcels by presenting a novel architecture called CubeRefine R-CNN, which combines estimating a 3D bounding box with an iterative mesh refinement. We benchmark our approach on Parcel3D and an existing dataset of cuboid-shaped parcels in real-world scenarios. Our results show, that while training on Parcel3D enables transfer to th",
    "link": "http://arxiv.org/abs/2304.08994",
    "context": "Title: Parcel3D: Shape Reconstruction from Single RGB Images for Applications in Transportation Logistics. (arXiv:2304.08994v1 [cs.CV])\nAbstract: We focus on enabling damage and tampering detection in logistics and tackle the problem of 3D shape reconstruction of potentially damaged parcels. As input we utilize single RGB images, which corresponds to use-cases where only simple handheld devices are available, e.g. for postmen during delivery or clients on delivery. We present a novel synthetic dataset, named Parcel3D, that is based on the Google Scanned Objects (GSO) dataset and consists of more than 13,000 images of parcels with full 3D annotations. The dataset contains intact, i.e. cuboid-shaped, parcels and damaged parcels, which were generated in simulations. We work towards detecting mishandling of parcels by presenting a novel architecture called CubeRefine R-CNN, which combines estimating a 3D bounding box with an iterative mesh refinement. We benchmark our approach on Parcel3D and an existing dataset of cuboid-shaped parcels in real-world scenarios. Our results show, that while training on Parcel3D enables transfer to th",
    "path": "papers/23/04/2304.08994.json",
    "total_tokens": 955,
    "translated_title": "Parcel3D：面向运输物流单张RGB图像的形状重建",
    "translated_abstract": "本文旨在实现在物流领域中的损坏和篡改检测，解决了对可能受损包裹的三维形状重建问题。我们利用单个RGB图像作为输入，适用于只有简单手持设备的情况，例如邮递员在递送过程中或客户在送货时需要使用。我们提出了一个名为Parcel3D的新型合成数据集，它基于Google扫描物品（GSO）数据集，包含超过13,000个带有完整三维注释的包裹图像。该数据集包含完整的、即长方体形状、未损坏的包裹和通过模拟生成的损坏包裹。我们通过提出一种称为CubeRefine R-CNN的新型结构，将3D边界框的估计与迭代网格细化相结合，以解决包裹的任意损坏问题。我们在Parcel3D和现有立方体形状包裹的真实场景数据集上进行了基准测试。研究结果表明，使用Parcel3D来训练可以实现迁移学习。",
    "tldr": "本文提出了一个新的Parcel3D数据集来解决单张RGB图像的物流包裹形状重建问题，并且提出了一种新的算法CubeRefine R-CNN来检测包裹是否受到损坏，该算法在Parcel3D数据集上表现出很好的性能。",
    "en_tdlr": "This paper proposes a new Parcel3D dataset for the reconstruction of logistics package shapes from single RGB images, and a novel algorithm, CubeRefine R-CNN, for detecting damage to packages, which performs well on the Parcel3D dataset."
}