{
    "title": "Memento: Facilitating Effortless, Efficient, and Reliable ML Experiments. (arXiv:2304.09175v1 [cs.LG])",
    "abstract": "Running complex sets of machine learning experiments is challenging and time-consuming due to the lack of a unified framework. This leaves researchers forced to spend time implementing necessary features such as parallelization, caching, and checkpointing themselves instead of focussing on their project. To simplify the process, in this paper, we introduce Memento, a Python package that is designed to aid researchers and data scientists in the efficient management and execution of computationally intensive experiments. Memento has the capacity to streamline any experimental pipeline by providing a straightforward configuration matrix and the ability to concurrently run experiments across multiple threads. A demonstration of Memento is available at: https://wickerlab.org/publication/memento.",
    "link": "http://arxiv.org/abs/2304.09175",
    "context": "Title: Memento: Facilitating Effortless, Efficient, and Reliable ML Experiments. (arXiv:2304.09175v1 [cs.LG])\nAbstract: Running complex sets of machine learning experiments is challenging and time-consuming due to the lack of a unified framework. This leaves researchers forced to spend time implementing necessary features such as parallelization, caching, and checkpointing themselves instead of focussing on their project. To simplify the process, in this paper, we introduce Memento, a Python package that is designed to aid researchers and data scientists in the efficient management and execution of computationally intensive experiments. Memento has the capacity to streamline any experimental pipeline by providing a straightforward configuration matrix and the ability to concurrently run experiments across multiple threads. A demonstration of Memento is available at: https://wickerlab.org/publication/memento.",
    "path": "papers/23/04/2304.09175.json",
    "total_tokens": 749,
    "translated_title": "Memento: 实现机器学习实验的轻松、高效和可靠的框架",
    "translated_abstract": "由于缺乏统一框架，运行复杂的机器学习实验集非常具挑战性和耗时。这迫使研究人员自己花费时间实现必要的功能，如并行化、缓存和检查点，而不是集中精力于他们的项目。为了简化这个过程，本文介绍了 Memento，一个旨在帮助研究人员和数据科学家高效管理和执行计算密集型实验的 Python 包。Memento 通过提供一个简单明了的配置矩阵和能够同时运行多个线程的实验来优化任何实验流程。Memento 的演示可在以下网站查看：https://wickerlab.org/publication/memento。",
    "tldr": "Memento是一个Python包，旨在协助研究人员高效地管理和执行计算密集型机器学习实验。它提供了简单明了的配置矩阵和并发运行实验的能力。"
}