{
    "title": "From Words to Music: A Study of Subword Tokenization Techniques in Symbolic Music Generation. (arXiv:2304.08953v1 [cs.SD])",
    "abstract": "Subword tokenization has been widely successful in text-based natural language processing (NLP) tasks with Transformer-based models. As Transformer models become increasingly popular in symbolic music-related studies, it is imperative to investigate the efficacy of subword tokenization in the symbolic music domain. In this paper, we explore subword tokenization techniques, such as byte-pair encoding (BPE), in symbolic music generation and its impact on the overall structure of generated songs. Our experiments are based on three types of MIDI datasets: single track-melody only, multi-track with a single instrument, and multi-track and multi-instrument. We apply subword tokenization on post-musical tokenization schemes and find that it enables the generation of longer songs at the same time and improves the overall structure of the generated music in terms of objective metrics like structure indicator (SI), Pitch Class Entropy, etc. We also compare two subword tokenization methods, BPE a",
    "link": "http://arxiv.org/abs/2304.08953",
    "context": "Title: From Words to Music: A Study of Subword Tokenization Techniques in Symbolic Music Generation. (arXiv:2304.08953v1 [cs.SD])\nAbstract: Subword tokenization has been widely successful in text-based natural language processing (NLP) tasks with Transformer-based models. As Transformer models become increasingly popular in symbolic music-related studies, it is imperative to investigate the efficacy of subword tokenization in the symbolic music domain. In this paper, we explore subword tokenization techniques, such as byte-pair encoding (BPE), in symbolic music generation and its impact on the overall structure of generated songs. Our experiments are based on three types of MIDI datasets: single track-melody only, multi-track with a single instrument, and multi-track and multi-instrument. We apply subword tokenization on post-musical tokenization schemes and find that it enables the generation of longer songs at the same time and improves the overall structure of the generated music in terms of objective metrics like structure indicator (SI), Pitch Class Entropy, etc. We also compare two subword tokenization methods, BPE a",
    "path": "papers/23/04/2304.08953.json",
    "total_tokens": 921,
    "translated_title": "从单词到音乐：符号音乐生成中的子词分词技术研究",
    "translated_abstract": "子词分词在基于Transformer模型的自然语言处理方面已经得到广泛应用。随着Transformer模型在符号音乐领域的应用越来越普及，探究子词分词在符号音乐领域的有效性变得至关重要。本文探讨了符号音乐生成中的子词分词技术（如字节对编码BPE）及其对所生成歌曲整体结构的影响。我们的实验基于三种MIDI数据集：单音轨旋律、多轨单乐器和多轨多乐器。我们在音乐标记化之后应用子词分词方案，并发现它可以在相同时间内生成更长的歌曲，并且在结构指标（SI）、音高级别信息熵等客观指标方面改善了生成的音乐整体结构。我们还比较了两种子词分词方法，BPE和一种基于音高的方法。本文的实验结果表明，BPE方法在符号音乐生成中可行且有效。",
    "tldr": "本文研究了符号音乐生成中的子词分词技术在生成更长、更具结构的音乐方面的有效性。实验结果表明BPE方法在符号音乐生成中可行且有效。"
}