{
    "title": "ChatGPT: Applications, Opportunities, and Threats. (arXiv:2304.09103v1 [cs.CY])",
    "abstract": "Developed by OpenAI, ChatGPT (Conditional Generative Pre-trained Transformer) is an artificial intelligence technology that is fine-tuned using supervised machine learning and reinforcement learning techniques, allowing a computer to generate natural language conversation fully autonomously. ChatGPT is built on the transformer architecture and trained on millions of conversations from various sources. The system combines the power of pre-trained deep learning models with a programmability layer to provide a strong base for generating natural language conversations. In this study, after reviewing the existing literature, we examine the applications, opportunities, and threats of ChatGPT in 10 main domains, providing detailed examples for the business and industry as well as education. We also conducted an experimental study, checking the effectiveness and comparing the performances of GPT-3.5 and GPT-4, and found that the latter performs significantly better. Despite its exceptional abi",
    "link": "http://arxiv.org/abs/2304.09103",
    "context": "Title: ChatGPT: Applications, Opportunities, and Threats. (arXiv:2304.09103v1 [cs.CY])\nAbstract: Developed by OpenAI, ChatGPT (Conditional Generative Pre-trained Transformer) is an artificial intelligence technology that is fine-tuned using supervised machine learning and reinforcement learning techniques, allowing a computer to generate natural language conversation fully autonomously. ChatGPT is built on the transformer architecture and trained on millions of conversations from various sources. The system combines the power of pre-trained deep learning models with a programmability layer to provide a strong base for generating natural language conversations. In this study, after reviewing the existing literature, we examine the applications, opportunities, and threats of ChatGPT in 10 main domains, providing detailed examples for the business and industry as well as education. We also conducted an experimental study, checking the effectiveness and comparing the performances of GPT-3.5 and GPT-4, and found that the latter performs significantly better. Despite its exceptional abi",
    "path": "papers/23/04/2304.09103.json",
    "total_tokens": 860,
    "translated_title": "ChatGPT: 应用、机会和威胁",
    "translated_abstract": "ChatGPT(条件生成的预训练Transformer)是由OpenAI开发的一种人工智能技术，使用了监督式机器学习和增强式学习技术进行微调，使得计算机可以全自动地生成自然语言对话。ChatGPT基于Transformer架构，并在各种来源的数百万个对话上进行训练。该系统结合了预训练深度学习模型的能力与可编程层，提供了一个生成自然语言对话的强大基础。在本研究中，通过评估现有文献，我们探讨了ChatGPT在10个主要领域中的应用、机会和威胁，并提供了详细的例子，包括商业和工业，以及教育。我们还进行了实验研究，检查了GPT-3.5和GPT-4的有效性和性能，并发现后者表现优异。",
    "tldr": "ChatGPT是OpenAI开发的一种人工智能技术，可以全自动地生成自然语言对话。本研究探讨了ChatGPT在10个领域的应用、机会和威胁，同时展示了GPT-4的巨大优势。"
}