{
    "title": "Breast cancer detection using deep learning. (arXiv:2304.10386v1 [cs.CV])",
    "abstract": "Objective: This paper proposes a deep learning model for breast cancer detection from reconstructed images of microwave imaging scan data and aims to improve the accuracy and efficiency of breast tumor detection, which could have a significant impact on breast cancer diagnosis and treatment. Methods: Our framework consists of different convolutional neural network (CNN) architectures for feature extraction and a region-based CNN for tumor detection. We use 7 different architectures: DenseNet201, ResNet50, InceptionV3, InceptionResNetV3, MobileNetV2, NASNetMobile and NASNetLarge and compare its performance to find the best architecture out of the seven. An experimental dataset of MRI-derived breast phantoms was used. Results: NASNetLarge is the best architecture which can be used for the CNN model with accuracy of 88.41% and loss of 27.82%. Given that the model's AUC is 0.786, it can be concluded that it is suitable for use in its present form, while it could be improved upon and traine",
    "link": "http://arxiv.org/abs/2304.10386",
    "context": "Title: Breast cancer detection using deep learning. (arXiv:2304.10386v1 [cs.CV])\nAbstract: Objective: This paper proposes a deep learning model for breast cancer detection from reconstructed images of microwave imaging scan data and aims to improve the accuracy and efficiency of breast tumor detection, which could have a significant impact on breast cancer diagnosis and treatment. Methods: Our framework consists of different convolutional neural network (CNN) architectures for feature extraction and a region-based CNN for tumor detection. We use 7 different architectures: DenseNet201, ResNet50, InceptionV3, InceptionResNetV3, MobileNetV2, NASNetMobile and NASNetLarge and compare its performance to find the best architecture out of the seven. An experimental dataset of MRI-derived breast phantoms was used. Results: NASNetLarge is the best architecture which can be used for the CNN model with accuracy of 88.41% and loss of 27.82%. Given that the model's AUC is 0.786, it can be concluded that it is suitable for use in its present form, while it could be improved upon and traine",
    "path": "papers/23/04/2304.10386.json",
    "total_tokens": 871,
    "translated_abstract": "本论文提出了一种基于深度学习模型利用微波成像扫描数据的重建图像进行乳腺癌检测的方法，旨在提高乳腺肿瘤检测的准确性和效率，这对乳腺癌的诊断和治疗具有重要意义。该方法采用了不同的卷积神经网络（CNN）架构进行特征提取，并采用基于区域的CNN进行肿瘤检测，并使用7种不同的CNN架构进行比较，最终选择其中一个性能最佳的架构。实验数据集采用了基于MRI的乳腺模型。",
    "tldr": "本论文提出了一种基于深度学习的方法，通过重建的微波成像扫描数据图像进行乳腺癌检测，最终选择出NASNetLarge作为CNN模型的最佳架构，该方法能够提高乳腺肿瘤检测的准确性和效率，对乳腺癌的诊断和治疗具有重要意义。",
    "en_tdlr": "This paper proposes a deep learning method for breast cancer detection using reconstructed microwave imaging scan data, selecting NASNetLarge as the best architecture for the CNN model. The method improves the accuracy and efficiency of breast tumor detection, which is of great importance for breast cancer diagnosis and treatment."
}