{
    "title": "Enabling A Network AI Gym for Autonomous Cyber Agents. (arXiv:2304.01366v1 [cs.AI])",
    "abstract": "This work aims to enable autonomous agents for network cyber operations (CyOps) by applying reinforcement and deep reinforcement learning (RL/DRL). The required RL training environment is particularly challenging, as it must balance the need for high-fidelity, best achieved through real network emulation, with the need for running large numbers of training episodes, best achieved using simulation. A unified training environment, namely the Cyber Gym for Intelligent Learning (CyGIL) is developed where an emulated CyGIL-E automatically generates a simulated CyGIL-S. From preliminary experimental results, CyGIL-S is capable to train agents in minutes compared with the days required in CyGIL-E. The agents trained in CyGIL-S are transferrable directly to CyGIL-E showing full decision proficiency in the emulated \"real\" network. Enabling offline RL, the CyGIL solution presents a promising direction towards sim-to-real for leveraging RL agents in real-world cyber networks.",
    "link": "http://arxiv.org/abs/2304.01366",
    "context": "Title: Enabling A Network AI Gym for Autonomous Cyber Agents. (arXiv:2304.01366v1 [cs.AI])\nAbstract: This work aims to enable autonomous agents for network cyber operations (CyOps) by applying reinforcement and deep reinforcement learning (RL/DRL). The required RL training environment is particularly challenging, as it must balance the need for high-fidelity, best achieved through real network emulation, with the need for running large numbers of training episodes, best achieved using simulation. A unified training environment, namely the Cyber Gym for Intelligent Learning (CyGIL) is developed where an emulated CyGIL-E automatically generates a simulated CyGIL-S. From preliminary experimental results, CyGIL-S is capable to train agents in minutes compared with the days required in CyGIL-E. The agents trained in CyGIL-S are transferrable directly to CyGIL-E showing full decision proficiency in the emulated \"real\" network. Enabling offline RL, the CyGIL solution presents a promising direction towards sim-to-real for leveraging RL agents in real-world cyber networks.",
    "path": "papers/23/04/2304.01366.json",
    "total_tokens": 953,
    "translated_title": "实现网络AI Gym，用于自主网络安全操作",
    "translated_abstract": "本文旨在实现应用强化学习和深度强化学习（RL/DRL）的网络安全操作（CyOps）自主代理。所需的RL训练环境特别具有挑战性，因为它必须平衡需要高保真度的真实网络仿真和运行大量训练周期的需求，最好使用模拟器。开发了一个统一的训练环境，即智能学习的网络安全健身房(CyGIL)，其中模拟的CyGIL-S是由模拟的CyGIL-E自动生成的。从初步实验结果来看，CyGIL-S能够在几分钟内训练代理，而在CyGIL-E中需要数天。在CyGIL-S中训练的代理可以直接转移到CyGIL-E，显示了在模拟的“真实”网络中的完全决策组织能力。通过实现离线RL，CyGIL解决方案为利用RL代理在真实世界的网络中提供了一个有前途的方向。",
    "tldr": "本文开发了一个统一的训练环境CyGIL，允许网络安全操作自主代理训练。该环境通过对于真实网络的仿真与虚拟环境下大量训练周期的平衡，成功短时间内训练出了全面性的决策能力，为实现真实世界网络安全的RL代理提供有前途的方向。",
    "en_tdlr": "This work presents a unified training environment, CyGIL, that enables autonomous agents for network cyber operations to be trained through a balance between real network emulation and simulation. The agents trained in this environment have demonstrated full decision proficiency and the solution presents a promising direction towards sim-to-real for leveraging RL agents in real-world cyber networks."
}