{
    "title": "A Learnheuristic Approach to A Constrained Multi-Objective Portfolio Optimisation Problem. (arXiv:2304.06675v1 [cs.LG])",
    "abstract": "Multi-objective portfolio optimisation is a critical problem researched across various fields of study as it achieves the objective of maximising the expected return while minimising the risk of a given portfolio at the same time. However, many studies fail to include realistic constraints in the model, which limits practical trading strategies. This study introduces realistic constraints, such as transaction and holding costs, into an optimisation model. Due to the non-convex nature of this problem, metaheuristic algorithms, such as NSGA-II, R-NSGA-II, NSGA-III and U-NSGA-III, will play a vital role in solving the problem. Furthermore, a learnheuristic approach is taken as surrogate models enhance the metaheuristics employed. These algorithms are then compared to the baseline metaheuristic algorithms, which solve a constrained, multi-objective optimisation problem without using learnheuristics. The results of this study show that, despite taking significantly longer to run to completi",
    "link": "http://arxiv.org/abs/2304.06675",
    "context": "Title: A Learnheuristic Approach to A Constrained Multi-Objective Portfolio Optimisation Problem. (arXiv:2304.06675v1 [cs.LG])\nAbstract: Multi-objective portfolio optimisation is a critical problem researched across various fields of study as it achieves the objective of maximising the expected return while minimising the risk of a given portfolio at the same time. However, many studies fail to include realistic constraints in the model, which limits practical trading strategies. This study introduces realistic constraints, such as transaction and holding costs, into an optimisation model. Due to the non-convex nature of this problem, metaheuristic algorithms, such as NSGA-II, R-NSGA-II, NSGA-III and U-NSGA-III, will play a vital role in solving the problem. Furthermore, a learnheuristic approach is taken as surrogate models enhance the metaheuristics employed. These algorithms are then compared to the baseline metaheuristic algorithms, which solve a constrained, multi-objective optimisation problem without using learnheuristics. The results of this study show that, despite taking significantly longer to run to completi",
    "path": "papers/23/04/2304.06675.json",
    "total_tokens": 934,
    "translated_title": "一种基于学习启发式算法的约束多目标投资组合优化问题的探究",
    "translated_abstract": "多目标投资组合优化问题是一个重要的研究课题，通过在最大化预期回报的同时最小化给定投资组合的风险来实现目标。然而，许多研究未将现实约束因素包含在模型中，这限制了实际交易策略。本研究在优化模型中引入了现实约束，例如交易成本和持有成本。由于这个问题的非凸性质，元启发式算法，例如NSGA-II、R-NSGA-II、NSGA-III和U-NSGA-III，在解决问题时发挥着至关重要的作用。此外，采用学习启发式方法，利用代理模型来增强其元启发式算法。然后将这些算法与基线元启发式算法进行比较，基线元启发式算法解决了一个带约束的多目标优化问题，而不使用学习启发式算法。本研究的结果表明，虽然运行时间比较长，但学习启发式算法的元启发式算法比基准算法在目标函数上表现更好。",
    "tldr": "本文研究了约束多目标投资组合优化问题，引入现实约束，采用学习启发式算法提高了元启发式算法的性能，在目标函数上表现更好。",
    "en_tdlr": "This paper investigates the constrained multi-objective portfolio optimization problem, introduces realistic constraints, and improves the performance of metaheuristic algorithms using a learnheuristic approach, outperforming the baseline algorithm in the objective function."
}