{
    "title": "ConvBLS: An Effective and Efficient Incremental Convolutional Broad Learning System for Image Classification. (arXiv:2304.00219v1 [cs.LG])",
    "abstract": "Deep learning generally suffers from enormous computational resources and time-consuming training processes. Broad Learning System (BLS) and its convolutional variants have been proposed to mitigate these issues and have achieved superb performance in image classification. However, the existing convolutional-based broad learning system (C-BLS) either lacks an efficient training method and incremental learning capability or suffers from poor performance. To this end, we propose a convolutional broad learning system (ConvBLS) based on the spherical K-means (SKM) algorithm and two-stage multi-scale (TSMS) feature fusion, which consists of the convolutional feature (CF) layer, convolutional enhancement (CE) layer, TSMS feature fusion layer, and output layer. First, unlike the current C-BLS, the simple yet efficient SKM algorithm is utilized to learn the weights of CF layers. Compared with random filters, the SKM algorithm makes the CF layer learn more comprehensive spatial features. Second",
    "link": "http://arxiv.org/abs/2304.00219",
    "context": "Title: ConvBLS: An Effective and Efficient Incremental Convolutional Broad Learning System for Image Classification. (arXiv:2304.00219v1 [cs.LG])\nAbstract: Deep learning generally suffers from enormous computational resources and time-consuming training processes. Broad Learning System (BLS) and its convolutional variants have been proposed to mitigate these issues and have achieved superb performance in image classification. However, the existing convolutional-based broad learning system (C-BLS) either lacks an efficient training method and incremental learning capability or suffers from poor performance. To this end, we propose a convolutional broad learning system (ConvBLS) based on the spherical K-means (SKM) algorithm and two-stage multi-scale (TSMS) feature fusion, which consists of the convolutional feature (CF) layer, convolutional enhancement (CE) layer, TSMS feature fusion layer, and output layer. First, unlike the current C-BLS, the simple yet efficient SKM algorithm is utilized to learn the weights of CF layers. Compared with random filters, the SKM algorithm makes the CF layer learn more comprehensive spatial features. Second",
    "path": "papers/23/04/2304.00219.json",
    "total_tokens": 1216,
    "translated_title": "ConvBLS：一种高效的、可增量卷积广义学习系统用于图像分类",
    "translated_abstract": "深度学习通常受到巨大计算资源和耗时培训过程的困扰。为缓解这些问题，提出了广义学习系统（BLS）及其卷积变体，并在图像分类方面取得了出色的表现。然而，现有的基于卷积的广义学习系统（C-BLS）要么缺乏高效的训练方法和增量学习能力，要么表现不佳。为此，我们提出了一种基于球形K-means（SKM）算法和两阶段多尺度（TSMS）特征融合的卷积广义学习系统（ConvBLS），包括卷积特征（CF）层、卷积增强（CE）层、TSMS特征融合层和输出层。与现有的C-BLS不同，使用简单而高效的SKM算法来学习CF层的权重。与随机滤波器相比，SKM算法使CF层学习更全面的空间特征。引入CE层通过max-pooling操作合并CF层的激活图来增强深度模型的区分能力。提出了TSMS特征融合来集成多尺度卷积特征，以捕获更丰富的特征表示。最终，输出层采用softmax激活函数获得分类结果。在三个基准数据集上的实验证明，ConvBLS在需要更少的培训时间和计算资源的情况下，可以达到与优秀的深度学习模型相当甚至优秀的性能。",
    "tldr": "ConvBLS是一种卷积广义学习系统，使用球形K-means算法、卷积增强层和多尺度特征融合层可以达到与先进深度学习模型相当甚至更好的性能，在需要更少时间和计算资源的情况下完成训练和预测。",
    "en_tdlr": "ConvBLS is a convolutional broad learning system that utilizes a spherical K-means algorithm, convolutional enhancement layer, and multi-scale feature fusion layer to achieve comparable or even superior performance to state-of-the-art deep learning models while requiring significantly less training time and computational resources."
}