{
    "title": "China and the U.S. produce more impactful AI research when collaborating together. (arXiv:2304.11123v1 [cs.CY])",
    "abstract": "Artificial Intelligence (AI) has become a disruptive technology, promising to grant a significant economic and strategic advantage to the nations that harness its power. China, with its recent push towards AI adoption, is challenging the U.S.'s position as the global leader in this field. Given AI's massive potential, as well as the fierce geopolitical tensions between the two nations, a number of policies have been put in place that discourage AI scientists from migrating to, or collaborating with, the other country. However, the extents of such brain drain and cross-border collaboration are not fully understood. Here, we analyze a dataset of over 350,000 AI scientists and 5,000,000 AI papers. We find that, since the year 2000, China and the U.S. have been leading the field in terms of impact, novelty, productivity, and workforce. Most AI scientists who migrate to China come from the U.S., and most who migrate to the U.S. come from China, highlighting a notable brain drain in both dir",
    "link": "http://arxiv.org/abs/2304.11123",
    "context": "Title: China and the U.S. produce more impactful AI research when collaborating together. (arXiv:2304.11123v1 [cs.CY])\nAbstract: Artificial Intelligence (AI) has become a disruptive technology, promising to grant a significant economic and strategic advantage to the nations that harness its power. China, with its recent push towards AI adoption, is challenging the U.S.'s position as the global leader in this field. Given AI's massive potential, as well as the fierce geopolitical tensions between the two nations, a number of policies have been put in place that discourage AI scientists from migrating to, or collaborating with, the other country. However, the extents of such brain drain and cross-border collaboration are not fully understood. Here, we analyze a dataset of over 350,000 AI scientists and 5,000,000 AI papers. We find that, since the year 2000, China and the U.S. have been leading the field in terms of impact, novelty, productivity, and workforce. Most AI scientists who migrate to China come from the U.S., and most who migrate to the U.S. come from China, highlighting a notable brain drain in both dir",
    "path": "papers/23/04/2304.11123.json",
    "total_tokens": 972,
    "translated_title": "中美合作时，中国和美国在人工智能领域能够产生更大的影响力",
    "translated_abstract": "人工智能已经成为颠覆性技术，有望为掌握其力量的国家带来显著的经济和战略优势。最近，中国推动人工智能技术的采用，正在挑战美国在这一领域的全球领导地位。考虑到人工智能的巨大潜力，以及两国之间激烈的地缘政治紧张局势，已经制定了一些政策，以防止人工智能科学家移民到对方国家或与之合作。然而，这种人才流失和跨境合作的程度还没有被完全了解。在此，我们分析了超过350,000名人工智能科学家和5,000,000篇人工智能文献的数据集。我们发现自2000年以来，中国和美国在影响力、创新性、生产力和劳动力方面一直处于领先地位。大多数移民到中国的人工智能科学家来自美国，而移民到美国的人工智能科学家来自中国，凸显出明显的人才流失现象。",
    "tldr": "中国和美国在人工智能领域合作能产生更大影响力，最近数据显示两国自2000年来一直处于领导地位，而大多数人才流失在两国之间。"
}