{
    "title": "E Pluribus Unum: Guidelines on Multi-Objective Evaluation of Recommender Systems. (arXiv:2304.10621v1 [cs.IR])",
    "abstract": "Recommender Systems today are still mostly evaluated in terms of accuracy, with other aspects beyond the immediate relevance of recommendations, such as diversity, long-term user retention and fairness, often taking a back seat. Moreover, reconciling multiple performance perspectives is by definition indeterminate, presenting a stumbling block to those in the pursuit of rounded evaluation of Recommender Systems. EvalRS 2022 -- a data challenge designed around Multi-Objective Evaluation -- was a first practical endeavour, providing many insights into the requirements and challenges of balancing multiple objectives in evaluation. In this work, we reflect on EvalRS 2022 and expound upon crucial learnings to formulate a first-principles approach toward Multi-Objective model selection, and outline a set of guidelines for carrying out a Multi-Objective Evaluation challenge, with potential applicability to the problem of rounded evaluation of competing models in real-world deployments.",
    "link": "http://arxiv.org/abs/2304.10621",
    "context": "Title: E Pluribus Unum: Guidelines on Multi-Objective Evaluation of Recommender Systems. (arXiv:2304.10621v1 [cs.IR])\nAbstract: Recommender Systems today are still mostly evaluated in terms of accuracy, with other aspects beyond the immediate relevance of recommendations, such as diversity, long-term user retention and fairness, often taking a back seat. Moreover, reconciling multiple performance perspectives is by definition indeterminate, presenting a stumbling block to those in the pursuit of rounded evaluation of Recommender Systems. EvalRS 2022 -- a data challenge designed around Multi-Objective Evaluation -- was a first practical endeavour, providing many insights into the requirements and challenges of balancing multiple objectives in evaluation. In this work, we reflect on EvalRS 2022 and expound upon crucial learnings to formulate a first-principles approach toward Multi-Objective model selection, and outline a set of guidelines for carrying out a Multi-Objective Evaluation challenge, with potential applicability to the problem of rounded evaluation of competing models in real-world deployments.",
    "path": "papers/23/04/2304.10621.json",
    "total_tokens": 846,
    "translated_title": "E Pluribus Unum：关于推荐系统多目标评估的指南",
    "translated_abstract": "目前，推荐系统的评估主要还是以准确性为主，其他方面的因素，比如多样性、长期用户留存和公平性，往往被忽略。而且，协调多个绩效指标本质上是不确定的，这给寻求全面评估推荐系统的人造成了难题。EvalRS 2022是第一个实践性的数据挑战活动，围绕多目标评估而设计，提供了许多对于平衡多个绩效指标的要求和挑战的洞见。本文回顾了EvalRS 2022，并阐述了重要的理解，制定了一种基于第一原理的多目标模型选择方法，并概述了进行多目标评估挑战的一组指南，具有潜在的适用性，能够解决实际部署中对竞争模型进行全面评估的问题。",
    "tldr": "本论文介绍了一种基于第一原理的多目标模型选择方法，并提出了一组指南，旨在解决推荐系统多目标评估中的平衡多个绩效指标的挑战。",
    "en_tdlr": "This paper introduces a first-principles approach toward Multi-Objective model selection, and outlines a set of guidelines to address the challenge of balancing multiple performance perspectives in the evaluation of recommender systems."
}