{
    "title": "An Embedding-based Approach to Inconsistency-tolerant Reasoning with Inconsistent Ontologies. (arXiv:2304.01664v1 [cs.AI])",
    "abstract": "Inconsistency handling is an important issue in knowledge management. Especially in ontology engineering, logical inconsistencies may occur during ontology construction. A natural way to reason with an inconsistent ontology is to utilize the maximal consistent subsets of the ontology. However, previous studies on selecting maximum consistent subsets have rarely considered the semantics of the axioms, which may result in irrational inference. In this paper, we propose a novel approach to reasoning with inconsistent ontologies in description logics based on the embeddings of axioms. We first give a method for turning axioms into distributed semantic vectors to compute the semantic connections between the axioms. We then define an embedding-based method for selecting the maximum consistent subsets and use it to define an inconsistency-tolerant inference relation. We show the rationality of our inference relation by considering some logical properties. Finally, we conduct experiments on se",
    "link": "http://arxiv.org/abs/2304.01664",
    "context": "Title: An Embedding-based Approach to Inconsistency-tolerant Reasoning with Inconsistent Ontologies. (arXiv:2304.01664v1 [cs.AI])\nAbstract: Inconsistency handling is an important issue in knowledge management. Especially in ontology engineering, logical inconsistencies may occur during ontology construction. A natural way to reason with an inconsistent ontology is to utilize the maximal consistent subsets of the ontology. However, previous studies on selecting maximum consistent subsets have rarely considered the semantics of the axioms, which may result in irrational inference. In this paper, we propose a novel approach to reasoning with inconsistent ontologies in description logics based on the embeddings of axioms. We first give a method for turning axioms into distributed semantic vectors to compute the semantic connections between the axioms. We then define an embedding-based method for selecting the maximum consistent subsets and use it to define an inconsistency-tolerant inference relation. We show the rationality of our inference relation by considering some logical properties. Finally, we conduct experiments on se",
    "path": "papers/23/04/2304.01664.json",
    "total_tokens": 764,
    "translated_title": "一种基于嵌入的处理具有不一致性本体的容错推理方法",
    "translated_abstract": "处理不一致性是知识管理中的重要问题，特别是在本体工程中，本体构建过程中可能出现逻辑不一致性。本文提出了一种基于描述逻辑的嵌入方法，通过将公理转化为分布式语义向量计算公理之间的语义关联，进而定义了一种基于嵌入的选择最大一致子集的方法，并将其用于定义容错推理关系。通过考虑某些逻辑属性，证明了推理关系的合理性。最后，在几个数据集上验证了实验效果。",
    "tldr": "本文提出了一种基于嵌入的方法来处理具有不一致性本体的容错推理问题，这种方法通过语义向量计算公理之间的关联，定义了选择最大一致子集的方法，并证明了推理关系的合理性。",
    "en_tdlr": "This paper proposes an embedding-based approach to inconsistency-tolerant reasoning with inconsistent ontologies in description logics by computing semantic connections between axioms using distributed semantic vectors, defining a method for selecting maximum consistent subsets, and proving the rationality of the inference relation."
}