{
    "title": "Fast emulation of cosmological density fields based on dimensionality reduction and supervised machine-learning. (arXiv:2304.06099v1 [astro-ph.CO])",
    "abstract": "N-body simulations are the most powerful method to study the non-linear evolution of large-scale structure. However, they require large amounts of computational resources, making unfeasible their direct adoption in scenarios that require broad explorations of parameter spaces. In this work, we show that it is possible to perform fast dark matter density field emulations with competitive accuracy using simple machine-learning approaches. We build an emulator based on dimensionality reduction and machine learning regression combining simple Principal Component Analysis and supervised learning methods. For the estimations with a single free parameter, we train on the dark matter density parameter, $\\Omega_m$, while for emulations with two free parameters, we train on a range of $\\Omega_m$ and redshift. The method first adopts a projection of a grid of simulations on a given basis; then, a machine learning regression is trained on this projected grid. Finally, new density cubes for differe",
    "link": "http://arxiv.org/abs/2304.06099",
    "context": "Title: Fast emulation of cosmological density fields based on dimensionality reduction and supervised machine-learning. (arXiv:2304.06099v1 [astro-ph.CO])\nAbstract: N-body simulations are the most powerful method to study the non-linear evolution of large-scale structure. However, they require large amounts of computational resources, making unfeasible their direct adoption in scenarios that require broad explorations of parameter spaces. In this work, we show that it is possible to perform fast dark matter density field emulations with competitive accuracy using simple machine-learning approaches. We build an emulator based on dimensionality reduction and machine learning regression combining simple Principal Component Analysis and supervised learning methods. For the estimations with a single free parameter, we train on the dark matter density parameter, $\\Omega_m$, while for emulations with two free parameters, we train on a range of $\\Omega_m$ and redshift. The method first adopts a projection of a grid of simulations on a given basis; then, a machine learning regression is trained on this projected grid. Finally, new density cubes for differe",
    "path": "papers/23/04/2304.06099.json",
    "total_tokens": 891,
    "translated_title": "基于降维和监督式机器学习的宇宙密度场快速仿真",
    "translated_abstract": "N-body模拟是研究大尺度结构非线性演化的最有力方法。然而，它们需要大量计算资源，在需要广泛探索参数空间的情况下直接采用是不可行的。本研究表明，可以使用简单的机器学习方法进行快速的暗物质密度场仿真，并具有竞争性的精度。我们基于降维和机器学习回归构建了一个模拟器，结合简单的主成分分析和监督式学习方法。针对单个自由参数的估计，我们训练了暗物质密度参数$\\Omega_m$，而对于具有两个自由参数的仿真，我们训练了一系列$\\Omega_m$和红移。该方法首先采用给定基底的模拟网格的投影；然后，在该投影网格上进行机器学习回归的训练。最后，针对不同参数的新密度立方体进行预测。",
    "tldr": "本研究使用简单的机器学习方法，通过降维和监督式回归，对暗物质密度场进行快速而准确的仿真，从而有效地应对复杂参数空间的挑战。",
    "en_tdlr": "This paper demonstrates the feasibility of using simple machine learning approaches for fast and accurate emulation of dark matter density fields based on dimensionality reduction and supervised regression. This method can effectively tackle the challenges posed by the complex parameter space."
}