{
    "title": "Segment Anything in Non-Euclidean Domains: Challenges and Opportunities. (arXiv:2304.11595v1 [cs.CV])",
    "abstract": "The recent work known as Segment Anything (SA) has made significant strides in pushing the boundaries of semantic segmentation into the era of foundation models. The impact of SA has sparked extremely active discussions and ushered in an encouraging new wave of developing foundation models for the diverse tasks in the Euclidean domain, such as object detection and image inpainting. Despite the promising advances led by SA, the concept has yet to be extended to the non-Euclidean graph domain. In this paper, we explore a novel Segment Non-Euclidean Anything (SNA) paradigm that strives to develop foundation models that can handle the diverse range of graph data within the non-Euclidean domain, seeking to expand the scope of SA and lay the groundwork for future research in this direction. To achieve this goal, we begin by discussing the recent achievements in foundation models associated with SA. We then shed light on the unique challenges that arise when applying the SA concept to graph a",
    "link": "http://arxiv.org/abs/2304.11595",
    "context": "Title: Segment Anything in Non-Euclidean Domains: Challenges and Opportunities. (arXiv:2304.11595v1 [cs.CV])\nAbstract: The recent work known as Segment Anything (SA) has made significant strides in pushing the boundaries of semantic segmentation into the era of foundation models. The impact of SA has sparked extremely active discussions and ushered in an encouraging new wave of developing foundation models for the diverse tasks in the Euclidean domain, such as object detection and image inpainting. Despite the promising advances led by SA, the concept has yet to be extended to the non-Euclidean graph domain. In this paper, we explore a novel Segment Non-Euclidean Anything (SNA) paradigm that strives to develop foundation models that can handle the diverse range of graph data within the non-Euclidean domain, seeking to expand the scope of SA and lay the groundwork for future research in this direction. To achieve this goal, we begin by discussing the recent achievements in foundation models associated with SA. We then shed light on the unique challenges that arise when applying the SA concept to graph a",
    "path": "papers/23/04/2304.11595.json",
    "total_tokens": 907,
    "translated_title": "非欧几里得域中的分割问题：挑战与机遇",
    "translated_abstract": "最近的一项工作称为Segment Anything（SA）在将语义分割的边界推向基础模型时取得了重大进展。SA的影响引发了极为活跃的讨论，并引领了一波新的发展浪潮，用于欧几里得域中的各种任务，如物体检测和图像修复。尽管SA所带来的进展很有前途，但该概念尚未扩展到非欧几里得图形领域。在本文中，我们探索了一种称为Segment Non-Euclidean Anything（SNA）的新范式，该范式旨在开发能够处理非欧几里得域中各种图形数据的基础模型，试图扩大SA的范围并为未来的研究奠定基础。为了实现这一目标，我们首先讨论了与SA相关的基础模型的最新成就。然后，我们着眼于将SA概念应用于图形数据时出现的独特挑战。",
    "tldr": "本文探讨了一种新的Segment Non-Euclidean Anything（SNA）方法，旨在扩大语义分割的范围，导致更多的基础模型用于非欧几里得域中的分割任务。"
}