{
    "title": "ChatGPT-4 Outperforms Experts and Crowd Workers in Annotating Political Twitter Messages with Zero-Shot Learning. (arXiv:2304.06588v1 [cs.CL])",
    "abstract": "This paper assesses the accuracy, reliability and bias of the Large Language Model (LLM) ChatGPT-4 on the text analysis task of classifying the political affiliation of a Twitter poster based on the content of a tweet. The LLM is compared to manual annotation by both expert classifiers and crowd workers, generally considered the gold standard for such tasks. We use Twitter messages from United States politicians during the 2020 election, providing a ground truth against which to measure accuracy. The paper finds that ChatGPT-4 has achieves higher accuracy, higher reliability, and equal or lower bias than the human classifiers. The LLM is able to correctly annotate messages that require reasoning on the basis of contextual knowledge, and inferences around the author's intentions - traditionally seen as uniquely human abilities. These findings suggest that LLM will have substantial impact on the use of textual data in the social sciences, by enabling interpretive research at a scale.",
    "link": "http://arxiv.org/abs/2304.06588",
    "context": "Title: ChatGPT-4 Outperforms Experts and Crowd Workers in Annotating Political Twitter Messages with Zero-Shot Learning. (arXiv:2304.06588v1 [cs.CL])\nAbstract: This paper assesses the accuracy, reliability and bias of the Large Language Model (LLM) ChatGPT-4 on the text analysis task of classifying the political affiliation of a Twitter poster based on the content of a tweet. The LLM is compared to manual annotation by both expert classifiers and crowd workers, generally considered the gold standard for such tasks. We use Twitter messages from United States politicians during the 2020 election, providing a ground truth against which to measure accuracy. The paper finds that ChatGPT-4 has achieves higher accuracy, higher reliability, and equal or lower bias than the human classifiers. The LLM is able to correctly annotate messages that require reasoning on the basis of contextual knowledge, and inferences around the author's intentions - traditionally seen as uniquely human abilities. These findings suggest that LLM will have substantial impact on the use of textual data in the social sciences, by enabling interpretive research at a scale.",
    "path": "papers/23/04/2304.06588.json",
    "total_tokens": 948,
    "translated_title": "ChatGPT-4在政治Twitter信息注释中通过零样本学习胜过专家和众包工作者",
    "translated_abstract": "本文评估了大型语言模型ChatGPT-4在政治相关推文注释任务中的准确性、可靠性和偏见。与专家和众包工作者标注进行比较，研究使用2020年美国选举期间的政治相关推文作为数据集，提供了可靠的准确性评测基准。实验发现，ChatGPT-4的准确性更高、可靠性更高，并且偏见相等或更低。该模型能够准确注释需要基于上下文知识进行推理和作者意向的推文，这些能力被传统上视为是人类独有的。研究结果表明，LLM在社会科学中使用文本数据进行解释性研究方面将产生巨大的影响，并使得规模化的文本数据研究成为可能。",
    "tldr": "本文评估了ChatGPT-4在政治Twitter相关推文注释任务中的表现，结果显示它在准确性、可靠性和偏见方面皆优于人类标注，尤其是它能通过零样本学习准确注释需要基于上下文知识和作者意向的推文，这将使得规模化的文本数据研究成为可能，并在社会科学的解释性研究中产生巨大影响。",
    "en_tdlr": "This paper evaluates ChatGPT-4's performance in annotating political Twitter messages with high accuracy, reliability, and lower bias than human classifiers. Its ability to accurately annotate messages using zero-shot learning for reasoning and inferring author's intentions will enable large-scale interpretive research and have significant impact in social science."
}