{
    "title": "The Economics of Partisan Gerrymandering. (arXiv:2304.09381v1 [econ.TH])",
    "abstract": "We study the problem of a partisan gerrymanderer who assigns voters to equipopulous districts so as to maximize his party's expected seat share. The designer faces both aggregate uncertainty (how many votes his party will receive) and idiosyncratic, voter-level uncertainty (which voters will vote for his party). We argue that pack-and-pair districting, where weaker districts are ``packed'' with a single type of voter, while stronger districts contain two voter types, is typically optimal for the gerrymanderer. The optimal form of pack-and-pair districting depends on the relative amounts of aggregate and idiosyncratic uncertainty. When idiosyncratic uncertainty dominates, it is optimal to pack opposing voters and pair more favorable voters; this plan resembles traditional ``packing-and-cracking.'' When aggregate uncertainty dominates, it is optimal to pack moderate voters and pair extreme voters; this ``matching slices'' plan has received some attention in the literature. Estimating the",
    "link": "http://arxiv.org/abs/2304.09381",
    "context": "Title: The Economics of Partisan Gerrymandering. (arXiv:2304.09381v1 [econ.TH])\nAbstract: We study the problem of a partisan gerrymanderer who assigns voters to equipopulous districts so as to maximize his party's expected seat share. The designer faces both aggregate uncertainty (how many votes his party will receive) and idiosyncratic, voter-level uncertainty (which voters will vote for his party). We argue that pack-and-pair districting, where weaker districts are ``packed'' with a single type of voter, while stronger districts contain two voter types, is typically optimal for the gerrymanderer. The optimal form of pack-and-pair districting depends on the relative amounts of aggregate and idiosyncratic uncertainty. When idiosyncratic uncertainty dominates, it is optimal to pack opposing voters and pair more favorable voters; this plan resembles traditional ``packing-and-cracking.'' When aggregate uncertainty dominates, it is optimal to pack moderate voters and pair extreme voters; this ``matching slices'' plan has received some attention in the literature. Estimating the",
    "path": "papers/23/04/2304.09381.json",
    "total_tokens": 968,
    "translated_title": "党派瓜分的经济学",
    "translated_abstract": "我们研究了一个党派瓜分者如何将选民分配到同样多的选区中来最大化他的党派的预期席位份额。设计师面临着两种不确定性:总体不确定性(他的党派将获得多少选票)和个别不确定性(哪些选民将投票给他的党派)。我们认为，打包和配对划分，即将较弱的选区“打包”成一个类型的选民，而强度更大的选区则包含两种选民类型，通常是对瓜分者最优的。打包和配对划分的最佳形式取决于总体和个别不确定性的相对量。当个别不确定性占主导地位时，最优的策略是将对立的选民“打包”在一起，并配对更有利的选民；这个策略类似于传统的“打包与分化”。当总体的不确定性占据主导地位时，最优策略是将温和的选民“打包”在一起，并配对极端的选民；这个“匹配切片”的计划得到了一些文献的关注。",
    "tldr": "本文研究了党派瓜分者如何将选民分配到同样多的选区中来最大化他的党派的预期席位份额。瓜分者通常使用打包和配对划分来优化结果，最佳的划分方式取决于总体和个别不确定性的相对量。"
}