{
    "title": "Efficient human-in-loop deep learning model training with iterative refinement and statistical result validation. (arXiv:2304.00990v1 [cs.CV])",
    "abstract": "Annotation and labeling of images are some of the biggest challenges in applying deep learning to medical data. Current processes are time and cost-intensive and, therefore, a limiting factor for the wide adoption of the technology. Additionally validating that measured performance improvements are significant is important to select the best model. In this paper, we demonstrate a method for creating segmentations, a necessary part of a data cleaning for ultrasound imaging machine learning pipelines. We propose a four-step method to leverage automatically generated training data and fast human visual checks to improve model accuracy while keeping the time/effort and cost low. We also showcase running experiments multiple times to allow the usage of statistical analysis. Poor quality automated ground truth data and quick visual inspections efficiently train an initial base model, which is refined using a small set of more expensive human-generated ground truth data. The method is demonst",
    "link": "http://arxiv.org/abs/2304.00990",
    "context": "Title: Efficient human-in-loop deep learning model training with iterative refinement and statistical result validation. (arXiv:2304.00990v1 [cs.CV])\nAbstract: Annotation and labeling of images are some of the biggest challenges in applying deep learning to medical data. Current processes are time and cost-intensive and, therefore, a limiting factor for the wide adoption of the technology. Additionally validating that measured performance improvements are significant is important to select the best model. In this paper, we demonstrate a method for creating segmentations, a necessary part of a data cleaning for ultrasound imaging machine learning pipelines. We propose a four-step method to leverage automatically generated training data and fast human visual checks to improve model accuracy while keeping the time/effort and cost low. We also showcase running experiments multiple times to allow the usage of statistical analysis. Poor quality automated ground truth data and quick visual inspections efficiently train an initial base model, which is refined using a small set of more expensive human-generated ground truth data. The method is demonst",
    "path": "papers/23/04/2304.00990.json",
    "total_tokens": 919,
    "translated_title": "迭代精炼和统计结果验证的高效人机交互深度学习模型训练",
    "translated_abstract": "标注和标签是深度学习在医疗数据应用中最大的挑战之一。目前的流程时间和成本都很高，因此限制了技术的广泛应用。此外，验证计量性能改进是否显著对于选择最佳模型非常重要。本文展示了一种方法，用于创建分割，这是超声成像机器学习流程数据清理的必要部分。我们提出了一个四步方法，利用自动生成的训练数据和快速的人工视觉检查，提高模型精度，同时保持时间、精力和成本低。我们还展示了多次运行实验，以允许使用统计分析。质量较差的自动地面真实数据和快速的视觉检查有效地训练了一个初始基础模型，而后用一小部分更昂贵的人工生成的地面真实数据进行精炼。本方法进行了演示，其精度和速度在人类国际标准（ISIC）数据集上得到了验证。",
    "tldr": "本文提出了一种利用自动生成的训练数据和快速的人工视觉检查，提高深度学习模型精度的方法，同时保持时间、精力和成本低，其精度和速度在人类国际标准（ISIC）数据集上得到了验证。",
    "en_tdlr": "This paper proposes a method to improve the accuracy of deep learning models using automatically generated training data and fast human visual checks, while keeping time, effort, and cost low. The method is validated on the International Skin Imaging Collaboration (ISIC) dataset."
}