{
    "title": "Retinal Vessel Segmentation via a Multi-resolution Contextual Network and Adversarial Learning. (arXiv:2304.12856v1 [eess.IV])",
    "abstract": "Timely and affordable computer-aided diagnosis of retinal diseases is pivotal in precluding blindness. Accurate retinal vessel segmentation plays an important role in disease progression and diagnosis of such vision-threatening diseases. To this end, we propose a Multi-resolution Contextual Network (MRC-Net) that addresses these issues by extracting multi-scale features to learn contextual dependencies between semantically different features and using bi-directional recurrent learning to model former-latter and latter-former dependencies. Another key idea is training in adversarial settings for foreground segmentation improvement through optimization of the region-based scores. This novel strategy boosts the performance of the segmentation network in terms of the Dice score (and correspondingly Jaccard index) while keeping the number of trainable parameters comparatively low. We have evaluated our method on three benchmark datasets, including DRIVE, STARE, and CHASE, demonstrating its ",
    "link": "http://arxiv.org/abs/2304.12856",
    "context": "Title: Retinal Vessel Segmentation via a Multi-resolution Contextual Network and Adversarial Learning. (arXiv:2304.12856v1 [eess.IV])\nAbstract: Timely and affordable computer-aided diagnosis of retinal diseases is pivotal in precluding blindness. Accurate retinal vessel segmentation plays an important role in disease progression and diagnosis of such vision-threatening diseases. To this end, we propose a Multi-resolution Contextual Network (MRC-Net) that addresses these issues by extracting multi-scale features to learn contextual dependencies between semantically different features and using bi-directional recurrent learning to model former-latter and latter-former dependencies. Another key idea is training in adversarial settings for foreground segmentation improvement through optimization of the region-based scores. This novel strategy boosts the performance of the segmentation network in terms of the Dice score (and correspondingly Jaccard index) while keeping the number of trainable parameters comparatively low. We have evaluated our method on three benchmark datasets, including DRIVE, STARE, and CHASE, demonstrating its ",
    "path": "papers/23/04/2304.12856.json",
    "total_tokens": 898,
    "translated_title": "一种多分辨率上下文网络和对抗性学习的视网膜血管分割方法",
    "translated_abstract": "快速、普惠的计算机辅助诊断对于避免失明非常关键，而准确的视网膜血管分割在这些威胁视力疾病的疾病进展和诊断中扮演着重要角色。本文提出了一种多分辨率上下文网络和对抗性学习的方法（MRC-Net）来解决这些问题，通过提取多尺度特征学习语义不同的特征间的上下文依赖关系，并使用双向循环学习来建模前后和后前依赖关系。另一个关键思想是采用对抗性训练来通过区域得分的优化提高前景分割的性能。这种新颖的策略在保持可训练参数数量较低的同时，提高了分割网络的Dice得分（以及相应的Jaccard指数）的性能。我们在包括DRIVE、STARE和CHASE在内的三个基准数据集上评估了本方法，证明了其有效性。",
    "tldr": "本文提出了一种多分辨率上下文网络和对抗性学习相结合的方法来进行准确的视网膜血管分割，该方法具有高分割性能和较少的可训练参数数量。",
    "en_tdlr": "A multi-resolution contextual network and adversarial learning method is proposed for accurate retinal vessel segmentation, which has high segmentation performance and relatively fewer trainable parameters."
}