{
    "title": "Generalized generalized linear models: Convex estimation and online bounds. (arXiv:2304.13793v1 [stat.ME])",
    "abstract": "We introduce a new computational framework for estimating parameters in generalized generalized linear models (GGLM), a class of models that extends the popular generalized linear models (GLM) to account for dependencies among observations in spatio-temporal data. The proposed approach uses a monotone operator-based variational inequality method to overcome non-convexity in parameter estimation and provide guarantees for parameter recovery. The results can be applied to GLM and GGLM, focusing on spatio-temporal models. We also present online instance-based bounds using martingale concentrations inequalities. Finally, we demonstrate the performance of the algorithm using numerical simulations and a real data example for wildfire incidents.",
    "link": "http://arxiv.org/abs/2304.13793",
    "context": "Title: Generalized generalized linear models: Convex estimation and online bounds. (arXiv:2304.13793v1 [stat.ME])\nAbstract: We introduce a new computational framework for estimating parameters in generalized generalized linear models (GGLM), a class of models that extends the popular generalized linear models (GLM) to account for dependencies among observations in spatio-temporal data. The proposed approach uses a monotone operator-based variational inequality method to overcome non-convexity in parameter estimation and provide guarantees for parameter recovery. The results can be applied to GLM and GGLM, focusing on spatio-temporal models. We also present online instance-based bounds using martingale concentrations inequalities. Finally, we demonstrate the performance of the algorithm using numerical simulations and a real data example for wildfire incidents.",
    "path": "papers/23/04/2304.13793.json",
    "total_tokens": 782,
    "translated_title": "广义广义线性模型：凸估计和在线界限",
    "translated_abstract": "我们引入了一个新的计算框架，用于估计广义广义线性模型（GGLM）中的参数。这是一类将流行的广义线性模型（GLM）扩展到考虑时空数据中观测之间依赖关系的模型。所提出的方法使用基于单调运算符的变分不等式方法来克服参数估计中的非凸性并为参数恢复提供保证。结果可以应用于GLM和GGLM，重点关注时空模型。我们还使用鞅集中不等式提供了在线实例界限。最后，我们使用数值模拟和野火事件的真实数据示例来展示算法的性能。",
    "tldr": "该论文提出了一种用于估计时间空间数据中依赖关系的广义广义线性模型（GGLM）参数的计算框架，使用单调运算符的变分不等式方法克服了参数估计中的非凸性并为参数恢复提供保证",
    "en_tdlr": "The paper presents a computational framework for estimating parameters in generalized generalized linear models (GGLM), which account for dependencies among observations in spatio-temporal data. The proposed approach overcomes non-convexity in parameter estimation using a monotone operator-based variational inequality method and provides guarantees for parameter recovery. The performance of the algorithm is demonstrated through numerical simulations and a real data example for wildfire incidents."
}