{
    "title": "Towards replacing precipitation ensemble predictions systems using machine learning. (arXiv:2304.10251v1 [physics.ao-ph])",
    "abstract": "Precipitation forecasts are less accurate compared to other meteorological fields because several key processes affecting precipitation distribution and intensity occur below the resolved scale of global weather prediction models. This requires to use higher resolution simulations. To generate an uncertainty prediction associated with the forecast, ensembles of simulations are run simultaneously. However, the computational cost is a limiting factor here. Thus, instead of generating an ensemble system from simulations there is a trend of using neural networks. Unfortunately the data for high resolution ensemble runs is not available. We propose a new approach to generating ensemble weather predictions for high-resolution precipitation without requiring high-resolution training data. The method uses generative adversarial networks to learn the complex patterns of precipitation and produce diverse and realistic precipitation fields, allowing to generate realistic precipitation ensemble me",
    "link": "http://arxiv.org/abs/2304.10251",
    "context": "Title: Towards replacing precipitation ensemble predictions systems using machine learning. (arXiv:2304.10251v1 [physics.ao-ph])\nAbstract: Precipitation forecasts are less accurate compared to other meteorological fields because several key processes affecting precipitation distribution and intensity occur below the resolved scale of global weather prediction models. This requires to use higher resolution simulations. To generate an uncertainty prediction associated with the forecast, ensembles of simulations are run simultaneously. However, the computational cost is a limiting factor here. Thus, instead of generating an ensemble system from simulations there is a trend of using neural networks. Unfortunately the data for high resolution ensemble runs is not available. We propose a new approach to generating ensemble weather predictions for high-resolution precipitation without requiring high-resolution training data. The method uses generative adversarial networks to learn the complex patterns of precipitation and produce diverse and realistic precipitation fields, allowing to generate realistic precipitation ensemble me",
    "path": "papers/23/04/2304.10251.json",
    "total_tokens": 786,
    "translated_title": "用机器学习代替降水集合预测系统",
    "translated_abstract": "与其他气象场相比，降水预测不够准确，因为影响降水分布和强度的几个关键过程发生在全球天气预报模型的可解决尺度以下。这要求使用更高分辨率的模拟。为了生成与预测相关的不确定性预测，同时运行模拟的集合。然而，计算成本是一个限制因素。因此，替代从模拟生成集合系统的趋势是使用神经网络。不幸的是，高分辨率集合运行的数据不可用。我们提出了一种新方法，可以生成高分辨率降水的集合气象预测，而不需要高分辨率训练数据。该方法使用生成对抗网络学习复杂的降水模式，并产生多样化、真实的降水场，从而产生真实的降水集合。",
    "tldr": "该论文提出了一种用生成对抗网络生成高分辨率降水集合预测的方法，避免了高分辨率训练数据的需求和计算成本的限制。"
}