{
    "title": "PALI: A Language Identification Benchmark for Perso-Arabic Scripts. (arXiv:2304.01322v1 [cs.CL])",
    "abstract": "The Perso-Arabic scripts are a family of scripts that are widely adopted and used by various linguistic communities around the globe. Identifying various languages using such scripts is crucial to language technologies and challenging in low-resource setups. As such, this paper sheds light on the challenges of detecting languages using Perso-Arabic scripts, especially in bilingual communities where ``unconventional'' writing is practiced. To address this, we use a set of supervised techniques to classify sentences into their languages. Building on these, we also propose a hierarchical model that targets clusters of languages that are more often confused by the classifiers. Our experiment results indicate the effectiveness of our solutions.",
    "link": "http://arxiv.org/abs/2304.01322",
    "context": "Title: PALI: A Language Identification Benchmark for Perso-Arabic Scripts. (arXiv:2304.01322v1 [cs.CL])\nAbstract: The Perso-Arabic scripts are a family of scripts that are widely adopted and used by various linguistic communities around the globe. Identifying various languages using such scripts is crucial to language technologies and challenging in low-resource setups. As such, this paper sheds light on the challenges of detecting languages using Perso-Arabic scripts, especially in bilingual communities where ``unconventional'' writing is practiced. To address this, we use a set of supervised techniques to classify sentences into their languages. Building on these, we also propose a hierarchical model that targets clusters of languages that are more often confused by the classifiers. Our experiment results indicate the effectiveness of our solutions.",
    "path": "papers/23/04/2304.01322.json",
    "total_tokens": 788,
    "translated_title": "PALI：波斯-阿拉伯文字语言识别基准",
    "translated_abstract": "波斯-阿拉伯文字是世界各地广泛采用和使用的一类文字。使用这种文字进行语言识别对语言技术至关重要，在资源匮乏的情况下较具挑战性。因此，本文重点探讨使用波斯-阿拉伯文字进行语言识别所面临的挑战，尤其是在双语社区中“非传统”的书写方式。为了解决这个问题，我们使用了一组有监督技术将句子分类为它们的语言。基于此，我们还提出了一个针对分类器常常混淆的语言簇的分层模型。我们实验的结果表明了我们的方法的有效性。",
    "tldr": "本文探讨了使用波斯-阿拉伯文字进行语言识别面临的挑战，提出了解决方案，包括使用一组有监督技术将句子分类为它们的语言以及提出一个针对分类器混淆语言簇的分层模型。实验表明这些方法是有效的。",
    "en_tdlr": "This paper explores the challenges of language identification using Perso-Arabic scripts, proposes solutions including using supervised techniques to classify sentences into their languages and a hierarchical model targeting language clusters often confused by classifiers, and shows the effectiveness of these methods through experiments."
}