{
    "title": "Long-term instabilities of deep learning-based digital twins of the climate system: The cause and a solution. (arXiv:2304.07029v1 [physics.flu-dyn])",
    "abstract": "Long-term stability is a critical property for deep learning-based data-driven digital twins of the Earth system. Such data-driven digital twins enable sub-seasonal and seasonal predictions of extreme environmental events, probabilistic forecasts, that require a large number of ensemble members, and computationally tractable high-resolution Earth system models where expensive components of the models can be replaced with cheaper data-driven surrogates. Owing to computational cost, physics-based digital twins, though long-term stable, are intractable for real-time decision-making. Data-driven digital twins offer a cheaper alternative to them and can provide real-time predictions. However, such digital twins can only provide short-term forecasts accurately since they become unstable when time-integrated beyond 20 days. Currently, the cause of the instabilities is unknown, and the methods that are used to improve their stability horizons are ad-hoc and lack rigorous theory. In this paper,",
    "link": "http://arxiv.org/abs/2304.07029",
    "context": "Title: Long-term instabilities of deep learning-based digital twins of the climate system: The cause and a solution. (arXiv:2304.07029v1 [physics.flu-dyn])\nAbstract: Long-term stability is a critical property for deep learning-based data-driven digital twins of the Earth system. Such data-driven digital twins enable sub-seasonal and seasonal predictions of extreme environmental events, probabilistic forecasts, that require a large number of ensemble members, and computationally tractable high-resolution Earth system models where expensive components of the models can be replaced with cheaper data-driven surrogates. Owing to computational cost, physics-based digital twins, though long-term stable, are intractable for real-time decision-making. Data-driven digital twins offer a cheaper alternative to them and can provide real-time predictions. However, such digital twins can only provide short-term forecasts accurately since they become unstable when time-integrated beyond 20 days. Currently, the cause of the instabilities is unknown, and the methods that are used to improve their stability horizons are ad-hoc and lack rigorous theory. In this paper,",
    "path": "papers/23/04/2304.07029.json",
    "total_tokens": 800,
    "tldr": "本论文研究了基于深度学习的数字孪生在长期稳定性方面的限制，提出了一种能够提高数字孪生长期稳定性的方法。",
    "en_tdlr": "This paper explores the limitations of deep learning-based data-driven digital twins in long-term stability and proposes a method to improve their stability horizon."
}