{
    "title": "Decadal Temperature Prediction via Chaotic Behavior Tracking. (arXiv:2304.09536v1 [cs.LG])",
    "abstract": "Decadal temperature prediction provides crucial information for quantifying the expected effects of future climate changes and thus informs strategic planning and decision-making in various domains. However, such long-term predictions are extremely challenging, due to the chaotic nature of temperature variations. Moreover, the usefulness of existing simulation-based and machine learning-based methods for this task is limited because initial simulation or prediction errors increase exponentially over time. To address this challenging task, we devise a novel prediction method involving an information tracking mechanism that aims to track and adapt to changes in temperature dynamics during the prediction phase by providing probabilistic feedback on the prediction error of the next step based on the current prediction. We integrate this information tracking mechanism, which can be considered as a model calibrator, into the objective function of our method to obtain the corrections needed t",
    "link": "http://arxiv.org/abs/2304.09536",
    "context": "Title: Decadal Temperature Prediction via Chaotic Behavior Tracking. (arXiv:2304.09536v1 [cs.LG])\nAbstract: Decadal temperature prediction provides crucial information for quantifying the expected effects of future climate changes and thus informs strategic planning and decision-making in various domains. However, such long-term predictions are extremely challenging, due to the chaotic nature of temperature variations. Moreover, the usefulness of existing simulation-based and machine learning-based methods for this task is limited because initial simulation or prediction errors increase exponentially over time. To address this challenging task, we devise a novel prediction method involving an information tracking mechanism that aims to track and adapt to changes in temperature dynamics during the prediction phase by providing probabilistic feedback on the prediction error of the next step based on the current prediction. We integrate this information tracking mechanism, which can be considered as a model calibrator, into the objective function of our method to obtain the corrections needed t",
    "path": "papers/23/04/2304.09536.json",
    "total_tokens": 851,
    "translated_abstract": "十年温度预测对于量化未来气候变化的预期影响提供了关键信息，因此在各个领域的战略规划和决策制定中起着重要作用。然而，由于温度变化的混沌性质，这些长期预测非常具有挑战性。此外，现有的基于模拟和机器学习的方法对于这项任务的误差会随着时间的推移而呈指数级增加，因而具有一定局限性。为了解决这个具有挑战性的任务，我们设计了一种新的预测方法，其中包含一种信息跟踪机制，旨在在预测阶段跟踪和适应温度动态的变化，通过提供基于当前预测的下一步预测误差的概率反馈来获得修正值。",
    "tldr": "设计了一种新的十年温度预测方法，该方法通过一种信息跟踪机制追踪和适应温度动态的变化，并获得修正值，从而有效地解决了长期预测误差指数级增加的问题。",
    "en_tdlr": "A novel temperature prediction method is proposed, which involves an information tracking mechanism to track and adapt to changes in temperature dynamics, and obtain corrections based on probabilistic feedback on the prediction error of the next step, effectively addressing the issue of exponentially increasing long-term prediction errors in existing methods based on simulation and machine learning."
}