{
    "title": "GMNLP at SemEval-2023 Task 12: Sentiment Analysis with Phylogeny-Based Adapters. (arXiv:2304.12979v1 [cs.CL])",
    "abstract": "This report describes GMU's sentiment analysis system for the SemEval-2023 shared task AfriSenti-SemEval. We participated in all three sub-tasks: Monolingual, Multilingual, and Zero-Shot. Our approach uses models initialized with AfroXLMR-large, a pre-trained multilingual language model trained on African languages and fine-tuned correspondingly. We also introduce augmented training data along with original training data. Alongside finetuning, we perform phylogeny-based adapter tuning to create several models and ensemble the best models for the final submission. Our system achieves the best F1-score on track 5: Amharic, with 6.2 points higher F1-score than the second-best performing system on this track. Overall, our system ranks 5th among the 10 systems participating in all 15 tracks.",
    "link": "http://arxiv.org/abs/2304.12979",
    "context": "Title: GMNLP at SemEval-2023 Task 12: Sentiment Analysis with Phylogeny-Based Adapters. (arXiv:2304.12979v1 [cs.CL])\nAbstract: This report describes GMU's sentiment analysis system for the SemEval-2023 shared task AfriSenti-SemEval. We participated in all three sub-tasks: Monolingual, Multilingual, and Zero-Shot. Our approach uses models initialized with AfroXLMR-large, a pre-trained multilingual language model trained on African languages and fine-tuned correspondingly. We also introduce augmented training data along with original training data. Alongside finetuning, we perform phylogeny-based adapter tuning to create several models and ensemble the best models for the final submission. Our system achieves the best F1-score on track 5: Amharic, with 6.2 points higher F1-score than the second-best performing system on this track. Overall, our system ranks 5th among the 10 systems participating in all 15 tracks.",
    "path": "papers/23/04/2304.12979.json",
    "total_tokens": 873,
    "translated_title": "基于Phylogeny的适配器在SemEval-2023第12项任务：情感分析中的应用",
    "translated_abstract": "本文介绍了GMU对SemEval-2023共享任务AfriSenti-SemEval的情感分析系统。我们参与了单语言、多语言和零样本三个子任务。我们的方法使用了初始化为AfroXLMR-large的模型，它是一个在非洲语言上预训练并相应微调的多语言语言模型。我们还引入了增强的训练数据以及原始训练数据。除了微调外，我们还执行基于Phylogeny的适配器调整来创建多个模型，并将最佳模型集成到最终提交中。我们的系统在第5轨道Amharic上取得了最佳的F1分数，比该轨道上第二最佳性能系统高出6.2个F1分数。总体而言，我们的系统在参与所有15个轨道的10个系统中排名第5。",
    "tldr": "该论文介绍了GMU团队在SemEval-2023共享任务AfriSenti-SemEval中所使用的情感分析系统，使用AfroXLMR-large作为预训练语言模型并引入了增强的训练数据和基于Phylogeny的适配器调整以得到最佳结果。",
    "en_tdlr": "This paper presents GMU's sentiment analysis system for SemEval-2023 shared task AfriSenti-SemEval, which uses AfroXLMR-large as the pre-trained language model and introduces augmented training data and phylogeny-based adapter tuning to achieve the best results."
}