{
    "title": "eWaSR -- an embedded-compute-ready maritime obstacle detection network. (arXiv:2304.11249v1 [cs.CV])",
    "abstract": "Maritime obstacle detection is critical for safe navigation of autonomous surface vehicles (ASVs). While the accuracy of image-based detection methods has advanced substantially, their computational and memory requirements prohibit deployment on embedded devices. In this paper we analyze the currently best-performing maritime obstacle detection network WaSR. Based on the analysis we then propose replacements for the most computationally intensive stages and propose its embedded-compute-ready variant eWaSR. In particular, the new design follows the most recent advancements of transformer-based lightweight networks. eWaSR achieves comparable detection results to state-of-the-art WaSR with only 0.52% F1 score performance drop and outperforms other state-of-the-art embedded-ready architectures by over 9.74% in F1 score. On a standard GPU, eWaSR runs 10x faster than the original WaSR (115 FPS vs 11 FPS). Tests on a real embedded device OAK-D show that, while WaSR cannot run due to memory re",
    "link": "http://arxiv.org/abs/2304.11249",
    "context": "Title: eWaSR -- an embedded-compute-ready maritime obstacle detection network. (arXiv:2304.11249v1 [cs.CV])\nAbstract: Maritime obstacle detection is critical for safe navigation of autonomous surface vehicles (ASVs). While the accuracy of image-based detection methods has advanced substantially, their computational and memory requirements prohibit deployment on embedded devices. In this paper we analyze the currently best-performing maritime obstacle detection network WaSR. Based on the analysis we then propose replacements for the most computationally intensive stages and propose its embedded-compute-ready variant eWaSR. In particular, the new design follows the most recent advancements of transformer-based lightweight networks. eWaSR achieves comparable detection results to state-of-the-art WaSR with only 0.52% F1 score performance drop and outperforms other state-of-the-art embedded-ready architectures by over 9.74% in F1 score. On a standard GPU, eWaSR runs 10x faster than the original WaSR (115 FPS vs 11 FPS). Tests on a real embedded device OAK-D show that, while WaSR cannot run due to memory re",
    "path": "papers/23/04/2304.11249.json",
    "total_tokens": 1029,
    "translated_title": "eWaSR——一种嵌入式计算准备好的海事障碍物检测网络",
    "translated_abstract": "海事障碍物检测对于自主水面船舶（ASV）的安全导航至关重要。虽然基于图像的检测方法的准确性已经大大提高，但它们的计算和内存要求阻止了在嵌入式设备上的部署。在本文中，我们对当前表现最佳的海事障碍物检测网络WaSR进行了分析。在分析基础上，我们提出替换最耗计算资源的阶段并提出其嵌入式计算准备好的变体eWaSR。特别地，新设计遵循了基于transformer的轻量级网络的最新进展。eWaSR在仅有0.52％的F1得分性能下降的情况下实现了与最先进的WaSR相当的检测结果，并在F1得分方面优于其他最先进的嵌入式就绪架构高达9.74％。在标准GPU上，eWaSR的运行速度比原始WaSR快10倍（115 FPS vs 11 FPS）。在OAK-D实际嵌入式设备上的测试表明，尽管WaSR由于内存限制而无法运行，但eWaSR仍然能够表现出色。",
    "tldr": "本论文提出了一种嵌入式计算准备好的海事障碍物检测网络——eWaSR，能够在保证检测质量的前提下运行速度更快，且在F1得分方面也优于其他目前最先进的嵌入式就绪架构。"
}