{
    "title": "Both Efficiency and Effectiveness! A Large Scale Pre-ranking Framework in Search System. (arXiv:2304.02434v1 [cs.IR])",
    "abstract": "In the realm of search systems, multi-stage cascade architecture is a prevalent method, typically consisting of sequential modules such as matching, pre-ranking, and ranking. It is generally acknowledged that the model used in the pre-ranking stage must strike a balance between efficacy and efficiency. Thus, the most commonly employed architecture is the representation-focused vector product based model. However, this architecture lacks effective interaction between the query and document, resulting in a reduction in the effectiveness of the search system. To address this issue, we present a novel pre-ranking framework called RankDFM. Our framework leverages DeepFM as the backbone and employs a pairwise training paradigm to learn the ranking of videos under a query. The capability of RankDFM to cross features provides significant improvement in offline and online A/B testing performance. Furthermore, we introduce a learnable feature selection scheme to optimize the model and reduce the",
    "link": "http://arxiv.org/abs/2304.02434",
    "context": "Title: Both Efficiency and Effectiveness! A Large Scale Pre-ranking Framework in Search System. (arXiv:2304.02434v1 [cs.IR])\nAbstract: In the realm of search systems, multi-stage cascade architecture is a prevalent method, typically consisting of sequential modules such as matching, pre-ranking, and ranking. It is generally acknowledged that the model used in the pre-ranking stage must strike a balance between efficacy and efficiency. Thus, the most commonly employed architecture is the representation-focused vector product based model. However, this architecture lacks effective interaction between the query and document, resulting in a reduction in the effectiveness of the search system. To address this issue, we present a novel pre-ranking framework called RankDFM. Our framework leverages DeepFM as the backbone and employs a pairwise training paradigm to learn the ranking of videos under a query. The capability of RankDFM to cross features provides significant improvement in offline and online A/B testing performance. Furthermore, we introduce a learnable feature selection scheme to optimize the model and reduce the",
    "path": "papers/23/04/2304.02434.json",
    "total_tokens": 892,
    "tldr": "RankDFM是一个新颖的预排名框架，它利用DeepFM作为骨干来学习查询下视频的排名并兼具高效和效率，通过跨特征的能力优化了查询和文档之间的交互，具有显著提高性能的效果。"
}