{
    "title": "Robust and differentially private stochastic linear bandits. (arXiv:2304.11741v1 [cs.LG])",
    "abstract": "In this paper, we study the stochastic linear bandit problem under the additional requirements of differential privacy, robustness and batched observations. In particular, we assume an adversary randomly chooses a constant fraction of the observed rewards in each batch, replacing them with arbitrary numbers. We present differentially private and robust variants of the arm elimination algorithm using logarithmic batch queries under two privacy models and provide regret bounds in both settings. In the first model, every reward in each round is reported by a potentially different client, which reduces to standard local differential privacy (LDP). In the second model, every action is \"owned\" by a different client, who may aggregate the rewards over multiple queries and privatize the aggregate response instead. To the best of our knowledge, our algorithms are the first simultaneously providing differential privacy and adversarial robustness in the stochastic linear bandits problem.",
    "link": "http://arxiv.org/abs/2304.11741",
    "context": "Title: Robust and differentially private stochastic linear bandits. (arXiv:2304.11741v1 [cs.LG])\nAbstract: In this paper, we study the stochastic linear bandit problem under the additional requirements of differential privacy, robustness and batched observations. In particular, we assume an adversary randomly chooses a constant fraction of the observed rewards in each batch, replacing them with arbitrary numbers. We present differentially private and robust variants of the arm elimination algorithm using logarithmic batch queries under two privacy models and provide regret bounds in both settings. In the first model, every reward in each round is reported by a potentially different client, which reduces to standard local differential privacy (LDP). In the second model, every action is \"owned\" by a different client, who may aggregate the rewards over multiple queries and privatize the aggregate response instead. To the best of our knowledge, our algorithms are the first simultaneously providing differential privacy and adversarial robustness in the stochastic linear bandits problem.",
    "path": "papers/23/04/2304.11741.json",
    "total_tokens": 877,
    "translated_title": "强健且具有差分隐私保护的随机线性赌博机",
    "translated_abstract": "本文研究了在差分隐私、强健性和批量观察这些附加条件下的随机线性赌博机问题。特别地，我们假设在每个批次中，对于观测到的奖励，对手会随机选择其中的一个固定部分，并用任意数字替换。我们以对数批量查询为基础，分别在两种隐私模型下提出了有差分隐私保护和强健的臂消除算法变体，并在两种情况下提供了遗憾界。在第一个模型中，每一轮中的每个奖励都由可能不同的客户报告，这归结为标准的本地差分隐私。在第二个模型中，每个动作由不同的客户“拥有”，这些客户可能会汇总多个查询的奖励，并将聚合响应私有化。据我们所知，我们的算法是在随机线性赌博机问题中，首次同时提供差分隐私和对抗性强健性的算法。",
    "tldr": "本文提出了一种在差分隐私和对抗性强健性条件下的随机线性赌博机算法，是首次提供这两个保护条件的算法。",
    "en_tdlr": "This paper proposes an algorithm for solving the stochastic linear bandit problem under differential privacy and adversarial robustness conditions, which is the first algorithm to provide both protections in this context."
}