{
    "title": "CoRe-Sleep: A Multimodal Fusion Framework for Time Series Robust to Imperfect Modalities. (arXiv:2304.06485v1 [eess.SP])",
    "abstract": "Sleep abnormalities can have severe health consequences. Automated sleep staging, i.e. labelling the sequence of sleep stages from the patient's physiological recordings, could simplify the diagnostic process. Previous work on automated sleep staging has achieved great results, mainly relying on the EEG signal. However, often multiple sources of information are available beyond EEG. This can be particularly beneficial when the EEG recordings are noisy or even missing completely. In this paper, we propose CoRe-Sleep, a Coordinated Representation multimodal fusion network that is particularly focused on improving the robustness of signal analysis on imperfect data. We demonstrate how appropriately handling multimodal information can be the key to achieving such robustness. CoRe-Sleep tolerates noisy or missing modalities segments, allowing training on incomplete data. Additionally, it shows state-of-the-art performance when testing on both multimodal and unimodal data using a single mode",
    "link": "http://arxiv.org/abs/2304.06485",
    "context": "Title: CoRe-Sleep: A Multimodal Fusion Framework for Time Series Robust to Imperfect Modalities. (arXiv:2304.06485v1 [eess.SP])\nAbstract: Sleep abnormalities can have severe health consequences. Automated sleep staging, i.e. labelling the sequence of sleep stages from the patient's physiological recordings, could simplify the diagnostic process. Previous work on automated sleep staging has achieved great results, mainly relying on the EEG signal. However, often multiple sources of information are available beyond EEG. This can be particularly beneficial when the EEG recordings are noisy or even missing completely. In this paper, we propose CoRe-Sleep, a Coordinated Representation multimodal fusion network that is particularly focused on improving the robustness of signal analysis on imperfect data. We demonstrate how appropriately handling multimodal information can be the key to achieving such robustness. CoRe-Sleep tolerates noisy or missing modalities segments, allowing training on incomplete data. Additionally, it shows state-of-the-art performance when testing on both multimodal and unimodal data using a single mode",
    "path": "papers/23/04/2304.06485.json",
    "total_tokens": 917,
    "translated_title": "CoRe-Sleep: 一种多模态融合框架，用于对不完善模态具有鲁棒性的时间序列分析",
    "translated_abstract": "睡眠异常可能会对健康产生严重的后果。自动化睡眠分期可以简化诊断过程。以往的自动化睡眠分期工作取得了很好的结果，主要依赖于 EEG 信号。但是，通常在 EEG 之外还有多个信息源可用。当 EEG 记录存在噪声甚至完全缺失时，这可能尤为有益。本文提出了 CoRe-Sleep，一种协调表示多模态融合网络，它特别关注于提高对不完善数据的信号分析的鲁棒性。我们展示了适当处理多模态信息可以是实现这种鲁棒性的关键。CoRe-Sleep 容忍噪声或缺失的模态片段，允许在不完整数据上进行训练。此外，它在使用单个模式进行多模态数据测试和单模态数据测试时都展现了最先进的性能。",
    "tldr": "CoRe-Sleep是一种多模态融合框架，特别关注于提高对不完善数据的信号分析的鲁棒性，它通过适当处理多模态信息，容忍噪声或丢失的模态片段，展现最先进的性能。",
    "en_tdlr": "CoRe-Sleep is a multimodal fusion framework that focuses on improving the robustness of signal analysis on imperfect data, it tolerates noisy or missing modality segments by appropriately handling multimodal information, and demonstrates state-of-the-art performance in testing on both multimodal and unimodal data using a single mode."
}