{
    "title": "Towards Coherent Image Inpainting Using Denoising Diffusion Implicit Models. (arXiv:2304.03322v1 [cs.CV])",
    "abstract": "Image inpainting refers to the task of generating a complete, natural image based on a partially revealed reference image. Recently, many research interests have been focused on addressing this problem using fixed diffusion models. These approaches typically directly replace the revealed region of the intermediate or final generated images with that of the reference image or its variants. However, since the unrevealed regions are not directly modified to match the context, it results in incoherence between revealed and unrevealed regions. To address the incoherence problem, a small number of methods introduce a rigorous Bayesian framework, but they tend to introduce mismatches between the generated and the reference images due to the approximation errors in computing the posterior distributions. In this paper, we propose COPAINT, which can coherently inpaint the whole image without introducing mismatches. COPAINT also uses the Bayesian framework to jointly modify both revealed and unre",
    "link": "http://arxiv.org/abs/2304.03322",
    "context": "Title: Towards Coherent Image Inpainting Using Denoising Diffusion Implicit Models. (arXiv:2304.03322v1 [cs.CV])\nAbstract: Image inpainting refers to the task of generating a complete, natural image based on a partially revealed reference image. Recently, many research interests have been focused on addressing this problem using fixed diffusion models. These approaches typically directly replace the revealed region of the intermediate or final generated images with that of the reference image or its variants. However, since the unrevealed regions are not directly modified to match the context, it results in incoherence between revealed and unrevealed regions. To address the incoherence problem, a small number of methods introduce a rigorous Bayesian framework, but they tend to introduce mismatches between the generated and the reference images due to the approximation errors in computing the posterior distributions. In this paper, we propose COPAINT, which can coherently inpaint the whole image without introducing mismatches. COPAINT also uses the Bayesian framework to jointly modify both revealed and unre",
    "path": "papers/23/04/2304.03322.json",
    "total_tokens": 927,
    "translated_title": "基于去噪扩散隐式模型的连续图像修复",
    "translated_abstract": "图像修复是指在基于部分可见的参考图像的情况下生成完整、自然的图像任务。然而，直接使用固定的扩散模型进行修复往往会导致修复和未修复的区域不协调。为此，本研究提出了CO-PAINT算法，使用Bayesian框架来同时修改图像中的修复和未修复区域，并采用扩散隐式模型估计像素的后验分布。为了提高后验估计的效率，我们采取一种去噪方法来去除在不同扩散阶段产生的中间图像噪声。在各种基准数据集上进行的实验结果表明，我们的方法可以在视觉质量和定量结果方面达到最先进的性能。",
    "tldr": "本研究提出了一种基于Bayesian框架和去噪扩散隐式模型的方法CO-PAINT，用于解决图像修复中修复区域和未修复区域不协调问题，实现了最先进的性能表现。"
}