{
    "title": "Unsupervised Machine Learning to Classify the Confinement of Waves in Periodic Superstructures. (arXiv:2304.11901v2 [physics.optics] UPDATED)",
    "abstract": "We employ unsupervised machine learning to enhance the accuracy of our recently presented scaling method for wave confinement analysis [1]. We employ the standard k-means++ algorithm as well as our own model-based algorithm. We investigate cluster validity indices as a means to find the correct number of confinement dimensionalities to be used as an input to the clustering algorithms. Subsequently, we analyze the performance of the two clustering algorithms when compared to the direct application of the scaling method without clustering. We find that the clustering approach provides more physically meaningful results, but may struggle with identifying the correct set of confinement dimensionalities. We conclude that the most accurate outcome is obtained by first applying the direct scaling to find the correct set of confinement dimensionalities and subsequently employing clustering to refine the results. Moreover, our model-based algorithm outperforms the standard k-means++ clustering.",
    "link": "http://arxiv.org/abs/2304.11901",
    "context": "Title: Unsupervised Machine Learning to Classify the Confinement of Waves in Periodic Superstructures. (arXiv:2304.11901v2 [physics.optics] UPDATED)\nAbstract: We employ unsupervised machine learning to enhance the accuracy of our recently presented scaling method for wave confinement analysis [1]. We employ the standard k-means++ algorithm as well as our own model-based algorithm. We investigate cluster validity indices as a means to find the correct number of confinement dimensionalities to be used as an input to the clustering algorithms. Subsequently, we analyze the performance of the two clustering algorithms when compared to the direct application of the scaling method without clustering. We find that the clustering approach provides more physically meaningful results, but may struggle with identifying the correct set of confinement dimensionalities. We conclude that the most accurate outcome is obtained by first applying the direct scaling to find the correct set of confinement dimensionalities and subsequently employing clustering to refine the results. Moreover, our model-based algorithm outperforms the standard k-means++ clustering.",
    "path": "papers/23/04/2304.11901.json",
    "total_tokens": 896,
    "translated_title": "无监督机器学习用于分类周期性超结构中波的约束",
    "translated_abstract": "我们利用无监督机器学习增强了我们最近提出的波约束分析的比例方法的准确性[1]。我们采用标准的k-means ++算法以及我们自己的基于模型的算法。我们研究了簇有效性指数作为一种手段来找到正确的约束维度号，以用作聚类算法的输入。随后，我们分析了两种聚类算法相对于不使用聚类的直接应用比例方法的性能。我们发现聚类方法提供了更具物理意义的结果，但可能难以识别正确的约束维度集。我们得出结论，最准确的结果是先应用直接比例方法找到正确的约束维度集，然后再采用聚类来细化结果。此外，我们的基于模型的算法优于标准的k-means ++聚类。",
    "tldr": "通过对比聚类算法和直接应用方法，本研究发现应先采用直接比例方法找到正确的约束维度集，再用聚类来细化结果，同时基于模型的算法优于标准的k-means++聚类算法。",
    "en_tdlr": "This study employs unsupervised machine learning to enhance the accuracy of the scaling method for wave confinement analysis. The clustering approach provides more physically meaningful results, but struggles with identifying the correct set of confinement dimensionalities. Therefore, the most accurate outcome is obtained by first applying the direct scaling to find the correct set of confinement dimensionalities and subsequently employing clustering to refine the results, with the model-based algorithm outperforming the standard k-means++ clustering."
}