{
    "title": "Sejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia: Tinjauan tentang sejarah, perkembangan teknologi, dan aplikasi NLP dalam bahasa Indonesia. (arXiv:2304.02746v1 [cs.CL])",
    "abstract": "This study provides an overview of the history of the development of Natural Language Processing (NLP) in the context of the Indonesian language, with a focus on the basic technologies, methods, and practical applications that have been developed. This review covers developments in basic NLP technologies such as stemming, part-of-speech tagging, and related methods; practical applications in cross-language information retrieval systems, information extraction, and sentiment analysis; and methods and techniques used in Indonesian language NLP research, such as machine learning, statistics-based machine translation, and conflict-based approaches. This study also explores the application of NLP in Indonesian language industry and research and identifies challenges and opportunities in Indonesian language NLP research and development. Recommendations for future Indonesian language NLP research and development include developing more efficient methods and technologies, expanding NLP applica",
    "link": "http://arxiv.org/abs/2304.02746",
    "context": "Title: Sejarah dan Perkembangan Teknik Natural Language Processing (NLP) Bahasa Indonesia: Tinjauan tentang sejarah, perkembangan teknologi, dan aplikasi NLP dalam bahasa Indonesia. (arXiv:2304.02746v1 [cs.CL])\nAbstract: This study provides an overview of the history of the development of Natural Language Processing (NLP) in the context of the Indonesian language, with a focus on the basic technologies, methods, and practical applications that have been developed. This review covers developments in basic NLP technologies such as stemming, part-of-speech tagging, and related methods; practical applications in cross-language information retrieval systems, information extraction, and sentiment analysis; and methods and techniques used in Indonesian language NLP research, such as machine learning, statistics-based machine translation, and conflict-based approaches. This study also explores the application of NLP in Indonesian language industry and research and identifies challenges and opportunities in Indonesian language NLP research and development. Recommendations for future Indonesian language NLP research and development include developing more efficient methods and technologies, expanding NLP applica",
    "path": "papers/23/04/2304.02746.json",
    "total_tokens": 914,
    "translated_title": "印尼语自然语言处理技术（NLP）的历史和发展：基础技术、方法、实际应用和挑战",
    "translated_abstract": "本研究概述了印尼语环境下自然语言处理（NLP）的发展史，并关注已开发的基础技术、方法和实用应用。综述了基础NLP技术的发展，如词干提取、词性标注和相关方法，以及跨语言信息检索、信息提取和情感分析等实际应用，探索了在印尼语NLP研究中使用的方法和技术，如机器学习、基于统计的机器翻译和基于冲突的方法。本研究还探讨了NLP在印尼语产业和研究中的应用，并确定了印尼语NLP研究和发展中的挑战和机遇。未来印尼语NLP研究和发展的建议包括开发更有效率的方法和技术，扩大NLP的应用范围。",
    "tldr": "本文概述了印尼语自然语言处理技术的历史和发展，包括基础技术、实际应用和挑战。未来的研究应该拓展更有效率的方法和技术，并扩大NLP的应用范围。",
    "en_tdlr": "This study provides an overview of the history and development of natural language processing (NLP) in Indonesian language, covering basic technologies, practical applications, and challenges. Recommendations for future research include developing more efficient methods and technologies and expanding NLP applications."
}