{
    "title": "Exploring and Exploiting Uncertainty for Incomplete Multi-View Classification. (arXiv:2304.05165v1 [cs.LG])",
    "abstract": "Classifying incomplete multi-view data is inevitable since arbitrary view missing widely exists in real-world applications. Although great progress has been achieved, existing incomplete multi-view methods are still difficult to obtain a trustworthy prediction due to the relatively high uncertainty nature of missing views. First, the missing view is of high uncertainty, and thus it is not reasonable to provide a single deterministic imputation. Second, the quality of the imputed data itself is of high uncertainty. To explore and exploit the uncertainty, we propose an Uncertainty-induced Incomplete Multi-View Data Classification (UIMC) model to classify the incomplete multi-view data under a stable and reliable framework. We construct a distribution and sample multiple times to characterize the uncertainty of missing views, and adaptively utilize them according to the sampling quality. Accordingly, the proposed method realizes more perceivable imputation and controllable fusion. Specifi",
    "link": "http://arxiv.org/abs/2304.05165",
    "context": "Title: Exploring and Exploiting Uncertainty for Incomplete Multi-View Classification. (arXiv:2304.05165v1 [cs.LG])\nAbstract: Classifying incomplete multi-view data is inevitable since arbitrary view missing widely exists in real-world applications. Although great progress has been achieved, existing incomplete multi-view methods are still difficult to obtain a trustworthy prediction due to the relatively high uncertainty nature of missing views. First, the missing view is of high uncertainty, and thus it is not reasonable to provide a single deterministic imputation. Second, the quality of the imputed data itself is of high uncertainty. To explore and exploit the uncertainty, we propose an Uncertainty-induced Incomplete Multi-View Data Classification (UIMC) model to classify the incomplete multi-view data under a stable and reliable framework. We construct a distribution and sample multiple times to characterize the uncertainty of missing views, and adaptively utilize them according to the sampling quality. Accordingly, the proposed method realizes more perceivable imputation and controllable fusion. Specifi",
    "path": "papers/23/04/2304.05165.json",
    "total_tokens": 786,
    "translated_title": "探索和利用不确定性进行不完整多视图分类",
    "translated_abstract": "由于在实际应用中任意视图缺失广泛存在，因此分类不完整的多视图数据是不可避免的。尽管取得了巨大进展，但由于缺失视图的相对高的不确定性特性，现有的不完整多视图方法仍然很难获得可信的预测。为了探索和利用不确定性，我们提出了一种基于不确定性的不完整多视图数据分类模型，用于在稳定可靠的框架下对不完整的多视图数据进行分类。我们构建了一个分布并进行多次抽样以表征缺失视图的不确定性，并根据抽样质量自适应地利用它们。因此，所提出的方法实现了更加可感知的填充和可控的融合。",
    "tldr": "提出了一种基于不确定性的不完整多视图数据分类模型，通过构建分布并多次抽样，实现更加可感知的填充和可控的融合。",
    "en_tdlr": "Propose an uncertainty-induced model to classify incomplete multi-view data, which constructs a distribution and sample multiple times to achieve more perceivable imputation and controllable fusion."
}