{
    "title": "Deep-BIAS: Detecting Structural Bias using Explainable AI. (arXiv:2304.01869v1 [cs.NE])",
    "abstract": "Evaluating the performance of heuristic optimisation algorithms is essential to determine how well they perform under various conditions. Recently, the BIAS toolbox was introduced as a behaviour benchmark to detect structural bias (SB) in search algorithms. The toolbox can be used to identify biases in existing algorithms, as well as to test for bias in newly developed algorithms. In this article, we introduce a novel and explainable deep-learning expansion of the BIAS toolbox, called Deep-BIAS. Where the original toolbox uses 39 statistical tests and a Random Forest model to predict the existence and type of SB, the Deep-BIAS method uses a trained deep-learning model to immediately detect the strength and type of SB based on the raw performance distributions. Through a series of experiments with a variety of structurally biased scenarios, we demonstrate the effectiveness of Deep-BIAS. We also present the results of using the toolbox on 336 state-of-the-art optimisation algorithms, whi",
    "link": "http://arxiv.org/abs/2304.01869",
    "context": "Title: Deep-BIAS: Detecting Structural Bias using Explainable AI. (arXiv:2304.01869v1 [cs.NE])\nAbstract: Evaluating the performance of heuristic optimisation algorithms is essential to determine how well they perform under various conditions. Recently, the BIAS toolbox was introduced as a behaviour benchmark to detect structural bias (SB) in search algorithms. The toolbox can be used to identify biases in existing algorithms, as well as to test for bias in newly developed algorithms. In this article, we introduce a novel and explainable deep-learning expansion of the BIAS toolbox, called Deep-BIAS. Where the original toolbox uses 39 statistical tests and a Random Forest model to predict the existence and type of SB, the Deep-BIAS method uses a trained deep-learning model to immediately detect the strength and type of SB based on the raw performance distributions. Through a series of experiments with a variety of structurally biased scenarios, we demonstrate the effectiveness of Deep-BIAS. We also present the results of using the toolbox on 336 state-of-the-art optimisation algorithms, whi",
    "path": "papers/23/04/2304.01869.json",
    "total_tokens": 959,
    "translated_title": "Deep-BIAS:使用可解释的人工智能技术检测结构偏差",
    "translated_abstract": "评估启发式优化算法的性能对于确定它们在各种条件下的表现如何至关重要。最近，引入了BIAS工具包作为行为基准来检测搜索算法中的结构偏差（SB）。该工具包可用于识别现有算法中的偏差，以及测试新开发的算法的偏差。在本文中，我们介绍了BIAS工具箱的一种新颖且可解释的深度学习扩展，称为Deep-BIAS。原始工具箱使用39个统计测试和一个随机森林模型来预测SB的存在和类型，而Deep-BIAS方法使用训练有素的深度学习模型来立即检测基于原始性能分布的SB的强度和类型。通过一系列具有各种结构偏差情况的实验证明了Deep-BIAS的有效性。我们还展示了使用工具箱对336种最先进的优化算法的结果。",
    "tldr": "Deep-BIAS是一种可解释的深度学习扩展工具箱，用于检测搜索算法中的结构偏差。通过训练深度学习模型，可以快速检测基于原始性能分布的偏差的强度和类型。该工具箱已被证明在各种具有结构偏差情况的实验中十分有效，并在336种最先进的优化算法中得到了广泛应用。",
    "en_tdlr": "Deep-BIAS is an explainable deep-learning toolbox to detect structural bias in search algorithms. It uses a trained model to immediately detect the strength and type of bias based on the raw performance distributions. It has been proven effective in various experiments with structurally biased scenarios and has been widely applied to 336 state-of-the-art optimization algorithms."
}