{
    "title": "A Modular Approach for Multilingual Timex Detection and Normalization using Deep Learning and Grammar-based methods. (arXiv:2304.14221v1 [cs.CL])",
    "abstract": "Detecting and normalizing temporal expressions is an essential step for many NLP tasks. While a variety of methods have been proposed for detection, best normalization approaches rely on hand-crafted rules. Furthermore, most of them have been designed only for English. In this paper we present a modular multilingual temporal processing system combining a fine-tuned Masked Language Model for detection, and a grammar-based normalizer. We experiment in Spanish and English and compare with HeidelTime, the state-of-the-art in multilingual temporal processing. We obtain best results in gold timex normalization, timex detection and type recognition, and competitive performance in the combined TempEval-3 relaxed value metric. A detailed error analysis shows that detecting only those timexes for which it is feasible to provide a normalization is highly beneficial in this last metric. This raises the question of which is the best strategy for timex processing, namely, leaving undetected those ti",
    "link": "http://arxiv.org/abs/2304.14221",
    "context": "Title: A Modular Approach for Multilingual Timex Detection and Normalization using Deep Learning and Grammar-based methods. (arXiv:2304.14221v1 [cs.CL])\nAbstract: Detecting and normalizing temporal expressions is an essential step for many NLP tasks. While a variety of methods have been proposed for detection, best normalization approaches rely on hand-crafted rules. Furthermore, most of them have been designed only for English. In this paper we present a modular multilingual temporal processing system combining a fine-tuned Masked Language Model for detection, and a grammar-based normalizer. We experiment in Spanish and English and compare with HeidelTime, the state-of-the-art in multilingual temporal processing. We obtain best results in gold timex normalization, timex detection and type recognition, and competitive performance in the combined TempEval-3 relaxed value metric. A detailed error analysis shows that detecting only those timexes for which it is feasible to provide a normalization is highly beneficial in this last metric. This raises the question of which is the best strategy for timex processing, namely, leaving undetected those ti",
    "path": "papers/23/04/2304.14221.json",
    "total_tokens": 1027,
    "translated_title": "一种基于深度学习和基于文法方法的多语言时态表达式检测和规范化的模块化方法",
    "translated_abstract": "检测和规范化时间表达式是许多自然语言处理任务中必不可少的步骤。虽然已经提出了各种检测方法，但最佳规范化方法仍然依赖于手工制定的规则。此外，它们大多数仅针对英语设计。在本文中，我们提出了一个模块化的多语言时间处理系统，结合了基于掩蔽语言模型的检测方法和基于文法的规范化方法。我们在西班牙语和英语上进行了实验，并与 HeidelTime 进行了比较，后者是多语言时间处理的最新研究成果。我们在金标准 timex 规范化、timex 检测和类型识别方面取得了最佳结果，并在组合的 TempEval-3 宽松度量上表现出竞争性的表现。详细的误差分析表明，在该指标中仅检测可提供规范化的 timexes 对其有很大的好处。这引出了一个问题，即 timex 处理的最佳策略是什么，即只检测那些可行提供规范化的 timexes 或仅检测那些易于规范化的 timexes。",
    "tldr": "本文介绍了一个模块化的多语言时间处理系统，该系统结合了基于深度学习的检测方法和基于文法的规范化方法，能够有效地进行时态表达式检测和规范化，并在金标准 timex 规范化、timex 检测和类型识别方面取得了最佳结果。",
    "en_tdlr": "This paper proposes a modular multilingual temporal processing system combining a fine-tuned Masked Language Model for detection and a grammar-based normalizer, achieving best results in gold timex normalization, timex detection and type recognition, and competitive performance in the combined TempEval-3 relaxed value metric."
}