{
    "title": "Identifying Appropriate Intellectual Property Protection Mechanisms for Machine Learning Models: A Systematization of Watermarking, Fingerprinting, Model Access, and Attacks. (arXiv:2304.11285v1 [cs.LG])",
    "abstract": "The commercial use of Machine Learning (ML) is spreading; at the same time, ML models are becoming more complex and more expensive to train, which makes Intellectual Property Protection (IPP) of trained models a pressing issue. Unlike other domains that can build on a solid understanding of the threats, attacks and defenses available to protect their IP, the ML-related research in this regard is still very fragmented. This is also due to a missing unified view as well as a common taxonomy of these aspects.  In this paper, we systematize our findings on IPP in ML, while focusing on threats and attacks identified and defenses proposed at the time of writing. We develop a comprehensive threat model for IP in ML, categorizing attacks and defenses within a unified and consolidated taxonomy, thus bridging research from both the ML and security communities.",
    "link": "http://arxiv.org/abs/2304.11285",
    "context": "Title: Identifying Appropriate Intellectual Property Protection Mechanisms for Machine Learning Models: A Systematization of Watermarking, Fingerprinting, Model Access, and Attacks. (arXiv:2304.11285v1 [cs.LG])\nAbstract: The commercial use of Machine Learning (ML) is spreading; at the same time, ML models are becoming more complex and more expensive to train, which makes Intellectual Property Protection (IPP) of trained models a pressing issue. Unlike other domains that can build on a solid understanding of the threats, attacks and defenses available to protect their IP, the ML-related research in this regard is still very fragmented. This is also due to a missing unified view as well as a common taxonomy of these aspects.  In this paper, we systematize our findings on IPP in ML, while focusing on threats and attacks identified and defenses proposed at the time of writing. We develop a comprehensive threat model for IP in ML, categorizing attacks and defenses within a unified and consolidated taxonomy, thus bridging research from both the ML and security communities.",
    "path": "papers/23/04/2304.11285.json",
    "total_tokens": 935,
    "translated_title": "机器学习模型适当的知识产权保护机制的辨别：针对水印、指纹、模型访问和攻击的系统化分析",
    "translated_abstract": "机器学习（ML）的商业应用越来越普及；同时，ML模型变得越来越复杂，而且训练成本越来越高，这使得训练模型的知识产权保护（IPP）成为一个紧迫的问题。与其他领域可以建立在对其IP进行保护的威胁、攻击和防御措施有着深刻理解的基础上不同，机器学习领域的相关研究仍然非常零散。这也是由于缺少统一的视角以及这些方面的共同分类学。在本文中，我们系统化了我们在ML中关于IPP的发现，同时专注于编写时已确认的威胁、攻击和防御措施。我们为ML中的IP建立了综合的威胁模型，将攻击和防御措施分类到统一和整合的分类法中，从而搭起了来自ML和安全社区的研究之间的桥梁。",
    "tldr": "本文系统化分析了机器学习模型在知识产权保护方面的挑战，提出了针对水印、指纹、模型访问和攻击的保护技术，并构建了综合的威胁模型。",
    "en_tdlr": "This paper provides a systematic analysis of the challenges of intellectual property protection for machine learning models, proposes protection techniques against watermarking, fingerprinting, model access, and attacks, and constructs a comprehensive threat model."
}