{
    "title": "Scalable Causal Discovery with Score Matching. (arXiv:2304.03382v1 [cs.LG])",
    "abstract": "This paper demonstrates how to discover the whole causal graph from the second derivative of the log-likelihood in observational non-linear additive Gaussian noise models. Leveraging scalable machine learning approaches to approximate the score function $\\nabla \\log p(\\mathbf{X})$, we extend the work of Rolland et al. (2022) that only recovers the topological order from the score and requires an expensive pruning step removing spurious edges among those admitted by the ordering. Our analysis leads to DAS (acronym for Discovery At Scale), a practical algorithm that reduces the complexity of the pruning by a factor proportional to the graph size. In practice, DAS achieves competitive accuracy with current state-of-the-art while being over an order of magnitude faster. Overall, our approach enables principled and scalable causal discovery, significantly lowering the compute bar.",
    "link": "http://arxiv.org/abs/2304.03382",
    "context": "Title: Scalable Causal Discovery with Score Matching. (arXiv:2304.03382v1 [cs.LG])\nAbstract: This paper demonstrates how to discover the whole causal graph from the second derivative of the log-likelihood in observational non-linear additive Gaussian noise models. Leveraging scalable machine learning approaches to approximate the score function $\\nabla \\log p(\\mathbf{X})$, we extend the work of Rolland et al. (2022) that only recovers the topological order from the score and requires an expensive pruning step removing spurious edges among those admitted by the ordering. Our analysis leads to DAS (acronym for Discovery At Scale), a practical algorithm that reduces the complexity of the pruning by a factor proportional to the graph size. In practice, DAS achieves competitive accuracy with current state-of-the-art while being over an order of magnitude faster. Overall, our approach enables principled and scalable causal discovery, significantly lowering the compute bar.",
    "path": "papers/23/04/2304.03382.json",
    "total_tokens": 912,
    "translated_title": "基于分数匹配的可扩展因果推断",
    "translated_abstract": "本文展示了如何在非线性可加性高斯噪声模型中利用对数似然函数的二阶导数来发现整个因果图。借助于可扩展的机器学习方法来逼近分数函数 $\\nabla \\log p(\\mathbf{X})$，我们扩展了Rolland等人（2022）的工作，后者仅从分数中恢复拓扑顺序，并需要一个昂贵的修剪步骤来消除由此顺序允许的虚假边缘。我们的分析导致了DAS（即 Discovery At Scale，规模化发现）算法，它通过与图形大小成比例的因素减少修剪的复杂性。在实践中，DAS实现了与当前最先进技术相当的准确性，同时速度提升了一个数量级以上。总的来说，我们的方法实现了原则性和可扩展的因果推断，大大降低了计算门槛。",
    "tldr": "该论文提出了一种利用分数匹配算法实现可扩展因果推断的方法，该算法可从非线性可加性高斯噪声模型的对数似然函数中发现整个因果图，并通过实现与当前最先进技术相当的准确性来降低了计算门槛。",
    "en_tdlr": "This paper proposes a scalable causal discovery method using score matching algorithm that can discover the whole causal graph from the second derivative of the log-likelihood in observational non-linear additive Gaussian noise models. The proposed DAS algorithm reduces the complexity of the pruning by a factor proportional to the graph size, achieving competitive accuracy with current state-of-the-art while being over an order of magnitude faster, significantly reducing the compute bar."
}