{
    "title": "Graph Convolutional Networks based on Manifold Learning for Semi-Supervised Image Classification. (arXiv:2304.12492v1 [cs.CV])",
    "abstract": "Due to a huge volume of information in many domains, the need for classification methods is imperious. In spite of many advances, most of the approaches require a large amount of labeled data, which is often not available, due to costs and difficulties of manual labeling processes. In this scenario, unsupervised and semi-supervised approaches have been gaining increasing attention. The GCNs (Graph Convolutional Neural Networks) represent a promising solution since they encode the neighborhood information and have achieved state-of-the-art results on scenarios with limited labeled data. However, since GCNs require graph-structured data, their use for semi-supervised image classification is still scarce in the literature. In this work, we propose a novel approach, the Manifold-GCN, based on GCNs for semi-supervised image classification. The main hypothesis of this paper is that the use of manifold learning to model the graph structure can further improve the GCN classification. To the be",
    "link": "http://arxiv.org/abs/2304.12492",
    "context": "Title: Graph Convolutional Networks based on Manifold Learning for Semi-Supervised Image Classification. (arXiv:2304.12492v1 [cs.CV])\nAbstract: Due to a huge volume of information in many domains, the need for classification methods is imperious. In spite of many advances, most of the approaches require a large amount of labeled data, which is often not available, due to costs and difficulties of manual labeling processes. In this scenario, unsupervised and semi-supervised approaches have been gaining increasing attention. The GCNs (Graph Convolutional Neural Networks) represent a promising solution since they encode the neighborhood information and have achieved state-of-the-art results on scenarios with limited labeled data. However, since GCNs require graph-structured data, their use for semi-supervised image classification is still scarce in the literature. In this work, we propose a novel approach, the Manifold-GCN, based on GCNs for semi-supervised image classification. The main hypothesis of this paper is that the use of manifold learning to model the graph structure can further improve the GCN classification. To the be",
    "path": "papers/23/04/2304.12492.json",
    "total_tokens": 872,
    "tldr": "本文提出了一种基于流形学习的图卷积神经网络（Manifold-GCN）的方法，用于半监督图像分类，该方法可以更好地处理有限标记数据情况下的图像分类问题。"
}