{
    "title": "Revenue Management without Demand Forecasting: A Data-Driven Approach for Bid Price Generation. (arXiv:2304.07391v1 [cs.LG])",
    "abstract": "Traditional revenue management relies on long and stable historical data and predictable demand patterns. However, meeting those requirements is not always possible. Many industries face demand volatility on an ongoing basis, an example would be air cargo which has much shorter booking horizon with highly variable batch arrivals. Even for passenger airlines where revenue management (RM) is well-established, reacting to external shocks is a well-known challenge that requires user monitoring and manual intervention. Moreover, traditional RM comes with strict data requirements including historical bookings and pricing even in the absence of any bookings, spanning multiple years. For companies that have not established a practice in RM, that type of extensive data is usually not available. We present a data-driven approach to RM which eliminates the need for demand forecasting and optimization techniques. We develop a methodology to generate bid prices using historical booking data only. O",
    "link": "http://arxiv.org/abs/2304.07391",
    "context": "Title: Revenue Management without Demand Forecasting: A Data-Driven Approach for Bid Price Generation. (arXiv:2304.07391v1 [cs.LG])\nAbstract: Traditional revenue management relies on long and stable historical data and predictable demand patterns. However, meeting those requirements is not always possible. Many industries face demand volatility on an ongoing basis, an example would be air cargo which has much shorter booking horizon with highly variable batch arrivals. Even for passenger airlines where revenue management (RM) is well-established, reacting to external shocks is a well-known challenge that requires user monitoring and manual intervention. Moreover, traditional RM comes with strict data requirements including historical bookings and pricing even in the absence of any bookings, spanning multiple years. For companies that have not established a practice in RM, that type of extensive data is usually not available. We present a data-driven approach to RM which eliminates the need for demand forecasting and optimization techniques. We develop a methodology to generate bid prices using historical booking data only. O",
    "path": "papers/23/04/2304.07391.json",
    "total_tokens": 839,
    "translated_title": "无需需求预测的收益管理：一种基于数据驱动的竞价价格生成方法",
    "translated_abstract": "传统收益管理依赖长期稳定的历史数据和可预测的需求模式。然而，满足这些需求并非总是可能的。许多行业都面临持续的需求波动，例如空中货运，它具有更短的预订周期和高度变化的批量到货。即使对于收入管理（RM）成熟的乘客航空公司，应对外部冲击也是一个众所周知的挑战，需要用户监控和手动干预。此外，传统的RM还要求有大量历史预订和价格数据，即使没有任何预订，也需跨越多年。对于没有建立RM惯例的公司来说，这种广泛的数据通常是不可获取的。我们提出了一种基于数据驱动的RM方法，该方法消除了需求预测和优化技术的需求。我们开发了一种方法，仅使用历史预订数据来生成竞价价格。",
    "tldr": "本论文提出了一种无需需求预测的基于数据驱动的收益管理方法，该方法能够仅使用历史预订数据来生成竞价价格。"
}