{
    "title": "Fast Diffusion Probabilistic Model Sampling through the lens of Backward Error Analysis. (arXiv:2304.11446v1 [cs.CV])",
    "abstract": "Denoising diffusion probabilistic models (DDPMs) are a class of powerful generative models. The past few years have witnessed the great success of DDPMs in generating high-fidelity samples. A significant limitation of the DDPMs is the slow sampling procedure. DDPMs generally need hundreds or thousands of sequential function evaluations (steps) of neural networks to generate a sample. This paper aims to develop a fast sampling method for DDPMs requiring much fewer steps while retaining high sample quality. The inference process of DDPMs approximates solving the corresponding diffusion ordinary differential equations (diffusion ODEs) in the continuous limit. This work analyzes how the backward error affects the diffusion ODEs and the sample quality in DDPMs. We propose fast sampling through the \\textbf{Restricting Backward Error schedule (RBE schedule)} based on dynamically moderating the long-time backward error. Our method accelerates DDPMs without any further training. Our experiments",
    "link": "http://arxiv.org/abs/2304.11446",
    "context": "Title: Fast Diffusion Probabilistic Model Sampling through the lens of Backward Error Analysis. (arXiv:2304.11446v1 [cs.CV])\nAbstract: Denoising diffusion probabilistic models (DDPMs) are a class of powerful generative models. The past few years have witnessed the great success of DDPMs in generating high-fidelity samples. A significant limitation of the DDPMs is the slow sampling procedure. DDPMs generally need hundreds or thousands of sequential function evaluations (steps) of neural networks to generate a sample. This paper aims to develop a fast sampling method for DDPMs requiring much fewer steps while retaining high sample quality. The inference process of DDPMs approximates solving the corresponding diffusion ordinary differential equations (diffusion ODEs) in the continuous limit. This work analyzes how the backward error affects the diffusion ODEs and the sample quality in DDPMs. We propose fast sampling through the \\textbf{Restricting Backward Error schedule (RBE schedule)} based on dynamically moderating the long-time backward error. Our method accelerates DDPMs without any further training. Our experiments",
    "path": "papers/23/04/2304.11446.json",
    "total_tokens": 943,
    "translated_title": "通过反向误差分析加速扩散概率模型采样",
    "translated_abstract": "去噪扩散概率模型（DDPM）是一类强大的生成模型。近年来，DDPM在生成高保真度样本方面取得了巨大成功。然而，DDPM的一个重大限制是采样速度慢。要生成一个样本，通常需要进行数百或数千次顺序神经网络的函数评估步骤。本文旨在为DDPM开发一种快速采样方法，只需要较少的步骤即可保持高质量的样本。DDPM的推断过程近似于连续极限中求解相应的扩散常微分方程（扩散ODE）。本文分析了反向误差如何影响扩散ODE和DDPM中的样本质量。我们提出了基于动态调节长时间反向误差的\\textbf{限制反向误差调度（RBE调度）}的快速采样方法。我们的方法不需要进一步的培训即可加速DDPM。",
    "tldr": "本文旨在开发一种用于去噪扩散概率模型（DDPM）的快速采样方法，只需要较少的步骤即可保持高质量的样本。我们提出了基于动态调节长时间反向误差的限制反向误差调度（RBE调度）的快速采样方法。",
    "en_tdlr": "This paper proposes a fast sampling method for denoising diffusion probabilistic models (DDPMs) that requires much fewer steps while maintaining high sample quality. The proposed method, called the Restricting Backward Error schedule (RBE schedule), is based on dynamically moderating the long-time backward error without further training."
}