{
    "title": "Model Based Reinforcement Learning for Personalized Heparin Dosing. (arXiv:2304.10000v1 [math.OC])",
    "abstract": "A key challenge in sequential decision making is optimizing systems safely under partial information. While much of the literature has focused on the cases of either partially known states or partially known dynamics, it is further exacerbated in cases where both states and dynamics are partially known. Computing heparin doses for patients fits this paradigm since the concentration of heparin in the patient cannot be measured directly and the rates at which patients metabolize heparin vary greatly between individuals. While many proposed solutions are model free, they require complex models and have difficulty ensuring safety. However, if some of the structure of the dynamics is known, a model based approach can be leveraged to provide safe policies. In this paper we propose such a framework to address the challenge of optimizing personalized heparin doses. We use a predictive model parameterized individually by patient to predict future therapeutic effects. We then leverage this model",
    "link": "http://arxiv.org/abs/2304.10000",
    "context": "Title: Model Based Reinforcement Learning for Personalized Heparin Dosing. (arXiv:2304.10000v1 [math.OC])\nAbstract: A key challenge in sequential decision making is optimizing systems safely under partial information. While much of the literature has focused on the cases of either partially known states or partially known dynamics, it is further exacerbated in cases where both states and dynamics are partially known. Computing heparin doses for patients fits this paradigm since the concentration of heparin in the patient cannot be measured directly and the rates at which patients metabolize heparin vary greatly between individuals. While many proposed solutions are model free, they require complex models and have difficulty ensuring safety. However, if some of the structure of the dynamics is known, a model based approach can be leveraged to provide safe policies. In this paper we propose such a framework to address the challenge of optimizing personalized heparin doses. We use a predictive model parameterized individually by patient to predict future therapeutic effects. We then leverage this model",
    "path": "papers/23/04/2304.10000.json",
    "total_tokens": 919,
    "translated_title": "基于模型的强化学习在个性化肝素剂量控制中的应用",
    "translated_abstract": "序贯决策问题中的一个关键挑战是在局部信息下安全地优化系统。计算患者的肝素剂量，由于无法直接测量患者血液中肝素的浓度，且不同患者代谢肝素的速率各不相同，因此具有部分可知的状态和动态。然而，若部分结构的动态是已知的，则可以通过模型基础的方法提供安全策略。本文提出了一种框架来优化个性化肝素剂量控制，通过个性化的预测模型预测未来治疗效果，并通过模型基础的强化学习来学习个性化肝素剂量控制策略。我们在重症监护室肝素控制数据集上评估了此方法的效果，与标准治疗和无模型方法相比，证明了其具有更好的安全性和功效。",
    "tldr": "本文提出了一种基于预测模型和模型基础的强化学习方法来解决个性化肝素剂量控制问题，相较于标准治疗和无模型方法具有更好的安全性和功效。",
    "en_tdlr": "This paper proposes a model-based approach using personalized predictive models and reinforcement learning to optimize personalized heparin dosing, achieving improved safety and efficacy compared to standard of care and model-free approaches."
}