{
    "title": "Look how they have grown: Non-destructive Leaf Detection and Size Estimation of Tomato Plants for 3D Growth Monitoring. (arXiv:2304.03610v1 [cs.CV])",
    "abstract": "Smart farming is a growing field as technology advances. Plant characteristics are crucial indicators for monitoring plant growth. Research has been done to estimate characteristics like leaf area index, leaf disease, and plant height. However, few methods have been applied to non-destructive measurements of leaf size. In this paper, an automated non-destructive imaged-based measuring system is presented, which uses 2D and 3D data obtained using a Zivid 3D camera, creating 3D virtual representations (digital twins) of the tomato plants. Leaves are detected from corresponding 2D RGB images and mapped to their 3D point cloud using the detected leaf masks, which then pass the leaf point cloud to the plane fitting algorithm to extract the leaf size to provide data for growth monitoring. The performance of the measurement platform has been measured through a comprehensive trial on real-world tomato plants with quantified performance metrics compared to ground truth measurements. Three tomat",
    "link": "http://arxiv.org/abs/2304.03610",
    "context": "Title: Look how they have grown: Non-destructive Leaf Detection and Size Estimation of Tomato Plants for 3D Growth Monitoring. (arXiv:2304.03610v1 [cs.CV])\nAbstract: Smart farming is a growing field as technology advances. Plant characteristics are crucial indicators for monitoring plant growth. Research has been done to estimate characteristics like leaf area index, leaf disease, and plant height. However, few methods have been applied to non-destructive measurements of leaf size. In this paper, an automated non-destructive imaged-based measuring system is presented, which uses 2D and 3D data obtained using a Zivid 3D camera, creating 3D virtual representations (digital twins) of the tomato plants. Leaves are detected from corresponding 2D RGB images and mapped to their 3D point cloud using the detected leaf masks, which then pass the leaf point cloud to the plane fitting algorithm to extract the leaf size to provide data for growth monitoring. The performance of the measurement platform has been measured through a comprehensive trial on real-world tomato plants with quantified performance metrics compared to ground truth measurements. Three tomat",
    "path": "papers/23/04/2304.03610.json",
    "total_tokens": 1156,
    "translated_title": "番茄植株的非破坏性叶片检测和大小估计的三维生长监测",
    "translated_abstract": "随着技术的进步，智慧农业成为了一个不断增长的领域。植物特征是监测植物生长的重要指标。先前的研究已经用于估算像叶面积指数、叶片疾病和植株高度等特征。然而，很少有方法应用于非破坏性的叶片大小测量。本文介绍了一种自动化非破坏性图像测量系统，该系统使用Zivid 3D相机获取的2D和3D数据，创建番茄植株的3D虚拟表示（数字双胞胎）。叶子是从对应的2D RGB图像中检测到的，并且使用检测到的叶片掩模将它们映射到它们的3D点云上，然后将叶子点云传送到平面拟合算法中提取叶片大小，为生长监测提供数据。通过对现实世界的番茄植株进行全面试验并将其性能指标与基准测量进行比较，测量平台的性能得到了评估。分析了三个番茄植株的生长阶段，结果显示在估计叶子大小和植株高度方面具有高的精度。所提出的方法对于精准农业和温室管理中的非破坏性植物生长监测具有巨大的潜力。",
    "tldr": "本文提出了一种基于图像的自动化非破坏性测量系统，利用Zivid 3D相机创建番茄植株的3D虚拟表示，通过检测叶片掩模提取叶片大小，实现了对植物生长的精准监测，有望应用于精准农业和温室管理领域。",
    "en_tdlr": "This paper proposes an automated non-destructive imaging-based measuring system for tomato plants, using a Zivid 3D camera to create 3D virtual representations and extracting leaf size through detected leaf masks, providing accurate monitoring of plant growth with potential applications in precision agriculture and greenhouse management."
}