{
    "title": "Understanding Reinforcement Learning Algorithms: The Progress from Basic Q-learning to Proximal Policy Optimization. (arXiv:2304.00026v1 [cs.LG])",
    "abstract": "This paper presents a review of the field of reinforcement learning (RL), with a focus on providing a comprehensive overview of the key concepts, techniques, and algorithms for beginners. RL has a unique setting, jargon, and mathematics that can be intimidating for those new to the field or artificial intelligence more broadly. While many papers review RL in the context of specific applications, such as games, healthcare, finance, or robotics, these papers can be difficult for beginners to follow due to the inclusion of non-RL-related work and the use of algorithms customized to those specific applications. To address these challenges, this paper provides a clear and concise overview of the fundamental principles of RL and covers the different types of RL algorithms. For each algorithm/method, we outline the main motivation behind its development, its inner workings, and its limitations. The presentation of the paper is aligned with the historical progress of the field, from the early ",
    "link": "http://arxiv.org/abs/2304.00026",
    "context": "Title: Understanding Reinforcement Learning Algorithms: The Progress from Basic Q-learning to Proximal Policy Optimization. (arXiv:2304.00026v1 [cs.LG])\nAbstract: This paper presents a review of the field of reinforcement learning (RL), with a focus on providing a comprehensive overview of the key concepts, techniques, and algorithms for beginners. RL has a unique setting, jargon, and mathematics that can be intimidating for those new to the field or artificial intelligence more broadly. While many papers review RL in the context of specific applications, such as games, healthcare, finance, or robotics, these papers can be difficult for beginners to follow due to the inclusion of non-RL-related work and the use of algorithms customized to those specific applications. To address these challenges, this paper provides a clear and concise overview of the fundamental principles of RL and covers the different types of RL algorithms. For each algorithm/method, we outline the main motivation behind its development, its inner workings, and its limitations. The presentation of the paper is aligned with the historical progress of the field, from the early ",
    "path": "papers/23/04/2304.00026.json",
    "total_tokens": 995,
    "translated_title": "理解强化学习算法：从基础 Q-learning 到相对策略优化的进展",
    "translated_abstract": "本文综述了强化学习领域，重点全面介绍了初学者所需的关键概念、技术和算法。强化学习具有独特的设置、术语和数学，对于新手或人工智能领域的人来说可能会感到吓人。尽管许多论文在特定应用上回顾了强化学习，如游戏、医疗保健、金融或机器人技术，但由于包括非强化学习相关工作和使用针对这些特定应用定制的算法，这些论文可能难以让初学者跟随。为解决这些挑战，本文清晰而简明地介绍了强化学习的基本原理，并涵盖了不同类型的强化学习算法。对于每个算法/方法，我们概述了其开发背后的主要动机、内部机制和限制。本文的呈现与该领域的历史进展相一致，从早期的 Q-learning 算法到更近期的相对策略优化 (PPO)算法。",
    "tldr": "本文综述了强化学习领域，对初学者介绍了关键概念、技术和算法，并全面涵盖了不同类型的强化学习算法，呈现了该领域的历史进展。",
    "en_tdlr": "This paper provides a comprehensive overview of the key concepts, techniques, and algorithms in the field of reinforcement learning (RL), with a focus on beginners. It covers different types of RL algorithms and outlines their main motivation, inner workings, and limitations. The presentation is aligned with the historical progress of the field from Q-learning algorithm to more recent Proximal Policy Optimization (PPO) algorithm."
}