{
    "title": "CLVOS23: A Long Video Object Segmentation Dataset for Continual Learning. (arXiv:2304.04259v1 [cs.CV])",
    "abstract": "Continual learning in real-world scenarios is a major challenge. A general continual learning model should have a constant memory size and no predefined task boundaries, as is the case in semi-supervised Video Object Segmentation (VOS), where continual learning challenges particularly present themselves in working on long video sequences. In this article, we first formulate the problem of semi-supervised VOS, specifically online VOS, as a continual learning problem, and then secondly provide a public VOS dataset, CLVOS23, focusing on continual learning. Finally, we propose and implement a regularization-based continual learning approach on LWL, an existing online VOS baseline, to demonstrate the efficacy of continual learning when applied to online VOS and to establish a CLVOS23 baseline. We apply the proposed baseline to the Long Videos dataset as well as to two short video VOS datasets, DAVIS16 and DAVIS17. To the best of our knowledge, this is the first time that VOS has been define",
    "link": "http://arxiv.org/abs/2304.04259",
    "context": "Title: CLVOS23: A Long Video Object Segmentation Dataset for Continual Learning. (arXiv:2304.04259v1 [cs.CV])\nAbstract: Continual learning in real-world scenarios is a major challenge. A general continual learning model should have a constant memory size and no predefined task boundaries, as is the case in semi-supervised Video Object Segmentation (VOS), where continual learning challenges particularly present themselves in working on long video sequences. In this article, we first formulate the problem of semi-supervised VOS, specifically online VOS, as a continual learning problem, and then secondly provide a public VOS dataset, CLVOS23, focusing on continual learning. Finally, we propose and implement a regularization-based continual learning approach on LWL, an existing online VOS baseline, to demonstrate the efficacy of continual learning when applied to online VOS and to establish a CLVOS23 baseline. We apply the proposed baseline to the Long Videos dataset as well as to two short video VOS datasets, DAVIS16 and DAVIS17. To the best of our knowledge, this is the first time that VOS has been define",
    "path": "papers/23/04/2304.04259.json",
    "total_tokens": 911,
    "translated_title": "CLVOS23：用于持续学习的长视频对象分割数据集",
    "translated_abstract": "真实场景下的持续学习是一个重大挑战。通常的持续学习模型应具有恒定的记忆大小和无预定义的任务边界，而这种情况在半监督视频对象分割（VOS）中尤为明显，其中持续学习的挑战主要体现在处理长视频序列上。本文首先将半监督VOS问题，特别是在线VOS问题，形式化为持续学习问题，然后提供一个公共VOS数据集CLVOS23，重点关注持续学习。最后，我们提出并实现了一个基于正则化的持续学习方法在现有的在线VOS基线LWL上，以展示持续学习在应用于在线VOS时的有效性，并建立了一个CLVOS23基线。我们将所提出的基线应用于长视频数据集以及两个短视频VOS数据集DAVIS16和DAVIS17。据我们所知，这是VOS首次被定义为持续学习问题并构建基线。",
    "tldr": "本文提出用于持续学习的长视频对象分割数据集CLVOS23，并在此基础上实现了一个基于正则化的持续学习方法，以应对半监督视频对象分割中的持续学习挑战。",
    "en_tdlr": "This paper proposes a CLVOS23 dataset for continual learning in semi-supervised Video Object Segmentation, and implements a regularization-based continual learning approach on LWL to address the challenge of continual learning in online VOS."
}