{
    "title": "Participatory Design of AI with Children: Reflections on IDC Design Challenge. (arXiv:2304.09091v1 [cs.HC])",
    "abstract": "Children growing up in the era of Artificial Intelligence (AI) will be most impacted by the technology across their life span. Participatory Design (PD) is widely adopted by the Interaction Design and Children (IDC) community, which empowers children to bring their interests, needs, and creativity to the design process of future technologies. While PD has drawn increasing attention to human-centered AI design, it remains largely untapped in facilitating the design process of AI technologies relevant to children and their community. In this paper, we report intriguing children's design ideas on AI technologies resulting from the \"Research and Design Challenge\" of the 22nd ACM Interaction Design and Children (IDC 2023) conference. The diversity of design problems, AI applications and capabilities revealed by the children's design ideas shed light on the potential of engaging children in PD activities for future AI technologies. We discuss opportunities and challenges for accessible and i",
    "link": "http://arxiv.org/abs/2304.09091",
    "context": "Title: Participatory Design of AI with Children: Reflections on IDC Design Challenge. (arXiv:2304.09091v1 [cs.HC])\nAbstract: Children growing up in the era of Artificial Intelligence (AI) will be most impacted by the technology across their life span. Participatory Design (PD) is widely adopted by the Interaction Design and Children (IDC) community, which empowers children to bring their interests, needs, and creativity to the design process of future technologies. While PD has drawn increasing attention to human-centered AI design, it remains largely untapped in facilitating the design process of AI technologies relevant to children and their community. In this paper, we report intriguing children's design ideas on AI technologies resulting from the \"Research and Design Challenge\" of the 22nd ACM Interaction Design and Children (IDC 2023) conference. The diversity of design problems, AI applications and capabilities revealed by the children's design ideas shed light on the potential of engaging children in PD activities for future AI technologies. We discuss opportunities and challenges for accessible and i",
    "path": "papers/23/04/2304.09091.json",
    "total_tokens": 897,
    "tldr": "本文介绍了来自交互设计和儿童社区的参与设计（PD）挑战的儿童人工智能（AI）技术设计想法，这些想法揭示了儿童参与设计未来AI技术的潜力。"
}