{
    "title": "Motion Capture Benchmark of Real Industrial Tasks and Traditional Crafts for Human Movement Analysis. (arXiv:2304.03771v1 [cs.RO])",
    "abstract": "Human movement analysis is a key area of research in robotics, biomechanics, and data science. It encompasses tracking, posture estimation, and movement synthesis. While numerous methodologies have evolved over time, a systematic and quantitative evaluation of these approaches using verifiable ground truth data of three-dimensional human movement is still required to define the current state of the art. This paper presents seven datasets recorded using inertial-based motion capture. The datasets contain professional gestures carried out by industrial operators and skilled craftsmen performed in real conditions in-situ. The datasets were created with the intention of being used for research in human motion modeling, analysis, and generation. The protocols for data collection are described in detail, and a preliminary analysis of the collected data is provided as a benchmark. The Gesture Operational Model, a hybrid stochastic-biomechanical approach based on kinematic descriptors, is util",
    "link": "http://arxiv.org/abs/2304.03771",
    "context": "Title: Motion Capture Benchmark of Real Industrial Tasks and Traditional Crafts for Human Movement Analysis. (arXiv:2304.03771v1 [cs.RO])\nAbstract: Human movement analysis is a key area of research in robotics, biomechanics, and data science. It encompasses tracking, posture estimation, and movement synthesis. While numerous methodologies have evolved over time, a systematic and quantitative evaluation of these approaches using verifiable ground truth data of three-dimensional human movement is still required to define the current state of the art. This paper presents seven datasets recorded using inertial-based motion capture. The datasets contain professional gestures carried out by industrial operators and skilled craftsmen performed in real conditions in-situ. The datasets were created with the intention of being used for research in human motion modeling, analysis, and generation. The protocols for data collection are described in detail, and a preliminary analysis of the collected data is provided as a benchmark. The Gesture Operational Model, a hybrid stochastic-biomechanical approach based on kinematic descriptors, is util",
    "path": "papers/23/04/2304.03771.json",
    "total_tokens": 909,
    "translated_title": "用于人体运动分析的真实工业任务和传统手工艺的动作捕捉基准测试",
    "translated_abstract": "人体运动分析是机器人技术、生物力学和数据科学研究领域的一个关键领域，包括跟踪、姿态估计和运动合成。虽然随着时间的推移，出现了许多方法，但仍需要使用可验证的三维人体运动基准数据对这些方法进行系统和定量的评估，以定义当前技术水平的现状。本文介绍了使用基于惯性的动作捕捉技术记录的七个数据集。数据集包含在实际条件下由工业操作员和熟练的手艺人员执行的专业动作。数据集旨在用于人体运动建模、分析和生成领域的研究。详细描述了数据采集协议，并提供了收集数据的初步分析作为基准测试。Gesture Operational Model是一种基于运动描述符的混合随机-生物力学方法。",
    "tldr": "本文提供了使用惯性动作捕捉技术记录的工业操作员和手艺人员真实工作中的专业动作的七个数据集，可用于人体运动建模、分析和生成的研究。同时，本文提供了Gesture Operational Model作为方法的初步基准测试。",
    "en_tdlr": "This paper provides seven datasets recorded using inertial-based motion capture of professional gestures carried out by industrial operators and skilled craftsmen performed in real conditions in-situ, which can be used for research in human motion modeling, analysis, and generation. The Gesture Operational Model is also presented as a preliminary benchmark test for the methodology based on kinematic descriptors."
}