{
    "title": "Mimic-IV-ICD: A new benchmark for eXtreme MultiLabel Classification. (arXiv:2304.13998v1 [cs.AI])",
    "abstract": "Clinical notes are assigned ICD codes - sets of codes for diagnoses and procedures. In the recent years, predictive machine learning models have been built for automatic ICD coding. However, there is a lack of widely accepted benchmarks for automated ICD coding models based on large-scale public EHR data.  This paper proposes a public benchmark suite for ICD-10 coding using a large EHR dataset derived from MIMIC-IV, the most recent public EHR dataset. We implement and compare several popular methods for ICD coding prediction tasks to standardize data preprocessing and establish a comprehensive ICD coding benchmark dataset. This approach fosters reproducibility and model comparison, accelerating progress toward employing automated ICD coding in future studies. Furthermore, we create a new ICD-9 benchmark using MIMIC-IV data, providing more data points and a higher number of ICD codes than MIMIC-III. Our open-source code offers easy access to data processing steps, benchmark creation, an",
    "link": "http://arxiv.org/abs/2304.13998",
    "context": "Title: Mimic-IV-ICD: A new benchmark for eXtreme MultiLabel Classification. (arXiv:2304.13998v1 [cs.AI])\nAbstract: Clinical notes are assigned ICD codes - sets of codes for diagnoses and procedures. In the recent years, predictive machine learning models have been built for automatic ICD coding. However, there is a lack of widely accepted benchmarks for automated ICD coding models based on large-scale public EHR data.  This paper proposes a public benchmark suite for ICD-10 coding using a large EHR dataset derived from MIMIC-IV, the most recent public EHR dataset. We implement and compare several popular methods for ICD coding prediction tasks to standardize data preprocessing and establish a comprehensive ICD coding benchmark dataset. This approach fosters reproducibility and model comparison, accelerating progress toward employing automated ICD coding in future studies. Furthermore, we create a new ICD-9 benchmark using MIMIC-IV data, providing more data points and a higher number of ICD codes than MIMIC-III. Our open-source code offers easy access to data processing steps, benchmark creation, an",
    "path": "papers/23/04/2304.13998.json",
    "total_tokens": 1003,
    "translated_title": "Mimic-IV-ICD：一种新的极端多标签分类基准",
    "translated_abstract": "临床笔记被分配ICD代码，这是一组诊断和操作代码。近年来，已经构建了预测性机器学习模型，用于自动ICD编码。然而，基于大规模公共电子病历数据的自动化ICD编码模型缺乏广泛接受的基准。本文提出了一个公共基准套件，使用从最近的公共电子病历数据集MIMIC-IV衍生的大型电子病历数据集进行ICD-10编码。我们实施了并比较了几种流行的ICD编码预测任务方法，以标准化数据预处理并建立全面的ICD编码基准数据集。这种方法促进了可重复性和模型比较，加速了将自动化ICD编码应用于未来研究领域的进展。此外，我们使用MIMIC-IV数据创建了一个新的ICD-9基准，提供了比MIMIC-III更多的数据点和更多的ICD代码。我们的开源代码提供了易于访问的数据处理步骤、基准创建和模型评估，推动了自动ICD编码模型开发中的透明度和合作。",
    "tldr": "本文提出了一个公共基准套件，使用大型公共电子病历数据集进行ICD-10编码。该方法标准化数据预处理并建立全面的ICD编码基准数据集，促进了自动化ICD编码在未来研究领域的应用。",
    "en_tdlr": "This paper proposes a public benchmark suite for ICD-10 coding using a large EHR dataset derived from MIMIC-IV, establishes a comprehensive ICD coding benchmark dataset, and fosters progress toward employing automated ICD coding in future studies."
}