{
    "title": "Measuring Discrete Risks on Infinite Domains: Theoretical Foundations, Conditional Five Number Summaries, and Data Analyses. (arXiv:2304.02723v1 [stat.AP])",
    "abstract": "To accommodate numerous practical scenarios, in this paper we extend statistical inference for smoothed quantile estimators from finite domains to infinite domains. We accomplish the task with the help of a newly designed truncation methodology for discrete loss distributions with infinite domains. A simulation study illustrates the methodology in the case of several distributions, such as Poisson, negative binomial, and their zero inflated versions, which are commonly used in insurance industry to model claim frequencies. Additionally, we propose a very flexible bootstrap-based approach for the use in practice. Using automobile accident data and their modifications, we compute what we have termed the conditional five number summary (C5NS) for the tail risk and construct confidence intervals for each of the five quantiles making up C5NS, and then calculate the tail probabilities. The results show that the smoothed quantile approach classifies the tail riskiness of portfolios not only m",
    "link": "http://arxiv.org/abs/2304.02723",
    "context": "Title: Measuring Discrete Risks on Infinite Domains: Theoretical Foundations, Conditional Five Number Summaries, and Data Analyses. (arXiv:2304.02723v1 [stat.AP])\nAbstract: To accommodate numerous practical scenarios, in this paper we extend statistical inference for smoothed quantile estimators from finite domains to infinite domains. We accomplish the task with the help of a newly designed truncation methodology for discrete loss distributions with infinite domains. A simulation study illustrates the methodology in the case of several distributions, such as Poisson, negative binomial, and their zero inflated versions, which are commonly used in insurance industry to model claim frequencies. Additionally, we propose a very flexible bootstrap-based approach for the use in practice. Using automobile accident data and their modifications, we compute what we have termed the conditional five number summary (C5NS) for the tail risk and construct confidence intervals for each of the five quantiles making up C5NS, and then calculate the tail probabilities. The results show that the smoothed quantile approach classifies the tail riskiness of portfolios not only m",
    "path": "papers/23/04/2304.02723.json",
    "total_tokens": 992,
    "translated_title": "无限域上离散风险的测量：理论基础、条件五数摘要和数据分析",
    "translated_abstract": "为了适应众多实际情况，本文将平滑分位数估计的统计推断从有限域扩展到无限域。我们通过新设计的离散损失分布截断方法完成此任务。模拟研究展示了这种方法在几种分布（如泊松分布、负二项分布及其零膨胀版本）中的应用，这些分布通常用于模拟保险业中的索赔频率。此外，我们提出了一种非常灵活的基于自助法的方法，用于实际中的应用。我们使用汽车事故数据及其修改，计算构成条件五数摘要（C5NS）的五个分位数的置信区间，并计算尾部概率。结果表明，平滑分位数方法不仅分类投资组合的尾部风险性，还可对其进行分类。",
    "tldr": "本文提出了一种新的离散损失分布截断方法，将平滑分位数估计的统计推断从有限域扩展到无限域。并提出一种基于自助法的灵活方法，用于实际中的应用。此外，我们计算了构成条件五数摘要（C5NS）的五个分位数的置信区间，并计算尾部概率，结果表明，平滑分位数方法不仅分类投资组合的尾部风险性，还可对其进行分类。"
}