{
    "title": "Side Channel-Assisted Inference Leakage from Machine Learning-based ECG Classification. (arXiv:2304.01990v1 [cs.CR])",
    "abstract": "The Electrocardiogram (ECG) measures the electrical cardiac activity generated by the heart to detect abnormal heartbeat and heart attack. However, the irregular occurrence of the abnormalities demands continuous monitoring of heartbeats. Machine learning techniques are leveraged to automate the task to reduce labor work needed during monitoring. In recent years, many companies have launched products with ECG monitoring and irregular heartbeat alert. Among all classification algorithms, the time series-based algorithm dynamic time warping (DTW) is widely adopted to undertake the ECG classification task. Though progress has been achieved, the DTW-based ECG classification also brings a new attacking vector of leaking the patients' diagnosis results. This paper shows that the ECG input samples' labels can be stolen via a side-channel attack, Flush+Reload. In particular, we first identify the vulnerability of DTW for ECG classification, i.e., the correlation between warping path choice and",
    "link": "http://arxiv.org/abs/2304.01990",
    "context": "Title: Side Channel-Assisted Inference Leakage from Machine Learning-based ECG Classification. (arXiv:2304.01990v1 [cs.CR])\nAbstract: The Electrocardiogram (ECG) measures the electrical cardiac activity generated by the heart to detect abnormal heartbeat and heart attack. However, the irregular occurrence of the abnormalities demands continuous monitoring of heartbeats. Machine learning techniques are leveraged to automate the task to reduce labor work needed during monitoring. In recent years, many companies have launched products with ECG monitoring and irregular heartbeat alert. Among all classification algorithms, the time series-based algorithm dynamic time warping (DTW) is widely adopted to undertake the ECG classification task. Though progress has been achieved, the DTW-based ECG classification also brings a new attacking vector of leaking the patients' diagnosis results. This paper shows that the ECG input samples' labels can be stolen via a side-channel attack, Flush+Reload. In particular, we first identify the vulnerability of DTW for ECG classification, i.e., the correlation between warping path choice and",
    "path": "papers/23/04/2304.01990.json",
    "total_tokens": 875,
    "translated_title": "基于机器学习的心电图分类中的侧信道攻击泄露",
    "translated_abstract": "心电图（ECG）测量由心脏产生的电性心脏活动，以检测异常心脏跳动和心脏病发作。然而，异常发生的不规则性要求对心跳进行持续监测。机器学习技术被利用来自动化任务，以减少监测过程中所需的工作量。近年来，许多公司推出了带有ECG监测和异常心跳警报功能的产品。在所有分类算法中，基于时间序列的算法动态时间规整（DTW）被广泛采用来执行ECG分类任务。尽管取得了进展，但基于DTW的ECG分类也带来了一个新的攻击向量，即泄露患者的诊断结果。本文展示了通过侧信道攻击Flush+Reload可以窃取ECG输入样本的标签。特别地，我们首先确认了ECG分类中DTW的漏洞，即变形路径选择与ECG的分类结果相关联。",
    "tldr": "本文研究了基于机器学习的心电图分类的DTW算法中的侧信道攻击问题，揭示了标签信息可以通过Flush+Reload攻击进行窃取。",
    "en_tdlr": "This paper investigates the side-channel attack issue in the DTW algorithm for machine learning-based ECG classification, and demonstrates that label information can be stolen through the Flush+Reload attack."
}