{
    "title": "API-Bank: A Comprehensive Benchmark for Tool-Augmented LLMs. (arXiv:2304.08244v2 [cs.CL] UPDATED)",
    "abstract": "Recent research has demonstrated that Large Language Models (LLMs) can enhance their capabilities by utilizing external tools. However, three pivotal questions remain unanswered: (1) How effective are current LLMs in utilizing tools? (2) How can we enhance LLMs' ability to utilize tools? (3) What obstacles need to be overcome to leverage tools? To address these questions, we introduce API-Bank, a groundbreaking benchmark, specifically designed for tool-augmented LLMs. For the first question, we develop a runnable evaluation system consisting of 73 API tools. We annotate 314 tool-use dialogues with 753 API calls to assess the existing LLMs' capabilities in planning, retrieving, and calling APIs. For the second question, we construct a comprehensive training set containing 1,888 tool-use dialogues from 2,138 APIs spanning 1,000 distinct domains. Using this dataset, we train Lynx, a tool-augmented LLM initialized from Alpaca. Experimental results demonstrate that GPT-3.5 exhibits improved",
    "link": "http://arxiv.org/abs/2304.08244",
    "context": "Title: API-Bank: A Comprehensive Benchmark for Tool-Augmented LLMs. (arXiv:2304.08244v2 [cs.CL] UPDATED)\nAbstract: Recent research has demonstrated that Large Language Models (LLMs) can enhance their capabilities by utilizing external tools. However, three pivotal questions remain unanswered: (1) How effective are current LLMs in utilizing tools? (2) How can we enhance LLMs' ability to utilize tools? (3) What obstacles need to be overcome to leverage tools? To address these questions, we introduce API-Bank, a groundbreaking benchmark, specifically designed for tool-augmented LLMs. For the first question, we develop a runnable evaluation system consisting of 73 API tools. We annotate 314 tool-use dialogues with 753 API calls to assess the existing LLMs' capabilities in planning, retrieving, and calling APIs. For the second question, we construct a comprehensive training set containing 1,888 tool-use dialogues from 2,138 APIs spanning 1,000 distinct domains. Using this dataset, we train Lynx, a tool-augmented LLM initialized from Alpaca. Experimental results demonstrate that GPT-3.5 exhibits improved",
    "path": "papers/23/04/2304.08244.json",
    "total_tokens": 947,
    "translated_title": "API-Bank: 一种针对工具增强的大型语言模型的全面基准测试",
    "translated_abstract": "最近的研究表明，大型语言模型（LLMs）可以通过利用外部工具来增强其能力。然而，仍然存在三个关键问题尚未解答：（1）目前的LLMs在利用工具方面的效果如何？（2）如何增强LLMs利用工具的能力？（3）如何克服利用工具所面临的障碍？为了解决这些问题，我们引入了API-Bank，一个具有突破性意义的基准测试，专门为工具增强的LLMs设计。针对第一个问题，我们开发了一个可运行的评估系统，包含73个API工具。我们使用753个API调用注释了314个工具使用对话，以评估现有LLMs在规划、检索和调用API方面的能力。针对第二个问题，我们构建了一个包含来自1,000个不同领域的2,138个API的1,888个工具使用对话的全面训练集。使用这个数据集，我们训练了Lynx，这是一个从Alpaca初始化的工具增强LLM。实验结果表明，GPT-3.5显示出了改进的能力。",
    "tldr": "API-Bank是一个针对工具增强的大型语言模型的基准测试，通过解决三个关键问题来评估LLMs的能力，并展示了GPT-3.5的改进能力。"
}