{
    "title": "Structured Multifractal Scaling of the Principal Cryptocurrencies: Examination using a Self-Explainable Machine Learning. (arXiv:2304.08440v1 [q-fin.ST])",
    "abstract": "Multifractal analysis is a forecasting technique used to study the scaling regularity properties of financial returns, to analyze the long-term memory and predictability of financial markets. In this paper, we propose a novel structural detrended multifractal fluctuation analysis (S-MF-DFA) to investigate the efficiency of the main cryptocurrencies. The new methodology generalizes the conventional approach by allowing it to proceed on the different fluctuation regimes previously determined using a change-points detection test. In this framework, the characterization of the various exogenous factors influencing the scaling behavior is performed on the basis of a single-factor model, thus creating a kind of self-explainable machine learning for price forecasting. The proposal is tested on the daily data of the three among the main cryptocurrencies in order to examine whether the digital market has experienced upheavals in recent years and whether this has in some ways led to a structured",
    "link": "http://arxiv.org/abs/2304.08440",
    "context": "Title: Structured Multifractal Scaling of the Principal Cryptocurrencies: Examination using a Self-Explainable Machine Learning. (arXiv:2304.08440v1 [q-fin.ST])\nAbstract: Multifractal analysis is a forecasting technique used to study the scaling regularity properties of financial returns, to analyze the long-term memory and predictability of financial markets. In this paper, we propose a novel structural detrended multifractal fluctuation analysis (S-MF-DFA) to investigate the efficiency of the main cryptocurrencies. The new methodology generalizes the conventional approach by allowing it to proceed on the different fluctuation regimes previously determined using a change-points detection test. In this framework, the characterization of the various exogenous factors influencing the scaling behavior is performed on the basis of a single-factor model, thus creating a kind of self-explainable machine learning for price forecasting. The proposal is tested on the daily data of the three among the main cryptocurrencies in order to examine whether the digital market has experienced upheavals in recent years and whether this has in some ways led to a structured",
    "path": "papers/23/04/2304.08440.json",
    "total_tokens": 948,
    "translated_title": "主要加密货币的结构化多重分形特性的研究：使用可自解释机器学习进行检验",
    "translated_abstract": "多重分形分析是一种用于研究金融回报的缩放规律特性、分析金融市场的长期记忆性和可预测性的预测技术。本文提出了一种新的结构化去趋势多重分形波动分析（S-MF-DFA），以研究主要加密货币的效率。新的方法通过使用变点检测测试确定不同波动区间进行推广，从而泛化了传统方法。在这个框架中，基于单因素模型进行各种影响缩放行为的外生因素的表征，从而为价格预测创建了一种自解释的机器学习模型。该模型在主要加密货币的日度数据上进行了测试，以检验数字市场在近年来是否经历过震荡，并且这是否以某种方式导致了加密货币的结构化多重分形特性。",
    "tldr": "本文提出了一种新的结构化去趋势多重分形波动分析（S-MF-DFA）方法，用于研究加密货币的效率。该方法基于单因素模型进行外生因素的表征，从而创建了一种自解释的机器学习模型，用于加密货币价格预测。"
}