{
    "title": "Retention Is All You Need. (arXiv:2304.03103v1 [cs.AI])",
    "abstract": "Skilled employees are usually seen as the most important pillar of an organization. Despite this, most organizations face high attrition and turnover rates. While several machine learning models have been developed for analyzing attrition and its causal factors, the interpretations of those models remain opaque. In this paper, we propose the HR-DSS approach, which stands for Human Resource Decision Support System, and uses explainable AI for employee attrition problems. The system is designed to assist human resource departments in interpreting the predictions provided by machine learning models. In our experiments, eight machine learning models are employed to provide predictions, and the results achieved by the best-performing model are further processed by the SHAP explainability process. We optimize both the correctness and explanation of the results. Furthermore, using \"What-if-analysis\", we aim to observe plausible causes for attrition of an individual employee. The results show ",
    "link": "http://arxiv.org/abs/2304.03103",
    "context": "Title: Retention Is All You Need. (arXiv:2304.03103v1 [cs.AI])\nAbstract: Skilled employees are usually seen as the most important pillar of an organization. Despite this, most organizations face high attrition and turnover rates. While several machine learning models have been developed for analyzing attrition and its causal factors, the interpretations of those models remain opaque. In this paper, we propose the HR-DSS approach, which stands for Human Resource Decision Support System, and uses explainable AI for employee attrition problems. The system is designed to assist human resource departments in interpreting the predictions provided by machine learning models. In our experiments, eight machine learning models are employed to provide predictions, and the results achieved by the best-performing model are further processed by the SHAP explainability process. We optimize both the correctness and explanation of the results. Furthermore, using \"What-if-analysis\", we aim to observe plausible causes for attrition of an individual employee. The results show ",
    "path": "papers/23/04/2304.03103.json",
    "total_tokens": 862,
    "translated_title": "留住人才是最重要的，使用可解释的AI来解决员工离职问题",
    "translated_abstract": "熟练的员工通常被视为组织的最重要支柱。尽管如此，大多数组织都面临着高离职率和流失率。虽然已经开发了几种机器学习模型用于分析离职及其原因，但这些模型的解释仍然不透明。本文提出了HR-DSS方法，即人力资源决策支持系统，使用可解释的AI解决员工流失问题。该系统旨在帮助人力资源部门解释机器学习模型提供的预测结果。在我们的实验中，使用了八种机器学习模型进行预测，并且最佳表现的模型的结果进一步经过了SHAP解释性过程的处理。我们优化了结果的正确性和解释性。此外，我们还使用“What-if-analysis”来观察个体员工可能导致离职的原因。",
    "tldr": "本研究提出了HR-DSS方法，使用可解释的AI帮助人力资源部门解释机器学习模型提供的员工流失预测结果，并且提供“What-if-analysis”来观察个体员工可能导致离职的原因。",
    "en_tdlr": "This paper proposes the HR-DSS approach, which uses explainable AI to help human resource departments interpret the predictions provided by machine learning models for employee attrition problems. The method provides \"What-if-analysis\" to observe plausible causes for attrition of an individual employee."
}