{
    "title": "Implicit representation priors meet Riemannian geometry for Bayesian robotic grasping. (arXiv:2304.08805v1 [cs.RO])",
    "abstract": "Robotic grasping in highly noisy environments presents complex challenges, especially with limited prior knowledge about the scene. In particular, identifying good grasping poses with Bayesian inference becomes difficult due to two reasons: i) generating data from uninformative priors proves to be inefficient, and ii) the posterior often entails a complex distribution defined on a Riemannian manifold. In this study, we explore the use of implicit representations to construct scene-dependent priors, thereby enabling the application of efficient simulation-based Bayesian inference algorithms for determining successful grasp poses in unstructured environments. Results from both simulation and physical benchmarks showcase the high success rate and promising potential of this approach.",
    "link": "http://arxiv.org/abs/2304.08805",
    "context": "Title: Implicit representation priors meet Riemannian geometry for Bayesian robotic grasping. (arXiv:2304.08805v1 [cs.RO])\nAbstract: Robotic grasping in highly noisy environments presents complex challenges, especially with limited prior knowledge about the scene. In particular, identifying good grasping poses with Bayesian inference becomes difficult due to two reasons: i) generating data from uninformative priors proves to be inefficient, and ii) the posterior often entails a complex distribution defined on a Riemannian manifold. In this study, we explore the use of implicit representations to construct scene-dependent priors, thereby enabling the application of efficient simulation-based Bayesian inference algorithms for determining successful grasp poses in unstructured environments. Results from both simulation and physical benchmarks showcase the high success rate and promising potential of this approach.",
    "path": "papers/23/04/2304.08805.json",
    "total_tokens": 763,
    "translated_title": "基于黎曼几何与隐式表示先验的贝叶斯机器人抓取方法",
    "translated_abstract": "在高噪声环境下进行机器人抓取面临着复杂的挑战，尤其是在缺乏场景先验知识的情况下。具体来说，由于两个原因，用贝叶斯推理来识别良好的抓取姿态变得困难：i）从无信息的先验生成数据效率低下，ii）后验通常在黎曼流形上定义一个复杂分布。在本研究中，我们探讨了使用隐式表示构建场景相关性先验的方法，从而使得在不规则环境中应用基于模拟的高效贝叶斯推理算法来确定成功的抓取姿态成为可能。模拟和物理基准测试的结果展示了这种方法的高成功率和良好潜力。",
    "tldr": "该研究利用隐式表示构建了场景相关先验，从而在不规则环境中利用基于模拟的高效贝叶斯推理算法成功识别抓取姿态。",
    "en_tdlr": "This study uses implicit representations to construct scene-dependent priors, enabling efficient simulation-based Bayesian inference algorithms to successfully identify grasp poses in unstructured environments."
}