{
    "title": "Deep learning based Auto Tuning for Database Management System. (arXiv:2304.12747v1 [cs.DB])",
    "abstract": "The management of database system configurations is a challenging task, as there are hundreds of configuration knobs that control every aspect of the system. This is complicated by the fact that these knobs are not standardized, independent, or universal, making it difficult to determine optimal settings. An automated approach to address this problem using supervised and unsupervised machine learning methods to select impactful knobs, map unseen workloads, and recommend knob settings was implemented in a new tool called OtterTune and is being evaluated on three DBMSs, with results demonstrating that it recommends configurations as good as or better than those generated by existing tools or a human expert.In this work, we extend an automated technique based on Ottertune [1] to reuse training data gathered from previous sessions to tune new DBMS deployments with the help of supervised and unsupervised machine learning methods to improve latency prediction. Our approach involves the expan",
    "link": "http://arxiv.org/abs/2304.12747",
    "context": "Title: Deep learning based Auto Tuning for Database Management System. (arXiv:2304.12747v1 [cs.DB])\nAbstract: The management of database system configurations is a challenging task, as there are hundreds of configuration knobs that control every aspect of the system. This is complicated by the fact that these knobs are not standardized, independent, or universal, making it difficult to determine optimal settings. An automated approach to address this problem using supervised and unsupervised machine learning methods to select impactful knobs, map unseen workloads, and recommend knob settings was implemented in a new tool called OtterTune and is being evaluated on three DBMSs, with results demonstrating that it recommends configurations as good as or better than those generated by existing tools or a human expert.In this work, we extend an automated technique based on Ottertune [1] to reuse training data gathered from previous sessions to tune new DBMS deployments with the help of supervised and unsupervised machine learning methods to improve latency prediction. Our approach involves the expan",
    "path": "papers/23/04/2304.12747.json",
    "total_tokens": 872,
    "translated_title": "基于深度学习的数据库管理系统自动调优",
    "translated_abstract": "数据库系统配置的管理是一项具有挑战性的任务，因为有数百种配置开关来控制系统的各个方面。这种情况复杂性增加的原因在于这些开关没有标准化、独立性也不一样，并没有通用的标准，因此很难确定最佳的设置。为了解决这个问题，OtterTune是一个基于监督和无监督机器学习方法来选择有影响性的开关，映射未见过的工作量并建议开关设置的新工具，并已在三个DBMS上进行了评估，结果表明它推荐的配置与现有工具或人工专家生成的配置一样好或更好。在这项工作中，我们扩展了一个基于Ottertune的自动技术，利用监督和无监督机器学习方法重用从先前会议中收集的训练数据来调整新的DBMS部署，以提高延迟预测的精度。",
    "tldr": "本文扩展了一个基于Ottertune自动技术的方法，利用监督和无监督机器学习方法重用从先前会议中收集的训练数据来调整新的DBMS部署，以提高延迟预测的精度。",
    "en_tdlr": "This paper extends an automated technique based on Ottertune by reusing training data gathered from previous sessions to tune new DBMS deployments with the help of supervised and unsupervised machine learning methods to improve latency prediction."
}