{
    "title": "Digital Twins in Wind Energy: Emerging Technologies and Industry-Informed Future Directions. (arXiv:2304.11405v1 [cs.HC])",
    "abstract": "This article presents a comprehensive overview of the digital twin technology and its capability levels, with a specific focus on its applications in the wind energy industry. It consolidates the definitions of digital twin and its capability levels on a scale from 0-5; 0-standalone, 1-descriptive, 2-diagnostic, 3-predictive, 4-prescriptive, 5-autonomous. It then, from an industrial perspective, identifies the current state of the art and research needs in the wind energy sector. The article proposes approaches to the identified challenges from the perspective of research institutes and offers a set of recommendations for diverse stakeholders to facilitate the acceptance of the technology. The contribution of this article lies in its synthesis of the current state of knowledge and its identification of future research needs and challenges from an industry perspective, ultimately providing a roadmap for future research and development in the field of digital twin and its applications in",
    "link": "http://arxiv.org/abs/2304.11405",
    "context": "Title: Digital Twins in Wind Energy: Emerging Technologies and Industry-Informed Future Directions. (arXiv:2304.11405v1 [cs.HC])\nAbstract: This article presents a comprehensive overview of the digital twin technology and its capability levels, with a specific focus on its applications in the wind energy industry. It consolidates the definitions of digital twin and its capability levels on a scale from 0-5; 0-standalone, 1-descriptive, 2-diagnostic, 3-predictive, 4-prescriptive, 5-autonomous. It then, from an industrial perspective, identifies the current state of the art and research needs in the wind energy sector. The article proposes approaches to the identified challenges from the perspective of research institutes and offers a set of recommendations for diverse stakeholders to facilitate the acceptance of the technology. The contribution of this article lies in its synthesis of the current state of knowledge and its identification of future research needs and challenges from an industry perspective, ultimately providing a roadmap for future research and development in the field of digital twin and its applications in",
    "path": "papers/23/04/2304.11405.json",
    "total_tokens": 869,
    "translated_title": "风能中的数字孪生：新兴技术和行业未来方向。",
    "translated_abstract": "本文全面介绍了数字孪生技术及其能力水平，重点关注其在风能行业中的应用。它在0-5的标度上界定了数字孪生及其能力水平的定义；0-独立、1-描述、2-诊断、3-预测、4-规定、5-自治。从产业角度，它确定了风能行业的现状和研究需求。本文从研究机构的角度提出了应对这些挑战的方法，并提供了一套推荐措施，以促进技术的接受。本文的贡献在于它综合了当前知识状态并从产业角度识别了未来的研究需求和挑战，并提供了数字孪生和其在风能应用领域未来研究和发展的路线图。",
    "tldr": "本文综合介绍了数字孪生技术及其在风能行业中的应用，并从产业角度识别了未来的研究需求和挑战，最终提供数字孪生和其在风能应用领域未来研究和发展的路线图。",
    "en_tdlr": "This article provides a comprehensive overview of the digital twin technology and its application in the wind energy industry. It identifies future research needs and challenges from an industry perspective and offers a roadmap for future research and development in the field."
}