{
    "title": "Knowledge-Distilled Graph Neural Networks for Personalized Epileptic Seizure Detection. (arXiv:2304.06038v1 [eess.SP])",
    "abstract": "Wearable devices for seizure monitoring detection could significantly improve the quality of life of epileptic patients. However, existing solutions that mostly rely on full electrode set of electroencephalogram (EEG) measurements could be inconvenient for every day use. In this paper, we propose a novel knowledge distillation approach to transfer the knowledge from a sophisticated seizure detector (called the teacher) trained on data from the full set of electrodes to learn new detectors (called the student). They are both providing lightweight implementations and significantly reducing the number of electrodes needed for recording the EEG. We consider the case where the teacher and the student seizure detectors are graph neural networks (GNN), since these architectures actively use the connectivity information. We consider two cases (a) when a single student is learnt for all the patients using preselected channels; and (b) when personalized students are learnt for every individual p",
    "link": "http://arxiv.org/abs/2304.06038",
    "context": "Title: Knowledge-Distilled Graph Neural Networks for Personalized Epileptic Seizure Detection. (arXiv:2304.06038v1 [eess.SP])\nAbstract: Wearable devices for seizure monitoring detection could significantly improve the quality of life of epileptic patients. However, existing solutions that mostly rely on full electrode set of electroencephalogram (EEG) measurements could be inconvenient for every day use. In this paper, we propose a novel knowledge distillation approach to transfer the knowledge from a sophisticated seizure detector (called the teacher) trained on data from the full set of electrodes to learn new detectors (called the student). They are both providing lightweight implementations and significantly reducing the number of electrodes needed for recording the EEG. We consider the case where the teacher and the student seizure detectors are graph neural networks (GNN), since these architectures actively use the connectivity information. We consider two cases (a) when a single student is learnt for all the patients using preselected channels; and (b) when personalized students are learnt for every individual p",
    "path": "papers/23/04/2304.06038.json",
    "total_tokens": 1049,
    "translated_title": "面向个性化癫痫发作检测的知识蒸馏图神经网络",
    "translated_abstract": "可穿戴设备对于癫痫患者的监测检测可以极大地改善生活质量。然而，现有的解决方案大多依赖于全脑电图（EEG）测量的完整电极组，可能对于日常使用不太方便。在本文中，我们提出了一种新颖的知识蒸馏方法，从经过全套电极数据训练的先进癫痫检测器（称为教师）中传输知识，以学习新的检测器（称为学生）。它们都提供轻量级的实现，显著减少了记录脑电图所需的电极数量。我们考虑了教师和学生癫痫检测器都是图神经网络（GNN）的情况，因为这些架构积极使用连接信息。我们考虑了两种情况：（a）使用预选通道为所有患者学习单个学生；（b）为每个个体患者使用少量通道学习个性化学生。该方法在公共数据集上进行了评估，相对于现有的个性化癫痫检测方法使用极少量电极取得了更好的效果。",
    "tldr": "采用知识蒸馏方法，从通过全套电极数据训练的检测器中传输知识，构建了新的检测器，能够为个体患者定制少量通道，并提供了轻量级、高准确率的实现，相对于现有的基于全套电极的方案大为改善。",
    "en_tdlr": "A knowledge distillation approach has been proposed to construct new detectors with significantly fewer electrodes by transferring knowledge from a sophisticated seizure detector to a lightweight implementation called the student, which can be personalized for each patient using a small set of channels, outperforming existing methods based on full electrode set of electroencephalogram measurements significantly."
}