{
    "title": "Building predictive models of healthcare costs with open healthcare data. (arXiv:2304.02191v1 [cs.LG])",
    "abstract": "Due to rapidly rising healthcare costs worldwide, there is significant interest in controlling them. An important aspect concerns price transparency, as preliminary efforts have demonstrated that patients will shop for lower costs, driving efficiency. This requires the data to be made available, and models that can predict healthcare costs for a wide range of patient demographics and conditions. We present an approach to this problem by developing a predictive model using machine-learning techniques. We analyzed de-identified patient data from New York State SPARCS (statewide planning and research cooperative system), consisting of 2.3 million records in 2016. We built models to predict costs from patient diagnoses and demographics. We investigated two model classes consisting of sparse regression and decision trees. We obtained the best performance by using a decision tree with depth 10. We obtained an R-square value of 0.76 which is better than the values reported in the literature f",
    "link": "http://arxiv.org/abs/2304.02191",
    "context": "Title: Building predictive models of healthcare costs with open healthcare data. (arXiv:2304.02191v1 [cs.LG])\nAbstract: Due to rapidly rising healthcare costs worldwide, there is significant interest in controlling them. An important aspect concerns price transparency, as preliminary efforts have demonstrated that patients will shop for lower costs, driving efficiency. This requires the data to be made available, and models that can predict healthcare costs for a wide range of patient demographics and conditions. We present an approach to this problem by developing a predictive model using machine-learning techniques. We analyzed de-identified patient data from New York State SPARCS (statewide planning and research cooperative system), consisting of 2.3 million records in 2016. We built models to predict costs from patient diagnoses and demographics. We investigated two model classes consisting of sparse regression and decision trees. We obtained the best performance by using a decision tree with depth 10. We obtained an R-square value of 0.76 which is better than the values reported in the literature f",
    "path": "papers/23/04/2304.02191.json",
    "total_tokens": 901,
    "translated_title": "利用开放式医疗数据构建医疗成本预测模型",
    "translated_abstract": "由于全球医疗成本的快速上涨，控制医疗成本已成显著的关注点，其关键之一在于价格透明度，病人会选价格较低的医务服务，从而提高效率。这需要数据公开，以及能预测各种病人特征和状况下医疗成本的模型。我们利用机器学习技术开发了一种预测模型来解决这个问题。我们分析了纽约州SPARCS（州级规划和研究合作系统）的2.3百万记录的去身份化病人数据，从病人诊断和特征中构建成本预测模型。我们研究了由稀疏回归和决策树两类模型构成的模型，最终使用深度为10的决策树取得了最佳性能，获得了0.76的R-square值，优于文献报道的值。",
    "tldr": "利用纽约州 SPARCS 的匿名患者数据，使用机器学习技术预测病人的医疗成本，最好表现的模型使用了决策树，获得了 0.76 的 R-square 值。",
    "en_tdlr": "Predictive models using machine learning were built on de-identified patient data from New York State SPARCS to estimate healthcare costs for different patient demographics and diagnoses. Decision trees with depth 10 had the best performance, achieving an R-square value of 0.76, surpassing the existing literature."
}