{
    "title": "Equilibrium-Invariant Embedding, Metric Space, and Fundamental Set of $2\\times2$ Normal-Form Games. (arXiv:2304.09978v1 [cs.GT])",
    "abstract": "Equilibrium solution concepts of normal-form games, such as Nash equilibria, correlated equilibria, and coarse correlated equilibria, describe the joint strategy profiles from which no player has incentive to unilaterally deviate. They are widely studied in game theory, economics, and multiagent systems. Equilibrium concepts are invariant under certain transforms of the payoffs. We define an equilibrium-inspired distance metric for the space of all normal-form games and uncover a distance-preserving equilibrium-invariant embedding. Furthermore, we propose an additional transform which defines a better-response-invariant distance metric and embedding. To demonstrate these metric spaces we study $2\\times2$ games. The equilibrium-invariant embedding of $2\\times2$ games has an efficient two variable parameterization (a reduction from eight), where each variable geometrically describes an angle on a unit circle. Interesting properties can be spatially inferred from the embedding, including:",
    "link": "http://arxiv.org/abs/2304.09978",
    "context": "Title: Equilibrium-Invariant Embedding, Metric Space, and Fundamental Set of $2\\times2$ Normal-Form Games. (arXiv:2304.09978v1 [cs.GT])\nAbstract: Equilibrium solution concepts of normal-form games, such as Nash equilibria, correlated equilibria, and coarse correlated equilibria, describe the joint strategy profiles from which no player has incentive to unilaterally deviate. They are widely studied in game theory, economics, and multiagent systems. Equilibrium concepts are invariant under certain transforms of the payoffs. We define an equilibrium-inspired distance metric for the space of all normal-form games and uncover a distance-preserving equilibrium-invariant embedding. Furthermore, we propose an additional transform which defines a better-response-invariant distance metric and embedding. To demonstrate these metric spaces we study $2\\times2$ games. The equilibrium-invariant embedding of $2\\times2$ games has an efficient two variable parameterization (a reduction from eight), where each variable geometrically describes an angle on a unit circle. Interesting properties can be spatially inferred from the embedding, including:",
    "path": "papers/23/04/2304.09978.json",
    "total_tokens": 973,
    "translated_title": "均衡不变嵌入、度量空间和$2\\times2$正则型博弈的基础集合",
    "translated_abstract": "正则形博弈的均衡解概念，如Nash均衡、相关均衡和粗糙相关均衡，描述了从中没有任何一位玩家有动机单方面背叛的联合策略。它们在博弈论、经济学和多代理系统中广泛研究。均衡概念在某些收益变换下是不变的。我们为所有正则形博弈空间定义了一个均衡启示的距离度量，揭示了一个距离保持均衡不变的嵌入方式。此外，我们提出了一种额外的变换，定义了更好反应性不变的距离度量和嵌入。为了演示这些度量空间，我们研究了$2\\times2$游戏。$2\\times2$ 游戏的均衡不变嵌入具有高效的二元参数化（从八个），每个变量在一个单位圆的角度上几何地描述了一个角度。可以从嵌入中推断出有趣的空间性质，包括：",
    "tldr": "该研究提出了均衡启示的距离度量和更好反应性不变的距离度量，为正则形博弈空间定义了嵌入，并研究了 $2\\times2$ 游戏的均衡不变嵌入，具有高效的二元参数化。",
    "en_tdlr": "This study proposes an equilibrium-inspired distance metric and a better-response-invariant distance metric, defining an embedding of the space of all normal-form games, and studies the equilibrium-invariant embedding of $2\\times2$ games which has an efficient two variable parameterization."
}