{
    "title": "CILIATE: Towards Fairer Class-based Incremental Learning by Dataset and Training Refinement. (arXiv:2304.04222v1 [cs.LG])",
    "abstract": "Due to the model aging problem, Deep Neural Networks (DNNs) need updates to adjust them to new data distributions. The common practice leverages incremental learning (IL), e.g., Class-based Incremental Learning (CIL) that updates output labels, to update the model with new data and a limited number of old data. This avoids heavyweight training (from scratch) using conventional methods and saves storage space by reducing the number of old data to store. But it also leads to poor performance in fairness. In this paper, we show that CIL suffers both dataset and algorithm bias problems, and existing solutions can only partially solve the problem. We propose a novel framework, CILIATE, that fixes both dataset and algorithm bias in CIL. It features a novel differential analysis guided dataset and training refinement process that identifies unique and important samples overlooked by existing CIL and enforces the model to learn from them. Through this process, CILIATE improves the fairness of ",
    "link": "http://arxiv.org/abs/2304.04222",
    "context": "Title: CILIATE: Towards Fairer Class-based Incremental Learning by Dataset and Training Refinement. (arXiv:2304.04222v1 [cs.LG])\nAbstract: Due to the model aging problem, Deep Neural Networks (DNNs) need updates to adjust them to new data distributions. The common practice leverages incremental learning (IL), e.g., Class-based Incremental Learning (CIL) that updates output labels, to update the model with new data and a limited number of old data. This avoids heavyweight training (from scratch) using conventional methods and saves storage space by reducing the number of old data to store. But it also leads to poor performance in fairness. In this paper, we show that CIL suffers both dataset and algorithm bias problems, and existing solutions can only partially solve the problem. We propose a novel framework, CILIATE, that fixes both dataset and algorithm bias in CIL. It features a novel differential analysis guided dataset and training refinement process that identifies unique and important samples overlooked by existing CIL and enforces the model to learn from them. Through this process, CILIATE improves the fairness of ",
    "path": "papers/23/04/2304.04222.json",
    "total_tokens": 940,
    "tldr": "CILIATE 提出了一个新的框架，通过微分分析引导数据集和训练细化过程来修复类别增量学习中存在的数据集和算法偏差问题，并强制模型从被忽略的重要样本中学习，从而提高公平性。",
    "en_tdlr": "CILIATE proposes a novel framework that fixes both dataset and algorithm bias in Class-based Incremental Learning (CIL) through a differential analysis-guided dataset and training refinement process, and enforces the model to learn from important samples previously overlooked by existing CIL, thereby improving fairness."
}