{
    "title": "From Explanation to Action: An End-to-End Human-in-the-loop Framework for Anomaly Reasoning and Management. (arXiv:2304.03368v1 [cs.LG])",
    "abstract": "Anomalies are often indicators of malfunction or inefficiency in various systems such as manufacturing, healthcare, finance, surveillance, to name a few. While the literature is abundant in effective detection algorithms due to this practical relevance, autonomous anomaly detection is rarely used in real-world scenarios. Especially in high-stakes applications, a human-in-the-loop is often involved in processes beyond detection such as verification and troubleshooting. In this work, we introduce ALARM (for Analyst-in-the-Loop Anomaly Reasoning and Management); an end-to-end framework that supports the anomaly mining cycle comprehensively, from detection to action. Besides unsupervised detection of emerging anomalies, it offers anomaly explanations and an interactive GUI for human-in-the-loop processes -- visual exploration, sense-making, and ultimately action-taking via designing new detection rules -- that help close ``the loop'' as the new rules complement rule-based supervised detect",
    "link": "http://arxiv.org/abs/2304.03368",
    "context": "Title: From Explanation to Action: An End-to-End Human-in-the-loop Framework for Anomaly Reasoning and Management. (arXiv:2304.03368v1 [cs.LG])\nAbstract: Anomalies are often indicators of malfunction or inefficiency in various systems such as manufacturing, healthcare, finance, surveillance, to name a few. While the literature is abundant in effective detection algorithms due to this practical relevance, autonomous anomaly detection is rarely used in real-world scenarios. Especially in high-stakes applications, a human-in-the-loop is often involved in processes beyond detection such as verification and troubleshooting. In this work, we introduce ALARM (for Analyst-in-the-Loop Anomaly Reasoning and Management); an end-to-end framework that supports the anomaly mining cycle comprehensively, from detection to action. Besides unsupervised detection of emerging anomalies, it offers anomaly explanations and an interactive GUI for human-in-the-loop processes -- visual exploration, sense-making, and ultimately action-taking via designing new detection rules -- that help close ``the loop'' as the new rules complement rule-based supervised detect",
    "path": "papers/23/04/2304.03368.json",
    "total_tokens": 863,
    "translated_title": "从解释到行动：一种端到端的人机协作异常推理和管理框架",
    "translated_abstract": "异常通常是制造、医疗、金融、监控等各种系统中故障或低效的指标。尽管由于其实际意义而文献中存在着有效的检测算法，但自动异常检测在实际应用中很少使用。特别是在高风险应用中，通常需要人机协作处理，超出了检测等进程，例如验证和故障排除。本文介绍了ALARM（分析师协作异常推理和管理）：一种端到端的框架，全面支持异常挖掘周期，从检测到行动。除了针对新兴异常的无监督检测，它还提供异常解释和交互式GUI，以进行人机协作进程，包括可视化探索、感知和最终通过设计新的检测规则进行行动，从而帮助关闭“环路”，新规则补充了基于规则的监督检测。",
    "tldr": "本文提出了一种名为ALARM的端到端框架，支持从异常检测到人机交互式处理，从而最终实现新规则补充了基于规则的监督检测。"
}