{
    "title": "The Economic Effect of Gaining a New Qualification Later in Life. (arXiv:2304.01490v1 [econ.GN])",
    "abstract": "Pursuing educational qualifications later in life is an increasingly common phenomenon within OECD countries since technological change and automation continues to drive the evolution of skills needed in many professions. We focus on the causal impacts to economic returns of degrees completed later in life, where motivations and capabilities to acquire additional education may be distinct from education in early years. We find that completing and additional degree leads to more than \\$3000 (AUD, 2019) per year compared to those who do not complete additional study. For outcomes, treatment and controls we use the extremely rich and nationally representative longitudinal data from the Household Income and Labour Dynamics Australia survey is used for this work. To take full advantage of the complexity and richness of this data we use a Machine Learning (ML) based methodology to estimate the causal effect. We are also able to use ML to discover sources of heterogeneity in the effects of ga",
    "link": "http://arxiv.org/abs/2304.01490",
    "context": "Title: The Economic Effect of Gaining a New Qualification Later in Life. (arXiv:2304.01490v1 [econ.GN])\nAbstract: Pursuing educational qualifications later in life is an increasingly common phenomenon within OECD countries since technological change and automation continues to drive the evolution of skills needed in many professions. We focus on the causal impacts to economic returns of degrees completed later in life, where motivations and capabilities to acquire additional education may be distinct from education in early years. We find that completing and additional degree leads to more than \\$3000 (AUD, 2019) per year compared to those who do not complete additional study. For outcomes, treatment and controls we use the extremely rich and nationally representative longitudinal data from the Household Income and Labour Dynamics Australia survey is used for this work. To take full advantage of the complexity and richness of this data we use a Machine Learning (ML) based methodology to estimate the causal effect. We are also able to use ML to discover sources of heterogeneity in the effects of ga",
    "path": "papers/23/04/2304.01490.json",
    "total_tokens": 882,
    "translated_title": "后期获得新资格的经济效应",
    "translated_abstract": "在OECD国家中，追求晚年教育资格是一个越来越普遍的现象，因为技术变革和自动化继续推动许多职业所需的技能的演变。本文着重考虑晚年完成学位对经济回报的因果影响，其中获取额外教育的动机和能力可能与早年教育不同。我们发现，与那些没有完成额外学习的人相比，完成额外学位将带来每年超过3000澳元（2019年）的经济回报。对于结果，我们使用《澳大利亚家庭收入和劳动力动态调查》的极其丰富且具有代表性的纵向数据。为了充分利用这些数据的复杂性和丰富性，我们使用基于机器学习（ML）的方法来估算因果效应。我们也能够使用ML来发现晚年获得新资格对经济回报的影响来源的异质性。",
    "tldr": "本研究通过机器学习方法分析晚年完成学位与经济回报之间的因果效应，发现获得新资格将带来每年超过3000澳元的经济回报。",
    "en_tdlr": "This study examines the causal effect between gaining a new qualification later in life and economic returns, using a machine learning-based methodology. The findings suggest that obtaining a new qualification leads to an economic return of over 3000 AUD per year."
}