{
    "title": "Spintronic Physical Reservoir for Autonomous Prediction and Long-Term Household Energy Load Forecasting. (arXiv:2304.03343v1 [cs.LG])",
    "abstract": "In this study, we have shown autonomous long-term prediction with a spintronic physical reservoir. Due to the short-term memory property of the magnetization dynamics, non-linearity arises in the reservoir states which could be used for long-term prediction tasks using simple linear regression for online training. During the prediction stage, the output is directly fed to the input of the reservoir for autonomous prediction. We employ our proposed reservoir for the modeling of the chaotic time series such as Mackey-Glass and dynamic time-series data, such as household building energy loads. Since only the last layer of a RC needs to be trained with linear regression, it is well suited for learning in real time on edge devices. Here we show that a skyrmion based magnetic tunnel junction can potentially be used as a prototypical RC but any nanomagnetic magnetic tunnel junction with nonlinear magnetization behavior can implement such a RC. By comparing our spintronic physical RC approach ",
    "link": "http://arxiv.org/abs/2304.03343",
    "context": "Title: Spintronic Physical Reservoir for Autonomous Prediction and Long-Term Household Energy Load Forecasting. (arXiv:2304.03343v1 [cs.LG])\nAbstract: In this study, we have shown autonomous long-term prediction with a spintronic physical reservoir. Due to the short-term memory property of the magnetization dynamics, non-linearity arises in the reservoir states which could be used for long-term prediction tasks using simple linear regression for online training. During the prediction stage, the output is directly fed to the input of the reservoir for autonomous prediction. We employ our proposed reservoir for the modeling of the chaotic time series such as Mackey-Glass and dynamic time-series data, such as household building energy loads. Since only the last layer of a RC needs to be trained with linear regression, it is well suited for learning in real time on edge devices. Here we show that a skyrmion based magnetic tunnel junction can potentially be used as a prototypical RC but any nanomagnetic magnetic tunnel junction with nonlinear magnetization behavior can implement such a RC. By comparing our spintronic physical RC approach ",
    "path": "papers/23/04/2304.03343.json",
    "total_tokens": 960,
    "translated_title": "自主预测和长期家庭能源负荷预测的自旋电子物理水库",
    "translated_abstract": "本研究利用自旋电子物理水库进行了自治型长期预测。由于磁化动力学的短期记忆特性，水库状态中产生了非线性，可用于使用简单线性回归进行在线训练的长期预测任务。在预测阶段，输出直接馈入水库的输入中进行自治型预测。我们将所提出的水库用于建模诸如Mackey-Glass等混沌时间序列和动态时间序列数据，如家庭建筑能耗。由于只有RC的最后一层需要使用线性回归进行训练，因此它非常适合在边缘设备上进行实时学习。本文展示了基于微旋磁隧穿结的涡旋子可能用作原型RC，但任何具有非线性磁化行为的纳米磁隧道结都可以实现此种RC。通过比较我们的自旋电子物理RC方法",
    "tldr": "本研究展示了利用自旋电子物理水库进行自治型长期预测任务的方法，可以用于建模混沌时间序列和动态时间序列数据，是适合在边缘设备上进行实时学习的。这里提出的基于微旋磁隧穿结的涡旋子可以作为实现此种RC的原型。",
    "en_tdlr": "This study demonstrates the use of a spintronic physical reservoir for autonomous long-term prediction tasks, suitable for modeling chaotic and dynamic time-series data, and applicable for real-time learning on edge devices. The proposed method of using a skyrmion based magnetic tunnel junction as a prototypical RC provides potential for implementing such an RC with any nanomagnetic magnetic tunnel junction with nonlinear magnetization behavior."
}