{
    "title": "Fault diagnosis for PV arrays considering dust impact based on transformed graphical feature of characteristic curves and convolutional neural network with CBAM modules. (arXiv:2304.06493v1 [eess.SP])",
    "abstract": "Various faults can occur during the operation of PV arrays, and both the dust-affected operating conditions and various diode configurations make the faults more complicated. However, current methods for fault diagnosis based on I-V characteristic curves only utilize partial feature information and often rely on calibrating the field characteristic curves to standard test conditions (STC). It is difficult to apply it in practice and to accurately identify multiple complex faults with similarities in different blocking diodes configurations of PV arrays under the influence of dust. Therefore, a novel fault diagnosis method for PV arrays considering dust impact is proposed. In the preprocessing stage, the Isc-Voc normalized Gramian angular difference field (GADF) method is presented, which normalizes and transforms the resampled PV array characteristic curves from the field including I-V and P-V to obtain the transformed graphical feature matrices. Then, in the fault diagnosis stage, the",
    "link": "http://arxiv.org/abs/2304.06493",
    "context": "Title: Fault diagnosis for PV arrays considering dust impact based on transformed graphical feature of characteristic curves and convolutional neural network with CBAM modules. (arXiv:2304.06493v1 [eess.SP])\nAbstract: Various faults can occur during the operation of PV arrays, and both the dust-affected operating conditions and various diode configurations make the faults more complicated. However, current methods for fault diagnosis based on I-V characteristic curves only utilize partial feature information and often rely on calibrating the field characteristic curves to standard test conditions (STC). It is difficult to apply it in practice and to accurately identify multiple complex faults with similarities in different blocking diodes configurations of PV arrays under the influence of dust. Therefore, a novel fault diagnosis method for PV arrays considering dust impact is proposed. In the preprocessing stage, the Isc-Voc normalized Gramian angular difference field (GADF) method is presented, which normalizes and transforms the resampled PV array characteristic curves from the field including I-V and P-V to obtain the transformed graphical feature matrices. Then, in the fault diagnosis stage, the",
    "path": "papers/23/04/2304.06493.json",
    "total_tokens": 1218,
    "translated_title": "考虑灰尘影响的光伏阵列故障诊断：基于特征曲线的变换图形特征和带CBAM模块的卷积神经网络",
    "translated_abstract": "光伏阵列在运行过程中可能出现多种故障，而灰尘和不同的二极管配置使故障更加复杂。但是，目前基于I-V特性曲线的故障诊断方法仅利用部分特征信息，并且通常依赖于将场特性曲线校准到标准测试条件（STC）。这很难在实践中应用，并准确地识别多个复杂故障，特别是在灰尘影响下PV阵列中具有相似性的不同阻塞二极管配置。因此，提出了一种考虑灰尘影响的PV阵列故障诊断新方法。在预处理阶段中，提出了Isc-Voc归一化压缩图正弦角差（GADF）方法，该方法将场特性曲线包括I-V和P-V的重采样PV阵列特性曲线归一化和转换，以获取特征矩阵。然后，在故障诊断阶段中，将转换后的图形特征矩阵输入带有通道注意力和空间注意力模块的卷积神经网络（CNN），即卷积块注意力模块（CBAM），以准确识别故障。实验结果表明，所提出的方法可以准确识别包括部分遮蔽、开路故障和灰尘导致的异常工作条件在内的故障。总体诊断准确率达到100％，证明了所提出方法的有效性。",
    "tldr": "本文提出了一种新的PV阵列故障诊断方法，可以考虑灰尘影响并通过将Is-Voc normalized Gramian angular difference field方法与卷积神经网络和CBAM模块相结合，准确地识别多种复杂故障，实验结果证明其准确性与有效性。",
    "en_tdlr": "This paper proposes a novel fault diagnosis method for PV arrays considering dust impact, which can accurately identify multiple complex faults by combining the Isc-Voc normalized Gramian angular difference field method with a convolutional neural network and CBAM modules, achieving 100% diagnostic accuracy according to experimental results."
}