{
    "title": "Domain Mastery Benchmark: An Ever-Updating Benchmark for Evaluating Holistic Domain Knowledge of Large Language Model--A Preliminary Release. (arXiv:2304.11679v1 [cs.CL])",
    "abstract": "Domain knowledge refers to the in-depth understanding, expertise, and familiarity with a specific subject, industry, field, or area of special interest. The existing benchmarks are all lack of an overall design for domain knowledge evaluation. Holding the belief that the real ability of domain language understanding can only be fairly evaluated by an comprehensive and in-depth benchmark, we introduces the Domma, a Domain Mastery Benchmark. DomMa targets at testing Large Language Models (LLMs) on their domain knowledge understanding, it features extensive domain coverage, large data volume, and a continually updated data set based on Chinese 112 first-level subject classifications. DomMa consist of 100,000 questions in both Chinese and English sourced from graduate entrance examinations and undergraduate exams in Chinese college. We have also propose designs to make benchmark and evaluation process more suitable to LLMs.",
    "link": "http://arxiv.org/abs/2304.11679",
    "context": "Title: Domain Mastery Benchmark: An Ever-Updating Benchmark for Evaluating Holistic Domain Knowledge of Large Language Model--A Preliminary Release. (arXiv:2304.11679v1 [cs.CL])\nAbstract: Domain knowledge refers to the in-depth understanding, expertise, and familiarity with a specific subject, industry, field, or area of special interest. The existing benchmarks are all lack of an overall design for domain knowledge evaluation. Holding the belief that the real ability of domain language understanding can only be fairly evaluated by an comprehensive and in-depth benchmark, we introduces the Domma, a Domain Mastery Benchmark. DomMa targets at testing Large Language Models (LLMs) on their domain knowledge understanding, it features extensive domain coverage, large data volume, and a continually updated data set based on Chinese 112 first-level subject classifications. DomMa consist of 100,000 questions in both Chinese and English sourced from graduate entrance examinations and undergraduate exams in Chinese college. We have also propose designs to make benchmark and evaluation process more suitable to LLMs.",
    "path": "papers/23/04/2304.11679.json",
    "total_tokens": 894,
    "translated_title": "领域掌握水平基准：用于评估大型语言模型全面领域知识的不断更新的基准——初步发布。（arXiv:2304.11679v1 [cs.CL]）",
    "translated_abstract": "领域知识指对特定主题、行业、领域或特别兴趣领域的深入理解、专业知识和熟悉程度。现有的基准都缺乏对领域知识评估的整体设计。我们坚信，领域语言理解的真正能力只能通过全面深入的基准来公平地评估，因此我们提出了Domma领域掌握水平基准。DomMa旨在测试大型语言模型（LLM）对领域知识的理解能力，具有广泛的领域覆盖、大量数据和基于中国112个一级学科分类不断更新的数据集。DomMa包含10万个问题，其中包括中文和英文，来源于中国大学的研究生入学考试和本科考试。我们还提出了更适合LLMs的基准和评估流程的设计。",
    "tldr": "DomMa 是一个用于测试大型语言模型领域知识理解能力的综合基准，它分为中英文10万个问题，并基于112个一级学科分类不断更新数据集。",
    "en_tdlr": "DomMa is a comprehensive benchmark used to test the domain knowledge understanding of large language models, with 100,000 questions in both Chinese and English sourced from graduate entrance examinations and undergraduate exams in Chinese colleges, and a continually updated dataset based on 112 first-level subject classifications in China."
}