{
    "title": "Knowledge Distillation from 3D to Bird's-Eye-View for LiDAR Semantic Segmentation. (arXiv:2304.11393v1 [cs.CV])",
    "abstract": "LiDAR point cloud segmentation is one of the most fundamental tasks for autonomous driving scene understanding. However, it is difficult for existing models to achieve both high inference speed and accuracy simultaneously. For example, voxel-based methods perform well in accuracy, while Bird's-Eye-View (BEV)-based methods can achieve real-time inference. To overcome this issue, we develop an effective 3D-to-BEV knowledge distillation method that transfers rich knowledge from 3D voxel-based models to BEV-based models. Our framework mainly consists of two modules: the voxel-to-pillar distillation module and the label-weight distillation module. Voxel-to-pillar distillation distills sparse 3D features to BEV features for middle layers to make the BEV-based model aware of more structural and geometric information. Label-weight distillation helps the model pay more attention to regions with more height information. Finally, we conduct experiments on the SemanticKITTI dataset and Paris-Lille",
    "link": "http://arxiv.org/abs/2304.11393",
    "context": "Title: Knowledge Distillation from 3D to Bird's-Eye-View for LiDAR Semantic Segmentation. (arXiv:2304.11393v1 [cs.CV])\nAbstract: LiDAR point cloud segmentation is one of the most fundamental tasks for autonomous driving scene understanding. However, it is difficult for existing models to achieve both high inference speed and accuracy simultaneously. For example, voxel-based methods perform well in accuracy, while Bird's-Eye-View (BEV)-based methods can achieve real-time inference. To overcome this issue, we develop an effective 3D-to-BEV knowledge distillation method that transfers rich knowledge from 3D voxel-based models to BEV-based models. Our framework mainly consists of two modules: the voxel-to-pillar distillation module and the label-weight distillation module. Voxel-to-pillar distillation distills sparse 3D features to BEV features for middle layers to make the BEV-based model aware of more structural and geometric information. Label-weight distillation helps the model pay more attention to regions with more height information. Finally, we conduct experiments on the SemanticKITTI dataset and Paris-Lille",
    "path": "papers/23/04/2304.11393.json",
    "total_tokens": 758,
    "translated_title": "从3D到鸟瞰图的知识蒸馏用于LiDAR语义分割",
    "translated_abstract": "LiDAR点云分割是自动驾驶场景理解最基本的任务之一。然而，现有模型很难同时实现高推理速度和准确性。我们开发了一种有效的3D到BEV知识蒸馏方法，将来自3D体素模型的丰富知识转移到BEV模型中。我们的框架主要包括两个模块：体素到柱状体蒸馏模块和标签权重蒸馏模块。",
    "tldr": "该论文提出了一种3D到BEV的知识蒸馏方法，使BEV分割模型具有更丰富的结构和几何信息，以提高分割的准确性和推理速度。",
    "en_tdlr": "This paper proposes a 3D-to-BEV knowledge distillation method that transfers rich knowledge from 3D voxel-based models to BEV-based models, achieving higher accuracy and real-time inference for LiDAR point cloud segmentation."
}