{
    "title": "Astronomical image time series classification using CONVolutional attENTION (ConvEntion). (arXiv:2304.01236v1 [astro-ph.IM])",
    "abstract": "Aims. The treatment of astronomical image time series has won increasing attention in recent years. Indeed, numerous surveys following up on transient objects are in progress or under construction, such as the Vera Rubin Observatory Legacy Survey for Space and Time (LSST), which is poised to produce huge amounts of these time series. The associated scientific topics are extensive, ranging from the study of objects in our galaxy to the observation of the most distant supernovae for measuring the expansion of the universe. With such a large amount of data available, the need for robust automatic tools to detect and classify celestial objects is growing steadily. Methods. This study is based on the assumption that astronomical images contain more information than light curves. In this paper, we propose a novel approach based on deep learning for classifying different types of space objects directly using images. We named our approach ConvEntion, which stands for CONVolutional attENTION. I",
    "link": "http://arxiv.org/abs/2304.01236",
    "context": "Title: Astronomical image time series classification using CONVolutional attENTION (ConvEntion). (arXiv:2304.01236v1 [astro-ph.IM])\nAbstract: Aims. The treatment of astronomical image time series has won increasing attention in recent years. Indeed, numerous surveys following up on transient objects are in progress or under construction, such as the Vera Rubin Observatory Legacy Survey for Space and Time (LSST), which is poised to produce huge amounts of these time series. The associated scientific topics are extensive, ranging from the study of objects in our galaxy to the observation of the most distant supernovae for measuring the expansion of the universe. With such a large amount of data available, the need for robust automatic tools to detect and classify celestial objects is growing steadily. Methods. This study is based on the assumption that astronomical images contain more information than light curves. In this paper, we propose a novel approach based on deep learning for classifying different types of space objects directly using images. We named our approach ConvEntion, which stands for CONVolutional attENTION. I",
    "path": "papers/23/04/2304.01236.json",
    "total_tokens": 834,
    "translated_title": "使用卷积注意力（ConvEntion）对天体图像时间序列进行分类",
    "translated_abstract": "近年来，天体图像时间序列的处理越来越受到关注。事实上，许多跟踪瞬态天体的调查正在进行或建设中，例如 Vera Rubin Observatory Legacy Survey for Space and Time (LSST)，该瞬变事件观测计划将产生大量这些时间序列数据。相关的科学主题非常广泛，从我们银河系中的物体研究到观测测量宇宙膨胀的最远的超新星。由于有如此大量的数据可用，需要稳健自动检测和分类天体物体的工具的需求正在稳步增长。本研究基于天体图像包含比光曲线更多的信息的假设，提出了一种基于深度学习的新方法，直接使用图像对不同类型的空间对象进行分类。我们将这种方法命名为ConvEntion，即卷积注意力。",
    "tldr": "本研究提出了一种基于深度学习的新方法ConvEntion，用于对天体图像时间序列分类，并能够直接使用图像对不同类型的空间对象进行分类。",
    "en_tdlr": "This study proposes a novel approach called ConvEntion based on deep learning for classifying astronomical image time series and different types of space objects directly using images."
}