{
    "title": "Modeling Spoken Information Queries for Virtual Assistants: Open Problems, Challenges and Opportunities. (arXiv:2304.13149v1 [cs.IR])",
    "abstract": "Virtual assistants are becoming increasingly important speech-driven Information Retrieval platforms that assist users with various tasks.  We discuss open problems and challenges with respect to modeling spoken information queries for virtual assistants, and list opportunities where Information Retrieval methods and research can be applied to improve the quality of virtual assistant speech recognition.  We discuss how query domain classification, knowledge graphs and user interaction data, and query personalization can be helpful to improve the accurate recognition of spoken information domain queries. Finally, we also provide a brief overview of current problems and challenges in speech recognition.",
    "link": "http://arxiv.org/abs/2304.13149",
    "context": "Title: Modeling Spoken Information Queries for Virtual Assistants: Open Problems, Challenges and Opportunities. (arXiv:2304.13149v1 [cs.IR])\nAbstract: Virtual assistants are becoming increasingly important speech-driven Information Retrieval platforms that assist users with various tasks.  We discuss open problems and challenges with respect to modeling spoken information queries for virtual assistants, and list opportunities where Information Retrieval methods and research can be applied to improve the quality of virtual assistant speech recognition.  We discuss how query domain classification, knowledge graphs and user interaction data, and query personalization can be helpful to improve the accurate recognition of spoken information domain queries. Finally, we also provide a brief overview of current problems and challenges in speech recognition.",
    "path": "papers/23/04/2304.13149.json",
    "total_tokens": 769,
    "translated_title": "虚拟助手中口语信息查询的建模：未解决的问题，挑战和机遇",
    "translated_abstract": "虚拟助手正在成为越来越重要的基于语音的信息检索平台，它们可以帮助用户完成各种任务。本论文讨论了关于虚拟助手口语信息查询建模的未解决的问题和挑战，并列出了信息检索方法和研究可以应用于提高虚拟助手语音识别质量的机会。我们讨论了如何通过查询领域分类、知识图谱和用户交互数据以及查询个性化来帮助改善口语信息领域查询的准确识别。最后，我们还简要概述了语音识别中当前存在的问题和挑战。",
    "tldr": "讨论了虚拟助手中口语信息查询建模的问题和挑战，以及信息检索方法中的机遇；探讨了如何通过查询领域分类、知识图谱等提高语音识别的准确性；简要概述了语音识别中的挑战。",
    "en_tdlr": "This paper discusses the problems and challenges of modeling spoken information queries for virtual assistants, and lists opportunities for using Information Retrieval methods to improve speech recognition quality. It explores how domain classification, knowledge graphs, user interaction data, and personalization can improve the accuracy of spoken queries, and provides an overview of current challenges in speech recognition."
}