{
    "title": "HumanLight: Incentivizing Ridesharing via Human-centric Deep Reinforcement Learning in Traffic Signal Control. (arXiv:2304.03697v1 [cs.LG])",
    "abstract": "Single occupancy vehicles are the most attractive transportation alternative for many commuters, leading to increased traffic congestion and air pollution. Advancements in information technologies create opportunities for smart solutions that incentivize ridesharing and mode shift to higher occupancy vehicles (HOVs) to achieve the car lighter vision of cities. In this study, we present HumanLight, a novel decentralized adaptive traffic signal control algorithm designed to optimize people throughput at intersections. Our proposed controller is founded on reinforcement learning with the reward function embedding the transportation-inspired concept of pressure at the person-level. By rewarding HOV commuters with travel time savings for their efforts to merge into a single ride, HumanLight achieves equitable allocation of green times. Apart from adopting FRAP, a state-of-the-art (SOTA) base model, HumanLight introduces the concept of active vehicles, loosely defined as vehicles in proximit",
    "link": "http://arxiv.org/abs/2304.03697",
    "context": "Title: HumanLight: Incentivizing Ridesharing via Human-centric Deep Reinforcement Learning in Traffic Signal Control. (arXiv:2304.03697v1 [cs.LG])\nAbstract: Single occupancy vehicles are the most attractive transportation alternative for many commuters, leading to increased traffic congestion and air pollution. Advancements in information technologies create opportunities for smart solutions that incentivize ridesharing and mode shift to higher occupancy vehicles (HOVs) to achieve the car lighter vision of cities. In this study, we present HumanLight, a novel decentralized adaptive traffic signal control algorithm designed to optimize people throughput at intersections. Our proposed controller is founded on reinforcement learning with the reward function embedding the transportation-inspired concept of pressure at the person-level. By rewarding HOV commuters with travel time savings for their efforts to merge into a single ride, HumanLight achieves equitable allocation of green times. Apart from adopting FRAP, a state-of-the-art (SOTA) base model, HumanLight introduces the concept of active vehicles, loosely defined as vehicles in proximit",
    "path": "papers/23/04/2304.03697.json",
    "total_tokens": 966,
    "translated_title": "人性化深度强化学习在交通信号控制中的应用：通过激励拼车来缓解交通拥堵和减少污染",
    "translated_abstract": "单人驾车已成为许多通勤者最受青睐的交通方式，导致交通拥堵和空气污染问题加剧。信息技术的进步为实现城市“轻车化”提供了机遇，可以通过智能解决方案激励拼车和切换到大容量载客工具。本研究提出HumanLight，一种新型的分散式自适应交通信号控制算法，旨在优化交叉口的人员通行量。所提出的控制器基于强化学习，奖励函数嵌入了以人为本的交通概念。通过激励大容量载客工具的通勤者合并乘车以节约时间，HumanLight实现了对绿灯时间的公平分配。除了采用FRAP作为先进的基础模型外，HumanLight还引入了“活跃车辆”这个概念，大致定义是临近交叉口且可能干扰决策过程的任何车辆。",
    "tldr": "本文介绍了一种名为HumanLight的算法，采用人性化的强化学习方法，在交通信号控制中激励大家拼车，缓解交通拥堵和减少污染。算法通过奖励乘坐大容量载客工具的通勤者，实现对绿灯时间的公平分配。",
    "en_tdlr": "This paper presents HumanLight, an algorithm that uses human-centric reinforcement learning to incentivize ridesharing and reduces traffic congestion and pollution. The algorithm rewards HOV commuters for merging into a single ride and achieves equitable allocation of green times in traffic signal control."
}