{
    "title": "LSTM-based Load Forecasting Robustness Against Noise Injection Attack in Microgrid. (arXiv:2304.13104v1 [cs.LG])",
    "abstract": "In this paper, we investigate the robustness of an LSTM neural network against noise injection attacks for electric load forecasting in an ideal microgrid. The performance of the LSTM model is investigated under a black-box Gaussian noise attack with different SNRs. It is assumed that attackers have just access to the input data of the LSTM model. The results show that the noise attack affects the performance of the LSTM model. The load prediction means absolute error (MAE) is 0.047 MW for a healthy prediction, while this value increases up to 0.097 MW for a Gaussian noise insertion with SNR= 6 dB. To robustify the LSTM model against noise attack, a low-pass filter with optimal cut-off frequency is applied at the model's input to remove the noise attack. The filter performs better in case of noise with lower SNR and is less promising for small noises.",
    "link": "http://arxiv.org/abs/2304.13104",
    "context": "Title: LSTM-based Load Forecasting Robustness Against Noise Injection Attack in Microgrid. (arXiv:2304.13104v1 [cs.LG])\nAbstract: In this paper, we investigate the robustness of an LSTM neural network against noise injection attacks for electric load forecasting in an ideal microgrid. The performance of the LSTM model is investigated under a black-box Gaussian noise attack with different SNRs. It is assumed that attackers have just access to the input data of the LSTM model. The results show that the noise attack affects the performance of the LSTM model. The load prediction means absolute error (MAE) is 0.047 MW for a healthy prediction, while this value increases up to 0.097 MW for a Gaussian noise insertion with SNR= 6 dB. To robustify the LSTM model against noise attack, a low-pass filter with optimal cut-off frequency is applied at the model's input to remove the noise attack. The filter performs better in case of noise with lower SNR and is less promising for small noises.",
    "path": "papers/23/04/2304.13104.json",
    "total_tokens": 903,
    "translated_title": "基于LSTM的微电网负荷预测对抗注入攻击的鲁棒性研究",
    "translated_abstract": "本文研究了LSTM神经网络在理想微电网中的电力负荷预测中对抗注入攻击的鲁棒性。研究了在不同信噪比下进行的黑盒高斯噪声攻击下LSTM模型的性能。假设攻击者只能访问LSTM模型的输入数据。结果表明，噪声攻击影响了LSTM模型的性能。对于正常预测，负荷预测的平均绝对误差（MAE）为0.047 MW，而对于信噪比为6 dB的高斯噪声插入，该值增加到了0.097 MW。为了使LSTM模型对噪声攻击具有鲁棒性，将最佳截止频率的低通滤波器应用于模型的输入以消除噪声攻击。该滤波器在低信噪比噪声的情况下表现更好，对于小噪声的效果较差。",
    "tldr": "本文研究了LSTM神经网络在微电网负荷预测中受到噪声注入攻击的鲁棒性。使用低通滤波器消除了攻击，以提高模型的性能。",
    "en_tdlr": "This paper investigates the robustness of LSTM neural network for electric load forecasting against noise injection attack in a microgrid. Results show that a low-pass filter with optimal cutoff frequency can effectively remove the attack and improve the model's performance."
}