{
    "title": "Optimal tie-breaking rules. (arXiv:2304.13866v1 [econ.TH])",
    "abstract": "We consider two-player contests with the possibility of ties and study the effect of different tie-breaking rules on effort. For ratio-form and difference-form contests that admit pure-strategy Nash equilibrium, we find that the effort of both players is monotone decreasing in the probability that ties are broken in favor of the stronger player. Thus, the effort-maximizing tie-breaking rule commits to breaking ties in favor of the weaker agent. With symmetric agents, we find that the equilibrium is generally symmetric and independent of the tie-breaking rule. We also study the design of random tie-breaking rules that are unbiased ex-ante and identify sufficient conditions under which breaking ties before the contest actually leads to greater expected effort than the more commonly observed practice of breaking ties after the contest.",
    "link": "http://arxiv.org/abs/2304.13866",
    "context": "Title: Optimal tie-breaking rules. (arXiv:2304.13866v1 [econ.TH])\nAbstract: We consider two-player contests with the possibility of ties and study the effect of different tie-breaking rules on effort. For ratio-form and difference-form contests that admit pure-strategy Nash equilibrium, we find that the effort of both players is monotone decreasing in the probability that ties are broken in favor of the stronger player. Thus, the effort-maximizing tie-breaking rule commits to breaking ties in favor of the weaker agent. With symmetric agents, we find that the equilibrium is generally symmetric and independent of the tie-breaking rule. We also study the design of random tie-breaking rules that are unbiased ex-ante and identify sufficient conditions under which breaking ties before the contest actually leads to greater expected effort than the more commonly observed practice of breaking ties after the contest.",
    "path": "papers/23/04/2304.13866.json",
    "total_tokens": 888,
    "translated_title": "最优的平局判定规则",
    "translated_abstract": "我们考虑了两个玩家之间可能出现平局的竞赛，并研究了不同平局判定规则对参赛者付出努力的影响。对于允许纯策略 Nash 均衡的比率型和差值型竞赛，我们发现同时参赛者的努力都是随着胜者获得平局优势的概率单调递减的。因此，使得参赛者付出最大努力的平局判定规则承诺在平局时优先选择较弱的选手胜出。针对对称的参赛者，我们发现均衡通常是对称的，并且与选用的平局判定规则无关。我们还研究了随机平局判定规则的设计，这些规则在 ex-ante上是无偏的，并确定了充分条件，使得在比赛前判定平局比比赛后判定平局可以带来更大的预期努力。",
    "tldr": "本论文研究了不同平局判定规则对参赛者付出努力的影响，发现最优的平局判定规则将优先选择较弱的选手胜出以使参赛者付出最大努力，并提出了一些设计随机平局判定规则的充分条件，可以提高竞赛的预期参与度。",
    "en_tdlr": "This paper investigates the effect of different tie-breaking rules on effort in contests with the possibility of ties and finds that the effort-maximizing tie-breaking rule commits to breaking ties in favor of the weaker agent. It also identifies sufficient conditions for the design of random tie-breaking rules that lead to greater expected effort and are unbiased ex-ante."
}