{
    "title": "Fed-MIWAE: Federated Imputation of Incomplete Data via Deep Generative Models. (arXiv:2304.08054v1 [stat.ML])",
    "abstract": "Federated learning allows for the training of machine learning models on multiple decentralized local datasets without requiring explicit data exchange. However, data pre-processing, including strategies for handling missing data, remains a major bottleneck in real-world federated learning deployment, and is typically performed locally. This approach may be biased, since the subpopulations locally observed at each center may not be representative of the overall one. To address this issue, this paper first proposes a more consistent approach to data standardization through a federated model. Additionally, we propose Fed-MIWAE, a federated version of the state-of-the-art imputation method MIWAE, a deep latent variable model for missing data imputation based on variational autoencoders. MIWAE has the great advantage of being easily trainable with classical federated aggregators. Furthermore, it is able to deal with MAR (Missing At Random) data, a more challenging missing-data mechanism th",
    "link": "http://arxiv.org/abs/2304.08054",
    "context": "Title: Fed-MIWAE: Federated Imputation of Incomplete Data via Deep Generative Models. (arXiv:2304.08054v1 [stat.ML])\nAbstract: Federated learning allows for the training of machine learning models on multiple decentralized local datasets without requiring explicit data exchange. However, data pre-processing, including strategies for handling missing data, remains a major bottleneck in real-world federated learning deployment, and is typically performed locally. This approach may be biased, since the subpopulations locally observed at each center may not be representative of the overall one. To address this issue, this paper first proposes a more consistent approach to data standardization through a federated model. Additionally, we propose Fed-MIWAE, a federated version of the state-of-the-art imputation method MIWAE, a deep latent variable model for missing data imputation based on variational autoencoders. MIWAE has the great advantage of being easily trainable with classical federated aggregators. Furthermore, it is able to deal with MAR (Missing At Random) data, a more challenging missing-data mechanism th",
    "path": "papers/23/04/2304.08054.json",
    "total_tokens": 871,
    "translated_title": "Fed-MIWAE: 通过深度生成模型联邦填补未完整数据",
    "translated_abstract": "联邦学习允许在不需要明确数据交换的情况下对多个分散的本地数据集进行机器学习模型的训练。然而，数据预处理，包括处理缺失数据的策略，仍然是在实际联邦学习部署中的一个重大瓶颈，并且通常是在本地执行的。本文提出了一种通过联邦模型更一致的方法进行数据标准化的方法。此外，我们提出了 Fed-MIWAE，这是 MIWAE 的联邦版本，它是基于变分自动编码器的缺失数据填补的深度潜变量模型。MIWAE 具有使用经典联邦聚合器进行简单训练的巨大优势。此外，它能够处理 MAR（随机未出现）数据，这是一种更具挑战性的缺失数据机制。",
    "tldr": "本论文提出了 Fed-MIWAE，这是基于联邦模型的 MIWAE 缺失数据填补的深度潜变量模型，它能够通过经典联邦聚合器进行简单训练，并具有处理 MAR 数据的能力。",
    "en_tdlr": "This paper proposes Fed-MIWAE, a deep latent variable model for missing data imputation based on variational autoencoders in a federated setting. It can be easily trained with classical federated aggregators and has the capability to handle MAR data."
}