{
    "title": "Probabilistic selection and design of concrete using machine learning. (arXiv:2304.11226v1 [cs.LG])",
    "abstract": "Development of robust concrete mixes with a lower environmental impact is challenging due to natural variability in constituent materials and a multitude of possible combinations of mix proportions. Making reliable property predictions with machine learning can facilitate performance-based specification of concrete, reducing material inefficiencies and improving the sustainability of concrete construction. In this work, we develop a machine learning algorithm that can utilize intermediate target variables and their associated noise to predict the final target variable. We apply the methodology to specify a concrete mix that has high resistance to carbonation, and another concrete mix that has low environmental impact. Both mixes also fulfill targets on the strength, density, and cost. The specified mixes are experimentally validated against their predictions. Our generic methodology enables the exploitation of noise in machine learning, which has a broad range of applications in struct",
    "link": "http://arxiv.org/abs/2304.11226",
    "context": "Title: Probabilistic selection and design of concrete using machine learning. (arXiv:2304.11226v1 [cs.LG])\nAbstract: Development of robust concrete mixes with a lower environmental impact is challenging due to natural variability in constituent materials and a multitude of possible combinations of mix proportions. Making reliable property predictions with machine learning can facilitate performance-based specification of concrete, reducing material inefficiencies and improving the sustainability of concrete construction. In this work, we develop a machine learning algorithm that can utilize intermediate target variables and their associated noise to predict the final target variable. We apply the methodology to specify a concrete mix that has high resistance to carbonation, and another concrete mix that has low environmental impact. Both mixes also fulfill targets on the strength, density, and cost. The specified mixes are experimentally validated against their predictions. Our generic methodology enables the exploitation of noise in machine learning, which has a broad range of applications in struct",
    "path": "papers/23/04/2304.11226.json",
    "total_tokens": 888,
    "translated_title": "基于机器学习的混凝土概率选择及设计",
    "translated_abstract": "在混凝土材料的固有差异和可能性组分的多样性下，开发具有更低环境影响的健壮混凝土配方是具有挑战性的。利用机器学习进行可靠的性能预测可以促进基于性能的混凝土规范的制定，减少材料的浪费并提高混凝土建筑的可持续性。本文开发了一种机器学习算法，可以利用中间目标变量及其相关的噪声来预测最终目标变量。我们将该方法应用于指定具有高抗碳化性的混凝土配合比，以及具有低环境影响的混凝土配合比。这两种混凝土配比也满足强度、密度和成本方面的目标。指定的混凝土配比已经得到实验验证。我们的通用方法使噪声在机器学习中具有广泛的应用，可用于结构和材料设计中。",
    "tldr": "本文介绍了一种利用机器学习进行混凝土配比设计和性能预测的方法，该方法可以提高混凝土建筑的可持续性，同时满足强度、密度和成本等目标。",
    "en_tdlr": "This paper presents a method for probabilistic selection and design of concrete using machine learning, which can improve the sustainability of concrete construction while fulfilling targets on strength, density, and cost. The method utilizes intermediate target variables and noise to predict the final target variable and has a broad range of applications in structure and materials design."
}