{
    "title": "ZEBRA: Z-order Curve-based Event Retrieval Approach to Efficiently Explore Automotive Data. (arXiv:2304.10232v1 [cs.IR])",
    "abstract": "Evaluating the performance of software for automated vehicles is predominantly driven by data collected from the real world. While professional test drivers are supported with technical means to semi-automatically annotate driving maneuvers to allow better event identification, simple data loggers in large vehicle fleets typically lack automatic and detailed event classification and hence, extra effort is needed when post-processing such data. Yet, the data quality from professional test drivers is apparently higher than the one from large fleets where labels are missing, but the non-annotated data set from large vehicle fleets is much more representative for typical, realistic driving scenarios to be handled by automated vehicles. However, while growing the data from large fleets is relatively simple, adding valuable annotations during post-processing has become increasingly expensive. In this paper, we leverage Z-order space-filling curves to systematically reduce data dimensionality",
    "link": "http://arxiv.org/abs/2304.10232",
    "context": "Title: ZEBRA: Z-order Curve-based Event Retrieval Approach to Efficiently Explore Automotive Data. (arXiv:2304.10232v1 [cs.IR])\nAbstract: Evaluating the performance of software for automated vehicles is predominantly driven by data collected from the real world. While professional test drivers are supported with technical means to semi-automatically annotate driving maneuvers to allow better event identification, simple data loggers in large vehicle fleets typically lack automatic and detailed event classification and hence, extra effort is needed when post-processing such data. Yet, the data quality from professional test drivers is apparently higher than the one from large fleets where labels are missing, but the non-annotated data set from large vehicle fleets is much more representative for typical, realistic driving scenarios to be handled by automated vehicles. However, while growing the data from large fleets is relatively simple, adding valuable annotations during post-processing has become increasingly expensive. In this paper, we leverage Z-order space-filling curves to systematically reduce data dimensionality",
    "path": "papers/23/04/2304.10232.json",
    "total_tokens": 848,
    "translated_title": "基于Z形曲线的事件检索方法在高效探索汽车数据中的应用",
    "translated_abstract": "评估自动驾驶软件的性能主要由现实世界收集的数据驱动。虽然专业测试驾驶员得到技术支持来半自动地注释驾驶操作，更好地识别事件，但是大型车队中的简单数据记录器通常缺乏自动和详细的事件分类，因此需要额外的后处理工作。然而，专业测试驾驶员的数据质量显然比缺少标签的大型车队更高，但大型车队的非注释数据集更具有代表性，可用于自动驾驶车辆处理的典型、现实的驾驶情景。但是，在后处理期间添加有价值的注释越来越昂贵，虽然扩大大型车队的数据相对较简单。在本文中，我们利用Z形空间填充曲线系统地减少数据维数，",
    "tldr": "本论文提出了基于Z形曲线的事件检索方法，可用于高效探索汽车数据。该方法可用于处理大型车队的非注释数据集，使自动驾驶软件更好地掌握现实场景下的驾驶情况。",
    "en_tdlr": "This paper proposes a Z-order curve-based event retrieval approach for efficiently exploring automotive data. The approach can be applied to non-annotated data sets from large vehicle fleets and helps automated driving software better grasp driving scenarios in realistic situations."
}