{
    "title": "Emotional Expression Detection in Spoken Language Employing Machine Learning Algorithms. (arXiv:2304.11040v1 [cs.SD])",
    "abstract": "There are a variety of features of the human voice that can be classified as pitch, timbre, loudness, and vocal tone. It is observed in numerous incidents that human expresses their feelings using different vocal qualities when they are speaking. The primary objective of this research is to recognize different emotions of human beings such as anger, sadness, fear, neutrality, disgust, pleasant surprise, and happiness by using several MATLAB functions namely, spectral descriptors, periodicity, and harmonicity. To accomplish the work, we analyze the CREMA-D (Crowd-sourced Emotional Multimodal Actors Data) & TESS (Toronto Emotional Speech Set) datasets of human speech. The audio file contains data that have various characteristics (e.g., noisy, speedy, slow) thereby the efficiency of the ML (Machine Learning) models increases significantly. The EMD (Empirical Mode Decomposition) is utilized for the process of signal decomposition. Then, the features are extracted through the use of severa",
    "link": "http://arxiv.org/abs/2304.11040",
    "context": "Title: Emotional Expression Detection in Spoken Language Employing Machine Learning Algorithms. (arXiv:2304.11040v1 [cs.SD])\nAbstract: There are a variety of features of the human voice that can be classified as pitch, timbre, loudness, and vocal tone. It is observed in numerous incidents that human expresses their feelings using different vocal qualities when they are speaking. The primary objective of this research is to recognize different emotions of human beings such as anger, sadness, fear, neutrality, disgust, pleasant surprise, and happiness by using several MATLAB functions namely, spectral descriptors, periodicity, and harmonicity. To accomplish the work, we analyze the CREMA-D (Crowd-sourced Emotional Multimodal Actors Data) & TESS (Toronto Emotional Speech Set) datasets of human speech. The audio file contains data that have various characteristics (e.g., noisy, speedy, slow) thereby the efficiency of the ML (Machine Learning) models increases significantly. The EMD (Empirical Mode Decomposition) is utilized for the process of signal decomposition. Then, the features are extracted through the use of severa",
    "path": "papers/23/04/2304.11040.json",
    "total_tokens": 840,
    "translated_title": "基于机器学习算法的口语情感识别",
    "translated_abstract": "人类的声音具有多种特征，如音高、音色、音量和嗓音。通过这些特征可以观察到人们在说话时使用不同的嗓音质量来表达情感。本研究的主要目标是使用多个MATLAB函数，如谱描述符、周期性和谐波，识别人类的不同情感，如愤怒、悲伤、恐惧、中立、厌恶、惊喜和快乐。为了完成这项工作，我们分析了人类语音的CREMA-D（众包情感多模态演员数据）和TESS（多伦多情感语音集）数据集。音频文件包含具有各种特征（如嘈杂、快速、缓慢）的数据，因此机器学习模型的效率显著提高。利用经验模态分解（EMD）进行信号分解的过程。然后，通过使用几个",
    "tldr": "通过使用MATLAB函数和机器学习算法，研究人员利用声音的特征来识别人类不同的情感，提高了机器学习模型的效率。"
}