{
    "title": "IoT trust and reputation: a survey and taxonomy. (arXiv:2304.06119v1 [cs.CY])",
    "abstract": "IoT is one of the fastest-growing technologies and it is estimated that more than a billion devices would be utilized across the globe by the end of 2030. To maximize the capability of these connected entities, trust and reputation among IoT entities is essential. Several trust management models have been proposed in the IoT environment; however, these schemes have not fully addressed the IoT devices features, such as devices role, device type and its dynamic behavior in a smart environment. As a result, traditional trust and reputation models are insufficient to tackle these characteristics and uncertainty risks while connecting nodes to the network. Whilst continuous study has been carried out and various articles suggest promising solutions in constrained environments, research on trust and reputation is still at its infancy. In this paper, we carry out a comprehensive literature review on state-of-the-art research on the trust and reputation of IoT devices and systems. Specifically",
    "link": "http://arxiv.org/abs/2304.06119",
    "context": "Title: IoT trust and reputation: a survey and taxonomy. (arXiv:2304.06119v1 [cs.CY])\nAbstract: IoT is one of the fastest-growing technologies and it is estimated that more than a billion devices would be utilized across the globe by the end of 2030. To maximize the capability of these connected entities, trust and reputation among IoT entities is essential. Several trust management models have been proposed in the IoT environment; however, these schemes have not fully addressed the IoT devices features, such as devices role, device type and its dynamic behavior in a smart environment. As a result, traditional trust and reputation models are insufficient to tackle these characteristics and uncertainty risks while connecting nodes to the network. Whilst continuous study has been carried out and various articles suggest promising solutions in constrained environments, research on trust and reputation is still at its infancy. In this paper, we carry out a comprehensive literature review on state-of-the-art research on the trust and reputation of IoT devices and systems. Specifically",
    "path": "papers/23/04/2304.06119.json",
    "total_tokens": 1048,
    "translated_title": "IoT 信任与声誉：一份调查和分类",
    "translated_abstract": "物联网是增长最快的技术之一，预计到2030年底，全球将利用超过十亿个设备。为了最大化这些连接实体的能力，物联网实体之间的信任和声誉至关重要。在物联网环境中已经提出了几个信任管理模型；然而，这些方案尚未充分解决物联网设备的特性，例如设备角色、设备类型以及其在智能环境中的动态行为。因此，传统的信任和声誉模型不足以应对这些特征和连接节点到网络时的不确定风险。虽然已经进行了持续的研究并且许多文章在受限环境下提出了有前途的解决方案，但是信任和声誉的研究仍处于起步阶段。在本文中，我们对物联网设备和系统的信任和声誉的现有研究进行了全面的文献综述。具体而言，我们提出了一份现有物联网信任模型和机制的调查和分类，并分析了它们的优点和缺点。我们确定了该领域的挑战和开放问题，包括需要针对资源受限的物联网设备设计高效、强健的信任和声誉管理机制，并提出了未来的研究方向。",
    "tldr": "本文通过对现有文献进行梳理，提出了一份物联网信任和声誉的调查和分类，分析了现有模型和机制的优点和缺点，提出了该领域的挑战和开放问题，并为未来的研究提供了指导方向。",
    "en_tdlr": "This survey and taxonomy provides an analysis of existing trust models and mechanisms for IoT, identifies open issues and challenges, and proposes future research directions for designing efficient and robust trust and reputation management mechanisms for resource-constrained IoT devices."
}