{
    "title": "PowerGAN: A Machine Learning Approach for Power Side-Channel Attack on Compute-in-Memory Accelerators. (arXiv:2304.11056v1 [cs.CR])",
    "abstract": "Analog compute-in-memory (CIM) accelerators are becoming increasingly popular for deep neural network (DNN) inference due to their energy efficiency and in-situ vector-matrix multiplication (VMM) capabilities. However, as the use of DNNs expands, protecting user input privacy has become increasingly important. In this paper, we identify a security vulnerability wherein an adversary can reconstruct the user's private input data from a power side-channel attack, under proper data acquisition and pre-processing, even without knowledge of the DNN model. We further demonstrate a machine learning-based attack approach using a generative adversarial network (GAN) to enhance the reconstruction. Our results show that the attack methodology is effective in reconstructing user inputs from analog CIM accelerator power leakage, even when at large noise levels and countermeasures are applied. Specifically, we demonstrate the efficacy of our approach on the U-Net for brain tumor detection in magnetic",
    "link": "http://arxiv.org/abs/2304.11056",
    "context": "Title: PowerGAN: A Machine Learning Approach for Power Side-Channel Attack on Compute-in-Memory Accelerators. (arXiv:2304.11056v1 [cs.CR])\nAbstract: Analog compute-in-memory (CIM) accelerators are becoming increasingly popular for deep neural network (DNN) inference due to their energy efficiency and in-situ vector-matrix multiplication (VMM) capabilities. However, as the use of DNNs expands, protecting user input privacy has become increasingly important. In this paper, we identify a security vulnerability wherein an adversary can reconstruct the user's private input data from a power side-channel attack, under proper data acquisition and pre-processing, even without knowledge of the DNN model. We further demonstrate a machine learning-based attack approach using a generative adversarial network (GAN) to enhance the reconstruction. Our results show that the attack methodology is effective in reconstructing user inputs from analog CIM accelerator power leakage, even when at large noise levels and countermeasures are applied. Specifically, we demonstrate the efficacy of our approach on the U-Net for brain tumor detection in magnetic",
    "path": "papers/23/04/2304.11056.json",
    "total_tokens": 918,
    "translated_title": "PowerGAN: 一种基于机器学习的计算内存加速器功耗副信道攻击技术",
    "translated_abstract": "随着深度神经网络（DNN）的不断发展，使用模拟计算内存（CIM）加速器进行DNN推理的能源效率和区块向量乘法能力变得越来越受欢迎。然而，保护用户输入隐私越来越重要。在本文中，我们发现了一种安全漏洞，即在一个适当的数据采集和预处理下，即使没有DNN模型的知识，攻击者也可以从功耗侧信道攻击重构用户的私有输入数据。我们进一步展示了一种基于机器学习的攻击方法，使用生成对抗网络（GAN）来增强重构。我们的结果表明，即使在大噪声水平和对抗措施被应用的情况下，该攻击方法在从模拟CIM加速器功耗泄漏重构用户输入方面是有效的。具体而言，我们展示了我们的方法在磁共振成像（MRI）数据中用于脑肿瘤检测的U-Net上的功效。",
    "tldr": "本文提出了一种基于机器学习的计算内存加速器功耗副信道攻击技术，可以在大噪声和对抗措施存在的情况下重构用户的私有输入数据。",
    "en_tdlr": "This paper proposes a machine learning-based power side-channel attack technique on compute-in-memory accelerators, which can reconstruct user's private input data even under large noise levels and countermeasures."
}