{
    "title": "Uncertainty Aware Neural Network from Similarity and Sensitivity. (arXiv:2304.14925v1 [cs.LG])",
    "abstract": "Researchers have proposed several approaches for neural network (NN) based uncertainty quantification (UQ). However, most of the approaches are developed considering strong assumptions. Uncertainty quantification algorithms often perform poorly in an input domain and the reason for poor performance remains unknown. Therefore, we present a neural network training method that considers similar samples with sensitivity awareness in this paper. In the proposed NN training method for UQ, first, we train a shallow NN for the point prediction. Then, we compute the absolute differences between prediction and targets and train another NN for predicting those absolute differences or absolute errors. Domains with high average absolute errors represent a high uncertainty. In the next step, we select each sample in the training set one by one and compute both prediction and error sensitivities. Then we select similar samples with sensitivity consideration and save indexes of similar samples. The ra",
    "link": "http://arxiv.org/abs/2304.14925",
    "context": "Title: Uncertainty Aware Neural Network from Similarity and Sensitivity. (arXiv:2304.14925v1 [cs.LG])\nAbstract: Researchers have proposed several approaches for neural network (NN) based uncertainty quantification (UQ). However, most of the approaches are developed considering strong assumptions. Uncertainty quantification algorithms often perform poorly in an input domain and the reason for poor performance remains unknown. Therefore, we present a neural network training method that considers similar samples with sensitivity awareness in this paper. In the proposed NN training method for UQ, first, we train a shallow NN for the point prediction. Then, we compute the absolute differences between prediction and targets and train another NN for predicting those absolute differences or absolute errors. Domains with high average absolute errors represent a high uncertainty. In the next step, we select each sample in the training set one by one and compute both prediction and error sensitivities. Then we select similar samples with sensitivity consideration and save indexes of similar samples. The ra",
    "path": "papers/23/04/2304.14925.json",
    "total_tokens": 825,
    "translated_title": "基于相似性和敏感性的不确定性感知神经网络",
    "translated_abstract": "计算神经网络（NN）不确定性的研究已有多种方法被提出。然而，大多数的方法都是基于强假设的，并且在某些输入领域中表现不佳，而表现不佳的原因尚不明确。因此，本文提出了一种考虑相似样本与敏感性感知的神经网络训练方法。在这种方法中，我们首先训练一个浅层神经网络进行点预测。然后，我们计算预测值和目标值之间的绝对差值，并训练另一个神经网络来预测这些绝对差值或者绝对误差。平均绝对误差较高的领域表示高度不确定性。在接下来的步骤中，我们逐个选择训练集中的每个样本，并计算预测和误差的敏感性。然后我们选择敏感性考虑的相似样本并保存相似样本的索引。",
    "tldr": "本文提出了一种神经网络训练方法，可以考虑相似样本与敏感性感知，有效地计算神经网络中的不确定性。",
    "en_tdlr": "This paper proposes a neural network training method that takes into account similar samples and sensitivity awareness to effectively calculate uncertainty."
}