{
    "title": "IoT Federated Blockchain Learning at the Edge. (arXiv:2304.03006v1 [cs.LG])",
    "abstract": "IoT devices are sorely underutilized in the medical field, especially within machine learning for medicine, yet they offer unrivaled benefits. IoT devices are low-cost, energy-efficient, small and intelligent devices. In this paper, we propose a distributed federated learning framework for IoT devices, more specifically for IoMT (Internet of Medical Things), using blockchain to allow for a decentralized scheme improving privacy and efficiency over a centralized system; this allows us to move from the cloud-based architectures, that are prevalent, to the edge. The system is designed for three paradigms: 1) Training neural networks on IoT devices to allow for collaborative training of a shared model whilst decoupling the learning from the dataset to ensure privacy. Training is performed in an online manner simultaneously amongst all participants, allowing for the training of actual data that may not have been present in a dataset collected in the traditional way and dynamically adapt the",
    "link": "http://arxiv.org/abs/2304.03006",
    "context": "Title: IoT Federated Blockchain Learning at the Edge. (arXiv:2304.03006v1 [cs.LG])\nAbstract: IoT devices are sorely underutilized in the medical field, especially within machine learning for medicine, yet they offer unrivaled benefits. IoT devices are low-cost, energy-efficient, small and intelligent devices. In this paper, we propose a distributed federated learning framework for IoT devices, more specifically for IoMT (Internet of Medical Things), using blockchain to allow for a decentralized scheme improving privacy and efficiency over a centralized system; this allows us to move from the cloud-based architectures, that are prevalent, to the edge. The system is designed for three paradigms: 1) Training neural networks on IoT devices to allow for collaborative training of a shared model whilst decoupling the learning from the dataset to ensure privacy. Training is performed in an online manner simultaneously amongst all participants, allowing for the training of actual data that may not have been present in a dataset collected in the traditional way and dynamically adapt the",
    "path": "papers/23/04/2304.03006.json",
    "total_tokens": 745,
    "translated_title": "边缘物联网联邦区块链学习技术",
    "translated_abstract": "物联网设备在医学领域特别是医疗机器学习方面的利用远远不够，但它们具有无可比拟的优势。本文提出了一种分布式联邦学习框架，用于IoMT（医疗物联网）的IoT设备，利用区块链实现分散式方案，提高隐私性和效率，从而从主流的基于云的架构向边缘移动。",
    "tldr": "本文提出了一种边缘计算的联邦学习框架，使用区块链实现分散式方案，从而提高隐私性和效率，可以在不泄露数据隐私的前提下，训练出更加准确、全面的医疗机器学习模型。",
    "en_tdlr": "This paper proposes a distributed federated learning framework for IoMT devices using blockchain to achieve a decentralized scheme with improved privacy and efficiency, allowing for training of more accurate and comprehensive medical machine learning models without compromising data privacy."
}