{
    "title": "Impact-Oriented Contextual Scholar Profiling using Self-Citation Graphs. (arXiv:2304.12217v2 [cs.DL] UPDATED)",
    "abstract": "Quantitatively profiling a scholar's scientific impact is important to modern research society. Current practices with bibliometric indicators (e.g., h-index), lists, and networks perform well at scholar ranking, but do not provide structured context for scholar-centric, analytical tasks such as profile reasoning and understanding. This work presents GeneticFlow (GF), a suite of novel graph-based scholar profiles that fulfill three essential requirements: structured-context, scholar-centric, and evolution-rich. We propose a framework to compute GF over large-scale academic data sources with millions of scholars. The framework encompasses a new unsupervised advisor-advisee detection algorithm, a well-engineered citation type classifier using interpretable features, and a fine-tuned graph neural network (GNN) model. Evaluations are conducted on the real-world task of scientific award inference. Experiment outcomes show that the F1 score of best GF profile significantly outperforms altern",
    "link": "http://arxiv.org/abs/2304.12217",
    "context": "Title: Impact-Oriented Contextual Scholar Profiling using Self-Citation Graphs. (arXiv:2304.12217v2 [cs.DL] UPDATED)\nAbstract: Quantitatively profiling a scholar's scientific impact is important to modern research society. Current practices with bibliometric indicators (e.g., h-index), lists, and networks perform well at scholar ranking, but do not provide structured context for scholar-centric, analytical tasks such as profile reasoning and understanding. This work presents GeneticFlow (GF), a suite of novel graph-based scholar profiles that fulfill three essential requirements: structured-context, scholar-centric, and evolution-rich. We propose a framework to compute GF over large-scale academic data sources with millions of scholars. The framework encompasses a new unsupervised advisor-advisee detection algorithm, a well-engineered citation type classifier using interpretable features, and a fine-tuned graph neural network (GNN) model. Evaluations are conducted on the real-world task of scientific award inference. Experiment outcomes show that the F1 score of best GF profile significantly outperforms altern",
    "path": "papers/23/04/2304.12217.json",
    "total_tokens": 923,
    "translated_title": "基于自引图的面向影响力的学者环境剖析",
    "translated_abstract": "定量地剖析学者的科研影响力对于现代研究社会至关重要。目前使用的文献计量指标（如h指数）、列表和网络在学者排名方面表现良好，但不提供学者相关、分析性任务的结构化背景，例如剖析和理解学者特征。本文提出了一个基于图的学者剖析工具——GeneticFlow (GF)，满足三个基本要求：结构化背景、学者为中心和丰富的进化。我们提出了一个框架，用于在包括数百万学者的大规模学术数据源上计算GF；该框架包含了一种新的无监督导师-学生检测算法、一个使用可解释特征的精心设计的引用类型分类器，以及一个经过微调的图神经网络(GNN)模型。通过对科学奖项推理的真实任务进行评估，实验结果表明，最佳GF剖析的F1得分明显优于替代方案。",
    "tldr": "本研究提出了一个名为GeneticFlow的基于自引图的学者剖析工具，能够满足学者特征剖析中的三个基本要求，即结构化背景、学者为中心和丰富的进化，在科学奖项推理真实任务中表现出色。"
}