{
    "title": "Variational Relational Point Completion Network for Robust 3D Classification. (arXiv:2304.09131v1 [cs.CV])",
    "abstract": "Real-scanned point clouds are often incomplete due to viewpoint, occlusion, and noise, which hampers 3D geometric modeling and perception. Existing point cloud completion methods tend to generate global shape skeletons and hence lack fine local details. Furthermore, they mostly learn a deterministic partial-to-complete mapping, but overlook structural relations in man-made objects. To tackle these challenges, this paper proposes a variational framework, Variational Relational point Completion Network (VRCNet) with two appealing properties: 1) Probabilistic Modeling. In particular, we propose a dual-path architecture to enable principled probabilistic modeling across partial and complete clouds. One path consumes complete point clouds for reconstruction by learning a point VAE. The other path generates complete shapes for partial point clouds, whose embedded distribution is guided by distribution obtained from the reconstruction path during training. 2) Relational Enhancement. Specifica",
    "link": "http://arxiv.org/abs/2304.09131",
    "context": "Title: Variational Relational Point Completion Network for Robust 3D Classification. (arXiv:2304.09131v1 [cs.CV])\nAbstract: Real-scanned point clouds are often incomplete due to viewpoint, occlusion, and noise, which hampers 3D geometric modeling and perception. Existing point cloud completion methods tend to generate global shape skeletons and hence lack fine local details. Furthermore, they mostly learn a deterministic partial-to-complete mapping, but overlook structural relations in man-made objects. To tackle these challenges, this paper proposes a variational framework, Variational Relational point Completion Network (VRCNet) with two appealing properties: 1) Probabilistic Modeling. In particular, we propose a dual-path architecture to enable principled probabilistic modeling across partial and complete clouds. One path consumes complete point clouds for reconstruction by learning a point VAE. The other path generates complete shapes for partial point clouds, whose embedded distribution is guided by distribution obtained from the reconstruction path during training. 2) Relational Enhancement. Specifica",
    "path": "papers/23/04/2304.09131.json",
    "total_tokens": 1029,
    "translated_title": "变分关系点补全网络用于鲁棒的3D分类",
    "translated_abstract": "实际扫描的点云通常由于视角，遮挡和噪声而不完整，这阻碍了3D几何建模和感知。现有的点云补全方法倾向于生成全局形状骨架，因此缺乏精细的局部细节。此外，它们大多学习确定性的部分到完整的映射，但忽视了人造物体中的结构关系。为了解决这些挑战，本文提出了一个变分框架，变分关系点补全网络（VRCNet），具有两个优点：1）概率建模。特别是，我们提出了一种双通路架构，以在部分点云和完整点云之间实现有原则的概率建模。一个通路使用完整点云进行重建，通过学习点VAE实现。另一个通路为局部点云生成完整的形状，其嵌入式分布在训练期间由重建通路获得的分布引导。2）关系增强。具体而言，受语法模型中语法变量的启发，我们提出了一种关系推理过程，通过探索局部补丁之间的多层特征交互来增强补全质量。对三个公共数据集的广泛实验表明，VRCNet优于现有方法。",
    "tldr": "本文提出了一个称为 VRCNet 的网络，具有两个优点：1)概率建模；2）关系增强。此网络可以用于点云补全，能够提高点云几何建模和感知的表现。",
    "en_tdlr": "This paper proposes a network called VRCNet with two appealing properties for point cloud completion: probabilistic modeling and relational enhancement, which can improve the performance of 3D geometric modeling and perception."
}