{
    "title": "Onboard Science Instrument Autonomy for the Detection of Microscopy Biosignatures on the Ocean Worlds Life Surveyor. (arXiv:2304.13189v1 [astro-ph.IM])",
    "abstract": "The quest to find extraterrestrial life is a critical scientific endeavor with civilization-level implications. Icy moons in our solar system are promising targets for exploration because their liquid oceans make them potential habitats for microscopic life. However, the lack of a precise definition of life poses a fundamental challenge to formulating detection strategies. To increase the chances of unambiguous detection, a suite of complementary instruments must sample multiple independent biosignatures (e.g., composition, motility/behavior, and visible structure). Such an instrument suite could generate 10,000x more raw data than is possible to transmit from distant ocean worlds like Enceladus or Europa. To address this bandwidth limitation, Onboard Science Instrument Autonomy (OSIA) is an emerging discipline of flight systems capable of evaluating, summarizing, and prioritizing observational instrument data to maximize science return. We describe two OSIA implementations developed a",
    "link": "http://arxiv.org/abs/2304.13189",
    "context": "Title: Onboard Science Instrument Autonomy for the Detection of Microscopy Biosignatures on the Ocean Worlds Life Surveyor. (arXiv:2304.13189v1 [astro-ph.IM])\nAbstract: The quest to find extraterrestrial life is a critical scientific endeavor with civilization-level implications. Icy moons in our solar system are promising targets for exploration because their liquid oceans make them potential habitats for microscopic life. However, the lack of a precise definition of life poses a fundamental challenge to formulating detection strategies. To increase the chances of unambiguous detection, a suite of complementary instruments must sample multiple independent biosignatures (e.g., composition, motility/behavior, and visible structure). Such an instrument suite could generate 10,000x more raw data than is possible to transmit from distant ocean worlds like Enceladus or Europa. To address this bandwidth limitation, Onboard Science Instrument Autonomy (OSIA) is an emerging discipline of flight systems capable of evaluating, summarizing, and prioritizing observational instrument data to maximize science return. We describe two OSIA implementations developed a",
    "path": "papers/23/04/2304.13189.json",
    "total_tokens": 958,
    "translated_title": "搜寻海洋世界生命探测器上用于检测显微生物生物标志的仪器自主性",
    "translated_abstract": "寻找外星生命是一项重要的科学探索，对文明级别具有影响。太阳系中的冰卫星因其液态海洋使其成为微观生命潜在寄生地，是探索重要目标。然而，生命的精确定义缺乏使制定探测策略面临基本挑战。为增加无歧义探测的机会，一套补充仪器必须对多个独立的生物标志进行采样（例如，组成，运动/行为，可见结构）。这样的仪器套件可以产生比像土卫六或木卫二这样的遥远海洋世界传输的原始数据多10,000倍。为解决这种带宽限制，机载科学仪器自主性（OSIA）是一种评估、总结和优先考虑观测仪器数据以最大化科学回报的飞行系统的新兴学科。我们描述了两个开发的OSIA实现方案。",
    "tldr": "在太阳系的冰卫星寻找外星生命，需要用一套补充仪器对多个独立的生物标志进行采样。机载科学仪器自主性（OSIA）是一种新兴学科，可以评估、总结和优先考虑观测仪器数据以最大化科学回报。",
    "en_tdlr": "In the quest for extraterrestrial life on icy moons in our solar system, a suite of complementary instruments must sample multiple independent biosignatures, and Onboard Science Instrument Autonomy (OSIA) is an emerging discipline that can evaluate, summarize, and prioritize observational instrument data to maximize science return."
}